{"2411.17260": {"publish_time": "2024-11-26", "title": "MiceBoneChallenge: Micro-CT public dataset and six solutions for automatic growth plate detection in micro-CT mice bone scans", "paper_summary": "Detecting and quantifying bone changes in micro-CT scans of rodents is a\ncommon task in preclinical drug development studies. However, this task is\nmanual, time-consuming and subject to inter- and intra-observer variability. In\n2024, Anonymous Company organized an internal challenge to develop models for\nautomatic bone quantification. We prepared and annotated a high-quality dataset\nof 3D $\\mu$CT bone scans from $83$ mice. The challenge attracted over $80$ AI\nscientists from around the globe who formed $23$ teams. The participants were\ntasked with developing a solution to identify the plane where the bone growth\nhappens, which is essential for fully automatic segmentation of trabecular\nbone. As a result, six computer vision solutions were developed that can\naccurately identify the location of the growth plate plane. The solutions\nachieved the mean absolute error of $1.91\\pm0.87$ planes from the ground truth\non the test set, an accuracy level acceptable for practical use by a\nradiologist. The annotated 3D scans dataset along with the six solutions and\nsource code, is being made public, providing researchers with opportunities to\ndevelop and benchmark their own approaches. The code, trained models, and the\ndata will be shared.", "paper_summary_zh": "在微電腦斷層掃描中偵測和量化嚙齒動物的骨骼變化，是臨床前藥物開發研究中常見的任務。然而，這項任務是手動的、耗時的，且受觀察者間和觀察者內的變異影響。2024 年，Anonymous Company 舉辦了一場內部挑戰，以開發自動化骨骼量化的模型。我們準備並註釋了一個高品質的資料集，其中包含來自 83 隻小鼠的 3D $\\mu$CT 骨骼掃描。這項挑戰吸引了來自全球超過 80 位 AI 科學家組成的 23 個團隊。參與者被賦予開發一個解決方案，以識別骨骼生長的平面，這對於完全自動化分割小樑骨至關重要。因此，開發了六個電腦視覺解決方案，可以準確識別生長板平面的位置。這些解決方案在測試集中實現了與實際情況相比平均絕對誤差為 $1.91\\pm0.87$ 個平面的準確度，這對於放射科醫師的實際使用來說是可以接受的。已公開註釋的 3D 掃描資料集以及六個解決方案和原始程式碼，為研究人員提供了開發和評估其自身方法的機會。程式碼、訓練模型和資料都將分享。", "author": "Nikolay Burlutskiy et.al.", "authors": "Nikolay Burlutskiy, Marija Kekic, Jordi de la Torre, Philipp Plewa, Mehdi Boroumand, Julia Jurkowska, Borjan Venovski, Maria Chiara Biagi, Yeman Brhane Hagos, Roksana Malinowska-Traczyk, Yibo Wang, Jacek Zalewski, Paula Sawczuk, Karlo Pintarić, Fariba Yousefi, Leif Hultin", "id": "2411.17260v1", "paper_url": "http://arxiv.org/abs/2411.17260v1", "repo": "null"}}