{"2407.16772": {"publish_time": "2024-07-23", "title": "VisMin: Visual Minimal-Change Understanding", "paper_summary": "Fine-grained understanding of objects, attributes, and relationships between\nobjects is crucial for visual-language models (VLMs). Existing benchmarks\nprimarily focus on evaluating VLMs' capability to distinguish between two very\nsimilar \\textit{captions} given an image. In this paper, we introduce a new,\nchallenging benchmark termed \\textbf{Vis}ual \\textbf{Min}imal-Change\nUnderstanding (VisMin), which requires models to predict the correct\nimage-caption match given two images and two captions. The image pair and\ncaption pair contain minimal changes, i.e., only one aspect changes at a time\nfrom among the following: \\textit{object}, \\textit{attribute}, \\textit{count},\nand \\textit{spatial relation}. These changes test the models' understanding of\nobjects, attributes (such as color, material, shape), counts, and spatial\nrelationships between objects. We built an automatic framework using large\nlanguage models and diffusion models, followed by a rigorous 4-step\nverification process by human annotators. Empirical experiments reveal that\ncurrent VLMs exhibit notable deficiencies in understanding spatial\nrelationships and counting abilities. We also generate a large-scale training\ndataset to finetune CLIP and Idefics2, showing significant improvements in\nfine-grained understanding across benchmarks and in CLIP's general image-text\nalignment. We release all resources, including the benchmark, training data,\nand finetuned model checkpoints, at \\url{https://vismin.net/}.", "paper_summary_zh": "對於視覺語言模型 (VLM) 來說，精細地理解物件、屬性以及物件之間的關係至關重要。現有的基準測試主要著重於評估 VLM 在給定影像的情況下區分兩個非常相似的「標題」的能力。在本文中，我們引入了一個新的、具有挑戰性的基準測試，稱為**視**覺**最**小變動理解 (VisMin)，它要求模型在給定兩張影像和兩個標題的情況下預測正確的影像標題配對。影像對和標題對包含最小的變動，亦即一次只變動下列其中一個面向：**物件**、**屬性**、**數量**和**空間關係**。這些變動測試模型對物件、屬性（例如顏色、材質、形狀）、數量以及物件之間空間關係的理解。我們使用大型語言模型和擴散模型建構了一個自動化架構，接著由人類註解者進行嚴謹的 4 步驟驗證程序。實證實驗顯示，目前的 VLM 在理解空間關係和計算能力方面表現出顯著的不足。我們也產生一個大型訓練資料集來微調 CLIP 和 Idefics2，顯示在基準測試和 CLIP 的一般影像文字對齊方面，精細理解有顯著的進步。我們在 \\url{https://vismin.net/} 釋出所有資源，包括基準測試、訓練資料和微調後的模型檢查點。", "author": "Rabiul Awal et.al.", "authors": "Rabiul Awal, Saba Ahmadi, Le Zhang, Aishwarya Agrawal", "id": "2407.16772v1", "paper_url": "http://arxiv.org/abs/2407.16772v1", "repo": "null"}}