{"2407.16938": {"publish_time": "2024-07-24", "title": "Synthetic Trajectory Generation Through Convolutional Neural Networks", "paper_summary": "Location trajectories provide valuable insights for applications from urban\nplanning to pandemic control. However, mobility data can also reveal sensitive\ninformation about individuals, such as political opinions, religious beliefs,\nor sexual orientations. Existing privacy-preserving approaches for publishing\nthis data face a significant utility-privacy trade-off. Releasing synthetic\ntrajectory data generated through deep learning offers a promising solution.\nDue to the trajectories' sequential nature, most existing models are based on\nrecurrent neural networks (RNNs). However, research in generative adversarial\nnetworks (GANs) largely employs convolutional neural networks (CNNs) for image\ngeneration. This discrepancy raises the question of whether advances in\ncomputer vision can be applied to trajectory generation. In this work, we\nintroduce a Reversible Trajectory-to-CNN Transformation (RTCT) that adapts\ntrajectories into a format suitable for CNN-based models. We integrated this\ntransformation with the well-known DCGAN in a proof-of-concept (PoC) and\nevaluated its performance against an RNN-based trajectory GAN using four\nmetrics across two datasets. The PoC was superior in capturing spatial\ndistributions compared to the RNN model but had difficulty replicating\nsequential and temporal properties. Although the PoC's utility is not\nsufficient for practical applications, the results demonstrate the\ntransformation's potential to facilitate the use of CNNs for trajectory\ngeneration, opening up avenues for future research. To support continued\nresearch, all source code has been made available under an open-source license.", "paper_summary_zh": "位置軌跡為從都市規劃到疫情控制等應用程式提供了有價值的見解。然而，流動性資料也可能揭露個人敏感資訊，例如政治觀點、宗教信仰或性取向。現有的隱私保護方法在發布此資料時面臨重大的效用隱私權取捨。釋出透過深度學習產生的合成軌跡資料提供了有前途的解決方案。由於軌跡的順序性質，大多數現有模型都基於遞迴神經網路 (RNN)。然而，生成對抗網路 (GAN) 的研究在很大程度上採用了卷積神經網路 (CNN) 來產生影像。這種差異引發了一個問題，即電腦視覺的進步是否可以應用於軌跡生成。在這項工作中，我們引入了可逆軌跡到 CNN 轉換 (RTCT)，它將軌跡轉換成適合基於 CNN 的模型的格式。我們在概念驗證 (PoC) 中將此轉換與著名的 DCGAN 整合，並使用四個指標在兩個資料集上評估其效能與基於 RNN 的軌跡 GAN 相比。與 RNN 模型相比，PoC 在捕捉空間分佈方面表現優異，但難以複製順序和時間屬性。儘管 PoC 的效用不足以應用於實際應用，但結果證明了轉換在促進使用 CNN 進行軌跡生成的潛力，為未來的研究打開了道路。為了支持持續的研究，所有原始程式碼已在開源授權下提供。", "author": "Jesse Merhi et.al.", "authors": "Jesse Merhi, Erik Buchholz, Salil S. Kanhere", "id": "2407.16938v1", "paper_url": "http://arxiv.org/abs/2407.16938v1", "repo": "https://github.com/jesse-merhi/CNN-TRAJGAN"}}