{"2410.10901": {"publish_time": "2024-10-13", "title": "3DS: Decomposed Difficulty Data Selection's Case Study on LLM Medical Domain Adaptation", "paper_summary": "Large Language Models(LLMs) excel in general tasks but struggle in\nspecialized domains like healthcare due to limited domain-specific\nknowledge.Supervised Fine-Tuning(SFT) data construction for domain adaptation\noften relies on heuristic methods, such as GPT-4 annotation or manual data\nselection, with a data-centric focus on presumed diverse, high-quality\ndatasets. However, these methods overlook the model's inherent knowledge\ndistribution, introducing noise, redundancy, and irrelevant data, leading to a\nmismatch between the selected data and the model's learning task, resulting in\nsuboptimal performance. To address this, we propose a two-stage model-centric\ndata selection framework, Decomposed Difficulty Data Selection (3DS), which\naligns data with the model's knowledge distribution for optimized adaptation.\nIn Stage1, we apply Prompt-Driven Data Selection via Explicit Alignment, where\nthe the model filters irrelevant or redundant data based on its internal\nknowledge. In Stage2, we perform Decomposed Difficulty Data Selection, where\ndata selection is guided by our defined difficulty decomposition, using three\nmetrics: Instruction Understanding, Response Confidence, and Response\nCorrectness. Additionally, an attention-based importance weighting mechanism\ncaptures token importance for more accurate difficulty calibration. This\ntwo-stage approach ensures the selected data is not only aligned with the\nmodel's knowledge and preferences but also appropriately challenging for the\nmodel to learn, leading to more effective and targeted domain adaptation. In\nthe case study of the medical domain, our extensive experiments on real-world\nhealthcare datasets demonstrate the superiority of 3DS over exisiting methods\nin accuracy by over 5.29%. Our dataset and code will be open-sourced at\nhttps://anonymous.4open.science/r/3DS-E67F.", "paper_summary_zh": "大型语言模型 (LLM) 在一般任务中表现出色，但在医疗保健等专业领域中却表现不佳，因为缺乏特定领域的知识。领域适应的监督微调 (SFT) 数据构建通常依赖启发式方法，例如 GPT-4 注释或手动数据选择，其数据中心化重点在于假定的多样化、高质量数据集。然而，这些方法忽略了模型固有的知识分布，引入了噪音、冗余和无关数据，导致所选数据与模型的学习任务不匹配，从而导致性能不佳。为了解决这个问题，我们提出了一种两阶段以模型为中心的数据选择框架，即分解难度数据选择 (3DS)，它使数据与模型的知识分布保持一致，以进行优化适应。在第 1 阶段，我们通过显式对齐应用提示驱动的基于数据的选择，其中模型根据其内部知识过滤无关或冗余的数据。在第 2 阶段，我们执行分解难度数据选择，其中数据选择由我们定义的难度分解指导，使用三个指标：指令理解、响应置信度和响应正确性。此外，基于注意力的重要性加权机制捕获标记重要性，以便更准确地校准难度。这种两阶段方法确保所选数据不仅与模型的知识和偏好保持一致，而且对模型学习而言也具有适当的挑战性，从而实现更有效和更有针对性的领域适应。在医学领域的案例研究中，我们在真实世界医疗保健数据集上进行的广泛实验表明，3DS 在准确性方面比现有方法高出 5.29%。我们的数据集和代码将在 https://anonymous.4open.science/r/3DS-E67F 开源。", "author": "Hongxin Ding et.al.", "authors": "Hongxin Ding, Yue Fang, Runchuan Zhu, Xinke Jiang, Jinyang Zhang, Yongxin Xu, Xu Chu, Junfeng Zhao, Yasha Wang", "id": "2410.10901v1", "paper_url": "http://arxiv.org/abs/2410.10901v1", "repo": "null"}}