{"2409.18395": {"publish_time": "2024-09-27", "title": "Code Vulnerability Repair with Large Language Model using Context-Aware Prompt Tuning", "paper_summary": "Large Language Models (LLMs) have shown significant challenges in detecting\nand repairing vulnerable code, particularly when dealing with vulnerabilities\ninvolving multiple aspects, such as variables, code flows, and code structures.\nIn this study, we utilize GitHub Copilot as the LLM and focus on buffer\noverflow vulnerabilities. Our experiments reveal a notable gap in Copilot's\nabilities when dealing with buffer overflow vulnerabilities, with a 76%\nvulnerability detection rate but only a 15% vulnerability repair rate. To\naddress this issue, we propose context-aware prompt tuning techniques designed\nto enhance LLM performance in repairing buffer overflow. By injecting a\nsequence of domain knowledge about the vulnerability, including various\nsecurity and code contexts, we demonstrate that Copilot's successful repair\nrate increases to 63%, representing more than four times the improvement\ncompared to repairs without domain knowledge.", "paper_summary_zh": "大型語言模型 (LLM) 在偵測和修復有漏洞的程式碼時顯示出顯著的挑戰，特別是在處理涉及多個面向（例如變數、程式碼流程和程式碼結構）的漏洞時。在本研究中，我們利用 GitHub Copilot 作為 LLM，並專注於緩衝區溢位漏洞。我們的實驗揭示了 Copilot 在處理緩衝區溢位漏洞時能力上的顯著差距，漏洞偵測率為 76%，但漏洞修復率僅為 15%。為了解決這個問題，我們提出情境感知提示調整技術，旨在增強 LLM 在修復緩衝區溢位時的效能。透過注入一系列關於漏洞的領域知識，包括各種安全性和程式碼情境，我們證明 Copilot 的成功修復率增加到 63%，與沒有領域知識的修復相比，改進幅度超過四倍。", "author": "Arshiya Khan et.al.", "authors": "Arshiya Khan, Guannan Liu, Xing Gao", "id": "2409.18395v1", "paper_url": "http://arxiv.org/abs/2409.18395v1", "repo": "null"}}