{"2411.17254": {"publish_time": "2024-11-26", "title": "Semantic Data Augmentation for Long-tailed Facial Expression Recognition", "paper_summary": "Facial Expression Recognition has a wide application prospect in social\nrobotics, health care, driver fatigue monitoring, and many other practical\nscenarios. Automatic recognition of facial expressions has been extensively\nstudied by the Computer Vision research society. But Facial Expression\nRecognition in real-world is still a challenging task, partially due to the\nlong-tailed distribution of the dataset. Many recent studies use data\naugmentation for Long-Tailed Recognition tasks. In this paper, we propose a\nnovel semantic augmentation method. By introducing randomness into the encoding\nof the source data in the latent space of VAE-GAN, new samples are generated.\nThen, for facial expression recognition in RAF-DB dataset, we use our\naugmentation method to balance the long-tailed distribution. Our method can be\nused in not only FER tasks, but also more diverse data-hungry scenarios.", "paper_summary_zh": "人臉表情辨識在社交機器人、醫療保健、駕駛疲勞監控以及許多其他實際場景中具有廣泛的應用前景。電腦視覺研究學會已廣泛研究人臉表情的自動辨識。但現實世界中的人臉表情辨識仍是一項具有挑戰性的任務，部分原因是資料集的長尾分佈。許多近期研究使用資料擴充進行長尾辨識任務。在本文中，我們提出了一種新穎的語義擴充方法。透過將隨機性引入 VAE-GAN 潛在空間中原始資料的編碼，產生新的樣本。然後，對於 RAF-DB 資料集中的面部表情辨識，我們使用擴充方法平衡長尾分佈。我們的這種方法不僅可用於 FER 任務，還可用於更多樣化的資料密集場景。", "author": "Zijian Li et.al.", "authors": "Zijian Li, Yan Wang, Bowen Guan, JianKai Yin", "id": "2411.17254v1", "paper_url": "http://arxiv.org/abs/2411.17254v1", "repo": "null"}}