{"2411.17116": {"publish_time": "2024-11-26", "title": "Star Attention: Efficient LLM Inference over Long Sequences", "paper_summary": "Inference with Transformer-based Large Language Models (LLMs) on long\nsequences is both costly and slow due to the quadratic complexity of the\nself-attention mechanism. We introduce Star Attention, a two-phase block-sparse\napproximation that improves computational efficiency by sharding attention\nacross multiple hosts while minimizing communication overhead. In the first\nphase, the context is processed using blockwise-local attention across hosts,\nin parallel. In the second phase, query and response tokens attend to all prior\ncached tokens through sequence-global attention. Star Attention integrates\nseamlessly with most Transformer-based LLMs trained with global attention,\nreducing memory requirements and inference time by up to 11x while preserving\n95-100% of accuracy.", "paper_summary_zh": "基於 Transformer 的大型語言模型 (LLM) 對長序列進行推論，由於自注意力機制的二次複雜度，既昂貴又緩慢。我們引入了 Star Attention，這是一種兩階段區塊稀疏近似，透過在多個主機上分片注意力，同時最大程度地減少通訊開銷，來提升運算效率。在第一階段，使用區塊局部注意力跨主機並行處理內容。在第二階段，查詢和回應權杖透過序列全局注意力關注所有先前快取的權杖。Star Attention 可與大多數使用全局注意力訓練的基於 Transformer 的 LLM 無縫整合，將記憶體需求和推論時間減少多達 11 倍，同時保留 95-100% 的準確度。", "author": "Shantanu Acharya et.al.", "authors": "Shantanu Acharya, Fei Jia, Boris Ginsburg", "id": "2411.17116v1", "paper_url": "http://arxiv.org/abs/2411.17116v1", "repo": "https://github.com/NVIDIA/Star-Attention"}}