{"2411.14858": {"publish_time": "2024-11-22", "title": "Domain and Range Aware Synthetic Negatives Generation for Knowledge Graph Embedding Models", "paper_summary": "Knowledge Graph Embedding models, representing entities and edges in a\nlow-dimensional space, have been extremely successful at solving tasks related\nto completing and exploring Knowledge Graphs (KGs). One of the key aspects of\ntraining most of these models is teaching to discriminate between true\nstatements positives and false ones (negatives). However, the way in which\nnegatives can be defined is not trivial, as facts missing from the KG are not\nnecessarily false and a set of ground truth negatives is hardly ever given.\nThis makes synthetic negative generation a necessity. Different generation\nstrategies can heavily affect the quality of the embeddings, making it a\nprimary aspect to consider. We revamp a strategy that generates corruptions\nduring training respecting the domain and range of relations, we extend its\ncapabilities and we show our methods bring substantial improvement (+10% MRR)\nfor standard benchmark datasets and over +150% MRR for a larger ontology-backed\ndataset.", "paper_summary_zh": "知識圖表嵌入模型，將實體和邊緣表示在低維空間中，在解決與完成和探索知識圖表 (KG) 相關的任務方面非常成功。訓練這些模型的主要方面之一是教導區分真實陳述的正例和虛假陳述的負例。然而，定義負例的方式並非微不足道，因為從 KG 中遺失的事實並不一定為假，而且幾乎從不給定一組真實的負例。這使得合成負例生成成為必要。不同的生成策略會嚴重影響嵌入的品質，使其成為要考慮的主要方面。我們改造了一種在訓練期間生成破壞的策略，尊重關係的網域和範圍，我們擴展了它的功能，並且我們展示了我們的方法為標準基準資料集帶來實質性的改進（+10% MRR），並且為一個較大的由本体支持的資料集帶來超過 +150% MRR。", "author": "Alberto Bernardi et.al.", "authors": "Alberto Bernardi, Luca Costabello", "id": "2411.14858v1", "paper_url": "http://arxiv.org/abs/2411.14858v1", "repo": "null"}}