{"2405.17386": {"publish_time": "2024-05-27", "title": "MindMerger: Efficient Boosting LLM Reasoning in non-English Languages", "paper_summary": "Reasoning capabilities are crucial for Large Language Models (LLMs), yet a\nnotable gap exists between English and non-English languages. To bridge this\ndisparity, some works fine-tune LLMs to relearn reasoning capabilities in\nnon-English languages, while others replace non-English inputs with an external\nmodel's outputs such as English translation text to circumvent the challenge of\nLLM understanding non-English. Unfortunately, these methods often underutilize\nthe built-in skilled reasoning and useful language understanding capabilities\nof LLMs. In order to better utilize the minds of reasoning and language\nunderstanding in LLMs, we propose a new method, namely MindMerger, which merges\nLLMs with the external language understanding capabilities from multilingual\nmodels to boost the multilingual reasoning performance. Furthermore, a two-step\ntraining scheme is introduced to first train to embeded the external\ncapabilities into LLMs and then train the collaborative utilization of the\nexternal capabilities and the built-in capabilities in LLMs. Experiments on\nthree multilingual reasoning datasets and a language understanding dataset\ndemonstrate that MindMerger consistently outperforms all baselines, especially\nin low-resource languages. Without updating the parameters of LLMs, the average\naccuracy improved by 6.7% and 8.0% across all languages and low-resource\nlanguages on the MGSM dataset, respectively.", "paper_summary_zh": "推理能力對於大型語言模型 (LLM) 至關重要，但英語與非英語語言之間存在顯著的差距。為了彌合這種差距，一些作品微調 LLM 以重新學習非英語語言中的推理能力，而另一些作品則用外部模型的輸出（例如英語翻譯文字）取代非英語輸入，以規避 LLM 理解非英語的挑戰。不幸的是，這些方法通常無法充分利用 LLM 內建的熟練推理和有用的語言理解能力。為了更好地利用 LLM 中的推理和語言理解思維，我們提出了一種新方法，即 MindMerger，它將 LLM 與多語言模型中的外部語言理解能力合併，以提升多語言推理效能。此外，引入了兩步驟訓練方案，首先訓練將外部能力嵌入 LLM 中，然後訓練 LLM 中外部能力和內建能力的協作利用。在三個多語言推理數據集和一個語言理解數據集上的實驗表明，MindMerger 在所有基準中始終表現出色，特別是在低資源語言中。在不更新 LLM 參數的情況下，在 MGSM 數據集上，所有語言和低資源語言的平均準確度分別提高了 6.7% 和 8.0%。", "author": "Zixian Huang et.al.", "authors": "Zixian Huang, Wenhao Zhu, Gong Cheng, Lei Li, Fei Yuan", "id": "2405.17386v1", "paper_url": "http://arxiv.org/abs/2405.17386v1", "repo": "null"}}