{"2412.13023": {"publish_time": "2024-12-17", "title": "Relational Neurosymbolic Markov Models", "paper_summary": "Sequential problems are ubiquitous in AI, such as in reinforcement learning\nor natural language processing. State-of-the-art deep sequential models, like\ntransformers, excel in these settings but fail to guarantee the satisfaction of\nconstraints necessary for trustworthy deployment. In contrast, neurosymbolic AI\n(NeSy) provides a sound formalism to enforce constraints in deep probabilistic\nmodels but scales exponentially on sequential problems. To overcome these\nlimitations, we introduce relational neurosymbolic Markov models (NeSy-MMs), a\nnew class of end-to-end differentiable sequential models that integrate and\nprovably satisfy relational logical constraints. We propose a strategy for\ninference and learning that scales on sequential settings, and that combines\napproximate Bayesian inference, automated reasoning, and gradient estimation.\nOur experiments show that NeSy-MMs can solve problems beyond the current\nstate-of-the-art in neurosymbolic AI and still provide strong guarantees with\nrespect to desired properties. Moreover, we show that our models are more\ninterpretable and that constraints can be adapted at test time to\nout-of-distribution scenarios.", "paper_summary_zh": "序貫問題在 AI 中無處不在，例如在強化學習或自然語言處理中。最先進的深度序列模型，如Transformer，在這些設定中表現出色，但無法保證滿足可信賴部署所需的約束。相比之下，神經符號 AI (NeSy) 提供了一個健全的形式主義來強制約束深度機率模型，但在序列問題上呈指數級擴展。為了克服這些限制，我們引入了關係神經符號馬可夫模型 (NeSy-MMs)，這是一個新的端到端可微分序列模型類別，它整合並證明滿足關係邏輯約束。我們提出了一種在序列設定中擴展的推論和學習策略，它結合了近似貝氏推論、自動推理和梯度估計。我們的實驗表明，NeSy-MMs 可以解決神經符號 AI 中當前最先進技術無法解決的問題，並且仍然提供關於所需屬性的強有力的保證。此外，我們表明我們的模型更具可解釋性，並且約束可以在測試時適應到分布外場景。", "author": "Lennert De Smet et.al.", "authors": "Lennert De Smet, Gabriele Venturato, Luc De Raedt, Giuseppe Marra", "id": "2412.13023v1", "paper_url": "http://arxiv.org/abs/2412.13023v1", "repo": "null"}}