{"2407.18716": {"publish_time": "2024-07-26", "title": "ChatSchema: A pipeline of extracting structured information with Large Multimodal Models based on schema", "paper_summary": "Objective: This study introduces ChatSchema, an effective method for\nextracting and structuring information from unstructured data in medical paper\nreports using a combination of Large Multimodal Models (LMMs) and Optical\nCharacter Recognition (OCR) based on the schema. By integrating predefined\nschema, we intend to enable LMMs to directly extract and standardize\ninformation according to the schema specifications, facilitating further data\nentry. Method: Our approach involves a two-stage process, including\nclassification and extraction for categorizing report scenarios and structuring\ninformation. We established and annotated a dataset to verify the effectiveness\nof ChatSchema, and evaluated key extraction using precision, recall, F1-score,\nand accuracy metrics. Based on key extraction, we further assessed value\nextraction. We conducted ablation studies on two LMMs to illustrate the\nimprovement of structured information extraction with different input modals\nand methods. Result: We analyzed 100 medical reports from Peking University\nFirst Hospital and established a ground truth dataset with 2,945 key-value\npairs. We evaluated ChatSchema using GPT-4o and Gemini 1.5 Pro and found a\nhigher overall performance of GPT-4o. The results are as follows: For the\nresult of key extraction, key-precision was 98.6%, key-recall was 98.5%,\nkey-F1-score was 98.6%. For the result of value extraction based on correct key\nextraction, the overall accuracy was 97.2%, precision was 95.8%, recall was\n95.8%, and F1-score was 95.8%. An ablation study demonstrated that ChatSchema\nachieved significantly higher overall accuracy and overall F1-score of\nkey-value extraction, compared to the Baseline, with increases of 26.9% overall\naccuracy and 27.4% overall F1-score, respectively.", "paper_summary_zh": "<paragraph>目標：本研究介紹 ChatSchema，這是一種有效的方法，可使用大型多模態模型 (LMM) 和基於架構的光學字元辨識 (OCR) 的組合，從醫學論文報告中的非結構化資料中萃取和建構資訊。透過整合預先定義的架構，我們打算讓 LMM 能夠根據架構規格直接萃取和標準化資訊，進而簡化後續的資料輸入。方法：我們的做法包含一個兩階段的程序，包括分類和萃取，用於分類報告場景和建構資訊。我們建立並註解了一個資料集，以驗證 ChatSchema 的有效性，並使用精確度、召回率、F1 分數和準確度指標評估關鍵萃取。根據關鍵萃取，我們進一步評估值萃取。我們對兩個 LMM 進行消融研究，以說明使用不同的輸入模態和方法改善結構化資訊萃取。結果：我們分析了來自北京大學第一醫院的 100 份醫療報告，並建立了一個包含 2,945 個鍵值對的地面實況資料集。我們使用 GPT-4o 和 Gemini 1.5 Pro 評估 ChatSchema，發現 GPT-4o 的整體表現較高。結果如下：對於關鍵萃取的結果，關鍵精確度為 98.6%，關鍵召回率為 98.5%，關鍵 F1 分數為 98.6%。對於基於正確關鍵萃取的值萃取結果，整體準確度為 97.2%，精確度為 95.8%，召回率為 95.8%，F1 分數為 95.8%。消融研究表明，與基線相比，ChatSchema 在鍵值萃取方面實現了顯著更高的整體準確度和整體 F1 分數，整體準確度提高了 26.9%，整體 F1 分數提高了 27.4%。</paragraph>", "author": "Fei Wang et.al.", "authors": "Fei Wang, Yuewen Zheng, Qin Li, Jingyi Wu, Pengfei Li, Luxia Zhang", "id": "2407.18716v1", "paper_url": "http://arxiv.org/abs/2407.18716v1", "repo": "null"}}