{"2406.12430": {"publish_time": "2024-06-18", "title": "PlanRAG: A Plan-then-Retrieval Augmented Generation for Generative Large Language Models as Decision Makers", "paper_summary": "In this paper, we conduct a study to utilize LLMs as a solution for decision\nmaking that requires complex data analysis. We define Decision QA as the task\nof answering the best decision, $d_{best}$, for a decision-making question $Q$,\nbusiness rules $R$ and a database $D$. Since there is no benchmark that can\nexamine Decision QA, we propose Decision QA benchmark, DQA. It has two\nscenarios, Locating and Building, constructed from two video games (Europa\nUniversalis IV and Victoria 3) that have almost the same goal as Decision QA.\nTo address Decision QA effectively, we also propose a new RAG technique called\nthe iterative plan-then-retrieval augmented generation (PlanRAG). Our\nPlanRAG-based LM generates the plan for decision making as the first step, and\nthe retriever generates the queries for data analysis as the second step. The\nproposed method outperforms the state-of-the-art iterative RAG method by 15.8%\nin the Locating scenario and by 7.4% in the Building scenario, respectively. We\nrelease our code and benchmark at https://github.com/myeon9h/PlanRAG.", "paper_summary_zh": "<paragraph>在本文中，我們進行一項研究，利用 LLM 作為決策的解決方案，而決策需要複雜的數據分析。我們將決策問答定義為回答最佳決策 $d_{best}$，針對決策問題 $Q$、業務規則 $R$ 和資料庫 $D$。由於沒有基準可以檢驗決策問答，因此我們提出決策問答基準，即 DQA。它有兩個情境，定位和建立，建構自兩個電子遊戲（歐陸風雲 IV 和 Victoria 3），它們的目標與決策問答幾乎相同。為了有效解決決策問答，我們也提出一個新的 RAG 技術，稱為反覆規劃後檢索擴充生成 (PlanRAG)。我們的基於 PlanRAG 的 LM 在第一步產生決策規劃，而檢索器在第二步產生資料分析的查詢。所提出的方法在定位情境中比最先進的反覆 RAG 方法高出 15.8%，在建立情境中高出 7.4%。我們在 https://github.com/myeon9h/PlanRAG 釋出我們的程式碼和基準。</paragraph>", "author": "Myeonghwa Lee et.al.", "authors": "Myeonghwa Lee, Seonho An, Min-Soo Kim", "id": "2406.12430v1", "paper_url": "http://arxiv.org/abs/2406.12430v1", "repo": "https://github.com/myeon9h/planrag"}}