{"2411.02692": {"publish_time": "2024-11-05", "title": "JPEC: A Novel Graph Neural Network for Competitor Retrieval in Financial Knowledge Graphs", "paper_summary": "Knowledge graphs have gained popularity for their ability to organize and\nanalyze complex data effectively. When combined with graph embedding\ntechniques, such as graph neural networks (GNNs), knowledge graphs become a\npotent tool in providing valuable insights. This study explores the application\nof graph embedding in identifying competitors from a financial knowledge graph.\nExisting state-of-the-art(SOTA) models face challenges due to the unique\nattributes of our knowledge graph, including directed and undirected\nrelationships, attributed nodes, and minimal annotated competitor connections.\nTo address these challenges, we propose a novel graph embedding model,\nJPEC(JPMorgan Proximity Embedding for Competitor Detection), which utilizes\ngraph neural network to learn from both first-order and second-order node\nproximity together with vital features for competitor retrieval. JPEC had\noutperformed most existing models in extensive experiments, showcasing its\neffectiveness in competitor retrieval.", "paper_summary_zh": "知識圖譜因其有效組織和分析複雜資料的能力而廣受歡迎。當與圖形嵌入技術（如圖形神經網路 (GNN)）結合使用時，知識圖譜將成為提供有價值見解的強大工具。本研究探討了圖形嵌入在從財務知識圖譜中識別競爭對手的應用。現有的最先進 (SOTA) 模型由於我們知識圖譜的獨特屬性（包括有向和無向關係、帶屬性的節點以及最少註解的競爭對手連接）而面臨挑戰。為了應對這些挑戰，我們提出了一個新穎的圖形嵌入模型 JPEC（摩根大通競爭對手檢測鄰近嵌入），它利用圖形神經網路從一階和二階節點鄰近度以及競爭對手擷取的重要特徵中學習。在廣泛的實驗中，JPEC 的表現優於大多數現有模型，展示了其在競爭對手擷取中的有效性。", "author": "Wanying Ding et.al.", "authors": "Wanying Ding, Manoj Cherukumalli, Santosh Chikoti, Vinay K. Chaudhri", "id": "2411.02692v1", "paper_url": "http://arxiv.org/abs/2411.02692v1", "repo": "null"}}