{"2407.11492": {"publish_time": "2024-07-16", "title": "MMSD-Net: Towards Multi-modal Stuttering Detection", "paper_summary": "Stuttering is a common speech impediment that is caused by irregular\ndisruptions in speech production, affecting over 70 million people across the\nworld. Standard automatic speech processing tools do not take speech ailments\ninto account and are thereby not able to generate meaningful results when\npresented with stuttered speech as input. The automatic detection of stuttering\nis an integral step towards building efficient, context-aware speech processing\nsystems. While previous approaches explore both statistical and neural\napproaches for stuttering detection, all of these methods are uni-modal in\nnature. This paper presents MMSD-Net, the first multi-modal neural framework\nfor stuttering detection. Experiments and results demonstrate that\nincorporating the visual signal significantly aids stuttering detection, and\nour model yields an improvement of 2-17% in the F1-score over existing\nstate-of-the-art uni-modal approaches.", "paper_summary_zh": "口吃是一种常见的言语障碍，是由言语产生中的不规则中断所引起的，影响了全球超过 7000 万人。标准的自动语音处理工具不会考虑言语障碍，因此在输入口吃语音时无法生成有意义的结果。口吃的自动检测是构建高效且具有情境感知的语音处理系统中不可或缺的一步。虽然先前的做法探索了统计和神经方法来进行口吃检测，但所有这些方法本质上都是单模态的。本文提出了 MMSD-Net，这是第一个用于口吃检测的多模态神经框架。实验和结果表明，结合视觉信号可以极大地帮助口吃检测，并且我们的模型在 F1 分数上比现有的最先进的单模态方法提高了 2-17%。", "author": "Liangyu Nie et.al.", "authors": "Liangyu Nie, Sudarsana Reddy Kadiri, Ruchit Agrawal", "id": "2407.11492v1", "paper_url": "http://arxiv.org/abs/2407.11492v1", "repo": "null"}}