{"2409.08919": {"publish_time": "2024-09-13", "title": "XSub: Explanation-Driven Adversarial Attack against Blackbox Classifiers via Feature Substitution", "paper_summary": "Despite its significant benefits in enhancing the transparency and\ntrustworthiness of artificial intelligence (AI) systems, explainable AI (XAI)\nhas yet to reach its full potential in real-world applications. One key\nchallenge is that XAI can unintentionally provide adversaries with insights\ninto black-box models, inevitably increasing their vulnerability to various\nattacks. In this paper, we develop a novel explanation-driven adversarial\nattack against black-box classifiers based on feature substitution, called\nXSub. The key idea of XSub is to strategically replace important features\n(identified via XAI) in the original sample with corresponding important\nfeatures from a \"golden sample\" of a different label, thereby increasing the\nlikelihood of the model misclassifying the perturbed sample. The degree of\nfeature substitution is adjustable, allowing us to control how much of the\noriginal samples information is replaced. This flexibility effectively balances\na trade-off between the attacks effectiveness and its stealthiness. XSub is\nalso highly cost-effective in that the number of required queries to the\nprediction model and the explanation model in conducting the attack is in O(1).\nIn addition, XSub can be easily extended to launch backdoor attacks in case the\nattacker has access to the models training data. Our evaluation demonstrates\nthat XSub is not only effective and stealthy but also cost-effective, enabling\nits application across a wide range of AI models.", "paper_summary_zh": "儘管可解釋 AI (XAI) 在提升人工智慧 (AI) 系統的透明度和可信度方面有顯著的優點，但 XAI 尚未在實際應用中發揮其全部潛力。一個關鍵的挑戰在於，XAI 可能無意間讓對手深入了解黑盒模型，這不可避免地會增加其遭受各種攻擊的脆弱性。在本文中，我們針對基於特徵替換的黑盒分類器開發了一種新穎的由解釋驅動的對抗性攻擊，稱為 XSub。XSub 的關鍵思想是策略性地用來自不同標籤的「黃金樣本」中對應的重要特徵來替換原始樣本中的重要特徵（透過 XAI 識別），從而增加模型對擾動樣本進行錯誤分類的可能性。特徵替換的程度是可以調整的，這讓我們能夠控制替換多少原始樣本資訊。這種靈活性有效地平衡了攻擊的有效性與隱蔽性之間的折衷。XSub 也非常具有成本效益，因為在進行攻擊時，對預測模型和解釋模型所需的查詢數量為 O(1)。此外，如果攻擊者可以存取模型的訓練資料，XSub 可以輕鬆地擴充套件以發動後門攻擊。我們的評估證明，XSub 不僅有效且隱蔽，而且具有成本效益，使其能夠應用於廣泛的 AI 模型。", "author": "Kiana Vu et.al.", "authors": "Kiana Vu, Phung Lai, Truc Nguyen", "id": "2409.08919v1", "paper_url": "http://arxiv.org/abs/2409.08919v1", "repo": "null"}}