{"2407.20177": {"publish_time": "2024-07-29", "title": "AutoScale: Automatic Prediction of Compute-optimal Data Composition for Training LLMs", "paper_summary": "To ensure performance on a diverse set of downstream tasks, LLMs are\npretrained via data mixtures over different domains. In this work, we\ndemonstrate that the optimal data composition for a fixed compute budget varies\ndepending on the scale of the training data, suggesting that the common\npractice of empirically determining an optimal composition using small-scale\nexperiments will not yield the optimal data mixtures when scaling up to the\nfinal model. To address this challenge, we propose *AutoScale*, an automated\ntool that finds a compute-optimal data composition for training at any desired\ntarget scale. AutoScale first determines the optimal composition at a small\nscale using a novel bilevel optimization framework, Direct Data Optimization\n(*DDO*), and then fits a predictor to estimate the optimal composition at\nlarger scales. The predictor's design is inspired by our theoretical analysis\nof scaling laws related to data composition, which could be of independent\ninterest. In empirical studies with pre-training 774M Decoder-only LMs (GPT-2\nLarge) on RedPajama dataset, AutoScale decreases validation perplexity at least\n25% faster than any baseline with up to 38% speed up compared to without\nreweighting, achieving the best overall performance across downstream tasks. On\npre-training Encoder-only LMs (BERT) with masked language modeling, DDO is\nshown to decrease loss on all domains while visibly improving average task\nperformance on GLUE benchmark by 8.7% and on large-scale QA dataset (SQuAD) by\n5.9% compared with without reweighting. AutoScale speeds up training by up to\n28%. Our codes are open-sourced.", "paper_summary_zh": "<paragraph>為了確保在各種下游任務上的效能，LLM 會透過不同領域的資料混合進行預先訓練。在這項工作中，我們證明了在固定的運算預算下，最佳的資料組成會依訓練資料的規模而有所不同，這表示在擴充到最終模型時，使用小規模實驗來經驗性地決定最佳組成的常見做法，將無法產生最佳的資料混合。為了應對這項挑戰，我們提出了「AutoScale」，一個自動化工具，可以為任何所需的目標規模的訓練找到一個運算最佳的資料組成。AutoScale 首先使用一種新穎的雙層次最佳化架構，直接資料最佳化（DDO），來決定小規模的最佳組成，然後擬合一個預測器來估計較大規模的最佳組成。預測器的設計靈感來自我們對與資料組成相關的規模定律的理論分析，這可能是獨立的興趣。在使用預訓練 774M 僅解碼器 LMs（GPT-2 Large）於 RedPajama 資料集進行的實證研究中，AutoScale 驗證困惑度降低的速度比任何基線快至少 25%，與不重新加權相比，速度提升多達 38%，在所有下游任務中都取得最佳的整體效能。在使用遮罩語言模型預訓練僅編碼器 LMs（BERT）時，DDO 已被證明可以減少所有領域的損失，同時在 GLUE 基準上將平均任務效能顯著提升 8.7%，在大型 QA 資料集（SQuAD）上提升 5.9%，與不重新加權相比。AutoScale 將訓練速度提升多達 28%。我們的程式碼是開源的。</paragraph>", "author": "Feiyang Kang et.al.", "authors": "Feiyang Kang, Yifan Sun, Bingbing Wen, Si Chen, Dawn Song, Rafid Mahmood, Ruoxi Jia", "id": "2407.20177v1", "paper_url": "http://arxiv.org/abs/2407.20177v1", "repo": "null"}}