{"2406.12570": {"publish_time": "2024-06-18", "title": "Applying Ensemble Methods to Model-Agnostic Machine-Generated Text Detection", "paper_summary": "In this paper, we study the problem of detecting machine-generated text when\nthe large language model (LLM) it is possibly derived from is unknown. We do so\nby apply ensembling methods to the outputs from DetectGPT classifiers (Mitchell\net al. 2023), a zero-shot model for machine-generated text detection which is\nhighly accurate when the generative (or base) language model is the same as the\ndiscriminative (or scoring) language model. We find that simple summary\nstatistics of DetectGPT sub-model outputs yield an AUROC of 0.73 (relative to\n0.61) while retaining its zero-shot nature, and that supervised learning\nmethods sharply boost the accuracy to an AUROC of 0.94 but require a training\ndataset. This suggests the possibility of further generalisation to create a\nhighly-accurate, model-agnostic machine-generated text detector.", "paper_summary_zh": "在本文中，我們探討了在不知道機器生成的文字可能來自哪個大型語言模型 (LLM) 時，偵測機器生成文字的問題。我們透過將群集方法套用在 DetectGPT 分類器的輸出上來做到這一點（Mitchell 等人，2023 年），DetectGPT 分類器是機器生成文字偵測的零次學習模型，當生成式（或基礎）語言模型與判別式（或評分）語言模型相同時，其準確度非常高。我們發現，DetectGPT 子模型輸出的簡單摘要統計數據產生了 0.73 的 AUROC（相對於 0.61），同時保留了其零次學習的特性，而監督式學習方法將準確度大幅提升至 0.94 的 AUROC，但需要一個訓練資料集。這表示有進一步概括的可能性，以建立一個高準確度、與模型無關的機器生成文字偵測器。", "author": "Ivan Ong et.al.", "authors": "Ivan Ong, Boon King Quek", "id": "2406.12570v1", "paper_url": "http://arxiv.org/abs/2406.12570v1", "repo": "null"}}