{"2501.05248": {"publish_time": "2025-01-09", "title": "Deriving Coding-Specific Sub-Models from LLMs using Resource-Efficient Pruning", "paper_summary": "Large Language Models (LLMs) have demonstrated their exceptional performance\nin various complex code generation tasks. However, their broader adoption is\nlimited by significant computational demands and high resource requirements,\nparticularly memory and processing power. To mitigate such requirements, model\npruning techniques are used to create more compact models with significantly\nfewer parameters. However, current approaches do not focus on the efficient\nextraction of programming-language-specific sub-models. In this work, we\nexplore the idea of efficiently deriving coding-specific sub-models through\nunstructured pruning (i.e., Wanda). We investigate the impact of different\ndomain-specific calibration datasets on pruning outcomes across three distinct\ndomains and extend our analysis to extracting four language-specific\nsub-models: Python, Java, C++, and JavaScript. We are the first to efficiently\nextract programming-language-specific sub-models using appropriate calibration\ndatasets while maintaining acceptable accuracy w.r.t. full models. We are also\nthe first to provide analytical evidence that domain-specific tasks activate\ndistinct regions within LLMs, supporting the creation of specialized sub-models\nthrough unstructured pruning. We believe that this work has significant\npotential to enhance LLM accessibility for coding by reducing computational\nrequirements to enable local execution on consumer-grade hardware, and\nsupporting faster inference times critical for real-time development feedback.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出其在各種複雜程式碼產生任務中的卓越效能。然而，其更廣泛的採用受到顯著的運算需求和高資源需求的限制，特別是記憶體和處理能力。為了減輕此類需求，模型剪枝技術用於建立更精簡的模型，其參數顯著減少。然而，目前的做法並未專注於程式語言特定子模型的有效提取。在這項工作中，我們探討了透過非結構化剪枝（即 Wanda）有效衍生特定於編碼的子模型的想法。我們研究了不同特定於領域的校正資料集對三個不同領域的剪枝結果的影響，並將我們的分析延伸至提取四個特定於語言的子模型：Python、Java、C++ 和 JavaScript。我們是第一個使用適當的校正資料集有效提取特定於程式語言的子模型，同時維持可接受的準確度，相對於完整的模型。我們也是第一個提供分析證據，證明特定於領域的任務會在 LLM 內啟動不同的區域，支援透過非結構化剪枝建立專門的子模型。我們相信，這項工作具有顯著的潛力，可透過降低運算需求以在消費級硬體上進行本地執行，從而增強 LLM 在編碼方面的可及性，並支援對於即時開發回饋至關重要的更快速的推論時間。", "author": "Laura Puccioni et.al.", "authors": "Laura Puccioni, Alireza Farshin, Mariano Scazzariello, Changjie Wang, Marco Chiesa, Dejan Kostic", "id": "2501.05248v1", "paper_url": "http://arxiv.org/abs/2501.05248v1", "repo": "null"}}