{"2409.05303": {"publish_time": "2024-09-09", "title": "Resource-Efficient Generative AI Model Deployment in Mobile Edge Networks", "paper_summary": "The surging development of Artificial Intelligence-Generated Content (AIGC)\nmarks a transformative era of the content creation and production. Edge servers\npromise attractive benefits, e.g., reduced service delay and backhaul traffic\nload, for hosting AIGC services compared to cloud-based solutions. However, the\nscarcity of available resources on the edge pose significant challenges in\ndeploying generative AI models. In this paper, by characterizing the resource\nand delay demands of typical generative AI models, we find that the consumption\nof storage and GPU memory, as well as the model switching delay represented by\nI/O delay during the preloading phase, are significant and vary across models.\nThese multidimensional coupling factors render it difficult to make efficient\nedge model deployment decisions. Hence, we present a collaborative edge-cloud\nframework aiming to properly manage generative AI model deployment on the edge.\nSpecifically, we formulate edge model deployment problem considering\nheterogeneous features of models as an optimization problem, and propose a\nmodel-level decision selection algorithm to solve it. It enables pooled\nresource sharing and optimizes the trade-off between resource consumption and\ndelay in edge generative AI model deployment. Simulation results validate the\nefficacy of the proposed algorithm compared with baselines, demonstrating its\npotential to reduce overall costs by providing feature-aware model deployment\ndecisions.", "paper_summary_zh": "人工智能生成內容（AIGC）的蓬勃發展標誌著內容創作與製作的轉型時代。相較於雲端解決方案，邊緣伺服器承諾提供有吸引力的優勢，例如減少服務延遲和回程傳輸流量負載，以主機 AIGC 服務。然而，邊緣上可用資源的稀缺性在部署生成式 AI 模型時帶來了重大挑戰。在本文中，透過描述典型生成式 AI 模型的資源和延遲需求，我們發現儲存和 GPU 記憶體的消耗，以及預載階段 I/O 延遲所代表的模型切換延遲，是顯著的且因模型而異。這些多維耦合因素使得難以做出有效的邊緣模型部署決策。因此，我們提出了一個協作式邊緣雲端架構，旨在適當管理邊緣上的生成式 AI 模型部署。具體來說，我們將考慮模型異質性特徵的邊緣模型部署問題制定為一個最佳化問題，並提出一個模型層級的決策選擇演算法來解決它。它能實現資源池化共享，並最佳化邊緣生成式 AI 模型部署中的資源消耗和延遲之間的權衡。模擬結果驗證了所提出的演算法與基線相比的效能，證明了它透過提供具備功能感知的模型部署決策，降低整體成本的潛力。", "author": "Yuxin Liang et.al.", "authors": "Yuxin Liang, Peng Yang, Yuanyuan He, Feng Lyu", "id": "2409.05303v1", "paper_url": "http://arxiv.org/abs/2409.05303v1", "repo": "null"}}