{"2411.17607": {"publish_time": "2024-11-26", "title": "Scaling Speech-Text Pre-training with Synthetic Interleaved Data", "paper_summary": "Speech language models (SpeechLMs) accept speech input and produce speech\noutput, allowing for more natural human-computer interaction compared to\ntext-based large language models (LLMs). Traditional approaches for developing\nSpeechLMs are constrained by the limited availability of unsupervised speech\ndata and parallel speech-text data, which are significantly less abundant than\ntext pre-training data, thereby limiting their scalability as LLMs. We propose\na novel approach to scaling speech-text pre-training by leveraging large-scale\nsynthetic interleaved data derived from text corpora, eliminating the need for\nparallel speech-text datasets. Our method efficiently constructs speech-text\ninterleaved data by sampling text spans from existing text corpora and\nsynthesizing corresponding speech spans using a text-to-token model, bypassing\nthe need to generate actual speech. We also employ a supervised speech\ntokenizer derived from an automatic speech recognition (ASR) model by\nincorporating a vector-quantized bottleneck into the encoder. This supervised\ntraining approach results in discrete speech tokens with strong semantic\npreservation even at lower sampling rates (e.g. 12.5Hz), while still\nmaintaining speech reconstruction quality. Starting from a pre-trained language\nmodel and scaling our pre-training to 1 trillion tokens (with 600B synthetic\ninterleaved speech-text data), we achieve state-of-the-art performance in\nspeech language modeling and spoken question answering, improving performance\non spoken questions tasks from the previous SOTA of 13% (Moshi) to 31%. We\nfurther demonstrate that by fine-tuning the pre-trained model with speech\ndialogue data, we can develop an end-to-end spoken chatbot that achieves\ncompetitive performance comparable to existing baselines in both conversational\nabilities and speech quality, even operating exclusively in the speech domain.", "paper_summary_zh": "語音語言模型 (SpeechLM) 接受語音輸入並產生語音輸出，與基於文字的大型語言模型 (LLM) 相比，允許更自然的電腦互動。開發 SpeechLM 的傳統方法受到無監督語音資料和平行語音文字資料有限的可用性所限制，這些資料遠少於文字預訓練資料，從而限制了它們作為 LLM 的可擴充性。我們提出了一種新的方法來擴充語音文字預訓練，方法是利用從文字語料庫中衍生的、大規模的合成交錯資料，從而消除了對平行語音文字資料集的需求。我們的模型透過從現有的文字語料庫中抽樣文字跨度，並使用文字轉換標記模型合成對應的語音跨度，有效地建構語音文字交錯資料，而無需產生實際語音。我們還透過在編碼器中加入向量量化瓶頸，採用了源自自動語音辨識 (ASR) 模型的監督式語音標記器。這種監督式訓練方法產生了離散的語音標記，即使在較低的取樣率（例如 12.5Hz）下，也能強有力地保留語意，同時還能維持語音重建品質。從預訓練的語言模型開始，並將我們的預訓練擴充到 1 兆個標記（使用 600B 合成交錯語音文字資料），我們在語音語言建模和口說問題回答中取得了最先進的效能，將口說問題任務的效能從先前的 SOTA 13%（Moshi）提升至 31%。我們進一步證明，透過使用語音對話資料微調預訓練模型，我們可以開發一個端到端的口說聊天機器人，在對話能力和語音品質方面都能達到與現有基準相當的競爭力，甚至完全在語音領域中運作。", "author": "Aohan Zeng et.al.", "authors": "Aohan Zeng, Zhengxiao Du, Mingdao Liu, Lei Zhang, Shengmin Jiang, Yuxiao Dong, Jie Tang", "id": "2411.17607v1", "paper_url": "http://arxiv.org/abs/2411.17607v1", "repo": "null"}}