{"2503.07444": {"publish_time": "2025-03-10", "title": "Divide and Conquer Self-Supervised Learning for High-Content Imaging", "paper_summary": "Self-supervised representation learning methods often fail to learn subtle or\ncomplex features, which can be dominated by simpler patterns which are much\neasier to learn. This limitation is particularly problematic in applications to\nscience and engineering, as complex features can be critical for discovery and\nanalysis. To address this, we introduce Split Component Embedding Registration\n(SpliCER), a novel architecture which splits the image into sections and\ndistils information from each section to guide the model to learn more subtle\nand complex features without compromising on simpler features. SpliCER is\ncompatible with any self-supervised loss function and can be integrated into\nexisting methods without modification. The primary contributions of this work\nare as follows: i) we demonstrate that existing self-supervised methods can\nlearn shortcut solutions when simple and complex features are both present; ii)\nwe introduce a novel self-supervised training method, SpliCER, to overcome the\nlimitations of existing methods, and achieve significant downstream performance\nimprovements; iii) we demonstrate the effectiveness of SpliCER in cutting-edge\nmedical and geospatial imaging settings. SpliCER offers a powerful new tool for\nrepresentation learning, enabling models to uncover complex features which\ncould be overlooked by other methods.", "paper_summary_zh": "<paragraph>自監督式表徵學習方法通常無法學習到細微或複雜的特徵，因為這些特徵很容易被更簡單、更容易學習的模式所掩蓋。這種限制在科學和工程應用中尤其成問題，因為複雜的特徵對於發現和分析至關重要。為了克服這個問題，我們引入了分割組件嵌入配準 (SpliCER)，這是一種將圖像分割成多個部分，並從每個部分提取資訊來引導模型學習更細微、更複雜特徵的新穎架構，同時又不影響對簡單特徵的學習。SpliCER 與任何自監督式損失函數都相容，並且可以整合到現有方法中而無需修改。這項工作的主要貢獻如下：i) 我們證明了當簡單和複雜特徵同時存在時，現有的自監督式方法可能會學習到捷徑式解法；ii) 我們引入了一種新穎的自監督式訓練方法 SpliCER，以克服現有方法的局限性，並顯著提升下游任務的效能；iii) 我們展示了 SpliCER 在尖端醫療和地理空間影像設定中的有效性。SpliCER 為表徵學習提供了一個強大的新工具，使模型能夠發現其他方法可能忽略的複雜特徵。</paragraph>\n", "author": "Lucas Farndale et.al.", "authors": "Lucas Farndale, Paul Henderson, Edward W Roberts, Ke Yuan", "id": "2503.07444v1", "paper_url": "http://arxiv.org/abs/2503.07444v1", "repo": "null"}}