{"2405.05852": {"publish_time": "2024-05-09", "title": "Pre-trained Text-to-Image Diffusion Models Are Versatile Representation Learners for Control", "paper_summary": "Embodied AI agents require a fine-grained understanding of the physical world\nmediated through visual and language inputs. Such capabilities are difficult to\nlearn solely from task-specific data. This has led to the emergence of\npre-trained vision-language models as a tool for transferring representations\nlearned from internet-scale data to downstream tasks and new domains. However,\ncommonly used contrastively trained representations such as in CLIP have been\nshown to fail at enabling embodied agents to gain a sufficiently fine-grained\nscene understanding -- a capability vital for control. To address this\nshortcoming, we consider representations from pre-trained text-to-image\ndiffusion models, which are explicitly optimized to generate images from text\nprompts and as such, contain text-conditioned representations that reflect\nhighly fine-grained visuo-spatial information. Using pre-trained text-to-image\ndiffusion models, we construct Stable Control Representations which allow\nlearning downstream control policies that generalize to complex, open-ended\nenvironments. We show that policies learned using Stable Control\nRepresentations are competitive with state-of-the-art representation learning\napproaches across a broad range of simulated control settings, encompassing\nchallenging manipulation and navigation tasks. Most notably, we show that\nStable Control Representations enable learning policies that exhibit\nstate-of-the-art performance on OVMM, a difficult open-vocabulary navigation\nbenchmark.", "paper_summary_zh": "具身人工智慧代理需要透過視覺和語言輸入，對物理世界有細緻的理解。這種能力很難僅從特定任務的資料中學習。這導致了預先訓練的視覺語言模型的出現，作為將從網路規模資料中學習到的表徵轉移到下游任務和新領域的工具。然而，已顯示出像 CLIP 中常用的對比訓練表徵，無法讓具身代理獲得足夠細緻的場景理解，而這對於控制來說是至關重要的能力。為了解決這個缺點，我們考慮了預先訓練的文字到影像擴散模型的表徵，這些表徵經過明確最佳化，以便從文字提示中產生影像，因此包含反映高度細緻視覺空間資訊的文字條件表徵。使用預先訓練的文字到影像擴散模型，我們建構了穩定的控制表徵，允許學習下游控制政策，並推廣到複雜的、開放式的環境。我們展示了使用穩定的控制表徵學習的政策，在廣泛的模擬控制設定中與最先進的表徵學習方法競爭，包括具有挑戰性的操作和導航任務。最值得注意的是，我們展示了穩定的控制表徵能讓學習政策在 OVMM 上展現最先進的效能，OVMM 是一個困難的開放式詞彙導航基準。", "author": "Gunshi Gupta et.al.", "authors": "Gunshi Gupta, Karmesh Yadav, Yarin Gal, Dhruv Batra, Zsolt Kira, Cong Lu, Tim G. J. Rudner", "id": "2405.05852v1", "paper_url": "http://arxiv.org/abs/2405.05852v1", "repo": "https://github.com/ykarmesh/stable-control-representations"}}