{"2411.14551": {"publish_time": "2024-11-21", "title": "An Experimental Study on Data Augmentation Techniques for Named Entity Recognition on Low-Resource Domains", "paper_summary": "Named Entity Recognition (NER) is a machine learning task that traditionally\nrelies on supervised learning and annotated data. Acquiring such data is often\na challenge, particularly in specialized fields like medical, legal, and\nfinancial sectors. Those are commonly referred to as low-resource domains,\nwhich comprise long-tail entities, due to the scarcity of available data. To\naddress this, data augmentation techniques are increasingly being employed to\ngenerate additional training instances from the original dataset. In this\nstudy, we evaluate the effectiveness of two prominent text augmentation\ntechniques, Mention Replacement and Contextual Word Replacement, on two\nwidely-used NER models, Bi-LSTM+CRF and BERT. We conduct experiments on four\ndatasets from low-resource domains, and we explore the impact of various\ncombinations of training subset sizes and number of augmented examples. We not\nonly confirm that data augmentation is particularly beneficial for smaller\ndatasets, but we also demonstrate that there is no universally optimal number\nof augmented examples, i.e., NER practitioners must experiment with different\nquantities in order to fine-tune their projects.", "paper_summary_zh": "命名實體辨識 (NER) 是一種機器學習任務，傳統上依賴監督式學習和標註資料。取得此類資料通常具有挑戰性，特別是在醫療、法律和金融等專業領域。這些領域通常稱為低資源網域，由於可用資料稀少，因此包含長尾實體。為了解決這個問題，資料擴充技術正日益被用於從原始資料集產生額外的訓練實例。在本研究中，我們評估了兩種著名的文字擴充技術，即提及替換和語境字詞替換，在兩個廣泛使用的 NER 模型，Bi-LSTM+CRF 和 BERT 上的有效性。我們對來自低資源網域的四個資料集進行實驗，並探討各種訓練子集大小和擴充範例數量組合的影響。我們不僅確認資料擴充對於較小的資料集特別有益，而且還證明沒有普遍最佳的擴充範例數量，即 NER 從業者必須嘗試不同的數量才能微調他們的專案。", "author": "Arthur Elwing Torres et.al.", "authors": "Arthur Elwing Torres, Edleno Silva de Moura, Altigran Soares da Silva, Mario A. Nascimento, Filipe Mesquita", "id": "2411.14551v1", "paper_url": "http://arxiv.org/abs/2411.14551v1", "repo": "null"}}