{"2502.02032": {"publish_time": "2025-02-04", "title": "Heteroscedastic Double Bayesian Elastic Net", "paper_summary": "In many practical applications, regression models are employed to uncover\nrelationships between predictors and a response variable, yet the common\nassumption of constant error variance is frequently violated. This issue is\nfurther compounded in high-dimensional settings where the number of predictors\nexceeds the sample size, necessitating regularization for effective estimation\nand variable selection. To address this problem, we propose the Heteroscedastic\nDouble Bayesian Elastic Net (HDBEN), a novel framework that jointly models the\nmean and log-variance using hierarchical Bayesian priors incorporating both\n$\\ell_1$ and $\\ell_2$ penalties. Our approach simultaneously induces sparsity\nand grouping in the regression coefficients and variance parameters, capturing\ncomplex variance structures in the data. Theoretical results demonstrate that\nproposed HDBEN achieves posterior concentration, variable selection\nconsistency, and asymptotic normality under mild conditions which justifying\nits behavior. Simulation studies further illustrate that HDBEN outperforms\nexisting methods, particularly in scenarios characterized by heteroscedasticity\nand high dimensionality.", "paper_summary_zh": "在許多實際應用中，回歸模型被用於揭示預測變數與回應變數之間的關係，然而，常態誤差變異的假設經常被違反。這個問題在高維度設定中進一步加劇，其中預測變數的數量超過樣本量，需要正則化來進行有效估計和變數選擇。為了解決這個問題，我們提出了異質變異雙貝氏彈性網路 (HDBEN)，這是一個新的框架，使用分層貝氏先驗同時對均值和對數變異建模，同時納入了 $\\ell_1$ 和 $\\ell_2$ 罰則。我們的做法同時在回歸係數和變異參數中誘導稀疏性和群組，捕捉資料中的複雜變異結構。理論結果表明，所提出的 HDBEN 在適度的條件下實現後驗集中、變數選擇一致性和漸近常態性，這證明了它的行為。模擬研究進一步說明，HDBEN 優於現有方法，特別是在以異質變異和高維度為特徵的場景中。", "author": "Masanari Kimura et.al.", "authors": "Masanari Kimura", "id": "2502.02032v1", "paper_url": "http://arxiv.org/abs/2502.02032v1", "repo": "null"}}