{"2406.11717": {"publish_time": "2024-06-17", "title": "Refusal in Language Models Is Mediated by a Single Direction", "paper_summary": "Conversational large language models are fine-tuned for both\ninstruction-following and safety, resulting in models that obey benign requests\nbut refuse harmful ones. While this refusal behavior is widespread across chat\nmodels, its underlying mechanisms remain poorly understood. In this work, we\nshow that refusal is mediated by a one-dimensional subspace, across 13 popular\nopen-source chat models up to 72B parameters in size. Specifically, for each\nmodel, we find a single direction such that erasing this direction from the\nmodel's residual stream activations prevents it from refusing harmful\ninstructions, while adding this direction elicits refusal on even harmless\ninstructions. Leveraging this insight, we propose a novel white-box jailbreak\nmethod that surgically disables refusal with minimal effect on other\ncapabilities. Finally, we mechanistically analyze how adversarial suffixes\nsuppress propagation of the refusal-mediating direction. Our findings\nunderscore the brittleness of current safety fine-tuning methods. More broadly,\nour work showcases how an understanding of model internals can be leveraged to\ndevelop practical methods for controlling model behavior.", "paper_summary_zh": "對話式大型語言模型經過微調，同時具備遵循指示和安全性，因此產生的模型會遵守良性要求，但拒絕有害要求。雖然這種拒絕行為在聊天模型中很普遍，但其底層機制仍鮮為人知。在這項工作中，我們展示拒絕是由一維子空間調解的，跨越 13 個流行的開源聊天模型，參數規模高達 72B。具體來說，對於每個模型，我們找到一個單一方向，從模型的殘差流激活中擦除此方向可防止它拒絕有害指令，而添加此方向會引發拒絕，即使是無害指令。利用此見解，我們提出了一種新穎的白盒越獄方法，該方法通過手術禁用拒絕，對其他功能的影響最小。最後，我們機械地分析了對抗性後綴如何抑制拒絕調解方向的傳播。我們的發現強調了當前安全微調方法的脆弱性。更廣泛地說，我們的研究展示了如何利用對模型內部的理解來開發控制模型行為的實用方法。", "author": "Andy Arditi et.al.", "authors": "Andy Arditi, Oscar Obeso, Aaquib Syed, Daniel Paleka, Nina Rimsky, Wes Gurnee, Neel Nanda", "id": "2406.11717v1", "paper_url": "http://arxiv.org/abs/2406.11717v1", "repo": "null"}}