{"2410.11623": {"publish_time": "2024-10-15", "title": "VidEgoThink: Assessing Egocentric Video Understanding Capabilities for Embodied AI", "paper_summary": "Recent advancements in Multi-modal Large Language Models (MLLMs) have opened\nnew avenues for applications in Embodied AI. Building on previous work,\nEgoThink, we introduce VidEgoThink, a comprehensive benchmark for evaluating\negocentric video understanding capabilities. To bridge the gap between MLLMs\nand low-level control in Embodied AI, we design four key interrelated tasks:\nvideo question-answering, hierarchy planning, visual grounding and reward\nmodeling. To minimize manual annotation costs, we develop an automatic data\ngeneration pipeline based on the Ego4D dataset, leveraging the prior knowledge\nand multimodal capabilities of GPT-4o. Three human annotators then filter the\ngenerated data to ensure diversity and quality, resulting in the VidEgoThink\nbenchmark. We conduct extensive experiments with three types of models:\nAPI-based MLLMs, open-source image-based MLLMs, and open-source video-based\nMLLMs. Experimental results indicate that all MLLMs, including GPT-4o, perform\npoorly across all tasks related to egocentric video understanding. These\nfindings suggest that foundation models still require significant advancements\nto be effectively applied to first-person scenarios in Embodied AI. In\nconclusion, VidEgoThink reflects a research trend towards employing MLLMs for\negocentric vision, akin to human capabilities, enabling active observation and\ninteraction in the complex real-world environments.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 的最新进展为具身人工智能 (Embodied AI) 中的应用开辟了新途径。在先前工作的基础上，EgoThink，我们引入了 VidEgoThink，这是一个用于评估以自我为中心的视频理解能力的综合基准。为了弥合 MLLM 和具身人工智能中的低级控制之间的差距，我们设计了四个关键的相互关联的任务：视频问答、层次规划、视觉基础和奖励建模。为了最大程度地减少人工标注成本，我们基于 Ego4D 数据集开发了一个自动数据生成管道，利用 GPT-4o 的先验知识和多模态能力。然后，三位人类注释员对生成的数据进行筛选，以确保多样性和质量，从而形成 VidEgoThink 基准。我们对三种类型的模型进行了广泛的实验：基于 API 的 MLLM、开源基于图像的 MLLM 和开源基于视频的 MLLM。实验结果表明，包括 GPT-4o 在内的所有 MLLM 在与以自我为中心的视频理解相关的所有任务中的表现都很差。这些发现表明，基础模型仍然需要显着的进步，才能有效地应用于具身人工智能中的第一人称场景。总之，VidEgoThink 反映了一种研究趋势，即利用 MLLM 进行以自我为中心的视觉，类似于人类能力，从而能够在复杂现实世界环境中进行主动观察和交互。", "author": "Sijie Cheng et.al.", "authors": "Sijie Cheng, Kechen Fang, Yangyang Yu, Sicheng Zhou, Bohao Li, Ye Tian, Tingguang Li, Lei Han, Yang Liu", "id": "2410.11623v1", "paper_url": "http://arxiv.org/abs/2410.11623v1", "repo": "null"}}