{"2404.16954": {"publish_time": "2024-04-25", "title": "Taming False Positives in Out-of-Distribution Detection with Human Feedback", "paper_summary": "Robustness to out-of-distribution (OOD) samples is crucial for safely\ndeploying machine learning models in the open world. Recent works have focused\non designing scoring functions to quantify OOD uncertainty. Setting appropriate\nthresholds for these scoring functions for OOD detection is challenging as OOD\nsamples are often unavailable up front. Typically, thresholds are set to\nachieve a desired true positive rate (TPR), e.g., $95\\%$ TPR. However, this can\nlead to very high false positive rates (FPR), ranging from 60 to 96\\%, as\nobserved in the Open-OOD benchmark. In safety-critical real-life applications,\ne.g., medical diagnosis, controlling the FPR is essential when dealing with\nvarious OOD samples dynamically. To address these challenges, we propose a\nmathematically grounded OOD detection framework that leverages expert feedback\nto \\emph{safely} update the threshold on the fly. We provide theoretical\nresults showing that it is guaranteed to meet the FPR constraint at all times\nwhile minimizing the use of human feedback. Another key feature of our\nframework is that it can work with any scoring function for OOD uncertainty\nquantification. Empirical evaluation of our system on synthetic and benchmark\nOOD datasets shows that our method can maintain FPR at most $5\\%$ while\nmaximizing TPR.", "paper_summary_zh": "對於在開放世界中安全部署機器學習模型而言，對分布外 (OOD) 樣本的穩健性至關重要。最近的研究重點在於設計評分函數來量化 OOD 不確定性。由於 OOD 樣本通常在前期無法取得，因此為這些評分函數設定適當的 OOD 檢測閾值具有挑戰性。通常，閾值會設定為達到預期的真陽性率 (TPR)，例如 95% TPR。然而，這可能會導致非常高的假陽性率 (FPR)，範圍從 60% 到 96%，正如在 Open-OOD 基準中觀察到的。在安全關鍵的實際應用中，例如醫療診斷，在動態處理各種 OOD 樣本時控制 FPR 至關重要。為了應對這些挑戰，我們提出了一個數學上合理的 OOD 檢測框架，該框架利用專家的回饋來動態地「安全地」更新閾值。我們提供理論結果，證明它保證在任何時候都符合 FPR 約束，同時最大限度地減少人工回饋的使用。我們框架的另一個關鍵特徵是它可以與任何用於 OOD 不確定性量化的評分函數一起使用。我們系統在合成和基準 OOD 資料集上的實證評估表明，我們的模型可以在最大化 TPR 的同時將 FPR 維持在最多 5%。", "author": "Harit Vishwakarma et.al.", "authors": "Harit Vishwakarma, Heguang Lin, Ramya Korlakai Vinayak", "id": "2404.16954v1", "paper_url": "http://arxiv.org/abs/2404.16954v1", "repo": "https://github.com/2454511550lin/tamefalsepositives-ood"}}