{"2502.05036": {"publish_time": "2025-02-07", "title": "nvAgent: Automated Data Visualization from Natural Language via Collaborative Agent Workflow", "paper_summary": "Natural Language to Visualization (NL2Vis) seeks to convert natural-language\ndescriptions into visual representations of given tables, empowering users to\nderive insights from large-scale data. Recent advancements in Large Language\nModels (LLMs) show promise in automating code generation to transform tabular\ndata into accessible visualizations. However, they often struggle with complex\nqueries that require reasoning across multiple tables. To address this\nlimitation, we propose a collaborative agent workflow, termed nvAgent, for\nNL2Vis. Specifically, nvAgent comprises three agents: a processor agent for\ndatabase processing and context filtering, a composer agent for planning\nvisualization generation, and a validator agent for code translation and output\nverification. Comprehensive evaluations on the new VisEval benchmark\ndemonstrate that nvAgent consistently surpasses state-of-the-art baselines,\nachieving a 7.88% improvement in single-table and a 9.23% improvement in\nmulti-table scenarios. Qualitative analyses further highlight that nvAgent\nmaintains nearly a 20% performance margin over previous models, underscoring\nits capacity to produce high-quality visual representations from complex,\nheterogeneous data sources.", "paper_summary_zh": "自然語言到視覺化 (NL2Vis) 旨在將自然語言描述轉換為給定表格的視覺化表示，使用戶能夠從大規模數據中獲取見解。大型語言模型 (LLM) 的最新進展顯示出自動化程式碼生成的希望，將表格數據轉換為可訪問的視覺化。然而，它們通常難以處理需要跨多個表格進行推理的複雜查詢。為了解決這個限制，我們提出了一個協作代理工作流程，稱為 nvAgent，用於 NL2Vis。具體來說，nvAgent 包含三個代理：一個用於資料庫處理和上下文過濾的處理器代理、一個用於規劃視覺化生成的作曲器代理和一個用於程式碼轉換和輸出驗證的驗證器代理。在新的 VisEval 基準上的綜合評估表明，nvAgent 持續超越最先進的基準，在單表中實現了 7.88% 的改進，在多表場景中實現了 9.23% 的改進。定性分析進一步強調，nvAgent 在先前模型上保持了近 20% 的效能優勢，突顯了它從複雜、異質數據源產生高品質視覺化表示的能力。", "author": "Geliang Ouyang et.al.", "authors": "Geliang Ouyang, Jingyao Chen, Zhihe Nie, Yi Gui, Yao Wan, Hongyu Zhang, Dongping Chen", "id": "2502.05036v1", "paper_url": "http://arxiv.org/abs/2502.05036v1", "repo": "null"}}