{"2502.13592": {"publish_time": "2025-02-19", "title": "Don't Stop the Multi-Party! On Generating Synthetic Multi-Party Conversations with Constraints", "paper_summary": "Multi-Party Conversations (MPCs) are widely studied across disciplines, with\nsocial media as a primary data source due to their accessibility. However,\nthese datasets raise privacy concerns and often reflect platform-specific\nproperties. For example, interactions between speakers may be limited due to\nrigid platform structures (e.g., threads, tree-like discussions), which yield\noverly simplistic interaction patterns (e.g., as a consequence of ``reply-to''\nlinks). This work explores the feasibility of generating diverse MPCs with\ninstruction-tuned Large Language Models (LLMs) by providing deterministic\nconstraints such as dialogue structure and participants' stance. We investigate\ntwo complementary strategies of leveraging LLMs in this context: (i.) LLMs as\nMPC generators, where we task the LLM to generate a whole MPC at once and (ii.)\nLLMs as MPC parties, where the LLM generates one turn of the conversation at a\ntime, provided the conversation history. We next introduce an analytical\nframework to evaluate compliance with the constraints, content quality, and\ninteraction complexity for both strategies. Finally, we assess the quality of\nobtained MPCs via human annotation and LLM-as-a-judge evaluations. We find\nstark differences among LLMs, with only some being able to generate\nhigh-quality MPCs. We also find that turn-by-turn generation yields better\nconformance to constraints and higher linguistic variability than generating\nMPCs in one pass. Nonetheless, our structural and qualitative evaluation\nindicates that both generation strategies can yield high-quality MPCs.", "paper_summary_zh": "多方對話 (MPC) 已在各學科廣泛研究，其中社群媒體因其易於取得而成為主要的資料來源。然而，這些資料集引發了隱私問題，且通常反映出特定平台的特性。例如，由於僵化的平台結構（例如，串聯、樹狀討論），發言者之間的互動可能受到限制，這會產生過於簡化的互動模式（例如，由於「回覆」連結的結果）。本研究探討了透過提供確定性的約束條件（例如，對話結構和參與者的立場）來產生多樣化 MPC 的可行性，並調整大型語言模型 (LLM) 的指示。我們研究了在這種情況下利用 LLM 的兩種互補策略：(i.) LLM 作為 MPC 產生器，我們要求 LLM 一次產生整個 MPC，以及 (ii.) LLM 作為 MPC 方，其中 LLM 在提供對話記錄的情況下產生對話的一個回合。接下來，我們引入一個分析架構來評估兩種策略的約束條件、內容品質和互動複雜性。最後，我們透過人工註解和 LLM 作為評審的評估來評估獲得的 MPC 的品質。我們發現 LLM 之間存在顯著差異，只有部分 LLM 能夠產生高品質的 MPC。我們還發現，逐回合產生比一次產生 MPC 更符合約束條件，且語言變異性更高。儘管如此，我們的結構性和品質評估表明，兩種產生策略都可以產生高品質的 MPC。", "author": "Nicolò Penzo et.al.", "authors": "Nicolò Penzo, Marco Guerini, Bruno Lepri, Goran Glavaš, Sara Tonelli", "id": "2502.13592v1", "paper_url": "http://arxiv.org/abs/2502.13592v1", "repo": "null"}}