{"2411.05963": {"publish_time": "2024-11-08", "title": "Assessing Foundational Medical 'Segment Anything' (Med-SAM1, Med-SAM2) Deep Learning Models for Left Atrial Segmentation in 3D LGE MRI", "paper_summary": "Atrial fibrillation (AF), the most common cardiac arrhythmia, is associated\nwith heart failure and stroke. Accurate segmentation of the left atrium (LA) in\n3D late gadolinium-enhanced (LGE) MRI is helpful for evaluating AF, as fibrotic\nremodeling in the LA myocardium contributes to arrhythmia and serves as a key\ndeterminant of therapeutic strategies. However, manual LA segmentation is\nlabor-intensive and challenging. Recent foundational deep learning models, such\nas the Segment Anything Model (SAM), pre-trained on diverse datasets, have\ndemonstrated promise in generic segmentation tasks. MedSAM, a fine-tuned\nversion of SAM for medical applications, enables efficient, zero-shot\nsegmentation without domain-specific training. Despite the potential of MedSAM\nmodel, it has not yet been evaluated for the complex task of LA segmentation in\n3D LGE-MRI. This study aims to (1) evaluate the performance of MedSAM in\nautomating LA segmentation, (2) compare the performance of the MedSAM2 model,\nwhich uses a single prompt with automated tracking, with the MedSAM1 model,\nwhich requires separate prompt for each slice, and (3) analyze the performance\nof MedSAM1 in terms of Dice score(i.e., segmentation accuracy) by varying the\nsize and location of the box prompt.", "paper_summary_zh": "心房顫動 (AF) 是最常見的心律不整，與心臟衰竭和中風有關。3D 晚期钆增強 (LGE) MRI 中左心房 (LA) 的精確分割有助於評估 AF，因為 LA 心肌中的纖維化重塑會導致心律不整，並作為治療策略的關鍵決定因素。然而，手動 LA 分割既費力又具有挑戰性。最近基礎深度學習模型（例如在不同資料集上預先訓練的 Segment Anything Model (SAM)）已在通用分割任務中展現出前景。MedSAM 是 SAM 的微調版本，適用於醫療應用，它能進行有效、零次學習的分割，而無需特定領域的訓練。儘管 MedSAM 模型具有潛力，但尚未評估其在 3D LGE-MRI 中 LA 分割的複雜任務。本研究旨在 (1) 評估 MedSAM 在自動化 LA 分割中的效能，(2) 比較使用單一提示和自動追蹤的 MedSAM2 模型與需要為每個切片提供單獨提示的 MedSAM1 模型的效能，以及 (3) 分析 MedSAM1 在骰子分數（即分割準確度）方面的效能，方法是改變方框提示的大小和位置。", "author": "Mehri Mehrnia et.al.", "authors": "Mehri Mehrnia, Mohamed Elbayumi, Mohammed S. M. Elbaz", "id": "2411.05963v1", "paper_url": "http://arxiv.org/abs/2411.05963v1", "repo": "null"}}