{"2410.18071": {"publish_time": "2024-10-23", "title": "TP-Eval: Tap Multimodal LLMs' Potential in Evaluation by Customizing Prompts", "paper_summary": "Recently, multimodal large language models (MLLMs) have received much\nattention for their impressive capabilities. The evaluation of MLLMs is\nbecoming critical to analyzing attributes of MLLMs and providing valuable\ninsights. However, current benchmarks overlook the problem of prompt\nsensitivity - minor prompt variations may lead to significant performance\nfluctuations. Thus, inappropriate prompts may obscure the models' capabilities,\nunderestimating the models' performance. Moreover, different models have\ndifferent preferences for different prompts, and thus, using the same prompt\nfor all models will cause evaluation bias. This paper analyzes this deficiency\nin existing benchmarks and further introduces a new evaluation framework named\nTP-Eval, which introduces a prompt customization method to reduce evaluation\nbiases and tap models' potential. TP-Eval will rewrite the original prompts to\ndifferent customized prompts for different models. In particular, we propose\nsome well-designed modules for prompt customization tailored to the scenario of\nMLLM evaluation. Extensive experiments demonstrate the effectiveness of our\napproach to uncovering models' capabilities, and TP-Eval should benefit the\ncommunity in developing more comprehensive and convincing MLLM evaluation\nbenchmarks.", "paper_summary_zh": "最近，多模态大型语言模型 (MLLM) 因其令人印象深刻的能力而备受关注。MLLM 的评估对于分析 MLLM 的属性并提供有价值的见解变得至关重要。然而，当前基准忽视了提示敏感性问题——微小的提示变化可能导致性能的显着波动。因此，不适当的提示可能会掩盖模型的能力，低估模型的性能。此外，不同的模型对不同的提示有不同的偏好，因此，对所有模型使用相同的提示会导致评估偏差。本文分析了现有基准中的这一缺陷，并进一步引入了一个名为 TP-Eval 的新评估框架，该框架引入了一种提示定制方法来减少评估偏差并挖掘模型的潜力。TP-Eval 将重写原始提示，为不同的模型提供不同的自定义提示。特别是，我们针对 MLLM 评估场景提出了一些设计精良的提示定制模块。大量的实验表明了我们方法在揭示模型能力方面的有效性，并且 TP-Eval 应该有助于社区开发更全面且令人信服的 MLLM 评估基准。", "author": "Yuxuan Xie et.al.", "authors": "Yuxuan Xie, Tianhua Li, Wenqi Shao, Kaipeng Zhang", "id": "2410.18071v1", "paper_url": "http://arxiv.org/abs/2410.18071v1", "repo": "null"}}