{"2407.09039": {"publish_time": "2024-07-12", "title": "Overcoming Catastrophic Forgetting in Tabular Data Classification: A Pseudorehearsal-based approach", "paper_summary": "Continual learning (CL) poses the important challenge of adapting to evolving\ndata distributions without forgetting previously acquired knowledge while\nconsolidating new knowledge. In this paper, we introduce a new methodology,\ncoined as Tabular-data Rehearsal-based Incremental Lifelong Learning framework\n(TRIL3), designed to address the phenomenon of catastrophic forgetting in\ntabular data classification problems. TRIL3 uses the prototype-based\nincremental generative model XuILVQ to generate synthetic data to preserve old\nknowledge and the DNDF algorithm, which was modified to run in an incremental\nway, to learn classification tasks for tabular data, without storing old\nsamples. After different tests to obtain the adequate percentage of synthetic\ndata and to compare TRIL3 with other CL available proposals, we can conclude\nthat the performance of TRIL3 outstands other options in the literature using\nonly 50% of synthetic data.", "paper_summary_zh": "持續學習 (CL) 提出了一個重要的挑戰，即在鞏固新知識的同時適應不斷變化的資料分佈，而不忘記先前獲得的知識。在本文中，我們介紹了一種新方法，稱為表格資料排練式增量終身學習架構 (TRIL3)，旨在解決表格資料分類問題中災難性遺忘的現象。TRIL3 使用基於原型的增量生成模型 XuILVQ 生成合成資料以保留舊知識，以及修改為以增量方式運行的 DNDF 演算法，以學習表格資料的分類任務，而無需儲存舊樣本。在進行不同的測試以獲得足夠比例的合成資料並將 TRIL3 與其他可用的 CL 建議進行比較後，我們可以得出結論，TRIL3 的效能優於文獻中僅使用 50% 合成資料的其他選項。", "author": "Pablo García-Santaclara et.al.", "authors": "Pablo García-Santaclara, Bruno Fernández-Castro, Rebeca P. Díaz-Redondo", "id": "2407.09039v1", "paper_url": "http://arxiv.org/abs/2407.09039v1", "repo": "null"}}