{"2408.14950": {"publish_time": "2024-08-27", "title": "NeuralOOD: Improving Out-of-Distribution Generalization Performance with Brain-machine Fusion Learning Framework", "paper_summary": "Deep Neural Networks (DNNs) have demonstrated exceptional recognition\ncapabilities in traditional computer vision (CV) tasks. However, existing CV\nmodels often suffer a significant decrease in accuracy when confronted with\nout-of-distribution (OOD) data. In contrast to these DNN models, human can\nmaintain a consistently low error rate when facing OOD scenes, partly\nattributed to the rich prior cognitive knowledge stored in the human brain.\nPrevious OOD generalization researches only focus on the single modal,\noverlooking the advantages of multimodal learning method. In this paper, we\nutilize the multimodal learning method to improve the OOD generalization and\npropose a novel Brain-machine Fusion Learning (BMFL) framework. We adopt the\ncross-attention mechanism to fuse the visual knowledge from CV model and prior\ncognitive knowledge from the human brain. Specially, we employ a pre-trained\nvisual neural encoding model to predict the functional Magnetic Resonance\nImaging (fMRI) from visual features which eliminates the need for the fMRI data\ncollection and pre-processing, effectively reduces the workload associated with\nconventional BMFL methods. Furthermore, we construct a brain transformer to\nfacilitate the extraction of knowledge inside the fMRI data. Moreover, we\nintroduce the Pearson correlation coefficient maximization regularization\nmethod into the training process, which improves the fusion capability with\nbetter constrains. Our model outperforms the DINOv2 and baseline models on the\nImageNet-1k validation dataset as well as six curated OOD datasets, showcasing\nits superior performance in diverse scenarios.", "paper_summary_zh": "深度神经網路 (DNN) 已在傳統電腦視覺 (CV) 任務中展現出非凡的辨識能力。然而，現有的 CV 模型在面對分布外 (OOD) 資料時，其準確度通常會大幅降低。與這些 DNN 模型相反的是，人類在面對 OOD 場景時，可以維持持續低錯誤率，這部分歸功於儲存在人腦中的豐富先驗認知知識。先前的 OOD 泛化研究僅專注於單一模式，而忽略了多模態學習方法的優點。在本文中，我們利用多模態學習方法來改善 OOD 泛化，並提出了一種新穎的大腦機器融合學習 (BMFL) 架構。我們採用交叉注意力機制，融合來自 CV 模型的視覺知識和來自人腦的先驗認知知識。特別是，我們採用預先訓練好的視覺神經編碼模型，從視覺特徵預測功能性磁振造影 (fMRI)，這消除了對 fMRI 資料收集和預處理的需求，有效地減少了與傳統 BMFL 方法相關的工作負擔。此外，我們建構了一個大腦轉換器，以利於從 fMRI 資料中萃取知識。此外，我們將皮爾森相關係數最大化正則化方法引入訓練過程中，這透過更好的約束改善了融合能力。我們的模型在 ImageNet-1k 驗證資料集以及六個策展的 OOD 資料集上優於 DINOv2 和基線模型，展示了其在不同場景中的優異效能。", "author": "Shuangchen Zhao et.al.", "authors": "Shuangchen Zhao, Changde Du, Hui Li, Huiguang He", "id": "2408.14950v1", "paper_url": "http://arxiv.org/abs/2408.14950v1", "repo": "null"}}