{"2412.04862": {"publish_time": "2024-12-06", "title": "EXAONE 3.5: Series of Large Language Models for Real-world Use Cases", "paper_summary": "This technical report introduces the EXAONE 3.5 instruction-tuned language\nmodels, developed and released by LG AI Research. The EXAONE 3.5 language\nmodels are offered in three configurations: 32B, 7.8B, and 2.4B. These models\nfeature several standout capabilities: 1) exceptional instruction following\ncapabilities in real-world scenarios, achieving the highest scores across seven\nbenchmarks, 2) outstanding long-context comprehension, attaining the top\nperformance in four benchmarks, and 3) competitive results compared to\nstate-of-the-art open models of similar sizes across nine general benchmarks.\nThe EXAONE 3.5 language models are open to anyone for research purposes and can\nbe downloaded from https://huggingface.co/LGAI-EXAONE. For commercial use,\nplease reach out to the official contact point of LG AI Research:\ncontact_us@lgresearch.ai.", "paper_summary_zh": "這份技術報告介紹了 LG AI Research 開發並發布的 EXAONE 3.5 指令調整語言模型。EXAONE 3.5 語言模型提供三種配置：32B、7.8B 和 2.4B。這些模型具有幾項傑出的功能：1) 在現實世界場景中具有出色的指令遵循能力，在七項基準測試中獲得最高分，2) 出色的長語境理解能力，在四項基準測試中獲得最高績效，以及 3) 與九項一般基準測試中類似規模的最新開放模型相比具有競爭力的結果。EXAONE 3.5 語言模型對任何研究目的開放，可從 https://huggingface.co/LGAI-EXAONE 下載。如要商業使用，請聯繫 LG AI Research 的官方聯絡點：contact_us@lgresearch.ai。", "author": "LG AI Research et.al.", "authors": "LG AI Research, Soyoung An, Kyunghoon Bae, Eunbi Choi, Kibong Choi, Stanley Jungkyu Choi, Seokhee Hong, Junwon Hwang, Hyojin Jeon, Gerrard Jeongwon Jo, Hyunjik Jo, Jiyeon Jung, Yountae Jung, Hyosang Kim, Joonkee Kim, Seonghwan Kim, Soyeon Kim, Sunkyoung Kim, Yireun Kim, Yongil Kim, Youchul Kim, Edward Hwayoung Lee, Haeju Lee, Honglak Lee, Jinsik Lee, Kyungmin Lee, Woohyung Lim, Sangha Park, Sooyoun Park, Yongmin Park, Sihoon Yang, Heuiyeen Yeen, Hyeongu Yun", "id": "2412.04862v1", "paper_url": "http://arxiv.org/abs/2412.04862v1", "repo": "null"}}