{"2411.19230": {"publish_time": "2024-11-28", "title": "Pre-Training Graph Contrastive Masked Autoencoders are Strong Distillers for EEG", "paper_summary": "Effectively utilizing extensive unlabeled high-density EEG data to improve\nperformance in scenarios with limited labeled low-density EEG data presents a\nsignificant challenge. In this paper, we address this by framing it as a graph\ntransfer learning and knowledge distillation problem. We propose a Unified\nPre-trained Graph Contrastive Masked Autoencoder Distiller, named EEG-DisGCMAE,\nto bridge the gap between unlabeled/labeled and high/low-density EEG data. To\nfully leverage the abundant unlabeled EEG data, we introduce a novel unified\ngraph self-supervised pre-training paradigm, which seamlessly integrates Graph\nContrastive Pre-training and Graph Masked Autoencoder Pre-training. This\napproach synergistically combines contrastive and generative pre-training\ntechniques by reconstructing contrastive samples and contrasting the\nreconstructions. For knowledge distillation from high-density to low-density\nEEG data, we propose a Graph Topology Distillation loss function, allowing a\nlightweight student model trained on low-density data to learn from a teacher\nmodel trained on high-density data, effectively handling missing electrodes\nthrough contrastive distillation. To integrate transfer learning and\ndistillation, we jointly pre-train the teacher and student models by\ncontrasting their queries and keys during pre-training, enabling robust\ndistillers for downstream tasks. We demonstrate the effectiveness of our method\non four classification tasks across two clinical EEG datasets with abundant\nunlabeled data and limited labeled data. The experimental results show that our\napproach significantly outperforms contemporary methods in both efficiency and\naccuracy.", "paper_summary_zh": "<paragraph>有效利用大量未標籤的高密度腦電圖資料，以改善標籤資料有限的低密度腦電圖資料情境中的效能，是一項重大的挑戰。在本文中，我們將其視為圖形傳輸學習與知識萃取問題來探討。我們提出一個統一的預訓練圖形對比遮罩自動編碼器萃取器，稱為 EEG-DisGCMAE，以彌合未標籤/標籤和高/低密度腦電圖資料之間的差距。為了充分利用大量的未標籤腦電圖資料，我們引入了一個新穎的統一圖形自我監督預訓練範例，它無縫整合了圖形對比預訓練和圖形遮罩自動編碼器預訓練。此方法透過重建對比樣本和對比重建結果，協同結合了對比和生成預訓練技術。對於從高密度到低密度腦電圖資料的知識萃取，我們提出了一個圖形拓撲萃取損失函數，允許在低密度資料上訓練的輕量級學生模型從在高密度資料上訓練的老師模型中學習，透過對比萃取有效處理遺失的電極。為了整合傳輸學習和萃取，我們透過在預訓練期間對比它們的查詢和金鑰，共同預訓練老師和學生模型，為下游任務啟用穩健的萃取器。我們在兩個臨床腦電圖資料集上展示了我們的方法在四個分類任務中的有效性，這些資料集具有大量的未標籤資料和有限的標籤資料。實驗結果表明，我們的做法在效率和準確性方面都顯著優於當代方法。</paragraph>", "author": "Xinxu Wei et.al.", "authors": "Xinxu Wei, Kanhao Zhao, Yong Jiao, Nancy B. Carlisle, Hua Xie, Yu Zhang", "id": "2411.19230v1", "paper_url": "http://arxiv.org/abs/2411.19230v1", "repo": "null"}}