{"2405.15164": {"publish_time": "2024-05-24", "title": "From Frege to chatGPT: Compositionality in language, cognition, and deep neural networks", "paper_summary": "Compositionality has long been considered a key explanatory property\nunderlying human intelligence: arbitrary concepts can be composed into novel\ncomplex combinations, permitting the acquisition of an open ended, potentially\ninfinite expressive capacity from finite learning experiences. Influential\narguments have held that neural networks fail to explain this aspect of\nbehavior, leading many to dismiss them as viable models of human cognition.\nOver the last decade, however, modern deep neural networks (DNNs), which share\nthe same fundamental design principles as their predecessors, have come to\ndominate artificial intelligence, exhibiting the most advanced cognitive\nbehaviors ever demonstrated in machines. In particular, large language models\n(LLMs), DNNs trained to predict the next word on a large corpus of text, have\nproven capable of sophisticated behaviors such as writing syntactically complex\nsentences without grammatical errors, producing cogent chains of reasoning, and\neven writing original computer programs -- all behaviors thought to require\ncompositional processing. In this chapter, we survey recent empirical work from\nmachine learning for a broad audience in philosophy, cognitive science, and\nneuroscience, situating recent breakthroughs within the broader context of\nphilosophical arguments about compositionality. In particular, our review\nemphasizes two approaches to endowing neural networks with compositional\ngeneralization capabilities: (1) architectural inductive biases, and (2)\nmetalearning, or learning to learn. We also present findings suggesting that\nLLM pretraining can be understood as a kind of metalearning, and can thereby\nequip DNNs with compositional generalization abilities in a similar way. We\nconclude by discussing the implications that these findings may have for the\nstudy of compositionality in human cognition and by suggesting avenues for\nfuture research.", "paper_summary_zh": "組合性長期以來被認為是人類智能背後的一項關鍵解釋性特質：任意的概念可以組合成新穎的複雜組合，允許從有限的學習經驗中獲得開放式、潛在無限的表達能力。有影響力的論點認為，神經網路無法解釋行為的這個面向，導致許多人將它們視為人類認知的可行模型。然而，在過去十年中，現代深度神經網路 (DNN) 與其前身共享相同的基礎設計原理，已開始主導人工智慧，展現出機器有史以來最先進的認知行為。特別是，大型語言模型 (LLM) 是在大量文本語料庫中訓練來預測下一個單字的 DNN，已被證明具備複雜的行為，例如撰寫語法上沒有錯誤的句法複雜句子、產生有力的推理鏈，甚至撰寫原始電腦程式，這些行為都被認為需要組合處理。在本章中，我們針對哲學、認知科學和神經科學的廣泛受眾調查了機器學習的最新實證研究，將最近的突破置於關於組合性的哲學論點的更廣泛背景中。特別是，我們的評論強調了兩種賦予神經網路組合泛化能力的方法：(1) 架構歸納偏差，以及 (2) 元學習，或學習學習。我們也提出研究結果，表明 LLM 預訓練可以理解為一種元學習，從而可以用類似的方式為 DNN 提供組合泛化能力。我們最後討論這些發現可能對人類認知中組合性的研究有何影響，並建議未來的研究途徑。", "author": "Jacob Russin et.al.", "authors": "Jacob Russin, Sam Whitman McGrath, Danielle J. Williams, Lotem Elber-Dorozko", "id": "2405.15164v1", "paper_url": "http://arxiv.org/abs/2405.15164v1", "repo": "null"}}