{"2412.03390": {"publish_time": "2024-12-04", "title": "Enhancing Supply Chain Visibility with Generative AI: An Exploratory Case Study on Relationship Prediction in Knowledge Graphs", "paper_summary": "A key stumbling block in effective supply chain risk management for companies\nand policymakers is a lack of visibility on interdependent supply network\nrelationships. Relationship prediction, also called link prediction is an\nemergent area of supply chain surveillance research that aims to increase the\nvisibility of supply chains using data-driven techniques. Existing methods have\nbeen successful for predicting relationships but struggle to extract the\ncontext in which these relationships are embedded - such as the products being\nsupplied or locations they are supplied from. Lack of context prevents\npractitioners from distinguishing transactional relations from established\nsupply chain relations, hindering accurate estimations of risk. In this work,\nwe develop a new Generative Artificial Intelligence (Gen AI) enhanced machine\nlearning framework that leverages pre-trained language models as embedding\nmodels combined with machine learning models to predict supply chain\nrelationships within knowledge graphs. By integrating Generative AI techniques,\nour approach captures the nuanced semantic relationships between entities,\nthereby improving supply chain visibility and facilitating more precise risk\nmanagement. Using data from a real case study, we show that GenAI-enhanced link\nprediction surpasses all benchmarks, and demonstrate how GenAI models can be\nexplored and effectively used in supply chain risk management.", "paper_summary_zh": "供應鏈風險管理中的一個關鍵障礙在於企業和政策制定者缺乏對相互依存供應網路關係的能見度。關係預測，也稱為連結預測，是供應鏈監控研究中一個新興領域，旨在使用資料驅動技術提高供應鏈的能見度。現有方法已成功預測關係，但難以提取這些關係所嵌入的背景，例如所供應的產品或供應地點。缺乏背景會妨礙從業者區分交易關係和既定的供應鏈關係，進而阻礙風險的準確評估。在這項工作中，我們開發了一個新的生成式人工智慧 (Gen AI) 增強機器學習架構，它利用預先訓練的語言模型作為嵌入模型，並結合機器學習模型來預測知識圖譜中的供應鏈關係。透過整合生成式 AI 技術，我們的做法捕捉到實體之間細微的語義關係，從而提高供應鏈能見度並促進更精確的風險管理。使用來自真實案例研究的資料，我們證明 GenAI 增強連結預測優於所有基準，並展示如何探索和有效地在供應鏈風險管理中使用 GenAI 模型。", "author": "Ge Zheng et.al.", "authors": "Ge Zheng, Alexandra Brintrup", "id": "2412.03390v1", "paper_url": "http://arxiv.org/abs/2412.03390v1", "repo": "null"}}