{"2411.14121": {"publish_time": "2024-11-21", "title": "Learning from \"Silly\" Questions Improves Large Language Models, But Only Slightly", "paper_summary": "Constructing high-quality Supervised Fine-Tuning (SFT) datasets is critical\nfor the training of large language models (LLMs). Recent studies have shown\nthat using data from a specific source, Ruozhiba, a Chinese website where users\nask \"silly\" questions to better understand certain topics, can lead to better\nfine-tuning performance. This paper aims to explore some hidden factors: the\npotential interpretations of its success and a large-scale evaluation of the\nperformance. First, we leverage GPT-4 to analyze the successful cases of\nRuozhiba questions from the perspective of education, psychology, and cognitive\nscience, deriving a set of explanatory rules. Then, we construct fine-tuning\ndatasets by applying these rules to the MMLU training set. Surprisingly, our\nresults indicate that rules can significantly improve model performance in\ncertain tasks, while potentially diminishing performance on others. For\nexample, SFT data generated following the \"Counterintuitive Thinking\" rule can\nachieve approximately a 5% improvement on the \"Global Facts\" task, whereas the\n\"Blurring the Conceptual Boundaries\" rule leads to a performance drop of 6.14%\non the \"Econometrics\" task. In addition, for specific tasks, different rules\ntend to have a consistent impact on model performance. This suggests that the\ndifferences between the extracted rules are not as significant, and the\neffectiveness of the rules is relatively consistent across tasks. Our research\nhighlights the importance of considering task diversity and rule applicability\nwhen constructing SFT datasets to achieve more comprehensive performance\nimprovements.", "paper_summary_zh": "<paragraph>建構高品質的監督式微調 (SFT) 資料集對於訓練大型語言模型 (LLM) 至關重要。最近的研究顯示，使用來自特定來源的資料，例如 Ruozhiba，一個使用者提出「愚蠢」問題以更深入了解特定主題的中文網站，可以提升微調的效能。本文旨在探討一些隱藏的因素：成功背後的潛在詮釋以及效能的大規模評估。首先，我們利用 GPT-4 從教育、心理學和認知科學的角度分析 Ruozhiba 問題的成功案例，推導出一組解釋性規則。接著，我們將這些規則套用至 MMLU 訓練集，建構微調資料集。令人驚訝的是，我們的結果顯示規則可以顯著提升模型在特定任務中的效能，但可能會降低其他任務的效能。例如，遵循「反直覺思考」規則產生的 SFT 資料，在「全球事實」任務中可以提升約 5%，而「模糊概念界線」規則則導致「計量經濟學」任務的效能下降 6.14%。此外，對於特定任務，不同的規則往往對模型效能產生一致的影響。這表示提取出的規則之間的差異並不明顯，而且規則的有效性在各項任務中相對一致。我們的研究強調在建構 SFT 資料集時，考量任務的多樣性和規則的適用性非常重要，才能達成更全面的效能提升。</paragraph>", "author": "Tingyuan Zhu et.al.", "authors": "Tingyuan Zhu, Shudong Liu, Yidong Wang, Derek F. Wong, Han Yu, Takahiro Shinozaki, Jindong Wang", "id": "2411.14121v1", "paper_url": "http://arxiv.org/abs/2411.14121v1", "repo": "null"}}