{"2410.02203": {"publish_time": "2024-10-03", "title": "GraphIC: A Graph-Based In-Context Example Retrieval Model for Multi-Step Reasoning", "paper_summary": "In-context learning (ICL) enables large language models (LLMs) to generalize\nto new tasks by incorporating a few in-context examples (ICEs) directly in the\ninput, without updating parameters. However, the effectiveness of ICL heavily\nrelies on the selection of ICEs, and conventional text-based embedding methods\nare often inadequate for tasks that require multi-step reasoning, such as\nmathematical and logical problem solving. This is due to the bias introduced by\nshallow semantic similarities that fail to capture the deeper reasoning\nstructures required for these tasks. We present GraphIC, a novel approach that\nleverages graph-based representations of reasoning processes, coupled with\nBayesian Networks (BNs) to select ICEs. Graph structures inherently filter out\nshallow semantics while preserving the core reasoning structure. Importantly,\nBNs capture the dependency of a node's attributes on its parent nodes, closely\nmirroring the hierarchical nature of human cognition-where each thought is\nshaped by preceding ones. This makes BNs particularly well-suited for\nmulti-step reasoning tasks, aligning the process more closely with human-like\nreasoning. Extensive experiments across three types of reasoning tasks\n(mathematical reasoning, code generation, and logical reasoning) demonstrate\nthat GraphIC outperforms both training-free and training-based models in\nselecting ICEs, excelling in terms of both effectiveness and efficiency. We\nshow that GraphIC enhances ICL's performance and interoperability,\nsignificantly advancing ICE selection for multi-step reasoning tasks.", "paper_summary_zh": "<paragraph>情境學習 (ICL) 讓大型語言模型 (LLM) 能夠透過直接在輸入中加入少數情境範例 (ICE)，而無需更新參數，來概化到新的任務中。然而，ICL 的有效性極度仰賴 ICE 的選擇，而傳統的基於文字的嵌入方法通常不足以應付需要多步驟推理的任務，例如數學和邏輯問題解決。這是由於淺層語意相似性帶來的偏差，而這種偏差無法捕捉這些任務所需的更深入推理結構。我們提出 GraphIC，這是一種創新的方法，它利用推理過程的圖形化表徵，結合貝氏網路 (BN) 來選擇 ICE。圖形結構會固有地濾除淺層語意，同時保留核心推理結構。重要的是，BN 捕捉節點屬性對其父節點的依賴性，緊密反映人類認知的階層性質，其中每個想法都是由前一個想法所形塑。這使得 BN 特別適合多步驟推理任務，讓流程更貼近類似人類的推理。橫跨三種類型的推理任務（數學推理、程式碼產生和邏輯推理）的大量實驗證明，GraphIC 在選擇 ICE 時優於無訓練和基於訓練的模型，在有效性和效率方面都表現出色。我們展示了 GraphIC 增強了 ICL 的效能和互操作性，顯著地推進了多步驟推理任務的 ICE 選擇。</paragraph>", "author": "Jiale Fu et.al.", "authors": "Jiale Fu, Yaqing Wang, Simeng Han, Jiaming Fan, Chen Si, Xu Yang", "id": "2410.02203v1", "paper_url": "http://arxiv.org/abs/2410.02203v1", "repo": "null"}}