{"2409.03752": {"publish_time": "2024-09-05", "title": "Attention Heads of Large Language Models: A Survey", "paper_summary": "Since the advent of ChatGPT, Large Language Models (LLMs) have excelled in\nvarious tasks but remain largely as black-box systems. Consequently, their\ndevelopment relies heavily on data-driven approaches, limiting performance\nenhancement through changes in internal architecture and reasoning pathways. As\na result, many researchers have begun exploring the potential internal\nmechanisms of LLMs, aiming to identify the essence of their reasoning\nbottlenecks, with most studies focusing on attention heads. Our survey aims to\nshed light on the internal reasoning processes of LLMs by concentrating on the\ninterpretability and underlying mechanisms of attention heads. We first distill\nthe human thought process into a four-stage framework: Knowledge Recalling,\nIn-Context Identification, Latent Reasoning, and Expression Preparation. Using\nthis framework, we systematically review existing research to identify and\ncategorize the functions of specific attention heads. Furthermore, we summarize\nthe experimental methodologies used to discover these special heads, dividing\nthem into two categories: Modeling-Free methods and Modeling-Required methods.\nAlso, we outline relevant evaluation methods and benchmarks. Finally, we\ndiscuss the limitations of current research and propose several potential\nfuture directions. Our reference list is open-sourced at\n\\url{https://github.com/IAAR-Shanghai/Awesome-Attention-Heads}.", "paper_summary_zh": "自 ChatGPT 問世以來，大型語言模型 (LLM) 在各種任務中表現出色，但仍很大程度上是黑箱系統。因此，它們的發展很大程度上依賴於數據驅動的方法，限制了通過內部架構和推理路徑的改變來提升性能。因此，許多研究人員開始探索 LLM 的潛在內部機制，旨在找出其推理瓶頸的本質，大多數研究都集中在注意力頭部。我們的調查旨在通過專注於注意力頭部的可解釋性和底層機制，闡明 LLM 的內部推理過程。我們首先將人類的思維過程提煉成一個四階段框架：知識回憶、語境識別、潛在推理和表達準備。使用這個框架，我們系統地回顧現有研究，以識別和分類特定注意力頭部的功能。此外，我們總結了用於發現這些特殊頭部的實驗方法，將它們分為兩類：無建模方法和需要建模的方法。此外，我們概述了相關的評估方法和基準。最後，我們討論了當前研究的局限性，並提出了幾個潛在的未來方向。我們的參考清單在 \\url{https://github.com/IAAR-Shanghai/Awesome-Attention-Heads} 開源。", "author": "Zifan Zheng et.al.", "authors": "Zifan Zheng, Yezhaohui Wang, Yuxin Huang, Shichao Song, Bo Tang, Feiyu Xiong, Zhiyu Li", "id": "2409.03752v1", "paper_url": "http://arxiv.org/abs/2409.03752v1", "repo": "https://github.com/iaar-shanghai/awesome-attention-heads"}}