{"2412.03151": {"publish_time": "2024-12-04", "title": "Large Language Models show both individual and collective creativity comparable to humans", "paper_summary": "Artificial intelligence has, so far, largely automated routine tasks, but\nwhat does it mean for the future of work if Large Language Models (LLMs) show\ncreativity comparable to humans? To measure the creativity of LLMs\nholistically, the current study uses 13 creative tasks spanning three domains.\nWe benchmark the LLMs against individual humans, and also take a novel approach\nby comparing them to the collective creativity of groups of humans. We find\nthat the best LLMs (Claude and GPT-4) rank in the 52nd percentile against\nhumans, and overall LLMs excel in divergent thinking and problem solving but\nlag in creative writing. When questioned 10 times, an LLM's collective\ncreativity is equivalent to 8-10 humans. When more responses are requested, two\nadditional responses of LLMs equal one extra human. Ultimately, LLMs, when\noptimally applied, may compete with a small group of humans in the future of\nwork.", "paper_summary_zh": "目前為止，人工智慧已經自動化了大量的例行工作，但如果大型語言模型 (LLM) 展現出與人類相當的創造力，這對工作的未來而言代表什麼意義？為了全面衡量 LLM 的創造力，目前的研究使用了涵蓋三個領域的 13 項創造力任務。我們以個別人類為基準來評量 LLM，並採用創新的方法，將它們與人類群體的集體創造力進行比較。我們發現，最佳的 LLM（Claude 和 GPT-4）在與人類的比較中排名第 52 個百分位，整體而言，LLM 在發散性思考和問題解決方面表現出色，但在創意寫作方面則落後。當被詢問 10 次時，LLM 的集體創造力等於 8-10 個人類。當要求提供更多回應時，LLM 的兩個額外回應等於一個額外的人類。最終，在最佳應用時，LLM 可能在未來的職場中與一小群人類競爭。", "author": "Luning Sun et.al.", "authors": "Luning Sun, Yuzhuo Yuan, Yuan Yao, Yanyan Li, Hao Zhang, Xing Xie, Xiting Wang, Fang Luo, David Stillwell", "id": "2412.03151v1", "paper_url": "http://arxiv.org/abs/2412.03151v1", "repo": "null"}}