{"2409.05531": {"publish_time": "2024-09-09", "title": "HMAFlow: Learning More Accurate Optical Flow via Hierarchical Motion Field Alignment", "paper_summary": "Optical flow estimation is a fundamental and long-standing visual task. In\nthis work, we present a novel method, dubbed HMAFlow, to improve optical flow\nestimation in these tough scenes, especially with small objects. The proposed\nmodel mainly consists of two core components: a Hierarchical Motion Field\nAlignment (HMA) module and a Correlation Self-Attention (CSA) module. In\naddition, we rebuild 4D cost volumes by employing a Multi-Scale Correlation\nSearch (MCS) layer and replacing average pooling in common cost volumes with an\nsearch strategy using multiple search ranges. Experimental results demonstrate\nthat our model achieves the best generalization performance in comparison to\nother state-of-the-art methods. Specifically, compared with RAFT, our method\nachieves relative error reductions of 14.2% and 3.4% on the clean pass and\nfinal pass of the Sintel online benchmark, respectively. On the KITTI test\nbenchmark, HMAFlow surpasses RAFT and GMA in the Fl-all metric by a relative\nmargin of 6.8% and 7.7%, respectively. To facilitate future research, our code\nwill be made available at https://github.com/BooTurbo/HMAFlow.", "paper_summary_zh": "光流估計是一個基本且長久存在的視覺任務。在這項工作中，我們提出了一種新方法，稱為 HMAFlow，以改善這些困難場景中的光流估計，特別是對於小物件。所提出的模型主要包含兩個核心組成部分：分層運動場對齊 (HMA) 模組和相關性自我注意 (CSA) 模組。此外，我們通過使用多尺度相關性搜尋 (MCS) 層並以使用多重搜尋範圍的搜尋策略取代常見成本體積中的平均池化來重建 4D 成本體積。實驗結果表明，與其他最先進的方法相比，我們的模型達到了最佳的泛化效能。具體來說，與 RAFT 相比，我們的模型分別在 Sintel 線上基準測試的乾淨通道和最終通道上實現了 14.2% 和 3.4% 的相對誤差降低。在 KITTI 測試基準測試中，HMAFlow 在 Fl-all 指標上分別以 6.8% 和 7.7% 的相對幅度超越了 RAFT 和 GMA。為了促進未來的研究，我們的程式碼將在 https://github.com/BooTurbo/HMAFlow 上提供。", "author": "Dianbo Ma et.al.", "authors": "Dianbo Ma, Kousuke Imamura, Ziyan Gao, Xiangjie Wang, Satoshi Yamane", "id": "2409.05531v1", "paper_url": "http://arxiv.org/abs/2409.05531v1", "repo": "null"}}