{"2407.21523": {"publish_time": "2024-07-31", "title": "Tabular Data Augmentation for Machine Learning: Progress and Prospects of Embracing Generative AI", "paper_summary": "Machine learning (ML) on tabular data is ubiquitous, yet obtaining abundant\nhigh-quality tabular data for model training remains a significant obstacle.\nNumerous works have focused on tabular data augmentation (TDA) to enhance the\noriginal table with additional data, thereby improving downstream ML tasks.\nRecently, there has been a growing interest in leveraging the capabilities of\ngenerative AI for TDA. Therefore, we believe it is time to provide a\ncomprehensive review of the progress and future prospects of TDA, with a\nparticular emphasis on the trending generative AI. Specifically, we present an\narchitectural view of the TDA pipeline, comprising three main procedures:\npre-augmentation, augmentation, and post-augmentation. Pre-augmentation\nencompasses preparation tasks that facilitate subsequent TDA, including error\nhandling, table annotation, table simplification, table representation, table\nindexing, table navigation, schema matching, and entity matching. Augmentation\nsystematically analyzes current TDA methods, categorized into retrieval-based\nmethods, which retrieve external data, and generation-based methods, which\ngenerate synthetic data. We further subdivide these methods based on the\ngranularity of the augmentation process at the row, column, cell, and table\nlevels. Post-augmentation focuses on the datasets, evaluation and optimization\naspects of TDA. We also summarize current trends and future directions for TDA,\nhighlighting promising opportunities in the era of generative AI. In addition,\nthe accompanying papers and related resources are continuously updated and\nmaintained in the GitHub repository at\nhttps://github.com/SuDIS-ZJU/awesome-tabular-data-augmentation to reflect\nongoing advancements in the field.", "paper_summary_zh": "表格資料的機器學習 (ML) 無所不在，但取得大量的優質表格資料以進行模型訓練仍然是一項重大的障礙。許多研究專注於表格資料擴充 (TDA)，以使用額外的資料來增強原始表格，從而改善下游 ML 任務。最近，人們對利用生成式 AI 的功能進行 TDA 產生越來越大的興趣。因此，我們相信現在是時候對 TDA 的進展和未來前景進行全面回顧，特別強調趨勢性的生成式 AI。具體來說，我們提出了 TDA 管線的架構視圖，包含三個主要程序：預擴充、擴充和後擴充。預擴充包含有助於後續 TDA 的準備任務，包括錯誤處理、表格註解、表格簡化、表格表示、表格索引、表格導覽、架構比對和實體比對。擴充系統性地分析目前的 TDA 方法，分類為基於檢索的方法（檢索外部資料）和基於生成的的方法（生成合成資料）。我們進一步根據列、欄、儲存格和表格層級的擴充程序粒度細分這些方法。後擴充專注於 TDA 的資料集、評估和最佳化面向。我們也總結了 TDA 目前的趨勢和未來方向，強調了生成式 AI 時代充滿希望的機會。此外，隨附的論文和相關資源會持續更新並保存在 GitHub 儲存庫中，網址為 https://github.com/SuDIS-ZJU/awesome-tabular-data-augmentation，以反映該領域的持續進展。", "author": "Lingxi Cui et.al.", "authors": "Lingxi Cui, Huan Li, Ke Chen, Lidan Shou, Gang Chen", "id": "2407.21523v1", "paper_url": "http://arxiv.org/abs/2407.21523v1", "repo": "null"}}