{"2407.13742": {"publish_time": "2024-07-18", "title": "CellularLint: A Systematic Approach to Identify Inconsistent Behavior in Cellular Network Specifications", "paper_summary": "In recent years, there has been a growing focus on scrutinizing the security\nof cellular networks, often attributing security vulnerabilities to issues in\nthe underlying protocol design descriptions. These protocol design\nspecifications, typically extensive documents that are thousands of pages long,\ncan harbor inaccuracies, underspecifications, implicit assumptions, and\ninternal inconsistencies. In light of the evolving landscape, we introduce\nCellularLint--a semi-automatic framework for inconsistency detection within the\nstandards of 4G and 5G, capitalizing on a suite of natural language processing\ntechniques. Our proposed method uses a revamped few-shot learning mechanism on\ndomain-adapted large language models. Pre-trained on a vast corpus of cellular\nnetwork protocols, this method enables CellularLint to simultaneously detect\ninconsistencies at various levels of semantics and practical use cases. In\ndoing so, CellularLint significantly advances the automated analysis of\nprotocol specifications in a scalable fashion. In our investigation, we focused\non the Non-Access Stratum (NAS) and the security specifications of 4G and 5G\nnetworks, ultimately uncovering 157 inconsistencies with 82.67% accuracy. After\nverification of these inconsistencies on open-source implementations and 17\ncommercial devices, we confirm that they indeed have a substantial impact on\ndesign decisions, potentially leading to concerns related to privacy,\nintegrity, availability, and interoperability.", "paper_summary_zh": "近年来，人们越来越关注对蜂窝网络的安全性进行审查，通常将安全漏洞归因于底层协议设计描述中的问题。这些协议设计规范通常是长达数千页的大型文档，可能存在不准确、欠规范、隐含假设和内部不一致的情况。鉴于不断变化的格局，我们引入了 CellularLint——一个用于检测 4G 和 5G 标准中不一致性的半自动框架，它利用了一套自然语言处理技术。我们提出的方法在经过领域适应的大语言模型上使用改进的少样本学习机制。这种方法经过大量蜂窝网络协议语料库的预训练，使 CellularLint 能够同时检测语义和实际用例中不同层面的不一致性。通过这样做，CellularLint 以可扩展的方式极大地推进了协议规范的自动化分析。在我们的调查中，我们重点关注了 4G 和 5G 网络的非接入层 (NAS) 和安全规范，最终发现了 157 个不一致性，准确率为 82.67%。在对开源实现和 17 个商用设备验证了这些不一致性之后，我们确认它们确实对设计决策产生了重大影响，可能导致与隐私、完整性、可用性和互操作性相关的问题。", "author": "Mirza Masfiqur Rahman et.al.", "authors": "Mirza Masfiqur Rahman, Imtiaz Karim, Elisa Bertino", "id": "2407.13742v1", "paper_url": "http://arxiv.org/abs/2407.13742v1", "repo": "null"}}