{"2409.05559": {"publish_time": "2024-09-09", "title": "CauseJudger: Identifying the Cause with LLMs for Abductive Logical Reasoning", "paper_summary": "Large language models (LLMs) have been utilized in solving diverse reasoning\ntasks, encompassing common sense, arithmetic and deduction tasks. However, with\ndifficulties of reversing thinking patterns and irrelevant premises, how to\ndetermine the authenticity of the cause in abductive logical reasoning remains\nunderexplored. Inspired by hypothesis and verification method and\nidentification of irrelevant information in human thinking process, we propose\na new framework for LLMs abductive logical reasoning called CauseJudger (CJ),\nwhich identifies the authenticity of possible cause by transforming thinking\nfrom reverse to forward and removing irrelevant information. In addition, we\nconstruct an abductive logical reasoning dataset for decision task called\nCauseLogics, which contains 200,000 tasks of varying reasoning lengths. Our\nexperiments show the efficiency of CJ with overall experiments and ablation\nexperiments as well as case studies on our dataset and reconstructed public\ndataset. Notably, CJ's implementation is efficient, requiring only two calls to\nLLM. Its impact is profound: when using gpt-3.5, CJ achieves a maximum\ncorrectness improvement of 41% compared to Zero-Shot-CoT. Moreover, with gpt-4,\nCJ attains an accuracy exceeding 90% across all datasets.", "paper_summary_zh": "大型語言模型 (LLM) 已用於解決各種推理任務，包括常識、算術和演繹任務。然而，由於逆向思維模式和無關前提的困難，如何確定演繹邏輯推理中原因的真實性仍未得到充分探討。受假設和驗證方法以及人類思維過程中無關信息的識別啟發，我們提出了一個新的 LLM 演繹邏輯推理框架，稱為 CauseJudger (CJ)，它通過將思維從逆向轉換為正向並刪除無關信息來識別可能原因的真實性。此外，我們構建了一個用於決策任務的演繹邏輯推理數據集，稱為 CauseLogics，其中包含 200,000 個不同推理長度的任務。我們的實驗通過整體實驗和消融實驗以及我們數據集和重建的公共數據集的案例研究展示了 CJ 的效率。值得注意的是，CJ 的實現是高效的，只需要調用 LLM 兩次。它的影響是深遠的：當使用 gpt-3.5 時，與 Zero-Shot-CoT 相比，CJ 的正確率最高提升了 41%。此外，使用 gpt-4，CJ 在所有數據集上的準確率都超過了 90%。", "author": "Jinwei He et.al.", "authors": "Jinwei He, Feng Lu", "id": "2409.05559v1", "paper_url": "http://arxiv.org/abs/2409.05559v1", "repo": "null"}}