{"2409.11802": {"publish_time": "2024-09-18", "title": "Latent fingerprint enhancement for accurate minutiae detection", "paper_summary": "Identification of suspects based on partial and smudged fingerprints,\ncommonly referred to as fingermarks or latent fingerprints, presents a\nsignificant challenge in the field of fingerprint recognition. Although\nfixed-length embeddings have shown effectiveness in recognising rolled and slap\nfingerprints, the methods for matching latent fingerprints have primarily\ncentred around local minutiae-based embeddings, failing to fully exploit global\nrepresentations for matching purposes. Consequently, enhancing latent\nfingerprints becomes critical to ensuring robust identification for forensic\ninvestigations. Current approaches often prioritise restoring ridge patterns,\noverlooking the fine-macroeconomic details crucial for accurate fingerprint\nrecognition. To address this, we propose a novel approach that uses generative\nadversary networks (GANs) to redefine Latent Fingerprint Enhancement (LFE)\nthrough a structured approach to fingerprint generation. By directly optimising\nthe minutiae information during the generation process, the model produces\nenhanced latent fingerprints that exhibit exceptional fidelity to ground-truth\ninstances. This leads to a significant improvement in identification\nperformance. Our framework integrates minutiae locations and orientation\nfields, ensuring the preservation of both local and structural fingerprint\nfeatures. Extensive evaluations conducted on two publicly available datasets\ndemonstrate our method's dominance over existing state-of-the-art techniques,\nhighlighting its potential to significantly enhance latent fingerprint\nrecognition accuracy in forensic applications.", "paper_summary_zh": "基於部分且模糊的指紋（通常稱為指紋或潛伏指紋）來識別嫌犯，在指紋辨識領域中是一項重大挑戰。儘管固定長度的嵌入在辨識滾動和拍擊指紋方面已展現出效能，但用於比對潛伏指紋的方法主要集中於基於局部微特徵的嵌入，未能充分利用全局表徵進行比對。因此，增強潛伏指紋對於確保鑑識調查中的可靠識別至關重要。目前的做法通常優先還原脊線圖案，忽略了對準確指紋辨識至關重要的細微巨觀特徵。為了解決這個問題，我們提出了一種創新的方法，它使用生成對抗網路 (GAN) 透過結構化的指紋生成方法重新定義潛伏指紋增強 (LFE)。透過在生成過程中直接最佳化微特徵資訊，模型產生增強的潛伏指紋，展現出對真實個體的非凡保真度。這顯著改善了識別效能。我們的架構整合了微特徵位置和方向場，確保保留局部和結構性指紋特徵。在兩個公開可用的資料集上進行的廣泛評估，證明了我們的方法優於現有的最先進技術，突顯了其在鑑識應用中顯著提升潛伏指紋辨識精確度的潛力。", "author": "Abdul Wahab et.al.", "authors": "Abdul Wahab, Tariq Mahmood Khan, Shahzaib Iqbal, Bandar AlShammari, Bandar Alhaqbani, Imran Razzak", "id": "2409.11802v1", "paper_url": "http://arxiv.org/abs/2409.11802v1", "repo": "null"}}