{"2502.11880": {"publish_time": "2025-02-17", "title": "Bitnet.cpp: Efficient Edge Inference for Ternary LLMs", "paper_summary": "The advent of 1-bit large language models (LLMs), led by BitNet b1.58, has\nspurred interest in ternary LLMs. Despite this, research and practical\napplications focusing on efficient edge inference for ternary LLMs remain\nscarce. To bridge this gap, we introduce Bitnet.cpp, an inference system\noptimized for BitNet b1.58 and ternary LLMs. Given that mixed-precision matrix\nmultiplication (mpGEMM) constitutes the bulk of inference time in ternary LLMs,\nBitnet.cpp incorporates a novel mpGEMM library to facilitate\nsub-2-bits-per-weight, efficient and lossless inference. The library features\ntwo core solutions: Ternary Lookup Table (TL), which addresses spatial\ninefficiencies of previous bit-wise methods, and Int2 with a Scale (I2_S),\nwhich ensures lossless edge inference, both enabling high-speed inference. Our\nexperiments show that Bitnet.cpp achieves up to a 6.25x increase in speed over\nfull-precision baselines and up to 2.32x over low-bit baselines, setting new\nbenchmarks in the field. Additionally, we expand TL to element-wise lookup\ntable (ELUT) for low-bit LLMs in the appendix, presenting both theoretical and\nempirical evidence of its considerable potential. Bitnet.cpp is publicly\navailable at https://github.com/microsoft/BitNet/tree/paper , offering a\nsophisticated solution for the efficient and practical deployment of edge LLMs.", "paper_summary_zh": "隨著由 BitNet b1.58 領先的 1 位元大型語言模型 (LLM) 出現，已激發了對三元 LLM 的興趣。儘管如此，專注於三元 LLM 的高效能邊緣推論的研究和實際應用仍然很少見。為了彌補這個差距，我們引入了 Bitnet.cpp，這是一個針對 BitNet b1.58 和三元 LLM 最佳化的推論系統。由於混合精度矩陣乘法 (mpGEMM) 構成三元 LLM 中推論時間的大部分，Bitnet.cpp 結合了一個新穎的 mpGEMM 函式庫，以利於每權重低於 2 位元、高效能且無損失的推論。該函式庫具有兩個核心解決方案：三元查詢表 (TL)，它解決了先前逐位元方法的空間低效率，以及具有比例的 Int2 (I2_S)，它確保無損失的邊緣推論，兩者都能實現高速推論。我們的實驗顯示，Bitnet.cpp 的速度比全精度的基準快了 6.25 倍，比低位元基準快了 2.32 倍，樹立了該領域的新基準。此外，我們在附錄中將 TL 擴充到逐元素查詢表 (ELUT) 以用於低位元 LLM，並提出其巨大潛力的理論和實證證據。Bitnet.cpp 已公開於 https://github.com/microsoft/BitNet/tree/paper，提供了一個精密的解決方案，用於邊緣 LLM 的高效能和實際部署。", "author": "Jinheng Wang et.al.", "authors": "Jinheng Wang, Hansong Zhou, Ting Song, Shijie Cao, Yan Xia, Ting Cao, Jianyu Wei, Shuming Ma, Hongyu Wang, Furu Wei", "id": "2502.11880v1", "paper_url": "http://arxiv.org/abs/2502.11880v1", "repo": "null"}}