{"2502.13514": {"publish_time": "2025-02-19", "title": "Shall Your Data Strategy Work? Perform a Swift Study", "paper_summary": "This work presents a swift method to assess the efficacy of particular types\nof instruction-tuning data, utilizing just a handful of probe examples and\neliminating the need for model retraining. This method employs the idea of\ngradient-based data influence estimation, analyzing the gradient projections of\nprobe examples from the chosen strategy onto evaluation examples to assess its\nadvantages. Building upon this method, we conducted three swift studies to\ninvestigate the potential of Chain-of-thought (CoT) data, query clarification\ndata, and response evaluation data in enhancing model generalization.\nSubsequently, we embarked on a validation study to corroborate the findings of\nthese swift studies. In this validation study, we developed training datasets\ntailored to each studied strategy and compared model performance with and\nwithout the use of these datasets. The results of the validation study aligned\nwith the findings of the swift studies, validating the efficacy of our proposed\nmethod.", "paper_summary_zh": "本研究提出了一種快速的方法來評估特定類型指令調整資料的效能，僅使用少數探測範例，並消除重新訓練模型的需要。此方法採用基於梯度的資料影響估計概念，分析從所選策略中探測範例的梯度投影，到評估範例，以評估其優點。在此方法的基礎上，我們進行了三項快速研究，以探討思想鏈 (CoT) 資料、查詢澄清資料和回應評估資料在增強模型概括化中的潛力。隨後，我們著手進行驗證研究，以驗證這些快速研究的發現。在驗證研究中，我們開發了針對每個研究策略量身定制的訓練資料集，並比較了使用和不使用這些資料集的模型效能。驗證研究的結果與快速研究的發現一致，驗證了我們提出的方法的有效性。", "author": "Minlong Peng et.al.", "authors": "Minlong Peng, Jingyi Yang, Zhongjun He, Hua Wu", "id": "2502.13514v1", "paper_url": "http://arxiv.org/abs/2502.13514v1", "repo": "null"}}