{"2408.13161": {"publish_time": "2024-08-23", "title": "Say No to Freeloader: Protecting Intellectual Property of Your Deep Model", "paper_summary": "Model intellectual property (IP) protection has attracted growing attention\nas science and technology advancements stem from human intellectual labor and\ncomputational expenses. Ensuring IP safety for trainers and owners is of utmost\nimportance, particularly in domains where ownership verification and\napplicability authorization are required. A notable approach to safeguarding\nmodel IP involves proactively preventing the use of well-trained models of\nauthorized domains from unauthorized domains. In this paper, we introduce a\nnovel Compact Un-transferable Pyramid Isolation Domain (CUPI-Domain) which\nserves as a barrier against illegal transfers from authorized to unauthorized\ndomains. Drawing inspiration from human transitive inference and learning\nabilities, the CUPI-Domain is designed to obstruct cross-domain transfers by\nemphasizing the distinctive style features of the authorized domain. This\nemphasis leads to failure in recognizing irrelevant private style features on\nunauthorized domains. To this end, we propose novel CUPI-Domain generators,\nwhich select features from both authorized and CUPI-Domain as anchors. Then, we\nfuse the style features and semantic features of these anchors to generate\nlabeled and style-rich CUPI-Domain. Additionally, we design external\nDomain-Information Memory Banks (DIMB) for storing and updating labeled pyramid\nfeatures to obtain stable domain class features and domain class-wise style\nfeatures. Based on the proposed whole method, the novel style and\ndiscriminative loss functions are designed to effectively enhance the\ndistinction in style and discriminative features between authorized and\nunauthorized domains, respectively. Moreover, we provide two solutions for\nutilizing CUPI-Domain based on whether the unauthorized domain is known:\ntarget-specified CUPI-Domain and target-free CUPI-Domain.", "paper_summary_zh": "模型智慧財產權 (IP) 保護備受關注，因為科學和技術進步源自人類智慧勞動和運算成本。確保訓練者和所有者的 IP 安全至關重要，特別是在需要所有權驗證和適用性授權的領域。保護模型 IP 的一個顯著方法涉及主動防止未經授權的網域使用經過良好訓練的授權網域模型。在本文中，我們介紹了一種新穎的緊湊不可轉移金字塔隔離網域 (CUPI-Domain)，它作為阻止從授權網域到未經授權網域的非法轉移的屏障。從人類的遞移推理和學習能力中汲取靈感，CUPI-Domain 旨在透過強調授權網域的獨特樣式特徵來阻礙跨網域轉移。這種強調導致無法在未經授權的網域上識別不相關的私人樣式特徵。為此，我們提出了新穎的 CUPI-Domain 生成器，它從授權和 CUPI-Domain 中選擇特徵作為錨點。然後，我們融合這些錨點的樣式特徵和語義特徵，以生成標籤豐富的 CUPI-Domain。此外，我們設計了外部網域資訊記憶體庫 (DIMB)，用於儲存和更新標籤金字塔特徵，以獲取穩定的網域類別特徵和網域類別樣式特徵。基於所提出的整體方法，新穎的樣式和辨別損失函數被設計為分別有效增強授權和未經授權網域之間的樣式和辨別特徵的區別。此外，我們提供了兩種基於未經授權網域是否已知的 CUPI-Domain 使用解決方案：目標指定的 CUPI-Domain 和目標免費的 CUPI-Domain。", "author": "Lianyu Wang et.al.", "authors": "Lianyu Wang, Meng Wang, Huazhu Fu, Daoqiang Zhang", "id": "2408.13161v1", "paper_url": "http://arxiv.org/abs/2408.13161v1", "repo": "null"}}