{"2501.17030": {"publish_time": "2025-01-28", "title": "Challenges in Ensuring AI Safety in DeepSeek-R1 Models: The Shortcomings of Reinforcement Learning Strategies", "paper_summary": "Large Language Models (LLMs) have achieved remarkable progress in reasoning,\nalignment, and task-specific performance. However, ensuring harmlessness in\nthese systems remains a critical challenge, particularly in advanced models\nlike DeepSeek-R1. This paper examines the limitations of Reinforcement Learning\n(RL) as the primary approach for reducing harmful outputs in DeepSeek-R1 and\ncompares it with Supervised Fine-Tuning (SFT). While RL improves reasoning\ncapabilities, it faces challenges such as reward hacking, generalization\nfailures, language mixing, and high computational costs. We propose hybrid\ntraining approaches combining RL and SFT to achieve robust harmlessness\nreduction. Usage recommendations and future directions for deploying\nDeepSeek-R1 responsibly are also presented.", "paper_summary_zh": "大型語言模型 (LLM) 在推理、對齊和特定任務表現方面取得顯著進展。然而，確保這些系統的無害性仍然是一項嚴峻的挑戰，尤其是在 DeepSeek-R1 等先進模型中。本文探討了強化學習 (RL) 作為減少 DeepSeek-R1 中有害輸出之主要方法的限制，並將其與監督微調 (SFT) 進行比較。儘管 RL 改善了推理能力，但它面臨獎勵破解、泛化失敗、語言混淆和高計算成本等挑戰。我們提出結合 RL 和 SFT 的混合訓練方法，以實現穩健的無害性降低。還提出了負責任地部署 DeepSeek-R1 的使用建議和未來方向。", "author": "Manojkumar Parmar et.al.", "authors": "Manojkumar Parmar, Yuvaraj Govindarajulu", "id": "2501.17030v1", "paper_url": "http://arxiv.org/abs/2501.17030v1", "repo": "null"}}