{"2410.08146": {"publish_time": "2024-10-10", "title": "Rewarding Progress: Scaling Automated Process Verifiers for LLM Reasoning", "paper_summary": "A promising approach for improving reasoning in large language models is to\nuse process reward models (PRMs). PRMs provide feedback at each step of a\nmulti-step reasoning trace, potentially improving credit assignment over\noutcome reward models (ORMs) that only provide feedback at the final step.\nHowever, collecting dense, per-step human labels is not scalable, and training\nPRMs from automatically-labeled data has thus far led to limited gains. To\nimprove a base policy by running search against a PRM or using it as dense\nrewards for reinforcement learning (RL), we ask: \"How should we design process\nrewards?\". Our key insight is that, to be effective, the process reward for a\nstep should measure progress: a change in the likelihood of producing a correct\nresponse in the future, before and after taking the step, corresponding to the\nnotion of step-level advantages in RL. Crucially, this progress should be\nmeasured under a prover policy distinct from the base policy. We theoretically\ncharacterize the set of good provers and our results show that optimizing\nprocess rewards from such provers improves exploration during test-time search\nand online RL. In fact, our characterization shows that weak prover policies\ncan substantially improve a stronger base policy, which we also observe\nempirically. We validate our claims by training process advantage verifiers\n(PAVs) to predict progress under such provers, and show that compared to ORMs,\ntest-time search against PAVs is $>8\\%$ more accurate, and $1.5-5\\times$ more\ncompute-efficient. Online RL with dense rewards from PAVs enables one of the\nfirst results with $5-6\\times$ gain in sample efficiency, and $>6\\%$ gain in\naccuracy, over ORMs.", "paper_summary_zh": "一種改善大型語言模型中推理能力的 promising 方法是使用過程獎勵模型 (PRM)。PRM 在多步驟推理追蹤的每一步提供回饋，潛在改善了對結果獎勵模型 (ORM) 的信用分配，而後者僅在最後一步提供回饋。\n然而，收集密集的、按步驟進行的人類標籤並非可擴充的，而從自動標籤資料訓練 PRM 至今僅獲得有限的進展。為了透過針對 PRM 執行搜尋或將其用作強化學習 (RL) 的密集獎勵來改善基礎政策，我們提出疑問：「我們應如何設計過程獎勵？」我們的關鍵見解在於，過程獎勵若要有效，對於某個步驟而言，應衡量進度：在採取步驟之前和之後，產生正確回應的可能性發生變化，這對應於 RL 中步驟層級優勢的概念。至關重要的是，應在與基礎政策不同的證明者政策下衡量此進度。我們在理論上描述了良好的證明者組合，我們的結果顯示，最佳化來自此類證明者的過程獎勵會改善測試時間搜尋和線上 RL 中的探索。事實上，我們的描述顯示，弱證明者政策可以大幅改善較強的基礎政策，這也是我們在經驗上觀察到的。我們透過訓練過程優勢驗證器 (PAV) 來驗證我們的說法，以預測在這些證明者下的進度，並顯示與 ORM 相比，針對 PAV 的測試時間搜尋準確度提高了 $>8\\%$，計算效率提高了 $1.5-5\\times$。透過 PAV 的密集獎勵進行線上 RL，獲得了樣本效率提高 $5-6\\times$、準確度提高 $>6\\%$ 的首批結果，優於 ORM。", "author": "Amrith Setlur et.al.", "authors": "Amrith Setlur, Chirag Nagpal, Adam Fisch, Xinyang Geng, Jacob Eisenstein, Rishabh Agarwal, Alekh Agarwal, Jonathan Berant, Aviral Kumar", "id": "2410.08146v1", "paper_url": "http://arxiv.org/abs/2410.08146v1", "repo": "null"}}