{"2408.11455": {"publish_time": "2024-08-21", "title": "Using Part-based Representations for Explainable Deep Reinforcement Learning", "paper_summary": "Utilizing deep learning models to learn part-based representations holds\nsignificant potential for interpretable-by-design approaches, as these models\nincorporate latent causes obtained from feature representations through simple\naddition. However, training a part-based learning model presents challenges,\nparticularly in enforcing non-negative constraints on the model's parameters,\nwhich can result in training difficulties such as instability and convergence\nissues. Moreover, applying such approaches in Deep Reinforcement Learning (RL)\nis even more demanding due to the inherent instabilities that impact many\noptimization methods. In this paper, we propose a non-negative training\napproach for actor models in RL, enabling the extraction of part-based\nrepresentations that enhance interpretability while adhering to non-negative\nconstraints. To this end, we employ a non-negative initialization technique, as\nwell as a modified sign-preserving training method, which can ensure better\ngradient flow compared to existing approaches. We demonstrate the effectiveness\nof the proposed approach using the well-known Cartpole benchmark.", "paper_summary_zh": "利用深度學習模型來學習基於部分的表示，對於可解釋的設計方法具有顯著的潛力，因為這些模型透過簡單的加法將從特徵表示中獲得的潛在原因納入其中。然而，訓練一個基於部分的學習模型會產生挑戰，特別是在對模型參數強制非負約束時，這可能會導致訓練困難，例如不穩定性和收斂問題。此外，由於影響許多最佳化方法的固有不穩定性，在深度強化學習 (RL) 中應用這種方法甚至更具挑戰性。在本文中，我們提出了一種針對 RL 中的動作模型的非負訓練方法，可以提取基於部分的表示，在遵守非負約束的同時增強可解釋性。為此，我們採用非負初始化技術，以及一種經過修改的符號保持訓練方法，與現有方法相比，它可以確保更好的梯度流。我們使用著名的 Cartpole 基準展示了所提出的方法的有效性。", "author": "Manos Kirtas et.al.", "authors": "Manos Kirtas, Konstantinos Tsampazis, Loukia Avramelou, Nikolaos Passalis, Nikolaos Passalis", "id": "2408.11455v1", "paper_url": "http://arxiv.org/abs/2408.11455v1", "repo": "null"}}