{"2504.19996": {"publish_time": "2025-04-28", "title": "Monitoring digestate application on agricultural crops using Sentinel-2 Satellite imagery", "paper_summary": "The widespread use of Exogenous Organic Matter in agriculture necessitates\nmonitoring to assess its effects on soil and crop health. This study evaluates\noptical Sentinel-2 satellite imagery for detecting digestate application, a\npractice that enhances soil fertility but poses environmental risks like\nmicroplastic contamination and nitrogen losses. In the first instance,\nSentinel-2 satellite image time series (SITS) analysis of specific indices\n(EOMI, NDVI, EVI) was used to characterize EOM's spectral behavior after\napplication on the soils of four different crop types in Thessaly, Greece.\nFurthermore, Machine Learning (ML) models (namely Random Forest, k-NN, Gradient\nBoosting and a Feed-Forward Neural Network), were used to investigate digestate\npresence detection, achieving F1-scores up to 0.85. The findings highlight the\npotential of combining remote sensing and ML for scalable and cost-effective\nmonitoring of EOM applications, supporting precision agriculture and\nsustainability.", "paper_summary_zh": "<paragraph>在農業中廣泛使用外源有機質需要監測以評估其對土壤和作物健康的影響。本研究評估光學 Sentinel-2 衛星圖像在檢測沼渣施用方面的應用，這是一種可以提高土壤肥力但也帶來環境風險（如微塑膠污染和氮損失）的做法。首先，利用 Sentinel-2 衛星圖像時間序列 (SITS) 對特定指數（EOMI、NDVI、EVI）進行分析，以描述希臘色薩利地區四種不同作物類型土壤上施用外源有機質後的土壤光譜行為。此外，機器學習 (ML) 模型（即隨機森林、k-NN、梯度提升和前饋神經網絡）被用於研究沼渣存在檢測，達到了高達 0.85 的 F1 分數。研究結果突出了結合遙感和機器學習技術，以可擴展且經濟高效的方式監測外源有機質施用的潛力，從而支持精準農業和可持續發展。</paragraph>\n", "author": "Andreas Kalogeras et.al.", "authors": "Andreas Kalogeras, Dimitrios Bormpoudakis, Iason Tsardanidis, Dimitra A. Loka, Charalampos Kontoes", "id": "2504.19996v1", "paper_url": "http://arxiv.org/abs/2504.19996v1", "repo": "null"}}