{"2411.14863": {"publish_time": "2024-11-22", "title": "Latent Schrodinger Bridge: Prompting Latent Diffusion for Fast Unpaired Image-to-Image Translation", "paper_summary": "Diffusion models (DMs), which enable both image generation from noise and\ninversion from data, have inspired powerful unpaired image-to-image (I2I)\ntranslation algorithms. However, they often require a larger number of neural\nfunction evaluations (NFEs), limiting their practical applicability. In this\npaper, we tackle this problem with Schrodinger Bridges (SBs), which are\nstochastic differential equations (SDEs) between distributions with minimal\ntransport cost. We analyze the probability flow ordinary differential equation\n(ODE) formulation of SBs, and observe that we can decompose its vector field\ninto a linear combination of source predictor, target predictor, and noise\npredictor. Inspired by this observation, we propose Latent Schrodinger Bridges\n(LSBs) that approximate the SB ODE via pre-trained Stable Diffusion, and\ndevelop appropriate prompt optimization and change of variables formula to\nmatch the training and inference between distributions. We demonstrate that our\nalgorithm successfully conduct competitive I2I translation in unsupervised\nsetting with only a fraction of computation cost required by previous DM-based\nI2I methods.", "paper_summary_zh": "擴散模型 (DM) 能夠從雜訊中產生影像，並從資料中進行反演，它啟發了強大的非配對影像到影像 (I2I) 翻譯演算法。然而，它們通常需要大量的網路函數評估 (NFE)，這限制了它們的實用性。在本文中，我們使用薛丁格橋樑 (SB) 來解決這個問題，薛丁格橋樑是具有最小傳輸成本的機率分佈之間的隨機微分方程式 (SDE)。我們分析了 SB 的機率流常微分方程式 (ODE) 公式，並觀察到我們可以將其向量場分解為源預測器、目標預測器和雜訊預測器的線性組合。受到這個觀察的啟發，我們提出了潛在薛丁格橋樑 (LSB)，它透過預先訓練的穩定擴散來近似 SB ODE，並開發適當的提示最佳化和變數轉換公式，以匹配分佈之間的訓練和推論。我們證明了我們的演算法成功地在非監督式設定中進行了具有競爭力的 I2I 翻譯，而運算成本僅為先前基於 DM 的 I2I 方法的一小部分。", "author": "Jeongsol Kim et.al.", "authors": "Jeongsol Kim, Beomsu Kim, Jong Chul Ye", "id": "2411.14863v1", "paper_url": "http://arxiv.org/abs/2411.14863v1", "repo": "null"}}