{"2404.07103": {"publish_time": "2024-04-10", "title": "Graph Chain-of-Thought: Augmenting Large Language Models by Reasoning on Graphs", "paper_summary": "Large language models (LLMs), while exhibiting exceptional performance,\nsuffer from hallucinations, especially on knowledge-intensive tasks. Existing\nworks propose to augment LLMs with individual text units retrieved from\nexternal knowledge corpora to alleviate the issue. However, in many domains,\ntexts are interconnected (e.g., academic papers in a bibliographic graph are\nlinked by citations and co-authorships) which form a (text-attributed) graph.\nThe knowledge in such graphs is encoded not only in single texts/nodes but also\nin their associated connections. To facilitate the research of augmenting LLMs\nwith graphs, we manually construct a Graph Reasoning Benchmark dataset called\nGRBench, containing 1,740 questions that can be answered with the knowledge\nfrom 10 domain graphs. Then, we propose a simple and effective framework called\nGraph Chain-of-thought (Graph-CoT) to augment LLMs with graphs by encouraging\nLLMs to reason on the graph iteratively. Each Graph-CoT iteration consists of\nthree sub-steps: LLM reasoning, LLM-graph interaction, and graph execution. We\nconduct systematic experiments with three LLM backbones on GRBench, where\nGraph-CoT outperforms the baselines consistently. The code is available at\nhttps://github.com/PeterGriffinJin/Graph-CoT.", "paper_summary_zh": "大型語言模型 (LLM) 雖然表現出色，\n但容易出現幻覺，特別是在知識密集型任務上。現有\n作品建議使用從\n外部知識語料庫中檢索的個別文字單位來擴充 LLM，以緩解此問題。然而，在許多領域中，\n文字是相互關聯的（例如，書目圖表中的學術論文\n透過引用和共同作者連結），形成一個（文字屬性）圖表。此類圖表中的知識不僅編碼在單一文字/節點中，也\n編碼在其關聯的連結中。為了促進使用圖表擴充 LLM 的研究，我們手動建構一個名為\nGRBench 的圖表推理基準資料集，其中包含 1,740 個問題，可以用來自 10 個領域圖表的知識來回答。然後，我們提出一個稱為\n圖表思維鏈 (Graph-CoT) 的簡單有效架構，透過鼓勵\nLLM 逐次推理圖表，使用圖表擴充 LLM。每個 Graph-CoT 迭代包含\n三個子步驟：LLM 推理、LLM-圖表互動和圖表執行。我們\n對 GRBench 上的 3 個 LLM 主幹進行系統性實驗，其中\nGraph-CoT 持續優於基準。程式碼可在\nhttps://github.com/PeterGriffinJin/Graph-CoT 取得。", "author": "Bowen Jin et.al.", "authors": "Bowen Jin, Chulin Xie, Jiawei Zhang, Kashob Kumar Roy, Yu Zhang, Suhang Wang, Yu Meng, Jiawei Han", "id": "2404.07103v1", "paper_url": "http://arxiv.org/abs/2404.07103v1", "repo": "https://github.com/petergriffinjin/graph-cot"}}