{"2410.02533": {"publish_time": "2024-10-03", "title": "A Schema-aware Logic Reformulation for Graph Reachability", "paper_summary": "Graph reachability is the task of understanding whether two distinct points\nin a graph are interconnected by arcs to which in general a semantic is\nattached. Reachability has plenty of applications, ranging from motion planning\nto routing. Improving reachability requires structural knowledge of relations\nso as to avoid the complexity of traditional depth-first and breadth-first\nstrategies, implemented in logic languages. In some contexts, graphs are\nenriched with their schema definitions establishing domain and range for every\narc. The introduction of a schema-aware formalization for guiding the search\nmay result in a sensitive improvement by cutting out unuseful paths and\nprioritising those that, in principle, reach the target earlier. In this work,\nwe propose a strategy to automatically exclude and sort certain graph paths by\nexploiting the higher-level conceptualization of instances. The aim is to\nobtain a new first-order logic reformulation of the graph reachability\nscenario, capable of improving the traditional algorithms in terms of time,\nspace requirements, and number of backtracks. The experiments exhibit the\nexpected advantages of the approach in reducing the number of backtracks during\nthe search strategy, resulting in saving time and space as well.", "paper_summary_zh": "圖形可達性是了解圖形中兩個不同點是否由弧線相互連接的任務，這些弧線通常附帶語義。可達性有很多應用，從運動規劃到路由。提高可達性需要結構關係知識，以避免邏輯語言中實現的傳統深度優先和廣度優先策略的複雜性。在某些情況下，圖形會通過其架構定義得到豐富，為每個弧線建立域和範圍。引入架構感知形式化以指導搜尋可能會通過切斷無用的路徑和優先考慮原則上較早到達目標的路徑而產生顯著的改進。在這項工作中，我們提出了一種策略，通過利用實例的高階概念化來自動排除和排序某些圖形路徑。目的是獲得圖形可達性場景的新一階邏輯重新表述，能夠在時間、空間需求和回溯次數方面改進傳統演算法。實驗展示了該方法在減少搜尋策略期間回溯次數方面的預期優點，從而節省了時間和空間。", "author": "Davide Di Pierro et.al.", "authors": "Davide Di Pierro, Stefano Ferilli", "id": "2410.02533v1", "paper_url": "http://arxiv.org/abs/2410.02533v1", "repo": "null"}}