{"2409.16807": {"publish_time": "2024-09-25", "title": "A Few Hypocrites: Few-Shot Learning and Subtype Definitions for Detecting Hypocrisy Accusations in Online Climate Change Debates", "paper_summary": "The climate crisis is a salient issue in online discussions, and hypocrisy\naccusations are a central rhetorical element in these debates. However, for\nlarge-scale text analysis, hypocrisy accusation detection is an understudied\ntool, most often defined as a smaller subtask of fallacious argument detection.\nIn this paper, we define hypocrisy accusation detection as an independent task\nin NLP, and identify different relevant subtypes of hypocrisy accusations. Our\nClimate Hypocrisy Accusation Corpus (CHAC) consists of 420 Reddit climate\ndebate comments, expert-annotated into two different types of hypocrisy\naccusations: personal versus political hypocrisy. We evaluate few-shot\nin-context learning with 6 shots and 3 instruction-tuned Large Language Models\n(LLMs) for detecting hypocrisy accusations in this dataset. Results indicate\nthat the GPT-4o and Llama-3 models in particular show promise in detecting\nhypocrisy accusations (F1 reaching 0.68, while previous work shows F1 of 0.44).\nHowever, context matters for a complex semantic concept such as hypocrisy\naccusations, and we find models struggle especially at identifying political\nhypocrisy accusations compared to personal moral hypocrisy. Our study\ncontributes new insights in hypocrisy detection and climate change discourse,\nand is a stepping stone for large-scale analysis of hypocrisy accusation in\nonline climate debates.", "paper_summary_zh": "氣候危機是網路討論中一個顯著的問題，而偽善指控是這些辯論中一個主要的修辭元素。然而，對於大規模的文字分析，偽善指控偵測是一個研究不足的工具，最常被定義為謬誤論證偵測的一個較小的子任務。在本文中，我們將偽善指控偵測定義為自然語言處理 (NLP) 中一個獨立的任務，並找出偽善指控的不同相關子類型。我們的氣候偽善指控語料庫 (CHAC) 包含 420 則 Reddit 氣候辯論留言，由專家註釋為兩種不同類型的偽善指控：個人偽善與政治偽善。我們評估了在這個資料集偵測偽善指控的六次小樣本情境學習，以及三個經過指令微調的大型語言模型 (LLM)。結果顯示，GPT-4o 和 Llama-3 模型在偵測偽善指控方面特別有前景（F1 達到 0.68，而先前的研究顯示 F1 為 0.44）。然而，對於偽善指控等複雜的語義概念，背景很重要，我們發現與個人道德偽善相比，模型在辨識政治偽善指控時特別吃力。我們的研究為偽善偵測和氣候變遷論述提供了新的見解，並且是大規模分析網路氣候辯論中偽善指控的踏腳石。", "author": "Paulina Garcia Corral et.al.", "authors": "Paulina Garcia Corral, Avishai Green, Hendrik Meyer, Anke Stoll, Xiaoyue Yan, Myrthe Reuver", "id": "2409.16807v1", "paper_url": "http://arxiv.org/abs/2409.16807v1", "repo": "null"}}