{"2405.04513": {"publish_time": "2024-05-07", "title": "Switchable Decision: Dynamic Neural Generation Networks", "paper_summary": "Auto-regressive generation models achieve competitive performance across many\ndifferent NLP tasks such as summarization, question answering, and\nclassifications. However, they are also known for being slow in inference,\nwhich makes them challenging to deploy in real-time applications. We propose a\nswitchable decision to accelerate inference by dynamically assigning\ncomputation resources for each data instance. Automatically making decisions on\nwhere to skip and how to balance quality and computation cost with constrained\noptimization, our dynamic neural generation networks enforce the efficient\ninference path and determine the optimized trade-off. Experiments across\nquestion answering, summarization, and classification benchmarks show that our\nmethod benefits from less computation cost during inference while keeping the\nsame accuracy. Extensive experiments and ablation studies demonstrate that our\nmethod can be general, effective, and beneficial for many NLP tasks.", "paper_summary_zh": "自動回歸生成模型在許多不同的 NLP 任務中實現了競爭效能，例如摘要、問答和分類。然而，它們也以推理緩慢而聞名，這使得它們難以部署在即時應用程式中。我們提出了一個可切換的決策，透過動態分配每個資料實例的運算資源來加速推理。我們的動態神經生成網路自動做出決策，決定在哪裡跳過以及如何平衡品質和運算成本與受限最佳化，強制執行有效的推理路徑並確定最佳化的權衡。在問答、摘要和分類基準上的實驗顯示，我們的模型在推理期間受益於較低的運算成本，同時保持相同的準確度。廣泛的實驗和消融研究表明，我們的模型可以適用於許多 NLP 任務，並對其有效且有益。", "author": "Shujian Zhang et.al.", "authors": "Shujian Zhang, Korawat Tanwisuth, Chengyue Gong, Pengcheng He, Mingyuan Zhou", "id": "2405.04513v1", "paper_url": "http://arxiv.org/abs/2405.04513v1", "repo": "null"}}