{"2410.11594": {"publish_time": "2024-10-15", "title": "Black-box Uncertainty Quantification Method for LLM-as-a-Judge", "paper_summary": "LLM-as-a-Judge is a widely used method for evaluating the performance of\nLarge Language Models (LLMs) across various tasks. We address the challenge of\nquantifying the uncertainty of LLM-as-a-Judge evaluations. While uncertainty\nquantification has been well-studied in other domains, applying it effectively\nto LLMs poses unique challenges due to their complex decision-making\ncapabilities and computational demands. In this paper, we introduce a novel\nmethod for quantifying uncertainty designed to enhance the trustworthiness of\nLLM-as-a-Judge evaluations. The method quantifies uncertainty by analyzing the\nrelationships between generated assessments and possible ratings. By\ncross-evaluating these relationships and constructing a confusion matrix based\non token probabilities, the method derives labels of high or low uncertainty.\nWe evaluate our method across multiple benchmarks, demonstrating a strong\ncorrelation between the accuracy of LLM evaluations and the derived uncertainty\nscores. Our findings suggest that this method can significantly improve the\nreliability and consistency of LLM-as-a-Judge evaluations.", "paper_summary_zh": "LLM-as-a-Judge 是一種廣泛使用的方法，用於評估大型語言模型 (LLM) 在各種任務中的表現。我們解決了量化 LLM-as-a-Judge 評估不確定性的挑戰。雖然不確定性量化在其他領域已獲得深入研究，但由於 LLM 複雜的決策制定能力和運算需求，將其有效應用於 LLM 會帶來獨特的挑戰。在本文中，我們介紹了一種量化不確定性的新方法，旨在增強 LLM-as-a-Judge 評估的可信度。該方法通過分析生成的評估與可能的評分之間的關係來量化不確定性。通過交叉評估這些關係並根據權杖機率構建混淆矩陣，該方法得出高或低不確定性的標籤。我們在多個基準測試中評估了我們的方法，證明了 LLM 評估的準確性與導出的不確定性評分之間存在很強的相關性。我們的研究結果表明，這種方法可以顯著提高 LLM-as-a-Judge 評估的可靠性和一致性。", "author": "Nico Wagner et.al.", "authors": "Nico Wagner, Michael Desmond, Rahul Nair, Zahra Ashktorab, Elizabeth M. Daly, Qian Pan, Martín Santillán Cooper, James M. Johnson, Werner Geyer", "id": "2410.11594v1", "paper_url": "http://arxiv.org/abs/2410.11594v1", "repo": "null"}}