{"2412.13922": {"publish_time": "2024-12-18", "title": "Pipeline Analysis for Developing Instruct LLMs in Low-Resource Languages: A Case Study on Basque", "paper_summary": "Large language models (LLMs) are typically optimized for resource-rich\nlanguages like English, exacerbating the gap between high-resource and\nunderrepresented languages. This work presents a detailed analysis of\nstrategies for developing a model capable of following instructions in a\nlow-resource language, specifically Basque, by focusing on three key stages:\npre-training, instruction tuning, and alignment with human preferences. Our\nfindings demonstrate that continual pre-training with a high-quality Basque\ncorpus of around 600 million words improves natural language understanding\n(NLU) of the foundational model by over 12 points. Moreover, instruction tuning\nand human preference alignment using automatically translated datasets proved\nhighly effective, resulting in a 24-point improvement in instruction-following\nperformance. The resulting models, Llama-eus-8B and Llama-eus-8B-instruct,\nestablish a new state-of-the-art for Basque in the sub-10B parameter category.", "paper_summary_zh": "大型語言模型 (LLM) 通常針對英語等資源豐富的語言進行最佳化，這加劇了高資源語言和低代表性語言之間的差距。本研究針對開發一種能夠遵循低資源語言（特別是巴斯克語）指令的模型的策略進行詳細分析，重點關注三個關鍵階段：預訓練、指令調整和與人類偏好的對齊。我們的研究結果表明，使用約 6 億個單詞的高品質巴斯克語語料庫進行持續預訓練，可以將基礎模型的自然語言理解 (NLU) 提升超過 12 分。此外，使用自動翻譯數據集進行指令調整和人類偏好對齊被證明非常有效，從而使指令遵循性能提升了 24 分。所產生的模型 Llama-eus-8B 和 Llama-eus-8B-instruct 為低於 10B 參數類別中的巴斯克語建立了新的技術水準。", "author": "Ander Corral et.al.", "authors": "Ander Corral, Ixak Sarasua, Xabier Saralegi", "id": "2412.13922v1", "paper_url": "http://arxiv.org/abs/2412.13922v1", "repo": "null"}}