{"2409.19531": {"publish_time": "2024-09-29", "title": "Understanding Clinical Decision-Making in Traditional East Asian Medicine through Dimensionality Reduction: An Empirical Investigation", "paper_summary": "This study examines the clinical decision-making processes in Traditional\nEast Asian Medicine (TEAM) by reinterpreting pattern identification (PI)\nthrough the lens of dimensionality reduction. Focusing on the Eight Principle\nPattern Identification (EPPI) system and utilizing empirical data from the\nShang-Han-Lun, we explore the necessity and significance of prioritizing the\nExterior-Interior pattern in diagnosis and treatment selection. We test three\nhypotheses: whether the Ext-Int pattern contains the most information about\npatient symptoms, represents the most abstract and generalizable symptom\ninformation, and facilitates the selection of appropriate herbal prescriptions.\nEmploying quantitative measures such as the abstraction index,\ncross-conditional generalization performance, and decision tree regression, our\nresults demonstrate that the Exterior-Interior pattern represents the most\nabstract and generalizable symptom information, contributing to the efficient\nmapping between symptom and herbal prescription spaces. This research provides\nan objective framework for understanding the cognitive processes underlying\nTEAM, bridging traditional medical practices with modern computational\napproaches. The findings offer insights into the development of AI-driven\ndiagnostic tools in TEAM and conventional medicine, with the potential to\nadvance clinical practice, education, and research.", "paper_summary_zh": "本研究透過降維透視重新詮釋證候辨識（PI），探討傳統東亞醫學（TEAM）的臨床決策制定過程。我們專注於八綱證候辨識（EPPI）系統，並利用傷寒論的經驗資料，探討在診斷和治療選擇中優先考慮表裡證的必要性和重要性。我們檢驗了三個假設：表裡證是否包含最多關於患者症狀的資訊、是否代表最抽象且可概括的症狀資訊，以及是否能促進適當草藥處方的選擇。我們的結果採用了抽象指數、交叉條件概化效能和決策樹回歸等量化測量，證明表裡證代表最抽象且可概括的症狀資訊，有助於症狀與草藥處方空間之間的有效對應。本研究為理解 TEAM 背後的認知過程提供了客觀架構，結合傳統醫學實務與現代運算方法。研究結果提供了見解，有助於開發 TEAM 和傳統醫學中由 AI 驅動的診斷工具，並有潛力促進臨床實務、教育和研究。", "author": "Hyojin Bae et.al.", "authors": "Hyojin Bae, Bongsu Kang, Chang-Eop Kim", "id": "2409.19531v1", "paper_url": "http://arxiv.org/abs/2409.19531v1", "repo": "null"}}