{"2504.07450": {"publish_time": "2025-04-10", "title": "Synthetic CT Generation from Time-of-Flight Non-Attenutaion-Corrected PET for Whole-Body PET Attenuation Correction", "paper_summary": "Positron Emission Tomography (PET) imaging requires accurate attenuation\ncorrection (AC) to account for photon loss due to tissue density variations. In\nPET/MR systems, computed tomography (CT), which offers a straightforward\nestimation of AC is not available. This study presents a deep learning approach\nto generate synthetic CT (sCT) images directly from Time-of-Flight (TOF)\nnon-attenuation corrected (NAC) PET images, enhancing AC for PET/MR. We first\nevaluated models pre-trained on large-scale natural image datasets for a\nCT-to-CT reconstruction task, finding that the pre-trained model outperformed\nthose trained solely on medical datasets. The pre-trained model was then\nfine-tuned using an institutional dataset of 35 TOF NAC PET and CT volume\npairs, achieving the lowest mean absolute error (MAE) of 74.49 HU and highest\npeak signal-to-noise ratio (PSNR) of 28.66 dB within the body contour region.\nVisual assessments demonstrated improved reconstruction of both bone and soft\ntissue structures from TOF NAC PET images. This work highlights the\neffectiveness of using pre-trained deep learning models for medical image\ntranslation tasks. Future work will assess the impact of sCT on PET attenuation\ncorrection and explore additional neural network architectures and datasets to\nfurther enhance performance and practical applications in PET imaging.", "paper_summary_zh": "<paragraph>正子發射斷層掃描 (PET) 成像需要精確的衰減校正 (AC)，以解決由於組織密度變化引起的光子損失問題。在 PET/MR 系統中，無法使用能直接估算 AC 的電腦斷層掃描 (CT)。本研究提出了一種深度學習方法，可直接從飛行時間 (TOF) 未衰減校正 (NAC) 的 PET 影像生成合成 CT (sCT) 影像，從而增強 PET/MR 的 AC。我們首先針對 CT 到 CT 的重建任務，評估了在大型自然影像資料集上預先訓練的模型，發現預先訓練的模型優於僅在醫學資料集上訓練的模型。然後，使用包含 35 對 TOF NAC PET 和 CT 體積的機構資料集對預先訓練的模型進行微調，在體輪廓區域內實現了最低的平均絕對誤差 (MAE) 74.49 HU 和最高的峰值信噪比 (PSNR) 28.66 dB。視覺評估表明，從 TOF NAC PET 影像重建骨骼和軟組織結構皆有所改善。這項工作凸顯了使用預先訓練的深度學習模型在醫學影像轉換任務中的有效性。未來的研究將評估 sCT 對 PET 衰減校正的影響，並探索其他神經網路架構和資料集，以進一步提高 PET 成像的效能和實際應用。</paragraph>\n", "author": "Weijie Chen et.al.", "authors": "Weijie Chen, James Wang, Alan McMillan", "id": "2504.07450v1", "paper_url": "http://arxiv.org/abs/2504.07450v1", "repo": "null"}}