{"2408.08252": {"publish_time": "2024-08-15", "title": "Derivative-Free Guidance in Continuous and Discrete Diffusion Models with Soft Value-Based Decoding", "paper_summary": "Diffusion models excel at capturing the natural design spaces of images,\nmolecules, DNA, RNA, and protein sequences. However, rather than merely\ngenerating designs that are natural, we often aim to optimize downstream reward\nfunctions while preserving the naturalness of these design spaces. Existing\nmethods for achieving this goal often require ``differentiable'' proxy models\n(\\textit{e.g.}, classifier guidance or DPS) or involve computationally\nexpensive fine-tuning of diffusion models (\\textit{e.g.}, classifier-free\nguidance, RL-based fine-tuning). In our work, we propose a new method to\naddress these challenges. Our algorithm is an iterative sampling method that\nintegrates soft value functions, which looks ahead to how intermediate noisy\nstates lead to high rewards in the future, into the standard inference\nprocedure of pre-trained diffusion models. Notably, our approach avoids\nfine-tuning generative models and eliminates the need to construct\ndifferentiable models. This enables us to (1) directly utilize\nnon-differentiable features/reward feedback, commonly used in many scientific\ndomains, and (2) apply our method to recent discrete diffusion models in a\nprincipled way. Finally, we demonstrate the effectiveness of our algorithm\nacross several domains, including image generation, molecule generation, and\nDNA/RNA sequence generation. The code is available at\n\\href{https://github.com/masa-ue/SVDD}{https://github.com/masa-ue/SVDD}.", "paper_summary_zh": "擴散模型擅長捕捉影像、分子、DNA、RNA 和蛋白質序列的自然設計空間。然而，我們通常不只是產生自然的設計，而是希望在保留這些設計空間的自然性的同時，最佳化下游獎勵函數。現有的達成此目標的方法通常需要「可微分」的代理模型（例如分類器引導或 DPS）或涉及計算成本高的擴散模型微調（例如無分類器引導、基於 RL 的微調）。在我們的研究中，我們提出了一種新的方法來解決這些挑戰。我們的演算法是一種反覆取樣方法，它將軟值函數整合到標準預訓練擴散模型的推論程序中，該函數預測中間雜訊狀態將如何導致未來的高獎勵。值得注意的是，我們的方法避免了生成模型的微調，並消除了構建可微分模型的需要。這使我們能夠 (1) 直接利用在許多科學領域中常用的不可微分特徵/獎勵回饋，以及 (2) 以有原則的方式將我們的模型應用於最近的離散擴散模型。最後，我們在幾個領域展示了我們演算法的有效性，包括影像生成、分子生成以及 DNA/RNA 序列生成。程式碼可在以下網址取得：\\href{https://github.com/masa-ue/SVDD}{https://github.com/masa-ue/SVDD}。", "author": "Xiner Li et.al.", "authors": "Xiner Li, Yulai Zhao, Chenyu Wang, Gabriele Scalia, Gokcen Eraslan, Surag Nair, Tommaso Biancalani, Aviv Regev, Sergey Levine, Masatoshi Uehara", "id": "2408.08252v1", "paper_url": "http://arxiv.org/abs/2408.08252v1", "repo": "null"}}