{"2406.03919": {"publish_time": "2024-06-06", "title": "Vectorized Conditional Neural Fields: A Framework for Solving Time-dependent Parametric Partial Differential Equations", "paper_summary": "Transformer models are increasingly used for solving Partial Differential\nEquations (PDEs). Several adaptations have been proposed, all of which suffer\nfrom the typical problems of Transformers, such as quadratic memory and time\ncomplexity. Furthermore, all prevalent architectures for PDE solving lack at\nleast one of several desirable properties of an ideal surrogate model, such as\n(i) generalization to PDE parameters not seen during training, (ii) spatial and\ntemporal zero-shot super-resolution, (iii) continuous temporal extrapolation,\n(iv) support for 1D, 2D, and 3D PDEs, and (v) efficient inference for longer\ntemporal rollouts. To address these limitations, we propose Vectorized\nConditional Neural Fields (VCNeFs), which represent the solution of\ntime-dependent PDEs as neural fields. Contrary to prior methods, however,\nVCNeFs compute, for a set of multiple spatio-temporal query points, their\nsolutions in parallel and model their dependencies through attention\nmechanisms. Moreover, VCNeF can condition the neural field on both the initial\nconditions and the parameters of the PDEs. An extensive set of experiments\ndemonstrates that VCNeFs are competitive with and often outperform existing\nML-based surrogate models.", "paper_summary_zh": "Transformer模型日益用於求解偏微分方程式 (PDE)。已經提出多種改編，所有這些都遭受Transformer的典型問題，例如二次記憶體和時間複雜度。此外，所有流行的 PDE 求解架構都至少缺少理想代理模型的幾個理想屬性，例如 (i) 推廣到訓練期間未見的 PDE 參數，(ii) 空間和時間零次超解析度，(iii) 連續時間外推，(iv) 支援 1D、2D 和 3D PDE，以及 (v) 對較長時間滾動的有效推論。為了解決這些限制，我們提出向量化條件神經場 (VCNeF)，它將時間相關 PDE 的解表示為神經場。然而，與先前的辦法相反，VCNeF 對一組多重時空查詢點計算它們的解，並透過注意力機制建模它們的依賴性。此外，VCNeF 可以將神經場設定在 PDE 的初始條件和參數上。大量的實驗證明，VCNeF 與現有的基於 ML 的代理模型具有競爭力，而且通常表現優異。", "author": "Jan Hagnberger et.al.", "authors": "Jan Hagnberger, Marimuthu Kalimuthu, Daniel Musekamp, Mathias Niepert", "id": "2406.03919v1", "paper_url": "http://arxiv.org/abs/2406.03919v1", "repo": "null"}}