{"2409.08892": {"publish_time": "2024-09-13", "title": "Exploring Action-Centric Representations Through the Lens of Rate-Distortion Theory", "paper_summary": "Organisms have to keep track of the information in the environment that is\nrelevant for adaptive behaviour. Transmitting information in an economical and\nefficient way becomes crucial for limited-resourced agents living in\nhigh-dimensional environments. The efficient coding hypothesis claims that\norganisms seek to maximize the information about the sensory input in an\nefficient manner. Under Bayesian inference, this means that the role of the\nbrain is to efficiently allocate resources in order to make predictions about\nthe hidden states that cause sensory data. However, neither of those frameworks\naccounts for how that information is exploited downstream, leaving aside the\naction-oriented role of the perceptual system. Rate-distortion theory, which\ndefines optimal lossy compression under constraints, has gained attention as a\nformal framework to explore goal-oriented efficient coding. In this work, we\nexplore action-centric representations in the context of rate-distortion\ntheory. We also provide a mathematical definition of abstractions and we argue\nthat, as a summary of the relevant details, they can be used to fix the content\nof action-centric representations. We model action-centric representations\nusing VAEs and we find that such representations i) are efficient lossy\ncompressions of the data; ii) capture the task-dependent invariances necessary\nto achieve successful behaviour; and iii) are not in service of reconstructing\nthe data. Thus, we conclude that full reconstruction of the data is rarely\nneeded to achieve optimal behaviour, consistent with a teleological approach to\nperception.", "paper_summary_zh": "<paragraph>生物體必須追蹤環境中與適應行為相關的資訊。對於生活在高維度環境中、資源有限的代理人而言，以經濟有效的方式傳遞資訊至關重要。有效編碼假說主張，生物體會尋求以有效的方式最大化感官輸入的資訊。在貝氏推論下，這表示大腦的角色是有效分配資源，以便對造成感官資料的隱藏狀態進行預測。然而，這些架構都沒有說明這些資訊如何在下游被利用，並忽略了知覺系統的動作導向角色。速率失真理論定義了在約束條件下的最佳有損壓縮，已被視為探索目標導向有效編碼的形式架構。在這項研究中，我們在速率失真理論的脈絡中探討以動作為中心的表徵。我們也提供抽象概念的數學定義，並主張，它們作為相關細節的摘要，可用於修正以動作為中心的表徵內容。我們使用變分自編碼器對以動作為中心的表徵進行建模，並發現這些表徵 i) 是資料的有效有損壓縮；ii) 捕捉達成成功行為所需的與任務相關的不變性；以及 iii) 不用於重建資料。因此，我們得出結論，要達成最佳行為，很少需要完整重建資料，這與目的論的知覺方法一致。</paragraph>", "author": "Miguel de Llanza Varona et.al.", "authors": "Miguel de Llanza Varona, Christopher L. Buckley, Beren Millidge", "id": "2409.08892v1", "paper_url": "http://arxiv.org/abs/2409.08892v1", "repo": "null"}}