{"2407.13268": {"publish_time": "2024-07-18", "title": "Mixture of Experts based Multi-task Supervise Learning from Crowds", "paper_summary": "Existing truth inference methods in crowdsourcing aim to map redundant labels\nand items to the ground truth. They treat the ground truth as hidden variables\nand use statistical or deep learning-based worker behavior models to infer the\nground truth. However, worker behavior models that rely on ground truth hidden\nvariables overlook workers' behavior at the item feature level, leading to\nimprecise characterizations and negatively impacting the quality of truth\ninference. This paper proposes a new paradigm of multi-task supervised learning\nfrom crowds, which eliminates the need for modeling of items's ground truth in\nworker behavior models. Within this paradigm, we propose a worker behavior\nmodel at the item feature level called Mixture of Experts based Multi-task\nSupervised Learning from Crowds (MMLC). Two truth inference strategies are\nproposed within MMLC. The first strategy, named MMLC-owf, utilizes clustering\nmethods in the worker spectral space to identify the projection vector of the\noracle worker. Subsequently, the labels generated based on this vector are\nconsidered as the inferred truth. The second strategy, called MMLC-df, employs\nthe MMLC model to fill the crowdsourced data, which can enhance the\neffectiveness of existing truth inference methods. Experimental results\ndemonstrate that MMLC-owf outperforms state-of-the-art methods and MMLC-df\nenhances the quality of existing truth inference methods.", "paper_summary_zh": "現有的群眾外包真實性推論方法旨在將重複標籤和項目對應到基本事實。他們將基本事實視為隱藏變數，並使用基於統計或深度學習的工作者行為模型來推論基本事實。然而，依賴於基本事實隱藏變數的工作者行為模型忽略了工作者在項目特徵層級的行為，導致不精確的表徵並對真實性推論的品質產生負面影響。本文提出了一種新的多任務監督式學習典範，從群眾中消除了對工作者行為模型中項目基本事實建模的需求。在這個典範中，我們提出了在項目特徵層級的工作者行為模型，稱為基於專家混合的多任務監督式學習（MMLC）。在 MMLC 中提出了兩種真實性推論策略。第一個策略稱為 MMLC-owf，利用工作者光譜空間中的分群方法來識別神諭工作者的投影向量。隨後，基於此向量產生的標籤被視為推論出的真實性。第二個策略稱為 MMLC-df，採用 MMLC 模型來填補群眾外包資料，這可以提升現有真實性推論方法的效能。實驗結果證明，MMLC-owf 優於最先進的方法，而 MMLC-df 則提升了現有真實性推論方法的品質。", "author": "Tao Han et.al.", "authors": "Tao Han, Huaixuan Shi, Xinyi Ding, Xiao Ma, Huamao Gu, Yili Fang", "id": "2407.13268v1", "paper_url": "http://arxiv.org/abs/2407.13268v1", "repo": "null"}}