{"2412.01929": {"publish_time": "2024-12-02", "title": "ECG-SleepNet: Deep Learning-Based Comprehensive Sleep Stage Classification Using ECG Signals", "paper_summary": "Accurate sleep stage classification is essential for understanding sleep\ndisorders and improving overall health. This study proposes a novel three-stage\napproach for sleep stage classification using ECG signals, offering a more\naccessible alternative to traditional methods that often rely on complex\nmodalities like EEG. In Stages 1 and 2, we initialize the weights of two\nnetworks, which are then integrated in Stage 3 for comprehensive\nclassification. In the first phase, we estimate key features using Feature\nImitating Networks (FINs) to achieve higher accuracy and faster convergence.\nThe second phase focuses on identifying the N1 sleep stage through the\ntime-frequency representation of ECG signals. Finally, the third phase\nintegrates models from the previous stages and employs a Kolmogorov-Arnold\nNetwork (KAN) to classify five distinct sleep stages. Additionally, data\naugmentation techniques, particularly SMOTE, are used in enhancing\nclassification capabilities for underrepresented stages like N1. Our results\ndemonstrate significant improvements in the classification performance, with an\noverall accuracy of 80.79% an overall kappa of 0.73. The model achieves\nspecific accuracies of 86.70% for Wake, 60.36% for N1, 83.89% for N2, 84.85%\nfor N3, and 87.16% for REM. This study emphasizes the importance of weight\ninitialization and data augmentation in optimizing sleep stage classification\nwith ECG signals.", "paper_summary_zh": "精準的睡眠分期分類對於了解睡眠障礙和改善整體健康至關重要。本研究提出一個新的三階段方法，使用 ECG 訊號進行睡眠分期分類，提供了一個更易於取得的替代方案，傳統方法通常依賴於 EEG 等複雜的模式。在第 1 和第 2 階段，我們初始化兩個網路的權重，然後在第 3 階段整合它們以進行全面的分類。在第一階段，我們使用特徵模仿網路 (FIN) 估計關鍵特徵，以實現更高的準確度和更快的收斂。第二階段專注於透過 ECG 訊號的時頻表示來識別 N1 睡眠階段。最後，第三階段整合前一階段的模型，並採用 Kolmogorov-Arnold 網路 (KAN) 來分類五個不同的睡眠階段。此外，資料擴充技術，特別是 SMOTE，用於增強對 N1 等代表性不足階段的分類能力。我們的結果證明了分類效能有顯著的改善，整體準確度為 80.79%，整體 kappa 為 0.73。該模型對清醒、N1、N2、N3 和 REM 的特定準確度分別為 86.70%、60.36%、83.89%、84.85% 和 87.16%。本研究強調了權重初始化和資料擴充在使用 ECG 訊號最佳化睡眠分期分類中的重要性。", "author": "Poorya Aghaomidi et.al.", "authors": "Poorya Aghaomidi, Ge Wang", "id": "2412.01929v1", "paper_url": "http://arxiv.org/abs/2412.01929v1", "repo": "null"}}