{"2407.11798": {"publish_time": "2024-07-16", "title": "PipeInfer: Accelerating LLM Inference using Asynchronous Pipelined Speculation", "paper_summary": "Inference of Large Language Models (LLMs) across computer clusters has become\na focal point of research in recent times, with many acceleration techniques\ntaking inspiration from CPU speculative execution. These techniques reduce\nbottlenecks associated with memory bandwidth, but also increase end-to-end\nlatency per inference run, requiring high speculation acceptance rates to\nimprove performance. Combined with a variable rate of acceptance across tasks,\nspeculative inference techniques can result in reduced performance.\nAdditionally, pipeline-parallel designs require many user requests to maintain\nmaximum utilization. As a remedy, we propose PipeInfer, a pipelined speculative\nacceleration technique to reduce inter-token latency and improve system\nutilization for single-request scenarios while also improving tolerance to low\nspeculation acceptance rates and low-bandwidth interconnects. PipeInfer\nexhibits up to a 2.15$\\times$ improvement in generation speed over standard\nspeculative inference. PipeInfer achieves its improvement through Continuous\nAsynchronous Speculation and Early Inference Cancellation, the former improving\nlatency and generation speed by running single-token inference simultaneously\nwith several speculative runs, while the latter improves speed and latency by\nskipping the computation of invalidated runs, even in the middle of inference.", "paper_summary_zh": "近來，大型語言模型 (LLM) 在電腦叢集中的推論已成為研究的重點，許多加速技術從 CPU 推測執行中汲取靈感。這些技術減少了與記憶體頻寬相關的瓶頸，但也增加了每個推論運行的端到端延遲，需要很高的推測接受率才能提升效能。結合跨任務的可變接受率，推測推論技術可能會導致效能下降。此外，管線平行設計需要許多使用者要求才能維持最大的使用率。作為補救措施，我們提出 PipeInfer，一種管線推測加速技術，用於減少代幣間延遲並改善單一要求場景的系統使用率，同時也提高對低推測接受率和低頻寬互連的容忍度。與標準推測推論相比，PipeInfer 在產生速度上展現出高達 2.15 倍的進步。PipeInfer 透過連續非同步推測和早期推論取消來達成進步，前者透過同時執行單一代幣推論和多個推測運行來改善延遲和產生速度，而後者透過略過無效運行的計算（即使是在推論過程中）來改善速度和延遲。", "author": "Branden Butler et.al.", "authors": "Branden Butler, Sixing Yu, Arya Mazaheri, Ali Jannesari", "id": "2407.11798v1", "paper_url": "http://arxiv.org/abs/2407.11798v1", "repo": "null"}}