{"2412.02138": {"publish_time": "2024-12-03", "title": "Misalignment of Semantic Relation Knowledge between WordNet and Human Intuition", "paper_summary": "WordNet provides a carefully constructed repository of semantic relations,\ncreated by specialists. But there is another source of information on semantic\nrelations, the intuition of language users. We present the first systematic\nstudy of the degree to which these two sources are aligned. Investigating the\ncases of misalignment could make proper use of WordNet and facilitate its\nimprovement. Our analysis which uses templates to elicit responses from human\nparticipants, reveals a general misalignment of semantic relation knowledge\nbetween WordNet and human intuition. Further analyses find a systematic pattern\nof mismatch among synonymy and taxonomic relations~(hypernymy and hyponymy),\ntogether with the fact that WordNet path length does not serve as a reliable\nindicator of human intuition regarding hypernymy or hyponymy relations.", "paper_summary_zh": "WordNet 提供了一個由專家建立的語義關係資料庫，內容經過仔細建構。但語義關係還有另一個資訊來源，也就是語言使用者的直覺。我們提出了第一個系統性研究，探討這兩個來源的對齊程度。研究對齊不佳的案例，可以妥善利用 WordNet 並促進其改進。我們的分析使用範本來引導人類參與者提供回應，結果顯示 WordNet 與人類直覺之間的語義關係知識存在普遍的不對齊。進一步的分析發現同義詞和分類關係（上位詞和下位詞）之間存在系統性的不匹配模式，此外，WordNet 路徑長度並非人類直覺對於上位詞或下位詞關係的可靠指標。", "author": "Zhihan Cao et.al.", "authors": "Zhihan Cao, Hiroaki Yamada, Simone Teufel, Takenobu Tokunaga", "id": "2412.02138v1", "paper_url": "http://arxiv.org/abs/2412.02138v1", "repo": "null"}}