{"2411.12147": {"publish_time": "2024-11-19", "title": "CoMeDi Shared Task: Models as Annotators in Lexical Semantics Disagreements", "paper_summary": "We present the results of our system for the CoMeDi Shared Task, which\npredicts majority votes (Subtask 1) and annotator disagreements (Subtask 2).\nOur approach combines model ensemble strategies with MLP-based and\nthreshold-based methods trained on pretrained language models. Treating\nindividual models as virtual annotators, we simulate the annotation process by\ndesigning aggregation measures that incorporate continuous similarity scores\nand discrete classification labels to capture both majority and disagreement.\nAdditionally, we employ anisotropy removal techniques to enhance performance.\nExperimental results demonstrate the effectiveness of our methods, particularly\nfor Subtask 2. Notably, we find that continuous similarity scores, even within\nthe same model, align better with human disagreement patterns compared to\naggregated discrete labels.", "paper_summary_zh": "我們展示了我們在 CoMeDi 共享任務中系統的結果，該任務\n預測多數票（子任務 1）和註解者分歧（子任務 2）。\n我們的做法結合了模型集成策略與基於 MLP 和\n在預訓練語言模型上訓練的基於閾值的模型。將\n個別模型視為虛擬註解者，我們通過\n設計聚合措施來模擬註解過程，該措施包含連續相似性分數\n和離散分類標籤，以捕捉多數和分歧。\n此外，我們採用各向異性去除技術來提高性能。\n實驗結果證明了我們方法的有效性，特別是\n對於子任務 2。值得注意的是，我們發現連續相似性分數，即使在\n同一個模型中，與人類分歧模式相比，與\n聚合離散標籤相比更一致。", "author": "Zhu Liu et.al.", "authors": "Zhu Liu, Zhen Hu, Ying Liu", "id": "2411.12147v1", "paper_url": "http://arxiv.org/abs/2411.12147v1", "repo": "null"}}