{"2409.03668": {"publish_time": "2024-09-05", "title": "A Fused Large Language Model for Predicting Startup Success", "paper_summary": "Investors are continuously seeking profitable investment opportunities in\nstartups and, hence, for effective decision-making, need to predict a startup's\nprobability of success. Nowadays, investors can use not only various\nfundamental information about a startup (e.g., the age of the startup, the\nnumber of founders, and the business sector) but also textual description of a\nstartup's innovation and business model, which is widely available through\nonline venture capital (VC) platforms such as Crunchbase. To support the\ndecision-making of investors, we develop a machine learning approach with the\naim of locating successful startups on VC platforms. Specifically, we develop,\ntrain, and evaluate a tailored, fused large language model to predict startup\nsuccess. Thereby, we assess to what extent self-descriptions on VC platforms\nare predictive of startup success. Using 20,172 online profiles from\nCrunchbase, we find that our fused large language model can predict startup\nsuccess, with textual self-descriptions being responsible for a significant\npart of the predictive power. Our work provides a decision support tool for\ninvestors to find profitable investment opportunities.", "paper_summary_zh": "<paragraph>投資者持續尋找新創公司的獲利投資機會，因此，為了做出有效的決策，需要預測新創公司的成功機率。現今，投資者不僅可以使用各種新創公司的基本資訊（例如，新創公司的年齡、創辦人數和產業別），還能使用新創公司創新和商業模式的文字說明，這些說明可透過 Crunchbase 等線上創投平台廣泛取得。為了協助投資者進行決策，我們開發了一種機器學習方法，目的是在創投平台上找出成功的公司。具體來說，我們開發、訓練和評估一個量身打造的融合式大型語言模型，以預測新創公司的成功。藉此，我們評估創投平台上的自我描述在多大程度上可以預測新創公司的成功。我們使用 Crunchbase 中的 20,172 個線上個人資料，發現我們的融合式大型語言模型可以預測新創公司的成功，而文字自我描述在預測能力中扮演了重要的角色。我們的研究為投資者提供了一個決策支援工具，以找出獲利的投資機會。</paragraph>", "author": "Abdurahman Maarouf et.al.", "authors": "Abdurahman Maarouf, Stefan Feuerriegel, Nicolas Pröllochs", "id": "2409.03668v1", "paper_url": "http://arxiv.org/abs/2409.03668v1", "repo": "null"}}