{"2410.05407": {"publish_time": "2024-10-07", "title": "Improving Predictor Reliability with Selective Recalibration", "paper_summary": "A reliable deep learning system should be able to accurately express its\nconfidence with respect to its predictions, a quality known as calibration. One\nof the most effective ways to produce reliable confidence estimates with a\npre-trained model is by applying a post-hoc recalibration method. Popular\nrecalibration methods like temperature scaling are typically fit on a small\namount of data and work in the model's output space, as opposed to the more\nexpressive feature embedding space, and thus usually have only one or a handful\nof parameters. However, the target distribution to which they are applied is\noften complex and difficult to fit well with such a function. To this end we\npropose \\textit{selective recalibration}, where a selection model learns to\nreject some user-chosen proportion of the data in order to allow the\nrecalibrator to focus on regions of the input space that can be well-captured\nby such a model. We provide theoretical analysis to motivate our algorithm, and\ntest our method through comprehensive experiments on difficult medical imaging\nand zero-shot classification tasks. Our results show that selective\nrecalibration consistently leads to significantly lower calibration error than\na wide range of selection and recalibration baselines.", "paper_summary_zh": "一個可靠的深度學習系統應該能夠準確地表達其對預測的信心，這項品質稱為校準。使用預先訓練的模型產生可靠的信心估計值最有效的方法之一是應用事後重新校準方法。熱門的重新校準方法（例如溫度縮放）通常適用於少量資料，並在模型的輸出空間中運作，而不是更具表現力的特徵嵌入空間，因此通常只有一個或少數幾個參數。然而，它們所應用的目標分佈通常很複雜，且難以用此類函數做良好的擬合。為此，我們提出「選擇性重新校準」，其中選擇模型會學習拒絕使用者選擇的某些資料比例，以允許重新校準器專注於輸入空間中能被此類模型良好捕捉到的區域。我們提供理論分析來激勵我們的演算法，並透過在困難的醫學影像和零次分類任務中進行全面的實驗來測試我們的模型。我們的結果顯示，選擇性重新校準持續導致校準誤差顯著低於各種選擇和重新校準基線。", "author": "Thomas P. Zollo et.al.", "authors": "Thomas P. Zollo, Zhun Deng, Jake C. Snell, Toniann Pitassi, Richard Zemel", "id": "2410.05407v1", "paper_url": "http://arxiv.org/abs/2410.05407v1", "repo": "null"}}