{"2405.10266": {"publish_time": "2024-05-16", "title": "A Tale of Two Languages: Large-Vocabulary Continuous Sign Language Recognition from Spoken Language Supervision", "paper_summary": "In this work, our goals are two fold: large-vocabulary continuous sign\nlanguage recognition (CSLR), and sign language retrieval. To this end, we\nintroduce a multi-task Transformer model, CSLR2, that is able to ingest a\nsigning sequence and output in a joint embedding space between signed language\nand spoken language text. To enable CSLR evaluation in the large-vocabulary\nsetting, we introduce new dataset annotations that have been manually\ncollected. These provide continuous sign-level annotations for six hours of\ntest videos, and will be made publicly available. We demonstrate that by a\ncareful choice of loss functions, training the model for both the CSLR and\nretrieval tasks is mutually beneficial in terms of performance -- retrieval\nimproves CSLR performance by providing context, while CSLR improves retrieval\nwith more fine-grained supervision. We further show the benefits of leveraging\nweak and noisy supervision from large-vocabulary datasets such as BOBSL, namely\nsign-level pseudo-labels, and English subtitles. Our model significantly\noutperforms the previous state of the art on both tasks.", "paper_summary_zh": "在這項工作中，我們的目標有兩個：大詞彙量連續手語辨識 (CSLR) 和手語檢索。為此，我們提出了一個多任務 Transformer 模型 CSLR2，它能夠攝取手語序列並在手語和口語文本之間的聯合嵌入空間中輸出。為了在大量詞彙的設定中啟用 CSLR 評估，我們引入了已手動收集的新資料集註解。這些註解為六小時的測試影片提供了連續的手語級別註解，並將公開提供。我們證明，透過仔細選擇損失函數，針對 CSLR 和檢索任務訓練模型在效能方面是互利的——檢索透過提供上下文來改善 CSLR 效能，而 CSLR 則透過更細緻的監督來改善檢索。我們進一步展示了利用來自大詞彙量資料集（例如 BOBSL）的弱監督和雜訊監督的好處，即手語級別的偽標籤和英文字幕。我們的模型在兩個任務上都顯著優於先前的技術水準。", "author": "Charles Raude et.al.", "authors": "Charles Raude, K R Prajwal, Liliane Momeni, Hannah Bull, Samuel Albanie, Andrew Zisserman, Gül Varol", "id": "2405.10266v1", "paper_url": "http://arxiv.org/abs/2405.10266v1", "repo": "null"}}