{"2409.18028": {"publish_time": "2024-09-26", "title": "Compositional Hardness of Code in Large Language Models -- A Probabilistic Perspective", "paper_summary": "A common practice in large language model (LLM) usage for complex analytical\ntasks such as code generation, is to sample a solution for the entire task\nwithin the model's context window. Previous works have shown that subtask\ndecomposition within the model's context (chain of thought), is beneficial for\nsolving such tasks. In this work, we point a limitation of LLMs' ability to\nperform several sub-tasks within the same context window - an in-context\nhardness of composition, pointing to an advantage for distributing a decomposed\nproblem in a multi-agent system of LLMs. The hardness of composition is\nquantified by a generation complexity metric, i.e., the number of LLM\ngenerations required to sample at least one correct solution. We find a gap\nbetween the generation complexity of solving a compositional problem within the\nsame context relative to distributing it among multiple agents, that increases\nexponentially with the solution's length. We prove our results theoretically\nand demonstrate them empirically.", "paper_summary_zh": "大型語言模型 (LLM) 在複雜分析任務（例如程式碼生成）中的常見做法，是在模型的內容視窗中為整個任務抽樣一個解。先前的研究表明，模型內容（思考鏈）中的子任務分解，有助於解決此類任務。在這項工作中，我們指出 LLM 在同一內容視窗中執行多個子任務的能力限制，也就是內容組成的難度，指出將分解的問題分配給 LLM 的多代理系統的優點。組成的難度由生成複雜度量化，也就是抽取至少一個正確解所需的 LLM 生成次數。我們發現，在同一內容中解決組合問題的生成複雜度與將其分配給多個代理之間存在差距，而這個差距會隨著解的長度呈指數增加。我們從理論上證明我們的結果，並以經驗證明它們。", "author": "Yotam Wolf et.al.", "authors": "Yotam Wolf, Binyamin Rothberg, Dorin Shteyman, Amnon Shashua", "id": "2409.18028v1", "paper_url": "http://arxiv.org/abs/2409.18028v1", "repo": "null"}}