{"2501.13297": {"publish_time": "2025-01-23", "title": "RAMQA: A Unified Framework for Retrieval-Augmented Multi-Modal Question Answering", "paper_summary": "Multi-modal retrieval-augmented Question Answering (MRAQA), integrating text\nand images, has gained significant attention in information retrieval (IR) and\nnatural language processing (NLP). Traditional ranking methods rely on small\nencoder-based language models, which are incompatible with modern decoder-based\ngenerative large language models (LLMs) that have advanced various NLP tasks.\nTo bridge this gap, we propose RAMQA, a unified framework combining\nlearning-to-rank methods with generative permutation-enhanced ranking\ntechniques. We first train a pointwise multi-modal ranker using LLaVA as the\nbackbone. Then, we apply instruction tuning to train a LLaMA model for\nre-ranking the top-k documents using an innovative autoregressive multi-task\nlearning approach. Our generative ranking model generates re-ranked document\nIDs and specific answers from document candidates in various permutations.\nExperiments on two MRAQA benchmarks, WebQA and MultiModalQA, show significant\nimprovements over strong baselines, highlighting the effectiveness of our\napproach. Code and data are available at: https://github.com/TonyBY/RAMQA", "paper_summary_zh": "多模态检索增强型问答 (MRAQA) 集成文本和图像，在信息检索 (IR) 和自然语言处理 (NLP) 中备受关注。传统排名方法依赖于小型编码器语言模型，这与先进的各种 NLP 任务的现代解码器语言模型 (LLM) 不兼容。为了弥合这一差距，我们提出了 RAMQA，一个将学习排序方法与生成置换增强排序技术相结合的统一框架。我们首先使用 LLaVA 作为主干训练一个点式多模态排序器。然后，我们应用指令微调来训练一个 LLaMA 模型，使用创新的自回归多任务学习方法对前 k 个文档进行重新排序。我们的生成式排序模型从文档候选者中生成重新排序的文档 ID 和特定答案，排列方式多种多样。在两个 MRAQA 基准 WebQA 和 MultiModalQA 上的实验表明，与强大的基准相比有显著的改进，突出了我们方法的有效性。代码和数据可在以下网址获得：https://github.com/TonyBY/RAMQA", "author": "Yang Bai et.al.", "authors": "Yang Bai, Christan Earl Grant, Daisy Zhe Wang", "id": "2501.13297v1", "paper_url": "http://arxiv.org/abs/2501.13297v1", "repo": "https://github.com/tonyby/ramqa"}}