{"2406.04755": {"publish_time": "2024-06-07", "title": "Sales Whisperer: A Human-Inconspicuous Attack on LLM Brand Recommendations", "paper_summary": "Large language model (LLM) users might rely on others (e.g., prompting\nservices), to write prompts. However, the risks of trusting prompts written by\nothers remain unstudied. In this paper, we assess the risk of using such\nprompts on brand recommendation tasks when shopping. First, we found that\nparaphrasing prompts can result in LLMs mentioning given brands with\ndrastically different probabilities, including a pair of prompts where the\nprobability changes by 100%. Next, we developed an approach that can be used to\nperturb an original base prompt to increase the likelihood that an LLM mentions\na given brand. We designed a human-inconspicuous algorithm that perturbs\nprompts, which empirically forces LLMs to mention strings related to a brand\nmore often, by absolute improvements up to 78.3%. Our results suggest that our\nperturbed prompts, 1) are inconspicuous to humans, 2) force LLMs to recommend a\ntarget brand more often, and 3) increase the perceived chances of picking\ntargeted brands.", "paper_summary_zh": "大型語言模型 (LLM) 使用者可能會依賴他人（例如提示服務）來撰寫提示。然而，相信他人撰寫的提示的風險仍未被研究。在本文中，我們評估在購物時使用此類提示對品牌推薦任務的風險。首先，我們發現重新表述提示可能會導致 LLM 以極不同的機率提及給定的品牌，包括一對機率變化達 100% 的提示。接下來，我們開發了一種方法，可用於擾動原始基本提示，以增加 LLM 提及給定品牌的可能性。我們設計了一種對人類不顯眼的演算法來擾動提示，根據經驗，這會強迫 LLM 更頻繁地提及與品牌相關的字串，絕對改善幅度高達 78.3%。我們的結果表明，我們擾動的提示 1) 對人類不顯眼，2) 強迫 LLM 更頻繁地推薦目標品牌，以及 3) 增加選擇目標品牌的感知機會。", "author": "Weiran Lin et.al.", "authors": "Weiran Lin, Anna Gerchanovsky, Omer Akgul, Lujo Bauer, Matt Fredrikson, Zifan Wang", "id": "2406.04755v1", "paper_url": "http://arxiv.org/abs/2406.04755v1", "repo": "null"}}