{"2501.02628": {"publish_time": "2025-01-05", "title": "Cracks in The Stack: Hidden Vulnerabilities and Licensing Risks in LLM Pre-Training Datasets", "paper_summary": "A critical part of creating code suggestion systems is the pre-training of\nLarge Language Models on vast amounts of source code and natural language text,\noften of questionable origin or quality. This may contribute to the presence of\nbugs and vulnerabilities in code generated by LLMs. While efforts to identify\nbugs at or after code generation exist, it is preferable to pre-train or\nfine-tune LLMs on curated, high-quality, and compliant datasets. The need for\nvast amounts of training data necessitates that such curation be automated,\nminimizing human intervention.\n  We propose an automated source code autocuration technique that leverages the\ncomplete version history of open-source software projects to improve the\nquality of training data. This approach leverages the version history of all\nOSS projects to identify training data samples that have been modified or have\nundergone changes in at least one OSS project, and pinpoint a subset of samples\nthat include fixes for bugs or vulnerabilities. We evaluate this method using\nThe Stack v2 dataset, and find that 17% of the code versions in the dataset\nhave newer versions, with 17% of those representing bug fixes, including 2.36%\naddressing known CVEs. The deduplicated version of Stack v2 still includes\nblobs vulnerable to 6,947 known CVEs. Furthermore, 58% of the blobs in the\ndataset were never modified after creation, suggesting they likely represent\nsoftware with minimal or no use. Misidentified blob origins present an\nadditional challenge, as they lead to the inclusion of non-permissively\nlicensed code, raising serious compliance concerns.\n  By addressing these issues, the training of new models can avoid perpetuating\nbuggy code patterns or license violations. We expect our results to inspire\nprocess improvements for automated data curation, with the potential to enhance\nthe reliability of outputs generated by AI tools.", "paper_summary_zh": "建立程式碼建議系統的關鍵部分是針對大量來源程式碼和自然語言文字進行大型語言模型的預訓練，這些文字的來源或品質通常有疑慮。這可能會導致 LLM 所產生的程式碼出現錯誤和漏洞。雖然已有人努力在程式碼產生期間或產生後找出錯誤，但最好是在經過整理、品質高且合規的資料集上預先訓練或微調 LLM。由於訓練資料量龐大，因此必須自動化這種整理，將人為介入降到最低。\n  我們提出了一種自動化來源程式碼自動整理技術，利用開源軟體專案的完整版本歷程，以提升訓練資料的品質。這種方法利用所有 OSS 專案的版本歷程，找出已修改或至少在一個 OSS 專案中歷經變更的訓練資料範例，並找出包含錯誤或漏洞修正的範例子集。我們使用 Stack v2 資料集評估此方法，發現資料集中 17% 的程式碼版本有較新的版本，其中 17% 代表錯誤修正，包括 2.36% 解決已知的 CVE。Stack v2 的重複資料刪除版本仍包含容易受到 6,947 個已知 CVE 影響的 blob。此外，資料集中 58% 的 blob 在建立後從未修改過，這表示它們可能代表使用程度很低或完全沒在使用的軟體。錯誤辨識的 blob 來源會帶來額外挑戰，因為它們會導致包含非許可授權的程式碼，引發嚴重的合規問題。\n  透過解決這些問題，新模型的訓練可以避免傳遞錯誤的程式碼模式或授權違規。我們預期我們的結果能激勵自動化資料整理的流程改善，進而提升 AI 工具產生輸出的可靠性。", "author": "Mahmoud Jahanshahi et.al.", "authors": "Mahmoud Jahanshahi, Audris Mockus", "id": "2501.02628v1", "paper_url": "http://arxiv.org/abs/2501.02628v1", "repo": "null"}}