{"2408.03934": {"publish_time": "2024-08-07", "title": "From Words to Worth: Newborn Article Impact Prediction with LLM", "paper_summary": "As the academic landscape expands, the challenge of efficiently identifying\npotentially high-impact articles among the vast number of newly published works\nbecomes critical. This paper introduces a promising approach, leveraging the\ncapabilities of fine-tuned LLMs to predict the future impact of newborn\narticles solely based on titles and abstracts. Moving beyond traditional\nmethods heavily reliant on external information, the proposed method discerns\nthe shared semantic features of highly impactful papers from a large collection\nof title-abstract and potential impact pairs. These semantic features are\nfurther utilized to regress an improved metric, TNCSI_SP, which has been\nendowed with value, field, and time normalization properties. Additionally, a\ncomprehensive dataset has been constructed and released for fine-tuning the\nLLM, containing over 12,000 entries with corresponding titles, abstracts, and\nTNCSI_SP. The quantitative results, with an NDCG@20 of 0.901, demonstrate that\nthe proposed approach achieves state-of-the-art performance in predicting the\nimpact of newborn articles when compared to competitive counterparts. Finally,\nwe demonstrate a real-world application for predicting the impact of newborn\njournal articles to demonstrate its noteworthy practical value. Overall, our\nfindings challenge existing paradigms and propose a shift towards a more\ncontent-focused prediction of academic impact, offering new insights for\nassessing newborn article impact.", "paper_summary_zh": "隨著學術領域的擴展，在大量新出版的作品中有效找出潛在高影響力文章的挑戰變得至關重要。本文介紹了一種有前途的方法，利用微調 LLM 的能力來預測新生文章的未來影響，僅根據標題和摘要。超越了傳統方法，該方法依賴於外部資訊，提出的方法從大量的標題摘要和潛在影響對中辨別出高影響力論文的共用語義特徵。這些語義特徵進一步用於回歸一個改進的指標 TNCSI_SP，該指標已賦予值、欄位和時間正規化屬性。此外，還構建並發布了一個綜合資料集，用於微調 LLM，其中包含超過 12,000 個條目，以及對應的標題、摘要和 TNCSI_SP。定量結果，NDCG@20 為 0.901，證明了與競爭對手相比，所提出的方法在預測新生文章的影響方面達到了最先進的效能。最後，我們展示了一個現實世界的應用，用於預測新生期刊文章的影響，以證明其顯著的實用價值。總的來說，我們的發現挑戰了現有的範例，並建議轉向更注重內容的學術影響預測，為評估新生文章影響提供了新的見解。", "author": "Penghai Zhao et.al.", "authors": "Penghai Zhao, Qinghua Xing, Kairan Dou, Jinyu Tian, Ying Tai, Jian Yang, Ming-Ming Cheng, Xiang Li", "id": "2408.03934v1", "paper_url": "http://arxiv.org/abs/2408.03934v1", "repo": "null"}}