{"2411.18922": {"publish_time": "2024-11-28", "title": "Devising a Set of Compact and Explainable Spoken Language Feature for Screening Alzheimer's Disease", "paper_summary": "Alzheimer's disease (AD) has become one of the most significant health\nchallenges in an aging society. The use of spoken language-based AD detection\nmethods has gained prevalence due to their scalability due to their\nscalability. Based on the Cookie Theft picture description task, we devised an\nexplainable and effective feature set that leverages the visual capabilities of\na large language model (LLM) and the Term Frequency-Inverse Document Frequency\n(TF-IDF) model. Our experimental results show that the newly proposed features\nconsistently outperform traditional linguistic features across two different\nclassifiers with high dimension efficiency. Our new features can be well\nexplained and interpreted step by step which enhance the interpretability of\nautomatic AD screening.", "paper_summary_zh": "阿茲海默症 (AD) 已成為高齡化社會中最重要的健康挑戰之一。基於其可擴充性，使用基於口語的 AD 檢測方法已獲得普遍使用。根據 Cookie Theft 圖片描述任務，我們設計了一個可解釋且有效的特徵集，它利用大型語言模型 (LLM) 的視覺功能和詞頻-逆向文件頻率 (TF-IDF) 模型。我們的實驗結果表明，新提出的特徵在兩個不同分類器中始終優於傳統語言特徵，且具有高維度效率。我們的特徵可以很好地解釋和逐步詮釋，這增強了自動 AD 篩檢的可解釋性。", "author": "Junan Li et.al.", "authors": "Junan Li, Yunxiang Li, Yuren Wang, Xixin Wu, Helen Meng", "id": "2411.18922v1", "paper_url": "http://arxiv.org/abs/2411.18922v1", "repo": "null"}}