{"2409.11192": {"publish_time": "2024-09-17", "title": "Towards Ethical Personal AI Applications: Practical Considerations for AI Assistants with Long-Term Memory", "paper_summary": "One application area of long-term memory (LTM) capabilities with increasing\ntraction is personal AI companions and assistants. With the ability to retain\nand contextualize past interactions and adapt to user preferences, personal AI\ncompanions and assistants promise a profound shift in how we interact with AI\nand are on track to become indispensable in personal and professional settings.\nHowever, this advancement introduces new challenges and vulnerabilities that\nrequire careful consideration regarding the deployment and widespread use of\nthese systems. The goal of this paper is to explore the broader implications of\nbuilding and deploying personal AI applications with LTM capabilities using a\nholistic evaluation approach. This will be done in three ways: 1) reviewing the\ntechnological underpinnings of LTM in Large Language Models, 2) surveying\ncurrent personal AI companions and assistants, and 3) analyzing critical\nconsiderations and implications of deploying and using these applications.", "paper_summary_zh": "長期記憶 (LTM) 能力的應用領域之一是個人 AI 伴侶和助理，其吸引力正與日俱增。個人 AI 伴侶和助理具備保留和將過去互動脈絡化，以及適應使用者偏好的能力，承諾將徹底改變我們與 AI 互動的方式，並有望在個人和專業領域中變得不可或缺。然而，這項進展帶來了新的挑戰和漏洞，需要仔細考量這些系統的部署和廣泛使用。本文的目標是利用整體評估方法探討建構和部署具備 LTM 能力的個人 AI 應用程式的廣泛影響。這將透過三種方式進行：1) 檢視大型語言模型中 LTM 的技術基礎，2) 調查目前的個人 AI 伴侶和助理，以及 3) 分析部署和使用這些應用程式的關鍵考量和影響。", "author": "Eunhae Lee et.al.", "authors": "Eunhae Lee", "id": "2409.11192v1", "paper_url": "http://arxiv.org/abs/2409.11192v1", "repo": "null"}}