{"2407.14430": {"publish_time": "2024-07-19", "title": "The Extrapolation Power of Implicit Models", "paper_summary": "In this paper, we investigate the extrapolation capabilities of implicit deep\nlearning models in handling unobserved data, where traditional deep neural\nnetworks may falter. Implicit models, distinguished by their adaptability in\nlayer depth and incorporation of feedback within their computational graph, are\nput to the test across various extrapolation scenarios: out-of-distribution,\ngeographical, and temporal shifts. Our experiments consistently demonstrate\nsignificant performance advantage with implicit models. Unlike their\nnon-implicit counterparts, which often rely on meticulous architectural design\nfor each task, implicit models demonstrate the ability to learn complex model\nstructures without the need for task-specific design, highlighting their\nrobustness in handling unseen data.", "paper_summary_zh": "在本文中，我們探討了隱式深度學習模型在處理傳統深度神經網路可能失敗的未觀察資料時的推廣能力。隱式模型以其在層深度中的適應性和在其計算圖中加入回饋而區別於其他模型，並在各種外推情境中接受測試：分佈外、地理和時間轉移。我們的實驗持續證明隱式模型具有顯著的效能優勢。與其非隱式對應模型不同，後者通常依賴於每個任務的細緻架構設計，隱式模型展示了在無需任務特定設計的情況下學習複雜模型結構的能力，突顯了其在處理未見資料時的穩健性。", "author": "Juliette Decugis et.al.", "authors": "Juliette Decugis, Alicia Y. Tsai, Max Emerling, Ashwin Ganesh, Laurent El Ghaoui", "id": "2407.14430v1", "paper_url": "http://arxiv.org/abs/2407.14430v1", "repo": "null"}}