{"2406.14829": {"publish_time": "2024-06-21", "title": "Is this a bad table? A Closer Look at the Evaluation of Table Generation from Text", "paper_summary": "Understanding whether a generated table is of good quality is important to be\nable to use it in creating or editing documents using automatic methods. In\nthis work, we underline that existing measures for table quality evaluation\nfail to capture the overall semantics of the tables, and sometimes unfairly\npenalize good tables and reward bad ones. We propose TabEval, a novel table\nevaluation strategy that captures table semantics by first breaking down a\ntable into a list of natural language atomic statements and then compares them\nwith ground truth statements using entailment-based measures. To validate our\napproach, we curate a dataset comprising of text descriptions for 1,250 diverse\nWikipedia tables, covering a range of topics and structures, in contrast to the\nlimited scope of existing datasets. We compare TabEval with existing metrics\nusing unsupervised and supervised text-to-table generation methods,\ndemonstrating its stronger correlation with human judgments of table quality\nacross four datasets.", "paper_summary_zh": "了解生成的表格是否具有良好的品質對於能夠使用自動化方法建立或編輯文件來說非常重要。在這項工作中，我們強調現有的表格品質評估措施無法掌握表格的整體語意，有時還會不公平地懲罰好的表格並獎勵壞的表格。我們提出 TabEval，這是一種新穎的表格評估策略，它透過先將表格分解成自然語言原子陳述的清單，然後使用基於蘊涵的措施與真實陳述進行比較，來掌握表格語意。為了驗證我們的做法，我們整理了一個資料集，其中包含 1,250 個不同的維基百科表格的文字說明，涵蓋各種主題和結構，與現有資料集的範圍有限不同。我們使用非監督式和監督式文字轉表格生成方法，將 TabEval 與現有的指標進行比較，證明它與人類對四個資料集中表格品質的判斷具有更強的相關性。", "author": "Pritika Ramu et.al.", "authors": "Pritika Ramu, Aparna Garimella, Sambaran Bandyopadhyay", "id": "2406.14829v1", "paper_url": "http://arxiv.org/abs/2406.14829v1", "repo": "null"}}