{"2405.20331": {"publish_time": "2024-05-30", "title": "CoSy: Evaluating Textual Explanations of Neurons", "paper_summary": "A crucial aspect of understanding the complex nature of Deep Neural Networks\n(DNNs) is the ability to explain learned concepts within their latent\nrepresentations. While various methods exist to connect neurons to textual\ndescriptions of human-understandable concepts, evaluating the quality of these\nexplanation methods presents a major challenge in the field due to a lack of\nunified, general-purpose quantitative evaluation. In this work, we introduce\nCoSy (Concept Synthesis) -- a novel, architecture-agnostic framework to\nevaluate the quality of textual explanations for latent neurons. Given textual\nexplanations, our proposed framework leverages a generative model conditioned\non textual input to create data points representing the textual explanation.\nThen, the neuron's response to these explanation data points is compared with\nthe response to control data points, providing a quality estimate of the given\nexplanation. We ensure the reliability of our proposed framework in a series of\nmeta-evaluation experiments and demonstrate practical value through insights\nfrom benchmarking various concept-based textual explanation methods for\nComputer Vision tasks, showing that tested explanation methods significantly\ndiffer in quality.", "paper_summary_zh": "深入了解深度神经網路 (DNN) 複雜本質的關鍵面向，在於解釋其潛在表徵中所學得的概念。雖然有各種方法可以將神經元連接到人類可理解概念的文字描述，但評估這些解釋方法的品質，由於缺乏統一且通用的量化評估，因此成為該領域的一項重大挑戰。在這項工作中，我們引入了 CoSy (概念合成)——一個創新的、與架構無關的架構，用於評估潛在神經元的文字解釋品質。針對文字解釋，我們提出的架構利用條件生成模型，根據文字輸入建立代表文字解釋的資料點。然後，將神經元對這些解釋資料點的反應與對控制資料點的反應進行比較，提供對給定解釋的品質評估。我們在多項後設評估實驗中確保了我們提出的架構的可靠性，並透過對各種基於概念的文字解釋方法進行電腦視覺任務基準測試的見解，展示了其實用價值，證明經過測試的解釋方法在品質上存在顯著差異。", "author": "Laura Kopf et.al.", "authors": "Laura Kopf, Philine Lou Bommer, Anna Hedström, Sebastian Lapuschkin, Marina M. -C. Höhne, Kirill Bykov", "id": "2405.20331v1", "paper_url": "http://arxiv.org/abs/2405.20331v1", "repo": "https://github.com/lkopf/cosy"}}