{"2504.11349": {"publish_time": "2025-04-15", "title": "Explicit and Implicit Representations in AI-based 3D Reconstruction for Radiology: A systematic literature review", "paper_summary": "The demand for high-quality medical imaging in clinical practice and assisted\ndiagnosis has made 3D reconstruction in radiological imaging a key research\nfocus. Artificial intelligence (AI) has emerged as a promising approach to\nenhancing reconstruction accuracy while reducing acquisition and processing\ntime, thereby minimizing patient radiation exposure and discomfort and\nultimately benefiting clinical diagnosis. This review explores state-of-the-art\nAI-based 3D reconstruction algorithms in radiological imaging, categorizing\nthem into explicit and implicit approaches based on their underlying\nprinciples. Explicit methods include point-based, volume-based, and Gaussian\nrepresentations, while implicit methods encompass implicit prior embedding and\nneural radiance fields. Additionally, we examine commonly used evaluation\nmetrics and benchmark datasets. Finally, we discuss the current state of\ndevelopment, key challenges, and future research directions in this evolving\nfield. Our project available on: https://github.com/Bean-Young/AI4Med.", "paper_summary_zh": "臨床實務和輔助診斷中對高品質醫學影像的需求，使得放射影像中的 3D 重建成為重要的研究焦點。人工智能 (AI) 已成為一種很有前景的方法，可以提高重建的準確性，同時減少採集和處理時間，從而最大限度地減少患者的輻射暴露和不適感，最終有利於臨床診斷。本綜述探討了放射影像中基於 AI 的最新 3D 重建算法，並根據其基本原理將其分為顯式和隱式方法。顯式方法包括基於點、基於體積和高斯表示，而隱式方法則包含隱式先驗嵌入和神經輻射場。此外，我們還探討了常用的評估指標和基準數據集。最後，我們討論了這個不斷發展的領域的發展現狀、主要挑戰和未來的研究方向。我們的項目可在以下網址獲得：https://github.com/Bean-Young/AI4Med。\n", "author": "Yuezhe Yang et.al.", "authors": "Yuezhe Yang, Boyu Yang, Yaqian Wang, Yang He, Xingbo Dong, Zhe Jin", "id": "2504.11349v1", "paper_url": "http://arxiv.org/abs/2504.11349v1", "repo": "null"}}