{"2411.18583": {"publish_time": "2024-11-27", "title": "Automated Literature Review Using NLP Techniques and LLM-Based Retrieval-Augmented Generation", "paper_summary": "This research presents and compares multiple approaches to automate the\ngeneration of literature reviews using several Natural Language Processing\n(NLP) techniques and retrieval-augmented generation (RAG) with a Large Language\nModel (LLM). The ever-increasing number of research articles provides a huge\nchallenge for manual literature review. It has resulted in an increased demand\nfor automation. Developing a system capable of automatically generating the\nliterature reviews from only the PDF files as input is the primary objective of\nthis research work. The effectiveness of several Natural Language Processing\n(NLP) strategies, such as the frequency-based method (spaCy), the transformer\nmodel (Simple T5), and retrieval-augmented generation (RAG) with Large Language\nModel (GPT-3.5-turbo), is evaluated to meet the primary objective. The SciTLDR\ndataset is chosen for this research experiment and three distinct techniques\nare utilized to implement three different systems for auto-generating the\nliterature reviews. The ROUGE scores are used for the evaluation of all three\nsystems. Based on the evaluation, the Large Language Model GPT-3.5-turbo\nachieved the highest ROUGE-1 score, 0.364. The transformer model comes in\nsecond place and spaCy is at the last position. Finally, a graphical user\ninterface is created for the best system based on the large language model.", "paper_summary_zh": "本研究提出並比較多種自動化生成文獻回顧的方法，這些方法使用多種自然語言處理 (NLP) 技術和檢索增強生成 (RAG) 與大型語言模型 (LLM)。研究文章數量不斷增加，對手動文獻回顧構成巨大挑戰。這導致對自動化的需求增加。開發一個能夠僅從 PDF 檔案作為輸入自動生成文獻回顧的系統是本研究工作的主要目標。評估多種自然語言處理 (NLP) 策略的有效性，例如基於頻率的方法 (spaCy)、Transformer模型 (Simple T5) 和檢索增強生成 (RAG) 與大型語言模型 (GPT-3.5-turbo)，以滿足主要目標。本研究實驗選擇 SciTLDR 資料集，並利用三種不同的技術來實作三個不同的系統，以自動生成文獻回顧。ROUGE 分數用於評估所有三個系統。根據評估，大型語言模型 GPT-3.5-turbo 達到最高的 ROUGE-1 分數 0.364。Transformer模型排名第二，spaCy 排名最後。最後，針對基於大型語言模型的最佳系統建立圖形使用者介面。", "author": "Nurshat Fateh Ali et.al.", "authors": "Nurshat Fateh Ali, Md. Mahdi Mohtasim, Shakil Mosharrof, T. Gopi Krishna", "id": "2411.18583v1", "paper_url": "http://arxiv.org/abs/2411.18583v1", "repo": "null"}}