{"2502.03129": {"publish_time": "2025-02-05", "title": "Teaching Large Language Models Number-Focused Headline Generation With Key Element Rationales", "paper_summary": "Number-focused headline generation is a summarization task requiring both\nhigh textual quality and precise numerical accuracy, which poses a unique\nchallenge for Large Language Models (LLMs). Existing studies in the literature\nfocus only on either textual quality or numerical reasoning and thus are\ninadequate to address this challenge. In this paper, we propose a novel\nchain-of-thought framework for using rationales comprising key elements of the\nTopic, Entities, and Numerical reasoning (TEN) in news articles to enhance the\ncapability for LLMs to generate topic-aligned high-quality texts with precise\nnumerical accuracy. Specifically, a teacher LLM is employed to generate TEN\nrationales as supervision data, which are then used to teach and fine-tune a\nstudent LLM. Our approach teaches the student LLM automatic generation of\nrationales with enhanced capability for numerical reasoning and topic-aligned\nnumerical headline generation. Experiments show that our approach achieves\nsuperior performance in both textual quality and numerical accuracy.", "paper_summary_zh": "數字導向的標題生成是一種摘要任務，既需要高文字品質，又需要精確的數字準確度，這對大型語言模型 (LLM) 構成獨特的挑戰。現有文獻中的研究僅專注於文字品質或數字推理，因此無法解決此挑戰。在本文中，我們提出一個新穎的思考鏈架構，用於使用新聞文章中主題、實體和數字推理 (TEN) 的關鍵元素組成的依據，以增強 LLM 生成與主題一致的高品質文本和精確數字準確度的能力。具體來說，採用教師 LLM 生成 TEN 依據作為監督資料，然後用於教授和微調學生 LLM。我們的做法教導學生 LLM 自動生成具有增強數字推理能力和與主題一致的數字標題生成的依據。實驗表明，我們的做法在文字品質和數字準確度方面都取得優異的表現。", "author": "Zhen Qian et.al.", "authors": "Zhen Qian, Xiuzhen Zhang, Xiaofei Xu, Feng Xia", "id": "2502.03129v1", "paper_url": "http://arxiv.org/abs/2502.03129v1", "repo": "null"}}