{"2501.09525": {"publish_time": "2025-01-16", "title": "Class Incremental Fault Diagnosis under Limited Fault Data via Supervised Contrastive Knowledge Distillation", "paper_summary": "Class-incremental fault diagnosis requires a model to adapt to new fault\nclasses while retaining previous knowledge. However, limited research exists\nfor imbalanced and long-tailed data. Extracting discriminative features from\nfew-shot fault data is challenging, and adding new fault classes often demands\ncostly model retraining. Moreover, incremental training of existing methods\nrisks catastrophic forgetting, and severe class imbalance can bias the model's\ndecisions toward normal classes. To tackle these issues, we introduce a\nSupervised Contrastive knowledge distiLlation for class Incremental Fault\nDiagnosis (SCLIFD) framework proposing supervised contrastive knowledge\ndistillation for improved representation learning capability and less\nforgetting, a novel prioritized exemplar selection method for sample replay to\nalleviate catastrophic forgetting, and the Random Forest Classifier to address\nthe class imbalance. Extensive experimentation on simulated and real-world\nindustrial datasets across various imbalance ratios demonstrates the\nsuperiority of SCLIFD over existing approaches. Our code can be found at\nhttps://github.com/Zhang-Henry/SCLIFD_TII.", "paper_summary_zh": "類別增量式故障診斷需要一個模型來適應新的故障類別，同時保留先前的知識。然而，對於不平衡且長尾的資料，研究有限。從少次故障資料中提取區別性特徵具有挑戰性，而新增故障類別通常需要代價高昂的模型重新訓練。此外，現有方法的增量訓練有災難性遺忘的風險，而嚴重的類別不平衡可能會使模型的決策偏向正常類別。為了解決這些問題，我們引入了一個類別增量式故障診斷的監督對比知識蒸餾（SCLIFD）框架，提出了監督對比知識蒸餾，以提高表示學習能力並減少遺忘，一種新的優先範例選擇方法，用於樣本重播以減輕災難性遺忘，以及隨機森林分類器來解決類別不平衡。在各種不平衡率下對模擬和真實世界工業資料集進行的廣泛實驗證明了 SCLIFD 優於現有方法。我們的程式碼可以在 https://github.com/Zhang-Henry/SCLIFD_TII 找到。", "author": "Hanrong Zhang et.al.", "authors": "Hanrong Zhang, Yifei Yao, Zixuan Wang, Jiayuan Su, Mengxuan Li, Peng Peng, Hongwei Wang", "id": "2501.09525v1", "paper_url": "http://arxiv.org/abs/2501.09525v1", "repo": "https://github.com/zhang-henry/sclifd_tii"}}