{"2405.16877": {"publish_time": "2024-05-27", "title": "Are Self-Attentions Effective for Time Series Forecasting?", "paper_summary": "Time series forecasting is crucial for applications across multiple domains\nand various scenarios. Although Transformer models have dramatically shifted\nthe landscape of forecasting, their effectiveness remains debated. Recent\nfindings have indicated that simpler linear models might outperform complex\nTransformer-based approaches, highlighting the potential for more streamlined\narchitectures. In this paper, we shift focus from the overall architecture of\nthe Transformer to the effectiveness of self-attentions for time series\nforecasting. To this end, we introduce a new architecture, Cross-Attention-only\nTime Series transformer (CATS), that rethinks the traditional Transformer\nframework by eliminating self-attention and leveraging cross-attention\nmechanisms instead. By establishing future horizon-dependent parameters as\nqueries and enhanced parameter sharing, our model not only improves long-term\nforecasting accuracy but also reduces the number of parameters and memory\nusage. Extensive experiment across various datasets demonstrates that our model\nachieves superior performance with the lowest mean squared error and uses fewer\nparameters compared to existing models.", "paper_summary_zh": "時間序列預測對跨多個領域和各種情境的應用至關重要。雖然 Transformer 模型已大幅改變預測的格局，但其有效性仍有爭議。最近的發現顯示，較簡單的線性模型可能優於複雜的基於 Transformer 的方法，突顯了更精簡架構的潛力。在本文中，我們將焦點從 Transformer 的整體架構轉移到自注意力在時間序列預測中的有效性。為此，我們引入了一種新的架構，稱為僅交叉注意力的時間序列 Transformer (CATS)，它重新思考傳統的 Transformer 框架，方法是消除自注意力並改用交叉注意力機制。透過將未來時間範圍依賴參數設定為查詢並增強參數共享，我們的模型不僅提高了長期預測的準確性，而且還減少了參數和記憶體使用量。跨各種資料集的廣泛實驗證明，與現有模型相比，我們的模型以最低的均方誤差實現了卓越的效能，並且使用了較少的參數。", "author": "Dongbin Kim et.al.", "authors": "Dongbin Kim, Jinseong Park, Jaewook Lee, Hoki Kim", "id": "2405.16877v1", "paper_url": "http://arxiv.org/abs/2405.16877v1", "repo": "null"}}