{"2410.17759": {"publish_time": "2024-10-23", "title": "Latent Structures of Intertextuality in French Fiction", "paper_summary": "Intertextuality is a key concept in literary theory that challenges\ntraditional notions of text, signification or authorship. It views texts as\npart of a vast intertextual network that is constantly evolving and being\nreconfigured. This paper argues that the field of computational literary\nstudies is the ideal place to conduct a study of intertextuality since we have\nnow the ability to systematically compare texts with each others. Specifically,\nwe present a work on a corpus of more than 12.000 French fictions from the\n18th, 19th and early 20th century. We focus on evaluating the underlying roles\nof two literary notions, sub-genres and the literary canon in the framing of\ntextuality. The article attempts to operationalize intertextuality using\nstate-of-the-art contextual language models to encode novels and capture\nfeatures that go beyond simple lexical or thematic approaches. Previous\nresearch (Hughes, 2012) supports the existence of a literary \"style of a time\",\nand our findings further reinforce this concept. Our findings also suggest that\nboth subgenres and canonicity play a significant role in shaping textual\nsimilarities within French fiction. These discoveries point to the importance\nof considering genre and canon as dynamic forces that influence the evolution\nand intertextual connections of literary works within specific historical\ncontexts.", "paper_summary_zh": "<paragraph>互文性是文學理論中的關鍵概念，挑戰了傳統的文本、符號或作者概念。它將文本視為一個不斷演化和重組的龐大互文網絡的一部分。本文認為，計算機文學研究領域是進行互文性研究的理想場所，因為我們現在有能力系統地比較文本。具體而言，我們提出了一項關於 18 世紀、19 世紀和 20 世紀初超過 12.000 部法語小說語料庫的研究工作。我們專注於評估兩個文學概念（子類型和文學經典）在文本框架中的基礎作用。本文嘗試使用最先進的上下文語言模型對小說進行編碼並捕捉超越簡單詞彙或主題方法的功能，以使互文性可操作。先前的研究（Hughes，2012 年）支持文學「時代風格」的存在，我們的研究結果進一步強化了這一概念。我們的研究結果還表明，子類型和經典性在塑造法語小說中的文本相似性方面都發揮著重要作用。這些發現表明，將類型和經典視為影響特定歷史背景中文學作品的演變和互文聯繫的動態力量非常重要。</paragraph>", "author": "Jean Barré et.al.", "authors": "Jean Barré", "id": "2410.17759v1", "paper_url": "http://arxiv.org/abs/2410.17759v1", "repo": "null"}}