{"2406.18518": {"publish_time": "2024-06-26", "title": "APIGen: Automated Pipeline for Generating Verifiable and Diverse Function-Calling Datasets", "paper_summary": "The advancement of function-calling agent models requires diverse, reliable,\nand high-quality datasets. This paper presents APIGen, an automated data\ngeneration pipeline designed to synthesize verifiable high-quality datasets for\nfunction-calling applications. We leverage APIGen and collect 3,673 executable\nAPIs across 21 different categories to generate diverse function-calling\ndatasets in a scalable and structured manner. Each data in our dataset is\nverified through three hierarchical stages: format checking, actual function\nexecutions, and semantic verification, ensuring its reliability and\ncorrectness. We demonstrate that models trained with our curated datasets, even\nwith only 7B parameters, can achieve state-of-the-art performance on the\nBerkeley Function-Calling Benchmark, outperforming multiple GPT-4 models.\nMoreover, our 1B model achieves exceptional performance, surpassing\nGPT-3.5-Turbo and Claude-3 Haiku. We release a dataset containing 60,000\nhigh-quality entries, aiming to advance the field of function-calling agent\ndomains. The dataset is available on Huggingface:\nhttps://huggingface.co/datasets/Salesforce/xlam-function-calling-60k and the\nproject homepage: https://apigen-pipeline.github.io/", "paper_summary_zh": "函數呼叫代理模型的進步需要多樣化、可靠且高品質的資料集。本文提出了 APIGen，這是一個自動化資料生成管線，旨在為函數呼叫應用程式合成可驗證的高品質資料集。我們利用 APIGen 並收集 21 個不同類別中的 3,673 個可執行 API，以可擴充且結構化的方式產生多樣化的函數呼叫資料集。我們資料集中的每個資料都透過三個階層階段進行驗證：格式檢查、實際函數執行和語義驗證，確保其可靠性和正確性。我們證明使用我們整理的資料集訓練的模型，即使只有 7B 個參數，也能在 Berkeley Function-Calling Benchmark 上達到最先進的效能，優於多個 GPT-4 模型。此外，我們的 1B 模型達到了非凡的效能，超越了 GPT-3.5-Turbo 和 Claude-3 Haiku。我們發布了一個包含 60,000 個高品質條目的資料集，旨在推進函數呼叫代理領域。該資料集可在 Huggingface 上取得：https://huggingface.co/datasets/Salesforce/xlam-function-calling-60k，專案首頁為：https://apigen-pipeline.github.io/", "author": "Zuxin Liu et.al.", "authors": "Zuxin Liu, Thai Hoang, Jianguo Zhang, Ming Zhu, Tian Lan, Shirley Kokane, Juntao Tan, Weiran Yao, Zhiwei Liu, Yihao Feng, Rithesh Murthy, Liangwei Yang, Silvio Savarese, Juan Carlos Niebles, Huan Wang, Shelby Heinecke, Caiming Xiong", "id": "2406.18518v1", "paper_url": "http://arxiv.org/abs/2406.18518v1", "repo": "null"}}