{"2409.05275": {"publish_time": "2024-09-09", "title": "RexUniNLU: Recursive Method with Explicit Schema Instructor for Universal NLU", "paper_summary": "Information Extraction (IE) and Text Classification (CLS) serve as the\nfundamental pillars of NLU, with both disciplines relying on analyzing input\nsequences to categorize outputs into pre-established schemas. However, there is\nno existing encoder-based model that can unify IE and CLS tasks from this\nperspective. To fully explore the foundation shared within NLU tasks, we have\nproposed a Recursive Method with Explicit Schema Instructor for Universal NLU.\nSpecifically, we firstly redefine the true universal information extraction\n(UIE) with a formal formulation that covers almost all extraction schemas,\nincluding quadruples and quintuples which remain unsolved for previous UIE\nmodels. Then, we expands the formulation to all CLS and multi-modal NLU tasks.\nBased on that, we introduce RexUniNLU, an universal NLU solution that employs\nexplicit schema constraints for IE and CLS, which encompasses all IE and CLS\ntasks and prevent incorrect connections between schema and input sequence. To\navoid interference between different schemas, we reset the position ids and\nattention mask matrices. Extensive experiments are conducted on IE, CLS in both\nEnglish and Chinese, and multi-modality, revealing the effectiveness and\nsuperiority. Our codes are publicly released.", "paper_summary_zh": "資訊萃取 (IE) 和文字分類 (CLS) 是 NLU 的基本支柱，這兩個領域都依賴於分析輸入序列，將輸出分類到預先建立的架構中。然而，從這個角度來看，目前沒有現有的編碼器模型可以統一 IE 和 CLS 任務。為了充分探索 NLU 任務中共享的基礎，我們提出了具有明確架構指導的遞迴方法，用於通用 NLU。具體來說，我們首先使用涵蓋幾乎所有萃取架構的正式公式重新定義真正的通用資訊萃取 (UIE)，包括先前 UIE 模型仍無法解決的四元組和五元組。然後，我們將公式擴展到所有 CLS 和多模態 NLU 任務。基於此，我們引入了 RexUniNLU，這是一個通用 NLU 解决方案，採用明確的架構約束來進行 IE 和 CLS，涵蓋所有 IE 和 CLS 任務，並防止架構和輸入序列之間出現不正確的連接。為了避免不同架構之間的干擾，我們重設位置 ID 和注意力遮罩矩陣。在 IE、CLS（包括英文和中文）和多模態上進行了廣泛的實驗，揭示了其有效性和優越性。我們的程式碼已公開發布。", "author": "Chengyuan Liu et.al.", "authors": "Chengyuan Liu, Shihang Wang, Fubang Zhao, Kun Kuang, Yangyang Kang, Weiming Lu, Changlong Sun, Fei Wu", "id": "2409.05275v1", "paper_url": "http://arxiv.org/abs/2409.05275v1", "repo": "null"}}