{"2502.13962": {"publish_time": "2025-02-19", "title": "Is That Your Final Answer? Test-Time Scaling Improves Selective Question Answering", "paper_summary": "Scaling the test-time compute of large language models has demonstrated\nimpressive performance on reasoning benchmarks. However, existing evaluations\nof test-time scaling make the strong assumption that a reasoning system should\nalways give an answer to any question provided. This overlooks concerns about\nwhether a model is confident in its answer, and whether it is appropriate to\nalways provide a response. To address these concerns, we extract confidence\nscores during reasoning for thresholding model responses. We find that\nincreasing compute budget at inference time not only helps models answer more\nquestions correctly, but also increases confidence in correct responses. We\nthen extend the current paradigm of zero-risk responses during evaluation by\nconsidering settings with non-zero levels of response risk, and suggest a\nrecipe for reporting evaluations under these settings.", "paper_summary_zh": "擴充大型語言模型的測試時間運算已在推理基準測試中展現令人印象深刻的效能。然而，現有的測試時間擴充評估會做出強烈的假設，認為推理系統應始終對所提供的任何問題給出答案。這忽略了關於模型是否對其答案有信心，以及是否適當始終提供回應的疑慮。為了解決這些疑慮，我們在推理期間提取信心分數，以設定模型回應的閾值。我們發現，在推論時間增加運算預算不僅有助於模型正確回答更多問題，還能增加對正確回應的信心。然後，我們透過考慮具有非零回應風險層級的設定，擴充評估期間零風險回應的現行範例，並建議在這些設定下報告評估的配方。", "author": "William Jurayj et.al.", "authors": "William Jurayj, Jeffrey Cheng, Benjamin Van Durme", "id": "2502.13962v1", "paper_url": "http://arxiv.org/abs/2502.13962v1", "repo": "null"}}