{"2411.08954": {"publish_time": "2024-11-13", "title": "Inconsistencies In Consistency Models: Better ODE Solving Does Not Imply Better Samples", "paper_summary": "Although diffusion models can generate remarkably high-quality samples, they\nare intrinsically bottlenecked by their expensive iterative sampling procedure.\nConsistency models (CMs) have recently emerged as a promising diffusion model\ndistillation method, reducing the cost of sampling by generating high-fidelity\nsamples in just a few iterations. Consistency model distillation aims to solve\nthe probability flow ordinary differential equation (ODE) defined by an\nexisting diffusion model. CMs are not directly trained to minimize error\nagainst an ODE solver, rather they use a more computationally tractable\nobjective. As a way to study how effectively CMs solve the probability flow\nODE, and the effect that any induced error has on the quality of generated\nsamples, we introduce Direct CMs, which \\textit{directly} minimize this error.\nIntriguingly, we find that Direct CMs reduce the ODE solving error compared to\nCMs but also result in significantly worse sample quality, calling into\nquestion why exactly CMs work well in the first place. Full code is available\nat: https://github.com/layer6ai-labs/direct-cms.", "paper_summary_zh": "儘管擴散模型可以產生品質極高的樣本，但它們本質上會受到其昂貴的迭代採樣程序的瓶頸。一致性模型 (CM) 最近已成為一種有前途的擴散模型蒸餾方法，它透過在僅幾次迭代中產生高保真樣本來降低採樣的成本。一致性模型蒸餾旨在解決由現有擴散模型定義的機率流常微分方程式 (ODE)。CM 並非直接訓練來最小化相對於 ODE 求解器的誤差，而是使用計算上更易於處理的目標。為了研究 CM 有效解決機率流 ODE 的方式，以及任何誘發誤差對所產生樣本品質的影響，我們引入了直接 CM，它\\textit{直接}最小化此誤差。有趣的是，我們發現與 CM 相比，直接 CM 減少了 ODE 求解誤差，但也導致樣本品質顯著惡化，這會讓人質疑 CM 究竟為何一開始就能運作良好。完整程式碼可於下列網址取得：https://github.com/layer6ai-labs/direct-cms。", "author": "Noël Vouitsis et.al.", "authors": "Noël Vouitsis, Rasa Hosseinzadeh, Brendan Leigh Ross, Valentin Villecroze, Satya Krishna Gorti, Jesse C. Cresswell, Gabriel Loaiza-Ganem", "id": "2411.08954v1", "paper_url": "http://arxiv.org/abs/2411.08954v1", "repo": "https://github.com/layer6ai-labs/direct-cms"}}