{"2409.16673": {"publish_time": "2024-09-25", "title": "SWE2: SubWord Enriched and Significant Word Emphasized Framework for Hate Speech Detection", "paper_summary": "Hate speech detection on online social networks has become one of the\nemerging hot topics in recent years. With the broad spread and fast propagation\nspeed across online social networks, hate speech makes significant impacts on\nsociety by increasing prejudice and hurting people. Therefore, there are\naroused attention and concern from both industry and academia. In this paper,\nwe address the hate speech problem and propose a novel hate speech detection\nframework called SWE2, which only relies on the content of messages and\nautomatically identifies hate speech. In particular, our framework exploits\nboth word-level semantic information and sub-word knowledge. It is intuitively\npersuasive and also practically performs well under a situation with/without\ncharacter-level adversarial attack. Experimental results show that our proposed\nmodel achieves 0.975 accuracy and 0.953 macro F1, outperforming 7\nstate-of-the-art baselines under no adversarial attack. Our model robustly and\nsignificantly performed well under extreme adversarial attack (manipulation of\n50% messages), achieving 0.967 accuracy and 0.934 macro F1.", "paper_summary_zh": "近幾年來，在線上社群網路中，仇恨言論偵測已成為新興熱門議題之一。仇恨言論在線上社群網路中廣泛散佈和快速傳播，透過加劇偏見和傷害他人，對社會造成重大影響。因此，無論是業界或學術界都引起了關注和重視。在本文中，我們探討仇恨言論問題，並提出一個名為 SWE2 的全新仇恨言論偵測架構，它僅依賴訊息內容，並自動辨識仇恨言論。特別是，我們的架構同時利用字詞層級的語意資訊和字詞知識。它直觀且具有說服力，在有/無字元層級對抗攻擊的情況下，實際執行效果也很好。實驗結果顯示，我們提出的模型在沒有對抗攻擊的情況下，達到了 0.975 的準確度和 0.953 的巨集 F1，優於 7 個最先進的基準。我們的模型在極端的對抗攻擊（50% 訊息遭竄改）下表現得相當穩健且出色，達到了 0.967 的準確度和 0.934 的巨集 F1。", "author": "Guanyi Mou et.al.", "authors": "Guanyi Mou, Pengyi Ye, Kyumin Lee", "id": "2409.16673v1", "paper_url": "http://arxiv.org/abs/2409.16673v1", "repo": "null"}}