{"2406.12435": {"publish_time": "2024-06-18", "title": "Federated Learning with Limited Node Labels", "paper_summary": "Subgraph federated learning (SFL) is a research methodology that has gained\nsignificant attention for its potential to handle distributed graph-structured\ndata. In SFL, the local model comprises graph neural networks (GNNs) with a\npartial graph structure. However, some SFL models have overlooked the\nsignificance of missing cross-subgraph edges, which can lead to local GNNs\nbeing unable to message-pass global representations to other parties' GNNs.\nMoreover, existing SFL models require substantial labeled data, which limits\ntheir practical applications. To overcome these limitations, we present a novel\nSFL framework called FedMpa that aims to learn cross-subgraph node\nrepresentations. FedMpa first trains a multilayer perceptron (MLP) model using\na small amount of data and then propagates the federated feature to the local\nstructures. To further improve the embedding representation of nodes with local\nsubgraphs, we introduce the FedMpae method, which reconstructs the local graph\nstructure with an innovation view that applies pooling operation to form\nsuper-nodes. Our extensive experiments on six graph datasets demonstrate that\nFedMpa is highly effective in node classification. Furthermore, our ablation\nexperiments verify the effectiveness of FedMpa.", "paper_summary_zh": "子圖聯合學習 (SFL) 是一種研究方法，因其處理分散式圖形結構數據的潛力而備受關注。在 SFL 中，局部模型包含具有部分圖形結構的圖形神經網絡 (GNN)。然而，一些 SFL 模型忽視了缺少跨子圖邊緣的重要性，這可能導致局部 GNN 無法將全局表示訊息傳遞給其他方的 GNN。此外，現有的 SFL 模型需要大量的標籤數據，這限制了它們的實際應用。為了克服這些限制，我們提出了一個名為 FedMpa 的新穎 SFL 框架，旨在學習跨子圖節點表示。FedMpa 首先使用少量數據訓練多層感知器 (MLP) 模型，然後將聯合特徵傳播到局部結構。為了進一步改善具有局部子圖的節點的嵌入表示，我們引入了 FedMpae 方法，該方法通過應用池化操作形成超級節點來重建局部圖形結構。我們在六個圖形數據集上進行的廣泛實驗表明，FedMpa 在節點分類中非常有效。此外，我們的消融實驗驗證了 FedMpa 的有效性。", "author": "Bisheng Tang et.al.", "authors": "Bisheng Tang, Xiaojun Chen, Shaopu Wang, Yuexin Xuan, Zhendong Zhao", "id": "2406.12435v1", "paper_url": "http://arxiv.org/abs/2406.12435v1", "repo": "null"}}