{"2406.18690": {"publish_time": "2024-06-26", "title": "Petal-X: Human-Centered Visual Explanations to Improve Cardiovascular Risk Communication", "paper_summary": "Cardiovascular diseases (CVDs), the leading cause of death worldwide, can be\nprevented in most cases through behavioral interventions. Therefore, effective\ncommunication of CVD risk and projected risk reduction by risk factor\nmodification plays a crucial role in reducing CVD risk at the individual level.\nHowever, despite interest in refining risk estimation with improved prediction\nmodels such as SCORE2, the guidelines for presenting these risk estimations in\nclinical practice remained essentially unchanged in the last few years, with\ngraphical score charts (GSCs) continuing to be one of the prevalent systems.\nThis work describes the design and implementation of Petal-X, a novel tool to\nsupport clinician-patient shared decision-making by explaining the CVD risk\ncontributions of different factors and facilitating what-if analysis. Petal-X\nrelies on a novel visualization, Petal Product Plots, and a tailor-made global\nsurrogate model of SCORE2, whose fidelity is comparable to that of the GSCs\nused in clinical practice. We evaluated Petal-X compared to GSCs in a\ncontrolled experiment with 88 healthcare students, all but one with experience\nwith chronic patients. The results show that Petal-X outperforms GSC in\ncritical tasks, such as comparing the contribution to the patient's 10-year CVD\nrisk of each modifiable risk factor, without a significant loss of perceived\ntransparency, trust, or intent to use. Our study provides an innovative\napproach to the visualization and explanation of risk in clinical practice\nthat, due to its model-agnostic nature, could continue to support\nnext-generation artificial intelligence risk assessment models.", "paper_summary_zh": "心血管疾病 (CVD) 是全球主要的死亡原因，在大多数情况下可以通过行为干预来预防。因此，通过改变危险因子来有效沟通 CVD 风险和预测的风险降低在降低个人层面的 CVD 风险中起着至关重要的作用。然而，尽管有兴趣通过改进的预测模型（例如 SCORE2）来优化风险估计，但在临床实践中呈现这些风险估计的指南在过去几年中基本上保持不变，图形评分图表 (GSC) 仍然是流行的系统之一。这项工作描述了 Petal-X 的设计和实现，Petal-X 是一种新工具，通过解释不同因素对 CVD 风险的贡献并促进假设分析来支持临床医生和患者的共同决策。Petal-X 依赖于一种新颖的可视化工具——花瓣产品图，以及 SCORE2 的定制全局替代模型，其保真度与临床实践中使用的 GSC 相当。我们在一个受控实验中评估了 Petal-X 与 GSC 的对比，实验对象为 88 名医学生，除一人外，所有学生都有慢性病患者的经验。结果表明，Petal-X 在关键任务中优于 GSC，例如比较可改变危险因子对患者 10 年 CVD 风险的贡献，而不会显着降低感知的透明度、信任度或使用意愿。我们的研究提供了一种创新的方法来可视化和解释临床实践中的风险，由于其与模型无关的性质，可以继续支持下一代人工智能风险评估模型。", "author": "Diego Rojo et.al.", "authors": "Diego Rojo, Houda Lamqaddam, Lucija Gosak, Katrien Verbert", "id": "2406.18690v1", "paper_url": "http://arxiv.org/abs/2406.18690v1", "repo": "null"}}