{"2502.10263": {"publish_time": "2025-02-14", "title": "Large Language Models and Synthetic Data for Monitoring Dataset Mentions in Research Papers", "paper_summary": "Tracking how data is mentioned and used in research papers provides critical\ninsights for improving data discoverability, quality, and production. However,\nmanually identifying and classifying dataset mentions across vast academic\nliterature is resource-intensive and not scalable. This paper presents a\nmachine learning framework that automates dataset mention detection across\nresearch domains by leveraging large language models (LLMs), synthetic data,\nand a two-stage fine-tuning process. We employ zero-shot extraction from\nresearch papers, an LLM-as-a-Judge for quality assessment, and a reasoning\nagent for refinement to generate a weakly supervised synthetic dataset. The\nPhi-3.5-mini instruct model is pre-fine-tuned on this dataset, followed by\nfine-tuning on a manually annotated subset. At inference, a ModernBERT-based\nclassifier efficiently filters dataset mentions, reducing computational\noverhead while maintaining high recall. Evaluated on a held-out manually\nannotated sample, our fine-tuned model outperforms NuExtract-v1.5 and\nGLiNER-large-v2.1 in dataset extraction accuracy. Our results highlight how\nLLM-generated synthetic data can effectively address training data scarcity,\nimproving generalization in low-resource settings. This framework offers a\npathway toward scalable monitoring of dataset usage, enhancing transparency,\nand supporting researchers, funders, and policymakers in identifying data gaps\nand strengthening data accessibility for informed decision-making.", "paper_summary_zh": "<paragraph>追蹤研究論文中如何提及和使用資料，可提供關鍵見解，用於改善資料的可發現性、品質和產出。然而，手動識別和分類跨越廣泛學術文獻的資料集提及是耗費資源且無法擴展的。本文提出一個機器學習架構，透過利用大型語言模型 (LLM)、合成資料和兩階段微調過程，自動化跨研究領域的資料集提及偵測。我們採用從研究論文中進行零次學習萃取、作為品質評估的 LLM 和用於改善的推理代理，以產生弱監督合成資料集。Phi-3.5-mini 指導模型在此資料集上進行預微調，然後在手動標註的子集上進行微調。在推理時，基於 ModernBERT 的分類器有效濾除資料集提及，同時在維持高召回率的情況下降低運算負擔。在手動標註的留出樣本上進行評估，我們微調的模型在資料集萃取準確度上優於 NuExtract-v1.5 和 GLiNER-large-v2.1。我們的結果突顯了 LLM 生成的合成資料如何有效解決訓練資料的稀少性，並改善低資源環境中的概化能力。此架構提供了一條途徑，可擴展監控資料集使用情況、增強透明度，並協助研究人員、資助者和政策制定者識別資料差距，並加強資料的可及性，以進行明智的決策制定。</paragraph>", "author": "Aivin V. Solatorio et.al.", "authors": "Aivin V. Solatorio, Rafael Macalaba, James Liounis", "id": "2502.10263v1", "paper_url": "http://arxiv.org/abs/2502.10263v1", "repo": "null"}}