{"2412.06828": {"publish_time": "2024-12-06", "title": "Enhancing LLMs for Impression Generation in Radiology Reports through a Multi-Agent System", "paper_summary": "This study introduces \"RadCouncil,\" a multi-agent Large Language Model (LLM)\nframework designed to enhance the generation of impressions in radiology\nreports from the finding section. RadCouncil comprises three specialized\nagents: 1) a \"Retrieval\" Agent that identifies and retrieves similar reports\nfrom a vector database, 2) a \"Radiologist\" Agent that generates impressions\nbased on the finding section of the given report plus the exemplar reports\nretrieved by the Retrieval Agent, and 3) a \"Reviewer\" Agent that evaluates the\ngenerated impressions and provides feedback. The performance of RadCouncil was\nevaluated using both quantitative metrics (BLEU, ROUGE, BERTScore) and\nqualitative criteria assessed by GPT-4, using chest X-ray as a case study.\nExperiment results show improvements in RadCouncil over the single-agent\napproach across multiple dimensions, including diagnostic accuracy, stylistic\nconcordance, and clarity. This study highlights the potential of utilizing\nmultiple interacting LLM agents, each with a dedicated task, to enhance\nperformance in specialized medical tasks and the development of more robust and\nadaptable healthcare AI solutions.", "paper_summary_zh": "本研究引入了「RadCouncil」，一個多重代理大型語言模型 (LLM)\n框架，旨在增強放射科報告中印象的產生，特別是發現部分。RadCouncil 包含三個專門的代理：1) 一個「檢索」代理，用於識別並從向量資料庫中檢索類似的報告，2) 一個「放射科醫師」代理，用於根據給定報告的發現部分加上檢索代理檢索到的範例報告，產生印象，以及 3) 一個「審查者」代理，用於評估產生的印象並提供回饋。RadCouncil 的效能使用量化指標 (BLEU、ROUGE、BERTScore) 進行評估，並使用胸部 X 光作為案例研究，由 GPT-4 評估質化標準。實驗結果顯示，RadCouncil 在多個面向都有改進，包括診斷準確性、風格一致性，以及清晰度，優於單一代理方法。本研究強調了利用多個互動式 LLM 代理的潛力，每個代理都有專門的任務，以增強在專業醫療任務中的效能，並開發更強健且適應性更強的醫療保健 AI 解決方案。", "author": "Fang Zeng et.al.", "authors": "Fang Zeng, Zhiliang Lyu, Quanzheng Li, Xiang Li", "id": "2412.06828v1", "paper_url": "http://arxiv.org/abs/2412.06828v1", "repo": "null"}}