{"2411.09702": {"publish_time": "2024-11-14", "title": "On the Surprising Effectiveness of Attention Transfer for Vision Transformers", "paper_summary": "Conventional wisdom suggests that pre-training Vision Transformers (ViT)\nimproves downstream performance by learning useful representations. Is this\nactually true? We investigate this question and find that the features and\nrepresentations learned during pre-training are not essential. Surprisingly,\nusing only the attention patterns from pre-training (i.e., guiding how\ninformation flows between tokens) is sufficient for models to learn high\nquality features from scratch and achieve comparable downstream performance. We\nshow this by introducing a simple method called attention transfer, where only\nthe attention patterns from a pre-trained teacher ViT are transferred to a\nstudent, either by copying or distilling the attention maps. Since attention\ntransfer lets the student learn its own features, ensembling it with a\nfine-tuned teacher also further improves accuracy on ImageNet. We\nsystematically study various aspects of our findings on the sufficiency of\nattention maps, including distribution shift settings where they underperform\nfine-tuning. We hope our exploration provides a better understanding of what\npre-training accomplishes and leads to a useful alternative to the standard\npractice of fine-tuning", "paper_summary_zh": "傳統觀念認為預訓練視覺Transformer（ViT）\n透過學習有用的表徵來提升下游效能。這\n是否屬實？我們探討這個問題，發現預訓練期間學習到的特徵和\n表徵並非必要的。令人驚訝的是，僅使用預訓練的注意力模式（也\n就是引導資訊如何在符號之間流動）就足以讓模型從頭學習高\n品質的特徵，並達成相近的下游效能。我們透過引入一種稱為注\n意力轉移的簡單方法來證明這一點，其中僅將預訓練教師 ViT 的\n注意力模式轉移給學生，方法是複製或萃取注意力圖。由於注\n意力轉移讓學生學習自己的特徵，因此將其與微調教師結合也\n進一步提升了 ImageNet 的準確度。我們系統性地研究了我們在\n注意力圖的充分性方面的發現的各個面向，包括它們表現不如微\n調的分配轉移設定。我們希望我們的探索能提供對預訓練達成\n什麼目標的更深入理解，並提供一種有用的替代方案來取代微調\n的標準做法", "author": "Alexander C. Li et.al.", "authors": "Alexander C. Li, Yuandong Tian, Beidi Chen, Deepak Pathak, Xinlei Chen", "id": "2411.09702v1", "paper_url": "http://arxiv.org/abs/2411.09702v1", "repo": "null"}}