{"2408.04331": {"publish_time": "2024-08-08", "title": "Enhancing Journalism with AI: A Study of Contextualized Image Captioning for News Articles using LLMs and LMMs", "paper_summary": "Large language models (LLMs) and large multimodal models (LMMs) have\nsignificantly impacted the AI community, industry, and various economic\nsectors. In journalism, integrating AI poses unique challenges and\nopportunities, particularly in enhancing the quality and efficiency of news\nreporting. This study explores how LLMs and LMMs can assist journalistic\npractice by generating contextualised captions for images accompanying news\narticles. We conducted experiments using the GoodNews dataset to evaluate the\nability of LMMs (BLIP-2, GPT-4v, or LLaVA) to incorporate one of two types of\ncontext: entire news articles, or extracted named entities. In addition, we\ncompared their performance to a two-stage pipeline composed of a captioning\nmodel (BLIP-2, OFA, or ViT-GPT2) with post-hoc contextualisation with LLMs\n(GPT-4 or LLaMA). We assess a diversity of models, and we find that while the\nchoice of contextualisation model is a significant factor for the two-stage\npipelines, this is not the case in the LMMs, where smaller, open-source models\nperform well compared to proprietary, GPT-powered ones. Additionally, we found\nthat controlling the amount of provided context enhances performance. These\nresults highlight the limitations of a fully automated approach and underscore\nthe necessity for an interactive, human-in-the-loop strategy.", "paper_summary_zh": "大型語言模型 (LLM) 和大型多模態模型 (LMM) 已顯著影響了 AI 社群、產業和各種經濟部門。在新聞業中，整合 AI 構成了獨特的挑戰和機遇，特別是在提升新聞報導的品質和效率方面。本研究探討了 LLM 和 LMM 如何透過為新聞文章附圖產生情境化標題，來協助新聞實務。我們使用 GoodNews 資料集進行實驗，以評估 LMM（BLIP-2、GPT-4v 或 LLaVA）納入兩種情境類型（整篇新聞文章或抽取的命名實體）的能力。此外，我們將其效能與由標題模型（BLIP-2、OFA 或 ViT-GPT2）組成的兩階段管線進行比較，並搭配 LLM（GPT-4 或 LLaMA）進行事後情境化。我們評估了各種模型，發現雖然情境化模型的選擇是兩階段管線的重要因素，但在 LMM 中並非如此，其中較小型、開放原始碼的模型表現良好，優於專有的 GPT 驅動模型。此外，我們發現控制提供的脈絡數量會提升效能。這些結果突顯了全自動化方法的限制，並強調了互動式、人類參與策略的必要性。", "author": "Aliki Anagnostopoulou et.al.", "authors": "Aliki Anagnostopoulou, Thiago Gouvea, Daniel Sonntag", "id": "2408.04331v1", "paper_url": "http://arxiv.org/abs/2408.04331v1", "repo": "null"}}