{"2501.07071": {"publish_time": "2025-01-13", "title": "Value Compass Leaderboard: A Platform for Fundamental and Validated Evaluation of LLMs Values", "paper_summary": "As Large Language Models (LLMs) achieve remarkable breakthroughs, aligning\ntheir values with humans has become imperative for their responsible\ndevelopment and customized applications. However, there still lack evaluations\nof LLMs values that fulfill three desirable goals. (1) Value Clarification: We\nexpect to clarify the underlying values of LLMs precisely and comprehensively,\nwhile current evaluations focus narrowly on safety risks such as bias and\ntoxicity. (2) Evaluation Validity: Existing static, open-source benchmarks are\nprone to data contamination and quickly become obsolete as LLMs evolve.\nAdditionally, these discriminative evaluations uncover LLMs' knowledge about\nvalues, rather than valid assessments of LLMs' behavioral conformity to values.\n(3) Value Pluralism: The pluralistic nature of human values across individuals\nand cultures is largely ignored in measuring LLMs value alignment. To address\nthese challenges, we presents the Value Compass Leaderboard, with three\ncorrespondingly designed modules. It (i) grounds the evaluation on\nmotivationally distinct \\textit{basic values to clarify LLMs' underlying values\nfrom a holistic view; (ii) applies a \\textit{generative evolving evaluation\nframework with adaptive test items for evolving LLMs and direct value\nrecognition from behaviors in realistic scenarios; (iii) propose a metric that\nquantifies LLMs alignment with a specific value as a weighted sum over multiple\ndimensions, with weights determined by pluralistic values.", "paper_summary_zh": "隨著大型語言模型 (LLM) 取得顯著突破，讓它們的價值觀與人類價值觀一致，對於它們負責任的開發和客製化應用已變得勢在必行。然而，目前仍缺乏符合三個理想目標的 LLM 價值觀評估。(1) 價值觀澄清：我們期望精確且全面地釐清 LLM 的基本價值觀，而目前的評估則狹隘地關注於偏見和毒性等安全風險。(2) 評估效度：現有的靜態開源基準容易受到資料污染，而且隨著 LLM 的演進而迅速過時。此外，這些區辨性評估揭露的是 LLM 對於價值觀的知識，而非對 LLM 行為是否符合價值觀的有效評估。(3) 價值觀多元性：在衡量 LLM 價值觀一致性時，很大程度上忽略了人類價值觀在個人和文化之間的多元性。為了應對這些挑戰，我們提出了價值指南排行榜，其中包含三個相應設計的模組。它 (i) 將評估建立在動機上截然不同的「基本價值觀」上，以全面釐清 LLM 的基本價值觀；(ii) 應用「生成式演化評估架構」，其中包含適應性測驗項目，用於評估演化的 LLM，並從實際情境中的行為直接辨識價值觀；(iii) 提出一個量化指標，將 LLM 與特定價值觀的一致性量化為多個面向的加權總和，而權重則由多元價值觀決定。", "author": "Jing Yao et.al.", "authors": "Jing Yao, Xiaoyuan Yi, Shitong Duan, Jindong Wang, Yuzhuo Bai, Muhua Huang, Peng Zhang, Tun Lu, Zhicheng Dou, Maosong Sun, Xing Xie", "id": "2501.07071v1", "paper_url": "http://arxiv.org/abs/2501.07071v1", "repo": "null"}}