{"2410.01611": {"publish_time": "2024-10-02", "title": "DRUPI: Dataset Reduction Using Privileged Information", "paper_summary": "Dataset reduction (DR) seeks to select or distill samples from large datasets\ninto smaller subsets while preserving performance on target tasks. Existing\nmethods primarily focus on pruning or synthesizing data in the same format as\nthe original dataset, typically the input data and corresponding labels.\nHowever, in DR settings, we find it is possible to synthesize more information\nbeyond the data-label pair as an additional learning target to facilitate model\ntraining. In this paper, we introduce Dataset Reduction Using Privileged\nInformation (DRUPI), which enriches DR by synthesizing privileged information\nalongside the reduced dataset. This privileged information can take the form of\nfeature labels or attention labels, providing auxiliary supervision to improve\nmodel learning. Our findings reveal that effective feature labels must balance\nbetween being overly discriminative and excessively diverse, with a moderate\nlevel proving optimal for improving the reduced dataset's efficacy. Extensive\nexperiments on ImageNet, CIFAR-10/100, and Tiny ImageNet demonstrate that DRUPI\nintegrates seamlessly with existing dataset reduction methods, offering\nsignificant performance gains.", "paper_summary_zh": "資料集縮減 (DR) 旨在從大型資料集中選取或萃取樣本，並將其縮減為更小的子集，同時保留目標任務的效能。現有方法主要著重於以與原始資料集相同的格式修剪或合成資料，通常是輸入資料和對應標籤。然而，在 DR 設定中，我們發現可以合成超越資料標籤對的更多資訊，作為額外的學習目標，以利模型訓練。在本文中，我們介紹了使用特權資訊的資料集縮減 (DRUPI)，它透過在縮減資料集的同時合成特權資訊，來豐富 DR。此特權資訊可以是特徵標籤或注意力標籤的形式，提供輔助監督以改善模型學習。我們的研究結果顯示，有效的特徵標籤必須在過度區分和過度多樣化之間取得平衡，適度的層級對於改善縮減資料集的效能證明是最佳的。在 ImageNet、CIFAR-10/100 和 Tiny ImageNet 上進行的廣泛實驗證明，DRUPI 可以與現有的資料集縮減方法無縫整合，提供顯著的效能提升。", "author": "Shaobo Wang et.al.", "authors": "Shaobo Wang, Yantai Yang, Shuaiyu Zhang, Chenghao Sun, Weiya Li, Xuming Hu, Linfeng Zhang", "id": "2410.01611v1", "paper_url": "http://arxiv.org/abs/2410.01611v1", "repo": "null"}}