{"2409.05001": {"publish_time": "2024-09-08", "title": "A Pair Programming Framework for Code Generation via Multi-Plan Exploration and Feedback-Driven Refinement", "paper_summary": "Large language models (LLMs) have achieved impressive performance on code\ngeneration. Although prior studies enhanced LLMs with prompting techniques and\ncode refinement, they still struggle with complex programming problems due to\nrigid solution plans. In this paper, we draw on pair programming practices to\npropose PairCoder, a novel LLM-based framework for code generation. PairCoder\nincorporates two collaborative LLM agents, namely a Navigator agent for\nhigh-level planning and a Driver agent for specific implementation. The\nNavigator is responsible for proposing promising solution plans, selecting the\ncurrent optimal plan, and directing the next iteration round based on execution\nfeedback. The Driver follows the guidance of Navigator to undertake initial\ncode generation, code testing, and refinement. This interleaved and iterative\nworkflow involves multi-plan exploration and feedback-based refinement, which\nmimics the collaboration of pair programmers. We evaluate PairCoder with both\nopen-source and closed-source LLMs on various code generation benchmarks.\nExtensive experimental results demonstrate the superior accuracy of PairCoder,\nachieving relative pass@1 improvements of 12.00%-162.43% compared to prompting\nLLMs directly.", "paper_summary_zh": "大型語言模型 (LLM) 在程式碼生成方面取得了令人印象深刻的表現。儘管先前的研究透過提示技術和程式碼精煉來增強 LLM，但由於僵化的解決方案規劃，它們在處理複雜的程式設計問題時仍面臨困難。在本文中，我們借鑑結對程式設計實務，提出 PairCoder，這是一個基於 LLM 的程式碼生成新框架。PairCoder 結合了兩個協作 LLM 代理，分別是負責高層級規劃的 Navigator 代理和負責具體實作的 Driver 代理。Navigator 負責提出有前景的解決方案規劃、選擇當前最佳規劃，並根據執行回饋引導下一次反覆運算。Driver 遵循 Navigator 的指導進行初始程式碼生成、程式碼測試和精煉。這個交錯且反覆運算的工作流程涉及多重規劃探索和基於回饋的精煉，模擬了結對程式設計師的協作。我們在各種程式碼生成基準上使用開源和閉源 LLM 評估 PairCoder。大量的實驗結果證明了 PairCoder 的優異準確性，與直接提示 LLM 相比，相對 pass@1 提升了 12.00%-162.43%。", "author": "Huan Zhang et.al.", "authors": "Huan Zhang, Wei Cheng, Yuhan Wu, Wei Hu", "id": "2409.05001v1", "paper_url": "http://arxiv.org/abs/2409.05001v1", "repo": "null"}}