{"2410.18135": {"publish_time": "2024-10-21", "title": "R2Gen-Mamba: A Selective State Space Model for Radiology Report Generation", "paper_summary": "Radiology report generation is crucial in medical imaging,but the manual\nannotation process by physicians is time-consuming and labor-intensive,\nnecessitating the develop-ment of automatic report generation methods.\nExistingresearch predominantly utilizes Transformers to generateradiology\nreports, which can be computationally intensive,limiting their use in real\napplications. In this work, we presentR2Gen-Mamba, a novel automatic radiology\nreport genera-tion method that leverages the efficient sequence processingof\nthe Mamba with the contextual benefits of Transformerarchitectures. Due to\nlower computational complexity ofMamba, R2Gen-Mamba not only enhances training\nand in-ference efficiency but also produces high-quality reports.Experimental\nresults on two benchmark datasets with morethan 210,000 X-ray image-report\npairs demonstrate the ef-fectiveness of R2Gen-Mamba regarding report quality\nandcomputational efficiency compared with several state-of-the-art methods. The\nsource code can be accessed online.", "paper_summary_zh": "放射科報告生成在醫學影像中至關重要，但醫師手動標註的程序耗時且費力，因此有必要開發自動報告生成方法。現有研究主要利用 Transformer 來產生放射科報告，這在運算上可能很密集，限制了它們在實際應用中的使用。在這項工作中，我們提出 R2Gen-Mamba，這是一種新穎的自動放射科報告生成方法，它利用 Mamba 的高效序列處理和 Transformer 架構的上下文優勢。由於 Mamba 的運算複雜度較低，R2Gen-Mamba 不僅提高了訓練和推論效率，而且產生了高品質的報告。在兩個基準資料集上的實驗結果，包含超過 210,000 張 X 光影像報告對，證明了 R2Gen-Mamba 在報告品質和運算效率方面的有效性，優於多種最先進的方法。原始碼可以在線上取得。", "author": "Yongheng Sun et.al.", "authors": "Yongheng Sun, Yueh Z. Lee, Genevieve A. Woodard, Hongtu Zhu, Chunfeng Lian, Mingxia Liu", "id": "2410.18135v1", "paper_url": "http://arxiv.org/abs/2410.18135v1", "repo": "https://github.com/YonghengSun1997/R2Gen-Mamba"}}