{"2407.12309": {"publish_time": "2024-07-17", "title": "MEDFuse: Multimodal EHR Data Fusion with Masked Lab-Test Modeling and Large Language Models", "paper_summary": "Electronic health records (EHRs) are multimodal by nature, consisting of\nstructured tabular features like lab tests and unstructured clinical notes. In\nreal-life clinical practice, doctors use complementary multimodal EHR data\nsources to get a clearer picture of patients' health and support clinical\ndecision-making. However, most EHR predictive models do not reflect these\nprocedures, as they either focus on a single modality or overlook the\ninter-modality interactions/redundancy. In this work, we propose MEDFuse, a\nMultimodal EHR Data Fusion framework that incorporates masked lab-test modeling\nand large language models (LLMs) to effectively integrate structured and\nunstructured medical data. MEDFuse leverages multimodal embeddings extracted\nfrom two sources: LLMs fine-tuned on free clinical text and masked tabular\ntransformers trained on structured lab test results. We design a disentangled\ntransformer module, optimized by a mutual information loss to 1) decouple\nmodality-specific and modality-shared information and 2) extract useful joint\nrepresentation from the noise and redundancy present in clinical notes. Through\ncomprehensive validation on the public MIMIC-III dataset and the in-house FEMH\ndataset, MEDFuse demonstrates great potential in advancing clinical\npredictions, achieving over 90% F1 score in the 10-disease multi-label\nclassification task.", "paper_summary_zh": "電子健康紀錄（EHR）本質上是多模態的，包含了像實驗室檢查等結構化表格特徵和非結構化的臨床筆記。在真實的臨床實務中，醫生使用互補的多模態 EHR 數據來源，以更清楚地了解病患的健康狀況並支持臨床決策制定。然而，大多數的 EHR 預測模型並未反映這些程序，因為它們不是專注於單一模態，就是忽略了模態間的交互作用/冗餘。在這項工作中，我們提出 MEDFuse，一個多模態 EHR 數據融合架構，它結合了遮罩實驗室測試建模和大語言模型（LLM），以有效整合結構化和非結構化的醫療數據。MEDFuse 跨兩個來源提取多模態嵌入：針對免費臨床文本微調的 LLM，以及針對結構化實驗室檢驗結果訓練的遮罩表格轉換器。我們設計了一個解糾纏轉換器模組，由一個互信息損失進行最佳化，以 1) 分離特定於模態和模態共享的信息，以及 2) 從臨床筆記中存在的雜訊和冗餘中提取有用的聯合表徵。透過在公共 MIMIC-III 資料集和內部 FEMH 資料集上進行全面的驗證，MEDFuse 證明了在推進臨床預測方面的巨大潛力，在 10 種疾病的多標籤分類任務中達到了超過 90% 的 F1 分數。", "author": "Thao Minh Nguyen Phan et.al.", "authors": "Thao Minh Nguyen Phan, Cong-Tinh Dao, Chenwei Wu, Jian-Zhe Wang, Shun Liu, Jun-En Ding, David Restrepo, Feng Liu, Fang-Ming Hung, Wen-Chih Peng", "id": "2407.12309v1", "paper_url": "http://arxiv.org/abs/2407.12309v1", "repo": "null"}}