{"2501.11715": {"publish_time": "2025-01-20", "title": "GL-ICNN: An End-To-End Interpretable Convolutional Neural Network for the Diagnosis and Prediction of Alzheimer's Disease", "paper_summary": "Deep learning methods based on Convolutional Neural Networks (CNNs) have\nshown great potential to improve early and accurate diagnosis of Alzheimer's\ndisease (AD) dementia based on imaging data. However, these methods have yet to\nbe widely adopted in clinical practice, possibly due to the limited\ninterpretability of deep learning models. The Explainable Boosting Machine\n(EBM) is a glass-box model but cannot learn features directly from input\nimaging data. In this study, we propose a novel interpretable model that\ncombines CNNs and EBMs for the diagnosis and prediction of AD. We develop an\ninnovative training strategy that alternatingly trains the CNN component as a\nfeature extractor and the EBM component as the output block to form an\nend-to-end model. The model takes imaging data as input and provides both\npredictions and interpretable feature importance measures. We validated the\nproposed model on the Alzheimer's Disease Neuroimaging Initiative (ADNI)\ndataset and the Health-RI Parelsnoer Neurodegenerative Diseases Biobank (PND)\nas an external testing set. The proposed model achieved an area-under-the-curve\n(AUC) of 0.956 for AD and control classification, and 0.694 for the prediction\nof conversion of mild cognitive impairment (MCI) to AD on the ADNI cohort. The\nproposed model is a glass-box model that achieves a comparable performance with\nother state-of-the-art black-box models. Our code is publicly available at:\nhttps://anonymous.4open.science/r/GL-ICNN.", "paper_summary_zh": "<paragraph>基於卷積神經網路 (CNN) 的深度學習方法已顯示出極大的潛力，可根據影像資料改善阿茲海默症 (AD) 失智症的早期準確診斷。然而，這些方法尚未廣泛應用於臨床實務中，這可能是由於深度學習模型的可解釋性有限。可解釋提升機 (EBM) 是個玻璃盒模型，但無法直接從輸入影像資料中學習特徵。在這項研究中，我們提出一個結合 CNN 和 EBM 的新可解釋模型，用於診斷和預測 AD。我們開發了一種創新的訓練策略，交替訓練 CNN 組件作為特徵萃取器，並訓練 EBM 組件作為輸出區塊，以形成端對端模型。此模型將影像資料作為輸入，並提供預測和可解釋的特徵重要性測量。我們在阿茲海默症神經影像倡議 (ADNI) 資料集和 Health-RI Parelsnoer 神經退化疾病生物資料庫 (PND) 上驗證了所提出的模型，作為外部測試集。所提出的模型在 AD 和對照分類中達到了 0.956 的曲線下面積 (AUC)，並在 ADNI 隊列中預測輕度認知障礙 (MCI) 轉化為 AD 時達到了 0.694。所提出的模型是一個玻璃盒模型，其效能與其他最先進的黑盒模型相當。我們的程式碼可在以下網址公開取得：https://anonymous.4open.science/r/GL-ICNN。</paragraph>", "author": "Wenjie Kang et.al.", "authors": "Wenjie Kang, Lize Jiskoot, Peter De Deyn, Geert Biessels, Huiberdina Koek, Jurgen Claassen, Huub Middelkoop, Wiesje Flier, Willemijn J. Jansen, Stefan Klein, Esther Bron", "id": "2501.11715v1", "paper_url": "http://arxiv.org/abs/2501.11715v1", "repo": "null"}}