{"2504.15640": {"publish_time": "2025-04-22", "title": "Cost-Effective Text Clustering with Large Language Models", "paper_summary": "Text clustering aims to automatically partition a collection of text\ndocuments into distinct clusters based on linguistic features. In the\nliterature, this task is usually framed as metric clustering based on text\nembeddings from pre-trained encoders or a graph clustering problem upon\npairwise similarities from an oracle, e.g., a large ML model. Recently, large\nlanguage models (LLMs) bring significant advancement in this field by offering\ncontextualized text embeddings and highly accurate similarity scores, but\nmeanwhile, present grand challenges to cope with substantial computational\nand/or financial overhead caused by numerous API-based queries or inference\ncalls to the models.\n  In response, this paper proposes TECL, a cost-effective framework that taps\ninto the feedback from LLMs for accurate text clustering within a limited\nbudget of queries to LLMs. Under the hood, TECL adopts our EdgeLLM or\nTriangleLLM to construct must-link/cannot-link constraints for text pairs, and\nfurther leverages such constraints as supervision signals input to our weighted\nconstrained clustering approach to generate clusters. Particularly, EdgeLLM\n(resp. TriangleLLM) enables the identification of informative text pairs (resp.\ntriplets) for querying LLMs via well-thought-out greedy algorithms and accurate\nextraction of pairwise constraints through carefully-crafted prompting\ntechniques. Our experiments on multiple benchmark datasets exhibit that TECL\nconsistently and considerably outperforms existing solutions in unsupervised\ntext clustering under the same query cost for LLMs.", "paper_summary_zh": "<paragraph>文本分群旨在根據語言特徵，將文本文件集合自動劃分為不同的群組。在文獻中，這項任務通常被定義為基於預訓練編碼器的文本嵌入的度量分群，或基於來自預言機（例如大型機器學習模型）的成對相似性的圖分群問題。近年來，大型語言模型 (LLM) 通過提供上下文文本嵌入和高準確度的相似性分數，為該領域帶來了顯著進展，但同時也帶來了巨大的挑戰，需要應對由大量基於 API 的查詢或模型推理調用所導致的大量計算和/或財務開銷。為了解決這個問題，本文提出了 TECL，這是一個具有成本效益的框架，它利用來自 LLM 的反饋，在有限的 LLM 查詢預算內進行準確的文本分群。在底層，TECL 採用我們的 EdgeLLM 或 TriangleLLM 來構建文本對的 must-link/cannot-link 約束，並進一步利用這些約束作為監督信號輸入到我們的加權約束分群方法中以生成群組。特別是，EdgeLLM（或 TriangleLLM）能夠通過精心設計的貪婪算法識別信息豐富的文本對（或三元組）以查詢 LLM，並通過精心設計的提示技術準確提取成對約束。我們在多個基準數據集上的實驗表明，在相同的 LLM 查詢成本下，TECL 在無監督文本分群方面始終且顯著優於現有解決方案。</paragraph>\n", "author": "Hongtao Wang et.al.", "authors": "Hongtao Wang, Taiyan Zhang, Renchi Yang, Jianliang Xu", "id": "2504.15640v1", "paper_url": "http://arxiv.org/abs/2504.15640v1", "repo": "null"}}