{"2408.07982": {"publish_time": "2024-08-15", "title": "Toward a Dialogue System Using a Large Language Model to Recognize User Emotions with a Camera", "paper_summary": "The performance of ChatGPT\\copyright{} and other LLMs has improved\ntremendously, and in online environments, they are increasingly likely to be\nused in a wide variety of situations, such as ChatBot on web pages, call center\noperations using voice interaction, and dialogue functions using agents. In the\noffline environment, multimodal dialogue functions are also being realized,\nsuch as guidance by Artificial Intelligence agents (AI agents) using tablet\nterminals and dialogue systems in the form of LLMs mounted on robots. In this\nmultimodal dialogue, mutual emotion recognition between the AI and the user\nwill become important. So far, there have been methods for expressing emotions\non the part of the AI agent or for recognizing them using textual or voice\ninformation of the user's utterances, but methods for AI agents to recognize\nemotions from the user's facial expressions have not been studied. In this\nstudy, we examined whether or not LLM-based AI agents can interact with users\naccording to their emotional states by capturing the user in dialogue with a\ncamera, recognizing emotions from facial expressions, and adding such emotion\ninformation to prompts. The results confirmed that AI agents can have\nconversations according to the emotional state for emotional states with\nrelatively high scores, such as Happy and Angry.", "paper_summary_zh": "ChatGPT\\copyright{} 和其他 LLM 的效能已大幅提升，在線上環境中，它們愈來愈可能用於各種情況，例如網頁上的聊天機器人、使用語音互動的呼叫中心作業，以及使用代理人的對話功能。在離線環境中，多模態對話功能也正在實現，例如使用平板終端的人工智慧代理人 (AI 代理人) 的指導，以及安裝在機器人上的 LLM 形式的對話系統。在此多模態對話中，AI 與使用者之間的相互情緒辨識將變得重要。到目前為止，已有 AI 代理人表達情緒或使用使用者的話語文字或語音資訊辨識情緒的方法，但 AI 代理人從使用者的面部表情辨識情緒的方法尚未被研究。在本研究中，我們探討了基於 LLM 的 AI 代理人是否能透過相機捕捉與使用者對話、從面部表情辨識情緒，並將此類情緒資訊新增至提示，根據使用者的情緒狀態與使用者互動。結果證實，對於情緒分數相對較高的情緒狀態，例如快樂和生氣，AI 代理人可以根據情緒狀態進行對話。", "author": "Hiroki Tanioka et.al.", "authors": "Hiroki Tanioka, Tetsushi Ueta, Masahiko Sano", "id": "2408.07982v1", "paper_url": "http://arxiv.org/abs/2408.07982v1", "repo": "null"}}