{"2405.18724": {"publish_time": "2024-05-29", "title": "Adapting Differential Molecular Representation with Hierarchical Prompts for Multi-label Property Prediction", "paper_summary": "Accurate prediction of molecular properties is critical in the field of drug\ndiscovery. However, existing methods do not fully consider the fact that\nmolecules in the real world usually possess multiple property labels, and\ncomplex high-order relationships may exist among these labels. Therefore,\nmolecular representation learning models should generate differential molecular\nrepresentations that consider multi-granularity correlation information among\ntasks. To this end, our research introduces a Hierarchical Prompted Molecular\nRepresentation Learning Framework (HiPM), which enhances the differential\nexpression of tasks in molecular representations through task-aware prompts,\nand utilizes shared information among labels to mitigate negative transfer\nbetween different tasks. HiPM primarily consists of two core components: the\nMolecular Representation Encoder (MRE) and the Task-Aware Prompter (TAP). The\nMRE employs a hierarchical message-passing network architecture to capture\nmolecular features at both the atomic and motif levels, while the TAP uses\nagglomerative hierarchical clustering to build a prompt tree that reflects the\naffinity and distinctiveness of tasks, enabling the model to effectively handle\nthe complexity of multi-label property predictions. Extensive experiments\ndemonstrate that HiPM achieves state-of-the-art performance across various\nmulti-label datasets, offering a new perspective on multi-label molecular\nrepresentation learning.", "paper_summary_zh": "分子性質的準確預測在藥物發現領域至關重要。然而，現有方法並未充分考慮到現實世界中的分子通常具有多個屬性標籤，並且這些標籤之間可能存在複雜的高階關係。因此，分子表示學習模型應產生考慮任務之間多粒度關聯資訊的差異分子表示。為此，我們的研究引入了一個分層提示式分子表示學習架構 (HiPM)，它通過任務感知提示增強了分子表示中任務的差異表達，並利用標籤之間的共享資訊來減輕不同任務之間的負面轉移。HiPM 主要包含兩個核心組成部分：分子表示編碼器 (MRE) 和任務感知提示器 (TAP)。MRE 採用分層訊息傳遞網路架構來擷取原子和基序層級的分子特徵，而 TAP 使用凝聚式分層聚類來建立一個提示樹，反映任務的親和性和獨特性，使模型能夠有效地處理多標籤屬性預測的複雜性。廣泛的實驗表明，HiPM 在各種多標籤資料集上實現了最先進的效能，為多標籤分子表示學習提供了新的觀點。", "author": "Linjia Kang et.al.", "authors": "Linjia Kang, Songhua Zhou, Shuyan Fang, Shichao Liu, Wen Zhang", "id": "2405.18724v1", "paper_url": "http://arxiv.org/abs/2405.18724v1", "repo": "https://github.com/zhousongh/hipm"}}