{"2410.05056": {"publish_time": "2024-10-07", "title": "Transition of $α$-mixing in Random Iterations with Applications in Queuing Theory", "paper_summary": "Nonlinear time series models incorporating exogenous regressors provide the\nfoundation for numerous significant models across econometrics, queuing theory,\nmachine learning, and various other disciplines. Despite their importance, the\nframework for the statistical analysis of such models is still incomplete. In\ncontrast, multiple versions of the law of large numbers and the (functional)\ncentral limit theorem have been established for weakly dependent variables. We\nprove the transition of mixing properties of the exogenous regressor to the\nresponse through a coupling argument, leveraging these established results.\nFurthermore, we study Markov chains in random environments under a suitable\nform of drift and minorization condition when the environment process is\nnon-stationary, merely having favorable mixing properties. Following a novel\nstatistical estimation theory approach and using the Cram\\'er-Rao lower bound,\nwe also establish the functional central limit theorem. Additionally, we apply\nour framework to single-server queuing models. Overall, these results open the\ndoor to the statistical analysis of a large class of random iterative models.", "paper_summary_zh": "非線性時間序列模型結合外生迴歸量，為計量經濟學、排隊論、機器學習和許多其他領域中的許多重要模型提供了基礎。儘管它們很重要，但對此類模型進行統計分析的框架仍不完整。相比之下，對於弱依賴變數，已經建立了多個版本的大數法則和（函數）中心極限定理。我們通過一個耦合論證證明了外生迴歸量的混合屬性向響應的轉換，利用了這些已建立的結果。此外，當環境過程是非平穩的，僅具有良好的混合屬性時，我們在隨機環境中研究具有適當形式的漂移和最小化條件的馬可夫鏈。遵循一種新穎的統計估計理論方法並使用 Cram\\'er-Rao 下界，我們還建立了函數中心極限定理。此外，我們將我們的框架應用於單伺服器排隊模型。總的來說，這些結果為大量隨機反覆模型的統計分析打開了大門。", "author": "Attila Lovas et.al.", "authors": "Attila Lovas", "id": "2410.05056v1", "paper_url": "http://arxiv.org/abs/2410.05056v1", "repo": "null"}}