{"2409.20434": {"publish_time": "2024-09-30", "title": "QAEncoder: Towards Aligned Representation Learning in Question Answering System", "paper_summary": "Modern QA systems entail retrieval-augmented generation (RAG) for accurate\nand trustworthy responses. However, the inherent gap between user queries and\nrelevant documents hinders precise matching. Motivated by our conical\ndistribution hypothesis, which posits that potential queries and documents form\na cone-like structure in the embedding space, we introduce QAEncoder, a\ntraining-free approach to bridge this gap. Specifically, QAEncoder estimates\nthe expectation of potential queries in the embedding space as a robust\nsurrogate for the document embedding, and attaches document fingerprints to\neffectively distinguish these embeddings. Extensive experiments on fourteen\nembedding models across six languages and eight datasets validate QAEncoder's\nalignment capability, which offers a plug-and-play solution that seamlessly\nintegrates with existing RAG architectures and training-based methods.", "paper_summary_zh": "現代 QA 系統需要檢索增強生成 (RAG) 才能提供準確且值得信賴的回應。然而，使用者查詢與相關文件之間的固有差距阻礙了精確的配對。在我們的錐形分佈假設的激勵下，該假設認為潛在查詢和文件在嵌入空間中形成類錐形結構，我們引入了 QAEncoder，一種無需訓練的方法來彌合這一差距。具體來說，QAEncoder 將嵌入空間中潛在查詢的期望值估計為文件嵌入的強健替代，並附加文件指紋以有效區分這些嵌入。在六種語言和八個資料集上的十四個嵌入模型上的廣泛實驗驗證了 QAEncoder 的對齊能力，這提供了一個即插即用的解決方案，可以與現有的 RAG 架構和基於訓練的方法無縫整合。", "author": "Zhengren Wang et.al.", "authors": "Zhengren Wang, Qinhan Yu, Shida Wei, Zhiyu Li, Feiyu Xiong, Xiaoxing Wang, Simin Niu, Hao Liang, Wentao Zhang", "id": "2409.20434v1", "paper_url": "http://arxiv.org/abs/2409.20434v1", "repo": "null"}}