{"2412.18489": {"publish_time": "2024-12-24", "title": "An Overview and Discussion of the Suitability of Existing Speech Datasets to Train Machine Learning Models for Collective Problem Solving", "paper_summary": "This report characterized the suitability of existing datasets for devising\nnew Machine Learning models, decision making methods, and analysis algorithms\nto improve Collaborative Problem Solving and then enumerated requirements for\nfuture datasets to be devised. Problem solving was assumed to be performed in\nteams of about three, four members, which talked to each other. A dataset\nconsists of the speech recordings of such teams. The characterization\nmethodology was based on metrics that capture cognitive, social, and emotional\nactivities and situations. The report presented the analysis of a large group\nof datasets developed for Spoken Language Understanding, a research area with\nsome similarity to Collaborative Problem Solving.", "paper_summary_zh": "本報告描述了現有資料集的適用性，用於設計新的機器學習模型、決策方法和分析演算法，以改善協作問題解決，然後列舉了未來資料集設計的要求。問題解決被假設為由約三到四名成員組成的團隊執行，這些成員會彼此交談。資料集包含這些團隊的語音記錄。描述方法基於捕捉認知、社會和情緒活動和情境的指標。報告提出了對一組大型資料集的分析，這些資料集是為語音語言理解而開發的，這是一個與協作問題解決有些類似的研究領域。", "author": "Gnaneswar Villuri et.al.", "authors": "Gnaneswar Villuri, Alex Doboli", "id": "2412.18489v1", "paper_url": "http://arxiv.org/abs/2412.18489v1", "repo": "null"}}