{"2412.05149": {"publish_time": "2024-12-06", "title": "Findings of the Second BabyLM Challenge: Sample-Efficient Pretraining on Developmentally Plausible Corpora", "paper_summary": "The BabyLM Challenge is a community effort to close the data-efficiency gap\nbetween human and computational language learners. Participants compete to\noptimize language model training on a fixed language data budget of 100 million\nwords or less. This year, we released improved text corpora, as well as a\nvision-and-language corpus to facilitate research into cognitively plausible\nvision language models. Submissions were compared on evaluation tasks targeting\ngrammatical ability, (visual) question answering, pragmatic abilities, and\ngrounding, among other abilities. Participants could submit to a 10M-word\ntext-only track, a 100M-word text-only track, and/or a 100M-word and image\nmultimodal track. From 31 submissions employing diverse methods, a hybrid\ncausal-masked language model architecture outperformed other approaches. No\nsubmissions outperformed the baselines in the multimodal track. In follow-up\nanalyses, we found a strong relationship between training FLOPs and average\nperformance across tasks, and that the best-performing submissions proposed\nchanges to the training data, training objective, and model architecture. This\nyear's BabyLM Challenge shows that there is still significant room for\ninnovation in this setting, in particular for image-text modeling, but\ncommunity-driven research can yield actionable insights about effective\nstrategies for small-scale language modeling.", "paper_summary_zh": "BabyLM 挑戰賽是社群的共同努力，旨在縮小人類和計算語言學習者之間的資料效率差距。參與者競相在固定為 1 億個字或更少的語言資料預算中，最佳化語言模型訓練。今年，我們發布了改良的文字語料庫，以及一個視覺與語言語料庫，以促進對認知上合理的視覺語言模型的研究。提交的作品在評量任務中進行比較，這些任務針對語法能力、（視覺）問題解答、語用能力和基礎等各種能力。參與者可以提交到僅限文字的 10M 字組、僅限文字的 100M 字組，和/或 100M 字和圖像的多模組組。在採用各種方法的 31 項提交中，一個混合因果遮罩語言模型架構優於其他方法。在多模組組中，沒有提交的作品優於基準。在後續分析中，我們發現訓練 FLOP 和各項任務的平均表現之間有很強的關係，並且表現最佳的提交作品提出了訓練資料、訓練目標和模型架構的變更。今年的 BabyLM 挑戰賽顯示，在這個設定中仍然有很大的創新空間，特別是對於影像文字建模，但社群驅動的研究可以產生關於小規模語言建模的有效策略的可行見解。", "author": "Michael Y. Hu et.al.", "authors": "Michael Y. Hu, Aaron Mueller, Candace Ross, Adina Williams, Tal Linzen, Chengxu Zhuang, Ryan Cotterell, Leshem Choshen, Alex Warstadt, Ethan Gotlieb Wilcox", "id": "2412.05149v1", "paper_url": "http://arxiv.org/abs/2412.05149v1", "repo": "null"}}