{"2405.09454": {"publish_time": "2024-05-15", "title": "Tell Me Why: Explainable Public Health Fact-Checking with Large Language Models", "paper_summary": "This paper presents a comprehensive analysis of explainable fact-checking\nthrough a series of experiments, focusing on the ability of large language\nmodels to verify public health claims and provide explanations or\njustifications for their veracity assessments. We examine the effectiveness of\nzero/few-shot prompting and parameter-efficient fine-tuning across various open\nand closed-source models, examining their performance in both isolated and\njoint tasks of veracity prediction and explanation generation. Importantly, we\nemploy a dual evaluation approach comprising previously established automatic\nmetrics and a novel set of criteria through human evaluation. Our automatic\nevaluation indicates that, within the zero-shot scenario, GPT-4 emerges as the\nstandout performer, but in few-shot and parameter-efficient fine-tuning\ncontexts, open-source models demonstrate their capacity to not only bridge the\nperformance gap but, in some instances, surpass GPT-4. Human evaluation reveals\nyet more nuance as well as indicating potential problems with the gold\nexplanations.", "paper_summary_zh": "本論文透過一系列實驗，對可解釋事實查核進行全面分析，重點關注大型語言模型驗證公共健康聲明並提供其真實性評估的解釋或理由的能力。我們檢視了零次/少次提示和參數有效微調在各種開放和閉源模型中的有效性，檢視了它們在真實性預測和解釋生成的孤立和聯合任務中的表現。重要的是，我們採用了雙重評估方法，包括先前建立的自動化指標和通過人類評估的一組新標準。我們的自動評估表明，在零次場景中，GPT-4 成為傑出表現者，但在少次和參數有效微調的背景下，開放源碼模型證明了它們不僅能夠縮小性能差距，而且在某些情況下，還能超越 GPT-4。人類評估揭示了更多細微差別，並指出了黃金解釋中潛在的問題。", "author": "Majid Zarharan et.al.", "authors": "Majid Zarharan, Pascal Wullschleger, Babak Behkam Kia, Mohammad Taher Pilehvar, Jennifer Foster", "id": "2405.09454v1", "paper_url": "http://arxiv.org/abs/2405.09454v1", "repo": "https://github.com/Zarharan/NLE-for-fact-checking"}}