{"2501.19095": {"publish_time": "2025-01-31", "title": "PathE: Leveraging Entity-Agnostic Paths for Parameter-Efficient Knowledge Graph Embeddings", "paper_summary": "Knowledge Graphs (KGs) store human knowledge in the form of entities (nodes)\nand relations, and are used extensively in various applications. KG embeddings\nare an effective approach to addressing tasks like knowledge discovery, link\nprediction, and reasoning. This is often done by allocating and learning\nembedding tables for all or a subset of the entities. As this scales linearly\nwith the number of entities, learning embedding models in real-world KGs with\nmillions of nodes can be computationally intractable. To address this\nscalability problem, our model, PathE, only allocates embedding tables for\nrelations (which are typically orders of magnitude fewer than the entities) and\nrequires less than 25% of the parameters of previous parameter efficient\nmethods. Rather than storing entity embeddings, we learn to compute them by\nleveraging multiple entity-relation paths to contextualise individual entities\nwithin triples. Evaluated on four benchmarks, PathE achieves state-of-the-art\nperformance in relation prediction, and remains competitive in link prediction\non path-rich KGs while training on consumer-grade hardware. We perform ablation\nexperiments to test our design choices and analyse the sensitivity of the model\nto key hyper-parameters. PathE is efficient and cost-effective for relationally\ndiverse and well-connected KGs commonly found in real-world applications.", "paper_summary_zh": "知識圖譜 (KG) 以實體 (節點) 和關係的形式儲存人類知識，並廣泛用於各種應用程式中。KG 嵌入是一種有效的方法，可解決知識發現、連結預測和推理等任務。這通常透過配置和學習所有實體或實體子集的嵌入式表格來完成。由於這會隨著實體數量線性擴充，在擁有數百萬個節點的真實世界 KG 中學習嵌入式模型在計算上可能難以處理。為了解決這個可擴充性問題，我們的模型 PathE 只配置關係的嵌入式表格 (通常數量比實體少幾個數量級)，並且所需參數少於先前參數有效率方法的 25%。我們並非儲存實體嵌入，而是學習透過利用多個實體關係路徑來計算它們，以將個別實體在三元組中脈絡化。在四個基準上進行評估，PathE 在關係預測中達到最先進的效能，並在路徑豐富的 KG 上的連結預測中保持競爭力，同時在消費級硬體上進行訓練。我們執行消融實驗來測試我們的設計選擇，並分析模型對關鍵超參數的敏感性。PathE 對於在真實世界應用中常見的關係多樣且連線良好的 KG 而言，既有效率又具有成本效益。", "author": "Ioannis Reklos et.al.", "authors": "Ioannis Reklos, Jacopo de Berardinis, Elena Simperl, Albert Meroño-Peñuela", "id": "2501.19095v1", "paper_url": "http://arxiv.org/abs/2501.19095v1", "repo": "https://github.com/ireklos/pathe"}}