{"2407.12532": {"publish_time": "2024-07-17", "title": "Towards Collaborative Intelligence: Propagating Intentions and Reasoning for Multi-Agent Coordination with Large Language Models", "paper_summary": "Effective collaboration in multi-agent systems requires communicating goals\nand intentions between agents. Current agent frameworks often suffer from\ndependencies on single-agent execution and lack robust inter-module\ncommunication, frequently leading to suboptimal multi-agent reinforcement\nlearning (MARL) policies and inadequate task coordination. To address these\nchallenges, we present a framework for training large language models (LLMs) as\ncollaborative agents to enable coordinated behaviors in cooperative MARL. Each\nagent maintains a private intention consisting of its current goal and\nassociated sub-tasks. Agents broadcast their intentions periodically, allowing\nother agents to infer coordination tasks. A propagation network transforms\nbroadcast intentions into teammate-specific communication messages, sharing\nrelevant goals with designated teammates. The architecture of our framework is\nstructured into planning, grounding, and execution modules. During execution,\nmultiple agents interact in a downstream environment and communicate intentions\nto enable coordinated behaviors. The grounding module dynamically adapts\ncomprehension strategies based on emerging coordination patterns, while\nfeedback from execution agents influnces the planning module, enabling the\ndynamic re-planning of sub-tasks. Results in collaborative environment\nsimulation demonstrate intention propagation reduces miscoordination errors by\naligning sub-task dependencies between agents. Agents learn when to communicate\nintentions and which teammates require task details, resulting in emergent\ncoordinated behaviors. This demonstrates the efficacy of intention sharing for\ncooperative multi-agent RL based on LLMs.", "paper_summary_zh": "在多智能體系統中進行有效的協作，需要在智能體之間傳達目標和意圖。當前的智能體框架通常會受到單一智能體執行的依賴，並且缺乏穩健的模組間通訊，這常常會導致次佳的多智能體強化學習 (MARL) 政策和不充分的任務協調。為了應對這些挑戰，我們提出了將大型語言模型 (LLM) 訓練為協作智能體的框架，以在合作式 MARL 中實現協調行為。每個智能體都維護一個私人意圖，其中包含其當前目標和相關的子任務。智能體會定期廣播他們的意圖，讓其他智能體推論協調任務。傳播網路將廣播意圖轉換為特定於隊友的通訊訊息，與指定的隊友分享相關目標。我們框架的架構被結構化為規劃、接地和執行模組。在執行期間，多個智能體在下游環境中互動，並傳達意圖以實現協調行為。接地模組會根據新興的協調模式動態調整理解策略，而來自執行智能體的回饋會影響規劃模組，從而實現子任務的動態重新規劃。在協作環境模擬中的結果證明，意圖傳播透過調整智能體之間的子任務依賴性，減少了協調錯誤。智能體會學習何時傳達意圖以及哪些隊友需要任務詳細資訊，從而產生新興的協調行為。這證明了基於 LLM 的合作式多智能體 RL 意圖共享的效力。", "author": "Xihe Qiu et.al.", "authors": "Xihe Qiu, Haoyu Wang, Xiaoyu Tan, Chao Qu, Yujie Xiong, Yuan Cheng, Yinghui Xu, Wei Chu, Yuan Qi", "id": "2407.12532v1", "paper_url": "http://arxiv.org/abs/2407.12532v1", "repo": "null"}}