{"2405.09673": {"publish_time": "2024-05-15", "title": "LoRA Learns Less and Forgets Less", "paper_summary": "Low-Rank Adaptation (LoRA) is a widely-used parameter-efficient finetuning\nmethod for large language models. LoRA saves memory by training only low rank\nperturbations to selected weight matrices. In this work, we compare the\nperformance of LoRA and full finetuning on two target domains, programming and\nmathematics. We consider both the instruction finetuning ($\\approx$100K\nprompt-response pairs) and continued pretraining ($\\approx$10B unstructured\ntokens) data regimes. Our results show that, in most settings, LoRA\nsubstantially underperforms full finetuning. Nevertheless, LoRA exhibits a\ndesirable form of regularization: it better maintains the base model's\nperformance on tasks outside the target domain. We show that LoRA provides\nstronger regularization compared to common techniques such as weight decay and\ndropout; it also helps maintain more diverse generations. We show that full\nfinetuning learns perturbations with a rank that is 10-100X greater than\ntypical LoRA configurations, possibly explaining some of the reported gaps. We\nconclude by proposing best practices for finetuning with LoRA.", "paper_summary_zh": "低秩適應 (LoRA) 是一種廣泛使用的參數有效微調方法，適用於大型語言模型。LoRA 僅通過訓練選定權重矩陣的低秩擾動來節省記憶體。在這項工作中，我們比較了 LoRA 和完全微調在兩個目標領域（程式設計和數學）上的效能。我們同時考慮了指令微調（$\\approx$100K 提示回應對）和持續預訓練（$\\approx$10B 非結構化代幣）資料模式。我們的結果顯示，在大多數設定中，LoRA 的效能遠低於完全微調。儘管如此，LoRA 展現了一種理想的正則化形式：它能更好地維持基礎模型在目標領域以外任務上的效能。我們證明與權重衰減和中斷等常見技術相比，LoRA 提供了更強大的正則化；它也有助於維持更多樣化的生成。我們證明完全微調學習到的擾動秩比典型的 LoRA 組態大 10-100 倍，這可能解釋了一些報告的差距。最後，我們提出使用 LoRA 進行微調的最佳實務。", "author": "Dan Biderman et.al.", "authors": "Dan Biderman, Jose Gonzalez Ortiz, Jacob Portes, Mansheej Paul, Philip Greengard, Connor Jennings, Daniel King, Sam Havens, Vitaliy Chiley, Jonathan Frankle, Cody Blakeney, John P. Cunningham", "id": "2405.09673v1", "paper_url": "http://arxiv.org/abs/2405.09673v1", "repo": "null"}}