{"2412.09796": {"publish_time": "2024-12-13", "title": "AutoPatent: A Multi-Agent Framework for Automatic Patent Generation", "paper_summary": "As the capabilities of Large Language Models (LLMs) continue to advance, the\nfield of patent processing has garnered increased attention within the natural\nlanguage processing community. However, the majority of research has been\nconcentrated on classification tasks, such as patent categorization and\nexamination, or on short text generation tasks like patent summarization and\npatent quizzes. In this paper, we introduce a novel and practical task known as\nDraft2Patent, along with its corresponding D2P benchmark, which challenges LLMs\nto generate full-length patents averaging 17K tokens based on initial drafts.\nPatents present a significant challenge to LLMs due to their specialized\nnature, standardized terminology, and extensive length. We propose a\nmulti-agent framework called AutoPatent which leverages the LLM-based planner\nagent, writer agents, and examiner agent with PGTree and RRAG to generate\nlengthy, intricate, and high-quality complete patent documents. The\nexperimental results demonstrate that our AutoPatent framework significantly\nenhances the ability to generate comprehensive patents across various LLMs.\nFurthermore, we have discovered that patents generated solely with the\nAutoPatent framework based on the Qwen2.5-7B model outperform those produced by\nlarger and more powerful LLMs, such as GPT-4o, Qwen2.5-72B, and LLAMA3.1-70B,\nin both objective metrics and human evaluations. We will make the data and code\navailable upon acceptance at \\url{https://github.com/QiYao-Wang/AutoPatent}.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的能力不斷進步，專利處理領域在自然語言處理社群中備受關注。然而，大部分研究都集中在分類任務上，例如專利分類和審查，或簡短文字生成任務，例如專利摘要和專利測驗。在本文中，我們介紹了一項新穎且實用的任務，稱為 Draft2Patent，以及其對應的 D2P 基準，它挑戰 LLM 根據初始草稿生成平均 17K 個代碼的全文專利。專利由於其專業性質、標準化術語和篇幅冗長，對 LLM 構成重大挑戰。我們提出了一個名為 AutoPatent 的多代理架構，它利用基於 LLM 的規劃器代理、寫作者代理和審查員代理與 PGTree 和 RRAG 來生成冗長、複雜且高品質的完整專利文件。實驗結果表明，我們的 AutoPatent 架構顯著增強了跨各種 LLM 生成綜合專利的能力。此外，我們發現僅使用基於 Qwen2.5-7B 模型的 AutoPatent 架構生成的專利在客觀指標和人類評估中都優於由更大、更強大的 LLM（例如 GPT-4o、Qwen2.5-72B 和 LLAMA3.1-70B）產生的專利。我們將在 \\url{https://github.com/QiYao-Wang/AutoPatent} 上接受後提供數據和代碼。", "author": "Qiyao Wang et.al.", "authors": "Qiyao Wang, Shiwen Ni, Huaren Liu, Shule Lu, Guhong Chen, Xi Feng, Chi Wei, Qiang Qu, Hamid Alinejad-Rokny, Yuan Lin, Min Yang", "id": "2412.09796v1", "paper_url": "http://arxiv.org/abs/2412.09796v1", "repo": "https://github.com/qiyao-wang/autopatent"}}