{"2410.24080": {"publish_time": "2024-10-31", "title": "Graph Learning for Numeric Planning", "paper_summary": "Graph learning is naturally well suited for use in symbolic, object-centric\nplanning due to its ability to exploit relational structures exhibited in\nplanning domains and to take as input planning instances with arbitrary numbers\nof objects. Numeric planning is an extension of symbolic planning in which\nstates may now also exhibit numeric variables. In this work, we propose\ndata-efficient and interpretable machine learning models for learning to solve\nnumeric planning tasks. This involves constructing a new graph kernel for\ngraphs with both continuous and categorical attributes, as well as new\noptimisation methods for learning heuristic functions for numeric planning.\nExperiments show that our graph kernels are vastly more efficient and\ngeneralise better than graph neural networks for numeric planning, and also\nyield competitive coverage performance compared to domain-independent numeric\nplanners. Code is available at https://github.com/DillonZChen/goose", "paper_summary_zh": "圖形學習由於能夠利用規劃領域中展示的關係結構，並將具有任意數量的物件的規劃實例作為輸入，因此自然非常適合用於符號、以物件為中心規劃。數值規劃是符號規劃的延伸，其中狀態現在也可能顯示數值變數。在這項工作中，我們提出了資料有效且可解釋的機器學習模型，用於學習解決數值規劃任務。這涉及為具有連續和類別屬性的圖形構建一個新的圖形核，以及用於學習數值規劃啟發式函數的新優化方法。實驗表明，我們的圖形核比數值規劃的圖神經網路更有效率，且泛化性更好，並且與與領域無關的數值規劃器相比，也產生了具有競爭力的覆蓋效能。程式碼可在 https://github.com/DillonZChen/goose 取得", "author": "Dillon Z. Chen et.al.", "authors": "Dillon Z. Chen, Sylvie Thiébaux", "id": "2410.24080v1", "paper_url": "http://arxiv.org/abs/2410.24080v1", "repo": "https://github.com/DillonZChen/goose"}}