{"2408.10119": {"publish_time": "2024-08-19", "title": "Factorized-Dreamer: Training A High-Quality Video Generator with Limited and Low-Quality Data", "paper_summary": "Text-to-video (T2V) generation has gained significant attention due to its\nwide applications to video generation, editing, enhancement and translation,\n\\etc. However, high-quality (HQ) video synthesis is extremely challenging\nbecause of the diverse and complex motions existed in real world. Most existing\nworks struggle to address this problem by collecting large-scale HQ videos,\nwhich are inaccessible to the community. In this work, we show that publicly\navailable limited and low-quality (LQ) data are sufficient to train a HQ video\ngenerator without recaptioning or finetuning. We factorize the whole T2V\ngeneration process into two steps: generating an image conditioned on a highly\ndescriptive caption, and synthesizing the video conditioned on the generated\nimage and a concise caption of motion details. Specifically, we present\n\\emph{Factorized-Dreamer}, a factorized spatiotemporal framework with several\ncritical designs for T2V generation, including an adapter to combine text and\nimage embeddings, a pixel-aware cross attention module to capture pixel-level\nimage information, a T5 text encoder to better understand motion description,\nand a PredictNet to supervise optical flows. We further present a noise\nschedule, which plays a key role in ensuring the quality and stability of video\ngeneration. Our model lowers the requirements in detailed captions and HQ\nvideos, and can be directly trained on limited LQ datasets with noisy and brief\ncaptions such as WebVid-10M, largely alleviating the cost to collect\nlarge-scale HQ video-text pairs. Extensive experiments in a variety of T2V and\nimage-to-video generation tasks demonstrate the effectiveness of our proposed\nFactorized-Dreamer. Our source codes are available at\n\\url{https://github.com/yangxy/Factorized-Dreamer/}.", "paper_summary_zh": "<paragraph>文本转视频 (T2V) 生成因其在视频生成、编辑、增强和翻译等方面的广泛应用而备受关注，\\等。然而，高质量 (HQ) 视频合成极具挑战性，因为现实世界中存在多样且复杂的运动。大多数现有作品通过收集社区无法获取的大规模 HQ 视频来解决此问题，但这很困难。在这项工作中，我们表明公开可用的有限且低质量 (LQ) 数据足以训练 HQ 视频生成器，而无需重新加标题或微调。我们将整个 T2V 生成过程分解为两个步骤：生成基于高度描述性标题的图像，并基于生成的图像和简洁的运动细节标题合成视频。具体来说，我们提出了\\emph{Factorized-Dreamer}，这是一个分解的时空框架，具有几个关键设计用于 T2V 生成，包括一个将文本和图像嵌入相结合的适配器、一个像素感知交叉注意模块来捕获像素级图像信息、一个 T5 文本编码器以更好地理解运动描述，以及一个 PredictNet 来监督光流。我们进一步提出了一个噪声时间表，它在确保视频生成质量和稳定性方面发挥着关键作用。我们的模型降低了对详细标题和 HQ 视频的要求，并且可以直接在具有噪声和简短标题的有限 LQ 数据集（例如 WebVid-10M）上进行训练，从而大大降低了收集大规模 HQ 视频-文本对的成本。在各种 T2V 和图像到视频生成任务中的大量实验表明了我们提出的 Factorized-Dreamer 的有效性。我们的源代码可在\\url{https://github.com/yangxy/Factorized-Dreamer/}获得。</paragraph>", "author": "Tao Yang et.al.", "authors": "Tao Yang, Yangming Shi, Yunwen Huang, Feng Chen, Yin Zheng, Lei Zhang", "id": "2408.10119v1", "paper_url": "http://arxiv.org/abs/2408.10119v1", "repo": "null"}}