{"2412.06394": {"publish_time": "2024-12-09", "title": "GameArena: Evaluating LLM Reasoning through Live Computer Games", "paper_summary": "Evaluating the reasoning abilities of large language models (LLMs) is\nchallenging. Existing benchmarks often depend on static datasets, which are\nvulnerable to data contamination and may get saturated over time, or on binary\nlive human feedback that conflates reasoning with other abilities. As the most\nprominent dynamic benchmark, Chatbot Arena evaluates open-ended questions in\nreal-world settings, but lacks the granularity in assessing specific reasoning\ncapabilities. We introduce GameArena, a dynamic benchmark designed to evaluate\nLLM reasoning capabilities through interactive gameplay with humans. GameArena\nconsists of three games designed to test specific reasoning capabilities (e.g.,\ndeductive and inductive reasoning), while keeping participants entertained and\nengaged. We analyze the gaming data retrospectively to uncover the underlying\nreasoning processes of LLMs and measure their fine-grained reasoning\ncapabilities. We collect over 2000 game sessions and provide detailed\nassessments of various reasoning capabilities for five state-of-the-art LLMs.\nOur user study with 100 participants suggests that GameArena improves user\nengagement compared to Chatbot Arena. For the first time, GameArena enables the\ncollection of step-by-step LLM reasoning data in the wild.", "paper_summary_zh": "評估大型語言模型 (LLM) 的推理能力具有挑戰性。現有的基準通常依賴於靜態數據集，而這些數據集容易受到數據污染，並且可能會隨著時間而飽和，或者依賴於將推理與其他能力混為一談的二進制人類實時回饋。作為最知名的動態基準，Chatbot Arena 評估現實世界中的開放式問題，但缺乏評估特定推理能力的詳細程度。我們引入了 GameArena，這是一個動態基準，旨在通過與人類的互動遊戲來評估 LLM 推理能力。GameArena 包含三個遊戲，旨在測試具體的推理能力（例如，演繹推理和歸納推理），同時讓參與者保持娛樂和參與。我們回顧性地分析遊戲數據，以揭示 LLM 的底層推理過程，並衡量其細緻的推理能力。我們收集了 2000 多場遊戲，並對五種最先進的 LLM 的各種推理能力進行了詳細評估。我們與 100 名參與者進行的用戶研究表明，與 Chatbot Arena 相比，GameArena 提高了用戶參與度。GameArena 首次實現了收集野外 LLM 的逐步推理數據。", "author": "Lanxiang Hu et.al.", "authors": "Lanxiang Hu, Qiyu Li, Anze Xie, Nan Jiang, Ion Stoica, Haojian Jin, Hao Zhang", "id": "2412.06394v1", "paper_url": "http://arxiv.org/abs/2412.06394v1", "repo": "null"}}