{"2405.15756": {"publish_time": "2024-05-24", "title": "Sparse Expansion and Neuronal Disentanglement", "paper_summary": "We show how to improve the inference efficiency of an LLM by expanding it\ninto a mixture of sparse experts, where each expert is a copy of the original\nweights, one-shot pruned for a specific cluster of input values. We call this\napproach $\\textit{Sparse Expansion}$. We show that, for models such as Llama 2\n70B, as we increase the number of sparse experts, Sparse Expansion outperforms\nall other one-shot sparsification approaches for the same inference FLOP budget\nper token, and that this gap grows as sparsity increases, leading to inference\nspeedups.\n  But why? To answer this, we provide strong evidence that the mixture of\nsparse experts is effectively $\\textit{disentangling}$ the input-output\nrelationship of every individual neuron across clusters of inputs.\nSpecifically, sparse experts approximate the dense neuron output distribution\nwith fewer weights by decomposing the distribution into a collection of simpler\nones, each with a separate sparse dot product covering it. Interestingly, we\nshow that the Wasserstein distance between a neuron's output distribution and a\nGaussian distribution is an indicator of its entanglement level and\ncontribution to the accuracy of the model. Every layer of an LLM has a fraction\nof highly entangled Wasserstein neurons, and model performance suffers more\nwhen these are sparsified as opposed to others.", "paper_summary_zh": "我們展示如何透過將 LLM 擴充為稀疏專家組合來提升推論效率，其中每個專家都是原始權重的副本，針對特定輸入值群集進行一次性剪枝。我們稱這種方法為「稀疏擴充」。我們展示，對於 Llama 2 70B 等模型，隨著我們增加稀疏專家的數量，稀疏擴充在相同的每令牌推論 FLOP 預算上優於所有其他一次性稀疏化方法，並且隨著稀疏性的增加，此差距會擴大，導致推論加速。\n但為什麼？為了回答這個問題，我們提供了強有力的證據，證明稀疏專家組合有效地「解開」了每個個別神經元在輸入群集中的輸入輸出關係。具體來說，稀疏專家透過將分佈分解為一系列較簡單的分佈（每個分佈都有單獨的稀疏點積覆蓋它）來近似密集神經元輸出分佈，並使用較少的權重。有趣的是，我們展示了一個神經元輸出分佈與高斯分佈之間的 Wasserstein 距離是其糾纏程度和對模型準確性貢獻的指標。LLM 的每一層都有一部分高度糾纏的 Wasserstein 神經元，並且當這些神經元被稀疏化（相對於其他神經元）時，模型效能會受到更大的影響。", "author": "Shashata Sawmya et.al.", "authors": "Shashata Sawmya, Linghao Kong, Ilia Markov, Dan Alistarh, Nir Shavit", "id": "2405.15756v1", "paper_url": "http://arxiv.org/abs/2405.15756v1", "repo": "null"}}