{"2501.04931": {"publish_time": "2025-01-09", "title": "Jailbreaking Multimodal Large Language Models via Shuffle Inconsistency", "paper_summary": "Multimodal Large Language Models (MLLMs) have achieved impressive performance\nand have been put into practical use in commercial applications, but they still\nhave potential safety mechanism vulnerabilities. Jailbreak attacks are red\nteaming methods that aim to bypass safety mechanisms and discover MLLMs'\npotential risks. Existing MLLMs' jailbreak methods often bypass the model's\nsafety mechanism through complex optimization methods or carefully designed\nimage and text prompts. Despite achieving some progress, they have a low attack\nsuccess rate on commercial closed-source MLLMs. Unlike previous research, we\nempirically find that there exists a Shuffle Inconsistency between MLLMs'\ncomprehension ability and safety ability for the shuffled harmful instruction.\nThat is, from the perspective of comprehension ability, MLLMs can understand\nthe shuffled harmful text-image instructions well. However, they can be easily\nbypassed by the shuffled harmful instructions from the perspective of safety\nability, leading to harmful responses. Then we innovatively propose a\ntext-image jailbreak attack named SI-Attack. Specifically, to fully utilize the\nShuffle Inconsistency and overcome the shuffle randomness, we apply a\nquery-based black-box optimization method to select the most harmful shuffled\ninputs based on the feedback of the toxic judge model. A series of experiments\nshow that SI-Attack can improve the attack's performance on three benchmarks.\nIn particular, SI-Attack can obviously improve the attack success rate for\ncommercial MLLMs such as GPT-4o or Claude-3.5-Sonnet.", "paper_summary_zh": "多模態大型語言模型 (MLLM) 已取得令人印象深刻的表現，並已實際應用於商業應用中，但它們仍具有潛在的安全機制漏洞。越獄攻擊是旨在繞過安全機制並發現 MLLM 潛在風險的紅隊方法。現有的 MLLM 越獄方法通常透過複雜的最佳化方法或精心設計的影像和文字提示，來繞過模型的安全機制。儘管取得了一些進展，但它們對商業閉源 MLLM 的攻擊成功率很低。與先前的研究不同，我們憑經驗發現，對於混洗的惡意指令，MLLM 的理解能力和安全性之間存在混洗不一致性。也就是說，從理解能力的角度來看，MLLM 能夠很好地理解混洗的惡意文字影像指令。然而，從安全性的角度來看，它們很容易被混洗的惡意指令繞過，導致產生惡意的回應。然後，我們創新地提出了一種名為 SI-Attack 的文字影像越獄攻擊。具體來說，為了充分利用混洗不一致性並克服混洗的隨機性，我們應用基於查詢的黑盒最佳化方法，根據有毒判斷模型的回饋來選擇最有害的混洗輸入。一系列的實驗表明，SI-Attack 可以提高三個基準測試的攻擊效能。特別是，SI-Attack 可以顯著提高對商業 MLLM（例如 GPT-4o 或 Claude-3.5-Sonnet）的攻擊成功率。", "author": "Shiji Zhao et.al.", "authors": "Shiji Zhao, Ranjie Duan, Fengxiang Wang, Chi Chen, Caixin Kang, Jialing Tao, YueFeng Chen, Hui Xue, Xingxing Wei", "id": "2501.04931v1", "paper_url": "http://arxiv.org/abs/2501.04931v1", "repo": "null"}}