{"2410.16266": {"publish_time": "2024-10-21", "title": "3DGS-Enhancer: Enhancing Unbounded 3D Gaussian Splatting with View-consistent 2D Diffusion Priors", "paper_summary": "Novel-view synthesis aims to generate novel views of a scene from multiple\ninput images or videos, and recent advancements like 3D Gaussian splatting\n(3DGS) have achieved notable success in producing photorealistic renderings\nwith efficient pipelines. However, generating high-quality novel views under\nchallenging settings, such as sparse input views, remains difficult due to\ninsufficient information in under-sampled areas, often resulting in noticeable\nartifacts. This paper presents 3DGS-Enhancer, a novel pipeline for enhancing\nthe representation quality of 3DGS representations. We leverage 2D video\ndiffusion priors to address the challenging 3D view consistency problem,\nreformulating it as achieving temporal consistency within a video generation\nprocess. 3DGS-Enhancer restores view-consistent latent features of rendered\nnovel views and integrates them with the input views through a spatial-temporal\ndecoder. The enhanced views are then used to fine-tune the initial 3DGS model,\nsignificantly improving its rendering performance. Extensive experiments on\nlarge-scale datasets of unbounded scenes demonstrate that 3DGS-Enhancer yields\nsuperior reconstruction performance and high-fidelity rendering results\ncompared to state-of-the-art methods. The project webpage is\nhttps://xiliu8006.github.io/3DGS-Enhancer-project .", "paper_summary_zh": "新視圖合成旨在從多個輸入影像或影片產生場景的新視圖，而 3D 高斯散射 (3DGS) 等近期進展已在產生具有高效管線的光寫實渲染方面取得顯著成功。然而，在具有挑戰性的設定下產生高品質的新視圖（例如輸入視圖稀疏）仍然很困難，因為在採樣不足區域中資訊不足，通常會導致明顯的人工製品。本文提出 3DGS-Enhancer，這是一個用於增強 3DGS 表徵品質的新管線。我們利用 2D 影片擴散先驗來解決具有挑戰性的 3D 視圖一致性問題，並將其重新表述為在影片產生過程中實現時間一致性。3DGS-Enhancer 還原渲染新視圖的視圖一致潛在特徵，並透過時空解碼器將它們與輸入視圖整合。然後使用增強的視圖微調初始 3DGS 模型，顯著改善其渲染效能。在無界場景的大規模資料集上進行的廣泛實驗證明，與最先進的方法相比，3DGS-Enhancer 產生了優異的重建效能和高保真渲染結果。專案網頁為 https://xiliu8006.github.io/3DGS-Enhancer-project 。", "author": "Xi Liu et.al.", "authors": "Xi Liu, Chaoyi Zhou, Siyu Huang", "id": "2410.16266v1", "paper_url": "http://arxiv.org/abs/2410.16266v1", "repo": "null"}}