{"2502.13769": {"publish_time": "2025-02-19", "title": "A consensus set for the aggregation of partial rankings: the case of the Optimal Set of Bucket Orders Problem", "paper_summary": "In rank aggregation problems (RAP), the solution is usually a consensus\nranking that generalizes a set of input orderings. There are different variants\nthat differ not only in terms of the type of rankings that are used as input\nand output, but also in terms of the objective function employed to evaluate\nthe quality of the desired output ranking. In contrast, in some machine\nlearning tasks (e.g. subgroup discovery) or multimodal optimization tasks,\nattention is devoted to obtaining several models/results to account for the\ndiversity in the input data or across the search landscape. Thus, in this paper\nwe propose to provide, as the solution to an RAP, a set of rankings to better\nexplain the preferences expressed in the input orderings. We exemplify our\nproposal through the Optimal Bucket Order Problem (OBOP), an RAP which consists\nin finding a single consensus ranking (with ties) that generalizes a set of\ninput rankings codified as a precedence matrix. To address this, we introduce\nthe Optimal Set of Bucket Orders Problem (OSBOP), a generalization of the OBOP\nthat aims to produce not a single ranking as output but a set of consensus\nrankings. Experimental results are presented to illustrate this proposal,\nshowing how, by providing a set of consensus rankings, the fitness of the\nsolution significantly improves with respect to the one of the original OBOP,\nwithout losing comprehensibility.", "paper_summary_zh": "在等級彙總問題 (RAP) 中，解決方案通常是共識排名，概括了一組輸入排序。有不同的變體，它們之間的差異不僅在於用作輸入和輸出的排名類型，還在於用於評估所需輸出排名的品質的目標函數。相比之下，在某些機器學習任務（例如子群發現）或多模態優化任務中，注意力集中於獲得多個模型/結果，以說明輸入數據或搜索範圍中的多樣性。因此，在本文中，我們建議提供一組排名作為 RAP 的解決方案，以更好地解釋輸入排序中表達的偏好。我們通過最佳桶序問題 (OBOP) 來例證我們的提案，OBOP 是一個 RAP，它包括找到一個單一的共識排名（帶有聯繫），概括了一組編碼為優先矩陣的輸入排名。為了解決這個問題，我們引入了最佳桶序問題集 (OSBOP)，這是 OBOP 的一個概括，其目的是不產生單一的排名作為輸出，而是產生一組共識排名。提供了實驗結果來說明這個提案，展示了通過提供一組共識排名，解決方案的適應度如何相對於原始 OBOP 的適應度顯著提高，而不會失去可理解性。", "author": "Juan A. Aledo et.al.", "authors": "Juan A. Aledo, José A. Gámez, Alejandro Rosete", "id": "2502.13769v1", "paper_url": "http://arxiv.org/abs/2502.13769v1", "repo": "null"}}