{"2411.18382": {"publish_time": "2024-11-27", "title": "ChatGPT as speechwriter for the French presidents", "paper_summary": "Generative AI proposes several large language models (LLMs) to automatically\ngenerate a message in response to users' requests. Such scientific\nbreakthroughs promote new writing assistants but with some fears. The main\nfocus of this study is to analyze the written style of one LLM called ChatGPT\nby comparing its generated messages with those of the recent French presidents.\nTo achieve this, we compare end-of-the-year addresses written by Chirac,\nSarkozy, Hollande, and Macron with those automatically produced by ChatGPT. We\nfound that ChatGPT tends to overuse nouns, possessive determiners, and numbers.\nOn the other hand, the generated speeches employ less verbs, pronouns, and\nadverbs and include, in mean, too standardized sentences. Considering some\nwords, one can observe that ChatGPT tends to overuse \"to must\" (devoir), \"to\ncontinue\" or the lemma \"we\" (nous). Moreover, GPT underuses the auxiliary verb\n\"to be\" (^etre), or the modal verbs \"to will\" (vouloir) or \"to have to\"\n(falloir). In addition, when a short text is provided as example to ChatGPT,\nthe machine can generate a short message with a style closed to the original\nwording. Finally, we reveal that ChatGPT style exposes distinct features\ncompared to real presidential speeches.", "paper_summary_zh": "生成式人工智慧提出數種大型語言模型 (LLM)，以自動產生訊息來回應使用者的要求。這種科學突破促進了新的寫作助理，但也帶來了一些擔憂。本研究的主要重點是分析一個名為 ChatGPT 的 LLM 的書寫風格，方法是將其產生的訊息與最近的法國總統進行比較。為達成此目的，我們比較了希拉克、薩科齊、歐蘭德和馬克宏所寫的年終演說，以及 ChatGPT 自動產生的演說。我們發現 ChatGPT 傾向過度使用名詞、所有格限定詞和數字。另一方面，產生的演說較少使用動詞、代名詞和副詞，而且平均而言包含過於標準化的句子。考慮到某些詞彙，可以觀察到 ChatGPT 傾向過度使用「必須」（devoir）、「繼續」（continuer）或詞根「我們」（nous）。此外，GPT 使用助動詞「是」（^etre）或情態動詞「將」（vouloir）或「必須」（falloir）的頻率較低。此外，當提供一段簡短文字作為 ChatGPT 的範例時，機器可以產生一段訊息，其風格接近原始文字。最後，我們揭示 ChatGPT 的風格與真正的總統演說相比，呈現出不同的特徵。", "author": "Dominique Labbé et.al.", "authors": "Dominique Labbé, Cyril Labbé, Jacques Savoy", "id": "2411.18382v1", "paper_url": "http://arxiv.org/abs/2411.18382v1", "repo": "null"}}