{"2406.03452": {"publish_time": "2024-06-05", "title": "Using Synchronic Definitions and Semantic Relations to Classify Semantic Change Types", "paper_summary": "There is abundant evidence of the fact that the way words change their\nmeaning can be classified in different types of change, highlighting the\nrelationship between the old and new meanings (among which generalization,\nspecialization and co-hyponymy transfer). In this paper, we present a way of\ndetecting these types of change by constructing a model that leverages\ninformation both from synchronic lexical relations and definitions of word\nmeanings. Specifically, we use synset definitions and hierarchy information\nfrom WordNet and test it on a digitized version of Blank's (1997) dataset of\nsemantic change types. Finally, we show how the sense relationships can improve\nmodels for both approximation of human judgments of semantic relatedness as\nwell as binary Lexical Semantic Change Detection.", "paper_summary_zh": "有大量的证据表明，词语改变其含义的方式可以归类为不同类型的改变，突出了旧含义和新含义之间的关系（其中包括泛化、特化和共下位词转移）。在本文中，我们提出了一种通过构建一个模型来检测这些类型改变的方法，该模型利用来自共时词汇关系和词义定义的信息。具体来说，我们使用来自 WordNet 的同义词集定义和层次信息，并在 Blank（1997）语义变化类型数据集的数字化版本上对其进行测试。最后，我们展示了意义关系如何改进模型，以近似人类对语义相关性的判断以及二进制词汇语义变化检测。", "author": "Pierluigi Cassotti et.al.", "authors": "Pierluigi Cassotti, Stefano De Pascale, Nina Tahmasebi", "id": "2406.03452v2", "paper_url": "http://arxiv.org/abs/2406.03452v2", "repo": "https://github.com/ChangeIsKey/change-type-classification"}}