{"2410.19353": {"publish_time": "2024-10-25", "title": "Interleaving Text and Number Embeddings to Solve Mathemathics Problems", "paper_summary": "Integrating text and numbers effectively is a crucial step towards enhancing\nLarge Language Models (LLMs) capabilities in assisting in scientific tasks.\nWhile most current approaches rely on discrete tokenization of numbers, for\ninstance, conversion to scientific notation or base 10-decomposition, a recent\napproach proposed a continuous numerical encoding as an inductive bias. In this\npaper, we build upon this approach by introducing more expressive numerical\nembeddings. Our method addresses key shortcomings, including the elimination of\nnumerical artefacts and the ability to handle a wide range of magnitudes\nwithout clipping.\n  Our work presents two key contributions. First, we employ an MLP to assign\ndistinct directions in the embedding space to different numbers. Our second\ncontribution is the introduction of a routing layer that differentiates between\nnumerical and text embeddings. We hypothesise that this combined approach\nenables the model to distinguish between text and number distributions while\nmaintaining its capacity for arithmetic operations.\n  Using only a 45 M parameter encoder-decoder architecture our method achieves\na $R^2$=0.9988 over a wide range of magnitude ($10^{-3},10^{8}$). In addition,\nwe empirically observe a reduction of the numerical artefacts and biases\nobserved compared to the baselines.", "paper_summary_zh": "有效整合文字和數字是提升大型語言模型 (LLM) 在科學任務中提供協助的能力的關鍵步驟。雖然目前大多數方法依賴數字的離散化標記，例如轉換為科學記號或 10 進位分解，但最近的方法提出連續數值編碼作為歸納偏差。在本文中，我們透過引入更具表達力的數值嵌入，建立在這個方法之上。我們的做法解決了關鍵缺點，包括消除數值人工製品，以及在不剪裁的情況下處理廣泛的數量級的能力。\n我們的研究提出了兩個關鍵貢獻。首先，我們採用 MLP，在嵌入空間中為不同的數字指定不同的方向。我們的第二個貢獻是引入一個路由層，區分數值和文字嵌入。我們假設這種組合方法使模型能夠區分文字和數字分佈，同時保持其執行算術運算的能力。\n僅使用 45M 參數編碼器-解碼器架構，我們的做法在廣泛的數量級 ($10^{-3},10^{8}$) 上達到了 $R^2$=0.9988。此外，我們根據經驗觀察到與基準相比，數值人工製品和偏差有所減少。", "author": "Marvin Alberts et.al.", "authors": "Marvin Alberts, Gianmarco Gabrieli, Irina Espejo Morales", "id": "2410.19353v1", "paper_url": "http://arxiv.org/abs/2410.19353v1", "repo": "null"}}