{"2501.07755": {"publish_time": "2025-01-13", "title": "Performance Optimization of Ratings-Based Reinforcement Learning", "paper_summary": "This paper explores multiple optimization methods to improve the performance\nof rating-based reinforcement learning (RbRL). RbRL, a method based on the idea\nof human ratings, has been developed to infer reward functions in reward-free\nenvironments for the subsequent policy learning via standard reinforcement\nlearning, which requires the availability of reward functions. Specifically,\nRbRL minimizes the cross entropy loss that quantifies the differences between\nhuman ratings and estimated ratings derived from the inferred reward. Hence, a\nlow loss means a high degree of consistency between human ratings and estimated\nratings. Despite its simple form, RbRL has various hyperparameters and can be\nsensitive to various factors. Therefore, it is critical to provide\ncomprehensive experiments to understand the impact of various hyperparameters\non the performance of RbRL. This paper is a work in progress, providing users\nsome general guidelines on how to select hyperparameters in RbRL.", "paper_summary_zh": "本文探討多種最佳化方法，以提升基於評分強化學習 (RbRL) 的效能。RbRL 是一種基於人類評分概念的方法，用於推論無獎勵環境中的獎勵函數，以便透過標準強化學習進行後續的政策學習，而後者需要獎勵函數。具體而言，RbRL 最小化交叉熵損失，而交叉熵損失量化了人類評分與從推論獎勵中衍生的預估評分之間的差異。因此，損失低表示人類評分與預估評分之間的一致性高。儘管形式簡單，但 RbRL 具有各種超參數，且可能對各種因素敏感。因此，提供全面的實驗以了解各種超參數對 RbRL 效能的影響至關重要。本文是一項正在進行中的工作，為使用者提供一些有關如何在 RbRL 中選擇超參數的一般準則。", "author": "Evelyn Rose et.al.", "authors": "Evelyn Rose, Devin White, Mingkang Wu, Vernon Lawhern, Nicholas R. Waytowich, Yongcan Cao", "id": "2501.07755v1", "paper_url": "http://arxiv.org/abs/2501.07755v1", "repo": "null"}}