{"2405.17959": {"publish_time": "2024-05-28", "title": "Attention-based sequential recommendation system using multimodal data", "paper_summary": "Sequential recommendation systems that model dynamic preferences based on a\nuse's past behavior are crucial to e-commerce. Recent studies on these systems\nhave considered various types of information such as images and texts. However,\nmultimodal data have not yet been utilized directly to recommend products to\nusers. In this study, we propose an attention-based sequential recommendation\nmethod that employs multimodal data of items such as images, texts, and\ncategories. First, we extract image and text features from pre-trained VGG and\nBERT and convert categories into multi-labeled forms. Subsequently, attention\noperations are performed independent of the item sequence and multimodal\nrepresentations. Finally, the individual attention information is integrated\nthrough an attention fusion function. In addition, we apply multitask learning\nloss for each modality to improve the generalization performance. The\nexperimental results obtained from the Amazon datasets show that the proposed\nmethod outperforms those of conventional sequential recommendation systems.", "paper_summary_zh": "採用根據使用者的過往行為建模動態偏好的序列推薦系統，對於電子商務至關重要。最近針對這些系統的研究考慮了各種資訊類型，例如圖片和文字。然而，多模態資料尚未直接用於向使用者推薦產品。在本研究中，我們提出一個基於注意力的序列推薦方法，採用項目多模態資料，例如圖片、文字和類別。首先，我們從預先訓練的 VGG 和 BERT 中提取圖片和文字特徵，並將類別轉換成多標籤形式。隨後，注意運算獨立於項目序列和多模態表示進行。最後，透過注意力融合函數整合個別注意力資訊。此外，我們對每個模態套用多任務學習損失，以改善泛化效能。從 Amazon 資料集取得的實驗結果顯示，提出的方法優於傳統序列推薦系統。", "author": "Hyungtaik Oh et.al.", "authors": "Hyungtaik Oh, Wonkeun Jo, Dongil Kim", "id": "2405.17959v1", "paper_url": "http://arxiv.org/abs/2405.17959v1", "repo": "null"}}