{"2503.14503": {"publish_time": "2025-03-18", "title": "The Power of Context: How Multimodality Improves Image Super-Resolution", "paper_summary": "Single-image super-resolution (SISR) remains challenging due to the inherent\ndifficulty of recovering fine-grained details and preserving perceptual quality\nfrom low-resolution inputs. Existing methods often rely on limited image\npriors, leading to suboptimal results. We propose a novel approach that\nleverages the rich contextual information available in multiple modalities --\nincluding depth, segmentation, edges, and text prompts -- to learn a powerful\ngenerative prior for SISR within a diffusion model framework. We introduce a\nflexible network architecture that effectively fuses multimodal information,\naccommodating an arbitrary number of input modalities without requiring\nsignificant modifications to the diffusion process. Crucially, we mitigate\nhallucinations, often introduced by text prompts, by using spatial information\nfrom other modalities to guide regional text-based conditioning. Each\nmodality's guidance strength can also be controlled independently, allowing\nsteering outputs toward different directions, such as increasing bokeh through\ndepth or adjusting object prominence via segmentation. Extensive experiments\ndemonstrate that our model surpasses state-of-the-art generative SISR methods,\nachieving superior visual quality and fidelity. See project page at\nhttps://mmsr.kfmei.com/.", "paper_summary_zh": "<paragraph>單影像超解析度 (SISR) 仍然是一項挑戰，因為從低解析度輸入中恢復細緻細節並保持感知品質存在固有的難度。現有方法通常依賴有限的影像先驗知識，導致結果不理想。我們提出了一種新穎的方法，它利用多種模態中豐富的上下文資訊——包括深度、分割、邊緣和文字提示——在擴散模型框架內學習 SISR 的強大生成先驗知識。我們引入了一種靈活的網路架構，可以有效地融合多模態資訊，適應任意數量的輸入模態，而無需對擴散過程進行重大修改。至關重要的是，我們透過使用來自其他模態的空間資訊來引導區域文字條件，從而減輕了文字提示經常引入的幻覺。每個模態的引導強度也可以獨立控制，允許將輸出引導到不同的方向，例如透過深度增加散景或透過分割調整對象的突出程度。大量實驗表明，我們的模型超越了最先進的生成式 SISR 方法，實現了卓越的視覺品質和保真度。請參閱專案頁面：https://mmsr.kfmei.com/。</paragraph>\n", "author": "Kangfu Mei et.al.", "authors": "Kangfu Mei, Hossein Talebi, Mojtaba Ardakani, Vishal M. Patel, Peyman Milanfar, Mauricio Delbracio", "id": "2503.14503v1", "paper_url": "http://arxiv.org/abs/2503.14503v1", "repo": "null"}}