{"2410.13643": {"publish_time": "2024-10-17", "title": "Fine-Tuning Discrete Diffusion Models via Reward Optimization with Applications to DNA and Protein Design", "paper_summary": "Recent studies have demonstrated the strong empirical performance of\ndiffusion models on discrete sequences across domains from natural language to\nbiological sequence generation. For example, in the protein inverse folding\ntask, conditional diffusion models have achieved impressive results in\ngenerating natural-like sequences that fold back into the original structure.\nHowever, practical design tasks often require not only modeling a conditional\ndistribution but also optimizing specific task objectives. For instance, we may\nprefer protein sequences with high stability. To address this, we consider the\nscenario where we have pre-trained discrete diffusion models that can generate\nnatural-like sequences, as well as reward models that map sequences to task\nobjectives. We then formulate the reward maximization problem within discrete\ndiffusion models, analogous to reinforcement learning (RL), while minimizing\nthe KL divergence against pretrained diffusion models to preserve naturalness.\nTo solve this RL problem, we propose a novel algorithm, DRAKES, that enables\ndirect backpropagation of rewards through entire trajectories generated by\ndiffusion models, by making the originally non-differentiable trajectories\ndifferentiable using the Gumbel-Softmax trick. Our theoretical analysis\nindicates that our approach can generate sequences that are both natural-like\nand yield high rewards. While similar tasks have been recently explored in\ndiffusion models for continuous domains, our work addresses unique algorithmic\nand theoretical challenges specific to discrete diffusion models, which arise\nfrom their foundation in continuous-time Markov chains rather than Brownian\nmotion. Finally, we demonstrate the effectiveness of DRAKES in generating DNA\nand protein sequences that optimize enhancer activity and protein stability,\nrespectively, important tasks for gene therapies and protein-based\ntherapeutics.", "paper_summary_zh": "<paragraph>最近的研究表明，扩散模型在从自然语言到生物序列生成的不同领域离散序列上的强劲经验表现。例如，在蛋白质逆折叠任务中，条件扩散模型在生成可折叠回原始结构的自然序列方面取得了令人印象深刻的结果。然而，实际设计任务通常不仅需要对条件分布进行建模，还需要优化特定的任务目标。例如，我们可能更喜欢具有高稳定性的蛋白质序列。为了解决这个问题，我们考虑了这样一个场景：我们有预先训练好的离散扩散模型，可以生成自然序列，以及将序列映射到任务目标的奖励模型。然后，我们在离散扩散模型中制定奖励最大化问题，类似于强化学习 (RL)，同时最小化与预训练扩散模型的 KL 散度，以保持自然性。为了解决这个 RL 问题，我们提出了一种新算法 DRAKES，它可以通过使用 Gumbel-Softmax 技巧使原本不可微分的轨迹可微分，从而实现通过扩散模型生成的整个轨迹的奖励的直接反向传播。我们的理论分析表明，我们的方法可以生成既自然又产生高奖励的序列。虽然类似的任务最近在连续域的扩散模型中得到了探索，但我们的工作解决了离散扩散模型特有的独特的算法和理论挑战，这些挑战源于它们建立在连续时间马尔可夫链而不是布朗运动之上。最后，我们展示了 DRAKES 在生成分别优化增强剂活性和蛋白质稳定性的 DNA 和蛋白质序列方面的有效性，这对基因疗法和基于蛋白质的疗法来说都是重要的任务。</paragraph>", "author": "Chenyu Wang et.al.", "authors": "Chenyu Wang, Masatoshi Uehara, Yichun He, Amy Wang, Tommaso Biancalani, Avantika Lal, Tommi Jaakkola, Sergey Levine, Hanchen Wang, Aviv Regev", "id": "2410.13643v1", "paper_url": "http://arxiv.org/abs/2410.13643v1", "repo": "https://github.com/chenyuwang-monica/drakes"}}