{"2412.13858": {"publish_time": "2024-12-18", "title": "IDEQ: an improved diffusion model for the TSP", "paper_summary": "We investigate diffusion models to solve the Traveling Salesman Problem.\nBuilding on the recent DIFUSCO and T2TCO approaches, we propose IDEQ. IDEQ\nimproves the quality of the solutions by leveraging the constrained structure\nof the state space of the TSP. Another key component of IDEQ consists in\nreplacing the last stages of DIFUSCO curriculum learning by considering a\nuniform distribution over the Hamiltonian tours whose orbits by the 2-opt\noperator converge to the optimal solution as the training objective. Our\nexperiments show that IDEQ improves the state of the art for such neural\nnetwork based techniques on synthetic instances. More importantly, our\nexperiments show that IDEQ performs very well on the instances of the TSPlib, a\nreference benchmark in the TSP community: it closely matches the performance of\nthe best heuristics, LKH3, being even able to obtain better solutions than LKH3\non 2 instances of the TSPlib defined on 1577 and 3795 cities. IDEQ obtains 0.3%\noptimality gap on TSP instances made of 500 cities, and 0.5% on TSP instances\nwith 1000 cities. This sets a new SOTA for neural based methods solving the\nTSP. Moreover, IDEQ exhibits a lower variance and better scales-up with the\nnumber of cities with regards to DIFUSCO and T2TCO.", "paper_summary_zh": "我們研究擴散模型來解決旅行商問題。\n建立在最近的 DIFUSCO 和 T2TCO 方法之上，我們提出 IDEQ。IDEQ\n通過利用 TSP 狀態空間的約束結構來改善解決方案的品質。IDEQ 的另一個關鍵組成部分在於\n通過考慮哈密頓迴路的均勻分布來替換 DIFUSCO 課程學習的最後階段，其軌道由 2 選擇運算子收斂到最佳解，作為訓練目標。我們的\n實驗顯示，IDEQ 改善了此類神經網路技術在合成實例上的最新技術。更重要的是，我們的\n實驗顯示，IDEQ 在 TSPlib 的實例上表現得非常好，TSPlib 是 TSP 社群中的參考基準：它與最佳啟發式演算法 LKH3 的效能非常接近，甚至能夠在 TSPlib 定義的 1577 個和 3795 個城市的 2 個實例上獲得比 LKH3 更好的解。IDEQ 在由 500 個城市組成的 TSP 實例上獲得 0.3% 的最優解差距，在由 1000 個城市組成的 TSP 實例上獲得 0.5%。這為解決 TSP 的基於神經的方法設定了新的 SOTA。此外，IDEQ 表現出較低的變異性，並且在城市數量方面與 DIFUSCO 和 T2TCO 相比具有更好的擴充性。", "author": "Mickael Basson et.al.", "authors": "Mickael Basson, Philippe Preux", "id": "2412.13858v1", "paper_url": "http://arxiv.org/abs/2412.13858v1", "repo": "null"}}