{"2501.04662": {"publish_time": "2025-01-08", "title": "On The Origin of Cultural Biases in Language Models: From Pre-training Data to Linguistic Phenomena", "paper_summary": "Language Models (LMs) have been shown to exhibit a strong preference towards\nentities associated with Western culture when operating in non-Western\nlanguages. In this paper, we aim to uncover the origins of entity-related\ncultural biases in LMs by analyzing several contributing factors, including the\nrepresentation of entities in pre-training data and the impact of variations in\nlinguistic phenomena across languages. We introduce CAMeL-2, a parallel\nArabic-English benchmark of 58,086 entities associated with Arab and Western\ncultures and 367 masked natural contexts for entities. Our evaluations using\nCAMeL-2 reveal reduced performance gaps between cultures by LMs when tested in\nEnglish compared to Arabic. We find that LMs struggle in Arabic with entities\nthat appear at high frequencies in pre-training, where entities can hold\nmultiple word senses. This also extends to entities that exhibit high lexical\noverlap with languages that are not Arabic but use the Arabic script. Further,\nwe show how frequency-based tokenization leads to this issue in LMs, which gets\nworse with larger Arabic vocabularies. We will make CAMeL-2 available at:\nhttps://github.com/tareknaous/camel2", "paper_summary_zh": "語言模型 (LM) 在使用非西方語言時，已被證明對與西方文化相關的實體表現出強烈的偏好。在本文中，我們旨在透過分析幾個促成因素來揭露語言模型中與實體相關的文化偏見的根源，包括實體在預訓練資料中的表示，以及語言中語言現象變化的影響。我們引入了 CAMeL-2，一個包含 58,086 個與阿拉伯和西方文化相關的實體，以及 367 個用於實體的遮蔽自然語境的平行阿拉伯語-英語基準。我們使用 CAMeL-2 進行的評估顯示，與在阿拉伯語中測試相比，語言模型在英語中測試時，不同文化之間的效能差距縮小。我們發現語言模型在阿拉伯語中處理在預訓練中出現頻率高的實體時會遇到困難，因為實體可能有多個詞彙意義。這也延伸到與非阿拉伯語但使用阿拉伯文字的語言具有高度詞彙重疊的實體。此外，我們展示了基於頻率的詞彙化如何導致語言模型中出現此問題，而隨著阿拉伯語詞彙量的增加，情況會變得更糟。我們將在以下位置提供 CAMeL-2：https://github.com/tareknaous/camel2", "author": "Tarek Naous et.al.", "authors": "Tarek Naous, Wei Xu", "id": "2501.04662v1", "paper_url": "http://arxiv.org/abs/2501.04662v1", "repo": "null"}}