{"2407.11383": {"publish_time": "2024-07-16", "title": "TM-PATHVQA:90000+ Textless Multilingual Questions for Medical Visual Question Answering", "paper_summary": "In healthcare and medical diagnostics, Visual Question Answering (VQA)\nmayemergeasapivotal tool in scenarios where analysis of intricate medical\nimages becomes critical for accurate diagnoses. Current text-based VQA systems\nlimit their utility in scenarios where hands-free interaction and accessibility\nare crucial while performing tasks. A speech-based VQA system may provide a\nbetter means of interaction where information can be accessed while performing\ntasks simultaneously. To this end, this work implements a speech-based VQA\nsystem by introducing a Textless Multilingual Pathological VQA (TMPathVQA)\ndataset, an expansion of the PathVQA dataset, containing spoken questions in\nEnglish, German & French. This dataset comprises 98,397 multilingual spoken\nquestions and answers based on 5,004 pathological images along with 70 hours of\naudio. Finally, this work benchmarks and compares TMPathVQA systems implemented\nusing various combinations of acoustic and visual features.", "paper_summary_zh": "在醫療保健和醫療診斷中，視覺問答（VQA）可能成為關鍵工具，在分析複雜的醫療影像對於準確診斷至關重要的場景中。目前的基於文字的 VQA 系統限制了它們在執行任務時免持互動和可及性至關重要的場景中的效用。基於語音的 VQA 系統可能提供更好的互動方式，可以在執行任務的同時存取資訊。為此，本研究透過導入無文字多語言病理 VQA（TMPathVQA）資料集，擴充了 PathVQA 資料集，包含英語、德語和法語的口說問題，實作了一個基於語音的 VQA 系統。此資料集包含 98,397 個多語言的口說問題和答案，基於 5,004 個病理影像以及 70 小時的音訊。最後，本研究使用各種音訊和視覺特徵的組合來實作 TMPathVQA 系統，並進行基準測試和比較。", "author": "Tonmoy Rajkhowa et.al.", "authors": "Tonmoy Rajkhowa, Amartya Roy Chowdhury, Sankalp Nagaonkar, Achyut Mani Tripathi", "id": "2407.11383v1", "paper_url": "http://arxiv.org/abs/2407.11383v1", "repo": "null"}}