{"2412.08901": {"publish_time": "2024-12-12", "title": "Radiology Report Generation via Multi-objective Preference Optimization", "paper_summary": "Automatic Radiology Report Generation (RRG) is an important topic for\nalleviating the substantial workload of radiologists. Existing RRG approaches\nrely on supervised regression based on different architectures or additional\nknowledge injection,while the generated report may not align optimally with\nradiologists' preferences. Especially, since the preferences of radiologists\nare inherently heterogeneous and multidimensional, e.g., some may prioritize\nreport fluency, while others emphasize clinical accuracy. To address this\nproblem,we propose a new RRG method via Multi-objective Preference Optimization\n(MPO) to align the pre-trained RRG model with multiple human preferences, which\ncan be formulated by multi-dimensional reward functions and optimized by\nmulti-objective reinforcement learning (RL). Specifically, we use a preference\nvector to represent the weight of preferences and use it as a condition for the\nRRG model. Then, a linearly weighed reward is obtained via a dot product\nbetween the preference vector and multi-dimensional reward.Next,the RRG model\nis optimized to align with the preference vector by optimizing such a reward\nvia RL. In the training stage,we randomly sample diverse preference vectors\nfrom the preference space and align the model by optimizing the weighted\nmulti-objective rewards, which leads to an optimal policy on the entire\npreference space. When inference,our model can generate reports aligned with\nspecific preferences without further fine-tuning. Extensive experiments on two\npublic datasets show the proposed method can generate reports that cater to\ndifferent preferences in a single model and achieve state-of-the-art\nperformance.", "paper_summary_zh": "自動放射科報告生成 (RRG) 是減輕放射科醫師大量工作負擔的重要課題。現有的 RRG 方法仰賴基於不同架構或額外知識注入的監督式回歸，而產生的報告可能無法最佳地符合放射科醫師的偏好。特別是，由於放射科醫師的偏好本質上是異質且多面向的，例如，有些人可能會優先考慮報告流暢性，而另一些人則強調臨床準確性。為了解決這個問題，我們提出一個新的 RRG 方法，透過多目標偏好最佳化 (MPO) 來調整預訓練的 RRG 模型，以符合多個人偏好，這可以用多維度獎勵函數來制定，並透過多目標強化學習 (RL) 來最佳化。具體來說，我們使用偏好向量來表示偏好的權重，並將其用作 RRG 模型的條件。然後，透過偏好向量與多維度獎勵之間的點積，取得線性加權獎勵。接下來，透過 RL 最佳化此類獎勵，將 RRG 模型最佳化，以符合偏好向量。在訓練階段，我們從偏好空間中隨機取樣多樣化的偏好向量，並透過最佳化加權的多目標獎勵來調整模型，這會在整個偏好空間中產生最佳策略。在推理時，我們的模型可以在不進一步微調的情況下，產生符合特定偏好的報告。在兩個公開資料集上的廣泛實驗顯示，所提出的方法可以在單一模型中產生迎合不同偏好的報告，並達到最先進的效能。", "author": "Ting Xiao et.al.", "authors": "Ting Xiao, Lei Shi, Peng Liu, Zhe Wang, Chenjia Bai", "id": "2412.08901v1", "paper_url": "http://arxiv.org/abs/2412.08901v1", "repo": "null"}}