{"2408.02128": {"publish_time": "2024-08-04", "title": "Table Transformers for Imputing Textual Attributes", "paper_summary": "Missing data in tabular dataset is a common issue as the performance of\ndownstream tasks usually depends on the completeness of the training dataset.\nPrevious missing data imputation methods focus on numeric and categorical\ncolumns, but we propose a novel end-to-end approach called Table Transformers\nfor Imputing Textual Attributes (TTITA) based on the transformer to impute\nunstructured textual columns using other columns in the table. We conduct\nextensive experiments on two Amazon Reviews datasets, and our approach shows\ncompetitive performance outperforming baseline models such as recurrent neural\nnetworks and Llama2. The performance improvement is more significant when the\ntarget sequence has a longer length. Additionally, we incorporated multi-task\nlearning to simultaneously impute for heterogeneous columns, boosting the\nperformance for text imputation. We also qualitatively compare with ChatGPT for\nrealistic applications.", "paper_summary_zh": "表格資料集中遺失的資料是一個常見的問題，因為下游任務的效能通常取決於訓練資料集的完整性。先前的遺失資料填補方法專注於數字和類別欄位，但我們提出了一種稱為表格Transformer用於填補文字屬性（TTITA）的新穎端到端方法，該方法基於Transformer，使用表格中的其他欄位來填補非結構化的文字欄位。我們對兩個 Amazon 評論資料集進行了廣泛的實驗，我們的做法展現了優異的效能，優於基線模型，例如遞迴神經網路和 Llama2。當目標序列較長時，效能提升更為顯著。此外，我們結合了多任務學習來同時填補異質欄位，提升文字填補的效能。我們也從質性的角度與 ChatGPT 進行比較，以進行實際應用。", "author": "Ting-Ruen Wei et.al.", "authors": "Ting-Ruen Wei, Yuan Wang, Yoshitaka Inoue, Hsin-Tai Wu, Yi Fang", "id": "2408.02128v1", "paper_url": "http://arxiv.org/abs/2408.02128v1", "repo": "null"}}