{"2407.11789": {"publish_time": "2024-07-16", "title": "Large Language Models as Misleading Assistants in Conversation", "paper_summary": "Large Language Models (LLMs) are able to provide assistance on a wide range\nof information-seeking tasks. However, model outputs may be misleading, whether\nunintentionally or in cases of intentional deception. We investigate the\nability of LLMs to be deceptive in the context of providing assistance on a\nreading comprehension task, using LLMs as proxies for human users. We compare\noutcomes of (1) when the model is prompted to provide truthful assistance, (2)\nwhen it is prompted to be subtly misleading, and (3) when it is prompted to\nargue for an incorrect answer. Our experiments show that GPT-4 can effectively\nmislead both GPT-3.5-Turbo and GPT-4, with deceptive assistants resulting in up\nto a 23% drop in accuracy on the task compared to when a truthful assistant is\nused. We also find that providing the user model with additional context from\nthe passage partially mitigates the influence of the deceptive model. This work\nhighlights the ability of LLMs to produce misleading information and the\neffects this may have in real-world situations.", "paper_summary_zh": "大型語言模型 (LLM) 能夠在各種資訊搜尋任務中提供協助。然而，模型的輸出可能具有誤導性，無論是無意的或是有意欺騙。我們調查了 LLM 在閱讀理解任務中提供協助時具有欺騙性的能力，使用 LLM 作為人類使用者的代理。我們比較了 (1) 當模型被提示提供真實協助、(2) 當它被提示進行微妙的誤導、以及 (3) 當它被提示為錯誤答案辯護的結果。我們的實驗表明，GPT-4 可以有效地誤導 GPT-3.5-Turbo 和 GPT-4，與使用真實助理相比，具有欺騙性的助理導致任務準確度下降多達 23%。我們還發現，為使用者模型提供來自段落的額外背景，可以部分減輕欺騙性模型的影響。這項工作突顯了 LLM 產生誤導性資訊的能力，以及這可能在現實世界中產生的影響。", "author": "Betty Li Hou et.al.", "authors": "Betty Li Hou, Kejian Shi, Jason Phang, James Aung, Steven Adler, Rosie Campbell", "id": "2407.11789v1", "paper_url": "http://arxiv.org/abs/2407.11789v1", "repo": "null"}}