{"2502.14855": {"publish_time": "2025-02-20", "title": "Prompt-to-Leaderboard", "paper_summary": "Large language model (LLM) evaluations typically rely on aggregated metrics\nlike accuracy or human preference, averaging across users and prompts. This\naveraging obscures user- and prompt-specific variations in model performance.\nTo address this, we propose Prompt-to-Leaderboard (P2L), a method that produces\nleaderboards specific to a prompt. The core idea is to train an LLM taking\nnatural language prompts as input to output a vector of Bradley-Terry\ncoefficients which are then used to predict the human preference vote. The\nresulting prompt-dependent leaderboards allow for unsupervised task-specific\nevaluation, optimal routing of queries to models, personalization, and\nautomated evaluation of model strengths and weaknesses. Data from Chatbot Arena\nsuggest that P2L better captures the nuanced landscape of language model\nperformance than the averaged leaderboard. Furthermore, our findings suggest\nthat P2L's ability to produce prompt-specific evaluations follows a power law\nscaling similar to that observed in LLMs themselves. In January 2025, the\nrouter we trained based on this methodology achieved the \\#1 spot in the\nChatbot Arena leaderboard. Our code is available at this GitHub link:\nhttps://github.com/lmarena/p2l.", "paper_summary_zh": "大型語言模型 (LLM) 評估通常依賴於彙總的指標，例如準確性或人類偏好，平均值跨使用者和提示。此平均值模糊了使用者和提示特定的模型效能變異。為了解決此問題，我們提出提示到排行榜 (P2L)，一種產生特定於提示的排行榜的方法。核心概念是訓練 LLM，將自然語言提示作為輸入，以輸出 Bradley-Terry 係數向量，然後用於預測人類偏好投票。產生的提示相關排行榜允許無監督任務特定評估、最佳查詢路由至模型、個人化以及模型優缺點的自動化評估。來自 Chatbot Arena 的資料表明，P2L 比平均排行榜更能捕捉語言模型效能的細微變化。此外，我們的研究結果表明，P2L 產生提示特定評估的能力遵循類似於 LLM 本身觀察到的冪律縮放。2025 年 1 月，我們根據此方法訓練的路由器在 Chatbot Arena 排行榜中獲得了第一名。我們的程式碼可在 GitHub 連結取得：https://github.com/lmarena/p2l。", "author": "Evan Frick et.al.", "authors": "Evan Frick, Connor Chen, Joseph Tennyson, Tianle Li, Wei-Lin Chiang, Anastasios N. Angelopoulos, Ion Stoica", "id": "2502.14855v1", "paper_url": "http://arxiv.org/abs/2502.14855v1", "repo": "null"}}