{"2408.11351": {"publish_time": "2024-08-21", "title": "Vision HgNN: An Electron-Micrograph is Worth Hypergraph of Hypernodes", "paper_summary": "Material characterization using electron micrographs is a crucial but\nchallenging task with applications in various fields, such as semiconductors,\nquantum materials, batteries, etc. The challenges in categorizing electron\nmicrographs include but are not limited to the complexity of patterns, high\nlevel of detail, and imbalanced data distribution(long-tail distribution).\nExisting methods have difficulty in modeling the complex relational structure\nin electron micrographs, hindering their ability to effectively capture the\ncomplex relationships between different spatial regions of micrographs. We\npropose a hypergraph neural network(HgNN) backbone architecture, a conceptually\nalternative approach, to better model the complex relationships in electron\nmicrographs and improve material characterization accuracy. By utilizing\ncost-effective GPU hardware, our proposed framework outperforms popular\nbaselines. The results of the ablation studies demonstrate that the proposed\nframework is effective in achieving state-of-the-art performance on benchmark\ndatasets and efficient in terms of computational and memory requirements for\nhandling large-scale electron micrograph-based datasets.", "paper_summary_zh": "使用電子顯微照片進行材料表徵是一項至關重要的任務，但在半導體、量子材料、電池等各個領域的應用中都面臨著挑戰。對電子顯微照片進行分類的挑戰包括但不限於模式的複雜性、高細節程度和不平衡的數據分佈（長尾分佈）。現有的方法難以對電子顯微照片中的複雜關係結構進行建模，這阻礙了它們有效捕捉顯微照片不同空間區域之間複雜關係的能力。我們提出了一種超圖神經網絡（HgNN）主幹架構，這是一種概念上的替代方法，可以更好地對電子顯微照片中的複雜關係進行建模並提高材料表徵的準確性。通過利用經濟高效的 GPU 硬體，我們提出的框架優於流行的基準。消融研究的結果表明，所提出的框架在基準數據集上實現了最先進的性能，並且在處理基於大規模電子顯微照片的數據集時在計算和記憶體需求方面是有效的。", "author": "Sakhinana Sagar Srinivas et.al.", "authors": "Sakhinana Sagar Srinivas, Rajat Kumar Sarkar, Sreeja Gangasani, Venkataramana Runkana", "id": "2408.11351v1", "paper_url": "http://arxiv.org/abs/2408.11351v1", "repo": "null"}}