{"2407.02138": {"publish_time": "2024-07-02", "title": "Efficient Nearest Neighbor based Uncertainty Estimation for Natural Language Processing Tasks", "paper_summary": "Trustworthy prediction in Deep Neural Networks (DNNs), including Pre-trained\nLanguage Models (PLMs) is important for safety-critical applications in the\nreal world. However, DNNs often suffer from uncertainty estimation, such as\nmiscalibration. In particular, approaches that require multiple stochastic\ninference can mitigate this problem, but the expensive cost of inference makes\nthem impractical. In this study, we propose $k$-Nearest Neighbor Uncertainty\nEstimation ($k$NN-UE), which is an uncertainty estimation method that uses the\ndistances from the neighbors and label-existence ratio of neighbors.\nExperiments on sentiment analysis, natural language inference, and named entity\nrecognition show that our proposed method outperforms the baselines or recent\ndensity-based methods in confidence calibration, selective prediction, and\nout-of-distribution detection. Moreover, our analyses indicate that introducing\ndimension reduction or approximate nearest neighbor search inspired by recent\n$k$NN-LM studies reduces the inference overhead without significantly degrading\nestimation performance when combined them appropriately.", "paper_summary_zh": "在深度神经網路（DNN）中，包括預先訓練的語言模型（PLM），可信賴的預測對於現實世界中的安全關鍵應用非常重要。然而，DNN 經常會遇到不確定性估計的問題，例如校準不良。特別是，需要多次隨機推論的方法可以減輕這個問題，但昂貴的推論成本讓它們不切實際。在這項研究中，我們提出 $k$-最近鄰不確定性估計（$k$NN-UE），這是一種使用鄰近距離和鄰近標籤存在比的不確定性估計方法。在情緒分析、自然語言推論和命名實體識別的實驗中，我們提出的方法在信心校準、選擇性預測和分布外偵測方面優於基準或最近的基於密度的模型。此外，我們的分析表明，在適當地結合它們時，引入最近鄰語言模型（$k$NN-LM）研究中啟發的降維或近似最近鄰搜尋，可以減少推論開銷，而不會顯著降低估計效能。", "author": "Wataru Hashimoto et.al.", "authors": "Wataru Hashimoto, Hidetaka Kamigaito, Taro Watanabe", "id": "2407.02138v1", "paper_url": "http://arxiv.org/abs/2407.02138v1", "repo": "null"}}