{"2407.02776": {"publish_time": "2024-07-03", "title": "A Framework for Quantum Finite-State Languages with Density Mapping", "paper_summary": "A quantum finite-state automaton (QFA) is a theoretical model designed to\nsimulate the evolution of a quantum system with finite memory in response to\nsequential input strings. We define the language of a QFA as the set of strings\nthat lead the QFA to an accepting state when processed from its initial state.\nQFAs exemplify how quantum computing can achieve greater efficiency compared to\nclassical computing. While being one of the simplest quantum models, QFAs are\nstill notably challenging to construct from scratch due to the preliminary\nknowledge of quantum mechanics required for superimposing unitary constraints\non the automata. Furthermore, even when QFAs are correctly assembled, the\nlimitations of a current quantum computer may cause fluctuations in the\nsimulation results depending on how an assembled QFA is translated into a\nquantum circuit.\n  We present a framework that provides a simple and intuitive way to build QFAs\nand maximize the simulation accuracy. Our framework relies on two methods:\nFirst, it offers a predefined construction for foundational types of QFAs that\nrecognize special languages MOD and EQU. They play a role of basic building\nblocks for more complex QFAs. In other words, one can obtain more complex QFAs\nfrom these foundational automata using standard language operations. Second, we\nimprove the simulation accuracy by converting these QFAs into quantum circuits\nsuch that the resulting circuits perform well on noisy quantum computers.\n  Our framework is available at https://github.com/sybaik1/qfa-toolkit.", "paper_summary_zh": "量子有限狀態自動機 (QFA) 是一種理論模型，用來模擬量子系統在回應順序輸入字串時有限記憶的演化。我們將 QFA 的語言定義為一組字串，這些字串會在從其初始狀態處理時引導 QFA 進入接受狀態。QFA 說明了量子運算如何能比古典運算達到更高的效率。儘管 QFA 是最簡單的量子模型之一，但由於自動機上疊加酉約束所需的量子力學預備知識，從頭開始建構 QFA 仍極具挑戰性。此外，即使 QFA 正確組裝，當組裝好的 QFA 轉換成量子電路時，目前量子電腦的限制可能會導致模擬結果產生波動。\n我們提出一個架構，提供一種簡單且直觀的方式來建構 QFA 並最大化模擬準確度。我們的架構依賴於兩種方法：首先，它為識別特殊語言 MOD 和 EQU 的基礎類型 QFA 提供預定義的建構。它們扮演了更複雜 QFA 基本建構模組的角色。換句話說，人們可以使用標準語言操作從這些基礎自動機中獲得更複雜的 QFA。其次，我們透過將這些 QFA 轉換成量子電路來改善模擬準確度，使得產生的電路能在有雜訊的量子電腦上執行良好。\n我們的架構可以在 https://github.com/sybaik1/qfa-toolkit 取得。", "author": "SeungYeop Baik et.al.", "authors": "SeungYeop Baik, Sicheol Sung, Yo-Sub Han", "id": "2407.02776v1", "paper_url": "http://arxiv.org/abs/2407.02776v1", "repo": "https://github.com/sybaik1/qfa-toolkit"}}