{"2412.18086": {"publish_time": "2024-12-24", "title": "Generating Traffic Scenarios via In-Context Learning to Learn Better Motion Planner", "paper_summary": "Motion planning is a crucial component in autonomous driving.\nState-of-the-art motion planners are trained on meticulously curated datasets,\nwhich are not only expensive to annotate but also insufficient in capturing\nrarely seen critical scenarios. Failing to account for such scenarios poses a\nsignificant risk to motion planners and may lead to incidents during testing.\nAn intuitive solution is to manually compose such scenarios by programming and\nexecuting a simulator (e.g., CARLA). However, this approach incurs substantial\nhuman costs. Motivated by this, we propose an inexpensive method for generating\ndiverse critical traffic scenarios to train more robust motion planners. First,\nwe represent traffic scenarios as scripts, which are then used by the simulator\nto generate traffic scenarios. Next, we develop a method that accepts\nuser-specified text descriptions, which a Large Language Model (LLM) translates\ninto scripts using in-context learning. The output scripts are sent to the\nsimulator that produces the corresponding traffic scenarios. As our method can\ngenerate abundant safety-critical traffic scenarios, we use them as synthetic\ntraining data for motion planners. To demonstrate the value of generated\nscenarios, we train existing motion planners on our synthetic data, real-world\ndatasets, and a combination of both. Our experiments show that motion planners\ntrained with our data significantly outperform those trained solely on\nreal-world data, showing the usefulness of our synthetic data and the\neffectiveness of our data generation method. Our source code is available at\nhttps://ezharjan.github.io/AutoSceneGen.", "paper_summary_zh": "自動駕駛中，路徑規劃是一項關鍵的組成部分。\n最先進的路徑規劃器會在經過精心策劃的資料集上進行訓練，\n這些資料集的註解不僅昂貴，而且不足以捕捉\n罕見的關鍵場景。無法考量這些場景會對路徑規劃器構成\n重大風險，並可能在測試期間導致事故。\n一個直覺的解決方案是透過程式設計和\n執行模擬器（例如 CARLA）來手動撰寫這些場景。然而，這種方法會產生大量的\n人力成本。有鑑於此，我們提出了一種低成本的方法來產生\n各種關鍵交通場景，以訓練更強大的路徑規劃器。首先，\n我們將交通場景表示為腳本，然後由模擬器\n用來產生交通場景。接下來，我們開發了一種方法，接受\n使用者指定的文字描述，大型語言模型 (LLM) 會使用\n脈絡學習將其轉換為腳本。產出的腳本會傳送給\n模擬器，模擬器會產生對應的交通場景。由於我們的\n方法可以產生大量的安全關鍵交通場景，我們將其用作路徑規劃器的合成\n訓練資料。為了證明生成場景的價值，我們使用我們的合成資料、真實世界\n資料集以及兩者的組合，訓練現有的路徑規劃器。我們的實驗顯示，使用我們的資料訓練的路徑規劃器\n明顯優於僅使用\n真實世界資料訓練的路徑規劃器，這顯示了我們合成資料的用途以及\n我們資料生成方法的有效性。我們的原始程式碼可在\nhttps://ezharjan.github.io/AutoSceneGen 取得。", "author": "Aizierjiang Aiersilan et.al.", "authors": "Aizierjiang Aiersilan", "id": "2412.18086v1", "paper_url": "http://arxiv.org/abs/2412.18086v1", "repo": "https://github.com/Ezharjan/AutoSceneGen"}}