{"2411.14062": {"publish_time": "2024-11-21", "title": "MMGenBench: Evaluating the Limits of LMMs from the Text-to-Image Generation Perspective", "paper_summary": "Large Multimodal Models (LMMs) have demonstrated remarkable capabilities.\nWhile existing benchmarks for evaluating LMMs mainly focus on image\ncomprehension, few works evaluate them from the image generation perspective.\nTo address this issue, we propose a straightforward automated evaluation\npipeline. Specifically, this pipeline requires LMMs to generate an image-prompt\nfrom a given input image. Subsequently, it employs text-to-image generative\nmodels to create a new image based on these generated prompts. Finally, we\nevaluate the performance of LMMs by comparing the original image with the\ngenerated one. Furthermore, we introduce MMGenBench-Test, a comprehensive\nbenchmark developed to evaluate LMMs across 13 distinct image patterns, and\nMMGenBench-Domain, targeting the performance evaluation of LMMs within the\ngenerative image domain. A thorough evaluation involving over 50 popular LMMs\ndemonstrates the effectiveness and reliability in both the pipeline and\nbenchmark. Our observations indicate that numerous LMMs excelling in existing\nbenchmarks fail to adequately complete the basic tasks, related to image\nunderstanding and description. This finding highlights the substantial\npotential for performance improvement in current LMMs and suggests avenues for\nfuture model optimization. Concurrently, our pipeline facilitates the efficient\nassessment of LMMs performance across diverse domains by using solely image\ninputs.", "paper_summary_zh": "大型多模态模型 (LMM) 已展示出惊人的能力。\n虽然用于评估 LMM 的现有基准主要关注图像理解，但很少有研究从图像生成的角度对其进行评估。\n为了解决这个问题，我们提出了一种直接的自动化评估管道。具体来说，此管道要求 LMM 从给定的输入图像生成图像提示。随后，它使用文本到图像生成模型根据这些生成的提示创建新图像。最后，我们通过比较原始图像和生成图像来评估 LMM 的性能。此外，我们引入了 MMGenBench-Test，这是一个综合基准，用于评估 13 种不同图像模式的 LMM，以及 MMGenBench-Domain，针对生成图像域中 LMM 的性能评估。涉及 50 多个流行 LMM 的全面评估证明了管道和基准的有效性和可靠性。我们的观察结果表明，许多在现有基准中表现出色的 LMM 无法充分完成与图像理解和描述相关的基本任务。这一发现突显了当前 LMM 中性能改进的巨大潜力，并为未来的模型优化提供了途径。同时，我们的管道仅使用图像输入即可促进跨不同领域的 LMM 性能的有效评估。", "author": "Hailang Huang et.al.", "authors": "Hailang Huang, Yong Wang, Zixuan Huang, Huaqiu Li, Tongwen Huang, Xiangxiang Chu, Richong Zhang", "id": "2411.14062v1", "paper_url": "http://arxiv.org/abs/2411.14062v1", "repo": "https://github.com/lerogo/mmgenbench"}}