{"2503.03313": {"publish_time": "2025-03-05", "title": "LLM as GNN: Graph Vocabulary Learning for Text-Attributed Graph Foundation Models", "paper_summary": "Text-Attributed Graphs (TAGs), where each node is associated with text\ndescriptions, are ubiquitous in real-world scenarios. They typically exhibit\ndistinctive structure and domain-specific knowledge, motivating the development\nof a Graph Foundation Model (GFM) that generalizes across diverse graphs and\ntasks. Despite large efforts to integrate Large Language Models (LLMs) and\nGraph Neural Networks (GNNs) for TAGs, existing approaches suffer from\ndecoupled architectures with two-stage alignment, limiting their synergistic\npotential. Even worse, existing methods assign out-of-vocabulary (OOV) tokens\nto graph nodes, leading to graph-specific semantics, token explosion, and\nincompatibility with task-oriented prompt templates, which hinders cross-graph\nand cross-task transferability. To address these challenges, we propose\nPromptGFM, a versatile GFM for TAGs grounded in graph vocabulary learning.\nPromptGFM comprises two key components: (1) Graph Understanding Module, which\nexplicitly prompts LLMs to replicate the finest GNN workflow within the text\nspace, facilitating seamless GNN-LLM integration and elegant graph-text\nalignment; (2) Graph Inference Module, which establishes a language-based graph\nvocabulary ensuring expressiveness, transferability, and scalability, enabling\nreadable instructions for LLM fine-tuning. Extensive experiments demonstrate\nour superiority and transferability across diverse graphs and tasks. The code\nis available at this: https://github.com/agiresearch/PromptGFM.", "paper_summary_zh": "<paragraph>文字屬性圖 (TAG)，其中每個節點都與文字描述相關聯，在現實世界的場景中無處不在。它們通常展現出獨特的結構和特定領域的知識，促使人們開發一種圖基礎模型 (GFM)，使其能夠泛化到不同的圖和任務。儘管人們付出了巨大的努力將大型語言模型 (LLM) 和圖神經網絡 (GNN) 整合到 TAG 中，但現有方法仍受限於兩階段對齊的解耦架構，限制了它們的協同潛力。更糟糕的是，現有方法將詞彙表外 (OOV) 的詞符分配給圖節點，導致特定於圖的語義、詞符爆炸以及與面向任務的提示模板不兼容，這阻礙了跨圖和跨任務的可遷移性。為了應對這些挑戰，我們提出了 PromptGFM，這是一種基於圖詞彙學習的多功能 TAG GFM。PromptGFM 包含兩個關鍵組件：(1) 圖理解模組，它明確提示 LLM 在文本空間內複製最佳的 GNN 工作流程，促進 GNN-LLM 的無縫整合和優雅的圖文對齊；(2) 圖推理模組，它建立了一個基於語言的圖詞彙，確保表達性、可遷移性和可擴展性，從而實現 LLM 微調的可讀指令。大量實驗證明了我們在不同圖和任務中的優越性和可遷移性。程式碼在此處可用：https://github.com/agiresearch/PromptGFM。</paragraph>\n", "author": "Xi Zhu et.al.", "authors": "Xi Zhu, Haochen Xue, Ziwei Zhao, Wujiang Xu, Jingyuan Huang, Minghao Guo, Qifan Wang, Kaixiong Zhou, Yongfeng Zhang", "id": "2503.03313v1", "paper_url": "http://arxiv.org/abs/2503.03313v1", "repo": "null"}}