{"2407.08109": {"publish_time": "2024-07-11", "title": "Urban Waterlogging Detection: A Challenging Benchmark and Large-Small Model Co-Adapter", "paper_summary": "Urban waterlogging poses a major risk to public safety and infrastructure.\nConventional methods using water-level sensors need high-maintenance to hardly\nachieve full coverage. Recent advances employ surveillance camera imagery and\ndeep learning for detection, yet these struggle amidst scarce data and adverse\nenvironmental conditions. In this paper, we establish a challenging Urban\nWaterlogging Benchmark (UW-Bench) under diverse adverse conditions to advance\nreal-world applications. We propose a Large-Small Model co-adapter paradigm\n(LSM-adapter), which harnesses the substantial generic segmentation potential\nof large model and the specific task-directed guidance of small model.\nSpecifically, a Triple-S Prompt Adapter module alongside a Dynamic Prompt\nCombiner are proposed to generate then merge multiple prompts for mask decoder\nadaptation. Meanwhile, a Histogram Equalization Adap-ter module is designed to\ninfuse the image specific information for image encoder adaptation. Results and\nanalysis show the challenge and superiority of our developed benchmark and\nalgorithm. Project page: \\url{https://github.com/zhang-chenxu/LSM-Adapter}", "paper_summary_zh": "城市內澇對公共安全和基礎設施構成重大風險。\n使用水位感測器的傳統方法需要高維護，難以實現全面覆蓋。最近的進展採用監控相機影像和深度學習進行偵測，但這些方法在稀缺的資料和惡劣的環境條件下仍面臨挑戰。在本文中，我們建立了一個具有挑戰性的城市內澇基準 (UW-Bench)，在各種不利條件下推進實際應用。我們提出了一個大型-小型模型共適應範例 (LSM-adapter)，它利用了大型模型的強大通用分割潛力和小模型的特定任務指導。\n具體來說，提出了一個三 S 提示適配器模組和一個動態提示組合器，用於生成然後合併多個提示以進行遮罩解碼器適應。同時，設計了一個直方圖均衡適配器模組，用於為影像編碼器適應注入影像特定資訊。結果和分析顯示了我們開發的基準和演算法的挑戰和優越性。專案頁面：\\url{https://github.com/zhang-chenxu/LSM-Adapter}", "author": "Suqi Song et.al.", "authors": "Suqi Song, Chenxu Zhang, Peng Zhang, Pengkun Li, Fenglong Song, Lei Zhang", "id": "2407.08109v1", "paper_url": "http://arxiv.org/abs/2407.08109v1", "repo": "https://github.com/zhang-chenxu/lsm-adapter"}}