{"2405.05161": {"publish_time": "2024-05-08", "title": "Motion Capture Analysis of Verb and Adjective Types in Austrian Sign Language", "paper_summary": "Across a number of sign languages, temporal and spatial characteristics of\ndominant hand articulation are used to express semantic and grammatical\nfeatures. In this study of Austrian Sign Language (\\\"Osterreichische\nGeb\\\"ardensprache, or \\\"OGS), motion capture data of four Deaf signers is used\nto quantitatively characterize the kinematic parameters of sign production in\nverbs and adjectives. We investigate (1) the difference in production between\nverbs involving a natural endpoint (telic verbs; e.g. arrive) and verbs lacking\nan endpoint (atelic verbs; e.g. analyze), and (2) adjective signs in\nintensified vs. non-intensified (plain) forms. Motion capture data analysis\nusing linear-mixed effects models (LME) indicates that both the endpoint\nmarking in verbs, as well as marking of intensification in adjectives, are\nexpressed by movement modulation in \\\"OGS. While the semantic distinction\nbetween verb types (telic/atelic) is marked by higher peak velocity and shorter\nduration for telic signs compared to atelic ones, the grammatical distinction\n(intensification) in adjectives is expressed by longer duration for intensified\ncompared to non-intensified adjectives. The observed individual differences of\nsigners might be interpreted as personal signing style.", "paper_summary_zh": "在許多手語中，慣用手關節的時間和空間特性被用來表達語義和語法特徵。在這項關於奧地利手語（「Osterreichische Geb\\\"ardensprache」或「OGS」）的研究中，四位聾人手語者的動作捕捉資料被用來量化描述動詞和形容詞中手語製作的運動參數。我們探討（1）涉及自然終點的動詞（完成動詞；例如到達）和沒有終點的動詞（非完成動詞；例如分析）之間的製作差異，以及（2）加強與非加強（普通）形式的形容詞手語。使用線性混合效應模型（LME）的動作捕捉資料分析指出，動詞中的終點標記以及形容詞中的強化標記都由「OGS」中的動作調節表達。雖然動詞類型（完成/非完成）之間的語義區別由與非完成手語相比更高的峰值速度和更短的持續時間標記，但形容詞中的語法區別（強化）由與非強化形容詞相比更長的持續時間表達。手語者觀察到的個別差異可能被解釋為個人的手語風格。", "author": "Julia Krebs et.al.", "authors": "Julia Krebs, Evie Malaia, Ronnie B. Wilbur, Isabella Fessl, Hans-Peter Wiesinger, Hermann Schwameder, Dietmar Roehm", "id": "2405.05161v1", "paper_url": "http://arxiv.org/abs/2405.05161v1", "repo": "null"}}