{"2502.03647": {"publish_time": "2025-02-05", "title": "Looking for the Inner Music: Probing LLMs' Understanding of Literary Style", "paper_summary": "Recent work has demonstrated that language models can be trained to identify\nthe author of much shorter literary passages than has been thought feasible for\ntraditional stylometry. We replicate these results for authorship and extend\nthem to a new dataset measuring novel genre. We find that LLMs are able to\ndistinguish authorship and genre, but they do so in different ways. Some models\nseem to rely more on memorization, while others benefit more from training to\nlearn author/genre characteristics. We then use three methods to probe one\nhigh-performing LLM for features that define style. These include direct\nsyntactic ablations to input text as well as two methods that look at model\ninternals. We find that authorial style is easier to define than genre-level\nstyle and is more impacted by minor syntactic decisions and contextual word\nusage. However, some traits like pronoun usage and word order prove significant\nfor defining both kinds of literary style.", "paper_summary_zh": "近期的研究顯示，語言模型可以接受訓練，以識別比傳統文體測量法認為可行的更短文學段的作者。我們複製了這些作者身分結果，並將其延伸到測量新小說類型的資料集。我們發現 LLM 能夠區分作者身分和類型，但它們以不同的方式做到這一點。有些模型似乎更依賴於記憶，而有些模型則從訓練中受益更多，以學習作者/類型的特徵。然後，我們使用三種方法來探查一個高性能 LLM 以找出定義風格的特徵。這些方法包括對輸入文字的直接句法消融，以及查看模型內部的兩種方法。我們發現，作者風格比類型層級風格更容易定義，而且受到較小的句法決策和語境詞彙使用的影響更大。然而，某些特徵（如代名詞使用和詞序）對於定義這兩種文學風格都非常重要。", "author": "Rebecca M. M. Hicke et.al.", "authors": "Rebecca M. M. Hicke, David Mimno", "id": "2502.03647v1", "paper_url": "http://arxiv.org/abs/2502.03647v1", "repo": "null"}}