{"2406.14510": {"publish_time": "2024-06-20", "title": "V-LASIK: Consistent Glasses-Removal from Videos Using Synthetic Data", "paper_summary": "Diffusion-based generative models have recently shown remarkable image and\nvideo editing capabilities. However, local video editing, particularly removal\nof small attributes like glasses, remains a challenge. Existing methods either\nalter the videos excessively, generate unrealistic artifacts, or fail to\nperform the requested edit consistently throughout the video. In this work, we\nfocus on consistent and identity-preserving removal of glasses in videos, using\nit as a case study for consistent local attribute removal in videos. Due to the\nlack of paired data, we adopt a weakly supervised approach and generate\nsynthetic imperfect data, using an adjusted pretrained diffusion model. We show\nthat despite data imperfection, by learning from our generated data and\nleveraging the prior of pretrained diffusion models, our model is able to\nperform the desired edit consistently while preserving the original video\ncontent. Furthermore, we exemplify the generalization ability of our method to\nother local video editing tasks by applying it successfully to facial\nsticker-removal. Our approach demonstrates significant improvement over\nexisting methods, showcasing the potential of leveraging synthetic data and\nstrong video priors for local video editing tasks.", "paper_summary_zh": "基於擴散的生成模型最近展示了卓越的影像和影片編輯功能。然而，局部影片編輯，特別是移除眼鏡等小屬性，仍然是一項挑戰。現有方法會過度改變影片、產生不切實際的人工製品，或無法在整個影片中一致地執行要求的編輯。在這項工作中，我們專注於在影片中一致且保留身分地移除眼鏡，並將其作為影片中一致移除局部屬性的案例研究。由於缺乏配對資料，我們採用弱監督方法，並使用調整後的預訓練擴散模型來產生合成的不完美資料。我們展示了儘管資料不完美，但透過從我們產生的資料中學習並利用預訓練擴散模型的先驗，我們的模型能夠在保留原始影片內容的同時，一致地執行所需的編輯。此外，我們以成功應用於移除臉部貼紙來舉例說明我們的方法對其他局部影片編輯任務的泛化能力。我們的做法展示了利用合成資料和強大的影片先驗來進行局部影片編輯任務的潛力，大幅改善了現有方法。", "author": "Rotem Shalev-Arkushin et.al.", "authors": "Rotem Shalev-Arkushin, Aharon Azulay, Tavi Halperin, Eitan Richardson, Amit H. Bermano, Ohad Fried", "id": "2406.14510v1", "paper_url": "http://arxiv.org/abs/2406.14510v1", "repo": "null"}}