{"2408.11363": {"publish_time": "2024-08-21", "title": "ProteinGPT: Multimodal LLM for Protein Property Prediction and Structure Understanding", "paper_summary": "Understanding biological processes, drug development, and biotechnological\nadvancements requires detailed analysis of protein structures and sequences, a\ntask in protein research that is inherently complex and time-consuming when\nperformed manually. To streamline this process, we introduce ProteinGPT, a\nstate-of-the-art multi-modal protein chat system, that allows users to upload\nprotein sequences and/or structures for comprehensive protein analysis and\nresponsive inquiries. ProteinGPT seamlessly integrates protein sequence and\nstructure encoders with linear projection layers for precise representation\nadaptation, coupled with a large language model (LLM) to generate accurate and\ncontextually relevant responses. To train ProteinGPT, we construct a\nlarge-scale dataset of 132,092 proteins with annotations, and optimize the\ninstruction-tuning process using GPT-4o. This innovative system ensures\naccurate alignment between the user-uploaded data and prompts, simplifying\nprotein analysis. Experiments show that ProteinGPT can produce promising\nresponses to proteins and their corresponding questions.", "paper_summary_zh": "了解生物過程、藥物開發和生物技術進展，需要詳細分析蛋白質結構和序列，這項蛋白質研究任務在手動執行時本質上很複雜且耗時。為了簡化此流程，我們引入了 ProteinGPT，這是一個最先進的多模式蛋白質聊天系統，允許使用者上傳蛋白質序列和/或結構，以進行全面的蛋白質分析和回應式查詢。ProteinGPT 將蛋白質序列和結構編碼器與線性投影層無縫整合，以進行精確的表示適應，並結合大型語言模型 (LLM) 來產生準確且與上下文相關的回應。為了訓練 ProteinGPT，我們構建了一個包含 132,092 個蛋白質的大規模註解資料集，並使用 GPT-4o 最佳化指令調整流程。這個創新的系統確保使用者上傳的資料和提示之間的準確對齊，簡化了蛋白質分析。實驗表明，ProteinGPT 可以對蛋白質及其對應問題產生有希望的回應。", "author": "Yijia Xiao et.al.", "authors": "Yijia Xiao, Edward Sun, Yiqiao Jin, Qifan Wang, Wei Wang", "id": "2408.11363v1", "paper_url": "http://arxiv.org/abs/2408.11363v1", "repo": "null"}}