{"2410.14231": {"publish_time": "2024-10-18", "title": "Unveiling Large Language Models Generated Texts: A Multi-Level Fine-Grained Detection Framework", "paper_summary": "Large language models (LLMs) have transformed human writing by enhancing\ngrammar correction, content expansion, and stylistic refinement. However, their\nwidespread use raises concerns about authorship, originality, and ethics, even\npotentially threatening scholarly integrity. Existing detection methods, which\nmainly rely on single-feature analysis and binary classification, often fail to\neffectively identify LLM-generated text in academic contexts. To address these\nchallenges, we propose a novel Multi-level Fine-grained Detection (MFD)\nframework that detects LLM-generated text by integrating low-level structural,\nhigh-level semantic, and deep-level linguistic features, while conducting\nsentence-level evaluations of lexicon, grammar, and syntax for comprehensive\nanalysis. To improve detection of subtle differences in LLM-generated text and\nenhance robustness against paraphrasing, we apply two mainstream evasion\ntechniques to rewrite the text. These variations, along with original texts,\nare used to train a text encoder via contrastive learning, extracting\nhigh-level semantic features of sentence to boost detection generalization.\nFurthermore, we leverage advanced LLM to analyze the entire text and extract\ndeep-level linguistic features, enhancing the model's ability to capture\ncomplex patterns and nuances while effectively incorporating contextual\ninformation. Extensive experiments on public datasets show that the MFD model\noutperforms existing methods, achieving an MAE of 0.1346 and an accuracy of\n88.56%. Our research provides institutions and publishers with an effective\nmechanism to detect LLM-generated text, mitigating risks of compromised\nauthorship. Educators and editors can use the model's predictions to refine\nverification and plagiarism prevention protocols, ensuring adherence to\nstandards.", "paper_summary_zh": "大型語言模型 (LLM) 透過增強文法修正、內容擴充和文體潤飾，轉變了人類寫作方式。然而，它們的廣泛使用引發了關於作者身份、原創性與道德的疑慮，甚至潛在威脅到學術的完整性。現有的偵測方法主要依賴於單一特徵分析和二元分類，往往無法在學術脈絡中有效識別 LLM 生成的文字。為了應對這些挑戰，我們提出了一個新穎的多層級細粒度偵測 (MFD) 架構，透過整合低層級結構、高層級語意和深層級語言特徵來偵測 LLM 生成的文字，同時對詞彙、文法和句法進行句子層級的評估，以進行全面的分析。為了改善對 LLM 生成的文字中細微差異的偵測，並增強對改寫的健壯性，我們採用了兩種主流的規避技術來改寫文字。這些變體連同原始文字，用於透過對比學習訓練文字編碼器，提取句子的高層級語意特徵，以提升偵測的概化能力。此外，我們利用先進的 LLM 來分析整個文字並提取深層級語言特徵，增強模型捕捉複雜模式和細微差别的能力，同時有效地納入上下文資訊。在公共資料集上進行的廣泛實驗顯示，MFD 模型優於現有方法，MAE 達到 0.1346，準確率達到 88.56%。我們的研究為機構和出版商提供了偵測 LLM 生成的文字的有效機制，降低了作者身份受損的風險。教育工作者和編輯可以使用模型的預測來改善驗證和預防抄襲的協定，確保遵守標準。", "author": "Zhen Tao et.al.", "authors": "Zhen Tao, Zhiyu Li, Runyu Chen, Dinghao Xi, Wei Xu", "id": "2410.14231v1", "paper_url": "http://arxiv.org/abs/2410.14231v1", "repo": "null"}}