{"2503.21766": {"publish_time": "2025-03-27", "title": "Stable-SCore: A Stable Registration-based Framework for 3D Shape Correspondence", "paper_summary": "Establishing character shape correspondence is a critical and fundamental\ntask in computer vision and graphics, with diverse applications including\nre-topology, attribute transfer, and shape interpolation. Current dominant\nfunctional map methods, while effective in controlled scenarios, struggle in\nreal situations with more complex challenges such as non-isometric shape\ndiscrepancies. In response, we revisit registration-for-correspondence methods\nand tap their potential for more stable shape correspondence estimation. To\novercome their common issues including unstable deformations and the necessity\nfor careful pre-alignment or high-quality initial 3D correspondences, we\nintroduce Stable-SCore: A Stable Registration-based Framework for 3D Shape\nCorrespondence. We first re-purpose a foundation model for 2D character\ncorrespondence that ensures reliable and stable 2D mappings. Crucially, we\npropose a novel Semantic Flow Guided Registration approach that leverages 2D\ncorrespondence to guide mesh deformations. Our framework significantly\nsurpasses existing methods in challenging scenarios, and brings possibilities\nfor a wide array of real applications, as demonstrated in our results.", "paper_summary_zh": "<paragraph>建立角色形狀對應關係是電腦視覺和圖形學中一項關鍵且基礎的任務，其應用範圍廣泛，包括重新拓撲、屬性轉移和形狀插值。目前主流的函數映射方法雖然在受控場景中有效，但在處理非等距形狀差異等更複雜的實際情況時卻顯得力不從心。為了解決這個問題，我們重新審視了基於配準的對應關係方法，並挖掘其在更穩定形狀對應關係估計方面的潛力。為了克服這些方法常見的不穩定變形以及需要仔細的預對齊或高質量的初始 3D 對應關係等問題，我們推出了 Stable-SCore：一個基於穩定配準的 3D 形狀對應關係框架。我們首先重新利用一個用於 2D 角色對應關係的基礎模型，以確保可靠且穩定的 2D 映射。至關重要的是，我們提出了一種新穎的語義流引導配準方法，利用 2D 對應關係來引導網格變形。我們的框架在具有挑戰性的場景中顯著優於現有方法，並為廣泛的實際應用帶來了可能性，正如我們的結果所示。</paragraph>\n", "author": "Haolin Liu et.al.", "authors": "Haolin Liu, Xiaohang Zhan, Zizheng Yan, Zhongjin Luo, Yuxin Wen, Xiaoguang Han", "id": "2503.21766v1", "paper_url": "http://arxiv.org/abs/2503.21766v1", "repo": "null"}}