{"2407.02751": {"publish_time": "2024-07-03", "title": "Emotion and Intent Joint Understanding in Multimodal Conversation: A Benchmarking Dataset", "paper_summary": "Emotion and Intent Joint Understanding in Multimodal Conversation (MC-EIU)\naims to decode the semantic information manifested in a multimodal\nconversational history, while inferring the emotions and intents simultaneously\nfor the current utterance. MC-EIU is enabling technology for many\nhuman-computer interfaces. However, there is a lack of available datasets in\nterms of annotation, modality, language diversity, and accessibility. In this\nwork, we propose an MC-EIU dataset, which features 7 emotion categories, 9\nintent categories, 3 modalities, i.e., textual, acoustic, and visual content,\nand two languages, i.e., English and Mandarin. Furthermore, it is completely\nopen-source for free access. To our knowledge, MC-EIU is the first\ncomprehensive and rich emotion and intent joint understanding dataset for\nmultimodal conversation. Together with the release of the dataset, we also\ndevelop an Emotion and Intent Interaction (EI$^2$) network as a reference\nsystem by modeling the deep correlation between emotion and intent in the\nmultimodal conversation. With comparative experiments and ablation studies, we\ndemonstrate the effectiveness of the proposed EI$^2$ method on the MC-EIU\ndataset. The dataset and codes will be made available at:\nhttps://github.com/MC-EIU/MC-EIU.", "paper_summary_zh": "多模态对话中的情感和意图联合理解（MC-EIU）\n旨在解码多模态对话历史中体现的语义信息，同时推断当前话语中的情感和意图。MC-EIU 是许多人机界面的使能技术。然而，在注释、模态、语言多样性和可访问性方面缺乏可用的数据集。在这项工作中，我们提出了一个 MC-EIU 数据集，其中包含 7 个情感类别、9 个意图类别、3 个模态，即文本、声学和视觉内容，以及两种语言，即英语和普通话。此外，它是完全开源的，可以免费访问。据我们所知，MC-EIU 是第一个针对多模态对话的情感和意图联合理解的全面且丰富的语料库。随着数据集的发布，我们还开发了一个情感和意图交互 (EI$^2$) 网络作为参考系统，通过对多模态对话中情感和意图之间的深度相关性进行建模。通过对比实验和消融研究，我们在 MC-EIU 数据集上展示了所提出的 EI$^2$ 方法的有效性。数据集和代码将在以下位置提供：\nhttps://github.com/MC-EIU/MC-EIU。", "author": "Rui Liu et.al.", "authors": "Rui Liu, Haolin Zuo, Zheng Lian, Xiaofen Xing, Björn W. Schuller, Haizhou Li", "id": "2407.02751v1", "paper_url": "http://arxiv.org/abs/2407.02751v1", "repo": "https://github.com/mc-eiu/mc-eiu"}}