{"2407.02751": {"publish_time": "2024-07-03", "title": "Emotion and Intent Joint Understanding in Multimodal Conversation: A Benchmarking Dataset", "paper_summary": "Emotion and Intent Joint Understanding in Multimodal Conversation (MC-EIU)\naims to decode the semantic information manifested in a multimodal\nconversational history, while inferring the emotions and intents simultaneously\nfor the current utterance. MC-EIU is enabling technology for many\nhuman-computer interfaces. However, there is a lack of available datasets in\nterms of annotation, modality, language diversity, and accessibility. In this\nwork, we propose an MC-EIU dataset, which features 7 emotion categories, 9\nintent categories, 3 modalities, i.e., textual, acoustic, and visual content,\nand two languages, i.e., English and Mandarin. Furthermore, it is completely\nopen-source for free access. To our knowledge, MC-EIU is the first\ncomprehensive and rich emotion and intent joint understanding dataset for\nmultimodal conversation. Together with the release of the dataset, we also\ndevelop an Emotion and Intent Interaction (EI$^2$) network as a reference\nsystem by modeling the deep correlation between emotion and intent in the\nmultimodal conversation. With comparative experiments and ablation studies, we\ndemonstrate the effectiveness of the proposed EI$^2$ method on the MC-EIU\ndataset. The dataset and codes will be made available at:\nhttps://github.com/MC-EIU/MC-EIU.", "paper_summary_zh": "多模態對話中的情緒與意圖聯合理解（MC-EIU）\n旨在解碼在多模態對話歷史中體現的語義資訊，同時推斷當前話語的情緒和意圖。MC-EIU 是許多人機介面的使能技術。然而，在標註、模態、語言多樣性和可及性方面缺乏可用的資料集。在這項工作中，我們提出一個 MC-EIU 資料集，其中包含 7 個情緒類別、9 個意圖類別、3 個模態，即文本、音訊和視覺內容，以及兩種語言，即英語和普通話。此外，它是完全開源且免費存取的。據我們所知，MC-EIU 是第一個針對多模態對話的情緒和意圖聯合理解的全面且豐富的資料集。隨著資料集的發布，我們還開發了一個情緒與意圖互動 (EI$^2$) 網路，作為參考系統，透過模擬多模態對話中情緒與意圖之間的深層關聯。透過比較實驗和消融研究，我們證明了所提出的 EI$^2$ 方法在 MC-EIU 資料集上的有效性。資料集和程式碼將在以下位置提供：\nhttps://github.com/MC-EIU/MC-EIU。", "author": "Rui Liu et.al.", "authors": "Rui Liu, Haolin Zuo, Zheng Lian, Xiaofen Xing, Björn W. Schuller, Haizhou Li", "id": "2407.02751v2", "paper_url": "http://arxiv.org/abs/2407.02751v2", "repo": "https://github.com/mc-eiu/mc-eiu"}}