{"2408.13147": {"publish_time": "2024-08-23", "title": "ShapeICP: Iterative Category-level Object Pose and Shape Estimation from Depth", "paper_summary": "Category-level object pose and shape estimation from a single depth image has\nrecently drawn research attention due to its wide applications in robotics and\nself-driving. The task is particularly challenging because the three unknowns,\nobject pose, object shape, and model-to-measurement correspondences, are\ncompounded together but only a single view of depth measurements is provided.\nThe vast majority of the prior work heavily relies on data-driven approaches to\nobtain solutions to at least one of the unknowns and typically two, running\nwith the risk of failing to generalize to unseen domains. The shape\nrepresentations used in the prior work also mainly focus on point cloud and\nsigned distance field (SDF). In stark contrast to the prior work, we approach\nthe problem using an iterative estimation method that does not require learning\nfrom any pose-annotated data. In addition, we adopt a novel mesh-based object\nactive shape model that has not been explored by the previous literature. Our\nalgorithm, named ShapeICP, has its foundation in the iterative closest point\n(ICP) algorithm but is equipped with additional features for the category-level\npose and shape estimation task. The results show that even without using any\npose-annotated data, ShapeICP surpasses many data-driven approaches that rely\non the pose data for training, opening up new solution space for researchers to\nconsider.", "paper_summary_zh": "<paragraph>從單一深度影像中進行類別層級的物體姿勢和形狀估計，最近因其在機器人和自動駕駛中的廣泛應用而引起研究關注。這項任務特別具有挑戰性，因為三個未知數（物體姿勢、物體形狀和模型到測量的對應關係）是結合在一起的，但只提供了一個深度測量的單一視圖。絕大多數先前的研究都嚴重依賴於資料驅動的方法來獲得至少一個未知數（通常是兩個）的解，這會冒著無法概括到未見領域的風險。先前研究中使用的形狀表示也主要集中在點雲和有號距離場 (SDF) 上。與先前的研究形成鮮明對比的是，我們使用一種迭代估計方法來解決這個問題，這種方法不需要從任何姿勢註解資料中學習。此外，我們採用了一種新的基於網格的物體主動形狀模型，這在先前的文獻中尚未被探索過。我們的演算法稱為 ShapeICP，其基礎是迭代最近點 (ICP) 演算法，但配備了類別層級姿勢和形狀估計任務的其他功能。結果表明，即使不使用任何姿勢註解資料，ShapeICP 也超越了許多依賴姿勢資料進行訓練的資料驅動方法，為研究人員提供了新的解決方案空間。</paragraph>", "author": "Yihao Zhang et.al.", "authors": "Yihao Zhang, John J. Leonard", "id": "2408.13147v1", "paper_url": "http://arxiv.org/abs/2408.13147v1", "repo": "null"}}