{"2412.17456": {"publish_time": "2024-12-23", "title": "Developmental Predictive Coding Model for Early Infancy Mono and Bilingual Vocal Continual Learning", "paper_summary": "Understanding how infants perceive speech sounds and language structures is\nstill an open problem. Previous research in artificial neural networks has\nmainly focused on large dataset-dependent generative models, aiming to\nreplicate language-related phenomena such as ''perceptual narrowing''. In this\npaper, we propose a novel approach using a small-sized generative neural\nnetwork equipped with a continual learning mechanism based on predictive coding\nfor mono-and bilingual speech sound learning (referred to as language sound\nacquisition during ''critical period'') and a compositional optimization\nmechanism for generation where no learning is involved (later infancy sound\nimitation). Our model prioritizes interpretability and demonstrates the\nadvantages of online learning: Unlike deep networks requiring substantial\noffline training, our model continuously updates with new data, making it\nadaptable and responsive to changing inputs. Through experiments, we\ndemonstrate that if second language acquisition occurs during later infancy,\nthe challenges associated with learning a foreign language after the critical\nperiod amplify, replicating the perceptual narrowing effect.", "paper_summary_zh": "了解婴儿如何感知语音和语言结构仍然是一个悬而未决的问题。先前的人工神经网络研究主要集中在大型数据集相关的生成模型上，旨在复制语言相关的现象，例如“感知狭窄”。在本文中，我们提出了一种新方法，使用配备了基于预测编码的持续学习机制的小型生成神经网络，用于单语和双语语音声音学习（称为“关键时期”期间的语言声音习得）和生成的组合优化机制，其中不涉及学习（后来的婴儿声音模仿）。我们的模型优先考虑可解释性，并展示了在线学习的优势：与需要大量离线训练的深度网络不同，我们的模型会不断更新新数据，使其适应并响应不断变化的输入。通过实验，我们证明，如果第二语言习得发生在婴儿后期，那么在关键时期之后学习外语相关的挑战会放大，复制感知狭窄效应。", "author": "Xiaodan Chen et.al.", "authors": "Xiaodan Chen, Alexandre Pitti, Mathias Quoy, Nancy F Chen", "id": "2412.17456v1", "paper_url": "http://arxiv.org/abs/2412.17456v1", "repo": "null"}}