{"2405.20233": {"publish_time": "2024-05-30", "title": "Grokfast: Accelerated Grokking by Amplifying Slow Gradients", "paper_summary": "One puzzling artifact in machine learning dubbed grokking is where delayed\ngeneralization is achieved tenfolds of iterations after near perfect\noverfitting to the training data. Focusing on the long delay itself on behalf\nof machine learning practitioners, our goal is to accelerate generalization of\na model under grokking phenomenon. By regarding a series of gradients of a\nparameter over training iterations as a random signal over time, we can\nspectrally decompose the parameter trajectories under gradient descent into two\ncomponents: the fast-varying, overfitting-yielding component and the\nslow-varying, generalization-inducing component. This analysis allows us to\naccelerate the grokking phenomenon more than $\\times 50$ with only a few lines\nof code that amplifies the slow-varying components of gradients. The\nexperiments show that our algorithm applies to diverse tasks involving images,\nlanguages, and graphs, enabling practical availability of this peculiar\nartifact of sudden generalization. Our code is available at\nhttps://github.com/ironjr/grokfast.", "paper_summary_zh": "在機器學習中，一個令人費解的人工製品被稱為「頓悟」，在近乎完美地過度擬合訓練資料後，延遲的泛化在反覆運算十倍後才得以實現。專注於機器學習從業者本身的長時間延遲，我們的目標是加速在頓悟現象下模型的泛化。透過將參數在訓練反覆運算中的一系列梯度視為隨時間變化的隨機訊號，我們可以將梯度下降下的參數軌跡分解為兩個組成部分：變化快速的過度擬合產生組成部分和變化緩慢的泛化誘發組成部分。這個分析讓我們能夠以僅僅幾行程式碼來加速頓悟現象超過 50 倍，這些程式碼會放大梯度的變化緩慢組成部分。實驗顯示我們的演算法適用於涉及影像、語言和圖形的各種任務，讓這個突然泛化的特殊人工製品得以實際使用。我們的程式碼可以在 https://github.com/ironjr/grokfast 取得。", "author": "Jaerin Lee et.al.", "authors": "Jaerin Lee, Bong Gyun Kang, Kihoon Kim, Kyoung Mu Lee", "id": "2405.20233v2", "paper_url": "http://arxiv.org/abs/2405.20233v2", "repo": "https://github.com/ironjr/grokfast"}}