{"2408.15185": {"publish_time": "2024-08-27", "title": "PoseWatch: A Transformer-based Architecture for Human-centric Video Anomaly Detection Using Spatio-temporal Pose Tokenization", "paper_summary": "Video Anomaly Detection (VAD) presents a significant challenge in computer\nvision, particularly due to the unpredictable and infrequent nature of\nanomalous events, coupled with the diverse and dynamic environments in which\nthey occur. Human-centric VAD, a specialized area within this domain, faces\nadditional complexities, including variations in human behavior, potential\nbiases in data, and substantial privacy concerns related to human subjects.\nThese issues complicate the development of models that are both robust and\ngeneralizable. To address these challenges, recent advancements have focused on\npose-based VAD, which leverages human pose as a high-level feature to mitigate\nprivacy concerns, reduce appearance biases, and minimize background\ninterference. In this paper, we introduce PoseWatch, a novel transformer-based\narchitecture designed specifically for human-centric pose-based VAD. PoseWatch\nfeatures an innovative Spatio-Temporal Pose and Relative Pose (ST-PRP)\ntokenization method that enhances the representation of human motion over time,\nwhich is also beneficial for broader human behavior analysis tasks. The\narchitecture's core, a Unified Encoder Twin Decoders (UETD) transformer,\nsignificantly improves the detection of anomalous behaviors in video data.\nExtensive evaluations across multiple benchmark datasets demonstrate that\nPoseWatch consistently outperforms existing methods, establishing a new\nstate-of-the-art in pose-based VAD. This work not only demonstrates the\nefficacy of PoseWatch but also highlights the potential of integrating Natural\nLanguage Processing techniques with computer vision to advance human behavior\nanalysis.", "paper_summary_zh": "影片異常偵測 (VAD) 在電腦視覺中是一項重大挑戰，特別是因為異常事件的不可預測性和不頻繁性，加上它們發生的環境多樣且動態。以人為中心的 VAD 是此領域中的專門領域，面臨額外的複雜性，包括人類行為的變化、資料中的潛在偏差，以及與人類受試者相關的重大隱私問題。這些問題使得開發既強健又可概化的模型變得複雜。為了應對這些挑戰，最近的進展專注於基於姿勢的 VAD，它利用人類姿勢作為高級特徵來減輕隱私問題、減少外觀偏差，並將背景干擾降至最低。在本文中，我們介紹 PoseWatch，這是一種新穎的基於Transformer的架構，專門設計用於以人為中心的基於姿勢的 VAD。PoseWatch 採用創新的時空姿勢和相對姿勢 (ST-PRP) 標記化方法，增強了人類動作隨時間的表示，這也有利於更廣泛的人類行為分析任務。該架構的核心，一個統一編碼器雙解碼器 (UETD) Transformer，顯著改善了影片資料中異常行為的偵測。跨多個基準資料集的廣泛評估證明，PoseWatch 持續優於現有方法，在基於姿勢的 VAD 中建立了新的技術水準。這項工作不僅證明了 PoseWatch 的效能，也突出了將自然語言處理技術與電腦視覺整合以推進人類行為分析的潛力。", "author": "Ghazal Alinezhad Noghre et.al.", "authors": "Ghazal Alinezhad Noghre, Armin Danesh Pazho, Hamed Tabkhi", "id": "2408.15185v1", "paper_url": "http://arxiv.org/abs/2408.15185v1", "repo": "null"}}