{"2406.18423": {"publish_time": "2024-06-26", "title": "Graph Neural Networks for Emulation of Finite-Element Ice Dynamics in Greenland and Antarctic Ice Sheets", "paper_summary": "Although numerical models provide accurate solutions for ice sheet dynamics\nbased on physics laws, they accompany intensified computational demands to\nsolve partial differential equations. In recent years, convolutional neural\nnetworks (CNNs) have been widely used as statistical emulators for those\nnumerical models. However, since CNNs operate on regular grids, they cannot\nrepresent the refined meshes and computational efficiency of finite-element\nnumerical models. Therefore, instead of CNNs, this study adopts an equivariant\ngraph convolutional network (EGCN) as an emulator for the ice sheet dynamics\nmodeling. EGCN reproduces ice thickness and velocity changes in the Helheim\nGlacier, Greenland, and Pine Island Glacier, Antarctica, with 260 times and 44\ntimes faster computation time, respectively. Compared to the traditional CNN\nand graph convolutional network, EGCN shows outstanding accuracy in thickness\nprediction near fast ice streams by preserving the equivariance to the\ntranslation and rotation of graphs.", "paper_summary_zh": "雖然數值模型根據物理定律為冰蓋動力學提供準確的解，但它們伴隨著強化運算需求來求解偏微分方程。近年來，卷積神經網路 (CNN) 已廣泛用作這些數值模型的統計模擬器。然而，由於 CNN 在規則網格上運作，它們無法表示有限元素數值模型的精緻網格和運算效率。因此，本研究採用等變圖形卷積網路 (EGCN) 作為冰蓋動力學建模的模擬器，而不是 CNN。EGCN 再現格陵蘭海爾海姆冰川和南極洲松島冰川的冰層厚度和速度變化，運算時間分別快了 260 倍和 44 倍。與傳統 CNN 和圖形卷積網路相比，EGCN 在快速冰流附近厚度預測中展現出傑出的準確性，方法是保持圖形的平移和旋轉等變性。", "author": "Younghyun Koo et.al.", "authors": "Younghyun Koo, Maryam Rahnemoonfar", "id": "2406.18423v1", "paper_url": "http://arxiv.org/abs/2406.18423v1", "repo": "null"}}