{"2410.12377": {"publish_time": "2024-10-16", "title": "HerO at AVeriTeC: The Herd of Open Large Language Models for Verifying Real-World Claims", "paper_summary": "To tackle the AVeriTeC shared task hosted by the FEVER-24, we introduce a\nsystem that only employs publicly available large language models (LLMs) for\neach step of automated fact-checking, dubbed the Herd of Open LLMs for\nverifying real-world claims (HerO). HerO employs multiple LLMs for each step of\nautomated fact-checking. For evidence retrieval, a language model is used to\nenhance a query by generating hypothetical fact-checking documents. We prompt\npretrained and fine-tuned LLMs for question generation and veracity prediction\nby crafting prompts with retrieved in-context samples. HerO achieved 2nd place\non the leaderboard with the AVeriTeC score of 0.57, suggesting the potential of\nopen LLMs for verifying real-world claims. For future research, we make our\ncode publicly available at https://github.com/ssu-humane/HerO.", "paper_summary_zh": "為了應對由 FEVER-24 主辦的 AVeriTeC 共享任務，我們引入了一個系統，它只在自動查證的每一步中採用公開可用的大型語言模型 (LLM)，並將其稱為用於驗證真實世界聲明的開放 LLM 群集 (HerO)。HerO 在自動查證的每一步中採用多個 LLM。對於證據檢索，語言模型用於通過生成假設性的查證文件來增強查詢。我們通過使用檢索到的上下文範本製作提示，提示預訓練和微調的 LLM 進行問題生成和真實性預測。HerO 在排行榜上獲得第 2 名，AVeriTeC 得分為 0.57，這表明開放式 LLM 在驗證真實世界聲明方面具有潛力。對於未來的研究，我們在 https://github.com/ssu-humane/HerO 上公開了我們的代碼。", "author": "Yejun Yoon et.al.", "authors": "Yejun Yoon, Jaeyoon Jung, Seunghyun Yoon, Kunwoo Park", "id": "2410.12377v1", "paper_url": "http://arxiv.org/abs/2410.12377v1", "repo": "null"}}