{"2411.04644": {"publish_time": "2024-11-07", "title": "wav2sleep: A Unified Multi-Modal Approach to Sleep Stage Classification from Physiological Signals", "paper_summary": "Accurate classification of sleep stages from less obtrusive sensor\nmeasurements such as the electrocardiogram (ECG) or photoplethysmogram (PPG)\ncould enable important applications in sleep medicine. Existing approaches to\nthis problem have typically used deep learning models designed and trained to\noperate on one or more specific input signals. However, the datasets used to\ndevelop these models often do not contain the same sets of input signals. Some\nsignals, particularly PPG, are much less prevalent than others, and this has\npreviously been addressed with techniques such as transfer learning.\nAdditionally, only training on one or more fixed modalities precludes\ncross-modal information transfer from other sources, which has proved valuable\nin other problem domains. To address this, we introduce wav2sleep, a unified\nmodel designed to operate on variable sets of input signals during training and\ninference. After jointly training on over 10,000 overnight recordings from six\npublicly available polysomnography datasets, including SHHS and MESA, wav2sleep\noutperforms existing sleep stage classification models across test-time input\ncombinations including ECG, PPG, and respiratory signals.", "paper_summary_zh": "透過較不具侵入性的感測器量測，例如心電圖 (ECG) 或光電容積描記儀 (PPG)，準確分類睡眠階段，能應用於睡眠醫學中。現有的方法通常使用深度學習模型，設計和訓練這些模型以處理一個或多個特定輸入訊號。然而，用於開發這些模型的資料集通常不包含相同的輸入訊號組。有些訊號，特別是 PPG，遠比其他訊號不普遍，而這先前已透過轉移學習等技術來解決。此外，僅訓練一種或多種固定模式會排除來自其他來源的跨模式資訊傳輸，這已證明在其他問題領域中很有價值。為了解決這個問題，我們引入了 wav2sleep，這是一個統一的模型，設計用於在訓練和推論期間處理變數組的輸入訊號。在對來自六個公開可用的多重睡眠生理檢查資料集（包括 SHHS 和 MESA）的 10,000 多個過夜記錄進行聯合訓練後，wav2sleep 在測試時間輸入組合（包括 ECG、PPG 和呼吸訊號）中優於現有的睡眠階段分類模型。", "author": "Jonathan F. Carter et.al.", "authors": "Jonathan F. Carter, Lionel Tarassenko", "id": "2411.04644v1", "paper_url": "http://arxiv.org/abs/2411.04644v1", "repo": "null"}}