{"2502.21309": {"publish_time": "2025-02-28", "title": "FANformer: Improving Large Language Models Through Effective Periodicity Modeling", "paper_summary": "Periodicity, as one of the most important basic characteristics, lays the\nfoundation for facilitating structured knowledge acquisition and systematic\ncognitive processes within human learning paradigms. However, the potential\nflaws of periodicity modeling in Transformer affect the learning efficiency and\nestablishment of underlying principles from data for large language models\n(LLMs) built upon it. In this paper, we demonstrate that integrating effective\nperiodicity modeling can improve the learning efficiency and performance of\nLLMs. We introduce FANformer, which integrates Fourier Analysis Network (FAN)\ninto attention mechanism to achieve efficient periodicity modeling, by\nmodifying the feature projection process of attention mechanism. Extensive\nexperimental results on language modeling show that FANformer consistently\noutperforms Transformer when scaling up model size and training tokens,\nunderscoring its superior learning efficiency. To further validate the\neffectiveness of FANformer, we pretrain a FANformer-1B on 1 trillion tokens.\nFANformer-1B exhibits marked improvements on downstream tasks compared to\nopen-source LLMs with similar model parameters or training tokens. The results\nposition FANformer as an effective and promising architecture for advancing\nLLMs.", "paper_summary_zh": "<paragraph>週期性作為最重要的基本特徵之一，為人類學習範式中的結構化知識獲取和系統認知過程奠定了基礎。然而，Transformer 中週期性建模的潛在缺陷會影響大型語言模型 (LLM) 的學習效率和從數據中建立基本原則的能力。在本文中，我們證明了整合有效的週期性建模可以提高 LLM 的學習效率和性能。我們引入了 FANformer，它將傅立葉分析網絡 (FAN) 整合到注意力機制中，通過修改注意力機制的特徵投影過程來實現高效的週期性建模。大量的語言建模實驗結果表明，當擴展模型大小和訓練token時，FANformer 的表現一直優於 Transformer，突顯了其卓越的學習效率。為了進一步驗證 FANformer 的有效性，我們在 1 兆個token上預訓練了一個 FANformer-1B 模型。與具有相似模型參數或訓練token的開源 LLM 相比，FANformer-1B 在下游任務中表現出顯著的改進。這些結果表明，FANformer 是一種有效且有前景的架構，可以推進 LLM 的發展。</paragraph>\n", "author": "Yihong Dong et.al.", "authors": "Yihong Dong, Ge Li, Xue Jiang, Yongding Tao, Kechi Zhang, Hao Zhu, Huanyu Liu, Jiazheng Ding, Jia Li, Jinliang Deng, Hong Mei", "id": "2502.21309v1", "paper_url": "http://arxiv.org/abs/2502.21309v1", "repo": "null"}}