{"2410.02492": {"publish_time": "2024-10-03", "title": "DTVLT: A Multi-modal Diverse Text Benchmark for Visual Language Tracking Based on LLM", "paper_summary": "Visual language tracking (VLT) has emerged as a cutting-edge research area,\nharnessing linguistic data to enhance algorithms with multi-modal inputs and\nbroadening the scope of traditional single object tracking (SOT) to encompass\nvideo understanding applications. Despite this, most VLT benchmarks still\ndepend on succinct, human-annotated text descriptions for each video. These\ndescriptions often fall short in capturing the nuances of video content\ndynamics and lack stylistic variety in language, constrained by their uniform\nlevel of detail and a fixed annotation frequency. As a result, algorithms tend\nto default to a \"memorize the answer\" strategy, diverging from the core\nobjective of achieving a deeper understanding of video content. Fortunately,\nthe emergence of large language models (LLMs) has enabled the generation of\ndiverse text. This work utilizes LLMs to generate varied semantic annotations\n(in terms of text lengths and granularities) for representative SOT benchmarks,\nthereby establishing a novel multi-modal benchmark. Specifically, we (1)\npropose a new visual language tracking benchmark with diverse texts, named\nDTVLT, based on five prominent VLT and SOT benchmarks, including three\nsub-tasks: short-term tracking, long-term tracking, and global instance\ntracking. (2) We offer four granularity texts in our benchmark, considering the\nextent and density of semantic information. We expect this multi-granular\ngeneration strategy to foster a favorable environment for VLT and video\nunderstanding research. (3) We conduct comprehensive experimental analyses on\nDTVLT, evaluating the impact of diverse text on tracking performance and hope\nthe identified performance bottlenecks of existing algorithms can support\nfurther research in VLT and video understanding. The proposed benchmark,\nexperimental results and toolkit will be released gradually on\nhttp://videocube.aitestunion.com/.", "paper_summary_zh": "視覺語言追蹤 (VLT) 已成為尖端的的研究領域，\n利用語言資料來增強帶有多模式輸入的演算法，並擴展傳統單一物件追蹤 (SOT) 的範圍，以涵蓋影片理解應用。儘管如此，大多數 VLT 評量基準仍然依賴每個影片的簡潔、人工標註的文字描述。這些描述通常無法捕捉影片內容動態的細微差別，且缺乏語言風格的多樣性，受到其均勻的詳細程度和固定的標註頻率所限制。因此，演算法傾向於預設為「記住答案」策略，偏離了深入理解影片內容的核心目標。幸運的是，大型語言模型 (LLM) 的出現使得能夠產生多樣化的文字。這項工作利用 LLM 為具代表性的 SOT 評量基準產生多樣的語義標註（就文字長度和粒度而言），從而建立一個新穎的多模式評量基準。具體來說，我們 (1) 提出一個新的具有多樣化文字的視覺語言追蹤評量基準，稱為 DTVLT，基於五個著名的 VLT 和 SOT 評量基準，包括三個子任務：短期追蹤、長期追蹤和全局實例追蹤。(2) 我們在評量基準中提供了四個粒度文字，考慮了語義資訊的範圍和密度。我們預期這種多粒度生成策略將為 VLT 和影片理解研究營造一個有利的環境。(3) 我們對 DTVLT 進行了全面的實驗分析，評估了多樣化文字對追蹤效能的影響，並希望現有演算法識別出的效能瓶頸能夠支持 VLT 和影片理解的進一步研究。建議的評量基準、實驗結果和工具包將逐步在 http://videocube.aitestunion.com/ 上發布。", "author": "Xuchen Li et.al.", "authors": "Xuchen Li, Shiyu Hu, Xiaokun Feng, Dailing Zhang, Meiqi Wu, Jing Zhang, Kaiqi Huang", "id": "2410.02492v1", "paper_url": "http://arxiv.org/abs/2410.02492v1", "repo": "null"}}