{"2407.16431": {"publish_time": "2024-07-23", "title": "FairFlow: An Automated Approach to Model-based Counterfactual Data Augmentation For NLP", "paper_summary": "Despite the evolution of language models, they continue to portray harmful\nsocietal biases and stereotypes inadvertently learned from training data. These\ninherent biases often result in detrimental effects in various applications.\nCounterfactual Data Augmentation (CDA), which seeks to balance demographic\nattributes in training data, has been a widely adopted approach to mitigate\nbias in natural language processing. However, many existing CDA approaches rely\non word substitution techniques using manually compiled word-pair dictionaries.\nThese techniques often lead to out-of-context substitutions, resulting in\npotential quality issues. The advancement of model-based techniques, on the\nother hand, has been challenged by the need for parallel training data. Works\nin this area resort to manually generated parallel data that are expensive to\ncollect and are consequently limited in scale. This paper proposes FairFlow, an\nautomated approach to generating parallel data for training counterfactual text\ngenerator models that limits the need for human intervention. Furthermore, we\nshow that FairFlow significantly overcomes the limitations of dictionary-based\nword-substitution approaches whilst maintaining good performance.", "paper_summary_zh": "儘管語言模型不斷演進，它們仍會在無意間從訓練資料中習得有害的社會偏見和刻板印象。這些內在偏見通常會對各種應用程式造成不利影響。反事實資料擴充（CDA）旨在平衡訓練資料中的人口屬性，一直是廣泛採用的方法，用於減輕自然語言處理中的偏見。然而，許多現有的 CDA 方法依賴於使用手動編譯的字詞對字典進行字詞替換技術。這些技術通常會導致語境外替換，造成潛在的品質問題。另一方面，基於模型的技術進步受到平行訓練資料需求的挑戰。此領域的工作訴諸於手動產生的平行資料，而這些資料的收集成本高昂，因此規模有限。本文提出 FairFlow，一種自動化方法，用於產生平行資料，以訓練反事實文字產生器模型，並減少對人工介入的需求。此外，我們證明 FairFlow 明顯克服了基於字典的字詞替換方法的限制，同時維持良好的效能。", "author": "Ewoenam Kwaku Tokpo et.al.", "authors": "Ewoenam Kwaku Tokpo, Toon Calders", "id": "2407.16431v1", "paper_url": "http://arxiv.org/abs/2407.16431v1", "repo": "null"}}