{"2502.11678": {"publish_time": "2025-02-17", "title": "Exploring LLM-based Student Simulation for Metacognitive Cultivation", "paper_summary": "Metacognitive education plays a crucial role in cultivating students'\nself-regulation and reflective thinking, providing essential support for those\nwith learning difficulties through academic advising. Simulating students with\ninsufficient learning capabilities using large language models offers a\npromising approach to refining pedagogical methods without ethical concerns.\nHowever, existing simulations often fail to authentically represent students'\nlearning struggles and face challenges in evaluation due to the lack of\nreliable metrics and ethical constraints in data collection. To address these\nissues, we propose a pipeline for automatically generating and filtering\nhigh-quality simulated student agents. Our approach leverages a two-round\nautomated scoring system validated by human experts and employs a score\npropagation module to obtain more consistent scores across the student graph.\nExperimental results demonstrate that our pipeline efficiently identifies\nhigh-quality student agents, and we discuss the traits that influence the\nsimulation's effectiveness. By simulating students with varying degrees of\nlearning difficulties, our work paves the way for broader applications in\npersonalized learning and educational assessment.", "paper_summary_zh": "元認知教育在培養學生的自我調節和反思性思考中發揮著至關重要的作用，通過學術諮詢為有學習困難的人提供必要的支持。使用大型語言模型模擬學習能力不足的學生提供了一種有前途的方法，可以在沒有道德問題的情況下改進教學方法。然而，現有的模擬通常無法真實地反映學生的學習困難，並且由於缺乏可靠的指標和數據收集中的道德約束，在評估中面臨挑戰。為了解決這些問題，我們提出了一個自動生成和過濾高質量模擬學生代理的管道。我們的做法利用了由人類專家驗證的兩輪自動評分系統，並採用分數傳播模組來獲得跨學生圖表更一致的分數。實驗結果表明，我們的管道有效地識別了高質量的學生代理，並且我們討論了影響模擬效果的特質。通過模擬具有不同程度學習困難的學生，我們的研究為個性化學習和教育評估中的更廣泛應用鋪平了道路。", "author": "Haoxuan Li et.al.", "authors": "Haoxuan Li, Jifan Yu, Xin Cong, Yang Dang, Yisi Zhan, Huiqin Liu, Zhiyuan Liu", "id": "2502.11678v1", "paper_url": "http://arxiv.org/abs/2502.11678v1", "repo": "null"}}