{"2410.00049": {"publish_time": "2024-09-28", "title": "Epidemiology-Aware Neural ODE with Continuous Disease Transmission Graph", "paper_summary": "Effective epidemic forecasting is critical for public health strategies and\nefficient medical resource allocation, especially in the face of rapidly\nspreading infectious diseases. However, existing deep-learning methods often\noverlook the dynamic nature of epidemics and fail to account for the specific\nmechanisms of disease transmission. In response to these challenges, we\nintroduce an innovative end-to-end framework called Epidemiology-Aware Neural\nODE with Continuous Disease Transmission Graph (EARTH) in this paper. To learn\ncontinuous and regional disease transmission patterns, we first propose EANO,\nwhich seamlessly integrates the neural ODE approach with the epidemic\nmechanism, considering the complex spatial spread process during epidemic\nevolution. Additionally, we introduce GLTG to model global infection trends and\nleverage these signals to guide local transmission dynamically. To accommodate\nboth the global coherence of epidemic trends and the local nuances of epidemic\ntransmission patterns, we build a cross-attention approach to fuse the most\nmeaningful information for forecasting. Through the smooth synergy of both\ncomponents, EARTH offers a more robust and flexible approach to understanding\nand predicting the spread of infectious diseases. Extensive experiments show\nEARTH superior performance in forecasting real-world epidemics compared to\nstate-of-the-art methods. The code will be available at\nhttps://github.com/Emory-Melody/EpiLearn.", "paper_summary_zh": "<paragraph>有效的疫情预测对于公共卫生策略和高效的医疗资源分配至关重要，尤其是在快速传播的传染病面前。然而，现有的深度学习方法常常忽视疫情的动态特性，并且无法解释疾病传播的具体机制。为了应对这些挑战，我们在本文中介绍了一个创新的端到端框架，称为具有连续疾病传播图的流行病感知神经 ODE（EARTH）。为了学习连续的区域性疾病传播模式，我们首先提出了 EANO，它将神经 ODE 方法与流行病机制无缝集成，考虑了流行病演变过程中的复杂空间传播过程。此外，我们引入了 GLTG 来建模全球感染趋势，并利用这些信号动态地指导局部传播。为了适应流行病趋势的全局一致性和流行病传播模式的局部细微差别，我们构建了一种交叉注意方法来融合最有意义的预测信息。通过这两个组件的平稳协同作用，EARTH 为理解和预测传染病的传播提供了一种更稳健、更灵活的方法。大量的实验表明，与最先进的方法相比，EARTH 在预测现实世界的流行病方面具有卓越的性能。代码将在 https://github.com/Emory-Melody/EpiLearn 上提供。</paragraph>", "author": "Guancheng Wan et.al.", "authors": "Guancheng Wan, Zewen Liu, Max S. Y. Lau, B. Aditya Prakash, Wei Jin", "id": "2410.00049v1", "paper_url": "http://arxiv.org/abs/2410.00049v1", "repo": "null"}}