{"2409.15724": {"publish_time": "2024-09-24", "title": "LLM-Cure: LLM-based Competitor User Review Analysis for Feature Enhancement", "paper_summary": "The exponential growth of the mobile app market underscores the importance of\nconstant innovation and rapid response to user demands. As user satisfaction is\nparamount to the success of a mobile application (app), developers typically\nrely on user reviews, which represent user feedback that includes ratings and\ncomments to identify areas for improvement. However, the sheer volume of user\nreviews poses challenges in manual analysis, necessitating automated\napproaches. Existing automated approaches either analyze only the target apps\nreviews, neglecting the comparison of similar features to competitors or fail\nto provide suggestions for feature enhancement. To address these gaps, we\npropose a Large Language Model (LLM)-based Competitive User Review Analysis for\nFeature Enhancement) (LLM-Cure), an approach powered by LLMs to automatically\ngenerate suggestion s for mobile app feature improvements. More specifically,\nLLM-Cure identifies and categorizes features within reviews by applying LLMs.\nWhen provided with a complaint in a user review, LLM-Cure curates highly rated\n(4 and 5 stars) reviews in competing apps related to the complaint and proposes\npotential improvements tailored to the target application. We evaluate LLM-Cure\non 1,056,739 reviews of 70 popular Android apps. Our evaluation demonstrates\nthat LLM-Cure significantly outperforms the state-of-the-art approaches in\nassigning features to reviews by up to 13% in F1-score, up to 16% in recall and\nup to 11% in precision. Additionally, LLM-Cure demonstrates its capability to\nprovide suggestions for resolving user complaints. We verify the suggestions\nusing the release notes that reflect the changes of features in the target\nmobile app. LLM-Cure achieves a promising average of 73% of the implementation\nof the provided suggestions.", "paper_summary_zh": "行動應用程式市場的指數型成長，突顯了持續創新和快速回應使用者需求的重要性。由於使用者滿意度對於行動應用程式 (app) 的成功至關重要，開發人員通常依賴使用者評論，其中包括評分和評論，以找出需要改進的地方。然而，龐大的使用者評論量對手動分析構成挑戰，因此需要自動化方法。現有的自動化方法只分析目標應用程式的評論，忽略了與競爭對手的類似功能比較，或無法提供功能增強建議。為了解決這些差距，我們提出了一個基於大型語言模型 (LLM) 的競爭性使用者評論分析，用於功能增強 (LLM-Cure)，一種由 LLM 驅動的方法，可自動產生針對行動應用程式功能改進的建議。更具體地說，LLM-Cure 透過應用 LLM 來識別和分類評論中的功能。當使用者評論中出現抱怨時，LLM-Cure 會整理與抱怨相關的競爭應用程式中評分很高的 (4 和 5 星) 評論，並提出針對目標應用程式量身打造的潛在改進建議。我們在 70 個熱門 Android 應用程式的 1,056,739 則評論上評估 LLM-Cure。我們的評估顯示，LLM-Cure 在將功能分配給評論方面明顯優於最先進的方法，F1 分數提高了 13%，召回率提高了 16%，準確率提高了 11%。此外，LLM-Cure 展示了其提供解決使用者抱怨建議的能力。我們使用反映目標行動應用程式中功能變更的版本說明來驗證這些建議。LLM-Cure 達到了令人滿意的平均 73% 的所提供建議的實施率。", "author": "Maram Assi et.al.", "authors": "Maram Assi, Safwat Hassan, Ying Zou", "id": "2409.15724v1", "paper_url": "http://arxiv.org/abs/2409.15724v1", "repo": "null"}}