{"2405.06414": {"publish_time": "2024-05-10", "title": "Can Large Language Models Replicate ITS Feedback on Open-Ended Math Questions?", "paper_summary": "Intelligent Tutoring Systems (ITSs) often contain an automated feedback\ncomponent, which provides a predefined feedback message to students when they\ndetect a predefined error. To such a feedback component, we often resort to\ntemplate-based approaches. These approaches require significant effort from\nhuman experts to detect a limited number of possible student errors and provide\ncorresponding feedback. This limitation is exemplified in open-ended math\nquestions, where there can be a large number of different incorrect errors. In\nour work, we examine the capabilities of large language models (LLMs) to\ngenerate feedback for open-ended math questions, similar to that of an\nestablished ITS that uses a template-based approach. We fine-tune both\nopen-source and proprietary LLMs on real student responses and corresponding\nITS-provided feedback. We measure the quality of the generated feedback using\ntext similarity metrics. We find that open-source and proprietary models both\nshow promise in replicating the feedback they see during training, but do not\ngeneralize well to previously unseen student errors. These results suggest that\ndespite being able to learn the formatting of feedback, LLMs are not able to\nfully understand mathematical errors made by students.", "paper_summary_zh": "智能教學系統 (ITS) 通常包含一個自動化回饋組件，當偵測到預先定義的錯誤時，會向學生提供預先定義的回饋訊息。對於這樣的回饋組件，我們通常會採用基於範本的方法。這些方法需要人類專家付出大量的精力來偵測有限數量的可能的學生錯誤，並提供相應的回饋。這種限制在開放式數學問題中得到體現，在開放式數學問題中可能存在大量不同的錯誤。在我們的研究中，我們檢視了大型語言模型 (LLM) 為開放式數學問題產生回饋的能力，類似於使用基於範本方法的既有 ITS。我們對開源和專有 LLM 進行微調，並使用真實學生的回應和相應的 ITS 提供的回饋。我們使用文字相似度量度量產生的回饋的品質。我們發現開源和專有模型在複製訓練期間看到的回饋方面都顯示出前景，但無法很好地推廣到以前未見過的學生錯誤。這些結果表明，儘管能夠學習回饋的格式，但 LLM 無法完全理解學生所犯的數學錯誤。", "author": "Hunter McNichols et.al.", "authors": "Hunter McNichols, Jaewook Lee, Stephen Fancsali, Steve Ritter, Andrew Lan", "id": "2405.06414v1", "paper_url": "http://arxiv.org/abs/2405.06414v1", "repo": "null"}}