{"2410.03062": {"publish_time": "2024-10-04", "title": "Image First or Text First? Optimising the Sequencing of Modalities in Large Language Model Prompting and Reasoning Tasks", "paper_summary": "This paper examines how the sequencing of images and text within multi-modal\nprompts influences the reasoning performance of large language models (LLMs).\nWe performed empirical evaluations using three commercial LLMs. Our results\ndemonstrate that the order in which modalities are presented can significantly\naffect performance, particularly in tasks of varying complexity. For simpler\ntasks involving a single image, modality sequencing had a clear impact on\naccuracy. However, in more complex tasks involving multiple images and\nintricate reasoning steps, the effect of sequencing diminished, likely due to\nthe increased cognitive demands of the task. Our findings also highlight the\nimportance of question/prompt structure. In nested and multi-step reasoning\ntasks, modality sequencing played a key role in shaping model performance.\nWhile LLMs excelled in the initial stages of reasoning, they struggled to\nre-incorporate earlier information, underscoring the challenges of multi-hop\nreasoning within transformer architectures. This suggests that aligning the\nsequence of modalities with the logical flow of reasoning steps is more\ncritical than modality order alone. These insights offer valuable implications\nfor improving multi-modal prompt design, with broader applications across\nfields such as education, medical imaging, and cross-modal learning.", "paper_summary_zh": "本文探討在多模態提示中影像和文字的順序如何影響大型語言模型 (LLM) 的推理表現。我們使用三個商用 LLM 進行實證評估。我們的結果表明，模態呈現的順序會顯著影響表現，特別是在不同複雜度任務中。對於涉及單一影像的較簡單任務，模態順序對準確度有明顯影響。然而，在涉及多個影像和複雜推理步驟的較複雜任務中，順序的影響減弱，這可能是由於任務的認知需求增加。我們的發現也突顯了問題/提示結構的重要性。在嵌套和多步驟推理任務中，模態順序在塑造模型表現中扮演關鍵角色。雖然 LLM 在推理的初始階段表現出色，但它們難以重新整合早期的資訊，這凸顯了Transformer架構中多跳推理的挑戰。這表明將模態順序與推理步驟的邏輯流程對齊比單獨的模態順序更為重要。這些見解為改善多模態提示設計提供了寶貴的啟示，並在教育、醫學影像和跨模態學習等領域有更廣泛的應用。", "author": "Grant Wardle et.al.", "authors": "Grant Wardle, Teo Susnjak", "id": "2410.03062v1", "paper_url": "http://arxiv.org/abs/2410.03062v1", "repo": "null"}}