{"2411.15778": {"publish_time": "2024-11-24", "title": "Enhancing the automatic segmentation and analysis of 3D liver vasculature models", "paper_summary": "Surgical assessment of liver cancer patients requires identification of the\nvessel trees from medical images. Specifically, the venous trees - the portal\n(perfusing) and the hepatic (draining) trees are important for understanding\nthe liver anatomy and disease state, and perform surgery planning. This\nresearch aims to improve the 3D segmentation, skeletonization, and subsequent\nanalysis of vessel trees, by creating an automatic pipeline based on deep\nlearning and image processing techniques.\n  The first part of this work explores the impact of differentiable\nskeletonization methods such as ClDice and morphological skeletonization loss,\non the overall liver vessel segmentation performance. To this aim, it studies\nhow to improve vessel tree connectivity.\n  The second part of this study converts a single class vessel segmentation\ninto multi-class ones, separating the two venous trees. It builds on the\nprevious two-class vessel segmentation model, which vessel tree outputs might\nbe entangled, and on connected components and skeleton analyses of the trees.\n  After providing sub-labeling of the specific anatomical branches of each\nvenous tree, these algorithms also enable a morphometric analysis of the vessel\ntrees by extracting various geometrical markers.\n  In conclusion, we propose a method that successfully improves current\nskeletonization methods, for extensive vascular trees that contain vessels of\ndifferent calibers. The separation algorithm creates a clean multi-class\nsegmentation of the vessels, validated by surgeons to provide low error. A new,\npublicly shared high-quality liver vessel dataset of 77 cases is thus created.\nFinally a method to annotate vessel trees according to anatomy is provided,\nenabling a unique liver vessel morphometry analysis.", "paper_summary_zh": "<paragraph>肝癌患者的手術評估需要從醫學影像中辨識血管樹。具體來說，靜脈樹 - 門靜脈（灌注）和肝靜脈（引流）樹對於了解肝臟解剖和疾病狀態以及執行手術規劃非常重要。本研究旨在通過建立基於深度學習和影像處理技術的自動化管道，改善血管樹的 3D 分割、骨架化和後續分析。\n本工作的**第一部分**探討了可微分骨架化方法（例如 ClDice 和形態骨架化損失）對整體肝臟血管分割性能的影響。為此，它研究了如何改善血管樹連通性。\n本研究的**第二部分**將單類別血管分割轉換為多類別血管分割，將兩棵靜脈樹分開。它建立在先前的兩類別血管分割模型之上，血管樹輸出可能糾纏在一起，並建立在樹的連接組成和骨架分析之上。\n在對每個靜脈樹的特定解剖分支進行子標記後，這些算法還可以通過提取各種幾何標記對血管樹進行形態測量分析。\n總之，我們提出了一種方法，可以成功改進當前的骨架化方法，適用於包含不同口徑血管的廣泛血管樹。分離算法創建了一個乾淨的多類別血管分割，經外科醫生驗證可提供低誤差。由此創建了一個新的、公開共享的 77 例高品質肝臟血管數據集。最後，提供了一種根據解剖標記血管樹的方法，能夠進行獨特的肝臟血管形態測量分析。</paragraph>", "author": "Yassine Machta et.al.", "authors": "Yassine Machta, Omar Ali, Kevin Hakkakian, Ana Vlasceanu, Amaury Facque, Nicolas Golse, Irene Vignon-Clementel", "id": "2411.15778v2", "paper_url": "http://arxiv.org/abs/2411.15778v2", "repo": "null"}}