{"2406.02886": {"publish_time": "2024-06-05", "title": "PLaD: Preference-based Large Language Model Distillation with Pseudo-Preference Pairs", "paper_summary": "Large Language Models (LLMs) have exhibited impressive capabilities in\nvarious tasks, yet their vast parameter sizes restrict their applicability in\nresource-constrained settings. Knowledge distillation (KD) offers a viable\nsolution by transferring expertise from large teacher models to compact student\nmodels. However, traditional KD techniques face specific challenges when\napplied to LLMs, including restricted access to LLM outputs, significant\nteacher-student capacity gaps, and the inherited mis-calibration issue. In this\nwork, we present PLaD, a novel preference-based LLM distillation framework.\nPLaD exploits the teacher-student capacity discrepancy to generate\npseudo-preference pairs where teacher outputs are preferred over student\noutputs. Then, PLaD leverages a ranking loss to re-calibrate student's\nestimation of sequence likelihood, which steers the student's focus towards\nunderstanding the relative quality of outputs instead of simply imitating the\nteacher. PLaD bypasses the need for access to teacher LLM's internal states,\ntackles the student's expressivity limitations, and mitigates the student\nmis-calibration issue. Through extensive experiments on two sequence generation\ntasks and with various LLMs, we demonstrate the effectiveness of our proposed\nPLaD framework.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種任務中展現出令人印象深刻的能力，但其龐大的參數規模限制了它們在資源受限環境中的適用性。知識蒸餾 (KD) 提供了一種可行的解決方案，通過將大型教師模型的專業知識轉移到精簡的學生模型中。然而，當應用於 LLM 時，傳統的 KD 技術會面臨具體挑戰，包括對 LLM 輸出的訪問受限、教師和學生之間的容量差距顯著以及繼承的錯誤校準問題。在這項工作中，我們提出了 PLaD，這是一個新穎的基於偏好的 LLM 蒸餾框架。PLaD 利用教師和學生之間的容量差異來生成偽偏好對，其中教師輸出優於學生輸出。然後，PLaD 利用排名損失來重新校準學生對序列似然的估計，這將學生的注意力引導到理解輸出的相對品質，而不是簡單地模仿教師。PLaD 避開了訪問教師 LLM 內部狀態的需求，解決了學生的表達能力限制，並減輕了學生的錯誤校準問題。通過在兩個序列生成任務上進行廣泛的實驗，並使用各種 LLM，我們證明了我們提出的 PLaD 框架的有效性。", "author": "Rongzhi Zhang et.al.", "authors": "Rongzhi Zhang, Jiaming Shen, Tianqi Liu, Haorui Wang, Zhen Qin, Feng Han, Jialu Liu, Simon Baumgartner, Michael Bendersky, Chao Zhang", "id": "2406.02886v2", "paper_url": "http://arxiv.org/abs/2406.02886v2", "repo": "null"}}