{"2405.04872": {"publish_time": "2024-05-08", "title": "Logical Negation Augmenting and Debiasing for Prompt-based Methods", "paper_summary": "Prompt-based methods have gained increasing attention on NLP and shown\nvalidity on many downstream tasks. Many works have focused on mining these\nmethods' potential for knowledge extraction, but few explore their ability to\nmake logical reasoning. In this work, we focus on the effectiveness of the\nprompt-based methods on first-order logical reasoning and find that the\nbottleneck lies in logical negation. Based on our analysis, logical negation\ntends to result in spurious correlations to negative answers, while\npropositions without logical negation correlate to positive answers. To solve\nthe problem, we propose a simple but effective method, Negation Augmenting and\nNegation Debiasing (NAND), which introduces negative propositions to\nprompt-based methods without updating parameters. Specifically, these negative\npropositions can counteract spurious correlations by providing \"not\" for all\ninstances so that models cannot make decisions only by whether expressions\ncontain a logical negation. Experiments on three datasets show that NAND not\nonly solves the problem of calibrating logical negation but also significantly\nenhances prompt-based methods of logical reasoning without model retraining.", "paper_summary_zh": "基於提示的方法在 NLP 上獲得越來越多的關注，並在許多下游任務中展現其有效性。許多研究專注於探討這些方法在知識萃取方面的潛力，但鮮少探討它們進行邏輯推理的能力。在這項研究中，我們專注於基於提示的方法在第一階邏輯推理上的有效性，並發現瓶頸在於邏輯否定。根據我們的分析，邏輯否定傾向於導致與否定答案的虛假相關，而沒有邏輯否定的命題則與肯定答案相關。為了解決這個問題，我們提出一個簡單但有效的方法，否定增強和否定去偏 (NAND)，它在不更新參數的情況下，將否定命題引入基於提示的方法。具體來說，這些否定命題可以透過為所有實例提供「非」，來抵消虛假相關，讓模型無法僅透過表達式是否包含邏輯否定來做出決策。在三個資料集上的實驗顯示，NAND 不僅解決了校準邏輯否定的問題，還顯著增強了基於提示的邏輯推理方法，而無需重新訓練模型。", "author": "Yitian Li et.al.", "authors": "Yitian Li, Jidong Tian, Hao He, Yaohui Jin", "id": "2405.04872v1", "paper_url": "http://arxiv.org/abs/2405.04872v1", "repo": "null"}}