{"2412.15060": {"publish_time": "2024-12-19", "title": "ConfliBERT: A Language Model for Political Conflict", "paper_summary": "Conflict scholars have used rule-based approaches to extract information\nabout political violence from news reports and texts. Recent Natural Language\nProcessing developments move beyond rigid rule-based approaches. We review our\nrecent ConfliBERT language model (Hu et al. 2022) to process political and\nviolence related texts. The model can be used to extract actor and action\nclassifications from texts about political conflict. When fine-tuned, results\nshow that ConfliBERT has superior performance in accuracy, precision and recall\nover other large language models (LLM) like Google's Gemma 2 (9B), Meta's Llama\n3.1 (7B), and Alibaba's Qwen 2.5 (14B) within its relevant domains. It is also\nhundreds of times faster than these more generalist LLMs. These results are\nillustrated using texts from the BBC, re3d, and the Global Terrorism Dataset\n(GTD).", "paper_summary_zh": "衝突學者已使用基於規則的方法從新聞報導和文字中擷取有關政治暴力的資訊。最近的自然語言處理發展已超越僵化的基於規則的方法。我們檢視我們最近的 ConfliBERT 語言模型 (Hu et al. 2022) 以處理政治和暴力相關文字。該模型可 used to extract actor and action classifications from texts about political conflict.微調後，結果顯示 ConfliBERT 在其相關領域中，在準確度、精確度和召回率方面都優於其他大型語言模型 (LLM)，例如 Google 的 Gemma 2 (9B)、Meta 的 Llama 3.1 (7B) 和阿里巴巴的 Qwen 2.5 (14B)。它也比這些更通用的 LLM 快上數百倍。這些結果使用來自 BBC、re3d 和全球恐怖主義資料集 (GTD) 的文字說明。", "author": "Patrick T. Brandt et.al.", "authors": "Patrick T. Brandt, Sultan Alsarra, Vito J. D`Orazio, Dagmar Heintze, Latifur Khan, Shreyas Meher, Javier Osorio, Marcus Sianan", "id": "2412.15060v1", "paper_url": "http://arxiv.org/abs/2412.15060v1", "repo": "https://github.com/eventdata/conflibert"}}