{"2502.12896": {"publish_time": "2025-02-18", "title": "None of the Others: a General Technique to Distinguish Reasoning from Memorization in Multiple-Choice LLM Evaluation Benchmarks", "paper_summary": "In LLM evaluations, reasoning is often distinguished from recall/memorization\nby performing numerical variations to math-oriented questions. Here we\nintroduce a general variation method for multiple-choice questions that\ncompletely dissociates the correct answer from previously seen tokens or\nconcepts, requiring LLMs to understand and reason (rather than memorizing) in\norder to answer correctly. Using this method, we evaluate state-of-the-art\nproprietary and open-source LLMs on two datasets available in English and\nSpanish: the public MMLU benchmark and the private UNED-Access 2024 dataset.\nResults show that all models experience remarkable accuracy drops under our\nproposed variation, with an average loss of 57% on MMLU and 50% on UNED-Access\n2024, ranging from 10% to 93% across models. Notably, the most accurate model\nin our experimentation (OpenAI-o3-mini) is not the most robust\n(DeepSeek-R1-70B), suggesting that the best models in standard evaluations may\nnot be the ones with better reasoning capabilities. Also, we see larger\naccuracy drops in public (vs private) datasets and questions posed in their\noriginal language (vs a manual translation), which are signs of contamination\nand also point to a relevant role of recall/memorization in current LLMs'\nanswers.", "paper_summary_zh": "在 LLM 評估中，推理通常透過對數學導向問題進行數值變異來區別於回憶/記憶。在此，我們引入一種通用變異方法，適用於多選題，它將正確答案與先前看到的代幣或概念完全區分開來，要求 LLM 理解和推理（而不是記憶），以便正確回答。使用此方法，我們在英語和西班牙語中評估了兩種數據集中的最先進的專有和開源 LLM：公共 MMLU 基準和私有 UNED-Access 2024 數據集。結果表明，在我們提出的變異下，所有模型的準確度都出現顯著下降，在 MMLU 上平均損失 57%，在 UNED-Access 2024 上平均損失 50%，在不同模型中範圍從 10% 到 93%。值得注意的是，我們實驗中最準確的模型（OpenAI-o3-mini）並不是最穩健的模型（DeepSeek-R1-70B），這表明標準評估中最好的模型可能不是推理能力最強的模型。此外，我們看到公共（相對於私有）數據集和以原始語言提出的問題（相對於人工翻譯）的準確度下降幅度更大，這是汙染的跡象，也表明回憶/記憶在當前 LLM 的答案中發揮著相關作用。", "author": "Eva Sánchez Salido et.al.", "authors": "Eva Sánchez Salido, Julio Gonzalo, Guillermo Marco", "id": "2502.12896v1", "paper_url": "http://arxiv.org/abs/2502.12896v1", "repo": "null"}}