{"2409.19078": {"publish_time": "2024-09-27", "title": "Differential privacy for protecting patient data in speech disorder detection using deep learning", "paper_summary": "Speech pathology has impacts on communication abilities and quality of life.\nWhile deep learning-based models have shown potential in diagnosing these\ndisorders, the use of sensitive data raises critical privacy concerns. Although\ndifferential privacy (DP) has been explored in the medical imaging domain, its\napplication in pathological speech analysis remains largely unexplored despite\nthe equally critical privacy concerns. This study is the first to investigate\nDP's impact on pathological speech data, focusing on the trade-offs between\nprivacy, diagnostic accuracy, and fairness. Using a large, real-world dataset\nof 200 hours of recordings from 2,839 German-speaking participants, we observed\na maximum accuracy reduction of 3.85% when training with DP with a privacy\nbudget, denoted by {\\epsilon}, of 7.51. To generalize our findings, we\nvalidated our approach on a smaller dataset of Spanish-speaking Parkinson's\ndisease patients, demonstrating that careful pretraining on large-scale\ntask-specific datasets can maintain or even improve model accuracy under DP\nconstraints. We also conducted a comprehensive fairness analysis, revealing\nthat reasonable privacy levels (2<{\\epsilon}<10) do not introduce significant\ngender bias, though age-related disparities may require further attention. Our\nresults suggest that DP can effectively balance privacy and utility in speech\ndisorder detection, but also highlight the unique challenges in the speech\ndomain, particularly regarding the privacy-fairness trade-off. This provides a\nfoundation for future work to refine DP methodologies and address fairness\nacross diverse patient groups in real-world deployments.", "paper_summary_zh": "<paragraph>言語病理學對溝通能力和生活品質有影響。\n儘管基於深度學習的模型在診斷這些疾病方面已展現潛力，但敏感資料的使用引發了嚴重的隱私問題。儘管差分隱私 (DP) 已在醫學影像領域中得到探討，但其在病理語言分析中的應用仍未得到充分探討，儘管其隱私問題同樣嚴重。本研究首次探討了 DP 對病理語言資料的影響，重點關注隱私、診斷準確性和公平性之間的權衡。我們使用了一個大型的真實世界資料集，其中包含來自 2,839 名德語參與者的 200 小時錄音，我們觀察到在使用 DP 進行訓練時，隱私預算（以 {\\epsilon} 表示）為 7.51 時，準確度最高降低了 3.85%。為了推廣我們的發現，我們在一個規模較小的西班牙語帕金森病患者資料集上驗證了我們的做法，證明了在大規模特定任務資料集上進行仔細的預訓練可以在 DP 約束下維持甚至提高模型準確度。我們還進行了全面的公平性分析，結果顯示合理的隱私等級（2<{\\epsilon}<10）不會引入顯著的性別偏見，儘管與年齡相關的差異可能需要進一步關注。我們的結果表明，DP 可以有效地在語言障礙檢測中平衡隱私和效用，但也突出了語言領域中獨特的挑戰，特別是關於隱私公平性的權衡。這為未來的研究提供了基礎，以完善 DP 方法並在實際部署中解決不同患者群體中的公平性問題。</paragraph>", "author": "Soroosh Tayebi Arasteh et.al.", "authors": "Soroosh Tayebi Arasteh, Mahshad Lotfinia, Paula Andrea Perez-Toro, Tomas Arias-Vergara, Juan Rafael Orozco-Arroyave, Maria Schuster, Andreas Maier, Seung Hee Yang", "id": "2409.19078v1", "paper_url": "http://arxiv.org/abs/2409.19078v1", "repo": "null"}}