{"2410.11588": {"publish_time": "2024-10-15", "title": "Causal Reasoning in Large Language Models: A Knowledge Graph Approach", "paper_summary": "Large language models (LLMs) typically improve performance by either\nretrieving semantically similar information, or enhancing reasoning abilities\nthrough structured prompts like chain-of-thought. While both strategies are\nconsidered crucial, it remains unclear which has a greater impact on model\nperformance or whether a combination of both is necessary. This paper answers\nthis question by proposing a knowledge graph (KG)-based random-walk reasoning\napproach that leverages causal relationships. We conduct experiments on the\ncommonsense question answering task that is based on a KG. The KG inherently\nprovides both relevant information, such as related entity keywords, and a\nreasoning structure through the connections between nodes. Experimental results\nshow that the proposed KG-based random-walk reasoning method improves the\nreasoning ability and performance of LLMs. Interestingly, incorporating three\nseemingly irrelevant sentences into the query using KG-based random-walk\nreasoning enhances LLM performance, contrary to conventional wisdom. These\nfindings suggest that integrating causal structures into prompts can\nsignificantly improve reasoning capabilities, providing new insights into the\nrole of causality in optimizing LLM performance.", "paper_summary_zh": "大型語言模型 (LLM) 通常透過擷取語意上相似的資訊，或透過鏈式思考等結構化提示增強推理能力，來提升效能。儘管這兩種策略都被認為至關重要，但目前仍不清楚哪一種對模型效能影響較大，或是否需要結合兩者。本文透過提出一個基於知識圖譜 (KG) 的隨機漫步推理方法，來回答這個問題，這個方法利用了因果關係。我們在基於 KG 的常識問答任務上進行實驗。KG 本身就提供了相關資訊，例如相關實體關鍵字，以及透過節點之間的連結提供的推理結構。實驗結果顯示，提出的基於 KG 的隨機漫步推理方法改善了 LLM 的推理能力和效能。有趣的是，與傳統觀念相反，使用基於 KG 的隨機漫步推理將三個看似無關的句子納入查詢中，可以提升 LLM 的效能。這些發現表明，將因果結構整合到提示中可以顯著提升推理能力，並為因果關係在最佳化 LLM 效能中所扮演的角色提供新的見解。", "author": "Yejin Kim et.al.", "authors": "Yejin Kim, Eojin Kang, Juae Kim, H. Howie Huang", "id": "2410.11588v1", "paper_url": "http://arxiv.org/abs/2410.11588v1", "repo": "null"}}