{"2405.12262": {"publish_time": "2024-05-20", "title": "Prompt Learning for Generalized Vehicle Routing", "paper_summary": "Neural combinatorial optimization (NCO) is a promising learning-based\napproach to solving various vehicle routing problems without much manual\nalgorithm design. However, the current NCO methods mainly focus on the\nin-distribution performance, while the real-world problem instances usually\ncome from different distributions. A costly fine-tuning approach or generalized\nmodel retraining from scratch could be needed to tackle the out-of-distribution\ninstances. Unlike the existing methods, this work investigates an efficient\nprompt learning approach in NCO for cross-distribution adaptation. To be\nconcrete, we propose a novel prompt learning method to facilitate fast\nzero-shot adaptation of a pre-trained model to solve routing problem instances\nfrom different distributions. The proposed model learns a set of prompts among\nvarious distributions and then selects the best-matched one to prompt a\npre-trained attention model for each problem instance. Extensive experiments\nshow that the proposed prompt learning approach facilitates the fast adaptation\nof pre-trained routing models. It also outperforms existing generalized models\non both in-distribution prediction and zero-shot generalization to a diverse\nset of new tasks. Our code implementation is available online\nhttps://github.com/FeiLiu36/PromptVRP.", "paper_summary_zh": "神經組合最佳化 (NCO) 是一種有前途的基於學習的方法，用於解決各種車輛路線問題，而無需太多手動演算法設計。然而，目前的 NCO 方法主要關注於分配內效能，而真實世界的問題實例通常來自不同的分配。可能需要昂貴的微調方法或從頭開始進行廣義模型再訓練，才能處理分配外實例。與現有方法不同，這項工作研究了 NCO 中一種有效的提示學習方法，用於跨分配適應。具體來說，我們提出了一種新穎的提示學習方法，以促進預訓練模型快速零次適應，以解決來自不同分配的路由問題實例。所提出的模型學習了各種分配之間的一組提示，然後選擇最佳匹配的一個來提示每個問題實例的預訓練注意力模型。廣泛的實驗表明，所提出的提示學習方法促进了預訓練路由模型的快速適應。它在分配內預測和零次泛化到各種新任務上也優於現有的廣義模型。我們的程式碼實作可以在線上取得 https://github.com/FeiLiu36/PromptVRP。", "author": "Fei Liu et.al.", "authors": "Fei Liu, Xi Lin, Weiduo Liao, Zhenkun Wang, Qingfu Zhang, Xialiang Tong, Mingxuan Yuan", "id": "2405.12262v1", "paper_url": "http://arxiv.org/abs/2405.12262v1", "repo": "null"}}