{"2405.14862": {"publish_time": "2024-05-23", "title": "Bitune: Bidirectional Instruction-Tuning", "paper_summary": "We introduce Bitune, a method that improves instruction-tuning of pretrained\ndecoder-only large language models, leading to consistent gains on downstream\ntasks. Bitune applies both causal and bidirectional attention to the prompt, to\nobtain a better representation of the query or instruction. We realize this by\nintroducing two sets of parameters, for which we apply parameter-efficient\nfinetuning techniques. These causal and bidirectional features are then\ncombined into a weighted average with trainable coefficients, which is\nsubsequently used to generate new tokens. We demonstrate significant\nimprovements in zero-shot performance on commonsense reasoning, arithmetic, and\nlanguage understanding tasks, while extensive ablation studies validate the\nrole of each component and demonstrate the method's agnosticism to different\nPEFT techniques.", "paper_summary_zh": "我們引入了 Bitune，這是一種改善預先訓練的僅解碼器大型語言模型的指令微調的方法，從而對下游任務產生持續的收益。Bitune 對提示應用因果和雙向注意，以獲得查詢或指令的更好表示。我們通過引入兩組參數來實現這一點，我們對其應用參數高效的微調技術。然後將這些因果和雙向特徵與可訓練係數組合成加權平均值，隨後用於生成新的符號。我們展示了常識推理、算術和語言理解任務的零次學習效能的顯著改進，而廣泛的消融研究驗證了每個組成部分的作用，並證明了該方法對不同的 PEFT 技術的不可知論。", "author": "Dawid J. Kopiczko et.al.", "authors": "Dawid J. Kopiczko, Tijmen Blankevoort, Yuki M. Asano", "id": "2405.14862v1", "paper_url": "http://arxiv.org/abs/2405.14862v1", "repo": "null"}}