{"2501.18271": {"publish_time": "2025-01-30", "title": "Pre-Trained Vision-Language Model Selection and Reuse for Downstream Tasks", "paper_summary": "Pre-trained Vision-Language Models (VLMs) are becoming increasingly popular\nacross various visual tasks, and several open-sourced VLM variants have been\nreleased. However, selecting the best-performing pre-trained VLM for a specific\ndownstream task is challenging since no single VLM can achieve promising\nperformance on all downstream tasks, and evaluating all available VLMs is\nimpossible due to time and data limitations. To address this problem, this\npaper proposes a novel paradigm to select and reuse VLM for downstream tasks,\ncalled Model Label Learning (MLL). The proposal contains three key modules:\n\\emph{model labeling}, which assigns labels to each VLM to describe their\nspecialty and utility; \\emph{model selection}, which matches the requirements\nof the target task with model labels; and \\emph{model reuse}, which applies\nselected VLMs to the target task in an ensemble manner. The proposal is highly\ncomputationally efficient and growable since the model labeling process is\ncompleted target task independent and the ability could grow with the number of\ncandidate VLMs. We also introduce a new benchmark for evaluating VLM selection\nmethods, including 49 VLMs and 17 target task datasets. Experimental results\nclearly demonstrate the effectiveness of the proposed method for selecting and\nreusing VLMs.", "paper_summary_zh": "<paragraph>預先訓練好的視覺語言模型 (VLM) 在各種視覺任務中越來越受歡迎，並且已經發布了數個開源的 VLM 變體。然而，為特定下游任務選擇效能最佳的預先訓練好的 VLM 具有挑戰性，因為沒有單一的 VLM 能夠在所有下游任務上達到有希望的效能，而且由於時間和資料的限制，無法評估所有可用的 VLM。為了解決這個問題，本文提出了一個新的範例來為下游任務選擇和重新使用 VLM，稱為模型標籤學習 (MLL)。該提案包含三個關鍵模組：\\emph{模型標籤}，它為每個 VLM 指定標籤以描述其專長和效用；\\emph{模型選擇}，它將目標任務的要求與模型標籤相匹配；以及\\emph{模型重複使用}，它以整體方式將選定的 VLM 應用於目標任務。該提案具有高度的運算效率且可擴充，因為模型標籤處理是獨立於目標任務而完成，而且其能力會隨著候選 VLM 的數量而增加。我們還引入了新的基準來評估 VLM 選擇方法，包括 49 個 VLM 和 17 個目標任務資料集。實驗結果清楚地證明了所提出的方法在選擇和重新使用 VLM 方面的有效性。</paragraph>", "author": "Hao-Zhe Tan et.al.", "authors": "Hao-Zhe Tan, Zhi Zhou, Lan-Zhe Guo, Yu-Feng Li", "id": "2501.18271v1", "paper_url": "http://arxiv.org/abs/2501.18271v1", "repo": "null"}}