{"2406.10216": {"publish_time": "2024-06-14", "title": "Regularizing Hidden States Enables Learning Generalizable Reward Model for LLMs", "paper_summary": "Reward models trained on human preference data have been proven to be\neffective for aligning Large Language Models (LLMs) with human intent within\nthe reinforcement learning from human feedback (RLHF) framework. However, the\ngeneralization capabilities of current reward models to unseen prompts and\nresponses are limited. This limitation can lead to an unexpected phenomenon\nknown as reward over-optimization, where excessive optimization of rewards\nresults in a decline in actual performance. While previous research has\nadvocated for constraining policy optimization, our study proposes a novel\napproach to enhance the reward model's generalization ability against\ndistribution shifts by regularizing the hidden states. Specifically, we retain\nthe base model's language model head and incorporate a suite of text-generation\nlosses to preserve the hidden states' text generation capabilities, while\nconcurrently learning a reward head behind the same hidden states. Our\nexperimental results demonstrate that the introduced regularization technique\nmarkedly improves the accuracy of learned reward models across a variety of\nout-of-distribution (OOD) tasks and effectively alleviate the over-optimization\nissue in RLHF, offering a more reliable and robust preference learning\nparadigm.", "paper_summary_zh": "獎勵模型經過人類偏好數據訓練，已證明可有效將大型語言模型 (LLM) 與人類意圖結合在人類回饋強化學習 (RLHF) 架構中。然而，當前獎勵模型對未見提示和回應的概化能力有限。這種限制可能導致一種稱為獎勵過度最佳化的現象，其中過度最佳化獎勵會導致實際效能下降。雖然先前的研究主張約束政策最佳化，但我們的研究提出了一種新穎的方法，透過規範隱藏狀態來增強獎勵模型對抗分佈轉移的概化能力。具體來說，我們保留基礎模型的語言模型頭，並結合一套文字生成損失，以保留隱藏狀態的文字生成能力，同時在相同的隱藏狀態後面學習獎勵頭。我們的實驗結果表明，引入的正則化技術顯著提高了各種分佈外 (OOD) 任務中學習獎勵模型的準確性，並有效緩解了 RLHF 中的過度最佳化問題，提供了一個更可靠且強大的偏好學習範例。", "author": "Rui Yang et.al.", "authors": "Rui Yang, Ruomeng Ding, Yong Lin, Huan Zhang, Tong Zhang", "id": "2406.10216v1", "paper_url": "http://arxiv.org/abs/2406.10216v1", "repo": "null"}}