{"2411.09169": {"publish_time": "2024-11-14", "title": "Artificial Theory of Mind and Self-Guided Social Organisation", "paper_summary": "One of the challenges artificial intelligence (AI) faces is how a collection\nof agents coordinate their behaviour to achieve goals that are not reachable by\nany single agent. In a recent article by Ozmen et al this was framed as one of\nsix grand challenges: That AI needs to respect human cognitive processes at the\nhuman-AI interaction frontier. We suggest that this extends to the AI-AI\nfrontier and that it should also reflect human psychology, as it is the only\nsuccessful framework we have from which to build out. In this extended abstract\nwe first make the case for collective intelligence in a general setting,\ndrawing on recent work from single neuron complexity in neural networks and ant\nnetwork adaptability in ant colonies. From there we introduce how species\nrelate to one another in an ecological network via niche selection, niche\nchoice, and niche conformity with the aim of forming an analogy with human\nsocial network development as new agents join together and coordinate. From\nthere we show how our social structures are influenced by our neuro-physiology,\nour psychology, and our language. This emphasises how individual people within\na social network influence the structure and performance of that network in\ncomplex tasks, and that cognitive faculties such as Theory of Mind play a\ncentral role. We finish by discussing the current state of the art in AI and\nwhere there is potential for further development of a socially embodied\ncollective artificial intelligence that is capable of guiding its own social\nstructures.", "paper_summary_zh": "人工智能 (AI) 所面临的挑戰之一，在於一組智能體如何協調其行為以達成單一智能體無法達成的目標。在 Ozmen 等人的一篇近期文章中，這被視為六大挑戰之一：AI 需要在人機互動前沿尊重人類的認知過程。我們認為這延伸到了 AI-AI 前沿，並且也應反映人類心理，因為這是我們用來建構的唯一成功架構。在此擴展摘要中，我們首先在一般設定中提出集體智慧的論點，並引用神經網路中單一神經元複雜性和螞蟻群落中螞蟻網路適應性的最新研究。從那裡，我們介紹物種如何透過利基選擇、利基選擇和利基適應在生態網路中相互關聯，目的是形成人類社交網路發展的類比，因為新的智能體會加入並協調。從那裡，我們展示我們的社會結構如何受到我們的生理、心理和語言的影響。這強調了社交網路中的個人如何影響網路在複雜任務中的結構和效能，以及心智理論等認知能力扮演著核心角色。最後，我們討論 AI 的現狀，以及社會化集體人工智能進一步發展的潛力，這種人工智能有能力引導其自身的社會結構。", "author": "Michael S. Harré et.al.", "authors": "Michael S. Harré, Jaime Ruiz-Serra, Catherine Drysdale", "id": "2411.09169v1", "paper_url": "http://arxiv.org/abs/2411.09169v1", "repo": "null"}}