{"2407.19638": {"publish_time": "2024-07-29", "title": "From Pre-training Corpora to Large Language Models: What Factors Influence LLM Performance in Causal Discovery Tasks?", "paper_summary": "Recent advances in artificial intelligence have seen Large Language Models\n(LLMs) demonstrate notable proficiency in causal discovery tasks. This study\nexplores the factors influencing the performance of LLMs in causal discovery\ntasks. Utilizing open-source LLMs, we examine how the frequency of causal\nrelations within their pre-training corpora affects their ability to accurately\nrespond to causal discovery queries. Our findings reveal that a higher\nfrequency of causal mentions correlates with better model performance,\nsuggesting that extensive exposure to causal information during training\nenhances the models' causal discovery capabilities. Additionally, we\ninvestigate the impact of context on the validity of causal relations. Our\nresults indicate that LLMs might exhibit divergent predictions for identical\ncausal relations when presented in different contexts. This paper provides the\nfirst comprehensive analysis of how different factors contribute to LLM\nperformance in causal discovery tasks.", "paper_summary_zh": "近期人工智能的進展已見證大型語言模型 (LLM) 在因果發現任務中展現顯著的熟練度。本研究探討影響 LLM 在因果發現任務中表現的因素。利用開源 LLM，我們探討預訓練語料庫中因果關係的頻率如何影響它們準確回應因果發現查詢的能力。我們的發現顯示，因果提及的頻率越高，與更好的模型表現相關，這表示在訓練期間大量接觸因果資訊會增強模型的因果發現能力。此外，我們調查背景對因果關係有效性的影響。我們的結果顯示，當以不同的背景呈現時，LLM 可能對相同的因果關係展現不同的預測。本文提供了第一個全面的分析，說明不同因素如何影響 LLM 在因果發現任務中的表現。", "author": "Tao Feng et.al.", "authors": "Tao Feng, Lizhen Qu, Niket Tandon, Zhuang Li, Xiaoxi Kang, Gholamreza Haffari", "id": "2407.19638v1", "paper_url": "http://arxiv.org/abs/2407.19638v1", "repo": "null"}}