{"2406.17706": {"publish_time": "2024-06-25", "title": "FedBiOT: LLM Local Fine-tuning in Federated Learning without Full Model", "paper_summary": "Large language models (LLMs) show amazing performance on many domain-specific\ntasks after fine-tuning with some appropriate data. However, many\ndomain-specific data are privately distributed across multiple owners. Thus,\nthis dilemma raises the interest in how to perform LLM fine-tuning in federated\nlearning (FL). However, confronted with limited computation and communication\ncapacities, FL clients struggle to fine-tune an LLM effectively. To this end,\nwe introduce FedBiOT, a resource-efficient LLM fine-tuning approach to FL.\nSpecifically, our method involves the server generating a compressed LLM and\naligning its performance with the full model. Subsequently, the clients\nfine-tune a lightweight yet important part of the compressed model, referred to\nas an adapter. Notice that as the server has no access to the private data\nowned by the clients, the data used for alignment by the server has a different\ndistribution from the one used for fine-tuning by clients. We formulate the\nproblem into a bi-level optimization problem to minimize the negative effect of\ndata discrepancy and derive the updating rules for the server and clients. We\nconduct extensive experiments on LLaMA-2, empirically showing that the adapter\nhas exceptional performance when reintegrated into the global LLM. The results\nalso indicate that the proposed FedBiOT significantly reduces resource\nconsumption compared to existing benchmarks, all while achieving comparable\nperformance levels.", "paper_summary_zh": "大型語言模型 (LLM) 在微調一些適當數據後，在許多特定領域任務上表現出色。然而，許多特定領域數據在多個所有者之間私下分發。因此，這個兩難局面引起了人們對如何在聯合學習 (FL) 中執行 LLM 微調的興趣。然而，面對有限的計算和通信能力，FL 客戶端難以有效地微調 LLM。為此，我們引入了 FedBiOT，一種適用於 FL 的資源高效 LLM 微調方法。具體來說，我們的模型涉及伺服器生成壓縮的 LLM，並使其性能與完整模型保持一致。隨後，客戶端微調壓縮模型中輕量但重要的部分，稱為適配器。請注意，由於伺服器無法訪問客戶端擁有的私人數據，因此伺服器用於對齊的數據與客戶端用於微調的數據分佈不同。我們將問題表述為一個雙層優化問題，以最小化數據差異的負面影響，並推導出伺服器和客戶端的更新規則。我們對 LLaMA-2 進行了廣泛的實驗，實證表明，將適配器重新整合到全局 LLM 中時，其性能異常出色。結果還表明，與現有基準相比，所提出的 FedBiOT 大大降低了資源消耗，同時達到了相當的性能水平。", "author": "Feijie Wu et.al.", "authors": "Feijie Wu, Zitao Li, Yaliang Li, Bolin Ding, Jing Gao", "id": "2406.17706v1", "paper_url": "http://arxiv.org/abs/2406.17706v1", "repo": "null"}}