{"2406.04337": {"publish_time": "2024-06-06", "title": "Coherent Zero-Shot Visual Instruction Generation", "paper_summary": "Despite the advances in text-to-image synthesis, particularly with diffusion\nmodels, generating visual instructions that require consistent representation\nand smooth state transitions of objects across sequential steps remains a\nformidable challenge. This paper introduces a simple, training-free framework\nto tackle the issues, capitalizing on the advancements in diffusion models and\nlarge language models (LLMs). Our approach systematically integrates text\ncomprehension and image generation to ensure visual instructions are visually\nappealing and maintain consistency and accuracy throughout the instruction\nsequence. We validate the effectiveness by testing multi-step instructions and\ncomparing the text alignment and consistency with several baselines. Our\nexperiments show that our approach can visualize coherent and visually pleasing\ninstructions", "paper_summary_zh": "儘管文字轉影像合成技術進步，特別是使用擴散模型，但生成需要一致呈現且在連續步驟中物件狀態轉換流暢的視覺說明，仍是一項艱鉅的挑戰。本文介紹一個簡單且無需訓練的架構來解決這些問題，並利用擴散模型和大型語言模型 (LLM) 的進展。我們的做法系統性地整合文字理解和影像生成，以確保視覺說明在視覺上具有吸引力，並在整個說明順序中保持一致性和準確性。我們透過測試多步驟說明，並與多個基準比較文字對齊和一致性，來驗證其有效性。我們的實驗顯示，我們的做法可以視覺化連貫且視覺上令人愉悅的說明", "author": "Quynh Phung et.al.", "authors": "Quynh Phung, Songwei Ge, Jia-Bin Huang", "id": "2406.04337v1", "paper_url": "http://arxiv.org/abs/2406.04337v1", "repo": "null"}}