{"2408.07417": {"publish_time": "2024-08-14", "title": "The Restaurant Meal Delivery Problem with Ghost Kitchens", "paper_summary": "Restaurant meal delivery has been rapidly growing in the last few years. The\nmain challenges in operating it are the temporally and spatially dispersed\nstochastic demand that arrives from customers all over town as well as the\ncustomers' expectation of timely and fresh delivery. To overcome these\nchallenges a new business concept emerged, \"Ghost kitchens\". This concept\nproposes synchronized food preparation of several restaurants in a central\ncomplex, exploiting consolidation benefits. However, dynamically scheduling\nfood preparation and delivery is challenging and we propose operational\nstrategies for the effective operations of ghost kitchens. We model the problem\nas a sequential decision process. For the complex, combinatorial decision space\nof scheduling order preparations, consolidating orders to trips, and scheduling\ntrip departures, we propose a large neighborhood search procedure based on\npartial decisions and driven by analytical properties. Within the large\nneighborhood search, decisions are evaluated via a value function\napproximation, enabling anticipatory and real-time decision making. We show the\neffectiveness of our method and demonstrate the value of ghost kitchens\ncompared to conventional meal delivery systems. We show that both integrated\noptimization of cook scheduling and vehicle dispatching, as well as\nanticipation of future demand and decisions, are essential for successful\noperations. We further derive several managerial insights, amongst others, that\ncompanies should carefully consider the trade-off between fast delivery and\nfresh food.", "paper_summary_zh": "近年來，餐廳外送服務快速成長。其經營上的主要挑戰在於來自全鎮顧客的時間和空間分散的隨機需求，以及顧客對及時新鮮送達的期待。為了克服這些挑戰，一個新的商業概念「幽靈廚房」應運而生。這個概念提出在一個中央廚房同步製作多家餐廳的餐點，藉此發揮合併的效益。然而，動態排程餐點製作和配送是一項挑戰，我們提出營運策略以有效營運幽靈廚房。我們將問題建模為一個順序決策程序。對於排程訂單製作、將訂單合併為行程，以及排程行程出發的複雜組合決策空間，我們提出一個基於部分決策並由分析特性驅動的大鄰域搜尋程序。在大鄰域搜尋中，決策會透過價值函數近似來評估，促成預期性和即時決策。我們展示了我們方法的有效性，並證明了幽靈廚房與傳統外送系統相比的價值。我們表明，整合優化廚師排程和車輛調度，以及預測未來需求和決策，對於成功的營運至關重要。我們進一步得出一些管理見解，其中包括公司應仔細考慮快速配送和新鮮餐點之間的取捨。", "author": "Gal Neria et.al.", "authors": "Gal Neria, Florentin D Hildebrandt, Michal Tzur, Marlin W Ulmer", "id": "2408.07417v1", "paper_url": "http://arxiv.org/abs/2408.07417v1", "repo": "null"}}