{"2302.01241": {"publish_time": "2023-02-02", "title": "Diagrammatization: Rationalizing with diagrammatic AI explanations for abductive-deductive reasoning on hypotheses", "paper_summary": "Many visualizations have been developed for explainable AI (XAI), but they\noften require further reasoning by users to interpret. We argue that XAI should\nsupport diagrammatic and abductive reasoning for the AI to perform hypothesis\ngeneration and evaluation to reduce the interpretability gap. We propose\nDiagrammatization to i) perform Peircean abductive-deductive reasoning, ii)\nfollow domain conventions, and iii) explain with diagrams visually or verbally.\nWe implemented DiagramNet for a clinical application to predict cardiac\ndiagnoses from heart auscultation, and explain with shape-based murmur\ndiagrams. In modeling studies, we found that DiagramNet not only provides\nfaithful murmur shape explanations, but also has better prediction performance\nthan baseline models. We further demonstrate the interpretability and\ntrustworthiness of diagrammatic explanations in a qualitative user study with\nmedical students, showing that clinically-relevant, diagrammatic explanations\nare preferred over technical saliency map explanations. This work contributes\ninsights into providing domain-conventional abductive explanations for\nuser-centric XAI.", "paper_summary_zh": "許多視覺化已被開發用於可解釋的 AI (XAI)，但它們通常需要使用者進一步推理才能解讀。我們主張 XAI 應支援圖解和演繹推理，讓 AI 執行假設產生和評估以縮小可解釋性差距。我們提出圖解化以 i) 執行皮爾士演繹-演繹推理，ii) 遵循領域慣例，以及 iii) 以視覺或口語方式說明圖表。我們實作了 DiagramNet 進行臨床應用，以從心臟聽診預測心臟診斷，並以形狀為基礎的雜音圖說明。在建模研究中，我們發現 DiagramNet 不僅提供了忠實的雜音形狀說明，而且比基準模型具有更好的預測效能。我們進一步在與醫學生的質性使用者研究中展示了圖解說明的可解釋性和可信度，顯示出以臨床相關的圖解說明優於技術顯著性圖說明。這項工作有助於提供以使用者為中心的 XAI 的領域慣例演繹說明。", "author": "Brian Y. Lim et.al.", "authors": "Brian Y. Lim, Joseph P. Cahaly, Chester Y. F. Sng, Adam Chew", "id": "2302.01241v2", "paper_url": "http://arxiv.org/abs/2302.01241v2", "repo": "null"}}