{"2412.13810": {"publish_time": "2024-12-18", "title": "CAD-Assistant: Tool-Augmented VLLMs as Generic CAD Task Solvers?", "paper_summary": "We propose CAD-Assistant, a general-purpose CAD agent for AI-assisted design.\nOur approach is based on a powerful Vision and Large Language Model (VLLM) as a\nplanner and a tool-augmentation paradigm using CAD-specific modules.\nCAD-Assistant addresses multimodal user queries by generating actions that are\niteratively executed on a Python interpreter equipped with the FreeCAD\nsoftware, accessed via its Python API. Our framework is able to assess the\nimpact of generated CAD commands on geometry and adapts subsequent actions\nbased on the evolving state of the CAD design. We consider a wide range of\nCAD-specific tools including Python libraries, modules of the FreeCAD Python\nAPI, helpful routines, rendering functions and other specialized modules. We\nevaluate our method on multiple CAD benchmarks and qualitatively demonstrate\nthe potential of tool-augmented VLLMs as generic CAD task solvers across\ndiverse CAD workflows.", "paper_summary_zh": "我們提出 CAD-Assistant，一個用於 AI 輔助設計的通用 CAD 代理。\n我們的做法基於強大的 Vision 和大型語言模型 (VLLM) 作為規劃器，以及使用 CAD 特定模組的工具擴充範例。\nCAD-Assistant 透過產生在配備 FreeCAD 軟體的 Python 詮釋器上反覆執行的動作，來處理多模式使用者查詢，並透過其 Python API 存取。我們的架構能夠評估產生的 CAD 指令對幾何的影響，並根據 CAD 設計的演化狀態調整後續動作。我們考慮了廣泛的 CAD 特定工具，包括 Python 函式庫、FreeCAD Python API 的模組、有用的常式、渲染函式和其他專門模組。我們在多個 CAD 基準上評估我們的做法，並定性地展示了工具擴充 VLLM 作為通用 CAD 任務解決器的潛力，涵蓋了各種 CAD 工作流程。", "author": "Dimitrios Mallis et.al.", "authors": "Dimitrios Mallis, Ahmet Serdar Karadeniz, Sebastian Cavada, Danila Rukhovich, Niki Foteinopoulou, Kseniya Cherenkova, Anis Kacem, Djamila Aouada", "id": "2412.13810v1", "paper_url": "http://arxiv.org/abs/2412.13810v1", "repo": "null"}}