{"2501.03670": {"publish_time": "2025-01-07", "title": "A Diversity-Enhanced Knowledge Distillation Model for Practical Math Word Problem Solving", "paper_summary": "Math Word Problem (MWP) solving is a critical task in natural language\nprocessing, has garnered significant research interest in recent years. Various\nrecent studies heavily rely on Seq2Seq models and their extensions (e.g.,\nSeq2Tree and Graph2Tree) to generate mathematical equations. While effective,\nthese models struggle to generate diverse but counterpart solution equations,\nlimiting their generalization across various math problem scenarios. In this\npaper, we introduce a novel Diversity-enhanced Knowledge Distillation (DivKD)\nmodel for practical MWP solving. Our approach proposes an adaptive diversity\ndistillation method, in which a student model learns diverse equations by\nselectively transferring high-quality knowledge from a teacher model.\nAdditionally, we design a diversity prior-enhanced student model to better\ncapture the diversity distribution of equations by incorporating a conditional\nvariational auto-encoder. Extensive experiments on {four} MWP benchmark\ndatasets demonstrate that our approach achieves higher answer accuracy than\nstrong baselines while maintaining high efficiency for practical applications.", "paper_summary_zh": "數學文字題 (MWP) 求解是自然語言處理中的一項重要任務，近年來已引起重大的研究興趣。各種最近的研究大量依賴 Seq2Seq 模型及其擴充套件（例如 Seq2Tree 和 Graph2Tree）來產生數學方程式。儘管有效，但這些模型難以產生多樣化但對應的解方程式，這限制了它們在各種數學問題情境中的泛化能力。在本文中，我們介紹了一個新穎的多樣性增強知識蒸餾 (DivKD) 模型，用於實用的 MWP 求解。我們的做法提出了一種自適應的多樣性蒸餾方法，其中學生模型透過選擇性地從教師模型傳輸高品質知識來學習多樣化的方程式。此外，我們設計了一個多樣性先驗增強學生模型，透過結合條件變異自動編碼器來更好地捕捉方程式的多樣性分佈。在 {四個} MWP 基準資料集上的大量實驗證明，我們的做法比強大的基準線實現了更高的答案準確度，同時在實用應用中保持了高效率。", "author": "Yi Zhang et.al.", "authors": "Yi Zhang, Guangyou Zhou, Zhiwen Xie, Jinjin Ma, Jimmy Xiangji Huang", "id": "2501.03670v1", "paper_url": "http://arxiv.org/abs/2501.03670v1", "repo": "https://github.com/a773938364/divkd"}}