{"2411.18157": {"publish_time": "2024-11-27", "title": "A survey on cutting-edge relation extraction techniques based on language models", "paper_summary": "This comprehensive survey delves into the latest advancements in Relation\nExtraction (RE), a pivotal task in natural language processing essential for\napplications across biomedical, financial, and legal sectors. This study\nhighlights the evolution and current state of RE techniques by analyzing 137\npapers presented at the Association for Computational Linguistics (ACL)\nconferences over the past four years, focusing on models that leverage language\nmodels. Our findings underscore the dominance of BERT-based methods in\nachieving state-of-the-art results for RE while also noting the promising\ncapabilities of emerging large language models (LLMs) like T5, especially in\nfew-shot relation extraction scenarios where they excel in identifying\npreviously unseen relations.", "paper_summary_zh": "這項全面的調查深入探討了關係萃取 (RE) 的最新進展，關係萃取是自然語言處理中的一項關鍵任務，對於生物醫學、金融和法律領域的應用至關重要。本研究透過分析過去四年來計算語言學協會 (ACL) 會議上提出的 137 篇論文，重點探討利用語言模型的模型，突顯了關係萃取技術的演進和現況。我們的研究結果強調了 BERT 為基礎的方法在達成關係萃取的最新成果中所扮演的主導地位，同時也注意到新興大型語言模型 (LLM)（例如 T5）具備的潛力，特別是在少樣本關係萃取場景中，它們在辨識前所未見的關係方面表現出色。", "author": "Jose A. Diaz-Garcia et.al.", "authors": "Jose A. Diaz-Garcia, Julio Amador Diaz Lopez", "id": "2411.18157v1", "paper_url": "http://arxiv.org/abs/2411.18157v1", "repo": "null"}}