{"2407.11406": {"publish_time": "2024-07-16", "title": "Revisiting the Impact of Pursuing Modularity for Code Generation", "paper_summary": "Modular programming, which aims to construct the final program by integrating\nsmaller, independent building blocks, has been regarded as a desirable practice\nin software development. However, with the rise of recent code generation\nagents built upon large language models (LLMs), a question emerges: is this\ntraditional practice equally effective for these new tools? In this work, we\nassess the impact of modularity in code generation by introducing a novel\nmetric for its quantitative measurement. Surprisingly, unlike conventional\nwisdom on the topic, we find that modularity is not a core factor for improving\nthe performance of code generation models. We also explore potential\nexplanations for why LLMs do not exhibit a preference for modular code compared\nto non-modular code.", "paper_summary_zh": "模組化程式設計旨在透過整合較小、獨立的建構區塊來建構最終程式，一直被視為軟體開發中理想的做法。然而，隨著建立於大型語言模型 (LLM) 的最新程式碼產生代理程式興起，一個問題浮現：這種傳統做法對於這些新工具是否同樣有效？在這項工作中，我們透過引進一種用於量化測量的新穎指標來評估模組化對程式碼產生的影響。令人驚訝的是，與該主題上的傳統智慧不同，我們發現模組化並非改善程式碼產生模型效能的核心因素。我們也探討了 LLM 與非模組化程式碼相比，為何不偏好模組化程式碼的潛在解釋。", "author": "Deokyeong Kang et.al.", "authors": "Deokyeong Kang, Ki Jung Seo, Taeuk Kim", "id": "2407.11406v1", "paper_url": "http://arxiv.org/abs/2407.11406v1", "repo": "null"}}