{"2408.12560": {"publish_time": "2024-08-22", "title": "Data Quality Antipatterns for Software Analytics", "paper_summary": "Background: Data quality is vital in software analytics, particularly for\nmachine learning (ML) applications like software defect prediction (SDP).\nDespite the widespread use of ML in software engineering, the effect of data\nquality antipatterns on these models remains underexplored.\n  Objective: This study develops a taxonomy of ML-specific data quality\nantipatterns and assesses their impact on software analytics models'\nperformance and interpretation.\n  Methods: We identified eight types and 14 sub-types of ML-specific data\nquality antipatterns through a literature review. We conducted experiments to\ndetermine the prevalence of these antipatterns in SDP data (RQ1), assess how\ncleaning order affects model performance (RQ2), evaluate the impact of\nantipattern removal on performance (RQ3), and examine the consistency of\ninterpretation from models built with different antipatterns (RQ4).\n  Results: In our SDP case study, we identified nine antipatterns. Over 90% of\nthese overlapped at both row and column levels, complicating cleaning\nprioritization and risking excessive data removal. The order of cleaning\nsignificantly impacts ML model performance, with neural networks being more\nresilient to cleaning order changes than simpler models like logistic\nregression. Antipatterns such as Tailed Distributions and Class Overlap show a\nstatistically significant correlation with performance metrics when other\nantipatterns are cleaned. Models built with different antipatterns showed\nmoderate consistency in interpretation results.\n  Conclusion: The cleaning order of different antipatterns impacts ML model\nperformance. Five antipatterns have a statistically significant correlation\nwith model performance when others are cleaned. Additionally, model\ninterpretation is moderately affected by different data quality antipatterns.", "paper_summary_zh": "<paragraph>背景：資料品質對於軟體分析至關重要，特別是對於軟體缺陷預測 (SDP) 等機器學習 (ML) 應用程式。儘管機器學習在軟體工程中廣泛使用，但資料品質反模式對這些模型的影響仍未得到充分探討。\n目標：本研究建立了一個 ML 特定資料品質反模式的分類法，並評估它們對軟體分析模型效能和詮釋的影響。\n方法：我們透過文獻回顧找出八種類型和 14 種子類型的 ML 特定資料品質反模式。我們進行實驗以確定這些反模式在 SDP 資料中的盛行率 (RQ1)，評估清理順序如何影響模型效能 (RQ2)，評估移除反模式對效能的影響 (RQ3)，並檢查使用不同反模式建構的模型的詮釋一致性 (RQ4)。\n結果：在我們的 SDP 案例研究中，我們找出九個反模式。其中超過 90% 在列和欄位層面重疊，使清理優先順序複雜化，並有過度移除資料的風險。清理順序會顯著影響 ML 模型效能，神經網路比邏輯迴歸等較簡單的模型更能適應清理順序的變更。當其他反模式被清理時，尾部分布和類別重疊等反模式顯示出與效能指標有統計上的顯著相關性。使用不同反模式建構的模型在詮釋結果方面顯示出中等的相容性。\n結論：不同反模式的清理順序會影響 ML 模型效能。當其他反模式被清理時，有五個反模式與模型效能有統計上的顯著相關性。此外，模型詮釋會受到不同的資料品質反模式的中等影響。</paragraph>", "author": "Aaditya Bhatia et.al.", "authors": "Aaditya Bhatia, Dayi Lin, Gopi Krishnan Rajbahadur, Bram Adams, Ahmed E. Hassan", "id": "2408.12560v1", "paper_url": "http://arxiv.org/abs/2408.12560v1", "repo": "null"}}