{"2406.14373": {"publish_time": "2024-06-20", "title": "Artificial Leviathan: Exploring Social Evolution of LLM Agents Through the Lens of Hobbesian Social Contract Theory", "paper_summary": "The emergence of Large Language Models (LLMs) and advancements in Artificial\nIntelligence (AI) offer an opportunity for computational social science\nresearch at scale. Building upon prior explorations of LLM agent design, our\nwork introduces a simulated agent society where complex social relationships\ndynamically form and evolve over time. Agents are imbued with psychological\ndrives and placed in a sandbox survival environment. We conduct an evaluation\nof the agent society through the lens of Thomas Hobbes's seminal Social\nContract Theory (SCT). We analyze whether, as the theory postulates, agents\nseek to escape a brutish \"state of nature\" by surrendering rights to an\nabsolute sovereign in exchange for order and security. Our experiments unveil\nan alignment: Initially, agents engage in unrestrained conflict, mirroring\nHobbes's depiction of the state of nature. However, as the simulation\nprogresses, social contracts emerge, leading to the authorization of an\nabsolute sovereign and the establishment of a peaceful commonwealth founded on\nmutual cooperation. This congruence between our LLM agent society's\nevolutionary trajectory and Hobbes's theoretical account indicates LLMs'\ncapability to model intricate social dynamics and potentially replicate forces\nthat shape human societies. By enabling such insights into group behavior and\nemergent societal phenomena, LLM-driven multi-agent simulations, while unable\nto simulate all the nuances of human behavior, may hold potential for advancing\nour understanding of social structures, group dynamics, and complex human\nsystems.", "paper_summary_zh": "大型語言模型 (LLM) 的出現和人工智慧 (AI) 的進步，為大規模的計算社會科學研究提供了機會。在先前對 LLM 代理設計的探索基礎上，我們的研究引入了模擬代理社會，其中複雜的社會關係會隨著時間動態形成和演變。代理人被賦予了心理驅動力，並被置於沙盒生存環境中。我們透過湯瑪斯·霍布斯的開創性社會契約論 (SCT) 的觀點，對代理社會進行評估。我們分析了代理人是否如理論所假設的那樣，透過放棄權利以換取秩序和安全，來逃離殘酷的「自然狀態」。我們的實驗揭示了一致性：最初，代理人會參與不受約束的衝突，反映了霍布斯對自然狀態的描繪。然而，隨著模擬的進行，社會契約開始出現，導致授權絕對的主權者，並建立一個基於相互合作的和平聯邦。我們的 LLM 代理社會的演化軌跡與霍布斯的理論論述之間的這種一致性，表明 LLM 能夠模擬複雜的社會動態，並潛在地複製塑造人類社會的力量。透過提供對群體行為和新興社會現象的見解，LLM 驅動的多代理模擬雖然無法模擬人類行為的所有細微差別，但可能有助於增進我們對社會結構、群體動態和複雜人類系統的理解。", "author": "Gordon Dai et.al.", "authors": "Gordon Dai, Weijia Zhang, Jinhan Li, Siqi Yang, Chidera Onochie lbe, Srihas Rao, Arthur Caetano, Misha Sra", "id": "2406.14373v1", "paper_url": "http://arxiv.org/abs/2406.14373v1", "repo": "null"}}