{"2405.12368": {"publish_time": "2024-05-20", "title": "Layout Agnostic Human Activity Recognition in Smart Homes through Textual Descriptions Of Sensor Triggers (TDOST)", "paper_summary": "Human activity recognition (HAR) using ambient sensors in smart homes has\nnumerous applications for human healthcare and wellness. However, building\ngeneral-purpose HAR models that can be deployed to new smart home environments\nrequires a significant amount of annotated sensor data and training overhead.\nMost smart homes vary significantly in their layouts, i.e., floor plans and the\nspecifics of sensors embedded, resulting in low generalizability of HAR models\ntrained for specific homes. We address this limitation by introducing a novel,\nlayout-agnostic modeling approach for HAR systems in smart homes that utilizes\nthe transferrable representational capacity of natural language descriptions of\nraw sensor data. To this end, we generate Textual Descriptions Of Sensor\nTriggers (TDOST) that encapsulate the surrounding trigger conditions and\nprovide cues for underlying activities to the activity recognition models.\nLeveraging textual embeddings, rather than raw sensor data, we create activity\nrecognition systems that predict standard activities across homes without\neither (re-)training or adaptation on target homes. Through an extensive\nevaluation, we demonstrate the effectiveness of TDOST-based models in unseen\nsmart homes through experiments on benchmarked CASAS datasets. Furthermore, we\nconduct a detailed analysis of how the individual components of our approach\naffect downstream activity recognition performance.", "paper_summary_zh": "利用智慧家庭中環境感測器進行人類活動辨識 (HAR) 在人類醫療保健和健康方面有許多應用。然而，建立可部署到新智慧家庭環境的通用 HAR 模型需要大量的註解感測器資料和訓練開銷。大多數智慧家庭的配置差異很大，例如樓層平面圖和嵌入式感測器的規格，導致為特定家庭訓練的 HAR 模型的概括性很低。我們透過引入一種創新的、與配置無關的智慧家庭 HAR 系統建模方法來解決這個限制，該方法利用自然語言描述原始感測器資料的可轉移表示能力。為此，我們產生感測器觸發文字描述 (TDOST)，它包含周圍的觸發條件，並為活動辨識模型提供底層活動的線索。我們利用文字嵌入，而非原始感測器資料，建立活動辨識系統，可在家庭中預測標準活動，而無需在目標家庭中進行（重新）訓練或調整。透過廣泛的評估，我們在基準 CASAS 資料集上的實驗中證明了 TDOST 模型在未見過的智慧家庭中的有效性。此外，我們對我們方法的各個組成部分如何影響下游活動辨識效能進行了詳細的分析。", "author": "Megha Thukral et.al.", "authors": "Megha Thukral, Sourish Gunesh Dhekane, Shruthi K. Hiremath, Harish Haresamudram, Thomas Ploetz", "id": "2405.12368v1", "paper_url": "http://arxiv.org/abs/2405.12368v1", "repo": "null"}}