{"2407.17544": {"publish_time": "2024-07-24", "title": "MathViz-E: A Case-study in Domain-Specialized Tool-Using Agents", "paper_summary": "There has been significant recent interest in harnessing LLMs to control\nsoftware systems through multi-step reasoning, planning and tool-usage. While\nsome promising results have been obtained, application to specific domains\nraises several general issues including the control of specialized domain\ntools, the lack of existing datasets for training and evaluation, and the\nnon-triviality of automated system evaluation and improvement. In this paper,\nwe present a case-study where we examine these issues in the context of a\nspecific domain. Specifically, we present an automated math visualizer and\nsolver system for mathematical pedagogy. The system orchestrates mathematical\nsolvers and math graphing tools to produce accurate visualizations from simple\nnatural language commands. We describe the creation of specialized data-sets,\nand also develop an auto-evaluator to easily evaluate the outputs of our system\nby comparing them to ground-truth expressions. We have open sourced the\ndata-sets and code for the proposed system.", "paper_summary_zh": "最近，人们对利用大型语言模型 (LLM) 来通过多步骤推理、规划和工具使用来控制软件系统产生了极大的兴趣。虽然已经取得了一些有希望的结果，但应用于特定领域会引发几个普遍性问题，包括对专业领域工具的控制、缺乏用于训练和评估的现有数据集，以及自动化系统评估和改进的非平凡性。在本文中，我们提出了一个案例研究，其中我们研究了特定领域背景下的这些问题。具体来说，我们展示了一个用于数学教育的自动化数学可视化器和求解器系统。该系统协调数学求解器和数学绘图工具，以根据简单的自然语言命令生成准确的可视化效果。我们描述了专门数据集的创建，还开发了一个自动评估器，通过将我们的系统输出与真实表达式进行比较，轻松评估其输出。我们已经开源了所提议系统的代码和数据集。", "author": "Arya Bulusu et.al.", "authors": "Arya Bulusu, Brandon Man, Ashish Jagmohan, Aditya Vempaty, Jennifer Mari-Wyka, Deepak Akkil", "id": "2407.17544v1", "paper_url": "http://arxiv.org/abs/2407.17544v1", "repo": "null"}}