{"2407.11501": {"publish_time": "2024-07-16", "title": "Diff-MTS: Temporal-Augmented Conditional Diffusion-based AIGC for Industrial Time Series Towards the Large Model Era", "paper_summary": "Industrial Multivariate Time Series (MTS) is a critical view of the\nindustrial field for people to understand the state of machines. However, due\nto data collection difficulty and privacy concerns, available data for building\nindustrial intelligence and industrial large models is far from sufficient.\nTherefore, industrial time series data generation is of great importance.\nExisting research usually applies Generative Adversarial Networks (GANs) to\ngenerate MTS. However, GANs suffer from unstable training process due to the\njoint training of the generator and discriminator. This paper proposes a\ntemporal-augmented conditional adaptive diffusion model, termed Diff-MTS, for\nMTS generation. It aims to better handle the complex temporal dependencies and\ndynamics of MTS data. Specifically, a conditional Adaptive Maximum-Mean\nDiscrepancy (Ada-MMD) method has been proposed for the controlled generation of\nMTS, which does not require a classifier to control the generation. It improves\nthe condition consistency of the diffusion model. Moreover, a Temporal\nDecomposition Reconstruction UNet (TDR-UNet) is established to capture complex\ntemporal patterns and further improve the quality of the synthetic time series.\nComprehensive experiments on the C-MAPSS and FEMTO datasets demonstrate that\nthe proposed Diff-MTS performs substantially better in terms of diversity,\nfidelity, and utility compared with GAN-based methods. These results show that\nDiff-MTS facilitates the generation of industrial data, contributing to\nintelligent maintenance and the construction of industrial large models.", "paper_summary_zh": "工業多元時間序列 (MTS) 是工業領域中關鍵的觀點，讓人們了解機器狀態。然而，由於資料收集困難和隱私問題，可用於建立工業智慧和工業大型模型的資料遠遠不足。因此，工業時間序列資料生成非常重要。現有研究通常應用生成對抗網路 (GAN) 來產生 MTS。然而，由於生成器和鑑別器的聯合訓練，GAN 訓練過程不穩定。本文提出了一個時間增強條件適應擴散模型，稱為 Diff-MTS，用於 MTS 生成。它旨在更好地處理 MTS 資料的複雜時間依賴性和動態性。具體來說，提出了一個條件適應最大均值差異 (Ada-MMD) 方法，用於受控生成 MTS，它不需要分類器來控制生成。它改進了擴散模型的條件一致性。此外，建立了一個時間分解重建 UNet (TDR-UNet) 來捕捉複雜的時間模式，並進一步提高合成時間序列的品質。在 C-MAPSS 和 FEMTO 資料集上的綜合實驗表明，與基於 GAN 的方法相比，所提出的 Diff-MTS 在多樣性、保真度和效用方面表現得顯著更好。這些結果表明，Diff-MTS 促進了工業資料的生成，有助於智慧維護和工業大型模型的構建。", "author": "Lei Ren et.al.", "authors": "Lei Ren, Haiteng Wang, Yuanjun Laili", "id": "2407.11501v1", "paper_url": "http://arxiv.org/abs/2407.11501v1", "repo": "null"}}