{"2407.02197": {"publish_time": "2024-07-02", "title": "Research on Reliable and Safe Occupancy Grid Prediction in Underground Parking Lots", "paper_summary": "Against the backdrop of advancing science and technology, autonomous vehicle\ntechnology has emerged as a focal point of intense scrutiny within the academic\ncommunity. Nevertheless, the challenge persists in guaranteeing the safety and\nreliability of this technology when navigating intricate scenarios. While a\nsubstantial portion of autonomous driving research is dedicated to testing in\nopen-air environments, such as urban roads and highways, where the myriad\nvariables at play are meticulously examined, enclosed indoor spaces like\nunderground parking lots have, to a significant extent, been overlooked in the\nscholarly discourse. This discrepancy highlights a gap in derstanding the\nunique challenges these confined settings pose for autonomous navigation\nsystems.\n  This study tackles indoor autonomous driving, particularly in overlooked\nspaces like underground parking lots. Using CARLA's simulation platform, a\nrealistic parking model is created for data gathering. An occupancy grid\nnetwork then processes this data to predict vehicle paths and obstacles,\nenhancing the system's perception in complex indoor environments. Ultimately,\nthis strategy improves safety in autonomous parking operations. The paper\nmeticulously evaluates the model's predictive capabilities, validating its\nefficacy in the context of underground parking. Our findings confirm that the\nproposed strategy successfully enhances autonomous vehicle performance in these\ncomplex indoor settings. It equips autonomous systems with improved adaptation\nto underground lots, reinforcing safety measures and dependability. This work\npaves the way for future advancements and applications by addressing the\nresearch shortfall concerning indoor parking environments, serving as a pivotal\nreference point.", "paper_summary_zh": "在科學技術進步的背景下，自動駕駛技術已成為學術界關注的焦點。然而，在應對複雜場景時，保證該技術的安全性和可靠性仍然是一個挑戰。雖然自動駕駛研究的很大一部分專注於在戶外環境（例如城市道路和高速公路）中進行測試，並仔細檢查了眾多變量，但地下停車場等封閉的室內空間在學術論述中在很大程度上被忽視了。這種差異突顯了理解這些受限環境對自動導航系統構成的獨特挑戰方面的差距。\n本研究解決了室內自動駕駛問題，特別是在地下停車場等被忽視的空間中。使用 CARLA 的模擬平台，創建了一個逼真的停車模型以收集數據。然後，佔用網格網路處理此數據以預測車輛路徑和障礙物，從而增強系統在複雜室內環境中的感知。最終，此策略提高了自動停車操作的安全性。本文仔細評估了該模型的預測能力，驗證了其在地下停車場中的功效。我們的研究結果證實，所提出的策略成功地增強了自動駕駛汽車在這些複雜的室內環境中的性能。它使自動系統能夠更好地適應地下停車場，加強安全措施和可靠性。這項工作通過解決有關室內停車環境的研究不足，為未來的進步和應用鋪平了道路，並作為一個關鍵參考點。", "author": "JiaQi Luo et.al.", "authors": "JiaQi Luo", "id": "2407.02197v1", "paper_url": "http://arxiv.org/abs/2407.02197v1", "repo": "null"}}