{"2411.02174": {"publish_time": "2024-11-04", "title": "Behavioral Sequence Modeling with Ensemble Learning", "paper_summary": "We investigate the use of sequence analysis for behavior modeling,\nemphasizing that sequential context often outweighs the value of aggregate\nfeatures in understanding human behavior. We discuss framing common problems in\nfields like healthcare, finance, and e-commerce as sequence modeling tasks, and\naddress challenges related to constructing coherent sequences from fragmented\ndata and disentangling complex behavior patterns. We present a framework for\nsequence modeling using Ensembles of Hidden Markov Models, which are\nlightweight, interpretable, and efficient. Our ensemble-based scoring method\nenables robust comparison across sequences of different lengths and enhances\nperformance in scenarios with imbalanced or scarce data. The framework scales\nin real-world scenarios, is compatible with downstream feature-based modeling,\nand is applicable in both supervised and unsupervised learning settings. We\ndemonstrate the effectiveness of our method with results on a longitudinal\nhuman behavior dataset.", "paper_summary_zh": "我們研究序列分析在行為建模中的應用，\n強調序列脈絡通常比總和特徵更能理解人類行為。我們討論將醫療保健、金融和電子商務等領域中的常見問題設定為序列建模任務，並解決與從片段化資料建構連貫序列和解開複雜行為模式相關的挑戰。我們提出了一個使用隱藏馬可夫模型集合進行序列建模的框架，該框架輕量、可解釋且有效率。我們基於集合的評分方法能夠對不同長度的序列進行穩健比較，並在資料不平衡或稀少的情況下提升效能。該框架在真實世界場景中具有可擴充性，與下游基於特徵的建模相容，且適用於監督式和非監督式學習設定。我們透過縱向人類行為資料集的結果證明了我們方法的有效性。", "author": "Maxime Kawawa-Beaudan et.al.", "authors": "Maxime Kawawa-Beaudan, Srijan Sood, Soham Palande, Ganapathy Mani, Tucker Balch, Manuela Veloso", "id": "2411.02174v1", "paper_url": "http://arxiv.org/abs/2411.02174v1", "repo": "null"}}