{"2409.11239": {"publish_time": "2024-09-17", "title": "LLM-as-a-Judge & Reward Model: What They Can and Cannot Do", "paper_summary": "LLM-as-a-Judge and reward models are widely used alternatives of\nmultiple-choice questions or human annotators for large language model (LLM)\nevaluation. Their efficacy shines in evaluating long-form responses, serving a\ncritical role as evaluators of leaderboards and as proxies to align LLMs via\nreinforcement learning. However, despite their popularity, their effectiveness\noutside of English remains largely unexplored. In this paper, we conduct a\ncomprehensive analysis on automated evaluators, reporting key findings on their\nbehavior in a non-English environment. First, we discover that English\nevaluation capabilities significantly influence language-specific capabilities,\noften more than the language proficiency itself, enabling evaluators trained in\nEnglish to easily transfer their skills to other languages. Second, we identify\ncritical shortcomings, where LLMs fail to detect and penalize errors, such as\nfactual inaccuracies, cultural misrepresentations, and the presence of unwanted\nlanguage. Finally, we release Kudge, the first non-English meta-evaluation\ndataset containing 5,012 human annotations in Korean.", "paper_summary_zh": "LLM 即法官和獎勵模型是廣泛用於多選題或人類註釋者的大型語言模型 (LLM) 評估的替代方案。它們在評估長篇回應方面發揮著顯著作用，作為排行榜的評估者和通過強化學習調整 LLM 的代理扮演著至關重要的角色。然而，儘管它們很受歡迎，但它們在英語以外的有效性在很大程度上仍未得到探索。在本文中，我們對自動化評估器進行了全面分析，報告了它們在非英語環境中的行為的關鍵發現。首先，我們發現英語評估能力顯著影響特定語言的能力，通常比語言能力本身影響更大，這使得接受過英語培訓的評估者能夠輕鬆地將他們的技能轉移到其他語言。其次，我們發現了嚴重的缺點，LLM 無法檢測和懲罰錯誤，例如事實不准確、文化誤解和存在不需要的語言。最後，我們發布了 Kudge，這是第一個非英語元評估數據集，其中包含 5,012 個韓語人類註釋。", "author": "Guijin Son et.al.", "authors": "Guijin Son, Hyunwoo Ko, Hoyoung Lee, Yewon Kim, Seunghyeok Hong", "id": "2409.11239v1", "paper_url": "http://arxiv.org/abs/2409.11239v1", "repo": "null"}}