{"2409.06446": {"publish_time": "2024-09-10", "title": "HexaCoder: Secure Code Generation via Oracle-Guided Synthetic Training Data", "paper_summary": "Large language models (LLMs) have shown great potential for automatic code\ngeneration and form the basis for various tools such as GitHub Copilot.\nHowever, recent studies highlight that many LLM-generated code contains serious\nsecurity vulnerabilities. While previous work tries to address this by training\nmodels that generate secure code, these attempts remain constrained by limited\naccess to training data and labor-intensive data preparation.\n  In this paper, we introduce HexaCoder, a novel approach to enhance the\nability of LLMs to generate secure codes by automatically synthesizing secure\ncodes, which reduces the effort of finding suitable training data. HexaCoder\ncomprises two key components: an oracle-guided data synthesis pipeline and a\ntwo-step process for secure code generation. The data synthesis pipeline\ngenerates pairs of vulnerable and fixed codes for specific Common Weakness\nEnumeration (CWE) types by utilizing a state-of-the-art LLM for repairing\nvulnerable code. A security oracle identifies vulnerabilities, and a\nstate-of-the-art LLM repairs them by extending and/or editing the codes,\ncreating data pairs for fine-tuning using the Low-Rank Adaptation (LoRA)\nmethod. Each example of our fine-tuning dataset includes the necessary\nsecurity-related libraries and code that form the basis of our novel two-step\ngeneration approach. This allows the model to integrate security-relevant\nlibraries before generating the main code, significantly reducing the number of\ngenerated vulnerable codes by up to 85% compared to the baseline methods. We\nperform extensive evaluations on three different benchmarks for four LLMs,\ndemonstrating that HexaCoder not only improves the security of the generated\ncode but also maintains a high level of functional correctness.", "paper_summary_zh": "大型語言模型 (LLM) 在自動程式碼生成方面展現了巨大的潛力，並成為各種工具的基礎，例如 GitHub Copilot。然而，最近的研究強調，許多 LLM 生成的程式碼包含嚴重的安全漏洞。雖然先前的研究嘗試透過訓練產生安全程式碼的模型來解決此問題，但這些嘗試仍受到訓練資料取得受限和資料準備工作繁重的限制。在本文中，我們介紹 HexaCoder，這是一種透過自動合成安全程式碼來增強 LLM 產生安全程式碼能力的新方法，它減少了尋找合適訓練資料的精力。HexaCoder 包含兩個關鍵組成部分：一個由 Oracle 引導的資料合成管線，以及一個用於產生安全程式碼的兩步驟程序。資料合成管線透過利用最先進的 LLM 來修復有漏洞的程式碼，為特定常見弱點列舉 (CWE) 類型產生有漏洞和已修復程式碼的配對。安全 Oracle 會識別漏洞，而最先進的 LLM 會透過延伸和/或編輯程式碼來修復這些漏洞，並建立資料配對，以使用低秩適應 (LoRA) 方法進行微調。我們的微調資料集的每個範例都包含必要的安全相關函式庫和程式碼，這些程式碼構成我們新穎兩步驟生成方法的基礎。這允許模型在產生主程式碼之前整合與安全相關的函式庫，與基線方法相比，可顯著減少多達 85% 的有漏洞程式碼數量。我們針對四個 LLM 的三個不同基準進行廣泛評估，證明 HexaCoder 不僅提高了所產生程式碼的安全性，還維持了高水準的功能正確性。", "author": "Hossein Hajipour et.al.", "authors": "Hossein Hajipour, Lea Schönherr, Thorsten Holz, Mario Fritz", "id": "2409.06446v1", "paper_url": "http://arxiv.org/abs/2409.06446v1", "repo": "null"}}