{"2412.03572": {"publish_time": "2024-12-04", "title": "Navigation World Models", "paper_summary": "Navigation is a fundamental skill of agents with visual-motor capabilities.\nWe introduce a Navigation World Model (NWM), a controllable video generation\nmodel that predicts future visual observations based on past observations and\nnavigation actions. To capture complex environment dynamics, NWM employs a\nConditional Diffusion Transformer (CDiT), trained on a diverse collection of\negocentric videos of both human and robotic agents, and scaled up to 1 billion\nparameters. In familiar environments, NWM can plan navigation trajectories by\nsimulating them and evaluating whether they achieve the desired goal. Unlike\nsupervised navigation policies with fixed behavior, NWM can dynamically\nincorporate constraints during planning. Experiments demonstrate its\neffectiveness in planning trajectories from scratch or by ranking trajectories\nsampled from an external policy. Furthermore, NWM leverages its learned visual\npriors to imagine trajectories in unfamiliar environments from a single input\nimage, making it a flexible and powerful tool for next-generation navigation\nsystems.", "paper_summary_zh": "導航是具備視覺運動能力的代理人的一項基本技能。\n我們引入導航世界模型 (NWM)，這是一個可控制的影片生成模型，它基於過去的觀察和導航動作來預測未來的視覺觀察。為了捕捉複雜的環境動態，NWM 採用條件擴散轉換器 (CDiT)，它在人類和機器人代理人的各種以自我為中心影片的集合上進行訓練，並擴展到 10 億個參數。在熟悉的環境中，NWM 可以透過模擬導航軌跡並評估它們是否達成所需目標，來規劃導航軌跡。與具有固定行為的監督式導航策略不同，NWM 可以動態地將限制納入規劃中。實驗證明了它在從頭開始規劃軌跡或從外部策略中取樣軌跡並對其進行排名方面的有效性。此外，NWM 利用其學習的視覺先驗，從單一輸入影像想像在不熟悉環境中的軌跡，這使其成為下一代導航系統的靈活且強大的工具。", "author": "Amir Bar et.al.", "authors": "Amir Bar, Gaoyue Zhou, Danny Tran, Trevor Darrell, Yann LeCun", "id": "2412.03572v1", "paper_url": "http://arxiv.org/abs/2412.03572v1", "repo": "null"}}