{"2408.12568": {"publish_time": "2024-08-22", "title": "Pruning By Explaining Revisited: Optimizing Attribution Methods to Prune CNNs and Transformers", "paper_summary": "To solve ever more complex problems, Deep Neural Networks are scaled to\nbillions of parameters, leading to huge computational costs. An effective\napproach to reduce computational requirements and increase efficiency is to\nprune unnecessary components of these often over-parameterized networks.\nPrevious work has shown that attribution methods from the field of eXplainable\nAI serve as effective means to extract and prune the least relevant network\ncomponents in a few-shot fashion. We extend the current state by proposing to\nexplicitly optimize hyperparameters of attribution methods for the task of\npruning, and further include transformer-based networks in our analysis. Our\napproach yields higher model compression rates of large transformer- and\nconvolutional architectures (VGG, ResNet, ViT) compared to previous works,\nwhile still attaining high performance on ImageNet classification tasks. Here,\nour experiments indicate that transformers have a higher degree of\nover-parameterization compared to convolutional neural networks. Code is\navailable at\n$\\href{https://github.com/erfanhatefi/Pruning-by-eXplaining-in-PyTorch}{\\text{this\nhttps link}}$.", "paper_summary_zh": "為了解決越來越複雜的問題，深度神經網路被擴展到數十億個參數，導致巨大的計算成本。減少計算需求和提高效率的有效方法是修剪這些經常過度參數化的網路中不必要的組成部分。先前的研究表明，來自可解釋 AI 領域的歸因方法可用作以少量樣本方式提取和修剪最不相關網路組成部分的有效方法。我們透過提出針對修剪任務明確最佳化歸因方法的超參數來擴展目前的狀態，並進一步在我們的分析中納入基於轉換器的網路。與先前的研究相比，我們的方法產生了較高的模型壓縮率，包括大型轉換器和卷積架構（VGG、ResNet、ViT），同時在 ImageNet 分類任務中仍能獲得高性能。在此，我們的實驗表明，與卷積神經網路相比，轉換器具有較高的過度參數化程度。程式碼可在\n$\\href{https://github.com/erfanhatefi/Pruning-by-eXplaining-in-PyTorch}{\\text{此 https 連結}}$ 取得。", "author": "Sayed Mohammad Vakilzadeh Hatefi et.al.", "authors": "Sayed Mohammad Vakilzadeh Hatefi, Maximilian Dreyer, Reduan Achtibat, Thomas Wiegand, Wojciech Samek, Sebastian Lapuschkin", "id": "2408.12568v1", "paper_url": "http://arxiv.org/abs/2408.12568v1", "repo": "null"}}