{"2503.16091": {"publish_time": "2025-03-20", "title": "AIMI: Leveraging Future Knowledge and Personalization in Sparse Event Forecasting for Treatment Adherence", "paper_summary": "Adherence to prescribed treatments is crucial for individuals with chronic\nconditions to avoid costly or adverse health outcomes. For certain patient\ngroups, intensive lifestyle interventions are vital for enhancing medication\nadherence. Accurate forecasting of treatment adherence can open pathways to\ndeveloping an on-demand intervention tool, enabling timely and personalized\nsupport. With the increasing popularity of smartphones and wearables, it is now\neasier than ever to develop and deploy smart activity monitoring systems.\nHowever, effective forecasting systems for treatment adherence based on\nwearable sensors are still not widely available. We close this gap by proposing\nAdherence Forecasting and Intervention with Machine Intelligence (AIMI). AIMI\nis a knowledge-guided adherence forecasting system that leverages smartphone\nsensors and previous medication history to estimate the likelihood of\nforgetting to take a prescribed medication. A user study was conducted with 27\nparticipants who took daily medications to manage their cardiovascular\ndiseases. We designed and developed CNN and LSTM-based forecasting models with\nvarious combinations of input features and found that LSTM models can forecast\nmedication adherence with an accuracy of 0.932 and an F-1 score of 0.936.\nMoreover, through a series of ablation studies involving convolutional and\nrecurrent neural network architectures, we demonstrate that leveraging known\nknowledge about future and personalized training enhances the accuracy of\nmedication adherence forecasting. Code available:\nhttps://github.com/ab9mamun/AIMI.", "paper_summary_zh": "<paragraph>對於患有慢性疾病的個人來說，堅持規定的治療方案至關重要，這樣才能避免昂貴或不良的健康後果。對於某些患者群體，密集的生活方式干預對於提高藥物依從性至關重要。準確預測治療依從性可以開闢開發按需干預工具的途徑，從而實現及時和個性化的支持。隨著智慧型手機和穿戴式裝置的日益普及，開發和部署智慧活動監控系統比以往任何時候都更容易。然而，基於穿戴式感測器的有效治療依從性預測系統仍然不普及。我們透過提出基於機器智慧的依從性預測和干預（AIMI）來彌合這一差距。AIMI 是一個知識引導的依從性預測系統，它利用智慧型手機感測器和先前的用藥歷史來估計忘記服用處方藥的可能性。我們對 27 名服用每日藥物來控制心血管疾病的參與者進行了一項使用者研究。我們設計和開發了基於 CNN 和 LSTM 的預測模型，並結合各種輸入特徵，發現 LSTM 模型可以預測藥物依從性，準確率為 0.932，F-1 值為 0.936。此外，透過一系列涉及卷積和遞迴神經網路架構的消融研究，我們證明利用關於未來和個性化訓練的已知知識可以提高藥物依從性預測的準確性。程式碼可在此處取得：https://github.com/ab9mamun/AIMI。</paragraph>\n", "author": "Abdullah Mamun et.al.", "authors": "Abdullah Mamun, Diane J. Cook, Hassan Ghasemzadeh", "id": "2503.16091v1", "paper_url": "http://arxiv.org/abs/2503.16091v1", "repo": "https://github.com/ab9mamun/AIMI"}}