{"2405.12961": {"publish_time": "2024-05-21", "title": "Energy Rank Alignment: Using Preference Optimization to Search Chemical Space at Scale", "paper_summary": "Searching through chemical space is an exceptionally challenging problem\nbecause the number of possible molecules grows combinatorially with the number\nof atoms. Large, autoregressive models trained on databases of chemical\ncompounds have yielded powerful generators, but we still lack robust strategies\nfor generating molecules with desired properties. This molecular search problem\nclosely resembles the \"alignment\" problem for large language models, though for\nmany chemical tasks we have a specific and easily evaluable reward function.\nHere, we introduce an algorithm called energy rank alignment (ERA) that\nleverages an explicit reward function to produce a gradient-based objective\nthat we use to optimize autoregressive policies. We show theoretically that\nthis algorithm is closely related to proximal policy optimization (PPO) and\ndirect preference optimization (DPO), but has a minimizer that converges to an\nideal Gibbs-Boltzmann distribution with the reward playing the role of an\nenergy function. Furthermore, this algorithm is highly scalable, does not\nrequire reinforcement learning, and performs well relative to DPO when the\nnumber of preference observations per pairing is small. We deploy this approach\nto align molecular transformers to generate molecules with externally specified\nproperties and find that it does so robustly, searching through diverse parts\nof chemical space. While our focus here is on chemical search, we also obtain\nexcellent results on an AI supervised task for LLM alignment, showing that the\nmethod is scalable and general.", "paper_summary_zh": "<paragraph>在化學空間中進行搜尋是一個極具挑戰性的問題，因為可能的分子數量會隨著原子數量的增加而組合式增長。在化學化合物資料庫上訓練的大型自迴歸模型已經產生了強大的生成器，但我們仍然缺乏用於生成具有所需屬性的分子的穩健策略。這個分子搜尋問題與大型語言模型的「比對」問題非常相似，儘管對於許多化學任務，我們有一個具體且易於評估的回饋函數。在此，我們引入一種稱為能量等級比對 (ERA) 的演算法，它利用明確的回饋函數來產生基於梯度的目標，我們使用該目標來最佳化自迴歸策略。我們在理論上證明了這個演算法與近端策略最佳化 (PPO) 和直接偏好最佳化 (DPO) 密切相關，但具有收斂到理想 Gibbs-Boltzmann 分布的最小化器，其中回饋扮演能量函數的角色。此外，這個演算法具有高度的可擴充性，不需要強化學習，並且在每次配對的偏好觀察數量較少時，相對於 DPO 的表現良好。我們採用這種方法來比對分子轉換器，以生成具有外部指定屬性的分子，並發現它能穩健地進行搜尋，在化學空間的不同部分中進行搜尋。雖然我們這裡的重點是化學搜尋，但我們也在 LLM 比對的人工智慧監督任務中獲得了極佳的結果，這表明這個方法具有可擴充性和通用性。</paragraph>", "author": "Shriram Chennakesavalu et.al.", "authors": "Shriram Chennakesavalu, Frank Hu, Sebastian Ibarraran, Grant M. Rotskoff", "id": "2405.12961v1", "paper_url": "http://arxiv.org/abs/2405.12961v1", "repo": "null"}}