{"2410.20791": {"publish_time": "2024-10-28", "title": "From Cool Demos to Production-Ready FMware: Core Challenges and a Technology Roadmap", "paper_summary": "The rapid expansion of foundation models (FMs), such as large language models\n(LLMs), has given rise to FMware--software systems that integrate FMs as core\ncomponents. While building demonstration-level FMware is relatively\nstraightforward, transitioning to production-ready systems presents numerous\nchallenges, including reliability, high implementation costs, scalability, and\ncompliance with privacy regulations. This paper provides a thematic analysis of\nthe key obstacles in productionizing FMware, synthesized from industry\nexperience and diverse data sources, including hands-on involvement in the Open\nPlatform for Enterprise AI (OPEA) and FMware lifecycle engineering. We identify\ncritical issues in FM selection, data and model alignment, prompt engineering,\nagent orchestration, system testing, and deployment, alongside cross-cutting\nconcerns such as memory management, observability, and feedback integration. We\ndiscuss needed technologies and strategies to address these challenges and\noffer guidance on how to enable the transition from demonstration systems to\nscalable, production-ready FMware solutions. Our findings underscore the\nimportance of continued research and multi-industry collaboration to advance\nthe development of production-ready FMware.", "paper_summary_zh": "基礎模型（FM）的快速擴展，例如大型語言模型（LLM），催生了 FMware，一種將 FM 整合為核心組件的軟體系統。雖然建置示範等級的 FMware 相對簡單，但轉換至生產就緒系統會產生許多挑戰，包括可靠性、高實作成本、可擴充性，以及符合隱私法規。本文提供主題分析，說明生產 FMware 的主要障礙，這些障礙綜合自產業經驗和各種資料來源，包括親自參與企業 AI 開放平台（OPEA）和 FMware 生命周期工程。我們找出 FM 選擇、資料和模型比對、提示工程、代理人編排、系統測試和部署中的關鍵問題，以及跨領域的疑慮，例如記憶體管理、可觀察性，以及回饋整合。我們討論解決這些挑戰所需技術和策略，並提供如何促成從示範系統轉換至可擴充、生產就緒 FMware 解決方案的指導方針。我們的發現強調持續研究和跨產業合作對於推進生產就緒 FMware 的開發至關重要。", "author": "Gopi Krishnan Rajbahadur et.al.", "authors": "Gopi Krishnan Rajbahadur, Gustavo A. Oliva, Dayi Lin, Ahmed E. Hassan", "id": "2410.20791v1", "paper_url": "http://arxiv.org/abs/2410.20791v1", "repo": "null"}}