{"2407.15612": {"publish_time": "2024-07-22", "title": "Can GPT-4 learn to analyze moves in research article abstracts?", "paper_summary": "One of the most powerful and enduring ideas in written discourse analysis is\nthat genres can be described in terms of the moves which structure a writer's\npurpose. Considerable research has sought to identify these distinct\ncommunicative acts, but analyses have been beset by problems of subjectivity,\nreliability and the time-consuming need for multiple coders to confirm\nanalyses. In this paper we employ the affordances of GPT-4 to automate the\nannotation process by using natural language prompts. Focusing on abstracts\nfrom articles in four applied linguistics journals, we devise prompts which\nenable the model to identify moves effectively. The annotated outputs of these\nprompts were evaluated by two assessors with a third addressing disagreements.\nThe results show that an 8-shot prompt was more effective than one using two,\nconfirming that the inclusion of examples illustrating areas of variability can\nenhance GPT-4's ability to recognize multiple moves in a single sentence and\nreduce bias related to textual position. We suggest that GPT-4 offers\nconsiderable potential in automating this annotation process, when human actors\nwith domain specific linguistic expertise inform the prompting process.", "paper_summary_zh": "書面論述分析中最強大且歷久不衰的概念之一，是文類可以根據構成作者目的的步驟來描述。大量的研究試圖找出這些不同的溝通行為，但分析一直受到主觀性、可靠性以及確認分析需要多個編碼器而耗時等問題的困擾。在本文中，我們採用 GPT-4 的功能，使用自然語言提示來自動化註解程序。我們專注於四本應用語言學期刊中的摘要，設計提示讓模型能有效識別步驟。這些提示的註解輸出由兩位評估者評估，第三位評估者則解決分歧。結果顯示，使用 8 個步驟的提示比使用 2 個步驟的提示更有效，這證實了包含說明變異性領域的範例，可以增強 GPT-4 在單一句子中識別多個步驟的能力，並減少與文字位置相關的偏差。我們建議，當具有特定語言領域專業知識的人類行為者提供提示程序資訊時，GPT-4 在自動化此註解程序方面具有相當大的潛力。", "author": "Danni Yu et.al.", "authors": "Danni Yu, Marina Bondi, Ken Hylannd", "id": "2407.15612v1", "paper_url": "http://arxiv.org/abs/2407.15612v1", "repo": "null"}}