{"2410.11792": {"publish_time": "2024-10-15", "title": "OKAMI: Teaching Humanoid Robots Manipulation Skills through Single Video Imitation", "paper_summary": "We study the problem of teaching humanoid robots manipulation skills by\nimitating from single video demonstrations. We introduce OKAMI, a method that\ngenerates a manipulation plan from a single RGB-D video and derives a policy\nfor execution. At the heart of our approach is object-aware retargeting, which\nenables the humanoid robot to mimic the human motions in an RGB-D video while\nadjusting to different object locations during deployment. OKAMI uses\nopen-world vision models to identify task-relevant objects and retarget the\nbody motions and hand poses separately. Our experiments show that OKAMI\nachieves strong generalizations across varying visual and spatial conditions,\noutperforming the state-of-the-art baseline on open-world imitation from\nobservation. Furthermore, OKAMI rollout trajectories are leveraged to train\nclosed-loop visuomotor policies, which achieve an average success rate of 79.2%\nwithout the need for labor-intensive teleoperation. More videos can be found on\nour website https://ut-austin-rpl.github.io/OKAMI/.", "paper_summary_zh": "我們研究了通過模仿單一視頻演示來教授類人機器人操作技能的問題。我們介紹了 OKAMI，這是一種從單個 RGB-D 視頻生成操作計劃並推導執行策略的方法。我們方法的核心是面向對象的重新定位，它使類人機器人在 RGB-D 視頻中模擬人類動作，同時在部署過程中調整到不同的對象位置。OKAMI 使用開放世界的視覺模型來識別與任務相關的對象，並分別重新定位身體動作和手部姿勢。我們的實驗表明，OKAMI 在不同的視覺和空間條件下實現了強泛化，在通過觀察進行的開放世界模仿中優於最先進的基準。此外，OKAMI 滾動軌跡被用於訓練閉環視動覺策略，在無需勞動密集型遠程操作的情況下實現了 79.2% 的平均成功率。更多視頻可以在我們的網站 https://ut-austin-rpl.github.io/OKAMI/ 上找到。", "author": "Jinhan Li et.al.", "authors": "Jinhan Li, Yifeng Zhu, Yuqi Xie, Zhenyu Jiang, Mingyo Seo, Georgios Pavlakos, Yuke Zhu", "id": "2410.11792v1", "paper_url": "http://arxiv.org/abs/2410.11792v1", "repo": "null"}}