{"2502.10908": {"publish_time": "2025-02-15", "title": "Automatic Quality Assessment of First Trimester Crown-Rump-Length Ultrasound Images", "paper_summary": "Fetal gestational age (GA) is vital clinical information that is estimated\nduring pregnancy in order to assess fetal growth. This is usually performed by\nmeasuring the crown-rump-length (CRL) on an ultrasound image in the Dating scan\nwhich is then correlated with fetal age and growth trajectory. A major issue\nwhen performing the CRL measurement is ensuring that the image is acquired at\nthe correct view, otherwise it could be misleading. Although clinical\nguidelines specify the criteria for the correct CRL view, sonographers may not\nregularly adhere to such rules. In this paper, we propose a new deep\nlearning-based solution that is able to verify the adherence of a CRL image to\nclinical guidelines in order to assess image quality and facilitate accurate\nestimation of GA. We first segment out important fetal structures then use the\nlocalized structures to perform a clinically-guided mapping that verifies the\nadherence of criteria. The segmentation method combines the benefits of\nConvolutional Neural Network (CNN) and the Vision Transformer (ViT) to segment\nfetal structures in ultrasound images and localize important fetal landmarks.\nFor segmentation purposes, we compare our proposed work with UNet and show that\nour CNN/ViT-based method outperforms an optimized version of UNet. Furthermore,\nwe compare the output of the mapping with classification CNNs when assessing\nthe clinical criteria and the overall acceptability of CRL images. We show that\nthe proposed mapping is not only explainable but also more accurate than the\nbest performing classification CNNs.", "paper_summary_zh": "胎兒妊娠年齡 (GA) 是重要的臨床資訊，會在懷孕期間估計，以評估胎兒生長。這通常是透過在約會掃描中測量超音波影像中的頭臀長度 (CRL) 來執行，然後與胎兒年齡和生長軌跡相關聯。執行 CRL 測量時的一個主要問題是確保影像是在正確的視角下取得，否則可能會產生誤導。儘管臨床指南規定了正確 CRL 視角的標準，但超音波檢查員可能不會定期遵守這些規則。在本文中，我們提出了一個新的深度學習解決方案，能夠驗證 CRL 影像是否符合臨床指南，以評估影像品質並促進對 GA 的準確估計。我們首先分割出重要的胎兒結構，然後使用局部結構來執行臨床指導的對應，以驗證標準的遵守情況。分割方法結合了卷積神經網路 (CNN) 和視覺轉換器 (ViT) 的優點，以分割超音波影像中的胎兒結構並定位重要的胎兒標誌。為了分割目的，我們將我們提出的工作與 UNet 進行比較，並顯示我們基於 CNN/ViT 的方法優於 UNet 的最佳化版本。此外，我們在評估臨床標準和 CRL 影像的整體可接受性時，將對應的輸出與分類 CNN 進行比較。我們表明，所提出的對應不僅可以解釋，而且比效能最佳的分類 CNN 更準確。", "author": "Sevim Cengiz et.al.", "authors": "Sevim Cengiz, Ibraheem Hamdi, Mohammad Yaqub", "id": "2502.10908v1", "paper_url": "http://arxiv.org/abs/2502.10908v1", "repo": "null"}}