{"2405.08448": {"publish_time": "2024-05-14", "title": "Understanding the performance gap between online and offline alignment algorithms", "paper_summary": "Reinforcement learning from human feedback (RLHF) is the canonical framework\nfor large language model alignment. However, rising popularity in offline\nalignment algorithms challenge the need for on-policy sampling in RLHF. Within\nthe context of reward over-optimization, we start with an opening set of\nexperiments that demonstrate the clear advantage of online methods over offline\nmethods. This prompts us to investigate the causes to the performance\ndiscrepancy through a series of carefully designed experimental ablations. We\nshow empirically that hypotheses such as offline data coverage and data quality\nby itself cannot convincingly explain the performance difference. We also find\nthat while offline algorithms train policy to become good at pairwise\nclassification, it is worse at generations; in the meantime the policies\ntrained by online algorithms are good at generations while worse at pairwise\nclassification. This hints at a unique interplay between discriminative and\ngenerative capabilities, which is greatly impacted by the sampling process.\nLastly, we observe that the performance discrepancy persists for both\ncontrastive and non-contrastive loss functions, and appears not to be addressed\nby simply scaling up policy networks. Taken together, our study sheds light on\nthe pivotal role of on-policy sampling in AI alignment, and hints at certain\nfundamental challenges of offline alignment algorithms.", "paper_summary_zh": "人類回饋強化學習 (RLHF) 是大型語言模型對齊的標準架構。然而，離線對齊演算法日益普及，挑戰了 RLHF 中對策略採樣的必要性。在獎勵過度最佳化的脈絡中，我們從一組開放的實驗開始，展示了在線方法相較於離線方法的顯著優勢。這促使我們透過一系列精心設計的實驗消融，探討效能差異的原因。我們經驗性地證明，諸如離線資料覆蓋率和資料品質等假設本身無法令人信服地解釋效能差異。我們還發現，儘管離線演算法會訓練策略以擅長成對分類，但它在生成方面較差；與此同時，由在線演算法訓練的策略擅長生成，但在成對分類方面較差。這暗示了判別能力和生成能力之間的獨特交互作用，這會受到抽樣過程的極大影響。最後，我們觀察到，效能差異對於對比和非對比損失函數皆持續存在，而且似乎無法透過單純擴充策略網路來解決。綜合而言，我們的研究闡明了策略採樣在 AI 對齊中的關鍵作用，並暗示了離線對齊演算法的某些基本挑戰。", "author": "Yunhao Tang et.al.", "authors": "Yunhao Tang, Daniel Zhaohan Guo, Zeyu Zheng, Daniele Calandriello, Yuan Cao, Eugene Tarassov, Rémi Munos, Bernardo Ávila Pires, Michal Valko, Yong Cheng, Will Dabney", "id": "2405.08448v1", "paper_url": "http://arxiv.org/abs/2405.08448v1", "repo": "null"}}