{"2408.07888": {"publish_time": "2024-08-15", "title": "Fine-tuning Large Language Models with Human-inspired Learning Strategies in Medical Question Answering", "paper_summary": "Training Large Language Models (LLMs) incurs substantial data-related costs,\nmotivating the development of data-efficient training methods through optimised\ndata ordering and selection. Human-inspired learning strategies, such as\ncurriculum learning, offer possibilities for efficient training by organising\ndata according to common human learning practices. Despite evidence that\nfine-tuning with curriculum learning improves the performance of LLMs for\nnatural language understanding tasks, its effectiveness is typically assessed\nusing a single model. In this work, we extend previous research by evaluating\nboth curriculum-based and non-curriculum-based learning strategies across\nmultiple LLMs, using human-defined and automated data labels for medical\nquestion answering. Our results indicate a moderate impact of using\nhuman-inspired learning strategies for fine-tuning LLMs, with maximum accuracy\ngains of 1.77% per model and 1.81% per dataset. Crucially, we demonstrate that\nthe effectiveness of these strategies varies significantly across different\nmodel-dataset combinations, emphasising that the benefits of a specific\nhuman-inspired strategy for fine-tuning LLMs do not generalise. Additionally,\nwe find evidence that curriculum learning using LLM-defined question difficulty\noutperforms human-defined difficulty, highlighting the potential of using\nmodel-generated measures for optimal curriculum design.", "paper_summary_zh": "訓練大型語言模型 (LLM) 會產生大量的與資料相關的成本，\n因此透過最佳化的資料排序和選擇來激勵開發資料效率訓練方法。\n受人類啟發的學習策略，例如課程學習，提供透過根據常見人類學習實務來組織資料，進行有效訓練的可能性。\n儘管有證據顯示，使用課程學習進行微調會改善 LLM 在自然語言理解任務中的表現，但其有效性通常使用單一模型來評估。\n在這項工作中，我們透過評估多個 LLM 中基於課程和非課程的學習策略，使用人類定義和自動化的資料標籤進行醫療問題解答，來擴展先前的研究。\n我們的結果顯示，使用受人類啟發的學習策略對微調 LLM 產生中等的影響，每個模型的最大準確度提升 1.77%，每個資料集提升 1.81%。\n至關重要的是，我們證明了這些策略的有效性在不同的模型資料集組合中差異很大，強調特定受人類啟發的策略對微調 LLM 的好處並未概括。\n此外，我們發現證據表明，使用 LLM 定義的問題難度進行課程學習優於人類定義的難度，突顯了使用模型產生的測量標準進行最佳課程設計的潛力。", "author": "Yushi Yang et.al.", "authors": "Yushi Yang, Andrew M. Bean, Robert McCraith, Adam Mahdi", "id": "2408.07888v1", "paper_url": "http://arxiv.org/abs/2408.07888v1", "repo": "null"}}