{"2408.15513": {"publish_time": "2024-08-28", "title": "Continual-learning-based framework for structural damage recognition", "paper_summary": "Multi-damage is common in reinforced concrete structures and leads to the\nrequirement of large number of neural networks, parameters and data storage, if\nconvolutional neural network (CNN) is used for damage recognition. In addition,\nconventional CNN experiences catastrophic forgetting and training inefficiency\nas the number of tasks increases during continual learning, leading to large\naccuracy decrease of previous learned tasks. To address these problems, this\nstudy proposes a continuallearning-based damage recognition model (CLDRM) which\nintegrates the learning without forgetting continual learning method into the\nResNet-34 architecture for the recognition of damages in RC structures as well\nas relevant structural components. Three experiments for four recognition tasks\nwere designed to validate the feasibility and effectiveness of the CLDRM\nframework. In this way, it reduces both the prediction time and data storage by\nabout 75% in four tasks of continuous learning. Three experiments for four\nrecognition tasks were designed to validate the feasibility and effectiveness\nof the CLDRM framework. By gradual feature fusion, CLDRM outperformed other\nmethods by managed to achieve high accuracy in the damage recognition and\nclassification. As the number of recognition tasks increased, CLDRM also\nexperienced smaller decrease of the previous learned tasks. Results indicate\nthat the CLDRM framework successfully performs damage recognition and\nclassification with reasonable accuracy and effectiveness.", "paper_summary_zh": "在鋼筋混凝土結構中，多重損壞很常見，如果使用卷積神經網路 (CNN) 來進行損害辨識，則需要大量的網路、參數和資料儲存。此外，傳統的 CNN 在持續學習過程中，隨著任務數量的增加，會出現災難性遺忘和訓練效率低下的問題，導致先前學習任務的準確度大幅下降。為了解決這些問題，本研究提出了一個基於持續學習的損害辨識模型 (CLDRM)，它將不遺忘的持續學習方法整合到 ResNet-34 架構中，用於辨識 RC 結構及其相關結構組件的損害。設計了四個辨識任務的三個實驗，以驗證 CLDRM 框架的可行性和有效性。這樣一來，在持續學習的四個任務中，預測時間和資料儲存量都減少了約 75%。設計了四個辨識任務的三個實驗，以驗證 CLDRM 框架的可行性和有效性。透過漸進式特徵融合，CLDRM 優於其他方法，在損害辨識和分類中實現了高準確度。隨著辨識任務數量的增加，CLDRM 對先前學習任務的損害也較小。結果表明，CLDRM 框架成功地執行損害辨識和分類，具有合理的準確度和有效性。", "author": "Jiangpeng Shu et.al.", "authors": "Jiangpeng Shu, Jiawei Zhang, Reachsak Ly, Fangzheng Lin, Yuanfeng Duan", "id": "2408.15513v1", "paper_url": "http://arxiv.org/abs/2408.15513v1", "repo": "null"}}