{"2412.20264": {"publish_time": "2024-12-28", "title": "Scoring with Large Language Models: A Study on Measuring Empathy of Responses in Dialogues", "paper_summary": "In recent years, Large Language Models (LLMs) have become increasingly more\npowerful in their ability to complete complex tasks. One such task in which\nLLMs are often employed is scoring, i.e., assigning a numerical value from a\ncertain scale to a subject. In this paper, we strive to understand how LLMs\nscore, specifically in the context of empathy scoring. We develop a novel and\ncomprehensive framework for investigating how effective LLMs are at measuring\nand scoring empathy of responses in dialogues, and what methods can be employed\nto deepen our understanding of LLM scoring. Our strategy is to approximate the\nperformance of state-of-the-art and fine-tuned LLMs with explicit and\nexplainable features. We train classifiers using various features of dialogues\nincluding embeddings, the Motivational Interviewing Treatment Integrity (MITI)\nCode, a set of explicit subfactors of empathy as proposed by LLMs, and a\ncombination of the MITI Code and the explicit subfactors. Our results show that\nwhen only using embeddings, it is possible to achieve performance close to that\nof generic LLMs, and when utilizing the MITI Code and explicit subfactors\nscored by an LLM, the trained classifiers can closely match the performance of\nfine-tuned LLMs. We employ feature selection methods to derive the most crucial\nfeatures in the process of empathy scoring. Our work provides a new perspective\ntoward understanding LLM empathy scoring and helps the LLM community explore\nthe potential of LLM scoring in social science studies.", "paper_summary_zh": "近年來，大型語言模型 (LLM) 在完成複雜任務的能力上變得越來越強大。其中一項 LLM 常被用於執行的工作便是評分，也就是將某個標的從特定範圍中賦予一個數值。在本文中，我們致力於了解 LLM 如何評分，特別是在同理心評分的情境中。我們開發了一個新穎且全面的架構，用於探討 LLM 在對話中衡量和評分同理心的反應有多有效，以及可以採用哪些方法來加深我們對 LLM 評分的理解。我們的策略是利用明確且可解釋的功能來近似最先進且經過微調的 LLM 的效能。我們使用對話的各種功能來訓練分類器，包括嵌入、動機性訪談治療完整性 (MITI) 準則、LLM 提出的同理心明確子因子組，以及 MITI 準則和明確子因子的組合。我們的結果顯示，僅使用嵌入時，就有可能達到接近一般 LLM 的效能，而當使用 LLM 評分的 MITI 準則和明確子因子時，訓練出的分類器可以緊密匹配經過微調的 LLM 的效能。我們採用特徵選擇方法來推導同理心評分過程中最重要的特徵。我們的研究為理解 LLM 同理心評分提供了新的觀點，並幫助 LLM 社群探索 LLM 評分在社會科學研究中的潛力。", "author": "Henry J. Xie et.al.", "authors": "Henry J. Xie, Jinghan Zhang, Xinhao Zhang, Kunpeng Liu", "id": "2412.20264v1", "paper_url": "http://arxiv.org/abs/2412.20264v1", "repo": "null"}}