{"2407.15734": {"publish_time": "2024-07-22", "title": "TaskGen: A Task-Based, Memory-Infused Agentic Framework using StrictJSON", "paper_summary": "TaskGen is an open-sourced agentic framework which uses an Agent to solve an\narbitrary task by breaking them down into subtasks. Each subtask is mapped to\nan Equipped Function or another Agent to execute. In order to reduce verbosity\n(and hence token usage), TaskGen uses StrictJSON that ensures JSON output from\nthe Large Language Model (LLM), along with additional features such as type\nchecking and iterative error correction. Key to the philosophy of TaskGen is\nthe management of information/memory on a need-to-know basis. We empirically\nevaluate TaskGen on various environments such as 40x40 dynamic maze navigation\nwith changing obstacle locations (100% solve rate), TextWorld escape room\nsolving with dense rewards and detailed goals (96% solve rate), web browsing\n(69% of actions successful), solving the MATH dataset (71% solve rate over 100\nLevel-5 problems), Retrieval Augmented Generation on NaturalQuestions dataset\n(F1 score of 47.03%)", "paper_summary_zh": "TaskGen 是一個開源的代理框架，它使用一個代理來解決任意的任務，方法是將它們分解成子任務。每個子任務都對應到一個裝備功能或另一個代理來執行。為了減少冗長（因此減少令牌使用），TaskGen 使用 StrictJSON，它確保大型語言模型 (LLM) 的 JSON 輸出，以及類型檢查和迭代錯誤修正等額外功能。TaskGen 的哲學關鍵在於根據需要知道來管理資訊/記憶體。我們在各種環境中對 TaskGen 進行經驗評估，例如 40x40 動態迷宮導航，障礙物位置會改變（100% 解決率）、TextWorld 密室逃脫，有密集的獎勵和詳細的目標（96% 解決率）、網頁瀏覽（69% 的動作成功）、解決 MATH 資料集（超過 100 個 5 級問題的 71% 解決率）、自然問題資料集上的檢索擴充生成（F1 分數為 47.03%）", "author": "John Chong Min Tan et.al.", "authors": "John Chong Min Tan, Prince Saroj, Bharat Runwal, Hardik Maheshwari, Brian Lim Yi Sheng, Richard Cottrill, Alankrit Chona, Ambuj Kumar, Mehul Motani", "id": "2407.15734v1", "paper_url": "http://arxiv.org/abs/2407.15734v1", "repo": "null"}}