{"2409.11638": {"publish_time": "2024-09-18", "title": "BanStereoSet: A Dataset to Measure Stereotypical Social Biases in LLMs for Bangla", "paper_summary": "This study presents BanStereoSet, a dataset designed to evaluate\nstereotypical social biases in multilingual LLMs for the Bangla language. In an\neffort to extend the focus of bias research beyond English-centric datasets, we\nhave localized the content from the StereoSet, IndiBias, and Kamruzzaman et.\nal.'s datasets, producing a resource tailored to capture biases prevalent\nwithin the Bangla-speaking community. Our BanStereoSet dataset consists of\n1,194 sentences spanning 9 categories of bias: race, profession, gender,\nageism, beauty, beauty in profession, region, caste, and religion. This dataset\nnot only serves as a crucial tool for measuring bias in multilingual LLMs but\nalso facilitates the exploration of stereotypical bias across different social\ncategories, potentially guiding the development of more equitable language\ntechnologies in Bangladeshi contexts. Our analysis of several language models\nusing this dataset indicates significant biases, reinforcing the necessity for\nculturally and linguistically adapted datasets to develop more equitable\nlanguage technologies.", "paper_summary_zh": "本研究提出 BanStereoSet，一種資料集，用於評估孟加拉語多語言 LLM 中的刻板社會偏見。為了將偏見研究的重點擴展到以英語為中心的資料集之外，我們已將 StereoSet、IndiBias 和 Kamruzzaman 等人的資料集中的內容在地化，製作出一份量身打造的資源，用於捕捉孟加拉語社群中普遍存在的偏見。我們的 BanStereoSet 資料集包含 1,194 個句子，涵蓋 9 類偏見：種族、職業、性別、年齡歧視、美貌、職業中的美貌、地區、種姓和宗教。此資料集不僅可作為衡量多語言 LLM 中偏見的重要工具，而且有助於探索不同社會類別中的刻板偏見，並可能指導在孟加拉國背景下開發更公平的語言技術。我們使用此資料集對多個語言模型進行分析，結果顯示出顯著的偏見，這強化了開發更公平的語言技術，需要採用文化和語言適應資料集的必要性。", "author": "Mahammed Kamruzzaman et.al.", "authors": "Mahammed Kamruzzaman, Abdullah Al Monsur, Shrabon Das, Enamul Hassan, Gene Louis Kim", "id": "2409.11638v1", "paper_url": "http://arxiv.org/abs/2409.11638v1", "repo": "null"}}