{"2505.00684": {"publish_time": "2025-05-01", "title": "Visual Test-time Scaling for GUI Agent Grounding", "paper_summary": "We introduce RegionFocus, a visual test-time scaling approach for Vision\nLanguage Model Agents. Understanding webpages is challenging due to the visual\ncomplexity of GUI images and the large number of interface elements, making\naccurate action selection difficult. Our approach dynamically zooms in on\nrelevant regions, reducing background clutter and improving grounding accuracy.\nTo support this process, we propose an image-as-map mechanism that visualizes\nkey landmarks at each step, providing a transparent action record and enables\nthe agent to effectively choose among action candidates. Even with a simple\nregion selection strategy, we observe significant performance gains of 28+\\% on\nScreenspot-pro and 24+\\% on WebVoyager benchmarks on top of two\nstate-of-the-art open vision language model agents, UI-TARS and Qwen2.5-VL,\nhighlighting the effectiveness of visual test-time scaling in interactive\nsettings. We achieve a new state-of-the-art grounding performance of 61.6\\% on\nthe ScreenSpot-Pro benchmark by applying RegionFocus to a Qwen2.5-VL-72B model.\nOur code will be released publicly at https://github.com/tiangeluo/RegionFocus.", "paper_summary_zh": "我們推出 RegionFocus，一種適用於視覺語言模型代理的視覺測試時縮放方法。理解網頁具有挑戰性，因為 GUI 圖像的視覺複雜性和大量的界面元素，使得準確的動作選擇變得困難。我們的方法會動態放大相關區域，減少背景雜訊並提高基礎準確性。為了支持這個過程，我們提出了一種圖像即地圖機制，可以在每個步驟中視覺化關鍵地標，提供透明的動作記錄，並使代理能夠有效地在動作候選者中進行選擇。即使使用簡單的區域選擇策略，我們也觀察到在兩個最先進的開放視覺語言模型代理 UI-TARS 和 Qwen2.5-VL 的基礎上，在 Screenspot-pro 和 WebVoyager 基準測試中分別獲得了 28+% 和 24+% 的顯著性能提升，突出了視覺測試時縮放在交互式環境中的有效性。通過將 RegionFocus 應用於 Qwen2.5-VL-72B 模型，我們在 ScreenSpot-Pro 基準測試中達到了 61.6% 的最新 grounding 性能。我們的程式碼將在 https://github.com/tiangeluo/RegionFocus 公開發布。\n", "author": "Tiange Luo et.al.", "authors": "Tiange Luo, Lajanugen Logeswaran, Justin Johnson, Honglak Lee", "id": "2505.00684v1", "paper_url": "http://arxiv.org/abs/2505.00684v1", "repo": "null"}}