{"2405.09477": {"publish_time": "2024-05-15", "title": "Harmonizing Human Insights and AI Precision: Hand in Hand for Advancing Knowledge Graph Task", "paper_summary": "Knowledge graph embedding (KGE) has caught significant interest for its\neffectiveness in knowledge graph completion (KGC), specifically link prediction\n(LP), with recent KGE models cracking the LP benchmarks. Despite the rapidly\ngrowing literature, insufficient attention has been paid to the cooperation\nbetween humans and AI on KG. However, humans' capability to analyze graphs\nconceptually may further improve the efficacy of KGE models with semantic\ninformation. To this effect, we carefully designed a human-AI team (HAIT)\nsystem dubbed KG-HAIT, which harnesses the human insights on KG by leveraging\nfully human-designed ad-hoc dynamic programming (DP) on KG to produce human\ninsightful feature (HIF) vectors that capture the subgraph structural feature\nand semantic similarities. By integrating HIF vectors into the training of KGE\nmodels, notable improvements are observed across various benchmarks and\nmetrics, accompanied by accelerated model convergence. Our results underscore\nthe effectiveness of human-designed DP in the task of LP, emphasizing the\npivotal role of collaboration between humans and AI on KG. We open avenues for\nfurther exploration and innovation through KG-HAIT, paving the way towards more\neffective and insightful KG analysis techniques.", "paper_summary_zh": "知識圖譜嵌入（KGE）因其在知識圖譜完成（KGC）中的有效性而引起極大興趣，特別是連結預測（LP），最近的 KGE 模型破解了 LP 基準。儘管文獻快速增長，但對於人類與 AI 在 KG 上的合作卻關注不足。然而，人類分析圖形概念的能力可能會進一步提高具有語義資訊的 KGE 模型的功效。為此，我們仔細設計了一個人類-AI 團隊（HAIT）系統，稱為 KG-HAIT，它透過充分利用人類設計的臨時動態規劃（DP）在 KG 上來利用人類對 KG 的見解，以產生擷取子圖結構特徵和語義相似性的具有人類洞察力的特徵（HIF）向量。透過將 HIF 向量整合到 KGE 模型的訓練中，在各種基準和指標中觀察到顯著的改進，並伴隨著模型收斂速度加快。我們的結果強調了人類設計的 DP 在 LP 任務中的有效性，強調了人類與 AI 在 KG 上協作的关键作用。我們透過 KG-HAIT 開闢了進一步探索和創新的途徑，為更有效且有見地的 KG 分析技術鋪路。", "author": "Shurong Wang et.al.", "authors": "Shurong Wang, Yufei Zhang, Xuliang Huang, Hongwei Wang", "id": "2405.09477v1", "paper_url": "http://arxiv.org/abs/2405.09477v1", "repo": "null"}}