{"2407.14486": {"publish_time": "2024-07-19", "title": "Explainable Post hoc Portfolio Management Financial Policy of a Deep Reinforcement Learning agent", "paper_summary": "Financial portfolio management investment policies computed quantitatively by\nmodern portfolio theory techniques like the Markowitz model rely on a set on\nassumptions that are not supported by data in high volatility markets. Hence,\nquantitative researchers are looking for alternative models to tackle this\nproblem. Concretely, portfolio management is a problem that has been\nsuccessfully addressed recently by Deep Reinforcement Learning (DRL)\napproaches. In particular, DRL algorithms train an agent by estimating the\ndistribution of the expected reward of every action performed by an agent given\nany financial state in a simulator. However, these methods rely on Deep Neural\nNetworks model to represent such a distribution, that although they are\nuniversal approximator models, they cannot explain its behaviour, given by a\nset of parameters that are not interpretable. Critically, financial investors\npolicies require predictions to be interpretable, so DRL agents are not suited\nto follow a particular policy or explain their actions. In this work, we\ndeveloped a novel Explainable Deep Reinforcement Learning (XDRL) approach for\nportfolio management, integrating the Proximal Policy Optimization (PPO) with\nthe model agnostic explainable techniques of feature importance, SHAP and LIME\nto enhance transparency in prediction time. By executing our methodology, we\ncan interpret in prediction time the actions of the agent to assess whether\nthey follow the requisites of an investment policy or to assess the risk of\nfollowing the agent suggestions. To the best of our knowledge, our proposed\napproach is the first explainable post hoc portfolio management financial\npolicy of a DRL agent. We empirically illustrate our methodology by\nsuccessfully identifying key features influencing investment decisions, which\ndemonstrate the ability to explain the agent actions in prediction time.", "paper_summary_zh": "現代投資組合理論技術（例如 Markowitz 模型）計算出的財務投資組合管理投資政策依賴於一組在高波動市場中不受數據支持的假設。因此，量化研究人員正在尋找替代模型來解決此問題。具體來說，投資組合管理是一個問題，最近已由深度強化學習 (DRL) 方法成功解決。特別是，DRL 演算法透過估計代理人在模擬器中給定任何財務狀態時執行的每個動作的預期獎勵分佈來訓練代理人。然而，這些方法依賴於深度神經網路模型來表示此類分佈，雖然它們是通用逼近模型，但它們無法解釋其行為，這由一組不可解釋的參數給出。至關重要的是，金融投資者的政策要求預測具有可解釋性，因此 DRL 代理人不適合遵循特定政策或解釋其行為。在這項工作中，我們開發了一種新穎的可解釋深度強化學習 (XDRL) 投資組合管理方法，將近端策略最佳化 (PPO) 與特徵重要性、SHAP 和 LIME 的模型不可知可解釋技術整合在一起，以增強預測時間的透明度。透過執行我們的 methodology，我們可以在預測時間解釋代理人的行為，以評估它們是否遵循投資政策的要求或評估遵循代理人建議的風險。據我們所知，我們提出的方法是 DRL 代理人的第一個可解釋的後設投資組合管理財務政策。我們透過成功識別影響投資決策的關鍵特徵來實證說明我們的 methodology，這證明了在預測時間解釋代理人行為的能力。", "author": "Alejandra de la Rica Escudero et.al.", "authors": "Alejandra de la Rica Escudero, Eduardo C. Garrido-Merchan, Maria Coronado-Vaca", "id": "2407.14486v1", "paper_url": "http://arxiv.org/abs/2407.14486v1", "repo": "https://github.com/aleedelarica/XDRL-for-finance"}}