{"2502.13959": {"publish_time": "2025-02-19", "title": "LIDDIA: Language-based Intelligent Drug Discovery Agent", "paper_summary": "Drug discovery is a long, expensive, and complex process, relying heavily on\nhuman medicinal chemists, who can spend years searching the vast space of\npotential therapies. Recent advances in artificial intelligence for chemistry\nhave sought to expedite individual drug discovery tasks; however, there remains\na critical need for an intelligent agent that can navigate the drug discovery\nprocess. Towards this end, we introduce LIDDiA, an autonomous agent capable of\nintelligently navigating the drug discovery process in silico. By leveraging\nthe reasoning capabilities of large language models, LIDDiA serves as a\nlow-cost and highly-adaptable tool for autonomous drug discovery. We\ncomprehensively examine LIDDiA, demonstrating that (1) it can generate\nmolecules meeting key pharmaceutical criteria on over 70% of 30 clinically\nrelevant targets, (2) it intelligently balances exploration and exploitation in\nthe chemical space, and (3) it can identify promising novel drug candidates on\nEGFR, a critical target for cancers.", "paper_summary_zh": "藥物發現是一個漫長、昂貴且複雜的過程，高度依賴人類醫學化學家，他們可能花費數年時間搜尋潛在療法中的廣大空間。最近人工智慧在化學領域的進展試圖加速個別藥物發現任務；然而，對於能夠引導藥物發現過程的智慧代理人仍有迫切需求。為此，我們引入了 LIDDiA，這是一個自主代理人，能夠在電腦模擬中智慧地引導藥物發現過程。透過利用大型語言模型的推理能力，LIDDiA 成為自主藥物發現的低成本且高度適應性工具。我們全面檢驗 LIDDiA，證明 (1) 它可以在 30 個臨床相關目標中的 70% 以上產生符合關鍵藥物標準的分子，(2) 它在化學空間中智慧地平衡探索和利用，(3) 它可以識別出 EGFR（癌症的重要目標）上的有希望的新藥候選物。", "author": "Reza Averly et.al.", "authors": "Reza Averly, Frazier N. Baker, Xia Ning", "id": "2502.13959v1", "paper_url": "http://arxiv.org/abs/2502.13959v1", "repo": "null"}}