{"2208.03099": {"publish_time": "2022-08-05", "title": "Planning and Scheduling in Digital Health with Answer Set Programming", "paper_summary": "In the hospital world there are several complex combinatory problems, and\nsolving these problems is important to increase the degree of patients'\nsatisfaction and the quality of care offered. The problems in the healthcare\nare complex since to solve them several constraints and different type of\nresources should be taken into account. Moreover, the solutions must be\nevaluated in a small amount of time to ensure the usability in real scenarios.\nWe plan to propose solutions to these kind of problems both expanding already\ntested solutions and by modelling solutions for new problems, taking into\naccount the literature and by using real data when available. Solving these\nkind of problems is important but, since the European Commission established\nwith the General Data Protection Regulation that each person has the right to\nask for explanation of the decision taken by an AI, without developing\nExplainability methodologies the usage of AI based solvers e.g. those based on\nAnswer Set programming will be limited. Thus, another part of the research will\nbe devoted to study and propose new methodologies for explaining the solutions\nobtained.", "paper_summary_zh": "在醫院的世界中，有許多複雜的組合問題，解決這些問題對於提高患者的滿意度和所提供的照護品質非常重要。醫療保健中的問題很複雜，因為要解決這些問題，必須考慮到許多限制和不同類型的資源。此外，必須在短時間內評估解決方案，以確保在實際情況中可用。我們計畫提出解決這類問題的方案，方法是擴展已經測試過的解決方案，並針對新問題建構解決方案模型，同時考量文獻資料，並在可用時使用真實資料。解決這類問題很重要，但由於歐盟執委會制定了《一般資料保護法規》，規定每個人都有權要求解釋人工智慧做出的決定，因此在未發展出可解釋性方法的情況下，基於人工智慧的求解器（例如基於答案設定程式設計的求解器）的使用將受到限制。因此，研究的另一部分將致力於研究和提出新的方法，以說明所獲得的解決方案。", "author": "Marco Mochi et.al.", "authors": "Marco Mochi", "id": "2208.03099v1", "paper_url": "http://arxiv.org/abs/2208.03099v1", "repo": "null"}}