{"2410.18955": {"publish_time": "2024-10-24", "title": "BioMistral-NLU: Towards More Generalizable Medical Language Understanding through Instruction Tuning", "paper_summary": "Large language models (LLMs) such as ChatGPT are fine-tuned on large and\ndiverse instruction-following corpora, and can generalize to new tasks.\nHowever, those instruction-tuned LLMs often perform poorly in specialized\nmedical natural language understanding (NLU) tasks that require domain\nknowledge, granular text comprehension, and structured data extraction. To\nbridge the gap, we: (1) propose a unified prompting format for 7 important NLU\ntasks, % through span extraction and multi-choice question-answering (QA), (2)\ncurate an instruction-tuning dataset, MNLU-Instruct, utilizing diverse existing\nopen-source medical NLU corpora, and (3) develop BioMistral-NLU, a\ngeneralizable medical NLU model, through fine-tuning BioMistral on\nMNLU-Instruct. We evaluate BioMistral-NLU in a zero-shot setting, across 6\nimportant NLU tasks, from two widely adopted medical NLU benchmarks: Biomedical\nLanguage Understanding Evaluation (BLUE) and Biomedical Language Understanding\nand Reasoning Benchmark (BLURB). Our experiments show that our BioMistral-NLU\noutperforms the original BioMistral, as well as the proprietary LLMs - ChatGPT\nand GPT-4. Our dataset-agnostic prompting strategy and instruction tuning step\nover diverse NLU tasks enhance LLMs' generalizability across diverse medical\nNLU tasks. Our ablation experiments show that instruction-tuning on a wider\nvariety of tasks, even when the total number of training instances remains\nconstant, enhances downstream zero-shot generalization.", "paper_summary_zh": "大型語言模型 (LLM) 例如 ChatGPT 會針對大量且多樣化的指令遵循語料庫進行微調，並可概括到新的任務。\n然而，經過指令微調的 LLM 在需要領域知識、細緻文字理解和結構化數據萃取的專業醫療自然語言理解 (NLU) 任務中通常表現不佳。為縮小差距，我們：(1) 為 7 項重要的 NLU 任務提出統一的提示格式，透過區間萃取和多選題問答 (QA)，(2) 策劃指令微調資料集 MNLU-Instruct，利用現有的各種開源醫療 NLU 語料庫，以及 (3) 開發 BioMistral-NLU，一種可概括的醫療 NLU 模型，透過在 MNLU-Instruct 上對 BioMistral 進行微調。我們在零次學習設定中評估 BioMistral-NLU，涵蓋 6 項重要的 NLU 任務，來自兩個廣泛採用的醫療 NLU 基準：生物醫學語言理解評估 (BLUE) 和生物醫學語言理解與推理基準 (BLURB)。我們的實驗顯示，我們的 BioMistral-NLU 優於原始的 BioMistral，以及專有的 LLM - ChatGPT 和 GPT-4。我們與資料集無關的提示策略和指令微調步驟，可增強 LLM 在各種醫療 NLU 任務中的概括性。我們的消融實驗顯示，即使訓練實例的總數保持不變，在更多樣化的任務上進行指令微調，也能增強下游的零次學習概括性。", "author": "Yujuan Velvin Fu et.al.", "authors": "Yujuan Velvin Fu, Giridhar Kaushik Ramachandran, Namu Park, Kevin Lybarger, Fei Xia, Ozlem Uzuner, Meliha Yetisgen", "id": "2410.18955v1", "paper_url": "http://arxiv.org/abs/2410.18955v1", "repo": "null"}}