{"2406.11460": {"publish_time": "2024-06-17", "title": "TRACE the Evidence: Constructing Knowledge-Grounded Reasoning Chains for Retrieval-Augmented Generation", "paper_summary": "Retrieval-augmented generation (RAG) offers an effective approach for\naddressing question answering (QA) tasks. However, the imperfections of the\nretrievers in RAG models often result in the retrieval of irrelevant\ninformation, which could introduce noises and degrade the performance,\nespecially when handling multi-hop questions that require multiple steps of\nreasoning. To enhance the multi-hop reasoning ability of RAG models, we propose\nTRACE. TRACE constructs knowledge-grounded reasoning chains, which are a series\nof logically connected knowledge triples, to identify and integrate supporting\nevidence from the retrieved documents for answering questions. Specifically,\nTRACE employs a KG Generator to create a knowledge graph (KG) from the\nretrieved documents, and then uses an Autoregressive Reasoning Chain\nConstructor to build reasoning chains. Experimental results on three multi-hop\nQA datasets show that TRACE achieves an average performance improvement of up\nto 14.03% compared to using all the retrieved documents. Moreover, the results\nindicate that using reasoning chains as context, rather than the entire\ndocuments, is often sufficient to correctly answer questions.", "paper_summary_zh": "检索增强生成 (RAG) 提供了一种解决问题解答 (QA) 任务的有效方法。然而，RAG 模型中的检索器的不完善通常会导致检索到不相关的讯息，这可能会引入杂讯并降低效能，尤其是在处理需要多步骤推理的多跳问题时。为了增强 RAG 模型的多跳推理能力，我们提出了 TRACE。TRACE 构建了以知识为基础的推理链，这是一系列逻辑连接的知识三元组，以识别和整合来自检索到的文件以回答问题的支持证据。具体来说，TRACE 使用 KG 生成器从检索到的文件中创建知识图 (KG)，然后使用自回归推理链构造器构建推理链。在三个多跳 QA 数据集上的实验结果表明，与使用所有检索到的文件相比，TRACE 的平均性能提升高达 14.03%。此外，结果表明，使用推理链作为上下文，而不是整个文件，通常足以正确回答问题。", "author": "Jinyuan Fang et.al.", "authors": "Jinyuan Fang, Zaiqiao Meng, Craig Macdonald", "id": "2406.11460v1", "paper_url": "http://arxiv.org/abs/2406.11460v1", "repo": "https://github.com/jyfang6/trace"}}