{"2406.14883": {"publish_time": "2024-06-21", "title": "OATH-Frames: Characterizing Online Attitudes Towards Homelessness with LLM Assistants", "paper_summary": "Warning: Contents of this paper may be upsetting.\n  Public attitudes towards key societal issues, expressed on online media, are\nof immense value in policy and reform efforts, yet challenging to understand at\nscale. We study one such social issue: homelessness in the U.S., by leveraging\nthe remarkable capabilities of large language models to assist social work\nexperts in analyzing millions of posts from Twitter. We introduce a framing\ntypology: Online Attitudes Towards Homelessness (OATH) Frames: nine\nhierarchical frames capturing critiques, responses and perceptions. We release\nannotations with varying degrees of assistance from language models, with\nimmense benefits in scaling: 6.5x speedup in annotation time while only\nincurring a 3 point F1 reduction in performance with respect to the domain\nexperts. Our experiments demonstrate the value of modeling OATH-Frames over\nexisting sentiment and toxicity classifiers. Our large-scale analysis with\npredicted OATH-Frames on 2.4M posts on homelessness reveal key trends in\nattitudes across states, time periods and vulnerable populations, enabling new\ninsights on the issue. Our work provides a general framework to understand\nnuanced public attitudes at scale, on issues beyond homelessness.", "paper_summary_zh": "警告：本文內容可能令人不安。\n在線上媒體上表達的對社會議題的公眾態度，在政策和改革工作中具有極高的價值，但難以大規模理解。我們研究了一個這樣的社會議題：美國的無家可歸問題，利用大型語言模型的非凡能力來協助社會工作專家分析來自 Twitter 的數百萬條貼文。我們引入了一個框架類型：對無家可歸者的線上態度（OATH）框架：九個層級框架，涵蓋批評、回應和觀點。我們發布了在語言模型的幫助下不同程度的註解，在擴展方面具有巨大的好處：註解時間加快了 6.5 倍，而對領域專家的執行效能僅降低了 3 點 F1。我們的實驗證明了對 OATH 框架建模比現有的情緒和毒性分類器更有價值。我們對 240 萬篇關於無家可歸者的貼文進行大規模分析，並預測了 OATH 框架，揭示了各州、時間段和弱勢群體在態度方面的關鍵趨勢，從而對這個問題有了新的見解。我們的研究提供了一個通用的框架，可以大規模理解對無家可歸問題以外的議題的微妙的公眾態度。", "author": "Jaspreet Ranjit et.al.", "authors": "Jaspreet Ranjit, Brihi Joshi, Rebecca Dorn, Laura Petry, Olga Koumoundouros, Jayne Bottarini, Peichen Liu, Eric Rice, Swabha Swayamdipta", "id": "2406.14883v1", "paper_url": "http://arxiv.org/abs/2406.14883v1", "repo": "null"}}