{"2411.14907": {"publish_time": "2024-11-22", "title": "DAIRHuM: A Platform for Directly Aligning AI Representations with Human Musical Judgments applied to Carnatic Music", "paper_summary": "Quantifying and aligning music AI model representations with human behavior\nis an important challenge in the field of MIR. This paper presents a platform\nfor exploring the Direct alignment between AI music model Representations and\nHuman Musical judgments (DAIRHuM). It is designed to enable musicians and\nexperimentalists to label similarities in a dataset of music recordings, and\nexamine a pre-trained model's alignment with their labels using quantitative\nscores and visual plots. DAIRHuM is applied to analyze alignment between NSynth\nrepresentations, and a rhythmic duet between two percussionists in a Carnatic\nquartet ensemble, an example of a genre where annotated data is scarce and\nassessing alignment is non-trivial. The results demonstrate significant\nfindings on model alignment with human judgments of rhythmic harmony, while\nhighlighting key differences in rhythm perception and music similarity\njudgments specific to Carnatic music. This work is among the first efforts to\nenable users to explore human-AI model alignment in Carnatic music and advance\nMIR research in Indian music while dealing with data scarcity and cultural\nspecificity. The development of this platform provides greater accessibility to\nmusic AI tools for under-represented genres.", "paper_summary_zh": "量化和调整音乐 AI 模型表示与人类行为在 MIR 领域是一项重要的挑战。本文提供了一个平台，用于探索 AI 音乐模型表示与人类音乐判断（DAIRHuM）之间的直接对齐。它旨在使音乐家和实验主义者能够标记音乐录音数据集中的相似性，并使用定量分数和可视化图表检查预训练模型与其标签的对齐方式。DAIRHuM 用于分析 NSynth 表示之间的对齐，以及卡纳蒂克四重奏合奏中两位打击乐手之间的节奏二重奏，这是一个注释数据稀缺且评估对齐并非易事的流派示例。结果展示了模型与人类对节奏和声判断对齐的重大发现，同时突出了卡纳蒂克音乐特有的节奏感知和音乐相似性判断中的关键差异。这项工作是首次让用户探索卡纳蒂克音乐中的人工智能模型对齐并推进印度音乐的 MIR 研究，同时处理数据稀缺和文化特异性。该平台的开发为代表性不足的流派提供了更广泛的音乐 AI 工具的可访问性。", "author": "Prashanth Thattai Ravikumar et.al.", "authors": "Prashanth Thattai Ravikumar", "id": "2411.14907v1", "paper_url": "http://arxiv.org/abs/2411.14907v1", "repo": "null"}}