{"2410.13716": {"publish_time": "2024-10-17", "title": "MIRAGE-Bench: Automatic Multilingual Benchmark Arena for Retrieval-Augmented Generation Systems", "paper_summary": "Traditional Retrieval-Augmented Generation (RAG) benchmarks rely on different\nheuristic-based metrics for evaluation, but these require human preferences as\nground truth for reference. In contrast, arena-based benchmarks, where two\nmodels compete each other, require an expensive Large Language Model (LLM) as a\njudge for a reliable evaluation. We present an easy and efficient technique to\nget the best of both worlds. The idea is to train a learning to rank model as a\n\"surrogate\" judge using RAG-based evaluation heuristics as input, to produce a\nsynthetic arena-based leaderboard. Using this idea, We develop MIRAGE-Bench, a\nstandardized arena-based multilingual RAG benchmark for 18 diverse languages on\nWikipedia. The benchmark is constructed using MIRACL, a retrieval dataset, and\nextended for multilingual generation evaluation. MIRAGE-Bench evaluates RAG\nextensively coupling both heuristic features and LLM as a judge evaluator. In\nour work, we benchmark 19 diverse multilingual-focused LLMs, and achieve a high\ncorrelation (Kendall Tau ($\\tau$) = 0.909) using our surrogate judge learned\nusing heuristic features with pairwise evaluations and between GPT-4o as a\nteacher on the MIRAGE-Bench leaderboard using the Bradley-Terry framework. We\nobserve proprietary and large open-source LLMs currently dominate in\nmultilingual RAG. MIRAGE-Bench is available at:\nhttps://github.com/vectara/mirage-bench.", "paper_summary_zh": "傳統的檢索增強生成（RAG）基準依賴於不同的基於啟發式的指標進行評估，但這些指標需要人類偏好作為參考的真實依據。相比之下，競技場基準，其中兩個模型相互競爭，需要一個昂貴的大語言模型（LLM）作為一個評委，以進行可靠的評估。我們提出了一種輕鬆且有效的方法，以獲得兩全其美的效果。這個想法是訓練一個學習對模型進行排名，作為一個「代理」評委，使用基於 RAG 的評估啟發式方法作為輸入，以產生一個綜合的競技場排行榜。利用這個想法，我們開發了 MIRAGE-Bench，一個標準化的基於競技場的多語言 RAG 基準，適用於維基百科上的 18 種不同的語言。該基準是使用檢索數據集 MIRACL 構建的，並擴展用於多語言生成評估。MIRAGE-Bench 對 RAG 進行廣泛評估，同時將啟發式特徵和 LLM 作為評委評估器結合起來。在我們的研究中，我們對 19 個不同的多語言 LLM 進行了基準測試，並使用我們的代理評委學習的啟發式特徵和成對評估，以及使用 Bradley-Terry 框架在 MIRAGE-Bench 排行榜上將 GPT-4o 作為教師，實現了很高的相關性（Kendall Tau（τ）= 0.909）。我們觀察到專有的大型開源 LLM 目前在多語言 RAG 中佔據主導地位。MIRAGE-Bench 可在以下網址獲得：https://github.com/vectara/mirage-bench。", "author": "Nandan Thakur et.al.", "authors": "Nandan Thakur, Suleman Kazi, Ge Luo, Jimmy Lin, Amin Ahmad", "id": "2410.13716v1", "paper_url": "http://arxiv.org/abs/2410.13716v1", "repo": "https://github.com/vectara/mirage-bench"}}