{"2411.13262": {"publish_time": "2024-11-20", "title": "FASTNav: Fine-tuned Adaptive Small-language-models Trained for Multi-point Robot Navigation", "paper_summary": "With the rapid development of large language models (LLM), robots are\nstarting to enjoy the benefits of new interaction methods that large language\nmodels bring. Because edge computing fulfills the needs for rapid response,\nprivacy, and network autonomy, we believe it facilitates the extensive\ndeployment of large models for robot navigation across various industries. To\nenable local deployment of language models on edge devices, we adopt some model\nboosting methods. In this paper, we propose FASTNav - a method for boosting\nlightweight LLMs, also known as small language models (SLMs), for robot\nnavigation. The proposed method contains three modules: fine-tuning,\nteacher-student iteration, and language-based multi-point robot navigation. We\ntrain and evaluate models with FASTNav in both simulation and real robots,\nproving that we can deploy them with low cost, high accuracy and low response\ntime. Compared to other model compression methods, FASTNav shows potential in\nthe local deployment of language models and tends to be a promising solution\nfor language-guided robot navigation on edge devices.", "paper_summary_zh": "隨著大型語言模型（LLM）的快速發展，機器人開始享受大型語言模型帶來的新互動方式的優勢。由於邊緣運算滿足了快速響應、隱私和網路自主性的需求，我們相信它有助於在各個產業中廣泛部署大型模型以進行機器人導航。為了在邊緣裝置上實現語言模型的本地部署，我們採用了一些模型提升方法。在本文中，我們提出 FASTNav - 一種提升輕量級 LLM（也稱為小型語言模型，SLM）的方法，用於機器人導航。所提出的方法包含三個模組：微調、教師-學生反覆運算，以及基於語言的多點機器人導航。我們在模擬和真實機器人中使用 FASTNav 訓練和評估模型，證明我們可以低成本、高準確度和低回應時間部署它們。與其他模型壓縮方法相比，FASTNav 在語言模型的本地部署中顯示出潛力，並且趨勢成為邊緣裝置上語言導引機器人導航的有前途的解決方案。", "author": "Yuxuan Chen et.al.", "authors": "Yuxuan Chen, Yixin Han, Xiao Li", "id": "2411.13262v1", "paper_url": "http://arxiv.org/abs/2411.13262v1", "repo": "null"}}