{"2405.02583": {"publish_time": "2024-05-04", "title": "Explainable Interface for Human-Autonomy Teaming: A Survey", "paper_summary": "Nowadays, large-scale foundation models are being increasingly integrated\ninto numerous safety-critical applications, including human-autonomy teaming\n(HAT) within transportation, medical, and defence domains. Consequently, the\ninherent 'black-box' nature of these sophisticated deep neural networks\nheightens the significance of fostering mutual understanding and trust between\nhumans and autonomous systems. To tackle the transparency challenges in HAT,\nthis paper conducts a thoughtful study on the underexplored domain of\nExplainable Interface (EI) in HAT systems from a human-centric perspective,\nthereby enriching the existing body of research in Explainable Artificial\nIntelligence (XAI). We explore the design, development, and evaluation of EI\nwithin XAI-enhanced HAT systems. To do so, we first clarify the distinctions\nbetween these concepts: EI, explanations and model explainability, aiming to\nprovide researchers and practitioners with a structured understanding. Second,\nwe contribute to a novel framework for EI, addressing the unique challenges in\nHAT. Last, our summarized evaluation framework for ongoing EI offers a holistic\nperspective, encompassing model performance, human-centered factors, and group\ntask objectives. Based on extensive surveys across XAI, HAT, psychology, and\nHuman-Computer Interaction (HCI), this review offers multiple novel insights\ninto incorporating XAI into HAT systems and outlines future directions.", "paper_summary_zh": "<paragraph>如今，大规模基础模型正越来越多地集成到许多安全关键型应用程序中，包括交通、医疗和国防领域中的人机自主协作 (HAT)。因此，这些复杂深度神经网络固有的“黑匣子”性质提高了在人和自主系统之间培养相互理解和信任的重要性。为了应对 HAT 中的透明性挑战，本文从以人为本的角度对 HAT 系统中未被充分探索的解释性界面 (EI) 领域进行了周密的探索，从而丰富了可解释人工智能 (XAI) 的现有研究成果。我们在 XAI 增强型 HAT 系统中探索 EI 的设计、开发和评估。为此，我们首先阐明了这些概念之间的区别：EI、解释和模型可解释性，旨在为研究人员和从业者提供结构化的理解。其次，我们为 EI 贡献了一个新颖的框架，解决了 HAT 中的独特挑战。最后，我们针对正在进行的 EI 总结的评估框架提供了一个整体的视角，包括模型性能、以人为中心的因素和组任务目标。基于对 XAI、HAT、心理学和人机交互 (HCI) 的广泛调查，本综述提供了将 XAI 纳入 HAT 系统的多个新颖见解，并概述了未来的方向。</paragraph>", "author": "Xiangqi Kong et.al.", "authors": "Xiangqi Kong, Yang Xing, Antonios Tsourdos, Ziyue Wang, Weisi Guo, Adolfo Perrusquia, Andreas Wikander", "id": "2405.02583v1", "paper_url": "http://arxiv.org/abs/2405.02583v1", "repo": "null"}}