{"2408.03524": {"publish_time": "2024-08-07", "title": "EgyBERT: A Large Language Model Pretrained on Egyptian Dialect Corpora", "paper_summary": "This study presents EgyBERT, an Arabic language model pretrained on 10.4 GB\nof Egyptian dialectal texts. We evaluated EgyBERT's performance by comparing it\nwith five other multidialect Arabic language models across 10 evaluation\ndatasets. EgyBERT achieved the highest average F1-score of 84.25% and an\naccuracy of 87.33%, significantly outperforming all other comparative models,\nwith MARBERTv2 as the second best model achieving an F1-score 83.68% and an\naccuracy 87.19%. Additionally, we introduce two novel Egyptian dialectal\ncorpora: the Egyptian Tweets Corpus (ETC), containing over 34.33 million tweets\n(24.89 million sentences) amounting to 2.5 GB of text, and the Egyptian Forums\nCorpus (EFC), comprising over 44.42 million sentences (7.9 GB of text)\ncollected from various Egyptian online forums. Both corpora are used in\npretraining the new model, and they are the largest Egyptian dialectal corpora\nto date reported in the literature. Furthermore, this is the first study to\nevaluate the performance of various language models on Egyptian dialect\ndatasets, revealing significant differences in performance that highlight the\nneed for more dialect-specific models. The results confirm the effectiveness of\nEgyBERT model in processing and analyzing Arabic text expressed in Egyptian\ndialect, surpassing other language models included in the study. EgyBERT model\nis publicly available on \\url{https://huggingface.co/faisalq/EgyBERT}.", "paper_summary_zh": "本研究展示了 EgyBERT，這是一個在 10.4 GB 的埃及方言文本上預先訓練的阿拉伯語語言模型。我們透過與五個其他多方言阿拉伯語語言模型在 10 個評估資料集上進行比較，來評估 EgyBERT 的效能。EgyBERT 達到了最高的平均 F1 分數為 84.25% 和準確率為 87.33%，顯著優於所有其他比較模型，其中 MARBERTv2 作為第二好的模型，達到了 F1 分數 83.68% 和準確率 87.19%。此外，我們引入了兩個新穎的埃及方言語料庫：埃及推文語料庫 (ETC)，包含超過 3433 萬條推文（2489 萬個句子），相當於 2.5 GB 的文字，以及埃及論壇語料庫 (EFC)，包含超過 4442 萬個句子（7.9 GB 的文字），從各種埃及線上論壇收集而來。這兩個語料庫都用於預先訓練新模型，而且它們是迄今為止在文獻中報導的最大的埃及方言語料庫。此外，這是第一個評估各種語言模型在埃及方言資料集上的效能的研究，揭示了效能上的顯著差異，這突顯了對更多特定方言模型的需求。結果證實了 EgyBERT 模型在處理和分析以埃及方言表達的阿拉伯語文本方面的有效性，優於研究中包含的其他語言模型。EgyBERT 模型已公開發布在 \\url{https://huggingface.co/faisalq/EgyBERT}。", "author": "Faisal Qarah et.al.", "authors": "Faisal Qarah", "id": "2408.03524v1", "paper_url": "http://arxiv.org/abs/2408.03524v1", "repo": "null"}}