{"2501.11790": {"publish_time": "2025-01-20", "title": "Benchmarking Large Language Models via Random Variables", "paper_summary": "With the continuous advancement of large language models (LLMs) in\nmathematical reasoning, evaluating their performance in this domain has become\na prominent research focus. Recent studies have raised concerns about the\nreliability of current mathematical benchmarks, highlighting issues such as\nsimplistic design and potential data leakage. Therefore, creating a reliable\nbenchmark that effectively evaluates the genuine capabilities of LLMs in\nmathematical reasoning remains a significant challenge. To address this, we\npropose RV-Bench, a framework for Benchmarking LLMs via Random Variables in\nmathematical reasoning. Specifically, the background content of a random\nvariable question (RV question) mirrors the original problem in existing\nstandard benchmarks, but the variable combinations are randomized into\ndifferent values. LLMs must fully understand the problem-solving process for\nthe original problem to correctly answer RV questions with various combinations\nof variable values. As a result, the LLM's genuine capability in mathematical\nreasoning is reflected by its accuracy on RV-Bench. Extensive experiments are\nconducted with 29 representative LLMs across 900+ RV questions. A leaderboard\nfor RV-Bench ranks the genuine capability of these LLMs. Further analysis of\naccuracy dropping indicates that current LLMs still struggle with complex\nmathematical reasoning problems.", "paper_summary_zh": "隨著大型語言模型 (LLM) 在數學推理方面的持續進步，評估它們在這個領域的表現已成為一個重要的研究重點。最近的研究對當前數學基準的可靠性提出了疑慮，並強調了諸如設計過於簡化和潛在數據洩漏等問題。因此，建立一個可靠的基準，以有效評估 LLM 在數學推理中的真實能力，仍然是一項重大的挑戰。為了解決這個問題，我們提出了 RV-Bench，一個透過隨機變數對 LLM 進行基准測試的數學推理框架。具體來說，隨機變數問題 (RV 問題) 的背景內容反映了現有標準基準中的原始問題，但變數組合被隨機化為不同的值。LLM 必須充分理解原始問題的解題過程，才能正確回答具有各種變數值組合的 RV 問題。因此，LLM 在數學推理中的真實能力反映在其在 RV-Bench 上的準確度。使用 29 個具代表性的 LLM 對 900 多個 RV 問題進行了廣泛的實驗。RV-Bench 的排行榜對這些 LLM 的真實能力進行了排名。對準確度下降的進一步分析表明，當前的 LLM 仍然難以解決複雜的數學推理問題。", "author": "Zijin Hong et.al.", "authors": "Zijin Hong, Hao Wu, Su Dong, Junnan Dong, Yilin Xiao, Yujing Zhang, Zhu Wang, Feiran Huang, Linyi Li, Hongxia Yang, Xiao Huang", "id": "2501.11790v1", "paper_url": "http://arxiv.org/abs/2501.11790v1", "repo": "null"}}