{"2501.19316": {"publish_time": "2025-01-31", "title": "Reverse Probing: Evaluating Knowledge Transfer via Finetuned Task Embeddings for Coreference Resolution", "paper_summary": "In this work, we reimagine classical probing to evaluate knowledge transfer\nfrom simple source to more complex target tasks. Instead of probing frozen\nrepresentations from a complex source task on diverse simple target probing\ntasks (as usually done in probing), we explore the effectiveness of embeddings\nfrom multiple simple source tasks on a single target task. We select\ncoreference resolution, a linguistically complex problem requiring contextual\nunderstanding, as focus target task, and test the usefulness of embeddings from\ncomparably simpler tasks tasks such as paraphrase detection, named entity\nrecognition, and relation extraction. Through systematic experiments, we\nevaluate the impact of individual and combined task embeddings.\n  Our findings reveal that task embeddings vary significantly in utility for\ncoreference resolution, with semantic similarity tasks (e.g., paraphrase\ndetection) proving most beneficial. Additionally, representations from\nintermediate layers of fine-tuned models often outperform those from final\nlayers. Combining embeddings from multiple tasks consistently improves\nperformance, with attention-based aggregation yielding substantial gains. These\ninsights shed light on relationships between task-specific representations and\ntheir adaptability to complex downstream tasks, encouraging further exploration\nof embedding-level task transfer.", "paper_summary_zh": "在這項工作中，我們重新構想經典探查，以評估從簡單來源到更複雜目標任務的知識轉移。我們沒有在各種簡單目標探查任務中探查來自複雜來源任務的凍結表示（如探查中通常所做的那樣），而是探討來自多個簡單來源任務的嵌入在單一目標任務上的有效性。我們選擇了指稱消解，這是一個需要上下文理解的語言複雜問題，作為重點目標任務，並測試了來自相對簡單任務（例如語句改寫偵測、命名實體辨識和關係萃取）的嵌入的效用。透過系統性的實驗，我們評估了個別和組合任務嵌入的影響。我們的發現表明，任務嵌入在指稱消解的效用上差異很大，其中語義相似性任務（例如語句改寫偵測）被證明最有益。此外，微調模型的中間層表示通常優於最後一層的表示。結合來自多個任務的嵌入始終能改善效能，其中基於注意力的聚合產生了顯著的增益。這些見解闡明了特定任務表示與其對複雜下游任務的適應性之間的關係，鼓勵進一步探索嵌入層級任務轉移。", "author": "Tatiana Anikina et.al.", "authors": "Tatiana Anikina, Arne Binder, David Harbecke, Stalin Varanasi, Leonhard Hennig, Simon Ostermann, Sebastian Möller, Josef van Genabith", "id": "2501.19316v1", "paper_url": "http://arxiv.org/abs/2501.19316v1", "repo": "null"}}