{"2409.18340": {"publish_time": "2024-09-26", "title": "DRL-STNet: Unsupervised Domain Adaptation for Cross-modality Medical Image Segmentation via Disentangled Representation Learning", "paper_summary": "Unsupervised domain adaptation (UDA) is essential for medical image\nsegmentation, especially in cross-modality data scenarios. UDA aims to transfer\nknowledge from a labeled source domain to an unlabeled target domain, thereby\nreducing the dependency on extensive manual annotations. This paper presents\nDRL-STNet, a novel framework for cross-modality medical image segmentation that\nleverages generative adversarial networks (GANs), disentangled representation\nlearning (DRL), and self-training (ST). Our method leverages DRL within a GAN\nto translate images from the source to the target modality. Then, the\nsegmentation model is initially trained with these translated images and\ncorresponding source labels and then fine-tuned iteratively using a combination\nof synthetic and real images with pseudo-labels and real labels. The proposed\nframework exhibits superior performance in abdominal organ segmentation on the\nFLARE challenge dataset, surpassing state-of-the-art methods by 11.4% in the\nDice similarity coefficient and by 13.1% in the Normalized Surface Dice metric,\nachieving scores of 74.21% and 80.69%, respectively. The average running time\nis 41 seconds, and the area under the GPU memory-time curve is 11,292 MB. These\nresults indicate the potential of DRL-STNet for enhancing cross-modality\nmedical image segmentation tasks.", "paper_summary_zh": "無監督域適應 (UDA) 對醫學影像分割至關重要，特別是在跨模態數據場景中。UDA 旨在將標記來源域的知識轉移到未標記目標域，從而減少對大量人工標註的依賴。本文提出 DRL-STNet，這是一個用於跨模態醫學影像分割的新穎架構，它利用生成對抗網路 (GAN)、解糾纏表示學習 (DRL) 和自我訓練 (ST)。我們的模型在 GAN 中利用 DRL 將影像從來源轉換到目標模態。然後，分割模型最初使用這些轉換後的影像和對應的來源標籤進行訓練，然後使用合成影像和帶有偽標籤和真實標籤的真實影像的組合進行反覆微調。所提出的架構在 FLARE 挑戰資料集上的腹部器官分割中表現出優異的效能，在 Dice 相似係數上超越現有技術 11.4%，在標準化表面 Dice 指標上超越 13.1%，分別達到 74.21% 和 80.69% 的分數。平均執行時間為 41 秒，GPU 記憶體時間曲線下的面積為 11,292 MB。這些結果表明 DRL-STNet 在增強跨模態醫學影像分割任務方面具有潛力。", "author": "Hui Lin et.al.", "authors": "Hui Lin, Florian Schiffers, Santiago López-Tapia, Neda Tavakoli, Daniel Kim, Aggelos K. Katsaggelos", "id": "2409.18340v1", "paper_url": "http://arxiv.org/abs/2409.18340v1", "repo": "null"}}