{"2501.02523": {"publish_time": "2025-01-05", "title": "Face-MakeUp: Multimodal Facial Prompts for Text-to-Image Generation", "paper_summary": "Facial images have extensive practical applications. Although the current\nlarge-scale text-image diffusion models exhibit strong generation capabilities,\nit is challenging to generate the desired facial images using only text prompt.\nImage prompts are a logical choice. However, current methods of this type\ngenerally focus on general domain. In this paper, we aim to optimize image\nmakeup techniques to generate the desired facial images. Specifically, (1) we\nbuilt a dataset of 4 million high-quality face image-text pairs\n(FaceCaptionHQ-4M) based on LAION-Face to train our Face-MakeUp model; (2) to\nmaintain consistency with the reference facial image, we extract/learn\nmulti-scale content features and pose features for the facial image,\nintegrating these into the diffusion model to enhance the preservation of\nfacial identity features for diffusion models. Validation on two face-related\ntest datasets demonstrates that our Face-MakeUp can achieve the best\ncomprehensive performance.All codes are available\nat:https://github.com/ddw2AIGROUP2CQUPT/Face-MakeUp", "paper_summary_zh": "人臉影像有廣泛的實際應用。儘管目前大規模的文字影像擴散模型展現出強大的生成能力，但僅使用文字提示要產生理想的人臉影像仍然具有挑戰性。影像提示是一個合乎邏輯的選擇。然而，這種類型的現有方法通常側重於一般領域。在本文中，我們旨在最佳化影像化妝技術以產生理想的人臉影像。具體來說，（1）我們根據 LAION-Face 建立了一個包含 400 萬張高品質人臉影像文字配對的資料集（FaceCaptionHQ-4M）來訓練我們的 Face-MakeUp 模型；（2）為了與參考人臉影像保持一致性，我們萃取/學習多尺度內容特徵和人臉影像的姿勢特徵，並將這些特徵整合到擴散模型中，以增強對擴散模型人臉特徵的保留。在兩個與人臉相關的測試資料集上的驗證證明我們的 Face-MakeUp 可以達到最佳的綜合效能。所有程式碼都可以在以下位置取得：https://github.com/ddw2AIGROUP2CQUPT/Face-MakeUp", "author": "Dawei Dai et.al.", "authors": "Dawei Dai, Mingming Jia, Yinxiu Zhou, Hang Xing, Chenghang Li", "id": "2501.02523v1", "paper_url": "http://arxiv.org/abs/2501.02523v1", "repo": "https://github.com/ddw2aigroup2cqupt/face-makeup"}}