{"2409.11968": {"publish_time": "2024-09-18", "title": "Efficacy of Synthetic Data as a Benchmark", "paper_summary": "Large language models (LLMs) have enabled a range of applications in\nzero-shot and few-shot learning settings, including the generation of synthetic\ndatasets for training and testing. However, to reliably use these synthetic\ndatasets, it is essential to understand how representative they are of\nreal-world data. We investigate this by assessing the effectiveness of\ngenerating synthetic data through LLM and using it as a benchmark for various\nNLP tasks. Our experiments across six datasets, and three different tasks, show\nthat while synthetic data can effectively capture performance of various\nmethods for simpler tasks, such as intent classification, it falls short for\nmore complex tasks like named entity recognition. Additionally, we propose a\nnew metric called the bias factor, which evaluates the biases introduced when\nthe same LLM is used to both generate benchmarking data and to perform the\ntasks. We find that smaller LLMs exhibit biases towards their own generated\ndata, whereas larger models do not. Overall, our findings suggest that the\neffectiveness of synthetic data as a benchmark varies depending on the task,\nand that practitioners should rely on data generated from multiple larger\nmodels whenever possible.", "paper_summary_zh": "大型語言模型 (LLM) 已在零次學習和少次學習設定中啟用了一系列應用程式，包括用於訓練和測試的合成資料集產生。但是，要可靠地使用這些合成資料集，了解它們在多大程度上代表真實世界資料至關重要。我們透過評估透過 LLM 產生合成資料的有效性並將其用作各種 NLP 任務的基準來調查這一點。我們在六個資料集和三個不同任務中的實驗表明，雖然合成資料可以有效地捕捉各種方法在較簡單任務（例如意圖分類）中的效能，但對於更複雜的任務（例如命名實體識別）則有所不足。此外，我們提出一個稱為偏差因子的新指標，用於評估在使用相同的 LLM 來產生基準資料和執行任務時引入的偏差。我們發現較小的 LLM 對其自己產生的資料表現出偏差，而較大的模型則沒有。總體而言，我們的研究結果表明，合成資料作為基準的有效性會根據任務而異，從業者應盡可能依賴從多個較大模型產生的資料。", "author": "Gaurav Maheshwari et.al.", "authors": "Gaurav Maheshwari, Dmitry Ivanov, Kevin El Haddad", "id": "2409.11968v1", "paper_url": "http://arxiv.org/abs/2409.11968v1", "repo": "null"}}