{"2411.01706": {"publish_time": "2024-11-03", "title": "Investigating Large Language Models for Complex Word Identification in Multilingual and Multidomain Setups", "paper_summary": "Complex Word Identification (CWI) is an essential step in the lexical\nsimplification task and has recently become a task on its own. Some variations\nof this binary classification task have emerged, such as lexical complexity\nprediction (LCP) and complexity evaluation of multi-word expressions (MWE).\nLarge language models (LLMs) recently became popular in the Natural Language\nProcessing community because of their versatility and capability to solve\nunseen tasks in zero/few-shot settings. Our work investigates LLM usage,\nspecifically open-source models such as Llama 2, Llama 3, and Vicuna v1.5, and\nclosed-source, such as ChatGPT-3.5-turbo and GPT-4o, in the CWI, LCP, and MWE\nsettings. We evaluate zero-shot, few-shot, and fine-tuning settings and show\nthat LLMs struggle in certain conditions or achieve comparable results against\nexisting methods. In addition, we provide some views on meta-learning combined\nwith prompt learning. In the end, we conclude that the current state of LLMs\ncannot or barely outperform existing methods, which are usually much smaller.", "paper_summary_zh": "複雜詞彙識別 (CWI) 是詞彙簡化任務中不可或缺的步驟，最近已成為一項獨立的任務。此二元分類任務出現了一些變化，例如詞彙複雜度預測 (LCP) 和多詞表達 (MWE) 的複雜度評估。大型語言模型 (LLM) 近期在自然語言處理社群中廣受歡迎，因為它們具有多功能性，並有能力在零次/少次嘗試的設定中解決未見過的問題。我們的研究探討了 LLM 的使用，特別是開放原始碼模型，例如 Llama 2、Llama 3 和 Vicuna v1.5，以及閉源模型，例如 ChatGPT-3.5-turbo 和 GPT-4o，在 CWI、LCP 和 MWE 設定中。我們評估了零次、少次和微調設定，並顯示 LLM 在某些條件下會遇到困難，或與現有方法相比獲得相當的結果。此外，我們提供了一些關於元學習結合提示學習的觀點。最後，我們得出結論，LLM 的當前狀態無法或僅能勉強優於現有方法，而現有方法通常小得多。", "author": "Răzvan-Alexandru Smădu et.al.", "authors": "Răzvan-Alexandru Smădu, David-Gabriel Ion, Dumitru-Clementin Cercel, Florin Pop, Mihaela-Claudia Cercel", "id": "2411.01706v1", "paper_url": "http://arxiv.org/abs/2411.01706v1", "repo": "null"}}