{"2410.08985": {"publish_time": "2024-10-11", "title": "Towards Trustworthy Knowledge Graph Reasoning: An Uncertainty Aware Perspective", "paper_summary": "Recently, Knowledge Graphs (KGs) have been successfully coupled with Large\nLanguage Models (LLMs) to mitigate their hallucinations and enhance their\nreasoning capability, such as in KG-based retrieval-augmented frameworks.\nHowever, current KG-LLM frameworks lack rigorous uncertainty estimation,\nlimiting their reliable deployment in high-stakes applications. Directly\nincorporating uncertainty quantification into KG-LLM frameworks presents\nchallenges due to their complex architectures and the intricate interactions\nbetween the knowledge graph and language model components. To address this gap,\nwe propose a new trustworthy KG-LLM framework, Uncertainty Aware\nKnowledge-Graph Reasoning (UAG), which incorporates uncertainty quantification\ninto the KG-LLM framework. We design an uncertainty-aware multi-step reasoning\nframework that leverages conformal prediction to provide a theoretical\nguarantee on the prediction set. To manage the error rate of the multi-step\nprocess, we additionally introduce an error rate control module to adjust the\nerror rate within the individual components. Extensive experiments show that\nour proposed UAG can achieve any pre-defined coverage rate while reducing the\nprediction set/interval size by 40% on average over the baselines.", "paper_summary_zh": "最近，知识图谱 (KG) 已成功与大型语言模型 (LLM) 结合，以减轻其幻觉并增强其推理能力，例如基于 KG 的检索增强框架。\n然而，当前的 KG-LLM 框架缺乏严格的不确定性估计，限制了它们在高风险应用程序中的可靠部署。由于其复杂的架构以及知识图谱与语言模型组件之间的复杂交互，将不确定性量化直接纳入 KG-LLM 框架提出了挑战。为了解决这一差距，我们提出了一种新的可信赖 KG-LLM 框架，即不确定性感知知识图推理 (UAG)，它将不确定性量化纳入 KG-LLM 框架。我们设计了一个不确定性感知多步骤推理框架，它利用共形预测为预测集提供理论保证。为了管理多步骤过程的错误率，我们另外引入了一个错误率控制模块，以调整各个组件内的错误率。大量实验表明，我们提出的 UAG 可以达到任何预定义的覆盖率，同时将预测集/区间大小平均减少 40%，高于基线。", "author": "Bo Ni et.al.", "authors": "Bo Ni, Yu Wang, Lu Cheng, Erik Blasch, Tyler Derr", "id": "2410.08985v1", "paper_url": "http://arxiv.org/abs/2410.08985v1", "repo": "null"}}