{"2407.08428": {"publish_time": "2024-07-11", "title": "A Comprehensive Survey on Human Video Generation: Challenges, Methods, and Insights", "paper_summary": "Human video generation is a dynamic and rapidly evolving task that aims to\nsynthesize 2D human body video sequences with generative models given control\nconditions such as text, audio, and pose. With the potential for wide-ranging\napplications in film, gaming, and virtual communication, the ability to\ngenerate natural and realistic human video is critical. Recent advancements in\ngenerative models have laid a solid foundation for the growing interest in this\narea. Despite the significant progress, the task of human video generation\nremains challenging due to the consistency of characters, the complexity of\nhuman motion, and difficulties in their relationship with the environment. This\nsurvey provides a comprehensive review of the current state of human video\ngeneration, marking, to the best of our knowledge, the first extensive\nliterature review in this domain. We start with an introduction to the\nfundamentals of human video generation and the evolution of generative models\nthat have facilitated the field's growth. We then examine the main methods\nemployed for three key sub-tasks within human video generation: text-driven,\naudio-driven, and pose-driven motion generation. These areas are explored\nconcerning the conditions that guide the generation process. Furthermore, we\noffer a collection of the most commonly utilized datasets and the evaluation\nmetrics that are crucial in assessing the quality and realism of generated\nvideos. The survey concludes with a discussion of the current challenges in the\nfield and suggests possible directions for future research. The goal of this\nsurvey is to offer the research community a clear and holistic view of the\nadvancements in human video generation, highlighting the milestones achieved\nand the challenges that lie ahead.", "paper_summary_zh": "人類影片生成是一項動態且快速演進的任務，旨在利用生成模型合成 2D 人體影片序列，並給予文字、音訊和姿勢等控制條件。隨著在電影、遊戲和虛擬通訊中廣泛應用的潛力，生成自然且逼真的影片至關重要。生成模型的最新進展為這個領域日益增長的興趣奠定了堅實的基礎。儘管取得了顯著進展，但由於角色的一致性、人類動作的複雜性和與環境關係的困難，人類影片生成的任務仍然具有挑戰性。這項調查全面回顧了人類影片生成的現狀，標誌著我們所知，這是該領域首次廣泛的文獻回顧。我們從人類影片生成的基本原理和促成該領域成長的生成模型的演進開始介紹。然後我們探討了用於人類影片生成中三個關鍵子任務的主要方法：文字驅動、音訊驅動和姿勢驅動的動作生成。這些領域是根據指導生成過程的條件進行探討的。此外，我們提供了一系列最常使用的資料集和評估指標，這些指標對於評估生成影片的品質和真實性至關重要。這項調查最後討論了該領域目前的挑戰，並建議了未來研究可能的方向。這項調查的目標是為研究社群提供人類影片生成進展的清晰且全面的觀點，重點介紹已達成的里程碑和未來的挑戰。", "author": "Wentao Lei et.al.", "authors": "Wentao Lei, Jinting Wang, Fengji Ma, Guanjie Huang, Li Liu", "id": "2407.08428v1", "paper_url": "http://arxiv.org/abs/2407.08428v1", "repo": "https://github.com/wentaol86/awesome-human-body-video-generation"}}