{"2406.04809": {"publish_time": "2024-06-07", "title": "Fragile Model Watermarking: A Comprehensive Survey of Evolution, Characteristics, and Classification", "paper_summary": "Model fragile watermarking, inspired by both the field of adversarial attacks\non neural networks and traditional multimedia fragile watermarking, has\ngradually emerged as a potent tool for detecting tampering, and has witnessed\nrapid development in recent years. Unlike robust watermarks, which are widely\nused for identifying model copyrights, fragile watermarks for models are\ndesigned to identify whether models have been subjected to unexpected\nalterations such as backdoors, poisoning, compression, among others. These\nalterations can pose unknown risks to model users, such as misidentifying stop\nsigns as speed limit signs in classic autonomous driving scenarios. This paper\nprovides an overview of the relevant work in the field of model fragile\nwatermarking since its inception, categorizing them and revealing the\ndevelopmental trajectory of the field, thus offering a comprehensive survey for\nfuture endeavors in model fragile watermarking.", "paper_summary_zh": "受到对抗性攻擊在神經網路和傳統多媒體脆弱浮水印領域的啟發，模型脆弱浮水印逐漸成為一種強有力的篡改檢測工具，並在近年來見證了快速發展。與廣泛用於識別模型版權的強健浮水印不同，模型的脆弱浮水印旨在識別模型是否遭受了後門、中毒、壓縮等意外變更。這些變更會對模型使用者造成未知的風險，例如在經典的自動駕駛場景中將停止標誌誤認為限速標誌。本文概述了模型脆弱浮水印領域自成立以來的相關工作，對它們進行分類並揭示該領域的發展軌跡，從而為模型脆弱浮水印的未來工作提供全面的調查。", "author": "Zhenzhe Gao et.al.", "authors": "Zhenzhe Gao, Yu Cheng, Zhaoxia Yin", "id": "2406.04809v1", "paper_url": "http://arxiv.org/abs/2406.04809v1", "repo": "null"}}