{"2408.02233": {"publish_time": "2024-08-05", "title": "A Multi-Source Heterogeneous Knowledge Injected Prompt Learning Method for Legal Charge Prediction", "paper_summary": "Legal charge prediction, an essential task in legal AI, seeks to assign\naccurate charge labels to case descriptions, attracting significant recent\ninterest. Existing methods primarily employ diverse neural network structures\nfor modeling case descriptions directly, failing to effectively leverage\nmulti-source external knowledge. We propose a prompt learning framework-based\nmethod that simultaneously leverages multi-source heterogeneous external\nknowledge from a legal knowledge base, a conversational LLM, and related legal\narticles. Specifically, we match knowledge snippets in case descriptions via\nthe legal knowledge base and encapsulate them into the input through a hard\nprompt template. Additionally, we retrieve legal articles related to a given\ncase description through contrastive learning, and then obtain factual elements\nwithin the case description through a conversational LLM. We fuse the embedding\nvectors of soft prompt tokens with the encoding vector of factual elements to\nachieve knowledge-enhanced model forward inference. Experimental results show\nthat our method achieved state-of-the-art results on CAIL-2018, the largest\nlegal charge prediction dataset, and our method has lower data dependency. Case\nstudies also demonstrate our method's strong interpretability.", "paper_summary_zh": "<paragraph>法律指控預測是法律 AI 中一項必要的任務，旨在為案件描述分配準確的指控標籤，最近引起了極大的興趣。現有方法主要採用不同的神經網路結構來直接對案件描述進行建模，未能有效利用多來源外部知識。我們提出了一個基於提示學習框架的方法，該方法同時利用來自法律知識庫、對話式 LLM 和相關法律條文的來源多樣且異質的外部知識。具體來說，我們通過法律知識庫比對案件描述中的知識片段，並通過硬提示範本將它們封裝到輸入中。此外，我們通過對比學習檢索與給定案件描述相關的法律條文，然後通過對話式 LLM 獲取案件描述中的事實要素。我們將軟提示符號的嵌入向量與事實要素的編碼向量融合，以實現知識增強模型的前向推理。實驗結果表明，我們的模型在最大的法律指控預測數據集 CAIL-2018 上取得了最先進的結果，並且我們的模型具有較低的数据依賴性。案例研究也證明了我們模型的強可解釋性。</paragraph>", "author": "Jingyun Sun et.al.", "authors": "Jingyun Sun, Chi Wei, Yang Li", "id": "2408.02233v1", "paper_url": "http://arxiv.org/abs/2408.02233v1", "repo": "null"}}