{"2410.02499": {"publish_time": "2024-10-03", "title": "Defining Knowledge: Bridging Epistemology and Large Language Models", "paper_summary": "Knowledge claims are abundant in the literature on large language models\n(LLMs); but can we say that GPT-4 truly \"knows\" the Earth is round? To address\nthis question, we review standard definitions of knowledge in epistemology and\nwe formalize interpretations applicable to LLMs. In doing so, we identify\ninconsistencies and gaps in how current NLP research conceptualizes knowledge\nwith respect to epistemological frameworks. Additionally, we conduct a survey\nof 100 professional philosophers and computer scientists to compare their\npreferences in knowledge definitions and their views on whether LLMs can really\nbe said to know. Finally, we suggest evaluation protocols for testing knowledge\nin accordance to the most relevant definitions.", "paper_summary_zh": "在大型語言模型 (LLM) 的文獻中，知識主張很豐富；但我們能說 GPT-4 真正「知道」地球是圓的嗎？為了回答這個問題，我們回顧了認識論中知識的標準定義，並將適用於 LLM 的詮釋形式化。在這樣做的過程中，我們辨識出當前 NLP 研究在如何概念化知識方面與認識論架構之間的不一致和差距。此外，我們對 100 位專業哲學家和電腦科學家進行了一項調查，以比較他們在知識定義上的偏好，以及他們對 LLM 是否真的可以說是知道的想法。最後，我們建議根據最相關的定義來測試知識的評估協定。", "author": "Constanza Fierro et.al.", "authors": "Constanza Fierro, Ruchira Dhar, Filippos Stamatiou, Nicolas Garneau, Anders Søgaard", "id": "2410.02499v1", "paper_url": "http://arxiv.org/abs/2410.02499v1", "repo": "null"}}