{"2501.04826": {"publish_time": "2025-01-08", "title": "Intelligent Gradient Boosting Algorithms for Estimating Strength of Modified Subgrade Soil", "paper_summary": "The performance of pavement under loading depends on the strength of the\nsubgrade. However, experimental estimation of properties of pavement strengths\nsuch as California bearing ratio (CBR), unconfined compressive strength (UCS)\nand resistance value (R) are often tedious, time-consuming and costly, thereby\ninspiring a growing interest in machine learning based tools which are simple,\ncheap and fast alternatives. Thus, the potential application of two boosting\ntechniques; categorical boosting (CatBoost) and extreme gradient boosting\n(XGBoost) and support vector regression (SVR), is similarly explored in this\nstudy for estimation of properties of subgrade soil modified with hydrated lime\nactivated rice husk ash (HARSH). Using 121 experimental data samples of varying\nproportions of HARSH, plastic limit, liquid limit, plasticity index, clay\nactivity, optimum moisture content, and maximum dry density as input for CBR,\nUCS and R estimation, four evaluation metrics namely coefficient of\ndetermination (R2), root mean squared error (RMSE), mean absolute error (MAE)\nand mean absolute percentage error (MAPE) are used to evaluate the models'\nperformance. The results indicate that XGBoost outperformed CatBoost and SVR in\nestimating these properties, yielding R2 of 0.9994, 0.9995 and 0.9999 in\nestimating the CBR, UCS and R respectively. Also, SVR outperformed CatBoost in\nestimating the CBR and R with R2 of 0.9997 respectively. On the other hand,\nCatBoost outperformed SVR in estimating the UCS with R2 of 0.9994. Feature\nsensitivity analysis shows that the three machine learning techniques are\nunanimous that increasing HARSH proportion lead to values of the estimated\nproperties respectively. A comparison with previous results also shows\nsuperiority of XGBoost in estimating subgrade properties.", "paper_summary_zh": "路面在受載荷作用下的效能取決於路基的強度。然而，路面強度性質的實驗估計，例如加州承載比 (CBR)、無側限抗壓強度 (UCS) 和抗力值 (R) 通常繁瑣、耗時且成本高昂，因此激發了人們對基於機器學習的工具的興趣，這些工具簡單、便宜且快速。因此，本研究同樣探討了兩種提升技術的潛在應用；分類提升 (CatBoost) 和極端梯度提升 (XGBoost) 和支持向量回歸 (SVR)，用於估計經由水合石灰活化稻殼灰 (HARSH) 改良的路基土的性質。使用 121 個不同比例 HARSH 的實驗數據樣本，塑性極限、液性極限、塑性指數、黏土活性、最佳含水量和最大乾密度作為 CBR、UCS 和 R 估計的輸入，四個評估指標，即決定係數 (R2)、均方根誤差 (RMSE)、平均絕對誤差 (MAE) 和平均絕對百分比誤差 (MAPE) 用於評估模型的效能。結果表明，XGBoost 在估計這些性質方面優於 CatBoost 和 SVR，在估計 CBR、UCS 和 R 時分別產生 0.9994、0.9995 和 0.9999 的 R2。此外，SVR 在估計 CBR 和 R 時優於 CatBoost，R2 分別為 0.9997。另一方面，CatBoost 在估計 UCS 時優於 SVR，R2 為 0.9994。特徵敏感性分析表明，三種機器學習技術一致認為，增加 HARSH 比例會導致估計性質的值分別增加。與先前的結果比較也顯示出 XGBoost 在估計路基性質方面的優越性。", "author": "Ismail B. Mustapha et.al.", "authors": "Ismail B. Mustapha, Muyideen Abdulkareem, Shafaatunnur Hasan, Abideen Ganiyu, Hatem Nabus, Jin Chai Lee", "id": "2501.04826v1", "paper_url": "http://arxiv.org/abs/2501.04826v1", "repo": "null"}}