{"2406.17651": {"publish_time": "2024-06-25", "title": "Leveraging Large Language Models for Software Model Completion: Results from Industrial and Public Datasets", "paper_summary": "Modeling structure and behavior of software systems plays a crucial role in\nthe industrial practice of software engineering. As with other software\nengineering artifacts, software models are subject to evolution. Supporting\nmodelers in evolving software models with recommendations for model completions\nis still an open problem, though. In this paper, we explore the potential of\nlarge language models for this task. In particular, we propose an approach,\nretrieval-augmented generation, leveraging large language models, model\nhistories, and retrieval-augmented generation for model completion. Through\nexperiments on three datasets, including an industrial application, one public\nopen-source community dataset, and one controlled collection of simulated model\nrepositories, we evaluate the potential of large language models for model\ncompletion with retrieval-augmented generation. We found that large language\nmodels are indeed a promising technology for supporting software model\nevolution (62.30% semantically correct completions on real-world industrial\ndata and up to 86.19% type-correct completions). The general inference\ncapabilities of large language models are particularly useful when dealing with\nconcepts for which there are few, noisy, or no examples at all.", "paper_summary_zh": "在軟體工程的產業實務中，軟體系統的結構和行為建模扮演著至關重要的角色。與其他軟體工程產出物一樣，軟體模型也會隨著時間演化。然而，支援建模人員使用模型完成建議來演化軟體模型仍是一個尚未解決的問題。在本文中，我們探討大型語言模型在這個任務中的潛力。具體來說，我們提出了一種方法，稱為檢索增強式生成，它利用大型語言模型、模型歷史記錄和檢索增強式生成來完成模型。透過在三個資料集上進行實驗，包括一個產業應用程式、一個公開的開源社群資料集，以及一個模擬模型儲存庫的受控集合，我們評估了大型語言模型在使用檢索增強式生成進行模型完成的潛力。我們發現大型語言模型確實是一種有前途的技術，可以用來支援軟體模型演化（在真實世界的產業資料上，有 62.30% 的語義正確完成，類型正確完成的比例最高可達 86.19%）。大型語言模型的一般推論能力在處理幾乎沒有、有雜訊或完全沒有範例的概念時特別有用。", "author": "Christof Tinnes et.al.", "authors": "Christof Tinnes, Alisa Welter, Sven Apel", "id": "2406.17651v1", "paper_url": "http://arxiv.org/abs/2406.17651v1", "repo": "null"}}