{"2411.08299": {"publish_time": "2024-11-13", "title": "DNN Task Assignment in UAV Networks: A Generative AI Enhanced Multi-Agent Reinforcement Learning Approach", "paper_summary": "Unmanned Aerial Vehicles (UAVs) possess high mobility and flexible deployment\ncapabilities, prompting the development of UAVs for various application\nscenarios within the Internet of Things (IoT). The unique capabilities of UAVs\ngive rise to increasingly critical and complex tasks in uncertain and\npotentially harsh environments. The substantial amount of data generated from\nthese applications necessitates processing and analysis through deep neural\nnetworks (DNNs). However, UAVs encounter challenges due to their limited\ncomputing resources when managing DNN models. This paper presents a joint\napproach that combines multiple-agent reinforcement learning (MARL) and\ngenerative diffusion models (GDM) for assigning DNN tasks to a UAV swarm, aimed\nat reducing latency from task capture to result output. To address these\nchallenges, we first consider the task size of the target area to be inspected\nand the shortest flying path as optimization constraints, employing a greedy\nalgorithm to resolve the subproblem with a focus on minimizing the UAV's flying\npath and the overall system cost. In the second stage, we introduce a novel DNN\ntask assignment algorithm, termed GDM-MADDPG, which utilizes the reverse\ndenoising process of GDM to replace the actor network in multi-agent deep\ndeterministic policy gradient (MADDPG). This approach generates specific DNN\ntask assignment actions based on agents' observations in a dynamic environment.\nSimulation results indicate that our algorithm performs favorably compared to\nbenchmarks in terms of path planning, Age of Information (AoI), energy\nconsumption, and task load balancing.", "paper_summary_zh": "無人機 (UAV) 擁有高度的機動性和靈活的部署能力，促使無人機在物聯網 (IoT) 的各種應用場景中得到發展。無人機的獨特能力在不確定和潛在惡劣的環境中產生越來越關鍵且複雜的任務。這些應用程式產生的龐大數據量需要透過深度神經網路 (DNN) 進行處理和分析。然而，無人機在管理 DNN 模型時會遇到挑戰，因為其運算資源有限。本文提出了一種結合多重代理強化學習 (MARL) 和生成擴散模型 (GDM) 的聯合方法，用於將 DNN 任務分配給無人機群，旨在減少從任務擷取到結果輸出的延遲。為了應對這些挑戰，我們首先考慮要檢查的目標區域的任務大小和最短飛行路徑作為最佳化約束，採用貪婪演算法來解決子問題，重點在於最小化無人機的飛行路徑和整體系統成本。在第二階段，我們引入了一種新穎的 DNN 任務分配演算法，稱為 GDM-MADDPG，它利用 GDM 的反向去噪過程來替換多重代理深度確定性策略梯度 (MADDPG) 中的動作網路。這種方法根據代理在動態環境中的觀察，產生特定的 DNN 任務分配動作。模擬結果表明，與基準相比，我們的演算法在路徑規劃、資訊年齡 (AoI)、能耗和任務負載平衡方面表現良好。", "author": "Xin Tang et.al.", "authors": "Xin Tang, Qian Chen, Wenjie Weng, Binhan Liao, Jiacheng Wang, Xianbin Cao, Xiaohuan Li", "id": "2411.08299v1", "paper_url": "http://arxiv.org/abs/2411.08299v1", "repo": "null"}}