{"2502.12771": {"publish_time": "2025-02-18", "title": "Mind the Gap: Aligning the Brain with Language Models Requires a Nonlinear and Multimodal Approach", "paper_summary": "Self-supervised language and audio models effectively predict brain responses\nto speech. However, traditional prediction models rely on linear mappings from\nunimodal features, despite the complex integration of auditory signals with\nlinguistic and semantic information across widespread brain networks during\nspeech comprehension. Here, we introduce a nonlinear, multimodal prediction\nmodel that combines audio and linguistic features from pre-trained models\n(e.g., LLAMA, Whisper). Our approach achieves a 17.2% and 17.9% improvement in\nprediction performance (unnormalized and normalized correlation) over\ntraditional unimodal linear models, as well as a 7.7% and 14.4% improvement,\nrespectively, over prior state-of-the-art models. These improvements represent\na major step towards future robust in-silico testing and improved decoding\nperformance. They also reveal how auditory and semantic information are fused\nin motor, somatosensory, and higher-level semantic regions, aligning with\nexisting neurolinguistic theories. Overall, our work highlights the often\nneglected potential of nonlinear and multimodal approaches to brain modeling,\npaving the way for future studies to embrace these strategies in naturalistic\nneurolinguistics research.", "paper_summary_zh": "自我監督的語言和音訊模型有效預測大腦對語言的反應。然而，傳統的預測模型依賴於單模態特徵的線性映射，儘管在語言理解過程中，聽覺信號與語言和語義資訊在廣泛的腦網路中進行複雜的整合。在此，我們引入一個非線性、多模態預測模型，結合預先訓練模型（例如，LLAMA、Whisper）中的音訊和語言特徵。我們的做法在預測效能上（未正規化和正規化相關性）分別比傳統的單模態線性模型提升了 17.2% 和 17.9%，分別比先前的最先進模型提升了 7.7% 和 14.4%。這些改進代表了未來穩健的電腦模擬測試和改進的解碼效能邁出了一大步。它們也揭示了聽覺和語義資訊如何在運動、體感和更高層次的語義區域中融合，與現有的神經語言學理論一致。總的來說，我們的研究突出了非線性和多模態大腦建模方法經常被忽略的潛力，為未來研究在自然主義神經語言學研究中採用這些策略鋪平了道路。", "author": "Danny Dongyeop Han et.al.", "authors": "Danny Dongyeop Han, Yunju Cho, Jiook Cha, Jay-Yoon Lee", "id": "2502.12771v1", "paper_url": "http://arxiv.org/abs/2502.12771v1", "repo": "null"}}