{"2412.12722": {"publish_time": "2024-12-17", "title": "Defending LVLMs Against Vision Attacks through Partial-Perception Supervision", "paper_summary": "Recent studies have raised significant concerns regarding the vulnerability\nof Large Vision Language Models (LVLMs) to maliciously injected or perturbed\ninput images, which can mislead their responses. Existing defense methods show\nthat such vision attacks are sensitive to image modifications especially\ncropping, using majority voting across responses of modified images as\ncorrected responses. However, these modifications often result in partial\nimages and distort the semantics, which reduces response quality on clean\nimages after voting. Instead of directly using responses from partial images\nfor voting, we investigate using them to supervise the LVLM's responses to the\noriginal images. We propose a black-box, training-free method called DPS\n(Defense through Partial-Perception Supervision). In this approach, the model\nis prompted using the responses generated by a model that perceives only a\npartial image. With DPS, the model can adjust its response based on partial\nimage understanding when under attack, while confidently maintaining its\noriginal response for clean input. Our findings show that the weak model can\nsupervise the strong model: when faced with an attacked input, the strong model\nbecomes less confident and adjusts its response based on the weak model's\npartial understanding, effectively defending against the attack. With clean\ninput, it confidently maintains its original response. Empirical experiments\nshow our method outperforms the baseline, cutting the average attack success\nrate by 76.3% across six datasets on three popular models.", "paper_summary_zh": "最近的研究對於大型視覺語言模型 (LVLMs) 容易受到惡意注入或擾動的輸入影像，進而誤導其回應，提出了重大的疑慮。現有的防禦方法顯示，此類視覺攻擊對於影像修改很敏感，特別是裁切，使用修改影像的回應進行多數決投票作為修正的回應。然而，這些修改通常會導致部分影像和扭曲語意，這會降低投票後乾淨影像的回應品質。我們沒有直接使用部分影像的回應進行投票，而是研究使用它們來監督 LVLM 對原始影像的回應。我們提出一個稱為 DPS（透過部分感知監督進行防禦）的黑盒子、免訓練方法。在這個方法中，模型會使用僅感知部分影像的模型所產生的回應提示。透過 DPS，模型可以在受到攻擊時根據部分影像理解調整其回應，同時自信地維持其對乾淨輸入的原始回應。我們的研究結果顯示，弱模型可以監督強模型：當面對受到攻擊的輸入時，強模型會變得不那麼有信心，並根據弱模型的部分理解調整其回應，有效地防禦攻擊。對於乾淨的輸入，它會自信地維持其原始回應。實證實驗顯示，我們的模型優於基準，在三種熱門模型的六個資料集上，平均攻擊成功率降低了 76.3%。", "author": "Qi Zhou et.al.", "authors": "Qi Zhou, Tianlin Li, Qing Guo, Dongxia Wang, Yun Lin, Yang Liu, Jin Song Dong", "id": "2412.12722v1", "paper_url": "http://arxiv.org/abs/2412.12722v1", "repo": "null"}}