{"2407.11096": {"publish_time": "2024-07-15", "title": "Static and multivariate-temporal attentive fusion transformer for readmission risk prediction", "paper_summary": "Background: Accurate short-term readmission prediction of ICU patients is\nsignificant in improving the efficiency of resource assignment by assisting\nphysicians in making discharge decisions. Clinically, both individual static\nstatic and multivariate temporal data collected from ICU monitors play critical\nroles in short-term readmission prediction. Informative static and multivariate\ntemporal feature representation capturing and fusion present challenges for\naccurate readmission prediction. Methods:We propose a novel static and\nmultivariate-temporal attentive fusion transformer (SMTAFormer) to predict\nshort-term readmission of ICU patients by fully leveraging the potential of\ndemographic and dynamic temporal data. In SMTAFormer, we first apply an MLP\nnetwork and a temporal transformer network to learn useful static and temporal\nfeature representations, respectively. Then, the well-designed static and\nmultivariate temporal feature fusion module is applied to fuse static and\ntemporal feature representations by modeling intra-correlation among\nmultivariate temporal features and constructing inter-correlation between\nstatic and multivariate temporal features. Results: We construct a readmission\nrisk assessment (RRA) dataset based on the MIMIC-III dataset. The extensive\nexperiments show that SMTAFormer outperforms advanced methods, in which the\naccuracy of our proposed method is up to 86.6%, and the area under the receiver\noperating characteristic curve (AUC) is up to 0.717. Conclusion: Our proposed\nSMTAFormer can efficiently capture and fuse static and multivariate temporal\nfeature representations. The results show that SMTAFormer significantly\nimproves the short-term readmission prediction performance of ICU patients\nthrough comparisons to strong baselines.", "paper_summary_zh": "<paragraph>背景：精準短期重返預測重症加護病房（ICU）病人對於提升資源分配效率至關重要，能協助醫師做出出院決策。臨床上，從 ICU 監測器收集到的個別靜態資料和多變量時間資料在短期重返預測中扮演關鍵角色。擷取和融合有意義的靜態和多變量時間特徵表徵對於精準重返預測構成挑戰。方法：我們提出一個新穎的靜態和多變量時間注意力融合Transformer（SMTAFormer），藉由充分利用人口統計和動態時間資料的潛力，來預測 ICU 病人的短期重返。在 SMTAFormer 中，我們首先應用一個 MLP 網路和一個時間Transformer網路，分別學習有用的靜態和時間特徵表徵。然後，應用精心設計的靜態和多變量時間特徵融合模組，藉由建模多變量時間特徵之間的內部相關性，以及建構靜態和多變量時間特徵之間的相互關聯性，來融合靜態和時間特徵表徵。結果：我們根據 MIMIC-III 資料集建構一個重返風險評估（RRA）資料集。廣泛的實驗顯示，SMTAFormer 優於進階方法，其中我們提出的方法的準確度高達 86.6%，而受試者工作特性曲線（AUC）下的面積高達 0.717。結論：我們提出的 SMTAFormer 能有效擷取和融合靜態和多變量時間特徵表徵。結果顯示，SMTAFormer 藉由與強大的基線比較，顯著提升 ICU 病人的短期重返預測效能。</paragraph>", "author": "Zhe Sun et.al.", "authors": "Zhe Sun, Runzhi Li, Jing Wang, Gang Chen, Siyu Yan, Lihong Ma", "id": "2407.11096v1", "paper_url": "http://arxiv.org/abs/2407.11096v1", "repo": "null"}}