{"2410.13757": {"publish_time": "2024-10-17", "title": "MobA: A Two-Level Agent System for Efficient Mobile Task Automation", "paper_summary": "Current mobile assistants are limited by dependence on system APIs or\nstruggle with complex user instructions and diverse interfaces due to\nrestricted comprehension and decision-making abilities. To address these\nchallenges, we propose MobA, a novel Mobile phone Agent powered by multimodal\nlarge language models that enhances comprehension and planning capabilities\nthrough a sophisticated two-level agent architecture. The high-level Global\nAgent (GA) is responsible for understanding user commands, tracking history\nmemories, and planning tasks. The low-level Local Agent (LA) predicts detailed\nactions in the form of function calls, guided by sub-tasks and memory from the\nGA. Integrating a Reflection Module allows for efficient task completion and\nenables the system to handle previously unseen complex tasks. MobA demonstrates\nsignificant improvements in task execution efficiency and completion rate in\nreal-life evaluations, underscoring the potential of MLLM-empowered mobile\nassistants.", "paper_summary_zh": "目前行動助理受限於依賴系統 API 或因理解力和決策能力受限而難以處理複雜的使用者指令和多元介面。為了解決這些挑戰，我們提出 MobA，一種由多模態大型語言模型驅動的新型行動裝置代理，透過精密的雙層代理架構來提升理解力和規劃能力。高層級的「全局代理」(GA) 負責理解使用者指令、追蹤歷史記錄和規劃任務。低層級的「局部代理」(LA) 則預測詳細動作，形式為功能呼叫，由 GA 的子任務和記憶體引導。整合「反思模組」可讓任務有效完成，並使系統能夠處理先前未見的複雜任務。MobA 在實際評估中展現出任務執行效率和完成率的顯著提升，凸顯了 MLLM 賦能行動助理的潛力。", "author": "Zichen Zhu et.al.", "authors": "Zichen Zhu, Hao Tang, Yansi Li, Kunyao Lan, Yixuan Jiang, Hao Zhou, Yixiao Wang, Situo Zhang, Liangtai Sun, Lu Chen, Kai Yu", "id": "2410.13757v1", "paper_url": "http://arxiv.org/abs/2410.13757v1", "repo": "null"}}