{"2412.10417": {"publish_time": "2024-12-09", "title": "Leveraging Audio and Text Modalities in Mental Health: A Study of LLMs Performance", "paper_summary": "Mental health disorders are increasingly prevalent worldwide, creating an\nurgent need for innovative tools to support early diagnosis and intervention.\nThis study explores the potential of Large Language Models (LLMs) in multimodal\nmental health diagnostics, specifically for detecting depression and Post\nTraumatic Stress Disorder through text and audio modalities. Using the E-DAIC\ndataset, we compare text and audio modalities to investigate whether LLMs can\nperform equally well or better with audio inputs. We further examine the\nintegration of both modalities to determine if this can enhance diagnostic\naccuracy, which generally results in improved performance metrics. Our analysis\nspecifically utilizes custom-formulated metrics; Modal Superiority Score and\nDisagreement Resolvement Score to evaluate how combined modalities influence\nmodel performance. The Gemini 1.5 Pro model achieves the highest scores in\nbinary depression classification when using the combined modality, with an F1\nscore of 0.67 and a Balanced Accuracy (BA) of 77.4%, assessed across the full\ndataset. These results represent an increase of 3.1% over its performance with\nthe text modality and 2.7% over the audio modality, highlighting the\neffectiveness of integrating modalities to enhance diagnostic accuracy.\nNotably, all results are obtained in zero-shot inferring, highlighting the\nrobustness of the models without requiring task-specific fine-tuning. To\nexplore the impact of different configurations on model performance, we conduct\nbinary, severity, and multiclass tasks using both zero-shot and few-shot\nprompts, examining the effects of prompt variations on performance. The results\nreveal that models such as Gemini 1.5 Pro in text and audio modalities, and\nGPT-4o mini in the text modality, often surpass other models in balanced\naccuracy and F1 scores across multiple tasks.", "paper_summary_zh": "<paragraph>心理健康疾病在全球范围内日益普遍，迫切需要创新工具来支持早期诊断和干预。本研究探讨了大语言模型 (LLM) 在多模态心理健康诊断中的潜力，特别是通过文本和音频模式检测抑郁症和创伤后应激障碍。使用 E-DAIC 数据集，我们比较文本和音频模式以调查 LLM 是否可以使用音频输入表现得同样好或更好。我们进一步检查了两种模式的集成，以确定这是否可以提高诊断准确性，这通常会导致性能指标的提高。我们的分析专门使用定制公式的指标；模式优势分数和分歧解决分数来评估组合模式如何影响模型性能。Gemini 1.5 Pro 模型在使用组合模式时在二元抑郁症分类中获得最高分，F1 得分为 0.67，平衡准确度 (BA) 为 77.4%，在整个数据集上进行评估。这些结果比其在文本模式下的表现提高了 3.1%，比音频模式提高了 2.7%，突显了集成模式以提高诊断准确性的有效性。值得注意的是，所有结果都是在零次推断中获得的，突出了模型的稳健性，而不需要特定于任务的微调。为了探索不同配置对模型性能的影响，我们使用零次和少次提示执行二元、严重性和多类任务，检查提示变化对性能的影响。结果表明，文本和音频模式中的 Gemini 1.5 Pro 等模型以及文本模式中的 GPT-4o mini 在多个任务中的平衡准确性和 F1 分数通常优于其他模型。</paragraph>", "author": "Abdelrahman A. Ali et.al.", "authors": "Abdelrahman A. Ali, Aya E. Fouda, Radwa J. Hanafy, Mohammed E. Fouda", "id": "2412.10417v1", "paper_url": "http://arxiv.org/abs/2412.10417v1", "repo": "null"}}