{"2407.15719": {"publish_time": "2024-07-22", "title": "GFE-Mamba: Mamba-based AD Multi-modal Progression Assessment via Generative Feature Extraction from MCI", "paper_summary": "Alzheimer's Disease (AD) is an irreversible neurodegenerative disorder that\noften progresses from Mild Cognitive Impairment (MCI), leading to memory loss\nand significantly impacting patients' lives. Clinical trials indicate that\nearly targeted interventions for MCI patients can potentially slow or halt the\ndevelopment and progression of AD. Previous research has shown that accurate\nmedical classification requires the inclusion of extensive multimodal data,\nsuch as assessment scales and various neuroimaging techniques like Magnetic\nResonance Imaging (MRI) and Positron Emission Tomography (PET). However,\nconsistently tracking the diagnosis of the same individual over time and\nsimultaneously collecting multimodal data poses significant challenges. To\naddress this issue, we introduce GFE-Mamba, a classifier based on Generative\nFeature Extraction (GFE). This classifier effectively integrates data from\nassessment scales, MRI, and PET, enabling deeper multimodal fusion. It\nefficiently extracts both long and short sequence information and incorporates\nadditional information beyond the pixel space. This approach not only improves\nclassification accuracy but also enhances the interpretability and stability of\nthe model. We constructed datasets of over 3000 samples based on the\nAlzheimer's Disease Neuroimaging Initiative (ADNI) for a two-step training\nprocess. Our experimental results demonstrate that the GFE-Mamba model is\neffective in predicting the conversion from MCI to AD and outperforms several\nstate-of-the-art methods. Our source code and ADNI dataset processing code are\navailable at https://github.com/Tinysqua/GFE-Mamba.", "paper_summary_zh": "阿茲海默症 (AD) 是一種不可逆的神經退化性疾病，\n通常會從輕度認知障礙 (MCI) 惡化，導致記憶力減退\n並對病患的生活產生重大影響。臨床試驗顯示，\n針對 MCI 病患的早期目標性干預措施，有可能減緩或停止\nAD 的發展和惡化。先前的研究顯示，精確的\n醫療分類需要納入廣泛的多模式數據，\n例如評估量表和各種神經影像技術，如磁振造影 (MRI) 和正子斷層掃描 (PET)。然而，\n持續追蹤同一位個體的診斷結果，並同時收集多模式數據，會造成重大的挑戰。為了\n解決這個問題，我們引入了 GFE-Mamba，一種基於生成特徵萃取 (GFE) 的分類器。此分類器有效整合來自\n評估量表、MRI 和 PET 的數據，實現更深入的多模式融合。它\n有效率地萃取出長序列和短序列資訊，並納入像素空間以外的額外資訊。這種方法不僅提升了\n分類準確度，也增強了模型的可解釋性和穩定性。我們根據\n阿茲海默症神經影像倡議組織 (ADNI) 建立了超過 3000 個樣本的資料集，用於兩階段訓練\n過程。我們的實驗結果證明，GFE-Mamba 模型在預測從 MCI 轉變為 AD 上是有效的，並且優於多種\n最先進的方法。我們的原始程式碼和 ADNI 資料集處理程式碼可於 https://github.com/Tinysqua/GFE-Mamba 取得。", "author": "Zhaojie Fang et.al.", "authors": "Zhaojie Fang, Shenghao Zhu, Yifei Chen, Binfeng Zou, Fan Jia, Linwei Qiu, Chang Liu, Yiyu Huang, Xiang Feng, Feiwei Qin, Changmiao Wang, Yeru Wang, Jin Fan, Changbiao Chu, Wan-Zhen Wu, Hu Zhao", "id": "2407.15719v1", "paper_url": "http://arxiv.org/abs/2407.15719v1", "repo": "https://github.com/tinysqua/gfe-mamba"}}