{"2407.15738": {"publish_time": "2024-07-22", "title": "Parallel Split Learning with Global Sampling", "paper_summary": "The expansion of IoT devices and the demands of Deep Learning have\nhighlighted significant challenges in Distributed Deep Learning (DDL) systems.\nParallel Split Learning (PSL) has emerged as a promising derivative of Split\nLearning that is well suited for distributed learning on resource-constrained\ndevices. However, PSL faces several obstacles, such as large effective batch\nsizes, non-IID data distributions, and the straggler effect. We view these\nissues as a sampling dilemma and propose to address them by orchestrating the\nmini-batch sampling process on the server side. We introduce the Uniform Global\nSampling (UGS) method to decouple the effective batch size from the number of\nclients and reduce mini-batch deviation in non-IID settings. To address the\nstraggler effect, we introduce the Latent Dirichlet Sampling (LDS) method,\nwhich generalizes UGS to balance the trade-off between batch deviation and\ntraining time. Our simulations reveal that our proposed methods enhance model\naccuracy by up to 34.1% in non-IID settings and reduce the training time in the\npresence of stragglers by up to 62%. In particular, LDS effectively mitigates\nthe straggler effect without compromising model accuracy or adding significant\ncomputational overhead compared to UGS. Our results demonstrate the potential\nof our methods as a promising solution for DDL in real applications.", "paper_summary_zh": "物联网设备的扩张和深度学习的需求突出了分布式深度学习 (DDL) 系统中的重大挑战。\n并行拆分学习 (PSL) 已成为拆分学习的一个有前途的衍生产品，非常适合在资源受限的设备上进行分布式学习。\n然而，PSL 面临着一些障碍，例如有效批次大小大、非 IID 数据分布和掉队者效应。\n我们将这些问题视为抽样难题，并提出通过在服务器端编排小批量抽样过程来解决这些问题。\n我们引入了统一全局采样 (UGS) 方法，以将有效批次大小与客户端数量解耦，并减少非 IID 设置中的小批量偏差。\n为了解决掉队者效应，我们引入了潜在狄利克雷采样 (LDS) 方法，该方法将 UGS 概括为平衡批次偏差和训练时间之间的权衡。\n我们的模拟表明，我们提出的方法将非 IID 设置中的模型准确度提高了 34.1%，并在存在掉队者的情况下将训练时间减少了 62%。\n特别是，与 UGS 相比，LDS 有效地减轻了掉队者效应，而不会损害模型准确性或增加显着的计算开销。\n我们的结果证明了我们的方法作为实际应用中 DDL 的有前途的解决方案的潜力。", "author": "Mohammad Kohankhaki et.al.", "authors": "Mohammad Kohankhaki, Ahmad Ayad, Mahdi Barhoush, Anke Schmeink", "id": "2407.15738v1", "paper_url": "http://arxiv.org/abs/2407.15738v1", "repo": "null"}}