{"2405.14384": {"publish_time": "2024-05-23", "title": "Reliable Trajectory Prediction and Uncertainty Quantification with Conditioned Diffusion Models", "paper_summary": "This work introduces the conditioned Vehicle Motion Diffusion (cVMD) model, a\nnovel network architecture for highway trajectory prediction using diffusion\nmodels. The proposed model ensures the drivability of the predicted trajectory\nby integrating non-holonomic motion constraints and physical constraints into\nthe generative prediction module. Central to the architecture of cVMD is its\ncapacity to perform uncertainty quantification, a feature that is crucial in\nsafety-critical applications. By integrating the quantified uncertainty into\nthe prediction process, the cVMD's trajectory prediction performance is\nimproved considerably. The model's performance was evaluated using the publicly\navailable highD dataset. Experiments show that the proposed architecture\nachieves competitive trajectory prediction accuracy compared to\nstate-of-the-art models, while providing guaranteed drivable trajectories and\nuncertainty quantification.", "paper_summary_zh": "本研究提出條件式車輛運動擴散 (cVMD) 模型，這是一個使用擴散模型進行高速公路軌跡預測的新穎網路架構。所提出的模型透過將非完整運動約束和物理約束整合至生成式預測模組中，確保預測軌跡的可駕駛性。cVMD 架構的核心是執行不確定性量化的能力，這項功能在安全關鍵應用中至關重要。透過將量化的不確定性整合至預測過程中，cVMD 的軌跡預測效能大幅提升。該模型的效能使用公開的高維資料集進行評估。實驗顯示，所提出的架構與最先進的模型相比，可達成具競爭力的軌跡預測準確度，同時提供有保證的可駕駛軌跡和不確定性量化。", "author": "Marion Neumeier et.al.", "authors": "Marion Neumeier, Sebastian Dorn, Michael Botsch, Wolfgang Utschick", "id": "2405.14384v1", "paper_url": "http://arxiv.org/abs/2405.14384v1", "repo": "null"}}