{"2411.16457": {"publish_time": "2024-11-25", "title": "Characterized Diffusion Networks for Enhanced Autonomous Driving Trajectory Prediction", "paper_summary": "In this paper, we present a novel trajectory prediction model for autonomous\ndriving, combining a Characterized Diffusion Module and a Spatial-Temporal\nInteraction Network to address the challenges posed by dynamic and\nheterogeneous traffic environments. Our model enhances the accuracy and\nreliability of trajectory predictions by incorporating uncertainty estimation\nand complex agent interactions. Through extensive experimentation on public\ndatasets such as NGSIM, HighD, and MoCAD, our model significantly outperforms\nexisting state-of-the-art methods. We demonstrate its ability to capture the\nunderlying spatial-temporal dynamics of traffic scenarios and improve\nprediction precision, especially in complex environments. The proposed model\nshowcases strong potential for application in real-world autonomous driving\nsystems.", "paper_summary_zh": "在本文中，我們提出了一個用於自動駕駛的全新軌跡預測模型，結合特徵擴散模組和時空互動網路，以解決動態且異質的交通環境所帶來的挑戰。我們的模型透過納入不確定性估計和複雜的代理互動，增強了軌跡預測的準確性和可靠性。透過在 NGSIM、HighD 和 MoCAD 等公開資料集上進行廣泛的實驗，我們的模型顯著優於現有的最先進方法。我們展示了它捕捉交通場景中基礎時空動態的能力，並提高了預測精度，特別是在複雜的環境中。所提出的模型展示了在現實世界的自動駕駛系統中應用的強大潛力。", "author": "Haoming Li et.al.", "authors": "Haoming Li", "id": "2411.16457v1", "paper_url": "http://arxiv.org/abs/2411.16457v1", "repo": "null"}}