{"2406.07923": {"publish_time": "2024-06-12", "title": "CTC-aligned Audio-Text Embedding for Streaming Open-vocabulary Keyword Spotting", "paper_summary": "This paper introduces a novel approach for streaming openvocabulary keyword\nspotting (KWS) with text-based keyword enrollment. For every input frame, the\nproposed method finds the optimal alignment ending at the frame using\nconnectionist temporal classification (CTC) and aggregates the frame-level\nacoustic embedding (AE) to obtain higher-level (i.e., character, word, or\nphrase) AE that aligns with the text embedding (TE) of the target keyword text.\nAfter that, we calculate the similarity of the aggregated AE and the TE. To the\nbest of our knowledge, this is the first attempt to dynamically align the audio\nand the keyword text on-the-fly to attain the joint audio-text embedding for\nKWS. Despite operating in a streaming fashion, our approach achieves\ncompetitive performance on the LibriPhrase dataset compared to the\nnon-streaming methods with a mere 155K model parameters and a decoding\nalgorithm with time complexity O(U), where U is the length of the target\nkeyword at inference time.", "paper_summary_zh": "本文提出了一個創新的方法，用基於文字的關鍵字註冊串流開放詞彙關鍵字偵測 (KWS)。對於每個輸入幀，建議的方法使用連接主義時序分類 (CTC) 找出結束於幀的最佳對齊，並彙總幀級聲學嵌入 (AE)，以取得與目標關鍵字文字的文字嵌入 (TE) 對齊的更高層級 (即字元、單字或詞組) AE。之後，我們計算彙總 AE 和 TE 的相似度。據我們所知，這是首次嘗試動態對齊音訊和關鍵字文字，以取得用於 KWS 的聯合音訊文字嵌入。儘管以串流方式操作，但我們的方法在 LibriPhrase 資料集上達到了與非串流方法相當的效能，僅使用 155K 模型參數和時間複雜度為 O(U) 的解碼演算法，其中 U 是推論時間目標關鍵字的長度。", "author": "Sichen Jin et.al.", "authors": "Sichen Jin, Youngmoon Jung, Seungjin Lee, Jaeyoung Roh, Changwoo Han, Hoonyoung Cho", "id": "2406.07923v1", "paper_url": "http://arxiv.org/abs/2406.07923v1", "repo": "null"}}