{"2407.18764": {"publish_time": "2024-07-26", "title": "TAGIFY: LLM-powered Tagging Interface for Improved Data Findability on OGD portals", "paper_summary": "Efforts directed towards promoting Open Government Data (OGD) have gained\nsignificant traction across various governmental tiers since the mid-2000s. As\nmore datasets are published on OGD portals, finding specific data becomes\nharder, leading to information overload. Complete and accurate documentation of\ndatasets, including association of proper tags with datasets is key to\nimproving dataset findability and accessibility. Analysis conducted on the\nEstonian Open Data Portal, revealed that 11% datasets have no associated tags,\nwhile 26% had only one tag assigned to them, which underscores challenges in\ndata findability and accessibility within the portal, which, according to the\nrecent Open Data Maturity Report, is considered trend-setter. The aim of this\nstudy is to propose an automated solution to tagging datasets to improve data\nfindability on OGD portals. This paper presents Tagify - a prototype of tagging\ninterface that employs large language models (LLM) such as GPT-3.5-turbo and\nGPT-4 to automate dataset tagging, generating tags for datasets in English and\nEstonian, thereby augmenting metadata preparation by data publishers and\nimproving data findability on OGD portals by data users. The developed solution\nwas evaluated by users and their feedback was collected to define an agenda for\nfuture prototype improvements.", "paper_summary_zh": "自 2000 年代中期以來，促進開放政府資料 (OGD) 的努力已在各級政府間獲得顯著進展。隨著 OGD 入口網站上發布更多資料集，尋找特定資料變得更加困難，導致資訊過載。完整且準確的資料集文件，包括將適當標籤與資料集關聯起來，是改善資料集可查找性和可存取性的關鍵。對愛沙尼亞開放資料入口網站進行的分析顯示，11% 的資料集沒有關聯標籤，而 26% 的資料集只有一個標籤，這突顯了入口網站內資料可查找性和可存取性的挑戰，根據最近的開放資料成熟度報告，該網站被認為是趨勢引領者。本研究的目的是提出一個自動化解決方案來標記資料集，以改善 OGD 入口網站上的資料可查找性。本文介紹了 Tagify - 一個標記介面的原型，它採用大型語言模型 (LLM)，例如 GPT-3.5-turbo 和 GPT-4 來自動化資料集標記，為英文和愛沙尼亞文的資料集產生標籤，從而擴充資料發布者的元資料準備工作，並改善資料使用者在 OGD 入口網站上的資料可查找性。已開發的解決方案由使用者評估，並收集他們的回饋，以定義未來原型改進的議程。", "author": "Kevin Kliimask et.al.", "authors": "Kevin Kliimask, Anastasija Nikiforova", "id": "2407.18764v1", "paper_url": "http://arxiv.org/abs/2407.18764v1", "repo": "null"}}