{"2406.18125": {"publish_time": "2024-06-26", "title": "ResumeAtlas: Revisiting Resume Classification with Large-Scale Datasets and Large Language Models", "paper_summary": "The increasing reliance on online recruitment platforms coupled with the\nadoption of AI technologies has highlighted the critical need for efficient\nresume classification methods. However, challenges such as small datasets, lack\nof standardized resume templates, and privacy concerns hinder the accuracy and\neffectiveness of existing classification models. In this work, we address these\nchallenges by presenting a comprehensive approach to resume classification. We\ncurated a large-scale dataset of 13,389 resumes from diverse sources and\nemployed Large Language Models (LLMs) such as BERT and Gemma1.1 2B for\nclassification. Our results demonstrate significant improvements over\ntraditional machine learning approaches, with our best model achieving a top-1\naccuracy of 92\\% and a top-5 accuracy of 97.5\\%. These findings underscore the\nimportance of dataset quality and advanced model architectures in enhancing the\naccuracy and robustness of resume classification systems, thus advancing the\nfield of online recruitment practices.", "paper_summary_zh": "隨著線上徵才平台的倚賴度日益增加，加上人工智慧技術的採用，凸顯了對於有效履歷分類方法的迫切需求。然而，諸如資料集小、缺乏標準化的履歷範本，以及隱私問題等挑戰，阻礙了現有分類模型的準確性和有效性。在這項工作中，我們透過提出履歷分類的全面性方法來因應這些挑戰。我們從不同的來源整理出一個包含 13,389 份履歷的大規模資料集，並採用大型語言模型 (LLM)，例如 BERT 和 Gemma1.1 2B，進行分類。我們的結果顯示，與傳統機器學習方法相比，有顯著的進步，我們的最佳模型在 top-1 準確率達到 92%，top-5 準確率達到 97.5%。這些發現強調了資料集品質和進階模型架構在提升履歷分類系統的準確性和穩健性方面的重要性，進而促進線上徵才實務領域的發展。", "author": "Ahmed Heakl et.al.", "authors": "Ahmed Heakl, Youssef Mohamed, Noran Mohamed, Ali Sharkaway, Ahmed Zaky", "id": "2406.18125v1", "paper_url": "http://arxiv.org/abs/2406.18125v1", "repo": "null"}}