{"2407.15843": {"publish_time": "2024-07-22", "title": "CarFormer: Self-Driving with Learned Object-Centric Representations", "paper_summary": "The choice of representation plays a key role in self-driving. Bird's eye\nview (BEV) representations have shown remarkable performance in recent years.\nIn this paper, we propose to learn object-centric representations in BEV to\ndistill a complex scene into more actionable information for self-driving. We\nfirst learn to place objects into slots with a slot attention model on BEV\nsequences. Based on these object-centric representations, we then train a\ntransformer to learn to drive as well as reason about the future of other\nvehicles. We found that object-centric slot representations outperform both\nscene-level and object-level approaches that use the exact attributes of\nobjects. Slot representations naturally incorporate information about objects\nfrom their spatial and temporal context such as position, heading, and speed\nwithout explicitly providing it. Our model with slots achieves an increased\ncompletion rate of the provided routes and, consequently, a higher driving\nscore, with a lower variance across multiple runs, affirming slots as a\nreliable alternative in object-centric approaches. Additionally, we validate\nour model's performance as a world model through forecasting experiments,\ndemonstrating its capability to predict future slot representations accurately.\nThe code and the pre-trained models can be found at\nhttps://kuis-ai.github.io/CarFormer/.", "paper_summary_zh": "表示的選擇在自動駕駛中扮演著關鍵的角色。鳥瞰圖 (BEV) 表示在近年來展現了卓越的表現。在本文中，我們提出學習 BEV 中以物體為中心的表示，以將複雜的場景提煉成更具可操作性的資訊，用於自動駕駛。我們首先學習使用 BEV 序列上的插槽注意力模型將物體放入插槽中。根據這些以物體為中心的表示，我們接著訓練一個轉換器來學習駕駛，以及推論其他車輛的未來。我們發現以物體為中心的插槽表示優於使用物體確切屬性的場景級別和物體級別方法。插槽表示自然地結合了來自物體空間和時間脈絡的資訊，例如位置、航向和速度，而無需明確提供。我們帶有插槽的模型提高了所提供路線的完成率，因此提高了駕駛分數，並且在多次執行中的差異較低，證實插槽是以物體為中心的方法中可靠的替代方案。此外，我們透過預測實驗驗證了我們模型作為世界模型的效能，證明了其準確預測未來插槽表示的能力。程式碼和預訓練模型可以在 https://kuis-ai.github.io/CarFormer/ 找到。", "author": "Shadi Hamdan et.al.", "authors": "Shadi Hamdan, Fatma Güney", "id": "2407.15843v1", "paper_url": "http://arxiv.org/abs/2407.15843v1", "repo": "null"}}