{"2412.08435": {"publish_time": "2024-12-11", "title": "Proactive Model Adaptation Against Concept Drift for Online Time Series Forecasting", "paper_summary": "Time series forecasting always faces the challenge of concept drift, where\ndata distributions evolve over time, leading to a decline in forecast model\nperformance. Existing solutions are based on online learning, which continually\norganize recent time series observations as new training samples and update\nmodel parameters according to the forecasting feedback on recent data. However,\nthey overlook a critical issue: obtaining ground-truth future values of each\nsample should be delayed until after the forecast horizon. This delay creates a\ntemporal gap between the training samples and the test sample. Our empirical\nanalysis reveals that the gap can introduce concept drift, causing forecast\nmodels to adapt to outdated concepts. In this paper, we present\n\\textsc{Proceed}, a novel proactive model adaptation framework for online time\nseries forecasting. \\textsc{Proceed} first operates by estimating the concept\ndrift between the recently used training samples and the current test sample.\nIt then employs an adaptation generator to efficiently translate the estimated\ndrift into parameter adjustments, proactively adapting the model to the test\nsample. To enhance the generalization capability of the framework,\n\\textsc{Proceed} is trained on synthetic diverse concept drifts. We conduct\nextensive experiments on five real-world datasets across various forecast\nmodels. The empirical study demonstrates that our proposed \\textsc{Proceed}\nbrings more performance improvements than the state-of-the-art online learning\nmethods, significantly facilitating forecast models' resilience against concept\ndrifts.", "paper_summary_zh": "時間序列預測總是面臨概念漂移的挑戰，其中資料分佈會隨著時間演變，導致預測模型效能下降。現有的解決方案基於線上學習，它會持續整理最近的時間序列觀察結果作為新的訓練樣本，並根據最近資料的預測回饋來更新模型參數。然而，它們忽略了一個關鍵問題：每個樣本的真實未來值應延遲到預測範圍之後才能取得。這種延遲會在訓練樣本和測試樣本之間產生時間差距。我們的經驗分析顯示，這個差距可能會引發概念漂移，導致預測模型適應過時的觀念。在本文中，我們提出 \\textsc{Proceed}，一個新的主動模型適應架構，用於線上時間序列預測。\\textsc{Proceed} 首先透過估計最近使用的訓練樣本和當前測試樣本之間的概念漂移來運作。然後，它使用適應產生器有效地將估計的漂移轉換為參數調整，主動地將模型適應到測試樣本。為了增強架構的泛化能力，\\textsc{Proceed} 在合成多樣化的概念漂移上進行訓練。我們對五個真實世界的資料集進行了廣泛的實驗，涵蓋各種預測模型。實證研究表明，我們提出的 \\textsc{Proceed} 比最先進的線上學習方法帶來更多效能提升，大幅提升預測模型對抗概念漂移的韌性。", "author": "Lifan Zhao et.al.", "authors": "Lifan Zhao, Yanyan Shen", "id": "2412.08435v1", "paper_url": "http://arxiv.org/abs/2412.08435v1", "repo": "null"}}