{"2412.06176": {"publish_time": "2024-12-09", "title": "AlphaVerus: Bootstrapping Formally Verified Code Generation through Self-Improving Translation and Treefinement", "paper_summary": "Automated code generation with large language models has gained significant\ntraction, but there remains no guarantee on the correctness of generated code.\nWe aim to use formal verification to provide mathematical guarantees that the\ngenerated code is correct. However, generating formally verified code with LLMs\nis hindered by the scarcity of training data and the complexity of formal\nproofs. To tackle this challenge, we introduce AlphaVerus, a self-improving\nframework that bootstraps formally verified code generation by iteratively\ntranslating programs from a higher-resource language and leveraging feedback\nfrom a verifier. AlphaVerus operates in three phases: exploration of candidate\ntranslations, Treefinement -- a novel tree search algorithm for program\nrefinement using verifier feedback, and filtering misaligned specifications and\nprograms to prevent reward hacking. Through this iterative process, AlphaVerus\nenables a LLaMA-3.1-70B model to generate verified code without human\nintervention or model finetuning. AlphaVerus shows an ability to generate\nformally verified solutions for HumanEval and MBPP, laying the groundwork for\ntruly trustworthy code-generation agents.", "paper_summary_zh": "大型語言模型的自動程式碼生成獲得顯著進展，但產生的程式碼正確性仍無法保證。我們旨在使用形式化驗證，提供產生的程式碼正確性的數學保證。然而，使用 LLM 產生形式化驗證的程式碼，受到訓練資料稀少和形式化證明複雜性的阻礙。為了應對這個挑戰，我們引入了 AlphaVerus，一個自我提升的架構，透過反覆翻譯來自較高資源語言的程式，並利用驗證器的回饋，來引導形式化驗證的程式碼產生。AlphaVerus 以三個階段運作：候選翻譯的探索、Treefinement——一種新穎的樹狀搜尋演算法，用於使用驗證器回饋來改善程式，以及過濾錯誤比對的規格和程式，以防止獎勵駭客攻擊。透過這個反覆的過程，AlphaVerus 能讓 LLaMA-3.1-70B 模型在沒有人工介入或模型微調的情況下，產生驗證的程式碼。AlphaVerus 展示了產生 HumanEval 和 MBPP 的形式化驗證解決方案的能力，為真正值得信賴的程式碼產生代理奠定了基礎。", "author": "Pranjal Aggarwal et.al.", "authors": "Pranjal Aggarwal, Bryan Parno, Sean Welleck", "id": "2412.06176v1", "paper_url": "http://arxiv.org/abs/2412.06176v1", "repo": "null"}}