{"2406.08218": {"publish_time": "2024-06-12", "title": "Figuratively Speaking: Authorship Attribution via Multi-Task Figurative Language Modeling", "paper_summary": "The identification of Figurative Language (FL) features in text is crucial\nfor various Natural Language Processing (NLP) tasks, where understanding of the\nauthor's intended meaning and its nuances is key for successful communication.\nAt the same time, the use of a specific blend of various FL forms most\naccurately reflects a writer's style, rather than the use of any single\nconstruct, such as just metaphors or irony. Thus, we postulate that FL features\ncould play an important role in Authorship Attribution (AA) tasks. We believe\nthat our is the first computational study of AA based on FL use. Accordingly,\nwe propose a Multi-task Figurative Language Model (MFLM) that learns to detect\nmultiple FL features in text at once. We demonstrate, through detailed\nevaluation across multiple test sets, that the our model tends to perform\nequally or outperform specialized binary models in FL detection. Subsequently,\nwe evaluate the predictive capability of joint FL features towards the AA task\non three datasets, observing improved AA performance through the integration of\nMFLM embeddings.", "paper_summary_zh": "在文本中識別比喻語言 (FL) 特徵對於各種自然語言處理 (NLP) 任務至關重要，其中了解作者的預期含義及其細微差別是成功溝通的關鍵。同時，使用各種 FL 形式的特定組合最能準確反映作者的風格，而不是使用任何單一結構，例如比喻或反諷。因此，我們假設 FL 特徵可以在作者歸屬 (AA) 任務中發揮重要作用。我們相信這是第一個基於 FL 使用的 AA 計算研究。因此，我們提出了一個多任務比喻語言模型 (MFLM)，它可以一次學習檢測文本中的多個 FL 特徵。我們通過多個測試集的詳細評估證明，我們的模型在 FL 檢測中往往表現得與專門的二元模型一樣好，甚至表現得更好。隨後，我們評估了聯合 FL 特徵對三個數據集上 AA 任務的預測能力，觀察到通過整合 MFLM 嵌入改進了 AA 性能。", "author": "Gregorios A Katsios et.al.", "authors": "Gregorios A Katsios, Ning Sa, Tomek Strzalkowski", "id": "2406.08218v1", "paper_url": "http://arxiv.org/abs/2406.08218v1", "repo": "null"}}