{"2503.03340": {"publish_time": "2025-03-05", "title": "EnigmaToM: Improve LLMs' Theory-of-Mind Reasoning Capabilities with Neural Knowledge Base of Entity States", "paper_summary": "Theory-of-Mind (ToM), the ability to infer others' perceptions and mental\nstates, is fundamental to human interaction but remains a challenging task for\nLarge Language Models (LLMs). While existing ToM reasoning methods show promise\nwith reasoning via perceptual perspective-taking, they often rely excessively\non LLMs, reducing their efficiency and limiting their applicability to\nhigh-order ToM reasoning, which requires multi-hop reasoning about characters'\nbeliefs. To address these issues, we present EnigmaToM, a novel neuro-symbolic\nframework that enhances ToM reasoning by integrating a Neural Knowledge Base of\nentity states (Enigma) for (1) a psychology-inspired iterative masking\nmechanism that facilitates accurate perspective-taking and (2) knowledge\ninjection that elicits key entity information. Enigma generates structured\nrepresentations of entity states, which construct spatial scene graphs --\nleveraging spatial information as an inductive bias -- for belief tracking of\nvarious ToM orders and enhancing events with fine-grained entity state details.\nExperimental results on multiple benchmarks, including ToMi, HiToM, and FANToM,\nshow that EnigmaToM significantly improves ToM reasoning across LLMs of varying\nsizes, particularly excelling in high-order reasoning scenarios.", "paper_summary_zh": "<paragraph>心智理論 (Theory-of-Mind，ToM)，指的是推斷他人感知和心理狀態的能力，是人類互動的基礎，但對大型語言模型 (LLM) 來說仍然是一項具有挑戰性的任務。雖然現有的 ToM 推理方法在透過感知視角進行推理方面展現出希望，但它們往往過度依賴 LLM，降低了效率，並限制了它們在高階 ToM 推理中的應用，因為高階 ToM 推理需要對角色的信念進行多跳推理。為了應對這些問題，我們提出了 EnigmaToM，這是一個新穎的神經符號框架，它透過整合一個實體狀態的神經知識庫 (Enigma) 來增強 ToM 推理，以實現 (1) 一種受心理學啟發的迭代遮罩機制，促進準確的視角轉換，以及 (2) 知識注入，引出關鍵的實體資訊。Enigma 生成實體狀態的結構化表示，建構空間場景圖——利用空間資訊作為歸納偏差——用於追蹤各種 ToM 階級的信念，並使用細粒度的實體狀態細節來增強事件。在 ToMi、HiToM 和 FANToM 等多個基準測試上的實驗結果表明，EnigmaToM 顯著改善了各種規模 LLM 的 ToM 推理，尤其是在高階推理場景中表現出色。</paragraph>\n", "author": "Hainiu Xu et.al.", "authors": "Hainiu Xu, Siya Qi, Jiazheng Li, Yuxiang Zhou, Jinhua Du, Caroline Catmur, Yulan He", "id": "2503.03340v1", "paper_url": "http://arxiv.org/abs/2503.03340v1", "repo": "null"}}