{"2501.08192": {"publish_time": "2025-01-14", "title": "PRESERVE: Prefetching Model Weights and KV-Cache in Distributed LLM Serving", "paper_summary": "Large language models (LLMs) are widely used across various applications, but\ntheir substantial computational requirements pose significant challenges,\nparticularly in terms of HBM bandwidth bottlenecks and inter-device\ncommunication overhead. In this paper, we present PRESERVE, a novel prefetching\nframework designed to optimize LLM inference by overlapping memory reads for\nmodel weights and KV-cache with collective communication operations. Through\nextensive experiments conducted on commercial AI accelerators, we demonstrate\nup to 1.6x end-to-end speedup on state-of-the-art, open-source LLMs.\nAdditionally, we perform a design space exploration that identifies the optimal\nhardware configuration for the proposed method, showing a further 1.25x\nimprovement in performance per cost by selecting the optimal L2 cache size. Our\nresults show that PRESERVE has the potential to mitigate the memory bottlenecks\nand communication overheads, offering a solution to improve the performance and\nscalability of the LLM inference systems.", "paper_summary_zh": "大型語言模型 (LLM) 廣泛用於各種應用程式中，但其龐大的運算需求帶來嚴峻的挑戰，特別是在 HBM 頻寬瓶頸和裝置間通訊負擔方面。在本文中，我們提出 PRESERVE，一個創新的預先擷取架構，旨在透過重疊模型權重的記憶體讀取和 KV 快取與集體通訊操作，來最佳化 LLM 推論。透過在商用 AI 加速器上進行廣泛的實驗，我們展示了最先進的開源 LLM 可達 1.6 倍的端到端加速。此外，我們執行設計空間探索，找出建議方法的最佳硬體配置，顯示透過選擇最佳 L2 快取大小，效能每成本可進一步提升 1.25 倍。我們的結果顯示 PRESERVE 有可能緩解記憶體瓶頸和通訊負擔，提供一個解決方案來提升 LLM 推論系統的效能和可擴充性。", "author": "Ahmet Caner Yüzügüler et.al.", "authors": "Ahmet Caner Yüzügüler, Jiawei Zhuang, Lukas Cavigelli", "id": "2501.08192v1", "paper_url": "http://arxiv.org/abs/2501.08192v1", "repo": "null"}}