{"2411.03034": {"publish_time": "2024-11-05", "title": "HumanVLM: Foundation for Human-Scene Vision-Language Model", "paper_summary": "Human-scene vision-language tasks are increasingly prevalent in diverse\nsocial applications, yet recent advancements predominantly rely on models\nspecifically tailored to individual tasks. Emerging research indicates that\nlarge vision-language models (VLMs) can enhance performance across various\ndownstream vision-language understanding tasks. However, general-domain models\noften underperform in specialized fields. This study introduces a\ndomain-specific Large Vision-Language Model, Human-Scene Vision-Language Model\n(HumanVLM), designed to provide a foundation for human-scene Vision-Language\ntasks. Specifically, (1) we create a large-scale human-scene multimodal\nimage-text dataset (HumanCaption-10M) sourced from the Internet to facilitate\ndomain-specific alignment; (2) develop a captioning approach for human-centered\nimages, capturing human faces, bodies, and backgrounds, and construct a\nhigh-quality Human-Scene image-text dataset (HumanCaptionHQ, about 311k pairs)\nthat contain as much detailed information as possible about human; (3) Using\nHumanCaption-10M and HumanCaptionHQ, we train a HumanVLM. In the experiments,\nwe then evaluate our HumanVLM across varous downstream tasks, where it\ndemonstrates superior overall performance among multimodal models of comparable\nscale, particularly excelling in human-related tasks and significantly\noutperforming similar models, including Qwen2VL and ChatGPT-4o. HumanVLM,\nalongside the data introduced, will stimulate the research in human-around\nfields.", "paper_summary_zh": "<paragraph>人景視覺語言任務在多元的社交應用中越來越普遍，但近期的進展主要依賴於專門針對個別任務量身打造的模型。新興的研究指出，大型視覺語言模型 (VLM) 可以提升各種下游視覺語言理解任務的效能。然而，一般領域模型在專業領域中常常表現不佳。本研究介紹一種特定領域的大型視覺語言模型，人景視覺語言模型 (HumanVLM)，旨在為人景視覺語言任務提供基礎。具體來說，(1) 我們創建一個從網際網路取得的大型人景多模態影像文字資料集 (HumanCaption-10M)，以利特定領域的對齊；(2) 為以人為中心的影像開發一種標題方法，擷取人臉、身體和背景，並建構一個高品質的人景影像文字資料集 (HumanCaptionHQ，約 311k 對)，其中包含盡可能多的人類詳細資訊；(3) 使用 HumanCaption-10M 和 HumanCaptionHQ，我們訓練了一個 HumanVLM。在實驗中，我們接著評估我們的 HumanVLM 橫跨各種下游任務，它在同等規模的多模態模型中展現出卓越的整體表現，特別是在與人類相關的任務中表現傑出，且大幅優於類似的模型，包括 Qwen2VL 和 ChatGPT-4o。HumanVLM 連同所引入的資料，將會激勵人景領域的研究。</paragraph>", "author": "Dawei Dai et.al.", "authors": "Dawei Dai, Xu Long, Li Yutang, Zhang Yuanhui, Shuyin Xia", "id": "2411.03034v1", "paper_url": "http://arxiv.org/abs/2411.03034v1", "repo": "null"}}