{"2410.11701": {"publish_time": "2024-10-15", "title": "Magnifier Prompt: Tackling Multimodal Hallucination via Extremely Simple Instructions", "paper_summary": "Hallucinations in multimodal large language models (MLLMs) hinder their\npractical applications. To address this, we propose a Magnifier Prompt\n(MagPrompt), a simple yet effective method to tackle hallucinations in MLLMs\nvia extremely simple instructions. MagPrompt is based on the following two key\nprinciples, which guide the design of various effective prompts, demonstrating\nrobustness: (1) MLLMs should focus more on the image. (2) When there are\nconflicts between the image and the model's inner knowledge, MLLMs should\nprioritize the image. MagPrompt is training-free and can be applied to\nopen-source and closed-source models, such as GPT-4o and Gemini-pro. It\nperforms well across many datasets and its effectiveness is comparable or even\nbetter than more complex methods like VCD. Furthermore, our prompt design\nprinciples and experimental analyses provide valuable insights into multimodal\nhallucination.", "paper_summary_zh": "多模态大型语言模型（MLLM）中的幻觉阻碍了它们的实际应用。为了解决这个问题，我们提出了放大提示（MagPrompt），这是一种简单但有效的方法，可以通过极其简单的指令来解决 MLLM 中的幻觉。MagPrompt 基于以下两个关键原则，这些原则指导各种有效提示的设计，展示了鲁棒性：（1）MLLM 应该更多地关注图像。（2）当图像与模型的内部知识之间存在冲突时，MLLM 应优先考虑图像。MagPrompt 是免训练的，可以应用于开源和闭源模型，例如 GPT-4o 和 Gemini-pro。它在许多数据集上的表现良好，其有效性与 VCD 等更复杂的方法相当甚至更好。此外，我们的提示设计原则和实验分析为多模态幻觉提供了宝贵的见解。", "author": "Yuhan Fu et.al.", "authors": "Yuhan Fu, Ruobing Xie, Jiazhen Liu, Bangxiang Lan, Xingwu Sun, Zhanhui Kang, Xirong Li", "id": "2410.11701v1", "paper_url": "http://arxiv.org/abs/2410.11701v1", "repo": "null"}}