{"2502.02874": {"publish_time": "2025-02-05", "title": "Vertical Federated Learning for Failure-Cause Identification in Disaggregated Microwave Networks", "paper_summary": "Machine Learning (ML) has proven to be a promising solution to provide novel\nscalable and efficient fault management solutions in modern 5G-and-beyond\ncommunication networks. In the context of microwave networks, ML-based\nsolutions have received significant attention. However, current solutions can\nonly be applied to monolithic scenarios in which a single entity (e.g., an\noperator) manages the entire network. As current network architectures move\ntowards disaggregated communication platforms in which multiple operators and\nvendors collaborate to achieve cost-efficient and reliable network management,\nnew ML-based approaches for fault management must tackle the challenges of\nsharing business-critical information due to potential conflicts of interest.\nIn this study, we explore the application of Federated Learning in\ndisaggregated microwave networks for failure-cause identification using a real\nmicrowave hardware failure dataset. In particular, we investigate the\napplication of two Vertical Federated Learning (VFL), namely using Split Neural\nNetworks (SplitNNs) and Federated Learning based on Gradient Boosting Decision\nTrees (FedTree), on different multi-vendor deployment scenarios, and we compare\nthem to a centralized scenario where data is managed by a single entity. Our\nexperimental results show that VFL-based scenarios can achieve F1-Scores\nconsistently within at most a 1% gap with respect to a centralized scenario,\nregardless of the deployment strategies or model types, while also ensuring\nminimal leakage of sensitive-data.", "paper_summary_zh": "機器學習（ML）已被證明是一個有前途的解決方案，用於在現代 5G 及後續通訊網路中提供新穎、可擴充且高效的故障管理解決方案。在微波網路的背景下，基於 ML 的解決方案已受到顯著關注。然而，目前的解決方案只能應用於單一實體（例如，營運商）管理整個網路的單體式場景。隨著當前網路架構朝向分散式通訊平台發展，其中多個營運商和供應商合作以達成具成本效益且可靠的網路管理，基於 ML 的故障管理新方法必須應對由於潛在利益衝突而共享業務關鍵資訊的挑戰。在本研究中，我們探討了聯邦學習在分散式微波網路中應用於故障原因識別，並使用真實微波硬體故障資料集。特別是，我們探討了兩種垂直聯邦學習（VFL）的應用，即使用分割神經網路（SplitNN）和基於梯度提升決策樹的聯邦學習（FedTree），在不同的多供應商部署場景中，並將它們與由單一實體管理資料的集中式場景進行比較。我們的實驗結果表明，基於 VFL 的場景可以持續達成 F1 分數，與集中式場景相比，差距最多只有 1%，無論部署策略或模型類型如何，同時還能確保敏感資料的洩漏最小化。", "author": "Fatih Temiz et.al.", "authors": "Fatih Temiz, Memedhe Ibrahimi, Francesco Musumeci, Claudio Passera, Massimo Tornatore", "id": "2502.02874v1", "paper_url": "http://arxiv.org/abs/2502.02874v1", "repo": "null"}}