{"2409.16678": {"publish_time": "2024-09-25", "title": "TSBP: Improving Object Detection in Histology Images via Test-time Self-guided Bounding-box Propagation", "paper_summary": "A global threshold (e.g., 0.5) is often applied to determine which bounding\nboxes should be included in the final results for an object detection task. A\nhigher threshold reduces false positives but may result in missing a\nsignificant portion of true positives. A lower threshold can increase detection\nrecall but may also result in more false positives. Because of this, using a\npreset global threshold (e.g., 0.5) applied to all the bounding box candidates\nmay lead to suboptimal solutions. In this paper, we propose a Test-time\nSelf-guided Bounding-box Propagation (TSBP) method, leveraging Earth Mover's\nDistance (EMD) to enhance object detection in histology images. TSBP utilizes\nbounding boxes with high confidence to influence those with low confidence,\nleveraging visual similarities between them. This propagation mechanism enables\nbounding boxes to be selected in a controllable, explainable, and robust\nmanner, which surpasses the effectiveness of using simple thresholds and\nuncertainty calibration methods. Importantly, TSBP does not necessitate\nadditional labeled samples for model training or parameter estimation, unlike\ncalibration methods. We conduct experiments on gland detection and cell\ndetection tasks in histology images. The results show that our proposed TSBP\nsignificantly improves detection outcomes when working in conjunction with\nstate-of-the-art deep learning-based detection networks. Compared to other\nmethods such as uncertainty calibration, TSBP yields more robust and accurate\nobject detection predictions while using no additional labeled samples. The\ncode is available at https://github.com/jwhgdeu/TSBP.", "paper_summary_zh": "<paragraph>在目標偵測任務中，通常會套用一個全域閾值（例如 0.5）來決定哪些邊界框應包含在最終結果中。較高的閾值會降低誤報，但可能會導致遺漏大量真陽性。較低的閾值會提高偵測召回率，但也可能導致更多誤報。因此，將預設的全域閾值（例如 0.5）套用至所有邊界框候選項可能會導致次佳解。在本文中，我們提出一個測試時間自導邊界框傳播 (TSBP) 方法，利用 Earth Mover's Distance (EMD) 來增強組織學影像中的目標偵測。TSBP 利用高信心的邊界框來影響低信心的邊界框，並利用它們之間的視覺相似性。這種傳播機制讓邊界框能夠以可控、可解釋且穩健的方式進行選擇，這超越了使用簡單閾值和不確定性校正方法的有效性。重要的是，與校正方法不同，TSBP 不需要額外標記樣本進行模型訓練或參數估計。我們針對組織學影像中的腺體偵測和細胞偵測任務進行實驗。結果顯示，我們提出的 TSBP 在與最先進的基於深度學習的偵測網路結合使用時，顯著改善了偵測結果。與其他方法（例如不確定性校正）相比，TSBP 在不使用任何額外標記樣本的情況下，產生更穩健且準確的目標偵測預測。程式碼可於 https://github.com/jwhgdeu/TSBP 取得。</paragraph>", "author": "Tingting Yang et.al.", "authors": "Tingting Yang, Liang Xiao, Yizhe Zhang", "id": "2409.16678v1", "paper_url": "http://arxiv.org/abs/2409.16678v1", "repo": "https://github.com/jwhgdeu/tsbp"}}