{"2405.20582": {"publish_time": "2024-05-31", "title": "The Point of View of a Sentiment: Towards Clinician Bias Detection in Psychiatric Notes", "paper_summary": "In psychiatry, negative patient descriptions and stigmatizing language can\ncontribute to healthcare disparities in two ways: (1) read by patients they can\nharm their trust and engagement with the medical center; (2) read by future\nproviders they may negatively influence the future perspective of a patient. By\nleveraging large language models, this work aims to identify the sentiment\nexpressed in psychiatric clinical notes based on the reader's point of view.\nExtracting sentences from the Mount Sinai Health System's large and diverse\nclinical notes, we used prompts and in-context learning to adapt three large\nlanguage models (GPT-3.5, Llama 2, Mistral) to classify the sentiment conveyed\nby the sentences according to the provider or non-provider point of view.\nResults showed that GPT-3.5 aligns best to provider point of view, whereas\nMistral aligns best to non-provider point of view.", "paper_summary_zh": "在精神病學中，負面的病人描述和污名化的語言可能透過兩種方式造成醫療保健差異：(1) 病人讀到後會損害他們對醫療中心的信任和參與；(2) 未來的提供者讀到後，可能會對病人的未來觀點產生負面影響。透過利用大型語言模型，這項工作旨在根據讀者的觀點，找出精神病臨床筆記中表達的情緒。從西奈山健康系統的大量且多樣化的臨床筆記中摘錄句子，我們使用提示和情境學習來調整三個大型語言模型 (GPT-3.5、Llama 2、Mistral)，以根據提供者或非提供者觀點對句子傳達的情緒進行分類。結果顯示，GPT-3.5 最符合提供者觀點，而 Mistral 最符合非提供者觀點。", "author": "Alissa A. Valentine et.al.", "authors": "Alissa A. Valentine, Lauren A. Lepow, Alexander W. Charney, Isotta Landi", "id": "2405.20582v1", "paper_url": "http://arxiv.org/abs/2405.20582v1", "repo": "null"}}