{"2501.12275": {"publish_time": "2025-01-21", "title": "With Great Backbones Comes Great Adversarial Transferability", "paper_summary": "Advances in self-supervised learning (SSL) for machine vision have improved\nrepresentation robustness and model performance, giving rise to pre-trained\nbackbones like \\emph{ResNet} and \\emph{ViT} models tuned with SSL methods such\nas \\emph{SimCLR}. Due to the computational and data demands of pre-training,\nthe utilization of such backbones becomes a strenuous necessity. However,\nemploying these backbones may inherit vulnerabilities to adversarial attacks.\nWhile adversarial robustness has been studied under \\emph{white-box} and\n\\emph{black-box} settings, the robustness of models tuned on pre-trained\nbackbones remains largely unexplored. Additionally, the role of tuning\nmeta-information in mitigating exploitation risks is unclear. This work\nsystematically evaluates the adversarial robustness of such models across\n$20,000$ combinations of tuning meta-information, including fine-tuning\ntechniques, backbone families, datasets, and attack types. We propose using\nproxy models to transfer attacks, simulating varying levels of target knowledge\nby fine-tuning these proxies with diverse configurations. Our findings reveal\nthat proxy-based attacks approach the effectiveness of \\emph{white-box}\nmethods, even with minimal tuning knowledge. We also introduce a naive\n\"backbone attack,\" leveraging only the backbone to generate adversarial\nsamples, which outperforms \\emph{black-box} attacks and rivals \\emph{white-box}\nmethods, highlighting critical risks in model-sharing practices. Finally, our\nablations reveal how increasing tuning meta-information impacts attack\ntransferability, measuring each meta-information combination.", "paper_summary_zh": "<paragraph>機器視覺的自監督學習 (SSL) 進步提升了表示穩健性和模型效能，產生預先訓練的骨幹，例如使用 SSL 方法（例如 SimCLR）調整的 ResNet 和 ViT 模型。由於預先訓練的運算和資料需求，使用此類骨幹變得極為必要。然而，採用這些骨幹可能會繼承對抗攻擊的漏洞。儘管在白盒和黑盒設定下已研究對抗穩健性，但預先訓練骨幹上調整的模型的穩健性仍未得到充分探討。此外，調整元資訊在減輕利用風險中的作用尚不清楚。本研究系統性地評估此類模型在 20,000 種調整元資訊組合中的對抗穩健性，包括微調技術、骨幹系列、資料集和攻擊類型。我們建議使用代理模型來傳輸攻擊，透過使用不同的組態微調這些代理模型來模擬不同層級的目標知識。我們的研究結果顯示，即使調整知識最少，基於代理的攻擊也接近白盒方法的有效性。我們還引入了一個天真的「骨幹攻擊」，僅利用骨幹產生對抗樣本，其表現優於黑盒攻擊，並與白盒方法相抗衡，突顯模型分享實務中的關鍵風險。最後，我們的消融實驗揭示了增加調整元資訊如何影響攻擊可傳遞性，並衡量每個元資訊組合。</paragraph>", "author": "Erik Arakelyan et.al.", "authors": "Erik Arakelyan, Karen Hambardzumyan, Davit Papikyan, Pasquale Minervini, Albert Gordo, Isabelle Augenstein, Aram H. Markosyan", "id": "2501.12275v1", "paper_url": "http://arxiv.org/abs/2501.12275v1", "repo": "null"}}