{"2501.07857": {"publish_time": "2025-01-14", "title": "Hierarchical Repository-Level Code Summarization for Business Applications Using Local LLMs", "paper_summary": "In large-scale software development, understanding the functionality and\nintent behind complex codebases is critical for effective development and\nmaintenance. While code summarization has been widely studied, existing methods\nprimarily focus on smaller code units, such as functions, and struggle with\nlarger code artifacts like files and packages. Additionally, current\nsummarization models tend to emphasize low-level implementation details, often\noverlooking the domain and business context that are crucial for real-world\napplications. This paper proposes a two-step hierarchical approach for\nrepository-level code summarization, tailored to business applications. First,\nsmaller code units such as functions and variables are identified using syntax\nanalysis and summarized with local LLMs. These summaries are then aggregated to\ngenerate higher-level file and package summaries. To ensure the summaries are\ngrounded in business context, we design custom prompts that capture the\nintended purpose of code artifacts based on the domain and problem context of\nthe business application. We evaluate our approach on a business support system\n(BSS) for the telecommunications domain, showing that syntax analysis-based\nhierarchical summarization improves coverage, while business-context grounding\nenhances the relevance of the generated summaries.", "paper_summary_zh": "在大規模軟體開發中，了解複雜程式碼庫背後的運作功能和意圖對於有效開發和維護至關重要。雖然程式碼摘要已被廣泛研究，但現有方法主要集中於較小的程式碼單元，例如函式，並且難以處理更大的程式碼人工製品，例如檔案和套件。此外，目前的摘要模型傾向於強調低層級的實作細節，通常忽略了對於真實世界應用程式至關重要的網域和商業脈絡。本文提出了一個針對商業應用程式量身打造的兩步驟階層式方法，用於儲存庫層級程式碼摘要。首先，使用語法分析識別較小的程式碼單元，例如函式和變數，並使用區域 LLM 進行摘要。然後將這些摘要彙總以產生更高級別的檔案和套件摘要。為確保摘要建立在商業脈絡中，我們設計了自訂提示，根據商業應用的網域和問題脈絡擷取程式碼人工製品的預期目的。我們在電信網域的商業支援系統 (BSS) 上評估了我們的做法，結果顯示基於語法分析的階層式摘要改進了涵蓋範圍，而商業脈絡基礎則增強了所產生摘要的相關性。", "author": "Nilesh Dhulshette et.al.", "authors": "Nilesh Dhulshette, Sapan Shah, Vinay Kulkarni", "id": "2501.07857v1", "paper_url": "http://arxiv.org/abs/2501.07857v1", "repo": "null"}}