{"2411.11262": {"publish_time": "2024-11-18", "title": "Cross-Patient Pseudo Bags Generation and Curriculum Contrastive Learning for Imbalanced Multiclassification of Whole Slide Image", "paper_summary": "Pathology computing has dramatically improved pathologists' workflow and\ndiagnostic decision-making processes. Although computer-aided diagnostic\nsystems have shown considerable value in whole slide image (WSI) analysis, the\nproblem of multi-classification under sample imbalance remains an intractable\nchallenge. To address this, we propose learning fine-grained information by\ngenerating sub-bags with feature distributions similar to the original WSIs.\nAdditionally, we utilize a pseudo-bag generation algorithm to further leverage\nthe abundant and redundant information in WSIs, allowing efficient training in\nunbalanced-sample multi-classification tasks. Furthermore, we introduce an\naffinity-based sample selection and curriculum contrastive learning strategy to\nenhance the stability of model representation learning. Unlike previous\napproaches, our framework transitions from learning bag-level representations\nto understanding and exploiting the feature distribution of multi-instance\nbags. Our method demonstrates significant performance improvements on three\ndatasets, including tumor classification and lymph node metastasis. On average,\nit achieves a 4.39-point improvement in F1 score compared to the second-best\nmethod across the three tasks, underscoring its superior performance.", "paper_summary_zh": "病理计算已大幅改善病理学家的工作流程和诊断决策过程。虽然计算机辅助诊断系统已在全切片图像 (WSI) 分析中显示出相当大的价值，但样本不平衡下的多分类问题仍然是一个棘手的挑战。为了解决这个问题，我们提出通过生成具有类似于原始 WSI 的特征分布的子袋来学习细粒度信息。此外，我们利用伪袋生成算法来进一步利用 WSI 中丰富且冗余的信息，从而允许在不平衡样本多分类任务中进行高效训练。此外，我们引入了一种基于亲和力的样本选择和课程对比学习策略来增强模型表示学习的稳定性。与以前的方法不同，我们的框架从学习袋级表示转换到理解和利用多实例袋的特征分布。我们的方法在三个数据集上展示了显著的性能提升，包括肿瘤分类和淋巴结转移。平均而言，与三个任务中的第二好方法相比，它的 F1 得分提高了 4.39 分，突出了其卓越的性能。", "author": "Yonghuang Wu et.al.", "authors": "Yonghuang Wu, Xuan Xie, Xinyuan Niu, Chengqian Zhao, Jinhua Yu", "id": "2411.11262v1", "paper_url": "http://arxiv.org/abs/2411.11262v1", "repo": "null"}}