{"2502.13604": {"publish_time": "2025-02-19", "title": "BeamLoRA: Beam-Constraint Low-Rank Adaptation", "paper_summary": "Due to the demand for efficient fine-tuning of large language models,\nLow-Rank Adaptation (LoRA) has been widely adopted as one of the most effective\nparameter-efficient fine-tuning methods. Nevertheless, while LoRA improves\nefficiency, there remains room for improvement in accuracy. Herein, we adopt a\nnovel perspective to assess the characteristics of LoRA ranks. The results\nreveal that different ranks within the LoRA modules not only exhibit varying\nlevels of importance but also evolve dynamically throughout the fine-tuning\nprocess, which may limit the performance of LoRA. Based on these findings, we\npropose BeamLoRA, which conceptualizes each LoRA module as a beam where each\nrank naturally corresponds to a potential sub-solution, and the fine-tuning\nprocess becomes a search for the optimal sub-solution combination. BeamLoRA\ndynamically eliminates underperforming sub-solutions while expanding the\nparameter space for promising ones, enhancing performance with a fixed rank.\nExtensive experiments across three base models and 12 datasets spanning math\nreasoning, code generation, and commonsense reasoning demonstrate that BeamLoRA\nconsistently enhances the performance of LoRA, surpassing the other baseline\nmethods.", "paper_summary_zh": "由於對大型語言模型進行高效微調的需求，\n低階改編 (LoRA) 已被廣泛採用為最有效的\n參數高效微調方法之一。儘管如此，雖然 LoRA 提高了\n效率，但準確性仍有改進空間。在此，我們採用一\n種新穎的觀點來評估 LoRA 等級的特徵。結果\n顯示，LoRA 模組內的不同等級不僅表現出不同的\n重要性，而且在微調過程中也會動態演變，這可能會限制 LoRA 的效能。根據這些發現，我們\n提出 BeamLoRA，將每個 LoRA 模組概念化為一個波束，其中每個\n等級自然對應於一個潛在的子解決方案，而微調\n過程變成搜尋最佳子解決方案組合。BeamLoRA\n動態消除表現不佳的子解決方案，同時擴展有前途的子解決方案的參數空間，以固定等級提升效能。\n跨越三個基礎模型和涵蓋數學\n推理、程式碼生成和常識推理的 12 個資料集的廣泛實驗證明，BeamLoRA\n始終提升 LoRA 的效能，超越其他基準\n方法。", "author": "Naibin Gu et.al.", "authors": "Naibin Gu, Zhenyu Zhang, Xiyu Liu, Peng Fu, Zheng Lin, Shuohuan Wang, Yu Sun, Hua Wu, Weiping Wang, Haifeng Wang", "id": "2502.13604v1", "paper_url": "http://arxiv.org/abs/2502.13604v1", "repo": "null"}}