{"2502.13881": {"publish_time": "2025-02-19", "title": "PSCon: Toward Conversational Product Search", "paper_summary": "Conversational Product Search (CPS) is confined to simulated conversations\ndue to the lack of real-world CPS datasets that reflect human-like language.\nAdditionally, current conversational datasets are limited to support\ncross-market and multi-lingual usage. In this paper, we introduce a new CPS\ndata collection protocol and present PSCon, a novel CPS dataset designed to\nassist product search via human-like conversations. The dataset is constructed\nusing a coached human-to-human data collection protocol and supports two\nlanguages and dual markets. Also, the dataset enables thorough exploration of\nsix subtasks of CPS: user intent detection, keyword extraction, system action\nprediction, question selection, item ranking, and response generation.\nFurthermore, we also offer an analysis of the dataset and propose a benchmark\nmodel on the proposed CPS dataset.", "paper_summary_zh": "對話式商品搜尋 (CPS) 由於缺乏反映人類語言的真實世界 CPS 資料集，因此僅限於模擬對話。此外，目前的對話式資料集僅支援跨市場和多語言使用。在本文中，我們介紹一種新的 CPS 資料收集協定，並提出 PSCon，這是一個新穎的 CPS 資料集，旨在透過類似人類的對話協助商品搜尋。該資料集是使用輔導式人對人資料收集協定建構的，並支援兩種語言和兩個市場。此外，該資料集能徹底探索 CPS 的六個子任務：使用者意圖偵測、關鍵字萃取、系統動作預測、問題選擇、商品排名和回應產生。此外，我們還提供對資料集的分析，並在建議的 CPS 資料集上提出一個基準模型。", "author": "Jie Zou et.al.", "authors": "Jie Zou, Mohammad Aliannejadi, Evangelos Kanoulas, Shuxi Han, Heli Ma, Zheng Wang, Yang Yang, Heng Tao Shen", "id": "2502.13881v1", "paper_url": "http://arxiv.org/abs/2502.13881v1", "repo": "null"}}