{"2502.09168": {"publish_time": "2025-02-13", "title": "Musical Heritage Historical Entity Linking", "paper_summary": "Linking named entities occurring in text to their corresponding entity in a\nKnowledge Base (KB) is challenging, especially when dealing with historical\ntexts. In this work, we introduce Musical Heritage named Entities Recognition,\nClassification and Linking (MHERCL), a novel benchmark consisting of manually\nannotated sentences extrapolated from historical periodicals of the music\ndomain. MHERCL contains named entities under-represented or absent in the most\nfamous KBs. We experiment with several State-of-the-Art models on the Entity\nLinking (EL) task and show that MHERCL is a challenging dataset for all of\nthem. We propose a novel unsupervised EL model and a method to extend\nsupervised entity linkers by using Knowledge Graphs (KGs) to tackle the main\ndifficulties posed by historical documents. Our experiments reveal that relying\non unsupervised techniques and improving models with logical constraints based\non KGs and heuristics to predict NIL entities (entities not represented in the\nKB of reference) results in better EL performance on historical documents.", "paper_summary_zh": "將文本中出現的名稱實體連結到知識庫 (KB) 中對應的實體具有挑戰性，尤其是在處理歷史文本時。在這項工作中，我們引入了音樂遺產命名實體識別、分類和連結 (MHERCL)，這是一個由從音樂領域的歷史期刊中外推的手動標註句子組成的全新基準。MHERCL 包含在最著名的 KB 中代表性不足或不存在的名稱實體。我們在實體連結 (EL) 任務中對多個最先進的模型進行了實驗，並表明 MHERCL 對所有模型來說都是一個具有挑戰性的資料集。我們提出了一個新的無監督 EL 模型和一個通過使用知識圖 (KG) 來擴充監督式實體連結器的的方法，以解決歷史文件提出的主要難題。我們的實驗表明，依賴無監督技術並使用基於 KG 和啟發法的邏輯約束來改善模型以預測 NIL 實體（未在參考 KB 中表示的實體）會在歷史文件中產生更好的 EL 效能。", "author": "Arianna Graciotti et.al.", "authors": "Arianna Graciotti, Nicolas Lazzari, Valentina Presutti, Rocco Tripodi", "id": "2502.09168v1", "paper_url": "http://arxiv.org/abs/2502.09168v1", "repo": "null"}}