{"2411.10213": {"publish_time": "2024-11-15", "title": "An Empirical Study on LLM-based Agents for Automated Bug Fixing", "paper_summary": "Large language models (LLMs) and LLM-based Agents have been applied to fix\nbugs automatically, demonstrating the capability in addressing software defects\nby engaging in development environment interaction, iterative validation and\ncode modification. However, systematic analysis of these agent and non-agent\nsystems remain limited, particularly regarding performance variations among\ntop-performing ones. In this paper, we examine seven proprietary and\nopen-source systems on the SWE-bench Lite benchmark for automated bug fixing.\nWe first assess each system's overall performance, noting instances solvable by\nall or none of these sytems, and explore why some instances are uniquely solved\nby specific system types. We also compare fault localization accuracy at file\nand line levels and evaluate bug reproduction capabilities, identifying\ninstances solvable only through dynamic reproduction. Through analysis, we\nconcluded that further optimization is needed in both the LLM itself and the\ndesign of Agentic flow to improve the effectiveness of the Agent in bug fixing.", "paper_summary_zh": "大型語言模型 (LLM) 和基於 LLM 的代理已應用於自動修復錯誤，展示了通過參與開發環境互動、反覆驗證和程式碼修改來解決軟體缺陷的能力。然而，對這些代理和非代理系統的系統分析仍然有限，特別是關於頂尖系統之間的效能差異。在本文中，我們在 SWE-bench Lite 基準上檢查了七個專有和開源系統，用於自動修復錯誤。我們首先評估每個系統的整體效能，記錄所有或沒有這些系統可以解決的實例，並探討為什麼某些實例是由特定系統類型獨特解決的。我們還比較了檔案和程式碼行的故障定位準確度，並評估錯誤重現能力，識別僅通過動態重現才能解決的實例。透過分析，我們得出結論，需要進一步最佳化 LLM 本身和代理流程的設計，以提高代理在錯誤修復中的有效性。", "author": "Xiangxin Meng et.al.", "authors": "Xiangxin Meng, Zexiong Ma, Pengfei Gao, Chao Peng", "id": "2411.10213v1", "paper_url": "http://arxiv.org/abs/2411.10213v1", "repo": "null"}}