{"2412.14056": {"publish_time": "2024-12-18", "title": "A Review of Multimodal Explainable Artificial Intelligence: Past, Present and Future", "paper_summary": "Artificial intelligence (AI) has rapidly developed through advancements in\ncomputational power and the growth of massive datasets. However, this progress\nhas also heightened challenges in interpreting the \"black-box\" nature of AI\nmodels. To address these concerns, eXplainable AI (XAI) has emerged with a\nfocus on transparency and interpretability to enhance human understanding and\ntrust in AI decision-making processes. In the context of multimodal data fusion\nand complex reasoning scenarios, the proposal of Multimodal eXplainable AI\n(MXAI) integrates multiple modalities for prediction and explanation tasks.\nMeanwhile, the advent of Large Language Models (LLMs) has led to remarkable\nbreakthroughs in natural language processing, yet their complexity has further\nexacerbated the issue of MXAI. To gain key insights into the development of\nMXAI methods and provide crucial guidance for building more transparent, fair,\nand trustworthy AI systems, we review the MXAI methods from a historical\nperspective and categorize them across four eras: traditional machine learning,\ndeep learning, discriminative foundation models, and generative LLMs. We also\nreview evaluation metrics and datasets used in MXAI research, concluding with a\ndiscussion of future challenges and directions. A project related to this\nreview has been created at https://github.com/ShilinSun/mxai_review.", "paper_summary_zh": "人工智慧 (AI) 透過計算能力的進步以及大量資料集的成長而快速發展。然而，此進展也加劇了詮釋 AI 模型「黑盒子」特性的挑戰。為了解決這些問題，可解釋 AI (XAI) 已應運而生，專注於透明度和可解釋性，以增強人類對 AI 決策流程的理解和信任。在多模態資料融合和複雜推理情境中，多模態可解釋 AI (MXAI) 的提案整合了多種模態，以進行預測和解釋任務。同時，大型語言模型 (LLM) 的出現已導致自然語言處理的顯著突破，但其複雜性進一步加劇了 MXAI 的問題。為了深入了解 MXAI 方法的發展，並為建立更透明、公平且值得信賴的 AI 系統提供關鍵指導，我們從歷史角度回顧 MXAI 方法，並將其分為四個時代：傳統機器學習、深度學習、判別基礎模型和生成式 LLM。我們也回顧了 MXAI 研究中使用的評估指標和資料集，並在最後討論未來的挑戰和方向。與此回顧相關的專案已建立於 https://github.com/ShilinSun/mxai_review。", "author": "Shilin Sun et.al.", "authors": "Shilin Sun, Wenbin An, Feng Tian, Fang Nan, Qidong Liu, Jun Liu, Nazaraf Shah, Ping Chen", "id": "2412.14056v1", "paper_url": "http://arxiv.org/abs/2412.14056v1", "repo": "https://github.com/shilinsun/mxai_review"}}