{"2407.08675": {"publish_time": "2024-07-11", "title": "CAD-Prompted Generative Models: A Pathway to Feasible and Novel Engineering Designs", "paper_summary": "Text-to-image generative models have increasingly been used to assist\ndesigners during concept generation in various creative domains, such as\ngraphic design, user interface design, and fashion design. However, their\napplications in engineering design remain limited due to the models' challenges\nin generating images of feasible designs concepts. To address this issue, this\npaper introduces a method that improves the design feasibility by prompting the\ngeneration with feasible CAD images. In this work, the usefulness of this\nmethod is investigated through a case study with a bike design task using an\noff-the-shelf text-to-image model, Stable Diffusion 2.1. A diverse set of bike\ndesigns are produced in seven different generation settings with varying CAD\nimage prompting weights, and these designs are evaluated on their perceived\nfeasibility and novelty. Results demonstrate that the CAD image prompting\nsuccessfully helps text-to-image models like Stable Diffusion 2.1 create\nvisibly more feasible design images. While a general tradeoff is observed\nbetween feasibility and novelty, when the prompting weight is kept low around\n0.35, the design feasibility is significantly improved while its novelty\nremains on par with those generated by text prompts alone. The insights from\nthis case study offer some guidelines for selecting the appropriate CAD image\nprompting weight for different stages of the engineering design process. When\nutilized effectively, our CAD image prompting method opens doors to a wider\nrange of applications of text-to-image models in engineering design.", "paper_summary_zh": "文本到影像的生成模型越來越常被用於協助設計師在各種創意領域中進行概念生成，例如平面設計、使用者介面設計和時尚設計。然而，由於模型在生成可行的設計概念影像時面臨挑戰，因此它們在工程設計中的應用仍然有限。為了解決這個問題，本文介紹了一種方法，透過使用可行的 CAD 影像提示生成，來改善設計的可行性。在這項工作中，透過使用現成的文本到影像模型 Stable Diffusion 2.1 進行自行車設計任務的案例研究，來探討這種方法的實用性。在七種不同的生成設定中，使用不同的 CAD 影像提示權重產生了多樣化的自行車設計，並針對這些設計的感知可行性和新穎性進行評估。結果表明，CAD 影像提示確實有助於像 Stable Diffusion 2.1 這樣的文本到影像模型建立出可見度更高的可行設計影像。雖然在可行性和新穎性之間觀察到了一般的權衡，但當提示權重保持在 0.35 左右的較低水準時，設計的可行性會顯著提升，而其新穎性則與僅由文字提示產生的設計保持一致。這個案例研究的見解為選擇適當的 CAD 影像提示權重以利於工程設計流程的不同階段提供了一些準則。當有效運用時，我們的 CAD 影像提示方法為文本到影像模型在工程設計中更廣泛的應用開啟了大門。", "author": "Leah Chong et.al.", "authors": "Leah Chong, Jude Rayan, Steven Dow, Ioanna Lykourentzou, Faez Ahmed", "id": "2407.08675v1", "paper_url": "http://arxiv.org/abs/2407.08675v1", "repo": "null"}}