{"2501.12955": {"publish_time": "2025-01-22", "title": "Multifractal hopscotch in \"Hopscotch\" by Julio Cortazar", "paper_summary": "Punctuation is the main factor introducing correlations in natural language\nwritten texts and it crucially impacts their overall effectiveness,\nexpressiveness, and readability. Punctuation marks at the end of sentences are\nof particular importance as their distribution can determine various complexity\nfeatures of written natural language. Here, the sentence length variability\n(SLV) time series representing \"Hopscotch\" by Julio Cortazar are subjected to\nquantitative analysis with an attempt to identify their distribution type,\nlong-memory effects, and potential multiscale patterns. The analyzed novel is\nan important and innovative piece of literature whose essential property is\nfreedom of movement between its building blocks given to a reader by the\nauthor. The statistical consequences of this freedom are closely investigated\nin both the original, Spanish version of the novel, and its translations into\nEnglish and Polish. Clear evidence of rich multifractality in the SLV dynamics,\nwith a left-sided asymmetry, however, is observed in all three language\nversions as well as in the versions with differently ordered chapters.", "paper_summary_zh": "標點符號是自然語言書面文本中引入關聯性的主要因素，並且它對其整體有效性、表達性和可讀性產生至關重要的影響。句子結尾的標點符號特別重要，因為它們的分布可以決定書面自然語言的各種複雜性特徵。在此，由胡里奧·科塔薩爾撰寫的「跳房子」句子長度可變性 (SLV) 時間序列經過定量分析，試圖識別它們的分布類型、長記憶效應和潛在的多尺度模式。所分析的小說是一部重要且創新的文學作品，其基本屬性是作者賦予讀者的構建模組之間的自由移動。這種自由的統計後果在小說的西班牙語原版及其英文和波蘭文譯本中都受到密切研究。然而，在三種語言版本以及章節順序不同的版本中，都觀察到 SLV 動力學中豐富的多重分形性，具有左偏不對稱性。", "author": "Jakub Dec et.al.", "authors": "Jakub Dec, Michał Dolina, Stanisław Drożdż, Jarosław Kwapień, Tomasz Stanisz", "id": "2501.12955v1", "paper_url": "http://arxiv.org/abs/2501.12955v1", "repo": "null"}}