{"2407.08257": {"publish_time": "2024-07-11", "title": "Knowledge distillation to effectively attain both region-of-interest and global semantics from an image where multiple objects appear", "paper_summary": "Models based on convolutional neural networks (CNN) and transformers have\nsteadily been improved. They also have been applied in various computer vision\ndownstream tasks. However, in object detection tasks, accurately localizing and\nclassifying almost infinite categories of foods in images remains challenging.\nTo address these problems, we first segmented the food as the\nregion-of-interest (ROI) by using the segment-anything model (SAM) and masked\nthe rest of the region except ROI as black pixels. This process simplified the\nproblems into a single classification for which annotation and training were\nmuch simpler than object detection. The images in which only the ROI was\npreserved were fed as inputs to fine-tune various off-the-shelf models that\nencoded their own inductive biases. Among them, Data-efficient image\nTransformers (DeiTs) had the best classification performance. Nonetheless, when\nfoods' shapes and textures were similar, the contextual features of the\nROI-only images were not enough for accurate classification. Therefore, we\nintroduced a novel type of combined architecture, RveRNet, which consisted of\nROI, extra-ROI, and integration modules that allowed it to account for both the\nROI's and global contexts. The RveRNet's F1 score was 10% better than other\nindividual models when classifying ambiguous food images. If the RveRNet's\nmodules were DeiT with the knowledge distillation from the CNN, performed the\nbest. We investigated how architectures can be made robust against input noise\ncaused by permutation and translocation. The results indicated that there was a\ntrade-off between how much the CNN teacher's knowledge could be distilled to\nDeiT and DeiT's innate strength. Code is publicly available at:\nhttps://github.com/Seonwhee-Genome/RveRNet.", "paper_summary_zh": "<paragraph>基於卷積神經網路 (CNN) 和 Transformer 的模型已持續獲得改善。它們也已應用於各種電腦視覺下游任務。然而，在物件偵測任務中，準確定位和分類影像中幾乎無限類別的食物仍然具有挑戰性。為了解決這些問題，我們首先使用分割任何東西模型 (SAM) 將食物分割為感興趣區域 (ROI)，並將 ROI 以外的區域遮罩為黑色像素。此程序將問題簡化為單一分類，其註解和訓練比物件偵測簡單許多。僅保留 ROI 的影像被提供為輸入，用於微調各種內建模型，這些模型編碼了其自身的歸納偏差。其中，資料有效率的影像 Transformer (DeiTs) 具有最佳的分類效能。儘管如此，當食物的形狀和質地相似時，僅 ROI 影像的脈絡特徵不足以進行準確分類。因此，我們引入了一種新穎的複合架構 RveRNet，它包含 ROI、ROI 外部和整合模組，使其能夠考量 ROI 和全域脈絡。RveRNet 的 F1 分數比其他個別模型高出 10%，用於分類模稜兩可的食物影像。如果 RveRNet 的模組是具備 CNN 知識萃取的 DeiT，則表現最佳。我們探討了如何讓架構對由排列和轉位造成的輸入雜訊具有穩健性。結果表明，CNN 教師的知識能萃取到 DeiT 的程度與 DeiT 的內在強度之間存在權衡。程式碼已公開於：https://github.com/Seonwhee-Genome/RveRNet。</paragraph>", "author": "Seonwhee Jin et.al.", "authors": "Seonwhee Jin", "id": "2407.08257v1", "paper_url": "http://arxiv.org/abs/2407.08257v1", "repo": "https://github.com/seonwhee-genome/rvernet"}}