{"2411.08195": {"publish_time": "2024-11-12", "title": "An Explainable Machine Learning Approach for Age and Gender Estimation in Living Individuals Using Dental Biometrics", "paper_summary": "Objectives: Age and gender estimation is crucial for various applications,\nincluding forensic investigations and anthropological studies. This research\naims to develop a predictive system for age and gender estimation in living\nindividuals, leveraging dental measurements such as Coronal Height (CH),\nCoronal Pulp Cavity Height (CPCH), and Tooth Coronal Index (TCI). Methods:\nMachine learning models were employed in our study, including Cat Boost\nClassifier (Catboost), Gradient Boosting Machine (GBM), Ada Boost Classifier\n(AdaBoost), Random Forest (RF), eXtreme Gradient Boosting (XGB), Light Gradient\nBoosting Machine (LGB), and Extra Trees Classifier (ETC), to analyze dental\ndata from 862 living individuals (459 males and 403 females). Specifically,\nperiapical radiographs from six teeth per individual were utilized, including\npremolars and molars from both maxillary and mandibular. A novel ensemble\nlearning technique was developed, which uses multiple models each tailored to\ndistinct dental metrics, to estimate age and gender accurately. Furthermore, an\nexplainable AI model has been created utilizing SHAP, enabling dental experts\nto make judicious decisions based on comprehensible insight. Results: The RF\nand XGB models were particularly effective, yielding the highest F1 score for\nage and gender estimation. Notably, the XGB model showed a slightly better\nperformance in age estimation, achieving an F1 score of 73.26%. A similar trend\nfor the RF model was also observed in gender estimation, achieving a F1 score\nof 77.53%. Conclusions: This study marks a significant advancement in dental\nforensic methods, showcasing the potential of machine learning to automate age\nand gender estimation processes with improved accuracy.", "paper_summary_zh": "目標：年齡和性別估計對於各種應用至關重要，包括法醫調查和人類學研究。本研究旨在開發一個預測系統，用於活體年齡和性別估計，利用牙科測量值，例如冠高 (CH)、冠髓腔高度 (CPCH) 和牙冠指數 (TCI)。方法：我們的研究採用了機器學習模型，包括 Cat Boost 分類器 (Catboost)、梯度提升機 (GBM)、Ada Boost 分類器 (AdaBoost)、隨機森林 (RF)、eXtreme 梯度提升 (XGB)、Light 梯度提升機 (LGB) 和 Extra Trees 分類器 (ETC)，分析來自 862 名活體個體（459 名男性和 403 名女性）的牙科數據。具體而言，利用了每個個體六顆牙齒的近心根尖 X 光片，包括上頜和下頜的雙尖牙和磨牙。開發了一種新穎的集成學習技術，它使用多個模型，每個模型都針對不同的牙科指標進行調整，以準確估計年齡和性別。此外，已經利用 SHAP 創建了一個可解釋的 AI 模型，使牙科專家能夠根據易於理解的見解做出明智的決策。結果：RF 和 XGB 模型特別有效，產生了年齡和性別估計的最高 F1 分數。值得注意的是，XGB 模型在年齡估計中表現略好，F1 分數達到 73.26%。在性別估計中也觀察到了 RF 模型的類似趨勢，F1 分數達到 77.53%。結論：這項研究標誌著牙科法醫方法的重大進步，展示了機器學習在自動化年齡和性別估計過程中提高準確性的潛力。", "author": "Mohsin Ali et.al.", "authors": "Mohsin Ali, Haider Raza, John Q Gan, Ariel Pokhojaev, Matanel Katz, Esra Kosan, Dian Agustin Wahjuningrum, Omnina Saleh, Rachel Sarig, Akhilanada Chaurasia", "id": "2411.08195v1", "paper_url": "http://arxiv.org/abs/2411.08195v1", "repo": "null"}}