{"2409.11218": {"publish_time": "2024-09-17", "title": "Exploring ChatGPT-based Augmentation Strategies for Contrastive Aspect-based Sentiment Analysis", "paper_summary": "Aspect-based sentiment analysis (ABSA) involves identifying sentiment towards\nspecific aspect terms in a sentence and allows us to uncover nuanced\nperspectives and attitudes on particular aspects of a product, service, or\ntopic. However, the scarcity of labeled data poses a significant challenge to\ntraining high-quality models. To address this issue, we explore the potential\nof data augmentation using ChatGPT, a well-performing large language model\n(LLM), to enhance the sentiment classification performance towards aspect\nterms. Specifically, we explore three data augmentation strategies based on\nChatGPT: context-focused, aspect-focused, and context-aspect data augmentation\ntechniques. Context-focused data augmentation focuses on changing the word\nexpression of context words in the sentence while keeping aspect terms\nunchanged. In contrast, aspect-focused data augmentation aims to change aspect\nterms but keep context words unchanged. Context-Aspect data augmentation\nintegrates the above two data augmentations to generate augmented samples.\nFurthermore, we incorporate contrastive learning into the ABSA tasks to improve\nperformance. Extensive experiments show that all three data augmentation\ntechniques lead to performance improvements, with the context-aspect data\naugmentation strategy performing best and surpassing the performance of the\nbaseline models.", "paper_summary_zh": "基於面向面向觀點的情感分析（ABSA）涉及識別句子中特定面向詞彙的情感，並讓我們能夠揭示對產品、服務或主題特定面向的細緻觀點和態度。然而，標記資料的稀少對訓練高品質模型構成重大挑戰。為了解決此問題，我們探討使用 ChatGPT（一種表現良好的大型語言模型，LLM）進行資料擴充的潛力，以增強面向詞彙的情感分類效能。具體來說，我們探討了三種基於 ChatGPT 的資料擴充策略：以脈絡為重點、以面向為重點和脈絡-面向資料擴充技術。以脈絡為重點的資料擴充專注於改變句子中脈絡詞彙的詞彙表達，同時保持面向詞彙不變。相反地，以面向為重點的資料擴充旨在改變面向詞彙，但保持脈絡詞彙不變。脈絡-面向資料擴充整合上述兩種資料擴充，以產生擴充範例。此外，我們將對比學習納入 ABSA 任務，以提升效能。廣泛的實驗顯示，所有三種資料擴充技術都能提升效能，其中以脈絡-面向資料擴充策略表現最佳，並超越基準模型的效能。", "author": "Lingling Xu et.al.", "authors": "Lingling Xu, Haoran Xie, S. Joe Qin, Fu Lee Wang, Xiaohui Tao", "id": "2409.11218v1", "paper_url": "http://arxiv.org/abs/2409.11218v1", "repo": "null"}}