{"2406.04927": {"publish_time": "2024-06-07", "title": "LLM-based speaker diarization correction: A generalizable approach", "paper_summary": "Speaker diarization is necessary for interpreting conversations transcribed\nusing automated speech recognition (ASR) tools. Despite significant\ndevelopments in diarization methods, diarization accuracy remains an issue.\nHere, we investigate the use of large language models (LLMs) for diarization\ncorrection as a post-processing step. LLMs were fine-tuned using the Fisher\ncorpus, a large dataset of transcribed conversations. The ability of the models\nto improve diarization accuracy in a holdout dataset was measured. We report\nthat fine-tuned LLMs can markedly improve diarization accuracy. However, model\nperformance is constrained to transcripts produced using the same ASR tool as\nthe transcripts used for fine-tuning, limiting generalizability. To address\nthis constraint, an ensemble model was developed by combining weights from\nthree separate models, each fine-tuned using transcripts from a different ASR\ntool. The ensemble model demonstrated better overall performance than each of\nthe ASR-specific models, suggesting that a generalizable and ASR-agnostic\napproach may be achievable. We hope to make these models accessible through\npublic-facing APIs for use by third-party applications.", "paper_summary_zh": "說話人日記化對於使用自動語音辨識 (ASR) 工具轉錄對話來說是必要的。儘管在日記化方法上有顯著的發展，但日記化準確度仍然是一個問題。在此，我們研究使用大型語言模型 (LLM) 進行日記化校正作為後處理步驟。LLM 使用 Fisher 語料庫進行微調，Fisher 語料庫是一個大型的轉錄對話資料集。測量了模型在暫留資料集中改善日記化準確度的能力。我們報告說，微調後的 LLM 可以顯著提高日記化準確度。然而，模型效能受到使用與微調轉錄相同的 ASR 工具產生的轉錄的限制，這會限制通用性。為了解決這個限制，透過結合來自三個不同模型的權重來開發一個整體模型，每個模型都使用來自不同 ASR 工具的轉錄進行微調。整體模型展示出比每個特定於 ASR 的模型更好的整體效能，這表明可以實現可概括且與 ASR 無關的方法。我們希望透過公開的 API 讓第三方應用程式可以使用這些模型。", "author": "Georgios Efstathiadis et.al.", "authors": "Georgios Efstathiadis, Vijay Yadav, Anzar Abbas", "id": "2406.04927v1", "paper_url": "http://arxiv.org/abs/2406.04927v1", "repo": "null"}}