{"2409.08400": {"publish_time": "2024-09-12", "title": "Scores as Actions: a framework of fine-tuning diffusion models by continuous-time reinforcement learning", "paper_summary": "Reinforcement Learning from human feedback (RLHF) has been shown a promising\ndirection for aligning generative models with human intent and has also been\nexplored in recent works for alignment of diffusion generative models. In this\nwork, we provide a rigorous treatment by formulating the task of fine-tuning\ndiffusion models, with reward functions learned from human feedback, as an\nexploratory continuous-time stochastic control problem. Our key idea lies in\ntreating the score-matching functions as controls/actions, and upon this, we\ndevelop a unified framework from a continuous-time perspective, to employ\nreinforcement learning (RL) algorithms in terms of improving the generation\nquality of diffusion models. We also develop the corresponding continuous-time\nRL theory for policy optimization and regularization under assumptions of\nstochastic different equations driven environment. Experiments on the\ntext-to-image (T2I) generation will be reported in the accompanied paper.", "paper_summary_zh": "強化學習來自人類回饋（RLHF）已被證明是一個有希望的方向，可以將生成模型與人類意圖保持一致，並且最近的工作也已探索用於擴散生成模型的一致性。在這項工作中，我們通過將微調擴散模型的任務表述為一個探索性連續時間隨機控制問題，並從人類回饋中學習獎勵函數，提供了一個嚴謹的處理方法。我們的關鍵思想在於將分數匹配函數視為控制/動作，並在此基礎上，我們從連續時間的角度開發了一個統一的框架，以採用強化學習（RL）演算法來改善擴散模型的生成品質。我們還開發了相應的連續時間 RL 理論，用於在隨機不同方程式驅動環境的假設下進行策略優化和正則化。文本到影像（T2I）生成的實驗將在附帶論文中報告。", "author": "Hanyang Zhao et.al.", "authors": "Hanyang Zhao, Haoxian Chen, Ji Zhang, David D. Yao, Wenpin Tang", "id": "2409.08400v1", "paper_url": "http://arxiv.org/abs/2409.08400v1", "repo": "null"}}