{"2410.12298": {"publish_time": "2024-10-16", "title": "Pyramid-Driven Alignment: Pyramid Principle Guided Integration of Large Language Models and Knowledge Graphs", "paper_summary": "Large Language Models (LLMs) possess impressive reasoning abilities but are\nprone to generating incorrect information, often referred to as hallucinations.\nWhile incorporating external Knowledge Graphs (KGs) can partially mitigate this\nissue, existing methods primarily treat KGs as static knowledge repositories,\noverlooking the critical disparity between KG and LLM knowledge, and failing to\nfully exploit the reasoning capabilities inherent in KGs. To address these\nlimitations, we propose Pyramid-Driven Alignment (PDA), a novel framework for\nseamlessly integrating LLMs with KGs. PDA utilizes Pyramid Principle analysis\nto construct a hierarchical pyramid structure. This structure is designed to\nreflect the input question and generate more validated deductive knowledge,\nthereby enhancing the alignment of LLMs and KGs and ensuring more cohesive\nintegration. Furthermore, PDA employs a recursive mechanism to harness the\nunderlying reasoning abilities of KGs, resulting in more accurate knowledge\nretrieval for question-answering tasks. Our experimental results reveal a\nsubstantial performance advantage of PDA over state-of-the-art baselines, with\nimprovements reaching 26.70% and 26.78%.", "paper_summary_zh": "大型語言模型 (LLM) 擁有令人印象深刻的推理能力，但容易產生不正確的資訊，通常稱為幻覺。雖然加入外部知識圖譜 (KG) 可以部分緩解此問題，但現有方法主要將 KG 視為靜態知識儲存庫，忽略了 KG 和 LLM 知識之間的關鍵差異，並且未能充分利用 KG 中固有的推理能力。為了解決這些限制，我們提出了金字塔驅動對齊 (PDA)，這是一種將 LLM 與 KG 無縫整合的新穎架構。PDA 利用金字塔原理分析來構建階層式金字塔結構。此結構旨在反映輸入問題並產生更多驗證的演繹知識，從而增強 LLM 和 KG 的對齊並確保更緊密的整合。此外，PDA 採用遞迴機制來利用 KG 的基本推理能力，從而更準確地擷取問題解答任務的知識。我們的實驗結果顯示，PDA 相較於最先進的基準具有顯著的效能優勢，改進幅度達到 26.70% 和 26.78%。", "author": "Lei Sun et.al.", "authors": "Lei Sun, Xinchen Wang, Youdi Li", "id": "2410.12298v1", "paper_url": "http://arxiv.org/abs/2410.12298v1", "repo": "null"}}