{"2410.24199": {"publish_time": "2024-10-31", "title": "Multi-Attribute Linguistic Tuning for Controlled Paraphrase Generation", "paper_summary": "We present a novel approach to paraphrase generation that enables precise\ncontrol and fine-tuning of 40 linguistic attributes for English. Our model is\nan encoder-decoder architecture that takes as input a source sentence and\ndesired linguistic attributes, and produces paraphrases of the source that\nsatisfy the desired attributes. To guarantee high-quality outputs at inference\ntime, our method is equipped with a quality control mechanism that gradually\nadjusts the embedding of linguistic attributes to find the nearest and most\nattainable configuration of desired attributes for paraphrase generation. We\nevaluate the effectiveness of our method by comparing it to recent controllable\ngeneration models. Experimental results demonstrate that the proposed model\noutperforms baselines in generating paraphrases that satisfy desired linguistic\nattributes.", "paper_summary_zh": "我們提出了一種新的同義詞生成方法，它可以精確控制和微調英文的 40 種語言屬性。我們的模型是一種編碼器-解碼器架構，它以原始句子和所需的語言屬性作為輸入，並產生符合所需屬性的原始同義詞。為了保證在推理時輸出高品質，我們的模型配備了一個品質控制機制，它會逐步調整語言屬性的嵌入，以尋找最接近且最可實現的同義詞生成所需屬性配置。我們透過將我們的模型與最近的可控生成模型進行比較來評估其有效性。實驗結果表明，所提出的模型在生成滿足所需語言屬性的同義詞方面優於基線。", "author": "Mohamed Elgaar et.al.", "authors": "Mohamed Elgaar, Hadi Amiri", "id": "2410.24199v1", "paper_url": "http://arxiv.org/abs/2410.24199v1", "repo": "null"}}