{"2501.00755": {"publish_time": "2025-01-01", "title": "An AI-powered Bayesian generative modeling approach for causal inference in observational studies", "paper_summary": "Causal inference in observational studies with high-dimensional covariates\npresents significant challenges. We introduce CausalBGM, an AI-powered Bayesian\ngenerative modeling approach that captures the causal relationship among\ncovariates, treatment, and outcome variables. The core innovation of CausalBGM\nlies in its ability to estimate the individual treatment effect (ITE) by\nlearning individual-specific distributions of a low-dimensional latent feature\nset (e.g., latent confounders) that drives changes in both treatment and\noutcome. This approach not only effectively mitigates confounding effects but\nalso provides comprehensive uncertainty quantification, offering reliable and\ninterpretable causal effect estimates at the individual level. CausalBGM adopts\na Bayesian model and uses a novel iterative algorithm to update the model\nparameters and the posterior distribution of latent features until convergence.\nThis framework leverages the power of AI to capture complex dependencies among\nvariables while adhering to the Bayesian principles. Extensive experiments\ndemonstrate that CausalBGM consistently outperforms state-of-the-art methods,\nparticularly in scenarios with high-dimensional covariates and large-scale\ndatasets. Its Bayesian foundation ensures statistical rigor, providing robust\nand well-calibrated posterior intervals. By addressing key limitations of\nexisting methods, CausalBGM emerges as a robust and promising framework for\nadvancing causal inference in modern applications in fields such as genomics,\nhealthcare, and social sciences. CausalBGM is maintained at the website\nhttps://causalbgm.readthedocs.io/.", "paper_summary_zh": "在具有高維度協變量的觀察性研究中，因果推論提出了重大挑戰。我們引入了 CausalBGM，一種由人工智慧推動的貝氏生成模型方法，它捕捉了協變量、治療和結果變量之間的因果關係。CausalBGM 的核心創新在於它能夠通過學習低維潛在特徵集（例如，潛在混雜因素）的特定於個體的分布來估計個體治療效果 (ITE)，該分布推動了治療和結果的變化。這種方法不僅有效地減輕了混雜效應，還提供了全面的不確定性量化，在個體層面上提供了可靠且可解釋的因果效應估計。CausalBGM 採用貝氏模型，並使用一種新穎的迭代演算法來更新模型參數和潛在特徵的後驗分布，直到收斂。此框架利用人工智慧的力量來捕捉變量之間的複雜依賴關係，同時遵守貝氏原理。廣泛的實驗表明，CausalBGM 持續優於最先進的方法，特別是在具有高維度協變量和大規模資料集的情況下。其貝氏基礎確保了統計嚴謹性，提供了穩健且校準良好的後驗區間。通過解決現有方法的主要限制，CausalBGM 成為一個穩健且有前途的框架，用於推進現代應用（例如基因組學、醫療保健和社會科學）中的因果推論。CausalBGM 在網站 https://causalbgm.readthedocs.io/ 上進行維護。", "author": "Qiao Liu et.al.", "authors": "Qiao Liu, Wing Hung Wong", "id": "2501.00755v1", "paper_url": "http://arxiv.org/abs/2501.00755v1", "repo": "null"}}