{"2405.15143": {"publish_time": "2024-05-24", "title": "Intelligent Go-Explore: Standing on the Shoulders of Giant Foundation Models", "paper_summary": "Go-Explore is a powerful family of algorithms designed to solve\nhard-exploration problems, built on the principle of archiving discovered\nstates, and iteratively returning to and exploring from the most promising\nstates. This approach has led to superhuman performance across a wide variety\nof challenging problems including Atari games and robotic control, but requires\nmanually designing heuristics to guide exploration, which is time-consuming and\ninfeasible in general. To resolve this, we propose Intelligent Go-Explore (IGE)\nwhich greatly extends the scope of the original Go-Explore by replacing these\nheuristics with the intelligence and internalized human notions of\ninterestingness captured by giant foundation models (FMs). This provides IGE\nwith a human-like ability to instinctively identify how interesting or\npromising any new state is (e.g. discovering new objects, locations, or\nbehaviors), even in complex environments where heuristics are hard to define.\nMoreover, IGE offers the exciting and previously impossible opportunity to\nrecognize and capitalize on serendipitous discoveries that cannot be predicted\nahead of time. We evaluate IGE on a range of language-based tasks that require\nsearch and exploration. In Game of 24, a multistep mathematical reasoning\nproblem, IGE reaches 100% success rate 70.8% faster than the best classic graph\nsearch baseline. Next, in BabyAI-Text, a challenging partially observable\ngridworld, IGE exceeds the previous SOTA with orders of magnitude fewer online\nsamples. Finally, in TextWorld, we show the unique ability of IGE to succeed in\nsettings requiring long-horizon exploration where prior SOTA FM agents like\nReflexion completely fail. Overall, IGE combines the tremendous strengths of\nFMs and the powerful Go-Explore algorithm, opening up a new frontier of\nresearch into creating more generally capable agents with impressive\nexploration capabilities.", "paper_summary_zh": "Go-Explore 是一系列強大的演算法，旨在解決困難的探索問題，其建立在封存已發現狀態的原則上，並反覆返回並從最有希望的狀態進行探索。這種方法已在各種具有挑戰性的問題中帶來了超人的表現，包括 Atari 遊戲和機器人控制，但需要人工設計啟發法來指導探索，這既耗時又通常不可行。為了解決這個問題，我們提出了 Intelligent Go-Explore (IGE)，它透過用巨型基礎模型 (FM) 捕捉到的智慧和內化的人類有趣性概念取代這些啟發法，進而大幅擴展了原始 Go-Explore 的範圍。這賦予 IGE 類似人類的能力，可以本能地識別任何新狀態有多有趣或有希望（例如發現新物件、位置或行為），即使在難以定義啟發法的複雜環境中也是如此。此外，IGE 提供了一個令人興奮且前所未有的機會，可以認識並利用無法預先預測的意外發現。我們在需要搜尋和探索的一系列基於語言的任務上評估 IGE。在 24 點遊戲中，IGE 是一個多步驟的數學推理問題，其達到 100% 的成功率，比最佳經典圖形搜尋基線快 70.8%。接下來，在 BabyAI-Text 中，一個具有挑戰性的部分可觀察網格世界，IGE 超越了先前的 SOTA，線上範例數量減少了幾個數量級。最後，在 TextWorld 中，我們展示了 IGE 在需要長期探索的設定中取得成功的獨特能力，在該設定中，先前的 SOTA FM 代理（例如 Reflexion）完全失敗。總的來說，IGE 結合了 FM 和強大的 Go-Explore 演算法的巨大優勢，開啟了探索創造更具一般能力且具有令人印象深刻的探索能力的代理的新研究領域。", "author": "Cong Lu et.al.", "authors": "Cong Lu, Shengran Hu, Jeff Clune", "id": "2405.15143v1", "paper_url": "http://arxiv.org/abs/2405.15143v1", "repo": "https://github.com/conglu1997/intelligent-go-explore"}}