{"2410.17510": {"publish_time": "2024-10-23", "title": "Congestion Forecast for Trains with Railroad-Graph-based Semi-Supervised Learning using Sparse Passenger Reports", "paper_summary": "Forecasting rail congestion is crucial for efficient mobility in transport\nsystems. We present rail congestion forecasting using reports from passengers\ncollected through a transit application. Although reports from passengers have\nreceived attention from researchers, ensuring a sufficient volume of reports is\nchallenging due to passenger's reluctance. The limited number of reports\nresults in the sparsity of the congestion label, which can be an issue in\nbuilding a stable prediction model. To address this issue, we propose a\nsemi-supervised method for congestion forecasting for trains, or SURCONFORT.\nOur key idea is twofold: firstly, we adopt semi-supervised learning to leverage\nsparsely labeled data and many unlabeled data. Secondly, in order to complement\nthe unlabeled data from nearby stations, we design a railway network-oriented\ngraph and apply the graph to semi-supervised graph regularization. Empirical\nexperiments with actual reporting data show that SURCONFORT improved the\nforecasting performance by 14.9% over state-of-the-art methods under the label\nsparsity.", "paper_summary_zh": "預測鐵路壅塞對於運輸系統中的有效移動至關重要。我們提出使用透過運輸應用程式收集的乘客報告來預測鐵路壅塞。儘管乘客報告已受到研究人員的關注，但由於乘客的不願意，確保有足夠數量的報告具有挑戰性。報告數量有限導致壅塞標籤稀疏，這可能是建立穩定預測模型的問題。為了解決此問題，我們提出了一種半監督式方法來預測火車壅塞，稱為 SURCONFORT。我們的關鍵思想有兩個方面：首先，我們採用半監督式學習來利用稀疏標籤資料和許多未標籤資料。其次，為了補充來自附近車站的未標籤資料，我們設計了一個以鐵路網路為導向的圖形，並將圖形應用於半監督式圖形正則化。使用實際報告資料進行的實證實驗表明，在標籤稀疏的情況下，SURCONFORT 將預測效能提升了 14.9%，優於最先進的方法。", "author": "Soto Anno et.al.", "authors": "Soto Anno, Kota Tsubouchi, Masamichi Shimosaka", "id": "2410.17510v1", "paper_url": "http://arxiv.org/abs/2410.17510v1", "repo": "null"}}