{"2405.14366": {"publish_time": "2024-05-23", "title": "MiniCache: KV Cache Compression in Depth Dimension for Large Language Models", "paper_summary": "A critical approach for efficiently deploying computationally demanding large\nlanguage models (LLMs) is Key-Value (KV) caching. The KV cache stores key-value\nstates of previously generated tokens, significantly reducing the need for\nrepetitive computations and thereby lowering latency in autoregressive\ngeneration. However, the size of the KV cache grows linearly with sequence\nlength, posing challenges for applications requiring long context input and\nextensive sequence generation. In this paper, we present a simple yet effective\napproach, called MiniCache, to compress the KV cache across layers from a novel\ndepth perspective, significantly reducing the memory footprint for LLM\ninference. Our approach is based on the observation that KV cache states\nexhibit high similarity between the adjacent layers in the middle-to-deep\nportion of LLMs. To facilitate merging, we propose disentangling the states\ninto the magnitude and direction components, interpolating the directions of\nthe state vectors while preserving their lengths unchanged. Furthermore, we\nintroduce a token retention strategy to keep highly distinct state pairs\nunmerged, thus preserving the information with minimal additional storage\noverhead. Our MiniCache is training-free and general, complementing existing KV\ncache compression strategies, such as quantization and sparsity. We conduct a\ncomprehensive evaluation of MiniCache utilizing various models including\nLLaMA-2, LLaMA-3, Phi-3, Mistral, and Mixtral across multiple benchmarks,\ndemonstrating its exceptional performance in achieving superior compression\nratios and high throughput. On the ShareGPT dataset, LLaMA-2-7B with 4-bit\nMiniCache achieves a remarkable compression ratio of up to 5.02x, enhances\ninference throughput by approximately 5x, and reduces the memory footprint by\n41% compared to the FP16 full cache baseline, all while maintaining\nnear-lossless performance.", "paper_summary_zh": "一種有效率地部署計算需求量大的大型語言模型 (LLM) 的關鍵方法是 Key-Value (KV) 快取。KV 快取儲存先前產生的權杖的 key-value 狀態，大幅減少重複運算的需求，進而降低自迴歸生成中的延遲。然而，KV 快取的大小會隨著序列長度線性增加，對需要長脈絡輸入和廣泛序列生成的應用程式構成挑戰。在本文中，我們提出了一個簡單但有效的方法，稱為 MiniCache，從新穎的深度觀點壓縮各層的 KV 快取，大幅減少 LLM 推論的記憶體使用量。我們的做法基於以下觀察：KV 快取狀態在 LLM 的中到深層部分的相鄰層之間具有高度相似性。為了促進合併，我們提出將狀態解開成大小和方向組成，在保留狀態向量長度不變的情況下內插狀態向量的方向。此外，我們引入一種權杖保留策略，以保持高度不同的狀態對不合併，從而以最小的額外儲存空間開銷保留資訊。我們的 MiniCache 不需要訓練且通用，可補充現有的 KV 快取壓縮策略，例如量化和稀疏性。我們對 MiniCache 進行了全面評估，利用各種模型，包括 LLaMA-2、LLaMA-3、Phi-3、Mistral 和 Mixtral，跨多個基準測試，證明了它在達成卓越壓縮率和高處理量方面的出色效能。在 ShareGPT 資料集上，具有 4 位元 MiniCache 的 LLaMA-2-7B 達到了高達 5.02 倍的顯著壓縮率，將推論處理量提升了大約 5 倍，並將記憶體使用量減少了 41%，與 FP16 完整快取基準相比，同時維持近乎無損失的效能。", "author": "Akide Liu et.al.", "authors": "Akide Liu, Jing Liu, Zizheng Pan, Yefei He, Gholamreza Haffari, Bohan Zhuang", "id": "2405.14366v1", "paper_url": "http://arxiv.org/abs/2405.14366v1", "repo": "null"}}