{"2502.03373": {"publish_time": "2025-02-05", "title": "Demystifying Long Chain-of-Thought Reasoning in LLMs", "paper_summary": "Scaling inference compute enhances reasoning in large language models (LLMs),\nwith long chains-of-thought (CoTs) enabling strategies like backtracking and\nerror correction. Reinforcement learning (RL) has emerged as a crucial method\nfor developing these capabilities, yet the conditions under which long CoTs\nemerge remain unclear, and RL training requires careful design choices. In this\nstudy, we systematically investigate the mechanics of long CoT reasoning,\nidentifying the key factors that enable models to generate long CoT\ntrajectories. Through extensive supervised fine-tuning (SFT) and RL\nexperiments, we present four main findings: (1) While SFT is not strictly\nnecessary, it simplifies training and improves efficiency; (2) Reasoning\ncapabilities tend to emerge with increased training compute, but their\ndevelopment is not guaranteed, making reward shaping crucial for stabilizing\nCoT length growth; (3) Scaling verifiable reward signals is critical for RL. We\nfind that leveraging noisy, web-extracted solutions with filtering mechanisms\nshows strong potential, particularly for out-of-distribution (OOD) tasks such\nas STEM reasoning; and (4) Core abilities like error correction are inherently\npresent in base models, but incentivizing these skills effectively for complex\ntasks via RL demands significant compute, and measuring their emergence\nrequires a nuanced approach. These insights provide practical guidance for\noptimizing training strategies to enhance long CoT reasoning in LLMs. Our code\nis available at: https://github.com/eddycmu/demystify-long-cot.", "paper_summary_zh": "<paragraph>擴展推理運算能增強大型語言模型 (LLM) 中的推理，\n具備長思維鏈 (CoT) 能啟用回溯和\n錯誤修正等策略。強化學習 (RL) 已成為開發這些能力的一種重要方法，\n但長 CoT 浮現的條件仍不清晰，而 RL 訓練需要謹慎的設計選擇。在這個\n研究中，我們系統性地探討長 CoT 推理的機制，\n找出讓模型產生長 CoT 軌跡的主要因素。透過廣泛的監督微調 (SFT) 和 RL\n實驗，我們提出四項主要發現：(1) 雖然 SFT 並非絕對必要，但它簡化了訓練並提升效率；(2) 推理\n能力傾向於隨著訓練運算增加而浮現，但其發展並非有保證，因此獎勵塑造對於穩定\nCoT 長度增長至關重要；(3) 擴展可驗證的獎勵訊號對於 RL 至關重要。我們\n發現利用帶有過濾機制的 noisy 網路提取解決方案顯示出強大的潛力，特別是對於 STEM 推理等\n非分佈 (OOD) 任務；(4) 錯誤修正等核心能力本質上存在於基礎模型中，但透過 RL 有效地激勵這些技能以執行複雜\n任務需要大量的運算，而衡量它們的浮現需要一種細緻的方法。這些見解為最佳化訓練策略以增強 LLM 中的長 CoT 推理提供了實用的指導。我們的程式碼可在以下網址取得：https://github.com/eddycmu/demystify-long-cot。</paragraph>", "author": "Edward Yeo et.al.", "authors": "Edward Yeo, Yuxuan Tong, Morry Niu, Graham Neubig, Xiang Yue", "id": "2502.03373v1", "paper_url": "http://arxiv.org/abs/2502.03373v1", "repo": "null"}}