{"2411.17437": {"publish_time": "2024-11-26", "title": "\"Stupid robot, I want to speak to a human!\" User Frustration Detection in Task-Oriented Dialog Systems", "paper_summary": "Detecting user frustration in modern-day task-oriented dialog (TOD) systems\nis imperative for maintaining overall user satisfaction, engagement, and\nretention. However, most recent research is focused on sentiment and emotion\ndetection in academic settings, thus failing to fully encapsulate implications\nof real-world user data. To mitigate this gap, in this work, we focus on user\nfrustration in a deployed TOD system, assessing the feasibility of\nout-of-the-box solutions for user frustration detection. Specifically, we\ncompare the performance of our deployed keyword-based approach, open-source\napproaches to sentiment analysis, dialog breakdown detection methods, and\nemerging in-context learning LLM-based detection. Our analysis highlights the\nlimitations of open-source methods for real-world frustration detection, while\ndemonstrating the superior performance of the LLM-based approach, achieving a\n16\\% relative improvement in F1 score on an internal benchmark. Finally, we\nanalyze advantages and limitations of our methods and provide an insight into\nuser frustration detection task for industry practitioners.", "paper_summary_zh": "在現代以任務為導向的對話（TOD）系統中檢測使用者的沮喪情緒，對於維持整體使用者滿意度、參與度和保留率至關重要。然而，最近的研究大多集中在學術環境中的情緒檢測，因此未能完全涵蓋真實世界使用者資料的影響。為了彌補此差距，我們在這項工作中專注於已部署 TOD 系統中的使用者沮喪情緒，評估現成解決方案對使用者沮喪情緒檢測的可行性。具體來說，我們比較了我們已部署的基於關鍵字的方法、開放原始碼情緒分析方法、對話故障檢測方法和新興的語境學習 LLM 為基礎的檢測的效能。我們的分析突顯了開放原始碼方法在現實世界沮喪情緒檢測方面的限制，同時證明了基於 LLM 的方法的優異效能，在內部基準上 F1 分數提高了 16%。最後，我們分析了我們方法的優點和限制，並為業界從業人員提供了對使用者沮喪情緒檢測任務的見解。", "author": "Mireia Hernandez Caralt et.al.", "authors": "Mireia Hernandez Caralt, Ivan Sekulić, Filip Carević, Nghia Khau, Diana Nicoleta Popa, Bruna Guedes, Victor Guimarães, Zeyu Yang, Andre Manso, Meghana Reddy, Paolo Rosso, Roland Mathis", "id": "2411.17437v1", "paper_url": "http://arxiv.org/abs/2411.17437v1", "repo": "null"}}