{"2409.00695": {"publish_time": "2024-09-01", "title": "Curriculum Prompting Foundation Models for Medical Image Segmentation", "paper_summary": "Adapting large pre-trained foundation models, e.g., SAM, for medical image\nsegmentation remains a significant challenge. A crucial step involves the\nformulation of a series of specialized prompts that incorporate specific\nclinical instructions. Past works have been heavily reliant on a singular type\nof prompt for each instance, necessitating manual input of an ideally correct\nprompt, which is less efficient. To tackle this issue, we propose to utilize\nprompts of different granularity, which are sourced from original images to\nprovide a broader scope of clinical insights. However, combining prompts of\nvarying types can pose a challenge due to potential conflicts. In response, we\nhave designed a coarse-to-fine mechanism, referred to as curriculum prompting,\nthat progressively integrates prompts of different types. Through extensive\nexperiments on three public medical datasets across various modalities, we\ndemonstrate the effectiveness of our proposed approach, which not only\nautomates the prompt generation process but also yields superior performance\ncompared to other SAM-based medical image segmentation methods. Code is\navailable at: https://github.com/AnnaZzz-zxq/Curriculum-Prompting.", "paper_summary_zh": "調整大型預訓練基礎模型（例如 SAM）以進行醫學影像分割仍是一項重大挑戰。關鍵步驟涉及制定一系列包含特定臨床說明的專門提示。過去的工作在很大程度上依賴於每個例項的單一提示類型，這需要手動輸入理想的正確提示，效率較低。為了解決這個問題，我們建議利用不同粒度的提示，這些提示來自原始影像，以提供更廣泛的臨床見解。然而，由於潛在衝突，結合不同類型的提示可能會構成挑戰。為了解決這個問題，我們設計了一種由粗到細的機制，稱為課程提示，它逐步整合不同類型的提示。透過對各種模式下的三個公共醫學資料集進行廣泛的實驗，我們證明了我們提出的方法的有效性，它不僅自動化提示生成過程，而且與其他基於 SAM 的醫學影像分割方法相比，還產生了更好的效能。程式碼可在以下位置取得：https://github.com/AnnaZzz-zxq/Curriculum-Prompting。", "author": "Xiuqi Zheng et.al.", "authors": "Xiuqi Zheng, Yuhang Zhang, Haoran Zhang, Hongrui Liang, Xueqi Bao, Zhuqing Jiang, Qicheng Lao", "id": "2409.00695v1", "paper_url": "http://arxiv.org/abs/2409.00695v1", "repo": "https://github.com/annazzz-zxq/curriculum-prompting"}}