{"2409.10874": {"publish_time": "2024-09-17", "title": "American Sign Language to Text Translation using Transformer and Seq2Seq with LSTM", "paper_summary": "Sign language translation is one of the important issues in communication\nbetween deaf and hearing people, as it expresses words through hand, body, and\nmouth movements. American Sign Language is one of the sign languages used, one\nof which is the alphabetic sign. The development of neural machine translation\ntechnology is moving towards sign language translation. Transformer became the\nstate-of-the-art in natural language processing. This study compares the\nTransformer with the Sequence-to-Sequence (Seq2Seq) model in translating sign\nlanguage to text. In addition, an experiment was conducted by adding Residual\nLong Short-Term Memory (ResidualLSTM) in the Transformer. The addition of\nResidualLSTM to the Transformer reduces the performance of the Transformer\nmodel by 23.37% based on the BLEU Score value. In comparison, the Transformer\nitself increases the BLEU Score value by 28.14 compared to the Seq2Seq model.", "paper_summary_zh": "手語翻譯是聾人和聽人溝通中的重要議題之一，因為它透過手、身體和嘴巴的動作來表達單字。美國手語是其中一種手語，其中一種是字母手語。神經機器翻譯技術的發展正朝向手語翻譯邁進。Transformer 成為了自然語言處理的最新技術。本研究比較了 Transformer 與序列到序列 (Seq2Seq) 模型在將手語翻譯成文字的表現。此外，還透過在 Transformer 中加入殘差長短期記憶 (ResidualLSTM) 進行實驗。在 Transformer 中加入 ResidualLSTM 會讓 Transformer 模型的表現降低 23.37%，根據 BLEU 評分值。相較之下，與 Seq2Seq 模型相比，Transformer 本身讓 BLEU 評分值增加了 28.14。", "author": "Gregorius Guntur Sunardi Putra et.al.", "authors": "Gregorius Guntur Sunardi Putra, Adifa Widyadhani Chanda D'Layla, Dimas Wahono, Riyanarto Sarno, Agus Tri Haryono", "id": "2409.10874v1", "paper_url": "http://arxiv.org/abs/2409.10874v1", "repo": "null"}}