{"2407.16890": {"publish_time": "2024-07-24", "title": "Why Machines Can't Be Moral: Turing's Halting Problem and the Moral Limits of Artificial Intelligence", "paper_summary": "In this essay, I argue that explicit ethical machines, whose moral principles\nare inferred through a bottom-up approach, are unable to replicate human-like\nmoral reasoning and cannot be considered moral agents. By utilizing Alan\nTuring's theory of computation, I demonstrate that moral reasoning is\ncomputationally intractable by these machines due to the halting problem. I\naddress the frontiers of machine ethics by formalizing moral problems into\n'algorithmic moral questions' and by exploring moral psychology's dual-process\nmodel. While the nature of Turing Machines theoretically allows artificial\nagents to engage in recursive moral reasoning, critical limitations are\nintroduced by the halting problem, which states that it is impossible to\npredict with certainty whether a computational process will halt. A thought\nexperiment involving a military drone illustrates this issue, showing that an\nartificial agent might fail to decide between actions due to the halting\nproblem, which limits the agent's ability to make decisions in all instances,\nundermining its moral agency.", "paper_summary_zh": "在本文中，我主張通過自下而上方法推論出道德原則的明確道德機器，無法複製類人的道德推理，也不能被視為道德代理人。通過利用艾倫·圖靈的計算理論，我證明了由於停機問題，這些機器在計算上無法進行道德推理。我通過將道德問題形式化為「演算法道德問題」以及探索道德心理學的雙重過程模型，來探討機器倫理的邊界。雖然圖靈機的本質在理論上允許人工代理參與遞迴道德推理，但停機問題引入了關鍵限制，該問題指出不可能確定預測計算過程是否會停止。一個涉及軍事無人機的思想實驗說明了這個問題，表明人工代理可能會因為停機問題而無法在行動之間做出決定，這限制了代理人在所有情況下做出決定的能力，從而破壞了其道德代理。", "author": "Massimo Passamonti et.al.", "authors": "Massimo Passamonti", "id": "2407.16890v1", "paper_url": "http://arxiv.org/abs/2407.16890v1", "repo": "null"}}