{"2412.01306": {"publish_time": "2024-12-02", "title": "Multimodal Medical Disease Classification with LLaMA II", "paper_summary": "Medical patient data is always multimodal. Images, text, age, gender,\nhistopathological data are only few examples for different modalities in this\ncontext. Processing and integrating this multimodal data with deep learning\nbased methods is of utmost interest due to its huge potential for medical\nprocedure such as diagnosis and patient treatment planning. In this work we\nretrain a multimodal transformer-based model for disease classification. To\nthis end we use the text-image pair dataset from OpenI consisting of 2D chest\nX-rays associated with clinical reports. Our focus is on fusion methods for\nmerging text and vision information extracted from medical datasets. Different\narchitecture structures with a LLaMA II backbone model are tested. Early fusion\nof modality specific features creates better results with the best model\nreaching 97.10% mean AUC than late fusion from a deeper level of the\narchitecture (best model: 96.67% mean AUC). Both outperform former\nclassification models tested on the same multimodal dataset. The newly\nintroduced multimodal architecture can be applied to other multimodal datasets\nwith little effort and can be easily adapted for further research, especially,\nbut not limited to, the field of medical AI.", "paper_summary_zh": "醫療病患資料總是多模態的。影像、文字、年齡、性別、組織病理學資料只是此脈絡下不同模態的幾個例子。處理和整合這些多模態資料，並使用深度學習方法，由於其在醫療程序（例如診斷和病患治療計畫）的龐大潛力，因此至關重要。在這項工作中，我們重新訓練一個多模態Transformer基礎模型，用於疾病分類。為此，我們使用來自 OpenI 的文字影像配對資料集，其中包含與臨床報告相關的 2D 胸部 X 光。我們的重點在於融合方法，用於合併從醫療資料集提取的文字和影像資訊。測試了具有 LLaMA II 主幹模型的不同架構結構。特定於模態特徵的早期融合會產生更好的結果，最佳模型達到 97.10% 的平均 AUC，高於從架構更深層次進行的後期融合（最佳模型：96.67% 的平均 AUC）。兩者都優於在相同多模態資料集上測試的前分類模型。新推出的多模態架構可以毫不費力地應用於其他多模態資料集，並且可以輕鬆改編以進行進一步的研究，特別是（但不限於）醫療 AI 領域。", "author": "Christian Gapp et.al.", "authors": "Christian Gapp, Elias Tappeiner, Martin Welk, Rainer Schubert", "id": "2412.01306v1", "paper_url": "http://arxiv.org/abs/2412.01306v1", "repo": "null"}}