{"2407.02870": {"publish_time": "2024-07-03", "title": "Membership Inference Attacks Against Time-Series Models", "paper_summary": "Analyzing time-series data that may contain personal information,\nparticularly in the medical field, presents serious privacy concerns. Sensitive\nhealth data from patients is often used to train machine-learning models for\ndiagnostics and ongoing care. Assessing the privacy risk of such models is\ncrucial to making knowledgeable decisions on whether to use a model in\nproduction, share it with third parties, or deploy it in patients homes.\nMembership Inference Attacks (MIA) are a key method for this kind of\nevaluation, however time-series prediction models have not been thoroughly\nstudied in this context. We explore existing MIA techniques on time-series\nmodels, and introduce new features, focusing on the seasonality and trend\ncomponents of the data. Seasonality is estimated using a multivariate Fourier\ntransform, and a low-degree polynomial is used to approximate trends. We\napplied these techniques to various types of time-series models, using datasets\nfrom the health domain. Our results demonstrate that these new features enhance\nthe effectiveness of MIAs in identifying membership, improving the\nunderstanding of privacy risks in medical data applications.", "paper_summary_zh": "分析可能包含个人信息的時間序列資料，特別是在醫療領域，會引發嚴重的隱私問題。病患的敏感健康資料經常被用於訓練機器學習模型，以進行診斷和持續照護。評估此類模型的隱私風險，對於在生產中使用模型、與第三方分享，或在病患家中部署模型時做出明智的決定至關重要。成員推論攻擊 (MIA) 是進行此類評估的一種關鍵方法，然而，在此背景下尚未徹底研究時序預測模型。我們探討了時序模型上現有的 MIA 技術，並引入了新的功能，重點關注資料的季節性和趨勢組成。季節性使用多變數傅立葉轉換來估計，低次多項式用於近似趨勢。我們將這些技術應用於各種類型的時序模型，使用來自健康領域的資料集。我們的結果表明，這些新功能增強了 MIA 在識別成員資格方面的效能，進而提升了對醫療資料應用中隱私風險的理解。", "author": "Noam Koren et.al.", "authors": "Noam Koren, Abigail Goldsteen, Ariel Farkash, Guy Amit", "id": "2407.02870v1", "paper_url": "http://arxiv.org/abs/2407.02870v1", "repo": "null"}}