{"2410.04708": {"publish_time": "2024-10-07", "title": "Tight Stability, Convergence, and Robustness Bounds for Predictive Coding Networks", "paper_summary": "Energy-based learning algorithms, such as predictive coding (PC), have\ngarnered significant attention in the machine learning community due to their\ntheoretical properties, such as local operations and biologically plausible\nmechanisms for error correction. In this work, we rigorously analyze the\nstability, robustness, and convergence of PC through the lens of dynamical\nsystems theory. We show that, first, PC is Lyapunov stable under mild\nassumptions on its loss and residual energy functions, which implies intrinsic\nrobustness to small random perturbations due to its well-defined\nenergy-minimizing dynamics. Second, we formally establish that the PC updates\napproximate quasi-Newton methods by incorporating higher-order curvature\ninformation, which makes them more stable and able to converge with fewer\niterations compared to models trained via backpropagation (BP). Furthermore,\nusing this dynamical framework, we provide new theoretical bounds on the\nsimilarity between PC and other algorithms, i.e., BP and target propagation\n(TP), by precisely characterizing the role of higher-order derivatives. These\nbounds, derived through detailed analysis of the Hessian structures, show that\nPC is significantly closer to quasi-Newton updates than TP, providing a deeper\nunderstanding of the stability and efficiency of PC compared to conventional\nlearning methods.", "paper_summary_zh": "基於能量的學習演算法，例如預測編碼 (PC)，由於其理論性質（例如局部運算和生物學上合理的誤差修正機制），在機器學習社群中獲得顯著關注。在這項工作中，我們透過動態系統理論的觀點，嚴謹分析 PC 的穩定性、穩健性和收斂性。我們首先展示，在對其損失和殘差能量函數的溫和假設下，PC 是 Lyapunov 穩定的，這表示由於其定義良好的能量最小化動態，而具有對小型隨機擾動的內在穩健性。其次，我們正式建立 PC 更新近似準牛頓法，方法是納入高階曲率資訊，這使得它們更穩定，並且能夠與透過反向傳播 (BP) 訓練的模型相比，以更少的反覆運算來收斂。此外，使用這個動態框架，我們提供了 PC 與其他演算法（即 BP 和目標傳播 (TP)）之間相似性的新理論界線，方法是精確描述高階導數的角色。這些界線是透過對海森結構的詳細分析所衍生，顯示 PC 明顯比 TP 更接近準牛頓更新，這提供了對 PC 的穩定性和效率，與傳統學習方法相比，有更深入的了解。", "author": "Ankur Mali et.al.", "authors": "Ankur Mali, Tommaso Salvatori, Alexander Ororbia", "id": "2410.04708v1", "paper_url": "http://arxiv.org/abs/2410.04708v1", "repo": "null"}}