{"2408.12157": {"publish_time": "2024-08-22", "title": "Implicit Sentiment Analysis Based on Chain of Thought Prompting", "paper_summary": "Implicit Sentiment Analysis (ISA) is a crucial research area in natural\nlanguage processing. Inspired by the idea of large language model Chain of\nThought (CoT), this paper introduces a Sentiment Analysis of Thinking (SAoT)\nframework. The framework first analyzes the implicit aspects and opinions in\nthe text using common sense and thinking chain capabilities. Then, it reflects\non the process of implicit sentiment analysis and finally deduces the polarity\nof sentiment. The model is evaluated on the SemEval 2014 dataset, consisting of\n1120 restaurant reviews and 638 laptop reviews. The experimental results\ndemonstrate that the utilization of the ERNIE-Bot-4+SAoT model yields a notable\nperformance improvement. Specifically, on the restaurant dataset, the F1 score\nreaches 75.27, accompanied by an ISA score of 66.29. Similarly, on the computer\ndataset, the F1 score achieves 76.50, while the ISA score amounts to 73.46.\nComparatively, the ERNIE-Bot-4+SAoT model surpasses the BERTAsp + SCAPt\nbaseline by an average margin of 47.99%.", "paper_summary_zh": "內隱情緒分析 (ISA) 是自然語言處理中一個重要的研究領域。本論文受到大型語言模型思考鏈 (CoT) 的想法啟發，提出了一個思考情緒分析 (SAoT) 架構。此架構首先使用常識和思考鏈的能力來分析文本中的內隱面向和意見。然後，它回顧內隱情緒分析的過程，最後推論出情緒的極性。此模型在 SemEval 2014 資料集上進行評估，該資料集包含 1120 篇餐廳評論和 638 篇筆電評論。實驗結果證明，利用 ERNIE-Bot-4+SAoT 模型會帶來顯著的效能提升。特別是在餐廳資料集上，F1 分數達到 75.27，ISA 分數為 66.29。類似地，在電腦資料集上，F1 分數達到 76.50，而 ISA 分數為 73.46。相較之下，ERNIE-Bot-4+SAoT 模型平均超過 BERTAsp + SCAPt 基準 47.99%。", "author": "Zhihua Duan et.al.", "authors": "Zhihua Duan, Jialin Wang", "id": "2408.12157v1", "paper_url": "http://arxiv.org/abs/2408.12157v1", "repo": "null"}}