{"2412.19363": {"publish_time": "2024-12-26", "title": "Large Language Models for Market Research: A Data-augmentation Approach", "paper_summary": "Large Language Models (LLMs) have transformed artificial intelligence by\nexcelling in complex natural language processing tasks. Their ability to\ngenerate human-like text has opened new possibilities for market research,\nparticularly in conjoint analysis, where understanding consumer preferences is\nessential but often resource-intensive. Traditional survey-based methods face\nlimitations in scalability and cost, making LLM-generated data a promising\nalternative. However, while LLMs have the potential to simulate real consumer\nbehavior, recent studies highlight a significant gap between LLM-generated and\nhuman data, with biases introduced when substituting between the two. In this\npaper, we address this gap by proposing a novel statistical data augmentation\napproach that efficiently integrates LLM-generated data with real data in\nconjoint analysis. Our method leverages transfer learning principles to debias\nthe LLM-generated data using a small amount of human data. This results in\nstatistically robust estimators with consistent and asymptotically normal\nproperties, in contrast to naive approaches that simply substitute human data\nwith LLM-generated data, which can exacerbate bias. We validate our framework\nthrough an empirical study on COVID-19 vaccine preferences, demonstrating its\nsuperior ability to reduce estimation error and save data and costs by 24.9\\%\nto 79.8\\%. In contrast, naive approaches fail to save data due to the inherent\nbiases in LLM-generated data compared to human data. Another empirical study on\nsports car choices validates the robustness of our results. Our findings\nsuggest that while LLM-generated data is not a direct substitute for human\nresponses, it can serve as a valuable complement when used within a robust\nstatistical framework.", "paper_summary_zh": "大型語言模型 (LLM) 透過在複雜的自然語言處理任務中表現出色，轉變了人工智慧。它們產生類似人類文字的能力為市場研究開創了新的可能性，特別是在聯合分析中，了解消費者偏好至關重要，但通常需要大量資源。傳統的基於調查的方法在可擴充性和成本方面面臨限制，這使得 LLM 生成的數據成為一個有前途的替代方案。然而，儘管 LLM 有模擬真實消費者行為的潛力，但最近的研究強調了 LLM 生成數據和人類數據之間存在顯著差距，在兩者之間進行替換時會引入偏差。在本文中，我們通過提出一個新穎的統計數據擴充方法來解決這個差距，該方法有效地將 LLM 生成的數據與聯合分析中的真實數據整合在一起。我們的模型利用遷移學習原理，使用少量的人類數據來消除 LLM 生成的數據的偏差。這產生了具有相容和漸近常態特性的統計穩健估計器，這與天真方法形成對比，天真方法簡單地用 LLM 生成的數據替換人類數據，這會加劇偏差。我們通過對 COVID-19 疫苗偏好的實證研究驗證了我們的框架，證明了它在減少估計誤差和節省數據和成本方面具有優越的能力，節省幅度為 24.9% 至 79.8%。相反，天真方法由於 LLM 生成的數據與人類數據相比固有的偏差，而無法節省數據。另一項關於跑車選擇的實證研究驗證了我們結果的穩健性。我們的研究結果表明，儘管 LLM 生成的數據並不能直接替代人類的反應，但當在穩健的統計框架內使用時，它可以作為有價值的補充。", "author": "Mengxin Wang et.al.", "authors": "Mengxin Wang, Dennis J. Zhang, Heng Zhang", "id": "2412.19363v1", "paper_url": "http://arxiv.org/abs/2412.19363v1", "repo": "null"}}