{"2405.10160": {"publish_time": "2024-05-16", "title": "PIR: Remote Sensing Image-Text Retrieval with Prior Instruction Representation Learning", "paper_summary": "Remote sensing image-text retrieval constitutes a foundational aspect of\nremote sensing interpretation tasks, facilitating the alignment of vision and\nlanguage representations. This paper introduces a prior instruction\nrepresentation (PIR) learning paradigm that draws on prior knowledge to\ninstruct adaptive learning of vision and text representations. Based on PIR, a\ndomain-adapted remote sensing image-text retrieval framework PIR-ITR is\ndesigned to address semantic noise issues in vision-language understanding\ntasks. However, with massive additional data for pre-training the\nvision-language foundation model, remote sensing image-text retrieval is\nfurther developed into an open-domain retrieval task. Continuing with the\nabove, we propose PIR-CLIP, a domain-specific CLIP-based framework for remote\nsensing image-text retrieval, to address semantic noise in remote sensing\nvision-language representations and further improve open-domain retrieval\nperformance. In vision representation, Vision Instruction Representation (VIR)\nbased on Spatial-PAE utilizes the prior-guided knowledge of the remote sensing\nscene recognition by building a belief matrix to select key features for\nreducing the impact of semantic noise. In text representation, Language Cycle\nAttention (LCA) based on Temporal-PAE uses the previous time step to cyclically\nactivate the current time step to enhance text representation capability. A\ncluster-wise Affiliation Loss (AL) is proposed to constrain the inter-classes\nand to reduce the semantic confusion zones in the common subspace.\nComprehensive experiments demonstrate that PIR could enhance vision and text\nrepresentations and outperform the state-of-the-art methods of closed-domain\nand open-domain retrieval on two benchmark datasets, RSICD and RSITMD.", "paper_summary_zh": "遙感影像文字檢索構成遙感解譯任務的基礎層面，促進視覺與語言表徵的一致性。本文介紹一種事前指令表徵 (PIR) 學習範例，利用事前知識指導視覺與文字表徵的自適應學習。根據 PIR，設計了一個領域適應的遙感影像文字檢索架構 PIR-ITR，用於解決視覺語言理解任務中的語義雜訊問題。然而，隨著預訓練視覺語言基礎模型的大量額外資料，遙感影像文字檢索進一步發展成開放領域檢索任務。延續上述，我們提出 PIR-CLIP，一個基於領域特定 CLIP 的遙感影像文字檢索架構，用於解決遙感視覺語言表徵中的語義雜訊，並進一步提升開放領域檢索效能。在視覺表徵中，基於空間 PAE 的視覺指令表徵 (VIR) 透過建立一個信念矩陣，利用遙感場景辨識的事前引導知識，來選擇關鍵特徵，以降低語義雜訊的影響。在文字表徵中，基於時間 PAE 的語言循環注意力 (LCA) 使用前一個時間步驟，以循環方式啟動當前時間步驟，以增強文字表徵能力。提出一個群集式關聯損失 (AL)，用於約束類間，並減少共同子空間中的語義混淆區域。全面的實驗證明，PIR 可以增強視覺和文字表徵，並在兩個基準資料集 RSICD 和 RSITMD 上優於封閉領域和開放領域檢索的最新方法。", "author": "Jiancheng Pan et.al.", "authors": "Jiancheng Pan, Muyuan Ma, Qing Ma, Cong Bai, Shengyong Chen", "id": "2405.10160v1", "paper_url": "http://arxiv.org/abs/2405.10160v1", "repo": "https://github.com/jaychempan/pir-clip"}}