{"2412.04266": {"publish_time": "2024-12-05", "title": "Representation Purification for End-to-End Speech Translation", "paper_summary": "Speech-to-text translation (ST) is a cross-modal task that involves\nconverting spoken language into text in a different language. Previous research\nprimarily focused on enhancing speech translation by facilitating knowledge\ntransfer from machine translation, exploring various methods to bridge the gap\nbetween speech and text modalities. Despite substantial progress made, factors\nin speech that are not relevant to translation content, such as timbre and\nrhythm, often limit the efficiency of knowledge transfer. In this paper, we\nconceptualize speech representation as a combination of content-agnostic and\ncontent-relevant factors. We examine the impact of content-agnostic factors on\ntranslation performance through preliminary experiments and observe a\nsignificant performance deterioration when content-agnostic perturbations are\nintroduced to speech signals. To address this issue, we propose a\n\\textbf{S}peech \\textbf{R}epresentation \\textbf{P}urification with\n\\textbf{S}upervision \\textbf{E}nhancement (SRPSE) framework, which excludes the\ncontent-agnostic components within speech representations to mitigate their\nnegative impact on ST. Experiments on MuST-C and CoVoST-2 datasets demonstrate\nthat SRPSE significantly improves translation performance across all\ntranslation directions in three settings and achieves preeminent performance\nunder a \\textit{transcript-free} setting.", "paper_summary_zh": "語音轉文字翻譯 (ST) 是一個跨模態任務，涉及將口說語言轉換為不同語言的文字。先前的研究主要集中於透過促進機器翻譯的知識轉移來增強語音翻譯，探索各種方法來彌合語音和文字模態之間的差距。儘管取得了實質進展，但語音中與翻譯內容無關的因素（例如音色和節奏）通常會限制知識轉移的效率。在本文中，我們將語音表徵概念化為內容不可知和與內容相關的因素的組合。我們透過初步實驗檢查內容不可知因素對翻譯效能的影響，並觀察到當內容不可知的擾動被引入語音訊號時，效能會顯著下降。為了解決這個問題，我們提出了一個語音表徵淨化與監督增強 (SRPSE) 框架，它排除了語音表徵中的內容不可知組成部分，以減輕它們對 ST 的負面影響。在 MuST-C 和 CoVoST-2 資料集上的實驗證明，SRPSE 在所有翻譯方向上顯著改善了翻譯效能，並在「無轉錄」設定下取得卓越的效能。", "author": "Chengwei Zhang et.al.", "authors": "Chengwei Zhang, Yue Zhou, Rui Zhao, Yidong Chen, Xiaodong Shi", "id": "2412.04266v1", "paper_url": "http://arxiv.org/abs/2412.04266v1", "repo": "null"}}