{"2501.01102": {"publish_time": "2025-01-02", "title": "Disambiguation of Chinese Polyphones in an End-to-End Framework with Semantic Features Extracted by Pre-trained BERT", "paper_summary": "Grapheme-to-phoneme (G2P) conversion serves as an essential component in\nChinese Mandarin text-to-speech (TTS) system, where polyphone disambiguation is\nthe core issue. In this paper, we propose an end-to-end framework to predict\nthe pronunciation of a polyphonic character, which accepts sentence containing\npolyphonic character as input in the form of Chinese character sequence without\nthe necessity of any preprocessing. The proposed method consists of a\npre-trained bidirectional encoder representations from Transformers (BERT)\nmodel and a neural network (NN) based classifier. The pre-trained BERT model\nextracts semantic features from a raw Chinese character sequence and the NN\nbased classifier predicts the polyphonic character's pronunciation according to\nBERT output. In out experiments, we implemented three classifiers, a\nfully-connected network based classifier, a long short-term memory (LSTM)\nnetwork based classifier and a Transformer block based classifier. The\nexperimental results compared with the baseline approach based on LSTM\ndemonstrate that, the pre-trained model extracts effective semantic features,\nwhich greatly enhances the performance of polyphone disambiguation. In\naddition, we also explored the impact of contextual information on polyphone\ndisambiguation.", "paper_summary_zh": "音素转换 (G2P) 是中文普通话文本到语音 (TTS) 系统中的一个重要组成部分，其中多音字消除歧义是核心问题。在本文中，我们提出一个端到端框架来预测多音字的发音，该框架接受包含多音字的句子作为输入，形式为中文汉字序列，无需任何预处理。所提出的方法由预训练的来自 Transformer 的双向编码器表示 (BERT) 模型和基于神经网络 (NN) 的分类器组成。预训练的 BERT 模型从原始中文汉字序列中提取语义特征，而基于 NN 的分类器根据 BERT 输出预测多音字的发音。在我们的实验中，我们实现了三个分类器，一个基于全连接网络的分类器，一个基于长短期记忆 (LSTM) 网络的分类器和一个基于 Transformer 块的分类器。与基于 LSTM 的基线方法相比，实验结果表明，预训练模型提取了有效的语义特征，极大地提高了消除多音字歧义的性能。此外，我们还探讨了上下文信息对消除多音字歧义的影响。", "author": "Dongyang Dai et.al.", "authors": "Dongyang Dai, Zhiyong Wu, Shiyin Kang, Xixin Wu, Jia Jia, Dan Su, Dong Yu, Helen Meng", "id": "2501.01102v1", "paper_url": "http://arxiv.org/abs/2501.01102v1", "repo": "null"}}