{"2405.15598": {"publish_time": "2024-05-24", "title": "MCDFN: Supply Chain Demand Forecasting via an Explainable Multi-Channel Data Fusion Network Model Integrating CNN, LSTM, and GRU", "paper_summary": "Accurate demand forecasting is crucial for optimizing supply chain\nmanagement. Traditional methods often fail to capture complex patterns from\nseasonal variability and special events. Despite advancements in deep learning,\ninterpretable forecasting models remain a challenge. To address this, we\nintroduce the Multi-Channel Data Fusion Network (MCDFN), a hybrid architecture\nthat integrates Convolutional Neural Networks (CNN), Long Short-Term Memory\nnetworks (LSTM), and Gated Recurrent Units (GRU) to enhance predictive\nperformance by extracting spatial and temporal features from time series data.\nOur rigorous benchmarking demonstrates that MCDFN outperforms seven other\ndeep-learning models, achieving superior metrics: MSE (23.5738%), RMSE\n(4.8553%), MAE (3.9991%), and MAPE (20.1575%). Additionally, MCDFN's\npredictions were statistically indistinguishable from actual values, confirmed\nby a paired t-test with a 5% p-value and a 10-fold cross-validated statistical\npaired t-test. We apply explainable AI techniques like ShapTime and Permutation\nFeature Importance to enhance interpretability. This research advances demand\nforecasting methodologies and offers practical guidelines for integrating MCDFN\ninto supply chain systems, highlighting future research directions for\nscalability and user-friendly deployment.", "paper_summary_zh": "準確的需求預測對於優化供應鏈管理至關重要。傳統方法往往無法掌握季節性變化和特殊事件的複雜模式。儘管深度學習有進步，但可解釋的預測模型仍然是一個挑戰。為了解決這個問題，我們引入了多通道數據融合網路 (MCDFN)，這是一種混合架構，整合了卷積神經網路 (CNN)、長短期記憶網路 (LSTM) 和門控循環單元 (GRU) 來增強預測性能，方法是從時間序列數據中提取空間和時間特徵。我們的嚴格基準測試表明，MCDFN 優於其他七種深度學習模型，達到了優異的指標：MSE (23.5738%)、RMSE (4.8553%)、MAE (3.9991%) 和 MAPE (20.1575%)。此外，MCDFN 的預測與實際值在統計上沒有區別，這通過配對 t 檢定（p 值為 5%）和 10 倍交叉驗證的統計配對 t 檢定得到證實。我們應用可解釋的 AI 技術，如 ShapTime 和置換特徵重要性，以增強可解釋性。本研究推動了需求預測方法，並為將 MCDFN 整合到供應鏈系統中提供了實用指南，重點說明了可擴充性和用戶友善部署的未來研究方向。", "author": "Md Abrar Jahin et.al.", "authors": "Md Abrar Jahin, Asef Shahriar, Md Al Amin", "id": "2405.15598v1", "paper_url": "http://arxiv.org/abs/2405.15598v1", "repo": "null"}}