{"2410.03446": {"publish_time": "2024-10-04", "title": "On Uncertainty In Natural Language Processing", "paper_summary": "The last decade in deep learning has brought on increasingly capable systems\nthat are deployed on a wide variety of applications. In natural language\nprocessing, the field has been transformed by a number of breakthroughs\nincluding large language models, which are used in increasingly many\nuser-facing applications. In order to reap the benefits of this technology and\nreduce potential harms, it is important to quantify the reliability of model\npredictions and the uncertainties that shroud their development.\n  This thesis studies how uncertainty in natural language processing can be\ncharacterized from a linguistic, statistical and neural perspective, and how it\ncan be reduced and quantified through the design of the experimental pipeline.\nWe further explore uncertainty quantification in modeling by theoretically and\nempirically investigating the effect of inductive model biases in text\nclassification tasks. The corresponding experiments include data for three\ndifferent languages (Danish, English and Finnish) and tasks as well as a large\nset of different uncertainty quantification approaches. Additionally, we\npropose a method for calibrated sampling in natural language generation based\non non-exchangeable conformal prediction, which provides tighter token sets\nwith better coverage of the actual continuation. Lastly, we develop an approach\nto quantify confidence in large black-box language models using auxiliary\npredictors, where the confidence is predicted from the input to and generated\noutput text of the target model alone.", "paper_summary_zh": "深度學習的最後十年帶來了越來越有能力的系統，這些系統被部署在各種應用程式上。在自然語言處理中，這個領域已經被許多突破所改變，包括大型語言模型，這些模型被用於越來越多的面向使用者的應用程式中。為了獲取這項技術的好處並減少潛在的危害，量化模型預測的可靠性和籠罩其開發的不確定性非常重要。本論文研究了自然語言處理中的不確定性如何從語言學、統計學和神經網路的角度來表徵，以及如何通過實驗管線的設計來降低和量化不確定性。我們進一步探討了建模中的不確定性量化，通過理論和經驗研究了歸納模型偏差在文本分類任務中的影響。對應的實驗包括三種不同語言（丹麥語、英語和芬蘭語）的資料和任務，以及一大組不同的不確定性量化方法。此外，我們提出了一種基於不可交換一致性預測的校準抽樣方法，該方法提供了更嚴格的標記集，並更好地涵蓋了實際的延續。最後，我們開發了一種方法來量化大型黑盒語言模型中的信心，使用輔助預測器，其中信心僅從目標模型的輸入和生成的輸出文本中預測。", "author": "Dennis Ulmer et.al.", "authors": "Dennis Ulmer", "id": "2410.03446v1", "paper_url": "http://arxiv.org/abs/2410.03446v1", "repo": "https://github.com/kaleidophon/nlp-uncertainty-zoo"}}