{"2407.06866": {"publish_time": "2024-07-09", "title": "ChatGPT Doesn't Trust Chargers Fans: Guardrail Sensitivity in Context", "paper_summary": "While the biases of language models in production are extensively documented,\nthe biases of their guardrails have been neglected. This paper studies how\ncontextual information about the user influences the likelihood of an LLM to\nrefuse to execute a request. By generating user biographies that offer\nideological and demographic information, we find a number of biases in\nguardrail sensitivity on GPT-3.5. Younger, female, and Asian-American personas\nare more likely to trigger a refusal guardrail when requesting censored or\nillegal information. Guardrails are also sycophantic, refusing to comply with\nrequests for a political position the user is likely to disagree with. We find\nthat certain identity groups and seemingly innocuous information, e.g., sports\nfandom, can elicit changes in guardrail sensitivity similar to direct\nstatements of political ideology. For each demographic category and even for\nAmerican football team fandom, we find that ChatGPT appears to infer a likely\npolitical ideology and modify guardrail behavior accordingly.", "paper_summary_zh": "儘管語言模型在生產中的偏差已廣泛記錄，\n但其防護措施的偏差卻被忽略了。本文研究了關於使用者的背景資訊如何影響 LLM 拒絕執行請求的可能性。透過產生提供意識形態和人口統計資訊的使用者傳記，我們發現 GPT-3.5 防護措施敏感性存在許多偏差。年輕、女性和亞裔美國人的角色在要求審查或非法資訊時，更有可能觸發拒絕防護措施。防護措施也具有阿諛奉承的性質，拒絕遵守使用者可能不同意的政治立場的請求。我們發現某些身分群體和看似無害的資訊（例如體育迷）會引發防護措施敏感性的變化，類似於直接陳述政治意識形態。對於每個人口統計類別，甚至對於美式足球隊的球迷，我們發現 ChatGPT 似乎會推論出可能的政治意識形態，並相應地修改防護措施行為。", "author": "Victoria R. Li et.al.", "authors": "Victoria R. Li, Yida Chen, Naomi Saphra", "id": "2407.06866v1", "paper_url": "http://arxiv.org/abs/2407.06866v1", "repo": "null"}}