{"2410.06961": {"publish_time": "2024-10-09", "title": "Self-Boosting Large Language Models with Synthetic Preference Data", "paper_summary": "Through alignment with human preferences, Large Language Models (LLMs) have\nadvanced significantly in generating honest, harmless, and helpful responses.\nHowever, collecting high-quality preference data is a resource-intensive and\ncreativity-demanding process, especially for the continual improvement of LLMs.\nWe introduce SynPO, a self-boosting paradigm that leverages synthetic\npreference data for model alignment. SynPO employs an iterative mechanism\nwherein a self-prompt generator creates diverse prompts, and a response\nimprover refines model responses progressively. This approach trains LLMs to\nautonomously learn the generative rewards for their own outputs and eliminates\nthe need for large-scale annotation of prompts and human preferences. After\nfour SynPO iterations, Llama3-8B and Mistral-7B show significant enhancements\nin instruction-following abilities, achieving over 22.1% win rate improvements\non AlpacaEval 2.0 and ArenaHard. Simultaneously, SynPO improves the general\nperformance of LLMs on various tasks, validated by a 3.2 to 5.0 average score\nincrease on the well-recognized Open LLM leaderboard.", "paper_summary_zh": "透過與人類偏好對齊，大型語言模型 (LLM) 在產生誠實、無害且有用的回應方面已取得顯著進展。然而，收集高品質的偏好資料是一個耗費資源且需要創造力的過程，特別是對於 LLM 的持續改進。我們介紹 SynPO，一種自我提升的範例，它利用合成偏好資料進行模型對齊。SynPO 採用意義機制，其中自我提示產生器會產生不同的提示，而回應改進器會逐步改善模型回應。這種方法訓練 LLM 自主學習其輸出產生的獎勵，並消除了對提示和大規模標記人類偏好的需求。在四次 SynPO 迭代後，Llama3-8B 和 Mistral-7B 在遵循指令的能力上表現出顯著的提升，在 AlpacaEval 2.0 和 ArenaHard 上的獲勝率提升超過 22.1%。同時，SynPO 提升了 LLM 在各種任務上的整體表現，這由公認的 Open LLM 排行榜上平均分數提升 3.2 到 5.0 得到驗證。", "author": "Qingxiu Dong et.al.", "authors": "Qingxiu Dong, Li Dong, Xingxing Zhang, Zhifang Sui, Furu Wei", "id": "2410.06961v1", "paper_url": "http://arxiv.org/abs/2410.06961v1", "repo": "null"}}