{"2405.20867": {"publish_time": "2024-05-31", "title": "Automatic Channel Pruning for Multi-Head Attention", "paper_summary": "Despite the strong performance of Transformers, their quadratic computation\ncomplexity presents challenges in applying them to vision tasks. Automatic\npruning is one of effective methods for reducing computation complexity without\nheuristic approaches. However, directly applying it to multi-head attention is\nnot straightforward due to channel misalignment. In this paper, we propose an\nautomatic channel pruning method to take into account the multi-head attention\nmechanism. First, we incorporate channel similarity-based weights into the\npruning indicator to preserve more informative channels in each head. Then, we\nadjust pruning indicator to enforce removal of channels in equal proportions\nacross all heads, preventing the channel misalignment. We also add a reweight\nmodule to compensate for information loss resulting from channel removal, and\nan effective initialization step for pruning indicator based on difference of\nattention between original structure and each channel. Our proposed method can\nbe used to not only original attention, but also linear attention, which is\nmore efficient as linear complexity with respect to the number of tokens. On\nImageNet-1K, applying our pruning method to the FLattenTransformer, which\nincludes both attention mechanisms, shows outperformed accuracy for several\nMACs compared with previous state-of-the-art efficient models and pruned\nmethods. Code will be available soon.", "paper_summary_zh": "儘管 Transformer 有強勁的效能，但其二次運算複雜度在應用於視覺任務時會產生挑戰。自動剪枝是降低運算複雜度的方法之一，且無需使用啟發式方法。然而，由於通道未對齊，無法直接將其應用於多頭注意力。在本文中，我們提出了一種自動通道剪枝方法來考量多頭注意力機制。首先，我們將基於通道相似性的權重納入剪枝指標，以保留每個頭中更多有資訊性的通道。然後，我們調整剪枝指標，以強制在所有頭中按相等比例移除通道，防止通道未對齊。我們還新增一個重新加權模組，以補償因通道移除而造成的資訊損失，以及一個基於原始結構與每個通道之間注意力的差異的剪枝指標有效初始化步驟。我們提出的方法不僅可用於原始注意力，還能用於線性注意力，其效率更高，因為其線性複雜度與 token 數量有關。在 ImageNet-1K 上，將我們的剪枝方法應用於包含兩種注意力機制的 FLattenTransformer，與先前的最先進高效模型和剪枝方法相比，對於多個 MAC 顯示出優異的準確度。程式碼將很快提供。", "author": "Eunho Lee et.al.", "authors": "Eunho Lee, Youngbae Hwang", "id": "2405.20867v1", "paper_url": "http://arxiv.org/abs/2405.20867v1", "repo": "null"}}