{"2501.13720": {"publish_time": "2025-01-23", "title": "Musical ethnocentrism in Large Language Models", "paper_summary": "Large Language Models (LLMs) reflect the biases in their training data and,\nby extension, those of the people who created this training data. Detecting,\nanalyzing, and mitigating such biases is becoming a focus of research. One type\nof bias that has been understudied so far are geocultural biases. Those can be\ncaused by an imbalance in the representation of different geographic regions\nand cultures in the training data, but also by value judgments contained\ntherein. In this paper, we make a first step towards analyzing musical biases\nin LLMs, particularly ChatGPT and Mixtral. We conduct two experiments. In the\nfirst, we prompt LLMs to provide lists of the \"Top 100\" musical contributors of\nvarious categories and analyze their countries of origin. In the second\nexperiment, we ask the LLMs to numerically rate various aspects of the musical\ncultures of different countries. Our results indicate a strong preference of\nthe LLMs for Western music cultures in both experiments.", "paper_summary_zh": "大型語言模型 (LLM) 反映其訓練資料中的偏見，進一步而言，也反映了建立這些訓練資料的人的偏見。偵測、分析和減輕此類偏見已成為研究重點。到目前為止，一種研究不足的偏見類型是地理文化偏見。這些偏見可能是由於訓練資料中不同地理區域和文化的代表性不平衡，也可能是由於其中包含的價值判斷所造成的。在本文中，我們邁出了分析 LLM 中音樂偏見的第一步，特別是 ChatGPT 和 Mixtral。我們進行了兩個實驗。在第一個實驗中，我們提示 LLM 提供各種類別的「前 100 名」音樂貢獻者清單，並分析其原籍國。在第二個實驗中，我們要求 LLM 對不同國家的音樂文化的各個方面進行數字評分。我們的結果表明，在兩個實驗中，LLM 都強烈偏好西方音樂文化。", "author": "Anna Kruspe et.al.", "authors": "Anna Kruspe", "id": "2501.13720v1", "paper_url": "http://arxiv.org/abs/2501.13720v1", "repo": "null"}}