{"2501.18455": {"publish_time": "2025-01-30", "title": "Conversation Games and a Strategic View of the Turing Test", "paper_summary": "Although many game-theoretic models replicate real interactions that often\nrely on natural language, explicit study of games where language is central to\nstrategic interaction remains limited. This paper introduces the\n\\emph{conversation game}, a multi-stage, extensive-form game based on\nlinguistic strategic interaction. We focus on a subset of the games, called\nverdict games. In a verdict game, two players alternate to contribute to a\nconversation, which is evaluated at each stage by a non-strategic judge who may\nrender a conclusive binary verdict, or a decision to continue the dialogue. The\ngame ends once a limit is reached or a verdict is given. We show many familiar\nprocesses, such as interrogation or a court process fall under this category.\nWe also, show that the Turing test is an instance of verdict game, and discuss\nthe significance of a strategic view of the Turing test in the age of advanced\nAI deception. We show the practical relevance of the proposed concepts by\nsimulation experiments, and show that a strategic agent outperforms a naive\nagent by a high margin.", "paper_summary_zh": "儘管許多博弈論模型複製了真實的互動，而這些互動通常依賴於自然語言，但對於語言在策略互動中居於核心的遊戲之明確研究仍然有限。本文介紹了「對話遊戲」，這是一款基於語言策略互動的多階段廣義型遊戲。我們專注於遊戲的一個子集，稱為判決遊戲。在判決遊戲中，兩名玩家輪流參與對話，對話在每個階段由一名非策略性法官評估，該法官可能會做出明確的二元判決，或決定繼續對話。遊戲在達到限制或做出判決後結束。我們展示了許多常見的程序，例如審問或法庭程序屬於此類別。我們還展示了圖靈測試是判決遊戲的一個實例，並討論了在先進 AI 欺騙時代，從策略角度看待圖靈測試的重要性。我們透過模擬實驗展示了所提出概念的實際相關性，並展示了一個策略性代理遠遠優於一個天真代理。", "author": "Kaveh Aryan et.al.", "authors": "Kaveh Aryan", "id": "2501.18455v1", "paper_url": "http://arxiv.org/abs/2501.18455v1", "repo": "null"}}