{"2408.14806": {"publish_time": "2024-08-27", "title": "Poly2Vec: Polymorphic Encoding of Geospatial Objects for Spatial Reasoning with Deep Neural Networks", "paper_summary": "Encoding geospatial data is crucial for enabling machine learning (ML) models\nto perform tasks that require spatial reasoning, such as identifying the\ntopological relationships between two different geospatial objects. However,\nexisting encoding methods are limited as they are typically customized to\nhandle only specific types of spatial data, which impedes their applicability\nacross different downstream tasks where multiple data types coexist. To address\nthis, we introduce Poly2Vec, an encoding framework that unifies the modeling of\ndifferent geospatial objects, including 2D points, polylines, and polygons,\nirrespective of the downstream task. We leverage the power of the 2D Fourier\ntransform to encode useful spatial properties, such as shape and location, from\ngeospatial objects into fixed-length vectors. These vectors are then inputted\ninto neural network models for spatial reasoning tasks.This unified approach\neliminates the need to develop and train separate models for each distinct\nspatial type. We evaluate Poly2Vec on both synthetic and real datasets of mixed\ngeometry types and verify its consistent performance across several downstream\nspatial reasoning tasks.", "paper_summary_zh": "對地理空間資料進行編碼對於讓機器學習 (ML) 模型執行需要空間推理的任務至關重要，例如識別兩個不同地理空間物件之間的拓撲關係。然而，現有的編碼方法受到限制，因為它們通常是客製化來僅處理特定類型的空間資料，這阻礙了它們在有多種資料類型並存的不同下游任務中的適用性。為了解決這個問題，我們引入了 Poly2Vec，這是一個編碼框架，統一了不同地理空間物件的建模，包括 2D 點、折線和多邊形，而與下游任務無關。我們利用 2D 傅立葉轉換的力量，從地理空間物件編碼有用的空間屬性，例如形狀和位置，轉換成固定長度的向量。然後將這些向量輸入到神經網路模型中，用於空間推理任務。這種統一的方法消除了為每個不同的空間類型開發和訓練單獨模型的需要。我們在混合幾何類型的合成和真實資料集上評估 Poly2Vec，並驗證了它在幾個下游空間推理任務中的一致效能。", "author": "Maria Despoina Siampou et.al.", "authors": "Maria Despoina Siampou, Jialiang Li, John Krumm, Cyrus Shahabi, Hua Lu", "id": "2408.14806v1", "paper_url": "http://arxiv.org/abs/2408.14806v1", "repo": "null"}}