{"2412.14063": {"publish_time": "2024-12-18", "title": "Rango: Adaptive Retrieval-Augmented Proving for Automated Software Verification", "paper_summary": "Formal verification using proof assistants, such as Coq, enables the creation\nof high-quality software. However, the verification process requires\nsignificant expertise and manual effort to write proofs. Recent work has\nexplored automating proof synthesis using machine learning and large language\nmodels (LLMs). This work has shown that identifying relevant premises, such as\nlemmas and definitions, can aid synthesis. We present Rango, a fully automated\nproof synthesis tool for Coq that automatically identifies relevant premises\nand also similar proofs from the current project and uses them during\nsynthesis. Rango uses retrieval augmentation at every step of the proof to\nautomatically determine which proofs and premises to include in the context of\nits fine-tuned LLM. In this way, Rango adapts to the project and to the\nevolving state of the proof. We create a new dataset, CoqStoq, of 2,226\nopen-source Coq projects and 196,929 theorems from GitHub, which includes both\ntraining data and a curated evaluation benchmark of well-maintained projects.\nOn this benchmark, Rango synthesizes proofs for 32.0% of the theorems, which is\n29% more theorems than the prior state-of-the-art tool Tactician. Our\nevaluation also shows that Rango adding relevant proofs to its context leads to\na 47% increase in the number of theorems proven.", "paper_summary_zh": "使用 Coq 等證明助理進行形式驗證，可以建立高品質的軟體。然而，驗證過程需要相當的專業知識和手動撰寫證明的手工工作。最近的研究已探討使用機器學習和大型語言模型 (LLM) 自動化證明合成。這項研究顯示，識別相關的前提，例如引理和定義，有助於合成。我們提出 Rango，一個完全自動化的 Coq 證明合成工具，它會自動識別相關的前提，以及來自目前專案的類似證明，並在合成期間使用它們。Rango 在證明的每個步驟中使用檢索擴充，以自動決定在微調 LLM 的背景下要包含哪些證明和前提。藉此方式，Rango 適應專案和證明的演化狀態。我們建立了一個新的資料集 CoqStoq，包含 2,226 個開源 Coq 專案和來自 GitHub 的 196,929 個定理，其中包括訓練資料和維護良好的專案的精選評估基準。在此基準上，Rango 為 32.0% 的定理合成證明，比先前的最新工具 Tactician 多出 29% 的定理。我們的評估也顯示，Rango 將相關證明新增到其背景中，會讓已證明定理的數量增加 47%。", "author": "Kyle Thompson et.al.", "authors": "Kyle Thompson, Nuno Saavedra, Pedro Carrott, Kevin Fisher, Alex Sanchez-Stern, Yuriy Brun, João F. Ferreira, Sorin Lerner, Emily First", "id": "2412.14063v1", "paper_url": "http://arxiv.org/abs/2412.14063v1", "repo": "null"}}