{"2501.01679": {"publish_time": "2025-01-03", "title": "Adaptive Few-shot Prompting for Machine Translation with Pre-trained Language Models", "paper_summary": "Recently, Large language models (LLMs) with in-context learning have\ndemonstrated remarkable potential in handling neural machine translation.\nHowever, existing evidence shows that LLMs are prompt-sensitive and it is\nsub-optimal to apply the fixed prompt to any input for downstream machine\ntranslation tasks. To address this issue, we propose an adaptive few-shot\nprompting (AFSP) framework to automatically select suitable translation\ndemonstrations for various source input sentences to further elicit the\ntranslation capability of an LLM for better machine translation. First, we\nbuild a translation demonstration retrieval module based on LLM's embedding to\nretrieve top-k semantic-similar translation demonstrations from aligned\nparallel translation corpus. Rather than using other embedding models for\nsemantic demonstration retrieval, we build a hybrid demonstration retrieval\nmodule based on the embedding layer of the deployed LLM to build better input\nrepresentation for retrieving more semantic-related translation demonstrations.\nThen, to ensure better semantic consistency between source inputs and target\noutputs, we force the deployed LLM itself to generate multiple output\ncandidates in the target language with the help of translation demonstrations\nand rerank these candidates. Besides, to better evaluate the effectiveness of\nour AFSP framework on the latest language and extend the research boundary of\nneural machine translation, we construct a high-quality diplomatic\nChinese-English parallel dataset that consists of 5,528 parallel\nChinese-English sentences. Finally, extensive experiments on the proposed\ndiplomatic Chinese-English parallel dataset and the United Nations Parallel\nCorpus (Chinese-English part) show the effectiveness and superiority of our\nproposed AFSP.", "paper_summary_zh": "<paragraph>最近，具有情境学习功能的大型语言模型 (LLM) 在处理神经机器翻译方面展现出了非凡的潜力。然而，现有证据表明，LLM 对提示语很敏感，将固定的提示语应用于下游机器翻译任务并不是最优的。为了解决这个问题，我们提出了一种自适应少样本提示 (AFSP) 框架，用于自动为各种源输入句子选择合适的翻译示例，以进一步激发 LLM 的翻译能力，从而实现更好的机器翻译。首先，我们基于 LLM 的嵌入构建了一个翻译示例检索模块，从对齐的平行翻译语料库中检索前 k 个语义相似的翻译示例。我们并没有使用其他嵌入模型进行语义示例检索，而是基于已部署 LLM 的嵌入层构建了一个混合示例检索模块，以构建更好的输入表示，用于检索更多语义相关的翻译示例。然后，为了确保源输入和目标输出之间更好的语义一致性，我们强制已部署的 LLM 本身在翻译示例的帮助下生成多种目标语言的输出候选，并对这些候选进行重新排序。此外，为了更好地评估我们的 AFSP 框架在最新语言上的有效性，并扩展神经机器翻译的研究边界，我们构建了一个高质量的外交汉英平行数据集，其中包含 5,528 个平行的汉英句子。最后，在所提出的外交汉英平行数据集和联合国平行语料库（汉英部分）上进行的广泛实验表明了我们提出的 AFSP 的有效性和优越性。</paragraph>", "author": "Lei Tang et.al.", "authors": "Lei Tang, Jinghui Qin, Wenxuan Ye, Hao Tan, Zhijing Yang", "id": "2501.01679v1", "paper_url": "http://arxiv.org/abs/2501.01679v1", "repo": "null"}}