{"2410.02748": {"publish_time": "2024-10-03", "title": "CriSPO: Multi-Aspect Critique-Suggestion-guided Automatic Prompt Optimization for Text Generation", "paper_summary": "Large language models (LLMs) can generate fluent summaries across domains\nusing prompting techniques, reducing the need to train models for summarization\napplications. However, crafting effective prompts that guide LLMs to generate\nsummaries with the appropriate level of detail and writing style remains a\nchallenge. In this paper, we explore the use of salient information extracted\nfrom the source document to enhance summarization prompts. We show that adding\nkeyphrases in prompts can improve ROUGE F1 and recall, making the generated\nsummaries more similar to the reference and more complete. The number of\nkeyphrases can control the precision-recall trade-off. Furthermore, our\nanalysis reveals that incorporating phrase-level salient information is\nsuperior to word- or sentence-level. However, the impact on hallucination is\nnot universally positive across LLMs. To conduct this analysis, we introduce\nKeyphrase Signal Extractor (CriSPO), a lightweight model that can be finetuned\nto extract salient keyphrases. By using CriSPO, we achieve consistent ROUGE\nimprovements across datasets and open-weight and proprietary LLMs without any\nLLM customization. Our findings provide insights into leveraging salient\ninformation in building prompt-based summarization systems.", "paper_summary_zh": "大型語言模型 (LLM) 可以使用提示技術跨領域生成流利的摘要，減少訓練模型以進行摘要應用程式的需求。然而，製作出有效的提示以引導 LLM 生成具有適當詳細程度和寫作風格的摘要仍然是一項挑戰。在本文中，我們探討了使用從原始文件提取的顯著資訊來增強摘要提示的用途。我們表明，在提示中加入關鍵字組可以改善 ROUGE F1 和召回率，使生成的摘要更類似於參考摘要且更完整。關鍵字組的數量可以控制精確度召回率權衡。此外，我們的分析表明，納入片語層級的顯著資訊優於詞彙或句子層級。然而，對幻覺的影響並非普遍對所有 LLM 都是正面的。為了進行此分析，我們引入了關鍵字組訊號提取器 (CriSPO)，這是一個可以微調以提取顯著關鍵字組的輕量級模型。透過使用 CriSPO，我們在沒有任何 LLM 自訂化的情況下，在資料集和開放權重與專有 LLM 中實現了一致的 ROUGE 改進。我們的研究結果提供了見解，說明如何利用顯著資訊來建構基於提示的摘要系統。", "author": "Han He et.al.", "authors": "Han He, Qianchu Liu, Lei Xu, Chaitanya Shivade, Yi Zhang, Sundararajan Srinivasan, Katrin Kirchhoff", "id": "2410.02748v1", "paper_url": "http://arxiv.org/abs/2410.02748v1", "repo": "null"}}