{"2410.10786": {"publish_time": "2024-10-14", "title": "On Information-Theoretic Measures of Predictive Uncertainty", "paper_summary": "Reliable estimation of predictive uncertainty is crucial for machine learning\napplications, particularly in high-stakes scenarios where hedging against risks\nis essential. Despite its significance, a consensus on the correct measurement\nof predictive uncertainty remains elusive. In this work, we return to first\nprinciples to develop a fundamental framework of information-theoretic\npredictive uncertainty measures. Our proposed framework categorizes predictive\nuncertainty measures according to two factors: (I) The predicting model (II)\nThe approximation of the true predictive distribution. Examining all possible\ncombinations of these two factors, we derive a set of predictive uncertainty\nmeasures that includes both known and newly introduced ones. We empirically\nevaluate these measures in typical uncertainty estimation settings, such as\nmisclassification detection, selective prediction, and out-of-distribution\ndetection. The results show that no single measure is universal, but the\neffectiveness depends on the specific setting. Thus, our work provides clarity\nabout the suitability of predictive uncertainty measures by clarifying their\nimplicit assumptions and relationships.", "paper_summary_zh": "可靠的預測不確定性估計對於機器學習應用至關重要，特別是在對沖風險至關重要的關鍵情境中。儘管其意義重大，但對於預測不確定性的正確測量方法仍未達成共識。在這項工作中，我們回歸第一原理，以開發資訊理論預測不確定性測量基準的基礎架構。我們提出的架構根據兩個因素將預測不確定性測量基準分類：(I) 預測模型 (II) 真實預測分佈的近似值。透過檢驗這兩個因素的所有可能組合，我們推導出一組預測不確定性測量基準，其中包括已知和新引入的測量基準。我們在典型的預測不確定性估計設定中，例如錯誤分類偵測、選擇性預測和異常偵測，對這些測量基準進行經驗評估。結果顯示，沒有單一測量基準具有通用性，但其有效性取決於特定設定。因此，我們的研究透過釐清預測不確定性測量基準的隱含假設和關係，明確了其適用性。", "author": "Kajetan Schweighofer et.al.", "authors": "Kajetan Schweighofer, Lukas Aichberger, Mykyta Ielanskyi, Sepp Hochreiter", "id": "2410.10786v1", "paper_url": "http://arxiv.org/abs/2410.10786v1", "repo": "https://github.com/ml-jku/uncertainty-measures"}}