{"2410.07041": {"publish_time": "2024-10-09", "title": "Emergent properties with repeated examples", "paper_summary": "We study the performance of transformers as a function of the number of\nrepetitions of training examples with algorithmically generated datasets. On\nthree problems of mathematics: the greatest common divisor, modular\nmultiplication, and matrix eigenvalues, we show that for a fixed number of\ntraining steps, models trained on smaller sets of repeated examples outperform\nmodels trained on larger sets of single-use examples. We also demonstrate that\ntwo-set training - repeated use of a small random subset of examples, along\nnormal sampling on the rest of the training set - provides for faster learning\nand better performance. This highlights that the benefits of repetition can\noutweigh those of data diversity. These datasets and problems provide a\ncontrolled setting to shed light on the still poorly understood interplay\nbetween generalization and memorization in deep learning.", "paper_summary_zh": "我們研究了Transformer在演算法生成的資料集訓練範例重複次數的函數效能。在三個數學問題中：最大公因數、模乘法和矩陣特徵值，我們顯示對於固定次數的訓練步驟，在較小組重複範例上訓練的模型優於在較大組單次使用範例上訓練的模型。我們也展示了兩組訓練 - 重複使用範例的小隨機子集，以及在訓練集的其餘部分進行常態抽樣 - 提供了更快的學習和更好的效能。這突顯了重複的好處可能超過資料多樣性的好處。這些資料集和問題提供了一個受控的設定，可以闡明深度學習中概括和記憶之間仍然知之甚少的交互作用。", "author": "François Charton et.al.", "authors": "François Charton, Julia Kempe", "id": "2410.07041v1", "paper_url": "http://arxiv.org/abs/2410.07041v1", "repo": "null"}}