{"2411.15115": {"publish_time": "2024-11-22", "title": "VideoRepair: Improving Text-to-Video Generation via Misalignment Evaluation and Localized Refinement", "paper_summary": "Recent text-to-video (T2V) diffusion models have demonstrated impressive\ngeneration capabilities across various domains. However, these models often\ngenerate videos that have misalignments with text prompts, especially when the\nprompts describe complex scenes with multiple objects and attributes. To\naddress this, we introduce VideoRepair, a novel model-agnostic, training-free\nvideo refinement framework that automatically identifies fine-grained\ntext-video misalignments and generates explicit spatial and textual feedback,\nenabling a T2V diffusion model to perform targeted, localized refinements.\nVideoRepair consists of four stages: In (1) video evaluation, we detect\nmisalignments by generating fine-grained evaluation questions and answering\nthose questions with MLLM. In (2) refinement planning, we identify accurately\ngenerated objects and then create localized prompts to refine other areas in\nthe video. Next, in (3) region decomposition, we segment the correctly\ngenerated area using a combined grounding module. We regenerate the video by\nadjusting the misaligned regions while preserving the correct regions in (4)\nlocalized refinement. On two popular video generation benchmarks (EvalCrafter\nand T2V-CompBench), VideoRepair substantially outperforms recent baselines\nacross various text-video alignment metrics. We provide a comprehensive\nanalysis of VideoRepair components and qualitative examples.", "paper_summary_zh": "最近的文字轉影片 (T2V) 擴散模型已展示出跨各種領域的令人印象深刻的生成能力。然而，這些模型經常會產生與文字提示不一致的影片，特別是在提示描述具有多個物件和屬性的複雜場景時。為了解決這個問題，我們引入了 VideoRepair，一種新穎的與模型無關、無需訓練的影片精煉架構，它會自動識別細微的文字影片不一致之處，並產生明確的空間和文字回饋，讓 T2V 擴散模型執行有針對性的局部精煉。VideoRepair 包含四個階段：在 (1) 影片評估中，我們透過產生細微的評估問題並使用 MLLM 回答這些問題來偵測不一致之處。在 (2) 精煉規劃中，我們識別準確生成的物件，然後建立局部提示來精煉影片中的其他區域。接著，在 (3) 區域分解中，我們使用結合接地模組來區隔正確生成的區域。我們在 (4) 局部精煉中調整不一致的區域，同時保留正確的區域，藉此重新產生影片。在兩個流行的影片生成基準 (EvalCrafter 和 T2V-CompBench) 上，VideoRepair 在各種文字影片對齊指標方面都大幅優於最近的基準。我們提供了 VideoRepair 組成部分的全面分析和定性範例。", "author": "Daeun Lee et.al.", "authors": "Daeun Lee, Jaehong Yoon, Jaemin Cho, Mohit Bansal", "id": "2411.15115v1", "paper_url": "http://arxiv.org/abs/2411.15115v1", "repo": "null"}}