{"2410.22888": {"publish_time": "2024-10-30", "title": "Effective and Efficient Adversarial Detection for Vision-Language Models via A Single Vector", "paper_summary": "Visual Language Models (VLMs) are vulnerable to adversarial attacks,\nespecially those from adversarial images, which is however under-explored in\nliterature. To facilitate research on this critical safety problem, we first\nconstruct a new laRge-scale Adervsarial images dataset with Diverse hArmful\nResponses (RADAR), given that existing datasets are either small-scale or only\ncontain limited types of harmful responses. With the new RADAR dataset, we\nfurther develop a novel and effective iN-time Embedding-based AdveRSarial Image\nDEtection (NEARSIDE) method, which exploits a single vector that distilled from\nthe hidden states of VLMs, which we call the attacking direction, to achieve\nthe detection of adversarial images against benign ones in the input. Extensive\nexperiments with two victim VLMs, LLaVA and MiniGPT-4, well demonstrate the\neffectiveness, efficiency, and cross-model transferrability of our proposed\nmethod. Our code is available at https://github.com/mob-scu/RADAR-NEARSIDE", "paper_summary_zh": "視覺語言模型 (VLM) 容易受到對抗性攻擊，特別是來自對抗性影像的攻擊，而這在文獻中卻鮮少探討。為了促進對這個關鍵安全問題的研究，我們首先建構了一個新的具備多樣化有害回應的大規模對抗性影像資料集 (RADAR)，因為現有的資料集規模過小或僅包含有限類型的有害回應。有了新的 RADAR 資料集，我們進一步開發了一種新穎且有效的即時嵌入式對抗性影像偵測 (NEARSIDE) 方法，它利用從 VLM 的隱藏狀態中萃取出的單一向量（我們稱之為攻擊方向）來偵測輸入中的對抗性影像和良性影像。使用兩個受害者 VLM（LLaVA 和 MiniGPT-4）進行的廣泛實驗充分證明了我們所提出的方法的有效性、效率和跨模型可傳遞性。我們的程式碼可於 https://github.com/mob-scu/RADAR-NEARSIDE 取得", "author": "Youcheng Huang et.al.", "authors": "Youcheng Huang, Fengbin Zhu, Jingkun Tang, Pan Zhou, Wenqiang Lei, Jiancheng Lv, Tat-Seng Chua", "id": "2410.22888v1", "paper_url": "http://arxiv.org/abs/2410.22888v1", "repo": "https://github.com/mob-scu/radar-nearside"}}