{"2405.20838": {"publish_time": "2024-05-31", "title": "einspace: Searching for Neural Architectures from Fundamental Operations", "paper_summary": "Neural architecture search (NAS) finds high performing networks for a given\ntask. Yet the results of NAS are fairly prosaic; they did not e.g. create a\nshift from convolutional structures to transformers. This is not least because\nthe search spaces in NAS often aren't diverse enough to include such\ntransformations a priori. Instead, for NAS to provide greater potential for\nfundamental design shifts, we need a novel expressive search space design which\nis built from more fundamental operations. To this end, we introduce einspace,\na search space based on a parameterised probabilistic context-free grammar. Our\nspace is versatile, supporting architectures of various sizes and complexities,\nwhile also containing diverse network operations which allow it to model\nconvolutions, attention components and more. It contains many existing\ncompetitive architectures, and provides flexibility for discovering new ones.\nUsing this search space, we perform experiments to find novel architectures as\nwell as improvements on existing ones on the diverse Unseen NAS datasets. We\nshow that competitive architectures can be obtained by searching from scratch,\nand we consistently find large improvements when initialising the search with\nstrong baselines. We believe that this work is an important advancement towards\na transformative NAS paradigm where search space expressivity and strategic\nsearch initialisation play key roles.", "paper_summary_zh": "神經結構搜尋 (NAS) 尋找給定任務的高效能網路。然而，NAS 的結果相當平淡；例如，它們並未從捲積結構轉移到Transformer。這主要是因為 NAS 中的搜尋空間通常不夠多元，無法先驗包含此類轉換。相反地，為了讓 NAS 提供更大的基本設計轉變潛力，我們需要一個新穎且具表達力的搜尋空間設計，而此設計是建立在更基本的運算上。為此，我們引入了 einspace，一個基於參數化機率無上下文文法的搜尋空間。我們的空間具有多功能性，支援各種大小和複雜性的架構，同時也包含多元的網路運算，使其能夠建模卷積、注意力元件等。它包含許多現有的競爭性架構，並提供彈性來發現新的架構。使用此搜尋空間，我們執行實驗以尋找新穎的架構，以及在多元的 Unseen NAS 資料集上對現有架構進行改進。我們展示了可透過從頭開始搜尋來取得競爭性架構，並且在使用強大的基準初始化搜尋時，我們持續發現大幅的改進。我們相信這項工作是邁向轉型 NAS 典範的重要進展，其中搜尋空間的表達力和策略性搜尋初始化扮演了關鍵角色。", "author": "Linus Ericsson et.al.", "authors": "Linus Ericsson, Miguel Espinosa, Chenhongyi Yang, Antreas Antoniou, Amos Storkey, Shay B. Cohen, Steven McDonagh, Elliot J. Crowley", "id": "2405.20838v1", "paper_url": "http://arxiv.org/abs/2405.20838v1", "repo": "https://github.com/linusericsson/einspace"}}