{"2412.03987": {"publish_time": "2024-12-05", "title": "MTMT: Consolidating Multiple Thinking Modes to Form a Thought Tree for Strengthening LLM", "paper_summary": "Large language models (LLMs) have shown limitations in tasks requiring\ncomplex logical reasoning and multi-step problem-solving. To address these\nchallenges, researchers have employed carefully designed prompts and\nflowcharts, simulating human cognitive processes to enhance LLM performance,\nsuch as the Chain of Thought approach. In this paper, we introduce MTMT\n(Multi-thinking Modes Tree), a novel method that interacts with LLMs to\nconstruct a thought tree, simulating various advanced cognitive processes,\nincluding but not limited to association, counterfactual thinking, task\ndecomposition, and comparison. By breaking down the original complex task into\nsimpler sub-questions, MTMT facilitates easier problem-solving for LLMs,\nenabling more effective utilization of the latent knowledge within LLMs. We\nevaluate the performance of MTMT under different parameter configurations,\nusing GPT-4o mini as the base model. Our results demonstrate that integrating\nmultiple modes of thinking significantly enhances the ability of LLMs to handle\ncomplex tasks.", "paper_summary_zh": "大型語言模型 (LLM) 在需要複雜邏輯推理和多步驟問題解決能力的任務中表現出限制。為了應對這些挑戰，研究人員採用精心設計的提示和流程圖，模擬人類認知過程以增強 LLM 的效能，例如思考鏈方法。在本文中，我們介紹了 MTMT（多思考模式樹），這是一種與 LLM 互動以建構思考樹的新方法，模擬各種先進的認知過程，包括但不限於聯想、反事實思考、任務分解和比較。通過將原本複雜的任務分解成更簡單的子問題，MTMT 促進 LLM 更容易解決問題，讓 LLM 能更有效地利用其潛在知識。我們使用 GPT-4o mini 作為基礎模型，評估 MTMT 在不同參數配置下的效能。我們的結果表明，整合多種思考模式顯著增強了 LLM 處理複雜任務的能力。", "author": "Changcheng Li et.al.", "authors": "Changcheng Li, Xiangyu Wang, Qiuju Chen, Xiren Zhou, Huanhuan Chen", "id": "2412.03987v1", "paper_url": "http://arxiv.org/abs/2412.03987v1", "repo": "null"}}