{"2411.19758": {"publish_time": "2024-11-29", "title": "LaVIDE: A Language-Vision Discriminator for Detecting Changes in Satellite Image with Map References", "paper_summary": "Change detection, which typically relies on the comparison of bi-temporal\nimages, is significantly hindered when only a single image is available.\nComparing a single image with an existing map, such as OpenStreetMap, which is\ncontinuously updated through crowd-sourcing, offers a viable solution to this\nchallenge. Unlike images that carry low-level visual details of ground objects,\nmaps convey high-level categorical information. This discrepancy in abstraction\nlevels complicates the alignment and comparison of the two data types. In this\npaper, we propose a \\textbf{La}nguage-\\textbf{VI}sion \\textbf{D}iscriminator\nfor d\\textbf{E}tecting changes in satellite image with map references, namely\n\\ours{}, which leverages language to bridge the information gap between maps\nand images. Specifically, \\ours{} formulates change detection as the problem of\n``{\\textit Does the pixel belong to [class]?}'', aligning maps and images\nwithin the feature space of the language-vision model to associate high-level\nmap categories with low-level image details. Moreover, we build a\nmixture-of-experts discriminative module, which compares linguistic features\nfrom maps with visual features from images across various semantic\nperspectives, achieving comprehensive semantic comparison for change detection.\nExtensive evaluation on four benchmark datasets demonstrates that \\ours{} can\neffectively detect changes in satellite image with map references,\noutperforming state-of-the-art change detection algorithms, e.g., with gains of\nabout $13.8$\\% on the DynamicEarthNet dataset and $4.3$\\% on the SECOND\ndataset.", "paper_summary_zh": "<paragraph>變異偵測通常依賴於雙時態影像的比較，但當只有一張影像可用時，會受到顯著的阻礙。將單一影像與現有地圖（例如透過群眾外包持續更新的 OpenStreetMap）進行比較，為此挑戰提供了可行的解決方案。與承載地面物件低階視覺細節的影像不同，地圖傳達的是高階類別資訊。抽象層級的這種差異，使得兩種資料類型的對齊和比較變得複雜。在本文中，我們提出一個用於偵測衛星影像中變異的語言視覺辨別器，並使用地圖參考，即 \\ours{}，它利用語言來彌合地圖與影像之間的資訊差距。具體來說，\\ours{} 將變異偵測制定為「像素是否屬於 [類別]？」的問題，在語言視覺模型的特徵空間內對齊地圖和影像，以將高階地圖類別與低階影像細節關聯起來。此外，我們建立了一個專家混合辨別模組，它比較來自地圖的語言特徵與來自影像的視覺特徵，涵蓋各種語義觀點，實現全面的語義比較以進行變異偵測。在四個基準資料集上的廣泛評估表明，\\ours{} 可以有效偵測衛星影像中具有地圖參考的變異，優於最先進的變異偵測演算法，例如在 DynamicEarthNet 資料集上獲得約 13.8% 的增益，在 SECOND 資料集上獲得 4.3% 的增益。</paragraph>", "author": "Shuguo Jiang et.al.", "authors": "Shuguo Jiang, Fang Xu, Sen Jia, Gui-Song Xia", "id": "2411.19758v1", "paper_url": "http://arxiv.org/abs/2411.19758v1", "repo": "null"}}