{"2409.20048": {"publish_time": "2024-09-30", "title": "Depression detection in social media posts using transformer-based models and auxiliary features", "paper_summary": "The detection of depression in social media posts is crucial due to the\nincreasing prevalence of mental health issues. Traditional machine learning\nalgorithms often fail to capture intricate textual patterns, limiting their\neffectiveness in identifying depression. Existing studies have explored various\napproaches to this problem but often fall short in terms of accuracy and\nrobustness. To address these limitations, this research proposes a neural\nnetwork architecture leveraging transformer-based models combined with metadata\nand linguistic markers. The study employs DistilBERT, extracting information\nfrom the last four layers of the transformer, applying learned weights, and\naveraging them to create a rich representation of the input text. This\nrepresentation, augmented by metadata and linguistic markers, enhances the\nmodel's comprehension of each post. Dropout layers prevent overfitting, and a\nMultilayer Perceptron (MLP) is used for final classification. Data augmentation\ntechniques, inspired by the Easy Data Augmentation (EDA) methods, are also\nemployed to improve model performance. Using BERT, random insertion and\nsubstitution of phrases generate additional training data, focusing on\nbalancing the dataset by augmenting underrepresented classes. The proposed\nmodel achieves weighted Precision, Recall, and F1-scores of 84.26%, 84.18%, and\n84.15%, respectively. The augmentation techniques significantly enhance model\nperformance, increasing the weighted F1-score from 72.59% to 84.15%.", "paper_summary_zh": "由於心理健康問題的盛行，在社群媒體貼文中偵測憂鬱症至關重要。傳統機器學習演算法經常無法捕捉複雜的文字模式，限制了它們在辨識憂鬱症上的效能。現有的研究探索了各種解決此問題的方法，但往往在準確度和穩健性方面有所不足。為了解決這些限制，本研究提出了一種神經網路架構，它利用了基於轉換器的模型，並結合了元資料和語言標記。本研究採用 DistilBERT，從轉換器的最後四層提取資訊，套用學習到的權重，並將它們平均以建立輸入文字的豐富表徵。此表徵由元資料和語言標記增強，增強了模型對每則貼文的理解。中斷層防止過度擬合，並使用多層感知器 (MLP) 進行最終分類。資料擴充技術（受簡易資料擴充 (EDA) 方法啟發）也用於改善模型效能。使用 BERT，隨機插入和替換片語會產生額外的訓練資料，重點在透過擴充代表性不足的類別來平衡資料集。所提出的模型分別達到了加權準確率、召回率和 F1 分數 84.26%、84.18% 和 84.15%。擴充技術顯著提升了模型效能，將加權 F1 分數從 72.59% 提升至 84.15%。", "author": "Marios Kerasiotis et.al.", "authors": "Marios Kerasiotis, Loukas Ilias, Dimitris Askounis", "id": "2409.20048v1", "paper_url": "http://arxiv.org/abs/2409.20048v1", "repo": "null"}}