{"2410.01985": {"publish_time": "2024-10-02", "title": "Lost-in-Distance: Impact of Contextual Proximity on LLM Performance in Graph Tasks", "paper_summary": "Despite significant advancements, Large Language Models (LLMs) exhibit blind\nspots that impair their ability to retrieve and process relevant contextual\ndata effectively. We demonstrate that LLM performance in graph tasks with\ncomplexities beyond the \"needle-in-a-haystack\" scenario-where solving the\nproblem requires cross-referencing and reasoning across multiple subproblems\njointly-is influenced by the proximity of relevant information within the\ncontext, a phenomenon we term \"lost-in-distance\". We examine two fundamental\ngraph tasks: identifying common connections between two nodes and assessing\nsimilarity among three nodes, and show that the model's performance in these\ntasks significantly depends on the relative positioning of common edges. We\nevaluate three publicly available LLMs-Llama-3-8B, Llama-3-70B, and GPT-4-using\nvarious graph encoding techniques that represent graph structures for LLM\ninput. We propose a formulation for the lost-in-distance phenomenon and\ndemonstrate that lost-in-distance and lost-in-the middle phenomenas occur\nindependently. Results indicate that model accuracy can decline by up to 6x as\nthe distance between node connections increases, independent of graph encoding\nand model size.", "paper_summary_zh": "儘管有顯著的進展，大型語言模型（LLM）仍存在盲點，會損害它們有效擷取和處理相關脈絡資料的能力。我們證明了 LLM 在圖形任務中的表現，其複雜度超出了「大海撈針」情境，其中解決問題需要跨多個子問題進行交叉參照和推理，並受到脈絡中相關資訊的接近程度影響，我們將此現象稱為「失之距離」。我們檢驗了兩個基本的圖形任務：識別兩個節點之間的共同連接，以及評估三個節點之間的相似性，並顯示模型在這些任務中的表現顯著地取決於共同邊緣的相對位置。我們評估了三個公開可用的 LLM，分別為 Llama-3-8B、Llama-3-70B 和 GPT-4，使用各種圖形編碼技術，這些技術表示 LLM 輸入的圖形結構。我們提出了失之距離現象的公式，並證明了失之距離和失之於中間現象會獨立發生。結果表明，隨著節點連接之間的距離增加，模型準確度最多可能會下降 6 倍，與圖形編碼和模型大小無關。", "author": "Hamed Firooz et.al.", "authors": "Hamed Firooz, Maziar Sanjabi, Wenlong Jiang, Xiaoling Zhai", "id": "2410.01985v1", "paper_url": "http://arxiv.org/abs/2410.01985v1", "repo": "null"}}