{"2409.17684": {"publish_time": "2024-09-26", "title": "Preserving logical and functional dependencies in synthetic tabular data", "paper_summary": "Dependencies among attributes are a common aspect of tabular data. However,\nwhether existing tabular data generation algorithms preserve these dependencies\nwhile generating synthetic data is yet to be explored. In addition to the\nexisting notion of functional dependencies, we introduce the notion of logical\ndependencies among the attributes in this article. Moreover, we provide a\nmeasure to quantify logical dependencies among attributes in tabular data.\nUtilizing this measure, we compare several state-of-the-art synthetic data\ngeneration algorithms and test their capability to preserve logical and\nfunctional dependencies on several publicly available datasets. We demonstrate\nthat currently available synthetic tabular data generation algorithms do not\nfully preserve functional dependencies when they generate synthetic datasets.\nIn addition, we also showed that some tabular synthetic data generation models\ncan preserve inter-attribute logical dependencies. Our review and comparison of\nthe state-of-the-art reveal research needs and opportunities to develop\ntask-specific synthetic tabular data generation models.", "paper_summary_zh": "屬性之間的依存關係是表格資料的常見面向。然而，現有的表格資料生成演算法在生成合成資料時是否會保留這些依存關係，這一點尚未探討。除了現有的函數依存關係概念之外，我們在本文中引入了屬性之間的邏輯依存關係概念。此外，我們提供了一個衡量表格資料中屬性之間邏輯依存關係的指標。利用此指標，我們比較了幾種最先進的合成資料生成演算法，並測試它們在幾個公開可用的資料集上保留邏輯和函數依存關係的能力。我們證明，目前可用的合成表格資料生成演算法在生成合成資料集時並未完全保留函數依存關係。此外，我們還表明，某些表格合成資料生成模型可以保留屬性間的邏輯依存關係。我們對最先進技術的回顧和比較揭示了研究需求和機會，以開發特定任務的合成表格資料生成模型。", "author": "Chaithra Umesh et.al.", "authors": "Chaithra Umesh, Kristian Schultz, Manjunath Mahendra, Saparshi Bej, Olaf Wolkenhauer", "id": "2409.17684v1", "paper_url": "http://arxiv.org/abs/2409.17684v1", "repo": "https://github.com/chaithra-u/dependency_preservation"}}