{"2502.02508": {"publish_time": "2025-02-04", "title": "Satori: Reinforcement Learning with Chain-of-Action-Thought Enhances LLM Reasoning via Autoregressive Search", "paper_summary": "Large language models (LLMs) have demonstrated remarkable reasoning\ncapabilities across diverse domains. Recent studies have shown that increasing\ntest-time computation enhances LLMs' reasoning capabilities. This typically\ninvolves extensive sampling at inference time guided by an external LLM\nverifier, resulting in a two-player system. Despite external guidance, the\neffectiveness of this system demonstrates the potential of a single LLM to\ntackle complex tasks. Thus, we pose a new research problem: Can we internalize\nthe searching capabilities to fundamentally enhance the reasoning abilities of\na single LLM? This work explores an orthogonal direction focusing on\npost-training LLMs for autoregressive searching (i.e., an extended reasoning\nprocess with self-reflection and self-exploration of new strategies). To\nachieve this, we propose the Chain-of-Action-Thought (COAT) reasoning and a\ntwo-stage training paradigm: 1) a small-scale format tuning stage to\ninternalize the COAT reasoning format and 2) a large-scale self-improvement\nstage leveraging reinforcement learning. Our approach results in Satori, a 7B\nLLM trained on open-source models and data. Extensive empirical evaluations\ndemonstrate that Satori achieves state-of-the-art performance on mathematical\nreasoning benchmarks while exhibits strong generalization to out-of-domain\ntasks. Code, data, and models will be fully open-sourced.", "paper_summary_zh": "大型語言模型 (LLM) 已在不同領域展現出卓越的推理能力。最近的研究表明，增加測試時間的運算可以提升 LLM 的推理能力。這通常涉及在推論時間進行廣泛的抽樣，並由外部 LLM 驗證器指導，從而形成一個雙人系統。儘管有外部指導，但此系統的有效性證明了單一 LLM 處理複雜任務的潛力。因此，我們提出了一個新的研究問題：我們能將搜尋能力內部化，從而根本提升單一 LLM 的推理能力嗎？這項工作探索了一個正交的方向，專注於訓練後 LLM 進行自迴歸搜尋（即，一個擴展的推理過程，具有自我反省和自我探索新策略的能力）。為達成此目標，我們提出動作思想鏈 (COAT) 推理和一個兩階段訓練範例：1) 一個小規模格式調整階段，用於內部化 COAT 推理格式，以及 2) 一個利用強化學習的大規模自我提升階段。我們的做法造就了 Satori，一個在開源模型和資料上訓練的 7B LLM。廣泛的實證評估證明，Satori 在數學推理基準上達到了最先進的效能，同時在領域外任務中展現出強大的泛化能力。程式碼、資料和模型將完全開源。", "author": "Maohao Shen et.al.", "authors": "Maohao Shen, Guangtao Zeng, Zhenting Qi, Zhang-Wei Hong, Zhenfang Chen, Wei Lu, Gregory Wornell, Subhro Das, David Cox, Chuang Gan", "id": "2502.02508v1", "paper_url": "http://arxiv.org/abs/2502.02508v1", "repo": "null"}}