{"2502.13794": {"publish_time": "2025-02-19", "title": "LESA: Learnable LLM Layer Scaling-Up", "paper_summary": "Training Large Language Models (LLMs) from scratch requires immense\ncomputational resources, making it prohibitively expensive. Model scaling-up\noffers a promising solution by leveraging the parameters of smaller models to\ncreate larger ones. However, existing depth scaling-up methods rely on\nempirical heuristic rules for layer duplication, which result in poorer\ninitialization and slower convergence during continual pre-training. We propose\n\\textbf{LESA}, a novel learnable method for depth scaling-up. By concatenating\nparameters from each layer and applying Singular Value Decomposition, we\nuncover latent patterns between layers, suggesting that inter-layer parameters\ncan be learned. LESA uses a neural network to predict the parameters inserted\nbetween adjacent layers, enabling better initialization and faster training.\nExperiments show that LESA outperforms existing baselines, achieving superior\nperformance with less than half the computational cost during continual\npre-training. Extensive analyses demonstrate its effectiveness across different\nmodel sizes and tasks.", "paper_summary_zh": "從頭訓練大型語言模型 (LLM) 需要龐大的計算資源，這讓成本高得令人難以負擔。模型擴充提供了有希望的解決方案，透過利用較小模型的參數來建立較大的模型。然而，現有的深度擴充方法依賴於層疊制的經驗啟發式規則，這會導致在持續預訓練期間初始化較差且收斂較慢。我們提出 \\textbf{LESA}，一種用於深度擴充的新型可學習方法。透過串接來自每層的參數並應用奇異值分解，我們揭示了層之間的潛在模式，這表明可以學習層間參數。LESA 使用神經網路來預測插入相鄰層之間的參數，從而實現更好的初始化和更快的訓練。實驗表明，LESA 優於現有的基準，在持續預訓練期間以不到一半的計算成本實現了卓越的效能。廣泛的分析證明了其在不同模型大小和任務中的有效性。", "author": "Yifei Yang et.al.", "authors": "Yifei Yang, Zouying Cao, Xinbei Ma, Yao Yao, Libo Qin, Zhi Chen, Hai Zhao", "id": "2502.13794v1", "paper_url": "http://arxiv.org/abs/2502.13794v1", "repo": "null"}}