{"2412.04234": {"publish_time": "2024-12-05", "title": "DEIM: DETR with Improved Matching for Fast Convergence", "paper_summary": "We introduce DEIM, an innovative and efficient training framework designed to\naccelerate convergence in real-time object detection with Transformer-based\narchitectures (DETR). To mitigate the sparse supervision inherent in one-to-one\n(O2O) matching in DETR models, DEIM employs a Dense O2O matching strategy. This\napproach increases the number of positive samples per image by incorporating\nadditional targets, using standard data augmentation techniques. While Dense\nO2O matching speeds up convergence, it also introduces numerous low-quality\nmatches that could affect performance. To address this, we propose the\nMatchability-Aware Loss (MAL), a novel loss function that optimizes matches\nacross various quality levels, enhancing the effectiveness of Dense O2O.\nExtensive experiments on the COCO dataset validate the efficacy of DEIM. When\nintegrated with RT-DETR and D-FINE, it consistently boosts performance while\nreducing training time by 50%. Notably, paired with RT-DETRv2, DEIM achieves\n53.2% AP in a single day of training on an NVIDIA 4090 GPU. Additionally,\nDEIM-trained real-time models outperform leading real-time object detectors,\nwith DEIM-D-FINE-L and DEIM-D-FINE-X achieving 54.7% and 56.5% AP at 124 and 78\nFPS on an NVIDIA T4 GPU, respectively, without the need for additional data. We\nbelieve DEIM sets a new baseline for advancements in real-time object\ndetection. Our code and pre-trained models are available at\nhttps://github.com/ShihuaHuang95/DEIM.", "paper_summary_zh": "<paragraph>我們推出 DEIM，一個創新且高效的訓練架構，旨在加速基於 Transformer 的架構（DETR）的即時物件偵測中的收斂。為了減輕 DETR 模型中的一對一 (O2O) 匹配中固有的稀疏監督，DEIM 採用密集 O2O 匹配策略。此方法透過使用標準資料擴充技術，納入額外的目標，來增加每張影像中的正樣本數量。雖然密集 O2O 匹配加速了收斂，但它也引入了許多可能影響效能的低品質匹配。為了解決這個問題，我們提出了匹配感知損失 (MAL)，一種針對各種品質層級最佳化匹配的新損失函數，以增強密集 O2O 的效能。在 COCO 資料集上的廣泛實驗驗證了 DEIM 的效能。當與 RT-DETR 和 D-FINE 整合時，它持續提升效能，同時將訓練時間縮短 50%。值得注意的是，搭配 RT-DETRv2，DEIM 在 NVIDIA 4090 GPU 上訓練一天即可達到 53.2% 的 AP。此外，DEIM 訓練的即時模型優於領先的即時物件偵測器，其中 DEIM-D-FINE-L 和 DEIM-D-FINE-X 在 NVIDIA T4 GPU 上分別以 124 和 78 FPS 達到 54.7% 和 56.5% 的 AP，而無需額外資料。我們相信 DEIM 為即時物件偵測的進展設定了新的基準。我們的程式碼和預訓練模型可在 https://github.com/ShihuaHuang95/DEIM 取得。</paragraph>", "author": "Shihua Huang et.al.", "authors": "Shihua Huang, Zhichao Lu, Xiaodong Cun, Yongjun Yu, Xiao Zhou, Xi Shen", "id": "2412.04234v1", "paper_url": "http://arxiv.org/abs/2412.04234v1", "repo": "null"}}