{"2406.09900": {"publish_time": "2024-06-14", "title": "GEB-1.3B: Open Lightweight Large Language Model", "paper_summary": "Recently developed large language models (LLMs) such as ChatGPT, Claude, and\nLlama have demonstrated impressive abilities, and even surpass human-level\nperformance in several tasks. Despite their success, the resource-intensive\ndemands of these models, requiring significant computational power for both\ntraining and inference, limit their deployment to high-performance servers.\nAdditionally, the extensive calculation requirements of the models often lead\nto increased latency in response times. With the increasing need for LLMs to\noperate efficiently on CPUs, research about lightweight models that are\noptimized for CPU inference has emerged. In this work, we introduce GEB-1.3B, a\nlightweight LLM trained on 550 billion tokens in both Chinese and English\nlanguages. We employ novel training techniques, including ROPE,\nGroup-Query-Attention, and FlashAttention-2, to accelerate training while\nmaintaining model performance. Additionally, we fine-tune the model using 10\nmillion samples of instruction data to enhance alignment. GEB-1.3B exhibits\noutstanding performance on general benchmarks such as MMLU, C-Eval, and CMMLU,\noutperforming comparative models such as MindLLM-1.3B and TinyLLaMA-1.1B.\nNotably, the FP32 version of GEB-1.3B achieves commendable inference times on\nCPUs, with ongoing efforts to further enhance speed through advanced\nquantization techniques. The release of GEB-1.3B as an open-source model marks\na significant contribution to the development of lightweight LLMs, promising to\nfoster further research and innovation in the field.", "paper_summary_zh": "近期開發的大語言模型（LLM），例如 ChatGPT、Claude 和 Llama，已展現出令人印象深刻的能力，甚至在多項任務中超越人類水準的表現。儘管這些模型很成功，但它們需要大量資源，在訓練和推理時都需要大量的運算能力，這限制了它們在高性能伺服器上的部署。此外，這些模型龐大的運算需求通常會導致回應時間延遲。由於 LLM 在 CPU 上高效運作的需求日益增加，因此針對 CPU 推論進行最佳化的輕量級模型的研究應運而生。在這項工作中，我們介紹了 GEB-1.3B，這是一個輕量級 LLM，使用 5500 億個中文和英文語言的字元進行訓練。我們採用創新的訓練技術，包括 ROPE、Group-Query-Attention 和 FlashAttention-2，以在維持模型效能的同時加速訓練。此外，我們使用 1000 萬個指令資料範本來微調模型，以增強對齊。GEB-1.3B 在 MMLU、C-Eval 和 CMMLU 等一般基準測試中展現出傑出的效能，優於 MindLLM-1.3B 和 TinyLLaMA-1.1B 等比較模型。值得注意的是，GEB-1.3B 的 FP32 版本在 CPU 上實現了值得讚賞的推論時間，我們正持續努力透過進階量化技術進一步提升速度。GEB-1.3B 作為一個開源模型的發布為輕量級 LLM 的發展做出了重大貢獻，有望促進該領域進一步的研究和創新。", "author": "Jie Wu et.al.", "authors": "Jie Wu, Yufeng Zhu, Lei Shen, Xuqing Lu", "id": "2406.09900v1", "paper_url": "http://arxiv.org/abs/2406.09900v1", "repo": "null"}}