{"2407.18421": {"publish_time": "2024-07-25", "title": "Self-Directed Synthetic Dialogues and Revisions Technical Report", "paper_summary": "Synthetic data has become an important tool in the fine-tuning of language\nmodels to follow instructions and solve complex problems. Nevertheless, the\nmajority of open data to date is often lacking multi-turn data and collected on\nclosed models, limiting progress on advancing open fine-tuning methods. We\nintroduce Self Directed Synthetic Dialogues (SDSD), an experimental dataset\nconsisting of guided conversations of language models talking to themselves.\nThe dataset consists of multi-turn conversations generated with DBRX, Llama 2\n70B, and Mistral Large, all instructed to follow a conversation plan generated\nprior to the conversation. We also explore including principles from\nConstitutional AI and other related works to create synthetic preference data\nvia revisions to the final conversation turn. We hope this work encourages\nfurther exploration in multi-turn data and the use of open models for expanding\nthe impact of synthetic data.", "paper_summary_zh": "合成資料已成為微調語言模型以遵循指示和解決複雜問題的重要工具。儘管如此，迄今為止的大部分開放資料通常缺乏多輪資料，且是在封閉模型上收集的，這限制了開放式微調方法的進展。我們介紹了自導式合成對話 (SDSD)，這是一個實驗性資料集，包含語言模型與自己對話的引導式對話。該資料集包含使用 DBRX、Llama 2 70B 和 Mistral Large 生成的多輪對話，所有對話均遵循在對話之前生成的對話計畫。我們還探討了將憲法 AI 和其他相關工作的原則納入其中，以透過修改最終對話回合來建立合成偏好資料。我們希望這項工作能鼓勵進一步探索多輪資料，以及使用開放模型來擴大合成資料的影響力。", "author": "Nathan Lambert et.al.", "authors": "Nathan Lambert, Hailey Schoelkopf, Aaron Gokaslan, Luca Soldaini, Valentina Pyatkin, Louis Castricato", "id": "2407.18421v1", "paper_url": "http://arxiv.org/abs/2407.18421v1", "repo": "null"}}