{"2407.11489": {"publish_time": "2024-07-16", "title": "A Meta-Learning Approach for Multi-Objective Reinforcement Learning in Sustainable Home Environments", "paper_summary": "Effective residential appliance scheduling is crucial for sustainable living.\nWhile multi-objective reinforcement learning (MORL) has proven effective in\nbalancing user preferences in appliance scheduling, traditional MORL struggles\nwith limited data in non-stationary residential settings characterized by\nrenewable generation variations. Significant context shifts that can invalidate\npreviously learned policies. To address these challenges, we extend\nstate-of-the-art MORL algorithms with the meta-learning paradigm, enabling\nrapid, few-shot adaptation to shifting contexts. Additionally, we employ an\nauto-encoder (AE)-based unsupervised method to detect environment context\nchanges. We have also developed a residential energy environment to evaluate\nour method using real-world data from London residential settings. This study\nnot only assesses the application of MORL in residential appliance scheduling\nbut also underscores the effectiveness of meta-learning in energy management.\nOur top-performing method significantly surpasses the best baseline, while the\ntrained model saves 3.28% on electricity bills, a 2.74% increase in user\ncomfort, and a 5.9% improvement in expected utility. Additionally, it reduces\nthe sparsity of solutions by 62.44%. Remarkably, these gains were accomplished\nusing 96.71% less training data and 61.1% fewer training steps.", "paper_summary_zh": "有效住宅設備排程對於永續生活至關重要。\n雖然多目標增強學習 (MORL) 已被證明能有效平衡設備排程中的使用者偏好，但傳統 MORL 在以再生能源變化為特徵的非靜止住宅環境中，會因資料有限而遇到困難。重大的情境轉變可能會使先前學習的政策失效。為了應對這些挑戰，我們使用元學習範例來擴充最先進的 MORL 演算法，實現快速、少量適應變化的情境。此外，我們採用基於自動編碼器 (AE) 的非監督式方法來偵測環境情境變化。我們還開發了一個住宅能源環境，使用來自倫敦住宅環境的真實世界資料來評估我們的做法。本研究不僅評估 MORL 在住宅設備排程中的應用，也強調了元學習在能源管理中的有效性。我們效能最佳的方法顯著超越最佳基準，而訓練後的模型可節省 3.28% 的電費、使用者舒適度提高 2.74%，預期效用改善 5.9%。此外，它還將解的稀疏性降低了 62.44%。值得注意的是，這些進展是使用少 96.71% 的訓練資料和少 61.1% 的訓練步驟所達成的。", "author": "Junlin Lu et.al.", "authors": "Junlin Lu, Patrick Mannion, Karl Mason", "id": "2407.11489v1", "paper_url": "http://arxiv.org/abs/2407.11489v1", "repo": "null"}}