{"2412.14965": {"publish_time": "2024-12-19", "title": "Movie2Story: A framework for understanding videos and telling stories in the form of novel text", "paper_summary": "Multimodal video-to-text models have made considerable progress, primarily in\ngenerating brief descriptions of video content. However, there is still a\ndeficiency in generating rich long-form text descriptions that integrate both\nvideo and audio. In this paper, we introduce a framework called M2S, designed\nto generate novel-length text by combining audio, video, and character\nrecognition. M2S includes modules for video long-form text description and\ncomprehension, audio-based analysis of emotion, speech rate, and character\nalignment, and visual-based character recognition alignment. By integrating\nmultimodal information using the large language model GPT4o, M2S stands out in\nthe field of multimodal text generation. We demonstrate the effectiveness and\naccuracy of M2S through comparative experiments and human evaluation.\nAdditionally, the model framework has good scalability and significant\npotential for future research.", "paper_summary_zh": "多模態影片轉文字模型已取得顯著進展，主要在於產生影片內容的簡短描述。然而，在產生整合視訊和音訊的豐富長篇文字描述方面，仍有不足之處。在本文中，我們介紹了一個名為 M2S 的架構，旨在透過結合音訊、視訊和角色識別來產生小說長度的文字。M2S 包含視訊長篇文字描述和理解、基於音訊的情緒分析、語速和角色對齊，以及基於視覺的角色識別對齊等模組。透過使用大型語言模型 GPT4o 整合多模態資訊，M2S 在多模態文字產生的領域中脫穎而出。我們透過比較實驗和人工評估，證明了 M2S 的有效性和準確性。此外，該模型架構具有良好的可擴充性，並對未來的研究具有顯著的潛力。", "author": "Kangning Li et.al.", "authors": "Kangning Li, Zheyang Jia, Anyu Ying", "id": "2412.14965v1", "paper_url": "http://arxiv.org/abs/2412.14965v1", "repo": "null"}}