{"2410.21014": {"publish_time": "2024-10-28", "title": "Informed Deep Abstaining Classifier: Investigating noise-robust training for diagnostic decision support systems", "paper_summary": "Image-based diagnostic decision support systems (DDSS) utilizing deep\nlearning have the potential to optimize clinical workflows. However, developing\nDDSS requires extensive datasets with expert annotations and is therefore\ncostly. Leveraging report contents from radiological data bases with Natural\nLanguage Processing to annotate the corresponding image data promises to\nreplace labor-intensive manual annotation. As mining \"real world\" databases can\nintroduce label noise, noise-robust training losses are of great interest.\nHowever, current noise-robust losses do not consider noise estimations that can\nfor example be derived based on the performance of the automatic label\ngenerator used. In this study, we expand the noise-robust Deep Abstaining\nClassifier (DAC) loss to an Informed Deep Abstaining Classifier (IDAC) loss by\nincorporating noise level estimations during training. Our findings demonstrate\nthat IDAC enhances the noise robustness compared to DAC and several\nstate-of-the-art loss functions. The results are obtained on various simulated\nnoise levels using a public chest X-ray data set. These findings are reproduced\non an in-house noisy data set, where labels were extracted from the clinical\nsystems of the University Hospital Bonn by a text-based transformer. The IDAC\ncan therefore be a valuable tool for researchers, companies or clinics aiming\nto develop accurate and reliable DDSS from routine clinical data.", "paper_summary_zh": "<paragraph>利用深度學習的影像診斷決策支援系統 (DDSS) 有可能最佳化臨床工作流程。然而，開發 DDSS 需要大量具備專家註解的資料集，因此成本高昂。利用自然語言處理從放射科資料庫的報告內容中標註對應的影像資料，有望取代勞力密集的手動標註。由於挖掘「真實世界」資料庫可能會引入標籤雜訊，因此對雜訊穩健的訓練損失非常重要。然而，目前對雜訊穩健的損失函數並未考慮雜訊估計，例如可以根據所使用的自動標籤產生器的效能推導出來。在本研究中，我們透過在訓練期間納入雜訊等級估計，將對雜訊穩健的深度棄權分類器 (DAC) 損失函數擴充為明智深度棄權分類器 (IDAC) 損失函數。我們的研究結果顯示，與 DAC 和多種最先進的損失函數相比，IDAC 增強了對雜訊的穩健性。這些結果是使用公開的胸部 X 光資料集，在各種模擬雜訊等級中獲得的。這些研究結果在內部雜訊資料集上重現，其中標籤是由文本轉換器從波恩大學醫院的臨床系統中萃取出來的。因此，IDAC 可以成為研究人員、公司或診所從例行臨床資料開發準確且可靠的 DDSS 的有價值工具。</paragraph>", "author": "Helen Schneider et.al.", "authors": "Helen Schneider, Sebastian Nowak, Aditya Parikh, Yannik C. Layer, Maike Theis, Wolfgang Block, Alois M. Sprinkart, Ulrike Attenberger, Rafet Sifa", "id": "2410.21014v1", "paper_url": "http://arxiv.org/abs/2410.21014v1", "repo": "null"}}