{"2406.11430": {"publish_time": "2024-06-17", "title": "A Simple and Effective $L_2$ Norm-Based Strategy for KV Cache Compression", "paper_summary": "The deployment of large language models (LLMs) is often hindered by the\nextensive memory requirements of the Key-Value (KV) cache, especially as\ncontext lengths increase. Existing approaches to reduce the KV cache size\ninvolve either fine-tuning the model to learn a compression strategy or\nleveraging attention scores to reduce the sequence length. We analyse the\nattention distributions in decoder-only Transformers-based models and observe\nthat attention allocation patterns stay consistent across most layers.\nSurprisingly, we find a clear correlation between the $L_2$ and the attention\nscores over cached KV pairs, where a low $L_2$ of a key embedding usually leads\nto a high attention score during decoding. This finding indicates that the\ninfluence of a KV pair is potentially determined by the key embedding itself\nbefore being queried. Based on this observation, we compress the KV cache based\non the $L_2$ of key embeddings. Our experimental results show that this simple\nstrategy can reduce the KV cache size by 50% on language modelling and\nneedle-in-a-haystack tasks and 90% on passkey retrieval tasks without losing\naccuracy.", "paper_summary_zh": "大型語言模型 (LLM) 的部署通常受到 Key-Value (KV) 快取廣泛的記憶體需求所阻礙，特別是在脈絡長度增加時。現有的減少 KV 快取大小的方法包括微調模型以學習壓縮策略或利用注意力分數來減少序列長度。我們分析了僅解碼器 Transformer 基礎模型中的注意力分佈，並觀察到注意力分配模式在大部分層中保持一致。令人驚訝的是，我們發現 $L_2$ 和快取 KV 對的注意力分數之間存在明顯的關聯性，其中鍵嵌入的低 $L_2$ 通常會導致解碼期間的高注意力分數。這一發現表明，KV 對的影響可能在查詢之前就由鍵嵌入本身決定。基於這一觀察，我們根據鍵嵌入的 $L_2$ 壓縮 KV 快取。我們的實驗結果表明，這種簡單的策略可以在語言建模和大海撈針任務中將 KV 快取大小減少 50%，在密鑰檢索任務中減少 90%，而不會降低準確度。", "author": "Alessio Devoto et.al.", "authors": "Alessio Devoto, Yu Zhao, Simone Scardapane, Pasquale Minervini", "id": "2406.11430v1", "paper_url": "http://arxiv.org/abs/2406.11430v1", "repo": "null"}}