{"2502.12813": {"publish_time": "2025-02-18", "title": "Simulating User Diversity in Task-Oriented Dialogue Systems using Large Language Models", "paper_summary": "In this study, we explore the application of Large Language Models (LLMs) for\ngenerating synthetic users and simulating user conversations with a\ntask-oriented dialogue system and present detailed results and their analysis.\nWe propose a comprehensive novel approach to user simulation technique that\nuses LLMs to create diverse user profiles, set goals, engage in multi-turn\ndialogues, and evaluate the conversation success. We employ two proprietary\nLLMs, namely GPT-4o and GPT-o1 (Achiam et al., 2023), to generate a\nheterogeneous base of user profiles, characterized by varied demographics,\nmultiple user goals, different conversational styles, initial knowledge levels,\ninterests, and conversational objectives. We perform a detailed analysis of the\nuser profiles generated by LLMs to assess the diversity, consistency, and\npotential biases inherent in these LLM-generated user simulations. We find that\nGPT-o1 generates more heterogeneous user distribution across most user\nattributes, while GPT-4o generates more skewed user attributes. The generated\nset of user profiles are then utilized to simulate dialogue sessions by\ninteracting with a task-oriented dialogue system.", "paper_summary_zh": "在這項研究中，我們探討大型語言模型 (LLM) 在生成合成使用者和模擬使用者對話，並使用任務導向對話系統進行對話的應用，並提出詳細的結果及其分析。我們提出了一種全面的使用者模擬技術新方法，利用 LLM 建立多樣化的使用者概況、設定目標、參與多輪對話，並評估對話的成功性。我們採用了兩個專有的 LLM，即 GPT-4o 和 GPT-o1 (Achiam 等人，2023 年)，以生成一個異質的使用者概況基礎，其特徵在於不同的人口統計資料、多個使用者目標、不同的對話風格、初始知識水準、興趣和對話目標。我們對 LLM 生成的使用者概況進行了詳細分析，以評估這些 LLM 生成的使用者模擬中固有的多樣性、一致性和潛在偏差。我們發現 GPT-o1 在大多數使用者屬性中產生更異質的使用者分佈，而 GPT-4o 則產生更偏斜的使用者屬性。然後利用生成的使用者概況集，透過與任務導向對話系統互動來模擬對話會話。", "author": "Adnan Ahmad et.al.", "authors": "Adnan Ahmad, Stefan Hillmann, Sebastian Möller", "id": "2502.12813v1", "paper_url": "http://arxiv.org/abs/2502.12813v1", "repo": "null"}}