{"2406.09041": {"publish_time": "2024-06-13", "title": "ME-Switch: A Memory-Efficient Expert Switching Framework for Large Language Models", "paper_summary": "The typical process for developing LLMs involves pre-training a general\nfoundation model on massive data, followed by fine-tuning on task-specific data\nto create specialized experts. Serving these experts poses challenges, as\nloading all experts onto devices is impractical, and frequent switching between\nexperts in response to user requests incurs substantial I/O costs, increasing\nlatency and expenses. Previous approaches decompose expert weights into\npre-trained model weights and residual delta weights, then quantize the delta\nweights to reduce model size. However, these methods often lead to significant\nquantization errors at extremely low bitwidths and assume the appropriate model\nfor a user request is known in advance, which is not practical. To address\nthese issues, we introduce ME-Switch, a memory-efficient expert switching\nframework for LLM serving. ME-Switch uses mixed-precision quantization,\nselectively quantizing non-salient input channels of delta weights to extremely\nlow bits while keeping salient ones intact, significantly reducing storage\ndemands while maintaining performance. Additionally, we develop a routing\nmethod that efficiently directs user queries to the most suitable expert by\ntransforming the model selection problem into a domain classification problem.\nExtensive experiments show ME-Switch's promising memory efficiency and routing\nperformance. For example, when serving three models from the Mistral-7B family,\nME-Switch reduces model size by 1.74x while maintaining nearly lossless\nperformance on instruction, mathematical reasoning, and code generation tasks.\nFurthermore, ME-Switch can efficiently serve 16 models from the Mistral-7B\nfamily on a single NVIDIA A100 GPU.", "paper_summary_zh": "<paragraph>開發大型語言模型的典型流程涉及在大量資料上預先訓練通用基礎模型，然後針對特定任務資料進行微調以建立專門的專家。提供這些專家服務會帶來挑戰，因為將所有專家載入裝置並不實際，而且根據使用者要求在專家之間頻繁切換會產生大量的 I/O 成本，增加延遲和費用。先前的做法將專家權重分解為預先訓練的模型權重和殘差 delta 權重，然後對 delta 權重進行量化以減少模型大小。然而，這些方法通常會在極低的位寬產生顯著的量化誤差，並假設事先已知道使用者要求的適當模型，這並不實際。為了解決這些問題，我們引入了 ME-Switch，一種用於大型語言模型服務的記憶體高效專家切換架構。ME-Switch 使用混合精度量化，選擇性地將 delta 權重的非顯著輸入通道量化為極低的位元，同時保持顯著通道的完整性，顯著降低儲存需求，同時維持效能。此外，我們開發了一種路由方法，透過將模型選擇問題轉換為網域分類問題，有效地將使用者查詢引導至最合適的專家。廣泛的實驗顯示 ME-Switch 具有良好的記憶體效率和路由效能。例如，在提供 Mistral-7B 系列中的三個模型時，ME-Switch 將模型大小減少了 1.74 倍，同時在指令、數學推理和程式碼產生任務上維持幾乎無損的效能。此外，ME-Switch 可以有效地在單一的 NVIDIA A100 GPU 上提供 Mistral-7B 系列中的 16 個模型。</paragraph>", "author": "Jing Liu et.al.", "authors": "Jing Liu, Ruihao Gong, Mingyang Zhang, Yefei He, Jianfei Cai, Bohan Zhuang", "id": "2406.09041v1", "paper_url": "http://arxiv.org/abs/2406.09041v1", "repo": "null"}}