{"2409.16654": {"publish_time": "2024-09-25", "title": "Speech Recognition Rescoring with Large Speech-Text Foundation Models", "paper_summary": "Large language models (LLM) have demonstrated the ability to understand human\nlanguage by leveraging large amount of text data. Automatic speech recognition\n(ASR) systems are often limited by available transcribed speech data and\nbenefit from a second pass rescoring using LLM. Recently multi-modal large\nlanguage models, particularly speech and text foundational models have\ndemonstrated strong spoken language understanding. Speech-Text foundational\nmodels leverage large amounts of unlabelled and labelled data both in speech\nand text modalities to model human language. In this work, we propose novel\ntechniques to use multi-modal LLM for ASR rescoring. We also explore\ndiscriminative training to further improve the foundational model rescoring\nperformance. We demonstrate cross-modal knowledge transfer in speech-text LLM\ncan benefit rescoring. Our experiments demonstrate up-to 20% relative\nimprovements over Whisper large ASR and up-to 15% relative improvements over\ntext-only LLM.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出透過大量文字資料理解人類語言的能力。自動語音辨識 (ASR) 系統通常受到可用轉錄語音資料的限制，並受益於使用 LLM 進行二次評分。最近，多模態大型語言模型，特別是語音和文字基礎模型，已展現出強大的口語理解能力。語音文字基礎模型利用大量未標記和標記資料，在語音和文字模式中建構人類語言模型。在這項工作中，我們提出使用多模態 LLM 進行 ASR 評分的新技術。我們也探討判別訓練，以進一步改善基礎模型的評分表現。我們證明語音文字 LLM 中的跨模態知識轉移可以改善評分。我們的實驗證明，相較於 Whisper 大型 ASR，我們的模型有高達 20% 的相對改善；相較於純文字 LLM，我們的模型有高達 15% 的相對改善。", "author": "Prashanth Gurunath Shivakumar et.al.", "authors": "Prashanth Gurunath Shivakumar, Jari Kolehmainen, Aditya Gourav, Yi Gu, Ankur Gandhe, Ariya Rastrow, Ivan Bulyko", "id": "2409.16654v1", "paper_url": "http://arxiv.org/abs/2409.16654v1", "repo": "null"}}