{"2412.15194": {"publish_time": "2024-12-19", "title": "MMLU-CF: A Contamination-free Multi-task Language Understanding Benchmark", "paper_summary": "Multiple-choice question (MCQ) datasets like Massive Multitask Language\nUnderstanding (MMLU) are widely used to evaluate the commonsense,\nunderstanding, and problem-solving abilities of large language models (LLMs).\nHowever, the open-source nature of these benchmarks and the broad sources of\ntraining data for LLMs have inevitably led to benchmark contamination,\nresulting in unreliable evaluation results. To alleviate this issue, we propose\na contamination-free and more challenging MCQ benchmark called MMLU-CF. This\nbenchmark reassesses LLMs' understanding of world knowledge by averting both\nunintentional and malicious data leakage. To avoid unintentional data leakage,\nwe source data from a broader domain and design three decontamination rules. To\nprevent malicious data leakage, we divide the benchmark into validation and\ntest sets with similar difficulty and subject distributions. The test set\nremains closed-source to ensure reliable results, while the validation set is\npublicly available to promote transparency and facilitate independent\nverification. Our evaluation of mainstream LLMs reveals that the powerful\nGPT-4o achieves merely a 5-shot score of 73.4% and a 0-shot score of 71.9% on\nthe test set, which indicates the effectiveness of our approach in creating a\nmore rigorous and contamination-free evaluation standard. The GitHub repository\nis available at https://github.com/microsoft/MMLU-CF and the dataset refers to\nhttps://huggingface.co/datasets/microsoft/MMLU-CF.", "paper_summary_zh": "<paragraph>多重選擇題 (MCQ) 資料集，例如 Massive Multitask Language Understanding (MMLU)，被廣泛用於評估大型語言模型 (LLM) 的常識、理解和問題解決能力。然而，這些基準的開放原始碼性質和 LLM 的訓練資料廣泛來源不可避免地導致基準污染，導致評估結果不可靠。為了緩解這個問題，我們提出了一個無污染且更具挑戰性的 MCQ 基準，稱為 MMLU-CF。此基準透過避免無意和惡意的資料外洩，重新評估 LLM 對世界知識的理解。為了避免無意的資料外洩，我們從更廣泛的網域中取得資料，並設計了三條去汙規則。為了防止惡意的資料外洩，我們將基準區分為驗證和測試集，具有相似的難度和主題分佈。測試集保持封閉原始碼以確保結果可靠，而驗證集公開可用以促進透明度和協助獨立驗證。我們對主流 LLM 的評估顯示，強大的 GPT-4o 在測試集上僅獲得 5 次嘗試得分 73.4% 和 0 次嘗試得分 71.9%，這表示我們的方法在建立更嚴謹且無污染的評估標準上是有效的。GitHub 存放庫可在 https://github.com/microsoft/MMLU-CF 取得，而資料集請參閱 https://huggingface.co/datasets/microsoft/MMLU-CF。</paragraph>", "author": "Qihao Zhao et.al.", "authors": "Qihao Zhao, Yangyu Huang, Tengchao Lv, Lei Cui, Qinzheng Sun, Shaoguang Mao, Xin Zhang, Ying Xin, Qiufeng Yin, Scarlett Li, Furu Wei", "id": "2412.15194v1", "paper_url": "http://arxiv.org/abs/2412.15194v1", "repo": "null"}}