{"2407.11555": {"publish_time": "2024-07-16", "title": "Self-Guided Generation of Minority Samples Using Diffusion Models", "paper_summary": "We present a novel approach for generating minority samples that live on\nlow-density regions of a data manifold. Our framework is built upon diffusion\nmodels, leveraging the principle of guided sampling that incorporates an\narbitrary energy-based guidance during inference time. The key defining feature\nof our sampler lies in its \\emph{self-contained} nature, \\ie, implementable\nsolely with a pretrained model. This distinguishes our sampler from existing\ntechniques that require expensive additional components (like external\nclassifiers) for minority generation. Specifically, we first estimate the\nlikelihood of features within an intermediate latent sample by evaluating a\nreconstruction loss w.r.t. its posterior mean. The generation then proceeds\nwith the minimization of the estimated likelihood, thereby encouraging the\nemergence of minority features in the latent samples of subsequent timesteps.\nTo further improve the performance of our sampler, we provide several\ntime-scheduling techniques that properly manage the influence of guidance over\ninference steps. Experiments on benchmark real datasets demonstrate that our\napproach can greatly improve the capability of creating realistic\nlow-likelihood minority instances over the existing techniques without the\nreliance on costly additional elements. Code is available at\n\\url{https://github.com/soobin-um/sg-minority}.", "paper_summary_zh": "我們提出了一種新的方法來產生少數樣本，這些樣本存在於資料流形中的低密度區域。我們的架構建立在擴散模型上，利用了引導取樣的原理，該原理在推論時間內包含了基於任意能量的引導。我們的取樣器的關鍵定義特徵在於其「自我封閉」的本質，也就是說，僅使用預訓練模型就能實現。這使得我們的取樣器有別於現有的技術，後者需要昂貴的額外組件（如外部分類器）來產生少數。具體來說，我們首先透過評估重建損失相對於其後驗平均值來估計中間潛在樣本中特徵的可能性。然後，生成會隨著估計可能性的最小化而進行，從而促進少數特徵在後續時間步長的潛在樣本中出現。為了進一步提高我們取樣器的效能，我們提供了幾種時間排程技術，這些技術可以適當地管理引導對推論步驟的影響。基準真實資料集上的實驗表明，與現有技術相比，我們的做法可以大幅提高建立逼真的低可能性少數個體的能力，而無需依賴昂貴的額外元素。程式碼可在 https://github.com/soobin-um/sg-minority 取得。", "author": "Soobin Um et.al.", "authors": "Soobin Um, Jong Chul Ye", "id": "2407.11555v1", "paper_url": "http://arxiv.org/abs/2407.11555v1", "repo": "https://github.com/soobin-um/sg-minority"}}