{"2412.18530": {"publish_time": "2024-12-24", "title": "Characterizations of Language Generation With Breadth", "paper_summary": "We study language generation in the limit, introduced by Kleinberg and\nMullainathan [KM24], building on classical works of Gold [Gol67] and Angluin\n[Ang79]. [KM24] proposed an algorithm that generates strings from any countable\nlanguage collection in the limit. While their algorithm eventually outputs\nstrings from the target language $K$, it sacrifices breadth, i.e., the ability\nto generate all strings in $K$. A key open question in [KM24] is whether this\ntrade-off between consistency and breadth is inherrent.\n  Recent works proposed different notions of consistent generation with\nbreadth. Kalavasis, Mehrotra, and Velegkas [KVM24] introduced three\ndefinitions: generation with exact breadth, approximate breadth, and\nunambiguous generation. Concurrently and independently, Charikar and Pabbaraju\n[CP24a] proposed exhaustive generation. Both works examined when generation\nwith these notions of breadth is possible.\n  Building on [CP24a, KVM24], we fully characterize language generation for\nthese notions and their natural combinations. For exact breadth, we provide an\nunconditional lower bound, removing a technical condition from [KVM24] and\nextending the result of [CP24a] that holds for specific collections of\nlanguages. We show that generation with exact breadth is characterized by\nAngluin's condition for identification. We further introduce a weaker version\nof Angluin's condition that tightly characterizes both approximate breadth and\nexhaustive generation, proving their equivalence. Additionally, we show that\nunambiguous generation is also characterized by Angluin's condition as a\nspecial case of a broader result. Finally, we strengthen [KVM24] by giving\nunconditional lower bounds for stable generators, showing that Angluin's\ncondition characterizes the previous breadth notions for stable generators.\nThis shows a separation between stable and unstable generation with approximate\nbreadth.", "paper_summary_zh": "<paragraph>我們研究語言生成極限，由 Kleinberg 和 Mullainathan [KM24] 提出，建立在 Gold [Gol67] 和 Angluin [Ang79] 的經典著作之上。[KM24] 提出了一種演算法，可以從任何可數語言集合中生成字串。雖然他們的演算法最終會輸出目標語言 $K$ 中的字串，但它犧牲了廣度，也就是生成 $K$ 中所有字串的能力。[KM24] 中一個關鍵的開放問題是，一致性和廣度之間的這種權衡是否固有。\n近期著作提出了廣度一致生成的不同概念。Kalavasis、Mehrotra 和 Velegkas [KVM24] 介紹了三個定義：廣度精確生成、廣度近似生成和無歧義生成。同時獨立地，Charikar 和 Pabbaraju [CP24a] 提出窮盡生成。兩項著作都探討了廣度的這些概念何時可能產生。\n建立在 [CP24a, KVM24] 之上，我們完全描述了這些概念的語言生成及其自然組合。對於廣度精確，我們提供了無條件的下限，從 [KVM24] 中移除技術條件，並擴充套件 [CP24a] 對特定語言集合成立的結果。我們表明，廣度精確的生成是由 Angluin 的識別條件特徵化的。我們進一步引入 Angluin 條件的較弱版本，它緊密地特徵化了近似廣度和窮盡生成，證明了它們的等價性。此外，我們表明無歧義生成也由 Angluin 條件特徵化，作為廣泛結果的特殊情況。最後，我們通過提供穩定生成器的無條件下限來加強 [KVM24]，表明 Angluin 條件特徵化了穩定生成器先前的廣度概念。這顯示了近似廣度穩定和不穩定生成之間的分離。</paragraph>", "author": "Alkis Kalavasis et.al.", "authors": "Alkis Kalavasis, Anay Mehrotra, Grigoris Velegkas", "id": "2412.18530v1", "paper_url": "http://arxiv.org/abs/2412.18530v1", "repo": "null"}}