{"2410.09773": {"publish_time": "2024-10-13", "title": "A Mixed-Language Multi-Document News Summarization Dataset and a Graphs-Based Extract-Generate Model", "paper_summary": "Existing research on news summarization primarily focuses on single-language\nsingle-document (SLSD), single-language multi-document (SLMD) or cross-language\nsingle-document (CLSD). However, in real-world scenarios, news about a\ninternational event often involves multiple documents in different languages,\ni.e., mixed-language multi-document (MLMD). Therefore, summarizing MLMD news is\nof great significance. However, the lack of datasets for MLMD news\nsummarization has constrained the development of research in this area. To fill\nthis gap, we construct a mixed-language multi-document news summarization\ndataset (MLMD-news), which contains four different languages and 10,992 source\ndocument cluster and target summary pairs. Additionally, we propose a\ngraph-based extract-generate model and benchmark various methods on the\nMLMD-news dataset and publicly release our dataset and\ncode\\footnote[1]{https://github.com/Southnf9/MLMD-news}, aiming to advance\nresearch in summarization within MLMD scenarios.", "paper_summary_zh": "現有新聞摘要的研究主要集中在單語言單文件 (SLSD)、單語言多文件 (SLMD) 或跨語言單文件 (CLSD)。然而，在現實世界的場景中，國際事件的新聞通常涉及不同語言的多個文件，即混合語言多文件 (MLMD)。因此，對 MLMD 新聞進行摘要具有重大意義。然而，缺乏 MLMD 新聞摘要的數據集限制了這一領域的研究發展。為了填補這一空白，我們構建了一個混合語言多文件新聞摘要數據集 (MLMD-news)，其中包含四種不同的語言和 10,992 個源文件群集和目標摘要對。此外，我們提出了一個基於圖的提取生成模型，並在 MLMD-news 數據集上對各種方法進行了基準測試，並公開發布我們的數據集和代碼\\footnote[1]{https://github.com/Southnf9/MLMD-news}，旨在推進 MLMD 場景中的摘要研究。", "author": "Shengxiang Gao et.al.", "authors": "Shengxiang Gao, Fang nan, Yongbing Zhang, Yuxin Huang, Kaiwen Tan, Zhengtao Yu", "id": "2410.09773v1", "paper_url": "http://arxiv.org/abs/2410.09773v1", "repo": "null"}}