{"2210.03506": {"publish_time": "2022-10-07", "title": "What Do End-Users Really Want? Investigation of Human-Centered XAI for Mobile Health Apps", "paper_summary": "In healthcare, AI systems support clinicians and patients in diagnosis,\ntreatment, and monitoring, but many systems' poor explainability remains\nchallenging for practical application. Overcoming this barrier is the goal of\nexplainable AI (XAI). However, an explanation can be perceived differently and,\nthus, not solve the black-box problem for everyone. The domain of\nHuman-Centered AI deals with this problem by adapting AI to users. We present a\nuser-centered persona concept to evaluate XAI and use it to investigate\nend-users preferences for various explanation styles and contents in a mobile\nhealth stress monitoring application. The results of our online survey show\nthat users' demographics and personality, as well as the type of explanation,\nimpact explanation preferences, indicating that these are essential features\nfor XAI design. We subsumed the results in three prototypical user personas:\npower-, casual-, and privacy-oriented users. Our insights bring an interactive,\nhuman-centered XAI closer to practical application.", "paper_summary_zh": "在醫療保健領域，AI 系統支援臨床醫生和患者進行診斷、治療和監控，但許多系統的解釋性不足，對實際應用仍構成挑戰。克服此障礙是可解釋 AI (XAI) 的目標。然而，每個人對於解釋的理解可能不同，因此無法為所有人解決黑箱問題。以人為中心的 AI 領域透過調整 AI 以適應使用者來處理此問題。我們提出以使用者為中心的角色概念來評估 XAI，並使用它來調查行動健康壓力監控應用程式中，終端使用者對於各種解釋風格和內容的偏好。我們的線上調查結果顯示，使用者的個人資料和人格特質，以及解釋類型，會影響解釋偏好，這表示這些是 XAI 設計的基本特徵。我們將結果歸納為三種原型使用者角色：重視權力、休閒和隱私的使用者。我們的見解讓互動式、以人為中心的 XAI 更接近實際應用。", "author": "Katharina Weitz et.al.", "authors": "Katharina Weitz, Alexander Zellner, Elisabeth André", "id": "2210.03506v1", "paper_url": "http://arxiv.org/abs/2210.03506v1", "repo": "null"}}