{"2409.18401": {"publish_time": "2024-09-27", "title": "GenesisTex2: Stable, Consistent and High-Quality Text-to-Texture Generation", "paper_summary": "Large-scale text-guided image diffusion models have shown astonishing results\nin text-to-image (T2I) generation. However, applying these models to synthesize\ntextures for 3D geometries remains challenging due to the domain gap between 2D\nimages and textures on a 3D surface. Early works that used a\nprojecting-and-inpainting approach managed to preserve generation diversity but\noften resulted in noticeable artifacts and style inconsistencies. While recent\nmethods have attempted to address these inconsistencies, they often introduce\nother issues, such as blurring, over-saturation, or over-smoothing. To overcome\nthese challenges, we propose a novel text-to-texture synthesis framework that\nleverages pretrained diffusion models. We first introduce a local attention\nreweighing mechanism in the self-attention layers to guide the model in\nconcentrating on spatial-correlated patches across different views, thereby\nenhancing local details while preserving cross-view consistency. Additionally,\nwe propose a novel latent space merge pipeline, which further ensures\nconsistency across different viewpoints without sacrificing too much diversity.\nOur method significantly outperforms existing state-of-the-art techniques\nregarding texture consistency and visual quality, while delivering results much\nfaster than distillation-based methods. Importantly, our framework does not\nrequire additional training or fine-tuning, making it highly adaptable to a\nwide range of models available on public platforms.", "paper_summary_zh": "大規模文字引導圖像擴散模型在文字對圖像 (T2I) 生成方面已展現驚人的成果。然而，由於 2D 影像與 3D 表面紋理之間的領域差距，將這些模型應用於合成 3D 幾何紋理仍然具有挑戰性。早期使用投影和修復方法的作品設法保留了生成的多樣性，但經常導致明顯的人工製品和樣式不一致。雖然最近的方法已嘗試解決這些不一致性，但它們經常會引入其他問題，例如模糊、過飽和或過度平滑。為了克服這些挑戰，我們提出了一種新穎的文字轉紋理合成架構，該架構利用了預訓練擴散模型。我們首先在自注意力層中引入局部注意力重新加權機制，以引導模型集中於不同視圖中的空間相關貼片，從而增強局部細節，同時保持跨視圖一致性。此外，我們提出了一種新穎的潛在空間合併管道，進一步確保了不同視點的一致性，同時不會犧牲太多樣性。我們的模型在紋理一致性和視覺品質方面明顯優於現有的最先進技術，同時比基於蒸餾的方法提供了更快的結果。重要的是，我們的框架不需要額外的訓練或微調，這使其高度適應於公共平台上提供的各種模型。", "author": "Jiawei Lu et.al.", "authors": "Jiawei Lu, Yingpeng Zhang, Zengjun Zhao, He Wang, Kun Zhou, Tianjia Shao", "id": "2409.18401v1", "paper_url": "http://arxiv.org/abs/2409.18401v1", "repo": "null"}}