{"2501.11960": {"publish_time": "2025-01-21", "title": "TAD-Bench: A Comprehensive Benchmark for Embedding-Based Text Anomaly Detection", "paper_summary": "Text anomaly detection is crucial for identifying spam, misinformation, and\noffensive language in natural language processing tasks. Despite the growing\nadoption of embedding-based methods, their effectiveness and generalizability\nacross diverse application scenarios remain under-explored. To address this, we\npresent TAD-Bench, a comprehensive benchmark designed to systematically\nevaluate embedding-based approaches for text anomaly detection. TAD-Bench\nintegrates multiple datasets spanning different domains, combining\nstate-of-the-art embeddings from large language models with a variety of\nanomaly detection algorithms. Through extensive experiments, we analyze the\ninterplay between embeddings and detection methods, uncovering their strengths,\nweaknesses, and applicability to different tasks. These findings offer new\nperspectives on building more robust, efficient, and generalizable anomaly\ndetection systems for real-world applications.", "paper_summary_zh": "文本異常偵測在自然語言處理任務中對於辨識垃圾郵件、錯誤訊息和冒犯性語言至關重要。儘管基於嵌入式的方法採用率日益提高，但其在不同應用場景中的有效性和普遍性仍未得到充分探討。為了解決這個問題，我們提出了 TAD-Bench，這是一個全面的基準，旨在系統性地評估基於嵌入式的方法以進行文本異常偵測。TAD-Bench 整合了跨越不同領域的多個資料集，結合了來自大型語言模型的最新嵌入式技術和各種異常偵測演算法。透過廣泛的實驗，我們分析了嵌入式技術和偵測方法之間的交互作用，揭示了它們的優點、缺點和對不同任務的適用性。這些發現為建構更強大、更有效率和更具普遍性的異常偵測系統以應對真實世界的應用提供了新的觀點。", "author": "Yang Cao et.al.", "authors": "Yang Cao, Sikun Yang, Chen Li, Haolong Xiang, Lianyong Qi, Bo Liu, Rongsheng Li, Ming Liu", "id": "2501.11960v1", "paper_url": "http://arxiv.org/abs/2501.11960v1", "repo": "null"}}