{"2410.10741": {"publish_time": "2024-10-14", "title": "SensorBench: Benchmarking LLMs in Coding-Based Sensor Processing", "paper_summary": "Effective processing, interpretation, and management of sensor data have\nemerged as a critical component of cyber-physical systems. Traditionally,\nprocessing sensor data requires profound theoretical knowledge and proficiency\nin signal-processing tools. However, recent works show that Large Language\nModels (LLMs) have promising capabilities in processing sensory data,\nsuggesting their potential as copilots for developing sensing systems.\n  To explore this potential, we construct a comprehensive benchmark,\nSensorBench, to establish a quantifiable objective. The benchmark incorporates\ndiverse real-world sensor datasets for various tasks. The results show that\nwhile LLMs exhibit considerable proficiency in simpler tasks, they face\ninherent challenges in processing compositional tasks with parameter selections\ncompared to engineering experts. Additionally, we investigate four prompting\nstrategies for sensor processing and show that self-verification can outperform\nall other baselines in 48% of tasks. Our study provides a comprehensive\nbenchmark and prompting analysis for future developments, paving the way toward\nan LLM-based sensor processing copilot.", "paper_summary_zh": "有效處理、詮釋和管理感測器資料已成為網路物理系統的關鍵組成部分。傳統上，處理感測器資料需要深厚的理論知識和訊號處理工具的熟練度。然而，最近的研究顯示，大型語言模型 (LLM) 在處理感測器資料方面具有良好的能力，表明它們有潛力成為開發感測系統的副駕駛。\n為了探索這種潛力，我們建構了一個全面的基準測試 SensorBench，以建立一個可量化的目標。此基準測試整合了各種任務的不同真實世界感測器資料集。結果顯示，儘管 LLM 在較簡單的任務中展現出相當好的能力，但在處理組合任務時，它們在參數選擇方面面臨固有的挑戰，這與工程專家相比。此外，我們研究了四種感測器處理的提示策略，並顯示出自我驗證在 48% 的任務中優於所有其他基準。我們的研究為未來的發展提供了一個全面的基準測試和提示分析，為基於 LLM 的感測器處理副駕駛鋪平了道路。", "author": "Pengrui Quan et.al.", "authors": "Pengrui Quan, Xiaomin Ouyang, Jeya Vikranth Jeyakumar, Ziqi Wang, Yang Xing, Mani Srivastava", "id": "2410.10741v1", "paper_url": "http://arxiv.org/abs/2410.10741v1", "repo": "https://github.com/nesl/llm_sensor_processing"}}