{"2406.12708": {"publish_time": "2024-06-18", "title": "AgentReview: Exploring Peer Review Dynamics with LLM Agents", "paper_summary": "Peer review is fundamental to the integrity and advancement of scientific\npublication. Traditional methods of peer review analyses often rely on\nexploration and statistics of existing peer review data, which do not\nadequately address the multivariate nature of the process, account for the\nlatent variables, and are further constrained by privacy concerns due to the\nsensitive nature of the data. We introduce AgentReview, the first large\nlanguage model (LLM) based peer review simulation framework, which effectively\ndisentangles the impacts of multiple latent factors and addresses the privacy\nissue. Our study reveals significant insights, including a notable 37.1%\nvariation in paper decisions due to reviewers' biases, supported by\nsociological theories such as the social influence theory, altruism fatigue,\nand authority bias. We believe that this study could offer valuable insights to\nimprove the design of peer review mechanisms.", "paper_summary_zh": "同儕審查是科學出版的完整性和進步的基礎。傳統的同儕審查分析方法通常依賴於對現有同儕審查資料的探討和統計，這並不能充分解決這個過程的多元性質，說明潛在變數，而且由於資料的敏感性，進一步受到隱私問題的限制。我們引入了 AgentReview，這是第一個基於大型語言模型 (LLM) 的同儕審查模擬架構，它有效地解開了多重潛在因素的影響，並解決了隱私問題。我們的研究揭示了重要的見解，包括由於審查者的偏見而導致的論文決策有顯著的 37.1% 差異，這得到了社會影響理論、利他疲勞和權威偏誤等社會學理論的支持。我們相信這項研究可以提供有價值的見解，以改善同儕審查機制的設計。", "author": "Yiqiao Jin et.al.", "authors": "Yiqiao Jin, Qinlin Zhao, Yiyang Wang, Hao Chen, Kaijie Zhu, Yijia Xiao, Jindong Wang", "id": "2406.12708v1", "paper_url": "http://arxiv.org/abs/2406.12708v1", "repo": "null"}}