{"2410.18529": {"publish_time": "2024-10-24", "title": "A Systematic Survey on Instructional Text: From Representation and Downstream NLP Tasks", "paper_summary": "Recent advances in large language models have demonstrated promising\ncapabilities in following simple instructions through instruction tuning.\nHowever, real-world tasks often involve complex, multi-step instructions that\nremain challenging for current NLP systems. Despite growing interest in this\narea, there lacks a comprehensive survey that systematically analyzes the\nlandscape of complex instruction understanding and processing. Through a\nsystematic review of the literature, we analyze available resources,\nrepresentation schemes, and downstream tasks related to instructional text. Our\nstudy examines 177 papers, identifying trends, challenges, and opportunities in\nthis emerging field. We provide AI/NLP researchers with essential background\nknowledge and a unified view of various approaches to complex instruction\nunderstanding, bridging gaps between different research directions and\nhighlighting future research opportunities.", "paper_summary_zh": "最近在大型语言模型方面的进展已在通过指令调整遵循简单指令方面展示了有希望的能力。然而，现实世界中的任务通常涉及复杂的多步骤指令，这对当前的 NLP 系统来说仍然具有挑战性。尽管对这个领域越来越感兴趣，但仍缺乏系统分析复杂指令理解和处理的全面调查。通过对文献进行系统回顾，我们分析了与教学文本相关的可用资源、表示方案和下游任务。我们的研究审查了 177 篇论文，确定了这个新兴领域的趋势、挑战和机遇。我们为人工智能/自然语言处理研究人员提供了必要的背景知识和对复杂指令理解的各种方法的统一看法，弥合了不同研究方向之间的差距，并强调了未来的研究机会。", "author": "Abdulfattah Safa et.al.", "authors": "Abdulfattah Safa, Tamta Kapanadze, Arda Uzunoğlu, Gözde Gül Şahin", "id": "2410.18529v1", "paper_url": "http://arxiv.org/abs/2410.18529v1", "repo": "null"}}