{"2502.07780": {"publish_time": "2025-02-11", "title": "DarwinLM: Evolutionary Structured Pruning of Large Language Models", "paper_summary": "Large Language Models (LLMs) have achieved significant success across various\nNLP tasks. However, their massive computational costs limit their widespread\nuse, particularly in real-time applications. Structured pruning offers an\neffective solution by compressing models and directly providing end-to-end\nspeed improvements, regardless of the hardware environment. Meanwhile,\ndifferent components of the model exhibit varying sensitivities towards\npruning, calling for \\emph{non-uniform} model compression. However, a pruning\nmethod should not only identify a capable substructure, but also account for\npost-compression training. To this end, we propose \\sysname, a method for\n\\emph{training-aware} structured pruning. \\sysname builds upon an evolutionary\nsearch process, generating multiple offspring models in each generation through\nmutation, and selecting the fittest for survival. To assess the effect of\npost-training, we incorporate a lightweight, multistep training process within\nthe offspring population, progressively increasing the number of tokens and\neliminating poorly performing models in each selection stage. We validate our\nmethod through extensive experiments on Llama-2-7B, Llama-3.1-8B and\nQwen-2.5-14B-Instruct, achieving state-of-the-art performance for structured\npruning. For instance, \\sysname surpasses ShearedLlama while requiring\n$5\\times$ less training data during post-compression training.", "paper_summary_zh": "大型語言模型 (LLM) 在各種 NLP 任務中獲得顯著的成功。然而，它們龐大的運算成本限制了它們的廣泛使用，特別是在即時應用程式中。結構化剪枝提供了一個有效的解決方案，通過壓縮模型並直接提供端到端的加速改進，而不管硬體環境如何。同時，模型的不同組成部分對剪枝表現出不同的敏感性，要求進行\\emph{非均勻}模型壓縮。然而，剪枝方法不僅應該識別出一個有能力的子結構，還應該考慮壓縮後訓練。為此，我們提出 \\sysname，一種用於\\emph{訓練感知}結構化剪枝的方法。\\sysname 建立在一個進化搜索過程中，通過突變在每一代產生多個後代模型，並選擇最適合生存的模型。為了評估後訓練的效果，我們在後代群體中加入一個輕量級的多步驟訓練過程，逐漸增加令牌的數量並在每個選擇階段淘汰表現不佳的模型。我們通過對 Llama-2-7B、Llama-3.1-8B 和 Qwen-2.5-14B-Instruct 進行廣泛的實驗驗證了我們的模型，實現了結構化剪枝的最新效能。例如，\\sysname 超越了 ShearedLlama，同時在壓縮後訓練中需要的訓練資料減少了 $5\\times$。", "author": "Shengkun Tang et.al.", "authors": "Shengkun Tang, Oliver Sieberling, Eldar Kurtic, Zhiqiang Shen, Dan Alistarh", "id": "2502.07780v1", "paper_url": "http://arxiv.org/abs/2502.07780v1", "repo": "null"}}