{"2405.05348": {"publish_time": "2024-05-08", "title": "The Effect of Model Size on LLM Post-hoc Explainability via LIME", "paper_summary": "Large language models (LLMs) are becoming bigger to boost performance.\nHowever, little is known about how explainability is affected by this trend.\nThis work explores LIME explanations for DeBERTaV3 models of four different\nsizes on natural language inference (NLI) and zero-shot classification (ZSC)\ntasks. We evaluate the explanations based on their faithfulness to the models'\ninternal decision processes and their plausibility, i.e. their agreement with\nhuman explanations. The key finding is that increased model size does not\ncorrelate with plausibility despite improved model performance, suggesting a\nmisalignment between the LIME explanations and the models' internal processes\nas model size increases. Our results further suggest limitations regarding\nfaithfulness metrics in NLI contexts.", "paper_summary_zh": "大型語言模型（LLM）正變得更大以提升效能。\n然而，鮮少人知道可解釋性如何受到此趨勢影響。\n這項工作探索了四種不同大小的 DeBERTaV3 模型的 LIME 解釋，探討自然語言推理 (NLI) 和零次分類 (ZSC) 任務。我們根據解釋對模型內部決策流程的忠實度及其合理性（即與人類解釋的一致性）來評估解釋。關鍵發現是，儘管模型效能有所提升，但模型大小的增加與合理性並無相關性，這表明隨著模型大小的增加，LIME 解釋與模型的內部流程之間存在錯位。我們的結果進一步表明在 NLI 背景下忠實度指標的局限性。", "author": "Henning Heyen et.al.", "authors": "Henning Heyen, Amy Widdicombe, Noah Y. Siegel, Maria Perez-Ortiz, Philip Treleaven", "id": "2405.05348v1", "paper_url": "http://arxiv.org/abs/2405.05348v1", "repo": "https://github.com/henningheyen/scalability-of-llm-posthoc-explanations"}}