{"2409.05283": {"publish_time": "2024-09-09", "title": "On the Relationship between Truth and Political Bias in Language Models", "paper_summary": "Language model alignment research often attempts to ensure that models are\nnot only helpful and harmless, but also truthful and unbiased. However,\noptimizing these objectives simultaneously can obscure how improving one aspect\nmight impact the others. In this work, we focus on analyzing the relationship\nbetween two concepts essential in both language model alignment and political\nscience: \\textit{truthfulness} and \\textit{political bias}. We train reward\nmodels on various popular truthfulness datasets and subsequently evaluate their\npolitical bias. Our findings reveal that optimizing reward models for\ntruthfulness on these datasets tends to result in a left-leaning political\nbias. We also find that existing open-source reward models (i.e. those trained\non standard human preference datasets) already show a similar bias and that the\nbias is larger for larger models. These results raise important questions about\nboth the datasets used to represent truthfulness and what language models\ncapture about the relationship between truth and politics.", "paper_summary_zh": "語言模型對齊研究通常試圖確保模型不僅有幫助且無害，而且真實且公正。然而，同時優化這些目標可能會模糊改善一個方面如何影響其他方面。在這項工作中，我們專注於分析語言模型對齊和政治科學中兩個基本概念之間的關係：\\textit{真實性}和\\textit{政治偏見}。我們在各種流行的真實性資料集上訓練獎勵模型，並隨後評估其政治偏見。我們的研究結果表明，在這些資料集上優化獎勵模型的真實性往往會導致左傾的政治偏見。我們還發現現有的開源獎勵模型（即在標準人類偏好資料集上訓練的模型）已經表現出類似的偏見，並且對於較大的模型，偏見更大。這些結果提出了關於用於表示真實性的資料集以及語言模型如何捕捉真實與政治之間關係的重要問題。", "author": "Suyash Fulay et.al.", "authors": "Suyash Fulay, William Brannon, Shrestha Mohanty, Cassandra Overney, Elinor Poole-Dayan, Deb Roy, Jad Kabbara", "id": "2409.05283v1", "paper_url": "http://arxiv.org/abs/2409.05283v1", "repo": "null"}}