{"2412.07222": {"publish_time": "2024-12-10", "title": "MPSI: Mamba enhancement model for pixel-wise sequential interaction Image Super-Resolution", "paper_summary": "Single image super-resolution (SR) has long posed a challenge in the field of\ncomputer vision. While the advent of deep learning has led to the emergence of\nnumerous methods aimed at tackling this persistent issue, the current\nmethodologies still encounter challenges in modeling long sequence information,\nleading to limitations in effectively capturing the global pixel interactions.\nTo tackle this challenge and achieve superior SR outcomes, we propose the Mamba\npixel-wise sequential interaction network (MPSI), aimed at enhancing the\nestablishment of long-range connections of information, particularly focusing\non pixel-wise sequential interaction. We propose the Channel-Mamba Block (CMB)\nto capture comprehensive pixel interaction information by effectively modeling\nlong sequence information. Moreover, in the existing SR methodologies, there\npersists the issue of the neglect of features extracted by preceding layers,\nleading to the loss of valuable feature information. While certain existing\nmodels strive to preserve these features, they frequently encounter difficulty\nin establishing connections across all layers. To overcome this limitation,\nMPSI introduces the Mamba channel recursion module (MCRM), which maximizes the\nretention of valuable feature information from early layers, thereby\nfacilitating the acquisition of pixel sequence interaction information from\nmultiple-level layers. Through extensive experimentation, we demonstrate that\nMPSI outperforms existing super-resolution methods in terms of image\nreconstruction results, attaining state-of-the-art performance.", "paper_summary_zh": "單一影像超解析度 (SR) 長期以來一直是電腦視覺領域中的挑戰。儘管深度學習的出現導致了許多旨在解決此持續問題的方法，但目前的技術在建模長序列資訊方面仍遇到挑戰，導致在有效捕捉全局像素交互方面受到限制。為了應對此挑戰並獲得卓越的 SR 成果，我們提出了 Mamba 像素級序貫互動網路 (MPSI)，旨在增強資訊的遠距離連線建立，特別關注像素級序貫互動。我們提出了通道 Mamba 區塊 (CMB) 以透過有效地建模長序列資訊來捕捉全面的像素互動資訊。此外，在現有的 SR 技術中，持續存在忽略前一層提取特徵的問題，導致有價值的特徵資訊遺失。儘管某些現有模型努力保留這些特徵，但它們經常難以建立所有層的連線。為了克服此限制，MPSI 引入了 Mamba 通道遞迴模組 (MCRM)，它最大化保留早期層的有價值特徵資訊，從而促進從多層層級獲取像素序列互動資訊。透過廣泛的實驗，我們證明 MPSI 在影像重建結果方面優於現有的超解析度方法，達到了最先進的效能。", "author": "Yuchun He et.al.", "authors": "Yuchun He, Yuhan He", "id": "2412.07222v1", "paper_url": "http://arxiv.org/abs/2412.07222v1", "repo": "null"}}