{"2410.16574": {"publish_time": "2024-10-21", "title": "How Can We Diagnose and Treat Bias in Large Language Models for Clinical Decision-Making?", "paper_summary": "Recent advancements in Large Language Models (LLMs) have positioned them as\npowerful tools for clinical decision-making, with rapidly expanding\napplications in healthcare. However, concerns about bias remain a significant\nchallenge in the clinical implementation of LLMs, particularly regarding gender\nand ethnicity. This research investigates the evaluation and mitigation of bias\nin LLMs applied to complex clinical cases, focusing on gender and ethnicity\nbiases. We introduce a novel Counterfactual Patient Variations (CPV) dataset\nderived from the JAMA Clinical Challenge. Using this dataset, we built a\nframework for bias evaluation, employing both Multiple Choice Questions (MCQs)\nand corresponding explanations. We explore prompting with eight LLMs and\nfine-tuning as debiasing methods. Our findings reveal that addressing social\nbiases in LLMs requires a multidimensional approach as mitigating gender bias\ncan occur while introducing ethnicity biases, and that gender bias in LLM\nembeddings varies significantly across medical specialities. We demonstrate\nthat evaluating both MCQ response and explanation processes is crucial, as\ncorrect responses can be based on biased \\textit{reasoning}. We provide a\nframework for evaluating LLM bias in real-world clinical cases, offer insights\ninto the complex nature of bias in these models, and present strategies for\nbias mitigation.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展已將它們定位為臨床決策制定強大的工具，在醫療保健領域的應用迅速擴展。然而，關於偏見的擔憂仍然是 LLM 在臨床實施中的重大挑戰，特別是關於性別和種族。本研究調查了應用於複雜臨床病例的 LLM 中偏見的評估和緩解，重點關注性別和種族偏見。我們引入了一個新的反事實患者變異 (CPV) 數據集，該數據集源自 JAMA 臨床挑戰。使用此數據集，我們建立了一個偏見評估框架，同時採用多選題 (MCQ) 和相應的解釋。我們探索使用八個 LLM 進行提示，並對微調進行去偏方法。我們的研究結果表明，解決 LLM 中的社會偏見需要多維度的方法，因為在引入種族偏見的同時可能會減輕性別偏見，並且 LLM 嵌入中的性別偏見在各個醫療專業領域存在顯著差異。我們證明了評估 MCQ 響應和解釋過程至關重要，因為正確的響應可能基於有偏見的\\textit{推理}。我們提供了一個用於評估 LLM 在現實世界臨床病例中的偏見的框架，深入了解這些模型中偏見的複雜性，並提出緩解偏見的策略。", "author": "Kenza Benkirane et.al.", "authors": "Kenza Benkirane, Jackie Kay, Maria Perez-Ortiz", "id": "2410.16574v1", "paper_url": "http://arxiv.org/abs/2410.16574v1", "repo": "null"}}