{"2405.10202": {"publish_time": "2024-05-16", "title": "Hierarchical Attention Graph for Scientific Document Summarization in Global and Local Level", "paper_summary": "Scientific document summarization has been a challenging task due to the long\nstructure of the input text. The long input hinders the simultaneous effective\nmodeling of both global high-order relations between sentences and local\nintra-sentence relations which is the most critical step in extractive\nsummarization. However, existing methods mostly focus on one type of relation,\nneglecting the simultaneous effective modeling of both relations, which can\nlead to insufficient learning of semantic representations. In this paper, we\npropose HAESum, a novel approach utilizing graph neural networks to locally and\nglobally model documents based on their hierarchical discourse structure.\nFirst, intra-sentence relations are learned using a local heterogeneous graph.\nSubsequently, a novel hypergraph self-attention layer is introduced to further\nenhance the characterization of high-order inter-sentence relations. We\nvalidate our approach on two benchmark datasets, and the experimental results\ndemonstrate the effectiveness of HAESum and the importance of considering\nhierarchical structures in modeling long scientific documents. Our code will be\navailable at \\url{https://github.com/MoLICHENXI/HAESum}", "paper_summary_zh": "<paragraph>科學文件摘要一直是一項具有挑戰性的任務，因為輸入文字的結構很長。長的輸入會阻礙同時有效地對句子之間的整體高階關係和句子內部的局部關係進行建模，這是萃取式摘要中最關鍵的步驟。然而，現有的方法大多只關注一種關係，忽視了對兩種關係的同時有效建模，這可能會導致語義表示的學習不足。在本文中，我們提出了 HAESum，這是一種利用圖神經網路在局部和整體上根據其層次化話語結構對文件進行建模的新方法。首先，使用局部異質圖學習句子內部關係。隨後，引入了一個新穎的超圖自注意力層，以進一步增強高階句子間關係的表徵。我們在兩個基準資料集上驗證了我們的做法，實驗結果證明了 HAESum 的有效性，以及在對長科學文件進行建模時考慮層次結構的重要性。我們的程式碼將可以在 \\url{https://github.com/MoLICHENXI/HAESum} 取得</paragraph>", "author": "Chenlong Zhao et.al.", "authors": "Chenlong Zhao, Xiwen Zhou, Xiaopeng Xie, Yong Zhang", "id": "2405.10202v1", "paper_url": "http://arxiv.org/abs/2405.10202v1", "repo": "https://github.com/molichenxi/haesum"}}