{"2406.03916": {"publish_time": "2024-06-06", "title": "ArMeme: Propagandistic Content in Arabic Memes", "paper_summary": "With the rise of digital communication, memes have become a significant\nmedium for cultural and political expression that is often used to mislead\naudiences. Identification of such misleading and persuasive multimodal content\nhas become more important among various stakeholders, including social media\nplatforms, policymakers, and the broader society as they often cause harm to\nindividuals, organizations, and/or society. While there has been effort to\ndevelop AI-based automatic systems for resource-rich languages (e.g., English),\nit is relatively little to none for medium to low resource languages. In this\nstudy, we focused on developing an Arabic memes dataset with manual annotations\nof propagandistic content. We annotated ~6K Arabic memes collected from various\nsocial media platforms, which is a first resource for Arabic multimodal\nresearch. We provide a comprehensive analysis aiming to develop computational\ntools for their detection. We will make them publicly available for the\ncommunity.", "paper_summary_zh": "隨著數位通訊的興起，迷因已成為文化和政治表達的重要媒介，常被用於誤導受眾。識別此類具有誤導性和說服力的多模態內容已成為各利益相關者之間更重要的事，包括社群媒體平台、政策制定者和廣大社會，因為它們通常會對個人、組織和/或社會造成傷害。雖然已努力為資源豐富的語言（例如英語）開發基於 AI 的自動系統，但對於中低資源語言來說卻相對較少甚至沒有。在本研究中，我們專注於開發具有宣傳內容手動註解的阿拉伯迷因資料集。我們註解了從各種社群媒體平台收集的約 6K 個阿拉伯迷因，這是阿拉伯多模態研究的第一個資源。我們提供全面的分析，旨在為其偵測開發運算工具。我們將讓它們公開提供給社群。", "author": "Firoj Alam et.al.", "authors": "Firoj Alam, Abul Hasnat, Fatema Ahmed, Md Arid Hasan, Maram Hasanain", "id": "2406.03916v1", "paper_url": "http://arxiv.org/abs/2406.03916v1", "repo": "null"}}