{"2407.03203": {"publish_time": "2024-07-03", "title": "TheoremLlama: Transforming General-Purpose LLMs into Lean4 Experts", "paper_summary": "Proving mathematical theorems using computer-verifiable formal languages like\nLean significantly impacts mathematical reasoning. One approach to formal\ntheorem proving involves generating complete proofs using Large Language Models\n(LLMs) based on Natural Language (NL) proofs. Similar methods have shown\npromising results in code generation. However, most modern LLMs exhibit\nsuboptimal performance due to the scarcity of aligned NL and Formal Language\n(FL) theorem-proving data. This scarcity results in a paucity of methodologies\nfor training LLMs and techniques to fully utilize their capabilities in\ncomposing formal proofs. To address the challenges, this paper proposes\n**TheoremLlama**, an end-to-end framework to train a general-purpose LLM to\nbecome a Lean4 expert. This framework encompasses NL-FL aligned dataset\ngeneration methods, training approaches for the LLM formal theorem prover, and\ntechniques for LLM Lean4 proof writing. Using the dataset generation method, we\nprovide *Open Bootstrapped Theorems* (OBT), an NL-FL aligned and bootstrapped\ndataset. A key innovation in this framework is the NL-FL bootstrapping method,\nwhere NL proofs are integrated into Lean4 code for training datasets,\nleveraging the NL reasoning ability of LLMs for formal reasoning. The\n**TheoremLlama** framework achieves cumulative accuracies of 36.48% and 33.61%\non MiniF2F-Valid and Test datasets respectively, surpassing the GPT-4 baseline\nof 22.95% and 25.41%. We have also open-sourced our model checkpoints and\ngenerated dataset, and will soon make all the code publicly available.", "paper_summary_zh": "使用像 Lean 這樣的電腦可驗證形式語言來證明數學定理，對數學推理有重大的影響。一種形式定理證明的方法涉及使用基於自然語言 (NL) 證明的巨量語言模型 (LLM) 來產生完整的證明。類似的辦法在程式碼產生方面已展現出有希望的結果。然而，由於對齊的 NL 和形式語言 (FL) 定理證明資料的稀少，大多數現代 LLM 都表現出次佳效能。這種稀少導致了 LLM 訓練方法和充分利用其能力撰寫形式證明的技術的缺乏。為了應對這些挑戰，本文提出了 **TheoremLlama**，一個端到端的架構，用於訓練一個通用 LLM，使其成為 Lean4 專家。此架構包含 NL-FL 對齊資料集產生方法、LLM 形式定理證明器的訓練方法，以及 LLM Lean4 證明撰寫的技術。使用資料集產生方法，我們提供了 *開放式引導定理* (OBT)，一個 NL-FL 對齊且引導的資料集。此架構中的一個關鍵創新是 NL-FL 引導方法，其中 NL 證明被整合到 Lean4 程式碼中以訓練資料集，利用 LLM 的 NL 推理能力進行形式推理。**TheoremLlama** 架構在 MiniF2F-Valid 和 Test 資料集上分別達到了 36.48% 和 33.61% 的累積準確度，超過了 GPT-4 的基準 22.95% 和 25.41%。我們也開源了我們的模型檢查點和產生的資料集，並且很快就會公開所有程式碼。", "author": "Ruida Wang et.al.", "authors": "Ruida Wang, Jipeng Zhang, Yizhen Jia, Rui Pan, Shizhe Diao, Renjie Pi, Tong Zhang", "id": "2407.03203v1", "paper_url": "http://arxiv.org/abs/2407.03203v1", "repo": "https://github.com/RickySkywalker/TheoremLlama"}}