{"2407.03080": {"publish_time": "2024-07-03", "title": "Artificial Inductive Bias for Synthetic Tabular Data Generation in Data-Scarce Scenarios", "paper_summary": "While synthetic tabular data generation using Deep Generative Models (DGMs)\noffers a compelling solution to data scarcity and privacy concerns, their\neffectiveness relies on substantial training data, often unavailable in\nreal-world applications. This paper addresses this challenge by proposing a\nnovel methodology for generating realistic and reliable synthetic tabular data\nwith DGMs in limited real-data environments. Our approach proposes several ways\nto generate an artificial inductive bias in a DGM through transfer learning and\nmeta-learning techniques. We explore and compare four different methods within\nthis framework, demonstrating that transfer learning strategies like\npre-training and model averaging outperform meta-learning approaches, like\nModel-Agnostic Meta-Learning, and Domain Randomized Search. We validate our\napproach using two state-of-the-art DGMs, namely, a Variational Autoencoder and\na Generative Adversarial Network, to show that our artificial inductive bias\nfuels superior synthetic data quality, as measured by Jensen-Shannon\ndivergence, achieving relative gains of up to 50\\% when using our proposed\napproach. This methodology has broad applicability in various DGMs and machine\nlearning tasks, particularly in areas like healthcare and finance, where data\nscarcity is often a critical issue.", "paper_summary_zh": "<paragraph>儘管使用深度生成模型 (DGM) 進行合成表格資料生成提供了一個引人注目的解決方案來解決資料稀少和隱私問題，但它們的有效性依賴於大量的訓練資料，而在現實世界的應用中通常無法取得。本文透過提出一個創新的方法論來解決這個挑戰，以在有限的真實資料環境中使用 DGM 生成逼真且可靠的合成表格資料。我們的做法提出了幾種方法，透過轉移學習和元學習技術在 DGM 中產生人工歸納偏誤。我們在這個架構中探討並比較了四種不同的方法，證明了像預訓練和模型平均化的轉移學習策略優於元學習方法，例如模型不可知元學習和領域隨機搜尋。我們使用兩個最先進的 DGM，即變異自動編碼器和生成對抗網路，驗證了我們的做法，以證明我們的人工歸納偏誤會提升合成的資料品質，這是透過 Jensen-Shannon 距離來衡量的，在使用我們提出的方法時，達到了高達 50% 的相對增益。這種方法論在各種 DGM 和機器學習任務中具有廣泛的應用性，特別是在醫療保健和金融等領域，其中資料稀少通常是一個關鍵問題。</paragraph>", "author": "Patricia A. Apellániz et.al.", "authors": "Patricia A. Apellániz, Ana Jiménez, Borja Arroyo Galende, Juan Parras, Santiago Zazo", "id": "2407.03080v1", "paper_url": "http://arxiv.org/abs/2407.03080v1", "repo": "null"}}