{"2405.04825": {"publish_time": "2024-05-08", "title": "Explanation as a Watermark: Towards Harmless and Multi-bit Model Ownership Verification via Watermarking Feature Attribution", "paper_summary": "Ownership verification is currently the most critical and widely adopted\npost-hoc method to safeguard model copyright. In general, model owners exploit\nit to identify whether a given suspicious third-party model is stolen from them\nby examining whether it has particular properties `inherited' from their\nreleased models. Currently, backdoor-based model watermarks are the primary and\ncutting-edge methods to implant such properties in the released models.\nHowever, backdoor-based methods have two fatal drawbacks, including harmfulness\nand ambiguity. The former indicates that they introduce maliciously\ncontrollable misclassification behaviors ($i.e.$, backdoor) to the watermarked\nreleased models. The latter denotes that malicious users can easily pass the\nverification by finding other misclassified samples, leading to ownership\nambiguity.\n  In this paper, we argue that both limitations stem from the `zero-bit' nature\nof existing watermarking schemes, where they exploit the status ($i.e.$,\nmisclassified) of predictions for verification. Motivated by this\nunderstanding, we design a new watermarking paradigm, $i.e.$, Explanation as a\nWatermark (EaaW), that implants verification behaviors into the explanation of\nfeature attribution instead of model predictions. Specifically, EaaW embeds a\n`multi-bit' watermark into the feature attribution explanation of specific\ntrigger samples without changing the original prediction. We correspondingly\ndesign the watermark embedding and extraction algorithms inspired by\nexplainable artificial intelligence. In particular, our approach can be used\nfor different tasks ($e.g.$, image classification and text generation).\nExtensive experiments verify the effectiveness and harmlessness of our EaaW and\nits resistance to potential attacks.", "paper_summary_zh": "目前，所有權驗證是保護模型著作權最關鍵且廣為採用的事後方法。一般而言，模型所有者利用它來識別特定可疑的第三方模型是否從他們那裡竊取，方法是檢查它是否具有從他們發布的模型「繼承」的特定屬性。目前，基於後門的模型浮水印是植入發布模型中此類屬性的主要且最先進的方法。然而，基於後門的方法有兩個致命的缺點，包括有害性和模糊性。前者表示它們會將惡意可控的錯誤分類行為（即後門）引入帶浮水印的發布模型。後者表示惡意使用者可以輕鬆地透過尋找其他錯誤分類的範例來通過驗證，導致所有權模糊性。\n在本文中，我們認為這兩個限制都源於現有浮水印方案的「零位元」性質，它們利用預測的狀態（即錯誤分類）進行驗證。受此理解的啟發，我們設計了一個新的浮水印範例，即解釋作為浮水印 (EaaW)，它將驗證行為植入特徵歸因的解釋中，而不是模型預測中。具體來說，EaaW 將「多位元」浮水印嵌入特定觸發範例的特徵歸因解釋中，而不會改變原始預測。我們相應地設計了受可解釋人工智慧啟發的浮水印嵌入和提取演算法。特別是，我們的做法可應用於不同的任務（例如，影像分類和文字生成）。廣泛的實驗驗證了我們 EaaW 的有效性和無害性，以及它對潛在攻擊的抵抗力。", "author": "Shuo Shao et.al.", "authors": "Shuo Shao, Yiming Li, Hongwei Yao, Yiling He, Zhan Qin, Kui Ren", "id": "2405.04825v1", "paper_url": "http://arxiv.org/abs/2405.04825v1", "repo": "null"}}