{"2501.17703": {"publish_time": "2025-01-29", "title": "Critique Fine-Tuning: Learning to Critique is More Effective than Learning to Imitate", "paper_summary": "Supervised Fine-Tuning (SFT) is commonly used to train language models to\nimitate annotated responses for given instructions. In this paper, we challenge\nthis paradigm and propose Critique Fine-Tuning (CFT), a strategy where models\nlearn to critique noisy responses rather than simply imitate correct ones.\nInspired by human learning processes that emphasize critical thinking, CFT\nencourages deeper analysis and nuanced understanding-traits often overlooked by\nstandard SFT. To validate the effectiveness of CFT, we construct a 50K-sample\ndataset from WebInstruct, using GPT-4o as the teacher to generate critiques in\nthe form of (input=[query; noisy response], output=critique). CFT on this\ndataset yields a consistent 4-10% improvement over SFT on six math benchmarks\nwith different base models like Qwen2.5, Qwen2.5-Math and DeepSeek-Math. We\nfurther expand to MetaMath and NuminaMath datasets and observe similar gains\nover SFT. Notably, our Qwen2.5-Math-CFT model-trained on just 50K\nsamples-matches or outperforms competitive models such as AceMath and\nQwen2.5-Math-Instruct on most benchmarks, both of which use over 2M samples.\nAblation studies show that CFT is robust to the source of noisy response and\nteacher critique model. Through these findings, we argue that critique-based\ntraining offers a more effective alternative to advance the reasoning of\nlanguage models.", "paper_summary_zh": "<paragraph>監督微調 (SFT) 常用於訓練語言模型，以模仿針對特定指示的標註回應。在本文中，我們挑戰此範例並提出批判微調 (CFT)，這是一種策略，模型學習批判有雜訊的回應，而非僅模仿正確的回應。受強調批判性思考的人類學習過程啟發，CFT 鼓勵更深入的分析和細微的理解，這些特質通常被標準 SFT 忽略。為了驗證 CFT 的有效性，我們從 WebInstruct 建構一個 50K 範例的資料集，使用 GPT-4o 作為教師，以 (輸入=[查詢；有雜訊的回應]，輸出=批判) 的形式產生批判。此資料集上的 CFT 在六個數學基準上產生一致的 4-10% 進步，使用不同的基礎模型，例如 Qwen2.5、Qwen2.5-Math 和 DeepSeek-Math。我們進一步擴展到 MetaMath 和 NuminaMath 資料集，並觀察到比 SFT 類似的增益。值得注意的是，我們的 Qwen2.5-Math-CFT 模型僅訓練於 50K 範例，在多數基準上比 AceMath 和 Qwen2.5-Math-Instruct 等競爭模型匹配或表現更佳，而後兩者都使用超過 2M 範例。消融研究顯示，CFT 對有雜訊的回應來源和教師批判模型具有穩健性。透過這些發現，我們主張基於批判的訓練提供更有效的替代方案，以推進語言模型的推理。</paragraph>", "author": "Yubo Wang et.al.", "authors": "Yubo Wang, Xiang Yue, Wenhu Chen", "id": "2501.17703v1", "paper_url": "http://arxiv.org/abs/2501.17703v1", "repo": "null"}}