{"2407.08989": {"publish_time": "2024-07-12", "title": "Robustness of LLMs to Perturbations in Text", "paper_summary": "Having a clean dataset has been the foundational assumption of most natural\nlanguage processing (NLP) systems. However, properly written text is rarely\nfound in real-world scenarios and hence, oftentimes invalidates the\naforementioned foundational assumption. Recently, Large language models (LLMs)\nhave shown impressive performance, but can they handle the inevitable noise in\nreal-world data? This work tackles this critical question by investigating\nLLMs' resilience against morphological variations in text. To that end, we\nartificially introduce varying levels of noise into a diverse set of datasets\nand systematically evaluate LLMs' robustness against the corrupt variations of\nthe original text. Our findings show that contrary to popular beliefs,\ngenerative LLMs are quiet robust to noisy perturbations in text. This is a\ndeparture from pre-trained models like BERT or RoBERTa whose performance has\nbeen shown to be sensitive to deteriorating noisy text. Additionally, we test\nLLMs' resilience on multiple real-world benchmarks that closely mimic commonly\nfound errors in the wild. With minimal prompting, LLMs achieve a new\nstate-of-the-art on the benchmark tasks of Grammar Error Correction (GEC) and\nLexical Semantic Change (LSC). To empower future research, we also release a\ndataset annotated by humans stating their preference for LLM vs.\nhuman-corrected outputs along with the code to reproduce our results.", "paper_summary_zh": "<paragraph>擁有乾淨的資料集一直是大多數自然語言處理 (NLP) 系統的基本假設。然而，在現實世界的場景中很少會發現寫得很好的文字，因此，這常常會使上述的基本假設失效。最近，大型語言模型 (LLM) 已經展現出令人印象深刻的效能，但是它們能處理現實世界資料中難以避免的雜訊嗎？這項研究透過調查 LLM 對文字形態變化所展現的韌性，來探討這個關鍵問題。為此，我們人工在各種不同的資料集中加入不同程度的雜訊，並系統性地評估 LLM 對原始文字的錯誤變形的穩健性。我們的研究結果顯示，與普遍的看法相反，生成式 LLM 對於文字中的雜訊擾動相當穩健。這與 BERT 或 RoBERTa 等預先訓練的模型不同，已證實其效能會受到雜訊文字惡化的影響。此外，我們在多個現實世界的基準上測試 LLM 的韌性，這些基準緊密模擬在野外常見的錯誤。在最少的提示下，LLM 在語法錯誤校正 (GEC) 和詞彙語義改變 (LSC) 的基準任務上達到了新的最先進水準。為了賦能未來的研究，我們也釋出一個由人類標註的資料集，說明他們偏好 LLM 或人為校正的輸出，以及用於重現我們結果的程式碼。</paragraph>", "author": "Ayush Singh et.al.", "authors": "Ayush Singh, Navpreet Singh, Shubham Vatsal", "id": "2407.08989v1", "paper_url": "http://arxiv.org/abs/2407.08989v1", "repo": "null"}}