{"2405.10129": {"publish_time": "2024-05-16", "title": "StyloAI: Distinguishing AI-Generated Content with Stylometric Analysis", "paper_summary": "The emergence of large language models (LLMs) capable of generating realistic\ntexts and images has sparked ethical concerns across various sectors. In\nresponse, researchers in academia and industry are actively exploring methods\nto distinguish AI-generated content from human-authored material. However, a\ncrucial question remains: What are the unique characteristics of AI-generated\ntext? Addressing this gap, this study proposes StyloAI, a data-driven model\nthat uses 31 stylometric features to identify AI-generated texts by applying a\nRandom Forest classifier on two multi-domain datasets. StyloAI achieves\naccuracy rates of 81% and 98% on the test set of the AuTextification dataset\nand the Education dataset, respectively. This approach surpasses the\nperformance of existing state-of-the-art models and provides valuable insights\ninto the differences between AI-generated and human-authored texts.", "paper_summary_zh": "隨著能夠產生逼真文本和圖像的大語言模型 (LLM) 的出現，在各個領域中引起了道德問題。作為回應，學術界和產業中的研究人員正在積極探索區分 AI 生成的內容和人類編寫的材料的方法。然而，一個關鍵問題仍然存在：AI 生成的文本有哪些獨特特徵？為了解決這個差距，本研究提出了 StyloAI，這是一個數據驅動的模型，它使用 31 個文體特徵來識別 AI 生成的文本，方法是在兩個多領域數據集上應用隨機森林分類器。StyloAI 在 AuTextification 數據集和 Education 數據集的測試集上分別達到了 81% 和 98% 的準確率。這種方法超越了現有最先進模型的性能，並提供了對 AI 生成的文本和人類編寫的文本之間差異的寶貴見解。", "author": "Chidimma Opara et.al.", "authors": "Chidimma Opara", "id": "2405.10129v1", "paper_url": "http://arxiv.org/abs/2405.10129v1", "repo": "null"}}