{"2405.01714": {"publish_time": "2024-05-02", "title": "Interpretable Vital Sign Forecasting with Model Agnostic Attention Maps", "paper_summary": "Sepsis is a leading cause of mortality in intensive care units (ICUs),\nrepresenting a substantial medical challenge. The complexity of analyzing\ndiverse vital signs to predict sepsis further aggravates this issue. While deep\nlearning techniques have been advanced for early sepsis prediction, their\n'black-box' nature obscures the internal logic, impairing interpretability in\ncritical settings like ICUs. This paper introduces a framework that combines a\ndeep learning model with an attention mechanism that highlights the critical\ntime steps in the forecasting process, thus improving model interpretability\nand supporting clinical decision-making. We show that the attention mechanism\ncould be adapted to various black box time series forecasting models such as\nN-HiTS and N-BEATS. Our method preserves the accuracy of conventional deep\nlearning models while enhancing interpretability through\nattention-weight-generated heatmaps. We evaluated our model on the eICU-CRD\ndataset, focusing on forecasting vital signs for sepsis patients. We assessed\nits performance using mean squared error (MSE) and dynamic time warping (DTW)\nmetrics. We explored the attention maps of N-HiTS and N-BEATS, examining the\ndifferences in their performance and identifying crucial factors influencing\nvital sign forecasting.", "paper_summary_zh": "敗血症是加護病房 (ICU) 中的主要死亡原因，\n構成重大的醫療挑戰。分析多元生命徵象以預測敗血症的複雜性進一步加劇了這個問題。儘管深度學習技術已進步到可以早期預測敗血症，但其「黑箱」性質模糊了內部邏輯，損害了在 ICU 等關鍵環境中的可解釋性。本文介紹了一個框架，結合深度學習模型與注意力機制，強調預測過程中關鍵的時間步驟，從而提高模型的可解釋性，並支持臨床決策制定。我們展示了注意力機制可以適應各種黑箱時間序列預測模型，例如 N-HiTS 和 N-BEATS。我們的模型保留了傳統深度學習模型的準確性，同時透過注意力權重產生的熱圖增強了解性。我們在 eICU-CRD 資料集上評估我們的模型，重點預測敗血症患者的生命徵象。我們使用均方誤差 (MSE) 和動態時間規整 (DTW) 指標評估其性能。我們探討了 N-HiTS 和 N-BEATS 的注意力圖，檢視其性能差異，並找出影響生命徵象預測的關鍵因素。", "author": "Yuwei Liu et.al.", "authors": "Yuwei Liu, Chen Dan, Anubhav Bhatti, Bingjie Shen, Divij Gupta, Suraj Parmar, San Lee", "id": "2405.01714v2", "paper_url": "http://arxiv.org/abs/2405.01714v2", "repo": "null"}}