{"2408.02600": {"publish_time": "2024-08-05", "title": "BioMamba: A Pre-trained Biomedical Language Representation Model Leveraging Mamba", "paper_summary": "The advancement of natural language processing (NLP) in biology hinges on\nmodels' ability to interpret intricate biomedical literature. Traditional\nmodels often struggle with the complex and domain-specific language in this\nfield. In this paper, we present BioMamba, a pre-trained model specifically\ndesigned for biomedical text mining. BioMamba builds upon the Mamba\narchitecture and is pre-trained on an extensive corpus of biomedical\nliterature. Our empirical studies demonstrate that BioMamba significantly\noutperforms models like BioBERT and general-domain Mamba across various\nbiomedical tasks. For instance, BioMamba achieves a 100 times reduction in\nperplexity and a 4 times reduction in cross-entropy loss on the BioASQ test\nset. We provide an overview of the model architecture, pre-training process,\nand fine-tuning techniques. Additionally, we release the code and trained model\nto facilitate further research.", "paper_summary_zh": "自然語言處理 (NLP) 在生物學中的進展取決於\n模型詮釋複雜生物醫學文獻的能力。傳統\n模型經常難以應付這個領域中複雜且領域特定的語言。在本文中，我們提出 BioMamba，一種專門\n設計用於生物醫學文本探勘的預訓練模型。BioMamba 建立在 Mamba\n架構之上，並在大量的生物醫學預訓練\n文獻上進行預訓練。我們的實證研究證明，BioMamba 在各種\n生物醫學任務上都明顯優於 BioBERT 和一般領域的 Mamba。例如，BioMamba 在 BioASQ 測試\n集中將困惑度降低了 100 倍，並將交叉熵損失降低了 4 倍。我們提供了模型架構、預訓練流程的概述，\n以及微調技術。此外，我們釋出程式碼和訓練好的模型\n以促進進一步的研究。", "author": "Ling Yue et.al.", "authors": "Ling Yue, Sixue Xing, Yingzhou Lu, Tianfan Fu", "id": "2408.02600v1", "paper_url": "http://arxiv.org/abs/2408.02600v1", "repo": "null"}}