{"2501.03643": {"publish_time": "2025-01-07", "title": "Effective and Efficient Mixed Precision Quantization of Speech Foundation Models", "paper_summary": "This paper presents a novel mixed-precision quantization approach for speech\nfoundation models that tightly integrates mixed-precision learning and\nquantized model parameter estimation into one single model compression stage.\nExperiments conducted on LibriSpeech dataset with fine-tuned wav2vec2.0-base\nand HuBERT-large models suggest the resulting mixed-precision quantized models\nincreased the lossless compression ratio by factors up to 1.7x and 1.9x over\nthe respective uniform-precision and two-stage mixed-precision quantized\nbaselines that perform precision learning and model parameters quantization in\nseparate and disjointed stages, while incurring no statistically word error\nrate (WER) increase over the 32-bit full-precision models. The system\ncompression time of wav2vec2.0-base and HuBERT-large models is reduced by up to\n1.9 and 1.5 times over the two-stage mixed-precision baselines, while both\nproduce lower WERs. The best-performing 3.5-bit mixed-precision quantized\nHuBERT-large model produces a lossless compression ratio of 8.6x over the\n32-bit full-precision system.", "paper_summary_zh": "本文提出了一种新颖的混合精度量化方法，用于语音基础模型，将混合精度学习和量化模型参数估计紧密集成到一个模型压缩阶段。在经过微调的 wav2vec2.0-base 和 HuBERT-large 模型上进行的 LibriSpeech 数据集实验表明，由此产生的混合精度量化模型将无损压缩比提高了 1.7 倍和 1.9 倍，分别高于执行精度学习和模型参数量化的统一精度和两阶段混合精度量化基线。在单独和不连续的阶段，同时不会增加 32 位全精度模型的统计词错误率 (WER)。wav2vec2.0-base 和 HuBERT-large 模型的系统压缩时间比两阶段混合精度基线减少了 1.9 倍和 1.5 倍，同时两者都产生了较低的 WER。性能最好的 3.5 位混合精度量化 HuBERT-large 模型对 32 位全精度系统产生了 8.6 倍的无损压缩比。", "author": "Haoning Xu et.al.", "authors": "Haoning Xu, Zhaoqing Li, Zengrui Jin, Huimeng Wang, Youjun Chen, Guinan Li, Mengzhe Geng, Shujie Hu, Jiajun Deng, Xunying Liu", "id": "2501.03643v1", "paper_url": "http://arxiv.org/abs/2501.03643v1", "repo": "null"}}