{"2405.17900": {"publish_time": "2024-05-28", "title": "Enhancing Emotion Recognition in Conversation through Emotional Cross-Modal Fusion and Inter-class Contrastive Learning", "paper_summary": "The purpose of emotion recognition in conversation (ERC) is to identify the\nemotion category of an utterance based on contextual information. Previous ERC\nmethods relied on simple connections for cross-modal fusion and ignored the\ninformation differences between modalities, resulting in the model being unable\nto focus on modality-specific emotional information. At the same time, the\nshared information between modalities was not processed to generate emotions.\nInformation redundancy problem. To overcome these limitations, we propose a\ncross-modal fusion emotion prediction network based on vector connections. The\nnetwork mainly includes two stages: the multi-modal feature fusion stage based\non connection vectors and the emotion classification stage based on fused\nfeatures. Furthermore, we design a supervised inter-class contrastive learning\nmodule based on emotion labels. Experimental results confirm the effectiveness\nof the proposed method, demonstrating excellent performance on the IEMOCAP and\nMELD datasets.", "paper_summary_zh": "對話中情緒辨識（ERC）的目的是根據脈絡資訊辨識發話的情緒類別。先前 ERC 方法仰賴簡單的連結進行跨模態融合，且忽略了模態之間資訊的差異，導致模型無法專注於模態特定的情緒資訊。同時，模態之間的共用資訊並未經過處理以產生情緒，造成資訊冗餘問題。為了克服這些限制，我們提出一個基於向量連結的跨模態融合情緒預測網路。該網路主要包含兩個階段：基於連結向量的多模態特徵融合階段，以及基於融合特徵的情緒分類階段。此外，我們設計了一個基於情緒標籤的監督式類間對比學習模組。實驗結果證實了所提出方法的有效性，在 IEMOCAP 和 MELD 資料集上展現出優異的效能。", "author": "Haoxiang Shi et.al.", "authors": "Haoxiang Shi, Xulong Zhang, Ning Cheng, Yong Zhang, Jun Yu, Jing Xiao, Jianzong Wang", "id": "2405.17900v1", "paper_url": "http://arxiv.org/abs/2405.17900v1", "repo": "null"}}