{"2411.07975": {"publish_time": "2024-11-12", "title": "JanusFlow: Harmonizing Autoregression and Rectified Flow for Unified Multimodal Understanding and Generation", "paper_summary": "We present JanusFlow, a powerful framework that unifies image understanding\nand generation in a single model. JanusFlow introduces a minimalist\narchitecture that integrates autoregressive language models with rectified\nflow, a state-of-the-art method in generative modeling. Our key finding\ndemonstrates that rectified flow can be straightforwardly trained within the\nlarge language model framework, eliminating the need for complex architectural\nmodifications. To further improve the performance of our unified model, we\nadopt two key strategies: (i) decoupling the understanding and generation\nencoders, and (ii) aligning their representations during unified training.\nExtensive experiments show that JanusFlow achieves comparable or superior\nperformance to specialized models in their respective domains, while\nsignificantly outperforming existing unified approaches across standard\nbenchmarks. This work represents a step toward more efficient and versatile\nvision-language models.", "paper_summary_zh": "我們提出 JanusFlow，一個強大的框架，它統一了圖像理解和生成在單一模型中。JanusFlow 採用了一個極簡主義架構，它整合了自回歸語言模型與校正流，一種生成模型中的最先進方法。我們的關鍵發現證明了校正流可以在大型語言模型框架內直接進行訓練，消除了對複雜架構修改的需求。為了進一步提升我們統一模型的效能，我們採用了兩個關鍵策略：(i) 解耦理解和生成編碼器，以及 (ii) 在統一訓練期間對齊它們的表示。大量的實驗表明，JanusFlow 在各自領域中達到了與專業模型相當或更優異的效能，同時在標準基準測試中顯著優於現有的統一方法。這項工作代表了朝向更有效率且多功能的視覺語言模型邁出了一步。", "author": "Yiyang Ma et.al.", "authors": "Yiyang Ma, Xingchao Liu, Xiaokang Chen, Wen Liu, Chengyue Wu, Zhiyu Wu, Zizheng Pan, Zhenda Xie, Haowei Zhang, Xingkai yu, Liang Zhao, Yisong Wang, Jiaying Liu, Chong Ruan", "id": "2411.07975v1", "paper_url": "http://arxiv.org/abs/2411.07975v1", "repo": "null"}}