{"2501.03191": {"publish_time": "2025-01-06", "title": "CLIX: Cross-Lingual Explanations of Idiomatic Expressions", "paper_summary": "Automated definition generation systems have been proposed to support\nvocabulary expansion for language learners. The main barrier to the success of\nthese systems is that learners often struggle to understand definitions due to\nthe presence of potentially unfamiliar words and grammar, particularly when\nnon-standard language is involved. To address these challenges, we propose\nCLIX, the task of Cross-Lingual explanations of Idiomatic eXpressions. We\nexplore the capabilities of current NLP models for this task, and observe that\nwhile it remains challenging, large language models show promise. Finally, we\nperform a detailed error analysis to highlight the key challenges that need to\nbe addressed before we can reliably incorporate these systems into educational\ntools.", "paper_summary_zh": "自動定義產生系統已被提議用於支援語言學習者的詞彙擴充。這些系統成功的最大障礙是，學習者經常難以理解定義，原因在於存在潛在不熟悉的字詞和文法，特別是在涉及非標準語言時。為了應對這些挑戰，我們提出 CLIX，即慣用語的跨語言解釋任務。我們探討了當前 NLP 模型對此任務的能力，並觀察到儘管這仍然具有挑戰性，但大型語言模型展現了前景。最後，我們執行詳細的錯誤分析，以強調在我們能夠將這些系統可靠地整合到教育工具之前需要應對的主要挑戰。", "author": "Aaron Gluck et.al.", "authors": "Aaron Gluck, Katharina von der Wense, Maria Pacheco", "id": "2501.03191v1", "paper_url": "http://arxiv.org/abs/2501.03191v1", "repo": "null"}}