{"2406.17962": {"publish_time": "2024-06-25", "title": "SimsChat: A Customisable Persona-Driven Role-Playing Agent", "paper_summary": "Large Language Models (LLMs) possess the remarkable capability to understand\nhuman instructions and generate high-quality text, enabling them to act as\nagents that simulate human behaviours. This capability allows LLMs to emulate\nhuman beings in a more advanced manner, beyond merely replicating simple human\nbehaviours. However, there is a lack of exploring into leveraging LLMs to craft\ncharacters from several aspects. In this work, we introduce the Customisable\nConversation Agent Framework, which employs LLMs to simulate real-world\ncharacters that can be freely customised according to different user\npreferences. The customisable framework is helpful for designing customisable\ncharacters and role-playing agents according to human's preferences. We first\npropose the SimsConv dataset, which comprises 68 different customised\ncharacters, 1,360 multi-turn role-playing dialogues, and encompasses 13,971\ninteraction dialogues in total. The characters are created from several\nreal-world elements, such as career, aspiration, trait, and skill. Building on\nthese foundations, we present SimsChat, a freely customisable role-playing\nagent. It incorporates different real-world scenes and topic-specific character\ninteraction dialogues, simulating characters' life experiences in various\nscenarios and topic-specific interactions with specific emotions. Experimental\nresults show that our proposed framework achieves desirable performance and\nprovides helpful guideline for building better simulacra of human beings in the\nfuture. Our data and code are available at\nhttps://github.com/Bernard-Yang/SimsChat.", "paper_summary_zh": "大型語言模型 (LLM) 擁有理解人類指令並產生高品質文字的卓越能力，讓它們能夠充當模擬人類行為的代理人。此能力讓 LLM 能夠以更進階的方式模擬人類，而不仅仅是複製簡單的人類行為。然而，目前缺乏探索利用 LLM 從多個方面打造角色。在這項工作中，我們介紹了可自訂對話代理程式架構，它採用 LLM 來模擬真實世界角色，這些角色可以根據不同的使用者偏好自由自訂。此可自訂架構有助於根據人類的偏好設計可自訂角色和角色扮演代理程式。我們首先提出 SimsConv 資料集，其中包含 68 個不同的自訂角色、1,360 個多輪角色扮演對話，並總共包含 13,971 個互動對話。這些角色是根據多種真實世界元素建立的，例如職業、抱負、特質和技能。在這些基礎上，我們展示了 SimsChat，一個自由可自訂的角色扮演代理程式。它結合了不同的真實世界場景和特定主題的角色互動對話，模擬角色在各種場景中的生活經驗和與特定情緒的特定主題互動。實驗結果顯示，我們提出的架構達到了理想的效能，並為在未來建立更佳的人類模擬提供有用的準則。我們的資料和程式碼可以在 https://github.com/Bernard-Yang/SimsChat 取得。", "author": "Bohao Yang et.al.", "authors": "Bohao Yang, Dong Liu, Chen Tang, Chenghao Xiao, Kun Zhao, Chao Li, Lin Yuan, Guang Yang, Lanxiao Huang, Chenghua Lin", "id": "2406.17962v1", "paper_url": "http://arxiv.org/abs/2406.17962v1", "repo": "https://github.com/bernard-yang/simschat"}}