{"2407.09311": {"publish_time": "2024-07-12", "title": "Scalability of Bayesian Network Structure Elicitation with Large Language Models: a Novel Methodology and Comparative Analysis", "paper_summary": "In this work, we propose a novel method for Bayesian Networks (BNs) structure\nelicitation that is based on the initialization of several LLMs with different\nexperiences, independently querying them to create a structure of the BN, and\nfurther obtaining the final structure by majority voting. We compare the method\nwith one alternative method on various widely and not widely known BNs of\ndifferent sizes and study the scalability of both methods on them. We also\npropose an approach to check the contamination of BNs in LLM, which shows that\nsome widely known BNs are inapplicable for testing the LLM usage for BNs\nstructure elicitation. We also show that some BNs may be inapplicable for such\nexperiments because their node names are indistinguishable. The experiments on\nthe other BNs show that our method performs better than the existing method\nwith one of the three studied LLMs; however, the performance of both methods\nsignificantly decreases with the increase in BN size.", "paper_summary_zh": "在這項工作中，我們提出了一種貝氏網路 (BN) 結構引導的新方法，它基於初始化具有不同經驗的幾個 LLM，獨立查詢它們以建立 BN 的結構，並進一步通過多數投票獲得最終結構。我們將該方法與各種廣泛已知和不廣泛已知的不同大小的 BN 上的一種替代方法進行比較，並研究了這兩種方法在它們上的可擴展性。我們還提出了一種檢查 LLM 中 BN 污染的方法，該方法表明一些廣泛已知的 BN 不適用於測試 LLM 用於 BN 結構引導。我們還表明，一些 BN 可能不適用於此類實驗，因為它們的節點名稱無法區分。在其他 BN 上的實驗表明，我們的模型比現有模型的表現更好，使用三個研究的 LLM 中的一個；然而，隨著 BN 大小的增加，兩種方法的表現都顯著下降。", "author": "Nikolay Babakov et.al.", "authors": "Nikolay Babakov, Ehud Reiter, Alberto Bugarin", "id": "2407.09311v1", "paper_url": "http://arxiv.org/abs/2407.09311v1", "repo": "null"}}