{"2407.14344": {"publish_time": "2024-07-19", "title": "LLMs left, right, and center: Assessing GPT's capabilities to label political bias from web domains", "paper_summary": "This research investigates whether OpenAI's GPT-4, a state-of-the-art large\nlanguage model, can accurately classify the political bias of news sources\nbased solely on their URLs. Given the subjective nature of political labels,\nthird-party bias ratings like those from Ad Fontes Media, AllSides, and Media\nBias/Fact Check (MBFC) are often used in research to analyze news source\ndiversity. This study aims to determine if GPT-4 can replicate these human\nratings on a seven-degree scale (\"far-left\" to \"far-right\"). The analysis\ncompares GPT-4's classifications against MBFC's, and controls for website\npopularity using Open PageRank scores. Findings reveal a high correlation\n($\\text{Spearman's } \\rho = .89$, $n = 5,877$, $p < 0.001$) between GPT-4's and\nMBFC's ratings, indicating the model's potential reliability. However, GPT-4\nabstained from classifying approximately $\\frac{2}{3}$ of the dataset,\nparticularly less popular and less biased sources. The study also identifies a\nslight leftward skew in GPT-4's classifications compared to MBFC's. The\nanalysis suggests that while GPT-4 can be a scalable, cost-effective tool for\npolitical bias classification of news websites, but its use should complement\nhuman judgment to mitigate biases. Further research is recommended to explore\nthe model's performance across different settings, languages, and additional\ndatasets.", "paper_summary_zh": "這項研究探討 OpenAI 的 GPT-4，一種最先進的大語言模型，是否能僅根據新聞來源的網址準確分類其政治偏見。鑑於政治標籤的主觀性質，研究中經常使用 Ad Fontes Media、AllSides 和 Media Bias/Fact Check (MBFC) 等第三方偏見評分來分析新聞來源的多樣性。本研究旨在確定 GPT-4 是否能以七級量表（「極左派」到「極右派」）複製這些人為評分。分析比較了 GPT-4 的分類與 MBFC 的分類，並使用 Open PageRank 分數控制網站的熱門程度。研究結果顯示 GPT-4 和 MBFC 的評分之間具有高度相關性（斯皮爾曼 $\\rho = .89$，$n = 5,877$，$p < 0.001$），這表示該模型的潛在可靠性。然而，GPT-4 避免分類約 $\\frac{2}{3}$ 的資料集，特別是不太熱門且不太有偏見的來源。本研究也發現 GPT-4 的分類與 MBFC 的分類相比，略微偏左。分析顯示，儘管 GPT-4 可以成為新聞網站政治偏見分類的可擴充、具成本效益的工具，但其使用應補充人為判斷以減輕偏見。建議進一步研究以探討該模型在不同設定、語言和額外資料集中的效能。", "author": "Raphael Hernandes et.al.", "authors": "Raphael Hernandes", "id": "2407.14344v1", "paper_url": "http://arxiv.org/abs/2407.14344v1", "repo": "null"}}