{"2408.01935": {"publish_time": "2024-08-04", "title": "Defining and Evaluating Decision and Composite Risk in Language Models Applied to Natural Language Inference", "paper_summary": "Despite their impressive performance, large language models (LLMs) such as\nChatGPT are known to pose important risks. One such set of risks arises from\nmisplaced confidence, whether over-confidence or under-confidence, that the\nmodels have in their inference. While the former is well studied, the latter is\nnot, leading to an asymmetry in understanding the comprehensive risk of the\nmodel based on misplaced confidence. In this paper, we address this asymmetry\nby defining two types of risk (decision and composite risk), and proposing an\nexperimental framework consisting of a two-level inference architecture and\nappropriate metrics for measuring such risks in both discriminative and\ngenerative LLMs. The first level relies on a decision rule that determines\nwhether the underlying language model should abstain from inference. The second\nlevel (which applies if the model does not abstain) is the model's inference.\nDetailed experiments on four natural language commonsense reasoning datasets\nusing both an open-source ensemble-based RoBERTa model and ChatGPT, demonstrate\nthe practical utility of the evaluation framework. For example, our results\nshow that our framework can get an LLM to confidently respond to an extra 20.1%\nof low-risk inference tasks that other methods might misclassify as high-risk,\nand skip 19.8% of high-risk tasks, which would have been answered incorrectly.", "paper_summary_zh": "儘管大型語言模型 (LLM) 例如 ChatGPT 擁有令人印象深刻的表現，但已知會造成重要的風險。其中一組風險源自於模型在推論中出現的錯誤信心，無論是過度自信或過度不自信。前者已被廣泛研究，後者則否，導致在了解模型基於錯誤信心的全面風險時出現不對稱。在本文中，我們透過定義兩種風險（決策風險和複合風險）來解決這個不對稱，並提出一個實驗架構，包括一個二層推論架構和適當的指標，用於衡量判別式和生成式 LLM 中的這兩種風險。第一層依賴於一個決策規則，用於決定底層語言模型是否應棄權推論。第二層（如果模型不棄權則適用）是模型的推論。使用開源的基於集合的 RoBERTa 模型和 ChatGPT，在四個自然語言常識推理資料集上進行的詳細實驗，證明了評估架構的實用性。例如，我們的結果顯示，我們的架構可以讓 LLM 自信地回應額外的 20.1% 的低風險推論任務，而其他方法可能會將其錯誤分類為高風險，並略過 19.8% 的高風險任務，而這些任務可能會被回答錯誤。", "author": "Ke Shen et.al.", "authors": "Ke Shen, Mayank Kejriwal", "id": "2408.01935v1", "paper_url": "http://arxiv.org/abs/2408.01935v1", "repo": "null"}}