{"2503.15576": {"publish_time": "2025-03-19", "title": "A Bird Song Detector for improving bird identification through Deep Learning: a case study from Doñana", "paper_summary": "Passive Acoustic Monitoring with automatic recorders is essential for\necosystem conservation but generates vast unsupervised audio data, posing\nchallenges for extracting meaningful information. Deep Learning techniques\noffer a promising solution. BirdNET, a widely used model for bird\nidentification, has shown success in many study systems but is limited in some\nregions due to biases in its training data. A key challenge in bird species\ndetection is that many recordings either lack target species or contain\noverlapping vocalizations. To overcome these problems, we developed a\nmulti-stage pipeline for automatic bird vocalization identification in Do\\~nana\nNational Park (SW Spain), a region facing significant conservation threats. Our\napproach included a Bird Song Detector to isolate vocalizations and custom\nclassifiers trained with BirdNET embeddings. We manually annotated 461 minutes\nof audio from three habitats across nine locations, yielding 3,749 annotations\nfor 34 classes. Spectrograms facilitated the use of image processing\ntechniques. Applying the Bird Song Detector before classification improved\nspecies identification, as all classification models performed better when\nanalyzing only the segments where birds were detected. Specifically, the\ncombination of the Bird Song Detector and fine-tuned BirdNET compared to the\nbaseline without the Bird Song Detector. Our approach demonstrated the\neffectiveness of integrating a Bird Song Detector with fine-tuned\nclassification models for bird identification at local soundscapes. These\nfindings highlight the need to adapt general-purpose tools for specific\necological challenges, as demonstrated in Do\\~nana. Automatically detecting\nbird species serves for tracking the health status of this threatened\necosystem, given the sensitivity of birds to environmental changes, and helps\nin the design of conservation measures for reducing biodiversity loss", "paper_summary_zh": "<paragraph>使用自動錄音機進行被動聲學監測對於生態系統保育至關重要，但會產生大量的無監督音頻數據，對於提取有意義的信息構成挑戰。深度學習技術提供了一個很有希望的解決方案。BirdNET 是一種廣泛使用的鳥類識別模型，已在許多研究系統中取得成功，但由於其訓練數據的偏差，在某些地區受到限制。鳥類物種檢測的一個關鍵挑戰是，許多錄音要么缺少目標物種，要么包含重疊的發聲。為了克服這些問題，我們為西班牙西南部多納納國家公園（面臨重大保育威脅的地區）的鳥類發聲自動識別開發了一個多階段流程。我們的方法包括一個鳥鳴檢測器來隔離發聲，以及使用 BirdNET 嵌入訓練的定制分類器。我們手動標記了來自九個地點、三個棲息地的 461 分鐘音頻，產生了 34 個類別的 3,749 個標記。頻譜圖促進了圖像處理技術的使用。在分類之前應用鳥鳴檢測器提高了物種識別的準確性，因為所有分類模型在僅分析檢測到鳥類的片段時表現更好。具體來說，是鳥鳴檢測器和微調 BirdNET 的組合與沒有鳥鳴檢測器的基準相比。我們的方法證明了將鳥鳴檢測器與微調分類模型相結合，對於在當地聲景中識別鳥類的有效性。這些發現突出了針對特定生態挑戰調整通用工具的需求，正如在多納納所展示的那樣。鑑於鳥類對環境變化的敏感性，自動檢測鳥類物種有助於追蹤這個受威脅生態系統的健康狀況，並有助於設計減少生物多樣性喪失的保育措施。</paragraph>\n", "author": "Alba Márquez-Rodríguez et.al.", "authors": "Alba Márquez-Rodríguez, Miguel Ángel Mohedano-Munoz, Manuel J. Marín-Jiménez, Eduardo Santamaría-García, Giulia Bastianelli, Pedro Jordano, Irene Mendoza", "id": "2503.15576v1", "paper_url": "http://arxiv.org/abs/2503.15576v1", "repo": "https://github.com/GrunCrow/BIRDeep_BirdSongDetector_NeuralNetworks"}}