{"2306.01668": {"publish_time": "2023-06-02", "title": "XAI Renaissance: Redefining Interpretability in Medical Diagnostic Models", "paper_summary": "As machine learning models become increasingly prevalent in medical\ndiagnostics, the need for interpretability and transparency becomes paramount.\nThe XAI Renaissance signifies a significant shift in the field, aiming to\nredefine the interpretability of medical diagnostic models. This paper explores\nthe innovative approaches and methodologies within the realm of Explainable AI\n(XAI) that are revolutionizing the interpretability of medical diagnostic\nmodels. By shedding light on the underlying decision-making process, XAI\ntechniques empower healthcare professionals to understand, trust, and\neffectively utilize these models for accurate and reliable medical diagnoses.\nThis review highlights the key advancements in XAI for medical diagnostics and\ntheir potential to transform the healthcare landscape, ultimately improving\npatient outcomes and fostering trust in AI-driven diagnostic systems.", "paper_summary_zh": "隨著機器學習模型在醫療診斷中越來越普遍，可解釋性和透明度的需求變得至關重要。XAI 復興標誌著該領域的重大轉變，旨在重新定義醫療診斷模型的可解釋性。本文探討了可解釋 AI (XAI) 領域內的創新方法和方法論，這些方法和方法論正在革新醫療診斷模型的可解釋性。通過闡明基礎決策制定過程，XAI 技術使醫療保健專業人員能夠理解、信任並有效地利用這些模型進行準確且可靠的醫療診斷。本綜述重點介紹了 XAI 在醫療診斷方面的關鍵進展及其轉變醫療保健領域的潛力，最終改善患者的治療效果並培養對 AI 驅動的診斷系統的信任。", "author": "Sujith K Mandala et.al.", "authors": "Sujith K Mandala", "id": "2306.01668v1", "paper_url": "http://arxiv.org/abs/2306.01668v1", "repo": "null"}}