{"2409.08642": {"publish_time": "2024-09-13", "title": "CPL: Critical Planning Step Learning Boosts LLM Generalization in Reasoning Tasks", "paper_summary": "Post-training large language models (LLMs) to develop reasoning capabilities\nhas proven effective across diverse domains, such as mathematical reasoning and\ncode generation. However, existing methods primarily focus on improving\ntask-specific reasoning but have not adequately addressed the model's\ngeneralization capabilities across a broader range of reasoning tasks. To\ntackle this challenge, we introduce Critical Planning Step Learning (CPL),\nwhich leverages Monte Carlo Tree Search (MCTS) to explore diverse planning\nsteps in multi-step reasoning tasks. Based on long-term outcomes, CPL learns\nstep-level planning preferences to improve the model's planning capabilities\nand, consequently, its general reasoning capabilities. Furthermore, while\neffective in many scenarios for aligning LLMs, existing preference learning\napproaches like Direct Preference Optimization (DPO) struggle with complex\nmulti-step reasoning tasks due to their inability to capture fine-grained\nsupervision at each step. We propose Step-level Advantage Preference\nOptimization (Step-APO), which integrates an advantage estimate for step-level\npreference pairs obtained via MCTS into the DPO. This enables the model to more\neffectively learn critical intermediate planning steps, thereby further\nimproving its generalization in reasoning tasks. Experimental results\ndemonstrate that our method, trained exclusively on GSM8K and MATH, not only\nsignificantly improves performance on GSM8K (+10.5%) and MATH (+6.5%), but also\nenhances out-of-domain reasoning benchmarks, such as ARC-C (+4.0%), BBH\n(+1.8%), MMLU-STEM (+2.2%), and MMLU (+0.9%).", "paper_summary_zh": "<paragraph>訓練後的大語言模型 (LLM) 已證明能有效開發推理能力，涵蓋各種領域，例如數學推理和程式碼生成。然而，現有方法主要著重於改善特定任務的推理，但並未充分解決模型在更廣泛推理任務中的概化能力。為了解決這個挑戰，我們引入了「關鍵規劃步驟學習」(CPL)，它利用蒙地卡羅樹狀搜尋 (MCTS) 來探索多步驟推理任務中的不同規劃步驟。基於長期結果，CPL 學習步驟層級的規劃偏好，以改善模型的規劃能力，進而改善其一般推理能力。此外，雖然現有偏好學習方法（例如直接偏好最佳化 (DPO)）在許多情境中能有效調整 LLM，但對於複雜的多步驟推理任務卻難以應付，因為它們無法在每個步驟中擷取細緻的監督。我們提出了「步驟層級優勢偏好最佳化」(Step-APO)，它將透過 MCTS 獲得的步驟層級偏好對集成的優勢估計值納入 DPO 中。這使模型能更有效地學習關鍵的中間規劃步驟，進而進一步改善其在推理任務中的概化能力。實驗結果證明，我們的模型僅在 GSM8K 和 MATH 上接受訓練，不僅顯著提升了 GSM8K (+10.5%) 和 MATH (+6.5%) 的效能，也提升了領域外的推理基準，例如 ARC-C (+4.0%)、BBH (+1.8%)、MMLU-STEM (+2.2%) 和 MMLU (+0.9%)。</paragraph>", "author": "Tianlong Wang et.al.", "authors": "Tianlong Wang, Xueting Han, Jing Bai", "id": "2409.08642v1", "paper_url": "http://arxiv.org/abs/2409.08642v1", "repo": "null"}}