{"2405.03162": {"publish_time": "2024-05-06", "title": "Advancing Multimodal Medical Capabilities of Gemini", "paper_summary": "Many clinical tasks require an understanding of specialized data, such as\nmedical images and genomics, which is not typically found in general-purpose\nlarge multimodal models. Building upon Gemini's multimodal models, we develop\nseveral models within the new Med-Gemini family that inherit core capabilities\nof Gemini and are optimized for medical use via fine-tuning with 2D and 3D\nradiology, histopathology, ophthalmology, dermatology and genomic data.\nMed-Gemini-2D sets a new standard for AI-based chest X-ray (CXR) report\ngeneration based on expert evaluation, exceeding previous best results across\ntwo separate datasets by an absolute margin of 1% and 12%, where 57% and 96% of\nAI reports on normal cases, and 43% and 65% on abnormal cases, are evaluated as\n\"equivalent or better\" than the original radiologists' reports. We demonstrate\nthe first ever large multimodal model-based report generation for 3D computed\ntomography (CT) volumes using Med-Gemini-3D, with 53% of AI reports considered\nclinically acceptable, although additional research is needed to meet expert\nradiologist reporting quality. Beyond report generation, Med-Gemini-2D\nsurpasses the previous best performance in CXR visual question answering (VQA)\nand performs well in CXR classification and radiology VQA, exceeding SoTA or\nbaselines on 17 of 20 tasks. In histopathology, ophthalmology, and dermatology\nimage classification, Med-Gemini-2D surpasses baselines across 18 out of 20\ntasks and approaches task-specific model performance. Beyond imaging,\nMed-Gemini-Polygenic outperforms the standard linear polygenic risk score-based\napproach for disease risk prediction and generalizes to genetically correlated\ndiseases for which it has never been trained. Although further development and\nevaluation are necessary in the safety-critical medical domain, our results\nhighlight the potential of Med-Gemini across a wide range of medical tasks.", "paper_summary_zh": "", "author": "Lin Yang et.al.", "authors": "Lin Yang,Shawn Xu,Andrew Sellergren,Timo Kohlberger,Yuchen Zhou,Ira Ktena,Atilla Kiraly,Faruk Ahmed,Farhad Hormozdiari,Tiam Jaroensri,Eric Wang,Ellery Wulczyn,Fayaz Jamil,Theo Guidroz,Chuck Lau,Siyuan Qiao,Yun Liu,Akshay Goel,Kendall Park,Arnav Agharwal,Nick George,Yang Wang,Ryutaro Tanno,David G. T. Barrett,Wei-Hung Weng,S. Sara Mahdavi,Khaled Saab,Tao Tu,Sreenivasa Raju Kalidindi,Mozziyar Etemadi,Jorge Cuadros,Gregory Sorensen,Yossi Matias,Katherine Chou,Greg Corrado,Joelle Barral,Shravya Shetty,David Fleet,S. M. Ali Eslami,Daniel Tse,Shruthi Prabhakara,Cory McLean,Dave Steiner,Rory Pilgrim,Christopher Kelly,Shekoofeh Azizi,Daniel Golden", "id": "2405.03162v1", "paper_url": "http://arxiv.org/abs/2405.03162v1", "repo": "null"}}