{"2405.11551": {"publish_time": "2024-05-19", "title": "An Invisible Backdoor Attack Based On Semantic Feature", "paper_summary": "Backdoor attacks have severely threatened deep neural network (DNN) models in\nthe past several years. These attacks can occur in almost every stage of the\ndeep learning pipeline. Although the attacked model behaves normally on benign\nsamples, it makes wrong predictions for samples containing triggers. However,\nmost existing attacks use visible patterns (e.g., a patch or image\ntransformations) as triggers, which are vulnerable to human inspection. In this\npaper, we propose a novel backdoor attack, making imperceptible changes.\nConcretely, our attack first utilizes the pre-trained victim model to extract\nlow-level and high-level semantic features from clean images and generates\ntrigger pattern associated with high-level features based on channel attention.\nThen, the encoder model generates poisoned images based on the trigger and\nextracted low-level semantic features without causing noticeable feature loss.\nWe evaluate our attack on three prominent image classification DNN across three\nstandard datasets. The results demonstrate that our attack achieves high attack\nsuccess rates while maintaining robustness against backdoor defenses.\nFurthermore, we conduct extensive image similarity experiments to emphasize the\nstealthiness of our attack strategy.", "paper_summary_zh": "在過去幾年中，後門攻擊嚴重威脅到深度神經網路（DNN）模型。這些攻擊幾乎可以在深度學習管線的每個階段發生。儘管被攻擊的模型對良性樣本表現正常，但它對包含觸發器的樣本做出錯誤的預測。然而，大多數現有的攻擊使用可見模式（例如，修補程式或影像轉換）作為觸發器，這些觸發器容易受到人為檢查。在本文中，我們提出了一種新穎的後門攻擊，進行難以察覺的改變。具體來說，我們的攻擊首先利用預訓練的受害者模型從乾淨的影像中提取低階和高階語義特徵，並根據通道注意力生成與高階特徵相關的觸發模式。然後，編碼器模型根據觸發器和提取的低階語義特徵生成中毒影像，而不會造成明顯的特徵損失。我們在三個標準資料集上對三個著名的影像分類 DNN 評估我們的攻擊。結果表明，我們的攻擊實現了很高的攻擊成功率，同時保持了對後門防禦的魯棒性。此外，我們進行了廣泛的影像相似度實驗，以強調我們的攻擊策略的隱蔽性。", "author": "Yangming Chen et.al.", "authors": "Yangming Chen", "id": "2405.11551v1", "paper_url": "http://arxiv.org/abs/2405.11551v1", "repo": "null"}}