{"2501.07391": {"publish_time": "2025-01-13", "title": "Enhancing Retrieval-Augmented Generation: A Study of Best Practices", "paper_summary": "Retrieval-Augmented Generation (RAG) systems have recently shown remarkable\nadvancements by integrating retrieval mechanisms into language models,\nenhancing their ability to produce more accurate and contextually relevant\nresponses. However, the influence of various components and configurations\nwithin RAG systems remains underexplored. A comprehensive understanding of\nthese elements is essential for tailoring RAG systems to complex retrieval\ntasks and ensuring optimal performance across diverse applications. In this\npaper, we develop several advanced RAG system designs that incorporate query\nexpansion, various novel retrieval strategies, and a novel Contrastive\nIn-Context Learning RAG. Our study systematically investigates key factors,\nincluding language model size, prompt design, document chunk size, knowledge\nbase size, retrieval stride, query expansion techniques, Contrastive In-Context\nLearning knowledge bases, multilingual knowledge bases, and Focus Mode\nretrieving relevant context at sentence-level. Through extensive\nexperimentation, we provide a detailed analysis of how these factors influence\nresponse quality. Our findings offer actionable insights for developing RAG\nsystems, striking a balance between contextual richness and\nretrieval-generation efficiency, thereby paving the way for more adaptable and\nhigh-performing RAG frameworks in diverse real-world scenarios. Our code and\nimplementation details are publicly available.", "paper_summary_zh": "檢索增強生成（RAG）系統最近透過將檢索機制整合到語言模型中，展現了顯著的進展，提升了它們產生更準確且與脈絡相關回應的能力。然而，各種元件和配置在 RAG 系統中的影響仍未獲得充分探討。全面了解這些元素對於調整 RAG 系統以符合複雜的檢索任務，並確保在各種應用中達到最佳效能至關重要。在本文中，我們開發了幾個進階的 RAG 系統設計，納入了查詢擴充、各種新穎的檢索策略，以及一個新穎的對比式脈絡學習 RAG。我們的研究系統性地探討了關鍵因素，包括語言模型大小、提示設計、文件區塊大小、知識庫大小、檢索步幅、查詢擴充技術、對比式脈絡學習知識庫、多語言知識庫，以及在句子層級檢索相關脈絡的焦點模式。透過廣泛的實驗，我們提供了這些因素如何影響回應品質的詳細分析。我們的研究結果為開發 RAG 系統提供了可操作的見解，在脈絡豐富性和檢索產生效率之間取得平衡，從而為在各種真實世界場景中更具適應性和高性能的 RAG 框架鋪平道路。我們的程式碼和實作細節公開提供。", "author": "Siran Li et.al.", "authors": "Siran Li, Linus Stenzel, Carsten Eickhoff, Seyed Ali Bahrainian", "id": "2501.07391v1", "paper_url": "http://arxiv.org/abs/2501.07391v1", "repo": "https://github.com/ali-bahrainian/rag_best_practices"}}