{"2410.09037": {"publish_time": "2024-10-11", "title": "Mentor-KD: Making Small Language Models Better Multi-step Reasoners", "paper_summary": "Large Language Models (LLMs) have displayed remarkable performances across\nvarious complex tasks by leveraging Chain-of-Thought (CoT) prompting. Recently,\nstudies have proposed a Knowledge Distillation (KD) approach, reasoning\ndistillation, which transfers such reasoning ability of LLMs through\nfine-tuning language models of multi-step rationales generated by LLM teachers.\nHowever, they have inadequately considered two challenges regarding\ninsufficient distillation sets from the LLM teacher model, in terms of 1) data\nquality and 2) soft label provision. In this paper, we propose Mentor-KD, which\neffectively distills the multi-step reasoning capability of LLMs to smaller LMs\nwhile addressing the aforementioned challenges. Specifically, we exploit a\nmentor, intermediate-sized task-specific fine-tuned model, to augment\nadditional CoT annotations and provide soft labels for the student model during\nreasoning distillation. We conduct extensive experiments and confirm\nMentor-KD's effectiveness across various models and complex reasoning tasks.", "paper_summary_zh": "大型語言模型 (LLM) 透過利用思考鏈 (CoT) 提示在各種複雜任務中展現出卓越的表現。最近，研究提出了一種知識蒸餾 (KD) 方法，即推理蒸餾，它透過微調 LLM 教師產生的多步驟依據語言模型來傳遞 LLM 的這種推理能力。然而，它們在 LLM 教師模型中考量兩個挑戰時並不充分，這兩個挑戰分別是 1) 資料品質和 2) 軟標籤提供。在本文中，我們提出 Mentor-KD，它有效地將 LLM 的多步驟推理能力蒸餾到較小的 LLM，同時解決上述挑戰。具體來說，我們利用導師、中型特定於任務的微調模型，來擴充額外的 CoT 標註並在推理蒸餾期間為學生模型提供軟標籤。我們進行廣泛的實驗並確認 Mentor-KD 在各種模型和複雜推理任務中的有效性。", "author": "Hojae Lee et.al.", "authors": "Hojae Lee, Junho Kim, SangKeun Lee", "id": "2410.09037v1", "paper_url": "http://arxiv.org/abs/2410.09037v1", "repo": "https://github.com/2hojae/mentor-kd"}}