{"2411.07407": {"publish_time": "2024-11-11", "title": "Using Generative AI and Multi-Agents to Provide Automatic Feedback", "paper_summary": "This study investigates the use of generative AI and multi-agent systems to\nprovide automatic feedback in educational contexts, particularly for student\nconstructed responses in science assessments. The research addresses a key gap\nin the field by exploring how multi-agent systems, called AutoFeedback, can\nimprove the quality of GenAI-generated feedback, overcoming known issues such\nas over-praise and over-inference that are common in single-agent large\nlanguage models (LLMs). The study developed a multi-agent system consisting of\ntwo AI agents: one for generating feedback and another for validating and\nrefining it. The system was tested on a dataset of 240 student responses, and\nits performance was compared to that of a single-agent LLM. Results showed that\nAutoFeedback significantly reduced the occurrence of over-praise and\nover-inference errors, providing more accurate and pedagogically sound\nfeedback. The findings suggest that multi-agent systems can offer a more\nreliable solution for generating automated feedback in educational settings,\nhighlighting their potential for scalable and personalized learning support.\nThese results have important implications for educators and researchers seeking\nto leverage AI in formative assessments, offering a pathway to more effective\nfeedback mechanisms that enhance student learning outcomes.", "paper_summary_zh": "本研究探討生成式 AI 與多重代理系統在教育情境中提供自動回饋的用途，特別是針對學生在科學評量中建構的回應。此研究透過探討稱為 AutoFeedback 的多重代理系統如何改善 GenAI 生成的回饋品質，來解決該領域的一個關鍵落差，克服常見於單一代理大型語言模型 (LLM) 中的過度讚美和過度推論等已知問題。本研究開發了一個由兩個 AI 代理組成的多重代理系統：一個用於產生回饋，另一個用於驗證和改善回饋。此系統在 240 個學生回應的資料集上進行測試，並將其效能與單一代理 LLM 進行比較。結果顯示，AutoFeedback 大幅減少過度讚美和過度推論錯誤的發生，提供更準確且在教學法上更完善的回饋。研究結果顯示，多重代理系統可以為在教育環境中產生自動回饋提供更可靠的解決方案，突顯其在可擴充且個人化的學習支援方面的潛力。這些結果對尋求在形成性評量中利用 AI 的教育工作者和研究人員具有重要意義，提供一條通往更有效的回饋機制的途徑，以提升學生的學習成果。", "author": "Shuchen Guo et.al.", "authors": "Shuchen Guo, Ehsan Latif, Yifan Zhou, Xuan Huang, Xiaoming Zhai", "id": "2411.07407v1", "paper_url": "http://arxiv.org/abs/2411.07407v1", "repo": "null"}}