{"2409.15911": {"publish_time": "2024-09-24", "title": "A Modular-based Strategy for Mitigating Gradient Conflicts in Simultaneous Speech Translation", "paper_summary": "Simultaneous Speech Translation (SimulST) involves generating target language\ntext while continuously processing streaming speech input, presenting\nsignificant real-time challenges. Multi-task learning is often employed to\nenhance SimulST performance but introduces optimization conflicts between\nprimary and auxiliary tasks, potentially compromising overall efficiency. The\nexisting model-level conflict resolution methods are not well-suited for this\ntask which exacerbates inefficiencies and leads to high GPU memory consumption.\nTo address these challenges, we propose a Modular Gradient Conflict Mitigation\n(MGCM) strategy that detects conflicts at a finer-grained modular level and\nresolves them utilizing gradient projection. Experimental results demonstrate\nthat MGCM significantly improves SimulST performance, particularly under medium\nand high latency conditions, achieving a 0.68 BLEU score gain in offline tasks.\nAdditionally, MGCM reduces GPU memory consumption by over 95\\% compared to\nother conflict mitigation methods, establishing it as a robust solution for\nSimulST tasks.", "paper_summary_zh": "同步語音翻譯（SimulST）涉及在持續處理串流語音輸入時產生目標語言文本，帶來顯著的即時挑戰。多任務學習通常用於增強 SimulST 效能，但會在主要任務和輔助任務之間產生最佳化衝突，可能損害整體效率。現有的模型層級衝突解決方法並不適合此任務，這會加劇低效率並導致高 GPU 記憶體消耗。為了應對這些挑戰，我們提出了一個模組化梯度衝突緩解（MGCM）策略，它可以在更細粒度的模組層級偵測衝突，並利用梯度投影來解決這些衝突。實驗結果證明，MGCM 大幅改善了 SimulST 效能，尤其是在中高延遲條件下，在離線任務中獲得 0.68 的 BLEU 分數增益。此外，與其他衝突緩解方法相比，MGCM 將 GPU 記憶體消耗降低了 95% 以上，使其成為 SimulST 任務的強大解決方案。", "author": "Xiaoqian Liu et.al.", "authors": "Xiaoqian Liu, Yangfan Du, Jianjin Wang, Yuan Ge, Chen Xu, Tong Xiao, Guocheng Chen, Jingbo Zhu", "id": "2409.15911v1", "paper_url": "http://arxiv.org/abs/2409.15911v1", "repo": "null"}}