{"2501.14122": {"publish_time": "2025-01-23", "title": "Reinforcement Learning Platform for Adversarial Black-box Attacks with Custom Distortion Filters", "paper_summary": "We present a Reinforcement Learning Platform for Adversarial Black-box\nuntargeted and targeted attacks, RLAB, that allows users to select from various\ndistortion filters to create adversarial examples. The platform uses a\nReinforcement Learning agent to add minimum distortion to input images while\nstill causing misclassification by the target model. The agent uses a novel\ndual-action method to explore the input image at each step to identify\nsensitive regions for adding distortions while removing noises that have less\nimpact on the target model. This dual action leads to faster and more efficient\nconvergence of the attack. The platform can also be used to measure the\nrobustness of image classification models against specific distortion types.\nAlso, retraining the model with adversarial samples significantly improved\nrobustness when evaluated on benchmark datasets. The proposed platform\noutperforms state-of-the-art methods in terms of the average number of queries\nrequired to cause misclassification. This advances trustworthiness with a\npositive social impact.", "paper_summary_zh": "我們提出一個針對對抗性黑盒無目標和目標攻擊的強化學習平台 RLAB，它允許使用者從各種失真濾鏡中選擇，以建立對抗性範例。該平台使用強化學習代理，在不造成目標模型誤分類的情況下，將輸入影像的失真降至最低。該代理使用一種新穎的雙重動作方法，在每個步驟中探索輸入影像，以找出可加入失真的敏感區域，同時移除對目標模型影響較小的雜訊。這種雙重動作導致攻擊的收斂速度更快、效率更高。該平台還可用来衡量影像分類模型對特定失真類型的穩健性。此外，使用對抗性範例重新訓練模型，在基準資料集上評估時，顯著改善了穩健性。所提出的平台在造成誤分類所需的平均查詢次數方面，優於最先進的方法。這透過正向的社會影響，提升了可信度。", "author": "Soumyendu Sarkar et.al.", "authors": "Soumyendu Sarkar, Ashwin Ramesh Babu, Sajad Mousavi, Vineet Gundecha, Sahand Ghorbanpour, Avisek Naug, Ricardo Luna Gutierrez, Antonio Guillen", "id": "2501.14122v1", "paper_url": "http://arxiv.org/abs/2501.14122v1", "repo": "null"}}