{"2410.06912": {"publish_time": "2024-10-09", "title": "Compositional Entailment Learning for Hyperbolic Vision-Language Models", "paper_summary": "Image-text representation learning forms a cornerstone in vision-language\nmodels, where pairs of images and textual descriptions are contrastively\naligned in a shared embedding space. Since visual and textual concepts are\nnaturally hierarchical, recent work has shown that hyperbolic space can serve\nas a high-potential manifold to learn vision-language representation with\nstrong downstream performance. In this work, for the first time we show how to\nfully leverage the innate hierarchical nature of hyperbolic embeddings by\nlooking beyond individual image-text pairs. We propose Compositional Entailment\nLearning for hyperbolic vision-language models. The idea is that an image is\nnot only described by a sentence but is itself a composition of multiple object\nboxes, each with their own textual description. Such information can be\nobtained freely by extracting nouns from sentences and using openly available\nlocalized grounding models. We show how to hierarchically organize images,\nimage boxes, and their textual descriptions through contrastive and\nentailment-based objectives. Empirical evaluation on a hyperbolic\nvision-language model trained with millions of image-text pairs shows that the\nproposed compositional learning approach outperforms conventional Euclidean\nCLIP learning, as well as recent hyperbolic alternatives, with better zero-shot\nand retrieval generalization and clearly stronger hierarchical performance.", "paper_summary_zh": "图像文本表征学习是视觉语言模型中的基石，其中图像和文本描述对在共享嵌入空间中对比对齐。由于视觉和文本概念天然具有层次结构，最近的研究表明，双曲空间可以作为学习视觉语言表征的高潜力流形，具有强大的下游性能。在这项工作中，我们首次展示了如何充分利用双曲嵌入的固有层次结构，方法是超越单个图像文本对。我们提出了双曲视觉语言模型的组合蕴涵学习。这个想法是，图像不仅由句子描述，而且本身是由多个对象框组成的，每个对象框都有自己的文本描述。可以通过从句子中提取名词并使用公开可用的局部接地模型免费获得此类信息。我们展示了如何通过对比和基于蕴涵的目标分层组织图像、图像框及其文本描述。对使用数百万图像文本对训练的双曲视觉语言模型进行的经验评估表明，所提出的组合学习方法优于传统的欧几里得 CLIP 学习，以及最近的双曲替代方案，具有更好的零样本和检索泛化能力，以及明显更强的层次性能。", "author": "Avik Pal et.al.", "authors": "Avik Pal, Max van Spengler, Guido Maria D'Amely di Melendugno, Alessandro Flaborea, Fabio Galasso, Pascal Mettes", "id": "2410.06912v1", "paper_url": "http://arxiv.org/abs/2410.06912v1", "repo": "null"}}