{"2501.19180": {"publish_time": "2025-01-31", "title": "Enhancing Model Defense Against Jailbreaks with Proactive Safety Reasoning", "paper_summary": "Large language models (LLMs) are vital for a wide range of applications yet\nremain susceptible to jailbreak threats, which could lead to the generation of\ninappropriate responses. Conventional defenses, such as refusal and adversarial\ntraining, often fail to cover corner cases or rare domains, leaving LLMs still\nvulnerable to more sophisticated attacks. We propose a novel defense strategy,\nSafety Chain-of-Thought (SCoT), which harnesses the enhanced \\textit{reasoning\ncapabilities} of LLMs for proactive assessment of harmful inputs, rather than\nsimply blocking them. SCoT augments any refusal training datasets to critically\nanalyze the intent behind each request before generating answers. By employing\nproactive reasoning, SCoT enhances the generalization of LLMs across varied\nharmful queries and scenarios not covered in the safety alignment corpus.\nAdditionally, it generates detailed refusals specifying the rules violated.\nComparative evaluations show that SCoT significantly surpasses existing\ndefenses, reducing vulnerability to out-of-distribution issues and adversarial\nmanipulations while maintaining strong general capabilities.", "paper_summary_zh": "大型語言模型 (LLM) 對廣泛的應用至關重要，但仍容易受到越獄威脅，這可能會導致產生不適當的回應。傳統防禦措施，例如拒絕和對抗訓練，通常無法涵蓋邊緣案例或罕見領域，這使得 LLM 仍然容易受到更複雜的攻擊。我們提出了一種新穎的防禦策略，即安全思考鏈 (SCoT)，它利用 LLM 增強的推理能力來主動評估有害輸入，而不是簡單地阻止它們。SCoT 擴充任何拒絕訓練資料集，以便在產生答案之前批判性地分析每個請求背後的意圖。通過採用主動推理，SCoT 增強了 LLM 對安全對齊語料庫中未涵蓋的各種有害查詢和場景的概括。此外，它還會產生詳細的拒絕，說明所違反的規則。比較評估表明，SCoT 明顯優於現有防禦措施，降低了對分佈外問題和對抗操作的脆弱性，同時保持了強大的通用能力。", "author": "Xianglin Yang et.al.", "authors": "Xianglin Yang, Gelei Deng, Jieming Shi, Tianwei Zhang, Jin Song Dong", "id": "2501.19180v1", "paper_url": "http://arxiv.org/abs/2501.19180v1", "repo": "null"}}