{"2407.12543": {"publish_time": "2024-07-17", "title": "Abstraction Alignment: Comparing Model and Human Conceptual Relationships", "paper_summary": "Abstraction -- the process of generalizing specific examples into broad\nreusable patterns -- is central to how people efficiently process and store\ninformation and apply their knowledge to new data. Promisingly, research has\nshown that ML models learn representations that span levels of abstraction,\nfrom specific concepts like \"bolo tie\" and \"car tire\" to more general concepts\nlike \"CEO\" and \"model\". However, existing techniques analyze these\nrepresentations in isolation, treating learned concepts as independent\nartifacts rather than an interconnected web of abstraction. As a result,\nalthough we can identify the concepts a model uses to produce its output, it is\ndifficult to assess if it has learned a human-aligned abstraction of the\nconcepts that will generalize to new data. To address this gap, we introduce\nabstraction alignment, a methodology to measure the agreement between a model's\nlearned abstraction and the expected human abstraction. We quantify abstraction\nalignment by comparing model outputs against a human abstraction graph, such as\nlinguistic relationships or medical disease hierarchies. In evaluation tasks\ninterpreting image models, benchmarking language models, and analyzing medical\ndatasets, abstraction alignment provides a deeper understanding of model\nbehavior and dataset content, differentiating errors based on their agreement\nwith human knowledge, expanding the verbosity of current model quality metrics,\nand revealing ways to improve existing human abstractions.", "paper_summary_zh": "抽象化——將特定範例概括為廣泛可重複使用的模式的過程——是人們有效處理和儲存資訊，並將其知識應用於新資料的核心。有希望的是，研究顯示 ML 模型學習跨越抽象層級的表徵，從「細領帶」和「汽車輪胎」等具體概念到「執行長」和「模型」等更一般的概念。然而，現有的技術孤立地分析這些表徵，將學習到的概念視為獨立的產物，而不是抽象的相互連結網路。因此，儘管我們可以識別模型用來產生其輸出的概念，但很難評估它是否學習到概念的人類對齊抽象，這些概念將概括到新的資料。為了解決這個差距，我們引入了抽象對齊，一種衡量模型學習的抽象與預期的抽象之間一致性的方法。我們透過將模型輸出與人類抽象圖形（例如語言關係或醫療疾病層級結構）進行比較來量化抽象對齊。在解釋影像模型、基準語言模型和分析醫療資料集的評估任務中，抽象對齊提供了對模型行為和資料集內容更深入的理解，根據與人類知識的一致性區分錯誤，擴展當前模型品質指標的詳細程度，並揭示改善現有人類抽象的方法。", "author": "Angie Boggust et.al.", "authors": "Angie Boggust, Hyemin Bang, Hendrik Strobelt, Arvind Satyanarayan", "id": "2407.12543v1", "paper_url": "http://arxiv.org/abs/2407.12543v1", "repo": "https://github.com/mitvis/abstraction-alignment"}}