{"2502.03750": {"publish_time": "2025-02-06", "title": "Principal Curvatures Estimation with Applications to Single Cell Data", "paper_summary": "The rapidly growing field of single-cell transcriptomic sequencing (scRNAseq)\npresents challenges for data analysis due to its massive datasets. A common\nmethod in manifold learning consists in hypothesizing that datasets lie on a\nlower dimensional manifold. This allows to study the geometry of point clouds\nby extracting meaningful descriptors like curvature. In this work, we will\npresent Adaptive Local PCA (AdaL-PCA), a data-driven method for accurately\nestimating various notions of intrinsic curvature on data manifolds, in\nparticular principal curvatures for surfaces. The model relies on local PCA to\nestimate the tangent spaces. The evaluation of AdaL-PCA on sampled surfaces\nshows state-of-the-art results. Combined with a PHATE embedding, the model\napplied to single-cell RNA sequencing data allows us to identify key variations\nin the cellular differentiation.", "paper_summary_zh": "單細胞轉錄組定序 (scRNAseq) 領域快速成長，由於其資料集龐大，為資料分析帶來挑戰。流形學習中一個常見的方法在於假設資料集位於較低維度的流形上。這允許透過擷取有意義的描述符（例如曲率）來研究點雲的幾何形狀。在這項工作中，我們將介紹自適應局部 PCA (AdaL-PCA)，一種資料驅動的方法，用於準確估計資料流形上內在曲率的不同概念，特別是曲面的主曲率。此模型依賴於局部 PCA 來估計切空間。AdaL-PCA 在取樣曲面上的評估顯示最先進的結果。與 PHATE 嵌入相結合，應用於單細胞 RNA 定序資料的模型使我們能夠識別細胞分化中的關鍵變化。", "author": "Yanlei Zhang et.al.", "authors": "Yanlei Zhang, Lydia Mezrag, Xingzhi Sun, Charles Xu, Kincaid Macdonald, Dhananjay Bhaskar, Smita Krishnaswamy, Guy Wolf, Bastian Rieck", "id": "2502.03750v1", "paper_url": "http://arxiv.org/abs/2502.03750v1", "repo": "null"}}