{"2407.06488": {"publish_time": "2024-07-09", "title": "Towards Understanding Multi-Task Learning (Generalization) of LLMs via Detecting and Exploring Task-Specific Neurons", "paper_summary": "While large language models (LLMs) have demonstrated superior multi-task\ncapabilities, understanding the learning mechanisms behind this is still a\nchallenging problem. In this paper, we attempt to understand such mechanisms\nfrom the perspective of neurons. Specifically, we detect task-sensitive neurons\nin LLMs via gradient attribution on task-specific data. Through extensive\ndeactivation and fine-tuning experiments, we demonstrate that the detected\nneurons are highly correlated with the given task, which we term as\ntask-specific neurons. With these identified task-specific neurons, we delve\ninto two common problems in multi-task learning and continuous learning:\nGeneralization and Catastrophic Forgetting. We find that the overlap of\ntask-specific neurons is strongly associated with generalization and\nspecialization across tasks. Interestingly, at certain layers of LLMs, there is\na high similarity in the parameters of different task-specific neurons, and\nsuch similarity is highly correlated with the generalization performance.\nInspired by these findings, we propose a neuron-level continuous fine-tuning\nmethod that only fine-tunes the current task-specific neurons during continuous\nlearning, and extensive experiments demonstrate the effectiveness of the\nproposed method. Our study provides insights into the interpretability of LLMs\nin multi-task learning.", "paper_summary_zh": "儘管大型語言模型 (LLM) 已展現出卓越的多任務能力，但了解其背後的學習機制仍是一項艱鉅的任務。在本文中，我們嘗試從神經元的角度來了解此類機制。具體來說，我們透過任務特定資料上的梯度歸因來偵測 LLM 中的任務敏感神經元。透過廣泛的停用和微調實驗，我們證明了偵測到的神經元與所給任務高度相關，我們將其稱為任務特定神經元。透過這些已識別的任務特定神經元，我們深入探討了多任務學習和持續學習中的兩個常見問題：泛化和災難性遺忘。我們發現任務特定神經元的重疊與任務之間的泛化和專門化密切相關。有趣的是，在 LLM 的某些層中，不同任務特定神經元的參數具有高度相似性，而這種相似性與泛化效能高度相關。受這些發現啟發，我們提出了一種神經元層級的持續微調方法，該方法僅在持續學習期間微調當前任務特定神經元，而廣泛的實驗證明了所提出方法的有效性。我們的研究提供了對 LLM 在多任務學習中可解釋性的見解。", "author": "Yongqi Leng et.al.", "authors": "Yongqi Leng, Deyi Xiong", "id": "2407.06488v1", "paper_url": "http://arxiv.org/abs/2407.06488v1", "repo": "null"}}