{"2412.18111": {"publish_time": "2024-12-24", "title": "AIGT: AI Generative Table Based on Prompt", "paper_summary": "Tabular data, which accounts for over 80% of enterprise data assets, is vital\nin various fields. With growing concerns about privacy protection and\ndata-sharing restrictions, generating high-quality synthetic tabular data has\nbecome essential. Recent advancements show that large language models (LLMs)\ncan effectively gener-ate realistic tabular data by leveraging semantic\ninformation and overcoming the challenges of high-dimensional data that arise\nfrom one-hot encoding. However, current methods do not fully utilize the rich\ninformation available in tables. To address this, we introduce AI Generative\nTable (AIGT) based on prompt enhancement, a novel approach that utilizes meta\ndata information, such as table descriptions and schemas, as prompts to\ngenerate ultra-high quality synthetic data. To overcome the token limit\nconstraints of LLMs, we propose long-token partitioning algorithms that enable\nAIGT to model tables of any scale. AIGT achieves state-of-the-art performance\non 14 out of 20 public datasets and two real industry datasets within the\nAlipay risk control system.", "paper_summary_zh": "表格資料佔企業資料資產的 80% 以上，在各個領域都至關重要。隨著隱私保護和資料共享限制的疑慮日益增加，產生高品質的合成表格資料已變得至關重要。最近的進展顯示，大型語言模型 (LLM) 可以有效地透過利用語義資訊並克服由 one-hot 編碼產生的高維度資料挑戰，來產生逼真的表格資料。然而，目前的技術並未充分利用表格中豐富的資訊。為了解決這個問題，我們引入了基於提示增強的 AI 生成表格 (AIGT)，這是一種新穎的方法，它利用元資料資訊，例如表格描述和架構，作為提示來產生極高品質的合成資料。為了克服 LLM 的 token 數量限制，我們提出了長 token 分割演算法，讓 AIGT 能夠建模任何規模的表格。在 20 個公開資料集和 Alipay 風險控制系統中的兩個實際產業資料集上，AIGT 達到了 14 個最先進的效能。", "author": "Mingming Zhang et.al.", "authors": "Mingming Zhang, Zhiqing Xiao, Guoshan Lu, Sai Wu, Weiqiang Wang, Xing Fu, Can Yi, Junbo Zhao", "id": "2412.18111v1", "paper_url": "http://arxiv.org/abs/2412.18111v1", "repo": "null"}}