{"2501.12962": {"publish_time": "2025-01-22", "title": "It's complicated. The relationship of algorithmic fairness and non-discrimination regulations in the EU AI Act", "paper_summary": "What constitutes a fair decision? This question is not only difficult for\nhumans but becomes more challenging when Artificial Intelligence (AI) models\nare used. In light of discriminatory algorithmic behaviors, the EU has recently\npassed the AI Act, which mandates specific rules for AI models, incorporating\nboth traditional legal non-discrimination regulations and machine learning\nbased algorithmic fairness concepts. This paper aims to bridge these two\ndifferent concepts in the AI Act through: First a high-level introduction of\nboth concepts targeting legal and computer science-oriented scholars, and\nsecond an in-depth analysis of the AI Act's relationship between legal\nnon-discrimination regulations and algorithmic fairness. Our analysis reveals\nthree key findings: (1.), most non-discrimination regulations target only\nhigh-risk AI systems. (2.), the regulation of high-risk systems encompasses\nboth data input requirements and output monitoring, though these regulations\nare often inconsistent and raise questions of computational feasibility. (3.)\nRegulations for General Purpose AI Models, such as Large Language Models that\nare not simultaneously classified as high-risk systems, currently lack\nspecificity compared to other regulations. Based on these findings, we\nrecommend developing more specific auditing and testing methodologies for AI\nsystems. This paper aims to serve as a foundation for future interdisciplinary\ncollaboration between legal scholars and computer science-oriented machine\nlearning researchers studying discrimination in AI systems.", "paper_summary_zh": "什麼構成一個公平的決定？這個問題不僅對人類來說很難，當使用人工智慧（AI）模型時，這個問題會變得更具挑戰性。鑑於演算法行為具有歧視性，歐盟最近通過了 AI 法案，該法案對 AI 模型制定了具體規則，結合了傳統的法律反歧視法規和基於機器學習的演算法公平性概念。本文旨在通過以下方式彌合 AI 法案中的這兩個不同概念：首先，針對法律和電腦科學學者的高層級介紹，其次，深入分析 AI 法案在法律反歧視法規和演算法公平性之間的關係。我們的分析揭示了三個關鍵發現：(1.)，大多數反歧視法規只針對高風險 AI 系統。(2.)，高風險系統的法規包含資料輸入需求和輸出監控，儘管這些法規通常不一致，並引發了計算可行性的問題。(3.)，通用 AI 模型的法規，例如未同時歸類為高風險系統的大語言模型，與其他法規相比目前缺乏具體性。根據這些發現，我們建議為 AI 系統開發更具體的稽核和測試方法。本文旨在作為法律學者和以電腦科學為導向的機器學習研究人員之間未來跨學科合作的基礎，研究 AI 系統中的歧視。", "author": "Kristof Meding et.al.", "authors": "Kristof Meding", "id": "2501.12962v1", "paper_url": "http://arxiv.org/abs/2501.12962v1", "repo": "null"}}