{"2409.17755": {"publish_time": "2024-09-26", "title": "SECURE: Semantics-aware Embodied Conversation under Unawareness for Lifelong Robot Learning", "paper_summary": "This paper addresses a challenging interactive task learning scenario we call\nrearrangement under unawareness: to manipulate a rigid-body environment in a\ncontext where the robot is unaware of a concept that's key to solving the\ninstructed task. We propose SECURE, an interactive task learning framework\ndesigned to solve such problems by fixing a deficient domain model using\nembodied conversation. Through dialogue, the robot discovers and then learns to\nexploit unforeseen possibilities. Using SECURE, the robot not only learns from\nthe user's corrective feedback when it makes a mistake, but it also learns to\nmake strategic dialogue decisions for revealing useful evidence about novel\nconcepts for solving the instructed task. Together, these abilities allow the\nrobot to generalise to subsequent tasks using newly acquired knowledge. We\ndemonstrate that a robot that is semantics-aware -- that is, it exploits the\nlogical consequences of both sentence and discourse semantics in the learning\nand inference process -- learns to solve rearrangement under unawareness more\neffectively than a robot that lacks such capabilities.", "paper_summary_zh": "這篇論文探討了一個我們稱之為在不知情狀態下重新排列的具有挑戰性的互動式任務學習場景：在機器人不知道解決指示任務的關鍵概念的情況下操作剛體環境。我們提出 SECURE，一個互動式任務學習框架，旨在透過具體對話來修復有缺陷的領域模型，進而解決此類問題。透過對話，機器人發現並學會利用無法預見的可能性。透過使用 SECURE，機器人不僅可以從使用者在它犯錯時的糾正回饋中學習，它也學會對揭露有關解決指示任務的新概念的有用證據做出策略性對話決策。這些能力加起來，讓機器人能夠使用新獲得的知識推廣到後續任務。我們證明了一個語義感知的機器人，也就是說，它利用句子和語篇語義在學習和推理過程中產生的邏輯後果，學會在不知情狀態下比缺乏這種能力的機器人更有效地解決重新排列。", "author": "Rimvydas Rubavicius et.al.", "authors": "Rimvydas Rubavicius, Peter David Fagan, Alex Lascarides, Subramanian Ramamoorthy", "id": "2409.17755v1", "paper_url": "http://arxiv.org/abs/2409.17755v1", "repo": "null"}}