{"2409.03161": {"publish_time": "2024-09-05", "title": "MaterialBENCH: Evaluating College-Level Materials Science Problem-Solving Abilities of Large Language Models", "paper_summary": "A college-level benchmark dataset for large language models (LLMs) in the\nmaterials science field, MaterialBENCH, is constructed. This dataset consists\nof problem-answer pairs, based on university textbooks. There are two types of\nproblems: one is the free-response answer type, and the other is the\nmultiple-choice type. Multiple-choice problems are constructed by adding three\nincorrect answers as choices to a correct answer, so that LLMs can choose one\nof the four as a response. Most of the problems for free-response answer and\nmultiple-choice types overlap except for the format of the answers. We also\nconduct experiments using the MaterialBENCH on LLMs, including ChatGPT-3.5,\nChatGPT-4, Bard (at the time of the experiments), and GPT-3.5 and GPT-4 with\nthe OpenAI API. The differences and similarities in the performance of LLMs\nmeasured by the MaterialBENCH are analyzed and discussed. Performance\ndifferences between the free-response type and multiple-choice type in the same\nmodels and the influence of using system massages on multiple-choice problems\nare also studied. We anticipate that MaterialBENCH will encourage further\ndevelopments of LLMs in reasoning abilities to solve more complicated problems\nand eventually contribute to materials research and discovery.", "paper_summary_zh": "<paragraph>針對材料科學領域的大型語言模型 (LLM) 建構了大學等級的基準資料集 MaterialBENCH。此資料集包含基於大學教科書的問題解答配對。問題有兩種：一種是自由回答類型，另一種是多選題類型。多選題問題是透過在正確答案中加入三個錯誤答案作為選項來建構，以便 LLM 能從四個選項中選擇一個作為回應。除了答案格式外，自由回答類型和多選題類型的大部分問題是重疊的。我們還使用 MaterialBENCH 對 LLM 進行實驗，包括 ChatGPT-3.5、ChatGPT-4、Bard（在實驗時）、以及使用 OpenAI API 的 GPT-3.5 和 GPT-4。針對 MaterialBENCH 測量出的 LLM 效能差異和相似性進行分析和討論。我們也研究了相同模型中自由回答類型和多選題類型之間的效能差異，以及在多選題問題中使用系統訊息的影響。我們預期 MaterialBENCH 將促進 LLM 在推理能力方面的進一步發展，以解決更複雜的問題，並最終有助於材料研究和發現。</paragraph>", "author": "Michiko Yoshitake et.al.", "authors": "Michiko Yoshitake, Yuta Suzuki, Ryo Igarashi, Yoshitaka Ushiku, Keisuke Nagato", "id": "2409.03161v1", "paper_url": "http://arxiv.org/abs/2409.03161v1", "repo": "null"}}