{"2411.04032": {"publish_time": "2024-11-06", "title": "Beemo: Benchmark of Expert-edited Machine-generated Outputs", "paper_summary": "The rapid proliferation of large language models (LLMs) has increased the\nvolume of machine-generated texts (MGTs) and blurred text authorship in various\ndomains. However, most existing MGT benchmarks include single-author texts\n(human-written and machine-generated). This conventional design fails to\ncapture more practical multi-author scenarios, where the user refines the LLM\nresponse for natural flow, coherence, and factual correctness. Our paper\nintroduces the Benchmark of Expert-edited Machine-generated Outputs (Beemo),\nwhich includes 6.5k texts written by humans, generated by ten\ninstruction-finetuned LLMs, and edited by experts for various use cases,\nranging from creative writing to summarization. Beemo additionally comprises\n13.1k machine-generated and LLM-edited texts, allowing for diverse MGT\ndetection evaluation across various edit types. We document Beemo's creation\nprotocol and present the results of benchmarking 33 configurations of MGT\ndetectors in different experimental setups. We find that expert-based editing\nevades MGT detection, while LLM-edited texts are unlikely to be recognized as\nhuman-written. Beemo and all materials are publicly available.", "paper_summary_zh": "大型語言模型 (LLM) 的快速擴散增加了機器產生的文本 (MGT) 的數量，並模糊了各種領域中的文字作者身份。然而，現有的 MGT 基準大多包含單一作者的文本（人工撰寫和機器產生的）。這種傳統的設計無法捕捉到更實際的多作者場景，在這種場景中，使用者會修改 LLM 回應以獲得自然的流暢性、連貫性和事實正確性。我們的論文介紹了由專家編輯的機器產生的輸出基準 (Beemo)，其中包括 6.5k 篇由人類撰寫、由十個指令微調的 LLM 生成的文本，以及由專家針對各種用例（從創意寫作到摘要）編輯的文本。此外，Beemo 還包含 13.1k 篇機器產生的和 LLM 編輯的文本，允許對各種編輯類型進行多樣化的 MGT 檢測評估。我們記錄了 Beemo 的創建協議，並展示了在不同實驗設置中對 33 種配置的 MGT 檢測器進行基準測試的結果。我們發現基於專家的編輯可以規避 MGT 檢測，而 LLM 編輯的文本不太可能被識別為人工撰寫的。Beemo 和所有材料都公開提供。", "author": "Ekaterina Artemova et.al.", "authors": "Ekaterina Artemova, Jason Lucas, Saranya Venkatraman, Jooyoung Lee, Sergei Tilga, Adaku Uchendu, Vladislav Mikhailov", "id": "2411.04032v1", "paper_url": "http://arxiv.org/abs/2411.04032v1", "repo": "null"}}