{"2408.16208": {"publish_time": "2024-08-29", "title": "ReXamine-Global: A Framework for Uncovering Inconsistencies in Radiology Report Generation Metrics", "paper_summary": "Given the rapidly expanding capabilities of generative AI models for\nradiology, there is a need for robust metrics that can accurately measure the\nquality of AI-generated radiology reports across diverse hospitals. We develop\nReXamine-Global, a LLM-powered, multi-site framework that tests metrics across\ndifferent writing styles and patient populations, exposing gaps in their\ngeneralization. First, our method tests whether a metric is undesirably\nsensitive to reporting style, providing different scores depending on whether\nAI-generated reports are stylistically similar to ground-truth reports or not.\nSecond, our method measures whether a metric reliably agrees with experts, or\nwhether metric and expert scores of AI-generated report quality diverge for\nsome sites. Using 240 reports from 6 hospitals around the world, we apply\nReXamine-Global to 7 established report evaluation metrics and uncover serious\ngaps in their generalizability. Developers can apply ReXamine-Global when\ndesigning new report evaluation metrics, ensuring their robustness across\nsites. Additionally, our analysis of existing metrics can guide users of those\nmetrics towards evaluation procedures that work reliably at their sites of\ninterest.", "paper_summary_zh": "隨著放射科生成式 AI 模型功能的快速擴展，需要健全的指標來準確衡量不同醫院中 AI 生成的放射科報告品質。我們開發了 ReXamine-Global，一個由 LLM 驅動的多站點架構，它會在不同的寫作風格和患者族群中測試指標，找出它們概括性中的差距。首先，我們的測試方法會測試指標是否對報告風格過度敏感，並提供不同的分數，具體取決於 AI 生成的報告在風格上是否與真實報告類似。其次，我們的測試方法會衡量指標是否可靠地與專家意見一致，或者指標和專家對 AI 生成的報告品質的分數是否在某些站點上有所不同。我們將 ReXamine-Global 套用在來自全球 6 家醫院的 240 份報告上，並對 7 項既有的報告評估指標進行評估，發現它們的概括性存在嚴重差距。開發人員在設計新的報告評估指標時可以套用 ReXamine-Global，以確保它們在不同站點之間的健全性。此外，我們對既有指標的分析可以引導這些指標的使用者採用在他們感興趣的站點上可靠運作的評估程序。", "author": "Oishi Banerjee et.al.", "authors": "Oishi Banerjee, Agustina Saenz, Kay Wu, Warren Clements, Adil Zia, Dominic Buensalido, Helen Kavnoudias, Alain S. Abi-Ghanem, Nour El Ghawi, Cibele Luna, Patricia Castillo, Khaled Al-Surimi, Rayyan A. Daghistani, Yuh-Min Chen, Heng-sheng Chao, Lars Heiliger, Moon Kim, Johannes Haubold, Frederic Jonske, Pranav Rajpurkar", "id": "2408.16208v1", "paper_url": "http://arxiv.org/abs/2408.16208v1", "repo": "null"}}