{"2411.04950": {"publish_time": "2024-11-07", "title": "Estimating the Influence of Sequentially Correlated Literary Properties in Textual Classification: A Data-Centric Hypothesis-Testing Approach", "paper_summary": "Stylometry aims to distinguish authors by analyzing literary traits assumed\nto reflect semi-conscious choices distinct from elements like genre or theme.\nHowever, these components often overlap, complicating text classification based\nsolely on feature distributions. While some literary properties, such as\nthematic content, are likely to manifest as correlations between adjacent text\nunits, others, like authorial style, may be independent thereof. We introduce a\nhypothesis-testing approach to evaluate the influence of sequentially\ncorrelated literary properties on text classification, aiming to determine when\nthese correlations drive classification. Using a multivariate binary\ndistribution, our method models sequential correlations between text units as a\nstochastic process, assessing the likelihood of clustering across varying\nadjacency scales. This enables us to examine whether classification is\ndominated by sequentially correlated properties or remains independent. In\nexperiments on a diverse English prose corpus, our analysis integrates\ntraditional and neural embeddings within supervised and unsupervised\nframeworks. Results demonstrate that our approach effectively identifies when\ntextual classification is not primarily influenced by sequentially correlated\nliterary properties, particularly in cases where texts differ in authorial\nstyle or genre rather than by a single author within a similar genre.", "paper_summary_zh": "風格計量學旨在通過分析假設的反映了半意識選擇的文學特徵來區分作者，這些特徵不同於類型或主題等元素。然而，這些組成部分通常會重疊，這使得僅基於特徵分佈的文本分類變得複雜。雖然一些文學屬性（例如主題內容）可能會表現為相鄰文本單元之間的相關性，但其他屬性（例如作者風格）可能與此無關。我們引入了一個假設檢驗方法來評估序列相關文學屬性對文本分類的影響，旨在確定這些相關性何時驅動分類。使用多元二元分佈，我們的模型將文本單元之間的序列相關性建模為一個隨機過程，評估在不同鄰接尺度上聚類的可能性。這使我們能夠檢查分類是由序列相關屬性主導還是保持獨立。在對多樣化的英語散文語料庫進行的實驗中，我們的分析將傳統嵌入和神經嵌入整合到有監督和無監督的框架中。結果表明，我們的模型有效地識別了何時文本分類不受序列相關文學屬性的主要影響，特別是在文本在作者風格或類型上有所不同的情況下，而不是在類似類型中的單個作者。", "author": "Gideon Yoffe et.al.", "authors": "Gideon Yoffe, Nachum Dershowitz, Ariel Vishne, Barak Sober", "id": "2411.04950v1", "paper_url": "http://arxiv.org/abs/2411.04950v1", "repo": "https://github.com/YoffeG/Thematic-nonThematic_Hypothesis_Testing"}}