{"2405.17422": {"publish_time": "2024-05-27", "title": "Hardness-Aware Scene Synthesis for Semi-Supervised 3D Object Detection", "paper_summary": "3D object detection aims to recover the 3D information of concerning objects\nand serves as the fundamental task of autonomous driving perception. Its\nperformance greatly depends on the scale of labeled training data, yet it is\ncostly to obtain high-quality annotations for point cloud data. While\nconventional methods focus on generating pseudo-labels for unlabeled samples as\nsupplements for training, the structural nature of 3D point cloud data\nfacilitates the composition of objects and backgrounds to synthesize realistic\nscenes. Motivated by this, we propose a hardness-aware scene synthesis (HASS)\nmethod to generate adaptive synthetic scenes to improve the generalization of\nthe detection models. We obtain pseudo-labels for unlabeled objects and\ngenerate diverse scenes with different compositions of objects and backgrounds.\nAs the scene synthesis is sensitive to the quality of pseudo-labels, we further\npropose a hardness-aware strategy to reduce the effect of low-quality\npseudo-labels and maintain a dynamic pseudo-database to ensure the diversity\nand quality of synthetic scenes. Extensive experimental results on the widely\nused KITTI and Waymo datasets demonstrate the superiority of the proposed HASS\nmethod, which outperforms existing semi-supervised learning methods on 3D\nobject detection. Code: https://github.com/wzzheng/HASS.", "paper_summary_zh": "3D 物件偵測旨在恢復相關物件的 3D 資訊，並作為自動駕駛感知的基本任務。其效能很大程度取決於標籤訓練資料的規模，然而取得高品質的點雲資料註解代價高昂。雖然傳統方法專注於為未標籤樣本產生偽標籤作為訓練的補充，但 3D 點雲資料的結構特性有助於組成物件和背景，以合成逼真的場景。基於此，我們提出一個硬度感知場景合成 (HASS) 方法，以產生自適應合成場景，以改善偵測模型的泛化。我們為未標籤物件取得偽標籤，並產生具有不同物件和背景組成的多元場景。由於場景合成對偽標籤的品質很敏感，我們進一步提出一個硬度感知策略，以減少低品質偽標籤的影響，並維護一個動態偽資料庫，以確保合成場景的多元性和品質。在廣泛使用的 KITTI 和 Waymo 資料集上進行的廣泛實驗結果證明了所提出的 HASS 方法的優越性，它在 3D 物件偵測方面優於現有的半監督式學習方法。程式碼：https://github.com/wzzheng/HASS。", "author": "Shuai Zeng et.al.", "authors": "Shuai Zeng, Wenzhao Zheng, Jiwen Lu, Haibin Yan", "id": "2405.17422v1", "paper_url": "http://arxiv.org/abs/2405.17422v1", "repo": "https://github.com/wzzheng/hass"}}