{"2412.17799": {"publish_time": "2024-12-23", "title": "Automating the Search for Artificial Life with Foundation Models", "paper_summary": "With the recent Nobel Prize awarded for radical advances in protein\ndiscovery, foundation models (FMs) for exploring large combinatorial spaces\npromise to revolutionize many scientific fields. Artificial Life (ALife) has\nnot yet integrated FMs, thus presenting a major opportunity for the field to\nalleviate the historical burden of relying chiefly on manual design and\ntrial-and-error to discover the configurations of lifelike simulations. This\npaper presents, for the first time, a successful realization of this\nopportunity using vision-language FMs. The proposed approach, called Automated\nSearch for Artificial Life (ASAL), (1) finds simulations that produce target\nphenomena, (2) discovers simulations that generate temporally open-ended\nnovelty, and (3) illuminates an entire space of interestingly diverse\nsimulations. Because of the generality of FMs, ASAL works effectively across a\ndiverse range of ALife substrates including Boids, Particle Life, Game of Life,\nLenia, and Neural Cellular Automata. A major result highlighting the potential\nof this technique is the discovery of previously unseen Lenia and Boids\nlifeforms, as well as cellular automata that are open-ended like Conway's Game\nof Life. Additionally, the use of FMs allows for the quantification of\npreviously qualitative phenomena in a human-aligned way. This new paradigm\npromises to accelerate ALife research beyond what is possible through human\ningenuity alone.", "paper_summary_zh": "隨著最近諾貝爾獎授予蛋白質發現的激進進展，探索大型組合空間的基礎模型 (FM) 承諾將徹底改變許多科學領域。人工生命 (ALife) 尚未整合 FM，因此為該領域提供了一個重大的機會，以減輕主要依賴手動設計和試錯來發現逼真模擬的配置的歷史負擔。本文首次提出使用視覺語言 FM 成功實現這一機會。所提出的方法稱為人工生命自動搜尋 (ASAL)，（1）找到產生目標現象的模擬，（2）發現產生時間開放式創新的模擬，以及（3）說明整個有趣多樣性模擬空間。由於 FM 的普遍性，ASAL 在包括 Boids、Particle Life、生命遊戲、Lenia 和神經元細胞自動機在內的各種 ALife 基質中有效運行。強調此技術潛力的主要結果是發現以前未見過的 Lenia 和 Boids 生命形式，以及像康威生命遊戲一樣開放式的細胞自動機。此外，FM 的使用允許以與人類一致的方式量化先前的定性現象。這種新的範例有望加速 ALife 研究，超越僅通過人類智慧所能達到的範圍。", "author": "Akarsh Kumar et.al.", "authors": "Akarsh Kumar, Chris Lu, Louis Kirsch, Yujin Tang, Kenneth O. Stanley, Phillip Isola, David Ha", "id": "2412.17799v1", "paper_url": "http://arxiv.org/abs/2412.17799v1", "repo": "https://github.com/sakanaai/asal"}}