{"2502.02170": {"publish_time": "2025-02-04", "title": "Graph Neural Networks for O-RAN Mobility Management: A Link Prediction Approach", "paper_summary": "Mobility performance has been a key focus in cellular networks up to 5G. To\nenhance handover (HO) performance, 3GPP introduced Conditional Handover (CHO)\nand Layer 1/Layer 2 Triggered Mobility (LTM) mechanisms in 5G. While these\nreactive HO strategies address the trade-off between HO failures (HOF) and\nping-pong effects, they often result in inefficient radio resource utilization\ndue to additional HO preparations. To overcome these challenges, this article\nproposes a proactive HO framework for mobility management in O-RAN, leveraging\nuser-cell link predictions to identify the optimal target cell for HO. We\nexplore various categories of Graph Neural Networks (GNNs) for link prediction\nand analyze the complexity of applying them to the mobility management domain.\nTwo GNN models are compared using a real-world dataset, with experimental\nresults demonstrating their ability to capture the dynamic and graph-structured\nnature of cellular networks. Finally, we present key insights from our study\nand outline future steps to enable the integration of GNN-based link prediction\nfor mobility management in 6G networks.", "paper_summary_zh": "行動效能一直是 5G 以下行動網路的重點。為了提升交接 (HO) 效能，3GPP 在 5G 中引入了條件式交接 (CHO) 和第 1 層/第 2 層觸發行動 (LTM) 機制。儘管這些反應式 HO 策略解決了 HO 失敗 (HOF) 和乒乓效應之間的權衡，但由於額外的 HO 準備，它們通常會導致無線電資源利用率低。為了克服這些挑戰，本文提出了一個用於 O-RAN 行動管理的預防式 HO 架構，利用使用者-基地台連結預測來找出 HO 的最佳目標基地台。我們探討了各種類別的圖神經網路 (GNN)，用於連結預測，並分析將它們應用於行動管理領域的複雜性。使用真實世界的資料集比較了兩個 GNN 模型，實驗結果證明了它們擷取行動網路動態和圖形結構特性的能力。最後，我們提出了研究中的主要見解，並概述了未來步驟，以在 6G 網路中整合基於 GNN 的連結預測，進行行動管理。", "author": "Ana Gonzalez Bermudez et.al.", "authors": "Ana Gonzalez Bermudez, Miquel Farreras, Milan Groshev, José Antonio Trujillo, Isabel de la Bandera, Raquel Barco", "id": "2502.02170v1", "paper_url": "http://arxiv.org/abs/2502.02170v1", "repo": "null"}}