{"2407.07364": {"publish_time": "2024-07-10", "title": "Real-time system optimal traffic routing under uncertainties -- Can physics models boost reinforcement learning?", "paper_summary": "System optimal traffic routing can mitigate congestion by assigning routes\nfor a portion of vehicles so that the total travel time of all vehicles in the\ntransportation system can be reduced. However, achieving real-time optimal\nrouting poses challenges due to uncertain demands and unknown system dynamics,\nparticularly in expansive transportation networks. While physics model-based\nmethods are sensitive to uncertainties and model mismatches, model-free\nreinforcement learning struggles with learning inefficiencies and\ninterpretability issues. Our paper presents TransRL, a novel algorithm that\nintegrates reinforcement learning with physics models for enhanced performance,\nreliability, and interpretability. TransRL begins by establishing a\ndeterministic policy grounded in physics models, from which it learns from and\nis guided by a differentiable and stochastic teacher policy. During training,\nTransRL aims to maximize cumulative rewards while minimizing the Kullback\nLeibler (KL) divergence between the current policy and the teacher policy. This\napproach enables TransRL to simultaneously leverage interactions with the\nenvironment and insights from physics models. We conduct experiments on three\ntransportation networks with up to hundreds of links. The results demonstrate\nTransRL's superiority over traffic model-based methods for being adaptive and\nlearning from the actual network data. By leveraging the information from\nphysics models, TransRL consistently outperforms state-of-the-art reinforcement\nlearning algorithms such as proximal policy optimization (PPO) and soft actor\ncritic (SAC). Moreover, TransRL's actions exhibit higher reliability and\ninterpretability compared to baseline reinforcement learning approaches like\nPPO and SAC.", "paper_summary_zh": "<paragraph>系統最佳交通路線規劃可以透過分配車輛路線，減少交通壅塞，進而減少運輸系統中所有車輛的總體行駛時間。然而，由於不確定的需求和未知的系統動態，特別是在廣大的運輸網路中，要達成即時的最佳路線規劃會遇到挑戰。雖然基於物理模型的方法對不確定性和模型不匹配很敏感，但無模型的強化學習則在學習效率低落和可解釋性問題上掙扎。我們的論文提出了 TransRL，一種創新的演算法，它將強化學習與物理模型整合，以提升效能、可靠性和可解釋性。TransRL 首先建立一個基於物理模型的確定性政策，從中學習並由一個可微分且隨機的老師政策指導。在訓練期間，TransRL 旨在最大化累積獎勵，同時最小化當前政策與老師政策之間的 Kullback Leibler (KL) 距離。這種方法使 TransRL 能同時利用與環境的互動和物理模型的見解。我們在三個具有數百個連結的運輸網路中進行實驗。結果證明 TransRL 優於基於交通模型的方法，因為它具有適應性，並能從實際網路資料中學習。透過利用物理模型中的資訊，TransRL 持續優於最先進的強化學習演算法，例如近端政策最佳化 (PPO) 和軟性動作評論家 (SAC)。此外，與 PPO 和 SAC 等基線強化學習方法相比，TransRL 的動作展現出更高的可靠性和可解釋性。</paragraph>", "author": "Zemian Ke et.al.", "authors": "Zemian Ke, Qiling Zou, Jiachao Liu, Sean Qian", "id": "2407.07364v1", "paper_url": "http://arxiv.org/abs/2407.07364v1", "repo": "null"}}