{"2412.15453": {"publish_time": "2024-12-19", "title": "Northeastern Uni at Multilingual Counterspeech Generation: Enhancing Counter Speech Generation with LLM Alignment through Direct Preference Optimization", "paper_summary": "The automatic generation of counter-speech (CS) is a critical strategy for\naddressing hate speech by providing constructive and informed responses.\nHowever, existing methods often fail to generate high-quality, impactful, and\nscalable CS, particularly across diverse linguistic contexts. In this paper, we\npropose a novel methodology to enhance CS generation by aligning Large Language\nModels (LLMs) using Supervised Fine-Tuning (SFT) and Direct Preference\nOptimization (DPO). Our approach leverages DPO to align LLM outputs with human\npreferences, ensuring contextually appropriate and linguistically adaptable\nresponses. Additionally, we incorporate knowledge grounding to enhance the\nfactual accuracy and relevance of generated CS. Experimental results\ndemonstrate that DPO-aligned models significantly outperform SFT baselines on\nCS benchmarks while scaling effectively to multiple languages. These findings\nhighlight the potential of preference-based alignment techniques to advance CS\ngeneration across varied linguistic settings. The model supervision and\nalignment is done in English and the same model is used for reporting metrics\nacross other languages like Basque, Italian, and Spanish.", "paper_summary_zh": "反論述 (CS) 的自動產生是透過提供具建設性且有根據的回應來解決仇恨言論的一項關鍵策略。\n然而，現有方法通常無法產生高品質、有影響力且可擴充的 CS，特別是在不同的語言環境中。在本文中，我們提出了一種新的方法論，透過使用監督微調 (SFT) 和直接偏好最佳化 (DPO) 來調整大型語言模型 (LLM)，以增強 CS 的產生。我們的做法利用 DPO 將 LLM 輸出與人類偏好對齊，確保在語境上適當且在語言上適應性強的回應。此外，我們納入了知識基礎，以增強所產生 CS 的事實準確性和相關性。實驗結果表明，DPO 對齊模型在 CS 基準上顯著優於 SFT 基準，同時有效地擴充到多種語言。這些發現突顯了基於偏好的對齊技術在推進不同語言環境中的 CS 產生的潛力。模型監督和對齊是在英語中完成的，並且使用相同的模型來報告巴斯克語、義大利語和西班牙語等其他語言的指標。", "author": "Sahil Wadhwa et.al.", "authors": "Sahil Wadhwa, Chengtian Xu, Haoming Chen, Aakash Mahalingam, Akankshya Kar, Divya Chaudhary", "id": "2412.15453v1", "paper_url": "http://arxiv.org/abs/2412.15453v1", "repo": "null"}}