{"2406.17753": {"publish_time": "2024-06-25", "title": "Measuring and Benchmarking Large Language Models' Capabilities to Generate Persuasive Language", "paper_summary": "We are exposed to much information trying to influence us, such as teaser\nmessages, debates, politically framed news, and propaganda - all of which use\npersuasive language. With the recent interest in Large Language Models (LLMs),\nwe study the ability of LLMs to produce persuasive text. As opposed to prior\nwork which focuses on particular domains or types of persuasion, we conduct a\ngeneral study across various domains to measure and benchmark to what degree\nLLMs produce persuasive text - both when explicitly instructed to rewrite text\nto be more or less persuasive and when only instructed to paraphrase. To this\nend, we construct a new dataset, Persuasive-Pairs, of pairs each consisting of\na short text and of a text rewritten by an LLM to amplify or diminish\npersuasive language. We multi-annotate the pairs on a relative scale for\npersuasive language. This data is not only a valuable resource in itself, but\nwe also show that it can be used to train a regression model to predict a score\nof persuasive language between text pairs. This model can score and benchmark\nnew LLMs across domains, thereby facilitating the comparison of different LLMs.\nFinally, we discuss effects observed for different system prompts. Notably, we\nfind that different 'personas' in the system prompt of LLaMA3 change the\npersuasive language in the text substantially, even when only instructed to\nparaphrase. These findings underscore the importance of investigating\npersuasive language in LLM generated text.", "paper_summary_zh": "<paragraph>我們會接觸到許多試圖影響我們的資訊，例如預告訊息、辯論、政治框架新聞和宣傳，所有這些都使用具說服力的語言。隨著最近對大型語言模型 (LLM) 的興趣，我們研究了 LLM 產生具說服力文字的能力。與專注於特定領域或說服類型的先前研究相反，我們在各種領域進行了一項一般性研究，以衡量和基準 LLM 產生具說服力文字的程度，無論是在明確指示改寫文字以使其更具說服力或更不具說服力時，或僅指示進行同義改寫時。為此，我們構建了一個新資料集 Persuasive-Pairs，其中每一對都包含一段簡短文字和一段由 LLM 改寫的文字，以擴大或減少具說服力的語言。我們以相對量表對這些對進行多重註解，以表示具說服力的語言。這些資料本身不僅是一個有價值的資源，我們還展示了它可用於訓練回歸模型，以預測文本對之間具說服力的語言分數。此模型可以在各個領域對新的 LLM 進行評分和基準測試，從而促進對不同 LLM 的比較。最後，我們討論了對不同系統提示觀察到的影響。值得注意的是，我們發現 LLaMA3 系統提示中的不同「角色」會大幅改變文字中的具說服力語言，即使僅指示進行同義改寫時也是如此。這些發現強調了調查 LLM 生成的文字中具說服力語言的重要性。</paragraph>", "author": "Amalie Brogaard Pauli et.al.", "authors": "Amalie Brogaard Pauli, Isabelle Augenstein, Ira Assent", "id": "2406.17753v1", "paper_url": "http://arxiv.org/abs/2406.17753v1", "repo": "null"}}