{"2412.11672": {"publish_time": "2024-12-16", "title": "LLM-DaaS: LLM-driven Drone-as-a-Service Operations from Text User Requests", "paper_summary": "We propose LLM-DaaS, a novel Drone-as-a-Service (DaaS) framework that\nleverages Large Language Models (LLMs) to transform free-text user requests\ninto structured, actionable DaaS operation tasks. Our approach addresses the\nkey challenge of interpreting and structuring natural language input to\nautomate drone service operations under uncertain conditions. The system is\ncomposed of three main components: free-text request processing, structured\nrequest generation, and dynamic DaaS selection and composition. First, we\nfine-tune different LLM models such as Phi-3.5, LLaMA-3.2 7b and Gemma 2b on a\ndataset of text user requests mapped to structured DaaS requests. Users\ninteract with our model in a free conversational style, discussing package\ndelivery requests, while the fine-tuned LLM extracts DaaS metadata such as\ndelivery time, source and destination locations, and package weight. The DaaS\nservice selection model is designed to select the best available drone capable\nof delivering the requested package from the delivery point to the nearest\noptimal destination. Additionally, the DaaS composition model composes a\nservice from a set of the best available drones to deliver the package from the\nsource to the final destination. Second, the system integrates real-time\nweather data to optimize drone route planning and scheduling, ensuring safe and\nefficient operations. Simulations demonstrate the system's ability to\nsignificantly improve task accuracy, operational efficiency, and establish\nLLM-DaaS as a robust solution for DaaS operations in uncertain environments.", "paper_summary_zh": "<paragraph>我們提出 LLM-DaaS，一個新穎的無人機即服務 (DaaS) 框架，利用大型語言模型 (LLM) 將自由文字使用者要求轉換為結構化的、可操作的 DaaS 操作任務。我們的做法解決了在不確定的條件下自動化無人機服務操作時，解釋和結構化自然語言輸入的主要挑戰。系統由三個主要組成部分組成：自由文字請求處理、結構化請求產生，以及動態 DaaS 選擇和組合。首先，我們對不同的 LLM 模型（例如 Phi-3.5、LLaMA-3.2 7b 和 Gemma 2b）進行微調，採用一個將文字使用者請求映射到結構化 DaaS 請求的資料集。使用者以自由對話方式與我們的模型互動，討論包裹遞送請求，而微調後的 LLM 會擷取 DaaS 元資料，例如遞送時間、來源和目的地位置，以及包裹重量。DaaS 服務選擇模型旨在選擇最佳可用的無人機，能夠從遞送點將請求的包裹遞送至最近的最佳目的地。此外，DaaS 組合模型會從一組最佳可用無人機中組合一項服務，以將包裹從來源遞送至最終目的地。其次，系統整合即時天氣資料以最佳化無人機路線規劃和排程，確保安全且有效率的操作。模擬證明了系統顯著提升任務準確度、營運效率的能力，並將 LLM-DaaS 建立為不確定環境中 DaaS 操作的穩健解決方案。</paragraph>", "author": "Lillian Wassim et.al.", "authors": "Lillian Wassim, Kamal Mohamed, Ali Hamdi", "id": "2412.11672v1", "paper_url": "http://arxiv.org/abs/2412.11672v1", "repo": "null"}}