{"2407.08303": {"publish_time": "2024-07-11", "title": "DenseFusion-1M: Merging Vision Experts for Comprehensive Multimodal Perception", "paper_summary": "Existing Multimodal Large Language Models (MLLMs) increasingly emphasize\ncomplex understanding of various visual elements, including multiple objects,\ntext information, and spatial relations. Their development for comprehensive\nvisual perception hinges on the availability of high-quality image-text\ndatasets that offer diverse visual elements and throughout image descriptions.\nHowever, the scarcity of such hyper-detailed datasets currently hinders\nprogress within the MLLM community. The bottleneck stems from the limited\nperceptual capabilities of current caption engines, which fall short in\nproviding complete and accurate annotations. To facilitate the cutting-edge\nresearch of MLLMs on comprehensive vision perception, we thereby propose\nPerceptual Fusion, using a low-budget but highly effective caption engine for\ncomplete and accurate image descriptions. Specifically, Perceptual Fusion\nintegrates diverse perception experts as image priors to provide explicit\ninformation on visual elements and adopts an efficient MLLM as a centric pivot\nto mimic advanced MLLMs' perception abilities. We carefully select 1M highly\nrepresentative images from uncurated LAION dataset and generate dense\ndescriptions using our engine, dubbed DenseFusion-1M. Extensive experiments\nvalidate that our engine outperforms its counterparts, where the resulting\ndataset significantly improves the perception and cognition abilities of\nexisting MLLMs across diverse vision-language benchmarks, especially with\nhigh-resolution images as inputs. The dataset and code are publicly available\nat https://github.com/baaivision/DenseFusion.", "paper_summary_zh": "現有的多模態大型語言模型 (MLLM) 愈來愈重視對各種視覺元素的複雜理解，包括多個物件、文字資訊和空間關係。它們對於全面視覺感知的發展取決於高品質影像文字資料集的可用性，這些資料集提供多樣化的視覺元素和整個影像描述。然而，此類超詳細資料集的稀少性目前阻礙了 MLLM 社群內的進展。瓶頸源自於當前標題引擎有限的感知能力，無法提供完整且準確的註解。為了促進 MLLM 在全面視覺感知方面的尖端研究，我們因此提出感知融合，使用低預算但高效率的標題引擎來提供完整且準確的影像描述。具體來說，感知融合將多樣化的感知專家整合為影像先驗，以提供視覺元素的明確資訊，並採用高效能的 MLLM 作為中心樞紐來模擬進階 MLLM 的感知能力。我們仔細從未經整理的 LAION 資料集中挑選 100 萬張極具代表性的影像，並使用我們稱為 DenseFusion-1M 的引擎產生密集描述。廣泛的實驗驗證我們的引擎優於同類型引擎，其中產生的資料集顯著提升現有 MLLM 在各種視覺語言基準上的感知和認知能力，特別是以高解析度影像作為輸入時。資料集和程式碼可在 https://github.com/baaivision/DenseFusion 公開取得。", "author": "Xiaotong Li et.al.", "authors": "Xiaotong Li, Fan Zhang, Haiwen Diao, Yueze Wang, Xinlong Wang, Ling-Yu Duan", "id": "2407.08303v1", "paper_url": "http://arxiv.org/abs/2407.08303v1", "repo": "https://github.com/baaivision/densefusion"}}