{"2412.20601": {"publish_time": "2024-12-29", "title": "MATEY: multiscale adaptive foundation models for spatiotemporal physical systems", "paper_summary": "Accurate representation of the multiscale features in spatiotemporal physical\nsystems using vision transformer (ViT) architectures requires extremely long,\ncomputationally prohibitive token sequences. To address this issue, we propose\ntwo adaptive tokenization schemes that dynamically adjust patch sizes based on\nlocal features: one ensures convergent behavior to uniform patch refinement,\nwhile the other offers better computational efficiency. Moreover, we present a\nset of spatiotemporal attention schemes, where the temporal or axial spatial\ndimensions are decoupled, and evaluate their computational and data\nefficiencies. We assess the performance of the proposed multiscale adaptive\nmodel, MATEY, in a sequence of experiments. The results show that adaptive\ntokenization schemes achieve improved accuracy without significantly increasing\nthe length of the token sequence. Compared to a full spatiotemporal attention\nscheme or a scheme that decouples only the temporal dimension, we find that\nfully decoupled axial attention is less efficient and expressive, requiring\nmore training time and model weights to achieve the same accuracy. Finally, we\ndemonstrate in two fine-tuning tasks featuring different physics that models\npretrained on PDEBench data outperform the ones trained from scratch,\nespecially in the low data regime with frozen attention.", "paper_summary_zh": "使用視覺Transformer (ViT) 架構精確表示時空物理系統中的多尺度特徵需要極長且計算成本過高的標記序列。為了解決此問題，我們提出了兩種自適應標記化架構，可根據局部特徵動態調整區塊大小：一種確保收斂行為以進行均勻區塊細化，而另一種則提供更好的計算效率。此外，我們提出了一組時空注意力架構，其中時序或軸向空間維度是解耦的，並評估其計算和資料效率。我們在實驗序列中評估所提出的多尺度自適應模型 MATEY 的效能。結果顯示，自適應標記化架構在未顯著增加標記序列長度的情況下，可提高準確度。與完全時空注意力架構或僅解耦時序維度的架構相比，我們發現完全解耦的軸向注意力效率較低且表達力較差，需要更多訓練時間和模型權重才能達到相同的準確度。最後，我們在兩個具有不同物理特性的微調任務中證明，在 PDEBench 資料上預先訓練的模型優於從頭開始訓練的模型，特別是在凍結注意力的低資料範圍內。", "author": "Pei Zhang et.al.", "authors": "Pei Zhang, M. Paul Laiu, Matthew Norman, Doug Stefanski, John Gounley", "id": "2412.20601v1", "paper_url": "http://arxiv.org/abs/2412.20601v1", "repo": "null"}}