{"2407.16026": {"publish_time": "2024-07-22", "title": "KWT-Tiny: RISC-V Accelerated, Embedded Keyword Spotting Transformer", "paper_summary": "This paper explores the adaptation of Transformerbased models for edge\ndevices through the quantisation and hardware acceleration of the ARM Keyword\nTransformer (KWT) model on a RISC-V platform. The model was targeted to run on\n64kB RAM in bare-metal C using a custom-developed edge AI library. KWT-1 was\nretrained to be 369 times smaller, with only a 10% loss in accuracy through\nreducing output classes from 35 to 2. The retraining and quantisation reduced\nmodel size from 2.42 MB to 1.65 kB. The integration of custom RISC-V\ninstructions that accelerated GELU and SoftMax operations enabled a 5x speedup\nand thus ~5x power reduction in inference, with inference clock cycle counts\ndecreasing from 26 million to 5.5 million clock cycles while incurring a small\narea overhead of approximately 29%. The results demonstrate a viable method for\nporting and accelerating Transformer-based models in low-power IoT devices.", "paper_summary_zh": "本文探討了透過量化和硬體加速 ARM 關鍵字轉換器 (KWT) 模型於 RISC-V 平台上，將基於 Transformer 的模型調整到邊緣裝置。該模型目標在於使用自訂開發的邊緣 AI 函式庫，以裸機 C 語言在 64kB RAM 上執行。KWT-1 重新訓練後縮小為 369 倍，但輸出類別從 35 減少到 2，僅損失 10% 的準確度。重新訓練和量化將模型大小從 2.42 MB 縮小到 1.65 kB。整合自訂 RISC-V 指令加速 GELU 和 SoftMax 運算，使推論速度提升 5 倍，進而將推論功耗降低約 5 倍，推論時脈週期數從 2600 萬減少到 550 萬時脈週期，同時增加約 29% 的小面積開銷。結果證明了將基於 Transformer 的模型移植到低功耗 IoT 裝置並加速其運作的可行方法。", "author": "Aness Al-Qawlaq et.al.", "authors": "Aness Al-Qawlaq, Ajay Kumar M, Deepu John", "id": "2407.16026v1", "paper_url": "http://arxiv.org/abs/2407.16026v1", "repo": "null"}}