{"2405.19315": {"publish_time": "2024-05-29", "title": "Matryoshka Query Transformer for Large Vision-Language Models", "paper_summary": "Large Vision-Language Models (LVLMs) typically encode an image into a fixed\nnumber of visual tokens (e.g., 576) and process these tokens with a language\nmodel. Despite their strong performance, LVLMs face challenges in adapting to\nvarying computational constraints. This raises the question: can we achieve\nflexibility in the number of visual tokens to suit different tasks and\ncomputational resources? We answer this with an emphatic yes. Inspired by\nMatryoshka Representation Learning, we introduce the Matryoshka Query\nTransformer (MQT), capable of encoding an image into m visual tokens during\ninference, where m can be any number up to a predefined maximum. This is\nachieved by employing a query transformer with M latent query tokens to\ncompress the visual embeddings. During each training step, we randomly select m\n<= M latent query tokens and train the model using only these first m tokens,\ndiscarding the rest. Combining MQT with LLaVA, we train a single model once,\nand flexibly and drastically reduce the number of inference-time visual tokens\nwhile maintaining similar or better performance compared to training\nindependent models for each number of tokens. Our model, MQT-LLAVA, matches\nLLaVA-1.5 performance across 11 benchmarks using a maximum of 256 tokens\ninstead of LLaVA's fixed 576. Reducing to 16 tokens (8x less TFLOPs) only\nsacrifices the performance by 2.4 points on MMBench. On certain tasks such as\nScienceQA and MMMU, we can even go down to only 2 visual tokens with\nperformance drops of just 3% and 6% each. Our exploration of the trade-off\nbetween the accuracy and computational cost brought about by the number of\nvisual tokens facilitates future research to achieve the best of both worlds.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 通常將影像編碼成固定數量的視覺代幣（例如 576 個），並使用語言模型處理這些代幣。儘管 LVLMs 效能強大，但它們在適應不同的運算限制時會遇到挑戰。這引發了一個問題：我們能否調整視覺代幣數量以適應不同的任務和運算資源？我們的答案是肯定的。受到 Matryoshka 表徵學習的啟發，我們引入了 Matryoshka 查詢轉換器 (MQT)，它能夠在推理過程中將影像編碼成 m 個視覺代幣，其中 m 可以是任何小於預定義最大值的數字。這是透過使用具有 M 個潛在查詢代幣的查詢轉換器來壓縮視覺嵌入來實現的。在每個訓練步驟中，我們會隨機選擇 m <= M 個潛在查詢代幣，並僅使用這些前 m 個代幣來訓練模型，捨棄其餘的代幣。將 MQT 與 LLaVA 結合，我們一次訓練一個模型，並靈活且大幅減少推理時間視覺代幣的數量，同時維持與為每個代幣數量訓練獨立模型相當或更好的效能。我們的模型 MQT-LLAVA 使用最多 256 個代幣，而不是 LLaVA 的固定 576 個代幣，在 11 個基準測試中與 LLaVA-1.5 的效能相符。減少到 16 個代幣（8 倍 TFLOPs）只會在 MMBench 上犧牲 2.4 個效能點數。在某些任務上，例如 ScienceQA 和 MMMU，我們甚至可以使用只有 2 個視覺代幣，效能只下降 3% 和 6%。我們探索視覺代幣數量帶來的準確性和運算成本之間的權衡，有助於未來的研究實現兩全其美。", "author": "Wenbo Hu et.al.", "authors": "Wenbo Hu, Zi-Yi Dou, Liunian Harold Li, Amita Kamath, Nanyun Peng, Kai-Wei Chang", "id": "2405.19315v1", "paper_url": "http://arxiv.org/abs/2405.19315v1", "repo": "https://github.com/gordonhu608/mqt-llava"}}