{"2405.08402": {"publish_time": "2024-05-14", "title": "Investigating the 'Autoencoder Behavior' in Speech Self-Supervised Models: a focus on HuBERT's Pretraining", "paper_summary": "Self-supervised learning has shown great success in Speech Recognition.\nHowever, it has been observed that finetuning all layers of the learned model\nleads to lower performance compared to resetting top layers. This phenomenon is\nattributed to the ''autoencoder'' behavior: top layers contain information\ncloser to the input and are less suitable for tasks that require linguistic\ninformation, such as Speech Recognition.To better our understanding of this\nbehavior, we propose to study the evolution of high-level information within\nthe model during pretraining. We focus on the HuBERT model, which exhibits a\nless pronounced ''autoencoder'' behavior. By experimentally exploring various\nfactors that may have an impact, we aim to improve the training procedure and\nenhance the top layers of HuBERT for high-level tasks.Furthermore, our\nexperiments demonstrate that these improvements in the training procedure\nresult in faster convergence and competitive performance on downstream tasks.", "paper_summary_zh": "自監督學習在語音辨識上已展現極佳成效。\n然而，已觀察到微調學習模型的所有層級\n與重設頂層相比，會導致較低的效能。這種現象\n歸因於「自動編碼器」行為：頂層包含更接近輸入的資訊，較不適合於需要語言資訊的任務，例如語音辨識。為了更了解這種\n行為，我們提議研究預訓練期間模型內部高階資訊的演化。我們專注於 HuBERT 模型，它表現出較不顯著的「自動編碼器」行為。透過實驗探討可能產生影響的各種因素，我們旨在改善訓練程序，並增強 HuBERT 頂層以執行高階任務。此外，我們的\n實驗證明，訓練程序的這些改進會導致下游任務的收斂速度加快，且效能具競爭力。", "author": "Valentin Vielzeuf et.al.", "authors": "Valentin Vielzeuf", "id": "2405.08402v1", "paper_url": "http://arxiv.org/abs/2405.08402v1", "repo": "null"}}