{"2502.02153": {"publish_time": "2025-02-04", "title": "Vulnerability Mitigation for Safety-Aligned Language Models via Debiasing", "paper_summary": "Safety alignment is an essential research topic for real-world AI\napplications. Despite the multifaceted nature of safety and trustworthiness in\nAI, current safety alignment methods often focus on a comprehensive notion of\nsafety. By carefully assessing models from the existing safety-alignment\nmethods, we found that, while they generally improved overall safety\nperformance, they failed to ensure safety in specific categories. Our study\nfirst identified the difficulty of eliminating such vulnerabilities without\nsacrificing the model's helpfulness. We observed that, while smaller KL penalty\nparameters, increased training iterations, and dataset cleansing can enhance\nsafety, they do not necessarily improve the trade-off between safety and\nhelpfulness. We discovered that safety alignment could even induce undesired\neffects and result in a model that prefers generating negative tokens leading\nto rejective responses, regardless of the input context. To address this, we\nintroduced a learning-free method, Token-level Safety-Debiased Inference\n(TSDI), to estimate and correct this bias during the generation process using\nrandomly constructed prompts. Our experiments demonstrated that our method\ncould enhance the model's helpfulness while maintaining safety, thus improving\nthe trade-off Pareto-front.", "paper_summary_zh": "安全校準是真實世界 AI 應用中一個重要的研究主題。儘管 AI 中的安全性和可信賴性具有多方面的性質，但當前的安全校準方法通常側重於全面的安全概念。通過仔細評估現有安全校準方法中的模型，我們發現，儘管它們普遍改善了整體安全性能，但它們未能確保特定類別中的安全性。我們的研究首先確定了在不犧牲模型的幫助下消除此類漏洞的難度。我們觀察到，儘管較小的 KL 懲罰參數、增加的訓練迭代和資料集清理可以增強安全性，但它們不一定能改善安全性和幫助之間的權衡。我們發現，安全校準甚至會誘發不良影響，並導致模型偏好產生負面代幣，從而導致拒絕回應，而不管輸入內容如何。為了解決這個問題，我們引入了一種無學習方法，即代幣級別安全去偏差推論 (TSDI)，以在生成過程中使用隨機構造的提示來估計和糾正這種偏差。我們的實驗表明，我們的模型可以在保持安全性的同時增強模型的幫助，從而改善權衡帕累托前緣。", "author": "Thien Q. Tran et.al.", "authors": "Thien Q. Tran, Akifumi Wachi, Rei Sato, Takumi Tanabe, Youhei Akimoto", "id": "2502.02153v1", "paper_url": "http://arxiv.org/abs/2502.02153v1", "repo": "null"}}