{"2503.13401": {"publish_time": "2025-03-17", "title": "Using the Tools of Cognitive Science to Understand Large Language Models at Different Levels of Analysis", "paper_summary": "Modern artificial intelligence systems, such as large language models, are\nincreasingly powerful but also increasingly hard to understand. Recognizing\nthis problem as analogous to the historical difficulties in understanding the\nhuman mind, we argue that methods developed in cognitive science can be useful\nfor understanding large language models. We propose a framework for applying\nthese methods based on Marr's three levels of analysis. By revisiting\nestablished cognitive science techniques relevant to each level and\nillustrating their potential to yield insights into the behavior and internal\norganization of large language models, we aim to provide a toolkit for making\nsense of these new kinds of minds.", "paper_summary_zh": "現代人工智慧系統，例如大型語言模型，功能越來越強大，但也越來越難以理解。認識到這個問題與歷史上理解人類思維的困難類似，我們認為認知科學中發展的方法可以有效地用於理解大型語言模型。我們基於馬爾的三個分析層級，提出了一個應用這些方法的框架。通過重新審視與每個層級相關的既有認知科學技術，並說明它們在深入了解大型語言模型的行為和內部組織方面的潛力，我們的目標是提供一個工具包，用於理解這些新型態的思維。\n", "author": "Alexander Ku et.al.", "authors": "Alexander Ku, Declan Campbell, Xuechunzi Bai, Jiayi Geng, Ryan Liu, Raja Marjieh, R. Thomas McCoy, Andrew Nam, Ilia Sucholutsky, Veniamin Veselovsky, Liyi Zhang, Jian-Qiao Zhu, Thomas L. Griffiths", "id": "2503.13401v1", "paper_url": "http://arxiv.org/abs/2503.13401v1", "repo": "null"}}