{"2502.15343": {"publish_time": "2025-02-21", "title": "Tokenization is Sensitive to Language Variation", "paper_summary": "Variation in language is ubiquitous and often systematically linked to\nregional, social, and contextual factors. Tokenizers split texts into smaller\nunits and might behave differently for less common linguistic forms. This might\naffect downstream LLM performance differently on two types of tasks: Tasks\nwhere the model should be robust to language variation (e.g., for semantic\ntasks like NLI, labels do not depend on whether a text uses British or American\nspelling) and tasks where the model should be sensitive to language variation\n(e.g., for form-based tasks like authorship verification, labels depend on\nwhether a text uses British or American spelling). We pre-train BERT base\nmodels for the popular Byte-Pair Encoding algorithm to investigate how key\nalgorithmic design choices impact downstream models' performances: fitting\ncorpus, pre-tokenizer and vocabulary size. We find that the best tokenizer\nvaries on the two task types -- with the pre-tokenizer having the biggest\nimpact on performance. Further, we introduce a new approach to estimate\ntokenizer impact on downstream LLM performance, showing significant improvement\nover techniques like R\\'enyi efficiency. We encourage more work on language\nvariation and its relation to tokenizers and thus LLM performance.", "paper_summary_zh": "語言變異無所不在，且經常與區域、社會和情境因素系統性地連結。標記化器將文字分割成較小的單位，對於較不常見的語言形式，其行為可能有所不同。這可能會對兩種任務的下游 LLM 效能產生不同的影響：模型應該對語言變異具有穩健性的任務（例如，對於 NLI 等語義任務，標籤不取決於文字採用英式或美式拼寫）以及模型應該對語言變異敏感的任務（例如，對於作者驗證等基於形式的任務，標籤取決於文字採用英式或美式拼寫）。我們針對熱門的 Byte-Pair 編碼演算法預先訓練 BERT 基礎模型，以探討關鍵演算法設計選項如何影響下游模型的效能：擬合語料庫、預先標記化器和詞彙量大小。我們發現最佳標記化器在兩種任務類型上有所不同，其中預先標記化器對效能的影響最大。此外，我們提出了一種估計標記化器對下游 LLM 效能影響的新方法，顯示出比 R\\'enyi 效率等技術有顯著的進步。我們鼓勵對語言變異及其與標記化器和 LLM 效能的關係進行更多研究。", "author": "Anna Wegmann et.al.", "authors": "Anna Wegmann, Dong Nguyen, David Jurgens", "id": "2502.15343v1", "paper_url": "http://arxiv.org/abs/2502.15343v1", "repo": "null"}}