{"2412.06262": {"publish_time": "2024-12-09", "title": "A Lightweight U-like Network Utilizing Neural Memory Ordinary Differential Equations for Slimming the Decoder", "paper_summary": "In recent years, advanced U-like networks have demonstrated remarkable\nperformance in medical image segmentation tasks. However, their drawbacks,\nincluding excessive parameters, high computational complexity, and slow\ninference speed, pose challenges for practical implementation in scenarios with\nlimited computational resources. Existing lightweight U-like networks have\nalleviated some of these problems, but they often have pre-designed structures\nand consist of inseparable modules, limiting their application scenarios. In\nthis paper, we propose three plug-and-play decoders by employing different\ndiscretization methods of the neural memory Ordinary Differential Equations\n(nmODEs). These decoders integrate features at various levels of abstraction by\nprocessing information from skip connections and performing numerical\noperations on upward path. Through experiments on the PH2, ISIC2017, and\nISIC2018 datasets, we embed these decoders into different U-like networks,\ndemonstrating their effectiveness in significantly reducing the number of\nparameters and FLOPs while maintaining performance. In summary, the proposed\ndiscretized nmODEs decoders are capable of reducing the number of parameters by\nabout 20% ~ 50% and FLOPs by up to 74%, while possessing the potential to adapt\nto all U-like networks. Our code is available at\nhttps://github.com/nayutayuki/Lightweight-nmODE-Decoders-For-U-like-networks.", "paper_summary_zh": "近年來，先進的 U 型網路在醫學影像分割任務中展現出卓越的表現。然而，它們的缺點包括過多的參數、高運算複雜度和緩慢的推論速度，對在運算資源有限的情況下實際執行構成挑戰。現有的輕量級 U 型網路已經減輕了這些問題，但它們通常有預先設計的結構，並包含不可分離的模組，限制了它們的應用場景。在本文中，我們透過採用神經記憶常微分方程式 (nmODE) 的不同離散化方法，提出了三個即插即用的解碼器。這些解碼器透過處理來自跳躍連接的資訊，並在向上路徑上執行數值運算，整合了不同抽象層級的特徵。透過在 PH2、ISIC2017 和 ISIC2018 資料集上的實驗，我們將這些解碼器嵌入到不同的 U 型網路中，證明它們在顯著減少參數和 FLOP 的同時，還能維持效能。總之，所提出的離散 nmODE 解碼器能夠將參數數量減少約 20% ~ 50%，FLOP 最多減少 74%，同時具備適應所有 U 型網路的潛力。我們的程式碼可以在 https://github.com/nayutayuki/Lightweight-nmODE-Decoders-For-U-like-networks 取得。", "author": "Quansong He et.al.", "authors": "Quansong He, Xiaojun Yao, Jun Wu, Zhang Yi, Tao He", "id": "2412.06262v1", "paper_url": "http://arxiv.org/abs/2412.06262v1", "repo": "https://github.com/nayutayuki/lightweight-nmode-decoders-for-u-like-networks"}}