{"2410.03594": {"publish_time": "2024-10-04", "title": "Explicit, Implicit, and Scattered: Revisiting Event Extraction to Capture Complex Arguments", "paper_summary": "Prior works formulate the extraction of event-specific arguments as a span\nextraction problem, where event arguments are explicit -- i.e. assumed to be\ncontiguous spans of text in a document. In this study, we revisit this\ndefinition of Event Extraction (EE) by introducing two key argument types that\ncannot be modeled by existing EE frameworks. First, implicit arguments are\nevent arguments which are not explicitly mentioned in the text, but can be\ninferred through context. Second, scattered arguments are event arguments that\nare composed of information scattered throughout the text. These two argument\ntypes are crucial to elicit the full breadth of information required for proper\nevent modeling.\n  To support the extraction of explicit, implicit, and scattered arguments, we\ndevelop a novel dataset, DiscourseEE, which includes 7,464 argument annotations\nfrom online health discourse. Notably, 51.2% of the arguments are implicit, and\n17.4% are scattered, making DiscourseEE a unique corpus for complex event\nextraction. Additionally, we formulate argument extraction as a text generation\nproblem to facilitate the extraction of complex argument types. We provide a\ncomprehensive evaluation of state-of-the-art models and highlight critical open\nchallenges in generative event extraction. Our data and codebase are available\nat https://omar-sharif03.github.io/DiscourseEE.", "paper_summary_zh": "先前的研究將事件特定論證的提取制定為跨度提取問題，其中事件論證是明確的——即假設為文件中連續的文本跨度。在本研究中，我們通過引入兩個現有 EE 框架無法建模的關鍵論證類型來重新審視事件提取 (EE) 的定義。首先，隱含論證是文中未明確提及的事件論證，但可透過上下文推論。其次，分散論證是事件論證，由散布在文本中的資訊組成。這兩種論證類型對於引出適當事件建模所需的完整資訊至關重要。\n為了支援顯式、隱含和分散論證的提取，我們開發了一個新穎的資料集 DiscourseEE，其中包含來自線上健康論述的 7,464 個論證註解。值得注意的是，51.2% 的論證是隱含的，17.4% 是分散的，這使得 DiscourseEE 成為複雜事件提取的獨特語料庫。此外，我們將論證提取制定為文字生成問題，以利於複雜論證類型的提取。我們提供了對最先進模型的全面評估，並強調了生成式事件提取中的關鍵開放挑戰。我們的資料和程式碼庫可在 https://omar-sharif03.github.io/DiscourseEE 取得。", "author": "Omar Sharif et.al.", "authors": "Omar Sharif, Joseph Gatto, Madhusudan Basak, Sarah M. Preum", "id": "2410.03594v1", "paper_url": "http://arxiv.org/abs/2410.03594v1", "repo": "null"}}