{"2409.17990": {"publish_time": "2024-09-26", "title": "Extracting Affect Aggregates from Longitudinal Social Media Data with Temporal Adapters for Large Language Models", "paper_summary": "This paper proposes temporally aligned Large Language Models (LLMs) as a tool\nfor longitudinal analysis of social media data. We fine-tune Temporal Adapters\nfor Llama 3 8B on full timelines from a panel of British Twitter users, and\nextract longitudinal aggregates of emotions and attitudes with established\nquestionnaires. We validate our estimates against representative British survey\ndata and find strong positive, significant correlations for several collective\nemotions. The obtained estimates are robust across multiple training seeds and\nprompt formulations, and in line with collective emotions extracted using a\ntraditional classification model trained on labeled data. To the best of our\nknowledge, this is the first work to extend the analysis of affect in LLMs to a\nlongitudinal setting through Temporal Adapters. Our work enables new approaches\ntowards the longitudinal analysis of social media data.", "paper_summary_zh": "本文提出了時序對齊的大語言模型 (LLM)，作為進行社群媒體資料縱向分析的工具。我們針對來自英國 Twitter 使用者小組的完整時間軸，微調了 Llama 3 8B 的時序適配器，並透過既定的問卷，提取情緒和態度的縱向彙總。我們根據具有代表性的英國調查資料驗證我們的估計，並發現了多種集體情緒的強正相關性。獲得的估計值在多個訓練種子和提示公式中都是穩健的，並且與使用針對標籤資料訓練的傳統分類模型提取的集體情緒一致。據我們所知，這是第一個透過時序適配器將 LLM 中的情感分析延伸到縱向設定的研究。我們的研究成果促成了社群媒體資料縱向分析的新方法。", "author": "Georg Ahnert et.al.", "authors": "Georg Ahnert, Max Pellert, David Garcia, Markus Strohmaier", "id": "2409.17990v1", "paper_url": "http://arxiv.org/abs/2409.17990v1", "repo": "https://github.com/dess-mannheim/temporal-adapters"}}