{"2504.12807": {"publish_time": "2025-04-17", "title": "Hybrid Dense-UNet201 Optimization for Pap Smear Image Segmentation Using Spider Monkey Optimization", "paper_summary": "Pap smear image segmentation is crucial for cervical cancer diagnosis.\nHowever, traditional segmentation models often struggle with complex cellular\nstructures and variations in pap smear images. This study proposes a hybrid\nDense-UNet201 optimization approach that integrates a pretrained DenseNet201 as\nthe encoder for the U-Net architecture and optimizes it using the spider monkey\noptimization (SMO) algorithm. The Dense-UNet201 model excelled at feature\nextraction. The SMO was modified to handle categorical and discrete parameters.\nThe SIPaKMeD dataset was used in this study and evaluated using key performance\nmetrics, including loss, accuracy, Intersection over Union (IoU), and Dice\ncoefficient. The experimental results showed that Dense-UNet201 outperformed\nU-Net, Res-UNet50, and Efficient-UNetB0. SMO Dense-UNet201 achieved a\nsegmentation accuracy of 96.16%, an IoU of 91.63%, and a Dice coefficient score\nof 95.63%. These findings underscore the effectiveness of image preprocessing,\npretrained models, and metaheuristic optimization in improving medical image\nanalysis and provide new insights into cervical cell segmentation methods.", "paper_summary_zh": "<paragraph>子宮頸抹片影像分割對於子宮頸癌的診斷至關重要。然而，傳統的分割模型常常難以處理子宮頸抹片影像中複雜的細胞結構和變化。本研究提出了一種混合 Dense-UNet201 優化方法，它整合了預訓練的 DenseNet201 作為 U-Net 架構的編碼器，並使用蜘蛛猴優化 (SMO) 演算法對其進行優化。Dense-UNet201 模型在特徵提取方面表現出色。SMO 經過修改以處理分類和離散參數。本研究使用了 SIPaKMeD 資料集，並使用關鍵效能指標進行評估，包括損失、準確度、交併比 (IoU) 和 Dice 係數。實驗結果表明，Dense-UNet201 的效能優於 U-Net、Res-UNet50 和 Efficient-UNetB0。SMO Dense-UNet201 的分割準確度達到 96.16%，IoU 為 91.63%，Dice 係數得分為 95.63%。這些發現強調了影像預處理、預訓練模型和元啟發式優化在改進醫學影像分析方面的有效性，並為子宮頸細胞分割方法提供了新的見解。</paragraph>\n", "author": "Ach Khozaimi et.al.", "authors": "Ach Khozaimi, Isnani Darti, Syaiful Anam, Wuryansari Muharini Kusumawinahyu", "id": "2504.12807v1", "paper_url": "http://arxiv.org/abs/2504.12807v1", "repo": "null"}}