{"2406.16495": {"publish_time": "2024-06-24", "title": "OTCE: Hybrid SSM and Attention with Cross Domain Mixture of Experts to construct Observer-Thinker-Conceiver-Expresser", "paper_summary": "Recent research has shown that combining Mamba with Transformer architecture,\nwhich has selective state space and quadratic self-attention mechanism,\noutperforms using Mamba or Transformer architecture alone in language modeling\ntasks. The quadratic self-attention mechanism effectively alleviates the\nshortcomings of selective state space in handling long-term dependencies of any\nelement in the sequence. We propose a position information injection method\nthat connects the selective state space model with the quadratic attention, and\nintegrates these two architectures with hybrid experts with cross-sharing\ndomains, so that we can enjoy the advantages of both. We design a new\narchitecture with a more biomimetic idea: Observer-Thinker-Conceiver-Expresser\n(OTCE), which can compete with well-known medium-scale open-source language\nmodels on a small scale in language modeling tasks.", "paper_summary_zh": "最近的研究表明，将 Mamba 与 Transformer 架构相结合，\n它具有选择性状态空间和二次自注意力机制，\n在语言建模任务中优于单独使用 Mamba 或 Transformer 架构。\n二次自注意力机制有效地缓解了选择性状态空间在处理序列中任何元素的长期依赖关系方面的缺点。我们提出了一种位置信息注入方法，将选择性状态空间模型与二次注意力相连接，并将这两个架构与具有交叉共享域的混合专家相集成，这样我们就可以同时享受两者的优势。我们设计了一种具有更仿生思想的新架构：观察者-思考者-构思者-表达者 (OTCE)，它可以在语言建模任务中与众所周知的中等规模开源语言模型在小规模上竞争。", "author": "Jingze Shi et.al.", "authors": "Jingze Shi, Ting Xie, Bingheng Wu, Chunjun Zheng, Kai Wang", "id": "2406.16495v2", "paper_url": "http://arxiv.org/abs/2406.16495v2", "repo": "https://github.com/LoserCheems/OTCE"}}