{"2406.16495": {"publish_time": "2024-06-24", "title": "OTCE: Hybrid SSM and Attention with Cross Domain Mixture of Experts to construct Observer-Thinker-Conceiver-Expresser", "paper_summary": "Recent research has shown that combining Mamba with Transformer architecture,\nwhich has selective state space and quadratic self-attention mechanism,\noutperforms using Mamba or Transformer architecture alone in language modeling\ntasks. The quadratic self-attention mechanism effectively alleviates the\nshortcomings of selective state space in handling long-term dependencies of any\nelement in the sequence. We propose a position information injection method\nthat connects the selective state space model with the quadratic attention, and\nintegrates these two architectures with hybrid experts with cross-sharing\ndomains, so that we can enjoy the advantages of both. We design a new\narchitecture with a more biomimetic idea: Observer-Thinker-Conceiver-Expresser\n(OTCE), which can compete with well-known medium-scale open-source language\nmodels on a small scale in language modeling tasks.", "paper_summary_zh": "最近的研究表明，将 Mamba 与 Transformer 架構結合，\n它具有選擇性的狀態空間和二次自注意力機制，\n在語言建模任務中優於單獨使用 Mamba 或 Transformer 架構。\n二次自注意力機制有效地緩解了選擇性狀態空間在處理序列中任何元素的長期依賴性方面的缺點。我們提出了一種位置資訊注入方法，將選擇性狀態空間模型與二次注意力連接起來，並使用具有跨共享域的混合專家將這兩個架構整合在一起，這樣我們就可以享受兩者的優點。我們設計了一個具有更多仿生學思想的新架構：觀察者-思考者-構思者-表達者 (OTCE)，它可以在小規模上與著名的中型開源語言模型在語言建模任務中競爭。", "author": "Jingze Shi et.al.", "authors": "Jingze Shi, Ting Xie, Bingheng Wu, Chunjun Zheng, Kai Wang", "id": "2406.16495v1", "paper_url": "http://arxiv.org/abs/2406.16495v1", "repo": "https://github.com/LoserCheems/OTCE"}}