{"2502.17189": {"publish_time": "2025-02-24", "title": "IGDA: Interactive Graph Discovery through Large Language Model Agents", "paper_summary": "Large language models ($\\textbf{LLMs}$) have emerged as a powerful method for\ndiscovery. Instead of utilizing numerical data, LLMs utilize associated\nvariable $\\textit{semantic metadata}$ to predict variable relationships.\nSimultaneously, LLMs demonstrate impressive abilities to act as black-box\noptimizers when given an objective $f$ and sequence of trials. We study LLMs at\nthe intersection of these two capabilities by applying LLMs to the task of\n$\\textit{interactive graph discovery}$: given a ground truth graph $G^*$\ncapturing variable relationships and a budget of $I$ edge experiments over $R$\nrounds, minimize the distance between the predicted graph $\\hat{G}_R$ and $G^*$\nat the end of the $R$-th round. To solve this task we propose $\\textbf{IGDA}$,\na LLM-based pipeline incorporating two key components: 1) an LLM\nuncertainty-driven method for edge experiment selection 2) a local graph update\nstrategy utilizing binary feedback from experiments to improve predictions for\nunselected neighboring edges. Experiments on eight different real-world graphs\nshow our approach often outperforms all baselines including a state-of-the-art\nnumerical method for interactive graph discovery. Further, we conduct a\nrigorous series of ablations dissecting the impact of each pipeline component.\nFinally, to assess the impact of memorization, we apply our interactive graph\ndiscovery strategy to a complex, new (as of July 2024) causal graph on protein\ntranscription factors, finding strong performance in a setting where\nmemorization is impossible. Overall, our results show IGDA to be a powerful\nmethod for graph discovery complementary to existing numerically driven\napproaches.", "paper_summary_zh": "大型語言模型（$\\textbf{LLM}$）已成為一種強大的發現方法。LLM 不使用數字數據，而是使用相關變數$\\textit{語義元數據}$來預測變數關係。同時，LLM 在給定目標 $f$ 和試驗序列時，表現出令人印象深刻的黑盒最佳化能力。我們在這些功能的交集中研究 LLM，方法是將 LLM 應用於$\\textit{互動圖形發現}$任務：給定一個捕捉變數關係的基本事實圖形 $G^*$ 和在 $R$ 輪中進行 $I$ 個邊緣實驗的預算，最小化預測圖形 $\\hat{G}_R$ 和 $G^*$ 在第 $R$ 輪結束時的距離。為了解決這個任務，我們提出$\\textbf{IGDA}$，一個基於 LLM 的管道，包含兩個關鍵組成部分：1) 一種 LLM 不確定性驅動的邊緣實驗選擇方法 2) 一種利用實驗的二元回饋來改善未選擇鄰近邊緣預測的局部圖形更新策略。在八個不同的現實世界圖形上的實驗表明，我們的做法通常優於所有基線，包括一種用於互動圖形發現的最新數值方法。此外，我們進行了一系列嚴格的消融，剖析了每個管道組成的影響。最後，為了評估記憶化的影響，我們將我們的互動圖形發現策略應用於一個複雜的、新的（截至 2024 年 7 月）蛋白質轉錄因子的因果圖形，在記憶化不可能的環境中發現強大的效能。總的來說，我們的結果表明 IGDA 是一種強大的圖形發現方法，可以補充現有的數值驅動方法。", "author": "Alex Havrilla et.al.", "authors": "Alex Havrilla, David Alvarez-Melis, Nicolo Fusi", "id": "2502.17189v1", "paper_url": "http://arxiv.org/abs/2502.17189v1", "repo": "null"}}