{"2501.07761": {"publish_time": "2025-01-14", "title": "Impatient Bandits: Optimizing for the Long-Term Without Delay", "paper_summary": "Increasingly, recommender systems are tasked with improving users' long-term\nsatisfaction. In this context, we study a content exploration task, which we\nformalize as a bandit problem with delayed rewards. There is an apparent\ntrade-off in choosing the learning signal: waiting for the full reward to\nbecome available might take several weeks, slowing the rate of learning,\nwhereas using short-term proxy rewards reflects the actual long-term goal only\nimperfectly. First, we develop a predictive model of delayed rewards that\nincorporates all information obtained to date. Rewards as well as shorter-term\nsurrogate outcomes are combined through a Bayesian filter to obtain a\nprobabilistic belief. Second, we devise a bandit algorithm that quickly learns\nto identify content aligned with long-term success using this new predictive\nmodel. We prove a regret bound for our algorithm that depends on the\n\\textit{Value of Progressive Feedback}, an information theoretic metric that\ncaptures the quality of short-term leading indicators that are observed prior\nto the long-term reward. We apply our approach to a podcast recommendation\nproblem, where we seek to recommend shows that users engage with repeatedly\nover two months. We empirically validate that our approach significantly\noutperforms methods that optimize for short-term proxies or rely solely on\ndelayed rewards, as demonstrated by an A/B test in a recommendation system that\nserves hundreds of millions of users.", "paper_summary_zh": "推薦系統日益肩負起提升使用者長期滿意度的任務。在此脈絡下，我們研究內容探索任務，我們將其形式化為具有延遲獎勵的多重選擇問題。在選擇學習訊號時，存在明顯的權衡：等待完整的獎勵可能需要數週時間，會減緩學習速度，而使用短期代理獎勵僅不完美地反映實際長期目標。首先，我們開發一個延遲獎勵預測模型，其中包含迄今為止獲得的所有資訊。獎勵以及較短期的替代結果透過貝氏濾波器結合，以獲得機率信念。其次，我們設計一種多重選擇演算法，使用這個新的預測模型，快速學會識別與長期成功相符的內容。我們證明了演算法的後悔邊界取決於「漸進式回饋價值」，這是一個資訊理論指標，它擷取在長期獎勵之前觀察到的短期領先指標的品質。我們將我們的做法應用於播客推薦問題，我們尋求推薦使用者在兩個月內重複參與的節目。我們透過在推薦系統中進行 A/B 測試，證明我們的做法顯著優於針對短期代理進行最佳化或僅依賴延遲獎勵的方法，而該推薦系統服務數億名使用者。", "author": "Kelly W. Zhang et.al.", "authors": "Kelly W. Zhang, Thomas Baldwin-McDonald, Kamil Ciosek, Lucas Maystre, Daniel Russo", "id": "2501.07761v1", "paper_url": "http://arxiv.org/abs/2501.07761v1", "repo": "null"}}