{"2412.13098": {"publish_time": "2024-12-17", "title": "Uchaguzi-2022: A Dataset of Citizen Reports on the 2022 Kenyan Election", "paper_summary": "Online reporting platforms have enabled citizens around the world to\ncollectively share their opinions and report in real time on events impacting\ntheir local communities. Systematically organizing (e.g., categorizing by\nattributes) and geotagging large amounts of crowdsourced information is crucial\nto ensuring that accurate and meaningful insights can be drawn from this data\nand used by policy makers to bring about positive change. These tasks, however,\ntypically require extensive manual annotation efforts. In this paper we present\nUchaguzi-2022, a dataset of 14k categorized and geotagged citizen reports\nrelated to the 2022 Kenyan General Election containing mentions of\nelection-related issues such as official misconduct, vote count irregularities,\nand acts of violence. We use this dataset to investigate whether language\nmodels can assist in scalably categorizing and geotagging reports, thus\nhighlighting its potential application in the AI for Social Good space.", "paper_summary_zh": "線上回報平台讓全球公民得以共同分享意見，並即時回報影響當地社群的事件。系統化地整理（例如依屬性分類）並對大量群眾外包資訊進行地理標記，對於確保能從這些資料中汲取準確且有意義的見解，並供決策者用於帶來正面改變至關重要。然而，這些任務通常需要廣泛的手動標註工作。在本文中，我們將介紹 Uchaguzi-2022，這是一個包含 14k 個分類且帶有地理標記的公民報告資料集，與 2022 年肯亞大選有關，其中包含提及官方不當行為、計票不規則和暴力行為等與選舉相關的問題。我們使用此資料集來調查語言模型是否可以協助擴充分類和地理標記報告，從而突顯其在 AI for Social Good 領域的潛在應用。", "author": "Roberto Mondini et.al.", "authors": "Roberto Mondini, Neema Kotonya, Robert L. Logan IV, Elizabeth M Olson, Angela Oduor Lungati, Daniel Duke Odongo, Tim Ombasa, Hemank Lamba, Aoife Cahill, Joel R. Tetreault, Alejandro Jaimes", "id": "2412.13098v1", "paper_url": "http://arxiv.org/abs/2412.13098v1", "repo": "null"}}