{"2411.01775": {"publish_time": "2024-11-04", "title": "Eurekaverse: Environment Curriculum Generation via Large Language Models", "paper_summary": "Recent work has demonstrated that a promising strategy for teaching robots a\nwide range of complex skills is by training them on a curriculum of\nprogressively more challenging environments. However, developing an effective\ncurriculum of environment distributions currently requires significant\nexpertise, which must be repeated for every new domain. Our key insight is that\nenvironments are often naturally represented as code. Thus, we probe whether\neffective environment curriculum design can be achieved and automated via code\ngeneration by large language models (LLM). In this paper, we introduce\nEurekaverse, an unsupervised environment design algorithm that uses LLMs to\nsample progressively more challenging, diverse, and learnable environments for\nskill training. We validate Eurekaverse's effectiveness in the domain of\nquadrupedal parkour learning, in which a quadruped robot must traverse through\na variety of obstacle courses. The automatic curriculum designed by Eurekaverse\nenables gradual learning of complex parkour skills in simulation and can\nsuccessfully transfer to the real-world, outperforming manual training courses\ndesigned by humans.", "paper_summary_zh": "最近的研究表明，教導機器人各種複雜技能的一個有前途的策略是，對它們進行漸進式更具挑戰性的環境課程訓練。然而，開發有效的環境分佈課程目前需要大量的專業知識，而且必須針對每個新領域重複進行。我們的關鍵見解是，環境通常以程式碼自然呈現。因此，我們探討是否能透過大型語言模型 (LLM) 的程式碼生成來實現並自動化有效的環境課程設計。在本文中，我們介紹了 Eurekaverse，一種無監督的環境設計演算法，它使用 LLM 來取樣漸進式更具挑戰性、多樣化且可學習的環境，以進行技能訓練。我們在四足跑酷學習領域驗證了 Eurekaverse 的有效性，其中四足機器人必須穿越各種障礙賽道。Eurekaverse 設計的自動課程能夠在模擬中逐步學習複雜的跑酷技能，並且可以成功轉移到現實世界，優於人類設計的手動訓練課程。", "author": "William Liang et.al.", "authors": "William Liang, Sam Wang, Hung-Ju Wang, Osbert Bastani, Dinesh Jayaraman, Yecheng Jason Ma", "id": "2411.01775v1", "paper_url": "http://arxiv.org/abs/2411.01775v1", "repo": "null"}}