{"2406.11546": {"publish_time": "2024-06-17", "title": "GigaSpeech 2: An Evolving, Large-Scale and Multi-domain ASR Corpus for Low-Resource Languages with Automated Crawling, Transcription and Refinement", "paper_summary": "The evolution of speech technology has been spurred by the rapid increase in\ndataset sizes. Traditional speech models generally depend on a large amount of\nlabeled training data, which is scarce for low-resource languages. This paper\npresents GigaSpeech 2, a large-scale, multi-domain, multilingual speech\nrecognition corpus. It is designed for low-resource languages and does not rely\non paired speech and text data. GigaSpeech 2 comprises about 30,000 hours of\nautomatically transcribed speech, including Thai, Indonesian, and Vietnamese,\ngathered from unlabeled YouTube videos. We also introduce an automated pipeline\nfor data crawling, transcription, and label refinement. Specifically, this\npipeline uses Whisper for initial transcription and TorchAudio for forced\nalignment, combined with multi-dimensional filtering for data quality\nassurance. A modified Noisy Student Training is developed to further refine\nflawed pseudo labels iteratively, thus enhancing model performance.\nExperimental results on our manually transcribed evaluation set and two public\ntest sets from Common Voice and FLEURS confirm our corpus's high quality and\nbroad applicability. Notably, ASR models trained on GigaSpeech 2 can reduce the\nword error rate for Thai, Indonesian, and Vietnamese on our challenging and\nrealistic YouTube test set by 25% to 40% compared to the Whisper large-v3\nmodel, with merely 10% model parameters. Furthermore, our ASR models trained on\nGigaspeech 2 yield superior performance compared to commercial services. We\nbelieve that our newly introduced corpus and pipeline will open a new avenue\nfor low-resource speech recognition and significantly facilitate research in\nthis area.", "paper_summary_zh": "<paragraph>語音技術的演進受到資料集規模快速增加的刺激。傳統的語音模型通常依賴於大量的標記訓練資料，而這對低資源語言來說很稀少。本文提出了 GigaSpeech 2，一個大型、多領域、多語言的語音辨識語料庫。它是為低資源語言設計的，且不依賴成對的語音和文字資料。GigaSpeech 2 包含約 30,000 小時的自動轉錄語音，包括泰語、印尼語和越南語，這些語音是從未標記的 YouTube 影片中收集來的。我們還導入了一個用於資料爬取、轉錄和標籤精煉的自動化管道。具體來說，這個管道使用 Whisper 進行初始轉錄，並使用 TorchAudio 進行強制比對，結合多維度過濾來確保資料品質。開發了一個改良的 Noisy Student Training，用於進一步反覆精煉有缺陷的偽標籤，從而增強模型效能。我們手動轉錄的評估集和來自 Common Voice 和 FLEURS 的兩個公開測試集的實驗結果證實了我們語料庫的高品質和廣泛的適用性。值得注意的是，在 GigaSpeech 2 上訓練的 ASR 模型可以將我們具有挑戰性和實際性的 YouTube 測試集上泰語、印尼語和越南語的字元錯誤率降低 25% 到 40%，而 Whisper large-v3 模型僅有 10% 的模型參數。此外，我們在 Gigaspeech 2 上訓練的 ASR 模型與商業服務相比，表現出更優異的效能。我們相信我們新推出的語料庫和管道將為低資源語音辨識開啟一條新途徑，並顯著促進這方面的研究。</paragraph>", "author": "Yifan Yang et.al.", "authors": "Yifan Yang, Zheshu Song, Jianheng Zhuo, Mingyu Cui, Jinpeng Li, Bo Yang, Yexing Du, Ziyang Ma, Xunying Liu, Ziyuan Wang, Ke Li, Shuai Fan, Kai Yu, Wei-Qiang Zhang, Guoguo Chen, Xie Chen", "id": "2406.11546v1", "paper_url": "http://arxiv.org/abs/2406.11546v1", "repo": "null"}}