{"2411.17326": {"publish_time": "2024-11-26", "title": "Towards Intention Recognition for Robotic Assistants Through Online POMDP Planning", "paper_summary": "Intention recognition, or the ability to anticipate the actions of another\nagent, plays a vital role in the design and development of automated assistants\nthat can support humans in their daily tasks. In particular, industrial\nsettings pose interesting challenges that include potential distractions for a\ndecision-maker as well as noisy or incomplete observations. In such a setting,\na robotic assistant tasked with helping and supporting a human worker must\ninterleave information gathering actions with proactive tasks of its own, an\napproach that has been referred to as active goal recognition. In this paper we\ndescribe a partially observable model for online intention recognition, show\nsome preliminary experimental results and discuss some of the challenges\npresent in this family of problems.", "paper_summary_zh": "意圖識別，或預測另一個動作的能力\n代理在設計和開發自動化助理中扮演著至關重要的角色\n這可以協助人類執行日常任務。特別是，工業\n設定會帶來有趣的挑戰，包括決策者潛在的注意力分散，以及嘈雜或不完整的觀察。在這樣的設定中，\n一個機器人助理負責幫助和支援人類工作者必須\n交錯資訊收集動作與其自己的主動任務，一種\n被稱為主動目標識別的方法。在本文中，我們\n描述了一個線上意圖識別的部分可觀察模型，顯示\n一些初步的實驗結果，並討論了這個問題家族中存在的一些挑戰。", "author": "Juan Carlos Saborio et.al.", "authors": "Juan Carlos Saborio, Joachim Hertzberg", "id": "2411.17326v1", "paper_url": "http://arxiv.org/abs/2411.17326v1", "repo": "null"}}