{"2501.06713": {"publish_time": "2025-01-12", "title": "MiniRAG: Towards Extremely Simple Retrieval-Augmented Generation", "paper_summary": "The growing demand for efficient and lightweight Retrieval-Augmented\nGeneration (RAG) systems has highlighted significant challenges when deploying\nSmall Language Models (SLMs) in existing RAG frameworks. Current approaches\nface severe performance degradation due to SLMs' limited semantic understanding\nand text processing capabilities, creating barriers for widespread adoption in\nresource-constrained scenarios. To address these fundamental limitations, we\npresent MiniRAG, a novel RAG system designed for extreme simplicity and\nefficiency. MiniRAG introduces two key technical innovations: (1) a\nsemantic-aware heterogeneous graph indexing mechanism that combines text chunks\nand named entities in a unified structure, reducing reliance on complex\nsemantic understanding, and (2) a lightweight topology-enhanced retrieval\napproach that leverages graph structures for efficient knowledge discovery\nwithout requiring advanced language capabilities. Our extensive experiments\ndemonstrate that MiniRAG achieves comparable performance to LLM-based methods\neven when using SLMs while requiring only 25\\% of the storage space.\nAdditionally, we contribute a comprehensive benchmark dataset for evaluating\nlightweight RAG systems under realistic on-device scenarios with complex\nqueries. We fully open-source our implementation and datasets at:\nhttps://github.com/HKUDS/MiniRAG.", "paper_summary_zh": "對於高效且輕量的檢索增強生成 (RAG) 系統日益增長的需求，在現有 RAG 架構中部署小型語言模型 (SLM) 時突顯了重大的挑戰。由於 SLM 受限的語義理解和文本處理能力，當前方法面臨嚴重的效能下降，這為在資源受限的場景中廣泛採用造成了障礙。為了解決這些根本限制，我們提出了 MiniRAG，這是一個專為極致簡潔與效率而設計的新穎 RAG 系統。MiniRAG 引入了兩項關鍵技術創新：(1) 結合文本塊和命名實體於統一結構中的語義感知異質圖形索引機制，減少對複雜語義理解的依賴，以及 (2) 輕量級拓撲增強檢索方法，它利用圖形結構進行有效率的知識發現，而不需要進階的語言能力。我們廣泛的實驗證明，即使在使用 SLM 時，MiniRAG 也能達到與基於 LLM 的方法相當的效能，同時僅需要 25% 的儲存空間。此外，我們貢獻了一個全面的基準資料集，用於在具有複雜查詢的實際裝置場景下評估輕量級 RAG 系統。我們在以下位置完全開放原始碼實作和資料集：https://github.com/HKUDS/MiniRAG。", "author": "Tianyu Fan et.al.", "authors": "Tianyu Fan, Jingyuan Wang, Xubin Ren, Chao Huang", "id": "2501.06713v1", "paper_url": "http://arxiv.org/abs/2501.06713v1", "repo": "https://github.com/hkuds/minirag"}}