{"2411.02391": {"publish_time": "2024-11-04", "title": "Attacking Vision-Language Computer Agents via Pop-ups", "paper_summary": "Autonomous agents powered by large vision and language models (VLM) have\ndemonstrated significant potential in completing daily computer tasks, such as\nbrowsing the web to book travel and operating desktop software, which requires\nagents to understand these interfaces. Despite such visual inputs becoming more\nintegrated into agentic applications, what types of risks and attacks exist\naround them still remain unclear. In this work, we demonstrate that VLM agents\ncan be easily attacked by a set of carefully designed adversarial pop-ups,\nwhich human users would typically recognize and ignore. This distraction leads\nagents to click these pop-ups instead of performing the tasks as usual.\nIntegrating these pop-ups into existing agent testing environments like OSWorld\nand VisualWebArena leads to an attack success rate (the frequency of the agent\nclicking the pop-ups) of 86% on average and decreases the task success rate by\n47%. Basic defense techniques such as asking the agent to ignore pop-ups or\nincluding an advertisement notice, are ineffective against the attack.", "paper_summary_zh": "由大型視覺和語言模型 (VLM) 驅動的自主代理已證明在完成日常電腦任務方面具有顯著的潛力，例如瀏覽網路以預訂旅遊和操作桌面軟體，這需要代理了解這些介面。儘管此類視覺輸入已更廣泛地整合到代理應用程式中，但它們周圍存在哪些類型的風險和攻擊仍不清楚。在這項工作中，我們展示了 VLM 代理可以輕鬆地受到一組精心設計的對抗性彈出視窗攻擊，而人類使用者通常會識別並忽略這些視窗。這種分心導致代理點擊這些彈出視窗，而不是像往常一樣執行任務。將這些彈出視窗整合到現有的代理測試環境中，例如 OSWorld 和 VisualWebArena，會導致攻擊成功率（代理點擊彈出視窗的頻率）平均為 86%，並將任務成功率降低 47%。基本防禦技術，例如要求代理忽略彈出視窗或包含廣告通知，對攻擊無效。", "author": "Yanzhe Zhang et.al.", "authors": "Yanzhe Zhang, Tao Yu, Diyi Yang", "id": "2411.02391v1", "paper_url": "http://arxiv.org/abs/2411.02391v1", "repo": "null"}}