{"2406.05038": {"publish_time": "2024-06-07", "title": "Efficient 3D Shape Generation via Diffusion Mamba with Bidirectional SSMs", "paper_summary": "Recent advancements in sequence modeling have led to the development of the\nMamba architecture, noted for its selective state space approach, offering a\npromising avenue for efficient long sequence handling. However, its application\nin 3D shape generation, particularly at high resolutions, remains\nunderexplored. Traditional diffusion transformers (DiT) with self-attention\nmechanisms, despite their potential, face scalability challenges due to the\ncubic complexity of attention operations as input length increases. This\ncomplexity becomes a significant hurdle when dealing with high-resolution voxel\nsizes. To address this challenge, we introduce a novel diffusion architecture\ntailored for 3D point clouds generation-Diffusion Mamba (DiM-3D). This\narchitecture forgoes traditional attention mechanisms, instead utilizing the\ninherent efficiency of the Mamba architecture to maintain linear complexity\nwith respect to sequence length. DiM-3D is characterized by fast inference\ntimes and substantially lower computational demands, quantified in reduced\nGflops, thereby addressing the key scalability issues of prior models. Our\nempirical results on the ShapeNet benchmark demonstrate that DiM-3D achieves\nstate-of-the-art performance in generating high-fidelity and diverse 3D shapes.\nAdditionally, DiM-3D shows superior capabilities in tasks like 3D point cloud\ncompletion. This not only proves the model's scalability but also underscores\nits efficiency in generating detailed, high-resolution voxels necessary for\nadvanced 3D shape modeling, particularly excelling in environments requiring\nhigh-resolution voxel sizes. Through these findings, we illustrate the\nexceptional scalability and efficiency of the Diffusion Mamba framework in 3D\nshape generation, setting a new standard for the field and paving the way for\nfuture explorations in high-resolution 3D modeling technologies.", "paper_summary_zh": "<paragraph>序列建模的最新进展促成了 Mamba 架构的发展，它以其选择性状态空间方法著称，为高效处理长序列提供了有前景的途径。然而，它在 3D 形状生成中的应用，尤其是在高分辨率下，仍然未得到充分探索。传统的具有自注意力机制的扩散变压器 (DiT)，尽管有其潜力，但由于输入长度增加时注意操作的三次复杂度，而面临可扩展性挑战。在处理高分辨率体素大小时，这种复杂度成为一个重大障碍。为了应对这一挑战，我们引入了一种针对 3D 点云生成量身定制的新型扩散架构——扩散 Mamba (DiM-3D)。此架构放弃了传统的注意力机制，而是利用 Mamba 架构的固有效率来保持相对于序列长度的线性复杂度。DiM-3D 的特点是推理时间快，计算需求大大降低，以减少的 Gflops 量化为特征，从而解决了先前模型的关键可扩展性问题。我们在 ShapeNet 基准上的经验结果表明，DiM-3D 在生成高保真度和多样化的 3D 形状方面实现了最先进的性能。此外，DiM-3D 在 3D 点云完成等任务中表现出卓越的能力。这不仅证明了该模型的可扩展性，还强调了它在生成用于高级 3D 形状建模所需的详细、高分辨率体素方面的效率，尤其擅长需要高分辨率体素大小的环境。通过这些发现，我们展示了扩散 Mamba 框架在 3D 形状生成中的出色可扩展性和效率，为该领域设定了新标准，并为未来在高分辨率 3D 建模技术中的探索铺平了道路。</paragraph>", "author": "Shentong Mo et.al.", "authors": "Shentong Mo", "id": "2406.05038v1", "paper_url": "http://arxiv.org/abs/2406.05038v1", "repo": "null"}}