{"2501.03392": {"publish_time": "2025-01-06", "title": "Over-the-Air Fair Federated Learning via Multi-Objective Optimization", "paper_summary": "In federated learning (FL), heterogeneity among the local dataset\ndistributions of clients can result in unsatisfactory performance for some,\nleading to an unfair model. To address this challenge, we propose an\nover-the-air fair federated learning algorithm (OTA-FFL), which leverages\nover-the-air computation to train fair FL models. By formulating FL as a\nmulti-objective minimization problem, we introduce a modified Chebyshev\napproach to compute adaptive weighting coefficients for gradient aggregation in\neach communication round. To enable efficient aggregation over the multiple\naccess channel, we derive analytical solutions for the optimal transmit scalars\nat the clients and the de-noising scalar at the parameter server. Extensive\nexperiments demonstrate the superiority of OTA-FFL in achieving fairness and\nrobust performance compared to existing methods.", "paper_summary_zh": "在联邦学习 (FL) 中，客户端本地数据集分布的异质性可能导致某些客户端的性能不佳，从而产生不公平的模型。为了应对这一挑战，我们提出了一种空中公平联邦学习算法 (OTA-FFL)，它利用空中计算来训练公平的 FL 模型。通过将 FL 表述为一个多目标最小化问题，我们引入了一种改进的切比雪夫方法来计算梯度聚合的适应性加权系数，用于每一轮通信。为了在多址信道上实现高效聚合，我们推导出了客户端的最佳传输标量和参数服务器的去噪标量的解析解。大量的实验表明，与现有方法相比，OTA-FFL 在实现公平性和稳健性能方面具有优越性。", "author": "Shayan Mohajer Hamidi et.al.", "authors": "Shayan Mohajer Hamidi, Ali Bereyhi, Saba Asaad, H. Vincent Poor", "id": "2501.03392v1", "paper_url": "http://arxiv.org/abs/2501.03392v1", "repo": "https://github.com/shayanmohajer/ota-ffl"}}