{"2411.13560": {"publish_time": "2024-11-07", "title": "AMSnet-KG: A Netlist Dataset for LLM-based AMS Circuit Auto-Design Using Knowledge Graph RAG", "paper_summary": "High-performance analog and mixed-signal (AMS) circuits are mainly\nfull-custom designed, which is time-consuming and labor-intensive. A\nsignificant portion of the effort is experience-driven, which makes the\nautomation of AMS circuit design a formidable challenge. Large language models\n(LLMs) have emerged as powerful tools for Electronic Design Automation (EDA)\napplications, fostering advancements in the automatic design process for\nlarge-scale AMS circuits. However, the absence of high-quality datasets has led\nto issues such as model hallucination, which undermines the robustness of\nautomatically generated circuit designs. To address this issue, this paper\nintroduces AMSnet-KG, a dataset encompassing various AMS circuit schematics and\nnetlists. We construct a knowledge graph with annotations on detailed\nfunctional and performance characteristics. Facilitated by AMSnet-KG, we\npropose an automated AMS circuit generation framework that utilizes the\ncomprehensive knowledge embedded in LLMs. We first formulate a design strategy\n(e.g., circuit architecture using a number of circuit components) based on\nrequired specifications. Next, matched circuit components are retrieved and\nassembled into a complete topology, and transistor sizing is obtained through\nBayesian optimization. Simulation results of the netlist are fed back to the\nLLM for further topology refinement, ensuring the circuit design specifications\nare met. We perform case studies of operational amplifier and comparator design\nto verify the automatic design flow from specifications to netlists with\nminimal human effort. The dataset used in this paper will be open-sourced upon\npublishing of this paper.", "paper_summary_zh": "高性能類比與混合訊號 (AMS) 電路主要為全客製化設計，這相當耗時且費工。其中很大一部分的工作仰賴經驗，這讓 AMS 電路設計的自動化成為一項艱鉅的挑戰。大型語言模型 (LLM) 已成為電子設計自動化 (EDA) 應用程式強大的工具，促進大規模 AMS 電路自動設計流程的進展。然而，缺乏高品質的資料集導致模型出現幻覺等問題，這損害了自動產生電路設計的穩健性。為了解決此問題，本文介紹了 AMSnet-KG，這是一個包含各種 AMS 電路原理圖和網路清單的資料集。我們建立了一個包含詳細功能和效能特徵註解的知識圖譜。在 AMSnet-KG 的協助下，我們提出了一個自動化 AMS 電路產生架構，它利用了內嵌在 LLM 中的全面知識。我們首先根據所需規格制定設計策略（例如使用多個電路元件的電路架構）。接著，擷取匹配的電路元件並組裝成一個完整的拓撲，並透過貝氏最佳化取得電晶體尺寸。網路清單的模擬結果會回饋給 LLM 以進一步優化拓撲，確保電路設計規格得到滿足。我們執行運算放大器和比較器設計的個案研究，以驗證從規格到網路清單的自動設計流程，並將人為介入降到最低。本文中使用的資料集將在本文發布後開源。", "author": "Yichen Shi et.al.", "authors": "Yichen Shi, Zhuofu Tao, Yuhao Gao, Tianjia Zhou, Cheng Chang, Yaxing Wang, Bingyu Chen, Genhao Zhang, Alvin Liu, Zhiping Yu, Ting-Jung Lin, Lei He", "id": "2411.13560v1", "paper_url": "http://arxiv.org/abs/2411.13560v1", "repo": "null"}}