{"2502.13347": {"publish_time": "2025-02-19", "title": "Craw4LLM: Efficient Web Crawling for LLM Pretraining", "paper_summary": "Web crawl is a main source of large language models' (LLMs) pretraining data,\nbut the majority of crawled web pages are discarded in pretraining due to low\ndata quality. This paper presents Crawl4LLM, an efficient web crawling method\nthat explores the web graph based on the preference of LLM pretraining.\nSpecifically, it leverages the influence of a webpage in LLM pretraining as the\npriority score of the web crawler's scheduler, replacing the standard graph\nconnectivity based priority. Our experiments on a web graph containing 900\nmillion webpages from a commercial search engine's index demonstrate the\nefficiency of Crawl4LLM in obtaining high-quality pretraining data. With just\n21% URLs crawled, LLMs pretrained on Crawl4LLM data reach the same downstream\nperformances of previous crawls, significantly reducing the crawling waste and\nalleviating the burdens on websites. Our code is publicly available at\nhttps://github.com/cxcscmu/Crawl4LLM.", "paper_summary_zh": "網路爬蟲是大型語言模型 (LLM) 預訓練資料的主要來源，\n但大多數已爬取的網頁在預訓練中會因為資料品質低落而被捨棄。\n本文提出 Crawl4LLM，這是一種有效率的網路爬取方法，\n它會根據 LLM 預訓練的偏好來探索網路圖。\n具體來說，它利用網頁在 LLM 預訓練中的影響力作為網路爬蟲排程器的優先分數，\n取代標準的圖形連線優先順序。\n我們在一個包含來自商業搜尋引擎索引的 9 億個網頁的網路圖上進行的實驗，\n證明了 Crawl4LLM 在取得高品質預訓練資料方面的效率。\n只爬取了 21% 的網址，以 Crawl4LLM 資料預訓練的 LLM 就達到了先前爬取的相同下游效能，\n大幅減少了爬取浪費，並減輕了對網站的負擔。\n我們的程式碼已公開於 https://github.com/cxcscmu/Crawl4LLM。", "author": "Shi Yu et.al.", "authors": "Shi Yu, Zhiyuan Liu, Chenyan Xiong", "id": "2502.13347v1", "paper_url": "http://arxiv.org/abs/2502.13347v1", "repo": "null"}}