{"2411.09986": {"publish_time": "2024-11-15", "title": "Unlocking Transfer Learning for Open-World Few-Shot Recognition", "paper_summary": "Few-Shot Open-Set Recognition (FSOSR) targets a critical real-world\nchallenge, aiming to categorize inputs into known categories, termed closed-set\nclasses, while identifying open-set inputs that fall outside these classes.\nAlthough transfer learning where a model is tuned to a given few-shot task has\nbecome a prominent paradigm in closed-world, we observe that it fails to expand\nto open-world. To unlock this challenge, we propose a two-stage method which\nconsists of open-set aware meta-learning with open-set free transfer learning.\nIn the open-set aware meta-learning stage, a model is trained to establish a\nmetric space that serves as a beneficial starting point for the subsequent\nstage. During the open-set free transfer learning stage, the model is further\nadapted to a specific target task through transfer learning. Additionally, we\nintroduce a strategy to simulate open-set examples by modifying the training\ndataset or generating pseudo open-set examples. The proposed method achieves\nstate-of-the-art performance on two widely recognized benchmarks, miniImageNet\nand tieredImageNet, with only a 1.5\\% increase in training effort. Our work\ndemonstrates the effectiveness of transfer learning in FSOSR.", "paper_summary_zh": "少样本开放集识别 (FSOSR) 针对关键的真实世界挑战，旨在将输入分类到已知类别（称为闭集类），同时识别属于这些类之外的开放集输入。尽管迁移学习（其中模型针对给定的少样本任务进行调整）已成为封闭世界中的一个突出范例，但我们观察到它无法扩展到开放世界。为了应对这一挑战，我们提出了一种两阶段方法，该方法包括具有开放集自由迁移学习的开放集感知元学习。在开放集感知元学习阶段，训练模型以建立度量空间，作为后续阶段的有益起点。在开放集自由迁移学习阶段，模型通过迁移学习进一步适应特定目标任务。此外，我们引入了一种策略，通过修改训练数据集或生成伪开放集示例来模拟开放集示例。所提出的方法在两个广泛认可的基准（miniImageNet 和 tieredImageNet）上实现了最先进的性能，训练工作量仅增加了 1.5%。我们的工作证明了迁移学习在 FSOSR 中的有效性。", "author": "Byeonggeun Kim et.al.", "authors": "Byeonggeun Kim, Juntae Lee, Kyuhong Shim, Simyung Chang", "id": "2411.09986v1", "paper_url": "http://arxiv.org/abs/2411.09986v1", "repo": "null"}}