{"2501.07048": {"publish_time": "2025-01-13", "title": "Unveiling the Potential of Text in High-Dimensional Time Series Forecasting", "paper_summary": "Time series forecasting has traditionally focused on univariate and\nmultivariate numerical data, often overlooking the benefits of incorporating\nmultimodal information, particularly textual data. In this paper, we propose a\nnovel framework that integrates time series models with Large Language Models\nto improve high-dimensional time series forecasting. Inspired by multimodal\nmodels, our method combines time series and textual data in the dual-tower\nstructure. This fusion of information creates a comprehensive representation,\nwhich is then processed through a linear layer to generate the final forecast.\nExtensive experiments demonstrate that incorporating text enhances\nhigh-dimensional time series forecasting performance. This work paves the way\nfor further research in multimodal time series forecasting.", "paper_summary_zh": "時間序列預測傳統上專注於單變量和多變量數值數據，常常忽略整合多模態資訊，特別是文字數據的好處。在本文中，我們提出了一個新的框架，將時間序列模型與大型語言模型整合，以改善高維時間序列預測。受到多模態模型的啟發，我們的模型在雙塔結構中結合了時間序列和文字數據。這種資訊融合創造了一個全面的表示，然後透過線性層處理以產生最終預測。廣泛的實驗表明，整合文字可以增強高維時間序列預測的效能。這項工作為多模態時間序列預測的進一步研究鋪路。", "author": "Xin Zhou et.al.", "authors": "Xin Zhou, Weiqing Wang, Shilin Qu, Zhiqiang Zhang, Christoph Bergmeir", "id": "2501.07048v1", "paper_url": "http://arxiv.org/abs/2501.07048v1", "repo": "https://github.com/xinzzzhou/textfusionhts"}}