{"2502.11895": {"publish_time": "2025-02-17", "title": "Continual Quantization-Aware Pre-Training: When to transition from 16-bit to 1.58-bit pre-training for BitNet language models?", "paper_summary": "Large language models (LLMs) require immense resources for training and\ninference. Quantization, a technique that reduces the precision of model\nparameters, offers a promising solution for improving LLM efficiency and\nsustainability. While post-training quantization methods typically achieve 4-8\nbits per parameter, recent research suggests that training LLMs with 1.58 bits\nper weight parameter from scratch can maintain model accuracy while greatly\nreducing memory requirements and energy consumption at inference time. Here, we\ninvestigate a training strategy for quantization-aware pre-training, where the\nmodels are first trained with 16-bit precision and then transition into\n1.58-bit quantization-aware training. Our results on 11 downstream tasks show\nthat this 16-to-1.58-bit training strategy is preferable over full 1.58-bit\ntraining and leaves models closer to those which have undergone 16-bit\ntraining. We further investigate the effects of retaining the optimizer state\nat the transition point and gradually phasing in quantization strength --\nfinding that both techniques alleviate the magnitude of loss spikes, but also\nthat these effects can be compensated through further training.", "paper_summary_zh": "大型語言模型 (LLM) 需要大量的資源來進行訓練和推理。量化是一種降低模型參數精度的技術，為提高 LLM 效率和可持續性提供了一個有希望的解決方案。雖然訓練後量化方法通常每參數達到 4-8 位元，但最近的研究表明，從頭開始使用每權重參數 1.58 位元訓練 LLM 可以維持模型準確性，同時大幅減少推理時間的記憶體需求和能源消耗。在此，我們探討量化感知預訓練的訓練策略，其中模型首先使用 16 位元精度訓練，然後轉換為 1.58 位元量化感知訓練。我們在 11 個下游任務上的結果表明，這種 16 位元到 1.58 位元的訓練策略優於完全 1.58 位元訓練，並且使模型更接近經過 16 位元訓練的模型。我們進一步探討了在轉換點保留最佳化器狀態和逐漸調整量化強度的影響——發現這兩種技術都可以減輕損失尖峰的大小，但這些影響也可以透過進一步訓練來補償。", "author": "Jacob Nielsen et.al.", "authors": "Jacob Nielsen, Peter Schneider-Kamp, Lukas Galke", "id": "2502.11895v1", "paper_url": "http://arxiv.org/abs/2502.11895v1", "repo": "null"}}