{"2407.13928": {"publish_time": "2024-07-18", "title": "BiasDPO: Mitigating Bias in Language Models through Direct Preference Optimization", "paper_summary": "Large Language Models (LLMs) have become pivotal in advancing natural\nlanguage processing, yet their potential to perpetuate biases poses significant\nconcerns. This paper introduces a new framework employing Direct Preference\nOptimization (DPO) to mitigate gender, racial, and religious biases in\nLLM-generated English text. By developing a loss function that favors less\nbiased over biased completions, our approach cultivates a preference for\nrespectful and non-discriminatory language in LLMs. We also contribute a\nmanually designed dataset for training LLMs to recognize and correct biases.\nThis dataset encompasses a diverse range of prompts paired with both biased and\nunbiased completions. Implementing this approach on the Microsoft Phi-2 model,\nwe demonstrate substantial reductions in biased outputs as our model\noutperforms the baseline model on almost all bias benchmarks. Our model also\nachieves better performance compared to other open-source models on most\nbenchmarks. By reducing biases in the language generated by the model, our\nstudy marks a significant step towards developing more ethical and socially\nresponsible LLMs. We publicly release BiasDPO dataset on HuggingFace.", "paper_summary_zh": "大型語言模型 (LLM) 已成為推進自然語言處理的關鍵，但其潛在的偏見延續性引發了重大的擔憂。本文介紹了一個採用直接偏好最佳化 (DPO) 的新框架，以減輕 LLM 生成的英文文本中的性別、種族和宗教偏見。通過開發一個偏好較少偏見而非偏見完成的損失函數，我們的做法培養了對 LLM 中尊重和非歧視性語言的偏好。我們還提供了一個手動設計的數據集，用於訓練 LLM 識別和糾正偏差。此數據集包含與有偏見和無偏見完成配對的各種提示。在 Microsoft Phi-2 模型上實施此方法，我們證明了偏見輸出的顯著減少，因為我們的模型在幾乎所有偏見基準上都優於基線模型。與大多數基準上的其他開源模型相比，我們的模型也取得了更好的性能。通過減少模型生成的語言中的偏見，我們的研究標誌著朝著開發更具道德和社會責任感的 LLM 邁出的重要一步。我們在 HuggingFace 上公開發布了 BiasDPO 數據集。", "author": "Ahmed Allam et.al.", "authors": "Ahmed Allam", "id": "2407.13928v1", "paper_url": "http://arxiv.org/abs/2407.13928v1", "repo": "null"}}