{"2407.18445": {"publish_time": "2024-07-26", "title": "Capturing the security expert knowledge in feature selection for web application attack detection", "paper_summary": "This article puts forward the use of mutual information values to replicate\nthe expertise of security professionals in selecting features for detecting web\nattacks. The goal is to enhance the effectiveness of web application firewalls\n(WAFs). Web applications are frequently vulnerable to various security threats,\nmaking WAFs essential for their protection. WAFs analyze HTTP traffic using\nrule-based approaches to identify known attack patterns and to detect and block\npotential malicious requests. However, a major challenge is the occurrence of\nfalse positives, which can lead to blocking legitimate traffic and impact the\nnormal functioning of the application. The problem is addressed as an approach\nthat combines supervised learning for feature selection with a semi-supervised\nlearning scenario for training a One-Class SVM model. The experimental findings\nshow that the model trained with features selected by the proposed algorithm\noutperformed the expert-based selection approach in terms of performance.\nAdditionally, the results obtained by the traditional rule-based WAF\nModSecurity, configured with a vanilla set of OWASP CRS rules, were also\nimproved.", "paper_summary_zh": "本文提出了使用互信息值来复制安全专业人员在选择用于检测网络攻击的功能时的专业知识。目标是提高 Web 应用程序防火墙 (WAF) 的有效性。Web 应用程序经常容易受到各种安全威胁的攻击，这使得 WAF 对于保护它们至关重要。WAF 使用基于规则的方法分析 HTTP 流量，以识别已知的攻击模式并检测和阻止潜在的恶意请求。然而，一个主要挑战是误报的发生，这可能导致阻止合法流量并影响应用程序的正常运行。该问题被解决为一种方法，该方法将用于特征选择的有监督学习与用于训练单类 SVM 模型的半监督学习场景相结合。实验结果表明，使用所提出的算法选择的特征训练的模型在性能方面优于基于专家的选择方法。此外，还改进了使用一组香草 OWASP CRS 规则配置的传统基于规则的 WAF ModSecurity 获得的结果。", "author": "Amanda Riverol et.al.", "authors": "Amanda Riverol, Gustavo Betarte, Rodrigo Martínez, Álvaro Pardo", "id": "2407.18445v1", "paper_url": "http://arxiv.org/abs/2407.18445v1", "repo": "null"}}