{"2412.13602": {"publish_time": "2024-12-18", "title": "Beyond Outcomes: Transparent Assessment of LLM Reasoning in Games", "paper_summary": "Large Language Models (LLMs) are increasingly deployed in real-world\napplications that demand complex reasoning. To track progress, robust\nbenchmarks are required to evaluate their capabilities beyond superficial\npattern recognition. However, current LLM reasoning benchmarks often face\nchallenges such as insufficient interpretability, performance saturation or\ndata contamination. To address these challenges, we introduce GAMEBoT, a gaming\narena designed for rigorous and transparent assessment of LLM reasoning\ncapabilities. GAMEBoT decomposes complex reasoning in games into predefined\nmodular subproblems. This decomposition allows us to design a suite of\nChain-of-Thought (CoT) prompts that leverage domain knowledge to guide LLMs in\naddressing these subproblems before action selection. Furthermore, we develop a\nsuite of rule-based algorithms to generate ground truth for these subproblems,\nenabling rigorous validation of the LLMs' intermediate reasoning steps. This\napproach facilitates evaluation of both the quality of final actions and the\naccuracy of the underlying reasoning process. GAMEBoT also naturally alleviates\nthe risk of data contamination through dynamic games and head-to-head LLM\ncompetitions. We benchmark 17 prominent LLMs across eight games, encompassing\nvarious strategic abilities and game characteristics. Our results suggest that\nGAMEBoT presents a significant challenge, even when LLMs are provided with\ndetailed CoT prompts. Project page: \\url{https://visual-ai.github.io/gamebot}", "paper_summary_zh": "大型語言模型 (LLM)  zunehmend in realen Anwendungen eingesetzt, die komplexe Überlegungen erfordern. Um den Fortschritt zu verfolgen, sind robuste Benchmarks erforderlich, um ihre Fähigkeiten über die oberflächliche Mustererkennung hinaus zu bewerten. Allerdings stehen aktuelle LLM-Begründungs-Benchmarks oft vor Herausforderungen wie unzureichender Interpretierbarkeit, Leistungssättigung oder Datenkontamination. Um diese Herausforderungen anzugehen, stellen wir GAMEBoT vor, eine Spielarena, die für eine strenge und transparente Bewertung der LLM-Begründungsfähigkeiten entwickelt wurde. GAMEBoT zerlegt komplexe Überlegungen in Spielen in vordefinierte modulare Teilprobleme. Diese Zerlegung ermöglicht es uns, eine Reihe von Chain-of-Thought (CoT)-Eingabeaufforderungen zu entwerfen, die Domänenwissen nutzen, um LLMs bei der Lösung dieser Teilprobleme vor der Aktionsauswahl zu unterstützen. Darüber hinaus entwickeln wir eine Reihe regelbasierter Algorithmen, um eine Grundwahrheit für diese Teilprobleme zu generieren, die eine strenge Validierung der Zwischenbegründungsschritte der LLMs ermöglicht. Dieser Ansatz erleichtert die Bewertung sowohl der Qualität der endgültigen Aktionen als auch der Genauigkeit des zugrunde liegenden Begründungsprozesses. GAMEBoT verringert außerdem auf natürliche Weise das Risiko einer Datenkontamination durch dynamische Spiele und Kopf-an-Kopf-LLM-Wettbewerbe. Wir vergleichen 17 herausragende LLMs in acht Spielen, die verschiedene strategische Fähigkeiten und Spieleigenschaften umfassen. Unsere Ergebnisse deuten darauf hin, dass GAMEBoT eine erhebliche Herausforderung darstellt, selbst wenn LLMs mit detaillierten CoT-Eingabeaufforderungen versehen werden. Projektseite: \\url{https://visual-ai.github.io/gamebot}", "author": "Wenye Lin et.al.", "authors": "Wenye Lin, Jonathan Roberts, Yunhan Yang, Samuel Albanie, Zongqing Lu, Kai Han", "id": "2412.13602v1", "paper_url": "http://arxiv.org/abs/2412.13602v1", "repo": "null"}}