{"2410.03197": {"publish_time": "2024-10-04", "title": "Cross-lingual Transfer for Automatic Question Generation by Learning Interrogative Structures in Target Languages", "paper_summary": "Automatic question generation (QG) serves a wide range of purposes, such as\naugmenting question-answering (QA) corpora, enhancing chatbot systems, and\ndeveloping educational materials. Despite its importance, most existing\ndatasets predominantly focus on English, resulting in a considerable gap in\ndata availability for other languages. Cross-lingual transfer for QG (XLT-QG)\naddresses this limitation by allowing models trained on high-resource language\ndatasets to generate questions in low-resource languages. In this paper, we\npropose a simple and efficient XLT-QG method that operates without the need for\nmonolingual, parallel, or labeled data in the target language, utilizing a\nsmall language model. Our model, trained solely on English QA datasets, learns\ninterrogative structures from a limited set of question exemplars, which are\nthen applied to generate questions in the target language. Experimental results\nshow that our method outperforms several XLT-QG baselines and achieves\nperformance comparable to GPT-3.5-turbo across different languages.\nAdditionally, the synthetic data generated by our model proves beneficial for\ntraining multilingual QA models. With significantly fewer parameters than large\nlanguage models and without requiring additional training for target languages,\nour approach offers an effective solution for QG and QA tasks across various\nlanguages.", "paper_summary_zh": "自動問題生成 (QG) 可用於各種目的，例如擴充問答 (QA) 資料庫、增強聊天機器人系統，以及開發教育材料。儘管其重要性，但現有的資料集大多以英語為主，導致其他語言的資料可用性存在相當大的差距。跨語言轉移 QG (XLT-QG) 透過允許在高資源語言資料集上訓練的模型來產生低資源語言的問題，來解決這個限制。在本文中，我們提出一個簡單且有效率的 XLT-QG 方法，該方法無需在目標語言中使用單語、平行或標記資料，而是利用一個小型語言模型。我們的模型僅在英語 QA 資料集上訓練，從一組有限的問題範例中學習疑問結構，然後將其應用於產生目標語言中的問題。實驗結果表明，我們的模型優於多個 XLT-QG 基準，並且在不同語言中實現了與 GPT-3.5-turbo 相當的效能。此外，我們的模型產生的合成資料被證明對訓練多語言 QA 模型有益。與大型語言模型相比，我們的模型參數明顯較少，並且不需要對目標語言進行額外訓練，因此我們的模型為各種語言的 QG 和 QA 任務提供了一個有效的解決方案。", "author": "Seonjeong Hwang et.al.", "authors": "Seonjeong Hwang, Yunsu Kim, Gary Geunbae Lee", "id": "2410.03197v1", "paper_url": "http://arxiv.org/abs/2410.03197v1", "repo": "null"}}