{"2410.03466": {"publish_time": "2024-10-04", "title": "Is Safer Better? The Impact of Guardrails on the Argumentative Strength of LLMs in Hate Speech Countering", "paper_summary": "The potential effectiveness of counterspeech as a hate speech mitigation\nstrategy is attracting increasing interest in the NLG research community,\nparticularly towards the task of automatically producing it. However,\nautomatically generated responses often lack the argumentative richness which\ncharacterises expert-produced counterspeech. In this work, we focus on two\naspects of counterspeech generation to produce more cogent responses. First, by\ninvestigating the tension between helpfulness and harmlessness of LLMs, we test\nwhether the presence of safety guardrails hinders the quality of the\ngenerations. Secondly, we assess whether attacking a specific component of the\nhate speech results in a more effective argumentative strategy to fight online\nhate. By conducting an extensive human and automatic evaluation, we show how\nthe presence of safety guardrails can be detrimental also to a task that\ninherently aims at fostering positive social interactions. Moreover, our\nresults show that attacking a specific component of the hate speech, and in\nparticular its implicit negative stereotype and its hateful parts, leads to\nhigher-quality generations.", "paper_summary_zh": "反制言論作為仇恨言論緩解策略的潛在效用，在自然語言處理研究社群中引起越來越大的興趣，特別是在自動產生反制言論的任務上。然而，自動產生的回應通常缺乏論證的豐富性，而這是專家產生的反制言論的特徵。在這項工作中，我們專注於反制言論產生的兩個面向，以產生更有說服力的回應。首先，透過探討大型語言模型（LLM）的有用性和無害性之間的緊張關係，我們測試了安全防護措施的存在是否會妨礙產生的品質。其次，我們評估攻擊仇恨言論的特定組成部分是否會產生更有效的論證策略，以對抗網路仇恨。透過進行廣泛的人工和自動評估，我們展示了安全防護措施的存在如何也會對本質上旨在促進正面社交互動的任務產生不利影響。此外，我們的結果顯示，攻擊仇恨言論的特定組成部分，特別是其隱含的負面刻板印象及其可憎的部分，會產生更高品質的回應。", "author": "Helena Bonaldi et.al.", "authors": "Helena Bonaldi, Greta Damo, Nicolás Benjamín Ocampo, Elena Cabrio, Serena Villata, Marco Guerini", "id": "2410.03466v1", "paper_url": "http://arxiv.org/abs/2410.03466v1", "repo": "null"}}