{"2408.08693": {"publish_time": "2024-08-16", "title": "Med-PMC: Medical Personalized Multi-modal Consultation with a Proactive Ask-First-Observe-Next Paradigm", "paper_summary": "The application of the Multi-modal Large Language Models (MLLMs) in medical\nclinical scenarios remains underexplored. Previous benchmarks only focus on the\ncapacity of the MLLMs in medical visual question-answering (VQA) or report\ngeneration and fail to assess the performance of the MLLMs on complex clinical\nmulti-modal tasks. In this paper, we propose a novel Medical Personalized\nMulti-modal Consultation (Med-PMC) paradigm to evaluate the clinical capacity\nof the MLLMs. Med-PMC builds a simulated clinical environment where the MLLMs\nare required to interact with a patient simulator to complete the multi-modal\ninformation-gathering and decision-making task. Specifically, the patient\nsimulator is decorated with personalized actors to simulate diverse patients in\nreal scenarios. We conduct extensive experiments to access 12 types of MLLMs,\nproviding a comprehensive view of the MLLMs' clinical performance. We found\nthat current MLLMs fail to gather multimodal information and show potential\nbias in the decision-making task when consulted with the personalized patient\nsimulators. Further analysis demonstrates the effectiveness of Med-PMC, showing\nthe potential to guide the development of robust and reliable clinical MLLMs.\nCode and data are available at https://github.com/LiuHC0428/Med-PMC.", "paper_summary_zh": "多模态大语言模型 (MLLM) 在医学临床情境中的应用仍未得到充分探索。先前的基准仅关注 MLLM 在医学视觉问答 (VQA) 或报告生成中的能力，而未能评估 MLLM 在复杂临床多模态任务中的表现。在本文中，我们提出了一个新颖的医学个性化多模态咨询 (Med-PMC) 范例来评估 MLLM 的临床能力。Med-PMC 构建了一个模拟的临床环境，其中 MLLM 需要与患者模拟器交互以完成多模态信息收集和决策任务。具体来说，患者模拟器装饰有个性化角色，以模拟真实场景中的不同患者。我们进行了广泛的实验来访问 12 种类型的 MLLM，全面了解 MLLM 的临床表现。我们发现，当前的 MLLM 无法收集多模态信息，并且在与个性化患者模拟器协商时在决策任务中表现出潜在的偏差。进一步的分析证明了 Med-PMC 的有效性，显示了指导稳健且可靠的临床 MLLM 开发的潜力。代码和数据可在 https://github.com/LiuHC0428/Med-PMC 获得。", "author": "Hongcheng Liu et.al.", "authors": "Hongcheng Liu, Yusheng Liao, Siqv Ou, Yuhao Wang, Heyang Liu, Yanfeng Wang, Yu Wang", "id": "2408.08693v1", "paper_url": "http://arxiv.org/abs/2408.08693v1", "repo": "https://github.com/liuhc0428/med-pmc"}}