{"2405.04918": {"publish_time": "2024-05-08", "title": "Delve into Base-Novel Confusion: Redundancy Exploration for Few-Shot Class-Incremental Learning", "paper_summary": "Few-shot class-incremental learning (FSCIL) aims to acquire knowledge from\nnovel classes with limited samples while retaining information about base\nclasses. Existing methods address catastrophic forgetting and overfitting by\nfreezing the feature extractor during novel-class learning. However, these\nmethods usually tend to cause the confusion between base and novel classes,\ni.e., classifying novel-class samples into base classes. In this paper, we\ndelve into this phenomenon to study its cause and solution. We first interpret\nthe confusion as the collision between the novel-class and the base-class\nregion in the feature space. Then, we find the collision is caused by the\nlabel-irrelevant redundancies within the base-class feature and pixel space.\nThrough qualitative and quantitative experiments, we identify this redundancy\nas the shortcut in the base-class training, which can be decoupled to alleviate\nthe collision. Based on this analysis, to alleviate the collision between base\nand novel classes, we propose a method for FSCIL named Redundancy Decoupling\nand Integration (RDI). RDI first decouples redundancies from base-class space\nto shrink the intra-base-class feature space. Then, it integrates the\nredundancies as a dummy class to enlarge the inter-base-class feature space.\nThis process effectively compresses the base-class feature space, creating\nbuffer space for novel classes and alleviating the model's confusion between\nthe base and novel classes. Extensive experiments across benchmark datasets,\nincluding CIFAR-100, miniImageNet, and CUB-200-2011 demonstrate that our method\nachieves state-of-the-art performance.", "paper_summary_zh": "<paragraph>少樣本類別增量學習 (FSCIL) 旨在從具有有限範例的新類別中獲取知識，同時保留有關基礎類別的資訊。現有方法透過在學習新類別時凍結特徵萃取器來解決災難性遺忘和過度擬合。然而，這些方法通常會導致基礎類別和新類別之間的混淆，即，將新類別範例分類到基礎類別中。在本文中，我們深入探討此現象以研究其成因和解決方案。我們首先將混淆解釋為特徵空間中新類別和基礎類別區域之間的碰撞。然後，我們發現碰撞是由基礎類別特徵和像素空間中的與標籤無關的冗餘造成的。透過定性和定量實驗，我們將此冗餘識別為基礎類別訓練中的捷徑，可以將其解耦以減輕碰撞。基於此分析，為了減輕基礎類別和新類別之間的碰撞，我們提出了一種名為冗餘解耦與整合 (RDI) 的 FSCIL 方法。RDI 首先從基礎類別空間中解耦冗餘，以縮小基礎類別內部特徵空間。然後，它將冗餘整合為一個虛擬類別，以擴大基礎類別之間的特徵空間。此程序有效壓縮了基礎類別特徵空間，為新類別創造了緩衝空間，並減輕了模型對基礎類別和新類別之間的混淆。在包括 CIFAR-100、miniImageNet 和 CUB-200-2011 在內的基準資料集上進行的廣泛實驗證明，我們的模型達到了最先進的效能。</paragraph>", "author": "Haichen Zhou et.al.", "authors": "Haichen Zhou, Yixiong Zou, Ruixuan Li, Yuhua Li, Kui Xiao", "id": "2405.04918v1", "paper_url": "http://arxiv.org/abs/2405.04918v1", "repo": "null"}}