{"2406.04146": {"publish_time": "2024-06-06", "title": "Towards Understanding Task-agnostic Debiasing Through the Lenses of Intrinsic Bias and Forgetfulness", "paper_summary": "While task-agnostic debiasing provides notable generalizability and reduced\nreliance on downstream data, its impact on language modeling ability and the\nrisk of relearning social biases from downstream task-specific data remain as\nthe two most significant challenges when debiasing Pretrained Language Models\n(PLMs). The impact on language modeling ability can be alleviated given a\nhigh-quality and long-contextualized debiasing corpus, but there remains a\ndeficiency in understanding the specifics of relearning biases. We empirically\nascertain that the effectiveness of task-agnostic debiasing hinges on the\nquantitative bias level of both the task-specific data used for downstream\napplications and the debiased model. We empirically show that the lower bound\nof the bias level of the downstream fine-tuned model can be approximated by the\nbias level of the debiased model, in most practical cases. To gain more\nin-depth understanding about how the parameters of PLMs change during\nfine-tuning due to the forgetting issue of PLMs, we propose a novel framework\nwhich can Propagate Socially-fair Debiasing to Downstream Fine-tuning,\nProSocialTuning. Our proposed framework can push the fine-tuned model to\napproach the bias lower bound during downstream fine-tuning, indicating that\nthe ineffectiveness of debiasing can be alleviated by overcoming the forgetting\nissue through regularizing successfully debiased attention heads based on the\nPLMs' bias levels from stages of pretraining and debiasing.", "paper_summary_zh": "<paragraph>儘管與任務無關的去偏見提供了顯著的概括性並減少了對下游資料的依賴，但它對語言建模能力的影響以及從下游特定任務資料重新學習社會偏見的風險仍然是去偏見預訓練語言模型 (PLM) 時兩個最重要的挑戰。在給定高品質且長時間脈絡化的去偏見語料庫的情況下，可以減輕對語言建模能力的影響，但對於重新學習偏見的具體情況仍缺乏理解。我們憑經驗確定與任務無關的去偏見的有效性取決於用於下游應用程式和去偏見模型的特定任務資料的量化偏見程度。我們憑經驗表明，在大多數實際情況下，下游微調模型的偏見程度的下限可以近似於去偏見模型的偏見程度。為了更深入地瞭解 PLM 的參數在微調過程中如何因 PLM 的遺忘問題而改變，我們提出了一個新的框架，可以將社會公平去偏見傳播到下游微調，即 ProSocialTuning。我們提出的框架可以在下游微調過程中推動微調模型接近偏見下限，這表明透過根據 PLM 在預訓練和去偏見階段的偏見程度，規範成功去偏見的注意力頭，可以克服遺忘問題，從而減輕去偏見的無效性。</paragraph>", "author": "Guangliang Liu et.al.", "authors": "Guangliang Liu, Milad Afshari, Xitong Zhang, Zhiyu Xue, Avrajit Ghosh, Bidhan Bashyal, Rongrong Wang, Kristen Johnson", "id": "2406.04146v1", "paper_url": "http://arxiv.org/abs/2406.04146v1", "repo": "null"}}