{"2405.04491": {"publish_time": "2024-05-07", "title": "TorchDriveEnv: A Reinforcement Learning Benchmark for Autonomous Driving with Reactive, Realistic, and Diverse Non-Playable Characters", "paper_summary": "The training, testing, and deployment, of autonomous vehicles requires\nrealistic and efficient simulators. Moreover, because of the high variability\nbetween different problems presented in different autonomous systems, these\nsimulators need to be easy to use, and easy to modify. To address these\nproblems we introduce TorchDriveSim and its benchmark extension TorchDriveEnv.\nTorchDriveEnv is a lightweight reinforcement learning benchmark programmed\nentirely in Python, which can be modified to test a number of different factors\nin learned vehicle behavior, including the effect of varying kinematic models,\nagent types, and traffic control patterns. Most importantly unlike many replay\nbased simulation approaches, TorchDriveEnv is fully integrated with a state of\nthe art behavioral simulation API. This allows users to train and evaluate\ndriving models alongside data driven Non-Playable Characters (NPC) whose\ninitializations and driving behavior are reactive, realistic, and diverse. We\nillustrate the efficiency and simplicity of TorchDriveEnv by evaluating common\nreinforcement learning baselines in both training and validation environments.\nOur experiments show that TorchDriveEnv is easy to use, but difficult to solve.", "paper_summary_zh": "自動駕駛車輛的訓練、測試和部署需要逼真且高效的模擬器。此外，由於不同自動系統中出現的不同問題之間存在高度可變性，因此這些模擬器需要易於使用且易於修改。為了解決這些問題，我們引入了 TorchDriveSim 及其基準延伸 TorchDriveEnv。TorchDriveEnv 是一個輕量級強化學習基準，完全使用 Python 編寫，可以修改以測試學習車輛行為中的許多不同因素，包括不同運動模型、代理類型和交通控制模式的影響。最重要的是，與許多基於重播的模擬方法不同，TorchDriveEnv 與最先進的行為模擬 API 完全整合。這使用戶能夠訓練和評估駕駛模型，同時使用數據驅動的非玩家角色 (NPC)，其初始化和駕駛行為具有反應性、真實性和多樣性。我們通過在訓練和驗證環境中評估常見的強化學習基準，來說明 TorchDriveEnv 的效率和簡潔性。我們的實驗表明，TorchDriveEnv 易於使用，但難以解決。", "author": "Jonathan Wilder Lavington et.al.", "authors": "Jonathan Wilder Lavington, Ke Zhang, Vasileios Lioutas, Matthew Niedoba, Yunpeng Liu, Dylan Green, Saeid Naderiparizi, Xiaoxuan Liang, Setareh Dabiri, Adam Ścibior, Berend Zwartsenberg, Frank Wood", "id": "2405.04491v1", "paper_url": "http://arxiv.org/abs/2405.04491v1", "repo": "null"}}