{"2405.12519": {"publish_time": "2024-05-21", "title": "MAGE: Model-Level Graph Neural Networks Explanations via Motif-based Graph Generation", "paper_summary": "Graph Neural Networks (GNNs) have shown remarkable success in molecular\ntasks, yet their interpretability remains challenging. Traditional model-level\nexplanation methods like XGNN and GNNInterpreter often fail to identify valid\nsubstructures like rings, leading to questionable interpretability. This\nlimitation stems from XGNN's atom-by-atom approach and GNNInterpreter's\nreliance on average graph embeddings, which overlook the essential structural\nelements crucial for molecules. To address these gaps, we introduce an\ninnovative \\textbf{M}otif-b\\textbf{A}sed \\textbf{G}NN \\textbf{E}xplainer (MAGE)\nthat uses motifs as fundamental units for generating explanations. Our approach\nbegins with extracting potential motifs through a motif decomposition\ntechnique. Then, we utilize an attention-based learning method to identify\nclass-specific motifs. Finally, we employ a motif-based graph generator for\neach class to create molecular graph explanations based on these class-specific\nmotifs. This novel method not only incorporates critical substructures into the\nexplanations but also guarantees their validity, yielding results that are\nhuman-understandable. Our proposed method's effectiveness is demonstrated\nthrough quantitative and qualitative assessments conducted on six real-world\nmolecular datasets.", "paper_summary_zh": "圖形神經網路 (GNN) 在分子任務中展現出顯著的成功，但其可解釋性仍具挑戰性。傳統的模型層級解釋方法，如 XGNN 和 GNNInterpreter，通常無法識別有效的子結構（例如環），導致可解釋性有疑慮。此限制源自於 XGNN 的逐原子方法，以及 GNNInterpreter 依賴於平均圖形嵌入，這忽略了對分子至關重要的基本結構元素。為了解決這些差距，我們引進了一個創新的基於基序的 GNN 解釋器 (MAGE)，它使用基序作為產生解釋的基本單位。我們的做法從透過基序分解技術提取潛在基序開始。接著，我們利用基於注意力的學習方法來識別特定類別的基序。最後，我們為每個類別採用基於基序的圖形產生器，以根據這些特定類別的基序建立分子圖形解釋。這種新穎的方法不僅將關鍵的子結構納入解釋中，還保證了它們的有效性，產生人類可以理解的結果。我們提出的方法的有效性已透過對六個真實世界的分子資料集進行的量化和質化評估得到證明。", "author": "Zhaoning Yu et.al.", "authors": "Zhaoning Yu, Hongyang Gao", "id": "2405.12519v1", "paper_url": "http://arxiv.org/abs/2405.12519v1", "repo": "null"}}