{"2503.16394": {"publish_time": "2025-03-20", "title": "Do Visual Imaginations Improve Vision-and-Language Navigation Agents?", "paper_summary": "Vision-and-Language Navigation (VLN) agents are tasked with navigating an\nunseen environment using natural language instructions. In this work, we study\nif visual representations of sub-goals implied by the instructions can serve as\nnavigational cues and lead to increased navigation performance. To synthesize\nthese visual representations or imaginations, we leverage a text-to-image\ndiffusion model on landmark references contained in segmented instructions.\nThese imaginations are provided to VLN agents as an added modality to act as\nlandmark cues and an auxiliary loss is added to explicitly encourage relating\nthese with their corresponding referring expressions. Our findings reveal an\nincrease in success rate (SR) of around 1 point and up to 0.5 points in success\nscaled by inverse path length (SPL) across agents. These results suggest that\nthe proposed approach reinforces visual understanding compared to relying on\nlanguage instructions alone. Code and data for our work can be found at\nhttps://www.akhilperincherry.com/VLN-Imagine-website/.", "paper_summary_zh": "<paragraph>視覺與語言導航 (VLN) 代理人的任務是使用自然語言指令在未知環境中導航。在這項工作中，我們研究指令中隱含的子目標的視覺表示是否可以作為導航線索，並提高導航效能。為了合成這些視覺表示或想像，我們利用文本到圖像的擴散模型，對分割指令中包含的地標參考進行處理。這些想像作為一種額外的模態提供給 VLN 代理人，作為地標線索，並添加一個輔助損失來明確鼓勵將這些想像與其對應的參考表達式聯繫起來。我們的研究結果顯示，在不同代理人中，成功率 (SR) 提高了約 1 個百分點，按路徑長度倒數縮放的成功率 (SPL) 提高了 0.5 個百分點。這些結果表明，與僅依賴語言指令相比，所提出的方法增強了視覺理解。我們工作的程式碼和數據可以在 https://www.akhilperincherry.com/VLN-Imagine-website/ 找到。</paragraph>\n", "author": "Akhil Perincherry et.al.", "authors": "Akhil Perincherry, Jacob Krantz, Stefan Lee", "id": "2503.16394v1", "paper_url": "http://arxiv.org/abs/2503.16394v1", "repo": "null"}}