{"2407.18335": {"publish_time": "2024-07-25", "title": "Combining Cognitive and Generative AI for Self-explanation in Interactive AI Agents", "paper_summary": "The Virtual Experimental Research Assistant (VERA) is an inquiry-based\nlearning environment that empowers a learner to build conceptual models of\ncomplex ecological systems and experiment with agent-based simulations of the\nmodels. This study investigates the convergence of cognitive AI and generative\nAI for self-explanation in interactive AI agents such as VERA. From a cognitive\nAI viewpoint, we endow VERA with a functional model of its own design,\nknowledge, and reasoning represented in the Task--Method--Knowledge (TMK)\nlanguage. From the perspective of generative AI, we use ChatGPT, LangChain, and\nChain-of-Thought to answer user questions based on the VERA TMK model. Thus, we\ncombine cognitive and generative AI to generate explanations about how VERA\nworks and produces its answers. The preliminary evaluation of the generation of\nexplanations in VERA on a bank of 66 questions derived from earlier work\nappears promising.", "paper_summary_zh": "虛擬實驗研究助理 (VERA) 是一種基於探究的學習環境，它能讓學習者建立複雜生態系統的概念模型，並對模型的基於代理的模擬進行實驗。本研究探討了認知 AI 和生成式 AI 在 VERA 等互動式 AI 代理中的自我解釋的匯聚。從認知 AI 的觀點來看，我們賦予 VERA 一個以任務-方法-知識 (TMK) 語言表示的其自身設計、知識和推理的功能模型。從生成式 AI 的角度來看，我們使用 ChatGPT、LangChain 和思想鏈根據 VERA TMK 模型來回答使用者的問題。因此，我們結合認知 AI 和生成式 AI 來產生關於 VERA 如何運作並產生答案的解釋。VERA 在一組源自早期工作的 66 個問題中產生解釋的初步評估看來很有希望。", "author": "Shalini Sushri et.al.", "authors": "Shalini Sushri, Rahul Dass, Rhea Basappa, Hong Lu, Ashok Goel", "id": "2407.18335v1", "paper_url": "http://arxiv.org/abs/2407.18335v1", "repo": "null"}}