{"2405.21075": {"publish_time": "2024-05-31", "title": "Video-MME: The First-Ever Comprehensive Evaluation Benchmark of Multi-modal LLMs in Video Analysis", "paper_summary": "In the quest for artificial general intelligence, Multi-modal Large Language\nModels (MLLMs) have emerged as a focal point in recent advancements. However,\nthe predominant focus remains on developing their capabilities in static image\nunderstanding. The potential of MLLMs in processing sequential visual data is\nstill insufficiently explored, highlighting the absence of a comprehensive,\nhigh-quality assessment of their performance. In this paper, we introduce\nVideo-MME, the first-ever full-spectrum, Multi-Modal Evaluation benchmark of\nMLLMs in Video analysis. Our work distinguishes from existing benchmarks\nthrough four key features: 1) Diversity in video types, spanning 6 primary\nvisual domains with 30 subfields to ensure broad scenario generalizability; 2)\nDuration in temporal dimension, encompassing both short-, medium-, and\nlong-term videos, ranging from 11 seconds to 1 hour, for robust contextual\ndynamics; 3) Breadth in data modalities, integrating multi-modal inputs besides\nvideo frames, including subtitles and audios, to unveil the all-round\ncapabilities of MLLMs; 4) Quality in annotations, utilizing rigorous manual\nlabeling by expert annotators to facilitate precise and reliable model\nassessment. 900 videos with a total of 256 hours are manually selected and\nannotated by repeatedly viewing all the video content, resulting in 2,700\nquestion-answer pairs. With Video-MME, we extensively evaluate various\nstate-of-the-art MLLMs, including GPT-4 series and Gemini 1.5 Pro, as well as\nopen-source image models like InternVL-Chat-V1.5 and video models like\nLLaVA-NeXT-Video. Our experiments reveal that Gemini 1.5 Pro is the\nbest-performing commercial model, significantly outperforming the open-source\nmodels. Our dataset along with these findings underscores the need for further\nimprovements in handling longer sequences and multi-modal data. Project Page:\nhttps://video-mme.github.io", "paper_summary_zh": "在追求人工通用智能的過程中，多模態大型語言模型 (MLLM) 已成為近期進展中的焦點。然而，主要的重點仍放在發展它們在靜態影像理解方面的能力。MLLM 在處理順序視覺資料的潛力仍未被充分探討，突顯了缺乏對其效能進行全面、高品質評估。在本文中，我們引入了 Video-MME，這是第一個針對 MLLM 在影片分析中的全光譜多模態評估基準。我們的研究透過四項關鍵特徵區別於現有基準：1) 影片類型的多樣性，涵蓋 6 個主要視覺領域，包含 30 個子領域，以確保廣泛的場景通用性；2) 時間維度的持續時間，包含短、中、長期影片，範圍從 11 秒到 1 小時，以確保穩健的脈絡動態；3) 資料模態的廣度，除了影片幀之外，還整合了多模態輸入，包括字幕和音訊，以揭示 MLLM 的全面能力；4) 標註的品質，利用專家標註員嚴謹的手動標註，以利精確且可靠的模型評估。900 個影片，總長為 256 小時，透過重複觀看所有影片內容進行手動挑選和標註，產生了 2,700 個問答配對。透過 Video-MME，我們廣泛評估了各種最先進的 MLLM，包括 GPT-4 系列和 Gemini 1.5 Pro，以及像 InternVL-Chat-V1.5 的開源影像模型和 LLaVA-NeXT-Video 的影片模型。我們的實驗顯示，Gemini 1.5 Pro 是效能最好的商業模型，顯著優於開源模型。我們的資料集和這些發現強調了進一步改進處理較長順序和多模態資料的必要性。專案頁面：https://video-mme.github.io", "author": "Chaoyou Fu et.al.", "authors": "Chaoyou Fu, Yuhan Dai, Yondong Luo, Lei Li, Shuhuai Ren, Renrui Zhang, Zihan Wang, Chenyu Zhou, Yunhang Shen, Mengdan Zhang, Peixian Chen, Yanwei Li, Shaohui Lin, Sirui Zhao, Ke Li, Tong Xu, Xiawu Zheng, Enhong Chen, Rongrong Ji, Xing Sun", "id": "2405.21075v1", "paper_url": "http://arxiv.org/abs/2405.21075v1", "repo": "null"}}