{"2408.14623": {"publish_time": "2024-08-26", "title": "MODOC: A Modular Interface for Flexible Interlinking of Text Retrieval and Text Generation Functions", "paper_summary": "Large Language Models (LLMs) produce eloquent texts but often the content\nthey generate needs to be verified. Traditional information retrieval systems\ncan assist with this task, but most systems have not been designed with\nLLM-generated queries in mind. As such, there is a compelling need for\nintegrated systems that provide both retrieval and generation functionality\nwithin a single user interface.\n  We present MODOC, a modular user interface that leverages the capabilities of\nLLMs and provides assistance with detecting their confabulations, promoting\nintegrity in scientific writing. MODOC represents a significant step forward in\nscientific writing assistance. Its modular architecture supports flexible\nfunctions for retrieving information and for writing and generating text in a\nsingle, user-friendly interface.", "paper_summary_zh": "大型語言模型 (LLM) 會產生流暢的文字，但其產生的內容通常需要驗證。傳統資訊檢索系統可以協助執行這項任務，但大多數系統並未考量 LLM 產生的查詢。因此，非常需要整合系統，在單一使用者介面中提供檢索和產生功能。\n我們提出 MODOC，這是一個模組化使用者介面，它能利用 LLM 的功能，並協助偵測其虛構內容，提升科學寫作的誠信度。MODOC 代表科學寫作輔助的重大進展。其模組化架構支援彈性的資訊檢索功能，以及在單一、使用者友善的介面中撰寫和產生文字。", "author": "Yingqiang Gao et.al.", "authors": "Yingqiang Gao, Jhony Prada, Nianlong Gu, Jessica Lam, Richard H. R. Hahnloser", "id": "2408.14623v1", "paper_url": "http://arxiv.org/abs/2408.14623v1", "repo": "null"}}