{"2405.04118": {"publish_time": "2024-05-07", "title": "Policy Learning with a Language Bottleneck", "paper_summary": "Modern AI systems such as self-driving cars and game-playing agents achieve\nsuperhuman performance, but often lack human-like features such as\ngeneralization, interpretability and human inter-operability. Inspired by the\nrich interactions between language and decision-making in humans, we introduce\nPolicy Learning with a Language Bottleneck (PLLB), a framework enabling AI\nagents to generate linguistic rules that capture the strategies underlying\ntheir most rewarding behaviors. PLLB alternates between a rule generation step\nguided by language models, and an update step where agents learn new policies\nguided by rules. In a two-player communication game, a maze solving task, and\ntwo image reconstruction tasks, we show that PLLB agents are not only able to\nlearn more interpretable and generalizable behaviors, but can also share the\nlearned rules with human users, enabling more effective human-AI coordination.", "paper_summary_zh": "現代 AI 系統，例如自動駕駛汽車和遊戲代理，已達到超越人類的表現，但通常缺乏人類特質，例如概括、可解釋和人類互操作性。受到人類語言和決策制定之間豐富互動的啟發，我們引入了帶有語言瓶頸的策略學習 (PLLB)，一個使 AI 代理能夠生成語言規則的框架，以捕捉其最具回報行為背後的策略。PLLB 在由語言模型引導的規則生成步驟和代理學習由規則引導的新策略的更新步驟之間交替。在雙人溝通遊戲、迷宮求解任務和兩個圖像重建任務中，我們展示了 PLLB 代理不僅能夠學習更具可解釋性和概括性的行為，而且還能與人類使用者分享學習到的規則，從而實現更有效的人機協調。", "author": "Megha Srivastava et.al.", "authors": "Megha Srivastava, Cedric Colas, Dorsa Sadigh, Jacob Andreas", "id": "2405.04118v1", "paper_url": "http://arxiv.org/abs/2405.04118v1", "repo": "https://github.com/meghabyte/bottleneck"}}