{"2501.12326": {"publish_time": "2025-01-21", "title": "UI-TARS: Pioneering Automated GUI Interaction with Native Agents", "paper_summary": "This paper introduces UI-TARS, a native GUI agent model that solely perceives\nthe screenshots as input and performs human-like interactions (e.g., keyboard\nand mouse operations). Unlike prevailing agent frameworks that depend on\nheavily wrapped commercial models (e.g., GPT-4o) with expert-crafted prompts\nand workflows, UI-TARS is an end-to-end model that outperforms these\nsophisticated frameworks. Experiments demonstrate its superior performance:\nUI-TARS achieves SOTA performance in 10+ GUI agent benchmarks evaluating\nperception, grounding, and GUI task execution. Notably, in the OSWorld\nbenchmark, UI-TARS achieves scores of 24.6 with 50 steps and 22.7 with 15\nsteps, outperforming Claude (22.0 and 14.9 respectively). In AndroidWorld,\nUI-TARS achieves 46.6, surpassing GPT-4o (34.5). UI-TARS incorporates several\nkey innovations: (1) Enhanced Perception: leveraging a large-scale dataset of\nGUI screenshots for context-aware understanding of UI elements and precise\ncaptioning; (2) Unified Action Modeling, which standardizes actions into a\nunified space across platforms and achieves precise grounding and interaction\nthrough large-scale action traces; (3) System-2 Reasoning, which incorporates\ndeliberate reasoning into multi-step decision making, involving multiple\nreasoning patterns such as task decomposition, reflection thinking, milestone\nrecognition, etc. (4) Iterative Training with Reflective Online Traces, which\naddresses the data bottleneck by automatically collecting, filtering, and\nreflectively refining new interaction traces on hundreds of virtual machines.\nThrough iterative training and reflection tuning, UI-TARS continuously learns\nfrom its mistakes and adapts to unforeseen situations with minimal human\nintervention. We also analyze the evolution path of GUI agents to guide the\nfurther development of this domain.", "paper_summary_zh": "本文介紹了 UI-TARS，一種原生 GUI 代理模型，它僅將螢幕截圖視為輸入，並執行類似人類的互動（例如，鍵盤和滑鼠操作）。與依賴於專家精心製作的提示和工作流程的盛行代理架構不同，UI-TARS 是一個端到端模型，其效能優於這些複雜的架構。實驗證明了其卓越的效能：UI-TARS 在 10 多個 GUI 代理基準測試中取得 SOTA 效能，評估感知、基礎和 GUI 任務執行。值得注意的是，在 OSWorld 基準測試中，UI-TARS 在 50 個步驟中取得 24.6 分，在 15 個步驟中取得 22.7 分，優於 Claude（分別為 22.0 和 14.9）。在 AndroidWorld 中，UI-TARS 取得 46.6 分，超越 GPT-4o（34.5）。UI-TARS 融合了多項關鍵創新：(1) 增強感知：利用大規模 GUI 螢幕截圖資料集，以情境感知的方式理解 UI 元素並進行精確標題說明；(2) 統一動作建模，將動作標準化到跨平台的統一空間，並透過大規模動作追蹤，實現精確的基礎和互動；(3) 系統 2 推理，將深思熟慮的推理納入多步驟決策制定中，涉及多種推理模式，例如任務分解、反思思考、里程碑識別等；(4) 透過反思性線上追蹤進行反覆訓練，透過在數百台虛擬機器上自動收集、過濾和反思性地精煉新的互動追蹤，來解決資料瓶頸問題。透過反覆訓練和反思調整，UI-TARS 不斷從其錯誤中學習，並在最少的人為干預下適應無法預見的情況。我們也分析了 GUI 代理的演進路徑，以引導此領域的進一步發展。", "author": "Yujia Qin et.al.", "authors": "Yujia Qin, Yining Ye, Junjie Fang, Haoming Wang, Shihao Liang, Shizuo Tian, Junda Zhang, Jiahao Li, Yunxin Li, Shijue Huang, Wanjun Zhong, Kuanye Li, Jiale Yang, Yu Miao, Woyu Lin, Longxiang Liu, Xu Jiang, Qianli Ma, Jingyu Li, Xiaojun Xiao, Kai Cai, Chuang Li, Yaowei Zheng, Chaolin Jin, Chen Li, Xiao Zhou, Minchao Wang, Haoli Chen, Zhaojian Li, Haihua Yang, Haifeng Liu, Feng Lin, Tao Peng, Xin Liu, Guang Shi", "id": "2501.12326v1", "paper_url": "http://arxiv.org/abs/2501.12326v1", "repo": "https://github.com/bytedance/ui-tars"}}