{"2411.05514": {"publish_time": "2024-11-08", "title": "Towards Scalable Foundation Models for Digital Dermatology", "paper_summary": "The growing demand for accurate and equitable AI models in digital\ndermatology faces a significant challenge: the lack of diverse, high-quality\nlabeled data. In this work, we investigate the potential of domain-specific\nfoundation models for dermatology in addressing this challenge. We utilize\nself-supervised learning (SSL) techniques to pre-train models on a dataset of\nover 240,000 dermatological images from public and private collections. Our\nstudy considers several SSL methods and compares the resulting foundation\nmodels against domain-agnostic models like those pre-trained on ImageNet and\nstate-of-the-art models such as MONET across 12 downstream tasks. Unlike\nprevious research, we emphasize the development of smaller models that are more\nsuitable for resource-limited clinical settings, facilitating easier adaptation\nto a broad range of use cases. Results show that models pre-trained in this\nwork not only outperform general-purpose models but also approach the\nperformance of models 50 times larger on clinically relevant diagnostic tasks.\nTo promote further research in this direction, we publicly release both the\ntraining code and the foundation models, which can benefit clinicians in\ndermatological applications.", "paper_summary_zh": "數位皮膚科對精準且公平的 AI 模型需求日益增加，但面臨一項重大挑戰：缺乏多元且高品質的標記資料。在這項研究中，我們探討特定領域的基礎模型在皮膚科中解決此挑戰的可能性。我們利用自監督學習 (SSL) 技術在包含超過 24 萬張來自公有和私有資料庫的皮膚科影像的資料集上預先訓練模型。我們的研究考量了多種 SSL 方法，並將產生的基礎模型與不受領域限制的模型（例如在 ImageNet 上預先訓練的模型）以及最先進的模型（例如 MONET）在 12 個下游任務中進行比較。與先前的研究不同，我們強調開發更適合資源有限的臨床環境的小型模型，以利於更輕鬆地適應廣泛的用例。結果顯示，在這項研究中預先訓練的模型不僅優於通用模型，而且在臨床上相關的診斷任務中，其效能也接近大 50 倍的模型。為了促進此方向的進一步研究，我們公開發布訓練程式碼和基礎模型，這些模型可讓皮膚科應用中的臨床醫生受益。", "author": "Fabian Gröger et.al.", "authors": "Fabian Gröger, Philippe Gottfrois, Ludovic Amruthalingam, Alvaro Gonzalez-Jimenez, Simone Lionetti, Luis R. Soenksen-Martinez, Alexander A. Navarini, Marc Pouly", "id": "2411.05514v1", "paper_url": "http://arxiv.org/abs/2411.05514v1", "repo": "null"}}