{"2501.09136": {"publish_time": "2025-01-15", "title": "Agentic Retrieval-Augmented Generation: A Survey on Agentic RAG", "paper_summary": "Large Language Models (LLMs) have revolutionized artificial intelligence (AI)\nby enabling human like text generation and natural language understanding.\nHowever, their reliance on static training data limits their ability to respond\nto dynamic, real time queries, resulting in outdated or inaccurate outputs.\nRetrieval Augmented Generation (RAG) has emerged as a solution, enhancing LLMs\nby integrating real time data retrieval to provide contextually relevant and\nup-to-date responses. Despite its promise, traditional RAG systems are\nconstrained by static workflows and lack the adaptability required for\nmultistep reasoning and complex task management.\n  Agentic Retrieval-Augmented Generation (Agentic RAG) transcends these\nlimitations by embedding autonomous AI agents into the RAG pipeline. These\nagents leverage agentic design patterns reflection, planning, tool use, and\nmultiagent collaboration to dynamically manage retrieval strategies,\niteratively refine contextual understanding, and adapt workflows to meet\ncomplex task requirements. This integration enables Agentic RAG systems to\ndeliver unparalleled flexibility, scalability, and context awareness across\ndiverse applications.\n  This survey provides a comprehensive exploration of Agentic RAG, beginning\nwith its foundational principles and the evolution of RAG paradigms. It\npresents a detailed taxonomy of Agentic RAG architectures, highlights key\napplications in industries such as healthcare, finance, and education, and\nexamines practical implementation strategies. Additionally, it addresses\nchallenges in scaling these systems, ensuring ethical decision making, and\noptimizing performance for real-world applications, while providing detailed\ninsights into frameworks and tools for implementing Agentic RAG", "paper_summary_zh": "大型語言模型 (LLM) 透過啟用類似人類的文字產生和自然語言理解，徹底革新了人工智慧 (AI)。\n然而，它們依賴於靜態訓練資料，限制了它們回應動態、即時查詢的能力，導致過時或不準確的輸出。\n檢索增強生成 (RAG) 已成為一種解決方案，透過整合即時資料檢索來增強 LLM，以提供與脈絡相關且最新的回應。儘管很有希望，傳統的 RAG 系統受到靜態工作流程的限制，並且缺乏多步驟推理和複雜任務管理所需的適應性。\n主動檢索增強生成 (Agentic RAG) 透過將自主 AI 代理嵌入 RAG 管道中，超越了這些限制。這些代理利用主動設計模式反射、規劃、工具使用和多代理協作，動態管理檢索策略、反覆精煉脈絡理解，並調整工作流程以滿足複雜的任務需求。這種整合使 Agentic RAG 系統能夠在各種應用中提供無與倫比的靈活性、可擴充性和脈絡感知。\n本調查對 Agentic RAG 進行全面探討，從其基本原理和 RAG 典範的演進開始。它提出了 Agentic RAG 架構的詳細分類，重點介紹了醫療保健、金融和教育等產業中的關鍵應用，並探討了實用的實作策略。此外，它還解決了擴充這些系統、確保道德決策制定和最佳化實際應用效能的挑戰，同時提供有關實作 Agentic RAG 的架構和工具的詳細見解", "author": "Aditi Singh et.al.", "authors": "Aditi Singh, Abul Ehtesham, Saket Kumar, Tala Talaei Khoei", "id": "2501.09136v1", "paper_url": "http://arxiv.org/abs/2501.09136v1", "repo": "https://github.com/asinghcsu/agenticrag-survey"}}