{"2406.11514": {"publish_time": "2024-06-17", "title": "Counterfactual Debating with Preset Stances for Hallucination Elimination of LLMs", "paper_summary": "Large Language Models (LLMs) excel in various natural language processing\ntasks but struggle with hallucination issues. Existing solutions have\nconsidered utilizing LLMs' inherent reasoning abilities to alleviate\nhallucination, such as self-correction and diverse sampling methods. However,\nthese methods often overtrust LLMs' initial answers due to inherent biases. The\nkey to alleviating this issue lies in overriding LLMs' inherent biases for\nanswer inspection. To this end, we propose a CounterFactual Multi-Agent Debate\n(CFMAD) framework. CFMAD presets the stances of LLMs to override their inherent\nbiases by compelling LLMs to generate justifications for a predetermined\nanswer's correctness. The LLMs with different predetermined stances are engaged\nwith a skeptical critic for counterfactual debate on the rationality of\ngenerated justifications. Finally, the debate process is evaluated by a\nthird-party judge to determine the final answer. Extensive experiments on four\ndatasets of three tasks demonstrate the superiority of CFMAD over existing\nmethods.", "paper_summary_zh": "大型語言模型 (LLM) 在各種自然語言處理任務中表現出色，但卻飽受幻覺問題所苦。現有的解決方案已考慮利用 LLM 內在的推理能力來減輕幻覺，例如自我修正和多樣化抽樣方法。然而，這些方法由於內在偏見，常常過度信任 LLM 的初始答案。解決此問題的關鍵在於覆寫 LLM 固有的偏見以進行答案檢查。為此，我們提出了一個反事實多主體辯論 (CFMAD) 框架。CFMAD 預設 LLM 的立場以覆寫其內在偏見，強迫 LLM 為預先確定的答案正確性產生依據。具有不同預先確定立場的 LLM 與一位懷疑論者進行反事實辯論，針對已產生依據的合理性進行辯論。最後，辯論過程由第三方評審進行評估，以確定最終答案。在三個任務的四個資料集上進行的廣泛實驗證明了 CFMAD 優於現有方法。", "author": "Yi Fang et.al.", "authors": "Yi Fang, Moxin Li, Wenjie Wang, Hui Lin, Fuli Feng", "id": "2406.11514v1", "paper_url": "http://arxiv.org/abs/2406.11514v1", "repo": "null"}}