{"2405.17428": {"publish_time": "2024-05-27", "title": "NV-Embed: Improved Techniques for Training LLMs as Generalist Embedding Models", "paper_summary": "Decoder-only large language model (LLM)-based embedding models are beginning\nto outperform BERT or T5-based embedding models in general-purpose text\nembedding tasks, including dense vector-based retrieval. In this work, we\nintroduce the NV-Embed model with a variety of architectural designs and\ntraining procedures to significantly enhance the performance of LLM as a\nversatile embedding model, while maintaining its simplicity and\nreproducibility. For model architecture, we propose a latent attention layer to\nobtain pooled embeddings, which consistently improves retrieval and downstream\ntask accuracy compared to mean pooling or using the last <EOS> token embedding\nfrom LLMs. To enhance representation learning, we remove the causal attention\nmask of LLMs during contrastive training. For model training, we introduce a\ntwo-stage contrastive instruction-tuning method. It first applies contrastive\ntraining with instructions on retrieval datasets, utilizing in-batch negatives\nand curated hard negative examples. At stage-2, it blends various non-retrieval\ndatasets into instruction tuning, which not only enhances non-retrieval task\naccuracy but also improves retrieval performance. Combining these techniques,\nour NV-Embed model, using only publicly available data, has achieved a\nrecord-high score of 69.32, ranking No. 1 on the Massive Text Embedding\nBenchmark (MTEB) (as of May 24, 2024), with 56 tasks, encompassing retrieval,\nreranking, classification, clustering, and semantic textual similarity tasks.\nNotably, our model also attains the highest score of 59.36 on 15 retrieval\ntasks in the MTEB benchmark (also known as BEIR). We will open-source the model\nat: https://huggingface.co/nvidia/NV-Embed-v1.", "paper_summary_zh": "<paragraph>僅解碼器的大語言模型 (LLM) 為基礎的嵌入模型正開始\n在一般用途文字嵌入任務中超越 BERT 或 T5 為基礎的嵌入模型，包括密集向量為基礎的檢索。在此研究中，我們\n引入了 NV-Embed 模型，其具備各種架構設計和\n訓練程序，以顯著提升 LLM 的效能，使其成為一個多功能的嵌入模型，同時維持其簡潔性和\n可複製性。對於模型架構，我們提出一個潛在注意力層，以取得匯集嵌入，與平均匯集或使用 LLM 的最後一個 <EOS> 代號嵌入相比，這持續改善檢索和下游\n任務的準確度。為了加強表徵學習，我們在對比訓練期間移除了 LLM 的因果注意力遮罩。對於模型訓練，我們引入了\n一個兩階段對比指令微調方法。它首先對檢索資料集中的指令套用對比訓練，利用批次內負例和策劃的困難負例。在第 2 階段，它將各種非檢索\n資料集混合到指令微調中，這不僅加強了非檢索任務的準確度，也改善了檢索效能。結合這些技術，我們的 NV-Embed 模型僅使用公開可取得的資料，在 Massive Text Embedding Benchmark (MTEB)（截至 2024 年 5 月 24 日）中獲得了 69.32 的破紀錄高分，排名第 1，涵蓋了 56 個任務，包含檢索、重新排名、分類、分群和語義文本相似度任務。\n值得注意的是，我們的模型也在 MTEB 基準測試（也稱為 BEIR）中的 15 個檢索任務中獲得了 59.36 的最高分。我們將在以下網址開放模型原始碼：https://huggingface.co/nvidia/NV-Embed-v1。</paragraph>", "author": "Chankyu Lee et.al.", "authors": "Chankyu Lee, Rajarshi Roy, Mengyao Xu, Jonathan Raiman, Mohammad Shoeybi, Bryan Catanzaro, Wei Ping", "id": "2405.17428v1", "paper_url": "http://arxiv.org/abs/2405.17428v1", "repo": "null"}}