{"2405.18395": {"publish_time": "2024-05-28", "title": "MC-GTA: Metric-Constrained Model-Based Clustering using Goodness-of-fit Tests with Autocorrelations", "paper_summary": "A wide range of (multivariate) temporal (1D) and spatial (2D) data analysis\ntasks, such as grouping vehicle sensor trajectories, can be formulated as\nclustering with given metric constraints. Existing metric-constrained\nclustering algorithms overlook the rich correlation between feature similarity\nand metric distance, i.e., metric autocorrelation. The model-based variations\nof these clustering algorithms (e.g. TICC and STICC) achieve SOTA performance,\nyet suffer from computational instability and complexity by using a\nmetric-constrained Expectation-Maximization procedure. In order to address\nthese two problems, we propose a novel clustering algorithm, MC-GTA\n(Model-based Clustering via Goodness-of-fit Tests with Autocorrelations). Its\nobjective is only composed of pairwise weighted sums of feature similarity\nterms (square Wasserstein-2 distance) and metric autocorrelation terms (a novel\nmultivariate generalization of classic semivariogram). We show that MC-GTA is\neffectively minimizing the total hinge loss for intra-cluster observation pairs\nnot passing goodness-of-fit tests, i.e., statistically not originating from the\nsame distribution. Experiments on 1D/2D synthetic and real-world datasets\ndemonstrate that MC-GTA successfully incorporates metric autocorrelation. It\noutperforms strong baselines by large margins (up to 14.3% in ARI and 32.1% in\nNMI) with faster and stabler optimization (>10x speedup).", "paper_summary_zh": "<paragraph>廣泛的 (多變量) 時間 (1D) 和空間 (2D) 資料分析任務，例如群組車輛感測器軌跡，可以表述為具有給定度量約束的群集。現有的度量約束群集演算法忽略了特徵相似度和度量距離之間的豐富相關性，即度量自相關。這些群集演算法的基於模型的變異 (例如 TICC 和 STICC) 達到了 SOTA 效能，但由於使用了度量約束的期望最大化程序而導致計算不穩定性和複雜性。為了解決這兩個問題，我們提出了一種新的群集演算法，MC-GTA (透過具有自相關的適配度檢定進行的基於模型的群集)。其目標僅由特徵相似度項 (平方 Wasserstein-2 距離) 和度量自相關項 (經典半變異函數的新多變量概化) 的成對加權和組成。我們展示了 MC-GTA 有效地最小化了未通過適配度檢定的群集內觀測對的總鉸鏈損失，即統計上並非來自同一個分佈。在 1D/2D 合成和真實世界資料集上的實驗證明了 MC-GTA 成功地納入了度量自相關。它以大幅度的優勢 (ARI 中高達 14.3%，NMI 中高達 32.1%) 優於強大的基準，同時具有更快速且穩定的最佳化 (>10 倍加速)。</paragraph>", "author": "Zhangyu Wang et.al.", "authors": "Zhangyu Wang, Gengchen Mai, Krzysztof Janowicz, Ni Lao", "id": "2405.18395v1", "paper_url": "http://arxiv.org/abs/2405.18395v1", "repo": "https://github.com/Octopolugal/MC-GTA"}}