{"2411.04496": {"publish_time": "2024-11-07", "title": "Thanos: Enhancing Conversational Agents with Skill-of-Mind-Infused Large Language Model", "paper_summary": "To increase social bonding with interlocutors, humans naturally acquire the\nability to respond appropriately in a given situation by considering which\nconversational skill is most suitable for the response - a process we call\nskill-of-mind. For large language model (LLM)-based conversational agents,\nplanning appropriate conversational skills, as humans do, is challenging due to\nthe complexity of social dialogue, especially in interactive scenarios. To\naddress this, we propose a skill-of-mind-annotated conversation dataset, named\nMultifaceted Skill-of-Mind, which includes multi-turn and multifaceted\nconversational skills across various interactive scenarios (e.g., long-term,\ncounseling, task-oriented), grounded in diverse social contexts (e.g.,\ndemographics, persona, rules of thumb). This dataset consists of roughly 100K\nconversations. Using this dataset, we introduce a new family of\nskill-of-mind-infused LLMs, named Thanos, with model sizes of 1B, 3B, and 8B\nparameters. With extensive experiments, these models successfully demonstrate\nthe skill-of-mind process and exhibit strong generalizability in inferring\nmultifaceted skills across a variety of domains. Moreover, we show that Thanos\nsignificantly enhances the quality of responses generated by LLM-based\nconversational agents and promotes prosocial behavior in human evaluations.", "paper_summary_zh": "為了增加與對話者的社交連結，人類自然會習得在特定情況下適當地回應的能力，考量哪種對話技巧最適合回應，這項過程我們稱為心智技巧。對於大型語言模型 (LLM) 為基礎的對話代理來說，規劃適當的對話技巧，就像人類一樣，是一項挑戰，因為社交對話很複雜，尤其是在互動式情境中。為了解決這個問題，我們提出一個心智技巧註解對話資料集，稱為多面向心智技巧，其中包含各種互動式情境（例如長期、諮詢、以任務為導向）的多輪且多面向對話技巧，並奠基於不同的社交脈絡（例如人口統計、角色、經驗法則）。此資料集包含約 100K 對話。使用此資料集，我們引進一個新系列的心智技巧注入式 LLM，稱為 Thanos，模型大小為 1B、3B 和 8B 參數。透過廣泛的實驗，這些模型成功示範心智技巧過程，並展現強大的概括能力，用於推論各種領域的多面向技巧。此外，我們證明 Thanos 大幅提升 LLM 為基礎的對話代理所產生的回應品質，並在人類評估中促進親社會行為。", "author": "Young-Jun Lee et.al.", "authors": "Young-Jun Lee, Dokyong Lee, Junyoung Youn, Kyeongjin Oh, Ho-Jin Choi", "id": "2411.04496v1", "paper_url": "http://arxiv.org/abs/2411.04496v1", "repo": "https://github.com/passing2961/thanos"}}