{"2412.06419": {"publish_time": "2024-12-09", "title": "LLM-BIP: Structured Pruning for Large Language Models with Block-Wise Forward Importance Propagation", "paper_summary": "Large language models (LLMs) have demonstrated remarkable performance across\nvarious language tasks, but their widespread deployment is impeded by their\nlarge size and high computational costs. Structural pruning is a prevailing\ntechnique used to introduce sparsity into pre-trained models and facilitate\ndirect hardware acceleration during inference by removing redundant connections\n(structurally-grouped parameters), such as channels and attention heads.\nExisting structural pruning approaches often employ either global or layer-wise\npruning criteria; however, they are hindered by ineffectiveness stemming from\ninaccurate evaluation of connection importance. Global pruning methods\ntypically assess component importance using near-zero and unreliable gradients,\nwhile layer-wise pruning approaches encounter significant pruning error\naccumulation issues. To this end, we propose a more accurate pruning metric\nbased on the block-wise importance score propagation, termed LLM-BIP.\nSpecifically, LLM-BIP precisely evaluates connection importance by gauging its\ninfluence on the respective transformer block output, which can be efficiently\napproximated in a single forward pass through an upper bound derived from the\nassumption of Lipschitz continuity. We evaluate the proposed method using\nLLaMA-7B, Vicuna-7B, and LLaMA-13B across common zero-shot tasks. The results\ndemonstrate that our approach achieves an average of 3.26% increase in accuracy\nfor common reasoning tasks compared to previous best baselines. It also reduces\nperplexity by 14.09 and 68.76 on average for the WikiText2 dataset and PTB\ndataset, respectively.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種語言任務中展現出卓越的效能，但其廣泛部署受到其龐大規模和高運算成本的阻礙。結構化剪枝是一種普遍用於在預訓練模型中引入稀疏性，並透過移除多餘連接（結構化群組參數），例如通道和注意力頭部，以利於在推論期間直接硬體加速的技術。現有的結構化剪枝方法通常採用全域或逐層剪枝準則；然而，它們受到源自於連接重要性評估不準確所造成的無效性阻礙。全域剪枝方法通常使用接近於零且不可靠的梯度來評估組成部分的重要性，而逐層剪枝方法則會遭遇顯著的剪枝誤差累積問題。為此，我們提出一個更精確的剪枝指標，其基於區塊式重要性分數傳播，稱為 LLM-BIP。具體來說，LLM-BIP 精確地評估連接的重要性，方法是評估其對應Transformer區塊輸出的影響，而這可以用一個前向傳遞中的單一上限來有效近似，該上限源自於 Lipschitz 連續性的假設。我們使用 LLaMA-7B、Vicuna-7B 和 LLaMA-13B 在常見的零次任務中評估所提出的方法。結果表明，與先前的最佳基準線相比，我們的做法在常見推理任務中平均提高了 3.26% 的準確度。它還分別將 WikiText2 資料集和 PTB 資料集的困惑度平均降低了 14.09 和 68.76。", "author": "Haihang Wu et.al.", "authors": "Haihang Wu", "id": "2412.06419v1", "paper_url": "http://arxiv.org/abs/2412.06419v1", "repo": "null"}}