{"2501.03535": {"publish_time": "2025-01-07", "title": "SenseRAG: Constructing Environmental Knowledge Bases with Proactive Querying for LLM-Based Autonomous Driving", "paper_summary": "This study addresses the critical need for enhanced situational awareness in\nautonomous driving (AD) by leveraging the contextual reasoning capabilities of\nlarge language models (LLMs). Unlike traditional perception systems that rely\non rigid, label-based annotations, it integrates real-time, multimodal sensor\ndata into a unified, LLMs-readable knowledge base, enabling LLMs to dynamically\nunderstand and respond to complex driving environments. To overcome the\ninherent latency and modality limitations of LLMs, a proactive\nRetrieval-Augmented Generation (RAG) is designed for AD, combined with a\nchain-of-thought prompting mechanism, ensuring rapid and context-rich\nunderstanding. Experimental results using real-world Vehicle-to-everything\n(V2X) datasets demonstrate significant improvements in perception and\nprediction performance, highlighting the potential of this framework to enhance\nsafety, adaptability, and decision-making in next-generation AD systems.", "paper_summary_zh": "本研究透過運用大型語言模型 (LLM) 的情境推理能力，探討自駕車 (AD) 中加強情境感知的關鍵需求。與依賴於僵化的基於標籤的註解的傳統感知系統不同，它將即時的多模態感測器資料整合到統一的、LLM 可讀的知識庫中，使 LLM 能夠動態理解和回應複雜的駕駛環境。為了克服 LLM 固有的延遲和模態限制，設計了一個主動的檢索增強生成 (RAG) 用於 AD，結合了思維鏈提示機制，確保快速且內容豐富的理解。使用真實世界車聯網 (V2X) 資料集的實驗結果證明了感知和預測效能的顯著提升，突顯了此架構在提升下一代 AD 系統安全性、適應性和決策制定方面的潛力。", "author": "Xuewen Luo et.al.", "authors": "Xuewen Luo, Fan Ding, Fengze Yang, Yang Zhou, Junnyong Loo, Hwa Hui Tew, Chenxi Liu", "id": "2501.03535v1", "paper_url": "http://arxiv.org/abs/2501.03535v1", "repo": "null"}}