{"2405.03873": {"publish_time": "2024-05-06", "title": "Investigating Personalized Driving Behaviors in Dilemma Zones: Analysis and Prediction of Stop-or-Go Decisions", "paper_summary": "Dilemma zones at signalized intersections present a commonly occurring but\nunsolved challenge for both drivers and traffic operators. Onsets of the yellow\nlights prompt varied responses from different drivers: some may brake abruptly,\ncompromising the ride comfort, while others may accelerate, increasing the risk\nof red-light violations and potential safety hazards. Such diversity in\ndrivers' stop-or-go decisions may result from not only surrounding traffic\nconditions, but also personalized driving behaviors. To this end, identifying\npersonalized driving behaviors and integrating them into advanced driver\nassistance systems (ADAS) to mitigate the dilemma zone problem presents an\nintriguing scientific question. In this study, we employ a game engine-based\n(i.e., CARLA-enabled) driving simulator to collect high-resolution vehicle\ntrajectories, incoming traffic signal phase and timing information, and\nstop-or-go decisions from four subject drivers in various scenarios. This\napproach allows us to analyze personalized driving behaviors in dilemma zones\nand develop a Personalized Transformer Encoder to predict individual drivers'\nstop-or-go decisions. The results show that the Personalized Transformer\nEncoder improves the accuracy of predicting driver decision-making in the\ndilemma zone by 3.7% to 12.6% compared to the Generic Transformer Encoder, and\nby 16.8% to 21.6% over the binary logistic regression model.", "paper_summary_zh": "<paragraph>信號交叉路口的兩難地帶對駕駛和交通管理員來說是一個普遍存在但尚未解決的挑戰。黃燈的出現會引發不同駕駛人的不同反應：有些人可能會突然煞車，犧牲行車舒適性，而另一些人可能會加速，增加闖紅燈和潛在安全危害的風險。駕駛人的停車或行駛決策出現這種差異，可能不僅是因為周圍的交通狀況，也可能是因為個人的駕駛行為。因此，找出個人的駕駛行為並將其整合到先進駕駛輔助系統 (ADAS) 中以減輕兩難地帶問題，是一個引人入勝的科學問題。在這項研究中，我們採用基於遊戲引擎（即 CARLA 啟用）的駕駛模擬器來收集高解析度車輛軌跡、來車信號相位和時序資訊，以及四位受試駕駛在各種情境下的停車或行駛決策。這種方法讓我們能夠分析兩難地帶的個人駕駛行為，並開發一個個人化 Transformer 編碼器來預測個別駕駛的停車或行駛決策。結果顯示，與通用 Transformer 編碼器相比，個人化 Transformer 編碼器將兩難地帶駕駛決策預測的準確度提高了 3.7% 至 12.6%，與二元邏輯迴歸模型相比，提高了 16.8% 至 21.6%。</paragraph>", "author": "Ziye Qin et.al.", "authors": "Ziye Qin, Siyan Li, Guoyuan Wu, Matthew J. Barth, Amr Abdelraouf, Rohit Gupta, Kyungtae Han", "id": "2405.03873v1", "paper_url": "http://arxiv.org/abs/2405.03873v1", "repo": "null"}}