{"2412.17726": {"publish_time": "2024-12-23", "title": "VidTwin: Video VAE with Decoupled Structure and Dynamics", "paper_summary": "Recent advancements in video autoencoders (Video AEs) have significantly\nimproved the quality and efficiency of video generation. In this paper, we\npropose a novel and compact video autoencoder, VidTwin, that decouples video\ninto two distinct latent spaces: Structure latent vectors, which capture\noverall content and global movement, and Dynamics latent vectors, which\nrepresent fine-grained details and rapid movements. Specifically, our approach\nleverages an Encoder-Decoder backbone, augmented with two submodules for\nextracting these latent spaces, respectively. The first submodule employs a\nQ-Former to extract low-frequency motion trends, followed by downsampling\nblocks to remove redundant content details. The second averages the latent\nvectors along the spatial dimension to capture rapid motion. Extensive\nexperiments show that VidTwin achieves a high compression rate of 0.20% with\nhigh reconstruction quality (PSNR of 28.14 on the MCL-JCV dataset), and\nperforms efficiently and effectively in downstream generative tasks. Moreover,\nour model demonstrates explainability and scalability, paving the way for\nfuture research in video latent representation and generation. Our code has\nbeen released at https://github.com/microsoft/VidTok/tree/main/vidtwin.", "paper_summary_zh": "最近影片自動編碼器 (影片 AE) 的進步大幅提升了影片生成的品質和效率。在本文中，我們提出一個新穎且精簡的影片自動編碼器 VidTwin，它將影片解耦成兩個不同的潛在空間：結構潛在向量，用於擷取整體內容和全局動作；以及動態潛在向量，用於表示細微的細節和快速動作。具體來說，我們的做法利用一個編碼器-解碼器主幹，並擴充兩個子模組來分別萃取這些潛在空間。第一個子模組採用 Q-Former 來萃取低頻率動作趨勢，接著是降採樣區塊以移除多餘的內容細節。第二個子模組沿著空間維度平均潛在向量以擷取快速動作。廣泛的實驗顯示，VidTwin 達到 0.20% 的高壓縮率，且重建品質很高（在 MCL-JCV 資料集上 PSNR 為 28.14），而且在下游生成任務中表現得有效率且有效。此外，我們的模型展現了解釋性和可擴充性，為未來的影片潛在表示和生成研究鋪路。我們的程式碼已在 https://github.com/microsoft/VidTok/tree/main/vidtwin 發布。", "author": "Yuchi Wang et.al.", "authors": "Yuchi Wang, Junliang Guo, Xinyi Xie, Tianyu He, Xu Sun, Jiang Bian", "id": "2412.17726v1", "paper_url": "http://arxiv.org/abs/2412.17726v1", "repo": "https://github.com/microsoft/vidtok"}}