{"2503.15737": {"publish_time": "2025-03-19", "title": "KoGNER: A Novel Framework for Knowledge Graph Distillation on Biomedical Named Entity Recognition", "paper_summary": "Named Entity Recognition (NER) is a fundamental task in Natural Language\nProcessing (NLP) that plays a crucial role in information extraction, question\nanswering, and knowledge-based systems. Traditional deep learning-based NER\nmodels often struggle with domain-specific generalization and suffer from data\nsparsity issues. In this work, we introduce Knowledge Graph distilled for Named\nEntity Recognition (KoGNER), a novel approach that integrates Knowledge Graph\n(KG) distillation into NER models to enhance entity recognition performance.\nOur framework leverages structured knowledge representations from KGs to enrich\ncontextual embeddings, thereby improving entity classification and reducing\nambiguity in entity detection. KoGNER employs a two-step process: (1) Knowledge\nDistillation, where external knowledge sources are distilled into a lightweight\nrepresentation for seamless integration with NER models, and (2) Entity-Aware\nAugmentation, which integrates contextual embeddings that have been enriched\nwith knowledge graph information directly into GNN, thereby improving the\nmodel's ability to understand and represent entity relationships. Experimental\nresults on benchmark datasets demonstrate that KoGNER achieves state-of-the-art\nperformance, outperforming finetuned NER models and LLMs by a significant\nmargin. These findings suggest that leveraging knowledge graphs as auxiliary\ninformation can significantly improve NER accuracy, making KoGNER a promising\ndirection for future research in knowledge-aware NLP.", "paper_summary_zh": "<paragraph>命名實體識別 (NER) 是自然語言處理 (NLP) 中的一項基本任務，它在資訊提取、問答系統和知識庫系統中扮演著至關重要的角色。傳統的基於深度學習的 NER 模型通常難以泛化到特定領域，並且會受到資料稀疏問題的困擾。在這項工作中，我們介紹了用於命名實體識別的知識圖譜蒸餾 (KoGNER)，這是一種將知識圖譜 (KG) 蒸餾整合到 NER 模型中的新方法，以提高實體識別效能。我們的框架利用來自知識圖譜的結構化知識表示來豐富上下文嵌入，從而改進實體分類並減少實體檢測中的歧義。KoGNER 採用兩步流程：(1) 知識蒸餾，將外部知識源蒸餾成輕量級表示，以便與 NER 模型無縫整合；(2) 實體感知增強，將富含知識圖譜資訊的上下文嵌入直接整合到 GNN 中，從而提高模型理解和表示實體關係的能力。在基準資料集上的實驗結果表明，KoGNER 達到了最先進的效能，明顯優於微調的 NER 模型和 LLMs。這些發現表明，利用知識圖譜作為輔助資訊可以顯著提高 NER 的準確性，使 KoGNER 成為未來知識感知 NLP 研究的一個有希望的方向。\n</paragraph>\n", "author": "Heming Zhang et.al.", "authors": "Heming Zhang, Wenyu Li, Di Huang, Yinjie Tang, Yixin Chen, Philip Payne, Fuhai Li", "id": "2503.15737v1", "paper_url": "http://arxiv.org/abs/2503.15737v1", "repo": "null"}}