{"2407.00764": {"publish_time": "2024-06-30", "title": "Characterizing Stereotypical Bias from Privacy-preserving Pre-Training", "paper_summary": "Differential Privacy (DP) can be applied to raw text by exploiting the\nspatial arrangement of words in an embedding space. We investigate the\nimplications of such text privatization on Language Models (LMs) and their\ntendency towards stereotypical associations. Since previous studies documented\nthat linguistic proficiency correlates with stereotypical bias, one could\nassume that techniques for text privatization, which are known to degrade\nlanguage modeling capabilities, would cancel out undesirable biases. By testing\nBERT models trained on texts containing biased statements primed with varying\ndegrees of privacy, our study reveals that while stereotypical bias generally\ndiminishes when privacy is tightened, text privatization does not uniformly\nequate to diminishing bias across all social domains. This highlights the need\nfor careful diagnosis of bias in LMs that undergo text privatization.", "paper_summary_zh": "差分隱私 (DP) 可透過利用嵌入空間中字詞的空間排列來應用於原始文字。我們探討這種文字私有化對語言模型 (LM) 及其對刻板印象關聯的傾向所造成的影響。由於先前的研究記錄語言能力與刻板印象偏誤相關，因此可以假設已知會降低語言建模能力的文字私有化技術會消除不良偏誤。透過測試在包含以不同程度隱私為前提的偏見陳述的文字上訓練的 BERT 模型，我們的研究顯示，雖然在加強隱私時刻板印象偏誤通常會減少，但文字私有化並非在所有社會領域都等於減少偏誤。這突顯了在經過文字私有化的 LM 中仔細診斷偏誤的必要性。", "author": "Stefan Arnold et.al.", "authors": "Stefan Arnold, Rene Gröbner, Annika Schreiner", "id": "2407.00764v1", "paper_url": "http://arxiv.org/abs/2407.00764v1", "repo": "null"}}