{"2502.14561": {"publish_time": "2025-02-20", "title": "Can LLMs Predict Citation Intent? An Experimental Analysis of In-context Learning and Fine-tuning on Open LLMs", "paper_summary": "This work investigates the ability of open Large Language Models (LLMs) to\npredict citation intent through in-context learning and fine-tuning. Unlike\ntraditional approaches that rely on pre-trained models like SciBERT, which\nrequire extensive domain-specific pretraining and specialized architectures, we\ndemonstrate that general-purpose LLMs can be adapted to this task with minimal\ntask-specific data. We evaluate twelve model variations across five prominent\nopen LLM families using zero, one, few, and many-shot prompting to assess\nperformance across scenarios. Our experimental study identifies the\ntop-performing model through extensive experimentation of in-context\nlearning-related parameters, which we fine-tune to further enhance task\nperformance. The results highlight the strengths and limitations of LLMs in\nrecognizing citation intents, providing valuable insights for model selection\nand prompt engineering. Additionally, we make our end-to-end evaluation\nframework and models openly available for future use.", "paper_summary_zh": "本研究探討開放式大型語言模型 (LLM) 透過情境學習和微調來預測引文意圖的能力。與依賴於預訓練模型（例如 SciBERT）的傳統方法不同，後者需要廣泛的特定領域預訓練和專業架構，我們證明了通用 LLM 可以使用最少的特定任務數據來適應此任務。我們使用零次、一次、少次和多次提示評估五個著名的開放式 LLM 家族中的十二個模型變體，以評估不同場景的效能。我們的實驗研究透過廣泛的實驗來識別情境學習相關參數中效能最佳的模型，我們微調這些參數以進一步增強任務效能。結果突顯了 LLM 在識別引文意圖方面的優點和限制，為模型選擇和提示工程提供了有價值的見解。此外，我們將端到端評估架構和模型公開供未來使用。", "author": "Paris Koloveas et.al.", "authors": "Paris Koloveas, Serafeim Chatzopoulos, Thanasis Vergoulis, Christos Tryfonopoulos", "id": "2502.14561v1", "paper_url": "http://arxiv.org/abs/2502.14561v1", "repo": "null"}}