{"2408.02547": {"publish_time": "2024-08-05", "title": "The Role of Functional Muscle Networks in Improving Hand Gesture Perception for Human-Machine Interfaces", "paper_summary": "Developing accurate hand gesture perception models is critical for various\nrobotic applications, enabling effective communication between humans and\nmachines and directly impacting neurorobotics and interactive robots. Recently,\nsurface electromyography (sEMG) has been explored for its rich informational\ncontext and accessibility when combined with advanced machine learning\napproaches and wearable systems. The literature presents numerous approaches to\nboost performance while ensuring robustness for neurorobots using sEMG, often\nresulting in models requiring high processing power, large datasets, and less\nscalable solutions. This paper addresses this challenge by proposing the\ndecoding of muscle synchronization rather than individual muscle activation. We\nstudy coherence-based functional muscle networks as the core of our perception\nmodel, proposing that functional synchronization between muscles and the\ngraph-based network of muscle connectivity encode contextual information about\nintended hand gestures. This can be decoded using shallow machine learning\napproaches without the need for deep temporal networks. Our technique could\nimpact myoelectric control of neurorobots by reducing computational burdens and\nenhancing efficiency. The approach is benchmarked on the Ninapro database,\nwhich contains 12 EMG signals from 40 subjects performing 17 hand gestures. It\nachieves an accuracy of 85.1%, demonstrating improved performance compared to\nexisting methods while requiring much less computational power. The results\nsupport the hypothesis that a coherence-based functional muscle network encodes\ncritical information related to gesture execution, significantly enhancing hand\ngesture perception with potential applications for neurorobotic systems and\ninteractive machines.", "paper_summary_zh": "開發準確的手部手勢感知模型對於各種機器人應用至關重要，能讓人類與機器之間有效溝通，並直接影響神經機器人和互動式機器人。最近，表面肌電圖 (sEMG) 已被探索其豐富的資訊脈絡和可及性，並與先進的機器學習方法和可穿戴系統結合使用。文獻提出了許多方法來提升效能，同時確保使用 sEMG 的神經機器人的穩健性，通常會產生需要高處理能力、大型資料集和較不具擴充性的解決方案。本文透過提出解碼肌肉同步化，而非個別肌肉活化，來解決此挑戰。我們研究基於相干性的功能性肌肉網路，作為我們感知模型的核心，提出肌肉之間的功能性同步化和基於圖形的肌肉連接網路編碼有關預期手部手勢的背景資訊。這可以使用淺層機器學習方法解碼，而不需要深度時間網路。我們的技術可以透過減少運算負擔和提高效率，影響神經機器人的肌電控制。此方法以 Ninapro 資料庫為基準，其中包含來自 40 位受試者執行 17 種手部手勢的 12 個 EMG 訊號。它達到了 85.1% 的準確度，與現有方法相比，表現有所提升，同時需要的運算能力也少了很多。結果支持了基於相干性的功能性肌肉網路編碼與手勢執行相關的重要資訊的假設，顯著增強了手部手勢感知，並具有神經機器人系統和互動式機器人的潛在應用。", "author": "Costanza Armanini et.al.", "authors": "Costanza Armanini, Tuka Alhanai, Farah E. Shamout, S. Farokh Atashzar", "id": "2408.02547v1", "paper_url": "http://arxiv.org/abs/2408.02547v1", "repo": "null"}}