{"2412.06435": {"publish_time": "2024-12-09", "title": "Simulating Human-like Daily Activities with Desire-driven Autonomy", "paper_summary": "Existing task-oriented AI agents often depend on explicit instructions or\nexternal rewards, limiting their ability to be driven by intrinsic motivations\nlike humans. In this paper, we present a desire-driven autonomy framework to\nguide a Large Language Model-based (LLM-based) agent to simulate human-like\ndaily activities. In contrast to previous agents, our Desire-driven Autonomous\nAgent (D2A) operates on the principle of intrinsic desire, allowing it to\npropose and select tasks that fulfill its motivational framework autonomously.\nInspired by the Theory of Needs, the motivational framework incorporates an\nunderstanding of human-like desires, such as the need for social interaction,\npersonal fulfillment, and self-care. Utilizing a desire-driven task generation\nmechanism, the agent evaluates its current state and takes a sequence of\nactivities aligned with its intrinsic motivations. Through simulations, we\ndemonstrate that our Desire-driven Autonomous Agent (D2A) generates coherent,\ncontextually relevant daily activities while exhibiting variability and\nadaptability similar to human behavior. A comparative analysis with other\nLLM-based frameworks demonstrates that our approach significantly enhances the\nrationality of the simulated activities.", "paper_summary_zh": "現有的任務導向 AI 代理通常依賴明確的指示或外部獎勵，這限制了它們像人類一樣由內在動機驅動的能力。在本文中，我們提出了一個慾望驅動的自主框架，以指導基於大型語言模型 (LLM) 的代理模擬類人的日常活動。與之前的代理不同，我們的慾望驅動自主代理 (D2A) 遵循內在慾望的原則，允許它自主提出和選擇符合其動機框架的任務。受需求理論的啟發，動機框架包含對類人慾望的理解，例如社會互動、個人滿足和自我保健的需要。利用慾望驅動任務生成機制，代理評估其當前狀態並採取一系列與其內在動機一致的活動。通過模擬，我們證明了我們的慾望驅動自主代理 (D2A) 產生了連貫、與上下文相關的日常活動，同時表現出與人類行為相似的可變性和適應性。與其他基於 LLM 的框架進行比較分析表明，我們的做法顯著提高了模擬活動的合理性。", "author": "Yiding Wang et.al.", "authors": "Yiding Wang, Yuxuan Chen, Fangwei Zhong, Long Ma, Yizhou Wang", "id": "2412.06435v1", "paper_url": "http://arxiv.org/abs/2412.06435v1", "repo": "null"}}