{"2405.15110": {"publish_time": "2024-05-24", "title": "CHARP: Conversation History AwaReness Probing for Knowledge-grounded Dialogue Systems", "paper_summary": "In this work, we dive deep into one of the popular knowledge-grounded\ndialogue benchmarks that focus on faithfulness, FaithDial. We show that a\nsignificant portion of the FaithDial data contains annotation artifacts, which\nmay bias models towards completely ignoring the conversation history. We\ntherefore introduce CHARP, a diagnostic test set, designed for an improved\nevaluation of hallucinations in conversational model. CHARP not only measures\nhallucination but also the compliance of the models to the conversation task.\nOur extensive analysis reveals that models primarily exhibit poor performance\non CHARP due to their inability to effectively attend to and reason over the\nconversation history. Furthermore, the evaluation methods of FaithDial fail to\ncapture these shortcomings, neglecting the conversational history. Our findings\nindicate that there is substantial room for contribution in both dataset\ncreation and hallucination evaluation for knowledge-grounded dialogue, and that\nCHARP can serve as a tool for monitoring the progress in this particular\nresearch area. CHARP is publicly available at\nhttps://huggingface.co/datasets/huawei-noah/CHARP", "paper_summary_zh": "在這項工作中，我們深入探討了專注於忠實度的熱門知識基礎對話基準之一 FaithDial。我們展示了 FaithDial 資料的很大一部分包含註釋人工製品，這可能會使模型完全忽略對話記錄。因此，我們引入了 CHARP，一個診斷測試集，旨在改進對話模型中幻覺的評估。CHARP 不僅衡量幻覺，還衡量模型對對話任務的遵守程度。我們的廣泛分析表明，模型主要在 CHARP 上表現不佳，原因是它們無法有效地關注和推理對話記錄。此外，FaithDial 的評估方法未能捕捉到這些缺點，忽視了對話記錄。我們的研究結果表明，在知識基礎對話的資料集建立和幻覺評估方面都有很大的貢獻空間，而且 CHARP 可以作為監控這個特定研究領域進展的工具。CHARP 在 https://huggingface.co/datasets/huawei-noah/CHARP 公開提供", "author": "Abbas Ghaddar et.al.", "authors": "Abbas Ghaddar, David Alfonso-Hermelo, Philippe Langlais, Mehdi Rezagholizadeh, Boxing Chen, Prasanna Parthasarathi", "id": "2405.15110v1", "paper_url": "http://arxiv.org/abs/2405.15110v1", "repo": "null"}}