{"2412.13765": {"publish_time": "2024-12-18", "title": "LLM-SEM: A Sentiment-Based Student Engagement Metric Using LLMS for E-Learning Platforms", "paper_summary": "Current methods for analyzing student engagement in e-learning platforms,\nincluding automated systems, often struggle with challenges such as handling\nfuzzy sentiment in text comments and relying on limited metadata. Traditional\napproaches, such as surveys and questionnaires, also face issues like small\nsample sizes and scalability. In this paper, we introduce LLM-SEM (Language\nModel-Based Student Engagement Metric), a novel approach that leverages video\nmetadata and sentiment analysis of student comments to measure engagement. By\nutilizing recent Large Language Models (LLMs), we generate high-quality\nsentiment predictions to mitigate text fuzziness and normalize key features\nsuch as views and likes. Our holistic method combines comprehensive metadata\nwith sentiment polarity scores to gauge engagement at both the course and\nlesson levels. Extensive experiments were conducted to evaluate various LLM\nmodels, demonstrating the effectiveness of LLM-SEM in providing a scalable and\naccurate measure of student engagement. We fine-tuned LLMs, including AraBERT,\nTXLM-RoBERTa, LLama 3B and Gemma 9B from Ollama, using human-annotated\nsentiment datasets to enhance prediction accuracy.", "paper_summary_zh": "目前用於分析學生在電子學習平台中參與度的現有方法，包括自動化系統，通常會在處理文字評論中的模糊情感和依賴有限元資料時面臨挑戰。傳統方法，例如調查和問卷，也面臨樣本量小和可擴充性等問題。在本文中，我們介紹了 LLM-SEM（基於語言模型的學生參與度量數），這是一種新方法，它利用影片元資料和學生評論的情感分析來衡量參與度。通過利用最近的大語言模型 (LLM)，我們產生了高品質的情感預測，以減輕文字模糊性並標準化觀看次數和按讚數等關鍵功能。我們的整體方法結合了全面的元資料和情緒極性分數，以評估課程和課程層級的參與度。我們進行了大量實驗來評估各種 LLM 模型，證明了 LLM-SEM 在提供可擴充且準確的學生參與度測量方面的有效性。我們微調了 LLM，包括 AraBERT、TXLM-RoBERTa、來自 Ollama 的 LLama 3B 和 Gemma 9B，使用人工標記的情感資料集來提高預測準確度。", "author": "Ali Hamdi et.al.", "authors": "Ali Hamdi, Ahmed Abdelmoneim Mazrou, Mohamed Shaltout", "id": "2412.13765v1", "paper_url": "http://arxiv.org/abs/2412.13765v1", "repo": "null"}}