{"2404.17912": {"publish_time": "2024-04-27", "title": "SERPENT-VLM : Self-Refining Radiology Report Generation Using Vision Language Models", "paper_summary": "Radiology Report Generation (R2Gen) demonstrates how Multi-modal Large\nLanguage Models (MLLMs) can automate the creation of accurate and coherent\nradiological reports. Existing methods often hallucinate details in text-based\nreports that don't accurately reflect the image content. To mitigate this, we\nintroduce a novel strategy, SERPENT-VLM (SElf Refining Radiology RePort\nGENeraTion using Vision Language Models), which improves the R2Gen task by\nintegrating a self-refining mechanism into the MLLM framework. We employ a\nunique self-supervised loss that leverages similarity between pooled image\nrepresentations and the contextual representations of the generated\nradiological text, alongside the standard Causal Language Modeling objective,\nto refine image-text representations. This allows the model to scrutinize and\nalign the generated text through dynamic interaction between a given image and\nthe generated text, therefore reducing hallucination and continuously enhancing\nnuanced report generation. SERPENT-VLM outperforms existing baselines such as\nLLaVA-Med, BiomedGPT, etc., achieving SoTA performance on the IU X-ray and\nRadiology Objects in COntext (ROCO) datasets, and also proves to be robust\nagainst noisy images. A qualitative case study emphasizes the significant\nadvancements towards more sophisticated MLLM frameworks for R2Gen, opening\npaths for further research into self-supervised refinement in the medical\nimaging domain.", "paper_summary_zh": "放射學報告生成 (R2Gen) 展示了多模態大型語言模型 (MLLM) 如何自動化準確且連貫的放射學報告的建立。現有方法通常會在基於文字的報告中產生幻覺細節，這些細節無法準確反映影像內容。為了減輕此問題，我們引入了一種新策略，SERPENT-VLM (使用視覺語言模型的自我精煉放射報告生成)，它透過將自我精煉機制整合到 MLLM 框架中來改善 R2Gen 任務。我們採用一種獨特的自我監督損失，它利用池化影像表示與產生的放射學文字的脈絡表示之間的相似性，以及標準因果語言建模目標，來精煉影像文字表示。這允許模型透過給定影像與產生的文字之間的動態互動來審查和比對產生的文字，因此減少了幻覺並持續增強細緻的報告生成。SERPENT-VLM 優於現有的基準，例如 LLaVA-Med、BiomedGPT 等，在 IU X 光和脈絡中的放射學物件 (ROCO) 資料集上實現了 SoTA 效能，並且證明對雜訊影像具有魯棒性。定性案例研究強調了朝向更精密的 MLLM 框架邁出的重大進展，為進一步研究醫學影像領域中的自我監督精煉開啟了道路。", "author": "Manav Nitin Kapadnis et.al.", "authors": "Manav Nitin Kapadnis, Sohan Patnaik, Abhilash Nandy, Sourjyadip Ray, Pawan Goyal, Debdoot Sheet", "id": "2404.17912v1", "paper_url": "http://arxiv.org/abs/2404.17912v1", "repo": "null"}}