{"2412.17759": {"publish_time": "2024-12-23", "title": "Survey of Large Multimodal Model Datasets, Application Categories and Taxonomy", "paper_summary": "Multimodal learning, a rapidly evolving field in artificial intelligence,\nseeks to construct more versatile and robust systems by integrating and\nanalyzing diverse types of data, including text, images, audio, and video.\nInspired by the human ability to assimilate information through many senses,\nthis method enables applications such as text-to-video conversion, visual\nquestion answering, and image captioning. Recent developments in datasets that\nsupport multimodal language models (MLLMs) are highlighted in this overview.\nLarge-scale multimodal datasets are essential because they allow for thorough\ntesting and training of these models. With an emphasis on their contributions\nto the discipline, the study examines a variety of datasets, including those\nfor training, domain-specific tasks, and real-world applications. It also\nemphasizes how crucial benchmark datasets are for assessing models' performance\nin a range of scenarios, scalability, and applicability. Since multimodal\nlearning is always changing, overcoming these obstacles will help AI research\nand applications reach new heights.", "paper_summary_zh": "多模态学习是人工智能领域中快速发展的领域，\n它通过整合和分析包括文本、图像、音频和视频在内的多种类型的数据，\n旨在构建更多功能强大且健壮的系统。\n受人类通过多种感官吸收信息的能力的启发，\n这种方法支持文本转视频转换、视觉问答和图像标题等应用程序。\n本文重点介绍了支持多模态语言模型 (MLLM) 的数据集的最新发展。\n大规模多模态数据集至关重要，因为它们允许对这些模型进行彻底的测试和训练。\n本研究重点介绍了它们对该学科的贡献，考察了各种数据集，包括用于训练、特定领域的任务和实际应用程序的数据集。\n它还强调了基准数据集对于评估模型在各种场景、可扩展性和适用性中的性能至关重要。\n由于多模态学习总是在变化，克服这些障碍将有助于人工智能研究和应用达到新的高度。", "author": "Priyaranjan Pattnayak et.al.", "authors": "Priyaranjan Pattnayak, Hitesh Laxmichand Patel, Bhargava Kumar, Amit Agarwal, Ishan Banerjee, Srikant Panda, Tejaswini Kumar", "id": "2412.17759v1", "paper_url": "http://arxiv.org/abs/2412.17759v1", "repo": "null"}}