{"2405.19053": {"publish_time": "2024-05-29", "title": "Multiscale Spatio-Temporal Enhanced Short-term Load Forecasting of Electric Vehicle Charging Stations", "paper_summary": "The rapid expansion of electric vehicles (EVs) has rendered the load\nforecasting of electric vehicle charging stations (EVCS) increasingly critical.\nThe primary challenge in achieving precise load forecasting for EVCS lies in\naccounting for the nonlinear of charging behaviors, the spatial interactions\namong different stations, and the intricate temporal variations in usage\npatterns. To address these challenges, we propose a Multiscale Spatio-Temporal\nEnhanced Model (MSTEM) for effective load forecasting at EVCS. MSTEM\nincorporates a multiscale graph neural network to discern hierarchical\nnonlinear temporal dependencies across various time scales. Besides, it also\nintegrates a recurrent learning component and a residual fusion mechanism,\nenhancing its capability to accurately capture spatial and temporal variations\nin charging patterns. The effectiveness of the proposed MSTEM has been\nvalidated through comparative analysis with six baseline models using three\nevaluation metrics. The case studies utilize real-world datasets for both fast\nand slow charging loads at EVCS in Perth, UK. The experimental results\ndemonstrate the superiority of MSTEM in short-term continuous load forecasting\nfor EVCS.", "paper_summary_zh": "電動車（EV）的快速擴張，使得電動車充電站（EVCS）的負載預測變得越來越重要。\n對於 EVCS 進行精準負載預測的主要挑戰在於考量充電行為的非線性、不同站點之間的空間交互作用，以及使用模式中複雜的時間變化。\n為了應對這些挑戰，我們提出了一個多尺度時空增強模型（MSTEM），用於在 EVCS 進行有效的負載預測。\nMSTEM 結合了一個多尺度圖形神經網路，以辨別不同時間尺度上的階層式非線性時間依賴性。\n此外，它還整合了一個遞迴學習組成部分和一個殘差融合機制，增強其準確捕捉充電模式中空間和時間變化的能力。\n所提出的 MSTEM 的有效性已通過使用三個評估指標與六個基準模型進行比較分析得到驗證。\n案例研究利用了英國伯斯的 EVCS 中快速和慢速充電負載的真實世界資料集。\n實驗結果證明了 MSTEM 在 EVCS 的短期連續負載預測中的優越性。", "author": "Zongbao Zhang et.al.", "authors": "Zongbao Zhang, Jiao Hao, Wenmeng Zhao, Yan Liu, Yaohui Huang, Xinhang Luo", "id": "2405.19053v1", "paper_url": "http://arxiv.org/abs/2405.19053v1", "repo": "null"}}