{"2405.10474": {"publish_time": "2024-05-17", "title": "Rethinking ChatGPT's Success: Usability and Cognitive Behaviors Enabled by Auto-regressive LLMs' Prompting", "paper_summary": "Over the last decade, a wide range of training and deployment strategies for\nLarge Language Models (LLMs) have emerged. Among these, the prompting paradigms\nof Auto-regressive LLMs (AR-LLMs) have catalyzed a significant surge in\nArtificial Intelligence (AI). This paper aims to emphasize the significance of\nutilizing free-form modalities (forms of input and output) and verbal free-form\ncontexts as user-directed channels (methods for transforming modalities) for\ndownstream deployment. Specifically, we analyze the structure of modalities\nwithin both two types of LLMs and six task-specific channels during deployment.\nFrom the perspective of users, our analysis introduces and applies the\nanalytical metrics of task customizability, transparency, and complexity to\ngauge their usability, highlighting the superior nature of AR-LLMs' prompting\nparadigms. Moreover, we examine the stimulation of diverse cognitive behaviors\nin LLMs through the adoption of free-form text and verbal contexts, mirroring\nhuman linguistic expressions of such behaviors. We then detail four common\ncognitive behaviors to underscore how AR-LLMs' prompting successfully imitate\nhuman-like behaviors using this free-form modality and channel. Lastly, the\npotential for improving LLM deployment, both as autonomous agents and within\nmulti-agent systems, is identified via cognitive behavior concepts and\nprinciples.", "paper_summary_zh": "在過去十年中，出現了各種訓練和部署策略，用於大型語言模型 (LLM)。其中，自迴歸 LLM (AR-LLM) 的提示範例已催化了人工智慧 (AI) 的顯著激增。本文旨在強調利用自由形式模態（輸入和輸出形式）和口頭自由形式上下文作為使用者導向通道（轉換模態的方法）對於下游部署的重要性。具體來說，我們分析了在部署期間兩種 LLM 和六個特定任務通道中的模態結構。從使用者的角度來看，我們的分析引入了任務可自訂性、透明度和複雜性的分析指標，並應用這些指標來評估它們的可用性，突出了 AR-LLM 提示範例的優越性。此外，我們透過採用自由形式文字和口頭語境來檢視 LLM 中各種認知行為的刺激，反映出人類對此類行為的語言表達。然後，我們詳細說明四種常見的認知行為，以強調 AR-LLM 的提示如何成功地使用這種自由形式模態和通道來模仿類人行為。最後，透過認知行為概念和原則，確定了改善 LLM 部署的潛力，無論是作為自主代理還是多代理系統。", "author": "Xinzhe Li et.al.", "authors": "Xinzhe Li, Ming Liu", "id": "2405.10474v1", "paper_url": "http://arxiv.org/abs/2405.10474v1", "repo": "null"}}