{"2501.09929": {"publish_time": "2025-01-17", "title": "Steering Large Language Models with Feature Guided Activation Additions", "paper_summary": "Effective and reliable control over large language model (LLM) behavior is a\nsignificant challenge. While activation steering methods, which add steering\nvectors to a model's hidden states, are a promising approach, existing\ntechniques often lack precision and interpretability in how they influence\nmodel outputs. We introduce Feature Guided Activation Additions (FGAA), a novel\nactivation steering method that leverages insights from Contrastive Activation\nAddition (CAA) and Sparse Autoencoder-Targeted Steering (SAE-TS). By operating\nin the latent space of a Sparse Autoencoder (SAE) and employing optimization\ntechniques to select desired SAE features, FGAA constructs precise steering\nvectors that provide better steering effects while maintaining coherence of\nsteered model outputs. In this regard, evaluations on Gemma-2-2B and Gemma-2-9B\nmodels across various steering tasks demonstrate that FGAA outperforms existing\nsteering methods of CAA, SAE decoder steering, and SAE-TS. Our results also\nhighlight important trade-offs between steering scale and general model\ncapabilities that are consistent across all tested steering methods.", "paper_summary_zh": "有效且可靠地控制大型语言模型 (LLM) 行为是一项重大挑战。虽然激活转向方法（向模型的隐藏状态添加转向向量）是一种有前途的方法，但现有技术在如何影响模型输出方面往往缺乏精确性和可解释性。我们引入了特征引导激活加法 (FGAA)，这是一种新颖的激活转向方法，它利用了对比激活加法 (CAA) 和稀疏自编码器目标转向 (SAE-TS) 的见解。通过在稀疏自编码器 (SAE) 的潜在空间中操作并采用优化技术来选择所需的 SAE 特征，FGAA 构建了精确的转向向量，这些向量提供了更好的转向效果，同时保持了转向模型输出的一致性。在这方面，对 Gemma-2-2B 和 Gemma-2-9B 模型在各种转向任务中的评估表明，FGAA 优于现有的 CAA 转向方法、SAE 解码器转向和 SAE-TS。我们的结果还强调了所有测试转向方法中转向规模和一般模型能力之间重要的权衡。", "author": "Samuel Soo et.al.", "authors": "Samuel Soo, Wesley Teng, Chandrasekaran Balaganesh", "id": "2501.09929v1", "paper_url": "http://arxiv.org/abs/2501.09929v1", "repo": "null"}}