{"2409.18962": {"publish_time": "2024-09-27", "title": "Exploring Token Pruning in Vision State Space Models", "paper_summary": "State Space Models (SSMs) have the advantage of keeping linear computational\ncomplexity compared to attention modules in transformers, and have been applied\nto vision tasks as a new type of powerful vision foundation model. Inspired by\nthe observations that the final prediction in vision transformers (ViTs) is\nonly based on a subset of most informative tokens, we take the novel step of\nenhancing the efficiency of SSM-based vision models through token-based\npruning. However, direct applications of existing token pruning techniques\ndesigned for ViTs fail to deliver good performance, even with extensive\nfine-tuning. To address this issue, we revisit the unique computational\ncharacteristics of SSMs and discover that naive application disrupts the\nsequential token positions. This insight motivates us to design a novel and\ngeneral token pruning method specifically for SSM-based vision models. We first\nintroduce a pruning-aware hidden state alignment method to stabilize the\nneighborhood of remaining tokens for performance enhancement. Besides, based on\nour detailed analysis, we propose a token importance evaluation method adapted\nfor SSM models, to guide the token pruning. With efficient implementation and\npractical acceleration methods, our method brings actual speedup. Extensive\nexperiments demonstrate that our approach can achieve significant computation\nreduction with minimal impact on performance across different tasks. Notably,\nwe achieve 81.7\\% accuracy on ImageNet with a 41.6\\% reduction in the FLOPs for\npruned PlainMamba-L3. Furthermore, our work provides deeper insights into\nunderstanding the behavior of SSM-based vision models for future research.", "paper_summary_zh": "狀態空間模型 (SSM) 的優點在於與Transformer中的注意力模組相比，它能保持線性運算複雜度，且已應用於視覺任務作為一種新型強大的視覺基礎模型。受到視覺Transformer (ViT) 中的最終預測僅基於最有資訊的代幣子集的觀察啟發，我們採取創新的步驟，透過基於代幣的剪枝來提升基於 SSM 的視覺模型的效率。然而，即使經過廣泛的微調，直接應用為 ViT 設計的現有代幣剪枝技術也無法提供良好的效能。為了解決這個問題，我們重新檢視 SSM 的獨特運算特性，並發現天真的應用會中斷順序代幣位置。這個見解激勵我們專門為基於 SSM 的視覺模型設計一種新穎且通用的代幣剪枝方法。我們首先引入一種修剪感知的隱藏狀態對齊方法，以穩定剩餘代幣的鄰域，進而提升效能。此外，根據我們的詳細分析，我們提出了一種適用於 SSM 模型的代幣重要性評估方法，以指導代幣剪枝。透過有效率的實作和實用的加速方法，我們的技術帶來了實際的加速。廣泛的實驗證明，我們的作法可以在不同的任務中實現顯著的運算減少，同時對效能的影響很小。值得注意的是，我們在 ImageNet 上實現了 81.7% 的準確度，修剪後的 PlainMamba-L3 的 FLOP 減少了 41.6%。此外，我們的研究提供了更深入的見解，以了解基於 SSM 的視覺模型的行為，供未來的研究參考。", "author": "Zheng Zhan et.al.", "authors": "Zheng Zhan, Zhenglun Kong, Yifan Gong, Yushu Wu, Zichong Meng, Hangyu Zheng, Xuan Shen, Stratis Ioannidis, Wei Niu, Pu Zhao, Yanzhi Wang", "id": "2409.18962v1", "paper_url": "http://arxiv.org/abs/2409.18962v1", "repo": "null"}}