{"2412.02113": {"publish_time": "2024-12-03", "title": "Trust & Safety of LLMs and LLMs in Trust & Safety", "paper_summary": "In recent years, Large Language Models (LLMs) have garnered considerable\nattention for their remarkable abilities in natural language processing tasks.\nHowever, their widespread adoption has raised concerns pertaining to trust and\nsafety. This systematic review investigates the current research landscape on\ntrust and safety in LLMs, with a particular focus on the novel application of\nLLMs within the field of Trust and Safety itself. We delve into the\ncomplexities of utilizing LLMs in domains where maintaining trust and safety is\nparamount, offering a consolidated perspective on this emerging trend.\\\n  By synthesizing findings from various studies, we identify key challenges and\npotential solutions, aiming to benefit researchers and practitioners seeking to\nunderstand the nuanced interplay between LLMs and Trust and Safety.\n  This review provides insights on best practices for using LLMs in Trust and\nSafety, and explores emerging risks such as prompt injection and jailbreak\nattacks. Ultimately, this study contributes to a deeper understanding of how\nLLMs can be effectively and responsibly utilized to enhance trust and safety in\nthe digital realm.", "paper_summary_zh": "近年來，大型語言模型 (LLM) 因其在自然語言處理任務中的卓越能力而備受關注。然而，它們的廣泛採用引發了關於信任和安全的擔憂。這項系統性回顧調查了 LLM 中信任和安全方面的當前研究現況，特別關注 LLM 在信任和安全領域本身的新穎應用。我們深入探討在維護信任和安全至關重要的領域中利用 LLM 的複雜性，對這一新興趨勢提供了綜合觀點。\n通過綜合各種研究的發現，我們找出關鍵挑戰和潛在解決方案，旨在讓尋求了解 LLM 與信任和安全之間細微交互作用的研究人員和從業者受益。\n本回顧提供了在信任和安全中使用 LLM 的最佳實務見解，並探討了提示注入和越獄攻擊等新興風險。最終，這項研究有助於更深入地了解如何有效且負責任地利用 LLM 來增強數位領域的信任和安全。", "author": "Doohee You et.al.", "authors": "Doohee You, Dan Chon", "id": "2412.02113v1", "paper_url": "http://arxiv.org/abs/2412.02113v1", "repo": "null"}}