{"2501.02631": {"publish_time": "2025-01-05", "title": "Prune or Retrain: Optimizing the Vocabulary of Multilingual Models for Estonian", "paper_summary": "Adapting multilingual language models to specific languages can enhance both\ntheir efficiency and performance. In this study, we explore how modifying the\nvocabulary of a multilingual encoder model to better suit the Estonian language\naffects its downstream performance on the Named Entity Recognition (NER) task.\nThe motivations for adjusting the vocabulary are twofold: practical benefits\naffecting the computational cost, such as reducing the input sequence length\nand the model size, and performance enhancements by tailoring the vocabulary to\nthe particular language. We evaluate the effectiveness of two vocabulary\nadaptation approaches -- retraining the tokenizer and pruning unused tokens --\nand assess their impact on the model's performance, particularly after\ncontinual training. While retraining the tokenizer degraded the performance of\nthe NER task, suggesting that longer embedding tuning might be needed, we\nobserved no negative effects on pruning.", "paper_summary_zh": "調整多語言語言模型以適應特定語言，可以提升其效率和效能。在這項研究中，我們探討修改多語言編碼器模型的詞彙，以更好地適應愛沙尼亞語，如何影響其在命名實體辨識 (NER) 任務的下游效能。調整詞彙的動機有兩個：影響運算成本的實際效益，例如減少輸入序列長度和模型大小，以及透過調整詞彙以適應特定語言來提升效能。我們評估兩種詞彙調整方法的有效性——重新訓練標記器和修剪未使用的標記——並評估它們對模型效能的影響，特別是在持續訓練之後。儘管重新訓練標記器會降低 NER 任務的效能，表示可能需要更長的嵌入式調整，但我們觀察到修剪沒有負面影響。", "author": "Aleksei Dorkin et.al.", "authors": "Aleksei Dorkin, Taido Purason, Kairit Sirts", "id": "2501.02631v1", "paper_url": "http://arxiv.org/abs/2501.02631v1", "repo": "null"}}