{"2412.09843": {"publish_time": "2024-12-13", "title": "Learning Structural Causal Models from Ordering: Identifiable Flow Models", "paper_summary": "In this study, we address causal inference when only observational data and a\nvalid causal ordering from the causal graph are available. We introduce a set\nof flow models that can recover component-wise, invertible transformation of\nexogenous variables. Our flow-based methods offer flexible model design while\nmaintaining causal consistency regardless of the number of discretization\nsteps. We propose design improvements that enable simultaneous learning of all\ncausal mechanisms and reduce abduction and prediction complexity to linear O(n)\nrelative to the number of layers, independent of the number of causal\nvariables. Empirically, we demonstrate that our method outperforms previous\nstate-of-the-art approaches and delivers consistent performance across a wide\nrange of structural causal models in answering observational, interventional,\nand counterfactual questions. Additionally, our method achieves a significant\nreduction in computational time compared to existing diffusion-based\ntechniques, making it practical for large structural causal models.", "paper_summary_zh": "在這個研究中，我們在只有觀察資料和因果圖中有效的因果順序時，探討因果推論。我們介紹了一組流動模型，可以恢復外生變數的組成部分、可逆轉換。我們的基於流動的方法提供了靈活的模型設計，同時無論離散化步驟的數量如何，都能維持因果一致性。我們提出了設計改進，能夠同時學習所有因果機制，並將外推和預測複雜度降低為線性 O(n)，相對於層數，與因果變數的數量無關。根據經驗，我們證明了我們的方法優於先前的最先進方法，並且在回答觀察、介入和反事實問題時，在各種結構因果模型中提供了穩定的效能。此外，與現有的基於擴散的技術相比，我們的方法在計算時間上實現了顯著的減少，這使得它適用於大型結構因果模型。", "author": "Minh Khoa Le et.al.", "authors": "Minh Khoa Le, Kien Do, Truyen Tran", "id": "2412.09843v1", "paper_url": "http://arxiv.org/abs/2412.09843v1", "repo": "null"}}