{"2409.04073": {"publish_time": "2024-09-06", "title": "AnyMatch -- Efficient Zero-Shot Entity Matching with a Small Language Model", "paper_summary": "Entity matching (EM) is the problem of determining whether two records refer\nto same real-world entity, which is crucial in data integration, e.g., for\nproduct catalogs or address databases. A major drawback of many EM approaches\nis their dependence on labelled examples. We thus focus on the challenging\nsetting of zero-shot entity matching where no labelled examples are available\nfor an unseen target dataset. Recently, large language models (LLMs) have shown\npromising results for zero-shot EM, but their low throughput and high\ndeployment cost limit their applicability and scalability.\n  We revisit the zero-shot EM problem with AnyMatch, a small language model\nfine-tuned in a transfer learning setup. We propose several novel data\nselection techniques to generate fine-tuning data for our model, e.g., by\nselecting difficult pairs to match via an AutoML filter, by generating\nadditional attribute-level examples, and by controlling label imbalance in the\ndata.\n  We conduct an extensive evaluation of the prediction quality and deployment\ncost of our model, in a comparison to thirteen baselines on nine benchmark\ndatasets. We find that AnyMatch provides competitive prediction quality despite\nits small parameter size: it achieves the second-highest F1 score overall, and\noutperforms several other approaches that employ models with hundreds of\nbillions of parameters. Furthermore, our approach exhibits major cost benefits:\nthe average prediction quality of AnyMatch is within 4.4% of the\nstate-of-the-art method MatchGPT with the proprietary trillion-parameter model\nGPT-4, yet AnyMatch requires four orders of magnitude less parameters and\nincurs a 3,899 times lower inference cost (in dollars per 1,000 tokens).", "paper_summary_zh": "實體配對 (EM) 是個問題，在於決定兩筆記錄是否指涉同一個真實世界實體，這在資料整合中至關重要，例如產品目錄或地址資料庫。許多 EM 方法的一個主要缺點是它們依賴於標記範例。因此，我們專注於零次學習實體配對的挑戰性設定，其中沒有標記範例可供未見目標資料集使用。最近，大型語言模型 (LLM) 已顯示出零次學習 EM 的有希望結果，但它們的低處理量和高部署成本限制了它們的適用性和可擴充性。\n我們使用 AnyMatch 重新審視零次學習 EM 問題，AnyMatch 是在遷移學習設定中微調的小型語言模型。我們提出幾種新穎的資料選擇技術，為我們的模型產生微調資料，例如透過自動機器學習篩選器選擇難以配對的配對、產生額外的屬性層級範例，以及控制資料中的標籤不平衡。\n我們對我們的模型的預測品質和部署成本進行廣泛評估，並與九個基準資料集上的十三個基準進行比較。我們發現，儘管 AnyMatch 的參數規模小，但它提供了有競爭力的預測品質：它達到了第二高的 F1 分數，並且優於其他採用數百億個參數模型的方法。此外，我們的做法展現出主要的成本效益：AnyMatch 的平均預測品質在最先進的方法 MatchGPT 的 4.4% 範圍內，MatchGPT 使用專有的兆參數模型 GPT-4，但 AnyMatch 所需的參數少四個數量級，並且產生低 3,899 倍的推論成本（以每 1,000 個權杖為單位）。", "author": "Zeyu Zhang et.al.", "authors": "Zeyu Zhang, Paul Groth, Iacer Calixto, Sebastian Schelter", "id": "2409.04073v1", "paper_url": "http://arxiv.org/abs/2409.04073v1", "repo": "null"}}