{"2411.01663": {"publish_time": "2024-11-03", "title": "Unlocking the Theory Behind Scaling 1-Bit Neural Networks", "paper_summary": "Recently, 1-bit Large Language Models (LLMs) have emerged, showcasing an\nimpressive combination of efficiency and performance that rivals traditional\nLLMs. Research by Wang et al. (2023); Ma et al. (2024) indicates that the\nperformance of these 1-bit LLMs progressively improves as the number of\nparameters increases, hinting at the potential existence of a Scaling Law for\n1-bit Neural Networks. In this paper, we present the first theoretical result\nthat rigorously establishes this scaling law for 1-bit models. We prove that,\ndespite the constraint of weights restricted to $\\{-1, +1\\}$, the dynamics of\nmodel training inevitably align with kernel behavior as the network width\ngrows. This theoretical breakthrough guarantees convergence of the 1-bit model\nto an arbitrarily small loss as width increases. Furthermore, we introduce the\nconcept of the generalization difference, defined as the gap between the\noutputs of 1-bit networks and their full-precision counterparts, and\ndemonstrate that this difference maintains a negligible level as network width\nscales. Building on the work of Kaplan et al. (2020), we conclude by examining\nhow the training loss scales as a power-law function of the model size, dataset\nsize, and computational resources utilized for training. Our findings\nunderscore the promising potential of scaling 1-bit neural networks, suggesting\nthat int1 could become the standard in future neural network precision.", "paper_summary_zh": "<paragraph>最近，1 位大型語言模型 (LLM) 浮現，展示出令人印象深刻的效率和效能結合，可媲美傳統 LLM。王等人 (2023)；馬等人 (2024) 的研究指出，這些 1 位 LLM 的效能會隨著參數數量增加而逐步提升，暗示 1 位神經網路存在規模律的可能性。在本文中，我們提出第一個理論結果，嚴謹地建立 1 位模型的規模律。我們證明，儘管權重限制在 $\\{-1, +1\\}$ 的約束下，模型訓練的動態會隨著網路寬度增加而不可避免地與核心的行為一致。這個理論突破保證 1 位模型的收斂性，讓損失隨著寬度增加而任意地變小。此外，我們提出泛化差異的概念，定義為 1 位網路和它們的完全精確度對應物之間的輸出差距，並證明這個差異會隨著網路寬度規模而維持在可忽略的層級。建立在 Kaplan 等人 (2020) 的研究上，我們最後探討訓練損失如何以冪律函數的形式隨著模型大小、資料集大小和用於訓練的計算資源而規模化。我們的發現強調規模化 1 位神經網路的潛力，表明 int1 可能會成為未來神經網路精度的標準。</paragraph>", "author": "Majid Daliri et.al.", "authors": "Majid Daliri, Zhao Song, Chiwun Yang", "id": "2411.01663v1", "paper_url": "http://arxiv.org/abs/2411.01663v1", "repo": "null"}}