{"2502.01926": {"publish_time": "2025-02-04", "title": "Fairness through Difference Awareness: Measuring Desired Group Discrimination in LLMs", "paper_summary": "Algorithmic fairness has conventionally adopted a perspective of racial\ncolor-blindness (i.e., difference unaware treatment). We contend that in a\nrange of important settings, group difference awareness matters. For example,\ndifferentiating between groups may be necessary in legal contexts (e.g., the\nU.S. compulsory draft applies to men but not women) and harm assessments (e.g.,\ncalling a girl a terrorist may be less harmful than calling a Muslim person\none). In our work we first introduce an important distinction between\ndescriptive (fact-based), normative (value-based), and correlation\n(association-based) benchmarks. This distinction is significant because each\ncategory requires distinct interpretation and mitigation tailored to its\nspecific characteristics. Then, we present a benchmark suite composed of eight\ndifferent scenarios for a total of 16k questions that enables us to assess\ndifference awareness. Finally, we show results across ten models that\ndemonstrate difference awareness is a distinct dimension of fairness where\nexisting bias mitigation strategies may backfire.", "paper_summary_zh": "演算法公平性传统上采取种族色彩盲的观点（即差异无知对待）。我们认为，在许多重要的环境中，群体差异意识很重要。例如，在法律背景下区分群体可能是必要的（例如，美国的强制兵役适用于男性但不适用于女性）和伤害评估（例如，称一个女孩为恐怖分子可能比称一个穆斯林人伤害性更小）。在我们的工作中，我们首先介绍了描述性（基于事实）、规范性（基于价值）和相关性（基于关联）基准之间的重要区别。这种区别很重要，因为每种类别都需要针对其特定特征进行不同的解释和缓解。然后，我们提出了一个基准套件，其中包含八种不同的场景，总共 16k 个问题，使我们能够评估差异意识。最后，我们展示了十个模型的结果，这些模型表明差异意识是公平性的一个不同维度，其中现有的偏见缓解策略可能会适得其反。", "author": "Angelina Wang et.al.", "authors": "Angelina Wang, Michelle Phan, Daniel E. Ho, Sanmi Koyejo", "id": "2502.01926v1", "paper_url": "http://arxiv.org/abs/2502.01926v1", "repo": "null"}}