{"2410.08397": {"publish_time": "2024-10-10", "title": "VoxelPrompt: A Vision-Language Agent for Grounded Medical Image Analysis", "paper_summary": "We present VoxelPrompt, an agent-driven vision-language framework that\ntackles diverse radiological tasks through joint modeling of natural language,\nimage volumes, and analytical metrics. VoxelPrompt is multi-modal and\nversatile, leveraging the flexibility of language interaction while providing\nquantitatively grounded image analysis. Given a variable number of 3D medical\nvolumes, such as MRI and CT scans, VoxelPrompt employs a language agent that\niteratively predicts executable instructions to solve a task specified by an\ninput prompt. These instructions communicate with a vision network to encode\nimage features and generate volumetric outputs (e.g., segmentations).\nVoxelPrompt interprets the results of intermediate instructions and plans\nfurther actions to compute discrete measures (e.g., tumor growth across a\nseries of scans) and present relevant outputs to the user. We evaluate this\nframework in a sandbox of diverse neuroimaging tasks, and we show that the\nsingle VoxelPrompt model can delineate hundreds of anatomical and pathological\nfeatures, measure many complex morphological properties, and perform\nopen-language analysis of lesion characteristics. VoxelPrompt carries out these\nobjectives with accuracy similar to that of fine-tuned, single-task models for\nsegmentation and visual question-answering, while facilitating a much larger\nrange of tasks. Therefore, by supporting accurate image processing with\nlanguage interaction, VoxelPrompt provides comprehensive utility for numerous\nimaging tasks that traditionally require specialized models to address.", "paper_summary_zh": "<paragraph>我們提出 VoxelPrompt，一種由代理驅動的視覺語言框架，它透過自然語言、影像體積和分析指標的聯合建模，來處理多樣的放射學任務。VoxelPrompt 是多模態且多功能的，它利用語言互動的靈活性，同時提供量化基礎的影像分析。給定可變數量的 3D 醫學體積，例如 MRI 和 CT 掃描，VoxelPrompt 使用語言代理，反覆預測可執行指令，以解決由輸入提示指定的任務。這些指令與視覺網路溝通，以編碼影像特徵並產生體積輸出（例如，分割）。VoxelPrompt 解釋中間指令的結果，並規劃進一步的動作，以計算離散測量（例如，一系列掃描中的腫瘤生長），並向使用者提供相關輸出。我們在一個多樣化的神經影像任務沙盒中評估這個框架，我們表明單一的 VoxelPrompt 模型可以描述數百個解剖和病理特徵，測量許多複雜的形態屬性，並執行病灶特徵的開放語言分析。VoxelPrompt 執行這些目標的準確度與針對分割和視覺問答進行微調的單一任務模型類似，同時促進了更大的任務範圍。因此，透過支援使用語言互動的準確影像處理，VoxelPrompt 為傳統上需要專門模型來處理的眾多影像任務提供了全面的實用性。</paragraph>", "author": "Andrew Hoopes et.al.", "authors": "Andrew Hoopes, Victor Ion Butoi, John V. Guttag, Adrian V. Dalca", "id": "2410.08397v1", "paper_url": "http://arxiv.org/abs/2410.08397v1", "repo": "null"}}