{"2409.02617": {"publish_time": "2024-09-04", "title": "PUB: Plot Understanding Benchmark and Dataset for Evaluating Large Language Models on Synthetic Visual Data Interpretation", "paper_summary": "The ability of large language models (LLMs) to interpret visual\nrepresentations of data is crucial for advancing their application in data\nanalysis and decision-making processes. This paper presents a novel synthetic\ndataset designed to evaluate the proficiency of LLMs in interpreting various\nforms of data visualizations, including plots like time series, histograms,\nviolins, boxplots, and clusters. Our dataset is generated using controlled\nparameters to ensure comprehensive coverage of potential real-world scenarios.\nWe employ multimodal text prompts with questions related to visual data in\nimages to benchmark several state-of-the-art models like ChatGPT or Gemini,\nassessing their understanding and interpretative accuracy.\n  To ensure data integrity, our benchmark dataset is generated automatically,\nmaking it entirely new and free from prior exposure to the models being tested.\nThis strategy allows us to evaluate the models' ability to truly interpret and\nunderstand the data, eliminating possibility of pre-learned responses, and\nallowing for an unbiased evaluation of the models' capabilities. We also\nintroduce quantitative metrics to assess the performance of the models,\nproviding a robust and comprehensive evaluation tool.\n  Benchmarking several state-of-the-art LLMs with this dataset reveals varying\ndegrees of success, highlighting specific strengths and weaknesses in\ninterpreting diverse types of visual data. The results provide valuable\ninsights into the current capabilities of LLMs and identify key areas for\nimprovement. This work establishes a foundational benchmark for future research\nand development aimed at enhancing the visual interpretative abilities of\nlanguage models. In the future, improved LLMs with robust visual interpretation\nskills can significantly aid in automated data analysis, scientific research,\neducational tools, and business intelligence applications.", "paper_summary_zh": "大型語言模型 (LLM) 解釋資料視覺化呈現的能力對於提升其在資料分析和決策制定流程中的應用至關重要。本文提出一個新穎的合成資料集，旨在評估 LLM 解釋各種資料視覺化形式的能力，包括時序圖、直方圖、小提琴圖、箱型圖和群集等。我們的資料集是使用受控參數生成的，以確保全面涵蓋潛在的真實世界場景。我們採用多模態文字提示，其中包含與圖像中視覺資料相關的問題，以評量多個最先進的模型，例如 ChatGPT 或 Gemini，評估其理解力與詮釋準確性。\n為了確保資料完整性，我們的基準資料集是自動產生的，使其完全新穎且不受測試模型先前接觸的影響。此策略讓我們得以評估模型真正詮釋和理解資料的能力，消除了預先學習的回應的可能性，並能公正評估模型的能力。我們也引進量化指標來評估模型的效能，提供一個穩健且全面的評估工具。\n使用此資料集評量多個最先進的 LLM，揭示出不同程度的成功，突顯出詮釋不同類型視覺資料的特定優勢和劣勢。結果提供了寶貴的見解，了解 LLM 目前的能力，並找出關鍵的改進領域。這項工作為未來的研究和開發奠定了一個基礎基準，旨在提升語言模型的視覺詮釋能力。未來，具有強大視覺詮釋技能的改良 LLM 可以顯著協助自動化資料分析、科學研究、教育工具和商業智慧應用。", "author": "Aneta Pawelec et.al.", "authors": "Aneta Pawelec, Victoria Sara Wesołowska, Zuzanna Bączek, Piotr Sankowski", "id": "2409.02617v1", "paper_url": "http://arxiv.org/abs/2409.02617v1", "repo": "null"}}