{"2412.12800": {"publish_time": "2024-12-17", "title": "Breaking the Programming Language Barrier: Multilingual Prompting to Empower Non-Native English Learners", "paper_summary": "Non-native English speakers (NNES) face multiple barriers to learning\nprogramming. These barriers can be obvious, such as the fact that programming\nlanguage syntax and instruction are often in English, or more subtle, such as\nbeing afraid to ask for help in a classroom full of native English speakers.\nHowever, these barriers are frustrating because many NNES students know more\nabout programming than they can articulate in English. Advances in generative\nAI (GenAI) have the potential to break down these barriers because state of the\nart models can support interactions in multiple languages. Moreover, recent\nwork has shown that GenAI can be highly accurate at code generation and\nexplanation. In this paper, we provide the first exploration of NNES students\nprompting in their native languages (Arabic, Chinese, and Portuguese) to\ngenerate code to solve programming problems. Our results show that students are\nable to successfully use their native language to solve programming problems,\nbut not without some difficulty specifying programming terminology and\nconcepts. We discuss the challenges they faced, the implications for practice\nin the short term, and how this might transform computing education globally in\nthe long term.", "paper_summary_zh": "非母語英語人士 (NNES) 在學習程式設計時會遇到多重障礙。這些障礙可能是顯而易見的，例如程式語言的語法和指令通常都是英文，或較為隱晦的，例如害怕在充滿母語人士的教室中尋求協助。然而，這些障礙很令人沮喪，因為許多 NNES 學生對程式設計的了解遠超過他們用英文表達的能力。生成式 AI (GenAI) 的進步有潛力打破這些障礙，因為最先進的模型可以支援多種語言的互動。此外，最近的研究顯示，GenAI 在程式碼產生和說明方面可以非常精確。在本文中，我們首次探討 NNES 學生使用其母語 (阿拉伯語、中文和葡萄牙語) 來產生程式碼以解決程式設計問題。我們的結果顯示，學生能夠成功使用其母語來解決程式設計問題，但並非沒有在說明程式設計術語和概念時遇到一些困難。我們討論了他們所面臨的挑戰、對短期實務的影響，以及這如何從長遠來看轉變全球的電腦教育。", "author": "James Prather et.al.", "authors": "James Prather, Brent N. Reeves, Paul Denny, Juho Leinonen, Stephen MacNeil, Andrew Luxton-Reilly, João Orvalho, Amin Alipour, Ali Alfageeh, Thezyrie Amarouche, Bailey Kimmel, Jared Wright, Musa Blake, Gweneth Barbre", "id": "2412.12800v1", "paper_url": "http://arxiv.org/abs/2412.12800v1", "repo": "null"}}