{"2411.09389": {"publish_time": "2024-11-14", "title": "Less is More: Unseen Domain Fake News Detection via Causal Propagation Substructures", "paper_summary": "The spread of fake news on social media poses significant threats to\nindividuals and society. Text-based and graph-based models have been employed\nfor fake news detection by analysing news content and propagation networks,\nshowing promising results in specific scenarios. However, these data-driven\nmodels heavily rely on pre-existing in-distribution data for training, limiting\ntheir performance when confronted with fake news from emerging or previously\nunseen domains, known as out-of-distribution (OOD) data. Tackling OOD fake news\nis a challenging yet critical task. In this paper, we introduce the Causal\nSubgraph-oriented Domain Adaptive Fake News Detection (CSDA) model, designed to\nenhance zero-shot fake news detection by extracting causal substructures from\npropagation graphs using in-distribution data and generalising this approach to\nOOD data. The model employs a graph neural network based mask generation\nprocess to identify dominant nodes and edges within the propagation graph,\nusing these substructures for fake news detection. Additionally, the\nperformance of CSDA is further improved through contrastive learning in\nfew-shot scenarios, where a limited amount of OOD data is available for\ntraining. Extensive experiments on public social media datasets demonstrate\nthat CSDA effectively handles OOD fake news detection, achieving a 7 to 16\npercents accuracy improvement over other state-of-the-art models.", "paper_summary_zh": "社群媒體上假新聞的散布對個人和社會構成重大威脅。基於文字和圖形的模型已被用於假新聞偵測，方法是分析新聞內容和傳播網路，在特定場景中展現令人滿意的結果。然而，這些資料驅動的模型在訓練時極度仰賴現有的分佈內資料，當面對來自新興或先前未見領域（稱為分佈外 (OOD) 資料）的假新聞時，效能會受到限制。處理 OOD 假新聞是一項艱難但重要的任務。在本文中，我們介紹因果子圖導向的領域適應式假新聞偵測 (CSDA) 模型，旨在透過使用分佈內資料從傳播圖中萃取因果子結構，並將此方法推廣到 OOD 資料，來提升零次學習假新聞偵測。該模型採用基於圖形神經網路的遮罩產生程序，來識別傳播圖中主要的節點和邊緣，並使用這些子結構進行假新聞偵測。此外，CSDA 的效能透過在小樣本學習中進行對比學習進一步提升，在這種情況下，只有有限數量的 OOD 資料可用於訓練。在公開社群媒體資料集上的廣泛實驗證明，CSDA 能有效處理 OOD 假新聞偵測，比其他最先進的模型提高了 7% 到 16% 的準確率。", "author": "Shuzhi Gong et.al.", "authors": "Shuzhi Gong, Richard O. Sinnott, Jianzhong Qi, Cecile Paris", "id": "2411.09389v1", "paper_url": "http://arxiv.org/abs/2411.09389v1", "repo": "null"}}