{"2409.18071": {"publish_time": "2024-09-26", "title": "FreeEdit: Mask-free Reference-based Image Editing with Multi-modal Instruction", "paper_summary": "Introducing user-specified visual concepts in image editing is highly\npractical as these concepts convey the user's intent more precisely than\ntext-based descriptions. We propose FreeEdit, a novel approach for achieving\nsuch reference-based image editing, which can accurately reproduce the visual\nconcept from the reference image based on user-friendly language instructions.\nOur approach leverages the multi-modal instruction encoder to encode language\ninstructions to guide the editing process. This implicit way of locating the\nediting area eliminates the need for manual editing masks. To enhance the\nreconstruction of reference details, we introduce the Decoupled Residual\nReferAttention (DRRA) module. This module is designed to integrate fine-grained\nreference features extracted by a detail extractor into the image editing\nprocess in a residual way without interfering with the original self-attention.\nGiven that existing datasets are unsuitable for reference-based image editing\ntasks, particularly due to the difficulty in constructing image triplets that\ninclude a reference image, we curate a high-quality dataset, FreeBench, using a\nnewly developed twice-repainting scheme. FreeBench comprises the images before\nand after editing, detailed editing instructions, as well as a reference image\nthat maintains the identity of the edited object, encompassing tasks such as\nobject addition, replacement, and deletion. By conducting phased training on\nFreeBench followed by quality tuning, FreeEdit achieves high-quality zero-shot\nediting through convenient language instructions. We conduct extensive\nexperiments to evaluate the effectiveness of FreeEdit across multiple task\ntypes, demonstrating its superiority over existing methods. The code will be\navailable at: https://freeedit.github.io/.", "paper_summary_zh": "<paragraph>在图像编辑中引入用户指定的视觉概念非常实用，因为这些概念比基于文本的描述更准确地传达了用户的意图。我们提出了 FreeEdit，这是一种实现基于参考的图像编辑的新方法，它可以根据用户友好的语言指令准确地从参考图像中复制视觉概念。我们的方法利用多模态指令编码器对语言指令进行编码，以指导编辑过程。这种定位编辑区域的隐式方式消除了对手动编辑蒙版的需求。为了增强参考细节的重建，我们引入了解耦残差参考注意力 (DRRA) 模块。该模块旨在以残差方式将细节提取器提取的细粒度参考特征集成到图像编辑过程中，而不会干扰原始自注意力。鉴于现有数据集不适用于基于参考的图像编辑任务，特别是由于难以构建包含参考图像的图像三元组，我们使用新开发的二次重绘方案整理了一个高质量数据集 FreeBench。FreeBench 包含编辑前后的图像、详细的编辑说明，以及一个保持编辑对象身份的参考图像，包括对象添加、替换和删除等任务。通过在 FreeBench 上进行阶段性训练，然后进行质量调整，FreeEdit 通过便捷的语言指令实现了高质量的零样本编辑。我们进行了广泛的实验来评估 FreeEdit 在多种任务类型中的有效性，证明了它优于现有方法。代码将在以下位置提供：https://freeedit.github.io/。</paragraph>", "author": "Runze He et.al.", "authors": "Runze He, Kai Ma, Linjiang Huang, Shaofei Huang, Jialin Gao, Xiaoming Wei, Jiao Dai, Jizhong Han, Si Liu", "id": "2409.18071v1", "paper_url": "http://arxiv.org/abs/2409.18071v1", "repo": "null"}}