{"2410.07064": {"publish_time": "2024-10-09", "title": "Data Selection via Optimal Control for Language Models", "paper_summary": "This work investigates the selection of high-quality pre-training data from\nmassive corpora to enhance LMs' capabilities for downstream usage. We formulate\ndata selection as a generalized Optimal Control problem, which can be solved\ntheoretically by Pontryagin's Maximum Principle (PMP), yielding a set of\nnecessary conditions that characterize the relationship between optimal data\nselection and LM training dynamics. Based on these theoretical results, we\nintroduce PMP-based Data Selection (PDS), a framework that approximates optimal\ndata selection by solving the PMP conditions. In our experiments, we adopt PDS\nto select data from CommmonCrawl and show that the PDS-selected corpus\naccelerates the learning of LMs and constantly boosts their performance on a\nwide range of downstream tasks across various model sizes. Moreover, the\nbenefits of PDS extend to ~400B models trained on ~10T tokens, as evidenced by\nthe extrapolation of the test loss curves according to the Scaling Laws. PDS\nalso improves data utilization when the pre-training data is limited, by\nreducing the data demand by 1.8 times, which mitigates the quick exhaustion of\navailable web-crawled corpora. Our code, data, and model checkpoints can be\nfound in https://github.com/microsoft/LMOps/tree/main/data_selection.", "paper_summary_zh": "本研究探討從海量語料庫中選取高品質預訓練資料，以增強 LM 在下游使用時的效能。我們將資料選取制定為廣義最佳控制問題，此問題可用龐特里亞金最大值原理 (PMP) 在理論上解決，並產生一組必要條件，用於描述最佳資料選取與 LM 訓練動態之間的關係。根據這些理論結果，我們引入了基於 PMP 的資料選取 (PDS)，這是一個透過解決 PMP 條件來近似最佳資料選取的架構。在我們的實驗中，我們採用 PDS 從 CommonCrawl 中選取資料，並顯示 PDS 選取的語料庫加速了 LM 的學習，並持續提升其在各種模型大小中廣泛下游任務上的效能。此外，PDS 的優點延伸至根據擴充定律推算測試損失曲線所證實的，在約 10T 個 token 上訓練的約 400B 模型。當預訓練資料有限時，PDS 也能改善資料利用率，方法是將資料需求減少 1.8 倍，這減輕了可用網路爬取語料庫的快速耗盡。我們的程式碼、資料和模型檢查點可以在 https://github.com/microsoft/LMOps/tree/main/data_selection 中找到。", "author": "Yuxian Gu et.al.", "authors": "Yuxian Gu, Li Dong, Hongning Wang, Yaru Hao, Qingxiu Dong, Furu Wei, Minlie Huang", "id": "2410.07064v1", "paper_url": "http://arxiv.org/abs/2410.07064v1", "repo": "https://github.com/microsoft/lmops"}}