{"2408.01084": {"publish_time": "2024-08-02", "title": "Adaptive Contrastive Decoding in Retrieval-Augmented Generation for Handling Noisy Contexts", "paper_summary": "When using large language models (LLMs) in knowledge-intensive tasks, such as\nopen-domain question answering, external context can bridge a gap between\nexternal knowledge and LLM's parametric knowledge. Recent research has been\ndeveloped to amplify contextual knowledge over the parametric knowledge of LLM\nwith contrastive decoding approaches. While these approaches could yield\ntruthful responses when relevant context is provided, they are prone to\nvulnerabilities when faced with noisy contexts. We extend the scope of previous\nstudies to encompass noisy contexts and propose adaptive contrastive decoding\n(ACD) to leverage contextual influence effectively. ACD demonstrates\nimprovements in open-domain question answering tasks compared to baselines,\nespecially in robustness by remaining undistracted by noisy contexts in\nretrieval-augmented generation.", "paper_summary_zh": "在知識密集型任務中使用大型語言模型 (LLM) 時，例如開放領域問題解答，外部背景可以彌合外部知識與 LLM 參數知識之間的差距。最近的研究已開發為通過對比解碼方法來放大 LLM 的參數知識上的背景知識。雖然這些方法可以在提供相關背景時產生真實的回應，但它們在面對嘈雜的背景時容易出現漏洞。我們擴展了先前研究的範圍以涵蓋嘈雜的背景，並提出自適應對比解碼 (ACD) 以有效利用背景影響。與基準相比，ACD 在開放領域問題解答任務中展示了改進，特別是在通過在檢索增強生成中不受嘈雜背景影響而保持魯棒性方面。", "author": "Youna Kim et.al.", "authors": "Youna Kim, Hyuhng Joon Kim, Cheonbok Park, Choonghyun Park, Hyunsoo Cho, Junyeob Kim, Kang Min Yoo, Sang-goo Lee, Taeuk Kim", "id": "2408.01084v1", "paper_url": "http://arxiv.org/abs/2408.01084v1", "repo": "null"}}