{"2406.17902": {"publish_time": "2024-06-25", "title": "Domain Adaptation of Echocardiography Segmentation Via Reinforcement Learning", "paper_summary": "Performance of deep learning segmentation models is significantly challenged\nin its transferability across different medical imaging domains, particularly\nwhen aiming to adapt these models to a target domain with insufficient\nannotated data for effective fine-tuning. While existing domain adaptation (DA)\nmethods propose strategies to alleviate this problem, these methods do not\nexplicitly incorporate human-verified segmentation priors, compromising the\npotential of a model to produce anatomically plausible segmentations. We\nintroduce RL4Seg, an innovative reinforcement learning framework that reduces\nthe need to otherwise incorporate large expertly annotated datasets in the\ntarget domain, and eliminates the need for lengthy manual human review. Using a\ntarget dataset of 10,000 unannotated 2D echocardiographic images, RL4Seg not\nonly outperforms existing state-of-the-art DA methods in accuracy but also\nachieves 99% anatomical validity on a subset of 220 expert-validated subjects\nfrom the target domain. Furthermore, our framework's reward network offers\nuncertainty estimates comparable with dedicated state-of-the-art uncertainty\nmethods, demonstrating the utility and effectiveness of RL4Seg in overcoming\ndomain adaptation challenges in medical image segmentation.", "paper_summary_zh": "深度學習分割模型的效能，在不同醫學影像領域的轉移性上受到顯著的挑戰，特別是在目標領域的適應，資料不足以進行有效微調時。現有的領域適應 (DA) 方法提出策略來緩解此問題，但這些方法並未明確納入人為驗證的分割先驗，這會影響模型產生解剖學上合理的分割的可能性。我們引進 RL4Seg，一種創新的強化學習架構，它減少了在目標領域中納入大量專家註解資料集的需求，並消除了冗長的、手動的人工審查需求。使用包含 10,000 個未註解的 2D 超音波影像的目標資料集，RL4Seg 不僅在準確性上優於現有的最先進的 DA 方法，而且在目標領域中，220 個專家驗證的受試者的子集中，解剖學效度達到 99%。此外，我們架構的獎勵網路提供了與專門的最先進的不確定性方法相當的不確定性估計，這證明了 RL4Seg 在克服醫學影像分割中的領域適應挑戰方面的效用和有效性。", "author": "Arnaud Judge et.al.", "authors": "Arnaud Judge, Thierry Judge, Nicolas Duchateau, Roman A. Sandler, Joseph Z. Sokol, Olivier Bernard, Pierre-Marc Jodoin", "id": "2406.17902v1", "paper_url": "http://arxiv.org/abs/2406.17902v1", "repo": "null"}}