{"2410.11064": {"publish_time": "2024-10-14", "title": "Parsing altered brain connectivity in neurodevelopmental disorders by integrating graph-based normative modeling and deep generative networks", "paper_summary": "Many neurodevelopmental disorders can be understood as divergent patterns of\nneural interactions during brain development. Advances in neuroimaging have\nilluminated these patterns by modeling the brain as a network structure using\ndiffution MRI tractography. However, characterizing and quantifying individual\nheterogeneity in neurodevelopmental disorders within these highly complex brain\nnetworks remains a significant challenge. In this paper, we present for the\nfirst time, a framework that integrates deep generative models with graph-based\nnormative modeling to characterize brain network development in the\nneurotypical population, which can then be used to quantify the\nindividual-level neurodivergence associated with disorders. Our deep generative\nmodel incorporates bio-inspired wiring constraints to effectively capture the\ndevelopmental trajectories of neurotypical brain networks. Neurodivergence is\nquantified by comparing individuals to this neurotypical trajectory, enabling\nthe creation of region-wise divergence maps that reveal latent developmental\ndifferences at each brain regions, along with overall neurodivergence scores\nbased on predicted brain age gaps. We demonstrate the clinical utility of this\nframework by applying it to a large sample of children with autism spectrum\ndisorders, showing that the individualized region-wise maps help parse the\nheterogeneity in autism, and the neurodivergence scores correlate with clinical\nassessments. Together, we provide powerful tools for quantifying\nneurodevelopmental divergence in brain networks, paying the way for developing\nimaging markers that will support disorder stratification, monitor progression,\nand evaluate therapeutic effectiveness.", "paper_summary_zh": "許多神經發育障礙可以理解為大腦發育過程中神經交互作用模式的差異。神經影像學的進步通過使用擴散磁振造影纖維束攝影術將大腦建模為網路結構，闡明了這些模式。然而，在這些高度複雜的大腦網路中，描述和量化神經發育障礙的個體異質性仍然是一個重大的挑戰。在本文中，我們首次提出了一個框架，該框架將深度生成模型與基於圖形的規範模型相結合，以描述神經典型人群中的大腦網路發展，然後可以用於量化與障礙相關的個體神經分歧。我們的深度生成模型結合了受生物啟發的接線約束，以有效捕捉神經典型大腦網路的發展軌跡。神經分歧通過將個體與這種神經典型軌跡進行比較來量化，從而能夠創建區域分歧圖，揭示每個大腦區域的潛在發育差異，以及基於預測腦齡差距的整體神經分歧得分。我們通過將此框架應用於大量自閉症譜系障礙兒童樣本，展示了這種臨床效用，表明個性化的區域分歧圖有助於解析自閉症的異質性，並且神經分歧得分與臨床評估相關。總之，我們提供了強大的工具來量化大腦網路中的神經發育分歧，為開發成像標記鋪平了道路，這些標記將支持障礙分層、監控進展和評估治療效果。", "author": "Rui Sherry Shen et.al.", "authors": "Rui Sherry Shen, Yusuf Osmanlıoğlu, Drew Parker, Darien Aunapu, Benjamin E. Yerys, Birkan Tunç, Ragini Verma", "id": "2410.11064v1", "paper_url": "http://arxiv.org/abs/2410.11064v1", "repo": "null"}}