{"2407.04055": {"publish_time": "2024-07-04", "title": "Benchmark on Drug Target Interaction Modeling from a Structure Perspective", "paper_summary": "The prediction modeling of drug-target interactions is crucial to drug\ndiscovery and design, which has seen rapid advancements owing to deep learning\ntechnologies. Recently developed methods, such as those based on graph neural\nnetworks (GNNs) and Transformers, demonstrate exceptional performance across\nvarious datasets by effectively extracting structural information. However, the\nbenchmarking of these novel methods often varies significantly in terms of\nhyperparameter settings and datasets, which limits algorithmic progress. In\nview of these, we conduct a comprehensive survey and benchmark for drug-target\ninteraction modeling from a structure perspective, via integrating tens of\nexplicit (i.e., GNN-based) and implicit (i.e., Transformer-based) structure\nlearning algorithms. To this end, we first unify the hyperparameter setting\nwithin each class of structure learning methods. Moreover, we conduct a\nmacroscopical comparison between these two classes of encoding strategies as\nwell as the different featurization techniques that inform molecules' chemical\nand physical properties. We then carry out the microscopical comparison between\nall the integrated models across the six datasets, via comprehensively\nbenchmarking their effectiveness and efficiency. Remarkably, the summarized\ninsights from the benchmark studies lead to the design of model combos. We\ndemonstrate that our combos can achieve new state-of-the-art performance on\nvarious datasets associated with cost-effective memory and computation. Our\ncode is available at\n\\hyperlink{https://github.com/justinwjl/GTB-DTI/tree/main}{https://github.com/justinwjl/GTB-DTI/tree/main}.", "paper_summary_zh": "<paragraph>藥物標靶交互作用的預測建模對藥物發現和設計至關重要，而這方面已因深度學習技術而快速進步。最近開發的方法，例如基於圖神經網路 (GNN) 和 Transformer 的方法，透過有效提取結構資訊，在各種資料集上展現出卓越的效能。然而，這些新方法的基準測試在超參數設定和資料集方面常常有顯著差異，這限制了演算法的進展。有鑑於此，我們透過整合數十種明確（即基於 GNN）和隱式（即基於 Transformer）結構學習演算法，進行全面的調查和基準測試，從結構的角度建構藥物標靶交互作用模型。為此，我們首先統一每種類別結構學習方法的超參數設定。此外，我們對這兩種類別的編碼策略以及用於告知分子的化學和物理特性的不同特徵化技術進行宏觀比較。接著，我們透過全面評量其有效性和效率，對所有整合模型在六個資料集上進行微觀比較。值得注意的是，基準研究中總結的見解導致模型組合的設計。我們證明我們的組合可以在與具成本效益的記憶體和運算相關的各種資料集上，達成新的最先進效能。我們的程式碼可以在\n\\hyperlink{https://github.com/justinwjl/GTB-DTI/tree/main}{https://github.com/justinwjl/GTB-DTI/tree/main} 取得。</paragraph>", "author": "Xinnan Zhang et.al.", "authors": "Xinnan Zhang, Jialin Wu, Junyi Xie, Tianlong Chen, Kaixiong Zhou", "id": "2407.04055v1", "paper_url": "http://arxiv.org/abs/2407.04055v1", "repo": "https://github.com/justinwjl/gtb-dti"}}