{"2411.17629": {"publish_time": "2024-11-26", "title": "Learning Chemical Reaction Representation with Reactant-Product Alignment", "paper_summary": "Organic synthesis stands as a cornerstone of chemical industry. The\ndevelopment of robust machine learning models to support tasks associated with\norganic reactions is of significant interest. However, current methods rely on\nhand-crafted features or direct adaptations of model architectures from other\ndomains, which lacks feasibility as data scales increase or overlook the rich\nchemical information inherent in reactions. To address these issues, this paper\nintroduces {\\modelname}, a novel chemical reaction representation learning\nmodel tailored for a variety of organic-reaction-related tasks. By integrating\natomic correspondence between reactants and products, our model discerns the\nmolecular transformations that occur during the reaction, thereby enhancing the\ncomprehension of the reaction mechanism. We have designed an adapter structure\nto incorporate reaction conditions into the chemical reaction representation,\nallowing the model to handle diverse reaction conditions and adapt to various\ndatasets and downstream tasks, e.g., reaction performance prediction.\nAdditionally, we introduce a reaction-center aware attention mechanism that\nenables the model to concentrate on key functional groups, thereby generating\npotent representations for chemical reactions. Our model has been evaluated on\na range of downstream tasks, including reaction condition prediction, reaction\nyield prediction, and reaction selectivity prediction. Experimental results\nindicate that our model markedly outperforms existing chemical reaction\nrepresentation learning architectures across all tasks. Notably, our model\nsignificantly outperforms all the baselines with up to 25\\% (top-1) and 16\\%\n(top-10) increased accuracy over the strongest baseline on USPTO\\_CONDITION\ndataset for reaction condition prediction. We plan to open-source the code\ncontingent upon the acceptance of the paper.", "paper_summary_zh": "<paragraph>有機合成是化學工業的基石。開發強大的機器學習模型以支援與有機反應相關的任務具有重大的意義。然而，目前的技術依賴於手工製作的特徵或直接採用其他領域的模型架構，這在資料擴增或忽略反應中固有的豐富化學資訊時缺乏可行性。為了解決這些問題，本文介紹了 {\\modelname}，一種新穎的化學反應表示學習模型，專門針對各種有機反應相關任務。透過整合反應物和產物之間的原子對應關係，我們的模型辨識出反應過程中發生的分子轉化，從而增強對反應機制的理解。我們設計了一個適配器結構，將反應條件納入化學反應表示中，讓模型能夠處理各種反應條件並適應不同的資料集和下游任務，例如反應效能預測。此外，我們引入了一個反應中心感知注意力機制，使模型能夠專注於關鍵官能基，從而為化學反應產生強有力的表示。我們的模型已在各種下游任務上進行評估，包括反應條件預測、反應產率預測和反應選擇性預測。實驗結果表明，我們的模型在所有任務上都明顯優於現有的化學反應表示學習架構。值得注意的是，我們的模型在 USPTO\\_CONDITION 資料集上，反應條件預測的準確率比最強的基線高出 25%（前 1）和 16%（前 10），顯著優於所有基線。我們計畫在論文被接受後開源程式碼。</paragraph>", "author": "Kaipeng Zeng et.al.", "authors": "Kaipeng Zeng, Xianbin Liu, Yu Zhang, Xiaokang Yang, Yaohui Jin, Yanyan Xu", "id": "2411.17629v1", "paper_url": "http://arxiv.org/abs/2411.17629v1", "repo": "null"}}