{"2405.14536": {"publish_time": "2024-05-23", "title": "Regressor-free Molecule Generation to Support Drug Response Prediction", "paper_summary": "Drug response prediction (DRP) is a crucial phase in drug discovery, and the\nmost important metric for its evaluation is the IC50 score. DRP results are\nheavily dependent on the quality of the generated molecules. Existing molecule\ngeneration methods typically employ classifier-based guidance, enabling\nsampling within the IC50 classification range. However, these methods fail to\nensure the sampling space range's effectiveness, generating numerous\nineffective molecules. Through experimental and theoretical study, we\nhypothesize that conditional generation based on the target IC50 score can\nobtain a more effective sampling space. As a result, we introduce\nregressor-free guidance molecule generation to ensure sampling within a more\neffective space and support DRP. Regressor-free guidance combines a diffusion\nmodel's score estimation with a regression controller model's gradient based on\nnumber labels. To effectively map regression labels between drugs and cell\nlines, we design a common-sense numerical knowledge graph that constrains the\norder of text representations. Experimental results on the real-world dataset\nfor the DRP task demonstrate our method's effectiveness in drug discovery. The\ncode is available at:https://anonymous.4open.science/r/RMCD-DBD1.", "paper_summary_zh": "藥物反應預測 (DRP) 是藥物發現中的關鍵階段，而評估其最重要的指標是 IC50 分數。DRP 結果高度依賴於生成分子的品質。現有的分子生成方法通常採用基於分類器的引導，在 IC50 分類範圍內進行取樣。然而，這些方法無法確保取樣空間範圍的有效性，會生成大量無效分子。透過實驗和理論研究，我們假設基於目標 IC50 分數的條件式生成可以取得更有效的取樣空間。因此，我們引入了無回歸器引導分子生成，以確保在更有效的空間內取樣，並支援 DRP。無回歸器引導結合了擴散模型的分數估計與基於數字標籤的回歸控制器模型的梯度。為了有效地對藥物和細胞系之間的回歸標籤進行對應，我們設計了一個常識數值知識圖，用於限制文字表示的順序。針對 DRP 任務的真實世界資料集的實驗結果證明了我們的方法在藥物發現中的有效性。程式碼可於以下網址取得：https://anonymous.4open.science/r/RMCD-DBD1。", "author": "Kun Li et.al.", "authors": "Kun Li, Xiuwen Gong, Shirui Pan, Jia Wu, Bo Du, Wenbin Hu", "id": "2405.14536v1", "paper_url": "http://arxiv.org/abs/2405.14536v1", "repo": "null"}}