{"2409.14904": {"publish_time": "2024-09-23", "title": "DSG-KD: Knowledge Distillation from Domain-Specific to General Language Models", "paper_summary": "The use of pre-trained language models fine-tuned to address specific\ndownstream tasks is a common approach in natural language processing (NLP).\nHowever, acquiring domain-specific knowledge via fine-tuning is challenging.\nTraditional methods involve pretraining language models using vast amounts of\ndomain-specific data before fine-tuning for particular tasks. This study\ninvestigates emergency/non-emergency classification tasks based on electronic\nmedical record (EMR) data obtained from pediatric emergency departments (PEDs)\nin Korea. Our findings reveal that existing domain-specific pre-trained\nlanguage models underperform compared to general language models in handling\nN-lingual free-text data characteristics of non-English-speaking regions. To\naddress these limitations, we propose a domain knowledge transfer methodology\nthat leverages knowledge distillation to infuse general language models with\ndomain-specific knowledge via fine-tuning. This study demonstrates the\neffective transfer of specialized knowledge between models by defining a\ngeneral language model as the student model and a domain-specific pre-trained\nmodel as the teacher model. In particular, we address the complexities of EMR\ndata obtained from PEDs in non-English-speaking regions, such as Korea, and\ndemonstrate that the proposed method enhances classification performance in\nsuch contexts. The proposed methodology not only outperforms baseline models on\nKorean PED EMR data, but also promises broader applicability in various\nprofessional and technical domains. In future works, we intend to extend this\nmethodology to include diverse non-English-speaking regions and address\nadditional downstream tasks, with the aim of developing advanced model\narchitectures using state-of-the-art KD techniques. The code is available in\nhttps://github.com/JoSangYeon/DSG-KD.", "paper_summary_zh": "<paragraph>使用針對特定下游任務進行微調的預先訓練語言模型是自然語言處理 (NLP) 中的常見方法。然而，透過微調來獲取特定領域的知識具有挑戰性。傳統方法涉及使用大量的特定領域資料來預訓練語言模型，然後針對特定任務進行微調。本研究調查了基於從韓國小兒急診科 (PED) 取得的電子醫療紀錄 (EMR) 資料的緊急/非緊急分類任務。我們的研究結果顯示，現有的特定領域預訓練語言模型在處理非英語系地區的 N 語言自由文字資料特性時，表現不如一般語言模型。為了解決這些限制，我們提出了一種領域知識轉移方法，該方法利用知識蒸餾，透過微調將一般語言模型注入特定領域的知識。本研究透過將一般語言模型定義為學生模型，將特定領域的預訓練模型定義為老師模型，展示了模型之間專業知識的有效轉移。特別是，我們解決了從非英語系地區（例如韓國）的 PED 取得的 EMR 資料的複雜性，並展示了所提出的方法增強了此類情境中的分類效能。所提出的方法不僅在韓文 PED EMR 資料上優於基準模型，還承諾在各種專業和技術領域中更廣泛的應用性。在未來的研究中，我們打算擴展此方法以納入不同的非英語系地區，並解決其他下游任務，目標是使用最先進的 KD 技術開發先進的模型架構。程式碼可在 https://github.com/JoSangYeon/DSG-KD 取得。</paragraph>", "author": "Sangyeon Cho et.al.", "authors": "Sangyeon Cho, Jangyeong Jeon, Dongjoon Lee, Changhee Lee, Junyeong Kim", "id": "2409.14904v1", "paper_url": "http://arxiv.org/abs/2409.14904v1", "repo": "null"}}