{"2502.14476": {"publish_time": "2025-02-20", "title": "Argument-Based Comparative Question Answering Evaluation Benchmark", "paper_summary": "In this paper, we aim to solve the problems standing in the way of automatic\ncomparative question answering. To this end, we propose an evaluation framework\nto assess the quality of comparative question answering summaries. We formulate\n15 criteria for assessing comparative answers created using manual annotation\nand annotation from 6 large language models and two comparative question\nasnwering datasets. We perform our tests using several LLMs and manual\nannotation under different settings and demonstrate the constituency of both\nevaluations. Our results demonstrate that the Llama-3 70B Instruct model\ndemonstrates the best results for summary evaluation, while GPT-4 is the best\nfor answering comparative questions. All used data, code, and evaluation\nresults are publicly\navailable\\footnote{\\url{https://anonymous.4open.science/r/cqa-evaluation-benchmark-4561/README.md}}.", "paper_summary_zh": "在本文中，我們旨在解決阻礙自動比較性問題解答的難題。為此，我們提出一個評估框架，用於評估比較性問題解答摘要的品質。我們制定了 15 項準則，用於評估使用手動標註和來自 6 個大型語言模型和兩個比較性問題解答資料集的標註所建立的比較性答案。我們在不同的設定下使用幾個 LLM 和手動標註執行測試，並展示兩種評估的組成。我們的結果表明，Llama-3 70B Instruct 模型在摘要評估中表現最佳，而 GPT-4 在回答比較性問題方面表現最佳。所有使用過的資料、程式碼和評估結果均公開可用\\footnote{\\url{https://anonymous.4open.science/r/cqa-evaluation-benchmark-4561/README.md}}。", "author": "Irina Nikishina et.al.", "authors": "Irina Nikishina, Saba Anwar, Nikolay Dolgov, Maria Manina, Daria Ignatenko, Viktor Moskvoretskii, Artem Shelmanov, Tim Baldwin, Chris Biemann", "id": "2502.14476v1", "paper_url": "http://arxiv.org/abs/2502.14476v1", "repo": "null"}}