{"2501.05752": {"publish_time": "2025-01-10", "title": "Semantic Exploration with Adaptive Gating for Efficient Problem Solving with Language Models", "paper_summary": "Recent advancements in large language models (LLMs) have shown remarkable\npotential in various complex tasks requiring multi-step reasoning methods like\ntree search to explore diverse reasoning paths. However, existing methods often\nsuffer from computational inefficiency and redundancy. First, they overlook the\ndiversity of task difficulties, leading to unnecessarily extensive searches\neven for easy tasks. Second, they neglect the semantics of reasoning paths,\nresulting in redundant exploration of semantically identical paths. To address\nthese limitations, we propose Semantic Exploration with Adaptive Gating (SEAG),\na computationally efficient method. SEAG employs an adaptive gating mechanism\nthat dynamically decides whether to conduct a tree search, based on the\nconfidence level of answers from a preceding simple reasoning method.\nFurthermore, its tree-based exploration consolidates semantically identical\nreasoning steps, reducing redundant explorations while maintaining or even\nimproving accuracy. Our extensive experiments demonstrate that SEAG\nsignificantly improves accuracy by 4.3% on average while requiring only 31% of\ncomputational costs compared to existing tree search-based methods on complex\nreasoning benchmarks including GSM8K and ARC with diverse language models such\nas Llama2, Llama3, and Mistral.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展在各種複雜任務中展現出顯著的潛力，這些任務需要像樹狀搜尋等多步驟推理方法來探索不同的推理路徑。然而，現有方法經常會遇到運算效率低和冗餘的問題。首先，它們忽略了任務難度的差異性，導致即使對於簡單的任務也會進行不必要的廣泛搜尋。其次，它們忽略了推理路徑的語義，導致對語義相同的路徑進行重複探索。為了解決這些限制，我們提出語義探索與自適應閘控 (SEAG)，這是一種運算效率高的方法。SEAG 採用自適應閘控機制，根據前一個簡單推理方法的答案信心等級，動態決定是否進行樹狀搜尋。此外，它的基於樹的探索整合了語義相同的推理步驟，減少了重複探索，同時維持或甚至提高了準確性。我們的廣泛實驗表明，在複雜的推理基準上，包括 GSM8K 和 ARC，SEAG 使用 Llama2、Llama3 和 Mistral 等多種語言模型，平均準確度提高了 4.3%，同時僅需現有基於樹狀搜尋的方法 31% 的運算成本。", "author": "Sungjae Lee et.al.", "authors": "Sungjae Lee, Hyejin Park, Jaechang Kim, Jungseul Ok", "id": "2501.05752v1", "paper_url": "http://arxiv.org/abs/2501.05752v1", "repo": "null"}}