{"2410.10450": {"publish_time": "2024-10-14", "title": "KBLaM: Knowledge Base augmented Language Model", "paper_summary": "In this paper, we propose Knowledge Base augmented Language Model (KBLaM), a\nnew method for augmenting Large Language Models (LLMs) with external knowledge.\nKBLaM works with a knowledge base (KB) constructed from a corpus of documents,\ntransforming each piece of knowledge in the KB into continuous key-value vector\npairs via pre-trained sentence encoders with linear adapters and integrating\nthem into pre-trained LLMs via a specialized rectangular attention mechanism.\nUnlike Retrieval-Augmented Generation, KBLaM eliminates external retrieval\nmodules, and unlike in-context learning, its computational overhead scales\nlinearly with KB size rather than quadratically. Our approach enables\nintegrating a large KB of more than 10K triples into an 8B pre-trained LLM of\nonly 8K context window on one single A100 80GB GPU and allows for dynamic\nupdates without model fine-tuning or retraining. Experiments demonstrate\nKBLaM's effectiveness in various tasks, including question-answering and\nopen-ended reasoning, while providing interpretable insights into its use of\nthe augmented knowledge.", "paper_summary_zh": "在本文中，我們提出了知識庫增強語言模型 (KBLaM)，這是一種使用外部知識增強大型語言模型 (LLM) 的新方法。KBLaM 使用從文件語料庫中建構的知識庫 (KB)，透過預先訓練的句子編碼器和線性適配器，將 KB 中的每段知識轉換為連續的鍵值向量對，並透過專門的矩形注意力機制將它們整合到預先訓練的 LLM 中。與檢索增強生成不同，KBLaM 消除了外部檢索模組，與情境內學習不同，它的運算開銷與 KB 大小成線性比例，而不是二次方比例。我們的做法能夠將超過 10K 三元組的大型 KB 整合到僅有 8K 情境視窗的 8B 預先訓練 LLM 中，僅使用一個 A100 80GB GPU，並允許動態更新，而無需模型微調或重新訓練。實驗證明了 KBLaM 在各種任務中的效能，包括問答和開放式推理，同時提供對其使用增強知識的可詮釋見解。", "author": "Xi Wang et.al.", "authors": "Xi Wang, Liana Mikaelyan, Taketomo Isazawa, James Hensman", "id": "2410.10450v1", "paper_url": "http://arxiv.org/abs/2410.10450v1", "repo": "null"}}