{"2409.11299": {"publish_time": "2024-09-17", "title": "TTT-Unet: Enhancing U-Net with Test-Time Training Layers for biomedical image segmentation", "paper_summary": "Biomedical image segmentation is crucial for accurately diagnosing and\nanalyzing various diseases. However, Convolutional Neural Networks (CNNs) and\nTransformers, the most commonly used architectures for this task, struggle to\neffectively capture long-range dependencies due to the inherent locality of\nCNNs and the computational complexity of Transformers. To address this\nlimitation, we introduce TTT-Unet, a novel framework that integrates Test-Time\nTraining (TTT) layers into the traditional U-Net architecture for biomedical\nimage segmentation. TTT-Unet dynamically adjusts model parameters during the\ntesting time, enhancing the model's ability to capture both local and\nlong-range features. We evaluate TTT-Unet on multiple medical imaging datasets,\nincluding 3D abdominal organ segmentation in CT and MR images, instrument\nsegmentation in endoscopy images, and cell segmentation in microscopy images.\nThe results demonstrate that TTT-Unet consistently outperforms state-of-the-art\nCNN-based and Transformer-based segmentation models across all tasks. The code\nis available at https://github.com/rongzhou7/TTT-Unet.", "paper_summary_zh": "生物醫學影像分割對於準確診斷和分析各種疾病至關重要。然而，卷積神經網路（CNN）和 Transformer，作為此任務最常用的架構，由於 CNN 的固有局部性和 Transformer 的計算複雜性，難以有效擷取長程依賴性。為了解決這個限制，我們引入了 TTT-Unet，一個創新的框架，將測試時間訓練（TTT）層整合到傳統的 U-Net 架構中，用於生物醫學影像分割。TTT-Unet 在測試時間動態調整模型參數，增強模型擷取局部和長程特徵的能力。我們在多個醫學影像資料集上評估 TTT-Unet，包括電腦斷層掃描和磁振造影中的 3D 腹腔器官分割、內視鏡影像中的儀器分割以及顯微鏡影像中的細胞分割。結果表明，TTT-Unet 在所有任務中都持續優於最先進的基於 CNN 和基於 Transformer 的分割模型。程式碼可在 https://github.com/rongzhou7/TTT-Unet 取得。", "author": "Rong Zhou et.al.", "authors": "Rong Zhou, Zhengqing Yuan, Zhiling Yan, Weixiang Sun, Kai Zhang, Yiwei Li, Yanfang Ye, Xiang Li, Lifang He, Lichao Sun", "id": "2409.11299v1", "paper_url": "http://arxiv.org/abs/2409.11299v1", "repo": "null"}}