{"2408.04585": {"publish_time": "2024-08-08", "title": "Towards Resilient and Efficient LLMs: A Comparative Study of Efficiency, Performance, and Adversarial Robustness", "paper_summary": "With the increasing demand for practical applications of Large Language\nModels (LLMs), many attention-efficient models have been developed to balance\nperformance and computational cost. However, the adversarial robustness of\nthese models remains under-explored. In this work, we design a framework to\ninvestigate the trade-off between efficiency, performance, and adversarial\nrobustness of LLMs by comparing three prominent models with varying levels of\ncomplexity and efficiency -- Transformer++, Gated Linear Attention (GLA)\nTransformer, and MatMul-Free LM -- utilizing the GLUE and AdvGLUE datasets. The\nAdvGLUE dataset extends the GLUE dataset with adversarial samples designed to\nchallenge model robustness. Our results show that while the GLA Transformer and\nMatMul-Free LM achieve slightly lower accuracy on GLUE tasks, they demonstrate\nhigher efficiency and either superior or comparative robustness on AdvGLUE\ntasks compared to Transformer++ across different attack levels. These findings\nhighlight the potential of simplified architectures to achieve a compelling\nbalance between efficiency, performance, and adversarial robustness, offering\nvaluable insights for applications where resource constraints and resilience to\nadversarial attacks are critical.", "paper_summary_zh": "隨著大型語言模型 (LLM) 實用應用需求的增加，許多注重效率的模型已被開發出來，以平衡效能和運算成本。然而，這些模型的對抗性穩健性仍未受到充分探討。在這項研究中，我們設計了一個架構來探討 LLM 的效率、效能和對抗性穩健性之間的取捨，方法是比較三個具有不同程度複雜性和效率的著名模型——Transformer++、門控線性注意力 (GLA) Transformer 和無 MatMul LM——並利用 GLUE 和 AdvGLUE 資料集。AdvGLUE 資料集擴充了 GLUE 資料集，其中包含旨在挑戰模型穩健性的對抗性樣本。我們的結果顯示，雖然 GLA Transformer 和無 MatMul LM 在 GLUE 任務上的準確度略低，但它們展現出更高的效率，並且在不同攻擊層級下，在 AdvGLUE 任務上展現出優於或相當的穩健性，優於 Transformer++。這些發現突顯了簡化架構在效率、效能和對抗性穩健性之間取得令人信服的平衡的潛力，為資源受限且對抗攻擊復原力至關重要的應用程式提供了寶貴的見解。", "author": "Xiaojing Fan et.al.", "authors": "Xiaojing Fan, Chunliang Tao", "id": "2408.04585v1", "paper_url": "http://arxiv.org/abs/2408.04585v1", "repo": "null"}}