{"2504.10405": {"publish_time": "2025-04-14", "title": "Performance of Large Language Models in Supporting Medical Diagnosis and Treatment", "paper_summary": "The integration of Large Language Models (LLMs) into healthcare holds\nsignificant potential to enhance diagnostic accuracy and support medical\ntreatment planning. These AI-driven systems can analyze vast datasets,\nassisting clinicians in identifying diseases, recommending treatments, and\npredicting patient outcomes. This study evaluates the performance of a range of\ncontemporary LLMs, including both open-source and closed-source models, on the\n2024 Portuguese National Exam for medical specialty access (PNA), a\nstandardized medical knowledge assessment. Our results highlight considerable\nvariation in accuracy and cost-effectiveness, with several models demonstrating\nperformance exceeding human benchmarks for medical students on this specific\ntask. We identify leading models based on a combined score of accuracy and\ncost, discuss the implications of reasoning methodologies like\nChain-of-Thought, and underscore the potential for LLMs to function as valuable\ncomplementary tools aiding medical professionals in complex clinical\ndecision-making.", "paper_summary_zh": "大型語言模型 (LLM) 與醫療保健的整合在提高診斷準確性和支持醫療治療計劃方面具有巨大潛力。這些 AI 驅動的系統可以分析龐大的數據集，協助臨床醫生識別疾病、推薦治療方案和預測患者的治療結果。本研究評估了一系列當代 LLM（包括開源和閉源模型）在2024 年葡萄牙國家醫學專業准入考試 (PNA) 中的表現，這是一項標準化的醫學知識評估。我們的結果突顯了準確性和成本效益的顯著差異，其中有幾個模型在這個特定任務中的表現超過了醫學生的基準。我們根據準確性和成本的綜合評分確定了領先的模型，討論了像思維鏈之類的推理方法的含義，並強調了 LLM 作為有價值的補充工具的潛力，可以協助醫療專業人員進行複雜的臨床決策。\n", "author": "Diogo Sousa et.al.", "authors": "Diogo Sousa, Guilherme Barbosa, Catarina Rocha, Dulce Oliveira", "id": "2504.10405v1", "paper_url": "http://arxiv.org/abs/2504.10405v1", "repo": "null"}}