{"2410.07797": {"publish_time": "2024-10-10", "title": "Rewriting Conversational Utterances with Instructed Large Language Models", "paper_summary": "Many recent studies have shown the ability of large language models (LLMs) to\nachieve state-of-the-art performance on many NLP tasks, such as question\nanswering, text summarization, coding, and translation. In some cases, the\nresults provided by LLMs are on par with those of human experts. These models'\nmost disruptive innovation is their ability to perform tasks via zero-shot or\nfew-shot prompting. This capability has been successfully exploited to train\ninstructed LLMs, where reinforcement learning with human feedback is used to\nguide the model to follow the user's requests directly. In this paper, we\ninvestigate the ability of instructed LLMs to improve conversational search\neffectiveness by rewriting user questions in a conversational setting. We study\nwhich prompts provide the most informative rewritten utterances that lead to\nthe best retrieval performance. Reproducible experiments are conducted on\npublicly-available TREC CAST datasets. The results show that rewriting\nconversational utterances with instructed LLMs achieves significant\nimprovements of up to 25.2% in MRR, 31.7% in Precision@1, 27% in NDCG@3, and\n11.5% in Recall@500 over state-of-the-art techniques.", "paper_summary_zh": "許多最近的研究顯示，大型語言模型 (LLM) 在許多 NLP 任務上展現出最先進的效能，例如問答、文字摘要、編碼和翻譯。在某些情況下，LLM 提供的結果與人類專家的結果不相上下。這些模型最具破壞性的創新是它們能夠透過零次學習或少次學習提示來執行任務。這種能力已成功用於訓練指示式 LLM，其中使用具有人類回饋的強化學習來引導模型直接遵循使用者的請求。在本文中，我們探討指示式 LLM 在對話式設定中改寫使用者問題，以提升對話式搜尋效能的能力。我們研究哪些提示提供了最多資訊的改寫語句，這些語句可帶來最佳的檢索效能。可在公開的 TREC CAST 資料集上進行可複製的實驗。結果顯示，使用指示式 LLM 改寫對話式語句，在 MRR 方面獲得高達 25.2% 的顯著提升，在 Precision@1 方面獲得 31.7% 的提升，在 NDCG@3 方面獲得 27% 的提升，在 Recall@500 方面獲得 11.5% 的提升，優於最先進的技術。", "author": "Elnara Galimzhanova et.al.", "authors": "Elnara Galimzhanova, Cristina Ioana Muntean, Franco Maria Nardini, Raffaele Perego, Guido Rocchietti", "id": "2410.07797v1", "paper_url": "http://arxiv.org/abs/2410.07797v1", "repo": "null"}}