{"2502.15266": {"publish_time": "2025-02-21", "title": "A Training-free LLM-based Approach to General Chinese Character Error Correction", "paper_summary": "Chinese spelling correction (CSC) is a crucial task that aims to correct\ncharacter errors in Chinese text. While conventional CSC focuses on character\nsubstitution errors caused by mistyping, two other common types of character\nerrors, missing and redundant characters, have received less attention. These\nerrors are often excluded from CSC datasets during the annotation process or\nignored during evaluation, even when they have been annotated. This issue\nlimits the practicality of the CSC task. To address this issue, we introduce\nthe task of General Chinese Character Error Correction (C2EC), which focuses on\nall three types of character errors. We construct a high-quality C2EC benchmark\nby combining and manually verifying data from CCTC and Lemon datasets. We\nextend the training-free prompt-free CSC method to C2EC by using Levenshtein\ndistance for handling length changes and leveraging an additional prompt-based\nlarge language model (LLM) to improve performance. Experiments show that our\nmethod enables a 14B-parameter LLM to be on par with models nearly 50 times\nlarger on both conventional CSC and C2EC tasks, without any fine-tuning.", "paper_summary_zh": "中文拼寫更正 (CSC) 是一項重要的任務，旨在更正中文文本中的字元錯誤。雖然傳統的 CSC 專注於因誤打字而造成的字元替換錯誤，但另外兩種常見的字元錯誤類型，即遺漏和多餘字元，卻較少受到關注。這些錯誤在註解過程中通常會從 CSC 資料集中排除，或在評估時被忽略，即使它們已被註解。此問題限制了 CSC 任務的實用性。為了解決這個問題，我們引入了通用中文字元錯誤更正 (C2EC) 的任務，它專注於所有三種類型的字元錯誤。我們通過結合並手動驗證來自 CCTC 和 Lemon 資料集的資料，構建了一個高品質的 C2EC 基準。我們通過使用 Levenshtein 距離來處理長度變化，並利用基於提示的附加大型語言模型 (LLM) 來提高效能，將無訓練無提示的 CSC 方法擴展到 C2EC。實驗表明，我們的模型使 14B 參數的 LLM 在傳統 CSC 和 C2EC 任務上與大近 50 倍的模型不相上下，且無需任何微調。", "author": "Houquan Zhou et.al.", "authors": "Houquan Zhou, Bo Zhang, Zhenghua Li, Ming Yan, Min Zhang", "id": "2502.15266v1", "paper_url": "http://arxiv.org/abs/2502.15266v1", "repo": "null"}}