{"2412.10312": {"publish_time": "2024-12-13", "title": "Interlocking-free Selective Rationalization Through Genetic-based Learning", "paper_summary": "A popular end-to-end architecture for selective rationalization is the\nselect-then-predict pipeline, comprising a generator to extract highlights fed\nto a predictor. Such a cooperative system suffers from suboptimal equilibrium\nminima due to the dominance of one of the two modules, a phenomenon known as\ninterlocking. While several contributions aimed at addressing interlocking,\nthey only mitigate its effect, often by introducing feature-based heuristics,\nsampling, and ad-hoc regularizations. We present GenSPP, the first\ninterlocking-free architecture for selective rationalization that does not\nrequire any learning overhead, as the above-mentioned. GenSPP avoids\ninterlocking by performing disjoint training of the generator and predictor via\ngenetic global search. Experiments on a synthetic and a real-world benchmark\nshow that our model outperforms several state-of-the-art competitors.", "paper_summary_zh": "選擇式簡化的一種流行端對端架構是選擇再預測管線，包含一個產生器用於萃取亮點並提供給預測器。這種合作系統會因兩個模組之一的支配而導致次佳平衡極小值，這種現象稱為互鎖。雖然有許多貢獻旨在解決互鎖，但它們僅能減輕其影響，通常是透過引入基於特徵的啟發法、取樣和特定規範化。我們提出 GenSPP，這是第一個無互鎖架構，用於選擇式簡化，不需要任何學習開銷，如上述。GenSPP 透過遺傳全球搜尋執行產生器和預測器的分離訓練，來避免互鎖。在合成和真實世界基準上的實驗顯示，我們的模型優於多個最先進的競爭者。", "author": "Federico Ruggeri et.al.", "authors": "Federico Ruggeri, Gaetano Signorelli", "id": "2412.10312v1", "paper_url": "http://arxiv.org/abs/2412.10312v1", "repo": "null"}}