{"2412.11851": {"publish_time": "2024-12-16", "title": "A Benchmark and Robustness Study of In-Context-Learning with Large Language Models in Music Entity Detection", "paper_summary": "Detecting music entities such as song titles or artist names is a useful\napplication to help use cases like processing music search queries or analyzing\nmusic consumption on the web. Recent approaches incorporate smaller language\nmodels (SLMs) like BERT and achieve high results. However, further research\nindicates a high influence of entity exposure during pre-training on the\nperformance of the models. With the advent of large language models (LLMs),\nthese outperform SLMs in a variety of downstream tasks. However, researchers\nare still divided if this is applicable to tasks like entity detection in texts\ndue to issues like hallucination. In this paper, we provide a novel dataset of\nuser-generated metadata and conduct a benchmark and a robustness study using\nrecent LLMs with in-context-learning (ICL). Our results indicate that LLMs in\nthe ICL setting yield higher performance than SLMs. We further uncover the\nlarge impact of entity exposure on the best performing LLM in our study.", "paper_summary_zh": "偵測音樂實體（例如歌曲標題或藝術家名稱）是一項有用的應用，有助於處理音樂搜尋查詢或分析網路上的音樂消費等使用案例。最近的方法結合了較小的語言模型（SLM），例如 BERT，並取得了很高的結果。然而，進一步的研究指出，實體曝光在模型的預訓練期間對其效能有很大的影響。隨著大型語言模型（LLM）的出現，它們在各種下游任務中都優於 SLM。然而，研究人員對於這是否適用於文字中的實體偵測等任務仍有分歧，因為存在幻覺等問題。在本文中，我們提供了一個由使用者產生的元資料的新穎資料集，並使用最近的 LLM 與情境中學習（ICL）進行基準測試和穩健性研究。我們的結果表明，ICL 設定中的 LLM 比 SLM 產生更高的效能。我們進一步揭示了實體曝光對我們研究中效能最佳的 LLM 的重大影響。", "author": "Simon Hachmeier et.al.", "authors": "Simon Hachmeier, Robert Jäschke", "id": "2412.11851v1", "paper_url": "http://arxiv.org/abs/2412.11851v1", "repo": "https://github.com/progsi/ytuncoverllm"}}