{"2406.09143": {"publish_time": "2024-06-13", "title": "Generative AI-based Prompt Evolution Engineering Design Optimization With Vision-Language Model", "paper_summary": "Engineering design optimization requires an efficient combination of a 3D\nshape representation, an optimization algorithm, and a design performance\nevaluation method, which is often computationally expensive. We present a\nprompt evolution design optimization (PEDO) framework contextualized in a\nvehicle design scenario that leverages a vision-language model for penalizing\nimpractical car designs synthesized by a generative model. The backbone of our\nframework is an evolutionary strategy coupled with an optimization objective\nfunction that comprises a physics-based solver and a vision-language model for\npractical or functional guidance in the generated car designs. In the prompt\nevolutionary search, the optimizer iteratively generates a population of text\nprompts, which embed user specifications on the aerodynamic performance and\nvisual preferences of the 3D car designs. Then, in addition to the\ncomputational fluid dynamics simulations, the pre-trained vision-language model\nis used to penalize impractical designs and, thus, foster the evolutionary\nalgorithm to seek more viable designs. Our investigations on a car design\noptimization problem show a wide spread of potential car designs generated at\nthe early phase of the search, which indicates a good diversity of designs in\nthe initial populations, and an increase of over 20\\% in the probability of\ngenerating practical designs compared to a baseline framework without using a\nvision-language model. Visual inspection of the designs against the performance\nresults demonstrates prompt evolution as a very promising paradigm for finding\nnovel designs with good optimization performance while providing ease of use in\nspecifying design specifications and preferences via a natural language\ninterface.", "paper_summary_zh": "<paragraph>工程設計最佳化需要結合 3D 形狀表示、最佳化演算法和設計效能評估方法，這些方法通常在運算上很耗費資源。我們提出一個情境化於車輛設計場景的提示演化設計最佳化 (PEDO) 架構，該架構利用視覺語言模型來懲罰生成模型合成的非實際汽車設計。我們的架構主幹是一個演化策略，結合一個包含基於物理求解器和視覺語言模型的最佳化目標函數，用於在生成的汽車設計中提供實用或功能指導。在提示演化搜尋中，最佳化器會反覆產生一組文字提示，其中包含使用者對 3D 汽車設計的空氣動力效能和視覺偏好的規格。然後，除了計算流體力學模擬外，預先訓練好的視覺語言模型用於懲罰非實際設計，並因此促使演化演算法尋找更多可行的設計。我們對汽車設計最佳化問題的調查顯示，在搜尋的早期階段產生了廣泛的潛在汽車設計，這表示初始族群中有良好的設計多樣性，並且與不使用視覺語言模型的基準架構相比，產生實用設計的機率增加了 20% 以上。根據效能結果對設計進行視覺檢查，證明提示演化是一種非常有前途的範例，可以用於尋找具有良好最佳化效能的新穎設計，同時透過自然語言介面輕鬆指定設計規格和偏好。</paragraph>", "author": "Melvin Wong et.al.", "authors": "Melvin Wong, Thiago Rios, Stefan Menzel, Yew Soon Ong", "id": "2406.09143v2", "paper_url": "http://arxiv.org/abs/2406.09143v2", "repo": "null"}}