{"2406.18200": {"publish_time": "2024-06-26", "title": "SEED: Accelerating Reasoning Tree Construction via Scheduled Speculative Decoding", "paper_summary": "Large Language Models (LLMs) demonstrate remarkable emergent abilities across\nvarious tasks, yet fall short of complex reasoning and planning tasks. The\ntree-search-based reasoning methods address this by surpassing the capabilities\nof chain-of-thought prompting, encouraging exploration of intermediate steps.\nHowever, such methods introduce significant inference latency due to the\nsystematic exploration and evaluation of multiple thought paths. This paper\nintroduces SeeD, a novel and efficient inference framework to optimize runtime\nspeed and GPU memory management concurrently. By employing a scheduled\nspeculative execution, SeeD efficiently handles multiple iterations for the\nthought generation and the state evaluation, leveraging a rounds-scheduled\nstrategy to manage draft model dispatching. Extensive experimental evaluations\non three reasoning datasets demonstrate superior speedup performance of SeeD,\nproviding a viable path for batched inference in training-free speculative\ndecoding.", "paper_summary_zh": "大型語言模型 (LLM) 在各種任務中展現出非凡的新興能力，但仍無法進行複雜的推理和規劃任務。基於樹狀搜尋的推理方法通過超越思想提示鏈的能力來解決這個問題，鼓勵探索中間步驟。然而，由於系統性地探索和評估多個思考路徑，這種方法會引入顯著的推理延遲。本文介紹了 SeeD，這是一個新穎且高效的推理框架，用於同時最佳化執行時間速度和 GPU 記憶體管理。通過採用預定的推測性執行，SeeD 可以有效地處理思想生成和狀態評估的多次反覆運算，利用回合預定策略來管理草稿模型的調度。在三個推理資料集上的廣泛實驗評估證明了 SeeD 的優異加速效能，為訓練免費推測解碼中的批次推理提供了可行的路徑。", "author": "Zhenglin Wang et.al.", "authors": "Zhenglin Wang, Jialong Wu, Yilong Lai, Congzhi Zhang, Deyu Zhou", "id": "2406.18200v1", "paper_url": "http://arxiv.org/abs/2406.18200v1", "repo": "null"}}