{"2408.04093": {"publish_time": "2024-08-07", "title": "Tree Attention: Topology-aware Decoding for Long-Context Attention on GPU clusters", "paper_summary": "Self-attention is the core mathematical operation of modern transformer\narchitectures and is also a significant computational bottleneck due to its\nquadratic complexity in the sequence length. In this work, we derive the scalar\nenergy function whose gradient computes the self-attention block, thus\nelucidating the theoretical underpinnings of self-attention, providing a\nBayesian interpretation of the operation and linking it closely with\nenergy-based models such as Hopfield Networks. Moreover, due to this\nformulation, we discover that we can use efficient and optimized\nautomatic-differentiation techniques to derive a highly efficient Tree\nAttention algorithm to compute the gradient of the energy and hence\nself-attention. Our formulation reveals that the reduction across the sequence\naxis can be efficiently computed in parallel through a tree reduction. Our\nalgorithm, for parallelizing attention computation across multiple GPUs,\nenables cross-device decoding to be performed asymptotically faster (up to 8x\nfaster) than alternative approaches such as Ring Attention, while also\nrequiring significantly less communication volume and incurring 2x less peak\nmemory. Our code is publicly available here:\n\\url{https://github.com/Zyphra/tree_attention}", "paper_summary_zh": "自我注意力是現代Transformer架構的核心數學運算，而且由於其在序列長度中的二次複雜性，它也是一個重要的計算瓶頸。在這項工作中，我們推導出標量能量函數，其梯度計算自我注意力區塊，從而闡明自我注意力的理論基礎，提供該運算的貝葉斯詮釋，並將其與基於能量的模型（例如霍普菲爾德網路）緊密連結。此外，由於這個公式，我們發現我們可以使用高效且最佳化的自動微分技術來推導一個高效的樹注意力演算法，以計算能量的梯度，從而自我注意。我們的公式揭示了序列軸上的約簡可以透過樹約簡有效地並行計算。我們的演算法，用於在多個 GPU 上並行化注意力計算，使跨裝置解碼能夠比替代方法（例如環形注意力）執行得更快（快 8 倍），同時也需要顯著減少通訊量，並減少 2 倍的峰值記憶體。我們的程式碼在此公開：\n\\url{https://github.com/Zyphra/tree_attention}", "author": "Vasudev Shyam et.al.", "authors": "Vasudev Shyam, Jonathan Pilault, Emily Shepperd, Quentin Anthony, Beren Millidge", "id": "2408.04093v1", "paper_url": "http://arxiv.org/abs/2408.04093v1", "repo": "null"}}