{"2408.04093": {"publish_time": "2024-08-07", "title": "Tree Attention: Topology-aware Decoding for Long-Context Attention on GPU clusters", "paper_summary": "Self-attention is the core mathematical operation of modern transformer\narchitectures and is also a significant computational bottleneck due to its\nquadratic complexity in the sequence length. In this work, we derive the scalar\nenergy function whose gradient computes the self-attention block, thus\nelucidating the theoretical underpinnings of self-attention, providing a\nBayesian interpretation of the operation and linking it closely with\nenergy-based models such as Hopfield Networks. Our formulation reveals that the\nreduction across the sequence axis can be efficiently computed in parallel\nthrough a tree reduction. Our algorithm, for parallelizing attention\ncomputation across multiple GPUs enables cross-device decoding to be performed\nasymptotically faster (up to 8x faster in our experiments) than alternative\napproaches such as Ring Attention, while also requiring significantly less\ncommunication volume and incurring 2x less peak memory. Our code is publicly\navailable here: \\url{https://github.com/Zyphra/tree_attention}.", "paper_summary_zh": "自注意力是現代Transformer架構的核心數學運算，並且由於其在序列長度上的二次複雜度，也是重要的計算瓶頸。在這項工作中，我們推導出梯度計算自注意力區塊的標量能量函數，從而闡明自注意力的理論基礎，提供該運算的貝氏解釋，並將其與基於能量的模型（例如 Hopfield 網路）緊密聯繫起來。我們的公式揭示了序列軸上的約簡可以通過樹約簡有效地並行計算。我們的演算法，用於在多個 GPU 上並行化注意力計算，使跨裝置解碼能夠比 Ring Attention 等替代方法執行漸近更快（在我們的實驗中快 8 倍），同時也需要顯著更少的通信量，並產生 2 倍更少的峰值記憶體。我們的程式碼在此公開：\\url{https://github.com/Zyphra/tree_attention}。", "author": "Vasudev Shyam et.al.", "authors": "Vasudev Shyam, Jonathan Pilault, Emily Shepperd, Quentin Anthony, Beren Millidge", "id": "2408.04093v2", "paper_url": "http://arxiv.org/abs/2408.04093v2", "repo": "https://github.com/zyphra/tree_attention"}}