{"2407.06785": {"publish_time": "2024-07-09", "title": "Towards physics-informed neural networks for landslide prediction", "paper_summary": "For decades, solutions to regional scale landslide prediction have mostly\nrelied on data-driven models, by definition, disconnected from the physics of\nthe failure mechanism. The success and spread of such tools came from the\nability to exploit proxy variables rather than explicit geotechnical ones, as\nthe latter are prohibitive to acquire over broad landscapes. Our work\nimplements a Physics Informed Neural Network (PINN) approach, thereby adding to\na standard data-driven architecture, an intermediate constraint to solve for\nthe permanent deformation typical of Newmark slope stability methods. This\ntranslates into a neural network tasked with explicitly retrieving geotechnical\nparameters from common proxy variables and then minimize a loss function with\nrespect to the available coseismic landside inventory. The results are very\npromising, because our model not only produces excellent predictive performance\nin the form of standard susceptibility output, but in the process, also\ngenerates maps of the expected geotechnical properties at a regional scale.\nSuch architecture is therefore framed to tackle coseismic landslide prediction,\nsomething that, if confirmed in other studies, could open up towards PINN-based\nnear-real-time predictions.", "paper_summary_zh": "數十年來，區域規模的土石流預測解決方案大多依賴於資料驅動模型，根據定義，與破壞機制的物理性質無關。此類工具的成功和普及源於利用代理變數而非明確的岩土工程變數，因為後者在廣闊的景觀中難以獲取。我們的研究實作了物理資訊神經網路 (PINN) 方法，從而將標準資料驅動架構新增一個中間約束，以解決 Newmark 斜坡穩定性方法中典型的永久變形。這轉化為一個神經網路，負責從常見的代理變數中明確擷取岩土工程參數，然後針對可用的同震土石流清單最小化損失函數。結果非常有希望，因為我們的模型不僅以標準敏感性輸出形式產生出色的預測效能，而且在此過程中，還生成了區域規模預期岩土工程屬性的地圖。因此，此架構被設定為解決同震土石流預測，如果在其他研究中得到證實，這可能會開啟基於 PINN 的近乎即時預測。", "author": "Ashok Dahal et.al.", "authors": "Ashok Dahal, Luigi Lombardo", "id": "2407.06785v1", "paper_url": "http://arxiv.org/abs/2407.06785v1", "repo": "null"}}