{"2410.19637": {"publish_time": "2024-10-25", "title": "A distributional simplicity bias in the learning dynamics of transformers", "paper_summary": "The remarkable capability of over-parameterised neural networks to generalise\neffectively has been explained by invoking a ``simplicity bias'': neural\nnetworks prevent overfitting by initially learning simple classifiers before\nprogressing to more complex, non-linear functions. While simplicity biases have\nbeen described theoretically and experimentally in feed-forward networks for\nsupervised learning, the extent to which they also explain the remarkable\nsuccess of transformers trained with self-supervised techniques remains\nunclear. In our study, we demonstrate that transformers, trained on natural\nlanguage data, also display a simplicity bias. Specifically, they sequentially\nlearn many-body interactions among input tokens, reaching a saturation point in\nthe prediction error for low-degree interactions while continuing to learn\nhigh-degree interactions. To conduct this analysis, we develop a procedure to\ngenerate \\textit{clones} of a given natural language data set, which rigorously\ncapture the interactions between tokens up to a specified order. This approach\nopens up the possibilities of studying how interactions of different orders in\nthe data affect learning, in natural language processing and beyond.", "paper_summary_zh": "過度參數化神經網路能夠有效泛化的顯著能力，已透過援用「簡潔偏差」來解釋：神經網路會在進展到更複雜的非線性函數之前，先學習簡單的分類器來防止過度擬合。雖然簡潔偏差已在監督式學習的前饋網路中在理論上和實驗上得到描述，但它們在多大程度上也能解釋使用自監督技術訓練的Transformer獲得顯著成功，這一點仍不清楚。在我們的研究中，我們證明了在自然語言資料上訓練的Transformer也顯示出簡潔偏差。具體來說，它們會依序學習輸入標記之間的多體交互作用，在低階交互作用的預測誤差達到飽和點時，會繼續學習高階交互作用。為了進行此分析，我們開發了一個程序來產生特定自然語言資料集的「複製」，該程序嚴謹地擷取最多到指定順序的標記之間的交互作用。這種方法開啟了研究資料中不同順序的交互作用如何影響學習的可能性，這不僅限於自然語言處理。", "author": "Riccardo Rende et.al.", "authors": "Riccardo Rende, Federica Gerace, Alessandro Laio, Sebastian Goldt", "id": "2410.19637v1", "paper_url": "http://arxiv.org/abs/2410.19637v1", "repo": "null"}}