{"2406.04268": {"publish_time": "2024-06-06", "title": "Open-Endedness is Essential for Artificial Superhuman Intelligence", "paper_summary": "In recent years there has been a tremendous surge in the general capabilities\nof AI systems, mainly fuelled by training foundation models on internetscale\ndata. Nevertheless, the creation of openended, ever self-improving AI remains\nelusive. In this position paper, we argue that the ingredients are now in place\nto achieve openendedness in AI systems with respect to a human observer.\nFurthermore, we claim that such open-endedness is an essential property of any\nartificial superhuman intelligence (ASI). We begin by providing a concrete\nformal definition of open-endedness through the lens of novelty and\nlearnability. We then illustrate a path towards ASI via open-ended systems\nbuilt on top of foundation models, capable of making novel, humanrelevant\ndiscoveries. We conclude by examining the safety implications of\ngenerally-capable openended AI. We expect that open-ended foundation models\nwill prove to be an increasingly fertile and safety-critical area of research\nin the near future.", "paper_summary_zh": "近年来，人工智能系统的整体能力大幅提升，这主要归功于在互联网规模的数据上训练基础模型。然而，创建开放式、不断自我完善的人工智能仍然难以实现。在本文中，我们认为现在已经具备了在人类观察者方面实现人工智能系统开放性的条件。此外，我们认为这种开放性是任何人工智能超人类智能 (ASI) 的本质属性。我们首先通过新颖性和可学习性的视角对开放性提供一个具体的形式化定义。然后，我们通过建立在基础模型之上的开放式系统，展示了一条通往 ASI 的道路，该系统能够进行新颖的、与人类相关的发现。最后，我们通过检查通用开放式人工智能的安全影响来结束本文。我们预计开放式基础模型将在不久的将来被证明是一个越来越肥沃且对安全至关重要的研究领域。", "author": "Edward Hughes et.al.", "authors": "Edward Hughes, Michael Dennis, Jack Parker-Holder, Feryal Behbahani, Aditi Mavalankar, Yuge Shi, Tom Schaul, Tim Rocktaschel", "id": "2406.04268v1", "paper_url": "http://arxiv.org/abs/2406.04268v1", "repo": "null"}}