{"2409.20120": {"publish_time": "2024-09-30", "title": "ACE: Abstractions for Communicating Efficiently", "paper_summary": "A central but unresolved aspect of problem-solving in AI is the capability to\nintroduce and use abstractions, something humans excel at. Work in cognitive\nscience has demonstrated that humans tend towards higher levels of abstraction\nwhen engaged in collaborative task-oriented communication, enabling gradually\nshorter and more information-efficient utterances. Several computational\nmethods have attempted to replicate this phenomenon, but all make unrealistic\nsimplifying assumptions about how abstractions are introduced and learned. Our\nmethod, Abstractions for Communicating Efficiently (ACE), overcomes these\nlimitations through a neuro-symbolic approach. On the symbolic side, we draw on\nwork from library learning for proposing abstractions. We combine this with\nneural methods for communication and reinforcement learning, via a novel use of\nbandit algorithms for controlling the exploration and exploitation trade-off in\nintroducing new abstractions. ACE exhibits similar tendencies to humans on a\ncollaborative construction task from the cognitive science literature, where\none agent (the architect) instructs the other (the builder) to reconstruct a\nscene of block-buildings. ACE results in the emergence of an efficient language\nas a by-product of collaborative communication. Beyond providing mechanistic\ninsights into human communication, our work serves as a first step to providing\nconversational agents with the ability for human-like communicative\nabstractions.", "paper_summary_zh": "問題解決在 AI 中一個核心但尚未解決的面向是抽象化的引入和使用能力，這是人類擅長的事情。認知科學中的研究已證明，當人類從事協作任務導向溝通時，會傾向於較高層級的抽象化，這使得話語逐漸簡短且更具資訊效率。有幾種運算方法已嘗試複製此現象，但全部都對抽象化是如何引入和學習的做出不切實際的簡化假設。我們的抽象化有效溝通 (ACE) 方法透過神經符號方法克服了這些限制。在符號方面，我們利用來自程式庫學習的成果來提出抽象化。我們將此與神經方法結合起來，用於溝通和強化學習，透過一種新穎的強盜演算法使用方式來控制在引入新抽象化時探索和利用的權衡。ACE 在認知科學文獻中的一項協作建構任務中展現出與人類相似的傾向，在該任務中，一個代理人（建築師）指示另一個代理人（建造者）重建一個積木建築場景。ACE 導致一種有效語言的出現，作為協作溝通的副產品。除了提供人類溝通的機制見解外，我們的研究還作為提供對話代理人具有人類式溝通抽象化能力的第一步。", "author": "Jonathan D. Thomas et.al.", "authors": "Jonathan D. Thomas, Andrea Silvi, Devdatt Dubhashi, Vikas Garg, Moa Johansson", "id": "2409.20120v1", "paper_url": "http://arxiv.org/abs/2409.20120v1", "repo": "null"}}