{"2406.09072": {"publish_time": "2024-06-13", "title": "Living in the Moment: Can Large Language Models Grasp Co-Temporal Reasoning?", "paper_summary": "Temporal reasoning is fundamental for large language models (LLMs) to\ncomprehend the world. Current temporal reasoning datasets are limited to\nquestions about single or isolated events, falling short in mirroring the\nrealistic temporal characteristics involving concurrent nature and intricate\ntemporal interconnections. In this paper, we introduce CoTempQA, a\ncomprehensive co-temporal Question Answering (QA) benchmark containing four\nco-temporal scenarios (Equal, Overlap, During, Mix) with 4,748 samples for\nevaluating the co-temporal comprehension and reasoning abilities of LLMs. Our\nextensive experiments reveal a significant gap between the performance of\ncurrent LLMs and human-level reasoning on CoTempQA tasks. Even when enhanced\nwith Chain of Thought (CoT) methodologies, models consistently struggle with\nour task. In our preliminary exploration, we discovered that mathematical\nreasoning plays a significant role in handling co-temporal events and proposed\na strategy to boost LLMs' co-temporal reasoning from a mathematical\nperspective. We hope that our CoTempQA datasets will encourage further\nadvancements in improving the co-temporal reasoning capabilities of LLMs. Our\ncode is available at https://github.com/zhaochen0110/Cotempqa.", "paper_summary_zh": "時序推理對於大型語言模型 (LLM) 理解世界至關重要。目前時序推理資料集僅限於單一或孤立事件的問題，無法反映涉及並發性質和複雜時序關聯的現實時序特徵。在本文中，我們介紹 CoTempQA，一個全面的共時問答 (QA) 基準，包含四個共時場景（相等、重疊、期間、混合），有 4,748 個樣本，用於評估 LLM 的共時理解和推理能力。我們的廣泛實驗揭示了當前 LLM 的效能與人類層級在 CoTempQA 任務上的推理之間存在顯著差距。即使使用思想鏈 (CoT) 方法增強，模型仍持續在我們的任務中掙扎。在我們的初步探討中，我們發現數學推理在處理共時事件中扮演重要角色，並提出了一個從數學角度提升 LLM 共時推理的策略。我們希望我們的 CoTempQA 資料集將鼓勵進一步提升 LLM 的共時推理能力。我們的程式碼可在 https://github.com/zhaochen0110/Cotempqa 取得。", "author": "Zhaochen Su et.al.", "authors": "Zhaochen Su, Juntao Li, Jun Zhang, Tong Zhu, Xiaoye Qu, Pan Zhou, Yan Bowen, Yu Cheng, Min zhang", "id": "2406.09072v1", "paper_url": "http://arxiv.org/abs/2406.09072v1", "repo": "https://github.com/zhaochen0110/cotempqa"}}