{"2410.21073": {"publish_time": "2024-10-28", "title": "Skip2-LoRA: A Lightweight On-device DNN Fine-tuning Method for Low-cost Edge Devices", "paper_summary": "This paper proposes Skip2-LoRA as a lightweight fine-tuning method for deep\nneural networks to address the gap between pre-trained and deployed models. In\nour approach, trainable LoRA (low-rank adaptation) adapters are inserted\nbetween the last layer and every other layer to enhance the network expressive\npower while keeping the backward computation cost low. This architecture is\nwell-suited to cache intermediate computation results of the forward pass and\nthen can skip the forward computation of seen samples as training epochs\nprogress. We implemented the combination of the proposed architecture and\ncache, denoted as Skip2-LoRA, and tested it on a $15 single board computer. Our\nresults show that Skip2-LoRA reduces the fine-tuning time by 90.0% on average\ncompared to the counterpart that has the same number of trainable parameters\nwhile preserving the accuracy, while taking only a few seconds on the\nmicrocontroller board.", "paper_summary_zh": "本論文提出 Skip2-LoRA 作為深度神經網路的輕量級微調方法，以解決預訓練模型和已部署模型之間的差距。在我們的做法中，可訓練的 LoRA（低秩適應）適配器會插入最後一層和每一層之間，以增強網路表達能力，同時保持反向運算成本低。此架構非常適合快取前向傳遞的中間運算結果，然後隨著訓練時期的進展，可以跳過已見樣本的前向運算。我們實作了所提出的架構和快取的組合，稱為 Skip2-LoRA，並在 15 美元的單板電腦上進行測試。我們的結果顯示，與具有相同數量可訓練參數的對應項相比，Skip2-LoRA 平均減少 90.0% 的微調時間，同時保持準確性，而僅在微控制器板上花費幾秒鐘。", "author": "Hiroki Matsutani et.al.", "authors": "Hiroki Matsutani, Masaaki Kondo, Kazuki Sunaga, Radu Marculescu", "id": "2410.21073v1", "paper_url": "http://arxiv.org/abs/2410.21073v1", "repo": "null"}}