{"2408.00997": {"publish_time": "2024-08-02", "title": "A Safe Exploration Strategy for Model-free Task Adaptation in Safety-constrained Grid Environments", "paper_summary": "Training a model-free reinforcement learning agent requires allowing the\nagent to sufficiently explore the environment to search for an optimal policy.\nIn safety-constrained environments, utilizing unsupervised exploration or a\nnon-optimal policy may lead the agent to undesirable states, resulting in\noutcomes that are potentially costly or hazardous for both the agent and the\nenvironment. In this paper, we introduce a new exploration framework for\nnavigating the grid environments that enables model-free agents to interact\nwith the environment while adhering to safety constraints. Our framework\nincludes a pre-training phase, during which the agent learns to identify\npotentially unsafe states based on both observable features and specified\nsafety constraints in the environment. Subsequently, a binary classification\nmodel is trained to predict those unsafe states in new environments that\nexhibit similar dynamics. This trained classifier empowers model-free agents to\ndetermine situations in which employing random exploration or a suboptimal\npolicy may pose safety risks, in which case our framework prompts the agent to\nfollow a predefined safe policy to mitigate the potential for hazardous\nconsequences. We evaluated our framework on three randomly generated grid\nenvironments and demonstrated how model-free agents can safely adapt to new\ntasks and learn optimal policies for new environments. Our results indicate\nthat by defining an appropriate safe policy and utilizing a well-trained model\nto detect unsafe states, our framework enables a model-free agent to adapt to\nnew tasks and environments with significantly fewer safety violations.", "paper_summary_zh": "訓練無模型強化學習代理人需要允許代理人充分探索環境以搜尋最佳策略。在安全受限的環境中，利用非監督式探索或非最佳策略可能會導致代理人進入不良狀態，造成對代理人和環境都有潛在代價或危險的後果。在本文中，我們介紹了一個新的探索架構，用於導航網格環境，讓無模型代理人能夠與環境互動，同時遵守安全限制。我們的架構包含一個預訓練階段，在該階段中，代理人會學習根據可觀察特徵和環境中指定的安全性限制來識別潛在不安全的狀態。隨後，訓練一個二進位分類模型來預測在具有類似動態的新環境中的那些不安全狀態。這個訓練好的分類器讓無模型代理人能夠判斷在哪些情況下採用隨機探索或次最佳策略可能會構成安全風險，在這種情況下，我們的架構會提示代理人遵循預定義的安全策略來減輕潛在的危險後果。我們在三個隨機生成的網格環境中評估了我們的架構，並展示了無模型代理人如何安全地適應新任務並學習新環境的最佳策略。我們的結果表明，通過定義適當的安全策略並利用訓練良好的模型來偵測不安全狀態，我們的架構讓無模型代理人能夠適應新任務和環境，而且大幅減少安全違規。", "author": "Erfan Entezami et.al.", "authors": "Erfan Entezami, Mahsa Sahebdel, Dhawal Gupta", "id": "2408.00997v1", "paper_url": "http://arxiv.org/abs/2408.00997v1", "repo": "null"}}