{"2406.08358": {"publish_time": "2024-06-12", "title": "From a Social Cognitive Perspective: Context-aware Visual Social Relationship Recognition", "paper_summary": "People's social relationships are often manifested through their\nsurroundings, with certain objects or interactions acting as symbols for\nspecific relationships, e.g., wedding rings, roses, hugs, or holding hands.\nThis brings unique challenges to recognizing social relationships, requiring\nunderstanding and capturing the essence of these contexts from visual\nappearances. However, current methods of social relationship understanding rely\non the basic classification paradigm of detected persons and objects, which\nfails to understand the comprehensive context and often overlooks decisive\nsocial factors, especially subtle visual cues. To highlight the social-aware\ncontext and intricate details, we propose a novel approach that recognizes\n\\textbf{Con}textual \\textbf{So}cial \\textbf{R}elationships (\\textbf{ConSoR})\nfrom a social cognitive perspective. Specifically, to incorporate social-aware\nsemantics, we build a lightweight adapter upon the frozen CLIP to learn social\nconcepts via our novel multi-modal side adapter tuning mechanism. Further, we\nconstruct social-aware descriptive language prompts (e.g., scene, activity,\nobjects, emotions) with social relationships for each image, and then compel\nConSoR to concentrate more intensively on the decisive visual social factors\nvia visual-linguistic contrasting. Impressively, ConSoR outperforms previous\nmethods with a 12.2\\% gain on the People-in-Social-Context (PISC) dataset and a\n9.8\\% increase on the People-in-Photo-Album (PIPA) benchmark. Furthermore, we\nobserve that ConSoR excels at finding critical visual evidence to reveal social\nrelationships.", "paper_summary_zh": "人們的社交關係通常透過他們的周遭環境體現出來，某些物件或互動作為特定關係的象徵，例如結婚戒指、玫瑰花、擁抱或牽手。這為識別社交關係帶來了獨特的挑戰，需要從視覺外觀中理解和捕捉這些脈絡的本質。然而，當前社交關係理解方法依賴於已偵測人物和物件的基本分類範例，這無法理解全面的脈絡，且經常忽略決定性的社會因素，特別是微妙的視覺線索。為了強調具有社會意識的脈絡和複雜細節，我們提出了一種新穎的方法，從社會認知的角度識別**情境****社**會**關**係（**ConSoR**）。具體來說，為了納入具有社會意識的語義，我們在凍結的 CLIP 上建立了一個輕量級適配器，以透過我們新穎的多模式側適配器調整機制來學習社會概念。此外，我們為每張影像建立具有社會關係的社會意識描述性語言提示（例如場景、活動、物件、情緒），然後迫使 ConSoR 透過視覺語言對比更專注於決定性的視覺社會因素。令人印象深刻的是，ConSoR 在 People-in-Social-Context (PISC) 資料集上以 12.2% 的增益優於先前的各種方法，並在 People-in-Photo-Album (PIPA) 基準上增加了 9.8%。此外，我們觀察到 ConSoR 擅長找到關鍵的視覺證據來揭示社會關係。", "author": "Shiwei Wu et.al.", "authors": "Shiwei Wu, Chao Zhang, Joya Chen, Tong Xu, Likang Wu, Yao Hu, Enhong Chen", "id": "2406.08358v1", "paper_url": "http://arxiv.org/abs/2406.08358v1", "repo": "null"}}