{"2501.19018": {"publish_time": "2025-01-31", "title": "Scalable Multi-phase Word Embedding Using Conjunctive Propositional Clauses", "paper_summary": "The Tsetlin Machine (TM) architecture has recently demonstrated effectiveness\nin Machine Learning (ML), particularly within Natural Language Processing\n(NLP). It has been utilized to construct word embedding using conjunctive\npropositional clauses, thereby significantly enhancing our understanding and\ninterpretation of machine-derived decisions. The previous approach performed\nthe word embedding over a sequence of input words to consolidate the\ninformation into a cohesive and unified representation. However, that approach\nencounters scalability challenges as the input size increases. In this study,\nwe introduce a novel approach incorporating two-phase training to discover\ncontextual embeddings of input sequences. Specifically, this method\nencapsulates the knowledge for each input word within the dataset's vocabulary,\nsubsequently constructing embeddings for a sequence of input words utilizing\nthe extracted knowledge. This technique not only facilitates the design of a\nscalable model but also preserves interpretability. Our experimental findings\nrevealed that the proposed method yields competitive performance compared to\nthe previous approaches, demonstrating promising results in contrast to\nhuman-generated benchmarks. Furthermore, we applied the proposed approach to\nsentiment analysis on the IMDB dataset, where the TM embedding and the TM\nclassifier, along with other interpretable classifiers, offered a transparent\nend-to-end solution with competitive performance.", "paper_summary_zh": "Tsetlin 機器 (TM) 架構最近在機器學習 (ML) 中展現了其效能，特別是在自然語言處理 (NLP) 領域。它已被用於建構詞嵌入，使用連接命題子句，從而顯著增強我們對機器衍生決策的理解和詮釋。先前的做法對輸入字詞的序列執行詞嵌入，將資訊整合到一個有凝聚力和統一性的表徵中。然而，隨著輸入大小的增加，該做法會遇到可擴充性的挑戰。在本研究中，我們介紹一種新穎的做法，結合兩階段訓練來發現輸入序列的脈絡嵌入。具體來說，此方法將資料集詞彙中每個輸入字詞的知識封裝起來，然後利用提取的知識為輸入字詞的序列建構嵌入。此技術不僅有助於設計可擴充性的模型，還能保留可解釋性。我們的實驗結果顯示，與先前的做法相比，所提出的方法產出了有競爭力的效能，與人為產生的基準相比，展現了有希望的結果。此外，我們將所提出的做法應用於 IMDB 資料集的情緒分析，其中 TM 嵌入和 TM 分類器，以及其他可解釋的分類器，提供了一個透明的端到端解決方案，具有競爭力的效能。", "author": "Ahmed K. Kadhim et.al.", "authors": "Ahmed K. Kadhim, Lei Jiao, Rishad Shafik, Ole-Christoffer Granmo, Bimal Bhattarai", "id": "2501.19018v2", "paper_url": "http://arxiv.org/abs/2501.19018v2", "repo": "null"}}