{"2502.04695": {"publish_time": "2025-02-07", "title": "Bridging the Gap in XAI-Why Reliable Metrics Matter for Explainability and Compliance", "paper_summary": "This position paper emphasizes the critical gap in the evaluation of\nExplainable AI (XAI) due to the lack of standardized and reliable metrics,\nwhich diminishes its practical value, trustworthiness, and ability to meet\nregulatory requirements. Current evaluation methods are often fragmented,\nsubjective, and biased, making them prone to manipulation and complicating the\nassessment of complex models. A central issue is the absence of a ground truth\nfor explanations, complicating comparisons across various XAI approaches. To\naddress these challenges, we advocate for widespread research into developing\nrobust, context-sensitive evaluation metrics. These metrics should be resistant\nto manipulation, relevant to each use case, and based on human judgment and\nreal-world applicability. We also recommend creating domain-specific evaluation\nbenchmarks that align with the user and regulatory needs of sectors such as\nhealthcare and finance. By encouraging collaboration among academia, industry,\nand regulators, we can create standards that balance flexibility and\nconsistency, ensuring XAI explanations are meaningful, trustworthy, and\ncompliant with evolving regulations.", "paper_summary_zh": "這篇立場文件強調，由於缺乏標準化且可靠的指標，可解釋人工智慧 (XAI) 的評估中存在關鍵的差距，這降低了其實用價值、可信度，以及滿足法規要求的能力。當前的評估方法通常是分散的、主觀的，且有偏見的，這使得它們容易被操縱，並使複雜模型的評估複雜化。一個核心議題是缺乏解釋的基準事實，這使得跨各種 XAI 方法的比較變得複雜。為了應對這些挑戰，我們提倡廣泛研究，以開發強健且對情境敏感的評估指標。這些指標應能抵抗操縱，與每個使用案例相關，並基於人類判斷和真實世界的適用性。我們也建議建立與使用者和法規需求相符的特定領域評估基準，例如醫療保健和金融。透過鼓勵學術界、產業和監管機構之間的合作，我們可以創造出平衡靈活性和一致性的標準，確保 XAI 解釋是有意義的、可信的，且符合不斷演進的法規。", "author": "Pratinav Seth et.al.", "authors": "Pratinav Seth, Vinay Kumar Sankarapu", "id": "2502.04695v1", "paper_url": "http://arxiv.org/abs/2502.04695v1", "repo": "null"}}