{"2408.01008": {"publish_time": "2024-08-02", "title": "Tensor Train Low-rank Approximation (TT-LoRA): Democratizing AI with Accelerated LLMs", "paper_summary": "In recent years, Large Language Models (LLMs) have demonstrated remarkable\ncapabilities across a wide range of natural language processing (NLP) tasks,\nsuch as question-answering, sentiment analysis, text summarization, and machine\ntranslation. However, the ever-growing complexity of LLMs demands immense\ncomputational resources, hindering the broader research and application of\nthese models. To address this, various parameter-efficient fine-tuning\nstrategies, such as Low-Rank Approximation (LoRA) and Adapters, have been\ndeveloped. Despite their potential, these methods often face limitations in\ncompressibility. Specifically, LoRA struggles to scale effectively with the\nincreasing number of trainable parameters in modern large scale LLMs.\nAdditionally, Low-Rank Economic Tensor-Train Adaptation (LoRETTA), which\nutilizes tensor train decomposition, has not yet achieved the level of\ncompression necessary for fine-tuning very large scale models with limited\nresources. This paper introduces Tensor Train Low-Rank Approximation (TT-LoRA),\na novel parameter-efficient fine-tuning (PEFT) approach that extends LoRETTA\nwith optimized tensor train (TT) decomposition integration. By eliminating\nAdapters and traditional LoRA-based structures, TT-LoRA achieves greater model\ncompression without compromising downstream task performance, along with\nreduced inference latency and computational overhead. We conduct an exhaustive\nparameter search to establish benchmarks that highlight the trade-off between\nmodel compression and performance. Our results demonstrate significant\ncompression of LLMs while maintaining comparable performance to larger models,\nfacilitating their deployment on resource-constraint platforms.", "paper_summary_zh": "近年來，大型語言模型（LLM）在廣泛的自然語言處理（NLP）任務中展現了卓越的能力，例如問答、情緒分析、文字摘要和機器翻譯。然而，LLM 不斷增長的複雜性需要龐大的運算資源，阻礙了這些模型更廣泛的研究和應用。為了解決這個問題，已經開發了各種參數高效的微調策略，例如低秩近似（LoRA）和適配器。儘管有潛力，這些方法在可壓縮性方面常常面臨限制。具體來說，LoRA 難以隨著現代大規模 LLM 中可訓練參數的數量增加而有效擴展。此外，利用張量訓練分解的低秩經濟張量訓練適應（LoRETTA）尚未達到使用有限資源微調超大規模模型所需的壓縮級別。本文介紹了張量訓練低秩近似（TT-LoRA），這是一種新的參數高效微調（PEFT）方法，它通過優化的張量訓練（TT）分解整合擴展了 LoRETTA。通過消除適配器和傳統的基於 LoRA 的結構，TT-LoRA 在不影響下游任務性能的情況下實現了更大的模型壓縮，同時降低了推理延遲和運算開銷。我們進行了詳盡的參數搜索，以建立基準，突顯模型壓縮和性能之間的權衡。我們的結果表明，LLM 的壓縮顯著，同時保持與較大模型相當的性能，促進它們在資源約束平台上的部署。", "author": "Afia Anjum et.al.", "authors": "Afia Anjum, Maksim E. Eren, Ismael Boureima, Boian Alexandrov, Manish Bhattarai", "id": "2408.01008v1", "paper_url": "http://arxiv.org/abs/2408.01008v1", "repo": "null"}}