{"2406.02497": {"publish_time": "2024-06-04", "title": "Dropout MPC: An Ensemble Neural MPC Approach for Systems with Learned Dynamics", "paper_summary": "Neural networks are lately more and more often being used in the context of\ndata-driven control, as an approximate model of the true system dynamics. Model\nPredictive Control (MPC) adopts this practise leading to neural MPC strategies.\nThis raises a question of whether the trained neural network has converged and\ngeneralized in a way that the learned model encapsulates an accurate\napproximation of the true dynamic model of the system, thus making it a\nreliable choice for model-based control, especially for disturbed and uncertain\nsystems. To tackle that, we propose Dropout MPC, a novel sampling-based\nensemble neural MPC algorithm that employs the Monte-Carlo dropout technique on\nthe learned system model. The closed loop is based on an ensemble of predictive\ncontrollers, that are used simultaneously at each time-step for trajectory\noptimization. Each member of the ensemble influences the control input, based\non a weighted voting scheme, thus by employing different realizations of the\nlearned system dynamics, neural control becomes more reliable by design. An\nadditional strength of the method is that it offers by design a way to estimate\nfuture uncertainty, leading to cautious control. While the method aims in\ngeneral at uncertain systems with complex dynamics, where models derived from\nfirst principles are hard to infer, to showcase the application we utilize data\ngathered in the laboratory from a real mobile manipulator and employ the\nproposed algorithm for the navigation of the robot in simulation.", "paper_summary_zh": "<paragraph>神经網路最近越來越常在資料驅動控制的背景下被用作真實系統動態的近似模型。模型預測控制 (MPC) 採用這種做法，進而產生神經 MPC 策略。這引發了一個問題，即受過訓練的神經網路是否已收斂並概括化，使得學習到的模型包含系統真實動態模型的精確近似值，從而使其成為基於模型的控制的可靠選擇，特別是對於受干擾和不確定的系統。為了解決這個問題，我們提出了 Dropout MPC，一種新穎的基於抽樣的整體神經 MPC 演算法，該演算法對學習到的系統模型採用蒙地卡羅 Dropout 技術。閉迴路基於預測控制器的整體，這些控制器在每個時間步長同時用於軌跡最佳化。整體的每個成員都基於加權投票方案影響控制輸入，因此，通過採用學習到的系統動態的不同實現，神經控制在設計上變得更加可靠。該方法的另一個優點是，它在設計上提供了一種估計未來不確定性的方法，從而導致謹慎的控制。雖然該方法通常針對具有複雜動態的不確定系統，其中難以推論出從第一原理衍生的模型，但為了展示應用，我們利用從真實移動機械手臂在實驗室中收集的資料，並採用所提出的演算法在模擬中導航機器人。</paragraph>", "author": "Spyridon Syntakas et.al.", "authors": "Spyridon Syntakas, Kostas Vlachos", "id": "2406.02497v1", "paper_url": "http://arxiv.org/abs/2406.02497v1", "repo": "null"}}