{"2501.04661": {"publish_time": "2025-01-08", "title": "Assessing Language Comprehension in Large Language Models Using Construction Grammar", "paper_summary": "Large Language Models, despite their significant capabilities, are known to\nfail in surprising and unpredictable ways. Evaluating their true\n`understanding' of language is particularly challenging due to the extensive\nweb-scale data they are trained on. Therefore, we construct an evaluation to\nsystematically assess natural language understanding (NLU) in LLMs by\nleveraging Construction Grammar (CxG), which provides insights into the meaning\ncaptured by linguistic elements known as constructions (Cxns). CxG is\nwell-suited for this purpose because provides a theoretical basis to construct\ntargeted evaluation sets. These datasets are carefully constructed to include\nexamples which are unlikely to appear in pre-training data, yet intuitive and\neasy for humans to understand, enabling a more targeted and reliable\nassessment. Our experiments focus on downstream natural language inference and\nreasoning tasks by comparing LLMs' understanding of the underlying meanings\ncommunicated through 8 unique Cxns with that of humans. The results show that\nwhile LLMs demonstrate some knowledge of constructional information, even the\nlatest models including GPT-o1 struggle with abstract meanings conveyed by\nthese Cxns, as demonstrated in cases where test sentences are dissimilar to\ntheir pre-training data. We argue that such cases provide a more accurate test\nof true language understanding, highlighting key limitations in LLMs' semantic\ncapabilities. We make our novel dataset and associated experimental data\nincluding prompts and model responses publicly available.", "paper_summary_zh": "儘管大型語言模型具有顯著的能力，但它們以令人驚訝且無法預測的方式失敗而聞名。由於它們訓練於廣泛的網路規模資料，因此評估它們對語言的真正「理解」特別具有挑戰性。因此，我們建構了一個評量，以透過利用建構文法（CxG）系統性地評估大型語言模型中的自然語言理解（NLU），它提供了對建構（Cxns）等語言元素所擷取的意義的見解。CxG 非常適合此目的，因為它提供了建構目標評量集的理論基礎。這些資料集經過仔細建構，包含不太可能出現在預訓練資料中的範例，但對人類來說卻直觀且易於理解，從而能夠進行更有針對性和更可靠的評量。我們的實驗重點在於下游自然語言推論和推理任務，透過將大型語言模型對透過 8 個獨特的 Cxns 傳達的底層意義的理解與人類的理解進行比較。結果顯示，儘管大型語言模型展示出對建構資訊的某些知識，但即使是包括 GPT-o1 在內的最新模型，在這些 Cxns 傳達的抽象意義上仍有困難，這在測試句子與其預訓練資料不同的情況中得到證明。我們認為，此類案例提供了對真實語言理解更準確的測試，突顯了大型語言模型語義能力中的主要限制。我們公開了我們的新穎資料集和相關實驗資料，包括提示和模型回應。", "author": "Wesley Scivetti et.al.", "authors": "Wesley Scivetti, Melissa Torgbi, Austin Blodgett, Mollie Shichman, Taylor Hudson, Claire Bonial, Harish Tayyar Madabushi", "id": "2501.04661v1", "paper_url": "http://arxiv.org/abs/2501.04661v1", "repo": "null"}}