{"2411.03862": {"publish_time": "2024-11-06", "title": "ROBIN: Robust and Invisible Watermarks for Diffusion Models with Adversarial Optimization", "paper_summary": "Watermarking generative content serves as a vital tool for authentication,\nownership protection, and mitigation of potential misuse. Existing watermarking\nmethods face the challenge of balancing robustness and concealment. They\nempirically inject a watermark that is both invisible and robust and passively\nachieve concealment by limiting the strength of the watermark, thus reducing\nthe robustness. In this paper, we propose to explicitly introduce a watermark\nhiding process to actively achieve concealment, thus allowing the embedding of\nstronger watermarks. To be specific, we implant a robust watermark in an\nintermediate diffusion state and then guide the model to hide the watermark in\nthe final generated image. We employ an adversarial optimization algorithm to\nproduce the optimal hiding prompt guiding signal for each watermark. The prompt\nembedding is optimized to minimize artifacts in the generated image, while the\nwatermark is optimized to achieve maximum strength. The watermark can be\nverified by reversing the generation process. Experiments on various diffusion\nmodels demonstrate the watermark remains verifiable even under significant\nimage tampering and shows superior invisibility compared to other\nstate-of-the-art robust watermarking methods.", "paper_summary_zh": "生成式內容的水印作為驗證、所有權保護和減輕潛在誤用的重要工具。 現有的水印方法面臨平衡強健性和隱藏性的挑戰。 他們根據經驗注入一個既不可見又強健的水印，並通過限制水印的強度來被動實現隱藏，從而降低強健性。 在本文中，我們建議明確引入水印隱藏過程以主動實現隱藏，從而允許嵌入更強的水印。 具體來說，我們在中間擴散狀態中植入一個強健的水印，然後引導模型在最終生成的圖像中隱藏水印。 我們採用對抗性優化演算法為每個水印產生最佳隱藏提示引導訊號。 提示嵌入經過最佳化以最小化生成圖像中的偽像，而水印經過最佳化以實現最大強度。 可以通過逆轉生成過程來驗證水印。 各種擴散模型的實驗表明，即使在顯著的圖像篡改下，水印仍然可以驗證，並且與其他最先進的強健水印方法相比，顯示出優異的不可見性。", "author": "Huayang Huang et.al.", "authors": "Huayang Huang, Yu Wu, Qian Wang", "id": "2411.03862v1", "paper_url": "http://arxiv.org/abs/2411.03862v1", "repo": "https://github.com/hannah1102/robin"}}