{"2408.04217": {"publish_time": "2024-08-08", "title": "Simplifying Translations for Children: Iterative Simplification Considering Age of Acquisition with LLMs", "paper_summary": "In recent years, neural machine translation (NMT) has been widely used in\neveryday life. However, the current NMT lacks a mechanism to adjust the\ndifficulty level of translations to match the user's language level.\nAdditionally, due to the bias in the training data for NMT, translations of\nsimple source sentences are often produced with complex words. In particular,\nthis could pose a problem for children, who may not be able to understand the\nmeaning of the translations correctly. In this study, we propose a method that\nreplaces words with high Age of Acquisitions (AoA) in translations with simpler\nwords to match the translations to the user's level. We achieve this by using\nlarge language models (LLMs), providing a triple of a source sentence, a\ntranslation, and a target word to be replaced. We create a benchmark dataset\nusing back-translation on Simple English Wikipedia. The experimental results\nobtained from the dataset show that our method effectively replaces high-AoA\nwords with lower-AoA words and, moreover, can iteratively replace most of the\nhigh-AoA words while still maintaining high BLEU and COMET scores.", "paper_summary_zh": "近年來，神經機器翻譯（NMT）已廣泛應用於日常生活。然而，現有 NMT 缺乏調整翻譯難度以符合使用者語言程度的機制。此外，由於 NMT 訓練資料的偏差，簡單的原始句有時會翻譯成使用複雜詞彙的句子。特別是，這可能會對兒童造成問題，因為他們可能無法正確理解翻譯的含義。在本研究中，我們提出了一種方法，將翻譯中高習得年齡 (AoA) 的字詞替換為較簡單的字詞，以符合使用者的程度。我們透過使用大型語言模型 (LLM) 來達成此目的，提供原始句子、翻譯和要替換的目標字詞的三元組。我們使用簡單英語維基百科上的反向翻譯建立基准資料集。從資料集中獲得的實驗結果顯示，我們的模型有效地將高 AoA 字詞替換為低 AoA 字詞，而且還能反覆替換大多數高 AoA 字詞，同時仍維持高 BLEU 和 COMET 分數。", "author": "Masashi Oshika et.al.", "authors": "Masashi Oshika, Makoto Morishita, Tsutomu Hirao, Ryohei Sasano, Koichi Takeda", "id": "2408.04217v1", "paper_url": "http://arxiv.org/abs/2408.04217v1", "repo": "https://github.com/nttcslab-nlp/simplifyingmt_acl24"}}