{"2501.19264": {"publish_time": "2025-01-31", "title": "mFollowIR: a Multilingual Benchmark for Instruction Following in Retrieval", "paper_summary": "Retrieval systems generally focus on web-style queries that are short and\nunderspecified. However, advances in language models have facilitated the\nnascent rise of retrieval models that can understand more complex queries with\ndiverse intents. However, these efforts have focused exclusively on English;\ntherefore, we do not yet understand how they work across languages. We\nintroduce mFollowIR, a multilingual benchmark for measuring\ninstruction-following ability in retrieval models. mFollowIR builds upon the\nTREC NeuCLIR narratives (or instructions) that span three diverse languages\n(Russian, Chinese, Persian) giving both query and instruction to the retrieval\nmodels. We make small changes to the narratives and isolate how well retrieval\nmodels can follow these nuanced changes. We present results for both\nmultilingual (XX-XX) and cross-lingual (En-XX) performance. We see strong\ncross-lingual performance with English-based retrievers that trained using\ninstructions, but find a notable drop in performance in the multilingual\nsetting, indicating that more work is needed in developing data for\ninstruction-based multilingual retrievers.", "paper_summary_zh": "檢索系統通常專注於簡短且未指定之網路式查詢。然而，語言模型的進展促成了檢索模型的初步興起，這些模型能夠理解具有不同意圖的更複雜查詢。然而，這些努力專注於英文；因此，我們尚未了解它們如何跨語言運作。我們引入了 mFollowIR，這是一個多語言基準，用於衡量檢索模型中遵循指令的能力。mFollowIR 建立在 TREC NeuCLIR 敘事（或指令）之上，這些敘事跨越三種不同的語言（俄語、中文、波斯語），為檢索模型提供查詢和指令。我們對敘事進行了微小的更改，並隔離檢索模型遵循這些細微更改的程度。我們針對多語言 (XX-XX) 和跨語言 (En-XX) 效能呈現結果。我們看到使用指令訓練的基於英文的檢索器具有強大的跨語言效能，但在多語言環境中發現效能顯著下降，這表明需要在開發用於基於指令的多語言檢索器的資料方面投入更多工作。", "author": "Orion Weller et.al.", "authors": "Orion Weller, Benjamin Chang, Eugene Yang, Mahsa Yarmohammadi, Sam Barham, Sean MacAvaney, Arman Cohan, Luca Soldaini, Benjamin Van Durme, Dawn Lawrie", "id": "2501.19264v1", "paper_url": "http://arxiv.org/abs/2501.19264v1", "repo": "null"}}