{"2407.07858": {"publish_time": "2024-07-10", "title": "FACTS About Building Retrieval Augmented Generation-based Chatbots", "paper_summary": "Enterprise chatbots, powered by generative AI, are emerging as key\napplications to enhance employee productivity. Retrieval Augmented Generation\n(RAG), Large Language Models (LLMs), and orchestration frameworks like\nLangchain and Llamaindex are crucial for building these chatbots. However,\ncreating effective enterprise chatbots is challenging and requires meticulous\nRAG pipeline engineering. This includes fine-tuning embeddings and LLMs,\nextracting documents from vector databases, rephrasing queries, reranking\nresults, designing prompts, honoring document access controls, providing\nconcise responses, including references, safeguarding personal information, and\nbuilding orchestration agents. We present a framework for building RAG-based\nchatbots based on our experience with three NVIDIA chatbots: for IT/HR\nbenefits, financial earnings, and general content. Our contributions are\nthree-fold: introducing the FACTS framework (Freshness, Architectures, Cost,\nTesting, Security), presenting fifteen RAG pipeline control points, and\nproviding empirical results on accuracy-latency tradeoffs between large and\nsmall LLMs. To the best of our knowledge, this is the first paper of its kind\nthat provides a holistic view of the factors as well as solutions for building\nsecure enterprise-grade chatbots.\"", "paper_summary_zh": "由生成式 AI 驅動的企業聊天機器人，正作為提升員工生產力的關鍵應用程式浮現。檢索擴充生成 (RAG)、大型語言模型 (LLM) 和 Langchain 與 Llamaindex 等編排架構對於建構這些聊天機器人至關重要。然而，建立有效的企業聊天機器人具有挑戰性，需要細緻的 RAG 管道工程。這包括微調嵌入和 LLM、從向量資料庫中萃取文件、改寫查詢、重新排列結果、設計提示、遵守文件存取控制、提供簡潔的回應、包括參考資料、保障個人資訊，以及建構編排代理。我們根據在 NVIDIA 的三個聊天機器人（針對 IT/HR 福利、財務收益和一般內容）的經驗，提出了一個建構基於 RAG 的聊天機器人的架構。我們的貢獻有三方面：引入 FACTS 架構（新鮮度、架構、成本、測試、安全性）、提出十五個 RAG 管道控制點，以及提供大型和小型 LLM 之間準確度-延遲權衡的經驗結果。據我們所知，這是第一篇提供全面觀點的論文，探討建構安全企業級聊天機器人的因素和解決方案。", "author": "Rama Akkiraju et.al.", "authors": "Rama Akkiraju, Anbang Xu, Deepak Bora, Tan Yu, Lu An, Vishal Seth, Aaditya Shukla, Pritam Gundecha, Hridhay Mehta, Ashwin Jha, Prithvi Raj, Abhinav Balasubramanian, Murali Maram, Guru Muthusamy, Shivakesh Reddy Annepally, Sidney Knowles, Min Du, Nick Burnett, Sean Javiya, Ashok Marannan, Mamta Kumari, Surbhi Jha, Ethan Dereszenski, Anupam Chakraborty, Subhash Ranjan, Amina Terfai, Anoop Surya, Tracey Mercer, Vinodh Kumar Thanigachalam, Tamar Bar, Sanjana Krishnan, Samy Kilaru, Jasmine Jaksic, Nave Algarici, Jacob Liberman, Joey Conway, Sonu Nayyar, Justin Boitano", "id": "2407.07858v1", "paper_url": "http://arxiv.org/abs/2407.07858v1", "repo": "null"}}