{"2412.07755": {"publish_time": "2024-12-10", "title": "SAT: Spatial Aptitude Training for Multimodal Language Models", "paper_summary": "Spatial perception is a fundamental component of intelligence. While many\nstudies highlight that large multimodal language models (MLMs) struggle to\nreason about space, they only test for static spatial reasoning, such as\ncategorizing the relative positions of objects. Meanwhile, real-world\ndeployment requires dynamic capabilities like perspective-taking and egocentric\naction recognition. As a roadmap to improving spatial intelligence, we\nintroduce SAT, Spatial Aptitude Training, which goes beyond static relative\nobject position questions to the more dynamic tasks. SAT contains 218K\nquestion-answer pairs for 22K synthetic scenes across a training and testing\nset. Generated using a photo-realistic physics engine, our dataset can be\narbitrarily scaled and easily extended to new actions, scenes, and 3D assets.\nWe find that even MLMs that perform relatively well on static questions\nstruggle to accurately answer dynamic spatial questions. Further, we show that\nSAT instruction-tuning data improves not only dynamic spatial reasoning on SAT,\nbut also zero-shot performance on existing real-image spatial benchmarks:\n$23\\%$ on CVBench, $8\\%$ on the harder BLINK benchmark, and $18\\%$ on VSR. When\ninstruction-tuned on SAT, our 13B model matches larger proprietary MLMs like\nGPT4-V and Gemini-3-1.0 in spatial reasoning. Our data/code is available at\nhttp://arijitray1993.github.io/SAT/ .", "paper_summary_zh": "空間感知是智慧的基本組成部分。雖然許多研究強調大型多模態語言模型 (MLM) 難以推論空間，但它們僅測試靜態空間推理，例如分類物體的相對位置。同時，現實世界的部署需要動態能力，例如觀點採取和自我中心動作識別。作為改善空間智慧的路線圖，我們引入了 SAT（空間能力訓練），它超越了靜態相對物體位置問題，轉向更動態的任務。SAT 包含 218K 個問題解答對，適用於訓練和測試集中 22K 個合成場景。我們的數據集使用逼真的物理引擎生成，可以任意縮放，並輕鬆擴展到新的動作、場景和 3D 資產。我們發現，即使在靜態問題上表現相對良好的 MLM 也難以準確回答動態空間問題。此外，我們表明 SAT 指令調整數據不僅改善了 SAT 上的動態空間推理，還改善了現有真實圖像空間基準上的零次學習效能：CVBench 上的 23%，較困難的 BLINK 基準上的 8%，以及 VSR 上的 18%。當在 SAT 上進行指令調整後，我們的 13B 模型在空間推理中與 GPT4-V 和 Gemini-3-1.0 等較大的專有 MLM 相匹配。我們的數據/程式碼可在 http://arijitray1993.github.io/SAT/ 取得。", "author": "Arijit Ray et.al.", "authors": "Arijit Ray, Jiafei Duan, Reuben Tan, Dina Bashkirova, Rose Hendrix, Kiana Ehsani, Aniruddha Kembhavi, Bryan A. Plummer, Ranjay Krishna, Kuo-Hao Zeng, Kate Saenko", "id": "2412.07755v1", "paper_url": "http://arxiv.org/abs/2412.07755v1", "repo": "null"}}