{"2408.12996": {"publish_time": "2024-08-23", "title": "Enhancing Knowledge Tracing with Concept Map and Response Disentanglement", "paper_summary": "In the rapidly advancing realm of educational technology, it becomes critical\nto accurately trace and understand student knowledge states. Conventional\nKnowledge Tracing (KT) models have mainly focused on binary responses (i.e.,\ncorrect and incorrect answers) to questions. Unfortunately, they largely\noverlook the essential information in students' actual answer choices,\nparticularly for Multiple Choice Questions (MCQs), which could help reveal each\nlearner's misconceptions or knowledge gaps. To tackle these challenges, we\npropose the Concept map-driven Response disentanglement method for enhancing\nKnowledge Tracing (CRKT) model. CRKT benefits KT by directly leveraging answer\nchoices--beyond merely identifying correct or incorrect answers--to distinguish\nresponses with different incorrect choices. We further introduce the novel use\nof unchosen responses by employing disentangled representations to get insights\nfrom options not selected by students. Additionally, CRKT tracks the student's\nknowledge state at the concept level and encodes the concept map, representing\nthe relationships between them, to better predict unseen concepts. This\napproach is expected to provide actionable feedback, improving the learning\nexperience. Our comprehensive experiments across multiple datasets demonstrate\nCRKT's effectiveness, achieving superior performance in prediction accuracy and\ninterpretability over state-of-the-art models.", "paper_summary_zh": "在快速發展的教育科技領域中，準確追蹤和瞭解學生的知識狀態變得至關重要。傳統的知識追蹤 (KT) 模型主要關注於問題的二元回應（即正確和錯誤答案）。遺憾的是，它們在很大程度上忽視了學生實際答案選擇中的基本資訊，特別是對於多選題 (MCQ)，這有助於揭示每個學習者的誤解或知識差距。為了應對這些挑戰，我們提出了概念圖驅動的回應解開方法，以增強知識追蹤 (CRKT) 模型。CRKT 通過直接利用答案選擇（不僅僅是識別正確或錯誤答案）來區分具有不同錯誤選擇的回應，從而使 KT 受益。我們進一步介紹了未選擇回應的新穎用途，通過使用解開的表示從學生未選擇的選項中獲取見解。此外，CRKT 追蹤學生在概念層面的知識狀態，並編碼概念圖，表示它們之間的關係，以更好地預測未見概念。預計這種方法將提供可行的回饋，改善學習體驗。我們在多個資料集上進行的綜合實驗證明了 CRKT 的有效性，在預測準確性和可解釋性方面取得了優於最先進模型的卓越效能。", "author": "Soonwook Park et.al.", "authors": "Soonwook Park, Donghoon Lee, Hogun Park", "id": "2408.12996v1", "paper_url": "http://arxiv.org/abs/2408.12996v1", "repo": "https://github.com/soonwook34/crkt"}}