{"2411.15802": {"publish_time": "2024-11-24", "title": "Medical Slice Transformer: Improved Diagnosis and Explainability on 3D Medical Images with DINOv2", "paper_summary": "MRI and CT are essential clinical cross-sectional imaging techniques for\ndiagnosing complex conditions. However, large 3D datasets with annotations for\ndeep learning are scarce. While methods like DINOv2 are encouraging for 2D\nimage analysis, these methods have not been applied to 3D medical images.\nFurthermore, deep learning models often lack explainability due to their\n\"black-box\" nature. This study aims to extend 2D self-supervised models,\nspecifically DINOv2, to 3D medical imaging while evaluating their potential for\nexplainable outcomes. We introduce the Medical Slice Transformer (MST)\nframework to adapt 2D self-supervised models for 3D medical image analysis. MST\ncombines a Transformer architecture with a 2D feature extractor, i.e., DINOv2.\nWe evaluate its diagnostic performance against a 3D convolutional neural\nnetwork (3D ResNet) across three clinical datasets: breast MRI (651 patients),\nchest CT (722 patients), and knee MRI (1199 patients). Both methods were tested\nfor diagnosing breast cancer, predicting lung nodule dignity, and detecting\nmeniscus tears. Diagnostic performance was assessed by calculating the Area\nUnder the Receiver Operating Characteristic Curve (AUC). Explainability was\nevaluated through a radiologist's qualitative comparison of saliency maps based\non slice and lesion correctness. P-values were calculated using Delong's test.\nMST achieved higher AUC values compared to ResNet across all three datasets:\nbreast (0.94$\\pm$0.01 vs. 0.91$\\pm$0.02, P=0.02), chest (0.95$\\pm$0.01 vs.\n0.92$\\pm$0.02, P=0.13), and knee (0.85$\\pm$0.04 vs. 0.69$\\pm$0.05, P=0.001).\nSaliency maps were consistently more precise and anatomically correct for MST\nthan for ResNet. Self-supervised 2D models like DINOv2 can be effectively\nadapted for 3D medical imaging using MST, offering enhanced diagnostic accuracy\nand explainability compared to convolutional neural networks.", "paper_summary_zh": "<paragraph>MRI 和 CT 是诊断复杂疾病的重要临床横断面成像技术。然而，用于深度学习的大型 3D 数据集和注释却很稀缺。虽然诸如 DINOv2 之类的方法对 2D 图像分析很有帮助，但这些方法尚未应用于 3D 医学图像。此外，深度学习模型通常缺乏可解释性，因为它们具有“黑匣子”的性质。本研究旨在将 2D 自监督模型（特别是 DINOv2）扩展到 3D 医学成像，同时评估其对可解释结果的潜力。我们引入了医学切片转换器 (MST) 框架，以将 2D 自监督模型用于 3D 医学图像分析。MST 将 Transformer 架构与 2D 特征提取器（即 DINOv2）相结合。我们评估了其针对三个临床数据集（乳腺 MRI（651 名患者）、胸部 CT（722 名患者）和膝部 MRI（1199 名患者））的诊断性能，与 3D 卷积神经网络 (3D ResNet) 进行了对比。两种方法均经过测试，用于诊断乳腺癌、预测肺结节性质和检测半月板撕裂。通过计算受试者工作特征曲线下面积 (AUC) 来评估诊断性能。可解释性通过放射科医生对基于切片和病变正确性的显着性图的定性比较来评估。P 值使用 Delong 的检验计算。与所有三个数据集中的 ResNet 相比，MST 获得了更高的 AUC 值：乳腺（0.94±0.01 vs. 0.91±0.02，P=0.02）、胸部（0.95±0.01 vs. 0.92±0.02，P=0.13）和膝部（0.85±0.04 vs. 0.69±0.05，P=0.001）。与 ResNet 相比，MST 的显着性图始终更加精确且解剖学上更正确。诸如 DINOv2 之类的自监督 2D 模型可以使用 MST 有效地适应 3D 医学成像，与卷积神经网络相比，提供了增强的诊断准确性和可解释性。</paragraph>", "author": "Gustav Müller-Franzes et.al.", "authors": "Gustav Müller-Franzes, Firas Khader, Robert Siepmann, Tianyu Han, Jakob Nikolas Kather, Sven Nebelung, Daniel Truhn", "id": "2411.15802v1", "paper_url": "http://arxiv.org/abs/2411.15802v1", "repo": "https://github.com/mueller-franzes/mst"}}