{"2412.13626": {"publish_time": "2024-12-18", "title": "LIFT: Improving Long Context Understanding Through Long Input Fine-Tuning", "paper_summary": "Long context understanding remains challenging for large language models due\nto their limited context windows. This paper introduces Long Input Fine-Tuning\n(LIFT) for long context modeling, a novel framework that enhances LLM\nperformance on long-context tasks by adapting model parameters to the context\nat test time. LIFT enables efficient processing of lengthy inputs without the\ncomputational burden of offline long-context adaptation, and can improve the\nlong-context capabilities of arbitrary short-context models. The framework is\nfurther enhanced by integrating in-context learning and pre-LIFT supervised\nfine-tuning. The combination of in-context learning and LIFT enables\nshort-context models like Llama 3 to handle arbitrarily long contexts and\nconsistently improves their performance on popular long-context benchmarks like\nLooGLE and LongBench. We also provide a comprehensive analysis of the strengths\nand limitations of LIFT on long context understanding, offering valuable\ndirections for future research.", "paper_summary_zh": "大型語言模型在長文脈理解方面仍面臨挑戰，因為它們的文脈窗口有限。本文介紹了長文脈建模的長輸入微調 (LIFT)，這是一個新穎的框架，透過在測試時調整模型參數以適應文脈，增強 LLM 在長文脈任務上的效能。LIFT 能夠有效處理長輸入，而無需負擔線下長文脈適應的運算負擔，並且可以提升任意短文脈模型的長文脈能力。這個框架進一步透過整合文脈中學習和 LIFT 前的監督微調而增強。文脈中學習和 LIFT 的結合使像 Llama 3 這樣的短文脈模型能夠處理任意長的文脈，並持續提升它們在 LooGLE 和 LongBench 等熱門長文脈基準上的效能。我們也提供了 LIFT 在長文脈理解上的優點和限制的全面分析，為未來的研究提供了有價值的方向。", "author": "Yansheng Mao et.al.", "authors": "Yansheng Mao, Jiaqi Li, Fanxu Meng, Jing Xiong, Zilong Zheng, Muhan Zhang", "id": "2412.13626v1", "paper_url": "http://arxiv.org/abs/2412.13626v1", "repo": "null"}}