{"2405.08604": {"publish_time": "2024-05-14", "title": "Towards Geometry-Aware Pareto Set Learning for Neural Multi-Objective Combinatorial Optimization", "paper_summary": "Multi-objective combinatorial optimization (MOCO) problems are prevalent in\nvarious real-world applications. Most existing neural methods for MOCO problems\nrely solely on decomposition and utilize precise hypervolume to enhance\ndiversity. However, these methods often approximate only limited regions of the\nPareto front and spend excessive time on diversity enhancement because of\nambiguous decomposition and time-consuming hypervolume calculation. To address\nthese limitations, we design a Geometry-Aware Pareto set Learning algorithm\nnamed GAPL, which provides a novel geometric perspective for neural MOCO via a\nPareto attention model based on hypervolume expectation maximization. In\naddition, we propose a hypervolume residual update strategy to enable the\nPareto attention model to capture both local and non-local information of the\nPareto set/front. We also design a novel inference approach to further improve\nquality of the solution set and speed up hypervolume calculation and local\nsubset selection. Experimental results on three classic MOCO problems\ndemonstrate that our GAPL outperforms state-of-the-art neural baselines via\nsuperior decomposition and efficient diversity enhancement.", "paper_summary_zh": "多目標組合最佳化 (MOCO) 問題在各種真實世界的應用中很普遍。大多數現有的 MOCO 問題神經方法僅依賴分解，並利用精確的超體積來增強多樣性。然而，這些方法通常僅近似帕雷托前緣的有限區域，並且由於分解不明確和耗時的超體積計算而花費過多時間在多樣性增強上。為了解決這些限制，我們設計了一個名為 GAPL 的幾何感知帕雷托集學習演算法，它透過基於超體積期望最大化的帕雷托注意力模型為神經 MOCO 提供一個新穎的幾何觀點。此外，我們提出了一個超體積殘差更新策略，使帕雷托注意力模型能夠擷取帕雷托集/前緣的局部和非局部資訊。我們還設計了一種新穎的推論方法，以進一步提高解集的品質，並加快超體積計算和局部子集選擇。在三個經典 MOCO 問題上的實驗結果證明，我們的 GAPL 透過優異的分解和有效的多樣性增強，優於最先進的神經基準。", "author": "Yongfan Lu et.al.", "authors": "Yongfan Lu, Zixiang Di, Bingdong Li, Shengcai Liu, Hong Qian, Peng Yang, Ke Tang, Aimin Zhou", "id": "2405.08604v1", "paper_url": "http://arxiv.org/abs/2405.08604v1", "repo": "null"}}