{"2406.11674": {"publish_time": "2024-06-17", "title": "Endor: Hardware-Friendly Sparse Format for Offloaded LLM Inference", "paper_summary": "The increasing size of large language models (LLMs) challenges their usage on\nresource-constrained platforms. For example, memory on modern GPUs is\ninsufficient to hold LLMs that are hundreds of Gigabytes in size. Offloading is\na popular method to escape this constraint by storing weights of an LLM model\nto host CPU memory and SSD, then loading each weight to GPU before every use.\nIn our case study of offloaded inference, we found that due to the low\nbandwidth between storage devices and GPU, the latency of transferring large\nmodel weights from its offloaded location to GPU memory becomes the critical\nbottleneck with actual compute taking nearly 0% of runtime. To effectively\nreduce the weight transfer latency, we propose a novel sparse format that\ncompresses the unstructured sparse pattern of pruned LLM weights to non-zero\nvalues with high compression ratio and low decompression overhead. Endor\nachieves this by expressing the positions of non-zero elements with a bitmap.\nCompared to offloaded inference using the popular Huggingface Accelerate,\napplying Endor accelerates OPT-66B by 1.70x and Llama2-70B by 1.78x. When\ndirect weight transfer from SSD to GPU is leveraged, Endor achieves 2.25x\nspeedup on OPT-66B and 2.37x speedup on Llama2-70B.", "paper_summary_zh": "大型语言模型 (LLM) 的尺寸越来越大，对资源受限平台上的使用构成挑战。例如，现代 GPU 上的内存不足以容纳数百 GB 大小的 LLM。卸载是一种流行的方法，可以通过将 LLM 模型的权重存储到主机 CPU 内存和 SSD 中来摆脱此限制，然后在每次使用之前将每个权重加载到 GPU 中。在我们的卸载推理案例研究中，我们发现由于存储设备和 GPU 之间的带宽较低，将大型模型权重从其卸载位置传输到 GPU 内存的延迟成为关键瓶颈，实际计算仅占运行时的 0%。为了有效减少权重传输延迟，我们提出了一种新颖的稀疏格式，该格式将修剪的 LLM 权重的非结构化稀疏模式压缩为非零值，具有高压缩比和低解压缩开销。Endor 通过使用位图表示非零元素的位置来实现这一点。与使用流行的 Huggingface Accelerate 进行卸载推理相比，应用 Endor 可将 OPT-66B 加速 1.70 倍，将 Llama2-70B 加速 1.78 倍。当利用从 SSD 到 GPU 的直接权重传输时，Endor 在 OPT-66B 上实现了 2.25 倍的加速，在 Llama2-70B 上实现了 2.37 倍的加速。", "author": "Donghyeon Joo et.al.", "authors": "Donghyeon Joo, Ramyad Hadidi, Soheil Feizi, Bahar Asgari", "id": "2406.11674v1", "paper_url": "http://arxiv.org/abs/2406.11674v1", "repo": "null"}}