{"2405.21070": {"publish_time": "2024-05-31", "title": "Generalization Beyond Data Imbalance: A Controlled Study on CLIP for Transferable Insights", "paper_summary": "Severe data imbalance naturally exists among web-scale vision-language\ndatasets. Despite this, we find CLIP pre-trained thereupon exhibits notable\nrobustness to the data imbalance compared to supervised learning, and\ndemonstrates significant effectiveness in learning generalizable\nrepresentations. With an aim to investigate the reasons behind this finding, we\nconduct controlled experiments to study various underlying factors, and reveal\nthat CLIP's pretext task forms a dynamic classification problem wherein only a\nsubset of classes is present in training. This isolates the bias from dominant\nclasses and implicitly balances the learning signal. Furthermore, the\nrobustness and discriminability of CLIP improve with more descriptive language\nsupervision, larger data scale, and broader open-world concepts, which are\ninaccessible to supervised learning. Our study not only uncovers the mechanisms\nbehind CLIP's generalizability beyond data imbalance but also provides\ntransferable insights for the research community. The findings are validated in\nboth supervised and self-supervised learning, enabling models trained on\nimbalanced data to achieve CLIP-level performance on diverse recognition tasks.\nCode will be available at: https://github.com/CVMI-Lab/clip-beyond-tail.", "paper_summary_zh": "嚴重的資料不平衡自然存在於網路規模的視覺語言資料集中。儘管如此，我們發現預先訓練於其上的 CLIP 對資料不平衡展現出顯著的穩健性，與監督學習相比，並展現出學習可概化表徵的顯著效能。為了調查此發現背後的原因，我們進行受控實驗以研究各種潛在因素，並揭示 CLIP 的藉口任務形成一個動態分類問題，其中只有一個子集的類別存在於訓練中。這會從主要類別中分離出偏差，並隱含地平衡學習訊號。此外，CLIP 的穩健性和辨別力會隨著更具描述性的語言監督、更大的資料規模和更廣泛的開放世界概念而改善，而這些概念對於監督學習來說是無法取得的。我們的研究不僅揭示了 CLIP 在資料不平衡之外的概化能力背後的機制，也為研究社群提供了可轉移的見解。這些發現已在監督式和自監督式學習中得到驗證，讓在不平衡資料上訓練的模型能夠在各種辨識任務中達到 CLIP 等級的效能。程式碼將於下列位置提供：https://github.com/CVMI-Lab/clip-beyond-tail。", "author": "Xin Wen et.al.", "authors": "Xin Wen, Bingchen Zhao, Yilun Chen, Jiangmiao Pang, Xiaojuan Qi", "id": "2405.21070v1", "paper_url": "http://arxiv.org/abs/2405.21070v1", "repo": "https://github.com/cvmi-lab/clip-beyond-tail"}}