{"2407.13906": {"publish_time": "2024-07-18", "title": "Crafting Efficient Fine-Tuning Strategies for Large Language Models", "paper_summary": "This paper addresses the challenges of efficiently fine-tuning large language\nmodels (LLMs) by exploring data efficiency and hyperparameter optimization. We\ninvestigate the minimum data required for effective fine-tuning and propose a\nnovel hyperparameter optimization method that leverages early-stage model\nperformance. Our experiments demonstrate that fine-tuning with as few as 200\nsamples can improve model accuracy from 70\\% to 88\\% in a product attribute\nextraction task. We identify a saturation point of approximately 6,500 samples,\nbeyond which additional data yields diminishing returns. Our proposed bayesian\nhyperparameter optimization method, which evaluates models at 20\\% of total\ntraining time, correlates strongly with final model performance, with 4 out of\n5 top early-stage models remaining in the top 5 at completion. This approach\nled to a 2\\% improvement in accuracy over baseline models when evaluated on an\nindependent test set. These findings offer actionable insights for\npractitioners, potentially reducing computational load and dependency on\nextensive datasets while enhancing overall performance of fine-tuned LLMs.", "paper_summary_zh": "本文探討有效微調大型語言模型 (LLM) 所面臨的挑戰，方法是探索資料效率和超參數最佳化。我們探討有效微調所需的最低資料量，並提出一個創新的超參數最佳化方法，該方法利用早期階段的模型效能。我們的實驗證明，在產品屬性萃取任務中，使用僅 200 個範例進行微調，就能將模型準確度從 70% 提升至 88%。我們找出一個約 6,500 個範例的飽和點，超過此點後，額外的資料會產生遞減報酬。我們提出的貝氏超參數最佳化方法，會在總訓練時間的 20% 評估模型，與最終模型效能高度相關，5 個頂尖早期階段模型中有 4 個在完成時仍維持在頂尖 5 名。此方法在獨立測試集上評估時，準確度比基準模型提升了 2%。這些發現為實務工作者提供可行的見解，有可能在提升微調 LLM 的整體效能的同時，降低運算負載和對龐大資料集的依賴性。", "author": "Michael Oliver et.al.", "authors": "Michael Oliver, Guan Wang", "id": "2407.13906v1", "paper_url": "http://arxiv.org/abs/2407.13906v1", "repo": "null"}}