{"2406.13705": {"publish_time": "2024-06-19", "title": "EndoUIC: Promptable Diffusion Transformer for Unified Illumination Correction in Capsule Endoscopy", "paper_summary": "Wireless Capsule Endoscopy (WCE) is highly valued for its non-invasive and\npainless approach, though its effectiveness is compromised by uneven\nillumination from hardware constraints and complex internal dynamics, leading\nto overexposed or underexposed images. While researchers have discussed the\nchallenges of low-light enhancement in WCE, the issue of correcting for\ndifferent exposure levels remains underexplored. To tackle this, we introduce\nEndoUIC, a WCE unified illumination correction solution using an end-to-end\npromptable diffusion transformer (DFT) model. In our work, the illumination\nprompt module shall navigate the model to adapt to different exposure levels\nand perform targeted image enhancement, in which the Adaptive Prompt\nIntegration (API) and Global Prompt Scanner (GPS) modules shall further boost\nthe concurrent representation learning between the prompt parameters and\nfeatures. Besides, the U-shaped restoration DFT model shall capture the\nlong-range dependencies and contextual information for unified illumination\nrestoration. Moreover, we present a novel Capsule-endoscopy Exposure Correction\n(CEC) dataset, including ground-truth and corrupted image pairs annotated by\nexpert photographers. Extensive experiments against a variety of\nstate-of-the-art (SOTA) methods on four datasets showcase the effectiveness of\nour proposed method and components in WCE illumination restoration, and the\nadditional downstream experiments further demonstrate its utility for clinical\ndiagnosis and surgical assistance.", "paper_summary_zh": "無線膠囊內視鏡（WCE）因其非侵入性和無痛的方法而備受重視，儘管其有效性受到硬體限制和複雜內部動力學導致照明不均的影響，導致影像曝光過度或曝光不足。儘管研究人員已討論 WCE 中低光增強的挑戰，但針對不同曝光等級進行校正的問題仍未得到充分探討。為了解決這個問題，我們引入了 EndoUIC，這是一個使用端到端可提示擴散轉換器 (DFT) 模型的 WCE 統一照明校正解決方案。在我們的研究中，照明提示模組應引導模型適應不同的曝光等級並執行目標影像增強，其中自適應提示整合 (API) 和全局提示掃描器 (GPS) 模組應進一步提升提示參數和特徵之間的並發表示學習。此外，U 形復原 DFT 模型應捕捉長距離依賴關係和脈絡資訊，以進行統一照明復原。此外，我們提出了創新的膠囊內視鏡曝光校正 (CEC) 資料集，其中包括由專業攝影師註解的真實和損壞影像對。針對四個資料集的各種最新 (SOTA) 方法進行的廣泛實驗展示了我們提出的方法和組成在 WCE 照明復原中的有效性，而額外的下游實驗進一步證明了其在臨床診斷和手術輔助中的效用。", "author": "Long Bai et.al.", "authors": "Long Bai, Qiaozhi Tan, Tong Chen, Wan Jun Nah, Yanheng Li, Zhicheng He, Sishen Yuan, Zhen Chen, Jinlin Wu, Mobarakol Islam, Zhen Li, Hongbin Liu, Hongliang Ren", "id": "2406.13705v1", "paper_url": "http://arxiv.org/abs/2406.13705v1", "repo": "https://github.com/longbai1006/endouic"}}