{"2412.06717": {"publish_time": "2024-12-09", "title": "Toward Non-Invasive Diagnosis of Bankart Lesions with Deep Learning", "paper_summary": "Bankart lesions, or anterior-inferior glenoid labral tears, are\ndiagnostically challenging on standard MRIs due to their subtle imaging\nfeatures-often necessitating invasive MRI arthrograms (MRAs). This study\ndevelops deep learning (DL) models to detect Bankart lesions on both standard\nMRIs and MRAs, aiming to improve diagnostic accuracy and reduce reliance on\nMRAs. We curated a dataset of 586 shoulder MRIs (335 standard, 251 MRAs) from\n558 patients who underwent arthroscopy. Ground truth labels were derived from\nintraoperative findings, the gold standard for Bankart lesion diagnosis.\nSeparate DL models for MRAs and standard MRIs were trained using the Swin\nTransformer architecture, pre-trained on a public knee MRI dataset. Predictions\nfrom sagittal, axial, and coronal views were ensembled to optimize performance.\nThe models were evaluated on a 20% hold-out test set (117 MRIs: 46 MRAs, 71\nstandard MRIs). Bankart lesions were identified in 31.9% of MRAs and 8.6% of\nstandard MRIs. The models achieved AUCs of 0.87 (86% accuracy, 83% sensitivity,\n86% specificity) and 0.90 (85% accuracy, 82% sensitivity, 86% specificity) on\nstandard MRIs and MRAs, respectively. These results match or surpass\nradiologist performance on our dataset and reported literature metrics.\nNotably, our model's performance on non-invasive standard MRIs matched or\nsurpassed the radiologists interpreting MRAs. This study demonstrates the\nfeasibility of using DL to address the diagnostic challenges posed by subtle\npathologies like Bankart lesions. Our models demonstrate potential to improve\ndiagnostic confidence, reduce reliance on invasive imaging, and enhance\naccessibility to care.", "paper_summary_zh": "Bankart 病灶，或前下盂唇撕裂，由於其影像特徵微妙，在標準核磁共振成像中診斷具有挑戰性，通常需要侵入性核磁共振血管造影 (MRA)。本研究開發深度學習 (DL) 模型，用於在標準核磁共振成像和核磁共振血管造影中檢測 Bankart 病灶，旨在提高診斷準確性並減少對核磁共振血管造影的依賴。我們從 558 名接受關節鏡檢查的患者中策劃了一組 586 例肩部核磁共振成像 (335 例標準，251 例核磁共振血管造影) 的數據集。基本事實標籤來自術中發現，這是 Bankart 病灶診斷的黃金標準。使用 Swin Transformer 架構訓練了核磁共振血管造影和標準核磁共振成像的單獨深度學習模型，並在公開的膝部核磁共振成像數據集上進行預訓練。矢狀面、軸面和冠狀面的預測結果被組合起來以優化性能。這些模型在 20% 的保留測試集（117 例核磁共振成像：46 例核磁共振血管造影，71 例標準核磁共振成像）上進行了評估。在 31.9% 的核磁共振血管造影和 8.6% 的標準核磁共振成像中發現了 Bankart 病灶。這些模型在標準核磁共振成像和核磁共振血管造影中的 AUC 分別達到 0.87（86% 準確度，83% 靈敏度，86% 特異度）和 0.90（85% 準確度，82% 靈敏度，86% 特異度）。這些結果與放射科醫生對我們數據集的表現相匹配或超過，並超過了報告的文獻指標。值得注意的是，我們的模型在非侵入性標準核磁共振成像中的表現與放射科醫生對核磁共振血管造影的解釋相匹配或超過。本研究證明了使用深度學習來解決 Bankart 病灶等微妙病理診斷挑戰的可行性。我們的模型展示了提高診斷信心、減少對侵入性影像檢查的依賴以及增強獲得照護的機會的潛力。", "author": "Sahil Sethi et.al.", "authors": "Sahil Sethi, Sai Reddy, Mansi Sakarvadia, Jordan Serotte, Darlington Nwaudo, Nicholas Maassen, Lewis Shi", "id": "2412.06717v1", "paper_url": "http://arxiv.org/abs/2412.06717v1", "repo": "null"}}