{"2503.24381": {"publish_time": "2025-03-31", "title": "UniOcc: A Unified Benchmark for Occupancy Forecasting and Prediction in Autonomous Driving", "paper_summary": "We introduce UniOcc, a comprehensive, unified benchmark for occupancy\nforecasting (i.e., predicting future occupancies based on historical\ninformation) and current-frame occupancy prediction from camera images. UniOcc\nunifies data from multiple real-world datasets (i.e., nuScenes, Waymo) and\nhigh-fidelity driving simulators (i.e., CARLA, OpenCOOD), which provides 2D/3D\noccupancy labels with per-voxel flow annotations and support for cooperative\nautonomous driving. In terms of evaluation, unlike existing studies that rely\non suboptimal pseudo labels for evaluation, UniOcc incorporates novel metrics\nthat do not depend on ground-truth occupancy, enabling robust assessment of\nadditional aspects of occupancy quality. Through extensive experiments on\nstate-of-the-art models, we demonstrate that large-scale, diverse training data\nand explicit flow information significantly enhance occupancy prediction and\nforecasting performance.", "paper_summary_zh": "我們介紹 UniOcc，一個用於佔據率預測（即基於歷史資訊預測未來佔據率）和基於攝影機圖像的當前幀佔據率預測的綜合性統一基準測試。UniOcc 整合了來自多個真實世界數據集（即 nuScenes、Waymo）和高保真駕駛模擬器（即 CARLA、OpenCOOD）的數據，提供了帶有每個體素流動註釋的 2D/3D 佔據率標籤，並支援協同自動駕駛。在評估方面，與現有研究依賴次優的偽標籤進行評估不同，UniOcc 納入了不依賴於真實佔據率的新穎指標，從而能夠對佔據率品質的其他方面進行穩健的評估。透過對最先進模型的廣泛實驗，我們證明了大規模、多樣的訓練數據和明確的流動資訊可以顯著提高佔據率預測和預報效能。\n", "author": "Yuping Wang et.al.", "authors": "Yuping Wang, Xiangyu Huang, Xiaokang Sun, Mingxuan Yan, Shuo Xing, Zhengzhong Tu, Jiachen Li", "id": "2503.24381v1", "paper_url": "http://arxiv.org/abs/2503.24381v1", "repo": "https://github.com/tasl-lab/uniocc"}}