{"2407.03018": {"publish_time": "2024-07-03", "title": "An Organism Starts with a Single Pix-Cell: A Neural Cellular Diffusion for High-Resolution Image Synthesis", "paper_summary": "Generative modeling seeks to approximate the statistical properties of real\ndata, enabling synthesis of new data that closely resembles the original\ndistribution. Generative Adversarial Networks (GANs) and Denoising Diffusion\nProbabilistic Models (DDPMs) represent significant advancements in generative\nmodeling, drawing inspiration from game theory and thermodynamics,\nrespectively. Nevertheless, the exploration of generative modeling through the\nlens of biological evolution remains largely untapped. In this paper, we\nintroduce a novel family of models termed Generative Cellular Automata (GeCA),\ninspired by the evolution of an organism from a single cell. GeCAs are\nevaluated as an effective augmentation tool for retinal disease classification\nacross two imaging modalities: Fundus and Optical Coherence Tomography (OCT).\nIn the context of OCT imaging, where data is scarce and the distribution of\nclasses is inherently skewed, GeCA significantly boosts the performance of 11\ndifferent ophthalmological conditions, achieving a 12% increase in the average\nF1 score compared to conventional baselines. GeCAs outperform both diffusion\nmethods that incorporate UNet or state-of-the art variants with\ntransformer-based denoising models, under similar parameter constraints. Code\nis available at: https://github.com/xmed-lab/GeCA.", "paper_summary_zh": "生成式建模旨在逼近真實資料的統計屬性，能夠合成與原始分佈極為相似的全新資料。生成對抗網路 (GAN) 和去噪擴散機率模型 (DDPM) 分別從博弈論和熱力學中汲取靈感，代表生成式建模的重大進展。儘管如此，透過生物演化的觀點來探索生成式建模在很大程度上仍未開發。在本文中，我們引進一個新的模型家族，稱為生成式細胞自動機 (GeCA)，靈感來自單一細胞演化成一個有機體的過程。GeCA 被評估為視網膜疾病分類的有效擴充工具，涵蓋兩種影像模式：眼底和光學相干斷層掃描 (OCT)。在 OCT 影像的脈絡中，資料稀少且類別分佈本質上偏斜，GeCA 大幅提升了 11 種不同眼科疾病的效能，與傳統基準相比，平均 F1 分數提高了 12%。在類似的參數約束下，GeCA 的表現優於結合 UNet 的擴散方法或採用基於 Transformer 去噪模型的最新變體。程式碼可於 https://github.com/xmed-lab/GeCA 取得。", "author": "Marawan Elbatel et.al.", "authors": "Marawan Elbatel, Konstantinos Kamnitsas, Xiaomeng Li", "id": "2407.03018v1", "paper_url": "http://arxiv.org/abs/2407.03018v1", "repo": "null"}}