{"2412.19562": {"publish_time": "2024-12-27", "title": "Hindsight Planner: A Closed-Loop Few-Shot Planner for Embodied Instruction Following", "paper_summary": "This work focuses on building a task planner for Embodied Instruction\nFollowing (EIF) using Large Language Models (LLMs). Previous works typically\ntrain a planner to imitate expert trajectories, treating this as a supervised\ntask. While these methods achieve competitive performance, they often lack\nsufficient robustness. When a suboptimal action is taken, the planner may\nencounter an out-of-distribution state, which can lead to task failure. In\ncontrast, we frame the task as a Partially Observable Markov Decision Process\n(POMDP) and aim to develop a robust planner under a few-shot assumption. Thus,\nwe propose a closed-loop planner with an adaptation module and a novel\nhindsight method, aiming to use as much information as possible to assist the\nplanner. Our experiments on the ALFRED dataset indicate that our planner\nachieves competitive performance under a few-shot assumption. For the first\ntime, our few-shot agent's performance approaches and even surpasses that of\nthe full-shot supervised agent.", "paper_summary_zh": "本研究重點在於使用大型語言模型（LLM）建立具身化指示（EIF）任務規劃器。先前的研究通常訓練規劃器模仿專家軌跡，將此視為有監督任務。儘管這些方法能達到競爭性的效能，但它們通常缺乏足夠的穩健性。當採取次優行動時，規劃器可能會遇到分布外狀態，這可能會導致任務失敗。相反地，我們將任務設定為部分可觀察馬可夫決策過程（POMDP），並旨在根據少量範例假設開發穩健的規劃器。因此，我們提出了一個具有適應模組和新穎回顧方法的閉迴路規劃器，旨在使用盡可能多的資訊來協助規劃器。我們在 ALFRED 資料集上的實驗表明，我們的規劃器在少量範例假設下能達到競爭性的效能。首次，我們的少量範例代理效能接近甚至超越全範例監督代理。", "author": "Yuxiao Yang et.al.", "authors": "Yuxiao Yang, Shenao Zhang, Zhihan Liu, Huaxiu Yao, Zhaoran Wang", "id": "2412.19562v1", "paper_url": "http://arxiv.org/abs/2412.19562v1", "repo": "null"}}