{"2412.03205": {"publish_time": "2024-12-04", "title": "U-MATH: A University-Level Benchmark for Evaluating Mathematical Skills in LLMs", "paper_summary": "The current evaluation of mathematical skills in LLMs is limited, as existing\nbenchmarks are either relatively small, primarily focus on elementary and\nhigh-school problems, or lack diversity in topics. Additionally, the inclusion\nof visual elements in tasks remains largely under-explored.\n  To address these gaps, we introduce U-MATH, a novel benchmark of 1,100\nunpublished open-ended university-level problems sourced from teaching\nmaterials. It is balanced across six core subjects, with 20% of multimodal\nproblems. Given the open-ended nature of U-MATH problems, we employ an LLM to\njudge the correctness of generated solutions. To this end, we release\n$\\mu$-MATH, a dataset to evaluate the LLMs' capabilities in judging solutions.\n  The evaluation of general domain, math-specific, and multimodal LLMs\nhighlights the challenges presented by U-MATH. Our findings reveal that LLMs\nachieve a maximum accuracy of only 63% on text-based tasks, with even lower 45%\non visual problems. The solution assessment proves challenging for LLMs, with\nthe best LLM judge having an F1-score of 80% on $\\mu$-MATH.", "paper_summary_zh": "現有評估 LLM 數學技能的標準有限，因為現有基準要不規模較小、主要著重於小學和高中問題，要不缺乏主題多元性。此外，任務中包含視覺元素的部分仍未得到充分探討。\n為了解決這些差距，我們引入了 U-MATH，這是一個由教學材料中蒐集的 1,100 個未發表的開放式大學程度問題的新基準。它涵蓋六個核心科目，20% 為多模態問題。鑑於 U-MATH 問題的開放式性質，我們採用 LLM 來判斷所產生解法的正確性。為此，我們發布了 $\\mu$-MATH，一個用於評估 LLM 判斷解題能力的資料集。\n對一般領域、特定數學和多模態 LLM 的評估突顯了 U-MATH 所帶來的挑戰。我們的研究結果顯示，LLM 在基於文字的任務上僅達到 63% 的最高準確度，在視覺問題上甚至更低，只有 45%。解題評估對 LLM 來說具有挑戰性，最佳 LLM 評審在 $\\mu$-MATH 上的 F1 分數為 80%。", "author": "Konstantin Chernyshev et.al.", "authors": "Konstantin Chernyshev, Vitaliy Polshkov, Ekaterina Artemova, Alex Myasnikov, Vlad Stepanov, Alexei Miasnikov, Sergei Tilga", "id": "2412.03205v1", "paper_url": "http://arxiv.org/abs/2412.03205v1", "repo": "null"}}