{"2409.17819": {"publish_time": "2024-09-26", "title": "Inference-Time Language Model Alignment via Integrated Value Guidance", "paper_summary": "Large language models are typically fine-tuned to align with human\npreferences, but tuning large models is computationally intensive and complex.\nIn this work, we introduce $\\textit{Integrated Value Guidance}$ (IVG), a method\nthat uses implicit and explicit value functions to guide language model\ndecoding at token and chunk-level respectively, efficiently aligning large\nlanguage models purely at inference time. This approach circumvents the\ncomplexities of direct fine-tuning and outperforms traditional methods.\nEmpirically, we demonstrate the versatility of IVG across various tasks. In\ncontrolled sentiment generation and summarization tasks, our method\nsignificantly improves the alignment of large models using inference-time\nguidance from $\\texttt{gpt2}$-based value functions. Moreover, in a more\nchallenging instruction-following benchmark AlpacaEval 2.0, we show that both\nspecifically tuned and off-the-shelf value functions greatly improve the\nlength-controlled win rates of large models against $\\texttt{gpt-4-turbo}$\n(e.g., $19.51\\% \\rightarrow 26.51\\%$ for $\\texttt{Mistral-7B-Instruct-v0.2}$\nand $25.58\\% \\rightarrow 33.75\\%$ for $\\texttt{Mixtral-8x7B-Instruct-v0.1}$\nwith Tulu guidance).", "paper_summary_zh": "大型語言模型通常經過微調以符合人類偏好，但調整大型模型在計算上很密集且複雜。在這項工作中，我們介紹了「整合價值引導」(IVG)，一種使用隱式和顯式價值函數來分別在符號和區塊層級引導語言模型解碼的方法，有效地在純粹的推論時間調整大型語言模型。這種方法避開了直接微調的複雜性，並且優於傳統方法。根據經驗，我們展示了 IVG 在各種任務中的多功能性。在受控情緒生成和摘要任務中，我們的方法使用基於 gpt2 的價值函數的推論時間引導，顯著改善了大型模型的對齊。此外，在更具挑戰性的指令遵循基準 AlpacaEval 2.0 中，我們表明專門調整和現成的價值函數都大大提高了大型模型對 gpt-4-turbo 的長度控制勝率（例如，Mistral-7B-Instruct-v0.2 為 19.51% → 26.51%，Mixtral-8x7B-Instruct-v0.1 使用 Tulu 指導為 25.58% → 33.75%）。", "author": "Zhixuan Liu et.al.", "authors": "Zhixuan Liu, Zhanhui Zhou, Yuanfu Wang, Chao Yang, Yu Qiao", "id": "2409.17819v1", "paper_url": "http://arxiv.org/abs/2409.17819v1", "repo": "null"}}