{"2501.08579": {"publish_time": "2025-01-15", "title": "What Limits LLM-based Human Simulation: LLMs or Our Design?", "paper_summary": "We argue that advancing LLM-based human simulation requires addressing both\nLLM's inherent limitations and simulation framework design challenges. Recent\nstudies have revealed significant gaps between LLM-based human simulations and\nreal-world observations, highlighting these dual challenges. To address these\ngaps, we present a comprehensive analysis of LLM limitations and our design\nissues, proposing targeted solutions for both aspects. Furthermore, we explore\nfuture directions that address both challenges simultaneously, particularly in\ndata collection, LLM generation, and evaluation. To support further research in\nthis field, we provide a curated collection of LLM-based human simulation\nresources.\\footnote{https://github.com/Persdre/llm-human-simulation}", "paper_summary_zh": "我們認為，要推進基於 LLM 的人類模擬，需要解決 LLM 本身的限制和模擬框架設計挑戰。最近的研究表明，基於 LLM 的人類模擬與真實世界的觀察之間存在顯著差距，凸顯了這兩個挑戰。為了應對這些差距，我們對 LLM 的限制和我們的設計問題進行了全面的分析，並針對這兩個方面提出了有針對性的解決方案。此外，我們還探討了同時應對這兩個挑戰的未來方向，特別是在數據收集、LLM 生成和評估方面。為了支持該領域的進一步研究，我們提供了一系列經過整理的基於 LLM 的人類模擬資源。\\footnote{https://github.com/Persdre/llm-human-simulation}", "author": "Qian Wang et.al.", "authors": "Qian Wang, Jiaying Wu, Zhenheng Tang, Bingqiao Luo, Nuo Chen, Wei Chen, Bingsheng He", "id": "2501.08579v1", "paper_url": "http://arxiv.org/abs/2501.08579v1", "repo": "null"}}