{"2410.11516": {"publish_time": "2024-10-15", "title": "TopoLM: brain-like spatio-functional organization in a topographic language model", "paper_summary": "Neurons in the brain are spatially organized such that neighbors on tissue\noften exhibit similar response profiles. In the human language system,\nexperimental studies have observed clusters for syntactic and semantic\ncategories, but the mechanisms underlying this functional organization remain\nunclear. Here, building on work from the vision literature, we develop TopoLM,\na transformer language model with an explicit two-dimensional spatial\nrepresentation of model units. By combining a next-token prediction objective\nwith a spatial smoothness loss, representations in this model assemble into\nclusters that correspond to semantically interpretable groupings of text and\nclosely match the functional organization in the brain's language system.\nTopoLM successfully predicts the emergence of the spatio-functional\norganization of a cortical language system as well as the organization of\nfunctional clusters selective for fine-grained linguistic features empirically\nobserved in human cortex. Our results suggest that the functional organization\nof the human language system is driven by a unified spatial objective, and\nprovide a functionally and spatially aligned model of language processing in\nthe brain.", "paper_summary_zh": "大腦中的神經元在空間上具有組織性，因此組織中的鄰居通常表現出相似的反應模式。在人類語言系統中，實驗研究已經觀察到句法和語義類別的群集，但這種功能組織背後的機制仍不清楚。在此，我們建立在視覺文獻的工作基礎上，開發了 TopoLM，這是一個具有模型單元明確的二維空間表示形式的Transformer語言模型。通過將下一個標記預測目標與空間平滑損失相結合，此模型中的表示組裝成對應於語義可解釋的文本分組的群集，並且與大腦語言系統中的功能組織密切匹配。TopoLM 成功預測了皮質語言系統的時空功能組織的出現，以及在人類皮質中經驗觀察到的對細粒度語言特徵具有選擇性的功能群集的組織。我們的結果表明，人類語言系統的功能組織是由統一的空間目標驅動的，並在大腦中提供了語言處理的功能和空間對齊模型。", "author": "Neil Rathi et.al.", "authors": "Neil Rathi, Johannes Mehrer, Badr AlKhamissi, Taha Binhuraib, Nicholas M. Blauch, Martin Schrimpf", "id": "2410.11516v1", "paper_url": "http://arxiv.org/abs/2410.11516v1", "repo": "null"}}