{"2502.02872": {"publish_time": "2025-02-05", "title": "Achieving Operational Universality through a Turing Complete Chemputer", "paper_summary": "The most fundamental abstraction underlying all modern computers is the\nTuring Machine, that is if any modern computer can simulate a Turing Machine,\nan equivalence which is called Turing completeness, it is theoretically\npossible to achieve any task that can be algorithmically described by executing\na series of discrete unit operations. In chemistry, the ability to program\nchemical processes is demanding because it is hard to ensure that the process\ncan be understood at a high level of abstraction, and then reduced to practice.\nHerein we exploit the concept of Turing completeness applied to robotic\nplatforms for chemistry that can be used to synthesise complex molecules\nthrough unit operations that execute chemical processes using a\nchemically-aware programming language, XDL. We leverage the concept of\ncomputability by computers to synthesizability of chemical compounds by\nautomated synthesis machines. The results of an interactive demonstration of\nTuring completeness using the colour gamut and conditional logic are presented\nand examples of chemical use-cases are discussed. Over 16.7 million\ncombinations of Red, Green, Blue (RGB) colour space were binned into 5 discrete\nvalues and measured over 10 regions of interest (ROIs), affording 78 million\npossible states per step and served as a proxy for conceptual, chemical space\nexploration. This formal description establishes a formal framework in future\nchemical programming languages to ensure complex logic operations are expressed\nand executed correctly, with the possibility of error correction, in the\nautomated and autonomous pursuit of increasingly complex molecules.", "paper_summary_zh": "最基本的抽象基礎在於所有現代電腦的圖靈機，也就是說，如果任何現代電腦可以模擬圖靈機，一個稱為圖靈完備性的等價性，理論上可以達成任何任務，這些任務可以透過執行一系列離散單元運算，以演算法方式描述。在化學中，程式化化學程序的能力很要求人，因為難以確保該程序可以在高層次抽象中理解，然後化繁為簡。在此，我們利用圖靈完備性的概念，應用於機器人平台，用於化學，可以使用化學感知程式語言 XDL，透過執行化學程序的單元運算，來合成複雜分子。我們利用電腦的運算能力來合成化學化合物，透過自動化合成機器。使用色域和條件邏輯，展示圖靈完備性的互動示範結果，並討論化學使用案例的範例。超過 1,670 萬種紅、綠、藍 (RGB) 色彩空間組合，被分組成 5 個離散值，並在 10 個感興趣區域 (ROI) 中測量，提供每一步驟 7,800 萬種可能的狀態，並作為概念性化學空間探索的代理。此正式說明建立一個正式架構，在未來的化學程式語言中，以確保複雜邏輯運算可以正確表達和執行，並在自動化和自主追求日益複雜的分子時，有錯誤修正的可能性。", "author": "Daniel Gahler et.al.", "authors": "Daniel Gahler, Dean Thomas, Slawomir Lach, Leroy Cronin", "id": "2502.02872v1", "paper_url": "http://arxiv.org/abs/2502.02872v1", "repo": "null"}}