{"2410.03430": {"publish_time": "2024-10-04", "title": "Images Speak Volumes: User-Centric Assessment of Image Generation for Accessible Communication", "paper_summary": "Explanatory images play a pivotal role in accessible and easy-to-read (E2R)\ntexts. However, the images available in online databases are not tailored\ntoward the respective texts, and the creation of customized images is\nexpensive. In this large-scale study, we investigated whether text-to-image\ngeneration models can close this gap by providing customizable images quickly\nand easily. We benchmarked seven, four open- and three closed-source, image\ngeneration models and provide an extensive evaluation of the resulting images.\nIn addition, we performed a user study with people from the E2R target group to\nexamine whether the images met their requirements. We find that some of the\nmodels show remarkable performance, but none of the models are ready to be used\nat a larger scale without human supervision. Our research is an important step\ntoward facilitating the creation of accessible information for E2R creators and\ntailoring accessible images to the target group's needs.", "paper_summary_zh": "說明性圖片在無障礙且易於閱讀 (E2R) 的文字中扮演著關鍵角色。然而，線上資料庫中提供的圖片並非針對特定文字量身打造，而自訂圖片的製作成本又很高。在此項大規模研究中，我們調查文字轉圖片生成模型是否能快速且輕鬆地提供自訂圖片，以填補此一缺口。我們對七種圖片生成模型進行評比，其中四種為開放原始碼，三種為閉源，並對產出的圖片進行廣泛評估。此外，我們針對 E2R 目標族群進行使用者研究，以檢視圖片是否符合他們的需求。我們發現某些模型表現傑出，但若沒有人工監督，所有模型都無法大規模使用。我們的研究對於協助 E2R 創作人員製作無障礙資訊，並根據目標族群的需求量身打造無障礙圖片，是一個重要的進展。", "author": "Miriam Anschütz et.al.", "authors": "Miriam Anschütz, Tringa Sylaj, Georg Groh", "id": "2410.03430v1", "paper_url": "http://arxiv.org/abs/2410.03430v1", "repo": "null"}}