{"2405.17022": {"publish_time": "2024-05-27", "title": "Compositional Few-Shot Class-Incremental Learning", "paper_summary": "Few-shot class-incremental learning (FSCIL) is proposed to continually learn\nfrom novel classes with only a few samples after the (pre-)training on base\nclasses with sufficient data. However, this remains a challenge. In contrast,\nhumans can easily recognize novel classes with a few samples. Cognitive science\ndemonstrates that an important component of such human capability is\ncompositional learning. This involves identifying visual primitives from\nlearned knowledge and then composing new concepts using these transferred\nprimitives, making incremental learning both effective and interpretable. To\nimitate human compositional learning, we propose a cognitive-inspired method\nfor the FSCIL task. We define and build a compositional model based on set\nsimilarities, and then equip it with a primitive composition module and a\nprimitive reuse module. In the primitive composition module, we propose to\nutilize the Centered Kernel Alignment (CKA) similarity to approximate the\nsimilarity between primitive sets, allowing the training and evaluation based\non primitive compositions. In the primitive reuse module, we enhance primitive\nreusability by classifying inputs based on primitives replaced with the closest\nprimitives from other classes. Experiments on three datasets validate our\nmethod, showing it outperforms current state-of-the-art methods with improved\ninterpretability. Our code is available at\nhttps://github.com/Zoilsen/Comp-FSCIL.", "paper_summary_zh": "少樣本類別增量學習 (FSCIL) 被提議用於在以充足資料對基礎類別進行 (預) 訓練後，僅使用少量樣本持續學習新穎類別。然而，這仍然是一個挑戰。相反地，人類可以輕鬆地使用少量樣本識別新穎類別。認知科學證明，這種人類能力的重要組成部分是組合式學習。這涉及從學習的知識中識別視覺原語，然後使用這些轉移的原語組合新的概念，使增量學習既有效又可解釋。為了模仿人類組合式學習，我們為 FSCIL 任務提出了一種受認知啟發的方法。我們根據集合相似性定義並建立了一個組合式模型，然後為其配備一個原語組合模組和一個原語重用模組。在原語組合模組中，我們建議利用中心核對齊 (CKA) 相似性來近似原語集合之間的相似性，從而允許基於原語組合進行訓練和評估。在原語重用模組中，我們通過根據用來自其他類別的最接近原語替換的原語對輸入進行分類，來增強原語的可重用性。在三個資料集上的實驗驗證了我們的方法，表明它優於當前最先進的方法，並提高了可解釋性。我們的程式碼可在 https://github.com/Zoilsen/Comp-FSCIL 獲得。", "author": "Yixiong Zou et.al.", "authors": "Yixiong Zou, Shanghang Zhang, Haichen Zhou, Yuhua Li, Ruixuan Li", "id": "2405.17022v1", "paper_url": "http://arxiv.org/abs/2405.17022v1", "repo": "null"}}