{"2406.17456": {"publish_time": "2024-06-25", "title": "Improving Grammatical Error Correction via Contextual Data Augmentation", "paper_summary": "Nowadays, data augmentation through synthetic data has been widely used in\nthe field of Grammatical Error Correction (GEC) to alleviate the problem of\ndata scarcity. However, these synthetic data are mainly used in the\npre-training phase rather than the data-limited fine-tuning phase due to\ninconsistent error distribution and noisy labels. In this paper, we propose a\nsynthetic data construction method based on contextual augmentation, which can\nensure an efficient augmentation of the original data with a more consistent\nerror distribution. Specifically, we combine rule-based substitution with\nmodel-based generation, using the generative model to generate a richer context\nfor the extracted error patterns. Besides, we also propose a relabeling-based\ndata cleaning method to mitigate the effects of noisy labels in synthetic data.\nExperiments on CoNLL14 and BEA19-Test show that our proposed augmentation\nmethod consistently and substantially outperforms strong baselines and achieves\nthe state-of-the-art level with only a few synthetic data.", "paper_summary_zh": "如今，透過合成資料進行資料擴增已廣泛用於文法錯誤修正 (GEC) 領域，以減輕資料稀少的問題。然而，這些合成資料主要用於預訓練階段，而非資料有限的微調階段，原因在於錯誤分佈不一致且標籤有雜訊。在本文中，我們提出一個基於脈絡擴增的合成資料建構方法，這可以確保以更一致的錯誤分佈有效擴增原始資料。具體來說，我們將基於規則的替換與基於模型的生成結合起來，使用生成模型來為提取的錯誤模式生成更豐富的脈絡。此外，我們還提出一個基於重新標記的資料清理方法，以減輕合成資料中雜訊標籤的影響。在 CoNLL14 和 BEA19-Test 上的實驗顯示，我們提出的擴增方法始終且大幅優於強大的基準，且僅使用少量的合成資料就達到了最先進的水平。", "author": "Yixuan Wang et.al.", "authors": "Yixuan Wang, Baoxin Wang, Yijun Liu, Qingfu Zhu, Dayong Wu, Wanxiang Che", "id": "2406.17456v1", "paper_url": "http://arxiv.org/abs/2406.17456v1", "repo": "null"}}