{"2410.23703": {"publish_time": "2024-10-31", "title": "OCEAN: Offline Chain-of-thought Evaluation and Alignment in Large Language Models", "paper_summary": "Offline evaluation of LLMs is crucial in understanding their capacities,\nthough current methods remain underexplored in existing research. In this work,\nwe focus on the offline evaluation of the chain-of-thought capabilities and\nshow how to optimize LLMs based on the proposed evaluation method. To enable\noffline feedback with rich knowledge and reasoning paths, we use knowledge\ngraphs (e.g., Wikidata5m) to provide feedback on the generated chain of\nthoughts. Due to the heterogeneity between LLM reasoning and KG structures,\ndirect interaction and feedback from KGs on LLM behavior are challenging, as\nthey require accurate entity linking and grounding of LLM-generated chains of\nthought in the KG. To address the above challenge, we propose an offline\nchain-of-thought evaluation framework, OCEAN, which models chain-of-thought\nreasoning in LLMs as an MDP and evaluate the policy's alignment with KG\npreference modeling. To overcome the reasoning heterogeneity and grounding\nproblems, we leverage on-policy KG exploration and RL to model a KG policy that\ngenerates token-level likelihood distributions for LLM-generated\nchain-of-thought reasoning paths, simulating KG reasoning preference. Then we\nincorporate the knowledge-graph feedback on the validity and alignment of the\ngenerated reasoning paths into inverse propensity scores and propose KG-IPS\nestimator. Theoretically, we prove the unbiasedness of the proposed KG-IPS\nestimator and provide a lower bound on its variance. With the off-policy\nevaluated value function, we can directly enable off-policy optimization to\nfurther enhance chain-of-thought alignment. Our empirical study shows that\nOCEAN can be efficiently optimized for generating chain-of-thought reasoning\npaths with higher estimated values without affecting LLMs' general abilities in\ndownstream tasks or their internal knowledge.", "paper_summary_zh": "離線評估 LLM 對於了解其容量至關重要，儘管目前的方法在現有研究中仍未得到充分探討。在這項工作中，我們專注於對思維鏈能力的離線評估，並展示如何根據提議的評估方法優化 LLM。為了使用豐富的知識和推理路徑啟用離線回饋，我們使用知識圖譜（例如 Wikidata5m）對生成的思維鏈提供回饋。由於 LLM 推理和 KG 結構之間的異質性，KG 對 LLM 行為的直接互動和回饋具有挑戰性，因為它們需要準確的實體連結和 LLM 生成的思維鏈在 KG 中的基礎。為了應對上述挑戰，我們提出了一個離線思維鏈評估框架 OCEAN，它將 LLM 中的思維鏈推理建模為 MDP，並評估策略與 KG 偏好建模的一致性。為了克服推理異質性和基礎問題，我們利用策略內 KG 探索和 RL 來建模 KG 策略，該策略為 LLM 生成的思維鏈推理路徑生成令牌級別的可能性分布，模擬 KG 推理偏好。然後，我們將知識圖譜對生成推理路徑的有效性和一致性的回饋納入逆傾向得分並提出 KG-IPS 估計器。在理論上，我們證明了所提出的 KG-IPS 估計器的無偏性，並提供了其變異數的下限。透過策略外評估的價值函數，我們可以直接啟用策略外最佳化，以進一步增強思維鏈一致性。我們的實證研究表明，OCEAN 可以針對生成思維鏈推理路徑進行有效最佳化，並提高估計值，而不會影響 LLM 在下游任務或其內部知識中的一般能力。", "author": "Junda Wu et.al.", "authors": "Junda Wu, Xintong Li, Ruoyu Wang, Yu Xia, Yuxin Xiong, Jianing Wang, Tong Yu, Xiang Chen, Branislav Kveton, Lina Yao, Jingbo Shang, Julian McAuley", "id": "2410.23703v1", "paper_url": "http://arxiv.org/abs/2410.23703v1", "repo": "null"}}