{"2408.04472": {"publish_time": "2024-08-08", "title": "Can LLMs Beat Humans in Debating? A Dynamic Multi-agent Framework for Competitive Debate", "paper_summary": "Competitive debate is a comprehensive and complex computational argumentation\ntask. Large Language Models (LLMs) encounter hallucinations and lack\ncompetitiveness in this task. To address these challenges, we introduce Agent\nfor Debate (Agent4Debate), a dynamic, multi-agent framework based on LLMs\ndesigned to enhance their capabilities in competitive debate. Drawing\ninspiration from human behavior in debate preparation and execution,\nAgent4Debate employs a collaborative architecture where four specialized agents\n(Searcher, Analyzer, Writer, and Reviewer) dynamically interact and cooperate.\nThese agents work throughout the debate process, covering multiple stages from\ninitial research and argument formulation to rebuttal and summary. To\ncomprehensively evaluate framework performance, we construct the Chinese Debate\nArena, comprising 66 carefully selected Chinese debate motions. We recruite ten\nexperienced human debaters and collect records of 200 debates involving\nAgent4Debate, baseline models, and humans. The evaluation employs the Debatrix\nautomatic scoring system and professional human reviewers based on the\nestablished Debatrix-Elo and Human-Elo ranking. Experimental results indicate\nthat the state-of-the-art Agent4Debate exhibits capabilities comparable to\nthose of humans. Furthermore, ablation studies demonstrate the effectiveness of\neach component in the agent structure.", "paper_summary_zh": "競爭性辯論是一種全面且複雜的計算論證任務。大型語言模型 (LLM) 在此任務中會遇到幻覺，且缺乏競爭力。為了應對這些挑戰，我們引入了辯論代理 (Agent4Debate)，這是一個基於 LLM 的動態多代理架構，旨在增強其在競爭性辯論中的能力。Agent4Debate 從人類在辯論準備和執行中的行為中汲取靈感，採用協作架構，其中四個專門代理（搜尋者、分析師、撰稿人和審閱者）動態互動並合作。這些代理在整個辯論過程中工作，涵蓋從初始研究和論證制定到反駁和總結的多個階段。為了全面評估框架效能，我們構建了包含 66 個精心挑選的中文辯論動議的中文辯論競技場。我們招募了十位經驗豐富的人類辯論者，並收集了 200 場涉及 Agent4Debate、基線模型和人類的辯論記錄。評估採用 Debatrix 自動評分系統和專業的人類審閱者，根據既定的 Debatrix-Elo 和 Human-Elo 排名。實驗結果表明，最先進的 Agent4Debate 所表現出的能力可與人類相媲美。此外，消融研究證明了代理結構中每個組成的有效性。", "author": "Yiqun Zhang et.al.", "authors": "Yiqun Zhang, Xiaocui Yang, Shi Feng, Daling Wang, Yifei Zhang, Kaisong Song", "id": "2408.04472v1", "paper_url": "http://arxiv.org/abs/2408.04472v1", "repo": "https://github.com/zhangyiqun018/agent-for-debate"}}