{"2502.04829": {"publish_time": "2025-02-07", "title": "Optimistic Gradient Learning with Hessian Corrections for High-Dimensional Black-Box Optimization", "paper_summary": "Black-box algorithms are designed to optimize functions without relying on\ntheir underlying analytical structure or gradient information, making them\nessential when gradients are inaccessible or difficult to compute. Traditional\nmethods for solving black-box optimization (BBO) problems predominantly rely on\nnon-parametric models and struggle to scale to large input spaces. Conversely,\nparametric methods that model the function with neural estimators and obtain\ngradient signals via backpropagation may suffer from significant gradient\nerrors. A recent alternative, Explicit Gradient Learning (EGL), which directly\nlearns the gradient using a first-order Taylor approximation, has demonstrated\nsuperior performance over both parametric and non-parametric methods. In this\nwork, we propose two novel gradient learning variants to address the robustness\nchallenges posed by high-dimensional, complex, and highly non-linear problems.\nOptimistic Gradient Learning (OGL) introduces a bias toward lower regions in\nthe function landscape, while Higher-order Gradient Learning (HGL) incorporates\nsecond-order Taylor corrections to improve gradient accuracy. We combine these\napproaches into the unified OHGL algorithm, achieving state-of-the-art (SOTA)\nperformance on the synthetic COCO suite. Additionally, we demonstrate OHGLs\napplicability to high-dimensional real-world machine learning (ML) tasks such\nas adversarial training and code generation. Our results highlight OHGLs\nability to generate stronger candidates, offering a valuable tool for ML\nresearchers and practitioners tackling high-dimensional, non-linear\noptimization challenges", "paper_summary_zh": "黑盒演算法旨在最佳化函數，而無需依賴其基礎分析結構或梯度資訊，使其在無法取得梯度或難以運算梯度時，成為必要的工具。解決黑盒最佳化 (BBO) 問題的傳統方法主要依賴於非參數模型，且難以擴展到大型輸入空間。相反地，使用神經估計器對函數進行建模並透過反向傳播取得梯度訊號的參數方法，可能會產生顯著的梯度誤差。最近的替代方法，即明確梯度學習 (EGL)，直接使用一階泰勒近似來學習梯度，已證明其效能優於參數和非參數方法。在這項研究中，我們提出兩種新穎的梯度學習變體，以解決高維度、複雜且高度非線性問題所帶來的穩健性挑戰。樂觀梯度學習 (OGL) 在函數景觀中引入了對較低區域的偏差，而高階梯度學習 (HGL) 結合了二階泰勒校正，以提高梯度準確度。我們將這些方法結合到統一的 OHGL 演算法中，在合成 COCO 套件上達到了最先進 (SOTA) 的效能。此外，我們展示了 OHGL 可應用於高維度真實世界機器學習 (ML) 任務，例如對抗性訓練和程式碼生成。我們的結果突顯了 OHGL 生成更強候選者的能力，為解決高維度、非線性最佳化挑戰的機器學習研究人員和從業人員提供了有價值的工具", "author": "Yedidya Kfir et.al.", "authors": "Yedidya Kfir, Elad Sarafian, Sarit Kraus, Yoram Louzoun", "id": "2502.04829v1", "paper_url": "http://arxiv.org/abs/2502.04829v1", "repo": "null"}}