{"2412.15701": {"publish_time": "2024-12-20", "title": "Collaborative Gym: A Framework for Enabling and Evaluating Human-Agent Collaboration", "paper_summary": "Recent advancements in language models (LMs) have sparked growing interest in\ndeveloping LM agents. While fully autonomous agents could excel in many\nscenarios, numerous use cases inherently require them to collaborate with\nhumans due to humans' latent preferences, domain expertise, or need for\ncontrol. To facilitate the study of human-agent collaboration, we present\nCollaborative Gym (Co-Gym), a general framework enabling asynchronous,\ntripartite interaction among agents, humans, and task environments. We\ninstantiate Co-Gym with three representative tasks in both simulated and\nreal-world conditions, and propose an evaluation framework that assesses both\nthe collaboration outcomes and processes. Our findings reveal that\ncollaborative agents consistently outperform their fully autonomous\ncounterparts in task performance within those delivered cases, achieving win\nrates of 86% in Travel Planning, 74% in Tabular Analysis, and 66% in Related\nWork when evaluated by real users. However, our study also highlights\nsignificant challenges in developing collaborative agents, requiring\nadvancements in core aspects of intelligence -- communication capabilities,\nsituational awareness, and balancing autonomy and human control.", "paper_summary_zh": "語言模型 (LM) 的最新進展激發了開發 LM 代理的興趣。雖然全自動代理可以在許多情境中表現出色，但許多使用案例本質上要求它們與人類合作，因為人類的潛在偏好、領域專業知識或對控制的需求。為了促進對人類代理協作的研究，我們提出了協作健身房 (Co-Gym)，一個通用框架，讓代理、人類和任務環境之間能夠進行非同步的三方互動。我們在模擬和現實世界條件下使用三個代表性任務實例化 Co-Gym，並提出一個評估協作成果和過程的評估框架。我們的研究結果表明，在這些已交付的案例中，協作代理始終優於其全自動對應物，在旅行規劃中實現 86% 的獲勝率，在表格分析中實現 74% 的獲勝率，在相關工作中實現 66% 的獲勝率，經由真實用戶評估。然而，我們的研究也強調了開發協作代理的重大挑戰，需要在智能的核心方面取得進展，包括溝通能力、情境感知以及平衡自主性和人類控制。", "author": "Yijia Shao et.al.", "authors": "Yijia Shao, Vinay Samuel, Yucheng Jiang, John Yang, Diyi Yang", "id": "2412.15701v1", "paper_url": "http://arxiv.org/abs/2412.15701v1", "repo": "null"}}