{"2411.05638": {"publish_time": "2024-11-08", "title": "Impact of Fake News on Social Media Towards Public Users of Different Age Groups", "paper_summary": "This study examines how fake news affects social media users across a range\nof age groups and how machine learning (ML) and artificial intelligence (AI)\ncan help reduce the spread of false information. The paper evaluates various\nmachine learning models for their efficacy in identifying and categorizing fake\nnews and examines current trends in the spread of fake news, including deepfake\ntechnology. The study assesses four models using a Kaggle dataset: Random\nForest, Support Vector Machine (SVM), Neural Networks, and Logistic Regression.\nThe results show that SVM and neural networks perform better than other models,\nwith accuracies of 93.29% and 93.69%, respectively. The study also emphasises\nhow people in the elder age group diminished capacity for critical analysis of\nnews content makes them more susceptible to disinformation. Natural language\nprocessing (NLP) and deep learning approaches have the potential to improve the\naccuracy of false news detection. Biases in AI and ML models and difficulties\nin identifying information generated by AI continue to be major problems in\nspite of the developments. The study recommends that datasets be expanded to\nencompass a wider range of languages and that detection algorithms be\ncontinuously improved to keep up with the latest advancements in disinformation\ntactics. In order to combat fake news and promote an informed and resilient\nsociety, this study emphasizes the value of cooperative efforts between AI\nresearchers, social media platforms, and governments.", "paper_summary_zh": "本研究探討假新聞如何影響各年齡層的社群媒體使用者，以及機器學習 (ML) 與人工智慧 (AI) 如何有助於減少錯誤資訊的散布。本文評估各種機器學習模型在辨識和分類假新聞的效能，並探討假新聞散布的現今趨勢，包括深度造假技術。本研究使用 Kaggle 資料集評估四種模型：隨機森林、支援向量機 (SVM)、神經網路和邏輯迴歸。結果顯示，SVM 和神經網路的表現優於其他模型，準確度分別為 93.29% 和 93.69%。本研究也強調，老年群體對新聞內容的批判性分析能力下降，這使得他們更容易受到錯誤資訊的影響。自然語言處理 (NLP) 和深度學習方法有可能提升偵測假新聞的準確度。儘管有這些進展，AI 和 ML 模型中的偏見和難以辨識 AI 所產生的資訊仍然是主要問題。本研究建議擴充資料集以涵蓋更廣泛的語言，並持續改善偵測演算法，以跟上錯誤資訊策略的最新進展。為了打擊假新聞並促進一個明智且有韌性的社會，本研究強調 AI 研究人員、社群媒體平台和政府之間合作的重要性。", "author": "Kahlil bin Abdul Hakim et.al.", "authors": "Kahlil bin Abdul Hakim, Sathishkumar Veerappampalayam Easwaramoorthy", "id": "2411.05638v1", "paper_url": "http://arxiv.org/abs/2411.05638v1", "repo": "null"}}