{"2412.05232": {"publish_time": "2024-12-06", "title": "LIAR: Leveraging Alignment (Best-of-N) to Jailbreak LLMs in Seconds", "paper_summary": "Many existing jailbreak techniques rely on solving discrete combinatorial\noptimization, while more recent approaches involve training LLMs to generate\nmultiple adversarial prompts. However, both approaches require significant\ncomputational resources to produce even a single adversarial prompt. We\nhypothesize that the inefficiency of current approaches stems from an\ninadequate characterization of the jailbreak problem. To address this gap, we\nformulate the jailbreak problem in terms of alignment. By starting from an\navailable safety-aligned model, we leverage an unsafe reward to guide the safe\nmodel towards generating unsafe outputs using alignment techniques (e.g.,\nreinforcement learning from human feedback), effectively performing\njailbreaking via alignment. We propose a novel jailbreak method called LIAR\n(LeveragIng Alignment to jailbReak). To demonstrate the simplicity and\neffectiveness of our approach, we employ a best-of-N method to solve the\nalignment problem. LIAR offers significant advantages: lower computational\nrequirements without additional training, fully black-box operation,\ncompetitive attack success rates, and more human-readable prompts. We provide\ntheoretical insights into the possibility of jailbreaking a safety-aligned\nmodel, revealing inherent vulnerabilities in current alignment strategies for\nLLMs. We also provide sub-optimality guarantees for the proposed \\algo.\nExperimentally, we achieve ASR comparable to the SoTA with a 10x improvement to\nperplexity and a Time-to-Attack measured in seconds rather than tens of hours.", "paper_summary_zh": "許多現有的越獄技術依賴於解決離散組合最佳化，而較新的方法則涉及訓練 LLM 以產生多個對抗提示。然而，這兩種方法都需要大量的計算資源才能產生單一的對抗提示。我們假設當前方法的低效率源於對越獄問題的不充分表徵。為了解決這個差距，我們根據對齊來制定越獄問題。從一個可用的安全對齊模型開始，我們利用不安全的獎勵來引導安全模型使用對齊技術（例如，從人類回饋中進行強化學習）產生不安全的輸出，有效地通過對齊進行越獄。我們提出了一種名為 LIAR（LeveragIng Alignment to jailbReak）的新型越獄方法。為了展示我們方法的簡單性和有效性，我們採用 N 中最佳方法來解決對齊問題。LIAR 提供顯著的優勢：無需額外訓練即可降低計算要求、完全黑盒操作、具有競爭力的攻擊成功率以及更具可讀性的提示。我們提供了對越獄安全對齊模型的可能性的理論見解，揭示了當前 LLM 對齊策略中固有的漏洞。我們還為提出的演算法提供次優保證。在實驗中，我們實現了與 SoTA 相當的 ASR，困惑度提高了 10 倍，攻擊時間以秒為單位衡量，而不是以數十小時為單位。", "author": "James Beetham et.al.", "authors": "James Beetham, Souradip Chakraborty, Mengdi Wang, Furong Huang, Amrit Singh Bedi, Mubarak Shah", "id": "2412.05232v1", "paper_url": "http://arxiv.org/abs/2412.05232v1", "repo": "null"}}