{"2408.11523": {"publish_time": "2024-08-21", "title": "LARR: Large Language Model Aided Real-time Scene Recommendation with Semantic Understanding", "paper_summary": "Click-Through Rate (CTR) prediction is crucial for Recommendation System(RS),\naiming to provide personalized recommendation services for users in many\naspects such as food delivery, e-commerce and so on. However, traditional RS\nrelies on collaborative signals, which lacks semantic understanding to\nreal-time scenes. We also noticed that a major challenge in utilizing Large\nLanguage Models (LLMs) for practical recommendation purposes is their\nefficiency in dealing with long text input. To break through the problems\nabove, we propose Large Language Model Aided Real-time Scene\nRecommendation(LARR), adopt LLMs for semantic understanding, utilizing\nreal-time scene information in RS without requiring LLM to process the entire\nreal-time scene text directly, thereby enhancing the efficiency of LLM-based\nCTR modeling. Specifically, recommendation domain-specific knowledge is\ninjected into LLM and then RS employs an aggregation encoder to build real-time\nscene information from separate LLM's outputs. Firstly, a LLM is continual\npretrained on corpus built from recommendation data with the aid of special\ntokens. Subsequently, the LLM is fine-tuned via contrastive learning on three\nkinds of sample construction strategies. Through this step, LLM is transformed\ninto a text embedding model. Finally, LLM's separate outputs for different\nscene features are aggregated by an encoder, aligning to collaborative signals\nin RS, enhancing the performance of recommendation model.", "paper_summary_zh": "點擊率 (CTR) 預測對於推薦系統 (RS) 至關重要，旨在為使用者提供個人化的推薦服務，例如送餐、電子商務等許多方面。然而，傳統的 RS 依賴於協作信號，這缺乏對即時場景的語義理解。我們還注意到，將大型語言模型 (LLM) 用於實際推薦目的的主要挑戰在於它們處理長文本輸入的效率。為了突破上述問題，我們提出大型語言模型輔助即時場景推薦 (LARR)，採用 LLM 進行語義理解，在 RS 中利用即時場景資訊，而不需要 LLM 直接處理整個即時場景文字，從而提高基於 LLM 的 CTR 建模的效率。具體來說，推薦領域特定的知識被注入到 LLM 中，然後 RS 使用聚合編碼器從 LLM 的單獨輸出中建立即時場景資訊。首先，LLM 在特殊符號的幫助下，在由推薦資料建立的語料庫上進行持續預訓練。隨後，LLM 透過對比學習在三種樣本建構策略上進行微調。透過這個步驟，LLM 轉變為文字嵌入模型。最後，LLM 針對不同場景特徵的單獨輸出由編碼器聚合，與 RS 中的協作信號對齊，增強推薦模型的效能。", "author": "Zhizhong Wan et.al.", "authors": "Zhizhong Wan, Bin Yin, Junjie Xie, Fei Jiang, Xiang Li, Wei Lin", "id": "2408.11523v1", "paper_url": "http://arxiv.org/abs/2408.11523v1", "repo": "null"}}