{"2407.12402": {"publish_time": "2024-07-17", "title": "TurkishMMLU: Measuring Massive Multitask Language Understanding in Turkish", "paper_summary": "Multiple choice question answering tasks evaluate the reasoning,\ncomprehension, and mathematical abilities of Large Language Models (LLMs).\nWhile existing benchmarks employ automatic translation for multilingual\nevaluation, this approach is error-prone and potentially introduces culturally\nbiased questions, especially in social sciences. We introduce the first\nmultitask, multiple-choice Turkish QA benchmark, TurkishMMLU, to evaluate LLMs'\nunderstanding of the Turkish language. TurkishMMLU includes over 10,000\nquestions, covering 9 different subjects from Turkish high-school education\ncurricula. These questions are written by curriculum experts, suitable for the\nhigh-school curricula in Turkey, covering subjects ranging from natural\nsciences and math questions to more culturally representative topics such as\nTurkish Literature and the history of the Turkish Republic. We evaluate over 20\nLLMs, including multilingual open-source (e.g., Gemma, Llama, MT5),\nclosed-source (GPT 4o, Claude, Gemini), and Turkish-adapted (e.g., Trendyol)\nmodels. We provide an extensive evaluation, including zero-shot and few-shot\nevaluation of LLMs, chain-of-thought reasoning, and question difficulty\nanalysis along with model performance. We provide an in-depth analysis of the\nTurkish capabilities and limitations of current LLMs to provide insights for\nfuture LLMs for the Turkish language. We publicly release our code for the\ndataset and evaluation: https://github.com/ArdaYueksel/TurkishMMLU.", "paper_summary_zh": "多選題問答任務評估大型語言模型 (LLM) 的推理、理解和數學能力。\n雖然現有的基準採用機器翻譯進行多語言評估，但這種方法容易出錯，並可能引入文化偏見的問題，特別是在社會科學領域。我們引入了第一個多任務多選土耳其問答基準 TurkishMMLU，以評估 LLM 對土耳其語的理解。TurkishMMLU 包含超過 10,000 個問題，涵蓋土耳其高中教育課程中的 9 個不同科目。這些問題由課程專家編寫，適合土耳其的高中課程，涵蓋範圍從自然科學和數學問題到更具文化代表性的主題，例如土耳其文學和土耳其共和國的歷史。我們評估了 20 多個 LLM，包括多語言開源（例如 Gemma、Llama、MT5）、閉源（GPT 4o、Claude、Gemini）和土耳其改編（例如 Trendyol）模型。我們提供了廣泛的評估，包括 LLM 的零次學習和少次學習評估、思考鏈推理和問題難度分析以及模型效能。我們對當前 LLM 的土耳其語能力和限制進行了深入分析，以提供對未來土耳其語 LLM 的見解。我們公開發布我們的代碼以供資料集和評估使用：https://github.com/ArdaYueksel/TurkishMMLU。", "author": "Arda Yüksel et.al.", "authors": "Arda Yüksel, Abdullatif Köksal, Lütfi Kerem Şenel, Anna Korhonen, Hinrich Schütze", "id": "2407.12402v1", "paper_url": "http://arxiv.org/abs/2407.12402v1", "repo": "null"}}