{"2405.20852": {"publish_time": "2024-05-31", "title": "Towards Spoken Language Understanding via Multi-level Multi-grained Contrastive Learning", "paper_summary": "Spoken language understanding (SLU) is a core task in task-oriented dialogue\nsystems, which aims at understanding the user's current goal through\nconstructing semantic frames. SLU usually consists of two subtasks, including\nintent detection and slot filling. Although there are some SLU frameworks joint\nmodeling the two subtasks and achieving high performance, most of them still\noverlook the inherent relationships between intents and slots and fail to\nachieve mutual guidance between the two subtasks. To solve the problem, we\npropose a multi-level multi-grained SLU framework MMCL to apply contrastive\nlearning at three levels, including utterance level, slot level, and word level\nto enable intent and slot to mutually guide each other. For the utterance\nlevel, our framework implements coarse granularity contrastive learning and\nfine granularity contrastive learning simultaneously. Besides, we also apply\nthe self-distillation method to improve the robustness of the model.\nExperimental results and further analysis demonstrate that our proposed model\nachieves new state-of-the-art results on two public multi-intent SLU datasets,\nobtaining a 2.6 overall accuracy improvement on the MixATIS dataset compared to\nprevious best models.", "paper_summary_zh": "口語理解 (SLU) 是任務導向對話系統中的核心任務，旨在通過構建語義框架來理解使用者的當前目標。SLU 通常包含兩個子任務，包括意圖偵測和槽位填補。儘管有些 SLU 框架聯合建模這兩個子任務並獲得高性能，但大多數仍然忽略意圖和槽位之間的內在關係，並且無法實現兩個子任務之間的相互指導。為了解決此問題，我們提出了一個多層多粒度 SLU 框架 MMCL，將對比學習應用於三個層級，包括發話層級、槽位層級和字詞層級，以使意圖和槽位能夠相互指導。對於發話層級，我們的框架同時實作粗粒度對比學習和細粒度對比學習。此外，我們還應用自蒸餾方法來提高模型的穩健性。實驗結果和進一步分析表明，我們提出的模型在兩個公開的多意圖 SLU 資料集上取得新的最先進結果，與先前的最佳模型相比，在 MixATIS 資料集上獲得 2.6 的整體準確度提升。", "author": "Xuxin Cheng et.al.", "authors": "Xuxin Cheng, Wanshi Xu, Zhihong Zhu, Hongxiang Li, Yuexian Zou", "id": "2405.20852v1", "paper_url": "http://arxiv.org/abs/2405.20852v1", "repo": "null"}}