{"2407.08152": {"publish_time": "2024-07-11", "title": "Privacy-Preserving Data Deduplication for Enhancing Federated Learning of Language Models", "paper_summary": "Deduplication is a vital preprocessing step that enhances machine learning\nmodel performance and saves training time and energy. However, enhancing\nfederated learning through deduplication poses challenges, especially regarding\nscalability and potential privacy violations if deduplication involves sharing\nall clients' data. In this paper, we address the problem of deduplication in a\nfederated setup by introducing a pioneering protocol, Efficient\nPrivacy-Preserving Multi-Party Deduplication (EP-MPD). It efficiently removes\nduplicates from multiple clients' datasets without compromising data privacy.\nEP-MPD is constructed in a modular fashion, utilizing two novel variants of the\nPrivate Set Intersection protocol. Our extensive experiments demonstrate the\nsignificant benefits of deduplication in federated learning of large language\nmodels. For instance, we observe up to 19.61% improvement in perplexity and up\nto 27.95% reduction in running time. EP-MPD effectively balances privacy and\nperformance in federated learning, making it a valuable solution for\nlarge-scale applications.", "paper_summary_zh": "重複資料刪除是一個重要的預處理步驟，可以提升機器學習模型的效能，並節省訓練時間和精力。然而，透過重複資料刪除來強化聯邦學習會帶來挑戰，特別是在可擴充性和潛在的隱私權侵犯方面，如果重複資料刪除涉及分享所有用戶的資料。在本文中，我們透過引入一個創新的協定，有效率的隱私保護多方重複資料刪除（EP-MPD），來解決聯邦設定中的重複資料刪除問題。它可以有效率地從多個用戶的資料集中移除重複資料，而不會損害資料隱私。EP-MPD 是以模組化方式建構的，利用了私密集合交集協定的兩個新變體。我們廣泛的實驗證明了重複資料刪除在大型語言模型的聯邦學習中具有顯著的優點。例如，我們觀察到困惑度最高改善了 19.61%，執行時間最多減少了 27.95%。EP-MPD 有效地在聯邦學習中平衡了隱私和效能，使其成為大規模應用的一個有價值的解決方案。", "author": "Aydin Abadi et.al.", "authors": "Aydin Abadi, Vishnu Asutosh Dasu, Sumanta Sarkar", "id": "2407.08152v1", "paper_url": "http://arxiv.org/abs/2407.08152v1", "repo": "null"}}