{"2412.04300": {"publish_time": "2024-12-05", "title": "T2I-FactualBench: Benchmarking the Factuality of Text-to-Image Models with Knowledge-Intensive Concepts", "paper_summary": "Evaluating the quality of synthesized images remains a significant challenge\nin the development of text-to-image (T2I) generation. Most existing studies in\nthis area primarily focus on evaluating text-image alignment, image quality,\nand object composition capabilities, with comparatively fewer studies\naddressing the evaluation of the factuality of T2I models, particularly when\nthe concepts involved are knowledge-intensive. To mitigate this gap, we present\nT2I-FactualBench in this work - the largest benchmark to date in terms of the\nnumber of concepts and prompts specifically designed to evaluate the factuality\nof knowledge-intensive concept generation. T2I-FactualBench consists of a\nthree-tiered knowledge-intensive text-to-image generation framework, ranging\nfrom the basic memorization of individual knowledge concepts to the more\ncomplex composition of multiple knowledge concepts. We further introduce a\nmulti-round visual question answering (VQA) based evaluation framework to\nassess the factuality of three-tiered knowledge-intensive text-to-image\ngeneration tasks. Experiments on T2I-FactualBench indicate that current\nstate-of-the-art (SOTA) T2I models still leave significant room for\nimprovement.", "paper_summary_zh": "評估合成影像品質在文字轉影像 (T2I) 生成發展中仍是一項重大挑戰。現有大多數研究主要專注於評估文字影像對齊、影像品質和物體組成能力，較少研究探討 T2I 模型的事實性評估，特別是在所涉及概念需要大量知識時。為了彌補這個差距，我們在這項工作中提出 T2I-FactualBench，這是目前在概念和提示數量方面最大的基準，專門用於評估知識密集型概念生成的真實性。T2I-FactualBench 包含一個三層級的知識密集型文字轉影像生成架構，從基本記憶個別知識概念到更複雜的多個知識概念組成。我們進一步引入一個基於多輪視覺問答 (VQA) 的評估架構，以評估三層級知識密集型文字轉影像生成任務的事實性。在 T2I-FactualBench 上的實驗表明，目前的最新技術 (SOTA) T2I 模型仍有很大的改進空間。", "author": "Ziwei Huang et.al.", "authors": "Ziwei Huang, Wanggui He, Quanyu Long, Yandi Wang, Haoyuan Li, Zhelun Yu, Fangxun Shu, Long Chen, Hao Jiang, Leilei Gan", "id": "2412.04300v1", "paper_url": "http://arxiv.org/abs/2412.04300v1", "repo": "null"}}