{"2306.03976": {"publish_time": "2023-06-06", "title": "Explainable AI using expressive Boolean formulas", "paper_summary": "We propose and implement an interpretable machine learning classification\nmodel for Explainable AI (XAI) based on expressive Boolean formulas. Potential\napplications include credit scoring and diagnosis of medical conditions. The\nBoolean formula defines a rule with tunable complexity (or interpretability),\naccording to which input data are classified. Such a formula can include any\noperator that can be applied to one or more Boolean variables, thus providing\nhigher expressivity compared to more rigid rule-based and tree-based\napproaches. The classifier is trained using native local optimization\ntechniques, efficiently searching the space of feasible formulas. Shallow rules\ncan be determined by fast Integer Linear Programming (ILP) or Quadratic\nUnconstrained Binary Optimization (QUBO) solvers, potentially powered by\nspecial purpose hardware or quantum devices. We combine the expressivity and\nefficiency of the native local optimizer with the fast operation of these\ndevices by executing non-local moves that optimize over subtrees of the full\nBoolean formula. We provide extensive numerical benchmarking results featuring\nseveral baselines on well-known public datasets. Based on the results, we find\nthat the native local rule classifier is generally competitive with the other\nclassifiers. The addition of non-local moves achieves similar results with\nfewer iterations, and therefore using specialized or quantum hardware could\nlead to a speedup by fast proposal of non-local moves.", "paper_summary_zh": "我們提出並實作一個可解釋機器學習分類模型，用於基於表達式布林公式的可解釋 AI (XAI)。潛在應用包括信用評分和醫療狀況診斷。布林公式定義了一個具有可調整複雜性（或可解釋性）的規則，根據該規則對輸入數據進行分類。這樣的公式可以包含任何可應用於一個或多個布林變數的運算子，從而與更嚴格的基於規則和基於樹的方法相比，提供更高的表達能力。分類器使用原生局部最佳化技術進行訓練，有效地搜索可行公式的空間。淺層規則可以用快速的整數線性規劃 (ILP) 或二次無約束二元最佳化 (QUBO) 求解器來確定，這些求解器可能由特殊用途的硬體或量子裝置提供支援。我們將原生局部最佳化器的表達能力和效率與這些裝置的快速運算相結合，透過執行非局部移動來最佳化完整布林公式的子樹。我們提供廣泛的數值基準測試結果，其中包含在眾所周知的公共資料集上使用多個基線。根據結果，我們發現原生局部規則分類器通常與其他分類器具有競爭力。加入非局部移動以較少的反覆運算次數達成類似的結果，因此使用專用或量子硬體可能會透過快速提出非局部移動來加速。", "author": "Gili Rosenberg et.al.", "authors": "Gili Rosenberg, J. Kyle Brubaker, Martin J. A. Schuetz, Grant Salton, Zhihuai Zhu, Elton Yechao Zhu, Serdar Kadıoğlu, Sima E. Borujeni, Helmut G. Katzgraber", "id": "2306.03976v1", "paper_url": "http://arxiv.org/abs/2306.03976v1", "repo": "null"}}