{"2502.15666": {"publish_time": "2025-02-21", "title": "Almost AI, Almost Human: The Challenge of Detecting AI-Polished Writing", "paper_summary": "The growing use of large language models (LLMs) for text generation has led\nto widespread concerns about AI-generated content detection. However, an\noverlooked challenge is AI-polished text, where human-written content undergoes\nsubtle refinements using AI tools. This raises a critical question: should\nminimally polished text be classified as AI-generated? Misclassification can\nlead to false plagiarism accusations and misleading claims about AI prevalence\nin online content. In this study, we systematically evaluate eleven\nstate-of-the-art AI-text detectors using our AI-Polished-Text Evaluation\n(APT-Eval) dataset, which contains $11.7K$ samples refined at varying\nAI-involvement levels. Our findings reveal that detectors frequently\nmisclassify even minimally polished text as AI-generated, struggle to\ndifferentiate between degrees of AI involvement, and exhibit biases against\nolder and smaller models. These limitations highlight the urgent need for more\nnuanced detection methodologies.", "paper_summary_zh": "大型語言模型 (LLM) 在文本生成中的使用日益廣泛，這導致人們對 AI 生成的內容檢測產生了廣泛的擔憂。然而，一個被忽視的挑戰是 AI 潤飾文本，其中人類編寫的內容使用 AI 工具進行了細微的修改。這引發了一個關鍵問題：是否應將經過最少潤飾的文本歸類為 AI 生成的？錯誤分類可能導致虛假的抄襲指控和關於在線內容中 AI 普及的誤導性說法。在這項研究中，我們使用我們的 AI 潤飾文本評估 (APT-Eval) 數據集系統地評估了 11 個最先進的 AI 文本檢測器，其中包含在不同 AI 參與級別經過修改的 11.7K 個樣本。我們的研究結果表明，檢測器經常將即使是最少潤飾的文本錯誤分類為 AI 生成的，難以區分 AI 參與的程度，並且對較舊和較小的模型表現出偏見。這些限制凸顯了對更細緻的檢測方法的迫切需求。", "author": "Shoumik Saha et.al.", "authors": "Shoumik Saha, Soheil Feizi", "id": "2502.15666v1", "paper_url": "http://arxiv.org/abs/2502.15666v1", "repo": "null"}}