{"2501.08769": {"publish_time": "2025-01-15", "title": "Enhanced Large Language Models for Effective Screening of Depression and Anxiety", "paper_summary": "Depressive and anxiety disorders are widespread, necessitating timely\nidentification and management. Recent advances in Large Language Models (LLMs)\noffer potential solutions, yet high costs and ethical concerns about training\ndata remain challenges. This paper introduces a pipeline for synthesizing\nclinical interviews, resulting in 1,157 interactive dialogues (PsyInterview),\nand presents EmoScan, an LLM-based emotional disorder screening system. EmoScan\ndistinguishes between coarse (e.g., anxiety or depressive disorders) and fine\ndisorders (e.g., major depressive disorders) and conducts high-quality\ninterviews. Evaluations showed that EmoScan exceeded the performance of base\nmodels and other LLMs like GPT-4 in screening emotional disorders\n(F1-score=0.7467). It also delivers superior explanations (BERTScore=0.9408)\nand demonstrates robust generalizability (F1-score of 0.67 on an external\ndataset). Furthermore, EmoScan outperforms baselines in interviewing skills, as\nvalidated by automated ratings and human evaluations. This work highlights the\nimportance of scalable data-generative pipelines for developing effective\nmental health LLM tools.", "paper_summary_zh": "憂鬱症和焦慮症十分普遍，需要及時識別和管理。大型語言模型 (LLM) 的最新進展提供了潛在的解決方案，但訓練資料的高成本和倫理問題仍然是挑戰。本文介紹了一個用於合成臨床訪談的管道，產生了 1,157 個互動對話 (PsyInterview)，並展示了 EmoScan，一個基於 LLM 的情緒障礙篩檢系統。EmoScan 區分了粗略的（例如，焦慮症或憂鬱症）和精細的障礙（例如，重度憂鬱症），並進行高品質的訪談。評估顯示，EmoScan 在篩檢情緒障礙方面優於基礎模型和其他 LLM，例如 GPT-4（F1 分數 = 0.7467）。它還提供了優異的解釋（BERTScore = 0.9408），並展示了強健的概括性（在外部資料集上的 F1 分數為 0.67）。此外，EmoScan 在訪談技巧方面優於基準，經由自動評分和人類評估驗證。這項工作突顯了可擴充資料生成管道對於開發有效的 LLM 心理健康工具的重要性。", "author": "June M. Liu et.al.", "authors": "June M. Liu, Mengxia Gao, Sahand Sabour, Zhuang Chen, Minlie Huang, Tatia M. C. Lee", "id": "2501.08769v1", "paper_url": "http://arxiv.org/abs/2501.08769v1", "repo": "null"}}