{"2501.01037": {"publish_time": "2025-01-02", "title": "MSC-Bench: Benchmarking and Analyzing Multi-Sensor Corruption for Driving Perception", "paper_summary": "Multi-sensor fusion models play a crucial role in autonomous driving\nperception, particularly in tasks like 3D object detection and HD map\nconstruction. These models provide essential and comprehensive static\nenvironmental information for autonomous driving systems. While camera-LiDAR\nfusion methods have shown promising results by integrating data from both\nmodalities, they often depend on complete sensor inputs. This reliance can lead\nto low robustness and potential failures when sensors are corrupted or missing,\nraising significant safety concerns. To tackle this challenge, we introduce the\nMulti-Sensor Corruption Benchmark (MSC-Bench), the first comprehensive\nbenchmark aimed at evaluating the robustness of multi-sensor autonomous driving\nperception models against various sensor corruptions. Our benchmark includes 16\ncombinations of corruption types that disrupt both camera and LiDAR inputs,\neither individually or concurrently. Extensive evaluations of six 3D object\ndetection models and four HD map construction models reveal substantial\nperformance degradation under adverse weather conditions and sensor failures,\nunderscoring critical safety issues. The benchmark toolkit and affiliated code\nand model checkpoints have been made publicly accessible.", "paper_summary_zh": "多感測器融合模型在自動駕駛感知中扮演著至關重要的角色，特別是在 3D 物體偵測和 HD 地圖建構等任務中。這些模型為自動駕駛系統提供了必要且全面的靜態環境資訊。雖然相機-LiDAR 融合方法透過整合來自兩種方式的資料而展現出有前景的成果，但它們通常依賴於完整的感測器輸入。這種依賴性可能導致感測器損壞或遺失時的低健壯性和潛在故障，引發重大的安全問題。為了應對這個挑戰，我們引入了多感測器損壞基準 (MSC-Bench)，這是第一個旨在評估多感測器自動駕駛感知模型對各種感測器損壞的健壯性的綜合基準。我們的基準包括 16 種損壞類型的組合，這些損壞會破壞相機和 LiDAR 輸入，無論是單獨還是同時進行。對六個 3D 物體偵測模型和四個 HD 地圖建構模型的廣泛評估揭示了在惡劣天氣條件和感測器故障下的顯著效能下降，突顯了關鍵的安全問題。基準工具組和附屬程式碼與模型檢查點已公開提供。", "author": "Xiaoshuai Hao et.al.", "authors": "Xiaoshuai Hao, Guanqun Liu, Yuting Zhao, Yuheng Ji, Mengchuan Wei, Haimei Zhao, Lingdong Kong, Rong Yin, Yu Liu", "id": "2501.01037v1", "paper_url": "http://arxiv.org/abs/2501.01037v1", "repo": "null"}}