{"2501.18645": {"publish_time": "2025-01-29", "title": "Layered Chain-of-Thought Prompting for Multi-Agent LLM Systems: A Comprehensive Approach to Explainable Large Language Models", "paper_summary": "Large Language Models (LLMs) leverage chain-of-thought (CoT) prompting to\nprovide step-by-step rationales, improving performance on complex tasks.\nDespite its benefits, vanilla CoT often fails to fully verify intermediate\ninferences and can produce misleading explanations. In this work, we propose\nLayered Chain-of-Thought (Layered-CoT) Prompting, a novel framework that\nsystematically segments the reasoning process into multiple layers, each\nsubjected to external checks and optional user feedback. We expand on the key\nconcepts, present three scenarios -- medical triage, financial risk assessment,\nand agile engineering -- and demonstrate how Layered-CoT surpasses vanilla CoT\nin terms of transparency, correctness, and user engagement. By integrating\nreferences from recent arXiv papers on interactive explainability, multi-agent\nframeworks, and agent-based collaboration, we illustrate how Layered-CoT paves\nthe way for more reliable and grounded explanations in high-stakes domains.", "paper_summary_zh": "大型語言模型 (LLM) 利用思想鏈 (CoT) 提示提供逐步的理由，從而提高複雜任務的執行效能。儘管有其好處，但香草 CoT 經常無法完全驗證中間推論，並且可能產生誤導性的解釋。在這項工作中，我們提出分層思想鏈 (Layered-CoT) 提示，這是一個新穎的框架，它系統性地將推理過程分段成多個層次，每個層次都經過外部檢查和可選的使用者回饋。我們擴展了關鍵概念，提出了三種場景——醫療分流、財務風險評估和敏捷工程——並展示了分層 CoT 在透明度、正確性和使用者參與度方面如何超越香草 CoT。透過整合來自近期 arXiv 論文關於互動可解釋性、多主體框架和基於主體的協作的參考，我們說明了分層 CoT 如何為高風險領域提供更可靠且有根據的解釋鋪路。", "author": "Manish Sanwal et.al.", "authors": "Manish Sanwal", "id": "2501.18645v1", "paper_url": "http://arxiv.org/abs/2501.18645v1", "repo": "null"}}