{"2405.17403": {"publish_time": "2024-05-27", "title": "A Closer Look at Time Steps is Worthy of Triple Speed-Up for Diffusion Model Training", "paper_summary": "Training diffusion models is always a computation-intensive task. In this\npaper, we introduce a novel speed-up method for diffusion model training,\ncalled, which is based on a closer look at time steps. Our key findings are: i)\nTime steps can be empirically divided into acceleration, deceleration, and\nconvergence areas based on the process increment. ii) These time steps are\nimbalanced, with many concentrated in the convergence area. iii) The\nconcentrated steps provide limited benefits for diffusion training. To address\nthis, we design an asymmetric sampling strategy that reduces the frequency of\nsteps from the convergence area while increasing the sampling probability for\nsteps from other areas. Additionally, we propose a weighting strategy to\nemphasize the importance of time steps with rapid-change process increments. As\na plug-and-play and architecture-agnostic approach, SpeeD consistently achieves\n3-times acceleration across various diffusion architectures, datasets, and\ntasks. Notably, due to its simple design, our approach significantly reduces\nthe cost of diffusion model training with minimal overhead. Our research\nenables more researchers to train diffusion models at a lower cost.", "paper_summary_zh": "訓練擴散模型始終是一項運算密集型任務。在本文中，我們介紹了一種名為 SpeeD 的擴散模型訓練加速新方法，它基於對時間步驟的深入探討。我們的關鍵發現如下：i) 基於處理增量，時間步驟可以根據經驗分為加速、減速和收斂區域。ii) 這些時間步驟並不平衡，許多步驟集中在收斂區域。iii) 集中的步驟對擴散訓練提供的優點有限。為了解決這個問題，我們設計了一種非對稱採樣策略，它降低了來自收斂區域的步驟頻率，同時增加了來自其他區域的步驟的採樣機率。此外，我們提出了加權策略，以強調具有快速變化處理增量的時間步驟的重要性。作為一種即插即用且與架構無關的方法，SpeeD 在各種擴散架構、資料集和任務中始終實現 3 倍加速。值得注意的是，由於其設計簡單，我們的做法顯著降低了擴散模型訓練的成本，同時將開銷降至最低。我們的研究使更多研究人員能夠以更低的成本訓練擴散模型。", "author": "Kai Wang et.al.", "authors": "Kai Wang, Yukun Zhou, Mingjia Shi, Zhihang Yuan, Yuzhang Shang, Xiaojiang Peng, Hanwang Zhang, Yang You", "id": "2405.17403v1", "paper_url": "http://arxiv.org/abs/2405.17403v1", "repo": "https://github.com/1zeryu/speed"}}