{"2408.15409": {"publish_time": "2024-08-27", "title": "Awes, Laws, and Flaws From Today's LLM Research", "paper_summary": "We perform a critical examination of the scientific methodology behind\ncontemporary large language model (LLM) research. For this we assess over 2,000\nresearch works based on criteria typical of what is considered good research\n(e.g. presence of statistical tests and reproducibility) and cross-validate it\nwith arguments that are at the centre of controversy (e.g., claims of emergent\nbehaviour, the use of LLMs as evaluators). We find multiple trends, such as\ndeclines in claims of emergent behaviour and the presence of ethics\ndisclaimers; and the rise of LLMs as evaluators. This paper underscores the\nneed for more scrutiny and rigour by and from this field. Critical reading and\nfamiliarity with the literature are crucial to live up to the fundamentals of a\nresponsible scientific method that is ethical, reproducible, systematic, and\nopen to criticism.", "paper_summary_zh": "我們對當代大型語言模型 (LLM) 研究背後的科學方法進行批判性審查。為此，我們根據通常被認為是良好研究標準的標準（例如統計檢定和可重複性）評估了 2,000 多項研究工作，並與爭議核心的論點進行交叉驗證（例如，出現行為主張、將 LLM 用作評估者的主張）。我們發現多種趨勢，例如出現行為主張的減少和倫理聲明的存在；以及 LLM 作為評估者的興起。本文強調需要這個領域進行更多審查和嚴謹性。批判性閱讀和熟悉文獻對於符合負責任的科學方法的基本原則至關重要，該方法具有倫理性、可重複性、系統性和開放性，可以接受批評。", "author": "Adrian de Wynter et.al.", "authors": "Adrian de Wynter", "id": "2408.15409v1", "paper_url": "http://arxiv.org/abs/2408.15409v1", "repo": "https://github.com/adewynter/awes_laws_and_flaws"}}