{"2406.14162": {"publish_time": "2024-06-20", "title": "DIRAS: Efficient LLM-Assisted Annotation of Document Relevance in Retrieval Augmented Generation", "paper_summary": "Retrieval Augmented Generation (RAG) is widely employed to ground responses\nto queries on domain-specific documents. But do RAG implementations leave out\nimportant information or excessively include irrelevant information? To allay\nthese concerns, it is necessary to annotate domain-specific benchmarks to\nevaluate information retrieval (IR) performance, as relevance definitions vary\nacross queries and domains. Furthermore, such benchmarks should be\ncost-efficiently annotated to avoid annotation selection bias. In this paper,\nwe propose DIRAS (Domain-specific Information Retrieval Annotation with\nScalability), a manual-annotation-free schema that fine-tunes open-sourced LLMs\nto annotate relevance labels with calibrated relevance probabilities. Extensive\nevaluation shows that DIRAS fine-tuned models achieve GPT-4-level performance\non annotating and ranking unseen (query, document) pairs, and is helpful for\nreal-world RAG development.", "paper_summary_zh": "檢索增強生成 (RAG) 被廣泛用於將回應建立在特定領域文件上的查詢上。但 RAG 實作是否遺漏了重要資訊或過度納入不相關的資訊？為了消除這些疑慮，有必要註解特定領域的基準，以評估資訊檢索 (IR) 的效能，因為相關性定義會因查詢和領域而異。此外，此類基準應以成本效益的方式註解，以避免註解選擇偏誤。在本文中，我們提出 DIRAS（可擴充性的特定領域資訊檢索註解），這是一個免手動註解的架構，可微調開源 LLM，以校準相關性機率來註解相關性標籤。廣泛的評估顯示，DIRAS 微調模型在註解和排名未見過的（查詢、文件）配對上，達到了 GPT-4 等級的效能，並有助於實際的 RAG 開發。", "author": "Jingwei Ni et.al.", "authors": "Jingwei Ni, Tobias Schimanski, Meihong Lin, Mrinmaya Sachan, Elliott Ash, Markus Leippold", "id": "2406.14162v1", "paper_url": "http://arxiv.org/abs/2406.14162v1", "repo": "null"}}