{"2406.02267": {"publish_time": "2024-06-04", "title": "Prompting Large Language Models with Human Error Markings for Self-Correcting Machine Translation", "paper_summary": "While large language models (LLMs) pre-trained on massive amounts of unpaired\nlanguage data have reached the state-of-the-art in machine translation (MT) of\ngeneral domain texts, post-editing (PE) is still required to correct errors and\nto enhance term translation quality in specialized domains. In this paper we\npresent a pilot study of enhancing translation memories (TM) produced by PE\n(source segments, machine translations, and reference translations, henceforth\ncalled PE-TM) for the needs of correct and consistent term translation in\ntechnical domains.\n  We investigate a light-weight two-step scenario where, at inference time, a\nhuman translator marks errors in the first translation step, and in a second\nstep a few similar examples are extracted from the PE-TM to prompt an LLM. Our\nexperiment shows that the additional effort of augmenting translations with\nhuman error markings guides the LLM to focus on a correction of the marked\nerrors, yielding consistent improvements over automatic PE (APE) and MT from\nscratch.", "paper_summary_zh": "儘管預先在大量未配對語言資料上訓練的大型語言模型 (LLM) 已在一般領域文字的機器翻譯 (MT) 中達到最先進的境界，但仍需要後編輯 (PE) 來修正錯誤並提升特定領域的術語翻譯品質。在本文中，我們提出一個試驗研究，以提升後編輯產生的翻譯記憶體 (TM)（原始區塊、機器翻譯和參考翻譯，以下簡稱 PE-TM），以滿足技術領域正確且一致的術語翻譯需求。\n\n我們研究一個輕量級的兩步驟場景，在推論時間時，人類翻譯者會在第一個翻譯步驟中標記錯誤，並在第二個步驟中從 PE-TM 中提取一些類似的範例，以提示 LLM。我們的實驗顯示，透過人類錯誤標記來擴充翻譯的額外工作，引導 LLM 專注於修正標記的錯誤，產生比自動後編輯 (APE) 和從頭開始的 MT 更一致的進步。", "author": "Nathaniel Berger et.al.", "authors": "Nathaniel Berger, Stefan Riezler, Miriam Exel, Matthias Huck", "id": "2406.02267v1", "paper_url": "http://arxiv.org/abs/2406.02267v1", "repo": "null"}}