{"2411.13405": {"publish_time": "2024-11-20", "title": "On the Way to LLM Personalization: Learning to Remember User Conversations", "paper_summary": "Large Language Models (LLMs) have quickly become an invaluable assistant for\na variety of tasks. However, their effectiveness is constrained by their\nability to tailor responses to human preferences and behaviors via\npersonalization. Prior work in LLM personalization has largely focused on style\ntransfer or incorporating small factoids about the user, as knowledge injection\nremains an open challenge. In this paper, we explore injecting knowledge of\nprior conversations into LLMs to enable future work on less redundant,\npersonalized conversations. We identify two real-world constraints: (1)\nconversations are sequential in time and must be treated as such during\ntraining, and (2) per-user personalization is only viable in\nparameter-efficient settings. To this aim, we propose PLUM, a pipeline\nperforming data augmentation for up-sampling conversations as question-answer\npairs, that are then used to finetune a low-rank adaptation adapter with a\nweighted cross entropy loss. Even in this first exploration of the problem, we\nperform competitively with baselines such as RAG, attaining an accuracy of\n81.5% across 100 conversations.", "paper_summary_zh": "大型語言模型 (LLM) 已迅速成為各種任務中不可或缺的助手。然而，它們的有效性受到它們通過個人化調整回應以符合人類偏好和行為的能力的限制。LLM 個人化的先前工作主要集中在樣式轉移或納入有關使用者的少量事實，因為知識注入仍然是一個未解決的挑戰。在本文中，我們探討將先前對話的知識注入 LLM，以支持未來在冗餘較少、個性化的對話方面的工作。我們確定了兩個現實世界的限制：(1) 對話在時間上是連續的，並且在訓練期間必須這樣處理，以及 (2) 每用戶個人化僅在參數有效率的設定中可行。為此，我們提出了 PLUM，這是一個管道，執行資料擴充以對話作為問答對進行上採樣，然後用於微調低秩適應適配器，並使用加權交叉熵損失。即使在對問題的首次探討中，我們的表現也能與 RAG 等基準競爭，在 100 次對話中達到 81.5% 的準確度。", "author": "Lucie Charlotte Magister et.al.", "authors": "Lucie Charlotte Magister, Katherine Metcalf, Yizhe Zhang, Maartje ter Hoeve", "id": "2411.13405v1", "paper_url": "http://arxiv.org/abs/2411.13405v1", "repo": "null"}}