{"2406.15045": {"publish_time": "2024-06-21", "title": "Harnessing Knowledge Retrieval with Large Language Models for Clinical Report Error Correction", "paper_summary": "This study proposes an approach for error correction in clinical radiology\nreports, leveraging large language models (LLMs) and retrieval-augmented\ngeneration (RAG) techniques. The proposed framework employs internal and\nexternal retrieval mechanisms to extract relevant medical entities and\nrelations from the report and external knowledge sources. A three-stage\ninference process is introduced, decomposing the task into error detection,\nlocalization, and correction subtasks, which enhances the explainability and\nperformance of the system. The effectiveness of the approach is evaluated using\na benchmark dataset created by corrupting real-world radiology reports with\nrealistic errors, guided by domain experts. Experimental results demonstrate\nthe benefits of the proposed methods, with the combination of internal and\nexternal retrieval significantly improving the accuracy of error detection,\nlocalization, and correction across various state-of-the-art LLMs. The findings\ncontribute to the development of more robust and reliable error correction\nsystems for clinical documentation.", "paper_summary_zh": "本研究提出了一種臨床放射科報告中的錯誤校正方法，利用大型語言模型 (LLM) 和檢索增強生成 (RAG) 技術。所提出的框架採用內部和外部檢索機制從報告和外部知識來源中提取相關的醫療實體和關係。引入了三階段推理過程，將任務分解為錯誤檢測、定位和校正子任務，這增強了系統的可解釋性和性能。該方法的有效性使用基於領域專家的指導，通過破壞真實世界的放射科報告並加入實際錯誤而建立的基準資料集進行評估。實驗結果證明了所提出方法的優點，內部和外部檢索的結合顯著提高了各種最先進的 LLM 的錯誤檢測、定位和校正的準確性。這些發現有助於開發更強大、更可靠的臨床文件錯誤校正系統。", "author": "Jinge Wu et.al.", "authors": "Jinge Wu, Zhaolong Wu, Abul Hasan, Yunsoo Kim, Jason P. Y. Cheung, Teng Zhang, Honghan Wu", "id": "2406.15045v1", "paper_url": "http://arxiv.org/abs/2406.15045v1", "repo": "null"}}