{"2410.04084": {"publish_time": "2024-10-05", "title": "Taming the Tail: Leveraging Asymmetric Loss and Pade Approximation to Overcome Medical Image Long-Tailed Class Imbalance", "paper_summary": "Long-tailed problems in healthcare emerge from data imbalance due to\nvariability in the prevalence and representation of different medical\nconditions, warranting the requirement of precise and dependable classification\nmethods. Traditional loss functions such as cross-entropy and binary\ncross-entropy are often inadequate due to their inability to address the\nimbalances between the classes with high representation and the classes with\nlow representation found in medical image datasets. We introduce a novel\npolynomial loss function based on Pade approximation, designed specifically to\novercome the challenges associated with long-tailed classification. This\napproach incorporates asymmetric sampling techniques to better classify\nunder-represented classes. We conducted extensive evaluations on three publicly\navailable medical datasets and a proprietary medical dataset. Our\nimplementation of the proposed loss function is open-sourced in the public\nrepository:https://github.com/ipankhi/ALPA.", "paper_summary_zh": "醫療保健中的長尾問題源於數據不平衡，這是由於不同醫療狀況的流行率和表現存在變異性，這保證了對精確且可靠的分類方法的需求。傳統損失函數（例如交叉熵和二元交叉熵）通常不足，因為它們無法解決醫療影像資料集中表示率高的類別與表示率低的類別之間的不平衡。我們引入了一種基於 Pade 近似的多項式損失函數，專門設計用於克服與長尾分類相關的挑戰。此方法結合了非對稱抽樣技術，以更好地對代表性不足的類別進行分類。我們對三個公開的醫療資料集和一個專有醫療資料集進行了廣泛的評估。我們對提議損失函數的實作已在公共儲存庫中開源：https://github.com/ipankhi/ALPA。", "author": "Pankhi Kashyap et.al.", "authors": "Pankhi Kashyap, Pavni Tandon, Sunny Gupta, Abhishek Tiwari, Ritwik Kulkarni, Kshitij Sharad Jadhav", "id": "2410.04084v1", "paper_url": "http://arxiv.org/abs/2410.04084v1", "repo": "null"}}