{"2410.13303": {"publish_time": "2024-10-17", "title": "Hiformer: Hybrid Frequency Feature Enhancement Inverted Transformer for Long-Term Wind Power Prediction", "paper_summary": "The increasing severity of climate change necessitates an urgent transition\nto renewable energy sources, making the large-scale adoption of wind energy\ncrucial for mitigating environmental impact. However, the inherent uncertainty\nof wind power poses challenges for grid stability, underscoring the need for\naccurate wind energy prediction models to enable effective power system\nplanning and operation. While many existing studies on wind power prediction\nfocus on short-term forecasting, they often overlook the importance of\nlong-term predictions. Long-term wind power forecasting is essential for\neffective power grid dispatch and market transactions, as it requires careful\nconsideration of weather features such as wind speed and direction, which\ndirectly influence power output. Consequently, methods designed for short-term\npredictions may lead to inaccurate results and high computational costs in\nlong-term settings. To adress these limitations, we propose a novel approach\ncalled Hybrid Frequency Feature Enhancement Inverted Transformer (Hiformer).\nHiformer introduces a unique structure that integrates signal decomposition\ntechnology with weather feature extraction technique to enhance the modeling of\ncorrelations between meteorological conditions and wind power generation.\nAdditionally, Hiformer employs an encoder-only architecture, which reduces the\ncomputational complexity associated with long-term wind power forecasting.\nCompared to the state-of-the-art methods, Hiformer: (i) can improve the\nprediction accuracy by up to 52.5\\%; and (ii) can reduce computational time by\nup to 68.5\\%.", "paper_summary_zh": "氣候變遷日益嚴重，迫切需要轉向再生能源，因此大規模採用風能對於減緩環境影響至關重要。然而，風能的內在不確定性對電網穩定性構成挑戰，這突顯了對準確風能預測模型的需求，以實現有效的電力系統規劃和運作。雖然許多現有的風能預測研究都專注於短期預測，但它們常常忽略長期預測的重要性。長期風能預測對於有效的電網調度和市場交易至關重要，因為它需要仔細考慮天氣特徵，例如風速和風向，這些特徵會直接影響電力輸出。因此，專為短期預測而設計的方法在長期設置中可能會導致不準確的結果和高計算成本。為了解決這些限制，我們提出了一種稱為混合頻率特徵增強反轉Transformer (Hiformer) 的新方法。Hiformer 引入了一個獨特的結構，將信號分解技術與天氣特徵提取技術相結合，以增強氣象條件與風力發電之間相關性的建模。此外，Hiformer 採用僅編碼器架構，這降低了與長期風能預測相關的計算複雜度。與最先進的方法相比，Hiformer：(i) 可以將預測準確度提高多達 52.5%；(ii) 可以將計算時間減少多達 68.5%。", "author": "Chongyang Wan et.al.", "authors": "Chongyang Wan, Shunbo Lei, Yuan Luo", "id": "2410.13303v1", "paper_url": "http://arxiv.org/abs/2410.13303v1", "repo": "null"}}