{"2409.19961": {"publish_time": "2024-09-30", "title": "Multimodal LLM Enhanced Cross-lingual Cross-modal Retrieval", "paper_summary": "Cross-lingual cross-modal retrieval (CCR) aims to retrieve visually relevant\ncontent based on non-English queries, without relying on human-labeled\ncross-modal data pairs during training. One popular approach involves utilizing\nmachine translation (MT) to create pseudo-parallel data pairs, establishing\ncorrespondence between visual and non-English textual data. However, aligning\ntheir representations poses challenges due to the significant semantic gap\nbetween vision and text, as well as the lower quality of non-English\nrepresentations caused by pre-trained encoders and data noise. To overcome\nthese challenges, we propose LECCR, a novel solution that incorporates the\nmulti-modal large language model (MLLM) to improve the alignment between visual\nand non-English representations. Specifically, we first employ MLLM to generate\ndetailed visual content descriptions and aggregate them into multi-view\nsemantic slots that encapsulate different semantics. Then, we take these\nsemantic slots as internal features and leverage them to interact with the\nvisual features. By doing so, we enhance the semantic information within the\nvisual features, narrowing the semantic gap between modalities and generating\nlocal visual semantics for subsequent multi-level matching. Additionally, to\nfurther enhance the alignment between visual and non-English features, we\nintroduce softened matching under English guidance. This approach provides more\ncomprehensive and reliable inter-modal correspondences between visual and\nnon-English features. Extensive experiments on four CCR benchmarks, \\ie\nMulti30K, MSCOCO, VATEX, and MSR-VTT-CN, demonstrate the effectiveness of our\nproposed method. Code: \\url{https://github.com/LiJiaBei-7/leccr}.", "paper_summary_zh": "跨語言跨模態檢索 (CCR) 旨在根據非英語查詢檢索視覺相關內容，而無需在訓練過程中依賴人工標記的跨模態資料對。一種流行的方法涉及利用機器翻譯 (MT) 來建立偽平行資料對，建立視覺與非英語文本資料之間的對應關係。然而，由於視覺與文本之間存在顯著的語義差距，以及預訓練編碼器和資料雜訊造成的非英語表示品質較低，因此對齊其表示會帶來挑戰。為了克服這些挑戰，我們提出了 LECCR，這是一種結合多模態大型語言模型 (MLLM) 來改善視覺與非英語表示之間對齊的新穎解決方案。具體來說，我們首先使用 MLLM 來產生詳細的視覺內容描述，並將它們匯總到包含不同語義的多視角語義槽中。然後，我們將這些語義槽作為內部特徵，並利用它們與視覺特徵進行互動。透過這樣做，我們增強了視覺特徵中的語義資訊，縮小了模態之間的語義差距，並為後續的多層次匹配產生了局部視覺語義。此外，為了進一步增強視覺與非英語特徵之間的對齊，我們引入了在英語指導下的軟化匹配。這種方法提供了視覺與非英語特徵之間更全面且可靠的跨模態對應關係。在四個 CCR 基準上的廣泛實驗，即 Multi30K、MSCOCO、VATEX 和 MSR-VTT-CN，證明了我們提出的方法的有效性。程式碼：\\url{https://github.com/LiJiaBei-7/leccr}。", "author": "Yabing Wang et.al.", "authors": "Yabing Wang, Le Wang, Qiang Zhou, Zhibin Wang, Hao Li, Gang Hua, Wei Tang", "id": "2409.19961v1", "paper_url": "http://arxiv.org/abs/2409.19961v1", "repo": "null"}}