{"2411.07656": {"publish_time": "2024-11-12", "title": "Mitigating Bias in Queer Representation within Large Language Models: A Collaborative Agent Approach", "paper_summary": "Large Language Models (LLMs) often perpetuate biases in pronoun usage,\nleading to misrepresentation or exclusion of queer individuals. This paper\naddresses the specific problem of biased pronoun usage in LLM outputs,\nparticularly the inappropriate use of traditionally gendered pronouns (\"he,\"\n\"she\") when inclusive language is needed to accurately represent all\nidentities. We introduce a collaborative agent pipeline designed to mitigate\nthese biases by analyzing and optimizing pronoun usage for inclusivity. Our\nmulti-agent framework includes specialized agents for both bias detection and\ncorrection. Experimental evaluations using the Tango dataset-a benchmark\nfocused on gender pronoun usage-demonstrate that our approach significantly\nimproves inclusive pronoun classification, achieving a 32.6 percentage point\nincrease over GPT-4o in correctly disagreeing with inappropriate traditionally\ngendered pronouns $(\\chi^2 = 38.57, p < 0.0001)$. These results accentuate the\npotential of agent-driven frameworks in enhancing fairness and inclusivity in\nAI-generated content, demonstrating their efficacy in reducing biases and\npromoting socially responsible AI.", "paper_summary_zh": "大型語言模型 (LLM) 通常會延續代名詞使用上的偏見，導致對酷兒個人的錯誤陳述或排斥。本文探討 LLM 輸出中代名詞使用有偏見的特定問題，特別是不當使用傳統的性別代名詞（「他」、「她」），而需要包容性的語言來準確代表所有身分。我們引入一個協作代理管道，旨在透過分析和最佳化代名詞的使用來減輕這些偏見以促進包容性。我們的多代理架構包含專門的代理，用於偏見偵測和校正。使用 Tango 資料集（一個專注於性別代名詞使用的基準）進行的實驗評估顯示，我們的做法顯著改善了包容性代名詞分類，在正確不同意不適當的傳統性別代名詞上，比 GPT-4o 提高了 32.6 個百分點（χ2 = 38.57，p < 0.0001）。這些結果突顯了代理驅動架構在增強 AI 產出內容中的公平性和包容性方面的潛力，證明了它們在減少偏見和促進社會責任 AI 方面的效能。", "author": "Tianyi Huang et.al.", "authors": "Tianyi Huang, Arya Somasundaram", "id": "2411.07656v1", "paper_url": "http://arxiv.org/abs/2411.07656v1", "repo": "https://github.com/tonyhrule/queer-bias-llms"}}