{"2410.08911": {"publish_time": "2024-10-11", "title": "Test-driven Software Experimentation with LASSO: an LLM Benchmarking Example", "paper_summary": "Empirical software engineering faces a critical gap: the lack of standardized\ntools for rapid development and execution of Test-Driven Software Experiments\n(TDSEs) - that is, experiments that involve the execution of software subjects\nand the observation and analysis of their \"de facto\" run-time behavior. In this\npaper we present a general-purpose analysis platform called LASSO that provides\na minimal set of domain-specific languages and data structures to conduct\nTDSEs. By empowering users with an executable scripting language to design and\nexecute TDSEs, LASSO enables efficient evaluation of run-time semantics and\nexecution characteristics in addition to statically determined properties. We\npresent an example TDSE that demonstrates the practical benefits of LASSO's\nscripting capabilities for assessing the reliability of LLMs for code\ngeneration by means of a self-contained, reusable and extensible study script.\nThe LASSO platform is freely available at:\nhttps://softwareobservatorium.github.io/, and a demo video is available on\nYouTube: https://youtu.be/tzY9oNTWXzw", "paper_summary_zh": "經驗軟體工程面臨一個重大的缺口：缺乏標準化的工具，用於快速開發和執行測試驅動軟體實驗 (TDSE)，也就是包含執行軟體主體，以及觀察和分析其「實際」執行時間行為的實驗。在本文中，我們提出一個通用的分析平台，稱為 LASSO，它提供一組最小的特定領域語言和資料結構，以進行 TDSE。透過讓使用者使用可執行腳本語言來設計和執行 TDSE，LASSO 能夠有效評估執行時間語意和執行特性，以及靜態確定的屬性。我們提出一個 TDSE 範例，展示 LASSO 腳本功能的實際優點，用於評估 LLM 的可靠性，以進行代碼生成，透過一個獨立、可重複使用且可擴充的研究腳本。LASSO 平台可免費取得：https://softwareobservatorium.github.io/，並在 YouTube 上提供示範影片：https://youtu.be/tzY9oNTWXzw", "author": "Marcus Kessel et.al.", "authors": "Marcus Kessel", "id": "2410.08911v1", "paper_url": "http://arxiv.org/abs/2410.08911v1", "repo": "null"}}