{"2412.11919": {"publish_time": "2024-12-16", "title": "RetroLLM: Empowering Large Language Models to Retrieve Fine-grained Evidence within Generation", "paper_summary": "Large language models (LLMs) exhibit remarkable generative capabilities but\noften suffer from hallucinations. Retrieval-augmented generation (RAG) offers\nan effective solution by incorporating external knowledge, but existing methods\nstill face several limitations: additional deployment costs of separate\nretrievers, redundant input tokens from retrieved text chunks, and the lack of\njoint optimization of retrieval and generation. To address these issues, we\npropose \\textbf{RetroLLM}, a unified framework that integrates retrieval and\ngeneration into a single, cohesive process, enabling LLMs to directly generate\nfine-grained evidence from the corpus with constrained decoding. Moreover, to\nmitigate false pruning in the process of constrained evidence generation, we\nintroduce (1) hierarchical FM-Index constraints, which generate\ncorpus-constrained clues to identify a subset of relevant documents before\nevidence generation, reducing irrelevant decoding space; and (2) a\nforward-looking constrained decoding strategy, which considers the relevance of\nfuture sequences to improve evidence accuracy. Extensive experiments on five\nopen-domain QA datasets demonstrate RetroLLM's superior performance across both\nin-domain and out-of-domain tasks. The code is available at\n\\url{https://github.com/sunnynexus/RetroLLM}.", "paper_summary_zh": "大型語言模型 (LLM) 展現出卓越的生成能力，但常常會出現幻覺。檢索增強生成 (RAG) 提供了一個有效的解決方案，方法是納入外部知識，但現有方法仍然面臨幾個限制：獨立檢索器的額外部署成本、檢索的文字片段中重複的輸入代碼，以及缺乏檢索和生成的聯合最佳化。為了解決這些問題，我們提出 \\textbf{RetroLLM}，一個統一的架構，將檢索和生成整合到一個單一的、有凝聚力的過程中，使 LLM 能夠直接從語料庫中生成細緻的證據，並進行約束解碼。此外，為了減輕受約束證據生成過程中錯誤的修剪，我們引入了 (1) 層級式 FM-Index 約束，在生成證據之前產生語料庫約束的線索，以識別相關文件子集，減少不相關的解碼空間；以及 (2) 前瞻性的約束解碼策略，考慮未來序列的相關性，以提高證據準確性。在五個開放領域 QA 資料集上的大量實驗證明了 RetroLLM 在領域內和領域外任務中的優異性能。程式碼可以在 \\url{https://github.com/sunnynexus/RetroLLM} 取得。", "author": "Xiaoxi Li et.al.", "authors": "Xiaoxi Li, Jiajie Jin, Yujia Zhou, Yongkang Wu, Zhonghua Li, Qi Ye, Zhicheng Dou", "id": "2412.11919v1", "paper_url": "http://arxiv.org/abs/2412.11919v1", "repo": "https://github.com/sunnynexus/retrollm"}}