{"2411.09184": {"publish_time": "2024-11-14", "title": "Dynamic technology impact analysis: A multi-task learning approach to patent citation prediction", "paper_summary": "Machine learning (ML) models are valuable tools for analyzing the impact of\ntechnology using patent citation information. However, existing ML-based\nmethods often struggle to account for the dynamic nature of the technology\nimpact over time and the interdependencies of these impacts across different\nperiods. This study proposes a multi-task learning (MTL) approach to enhance\nthe prediction of technology impact across various time frames by leveraging\nknowledge sharing and simultaneously monitoring the evolution of technology\nimpact. First, we quantify the technology impacts and identify patterns through\ncitation analysis over distinct time periods. Next, we develop MTL models to\npredict citation counts using multiple patent indicators over time. Finally, we\nexamine the changes in key input indicators and their patterns over different\nperiods using the SHapley Additive exPlanation method. We also offer guidelines\nfor validating and interpreting the results by employing statistical methods\nand natural language processing techniques. A case study on battery\ntechnologies demonstrates that our approach not only deepens the understanding\nof technology impact, but also improves prediction accuracy, yielding valuable\ninsights for both academia and industry.", "paper_summary_zh": "機器學習 (ML) 模型是使用專利引文資訊分析技術影響力的有價值工具。然而，現有的基於 ML 的方法通常難以考量技術影響力隨著時間推移的動態性質，以及這些影響力在不同時期的相互依賴性。本研究提出一個多任務學習 (MTL) 方法，透過利用知識共享和同時監控技術影響力的演變，來增強對各種時間範圍內技術影響力的預測。首先，我們透過不同時間區段的引文分析，量化技術影響力和找出模式。接下來，我們開發 MTL 模型，以使用多個專利指標預測隨著時間推移的引文計數。最後，我們使用 SHapley 加法解釋方法，檢查關鍵輸入指標的變化及其在不同時期的模式。我們還提供透過採用統計方法和自然語言處理技術，來驗證和詮釋結果的指南。電池技術的案例研究證明，我們的做法不僅加深了對技術影響力的理解，也提高了預測準確度，為學術界和產業提供了有價值的見解。", "author": "Youngjin Seol et.al.", "authors": "Youngjin Seol, Jaewoong Choi, Seunghyun Lee, Janghyeok Yoon", "id": "2411.09184v1", "paper_url": "http://arxiv.org/abs/2411.09184v1", "repo": "null"}}