{"2409.16689": {"publish_time": "2024-09-25", "title": "Layout-Corrector: Alleviating Layout Sticking Phenomenon in Discrete Diffusion Model", "paper_summary": "Layout generation is a task to synthesize a harmonious layout with elements\ncharacterized by attributes such as category, position, and size. Human\ndesigners experiment with the placement and modification of elements to create\naesthetic layouts, however, we observed that current discrete diffusion models\n(DDMs) struggle to correct inharmonious layouts after they have been generated.\nIn this paper, we first provide novel insights into layout sticking phenomenon\nin DDMs and then propose a simple yet effective layout-assessment module\nLayout-Corrector, which works in conjunction with existing DDMs to address the\nlayout sticking problem. We present a learning-based module capable of\nidentifying inharmonious elements within layouts, considering overall layout\nharmony characterized by complex composition. During the generation process,\nLayout-Corrector evaluates the correctness of each token in the generated\nlayout, reinitializing those with low scores to the ungenerated state. The DDM\nthen uses the high-scored tokens as clues to regenerate the harmonized tokens.\nLayout-Corrector, tested on common benchmarks, consistently boosts\nlayout-generation performance when in conjunction with various state-of-the-art\nDDMs. Furthermore, our extensive analysis demonstrates that the\nLayout-Corrector (1) successfully identifies erroneous tokens, (2) facilitates\ncontrol over the fidelity-diversity trade-off, and (3) significantly mitigates\nthe performance drop associated with fast sampling.", "paper_summary_zh": "版面生成是綜合元素的一項任務，這些元素的特徵在於類別、位置和大小等屬性。人類設計師會嘗試元素的擺放和修改，以建立美觀的版面，然而，我們觀察到目前的離散擴散模型 (DDM) 在生成不協調的版面後，難以進行修正。在本文中，我們首先提供對 DDM 中版面黏著現象的新見解，然後提出一個簡單但有效的版面評估模組 Layout-Corrector，它與現有的 DDM 協同運作，以解決版面黏著問題。我們提出一個基於學習的模組，能夠識別版面中的不協調元素，並考量由複雜組合所特徵化的整體版面和諧性。在生成過程中，Layout-Corrector 評估生成版面中每個標記的正確性，將評分較低的標記重新初始化為未生成狀態。然後，DDM 使用高分標記作為線索，重新生成和諧的標記。Layout-Corrector 在常見的基準測試中經過測試，與各種最先進的 DDM 結合使用時，始終提升版面生成效能。此外，我們廣泛的分析證明，Layout-Corrector (1) 成功識別錯誤標記，(2) 促進對保真度和多樣性權衡的控制，以及 (3) 大幅減輕與快速取樣相關的效能下降。", "author": "Shoma Iwai et.al.", "authors": "Shoma Iwai, Atsuki Osanai, Shunsuke Kitada, Shinichiro Omachi", "id": "2409.16689v1", "paper_url": "http://arxiv.org/abs/2409.16689v1", "repo": "null"}}