{"2407.18808": {"publish_time": "2024-07-26", "title": "Learning Chaotic Systems and Long-Term Predictions with Neural Jump ODEs", "paper_summary": "The Path-dependent Neural Jump ODE (PD-NJ-ODE) is a model for online\nprediction of generic (possibly non-Markovian) stochastic processes with\nirregular (in time) and potentially incomplete (with respect to coordinates)\nobservations. It is a model for which convergence to the $L^2$-optimal\npredictor, which is given by the conditional expectation, is established\ntheoretically. Thereby, the training of the model is solely based on a dataset\nof realizations of the underlying stochastic process, without the need of\nknowledge of the law of the process. In the case where the underlying process\nis deterministic, the conditional expectation coincides with the process\nitself. Therefore, this framework can equivalently be used to learn the\ndynamics of ODE or PDE systems solely from realizations of the dynamical system\nwith different initial conditions. We showcase the potential of our method by\napplying it to the chaotic system of a double pendulum. When training the\nstandard PD-NJ-ODE method, we see that the prediction starts to diverge from\nthe true path after about half of the evaluation time. In this work we enhance\nthe model with two novel ideas, which independently of each other improve the\nperformance of our modelling setup. The resulting dynamics match the true\ndynamics of the chaotic system very closely. The same enhancements can be used\nto provably enable the PD-NJ-ODE to learn long-term predictions for general\nstochastic datasets, where the standard model fails. This is verified in\nseveral experiments.", "paper_summary_zh": "基於路徑的神經跳躍 ODE（PD-NJ-ODE）是一個模型，用於線上預測通用的（可能是非馬可夫鏈的）隨機過程，具有不規則（在時間上）和潛在不完整（相對於坐標）的觀測。這是一個模型，其收斂到 $L^2$ 最佳預測器，由條件期望給出，在理論上已建立。因此，模型的訓練僅基於基礎隨機過程實現的資料集，無需了解過程的規律。在基礎過程是確定性的情況下，條件期望與過程本身一致。因此，這個框架可以等效地用於僅從具有不同初始條件的動力系統實現中學習 ODE 或 PDE 系統的動力學。我們通過將我們的模型應用於雙擺的混沌系統來展示我們方法的潛力。在訓練標準 PD-NJ-ODE 方法時，我們看到預測在評估時間過了一半後開始偏離真實路徑。在這項工作中，我們使用兩個新穎的想法來增強模型，它們獨立於彼此提高了我們建模設定的性能。產生的動力學與混沌系統的真實動力學非常吻合。相同的增強可以用於證明使 PD-NJ-ODE 能學習一般隨機資料集的長期預測，而標準模型會失敗。這在幾個實驗中得到驗證。", "author": "Florian Krach et.al.", "authors": "Florian Krach, Josef Teichmann", "id": "2407.18808v1", "paper_url": "http://arxiv.org/abs/2407.18808v1", "repo": "null"}}