{"2410.11756": {"publish_time": "2024-10-15", "title": "Evidence of Cognitive Deficits andDevelopmental Advances in Generative AI: A Clock Drawing Test Analysis", "paper_summary": "Generative AI's rapid advancement sparks interest in its cognitive abilities,\nespecially given its capacity for tasks like language understanding and code\ngeneration. This study explores how several recent GenAI models perform on the\nClock Drawing Test (CDT), a neuropsychological assessment of visuospatial\nplanning and organization. While models create clock-like drawings, they\nstruggle with accurate time representation, showing deficits similar to\nmild-severe cognitive impairment (Wechsler, 2009). Errors include numerical\nsequencing issues, incorrect clock times, and irrelevant additions, despite\naccurate rendering of clock features. Only GPT 4 Turbo and Gemini Pro 1.5\nproduced the correct time, scoring like healthy individuals (4/4). A follow-up\nclock-reading test revealed only Sonnet 3.5 succeeded, suggesting drawing\ndeficits stem from difficulty with numerical concepts. These findings may\nreflect weaknesses in visual-spatial understanding, working memory, or\ncalculation, highlighting strengths in learned knowledge but weaknesses in\nreasoning. Comparing human and machine performance is crucial for understanding\nAI's cognitive capabilities and guiding development toward human-like cognitive\nfunctions.", "paper_summary_zh": "生成式 AI 的快速进步引发了人们对其认知能力的兴趣，尤其是在其具备语言理解和代码生成等任务的能力的情况下。本研究探讨了几个近期 GenAI 模型在时钟绘画测试 (CDT) 中的表现，时钟绘画测试是一种神经心理学评估，用于评估视觉空间规划和组织能力。虽然模型会创建类似时钟的图画，但它们在准确的时间表示方面存在困难，表现出类似于轻度至重度认知障碍的缺陷（Wechsler，2009）。错误包括数字排序问题、不正确的时钟时间和无关的附加内容，尽管时钟功能的呈现准确。只有 GPT 4 Turbo 和 Gemini Pro 1.5 给出了正确的时间，得分与健康个体相同（4/4）。后续时钟阅读测试显示，只有 Sonnet 3.5 成功，表明绘画缺陷源于数字概念的困难。这些发现可能反映了视觉空间理解、工作记忆或计算方面的弱点，突出了学习知识的优势，但推理方面的弱点。比较人类和机器的性能对于理解 AI 的认知能力和指导开发朝着类人认知功能发展至关重要。", "author": "Isaac R. Galatzer-Levy et.al.", "authors": "Isaac R. Galatzer-Levy, Jed McGiffin, David Munday, Xin Liu, Danny Karmon, Ilia Labzovsky, Rivka Moroshko, Amir Zait, Daniel McDuff", "id": "2410.11756v1", "paper_url": "http://arxiv.org/abs/2410.11756v1", "repo": "null"}}