{"2412.09998": {"publish_time": "2024-12-13", "title": "Cycle-Consistent Bridge Diffusion Model for Accelerated MRI Reconstruction", "paper_summary": "Accelerated MRI reconstruction techniques aim to reduce examination time\nwhile maintaining high image fidelity, which is highly desirable in clinical\nsettings for improving patient comfort and hospital efficiency. Existing deep\nlearning methods typically reconstruct images from under-sampled data with\ntraditional reconstruction approaches, but they still struggle to provide\nhigh-fidelity results. Diffusion models show great potential to improve\nfidelity of generated images in recent years. However, their inference process\nstarting with a random Gaussian noise introduces instability into the results\nand usually requires thousands of sampling steps, resulting in sub-optimal\nreconstruction quality and low efficiency. To address these challenges, we\npropose Cycle-Consistent Bridge Diffusion Model (CBDM). CBDM employs two bridge\ndiffusion models to construct a cycle-consistent diffusion process with a\nconsistency loss, enhancing the fine-grained details of reconstructed images\nand reducing the number of diffusion steps. Moreover, CBDM incorporates a\nContourlet Decomposition Embedding Module (CDEM) which captures multi-scale\nstructural texture knowledge in images through frequency domain decomposition\npyramids and directional filter banks to improve structural fidelity. Extensive\nexperiments demonstrate the superiority of our model by higher reconstruction\nquality and fewer training iterations, achieving a new state of the art for\naccelerated MRI reconstruction in both fastMRI and IXI datasets.", "paper_summary_zh": "加速式 MRI 重建技術旨在縮短檢查時間，同時維持高影像保真度，這在臨床環境中非常理想，可提升病患舒適度和醫院效率。現有的深度學習方法通常使用傳統重建方法從欠採樣數據重建影像，但仍難以提供高保真度結果。擴散模型在近年展現出提升生成影像保真度的絕佳潛力。然而，其從隨機高斯雜訊開始的推論過程會為結果帶來不穩定性，且通常需要數千個採樣步驟，導致次最佳重建品質和低效率。為了應對這些挑戰，我們提出循環一致橋接擴散模型 (CBDM)。CBDM 使用兩個橋接擴散模型，建構一個具有相容性損失的循環一致擴散過程，增強重建影像的精細細節並減少擴散步驟的數量。此外，CBDM 整合了一個輪廓分解嵌入模組 (CDEM)，透過頻域分解金字塔和方向濾波器組在影像中擷取多尺度結構紋理知識，以提升結構保真度。廣泛的實驗證明了我們模型的優異性，具有更高的重建品質和更少的訓練反覆運算，在 fastMRI 和 IXI 資料集的加速式 MRI 重建中達成新的技術水準。", "author": "Tao Song et.al.", "authors": "Tao Song, Yicheng Wu, Minhao Hu, Xiangde Luo, Guoting Luo, Guotai Wang, Yi Guo, Feng Xu, Shaoting Zhang", "id": "2412.09998v1", "paper_url": "http://arxiv.org/abs/2412.09998v1", "repo": "null"}}