{"2411.16313": {"publish_time": "2024-11-25", "title": "CATP-LLM: Empowering Large Language Models for Cost-Aware Tool Planning", "paper_summary": "Utilizing large language models (LLMs) for tool planning has emerged as a\npromising avenue for developing general AI systems, where LLMs automatically\nschedule external tools (e.g. vision models) to tackle complex tasks based on\ntask descriptions. To push this paradigm toward practical applications, it is\ncrucial for LLMs to consider tool execution costs (e.g. execution time) for\ntool planning. Unfortunately, prior studies overlook the tool execution costs,\nleading to the generation of expensive plans of which the costs outweigh task\nperformance. To fill this gap, we propose the Cost-Aware Tool Planning with\nLLMs (CATP-LLM) framework, which for the first time provides a coherent design\nto empower LLMs for cost-aware tool planning. Specifically, CATP-LLM\nincorporates a tool planning language to enhance the LLM to generate\nnon-sequential plans of multiple branches for efficient concurrent tool\nexecution and cost reduction. Moreover, it further designs a cost-aware offline\nreinforcement learning algorithm to fine-tune the LLM to optimize the\nperformance-cost trade-off in tool planning. In lack of public cost-related\ndatasets, we further present OpenCATP, the first platform for cost-aware\nplanning evaluation. Experiments on OpenCATP show that CATP-LLM outperforms\nGPT-4 even when using Llama2-7B as its backbone, with the average improvement\nof 28.2%-30.2% higher plan performance and 24.7%-45.8% lower costs even on the\nchallenging planning tasks. The codes of CATP-LLM and OpenCATP will be publicly\navailable.", "paper_summary_zh": "利用大型語言模型 (LLM) 進行工具規劃已成為開發通用 AI 系統的一條有前途的途徑，其中 LLM 會根據任務描述自動安排外部工具（例如視覺模型）來處理複雜的任務。為了將此範例推向實務應用，LLM 必須考量工具執行成本（例如執行時間）以進行工具規劃。遺憾的是，先前的研究忽略了工具執行成本，導致產生了成本大於任務效能的昂貴計畫。為了填補此一缺口，我們提出了具備成本意識的 LLM 工具規劃 (CATP-LLM) 架構，該架構首次提供了相干的設計，以賦予 LLM 成本意識的工具規劃能力。具體來說，CATP-LLM 結合了工具規劃語言，以增強 LLM 產生非順序的多分支計畫，以進行有效的並行工具執行和降低成本。此外，它進一步設計了一種具備成本意識的離線強化學習演算法，以微調 LLM，以最佳化工具規劃中的效能成本取捨。由於缺乏公開的成本相關資料集，我們進一步提出了 OpenCATP，這是第一個用於具備成本意識的規劃評估的平台。在 OpenCATP 上的實驗顯示，即使使用 Llama2-7B 作為其主幹，CATP-LLM 仍優於 GPT-4，平均效能提升 28.2%-30.2%，成本降低 24.7%-45.8%，即使在具有挑戰性的規劃任務上也是如此。CATP-LLM 和 OpenCATP 的程式碼將公開提供。", "author": "Duo Wu et.al.", "authors": "Duo Wu, Jinghe Wang, Yuan Meng, Yanning Zhang, Le Sun, Zhi Wang", "id": "2411.16313v1", "paper_url": "http://arxiv.org/abs/2411.16313v1", "repo": "null"}}