{"2408.08780": {"publish_time": "2024-08-16", "title": "Large Language Models Might Not Care What You Are Saying: Prompt Format Beats Descriptions", "paper_summary": "With the help of in-context learning (ICL), large language models (LLMs) have\nachieved impressive performance across various tasks. However, the function of\ndescriptive instructions during ICL remains under-explored. In this work, we\npropose an ensemble prompt framework to describe the selection criteria of\nmultiple in-context examples, and preliminary experiments on machine\ntranslation (MT) across six translation directions confirm that this framework\nboosts ICL perfromance. But to our surprise, LLMs might not necessarily care\nwhat the descriptions actually say, and the performance gain is primarily\ncaused by the ensemble format, since the framework could lead to improvement\neven with random descriptive nouns. We further apply this new ensemble prompt\non a range of commonsense, math, logical reasoning and hallucination tasks with\nthree LLMs and achieve promising results, suggesting again that designing a\nproper prompt format would be much more effective and efficient than paying\neffort into specific descriptions. Our code will be publicly available once\nthis paper is published.", "paper_summary_zh": "在上下文學習 (ICL) 的幫助下，大型語言模型 (LLM) 在各種任務中都取得了令人印象深刻的表現。然而，描述性說明在 ICL 中的功能仍未得到充分探討。在這項工作中，我們提出了一個整體提示框架來描述多個上下文範例的選擇標準，並且在六種翻譯方向的機器翻譯 (MT) 上進行的初步實驗證實了這個框架提升了 ICL 的表現。但令我們驚訝的是，LLM 可能不一定在乎說明實際上說了什麼，而效能提升主要是由整體格式造成的，因為這個框架甚至可以透過隨機描述性名詞來帶來改善。我們進一步將這個新的整體提示應用在常識、數學、邏輯推理和幻覺任務的範圍中，並使用三個 LLM 並獲得有希望的結果，再次表明設計適當的提示格式將比在特定說明上投入精力更有效率。一旦這篇論文發表，我們的程式碼將公開。", "author": "Chenming Tang et.al.", "authors": "Chenming Tang, Zhixiang Wang, Yunfang Wu", "id": "2408.08780v1", "paper_url": "http://arxiv.org/abs/2408.08780v1", "repo": "null"}}