{"2501.07978": {"publish_time": "2025-01-14", "title": "Facial Dynamics in Video: Instruction Tuning for Improved Facial Expression Perception and Contextual Awareness", "paper_summary": "Facial expression captioning has found widespread application across various\ndomains. Recently, the emergence of video Multimodal Large Language Models\n(MLLMs) has shown promise in general video understanding tasks. However,\ndescribing facial expressions within videos poses two major challenges for\nthese models: (1) the lack of adequate datasets and benchmarks, and (2) the\nlimited visual token capacity of video MLLMs. To address these issues, this\npaper introduces a new instruction-following dataset tailored for dynamic\nfacial expression caption. The dataset comprises 5,033 high-quality video clips\nannotated manually, containing over 700,000 tokens. Its purpose is to improve\nthe capability of video MLLMs to discern subtle facial nuances. Furthermore, we\npropose FaceTrack-MM, which leverages a limited number of tokens to encode the\nmain character's face. This model demonstrates superior performance in tracking\nfaces and focusing on the facial expressions of the main characters, even in\nintricate multi-person scenarios. Additionally, we introduce a novel evaluation\nmetric combining event extraction, relation classification, and the longest\ncommon subsequence (LCS) algorithm to assess the content consistency and\ntemporal sequence consistency of generated text. Moreover, we present\nFEC-Bench, a benchmark designed to assess the performance of existing video\nMLLMs in this specific task. All data and source code will be made publicly\navailable.", "paper_summary_zh": "人臉表情標題在各種領域中已廣泛應用。最近，視頻多模態大型語言模型 (MLLM) 的出現已在一般的視頻理解任務中展現出前景。然而，在視頻中描述人臉表情對這些模型提出了兩大挑戰：(1) 缺乏足夠的數據集和基準，以及 (2) 視頻 MLLM 的視覺令牌容量有限。為了解決這些問題，本文介紹了一個新的指令遵循數據集，專門針對動態人臉表情標題。該數據集包含 5,033 個手動註釋的高品質視頻剪輯，包含超過 700,000 個令牌。其目的是提高視頻 MLLM 辨別細微面部細微差別的能力。此外，我們提出了 FaceTrack-MM，它利用有限數量的令牌對主角色的臉部進行編碼。此模型在追蹤臉部和關注主要角色的面部表情方面表現出優異的性能，即使在複雜的多人場景中也是如此。此外，我們引入了一種新的評估指標，結合事件提取、關係分類和最長公共子序列 (LCS) 演算法，以評估生成文本的內容一致性和時間順序一致性。此外，我們還提出了 FEC-Bench，這是一個基準，旨在評估現有視頻 MLLM 在此特定任務中的性能。所有數據和源代碼都將公開提供。", "author": "Jiaxing Zhao et.al.", "authors": "Jiaxing Zhao, Boyuan Sun, Xiang Chen, Xihan Wei", "id": "2501.07978v1", "paper_url": "http://arxiv.org/abs/2501.07978v1", "repo": "null"}}