{"2409.03937": {"publish_time": "2024-09-05", "title": "Harnessing LLMs for Cross-City OD Flow Prediction", "paper_summary": "Understanding and predicting Origin-Destination (OD) flows is crucial for\nurban planning and transportation management. Traditional OD prediction models,\nwhile effective within single cities, often face limitations when applied\nacross different cities due to varied traffic conditions, urban layouts, and\nsocio-economic factors. In this paper, by employing Large Language Models\n(LLMs), we introduce a new method for cross-city OD flow prediction. Our\napproach leverages the advanced semantic understanding and contextual learning\ncapabilities of LLMs to bridge the gap between cities with different\ncharacteristics, providing a robust and adaptable solution for accurate OD flow\nprediction that can be transferred from one city to another. Our novel\nframework involves four major components: collecting OD training datasets from\na source city, instruction-tuning the LLMs, predicting destination POIs in a\ntarget city, and identifying the locations that best match the predicted\ndestination POIs. We introduce a new loss function that integrates POI\nsemantics and trip distance during training. By extracting high-quality\nsemantic features from human mobility and POI data, the model understands\nspatial and functional relationships within urban spaces and captures\ninteractions between individuals and various POIs. Extensive experimental\nresults demonstrate the superiority of our approach over the state-of-the-art\nlearning-based methods in cross-city OD flow prediction.", "paper_summary_zh": "了解和預測原點-目的地 (OD) 流量對於城市規劃和交通管理至關重要。傳統的 OD 預測模型在單一城市中很有效，但在應用於不同城市時，由於交通狀況、城市佈局和社會經濟因素的不同，通常會面臨限制。在本文中，通過使用大型語言模型 (LLM)，我們介紹了一種新的跨城市 OD 流量預測方法。我們的做法利用了 LLM 的先進語義理解和上下文學習能力，彌合了不同特徵城市之間的差距，提供了一個穩健且適應性強的解決方案，可以準確預測 OD 流量，並可以從一個城市轉移到另一個城市。我們的新框架包含四個主要組成部分：從源城市收集 OD 訓練數據集、對 LLM 進行指令微調、預測目標城市中的目的地 POI，以及識別與預測目的地 POI 最匹配的位置。我們引入了一個新的損失函數，它在訓練期間整合了 POI 語義和行程距離。通過從人類流動性和 POI 數據中提取高質量的語義特徵，該模型理解了城市空間內的空間和功能關係，並捕捉了個人與各種 POI 之間的互動。大量的實驗結果證明了我們的方法在跨城市 OD 流量預測中優於最先進的基於學習的方法。", "author": "Chenyang Yu et.al.", "authors": "Chenyang Yu, Xinpeng Xie, Yan Huang, Chenxi Qiu", "id": "2409.03937v1", "paper_url": "http://arxiv.org/abs/2409.03937v1", "repo": "null"}}