{"2405.05376": {"publish_time": "2024-05-08", "title": "Kreyòl-MT: Building MT for Latin American, Caribbean and Colonial African Creole Languages", "paper_summary": "A majority of language technologies are tailored for a small number of\nhigh-resource languages, while relatively many low-resource languages are\nneglected. One such group, Creole languages, have long been marginalized in\nacademic study, though their speakers could benefit from machine translation\n(MT). These languages are predominantly used in much of Latin America, Africa\nand the Caribbean. We present the largest cumulative dataset to date for Creole\nlanguage MT, including 14.5M unique Creole sentences with parallel translations\n-- 11.6M of which we release publicly, and the largest bitexts gathered to date\nfor 41 languages -- the first ever for 21. In addition, we provide MT models\nsupporting all 41 Creole languages in 172 translation directions. Given our\ndiverse dataset, we produce a model for Creole language MT exposed to more\ngenre diversity than ever before, which outperforms a genre-specific Creole MT\nmodel on its own benchmark for 23 of 34 translation directions.", "paper_summary_zh": "大部分語言技術都是為少數高資源語言量身打造，而相對較多的低資源語言則被忽視。克里奧爾語就是這樣的一個群體，長期以來在學術研究中被邊緣化，儘管他們的使用者可以從機器翻譯 (MT) 中受益。這些語言主要用於拉丁美洲、非洲和加勒比海地區的大部分地區。我們提供了迄今為止最大的克里奧爾語 MT 累積數據集，其中包括 1450 萬個帶有並行翻譯的獨特克里奧爾語句子——我們公開發布了其中的 1160 萬個，以及迄今為止為 41 種語言收集的最大雙語語料庫——其中 21 種是首次收集。此外，我們還提供了支持所有 41 種克里奧爾語的 MT 模型，共有 172 個翻譯方向。鑑於我們多樣化的數據集，我們為克里奧爾語 MT 生成了模型，該模型接觸到的類型比以往任何時候都更多，在 34 個翻譯方向中的 23 個方向上，它都優於針對特定類型的克里奧爾語 MT 模型在其自己的基準上。", "author": "Nathaniel R. Robinson et.al.", "authors": "Nathaniel R. Robinson, Raj Dabre, Ammon Shurtz, Rasul Dent, Onenamiyi Onesi, Claire Bizon Monroc, Loïc Grobol, Hasan Muhammad, Ashi Garg, Naome A. Etori, Vijay Murari Tiyyala, Olanrewaju Samuel, Matthew Dean Stutzman, Bismarck Bamfo Odoom, Sanjeev Khudanpur, Stephen D. Richardson, Kenton Murray", "id": "2405.05376v1", "paper_url": "http://arxiv.org/abs/2405.05376v1", "repo": "null"}}