{"2410.04154": {"publish_time": "2024-10-05", "title": "Applying Quantum Autoencoders for Time Series Anomaly Detection", "paper_summary": "Anomaly detection is an important problem with applications in various\ndomains such as fraud detection, pattern recognition or medical diagnosis.\nSeveral algorithms have been introduced using classical computing approaches.\nHowever, using quantum computing for solving anomaly detection problems in time\nseries data is a widely unexplored research field.\n  This paper explores the application of quantum autoencoders to time series\nanomaly detection. We investigate two primary techniques for classifying\nanomalies: (1) Analyzing the reconstruction error generated by the quantum\nautoencoder and (2) latent representation analysis. Our simulated experimental\nresults, conducted across various ansaetze, demonstrate that quantum\nautoencoders consistently outperform classical deep learning-based autoencoders\nacross multiple datasets. Specifically, quantum autoencoders achieve superior\nanomaly detection performance while utilizing 60-230 times fewer parameters and\nrequiring five times fewer training iterations. In addition, we implement our\nquantum encoder on real quantum hardware. Our experimental results demonstrate\nthat quantum autoencoders achieve anomaly detection performance on par with\ntheir simulated counterparts.", "paper_summary_zh": "異常偵測是一個重要問題，在各種領域都有應用，例如詐欺偵測、模式辨識或醫療診斷。\n已經使用傳統運算方法引入了多種演算法。\n然而，使用量子運算來解決時間序列資料中的異常偵測問題是一個廣泛未開發的研究領域。\n本文探討了量子自動編碼器在時間序列異常偵測中的應用。我們調查了兩種主要的異常分類技術：(1) 分析量子自動編碼器產生的重建誤差，以及 (2) 潛在表徵分析。我們在各種 ansaetze 中進行的模擬實驗結果證明，量子自動編碼器在多個資料集上始終優於基於傳統深度學習的自動編碼器。具體來說，量子自動編碼器在使用少 60-230 倍的參數並需要少五倍的訓練反覆運算的情況下，實現了卓越的異常偵測效能。此外，我們在真實量子硬體上實作了我們的量子編碼器。我們的實驗結果證明，量子自動編碼器實現的異常偵測效能與其模擬對應物不相上下。", "author": "Robin Frehner et.al.", "authors": "Robin Frehner, Kurt Stockinger", "id": "2410.04154v1", "paper_url": "http://arxiv.org/abs/2410.04154v1", "repo": "null"}}