{"2407.11615": {"publish_time": "2024-07-16", "title": "Graph Dimension Attention Networks for Enterprise Credit Assessment", "paper_summary": "Enterprise credit assessment is critical for evaluating financial risk, and\nGraph Neural Networks (GNNs), with their advanced capability to model\ninter-entity relationships, are a natural tool to get a deeper understanding of\nthese financial networks. However, existing GNN-based methodologies\npredominantly emphasize entity-level attention mechanisms for contagion risk\naggregation, often overlooking the heterogeneous importance of different\nfeature dimensions, thus falling short in adequately modeling credit risk\nlevels. To address this issue, we propose a novel architecture named Graph\nDimension Attention Network (GDAN), which incorporates a dimension-level\nattention mechanism to capture fine-grained risk-related characteristics.\nFurthermore, we explore the interpretability of the GNN-based method in\nfinancial scenarios and propose a simple but effective data-centric explainer\nfor GDAN, called GDAN-DistShift. DistShift provides edge-level interpretability\nby quantifying distribution shifts during the message-passing process.\nMoreover, we collected a real-world, multi-source Enterprise Credit Assessment\nDataset (ECAD) and have made it accessible to the research community since\nhigh-quality datasets are lacking in this field. Extensive experiments\nconducted on ECAD demonstrate the effectiveness of our methods. In addition, we\nran GDAN on the well-known datasets SMEsD and DBLP, also with excellent\nresults.", "paper_summary_zh": "企業信用評估對於評估財務風險至關重要，圖形神經網路 (GNN) 具有建模實體間關係的先進能力，是深入了解這些金融網路的自然工具。然而，現有的基於 GNN 的方法主要強調實體層級的關注機制，用於傳染風險彙總，常常忽略不同特徵維度的異質重要性，因此在充分建模信用風險層級方面有所不足。為了解決這個問題，我們提出一個名為圖形維度關注網路 (GDAN) 的新架構，它結合了維度層級的關注機制來捕捉細緻的風險相關特徵。此外，我們探討了基於 GNN 的方法在財務情境中的可解釋性，並為 GDAN 提出了一個簡單但有效的以資料為中心的解釋器，稱為 GDAN-DistShift。DistShift 透過量化訊息傳遞過程中的分佈轉移，提供邊緣層級的可解釋性。此外，我們收集了一個真實世界的多來源企業信用評估資料集 (ECAD)，並已提供給研究社群，因為這個領域缺乏高品質的資料集。在 ECAD 上進行的廣泛實驗證明了我們方法的有效性。此外，我們在著名的資料集 SMEsD 和 DBLP 上執行了 GDAN，也獲得了極佳的結果。", "author": "Shaopeng Wei et.al.", "authors": "Shaopeng Wei, Beni Egressy, Xingyan Chen, Yu Zhao, Fuzhen Zhuang, Roger Wattenhofer, Gang Kou", "id": "2407.11615v1", "paper_url": "http://arxiv.org/abs/2407.11615v1", "repo": "null"}}