{"2407.07875": {"publish_time": "2024-07-10", "title": "Generative Image as Action Models", "paper_summary": "Image-generation diffusion models have been fine-tuned to unlock new\ncapabilities such as image-editing and novel view synthesis. Can we similarly\nunlock image-generation models for visuomotor control? We present GENIMA, a\nbehavior-cloning agent that fine-tunes Stable Diffusion to 'draw joint-actions'\nas targets on RGB images. These images are fed into a controller that maps the\nvisual targets into a sequence of joint-positions. We study GENIMA on 25\nRLBench and 9 real-world manipulation tasks. We find that, by lifting actions\ninto image-space, internet pre-trained diffusion models can generate policies\nthat outperform state-of-the-art visuomotor approaches, especially in\nrobustness to scene perturbations and generalizing to novel objects. Our method\nis also competitive with 3D agents, despite lacking priors such as depth,\nkeypoints, or motion-planners.", "paper_summary_zh": "影像產生擴散模型已經經過微調以解鎖新的能力，例如影像編輯和新視圖合成。我們能用類似的方式解鎖影像產生模型用於視動控制嗎？我們提出 GENIMA，一種行為複製代理，它微調 Stable Diffusion 以在 RGB 影像上「繪製關節動作」作為目標。這些影像會輸入到控制器中，控制器會將視覺目標對應到一系列關節位置。我們在 25 個 RLBench 和 9 個真實世界的操作任務中研究 GENIMA。我們發現，透過將動作提升到影像空間，網際網路預訓練擴散模型可以產生策略，其表現優於最先進的視動控制方法，尤其是在場景擾動的穩健性以及對新物體的泛化方面。我們的模型即使缺乏深度、關鍵點或動作規劃器等先驗知識，也能與 3D 代理競爭。", "author": "Mohit Shridhar et.al.", "authors": "Mohit Shridhar, Yat Long Lo, Stephen James", "id": "2407.07875v1", "paper_url": "http://arxiv.org/abs/2407.07875v1", "repo": "null"}}