{"2407.12371": {"publish_time": "2024-07-17", "title": "HIMO: A New Benchmark for Full-Body Human Interacting with Multiple Objects", "paper_summary": "Generating human-object interactions (HOIs) is critical with the tremendous\nadvances of digital avatars. Existing datasets are typically limited to humans\ninteracting with a single object while neglecting the ubiquitous manipulation\nof multiple objects. Thus, we propose HIMO, a large-scale MoCap dataset of\nfull-body human interacting with multiple objects, containing 3.3K 4D HOI\nsequences and 4.08M 3D HOI frames. We also annotate HIMO with detailed textual\ndescriptions and temporal segments, benchmarking two novel tasks of HOI\nsynthesis conditioned on either the whole text prompt or the segmented text\nprompts as fine-grained timeline control. To address these novel tasks, we\npropose a dual-branch conditional diffusion model with a mutual interaction\nmodule for HOI synthesis. Besides, an auto-regressive generation pipeline is\nalso designed to obtain smooth transitions between HOI segments. Experimental\nresults demonstrate the generalization ability to unseen object geometries and\ntemporal compositions.", "paper_summary_zh": "生成人類與物體互動 (HOI) 對於數位頭像的巨大進步至關重要。現有的資料集通常僅限於人類與單一物體互動，而忽略了對多個物體的普遍操作。因此，我們提出 HIMO，一個與多個物體互動的全人體動作捕捉大型資料集，包含 3.3K 4D HOI 序列和 4.08M 3D HOI 幀。我們還使用詳細的文字描述和時間區段對 HIMO 進行註解，對兩個新穎的 HOI 合成任務進行基準測試，這些任務以完整的文字提示或分段文字提示為條件，作為細粒度時間軸控制。為了解決這些新穎的任務，我們提出了一個具有相互互動模組的雙分支條件擴散模型，用於 HOI 合成。此外，還設計了一個自迴歸生成管道，用於在 HOI 區段之間獲得平滑過渡。實驗結果證明了對未見物體幾何形狀和時間組成的泛化能力。", "author": "Xintao Lv et.al.", "authors": "Xintao Lv, Liang Xu, Yichao Yan, Xin Jin, Congsheng Xu, Shuwen Wu, Yifan Liu, Lincheng Li, Mengxiao Bi, Wenjun Zeng, Xiaokang Yang", "id": "2407.12371v1", "paper_url": "http://arxiv.org/abs/2407.12371v1", "repo": "null"}}