{"2407.05591": {"publish_time": "2024-07-08", "title": "On the Power of Convolution Augmented Transformer", "paper_summary": "The transformer architecture has catalyzed revolutionary advances in language\nmodeling. However, recent architectural recipes, such as state-space models,\nhave bridged the performance gap. Motivated by this, we examine the benefits of\nConvolution-Augmented Transformer (CAT) for recall, copying, and length\ngeneralization tasks. CAT incorporates convolutional filters in the K/Q/V\nembeddings of an attention layer. Through CAT, we show that the locality of the\nconvolution synergizes with the global view of the attention. Unlike comparable\narchitectures, such as Mamba or transformer, CAT can provably solve the\nassociative recall (AR) and copying tasks using a single layer while also\nenjoying guaranteed length generalization. We also establish computational\ntradeoffs between convolution and attention by characterizing how convolution\ncan mitigate the need for full attention by summarizing the context window and\ncreating salient summary tokens to attend. Evaluations on real datasets\ncorroborate our findings and demonstrate that CAT and its variations indeed\nenhance the language modeling performance.", "paper_summary_zh": "Transformer架構催化了語言模型的革命性進展。然而，最近的架構配方，例如狀態空間模型，已經縮小了效能差距。基於此，我們研究了卷積增強Transformer (CAT) 在召回、複製和長度概化任務中的優點。CAT 在注意力層的 K/Q/V 嵌入中加入卷積濾波器。透過 CAT，我們展示了卷積的局部性與注意力的全局觀點產生協同作用。與 Mamba 或Transformer等可比較的架構不同，CAT 可以證明使用單層解決關聯式召回 (AR) 和複製任務，同時也享有保證的長度概化。我們還通過描述卷積如何透過總結上下文視窗和建立顯著的摘要代幣來減少對完整注意力的需求，來建立卷積和注意力之間的計算折衷。對實際資料集的評估證實了我們的發現，並證明 CAT 及其變體確實增強了語言模型的效能。", "author": "Mingchen Li et.al.", "authors": "Mingchen Li, Xuechen Zhang, Yixiao Huang, Samet Oymak", "id": "2407.05591v1", "paper_url": "http://arxiv.org/abs/2407.05591v1", "repo": "null"}}