{"2407.15374": {"publish_time": "2024-07-22", "title": "ILiAD: An Interactive Corpus for Linguistic Annotated Data from Twitter Posts", "paper_summary": "Social Media platforms have offered invaluable opportunities for linguistic\nresearch. The availability of up-to-date data, coming from any part in the\nworld, and coming from natural contexts, has allowed researchers to study\nlanguage in real time. One of the fields that has made great use of social\nmedia platforms is Corpus Linguistics. There is currently a wide range of\nprojects which have been able to successfully create corpora from social media.\nIn this paper, we present the development and deployment of a linguistic corpus\nfrom Twitter posts in English, coming from 26 news agencies and 27 individuals.\nThe main goal was to create a fully annotated English corpus for linguistic\nanalysis. We include information on morphology and syntax, as well as NLP\nfeatures such as tokenization, lemmas, and n- grams. The information is\npresented through a range of powerful visualisations for users to explore\nlinguistic patterns in the corpus. With this tool, we aim to contribute to the\narea of language technologies applied to linguistic research.", "paper_summary_zh": "社群媒体平台为语言研究提供了无价的机会。来自世界任何地方、且源自自然语境的最新资料，让研究人员得以实时研究语言。善用社群媒体平台的领域之一是语料库语言学。目前有许多专案成功地从社群媒体建立语料库。在本文中，我们提出从 26 家新闻机构和 27 位个人发出的 Twitter 贴文中，发展并部署一个语言语料库。主要目标是建立一个完整的英文标注语料库，以利语言分析。我们纳入形态和句法资讯，以及词元化、词干和 n-gram 等 NLP 功能。这些资讯透过一系列强大的视觉化方式呈现，供使用者探索语料库中的语言模式。有了这个工具，我们希望对应用于语言研究的语言技术领域有所贡献。", "author": "Simon Gonzalez et.al.", "authors": "Simon Gonzalez", "id": "2407.15374v1", "paper_url": "http://arxiv.org/abs/2407.15374v1", "repo": "null"}}