{"2406.07330": {"publish_time": "2024-06-11", "title": "CTC-based Non-autoregressive Textless Speech-to-Speech Translation", "paper_summary": "Direct speech-to-speech translation (S2ST) has achieved impressive\ntranslation quality, but it often faces the challenge of slow decoding due to\nthe considerable length of speech sequences. Recently, some research has turned\nto non-autoregressive (NAR) models to expedite decoding, yet the translation\nquality typically lags behind autoregressive (AR) models significantly. In this\npaper, we investigate the performance of CTC-based NAR models in S2ST, as these\nmodels have shown impressive results in machine translation. Experimental\nresults demonstrate that by combining pretraining, knowledge distillation, and\nadvanced NAR training techniques such as glancing training and non-monotonic\nlatent alignments, CTC-based NAR models achieve translation quality comparable\nto the AR model, while preserving up to 26.81$\\times$ decoding speedup.", "paper_summary_zh": "直接語音轉語音翻譯 (S2ST) 已達到令人印象深刻的翻譯品質，但它經常面臨由於語音序列相當長而導致的編碼速度緩慢的挑戰。最近，一些研究已轉向非自迴歸 (NAR) 模型來加快編碼速度，但翻譯品質通常顯著落後於自迴歸 (AR) 模型。在本文中，我們探討了基於 CTC 的 NAR 模型在 S2ST 中的效能，因為這些模型在機器翻譯中已展現出令人印象深刻的結果。實驗結果證明，透過結合預訓練、知識萃取以及先進的 NAR 訓練技術（例如瀏覽訓練和非單調潛在對齊），基於 CTC 的 NAR 模型可達到與 AR 模型相當的翻譯品質，同時保留高達 26.81 倍的編碼速度。", "author": "Qingkai Fang et.al.", "authors": "Qingkai Fang, Zhengrui Ma, Yan Zhou, Min Zhang, Yang Feng", "id": "2406.07330v1", "paper_url": "http://arxiv.org/abs/2406.07330v1", "repo": "https://github.com/ictnlp/ctc-s2ut"}}