{"2409.16167": {"publish_time": "2024-09-24", "title": "Merging LoRAs like Playing LEGO: Pushing the Modularity of LoRA to Extremes Through Rank-Wise Clustering", "paper_summary": "Low-Rank Adaptation (LoRA) has emerged as a popular technique for fine-tuning\nlarge language models (LLMs) to various domains due to its modular design and\nwidespread availability on platforms like Huggingface. This modularity has\nsparked interest in combining multiple LoRAs to enhance LLM capabilities.\nHowever, existing methods for LoRA composition primarily focus on task-specific\nadaptations that require additional training, and current model merging\ntechniques often fail to fully leverage LoRA's modular nature, leading to\nparameter interference and performance degradation. In this paper, we\ninvestigate the feasibility of disassembling and reassembling multiple LoRAs at\na finer granularity, analogous to assembling LEGO blocks. We introduce the\nconcept of Minimal Semantic Units (MSUs), where the parameters corresponding to\neach rank in LoRA function as independent units. These MSUs demonstrate\npermutation invariance and concatenation-summation equivalence properties,\nenabling flexible combinations to create new LoRAs. Building on these insights,\nwe propose the LoRA-LEGO framework. This framework conducts rank-wise parameter\nclustering by grouping MSUs from different LoRAs into $k$ clusters. The\ncentroid of each cluster serves as a representative MSU, enabling the assembly\nof a merged LoRA with an adjusted rank of $k$. Additionally, we apply a dual\nreweighting strategy to optimize the scale of the merged LoRA. Experiments\nacross various benchmarks demonstrate that our method outperforms existing\napproaches in LoRA merging.", "paper_summary_zh": "低秩適應 (LoRA) 已成為一種廣受歡迎的技術，用於微調大型語言模型 (LLM) 以適應各種領域，這是因為它具有模組化設計，且在 Huggingface 等平台上廣泛可用。這種模組化引起了人們對結合多個 LoRA 以增強 LLM 能力的興趣。然而，現有的 LoRA 組成方法主要集中於需要額外訓練的特定任務適應，而當前的模型合併技術通常無法充分利用 LoRA 的模組化特性，導致參數干擾和效能下降。在本文中，我們探討了以更精細的粒度分解和重新組裝多個 LoRA 的可行性，類似於組裝樂高積木。我們引入了最小語義單元 (MSU) 的概念，其中對應於 LoRA 中每個秩的參數作為獨立單元運作。這些 MSU 展示了排列不變性和串接加總等價性，允許靈活組合以創建新的 LoRA。基於這些見解，我們提出了 LoRA-LEGO 框架。此框架通過將來自不同 LoRA 的 MSU 分組到 $k$ 個叢集中，執行秩級參數分群。每個叢集的質心作為一個具代表性的 MSU，允許組裝一個秩調整為 $k$ 的合併 LoRA。此外，我們應用雙重重新加權策略來最佳化合併 LoRA 的規模。在各種基準測試中的實驗表明，我們的模型在 LoRA 合併中優於現有方法。", "author": "Ziyu Zhao et.al.", "authors": "Ziyu Zhao, Tao Shen, Didi Zhu, Zexi Li, Jing Su, Xuwu Wang, Kun Kuang, Fei Wu", "id": "2409.16167v1", "paper_url": "http://arxiv.org/abs/2409.16167v1", "repo": "null"}}