{"2407.08093": {"publish_time": "2024-07-10", "title": "MemWarp: Discontinuity-Preserving Cardiac Registration with Memorized Anatomical Filters", "paper_summary": "Many existing learning-based deformable image registration methods impose\nconstraints on deformation fields to ensure they are globally smooth and\ncontinuous. However, this assumption does not hold in cardiac image\nregistration, where different anatomical regions exhibit asymmetric motions\nduring respiration and movements due to sliding organs within the chest.\nConsequently, such global constraints fail to accommodate local discontinuities\nacross organ boundaries, potentially resulting in erroneous and unrealistic\ndisplacement fields. In this paper, we address this issue with MemWarp, a\nlearning framework that leverages a memory network to store prototypical\ninformation tailored to different anatomical regions. MemWarp is different from\nearlier approaches in two main aspects: firstly, by decoupling feature\nextraction from similarity matching in moving and fixed images, it facilitates\nmore effective utilization of feature maps; secondly, despite its capability to\npreserve discontinuities, it eliminates the need for segmentation masks during\nmodel inference. In experiments on a publicly available cardiac dataset, our\nmethod achieves considerable improvements in registration accuracy and\nproducing realistic deformations, outperforming state-of-the-art methods with a\nremarkable 7.1\\% Dice score improvement over the runner-up semi-supervised\nmethod. Source code will be available at https://github.com/tinymilky/Mem-Warp.", "paper_summary_zh": "許多現有的基於學習的形變影像配準方法對形變場施加約束，以確保它們在整體上是平滑且連續的。然而，此假設不適用於心臟影像配準，其中不同的解剖區域在呼吸和胸部器官滑動所造成的運動中表現出不對稱的運動。因此，此類全局約束無法適應器官邊界上的局部不連續性，可能會導致錯誤且不切實際的位移場。在本文中，我們使用 MemWarp 來解決此問題，MemWarp 是一種學習架構，它利用記憶網路來儲存針對不同解剖區域量身打造的原型資訊。MemWarp 在兩個主要方面不同於早期的做法：首先，透過將特徵萃取與移動和固定影像中的相似性比對分開，它促進了特徵圖的更有效利用；其次，儘管它有能力保留不連續性，但在模型推論期間卻消除了對分割遮罩的需求。在公開的心臟資料集上進行的實驗中，我們的模型在配準準確度和產生逼真的形變方面取得了顯著的進步，優於最先進的方法，與亞軍半監督方法相比，Dice 分數提高了 7.1%。原始碼將在 https://github.com/tinymilky/Mem-Warp 中提供。", "author": "Hang Zhang et.al.", "authors": "Hang Zhang, Xiang Chen, Renjiu Hu, Dongdong Liu, Gaolei Li, Rongguang Wang", "id": "2407.08093v1", "paper_url": "http://arxiv.org/abs/2407.08093v1", "repo": "null"}}