{"2412.14515": {"publish_time": "2024-12-19", "title": "Relational Programming with Foundation Models", "paper_summary": "Foundation models have vast potential to enable diverse AI applications. The\npowerful yet incomplete nature of these models has spurred a wide range of\nmechanisms to augment them with capabilities such as in-context learning,\ninformation retrieval, and code interpreting. We propose Vieira, a declarative\nframework that unifies these mechanisms in a general solution for programming\nwith foundation models. Vieira follows a probabilistic relational paradigm and\ntreats foundation models as stateless functions with relational inputs and\noutputs. It supports neuro-symbolic applications by enabling the seamless\ncombination of such models with logic programs, as well as complex, multi-modal\napplications by streamlining the composition of diverse sub-models. We\nimplement Vieira by extending the Scallop compiler with a foreign interface\nthat supports foundation models as plugins. We implement plugins for 12\nfoundation models including GPT, CLIP, and SAM. We evaluate Vieira on 9\nchallenging tasks that span language, vision, and structured and vector\ndatabases. Our evaluation shows that programs in Vieira are concise, can\nincorporate modern foundation models, and have comparable or better accuracy\nthan competitive baselines.", "paper_summary_zh": "基礎模型具有實現各種 AI 應用程式的巨大潛力。這些模型的功能強大但又不完整，因此促使出現了各種機制，以擴充它們的功能，例如情境學習、資訊檢索和程式碼解譯。我們提出 Vieira，這是一個宣告式架構，它將這些機制統一在一個通用的解決方案中，用於使用基礎模型進行程式設計。Vieira 遵循機率關係範例，並將基礎模型視為具有關係輸入和輸出的無狀態函數。它支援神經符號應用程式，讓此類模型能與邏輯程式順暢地結合，並透過簡化各種子模型的組成，支援複雜的多模式應用程式。我們透過擴充 Scallop 編譯器來實作 Vieira，其中包含一個外部介面，可支援基礎模型作為外掛程式。我們實作了 12 個基礎模型的外掛程式，包括 GPT、CLIP 和 SAM。我們在 9 項具有挑戰性的任務上評估 Vieira，這些任務涵蓋語言、視覺以及結構化和向量資料庫。我們的評估顯示，Vieira 中的程式簡潔，能整合現代基礎模型，並且具有與競爭基準線相當或更好的準確度。", "author": "Ziyang Li et.al.", "authors": "Ziyang Li, Jiani Huang, Jason Liu, Felix Zhu, Eric Zhao, William Dodds, Neelay Velingker, Rajeev Alur, Mayur Naik", "id": "2412.14515v1", "paper_url": "http://arxiv.org/abs/2412.14515v1", "repo": "null"}}