{"2408.08651": {"publish_time": "2024-08-16", "title": "Reasoning Beyond Bias: A Study on Counterfactual Prompting and Chain of Thought Reasoning", "paper_summary": "Language models are known to absorb biases from their training data, leading\nto predictions driven by statistical regularities rather than semantic\nrelevance. We investigate the impact of these biases on answer choice\npreferences in the Massive Multi-Task Language Understanding (MMLU) task. Our\nfindings reveal that differences in learned regularities across answer options\nare predictive of model preferences and mirror human test-taking strategies. To\naddress this issue, we introduce two novel methods: Counterfactual Prompting\nwith Chain of Thought (CoT) and Counterfactual Prompting with Agnostically\nPrimed CoT (APriCoT). We demonstrate that while Counterfactual Prompting with\nCoT alone is insufficient to mitigate bias, our novel Primed Counterfactual\nPrompting with CoT approach effectively reduces the influence of base-rate\nprobabilities while improving overall accuracy. Our results suggest that\nmitigating bias requires a \"System-2\" like process and that CoT reasoning is\nsusceptible to confirmation bias under some prompting methodologies. Our\ncontributions offer practical solutions for developing more robust and fair\nlanguage models.", "paper_summary_zh": "語言模型已知會吸收其訓練資料中的偏見，導致預測是由統計規律而非語義相關性驅動。我們探討這些偏見對大規模多任務語言理解 (MMLU) 任務中答案選擇偏好的影響。我們的研究結果揭示，答案選項中所學規律的差異可以預測模型偏好並反映人類的應試策略。為了解決這個問題，我們引入了兩種新方法：反事實提示與思考鏈 (CoT) 和反事實提示與不可知預先提示的 CoT (APriCoT)。我們證明，雖然僅使用反事實提示與 CoT 不足以減輕偏見，但我們新穎的預先反事實提示與 CoT 方法有效降低了基本比率機率的影響，同時提高了整體準確度。我們的結果表明，減輕偏見需要一個類似於「系統 2」的過程，並且 CoT 推理在某些提示方法下容易受到確認偏見的影響。我們的貢獻為開發更健全和公平的語言模型提供了實用的解決方案。", "author": "Kyle Moore et.al.", "authors": "Kyle Moore, Jesse Roberts, Thao Pham, Douglas Fisher", "id": "2408.08651v1", "paper_url": "http://arxiv.org/abs/2408.08651v1", "repo": "null"}}