{"2410.21815": {"publish_time": "2024-10-29", "title": "Gnothi Seauton: Empowering Faithful Self-Interpretability in Black-Box Models", "paper_summary": "The debate between self-interpretable models and post-hoc explanations for\nblack-box models is central to Explainable AI (XAI). Self-interpretable models,\nsuch as concept-based networks, offer insights by connecting decisions to\nhuman-understandable concepts but often struggle with performance and\nscalability. Conversely, post-hoc methods like Shapley values, while\ntheoretically robust, are computationally expensive and resource-intensive. To\nbridge the gap between these two lines of research, we propose a novel method\nthat combines their strengths, providing theoretically guaranteed\nself-interpretability for black-box models without compromising prediction\naccuracy. Specifically, we introduce a parameter-efficient pipeline,\n*AutoGnothi*, which integrates a small side network into the black-box model,\nallowing it to generate Shapley value explanations without changing the\noriginal network parameters. This side-tuning approach significantly reduces\nmemory, training, and inference costs, outperforming traditional\nparameter-efficient methods, where full fine-tuning serves as the optimal\nbaseline. *AutoGnothi* enables the black-box model to predict and explain its\npredictions with minimal overhead. Extensive experiments show that *AutoGnothi*\noffers accurate explanations for both vision and language tasks, delivering\nsuperior computational efficiency with comparable interpretability.", "paper_summary_zh": "可解釋 AI (XAI) 的核心在於可自行解釋模型與黑箱模型的後設解釋之間的爭論。可自行解釋模型，例如基於概念的網路，透過將決策與人類可理解的概念連結起來提供見解，但經常在效能和可擴充性上遇到困難。相反地，後設方法（例如 Shapley 值），雖然理論上強健，但在計算上昂貴且需要大量資源。為了彌補這兩條研究路線之間的差距，我們提出一個結合其優點的新方法，為黑箱模型提供理論上保證的可自行解釋性，同時不影響預測準確性。具體來說，我們引入一個參數效率良好的管線，*AutoGnothi*，它將一個小型側網路整合到黑箱模型中，使其能夠產生 Shapley 值解釋，而不會改變原始網路參數。這種側調校方法顯著減少了記憶體、訓練和推論成本，優於傳統的參數效率良好方法，其中完全微調是最佳基準。*AutoGnothi* 使黑箱模型能夠以最小的開銷預測和解釋其預測。廣泛的實驗表明，*AutoGnothi* 為視覺和語言任務提供了準確的解釋，以可比較的可解釋性提供卓越的計算效率。", "author": "Shaobo Wang et.al.", "authors": "Shaobo Wang, Hongxuan Tang, Mingyang Wang, Hongrui Zhang, Xuyang Liu, Weiya Li, Xuming Hu, Linfeng Zhang", "id": "2410.21815v1", "paper_url": "http://arxiv.org/abs/2410.21815v1", "repo": "null"}}