{"2501.14166": {"publish_time": "2025-01-24", "title": "Enhancing Multimodal Entity Linking with Jaccard Distance-based Conditional Contrastive Learning and Contextual Visual Augmentation", "paper_summary": "Previous research on multimodal entity linking (MEL) has primarily employed\ncontrastive learning as the primary objective. However, using the rest of the\nbatch as negative samples without careful consideration, these studies risk\nleveraging easy features and potentially overlook essential details that make\nentities unique. In this work, we propose JD-CCL (Jaccard Distance-based\nConditional Contrastive Learning), a novel approach designed to enhance the\nability to match multimodal entity linking models. JD-CCL leverages\nmeta-information to select negative samples with similar attributes, making the\nlinking task more challenging and robust. Additionally, to address the\nlimitations caused by the variations within the visual modality among mentions\nand entities, we introduce a novel method, CVaCPT (Contextual Visual-aid\nControllable Patch Transform). It enhances visual representations by\nincorporating multi-view synthetic images and contextual textual\nrepresentations to scale and shift patch representations. Experimental results\non benchmark MEL datasets demonstrate the strong effectiveness of our approach.", "paper_summary_zh": "先前針對多模態實體連結 (MEL) 的研究主要採用對比學習作為主要目標。然而，這些研究在未經仔細考量的情況下將批次其餘部分用作負樣本，因此有風險會利用容易辨識的特徵，並可能忽略使實體獨一無二的重要細節。在本文中，我們提出 JD-CCL（Jaccard 距離基礎條件對比學習），這是一種新穎的方法，旨在增強多模態實體連結模型的匹配能力。JD-CCL 利用元資訊來選擇具有類似屬性的負樣本，使連結任務更具挑戰性和穩健性。此外，為了解決在提及和實體之間的視覺模式中變異所造成的限制，我們引入了一種新方法，稱為 CVaCPT（脈絡視覺輔助可控區塊轉換）。它透過結合多視角合成影像和脈絡文字表徵來增強視覺表徵，以縮放和轉移區塊表徵。在基準 MEL 資料集上的實驗結果證明了我們方法的強大效能。", "author": "Cong-Duy Nguyen et.al.", "authors": "Cong-Duy Nguyen, Xiaobao Wu, Thong Nguyen, Shuai Zhao, Khoi Le, Viet-Anh Nguyen, Feng Yichao, Anh Tuan Luu", "id": "2501.14166v1", "paper_url": "http://arxiv.org/abs/2501.14166v1", "repo": "null"}}