{"2409.10277": {"publish_time": "2024-09-16", "title": "Cognitive Kernel: An Open-source Agent System towards Generalist Autopilots", "paper_summary": "We introduce Cognitive Kernel, an open-source agent system towards the goal\nof generalist autopilots. Unlike copilot systems, which primarily rely on users\nto provide essential state information (e.g., task descriptions) and assist\nusers by answering questions or auto-completing contents, autopilot systems\nmust complete tasks from start to finish independently, which requires the\nsystem to acquire the state information from the environments actively. To\nachieve this, an autopilot system should be capable of understanding user\nintents, actively gathering necessary information from various real-world\nsources, and making wise decisions. Cognitive Kernel adopts a model-centric\ndesign. In our implementation, the central policy model (a fine-tuned LLM)\ninitiates interactions with the environment using a combination of atomic\nactions, such as opening files, clicking buttons, saving intermediate results\nto memory, or calling the LLM itself. This differs from the widely used\nenvironment-centric design, where a task-specific environment with predefined\nactions is fixed, and the policy model is limited to selecting the correct\naction from a given set of options. Our design facilitates seamless information\nflow across various sources and provides greater flexibility. We evaluate our\nsystem in three use cases: real-time information management, private\ninformation management, and long-term memory management. The results\ndemonstrate that Cognitive Kernel achieves better or comparable performance to\nother closed-source systems in these scenarios. Cognitive Kernel is fully\ndockerized, ensuring everyone can deploy it privately and securely. We\nopen-source the system and the backbone model to encourage further research on\nLLM-driven autopilot systems.", "paper_summary_zh": "<paragraph>我們推出認知核心，一個朝向通用自動駕駛儀目標的開源代理系統。與副駕駛系統不同，副駕駛系統主要依賴使用者提供必要的狀態資訊（例如任務描述），並透過回答問題或自動完成內容來協助使用者，自動駕駛系統必須從頭到尾獨立完成任務，這需要系統主動從環境中獲取狀態資訊。為了達成此目的，自動駕駛系統應具備理解使用者意圖、主動從各種真實世界來源收集必要資訊，以及做出明智決定的能力。認知核心採用以模型為中心のデザイン。在我們的實作中，中央策略模型（微調後的 LLM）使用原子動作的組合來啟動與環境的互動，例如開啟檔案、按鈕點擊、將中間結果儲存到記憶體，或呼叫 LLM 本身。這與廣泛使用的以環境為中心のデザイン不同，在以環境為中心のデザイン中，具備預定義動作的特定任務環境是固定的，而策略模型僅限於從一組選項中選擇正確的動作。我們的設計促進各種來源之間的無縫資訊流動，並提供更大的靈活性。我們在三個使用案例中評估我們的系統：即時資訊管理、私人資訊管理和長期記憶管理。結果證明，在這些場景中，認知核心實現了比其他閉源系統更好或相當的效能。認知核心完全採用 Docker 化，確保每個人都可以私密且安全地部署它。我們開放原始碼系統和主幹模型，以鼓勵進一步研究 LLM 驅動的自動駕駛系統。</paragraph>", "author": "Hongming Zhang et.al.", "authors": "Hongming Zhang, Xiaoman Pan, Hongwei Wang, Kaixin Ma, Wenhao Yu, Dong Yu", "id": "2409.10277v1", "paper_url": "http://arxiv.org/abs/2409.10277v1", "repo": "null"}}