{"2408.07891": {"publish_time": "2024-08-15", "title": "Quantum-inspired Interpretable Deep Learning Architecture for Text Sentiment Analysis", "paper_summary": "Text has become the predominant form of communication on social media,\nembedding a wealth of emotional nuances. Consequently, the extraction of\nemotional information from text is of paramount importance. Despite previous\nresearch making some progress, existing text sentiment analysis models still\nface challenges in integrating diverse semantic information and lack\ninterpretability. To address these issues, we propose a quantum-inspired deep\nlearning architecture that combines fundamental principles of quantum mechanics\n(QM principles) with deep learning models for text sentiment analysis.\nSpecifically, we analyze the commonalities between text representation and QM\nprinciples to design a quantum-inspired text representation method and further\ndevelop a quantum-inspired text embedding layer. Additionally, we design a\nfeature extraction layer based on long short-term memory (LSTM) networks and\nself-attention mechanisms (SAMs). Finally, we calculate the text density matrix\nusing the quantum complex numbers principle and apply 2D-convolution neural\nnetworks (CNNs) for feature condensation and dimensionality reduction. Through\na series of visualization, comparative, and ablation experiments, we\ndemonstrate that our model not only shows significant advantages in accuracy\nand efficiency compared to previous related models but also achieves a certain\nlevel of interpretability by integrating QM principles. Our code is available\nat QISA.", "paper_summary_zh": "文字已成為社群媒體上主要的溝通形式，\n蘊含豐富的情緒細微差別。因此，從文字中萃取情緒資訊至關重要。儘管先前的\n研究已取得一些進展，現有的文字情緒分析模型在整合多樣語意資訊時仍\n面臨挑戰，且缺乏可解釋性。為了解決這些問題，我們提出一個受量子啟發的深度\n學習架構，將量子力學基本原理 (QM 原理) 與深度學習模型結合，用於文字情緒分析。\n具體來說，我們分析文字表示與 QM 原理之間的共性，設計一個受量子啟發的文字表示方法，並進一步\n開發一個受量子啟發的文字嵌入層。此外，我們設計一個基於長短期記憶 (LSTM) 網路和\n自注意力機制 (SAM) 的特徵萃取層。最後，我們使用量子複數原理計算文字密度矩陣，並應用 2D convolution 神經網路 (CNN) 進行特徵壓縮和降維。透過\n一系列視覺化、比較和消融實驗，我們\n證明我們的模型不僅在準確度和效率方面比先前的相關模型有顯著優勢，而且透過整合 QM 原理，還達到了某種程度的可解釋性。我們的程式碼可在 QISA 取得。", "author": "Bingyu Li et.al.", "authors": "Bingyu Li, Da Zhang, Zhiyuan Zhao, Junyu Gao, Yuan Yuan", "id": "2408.07891v1", "paper_url": "http://arxiv.org/abs/2408.07891v1", "repo": "https://github.com/libingyu01/qitsa-quantum-inspired-interpretable-deep-learning-architecture-for-text-sentiment-analysis"}}