{"2412.02851": {"publish_time": "2024-12-03", "title": "Block MedCare: Advancing healthcare through blockchain integration with AI and IoT", "paper_summary": "This research explores the integration of blockchain technology in\nhealthcare, focusing on enhancing the security and efficiency of Electronic\nHealth Record (EHR) management. We propose a novel Ethereum-based system that\nempowers patients with secure control over their medical data. Our approach\naddresses key challenges in healthcare blockchain implementation, including\nscalability, privacy, and regulatory compliance. The system incorporates\ndigital signatures, Role-Based Access Control, and a multi-layered architecture\nto ensure secure, controlled access. We developed a decentralized application\n(dApp) with user-friendly interfaces for patients, doctors, and administrators,\ndemonstrating the practical application of our solution. A survey among\nhealthcare professionals and IT experts revealed strong interest in blockchain\nadoption, while also highlighting concerns about integration costs. The study\nexplores future enhancements, including integration with IoT devices and\nAI-driven analytics, contributing to the evolution of secure, efficient, and\ninteroperable healthcare systems that leverage cutting-edge technologies for\nimproved patient care.", "paper_summary_zh": "本研究探討區塊鏈技術在醫療保健中的整合，專注於提升電子健康紀錄 (EHR) 管理的安全性與效率。我們提出一個創新的以太坊系統，賦予患者安全地控制其醫療數據的權力。我們的做法解決了醫療保健區塊鏈實作中的主要挑戰，包括可擴充性、隱私和法規遵循。該系統整合了數位簽章、基於角色的存取控制和多層架構，以確保安全且受控的存取。我們開發了一個具有使用者友善介面的去中心化應用程式 (dApp)，適用於患者、醫生和管理員，展示了我們解決方案的實際應用。在醫療保健專業人員和 IT 專家之間進行的一項調查顯示，他們對區塊鏈的採用有濃厚興趣，但也強調了對整合成本的擔憂。該研究探討了未來的強化，包括與 IoT 裝置整合和 AI 驅動的分析，有助於安全、高效且可互操作的醫療保健系統的演進，該系統利用尖端技術改善患者照護。", "author": "Oliver Simonoski et.al.", "authors": "Oliver Simonoski, Dijana Capeska Bogatinoska", "id": "2412.02851v1", "paper_url": "http://arxiv.org/abs/2412.02851v1", "repo": "null"}}