{"2408.00295": {"publish_time": "2024-08-01", "title": "Contrastive Graph Representation Learning with Adversarial Cross-view Reconstruction and Information Bottleneck", "paper_summary": "Graph Neural Networks (GNNs) have received extensive research attention due\nto their powerful information aggregation capabilities. Despite the success of\nGNNs, most of them suffer from the popularity bias issue in a graph caused by a\nsmall number of popular categories. Additionally, real graph datasets always\ncontain incorrect node labels, which hinders GNNs from learning effective node\nrepresentations. Graph contrastive learning (GCL) has been shown to be\neffective in solving the above problems for node classification tasks. Most\nexisting GCL methods are implemented by randomly removing edges and nodes to\ncreate multiple contrasting views, and then maximizing the mutual information\n(MI) between these contrasting views to improve the node feature\nrepresentation. However, maximizing the mutual information between multiple\ncontrasting views may lead the model to learn some redundant information\nirrelevant to the node classification task. To tackle this issue, we propose an\neffective Contrastive Graph Representation Learning with Adversarial Cross-view\nReconstruction and Information Bottleneck (CGRL) for node classification, which\ncan adaptively learn to mask the nodes and edges in the graph to obtain the\noptimal graph structure representation. Furthermore, we innovatively introduce\nthe information bottleneck theory into GCLs to remove redundant information in\nmultiple contrasting views while retaining as much information as possible\nabout node classification. Moreover, we add noise perturbations to the original\nviews and reconstruct the augmented views by constructing adversarial views to\nimprove the robustness of node feature representation. Extensive experiments on\nreal-world public datasets demonstrate that our method significantly\noutperforms existing state-of-the-art algorithms.", "paper_summary_zh": "圖神經網路 (GNN) 因其強大的資訊彙總能力而受到廣泛的研究關注。儘管 GNN 取得成功，但大多數 GNN 都會受到圖形中少數熱門類別所造成的熱門偏誤問題。此外，實際圖形資料集總是包含不正確的節點標籤，這會阻礙 GNN 學習有效的節點表示。圖對比學習 (GCL) 已被證明可有效解決節點分類任務中的上述問題。大多數現有的 GCL 方法都是透過隨機移除邊緣和節點來建立多個對比視圖，然後最大化這些對比視圖之間的互信息 (MI)，以改善節點特徵表示。然而，最大化多個對比視圖之間的互信息可能會導致模型學習到一些與節點分類任務無關的冗餘資訊。為了解決這個問題，我們提出了一個有效的對比圖形表示學習，帶有對抗性跨視圖重建和資訊瓶頸 (CGRL) 的節點分類，它可以自適應地學習遮蔽圖形中的節點和邊緣，以取得最佳的圖形結構表示。此外，我們創新地將資訊瓶頸理論引入 GCL，以移除多個對比視圖中的冗餘資訊，同時保留盡可能多的節點分類資訊。此外，我們在原始視圖中加入雜訊擾動，並透過建構對抗性視圖來重建擴增的視圖，以改善節點特徵表示的穩健性。在真實世界公開資料集上的廣泛實驗證明，我們的模型顯著優於現有的最先進演算法。", "author": "Yuntao Shou et.al.", "authors": "Yuntao Shou, Haozhi Lan, Xiangyong Cao", "id": "2408.00295v1", "paper_url": "http://arxiv.org/abs/2408.00295v1", "repo": "null"}}