{"2406.14500": {"publish_time": "2024-06-20", "title": "Improving Expert Radiology Report Summarization by Prompting Large Language Models with a Layperson Summary", "paper_summary": "Radiology report summarization (RRS) is crucial for patient care, requiring\nconcise \"Impressions\" from detailed \"Findings.\" This paper introduces a novel\nprompting strategy to enhance RRS by first generating a layperson summary. This\napproach normalizes key observations and simplifies complex information using\nnon-expert communication techniques inspired by doctor-patient interactions.\nCombined with few-shot in-context learning, this method improves the model's\nability to link general terms to specific findings. We evaluate this approach\non the MIMIC-CXR, CheXpert, and MIMIC-III datasets, benchmarking it against\n7B/8B parameter state-of-the-art open-source large language models (LLMs) like\nMeta-Llama-3-8B-Instruct. Our results demonstrate improvements in summarization\naccuracy and accessibility, particularly in out-of-domain tests, with\nimprovements as high as 5% for some metrics.", "paper_summary_zh": "放射科报告摘要 (RRS) 对于患者护理至关重要，需要从详细的「结果」中提取简洁的「印象」。本文介绍了一种新颖的提示策略，通过首先生成外行摘要来增强 RRS。此方法使用受医患互动启发的非专家沟通技巧，将关键观察结果标准化并简化复杂信息。结合少样本上下文学习，此方法提高了模型将一般术语与特定结果联系起来的能力。我们在 MIMIC-CXR、CheXpert 和 MIMIC-III 数据集上评估了这种方法，并将其与 Meta-Llama-3-8B-Instruct 等 7B/8B 参数最先进的开源大语言模型 (LLM) 进行了基准测试。我们的结果表明，摘要准确性和可访问性都有所提高，尤其是在域外测试中，某些指标的改进幅度高达 5%。", "author": "Xingmeng Zhao et.al.", "authors": "Xingmeng Zhao, Tongnian Wang, Anthony Rios", "id": "2406.14500v1", "paper_url": "http://arxiv.org/abs/2406.14500v1", "repo": "null"}}