{"2407.02936": {"publish_time": "2024-07-03", "title": "GraCoRe: Benchmarking Graph Comprehension and Complex Reasoning in Large Language Models", "paper_summary": "Evaluating the graph comprehension and reasoning abilities of Large Language\nModels (LLMs) is challenging and often incomplete. Existing benchmarks focus\nprimarily on pure graph understanding, lacking a comprehensive evaluation\nacross all graph types and detailed capability definitions. This paper presents\nGraCoRe, a benchmark for systematically assessing LLMs' graph comprehension and\nreasoning. GraCoRe uses a three-tier hierarchical taxonomy to categorize and\ntest models on pure graph and heterogeneous graphs, subdividing capabilities\ninto 10 distinct areas tested through 19 tasks. Our benchmark includes 11\ndatasets with 5,140 graphs of varying complexity. We evaluated three\nclosed-source and seven open-source LLMs, conducting thorough analyses from\nboth ability and task perspectives. Key findings reveal that semantic\nenrichment enhances reasoning performance, node ordering impacts task success,\nand the ability to process longer texts does not necessarily improve graph\ncomprehension or reasoning. GraCoRe is open-sourced at\nhttps://github.com/ZIKEYUAN/GraCoRe", "paper_summary_zh": "評估大型語言模型 (LLM) 的圖形理解和推理能力具有挑戰性，且通常不完整。現有的基準主要著重於純粹的圖形理解，缺乏對所有圖形類型和詳細功能定義的全面評估。本文提出了 GraCoRe，一個用於系統評估 LLM 的圖形理解和推理的基準。GraCoRe 使用三層階層分類法對模型進行分類和測試，將功能細分為 10 個不同的領域，並通過 19 個任務進行測試。我們的基準包含 11 個數據集，其中包含 5,140 個不同複雜度的圖形。我們評估了三個閉源和七個開源 LLM，從能力和任務角度進行了徹底的分析。主要發現表明語義豐富化增強了推理性能，節點排序影響任務成功，而處理較長文本的能力並不一定能改善圖形理解或推理。GraCoRe 在 https://github.com/ZIKEYUAN/GraCoRe 開源", "author": "Zike Yuan et.al.", "authors": "Zike Yuan, Ming Liu, Hui Wang, Bing Qin", "id": "2407.02936v1", "paper_url": "http://arxiv.org/abs/2407.02936v1", "repo": "https://github.com/zikeyuan/gracore"}}