{"2501.05501": {"publish_time": "2025-01-09", "title": "Strategy Masking: A Method for Guardrails in Value-based Reinforcement Learning Agents", "paper_summary": "The use of reward functions to structure AI learning and decision making is\ncore to the current reinforcement learning paradigm; however, without careful\ndesign of reward functions, agents can learn to solve problems in ways that may\nbe considered \"undesirable\" or \"unethical.\" Without thorough understanding of\nthe incentives a reward function creates, it can be difficult to impose\nprincipled yet general control mechanisms over its behavior. In this paper, we\nstudy methods for constructing guardrails for AI agents that use reward\nfunctions to learn decision making. We introduce a novel approach, which we\ncall strategy masking, to explicitly learn and then suppress undesirable AI\nagent behavior. We apply our method to study lying in AI agents and show that\nit can be used to effectively modify agent behavior by suppressing lying\npost-training without compromising agent ability to perform effectively.", "paper_summary_zh": "使用獎勵函數來建構 AI 學習和決策制定是目前強化學習範例的核心；然而，在沒有仔細設計獎勵函數的情況下，代理人可能會學到以可能被視為「不受歡迎」或「不道德」的方式來解決問題。在沒有徹底了解獎勵函數所創造的誘因的情況下，很難對其行為施加有原則但又通用的控制機制。在本文中，我們研究了為使用獎勵函數來學習決策制定的 AI 代理建立護欄的方法。我們介紹了一種新穎的方法，我們稱之為策略遮罩，用於明確學習並抑制不受歡迎的 AI 代理行為。我們將我們的這種方法應用於研究 AI 代理中的說謊行為，並表明它可用於通過在訓練後抑制說謊來有效修改代理行為，同時不損害代理有效執行的能力。", "author": "Jonathan Keane et.al.", "authors": "Jonathan Keane, Sam Keyser, Jeremy Kedziora", "id": "2501.05501v2", "paper_url": "http://arxiv.org/abs/2501.05501v2", "repo": "null"}}