{"2405.18003": {"publish_time": "2024-05-28", "title": "MAVIN: Multi-Action Video Generation with Diffusion Models via Transition Video Infilling", "paper_summary": "Diffusion-based video generation has achieved significant progress, yet\ngenerating multiple actions that occur sequentially remains a formidable task.\nDirectly generating a video with sequential actions can be extremely\nchallenging due to the scarcity of fine-grained action annotations and the\ndifficulty in establishing temporal semantic correspondences and maintaining\nlong-term consistency. To tackle this, we propose an intuitive and\nstraightforward solution: splicing multiple single-action video segments\nsequentially. The core challenge lies in generating smooth and natural\ntransitions between these segments given the inherent complexity and\nvariability of action transitions. We introduce MAVIN (Multi-Action Video\nINfilling model), designed to generate transition videos that seamlessly\nconnect two given videos, forming a cohesive integrated sequence. MAVIN\nincorporates several innovative techniques to address challenges in the\ntransition video infilling task. Firstly, a consecutive noising strategy\ncoupled with variable-length sampling is employed to handle large infilling\ngaps and varied generation lengths. Secondly, boundary frame guidance (BFG) is\nproposed to address the lack of semantic guidance during transition generation.\nLastly, a Gaussian filter mixer (GFM) dynamically manages noise initialization\nduring inference, mitigating train-test discrepancy while preserving generation\nflexibility. Additionally, we introduce a new metric, CLIP-RS (CLIP Relative\nSmoothness), to evaluate temporal coherence and smoothness, complementing\ntraditional quality-based metrics. Experimental results on horse and tiger\nscenarios demonstrate MAVIN's superior performance in generating smooth and\ncoherent video transitions compared to existing methods.", "paper_summary_zh": "基於擴散的影片生成已取得顯著進展，但生成多個按順序發生的動作仍然是一項艱鉅的任務。由於缺乏細粒度的動作註解，且難以建立時間語義對應並維持長期一致性，因此直接生成具有順序動作的影片可能極具挑戰性。為了解決這個問題，我們提出了一個直觀且簡單的解決方案：按順序拼接多個單動作影片片段。核心挑戰在於生成這些片段之間的平滑且自然的過渡，因為動作過渡具有內在的複雜性和可變性。我們引入了 MAVIN（多動作影片填充模型），旨在生成過渡影片，將兩個給定的影片無縫連接，形成一個有凝聚力的整合序列。MAVIN 結合了多種創新技術來應對過渡影片填充任務中的挑戰。首先，採用連續噪聲策略與可變長度採樣，以處理大型填充間隙和不同的生成長度。其次，提出了邊界幀引導 (BFG) 來解決過渡生成期間缺乏語義引導的問題。最後，高斯濾波器混合器 (GFM) 在推理期間動態管理噪聲初始化，在保留生成靈活性的同時減輕訓練測試差異。此外，我們引入了新的指標 CLIP-RS（CLIP 相對平滑度），以評估時間相干性和平滑度，作為傳統基於品質的指標的補充。在馬和老虎場景的實驗結果證明，與現有方法相比，MAVIN 在生成平滑且連貫的影片過渡方面具有優異的性能。", "author": "Bowen Zhang et.al.", "authors": "Bowen Zhang, Xiaofei Xie, Haotian Lu, Na Ma, Tianlin Li, Qing Guo", "id": "2405.18003v1", "paper_url": "http://arxiv.org/abs/2405.18003v1", "repo": "https://github.com/18445864529/mavin"}}