{"2501.14932": {"publish_time": "2025-01-24", "title": "Explaining Categorical Feature Interactions Using Graph Covariance and LLMs", "paper_summary": "Modern datasets often consist of numerous samples with abundant features and\nassociated timestamps. Analyzing such datasets to uncover underlying events\ntypically requires complex statistical methods and substantial domain\nexpertise. A notable example, and the primary data focus of this paper, is the\nglobal synthetic dataset from the Counter Trafficking Data Collaborative (CTDC)\n-- a global hub of human trafficking data containing over 200,000 anonymized\nrecords spanning from 2002 to 2022, with numerous categorical features for each\nrecord. In this paper, we propose a fast and scalable method for analyzing and\nextracting significant categorical feature interactions, and querying large\nlanguage models (LLMs) to generate data-driven insights that explain these\ninteractions. Our approach begins with a binarization step for categorical\nfeatures using one-hot encoding, followed by the computation of graph\ncovariance at each time. This graph covariance quantifies temporal changes in\ndependence structures within categorical data and is established as a\nconsistent dependence measure under the Bernoulli distribution. We use this\nmeasure to identify significant feature pairs, such as those with the most\nfrequent trends over time or those exhibiting sudden spikes in dependence at\nspecific moments. These extracted feature pairs, along with their timestamps,\nare subsequently passed to an LLM tasked with generating potential explanations\nof the underlying events driving these dependence changes. The effectiveness of\nour method is demonstrated through extensive simulations, and its application\nto the CTDC dataset reveals meaningful feature pairs and potential data stories\nunderlying the observed feature interactions.", "paper_summary_zh": "現代資料集通常包含許多具有豐富特徵和關聯時間戳的樣本。分析此類資料集以揭示底層事件通常需要複雜的統計方法和大量的領域專業知識。一個值得注意的範例，也是本文的主要資料重點，是來自反人口販運資料合作組織 (CTDC) 的全球合成資料集，這是全球人口販運資料的樞紐，包含超過 200,000 筆從 2002 年到 2022 年的匿名記錄，每個記錄都有許多分類特徵。在本文中，我們提出了一種快速且可擴充的方法，用於分析和提取重要的分類特徵交互作用，並查詢大型語言模型 (LLM)，以產生資料驅動的見解來解釋這些交互作用。我們的做法從使用獨熱編碼對分類特徵進行二元化步驟開始，然後在每個時間點計算圖形共變異數。此圖形共變異數量化了分類資料中依賴結構的時間變化，並在伯努利分佈下建立為一致的依賴度量。我們使用此度量來識別重要的特徵對，例如隨時間推移趨勢最頻繁的特徵對，或在特定時刻表現出依賴性突然激增的特徵對。這些提取的特徵對及其時間戳隨後傳遞給 LLM，後者負責產生對驅動這些依賴性變化的底層事件的潛在解釋。我們的方法的有效性已通過廣泛的模擬得到證明，其在 CTDC 資料集中的應用揭示了有意義的特徵對和潛在的資料故事，這些故事是觀察到的特徵交互作用的基礎。", "author": "Cencheng Shen et.al.", "authors": "Cencheng Shen, Darren Edge, Jonathan Larson, Carey E. Priebe", "id": "2501.14932v1", "paper_url": "http://arxiv.org/abs/2501.14932v1", "repo": "null"}}