{"2409.15817": {"publish_time": "2024-09-24", "title": "SwiftDossier: Tailored Automatic Dossier for Drug Discovery with LLMs and Agents", "paper_summary": "The advancement of artificial intelligence algorithms has expanded their\napplication to several fields such as the biomedical domain. Artificial\nintelligence systems, including Large Language Models (LLMs), can be\nparticularly advantageous in drug discovery, which is a very long and expensive\nprocess. However, LLMs by themselves lack in-depth knowledge about specific\ndomains and can generate factually incorrect information. Moreover, they are\nnot able to perform more complex actions that imply the usage of external\ntools. Our work is focused on these two issues. Firstly, we show how the\nimplementation of an advanced RAG system can help the LLM to generate more\naccurate answers to drug-discovery-related questions. The results show that the\nanswers generated by the LLM with the RAG system surpass in quality the answers\nproduced by the model without RAG. Secondly, we show how to create an automatic\ntarget dossier using LLMs and incorporating them with external tools that they\ncan use to execute more intricate tasks to gather data such as accessing\ndatabases and executing code. The result is a production-ready target dossier\ncontaining the acquired information summarized into a PDF and a PowerPoint\npresentation.", "paper_summary_zh": "人工智慧演算法的進步擴展了它們在生物醫學領域等多個領域的應用。人工智慧系統，包括大型語言模型 (LLM)，在藥物發現方面特別有利，而這是一個非常漫長且昂貴的過程。然而，LLM 本身缺乏特定領域的深入知識，並且可能會產生事實不正確的資訊。此外，它們無法執行更複雜的動作，這意味著使用外部工具。我們的研究重點在於這兩個問題。首先，我們展示了進階 RAG 系統的實作如何協助 LLM 產生更準確的答案來回答與藥物發現相關的問題。結果顯示，使用 RAG 系統的 LLM 所產生的答案品質超越了沒有 RAG 的模型所產生的答案。其次，我們展示了如何使用 LLM 建立自動化目標檔案，並將它們與外部工具整合，以便它們能夠執行更複雜的任務來收集資料，例如存取資料庫和執行程式碼。結果是一個可供生產使用的目標檔案，其中包含取得的資訊，並摘要成 PDF 和 PowerPoint 簡報。", "author": "Gabriele Fossi et.al.", "authors": "Gabriele Fossi, Youssef Boulaimen, Leila Outemzabet, Nathalie Jeanray, Stephane Gerart, Sebastien Vachenc, Joanna Giemza, Salvatore Raieli", "id": "2409.15817v1", "paper_url": "http://arxiv.org/abs/2409.15817v1", "repo": "null"}}