{"2408.12799": {"publish_time": "2024-08-23", "title": "Less for More: Enhancing Preference Learning in Generative Language Models with Automated Self-Curation of Training Corpora", "paper_summary": "Ambiguity in language presents challenges in developing more enhanced\nlanguage models, particularly in preference learning, where variability among\nannotators results in inconsistently annotated datasets used for model\nalignment. To address this issue, we introduce a self-curation method that\npreprocesses annotated datasets by leveraging proxy models trained directly on\nthese datasets. Our method enhances preference learning by automatically\ndetecting and removing ambiguous annotations within the dataset. The proposed\napproach is validated through extensive experiments, demonstrating a marked\nimprovement in performance across various instruction-following tasks. Our work\nprovides a straightforward and reliable method to overcome annotation\ninconsistencies, serving as an initial step towards the development of more\nadvanced preference learning techniques.", "paper_summary_zh": "語言中的歧義性對於開發更強化的語言模型構成挑戰，特別是在偏好學習中，標記員之間的變異性導致用於模型對齊的標記資料集不一致。為了解決這個問題，我們引入一種自我整理方法，透過利用直接在這些資料集上訓練的代理模型來預處理標記資料集。我們的模型透過自動偵測和移除資料集中有歧義的標記，增強偏好學習。所提出的方法透過廣泛的實驗驗證，證明在各種指令遵循任務中，效能都有顯著的提升。我們的研究提供一種直接且可靠的方法，來克服標記不一致性，作為邁向開發更進階偏好學習技術的初步步驟。", "author": "JoonHo Lee et.al.", "authors": "JoonHo Lee, JuYoun Son, Juree Seok, Wooseok Jang, Yeong-Dae Kwon", "id": "2408.12799v1", "paper_url": "http://arxiv.org/abs/2408.12799v1", "repo": "null"}}