{"2411.16905": {"publish_time": "2024-11-25", "title": "Boundless Socratic Learning with Language Games", "paper_summary": "An agent trained within a closed system can master any desired capability, as\nlong as the following three conditions hold: (a) it receives sufficiently\ninformative and aligned feedback, (b) its coverage of experience/data is broad\nenough, and (c) it has sufficient capacity and resource. In this position\npaper, we justify these conditions, and consider what limitations arise from\n(a) and (b) in closed systems, when assuming that (c) is not a bottleneck.\nConsidering the special case of agents with matching input and output spaces\n(namely, language), we argue that such pure recursive self-improvement, dubbed\n\"Socratic learning\", can boost performance vastly beyond what is present in its\ninitial data or knowledge, and is only limited by time, as well as gradual\nmisalignment concerns. Furthermore, we propose a constructive framework to\nimplement it, based on the notion of language games.", "paper_summary_zh": "在封閉系統內訓練出的代理程式，只要符合以下三個條件，就能掌握任何所需的技能：(a) 接收充分的資訊且一致的回饋，(b) 經驗/資料的涵蓋範圍夠廣，(c) 擁有足夠的能力和資源。在本文中，我們會說明這些條件，並思考在假設 (c) 不是瓶頸的情況下，封閉系統中的 (a) 和 (b) 會產生什麼限制。考量輸入和輸出空間相符的代理程式（也就是語言）的特殊情況，我們主張這種純粹的遞迴式自我提升，稱為「蘇格拉底學習法」，可以大幅提升效能，遠遠超出其初始資料或知識，而且僅受限於時間，以及逐漸失衡的問題。此外，我們提出一個建構性的架構來實作它，這個架構是基於語言遊戲的概念。", "author": "Tom Schaul et.al.", "authors": "Tom Schaul", "id": "2411.16905v1", "paper_url": "http://arxiv.org/abs/2411.16905v1", "repo": "null"}}