{"2405.11950": {"publish_time": "2024-05-20", "title": "WisPerMed at BioLaySumm: Adapting Autoregressive Large Language Models for Lay Summarization of Scientific Articles", "paper_summary": "This paper details the efforts of the WisPerMed team in the BioLaySumm2024\nShared Task on automatic lay summarization in the biomedical domain, aimed at\nmaking scientific publications accessible to non-specialists. Large language\nmodels (LLMs), specifically the BioMistral and Llama3 models, were fine-tuned\nand employed to create lay summaries from complex scientific texts. The\nsummarization performance was enhanced through various approaches, including\ninstruction tuning, few-shot learning, and prompt variations tailored to\nincorporate specific context information. The experiments demonstrated that\nfine-tuning generally led to the best performance across most evaluated\nmetrics. Few-shot learning notably improved the models' ability to generate\nrelevant and factually accurate texts, particularly when using a well-crafted\nprompt. Additionally, a Dynamic Expert Selection (DES) mechanism to optimize\nthe selection of text outputs based on readability and factuality metrics was\ndeveloped. Out of 54 participants, the WisPerMed team reached the 4th place,\nmeasured by readability, factuality, and relevance. Determined by the overall\nscore, our approach improved upon the baseline by approx. 5.5 percentage points\nand was only approx 1.5 percentage points behind the first place.", "paper_summary_zh": "這篇論文詳細說明了 WisPerMed 團隊在 BioLaySumm2024 生物醫學領域自動化摘要共享任務中的努力，旨在讓非專家也能理解科學出版物。大型語言模型 (LLM)，特別是 BioMistral 和 Llama3 模型經過微調，並用於從複雜的科學文本中建立摘要。摘要的表現透過各種方法得到提升，包括指令微調、少量學習，以及針對特定脈絡資訊而調整的提示變化。實驗證明，微調通常會在大部分評估指標中帶來最佳表現。少量學習顯著改善了模型產生相關且事實正確的文字的能力，特別是在使用精心設計的提示時。此外，還開發了一種動態專家選擇 (DES) 機制，用於根據可讀性和事實性指標來最佳化文字輸出的選擇。在 54 位參與者中，WisPerMed 團隊獲得第 4 名，衡量標準為可讀性、事實性和相關性。根據整體評分，我們的做法比基準線進步了約 5.5 個百分點，僅比第一名低了約 1.5 個百分點。", "author": "Tabea M. G. Pakull et.al.", "authors": "Tabea M. G. Pakull, Hendrik Damm, Ahmad Idrissi-Yaghir, Henning Schäfer, Peter A. Horn, Christoph M. Friedrich", "id": "2405.11950v1", "paper_url": "http://arxiv.org/abs/2405.11950v1", "repo": "null"}}