{"2406.03339": {"publish_time": "2024-06-05", "title": "The Challenges of Evaluating LLM Applications: An Analysis of Automated, Human, and LLM-Based Approaches", "paper_summary": "Chatbots have been an interesting application of natural language generation\nsince its inception. With novel transformer based Generative AI methods,\nbuilding chatbots have become trivial. Chatbots which are targeted at specific\ndomains such as medicine, psychology, and general information retrieval are\nimplemented rapidly. This, however, should not distract from the need to\nevaluate the chatbot responses. Especially because the natural language\ngeneration community does not entirely agree upon how to effectively evaluate\nsuch applications. With this work we discuss the issue further with the\nincreasingly popular LLM based evaluations and how they correlate with human\nevaluations. Additionally, we introduce a comprehensive factored evaluation\nmechanism that can be utilized in conjunction with both human and LLM-based\nevaluations.\n  We present the results of an experimental evaluation conducted using this\nscheme in one of our chatbot implementations, and subsequently compare\nautomated, traditional human evaluation, factored human evaluation, and\nfactored LLM evaluation. Results show that factor based evaluation produces\nbetter insights on which aspects need to be improved in LLM applications and\nfurther strengthens the argument to use human evaluation in critical spaces\nwhere main functionality is not direct retrieval.", "paper_summary_zh": "聊天機器人是自然語言生成自問世以來的一個有趣的應用。有了基於新穎Transformer的生成式 AI 方法，構建聊天機器人已變得微不足道。針對特定領域（如醫學、心理學和一般信息檢索）的聊天機器人可以快速實施。然而，這不應分散對評估聊天機器人回應的需求。特別是因為自然語言生成社群對於如何有效評估此類應用並未完全達成共識。在這項工作中，我們進一步討論了這個問題，以及它與人類評估之間的相關性，以及越來越流行的基於 LLM 的評估。此外，我們引入了一個全面的分層評估機制，它可以與基於人類和 LLM 的評估同時使用。\n我們展示了使用此方案在我們的聊天機器人實作中進行的實驗評估結果，並隨後比較自動化、傳統的人類評估、分層人類評估和分層 LLM 評估。結果表明，基於因子的評估可以產生更好的見解，說明哪些方面需要在 LLM 應用中改進，並進一步加強了在主要功能不是直接檢索的關鍵領域中使用人類評估的論點。", "author": "Bhashithe Abeysinghe et.al.", "authors": "Bhashithe Abeysinghe, Ruhan Circi", "id": "2406.03339v1", "paper_url": "http://arxiv.org/abs/2406.03339v1", "repo": "null"}}