{"2406.14887": {"publish_time": "2024-06-21", "title": "InternLM-Law: An Open Source Chinese Legal Large Language Model", "paper_summary": "While large language models (LLMs) have showcased impressive capabilities,\nthey struggle with addressing legal queries due to the intricate complexities\nand specialized expertise required in the legal field. In this paper, we\nintroduce InternLM-Law, a specialized LLM tailored for addressing diverse legal\nqueries related to Chinese laws, spanning from responding to standard legal\nquestions (e.g., legal exercises in textbooks) to analyzing complex real-world\nlegal situations. We meticulously construct a dataset in the Chinese legal\ndomain, encompassing over 1 million queries, and implement a data filtering and\nprocessing pipeline to ensure its diversity and quality. Our training approach\ninvolves a novel two-stage process: initially fine-tuning LLMs on both\nlegal-specific and general-purpose content to equip the models with broad\nknowledge, followed by exclusive fine-tuning on high-quality legal data to\nenhance structured output generation. InternLM-Law achieves the highest average\nperformance on LawBench, outperforming state-of-the-art models, including\nGPT-4, on 13 out of 20 subtasks. We make InternLM-Law and our dataset publicly\navailable to facilitate future research in applying LLMs within the legal\ndomain.", "paper_summary_zh": "儘管大型語言模型 (LLM) 展示了令人印象深刻的能力，但由於法律領域所需的複雜性和專業知識，它們在處理法律查詢時仍有困難。在本文中，我們介紹了 InternLM-Law，這是一個專門針對處理與中國法律相關的各種法律查詢的 LLM，範圍從回答標準法律問題（例如教科書中的法律練習）到分析複雜的現實世界法律情況。我們在中國法律領域精心構建了一個包含 100 多萬個查詢的資料集，並實施了資料過濾和處理管道，以確保其多樣性和品質。我們的訓練方法涉及一個新穎的兩階段過程：最初針對法律特定和一般用途內容微調 LLM，以讓模型具備廣泛的知識，然後針對高品質的法律資料進行獨家微調，以增強結構化輸出生成。InternLM-Law 在 LawBench 上取得了最高的平均效能，在 20 個子任務中有 13 個子任務的表現優於最先進的模型，包括 GPT-4。我們公開 InternLM-Law 和我們的資料集，以促進未來在法律領域應用 LLM 的研究。", "author": "Zhiwei Fei et.al.", "authors": "Zhiwei Fei, Songyang Zhang, Xiaoyu Shen, Dawei Zhu, Xiao Wang, Maosong Cao, Fengzhe Zhou, Yining Li, Wenwei Zhang, Dahua Lin, Kai Chen, Jidong Ge", "id": "2406.14887v1", "paper_url": "http://arxiv.org/abs/2406.14887v1", "repo": "null"}}