{"2411.13226": {"publish_time": "2024-11-20", "title": "AIDBench: A benchmark for evaluating the authorship identification capability of large language models", "paper_summary": "As large language models (LLMs) rapidly advance and integrate into daily\nlife, the privacy risks they pose are attracting increasing attention. We focus\non a specific privacy risk where LLMs may help identify the authorship of\nanonymous texts, which challenges the effectiveness of anonymity in real-world\nsystems such as anonymous peer review systems. To investigate these risks, we\npresent AIDBench, a new benchmark that incorporates several author\nidentification datasets, including emails, blogs, reviews, articles, and\nresearch papers. AIDBench utilizes two evaluation methods: one-to-one\nauthorship identification, which determines whether two texts are from the same\nauthor; and one-to-many authorship identification, which, given a query text\nand a list of candidate texts, identifies the candidate most likely written by\nthe same author as the query text. We also introduce a Retrieval-Augmented\nGeneration (RAG)-based method to enhance the large-scale authorship\nidentification capabilities of LLMs, particularly when input lengths exceed the\nmodels' context windows, thereby establishing a new baseline for authorship\nidentification using LLMs. Our experiments with AIDBench demonstrate that LLMs\ncan correctly guess authorship at rates well above random chance, revealing new\nprivacy risks posed by these powerful models. The source code and data will be\nmade publicly available after acceptance.", "paper_summary_zh": "隨著大型語言模型 (LLM) 快速進步並整合到日常生活中，它們帶來的隱私風險也引起越來越多的關注。我們專注於一個特定的隱私風險，其中 LLM 可能有助於識別匿名文本的作者，這挑戰了匿名性在現實世界系統中的有效性，例如匿名同行評審系統。為了調查這些風險，我們提出了 AIDBench，這是一個新的基準，它包含了幾個作者識別數據集，包括電子郵件、部落格、評論、文章和研究論文。AIDBench 利用兩種評估方法：一對一的作者識別，它確定兩個文本是否來自同一個作者；以及一對多的作者識別，它在給定一個查詢文本和一個候選文本列表的情況下，識別出最可能由與查詢文本同一個作者編寫的候選文本。我們還引入了一個基於檢索增強生成 (RAG) 的方法來增強 LLM 的大規模作者識別能力，特別是在輸入長度超過模型上下文視窗時，從而為使用 LLM 進行作者識別建立了一個新的基準。我們使用 AIDBench 進行的實驗表明，LLM 可以以遠高於隨機機會的比率正確猜測作者，揭示了這些強大模型帶來的新的隱私風險。原始程式碼和資料將在接受後公開。", "author": "Zichen Wen et.al.", "authors": "Zichen Wen, Dadi Guo, Huishuai Zhang", "id": "2411.13226v1", "paper_url": "http://arxiv.org/abs/2411.13226v1", "repo": "null"}}