{"2501.13264": {"publish_time": "2025-01-22", "title": "RAG-Reward: Optimizing RAG with Reward Modeling and RLHF", "paper_summary": "Retrieval-augmented generation (RAG) enhances Large Language Models (LLMs)\nwith relevant and up-to-date knowledge, improving their ability to answer\nknowledge-intensive questions. It has been shown to enhance both generation\nquality and trustworthiness. While numerous works have focused on improving\nretrieval, generation, and evaluation, the role of reward models in\nreinforcement learning for optimizing RAG and establishing automated\nbenchmarking pipelines remains underexplored. In this paper, we introduce\n\\textbf{RAG-Reward}, a dataset designed to enable \\textit{hallucination-free,\ncomprehensive, reliable, and efficient RAG}. We define four key metrics for\nassessing generation quality and develop an automated annotation pipeline that\nleverages multiple LLMs to generate outputs across diverse RAG scenarios.\nGPT-4o is used to evaluate and construct preference data. Using\n\\textbf{RAG-Reward}, we train reward models and apply reinforcement learning\nwith human feedback (RLHF) to improve LLMs' effectiveness in RAG. Experimental\nresults show that our reward model achieves state-of-the-art performance on a\nheld-out test set, demonstrating both the effectiveness of our approach and the\nquality of our dataset. Furthermore, the improved generation quality of the\ntrained policy model highlights the feasibility of using RLHF to enhance RAG\npipelines.", "paper_summary_zh": "<paragraph>撷取增强生成（RAG）强化大型语言模型（LLM）\n具备相关且最新的知识，提升其回答知识密集型问题的能耐。它已被证明能同时强化生成\n质量和可信度。虽然许多研究专注于改进撷取、生成和评估，但奖励模型在\n强化学习中扮演的角色，以优化 RAG 和建立自动化基准管道仍未受到充分探索。在本文中，我们介绍\n\\textbf{RAG-Reward}，一个数据集旨在实现\\textit{无幻觉、全面、可靠且高效的 RAG}。我们定义了四个关键指标来\n评估生成质量，并开发了一个自动化注释管道，利用多个 LLM 在不同的 RAG 场景中生成输出。\nGPT-4o 用于评估和构建偏好数据。使用\n\\textbf{RAG-Reward}，我们训练奖励模型并应用强化学习\n结合人类反馈（RLHF）来提升 LLM 在 RAG 中的有效性。实验\n结果显示我们的奖励模型在留存测试集上实现了最先进的性能，证明了我们方法的有效性以及\n我们数据集的质量。此外，训练好的策略模型的生成质量提升突显了使用 RLHF 增强 RAG\n管道的可行性。</paragraph>", "author": "Hanning Zhang et.al.", "authors": "Hanning Zhang, Juntong Song, Juno Zhu, Yuanhao Wu, Tong Zhang, Cheng Niu", "id": "2501.13264v1", "paper_url": "http://arxiv.org/abs/2501.13264v1", "repo": "null"}}