{"2411.08879": {"publish_time": "2024-11-13", "title": "4D Gaussian Splatting in the Wild with Uncertainty-Aware Regularization", "paper_summary": "Novel view synthesis of dynamic scenes is becoming important in various\napplications, including augmented and virtual reality. We propose a novel 4D\nGaussian Splatting (4DGS) algorithm for dynamic scenes from casually recorded\nmonocular videos. To overcome the overfitting problem of existing work for\nthese real-world videos, we introduce an uncertainty-aware regularization that\nidentifies uncertain regions with few observations and selectively imposes\nadditional priors based on diffusion models and depth smoothness on such\nregions. This approach improves both the performance of novel view synthesis\nand the quality of training image reconstruction. We also identify the\ninitialization problem of 4DGS in fast-moving dynamic regions, where the\nStructure from Motion (SfM) algorithm fails to provide reliable 3D landmarks.\nTo initialize Gaussian primitives in such regions, we present a dynamic region\ndensification method using the estimated depth maps and scene flow. Our\nexperiments show that the proposed method improves the performance of 4DGS\nreconstruction from a video captured by a handheld monocular camera and also\nexhibits promising results in few-shot static scene reconstruction.", "paper_summary_zh": "動態場景的新穎視圖合成在各種應用中變得重要，包括擴增實境和虛擬實境。我們提出一個用於動態場景的新穎 4D 高斯點繪 (4DGS) 演算法，從隨意記錄的單眼影片中取得。為了克服現有工作對這些真實世界影片的過度擬合問題，我們引入了不確定性感知正則化，它會識別觀察次數較少的不明確區域，並根據擴散模型和深度平滑有選擇性地對此類區域施加額外的先驗。這種方法同時改善了新穎視圖合成的效能和訓練影像重建的品質。我們也識別出 4DGS 在快速移動動態區域中的初始化問題，在這些區域中，運動結構 (SfM) 演算法無法提供可靠的 3D 地標。為了在這些區域中初始化高斯基元，我們提出一個動態區域增密方法，使用估計的深度圖和場景流。我們的實驗顯示，所提出的方法改善了從手持單眼相機拍攝的影片中重建 4DGS 的效能，而且在少量靜態場景重建中也展現出有希望的結果。", "author": "Mijeong Kim et.al.", "authors": "Mijeong Kim, Jongwoo Lim, Bohyung Han", "id": "2411.08879v1", "paper_url": "http://arxiv.org/abs/2411.08879v1", "repo": "null"}}