{"2405.04215": {"publish_time": "2024-05-07", "title": "NL2Plan: Robust LLM-Driven Planning from Minimal Text Descriptions", "paper_summary": "Today's classical planners are powerful, but modeling input tasks in formats\nsuch as PDDL is tedious and error-prone. In contrast, planning with Large\nLanguage Models (LLMs) allows for almost any input text, but offers no\nguarantees on plan quality or even soundness. In an attempt to merge the best\nof these two approaches, some work has begun to use LLMs to automate parts of\nthe PDDL creation process. However, these methods still require various degrees\nof expert input. We present NL2Plan, the first domain-agnostic offline\nLLM-driven planning system. NL2Plan uses an LLM to incrementally extract the\nnecessary information from a short text prompt before creating a complete PDDL\ndescription of both the domain and the problem, which is finally solved by a\nclassical planner. We evaluate NL2Plan on four planning domains and find that\nit solves 10 out of 15 tasks - a clear improvement over a plain\nchain-of-thought reasoning LLM approach, which only solves 2 tasks. Moreover,\nin two out of the five failure cases, instead of returning an invalid plan,\nNL2Plan reports that it failed to solve the task. In addition to using NL2Plan\nin end-to-end mode, users can inspect and correct all of its intermediate\nresults, such as the PDDL representation, increasing explainability and making\nit an assistive tool for PDDL creation.", "paper_summary_zh": "現今的經典規劃器很強大，但以 PDDL 等格式建模輸入任務很繁瑣且容易出錯。相反地，使用大型語言模型 (LLM) 規劃允許幾乎任何輸入文字，但不能保證計畫品質或甚至健全性。為了合併這兩種方法的優點，一些工作已開始使用 LLM 自動化 PDDL 建立過程的一部分。然而，這些方法仍然需要不同程度的專家輸入。我們提出 NL2Plan，這是第一個與網域無關的離線 LLM 驅動計畫系統。NL2Plan 使用 LLM 從簡短的文字提示中逐步提取必要的資訊，然後建立網域和問題的完整 PDDL 說明，最後由經典規劃器解決。我們在四個規劃網域中評估 NL2Plan，發現它解決了 15 個任務中的 10 個，明顯優於僅解決 2 個任務的純粹思考鏈推理 LLM 方法。此外，在五個失敗案例中的兩個案例中，NL2Plan 並未傳回無效計畫，而是報告它無法解決任務。除了在端對端模式中使用 NL2Plan 外，使用者還可以檢查和更正其所有中間結果，例如 PDDL 表示，增加可解釋性並使其成為 PDDL 建立的輔助工具。", "author": "Elliot Gestrin et.al.", "authors": "Elliot Gestrin, Marco Kuhlmann, Jendrik Seipp", "id": "2405.04215v1", "paper_url": "http://arxiv.org/abs/2405.04215v1", "repo": "null"}}