{"2405.04716": {"publish_time": "2024-05-07", "title": "Physics-based deep learning reveals rising heating demand heightens air pollution in Norwegian cities", "paper_summary": "Policymakers frequently analyze air quality and climate change in isolation,\ndisregarding their interactions. This study explores the influence of specific\nclimate factors on air quality by contrasting a regression model with K-Means\nClustering, Hierarchical Clustering, and Random Forest techniques. We employ\nPhysics-based Deep Learning (PBDL) and Long Short-Term Memory (LSTM) to examine\nthe air pollution predictions. Our analysis utilizes ten years (2009-2018) of\ndaily traffic, weather, and air pollution data from three major cities in\nNorway. Findings from feature selection reveal a correlation between rising\nheating degree days and heightened air pollution levels, suggesting increased\nheating activities in Norway are a contributing factor to worsening air\nquality. PBDL demonstrates superior accuracy in air pollution predictions\ncompared to LSTM. This paper contributes to the growing literature on PBDL\nmethods for more accurate air pollution predictions using environmental\nvariables, aiding policymakers in formulating effective data-driven climate\npolicies.", "paper_summary_zh": "政策制定者經常獨立分析空氣品質和氣候變遷，忽視它們之間的交互作用。本研究透過對比回歸模型與 K 平均值分群、階層式分群和隨機森林技術，探討特定氣候因子對空氣品質的影響。我們採用基於物理學深度學習 (PBDL) 和長短期記憶 (LSTM) 來檢驗空氣污染預測。我們的分析利用挪威三個主要城市的十年 (2009-2018) 每日常見交通、天氣和空氣污染資料。特徵選擇的發現顯示，暖氣度日上升與空氣污染程度升高之間存在相關性，這表示挪威的暖氣活動增加是空氣品質惡化的促成因素。與 LSTM 相比，PBDL 在空氣污染預測中展現出更高的準確度。本文有助於發展有關使用環境變數進行更準確空氣污染預測的 PBDL 方法的文獻，協助政策制定者制定有效的資料驅動氣候政策。", "author": "Cong Cao et.al.", "authors": "Cong Cao, Ramit Debnath, R. Michael Alvarez", "id": "2405.04716v1", "paper_url": "http://arxiv.org/abs/2405.04716v1", "repo": "null"}}