{"2406.05039": {"publish_time": "2024-06-07", "title": "Bootstrapping Referring Multi-Object Tracking", "paper_summary": "Referring multi-object tracking (RMOT) aims at detecting and tracking\nmultiple objects following human instruction represented by a natural language\nexpression. Existing RMOT benchmarks are usually formulated through manual\nannotations, integrated with static regulations. This approach results in a\ndearth of notable diversity and a constrained scope of implementation. In this\nwork, our key idea is to bootstrap the task of referring multi-object tracking\nby introducing discriminative language words as much as possible. In specific,\nwe first develop Refer-KITTI into a large-scale dataset, named Refer-KITTI-V2.\nIt starts with 2,719 manual annotations, addressing the issue of class\nimbalance and introducing more keywords to make it closer to real-world\nscenarios compared to Refer-KITTI. They are further expanded to a total of\n9,758 annotations by prompting large language models, which create 617\ndifferent words, surpassing previous RMOT benchmarks. In addition, the\nend-to-end framework in RMOT is also bootstrapped by a simple yet elegant\ntemporal advancement strategy, which achieves better performance than previous\napproaches. The source code and dataset is available at\nhttps://github.com/zyn213/TempRMOT.", "paper_summary_zh": "多目標追蹤（RMOT）旨在偵測和追蹤多個目標，並遵循以自然語言表達的人類指令。現有的 RMOT 基準通常透過手動註解制定，並與靜態法規整合。此方法導致顯著的多樣性不足，且實作範圍受限。在這項工作中，我們的關鍵想法是盡可能引入有區別的語言詞彙，以啟動多目標追蹤任務。具體來說，我們首先將 Refer-KITTI 開發成一個大規模資料集，命名為 Refer-KITTI-V2。它從 2,719 個手動註解開始，解決類別不平衡的問題，並引入更多關鍵字，以使其與現實世界場景更接近，而這也是 Refer-KITTI 所沒有的。它們進一步擴展到總共 9,758 個註解，透過提示大型語言模型，創造出 617 個不同的詞彙，超越先前的 RMOT 基準。此外，RMOT 中的端到端架構也透過一個簡單但優雅的時間推進策略啟動，其效能優於先前的做法。原始碼和資料集可在 https://github.com/zyn213/TempRMOT 取得。", "author": "Yani Zhang et.al.", "authors": "Yani Zhang, Dongming Wu, Wencheng Han, Xingping Dong", "id": "2406.05039v1", "paper_url": "http://arxiv.org/abs/2406.05039v1", "repo": "null"}}