{"2502.12025": {"publish_time": "2025-02-17", "title": "SafeChain: Safety of Language Models with Long Chain-of-Thought Reasoning Capabilities", "paper_summary": "Emerging large reasoning models (LRMs), such as DeepSeek-R1 models, leverage\nlong chain-of-thought (CoT) reasoning to generate structured intermediate\nsteps, enhancing their reasoning capabilities. However, long CoT does not\ninherently guarantee safe outputs, potentially leading to harmful consequences\nsuch as the introduction of security vulnerabilities in code or the spread of\nmisinformation. Current research on large language model (LLM) safety usually\nfocuses on short-answer responses, overlooking the long CoT style outputs of\nLRMs. To bridge this gap, we conduct a systematic study of LRM safety. First,\nwe investigate safety evaluators calibrated against human annotations. Using\nour newly developed metrics, we thoroughly assess the safety of 12\nstate-of-the-art LRMs on StrongReject and WildJailbreak datasets. Our results\nshow that LRMs are not safe compared to their reasoning advance. Further, we\nperform a fine-grained analysis of the reasoning trace and final answer. We\nfind that three decoding strategies-ZeroThink, LessThink, and MoreThink-can\nimprove model safety without additional training. However, these strategies\neither use constrained reasoning traces or incur high inference costs. To\nbetter strengthen LRM safety, we introduce SafeChain, the first-of-its-kind\nsafety training dataset in CoT style. We fine-tune two LRMs with SafeChain,\nshowing that it not only enhances model safety but also preserves performance\nacross 6 reasoning benchmarks.", "paper_summary_zh": "新興的大型推理模型（LRM），例如 DeepSeek-R1 模型，利用長鏈思考（CoT）推理來生成結構化的中間步驟，增強其推理能力。然而，長 CoT 本質上並不能保證安全的輸出，可能會導致有害的後果，例如在程式碼中引入安全漏洞或散佈錯誤訊息。目前針對大型語言模型（LLM）安全性的研究通常側重於簡短的回答回應，忽略了 LRM 的長 CoT 風格輸出。為了彌補這個差距，我們對 LRM 安全性進行系統性研究。首先，我們研究根據人類註解校正的安全評估器。使用我們新開發的指標，我們徹底評估了 12 個最先進的 LRM 在 StrongReject 和 WildJailbreak 資料集上的安全性。我們的結果表明，與其推理進度相比，LRM 並不安全。此外，我們對推理軌跡和最終答案進行了細粒度分析。我們發現三種解碼策略（ZeroThink、LessThink 和 MoreThink）可以在不額外訓練的情況下提高模型安全性。然而，這些策略要么使用受約束的推理軌跡，要么會產生高昂的推論成本。為了進一步加強 LRM 安全性，我們引入了 SafeChain，這是第一個 CoT 風格的安全訓練資料集。我們使用 SafeChain 微調了兩個 LRM，表明它不僅增強了模型安全性，而且在 6 個推理基準測試中都保持了效能。", "author": "Fengqing Jiang et.al.", "authors": "Fengqing Jiang, Zhangchen Xu, Yuetai Li, Luyao Niu, Zhen Xiang, Bo Li, Bill Yuchen Lin, Radha Poovendran", "id": "2502.12025v1", "paper_url": "http://arxiv.org/abs/2502.12025v1", "repo": "null"}}