{"2410.05258": {"publish_time": "2024-10-07", "title": "Differential Transformer", "paper_summary": "Transformer tends to overallocate attention to irrelevant context. In this\nwork, we introduce Diff Transformer, which amplifies attention to the relevant\ncontext while canceling noise. Specifically, the differential attention\nmechanism calculates attention scores as the difference between two separate\nsoftmax attention maps. The subtraction cancels noise, promoting the emergence\nof sparse attention patterns. Experimental results on language modeling show\nthat Diff Transformer outperforms Transformer in various settings of scaling up\nmodel size and training tokens. More intriguingly, it offers notable advantages\nin practical applications, such as long-context modeling, key information\nretrieval, hallucination mitigation, in-context learning, and reduction of\nactivation outliers. By being less distracted by irrelevant context, Diff\nTransformer can mitigate hallucination in question answering and text\nsummarization. For in-context learning, Diff Transformer not only enhances\naccuracy but is also more robust to order permutation, which was considered as\na chronic robustness issue. The results position Diff Transformer as a highly\neffective and promising architecture to advance large language models.", "paper_summary_zh": "Transformer 傾向於過度將注意力分配給無關的內容。在這項工作中，我們引入了 Diff Transformer，它會放大對相關內容的注意力，同時消除雜訊。具體來說，差分注意力機制將注意力分數計算為兩個獨立 softmax 注意力圖之間的差異。減法消除了雜訊，促进了稀疏注意力模式的出現。語言建模的實驗結果表明，Diff Transformer 在擴展模型大小和訓練標記的各種設定中都優於 Transformer。更有趣的是，它在實用應用中提供了顯著的優勢，例如長內容建模、關鍵資訊檢索、幻覺減緩、情境學習和減少激活異常值。透過減少對無關內容的干擾，Diff Transformer 可以減輕問答和文字摘要中的幻覺。對於情境學習，Diff Transformer 不僅提高了準確性，而且對順序排列也更穩健，這被認為是一個長期的穩健性問題。這些結果將 Diff Transformer 定位為一種高效且有前途的架構，以推進大型語言模型。", "author": "Tianzhu Ye et.al.", "authors": "Tianzhu Ye, Li Dong, Yuqing Xia, Yutao Sun, Yi Zhu, Gao Huang, Furu Wei", "id": "2410.05258v1", "paper_url": "http://arxiv.org/abs/2410.05258v1", "repo": "null"}}