{"2409.11003": {"publish_time": "2024-09-17", "title": "Single-stage TTS with Masked Audio Token Modeling and Semantic Knowledge Distillation", "paper_summary": "Audio token modeling has become a powerful framework for speech synthesis,\nwith two-stage approaches employing semantic tokens remaining prevalent. In\nthis paper, we aim to simplify this process by introducing a semantic knowledge\ndistillation method that enables high-quality speech generation in a single\nstage. Our proposed model improves speech quality, intelligibility, and speaker\nsimilarity compared to a single-stage baseline. Although two-stage systems\nstill lead in intelligibility, our model significantly narrows the gap while\ndelivering comparable speech quality. These findings showcase the potential of\nsingle-stage models to achieve efficient, high-quality TTS with a more compact\nand streamlined architecture.", "paper_summary_zh": "語音代幣建模已成為語音合成的強大架構，其中採用語義代幣的兩階段方法仍然普遍。在本文中，我們旨在通過引入語義知識蒸餾方法來簡化此過程，該方法可以在單個階段中實現高品質的語音生成。與單階段基準相比，我們提出的模型改進了語音品質、清晰度和說話者相似度。儘管兩階段系統在清晰度方面仍然領先，但我們的模型顯著縮小了差距，同時提供了可比較的語音品質。這些發現展示了單階段模型在使用更緊湊、更簡化的架構實現高效、高品質的 TTS 的潛力。", "author": "Gerard I. Gállego et.al.", "authors": "Gerard I. Gállego, Roy Fejgin, Chunghsin Yeh, Xiaoyu Liu, Gautam Bhattacharya", "id": "2409.11003v1", "paper_url": "http://arxiv.org/abs/2409.11003v1", "repo": "null"}}