{"2408.15666": {"publish_time": "2024-08-28", "title": "StyleRemix: Interpretable Authorship Obfuscation via Distillation and Perturbation of Style Elements", "paper_summary": "Authorship obfuscation, rewriting a text to intentionally obscure the\nidentity of the author, is an important but challenging task. Current methods\nusing large language models (LLMs) lack interpretability and controllability,\noften ignoring author-specific stylistic features, resulting in less robust\nperformance overall.\n  To address this, we develop StyleRemix, an adaptive and interpretable\nobfuscation method that perturbs specific, fine-grained style elements of the\noriginal input text. StyleRemix uses pre-trained Low Rank Adaptation (LoRA)\nmodules to rewrite an input specifically along various stylistic axes (e.g.,\nformality and length) while maintaining low computational cost. StyleRemix\noutperforms state-of-the-art baselines and much larger LLMs in a variety of\ndomains as assessed by both automatic and human evaluation.\n  Additionally, we release AuthorMix, a large set of 30K high-quality,\nlong-form texts from a diverse set of 14 authors and 4 domains, and DiSC, a\nparallel corpus of 1,500 texts spanning seven style axes in 16 unique\ndirections", "paper_summary_zh": "作者混淆，重写文本以故意模糊作者身份，是一项重要但具有挑战性的任务。当前使用大型语言模型 (LLM) 的方法缺乏可解释性和可控性，通常会忽略作者特定的文体特征，从而导致整体性能不够稳健。\n为了解决这个问题，我们开发了 StyleRemix，这是一种自适应且可解释的混淆方法，它扰乱了原始输入文本中特定、细粒度的风格元素。StyleRemix 使用预训练的低秩自适应 (LoRA) 模块来专门沿着各种文体轴（例如，正式性和长度）重写输入，同时保持较低的计算成本。StyleRemix 在各种领域中优于最先进的基线和更大的 LLM，这是通过自动和人工评估得出的。\n此外，我们发布了 AuthorMix，这是一组来自 14 位作者和 4 个领域的大量 30K 高质量长篇文本，以及 DiSC，这是一个包含 1500 篇文本的平行语料库，跨越 16 个独特方向的七个风格轴", "author": "Jillian Fisher et.al.", "authors": "Jillian Fisher, Skyler Hallinan, Ximing Lu, Mitchell Gordon, Zaid Harchaoui, Yejin Choi", "id": "2408.15666v1", "paper_url": "http://arxiv.org/abs/2408.15666v1", "repo": "https://github.com/jfisher52/StyleRemix"}}