{"2409.03171": {"publish_time": "2024-09-05", "title": "MARAGS: A Multi-Adapter System for Multi-Task Retrieval Augmented Generation Question Answering", "paper_summary": "In this paper we present a multi-adapter retrieval augmented generation\nsystem (MARAGS) for Meta's Comprehensive RAG (CRAG) competition for KDD CUP\n2024. CRAG is a question answering dataset contains 3 different subtasks aimed\nat realistic question and answering RAG related tasks, with a diverse set of\nquestion topics, question types, time dynamic answers, and questions featuring\nentities of varying popularity.\n  Our system follows a standard setup for web based RAG, which uses processed\nweb pages to provide context for an LLM to produce generations, while also\nquerying API endpoints for additional information. MARAGS also utilizes\nmultiple different adapters to solve the various requirements for these tasks\nwith a standard cross-encoder model for ranking candidate passages relevant for\nanswering the question. Our system achieved 2nd place for Task 1 as well as 3rd\nplace on Task 2.", "paper_summary_zh": "在本文中，我們提出了一個多適配器檢索增強生成系統 (MARAGS)，用於 Meta 的綜合 RAG (CRAG) 競賽，以參加 2024 年 KDD CUP。CRAG 是一個問答資料集，包含 3 個不同的子任務，旨在實現與 RAG 相關的現實問題和回答任務，其中包含各種問題主題、問題類型、時間動態答案，以及具有不同熱門程度實體的問題。\n我們的系統遵循基於 Web 的 RAG 的標準設置，它使用處理過的網頁為 LLM 提供上下文以產生生成，同時也查詢 API 端點以獲取額外資訊。MARAGS 還利用多個不同的適配器來解決這些任務的各種需求，並使用標準交叉編碼器模型對與回答問題相關的候選段落進行排名。我們的系統在任務 1 中獲得第二名，在任務 2 中獲得第三名。", "author": "Mitchell DeHaven et.al.", "authors": "Mitchell DeHaven", "id": "2409.03171v1", "paper_url": "http://arxiv.org/abs/2409.03171v1", "repo": "null"}}