{"2409.11798": {"publish_time": "2024-09-18", "title": "The Factuality of Large Language Models in the Legal Domain", "paper_summary": "This paper investigates the factuality of large language models (LLMs) as\nknowledge bases in the legal domain, in a realistic usage scenario: we allow\nfor acceptable variations in the answer, and let the model abstain from\nanswering when uncertain. First, we design a dataset of diverse factual\nquestions about case law and legislation. We then use the dataset to evaluate\nseveral LLMs under different evaluation methods, including exact, alias, and\nfuzzy matching. Our results show that the performance improves significantly\nunder the alias and fuzzy matching methods. Further, we explore the impact of\nabstaining and in-context examples, finding that both strategies enhance\nprecision. Finally, we demonstrate that additional pre-training on legal\ndocuments, as seen with SaulLM, further improves factual precision from 63% to\n81%.", "paper_summary_zh": "這篇論文研究了在法律領域中，大型語言模型 (LLM) 作為知識庫的真實性，並在一個實際的使用情境中進行：我們允許答案有可接受的變化，並讓模型在不確定時避免回答。首先，我們設計了一個關於案例法和立法的多元事實問題的資料集。然後，我們使用該資料集在不同的評估方法下評估多個 LLM，包括完全匹配、別名匹配和模糊匹配。我們的結果顯示，在別名匹配和模糊匹配方法下，效能顯著提升。此外，我們探討了避免回答和語境範例的影響，發現這兩種策略都能提高精準度。最後，我們證明了在法律文件中進行額外的預訓練，例如 SaulLM，進一步將事實精準度從 63% 提升至 81%。", "author": "Rajaa El Hamdani et.al.", "authors": "Rajaa El Hamdani, Thomas Bonald, Fragkiskos Malliaros, Nils Holzenberger, Fabian Suchanek", "id": "2409.11798v1", "paper_url": "http://arxiv.org/abs/2409.11798v1", "repo": "null"}}