{"2407.18743": {"publish_time": "2024-07-26", "title": "Towards Effective and Efficient Continual Pre-training of Large Language Models", "paper_summary": "Continual pre-training (CPT) has been an important approach for adapting\nlanguage models to specific domains or tasks. To make the CPT approach more\ntraceable, this paper presents a technical report for continually pre-training\nLlama-3 (8B), which significantly enhances the Chinese language ability and\nscientific reasoning ability of the backbone model. To enhance the new\nabilities while retaining the original abilities, we design specific data\nmixture and curriculum strategies by utilizing existing datasets and\nsynthesizing high-quality datasets. Specifically, we synthesize\nmultidisciplinary scientific question and answer (QA) pairs based on related\nweb pages, and subsequently incorporate these synthetic data to improve the\nscientific reasoning ability of Llama-3. We refer to the model after CPT as\nLlama-3-SynE (Synthetic data Enhanced Llama-3). We also present the tuning\nexperiments with a relatively small model -- TinyLlama, and employ the derived\nfindings to train the backbone model. Extensive experiments on a number of\nevaluation benchmarks show that our approach can largely improve the\nperformance of the backbone models, including both the general abilities (+8.81\non C-Eval and +6.31 on CMMLU) and the scientific reasoning abilities (+12.00 on\nMATH and +4.13 on SciEval), without hurting the original capacities. Our model,\ndata, and codes are available at https://github.com/RUC-GSAI/Llama-3-SynE.", "paper_summary_zh": "持續預訓練 (CPT) 一直是將語言模型調整到特定領域或任務的重要方法。為了讓 CPT 方法更具可追溯性，本文針對 Llama-3 (8B) 的持續預訓練提出技術報告，大幅提升了主幹模型的中文能力和科學推理能力。為了在保留原本能力的同時提升新能力，我們利用既有資料集並合成高品質資料集，設計出特定的資料混合和課程策略。具體來說，我們根據相關網頁合成跨學科科學問答 (QA) 配對，並進一步納入這些合成資料，以提升 Llama-3 的科學推理能力。我們將 CPT 後的模型稱為 Llama-3-SynE (合成資料增強 Llama-3)。我們也提出一個使用相對較小模型 TinyLlama 的微調實驗，並運用得出的發現來訓練主幹模型。在多個評量基準上的廣泛實驗顯示，我們的做法大幅提升了主幹模型的效能，包括一般能力（在 C-Eval 上提升 +8.81，在 CMMLU 上提升 +6.31）和科學推理能力（在 MATH 上提升 +12.00，在 SciEval 上提升 +4.13），且不損及原本的能力。我們的模型、資料和程式碼可在 https://github.com/RUC-GSAI/Llama-3-SynE 取得。", "author": "Jie Chen et.al.", "authors": "Jie Chen, Zhipeng Chen, Jiapeng Wang, Kun Zhou, Yutao Zhu, Jinhao Jiang, Yingqian Min, Wayne Xin Zhao, Zhicheng Dou, Jiaxin Mao, Yankai Lin, Ruihua Song, Jun Xu, Xu Chen, Rui Yan, Zhewei Wei, Di Hu, Wenbing Huang, Ji-Rong Wen", "id": "2407.18743v1", "paper_url": "http://arxiv.org/abs/2407.18743v1", "repo": "null"}}