{"2410.05254": {"publish_time": "2024-10-07", "title": "GLEE: A Unified Framework and Benchmark for Language-based Economic Environments", "paper_summary": "Large Language Models (LLMs) show significant potential in economic and\nstrategic interactions, where communication via natural language is often\nprevalent. This raises key questions: Do LLMs behave rationally? Can they mimic\nhuman behavior? Do they tend to reach an efficient and fair outcome? What is\nthe role of natural language in the strategic interaction? How do\ncharacteristics of the economic environment influence these dynamics? These\nquestions become crucial concerning the economic and societal implications of\nintegrating LLM-based agents into real-world data-driven systems, such as\nonline retail platforms and recommender systems. While the ML community has\nbeen exploring the potential of LLMs in such multi-agent setups, varying\nassumptions, design choices and evaluation criteria across studies make it\ndifficult to draw robust and meaningful conclusions. To address this, we\nintroduce a benchmark for standardizing research on two-player, sequential,\nlanguage-based games. Inspired by the economic literature, we define three base\nfamilies of games with consistent parameterization, degrees of freedom and\neconomic measures to evaluate agents' performance (self-gain), as well as the\ngame outcome (efficiency and fairness). We develop an open-source framework for\ninteraction simulation and analysis, and utilize it to collect a dataset of LLM\nvs. LLM interactions across numerous game configurations and an additional\ndataset of human vs. LLM interactions. Through extensive experimentation, we\ndemonstrate how our framework and dataset can be used to: (i) compare the\nbehavior of LLM-based agents to human players in various economic contexts;\n(ii) evaluate agents in both individual and collective performance measures;\nand (iii) quantify the effect of the economic characteristics of the\nenvironments on the behavior of agents.", "paper_summary_zh": "大型語言模型 (LLM) 在經濟和策略互動中展現出顯著的潛力，其中透過自然語言進行溝通的情況經常出現。這引發了幾個關鍵問題：LLM 是否表現出理性行為？它們能模擬人類行為嗎？它們是否傾向於達成有效率且公平的結果？自然語言在策略互動中扮演什麼角色？經濟環境的特性如何影響這些動態？這些問題對於整合基於 LLM 的代理到現實世界資料驅動系統（例如線上零售平台和推薦系統）的經濟和社會影響至關重要。雖然機器學習社群一直在探索 LLM 在此類多重代理設定中的潛力，但不同研究中的假設、設計選擇和評估標準不同，使得難以得出穩健且有意義的結論。為了解決這個問題，我們針對雙人、循序、基於語言的遊戲引入了標準化研究的基準。受到經濟文獻的啟發，我們定義了三個基本遊戲家族，具有相符的參數化、自由度和經濟衡量標準，用於評估代理的表現（自我獲利），以及遊戲結果（效率和公平性）。我們開發了一個開放原始碼架構，用於互動模擬和分析，並利用它收集了 LLM 與 LLM 在許多遊戲配置中互動的資料集，以及人類與 LLM 互動的額外資料集。透過廣泛的實驗，我們展示了我們的架構和資料集如何用於：(i) 比較基於 LLM 的代理與人類玩家在各種經濟情境中的行為；(ii) 評估代理在個人和集體表現衡量標準中的表現；以及 (iii) 量化環境的經濟特性對代理行為的影響。", "author": "Eilam Shapira et.al.", "authors": "Eilam Shapira, Omer Madmon, Itamar Reinman, Samuel Joseph Amouyal, Roi Reichart, Moshe Tennenholtz", "id": "2410.05254v1", "paper_url": "http://arxiv.org/abs/2410.05254v1", "repo": "null"}}