{"2502.13321": {"publish_time": "2025-02-18", "title": "Adjust for Trust: Mitigating Trust-Induced Inappropriate Reliance on AI Assistance", "paper_summary": "Trust biases how users rely on AI recommendations in AI-assisted\ndecision-making tasks, with low and high levels of trust resulting in increased\nunder- and over-reliance, respectively. We propose that AI assistants should\nadapt their behavior through trust-adaptive interventions to mitigate such\ninappropriate reliance. For instance, when user trust is low, providing an\nexplanation can elicit more careful consideration of the assistant's advice by\nthe user. In two decision-making scenarios -- laypeople answering science\nquestions and doctors making medical diagnoses -- we find that providing\nsupporting and counter-explanations during moments of low and high trust,\nrespectively, yields up to 38% reduction in inappropriate reliance and 20%\nimprovement in decision accuracy. We are similarly able to reduce over-reliance\nby adaptively inserting forced pauses to promote deliberation. Our results\nhighlight how AI adaptation to user trust facilitates appropriate reliance,\npresenting exciting avenues for improving human-AI collaboration.", "paper_summary_zh": "信任偏見影響使用者在 AI 輔助決策任務中如何依賴 AI 建議，信任程度低和高分別導致依賴不足和過度依賴。我們建議 AI 助理應透過信任適應式干預調整其行為，以減輕這種不適當的依賴。例如，當使用者信任度低時，提供解釋可以引發使用者更仔細地考慮助理的建議。在兩種決策情境中——外行人回答科學問題和醫生進行醫療診斷——我們發現，分別在信任度低和高的時刻提供支持性和反向解釋，可以將不適當的依賴降低多達 38%，並將決策準確性提高 20%。我們同樣能夠透過適應性地插入強制暫停來促進審議，以減少過度依賴。我們的結果強調 AI 如何適應使用者信任以促進適當的依賴，為改善人機協作提供了令人興奮的途徑。", "author": "Tejas Srinivasan et.al.", "authors": "Tejas Srinivasan, Jesse Thomason", "id": "2502.13321v1", "paper_url": "http://arxiv.org/abs/2502.13321v1", "repo": "null"}}