{"2210.03332": {"publish_time": "2022-10-07", "title": "Explainable AI based Glaucoma Detection using Transfer Learning and LIME", "paper_summary": "Glaucoma is the second driving reason for partial or complete blindness among\nall the visual deficiencies which mainly occurs because of excessive pressure\nin the eye due to anxiety or depression which damages the optic nerve and\ncreates complications in vision. Traditional glaucoma screening is a\ntime-consuming process that necessitates the medical professionals' constant\nattention, and even so time to time due to the time constrains and pressure\nthey fail to classify correctly that leads to wrong treatment. Numerous efforts\nhave been made to automate the entire glaucoma classification procedure\nhowever, these existing models in general have a black box characteristics that\nprevents users from understanding the key reasons behind the prediction and\nthus medical practitioners generally can not rely on these system. In this\narticle after comparing with various pre-trained models, we propose a transfer\nlearning model that is able to classify Glaucoma with 94.71\\% accuracy. In\naddition, we have utilized Local Interpretable Model-Agnostic\nExplanations(LIME) that introduces explainability in our system. This\nimprovement enables medical professionals obtain important and comprehensive\ninformation that aid them in making judgments. It also lessen the opacity and\nfragility of the traditional deep learning models.", "paper_summary_zh": "青光眼是所有視力缺陷中導致部分或完全失明的第二大原因，主要是由於焦慮或憂鬱症導致眼睛壓力過大，損害視神經並造成視力併發症。傳統的青光眼篩檢是一個耗時的過程，需要醫療專業人員持續關注，即使如此，由於時間限制和壓力，他們有時無法正確分類，導致治療錯誤。已經做出許多努力來自動化整個青光眼分類程序，然而，這些現有模型通常具有黑盒特徵，使用戶無法理解預測背後的主要原因，因此醫療從業人員通常無法依賴這些系統。在本文中，在與各種預訓練模型比較後，我們提出了一個轉移學習模型，能夠以 94.71% 的準確率對青光眼進行分類。此外，我們利用了局部可解釋模型不可知解釋（LIME），在我們的系統中引入了可解釋性。這項改進使醫療專業人員能夠獲得重要且全面的資訊，幫助他們做出判斷。它也降低了傳統深度學習模型的不透明性和脆弱性。", "author": "Touhidul Islam Chayan et.al.", "authors": "Touhidul Islam Chayan, Anita Islam, Eftykhar Rahman, Md. Tanzim Reza, Tasnim Sakib Apon, MD. Golam Rabiul Alam", "id": "2210.03332v1", "paper_url": "http://arxiv.org/abs/2210.03332v1", "repo": "null"}}