{"2406.09215": {"publish_time": "2024-06-13", "title": "On Softmax Direct Preference Optimization for Recommendation", "paper_summary": "Recommender systems aim to predict personalized rankings based on user\npreference data. With the rise of Language Models (LMs), LM-based recommenders\nhave been widely explored due to their extensive world knowledge and powerful\nreasoning abilities. Most of the LM-based recommenders convert historical\ninteractions into language prompts, pairing with a positive item as the target\nresponse and fine-tuning LM with a language modeling loss. However, the current\nobjective fails to fully leverage preference data and is not optimized for\npersonalized ranking tasks, which hinders the performance of LM-based\nrecommenders. Inspired by the current advancement of Direct Preference\nOptimization (DPO) in human preference alignment and the success of softmax\nloss in recommendations, we propose Softmax-DPO (\\textbf{S-DPO}) to instill\nranking information into the LM to help LM-based recommenders distinguish\npreferred items from negatives, rather than solely focusing on positives.\nSpecifically, we incorporate multiple negatives in user preference data and\ndevise an alternative version of DPO loss tailored for LM-based recommenders,\nconnected to softmax sampling strategies. Theoretically, we bridge S-DPO with\nthe softmax loss over negative sampling and find that it has a side effect of\nmining hard negatives, which assures its exceptional capabilities in\nrecommendation tasks. Empirically, extensive experiments conducted on three\nreal-world datasets demonstrate the superiority of S-DPO to effectively model\nuser preference and further boost recommendation performance while mitigating\nthe data likelihood decline issue of DPO. Our codes are available at\nhttps://github.com/chenyuxin1999/S-DPO.", "paper_summary_zh": "推薦系統旨在根據使用者偏好資料預測個人化排名。隨著語言模型 (LM) 的興起，基於 LM 的推薦系統因其廣泛的世界知識和強大的推理能力而被廣泛探索。大多數基於 LM 的推薦系統會將歷史互動轉換為語言提示，與正向項目配對作為目標回應，並使用語言建模損失微調 LM。然而，目前的目標未能充分利用偏好資料，且未針對個人化排名任務進行最佳化，這阻礙了基於 LM 的推薦系統的效能。受到人類偏好對齊中直接偏好最佳化 (DPO) 的最新進展以及推薦中 softmax 損失成功的啟發，我們提出 Softmax-DPO (\\textbf{S-DPO})，將排名資訊灌輸到 LM 中，以協助基於 LM 的推薦系統區分偏好的項目和負面項目，而非僅專注於正向項目。具體來說，我們在使用者偏好資料中納入多個負面項目，並設計出針對基於 LM 的推薦系統量身打造的 DPO 損失替代版本，並與 softmax 取樣策略相連。在理論上，我們將 S-DPO 與負面取樣上的 softmax 損失結合起來，並發現它具有挖掘困難負面項目的副作用，這確保了它在推薦任務中的卓越能力。在經驗上，在三個真實世界資料集上進行的廣泛實驗證明了 S-DPO 在有效建模使用者偏好方面的優越性，並進一步提升了推薦效能，同時減輕了 DPO 的資料可能性下降問題。我們的程式碼可在 https://github.com/chenyuxin1999/S-DPO 取得。", "author": "Yuxin Chen et.al.", "authors": "Yuxin Chen, Junfei Tan, An Zhang, Zhengyi Yang, Leheng Sheng, Enzhi Zhang, Xiang Wang, Tat-Seng Chua", "id": "2406.09215v1", "paper_url": "http://arxiv.org/abs/2406.09215v1", "repo": "https://github.com/chenyuxin1999/s-dpo"}}