{"2404.18271": {"publish_time": "2024-04-28", "title": "Parameter-Efficient Tuning Large Language Models for Graph Representation Learning", "paper_summary": "Text-rich graphs, which exhibit rich textual information on nodes and edges,\nare prevalent across a wide range of real-world business applications. Large\nLanguage Models (LLMs) have demonstrated remarkable abilities in understanding\ntext, which also introduced the potential for more expressive modeling in\ntext-rich graphs. Despite these capabilities, efficiently applying LLMs to\nrepresentation learning on graphs presents significant challenges. Recently,\nparameter-efficient fine-tuning methods for LLMs have enabled efficient new\ntask generalization with minimal time and memory consumption. Inspired by this,\nwe introduce Graph-aware Parameter-Efficient Fine-Tuning - GPEFT, a novel\napproach for efficient graph representation learning with LLMs on text-rich\ngraphs. Specifically, we utilize a graph neural network (GNN) to encode\nstructural information from neighboring nodes into a graph prompt. This prompt\nis then inserted at the beginning of the text sequence. To improve the quality\nof graph prompts, we pre-trained the GNN to assist the frozen LLM in predicting\nthe next token in the node text. Compared with existing joint GNN and LMs, our\nmethod directly generate the node embeddings from large language models with an\naffordable fine-tuning cost. We validate our approach through comprehensive\nexperiments conducted on 8 different text-rich graphs, observing an average\nimprovement of 2% in hit@1 and Mean Reciprocal Rank (MRR) in link prediction\nevaluations. Our results demonstrate the efficacy and efficiency of our model,\nshowing that it can be smoothly integrated with various large language models,\nincluding OPT, LLaMA and Falcon.", "paper_summary_zh": "<paragraph>文本丰富的图表在广泛的实际商业应用中普遍存在，它们在节点和边上展示丰富的文本信息。大型语言模型 (LLM) 已在理解文本方面展现出非凡的能力，这也为在文本丰富的图表中进行更具表现力的建模带来了可能性。尽管有这些能力，但有效地将 LLM 应用于图表上的表示学习仍然面临着重大挑战。最近，针对 LLM 的参数高效微调方法已实现高效的新任务泛化，且时间和内存消耗最小。受此启发，我们引入了图感知参数高效微调 - GPEFT，一种在文本丰富的图表上使用 LLM 进行高效图表示学习的新方法。具体而言，我们利用图神经网络 (GNN) 将来自相邻节点的结构信息编码到图提示中。然后将此提示插入文本序列的开头。为了提高图提示的质量，我们预训练了 GNN 以帮助冻结的 LLM 预测节点文本中的下一个标记。与现有的联合 GNN 和 LM 相比，我们的方法直接从大型语言模型生成节点嵌入，且微调成本低廉。我们通过在 8 个不同的文本丰富图表上进行的综合实验验证了我们的方法，观察到在链接预测评估中，hit@1 和平均倒数秩 (MRR) 平均提高了 2%。我们的结果证明了我们模型的有效性和效率，表明它可以与各种大型语言模型（包括 OPT、LLaMA 和 Falcon）平滑集成。</paragraph>", "author": "Qi Zhu et.al.", "authors": "Qi Zhu, Da Zheng, Xiang Song, Shichang Zhang, Bowen Jin, Yizhou Sun, George Karypis", "id": "2404.18271v1", "paper_url": "http://arxiv.org/abs/2404.18271v1", "repo": "null"}}