{"2412.09415": {"publish_time": "2024-12-12", "title": "Text Generation Models for Luxembourgish with Limited Data: A Balanced Multilingual Strategy", "paper_summary": "This paper addresses the challenges in developing language models for\nless-represented languages, with a focus on Luxembourgish. Despite its active\ndevelopment, Luxembourgish faces a digital data scarcity, exacerbated by\nLuxembourg's multilingual context. We propose a novel text generation model\nbased on the T5 architecture, combining limited Luxembourgish data with equal\namounts, in terms of size and type, of German and French data. We hypothesise\nthat a model trained on Luxembourgish, German, and French will improve the\nmodel's cross-lingual transfer learning capabilities and outperform monolingual\nand large multilingual models. To verify this, the study at hand explores\nwhether multilingual or monolingual training is more beneficial for\nLuxembourgish language generation. For the evaluation, we introduce LuxGen, a\ntext generation benchmark that is the first of its kind for Luxembourgish.", "paper_summary_zh": "本文探討了開發低資源語言語言模型的挑戰，重點關注盧森堡語。儘管盧森堡語積極發展，但仍面臨數位資料短缺的問題，而盧森堡的多語言環境更讓情況雪上加霜。我們提出了基於 T5 架構的新穎文字生成模型，將有限的盧森堡語資料與德語和法語資料在大小和類型上等量結合。我們假設以盧森堡語、德語和法語訓練的模型將提升模型的跨語言傳輸學習能力，並優於單語和大型多語言模型。為了驗證這一點，本研究探討了多語言或單語言訓練對於盧森堡語生成更為有利。在評估方面，我們引入了 LuxGen，這是盧森堡語的第一個同類型文字生成基準。", "author": "Alistair Plum et.al.", "authors": "Alistair Plum, Tharindu Ranasinghe, Christoph Purschke", "id": "2412.09415v1", "paper_url": "http://arxiv.org/abs/2412.09415v1", "repo": "null"}}