{"2406.19593": {"publish_time": "2024-06-28", "title": "SK-VQA: Synthetic Knowledge Generation at Scale for Training Context-Augmented Multimodal LLMs", "paper_summary": "Synthetic data generation has gained significant attention recently for its\nutility in training large vision and language models. However, the application\nof synthetic data to the training of multimodal context-augmented generation\nsystems has been relatively unexplored. This gap in existing work is important\nbecause existing vision and language models (VLMs) are not trained specifically\nfor context-augmented generation. Resources for adapting such models are\ntherefore crucial for enabling their use in retrieval-augmented generation\n(RAG) settings, where a retriever is used to gather relevant information that\nis then subsequently provided to a generative model via context augmentation.\nTo address this challenging problem, we generate SK-VQA: a large synthetic\nmultimodal dataset containing over 2 million question-answer pairs which\nrequire external knowledge to determine the final answer. Our dataset is both\nlarger and significantly more diverse than existing resources of its kind,\npossessing over 11x more unique questions and containing images from a greater\nvariety of sources than previously-proposed datasets. Through extensive\nexperiments, we demonstrate that our synthetic dataset can not only serve as a\nchallenging benchmark, but is also highly effective for adapting existing\ngenerative multimodal models for context-augmented generation.", "paper_summary_zh": "合成資料生成最近因其在訓練大型視覺和語言模型中的效用而備受關注。然而，合成資料在多模態上下文擴充生成系統的訓練中的應用相對未經探索。現有工作中的這個差距很重要，因為現有的視覺和語言模型 (VLM) 並非專門針對上下文擴充生成進行訓練。因此，調整此類模型的資源對於讓它們能夠用於檢索擴充生成 (RAG) 設定至關重要，其中檢索器用於收集相關資訊，然後通過上下文擴充提供給生成模型。為了解決這個具有挑戰性的問題，我們生成了 SK-VQA：一個大型合成多模態資料集，包含超過 200 萬個問題解答對，需要外部知識才能確定最終答案。我們的資料集比同類現有資源更大且更為多元，擁有超過 11 倍的獨特問題，且包含來自比先前提出的資料集更多樣化來源的影像。透過廣泛的實驗，我們證明我們的合成資料集不僅可以用作具有挑戰性的基準，而且對於調整現有的生成多模態模型以進行上下文擴充生成也非常有效。", "author": "Xin Su et.al.", "authors": "Xin Su, Man Luo, Kris W Pan, Tien Pei Chou, Vasudev Lal, Phillip Howard", "id": "2406.19593v1", "paper_url": "http://arxiv.org/abs/2406.19593v1", "repo": "null"}}