{"2411.02540": {"publish_time": "2024-11-04", "title": "GraphXAIN: Narratives to Explain Graph Neural Networks", "paper_summary": "Graph Neural Networks (GNNs) are a powerful technique for machine learning on\ngraph-structured data, yet they pose interpretability challenges, especially\nfor non-expert users. Existing GNN explanation methods often yield technical\noutputs such as subgraphs and feature importance scores, which are not easily\nunderstood. Building on recent insights from social science and other\nExplainable AI (XAI) methods, we propose GraphXAIN, a natural language\nnarrative that explains individual predictions made by GNNs. We present a\nmodel-agnostic and explainer-agnostic XAI approach that complements graph\nexplainers by generating GraphXAINs, using Large Language Models (LLMs) and\nintegrating graph data, individual predictions from GNNs, explanatory\nsubgraphs, and feature importances. We define XAI Narratives and XAI\nDescriptions, highlighting their distinctions and emphasizing the importance of\nnarrative principles in effective explanations. By incorporating natural\nlanguage narratives, our approach supports graph practitioners and non-expert\nusers, aligning with social science research on explainability and enhancing\nuser understanding and trust in complex GNN models. We demonstrate GraphXAIN's\ncapabilities on a real-world graph dataset, illustrating how its generated\nnarratives can aid understanding compared to traditional graph explainer\noutputs or other descriptive explanation methods.", "paper_summary_zh": "圖形神經網路 (GNN) 是用於圖形結構資料的機器學習強大技術，但它們會造成可解釋性挑戰，特別是對於非專家使用者。現有的 GNN 解釋方法通常會產生技術輸出，例如子圖和特徵重要性分數，這些輸出不容易理解。建構於社會科學和其他可解釋 AI (XAI) 方法的最新見解，我們提出 GraphXAIN，這是一種自然語言敘述，可以解釋 GNN 做出的個別預測。我們提出一個與模型無關且與解釋器無關的 XAI 方法，它透過使用大型語言模型 (LLM) 和整合圖形資料、GNN 的個別預測、說明性子圖和特徵重要性來補充圖形解釋器，進而產生 GraphXAIN。我們定義 XAI 敘述和 XAI 描述，強調它們的區別，並強調敘述原則在有效解釋中的重要性。透過結合自然語言敘述，我們的做法支援圖形從業者和非專家使用者，與可解釋性的社會科學研究保持一致，並增強使用者對複雜 GNN 模型的理解和信任。我們在真實世界圖形資料集上展示 GraphXAIN 的功能，說明與傳統圖形解釋器輸出或其他描述性解釋方法相比，其產生的敘述如何有助於理解。", "author": "Mateusz Cedro et.al.", "authors": "Mateusz Cedro, David Martens", "id": "2411.02540v2", "paper_url": "http://arxiv.org/abs/2411.02540v2", "repo": "https://github.com/ADMAntwerp/GraphXAIN"}}