{"2412.05237": {"publish_time": "2024-12-06", "title": "MAmmoTH-VL: Eliciting Multimodal Reasoning with Instruction Tuning at Scale", "paper_summary": "Open-source multimodal large language models (MLLMs) have shown significant\npotential in a broad range of multimodal tasks. However, their reasoning\ncapabilities remain constrained by existing instruction-tuning datasets, which\nwere predominately repurposed from academic datasets such as VQA, AI2D, and\nChartQA. These datasets target simplistic tasks, and only provide phrase-level\nanswers without any intermediate rationales. To address these challenges, we\nintroduce a scalable and cost-effective method to construct a large-scale\nmultimodal instruction-tuning dataset with rich intermediate rationales\ndesigned to elicit CoT reasoning. Using only open models, we create a dataset\ncontaining 12M instruction-response pairs to cover diverse, reasoning-intensive\ntasks with detailed and faithful rationales. Experiments demonstrate that\ntraining MLLMs on this dataset significantly improves reasoning capabilities,\nachieving state-of-the-art performance on benchmarks such as MathVerse (+8.1%),\nMMMU-Pro (+7%), and MuirBench (+13.3%). Additionally, the model demonstrates\nnotable improvements of up to 4% on non-reasoning-based benchmarks. Ablation\nstudies further highlight the importance of key components, such as rewriting\nand self-filtering, in the dataset construction process.", "paper_summary_zh": "開放原始碼多模態大型語言模型 (MLLM) 已在廣泛的多模態任務中展現顯著潛力。然而，其推理能力仍受限於現有的指令調整資料集，而這些資料集主要改編自學術資料集，例如 VQA、AI2D 和 ChartQA。這些資料集鎖定簡化的任務，而且僅提供片語層級的答案，而沒有任何中間的依據。為了應對這些挑戰，我們引進一種可擴充且具成本效益的方法，以建構一個大型多模態指令調整資料集，其中包含豐富的中間依據，旨在引發 CoT 推理。我們僅使用開放模型，就能建立一個包含 1200 萬個指令回應配對的資料集，涵蓋各種推理密集型任務，並具備詳細且忠實的依據。實驗證明，在這個資料集上訓練 MLLM 能顯著提升推理能力，在 MathVerse (+8.1%)、MMMU-Pro (+7%) 和 MuirBench (+13.3%) 等基準測試中獲得最先進的效能。此外，該模型在非基於推理的基準測試中展現出高達 4% 的顯著進步。消融研究進一步突顯了關鍵組成要素（例如在資料集建構過程中進行改寫和自我過濾）的重要性。", "author": "Jarvis Guo et.al.", "authors": "Jarvis Guo, Tuney Zheng, Yuelin Bai, Bo Li, Yubo Wang, King Zhu, Yizhi Li, Graham Neubig, Wenhu Chen, Xiang Yue", "id": "2412.05237v1", "paper_url": "http://arxiv.org/abs/2412.05237v1", "repo": "null"}}