{"2405.11775": {"publish_time": "2024-05-20", "title": "Exploring Ordinality in Text Classification: A Comparative Study of Explicit and Implicit Techniques", "paper_summary": "Ordinal Classification (OC) is a widely encountered challenge in Natural\nLanguage Processing (NLP), with applications in various domains such as\nsentiment analysis, rating prediction, and more. Previous approaches to tackle\nOC have primarily focused on modifying existing or creating novel loss\nfunctions that \\textbf{explicitly} account for the ordinal nature of labels.\nHowever, with the advent of Pretrained Language Models (PLMs), it became\npossible to tackle ordinality through the \\textbf{implicit} semantics of the\nlabels as well. This paper provides a comprehensive theoretical and empirical\nexamination of both these approaches. Furthermore, we also offer strategic\nrecommendations regarding the most effective approach to adopt based on\nspecific settings.", "paper_summary_zh": "序數分類 (OC) 是自然語言處理 (NLP) 中廣泛遇到的挑戰，在情緒分析、評分預測等各種領域都有應用。處理 OC 的先前方法主要集中在修改現有損失函數或建立新的損失函數，以**明確**考慮標籤的序數性質。然而，隨著預訓練語言模型 (PLM) 的出現，也可以透過標籤的**隱含**語義來處理序數性。本文對這兩種方法提供了全面的理論和實證檢驗。此外，我們還根據特定設定提供了關於採用最有效方法的策略性建議。", "author": "Siva Rajesh Kasa et.al.", "authors": "Siva Rajesh Kasa, Aniket Goel, Karan Gupta, Sumegh Roychowdhury, Anish Bhanushali, Nikhil Pattisapu, Prasanna Srinivasa Murthy", "id": "2405.11775v1", "paper_url": "http://arxiv.org/abs/2405.11775v1", "repo": "null"}}