{"2407.15811": {"publish_time": "2024-07-22", "title": "Stretching Each Dollar: Diffusion Training from Scratch on a Micro-Budget", "paper_summary": "As scaling laws in generative AI push performance, they also simultaneously\nconcentrate the development of these models among actors with large\ncomputational resources. With a focus on text-to-image (T2I) generative models,\nwe aim to address this bottleneck by demonstrating very low-cost training of\nlarge-scale T2I diffusion transformer models. As the computational cost of\ntransformers increases with the number of patches in each image, we propose to\nrandomly mask up to 75% of the image patches during training. We propose a\ndeferred masking strategy that preprocesses all patches using a patch-mixer\nbefore masking, thus significantly reducing the performance degradation with\nmasking, making it superior to model downscaling in reducing computational\ncost. We also incorporate the latest improvements in transformer architecture,\nsuch as the use of mixture-of-experts layers, to improve performance and\nfurther identify the critical benefit of using synthetic images in micro-budget\ntraining. Finally, using only 37M publicly available real and synthetic images,\nwe train a 1.16 billion parameter sparse transformer with only \\$1,890\neconomical cost and achieve a 12.7 FID in zero-shot generation on the COCO\ndataset. Notably, our model achieves competitive FID and high-quality\ngenerations while incurring 118$\\times$ lower cost than stable diffusion models\nand 14$\\times$ lower cost than the current state-of-the-art approach that costs\n\\$28,400. We aim to release our end-to-end training pipeline to further\ndemocratize the training of large-scale diffusion models on micro-budgets.", "paper_summary_zh": "<paragraph>隨著生成式 AI 中的縮放定律提升效能，它們也同時將這些模型的開發集中在擁有龐大運算資源的參與者之間。我們專注於文字轉影像 (T2I) 生成式模型，旨在透過展示大規模 T2I 擴散Transformer模型的極低成本訓練來解決這個瓶頸。由於Transformer的運算成本會隨著每個影像中的貼片數量而增加，我們建議在訓練期間隨機遮蔽最多 75% 的影像貼片。我們提出了一種延遲遮蔽策略，在遮蔽之前使用貼片混合器預處理所有貼片，從而顯著降低遮蔽造成的效能下降，使其在降低運算成本方面優於模型縮放。我們還納入了Transformer架構中的最新改進，例如使用混合專家層，以提升效能並進一步找出在微預算訓練中使用合成影像的重要好處。最後，我們僅使用 3700 萬張公開的真實和合成影像，訓練了一個具有 11.6 億個參數的稀疏Transformer，經濟成本僅為 1,890 美元，並在 COCO 資料集的零次生成中達到了 12.7 FID。值得注意的是，我們的模型達到了有競爭力的 FID 和高品質的生成，同時產生的成本比穩定的擴散模型低 118 倍，比目前最先進且花費 28,400 美元的技術低 14 倍。我們旨在釋出我們的端對端訓練管道，以進一步民主化在微預算上訓練大規模擴散模型。</paragraph>", "author": "Vikash Sehwag et.al.", "authors": "Vikash Sehwag, Xianghao Kong, Jingtao Li, Michael Spranger, Lingjuan Lyu", "id": "2407.15811v1", "paper_url": "http://arxiv.org/abs/2407.15811v1", "repo": "null"}}