{"2409.17027": {"publish_time": "2024-09-25", "title": "Counterfactual Token Generation in Large Language Models", "paper_summary": "\"Sure, I am happy to generate a story for you: Captain Lyra stood at the helm\nof her trusty ship, the Maelstrom's Fury, gazing out at the endless sea. [...]\nLyra's eyes welled up with tears as she realized the bitter truth - she had\nsacrificed everything for fleeting riches, and lost the love of her crew, her\nfamily, and herself.\" Although this story, generated by a large language model,\nis captivating, one may wonder -- how would the story have unfolded if the\nmodel had chosen \"Captain Maeve\" as the protagonist instead? We cannot know.\nState-of-the-art large language models are stateless -- they maintain no\ninternal memory or state. Given a prompt, they generate a sequence of tokens as\nan output using an autoregressive process. As a consequence, they cannot reason\nabout counterfactual alternatives to tokens they have generated in the past. In\nthis work, our goal is to enhance them with this functionality. To this end, we\ndevelop a causal model of token generation that builds upon the Gumbel-Max\nstructural causal model. Our model allows any large language model to perform\ncounterfactual token generation at almost no cost in comparison with vanilla\ntoken generation, it is embarrassingly simple to implement, and it does not\nrequire any fine-tuning nor prompt engineering. We implement our model on Llama\n3 8B-instruct and conduct both qualitative and quantitative analyses of\ncounterfactually generated text. We conclude with a demonstrative application\nof counterfactual token generation for bias detection, unveiling interesting\ninsights about the model of the world constructed by large language models.", "paper_summary_zh": "「當然，我很樂意為您產生一個故事：萊拉船長站在她忠實的船隻，暴風之怒號的舵柄上，凝視著無盡的大海。[...]萊拉的雙眼噙滿淚水，她意識到了一個痛苦的真相——她為了稍縱即逝的財富犧牲了一切，失去了船員、家人和自己的愛。」儘管這個由大型語言模型產生的故事引人入勝，但人們可能會好奇——如果該模型選擇「梅芙船長」作為主角，故事會如何展開？我們不得而知。最先進的大型語言模型是無狀態的——它們不維護任何內部記憶或狀態。給定一個提示，它們會使用自迴歸過程生成一個序列的標記作為輸出。因此，它們無法對過去生成的標記的反事實替代方案進行推理。在這項工作中，我們的目標是增強它們的這項功能。為此，我們開發了一個因果標記生成模型，該模型建立在 Gumbel-Max 結構因果模型之上。我們的模型允許任何大型語言模型以幾乎沒有成本（與香草標記生成相比）執行反事實標記生成，其實現非常簡單，並且不需要任何微調或提示工程。我們在 Llama 3 8B-instruct 上實現了我們的模型，並對反事實生成的文本進行了定性和定量分析。我們以反事實標記生成的一個示範應用來檢測偏差作為結論，揭示了大型語言模型構建的世界模型的有趣見解。", "author": "Ivi Chatzi et.al.", "authors": "Ivi Chatzi, Nina Corvelo Benz, Eleni Straitouri, Stratis Tsirtsis, Manuel Gomez-Rodriguez", "id": "2409.17027v1", "paper_url": "http://arxiv.org/abs/2409.17027v1", "repo": "null"}}