{"2405.12712": {"publish_time": "2024-05-21", "title": "From Human-to-Human to Human-to-Bot Conversations in Software Engineering", "paper_summary": "Software developers use natural language to interact not only with other\nhumans, but increasingly also with chatbots. These interactions have different\nproperties and flow differently based on what goal the developer wants to\nachieve and who they interact with. In this paper, we aim to understand the\ndynamics of conversations that occur during modern software development after\nthe integration of AI and chatbots, enabling a deeper recognition of the\nadvantages and disadvantages of including chatbot interactions in addition to\nhuman conversations in collaborative work. We compile existing conversation\nattributes with humans and NLU-based chatbots and adapt them to the context of\nsoftware development. Then, we extend the comparison to include LLM-powered\nchatbots based on an observational study. We present similarities and\ndifferences between human-to-human and human-to-bot conversations, also\ndistinguishing between NLU- and LLM-based chatbots. Furthermore, we discuss how\nunderstanding the differences among the conversation styles guides the\ndeveloper on how to shape their expectations from a conversation and\nconsequently support the communication within a software team. We conclude that\nthe recent conversation styles that we observe with LLM-chatbots can not\nreplace conversations with humans due to certain attributes regarding social\naspects despite their ability to support productivity and decrease the\ndevelopers' mental load.", "paper_summary_zh": "軟體開發人員不僅使用自然語言與其他人互動，也越來越常與聊天機器人互動。這些互動具有不同的屬性，並且根據開發人員想要達成的目標和他們互動的對象，而有不同的流程。在本文中，我們旨在了解在整合 AI 和聊天機器人後，現代軟體開發中發生的對話動態，進一步了解在協作工作中加入聊天機器人互動的優缺點。我們編譯了與人類和基於 NLU 的聊天機器人的現有對話屬性，並將它們調整到軟體開發的脈絡中。然後，我們根據觀察研究，將比較擴展到包括由 LLM 驅動的聊天機器人。我們呈現人對人與人對機器人對話之間的相似性和差異，也區分基於 NLU 和 LLM 的聊天機器人。此外，我們討論如何了解對話風格之間的差異，引導開發人員如何塑造他們對對話的期望，並因此支援軟體團隊內的溝通。我們得出結論，我們在 LLM 聊天機器人中觀察到的最新對話風格，儘管它們有支援生產力和降低開發人員心理負擔的能力，但由於某些關於社交方面的屬性，無法取代與人類的對話。", "author": "Ranim Khojah et.al.", "authors": "Ranim Khojah, Francisco Gomes de Oliveira Neto, Philipp Leitner", "id": "2405.12712v1", "paper_url": "http://arxiv.org/abs/2405.12712v1", "repo": "null"}}