{"2501.11721": {"publish_time": "2025-01-20", "title": "Explain-Query-Test: Self-Evaluating LLMs Via Explanation and Comprehension Discrepancy", "paper_summary": "Large language models (LLMs) have demonstrated remarkable proficiency in\ngenerating detailed and coherent explanations of complex concepts. However, the\nextent to which these models truly comprehend the concepts they articulate\nremains unclear. To assess the level of comprehension of a model relative to\nthe content it generates, we implemented a self-evaluation pipeline where\nmodels: (i) given a topic generate an excerpt with information about the topic,\n(ii) given an excerpt generate question-answer pairs, and finally (iii) given a\nquestion generate an answer. We refer to this self-evaluation approach as\nExplain-Query-Test (EQT). Interestingly, the accuracy on generated questions\nresulting from running the EQT pipeline correlates strongly with the model\nperformance as verified by typical benchmarks such as MMLU-Pro. In other words,\nEQT's performance is predictive of MMLU-Pro's, and EQT can be used to rank\nmodels without the need for any external source of evaluation data other than\nlists of topics of interest. Moreover, our results reveal a disparity between\nthe models' ability to produce detailed explanations and their performance on\nquestions related to those explanations. This gap highlights fundamental\nlimitations in the internal knowledge representation and reasoning abilities of\ncurrent LLMs. We release the code at https://github.com/asgsaeid/EQT.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出卓越的熟練度，能產生複雜概念的詳細且連貫的解釋。然而，這些模型是否真正理解它們所表達的概念，這一點仍不清楚。為了評估模型相對於它所產生內容的理解程度，我們實作了一個自我評估管道，其中模型：(i) 給定一個主題，產生一段包含關於該主題的資訊的摘錄，(ii) 給定一個摘錄，產生問題-答案對，最後 (iii) 給定一個問題，產生一個答案。我們將這種自我評估方法稱為「解釋-查詢-測試」(EQT)。有趣的是，執行 EQT 管道所產生的問題的準確性與模型效能密切相關，這已由典型的基準（例如 MMLU-Pro）驗證。換句話說，EQT 的效能可以預測 MMLU-Pro 的效能，且 EQT 可用於對模型進行排名，而無需任何外部評估資料來源，只要有感興趣的主題清單即可。此外，我們的結果揭示了模型產生詳細解釋的能力與它們對與這些解釋相關的問題的效能之間的差異。這個差距突顯了當前 LLM 在內部知識表示和推理能力方面的根本限制。我們在 https://github.com/asgsaeid/EQT 釋出程式碼。", "author": "Saeid Asgari Taghanaki et.al.", "authors": "Saeid Asgari Taghanaki, Joao Monteiro", "id": "2501.11721v1", "paper_url": "http://arxiv.org/abs/2501.11721v1", "repo": "https://github.com/asgsaeid/eqt"}}