{"2408.15366": {"publish_time": "2024-08-27", "title": "Pitfalls and Outlooks in Using COMET", "paper_summary": "Since its introduction, the COMET metric has blazed a trail in the machine\ntranslation community, given its strong correlation with human judgements of\ntranslation quality. Its success stems from being a modified pre-trained\nmultilingual model finetuned for quality assessment. However, it being a\nmachine learning model also gives rise to a new set of pitfalls that may not be\nwidely known. We investigate these unexpected behaviours from three aspects: 1)\ntechnical: obsolete software versions and compute precision; 2) data: empty\ncontent, language mismatch, and translationese at test time as well as\ndistribution and domain biases in training; 3) usage and reporting:\nmulti-reference support and model referencing in the literature. All of these\nproblems imply that COMET scores is not comparable between papers or even\ntechnical setups and we put forward our perspective on fixing each issue.\nFurthermore, we release the SacreCOMET package that can generate a signature\nfor the software and model configuration as well as an appropriate citation.\nThe goal of this work is to help the community make more sound use of the COMET\nmetric.", "paper_summary_zh": "自推出以來，COMET 指標在機器翻譯社群中開闢了一條道路，因為它與人類對翻譯品質的判斷有很強的相關性。它的成功源於作為一個修改過的預先訓練多語言模型，經過微調以進行品質評估。然而，它作為一個機器學習模型也產生了一組新的陷阱，可能鮮為人知。我們從三個方面探討這些意外的行為：1) 技術：過時的軟體版本和運算精度；2) 資料：測試時的空內容、語言不匹配和翻譯腔，以及訓練中的分佈和領域偏差；3) 使用和報告：文獻中的多參考支援和模型參考。所有這些問題都意味著 COMET 分數在論文或甚至技術設定之間不可比較，我們提出了我們對解決每個問題的觀點。此外，我們發布了 SacreCOMET 套件，它可以為軟體和模型配置以及適當的引文產生簽章。這項工作的目標是幫助社群更妥善地使用 COMET 指標。", "author": "Vilém Zouhar et.al.", "authors": "Vilém Zouhar, Pinzhen Chen, Tsz Kin Lam, Nikita Moghe, Barry Haddow", "id": "2408.15366v1", "paper_url": "http://arxiv.org/abs/2408.15366v1", "repo": "https://github.com/PinzhenChen/sacreCOMET"}}