{"2411.02310": {"publish_time": "2024-11-04", "title": "MdEval: Massively Multilingual Code Debugging", "paper_summary": "Code large language models (LLMs) have made significant progress in code\ndebugging by directly generating the correct code based on the buggy code\nsnippet. Programming benchmarks, typically consisting of buggy code snippet and\ntheir associated test cases, are used to assess the debugging capabilities of\nLLMs. However, many existing benchmarks primarily focus on Python and are often\nlimited in terms of language diversity (e.g., DebugBench and DebugEval). To\nadvance the field of multilingual debugging with LLMs, we propose the first\nmassively multilingual debugging benchmark, which includes 3.6K test samples of\n18 programming languages and covers the automated program repair (APR) task,\nthe code review (CR) task, and the bug identification (BI) task. Further, we\nintroduce the debugging instruction corpora MDEVAL-INSTRUCT by injecting bugs\ninto the correct multilingual queries and solutions (xDebugGen). Further, a\nmultilingual debugger xDebugCoder trained on MDEVAL-INSTRUCT as a strong\nbaseline specifically to handle the bugs of a wide range of programming\nlanguages (e.g. \"Missing Mut\" in language Rust and \"Misused Macro Definition\"\nin language C). Our extensive experiments on MDEVAL reveal a notable\nperformance gap between open-source models and closed-source LLMs (e.g., GPT\nand Claude series), highlighting huge room for improvement in multilingual code\ndebugging scenarios.", "paper_summary_zh": "大型語言模型 (LLM) 透過直接根據有問題的程式碼片段產生正確的程式碼，在程式碼除錯上取得顯著的進展。程式碼基準，通常包含有問題的程式碼片段及其相關的測試案例，用於評估 LLM 的除錯能力。然而，許多現有的基準主要專注於 Python，且在語言多樣性方面通常受到限制（例如 DebugBench 和 DebugEval）。為了透過 LLM 推動多語言除錯領域，我們提出第一個大規模多語言除錯基準，其中包含 18 種程式語言的 3.6K 個測試範例，涵蓋自動程式修復 (APR) 任務、程式碼檢閱 (CR) 任務和錯誤識別 (BI) 任務。此外，我們透過將錯誤注入正確的多語言查詢和解決方案 (xDebugGen) 中，來導入除錯指令語料庫 MDEVAL-INSTRUCT。此外，一個多語言除錯器 xDebugCoder 訓練於 MDEVAL-INSTRUCT 上，作為一個強大的基準，特別用於處理各種程式語言的錯誤（例如 Rust 語言中的「缺少 Mut」和 C 語言中的「誤用巨集定義」）。我們在 MDEVAL 上進行的廣泛實驗顯示，開源模型和封閉原始碼 LLM（例如 GPT 和 Claude 系列）之間存在顯著的效能差距，突顯出多語言程式碼除錯情境中仍有很大的改進空間。", "author": "Shukai Liu et.al.", "authors": "Shukai Liu, Linzheng Chai, Jian Yang, Jiajun Shi, He Zhu, Liran Wang, Ke Jin, Wei Zhang, Hualei Zhu, Shuyue Guo, Tao Sun, Jiaheng Liu, Yunlong Duan, Yu Hao, Liqun Yang, Guanglin Niu, Ge Zhang, Zhoujun Li", "id": "2411.02310v1", "paper_url": "http://arxiv.org/abs/2411.02310v1", "repo": "null"}}