{"2410.09729": {"publish_time": "2024-10-13", "title": "MIRAGE: Multimodal Identification and Recognition of Annotations in Indian General Prescriptions", "paper_summary": "Hospitals generate thousands of handwritten prescriptions, a practice that\nremains prevalent despite the availability of Electronic Medical Records (EMR).\nThis method of record-keeping hinders the examination of long-term medication\neffects, impedes statistical analysis, and makes the retrieval of records\nchallenging. Handwritten prescriptions pose a unique challenge, requiring\nspecialized data for training models to recognize medications and their\npatterns of recommendation. While current handwriting recognition approaches\ntypically employ 2-D LSTMs, recent studies have explored the use of Large\nLanguage Models (LLMs) for Optical Character Recognition (OCR). Building on\nthis approach, we focus on extracting medication names from medical records.\nOur methodology MIRAGE (Multimodal Identification and Recognition of\nAnnotations in indian GEneral prescriptions) involves fine-tuning the LLaVA 1.6\nand Idefics2 models. Our research utilizes a dataset provided by Medyug\nTechnology, consisting of 743,118 fully annotated high-resolution simulated\nmedical records from 1,133 doctors across India. We demonstrate that our\nmethodology exhibits 82% accuracy in medication name and dosage extraction. We\nprovide a detailed account of our research methodology and results, notes about\nHWR with Multimodal LLMs, and release a small dataset of 100 medical records\nwith labels.", "paper_summary_zh": "醫院會產生數千份手寫處方，儘管有電子病歷 (EMR) 可用，但這種做法仍然很普遍。這種記錄保存方式會阻礙長期藥物效果的檢查，妨礙統計分析，並讓記錄的檢索變得困難。手寫處方構成了一項獨特的挑戰，需要專業的資料來訓練模型以辨識藥物及其推薦模式。雖然目前的辨識手寫字方法通常採用 2-D LSTM，但最近的研究已探討使用大型語言模型 (LLM) 進行光學字元辨識 (OCR)。根據此方法，我們專注於從病歷中擷取藥物名稱。我們的 MIRAGE 方法（印度一般處方中的多模式註解辨識與辨識）涉及微調 LLaVA 1.6 和 Idefics2 模型。我們的研究使用 Medyug Technology 提供的資料集，其中包含來自印度 1,133 位醫生的 743,118 份經過完整註解的高解析度模擬病歷。我們證明我們的技術在藥物名稱和劑量擷取方面展現出 82% 的準確度。我們詳細說明了我們的研究方法和結果，以及有關使用多模式 LLM 的 HWR 的注意事項，並發布了一小部分包含標籤的 100 份病歷資料集。", "author": "Tavish Mankash et.al.", "authors": "Tavish Mankash, V. S. Chaithanya Kota, Anish De, Praveen Prakash, Kshitij Jadhav", "id": "2410.09729v1", "paper_url": "http://arxiv.org/abs/2410.09729v1", "repo": "null"}}