{"2501.13594": {"publish_time": "2025-01-23", "title": "Text-to-SQL based on Large Language Models and Database Keyword Search", "paper_summary": "Text-to-SQL prompt strategies based on Large Language Models (LLMs) achieve\nremarkable performance on well-known benchmarks. However, when applied to\nreal-world databases, their performance is significantly less than for these\nbenchmarks, especially for Natural Language (NL) questions requiring complex\nfilters and joins to be processed. This paper then proposes a strategy to\ncompile NL questions into SQL queries that incorporates a dynamic few-shot\nexamples strategy and leverages the services provided by a database keyword\nsearch (KwS) platform. The paper details how the precision and recall of the\nschema-linking process are improved with the help of the examples provided and\nthe keyword-matching service that the KwS platform offers. Then, it shows how\nthe KwS platform can be used to synthesize a view that captures the joins\nrequired to process an input NL question and thereby simplify the SQL query\ncompilation step. The paper includes experiments with a real-world relational\ndatabase to assess the performance of the proposed strategy. The experiments\nsuggest that the strategy achieves an accuracy on the real-world relational\ndatabase that surpasses state-of-the-art approaches. The paper concludes by\ndiscussing the results obtained.", "paper_summary_zh": "基於大型語言模型 (LLM) 的文字轉 SQL 提示策略在眾所周知的基準上取得顯著的效能。然而，當應用於真實世界的資料庫時，其效能顯著低於這些基準，特別是對於需要處理複雜篩選器和聯結的自然語言 (NL) 問題。本文提出一個策略，將 NL 問題編譯成 SQL 查詢，其中包含動態少次範例策略，並利用資料庫關鍵字搜尋 (KwS) 平台提供的服務。本文詳細說明如何利用提供的範例和 KwS 平台提供的關鍵字比對服務，來改善模式連結過程的精準度和召回率。然後，它展示如何使用 KwS 平台來合成一個檢視，以擷取處理輸入 NL 問題所需的聯結，從而簡化 SQL 查詢編譯步驟。本文包含使用真實世界關係資料庫的實驗，以評估所提出策略的效能。實驗表明，該策略在真實世界關係資料庫上達到的準確度超越了最先進的方法。本文最後討論所獲得的結果。", "author": "Eduardo R. Nascimento et.al.", "authors": "Eduardo R. Nascimento, Caio Viktor S. Avila, Yenier T. Izquierdo, Grettel M. García, Lucas Feijó L. Andrade, Michelle S. P. Facina, Melissa Lemos, Marco A. Casanova", "id": "2501.13594v1", "paper_url": "http://arxiv.org/abs/2501.13594v1", "repo": "null"}}