{"2408.08027": {"publish_time": "2024-08-15", "title": "Enhancing Large Language Model-based Speech Recognition by Contextualization for Rare and Ambiguous Words", "paper_summary": "We develop a large language model (LLM) based automatic speech recognition\n(ASR) system that can be contextualized by providing keywords as prior\ninformation in text prompts. We adopt decoder-only architecture and use our\nin-house LLM, PLaMo-100B, pre-trained from scratch using datasets dominated by\nJapanese and English texts as the decoder. We adopt a pre-trained Whisper\nencoder as an audio encoder, and the audio embeddings from the audio encoder\nare projected to the text embedding space by an adapter layer and concatenated\nwith text embeddings converted from text prompts to form inputs to the decoder.\nBy providing keywords as prior information in the text prompts, we can\ncontextualize our LLM-based ASR system without modifying the model architecture\nto transcribe ambiguous words in the input audio accurately. Experimental\nresults demonstrate that providing keywords to the decoder can significantly\nimprove the recognition performance of rare and ambiguous words.", "paper_summary_zh": "我們開發一個大型語言模型 (LLM) 為基礎的自動語音辨識 (ASR) 系統，可以透過提供關鍵字作為文字提示中的先驗資訊來進行情境化。我們採用僅解碼器架構，並使用我們內部的 LLM，PLaMo-100B，使用由日文和英文文本主導的資料集從頭開始預先訓練作為解碼器。我們採用預先訓練的 Whisper 編碼器作為音訊編碼器，而來自音訊編碼器的音訊嵌入會透過適配器層投影到文字嵌入空間，並與從文字提示轉換而來的文字嵌入串聯以形成解碼器的輸入。透過在文字提示中提供關鍵字作為先驗資訊，我們可以對我們的 LLM 為基礎的 ASR 系統進行情境化，而無需修改模型架構，以準確轉錄輸入音訊中的含糊字詞。實驗結果證明，提供關鍵字給解碼器可以顯著提升罕見和含糊字詞的辨識效能。", "author": "Kento Nozawa et.al.", "authors": "Kento Nozawa, Takashi Masuko, Toru Taniguchi", "id": "2408.08027v1", "paper_url": "http://arxiv.org/abs/2408.08027v1", "repo": "null"}}