{"2405.04650": {"publish_time": "2024-05-07", "title": "A Self-Supervised Method for Body Part Segmentation and Keypoint Detection of Rat Images", "paper_summary": "Recognition of individual components and keypoint detection supported by\ninstance segmentation is crucial to analyze the behavior of agents on the\nscene. Such systems could be used for surveillance, self-driving cars, and also\nfor medical research, where behavior analysis of laboratory animals is used to\nconfirm the aftereffects of a given medicine. A method capable of solving the\naforementioned tasks usually requires a large amount of high-quality\nhand-annotated data, which takes time and money to produce. In this paper, we\npropose a method that alleviates the need for manual labeling of laboratory\nrats. To do so, first, we generate initial annotations with a computer\nvision-based approach, then through extensive augmentation, we train a deep\nneural network on the generated data. The final system is capable of instance\nsegmentation, keypoint detection, and body part segmentation even when the\nobjects are heavily occluded.", "paper_summary_zh": "辨識個別組成成分和關鍵點偵測，由個體分割所支援，對於分析場景中代理的行為至關重要。此類系統可用於監督、自駕車，以及醫學研究，其中實驗動物的行為分析用於確認特定藥物的後遺症。一種能夠解決上述任務的方法通常需要大量的優質手動標註資料，而這需要花費時間和金錢來製作。在本文中，我們提出了一種方法，可以減輕對實驗鼠手動標註的需求。為此，我們首先使用基於電腦視覺的方法產生初始標註，然後透過廣泛的擴充，我們在產生的資料上訓練一個深度神經網路。最終系統能夠進行個體分割、關鍵點偵測和身體部位分割，即使物件被嚴重遮擋。", "author": "László Kopácsi et.al.", "authors": "László Kopácsi, Áron Fóthi, András Lőrincz", "id": "2405.04650v1", "paper_url": "http://arxiv.org/abs/2405.04650v1", "repo": "null"}}