{"2405.09056": {"publish_time": "2024-05-15", "title": "CTS: A Consistency-Based Medical Image Segmentation Model", "paper_summary": "In medical image segmentation tasks, diffusion models have shown significant\npotential. However, mainstream diffusion models suffer from drawbacks such as\nmultiple sampling times and slow prediction results. Recently, consistency\nmodels, as a standalone generative network, have resolved this issue. Compared\nto diffusion models, consistency models can reduce the sampling times to once,\nnot only achieving similar generative effects but also significantly speeding\nup training and prediction. However, they are not suitable for image\nsegmentation tasks, and their application in the medical imaging field has not\nyet been explored. Therefore, this paper applies the consistency model to\nmedical image segmentation tasks, designing multi-scale feature signal\nsupervision modes and loss function guidance to achieve model convergence.\nExperiments have verified that the CTS model can obtain better medical image\nsegmentation results with a single sampling during the test phase.", "paper_summary_zh": "在医学影像分割任务中，扩散模型显示出显著的潜力。然而，主流扩散模型存在采样时间多、预测结果慢的缺点。最近，一致性模型作为一种独立的生成网络，解决了这个问题。与扩散模型相比，一致性模型可以将采样次数减少到一次，不仅实现了相似的生成效果，而且极大地加快了训练和预测速度。但是，它们不适用于图像分割任务，并且尚未探索它们在医学影像领域的应用。因此，本文将一致性模型应用于医学影像分割任务，设计多尺度特征信号监督模式和损失函数指导，以实现模型收敛。实验验证了CTS模型在测试阶段通过单次采样就能获得更好的医学影像分割结果。", "author": "Kejia Zhang et.al.", "authors": "Kejia Zhang, Lan Zhang, Haiwei Pan, Baolong Yu", "id": "2405.09056v1", "paper_url": "http://arxiv.org/abs/2405.09056v1", "repo": "null"}}