{"2411.15999": {"publish_time": "2024-11-24", "title": "Multi-ToM: Evaluating Multilingual Theory of Mind Capabilities in Large Language Models", "paper_summary": "Theory of Mind (ToM) refers to the cognitive ability to infer and attribute\nmental states to oneself and others. As large language models (LLMs) are\nincreasingly evaluated for social and cognitive capabilities, it remains\nunclear to what extent these models demonstrate ToM across diverse languages\nand cultural contexts. In this paper, we introduce a comprehensive study of\nmultilingual ToM capabilities aimed at addressing this gap. Our approach\nincludes two key components: (1) We translate existing ToM datasets into\nmultiple languages, effectively creating a multilingual ToM dataset and (2) We\nenrich these translations with culturally specific elements to reflect the\nsocial and cognitive scenarios relevant to diverse populations. We conduct\nextensive evaluations of six state-of-the-art LLMs to measure their ToM\nperformance across both the translated and culturally adapted datasets. The\nresults highlight the influence of linguistic and cultural diversity on the\nmodels' ability to exhibit ToM, and questions their social reasoning\ncapabilities. This work lays the groundwork for future research into enhancing\nLLMs' cross-cultural social cognition and contributes to the development of\nmore culturally aware and socially intelligent AI systems. All our data and\ncode are publicly available.", "paper_summary_zh": "心智理論 (ToM) 指的是推論和歸因心智狀態給自己和別人的認知能力。隨著大型語言模型 (LLM) 逐漸被評估其社交和認知能力，這些模型在不同語言和文化背景中展現 ToM 的程度仍不明確。在本文中，我們介紹了一項針對多語言 ToM 能力的全面研究，旨在解決這個問題。我們的做法包含兩個關鍵組成部分：(1) 我們將現有的 ToM 資料集翻譯成多種語言，有效地建立了一個多語言 ToM 資料集，(2) 我們用文化特定元素豐富這些翻譯，以反映與不同族群相關的社會和認知情境。我們對六個最先進的 LLM 進行廣泛的評估，以衡量它們在翻譯和文化改編資料集中的 ToM 表現。結果突顯了語言和文化多樣性對模型展現 ToM 能力的影響，並質疑它們的社會推理能力。這項工作為未來增強 LLM 的跨文化社會認知的研究奠定了基礎，並有助於開發更具文化意識和社會智慧的 AI 系統。我們的資料和程式碼皆公開提供。", "author": "Jayanta Sadhu et.al.", "authors": "Jayanta Sadhu, Ayan Antik Khan, Noshin Nawal, Sanju Basak, Abhik Bhattacharjee, Rifat Shahriyar", "id": "2411.15999v1", "paper_url": "http://arxiv.org/abs/2411.15999v1", "repo": "null"}}