{"2501.17654": {"publish_time": "2025-01-29", "title": "Exploring Vision Language Models for Multimodal and Multilingual Stance Detection", "paper_summary": "Social media's global reach amplifies the spread of information, highlighting\nthe need for robust Natural Language Processing tasks like stance detection\nacross languages and modalities. Prior research predominantly focuses on\ntext-only inputs, leaving multimodal scenarios, such as those involving both\nimages and text, relatively underexplored. Meanwhile, the prevalence of\nmultimodal posts has increased significantly in recent years. Although\nstate-of-the-art Vision-Language Models (VLMs) show promise, their performance\non multimodal and multilingual stance detection tasks remains largely\nunexamined. This paper evaluates state-of-the-art VLMs on a newly extended\ndataset covering seven languages and multimodal inputs, investigating their use\nof visual cues, language-specific performance, and cross-modality interactions.\nOur results show that VLMs generally rely more on text than images for stance\ndetection and this trend persists across languages. Additionally, VLMs rely\nsignificantly more on text contained within the images than other visual\ncontent. Regarding multilinguality, the models studied tend to generate\nconsistent predictions across languages whether they are explicitly\nmultilingual or not, although there are outliers that are incongruous with\nmacro F1, language support, and model size.", "paper_summary_zh": "社群媒體的全球影響力擴大了資訊的傳播，突顯了對健全自然語言處理任務的需求，例如跨語言和模態的立場偵測。先前的研究主要集中在純文字輸入上，而將涉及影像和文字的多模態場景留作相對未經探索的領域。同時，近年來多模態貼文的盛行已大幅增加。儘管最先進的視覺語言模型 (VLM) 顯示出前景，但它們在多模態和多語言立場偵測任務中的表現仍未經過廣泛檢驗。本文評估了最先進的 VLM，採用一個新擴充的資料集，涵蓋七種語言和多模態輸入，探討它們對視覺線索的使用、特定語言的表現以及跨模態互動。我們的結果顯示，VLM 一般更依賴文字而非影像進行立場偵測，而且這種趨勢在各語言間持續存在。此外，VLM 更顯著地依賴影像中包含的文字，而非其他視覺內容。關於多語言性，所研究的模型傾向於在各語言間產生一致的預測，無論它們是否明確地支援多語言，儘管有一些異常值與巨觀 F1、語言支援和模型大小不一致。", "author": "Jake Vasilakes et.al.", "authors": "Jake Vasilakes, Carolina Scarton, Zhixue Zhao", "id": "2501.17654v1", "paper_url": "http://arxiv.org/abs/2501.17654v1", "repo": "null"}}