{"2410.19301": {"publish_time": "2024-10-25", "title": "Any Other Thoughts, Hedgehog? Linking Deliberation Chains in Collaborative Dialogues", "paper_summary": "Question-asking in collaborative dialogue has long been established as key to\nknowledge construction, both in internal and collaborative problem solving. In\nthis work, we examine probing questions in collaborative dialogues: questions\nthat explicitly elicit responses from the speaker's interlocutors.\nSpecifically, we focus on modeling the causal relations that lead directly from\nutterances earlier in the dialogue to the emergence of the probing question. We\nmodel these relations using a novel graph-based framework of deliberation\nchains, and reframe the problem of constructing such chains as a\ncoreference-style clustering problem. Our framework jointly models probing and\ncausal utterances and the links between them, and we evaluate on two\nchallenging collaborative task datasets: the Weights Task and DeliData. Our\nresults demonstrate the effectiveness of our theoretically-grounded approach\ncompared to both baselines and stronger coreference approaches, and establish a\nstandard of performance in this novel task.", "paper_summary_zh": "在合作对话中提问早已被确立为建构知识的关键，无论是在内部还是在合作解决问题中。在这项工作中，我们研究了合作对话中的探测问题：明确引发说话者对话者的反应的问题。具体来说，我们专注于对导致对话中早期话语直接产生探测问题的因果关系进行建模。我们使用一种新颖的基于图表的审议链框架对这些关系进行建模，并将构建此类链的问题重新表述为一个指代风格的聚类问题。我们的框架共同对探测和因果话语以及它们之间的联系进行建模，并且我们在两个具有挑战性的协作任务数据集上进行评估：权重任务和 DeliData。我们的结果证明了我们基于理论的方法与基线和更强的共指方法相比的有效性，并在这一新任务中建立了绩效标准。", "author": "Abhijnan Nath et.al.", "authors": "Abhijnan Nath, Videep Venkatesha, Mariah Bradford, Avyakta Chelle, Austin Youngren, Carlos Mabrey, Nathaniel Blanchard, Nikhil Krishnaswamy", "id": "2410.19301v1", "paper_url": "http://arxiv.org/abs/2410.19301v1", "repo": "null"}}