{"2408.13214": {"publish_time": "2024-08-23", "title": "EUR-USD Exchange Rate Forecasting Based on Information Fusion with Large Language Models and Deep Learning Methods", "paper_summary": "Accurate forecasting of the EUR/USD exchange rate is crucial for investors,\nbusinesses, and policymakers. This paper proposes a novel framework, IUS, that\nintegrates unstructured textual data from news and analysis with structured\ndata on exchange rates and financial indicators to enhance exchange rate\nprediction. The IUS framework employs large language models for sentiment\npolarity scoring and exchange rate movement classification of texts. These\ntextual features are combined with quantitative features and input into a\nCausality-Driven Feature Generator. An Optuna-optimized Bi-LSTM model is then\nused to forecast the EUR/USD exchange rate. Experiments demonstrate that the\nproposed method outperforms benchmark models, reducing MAE by 10.69% and RMSE\nby 9.56% compared to the best performing baseline. Results also show the\nbenefits of data fusion, with the combination of unstructured and structured\ndata yielding higher accuracy than structured data alone. Furthermore, feature\nselection using the top 12 important quantitative features combined with the\ntextual features proves most effective. The proposed IUS framework and\nOptuna-Bi-LSTM model provide a powerful new approach for exchange rate\nforecasting through multi-source data integration.", "paper_summary_zh": "歐元/美元匯率的準確預測對投資者、企業和政策制定者至關重要。本文提出了一個新框架 IUS，它將來自新聞和分析的非結構化文本數據與匯率和財務指標的結構化數據整合在一起，以增強匯率預測。IUS 框架採用大型語言模型進行情緒極性評分和文本的匯率變動分類。這些文本特徵與定量特徵相結合，並輸入因果特徵生成器。然後使用 Optuna 優化的雙向 LSTM 模型來預測歐元/美元匯率。實驗表明，所提出的方法優於基準模型，與性能最佳的基線相比，MAE 降低了 10.69%，RMSE 降低了 9.56%。結果還表明了數據融合的好處，非結構化數據和結構化數據的組合比僅使用結構化數據產生更高的準確度。此外，使用最重要的 12 個定量特徵與文本特徵相結合的特徵選擇被證明是最有效的。所提出的 IUS 框架和 Optuna-Bi-LSTM 模型通過多源數據集成提供了一種強大的匯率預測新方法。", "author": "Hongcheng Ding et.al.", "authors": "Hongcheng Ding, Xuanze Zhao, Zixiao Jiang, Shamsul Nahar Abdullah, Deshinta Arrova Dewi", "id": "2408.13214v1", "paper_url": "http://arxiv.org/abs/2408.13214v1", "repo": "null"}}