{"2408.11691": {"publish_time": "2024-08-21", "title": "Physics-informed Discovery of State Variables in Second-Order and Hamiltonian Systems", "paper_summary": "The modeling of dynamical systems is a pervasive concern for not only\ndescribing but also predicting and controlling natural phenomena and engineered\nsystems. Current data-driven approaches often assume prior knowledge of the\nrelevant state variables or result in overparameterized state spaces. Boyuan\nChen and his co-authors proposed a neural network model that estimates the\ndegrees of freedom and attempts to discover the state variables of a dynamical\nsystem. Despite its innovative approach, this baseline model lacks a connection\nto the physical principles governing the systems it analyzes, leading to\nunreliable state variables.\n  This research proposes a method that leverages the physical characteristics\nof second-order Hamiltonian systems to constrain the baseline model. The\nproposed model outperforms the baseline model in identifying a minimal set of\nnon-redundant and interpretable state variables.", "paper_summary_zh": "動態系統的建模不僅是描述，也是預測和控制自然現象和工程系統的普遍關注。目前的資料驅動方法通常假設先前已知相關狀態變數或導致過度參數化的狀態空間。Boyuan Chen 和他的共同作者提出了一個神經網路模型，用以估計自由度並嘗試找出動態系統的狀態變數。儘管採用創新的方法，但這個基準模型缺乏與其分析系統所遵循的物理原理的連結，導致無法信賴狀態變數。\n本研究提出了一種方法，利用二階哈密頓系統的物理特性來約束基準模型。所提出的模型在找出最簡的一組非冗餘且可解釋的狀態變數方面，表現優於基準模型。", "author": "Félix Chavelli et.al.", "authors": "Félix Chavelli, Zi-Yu Khoo, Dawen Wu, Jonathan Sze Choong Low, Stéphane Bressan", "id": "2408.11691v1", "paper_url": "http://arxiv.org/abs/2408.11691v1", "repo": "null"}}