{"2412.15524": {"publish_time": "2024-12-20", "title": "HREF: Human Response-Guided Evaluation of Instruction Following in Language Models", "paper_summary": "Evaluating the capability of Large Language Models (LLMs) in following\ninstructions has heavily relied on a powerful LLM as the judge, introducing\nunresolved biases that deviate the judgments from human judges. In this work,\nwe reevaluate various choices for automatic evaluation on a wide range of\ninstruction-following tasks. We experiment with methods that leverage\nhuman-written responses and observe that they enhance the reliability of\nautomatic evaluations across a wide range of tasks, resulting in up to a 3.2%\nimprovement in agreement with human judges. We also discovered that\nhuman-written responses offer an orthogonal perspective to model-generated\nresponses in following instructions and should be used as an additional context\nwhen comparing model responses. Based on these observations, we develop a new\nevaluation benchmark, Human Response-Guided Evaluation of Instruction Following\n(HREF), comprising 4,258 samples across 11 task categories with a composite\nevaluation setup, employing a composite evaluation setup that selects the most\nreliable method for each category. In addition to providing reliable\nevaluation, HREF emphasizes individual task performance and is free from\ncontamination. Finally, we study the impact of key design choices in HREF,\nincluding the size of the evaluation set, the judge model, the baseline model,\nand the prompt template. We host a live leaderboard that evaluates LLMs on the\nprivate evaluation set of HREF.", "paper_summary_zh": "評估大型語言模型 (LLM) 在遵循說明方面的能力，一直高度依賴強大的 LLM 作為評審，引入了未解決的偏見，使判斷與人類評審產生偏差。在這項工作中，我們重新評估各種自動評估的選擇，針對廣泛的說明遵循任務進行評估。我們實驗利用人類撰寫的回應的方法，並觀察到它們提升了各種任務的自動評估的可靠性，與人類評審的吻合度提高了 3.2%。我們還發現，人類撰寫的回應提供了與模型產生的回應在遵循說明方面的正交觀點，在比較模型回應時應將其用作額外的背景。根據這些觀察，我們開發了一個新的評估基準，即人類回應引導的說明遵循評估 (HREF)，包含 11 個任務類別的 4,258 個範例，採用複合評估設定，為每個類別選出最可靠的方法。除了提供可靠的評估外，HREF 還強調了個別任務的表現，且不受汙染。最後，我們研究了 HREF 中關鍵設計選擇的影響，包括評估集的大小、評審模型、基準模型和提示範本。我們建立了一個動態排行榜，在 HREF 的私有評估集中評估 LLM。", "author": "Xinxi Lyu et.al.", "authors": "Xinxi Lyu, Yizhong Wang, Hannaneh Hajishirzi, Pradeep Dasigi", "id": "2412.15524v1", "paper_url": "http://arxiv.org/abs/2412.15524v1", "repo": "null"}}