{"2405.10589": {"publish_time": "2024-05-17", "title": "Improving Point-based Crowd Counting and Localization Based on Auxiliary Point Guidance", "paper_summary": "Crowd counting and localization have become increasingly important in\ncomputer vision due to their wide-ranging applications. While point-based\nstrategies have been widely used in crowd counting methods, they face a\nsignificant challenge, i.e., the lack of an effective learning strategy to\nguide the matching process. This deficiency leads to instability in matching\npoint proposals to target points, adversely affecting overall performance. To\naddress this issue, we introduce an effective approach to stabilize the\nproposal-target matching in point-based methods. We propose Auxiliary Point\nGuidance (APG) to provide clear and effective guidance for proposal selection\nand optimization, addressing the core issue of matching uncertainty.\nAdditionally, we develop Implicit Feature Interpolation (IFI) to enable\nadaptive feature extraction in diverse crowd scenarios, further enhancing the\nmodel's robustness and accuracy. Extensive experiments demonstrate the\neffectiveness of our approach, showing significant improvements in crowd\ncounting and localization performance, particularly under challenging\nconditions. The source codes and trained models will be made publicly\navailable.", "paper_summary_zh": "群眾計算和定位由於其廣泛的應用，在電腦視覺中變得越來越重要。雖然基於點的策略已廣泛用於群眾計算方法中，但它們面臨著一個重大的挑戰，即缺乏一個有效的學習策略來指導匹配過程。這種缺陷導致了匹配點建議與目標點的不穩定性，對整體效能產生了不利影響。為了解決這個問題，我們引入了一種有效的方法來穩定基於點的方法中的建議目標匹配。我們提出了輔助點指導 (APG) 來為建議選擇和最佳化提供清晰且有效的指導，解決了匹配不確定性的核心問題。此外，我們開發了隱式特徵插值 (IFI) 以在不同的群眾場景中實現自適應特徵提取，進一步增強了模型的穩健性和準確性。大量的實驗證明了我們方法的有效性，顯示出在群眾計算和定位效能方面有顯著的改進，特別是在具有挑戰性的條件下。原始碼和訓練好的模型將公開提供。", "author": "I-Hsiang Chen et.al.", "authors": "I-Hsiang Chen, Wei-Ting Chen, Yu-Wei Liu, Ming-Hsuan Yang, Sy-Yen Kuo", "id": "2405.10589v1", "paper_url": "http://arxiv.org/abs/2405.10589v1", "repo": "null"}}