{"2406.04230": {"publish_time": "2024-06-06", "title": "M3LEO: A Multi-Modal, Multi-Label Earth Observation Dataset Integrating Interferometric SAR and RGB Data", "paper_summary": "Satellite-based remote sensing has revolutionised the way we address global\nchallenges in a rapidly evolving world. Huge quantities of Earth Observation\n(EO) data are generated by satellite sensors daily, but processing these large\ndatasets for use in ML pipelines is technically and computationally\nchallenging. Specifically, different types of EO data are often hosted on a\nvariety of platforms, with differing availability for Python preprocessing\ntools. In addition, spatial alignment across data sources and data tiling can\npresent significant technical hurdles for novice users. While some preprocessed\nEO datasets exist, their content is often limited to optical or near-optical\nwavelength data, which is ineffective at night or in adverse weather\nconditions. Synthetic Aperture Radar (SAR), an active sensing technique based\non microwave length radiation, offers a viable alternative. However, the\napplication of machine learning to SAR has been limited due to a lack of\nML-ready data and pipelines, particularly for the full diversity of SAR data,\nincluding polarimetry, coherence and interferometry. We introduce M3LEO, a\nmulti-modal, multi-label EO dataset that includes polarimetric,\ninterferometric, and coherence SAR data derived from Sentinel-1, alongside\nSentinel-2 RGB imagery and a suite of labelled tasks for model evaluation.\nM3LEO spans 17.5TB and contains approximately 10M data chips across six\ngeographic regions. The dataset is complemented by a flexible PyTorch Lightning\nframework, with configuration management using Hydra. We provide tools to\nprocess any dataset available on popular platforms such as Google Earth Engine\nfor integration with our framework. Initial experiments validate the utility of\nour data and framework, showing that SAR imagery contains information\nadditional to that extractable from RGB data. Data at huggingface.co/M3LEO, and\ncode at github.com/spaceml-org/M3LEO.", "paper_summary_zh": "<paragraph>基於衛星的遙測技術徹底改變了我們在快速變遷的世界中應對全球挑戰的方式。衛星感測器每天產生大量的地球觀測 (EO) 資料，但處理這些大型資料集以用於 ML 管線在技術和計算上都具有挑戰性。具體來說，不同類型的 EO 資料通常會儲存在各種平台上，且 Python 預處理工具的可用性不同。此外，資料來源和資料切片的空間對齊可能會對新手使用者造成重大的技術障礙。雖然存在一些預處理過的 EO 資料集，但其內容通常僅限於光學或近光學波長資料，這在夜間或惡劣的天氣條件下是無效的。合成孔徑雷達 (SAR) 是一種基於微波長輻射的主動感測技術，提供了一個可行的替代方案。然而，由於缺乏 ML 就緒的資料和管線，機器學習在 SAR 中的應用受到限制，特別是對於 SAR 資料的全部多樣性，包括極化測量、相干性和干涉測量。我們引入了 M3LEO，這是一個多模態、多標籤 EO 資料集，其中包括從 Sentinel-1 衍生的極化測量、干涉測量和相干性 SAR 資料，以及 Sentinel-2 RGB 影像和一套用於模型評估的標籤任務。M3LEO 跨越 17.5TB，並包含六個地理區域中約 1000 萬個資料晶片。該資料集由一個靈活的 PyTorch Lightning 框架補充，並使用 Hydra 進行配置管理。我們提供工具來處理任何可在熱門平台（例如 Google Earth Engine）上獲得的資料集，以與我們的框架整合。初步實驗驗證了我們的資料和框架的效用，表明 SAR 影像包含了從 RGB 資料中提取的額外資訊。資料位於 huggingface.co/M3LEO，程式碼位於 github.com/spaceml-org/M3LEO。</paragraph>", "author": "Matthew J Allen et.al.", "authors": "Matthew J Allen, Francisco Dorr, Joseph Alejandro Gallego Mejia, Laura Martínez-Ferrer, Anna Jungbluth, Freddie Kalaitzis, Raúl Ramos-Pollán", "id": "2406.04230v1", "paper_url": "http://arxiv.org/abs/2406.04230v1", "repo": "https://github.com/spaceml-org/m3leo"}}