{"2405.04050": {"publish_time": "2024-05-07", "title": "Learning Linear Block Error Correction Codes", "paper_summary": "Error correction codes are a crucial part of the physical communication\nlayer, ensuring the reliable transfer of data over noisy channels. The design\nof optimal linear block codes capable of being efficiently decoded is of major\nconcern, especially for short block lengths. While neural decoders have\nrecently demonstrated their advantage over classical decoding techniques, the\nneural design of the codes remains a challenge. In this work, we propose for\nthe first time a unified encoder-decoder training of binary linear block codes.\nTo this end, we adapt the coding setting to support efficient and\ndifferentiable training of the code for end-to-end optimization over the order\ntwo Galois field. We also propose a novel Transformer model in which the\nself-attention masking is performed in a differentiable fashion for the\nefficient backpropagation of the code gradient. Our results show that (i) the\nproposed decoder outperforms existing neural decoding on conventional codes,\n(ii) the suggested framework generates codes that outperform the {analogous}\nconventional codes, and (iii) the codes we developed not only excel with our\ndecoder but also show enhanced performance with traditional decoding\ntechniques.", "paper_summary_zh": "錯誤修正碼是物理通訊層中至關重要的一部分，確保資料在雜訊通道中可靠傳輸。設計出能夠被有效解碼的最佳線性區塊碼是一項主要關注點，特別是對於短區塊長度而言。雖然神經解碼器最近證明了它們相較於傳統解碼技術的優勢，但神經碼設計仍然是一個挑戰。在這項工作中，我們首次提出二進制線性區塊碼的統一編碼器-解碼器訓練。為此，我們調整編碼設定以支援對應於二元伽羅瓦域的端對端最佳化的有效且可微分的碼訓練。我們還提出了一個新穎的 Transformer 模型，其中自注意力遮罩以可微分的方式執行，以進行碼梯度的有效反向傳播。我們的結果表明 (i) 提出的解碼器優於現有神經解碼在傳統碼上的表現，(ii) 建議的框架生成的碼優於{類比}傳統碼，以及 (iii) 我們開發的碼不僅在我們的解碼器中表現出色，而且在傳統解碼技術中也表現出增強的效能。", "author": "Yoni Choukroun et.al.", "authors": "Yoni Choukroun, Lior Wolf", "id": "2405.04050v1", "paper_url": "http://arxiv.org/abs/2405.04050v1", "repo": "https://github.com/yonilc/e2e_dc_ecct"}}