{"2406.12746": {"publish_time": "2024-06-18", "title": "Rationale-based Ensemble of Multiple QA Strategies for Zero-shot Knowledge-based VQA", "paper_summary": "Knowledge-based Visual Qustion-answering (K-VQA) necessitates the use of\nbackground knowledge beyond what is depicted in the image. Current zero-shot\nK-VQA methods usually translate an image to a single type of textual decision\ncontext and use a text-based model to answer the question based on it, which\nconflicts with the fact that K-VQA questions often require the combination of\nmultiple question-answering strategies. In light of this, we propose\nRationale-based Ensemble of Answer Context Tactics (REACT) to achieve a dynamic\nensemble of multiple question-answering tactics, comprising Answer Candidate\nGeneration (ACG) and Rationale-based Strategy Fusion (RSF). In ACG, we generate\nthree distinctive decision contexts to provide different strategies for each\nquestion, resulting in the generation of three answer candidates. RSF generates\nautomatic and mechanistic rationales from decision contexts for each candidate,\nallowing the model to select the correct answer from all candidates. We conduct\ncomprehensive experiments on the OK-VQA and A-OKVQA datasets, and our method\nsignificantly outperforms state-of-the-art LLM-based baselines on all datasets.", "paper_summary_zh": "基於知識的視覺問答（K-VQA）需要使用背景知識，而這些知識並非圖像中所描繪的。目前的零次學習 K-VQA 方法通常會將圖像轉換成單一類型的文字決策脈絡，並使用基於文字的模型根據該脈絡回答問題，這與 K-VQA 問題通常需要結合多種問答策略的事實相衝突。有鑑於此，我們提出了基於推理的答案脈絡策略組合（REACT），以實現多種問答策略的動態組合，包括答案候選產生（ACG）和基於推理的策略融合（RSF）。在 ACG 中，我們產生三個不同的決策脈絡，為每個問題提供不同的策略，從而產生三個答案候選。RSF 為每個候選從決策脈絡中產生自動且機械的推理，讓模型能夠從所有候選中選擇正確答案。我們對 OK-VQA 和 A-OKVQA 資料集進行了全面的實驗，我們的模型在所有資料集上都顯著優於最先進的基於 LLM 的基準。", "author": "Miaoyu Li et.al.", "authors": "Miaoyu Li, Haoxin Li, Zilin Du, Boyang Li", "id": "2406.12746v1", "paper_url": "http://arxiv.org/abs/2406.12746v1", "repo": "null"}}