{"2405.03845": {"publish_time": "2024-05-06", "title": "Self-Improving Customer Review Response Generation Based on LLMs", "paper_summary": "Previous studies have demonstrated that proactive interaction with user\nreviews has a positive impact on the perception of app users and encourages\nthem to submit revised ratings. Nevertheless, developers encounter challenges\nin managing a high volume of reviews, particularly in the case of popular apps\nwith a substantial influx of daily reviews. Consequently, there is a demand for\nautomated solutions aimed at streamlining the process of responding to user\nreviews. To address this, we have developed a new system for generating\nautomatic responses by leveraging user-contributed documents with the help of\nretrieval-augmented generation (RAG) and advanced Large Language Models (LLMs).\nOur solution, named SCRABLE, represents an adaptive customer review response\nautomation that enhances itself with self-optimizing prompts and a judging\nmechanism based on LLMs. Additionally, we introduce an automatic scoring\nmechanism that mimics the role of a human evaluator to assess the quality of\nresponses generated in customer review domains. Extensive experiments and\nanalyses conducted on real-world datasets reveal that our method is effective\nin producing high-quality responses, yielding improvement of more than 8.5%\ncompared to the baseline. Further validation through manual examination of the\ngenerated responses underscores the efficacy our proposed system.", "paper_summary_zh": "先前的研究已證明，主動與使用者評論互動對應用程式使用者的認知有正面的影響，且鼓勵他們提交已修改的評分。儘管如此，開發人員在管理大量的評論時會遇到挑戰，特別是在每天湧入大量評論的熱門應用程式中。因此，需要自動化的解決方案來簡化回應使用者評論的流程。為了解決這個問題，我們開發了一個新的系統，利用使用者貢獻的文件，在檢索擴充生成 (RAG) 和進階大型語言模型 (LLM) 的幫助下，產生自動化的回應。我們的解決方案，名為 SCRABLE，代表一種適應式客戶評論回應自動化，它會透過自我最佳化提示和基於 LLM 的判斷機制來提升自己。此外，我們引入了一種自動評分機制，模擬人類評估者的角色，以評估在客戶評論領域中產生的回應品質。在真實世界資料集上進行的廣泛實驗和分析顯示，我們的做法在產生高品質的回應上是有效的，與基準相比，改進幅度超過 8.5%。進一步透過手動檢查產生的回應來驗證，突顯了我們提出的系統的功效。", "author": "Guy Azov et.al.", "authors": "Guy Azov, Tatiana Pelc, Adi Fledel Alon, Gila Kamhi", "id": "2405.03845v1", "paper_url": "http://arxiv.org/abs/2405.03845v1", "repo": "null"}}