{"2409.11055": {"publish_time": "2024-09-17", "title": "A Comprehensive Evaluation of Quantized Instruction-Tuned Large Language Models: An Experimental Analysis up to 405B", "paper_summary": "Prior research works have evaluated quantized LLMs using limited metrics such\nas perplexity or a few basic knowledge tasks and old datasets. Additionally,\nrecent large-scale models such as Llama 3.1 with up to 405B have not been\nthoroughly examined. This paper evaluates the performance of instruction-tuned\nLLMs across various quantization methods (GPTQ, AWQ, SmoothQuant, and FP8) on\nmodels ranging from 7B to 405B. Using 13 benchmarks, we assess performance\nacross six task types: commonsense Q\\&A, knowledge and language understanding,\ninstruction following, hallucination detection, mathematics, and dialogue. Our\nkey findings reveal that (1) quantizing a larger LLM to a similar size as a\nsmaller FP16 LLM generally performs better across most benchmarks, except for\nhallucination detection and instruction following; (2) performance varies\nsignificantly with different quantization methods, model size, and bit-width,\nwith weight-only methods often yielding better results in larger models; (3)\ntask difficulty does not significantly impact accuracy degradation due to\nquantization; and (4) the MT-Bench evaluation method has limited discriminatory\npower among recent high-performing LLMs.", "paper_summary_zh": "先前的研究工作已使用有限的指標，例如困惑度或一些基本的知識任務和舊的資料集，來評估量化的 LLM。此外，像 Llama 3.1 這樣高達 405B 的最新大型模型尚未經過徹底檢查。本文評估了從 7B 到 405B 的模型在各種量化方法（GPTQ、AWQ、SmoothQuant 和 FP8）上，經過指令調整的 LLM 的效能。使用 13 個基準，我們評估了六種任務類型的效能：常識問答、知識和語言理解、指令遵循、幻覺檢測、數學和對話。我們的關鍵發現顯示，（1）將較大的 LLM 量化為與較小的 FP16 LLM 相似的尺寸，通常在除幻覺檢測和指令遵循之外的大多數基準上表現得更好；（2）效能會隨著不同的量化方法、模型大小和位元寬度而有顯著差異，僅權重的量化方法通常在較大的模型中產生更好的結果；（3）任務難度不會顯著影響量化造成的準確度下降；（4）MT-Bench 評估方法在最近效能良好的 LLM 中具有有限的區分能力。", "author": "Jemin Lee et.al.", "authors": "Jemin Lee, Sihyeong Park, Jinse Kwon, Jihun Oh, Yongin Kwon", "id": "2409.11055v1", "paper_url": "http://arxiv.org/abs/2409.11055v1", "repo": "null"}}