{"2410.19453": {"publish_time": "2024-10-25", "title": "ShifCon: Enhancing Non-Dominant Language Capabilities with a Shift-based Contrastive Framework", "paper_summary": "Although fine-tuning Large Language Models (LLMs) with multilingual data can\nrapidly enhance the multilingual capabilities of LLMs, they still exhibit a\nperformance gap between the dominant language (e.g., English) and non-dominant\nones due to the imbalance of training data across languages. To further enhance\nthe performance of non-dominant languages, we propose ShifCon, a Shift-based\nContrastive framework that aligns the internal forward process of other\nlanguages toward that of the dominant one. Specifically, it shifts the\nrepresentations of non-dominant languages into the dominant language subspace,\nallowing them to access relatively rich information encoded in the model\nparameters. The enriched representations are then shifted back into their\noriginal language subspace before generation. Moreover, we introduce a subspace\ndistance metric to pinpoint the optimal layer area for shifting representations\nand employ multilingual contrastive learning to further enhance the alignment\nof representations within this area. Experiments demonstrate that our ShifCon\nframework significantly enhances the performance of non-dominant languages,\nparticularly for low-resource ones. Further analysis offers extra insights to\nverify the effectiveness of ShifCon and propel future research", "paper_summary_zh": "雖然使用多語言資料微調大型語言模型 (LLM) 可以快速增強 LLM 的多語言能力，但由於訓練資料在語言之間的不平衡，它們仍然在主導語言（例如英語）與非主導語言之間表現出差距。為了進一步增強非主導語言的效能，我們提出 ShifCon，一個基於轉移的對比框架，它將其他語言的內部前向處理程序與主導語言的處理程序對齊。具體來說，它將非主導語言的表徵轉移到主導語言的子空間中，讓它們能夠存取模型參數中編碼的相對豐富資訊。然後在產生之前，將豐富的表徵轉移回它們原本的語言子空間。此外，我們引入一個子空間距離量度來精確定位轉移表徵的最佳層級區域，並採用多語言對比學習來進一步增強該區域內表徵的對齊。實驗證明，我們的 ShifCon 框架顯著增強了非主導語言的效能，特別是對於低資源語言。進一步的分析提供了額外的見解來驗證 ShifCon 的有效性並推動未來的研究", "author": "Hengyuan Zhang et.al.", "authors": "Hengyuan Zhang, Chenming Shang, Sizhe Wang, Dongdong Zhang, Feng Yao, Renliang Sun, Yiyao Yu, Yujiu Yang, Furu Wei", "id": "2410.19453v1", "paper_url": "http://arxiv.org/abs/2410.19453v1", "repo": "null"}}