{"2409.11727": {"publish_time": "2024-09-18", "title": "Enabling Real-Time Conversations with Minimal Training Costs", "paper_summary": "Large language models (LLMs) have demonstrated the ability to improve human\nefficiency through conversational interactions. Conventional LLM-powered\ndialogue systems, operating on a turn-based paradigm, preclude real-time\ninteraction during response generation. To address this limitation, researchers\nhave proposed duplex models. These models can dynamically adapt to user input,\nfacilitating real-time interactive feedback. However, these methods typically\nrequire substantial computational resources to acquire the ability. To reduce\noverhead, this paper presents a new duplex decoding approach that enhances LLMs\nwith duplex ability, requiring minimal additional training. Specifically, our\nmethod employs parallel decoding of queries and responses in conversations,\neffectively implementing a channel-division-multiplexing decoding strategy.\nExperimental results indicate that our proposed method significantly enhances\nthe naturalness and human-likeness of user-AI interactions with minimal\ntraining costs.", "paper_summary_zh": "大型語言模型 (LLM) 已展示出透過對話互動來提升人類效率的能力。在回合制範例中運作的傳統 LLM 驅動對話系統，會在回應產生期間排除即時互動。為了解決這個限制，研究人員提出了雙工模型。這些模型可以動態適應使用者輸入，促進即時互動回饋。然而，這些方法通常需要大量的運算資源才能獲得這種能力。為了減少開銷，本文提出了一種新的雙工解碼方法，它以最少的額外訓練來增強 LLM 的雙工能力。具體來說，我們的模型在對話中採用查詢和回應的並行解碼，有效地實作了頻道分割多工解碼策略。實驗結果表明，我們提出的方法顯著地增強了使用者與 AI 互動的自然性和擬人化，同時訓練成本極低。", "author": "Wang Xu et.al.", "authors": "Wang Xu, Shuo Wang, Weilin Zhao, Xu Han, Yukun Yan, Yudi Zhang, Zhe Tao, Zhiyuan Liu, Wanxiang Che", "id": "2409.11727v1", "paper_url": "http://arxiv.org/abs/2409.11727v1", "repo": "null"}}