{"2406.08246": {"publish_time": "2024-06-12", "title": "Leveraging Large Language Models for Web Scraping", "paper_summary": "Large Language Models (LLMs) demonstrate remarkable capabilities in\nreplicating human tasks and boosting productivity. However, their direct\napplication for data extraction presents limitations due to a prioritisation of\nfluency over factual accuracy and a restricted ability to manipulate specific\ninformation. Therefore to overcome these limitations, this research leverages\nthe knowledge representation power of pre-trained LLMs and the targeted\ninformation access enabled by RAG models, this research investigates a\ngeneral-purpose accurate data scraping recipe for RAG models designed for\nlanguage generation. To capture knowledge in a more modular and interpretable\nway, we use pre trained language models with a latent knowledge retriever,\nwhich allows the model to retrieve and attend over documents from a large\ncorpus. We utilised RAG model architecture and did an in-depth analysis of\ntheir capabilities under three tasks: (i) Semantic Classification of HTML\nelements, (ii) Chunking HTML text for effective understanding, and (iii)\ncomparing results from different LLMs and ranking algorithms. While previous\nwork has developed dedicated architectures and training procedures for HTML\nunderstanding and extraction, we show that LLMs pre-trained on standard natural\nlanguage with an addition of effective chunking, searching and ranking\nalgorithms, can prove to be efficient data scraping tool to extract complex\ndata from unstructured text. Future research directions include addressing the\nchallenges of provenance tracking and dynamic knowledge updates within the\nproposed RAG-based data extraction framework. By overcoming these limitations,\nthis approach holds the potential to revolutionise data extraction from vast\nrepositories of textual information.", "paper_summary_zh": "大型語言模型 (LLM) 在複製人類任務和提升生產力方面展現了非凡的能力。然而，由於優先考慮流暢性而非事實準確性，以及操縱特定資訊的能力受限，它們在資料萃取方面的直接應用存在限制。因此，為了克服這些限制，本研究利用預先訓練 LLM 的知識表示能力和 RAG 模型所實現的目標資訊存取，探討一種針對語言生成而設計的 RAG 模型的通用且準確的資料擷取配方。為了以更模組化且可解釋的方式擷取知識，我們使用具有潛在知識檢索器的預先訓練語言模型，這允許模型從大型語料庫中檢索文件並關注這些文件。我們利用了 RAG 模型架構，並對它們在三項任務下的能力進行了深入分析：(i) HTML 元素的語義分類，(ii) 有效理解 HTML 文字的區塊化，以及 (iii) 比較不同 LLM 和排序演算法的結果。儘管先前的研究已經開發出專門的架構和訓練程序來理解和萃取 HTML，我們展示了在標準自然語言上預先訓練的 LLM，加上有效的區塊化、搜尋和排序演算法，可以證明是一種有效率的資料擷取工具，可從非結構化文字中萃取複雜的資料。未來的研究方向包括解決建議的基於 RAG 的資料萃取架構中，來源追蹤和動態知識更新的挑戰。透過克服這些限制，此方法有潛力革新從大量文字資訊儲存庫中萃取資料的方式。", "author": "Aman Ahluwalia et.al.", "authors": "Aman Ahluwalia, Suhrud Wani", "id": "2406.08246v1", "paper_url": "http://arxiv.org/abs/2406.08246v1", "repo": "null"}}