{"2412.12929": {"publish_time": "2024-12-17", "title": "Spectra of Cardinality Queries over Description Logic Knowledge Bases", "paper_summary": "Recent works have explored the use of counting queries coupled with\nDescription Logic ontologies. The answer to such a query in a model of a\nknowledge base is either an integer or $\\infty$, and its spectrum is the set of\nits answers over all models. While it is unclear how to compute and manipulate\nsuch a set in general, we identify a class of counting queries whose spectra\ncan be effectively represented. Focusing on atomic counting queries, we\npinpoint the possible shapes of a spectrum over $\\mathcal{ALCIF}$ ontologies:\nthey are essentially the subsets of $\\mathbb{N} \\cup \\{ \\infty \\}$ closed under\naddition. For most sublogics of $\\mathcal{ALCIF}$, we show that possible\nspectra enjoy simpler shapes, being $[ m, \\infty ]$ or variations thereof. To\nobtain our results, we refine constructions used for finite model reasoning and\nnotably rely on a cycle-reversion technique for the Horn fragment of\n$\\mathcal{ALCIF}$. We also study the data complexity of computing the proposed\neffective representation and establish the\n$\\mathsf{FP}^{\\mathsf{NP}[\\log]}$-completeness of this task under several\nsettings.", "paper_summary_zh": "最近的研究探索了使用计数查詢結合描述邏輯本体。在知識庫模型中對此類查詢的答案不是整數就是 $\\infty$，其譜是其在所有模型上的答案集合。雖然目前尚不清楚如何一般計算和操作此類集合，但我們識別出一類可以有效表示其譜的計數查詢。專注於原子計數查詢，我們精確指出 $\\mathcal{ALCIF}$ 本体上譜的可能形狀：它們基本上是 $\\mathbb{N} \\cup \\{ \\infty \\}$ 的子集，在加法下封閉。對於 $\\mathcal{ALCIF}$ 的大多數子邏輯，我們表明可能的譜具有更簡單的形狀，即 $[ m, \\infty ]$ 或其變體。為了獲得我們的結果，我們改進了用於有限模型推理的構造，並特別依賴於 $\\mathcal{ALCIF}$ 的 Horn 片段的循環逆轉技術。我們還研究了計算所提出的有效表示的數據複雜性，並在多種設置下建立了此任務的 $\\mathsf{FP}^{\\mathsf{NP}[\\log]}$-完備性。", "author": "Quentin Manière et.al.", "authors": "Quentin Manière, Marcin Przybyłko", "id": "2412.12929v1", "paper_url": "http://arxiv.org/abs/2412.12929v1", "repo": "null"}}