{"2411.02920": {"publish_time": "2024-11-05", "title": "Domain Expansion and Boundary Growth for Open-Set Single-Source Domain Generalization", "paper_summary": "Open-set single-source domain generalization aims to use a single-source\ndomain to learn a robust model that can be generalized to unknown target\ndomains with both domain shifts and label shifts. The scarcity of the source\ndomain and the unknown data distribution of the target domain pose a great\nchallenge for domain-invariant feature learning and unknown class recognition.\nIn this paper, we propose a novel learning approach based on domain expansion\nand boundary growth to expand the scarce source samples and enlarge the\nboundaries across the known classes that indirectly broaden the boundary\nbetween the known and unknown classes. Specifically, we achieve domain\nexpansion by employing both background suppression and style augmentation on\nthe source data to synthesize new samples. Then we force the model to distill\nconsistent knowledge from the synthesized samples so that the model can learn\ndomain-invariant information. Furthermore, we realize boundary growth across\nclasses by using edge maps as an additional modality of samples when training\nmulti-binary classifiers. In this way, it enlarges the boundary between the\ninliers and outliers, and consequently improves the unknown class recognition\nduring open-set generalization. Extensive experiments show that our approach\ncan achieve significant improvements and reach state-of-the-art performance on\nseveral cross-domain image classification datasets.", "paper_summary_zh": "開放式單源域泛化旨在使用單源域學習一個強健模型，該模型可以泛化到具有域偏移和標籤偏移的未知目標域。源域的稀缺性和目標域未知的資料分佈對域不變特徵學習和未知類別識別構成巨大挑戰。在本文中，我們提出了一種基於域擴充和邊界增長的創新學習方法，以擴充稀缺的源樣本並擴大已知類別的邊界，從而間接擴大已知類別和未知類別之間的邊界。具體來說，我們通過對源資料採用背景抑制和樣式擴充來實現域擴充，以合成新樣本。然後，我們強制模型從合成樣本中提取一致的知識，以便模型可以學習域不變資訊。此外，我們在訓練多二元分類器時使用邊緣圖作為樣本的附加方式來實現跨類別的邊界增長。這樣，它擴大了內點和外點之間的邊界，從而改善了開放式泛化期間的未知類別識別。大量實驗表明，我們的方法可以在幾個跨域影像分類資料集上實現顯著的改進，並達到最先進的效能。", "author": "Pengkun Jiao et.al.", "authors": "Pengkun Jiao, Na Zhao, Jingjing Chen, Yu-Gang Jiang", "id": "2411.02920v1", "paper_url": "http://arxiv.org/abs/2411.02920v1", "repo": "null"}}