{"2412.15209": {"publish_time": "2024-12-19", "title": "PRIMA: Multi-Image Vision-Language Models for Reasoning Segmentation", "paper_summary": "Despite significant advancements in Large Vision-Language Models (LVLMs),\nexisting pixel-grounding models operate on single-image settings, limiting\ntheir ability to perform detailed, fine-grained comparisons across multiple\nimages. Conversely, current multi-image understanding models lack pixel-level\ngrounding. Our work addresses this gap by introducing the task of multi-image\npixel-grounded reasoning segmentation, and PRIMA, a novel LVLM that integrates\npixel-level grounding with robust multi-image reasoning capabilities to produce\ncontextually rich, pixel-grounded explanations. Central to PRIMA is an\nefficient vision module that queries fine-grained visual representations across\nmultiple images, reducing TFLOPs by $25.3\\%$. To support training and\nevaluation, we curate $M^4Seg$, a new reasoning segmentation benchmark\nconsisting of $\\sim$224K question-answer pairs that require fine-grained visual\nunderstanding across multiple images. Experimental results demonstrate PRIMA\noutperforms state-of-the-art baselines.", "paper_summary_zh": "儘管大型視覺語言模型 (LVLMs) 有顯著的進展，現有的像素基礎模型在單一影像設定中運作，限制了它們跨多個影像執行詳細、細微的比較的能力。相反地，目前的許多影像理解模型缺乏像素層級的基礎。我們的研究透過引入多影像像素基礎推理分割的任務，以及 PRIMA，一個整合像素層級基礎與強健的多影像推理能力的新穎 LVLM，來解決這個差距，以產生脈絡豐富、像素基礎的解釋。PRIMA 的核心是一個高效的視覺模組，它查詢跨多個影像的細微視覺表示，將 TFLOP 減少了 25.3%。為了支援訓練和評估，我們策劃了 M4Seg，一個新的推理分割基準，包含約 22.4 萬個問題回答對，這些對需要跨多個影像的細微視覺理解。實驗結果證明 PRIMA 優於最先進的基準。", "author": "Muntasir Wahed et.al.", "authors": "Muntasir Wahed, Kiet A. Nguyen, Adheesh Sunil Juvekar, Xinzhuo Li, Xiaona Zhou, Vedant Shah, Tianjiao Yu, Pinar Yanardag, Ismini Lourentzou", "id": "2412.15209v1", "paper_url": "http://arxiv.org/abs/2412.15209v1", "repo": "null"}}