{"2405.18974": {"publish_time": "2024-05-29", "title": "Encoding Hierarchical Schema via Concept Flow for Multifaceted Ideology Detection", "paper_summary": "Multifaceted ideology detection (MID) aims to detect the ideological leanings\nof texts towards multiple facets. Previous studies on ideology detection mainly\nfocus on one generic facet and ignore label semantics and explanatory\ndescriptions of ideologies, which are a kind of instructive information and\nreveal the specific concepts of ideologies. In this paper, we develop a novel\nconcept semantics-enhanced framework for the MID task. Specifically, we propose\na bidirectional iterative concept flow (BICo) method to encode multifaceted\nideologies. BICo enables the concepts to flow across levels of the schema tree\nand enriches concept representations with multi-granularity semantics.\nFurthermore, we explore concept attentive matching and concept-guided\ncontrastive learning strategies to guide the model to capture ideology features\nwith the learned concept semantics. Extensive experiments on the benchmark\ndataset show that our approach achieves state-of-the-art performance in MID,\nincluding in the cross-topic scenario.", "paper_summary_zh": "多面向意識形態偵測（MID）旨在偵測文本對多個面向的意識形態傾向。先前關於意識形態偵測的研究主要關注於一個通用面向，而忽略了標籤語意和意識形態的說明性描述，這些描述是一種有指導性的資訊，且揭示了意識形態的特定概念。在本文中，我們為 MID 任務開發了一個新穎的概念語意增強框架。具體來說，我們提出了一個雙向迭代概念流（BICo）方法來編碼多面向意識形態。BICo 使概念能夠跨架構樹的層級流動，並使用多粒度語意豐富概念表示。此外，我們探討了概念注意力比對和概念引導對比學習策略，以指導模型使用學習的概念語意擷取意識形態特徵。基準資料集上的廣泛實驗表明，我們的做法在 MID 中達到了最先進的效能，包括跨主題情境。", "author": "Songtao Liu et.al.", "authors": "Songtao Liu, Bang Wang, Wei Xiang, Han Xu, Minghua Xu", "id": "2405.18974v1", "paper_url": "http://arxiv.org/abs/2405.18974v1", "repo": "null"}}