{"2502.11965": {"publish_time": "2025-02-17", "title": "A MIMO Wireless Channel Foundation Model via CIR-CSI Consistency", "paper_summary": "In the field of artificial intelligence, self-supervised learning has\ndemonstrated superior generalization capabilities by leveraging large-scale\nunlabeled datasets for pretraining, which is especially critical for wireless\ncommunication models to adapt to a variety of scenarios. This paper\ninnovatively treats Channel State Information (CSI) and Channel Impulse\nResponse (CIR) as naturally aligned multi-modal data and proposes the first\nMIMO wireless channel foundation model, named CSI-CLIP. By effectively\ncapturing the joint representations of both CIR and CSI, CSI-CLIP exhibits\nremarkable adaptability across scenarios and robust feature extraction\ncapabilities. Experimental results show that in positioning task, CSI-CLIP\nreduces the mean error distance by 22%; in beam management task, it increases\naccuracy by 1% compared to traditional supervised methods, as well as in the\nchannel identification task. These improvements not only highlight the\npotential and value of CSI-CLIP in integrating sensing and communication but\nalso demonstrate its significant advantages over existing techniques. Moreover,\nviewing CSI and CIR as multi-modal pairs and contrastive learning for wireless\nchannel foundation model open up new research directions in the domain of MIMO\nwireless communications.", "paper_summary_zh": "在人工智能领域，自监督学习通过利用大规模无标签数据集进行预训练，展示了卓越的泛化能力，这对于无线通信模型适应各种场景尤为关键。本文创新地将信道状态信息 (CSI) 和信道脉冲响应 (CIR) 视为自然对齐的多模态数据，并提出了第一个 MIMO 无线信道基础模型，名为 CSI-CLIP。通过有效捕获 CIR 和 CSI 的联合表示，CSI-CLIP 在各种场景中表现出卓越的适应性和强大的特征提取能力。实验结果表明，在定位任务中，CSI-CLIP 将平均误差距离减少了 22%；在波束管理任务中，与传统的监督方法相比，其准确度提高了 1%，以及在信道识别任务中。这些改进不仅突出了 CSI-CLIP 在集成感知和通信方面的潜力和价值，而且还展示了其相对于现有技术的显着优势。此外，将 CSI 和 CIR 视为多模态对，并对比学习无线信道基础模型，为 MIMO 无线通信领域开辟了新的研究方向。", "author": "Jun Jiang et.al.", "authors": "Jun Jiang, Wenjun Yu, Yunfan Li, Yuan Gao, Shugong Xu", "id": "2502.11965v1", "paper_url": "http://arxiv.org/abs/2502.11965v1", "repo": "null"}}