{"2501.04303": {"publish_time": "2025-01-08", "title": "Multimodal Graph Constrastive Learning and Prompt for ChartQA", "paper_summary": "ChartQA presents significant challenges due to the complex distribution of\nchart elements and the implicit patterns embedded within the underlying data.\nIn this chapter, we have developed a joint multimodal scene graph for charts,\nexplicitly representing the relationships between chart elements and their\nassociated patterns.\n  Our proposed multimodal scene graph consists of two components: a visual\ngraph and a textual graph, each designed to capture the structural and semantic\ninformation within the chart. To unify representations across these different\nmodalities, we introduce a multimodal graph contrastive learning approach that\nlearns unified representations by maximizing similarity between nodes\nrepresenting the same object across multimodal graphs. The learned graph\nrepresentations can be seamlessly incorporated into a transformer decoder as a\nsoft prompt.\n  Additionally, given the growing need for Multimodal Large Language Models\n(MLLMs) in zero-shot scenarios, we have designed Chain-of-Thought (CoT) prompts\nfor MLLMs to reduce hallucinations. We tested both methods on public benchmarks\nsuch as ChartQA, OpenCQA, and ChartX, demonstrating improved performance and\nvalidating the effectiveness of our proposed methods.", "paper_summary_zh": "ChartQA 因圖表元素的複雜分佈和基礎資料中內嵌的隱含模式而面臨重大挑戰。\n在本章中，我們為圖表開發了一個聯合多模態場景圖形，明確表示圖表元素之間的關係及其關聯模式。\n我們提出的多模態場景圖形包含兩個組成部分：一個視覺圖形和一個文本圖形，每個組成部分都旨在擷取圖表中的結構化和語義資訊。\n為了統一這些不同模態的表示，我們引入了一個多模態圖形對比學習方法，透過最大化跨多模態圖形表示相同物件的節點之間的相似性來學習統一的表示。\n學習到的圖形表示可以無縫地整合到Transformer解碼器中，作為一個軟提示。\n此外，鑑於多模態大型語言模型 (MLLM) 在零次學習場景中的需求日益增加，我們為 MLLM 設計了思考鏈 (CoT) 提示，以減少幻覺。\n我們在公眾基準上測試了這兩種方法，例如 ChartQA、OpenCQA 和 ChartX，證明了效能的提升，並驗證了我們提出的方法的有效性。", "author": "Yue Dai et.al.", "authors": "Yue Dai, Soyeon Caren Han, Wei Liu", "id": "2501.04303v1", "paper_url": "http://arxiv.org/abs/2501.04303v1", "repo": "null"}}