{"2412.04261": {"publish_time": "2024-12-05", "title": "Aya Expanse: Combining Research Breakthroughs for a New Multilingual Frontier", "paper_summary": "We introduce the Aya Expanse model family, a new generation of 8B and 32B\nparameter multilingual language models, aiming to address the critical\nchallenge of developing highly performant multilingual models that match or\nsurpass the capabilities of monolingual models. By leveraging several years of\nresearch at Cohere For AI and Cohere, including advancements in data arbitrage,\nmultilingual preference training, and model merging, Aya Expanse sets a new\nstate-of-the-art in multilingual performance. Our evaluations on the\nArena-Hard-Auto dataset, translated into 23 languages, demonstrate that Aya\nExpanse 8B and 32B outperform leading open-weight models in their respective\nparameter classes, including Gemma 2, Qwen 2.5, and Llama 3.1, achieving up to\na 76.6% win-rate. Notably, Aya Expanse 32B outperforms Llama 3.1 70B, a model\nwith twice as many parameters, achieving a 54.0% win-rate. In this short\ntechnical report, we present extended evaluation results for the Aya Expanse\nmodel family and release their open-weights, together with a new multilingual\nevaluation dataset m-ArenaHard.", "paper_summary_zh": "我們推出了 Aya Expanse 模型家族，這是新一代的 8B 和 32B 參數多語言語言模型，旨在解決開發高度效能多語言模型的關鍵挑戰，這些模型與單語言模型相匹配或超越其能力。透過利用 Cohere For AI 和 Cohere 多年來的研究，包括資料套利、多語言偏好訓練和模型合併的進展，Aya Expanse 在多語言效能方面樹立了新的技術領先地位。我們對已翻譯成 23 種語言的 Arena-Hard-Auto 資料集進行的評估表明，Aya Expanse 8B 和 32B 在各自的參數類別中優於領先的開放權重模型，包括 Gemma 2、Qwen 2.5 和 Llama 3.1，達到高達 76.6% 的獲勝率。值得注意的是，Aya Expanse 32B 優於 Llama 3.1 70B，後者是一個具有兩倍參數的模型，達到 54.0% 的獲勝率。在這份簡短的技術報告中，我們展示了 Aya Expanse 模型家族的延伸評估結果，並發布了它們的開放權重，以及新的多語言評估資料集 m-ArenaHard。", "author": "John Dang et.al.", "authors": "John Dang, Shivalika Singh, Daniel D'souza, Arash Ahmadian, Alejandro Salamanca, Madeline Smith, Aidan Peppin, Sungjin Hong, Manoj Govindassamy, Terrence Zhao, Sandra Kublik, Meor Amer, Viraat Aryabumi, Jon Ander Campos, Yi-Chern Tan, Tom Kocmi, Florian Strub, Nathan Grinsztajn, Yannis Flet-Berliac, Acyr Locatelli, Hangyu Lin, Dwarak Talupuru, Bharat Venkitesh, David Cairuz, Bowen Yang, Tim Chung, Wei-Yin Ko, Sylvie Shang Shi, Amir Shukayev, Sammie Bae, Aleksandra Piktus, Roman Castagné, Felipe Cruz-Salinas, Eddie Kim, Lucas Crawhall-Stein, Adrien Morisot, Sudip Roy, Phil Blunsom, Ivan Zhang, Aidan Gomez, Nick Frosst, Marzieh Fadaee, Beyza Ermis, Ahmet Üstün, Sara Hooker", "id": "2412.04261v1", "paper_url": "http://arxiv.org/abs/2412.04261v1", "repo": "null"}}