{"2405.12063": {"publish_time": "2024-05-20", "title": "CLAMBER: A Benchmark of Identifying and Clarifying Ambiguous Information Needs in Large Language Models", "paper_summary": "Large language models (LLMs) are increasingly used to meet user information\nneeds, but their effectiveness in dealing with user queries that contain\nvarious types of ambiguity remains unknown, ultimately risking user trust and\nsatisfaction. To this end, we introduce CLAMBER, a benchmark for evaluating\nLLMs using a well-organized taxonomy. Building upon the taxonomy, we construct\n~12K high-quality data to assess the strengths, weaknesses, and potential risks\nof various off-the-shelf LLMs. Our findings indicate the limited practical\nutility of current LLMs in identifying and clarifying ambiguous user queries,\neven enhanced by chain-of-thought (CoT) and few-shot prompting. These\ntechniques may result in overconfidence in LLMs and yield only marginal\nenhancements in identifying ambiguity. Furthermore, current LLMs fall short in\ngenerating high-quality clarifying questions due to a lack of conflict\nresolution and inaccurate utilization of inherent knowledge. In this paper,\nCLAMBER presents a guidance and promotes further research on proactive and\ntrustworthy LLMs. Our dataset is available at\nhttps://github.com/zt991211/CLAMBER", "paper_summary_zh": "大型語言模型 (LLM) 愈來愈常被用於滿足使用者的資訊需求，但它們在處理包含各種歧義的使用者查詢時的有效性仍不得而知，最終會影響使用者的信任和滿意度。為此，我們引入了 CLAMBER，一個用於使用井然有序的分類法評估 LLM 的基準。在分類法的基礎上，我們建構了約 12K 個高品質的資料，以評估各種現成的 LLM 的優點、缺點和潛在風險。我們的研究結果顯示，現有 LLM 在識別和釐清有歧義的使用者查詢方面的實際效用有限，即使透過思考鏈 (CoT) 和少量提示加以增強。這些技術可能會導致對 LLM 過度自信，而且在識別歧義方面僅能帶來邊際改善。此外，現有 LLM 在產生高品質的澄清問題方面也有所不足，原因是缺乏衝突解決和不準確利用內在知識。在本文中，CLAMBER 提供了一個指導方針，並促進對主動且值得信賴的 LLM 的進一步研究。我們的資料集可在 https://github.com/zt991211/CLAMBER 取得", "author": "Tong Zhang et.al.", "authors": "Tong Zhang, Peixin Qin, Yang Deng, Chen Huang, Wenqiang Lei, Junhong Liu, Dingnan Jin, Hongru Liang, Tat-Seng Chua", "id": "2405.12063v1", "paper_url": "http://arxiv.org/abs/2405.12063v1", "repo": "https://github.com/zt991211/clamber"}}