{"2501.01329": {"publish_time": "2025-01-02", "title": "The Prompt Alchemist: Automated LLM-Tailored Prompt Optimization for Test Case Generation", "paper_summary": "Test cases are essential for validating the reliability and quality of\nsoftware applications. Recent studies have demonstrated the capability of Large\nLanguage Models (LLMs) to generate useful test cases for given source code.\nHowever, the existing work primarily relies on human-written plain prompts,\nwhich often leads to suboptimal results since the performance of LLMs can be\nhighly influenced by the prompts. Moreover, these approaches use the same\nprompt for all LLMs, overlooking the fact that different LLMs might be best\nsuited to different prompts. Given the wide variety of possible prompt\nformulations, automatically discovering the optimal prompt for each LLM\npresents a significant challenge. Although there are methods on automated\nprompt optimization in the natural language processing field, they are hard to\nproduce effective prompts for the test case generation task. First, the methods\niteratively optimize prompts by simply combining and mutating existing ones\nwithout proper guidance, resulting in prompts that lack diversity and tend to\nrepeat the same errors in the generated test cases. Second, the prompts are\ngenerally lack of domain contextual knowledge, limiting LLMs' performance in\nthe task.", "paper_summary_zh": "測試案例對於驗證軟體應用的可靠性和品質至關重要。最近的研究已證明大型語言模型 (LLM) 能夠為給定的原始碼產生有用的測試案例。然而，現有的工作主要依賴人工撰寫的簡單提示，這通常會導致次佳的結果，因為 LLM 的效能可能會受到提示的極大影響。此外，這些方法對所有 LLM 使用相同的提示，忽略了不同的 LLM 可能最適合不同的提示這個事實。考量到各種可能的提示表述，自動找出每個 LLM 的最佳提示是一項重大的挑戰。儘管自然語言處理領域有自動提示最佳化的方式，但它們難以產生有效的提示以進行測試案例產生任務。首先，這些方法透過簡單地組合和改變現有的提示，在沒有適當指導的情況下反覆最佳化提示，導致提示缺乏多樣性，並且傾向於在產生的測試案例中重複相同的錯誤。其次，提示通常缺乏領域脈絡知識，這會限制 LLM 在任務中的效能。", "author": "Shuzheng Gao et.al.", "authors": "Shuzheng Gao, Chaozheng Wang, Cuiyun Gao, Xiaoqian Jiao, Chun Yong Chong, Shan Gao, Michael Lyu", "id": "2501.01329v1", "paper_url": "http://arxiv.org/abs/2501.01329v1", "repo": "null"}}