{"2410.06977": {"publish_time": "2024-10-09", "title": "Adaptive High-Frequency Transformer for Diverse Wildlife Re-Identification", "paper_summary": "Wildlife ReID involves utilizing visual technology to identify specific\nindividuals of wild animals in different scenarios, holding significant\nimportance for wildlife conservation, ecological research, and environmental\nmonitoring. Existing wildlife ReID methods are predominantly tailored to\nspecific species, exhibiting limited applicability. Although some approaches\nleverage extensively studied person ReID techniques, they struggle to address\nthe unique challenges posed by wildlife. Therefore, in this paper, we present a\nunified, multi-species general framework for wildlife ReID. Given that\nhigh-frequency information is a consistent representation of unique features in\nvarious species, significantly aiding in identifying contours and details such\nas fur textures, we propose the Adaptive High-Frequency Transformer model with\nthe goal of enhancing high-frequency information learning. To mitigate the\ninevitable high-frequency interference in the wilderness environment, we\nintroduce an object-aware high-frequency selection strategy to adaptively\ncapture more valuable high-frequency components. Notably, we unify the\nexperimental settings of multiple wildlife datasets for ReID, achieving\nsuperior performance over state-of-the-art ReID methods. In domain\ngeneralization scenarios, our approach demonstrates robust generalization to\nunknown species.", "paper_summary_zh": "野生動物 ReID 涉及利用視覺技術來識別不同場景中野生動物的特定個體，這對野生動物保育、生態研究和環境監控具有重要意義。現有的野生動物 ReID 方法主要針對特定物種量身打造，適用性有限。儘管有些方法利用廣泛研究的人員 ReID 技術，但它們仍難以應對野生動物帶來的獨特挑戰。因此，在本文中，我們提出了一個統一的多物種通用框架，用於野生動物 ReID。鑑於高頻信息是一致表示各種物種中獨特特徵，顯著有助於識別輪廓和細節，例如皮毛紋理，我們提出了自適應高頻Transformer模型，目標是加強高頻信息學習。為了減輕野外環境中不可避免的高頻干擾，我們引入了一個對象感知高頻選擇策略，以自適應地捕捉更有價值的高頻組成。值得注意的是，我們統一了 ReID 的多個野生動物數據集的實驗設置，實現了優於最先進的 ReID 方法的卓越性能。在域泛化場景中，我們的做法證明了對未知物種的強大泛化能力。", "author": "Chenyue Li et.al.", "authors": "Chenyue Li, Shuoyi Chen, Mang Ye", "id": "2410.06977v1", "paper_url": "http://arxiv.org/abs/2410.06977v1", "repo": "null"}}