{"2412.07210": {"publish_time": "2024-12-10", "title": "EDiT: A Local-SGD-Based Efficient Distributed Training Method for Large Language Models", "paper_summary": "Distributed training methods are crucial for large language models (LLMs).\nHowever, existing distributed training methods often suffer from communication\nbottlenecks, stragglers, and limited elasticity. Local SGD methods have been\nproposed to address these issues, but their effectiveness remains limited to\nsmall-scale training due to additional memory overhead and lack of concerns on\nefficiency and stability. To tackle these issues, we propose EDiT, an\ninnovative Efficient Distributed Training method that combines a tailored Local\nSGD approach with model sharding techniques to enhance large-scale training\nefficiency. EDiT performs layer-wise parameter synchronization during forward\npass, reducing communication and memory overhead and enabling the overlap of\ncomputation and communication. Besides, EDiT employs a pseudo gradient penalty\nstrategy to suppress loss spikes, which ensures training stability and improve\nperformance. Additionally, we introduce A-EDiT, a fully asynchronous variant of\nEDiT that accommodates heterogeneous clusters. Building on EDiT/A-EDiT, we\nconduct a series of experiments to validate large-scale asynchronous training\nfor LLMs, accompanied by comprehensive analyses. Experimental results\ndemonstrate the superior performance of EDiT/A-EDiT, establishing them as\nrobust solutions for distributed LLM training in diverse computational\necosystems.", "paper_summary_zh": "大型語言模型 (LLM) 分散訓練方法至關重要。\n然而，現有的分散訓練方法常常會遇到通訊瓶頸、落後者和彈性受限的問題。已經提出使用局部 SGD 方法來解決這些問題，但由於額外的記憶體負擔以及對效率和穩定性的關注不足，其有效性仍然僅限於小規模訓練。為了解決這些問題，我們提出了 EDiT，這是一種創新的高效分散訓練方法，它結合了量身打造的局部 SGD 方法和模型分片技術來提升大規模訓練的效率。EDiT 在前向傳遞期間執行逐層參數同步，減少通訊和記憶體負擔，並使運算和通訊重疊。此外，EDiT 採用偽梯度罰則策略來抑制損失尖峰，這確保了訓練的穩定性並提升了效能。此外，我們引入了 A-EDiT，這是一種 EDiT 的完全非同步變體，可適應異質群集。建立在 EDiT/A-EDiT 的基礎上，我們進行了一系列實驗，以驗證大型語言模型的大規模非同步訓練，並附上全面的分析。實驗結果證明了 EDiT/A-EDiT 的優異效能，確立了它們作為分散式大型語言模型訓練在各種運算生態系統中穩健解決方案的地位。", "author": "Jialiang Cheng et.al.", "authors": "Jialiang Cheng, Ning Gao, Yun Yue, Zhiling Ye, Jiadi Jiang, Jian Sha", "id": "2412.07210v1", "paper_url": "http://arxiv.org/abs/2412.07210v1", "repo": "null"}}