{"2405.13551": {"publish_time": "2024-05-22", "title": "Large Language Models are Effective Priors for Causal Graph Discovery", "paper_summary": "Causal structure discovery from observations can be improved by integrating\nbackground knowledge provided by an expert to reduce the hypothesis space.\nRecently, Large Language Models (LLMs) have begun to be considered as sources\nof prior information given the low cost of querying them relative to a human\nexpert. In this work, firstly, we propose a set of metrics for assessing LLM\njudgments for causal graph discovery independently of the downstream algorithm.\nSecondly, we systematically study a set of prompting designs that allows the\nmodel to specify priors about the structure of the causal graph. Finally, we\npresent a general methodology for the integration of LLM priors in graph\ndiscovery algorithms, finding that they help improve performance on\ncommon-sense benchmarks and especially when used for assessing edge\ndirectionality. Our work highlights the potential as well as the shortcomings\nof the use of LLMs in this problem space.", "paper_summary_zh": "透過整合專家提供的背景知識，可以縮小假說空間，進而改善從觀測中發現因果結構。\n近期，考量到相較於人類專家，查詢大型語言模型 (LLM) 的成本較低，因此 LLM 已開始被視為先驗資訊的來源。在這項研究中，我們首先提出了一組指標，用於評估 LLM 判斷因果圖形發現的獨立性，與下游演算法無關。其次，我們系統性地研究了一組提示設計，允許模型指定關於因果圖形結構的先驗。最後，我們提出了一種整合 LLM 先驗的通用方法，用於圖形發現演算法，發現它們有助於改善常識基準的效能，特別是在用於評估邊緣方向性時。我們的研究重點說明了在這個問題空間中使用 LLM 的潛力以及缺點。", "author": "Victor-Alexandru Darvariu et.al.", "authors": "Victor-Alexandru Darvariu, Stephen Hailes, Mirco Musolesi", "id": "2405.13551v1", "paper_url": "http://arxiv.org/abs/2405.13551v1", "repo": "null"}}