{"2501.09292": {"publish_time": "2025-01-16", "title": "To Retrieve or Not to Retrieve? Uncertainty Detection for Dynamic Retrieval Augmented Generation", "paper_summary": "Retrieval-Augmented Generation equips large language models with the\ncapability to retrieve external knowledge, thereby mitigating hallucinations by\nincorporating information beyond the model's intrinsic abilities. However, most\nprior works have focused on invoking retrieval deterministically, which makes\nit unsuitable for tasks such as long-form question answering. Instead,\ndynamically performing retrieval by invoking it only when the underlying LLM\nlacks the required knowledge can be more efficient. In this context, we delve\ndeeper into the question, \"To Retrieve or Not to Retrieve?\" by exploring\nmultiple uncertainty detection methods. We evaluate these methods for the task\nof long-form question answering, employing dynamic retrieval, and present our\ncomparisons. Our findings suggest that uncertainty detection metrics, such as\nDegree Matrix Jaccard and Eccentricity, can reduce the number of retrieval\ncalls by almost half, with only a slight reduction in question-answering\naccuracy.", "paper_summary_zh": "檢索增強生成為大型語言模型配備檢索外部知識的能力，從而通過整合模型內在能力之外的資訊來減輕幻覺。然而，大多數先前的研究都集中在確定性地調用檢索，這使得它不適合於長篇問題解答等任務。相反，僅在底層 LLM 缺乏所需知識時才通過調用它來動態執行檢索會更有效率。在此背景下，我們深入探討了「檢索還是不檢索？」這個問題，方法是探索多種不確定性檢測方法。我們評估了這些方法在長篇問題解答任務中的作用，採用動態檢索，並展示了我們的比較結果。我們的研究結果表明，不確定性檢測指標，例如度矩陣 Jaccard 和偏心率，可以將檢索呼叫的數量減少近一半，而問題解答準確性僅略有下降。", "author": "Kaustubh D. Dhole et.al.", "authors": "Kaustubh D. Dhole", "id": "2501.09292v1", "paper_url": "http://arxiv.org/abs/2501.09292v1", "repo": "null"}}