{"2501.09804": {"publish_time": "2025-01-16", "title": "Enhancing Generalization in Chain of Thought Reasoning for Smaller Models", "paper_summary": "Chain-of-Thought (CoT) reasoning in smaller language models is a challenging\nnatural language process problem yet highly desirable in many real-life\napplications. Existing CoT knowledge distillation methods often suffer from\noverly conservative memorization in smaller LLMs, leading to low generalization\nconfidence. As fully preserving the CoT ability of teacher model is impossible,\nwe hypothesize that adversarial CoT fine-tuning is crucial for developing\nsmaller LLM with robust CoT generalization. To this end, we propose\n\\textit{PRompt-Assisted Domain-Adversarial fine-tuning} (PRADA), a principled\nfine-tuning framework that integrates diverse CoT domains. Specifically, PRADA\npioneers two CoT improvements in smaller LLM: (1) Recovering the\ndomain-invariant feature insight which typically lost during distillation with\ndomain adversarial fine-tuning; (2) Enhancing the domain adaptability of CoT\nprompt engineering by employing domain-adversarial approaches. We theoretically\ndemonstrate the effectiveness of our approach and empirically show that it\nsignificantly outperforms the state of the arts in a wide range of tasks.\nMoreover, our empirical findings reveal that the smaller LLM, when leveraging\nPRADA, aligns closely with domain knowledge, thereby improving the\nexplainability of our approach.", "paper_summary_zh": "鏈式思考 (CoT) 推理在較小的語言模型中是一個具有挑戰性的自然語言處理問題，但在許多實際應用中卻非常需要。現有的 CoT 知識蒸餾方法通常會導致較小的 LLM 過於保守的記憶，從而降低泛化信心。由於無法完全保留教師模型的 CoT 能力，我們假設對抗性的 CoT 微調對於開發具有強健 CoT 泛化的較小 LLM 至關重要。為此，我們提出了 \\textit{提示輔助領域對抗微調} (PRADA)，這是一個整合了不同 CoT 領域的原則性微調框架。具體來說，PRADA 在較小的 LLM 中開創了兩項 CoT 改進：(1) 恢復在蒸餾過程中通常會丟失的與領域無關的特徵見解，並採用領域對抗微調；(2) 通過採用領域對抗方法來增強 CoT 提示工程的領域適應性。我們在理論上證明了我們方法的有效性，並通過實證表明，它在廣泛的任務中顯著優於現有技術。此外，我們的實證結果表明，較小的 LLM 在利用 PRADA 時與領域知識緊密結合，從而提高了我們方法的可解釋性。", "author": "Maxwell J. Yin et.al.", "authors": "Maxwell J. Yin, Dingyi Jiang, Yongbing Chen, Boyu Wang, Charles Ling", "id": "2501.09804v1", "paper_url": "http://arxiv.org/abs/2501.09804v1", "repo": "null"}}