{"2408.06583": {"publish_time": "2024-08-13", "title": "An Event Structure-aware Generative Model for Biomedical Event Extraction", "paper_summary": "Biomedical Event Extraction (BEE) is a challenging task that involves\nmodeling complex relationships between fine-grained entities in biomedical\ntext. Most existing BEE models rely on classification methods that ignore label\nsemantics and argument dependencies in the data. Although generative models\nthat use prompts are increasingly being used for event extraction, they face\ntwo main challenges: creating effective prompts for the biomedical domain and\ndealing with events with complex structures in the text. To address these\nlimitations, we propose GenBEE, a generative model enhanced with\nstructure-aware prefixes for biomedical event extraction. GenBEE constructs\nevent prompts that leverage knowledge distilled from large language models\n(LLMs), thereby incorporating both label semantics and argument dependency\nrelationships. Additionally, GenBEE introduces a structural prefix learning\nmodule that generates structure-aware prefixes with structural prompts,\nenriching the generation process with structural features. Extensive\nexperiments on three benchmark datasets demonstrate the effectiveness of GenBEE\nand it achieves state-of-the-art performance on the MLEE and GE11 datasets.\nMoreover, our analysis shows that the structural prefixes effectively bridge\nthe gap between structural prompts and the representation space of generative\nmodels, enabling better integration of event structural information.", "paper_summary_zh": "生物医学事件抽取 (BEE) 是一項具有挑戰性的任務，它涉及\n在生物醫學文本中對細粒度實體之間的複雜關係進行建模。大多數現有的 BEE 模型依賴於分類方法，而忽略了數據中的標籤語義和依賴關係。儘管使用提示的生成模型正越來越多地用於事件抽取，但它們面臨著兩個主要挑戰：為生物醫學領域創建有效的提示，以及處理文本中結構複雜的事件。為了解決這些限制，我們提出了 GenBEE，這是一種增強了結構感知前綴的生物醫學事件抽取生成模型。GenBEE 構建事件提示，利用從大型語言模型 (LLM) 中提取的知識，從而結合標籤語義和依賴關係。此外，GenBEE 引入了一個結構前綴學習模組，該模組使用結構提示生成結構感知前綴，並使用結構特徵豐富生成過程。在三個基準數據集上進行的廣泛實驗證明了 GenBEE 的有效性，並且它在 MLEE 和 GE11 數據集上實現了最先進的性能。此外，我們的分析表明，結構前綴有效地彌合了結構提示和生成模型的表示空間之間的差距，從而能夠更好地整合事件結構信息。", "author": "Haohan Yuan et.al.", "authors": "Haohan Yuan, Siu Cheung Hui, Haopeng Zhang", "id": "2408.06583v2", "paper_url": "http://arxiv.org/abs/2408.06583v2", "repo": "null"}}