{"2406.14517": {"publish_time": "2024-06-20", "title": "PostMark: A Robust Blackbox Watermark for Large Language Models", "paper_summary": "The most effective techniques to detect LLM-generated text rely on inserting\na detectable signature -- or watermark -- during the model's decoding process.\nMost existing watermarking methods require access to the underlying LLM's\nlogits, which LLM API providers are loath to share due to fears of model\ndistillation. As such, these watermarks must be implemented independently by\neach LLM provider. In this paper, we develop PostMark, a modular post-hoc\nwatermarking procedure in which an input-dependent set of words (determined via\na semantic embedding) is inserted into the text after the decoding process has\ncompleted. Critically, PostMark does not require logit access, which means it\ncan be implemented by a third party. We also show that PostMark is more robust\nto paraphrasing attacks than existing watermarking methods: our experiments\ncover eight baseline algorithms, five base LLMs, and three datasets. Finally,\nwe evaluate the impact of PostMark on text quality using both automated and\nhuman assessments, highlighting the trade-off between quality and robustness to\nparaphrasing. We release our code, outputs, and annotations at\nhttps://github.com/lilakk/PostMark.", "paper_summary_zh": "最有效的偵測 LLM 生成的文字技術，是於模型解碼過程中插入可偵測的簽名或浮水印。\n現有的浮水印方法大多需要存取 LLM 的底層 logit，而 LLM API 供應商基於對模型萃取的疑慮，不願意分享 logit。因此，這些浮水印必須由各個 LLM 供應商獨立實作。在本文中，我們開發了 PostMark，這是一個模組化的後設浮水印程序，其中一組與輸入相關的字詞（透過語意嵌入來決定）會在解碼程序完成後插入文字中。重要的是，PostMark 不需要存取 logit，這表示它可以由第三方實作。我們也證明 PostMark 比現有的浮水印方法更能抵抗同義詞改寫攻擊：我們的實驗涵蓋八個基準演算法、五個基礎 LLM 和三個資料集。最後，我們使用自動化和人工評估來評估 PostMark 對文字品質的影響，強調品質和對同義詞改寫的抵抗力之間的權衡。我們在 https://github.com/lilakk/PostMark 釋出我們的程式碼、輸出和註解。", "author": "Yapei Chang et.al.", "authors": "Yapei Chang, Kalpesh Krishna, Amir Houmansadr, John Wieting, Mohit Iyyer", "id": "2406.14517v1", "paper_url": "http://arxiv.org/abs/2406.14517v1", "repo": "https://github.com/lilakk/postmark"}}