{"2407.16397": {"publish_time": "2024-07-23", "title": "On ADMM in Heterogeneous Federated Learning: Personalization, Robustness, and Fairness", "paper_summary": "Statistical heterogeneity is a root cause of tension among accuracy,\nfairness, and robustness of federated learning (FL), and is key in paving a\npath forward. Personalized FL (PFL) is an approach that aims to reduce the\nimpact of statistical heterogeneity by developing personalized models for\nindividual users, while also inherently providing benefits in terms of fairness\nand robustness. However, existing PFL frameworks focus on improving the\nperformance of personalized models while neglecting the global model. Moreover,\nthese frameworks achieve sublinear convergence rates and rely on strong\nassumptions. In this paper, we propose FLAME, an optimization framework by\nutilizing the alternating direction method of multipliers (ADMM) to train\npersonalized and global models. We propose a model selection strategy to\nimprove performance in situations where clients have different types of\nheterogeneous data. Our theoretical analysis establishes the global convergence\nand two kinds of convergence rates for FLAME under mild assumptions. We\ntheoretically demonstrate that FLAME is more robust and fair than the\nstate-of-the-art methods on a class of linear problems. Our experimental\nfindings show that FLAME outperforms state-of-the-art methods in convergence\nand accuracy, and it achieves higher test accuracy under various attacks and\nperforms more uniformly across clients.", "paper_summary_zh": "統計異質性是聯邦學習（FL）中準確性、公平性和穩健性之間緊張關係的根源，並且是鋪平前進道路的關鍵。個性化 FL（PFL）是一種旨在通過為個別用戶開發個性化模型來減少統計異質性的影響的方法，同時在公平性和穩健性方面也固有地提供好處。然而，現有的 PFL 框架側重於提高個性化模型的性能，同時忽視了全局模型。此外，這些框架實現了次線性收斂率，並依賴於強有力的假設。在本文中，我們提出了 FLAME，一個優化框架，利用乘法器交替方向方法 (ADMM) 來訓練個性化和全局模型。我們提出了一種模型選擇策略，以提高在客戶端具有不同類型異質數據的情況下的性能。我們的理論分析建立了 FLAME 在溫和假設下的全局收斂和兩種收斂率。我們從理論上證明了 FLAME 在一類線性問題上比最先進的方法更強大、更公平。我們的實驗結果表明，FLAME 在收斂性和準確性方面優於最先進的方法，並且在各種攻擊下實現了更高的測試準確性，並且在客戶端之間表現得更均勻。", "author": "Shengkun Zhu et.al.", "authors": "Shengkun Zhu, Jinshan Zeng, Sheng Wang, Yuan Sun, Xiaodong Li, Yuan Yao, Zhiyong Peng", "id": "2407.16397v1", "paper_url": "http://arxiv.org/abs/2407.16397v1", "repo": "https://github.com/zsk66/flame"}}