{"2501.17348": {"publish_time": "2025-01-28", "title": "Better Slow than Sorry: Introducing Positive Friction for Reliable Dialogue Systems", "paper_summary": "While theories of discourse and cognitive science have long recognized the\nvalue of unhurried pacing, recent dialogue research tends to minimize friction\nin conversational systems. Yet, frictionless dialogue risks fostering\nuncritical reliance on AI outputs, which can obscure implicit assumptions and\nlead to unintended consequences. To meet this challenge, we propose integrating\npositive friction into conversational AI, which promotes user reflection on\ngoals, critical thinking on system response, and subsequent re-conditioning of\nAI systems. We hypothesize systems can improve goal alignment, modeling of user\nmental states, and task success by deliberately slowing down conversations in\nstrategic moments to ask questions, reveal assumptions, or pause. We present an\nontology of positive friction and collect expert human annotations on\nmulti-domain and embodied goal-oriented corpora. Experiments on these corpora,\nalong with simulated interactions using state-of-the-art systems, suggest\nincorporating friction not only fosters accountable decision-making, but also\nenhances machine understanding of user beliefs and goals, and increases task\nsuccess rates.", "paper_summary_zh": "儘管論述理論和認知科學早已認知到放慢步調的價值，最近的對話研究傾向於最小化對話系統中的摩擦。然而，無摩擦的對話有導致過度依賴 AI 輸出的風險，而這可能會模糊隱含的假設並導致意外的後果。為了應對這項挑戰，我們建議將正向摩擦整合到對話式 AI 中，這會促進使用者反思目標、對系統回應進行批判性思考，以及後續對 AI 系統進行重新調整。我們假設系統可以透過在策略性時刻故意放慢對話速度來詢問問題、揭露假設或暫停，進而改善目標對齊、對使用者心智狀態建模，以及任務成功率。我們提出正向摩擦的本體論，並在多領域和具體目標導向的語料庫上收集專家的人類註解。針對這些語料庫的實驗，以及使用最先進系統進行的模擬互動，表明納入摩擦不僅能促進負責任的決策制定，還能增進機器對使用者信念和目標的理解，並提高任務成功率。", "author": "Mert İnan et.al.", "authors": "Mert İnan, Anthony Sicilia, Suvodip Dey, Vardhan Dongre, Tejas Srinivasan, Jesse Thomason, Gökhan Tür, Dilek Hakkani-Tür, Malihe Alikhani", "id": "2501.17348v1", "paper_url": "http://arxiv.org/abs/2501.17348v1", "repo": "null"}}