{"2503.13277": {"publish_time": "2025-03-17", "title": "Artificial Intelligence-Driven Prognostic Classification of COVID-19 Using Chest X-rays: A Deep Learning Approach", "paper_summary": "Background: The COVID-19 pandemic has overwhelmed healthcare systems,\nemphasizing the need for AI-driven tools to assist in rapid and accurate\npatient prognosis. Chest X-ray imaging is a widely available diagnostic tool,\nbut existing methods for prognosis classification lack scalability and\nefficiency. Objective: This study presents a high-accuracy deep learning model\nfor classifying COVID-19 severity (Mild, Moderate, and Severe) using Chest\nX-ray images, developed on Microsoft Azure Custom Vision. Methods: Using a\ndataset of 1,103 confirmed COVID-19 X-ray images from AIforCOVID, we trained\nand validated a deep learning model leveraging Convolutional Neural Networks\n(CNNs). The model was evaluated on an unseen dataset to measure accuracy,\nprecision, and recall. Results: Our model achieved an average accuracy of 97%,\nwith specificity of 99%, sensitivity of 87%, and an F1-score of 93.11%. When\nclassifying COVID-19 severity, the model achieved accuracies of 89.03% (Mild),\n95.77% (Moderate), and 81.16% (Severe). These results demonstrate the model's\npotential for real-world clinical applications, aiding in faster\ndecision-making and improved resource allocation. Conclusion: AI-driven\nprognosis classification using deep learning can significantly enhance COVID-19\npatient management, enabling early intervention and efficient triaging. Our\nstudy provides a scalable, high-accuracy AI framework for integrating deep\nlearning into routine clinical workflows. Future work should focus on expanding\ndatasets, external validation, and regulatory compliance to facilitate clinical\nadoption.", "paper_summary_zh": "背景：COVID-19 大流行使醫療系統不堪重負，凸顯了對 AI 驅動工具的需求，以協助快速準確地進行患者預後。胸部 X 光成像是廣泛使用的診斷工具，但現有的預後分類方法缺乏可擴展性和效率。目標：本研究提出了一個使用胸部 X 光影像對 COVID-19 嚴重程度（輕度、中度和重度）進行分類的高精度深度學習模型，該模型是在 Microsoft Azure Custom Vision 上開發的。方法：使用來自 AIforCOVID 的 1,103 張已確診 COVID-19 X 光影像的數據集，我們訓練並驗證了一個利用卷積神經網絡 (CNN) 的深度學習模型。該模型在一個未見數據集上進行了評估，以測量準確度、精確度和召回率。結果：我們的模型達到了 97% 的平均準確率，特異性為 99%，敏感性為 87%，F1 值為 93.11%。在對 COVID-19 嚴重程度進行分類時，該模型的準確率分別為 89.03%（輕度）、95.77%（中度）和 81.16%（重度）。這些結果證明了該模型在實際臨床應用中的潛力，有助於更快的決策和改進資源分配。結論：使用深度學習的 AI 驅動預後分類可以顯著增強 COVID-19患者管理，從而實現早期干預和有效的分流。我們的研究提供了一個可擴展的、高精度的 AI 框架，用於將深度學習整合到常規臨床工作流程中。未來的研究應側重於擴展數據集、外部驗證和法規遵從性，以促進臨床應用。\n", "author": "Alfred Simbun et.al.", "authors": "Alfred Simbun, Suresh Kumar", "id": "2503.13277v1", "paper_url": "http://arxiv.org/abs/2503.13277v1", "repo": "null"}}