{"2408.13135": {"publish_time": "2024-08-23", "title": "Deep Learning at the Intersection: Certified Robustness as a Tool for 3D Vision", "paper_summary": "This paper presents preliminary work on a novel connection between certified\nrobustness in machine learning and the modeling of 3D objects. We highlight an\nintriguing link between the Maximal Certified Radius (MCR) of a classifier\nrepresenting a space's occupancy and the space's Signed Distance Function\n(SDF). Leveraging this relationship, we propose to use the certification method\nof randomized smoothing (RS) to compute SDFs. Since RS' high computational cost\nprevents its practical usage as a way to compute SDFs, we propose an algorithm\nto efficiently run RS in low-dimensional applications, such as 3D space, by\nexpressing RS' fundamental operations as Gaussian smoothing on pre-computed\nvoxel grids. Our approach offers an innovative and practical tool to compute\nSDFs, validated through proof-of-concept experiments in novel view synthesis.\nThis paper bridges two previously disparate areas of machine learning, opening\nnew avenues for further exploration and potential cross-domain advancements.", "paper_summary_zh": "本文提出了一項關於機器學習中的認證穩健性與 3D 物件建模之間新穎關聯的初步研究。我們強調了表示空間佔用率的分類器的最大認證半徑 (MCR) 與空間的符號距離函數 (SDF) 之間的有趣連結。利用這種關係，我們建議使用隨機平滑 (RS) 的認證方法來計算 SDF。由於 RS 的高計算成本妨礙了其作為計算 SDF 的方式的實際使用，我們提出了一種演算法，透過將 RS 的基本運算表示為預先計算的體素網格上的高斯平滑，在低維度應用程式（例如 3D 空間）中有效執行 RS。我們的做法提供了一個創新且實用的工具來計算 SDF，並透過新穎視圖合成中的概念驗證實驗進行驗證。本文橋接了機器學習中兩個先前不同的領域，為進一步探索和潛在的跨領域進展開啟了新的途徑。", "author": "Gabriel Pérez S et.al.", "authors": "Gabriel Pérez S, Juan C. Pérez, Motasem Alfarra, Jesús Zarzar, Sara Rojas, Bernard Ghanem, Pablo Arbeláez", "id": "2408.13135v1", "paper_url": "http://arxiv.org/abs/2408.13135v1", "repo": "null"}}