{"2406.12775": {"publish_time": "2024-06-18", "title": "Hopping Too Late: Exploring the Limitations of Large Language Models on Multi-Hop Queries", "paper_summary": "Large language models (LLMs) can solve complex multi-step problems, but\nlittle is known about how these computations are implemented internally.\nMotivated by this, we study how LLMs answer multi-hop queries such as \"The\nspouse of the performer of Imagine is\". These queries require two information\nextraction steps: a latent one for resolving the first hop (\"the performer of\nImagine\") into the bridge entity (John Lennon), and one for resolving the\nsecond hop (\"the spouse of John Lennon\") into the target entity (Yoko Ono).\nUnderstanding how the latent step is computed internally is key to\nunderstanding the overall computation. By carefully analyzing the internal\ncomputations of transformer-based LLMs, we discover that the bridge entity is\nresolved in the early layers of the model. Then, only after this resolution,\nthe two-hop query is solved in the later layers. Because the second hop\ncommences in later layers, there could be cases where these layers no longer\nencode the necessary knowledge for correctly predicting the answer. Motivated\nby this, we propose a novel \"back-patching\" analysis method whereby a hidden\nrepresentation from a later layer is patched back to an earlier layer. We find\nthat in up to 57% of previously incorrect cases there exists a back-patch that\nresults in the correct generation of the answer, showing that the later layers\nindeed sometimes lack the needed functionality. Overall our methods and\nfindings open further opportunities for understanding and improving latent\nreasoning in transformer-based LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 能解決複雜的多步驟問題，但對於這些計算是如何在內部執行的，我們所知甚少。受此啟發，我們研究 LLM 如何回答多跳查詢，例如「Imagine 的表演者的配偶是」。這些查詢需要兩個資訊抽取步驟：一個潛在步驟，用於將第一跳（「Imagine 的表演者」）解析為橋接實體（約翰藍儂），另一個步驟，用於將第二跳（「約翰藍儂的配偶」）解析為目標實體（小野洋子）。了解潛在步驟如何在內部計算是了解整體計算的關鍵。透過仔細分析基於轉換器的 LLM 的內部計算，我們發現橋接實體是在模型的早期層解析的。然後，僅在這個解析之後，兩跳查詢才在後續層解析。由於第二跳在後續層開始，因此可能會出現這些層不再編碼正確預測答案所需知識的情況。受此啟發，我們提出了一種新穎的「反向修補」分析方法，藉此將後續層的隱藏表示修補回早期層。我們發現，在先前不正確的案例中，有高達 57% 的案例存在反向修補，這會導致正確產生答案，顯示後續層確實有時候缺乏所需的機能。總體而言，我們的各種方法和發現為進一步了解和改進基於轉換器的 LLM 中的潛在推理開闢了更多機會。", "author": "Eden Biran et.al.", "authors": "Eden Biran, Daniela Gottesman, Sohee Yang, Mor Geva, Amir Globerson", "id": "2406.12775v1", "paper_url": "http://arxiv.org/abs/2406.12775v1", "repo": "null"}}