{"2501.18733": {"publish_time": "2025-01-30", "title": "Integrating LMM Planners and 3D Skill Policies for Generalizable Manipulation", "paper_summary": "The recent advancements in visual reasoning capabilities of large multimodal\nmodels (LMMs) and the semantic enrichment of 3D feature fields have expanded\nthe horizons of robotic capabilities. These developments hold significant\npotential for bridging the gap between high-level reasoning from LMMs and\nlow-level control policies utilizing 3D feature fields. In this work, we\nintroduce LMM-3DP, a framework that can integrate LMM planners and 3D skill\nPolicies. Our approach consists of three key perspectives: high-level planning,\nlow-level control, and effective integration. For high-level planning, LMM-3DP\nsupports dynamic scene understanding for environment disturbances, a critic\nagent with self-feedback, history policy memorization, and reattempts after\nfailures. For low-level control, LMM-3DP utilizes a semantic-aware 3D feature\nfield for accurate manipulation. In aligning high-level and low-level control\nfor robot actions, language embeddings representing the high-level policy are\njointly attended with the 3D feature field in the 3D transformer for seamless\nintegration. We extensively evaluate our approach across multiple skills and\nlong-horizon tasks in a real-world kitchen environment. Our results show a\nsignificant 1.45x success rate increase in low-level control and an approximate\n1.5x improvement in high-level planning accuracy compared to LLM-based\nbaselines. Demo videos and an overview of LMM-3DP are available at\nhttps://lmm-3dp-release.github.io.", "paper_summary_zh": "<paragraph>大型多模態模型 (LMM) 的視覺推理能力和 3D 特徵場的語義豐富化最近的進展擴展了機器人能力的視野。這些發展具有巨大的潛力，可以彌合 LMM 的高階推理和利用 3D 特徵場的低階控制策略之間的差距。在這項工作中，我們介紹了 LMM-3DP，一個可以整合 LMM 計畫器和 3D 技能策略的框架。我們的做法包含三個關鍵觀點：高階規劃、低階控制和有效整合。對於高階規劃，LMM-3DP 支援環境干擾的動態場景理解、具有自我回饋的批評代理、歷史策略記憶以及失敗後的重試。對於低階控制，LMM-3DP 利用語義感知的 3D 特徵場進行準確的操縱。在調整機器人動作的高階和低階控制時，表示高階策略的語言嵌入與 3D 特徵場在 3D 轉換器中共同關注，以實現無縫整合。我們在真實世界的廚房環境中廣泛評估了我們的方法，涉及多項技能和長時程任務。我們的結果顯示，與基於 LLM 的基線相比，低階控制的成功率顯著提升了 1.45 倍，高階規劃準確度提升了約 1.5 倍。展示影片和 LMM-3DP 的概述可以在 https://lmm-3dp-release.github.io/ 取得。</paragraph>", "author": "Yuelei Li et.al.", "authors": "Yuelei Li, Ge Yan, Annabella Macaluso, Mazeyu Ji, Xueyan Zou, Xiaolong Wang", "id": "2501.18733v1", "paper_url": "http://arxiv.org/abs/2501.18733v1", "repo": "null"}}