{"2405.17913": {"publish_time": "2024-05-28", "title": "OV-DQUO: Open-Vocabulary DETR with Denoising Text Query Training and Open-World Unknown Objects Supervision", "paper_summary": "Open-Vocabulary Detection (OVD) aims to detect objects from novel categories\nbeyond the base categories on which the detector is trained. However, existing\nopen-vocabulary detectors trained on known category data tend to assign higher\nconfidence to trained categories and confuse novel categories with background.\nTo resolve this, we propose OV-DQUO, an \\textbf{O}pen-\\textbf{V}ocabulary DETR\nwith \\textbf{D}enoising text \\textbf{Q}uery training and open-world\n\\textbf{U}nknown \\textbf{O}bjects supervision. Specifically, we introduce a\nwildcard matching method that enables the detector to learn from pairs of\nunknown objects recognized by the open-world detector and text embeddings with\ngeneral semantics, mitigating the confidence bias between base and novel\ncategories. Additionally, we propose a denoising text query training strategy\nthat synthesizes additional noisy query-box pairs from open-world unknown\nobjects to trains the detector through contrastive learning, enhancing its\nability to distinguish novel objects from the background. We conducted\nextensive experiments on the challenging OV-COCO and OV-LVIS benchmarks,\nachieving new state-of-the-art results of 45.6 AP50 and 39.3 mAP on novel\ncategories respectively, without the need for additional training data. Models\nand code are released at https://github.com/xiaomoguhz/OV-DQUO", "paper_summary_zh": "開放詞彙偵測 (OVD) 旨在偵測訓練偵測器時基礎類別以外的新穎類別物件。然而，訓練於已知類別資料的現有開放詞彙偵測器傾向於將較高信心指派給訓練類別，並將新穎類別與背景混淆。為了解決這個問題，我們提出 OV-DQUO，一個具有去噪文字查詢訓練和開放世界未知物件監督的開放詞彙 DETR。具體來說，我們引入了一個萬用字元比對方法，讓偵測器能夠從開放世界偵測器辨識出的未知物件對和具有一般語意的文字嵌入學習，減輕基礎和新穎類別之間的信心偏差。此外，我們提出了一個去噪文字查詢訓練策略，該策略從開放世界未知物件合成額外的雜訊查詢方塊對，以透過對比學習訓練偵測器，增強其將新穎物件與背景區分開來的能力。我們在具有挑戰性的 OV-COCO 和 OV-LVIS 基準上進行了廣泛的實驗，分別在新的類別上達到了 45.6 AP50 和 39.3 mAP 的最新技術水準，而無需額外的訓練資料。模型和程式碼已在 https://github.com/xiaomoguhz/OV-DQUO 發布", "author": "Junjie Wang et.al.", "authors": "Junjie Wang, Bin Chen, Bin Kang, Yulin Li, YiChi Chen, Weizhi Xian, Huifeng Chang", "id": "2405.17913v1", "paper_url": "http://arxiv.org/abs/2405.17913v1", "repo": "https://github.com/xiaomoguhz/ov-dquo"}}