{"2501.08102": {"publish_time": "2025-01-14", "title": "Consistency of Responses and Continuations Generated by Large Language Models on Social Media", "paper_summary": "Large Language Models (LLMs) demonstrate remarkable capabilities in text\ngeneration, yet their emotional consistency and semantic coherence in social\nmedia contexts remain insufficiently understood. This study investigates how\nLLMs handle emotional content and maintain semantic relationships through\ncontinuation and response tasks using two open-source models: Gemma and Llama.\nBy analyzing climate change discussions from Twitter and Reddit, we examine\nemotional transitions, intensity patterns, and semantic similarity between\nhuman-authored and LLM-generated content. Our findings reveal that while both\nmodels maintain high semantic coherence, they exhibit distinct emotional\npatterns: Gemma shows a tendency toward negative emotion amplification,\nparticularly anger, while maintaining certain positive emotions like optimism.\nLlama demonstrates superior emotional preservation across a broader spectrum of\naffects. Both models systematically generate responses with attenuated\nemotional intensity compared to human-authored content and show a bias toward\npositive emotions in response tasks. Additionally, both models maintain strong\nsemantic similarity with original texts, though performance varies between\ncontinuation and response tasks. These findings provide insights into LLMs'\nemotional and semantic processing capabilities, with implications for their\ndeployment in social media contexts and human-AI interaction design.", "paper_summary_zh": "大型語言模型 (LLM) 在文本生成方面展現出卓越的能力，但在社交媒體情境中的情緒一致性和語義連貫性仍有待進一步了解。本研究探討 LLM 如何透過使用兩個開源模型：Gemma 和 Llama，在延續和回應任務中處理情緒內容並維持語義關係。透過分析來自 Twitter 和 Reddit 的氣候變遷討論，我們檢視了人類撰寫和 LLM 生成的內容之間的情緒轉換、強度模式和語義相似性。我們的研究結果顯示，儘管這兩個模型都維持了高度的語義連貫性，但它們表現出截然不同的情緒模式：Gemma 傾向於放大負面情緒，尤其是憤怒，同時維持某些積極情緒，例如樂觀。Llama 則展現出在更廣泛的情緒範圍內維持情緒的優越性。這兩個模型都系統性地產生與人類撰寫內容相比，情緒強度較弱的回應，並在回應任務中表現出偏好正向情緒。此外，這兩個模型都與原始文字維持強烈的語義相似性，儘管在延續和回應任務之間的表現有所不同。這些研究結果提供了對 LLM 情緒和語義處理能力的見解，並對其在社交媒體情境中的部署和人機互動設計產生影響。", "author": "Wenlu Fan et.al.", "authors": "Wenlu Fan, Yuqi Zhu, Chenyang Wang, Bin Wang, Wentao Xu", "id": "2501.08102v1", "paper_url": "http://arxiv.org/abs/2501.08102v1", "repo": "null"}}