{"2405.05572": {"publish_time": "2024-05-09", "title": "From Human Judgements to Predictive Models: Unravelling Acceptability in Code-Mixed Sentences", "paper_summary": "Current computational approaches for analysing or generating code-mixed\nsentences do not explicitly model \"naturalness\" or \"acceptability\" of\ncode-mixed sentences, but rely on training corpora to reflect distribution of\nacceptable code-mixed sentences. Modelling human judgement for the\nacceptability of code-mixed text can help in distinguishing natural code-mixed\ntext and enable quality-controlled generation of code-mixed text. To this end,\nwe construct Cline - a dataset containing human acceptability judgements for\nEnglish-Hindi (en-hi) code-mixed text. Cline is the largest of its kind with\n16,642 sentences, consisting of samples sourced from two sources: synthetically\ngenerated code-mixed text and samples collected from online social media. Our\nanalysis establishes that popular code-mixing metrics such as CMI, Number of\nSwitch Points, Burstines, which are used to filter/curate/compare code-mixed\ncorpora have low correlation with human acceptability judgements, underlining\nthe necessity of our dataset. Experiments using Cline demonstrate that simple\nMultilayer Perceptron (MLP) models trained solely on code-mixing metrics are\noutperformed by fine-tuned pre-trained Multilingual Large Language Models\n(MLLMs). Specifically, XLM-Roberta and Bernice outperform IndicBERT across\ndifferent configurations in challenging data settings. Comparison with\nChatGPT's zero and fewshot capabilities shows that MLLMs fine-tuned on larger\ndata outperform ChatGPT, providing scope for improvement in code-mixed tasks.\nZero-shot transfer from English-Hindi to English-Telugu acceptability judgments\nusing our model checkpoints proves superior to random baselines, enabling\napplication to other code-mixed language pairs and providing further avenues of\nresearch. We publicly release our human-annotated dataset, trained checkpoints,\ncode-mix corpus, and code for data generation and model training.", "paper_summary_zh": "<paragraph>目前的計算方法用於分析或生成混合語言句子，並未明確模擬混合語言句子的「自然性」或「可接受性」，而是依賴訓練語料庫來反映可接受混合語言句子的分佈。模擬人類對混合語言文字可接受性的判斷，有助於區分自然的混合語言文字，並能有品質控管地生成混合語言文字。為此，我們建構了 Cline，一個包含人類對英語-印地語 (en-hi) 混合語言文字可接受性判斷的資料集。Cline 是同類資料集中規模最大的，包含 16,642 個句子，由兩個來源的樣本組成：合成產生的混合語言文字和從線上社群媒體收集的樣本。我們的分析確立了流行的混合語言指標，例如 CMI、切換點數、Burstines，這些指標用於過濾/整理/比較混合語言語料庫，與人類的可接受性判斷相關性很低，強調了我們資料集的必要性。使用 Cline 的實驗證明，僅根據混合語言指標訓練的簡單多層感知器 (MLP) 模型，其表現不如微調後的預訓練多語言大型語言模型 (MLLM)。具體來說，XLM-Roberta 和 Bernice 在具有挑戰性的資料設定中，在不同的配置中都優於 IndicBERT。與 ChatGPT 的零次學習和少次學習能力的比較顯示，經過較大資料微調的 MLLM 優於 ChatGPT，為混合語言任務的改進提供了空間。使用我們的模型檢查點，從英語-印地語到英語-泰盧固語的可接受性判斷的零次學習轉移，證明優於隨機基準，能夠應用於其他混合語言語言對，並提供進一步的研究途徑。我們公開發布我們的人工標註資料集、訓練檢查點、混合語言語料庫，以及用於資料生成和模型訓練的程式碼。</paragraph>", "author": "Prashant Kodali et.al.", "authors": "Prashant Kodali, Anmol Goel, Likhith Asapu, Vamshi Krishna Bonagiri, Anirudh Govil, Monojit Choudhury, Manish Shrivastava, Ponnurangam Kumaraguru", "id": "2405.05572v1", "paper_url": "http://arxiv.org/abs/2405.05572v1", "repo": "null"}}