{"2407.16174": {"publish_time": "2024-07-23", "title": "Pixel Embedding: Fully Quantized Convolutional Neural Network with Differentiable Lookup Table", "paper_summary": "By quantizing network weights and activations to low bitwidth, we can obtain\nhardware-friendly and energy-efficient networks. However, existing quantization\ntechniques utilizing the straight-through estimator and piecewise constant\nfunctions face the issue of how to represent originally high-bit input data\nwith low-bit values. To fully quantize deep neural networks, we propose pixel\nembedding, which replaces each float-valued input pixel with a vector of\nquantized values by using a lookup table. The lookup table or low-bit\nrepresentation of pixels is differentiable and trainable by backpropagation.\nSuch replacement of inputs with vectors is similar to word embedding in the\nnatural language processing field. Experiments on ImageNet and CIFAR-100 show\nthat pixel embedding reduces the top-5 error gap caused by quantizing the\nfloating points at the first layer to only 1% for the ImageNet dataset, and the\ntop-1 error gap caused by quantizing first and last layers to slightly over 1%\nfor the CIFAR-100 dataset. The usefulness of pixel embedding is further\ndemonstrated by inference time measurements, which demonstrate over 1.7 times\nspeedup compared to floating point precision first layer.", "paper_summary_zh": "透過將網路權重和啟用量化為低位元寬度，我們可以獲得硬體友善且節能的網路。然而，現有的量化技術利用直通估計器和分段常數函數，面臨如何用低位元值表示原本高位元輸入資料的問題。為了完全量化深度神經網路，我們提出像素嵌入，它用查找表將每個浮點值輸入像素替換為量化值的向量。查找表或像素的低位元表示是可微分的，並可透過反向傳播進行訓練。這種用向量替換輸入的方式類似於自然語言處理領域中的詞嵌入。在 ImageNet 和 CIFAR-100 上的實驗顯示，像素嵌入將 ImageNet 資料集第一層浮點數位量化造成的 top-5 錯誤差距減少到僅 1%，而對於 CIFAR-100 資料集，將第一層和最後一層量化造成的 top-1 錯誤差距減少到略高於 1%。像素嵌入的效用進一步透過推論時間測量得到證明，與浮點精度第一層相比，速度提升超過 1.7 倍。", "author": "Hiroyuki Tokunaga et.al.", "authors": "Hiroyuki Tokunaga, Joel Nicholls, Daria Vazhenina, Atsunori Kanemura", "id": "2407.16174v1", "paper_url": "http://arxiv.org/abs/2407.16174v1", "repo": "null"}}