{"2412.05255": {"publish_time": "2024-12-06", "title": "TeamCraft: A Benchmark for Multi-Modal Multi-Agent Systems in Minecraft", "paper_summary": "Collaboration is a cornerstone of society. In the real world, human teammates\nmake use of multi-sensory data to tackle challenging tasks in ever-changing\nenvironments. It is essential for embodied agents collaborating in\nvisually-rich environments replete with dynamic interactions to understand\nmulti-modal observations and task specifications. To evaluate the performance\nof generalizable multi-modal collaborative agents, we present TeamCraft, a\nmulti-modal multi-agent benchmark built on top of the open-world video game\nMinecraft. The benchmark features 55,000 task variants specified by multi-modal\nprompts, procedurally-generated expert demonstrations for imitation learning,\nand carefully designed protocols to evaluate model generalization capabilities.\nWe also perform extensive analyses to better understand the limitations and\nstrengths of existing approaches. Our results indicate that existing models\ncontinue to face significant challenges in generalizing to novel goals, scenes,\nand unseen numbers of agents. These findings underscore the need for further\nresearch in this area. The TeamCraft platform and dataset are publicly\navailable at https://github.com/teamcraft-bench/teamcraft.", "paper_summary_zh": "協作是社會的基石。在現實世界中，人類隊友利用多感官數據來應對不斷變化的環境中的具有挑戰性的任務。對於在充滿動態交互作用的視覺豐富環境中協作的具體代理而言，理解多模式觀察和任務規範至關重要。為了評估可概括多模式協作代理的性能，我們提出了 TeamCraft，這是一個建立在開放世界視頻遊戲 Minecraft 之上的多模式多代理基準。該基準測試具有 55,000 個由多模式提示指定的任務變體、用於模仿學習的程序生成專家演示，以及精心設計的協議來評估模型泛化能力。我們還進行了廣泛的分析，以更好地了解現有方法的局限性和優勢。我們的結果表明，現有模型在概括到新的目標、場景和未見的代理數量方面仍然面臨重大挑戰。這些發現強調了進一步研究這一領域的必要性。TeamCraft 平台和數據集可在 https://github.com/teamcraft-bench/teamcraft 公開獲得。", "author": "Qian Long et.al.", "authors": "Qian Long, Zhi Li, Ran Gong, Ying Nian Wu, Demetri Terzopoulos, Xiaofeng Gao", "id": "2412.05255v1", "paper_url": "http://arxiv.org/abs/2412.05255v1", "repo": "https://github.com/teamcraft-bench/teamcraft"}}