{"2408.00555": {"publish_time": "2024-08-01", "title": "Alleviating Hallucination in Large Vision-Language Models with Active Retrieval Augmentation", "paper_summary": "Despite the remarkable ability of large vision-language models (LVLMs) in\nimage comprehension, these models frequently generate plausible yet factually\nincorrect responses, a phenomenon known as hallucination.Recently, in large\nlanguage models (LLMs), augmenting LLMs by retrieving information from external\nknowledge resources has been proven as a promising solution to mitigate\nhallucinations.However, the retrieval augmentation in LVLM significantly lags\nbehind the widespread applications of LVLM. Moreover, when transferred to\naugmenting LVLMs, sometimes the hallucination degree of the model is even\nexacerbated.Motivated by the research gap and counter-intuitive phenomenon, we\nintroduce a novel framework, the Active Retrieval-Augmented large\nvision-language model (ARA), specifically designed to address hallucinations by\nincorporating three critical dimensions: (i) dissecting the retrieval targets\nbased on the inherent hierarchical structures of images. (ii) pinpointing the\nmost effective retrieval methods and filtering out the reliable retrieval\nresults. (iii) timing the retrieval process to coincide with episodes of low\ncertainty, while circumventing unnecessary retrieval during periods of high\ncertainty. To assess the capability of our proposed ARA model in reducing\nhallucination, we employ three widely used LVLM models (LLaVA-1.5, Qwen-VL, and\nmPLUG-Owl2) across four benchmarks. Our empirical observations suggest that by\nutilizing fitting retrieval mechanisms and timing the retrieval judiciously, we\ncan effectively mitigate the hallucination problem. We hope that this study can\nprovide deeper insights into how to adapt the retrieval augmentation to LVLMs\nfor reducing hallucinations with more effective retrieval and minimal retrieval\noccurrences.", "paper_summary_zh": "儘管大型視覺語言模型 (LVLMs) 在影像理解方面擁有非凡能力，但這些模型經常產生看似合理卻事實上不正確的回應，這種現象稱為幻覺。最近，在大型語言模型 (LLMs) 中，透過從外部知識資源擷取資訊來擴充 LLM 已被證明是一種減輕幻覺的有前途的解決方案。然而，LVLM 中的擷取擴充顯著落後於 LVLM 的廣泛應用。此外，當轉移到擴充 LVLMs 時，有時模型的幻覺程度甚至會加劇。在研究差距和反直覺現象的激勵下，我們引入了新穎的架構，主動擷取擴充大型視覺語言模型 (ARA)，專門設計用於透過納入三個關鍵面向來解決幻覺問題：(i) 根據影像的內在階層結構剖析擷取目標。(ii) 精確找出最有效的擷取方法，並過濾出可靠的擷取結果。(iii) 安排擷取流程與低確定性事件一致，同時在高確定性期間迴避不必要的擷取。為了評估我們提出的 ARA 模型在減少幻覺方面的能力，我們在四個基準測試中採用了三個廣泛使用的 LVLM 模型 (LLaVA-1.5、Qwen-VL 和 mPLUG-Owl2)。我們的經驗觀察表明，透過善用合適的擷取機制並明智安排擷取時機，我們可以有效減輕幻覺問題。我們希望這項研究可以提供更深入的見解，說明如何調整擷取擴充以適用於 LVLMs，以更有效的擷取和最少的擷取發生次數來減少幻覺。", "author": "Xiaoye Qu et.al.", "authors": "Xiaoye Qu, Qiyuan Chen, Wei Wei, Jishuo Sun, Jianfeng Dong", "id": "2408.00555v1", "paper_url": "http://arxiv.org/abs/2408.00555v1", "repo": "null"}}