{"2502.11763": {"publish_time": "2025-02-17", "title": "Lightweight Deepfake Detection Based on Multi-Feature Fusion", "paper_summary": "Deepfake technology utilizes deep learning based face manipulation techniques\nto seamlessly replace faces in videos creating highly realistic but\nartificially generated content. Although this technology has beneficial\napplications in media and entertainment misuse of its capabilities may lead to\nserious risks including identity theft cyberbullying and false information. The\nintegration of DL with visual cognition has resulted in important technological\nimprovements particularly in addressing privacy risks caused by artificially\ngenerated deepfake images on digital media platforms. In this study we propose\nan efficient and lightweight method for detecting deepfake images and videos\nmaking it suitable for devices with limited computational resources. In order\nto reduce the computational burden usually associated with DL models our method\nintegrates machine learning classifiers in combination with keyframing\napproaches and texture analysis. Moreover the features extracted with a\nhistogram of oriented gradients (HOG) local binary pattern (LBP) and KAZE bands\nwere integrated to evaluate using random forest extreme gradient boosting extra\ntrees and support vector classifier algorithms. Our findings show a\nfeature-level fusion of HOG LBP and KAZE features improves accuracy to 92% and\n96% on FaceForensics++ and Celeb-DFv2 respectively.", "paper_summary_zh": "深度偽造技術利用基於深度學習的換臉技術，可無縫替換影片中的臉孔，創造出高度逼真但人工產生的內容。儘管這項技術在媒體和娛樂方面有益，但若誤用其功能可能會導致嚴重的風險，包括身分盜用、網路霸凌和虛假訊息。深度學習與視覺認知的整合已帶來重要的技術進步，特別是在解決由數位媒體平台上的人工深度偽造影像所造成的隱私風險方面。在本研究中，我們提出了一種用於偵測深度偽造影像和影片的有效且輕量級的方法，使其適用於運算資源有限的裝置。為了降低通常與深度學習模型相關的運算負擔，我們的做法結合了機器學習分類器、關鍵影格方法和紋理分析。此外，我們整合了使用方向梯度直方圖 (HOG)、局部二進位模式 (LBP) 和 KAZE 頻段所萃取出的特徵，並使用隨機森林、極端梯度提升、額外樹木和支援向量分類器演算法進行評估。我們的研究結果顯示，HOG、LBP 和 KAZE 特徵的層級融合將準確度提升至 92%，分別在 FaceForensics++ 和 Celeb-DFv2 上達到 96%。", "author": "Siddiqui Muhammad Yasir et.al.", "authors": "Siddiqui Muhammad Yasir, Hyun Kim", "id": "2502.11763v1", "paper_url": "http://arxiv.org/abs/2502.11763v1", "repo": "null"}}