{"2408.16119": {"publish_time": "2024-08-28", "title": "Data Formulator 2: Iteratively Creating Rich Visualizations with AI", "paper_summary": "To create rich visualizations, data analysts often need to iterate back and\nforth among data processing and chart specification to achieve their goals. To\nachieve this, analysts need not only proficiency in data transformation and\nvisualization tools but also efforts to manage the branching history consisting\nof many different versions of data and charts. Recent LLM-powered AI systems\nhave greatly improved visualization authoring experiences, for example by\nmitigating manual data transformation barriers via LLMs' code generation\nability. However, these systems do not work well for iterative visualization\nauthoring, because they often require analysts to provide, in a single turn, a\ntext-only prompt that fully describes the complex visualization task to be\nperformed, which is unrealistic to both users and models in many cases. In this\npaper, we present Data Formulator 2, an LLM-powered visualization system to\naddress these challenges. With Data Formulator 2, users describe their\nvisualization intent with blended UI and natural language inputs, and data\ntransformation are delegated to AI. To support iteration, Data Formulator 2\nlets users navigate their iteration history and reuse previous designs towards\nnew ones so that they don't need to start from scratch every time. In a user\nstudy with eight participants, we observed that Data Formulator 2 allows\nparticipants to develop their own iteration strategies to complete challenging\ndata exploration sessions.", "paper_summary_zh": "為了建立豐富的視覺化效果，資料分析師經常需要在資料處理和圖表規格中反覆運算，才能達成目標。為了達成此目標，分析師不僅需要熟練使用資料轉換和視覺化工具，還需要努力管理包含許多不同資料和圖表版本的分支記錄。最近由 LLM 驅動的 AI 系統大幅改善了視覺化創作體驗，例如透過 LLM 的程式碼產生能力來減輕手動資料轉換的障礙。然而，這些系統並不適用於反覆的視覺化創作，因為它們通常要求分析師一次提供一個純文字提示，完整描述要執行的複雜視覺化任務，在許多情況下對使用者和模型來說這是不切實際的。在本文中，我們提出 Data Formulator 2，一個由 LLM 驅動的視覺化系統，用來解決這些挑戰。使用 Data Formulator 2，使用者可以使用混合式 UI 和自然語言輸入來描述其視覺化意圖，而資料轉換則委派給 AI。為了支援反覆運算，Data Formulator 2 讓使用者可以瀏覽其反覆運算記錄，並將先前的設計重新用於新的設計，這樣他們就不必每次都從頭開始。在一個有八位參與者的使用者研究中，我們觀察到 Data Formulator 2 讓參與者可以開發自己的反覆運算策略，以完成具有挑戰性的資料探索工作階段。", "author": "Chenglong Wang et.al.", "authors": "Chenglong Wang, Bongshin Lee, Steven Drucker, Dan Marshall, Jianfeng Gao", "id": "2408.16119v1", "paper_url": "http://arxiv.org/abs/2408.16119v1", "repo": "https://github.com/microsoft/data-formulator"}}