{"2410.17546": {"publish_time": "2024-10-23", "title": "ProtoLens: Advancing Prototype Learning for Fine-Grained Interpretability in Text Classification", "paper_summary": "Deep neural networks have achieved remarkable performance in various\ntext-based tasks but often lack interpretability, making them less suitable for\napplications where transparency is critical. To address this, we propose\nProtoLens, a novel prototype-based model that provides fine-grained,\nsub-sentence level interpretability for text classification. ProtoLens uses a\nPrototype-aware Span Extraction module to identify relevant text spans\nassociated with learned prototypes and a Prototype Alignment mechanism to\nensure prototypes are semantically meaningful throughout training. By aligning\nthe prototype embeddings with human-understandable examples, ProtoLens provides\ninterpretable predictions while maintaining competitive accuracy. Extensive\nexperiments demonstrate that ProtoLens outperforms both prototype-based and\nnon-interpretable baselines on multiple text classification benchmarks. Code\nand data are available at\n\\url{https://anonymous.4open.science/r/ProtoLens-CE0B/}.", "paper_summary_zh": "深度神经網路在各種基於文字的任務中都取得了顯著的表現，但通常缺乏可解釋性，這使得它們不太適合於透明度至關重要的應用。為了解決這個問題，我們提出了 ProtoLens，這是一個新穎的基於原型的模型，它為文字分類提供了細粒度的子句級可解釋性。ProtoLens 使用一個原型感知跨度提取模組來識別與學習原型相關的相關文字跨度，並使用一個原型對齊機制來確保原型在整個訓練過程中具有語義意義。通過將原型嵌入與人類可理解的範例對齊，ProtoLens 提供了可解釋的預測，同時保持了競爭優勢的準確性。大量的實驗表明，ProtoLens 在多個文字分類基準上優於基於原型和不可解釋的基準線。程式碼和資料可於\n\\url{https://anonymous.4open.science/r/ProtoLens-CE0B/} 取得。", "author": "Bowen Wei et.al.", "authors": "Bowen Wei, Ziwei Zhu", "id": "2410.17546v1", "paper_url": "http://arxiv.org/abs/2410.17546v1", "repo": "null"}}