{"2408.07003": {"publish_time": "2024-08-13", "title": "Generative AI for automatic topic labelling", "paper_summary": "Topic Modeling has become a prominent tool for the study of scientific\nfields, as they allow for a large scale interpretation of research trends.\nNevertheless, the output of these models is structured as a list of keywords\nwhich requires a manual interpretation for the labelling. This paper proposes\nto assess the reliability of three LLMs, namely flan, GPT-4o, and GPT-4 mini\nfor topic labelling. Drawing on previous research leveraging BERTopic, we\ngenerate topics from a dataset of all the scientific articles (n=34,797)\nauthored by all biology professors in Switzerland (n=465) between 2008 and\n2020, as recorded in the Web of Science database. We assess the output of the\nthree models both quantitatively and qualitatively and find that, first, both\nGPT models are capable of accurately and precisely label topics from the\nmodels' output keywords. Second, 3-word labels are preferable to grasp the\ncomplexity of research topics.", "paper_summary_zh": "主題建模已成為科學領域研究的顯著工具，因為它們允許大規模解釋研究趨勢。儘管如此，這些模型的輸出被結構化為關鍵字列表，需要手動解釋才能標籤。本文提出評估三個 LLM 的可靠性，即 flan、GPT-4o 和 GPT-4 mini，用於主題標籤。利用利用 BERTopic 的先前研究，我們從所有生物學教授在瑞士（n=465）於 2008 年至 2020 年間撰寫的所有科學文章（n=34,797）的數據集中生成主題，如 Web of Science 數據庫中所記錄。我們對這三個模型的輸出進行定量和定性評估，發現首先，兩個 GPT 模型都能够準確且精確地標記模型輸出關鍵字的主題。其次，3 字標籤更適合掌握研究主題的複雜性。", "author": "Diego Kozlowski et.al.", "authors": "Diego Kozlowski, Carolina Pradier, Pierre Benz", "id": "2408.07003v1", "paper_url": "http://arxiv.org/abs/2408.07003v1", "repo": "null"}}