{"2408.10086": {"publish_time": "2024-08-19", "title": "ARMADA: Attribute-Based Multimodal Data Augmentation", "paper_summary": "In Multimodal Language Models (MLMs), the cost of manually annotating\nhigh-quality image-text pair data for fine-tuning and alignment is extremely\nhigh. While existing multimodal data augmentation frameworks propose ways to\naugment image-text pairs, they either suffer from semantic inconsistency\nbetween texts and images, or generate unrealistic images, causing knowledge gap\nwith real world examples. To address these issues, we propose Attribute-based\nMultimodal Data Augmentation (ARMADA), a novel multimodal data augmentation\nmethod via knowledge-guided manipulation of visual attributes of the mentioned\nentities. Specifically, we extract entities and their visual attributes from\nthe original text data, then search for alternative values for the visual\nattributes under the guidance of knowledge bases (KBs) and large language\nmodels (LLMs). We then utilize an image-editing model to edit the images with\nthe extracted attributes. ARMADA is a novel multimodal data generation\nframework that: (i) extracts knowledge-grounded attributes from symbolic KBs\nfor semantically consistent yet distinctive image-text pair generation, (ii)\ngenerates visually similar images of disparate categories using neighboring\nentities in the KB hierarchy, and (iii) uses the commonsense knowledge of LLMs\nto modulate auxiliary visual attributes such as backgrounds for more robust\nrepresentation of original entities. Our empirical results over four downstream\ntasks demonstrate the efficacy of our framework to produce high-quality data\nand enhance the model performance. This also highlights the need to leverage\nexternal knowledge proxies for enhanced interpretability and real-world\ngrounding.", "paper_summary_zh": "在多模態語言模型 (MLM) 中，人工標註高品質影像文字配對資料以進行微調和比對的成本極高。現有的多模態資料擴充架構雖然提出擴充影像文字配對的方法，但它們不是會造成文字和影像之間的語意不一致，就是會產生不切實際的影像，導致與真實世界的範例產生知識鴻溝。為了解決這些問題，我們提出基於屬性的多模態資料擴充 (ARMADA)，這是一種透過引導知識操作提及實體的視覺屬性，來進行多模態資料擴充的新方法。具體來說，我們從原始文字資料中萃取實體及其視覺屬性，然後在知識庫 (KB) 和大型語言模型 (LLM) 的指導下，為視覺屬性尋找替代值。接著，我們利用影像編輯模型來編輯具有萃取屬性的影像。ARMADA 是一個新穎的多模態資料產生架構，它：(i) 從符號 KB 中萃取基於知識的屬性，以產生語意一致但獨特的影像文字配對，(ii) 使用 KB 層級中的鄰近實體，產生視覺上相似的不同類別影像，以及 (iii) 使用 LLM 的常識知識來調整輔助視覺屬性，例如背景，以更穩健地表示原始實體。我們在四個下游任務中的實證結果，證明了我們的架構在產生高品質資料和增強模型效能方面的效力。這也突顯了利用外部知識代理來增強可解釋性和真實世界基礎的需求。", "author": "Xiaomeng Jin et.al.", "authors": "Xiaomeng Jin, Jeonghwan Kim, Yu Zhou, Kuan-Hao Huang, Te-Lin Wu, Nanyun Peng, Heng Ji", "id": "2408.10086v1", "paper_url": "http://arxiv.org/abs/2408.10086v1", "repo": "null"}}