{"2408.04556": {"publish_time": "2024-08-08", "title": "Bias-Aware Low-Rank Adaptation: Mitigating Catastrophic Inheritance of Large Language Models", "paper_summary": "Large language models (LLMs) have exhibited remarkable proficiency across a\ndiverse array of natural language processing (NLP) tasks. However, adapting\nLLMs to downstream applications typically necessitates computationally\nintensive and memory-demanding fine-tuning procedures. To mitigate these\nburdens, parameter-efficient fine-tuning (PEFT) techniques have emerged as a\npromising approach to tailor LLMs with minimal computational overhead. While\nPEFT methods offer substantial advantages, they do not fully address the\npervasive issue of bias propagation from pre-training data. In this work, we\nintroduce Bias-Aware Low-Rank Adaptation (BA-LoRA), a novel PEFT method\ndesigned to counteract bias inheritance. BA-LoRA incorporates three distinct\nregularization terms: (1) consistency regularizer, (2) diversity regularizer,\nand (3) singular vector decomposition regularizer. These regularizers\ncollectively aim to improve the generative models' consistency, diversity, and\ngeneralization capabilities during the fine-tuning process. Through extensive\nexperiments on a variety of natural language understanding (NLU) and natural\nlanguage generation (NLG) tasks, employing prominent LLMs such as LLaMA,\nMistral, and Gemma, we demonstrate that BA-LoRA surpasses the performance of\nLoRA and its state-of-the-art variants. Moreover, our method effectively\nmitigates the deleterious effects of pre-training bias, leading to more\nreliable and robust model outputs. The code is available at\nhttps://github.com/cyp-jlu-ai/BA-LoRA.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種自然語言處理 (NLP) 任務中展現出卓越的能力。然而，要將 LLM 調整到下游應用程式通常需要計算密集且需要大量記憶體的微調程序。為了減輕這些負擔，參數有效微調 (PEFT) 技術已成為一種有前途的方法，可針對 LLM 進行客製化，且計算負擔最小。儘管 PEFT 方法具有顯著的優勢，但它們並未完全解決預訓練資料中偏差傳播的普遍問題。在這項工作中，我們引入了具備偏差感知能力的低秩適應 (BA-LoRA)，這是一種新穎的 PEFT 方法，旨在對抗偏差遺傳。BA-LoRA 結合了三個不同的正則化項目：(1) 一致性正則化器、(2) 多樣性正則化器，以及 (3) 奇異值分解正則化器。這些正則化器共同旨在改善生成模型在微調過程中的一致性、多樣性和泛化能力。透過在各種自然語言理解 (NLU) 和自然語言生成 (NLG) 任務上進行廣泛的實驗，採用 LLaMA、Mistral 和 Gemma 等著名的 LLM，我們證明了 BA-LoRA 超越了 LoRA 及其最先進的變體的效能。此外，我們的模型有效減輕了預訓練偏差的有害影響，進而產生更可靠且穩健的模型輸出。程式碼可在 https://github.com/cyp-jlu-ai/BA-LoRA 取得。", "author": "Yupeng Chang et.al.", "authors": "Yupeng Chang, Yi Chang, Yuan Wu", "id": "2408.04556v1", "paper_url": "http://arxiv.org/abs/2408.04556v1", "repo": "https://github.com/cyp-jlu-ai/ba-lora"}}