{"2407.15281": {"publish_time": "2024-07-21", "title": "SynCPKL: Harnessing LLMs to Generate Synthetic Data for Commonsense Persona Knowledge Linking", "paper_summary": "Understanding rich dialogues often requires NLP systems to access relevant\ncommonsense persona knowledge, but retrieving this knowledge is challenging due\nto complex contexts and the implicit nature of commonsense. This paper presents\nour approach to the Commonsense Persona Knowledge Linking (CPKL) challenge,\naddressing the critical need for integrating persona and commonsense knowledge\nin open-domain dialogue systems. We introduce SynCPKL Pipeline, a pipeline that\nleverages Large Language Models to generate high-quality synthetic datasets for\ntraining commonsense persona knowledge linkers. To demonstrate the efficacy of\nour approach, we present SynCPKL, a new dataset specifically designed for this\ntask. Our experiments validate the effectiveness of SynCPKL for training\ncommonsense persona knowledge linkers. Additionally, our top-performing model,\nDerberta-SynCPKL, secured first place in the CPKL challenge by a 16%\nimprovement in F1 score. We released both SynCPKL and Derberta-SynCPKL at\nhttps://github.com/irislin1006/CPKL.", "paper_summary_zh": "理解豐富的對話通常需要 NLP 系統存取相關的常識人物知識，但由於複雜的脈絡和常識的隱含性質，因此擷取此知識具有挑戰性。本文介紹我們對常識人物知識連結 (CPKL) 挑戰的方法，解決在開放領域對話系統中整合人物和常識知識的關鍵需求。我們介紹 SynCPKL 管線，這是一個利用大型語言模型為訓練常識人物知識連結器產生高品質合成資料集的管線。為了證明我們方法的效能，我們提出 SynCPKL，這是一個專門為此任務設計的新資料集。我們的實驗驗證了 SynCPKL 在訓練常識人物知識連結器方面的效能。此外，我們表現最佳的模型 Derberta-SynCPKL 在 CPKL 挑戰中獲得第一名，F1 分數提升了 16%。我們在 https://github.com/irislin1006/CPKL 發布了 SynCPKL 和 Derberta-SynCPKL。", "author": "Kuan-Yen Lin et.al.", "authors": "Kuan-Yen Lin", "id": "2407.15281v1", "paper_url": "http://arxiv.org/abs/2407.15281v1", "repo": "https://github.com/irislin1006/cpkl"}}