{"2408.05147": {"publish_time": "2024-08-09", "title": "Gemma Scope: Open Sparse Autoencoders Everywhere All At Once on Gemma 2", "paper_summary": "Sparse autoencoders (SAEs) are an unsupervised method for learning a sparse\ndecomposition of a neural network's latent representations into seemingly\ninterpretable features. Despite recent excitement about their potential,\nresearch applications outside of industry are limited by the high cost of\ntraining a comprehensive suite of SAEs. In this work, we introduce Gemma Scope,\nan open suite of JumpReLU SAEs trained on all layers and sub-layers of Gemma 2\n2B and 9B and select layers of Gemma 2 27B base models. We primarily train SAEs\non the Gemma 2 pre-trained models, but additionally release SAEs trained on\ninstruction-tuned Gemma 2 9B for comparison. We evaluate the quality of each\nSAE on standard metrics and release these results. We hope that by releasing\nthese SAE weights, we can help make more ambitious safety and interpretability\nresearch easier for the community. Weights and a tutorial can be found at\nhttps://huggingface.co/google/gemma-scope and an interactive demo can be found\nat https://www.neuronpedia.org/gemma-scope", "paper_summary_zh": "稀疏自動編碼器 (SAE) 是一種無監督方法，用於學習神經網路潛在表示的稀疏分解，成為看似可解釋的功能。儘管最近對其潛力感到興奮，但產業外的研究應用受到訓練一套全面的 SAE 的高成本所限制。在這項工作中，我們介紹了 Gemma Scope，一個在 Gemma 2 2B 和 9B 的所有層和子層以及 Gemma 2 27B 基礎模型的選定層上訓練的 JumpReLU SAE 的開放套件。我們主要在 Gemma 2 預訓練模型上訓練 SAE，但另外發布了在指令調整的 Gemma 2 9B 上訓練的 SAE 以供比較。我們根據標準指標評估每個 SAE 的品質，並發布這些結果。我們希望通過發布這些 SAE 權重，我們可以幫助社群更容易進行更具野心的安全性和可解釋性研究。權重和教學課程可以在 https://huggingface.co/google/gemma-scope 找到，互動式示範可以在 https://www.neuronpedia.org/gemma-scope 找到", "author": "Tom Lieberum et.al.", "authors": "Tom Lieberum, Senthooran Rajamanoharan, Arthur Conmy, Lewis Smith, Nicolas Sonnerat, Vikrant Varma, János Kramár, Anca Dragan, Rohin Shah, Neel Nanda", "id": "2408.05147v1", "paper_url": "http://arxiv.org/abs/2408.05147v1", "repo": "null"}}