{"2411.07841": {"publish_time": "2024-11-12", "title": "Federated Learning for Discrete Optimal Transport with Large Population under Incomplete Information", "paper_summary": "Optimal transport is a powerful framework for the efficient allocation of\nresources between sources and targets. However, traditional models often\nstruggle to scale effectively in the presence of large and heterogeneous\npopulations. In this work, we introduce a discrete optimal transport framework\ndesigned to handle large-scale, heterogeneous target populations, characterized\nby type distributions. We address two scenarios: one where the type\ndistribution of targets is known, and one where it is unknown. For the known\ndistribution, we propose a fully distributed algorithm to achieve optimal\nresource allocation. In the case of unknown distribution, we develop a\nfederated learning-based approach that enables efficient computation of the\noptimal transport scheme while preserving privacy. Case studies are provided to\nevaluate the performance of our learning algorithm.", "paper_summary_zh": "最佳傳輸是一種在來源和目標之間有效分配資源的強大架構。然而，傳統模型在面對龐大且異質的人群時，通常難以有效擴展。在此研究中，我們引入了一個離散最佳傳輸架構，旨在處理大型、異質的目標族群，其特點在於類型分佈。我們探討了兩種場景：一種是目標的類型分佈已知，另一種則是未知。對於已知分佈，我們提出了一種完全分佈式的演算法，以實現最佳資源配置。在未知分佈的情況下，我們開發了一種基於聯邦學習的方法，可以在保護隱私的同時，有效計算最佳傳輸方案。我們提供了案例研究，以評估我們的學習演算法的效能。", "author": "Navpreet Kaur et.al.", "authors": "Navpreet Kaur, Juntao Chen, Yingdong Lu", "id": "2411.07841v1", "paper_url": "http://arxiv.org/abs/2411.07841v1", "repo": "null"}}