{"2411.16579": {"publish_time": "2024-11-25", "title": "Enhancing LLM Reasoning via Critique Models with Test-Time and Training-Time Supervision", "paper_summary": "Training large language models (LLMs) to spend more time thinking and\nreflection before responding is crucial for effectively solving complex\nreasoning tasks in fields such as science, coding, and mathematics. However,\nthe effectiveness of mechanisms like self-reflection and self-correction\ndepends on the model's capacity to accurately assess its own performance, which\ncan be limited by factors such as initial accuracy, question difficulty, and\nthe lack of external feedback. In this paper, we delve into a two-player\nparadigm that separates the roles of reasoning and critique models, where the\ncritique model provides step-level feedback to supervise the reasoning (actor)\nmodel during both test-time and train-time. We first propose AutoMathCritique,\nan automated and scalable framework for collecting critique data, resulting in\na dataset of $76,321$ responses paired with step-level feedback. Fine-tuning\nlanguage models with this dataset enables them to generate natural language\nfeedback for mathematical reasoning. We demonstrate that the critique models\nconsistently improve the actor's performance on difficult queries at test-time,\nespecially when scaling up inference-time computation. Motivated by these\nfindings, we introduce the critique-based supervision to the actor's\nself-training process, and propose a critique-in-the-loop self-improvement\nmethod. Experiments show that the method improves the actor's exploration\nefficiency and solution diversity, especially on challenging queries, leading\nto a stronger reasoning model. Lastly, we take the preliminary step to explore\ntraining self-talk reasoning models via critique supervision and showcase its\npotential. Our code and datasets are at\n\\href{https://mathcritique.github.io/}{https://mathcritique.github.io/}.", "paper_summary_zh": "<paragraph>訓練大型語言模型 (LLM) 在回應前花更多時間思考和反省，對於在科學、程式編寫和數學等領域有效解決複雜推理任務至關重要。然而，自我反省和自我修正等機制的有效性取決於模型準確評估其自身效能的能力，而這可能會受到初始準確度、問題難度和缺乏外部回饋等因素的限制。在本文中，我們深入探討一個將推理和批判模型的角色分開的雙人遊戲範例，其中批判模型提供步驟層級的回饋，以監督推理 (actor) 模型在測試時間和訓練時間。我們首先提出 AutoMathCritique，這是一個用於收集批判資料的自動化且可擴充的架構，產生一個包含 76,321 個與步驟層級回饋配對的回應的資料集。使用這個資料集微調語言模型，使它們能夠為數學推理產生自然語言回饋。我們證明批判模型在測試時間持續改善 actor 在困難查詢上的效能，特別是在擴充推論時間運算時。受到這些發現的啟發，我們將基於批判的監督引入 actor 的自我訓練程序，並提出一個迴圈中的批判自我改善方法。實驗顯示，此方法改善了 actor 在探索效率和解決方案多樣性上的表現，特別是在具有挑戰性的查詢上，進而產生更強大的推理模型。最後，我們採取初步步驟，透過批判監督來探索訓練自我對話推理模型，並展示其潛力。我們的程式碼和資料集位於\n\\href{https://mathcritique.github.io/}{https://mathcritique.github.io/}。</paragraph>", "author": "Zhiheng Xi et.al.", "authors": "Zhiheng Xi, Dingwen Yang, Jixuan Huang, Jiafu Tang, Guanyu Li, Yiwen Ding, Wei He, Boyang Hong, Shihan Do, Wenyu Zhan, Xiao Wang, Rui Zheng, Tao Ji, Xiaowei Shi, Yitao Zhai, Rongxiang Weng, Jingang Wang, Xunliang Cai, Tao Gui, Zuxuan Wu, Qi Zhang, Xipeng Qiu, Xuanjing Huang, Yu-Gang Jiang", "id": "2411.16579v1", "paper_url": "http://arxiv.org/abs/2411.16579v1", "repo": "null"}}