{"2501.03225": {"publish_time": "2025-01-06", "title": "Automated Generation of Challenging Multiple-Choice Questions for Vision Language Model Evaluation", "paper_summary": "The rapid development of vision language models (VLMs) demands rigorous and\nreliable evaluation. However, current visual question answering (VQA)\nbenchmarks often depend on open-ended questions, making accurate evaluation\ndifficult due to the variability in natural language responses. To address\nthis, we introduce AutoConverter, an agentic framework that automatically\nconverts these open-ended questions into multiple-choice format, enabling\nobjective evaluation while reducing the costly question creation process. Our\nexperiments demonstrate that AutoConverter can generate correct and challenging\nmultiple-choice questions, with VLMs demonstrating consistently similar or\nlower accuracy on these questions compared to human-created ones. Using\nAutoConverter, we construct VMCBench, a benchmark created by transforming 20\nexisting VQA datasets into a unified multiple-choice format, totaling 9,018\nquestions. We comprehensively evaluate 33 state-of-the-art VLMs on VMCBench,\nsetting a new standard for scalable, consistent, and reproducible VLM\nevaluation.", "paper_summary_zh": "視覺語言模型 (VLM) 的快速發展需要嚴謹且可靠的評估。然而，目前的視覺問答 (VQA) 基準通常依賴於開放式問題，由於自然語言回應的可變性，導致精確評估變得困難。為了解決這個問題，我們引入了 AutoConverter，一個自動將這些開放式問題轉換成多選題格式的代理框架，在降低成本高昂的問題建立過程的同時，實現客觀評估。我們的實驗證明，AutoConverter 可以產生正確且具有挑戰性的多選題，與人類建立的問題相比，VLM 在這些問題上表現出持續相似或較低的準確度。使用 AutoConverter，我們建立了 VMCBench，一個通過將 20 個現有的 VQA 資料集轉換成統一的多選題格式而建立的基準，總計 9,018 個問題。我們在 VMCBench 上全面評估了 33 個最先進的 VLM，為可擴展、一致且可重現的 VLM 評估設定了新標準。", "author": "Yuhui Zhang et.al.", "authors": "Yuhui Zhang, Yuchang Su, Yiming Liu, Xiaohan Wang, James Burgess, Elaine Sui, Chenyu Wang, Josiah Aklilu, Alejandro Lozano, Anjiang Wei, Ludwig Schmidt, Serena Yeung-Levy", "id": "2501.03225v1", "paper_url": "http://arxiv.org/abs/2501.03225v1", "repo": "https://github.com/yuhui-zh15/autoconverter"}}