{"2405.08679": {"publish_time": "2024-05-14", "title": "Investigating Design Choices in Joint-Embedding Predictive Architectures for General Audio Representation Learning", "paper_summary": "This paper addresses the problem of self-supervised general-purpose audio\nrepresentation learning. We explore the use of Joint-Embedding Predictive\nArchitectures (JEPA) for this task, which consists of splitting an input\nmel-spectrogram into two parts (context and target), computing neural\nrepresentations for each, and training the neural network to predict the target\nrepresentations from the context representations. We investigate several design\nchoices within this framework and study their influence through extensive\nexperiments by evaluating our models on various audio classification\nbenchmarks, including environmental sounds, speech and music downstream tasks.\nWe focus notably on which part of the input data is used as context or target\nand show experimentally that it significantly impacts the model's quality. In\nparticular, we notice that some effective design choices in the image domain\nlead to poor performance on audio, thus highlighting major differences between\nthese two modalities.", "paper_summary_zh": "本文探討了自監督通用音訊表示學習的問題。我們探討了聯合嵌入預測架構 (JEPA) 在此任務中的應用，該架構包含將輸入的 mel 頻譜圖分割成兩部分（脈絡和目標）、針對每一部分計算神經表示，以及訓練神經網路從脈絡表示預測目標表示。我們在此架構內探討了數種設計選擇，並透過廣泛的實驗研究其影響，方法是針對各種音訊分類基準評估我們的模型，包括環境音、語音和音樂下游任務。我們特別專注於輸入資料的哪一部分用作脈絡或目標，並透過實驗顯示它會顯著影響模型品質。特別是，我們注意到影像領域中一些有效的設計選擇會導致音訊表現不佳，因此突顯了這兩種模式之間的主要差異。", "author": "Alain Riou et.al.", "authors": "Alain Riou, Stefan Lattner, Gaëtan Hadjeres, Geoffroy Peeters", "id": "2405.08679v1", "paper_url": "http://arxiv.org/abs/2405.08679v1", "repo": "null"}}