{"2407.20684": {"publish_time": "2024-07-30", "title": "RevGNN: Negative Sampling Enhanced Contrastive Graph Learning for Academic Reviewer Recommendation", "paper_summary": "Acquiring reviewers for academic submissions is a challenging recommendation\nscenario. Recent graph learning-driven models have made remarkable progress in\nthe field of recommendation, but their performance in the academic reviewer\nrecommendation task may suffer from a significant false negative issue. This\narises from the assumption that unobserved edges represent negative samples. In\nfact, the mechanism of anonymous review results in inadequate exposure of\ninteractions between reviewers and submissions, leading to a higher number of\nunobserved interactions compared to those caused by reviewers declining to\nparticipate. Therefore, investigating how to better comprehend the negative\nlabeling of unobserved interactions in academic reviewer recommendations is a\nsignificant challenge. This study aims to tackle the ambiguous nature of\nunobserved interactions in academic reviewer recommendations. Specifically, we\npropose an unsupervised Pseudo Neg-Label strategy to enhance graph contrastive\nlearning (GCL) for recommending reviewers for academic submissions, which we\ncall RevGNN. RevGNN utilizes a two-stage encoder structure that encodes both\nscientific knowledge and behavior using Pseudo Neg-Label to approximate review\npreference. Extensive experiments on three real-world datasets demonstrate that\nRevGNN outperforms all baselines across four metrics. Additionally, detailed\nfurther analyses confirm the effectiveness of each component in RevGNN.", "paper_summary_zh": "學術投稿審查人推薦是一個具有挑戰性的推薦情境。最近的圖形學習驅動模型在推薦領域取得了顯著進展，但它們在學術審查人推薦任務中的表現可能會受到顯著的假陰性問題影響。這是源於未觀察到的邊緣代表負面樣本的假設。事實上，匿名審查的機制導致審查人和投稿之間的互動曝光不足，與審查人拒絕參與造成的互動相比，導致未觀察到的互動數量更高。因此，探討如何更好地理解學術審查人推薦中未觀察到的互動的負面標記是一個重大的挑戰。本研究旨在解決學術審查人推薦中未觀察到的互動的模糊性質。具體來說，我們提出了一個無監督的偽負標籤策略來增強圖對比學習 (GCL)，以便為學術投稿推薦審查人，我們稱之為 RevGNN。RevGNN 利用一個兩階段編碼器結構，使用偽負標籤對科學知識和行為進行編碼，以近似審查偏好。在三個真實世界數據集上進行的廣泛實驗表明，RevGNN 在四個指標上優於所有基線。此外，詳細的進一步分析證實了 RevGNN 中每個組件的有效性。", "author": "Weibin Liao et.al.", "authors": "Weibin Liao, Yifan Zhu, Yanyan Li, Qi Zhang, Zhonghong Ou, Xuesong Li", "id": "2407.20684v1", "paper_url": "http://arxiv.org/abs/2407.20684v1", "repo": "null"}}