{"2405.16851": {"publish_time": "2024-05-27", "title": "Temporal Spiking Neural Networks with Synaptic Delay for Graph Reasoning", "paper_summary": "Spiking neural networks (SNNs) are investigated as biologically inspired\nmodels of neural computation, distinguished by their computational capability\nand energy efficiency due to precise spiking times and sparse spikes with\nevent-driven computation. A significant question is how SNNs can emulate\nhuman-like graph-based reasoning of concepts and relations, especially\nleveraging the temporal domain optimally. This paper reveals that SNNs, when\namalgamated with synaptic delay and temporal coding, are proficient in\nexecuting (knowledge) graph reasoning. It is elucidated that spiking time can\nfunction as an additional dimension to encode relation properties via a\nneural-generalized path formulation. Empirical results highlight the efficacy\nof temporal delay in relation processing and showcase exemplary performance in\ndiverse graph reasoning tasks. The spiking model is theoretically estimated to\nachieve $20\\times$ energy savings compared to non-spiking counterparts,\ndeepening insights into the capabilities and potential of biologically inspired\nSNNs for efficient reasoning. The code is available at\nhttps://github.com/pkuxmq/GRSNN.", "paper_summary_zh": "尖峰神经網路（SNN）被視為生物靈感的類神經運算模型，其特點是運算能力強，由於精準的尖峰時間和具有事件驅動運算的稀疏尖峰，因此能效高。一個重要的問題是 SNN 如何能模擬人類類圖形基於概念和關係的推理，特別是最佳利用時間域。本文揭示了 SNN 在與突觸延遲和時間編碼結合時，擅長執行（知識）圖形推理。說明了尖峰時間可以作為一個附加維度，透過神經廣義路徑公式來編碼關係屬性。經驗結果突顯了時間延遲在關係處理中的效能，並展示了在各種圖形推理任務中的範例效能。理論上估計尖峰模型可節省 $20\\times$ 的能量，與非尖峰對應物相比，加深了對生物靈感 SNN 在有效推理方面的能力和潛力的見解。程式碼可在 https://github.com/pkuxmq/GRSNN 取得。", "author": "Mingqing Xiao et.al.", "authors": "Mingqing Xiao, Yixin Zhu, Di He, Zhouchen Lin", "id": "2405.16851v1", "paper_url": "http://arxiv.org/abs/2405.16851v1", "repo": "null"}}