{"2407.13435": {"publish_time": "2024-07-18", "title": "Enhancing Out-of-Vocabulary Performance of Indian TTS Systems for Practical Applications through Low-Effort Data Strategies", "paper_summary": "Publicly available TTS datasets for low-resource languages like Hindi and\nTamil typically contain 10-20 hours of data, leading to poor vocabulary\ncoverage. This limitation becomes evident in downstream applications where\ndomain-specific vocabulary coupled with frequent code-mixing with English,\nresults in many OOV words. To highlight this problem, we create a benchmark\ncontaining OOV words from several real-world applications. Indeed,\nstate-of-the-art Hindi and Tamil TTS systems perform poorly on this OOV\nbenchmark, as indicated by intelligibility tests. To improve the model's OOV\nperformance, we propose a low-effort and economically viable strategy to obtain\nmore training data. Specifically, we propose using volunteers as opposed to\nhigh quality voice artists to record words containing character bigrams unseen\nin the training data. We show that using such inexpensive data, the model's\nperformance improves on OOV words, while not affecting voice quality and\nin-domain performance.", "paper_summary_zh": "<paragraph>對於印地語和泰米爾語等低資源語言，公開可用的 TTS 資料集通常包含 10-20 小時的資料，導致詞彙涵蓋範圍很差。這種限制在下游應用中很明顯，在這些應用中，特定領域的詞彙與頻繁的英語代碼混合，導致出現許多 OOV 字詞。為了凸顯這個問題，我們建立了一個基準，其中包含來自多個真實世界應用程式的 OOV 字詞。事實上，最先進的印地語和泰米爾語 TTS 系統在這個 OOV 基準上表現不佳，這從可懂度測試中可以看出。為了提高模型的 OOV 效能，我們提出了一種低成本且經濟可行的策略，以取得更多訓練資料。具體來說，我們建議使用志工，而不是高品質的配音員，來錄製訓練資料中未出現的字元二元組所組成的字詞。我們表明，使用這種低成本資料，模型在 OOV 字詞上的效能有所提升，同時不影響語音品質和特定領域效能。</paragraph>", "author": "Srija Anand et.al.", "authors": "Srija Anand, Praveen Srinivasa Varadhan, Ashwin Sankar, Giri Raju, Mitesh M. Khapra", "id": "2407.13435v1", "paper_url": "http://arxiv.org/abs/2407.13435v1", "repo": "null"}}