{"2406.02882": {"publish_time": "2024-06-05", "title": "Outdated Issue Aware Decoding for Factual Knowledge Editing", "paper_summary": "Recently, Knowledge Editing has received increasing attention, since it could\nupdate the specific knowledge from outdated ones in pretrained models without\nre-training. However, as pointed out by recent studies, existing related\nmethods tend to merely memorize the superficial word composition of the edited\nknowledge, rather than truly learning and absorbing it. Consequently, on the\nreasoning questions, we discover that existing methods struggle to utilize the\nedited knowledge to reason the new answer, and tend to retain outdated\nresponses, which are generated by the original models utilizing original\nknowledge. Nevertheless, the outdated responses are unexpected for the correct\nanswers to reasoning questions, which we named as the outdated issue. To\nalleviate this issue, in this paper, we propose a simple yet effective decoding\nstrategy, i.e., outDated ISsue aware deCOding (DISCO), to enhance the\nperformance of edited models on reasoning questions. Specifically, we capture\nthe difference in the probability distribution between the original and edited\nmodels. Further, we amplify the difference of the token prediction in the\nedited model to alleviate the outdated issue, and thus enhance the model\nperformance w.r.t the edited knowledge. Experimental results suggest that\napplying DISCO could enhance edited models to reason, e.g., on reasoning\nquestions, DISCO outperforms the prior SOTA method by 12.99 F1 scores, and\nreduces the ratio of the outdated issue to 5.78% on the zsRE dataset.", "paper_summary_zh": "近年來，知識編輯受到越來越多的關注，因為它可以在不重新訓練的情況下，從預訓練模型中更新過時的特定知識。然而，正如最近的研究指出的，現有的相關方法往往只是記住編輯知識的表面字詞組成，而不是真正學習和吸收它。因此，在推理問題上，我們發現現有方法難以利用編輯知識來推理新答案，並且傾向於保留過時的回應，這些回應是由原始模型利用原始知識生成的。儘管如此，過時的回應對於推理問題的正確答案來說是意料之外的，我們稱之為過時問題。為了緩解這個問題，在本文中，我們提出了一個簡單但有效的解碼策略，即過時問題感知解碼 (DISCO)，以增強編輯模型在推理問題上的效能。具體來說，我們捕捉原始模型和編輯模型之間概率分佈的差異。此外，我們擴大了編輯模型中標記預測的差異，以緩解過時問題，從而增強模型相對於編輯知識的效能。實驗結果表明，應用 DISCO 可以增強編輯模型的推理能力，例如，在推理問題上，DISCO 在 F1 分數上優於先前的 SOTA 方法 12.99，並將 zsRE 資料集上的過時問題比率降低至 5.78%。", "author": "Zengkui Sun et.al.", "authors": "Zengkui Sun, Yijin Liu, Jiaan Wang, Fandong Meng, Jinan Xu, Yufeng Chen, Jie Zhou", "id": "2406.02882v1", "paper_url": "http://arxiv.org/abs/2406.02882v1", "repo": "null"}}