{"2407.06547": {"publish_time": "2024-07-09", "title": "Deciphering Assamese Vowel Harmony with Featural InfoWaveGAN", "paper_summary": "Traditional approaches for understanding phonological learning have\npredominantly relied on curated text data. Although insightful, such approaches\nlimit the knowledge captured in textual representations of the spoken language.\nTo overcome this limitation, we investigate the potential of the Featural\nInfoWaveGAN model to learn iterative long-distance vowel harmony using raw\nspeech data. We focus on Assamese, a language known for its phonologically\nregressive and word-bound vowel harmony. We demonstrate that the model is adept\nat grasping the intricacies of Assamese phonotactics, particularly iterative\nlong-distance harmony with regressive directionality. It also produced\nnon-iterative illicit forms resembling speech errors during human language\nacquisition. Our statistical analysis reveals a preference for a specific\n[+high,+ATR] vowel as a trigger across novel items, indicative of feature\nlearning. More data and control could improve model proficiency, contrasting\nthe universality of learning.", "paper_summary_zh": "傳統上，對於理解音韻學習的方法主要依賴於策展的文字資料。儘管有見解，但這種方法限制了在口語文字表述中擷取的知識。為了克服這個限制，我們探討了 Featural InfoWaveGAN 模型使用原始語音資料學習反覆長距離元音和諧的潛力。我們專注於阿薩姆語，一種以音韻回歸和以詞為界的元音和諧而聞名的語言。我們證明了該模型擅長掌握阿薩姆語音韻學的複雜性，特別是具有回歸方向性的反覆長距離和諧。它還產生了非反覆的非法形式，類似於人類語言習得過程中發生的言語錯誤。我們的統計分析揭示了對特定 [+high,+ATR] 元音作為觸發器的偏好，這表明特徵學習。更多資料和控制可以提高模型能力，對比學習的普遍性。", "author": "Sneha Ray Barman et.al.", "authors": "Sneha Ray Barman, Shakuntala Mahanta, Neeraj Kumar Sharma", "id": "2407.06547v1", "paper_url": "http://arxiv.org/abs/2407.06547v1", "repo": "null"}}