{"2406.18696": {"publish_time": "2024-06-26", "title": "Sequence Graph Network for Online Debate Analysis", "paper_summary": "Online debates involve a dynamic exchange of ideas over time, where\nparticipants need to actively consider their opponents' arguments, respond with\ncounterarguments, reinforce their own points, and introduce more compelling\narguments as the discussion unfolds. Modeling such a complex process is not a\nsimple task, as it necessitates the incorporation of both sequential\ncharacteristics and the capability to capture interactions effectively. To\naddress this challenge, we employ a sequence-graph approach. Building the\nconversation as a graph allows us to effectively model interactions between\nparticipants through directed edges. Simultaneously, the propagation of\ninformation along these edges in a sequential manner enables us to capture a\nmore comprehensive representation of context. We also introduce a Sequence\nGraph Attention layer to illustrate the proposed information update scheme. The\nexperimental results show that sequence graph networks achieve superior results\nto existing methods in online debates.", "paper_summary_zh": "網路辯論涉及隨著時間推移進行的動態觀念交流，其中參與者需要積極考慮對手的論點，以反論回應、強化自己的觀點，並隨著討論的展開提出更有說服力的論點。建模如此複雜的過程並非簡單的任務，因為它需要同時納入順序特性和有效捕捉互動的能力。為了應對這一挑戰，我們採用序列圖方法。將對話建構為圖表讓我們能夠透過有向邊有效地模擬參與者之間的互動。同時，沿著這些邊以順序方式傳播資訊使我們能夠捕捉更全面的脈絡表徵。我們還引入序列圖注意力層來說明所提出的資訊更新方案。實驗結果顯示，序列圖網路在網路辯論中獲得優於現有方法的卓越成果。", "author": "Quan Mai et.al.", "authors": "Quan Mai, Susan Gauch, Douglas Adams, Miaoqing Huang", "id": "2406.18696v1", "paper_url": "http://arxiv.org/abs/2406.18696v1", "repo": "null"}}