{"2410.15944": {"publish_time": "2024-10-21", "title": "Developing Retrieval Augmented Generation (RAG) based LLM Systems from PDFs: An Experience Report", "paper_summary": "This paper presents an experience report on the development of Retrieval\nAugmented Generation (RAG) systems using PDF documents as the primary data\nsource. The RAG architecture combines generative capabilities of Large Language\nModels (LLMs) with the precision of information retrieval. This approach has\nthe potential to redefine how we interact with and augment both structured and\nunstructured knowledge in generative models to enhance transparency, accuracy,\nand contextuality of responses. The paper details the end-to-end pipeline, from\ndata collection, preprocessing, to retrieval indexing and response generation,\nhighlighting technical challenges and practical solutions. We aim to offer\ninsights to researchers and practitioners developing similar systems using two\ndistinct approaches: OpenAI's Assistant API with GPT Series and Llama's\nopen-source models. The practical implications of this research lie in\nenhancing the reliability of generative AI systems in various sectors where\ndomain-specific knowledge and real-time information retrieval is important. The\nPython code used in this work is also available at:\nhttps://github.com/GPT-Laboratory/RAG-LLM-Development-Guidebook-from-PDFs.", "paper_summary_zh": "這篇論文提出了一份經驗報告，說明如何使用 PDF 文件作為主要資料來源來開發檢索增強生成 (RAG) 系統。RAG 架構結合了大型語言模型 (LLM) 的生成能力和資訊檢索的精確度。這種方法有可能重新定義我們如何與生成模型中的結構化和非結構化知識互動並加以增強，以提高回應的透明度、準確性和脈絡性。這篇論文詳細說明了端到端管線，從資料收集、預處理到檢索索引和回應產生，重點說明技術挑戰和實際解決方案。我們旨在為使用兩種不同方法開發類似系統的研究人員和從業人員提供見解：OpenAI 的助理 API 與 GPT 系列和 Llama 的開源模型。這項研究的實際意義在於提高生成式 AI 系統在各種領域的可靠性，這些領域重視特定領域的知識和即時資訊檢索。這項工作中使用的 Python 程式碼也可在以下網址取得：https://github.com/GPT-Laboratory/RAG-LLM-Development-Guidebook-from-PDFs。", "author": "Ayman Asad Khan et.al.", "authors": "Ayman Asad Khan, Md Toufique Hasan, Kai Kristian Kemell, Jussi Rasku, Pekka Abrahamsson", "id": "2410.15944v1", "paper_url": "http://arxiv.org/abs/2410.15944v1", "repo": "https://github.com/gpt-laboratory/rag-llm-development-guidebook-from-pdfs"}}