{"2405.06413": {"publish_time": "2024-05-10", "title": "Multi-level Personalized Federated Learning on Heterogeneous and Long-Tailed Data", "paper_summary": "Federated learning (FL) offers a privacy-centric distributed learning\nframework, enabling model training on individual clients and central\naggregation without necessitating data exchange. Nonetheless, FL\nimplementations often suffer from non-i.i.d. and long-tailed class\ndistributions across mobile applications, e.g., autonomous vehicles, which\nleads models to overfitting as local training may converge to sub-optimal. In\nour study, we explore the impact of data heterogeneity on model bias and\nintroduce an innovative personalized FL framework, Multi-level Personalized\nFederated Learning (MuPFL), which leverages the hierarchical architecture of FL\nto fully harness computational resources at various levels. This framework\nintegrates three pivotal modules: Biased Activation Value Dropout (BAVD) to\nmitigate overfitting and accelerate training; Adaptive Cluster-based Model\nUpdate (ACMU) to refine local models ensuring coherent global aggregation; and\nPrior Knowledge-assisted Classifier Fine-tuning (PKCF) to bolster\nclassification and personalize models in accord with skewed local data with\nshared knowledge. Extensive experiments on diverse real-world datasets for\nimage classification and semantic segmentation validate that MuPFL consistently\noutperforms state-of-the-art baselines, even under extreme non-i.i.d. and\nlong-tail conditions, which enhances accuracy by as much as 7.39% and\naccelerates training by up to 80% at most, marking significant advancements in\nboth efficiency and effectiveness.", "paper_summary_zh": "聯邦學習 (FL) 提供以隱私為中心的分布式學習框架，可在個別用戶端上進行模型訓練和集中聚合，而無需進行資料交換。儘管如此，FL 實作通常會受到非獨立同分布 (non-i.i.d.) 和長尾類別分佈在行動應用程式中的影響，例如自動駕駛汽車，這會導致模型過度擬合，因為局部訓練可能會收斂到次佳值。在我們的研究中，我們探討了資料異質性對模型偏差的影響，並引入了創新的個人化 FL 框架，多層級個人化聯邦學習 (MuPFL)，它利用 FL 的階層式架構來充分利用各層級的運算資源。此框架整合了三個關鍵模組：有偏激活值中斷 (BAVD) 可減輕過度擬合並加速訓練；基於適應性叢集的模型更新 (ACMU) 可精煉局部模型，確保一致的全球聚合；以及先驗知識輔助分類器微調 (PKCF) 可加強分類並根據具有共享知識的偏斜局部資料個人化模型。在用於影像分類和語意分割的各種真實世界資料集上進行的廣泛實驗驗證，MuPFL 始終優於最先進的基準，即使在極端的非獨立同分布 (non-i.i.d.) 和長尾條件下，準確度最高可提高 7.39%，而訓練速度最多可加快 80%，這標誌著效率和效能方面都有顯著進步。", "author": "Rongyu Zhang et.al.", "authors": "Rongyu Zhang, Yun Chen, Chenrui Wu, Fangxin Wang, Bo Li", "id": "2405.06413v1", "paper_url": "http://arxiv.org/abs/2405.06413v1", "repo": "null"}}