{"2405.05446": {"publish_time": "2024-05-08", "title": "GDGS: Gradient Domain Gaussian Splatting for Sparse Representation of Radiance Fields", "paper_summary": "The 3D Gaussian splatting methods are getting popular. However, they work\ndirectly on the signal, leading to a dense representation of the signal. Even\nwith some techniques such as pruning or distillation, the results are still\ndense. In this paper, we propose to model the gradient of the original signal.\nThe gradients are much sparser than the original signal. Therefore, the\ngradients use much less Gaussian splats, leading to the more efficient storage\nand thus higher computational performance during both training and rendering.\nThanks to the sparsity, during the view synthesis, only a small mount of pixels\nare needed, leading to much higher computational performance ($100\\sim\n1000\\times$ faster). And the 2D image can be recovered from the gradients via\nsolving a Poisson equation with linear computation complexity. Several\nexperiments are performed to confirm the sparseness of the gradients and the\ncomputation performance of the proposed method. The method can be applied\nvarious applications, such as human body modeling and indoor environment\nmodeling.", "paper_summary_zh": "3D 高斯散射方法正变得流行。然而，它们直接在信号上工作，从而导致信号的密集表示。即使使用一些技术（如剪枝或蒸馏），结果仍然很密集。在本文中，我们建议对原始信号的梯度进行建模。梯度比原始信号稀疏得多。因此，梯度使用更少的 Gaussian splat，从而在训练和渲染期间导致更有效的存储，从而提高计算性能。由于稀疏性，在视图合成期间，只需要少量像素，从而导致更高的计算性能（快 $100\\sim 1000\\times$）。并且可以通过求解具有线性计算复杂度的泊松方程从梯度中恢复 2D 图像。执行了几项实验来确认梯度的稀疏性和所提出方法的计算性能。该方法可以应用于各种应用，例如人体建模和室内环境建模。", "author": "Yuanhao Gong et.al.", "authors": "Yuanhao Gong", "id": "2405.05446v1", "paper_url": "http://arxiv.org/abs/2405.05446v1", "repo": "null"}}