{"2405.04304": {"publish_time": "2024-05-07", "title": "Accelerating Speculative Decoding using Dynamic Speculation Length", "paper_summary": "Speculative decoding is a promising method for reducing the inference latency\nof large language models. The effectiveness of the method depends on the\nspeculation length (SL) - the number of tokens generated by the draft model at\neach iteration. The vast majority of speculative decoding approaches use the\nsame SL for all iterations. In this work, we show that this practice is\nsuboptimal. We introduce DISCO, a DynamIc SpeCulation length Optimization\nmethod that uses a classifier to dynamically adjust the SL at each iteration,\nwhile provably preserving the decoding quality. Experiments with four\nbenchmarks demonstrate average speedup gains of 10.3% relative to our best\nbaselines.", "paper_summary_zh": "推測解碼是一種有望降低大型語言模型推論延遲的方法。此方法的有效性取決於推測長度 (SL)，也就是草稿模型在每個反覆運算中產生的符號數量。絕大多數的推測解碼方法對所有反覆運算使用相同的 SL。在這項工作中，我們證明這種做法次於最佳。我們推出 DISCO，一種動態推測長度最佳化方法，它使用分類器在每次反覆運算中動態調整 SL，同時可證明保留解碼品質。使用四個基準進行的實驗顯示，相較於我們最佳的基準，平均加速增益為 10.3%。", "author": "Jonathan Mamou et.al.", "authors": "Jonathan Mamou, Oren Pereg, Daniel Korat, Moshe Berchansky, Nadav Timor, Moshe Wasserblat, Roy Schwartz", "id": "2405.04304v1", "paper_url": "http://arxiv.org/abs/2405.04304v1", "repo": "null"}}