{"2407.19447": {"publish_time": "2024-07-28", "title": "Nudging Consent and the New Opt Out System to the Processing of Health Data in England", "paper_summary": "This chapter examines the challenges of the revised opt out system and the\nsecondary use of health data in England. The analysis of this data could be\nvery valuable for science and medical treatment as well as for the discovery of\nnew drugs. For this reason, the UK government established the care.data program\nin 2013. The aim of the project was to build a central nationwide database for\nresearch and policy planning. However, the processing of personal data was\nplanned without proper public engagement. Research has suggested that IT\ncompanies, such as in the Google DeepMind deal case, had access to other kinds\nof sensitive data and failed to comply with data protection law. Since May\n2018, the government has launched the national data opt out system with the\nhope of regaining public trust. Nevertheless, there are no evidence of\nsignificant changes in the ND opt out, compared to the previous opt out system.\nNeither in the use of secondary data, nor in the choices that patients can\nmake. The only notorious difference seems to be in the way that these options\nare communicated and framed to the patients. Most importantly, according to the\nnew ND opt out, the type 1 opt out option, which is the only choice that truly\nstops data from being shared outside direct care, will be removed in 2020.\nAccording to the Behavioral Law and Economics literature (Nudge Theory),\ndefault rules, such as the revised opt out system in England, are very\npowerful, because people tend to stick to the default choices made readily\navailable to them. The crucial question analyzed in this chapter is whether it\nis desirable for the UK government to stop promoting the type 1 opt outs, and\nwhether this could be seen as a kind of hard paternalism.", "paper_summary_zh": "<paragraph>本章探討了英國修改後的退出機制和二次使用健康資料所面臨的挑戰。分析這些資料對於科學和醫療治療以及發現新藥物而言，可能非常有價值。基於此原因，英國政府於 2013 年建立了 care.data 計畫。該專案的目標是建立一個全國性的中央資料庫，以進行研究和政策規劃。然而，個人資料的處理是在沒有適當公眾參與的情況下進行規劃的。研究表明，例如在 Google DeepMind 交易案例中，IT 公司可以存取其他類型的敏感資料，且未能遵守資料保護法。自 2018 年 5 月以來，政府已推出全國資料退出機制，希望能重新獲得公眾信任。儘管如此，與先前的退出機制相比，並無證據顯示全國資料退出機制有顯著變化。無論是在二次資料的使用上，或是在患者可以做出的選擇上，皆是如此。唯一顯著的差異似乎在於這些選項的溝通和傳達方式。最重要的是，根據新的全國資料退出機制，類型 1 退出選項（這是唯一真正能阻止資料在直接照護之外被分享的選項）將於 2020 年被移除。根據行為法與經濟學文獻（推論理論），預設規則（例如英國修改後的退出機制）非常有效，因為人們傾向於堅持容易取得的預設選項。本章分析的關鍵問題是，英國政府停止推廣類型 1 退出是否可取，以及這是否可以視為一種嚴厲的父權主義。</paragraph>", "author": "Janos Meszaros et.al.", "authors": "Janos Meszaros, Chih-hsing Ho, Marcelo Corrales Compagnucci", "id": "2407.19447v1", "paper_url": "http://arxiv.org/abs/2407.19447v1", "repo": "null"}}