{"2412.15047": {"publish_time": "2024-12-19", "title": "Measuring, Modeling, and Helping People Account for Privacy Risks in Online Self-Disclosures with AI", "paper_summary": "In pseudonymous online fora like Reddit, the benefits of self-disclosure are\noften apparent to users (e.g., I can vent about my in-laws to understanding\nstrangers), but the privacy risks are more abstract (e.g., will my partner be\nable to tell that this is me?). Prior work has sought to develop natural\nlanguage processing (NLP) tools that help users identify potentially risky\nself-disclosures in their text, but none have been designed for or evaluated\nwith the users they hope to protect. Absent this assessment, these tools will\nbe limited by the social-technical gap: users need assistive tools that help\nthem make informed decisions, not paternalistic tools that tell them to avoid\nself-disclosure altogether. To bridge this gap, we conducted a study with N =\n21 Reddit users; we had them use a state-of-the-art NLP disclosure detection\nmodel on two of their authored posts and asked them questions to understand if\nand how the model helped, where it fell short, and how it could be improved to\nhelp them make more informed decisions. Despite its imperfections, users\nresponded positively to the model and highlighted its use as a tool that can\nhelp them catch mistakes, inform them of risks they were unaware of, and\nencourage self-reflection. However, our work also shows how, to be useful and\nusable, AI for supporting privacy decision-making must account for posting\ncontext, disclosure norms, and users' lived threat models, and provide\nexplanations that help contextualize detected risks.", "paper_summary_zh": "在 Reddit 等匿名網路論壇中，自我揭露的優點對使用者來說通常很明顯（例如，我可以向理解我的陌生人發洩對姻親的不滿），但隱私風險則較為抽象（例如，我的伴侶是否會知道這是我？）。先前的研究試圖開發自然語言處理 (NLP) 工具，協助使用者辨識其文字中潛在有風險的自我揭露，但沒有一項是專門為他們希望保護的使用者所設計或評估的。在沒有這項評估的情況下，這些工具將受到社會技術差距的限制：使用者需要輔助工具來幫助他們做出明智的決定，而不是告訴他們完全避免自我揭露的父權式工具。為了彌合理論與實務的差距，我們對 N = 21 位 Reddit 使用者進行了一項研究；我們請他們使用最先進的 NLP 揭露偵測模型，針對他們撰寫的兩篇文章進行分析，並向他們提問，以了解該模型是否有幫助、如何幫助、不足之處，以及如何改進以幫助他們做出更明智的決定。儘管有其缺陷，使用者對該模型的反應仍是正面的，並強調其可用作一種工具，幫助他們找出錯誤、告知他們不知道的風險，並鼓勵自我反省。然而，我們的研究也顯示，為了實用且可用，支援隱私決策的 AI 必須考慮發文背景、揭露規範和使用者的既有威脅模型，並提供說明以幫助將偵測到的風險脈絡化。", "author": "Isadora Krsek et.al.", "authors": "Isadora Krsek, Anubha Kabra, Yao Dou, Tarek Naous, Laura A. Dabbish, Alan Ritter, Wei Xu, Sauvik Das", "id": "2412.15047v1", "paper_url": "http://arxiv.org/abs/2412.15047v1", "repo": "null"}}