{"2407.05921": {"publish_time": "2024-07-08", "title": "TAPVid-3D: A Benchmark for Tracking Any Point in 3D", "paper_summary": "We introduce a new benchmark, TAPVid-3D, for evaluating the task of\nlong-range Tracking Any Point in 3D (TAP-3D). While point tracking in two\ndimensions (TAP) has many benchmarks measuring performance on real-world\nvideos, such as TAPVid-DAVIS, three-dimensional point tracking has none. To\nthis end, leveraging existing footage, we build a new benchmark for 3D point\ntracking featuring 4,000+ real-world videos, composed of three different data\nsources spanning a variety of object types, motion patterns, and indoor and\noutdoor environments. To measure performance on the TAP-3D task, we formulate a\ncollection of metrics that extend the Jaccard-based metric used in TAP to\nhandle the complexities of ambiguous depth scales across models, occlusions,\nand multi-track spatio-temporal smoothness. We manually verify a large sample\nof trajectories to ensure correct video annotations, and assess the current\nstate of the TAP-3D task by constructing competitive baselines using existing\ntracking models. We anticipate this benchmark will serve as a guidepost to\nimprove our ability to understand precise 3D motion and surface deformation\nfrom monocular video. Code for dataset download, generation, and model\nevaluation is available at https://tapvid3d.github.io", "paper_summary_zh": "<paragraph>我們引入一個新的基準測試 TAPVid-3D，用於評估在 3D 中追蹤任何點的遠距離任務 (TAP-3D)。雖然在兩個維度 (TAP) 中的點追蹤有許多基準測試用於衡量真實世界影片的效能，例如 TAPVid-DAVIS，但三維點追蹤卻沒有。為此，我們利用現有的素材，建立了一個新的 3D 點追蹤基準測試，其中包含 4,000 多個真實世界影片，由三個不同的資料來源組成，涵蓋各種物件類型、動作模式，以及室內和室外環境。為了衡量 TAP-3D 任務的效能，我們制定了一系列指標，將 TAP 中使用的 Jaccard 基於指標延伸，以處理跨模型的模糊深度尺度、遮擋，以及多軌時空平滑度的複雜性。我們手動驗證大量軌跡，以確保正確的影片註解，並使用現有的追蹤模型建立競爭性的基準線，以評估 TAP-3D 任務的當前狀態。我們預期這個基準測試將作為一個指引，以改善我們從單眼影片中了解精確 3D 運動和表面變形的的能力。資料集下載、產生和模型評估的程式碼可在 https://tapvid3d.github.io 取得</paragraph>", "author": "Skanda Koppula et.al.", "authors": "Skanda Koppula, Ignacio Rocco, Yi Yang, Joe Heyward, João Carreira, Andrew Zisserman, Gabriel Brostow, Carl Doersch", "id": "2407.05921v1", "paper_url": "http://arxiv.org/abs/2407.05921v1", "repo": "null"}}