{"2411.04324": {"publish_time": "2024-11-06", "title": "Gradient Boosting Trees and Large Language Models for Tabular Data Few-Shot Learning", "paper_summary": "Large Language Models (LLM) have brought numerous of new applications to\nMachine Learning (ML). In the context of tabular data (TD), recent studies show\nthat TabLLM is a very powerful mechanism for few-shot-learning (FSL)\napplications, even if gradient boosting decisions trees (GBDT) have\nhistorically dominated the TD field. In this work we demonstrate that although\nLLMs are a viable alternative, the evidence suggests that baselines used to\ngauge performance can be improved. We replicated public benchmarks and our\nmethodology improves LightGBM by 290%, this is mainly driven by forcing node\nsplitting with few samples, a critical step in FSL with GBDT. Our results show\nan advantage to TabLLM for 8 or fewer shots, but as the number of samples\nincreases GBDT provides competitive performance at a fraction of runtime. For\nother real-life applications with vast number of samples, we found FSL still\nuseful to improve model diversity, and when combined with ExtraTrees it\nprovides strong resilience to overfitting, our proposal was validated in a ML\ncompetition setting ranking first place.", "paper_summary_zh": "大型語言模型 (LLM) 為機器學習 (ML) 帶來了許多新的應用。在表格資料 (TD) 的背景下，最近的研究顯示 TabLLM 是一種非常強大的機制，可用於少量樣本學習 (FSL) 應用，即使梯度提升決策樹 (GBDT) 在歷史上一直主導 TD 領域。在這項工作中，我們證明了儘管 LLM 是一個可行的替代方案，但證據表明用於衡量效能的基準線可以得到改進。我們複製了公開基準，我們的技術方法將 LightGBM 提升了 290%，這主要是透過強制使用少量樣本進行節點分割，這是 FSL 中使用 GBDT 的關鍵步驟。我們的結果顯示 TabLLM 在 8 個或更少的樣本中具有優勢，但隨著樣本數量的增加，GBDT 在一小部分執行時間內提供了有競爭力的效能。對於其他具有大量樣本的實際應用，我們發現 FSL 仍然有助於提高模型多樣性，並且與 ExtraTrees 結合使用時，它提供了強大的過擬合復原力，我們的提案在機器學習競賽中獲得第一名，得到驗證。", "author": "Carlos Huertas et.al.", "authors": "Carlos Huertas", "id": "2411.04324v1", "paper_url": "http://arxiv.org/abs/2411.04324v1", "repo": "null"}}