{"2406.18921": {"publish_time": "2024-06-27", "title": "Capturing Minds, Not Just Words: Enhancing Role-Playing Language Models with Personality-Indicative Data", "paper_summary": "Role-playing agents (RPA) have been a popular application area for large\nlanguage models (LLMs), attracting significant interest from both industry and\nacademia.While existing RPAs well portray the characters' knowledge and tones,\nthey face challenges in capturing their minds, especially for small\nrole-playing language models (RPLMs). In this paper, we propose to enhance\nRPLMs via personality-indicative data. Specifically, we leverage questions from\npsychological scales and distill advanced RPAs to generate dialogues that grasp\nthe minds of characters. Experimental results validate that RPLMs trained with\nour dataset exhibit advanced role-playing capabilities for both general and\npersonality-related evaluations. Code and data are available at\n\\href{https://github.com/alienet1109/RolePersonality}{this URL}.", "paper_summary_zh": "角色扮演代理（RPA）一直是大型语言模型（LLM）的热门应用领域，吸引了业界和学术界的极大兴趣。虽然现有的 RPA 很好的描绘了角色的知识和语调，但它们在捕捉角色的心智方面面临挑战，特别是对于小型角色扮演语言模型（RPLM）。在本文中，我们提出通过人格指示数据来增强 RPLM。具体来说，我们利用心理量表的题目并提炼高级 RPA 来生成对话，以掌握角色的心智。实验结果验证了使用我们的数据集训练的 RPLM 在一般和个性相关评估中都表现出高级的角色扮演能力。代码和数据可在\\href{https://github.com/alienet1109/RolePersonality}{此网址}获得。", "author": "Yiting Ran et.al.", "authors": "Yiting Ran, Xintao Wang, Rui Xu, Xinfeng Yuan, Jiaqing Liang, Yanghua Xiao, Deqing Yang", "id": "2406.18921v1", "paper_url": "http://arxiv.org/abs/2406.18921v1", "repo": "null"}}