{"2412.11615": {"publish_time": "2024-12-16", "title": "MT-LENS: An all-in-one Toolkit for Better Machine Translation Evaluation", "paper_summary": "We introduce MT-LENS, a framework designed to evaluate Machine Translation\n(MT) systems across a variety of tasks, including translation quality, gender\nbias detection, added toxicity, and robustness to misspellings. While several\ntoolkits have become very popular for benchmarking the capabilities of Large\nLanguage Models (LLMs), existing evaluation tools often lack the ability to\nthoroughly assess the diverse aspects of MT performance. MT-LENS addresses\nthese limitations by extending the capabilities of LM-eval-harness for MT,\nsupporting state-of-the-art datasets and a wide range of evaluation metrics. It\nalso offers a user-friendly platform to compare systems and analyze\ntranslations with interactive visualizations. MT-LENS aims to broaden access to\nevaluation strategies that go beyond traditional translation quality\nevaluation, enabling researchers and engineers to better understand the\nperformance of a NMT model and also easily measure system's biases.", "paper_summary_zh": "我們推出 MT-LENS，一個旨在評估機器翻譯 (MT) 系統在各種任務中的框架，包括翻譯品質、性別偏差偵測、增加的毒性，以及拼寫錯誤的健全性。雖然有幾個工具包已變得非常流行，用於基準測試大型語言模型 (LLM) 的能力，但現有的評估工具通常缺乏徹底評估 MT 效能不同面向的能力。MT-LENS 透過擴展 LM-eval-harness for MT 的功能來解決這些限制，支援最先進的資料集和廣泛的評估指標。它還提供一個使用者友善的平台，用於比較系統並透過互動式視覺化分析翻譯。MT-LENS 旨在擴大對評估策略的存取，這些策略超越傳統的翻譯品質評估，讓研究人員和工程師能夠更深入瞭解 NMT 模型的效能，也能輕鬆衡量系統的偏差。", "author": "Javier García Gilabert et.al.", "authors": "Javier García Gilabert, Carlos Escolano, Audrey Mash, Xixian Liao, Maite Melero", "id": "2412.11615v1", "paper_url": "http://arxiv.org/abs/2412.11615v1", "repo": "null"}}