{"2410.14442": {"publish_time": "2024-10-18", "title": "A Systematic Study of Cross-Layer KV Sharing for Efficient LLM Inference", "paper_summary": "Recently, sharing key-value (KV) cache across layers has been found effective\nin efficient inference of large language models (LLMs). To systematically\ninvestigate different techniques of cross-layer KV sharing, we propose a\nunified framework that covers several recent methods and their novel variants.\nWe conduct comprehensive experiments on all the configurations of the\nframework, evaluating their generation throughput and performance in language\nmodeling and downstream tasks. We find that when reducing the size of the KV\ncache by 2x, most configurations can achieve competitive performance to and\nhigher throughput than standard transformers, but when further reducing the\nsize of the KV cache, pairing queries of all layers with KVs of upper layers\ncan better maintain performance, although it also introduces additional\ntraining cost and prefilling latency. We hope that this work will help users\nchoose the appropriate approach according to their requirements and facilitate\nresearch on the acceleration of LLM inference.", "paper_summary_zh": "最近，發現跨層共享鍵值 (KV) 快取在大型語言模型 (LLM) 的高效推理中很有效。為了系統地研究跨層 KV 共享的不同技術，我們提出了一個統一的框架，涵蓋了幾種最近的方法及其新穎的變體。我們對框架的所有配置進行了全面的實驗，評估了它們在語言建模和下游任務中的生成吞吐量和效能。我們發現，當將 KV 快取的大小減少 2 倍時，大多數配置都可以達到與標準Transformer相當的效能和更高的吞吐量，但當進一步減少 KV 快取的大小時，將所有層的查詢與上層的 KV 配對可以更好地維持效能，儘管它也會引入額外的訓練成本和預填充延遲。我們希望這項工作將幫助使用者根據自己的需求選擇適當的方法，並促進對 LLM 推理加速的研究。", "author": "You Wu et.al.", "authors": "You Wu, Haoyi Wu, Kewei Tu", "id": "2410.14442v1", "paper_url": "http://arxiv.org/abs/2410.14442v1", "repo": "https://github.com/whyNLP/LCKV"}}