{"2408.10920": {"publish_time": "2024-08-20", "title": "Recurrent Neural Networks Learn to Store and Generate Sequences using Non-Linear Representations", "paper_summary": "The Linear Representation Hypothesis (LRH) states that neural networks learn\nto encode concepts as directions in activation space, and a strong version of\nthe LRH states that models learn only such encodings. In this paper, we present\na counterexample to this strong LRH: when trained to repeat an input token\nsequence, gated recurrent neural networks (RNNs) learn to represent the token\nat each position with a particular order of magnitude, rather than a direction.\nThese representations have layered features that are impossible to locate in\ndistinct linear subspaces. To show this, we train interventions to predict and\nmanipulate tokens by learning the scaling factor corresponding to each sequence\nposition. These interventions indicate that the smallest RNNs find only this\nmagnitude-based solution, while larger RNNs have linear representations. These\nfindings strongly indicate that interpretability research should not be\nconfined by the LRH.", "paper_summary_zh": "線性表示假設 (LRH) 指出神經網路會學習將概念編碼為激活空間中的方向，而 LRH 的強版本則指出模型只會學習此類編碼。在本文中，我們提出此強 LRH 的反例：當訓練重複輸入記號序列時，門控遞迴神經網路 (RNN) 會學習用特定數量級而非方向來表示每個位置的記號。這些表示具有分層特徵，無法在不同的線性子空間中找到。為顯示這一點，我們訓練介入措施，透過學習與每個序列位置相應的縮放因子來預測和操作記號。這些介入措施表明最小的 RNN 只會找到這個基於大小的解決方案，而較大的 RNN 則具有線性表示。這些發現強烈表明可解釋性研究不應受到 LRH 的限制。", "author": "Róbert Csordás et.al.", "authors": "Róbert Csordás, Christopher Potts, Christopher D. Manning, Atticus Geiger", "id": "2408.10920v1", "paper_url": "http://arxiv.org/abs/2408.10920v1", "repo": "https://github.com/robertcsordas/onion_representations"}}