{"2407.04121": {"publish_time": "2024-07-04", "title": "Hallucination Detection: Robustly Discerning Reliable Answers in Large Language Models", "paper_summary": "Large Language Models (LLMs) have gained widespread adoption in various\nnatural language processing tasks, including question answering and dialogue\nsystems. However, a major drawback of LLMs is the issue of hallucination, where\nthey generate unfaithful or inconsistent content that deviates from the input\nsource, leading to severe consequences. In this paper, we propose a robust\ndiscriminator named RelD to effectively detect hallucination in LLMs' generated\nanswers. RelD is trained on the constructed RelQA, a bilingual\nquestion-answering dialogue dataset along with answers generated by LLMs and a\ncomprehensive set of metrics. Our experimental results demonstrate that the\nproposed RelD successfully detects hallucination in the answers generated by\ndiverse LLMs. Moreover, it performs well in distinguishing hallucination in\nLLMs' generated answers from both in-distribution and out-of-distribution\ndatasets. Additionally, we also conduct a thorough analysis of the types of\nhallucinations that occur and present valuable insights. This research\nsignificantly contributes to the detection of reliable answers generated by\nLLMs and holds noteworthy implications for mitigating hallucination in the\nfuture work.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種自然語言處理任務中廣泛採用，包括問答和對話系統。然而，LLM 的一個主要缺點是幻覺問題，它們會產生與輸入來源不同的不忠實或不一致的內容，導致嚴重的後果。在本文中，我們提出了一個名為 RelD 的強健判別器，以有效檢測 LLM 生成的答案中的幻覺。RelD 是在構造的 RelQA 上訓練的，RelQA 是雙語問答對話數據集，以及 LLM 生成的答案和一組綜合指標。我們的實驗結果表明，所提出的 RelD 成功檢測了各種 LLM 生成的答案中的幻覺。此外，它在區分 LLM 生成的答案中的幻覺與分佈內和分佈外數據集方面表現良好。此外，我們還對發生的幻覺類型進行了徹底的分析，並提出了寶貴的見解。這項研究顯著有助於檢測 LLM 生成的可靠答案，並對未來工作中減輕幻覺具有重要的意義。", "author": "Yuyan Chen et.al.", "authors": "Yuyan Chen, Qiang Fu, Yichen Yuan, Zhihao Wen, Ge Fan, Dayiheng Liu, Dongmei Zhang, Zhixu Li, Yanghua Xiao", "id": "2407.04121v1", "paper_url": "http://arxiv.org/abs/2407.04121v1", "repo": "null"}}