{"2407.18786": {"publish_time": "2024-07-26", "title": "The power of Prompts: Evaluating and Mitigating Gender Bias in MT with LLMs", "paper_summary": "This paper studies gender bias in machine translation through the lens of\nLarge Language Models (LLMs). Four widely-used test sets are employed to\nbenchmark various base LLMs, comparing their translation quality and gender\nbias against state-of-the-art Neural Machine Translation (NMT) models for\nEnglish to Catalan (En $\\rightarrow$ Ca) and English to Spanish (En\n$\\rightarrow$ Es) translation directions. Our findings reveal pervasive gender\nbias across all models, with base LLMs exhibiting a higher degree of bias\ncompared to NMT models. To combat this bias, we explore prompting engineering\ntechniques applied to an instruction-tuned LLM. We identify a prompt structure\nthat significantly reduces gender bias by up to 12% on the WinoMT evaluation\ndataset compared to more straightforward prompts. These results significantly\nreduce the gender bias accuracy gap between LLMs and traditional NMT systems.", "paper_summary_zh": "這篇論文透過大型語言模型 (LLM) 的角度研究機器翻譯中的性別偏見。採用四個廣泛使用的測試集來評量各種基礎 LLM，比較它們在英譯加泰隆語 (En $\\rightarrow$ Ca) 和英譯西班牙語 (En $\\rightarrow$ Es) 翻譯方向上的翻譯品質和性別偏見，並與最先進的神經機器翻譯 (NMT) 模型進行對比。我們的研究結果揭露所有模型中普遍存在性別偏見，與 NMT 模型相比，基礎 LLM 表現出更高的偏見程度。為了消除這種偏見，我們探索了應用於指令微調 LLM 的提示工程技術。我們確定了一個提示結構，與更直接的提示相比，在 WinoMT 評估資料集上將性別偏見顯著降低了 12%。這些結果顯著縮小了 LLM 與傳統 NMT 系統之間的性別偏見準確性差距。", "author": "Aleix Sant et.al.", "authors": "Aleix Sant, Carlos Escolano, Audrey Mash, Francesca De Luca Fornaciari, Maite Melero", "id": "2407.18786v1", "paper_url": "http://arxiv.org/abs/2407.18786v1", "repo": "null"}}