{"2410.04739": {"publish_time": "2024-10-07", "title": "TableRAG: Million-Token Table Understanding with Language Models", "paper_summary": "Recent advancements in language models (LMs) have notably enhanced their\nability to reason with tabular data, primarily through program-aided mechanisms\nthat manipulate and analyze tables. However, these methods often require the\nentire table as input, leading to scalability challenges due to the positional\nbias or context length constraints. In response to these challenges, we\nintroduce TableRAG, a Retrieval-Augmented Generation (RAG) framework\nspecifically designed for LM-based table understanding. TableRAG leverages\nquery expansion combined with schema and cell retrieval to pinpoint crucial\ninformation before providing it to the LMs. This enables more efficient data\nencoding and precise retrieval, significantly reducing prompt lengths and\nmitigating information loss. We have developed two new million-token benchmarks\nfrom the Arcade and BIRD-SQL datasets to thoroughly evaluate TableRAG's\neffectiveness at scale. Our results demonstrate that TableRAG's retrieval\ndesign achieves the highest retrieval quality, leading to the new\nstate-of-the-art performance on large-scale table understanding.", "paper_summary_zh": "語言模型 (LM) 的最新進展顯著提升了其處理表格資料的能力，主要是透過操作和分析表格的程式輔助機制。然而，這些方法通常需要整個表格作為輸入，由於位置偏差或內容長度限制，導致可擴充性挑戰。為了應對這些挑戰，我們引入了 TableRAG，一種專門為基於 LM 的表格理解而設計的檢索增強生成 (RAG) 框架。TableRAG 利用查詢擴充與架構和儲存格檢索相結合，在提供給 LM 之前精確找出關鍵資訊。這能更有效地編碼資料和精確檢索，大幅減少提示長度並減輕資訊遺失。我們從 Arcade 和 BIRD-SQL 資料集開發了兩個新的百萬代幣基準，以徹底評估 TableRAG 在大規模上的有效性。我們的結果證明，TableRAG 的檢索設計達到了最高的檢索品質，在大型表格理解上領先新的技術水準。", "author": "Si-An Chen et.al.", "authors": "Si-An Chen, Lesly Miculicich, Julian Martin Eisenschlos, Zifeng Wang, Zilong Wang, Yanfei Chen, Yasuhisa Fujii, Hsuan-Tien Lin, Chen-Yu Lee, Tomas Pfister", "id": "2410.04739v1", "paper_url": "http://arxiv.org/abs/2410.04739v1", "repo": "null"}}