{"2408.10259": {"publish_time": "2024-08-13", "title": "Contrastive Learning on Medical Intents for Sequential Prescription Recommendation", "paper_summary": "Recent advancements in sequential modeling applied to Electronic Health\nRecords (EHR) have greatly influenced prescription recommender systems. While\nthe recent literature on drug recommendation has shown promising performance,\nthe study of discovering a diversity of coexisting temporal relationships at\nthe level of medical codes over consecutive visits remains less explored. The\ngoal of this study can be motivated from two perspectives. First, there is a\nneed to develop a sophisticated sequential model capable of disentangling the\ncomplex relationships across sequential visits. Second, it is crucial to\nestablish multiple and diverse health profiles for the same patient to ensure a\ncomprehensive consideration of different medical intents in drug\nrecommendation. To achieve this goal, we introduce Attentive Recommendation\nwith Contrasted Intents (ARCI), a multi-level transformer-based method designed\nto capture the different but coexisting temporal paths across a shared sequence\nof visits. Specifically, we propose a novel intent-aware method with\ncontrastive learning, that links specialized medical intents of the patients to\nthe transformer heads for extracting distinct temporal paths associated with\ndifferent health profiles. We conducted experiments on two real-world datasets\nfor the prescription recommendation task using both ranking and classification\nmetrics. Our results demonstrate that ARCI has outperformed the\nstate-of-the-art prescription recommendation methods and is capable of\nproviding interpretable insights for healthcare practitioners.", "paper_summary_zh": "最近將序列建模應用於電子健康紀錄 (EHR) 的進展極大地影響了處方推薦系統。雖然最近關於藥物推薦的文獻顯示出令人滿意的效能，但對於在連續就診中發現共存時間關係的多樣性研究仍較少探討。本研究的目標可以從兩個角度來激勵。首先，需要開發一個複雜的序列模型，能夠解開連續就診中的複雜關係。其次，對於同一位患者建立多個且多樣化的健康檔案至關重要，以確保在藥物推薦中全面考量不同的醫療意圖。為了達成此目標，我們引入了帶有對比意圖的專注推薦 (ARCI)，這是一種基於多層次Transformer的方法，旨在擷取共享就診順序中不同但共存的時間路徑。具體來說，我們提出了一種新的意圖感知方法，採用對比學習，將患者的特殊醫療意圖與Transformer頭端連結，以擷取與不同健康檔案相關的不同時間路徑。我們在兩個真實世界的資料集上進行了處方推薦任務的實驗，同時使用排名和分類指標。我們的結果證明 ARCI 優於最先進的處方推薦方法，並且能夠為醫療保健從業人員提供可解釋的見解。", "author": "Arya Hadizadeh Moghaddam et.al.", "authors": "Arya Hadizadeh Moghaddam, Mohsen Nayebi Kerdabadi, Mei Liu, Zijun Yao", "id": "2408.10259v1", "paper_url": "http://arxiv.org/abs/2408.10259v1", "repo": "null"}}