{"2411.08645": {"publish_time": "2024-11-13", "title": "A System Level Performance Evaluation for Superconducting Digital Systems", "paper_summary": "Superconducting Digital (SCD) technology offers significant potential for\nenhancing the performance of next generation large scale compute workloads. By\nleveraging advanced lithography and a 300 mm platform, SCD devices can reduce\nenergy consumption and boost computational power. This paper presents a\ncross-layer modeling approach to evaluate the system-level performance benefits\nof SCD architectures for Large Language Model (LLM) training and inference. Our\nfindings, based on experimental data and Pulse Conserving Logic (PCL) design\nprinciples, demonstrate substantial performance gain in both training and\ninference. We are, thus, able to convincingly show that the SCD technology can\naddress memory and interconnect limitations of present day solutions for\nnext-generation compute systems.", "paper_summary_zh": "超導數位 (SCD) 技術為提升次世代大型運算工作負載效能提供了顯著的潛力。藉由先進的光刻技術和 300 毫米平台，SCD 裝置可降低能源消耗並提升運算能力。本文提出了一種跨層級建模方法，用於評估 SCD 架構在大型語言模型 (LLM) 訓練和推論方面的系統級效能優勢。我們的發現基於實驗數據和脈衝節能邏輯 (PCL) 設計原則，證明了在訓練和推論方面都有顯著的效能提升。因此，我們得以令人信服地證明 SCD 技術可以解決現今解決方案在記憶體和互連方面的限制，以用於次世代運算系統。", "author": "Joyjit Kundu et.al.", "authors": "Joyjit Kundu, Debjyoti Bhattacharjee, Nathan Josephsen, Ankit Pokhrel, Udara De Silva, Wenzhe Guo, Steven Van Winckel, Steven Brebels, Manu Perumkunnil, Quentin Herr, Anna Herr", "id": "2411.08645v1", "paper_url": "http://arxiv.org/abs/2411.08645v1", "repo": "null"}}