{"2501.13467": {"publish_time": "2025-01-23", "title": "Multi-Level Attention and Contrastive Learning for Enhanced Text Classification with an Optimized Transformer", "paper_summary": "This paper studies a text classification algorithm based on an improved\nTransformer to improve the performance and efficiency of the model in text\nclassification tasks. Aiming at the shortcomings of the traditional Transformer\nmodel in capturing deep semantic relationships and optimizing computational\ncomplexity, this paper introduces a multi-level attention mechanism and a\ncontrastive learning strategy. The multi-level attention mechanism effectively\nmodels the global semantics and local features in the text by combining global\nattention with local attention; the contrastive learning strategy enhances the\nmodel's ability to distinguish between different categories by constructing\npositive and negative sample pairs while improving the classification effect.\nIn addition, in order to improve the training and inference efficiency of the\nmodel on large-scale text data, this paper designs a lightweight module to\noptimize the feature transformation process and reduce the computational cost.\nExperimental results on the dataset show that the improved Transformer model\noutperforms the comparative models such as BiLSTM, CNN, standard Transformer,\nand BERT in terms of classification accuracy, F1 score, and recall rate,\nshowing stronger semantic representation ability and generalization\nperformance. The method proposed in this paper provides a new idea for\nalgorithm optimization in the field of text classification and has good\napplication potential and practical value. Future work will focus on studying\nthe performance of this model in multi-category imbalanced datasets and\ncross-domain tasks and explore the integration wi", "paper_summary_zh": "本文研究了一种基于改进 Transformer 的文本分类算法，以提高模型在文本分类任务中的性能和效率。针对传统 Transformer 模型在捕捉深度语义关系和优化计算复杂度方面的不足，本文引入了一种多级注意力机制和一种对比学习策略。多级注意力机制通过将全局注意力与局部注意力相结合，有效地对文本中的全局语义和局部特征进行建模；对比学习策略通过构建正负样本对，在提高分类效果的同时增强了模型区分不同类别的能力。此外，为了提高模型在大规模文本数据上的训练和推理效率，本文设计了一个轻量级模块，以优化特征转换过程并降低计算成本。在数据集上的实验结果表明，改进后的 Transformer 模型在分类准确率、F1 得分和召回率方面优于 BiLSTM、CNN、标准 Transformer 和 BERT 等对比模型，表现出更强的语义表示能力和泛化性能。本文提出的方法为文本分类领域中的算法优化提供了新思路，具有良好的应用潜力和实用价值。未来的工作将重点研究该模型在多类别不平衡数据集和跨域任务中的性能，并探索与", "author": "Jia Gao et.al.", "authors": "Jia Gao, Guiran Liu, Binrong Zhu, Shicheng Zhou, Hongye Zheng, Xiaoxuan Liao", "id": "2501.13467v1", "paper_url": "http://arxiv.org/abs/2501.13467v1", "repo": "null"}}