{"2408.02143": {"publish_time": "2024-08-04", "title": "Analyzing Cultural Representations of Emotions in LLMs through Mixed Emotion Survey", "paper_summary": "Large Language Models (LLMs) have gained widespread global adoption,\nshowcasing advanced linguistic capabilities across multiple of languages. There\nis a growing interest in academia to use these models to simulate and study\nhuman behaviors. However, it is crucial to acknowledge that an LLM's\nproficiency in a specific language might not fully encapsulate the norms and\nvalues associated with its culture. Concerns have emerged regarding potential\nbiases towards Anglo-centric cultures and values due to the predominance of\nWestern and US-based training data. This study focuses on analyzing the\ncultural representations of emotions in LLMs, in the specific case of\nmixed-emotion situations. Our methodology is based on the studies of Miyamoto\net al. (2010), which identified distinctive emotional indicators in Japanese\nand American human responses. We first administer their mixed emotion survey to\nfive different LLMs and analyze their outputs. Second, we experiment with\ncontextual variables to explore variations in responses considering both\nlanguage and speaker origin. Thirdly, we expand our investigation to encompass\nadditional East Asian and Western European origin languages to gauge their\nalignment with their respective cultures, anticipating a closer fit. We find\nthat (1) models have limited alignment with the evidence in the literature; (2)\nwritten language has greater effect on LLMs' response than information on\nparticipants origin; and (3) LLMs responses were found more similar for East\nAsian languages than Western European languages.", "paper_summary_zh": "大型語言模型（LLM）已獲得全球廣泛採用，展示了跨多種語言的高階語言能力。學術界對使用這些模型來模擬和研究人類行為越來越感興趣。然而，必須承認，LLM 在特定語言中的熟練程度可能無法完全概括與其文化相關的規範和價值觀。由於西方和美國訓練資料佔主導地位，因此出現了對英格蘭中心文化和價值觀潛在偏見的擔憂。本研究重點分析 LLM 中情緒的文化表徵，特別是混合情緒的情況。我們的研究方法基於 Miyamoto 等人的研究。（2010 年），該研究確定了日本和美國人類反應中獨特的情緒指標。我們首先對五種不同的 LLM 進行他們的混合情緒調查，並分析其輸出。其次，我們實驗上下文變數，以探討考慮語言和說話者來源的回應變化。第三，我們擴大調查範圍，涵蓋更多東亞和西歐起源語言，以評估它們與各自文化的契合度，並預期更密切的契合。我們發現 (1) 模型與文獻中的證據對齊有限；(2) 書面語言對 LLM 的回應比參與者來源的資訊有更大的影響；(3) 發現 LLM 對東亞語言的回應比對西歐語言的回應更相似。", "author": "Shiran Dudy et.al.", "authors": "Shiran Dudy, Ibrahim Said Ahmad, Ryoko Kitajima, Agata Lapedriza", "id": "2408.02143v1", "paper_url": "http://arxiv.org/abs/2408.02143v1", "repo": "null"}}