{"2409.14876": {"publish_time": "2024-09-23", "title": "Mammo-Clustering:A Weakly Supervised Multi-view Global-Local Context Clustering Network for Detection and Classification in Mammography", "paper_summary": "Breast cancer has long posed a significant threat to women's health, making\nearly screening crucial for mitigating its impact. However, mammography, the\npreferred method for early screening, faces limitations such as the burden of\ndouble reading by radiologists, challenges in widespread adoption in remote and\nunderdeveloped areas, and obstacles in intelligent early screening development\ndue to data constraints. To address these challenges, we propose a weakly\nsupervised multi-view mammography early screening model for breast cancer based\non context clustering. Context clustering, a feature extraction structure that\nis neither CNN nor transformer, combined with multi-view learning for\ninformation complementation, presents a promising approach. The weak\nsupervision design specifically addresses data limitations. Our model achieves\nstate-of-the-art performance with fewer parameters on two public datasets, with\nan AUC of 0.828 on the Vindr-Mammo dataset and 0.805 on the CBIS-DDSM dataset.\nOur model shows potential in reducing the burden on doctors and increasing the\nfeasibility of breast cancer screening for women in underdeveloped regions.", "paper_summary_zh": "乳癌長期以來對女性健康構成重大威脅，及早篩檢對於減輕其影響至關重要。然而，乳房攝影術作為早期篩檢的首選方式，卻面臨放射科醫師雙重判讀的負擔、在偏遠和未開發地區廣泛採用所面臨的挑戰，以及由於資料限制而導致的智慧型早期篩檢開發障礙等限制。為了應對這些挑戰，我們提出一個基於脈絡聚類的乳癌弱監督多視角乳房攝影早期篩檢模型。脈絡聚類是一種既非 CNN 也非轉換器的特徵提取結構，結合多視角學習進行資訊互補，提供了一個有前景的方法。弱監督設計特別解決了資料限制的問題。我們的模型在兩個公開資料集上以較少的參數達到了最先進的效能，在 Vindr-Mammo 資料集上的 AUC 為 0.828，在 CBIS-DDSM 資料集上的 AUC 為 0.805。我們的模型顯示出減輕醫生負擔和增加未開發地區女性乳癌篩檢可行性的潛力。", "author": "Shilong Yang et.al.", "authors": "Shilong Yang, Chulong Zhang, Qi Zang, Juan Yu, Liang Zeng, Xiao Luo, Yexuan Xing, Xin Pan, Qi Li, Xiaokun Liang, Yaoqin Xie", "id": "2409.14876v1", "paper_url": "http://arxiv.org/abs/2409.14876v1", "repo": "null"}}