{"2408.00283": {"publish_time": "2024-08-01", "title": "Navigating Text-to-Image Generative Bias across Indic Languages", "paper_summary": "This research investigates biases in text-to-image (TTI) models for the Indic\nlanguages widely spoken across India. It evaluates and compares the generative\nperformance and cultural relevance of leading TTI models in these languages\nagainst their performance in English. Using the proposed IndicTTI benchmark, we\ncomprehensively assess the performance of 30 Indic languages with two\nopen-source diffusion models and two commercial generation APIs. The primary\nobjective of this benchmark is to evaluate the support for Indic languages in\nthese models and identify areas needing improvement. Given the linguistic\ndiversity of 30 languages spoken by over 1.4 billion people, this benchmark\naims to provide a detailed and insightful analysis of TTI models' effectiveness\nwithin the Indic linguistic landscape. The data and code for the IndicTTI\nbenchmark can be accessed at\nhttps://iab-rubric.org/resources/other-databases/indictti.", "paper_summary_zh": "這項研究調查了印度廣泛使用的指示語言中文字轉圖像 (TTI) 模型的偏見。它評估並比較了這些語言中領先的 TTI 模型的生成效能和文化相關性，並與它們在英語中的效能進行比較。使用建議的 IndicTTI 基準，我們全面評估了 30 種指示語言的效能，並使用兩個開源擴散模型和兩個商業生成 API。此基準的主要目標是評估這些模型對指示語言的支援，並找出需要改進的地方。由於 30 種語言的語言多樣性，由超過 14 億人使用，此基準旨在提供對指示語言環境中 TTI 模型有效性的詳細且有見地的分析。IndicTTI 基準的資料和程式碼可於 https://iab-rubric.org/resources/other-databases/indictti 取得。", "author": "Surbhi Mittal et.al.", "authors": "Surbhi Mittal, Arnav Sudan, Mayank Vatsa, Richa Singh, Tamar Glaser, Tal Hassner", "id": "2408.00283v1", "paper_url": "http://arxiv.org/abs/2408.00283v1", "repo": "null"}}