{"2406.06470": {"publish_time": "2024-06-10", "title": "GKAN: Graph Kolmogorov-Arnold Networks", "paper_summary": "We introduce Graph Kolmogorov-Arnold Networks (GKAN), an innovative neural\nnetwork architecture that extends the principles of the recently proposed\nKolmogorov-Arnold Networks (KAN) to graph-structured data. By adopting the\nunique characteristics of KANs, notably the use of learnable univariate\nfunctions instead of fixed linear weights, we develop a powerful model for\ngraph-based learning tasks. Unlike traditional Graph Convolutional Networks\n(GCNs) that rely on a fixed convolutional architecture, GKANs implement\nlearnable spline-based functions between layers, transforming the way\ninformation is processed across the graph structure. We present two different\nways to incorporate KAN layers into GKAN: architecture 1 -- where the learnable\nfunctions are applied to input features after aggregation and architecture 2 --\nwhere the learnable functions are applied to input features before aggregation.\nWe evaluate GKAN empirically using a semi-supervised graph learning task on a\nreal-world dataset (Cora). We find that architecture generally performs better.\nWe find that GKANs achieve higher accuracy in semi-supervised learning tasks on\ngraphs compared to the traditional GCN model. For example, when considering 100\nfeatures, GCN provides an accuracy of 53.5 while a GKAN with a comparable\nnumber of parameters gives an accuracy of 61.76; with 200 features, GCN\nprovides an accuracy of 61.24 while a GKAN with a comparable number of\nparameters gives an accuracy of 67.66. We also present results on the impact of\nvarious parameters such as the number of hidden nodes, grid-size, and the\npolynomial-degree of the spline on the performance of GKAN.", "paper_summary_zh": "<paragraph>我們介紹圖形柯爾莫哥洛夫-阿諾德網路 (GKAN)，這是一種創新的神經網路架構，它將最近提出的柯爾莫哥洛夫-阿諾德網路 (KAN) 原理擴展到圖形結構資料。透過採用 KAN 的獨特特性，特別是使用可學習的單變量函數代替固定的線性權重，我們開發了一個用於基於圖形的學習任務的強大模型。與依賴於固定卷積架構的傳統圖形卷積網路 (GCN) 不同，GKAN 在層之間實作可學習的基於樣條的函數，轉換了在圖形結構中處理資訊的方式。我們提出兩種不同的方式將 KAN 層納入 GKAN：架構 1 -- 其中可學習的函數在聚合後應用於輸入特徵，以及架構 2 -- 其中可學習的函數在聚合前應用於輸入特徵。我們使用真實世界資料集 (Cora) 上的半監督圖形學習任務，對 GKAN 進行經驗評估。我們發現架構 1 通常表現得更好。我們發現，與傳統 GCN 模型相比，GKAN 在圖形上的半監督學習任務中獲得更高的準確度。例如，在考慮 100 個特徵時，GCN 提供 53.5 的準確度，而具有可比參數數量的 GKAN 提供 61.76 的準確度；對於 200 個特徵，GCN 提供 61.24 的準確度，而具有可比參數數量的 GKAN 提供 67.66 的準確度。我們還提供了各種參數對 GKAN 效能的影響的結果，例如隱藏節點數、網格大小和樣條的多項式次數。</paragraph>", "author": "Mehrdad Kiamari et.al.", "authors": "Mehrdad Kiamari, Mohammad Kiamari, Bhaskar Krishnamachari", "id": "2406.06470v1", "paper_url": "http://arxiv.org/abs/2406.06470v1", "repo": "null"}}