{"2405.18327": {"publish_time": "2024-05-28", "title": "Histopathology Based AI Model Predicts Anti-Angiogenic Therapy Response in Renal Cancer Clinical Trial", "paper_summary": "Predictive biomarkers of treatment response are lacking for metastatic clear\ncell renal cell carcinoma (ccRCC), a tumor type that is treated with\nangiogenesis inhibitors, immune checkpoint inhibitors, mTOR inhibitors and a\nHIF2 inhibitor. The Angioscore, an RNA-based quantification of angiogenesis, is\narguably the best candidate to predict anti-angiogenic (AA) response. However,\nthe clinical adoption of transcriptomic assays faces several challenges\nincluding standardization, time delay, and high cost. Further, ccRCC tumors are\nhighly heterogenous, and sampling multiple areas for sequencing is impractical.\nHere we present a novel deep learning (DL) approach to predict the Angioscore\nfrom ubiquitous histopathology slides. To overcome the lack of\ninterpretability, one of the biggest limitations of typical DL models, our\nmodel produces a visual vascular network which is the basis of the model's\nprediction. To test its reliability, we applied this model to multiple cohorts\nincluding a clinical trial dataset. Our model accurately predicts the RNA-based\nAngioscore on multiple independent cohorts (spearman correlations of 0.77 and\n0.73). Further, the predictions help unravel meaningful biology such as\nassociation of angiogenesis with grade, stage, and driver mutation status.\nFinally, we find our model can predict response to AA therapy, in both a\nreal-world cohort and the IMmotion150 clinical trial. The predictive power of\nour model vastly exceeds that of CD31, a marker of vasculature, and nearly\nrivals the performance (c-index 0.66 vs 0.67) of the ground truth RNA-based\nAngioscore at a fraction of the cost. By providing a robust yet interpretable\nprediction of the Angioscore from histopathology slides alone, our approach\noffers insights into angiogenesis biology and AA treatment response.", "paper_summary_zh": "<paragraph>對於轉移性透明細胞腎細胞癌 (ccRCC)，一種用於治療血管生成抑制劑、免疫檢查點抑制劑、mTOR 抑制劑和 HIF2 抑制劑的腫瘤類型，目前缺乏治療反應的預測性生物標記。Angioscore 是一種基於 RNA 的血管生成量化，可以說是預測抗血管生成 (AA) 反應的最佳候選者。然而，轉錄組檢測的臨床應用面臨著標準化、時間延遲和高成本等多項挑戰。此外，ccRCC 腫瘤高度異質，對多個區域進行取樣以進行測序並不切實際。在此，我們提出了一種新穎的深度學習 (DL) 方法，可從普遍存在的組織病理切片中預測 Angioscore。為了克服可解釋性的缺乏，這是典型 DL 模型最大的限制之一，我們的模型產生了一個視覺血管網路，這是模型預測的基礎。為了測試其可靠性，我們將此模型應用於多個群組，包括臨床試驗資料集。我們的模型準確預測了多個獨立群組的基於 RNA 的 Angioscore（spearman 相關係數為 0.77 和 0.73）。此外，這些預測有助於解開有意義的生物學，例如血管生成與等級、階段和驅動突變狀態的關聯。最後，我們發現我們的模型可以預測對 AA 治療的反應，無論是在現實世界群組還是 IMmotion150 臨床試驗中。我們模型的預測能力遠遠超過血管標記 CD31，並且幾乎與基於 RNA 的真實 Angioscore 的效能（c 指數 0.66 對 0.67）相當，而成本卻只是後者的零頭。通過僅從組織病理切片中提供對 Angioscore 的強大且可解釋的預測，我們的方法提供了對血管生成生物學和 AA 治療反應的見解。</paragraph>", "author": "Jay Jasti et.al.", "authors": "Jay Jasti, Hua Zhong, Vandana Panwar, Vipul Jarmale, Jeffrey Miyata, Deyssy Carrillo, Alana Christie, Dinesh Rakheja, Zora Modrusan, Edward Ernest Kadel III, Niha Beig, Mahrukh Huseni, James Brugarolas, Payal Kapur, Satwik Rajaram", "id": "2405.18327v1", "paper_url": "http://arxiv.org/abs/2405.18327v1", "repo": "null"}}