{"2406.16453": {"publish_time": "2024-06-24", "title": "Learning in Wilson-Cowan model for metapopulation", "paper_summary": "The Wilson-Cowan model for metapopulation, a Neural Mass Network Model,\ntreats different subcortical regions of the brain as connected nodes, with\nconnections representing various types of structural, functional, or effective\nneuronal connectivity between these regions. Each region comprises interacting\npopulations of excitatory and inhibitory cells, consistent with the standard\nWilson-Cowan model. By incorporating stable attractors into such a\nmetapopulation model's dynamics, we transform it into a learning algorithm\ncapable of achieving high image and text classification accuracy. We test it on\nMNIST and Fashion MNIST, in combination with convolutional neural networks, on\nCIFAR-10 and TF-FLOWERS, and, in combination with a transformer architecture\n(BERT), on IMDB, always showing high classification accuracy. These numerical\nevaluations illustrate that minimal modifications to the Wilson-Cowan model for\nmetapopulation can reveal unique and previously unobserved dynamics.", "paper_summary_zh": "Wilson-Cowan 元種群模型，一種神經質量網路模型，\n將大腦的不同皮質下區域視為相連節點，其中連接代表這些區域之間的各種結構、功能或有效神經元連接。每個區域都包含相互作用的興奮性和抑制性細胞群，與標準的 Wilson-Cowan 模型一致。通過將穩定的吸引子納入這種元種群模型的動態中，我們將其轉變為一種學習演算法，能夠實現高影像和文字分類準確度。我們在 MNIST 和 Fashion MNIST 上對其進行測試，與卷積神經網路結合使用，在 CIFAR-10 和 TF-FLOWERS 上，以及與Transformer架構 (BERT) 結合使用，在 IMDB 上，始終顯示出高分類準確度。這些數值評估說明對元種群的 Wilson-Cowan 模型進行最小的修改可以揭示獨特且以前未觀察到的動態。", "author": "Raffaele Marino et.al.", "authors": "Raffaele Marino, Lorenzo Buffoni, Lorenzo Chicchi, Francesca Di Patti, Diego Febbe, Lorenzo Giambagli, Duccio Fanelli", "id": "2406.16453v1", "paper_url": "http://arxiv.org/abs/2406.16453v1", "repo": "https://github.com/raffaelemarino/learning_in_wilsoncowan"}}