{"2501.13484": {"publish_time": "2025-01-23", "title": "MambaQuant: Quantizing the Mamba Family with Variance Aligned Rotation Methods", "paper_summary": "Mamba is an efficient sequence model that rivals Transformers and\ndemonstrates significant potential as a foundational architecture for various\ntasks. Quantization is commonly used in neural networks to reduce model size\nand computational latency. However, applying quantization to Mamba remains\nunderexplored, and existing quantization methods, which have been effective for\nCNN and Transformer models, appear inadequate for Mamba models (e.g., Quarot\nsuffers a 21% accuracy drop on Vim-T$^\\dagger$ even under W8A8). We have\npioneered the exploration of this issue and identified several key challenges.\nFirst, significant outliers are present in gate projections, output\nprojections, and matrix multiplications. Second, Mamba's unique parallel scan\nfurther amplifies these outliers, leading to uneven and heavy-tailed data\ndistributions. Third, even with the application of the Hadamard transform, the\nvariance across channels in weights and activations still remains inconsistent.\nTo these ends, we propose MambaQuant, a post-training quantization (PTQ)\nframework consisting of: 1) Karhunen-Loeve Transformation (KLT) enhanced\nrotation, rendering the rotation matrix adaptable to diverse channel\ndistributions. 2) Smooth-Fused rotation, which equalizes channel variances and\ncan merge additional parameters into model weights. Experiments show that\nMambaQuant can quantize both weights and activations into 8-bit with less than\n1% accuracy loss for Mamba-based vision and language tasks. To the best of our\nknowledge, MambaQuant is the first comprehensive PTQ design for the Mamba\nfamily, paving the way for further advancements in its application.", "paper_summary_zh": "Mamba 是一種高效的序列模型，可與 Transformers 相媲美，並展示出作為各種任務基礎架構的巨大潛力。量化通常用於神經網路，以減少模型大小和計算延遲。然而，將量化應用於 Mamba 仍未得到充分探索，而現有的量化方法（對 CNN 和 Transformer 模型有效）似乎不適合 Mamba 模型（例如，即使在 W8A8 下，Quarot 在 Vim-T$^\\dagger$ 上的準確度也會下降 21%）。我們率先探索了這個問題，並找出幾個關鍵挑戰。首先，閘門投影、輸出投影和矩陣乘法中存在顯著異常值。其次，Mamba 獨特的並行掃描進一步放大了這些異常值，導致數據分佈不均且尾部較重。第三，即使應用 Hadamard 變換，權重和激活中的通道間差異仍然不一致。為此，我們提出了 MambaQuant，一個由以下部分組成的訓練後量化 (PTQ) 框架：1) 卡倫-羅夫變換 (KLT) 增強旋轉，使旋轉矩陣適應不同的通道分佈。2) 平滑融合旋轉，它使通道方差相等，並且可以將額外參數合併到模型權重中。實驗表明，MambaQuant 可以將權重和激活量化為 8 位，而基於 Mamba 的視覺和語言任務的準確度損失小於 1%。據我們所知，MambaQuant 是 Mamba 家族的第一個綜合性 PTQ 設計，為其應用進一步發展鋪平了道路。", "author": "Zukang Xu et.al.", "authors": "Zukang Xu, Yuxuan Yue, Xing Hu, Zhihang Yuan, Zixu Jiang, Zhixuan Chen, Jiangyong Yu, Chen Xu, Sifan Zhou, Dawei Yang", "id": "2501.13484v1", "paper_url": "http://arxiv.org/abs/2501.13484v1", "repo": "https://github.com/mambaquant/mambaquant"}}