{"2412.20361": {"publish_time": "2024-12-29", "title": "Safe Multiagent Coordination via Entropic Exploration", "paper_summary": "Many real-world multiagent learning problems involve safety concerns. In\nthese setups, typical safe reinforcement learning algorithms constrain agents'\nbehavior, limiting exploration -- a crucial component for discovering effective\ncooperative multiagent behaviors. Moreover, the multiagent literature typically\nmodels individual constraints for each agent and has yet to investigate the\nbenefits of using joint team constraints. In this work, we analyze these team\nconstraints from a theoretical and practical perspective and propose entropic\nexploration for constrained multiagent reinforcement learning (E2C) to address\nthe exploration issue. E2C leverages observation entropy maximization to\nincentivize exploration and facilitate learning safe and effective cooperative\nbehaviors. Experiments across increasingly complex domains show that E2C agents\nmatch or surpass common unconstrained and constrained baselines in task\nperformance while reducing unsafe behaviors by up to $50\\%$.", "paper_summary_zh": "在許多真實世界的多智能體學習問題中，都涉及到安全問題。在這些設定中，典型的安全強化學習演算法會限制智能體的行為，限制探索——探索是發現有效合作多智能體行為的關鍵組成部分。此外，多智能體文獻通常為每個智能體建模個別約束，但尚未探討使用聯合團隊約束的好處。在這項工作中，我們從理論和實務角度分析這些團隊約束，並提出用於受約束多智能體強化學習（E2C）的熵探索，以解決探索問題。E2C 利用觀測熵最大化來激勵探索，並促進學習安全且有效的合作行為。在越來越複雜的領域中進行的實驗表明，E2C 智能體在任務執行中匹配或超越常見的無約束和受約束基線，同時將不安全行為減少了 50%。", "author": "Ayhan Alp Aydeniz et.al.", "authors": "Ayhan Alp Aydeniz, Enrico Marchesini, Robert Loftin, Christopher Amato, Kagan Tumer", "id": "2412.20361v1", "paper_url": "http://arxiv.org/abs/2412.20361v1", "repo": "null"}}