{"2406.05113": {"publish_time": "2024-06-07", "title": "LLavaGuard: VLM-based Safeguards for Vision Dataset Curation and Safety Assessment", "paper_summary": "We introduce LlavaGuard, a family of VLM-based safeguard models, offering a\nversatile framework for evaluating the safety compliance of visual content.\nSpecifically, we designed LlavaGuard for dataset annotation and generative\nmodel safeguarding. To this end, we collected and annotated a high-quality\nvisual dataset incorporating a broad safety taxonomy, which we use to tune VLMs\non context-aware safety risks. As a key innovation, LlavaGuard's new responses\ncontain comprehensive information, including a safety rating, the violated\nsafety categories, and an in-depth rationale. Further, our introduced\ncustomizable taxonomy categories enable the context-specific alignment of\nLlavaGuard to various scenarios. Our experiments highlight the capabilities of\nLlavaGuard in complex and real-world applications. We provide checkpoints\nranging from 7B to 34B parameters demonstrating state-of-the-art performance,\nwith even the smallest models outperforming baselines like GPT-4. We make our\ndataset and model weights publicly available and invite further research to\naddress the diverse needs of communities and contexts.", "paper_summary_zh": "我們介紹 LlavaGuard，一個基於 VLM 的保障模型家族，提供了一個多功能框架，用於評估視覺內容的安全性合規性。具體來說，我們設計 LlavaGuard 用於資料集註解和生成模型保障。為此，我們收集並註解了一個包含廣泛安全分類法的高品質視覺資料集，我們使用它來調整 VLM 以應對與情境相關的安全風險。作為一項關鍵創新，LlavaGuard 的新回應包含綜合資訊，包括安全評級、違規的安全類別和深入的依據。此外，我們引入的可自訂分類法類別能讓 LlavaGuard 與各種情境進行情境特定的比對。我們的實驗突顯了 LlavaGuard 在複雜和真實世界應用中的能力。我們提供從 7B 到 34B 參數的檢查點，展示了最先進的效能，即使是最小的模型也優於 GPT-4 等基準。我們公開我們的資料集和模型權重，並邀請進一步的研究，以滿足社群和情境的各種需求。", "author": "Lukas Helff et.al.", "authors": "Lukas Helff, Felix Friedrich, Manuel Brack, Kristian Kersting, Patrick Schramowski", "id": "2406.05113v1", "paper_url": "http://arxiv.org/abs/2406.05113v1", "repo": "null"}}