{"2410.18040": {"publish_time": "2024-10-23", "title": "Key Algorithms for Keyphrase Generation: Instruction-Based LLMs for Russian Scientific Keyphrases", "paper_summary": "Keyphrase selection is a challenging task in natural language processing that\nhas a wide range of applications. Adapting existing supervised and unsupervised\nsolutions for the Russian language faces several limitations due to the rich\nmorphology of Russian and the limited number of training datasets available.\nRecent studies conducted on English texts show that large language models\n(LLMs) successfully address the task of generating keyphrases. LLMs allow\nachieving impressive results without task-specific fine-tuning, using text\nprompts instead. In this work, we access the performance of prompt-based\nmethods for generating keyphrases for Russian scientific abstracts. First, we\ncompare the performance of zero-shot and few-shot prompt-based methods,\nfine-tuned models, and unsupervised methods. Then we assess strategies for\nselecting keyphrase examples in a few-shot setting. We present the outcomes of\nhuman evaluation of the generated keyphrases and analyze the strengths and\nweaknesses of the models through expert assessment. Our results suggest that\nprompt-based methods can outperform common baselines even using simple text\nprompts.", "paper_summary_zh": "關鍵字選取是自然語言處理中的一項挑戰性任務，具有廣泛的應用。由於俄語豐富的形態和有限的訓練資料集，採用現有的監督式和非監督式解決方案來適應俄語面臨著一些限制。最近對英語文本進行的研究表明，大型語言模型 (LLM) 成功地解決了生成關鍵字的任務。LLM 允許在不進行特定於任務的微調的情況下實現令人印象深刻的結果，而是使用文本提示。在這項工作中，我們訪問了基於提示的方法在為俄羅斯科學摘要生成關鍵字方面的性能。首先，我們比較了零次和少次基於提示的方法、微調模型和非監督式方法的性能。然後，我們評估在少次設置中選擇關鍵字範例的策略。我們展示了對生成關鍵字的人工評估結果，並通過專家評估分析模型的優點和缺點。我們的結果表明，即使使用簡單的文本提示，基於提示的方法也可以優於常見的基準。", "author": "Anna Glazkova et.al.", "authors": "Anna Glazkova, Dmitry Morozov, Timur Garipov", "id": "2410.18040v1", "paper_url": "http://arxiv.org/abs/2410.18040v1", "repo": "null"}}