{"2411.08335": {"publish_time": "2024-11-13", "title": "DEEGITS: Deep Learning based Framework for Measuring Heterogenous Traffic State in Challenging Traffic Scenarios", "paper_summary": "This paper presents DEEGITS (Deep Learning Based Heterogeneous Traffic State\nMeasurement), a comprehensive framework that leverages state-of-the-art\nconvolutional neural network (CNN) techniques to accurately and rapidly detect\nvehicles and pedestrians, as well as to measure traffic states in challenging\nscenarios (i.e., congestion, occlusion). In this study, we enhance the training\ndataset through data fusion, enabling simultaneous detection of vehicles and\npedestrians. Image preprocessing and augmentation are subsequently performed to\nimprove the quality and quantity of the dataset. Transfer learning is applied\non the YOLOv8 pretrained model to increase the model's capability to identify a\ndiverse array of vehicles. Optimal hyperparameters are obtained using the Grid\nSearch algorithm, with the Stochastic Gradient Descent (SGD) optimizer\noutperforming other optimizers under these settings. Extensive experimentation\nand evaluation demonstrate substantial accuracy within the detection framework,\nwith the model achieving 0.794 mAP@0.5 on the validation set and 0.786 mAP@0.5\non the test set, surpassing previous benchmarks on similar datasets. The\nDeepSORT multi-object tracking algorithm is incorporated to track detected\nvehicles and pedestrians in this study. Finally, the framework is tested to\nmeasure heterogeneous traffic states in mixed traffic conditions. Two locations\nwith differing traffic compositions and congestion levels are selected: one\nmotorized-dominant location with moderate density and one\nnon-motorized-dominant location with higher density. Errors are statistically\ninsignificant for both cases, showing correlations from 0.99 to 0.88 and 0.91\nto 0.97 for heterogeneous traffic flow and speed measurements, respectively.", "paper_summary_zh": "<paragraph>本文提出了 DEEGITS（深度學習異質交通狀態測量），這是一個全面的框架，利用最先進的卷積神經網路 (CNN) 技術準確且快速地偵測車輛和行人，以及測量具有挑戰性的場景（例如擁塞、遮擋）中的交通狀態。在本研究中，我們透過資料融合來增強訓練資料集，同時偵測車輛和行人。隨後執行影像預處理和擴充，以提高資料集的品質和數量。將轉移學習應用於 YOLOv8 預訓練模型，以增加模型識別各種車輛的能力。使用網格搜尋演算法取得最佳超參數，其中隨機梯度下降 (SGD) 優化器在這些設定下優於其他優化器。廣泛的實驗和評估證明了偵測框架中的實質準確性，模型在驗證集上達到 0.794 mAP@0.5，在測試集上達到 0.786 mAP@0.5，超越了類似資料集上的先前基準。本研究中整合了 DeepSORT 多目標追蹤演算法，用於追蹤偵測到的車輛和行人。最後，測試框架以測量混合交通狀況中的異質交通狀態。選擇了兩個交通組成和擁塞程度不同的地點：一個機動車輛佔優的地點，密度中等，另一個非機動車輛佔優的地點，密度較高。在兩種情況下，誤差在統計上都無顯著差異，異質交通流和速度測量的相關性分別為 0.99 到 0.88 和 0.91 到 0.97。</paragraph>", "author": "Muttahirul Islam et.al.", "authors": "Muttahirul Islam, Nazmul Haque, Md. Hadiuzzaman", "id": "2411.08335v1", "paper_url": "http://arxiv.org/abs/2411.08335v1", "repo": "null"}}