{"2502.06635": {"publish_time": "2025-02-10", "title": "Steel-LLM:From Scratch to Open Source -- A Personal Journey in Building a Chinese-Centric LLM", "paper_summary": "Steel-LLM is a Chinese-centric language model developed from scratch with the\ngoal of creating a high-quality, open-source model despite limited\ncomputational resources. Launched in March 2024, the project aimed to train a\n1-billion-parameter model on a large-scale dataset, prioritizing transparency\nand the sharing of practical insights to assist others in the community. The\ntraining process primarily focused on Chinese data, with a small proportion of\nEnglish data included, addressing gaps in existing open-source LLMs by\nproviding a more detailed and practical account of the model-building journey.\nSteel-LLM has demonstrated competitive performance on benchmarks such as CEVAL\nand CMMLU, outperforming early models from larger institutions. This paper\nprovides a comprehensive summary of the project's key contributions, including\ndata collection, model design, training methodologies, and the challenges\nencountered along the way, offering a valuable resource for researchers and\npractitioners looking to develop their own LLMs. The model checkpoints and\ntraining script are available at https://github.com/zhanshijinwat/Steel-LLM.", "paper_summary_zh": "Steel-LLM 是一個以中文為中心的語言模型，從頭開始開發，目標是儘管計算資源有限，也能建立一個高品質、開放原始碼的模型。該專案於 2024 年 3 月推出，目標是針對大型資料集訓練一個有 10 億個參數的模型，優先考量透明度和分享實務見解，以協助社群中的其他人。訓練過程主要針對中文資料，並加入一小部分英文資料，透過提供更詳細、更實用的模型建置歷程說明，來解決現有開放原始碼 LLM 的不足之處。Steel-LLM 已在 CEVAL 和 CMMLU 等基準測試中展現出競爭力，超越了大型機構的早期模型。本文全面摘要了該專案的主要貢獻，包括資料收集、模型設計、訓練方法，以及過程中遭遇的挑戰，為有興趣開發自己 LLM 的研究人員和實務工作者提供寶貴的資源。模型檢查點和訓練指令碼可在 https://github.com/zhanshijinwat/Steel-LLM 找到。", "author": "Qingshui Gu et.al.", "authors": "Qingshui Gu, Shu Li, Tianyu Zheng, Zhaoxiang Zhang", "id": "2502.06635v1", "paper_url": "http://arxiv.org/abs/2502.06635v1", "repo": "null"}}