{"2412.09460": {"publish_time": "2024-12-12", "title": "The Impact of Copyrighted Material on Large Language Models: A Norwegian Perspective", "paper_summary": "The use of copyrighted materials in training generative language models\nraises critical legal and ethical questions. This paper presents a framework\nfor and the results of empirically assessing the impact of copyrighted\nmaterials on the performance of large language models (LLMs) for Norwegian. We\nfound that both books and newspapers contribute positively when the models are\nevaluated on a diverse set of Norwegian benchmarks, while fiction works\npossibly lead to decreased performance. Our experiments could inform the\ncreation of a compensation scheme for authors whose works contribute to AI\ndevelopment.", "paper_summary_zh": "在訓練生成式語言模型中使用受版權保護的材料會引發重大的法律和倫理問題。本文提出了一個架構，並根據經驗評估受版權保護的材料對挪威大型語言模型 (LLM) 效能的影響。我們發現，當這些模型在各種挪威基準上進行評估時，書籍和報紙都有正面的貢獻，而虛構作品可能會導致效能下降。我們的實驗可以為作者制定補償計畫，而他們的作品有助於 AI 發展。", "author": "Javier de la Rosa et.al.", "authors": "Javier de la Rosa, Vladislav Mikhailov, Lemei Zhang, Freddy Wetjen, David Samuel, Peng Liu, Rolv-Arild Braaten, Petter Mæhlum, Magnus Breder Birkenes, Andrey Kutuzov, Tita Enstad, Svein Arne Brygfjeld, Jon Atle Gulla, Stephan Oepen, Erik Velldal, Wilfred Østgulen, Liljia Øvrelid, Aslak Sira Myhre", "id": "2412.09460v1", "paper_url": "http://arxiv.org/abs/2412.09460v1", "repo": "null"}}