{"2501.13573": {"publish_time": "2025-01-23", "title": "Improving Contextual Faithfulness of Large Language Models via Retrieval Heads-Induced Optimization", "paper_summary": "Ensuring contextual faithfulness in retrieval-augmented large language models\n(LLMs) is crucial for building trustworthy information-seeking systems,\nparticularly in long-form question-answering (LFQA) scenarios. In this work, we\nidentify a salient correlation between LFQA faithfulness and retrieval heads, a\nset of attention heads responsible for retrieving contextual information.\nLeveraging this insight, we propose RHIO, a framework designed to teach LLMs to\nexplicitly discriminate between faithful and unfaithful generations. RHIO first\naugments unfaithful samples that simulate realistic model-intrinsic errors by\nselectively masking retrieval heads. Then, these samples are incorporated into\njoint training, enabling the model to distinguish unfaithful outputs from\nfaithful ones conditioned on control tokens. Furthermore, these control tokens\nare leveraged to self-induce contrastive outputs, amplifying their difference\nthrough contrastive decoding. Additionally, to facilitate the evaluation of\ncontextual faithfulness, we also introduce GroundBench, a comprehensive\nbenchmark compiled from five existing LFQA datasets. Extensive experimental\nresults on GroundBench demonstrate that RHIO significantly improves\nfaithfulness, even outperforming GPT-4o.", "paper_summary_zh": "確保在檢索增強型大型語言模型 (LLM) 中的上下文保真度，對於建立值得信賴的資訊搜尋系統至關重要，特別是在長篇問答 (LFQA) 場景中。在這項工作中，我們發現 LFQA 保真度與檢索頭之間存在顯著相關性，檢索頭是一組負責檢索上下文資訊的注意力頭。利用這項見解，我們提出了 RHIO，一個旨在教導 LLM 明確區分保真和不保真的生成。RHIO 首先通過選擇性遮蔽檢索頭來擴充模擬實際模型內在錯誤的不保真樣本。然後，將這些樣本納入聯合訓練中，使模型能夠根據控制代碼區分不保真的輸出和保真的輸出。此外，這些控制代碼被用於自我誘導對比輸出，通過對比解碼放大它們的差異。此外，為了促進對上下文保真度的評估，我們還引入了 GroundBench，一個由五個現有 LFQA 資料集編譯而成的綜合基準。在 GroundBench 上的廣泛實驗結果表明，RHIO 大幅提升了保真度，甚至優於 GPT-4o。", "author": "Lei Huang et.al.", "authors": "Lei Huang, Xiaocheng Feng, Weitao Ma, Yuchun Fan, Xiachong Feng, Yangfan Ye, Weihong Zhong, Yuxuan Gu, Baoxin Wang, Dayong Wu, Guoping Hu, Bing Qin", "id": "2501.13573v1", "paper_url": "http://arxiv.org/abs/2501.13573v1", "repo": "null"}}