{"2407.21674": {"publish_time": "2024-07-31", "title": "Synthetic Simplicity: Unveiling Bias in Medical Data Augmentation", "paper_summary": "Synthetic data is becoming increasingly integral in data-scarce fields such\nas medical imaging, serving as a substitute for real data. However, its\ninherent statistical characteristics can significantly impact downstream tasks,\npotentially compromising deployment performance. In this study, we empirically\ninvestigate this issue and uncover a critical phenomenon: downstream neural\nnetworks often exploit spurious distinctions between real and synthetic data\nwhen there is a strong correlation between the data source and the task label.\nThis exploitation manifests as \\textit{simplicity bias}, where models overly\nrely on superficial features rather than genuine task-related complexities.\nThrough principled experiments, we demonstrate that the source of data (real\nvs.\\ synthetic) can introduce spurious correlating factors leading to poor\nperformance during deployment when the correlation is absent. We first\ndemonstrate this vulnerability on a digit classification task, where the model\nspuriously utilizes the source of data instead of the digit to provide an\ninference. We provide further evidence of this phenomenon in a medical imaging\nproblem related to cardiac view classification in echocardiograms, particularly\ndistinguishing between 2-chamber and 4-chamber views. Given the increasing role\nof utilizing synthetic datasets, we hope that our experiments serve as\neffective guidelines for the utilization of synthetic datasets in model\ntraining.", "paper_summary_zh": "合成資料在資料稀少的領域中變得越來越不可或缺，例如醫學影像，用作真實資料的替代品。然而，其內在的統計特性會顯著影響下游任務，可能損害部署效能。在本研究中，我們實證調查此問題，並揭露一個關鍵現象：當資料來源與任務標籤之間有很強的相關性時，下游神經網路通常會利用真實資料與合成資料之間的虛假區別。這種利用表現為「簡化偏差」，其中模型過度依賴表面特徵，而不是真正的與任務相關的複雜性。透過有原則的實驗，我們證明資料來源（真實資料與合成資料）可能會引入虛假的相關因素，導致在相關性不存在時部署期間效能不佳。我們首先在數字分類任務中證明此漏洞，其中模型虛假地利用資料來源而非數字來提供推論。我們在與超音波心臟視野分類相關的醫學影像問題中進一步提供此現象的證據，特別是區分二腔和四腔視野。鑑於合成資料集的使用角色日益增加，我們希望我們的實驗能作為在模型訓練中利用合成資料集的有效指南。", "author": "Krishan Agyakari Raja Babu et.al.", "authors": "Krishan Agyakari Raja Babu, Rachana Sathish, Mrunal Pattanaik, Rahul Venkataramani", "id": "2407.21674v1", "paper_url": "http://arxiv.org/abs/2407.21674v1", "repo": "null"}}