{"2410.08067": {"publish_time": "2024-10-10", "title": "Reward-Augmented Data Enhances Direct Preference Alignment of LLMs", "paper_summary": "Preference alignment in Large Language Models (LLMs) has significantly\nimproved their ability to adhere to human instructions and intentions. However,\nexisting direct alignment algorithms primarily focus on relative preferences\nand often overlook the qualitative aspects of responses. Striving to maximize\nthe implicit reward gap between the chosen and the slightly inferior rejected\nresponses can cause overfitting and unnecessary unlearning of the high-quality\nrejected responses. The unawareness of the reward scores also drives the LLM to\nindiscriminately favor the low-quality chosen responses and fail to generalize\nto responses with the highest rewards, which are sparse in data. To overcome\nthese shortcomings, our study introduces reward-conditioned LLM policies that\ndiscern and learn from the entire spectrum of response quality within the\ndataset, helping extrapolate to more optimal regions. We propose an effective\nyet simple data relabeling method that conditions the preference pairs on\nquality scores to construct a reward-augmented dataset. This dataset is easily\nintegrated with existing direct alignment algorithms and is applicable to any\npreference dataset. The experimental results across instruction-following\nbenchmarks including AlpacaEval, MT-Bench, and Arena-Hard-Auto demonstrate that\nour approach consistently boosts the performance of DPO by a considerable\nmargin across diverse models. Additionally, our method improves the average\naccuracy on various academic benchmarks. When applying our method to on-policy\ndata, the resulting DPO model achieves SOTA results on AlpacaEval. Through\nablation studies, we demonstrate that our method not only maximizes the utility\nof preference data but also mitigates the issue of unlearning, demonstrating\nits broad effectiveness beyond mere dataset expansion. Our code is available at\nhttps://github.com/shenao-zhang/reward-augmented-preference.", "paper_summary_zh": "大型語言模型 (LLM) 中的偏好對齊顯著提升了它們遵守人類指令和意圖的能力。然而，現有的直接對齊演算法主要關注相對偏好，且常常忽略回應的質化面向。努力最大化所選回應和略遜一籌的被拒絕回應之間的隱含獎勵差距，可能導致過度擬合和不必要地遺忘高品質的被拒絕回應。對獎勵分數的無知也驅使 LLM 毫無區別地偏好低品質的所選回應，且無法概括到獎勵最高的回應，而這些回應在資料中是稀疏的。為了克服這些缺點，我們的研究引入了獎勵條件的 LLM 政策，它能辨別並從資料集內回應品質的整個範圍中學習，有助於外推到更佳的區域。我們提出一個有效且簡單的資料重新標籤方法，它以品質分數為條件的偏好對來建構一個獎勵增強的資料集。這個資料集很容易與現有的直接對齊演算法整合，且適用於任何偏好資料集。在包括 AlpacaEval、MT-Bench 和 Arena-Hard-Auto 在內的指令遵循基準中的實驗結果顯示，我們的做法一致地以相當大的幅度提升了不同模型的 DPO 效能。此外，我們的做法也提升了各種學術基準的平均準確度。當將我們的做法應用於策略資料時，產生的 DPO 模型在 AlpacaEval 上達到了 SOTA 結果。透過消融研究，我們證明了我們的做法不僅最大化了偏好資料的效用，也減輕了遺忘的問題，證明了它超越單純的資料集擴充的廣泛效力。我們的程式碼可以在 https://github.com/shenao-zhang/reward-augmented-preference 取得。", "author": "Shenao Zhang et.al.", "authors": "Shenao Zhang, Zhihan Liu, Boyi Liu, Yufeng Zhang, Yingxiang Yang, Yongfei Liu, Liyu Chen, Tao Sun, Zhaoran Wang", "id": "2410.08067v1", "paper_url": "http://arxiv.org/abs/2410.08067v1", "repo": "https://github.com/shenao-zhang/reward-augmented-preference"}}