{"2408.07060": {"publish_time": "2024-08-13", "title": "Diversity Empowers Intelligence: Integrating Expertise of Software Engineering Agents", "paper_summary": "Large language model (LLM) agents have shown great potential in solving\nreal-world software engineering (SWE) problems. The most advanced open-source\nSWE agent can resolve over 27% of real GitHub issues in SWE-Bench Lite.\nHowever, these sophisticated agent frameworks exhibit varying strengths,\nexcelling in certain tasks while underperforming in others. To fully harness\nthe diversity of these agents, we propose DEI (Diversity Empowered\nIntelligence), a framework that leverages their unique expertise. DEI functions\nas a meta-module atop existing SWE agent frameworks, managing agent collectives\nfor enhanced problem-solving. Experimental results show that a DEI-guided\ncommittee of agents is able to surpass the best individual agent's performance\nby a large margin. For instance, a group of open-source SWE agents, with a\nmaximum individual resolve rate of 27.3% on SWE-Bench Lite, can achieve a 34.3%\nresolve rate with DEI, making a 25% improvement and beating most closed-source\nsolutions. Our best-performing group excels with a 55% resolve rate, securing\nthe highest ranking on SWE-Bench Lite. Our findings contribute to the growing\nbody of research on collaborative AI systems and their potential to solve\ncomplex software engineering challenges.", "paper_summary_zh": "大型語言模型 (LLM) 代理在解決現實世界的軟體工程 (SWE) 問題方面展現了極大的潛力。最先進的開源 SWE 代理可以在 SWE-Bench Lite 中解決超過 27% 的實際 GitHub 問題。然而，這些複雜的代理架構表現出不同的優勢，在某些任務中表現出色，而在其他任務中表現不佳。為了充分利用這些代理的多樣性，我們提出了 DEI（Diversity Empowered Intelligence），一個利用其獨特專業知識的框架。DEI 作為一個元模組，位於現有的 SWE 代理架構之上，管理代理集合以增強問題解決能力。實驗結果表明，DEI 指導的代理委員會能夠大幅超越最佳個別代理的表現。例如，一群開源 SWE 代理，在 SWE-Bench Lite 上的最高個別解決率為 27.3%，使用 DEI 可以達到 34.3% 的解決率，改進了 25%，並且勝過大多數閉源解決方案。我們表現最好的組別以 55% 的解決率脫穎而出，在 SWE-Bench Lite 上獲得最高排名。我們的研究結果有助於擴大協作式 AI 系統的研究領域，以及它們解決複雜軟體工程挑戰的潛力。", "author": "Kexun Zhang et.al.", "authors": "Kexun Zhang, Weiran Yao, Zuxin Liu, Yihao Feng, Zhiwei Liu, Rithesh Murthy, Tian Lan, Lei Li, Renze Lou, Jiacheng Xu, Bo Pang, Yingbo Zhou, Shelby Heinecke, Silvio Savarese, Huan Wang, Caiming Xiong", "id": "2408.07060v1", "paper_url": "http://arxiv.org/abs/2408.07060v1", "repo": "null"}}