{"2502.04392": {"publish_time": "2025-02-06", "title": "Division-of-Thoughts: Harnessing Hybrid Language Model Synergy for Efficient On-Device Agents", "paper_summary": "The rapid expansion of web content has made on-device AI assistants\nindispensable for helping users manage the increasing complexity of online\ntasks. The emergent reasoning ability in large language models offer a\npromising path for next-generation on-device AI agents. However, deploying\nfull-scale Large Language Models (LLMs) on resource-limited local devices is\nchallenging. In this paper, we propose Division-of-Thoughts (DoT), a\ncollaborative reasoning framework leveraging the synergy between locally\ndeployed Smaller-scale Language Models (SLMs) and cloud-based LLMs. DoT\nleverages a Task Decomposer to elicit the inherent planning abilities in\nlanguage models to decompose user queries into smaller sub-tasks, which allows\nhybrid language models to fully exploit their respective strengths. Besides,\nDoT employs a Task Scheduler to analyze the pair-wise dependency of sub-tasks\nand create a dependency graph, facilitating parallel reasoning of sub-tasks and\nthe identification of key steps. To allocate the appropriate model based on the\ndifficulty of sub-tasks, DoT leverages a Plug-and-Play Adapter, which is an\nadditional task head attached to the SLM that does not alter the SLM's\nparameters. To boost adapter's task allocation capability, we propose a\nself-reinforced training method that relies solely on task execution feedback.\nExtensive experiments on various benchmarks demonstrate that our DoT\nsignificantly reduces LLM costs while maintaining competitive reasoning\naccuracy. Specifically, DoT reduces the average reasoning time and API costs by\n66.12% and 83.57%, while achieving comparable reasoning accuracy with the best\nbaseline methods.", "paper_summary_zh": "<paragraph>網頁內容快速擴充，使得行動裝置上的 AI 助理在協助使用者管理日益複雜的線上工作上變得不可或缺。大型語言模型中浮現的推理能力為新一代行動裝置上的 AI 代理提供了一條有希望的途徑。然而，在資源有限的本機裝置上部署全規模的大型語言模型 (LLM) 是一項挑戰。在本文中，我們提出了思想分工 (DoT)，一個協作推理框架，利用了本地部署的小型語言模型 (SLM) 與雲端 LLM 之間的協同效應。DoT 利用任務分解器引出語言模型中固有的規劃能力，將使用者查詢分解成較小的子任務，這允許混合語言模型充分發揮其各自的優勢。此外，DoT 雇用了一個任務排程器來分析子任務的成對依賴性並建立一個依賴性圖，促進子任務的並行推理和關鍵步驟的識別。為了根據子任務的難度分配適當的模型，DoT 利用了即插即用適配器，這是一個附加在 SLM 上的任務頭，不會改變 SLM 的參數。為了提升適配器的任務分配能力，我們提出了一種自我強化訓練方法，它僅依賴於任務執行回饋。在各種基準上的廣泛實驗表明，我們的 DoT 大幅降低了 LLM 成本，同時維持了有競爭力的推理準確度。具體來說，DoT 將平均推理時間和 API 成本分別降低了 66.12% 和 83.57%，同時達到了與最佳基準方法相當的推理準確度。</paragraph>", "author": "Chenyang Shao et.al.", "authors": "Chenyang Shao, Xinyuan Hu, Yutang Lin, Fengli Xu", "id": "2502.04392v1", "paper_url": "http://arxiv.org/abs/2502.04392v1", "repo": "null"}}