{"2412.12797": {"publish_time": "2024-12-17", "title": "Is it the end of (generative) linguistics as we know it?", "paper_summary": "A significant debate has emerged in response to a paper written by Steven\nPiantadosi (Piantadosi, 2023) and uploaded to the LingBuzz platform, the open\narchive for generative linguistics. Piantadosi's dismissal of Chomsky's\napproach is ruthless, but generative linguists deserve it. In this paper, I\nwill adopt three idealized perspectives -- computational, theoretical, and\nexperimental -- to focus on two fundamental issues that lend partial support to\nPiantadosi's critique: (a) the evidence challenging the Poverty of Stimulus\n(PoS) hypothesis and (b) the notion of simplicity as conceived within\nmainstream Minimalism. In conclusion, I argue that, to reclaim a central role\nin language studies, generative linguistics -- representing a prototypical\ntheoretical perspective on language -- needs a serious update leading to (i)\nmore precise, consistent, and complete formalizations of foundational\nintuitions and (ii) the establishment and utilization of a standardized dataset\nof crucial empirical evidence to evaluate the theory's adequacy. On the other\nhand, ignoring the formal perspective leads to major drawbacks in both\ncomputational and experimental approaches. Neither descriptive nor explanatory\nadequacy can be easily achieved without the precise formulation of general\nprinciples that can be challenged empirically.", "paper_summary_zh": "<paragraph>史蒂文·皮安塔多西（Steven Piantadosi，2023 年）撰寫的一篇論文引起了激烈的爭論，並上傳到開放式生成語言學檔案庫 LingBuzz 平台。皮安塔多西對喬姆斯基方法的駁斥毫不留情，但生成語言學家應得此待遇。在本文中，我將採用三種理想化的觀點——計算、理論和實驗——來關注兩個基本問題，這兩個問題部分支持皮安塔多西的批評：(a) 挑戰刺激貧乏 (PoS) 假說的證據，以及 (b) 在主流極簡主義中構思的簡潔性概念。最後，我認為，為了在語言研究中重新獲得核心地位，生成語言學——代表語言的原型理論觀點——需要進行一項嚴肅的更新，導致 (i) 對基本直覺做出更精確、一致且完整的形式化，以及 (ii) 建立和利用標準化的關鍵實證證據數據集來評估理論的充分性。另一方面，忽視形式觀點會導致計算和實驗方法出現重大缺點。如果沒有精確制定可以通過實證挑戰的一般原則，那麼描述性或解釋性充分性都難以輕易實現。</paragraph>", "author": "Cristiano Chesi et.al.", "authors": "Cristiano Chesi", "id": "2412.12797v1", "paper_url": "http://arxiv.org/abs/2412.12797v1", "repo": "null"}}