{"2407.09015": {"publish_time": "2024-07-12", "title": "Static Analysis of Logic Programs via Boolean Networks", "paper_summary": "Answer Set Programming (ASP) is a declarative problem solving paradigm that\ncan be used to encode a combinatorial problem as a logic program whose stable\nmodels correspond to the solutions of the considered problem. ASP has been\nwidely applied to various domains in AI and beyond. The question \"What can be\nsaid about stable models of a logic program from its static information?\" has\nbeen investigated and proved useful in many circumstances. In this work, we\ndive into this direction more deeply by making the connection between a logic\nprogram and a Boolean network, which is a prominent modeling framework with\napplications to various areas. The proposed connection can bring the existing\nresults in the rich history on static analysis of Boolean networks to explore\nand prove more theoretical results on ASP, making it become a unified and\npowerful tool to further study the static analysis of ASP. In particular, the\nnewly obtained insights have the potential to benefit many problems in the\nfield of ASP.", "paper_summary_zh": "回答設定程式（ASP）是一種宣告式問題解決範例，可將組合問題編碼為邏輯程式，其穩定模型對應於所考慮問題的解。ASP 已廣泛應用於 AI 及其他領域。問題「從邏輯程式的靜態資訊中，可得知關於穩定模型的哪些資訊？」已受到探討，並證明在許多情況下很有用。在這項工作中，我們透過建立邏輯程式與布林網路（一種重要的建模架構，可應用於各種領域）之間的關聯，更深入地探討這個方向。提出的關聯可以將布林網路靜態分析中豐富的歷史結果應用於 ASP，探索並證明更多理論結果，使其成為進一步研究 ASP 靜態分析的統一且強大的工具。特別是，新獲得的見解有可能使 ASP 領域中的許多問題受益。", "author": "Van-Giang Trinh et.al.", "authors": "Van-Giang Trinh, Belaid Benhamou", "id": "2407.09015v1", "paper_url": "http://arxiv.org/abs/2407.09015v1", "repo": "null"}}