{"2502.12088": {"publish_time": "2025-02-17", "title": "Meta-Statistical Learning: Supervised Learning of Statistical Inference", "paper_summary": "This work demonstrates that the tools and principles driving the success of\nlarge language models (LLMs) can be repurposed to tackle distribution-level\ntasks, where the goal is to predict properties of the data-generating\ndistribution rather than labels for individual datapoints. These tasks\nencompass statistical inference problems such as parameter estimation,\nhypothesis testing, or mutual information estimation. Framing these tasks\nwithin traditional machine learning pipelines is challenging, as supervision is\ntypically tied to individual datapoint. We propose meta-statistical learning, a\nframework inspired by multi-instance learning that reformulates statistical\ninference tasks as supervised learning problems. In this approach, entire\ndatasets are treated as single inputs to neural networks, which predict\ndistribution-level parameters. Transformer-based architectures, without\npositional encoding, provide a natural fit due to their permutation-invariance\nproperties. By training on large-scale synthetic datasets, meta-statistical\nmodels can leverage the scalability and optimization infrastructure of\nTransformer-based LLMs. We demonstrate the framework's versatility with\napplications in hypothesis testing and mutual information estimation, showing\nstrong performance, particularly for small datasets where traditional neural\nmethods struggle.", "paper_summary_zh": "这项工作表明，推动大型语言模型 (LLM) 成功发展的工具和原则可以重新用于解决分布级别任务，其中目标是预测数据生成分布的属性，而不是单个数据点的标签。这些任务包括统计推断问题，例如参数估计、假设检验或互信息估计。在传统的机器学习管道中构建这些任务具有挑战性，因为监督通常与单个数据点相关联。我们提出了元统计学习，这是一个受多实例学习启发的框架，它将统计推断任务重新表述为监督学习问题。在此方法中，整个数据集被视为神经网络的单个输入，该神经网络预测分布级别参数。基于 Transformer 的架构在没有位置编码的情况下提供了自然拟合，因为它们具有置换不变性。通过在大型合成数据集上进行训练，元统计模型可以利用基于 Transformer 的 LLM 的可扩展性和优化基础设施。我们通过在假设检验和互信息估计中的应用展示了该框架的多功能性，显示出强大的性能，特别是对于传统神经方法难以处理的小型数据集。", "author": "Maxime Peyrard et.al.", "authors": "Maxime Peyrard, Kyunghyun Cho", "id": "2502.12088v1", "paper_url": "http://arxiv.org/abs/2502.12088v1", "repo": "null"}}