{"2405.17902": {"publish_time": "2024-05-28", "title": "Boosting Protein Language Models with Negative Sample Mining", "paper_summary": "We introduce a pioneering methodology for boosting large language models in\nthe domain of protein representation learning. Our primary contribution lies in\nthe refinement process for correlating the over-reliance on co-evolution\nknowledge, in a way that networks are trained to distill invaluable insights\nfrom negative samples, constituted by protein pairs sourced from disparate\ncategories. By capitalizing on this novel approach, our technique steers the\ntraining of transformer-based models within the attention score space. This\nadvanced strategy not only amplifies performance but also reflects the nuanced\nbiological behaviors exhibited by proteins, offering aligned evidence with\ntraditional biological mechanisms such as protein-protein interaction. We\nexperimentally observed improved performance on various tasks over datasets, on\ntop of several well-established large protein models. This innovative paradigm\nopens up promising horizons for further progress in the realms of protein\nresearch and computational biology.", "paper_summary_zh": "我們提出了一種開創性的方法，用於提升大型語言模型在蛋白質表徵學習領域中的能力。我們的主要貢獻在於，針對過度依賴共演化知識的精煉過程，讓網路訓練從負面樣本中萃取出寶貴的見解，這些負面樣本是由來自不同類別的蛋白質對所構成。透過利用這種新穎的方法，我們的技術引導基於 Transformer 的模型在注意力分數空間中進行訓練。這種先進的策略不僅提升了效能，也反映了蛋白質所表現出的細微生物行為，並提供了與傳統生物機制（例如蛋白質-蛋白質交互作用）一致的證據。我們在各種任務中對多個已建立的大型蛋白質模型進行實驗，觀察到在資料集上的效能提升。這種創新的範例為蛋白質研究和計算生物學領域的進一步進展開啟了充滿希望的新視野。", "author": "Yaoyao Xu et.al.", "authors": "Yaoyao Xu, Xinjian Zhao, Xiaozhuang Song, Benyou Wang, Tianshu Yu", "id": "2405.17902v1", "paper_url": "http://arxiv.org/abs/2405.17902v1", "repo": "https://github.com/logo-cuhksz/nm-transformer"}}