{"2405.10467": {"publish_time": "2024-05-16", "title": "Agent Design Pattern Catalogue: A Collection of Architectural Patterns for Foundation Model based Agents", "paper_summary": "Foundation model-enabled generative artificial intelligence facilitates the\ndevelopment and implementation of agents, which can leverage distinguished\nreasoning and language processing capabilities to takes a proactive, autonomous\nrole to pursue users' goals. Nevertheless, there is a lack of systematic\nknowledge to guide practitioners in designing the agents considering challenges\nof goal-seeking (including generating instrumental goals and plans), such as\nhallucinations inherent in foundation models, explainability of reasoning\nprocess, complex accountability, etc. To address this issue, we have performed\na systematic literature review to understand the state-of-the-art foundation\nmodel-based agents and the broader ecosystem. In this paper, we present a\npattern catalogue consisting of 16 architectural patterns with analyses of the\ncontext, forces, and trade-offs as the outcomes from the previous literature\nreview. The proposed catalogue can provide holistic guidance for the effective\nuse of patterns, and support the architecture design of foundation model-based\nagents by facilitating goal-seeking and plan generation.", "paper_summary_zh": "由基础模型支持的生成式人工智能促进了代理的开发和实施，代理可以利用杰出的推理和语言处理能力来采取主动、自主的角色来追求用户的目标。然而，缺乏系统化的知识来指导从业者在考虑目标寻求（包括生成工具性目标和计划）的挑战的情况下设计代理，例如基础模型中固有的幻觉、推理过程的可解释性、复杂的责任制等。为了解决这个问题，我们执行了一项系统的文献综述，以了解基于基础模型的最新代理和更广泛的生态系统。在本文中，我们提出了一个模式目录，其中包含 16 个架构模式，其中包含对上下文、力量和权衡的分析，作为先前文献综述的结果。提议的目录可以为模式的有效使用提供全面的指导，并通过促进目标寻求和计划生成来支持基于基础模型的代理的架构设计。", "author": "Yue Liu et.al.", "authors": "Yue Liu, Sin Kit Lo, Qinghua Lu, Liming Zhu, Dehai Zhao, Xiwei Xu, Stefan Harrer, Jon Whittle", "id": "2405.10467v1", "paper_url": "http://arxiv.org/abs/2405.10467v1", "repo": "null"}}