{"2408.05842": {"publish_time": "2024-08-11", "title": "Scaling Virtual World with Delta-Engine", "paper_summary": "In this paper, we focus on \\emph{virtual world}, a cyberspace where people\ncan live in. An ideal virtual world shares great similarity with our real\nworld. One of the crucial aspects is its evolving nature, reflected by the\nindividuals' capacity to grow and thereby influence the objective world. Such\ndynamics is unpredictable and beyond the reach of existing systems. For this,\nwe propose a special engine called \\emph{Delta-Engine} to drive this virtual\nworld. $\\Delta$ associates the world's evolution to the engine's expansion. A\ndelta-engine consists of a base engine and a neural proxy. Given an\nobservation, the proxy generates new code based on the base engine through the\nprocess of \\emph{incremental prediction}.\n  This paper presents a full-stack introduction to the delta-engine. The key\nfeature of the delta-engine is its scalability to unknown elements within the\nworld, Technically, it derives from the prefect co-work of the neural proxy and\nthe base engine, and the alignment with high-quality data. We an\nengine-oriented fine-tuning method that embeds the base engine into the proxy.\nWe then discuss a human-AI collaborative design process to produce novel and\ninteresting data efficiently. Eventually, we propose three evaluation\nprinciples to comprehensively assess the performance of a delta engine: naive\nevaluation, incremental evaluation, and adversarial evaluation. Our code, data,\nand models are open-sourced at \\url{https://github.com/gingasan/delta-engine}.", "paper_summary_zh": "<paragraph>在本文中，我們專注於「虛擬世界」，一個人們可以居住的網路空間。一個理想的虛擬世界與我們的現實世界有很大的相似性。其中一個關鍵面向是其演化性質，反映在個人成長並因此影響客觀世界的能力。這種動態是不可預測的，而且超出了現有系統的範圍。為此，我們提出一個稱為「Delta-Engine」的特殊引擎來驅動這個虛擬世界。$\\Delta$ 將世界的演化與引擎的擴展聯繫起來。Delta-引擎包含一個基礎引擎和一個神經代理。給定一個觀察結果，代理會透過「增量預測」的過程，根據基礎引擎產生新的程式碼。\n本文介紹了 delta-engine 的全堆疊介紹。Delta-engine 的關鍵特徵是它對世界中未知元素的可擴充性，技術上來說，它源自神經代理和基礎引擎的完美協作，以及與高品質資料的一致性。我們可以將基礎引擎嵌入到代理中的引擎導向微調方法。然後，我們討論一個人類與 AI 協作的設計過程，以有效產生新穎且有趣的資料。最後，我們提出了三個評估原則，以全面評估 delta 引擎的效能：樸素評估、增量評估和對抗性評估。我們的程式碼、資料和模型在 \\url{https://github.com/gingasan/delta-engine} 開源。</paragraph>", "author": "Hongqiu Wu et.al.", "authors": "Hongqiu Wu, Zekai Xu, Tianyang Xu, Jiale Hong, Weiqi Wu, Hai Zhao, Min Zhang, Zhezhi He", "id": "2408.05842v1", "paper_url": "http://arxiv.org/abs/2408.05842v1", "repo": "https://github.com/gingasan/delta-engine"}}