{"2412.09601": {"publish_time": "2024-12-12", "title": "TimeRefine: Temporal Grounding with Time Refining Video LLM", "paper_summary": "Video temporal grounding aims to localize relevant temporal boundaries in a\nvideo given a textual prompt. Recent work has focused on enabling Video LLMs to\nperform video temporal grounding via next-token prediction of temporal\ntimestamps. However, accurately localizing timestamps in videos remains\nchallenging for Video LLMs when relying solely on temporal token prediction.\nOur proposed TimeRefine addresses this challenge in two ways. First, instead of\ndirectly predicting the start and end timestamps, we reformulate the temporal\ngrounding task as a temporal refining task: the model first makes rough\npredictions and then refines them by predicting offsets to the target segment.\nThis refining process is repeated multiple times, through which the model\nprogressively self-improves its temporal localization accuracy. Second, to\nenhance the model's temporal perception capabilities, we incorporate an\nauxiliary prediction head that penalizes the model more if a predicted segment\ndeviates further from the ground truth, thus encouraging the model to make\ncloser and more accurate predictions. Our plug-and-play method can be\nintegrated into most LLM-based temporal grounding approaches. The experimental\nresults demonstrate that TimeRefine achieves 3.6% and 5.0% mIoU improvements on\nthe ActivityNet and Charades-STA datasets, respectively. Code and pretrained\nmodels will be released.", "paper_summary_zh": "影片時序定位旨在根據文字提示在影片中找出相關的時間邊界。近期研究專注於讓影片大型語言模型 (LLM) 透過下一個時序標記預測來執行影片時序定位。然而，在僅依賴時序標記預測時，影片大型語言模型要精準定位影片中的時序標記仍是一大挑戰。我們提出的 TimeRefine 以兩種方式解決這個挑戰。首先，我們並未直接預測開始和結束時序標記，而是將時序定位任務重新定義為時序精煉任務：模型先做出粗略預測，然後透過預測目標片段的偏移量來精煉這些預測。這個精煉程序會重複多次，模型透過此程序逐步自行改善其時序定位準確度。其次，為了增強模型的時序感知能力，我們整合了一個輔助預測頭，如果預測片段與實際情況相差越大，這個輔助預測頭就會對模型施加更多懲罰，因此鼓勵模型做出更接近且更精準的預測。我們的即插即用方法可以整合到大多數基於大型語言模型的時序定位方法中。實驗結果顯示，TimeRefine 在 ActivityNet 和 Charades-STA 資料集上分別達到了 3.6% 和 5.0% 的 mIoU 提升。程式碼和預先訓練的模型將會釋出。", "author": "Xizi Wang et.al.", "authors": "Xizi Wang, Feng Cheng, Ziyang Wang, Huiyu Wang, Md Mohaiminul Islam, Lorenzo Torresani, Mohit Bansal, Gedas Bertasius, David Crandall", "id": "2412.09601v1", "paper_url": "http://arxiv.org/abs/2412.09601v1", "repo": "null"}}