{"2405.11848": {"publish_time": "2024-05-20", "title": "Alternators For Sequence Modeling", "paper_summary": "This paper introduces alternators, a novel family of non-Markovian dynamical\nmodels for sequences. An alternator features two neural networks: the\nobservation trajectory network (OTN) and the feature trajectory network (FTN).\nThe OTN and the FTN work in conjunction, alternating between outputting samples\nin the observation space and some feature space, respectively, over a cycle.\nThe parameters of the OTN and the FTN are not time-dependent and are learned\nvia a minimum cross-entropy criterion over the trajectories. Alternators are\nversatile. They can be used as dynamical latent-variable generative models or\nas sequence-to-sequence predictors. When alternators are used as generative\nmodels, the FTN produces interpretable low-dimensional latent variables that\ncapture the dynamics governing the observations. When alternators are used as\nsequence-to-sequence predictors, the FTN learns to predict the observed\nfeatures. In both cases, the OTN learns to produce sequences that match the\ndata. Alternators can uncover the latent dynamics underlying complex sequential\ndata, accurately forecast and impute missing data, and sample new trajectories.\nWe showcase the capabilities of alternators in three applications. We first\nused alternators to model the Lorenz equations, often used to describe chaotic\nbehavior. We then applied alternators to Neuroscience, to map brain activity to\nphysical activity. Finally, we applied alternators to Climate Science, focusing\non sea-surface temperature forecasting. In all our experiments, we found\nalternators are stable to train, fast to sample from, yield high-quality\ngenerated samples and latent variables, and outperform strong baselines such as\nneural ODEs and diffusion models in the domains we studied.", "paper_summary_zh": "<paragraph>本文介紹交替器，一種非馬可夫動態序列模型的新穎系列。交替器具有兩個神經網路：觀測軌跡網路 (OTN) 和特徵軌跡網路 (FTN)。OTN 和 FTN 協同工作，在一個週期內，輪流輸出觀測空間和一些特徵空間中的樣本。OTN 和 FTN 的參數與時間無關，並透過軌跡上的最小交叉熵準則學習。交替器具有多功能性。它們可以用作動態潛在變量生成模型或序列對序列預測器。當交替器用作生成模型時，FTN 會產生可解釋的低維潛在變量，以捕捉控制觀測的動態。當交替器用作序列對序列預測器時，FTN 會學習預測觀測到的特徵。在兩種情況下，OTN 都會學習產生與資料相符的序列。交替器可以揭示複雜序列資料背後的潛在動態，準確預測和填補遺失的資料，以及取樣新的軌跡。我們在三個應用程式中展示了交替器的功能。我們首先使用交替器對洛倫茲方程式建模，該方程式通常用於描述混沌行為。然後我們將交替器應用於神經科學，將大腦活動對應到身體活動。最後，我們將交替器應用於氣候科學，重點關注海面溫度預測。在我們所有的實驗中，我們發現交替器在訓練時很穩定，取樣速度很快，產生的樣本和潛在變量品質很高，並且在我們研究的領域中優於強大的基準，例如神經 ODE 和擴散模型。</paragraph>", "author": "Mohammad Reza Rezaei et.al.", "authors": "Mohammad Reza Rezaei, Adji Bousso Dieng", "id": "2405.11848v1", "paper_url": "http://arxiv.org/abs/2405.11848v1", "repo": "null"}}