{"2407.13578": {"publish_time": "2024-07-18", "title": "Large Language Models as Reliable Knowledge Bases?", "paper_summary": "The NLP community has recently shown a growing interest in leveraging Large\nLanguage Models (LLMs) for knowledge-intensive tasks, viewing LLMs as potential\nknowledge bases (KBs). However, the reliability and extent to which LLMs can\nfunction as KBs remain underexplored. While previous studies suggest LLMs can\nencode knowledge within their parameters, the amount of parametric knowledge\nalone is not sufficient to evaluate their effectiveness as KBs. This study\ndefines criteria that a reliable LLM-as-KB should meet, focusing on factuality\nand consistency, and covering both seen and unseen knowledge. We develop\nseveral metrics based on these criteria and use them to evaluate 26 popular\nLLMs, while providing a comprehensive analysis of the effects of model size,\ninstruction tuning, and in-context learning (ICL). Our results paint a worrying\npicture. Even a high-performant model like GPT-3.5-turbo is not factual or\nconsistent, and strategies like ICL and fine-tuning are unsuccessful at making\nLLMs better KBs.", "paper_summary_zh": "NLP 社群最近顯示出對利用大型語言模型 (LLM) 來執行知識密集型任務的興趣日益增長，將 LLM 視為潛在的知識庫 (KB)。然而，LLM 作為 KB 的可靠性和程度仍未被充分探討。雖然先前的研究表明 LLM 可以對其參數內的知識進行編碼，但僅參數知識的數量並不足以評估其作為 KB 的有效性。本研究定義了一個可靠的 LLM 作為 KB 應該符合的標準，重點關注事實性和一致性，並涵蓋已見和未見的知識。我們根據這些標準制定了幾個指標，並使用它們來評估 26 個流行的 LLM，同時對模型大小、指令調整和情境學習 (ICL) 的影響進行全面分析。我們的結果描繪了一幅令人擔憂的畫面。即使是像 GPT-3.5-turbo 這樣的高性能模型，事實上也不一致，而 ICL 和微調等策略也無法讓 LLM 成為更好的 KB。", "author": "Danna Zheng et.al.", "authors": "Danna Zheng, Mirella Lapata, Jeff Z. Pan", "id": "2407.13578v1", "paper_url": "http://arxiv.org/abs/2407.13578v1", "repo": "null"}}