{"2411.14374": {"publish_time": "2024-11-21", "title": "Using Formal Models, Safety Shields and Certified Control to Validate AI-Based Train Systems", "paper_summary": "The certification of autonomous systems is an important concern in science\nand industry. The KI-LOK project explores new methods for certifying and safely\nintegrating AI components into autonomous trains. We pursued a two-layered\napproach: (1) ensuring the safety of the steering system by formal analysis\nusing the B method, and (2) improving the reliability of the perception system\nwith a runtime certificate checker. This work links both strategies within a\ndemonstrator that runs simulations on the formal model, controlled by the real\nAI output and the real certificate checker. The demonstrator is integrated into\nthe validation tool ProB. This enables runtime monitoring, runtime\nverification, and statistical validation of formal safety properties using a\nformal B model. Consequently, one can detect and analyse potential\nvulnerabilities and weaknesses of the AI and the certificate checker. We apply\nthese techniques to a signal detection case study and present our findings.", "paper_summary_zh": "自主系統的認證是科學和產業中的重要課題。KI-LOK 計畫探索用於認證和安全地將 AI 元件整合到自動駕駛火車中的新方法。我們採用了雙層方法：(1) 使用 B 方法透過形式化分析確保轉向系統的安全，以及 (2) 使用執行時期證書檢查器來提升感知系統的可靠性。此項工作在一個示範程式中連結了這兩種策略，在形式化模型上執行模擬，由實際的 AI 輸出和實際的證書檢查器控制。此示範程式整合到驗證工具 ProB 中。這能使用形式化 B 模型進行執行時期監控、執行時期驗證和形式化安全屬性的統計驗證。因此，可以偵測和分析 AI 和證書檢查器的潛在漏洞和弱點。我們將這些技術應用於訊號偵測案例研究，並提出我們的發現。", "author": "Jan Gruteser et.al.", "authors": "Jan Gruteser, Jan Roßbach, Fabian Vu, Michael Leuschel", "id": "2411.14374v1", "paper_url": "http://arxiv.org/abs/2411.14374v1", "repo": "null"}}