{"2410.06818": {"publish_time": "2024-10-09", "title": "An Improved Approach for Cardiac MRI Segmentation based on 3D UNet Combined with Papillary Muscle Exclusion", "paper_summary": "Left ventricular ejection fraction (LVEF) is the most important clinical\nparameter of cardiovascular function. The accuracy in estimating this parameter\nis highly dependent upon the precise segmentation of the left ventricle (LV)\nstructure at the end diastole and systole phases. Therefore, it is crucial to\ndevelop robust algorithms for the precise segmentation of the heart structure\nduring different phases. Methodology: In this work, an improved 3D UNet model\nis introduced to segment the myocardium and LV, while excluding papillary\nmuscles, as per the recommendation of the Society for Cardiovascular Magnetic\nResonance. For the practical testing of the proposed framework, a total of\n8,400 cardiac MRI images were collected and analysed from the military hospital\nin Tunis (HMPIT), as well as the popular ACDC public dataset. As performance\nmetrics, we used the Dice coefficient and the F1 score for validation/testing\nof the LV and the myocardium segmentation. Results: The data was split into\n70%, 10%, and 20% for training, validation, and testing, respectively. It is\nworth noting that the proposed segmentation model was tested across three axis\nviews: basal, medio basal and apical at two different cardiac phases: end\ndiastole and end systole instances. The experimental results showed a Dice\nindex of 0.965 and 0.945, and an F1 score of 0.801 and 0.799, at the end\ndiastolic and systolic phases, respectively. Additionally, clinical evaluation\noutcomes revealed a significant difference in the LVEF and other clinical\nparameters when the papillary muscles were included or excluded.", "paper_summary_zh": "左心室射血分數 (LVEF) 是心血管功能最重要的臨床參數。估計此參數的準確性高度依賴於左心室 (LV) 結構在舒張末期和收縮期的精確分割。因此，開發用於精確分割不同時期心臟結構的強健演算法至關重要。方法：在此工作中，引進了一個改良的 3D UNet 模型來分割心肌和左心室，同時根據心血管磁共振學會的建議排除乳頭肌。為了對提出的架構進行實際測試，從突尼斯的軍事醫院 (HMPIT) 和流行的 ACDC 公共資料集收集並分析了總共 8,400 張心臟 MRI 影像。作為效能指標，我們使用 Dice 係數和 F1 分數來驗證/測試左心室和心肌分割。結果：資料被分成 70%、10% 和 20% 分別用於訓練、驗證和測試。值得注意的是，所提出的分割模型在三個軸向視圖中進行了測試：基底、中基底和心尖，在兩個不同的心臟時期：舒張末期和收縮末期。實驗結果顯示，在舒張末期和收縮期，Dice 指數分別為 0.965 和 0.945，F1 分數分別為 0.801 和 0.799。此外，臨床評估結果顯示，當乳頭肌被納入或排除時，LVEF 和其他臨床參數存在顯著差異。", "author": "Narjes Benameur et.al.", "authors": "Narjes Benameur, Ramzi Mahmoudi, Mohamed Deriche, Amira fayouka, Imene Masmoudi, Nessrine Zoghlami", "id": "2410.06818v1", "paper_url": "http://arxiv.org/abs/2410.06818v1", "repo": "null"}}