{"2410.22832": {"publish_time": "2024-10-30", "title": "HijackRAG: Hijacking Attacks against Retrieval-Augmented Large Language Models", "paper_summary": "Retrieval-Augmented Generation (RAG) systems enhance large language models\n(LLMs) by integrating external knowledge, making them adaptable and\ncost-effective for various applications. However, the growing reliance on these\nsystems also introduces potential security risks. In this work, we reveal a\nnovel vulnerability, the retrieval prompt hijack attack (HijackRAG), which\nenables attackers to manipulate the retrieval mechanisms of RAG systems by\ninjecting malicious texts into the knowledge database. When the RAG system\nencounters target questions, it generates the attacker's pre-determined answers\ninstead of the correct ones, undermining the integrity and trustworthiness of\nthe system. We formalize HijackRAG as an optimization problem and propose both\nblack-box and white-box attack strategies tailored to different levels of the\nattacker's knowledge. Extensive experiments on multiple benchmark datasets show\nthat HijackRAG consistently achieves high attack success rates, outperforming\nexisting baseline attacks. Furthermore, we demonstrate that the attack is\ntransferable across different retriever models, underscoring the widespread\nrisk it poses to RAG systems. Lastly, our exploration of various defense\nmechanisms reveals that they are insufficient to counter HijackRAG, emphasizing\nthe urgent need for more robust security measures to protect RAG systems in\nreal-world deployments.", "paper_summary_zh": "檢索增強生成 (RAG) 系統透過整合外部知識，增強大型語言模型 (LLM)，讓其適應各種應用，且具有成本效益。然而，越來越依賴這些系統也引入了潛在的安全風險。在這項工作中，我們揭露了一個新的漏洞，稱為檢索提示劫持攻擊 (HijackRAG)，讓攻擊者能夠透過將惡意文字注入知識庫中，來操縱 RAG 系統的檢索機制。當 RAG 系統遇到目標問題時，它會產生攻擊者預先設定好的答案，而不是正確的答案，破壞了系統的完整性和可信度。我們將 HijackRAG 正式化為一個最佳化問題，並針對攻擊者知識的不同層級，提出黑盒和白盒攻擊策略。在多個基準資料集上進行的廣泛實驗顯示，HijackRAG 持續達成高攻擊成功率，優於現有的基準攻擊。此外，我們證明了這種攻擊可以轉移到不同的檢索器模型，強調了它對 RAG 系統構成的廣泛風險。最後，我們探索了各種防禦機制，發現它們不足以對抗 HijackRAG，強調了在實際部署中保護 RAG 系統時，迫切需要更強大的安全措施。", "author": "Yucheng Zhang et.al.", "authors": "Yucheng Zhang, Qinfeng Li, Tianyu Du, Xuhong Zhang, Xinkui Zhao, Zhengwen Feng, Jianwei Yin", "id": "2410.22832v1", "paper_url": "http://arxiv.org/abs/2410.22832v1", "repo": "null"}}