{"2405.17931": {"publish_time": "2024-05-28", "title": "Online Merging Optimizers for Boosting Rewards and Mitigating Tax in Alignment", "paper_summary": "Effectively aligning Large Language Models (LLMs) with human-centric values\nwhile preventing the degradation of abilities acquired through Pre-training and\nSupervised Fine-tuning (SFT) poses a central challenge in Reinforcement\nLearning from Human Feedback (RLHF). In this paper, we first discover that\ninterpolating RLHF and SFT model parameters can adjust the trade-off between\nhuman preference and basic capabilities, thereby reducing the alignment tax at\nthe cost of alignment reward. Inspired by this, we propose integrating the RL\npolicy and SFT models at each optimization step in RLHF to continuously\nregulate the training direction, introducing the Online Merging Optimizer.\nSpecifically, we merge gradients with the parameter differences between SFT and\npretrained models, effectively steering the gradient towards maximizing rewards\nin the direction of SFT optimization. We demonstrate that our optimizer works\nwell with different LLM families, such as Qwen and LLaMA, across various model\nsizes ranging from 1.8B to 8B, various RLHF algorithms like DPO and KTO, and\nexisting model merging methods. It significantly enhances alignment reward\nwhile mitigating alignment tax, achieving higher overall performance across 14\nbenchmarks.", "paper_summary_zh": "有效地將大型語言模型 (LLM) 與以人為中心的價值觀保持一致，同時防止通過預訓練和監督微調 (SFT) 獲得的能力下降，這對強化學習從人類回饋 (RLHF) 中提出了核心挑戰。在本文中，我們首先發現插補 RLHF 和 SFT 模型參數可以調整人類偏好和基本能力之間的權衡，從而以對齊獎勵為代價降低對齊成本。受此啟發，我們提出在 RLHF 中的每個優化步驟中整合 RL 策略和 SFT 模型，以持續調節訓練方向，引入線上合併優化器。具體來說，我們將梯度與 SFT 和預訓練模型之間的參數差異合併，有效地引導梯度朝著 SFT 優化的方向最大化獎勵。我們證明了我們的優化器適用於不同的 LLM 家族，例如 Qwen 和 LLaMA，跨越從 1.8B 到 8B 的各種模型大小、各種 RLHF 演算法，例如 DPO 和 KTO，以及現有的模型合併方法。它顯著提高了對齊獎勵，同時減輕了對齊成本，在 14 個基準測試中實現了更高的整體性能。", "author": "Keming Lu et.al.", "authors": "Keming Lu, Bowen Yu, Fei Huang, Yang Fan, Runji Lin, Chang Zhou", "id": "2405.17931v1", "paper_url": "http://arxiv.org/abs/2405.17931v1", "repo": "null"}}