{"2406.02060": {"publish_time": "2024-06-04", "title": "I've got the \"Answer\"! Interpretation of LLMs Hidden States in Question Answering", "paper_summary": "Interpretability and explainability of AI are becoming increasingly important\nin light of the rapid development of large language models (LLMs). This paper\ninvestigates the interpretation of LLMs in the context of the knowledge-based\nquestion answering. The main hypothesis of the study is that correct and\nincorrect model behavior can be distinguished at the level of hidden states.\nThe quantized models LLaMA-2-7B-Chat, Mistral-7B, Vicuna-7B and the MuSeRC\nquestion-answering dataset are used to test this hypothesis. The results of the\nanalysis support the proposed hypothesis. We also identify the layers which\nhave a negative effect on the model's behavior. As a prospect of practical\napplication of the hypothesis, we propose to train such \"weak\" layers\nadditionally in order to improve the quality of the task solution.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的快速發展，AI 的可解釋性和可說明性變得越來越重要。本文探討了在基於知識的問答背景下對 LLM 的解釋。該研究的主要假設是，正確和不正確的模型行為可以在隱藏狀態的層面上區分。量化模型 LLaMA-2-7B-Chat、Mistral-7B、Vicuna-7B 和 MuSeRC 問答資料集被用於測試這個假設。分析結果支持了所提出的假設。我們還識別出對模型行為產生負面影響的層。作為假設實際應用的一個前景，我們建議額外訓練這些「弱」層，以提高任務解決方案的品質。", "author": "Valeriya Goloviznina et.al.", "authors": "Valeriya Goloviznina, Evgeny Kotelnikov", "id": "2406.02060v1", "paper_url": "http://arxiv.org/abs/2406.02060v1", "repo": "null"}}