{"2502.02975": {"publish_time": "2025-02-05", "title": "TGB-Seq Benchmark: Challenging Temporal GNNs with Complex Sequential Dynamics", "paper_summary": "Future link prediction is a fundamental challenge in various real-world\ndynamic systems. To address this, numerous temporal graph neural networks\n(temporal GNNs) and benchmark datasets have been developed. However, these\ndatasets often feature excessive repeated edges and lack complex sequential\ndynamics, a key characteristic inherent in many real-world applications such as\nrecommender systems and ``Who-To-Follow'' on social networks. This oversight\nhas led existing methods to inadvertently downplay the importance of learning\nsequential dynamics, focusing primarily on predicting repeated edges.\n  In this study, we demonstrate that existing methods, such as GraphMixer and\nDyGFormer, are inherently incapable of learning simple sequential dynamics,\nsuch as ``a user who has followed OpenAI and Anthropic is more likely to follow\nAI at Meta next.'' Motivated by this issue, we introduce the Temporal Graph\nBenchmark with Sequential Dynamics (TGB-Seq), a new benchmark carefully curated\nto minimize repeated edges, challenging models to learn sequential dynamics and\ngeneralize to unseen edges. TGB-Seq comprises large real-world datasets\nspanning diverse domains, including e-commerce interactions, movie ratings,\nbusiness reviews, social networks, citation networks and web link networks.\nBenchmarking experiments reveal that current methods usually suffer significant\nperformance degradation and incur substantial training costs on TGB-Seq, posing\nnew challenges and opportunities for future research. TGB-Seq datasets,\nleaderboards, and example codes are available at https://tgb-seq.github.io/.", "paper_summary_zh": "未來連結預測是各種真實世界動態系統中的一項基本挑戰。為了解決這個問題，已經開發了許多時序圖神經網路（時序 GNN）和基準資料集。然而，這些資料集通常具有過多的重複邊，並且缺乏複雜的順序動態，這是許多真實世界應用中固有的關鍵特徵，例如推薦系統和社群網路上的「誰來追蹤」。這種疏忽導致現有方法無意中淡化了學習順序動態的重要性，主要專注於預測重複的邊。\n在本研究中，我們證明了現有方法，例如 GraphMixer 和 DyGFormer，本質上無法學習簡單的順序動態，例如「一個追蹤 OpenAI 和 Anthropic 的使用者更有可能在 Meta 上追蹤 AI」。受到這個問題的啟發，我們引入了具有順序動態的時序圖基準（TGB-Seq），這是一個經過仔細策劃的新基準，用於最小化重複的邊，挑戰模型學習順序動態並推廣到未見的邊。TGB-Seq 包含涵蓋不同領域的大型真實世界資料集，包括電子商務互動、電影評分、商業評論、社群網路、引文網路和網路連結網路。基準實驗表明，目前的方法通常在 TGB-Seq 上遭受顯著的效能下降，並產生大量的訓練成本，為未來的研究提出新的挑戰和機會。TGB-Seq 資料集、排行榜和範例程式碼可在 https://tgb-seq.github.io/ 取得。", "author": "Lu Yi et.al.", "authors": "Lu Yi, Jie Peng, Yanping Zheng, Fengran Mo, Zhewei Wei, Yuhang Ye, Yue Zixuan, Zengfeng Huang", "id": "2502.02975v1", "paper_url": "http://arxiv.org/abs/2502.02975v1", "repo": "null"}}