{"2408.04870": {"publish_time": "2024-08-09", "title": "ConfusedPilot: Compromising Enterprise Information Integrity and Confidentiality with Copilot for Microsoft 365", "paper_summary": "Retrieval augmented generation (RAG) is a process where a large language\nmodel (LLM) retrieves useful information from a database and then generates the\nresponses. It is becoming popular in enterprise settings for daily business\noperations. For example, Copilot for Microsoft 365 has accumulated millions of\nbusinesses. However, the security implications of adopting such RAG-based\nsystems are unclear.\n  In this paper, we introduce ConfusedPilot, a class of security\nvulnerabilities of RAG systems that confuse Copilot and cause integrity and\nconfidentiality violations in its responses. First, we investigate a\nvulnerability that embeds malicious text in the modified prompt in RAG,\ncorrupting the responses generated by the LLM. Second, we demonstrate a\nvulnerability that leaks secret data, which leverages the caching mechanism\nduring retrieval. Third, we investigate how both vulnerabilities can be\nexploited to propagate misinformation within the enterprise and ultimately\nimpact its operations, such as sales and manufacturing. We also discuss the\nroot cause of these attacks by investigating the architecture of a RAG-based\nsystem. This study highlights the security vulnerabilities in today's RAG-based\nsystems and proposes design guidelines to secure future RAG-based systems.", "paper_summary_zh": "檢索擴充生成 (RAG) 是一個大型語言模型 (LLM) 從資料庫中擷取有用資訊，然後生成回應的程序。它在企業環境中正變得普及，可應用於日常業務營運。例如，Microsoft 365 的 Copilot 已累積數百萬筆業務。然而，採用此類基於 RAG 的系統的安全性影響尚不清楚。\n在本文中，我們介紹 ConfusedPilot，一種會混淆 Copilot，並導致其回應中出現完整性和機密性漏洞的 RAG 系統安全性漏洞類別。首先，我們研究一種將惡意文字嵌入 RAG 中修改提示的漏洞，破壞 LLM 生成的回應。其次，我們展示一個會洩漏機密資料的漏洞，它利用擷取期間的快取機制。第三，我們研究如何利用這兩個漏洞在企業內部傳播錯誤資訊，並最終影響其營運，例如銷售和製造。我們也透過研究基於 RAG 的系統架構，討論這些攻擊的根本原因。本研究強調當今基於 RAG 的系統中的安全性漏洞，並提出設計準則以保護未來的基於 RAG 的系統。", "author": "Ayush RoyChowdhury et.al.", "authors": "Ayush RoyChowdhury, Mulong Luo, Prateek Sahu, Sarbartha Banerjee, Mohit Tiwari", "id": "2408.04870v1", "paper_url": "http://arxiv.org/abs/2408.04870v1", "repo": "null"}}