{"2502.15466": {"publish_time": "2025-02-21", "title": "Mitigating Data Scarcity in Time Series Analysis: A Foundation Model with Series-Symbol Data Generation", "paper_summary": "Foundation models for time series analysis (TSA) have attracted significant\nattention. However, challenges such as data scarcity and data imbalance\ncontinue to hinder their development. To address this, we consider modeling\ncomplex systems through symbolic expressions that serve as semantic descriptors\nof time series. Building on this concept, we introduce a series-symbol (S2)\ndual-modulity data generation mechanism, enabling the unrestricted creation of\nhigh-quality time series data paired with corresponding symbolic\nrepresentations. Leveraging the S2 dataset, we develop SymTime, a pre-trained\nfoundation model for TSA. SymTime demonstrates competitive performance across\nfive major TSA tasks when fine-tuned with downstream task, rivaling foundation\nmodels pre-trained on real-world datasets. This approach underscores the\npotential of dual-modality data generation and pretraining mechanisms in\novercoming data scarcity and enhancing task performance.", "paper_summary_zh": "時序分析 (TSA) 的基礎模型已引起極大的關注。然而，資料稀少和資料不平衡等挑戰持續阻礙其發展。為了解決此問題，我們考慮透過作為時序語意描述符的符號表達式來建構複雜系統。基於此概念，我們引入一個系列符號 (S2) 雙模態資料生成機制，讓配對有對應符號表示的高品質時序資料得以不受限制地建立。利用 S2 資料集，我們開發了 SymTime，一個針對 TSA 的預先訓練基礎模型。SymTime 在微調下游任務時，展現出在五項主要 TSA 任務中的競爭力表現，與在真實世界資料集上預先訓練的基礎模型匹敵。此方法強調了雙模態資料生成和預訓練機制在克服資料稀少性和增強任務效能方面的潛力。", "author": "Wenxuan Wang et.al.", "authors": "Wenxuan Wang, Kai Wu, Yujian Betterest Li, Dan Wang, Xiaoyu Zhang, Jing Liu", "id": "2502.15466v1", "paper_url": "http://arxiv.org/abs/2502.15466v1", "repo": "null"}}