{"2501.11223": {"publish_time": "2025-01-20", "title": "Reasoning Language Models: A Blueprint", "paper_summary": "Reasoning language models (RLMs), also known as Large Reasoning Models\n(LRMs), such as OpenAI's o1 and o3, DeepSeek-V3, and Alibaba's QwQ, have\nredefined AI's problem-solving capabilities by extending LLMs with advanced\nreasoning mechanisms. Yet, their high costs, proprietary nature, and complex\narchitectures - uniquely combining Reinforcement Learning (RL), search\nheuristics, and LLMs - present accessibility and scalability challenges. To\naddress these, we propose a comprehensive blueprint that organizes RLM\ncomponents into a modular framework, based on a survey and analysis of all RLM\nworks. This blueprint incorporates diverse reasoning structures (chains, trees,\ngraphs, and nested forms), reasoning strategies (e.g., Monte Carlo Tree Search,\nBeam Search), RL concepts (policy, value models and others), supervision\nschemes (Outcome-Based and Process-Based Supervision), and other related\nconcepts (e.g., Test-Time Compute, Retrieval-Augmented Generation, agent\ntools). We provide detailed mathematical formulations and algorithmic\nspecifications to simplify RLM implementation. By showing how schemes like\nLLaMA-Berry, QwQ, Journey Learning, and Graph of Thoughts fit as special cases,\nwe demonstrate the blueprint's versatility and unifying potential. To\nillustrate its utility, we introduce x1, a modular implementation for rapid RLM\nprototyping and experimentation. Using x1 and a literature review, we provide\nkey insights, such as multi-phase training for policy and value models, and the\nimportance of familiar training distributions. Finally, we discuss scalable RLM\ncloud deployments and we outline how RLMs can integrate with a broader LLM\necosystem. Our work demystifies RLM construction, democratizes advanced\nreasoning capabilities, and fosters innovation, aiming to mitigate the gap\nbetween \"rich AI\" and \"poor AI\" by lowering barriers to RLM development and\nexperimentation.", "paper_summary_zh": "推理語言模型 (RLM)，又稱大型推理模型 (LRM)，例如 OpenAI 的 o1 和 o3、DeepSeek-V3 和阿里巴巴的 QwQ，透過先進的推理機制擴充 LLM，重新定義了 AI 的問題解決能力。然而，它們的高成本、專有性質和複雜的架構（獨特地結合了強化學習 (RL)、搜尋啟發法和 LLM）帶來了可及性和可擴充性的挑戰。為了解決這些問題，我們提出了一個全面的藍圖，根據對所有 RLM 作品的調查和分析，將 RLM 組件組織成一個模組化架構。此藍圖包含了多樣的推理結構（鏈、樹、圖和巢狀形式）、推理策略（例如蒙地卡羅樹搜尋、波束搜尋）、RL 概念（策略、價值模型等）、監督方案（基於結果的監督和基於流程的監督）和其他相關概念（例如測試時間計算、檢索增強生成、代理工具）。我們提供了詳細的數學公式和演算法規範，以簡化 RLM 的實作。透過展示 LLaMA-Berry、QwQ、旅程學習和思想圖如何作為特例，我們證明了藍圖的多功能性和統一的潛力。為了說明其效用，我們引入了 x1，一個用於快速 RLM 原型製作和實驗的模組化實作。使用 x1 和文獻回顧，我們提供了關鍵見解，例如策略和價值模型的多階段訓練，以及熟悉訓練分佈的重要性。最後，我們討論了可擴充的 RLM 雲端部署，並概述了 RLM 如何與更廣泛的 LLM 生態系統整合。我們的研究揭開了 RLM 結構的神秘面紗，讓先進的推理能力民主化，並促進創新，旨在透過降低 RLM 開發和實驗的障礙，縮小「富裕 AI」和「貧窮 AI」之間的差距。", "author": "Maciej Besta et.al.", "authors": "Maciej Besta, Julia Barth, Eric Schreiber, Ales Kubicek, Afonso Catarino, Robert Gerstenberger, Piotr Nyczyk, Patrick Iff, Yueling Li, Sam Houliston, Tomasz Sternal, Marcin Copik, Grzegorz Kwaśniewski, Jürgen Müller, Łukasz Flis, Hannes Eberhard, Hubert Niewiadomski, Torsten Hoefler", "id": "2501.11223v2", "paper_url": "http://arxiv.org/abs/2501.11223v2", "repo": "https://github.com/spcl/x1"}}