{"2405.20018": {"publish_time": "2024-05-30", "title": "Safe Multi-agent Reinforcement Learning with Natural Language Constraints", "paper_summary": "The role of natural language constraints in Safe Multi-agent Reinforcement\nLearning (MARL) is crucial, yet often overlooked. While Safe MARL has vast\npotential, especially in fields like robotics and autonomous vehicles, its full\npotential is limited by the need to define constraints in pre-designed\nmathematical terms, which requires extensive domain expertise and reinforcement\nlearning knowledge, hindering its broader adoption. To address this limitation\nand make Safe MARL more accessible and adaptable, we propose a novel approach\nnamed Safe Multi-agent Reinforcement Learning with Natural Language constraints\n(SMALL). Our method leverages fine-tuned language models to interpret and\nprocess free-form textual constraints, converting them into semantic embeddings\nthat capture the essence of prohibited states and behaviours. These embeddings\nare then integrated into the multi-agent policy learning process, enabling\nagents to learn policies that minimize constraint violations while optimizing\nrewards. To evaluate the effectiveness of SMALL, we introduce the LaMaSafe, a\nmulti-task benchmark designed to assess the performance of multiple agents in\nadhering to natural language constraints. Empirical evaluations across various\nenvironments demonstrate that SMALL achieves comparable rewards and\nsignificantly fewer constraint violations, highlighting its effectiveness in\nunderstanding and enforcing natural language constraints.", "paper_summary_zh": "在安全多智能體強化學習 (MARL) 中，自然語言約束扮演著至關重要的角色，但卻經常被忽視。儘管安全 MARL 具有廣泛的潛力，特別是在機器人和自動駕駛汽車等領域，但其潛力受到定義預先設計數學術語約束的限制，這需要廣泛的領域專業知識和強化學習知識，阻礙了其更廣泛的應用。為了解決這個限制並讓安全 MARL 更容易使用和適應，我們提出了一種名為自然語言約束安全多智能體強化學習 (SMALL) 的新方法。我們的模型利用微調的語言模型來解釋和處理自由形式的文本約束，將其轉換為語義嵌入，以捕捉禁止狀態和行為的本質。然後將這些嵌入整合到多智能體策略學習過程中，讓智能體能夠學習最小化約束違規的策略，同時優化獎勵。為了評估 SMALL 的有效性，我們引入了 LaMaSafe，這是一個多任務基準，旨在評估多個智能體遵守自然語言約束的表現。在各種環境中的經驗評估表明，SMALL 達到了可比較的獎勵，並且約束違規明顯減少，突顯了其在理解和執行自然語言約束方面的有效性。", "author": "Ziyan Wang et.al.", "authors": "Ziyan Wang, Meng Fang, Tristan Tomilin, Fei Fang, Yali Du", "id": "2405.20018v1", "paper_url": "http://arxiv.org/abs/2405.20018v1", "repo": "null"}}