{"2407.14192": {"publish_time": "2024-07-19", "title": "LeKUBE: A Legal Knowledge Update BEnchmark", "paper_summary": "Recent advances in Large Language Models (LLMs) have significantly shaped the\napplications of AI in multiple fields, including the studies of legal\nintelligence. Trained on extensive legal texts, including statutes and legal\ndocuments, the legal LLMs can capture important legal knowledge/concepts\neffectively and provide important support for downstream legal applications\nsuch as legal consultancy. Yet, the dynamic nature of legal statutes and\ninterpretations also poses new challenges to the use of LLMs in legal\napplications. Particularly, how to update the legal knowledge of LLMs\neffectively and efficiently has become an important research problem in\npractice. Existing benchmarks for evaluating knowledge update methods are\nmostly designed for the open domain and cannot address the specific challenges\nof the legal domain, such as the nuanced application of new legal knowledge,\nthe complexity and lengthiness of legal regulations, and the intricate nature\nof legal reasoning. To address this gap, we introduce the Legal Knowledge\nUpdate BEnchmark, i.e. LeKUBE, which evaluates knowledge update methods for\nlegal LLMs across five dimensions. Specifically, we categorize the needs of\nknowledge updates in the legal domain with the help of legal professionals, and\nthen hire annotators from law schools to create synthetic updates to the\nChinese Criminal and Civil Code as well as sets of questions of which the\nanswers would change after the updates. Through a comprehensive evaluation of\nstate-of-the-art knowledge update methods, we reveal a notable gap between\nexisting knowledge update methods and the unique needs of the legal domain,\nemphasizing the need for further research and development of knowledge update\nmechanisms tailored for legal LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 的近期進展已顯著塑造了 AI 在多個領域的應用，包括法律智能的研究。在廣泛的法律文本（包括法規和法律文件）上訓練的法律 LLM 可以有效地擷取重要的法律知識/概念，並為法律諮詢等下游法律應用提供重要的支援。然而，法律法規和解釋的動態性質也對 LLM 在法律應用中的使用提出了新的挑戰。特別是，如何有效且高效地更新 LLM 的法律知識已成為實務中重要的研究問題。現有的知識更新方法評估基準大多是為開放領域設計的，無法解決法律領域的特定挑戰，例如新法律知識的細微應用、法律法規的複雜性和冗長性，以及法律推理的複雜性。為了解決這個差距，我們引入了法律知識更新基準，即 LeKUBE，它在五個面向評估法律 LLM 的知識更新方法。具體來說，我們在法律專業人士的幫助下對法律領域中知識更新的需求進行分類，然後聘請法學院的註解者為中國刑法和民法典創建綜合更新，以及在更新後答案會改變的一組問題。透過對最先進的知識更新方法進行全面評估，我們揭示了現有知識更新方法與法律領域獨特需求之間的顯著差距，強調需要進一步研究和開發專為法律 LLM 量身打造的知識更新機制。", "author": "Changyue Wang et.al.", "authors": "Changyue Wang, Weihang Su, Hu Yiran, Qingyao Ai, Yueyue Wu, Cheng Luo, Yiqun Liu, Min Zhang, Shaoping Ma", "id": "2407.14192v1", "paper_url": "http://arxiv.org/abs/2407.14192v1", "repo": "null"}}