{"2502.10361": {"publish_time": "2025-02-14", "title": "Enhancing Multilingual LLM Pretraining with Model-Based Data Selection", "paper_summary": "Dataset curation has become a basis for strong large language model (LLM)\nperformance. While various rule-based filtering heuristics exist for English\nand multilingual datasets, model-based filtering techniques have primarily\nfocused on English. To address the disparity stemming from limited research on\nnon-English languages, we propose a model-based filtering framework for\nmultilingual datasets that aims to identify a diverse set of structured and\nknowledge-rich samples. Our approach emphasizes transparency, simplicity, and\nefficiency, leveraging Transformer- and FastText-based classifiers to ensure\nthe broad accessibility of our technique and data. We conduct comprehensive\nablation studies on the FineWeb-2 web crawl dataset across diverse language\nfamilies, scripts, and resource availability to demonstrate the effectiveness\nof our method. Training a 1B-parameter Llama model for 70B and 119B tokens, our\napproach can match the baseline MMLU score with as little as 15% of the\ntraining tokens, while also improving across other benchmarks. These findings\nprovide strong evidence for the generalizability of our approach to other\nlanguages. As a result, we extend our framework to 20 languages for which we\nrelease the refined pretraining datasets.", "paper_summary_zh": "資料集策展已成為強大的大型語言模型 (LLM) 效能的基礎。雖然針對英文和多語言資料集存在各種基於規則的過濾啟發法，但基於模型的過濾技術主要集中在英文上。為了解決源自對非英文語言研究有限的不平等，我們提出了一個針對多語言資料集的基於模型的過濾架構，旨在識別一組結構化且富含知識的樣本。我們的做法強調透明度、簡潔性和效率，利用 Transformer 和 FastText 為基礎的分類器來確保我們技術和資料的廣泛可及性。我們對 FineWeb-2 網路爬取資料集進行了全面的消融研究，涵蓋不同的語言系列、腳本和資源可用性，以證明我們方法的有效性。訓練一個 1B 參數的 Llama 模型，分別使用 70B 和 119B 個詞彙，我們的做法可以匹配基準 MMLU 分數，而訓練詞彙量僅為 15%，同時也能在其他基準中獲得改進。這些發現為我們的方法對其他語言的普遍性提供了強有力的證據。因此，我們將我們的架構擴展到 20 種語言，並為其發布精煉的預訓練資料集。", "author": "Bettina Messmer et.al.", "authors": "Bettina Messmer, Vinko Sabolčec, Martin Jaggi", "id": "2502.10361v1", "paper_url": "http://arxiv.org/abs/2502.10361v1", "repo": "null"}}