{"2407.06826": {"publish_time": "2024-07-09", "title": "VRDSynth: Synthesizing Programs for Multilingual Visually Rich Document Information Extraction", "paper_summary": "Businesses need to query visually rich documents (VRDs) like receipts,\nmedical records, and insurance forms to make decisions. Existing techniques for\nextracting entities from VRDs struggle with new layouts or require extensive\npre-training data. We introduce VRDSynth, a program synthesis method to\nautomatically extract entity relations from multilingual VRDs without\npre-training data. To capture the complexity of VRD domain, we design a\ndomain-specific language (DSL) to capture spatial and textual relations to\ndescribe the synthesized programs. Along with this, we also derive a new\nsynthesis algorithm utilizing frequent spatial relations, search space pruning,\nand a combination of positive, negative, and exclusive programs to improve\ncoverage.\n  We evaluate VRDSynth on the FUNSD and XFUND benchmarks for semantic entity\nlinking, consisting of 1,592 forms in 8 languages. VRDSynth outperforms\nstate-of-the-art pre-trained models (LayoutXLM, InfoXLMBase, and\nXLMRobertaBase) in 5, 6, and 7 out of 8 languages, respectively, improving the\nF1 score by 42% over LayoutXLM in English. To test the extensibility of the\nmodel, we further improve VRDSynth with automated table recognition, creating\nVRDSynth(Table), and compare it with extended versions of the pre-trained\nmodels, InfoXLM(Large) and XLMRoberta(Large). VRDSynth(Table) outperforms these\nbaselines in 4 out of 8 languages and in average F1 score. VRDSynth also\nsignificantly reduces memory footprint (1M and 380MB vs. 1.48GB and 3GB for\nLayoutXLM) while maintaining similar time efficiency.", "paper_summary_zh": "<paragraph>企業需要查詢視覺豐富的文件 (VRD)，例如收據、醫療記錄和保險單據，才能做出決策。現有的技術用於從 VRD 中提取實體，會遇到新的版面問題，或者需要大量的預訓練數據。我們介紹 VRDSynth，這是一種程式合成方法，可以在沒有預訓練數據的情況下自動從多語言 VRD 中提取實體關係。為了捕捉 VRD 領域的複雜性，我們設計了一個特定領域語言 (DSL)，用於捕捉空間和文字關係，以描述合成的程式。除此之外，我們還推導出一個新的合成演算法，利用頻繁的空間關係、搜尋空間剪枝，以及正、負和排他程式的組合，以改善涵蓋範圍。\n我們在 FUNSD 和 XFUND 基準上評估 VRDSynth，用於語義實體連結，包含 8 種語言的 1,592 個表單。VRDSynth 在 8 種語言中的 5、6 和 7 種語言中優於最先進的預訓練模型 (LayoutXLM、InfoXLMBase 和 XLMRobertaBase)，分別將英文中的 F1 分數提高了 42%，高於 LayoutXLM。為了測試模型的可擴充性，我們進一步改進 VRDSynth，採用自動化表格識別，建立 VRDSynth(Table)，並將其與預訓練模型 InfoXLM(Large) 和 XLMRoberta(Large) 的延伸版本進行比較。VRDSynth(Table) 在 8 種語言中的 4 種語言和平均 F1 分數中優於這些基準。VRDSynth 還顯著減少了記憶體使用量 (1M 和 380MB，而 LayoutXLM 為 1.48GB 和 3GB)，同時維持類似的時間效率。</paragraph>", "author": "Thanh-Dat Nguyen et.al.", "authors": "Thanh-Dat Nguyen, Tung Do-Viet, Hung Nguyen-Duy, Tuan-Hai Luu, Hung Le, Bach Le, Patanamon, Thongtanunam", "id": "2407.06826v1", "paper_url": "http://arxiv.org/abs/2407.06826v1", "repo": "null"}}