{"2407.02854": {"publish_time": "2024-07-03", "title": "Universal Gloss-level Representation for Gloss-free Sign Language Translation and Production", "paper_summary": "Sign language, essential for the deaf and hard-of-hearing, presents unique\nchallenges in translation and production due to its multimodal nature and the\ninherent ambiguity in mapping sign language motion to spoken language words.\nPrevious methods often rely on gloss annotations, requiring time-intensive\nlabor and specialized expertise in sign language. Gloss-free methods have\nemerged to address these limitations, but they often depend on external sign\nlanguage data or dictionaries, failing to completely eliminate the need for\ngloss annotations. There is a clear demand for a comprehensive approach that\ncan supplant gloss annotations and be utilized for both Sign Language\nTranslation (SLT) and Sign Language Production (SLP). We introduce Universal\nGloss-level Representation (UniGloR), a unified and self-supervised solution\nfor both SLT and SLP, trained on multiple datasets including PHOENIX14T,\nHow2Sign, and NIASL2021. Our results demonstrate UniGloR's effectiveness in the\ntranslation and production tasks. We further report an encouraging result for\nthe Sign Language Recognition (SLR) on previously unseen data. Our study\nsuggests that self-supervised learning can be made in a unified manner, paving\nthe way for innovative and practical applications in future research.", "paper_summary_zh": "手語對於聾啞人士和聽障人士來說至關重要，由於其多模態的特性和將手語動作對應到口語單詞的固有模糊性，因此在翻譯和製作方面提出了獨特挑戰。\n以往的方法通常依賴於註解說明，需要耗費時間密集的人力和手語方面的專業知識。無註解方法應運而生以解決這些限制，但它們通常依賴於外部手語數據或字典，無法完全消除對註解說明的需求。顯然需要一種綜合方法，既可以取代註解說明，又可以同時用於手語翻譯 (SLT) 和手語製作 (SLP)。我們引入了通用註解級別表示法 (UniGloR)，這是一種統一且自監督的解決方案，適用於 SLT 和 SLP，並在包括 PHOENIX14T、How2Sign 和 NIASL2021 在內的 multiple 數據集上進行了訓練。我們的結果證明了 UniGloR 在翻譯和製作任務中的有效性。我們進一步報告了先前未見數據的手語識別 (SLR) 的令人鼓舞的結果。我們的研究表明，自監督學習可以以統一的方式進行，為未來研究中的創新和實際應用鋪平了道路。", "author": "Eui Jun Hwang et.al.", "authors": "Eui Jun Hwang, Sukmin Cho, Huije Lee, Youngwoo Yoon, Jong C. Park", "id": "2407.02854v1", "paper_url": "http://arxiv.org/abs/2407.02854v1", "repo": "null"}}