{"2410.07866": {"publish_time": "2024-10-10", "title": "System-2 Reasoning via Generality and Adaptation", "paper_summary": "While significant progress has been made in task-specific applications,\ncurrent models struggle with deep reasoning, generality, and adaptation -- key\ncomponents of System-2 reasoning that are crucial for achieving Artificial\nGeneral Intelligence (AGI). Despite the promise of approaches such as program\nsynthesis, language models, and transformers, these methods often fail to\ngeneralize beyond their training data and to adapt to novel tasks, limiting\ntheir ability to perform human-like reasoning. This paper explores the\nlimitations of existing approaches in achieving advanced System-2 reasoning and\nhighlights the importance of generality and adaptation for AGI. Moreover, we\npropose four key research directions to address these gaps: (1) learning human\nintentions from action sequences, (2) combining symbolic and neural models, (3)\nmeta-learning for unfamiliar environments, and (4) reinforcement learning to\nreason multi-step. Through these directions, we aim to advance the ability to\ngeneralize and adapt, bringing computational models closer to the reasoning\ncapabilities required for AGI.", "paper_summary_zh": "儘管在特定任務應用程式方面已取得重大進展，\n目前的模型在深度推理、普遍性和適應性方面仍有困難，而這些是系統 2 推理中至關重要的關鍵組成部分，對於實現人工通用智慧 (AGI) 至關重要。儘管有程式合成、語言模型和轉換器等方法，但這些方法通常無法推廣到訓練資料之外並適應新任務，這限制了它們執行類人推理的能力。本文探討了現有方法在實現進階系統 2 推理方面的限制，並強調了普遍性和適應性對 AGI 的重要性。此外，我們提出了四個關鍵研究方向來解決這些差距：(1) 從動作序列中學習人類意圖，(2) 結合符號和神經模型，(3) 針對不熟悉的環境進行元學習，以及 (4) 透過強化學習進行多步驟推理。透過這些方向，我們旨在提升推廣和適應的能力，讓計算模型更接近 AGI 所需的推理能力。", "author": "Sejin Kim et.al.", "authors": "Sejin Kim, Sundong Kim", "id": "2410.07866v1", "paper_url": "http://arxiv.org/abs/2410.07866v1", "repo": "null"}}