{"2405.17878": {"publish_time": "2024-05-28", "title": "An Information Theoretic Metric for Evaluating Unlearning Models", "paper_summary": "Machine unlearning (MU) addresses privacy concerns by removing information of\n`forgetting data' samples from trained models. Typically, evaluating MU methods\ninvolves comparing unlearned models to those retrained from scratch without\nforgetting data, using metrics such as membership inference attacks (MIA) and\naccuracy measurements. These evaluations implicitly assume that if the output\nlogits of the unlearned and retrained models are similar, the unlearned model\nhas successfully forgotten the data. Here, we challenge if this assumption is\nvalid. In particular, we conduct a simple experiment of training only the last\nlayer of a given original model using a novel masked-distillation technique\nwhile keeping the rest fixed. Surprisingly, simply altering the last layer\nyields favorable outcomes in the existing evaluation metrics, while the model\ndoes not successfully unlearn the samples or classes. For better evaluating the\nMU methods, we propose a metric that quantifies the residual information about\nforgetting data samples in intermediate features using mutual information,\ncalled information difference index or IDI for short. The IDI provides a\ncomprehensive evaluation of MU methods by efficiently analyzing the internal\nstructure of DNNs. Our metric is scalable to large datasets and adaptable to\nvarious model architectures. Additionally, we present COLapse-and-Align (COLA),\na simple contrastive-based method that effectively unlearns intermediate\nfeatures.", "paper_summary_zh": "机器去学习（MU）通过移除训练模型中“遗忘数据”样本的信息来解决隐私问题。通常，评估 MU 方法涉及将未学习的模型与从头开始重新训练的模型进行比较，而不忘记数据，使用诸如成员资格推断攻击 (MIA) 和准确度测量等指标。这些评估隐含地假设，如果未学习和重新训练的模型的输出 logit 相似，则未学习的模型已成功忘记数据。在此，我们质疑此假设是否有效。特别是，我们仅使用一种新颖的掩码蒸馏技术训练给定原始模型的最后一层，同时保持其余部分固定，从而进行一个简单的实验。令人惊讶的是，仅仅改变最后一层就会在现有的评估指标中产生有利的结果，而该模型并不能成功地忘记样本或类别。为了更好地评估 MU 方法，我们提出了一种度量标准，该度量标准使用互信息量化中间特征中关于遗忘数据样本的残留信息，简称信息差异指数或 IDI。IDI 通过有效分析 DNN 的内部结构，提供对 MU 方法的综合评估。我们的指标可扩展到大型数据集，并适用于各种模型架构。此外，我们提出了 COLapse-and-Align (COLA)，这是一种简单的基于对比的方法，可以有效地取消中间特征的学习。", "author": "Dongjae Jeon et.al.", "authors": "Dongjae Jeon, Wonje Jeung, Taeheon Kim, Albert No, Jonghyun Choi", "id": "2405.17878v1", "paper_url": "http://arxiv.org/abs/2405.17878v1", "repo": "null"}}