{"2502.14678": {"publish_time": "2025-02-20", "title": "How to Get Your LLM to Generate Challenging Problems for Evaluation", "paper_summary": "The pace of evolution of Large Language Models (LLMs) necessitates new\napproaches for rigorous and comprehensive evaluation. Traditional human\nannotation is increasingly impracticable due to the complexities and costs\ninvolved in generating high-quality, challenging problems. In this work, we\nintroduce CHASE, a unified framework to synthetically generate challenging\nproblems using LLMs without human involvement. For a given task, our approach\nbuilds a hard problem in a bottom-up manner from simpler components. Moreover,\nour framework decomposes the generation process into independently verifiable\nsub-tasks, thereby ensuring a high level of quality and correctness. We\nimplement CHASE to create evaluation benchmarks across three diverse domains:\n(1) document-based question answering, (2) repository-level code completion,\nand (3) math reasoning. The performance of state-of-the-art LLMs on these\nsynthetic benchmarks lies in the range of 40-60% accuracy, thereby\ndemonstrating the effectiveness of our framework at generating challenging\nproblems. We publicly release our benchmarks and code.", "paper_summary_zh": "大型語言模型 (LLM) 的演化速度需要新的方法來進行嚴謹且全面的評估。由於產生高品質、具挑戰性的問題所涉及的複雜性和成本，傳統的人工標註正變得越來越不可行。在這項工作中，我們介紹了 CHASE，一個統一的框架，用於使用 LLM 合成產生具有挑戰性的問題，而無需人工參與。對於給定的任務，我們的做法是以自下而上的方式從更簡單的組成部分來建立一個困難的問題。此外，我們的框架將生成過程分解為獨立可驗證的子任務，從而確保高品質和正確性。我們實作 CHASE 來建立三個不同領域的評估基準：(1) 基於文件的問答、(2) 儲存庫層級的程式碼完成，以及 (3) 數學推理。最先進的 LLM 在這些合成基準上的效能落在 40-60% 的準確度範圍內，從而證明了我們的框架在產生具有挑戰性的問題上的有效性。我們公開發布我們的基準和程式碼。", "author": "Arkil Patel et.al.", "authors": "Arkil Patel, Siva Reddy, Dzmitry Bahdanau", "id": "2502.14678v1", "paper_url": "http://arxiv.org/abs/2502.14678v1", "repo": "null"}}