{"2411.19906": {"publish_time": "2024-11-29", "title": "Classical and Quantum Algorithms for the Deterministic L-system Inductive Inference Problem", "paper_summary": "L-systems can be made to model and create simulations of many biological\nprocesses, such as plant development. Finding an L-system for a given process\nis typically solved by hand, by experts, in a hugely time-consuming process. It\nwould be significant if this could be done automatically from data, such as\nfrom sequences of images. In this paper, we are interested in inferring a\nparticular type of L-system, deterministic context-free L-system (D0L-system)\nfrom a sequence of strings. We introduce the characteristic graph of a sequence\nof strings, which we then utilize to translate our problem (inferring\nD0L-system) in polynomial time into the maximum independent set problem (MIS)\nand the SAT problem. After that, we offer a classical exact algorithm and an\napproximate quantum algorithm for the problem.", "paper_summary_zh": "L 系統可以模擬和建立許多生物過程，例如植物生長。找到特定過程的 L 系統通常是由專家手動解決，這個過程非常耗時。如果這項工作可以從資料中自動完成，例如從影像序列中，將會是一項重大突破。在本文中，我們有興趣從一連串字串推論出特定類型的 L 系統，即確定性無文法 L 系統 (D0L 系統)。我們引入了字串序列的特徵圖，然後利用它在多項式時間內將我們的問題 (推論 D0L 系統) 轉換為最大獨立集合問題 (MIS) 和 SAT 問題。之後，我們提供了一個經典的精確演算法和一個近似的量子演算法來解決這個問題。", "author": "Ali Lotfi et.al.", "authors": "Ali Lotfi, Ian McQuillan, Steven Rayan", "id": "2411.19906v1", "paper_url": "http://arxiv.org/abs/2411.19906v1", "repo": "null"}}