{"2501.08168": {"publish_time": "2025-01-14", "title": "LeapVAD: A Leap in Autonomous Driving via Cognitive Perception and Dual-Process Thinking", "paper_summary": "While autonomous driving technology has made remarkable strides, data-driven\napproaches still struggle with complex scenarios due to their limited reasoning\ncapabilities. Meanwhile, knowledge-driven autonomous driving systems have\nevolved considerably with the popularization of visual language models. In this\npaper, we propose LeapVAD, a novel method based on cognitive perception and\ndual-process thinking. Our approach implements a human-attentional mechanism to\nidentify and focus on critical traffic elements that influence driving\ndecisions. By characterizing these objects through comprehensive attributes -\nincluding appearance, motion patterns, and associated risks - LeapVAD achieves\nmore effective environmental representation and streamlines the decision-making\nprocess. Furthermore, LeapVAD incorporates an innovative dual-process\ndecision-making module miming the human-driving learning process. The system\nconsists of an Analytic Process (System-II) that accumulates driving experience\nthrough logical reasoning and a Heuristic Process (System-I) that refines this\nknowledge via fine-tuning and few-shot learning. LeapVAD also includes\nreflective mechanisms and a growing memory bank, enabling it to learn from past\nmistakes and continuously improve its performance in a closed-loop environment.\nTo enhance efficiency, we develop a scene encoder network that generates\ncompact scene representations for rapid retrieval of relevant driving\nexperiences. Extensive evaluations conducted on two leading autonomous driving\nsimulators, CARLA and DriveArena, demonstrate that LeapVAD achieves superior\nperformance compared to camera-only approaches despite limited training data.\nComprehensive ablation studies further emphasize its effectiveness in\ncontinuous learning and domain adaptation. Project page:\nhttps://pjlab-adg.github.io/LeapVAD/.", "paper_summary_zh": "<paragraph>儘管自動駕駛技術已取得顯著進展，但資料驅動方法仍因其推理能力有限而難以應對複雜場景。與此同時，隨著視覺語言模型的普及，知識驅動的自動駕駛系統已大幅演進。在本文中，我們提出 LeapVAD，一種基於認知感知和雙重過程思考的新方法。我們的做法實作了一種人類注意力機制，以識別並專注於影響駕駛決策的關鍵交通元素。透過全面屬性（包括外觀、運動模式和相關風險）來描述這些物件，LeapVAD 可達成更有效的環境表徵，並簡化決策制定過程。此外，LeapVAD 結合了一個創新的雙重過程決策制定模組，模仿人類駕駛學習過程。系統包含一個分析過程（系統 II），透過邏輯推理累積駕駛經驗，以及一個啟發式過程（系統 I），透過微調和少量學習來精進此知識。LeapVAD 也包含反思機制和一個不斷成長的記憶庫，使其能夠從過去的錯誤中學習，並在閉環環境中持續改善其效能。為了提高效率，我們開發了一個場景編碼器網路，可產生精簡的場景表徵，以快速擷取相關的駕駛經驗。在兩個領先的自動駕駛模擬器 CARLA 和 DriveArena 上進行的廣泛評估證明，儘管訓練資料有限，LeapVAD 仍能達成優於僅使用相機的方法的卓越效能。全面的消融研究進一步強調其在持續學習和領域適應中的有效性。專案頁面：\nhttps://pjlab-adg.github.io/LeapVAD/。</paragraph>", "author": "Yukai Ma et.al.", "authors": "Yukai Ma, Tiantian Wei, Naiting Zhong, Jianbiao Mei, Tao Hu, Licheng Wen, Xuemeng Yang, Botian Shi, Yong Liu", "id": "2501.08168v1", "paper_url": "http://arxiv.org/abs/2501.08168v1", "repo": "null"}}