{"2408.07854": {"publish_time": "2024-08-14", "title": "CON-FOLD -- Explainable Machine Learning with Confidence", "paper_summary": "FOLD-RM is an explainable machine learning classification algorithm that uses\ntraining data to create a set of classification rules. In this paper we\nintroduce CON-FOLD which extends FOLD-RM in several ways. CON-FOLD assigns\nprobability-based confidence scores to rules learned for a classification task.\nThis allows users to know how confident they should be in a prediction made by\nthe model. We present a confidence-based pruning algorithm that uses the unique\nstructure of FOLD-RM rules to efficiently prune rules and prevent overfitting.\nFurthermore, CON-FOLD enables the user to provide pre-existing knowledge in the\nform of logic program rules that are either (fixed) background knowledge or\n(modifiable) initial rule candidates. The paper describes our method in detail\nand reports on practical experiments. We demonstrate the performance of the\nalgorithm on benchmark datasets from the UCI Machine Learning Repository. For\nthat, we introduce a new metric, Inverse Brier Score, to evaluate the accuracy\nof the produced confidence scores. Finally we apply this extension to a real\nworld example that requires explainability: marking of student responses to a\nshort answer question from the Australian Physics Olympiad.", "paper_summary_zh": "FOLD-RM 是一種可解釋機器學習分類演算法，它利用訓練資料來建立一組分類規則。在本文中，我們介紹了 CON-FOLD，它在多方面擴展了 FOLD-RM。CON-FOLD 會將基於機率的信心評分指派給分類任務所學習的規則。這使用戶能夠知道他們對模型所做的預測有多大的信心。我們提出了一種基於信心的剪枝演算法，它利用 FOLD-RM 規則的獨特結構來有效地剪枝規則並防止過度擬合。此外，CON-FOLD 使用戶能夠以邏輯程式規則的形式提供預先存在的知識，這些規則可能是（固定的）背景知識或（可修改的）初始規則候選。本文詳細描述了我們的程式，並報告了實際實驗。我們在 UCI 機器學習儲存庫的基準資料集上展示了演算法的效能。為此，我們引入了一個新的指標，逆布里爾分數，來評估所產生的信心評分的準確性。最後，我們將此延伸應用於需要可解釋性的真實世界範例：評分澳洲物理奧林匹克競賽中學生對簡答題的回答。", "author": "Lachlan McGinness et.al.", "authors": "Lachlan McGinness, Peter Baumgartner", "id": "2408.07854v1", "paper_url": "http://arxiv.org/abs/2408.07854v1", "repo": "null"}}