{"2501.11599": {"publish_time": "2025-01-20", "title": "SR-FoT: A Syllogistic-Reasoning Framework of Thought for Large Language Models Tackling Knowledge-based Reasoning Tasks", "paper_summary": "Deductive reasoning is a crucial logical capability that assists us in\nsolving complex problems based on existing knowledge. Although augmented by\nChain-of-Thought prompts, Large Language Models (LLMs) might not follow the\ncorrect reasoning paths. Enhancing the deductive reasoning abilities of LLMs,\nand leveraging their extensive built-in knowledge for various reasoning tasks,\nremains an open question. Attempting to mimic the human deductive reasoning\nparadigm, we propose a multi-stage Syllogistic-Reasoning Framework of Thought\n(SR-FoT) that enables LLMs to perform syllogistic deductive reasoning to handle\ncomplex knowledge-based reasoning tasks. Our SR-FoT begins by interpreting the\nquestion and then uses the interpretation and the original question to propose\na suitable major premise. It proceeds by generating and answering minor premise\nquestions in two stages to match the minor premises. Finally, it guides LLMs to\nuse the previously generated major and minor premises to perform syllogistic\ndeductive reasoning to derive the answer to the original question. Extensive\nand thorough experiments on knowledge-based reasoning tasks have demonstrated\nthe effectiveness and advantages of our SR-FoT.", "paper_summary_zh": "演绎推理是一种至关重要的逻辑能力，它帮助我们在现有知识的基础上解决复杂的问题。虽然通过思想链提示增强了大语言模型 (LLM)，但它们可能无法遵循正确的推理路径。增强 LLM 的演绎推理能力，并利用其广泛的内置知识来执行各种推理任务，仍然是一个悬而未决的问题。为了模仿人类的演绎推理范式，我们提出了一种多阶段三段论推理思想框架 (SR-FoT)，它使 LLM 能够执行三段论演绎推理来处理基于复杂知识的推理任务。我们的 SR-FoT 从解释问题开始，然后使用解释和原始问题来提出合适的重大前提。它通过分两个阶段生成和回答次要前提问题来匹配次要前提。最后，它指导 LLM 使用先前生成的重大前提和次要前提来执行三段论演绎推理，以得出原始问题的答案。在基于知识的推理任务上进行的广泛而彻底的实验已经证明了我们 SR-FoT 的有效性和优势。", "author": "Wentao Wan et.al.", "authors": "Wentao Wan, Zhuojie Yang, Yongcan Chen, Chenglin Luo, Ruilin Wang, Kehao Cai, Nan Kang, Liang Lin, Keze Wang", "id": "2501.11599v1", "paper_url": "http://arxiv.org/abs/2501.11599v1", "repo": "null"}}