{"2407.13399": {"publish_time": "2024-07-18", "title": "Correcting the Mythos of KL-Regularization: Direct Alignment without Overparameterization via Chi-squared Preference Optimization", "paper_summary": "Language model alignment methods, such as reinforcement learning from human\nfeedback (RLHF), have led to impressive advances in language model\ncapabilities, but existing techniques are limited by a widely observed\nphenomenon known as overoptimization, where the quality of the language model\nplateaus or degrades over the course of the alignment process. Overoptimization\nis often attributed to overfitting to an inaccurate reward model, and while it\ncan be mitigated through online data collection, this is infeasible in many\nsettings. This raises a fundamental question: Do existing offline alignment\nalgorithms make the most of the data they have, or can their sample-efficiency\nbe improved further?\n  We address this question with a new algorithm for offline alignment,\n$\\chi^2$-Preference Optimization ($\\chi$PO). $\\chi$PO is a one-line change to\nDirect Preference Optimization (DPO; Rafailov et al., 2023), which only\ninvolves modifying the logarithmic link function in the DPO objective. Despite\nthis minimal change, $\\chi$PO implicitly implements the principle of pessimism\nin the face of uncertainty via regularization with the $\\chi^2$-divergence --\nwhich quantifies uncertainty more effectively than KL-regularization -- and\nprovably alleviates overoptimization, achieving sample-complexity guarantees\nbased on single-policy concentrability -- the gold standard in offline\nreinforcement learning. $\\chi$PO's simplicity and strong guarantees make it the\nfirst practical and general-purpose offline alignment algorithm that is\nprovably robust to overoptimization.", "paper_summary_zh": "語言模型對齊方法，例如人類回饋強化學習 (RLHF)，已導致語言模型能力的顯著進步，但現有技術受到廣泛觀察到的現象限制，稱為過度最佳化，其中語言模型的品質在對齊過程中達到平穩期或下降。過度最佳化通常歸因於過度擬合不準確的獎勵模型，雖然它可以透過線上資料收集來減輕，但在許多設定中這是不可行的。這引發了一個基本問題：現有的離線對齊演算法是否充分利用了他們擁有的資料，或者他們的樣本效率可以進一步提高？\n我們使用一種新的離線對齊演算法來解決這個問題，即 $\\chi^2$ 偏好最佳化（$\\chi$PO）。$\\chi$PO 是對直接偏好最佳化（DPO；Rafailov 等人，2023 年）的一行變更，它只涉及修改 DPO 目標中的對數連結函數。儘管有這個最小的變更，$\\chi$PO 透過使用 $\\chi^2$ 距離進行正則化，在面對不確定性時隱含地實作了悲觀原則，而 $\\chi^2$ 距離比 KL 正則化更有效地量化了不確定性，並且可以證明地減輕過度最佳化，根據單一政策集中度實現樣本複雜度保證，這是離線強化學習中的黃金標準。$\\chi$PO 的簡潔性和強有力的保證使其成為第一個實用的通用離線對齊演算法，它可以證明對過度最佳化具有魯棒性。", "author": "Audrey Huang et.al.", "authors": "Audrey Huang, Wenhao Zhan, Tengyang Xie, Jason D. Lee, Wen Sun, Akshay Krishnamurthy, Dylan J. Foster", "id": "2407.13399v1", "paper_url": "http://arxiv.org/abs/2407.13399v1", "repo": "null"}}