{"2406.07961": {"publish_time": "2024-06-12", "title": "Accurate Explanation Model for Image Classifiers using Class Association Embedding", "paper_summary": "Image classification is a primary task in data analysis where explainable\nmodels are crucially demanded in various applications. Although amounts of\nmethods have been proposed to obtain explainable knowledge from the black-box\nclassifiers, these approaches lack the efficiency of extracting global\nknowledge regarding the classification task, thus is vulnerable to local traps\nand often leads to poor accuracy. In this study, we propose a generative\nexplanation model that combines the advantages of global and local knowledge\nfor explaining image classifiers. We develop a representation learning method\ncalled class association embedding (CAE), which encodes each sample into a pair\nof separated class-associated and individual codes. Recombining the individual\ncode of a given sample with altered class-associated code leads to a synthetic\nreal-looking sample with preserved individual characters but modified\nclass-associated features and possibly flipped class assignments. A\nbuilding-block coherency feature extraction algorithm is proposed that\nefficiently separates class-associated features from individual ones. The\nextracted feature space forms a low-dimensional manifold that visualizes the\nclassification decision patterns. Explanation on each individual sample can be\nthen achieved in a counter-factual generation manner which continuously\nmodifies the sample in one direction, by shifting its class-associated code\nalong a guided path, until its classification outcome is changed. We compare\nour method with state-of-the-art ones on explaining image classification tasks\nin the form of saliency maps, demonstrating that our method achieves higher\naccuracies. The code is available at https://github.com/xrt11/XAI-CODE.", "paper_summary_zh": "影像分類是資料分析中一項主要任務，其中可解釋模型在各種應用中至關重要。儘管已提出大量方法從黑盒分類器中取得可解釋知識，但這些方法缺乏提取分類任務中整體知識的效率，因此容易陷入局部陷阱，且經常導致精確度不佳。在本研究中，我們提出一個生成式解釋模型，結合整體和局部知識的優點來解釋影像分類器。我們開發一種稱為類別關聯嵌入 (CAE) 的表示學習方法，將每個範例編碼成一對分離的類別關聯和個別代碼。將特定範例的個別代碼與變更的類別關聯代碼重新組合，會產生一個保留個別特徵但修改類別關聯特徵，且可能翻轉類別指派的合成真實範例。我們提出一個建構區塊相干性特徵提取演算法，可有效將類別關聯特徵與個別特徵分開。提取的特徵空間形成一個低維流形，可視化分類決策模式。然後，每個個別範例的解釋可以在反事實生成方式中達成，該方式透過沿著引導路徑移動其類別關聯代碼，持續地朝一個方向修改範例，直到其分類結果改變。我們以顯著度圖的形式將我們的模型與現有技術進行比較，以解釋影像分類任務，證明我們的模型可達成更高的精確度。程式碼可在 https://github.com/xrt11/XAI-CODE 取得。", "author": "Ruitao Xie et.al.", "authors": "Ruitao Xie, Jingbang Chen, Limai Jiang, Rui Xiao, Yi Pan, Yunpeng Cai", "id": "2406.07961v1", "paper_url": "http://arxiv.org/abs/2406.07961v1", "repo": "https://github.com/xrt11/xai-code"}}