{"2411.09266": {"publish_time": "2024-11-14", "title": "How Good is ChatGPT at Audiovisual Deepfake Detection: A Comparative Study of ChatGPT, AI Models and Human Perception", "paper_summary": "Multimodal deepfakes involving audiovisual manipulations are a growing threat\nbecause they are difficult to detect with the naked eye or using unimodal deep\nlearningbased forgery detection methods. Audiovisual forensic models, while\nmore capable than unimodal models, require large training datasets and are\ncomputationally expensive for training and inference. Furthermore, these models\nlack interpretability and often do not generalize well to unseen manipulations.\nIn this study, we examine the detection capabilities of a large language model\n(LLM) (i.e., ChatGPT) to identify and account for any possible visual and\nauditory artifacts and manipulations in audiovisual deepfake content. Extensive\nexperiments are conducted on videos from a benchmark multimodal deepfake\ndataset to evaluate the detection performance of ChatGPT and compare it with\nthe detection capabilities of state-of-the-art multimodal forensic models and\nhumans. Experimental results demonstrate the importance of domain knowledge and\nprompt engineering for video forgery detection tasks using LLMs. Unlike\napproaches based on end-to-end learning, ChatGPT can account for spatial and\nspatiotemporal artifacts and inconsistencies that may exist within or across\nmodalities. Additionally, we discuss the limitations of ChatGPT for multimedia\nforensic tasks.", "paper_summary_zh": "多模態深度偽造涉及視聽操縱，是一個日益嚴重的威脅，因為用肉眼或使用單模態深度學習偽造偵測方法很難偵測到。視聽鑑識模型雖然比單模態模型功能更強大，但需要大量的訓練資料集，而且訓練和推論的計算成本很高。此外，這些模型缺乏可解釋性，而且通常無法很好地概括到未見過的操縱。在本研究中，我們檢驗大型語言模型 (LLM)（即 ChatGPT）的偵測能力，以識別和說明視聽深度偽造內容中的任何可能的視覺和聽覺人工製品和操縱。在一個基準多模態深度偽造資料集的影片上進行廣泛的實驗，以評估 ChatGPT 的偵測效能，並將其與最先進的多模態鑑識模型和人類的偵測能力進行比較。實驗結果證明了領域知識和提示工程對於使用 LLM 進行影片偽造偵測任務的重要性。與基於端到端學習的方法不同，ChatGPT 可以說明可能存在於模態內或跨模態的空間和時空人工製品和不一致性。此外，我們討論了 ChatGPT 在多媒體鑑識任務中的限制。", "author": "Sahibzada Adil Shahzad et.al.", "authors": "Sahibzada Adil Shahzad, Ammarah Hashmi, Yan-Tsung Peng, Yu Tsao, Hsin-Min Wang", "id": "2411.09266v1", "paper_url": "http://arxiv.org/abs/2411.09266v1", "repo": "null"}}