{"2412.05112": {"publish_time": "2024-12-06", "title": "Modeling Task Immersion based on Goal Activation Mechanism", "paper_summary": "Immersion in a task is a prerequisite for creativity. However, excessive\narousal in a single task has drawbacks, such as overlooking events outside of\nthe task. To examine such a negative aspect, this study constructs a\ncomputational model of arousal dynamics where the excessively increased arousal\nmakes the task transition difficult. The model was developed using functions\nintegrated into the cognitive architecture Adaptive Control of Thought-Rational\n(ACT-R). Under the framework, arousal is treated as a coefficient affecting the\noverall activation level in the model. In our simulations, we set up two\nconditions demanding low and high arousal, trying to replicate corresponding\nhuman experiments. In each simulation condition, two sets of ACT-R parameters\nwere assumed from the different interpretations of the human experimental\nsettings. The results showed consistency of behavior between humans and models\nboth in the two different simulation settings. This result suggests the\nvalidity of our assumptions and has implications of controlling arousal in our\ndaily life.", "paper_summary_zh": "沉浸在任務中是創造力的先決條件。然而，過度激發在單一任務中具有缺點，例如忽視任務之外的事件。為了檢驗這種負面方面，本研究構建了一個激發動態的計算模型，其中過度增加的激發使得任務轉換變得困難。該模型是使用整合到認知架構適應性思想控制理性 (ACT-R) 中的功能開發的。在該框架下，激發被視為影響模型中整體激活級數的係數。在我們的模擬中，我們設定了兩個需要低激發和高激發的條件，試圖複製相應的人體實驗。在每個模擬條件中，根據對人體實驗設置的不同解釋，假設了兩組 ACT-R 參數。結果表明，在兩種不同的模擬設置中，人類和模型之間的行為一致。這一結果表明了我們的假設的有效性，並對我們日常生活中的激發控制產生了影響。", "author": "Kazuma Nagashima et.al.", "authors": "Kazuma Nagashima, Jumpei Nishikawa, Junya Morita", "id": "2412.05112v1", "paper_url": "http://arxiv.org/abs/2412.05112v1", "repo": "null"}}