{"2408.13985": {"publish_time": "2024-08-26", "title": "TF-Attack: Transferable and Fast Adversarial Attacks on Large Language Models", "paper_summary": "With the great advancements in large language models (LLMs), adversarial\nattacks against LLMs have recently attracted increasing attention. We found\nthat pre-existing adversarial attack methodologies exhibit limited\ntransferability and are notably inefficient, particularly when applied to LLMs.\nIn this paper, we analyze the core mechanisms of previous predominant\nadversarial attack methods, revealing that 1) the distributions of importance\nscore differ markedly among victim models, restricting the transferability; 2)\nthe sequential attack processes induces substantial time overheads. Based on\nthe above two insights, we introduce a new scheme, named TF-Attack, for\nTransferable and Fast adversarial attacks on LLMs. TF-Attack employs an\nexternal LLM as a third-party overseer rather than the victim model to identify\ncritical units within sentences. Moreover, TF-Attack introduces the concept of\nImportance Level, which allows for parallel substitutions of attacks. We\nconduct extensive experiments on 6 widely adopted benchmarks, evaluating the\nproposed method through both automatic and human metrics. Results show that our\nmethod consistently surpasses previous methods in transferability and delivers\nsignificant speed improvements, up to 20 times faster than earlier attack\nstrategies.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的重大進展，對 LLM 的對抗攻擊最近引起了越來越多的關注。我們發現，預先存在的對抗攻擊方法展示了有限的可轉移性，而且效率顯著低下，特別是應用於 LLM 時。在本文中，我們分析了先前主要對抗攻擊方法的核心機制，揭示了 1) 重要性分數的分布在受害者模型之間顯著不同，限制了可轉移性；2) 順序攻擊過程會造成大量的時間開銷。基於以上兩個見解，我們引入了一個名為 TF-Attack 的新方案，用於對 LLM 進行可轉移且快速的對抗攻擊。TF-Attack 使用外部 LLM 作為第三方監督者，而不是受害者模型，來識別句子中的關鍵單元。此外，TF-Attack 引入了重要性等級的概念，允許對攻擊進行並行替換。我們對 6 個廣泛採用的基準進行了大量的實驗，通過自動和人工指標評估了所提出的方法。結果表明，我們的方法在可轉移性方面始終優於以前的方法，並且提供了顯著的速度改進，比早期的攻擊策略快 20 倍。", "author": "Zelin Li et.al.", "authors": "Zelin Li, Kehai Chen, Xuefeng Bai, Lemao Liu, Mingming Yang, Yang Xiang, Min Zhang", "id": "2408.13985v1", "paper_url": "http://arxiv.org/abs/2408.13985v1", "repo": "null"}}