{"2408.10951": {"publish_time": "2024-08-20", "title": "Wave-Mask/Mix: Exploring Wavelet-Based Augmentations for Time Series Forecasting", "paper_summary": "Data augmentation is important for improving machine learning model\nperformance when faced with limited real-world data. In time series forecasting\n(TSF), where accurate predictions are crucial in fields like finance,\nhealthcare, and manufacturing, traditional augmentation methods for\nclassification tasks are insufficient to maintain temporal coherence. This\nresearch introduces two augmentation approaches using the discrete wavelet\ntransform (DWT) to adjust frequency elements while preserving temporal\ndependencies in time series data. Our methods, Wavelet Masking (WaveMask) and\nWavelet Mixing (WaveMix), are evaluated against established baselines across\nvarious forecasting horizons. To the best of our knowledge, this is the first\nstudy to conduct extensive experiments on multivariate time series using\nDiscrete Wavelet Transform as an augmentation technique. Experimental results\ndemonstrate that our techniques achieve competitive results with previous\nmethods. We also explore cold-start forecasting using downsampled training\ndatasets, comparing outcomes to baseline methods.", "paper_summary_zh": "資料擴充對於在面對受限的真實世界資料時改善機器學習模型效能非常重要。在時間序列預測 (TSF) 中，精準的預測在金融、醫療保健和製造等領域至關重要，傳統的擴充方法對於分類任務來說不足以維持時間相干性。本研究引入了兩種擴充方法，利用離散小波轉換 (DWT) 來調整頻率元素，同時保留時間序列資料中的時間依賴性。我們的 Wavelet Masking (WaveMask) 和 Wavelet Mixing (WaveMix) 方法針對各種預測範圍與既定的基準進行評估。據我們所知，這是第一個使用離散小波轉換作為擴充技術對多變量時間序列進行廣泛實驗的研究。實驗結果證明我們的技術可與先前的技術競爭。我們也使用降採樣訓練資料集探索冷啟動預測，並將結果與基準方法進行比較。", "author": "Dona Arabi et.al.", "authors": "Dona Arabi, Jafar Bakhshaliyev, Ayse Coskuner, Kiran Madhusudhanan, Kami Serdar Uckardes", "id": "2408.10951v1", "paper_url": "http://arxiv.org/abs/2408.10951v1", "repo": "https://github.com/jafarbakhshaliyev/wave-augs"}}