{"2409.11340": {"publish_time": "2024-09-17", "title": "OmniGen: Unified Image Generation", "paper_summary": "In this work, we introduce OmniGen, a new diffusion model for unified image\ngeneration. Unlike popular diffusion models (e.g., Stable Diffusion), OmniGen\nno longer requires additional modules such as ControlNet or IP-Adapter to\nprocess diverse control conditions. OmniGenis characterized by the following\nfeatures: 1) Unification: OmniGen not only demonstrates text-to-image\ngeneration capabilities but also inherently supports other downstream tasks,\nsuch as image editing, subject-driven generation, and visual-conditional\ngeneration. Additionally, OmniGen can handle classical computer vision tasks by\ntransforming them into image generation tasks, such as edge detection and human\npose recognition. 2) Simplicity: The architecture of OmniGen is highly\nsimplified, eliminating the need for additional text encoders. Moreover, it is\nmore user-friendly compared to existing diffusion models, enabling complex\ntasks to be accomplished through instructions without the need for extra\npreprocessing steps (e.g., human pose estimation), thereby significantly\nsimplifying the workflow of image generation. 3) Knowledge Transfer: Through\nlearning in a unified format, OmniGen effectively transfers knowledge across\ndifferent tasks, manages unseen tasks and domains, and exhibits novel\ncapabilities. We also explore the model's reasoning capabilities and potential\napplications of chain-of-thought mechanism. This work represents the first\nattempt at a general-purpose image generation model, and there remain several\nunresolved issues. We will open-source the related resources at\nhttps://github.com/VectorSpaceLab/OmniGen to foster advancements in this field.", "paper_summary_zh": "<paragraph>在這項工作中，我們介紹 OmniGen，一種用於統一影像生成的全新擴散模型。與流行的擴散模型（例如 Stable Diffusion）不同，OmniGen 不再需要 ControlNet 或 IP-Adapter 等額外模組來處理不同的控制條件。OmniGen 的特徵如下：1) 統一性：OmniGen 不僅展示了文字轉影像的生成能力，而且本質上也支援其他下游任務，例如影像編輯、主體驅動生成和視覺條件生成。此外，OmniGen 可以透過將它們轉換為影像生成任務來處理經典的電腦視覺任務，例如邊緣偵測和人類姿勢辨識。2) 簡潔性：OmniGen 的架構經過高度簡化，無需額外的文字編碼器。此外，與現有的擴散模型相比，它更使用者友善，能夠透過指令完成複雜的任務，無需額外的預處理步驟（例如人體姿勢估計），從而大幅簡化影像生成的流程。3) 知識轉移：透過以統一的格式學習，OmniGen 有效地將知識轉移到不同的任務中，管理未見的任務和領域，並展現新穎的能力。我們也探討了模型的推理能力和思考鏈機制的潛在應用。這項工作代表了通用影像生成模型的首次嘗試，仍有許多未解決的問題。我們將在 https://github.com/VectorSpaceLab/OmniGen 開放相關資源，以促進此領域的進展。</paragraph>", "author": "Shitao Xiao et.al.", "authors": "Shitao Xiao, Yueze Wang, Junjie Zhou, Huaying Yuan, Xingrun Xing, Ruiran Yan, Shuting Wang, Tiejun Huang, Zheng Liu", "id": "2409.11340v1", "paper_url": "http://arxiv.org/abs/2409.11340v1", "repo": "https://github.com/vectorspacelab/omnigen"}}