{"2411.05172": {"publish_time": "2024-11-07", "title": "ImpScore: A Learnable Metric For Quantifying The Implicitness Level of Language", "paper_summary": "Handling implicit language is essential for natural language processing\nsystems to achieve precise text understanding and facilitate natural\ninteractions with users. Despite its importance, the absence of a robust metric\nfor accurately measuring the implicitness of language significantly constrains\nthe depth of analysis possible in evaluating models' comprehension\ncapabilities. This paper addresses this gap by developing a scalar metric that\nquantifies the implicitness level of language without relying on external\nreferences. Drawing on principles from traditional linguistics, we define\n''implicitness'' as the divergence between semantic meaning and pragmatic\ninterpretation. To operationalize this definition, we introduce ImpScore, a\nnovel, reference-free metric formulated through an interpretable regression\nmodel. This model is trained using pairwise contrastive learning on a specially\ncurated dataset comprising $112,580$ (implicit sentence, explicit sentence)\npairs. We validate ImpScore through a user study that compares its assessments\nwith human evaluations on out-of-distribution data, demonstrating its accuracy\nand strong correlation with human judgments. Additionally, we apply ImpScore to\nhate speech detection datasets, illustrating its utility and highlighting\nsignificant limitations in current large language models' ability to understand\nhighly implicit content. The metric model and its training data are available\nat https://github.com/audreycs/ImpScore.", "paper_summary_zh": "處理隱含語言對於自然語言處理系統至關重要，以達成精確的文字理解並促進與使用者的自然互動。儘管其重要性，但缺乏用於精確衡量語言隱含性的強健指標，顯著地限制了在評估模型理解能力時可能進行的分析深度。本文透過開發一個標量指標來解決此差距，該指標量化語言的隱含性層級，而不依賴外部參考。根據傳統語言學的原則，我們將「隱含性」定義為語義意義與語用解釋之間的差異。為了將此定義付諸實行，我們引入了 ImpScore，一種透過可解釋迴歸模型制定出的新穎、無參考指標。此模型使用成對對比學習在一個特別策劃的資料集上進行訓練，該資料集包含 $112,580$ 個（隱含句子、明確句子）對。我們透過一項使用者研究驗證 ImpScore，該研究比較了其評估與人類對非分佈資料的評估，證明了其準確性與與人類判斷的高度相關性。此外，我們將 ImpScore 應用於仇恨言論偵測資料集，說明其效用並強調當前大型語言模型在理解高度隱含內容方面的顯著限制。指標模型及其訓練資料可在 https://github.com/audreycs/ImpScore 取得。", "author": "Yuxin Wang et.al.", "authors": "Yuxin Wang, Xiaomeng Zhu, Weimin Lyu, Saeed Hassanpour, Soroush Vosoughi", "id": "2411.05172v1", "paper_url": "http://arxiv.org/abs/2411.05172v1", "repo": "https://github.com/audreycs/impscore"}}