{"2504.19811": {"publish_time": "2025-04-28", "title": "Can a Crow Hatch a Falcon? Lineage Matters in Predicting Large Language Model Performance", "paper_summary": "Accurately forecasting the performance of Large Language Models (LLMs) before\nextensive fine-tuning or merging can substantially reduce both computational\nexpense and development time. Although prior approaches like scaling laws\naccount for global factors such as parameter size or training tokens, they\noften overlook explicit lineage relationships - i.e., which models are derived\nor merged from which parents. In this work, we propose a novel\nLineage-Regularized Matrix Factorization (LRMF) framework that encodes\nancestral ties among LLMs via a graph Laplacian regularizer. By leveraging\nmulti-hop parent-child connections, LRMF consistently outperforms conventional\nmatrix factorization and collaborative filtering methods in both instance-level\nand benchmark-level performance prediction. Our large-scale study includes\n2,934 publicly available Hugging Face models and 21,000+ instances across 6\nmajor benchmarks, showing that lineage constraints yield up to 7-10 percentage\npoints higher correlation with actual performance compared to baselines.\nMoreover, LRMF effectively addresses the cold-start problem, providing accurate\nestimates for newly derived or merged models even with minimal data. This\nlineage-guided strategy thus offers a resource-efficient way to inform\nhyperparameter tuning, data selection, and model combination in modern LLM\ndevelopment.", "paper_summary_zh": "<paragraph>在進行大量的微調或合併之前，準確預測大型語言模型 (LLM) 的效能可以大幅降低計算成本和開發時間。雖然先前的研究方法（如縮放定律）考慮了參數大小或訓練token等全域因素，但它們往往忽略了明確的譜系關係——亦即哪些模型是從哪些父模型衍生或合併而來的。在這項工作中，我們提出了一個新的譜系正則化矩陣分解 (LRMF) 架構，它透過圖拉普拉斯正則化器對 LLM 之間的祖先關係進行編碼。藉由利用多跳父子連接，LRMF 在實例級和基準級的效能預測方面始終優於傳統的矩陣分解和協同過濾方法。我們的大規模研究包括 2,934 個公開可用的 Hugging Face 模型和跨 6 個主要基準的 21,000 多個實例，表明與實際效能相比，譜系約束的相關性比基準高出 7-10 個百分點。此外，LRMF 有效地解決了冷啟動問題，即使數據極少，也能為新衍生或合併的模型提供準確的估計。因此，這種譜系引導策略提供了一種資源有效的方法，可在現代 LLM 開發中為超參數調整、數據選擇和模型組合提供參考依據。</paragraph>\n", "author": "Takuya Tamura et.al.", "authors": "Takuya Tamura, Taro Yano, Masafumi Enomoto, Masafumi Oyamada", "id": "2504.19811v1", "paper_url": "http://arxiv.org/abs/2504.19811v1", "repo": "null"}}