{"2409.20427": {"publish_time": "2024-09-30", "title": "Sufficient and Necessary Explanations (and What Lies in Between)", "paper_summary": "As complex machine learning models continue to find applications in\nhigh-stakes decision-making scenarios, it is crucial that we can explain and\nunderstand their predictions. Post-hoc explanation methods provide useful\ninsights by identifying important features in an input $\\mathbf{x}$ with\nrespect to the model output $f(\\mathbf{x})$. In this work, we formalize and\nstudy two precise notions of feature importance for general machine learning\nmodels: sufficiency and necessity. We demonstrate how these two types of\nexplanations, albeit intuitive and simple, can fall short in providing a\ncomplete picture of which features a model finds important. To this end, we\npropose a unified notion of importance that circumvents these limitations by\nexploring a continuum along a necessity-sufficiency axis. Our unified notion,\nwe show, has strong ties to other popular definitions of feature importance,\nlike those based on conditional independence and game-theoretic quantities like\nShapley values. Crucially, we demonstrate how a unified perspective allows us\nto detect important features that could be missed by either of the previous\napproaches alone.", "paper_summary_zh": "隨著複雜機器學習模型持續在高風險決策情境中找到應用，我們能夠解釋並了解其預測至關重要。事後解釋方法透過辨識輸入 $\\mathbf{x}$ 中相對於模型輸出 $f(\\mathbf{x})$ 的重要特徵，提供了有用的見解。在這項工作中，我們形式化並研究了兩種精確的機器學習模型特徵重要性概念：充分性和必要性。我們展示了這兩種類型的解釋，儘管直觀且簡單，但在提供模型認為重要的特徵的完整圖像方面可能會有所不足。為此，我們提出了統一的重要性概念，透過探索必要性-充分性軸上的連續統整體來規避這些限制。我們展示了統一概念與其他流行的特徵重要性定義有密切關聯，例如基於條件獨立性和博弈論量（如 Shapley 值）的定義。至關重要的是，我們展示了統一的觀點如何讓我們能夠偵測到以前任何一種方法都可能錯失的重要特徵。", "author": "Beepul Bharti et.al.", "authors": "Beepul Bharti, Paul Yi, Jeremias Sulam", "id": "2409.20427v1", "paper_url": "http://arxiv.org/abs/2409.20427v1", "repo": "null"}}