{"2410.08820": {"publish_time": "2024-10-11", "title": "Which Demographics do LLMs Default to During Annotation?", "paper_summary": "Demographics and cultural background of annotators influence the labels they\nassign in text annotation -- for instance, an elderly woman might find it\noffensive to read a message addressed to a \"bro\", but a male teenager might\nfind it appropriate. It is therefore important to acknowledge label variations\nto not under-represent members of a society. Two research directions developed\nout of this observation in the context of using large language models (LLM) for\ndata annotations, namely (1) studying biases and inherent knowledge of LLMs and\n(2) injecting diversity in the output by manipulating the prompt with\ndemographic information. We combine these two strands of research and ask the\nquestion to which demographics an LLM resorts to when no demographics is given.\nTo answer this question, we evaluate which attributes of human annotators LLMs\ninherently mimic. Furthermore, we compare non-demographic conditioned prompts\nand placebo-conditioned prompts (e.g., \"you are an annotator who lives in house\nnumber 5\") to demographics-conditioned prompts (\"You are a 45 year old man and\nan expert on politeness annotation. How do you rate {instance}\"). We study\nthese questions for politeness and offensiveness annotations on the POPQUORN\ndata set, a corpus created in a controlled manner to investigate human label\nvariations based on demographics which has not been used for LLM-based analyses\nso far. We observe notable influences related to gender, race, and age in\ndemographic prompting, which contrasts with previous studies that found no such\neffects.", "paper_summary_zh": "標記員的人口統計和文化背景會影響他們在文字標記中指定的標籤——例如，一位年長女性可能會覺得收到一則標題為「兄弟」的訊息很冒犯，但一位男性青少年可能會覺得很合適。因此，承認標籤的差異性很重要，以避免低估社會成員。在使用大型語言模型 (LLM) 進行資料標記的脈絡中，從此觀察中發展出兩個研究方向，即 (1) 研究 LLM 的偏見和內在知識，以及 (2) 透過使用人口統計資訊操縱提示來注入輸出中的多樣性。我們結合這兩個研究方向，並提出一個問題，當沒有提供人口統計資訊時，LLM 會訴諸哪些人口統計資訊。為了回答這個問題，我們評估 LLM 內在模仿哪些人類標記員的屬性。此外，我們比較非人口統計條件提示和安慰劑條件提示（例如，「你是一位住在 5 號屋的標記員」）與人口統計條件提示（「你是一位 45 歲的男性，也是禮貌標記方面的專家。你如何評分 {實例}」）。我們針對 POPQUORN 資料集上的禮貌和冒犯性標記研究這些問題，這個語料庫是以受控方式建立的，目的是調查基於人口統計資料的人類標籤差異，而這尚未用於基於 LLM 的分析。我們觀察到與先前發現沒有此類影響的研究形成對比，在人口統計提示中與性別、種族和年齡相關的顯著影響。", "author": "Christopher Bagdon et.al.", "authors": "Christopher Bagdon, Aidan Combs, Lynn Greschner, Roman Klinger, Jiahui Li, Sean Papay, Nadine Probol, Yarik Menchaca Resendiz, Johannes Schäfer, Aswathy Velutharambath, Sabine Weber, Amelie Wührl", "id": "2410.08820v1", "paper_url": "http://arxiv.org/abs/2410.08820v1", "repo": "null"}}