{"2408.11727": {"publish_time": "2024-08-21", "title": "Efficient Detection of Toxic Prompts in Large Language Models", "paper_summary": "Large language models (LLMs) like ChatGPT and Gemini have significantly\nadvanced natural language processing, enabling various applications such as\nchatbots and automated content generation. However, these models can be\nexploited by malicious individuals who craft toxic prompts to elicit harmful or\nunethical responses. These individuals often employ jailbreaking techniques to\nbypass safety mechanisms, highlighting the need for robust toxic prompt\ndetection methods. Existing detection techniques, both blackbox and whitebox,\nface challenges related to the diversity of toxic prompts, scalability, and\ncomputational efficiency. In response, we propose ToxicDetector, a lightweight\ngreybox method designed to efficiently detect toxic prompts in LLMs.\nToxicDetector leverages LLMs to create toxic concept prompts, uses embedding\nvectors to form feature vectors, and employs a Multi-Layer Perceptron (MLP)\nclassifier for prompt classification. Our evaluation on various versions of the\nLLama models, Gemma-2, and multiple datasets demonstrates that ToxicDetector\nachieves a high accuracy of 96.39\\% and a low false positive rate of 2.00\\%,\noutperforming state-of-the-art methods. Additionally, ToxicDetector's\nprocessing time of 0.0780 seconds per prompt makes it highly suitable for\nreal-time applications. ToxicDetector achieves high accuracy, efficiency, and\nscalability, making it a practical method for toxic prompt detection in LLMs.", "paper_summary_zh": "大型語言模型 (LLM)，例如 ChatGPT 和 Gemini，已大幅提升自然語言處理，支援各種應用程式，例如聊天機器人和自動產生內容。然而，惡意人士可能會利用這些模型，建立有毒提示，引發有害或不道德的回應。這些人士通常會採用越獄技術，繞過安全機制，突顯了對強大的有毒提示偵測方法的需求。現有的偵測技術，包括黑盒和白盒，都面臨與有毒提示的多樣性、可擴充性和運算效率相關的挑戰。為了解決這個問題，我們提出 ToxicDetector，一種輕量級灰盒方法，旨在有效率地偵測 LLM 中的有毒提示。ToxicDetector 藉由 LLM 建立有毒概念提示，使用嵌入向量形成特徵向量，並採用多層感知器 (MLP) 分類器進行提示分類。我們對 LLama 模型、Gemma-2 和多個資料集的各種版本進行評估，結果顯示 ToxicDetector 達到 96.39% 的高準確度和 2.00% 的低偽陽性率，優於現有的方法。此外，ToxicDetector 每個提示 0.0780 秒的處理時間，使其非常適合於即時應用程式。ToxicDetector 達到高準確度、效率和可擴充性，使其成為 LLM 中有毒提示偵測的實用方法。", "author": "Yi Liu et.al.", "authors": "Yi Liu, Junzhe Yu, Huijia Sun, Ling Shi, Gelei Deng, Yuqi Chen, Yang Liu", "id": "2408.11727v1", "paper_url": "http://arxiv.org/abs/2408.11727v1", "repo": "null"}}