{"2406.04955": {"publish_time": "2024-06-07", "title": "Experimental Evaluation of ROS-Causal in Real-World Human-Robot Spatial Interaction Scenarios", "paper_summary": "Deploying robots in human-shared environments requires a deep understanding\nof how nearby agents and objects interact. Employing causal inference to model\ncause-and-effect relationships facilitates the prediction of human behaviours\nand enables the anticipation of robot interventions. However, a significant\nchallenge arises due to the absence of implementation of existing causal\ndiscovery methods within the ROS ecosystem, the standard de-facto framework in\nrobotics, hindering effective utilisation on real robots. To bridge this gap,\nin our previous work we proposed ROS-Causal, a ROS-based framework designed for\nonboard data collection and causal discovery in human-robot spatial\ninteractions. In this work, we present an experimental evaluation of ROS-Causal\nboth in simulation and on a new dataset of human-robot spatial interactions in\na lab scenario, to assess its performance and effectiveness. Our analysis\ndemonstrates the efficacy of this approach, showcasing how causal models can be\nextracted directly onboard by robots during data collection. The online causal\nmodels generated from the simulation are consistent with those from lab\nexperiments. These findings can help researchers to enhance the performance of\nrobotic systems in shared environments, firstly by studying the causal\nrelations between variables in simulation without real people, and then\nfacilitating the actual robot deployment in real human environments.\nROS-Causal: https://lcastri.github.io/roscausal", "paper_summary_zh": "在人類共享的環境中部署機器人需要深入了解附近的代理和物體如何相互作用。利用因果推論來建模因果關係有助於預測人類行為，並能預期機器人的干預。然而，由於在機器人標準的實際框架 ROS 生態系統中缺乏現有因果發現方法的實施，因此出現了一個重大的挑戰，這阻礙了在真實機器人上的有效利用。為了彌補這一差距，我們在之前的工作中提出了 ROS-Causal，一個基於 ROS 的框架，專門用於機載數據收集和人類機器人空間交互中的因果發現。在這項工作中，我們在模擬和一個新的實驗室場景中的人類機器人空間交互數據集中對 ROS-Causal 進行了實驗評估，以評估其性能和有效性。我們的分析證明了這種方法的有效性，展示了機器人在數據收集期間如何直接在機載中提取因果模型。從模擬中生成的線上因果模型與實驗室實驗中的因果模型一致。這些發現可以幫助研究人員提高機器人在共享環境中的系統性能，首先通過在沒有真人參與的情況下研究模擬中的變量之間的因果關係，然後促進實際機器人在真實人類環境中的部署。ROS-Causal：https://lcastri.github.io/roscausal", "author": "Luca Castri et.al.", "authors": "Luca Castri, Gloria Beraldo, Sariah Mghames, Marc Hanheide, Nicola Bellotto", "id": "2406.04955v1", "paper_url": "http://arxiv.org/abs/2406.04955v1", "repo": "null"}}