{"2410.17820": {"publish_time": "2024-10-23", "title": "Understanding When Tree of Thoughts Succeeds: Larger Models Excel in Generation, Not Discrimination", "paper_summary": "Tree of Thoughts (ToT) is a reasoning strategy for Large Language Models\n(LLMs) that employs a generator to suggest reasoning steps and a discriminator\nto decide which steps to implement. ToT demonstrates strong performance on\nreasoning tasks, often surpassing simple methods such as Input-Output (IO)\nprompting and Chain-of-Thought (CoT) reasoning. However, ToT does not\nconsistently outperform such simpler methods across all models, leaving large\nknowledge gaps on the conditions under which ToT is most beneficial. In this\npaper, we analyze the roles of the generator and discriminator separately to\nbetter understand the conditions when ToT is beneficial. We find that the\ngenerator plays a more critical role than the discriminator in driving the\nsuccess of ToT. While using even a smaller model as the discriminator, scaling\nthe generator leads to notable improvements in ToT performance, whereas scaling\nthe discriminator with a fixed generator yields only marginal gains. Our\nresults show that models across different scales exhibit comparable\ndiscrimination capabilities, yet differ significantly in their generative\nperformance for ToT.", "paper_summary_zh": "思考之樹（ToT）是一種大型語言模型（LLM）的推理策略，它使用生成器來建議推理步驟，並使用判別器來決定要實施哪些步驟。ToT 在推理任務中表現出色，通常超越了輸入輸出（IO）提示和思考鏈（CoT）推理等簡單方法。然而，ToT 並未在所有模型中始終優於這些更簡單的方法，這使得在 ToT 最有益的條件下留下了巨大的知識空白。在本文中，我們分別分析了生成器和判別器的角色，以更好地了解 ToT 有益的條件。我們發現生成器在推動 ToT 的成功方面發揮了比判別器更關鍵的作用。雖然即使使用較小的模型作為判別器，但擴展生成器也會導致 ToT 性能顯著提升，而使用固定生成器擴展判別器只會產生邊際收益。我們的結果表明，不同規模的模型表現出可比較的判別能力，但在 ToT 的生成性能方面卻有顯著差異。", "author": "Qiqi Chen et.al.", "authors": "Qiqi Chen, Xinpeng Wang, Philipp Mondorf, Michael A. Hedderich, Barbara Plank", "id": "2410.17820v1", "paper_url": "http://arxiv.org/abs/2410.17820v1", "repo": "https://github.com/mainlp/tot-eval"}}