{"2406.00314": {"publish_time": "2024-06-01", "title": "CASE: Curricular Data Pre-training for Building Generative and Discriminative Assistive Psychology Expert Models", "paper_summary": "The limited availability of psychologists necessitates efficient\nidentification of individuals requiring urgent mental healthcare. This study\nexplores the use of Natural Language Processing (NLP) pipelines to analyze text\ndata from online mental health forums used for consultations. By analyzing\nforum posts, these pipelines can flag users who may require immediate\nprofessional attention. A crucial challenge in this domain is data privacy and\nscarcity. To address this, we propose utilizing readily available curricular\ntexts used in institutes specializing in mental health for pre-training the NLP\npipelines. This helps us mimic the training process of a psychologist. Our work\npresents two models: a discriminative BERT-based model called CASE-BERT that\nflags potential mental health disorders based on forum text, and a generative\nmodel called CASE-Gemma that extracts key features for a preliminary diagnosis.\nCASE-BERT demonstrates superior performance compared to existing methods,\nachieving an f1 score of 0.91 for Depression and 0.88 for Anxiety, two of the\nmost commonly reported mental health disorders. CASE-Gemma can achieve a BERT\nScore of 0.849 on generating diagnoses based on forum text. The effectiveness\nof CASE-Gemma is evaluated through both human evaluation and qualitative\nmethods, with the collaboration of clinical psychologists who provide us with a\nset of annotated data for fine-tuning and evaluation. Our code is available at\nhttps://github.com/sarthakharne/CASE", "paper_summary_zh": "由於心理學家數量有限，因此有必要有效找出需要緊急心理保健的個人。本研究探討使用自然語言處理 (NLP) 管線來分析線上心理健康論壇中用於諮詢的文字資料。透過分析論壇文章，這些管線可以標記可能需要立即專業協助的使用者。此領域中的關鍵挑戰是資料隱私和稀少性。為了解決此問題，我們建議利用心理健康專門機構中現成的課程文本，作為 NLP 管線預訓練。這有助於我們模擬心理學家的訓練過程。我們的研究提出了兩個模型：一個稱為 CASE-BERT 的判別式 BERT 模型，可根據論壇文字標記潛在的心理健康障礙；以及一個稱為 CASE-Gemma 的生成式模型，可萃取初步診斷的關鍵特徵。與現有方法相比，CASE-BERT 展現出優異的效能，在憂鬱症和焦慮症（兩種最常報告的心理健康障礙）的 f1 分數分別達到 0.91 和 0.88。CASE-Gemma 可以根據論壇文字產生診斷，並在 BERT 分數上達到 0.849。我們透過人為評估和質性方法，以及與臨床心理學家的合作（他們提供我們一組註解資料，用於微調和評估），來評估 CASE-Gemma 的有效性。我們的程式碼可在 https://github.com/sarthakharne/CASE 取得", "author": "Sarthak Harne et.al.", "authors": "Sarthak Harne, Monjoy Narayan Choudhury, Madhav Rao, TK Srikanth, Seema Mehrotra, Apoorva Vashisht, Aarushi Basu, Manjit Sodhi", "id": "2406.00314v1", "paper_url": "http://arxiv.org/abs/2406.00314v1", "repo": "https://github.com/sarthakharne/case"}}