{"2406.00314": {"publish_time": "2024-06-01", "title": "CASE: Efficient Curricular Data Pre-training for Building Assistive Psychology Expert Models", "paper_summary": "The limited availability of psychologists necessitates efficient\nidentification of individuals requiring urgent mental healthcare. This study\nexplores the use of Natural Language Processing (NLP) pipelines to analyze text\ndata from online mental health forums used for consultations. By analyzing\nforum posts, these pipelines can flag users who may require immediate\nprofessional attention. A crucial challenge in this domain is data privacy and\nscarcity. To address this, we propose utilizing readily available curricular\ntexts used in institutes specializing in mental health for pre-training the NLP\npipelines. This helps us mimic the training process of a psychologist. Our work\npresents CASE-BERT that flags potential mental health disorders based on forum\ntext. CASE-BERT demonstrates superior performance compared to existing methods,\nachieving an f1 score of 0.91 for Depression and 0.88 for Anxiety, two of the\nmost commonly reported mental health disorders. Our code is publicly available.", "paper_summary_zh": "由於心理學家數量有限，因此有必要有效率地找出需要緊急心理保健的個人。本研究探討使用自然語言處理 (NLP) 管線分析線上心理健康論壇用於諮詢的文字資料。這些管線可透過分析論壇貼文，標記可能需要立即專業協助的使用者。在這個領域中，資料隱私和稀少性是一項重大的挑戰。為了解決這個問題，我們建議利用心理健康專業機構中現成的課程教材，對 NLP 管線進行預訓練。這有助於我們模擬心理學家的訓練過程。我們的作品展示了 CASE-BERT，它根據論壇文字標記潛在的心理健康障礙。與現有方法相比，CASE-BERT 展現出優異的效能，在憂鬱症方面達到 0.91 的 f1 分數，在焦慮症方面則達到 0.88，這兩種是最常被回報的心理健康障礙。我們的程式碼已公開。", "author": "Sarthak Harne et.al.", "authors": "Sarthak Harne, Monjoy Narayan Choudhury, Madhav Rao, TK Srikanth, Seema Mehrotra, Apoorva Vashisht, Aarushi Basu, Manjit Sodhi", "id": "2406.00314v2", "paper_url": "http://arxiv.org/abs/2406.00314v2", "repo": "https://github.com/sarthakharne/case"}}