{"2410.02465": {"publish_time": "2024-10-03", "title": "Response Tuning: Aligning Large Language Models without Instruction", "paper_summary": "Instruction tuning-supervised fine-tuning using instruction-response pairs-is\na foundational step in transitioning pre-trained Large Language Models (LLMs)\ninto helpful and safe chat assistants. Our hypothesis is that establishing an\nadequate output space can enable such a transition given the capabilities\ninherent in pre-trained LLMs. To verify this, we propose Response Tuning (RT),\nwhich eliminates the instruction-conditioning step in instruction tuning and\nsolely focuses on response space supervision. Our experiments demonstrate that\nRT models, trained only using responses, can effectively respond to a wide\nrange of instructions and exhibit helpfulness comparable to that of their\ninstruction-tuned counterparts. Furthermore, we observe that controlling the\ntraining response distribution can significantly improve their user preference\nor elicit target behaviors such as refusing assistance for unsafe queries. Our\nfindings illuminate the role of establishing an adequate output space in\nalignment, highlighting the potential of the extensive inherent capabilities of\npre-trained LLMs.", "paper_summary_zh": "指令微調——使用指令-回應配對進行監督式微調——是將預先訓練好的大型語言模型 (LLM) 轉變為有用且安全的聊天助理的基本步驟。我們的假設是，建立一個足夠的輸出空間可以讓這樣的轉換成為可能，因為預先訓練好的 LLM 具有內在的能力。為了驗證這一點，我們提出了回應微調 (RT)，它消除了指令微調中的指令制約步驟，並僅專注於回應空間監督。我們的實驗表明，僅使用回應訓練的 RT 模型可以有效地回應各種指令，並表現出與指令微調對應模型相當的樂於助人。此外，我們觀察到控制訓練回應分佈可以顯著提高使用者的偏好，或引發目標行為，例如拒絕對不安全的查詢提供協助。我們的發現闡明了在對齊中建立足夠輸出空間的作用，突出了預先訓練好的 LLM 廣泛內在能力的潛力。", "author": "Seokhyun An et.al.", "authors": "Seokhyun An, Hyounghun Kim", "id": "2410.02465v1", "paper_url": "http://arxiv.org/abs/2410.02465v1", "repo": "null"}}