{"2410.19549": {"publish_time": "2024-10-25", "title": "Mirror Matrix on the Wall: coding and vector notation as tools for introspection", "paper_summary": "The vector notation adopted by GNU Octave plays a significant role as a tool\nfor introspection, aligning itself with the vision of Kenneth E. Iverson. He\nbelieved that, just like mathematics, a programming language should be an\neffective thinking tool for representing and reasoning about problems we wish\nto address. This work aims to explore the use of vector notation in GNU Octave\nthrough the analysis of operators and functions, providing a closer alignment\nwith mathematical notation and enhancing code efficiency. We will delve into\nfundamental concepts such as indexing, broadcasting, and function handles, and\npresent case studies for a deeper understanding of these concepts. By adopting\nvector notation, GNU Octave becomes a powerful tool for mathematicians,\nscientists and engineers, enabling them to express and solve complex problems\nmore effectively and intuitively.", "paper_summary_zh": "GNU Octave 所採用的向量表示法扮演著一個重要的角色，作為一個內省的工具，與 Kenneth E. Iverson 的願景相符。他相信，就像數學一樣，一門程式語言應該是一個有效的思考工具，用於表示和推理我們想要解決的問題。這項工作旨在透過分析運算子和函數，探討在 GNU Octave 中使用向量表示法，提供與數學表示法更緊密的結合，並增強程式碼效率。我們將深入探討基本概念，例如索引、廣播和函數句柄，並提出案例研究，以更深入地理解這些概念。透過採用向量表示法，GNU Octave 成為數學家、科學家和工程師的強大工具，使他們能夠更有效率且直觀地表達和解決複雜的問題。", "author": "Leonardo Araújo et.al.", "authors": "Leonardo Araújo", "id": "2410.19549v1", "paper_url": "http://arxiv.org/abs/2410.19549v1", "repo": "null"}}