{"2407.11300": {"publish_time": "2024-07-16", "title": "Large Vision-Language Models as Emotion Recognizers in Context Awareness", "paper_summary": "Context-aware emotion recognition (CAER) is a complex and significant task\nthat requires perceiving emotions from various contextual cues. Previous\napproaches primarily focus on designing sophisticated architectures to extract\nemotional cues from images. However, their knowledge is confined to specific\ntraining datasets and may reflect the subjective emotional biases of the\nannotators. Furthermore, acquiring large amounts of labeled data is often\nchallenging in real-world applications. In this paper, we systematically\nexplore the potential of leveraging Large Vision-Language Models (LVLMs) to\nempower the CAER task from three paradigms: 1) We fine-tune LVLMs on two CAER\ndatasets, which is the most common way to transfer large models to downstream\ntasks. 2) We design zero-shot and few-shot patterns to evaluate the performance\nof LVLMs in scenarios with limited data or even completely unseen. In this\ncase, a training-free framework is proposed to fully exploit the In-Context\nLearning (ICL) capabilities of LVLMs. Specifically, we develop an image\nsimilarity-based ranking algorithm to retrieve examples; subsequently, the\ninstructions, retrieved examples, and the test example are combined to feed\nLVLMs to obtain the corresponding sentiment judgment. 3) To leverage the rich\nknowledge base of LVLMs, we incorporate Chain-of-Thought (CoT) into our\nframework to enhance the model's reasoning ability and provide interpretable\nresults. Extensive experiments and analyses demonstrate that LVLMs achieve\ncompetitive performance in the CAER task across different paradigms. Notably,\nthe superior performance in few-shot settings indicates the feasibility of\nLVLMs for accomplishing specific tasks without extensive training.", "paper_summary_zh": "情境感知情緒辨識 (CAER) 是一項複雜且重要的任務，需要從各種情境線索中感知情緒。先前的做法主要專注於設計精密架構，從影像中擷取情緒線索。然而，其知識僅限於特定訓練資料集，且可能反映標註者的主觀情緒偏見。此外，在真實世界應用中，取得大量的標籤資料通常具有挑戰性。在本文中，我們系統性地探討利用大型視覺語言模型 (LVLMs) 來強化 CAER 任務的三種範例：1) 我們對兩個 CAER 資料集微調 LVLMs，這是將大型模型轉移到下游任務最常見的方法。2) 我們設計零次學習和少量學習模式，以評估 LVLMs 在資料有限甚至完全未見的情況下的效能。在這種情況下，我們提出一個免訓練架構，以充分利用 LVLMs 的情境學習 (ICL) 能力。具體來說，我們開發一個基於影像相似度的排名演算法來擷取範例；隨後，將指示、擷取的範例和測試範例組合起來，提供給 LVLMs 以取得相應的情緒判斷。3) 為了利用 LVLMs 豐富的知識庫，我們將思考鏈 (CoT) 納入我們的架構中，以增強模型的推理能力並提供可解釋的結果。廣泛的實驗和分析證明，LVLMs 在不同的範例中實現了 CAER 任務的競爭效能。值得注意的是，在少量學習設定中的優異效能，表示 LVLMs 無需廣泛訓練即可完成特定任務的可行性。", "author": "Yuxuan Lei et.al.", "authors": "Yuxuan Lei, Dingkang Yang, Zhaoyu Chen, Jiawei Chen, Peng Zhai, Lihua Zhang", "id": "2407.11300v1", "paper_url": "http://arxiv.org/abs/2407.11300v1", "repo": "null"}}