{"2502.04173": {"publish_time": "2025-02-06", "title": "Lexical Substitution is not Synonym Substitution: On the Importance of Producing Contextually Relevant Word Substitutes", "paper_summary": "Lexical Substitution is the task of replacing a single word in a sentence\nwith a similar one. This should ideally be one that is not necessarily only\nsynonymous, but also fits well into the surrounding context of the target word,\nwhile preserving the sentence's grammatical structure. Recent advances in\nLexical Substitution have leveraged the masked token prediction task of\nPre-trained Language Models to generate replacements for a given word in a\nsentence. With this technique, we introduce ConCat, a simple augmented approach\nwhich utilizes the original sentence to bolster contextual information sent to\nthe model. Compared to existing approaches, it proves to be very effective in\nguiding the model to make contextually relevant predictions for the target\nword. Our study includes a quantitative evaluation, measured via sentence\nsimilarity and task performance. In addition, we conduct a qualitative human\nanalysis to validate that users prefer the substitutions proposed by our\nmethod, as opposed to previous methods. Finally, we test our approach on the\nprevailing benchmark for Lexical Substitution, CoInCo, revealing potential\npitfalls of the benchmark. These insights serve as the foundation for a\ncritical discussion on the way in which Lexical Substitution is evaluated.", "paper_summary_zh": "詞彙替換是將句子中的一個單字替換為一個類似的單字。理想情況下，這個單字不一定是同義詞，但也能很好地融入目標單字的周圍語境，同時保留句子的語法結構。詞彙替換的最新進展利用了預訓練語言模型的遮罩符號預測任務，為句子中的特定單字產生替換。使用此技術，我們引入了 ConCat，這是一種簡單的擴充方法，利用原始句子來加強傳送到模型的上下文資訊。與現有方法相比，它被證明在引導模型對目標單字進行與上下文相關的預測方面非常有效。我們的研究包括定量評估，透過句子相似度和任務效能來衡量。此外，我們進行了定性的人類分析，以驗證使用者偏好我們的方法提出的替換，而不是以前的方法。最後，我們在詞彙替換的流行基準 CoInCo 上測試了我們的方法，揭示了基準的潛在缺陷。這些見解作為對詞彙替換評估方式進行批判性討論的基礎。", "author": "Juraj Vladika et.al.", "authors": "Juraj Vladika, Stephen Meisenbacher, Florian Matthes", "id": "2502.04173v1", "paper_url": "http://arxiv.org/abs/2502.04173v1", "repo": "null"}}