{"2405.03864": {"publish_time": "2024-05-06", "title": "Learning Planning Abstractions from Language", "paper_summary": "This paper presents a framework for learning state and action abstractions in\nsequential decision-making domains. Our framework, planning abstraction from\nlanguage (PARL), utilizes language-annotated demonstrations to automatically\ndiscover a symbolic and abstract action space and induce a latent state\nabstraction based on it. PARL consists of three stages: 1) recovering\nobject-level and action concepts, 2) learning state abstractions, abstract\naction feasibility, and transition models, and 3) applying low-level policies\nfor abstract actions. During inference, given the task description, PARL first\nmakes abstract action plans using the latent transition and feasibility\nfunctions, then refines the high-level plan using low-level policies. PARL\ngeneralizes across scenarios involving novel object instances and environments,\nunseen concept compositions, and tasks that require longer planning horizons\nthan settings it is trained on.", "paper_summary_zh": "本論文提出了一個用於在順序決策領域中學習狀態和動作抽象的框架。我們的框架，從語言規劃抽象（PARL），利用語言註解演示自動發現一個符號和抽象動作空間，並根據它誘導一個潛在狀態抽象。PARL 包含三個階段：1）恢復物件層級和動作概念，2）學習狀態抽象、抽象動作可行性和轉換模型，以及 3）應用低層級策略以進行抽象動作。在推論期間，給定任務描述，PARL 首先使用潛在轉換和可行性函數制定抽象動作計畫，然後使用低層級策略改善高層級計畫。PARL 概括了涉及新物件實例和環境、未見概念組合以及需要比其訓練設定更長計畫範圍的任務的不同場景。", "author": "Weiyu Liu et.al.", "authors": "Weiyu Liu, Geng Chen, Joy Hsu, Jiayuan Mao, Jiajun Wu", "id": "2405.03864v1", "paper_url": "http://arxiv.org/abs/2405.03864v1", "repo": "null"}}