{"2407.18428": {"publish_time": "2024-07-25", "title": "Weighted Risk Invariance: Domain Generalization under Invariant Feature Shift", "paper_summary": "Learning models whose predictions are invariant under multiple environments\nis a promising approach for out-of-distribution generalization. Such models are\ntrained to extract features $X_{\\text{inv}}$ where the conditional distribution\n$Y \\mid X_{\\text{inv}}$ of the label given the extracted features does not\nchange across environments. Invariant models are also supposed to generalize to\nshifts in the marginal distribution $p(X_{\\text{inv}})$ of the extracted\nfeatures $X_{\\text{inv}}$, a type of shift we call an $\\textit{invariant\ncovariate shift}$. However, we show that proposed methods for learning\ninvariant models underperform under invariant covariate shift, either failing\nto learn invariant models$\\unicode{x2014}$even for data generated from simple\nand well-studied linear-Gaussian models$\\unicode{x2014}$or having poor\nfinite-sample performance. To alleviate these problems, we propose\n$\\textit{weighted risk invariance}$ (WRI). Our framework is based on imposing\ninvariance of the loss across environments subject to appropriate reweightings\nof the training examples. We show that WRI provably learns invariant models,\ni.e. discards spurious correlations, in linear-Gaussian settings. We propose a\npractical algorithm to implement WRI by learning the density\n$p(X_{\\text{inv}})$ and the model parameters simultaneously, and we demonstrate\nempirically that WRI outperforms previous invariant learning methods under\ninvariant covariate shift.", "paper_summary_zh": "學習預測在多重環境下不變的模型，是針對非分佈推廣的一種有前途的方法。此類模型經過訓練，可萃取出特徵 $X_{\\text{inv}}$，其中給定萃取特徵的條件分佈 $Y \\mid X_{\\text{inv}}$ 在不同環境中不會改變。不變模型也假設能推廣到萃取特徵 $X_{\\text{inv}}$ 的邊際分佈 $p(X_{\\text{inv}})$ 的轉移，我們將此類型的轉移稱為「不變協變數轉移」。然而，我們顯示出針對不變協變數轉移學習不變模型的提議方法表現不佳，不是無法學習不變模型（即使對於由簡單且經過充分研究的線性高斯模型產生的資料），就是具有不佳的有限樣本效能。為了緩解這些問題，我們提出「加權風險不變性」(WRI)。我們的架構基於在適當重新加權訓練範例的環境中，強加損失的不變性。我們顯示出 WRI 可證明學習不變模型，亦即捨棄線性高斯設定中的虛假關聯性。我們提出一個實用的演算法來實作 WRI，方法是同時學習密度 $p(X_{\\text{inv}})$ 與模型參數，且我們實證顯示 WRI 在不變協變數轉移下優於先前的非變學習方法。", "author": "Gina Wong et.al.", "authors": "Gina Wong, Joshua Gleason, Rama Chellappa, Yoav Wald, Anqi Liu", "id": "2407.18428v1", "paper_url": "http://arxiv.org/abs/2407.18428v1", "repo": "https://github.com/ginawong/weighted_risk_invariance"}}