{"2406.03447": {"publish_time": "2024-06-05", "title": "FILS: Self-Supervised Video Feature Prediction In Semantic Language Space", "paper_summary": "This paper demonstrates a self-supervised approach for learning semantic\nvideo representations. Recent vision studies show that a masking strategy for\nvision and natural language supervision has contributed to developing\ntransferable visual pretraining. Our goal is to achieve a more semantic video\nrepresentation by leveraging the text related to the video content during the\npretraining in a fully self-supervised manner. To this end, we present FILS, a\nnovel self-supervised video Feature prediction In semantic Language Space\n(FILS). The vision model can capture valuable structured information by\ncorrectly predicting masked feature semantics in language space. It is learned\nusing a patch-wise video-text contrastive strategy, in which the text\nrepresentations act as prototypes for transforming vision features into a\nlanguage space, which are then used as targets for semantically meaningful\nfeature prediction using our masked encoder-decoder structure. FILS\ndemonstrates remarkable transferability on downstream action recognition tasks,\nachieving state-of-the-art on challenging egocentric datasets, like\nEpic-Kitchens, Something-SomethingV2, Charades-Ego, and EGTEA, using ViT-Base.\nOur efficient method requires less computation and smaller batches compared to\nprevious works.", "paper_summary_zh": "本文展示了用于学习语义视频表征的自监督方法。最近的视觉研究表明，视觉和自然语言监督的掩蔽策略有助于开发可转移的视觉预训练。我们的目标是通过在预训练期间充分利用与视频内容相关的文本，来实现更语义化的视频表征。为此，我们提出了 FILS，一种语义语言空间中的新颖自监督视频特征预测 (FILS)。视觉模型可以通过在语言空间中正确预测掩蔽特征语义来捕获有价值的结构化信息。它使用基于 patch 的视频文本对比策略进行学习，其中文本表征充当将视觉特征转换为语言空间的原型，然后使用我们的掩蔽编码器-解码器结构作为语义有意义的特征预测的目标。FILS 在下游动作识别任务中展示了卓越的可转移性，使用 ViT-Base 在具有挑战性的以自我为中心的数据集（如 Epic-Kitchens、Something-SomethingV2、Charades-Ego 和 EGTEA）上实现了最先进的效果。与以前的工作相比，我们的高效方法需要更少的计算和更小的批次。", "author": "Mona Ahmadian et.al.", "authors": "Mona Ahmadian, Frank Guerin, Andrew Gilbert", "id": "2406.03447v1", "paper_url": "http://arxiv.org/abs/2406.03447v1", "repo": "null"}}