{"2410.19605": {"publish_time": "2024-10-25", "title": "CoqPilot, a plugin for LLM-based generation of proofs", "paper_summary": "We present CoqPilot, a VS Code extension designed to help automate writing of\nCoq proofs. The plugin collects the parts of proofs marked with the admit\ntactic in a Coq file, i.e., proof holes, and combines LLMs along with\nnon-machine-learning methods to generate proof candidates for the holes. Then,\nCoqPilot checks if each proof candidate solves the given subgoal and, if\nsuccessful, replaces the hole with it. The focus of CoqPilot is twofold.\nFirstly, we want to allow users to seamlessly combine multiple Coq generation\napproaches and provide a zero-setup experience for our tool. Secondly, we want\nto deliver a platform for LLM-based experiments on Coq proof generation. We\ndeveloped a benchmarking system for Coq generation methods, available in the\nplugin, and conducted an experiment using it, showcasing the framework's\npossibilities. Demo of CoqPilot is available at: https://youtu.be/oB1Lx-So9Lo.\nCode at: https://github.com/JetBrains-Research/coqpilot", "paper_summary_zh": "我們展示了 CoqPilot，一個 VS Code 擴充功能，旨在幫助自動化 Coq 證明撰寫。外掛程式會收集 Coq 檔案中標記為 admit 戰術的證明部分，也就是證明漏洞，並結合 LLM 與非機器學習方法，為這些漏洞產生證明候選。然後，CoqPilot 會檢查每個證明候選是否解決了給定的子目標，如果成功，就會用它取代漏洞。CoqPilot 的重點有兩個方面。首先，我們希望允許使用者無縫結合多種 Coq 產生方法，並為我們的工具提供零設定體驗。其次，我們希望提供一個基於 LLM 的 Coq 證明產生實驗平台。我們開發了一個基準系統，可用於外掛程式中的 Coq 產生方法，並使用它進行了一個實驗，展示了這個架構的可能性。CoqPilot 的示範可以在這裡找到：https://youtu.be/oB1Lx-So9Lo。程式碼在這裡：https://github.com/JetBrains-Research/coqpilot", "author": "Andrei Kozyrev et.al.", "authors": "Andrei Kozyrev, Gleb Solovev, Nikita Khramov, Anton Podkopaev", "id": "2410.19605v1", "paper_url": "http://arxiv.org/abs/2410.19605v1", "repo": "https://github.com/jetbrains-research/coqpilot"}}