{"2502.02768": {"publish_time": "2025-02-04", "title": "Planning with affordances: Integrating learned affordance models and symbolic planning", "paper_summary": "Intelligent agents working in real-world environments must be able to learn\nabout the environment and its capabilities which enable them to take actions to\nchange to the state of the world to complete a complex multi-step task in a\nphotorealistic environment. Learning about the environment is especially\nimportant to perform various multiple-step tasks without having to redefine an\nagent's action set for different tasks or environment settings. In our work, we\naugment an existing task and motion planning framework with learned affordance\nmodels of objects in the world to enable planning and executing multi-step\ntasks using learned models. Each task can be seen as changing the current state\nof the world to a given goal state. The affordance models provide us with what\nactions are possible and how to perform those actions in any given state. A\nsymbolic planning algorithm uses this information and the starting and goal\nstate to create a feasible plan to reach the desired goal state to complete a\ngiven task. We demonstrate our approach in a virtual 3D photorealistic\nenvironment, AI2-Thor, and evaluate it on real-world tasks. Our results show\nthat our agent quickly learns how to interact with the environment and is well\nprepared to perform tasks such as \"Moving an object out of the way to reach the\ndesired location.\"", "paper_summary_zh": "在现实世界环境中工作的智能代理必须能够学习环境及其能力，使它们能够采取行动来改变世界状态，以便在逼真的环境中完成复杂的多步骤任务。了解环境对于执行各种多步骤任务尤其重要，而无需为不同的任务或环境设置重新定义代理的动作集。在我们的工作中，我们使用世界中对象的学习能力模型来增强现有的任务和运动规划框架，以使用学习模型来规划和执行多步骤任务。每个任务都可以看作是将当前世界状态更改为给定的目标状态。能力模型为我们提供了在任何给定状态下可能采取哪些动作以及如何执行这些动作。符号规划算法使用此信息以及开始和目标状态来创建可行的计划，以达到所需的最终状态以完成给定的任务。我们在虚拟 3D 逼真环境 AI2-Thor 中演示了我们的方法，并对现实世界任务进行了评估。我们的结果表明，我们的代理可以快速学会如何与环境交互，并且已经为执行诸如“将物体移开以到达所需位置”之类的任务做好了充分的准备。", "author": "Rajesh Mangannavar et.al.", "authors": "Rajesh Mangannavar", "id": "2502.02768v1", "paper_url": "http://arxiv.org/abs/2502.02768v1", "repo": "null"}}