{"2405.11613": {"publish_time": "2024-05-19", "title": "Decoding by Contrasting Knowledge: Enhancing LLMs' Confidence on Edited Facts", "paper_summary": "The knowledge within large language models (LLMs) may become outdated\nquickly. While in-context editing (ICE) is currently the most effective method\nfor knowledge editing (KE), it is constrained by the black-box modeling of LLMs\nand thus lacks interpretability. Our work aims to elucidate the superior\nperformance of ICE on the KE by analyzing the impacts of in-context new\nknowledge on token-wise distributions. We observe that despite a significant\nboost in logits of the new knowledge, the performance of is still hindered by\nstubborn knowledge. Stubborn knowledge refers to as facts that have gained\nexcessive confidence during pretraining, making it hard to edit effectively. To\naddress this issue and further enhance the performance of ICE, we propose a\nnovel approach termed $\\textbf{De}$coding by $\\textbf{C}$ontrasting\n$\\textbf{K}$nowledge (DeCK). DeCK derives the distribution of the next token by\ncontrasting the logits obtained from the newly edited knowledge guided by ICE\nwith those from the unedited parametric knowledge. Our experiments consistently\ndemonstrate that DeCK enhances the confidence of LLMs in edited facts. For\ninstance, it improves the performance of LLaMA3-8B-instruct on MQuAKE by up to\n219%, demonstrating its capability to strengthen ICE in the editing of stubborn\nknowledge. Our work paves the way to develop the both effective and accountable\nKE methods for LLMs. (The source code is available at:\n$\\href{https://github.com/byronBBL/DeCK}{\\text{this https URL.}}$ )", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 中的知識可能會迅速過時。雖然目前情境編輯 (ICE) 是知識編輯 (KE) 最有效的方法，但它受到 LLM 黑箱建模的限制，因此缺乏可解釋性。我們的研究旨在通過分析情境中新知識對令牌級分佈的影響，闡明 ICE 在 KE 上的優異性能。我們觀察到，儘管新知識的對數幾率有了顯著提升，但頑固知識仍然阻礙了性能。頑固知識是指在預訓練過程中獲得過度信心的事實，使其難以有效編輯。為了解決這個問題並進一步提高 ICE 的性能，我們提出了一種新穎的方法，稱為通過對比知識進行解碼 (DeCK)。DeCK 通過對比從 ICE 引導的新編輯知識獲得的對數幾率和未編輯參數知識獲得的對數幾率，推導出下一個令牌的分布。我們的實驗持續證明，DeCK 增強了 LLM 對編輯事實的信心。例如，它將 LLaMA3-8B-instruct 在 MQuAKE 上的性能提高了多達 219%，證明了它在編輯頑固知識中加強 ICE 的能力。我們的研究為開發 LLM 的有效且負責任的 KE 方法鋪平了道路。（源代碼可在以下位置獲得：\n$\\href{https://github.com/byronBBL/DeCK}{\\text{this https URL.}}$）</paragraph>", "author": "Baolong Bi et.al.", "authors": "Baolong Bi, Shenghua Liu, Lingrui Mei, Yiwei Wang, Pengliang Ji, Xueqi Cheng", "id": "2405.11613v1", "paper_url": "http://arxiv.org/abs/2405.11613v1", "repo": "null"}}