{"2502.13622": {"publish_time": "2025-02-19", "title": "REFIND: Retrieval-Augmented Factuality Hallucination Detection in Large Language Models", "paper_summary": "Hallucinations in large language model (LLM) outputs severely limit their\nreliability in knowledge-intensive tasks such as question answering. To address\nthis challenge, we introduce REFIND (Retrieval-augmented Factuality\nhallucINation Detection), a novel framework that detects hallucinated spans\nwithin LLM outputs by directly leveraging retrieved documents. As part of the\nREFIND, we propose the Context Sensitivity Ratio (CSR), a novel metric that\nquantifies the sensitivity of LLM outputs to retrieved evidence. This\ninnovative approach enables REFIND to efficiently and accurately detect\nhallucinations, setting it apart from existing methods. In the evaluation,\nREFIND demonstrated robustness across nine languages, including low-resource\nsettings, and significantly outperformed baseline models, achieving superior\nIoU scores in identifying hallucinated spans. This work highlights the\neffectiveness of quantifying context sensitivity for hallucination detection,\nthereby paving the way for more reliable and trustworthy LLM applications\nacross diverse languages.", "paper_summary_zh": "大型語言模型 (LLM) 輸出中的幻覺嚴重限制了它們在知識密集型任務（例如問答）中的可靠性。為了應對這一挑戰，我們引入了 REFIND（檢索增強的事實幻覺檢測），這是一個新穎的框架，它通過直接利用檢索到的文件來檢測 LLM 輸出中的幻覺跨度。作為 REFIND 的一部分，我們提出了語境敏感性比率 (CSR)，這是一個新穎的指標，它量化了 LLM 輸出對檢索證據的敏感性。這種創新方法使 REFIND 能夠高效準確地檢測幻覺，使其有別於現有方法。在評估中，REFIND 在九種語言中展示了其穩健性，包括低資源設置，並且顯著優於基線模型，在識別幻覺跨度方面實現了更高的 IoU 分數。這項工作突出了量化語境敏感性對於幻覺檢測的有效性，從而為跨多種語言的更可靠和值得信賴的 LLM 應用鋪平了道路。", "author": "DongGeon Lee et.al.", "authors": "DongGeon Lee, Hwanjo Yu", "id": "2502.13622v1", "paper_url": "http://arxiv.org/abs/2502.13622v1", "repo": "null"}}