{"2407.14097": {"publish_time": "2024-07-19", "title": "On the Robustness of Fully-Spiking Neural Networks in Open-World Scenarios using Forward-Only Learning Algorithms", "paper_summary": "In the last decade, Artificial Intelligence (AI) models have rapidly\nintegrated into production pipelines propelled by their excellent modeling\nperformance. However, the development of these models has not been matched by\nadvancements in algorithms ensuring their safety, failing to guarantee robust\nbehavior against Out-of-Distribution (OoD) inputs outside their learning\ndomain. Furthermore, there is a growing concern with the sustainability of AI\nmodels and their required energy consumption in both training and inference\nphases. To mitigate these issues, this work explores the use of the\nForward-Forward Algorithm (FFA), a biologically plausible alternative to\nBackpropagation, adapted to the spiking domain to enhance the overall energy\nefficiency of the model. By capitalizing on the highly expressive topology\nemerging from the latent space of models trained with FFA, we develop a novel\nFF-SCP algorithm for OoD Detection. Our approach measures the likelihood of a\nsample belonging to the in-distribution (ID) data by using the distance from\nthe latent representation of samples to class-representative manifolds.\nAdditionally, to provide deeper insights into our OoD pipeline, we propose a\ngradient-free attribution technique that highlights the features of a sample\npushing it away from the distribution of any class. Multiple experiments using\nour spiking FFA adaptation demonstrate that the achieved accuracy levels are\ncomparable to those seen in analog networks trained via back-propagation.\nFurthermore, OoD detection experiments on multiple datasets prove that FF-SCP\noutperforms avant-garde OoD detectors within the spiking domain in terms of\nseveral metrics used in this area. We also present a qualitative analysis of\nour explainability technique, exposing the precision by which the method\ndetects OoD features, such as embedded artifacts or missing regions.", "paper_summary_zh": "<paragraph>在过去十年中，人工智能 (AI) 模型已迅速整合到生產管道中，其優秀的建模效能推動了這項整合。然而，這些模型的開發並未與確保其安全性的演算法進展相匹配，無法保證其對學習領域外的異常分佈 (OoD) 輸入具有穩健的行為。此外，對於 AI 模型的可持續性及其在訓練和推論階段所需的能源消耗，也日益受到關注。為了減輕這些問題，本研究探討了前饋前饋演算法 (FFA) 的用途，這是一種生物學上合理的替代後向傳播的演算法，適用於尖峰域，以提高模型的整體能源效率。透過利用從使用 FFA 訓練的模型潛在空間中產生的高度表現拓撲，我們開發了一種用於 OoD 偵測的新型 FF-SCP 演算法。我們的做法是透過從樣本的潛在表示到類別代表流形的距離，來測量樣本屬於內部分佈 (ID) 資料的可能性。此外，為了更深入地了解我們的 OoD 管道，我們提出了一種無梯度的歸因技術，它突出了樣本的特徵，將其推離任何類別的分布。使用我們的尖峰 FFA 改編進行的多項實驗證明，所達到的準確度等級與透過反向傳播訓練的類比網路中所見到的準確度等級相當。此外，在多個資料集上進行的 OoD 偵測實驗證明，FF-SCP 在尖峰域中優於前衛的 OoD 偵測器，就這個領域中使用的多項指標而言。我們還對我們的可解釋性技術進行了定性分析，揭露了該方法偵測 OoD 特徵（例如嵌入人工製品或遺失區域）的精確度。</paragraph>", "author": "Erik B. Terres-Escudero et.al.", "authors": "Erik B. Terres-Escudero, Javier Del Ser, Aitor Martínez-Seras, Pablo Garcia-Bringas", "id": "2407.14097v1", "paper_url": "http://arxiv.org/abs/2407.14097v1", "repo": "null"}}