{"2502.15365": {"publish_time": "2025-02-21", "title": "Identifying Features that Shape Perceived Consciousness in Large Language Model-based AI: A Quantitative Study of Human Responses", "paper_summary": "This study quantitively examines which features of AI-generated text lead\nhumans to perceive subjective consciousness in large language model (LLM)-based\nAI systems. Drawing on 99 passages from conversations with Claude 3 Opus and\nfocusing on eight features -- metacognitive self-reflection, logical reasoning,\nempathy, emotionality, knowledge, fluency, unexpectedness, and subjective\nexpressiveness -- we conducted a survey with 123 participants. Using regression\nand clustering analyses, we investigated how these features influence\nparticipants' perceptions of AI consciousness. The results reveal that\nmetacognitive self-reflection and the AI's expression of its own emotions\nsignificantly increased perceived consciousness, while a heavy emphasis on\nknowledge reduced it. Participants clustered into seven subgroups, each showing\ndistinct feature-weighting patterns. Additionally, higher prior knowledge of\nLLMs and more frequent usage of LLM-based chatbots were associated with greater\noverall likelihood assessments of AI consciousness. This study underscores the\nmultidimensional and individualized nature of perceived AI consciousness and\nprovides a foundation for better understanding the psychosocial implications of\nhuman-AI interaction.", "paper_summary_zh": "本研究定量檢驗了 AI 生成的文字中哪些特徵，會導致人類在大型語言模型 (LLM) 為基礎的 AI 系統中感知到主觀意識。我們從與 Claude 3 Opus 的對話中擷取了 99 段文字，並專注於八項特徵——元認知自我反省、邏輯推理、同理心、情緒化、知識、流暢度、出乎意料性，以及主觀表達性——我們對 123 位參與者進行了一項調查。使用回歸和群集分析，我們探討了這些特徵如何影響參與者對 AI 意識的感知。結果顯示，元認知自我反省和 AI 表達自身的情緒會顯著提升感知到的意識，而過度強調知識則會降低感知到的意識。參與者被分為七個子群組，每個子群組都顯示出不同的特徵加權模式。此外，對 LLM 的先備知識較高，以及更頻繁使用基於 LLM 的聊天機器人，與對 AI 意識的整體可能性評估較高有關。本研究強調了感知到的 AI 意識的多維和個性化性質，並為更深入了解人機互動的心理社會影響奠定了基礎。", "author": "Kang Bongsu et.al.", "authors": "Kang Bongsu, Kim Jundong, Yun Tae-Rim, Bae Hyojin, Kim Chang-Eop", "id": "2502.15365v1", "paper_url": "http://arxiv.org/abs/2502.15365v1", "repo": "null"}}