{"2412.03513": {"publish_time": "2024-12-04", "title": "KKLIP: Knowledge Distillation Exploiting K-means Clustering for Language-Image Pre-Training", "paper_summary": "Recently, CLIP has emerged as a valuable model for aligning image and text\ninformation in multi-modal scenarios. However, researchers have observed\nlimitations in the ability of CLIP's text and image encoders to extract\ndetailed knowledge from caption-image pairs. In response, this paper introduces\nKKLIP, a novel approach designed to enhance the quality of CLIP by\nincorporating a new knowledge distillation (KD) method derived from Llama 2.\nOur method comprises three objectives: Text Embedding Distillation, Concept\nLearning, and Contrastive Learning. Firstly, Text Embedding Distillation\ninvolves training the KKLIP text encoder to emulate the teacher model, Llama 2.\nSecondly, Concept Learning assigns a soft concept label to each caption-image\npair through offline k-means clustering of text information from Llama 2,\nallowing KKLIP to learn from these soft concept labels. Finally, Contrastive\nLearning harmonizes text and image embeddings. Our experimental results\ndemonstrate that KKLIP enhances the quality of both text and image encoders.", "paper_summary_zh": "最近，CLIP 已成为一种有价值的模型，用于在多模态场景中对齐图像和文本信息。然而，研究人员已经观察到 CLIP 的文本和图像编码器从标题图像对中提取详细知识的能力存在局限性。对此，本文介绍了 KKLIP，这是一种新颖的方法，旨在通过整合源自 Llama 2 的新知识蒸馏 (KD) 方法来增强 CLIP 的质量。我们的方法包括三个目标：文本嵌入蒸馏、概念学习和对比学习。首先，文本嵌入蒸馏涉及训练 KKLIP 文本编码器以模拟教师模型 Llama 2。其次，概念学习通过离线对来自 Llama 2 的文本信息进行 k 均值聚类，为每个标题图像对分配一个软概念标签，从而允许 KKLIP 从这些软概念标签中学习。最后，对比学习协调文本和图像嵌入。我们的实验结果表明，KKLIP 增强了文本和图像编码器的质量。", "author": "Kuei-Chun Kao et.al.", "authors": "Kuei-Chun Kao", "id": "2412.03513v1", "paper_url": "http://arxiv.org/abs/2412.03513v1", "repo": "null"}}