{"2405.20101": {"publish_time": "2024-05-30", "title": "Fill in the Gap! Combining Self-supervised Representation Learning with Neural Audio Synthesis for Speech Inpainting", "paper_summary": "Most speech self-supervised learning (SSL) models are trained with a pretext\ntask which consists in predicting missing parts of the input signal, either\nfuture segments (causal prediction) or segments masked anywhere within the\ninput (non-causal prediction). Learned speech representations can then be\nefficiently transferred to downstream tasks (e.g., automatic speech or speaker\nrecognition). In the present study, we investigate the use of a speech SSL\nmodel for speech inpainting, that is reconstructing a missing portion of a\nspeech signal from its surrounding context, i.e., fulfilling a downstream task\nthat is very similar to the pretext task. To that purpose, we combine an SSL\nencoder, namely HuBERT, with a neural vocoder, namely HiFiGAN, playing the role\nof a decoder. In particular, we propose two solutions to match the HuBERT\noutput with the HiFiGAN input, by freezing one and fine-tuning the other, and\nvice versa. Performance of both approaches was assessed in single- and\nmulti-speaker settings, for both informed and blind inpainting configurations\n(i.e., the position of the mask is known or unknown, respectively), with\ndifferent objective metrics and a perceptual evaluation. Performances show that\nif both solutions allow to correctly reconstruct signal portions up to the size\nof 200ms (and even 400ms in some cases), fine-tuning the SSL encoder provides a\nmore accurate signal reconstruction in the single-speaker setting case, while\nfreezing it (and training the neural vocoder instead) is a better strategy when\ndealing with multi-speaker data.", "paper_summary_zh": "<paragraph>大多數的語音自我監督學習 (SSL) 模型都是以一個預設任務來訓練，這個任務包含預測輸入訊號中遺失的部分，可能是未來的片段（因果預測）或在輸入中任何地方遮蔽的片段（非因果預測）。學習到的語音表示法可以有效地轉移到下游任務（例如，自動語音或說話者辨識）。在本研究中，我們探討使用語音 SSL 模型來進行語音填補，也就是從語音訊號的周圍語境重建遺失的部分，也就是完成一個與預設任務非常相似的下游任務。為了這個目的，我們結合一個 SSL 編碼器，也就是 HuBERT，以及一個神經音訊編碼器，也就是 HiFiGAN，扮演解碼器的角色。特別是，我們提出兩種解決方案來比對 HuBERT 輸出與 HiFiGAN 輸入，分別是凍結一個並微調另一個，反之亦然。兩種方法的效能都經過評估，在單一和多說話者的設定中，對於已知和未知填補組態（也就是遮罩的位置分別已知或未知），使用不同的客觀指標和感知評估。效能顯示，如果兩種解決方案都能正確重建長達 200ms（在某些情況下甚至 400ms）的訊號部分，微調 SSL 編碼器可以在單一說話者設定的情況下提供更準確的訊號重建，而凍結它（並訓練神經音訊編碼器）則是處理多說話者資料時更好的策略。</paragraph>", "author": "Ihab Asaad et.al.", "authors": "Ihab Asaad, Maxime Jacquelin, Olivier Perrotin, Laurent Girin, Thomas Hueber", "id": "2405.20101v1", "paper_url": "http://arxiv.org/abs/2405.20101v1", "repo": "null"}}