{"2406.02976": {"publish_time": "2024-06-05", "title": "DA-Flow: Dual Attention Normalizing Flow for Skeleton-based Video Anomaly Detection", "paper_summary": "Cooperation between temporal convolutional networks (TCN) and graph\nconvolutional networks (GCN) as a processing module has shown promising results\nin skeleton-based video anomaly detection (SVAD). However, to maintain a\nlightweight model with low computational and storage complexity, shallow GCN\nand TCN blocks are constrained by small receptive fields and a lack of\ncross-dimension interaction capture. To tackle this limitation, we propose a\nlightweight module called the Dual Attention Module (DAM) for capturing\ncross-dimension interaction relationships in spatio-temporal skeletal data. It\nemploys the frame attention mechanism to identify the most significant frames\nand the skeleton attention mechanism to capture broader relationships across\nfixed partitions with minimal parameters and flops. Furthermore, the proposed\nDual Attention Normalizing Flow (DA-Flow) integrates the DAM as a\npost-processing unit after GCN within the normalizing flow framework.\nSimulations show that the proposed model is robust against noise and negative\nsamples. Experimental results show that DA-Flow reaches competitive or better\nperformance than the existing state-of-the-art (SOTA) methods in terms of the\nmicro AUC metric with the fewest number of parameters. Moreover, we found that\neven without training, simply using random projection without dimensionality\nreduction on skeleton data enables substantial anomaly detection capabilities.", "paper_summary_zh": "時序卷積網路 (TCN) 和圖形卷積網路 (GCN) 作為處理模組的合作，在基於骨架的影片異常偵測 (SVAD) 中展現了令人振奮的成果。然而，為了維持輕量級模型，並降低運算和儲存複雜度，淺層 GCN 和 TCN 區塊受到小感受野和缺乏跨維度互動擷取的限制。為了克服這個限制，我們提出一個名為雙注意力模組 (DAM) 的輕量級模組，用於擷取時空骨架資料中的跨維度互動關係。它採用幀注意力機制來識別最重要的幀，並採用骨架注意力機制來擷取跨越固定分割的更廣泛關係，且具有最少的參數和浮點運算。此外，所提出的雙注意力正規化流 (DA-Flow) 將 DAM 整合為正規化流架構中 GCN 之後的後處理單元。模擬顯示，所提出的模型對於雜訊和負面樣本具有穩健性。實驗結果顯示，DA-Flow 在微型 AUC 指標方面，以最少的參數數量達到與現有最先進 (SOTA) 方法競爭或更好的效能。此外，我們發現即使不進行訓練，僅在骨架資料上使用隨機投影而不進行維度削減，也能實現大量的異常偵測功能。", "author": "Ruituo Wu et.al.", "authors": "Ruituo Wu, Yang Chen, Jian Xiao, Bing Li, Jicong Fan, Frédéric Dufaux, Ce Zhu, Yipeng Liu", "id": "2406.02976v1", "paper_url": "http://arxiv.org/abs/2406.02976v1", "repo": "null"}}