{"2410.22077": {"publish_time": "2024-10-29", "title": "Mapping the Neuro-Symbolic AI Landscape by Architectures: A Handbook on Augmenting Deep Learning Through Symbolic Reasoning", "paper_summary": "Integrating symbolic techniques with statistical ones is a long-standing\nproblem in artificial intelligence. The motivation is that the strengths of\neither area match the weaknesses of the other, and $\\unicode{x2013}$ by\ncombining the two $\\unicode{x2013}$ the weaknesses of either method can be\nlimited. Neuro-symbolic AI focuses on this integration where the statistical\nmethods are in particular neural networks. In recent years, there has been\nsignificant progress in this research field, where neuro-symbolic systems\noutperformed logical or neural models alone. Yet, neuro-symbolic AI is,\ncomparatively speaking, still in its infancy and has not been widely adopted by\nmachine learning practitioners. In this survey, we present the first mapping of\nneuro-symbolic techniques into families of frameworks based on their\narchitectures, with several benefits: Firstly, it allows us to link different\nstrengths of frameworks to their respective architectures. Secondly, it allows\nus to illustrate how engineers can augment their neural networks while treating\nthe symbolic methods as black-boxes. Thirdly, it allows us to map most of the\nfield so that future researchers can identify closely related frameworks.", "paper_summary_zh": "將符號技術與統計技術整合在一起，是人工智慧領域中長久以來的問題。動機在於，任一領域的優勢可以彌補另一領域的劣勢，而透過結合兩者，任一方法的劣勢都可以受到限制。神經符號 AI 專注於此整合，其中統計方法特別是神經網路。近年來，此研究領域有顯著進展，其中神經符號系統的表現優於邏輯或神經模型。然而，就比較而言，神經符號 AI 仍處於起步階段，尚未被機器學習從業人員廣泛採用。在此調查中，我們根據架構將神經符號技術首次對應到架構家族中，並帶來多項好處：首先，它讓我們得以將架構的不同優勢連結到其各自的架構。其次，它讓我們得以說明工程師如何擴充其神經網路，同時將符號方法視為黑盒子。第三，它讓我們得以對應大部分領域，以便未來的研究人員可以找出密切相關的架構。", "author": "Jonathan Feldstein et.al.", "authors": "Jonathan Feldstein, Paulius Dilkas, Vaishak Belle, Efthymia Tsamoura", "id": "2410.22077v1", "paper_url": "http://arxiv.org/abs/2410.22077v1", "repo": "null"}}