{"2501.04302": {"publish_time": "2025-01-08", "title": "H-MBA: Hierarchical MamBa Adaptation for Multi-Modal Video Understanding in Autonomous Driving", "paper_summary": "With the prevalence of Multimodal Large Language Models(MLLMs), autonomous\ndriving has encountered new opportunities and challenges. In particular,\nmulti-modal video understanding is critical to interactively analyze what will\nhappen in the procedure of autonomous driving. However, videos in such a\ndynamical scene that often contains complex spatial-temporal movements, which\nrestricts the generalization capacity of the existing MLLMs in this field. To\nbridge the gap, we propose a novel Hierarchical Mamba Adaptation (H-MBA)\nframework to fit the complicated motion changes in autonomous driving videos.\nSpecifically, our H-MBA consists of two distinct modules, including Context\nMamba (C-Mamba) and Query Mamba (Q-Mamba). First, C-Mamba contains various\ntypes of structure state space models, which can effectively capture\nmulti-granularity video context for different temporal resolutions. Second,\nQ-Mamba flexibly transforms the current frame as the learnable query, and\nattentively selects multi-granularity video context into query. Consequently,\nit can adaptively integrate all the video contexts of multi-scale temporal\nresolutions to enhance video understanding. Via a plug-and-play paradigm in\nMLLMs, our H-MBA shows the remarkable performance on multi-modal video tasks in\nautonomous driving, e.g., for risk object detection, it outperforms the\nprevious SOTA method with 5.5% mIoU improvement.", "paper_summary_zh": "隨著多模態大型語言模型 (MLLM) 的普及，自動駕駛迎來了新的機遇和挑戰。特別是，多模態影片理解對於互動式分析自動駕駛過程中將會發生的事情至關重要。然而，在這樣一個經常包含複雜時空移動的動態場景中的影片，限制了現有 MLLM 在這個領域中的泛化能力。為了彌合差距，我們提出了一個新穎的分層 Mamba 適應 (H-MBA) 框架，以適應自動駕駛影片中複雜的動作變化。具體來說，我們的 H-MBA 由兩個不同的模組組成，包括 Context Mamba (C-Mamba) 和 Query Mamba (Q-Mamba)。首先，C-Mamba 包含各種結構狀態空間模型，可以有效地捕捉不同時間解析度的多粒度影片內容。其次，Q-Mamba 靈活地將當前幀轉換為可學習的查詢，並專注於將多粒度影片內容選入查詢中。因此，它可以自適應地整合所有多尺度時間解析度的影片內容，以增強影片理解。透過 MLLM 中的即插即用範例，我們的 H-MBA 在自動駕駛中的多模態影片任務中展現了顯著的效能，例如，對於風險物體偵測，它優於先前的 SOTA 方法，mIoU 提升了 5.5%。", "author": "Siran Chen et.al.", "authors": "Siran Chen, Yuxiao Luo, Yue Ma, Yu Qiao, Yali Wang", "id": "2501.04302v1", "paper_url": "http://arxiv.org/abs/2501.04302v1", "repo": "null"}}