{"2408.06537": {"publish_time": "2024-08-13", "title": "Introducing the NewsPaLM MBR and QE Dataset: LLM-Generated High-Quality Parallel Data Outperforms Traditional Web-Crawled Data", "paper_summary": "Recent research in neural machine translation (NMT) has shown that training\non high-quality machine-generated data can outperform training on\nhuman-generated data. This work accompanies the first-ever release of a\nLLM-generated, MBR-decoded and QE-reranked dataset with both sentence-level and\nmulti-sentence examples. We perform extensive experiments to demonstrate the\nquality of our dataset in terms of its downstream impact on NMT model\nperformance. We find that training from scratch on our (machine-generated)\ndataset outperforms training on the (web-crawled) WMT'23 training dataset\n(which is 300 times larger), and also outperforms training on the top-quality\nsubset of the WMT'23 training dataset. We also find that performing\nself-distillation by finetuning the LLM which generated this dataset\noutperforms the LLM's strong few-shot baseline. These findings corroborate the\nquality of our dataset, and demonstrate the value of high-quality\nmachine-generated data in improving performance of NMT models.", "paper_summary_zh": "最近的神经机器翻译 (NMT) 研究表明，在高质量机器生成的数据上进行训练可以优于在人工生成的数据上进行训练。这项工作伴随着首次发布 LLM 生成的、MBR 解码的和 QE 重新排名的数据集，其中包含句子级和多句子示例。我们进行了广泛的实验，以展示我们数据集的质量，就其对 NMT 模型性能的下游影响而言。我们发现，从头开始在我们的（机器生成的）数据集上进行训练优于在（网络爬取的）WMT'23 训练数据集（大 300 倍）上进行训练，并且也优于在 WMT'23 训练数据集的顶级子集上进行训练。我们还发现，通过微调生成此数据集的 LLM 来执行自蒸馏优于 LLM 的强少数镜头基线。这些发现证实了我们数据集的质量，并展示了高质量机器生成数据在提高 NMT 模型性能方面的价值。", "author": "Mara Finkelstein et.al.", "authors": "Mara Finkelstein, David Vilar, Markus Freitag", "id": "2408.06537v1", "paper_url": "http://arxiv.org/abs/2408.06537v1", "repo": "null"}}