{"2408.05023": {"publish_time": "2024-08-09", "title": "Investigating a Benchmark for Training-set free Evaluation of Linguistic Capabilities in Machine Reading Comprehension", "paper_summary": "Performance of NLP systems is typically evaluated by collecting a large-scale\ndataset by means of crowd-sourcing to train a data-driven model and evaluate it\non a held-out portion of the data. This approach has been shown to suffer from\nspurious correlations and the lack of challenging examples that represent the\ndiversity of natural language. Instead, we examine a framework for evaluating\noptimised models in training-set free setting on synthetically generated\nchallenge sets. We find that despite the simplicity of the generation method,\nthe data can compete with crowd-sourced datasets with regard to naturalness and\nlexical diversity for the purpose of evaluating the linguistic capabilities of\nMRC models. We conduct further experiments and show that state-of-the-art\nlanguage model-based MRC systems can learn to succeed on the challenge set\ncorrectly, although, without capturing the general notion of the evaluated\nphenomenon.", "paper_summary_zh": "NLP 系統的效能通常透過群眾外包的方式收集大型資料集來訓練資料驅動模型，並在資料的保留部分進行評估。此方法已被證明會受到虛假關聯和缺乏代表自然語言多樣性的挑戰範例影響。我們改為探討一個在訓練集自由設定中，使用合成產生的挑戰集來評估最佳化模型的架構。我們發現，儘管生成方法很簡單，但資料在自然性和詞彙多樣性方面，仍可與群眾外包的資料集相媲美，以評估 MRC 模型的語言能力。我們進一步進行實驗，並證明了最先進的基於語言模型的 MRC 系統，可以在挑戰集中正確學習成功，儘管沒有捕捉到所評估現象的一般概念。", "author": "Viktor Schlegel et.al.", "authors": "Viktor Schlegel, Goran Nenadic, Riza Batista-Navarro", "id": "2408.05023v1", "paper_url": "http://arxiv.org/abs/2408.05023v1", "repo": "null"}}