{"2405.15739": {"publish_time": "2024-05-24", "title": "Large Language Models Reflect Human Citation Patterns with a Heightened Citation Bias", "paper_summary": "Citation practices are crucial in shaping the structure of scientific\nknowledge, yet they are often influenced by contemporary norms and biases. The\nemergence of Large Language Models (LLMs) like GPT-4 introduces a new dynamic\nto these practices. Interestingly, the characteristics and potential biases of\nreferences recommended by LLMs that entirely rely on their parametric\nknowledge, and not on search or retrieval-augmented generation, remain\nunexplored. Here, we analyze these characteristics in an experiment using a\ndataset of 166 papers from AAAI, NeurIPS, ICML, and ICLR, published after\nGPT-4's knowledge cut-off date, encompassing 3,066 references in total. In our\nexperiment, GPT-4 was tasked with suggesting scholarly references for the\nanonymized in-text citations within these papers. Our findings reveal a\nremarkable similarity between human and LLM citation patterns, but with a more\npronounced high citation bias in GPT-4, which persists even after controlling\nfor publication year, title length, number of authors, and venue. Additionally,\nwe observe a large consistency between the characteristics of GPT-4's existing\nand non-existent generated references, indicating the model's internalization\nof citation patterns. By analyzing citation graphs, we show that the references\nrecommended by GPT-4 are embedded in the relevant citation context, suggesting\nan even deeper conceptual internalization of the citation networks. While LLMs\ncan aid in citation generation, they may also amplify existing biases and\nintroduce new ones, potentially skewing scientific knowledge dissemination. Our\nresults underscore the need for identifying the model's biases and for\ndeveloping balanced methods to interact with LLMs in general.", "paper_summary_zh": "<paragraph>引文實務對於形塑科學知識的結構至關重要，但常常受到當代規範和偏見的影響。大型語言模型 (LLM) 如 GPT-4 的出現為這些實務帶來了新的動態。有趣的是，完全依賴參數化知識而非搜尋或檢索增強生成，由 LLM 推薦的參考文獻的特性和潛在偏見仍然未經探究。在此，我們使用一個包含來自 AAAI、NeurIPS、ICML 和 ICLR 的 166 篇論文的資料集，在 GPT-4 的知識截止日期後發布，總計包含 3,066 篇參考文獻，對這些特性進行分析。在我們的實驗中，GPT-4 的任務是為這些論文中的匿名內文引文建議學術參考文獻。我們的研究結果顯示，人類和 LLM 的引文模式有顯著的相似性，但 GPT-4 的高引文偏見更為顯著，即使在控制了出版年份、標題長度、作者數量和場地後，這種情況仍然存在。此外，我們觀察到 GPT-4 現有和不存在的生成參考文獻的特性之間有很大的相容性，這表明模型內化了引文模式。透過分析引文圖，我們顯示 GPT-4 推薦的參考文獻嵌入在相關的引文脈絡中，這表明對引文網路有更深入的概念內化。雖然 LLM 可以協助生成引文，但它們也可能放大現有的偏見並引入新的偏見，潛在地扭曲科學知識的傳播。我們的結果強調了識別模型偏見和發展平衡的方法以與 LLM 進行互動的需求。</paragraph>", "author": "Andres Algaba et.al.", "authors": "Andres Algaba, Carmen Mazijn, Vincent Holst, Floriano Tori, Sylvia Wenmackers, Vincent Ginis", "id": "2405.15739v1", "paper_url": "http://arxiv.org/abs/2405.15739v1", "repo": "null"}}