{"2409.03402": {"publish_time": "2024-09-05", "title": "Game On: Towards Language Models as RL Experimenters", "paper_summary": "We propose an agent architecture that automates parts of the common\nreinforcement learning experiment workflow, to enable automated mastery of\ncontrol domains for embodied agents. To do so, it leverages a VLM to perform\nsome of the capabilities normally required of a human experimenter, including\nthe monitoring and analysis of experiment progress, the proposition of new\ntasks based on past successes and failures of the agent, decomposing tasks into\na sequence of subtasks (skills), and retrieval of the skill to execute -\nenabling our system to build automated curricula for learning. We believe this\nis one of the first proposals for a system that leverages a VLM throughout the\nfull experiment cycle of reinforcement learning. We provide a first prototype\nof this system, and examine the feasibility of current models and techniques\nfor the desired level of automation. For this, we use a standard Gemini model,\nwithout additional fine-tuning, to provide a curriculum of skills to a\nlanguage-conditioned Actor-Critic algorithm, in order to steer data collection\nso as to aid learning new skills. Data collected in this way is shown to be\nuseful for learning and iteratively improving control policies in a robotics\ndomain. Additional examination of the ability of the system to build a growing\nlibrary of skills, and to judge the progress of the training of those skills,\nalso shows promising results, suggesting that the proposed architecture\nprovides a potential recipe for fully automated mastery of tasks and domains\nfor embodied agents.", "paper_summary_zh": "我們提出了一種代理架構，該架構自動化了常見的強化學習實驗工作流程的部分，以實現對具身代理的控制領域的自動化掌握。為此，它利用 VLM 來執行通常人類實驗者所需的部分能力，包括監控和分析實驗進度、根據代理過去的成功和失敗提出新任務、將任務分解為一系列子任務（技能），以及檢索要執行的技能 - 使我們的系統能夠建立自動化的學習課程。我們相信這是第一個提出在強化學習的整個實驗週期中利用 VLM 的系統建議之一。我們提供了這個系統的第一個原型，並檢查了當前模型和技術對於所需自動化級別的可行性。為此，我們使用標準的 Gemini 模型，沒有額外的微調，為語言條件的 Actor-Critic 演算法提供技能課程，以便引導數據收集，以幫助學習新技能。以這種方式收集的數據被證明對於學習和反覆改進機器人領域的控制策略很有用。對系統構建不斷增長的技能庫以及判斷這些技能訓練進度的能力的進一步檢查也顯示出有希望的結果，表明所提出的架構為具身代理的任務和領域的完全自動化掌握提供了一個潛在的途徑。", "author": "Jingwei Zhang et.al.", "authors": "Jingwei Zhang, Thomas Lampe, Abbas Abdolmaleki, Jost Tobias Springenberg, Martin Riedmiller", "id": "2409.03402v1", "paper_url": "http://arxiv.org/abs/2409.03402v1", "repo": "null"}}