{"2408.08215": {"publish_time": "2024-08-15", "title": "Moving Healthcare AI-Support Systems for Visually Detectable Diseases onto Constrained Devices", "paper_summary": "Image classification usually requires connectivity and access to the cloud\nwhich is often limited in many parts of the world, including hard to reach\nrural areas. TinyML aims to solve this problem by hosting AI assistants on\nconstrained devices, eliminating connectivity issues by processing data within\nthe device itself, without internet or cloud access. This pilot study explores\nthe use of tinyML to provide healthcare support with low spec devices in low\nconnectivity environments, focusing on diagnosis of skin diseases and the\nethical use of AI assistants in a healthcare setting. To investigate this,\n10,000 images of skin lesions were used to train a model for classifying\nvisually detectable diseases (VDDs). The model weights were then offloaded to a\nRaspberry Pi with a webcam attached, to be used for the classification of skin\nlesions without internet access. It was found that the developed prototype\nachieved a test accuracy of 78% and a test loss of 1.08.", "paper_summary_zh": "影像分類通常需要連線和存取雲端，而這在世界許多地區，包括難以抵達的鄉村地區，通常受到限制。TinyML 旨在透過在受限裝置上架設 AI 助理，在裝置內處理資料，無需網路或雲端存取，來解決這個問題。這項試驗研究探討使用 TinyML 在連線不良的環境中提供低規格裝置的醫療保健支援，重點在皮膚疾病診斷和醫療環境中 AI 助理的道德使用。為此，我們使用 10,000 張皮膚病灶影像訓練一個用於分類可視可偵測疾病 (VDD) 的模型。然後將模型權重卸載到配備網路攝影機的 Raspberry Pi，用於在沒有網路存取的情況下分類皮膚病灶。結果發現，已開發的原型達到 78% 的測試準確度和 1.08 的測試損失。", "author": "Tess Watt et.al.", "authors": "Tess Watt, Christos Chrysoulas, Peter J Barclay", "id": "2408.08215v1", "paper_url": "http://arxiv.org/abs/2408.08215v1", "repo": "null"}}