{"2411.06120": {"publish_time": "2024-11-09", "title": "Evaluating the Propensity of Generative AI for Producing Disinformation During an Election Cycle", "paper_summary": "Generative Artificial Intelligence offers a powerful tool for adversaries who\nwish to engage in influence operations, such as the Chinese Spamouflage\noperation and the Russian Internet Research Agency effort that both sought to\ninterfere with recent US election cycles. Therefore, this study seeks to\ninvestigate the propensity of current Generative AI models for producing\nharmful disinformation during an election cycle. The probability that different\nGenerative AI models produced disinformation when given adversarial prompts was\nevaluated, in addition the associated harm. This allows for the expected harm\nfor each model to be computed and it was discovered that Copilot and Gemini\ntied for the overall safest performance by realizing the lowest expected harm,\nwhile GPT-4o produced the greatest rates of harmful disinformation, resulting\nin much higher expected harm scores. The impact of disinformation category was\nalso investigated and Gemini was safest within the political category of\ndisinformation, while Copilot was safest for topics related to health.\nMoreover, characteristics of adversarial roles were discovered that led to\ngreater expected harm across all models. Finally, classification models were\ndeveloped that predicted disinformation production based on the conditions\nconsidered in this study, which offers insight into factors important for\npredicting disinformation production. Based on all of these insights,\nrecommendations are provided that seek to mitigate factors that lead to harmful\ndisinformation being produced by Generative AI models. It is hoped that\ndevelopers will use these insights to improve future models.", "paper_summary_zh": "生成式人工智慧為有意從事影響力操作的敵對者提供強大的工具，例如中國的垃圾郵件偽裝行動和俄羅斯的網路研究機構努力，這兩者都試圖干預最近的美國選舉週期。因此，本研究旨在調查當前生成式 AI 模型在選舉週期中產生有害錯誤訊息的傾向。除了相關危害之外，還評估了在給定對抗提示時不同生成式 AI 模型產生錯誤訊息的可能性。這允許計算每個模型的預期危害，並且發現 Copilot 和 Gemini 在實現最低預期危害方面並列為最安全的整體效能，而 GPT-4o 產生了最高比率的有害錯誤訊息，導致預期危害分數高得多。還調查了錯誤訊息類別的影響，並且 Gemini 在政治類別的錯誤訊息中是最安全的，而 Copilot 在與健康相關的主題中最安全。此外，發現了對抗角色的特性，導致所有模型的預期危害更大。最後，開發了分類模型，根據本研究中考慮的條件預測錯誤訊息產生，這提供了對預測錯誤訊息產生很重要的因素的見解。根據所有這些見解，提供了建議，旨在減輕導致生成式 AI 模型產生有害錯誤訊息的因素。希望開發人員將使用這些見解來改進未來的模型。", "author": "Erik J Schlicht et.al.", "authors": "Erik J Schlicht", "id": "2411.06120v1", "paper_url": "http://arxiv.org/abs/2411.06120v1", "repo": "null"}}