{"2405.05583": {"publish_time": "2024-05-09", "title": "OpenFactCheck: A Unified Framework for Factuality Evaluation of LLMs", "paper_summary": "The increased use of large language models (LLMs) across a variety of\nreal-world applications calls for mechanisms to verify the factual accuracy of\ntheir outputs. Difficulties lie in assessing the factuality of free-form\nresponses in open domains. Also, different papers use disparate evaluation\nbenchmarks and measurements, which renders them hard to compare and hampers\nfuture progress. To mitigate these issues, we propose OpenFactCheck, a unified\nfactuality evaluation framework for LLMs. OpenFactCheck consists of three\nmodules: (i) CUSTCHECKER allows users to easily customize an automatic\nfact-checker and verify the factual correctness of documents and claims, (ii)\nLLMEVAL, a unified evaluation framework assesses LLM's factuality ability from\nvarious perspectives fairly, and (iii) CHECKEREVAL is an extensible solution\nfor gauging the reliability of automatic fact-checkers' verification results\nusing human-annotated datasets. OpenFactCheck is publicly released at\nhttps://github.com/yuxiaw/OpenFactCheck.", "paper_summary_zh": "隨著大型語言模型 (LLM) 在各種實際應用中的使用日益增加，需要有驗證其輸出事實準確性的機制。困難在於評估開放領域中自由形式回應的事實性。此外，不同的論文使用不同的評估基準和測量標準，這使得它們難以比較並阻礙未來的進展。為了減輕這些問題，我們提出了 OpenFactCheck，一個統一的 LLM 事實性評估框架。OpenFactCheck 包含三個模組：(i) CUSTCHECKER 使用戶可以輕鬆自訂自動事實查核器並驗證文件和說法的真實性，(ii) LLMEVAL，一個統一的評估框架從各個角度公平地評估 LLM 的事實性能力，以及 (iii) CHECKEREVAL 是一個可擴充的解決方案，用於使用人工標註的資料集來評估自動事實查核器驗證結果的可靠性。OpenFactCheck 已在 https://github.com/yuxiaw/OpenFactCheck 公開發布。", "author": "Yuxia Wang et.al.", "authors": "Yuxia Wang, Minghan Wang, Hasan Iqbal, Georgi Georgiev, Jiahui Geng, Preslav Nakov", "id": "2405.05583v1", "paper_url": "http://arxiv.org/abs/2405.05583v1", "repo": "https://github.com/yuxiaw/openfactcheck"}}