{"2501.17041": {"publish_time": "2025-01-28", "title": "Benchmarking Quantum Convolutional Neural Networks for Signal Classification in Simulated Gamma-Ray Burst Detection", "paper_summary": "This study evaluates the use of Quantum Convolutional Neural Networks (QCNNs)\nfor identifying signals resembling Gamma-Ray Bursts (GRBs) within simulated\nastrophysical datasets in the form of light curves. The task addressed here\nfocuses on distinguishing GRB-like signals from background noise in simulated\nCherenkov Telescope Array Observatory (CTAO) data, the next-generation\nastrophysical observatory for very high-energy gamma-ray science. QCNNs, a\nquantum counterpart of classical Convolutional Neural Networks (CNNs), leverage\nquantum principles to process and analyze high-dimensional data efficiently. We\nimplemented a hybrid quantum-classical machine learning technique using the\nQiskit framework, with the QCNNs trained on a quantum simulator. Several QCNN\narchitectures were tested, employing different encoding methods such as Data\nReuploading and Amplitude encoding. Key findings include that QCNNs achieved\naccuracy comparable to classical CNNs, often surpassing 90\\%, while using fewer\nparameters, potentially leading to more efficient models in terms of\ncomputational resources. A benchmark study further examined how hyperparameters\nlike the number of qubits and encoding methods affected performance, with more\nqubits and advanced encoding methods generally enhancing accuracy but\nincreasing complexity. QCNNs showed robust performance on time-series datasets,\nsuccessfully detecting GRB signals with high precision. The research is a\npioneering effort in applying QCNNs to astrophysics, offering insights into\ntheir potential and limitations. This work sets the stage for future\ninvestigations to fully realize the advantages of QCNNs in astrophysical data\nanalysis.", "paper_summary_zh": "本研究評估量子卷積神經網路 (QCNN) 在模擬光曲線形式的天體物理資料集中識別類似伽瑪射線暴 (GRB) 信號的用途。此處處理的任務專注於區分模擬切倫科夫望遠鏡陣列天文台 (CTAO) 資料中類 GRB 信號與背景雜訊，CTAO 是下一代極高能伽瑪射線科學的天體物理天文台。QCNN 是經典卷積神經網路 (CNN) 的量子對應物，利用量子原理有效率地處理和分析高維度資料。我們使用 Qiskit 架構實作了混合量子-經典機器學習技術，其中 QCNN 在量子模擬器上受訓。測試了數種 QCNN 架構，採用了不同的編碼方法，例如資料重新上傳和振幅編碼。主要發現包括 QCNN 達到了與經典 CNN 相當的準確度，通常超過 90%，同時使用較少的參數，這可能在計算資源方面導致更有效的模型。基準研究進一步探討了超參數（例如量子位元數和編碼方法）如何影響效能，通常更多量子位元和進階編碼方法會提高準確度，但也會增加複雜度。QCNN 在時間序列資料集上展現了強健的效能，成功地以高準確度偵測 GRB 信號。這項研究是將 QCNN 應用於天體物理學的先驅性努力，提供了對其潛力和限制的見解。這項工作為未來的研究奠定了基礎，以充分發揮 QCNN 在天體物理資料分析中的優勢。", "author": "Farida Farsian et.al.", "authors": "Farida Farsian, Nicolò Parmiggiani, Alessandro Rizzo, Gabriele Panebianco, Andrea Bulgarelli, Francesco Schillirò, Carlo Burigana, Vincenzo Cardone, Luca Cappelli, Massimo Meneghetti, Giuseppe Murante, Giuseppe Sarracino, Roberto Scaramella, Vincenzo Testa, Tiziana Trombetti", "id": "2501.17041v1", "paper_url": "http://arxiv.org/abs/2501.17041v1", "repo": "null"}}