{"2408.09757": {"publish_time": "2024-08-19", "title": "Strategic Demonstration Selection for Improved Fairness in LLM In-Context Learning", "paper_summary": "Recent studies highlight the effectiveness of using in-context learning (ICL)\nto steer large language models (LLMs) in processing tabular data, a challenging\ntask given the structured nature of such data. Despite advancements in\nperformance, the fairness implications of these methods are less understood.\nThis study investigates how varying demonstrations within ICL prompts influence\nthe fairness outcomes of LLMs. Our findings reveal that deliberately including\nminority group samples in prompts significantly boosts fairness without\nsacrificing predictive accuracy. Further experiments demonstrate that the\nproportion of minority to majority samples in demonstrations affects the\ntrade-off between fairness and prediction accuracy. Based on these insights, we\nintroduce a mitigation technique that employs clustering and evolutionary\nstrategies to curate a diverse and representative sample set from the training\ndata. This approach aims to enhance both predictive performance and fairness in\nICL applications. Experimental results validate that our proposed method\ndramatically improves fairness across various metrics, showing its efficacy in\nreal-world scenarios.", "paper_summary_zh": "最近的研究強調了在脈絡學習 (ICL) 中使用大型語言模型 (LLM) 來處理表格資料的效能，這是一個具有挑戰性的任務，因為此類資料具有結構化的性質。儘管效能有所進步，但這些方法的公平性影響卻鮮為人知。本研究探討了 ICL 提示中不同的示範如何影響 LLM 的公平性結果。我們的研究結果顯示，在提示中刻意包含少數群體樣本會顯著提升公平性，而不會犧牲預測準確性。進一步的實驗表明，示範中少數群體與多數群體樣本的比例會影響公平性和預測準確性之間的權衡。根據這些見解，我們引入了一種緩解技術，它採用聚類和演化策略從訓練資料中策劃一個多元且具代表性的樣本集。這種方法旨在提升 ICL 應用中的預測效能和公平性。實驗結果驗證了我們提出的方法在各種指標上大幅提升了公平性，顯示其在實際場景中的效能。", "author": "Jingyu Hu et.al.", "authors": "Jingyu Hu, Weiru Liu, Mengnan Du", "id": "2408.09757v1", "paper_url": "http://arxiv.org/abs/2408.09757v1", "repo": "null"}}