{"2501.18324": {"publish_time": "2025-01-30", "title": "A Video-grounded Dialogue Dataset and Metric for Event-driven Activities", "paper_summary": "This paper presents VDAct, a dataset for a Video-grounded Dialogue on\nEvent-driven Activities, alongside VDEval, a session-based context evaluation\nmetric specially designed for the task. Unlike existing datasets, VDAct\nincludes longer and more complex video sequences that depict a variety of\nevent-driven activities that require advanced contextual understanding for\naccurate response generation. The dataset comprises 3,000 dialogues with over\n30,000 question-and-answer pairs, derived from 1,000 videos with diverse\nactivity scenarios. VDAct displays a notably challenging characteristic due to\nits broad spectrum of activity scenarios and wide range of question types.\nEmpirical studies on state-of-the-art vision foundation models highlight their\nlimitations in addressing certain question types on our dataset. Furthermore,\nVDEval, which integrates dialogue session history and video content summaries\nextracted from our supplementary Knowledge Graphs to evaluate individual\nresponses, demonstrates a significantly higher correlation with human\nassessments on the VDAct dataset than existing evaluation metrics that rely\nsolely on the context of single dialogue turns.", "paper_summary_zh": "本文提出了 VDAct，一个用于事件驱动活动中的视频基础对话的数据集，以及 VDEval，一种专门为该任务设计的基于会话的上下文评估指标。与现有数据集不同，VDAct 包含更长且更复杂的视频序列，这些序列描述了各种事件驱动的活动，这些活动需要高级上下文理解才能生成准确的响应。该数据集包含 3,000 个对话，其中包含超过 30,000 个问答对，这些对话来自 1,000 个具有不同活动场景的视频。由于其广泛的活动场景和广泛的问题类型，VDAct 表现出显着的挑战性特征。对最先进的视觉基础模型的实证研究突出了它们在解决我们数据集中的某些问题类型方面的局限性。此外，VDEval 集成了对话会话历史记录和从我们的补充知识图谱中提取的视频内容摘要，以评估各个响应，与仅依赖于单个对话轮次上下文的现有评估指标相比，它与 VDAct 数据集上的人类评估具有显着更高的相关性。", "author": "Wiradee Imrattanatrai et.al.", "authors": "Wiradee Imrattanatrai, Masaki Asada, Kimihiro Hasegawa, Zhi-Qi Cheng, Ken Fukuda, Teruko Mitamura", "id": "2501.18324v1", "paper_url": "http://arxiv.org/abs/2501.18324v1", "repo": "null"}}