{"2501.07317": {"publish_time": "2025-01-13", "title": "Evaluation of Artificial Intelligence Methods for Lead Time Prediction in Non-Cycled Areas of Automotive Production", "paper_summary": "The present study examines the effectiveness of applying Artificial\nIntelligence methods in an automotive production environment to predict unknown\nlead times in a non-cycle-controlled production area. Data structures are\nanalyzed to identify contextual features and then preprocessed using one-hot\nencoding. Methods selection focuses on supervised machine learning techniques.\nIn supervised learning methods, regression and classification methods are\nevaluated. Continuous regression based on target size distribution is not\nfeasible. Classification methods analysis shows that Ensemble Learning and\nSupport Vector Machines are the most suitable. Preliminary study results\nindicate that gradient boosting algorithms LightGBM, XGBoost, and CatBoost\nyield the best results. After further testing and extensive hyperparameter\noptimization, the final method choice is the LightGBM algorithm. Depending on\nfeature availability and prediction interval granularity, relative prediction\naccuracies of up to 90% can be achieved. Further tests highlight the importance\nof periodic retraining of AI models to accurately represent complex production\nprocesses using the database. The research demonstrates that AI methods can be\neffectively applied to highly variable production data, adding business value\nby providing an additional metric for various control tasks while outperforming\ncurrent non AI-based systems.", "paper_summary_zh": "本研究探討了在汽車生產環境中應用人工智慧方法的有效性，以預測非循環控制生產區域中未知的前置時間。分析數據結構以識別情境特徵，然後使用獨熱編碼進行預處理。方法選擇著重於監督式機器學習技術。在監督式學習方法中，評估回歸和分類方法。基於目標大小分佈的連續回歸不可行。分類方法分析表明，集成學習和支持向量機是最合適的。初步研究結果表明，梯度提升演算法 LightGBM、XGBoost 和 CatBoost 產生了最佳結果。經過進一步測試和廣泛的超參數最佳化後，最終方法選擇是 LightGBM 演算法。根據特徵可用性和預測區間粒度，可以實現高達 90% 的相對預測準確度。進一步的測試強調了定期重新訓練 AI 模型以準確表示使用資料庫的複雜生產流程的重要性。研究表明，AI 方法可以有效地應用於高度變化的生產資料，透過提供各種控制任務的額外指標，同時優於當前非 AI 系統，從而增加業務價值。", "author": "Cornelius Hake et.al.", "authors": "Cornelius Hake, Jonas Weigele, Frederik Reichert, Christian Friedrich", "id": "2501.07317v1", "paper_url": "http://arxiv.org/abs/2501.07317v1", "repo": "null"}}