{"2409.16635": {"publish_time": "2024-09-25", "title": "Judgment of Thoughts: Courtroom of the Binary Logical Reasoning in Large Language Models", "paper_summary": "This paper proposes a novel prompt engineering technique called Judgment of\nThought (JoT) that is specifically tailored for binary logical reasoning tasks.\nJoT employs three roles$\\unicode{x2014}$lawyer, prosecutor, and\njudge$\\unicode{x2014}$to facilitate more reliable and accurate reasoning by the\nmodel. In this framework, the judge utilizes a high$\\unicode{x2010}$level\nmodel, while the lawyer and prosecutor utilize low$\\unicode{x2010}$level\nmodels. This structure helps the judge better understand the responses from\nboth the lawyer and prosecutor, enabling a more accurate judgment. Experimental\nresults on large language model (LLM) benchmark datasets, such as BigBenchHard\nand Winogrande, demonstrate that JoT outperforms existing methods, including\nChain of Thought (CoT) and Self$\\unicode{x2010}$Consistency (SC), in binary\nlogical reasoning tasks. Additionally, in real$\\unicode{x2010}$world tasks,\nsuch as Fake News Detection and SMS Spam Detection, JoT shows comparable or\nimproved performance compared to existing techniques. JoT significantly\nenhances the accuracy and reliability of models in binary reasoning tasks and\nshow potential for practical applicability across various domains. Future\nresearch should aim to further broaden the applicability of JoT and optimize\nits implementation for real$\\unicode{x2010}$world\nproblem$\\unicode{x2010}$solving.", "paper_summary_zh": "本文提出了一種名為「思考判斷」(JoT) 的新穎提示工程技術，專門針對二元邏輯推理任務而設計。\nJoT 採用了三種角色：律師、檢察官和法官，以促進模型更可靠、更準確的推理。在此架構中，法官使用高層級模型，而律師和檢察官則使用低層級模型。這種結構有助於法官更好地理解律師和檢察官的回應，從而做出更準確的判斷。在大型語言模型 (LLM) 基準數據集（例如 BigBenchHard 和 Winogrande）上的實驗結果表明，JoT 在二元邏輯推理任務中優於現有方法，包括思考鏈 (CoT) 和自我一致性 (SC)。此外，在現實世界任務中，例如假新聞檢測和簡訊垃圾郵件檢測，JoT 與現有技術相比表現相當或有所提升。JoT 大幅提升了模型在二元推理任務中的準確性和可靠性，並顯示出在各種領域中實際應用的潛力。未來的研究應旨在進一步擴展 JoT 的適用性，並針對現實世界的問題解決方案最佳化其實作。", "author": "Sungjune Park et.al.", "authors": "Sungjune Park, Daeseon Choi", "id": "2409.16635v1", "paper_url": "http://arxiv.org/abs/2409.16635v1", "repo": "null"}}