{"2502.03231": {"publish_time": "2025-02-05", "title": "The Other Side of the Coin: Unveiling the Downsides of Model Aggregation in Federated Learning from a Layer-peeled Perspective", "paper_summary": "In federated learning (FL), model aggregation is a critical step by which\nmultiple clients share their knowledge with one another. However, it is also\nwidely recognized that the aggregated model, when sent back to each client,\nperforms poorly on local data until after several rounds of local training.\nThis temporary performance drop can potentially slow down the convergence of\nthe FL model. Most research in FL regards this performance drop as an inherent\ncost of knowledge sharing among clients and does not give it special attention.\nWhile some studies directly focus on designing techniques to alleviate the\nissue, an in-depth investigation of the reasons behind this performance drop\nhas yet to be conducted.To address this gap, we conduct a layer-peeled analysis\nof model aggregation across various datasets and model architectures. Our\nfindings reveal that the performance drop can be attributed to two major\nconsequences of the aggregation process: (1) it disrupts feature variability\nsuppression in deep neural networks (DNNs), and (2) it weakens the coupling\nbetween features and subsequent parameters.Based on these findings, we propose\nseveral simple yet effective strategies to mitigate the negative impacts of\nmodel aggregation while still enjoying the benefit it brings. To the best of\nour knowledge, our work is the first to conduct a layer-peeled analysis of\nmodel aggregation, potentially paving the way for the development of more\neffective FL algorithms.", "paper_summary_zh": "在聯合學習 (FL) 中，模型聚合是一個關鍵步驟，多個客戶透過此步驟分享彼此的知識。然而，眾所周知，聚合模型在傳回給每個客戶時，在經過幾輪的本地訓練之前，在本地資料的表現不佳。這種暫時的效能下降可能會減緩 FL 模型的收斂速度。FL 中的大部分研究將此效能下降視為客戶間知識共享的固有成本，並沒有特別關注它。雖然有些研究直接專注於設計技術來緩解此問題，但對於效能下降背後原因的深入調查尚未進行。為了解決這個差距，我們對跨各種資料集和模型架構的模型聚合進行了逐層分析。我們的研究結果顯示，效能下降可歸因於聚合過程的兩個主要後果：(1) 它會中斷深度神經網路 (DNN) 中的特徵變異抑制，以及 (2) 它會削弱特徵與後續參數之間的耦合。根據這些發現，我們提出了幾個簡單但有效的策略，以減輕模型聚合的負面影響，同時仍享受它帶來的優點。據我們所知，我們的工作是第一個對模型聚合進行逐層分析，這可能會為開發更有效的 FL 演算法鋪路。", "author": "Guogang Zhu et.al.", "authors": "Guogang Zhu, Xuefeng Liu, Jianwei Niu, Shaojie Tang, Xinghao Wu", "id": "2502.03231v1", "paper_url": "http://arxiv.org/abs/2502.03231v1", "repo": "null"}}