{"2406.03009": {"publish_time": "2024-06-05", "title": "Unveiling Selection Biases: Exploring Order and Token Sensitivity in Large Language Models", "paper_summary": "In this paper, we investigate the phenomena of \"selection biases\" in Large\nLanguage Models (LLMs), focusing on problems where models are tasked with\nchoosing the optimal option from an ordered sequence. We delve into biases\nrelated to option order and token usage, which significantly impact LLMs'\ndecision-making processes. We also quantify the impact of these biases through\nan extensive empirical analysis across multiple models and tasks. Furthermore,\nwe propose mitigation strategies to enhance model performance. Our key\ncontributions are threefold: 1) Precisely quantifying the influence of option\norder and token on LLMs, 2) Developing strategies to mitigate the impact of\ntoken and order sensitivity to enhance robustness, and 3) Offering a detailed\nanalysis of sensitivity across models and tasks, which informs the creation of\nmore stable and reliable LLM applications for selection problems.", "paper_summary_zh": "在本文中，我們探討大型語言模型 (LLM) 中的「選擇偏差」現象，重點關注模型從有序序列中選擇最佳選項的問題。我們深入探討與選項順序和代碼使用相關的偏差，這些偏差會顯著影響 LLM 的決策過程。我們還通過跨多個模型和任務的廣泛實證分析量化了這些偏差的影響。此外，我們提出了減輕模型效能的策略。我們的關鍵貢獻有三方面：1) 精確量化選項順序和代碼對 LLM 的影響，2) 開發策略以減輕代碼和順序敏感性的影響，以增強穩健性，以及 3) 提供跨模型和任務的詳細敏感性分析，這有助於為選擇問題建立更穩定和可靠的 LLM 應用程式。", "author": "Sheng-Lun Wei et.al.", "authors": "Sheng-Lun Wei, Cheng-Kuang Wu, Hen-Hsen Huang, Hsin-Hsi Chen", "id": "2406.03009v1", "paper_url": "http://arxiv.org/abs/2406.03009v1", "repo": "null"}}