{"2501.03152": {"publish_time": "2025-01-06", "title": "The Scaling Law for LoRA Base on Mutual Information Upper Bound", "paper_summary": "LoRA (Low-Rank Adaptation) is a widely used model fine-tuning method. In\nfine-tuning, the law among model performance, model parameters, and data\ncomplexity has been a focal issue in the field. Existing methods often leverage\nexternal metrics (such as cross-entropy or perplexity) to evaluate model\nperformance. In the fine-tuning process for large models, two types of\nknowledge are typically involved: the frozen, general knowledge acquired by the\nmodel during pre-training and the new knowledge learned through the LoRA module\nfrom the current data. Generally, the less LoRA's learned knowledge relies on\nthe large model, the more it captures the specific knowledge of new data,\nthereby enhancing its adaptability to new tasks. However, external metrics do\nnot readily capture the dependency relationship between these two types of\nknowledge. Therefore, we designed an internal metric based on the Mutual\nInformation Upper Bound (MIUB) theory to investigate the scaling law of\nlarge-model LoRA fine-tuning. In our experiments, we validated this approach on\nbenchmark datasets, using the Llama3-8B and Phi3-3B models. The results show\nthat the proposed MIUB metric aligns more accurately and stably with the\nscaling law of LoRA fine-tuning compared to cross-entropy and perplexity.", "paper_summary_zh": "LoRA（低秩適應）是一種廣泛使用的模型微調方法。在微調中，模型效能、模型參數和資料複雜度之間的定律一直是該領域的焦點議題。現有方法通常利用外部指標（例如交叉熵或困惑度）來評估模型效能。在大型模型的微調過程中，通常涉及兩種知識：模型在預訓練期間獲得的凍結式一般知識，以及透過 LoRA 模組從當前資料中學習到的新知識。一般來說，LoRA 學習到的知識越不依賴於大型模型，它擷取新資料的特定知識就越多，從而增強其對新任務的適應性。然而，外部指標並不能輕易擷取這兩種知識之間的依賴關係。因此，我們根據互資訊上限 (MIUB) 理論設計了一個內部指標，來探討大型模型 LoRA 微調的規模定律。在我們的實驗中，我們使用 Llama3-8B 和 Phi3-3B 模型，在基準資料集上驗證了這種方法。結果表明，與交叉熵和困惑度相比，所提出的 MIUB 指標與 LoRA 微調的規模定律更準確且穩定地對齊。", "author": "Jing Zhang et.al.", "authors": "Jing Zhang, Hui Gao, Peng Zhang, Shuzhen Sun, Chang Yang, Yuexian Hou", "id": "2501.03152v1", "paper_url": "http://arxiv.org/abs/2501.03152v1", "repo": "null"}}