{"2501.18867": {"publish_time": "2025-01-31", "title": "UP-VLA: A Unified Understanding and Prediction Model for Embodied Agent", "paper_summary": "Recent advancements in Vision-Language-Action (VLA) models have leveraged\npre-trained Vision-Language Models (VLMs) to improve the generalization\ncapabilities. VLMs, typically pre-trained on vision-language understanding\ntasks, provide rich semantic knowledge and reasoning abilities. However, prior\nresearch has shown that VLMs often focus on high-level semantic content and\nneglect low-level features, limiting their ability to capture detailed spatial\ninformation and understand physical dynamics. These aspects, which are crucial\nfor embodied control tasks, remain underexplored in existing pre-training\nparadigms. In this paper, we investigate the training paradigm for VLAs, and\nintroduce \\textbf{UP-VLA}, a \\textbf{U}nified VLA model training with both\nmulti-modal \\textbf{U}nderstanding and future \\textbf{P}rediction objectives,\nenhancing both high-level semantic comprehension and low-level spatial\nunderstanding. Experimental results show that UP-VLA achieves a 33% improvement\non the Calvin ABC-D benchmark compared to the previous state-of-the-art method.\nAdditionally, UP-VLA demonstrates improved success rates in real-world\nmanipulation tasks, particularly those requiring precise spatial information.", "paper_summary_zh": "近期在視覺語言動作 (VLA) 模型的進展中，利用預先訓練好的視覺語言模型 (VLM) 來提升概化能力。VLM 通常預先訓練於視覺語言理解任務，提供豐富的語義知識和推理能力。然而，先前的研究顯示，VLM 通常專注於高層級的語義內容，而忽略低層級特徵，限制了其擷取詳細空間資訊和理解物理動態的能力。這些面向對於具體控制任務至關重要，但在現有的預先訓練範例中仍未獲得充分探討。在本文中，我們探討 VLA 的訓練範例，並介紹 UP-VLA，一個統一的 VLA 模型訓練，同時具備多模態理解和未來預測目標，提升高層級語義理解和低層級空間理解。實驗結果顯示，與先前的最先進方法相比，UP-VLA 在 Calvin ABC-D 基準上獲得了 33% 的提升。此外，UP-VLA 在真實世界操作任務中展現出更高的成功率，特別是那些需要精確空間資訊的任務。", "author": "Jianke Zhang et.al.", "authors": "Jianke Zhang, Yanjiang Guo, Yucheng Hu, Xiaoyu Chen, Xiang Zhu, Jianyu Chen", "id": "2501.18867v2", "paper_url": "http://arxiv.org/abs/2501.18867v2", "repo": "null"}}