{"2410.13828": {"publish_time": "2024-10-17", "title": "A Common Pitfall of Margin-based Language Model Alignment: Gradient Entanglement", "paper_summary": "Reinforcement Learning from Human Feedback (RLHF) has become the predominant\napproach for language model (LM) alignment. At its core, RLHF uses a\nmargin-based loss for preference optimization, specifying ideal LM behavior\nonly by the difference between preferred and dispreferred responses. In this\npaper, we identify a common pitfall of margin-based methods -- the\nunder-specification of ideal LM behavior on preferred and dispreferred\nresponses individually, which leads to two unintended consequences as the\nmargin increases: (1) The probability of dispreferred (e.g., unsafe) responses\nmay increase, resulting in potential safety alignment failures. (2) The\nprobability of preferred responses may decrease, even when those responses are\nideal. We demystify the reasons behind these problematic behaviors:\nmargin-based losses couple the change in the preferred probability to the\ngradient of the dispreferred one, and vice versa, often preventing the\npreferred probability from increasing while the dispreferred one decreases, and\nthus causing a synchronized increase or decrease in both probabilities. We term\nthis effect, inherent in margin-based objectives, gradient entanglement.\nFormally, we derive conditions for general margin-based alignment objectives\nunder which gradient entanglement becomes concerning: the inner product of the\ngradients of preferred and dispreferred log-probabilities is large relative to\nthe individual gradient norms. We theoretically investigate why such inner\nproducts can be large when aligning language models and empirically validate\nour findings. Empirical implications of our framework extend to explaining\nimportant differences in the training dynamics of various preference\noptimization algorithms, and suggesting potential algorithm designs to mitigate\nthe under-specification issue of margin-based methods and thereby improving\nlanguage model alignment.", "paper_summary_zh": "強化學習來自人類回饋 (RLHF) 已成為語言模型 (LM) 校準的主要方法。在核心部分，RLHF 使用基於邊界的損失進行偏好最佳化，僅透過偏好和非偏好回應之間的差異來指定理想的 LM 行為。在本文中，我們辨識出基於邊界方法的常見陷阱，也就是在偏好和非偏好回應中對理想 LM 行為的規格不足，這會隨著邊界增加而導致兩個意外的後果：(1) 非偏好（例如不安全）回應的機率可能會增加，導致潛在的安全校準失敗。(2) 偏好回應的機率可能會降低，即使那些回應是理想的。我們揭開這些問題行為背後的原因：基於邊界的損失將偏好機率的改變與非偏好機率的梯度結合，反之亦然，通常會阻止偏好機率增加，同時非偏好機率降低，從而導致兩個機率同步增加或降低。我們將這種固有於基於邊界的目標函數的效應稱為梯度糾纏。正式來說，我們推導出一般基於邊界的校準目標函數的條件，在該條件下梯度糾纏會令人擔憂：偏好和非偏好對數機率的梯度內積相對於個別梯度範數很大。我們在理論上探討為什麼在校準語言模型時這種內積會很大，並根據經驗驗證我們的發現。我們架構的經驗意義延伸到解釋各種偏好最佳化演算法訓練動態中的重要差異，並建議潛在的演算法設計以減輕基於邊界方法的規格不足問題，從而改善語言模型校準。", "author": "Hui Yuan et.al.", "authors": "Hui Yuan, Yifan Zeng, Yue Wu, Huazheng Wang, Mengdi Wang, Liu Leqi", "id": "2410.13828v1", "paper_url": "http://arxiv.org/abs/2410.13828v1", "repo": "null"}}