{"2411.11683": {"publish_time": "2024-11-18", "title": "TrojanRobot: Backdoor Attacks Against Robotic Manipulation in the Physical World", "paper_summary": "Robotic manipulation refers to the autonomous handling and interaction of\nrobots with objects using advanced techniques in robotics and artificial\nintelligence. The advent of powerful tools such as large language models (LLMs)\nand large vision-language models (LVLMs) has significantly enhanced the\ncapabilities of these robots in environmental perception and decision-making.\nHowever, the introduction of these intelligent agents has led to security\nthreats such as jailbreak attacks and adversarial attacks.\n  In this research, we take a further step by proposing a backdoor attack\nspecifically targeting robotic manipulation and, for the first time,\nimplementing backdoor attack in the physical world. By embedding a backdoor\nvisual language model into the visual perception module within the robotic\nsystem, we successfully mislead the robotic arm's operation in the physical\nworld, given the presence of common items as triggers. Experimental evaluations\nin the physical world demonstrate the effectiveness of the proposed backdoor\nattack.", "paper_summary_zh": "機器人操作是指機器人使用機器人和人工智慧的先進技術，自主處理和與物體互動。強大工具的出現，例如大型語言模型 (LLM) 和大型視覺語言模型 (LVLMs)，已顯著增強了這些機器人在環境感知和決策制定方面的能力。然而，這些智慧型代理的引入導致了安全威脅，例如越獄攻擊和對抗攻擊。在這個研究中，我們進一步提出了一種特別針對機器人操作的後門攻擊，並首次在物理世界中實施後門攻擊。透過將後門視覺語言模型嵌入機器人系統中的視覺感知模組，我們成功地誤導了機器人手臂在物理世界中的操作，因為存在著作為觸發器的常見物品。在物理世界中的實驗評估證明了所提出的後門攻擊的有效性。", "author": "Xianlong Wang et.al.", "authors": "Xianlong Wang, Hewen Pan, Hangtao Zhang, Minghui Li, Shengshan Hu, Ziqi Zhou, Lulu Xue, Peijin Guo, Yichen Wang, Wei Wan, Aishan Liu, Leo Yu Zhang", "id": "2411.11683v1", "paper_url": "http://arxiv.org/abs/2411.11683v1", "repo": "null"}}