{"2405.05803": {"publish_time": "2024-05-09", "title": "Boosting Multimodal Large Language Models with Visual Tokens Withdrawal for Rapid Inference", "paper_summary": "Multimodal large language models (MLLMs) demand considerable computations for\ninference due to the extensive parameters and the additional input tokens\nneeded for visual information representation. Herein, we introduce Visual\nTokens Withdrawal (VTW), a plug-and-play module to boost MLLMs for rapid\ninference. Our approach is inspired by two intriguing phenomena we have\nobserved: (1) the attention sink phenomenon that is prevalent in LLMs also\npersists in MLLMs, suggesting that initial tokens and nearest tokens receive\nthe majority of attention, while middle vision tokens garner minimal attention\nin deep layers; (2) the presence of information migration, which implies that\nvisual information is transferred to subsequent text tokens within the first\nfew layers of MLLMs. As per our findings, we conclude that vision tokens are\nnot necessary in the deep layers of MLLMs. Thus, we strategically withdraw them\nat a certain layer, enabling only text tokens to engage in subsequent layers.\nTo pinpoint the ideal layer for vision tokens withdrawal, we initially analyze\na limited set of tiny datasets and choose the first layer that meets the\nKullback-Leibler divergence criterion. Our VTW approach can cut computational\noverhead by over 40\\% across diverse multimodal tasks while maintaining\nperformance. Our code is released at https://github.com/lzhxmu/VTW.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 由于广泛的参数和视觉信息表示所需的附加输入标记，因此需要大量计算才能进行推理。在此，我们介绍视觉标记撤回 (VTW)，这是一个即插即用模块，用于提升 MLLM 以进行快速推理。我们的方法受到我们观察到的两个有趣的现象的启发：(1) 在 LLM 中普遍存在的注意力汇集现象也存在于 MLLM 中，表明初始标记和最近标记接收了大部分注意力，而中间视觉标记在深层中获得的注意力最少；(2) 信息迁移的存在，这意味着视觉信息在 MLLM 的前几层内被传输到后续文本标记。根据我们的发现，我们得出结论，视觉标记在 MLLM 的深层中是不必要的。因此，我们在某一层对其进行战略性撤回，仅允许文本标记参与后续层。为了精确定位视觉标记撤回的理想层，我们最初分析了一组有限的小型数据集，并选择了满足 Kullback-Leibler 散度准则的第一层。我们的 VTW 方法可以在保持性能的同时，在各种多模态任务中将计算开销减少 40% 以上。我们的代码已在 https://github.com/lzhxmu/VTW 中发布。", "author": "Zhihang Lin et.al.", "authors": "Zhihang Lin, Mingbao Lin, Luxi Lin, Rongrong Ji", "id": "2405.05803v1", "paper_url": "http://arxiv.org/abs/2405.05803v1", "repo": "https://github.com/lzhxmu/vtw"}}