{"2409.19990": {"publish_time": "2024-09-30", "title": "Predictive Speech Recognition and End-of-Utterance Detection Towards Spoken Dialog Systems", "paper_summary": "Effective spoken dialog systems should facilitate natural interactions with\nquick and rhythmic timing, mirroring human communication patterns. To reduce\nresponse times, previous efforts have focused on minimizing the latency in\nautomatic speech recognition (ASR) to optimize system efficiency. However, this\napproach requires waiting for ASR to complete processing until a speaker has\nfinished speaking, which limits the time available for natural language\nprocessing (NLP) to formulate accurate responses. As humans, we continuously\nanticipate and prepare responses even while the other party is still speaking.\nThis allows us to respond appropriately without missing the optimal time to\nspeak. In this work, as a pioneering study toward a conversational system that\nsimulates such human anticipatory behavior, we aim to realize a function that\ncan predict the forthcoming words and estimate the time remaining until the end\nof an utterance (EOU), using the middle portion of an utterance. To achieve\nthis, we propose a training strategy for an encoder-decoder-based ASR system,\nwhich involves masking future segments of an utterance and prompting the\ndecoder to predict the words in the masked audio. Additionally, we develop a\ncross-attention-based algorithm that incorporates both acoustic and linguistic\ninformation to accurately detect the EOU. The experimental results demonstrate\nthe proposed model's ability to predict upcoming words and estimate future EOU\nevents up to 300ms prior to the actual EOU. Moreover, the proposed training\nstrategy exhibits general improvements in ASR performance.", "paper_summary_zh": "有效的口語對話系統應促進自然互動，節奏明快，反映人類溝通模式。為了縮短回應時間，先前的努力集中在最小化自動語音辨識 (ASR) 中的延遲，以最佳化系統效率。然而，這種方法需要等到 ASR 完成處理，直到說話者說完話為止，這限制了自然語言處理 (NLP) 可用於制定準確回應的時間。作為人類，我們會持續預期和準備回應，即使對方仍在說話。這讓我們能夠在不錯過最適說話時間的情況下適當地回應。在這項工作中，作為模擬這種人類預期行為的對話系統的開創性研究，我們旨在實現一項功能，該功能可以使用一段話的中間部分來預測接下來的字詞，並估計到話語結束 (EOU) 所剩的時間。為達成此目的，我們提出編碼器解碼器式 ASR 系統的訓練策略，其中涉及遮蔽一段話的未來片段，並提示解碼器預測遮蔽音訊中的字詞。此外，我們開發了一種基於交叉注意力的演算法，該演算法結合了聲學和語言資訊，以準確偵測 EOU。實驗結果證明了所提出的模型預測後續字詞和估計未來 EOU 事件的能力，在實際 EOU 之前最多可達 300 毫秒。此外，所提出的訓練策略在 ASR 效能方面展現了一般性的改進。", "author": "Oswald Zink et.al.", "authors": "Oswald Zink, Yosuke Higuchi, Carlos Mullov, Alexander Waibel, Tetsunori Kobayashi", "id": "2409.19990v1", "paper_url": "http://arxiv.org/abs/2409.19990v1", "repo": "null"}}