{"2405.02512": {"publish_time": "2024-05-03", "title": "Spatio-Temporal SwinMAE: A Swin Transformer based Multiscale Representation Learner for Temporal Satellite Imagery", "paper_summary": "Currently, the foundation models represented by large language models have\nmade dramatic progress and are used in a very wide range of domains including\n2D and 3D vision. As one of the important application domains of foundation\nmodels, earth observation has attracted attention and various approaches have\nbeen developed. When considering earth observation as a single image capture,\nearth observation imagery can be processed as an image with three or more\nchannels, and when it comes with multiple image captures of different\ntimestamps at one location, the temporal observation can be considered as a set\nof continuous image resembling video frames or medical SCAN slices. This paper\npresents Spatio-Temporal SwinMAE (ST-SwinMAE), an architecture which\nparticularly focuses on representation learning for spatio-temporal image\nprocessing. Specifically, it uses a hierarchical Masked Auto-encoder (MAE) with\nVideo Swin Transformer blocks. With the architecture, we present a pretrained\nmodel named Degas 100M as a geospatial foundation model. Also, we propose an\napproach for transfer learning with Degas 100M, which both pretrained encoder\nand decoder of MAE are utilized with skip connections added between them to\nachieve multi-scale information communication, forms an architecture named\nSpatio-Temporal SwinUNet (ST-SwinUNet). Our approach shows significant\nimprovements of performance over existing state-of-the-art of foundation\nmodels. Specifically, for transfer learning of the land cover downstream task\non the PhilEO Bench dataset, it shows 10.4\\% higher accuracy compared with\nother geospatial foundation models on average.", "paper_summary_zh": "<paragraph>目前，以大型语言模型为代表的基础模型已经取得了长足的进步，并被广泛应用于包括 2D 和 3D 视觉在内的众多领域。作为基础模型的重要应用领域之一，地球观测引起了关注，并且已经开发出各种方法。当将地球观测视为单个图像捕捉时，可以将地球观测图像处理为具有三个或更多通道的图像，而当它带有不同时间戳的多个图像捕捉时，可以将时间观测视为一组连续的图像，类似于视频帧或医疗扫描切片。本文提出了时空 SwinMAE（ST-SwinMAE），这是一种特别关注时空图像处理的表示学习的架构。具体来说，它使用带有视频 Swin Transformer 块的分层掩码自动编码器 (MAE)。借助该架构，我们提出了一个名为 Degas 100M 的预训练模型作为地理空间基础模型。此外，我们提出了一种使用 Degas 100M 进行迁移学习的方法，该方法利用了 MAE 的预训练编码器和解码器，并在它们之间添加了跳跃连接以实现多尺度信息通信，形成了一种名为时空 SwinUNet（ST-SwinUNet）的架构。我们的方法显示出比现有基础模型的最新技术有显着的性能改进。具体来说，对于 PhilEO Bench 数据集上的土地覆盖下游任务的迁移学习，与其他地理空间基础模型相比，其平均准确率提高了 10.4%。</paragraph>", "author": "Yohei Nakayama et.al.", "authors": "Yohei Nakayama, Jiawei Su", "id": "2405.02512v1", "paper_url": "http://arxiv.org/abs/2405.02512v1", "repo": "null"}}