{"2411.07870": {"publish_time": "2024-11-12", "title": "Trustful LLMs: Customizing and Grounding Text Generation with Knowledge Bases and Dual Decoders", "paper_summary": "Although people are impressed by the content generation skills of large\nlanguage models, the use of LLMs, such as ChatGPT, is limited by the domain\ngrounding of the content. The correctness and groundedness of the generated\ncontent need to be based on a verified context, such as results from\nRetrieval-Augmented Generation (RAG). One important issue when adapting LLMs to\na customized domain is that the generated responses are often incomplete, or\nthe additions are not verified and may even be hallucinated. Prior studies on\nhallucination detection have focused on evaluation metrics, which are not\neasily adaptable to dynamic domains and can be vulnerable to attacks like\njail-breaking. In this work, we propose 1) a post-processing algorithm that\nleverages knowledge triplets in RAG context to correct hallucinations and 2) a\ndual-decoder model that fuses RAG context to guide the generation process.", "paper_summary_zh": "儘管人們對大型語言模型的內容生成技能印象深刻，但 ChatGPT 等 LLM 的使用受到內容的領域基礎的限制。生成的內容的正確性和基礎必須基於經過驗證的內容，例如檢索擴充生成 (RAG) 的結果。將 LLM 適應到自訂領域時的一個重要問題是，生成的回應通常不完整，或者新增內容未經驗證，甚至可能是幻覺。先前對幻覺偵測的研究集中在評估指標上，這些指標不易適應動態領域，且容易受到越獄等攻擊。在這項工作中，我們提出 1) 一種後處理演算法，利用 RAG 背景中的知識三元組來修正幻覺，以及 2) 一種雙解碼器模型，將 RAG 背景融合以引導生成過程。", "author": "Xiaofeng Zhu et.al.", "authors": "Xiaofeng Zhu, Jaya Krishna Mandivarapu", "id": "2411.07870v1", "paper_url": "http://arxiv.org/abs/2411.07870v1", "repo": "null"}}