{"2410.02605": {"publish_time": "2024-10-03", "title": "Beyond Expected Returns: A Policy Gradient Algorithm for Cumulative Prospect Theoretic Reinforcement Learning", "paper_summary": "The widely used expected utility theory has been shown to be empirically\ninconsistent with human preferences in the psychology and behavioral economy\nliteratures. Cumulative Prospect Theory (CPT) has been developed to fill in\nthis gap and provide a better model for human-based decision-making supported\nby empirical evidence. It allows to express a wide range of attitudes and\nperceptions towards risk, gains and losses. A few years ago, CPT has been\ncombined with Reinforcement Learning (RL) to formulate a CPT policy\noptimization problem where the goal of the agent is to search for a policy\ngenerating long-term returns which are aligned with their preferences. In this\nwork, we revisit this policy optimization problem and provide new insights on\noptimal policies and their nature depending on the utility function under\nconsideration. We further derive a novel policy gradient theorem for the CPT\npolicy optimization objective generalizing the seminal corresponding result in\nstandard RL. This result enables us to design a model-free policy gradient\nalgorithm to solve the CPT-RL problem. We illustrate the performance of our\nalgorithm in simple examples motivated by traffic control and electricity\nmanagement applications. We also demonstrate that our policy gradient algorithm\nscales better to larger state spaces compared to the existing zeroth order\nalgorithm for solving the same problem.", "paper_summary_zh": "廣泛使用的預期效用理論已被證實與心理學和行為經濟文獻中的人類偏好經驗不符。累積展望理論 (CPT) 已被發展出來以填補這個差距，並為基於人類的決策制定提供更好的模型，並得到經驗證據的支持。它允許表達對風險、收益和損失的廣泛態度和看法。幾年前，CPT 已與強化學習 (RL) 結合，以制定 CPT 政策優化問題，其中代理的目標是搜尋一個產生與其偏好一致的長期回報的政策。在這項工作中，我們重新審視這個政策優化問題，並提供關於最佳政策及其性質的新見解，具體取決於考慮中的效用函數。我們進一步為 CPT 政策優化目標導出一個新穎的政策梯度定理，概括了標準 RL 中開創性的對應結果。這個結果使我們能夠設計一個無模型政策梯度演算法來解決 CPT-RL 問題。我們在由交通控制和電力管理應用激勵的簡單範例中說明了我們演算法的效能。我們還證明，與用於解決相同問題的現有零階演算法相比，我們的政策梯度演算法可以更好地擴展到更大的狀態空間。", "author": "Olivier Lepel et.al.", "authors": "Olivier Lepel, Anas Barakat", "id": "2410.02605v1", "paper_url": "http://arxiv.org/abs/2410.02605v1", "repo": "null"}}