{"2502.14693": {"publish_time": "2025-02-20", "title": "I-MCTS: Enhancing Agentic AutoML via Introspective Monte Carlo Tree Search", "paper_summary": "Recent advancements in large language models (LLMs) have shown remarkable\npotential in automating machine learning tasks. However, existing LLM-based\nagents often struggle with low-diversity and suboptimal code generation. While\nrecent work has introduced Monte Carlo Tree Search (MCTS) to address these\nissues, limitations persist in the quality and diversity of thoughts generated,\nas well as in the scalar value feedback mechanisms used for node selection. In\nthis study, we introduce Introspective Monte Carlo Tree Search (I-MCTS), a\nnovel approach that iteratively expands tree nodes through an introspective\nprocess that meticulously analyzes solutions and results from parent and\nsibling nodes. This facilitates a continuous refinement of the node in the\nsearch tree, thereby enhancing the overall decision-making process.Furthermore,\nwe integrate a Large Language Model (LLM)-based value model to facilitate\ndirect evaluation of each node's solution prior to conducting comprehensive\ncomputational rollouts. A hybrid rewarding mechanism is implemented to\nseamlessly transition the Q-value from LLM-estimated scores to actual\nperformance scores. This allows higher-quality nodes to be traversed\nearlier.Applied to the various ML tasks, our approach demonstrates a6\\%\nabsolute improvement in performance compared to the strong open-source AutoML\nagents, showcasing its effectiveness in enhancing agentic AutoML systems.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展已展現出自動化機器學習任務的顯著潛力。然而，現有的基於 LLM 的代理通常會遇到低多樣性和次優代碼生成的問題。雖然最近的工作已引入蒙地卡羅樹搜尋 (MCTS) 來解決這些問題，但仍存在於所產生想法的品質和多樣性，以及用於節點選擇的標量值回饋機制中。在本研究中，我們介紹了內省蒙地卡羅樹搜尋 (I-MCTS)，這是一種透過內省過程反覆擴展樹節點的新方法，該過程會細緻地分析來自父節點和同層節點的解決方案和結果。這有助於持續改善搜尋樹中的節點，進而增強整體決策制定過程。此外，我們整合了一個基於大型語言模型 (LLM) 的值模型，以便在進行全面運算展開之前直接評估每個節點的解決方案。實作了一種混合獎勵機制，以無縫地將 Q 值從 LLM 估計分數轉換為實際效能分數。這允許較高品質的節點更早被遍歷。應用於各種 ML 任務，我們的做法展示出比強大的開源 AutoML 代理高出 6% 的絕對效能提升，證明了其在增強代理式 AutoML 系統方面的有效性。", "author": "Zujie Liang et.al.", "authors": "Zujie Liang, Feng Wei, Wujiang Xu, Lin Chen, Yuxi Qian, Xinhui Wu", "id": "2502.14693v1", "paper_url": "http://arxiv.org/abs/2502.14693v1", "repo": "null"}}