{"2502.02007": {"publish_time": "2025-02-04", "title": "Reasoning Bias of Next Token Prediction Training", "paper_summary": "Since the inception of Large Language Models (LLMs), the quest to efficiently\ntrain them for superior reasoning capabilities has been a pivotal challenge.\nThe dominant training paradigm for LLMs is based on next token prediction\n(NTP). Alternative methodologies, called Critical Token Prediction (CTP),\nfocused exclusively on specific critical tokens (such as the answer in Q\\&A\ndataset), aiming to reduce the overfitting of extraneous information and noise.\nContrary to initial assumptions, our research reveals that despite NTP's\nexposure to noise during training, it surpasses CTP in reasoning ability. We\nattribute this counterintuitive outcome to the regularizing influence of noise\non the training dynamics. Our empirical analysis shows that NTP-trained models\nexhibit enhanced generalization and robustness across various benchmark\nreasoning datasets, demonstrating greater resilience to perturbations and\nachieving flatter loss minima. These findings illuminate that NTP is\ninstrumental in fostering reasoning abilities during pretraining, whereas CTP\nis more effective for finetuning, thereby enriching our comprehension of\noptimal training strategies in LLM development.", "paper_summary_zh": "自大型語言模型 (LLM) 誕生以來，有效訓練它們以獲得卓越推理能力的追求一直是一項關鍵挑戰。\nLLM 的主要訓練範例基於下一個符號預測 (NTP)。稱為關鍵符號預測 (CTP) 的替代方法，專注於特定關鍵符號（例如問答資料集中的答案），旨在減少過度擬合額外的資訊和雜訊。\n與最初的假設相反，我們的研究表明，儘管 NTP 在訓練期間會接觸到雜訊，但它在推理能力上超越了 CTP。我們將這個反直覺的結果歸因於雜訊對訓練動態的規範化影響。我們的實證分析表明，NTP 訓練的模型在各種基準推理資料集上表現出增強的泛化性和穩健性，證明了對擾動的更強韌性，並實現了更平坦的損失最小值。這些發現表明，NTP 在預訓練期間培養推理能力至關重要，而 CTP 對微調更有效，從而豐富了我們對 LLM 開發中最佳訓練策略的理解。", "author": "Pengxiao Lin et.al.", "authors": "Pengxiao Lin, Zhongwang Zhang, Zhi-Qin John Xu", "id": "2502.02007v1", "paper_url": "http://arxiv.org/abs/2502.02007v1", "repo": "null"}}