{"2411.13239": {"publish_time": "2024-11-20", "title": "Transforming the Hybrid Cloud for Emerging AI Workloads", "paper_summary": "This white paper, developed through close collaboration between IBM Research\nand UIUC researchers within the IIDAI Institute, envisions transforming hybrid\ncloud systems to meet the growing complexity of AI workloads through\ninnovative, full-stack co-design approaches, emphasizing usability,\nmanageability, affordability, adaptability, efficiency, and scalability. By\nintegrating cutting-edge technologies such as generative and agentic AI,\ncross-layer automation and optimization, unified control plane, and composable\nand adaptive system architecture, the proposed framework addresses critical\nchallenges in energy efficiency, performance, and cost-effectiveness.\nIncorporating quantum computing as it matures will enable quantum-accelerated\nsimulations for materials science, climate modeling, and other high-impact\ndomains. Collaborative efforts between academia and industry are central to\nthis vision, driving advancements in foundation models for material design and\nclimate solutions, scalable multimodal data processing, and enhanced\nphysics-based AI emulators for applications like weather forecasting and carbon\nsequestration. Research priorities include advancing AI agentic systems, LLM as\nan Abstraction (LLMaaA), AI model optimization and unified abstractions across\nheterogeneous infrastructure, end-to-end edge-cloud transformation, efficient\nprogramming model, middleware and platform, secure infrastructure,\napplication-adaptive cloud systems, and new quantum-classical collaborative\nworkflows. These ideas and solutions encompass both theoretical and practical\nresearch questions, requiring coordinated input and support from the research\ncommunity. This joint initiative aims to establish hybrid clouds as secure,\nefficient, and sustainable platforms, fostering breakthroughs in AI-driven\napplications and scientific discovery across academia, industry, and society.", "paper_summary_zh": "這份白皮書由 IBM 研究中心與 IIDAI 研究所內的 UIUC 研究人員密切合作開發，預想透過創新的全端共同設計方法，轉換混合雲端系統，以滿足 AI 工作負載日益增長的複雜性，並強調可用性、可管理性、負擔能力、適應性、效率和可擴充性。透過整合生成式和代理式 AI、跨層自動化和最佳化、統一控制平面，以及可組成和自適應系統架構等尖端技術，所提出的架構解決了能源效率、效能和成本效益等重大挑戰。隨著量子運算技術日漸成熟，將能進行材料科學、氣候建模和其它高影響領域的量子加速模擬。產學合作對於此願景至關重要，推動材料設計和氣候解決方案、可擴充多模態資料處理，以及用於天氣預測和碳封存等應用程式的增強型物理基礎 AI 模擬器的進展。研究重點包括推進 AI 代理系統、LLM 作為抽象化 (LLMaaA)、異質基礎設施中的 AI 模型最佳化和統一抽象化、端到端邊緣雲端轉型、高效能程式設計模型、中介軟體和平台、安全基礎設施、應用程式自適應雲端系統，以及新的量子經典協作工作流程。這些想法和解決方案涵蓋了理論和實務研究問題，需要研究社群協調投入和支援。此聯合計畫旨在將混合雲端建立為安全、高效和永續的平台，促進學術界、產業和社會中 AI 驅動應用程式和科學發現的突破。", "author": "Deming Chen et.al.", "authors": "Deming Chen, Alaa Youssef, Ruchi Pendse, André Schleife, Bryan K. Clark, Hendrik Hamann, Jingrui He, Teodoro Laino, Lav Varshney, Yuxiong Wang, Avirup Sil, Reyhaneh Jabbarvand, Tianyin Xu, Volodymyr Kindratenko, Carlos Costa, Sarita Adve, Charith Mendis, Minjia Zhang, Santiago Núñez-Corrales, Raghu Ganti, Mudhakar Srivatsa, Nam Sung Kim, Josep Torrellas, Jian Huang, Seetharami Seelam, Klara Nahrstedt, Tarek Abdelzaher, Tamar Eilam, Huimin Zhao, Matteo Manica, Ravishankar Iyer, Martin Hirzel, Vikram Adve, Darko Marinov, Hubertus Franke, Hanghang Tong, Elizabeth Ainsworth, Han Zhao, Deepak Vasisht, Minh Do, Fabio Oliveira, Giovanni Pacifici, Ruchir Puri, Priya Nagpurkar", "id": "2411.13239v1", "paper_url": "http://arxiv.org/abs/2411.13239v1", "repo": "null"}}