{"2406.12036": {"publish_time": "2024-06-17", "title": "MedCalc-Bench: Evaluating Large Language Models for Medical Calculations", "paper_summary": "As opposed to evaluating computation and logic-based reasoning, current\nbench2 marks for evaluating large language models (LLMs) in medicine are\nprimarily focused on question-answering involving domain knowledge and\ndescriptive rea4 soning. While such qualitative capabilities are vital to\nmedical diagnosis, in real5 world scenarios, doctors frequently use clinical\ncalculators that follow quantitative equations and rule-based reasoning\nparadigms for evidence-based decision support. To this end, we propose\nMedCalc-Bench, a first-of-its-kind dataset focused on evaluating the medical\ncalculation capability of LLMs. MedCalc-Bench contains an evaluation set of\nover 1000 manually reviewed instances from 55 different medical calculation\ntasks. Each instance in MedCalc-Bench consists of a patient note, a question\nrequesting to compute a specific medical value, a ground truth answer, and a\nstep-by-step explanation showing how the answer is obtained. While our\nevaluation results show the potential of LLMs in this area, none of them are\neffective enough for clinical settings. Common issues include extracting the\nincorrect entities, not using the correct equation or rules for a calculation\ntask, or incorrectly performing the arithmetic for the computation. We hope our\nstudy highlights the quantitative knowledge and reasoning gaps in LLMs within\nmedical settings, encouraging future improvements of LLMs for various clinical\ncalculation tasks.", "paper_summary_zh": "與評估運算和基於邏輯的推理相反，目前用於評估大型語言模型 (LLM) 在醫學中的基準，主要集中在涉及領域知識和描述性推理的問答上。雖然這些定性能力對醫療診斷至關重要，但在實際情況中，醫生經常使用遵循定量方程式和基於規則的推理範式的臨床計算器，以進行循證決策支援。為此，我們提出了 MedCalc-Bench，這是一個首創的資料集，專注於評估 LLM 的醫療計算能力。MedCalc-Bench 包含一個評估集，其中包含來自 55 種不同醫療計算任務的 1000 多個人工審查實例。MedCalc-Bench 中的每個實例都包含一個患者備註、一個計算特定醫療數值的請求問題、一個基本事實答案，以及一個分步說明，說明如何獲得答案。雖然我們的評估結果顯示了 LLM 在這方面的潛力，但它們都不足以用於臨床環境。常見問題包括提取不正確的實體、未針對計算任務使用正確的方程式或規則，或計算算術時執行不正確。我們希望我們的研究能強調 LLM 在醫療環境中的量化知識和推理差距，並鼓勵未來改進 LLM，以應付各種臨床計算任務。", "author": "Nikhil Khandekar et.al.", "authors": "Nikhil Khandekar, Qiao Jin, Guangzhi Xiong, Soren Dunn, Serina S Applebaum, Zain Anwar, Maame Sarfo-Gyamfi, Conrad W Safranek, Abid A Anwar, Andrew Zhang, Aidan Gilson, Maxwell B Singer, Amisha Dave, Andrew Taylor, Aidong Zhang, Qingyu Chen, Zhiyong Lu", "id": "2406.12036v1", "paper_url": "http://arxiv.org/abs/2406.12036v1", "repo": "https://github.com/ncbi-nlp/medcalc-bench"}}