{"2406.12036": {"publish_time": "2024-06-17", "title": "MedCalc-Bench: Evaluating Large Language Models for Medical Calculations", "paper_summary": "As opposed to evaluating computation and logic-based reasoning, current\nbenchmarks for evaluating large language models (LLMs) in medicine are\nprimarily focused on question-answering involving domain knowledge and\ndescriptive reasoning. While such qualitative capabilities are vital to medical\ndiagnosis, in real-world scenarios, doctors frequently use clinical calculators\nthat follow quantitative equations and rule-based reasoning paradigms for\nevidence-based decision support. To this end, we propose MedCalc-Bench, a\nfirst-of-its-kind dataset focused on evaluating the medical calculation\ncapability of LLMs. MedCalc-Bench contains an evaluation set of over 1000\nmanually reviewed instances from 55 different medical calculation tasks. Each\ninstance in MedCalc-Bench consists of a patient note, a question requesting to\ncompute a specific medical value, a ground truth answer, and a step-by-step\nexplanation showing how the answer is obtained. While our evaluation results\nshow the potential of LLMs in this area, none of them are effective enough for\nclinical settings. Common issues include extracting the incorrect entities, not\nusing the correct equation or rules for a calculation task, or incorrectly\nperforming the arithmetic for the computation. We hope our study highlights the\nquantitative knowledge and reasoning gaps in LLMs within medical settings,\nencouraging future improvements of LLMs for various clinical calculation tasks.", "paper_summary_zh": "與評估計算和基於邏輯的推理不同，目前用於評估醫學中大型語言模型 (LLM) 的基準主要集中在涉及領域知識和描述性推理的問答上。雖然此類定性能力對於醫療診斷至關重要，但在實際情況中，醫生經常使用遵循定量方程式和基於規則的推理範例的臨床計算器來進行基於證據的決策支持。為此，我們提出了 MedCalc-Bench，這是第一個專注於評估 LLM 醫學計算能力的同類數據集。MedCalc-Bench 包含一個評估集，其中包含來自 55 個不同醫學計算任務的 1000 多個手動審查的實例。MedCalc-Bench 中的每個實例都包含一個患者備註、一個請求計算特定醫學值的提問、一個基本事實答案以及一個逐步說明如何獲得答案的說明。雖然我們的評估結果顯示了 LLM 在此領域的潛力，但沒有任何一個 LLM 足夠有效地用於臨床環境。常見問題包括提取不正確的實體、未針對計算任務使用正確的方程式或規則，或錯誤地執行計算的算術運算。我們希望我們的研究能突顯 LLM 在醫療環境中的定量知識和推理差距，並鼓勵未來改進 LLM 以應付各種臨床計算任務。", "author": "Nikhil Khandekar et.al.", "authors": "Nikhil Khandekar, Qiao Jin, Guangzhi Xiong, Soren Dunn, Serina S Applebaum, Zain Anwar, Maame Sarfo-Gyamfi, Conrad W Safranek, Abid A Anwar, Andrew Zhang, Aidan Gilson, Maxwell B Singer, Amisha Dave, Andrew Taylor, Aidong Zhang, Qingyu Chen, Zhiyong Lu", "id": "2406.12036v3", "paper_url": "http://arxiv.org/abs/2406.12036v3", "repo": "https://github.com/ncbi-nlp/medcalc-bench"}}