{"2405.08247": {"publish_time": "2024-05-14", "title": "Automated classification of multi-parametric body MRI series", "paper_summary": "Multi-parametric MRI (mpMRI) studies are widely available in clinical\npractice for the diagnosis of various diseases. As the volume of mpMRI exams\nincreases yearly, there are concomitant inaccuracies that exist within the\nDICOM header fields of these exams. This precludes the use of the header\ninformation for the arrangement of the different series as part of the\nradiologist's hanging protocol, and clinician oversight is needed for\ncorrection. In this pilot work, we propose an automated framework to classify\nthe type of 8 different series in mpMRI studies. We used 1,363 studies acquired\nby three Siemens scanners to train a DenseNet-121 model with 5-fold\ncross-validation. Then, we evaluated the performance of the DenseNet-121\nensemble on a held-out test set of 313 mpMRI studies. Our method achieved an\naverage precision of 96.6%, sensitivity of 96.6%, specificity of 99.6%, and F1\nscore of 96.6% for the MRI series classification task. To the best of our\nknowledge, we are the first to develop a method to classify the series type in\nmpMRI studies acquired at the level of the chest, abdomen, and pelvis. Our\nmethod has the capability for robust automation of hanging protocols in modern\nradiology practice.", "paper_summary_zh": "多參數 MRI (mpMRI) 研究廣泛應用於臨床實務中，用於診斷各種疾病。由於 mpMRI 檢查量每年都在增加，這些檢查的 DICOM 標頭欄位中存在著伴隨的不準確性。這會妨礙將標頭資訊用於放射科醫師懸掛協定的不同系列的排列，並且需要臨床醫師監督才能進行校正。在這項試驗工作中，我們提出了一個自動化架構，用於對 mpMRI 研究中的 8 個不同系列類型進行分類。我們使用了由三個 Siemens 掃描器取得的 1,363 項研究，以訓練一個具有 5 倍交叉驗證的 DenseNet-121 模型。然後，我們在一個由 313 項 mpMRI 研究組成的留出測試集上評估了 DenseNet-121 混合模型的效能。我們的模型在 MRI 系列分類任務中達到了平均準確度 96.6%、敏感度 96.6%、特異度 99.6% 和 F1 分數 96.6%。據我們所知，我們是第一個開發出一個方法來對在胸部、腹部和骨盆層級取得的 mpMRI 研究中的系列類型進行分類。我們的模型有能力在現代放射科實務中對懸掛協定進行強健的自動化。", "author": "Boah Kim et.al.", "authors": "Boah Kim, Tejas Sudharshan Mathai, Kimberly Helm, Ronald M. Summers", "id": "2405.08247v1", "paper_url": "http://arxiv.org/abs/2405.08247v1", "repo": "null"}}