{"2410.21159": {"publish_time": "2024-10-28", "title": "CURATe: Benchmarking Personalised Alignment of Conversational AI Assistants", "paper_summary": "We introduce a multi-turn benchmark for evaluating personalised alignment in\nLLM-based AI assistants, focusing on their ability to handle user-provided\nsafety-critical contexts. Our assessment of ten leading models across five\nscenarios (each with 337 use cases) reveals systematic inconsistencies in\nmaintaining user-specific consideration, with even top-rated \"harmless\" models\nmaking recommendations that should be recognised as obviously harmful to the\nuser given the context provided. Key failure modes include inappropriate\nweighing of conflicting preferences, sycophancy (prioritising user preferences\nabove safety), a lack of attentiveness to critical user information within the\ncontext window, and inconsistent application of user-specific knowledge. The\nsame systematic biases were observed in OpenAI's o1, suggesting that strong\nreasoning capacities do not necessarily transfer to this kind of personalised\nthinking. We find that prompting LLMs to consider safety-critical context\nsignificantly improves performance, unlike a generic 'harmless and helpful'\ninstruction. Based on these findings, we propose research directions for\nembedding self-reflection capabilities, online user modelling, and dynamic risk\nassessment in AI assistants. Our work emphasises the need for nuanced,\ncontext-aware approaches to alignment in systems designed for persistent human\ninteraction, aiding the development of safe and considerate AI assistants.", "paper_summary_zh": "<paragraph>我們引進一個多回合基準，用於評估基於 LLM 的 AI 助理中的個人化對齊，重點在於它們處理使用者提供的安全關鍵脈絡的能力。我們對五個情境中的十個領先模型的評估（每個情境有 337 個使用案例）揭示了在維持使用者特定考量方面的系統性不一致，即使是評分最高的「無害」模型也會提出建議，而這些建議應被視為明顯對使用者有害，具體取決於提供的脈絡。主要的失敗模式包括對相互衝突的偏好進行不適當的權衡、阿諛奉承（優先考慮使用者偏好而非安全性）、在脈絡視窗內缺乏對關鍵使用者資訊的關注，以及使用者特定知識的不一致應用。在 OpenAI 的 o1 中觀察到相同的系統性偏差，這表明強大的推理能力不一定會轉移到這種個性化思考中。我們發現，提示 LLM 考慮安全關鍵脈絡會顯著改善效能，這不同於一般的「無害且有幫助」的指示。根據這些發現，我們提出了研究方向，以將自我反省能力、線上使用者建模和動態風險評估嵌入到 AI 助理中。我們的研究強調了在為持續的人類互動設計的系統中，對齊需要細緻入微、具脈絡感知力的方法，有助於開發安全且體貼的 AI 助理。</paragraph>", "author": "Lize Alberts et.al.", "authors": "Lize Alberts, Benjamin Ellis, Andrei Lupu, Jakob Foerster", "id": "2410.21159v1", "paper_url": "http://arxiv.org/abs/2410.21159v1", "repo": "null"}}