{"2410.23079": {"publish_time": "2024-10-30", "title": "BUZZ: Beehive-structured Sparse KV Cache with Segmented Heavy Hitters for Efficient LLM Inference", "paper_summary": "Large language models (LLMs) are essential in natural language processing but\noften struggle with inference speed and computational efficiency, limiting\nreal-time deployment. The key-value (KV) cache mechanism reduces computational\noverhead in transformer models, but challenges in maintaining contextual\nunderstanding remain. In this paper, we propose BUZZ, a novel KV caching\nalgorithm that leverages structured contextual information to minimize cache\nmemory usage while enhancing inference speed. BUZZ employs a beehive-structured\nsparse cache, incorporating a sliding window to capture recent information and\ndynamically segmenting historical tokens into chunks to prioritize important\ntokens in local neighborhoods. We evaluate BUZZ on four real-world datasets:\nCNN/Daily Mail, XSUM, Wikitext, and 10-QA. Our results demonstrate that BUZZ\n(1) reduces cache memory usage by $\\textbf{2.5}\\times$ in LLM inference while\nmaintaining over 99% accuracy in long-text summarization, and (2) surpasses\nstate-of-the-art performance in multi-document question answering by\n$\\textbf{7.69%}$ under the same memory limit, where full cache methods\nencounter out-of-memory issues. Additionally, BUZZ achieves significant\ninference speedup with a $\\log{n}$ time complexity. The code is available at\nhttps://github.com/JunqiZhao888/buzz-llm.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言處理中至關重要，但\n通常難以兼顧推論速度和運算效率，限制了\n即時部署。快取機制中的鍵值 (KV) 減少了轉換器模型中的運算\n開銷，但在維護上下文理解方面仍然存在挑戰。在本文中，我們提出\nBUZZ，這是一種新穎的 KV 快取演算法，利用結構化上下文資訊來\n最小化快取記憶體使用量，同時提高推論速度。BUZZ 採用蜂巢結構\n稀疏快取，結合滑動視窗來擷取最新資訊，並動態將歷史代幣分段成\n塊，以優先處理鄰近區域中的重要代幣。我們在四個真實世界資料集上\n評估 BUZZ：CNN/Daily Mail、XSUM、Wikitext 和 10-QA。我們的結果證明\nBUZZ (1) 在 LLM 推論中將快取記憶體使用量減少了 $\\textbf{2.5}\\times$，同時\n在長文本摘要中維持超過 99% 的準確度，以及 (2) 在相同的記憶體限制下，\n超越了多文件問答的最新技術，提升了 $\\textbf{7.69%}$，而完整快取方法\n則會遇到記憶體不足的問題。此外，BUZZ 以 $\\log{n}$ 時間複雜度實現了\n顯著的推論速度提升。程式碼可在 https://github.com/JunqiZhao888/buzz-llm 取得。", "author": "Junqi Zhao et.al.", "authors": "Junqi Zhao, Zhijin Fang, Shu Li, Shaohui Yang, Shichao He", "id": "2410.23079v1", "paper_url": "http://arxiv.org/abs/2410.23079v1", "repo": "https://github.com/junqizhao888/buzz-llm"}}