{"2405.09335": {"publish_time": "2024-05-15", "title": "Prompting-based Synthetic Data Generation for Few-Shot Question Answering", "paper_summary": "Although language models (LMs) have boosted the performance of Question\nAnswering, they still need plenty of data. Data annotation, in contrast, is a\ntime-consuming process. This especially applies to Question Answering, where\npossibly large documents have to be parsed and annotated with questions and\ntheir corresponding answers. Furthermore, Question Answering models often only\nwork well for the domain they were trained on. Since annotation is costly, we\nargue that domain-agnostic knowledge from LMs, such as linguistic\nunderstanding, is sufficient to create a well-curated dataset. With this\nmotivation, we show that using large language models can improve Question\nAnswering performance on various datasets in the few-shot setting compared to\nstate-of-the-art approaches. For this, we perform data generation leveraging\nthe Prompting framework, suggesting that language models contain valuable\ntask-agnostic knowledge that can be used beyond the common\npre-training/fine-tuning scheme. As a result, we consistently outperform\nprevious approaches on few-shot Question Answering.", "paper_summary_zh": "儘管語言模型 (LM) 提升了問答的效能，但它們仍需要大量的資料。相較之下，資料標註是一個耗時的程序。這特別適用於問答，其中可能必須解析大型文件，並使用問題及其對應答案進行標註。此外，問答模型通常只適用於它們受訓的領域。由於標註的成本很高，我們主張來自 LM 的與領域無關的知識，例如語言理解，就足以建立一個經過精心策劃的資料集。基於這個動機，我們展示了在小樣本設定中，與最先進的方法相比，使用大型語言模型可以提升各種資料集上的問答效能。為此，我們執行資料產生，利用提示架構，這表示語言模型包含有價值的與任務無關的知識，可以用於常見的預訓練/微調架構之外。因此，我們在小樣本問答中始終優於先前的做法。", "author": "Maximilian Schmidt et.al.", "authors": "Maximilian Schmidt, Andrea Bartezzaghi, Ngoc Thang Vu", "id": "2405.09335v1", "paper_url": "http://arxiv.org/abs/2405.09335v1", "repo": "null"}}