{"2407.21687": {"publish_time": "2024-07-31", "title": "Dynamic Object Queries for Transformer-based Incremental Object Detection", "paper_summary": "Incremental object detection (IOD) aims to sequentially learn new classes,\nwhile maintaining the capability to locate and identify old ones. As the\ntraining data arrives with annotations only with new classes, IOD suffers from\ncatastrophic forgetting. Prior methodologies mainly tackle the forgetting issue\nthrough knowledge distillation and exemplar replay, ignoring the conflict\nbetween limited model capacity and increasing knowledge. In this paper, we\nexplore \\textit{dynamic object queries} for incremental object detection built\non Transformer architecture. We propose the \\textbf{Dy}namic object\n\\textbf{Q}uery-based \\textbf{DE}tection \\textbf{TR}ansformer (DyQ-DETR), which\nincrementally expands the model representation ability to achieve\nstability-plasticity tradeoff. First, a new set of learnable object queries are\nfed into the decoder to represent new classes. These new object queries are\naggregated with those from previous phases to adapt both old and new knowledge\nwell. Second, we propose the isolated bipartite matching for object queries in\ndifferent phases, based on disentangled self-attention. The interaction among\nthe object queries at different phases is eliminated to reduce inter-class\nconfusion. Thanks to the separate supervision and computation over object\nqueries, we further present the risk-balanced partial calibration for effective\nexemplar replay. Extensive experiments demonstrate that DyQ-DETR significantly\nsurpasses the state-of-the-art methods, with limited parameter overhead. Code\nwill be made publicly available.", "paper_summary_zh": "增量式物件偵測 (IOD) 旨在循序漸進地學習新類別，同時維持定位和辨識舊類別的能力。由於訓練資料僅附有新類別的註解，IOD 會發生災難性遺忘。先前的研究方法主要透過知識萃取和範例重播來解決遺忘問題，卻忽略了模型容量有限和知識增加之間的衝突。在本文中，我們探索建立在 Transformer 架構上的增量式物件偵測的「動態物件查詢」。我們提出以動態物件查詢為基礎的偵測變形金剛 (DyQ-DETR)，它會逐步擴展模型表示能力，以達成穩定性和可塑性的折衷。首先，將一組新的可學習物件查詢輸入解碼器，以表示新類別。這些新的物件查詢會與前一階段的查詢合併，以適當地調整舊有和新的知識。其次，我們提出基於解開自我注意力的、用於不同階段物件查詢的孤立二部匹配。消除不同階段物件查詢之間的互動，以減少類別間的混淆。由於物件查詢有獨立的監督和運算，我們進一步提出風險平衡的部分校正，以有效地重播範例。大量的實驗證明，DyQ-DETR 大幅超越最先進的方法，且參數開銷有限。程式碼將公開提供。", "author": "Jichuan Zhang et.al.", "authors": "Jichuan Zhang, Wei Li, Shuang Cheng, Ya-Li Li, Shengjin Wang", "id": "2407.21687v1", "paper_url": "http://arxiv.org/abs/2407.21687v1", "repo": "null"}}