{"2408.04965": {"publish_time": "2024-08-09", "title": "Generalisation First, Memorisation Second? Memorisation Localisation for Natural Language Classification Tasks", "paper_summary": "Memorisation is a natural part of learning from real-world data: neural\nmodels pick up on atypical input-output combinations and store those training\nexamples in their parameter space. That this happens is well-known, but how and\nwhere are questions that remain largely unanswered. Given a multi-layered\nneural model, where does memorisation occur in the millions of parameters?\nRelated work reports conflicting findings: a dominant hypothesis based on image\nclassification is that lower layers learn generalisable features and that\ndeeper layers specialise and memorise. Work from NLP suggests this does not\napply to language models, but has been mainly focused on memorisation of facts.\nWe expand the scope of the localisation question to 12 natural language\nclassification tasks and apply 4 memorisation localisation techniques. Our\nresults indicate that memorisation is a gradual process rather than a localised\none, establish that memorisation is task-dependent, and give nuance to the\ngeneralisation first, memorisation second hypothesis.", "paper_summary_zh": "記憶是從真實世界資料中學習的自然部分：神經模型會接收非典型的輸入輸出組合，並將那些訓練範例儲存在它們的參數空間中。這件事的發生是眾所周知，但如何以及在哪裡仍然是很大程度未解答的問題。給定一個多層神經模型，記憶發生在數百萬個參數中的哪裡？相關工作報告有相互矛盾的發現：一個基於影像分類的主導假設是較低層學習可概括的特徵，而較深層則專門化並記憶。自然語言處理的工作表明這不適用於語言模型，但主要集中於事實的記憶。我們將定位問題的範圍擴展到 12 項自然語言分類任務，並應用 4 種記憶定位技術。我們的結果表明，記憶是一個漸進的過程，而不是一個局部化的過程，確定記憶取決於任務，並對概括優先，記憶其次的假設提供細微差別。", "author": "Verna Dankers et.al.", "authors": "Verna Dankers, Ivan Titov", "id": "2408.04965v1", "paper_url": "http://arxiv.org/abs/2408.04965v1", "repo": "null"}}