{"2410.23074": {"publish_time": "2024-10-30", "title": "Multi-Programming Language Sandbox for LLMs", "paper_summary": "We introduce MPLSandbox, an out-of-the-box multi-programming language sandbox\ndesigned to provide unified and comprehensive feedback from compiler and\nanalysis tools for Large Language Models (LLMs). It can automatically identify\nthe programming language of the code, compiling and executing it within an\nisolated sub-sandbox to ensure safety and stability. In addition, MPLSandbox\nalso integrates both traditional and LLM-based code analysis tools, providing a\ncomprehensive analysis of generated code. MPLSandbox can be effortlessly\nintegrated into the training and deployment of LLMs to improve the quality and\ncorrectness of their generated code. It also helps researchers streamline their\nworkflows for various LLM-based code-related tasks, reducing the development\ncost. To validate the effectiveness of MPLSandbox, we integrate it into\ntraining and deployment approaches, and also employ it to optimize workflows\nfor a wide range of real-world code-related tasks. Our goal is to enhance\nresearcher productivity on LLM-based code-related tasks by simplifying and\nautomating workflows through delegation to MPLSandbox.", "paper_summary_zh": "<paragraph>我們推出 MPLSandbox，一個開箱即用的多程式語言沙盒，旨在提供來自編譯器和分析工具的統一且全面的回饋，以供大型語言模型 (LLM) 使用。它可以自動識別程式碼的程式語言，在一個隔離的子沙盒中編譯和執行它，以確保安全性和穩定性。此外，MPLSandbox 還整合了傳統和基於 LLM 的程式碼分析工具，提供對生成程式碼的全面分析。MPLSandbox 可以輕鬆整合到 LLM 的訓練和部署中，以提高其生成程式碼的品質和正確性。它還可以幫助研究人員簡化其各種基於 LLM 的程式碼相關任務的工作流程，從而降低開發成本。為了驗證 MPLSandbox 的有效性，我們將其整合到訓練和部署方法中，並使用它來最佳化各種實際程式碼相關任務的工作流程。我們的目標是透過委派給 MPLSandbox 來簡化和自動化工作流程，進而提升研究人員在基於 LLM 的程式碼相關任務上的生產力。</paragraph>", "author": "Shihan Dou et.al.", "authors": "Shihan Dou, Jiazheng Zhang, Jianxiang Zang, Yunbo Tao, Haoxiang Jia, Shichun Liu, Yuming Yang, Shenxi Wu, Shaoqing Zhang, Muling Wu, Changze Lv, Limao Xiong, Wenyu Zhan, Lin Zhang, Rongxiang Weng, Jingang Wang, Xunliang Cai, Yueming Wu, Ming Wen, Rui Zheng, Tao Ji, Yixin Cao, Tao Gui, Xipeng Qiu, Qi Zhang, Xuanjing Huang", "id": "2410.23074v1", "paper_url": "http://arxiv.org/abs/2410.23074v1", "repo": "null"}}