{"2408.08566": {"publish_time": "2024-08-16", "title": "Overview of the BioLaySumm 2024 Shared Task on the Lay Summarization of Biomedical Research Articles", "paper_summary": "This paper presents the setup and results of the second edition of the\nBioLaySumm shared task on the Lay Summarisation of Biomedical Research\nArticles, hosted at the BioNLP Workshop at ACL 2024. In this task edition, we\naim to build on the first edition's success by further increasing research\ninterest in this important task and encouraging participants to explore novel\napproaches that will help advance the state-of-the-art. Encouragingly, we found\nresearch interest in the task to be high, with this edition of the task\nattracting a total of 53 participating teams, a significant increase in\nengagement from the previous edition. Overall, our results show that a broad\nrange of innovative approaches were adopted by task participants, with a\npredictable shift towards the use of Large Language Models (LLMs).", "paper_summary_zh": "本篇論文介紹了 ACL 2024 的 BioNLP 工作坊中舉辦的第二屆 BioLaySumm 共享任務中生物醫學研究文章的通俗總結的設定和結果。在這個任務版本中，我們旨在建立在第一屆的成功上，進一步提升對這個重要任務的研究興趣，並鼓勵參與者探索有助於推動現有技術進步的新穎方法。令人鼓舞的是，我們發現對該任務的研究興趣很高，本屆任務共吸引了 53 個參與團隊，參與度較上一屆顯著提升。總體而言，我們的結果表明，任務參與者採用了廣泛的創新方法，並可預測地轉向使用大型語言模型 (LLM)。", "author": "Tomas Goldsack et.al.", "authors": "Tomas Goldsack, Carolina Scarton, Matthew Shardlow, Chenghua Lin", "id": "2408.08566v1", "paper_url": "http://arxiv.org/abs/2408.08566v1", "repo": "null"}}