{"2501.04765": {"publish_time": "2025-01-08", "title": "TREAD: Token Routing for Efficient Architecture-agnostic Diffusion Training", "paper_summary": "Diffusion models have emerged as the mainstream approach for visual\ngeneration. However, these models usually suffer from sample inefficiency and\nhigh training costs. This issue is particularly pronounced in the standard\ndiffusion transformer architecture due to its quadratic complexity relative to\ninput length. Recent works have addressed this by reducing the number of tokens\nprocessed in the model, often through masking. In contrast, this work aims to\nimprove the training efficiency of the diffusion backbone by using predefined\nroutes that store this information until it is reintroduced to deeper layers of\nthe model, rather than discarding these tokens entirely. Further, we combine\nmultiple routes and introduce an adapted auxiliary loss that accounts for all\napplied routes. Our method is not limited to the common transformer-based model\n- it can also be applied to state-space models. Unlike most current approaches,\nTREAD achieves this without architectural modifications. Finally, we show that\nour method reduces the computational cost and simultaneously boosts model\nperformance on the standard benchmark ImageNet-1K 256 x 256 in\nclass-conditional synthesis. Both of these benefits multiply to a convergence\nspeedup of 9.55x at 400K training iterations compared to DiT and 25.39x\ncompared to the best benchmark performance of DiT at 7M training iterations.", "paper_summary_zh": "擴散模型已成為視覺生成的主流方法。然而，這些模型通常會出現樣本效率低和訓練成本高的問題。這個問題在標準擴散Transformer架構中特別明顯，因為它的二次複雜度與輸入長度有關。最近的研究透過減少模型中處理的符號數量來解決這個問題，通常是透過遮罩。相比之下，這項工作旨在透過使用預定義路徑來改善擴散主幹的訓練效率，這些路徑會儲存這些資訊，直到將其重新引入到模型的更深層，而不是完全捨棄這些符號。此外，我們結合多條路徑並引入一個適應輔助損失，該損失會考量所有已套用的路徑。我們的模型不僅限於常見的基於Transformer的模型，它也可以應用於狀態空間模型。與大多數目前的方法不同，TREAD 在沒有架構修改的情況下實現了這一點。最後，我們證明了我們的模型減少了運算成本，同時在標準基準 ImageNet-1K 256 x 256 中提升了模型在類條件合成上的效能。與 DiT 相比，這兩個優點在 400K 訓練反覆運算中乘以 9.55 倍的收斂速度，與 DiT 在 7M 訓練反覆運算中的最佳基準效能相比，乘以 25.39 倍。", "author": "Felix Krause et.al.", "authors": "Felix Krause, Timy Phan, Vincent Tao Hu, Björn Ommer", "id": "2501.04765v1", "paper_url": "http://arxiv.org/abs/2501.04765v1", "repo": "null"}}