{"2501.00999": {"publish_time": "2025-01-02", "title": "Exploring Information Processing in Large Language Models: Insights from Information Bottleneck Theory", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable performance across\na wide range of tasks by understanding input information and predicting\ncorresponding outputs. However, the internal mechanisms by which LLMs\ncomprehend input and make effective predictions remain poorly understood. In\nthis paper, we explore the working mechanism of LLMs in information processing\nfrom the perspective of Information Bottleneck Theory. We propose a\nnon-training construction strategy to define a task space and identify the\nfollowing key findings: (1) LLMs compress input information into specific task\nspaces (e.g., sentiment space, topic space) to facilitate task understanding;\n(2) they then extract and utilize relevant information from the task space at\ncritical moments to generate accurate predictions. Based on these insights, we\nintroduce two novel approaches: an Information Compression-based Context\nLearning (IC-ICL) and a Task-Space-guided Fine-Tuning (TS-FT). IC-ICL enhances\nreasoning performance and inference efficiency by compressing retrieved example\ninformation into the task space. TS-FT employs a space-guided loss to fine-tune\nLLMs, encouraging the learning of more effective compression and selection\nmechanisms. Experiments across multiple datasets validate the effectiveness of\ntask space construction. Additionally, IC-ICL not only improves performance but\nalso accelerates inference speed by over 40\\%, while TS-FT achieves superior\nresults with a minimal strategy adjustment.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種任務中展現出卓越的效能，透過了解輸入資訊和預測對應的輸出。然而，LLM 理解輸入和做出有效預測的內部機制仍未被充分理解。在本文中，我們從資訊瓶頸理論的角度探討 LLM 在資訊處理中的工作機制。我們提出一個非訓練建構策略來定義任務空間並找出以下關鍵發現：(1) LLM 將輸入資訊壓縮到特定的任務空間（例如，情緒空間、主題空間）以促進任務理解；(2) 它們接著在關鍵時刻從任務空間中萃取和利用相關資訊，以產生準確的預測。根據這些見解，我們介紹兩種新穎的方法：基於資訊壓縮的脈絡學習 (IC-ICL) 和任務空間引導的微調 (TS-FT)。IC-ICL 透過將擷取的範例資訊壓縮到任務空間中，增強推理效能和推論效率。TS-FT 使用空間引導損失對 LLM 進行微調，鼓勵學習更有效的壓縮和選擇機制。跨多個資料集的實驗驗證了任務空間建構的有效性。此外，IC-ICL 不僅提升效能，還將推論速度提升超過 40%，而 TS-FT 則透過最小的策略調整獲得卓越的結果。", "author": "Zhou Yang et.al.", "authors": "Zhou Yang, Zhengyu Qi, Zhaochun Ren, Zhikai Jia, Haizhou Sun, Xiaofei Zhu, Xiangwen Liao", "id": "2501.00999v1", "paper_url": "http://arxiv.org/abs/2501.00999v1", "repo": "null"}}