{"2408.04284": {"publish_time": "2024-08-08", "title": "LLM-DetectAIve: a Tool for Fine-Grained Machine-Generated Text Detection", "paper_summary": "The widespread accessibility of large language models (LLMs) to the general\npublic has significantly amplified the dissemination of machine-generated texts\n(MGTs). Advancements in prompt manipulation have exacerbated the difficulty in\ndiscerning the origin of a text (human-authored vs machinegenerated). This\nraises concerns regarding the potential misuse of MGTs, particularly within\neducational and academic domains. In this paper, we present\n$\\textbf{LLM-DetectAIve}$ -- a system designed for fine-grained MGT detection.\nIt is able to classify texts into four categories: human-written,\nmachine-generated, machine-written machine-humanized, and human-written\nmachine-polished. Contrary to previous MGT detectors that perform binary\nclassification, introducing two additional categories in LLM-DetectiAIve offers\ninsights into the varying degrees of LLM intervention during the text creation.\nThis might be useful in some domains like education, where any LLM intervention\nis usually prohibited. Experiments show that LLM-DetectAIve can effectively\nidentify the authorship of textual content, proving its usefulness in enhancing\nintegrity in education, academia, and other domains. LLM-DetectAIve is publicly\naccessible at https://huggingface.co/spaces/raj-tomar001/MGT-New. The video\ndescribing our system is available at https://youtu.be/E8eT_bE7k8c.", "paper_summary_zh": "大型語言模型 (LLM) 被廣泛應用於大眾，大幅擴大了機器產生的文本 (MGT) 的傳播。提示操作的進步加劇了辨別文本來源（人工撰寫與機器產生）的難度。這引起了對 MGT 可能被濫用的擔憂，特別是在教育和學術領域。在本文中，我們提出了 $\\textbf{LLM-DetectAIve}$，一個專門設計用於精細 MGT 檢測的系統。它能夠將文本分類為四種類別：人工撰寫、機器產生、機器撰寫人工化，以及人工撰寫機器潤飾。與執行二元分類的先前 MGT 檢測器相反，在 LLM-DetectiAIve 中引入兩個額外的類別，提供了對文本創建過程中 LLM 介入程度的不同見解。這可能在某些領域（如教育）中很有用，在這些領域中通常禁止任何 LLM 介入。實驗表明，LLM-DetectAIve 可以有效識別文本內容的作者，證明了它在加強教育、學術和其他領域的誠信方面的有用性。LLM-DetectAIve 可在 https://huggingface.co/spaces/raj-tomar001/MGT-New 公開獲得。描述我們系統的影片可在 https://youtu.be/E8eT_bE7k8c 取得。", "author": "Mervat Abassy et.al.", "authors": "Mervat Abassy, Kareem Elozeiri, Alexander Aziz, Minh Ngoc Ta, Raj Vardhan Tomar, Bimarsha Adhikari, Saad El Dine Ahmed, Yuxia Wang, Osama Mohammed Afzal, Zhuohan Xie, Jonibek Mansurov, Ekaterina Artemova, Vladislav Mikhailov, Rui Xing, Jiahui Geng, Hasan Iqbal, Zain Muhammad Mujahid, Tarek Mahmoud, Akim Tsvigun, Alham Fikri Aji, Artem Shelmanov, Nizar Habash, Iryna Gurevych, Preslav Nakov", "id": "2408.04284v1", "paper_url": "http://arxiv.org/abs/2408.04284v1", "repo": "null"}}