{"2405.06499": {"publish_time": "2024-05-10", "title": "Aspect-based Sentiment Evaluation of Chess Moves (ASSESS): an NLP-based Method for Evaluating Chess Strategies from Textbooks", "paper_summary": "The chess domain is well-suited for creating an artificial intelligence (AI)\nsystem that mimics real-world challenges, including decision-making. Throughout\nthe years, minimal attention has been paid to investigating insights derived\nfrom unstructured chess data sources. In this study, we examine the complicated\nrelationships between multiple referenced moves in a chess-teaching textbook,\nand propose a novel method designed to encapsulate chess knowledge derived from\nmove-action phrases. This study investigates the feasibility of using a\nmodified sentiment analysis method as a means for evaluating chess moves based\non text. Our proposed Aspect-Based Sentiment Analysis (ABSA) method represents\nan advancement in evaluating the sentiment associated with referenced chess\nmoves. By extracting insights from move-action phrases, our approach aims to\nprovide a more fine-grained and contextually aware `chess move'-based sentiment\nclassification. Through empirical experiments and analysis, we evaluate the\nperformance of our fine-tuned ABSA model, presenting results that confirm the\nefficiency of our approach in advancing aspect-based sentiment classification\nwithin the chess domain. This research contributes to the area of game-playing\nby machines and shows the practical applicability of leveraging NLP techniques\nto understand the context of strategic games.", "paper_summary_zh": "西洋棋領域非常適合建立人工智慧 (AI) 系統，模擬包括決策制定在內的真實世界挑戰。多年來，對於從非結構化西洋棋數據來源中衍生的見解的研究一直很少。在這項研究中，我們探討了西洋棋教學教科書中多個參考著法之間的複雜關係，並提出了一種新穎的方法，旨在封裝從著法短語中衍生的西洋棋知識。本研究探討了使用改良的情感分析方法作為評估基於文字的西洋棋著法的可行性。我們提出的基於面向切面的情感分析 (ABSA) 方法代表了評估與參考西洋棋著法相關的情感的進步。通過從著法短語中提取見解，我們的目標是提供更細緻且具有情境感知的「西洋棋著法」為基礎的情感分類。透過實證實驗和分析，我們評估了我們微調後的 ABSA 模型的效能，呈現的結果證實了我們的方法在推進西洋棋領域中基於面向切面的情感分類的有效性。這項研究有助於機器遊戲領域，並展示了利用自然語言處理技術來理解策略遊戲背景的實際應用性。", "author": "Haifa Alrdahi et.al.", "authors": "Haifa Alrdahi, Riza Batista-Navarro", "id": "2405.06499v1", "paper_url": "http://arxiv.org/abs/2405.06499v1", "repo": "null"}}