{"2501.05443": {"publish_time": "2025-01-09", "title": "A survey of textual cyber abuse detection using cutting-edge language models and large language models", "paper_summary": "The success of social media platforms has facilitated the emergence of\nvarious forms of online abuse within digital communities. This abuse manifests\nin multiple ways, including hate speech, cyberbullying, emotional abuse,\ngrooming, and sexting. In this paper, we present a comprehensive analysis of\nthe different forms of abuse prevalent in social media, with a particular focus\non how emerging technologies, such as Language Models (LMs) and Large Language\nModels (LLMs), are reshaping both the detection and generation of abusive\ncontent within these networks. We delve into the mechanisms through which\nsocial media abuse is perpetuated, exploring the psychological and social\nimpact. Additionally, we examine the dual role of advanced language\nmodels-highlighting their potential to enhance automated detection systems for\nabusive behavior while also acknowledging their capacity to generate harmful\ncontent. This paper aims to contribute to the ongoing discourse on online\nsafety and ethics, offering insights into the evolving landscape of cyberabuse\nand the technological innovations that both mitigate and exacerbate it.", "paper_summary_zh": "社群媒體平台的成功促成了數位社群中各種形式網路霸凌的出現。這種霸凌以多種方式表現，包括仇恨言論、網路霸凌、情緒虐待、誘騙和性簡訊。在本文中，我們對社群媒體中普遍存在的不同形式的霸凌進行了全面的分析，特別關注了新興技術（例如語言模型 (LM) 和大型語言模型 (LLM)）如何重新塑造這些網路中攻擊性內容的偵測和產生。我們深入探討了社群媒體霸凌持續存在的方式，探討了心理和社會影響。此外，我們探討了進階語言模型的雙重角色，強調了它們增強自動偵測系統以偵測攻擊性行為的潛力，同時也承認它們產生有害內容的能力。本文旨在為網路安全和道德的持續討論做出貢獻，提供對網路霸凌演變態勢的見解，以及減輕和加劇網路霸凌的技術創新。", "author": "Jose A. Diaz-Garcia et.al.", "authors": "Jose A. Diaz-Garcia, Joao Paulo Carvalho", "id": "2501.05443v1", "paper_url": "http://arxiv.org/abs/2501.05443v1", "repo": "null"}}