{"2406.11598": {"publish_time": "2024-06-17", "title": "Understanding \"Democratization\" in NLP and ML Research", "paper_summary": "Recent improvements in natural language processing (NLP) and machine learning\n(ML) and increased mainstream adoption have led to researchers frequently\ndiscussing the \"democratization\" of artificial intelligence. In this paper, we\nseek to clarify how democratization is understood in NLP and ML publications,\nthrough large-scale mixed-methods analyses of papers using the keyword\n\"democra*\" published in NLP and adjacent venues. We find that democratization\nis most frequently used to convey (ease of) access to or use of technologies,\nwithout meaningfully engaging with theories of democratization, while research\nusing other invocations of \"democra*\" tends to be grounded in theories of\ndeliberation and debate. Based on our findings, we call for researchers to\nenrich their use of the term democratization with appropriate theory, towards\ndemocratic technologies beyond superficial access.", "paper_summary_zh": "<paragraph>自然語言處理 (NLP) 和機器學習 (ML) 近期的進展，以及主流應用的增加，已導致研究人員頻繁地討論人工智慧的「民主化」。在本文中，我們試圖釐清在 NLP 和 ML 出版物中，民主化是如何被理解的，透過使用關鍵字「democra*」在 NLP 和相關領域發表的論文進行大規模的混合方法分析。我們發現民主化最常被用來傳達（容易）取得或使用技術，而沒有有意義地探討民主化理論，而使用其他「democra*」的呼籲的研究則傾向於以審議和辯論的理論為基礎。根據我們的發現，我們呼籲研究人員以適當的理論豐富他們對民主化一詞的使用，朝向超越表面取得的民主技術。</paragraph>", "author": "Arjun Subramonian et.al.", "authors": "Arjun Subramonian, Vagrant Gautam, Dietrich Klakow, Zeerak Talat", "id": "2406.11598v1", "paper_url": "http://arxiv.org/abs/2406.11598v1", "repo": "null"}}