{"2410.17637": {"publish_time": "2024-10-23", "title": "MIA-DPO: Multi-Image Augmented Direct Preference Optimization For Large Vision-Language Models", "paper_summary": "Visual preference alignment involves training Large Vision-Language Models\n(LVLMs) to predict human preferences between visual inputs. This is typically\nachieved by using labeled datasets of chosen/rejected pairs and employing\noptimization algorithms like direct preference optimization (DPO). Existing\nvisual alignment methods, primarily designed for single-image scenarios,\nstruggle to effectively handle the complexity of multi-image tasks due to the\nscarcity of diverse training data and the high cost of annotating\nchosen/rejected pairs. We present Multi-Image Augmented Direct Preference\nOptimization (MIA-DPO), a visual preference alignment approach that effectively\nhandles multi-image inputs. MIA-DPO mitigates the scarcity of diverse\nmulti-image training data by extending single-image data with unrelated images\narranged in grid collages or pic-in-pic formats, significantly reducing the\ncosts associated with multi-image data annotations. Our observation reveals\nthat attention values of LVLMs vary considerably across different images. We\nuse attention values to identify and filter out rejected responses the model\nmay have mistakenly focused on. Our attention-aware selection for constructing\nthe chosen/rejected pairs without relying on (i) human annotation, (ii) extra\ndata, and (iii) external models or APIs. MIA-DPO is compatible with various\narchitectures and outperforms existing methods on five multi-image benchmarks,\nachieving an average performance boost of 3.0% on LLaVA-v1.5 and 4.3% on the\nrecent InternLM-XC2.5. Moreover, MIA-DPO has a minimal effect on the model's\nability to understand single images.", "paper_summary_zh": "視覺偏好對齊涉及訓練大型視覺語言模型 (LVLMs) 以預測人類在視覺輸入之間的偏好。這通常透過使用已選擇/已拒絕配對的標籤資料集，並採用直接偏好最佳化 (DPO) 等最佳化演算法來達成。現有的視覺對齊方法主要設計用於單一影像場景，由於缺乏多樣化的訓練資料，以及標註已選擇/已拒絕配對的高成本，因此難以有效處理多重影像任務的複雜性。我們提出多重影像擴充直接偏好最佳化 (MIA-DPO)，這是一種視覺偏好對齊方法，能夠有效處理多重影像輸入。MIA-DPO 透過將單一影像資料擴充為排列成網格拼貼或畫中畫格式的無關影像，來減輕多樣化多重影像訓練資料的稀缺性，大幅降低多重影像資料標註相關的成本。我們的觀察顯示，LVLMs 的注意力值在不同影像之間有顯著差異。我們使用注意力值來識別和篩選出模型可能錯誤關注的已拒絕回應。我們使用注意力感知選擇來建構已選擇/已拒絕配對，而不依賴 (i) 人工標註、(ii) 額外資料，以及 (iii) 外部模型或 API。MIA-DPO 與各種架構相容，並且在五個多重影像基準上優於現有方法，在 LLaVA-v1.5 上達到平均效能提升 3.0%，在最近的 InternLM-XC2.5 上達到 4.3%。此外，MIA-DPO 對模型理解單一影像的能力影響甚微。", "author": "Ziyu Liu et.al.", "authors": "Ziyu Liu, Yuhang Zang, Xiaoyi Dong, Pan Zhang, Yuhang Cao, Haodong Duan, Conghui He, Yuanjun Xiong, Dahua Lin, Jiaqi Wang", "id": "2410.17637v1", "paper_url": "http://arxiv.org/abs/2410.17637v1", "repo": "https://github.com/liuziyu77/mia-dpo"}}