{"2411.18309": {"publish_time": "2024-11-27", "title": "MvKeTR: Chest CT Report Generation with Multi-View Perception and Knowledge Enhancement", "paper_summary": "CT report generation (CTRG) aims to automatically generate diagnostic reports\nfor 3D volumes, relieving clinicians' workload and improving patient care.\nDespite clinical value, existing works fail to effectively incorporate\ndiagnostic information from multiple anatomical views and lack related clinical\nexpertise essential for accurate and reliable diagnosis. To resolve these\nlimitations, we propose a novel Multi-view perception Knowledge-enhanced\nTansformer (MvKeTR) to mimic the diagnostic workflow of clinicians. Just as\nradiologists first examine CT scans from multiple planes, a Multi-View\nPerception Aggregator (MVPA) with view-aware attention effectively synthesizes\ndiagnostic information from multiple anatomical views. Then, inspired by how\nradiologists further refer to relevant clinical records to guide diagnostic\ndecision-making, a Cross-Modal Knowledge Enhancer (CMKE) retrieves the most\nsimilar reports based on the query volume to incorporate domain knowledge into\nthe diagnosis procedure. Furthermore, instead of traditional MLPs, we employ\nKolmogorov-Arnold Networks (KANs) with learnable nonlinear activation functions\nas the fundamental building blocks of both modules to better capture intricate\ndiagnostic patterns in CT interpretation. Extensive experiments on the public\nCTRG-Chest-548K dataset demonstrate that our method outpaces prior\nstate-of-the-art models across all metrics.", "paper_summary_zh": "電腦斷層報告生成（CTRG）旨在自動生成 3D 體積的診斷報告，減輕臨床醫師的工作量並改善患者照護。\n儘管具有臨床價值，現有研究無法有效整合來自多個解剖視圖的診斷資訊，並且缺乏準確且可靠診斷所必需的相關臨床專業知識。為了解決這些限制，我們提出了一種新穎的多視覺感知知識增強轉換器 (MvKeTR) 來模擬臨床醫師的診斷工作流程。正如放射科醫師首先從多個平面檢查電腦斷層掃描，具有視圖感知注意力的多視覺感知聚合器 (MVPA) 有效地綜合了來自多個解剖視圖的診斷資訊。接著，受到放射科醫師如何進一步參考相關臨床記錄來指導診斷決策的啟發，跨模態知識增強器 (CMKE) 基於查詢體積擷取最相似的報告，以將領域知識納入診斷程序。此外，我們採用具有可學習非線性啟用函數的 Kolmogorov-Arnold 網路 (KAN) 作為兩個模組的基本建構模組，而不是傳統的多層感知器，以在電腦斷層詮釋中更好地擷取複雜的診斷模式。在公共 CTRG-Chest-548K 資料集上的廣泛實驗證明，我們的模型在所有指標上都超越了先前的最先進模型。", "author": "Xiwei Deng et.al.", "authors": "Xiwei Deng, Xianchun He, Yudan Zhou, Shuhui Cai, Congbo Cai, Zhong Chen", "id": "2411.18309v1", "paper_url": "http://arxiv.org/abs/2411.18309v1", "repo": "null"}}