{"2501.03540": {"publish_time": "2025-01-07", "title": "Deep Learning within Tabular Data: Foundations, Challenges, Advances and Future Directions", "paper_summary": "Tabular data remains one of the most prevalent data types across a wide range\nof real-world applications, yet effective representation learning for this\ndomain poses unique challenges due to its irregular patterns, heterogeneous\nfeature distributions, and complex inter-column dependencies. This survey\nprovides a comprehensive review of state-of-the-art techniques in tabular data\nrepresentation learning, structured around three foundational design elements:\ntraining data, neural architectures, and learning objectives. Unlike prior\nsurveys that focus primarily on either architecture design or learning\nstrategies, we adopt a holistic perspective that emphasizes the universality\nand robustness of representation learning methods across diverse downstream\ntasks. We examine recent advances in data augmentation and generation,\nspecialized neural network architectures tailored to tabular data, and\ninnovative learning objectives that enhance representation quality.\nAdditionally, we highlight the growing influence of self-supervised learning\nand the adaptation of transformer-based foundation models for tabular data. Our\nreview is based on a systematic literature search using rigorous inclusion\ncriteria, encompassing 127 papers published since 2020 in top-tier conferences\nand journals. Through detailed analysis and comparison, we identify emerging\ntrends, critical gaps, and promising directions for future research, aiming to\nguide the development of more generalizable and effective tabular data\nrepresentation methods.", "paper_summary_zh": "表格資料仍然是廣泛實際應用中最普遍的資料類型之一，但由於其不規則模式、異質特徵分布和複雜的欄位間依賴關係，有效的表示學習對此領域提出了獨特挑戰。這份調查提供了表格資料表示學習中最新技術的全面回顧，其結構圍繞三個基本設計元素：訓練資料、神經架構和學習目標。與先前主要關注架構設計或學習策略的調查不同，我們採用整體觀點，強調表示學習方法在不同下游任務中的普遍性和穩健性。我們審查了資料擴充和生成的最新進展、專門針對表格資料的神經網路架構，以及增強表示品質的創新學習目標。此外，我們強調了自監督學習日益增長的影響力，以及基於 Transformer 的基礎模型對於表格資料的適應。我們的回顧基於系統性的文獻檢索，採用嚴謹的納入標準，涵蓋了自 2020 年以來發表於頂尖會議和期刊中的 127 篇論文。透過詳細的分析和比較，我們找出新興趨勢、關鍵差距和未來研究的有希望方向，旨在引導更具概括性和有效性的表格資料表示方法的發展。", "author": "Weijieying Ren et.al.", "authors": "Weijieying Ren, Tianxiang Zhao, Yuqing Huang, Vasant Honavar", "id": "2501.03540v1", "paper_url": "http://arxiv.org/abs/2501.03540v1", "repo": "null"}}