{"2407.20663": {"publish_time": "2024-07-30", "title": "ArabicNLU 2024: The First Arabic Natural Language Understanding Shared Task", "paper_summary": "This paper presents an overview of the Arabic Natural Language Understanding\n(ArabicNLU 2024) shared task, focusing on two subtasks: Word Sense\nDisambiguation (WSD) and Location Mention Disambiguation (LMD). The task aimed\nto evaluate the ability of automated systems to resolve word ambiguity and\nidentify locations mentioned in Arabic text. We provided participants with\nnovel datasets, including a sense-annotated corpus for WSD, called SALMA with\napproximately 34k annotated tokens, and the IDRISI-DA dataset with 3,893\nannotations and 763 unique location mentions. These are challenging tasks. Out\nof the 38 registered teams, only three teams participated in the final\nevaluation phase, with the highest accuracy being 77.8% for WSD and the highest\nMRR@1 being 95.0% for LMD. The shared task not only facilitated the evaluation\nand comparison of different techniques, but also provided valuable insights and\nresources for the continued advancement of Arabic NLU technologies.", "paper_summary_zh": "這篇論文概述了阿拉伯自然語言理解（ArabicNLU 2024）共享任務，重點關注兩個子任務：詞彙意義消歧（WSD）和地點標記消歧（LMD）。該任務旨在評估自動化系統解決詞彙歧義和識別阿拉伯語文本中所提地點的能力。我們為參與者提供了新穎的資料集，包括一個用於 WSD 的感官註釋語料庫，稱為 SALMA，大約有 34k 個註釋符號，以及 IDRISI-DA 資料集，其中有 3,893 個註釋和 763 個唯一的地點標記。這些都是艱鉅的任務。在 38 個註冊團隊中，只有三個團隊參與了最終評估階段，WSD 的最高準確度為 77.8%，LMD 的最高 MRR@1 為 95.0%。共享任務不僅促进了不同技術的評估和比較，而且還為阿拉伯語 NLU 技術的持續進步提供了寶貴的見解和資源。", "author": "Mohammed Khalilia et.al.", "authors": "Mohammed Khalilia, Sanad Malaysha, Reem Suwaileh, Mustafa Jarrar, Alaa Aljabari, Tamer Elsayed, Imed Zitouni", "id": "2407.20663v1", "paper_url": "http://arxiv.org/abs/2407.20663v1", "repo": "null"}}