{"2410.19123": {"publish_time": "2024-10-24", "title": "Read-ME: Refactorizing LLMs as Router-Decoupled Mixture of Experts with System Co-Design", "paper_summary": "The proliferation of large language models (LLMs) has led to the adoption of\nMixture-of-Experts (MoE) architectures that dynamically leverage specialized\nsubnetworks for improved efficiency and performance. Despite their benefits,\nMoE models face significant challenges during inference, including inefficient\nmemory management and suboptimal batching, due to misaligned design choices\nbetween the model architecture and the system policies. Furthermore, the\nconventional approach of training MoEs from scratch is increasingly prohibitive\nin terms of cost. In this paper, we propose a novel framework Read-ME that\ntransforms pre-trained dense LLMs into smaller MoE models (in contrast to\n\"upcycling\" generalist MoEs), avoiding the high costs of ground-up training.\nOur approach employs activation sparsity to extract experts. To compose\nexperts, we examine the widely-adopted layer-wise router design and show its\nredundancy, and thus we introduce the pre-gating router decoupled from the MoE\nbackbone that facilitates system-friendly pre-computing and lookahead\nscheduling, enhancing expert-aware batching and caching. Our codesign therefore\naddresses critical gaps on both the algorithmic and system fronts, establishing\na scalable and efficient alternative for LLM inference in resource-constrained\nsettings. Read-ME outperforms other popular open-source dense models of similar\nscales, achieving improvements of up to 10.1% on MMLU, and improving mean\nend-to-end latency up to 6.1%. Codes are available at:\nhttps://github.com/VITA-Group/READ-ME.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 的激增導致採用混合專家 (MoE) 架構，該架構動態利用專業子網路來提高效率和效能。儘管有其優點，MoE 模型在推論期間仍面臨重大挑戰，包括由於模型架構和系統政策之間的設計選擇不一致，導致記憶體管理效率低下和批次處理次佳。此外，從頭訓練 MoE 的傳統方法在成本方面越來越令人望而卻步。在本文中，我們提出一個新穎的框架 Read-ME，將預先訓練的密集 LLM 轉換成較小的 MoE 模型（與「升級」通才 MoE 相反），避免從頭訓練的高昂成本。我們的做法採用激活稀疏性來提取專家。為了組成專家，我們檢視廣泛採用的逐層路由器設計並顯示其冗餘，因此我們引入了與 MoE 主幹分離的預閘門路由器，它有助於系統友善的預先運算和前瞻排程，增強專家感知的批次處理和快取。因此，我們的共同設計解決了演算法和系統方面的關鍵差距，為資源受限設定中的 LLM 推論建立了一個可擴充且高效的替代方案。Read-ME 優於其他流行的類似規模開源密集模型，在 MMLU 上實現高達 10.1% 的改進，並將平均端到端延遲時間改善高達 6.1%。程式碼可在以下位置取得：\nhttps://github.com/VITA-Group/READ-ME。</paragraph>", "author": "Ruisi Cai et.al.", "authors": "Ruisi Cai, Yeonju Ro, Geon-Woo Kim, Peihao Wang, Babak Ehteshami Bejnordi, Aditya Akella, Zhangyang Wang", "id": "2410.19123v1", "paper_url": "http://arxiv.org/abs/2410.19123v1", "repo": "null"}}