{"2410.22081": {"publish_time": "2024-10-29", "title": "Choosy Babies Need One Coach: Inducing Mode-Seeking Behavior in BabyLlama with Reverse KL Divergence", "paper_summary": "This study presents our submission to the Strict-Small Track of the 2nd\nBabyLM Challenge. We use a teacher-student distillation setup with the\nBabyLLaMa model (Timiryasov and Tastet, 2023) as a backbone. To make the\nstudent's learning process more focused, we replace the objective function with\na reverse Kullback-Leibler divergence, known to cause mode-seeking (rather than\nmode-averaging) behaviour in computational learners. We further experiment with\nhaving a single teacher (instead of an ensemble of two teachers) and implement\nadditional optimization strategies to improve the distillation process. Our\nexperiments show that under reverse KL divergence, a single-teacher model often\noutperforms or matches multiple-teacher models across most tasks. Additionally,\nincorporating advanced optimization techniques further enhances model\nperformance, demonstrating the effectiveness and robustness of our proposed\napproach. These findings support our idea that \"choosy babies need one coach\".", "paper_summary_zh": "本研究展示了我們對第二屆 BabyLM 挑戰賽的嚴格小型賽道的提交。我們使用教師-學生蒸餾設置，以 BabyLLaMa 模型（Timiryasov 和 Tastet，2023 年）作為骨幹。為了讓學生的學習過程更加專注，我們用反向 Kullback-Leibler 散度取代目標函數，已知這會導致計算學習者的模式尋求（而非模式平均）行為。我們進一步嘗試擁有一個單一教師（而不是兩個教師的集合），並實施額外的最佳化策略來改善蒸餾過程。我們的實驗表明，在反向 KL 散度下，單教師模型通常在大部分任務中優於或匹配多教師模型。此外，結合先進的最佳化技術進一步增強了模型效能，證明了我們提出的方法的有效性和穩健性。這些發現支持了我們的觀點，即「挑剔的嬰兒需要一位教練」。", "author": "Shaozhen Shi et.al.", "authors": "Shaozhen Shi, Yevgen Matusevych, Malvina Nissim", "id": "2410.22081v1", "paper_url": "http://arxiv.org/abs/2410.22081v1", "repo": "null"}}