{"2409.18946": {"publish_time": "2024-09-27", "title": "Unconditional stability of a recurrent neural circuit implementing divisive normalization", "paper_summary": "Stability in recurrent neural models poses a significant challenge,\nparticularly in developing biologically plausible neurodynamical models that\ncan be seamlessly trained. Traditional cortical circuit models are notoriously\ndifficult to train due to expansive nonlinearities in the dynamical system,\nleading to an optimization problem with nonlinear stability constraints that\nare difficult to impose. Conversely, recurrent neural networks (RNNs) excel in\ntasks involving sequential data but lack biological plausibility and\ninterpretability. In this work, we address these challenges by linking dynamic\ndivisive normalization (DN) to the stability of ORGaNICs, a biologically\nplausible recurrent cortical circuit model that dynamically achieves DN and has\nbeen shown to simulate a wide range of neurophysiological phenomena. By using\nthe indirect method of Lyapunov, we prove the remarkable property of\nunconditional local stability for an arbitrary-dimensional ORGaNICs circuit\nwhen the recurrent weight matrix is the identity. We thus connect ORGaNICs to a\nsystem of coupled damped harmonic oscillators, which enables us to derive the\ncircuit's energy function, providing a normative principle of what the circuit,\nand individual neurons, aim to accomplish. Further, for a generic recurrent\nweight matrix, we prove the stability of the 2D model and demonstrate\nempirically that stability holds in higher dimensions. Finally, we show that\nORGaNICs can be trained by backpropagation through time without gradient\nclipping/scaling, thanks to its intrinsic stability property and adaptive time\nconstants, which address the problems of exploding, vanishing, and oscillating\ngradients. By evaluating the model's performance on RNN benchmarks, we find\nthat ORGaNICs outperform alternative neurodynamical models on static image\nclassification tasks and perform comparably to LSTMs on sequential tasks.", "paper_summary_zh": "<paragraph>遞迴神經模型的穩定性是一個重大的挑戰，\n特別是在開發可無縫訓練的生物學上可行的神經動力學模型時。傳統的皮質迴路模型由於動力系統中廣泛的非線性而難以訓練，\n導致優化問題具有難以施加的非線性穩定性約束。相反，遞迴神經網路 (RNN) 在涉及序列數據的任務中表現出色，但缺乏生物學上的可信度和可解釋性。在這項工作中，我們通過將動態除法正規化 (DN) 與 ORGaNICs 的穩定性聯繫起來來應對這些挑戰，ORGaNICs 是一個生物學上可行的遞迴皮質迴路模型，可以動態實現 DN，並且已被證明可以模擬廣泛的神經生理現象。通過使用李亞普諾夫的間接方法，我們證明了任意維度 ORGaNICs 迴路的無條件局部穩定性的顯著特性，當遞迴權重矩陣為恆等矩陣時。因此，我們將 ORGaNICs 連接到一個耦合阻尼諧振子的系統，這使我們能夠推導出電路的能量函數，提供電路和個別神經元旨在實現的規範原理。此外，對於一個通用的遞迴權重矩陣，我們證明了 2D 模型的穩定性，並通過經驗證明了穩定性在更高維度中成立。最後，我們表明 ORGaNICs 可以通過時間反向傳播進行訓練，而無需梯度截斷/縮放，這要歸功於其固有的穩定性特性和自適應時間常數，這些特性解決了梯度爆炸、消失和振盪的問題。通過評估模型在 RNN 基準上的性能，我們發現 ORGaNICs 在靜態圖像分類任務中優於其他神經動力學模型，並且在序列任務中與 LSTM 的性能相當。</paragraph>", "author": "Shivang Rawat et.al.", "authors": "Shivang Rawat, David J. Heeger, Stefano Martiniani", "id": "2409.18946v1", "paper_url": "http://arxiv.org/abs/2409.18946v1", "repo": "null"}}