{"2406.03995": {"publish_time": "2024-06-06", "title": "AC4MPC: Actor-Critic Reinforcement Learning for Nonlinear Model Predictive Control", "paper_summary": "\\Ac{MPC} and \\ac{RL} are two powerful control strategies with, arguably,\ncomplementary advantages. In this work, we show how actor-critic \\ac{RL}\ntechniques can be leveraged to improve the performance of \\ac{MPC}. The \\ac{RL}\ncritic is used as an approximation of the optimal value function, and an actor\nroll-out provides an initial guess for primal variables of the \\ac{MPC}. A\nparallel control architecture is proposed where each \\ac{MPC} instance is\nsolved twice for different initial guesses. Besides the actor roll-out\ninitialization, a shifted initialization from the previous solution is used.\nThereafter, the actor and the critic are again used to approximately evaluate\nthe infinite horizon cost of these trajectories. The control actions from the\nlowest-cost trajectory are applied to the system at each time step. We\nestablish that the proposed algorithm is guaranteed to outperform the original\n\\ac{RL} policy plus an error term that depends on the accuracy of the critic\nand decays with the horizon length of the \\ac{MPC} formulation. Moreover, we do\nnot require globally optimal solutions for these guarantees to hold. The\napproach is demonstrated on an illustrative toy example and an \\ac{AD}\novertaking scenario.", "paper_summary_zh": "\\Ac{MPC} 和 \\ac{RL} 是两种强大的控制策略，可以争辩说，具有互补的优势。在这项工作中，我们展示了如何利用 actor-critic \\ac{RL} 技术来提高 \\ac{MPC} 的性能。\\ac{RL} 评论者用作最优值函数的近似值，并且 actor roll-out 为 \\ac{MPC} 的原始变量提供初始猜测。提出了一种并行控制架构，其中每个 \\ac{MPC} 实例针对不同的初始猜测求解两次。除了 actor roll-out 初始化之外，还使用了前一个解的偏移初始化。此后，actor 和评论者再次用于近似评估这些轨迹的无限范围成本。来自最低成本轨迹的控制动作在每个时间步长应用于系统。我们确定所提出的算法保证优于原始 \\ac{RL} 策略，加上一个误差项，该误差项取决于评论者的准确性，并随着 \\ac{MPC} 公式的范围长度而衰减。此外，我们不需要全局最优解来保持这些保证。该方法在一个说明性玩具示例和一个 \\ac{AD} 超车场景中得到证明。", "author": "Rudolf Reiter et.al.", "authors": "Rudolf Reiter, Andrea Ghezzi, Katrin Baumgärtner, Jasper Hoffmann, Robert D. McAllister, Moritz Diehl", "id": "2406.03995v1", "paper_url": "http://arxiv.org/abs/2406.03995v1", "repo": "null"}}