{"2412.13647": {"publish_time": "2024-12-18", "title": "G-VEval: A Versatile Metric for Evaluating Image and Video Captions Using GPT-4o", "paper_summary": "Evaluation metric of visual captioning is important yet not thoroughly\nexplored. Traditional metrics like BLEU, METEOR, CIDEr, and ROUGE often miss\nsemantic depth, while trained metrics such as CLIP-Score, PAC-S, and Polos are\nlimited in zero-shot scenarios. Advanced Language Model-based metrics also\nstruggle with aligning to nuanced human preferences. To address these issues,\nwe introduce G-VEval, a novel metric inspired by G-Eval and powered by the new\nGPT-4o. G-VEval uses chain-of-thought reasoning in large multimodal models and\nsupports three modes: reference-free, reference-only, and combined,\naccommodating both video and image inputs. We also propose MSVD-Eval, a new\ndataset for video captioning evaluation, to establish a more transparent and\nconsistent framework for both human experts and evaluation metrics. It is\ndesigned to address the lack of clear criteria in existing datasets by\nintroducing distinct dimensions of Accuracy, Completeness, Conciseness, and\nRelevance (ACCR). Extensive results show that G-VEval outperforms existing\nmethods in correlation with human annotations, as measured by Kendall tau-b and\nKendall tau-c. This provides a flexible solution for diverse captioning tasks\nand suggests a straightforward yet effective approach for large language models\nto understand video content, paving the way for advancements in automated\ncaptioning. Codes are available at https://github.com/ztangaj/gveval", "paper_summary_zh": "視覺字幕的評估指標很重要，但尚未被徹底探討。BLEU、METEOR、CIDEr 和 ROUGE 等傳統指標經常遺漏語義深度，而 CLIP-Score、PAC-S 和 Polos 等訓練指標則在零次學習場景中受到限制。基於先進語言模型的指標也難以與細微的人類偏好保持一致。為了解決這些問題，我們引入了 G-VEval，這是一種受 G-Eval 啟發並由新的 GPT-4o 提供支持的新指標。G-VEval 在大型多模態模型中使用思維鏈推理，並支援三種模式：無參考、僅參考和組合，同時容納影片和影像輸入。我們還提出了 MSVD-Eval，這是一個用於影片字幕評估的新資料集，為人類專家和評估指標建立一個更透明且一致的架構。它旨在透過引入準確性、完整性、簡潔性和相關性 (ACCR) 的不同面向來解決現有資料集中缺乏明確標準的問題。廣泛的結果顯示，G-VEval 在與人類註解的相關性方面優於現有方法，以 Kendall tau-b 和 Kendall tau-c 衡量。這為不同的字幕任務提供了一個靈活的解決方案，並為大型語言模型理解影片內容提供了一個簡單但有效的方法，為自動字幕的進步鋪平了道路。程式碼可在 https://github.com/ztangaj/gveval 取得", "author": "Tony Cheng Tong et.al.", "authors": "Tony Cheng Tong, Sirui He, Zhiwen Shao, Dit-Yan Yeung", "id": "2412.13647v1", "paper_url": "http://arxiv.org/abs/2412.13647v1", "repo": "https://github.com/ztangaj/gveval"}}