{"2410.06802": {"publish_time": "2024-10-09", "title": "Seg2Act: Global Context-aware Action Generation for Document Logical Structuring", "paper_summary": "Document logical structuring aims to extract the underlying hierarchical\nstructure of documents, which is crucial for document intelligence. Traditional\napproaches often fall short in handling the complexity and the variability of\nlengthy documents. To address these issues, we introduce Seg2Act, an\nend-to-end, generation-based method for document logical structuring,\nrevisiting logical structure extraction as an action generation task.\nSpecifically, given the text segments of a document, Seg2Act iteratively\ngenerates the action sequence via a global context-aware generative model, and\nsimultaneously updates its global context and current logical structure based\non the generated actions. Experiments on ChCatExt and HierDoc datasets\ndemonstrate the superior performance of Seg2Act in both supervised and transfer\nlearning settings.", "paper_summary_zh": "文件邏輯結構化旨在提取文件的基礎階層結構，這對文件智慧至關重要。傳統方法在處理複雜性和長文件的可變性時，常常力不從心。為了解決這些問題，我們引入了 Seg2Act，一種端到端的、基於生成的用於文件邏輯結構化的方法，將邏輯結構提取重新視為一個動作生成任務。具體來說，給定一個文件的文本片段，Seg2Act 通過一個全局上下文感知生成模型反覆生成動作序列，並根據生成的動作同時更新其全局上下文和當前的邏輯結構。在 ChCatExt 和 HierDoc 數據集上的實驗證明了 Seg2Act 在監督式和遷移式學習設置中都具有優異的性能。", "author": "Zichao Li et.al.", "authors": "Zichao Li, Shaojie He, Meng Liao, Xuanang Chen, Yaojie Lu, Hongyu Lin, Yanxiong Lu, Xianpei Han, Le Sun", "id": "2410.06802v1", "paper_url": "http://arxiv.org/abs/2410.06802v1", "repo": "null"}}