{"2501.13468": {"publish_time": "2025-01-23", "title": "Streaming Video Understanding and Multi-round Interaction with Memory-enhanced Knowledge", "paper_summary": "Recent advances in Large Language Models (LLMs) have enabled the development\nof Video-LLMs, advancing multimodal learning by bridging video data with\nlanguage tasks. However, current video understanding models struggle with\nprocessing long video sequences, supporting multi-turn dialogues, and adapting\nto real-world dynamic scenarios. To address these issues, we propose\nStreamChat, a training-free framework for streaming video reasoning and\nconversational interaction. $\\StreamChat$ leverages a novel hierarchical memory\nsystem to efficiently process and compress video features over extended\nsequences, enabling real-time, multi-turn dialogue. Our framework incorporates\na parallel system scheduling strategy that enhances processing speed and\nreduces latency, ensuring robust performance in real-world applications.\nFurthermore, we introduce StreamBench, a versatile benchmark that evaluates\nstreaming video understanding across diverse media types and interactive\nscenarios, including multi-turn interactions and complex reasoning tasks.\nExtensive evaluations on StreamBench and other public benchmarks demonstrate\nthat StreamChat significantly outperforms existing state-of-the-art models in\nterms of accuracy and response times, confirming its effectiveness for\nstreaming video understanding. Code is available at StreamChat:\nhttps://github.com/hmxiong/StreamChat.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展促成了影片 LLM 的開發，透過將影片資料與語言任務連結，推進多模態學習。然而，目前的影片理解模型在處理長影片序列、支援多輪對話，以及適應真實世界的動態場景方面仍有困難。為了解決這些問題，我們提出 StreamChat，一個無需訓練的串流影片推理和對話互動架構。$\\StreamChat$ 採用創新的階層式記憶體系統，有效處理和壓縮長序列的影片特徵，實現即時、多輪對話。我們的架構結合了平行系統排程策略，增強處理速度並降低延遲，確保在真實世界應用中的強健效能。此外，我們引入了 StreamBench，一個多功能基準，用於評估串流影片理解在不同媒體類型和互動場景中的表現，包括多輪互動和複雜的推理任務。在 StreamBench 和其他公開基準上的廣泛評估證明，StreamChat 在準確性和回應時間方面顯著優於現有的最先進模型，證實了其在串流影片理解方面的效能。程式碼可在 StreamChat 取得：\nhttps://github.com/hmxiong/StreamChat。", "author": "Haomiao Xiong et.al.", "authors": "Haomiao Xiong, Zongxin Yang, Jiazuo Yu, Yunzhi Zhuge, Lu Zhang, Jiawen Zhu, Huchuan Lu", "id": "2501.13468v1", "paper_url": "http://arxiv.org/abs/2501.13468v1", "repo": "https://github.com/hmxiong/streamchat"}}