{"2502.13031": {"publish_time": "2025-02-18", "title": "HPSS: Heuristic Prompting Strategy Search for LLM Evaluators", "paper_summary": "Since the adoption of large language models (LLMs) for text evaluation has\nbecome increasingly prevalent in the field of natural language processing\n(NLP), a series of existing works attempt to optimize the prompts for LLM\nevaluators to improve their alignment with human judgment. However, their\nefforts are limited to optimizing individual factors of evaluation prompts,\nsuch as evaluation criteria or output formats, neglecting the combinatorial\nimpact of multiple factors, which leads to insufficient optimization of the\nevaluation pipeline. Nevertheless, identifying well-behaved prompting\nstrategies for adjusting multiple factors requires extensive enumeration. To\nthis end, we comprehensively integrate 8 key factors for evaluation prompts and\npropose a novel automatic prompting strategy optimization method called\nHeuristic Prompting Strategy Search (HPSS). Inspired by the genetic algorithm,\nHPSS conducts an iterative search to find well-behaved prompting strategies for\nLLM evaluators. A heuristic function is employed to guide the search process,\nenhancing the performance of our algorithm. Extensive experiments across four\nevaluation tasks demonstrate the effectiveness of HPSS, consistently\noutperforming both human-designed evaluation prompts and existing automatic\nprompt optimization methods.", "paper_summary_zh": "隨著自然語言處理（NLP）領域中採用大型語言模型（LLM）進行文本評估變得越來越普遍，一系列現有工作嘗試優化 LLM 評估器的提示，以改善它們與人類判斷的一致性。然而，他們的努力僅限於優化評估提示的個別因素，例如評估準則或輸出格式，而忽略了多種因素的組合影響，這導致評估管道優化不足。儘管如此，找出調整多種因素的良好提示策略需要廣泛的枚舉。為此，我們全面整合了評估提示的 8 個關鍵因素，並提出了一種名為啟發式提示策略搜索（HPSS）的新型自動提示策略優化方法。在遺傳演算法的啟發下，HPSS 進行反覆搜索以找出 LLM 評估器的良好提示策略。採用啟發式函數來指導搜索過程，增強了我們演算法的效能。在四項評估任務中進行的廣泛實驗證明了 HPSS 的有效性，始終優於人類設計的評估提示和現有的自動提示優化方法。", "author": "Bosi Wen et.al.", "authors": "Bosi Wen, Pei Ke, Yufei Sun, Cunxiang Wang, Xiaotao Gu, Jinfeng Zhou, Jie Tang, Hongning Wang, Minlie Huang", "id": "2502.13031v1", "paper_url": "http://arxiv.org/abs/2502.13031v1", "repo": "null"}}