{"2503.06797": {"publish_time": "2025-03-09", "title": "Multimodal AI-driven Biomarker for Early Detection of Cancer Cachexia", "paper_summary": "Cancer cachexia is a multifactorial syndrome characterized by progressive\nmuscle wasting, metabolic dysfunction, and systemic inflammation, leading to\nreduced quality of life and increased mortality. Despite extensive research, no\nsingle definitive biomarker exists, as cachexia-related indicators such as\nserum biomarkers, skeletal muscle measurements, and metabolic abnormalities\noften overlap with other conditions. Existing composite indices, including the\nCancer Cachexia Index (CXI), Modified CXI (mCXI), and Cachexia Score (CASCO),\nintegrate multiple biomarkers but lack standardized thresholds, limiting their\nclinical utility. This study proposes a multimodal AI-based biomarker for early\ncancer cachexia detection, leveraging open-source large language models (LLMs)\nand foundation models trained on medical data. The approach integrates\nheterogeneous patient data, including demographics, disease status, lab\nreports, radiological imaging (CT scans), and clinical notes, using a machine\nlearning framework that can handle missing data. Unlike previous AI-based\nmodels trained on curated datasets, this method utilizes routinely collected\nclinical data, enhancing real-world applicability. Additionally, the model\nincorporates confidence estimation, allowing the identification of cases\nrequiring expert review for precise clinical interpretation. Preliminary\nfindings demonstrate that integrating multiple data modalities improves\ncachexia prediction accuracy at the time of cancer diagnosis. The AI-based\nbiomarker dynamically adapts to patient-specific factors such as age, race,\nethnicity, weight, cancer type, and stage, avoiding the limitations of\nfixed-threshold biomarkers. This multimodal AI biomarker provides a scalable\nand clinically viable solution for early cancer cachexia detection,\nfacilitating personalized interventions and potentially improving treatment\noutcomes and patient survival.", "paper_summary_zh": "<paragraph>癌症惡病質是一種多因素症候群，其特徵是進行性肌肉萎縮、代謝功能障礙和全身性發炎，導致生活品質下降和死亡率增加。儘管進行了廣泛的研究，但由於惡病質相關指標（例如血清生物標記、骨骼肌測量值和代謝異常）經常與其他疾病重疊，因此並不存在單一的明確生物標記。現有的綜合指數，包括癌症惡病質指數 (CXI)、改良 CXI (mCXI) 和惡病質評分 (CASCO)，整合了多種生物標記，但缺乏標準化的閾值，限制了它們的臨床應用價值。本研究提出了一種基於多模態 AI 的生物標記，用於早期癌症惡病質檢測，它利用了開源的大型語言模型 (LLM) 和基於醫學數據訓練的基礎模型。該方法使用可以處理缺失數據的機器學習框架，整合了異質患者數據，包括人口統計學資料、疾病狀態、實驗室報告、放射影像學（CT 掃描）和臨床記錄。與先前基於策劃數據集訓練的基於 AI 的模型不同，此方法利用常規收集的臨床數據，增強了現實世界的適用性。此外，該模型還包含置信度估計，允許識別需要專家審查以進行精確臨床解釋的病例。初步研究結果表明，整合多種數據模式可以提高癌症診斷時惡病質預測的準確性。基於 AI 的生物標記會根據患者的特定因素（例如年齡、種族、民族、體重、癌症類型和分期）進行動態調整，避免了固定閾值生物標記的局限性。這種多模態 AI 生物標記為早期癌症惡病質檢測提供了一種可擴展且臨床可行的解決方案，有助於個性化干預，並可能改善治療結果和患者存活率。</paragraph>\n", "author": "Sabeen Ahmed et.al.", "authors": "Sabeen Ahmed, Nathan Parker, Margaret Park, Evan W. Davis, Jennifer B. Permuth, Matthew B. Schabath, Yasin Yilmaz, Ghulam Rasool", "id": "2503.06797v1", "paper_url": "http://arxiv.org/abs/2503.06797v1", "repo": "null"}}