{"2406.08979": {"publish_time": "2024-06-13", "title": "Multi-Agent Software Development through Cross-Team Collaboration", "paper_summary": "The latest breakthroughs in Large Language Models (LLMs), eg., ChatDev, have\ncatalyzed profound transformations, particularly through multi-agent\ncollaboration for software development. LLM agents can collaborate in teams\nlike humans, and follow the waterfall model to sequentially work on\nrequirements analysis, development, review, testing, and other phases to\nperform autonomous software generation. However, for an agent team, each phase\nin a single development process yields only one possible outcome. This results\nin the completion of only one development chain, thereby losing the opportunity\nto explore multiple potential decision paths within the solution space.\nConsequently, this may lead to obtaining suboptimal results. To address this\nchallenge, we introduce Cross-Team Collaboration (CTC), a scalable multi-team\nframework that enables orchestrated teams to jointly propose various decisions\nand communicate with their insights in a cross-team collaboration environment\nfor superior content generation. Experimental results in software development\nreveal a notable increase in quality compared to state-of-the-art baselines,\nunderscoring the efficacy of our framework. The significant improvements in\nstory generation demonstrate the promising generalization ability of our\nframework across various domains. We anticipate that our work will guide LLM\nagents towards a cross-team paradigm and contribute to their significant growth\nin but not limited to software development. The code and data will be available\nat https://github.com/OpenBMB/ChatDev.", "paper_summary_zh": "大型語言模型 (LLM) 的最新突破，例如 ChatDev，已經催化了深刻的轉變，特別是透過多重代理的軟體開發合作。LLM 代理可以像人類一樣在團隊中合作，並遵循瀑布模型依序處理需求分析、開發、檢閱、測試和其他階段，以執行自主軟體生成。然而，對於一個代理團隊來說，單一開發流程中的每個階段只會產生一個可能的結果。這導致只完成一個開發鏈，從而失去在解決方案空間中探索多個潛在決策路徑的機會。因此，這可能會導致獲得次優的結果。為了應對這個挑戰，我們引入了跨團隊協作 (CTC)，這是一個可擴充的多團隊架構，使協調的團隊能夠共同提出各種決策，並在跨團隊協作環境中透過見解進行溝通，以進行優質內容生成。軟體開發的實驗結果顯示，與現有的基準相比，品質顯著提升，突顯了我們架構的功效。故事生成方面的大幅改進證明了我們架構在各種領域中具有良好的泛化能力。我們預期我們的成果將引導 LLM 代理朝向跨團隊典範，並為其在軟體開發（但不限於此）方面做出重大貢獻。程式碼和資料將於 https://github.com/OpenBMB/ChatDev 提供。", "author": "Zhuoyun Du et.al.", "authors": "Zhuoyun Du, Chen Qian, Wei Liu, Zihao Xie, Yifei Wang, Yufan Dang, Weize Chen, Cheng Yang", "id": "2406.08979v1", "paper_url": "http://arxiv.org/abs/2406.08979v1", "repo": "https://github.com/openbmb/chatdev"}}