{"2405.11637": {"publish_time": "2024-05-19", "title": "Zero-Shot Stance Detection using Contextual Data Generation with LLMs", "paper_summary": "Stance detection, the classification of attitudes expressed in a text towards\na specific topic, is vital for applications like fake news detection and\nopinion mining. However, the scarcity of labeled data remains a challenge for\nthis task. To address this problem, we propose Dynamic Model Adaptation with\nContextual Data Generation (DyMoAdapt) that combines Few-Shot Learning and\nLarge Language Models. In this approach, we aim to fine-tune an existing model\nat test time. We achieve this by generating new topic-specific data using\nGPT-3. This method could enhance performance by allowing the adaptation of the\nmodel to new topics. However, the results did not increase as we expected.\nFurthermore, we introduce the Multi Generated Topic VAST (MGT-VAST) dataset,\nwhich extends VAST using GPT-3. In this dataset, each context is associated\nwith multiple topics, allowing the model to understand the relationship between\ncontexts and various potential topics", "paper_summary_zh": "立場偵測，將文本中對特定主題表達的態度進行分類，對於假新聞偵測和意見探勘等應用至關重要。然而，標記資料的稀少性仍然是這項任務的挑戰。為了解決這個問題，我們提出結合少量學習和大語言模型的動態模型適應與脈絡資料生成（DyMoAdapt）。在這種方法中，我們旨在在測試時微調現有模型。我們通過使用 GPT-3 生成新的主題特定資料來實現這一點。這種方法可以通過允許模型適應新主題來提高性能。然而，結果並未如我們預期的那樣增加。此外，我們引入了多生成主題 VAST（MGT-VAST）資料集，它使用 GPT-3 擴充了 VAST。在這個資料集中，每個脈絡都與多個主題相關聯，允許模型了解脈絡與各種潛在主題之間的關係", "author": "Ghazaleh Mahmoudi et.al.", "authors": "Ghazaleh Mahmoudi, Babak Behkamkia, Sauleh Eetemadi", "id": "2405.11637v1", "paper_url": "http://arxiv.org/abs/2405.11637v1", "repo": "null"}}