{"2501.03119": {"publish_time": "2025-01-06", "title": "From Models to Network Topologies: A Topology Inference Attack in Decentralized Federated Learning", "paper_summary": "Federated Learning (FL) is widely recognized as a privacy-preserving machine\nlearning paradigm due to its model-sharing mechanism that avoids direct data\nexchange. However, model training inevitably leaves exploitable traces that can\nbe used to infer sensitive information. In Decentralized FL (DFL), the overlay\ntopology significantly influences its models' convergence, robustness, and\nsecurity. This study explores the feasibility of inferring the overlay topology\nof DFL systems based solely on model behavior, introducing a novel Topology\nInference Attack. A taxonomy of topology inference attacks is proposed,\ncategorizing them by the attacker's capabilities and knowledge. Practical\nattack strategies are developed for different scenarios, and quantitative\nexperiments are conducted to identify key factors influencing the attack\neffectiveness. Experimental results demonstrate that analyzing only the public\nmodels of individual nodes can accurately infer the DFL topology, underscoring\nthe risk of sensitive information leakage in DFL systems. This finding offers\nvaluable insights for improving privacy preservation in decentralized learning\nenvironments.", "paper_summary_zh": "聯邦學習 (FL) 由於其避免直接資料交換的模型共享機制，被廣泛認為是一種保護隱私的機器學習範例。然而，模型訓練不可避免地會留下可利用的痕跡，可被用於推斷敏感資訊。在分散式 FL (DFL) 中，疊加拓撲結構顯著影響其模型的收斂性、穩健性和安全性。本研究探討僅根據模型行為推斷 DFL 系統疊加拓撲結構的可行性，並引入了一種新型的拓撲推斷攻擊。提出了一種拓撲推斷攻擊分類法，根據攻擊者的能力和知識對其進行分類。針對不同的場景制定了實用的攻擊策略，並進行了定量實驗以找出影響攻擊有效性的關鍵因素。實驗結果表明，僅分析個別節點的公開模型就可以準確推斷出 DFL 拓撲結構，這強調了 DFL 系統中敏感資訊洩漏的風險。這一發現為改善分散式學習環境中的隱私保護提供了寶貴的見解。", "author": "Chao Feng et.al.", "authors": "Chao Feng, Yuanzhe Gao, Alberto Huertas Celdran, Gerome Bovet, Burkhard Stiller", "id": "2501.03119v1", "paper_url": "http://arxiv.org/abs/2501.03119v1", "repo": "null"}}