{"2412.18163": {"publish_time": "2024-12-24", "title": "Survey of Pseudonymization, Abstractive Summarization & Spell Checker for Hindi and Marathi", "paper_summary": "India's vast linguistic diversity presents unique challenges and\nopportunities for technological advancement, especially in the realm of Natural\nLanguage Processing (NLP). While there has been significant progress in NLP\napplications for widely spoken languages, the regional languages of India, such\nas Marathi and Hindi, remain underserved. Research in the field of NLP for\nIndian regional languages is at a formative stage and holds immense\nsignificance. The paper aims to build a platform which enables the user to use\nvarious features like text anonymization, abstractive text summarization and\nspell checking in English, Hindi and Marathi language. The aim of these tools\nis to serve enterprise and consumer clients who predominantly use Indian\nRegional Languages.", "paper_summary_zh": "印度廣泛的語言多元性為技術進步帶來了獨特的挑戰和機遇，特別是在自然語言處理 (NLP) 領域。儘管廣泛使用的語言的 NLP 應用已取得顯著進展，但印度的區域語言，如馬拉地語和印地語，仍未得到充分利用。印度區域語言 NLP 領域的研究處於形成階段，具有重大意義。本文旨在建立一個平台，使用戶能夠使用各種功能，例如英文、印地語和馬拉地語的文本匿名化、抽象文本摘要和拼寫檢查。這些工具的目的是為主要使用印度區域語言的企業和消費者客戶提供服務。", "author": "Rasika Ransing et.al.", "authors": "Rasika Ransing, Mohammed Amaan Dhamaskar, Ayush Rajpurohit, Amey Dhoke, Sanket Dalvi", "id": "2412.18163v1", "paper_url": "http://arxiv.org/abs/2412.18163v1", "repo": "null"}}