{"2412.02868": {"publish_time": "2024-12-03", "title": "A Novel Compact LLM Framework for Local, High-Privacy EHR Data Applications", "paper_summary": "Large Language Models (LLMs) have shown impressive capabilities in natural\nlanguage processing, yet their use in sensitive domains like healthcare,\nparticularly with Electronic Health Records (EHR), faces significant challenges\ndue to privacy concerns and limited computational resources. This paper\npresents a compact LLM framework designed for local deployment in settings with\nstrict privacy requirements and limited access to high-performance GPUs. We\nintroduce a novel preprocessing technique that uses information extraction\nmethods, e.g., regular expressions, to filter and emphasize critical\ninformation in clinical notes, enhancing the performance of smaller LLMs on EHR\ndata. Our framework is evaluated using zero-shot and few-shot learning\nparadigms on both private and publicly available (MIMIC-IV) datasets, and we\nalso compare its performance with fine-tuned LLMs on the MIMIC-IV dataset. The\nresults demonstrate that our preprocessing approach significantly boosts the\nprediction accuracy of smaller LLMs, making them suitable for high-privacy,\nresource-constrained applications. This study offers valuable insights into\noptimizing LLM performance for sensitive, data-intensive tasks while addressing\ncomputational and privacy limitations.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言處理方面展現出令人印象深刻的能力，然而它們在醫療保健等敏感領域的使用，特別是電子健康紀錄 (EHR)，由於隱私問題和有限的運算資源而面臨重大挑戰。本文提出了一個緊湊的 LLM 框架，旨在在具有嚴格隱私要求和有限使用高性能 GPU 的環境中進行本地部署。我們引入了一種新穎的預處理技術，它使用資訊萃取方法，例如正規表示法，來過濾和強調臨床筆記中的關鍵資訊，增強較小 LLM 在 EHR 資料上的效能。我們的框架使用零次學習和少次學習範例在私人和公開可用的 (MIMIC-IV) 資料集上進行評估，我們也比較它在 MIMIC-IV 資料集上與微調 LLM 的效能。結果表明，我們的預處理方法顯著提升了較小 LLM 的預測準確度，使其適用於高度隱私、資源受限的應用程式。這項研究提供了寶貴的見解，用於最佳化 LLM 效能以應對敏感、資料密集型任務，同時解決運算和隱私限制。", "author": "Yixiang Qu et.al.", "authors": "Yixiang Qu, Yifan Dai, Shilin Yu, Pradham Tanikella, Travis Schrank, Trevor Hackman, Didong Li, Di Wu", "id": "2412.02868v1", "paper_url": "http://arxiv.org/abs/2412.02868v1", "repo": "null"}}