{"2412.04093": {"publish_time": "2024-12-05", "title": "Practical Considerations for Agentic LLM Systems", "paper_summary": "As the strength of Large Language Models (LLMs) has grown over recent years,\nso too has interest in their use as the underlying models for autonomous\nagents. Although LLMs demonstrate emergent abilities and broad expertise across\nnatural language domains, their inherent unpredictability makes the\nimplementation of LLM agents challenging, resulting in a gap between related\nresearch and the real-world implementation of such systems. To bridge this gap,\nthis paper frames actionable insights and considerations from the research\ncommunity in the context of established application paradigms to enable the\nconstruction and facilitate the informed deployment of robust LLM agents.\nNamely, we position relevant research findings into four broad\ncategories--Planning, Memory, Tools, and Control Flow--based on common\npractices in application-focused literature and highlight practical\nconsiderations to make when designing agentic LLMs for real-world applications,\nsuch as handling stochasticity and managing resources efficiently. While we do\nnot conduct empirical evaluations, we do provide the necessary background for\ndiscussing critical aspects of agentic LLM designs, both in academia and\nindustry.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的實力在近年來大幅提升，\n將其用作自主代理人的基礎模型也備受關注。儘管 LLM 在自然語言領域展現出新興的能力和廣泛的專業知識，但其固有的不可預測性使得 LLM 代理人的實作充滿挑戰，導致相關研究與此類系統的實際實作之間出現差距。為了彌補這個差距，本文在既定的應用範例脈絡中，架構出可行的見解和研究社群的考量，以利建構和促進穩健 LLM 代理人的明智部署。具體來說，我們根據應用為重點的文獻中的常見做法，將相關的研究發現定位在四個廣泛的類別中，分別為規劃、記憶、工具和控制流程，並重點說明在為實際應用設計代理 LLM 時應考量的實務考量，例如處理隨機性和有效管理資源。儘管我們未進行經驗評估，但我們確實提供了必要的背景，以便討論代理 LLM 設計中的關鍵面向，無論是在學術界或業界皆然。", "author": "Chris Sypherd et.al.", "authors": "Chris Sypherd, Vaishak Belle", "id": "2412.04093v1", "paper_url": "http://arxiv.org/abs/2412.04093v1", "repo": "null"}}