{"2410.10408": {"publish_time": "2024-10-14", "title": "Medico: Towards Hallucination Detection and Correction with Multi-source Evidence Fusion", "paper_summary": "As we all know, hallucinations prevail in Large Language Models (LLMs), where\nthe generated content is coherent but factually incorrect, which inflicts a\nheavy blow on the widespread application of LLMs. Previous studies have shown\nthat LLMs could confidently state non-existent facts rather than answering ``I\ndon't know''. Therefore, it is necessary to resort to external knowledge to\ndetect and correct the hallucinated content. Since manual detection and\ncorrection of factual errors is labor-intensive, developing an automatic\nend-to-end hallucination-checking approach is indeed a needful thing. To this\nend, we present Medico, a Multi-source evidence fusion enhanced hallucination\ndetection and correction framework. It fuses diverse evidence from multiple\nsources, detects whether the generated content contains factual errors,\nprovides the rationale behind the judgment, and iteratively revises the\nhallucinated content. Experimental results on evidence retrieval (0.964 HR@5,\n0.908 MRR@5), hallucination detection (0.927-0.951 F1), and hallucination\ncorrection (0.973-0.979 approval rate) manifest the great potential of Medico.\nA video demo of Medico can be found at https://youtu.be/RtsO6CSesBI.", "paper_summary_zh": "眾所周知，大型語言模型 (LLM) 盛行幻覺，其中產生的內容連貫但事實不正確，對 LLM 的廣泛應用造成沉重打擊。先前的研究表明，LLM 可以自信地陳述不存在的事實，而不是回答「我不知道」。因此，有必要訴諸外部知識來檢測和更正幻覺內容。由於人工檢測和更正事實錯誤非常耗費人力，因此開發一種自動化的端到端幻覺檢查方法確實是一件必要的事情。為此，我們提出了 Medico，一個多源證據融合增強的幻覺檢測和更正框架。它融合了來自多個來源的不同證據，檢測生成的內容是否包含事實錯誤，提供判斷背後的理由，並反覆修改幻覺內容。證據檢索（0.964 HR@5、0.908 MRR@5）、幻覺檢測（0.927-0.951 F1）和幻覺更正（0.973-0.979 認可率）的實驗結果證明了 Medico 的巨大潛力。可以在 https://youtu.be/RtsO6CSesBI 找到 Medico 的影片示範。", "author": "Xinping Zhao et.al.", "authors": "Xinping Zhao, Jindi Yu, Zhenyu Liu, Jifang Wang, Dongfang Li, Yibin Chen, Baotian Hu, Min Zhang", "id": "2410.10408v1", "paper_url": "http://arxiv.org/abs/2410.10408v1", "repo": "null"}}