{"2409.14302": {"publish_time": "2024-09-22", "title": "PretextTrans: Investigating Medical Factual Knowledge Mastery of LLMs with Predicate-text Dual Transformation", "paper_summary": "In the study, we aim to investigate current LLMs' mastery of medical factual\nknowledge with a dynamic evaluation schema, which can automatically generate\nmultiple test samples for each medical factual knowledge point. Test samples\nproduced directly by LLMs always introduce factual errors and lack diversity in\nthe manner of knowledge expression. To overcome the drawbacks, here we propose\na novel evaluation method, Predicate-text Dual Transformation (PretextTrans),\nby introducing predicate transformations into the dynamic evaluation schema.\nSpecifically, each medical knowledge point is firstly transformed into a\npredicate expression; then, the predicate expression derives a series of\nvariants through predicate transformations; lastly, the produced predicate\nvariants are transformed back into textual expressions, resulting in a series\nof test samples with both factual reliability and expression diversity. Using\nthe proposed PretextTrans method, we systematically investigate 12 well-known\nLLMs' mastery of medical factual knowledge based on two medical datasets. The\ncomparison results show that current LLMs still have significant deficiencies\nin fully mastering medical knowledge, which may illustrate why current LLMs\nstill perform unsatisfactorily in real-world medical scenarios despite having\nachieved considerable performance on public benchmarks. Our proposed method\nserves as an effective solution for evaluation of LLMs in medical domain and\noffers valuable insights for developing medical-specific LLMs.", "paper_summary_zh": "<paragraph>在研究中，我們旨在使用動態評估架構來調查當前 LLM 對醫學事實知識的掌握情況，該架構可以自動為每個醫學事實知識點生成多個測試樣本。由 LLM 直接產生的測試樣本總是會引入事實錯誤，並且在知識表達方式上缺乏多樣性。為了克服這些缺點，我們在此提出了一種新的評估方法，即謂詞-文本雙重轉換 (PretextTrans)，通過將謂詞轉換引入動態評估架構中。具體來說，每個醫學知識點首先被轉換為謂詞表達式；然後，謂詞表達式通過謂詞轉換得到一系列變體；最後，產生的謂詞變體被轉換回文本表達式，從而產生一系列既具有事實可靠性又具有表達多樣性的測試樣本。使用所提出的 PretextTrans 方法，我們系統地調查了 12 個著名的 LLM 對基於兩個醫學數據集的醫學事實知識的掌握情況。比較結果表明，當前 LLM 在完全掌握醫學知識方面仍然存在顯著的缺陷，這可能說明了為什麼當前 LLM 在現實世界的醫學場景中表現仍然不令人滿意，儘管在公共基準上取得了顯著的表現。我們提出的方法作為一種有效的解決方案，用於評估醫學領域的 LLM，並為開發特定於醫學的 LLM 提供了寶貴的見解。</paragraph>", "author": "Yuxuan Zhou et.al.", "authors": "Yuxuan Zhou, Xien Liu, Chen Ning, Ji Wu", "id": "2409.14302v1", "paper_url": "http://arxiv.org/abs/2409.14302v1", "repo": "null"}}