{"2411.19502": {"publish_time": "2024-11-29", "title": "Knowledge-Data Fusion Based Source-Free Semi-Supervised Domain Adaptation for Seizure Subtype Classification", "paper_summary": "Electroencephalogram (EEG)-based seizure subtype classification enhances\nclinical diagnosis efficiency. Source-free semi-supervised domain adaptation\n(SF-SSDA), which transfers a pre-trained model to a new dataset with no source\ndata and limited labeled target data, can be used for privacy-preserving\nseizure subtype classification. This paper considers two challenges in SF-SSDA\nfor EEG-based seizure subtype classification: 1) How to effectively fuse both\nraw EEG data and expert knowledge in classifier design? 2) How to align the\nsource and target domain distributions for SF-SSDA? We propose a Knowledge-Data\nFusion based SF-SSDA approach, KDF-MutualSHOT, for EEG-based seizure subtype\nclassification. In source model training, KDF uses Jensen-Shannon Divergence to\nfacilitate mutual learning between a feature-driven Decision Tree-based model\nand a data-driven Transformer-based model. To adapt KDF to a new target\ndataset, an SF-SSDA algorithm, MutualSHOT, is developed, which features a\nconsistency-based pseudo-label selection strategy. Experiments on the public\nTUSZ and CHSZ datasets demonstrated that KDF-MutualSHOT outperformed other\nsupervised and source-free domain adaptation approaches in cross-subject\nseizure subtype classification.", "paper_summary_zh": "基於腦電圖 (EEG) 的癲癇亞型分類可提升臨床診斷效率。無來源半監督領域適應 (SF-SSDA) 可將預先訓練的模型轉移至沒有來源資料且標籤目標資料有限的新資料集，可用於隱私保護的癲癇亞型分類。本文探討 SF-SSDA 在基於 EEG 的癲癇亞型分類中的兩個挑戰：1) 如何有效融合原始 EEG 資料和分類器設計中的專家知識？2) 如何調整 SF-SSDA 的來源和目標網域分佈？我們提出一個基於知識資料融合的 SF-SSDA 方法，KDF-MutualSHOT，用於基於 EEG 的癲癇亞型分類。在來源模型訓練中，KDF 使用 Jensen-Shannon 距離促進特徵驅動的決策樹模型和資料驅動的 Transformer 模型之間的相互學習。為了將 KDF 調整至新的目標資料集，開發了一個 SF-SSDA 演算法，MutualSHOT，其特點是基於一致性的偽標籤選擇策略。在公開的 TUSZ 和 CHSZ 資料集上的實驗表明，KDF-MutualSHOT 在跨受試者癲癇亞型分類中優於其他監督式和無來源領域適應方法。", "author": "Ruimin Peng et.al.", "authors": "Ruimin Peng, Jiayu An, Dongrui Wu", "id": "2411.19502v1", "paper_url": "http://arxiv.org/abs/2411.19502v1", "repo": "null"}}