{"2407.11606": {"publish_time": "2024-07-16", "title": "The Foundations of Tokenization: Statistical and Computational Concerns", "paper_summary": "Tokenization - the practice of converting strings of characters over an\nalphabet into sequences of tokens over a vocabulary - is a critical yet\nunder-theorized step in the NLP pipeline. Notably, it remains the only major\nstep not fully integrated into widely used end-to-end neural models. This paper\naims to address this theoretical gap by laying the foundations of tokenization\nfrom a formal perspective. By articulating and extending basic properties about\nthe category of stochastic maps, we propose a unified framework for\nrepresenting and analyzing tokenizer models. This framework allows us to\nestablish general conditions for the use of tokenizers. In particular, we\nformally establish the necessary and sufficient conditions for a tokenizer\nmodel to preserve the consistency of statistical estimators. Additionally, we\ndiscuss statistical and computational concerns crucial for the design and\nimplementation of tokenizer models. The framework and results advanced in this\npaper represent a step toward a robust theoretical foundation for neural\nlanguage modeling.", "paper_summary_zh": "分詞 - 將字母表上的字元串轉換為詞彙上的符號序列的做法 - 是 NLP 管線中一個關鍵但理論化不足的步驟。值得注意的是，它仍然是唯一一個尚未完全整合到廣泛使用的端到端神經模型中的主要步驟。本文旨在通過從形式的角度奠定分詞的基礎來解決這個理論差距。通過闡述和擴展關於隨機映射類別的基本屬性，我們提出了用於表示和分析分詞器模型的統一框架。這個框架讓我們能夠為分詞器的使用建立一般條件。特別是，我們正式建立了分詞器模型保持統計估計器一致性的必要和充分條件。此外，我們討論了對分詞器模型的設計和實作至關重要的統計和計算問題。本文提出的框架和結果代表了朝向穩健的神經語言模型理論基礎邁出的一步。", "author": "Juan Luis Gastaldi et.al.", "authors": "Juan Luis Gastaldi, John Terilla, Luca Malagutti, Brian DuSell, Tim Vieira, Ryan Cotterell", "id": "2407.11606v1", "paper_url": "http://arxiv.org/abs/2407.11606v1", "repo": "null"}}