{"2410.03502": {"publish_time": "2024-10-04", "title": "CliMedBench: A Large-Scale Chinese Benchmark for Evaluating Medical Large Language Models in Clinical Scenarios", "paper_summary": "With the proliferation of Large Language Models (LLMs) in diverse domains,\nthere is a particular need for unified evaluation standards in clinical medical\nscenarios, where models need to be examined very thoroughly. We present\nCliMedBench, a comprehensive benchmark with 14 expert-guided core clinical\nscenarios specifically designed to assess the medical ability of LLMs across 7\npivot dimensions. It comprises 33,735 questions derived from real-world medical\nreports of top-tier tertiary hospitals and authentic examination exercises. The\nreliability of this benchmark has been confirmed in several ways. Subsequent\nexperiments with existing LLMs have led to the following findings: (i) Chinese\nmedical LLMs underperform on this benchmark, especially where medical reasoning\nand factual consistency are vital, underscoring the need for advances in\nclinical knowledge and diagnostic accuracy. (ii) Several general-domain LLMs\ndemonstrate substantial potential in medical clinics, while the limited input\ncapacity of many medical LLMs hinders their practical use. These findings\nreveal both the strengths and limitations of LLMs in clinical scenarios and\noffer critical insights for medical research.", "paper_summary_zh": "隨著大型語言模型 (LLM) 在不同領域的普及，在需要非常徹底地檢查模型的臨床醫療場景中，特別需要統一的評估標準。我們提出 CliMedBench，這是一個全面的基準，包含 14 個專家指導的核心臨床場景，專門用於評估 LLM 在 7 個樞紐維度中的醫療能力。它包含 33,735 個問題，這些問題來自頂級三級醫院的真實醫療報告和真實的考試練習。此基準的可靠性已通過多種方式得到確認。隨後對現有 LLM 進行的實驗得出以下發現：(i) 中文醫療 LLM 在此基準上的表現不佳，尤其是在醫療推理和事實一致性至關重要的情況下，這強調了對臨床知識和診斷準確性進步的需求。(ii) 幾個通用領域的 LLM 在醫療診所中表現出巨大的潛力，而許多醫療 LLM 的輸入容量有限，阻礙了它們的實際使用。這些發現揭示了 LLM 在臨床場景中的優點和局限性，並為醫學研究提供了重要的見解。", "author": "Zetian Ouyang et.al.", "authors": "Zetian Ouyang, Yishuai Qiu, Linlin Wang, Gerard de Melo, Ya Zhang, Yanfeng Wang, Liang He", "id": "2410.03502v1", "paper_url": "http://arxiv.org/abs/2410.03502v1", "repo": "null"}}