{"2407.01142": {"publish_time": "2024-07-01", "title": "Integrated feature analysis for deep learning interpretation and class activation maps", "paper_summary": "Understanding the decisions of deep learning (DL) models is essential for the\nacceptance of DL to risk-sensitive applications. Although methods, like class\nactivation maps (CAMs), give a glimpse into the black box, they do miss some\ncrucial information, thereby limiting its interpretability and merely providing\nthe considered locations of objects. To provide more insight into the models\nand the influence of datasets, we propose an integrated feature analysis\nmethod, which consists of feature distribution analysis and feature\ndecomposition, to look closer into the intermediate features extracted by DL\nmodels. This integrated feature analysis could provide information on\noverfitting, confounders, outliers in datasets, model redundancies and\nprincipal features extracted by the models, and provide distribution\ninformation to form a common intensity scale, which are missing in current CAM\nalgorithms. The integrated feature analysis was applied to eight different\ndatasets for general validation: photographs of handwritten digits, two\ndatasets of natural images and five medical datasets, including skin\nphotography, ultrasound, CT, X-rays and MRIs. The method was evaluated by\ncalculating the consistency between the CAMs average class activation levels\nand the logits of the model. Based on the eight datasets, the correlation\ncoefficients through our method were all very close to 100%, and based on the\nfeature decomposition, 5%-25% of features could generate equally informative\nsaliency maps and obtain the same model performances as using all features.\nThis proves the reliability of the integrated feature analysis. As the proposed\nmethods rely on very few assumptions, this is a step towards better model\ninterpretation and a useful extension to existing CAM algorithms. Codes:\nhttps://github.com/YanliLi27/IFA", "paper_summary_zh": "<paragraph>了解深度學習（DL）模型的決策對於風險敏感應用程式接受 DL 至關重要。儘管方法（如類別激勵映射 (CAM)）讓黑盒子得以一窺究竟，但它們仍遺漏了一些關鍵資訊，因而限制了解釋能力，僅提供物件被考慮的位置。為了更深入瞭解模型和資料集的影響，我們提出了一種整合特徵分析方法，包括特徵分佈分析和特徵分解，以更仔細地檢視 DL 模型提取的中間特徵。這種整合特徵分析可以提供有關過度擬合、混淆變數、資料集中的異常值、模型冗餘和模型提取的主要特徵的資訊，並提供分佈資訊以形成共同的強度量表，這是目前 CAM 演算法所缺少的。整合特徵分析已應用於八個不同的資料集以進行一般驗證：手寫數字照片、兩個自然影像資料集和五個醫學資料集，包括皮膚攝影、超音波、電腦斷層掃描、X 光和 MRI。該方法透過計算 CAM 平均類別激勵層級與模型的 logit 值之間的一致性來評估。根據這八個資料集，我們的方法得出的相關係數都非常接近 100%，根據特徵分解，5%-25% 的特徵可以產生同樣具有資訊性的顯著性圖，並獲得與使用所有特徵相同的模型效能。這證明了整合特徵分析的可靠性。由於所提出的方法依賴的假設很少，因此這是朝向更好的模型解釋邁出的一步，也是對現有 CAM 演算法有用的延伸。程式碼：https://github.com/YanliLi27/IFA</paragraph>", "author": "Yanli Li et.al.", "authors": "Yanli Li, Tahereh Hassanzadeh, Denis P. Shamonin, Monique Reijnierse, Annette H. M. van der Helm-van Mil, Berend C. Stoel", "id": "2407.01142v1", "paper_url": "http://arxiv.org/abs/2407.01142v1", "repo": "https://github.com/yanlili27/ifa"}}