{"2411.19475": {"publish_time": "2024-11-29", "title": "Effective Fine-Tuning of Vision-Language Models for Accurate Galaxy Morphology Analysis", "paper_summary": "Galaxy morphology analysis involves classifying galaxies by their shapes and\nstructures. For this task, directly training domain-specific models on large,\nannotated astronomical datasets is effective but costly. In contrast,\nfine-tuning vision foundation models on a smaller set of astronomical images is\nmore resource-efficient but generally results in lower accuracy. To harness the\nbenefits of both approaches and address their shortcomings, we propose\nGalaxAlign, a novel method that fine-tunes pre-trained foundation models to\nachieve high accuracy on astronomical tasks. Specifically, our method extends a\ncontrastive learning architecture to align three types of data in fine-tuning:\n(1) a set of schematic symbols representing galaxy shapes and structures, (2)\ntextual labels of these symbols, and (3) galaxy images. This way, GalaxAlign\nnot only eliminates the need for expensive pretraining but also enhances the\neffectiveness of fine-tuning. Extensive experiments on galaxy classification\nand similarity search demonstrate that our method effectively fine-tunes\ngeneral pre-trained models for astronomical tasks by incorporating\ndomain-specific multi-modal knowledge.", "paper_summary_zh": "星系形態分析涉及根據星系的形狀和結構對星系進行分類。對於這項任務，直接在大型標註的天文資料集上訓練特定領域模型是有效但代價高昂的。相比之下，在較小的天文圖像集上微調視覺基礎模型在資源上更有效率，但通常會導致較低的準確度。為了利用兩種方法的優點並解決其缺點，我們提出了 GalaxAlign，這是一種新穎的方法，它對預訓練的基礎模型進行微調，以在天文任務上實現高準確度。具體來說，我們的模型擴充了一個對比學習架構，以在微調中對齊三種類型的資料：(1) 一組代表星系形狀和結構的示意符號，(2) 這些符號的文字標籤，以及 (3) 星系圖像。這樣，GalaxAlign 不僅消除了昂貴的預訓練的需要，而且還增強了微調的有效性。在星系分類和相似性搜尋上的大量實驗表明，我們的模型通過整合特定領域的多模態知識，有效地微調了用於天文任務的一般預訓練模型。", "author": "Ruoqi Wang et.al.", "authors": "Ruoqi Wang, Haitao Wang, Qiong Luo", "id": "2411.19475v1", "paper_url": "http://arxiv.org/abs/2411.19475v1", "repo": "null"}}