{"2409.11261": {"publish_time": "2024-09-17", "title": "The Art of Storytelling: Multi-Agent Generative AI for Dynamic Multimodal Narratives", "paper_summary": "This paper introduces the concept of an education tool that utilizes\nGenerative Artificial Intelligence (GenAI) to enhance storytelling for\nchildren. The system combines GenAI-driven narrative co-creation,\ntext-to-speech conversion, and text-to-video generation to produce an engaging\nexperience for learners. We describe the co-creation process, the adaptation of\nnarratives into spoken words using text-to-speech models, and the\ntransformation of these narratives into contextually relevant visuals through\ntext-to-video technology. Our evaluation covers the linguistics of the\ngenerated stories, the text-to-speech conversion quality, and the accuracy of\nthe generated visuals.", "paper_summary_zh": "本文介紹了一種教育工具的概念，它利用生成式人工智能 (GenAI) 來增強兒童說故事的能力。該系統結合了 GenAI 驅動的敘事共同創作、文字轉語音轉換和文字轉影片生成，為學習者創造引人入勝的體驗。我們描述了共同創作過程、使用文字轉語音模型將敘事轉換為口語，以及透過文字轉影片技術將這些敘事轉換為與情境相關的視覺效果。我們的評估涵蓋了生成故事的語言學、文字轉語音轉換品質，以及生成視覺效果的準確性。", "author": "Samee Arif et.al.", "authors": "Samee Arif, Taimoor Arif, Aamina Jamal Khan, Muhammad Saad Haroon, Agha Ali Raza, Awais Athar", "id": "2409.11261v1", "paper_url": "http://arxiv.org/abs/2409.11261v1", "repo": "null"}}