{"2410.24126": {"publish_time": "2024-10-31", "title": "Multi-environment Topic Models", "paper_summary": "Probabilistic topic models are a powerful tool for extracting latent themes\nfrom large text datasets. In many text datasets, we also observe per-document\ncovariates (e.g., source, style, political affiliation) that act as\nenvironments that modulate a \"global\" (environment-agnostic) topic\nrepresentation. Accurately learning these representations is important for\nprediction on new documents in unseen environments and for estimating the\ncausal effect of topics on real-world outcomes. To this end, we introduce the\nMulti-environment Topic Model (MTM), an unsupervised probabilistic model that\nseparates global and environment-specific terms. Through experimentation on\nvarious political content, from ads to tweets and speeches, we show that the\nMTM produces interpretable global topics with distinct environment-specific\nwords. On multi-environment data, the MTM outperforms strong baselines in and\nout-of-distribution. It also enables the discovery of accurate causal effects.", "paper_summary_zh": "機率主題模型是一種從大量文字資料集中萃取隱藏主題的強大工具。在許多文字資料集中，我們也觀察到每個文件的共變量（例如來源、風格、政治傾向），這些共變量會作為環境來調節「全域性」（與環境無關）的主題表徵。準確地學習這些表徵對於預測未見環境中的新文件以及估計主題對現實世界結果的因果關係非常重要。為此，我們引入了多環境主題模型 (MTM)，這是一個非監督的機率模型，可以將全域性和環境特定的術語分開。透過對各種政治內容（從廣告到推文和演講）進行實驗，我們證明 MTM 可以產生具有不同環境特定字詞的可解釋全域性主題。在多環境資料中，MTM 在分佈內外都優於強大的基準線。它還能發現準確的因果關係。", "author": "Dominic Sobhani et.al.", "authors": "Dominic Sobhani, Amir Feder, David Blei", "id": "2410.24126v2", "paper_url": "http://arxiv.org/abs/2410.24126v2", "repo": "null"}}