{"2406.11753": {"publish_time": "2024-06-17", "title": "A Semantic-based Layer Freezing Approach to Efficient Fine-Tuning of Language Models", "paper_summary": "Finetuning language models (LMs) is crucial for adapting the models to\ndownstream data and tasks. However, full finetuning is usually costly. Existing\nwork, such as parameter-efficient finetuning (PEFT), often focuses on\n\\textit{how to finetune} but neglects the issue of \\textit{where to finetune}.\nAs a pioneering work on answering where to finetune (at the layer level), we\nconduct a semantic analysis of the LM inference process. We first propose a\nvirtual transition of the latent representation and then trace its factual\ntransition. Based on the deviation in transitions, we estimate the gain of\nfinetuning each model layer, and further, narrow down the scope for finetuning.\nWe perform extensive experiments across well-known LMs and datasets. The\nresults show that our approach is effective and efficient, and outperforms the\nexisting baselines. Our approach is orthogonal to existing efficient\ntechniques, such as PEFT methods, offering practical values on LM finetuning.", "paper_summary_zh": "微調語言模型 (LM) 對於調整模型以適應下游資料和任務至關重要。然而，完整的微調通常成本很高。現有的工作，例如參數高效微調 (PEFT)，通常側重於「如何微調」，但忽略了「在哪裡微調」的問題。作為回答在哪裡微調（在層級）的開創性工作，我們對 LM 推論過程進行了語義分析。我們首先提出潛在表徵的虛擬轉換，然後追蹤其事實轉換。根據轉換中的偏差，我們估計微調每個模型層的增益，並進一步縮小微調的範圍。我們對著名的 LM 和資料集進行了廣泛的實驗。結果表明，我們的做法有效且高效，並且優於現有的基準。我們的做法與現有的高效技術（例如 PEFT 方法）正交，為 LM 微調提供了實用的價值。", "author": "Jian Gu et.al.", "authors": "Jian Gu, Aldeida Aleti, Chunyang Chen, Hongyu Zhang", "id": "2406.11753v1", "paper_url": "http://arxiv.org/abs/2406.11753v1", "repo": "null"}}