{"2412.09760": {"publish_time": "2024-12-12", "title": "Congruence-based Learning of Probabilistic Deterministic Finite Automata", "paper_summary": "This work studies the question of learning probabilistic deterministic\nautomata from language models. For this purpose, it focuses on analyzing the\nrelations defined on algebraic structures over strings by equivalences and\nsimilarities on probability distributions. We introduce a congruence that\nextends the classical Myhill-Nerode congruence for formal languages. This new\ncongruence is the basis for defining regularity over language models. We\npresent an active learning algorithm that computes the quotient with respect to\nthis congruence whenever the language model is regular. The paper also defines\nthe notion of recognizability for language models and shows that it coincides\nwith regularity for congruences. For relations which are not congruences, it\nshows that this is not the case. Finally, it discusses the impact of this\nresult on learning in the context of language models.", "paper_summary_zh": "本研究探討從語言模型學習機率性確定自動機的問題。為此，它專注於分析由機率分佈上的等價性和相似性在字串上的代數結構所定義的關係。我們引入了一個同餘，它擴充了形式語言的經典 Myhill-Nerode 同餘。這個新的同餘是定義語言模型上正則性的基礎。我們提出了一個主動學習演算法，只要語言模型是正則的，它就會計算相對於這個同餘的商。本文還定義了語言模型的可辨識概念，並表明它與同餘的正則性一致。對於不是同餘的關係，它表明情況並非如此。最後，它討論了這個結果對語言模型中學習的影響。", "author": "Matías Carrasco et.al.", "authors": "Matías Carrasco, Franz Mayr, Sergio Yovine", "id": "2412.09760v1", "paper_url": "http://arxiv.org/abs/2412.09760v1", "repo": "null"}}