{"2409.10829": {"publish_time": "2024-09-17", "title": "ReXErr: Synthesizing Clinically Meaningful Errors in Diagnostic Radiology Reports", "paper_summary": "Accurately interpreting medical images and writing radiology reports is a\ncritical but challenging task in healthcare. Both human-written and\nAI-generated reports can contain errors, ranging from clinical inaccuracies to\nlinguistic mistakes. To address this, we introduce ReXErr, a methodology that\nleverages Large Language Models to generate representative errors within chest\nX-ray reports. Working with board-certified radiologists, we developed error\ncategories that capture common mistakes in both human and AI-generated reports.\nOur approach uses a novel sampling scheme to inject diverse errors while\nmaintaining clinical plausibility. ReXErr demonstrates consistency across error\ncategories and produces errors that closely mimic those found in real-world\nscenarios. This method has the potential to aid in the development and\nevaluation of report correction algorithms, potentially enhancing the quality\nand reliability of radiology reporting.", "paper_summary_zh": "精準地解讀醫學影像並撰寫放射科報告是醫療保健中一項至關重要但具有挑戰性的任務。人寫的報告和 AI 生成的報告都可能包含錯誤，從臨床上的不準確到語言上的錯誤。為了解決這個問題，我們引入了 ReXErr，這是一個利用大型語言模型在胸部 X 光報告中產生代表性錯誤的方法。我們與通過認證的放射科醫師合作，制定了錯誤類別，以找出人寫的報告和 AI 生成的報告中常見的錯誤。我們的做法使用一種新穎的抽樣方案來注入各種錯誤，同時保持臨床上的合理性。ReXErr 在錯誤類別中展現了一致性，並產生了與現實世界場景中發現的錯誤非常相似的錯誤。此方法有可能幫助開發和評估報告修正演算法，進而提升放射科報告的品質和可靠性。", "author": "Vishwanatha M. Rao et.al.", "authors": "Vishwanatha M. Rao, Serena Zhang, Julian N. Acosta, Subathra Adithan, Pranav Rajpurkar", "id": "2409.10829v1", "paper_url": "http://arxiv.org/abs/2409.10829v1", "repo": "null"}}