{"2502.11001": {"publish_time": "2025-02-16", "title": "CL-MFAP: A Contrastive Learning-Based Multimodal Foundation Model for Molecular Property Prediction and Antibiotic Screening", "paper_summary": "Due to the rise in antimicrobial resistance, identifying novel compounds with\nantibiotic potential is crucial for combatting this global health issue.\nHowever, traditional drug development methods are costly and inefficient.\nRecognizing the pressing need for more effective solutions, researchers have\nturned to machine learning techniques to streamline the prediction and\ndevelopment of novel antibiotic compounds. While foundation models have shown\npromise in antibiotic discovery, current mainstream efforts still fall short of\nfully leveraging the potential of multimodal molecular data. Recent studies\nsuggest that contrastive learning frameworks utilizing multimodal data exhibit\nexcellent performance in representation learning across various domains.\nBuilding upon this, we introduce CL-MFAP, an unsupervised contrastive learning\n(CL)-based multimodal foundation (MF) model specifically tailored for\ndiscovering small molecules with potential antibiotic properties (AP) using\nthree types of molecular data. This model employs 1.6 million bioactive\nmolecules with drug-like properties from the ChEMBL dataset to jointly pretrain\nthree encoders: (1) a transformer-based encoder with rotary position embedding\nfor processing SMILES strings; (2) another transformer-based encoder,\nincorporating a novel bi-level routing attention mechanism to handle molecular\ngraph representations; and (3) a Morgan fingerprint encoder using a multilayer\nperceptron, to achieve the contrastive learning purpose. The CL-MFAP\noutperforms baseline models in antibiotic property prediction by effectively\nutilizing different molecular modalities and demonstrates superior\ndomain-specific performance when fine-tuned for antibiotic-related property\nprediction tasks.", "paper_summary_zh": "<paragraph>由於抗菌藥物抗性上升，找出具有抗生素潛力的新型化合物對於對抗此項全球性健康議題至關重要。不過，傳統的藥物開發方法成本高昂且效率不彰。研究人員體認到對於更有效解決方案的迫切需求，因此轉向機器學習技術來簡化新型抗生素化合物的預測和開發。儘管基礎模型在抗生素發現方面展現潛力，目前的普遍做法仍未充分利用多模態分子資料的潛力。最近的研究顯示，利用多模態資料的對比學習架構在各種領域的表徵學習中展現出優異的效能。有鑑於此，我們引進 CL-MFAP，一種無監督對比學習 (CL) 為基礎的多模態基礎 (MF) 模型，專門用於使用三種類型的分子資料發現具有潛在抗生素特性的低分子。此模型採用 ChEMBL 資料集中的 160 萬個具有類藥物特性的生物活性分子，以聯合預訓練三個編碼器：(1) 一個具有旋轉位置嵌入的基於Transformer的編碼器，用於處理 SMILES 字串；(2) 另一個基於Transformer的編碼器，結合一種新穎的雙層路由注意機制來處理分子圖表表徵；以及 (3) 一個使用多層感知器的 Morgan 指紋編碼器，以達成對比學習的目的。CL-MFAP 透過有效利用不同的分子模式在抗生素特性預測方面優於基準模型，並且在針對抗生素相關特性預測任務進行微調時展現出優異的特定領域效能。</paragraph>", "author": "Gen Zhou et.al.", "authors": "Gen Zhou, Sugitha Janarthanan, Yutong Lu, Pingzhao Hu", "id": "2502.11001v1", "paper_url": "http://arxiv.org/abs/2502.11001v1", "repo": "null"}}