{"2412.02104": {"publish_time": "2024-12-03", "title": "Explainable and Interpretable Multimodal Large Language Models: A Comprehensive Survey", "paper_summary": "The rapid development of Artificial Intelligence (AI) has revolutionized\nnumerous fields, with large language models (LLMs) and computer vision (CV)\nsystems driving advancements in natural language understanding and visual\nprocessing, respectively. The convergence of these technologies has catalyzed\nthe rise of multimodal AI, enabling richer, cross-modal understanding that\nspans text, vision, audio, and video modalities. Multimodal large language\nmodels (MLLMs), in particular, have emerged as a powerful framework,\ndemonstrating impressive capabilities in tasks like image-text generation,\nvisual question answering, and cross-modal retrieval. Despite these\nadvancements, the complexity and scale of MLLMs introduce significant\nchallenges in interpretability and explainability, essential for establishing\ntransparency, trustworthiness, and reliability in high-stakes applications.\nThis paper provides a comprehensive survey on the interpretability and\nexplainability of MLLMs, proposing a novel framework that categorizes existing\nresearch across three perspectives: (I) Data, (II) Model, (III) Training \\&\nInference. We systematically analyze interpretability from token-level to\nembedding-level representations, assess approaches related to both architecture\nanalysis and design, and explore training and inference strategies that enhance\ntransparency. By comparing various methodologies, we identify their strengths\nand limitations and propose future research directions to address unresolved\nchallenges in multimodal explainability. This survey offers a foundational\nresource for advancing interpretability and transparency in MLLMs, guiding\nresearchers and practitioners toward developing more accountable and robust\nmultimodal AI systems.", "paper_summary_zh": "<paragraph>人工智慧 (AI) 的快速發展，已經徹底改變了許多領域，其中大型語言模型 (LLM) 和電腦視覺 (CV) 系統分別推動了自然語言理解和視覺處理的進展。這些技術的融合催化了多模態 AI 的興起，實現了跨模態的豐富理解，涵蓋文字、視覺、音訊和視訊模態。特別是多模態大型語言模型 (MLLM)，已經成為一個強大的架構，在影像文字生成、視覺問題解答和跨模態檢索等任務中展現了令人印象深刻的能力。儘管有這些進展，MLLM 的複雜性和規模在可解釋性和可說明性方面帶來了重大的挑戰，而這對於在高風險應用中建立透明度、可信度和可靠性至關重要。本文提供了對 MLLM 的可解釋性和可說明性的全面調查，提出了一個新的架構，將現有的研究分為三個觀點：(I) 資料、(II) 模型、(III) 訓練和推理。我們系統地分析了從符號層級到嵌入層級的表示的可解釋性，評估與架構分析和設計相關的方法，並探討了增強透明度的訓練和推理策略。透過比較各種方法，我們找出它們的優點和限制，並提出未來的研究方向，以解決多模態可說明性中尚未解決的挑戰。本調查提供了一個基礎資源，用於推進 MLLM 的可解釋性和透明度，引導研究人員和實務人員開發更負責任、更強大的多模態 AI 系統。</paragraph>", "author": "Yunkai Dang et.al.", "authors": "Yunkai Dang, Kaichen Huang, Jiahao Huo, Yibo Yan, Sirui Huang, Dongrui Liu, Mengxi Gao, Jie Zhang, Chen Qian, Kun Wang, Yong Liu, Jing Shao, Hui Xiong, Xuming Hu", "id": "2412.02104v1", "paper_url": "http://arxiv.org/abs/2412.02104v1", "repo": "null"}}