{"2406.11695": {"publish_time": "2024-06-17", "title": "Optimizing Instructions and Demonstrations for Multi-Stage Language Model Programs", "paper_summary": "Language Model Programs, i.e. sophisticated pipelines of modular language\nmodel (LM) calls, are increasingly advancing NLP tasks, but they require\ncrafting prompts that are jointly effective for all modules. We study prompt\noptimization for LM programs, i.e. how to update these prompts to maximize a\ndownstream metric without access to module-level labels or gradients. To make\nthis tractable, we factorize our problem into optimizing the free-form\ninstructions and few-shot demonstrations of every module and introduce several\nstrategies to craft task-grounded instructions and navigate credit assignment\nacross modules. Our strategies include (i) program- and data-aware techniques\nfor proposing effective instructions, (ii) a stochastic mini-batch evaluation\nfunction for learning a surrogate model of our objective, and (iii) a\nmeta-optimization procedure in which we refine how LMs construct proposals over\ntime. Using these insights we develop MIPRO, a novel optimizer that outperforms\nbaselines on five of six diverse LM programs using a best-in-class open-source\nmodel (Llama-3-8B), by as high as 12.9% accuracy. We will release our new\noptimizers and benchmark in DSPy at https://github.com/stanfordnlp/dspy", "paper_summary_zh": "語言模型程式，即模組化語言模型 (LM) 呼叫的複雜管線，正日益提升 NLP 任務，但它們需要製作對所有模組都共同有效的提示。我們研究 LM 程式的提示最佳化，即如何在沒有模組層級標籤或梯度的狀況下更新這些提示，以最大化下游指標。為了使這個問題可處理，我們將問題分解為最佳化每一個模組的自由形式說明和少量示範，並引入多種策略來製作以任務為基礎的說明，並在模組間導航信用分配。我們的策略包括：(i) 提出有效說明的程式和資料感知技術，(ii) 學習目標替代模型的隨機小批次評估函數，以及 (iii) 我們在其中精進 LM 隨著時間推移建構提案方式的元最佳化程序。利用這些見解，我們開發了 MIPRO，一種新的最佳化器，它在使用最佳開放原始碼模型 (Llama-3-8B) 的六個不同的 LM 程式中的五個程式中優於基準，準確度提高了 12.9%。我們將在 https://github.com/stanfordnlp/dspy 上發布我們的新的最佳化器和 DSPy 基準", "author": "Krista Opsahl-Ong et.al.", "authors": "Krista Opsahl-Ong, Michael J Ryan, Josh Purtell, David Broman, Christopher Potts, Matei Zaharia, Omar Khattab", "id": "2406.11695v1", "paper_url": "http://arxiv.org/abs/2406.11695v1", "repo": "https://github.com/stanfordnlp/dspy"}}