{"2410.21249": {"publish_time": "2024-10-28", "title": "Capacity-Aware Planning and Scheduling in Budget-Constrained Monotonic MDPs: A Meta-RL Approach", "paper_summary": "Many real-world sequential repair problems can be effectively modeled using\nmonotonic Markov Decision Processes (MDPs), where the system state\nstochastically decreases and can only be increased by performing a restorative\naction. This work addresses the problem of solving multi-component monotonic\nMDPs with both budget and capacity constraints. The budget constraint limits\nthe total number of restorative actions and the capacity constraint limits the\nnumber of restorative actions that can be performed simultaneously. While prior\nmethods dealt with budget constraints, including capacity constraints in prior\nmethods leads to an exponential increase in computational complexity as the\nnumber of components in the MDP grows. We propose a two-step planning approach\nto address this challenge. First, we partition the components of the\nmulti-component MDP into groups, where the number of groups is determined by\nthe capacity constraint. We achieve this partitioning by solving a Linear Sum\nAssignment Problem (LSAP). Each group is then allocated a fraction of the total\nbudget proportional to its size. This partitioning effectively decouples the\nlarge multi-component MDP into smaller subproblems, which are computationally\nfeasible because the capacity constraint is simplified and the budget\nconstraint can be addressed using existing methods. Subsequently, we use a\nmeta-trained PPO agent to obtain an approximately optimal policy for each\ngroup. To validate our approach, we apply it to the problem of scheduling\nrepairs for a large group of industrial robots, constrained by a limited number\nof repair technicians and a total repair budget. Our results demonstrate that\nthe proposed method outperforms baseline approaches in terms of maximizing the\naverage uptime of the robot swarm, particularly for large swarm sizes.", "paper_summary_zh": "許多真實世界中的順序修復問題，可以用單調馬可夫決策過程 (MDP) 有效地建模，其中系統狀態會隨機遞減，且僅能透過執行修復動作來增加。本研究探討了解決多組成單調 MDP 的問題，其中包含預算和容量限制。預算限制限制了修復動作的總數，而容量限制限制了可同時執行的修復動作數。雖然先前的方法處理了預算限制，但將容量限制納入先前的方法會導致計算複雜度隨著 MDP 中組成數增加而呈指數增加。我們提出了一個兩步驟規劃方法來應對此挑戰。首先，我們將多組成 MDP 的組成劃分為群組，其中群組數由容量限制決定。我們透過解決線性總和分配問題 (LSAP) 來達成此劃分。然後為每個群組分配與其規模成正比的總預算的一部分。此劃分有效地將大型多組成 MDP 分解為較小的子問題，由於容量限制簡化且預算限制可以使用現有方法來解決，因此在計算上可行。隨後，我們使用元訓練的 PPO 代理來為每個群組取得近乎最佳的政策。為了驗證我們的做法，我們將其應用於為一大群工業機器人安排維修的問題，並受到維修技術人員數量有限和維修總預算的限制。我們的結果證明，所提出的方法在最大化機器人蜂群的平均運行時間方面優於基準方法，特別是對於大型蜂群規模。", "author": "Manav Vora et.al.", "authors": "Manav Vora, Ilan Shomorony, Melkior Ornik", "id": "2410.21249v1", "paper_url": "http://arxiv.org/abs/2410.21249v1", "repo": "null"}}