{"2405.04285": {"publish_time": "2024-05-07", "title": "On the Foundations of Earth and Climate Foundation Models", "paper_summary": "Foundation models have enormous potential in advancing Earth and climate\nsciences, however, current approaches may not be optimal as they focus on a few\nbasic features of a desirable Earth and climate foundation model. Crafting the\nideal Earth foundation model, we define eleven features which would allow such\na foundation model to be beneficial for any geoscientific downstream\napplication in an environmental- and human-centric manner.We further shed light\non the way forward to achieve the ideal model and to evaluate Earth foundation\nmodels. What comes after foundation models? Energy efficient adaptation,\nadversarial defenses, and interpretability are among the emerging directions.", "paper_summary_zh": "基礎模型在推進地球和氣候科學方面具有巨大的潛力，然而，當前的途徑可能並非最佳，因為它們專注於理想地球和氣候基礎模型的幾個基本特徵。在制定理想的地球基礎模型時，我們定義了 11 個特徵，這些特徵將允許此類基礎模型以以環境和人類為中心的方式，對任何地球科學下游應用產生有益影響。我們進一步闡明了實現理想模型和評估地球基礎模型的途徑。基礎模型之後是什麼？節能適應、對抗性防禦和可解釋性是新興的方向。", "author": "Xiao Xiang Zhu et.al.", "authors": "Xiao Xiang Zhu, Zhitong Xiong, Yi Wang, Adam J. Stewart, Konrad Heidler, Yuanyuan Wang, Zhenghang Yuan, Thomas Dujardin, Qingsong Xu, Yilei Shi", "id": "2405.04285v1", "paper_url": "http://arxiv.org/abs/2405.04285v1", "repo": "null"}}