{"2410.12229": {"publish_time": "2024-10-16", "title": "Comprehending Knowledge Graphs with Large Language Models for Recommender Systems", "paper_summary": "Recently, the introduction of knowledge graphs (KGs) has significantly\nadvanced recommender systems by facilitating the discovery of potential\nassociations between items. However, existing methods still face several\nlimitations. First, most KGs suffer from missing facts or limited scopes. This\ncan lead to biased knowledge representations, thereby constraining the model's\nperformance. Second, existing methods typically convert textual information\ninto IDs, resulting in the loss of natural semantic connections between\ndifferent items. Third, existing methods struggle to capture high-order\nrelationships in global KGs due to their inefficient layer-by-layer information\npropagation mechanisms, which are prone to introducing significant noise. To\naddress these limitations, we propose a novel method called CoLaKG, which\nleverages large language models (LLMs) for knowledge-aware recommendation. The\nextensive world knowledge and remarkable reasoning capabilities of LLMs enable\nthem to supplement KGs. Additionally, the strong text comprehension abilities\nof LLMs allow for a better understanding of semantic information. Based on\nthis, we first extract subgraphs centered on each item from the KG and convert\nthem into textual inputs for the LLM. The LLM then outputs its comprehension of\nthese item-centered subgraphs, which are subsequently transformed into semantic\nembeddings. Furthermore, to utilize the global information of the KG, we\nconstruct an item-item graph using these semantic embeddings, which can\ndirectly capture higher-order associations between items. Both the semantic\nembeddings and the structural information from the item-item graph are\neffectively integrated into the recommendation model through our designed\nrepresentation alignment and neighbor augmentation modules. Extensive\nexperiments on four real-world datasets demonstrate the superiority of our\nmethod.", "paper_summary_zh": "<paragraph>最近，知識圖譜 (KG) 的引入透過促進項目之間潛在關聯的發現，顯著提升推薦系統。然而，現有方法仍面臨幾個限制。首先，大多數 KG 都存在事實缺失或範圍受限的問題。這可能導致有偏差的知識表徵，進而限制模型的效能。其次，現有方法通常會將文字資訊轉換為 ID，導致不同項目之間自然語義連結的遺失。第三，現有方法難以捕捉全球 KG 中的高階關係，原因在於其低效率的逐層資訊傳播機制容易引入顯著雜訊。為了解決這些限制，我們提出了一種稱為 CoLaKG 的新方法，它利用大型語言模型 (LLM) 進行知識感知推薦。LLM 廣泛的世界知識和卓越的推理能力使它們能夠補充 KG。此外，LLM 強大的文字理解能力有助於更深入地理解語義資訊。基於此，我們首先從 KG 中擷取以每個項目為中心的子圖，並將它們轉換為 LLM 的文字輸入。然後，LLM 會輸出其對這些以項目為中心的子圖的理解，這些理解接著會轉換為語義嵌入。此外，為了利用 KG 的全球資訊，我們使用這些語義嵌入建構一個項目-項目圖，它可以直接捕捉項目之間的高階關聯。語義嵌入和來自項目-項目圖的結構資訊都會透過我們設計的表徵比對和鄰域擴充模組有效地整合到推薦模型中。在四個真實世界資料集上進行的廣泛實驗證明了我們方法的優越性。</paragraph>", "author": "Ziqiang Cui et.al.", "authors": "Ziqiang Cui, Yunpeng Weng, Xing Tang, Fuyuan Lyu, Dugang Liu, Xiuqiang He, Chen Ma", "id": "2410.12229v1", "paper_url": "http://arxiv.org/abs/2410.12229v1", "repo": "null"}}