{"2405.10714": {"publish_time": "2024-05-17", "title": "Persian Pronoun Resolution: Leveraging Neural Networks and Language Models", "paper_summary": "Coreference resolution, critical for identifying textual entities referencing\nthe same entity, faces challenges in pronoun resolution, particularly\nidentifying pronoun antecedents. Existing methods often treat pronoun\nresolution as a separate task from mention detection, potentially missing\nvaluable information. This study proposes the first end-to-end neural network\nsystem for Persian pronoun resolution, leveraging pre-trained Transformer\nmodels like ParsBERT. Our system jointly optimizes both mention detection and\nantecedent linking, achieving a 3.37 F1 score improvement over the previous\nstate-of-the-art system (which relied on rule-based and statistical methods) on\nthe Mehr corpus. This significant improvement demonstrates the effectiveness of\ncombining neural networks with linguistic models, potentially marking a\nsignificant advancement in Persian pronoun resolution and paving the way for\nfurther research in this under-explored area.", "paper_summary_zh": "核心指代消解對於識別文本實體引用相同實體至關重要，在代名詞消解中面臨挑戰，特別是識別代名詞先行詞。現有方法通常將代名詞消解視為與提及偵測分開的任務，可能會遺漏有價值的資訊。本研究提出了第一個波斯語代名詞消解端到端神經網路系統，利用預先訓練的 Transformer 模型，例如 ParsBERT。我們的系統同時最佳化提及偵測和先行詞連結，在 Mehr 語料庫中比以前最先進的系統（依賴基於規則和統計的方法）提升了 3.37 的 F1 分數。這個顯著的改善證明了將神經網路與語言模型結合的有效性，可能會標誌著波斯語代名詞消解的重大進展，並為這個探索不足的領域的進一步研究鋪路。", "author": "Hassan Haji Mohammadi et.al.", "authors": "Hassan Haji Mohammadi, Alireza Talebpour, Ahmad Mahmoudi Aznaveh, Samaneh Yazdani", "id": "2405.10714v1", "paper_url": "http://arxiv.org/abs/2405.10714v1", "repo": "null"}}