{"2410.16006": {"publish_time": "2024-10-21", "title": "Exploring Continual Fine-Tuning for Enhancing Language Ability in Large Language Model", "paper_summary": "A common challenge towards the adaptability of Large Language Models (LLMs)\nis their ability to learn new languages over time without hampering the model's\nperformance on languages in which the model is already proficient (usually\nEnglish). Continual fine-tuning (CFT) is the process of sequentially\nfine-tuning an LLM to enable the model to adapt to downstream tasks with\nvarying data distributions and time shifts. This paper focuses on the language\nadaptability of LLMs through CFT. We study a two-phase CFT process in which an\nEnglish-only end-to-end fine-tuned LLM from Phase 1 (predominantly Task\nAbility) is sequentially fine-tuned on a multilingual dataset -- comprising\ntask data in new languages -- in Phase 2 (predominantly Language Ability). We\nobserve that the ``similarity'' of Phase 2 tasks with Phase 1 determines the\nLLM's adaptability. For similar phase-wise datasets, the LLM after Phase 2 does\nnot show deterioration in task ability. In contrast, when the phase-wise\ndatasets are not similar, the LLM's task ability deteriorates. We test our\nhypothesis on the open-source \\mis\\ and \\llm\\ models with multiple phase-wise\ndataset pairs. To address the deterioration, we analyze tailored variants of\ntwo CFT methods: layer freezing and generative replay. Our findings demonstrate\ntheir effectiveness in enhancing the language ability of LLMs while preserving\ntask performance, in comparison to relevant baselines.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 適應性的常見挑戰是它們在不影響模型在已經熟練的語言（通常是英語）上的表現的情況下，隨著時間推移學習新語言的能力。持續微調 (CFT) 是按順序微調 LLM 的過程，使模型能夠適應具有不同資料分佈和時間變化的下游任務。本文重點關注 LLM 通過 CFT 的語言適應性。我們研究了一個兩階段 CFT 過程，其中一個僅限英語的端到端微調 LLM（第 1 階段，主要是任務能力）在第 2 階段（主要是語言能力）中在一個多語言資料集（包括新語言的任務資料）上按順序微調。我們觀察到第 2 階段任務與第 1 階段的「相似性」決定了 LLM 的適應性。對於相似的階段資料集，第 2 階段後的 LLM 任務能力沒有下降。相反，當階段資料集不相似的，LLM 的任務能力會下降。我們使用多個階段資料集對在開源 \\mis\\ 和 \\llm\\ 模型上測試我們的假設。為了解決惡化問題，我們分析了兩種 CFT 方法的定制變體：層凍結和生成式重播。我們的研究結果證明了它們在增強 LLM 的語言能力的同時保持任務表現方面的有效性，與相關基準相比。</paragraph>", "author": "Divyanshu Aggarwal et.al.", "authors": "Divyanshu Aggarwal, Sankarshan Damle, Navin Goyal, Satya Lokam, Sunayana Sitaram", "id": "2410.16006v1", "paper_url": "http://arxiv.org/abs/2410.16006v1", "repo": "null"}}