{"2410.03867": {"publish_time": "2024-10-04", "title": "Empowering Domain-Specific Language Models with Graph-Oriented Databases: A Paradigm Shift in Performance and Model Maintenance", "paper_summary": "In an era dominated by data, the management and utilization of\ndomain-specific language have emerged as critical challenges in various\napplication domains, particularly those with industry-specific requirements.\nOur work is driven by the need to effectively manage and process large volumes\nof short text documents inherent in specific application domains. By leveraging\ndomain-specific knowledge and expertise, our approach aims to shape factual\ndata within these domains, thereby facilitating enhanced utilization and\nunderstanding by end-users. Central to our methodology is the integration of\ndomain-specific language models with graph-oriented databases, facilitating\nseamless processing, analysis, and utilization of textual data within targeted\ndomains. Our work underscores the transformative potential of the partnership\nof domain-specific language models and graph-oriented databases. This\ncooperation aims to assist researchers and engineers in metric usage,\nmitigation of latency issues, boosting explainability, enhancing debug and\nimproving overall model performance. Moving forward, we envision our work as a\nguide AI engineers, providing valuable insights for the implementation of\ndomain-specific language models in conjunction with graph-oriented databases,\nand additionally provide valuable experience in full-life cycle maintenance of\nthis kind of products.", "paper_summary_zh": "在資料當道的時代，特定領域語言的管理和應用已成為各應用領域中的關鍵挑戰，尤其是那些具有產業特定需求的領域。我們的研究動機是有效管理和處理特定應用領域中固有的海量簡短文本文件。透過運用特定領域的知識和專業知識，我們的做法旨在形塑這些領域中的事實資料，進而促進最終使用者增強利用和理解。我們方法的核心是將特定領域的語言模型與圖形導向資料庫整合，促進目標領域中文字資料的無縫處理、分析和利用。我們的研究強調了特定領域語言模型與圖形導向資料庫合作的轉型潛力。這種合作旨在協助研究人員和工程師進行指標使用、減輕延遲問題、提升可解釋性、增強除錯，並改善整體模型效能。展望未來，我們預期我們的研究將成為人工智慧工程師的指南，提供有價值的見解，供他們將特定領域語言模型與圖形導向資料庫結合實作，並進一步提供此類產品全生命週期維護的寶貴經驗。", "author": "Ricardo Di Pasquale et.al.", "authors": "Ricardo Di Pasquale, Soledad Represa", "id": "2410.03867v1", "paper_url": "http://arxiv.org/abs/2410.03867v1", "repo": "null"}}