{"2501.18435": {"publish_time": "2025-01-30", "title": "GENIE: Generative Note Information Extraction model for structuring EHR data", "paper_summary": "Electronic Health Records (EHRs) hold immense potential for advancing\nhealthcare, offering rich, longitudinal data that combines structured\ninformation with valuable insights from unstructured clinical notes. However,\nthe unstructured nature of clinical text poses significant challenges for\nsecondary applications. Traditional methods for structuring EHR free-text data,\nsuch as rule-based systems and multi-stage pipelines, are often limited by\ntheir time-consuming configurations and inability to adapt across clinical\nnotes from diverse healthcare settings. Few systems provide a comprehensive\nattribute extraction for terminologies. While giant large language models\n(LLMs) like GPT-4 and LLaMA 405B excel at structuring tasks, they are slow,\ncostly, and impractical for large-scale use. To overcome these limitations, we\nintroduce GENIE, a Generative Note Information Extraction system that leverages\nLLMs to streamline the structuring of unstructured clinical text into usable\ndata with standardized format. GENIE processes entire paragraphs in a single\npass, extracting entities, assertion statuses, locations, modifiers, values,\nand purposes with high accuracy. Its unified, end-to-end approach simplifies\nworkflows, reduces errors, and eliminates the need for extensive manual\nintervention. Using a robust data preparation pipeline and fine-tuned small\nscale LLMs, GENIE achieves competitive performance across multiple information\nextraction tasks, outperforming traditional tools like cTAKES and MetaMap and\ncan handle extra attributes to be extracted. GENIE strongly enhances real-world\napplicability and scalability in healthcare systems. By open-sourcing the model\nand test data, we aim to encourage collaboration and drive further advancements\nin EHR structurization.", "paper_summary_zh": "電子健康記錄 (EHR) 蘊藏著促進醫療保健的巨大潛力，提供豐富的縱向數據，結合了結構化資訊與非結構化臨床筆記中的寶貴見解。然而，臨床文本的非結構化性質對次要應用程式構成了重大挑戰。結構化 EHR 自由文字資料的傳統方法，例如基於規則的系統和多階段管道，通常受到其耗時的組態和無法適應來自不同醫療保健環境的臨床筆記的限制。少數系統為術語提供全面的屬性萃取。雖然像 GPT-4 和 LLaMA 405B 這樣的巨型大型語言模型 (LLM) 在結構化任務方面表現出色，但它們速度慢、成本高，且不切實際用於大規模使用。為了克服這些限制，我們引入了 GENIE，一個生成式筆記資訊萃取系統，它利用 LLM 將非結構化臨床文本簡化為具有標準化格式的可用資料。GENIE 在單次傳遞中處理整個段落，以高準確度萃取實體、斷言狀態、位置、修飾詞、值和目的。其統一的端對端方法簡化了工作流程、減少了錯誤，並消除了廣泛手動介入的需要。GENIE 使用強大的資料準備管道和微調的小型 LLM，在多個資訊萃取任務中實現了競爭力的效能，優於 cTAKES 和 MetaMap 等傳統工具，並且可以處理要萃取的額外屬性。GENIE 大幅增強了醫療保健系統中的真實世界適用性和可擴充性。透過開放原始碼模型和測試資料，我們旨在鼓勵協作並推動 EHR 結構化的進一步發展。", "author": "Huaiyuan Ying et.al.", "authors": "Huaiyuan Ying, Hongyi Yuan, Jinsen Lu, Zitian Qu, Yang Zhao, Zhengyun Zhao, Isaac Kohane, Tianxi Cai, Sheng Yu", "id": "2501.18435v1", "paper_url": "http://arxiv.org/abs/2501.18435v1", "repo": "null"}}