{"2408.05905": {"publish_time": "2024-08-12", "title": "Weakly Supervised Video Anomaly Detection and Localization with Spatio-Temporal Prompts", "paper_summary": "Current weakly supervised video anomaly detection (WSVAD) task aims to\nachieve frame-level anomalous event detection with only coarse video-level\nannotations available. Existing works typically involve extracting global\nfeatures from full-resolution video frames and training frame-level classifiers\nto detect anomalies in the temporal dimension. However, most anomalous events\ntend to occur in localized spatial regions rather than the entire video frames,\nwhich implies existing frame-level feature based works may be misled by the\ndominant background information and lack the interpretation of the detected\nanomalies. To address this dilemma, this paper introduces a novel method called\nSTPrompt that learns spatio-temporal prompt embeddings for weakly supervised\nvideo anomaly detection and localization (WSVADL) based on pre-trained\nvision-language models (VLMs). Our proposed method employs a two-stream network\nstructure, with one stream focusing on the temporal dimension and the other\nprimarily on the spatial dimension. By leveraging the learned knowledge from\npre-trained VLMs and incorporating natural motion priors from raw videos, our\nmodel learns prompt embeddings that are aligned with spatio-temporal regions of\nvideos (e.g., patches of individual frames) for identify specific local regions\nof anomalies, enabling accurate video anomaly detection while mitigating the\ninfluence of background information. Without relying on detailed\nspatio-temporal annotations or auxiliary object detection/tracking, our method\nachieves state-of-the-art performance on three public benchmarks for the WSVADL\ntask.", "paper_summary_zh": "當前的弱監督影片異常偵測 (WSVAD) 任務旨在僅使用粗略的影片層級註解來達成影格層級異常事件偵測。現有的作品通常涉及從全解析度影片影格中萃取全域特徵，並訓練影格層級分類器來偵測時間維度中的異常。然而，大多數異常事件往往發生在局部空間區域，而非整個影片影格，這表示現有的基於影格層級特徵的作品可能會受到主要的背景資訊誤導，且缺乏對偵測到的異常進行詮釋。為了解決這個困境，本文介紹一種稱為 STPrompt 的新方法，它會學習時空提示嵌入，以進行基於預訓練視覺語言模型 (VLM) 的弱監督影片異常偵測與定位 (WSVADL)。我們提出的方法採用雙串流網路結構，其中一個串流專注於時間維度，而另一個主要專注於空間維度。透過利用預訓練 VLM 中學習到的知識，並將原始影片中的自然動作先驗納入，我們的模型會學習與影片的時空區域（例如，個別影格的區塊）對齊的提示嵌入，以識別異常的特定區域，進而進行精確的影片異常偵測，同時減輕背景資訊的影響。在不依賴詳細的時空註解或輔助物件偵測/追蹤的情況下，我們的模型在三個 WSVADL 任務的公開基準上達到了最先進的效能。", "author": "Peng Wu et.al.", "authors": "Peng Wu, Xuerong Zhou, Guansong Pang, Zhiwei Yang, Qingsen Yan, Peng Wang, Yanning Zhang", "id": "2408.05905v2", "paper_url": "http://arxiv.org/abs/2408.05905v2", "repo": "null"}}