{"2411.02271": {"publish_time": "2024-11-04", "title": "On the Utilization of Unique Node Identifiers in Graph Neural Networks", "paper_summary": "Graph neural networks have inherent representational limitations due to their\nmessage-passing structure. Recent work has suggested that these limitations can\nbe overcome by using unique node identifiers (UIDs). Here we argue that despite\nthe advantages of UIDs, one of their disadvantages is that they lose the\ndesirable property of permutation-equivariance. We thus propose to focus on UID\nmodels that are permutation-equivariant, and present theoretical arguments for\ntheir advantages. Motivated by this, we propose a method to regularize UID\nmodels towards permutation equivariance, via a contrastive loss. We empirically\ndemonstrate that our approach improves generalization and extrapolation\nabilities while providing faster training convergence. On the recent BREC\nexpressiveness benchmark, our proposed method achieves state-of-the-art\nperformance compared to other random-based approaches.", "paper_summary_zh": "圖形神經網路由於其訊息傳遞結構而具有固有的表示限制。最近的研究表明，可以使用唯一的節點標識符 (UID) 來克服這些限制。我們在此論證，儘管 UID 具有優點，但其缺點之一是它們失去了置換等變性的理想屬性。因此，我們建議專注於置換等變性的 UID 模型，並提出其優勢的理論論據。受此啟發，我們提出了一種通過對比損失將 UID 模型規範化為置換等變性的方法。我們實證證明，我們的做法改善了泛化和外推能力，同時提供了更快的訓練收斂。在最近的 BREC 表達能力基準測試中，我們提出的方法與其他基於隨機的方法相比，實現了最先進的效能。", "author": "Maya Bechler-Speicher et.al.", "authors": "Maya Bechler-Speicher, Moshe Eliasof, Carola-Bibiane Schönlieb, Ran Gilad-Bachrach, Amir Globerson", "id": "2411.02271v1", "paper_url": "http://arxiv.org/abs/2411.02271v1", "repo": "null"}}