{"2407.20341": {"publish_time": "2024-07-29", "title": "BRIDGE: Bridging Gaps in Image Captioning Evaluation with Stronger Visual Cues", "paper_summary": "Effectively aligning with human judgment when evaluating machine-generated\nimage captions represents a complex yet intriguing challenge. Existing\nevaluation metrics like CIDEr or CLIP-Score fall short in this regard as they\ndo not take into account the corresponding image or lack the capability of\nencoding fine-grained details and penalizing hallucinations. To overcome these\nissues, in this paper, we propose BRIDGE, a new learnable and reference-free\nimage captioning metric that employs a novel module to map visual features into\ndense vectors and integrates them into multi-modal pseudo-captions which are\nbuilt during the evaluation process. This approach results in a multimodal\nmetric that properly incorporates information from the input image without\nrelying on reference captions, bridging the gap between human judgment and\nmachine-generated image captions. Experiments spanning several datasets\ndemonstrate that our proposal achieves state-of-the-art results compared to\nexisting reference-free evaluation scores. Our source code and trained models\nare publicly available at: https://github.com/aimagelab/bridge-score.", "paper_summary_zh": "在評估機器產生的影像標題時，有效地與人類判斷一致，是一個複雜但有趣的挑戰。現有的評估指標，例如 CIDEr 或 CLIP-Score，在這方面做得並不好，因為它們沒有考慮對應的影像，或缺乏編碼細微細節和懲罰幻覺的能力。為了克服這些問題，我們在這篇論文中提出了 BRIDGE，一個新的可學習且無參考的影像標題評估指標，它採用了一個新穎的模組，將視覺特徵映射到稠密向量中，並將它們整合到多模態偽標題中，這些偽標題是在評估過程中建立的。這種方法產生了一個多模態指標，它適當地納入了輸入影像中的資訊，而不需要依賴參考標題，從而縮小了人類判斷與機器產生的影像標題之間的差距。跨越幾個資料集的實驗表明，與現有的無參考評估分數相比，我們的提案達到了最先進的結果。我們的原始碼和訓練模型可在以下網址公開取得：https://github.com/aimagelab/bridge-score。", "author": "Sara Sarto et.al.", "authors": "Sara Sarto, Marcella Cornia, Lorenzo Baraldi, Rita Cucchiara", "id": "2407.20341v1", "paper_url": "http://arxiv.org/abs/2407.20341v1", "repo": "https://github.com/aimagelab/bridge-score"}}