{"2501.17704": {"publish_time": "2025-01-29", "title": "Inferring Implicit Goals Across Differing Task Models", "paper_summary": "One of the significant challenges to generating value-aligned behavior is to\nnot only account for the specified user objectives but also any implicit or\nunspecified user requirements. The existence of such implicit requirements\ncould be particularly common in settings where the user's understanding of the\ntask model may differ from the agent's estimate of the model. Under this\nscenario, the user may incorrectly expect some agent behavior to be inevitable\nor guaranteed. This paper addresses such expectation mismatch in the presence\nof differing models by capturing the possibility of unspecified user subgoal in\nthe context of a task captured as a Markov Decision Process (MDP) and querying\nfor it as required. Our method identifies bottleneck states and uses them as\ncandidates for potential implicit subgoals. We then introduce a querying\nstrategy that will generate the minimal number of queries required to identify\na policy guaranteed to achieve the underlying goal. Our empirical evaluations\ndemonstrate the effectiveness of our approach in inferring and achieving\nunstated goals across various tasks.", "paper_summary_zh": "產生價值對齊行為時，其中一項重大挑戰在於，不僅要考慮指定的使用者目標，還要考慮任何隱含或未指定的使用者需求。此類隱含需求的存在，在使用者對任務模型的理解可能與代理人對模型的估計不同的情況中特別常見。在此情況下，使用者可能會錯誤地預期某些代理人行為是不可避免或有保證的。本文透過在馬可夫決策過程 (MDP) 中捕捉未指定使用者次目標的可能性，並在需要時查詢它，來解決在模型不同的情況下這種預期不符的問題。我們的做法會找出瓶頸狀態，並將它們用作潛在隱含次目標的候選者。然後，我們會引入一種查詢策略，這將產生識別策略所需的最小查詢數目，以確保達成基礎目標。我們的經驗評估證明了我們的方法在推論和達成各種任務中未說明目標的有效性。", "author": "Silvia Tulli et.al.", "authors": "Silvia Tulli, Stylianos Loukas Vasileiou, Mohamed Chetouani, Sarath Sreedharan", "id": "2501.17704v1", "paper_url": "http://arxiv.org/abs/2501.17704v1", "repo": "null"}}