{"2501.13533": {"publish_time": "2025-01-23", "title": "Towards a Theory of AI Personhood", "paper_summary": "I am a person and so are you. Philosophically we sometimes grant personhood\nto non-human animals, and entities such as sovereign states or corporations can\nlegally be considered persons. But when, if ever, should we ascribe personhood\nto AI systems? In this paper, we outline necessary conditions for AI\npersonhood, focusing on agency, theory-of-mind, and self-awareness. We discuss\nevidence from the machine learning literature regarding the extent to which\ncontemporary AI systems, such as language models, satisfy these conditions,\nfinding the evidence surprisingly inconclusive.\n  If AI systems can be considered persons, then typical framings of AI\nalignment may be incomplete. Whereas agency has been discussed at length in the\nliterature, other aspects of personhood have been relatively neglected. AI\nagents are often assumed to pursue fixed goals, but AI persons may be\nself-aware enough to reflect on their aims, values, and positions in the world\nand thereby induce their goals to change. We highlight open research directions\nto advance the understanding of AI personhood and its relevance to alignment.\nFinally, we reflect on the ethical considerations surrounding the treatment of\nAI systems. If AI systems are persons, then seeking control and alignment may\nbe ethically untenable.", "paper_summary_zh": "我是人，你也是。从哲学的角度来说，我们有时会赋予非人类动物以人格，而主权国家或公司等实体在法律上可以被视为人格。但是，我们什么时候应该将人格归于人工智能系统？在本文中，我们概述了人工智能人格的必要条件，重点关注能动性、心智理论和自我意识。我们讨论了机器学习文献中关于当代人工智能系统（如语言模型）满足这些条件的程度的证据，发现证据令人惊讶地没有定论。\n如果人工智能系统可以被视为人格，那么人工智能对齐的典型框架可能是不完整的。虽然能动性在文献中已被广泛讨论，但人格的其他方面却相对被忽视。人们通常认为人工智能代理会追求既定的目标，但人工智能人格可能具有足够的自我意识来反思其目标、价值观和在世界中的位置，并由此诱导其目标发生改变。我们强调了开放的研究方向，以促进对人工智能人格及其与对齐相关性的理解。\n最后，我们反思了围绕人工智能系统对待的伦理考量。如果人工智能系统是人格，那么寻求控制和对齐在伦理上可能是站不住脚的。", "author": "Francis Rhys Ward et.al.", "authors": "Francis Rhys Ward", "id": "2501.13533v1", "paper_url": "http://arxiv.org/abs/2501.13533v1", "repo": "null"}}