{"2408.05195": {"publish_time": "2024-08-09", "title": "HistoKernel: Whole Slide Image Level Maximum Mean Discrepancy Kernels for Pan-Cancer Predictive Modelling", "paper_summary": "Machine learning in computational pathology (CPath) often aggregates\npatch-level predictions from multi-gigapixel Whole Slide Images (WSIs) to\ngenerate WSI-level prediction scores for crucial tasks such as survival\nprediction and drug effect prediction. However, current methods do not\nexplicitly characterize distributional differences between patch sets within\nWSIs. We introduce HistoKernel, a novel Maximum Mean Discrepancy (MMD) kernel\nthat measures distributional similarity between WSIs for enhanced prediction\nperformance on downstream prediction tasks.\n  Our comprehensive analysis demonstrates HistoKernel's effectiveness across\nvarious machine learning tasks, including retrieval (n = 9,362), drug\nsensitivity regression (n = 551), point mutation classification (n = 3,419),\nand survival analysis (n = 2,291), outperforming existing deep learning\nmethods. Additionally, HistoKernel seamlessly integrates multi-modal data and\noffers a novel perturbation-based method for patch-level explainability. This\nwork pioneers the use of kernel-based methods for WSI-level predictive\nmodeling, opening new avenues for research. Code is available at\nhttps://github.com/pkeller00/HistoKernel.", "paper_summary_zh": "計算病理學 (CPath) 中的機器學習經常彙總來自多吉像素全幻燈片影像 (WSI) 的補丁級別預測，以產生 WSI 級別預測分數，用於存活預測和藥物效果預測等關鍵任務。然而，目前的技術並未明確描述 WSI 中補丁組之間的分配差異。我們引入了 HistoKernel，這是一種新的最大平均差異 (MMD) 核，它測量 WSI 之間的分配相似性，以增強下游預測任務的預測效能。我們的全面分析證明了 HistoKernel 在各種機器學習任務中的有效性，包括檢索 (n = 9,362)、藥物敏感性回歸 (n = 551)、點突變分類 (n = 3,419) 和存活分析 (n = 2,291)，優於現有的深度學習方法。此外，HistoKernel 無縫整合多模式數據，並提供一種新的基於擾動的方法，用於補丁級別的可解釋性。這項工作開創了使用基於核的方法進行 WSI 級別預測建模的先河，為研究開闢了新的途徑。程式碼可在 https://github.com/pkeller00/HistoKernel 取得。", "author": "Piotr Keller et.al.", "authors": "Piotr Keller, Muhammad Dawood, Brinder Singh Chohan, Fayyaz ul Amir Afsar Minhas", "id": "2408.05195v1", "paper_url": "http://arxiv.org/abs/2408.05195v1", "repo": "https://github.com/pkeller00/histokernel"}}