{"2502.13875": {"publish_time": "2025-02-19", "title": "MEX: Memory-efficient Approach to Referring Multi-Object Tracking", "paper_summary": "Referring Multi-Object Tracking (RMOT) is a relatively new concept that has\nrapidly gained traction as a promising research direction at the intersection\nof computer vision and natural language processing. Unlike traditional\nmulti-object tracking, RMOT identifies and tracks objects and incorporates\ntextual descriptions for object class names, making the approach more\nintuitive. Various techniques have been proposed to address this challenging\nproblem; however, most require the training of the entire network due to their\nend-to-end nature. Among these methods, iKUN has emerged as a particularly\npromising solution. Therefore, we further explore its pipeline and enhance its\nperformance. In this paper, we introduce a practical module dubbed\nMemory-Efficient Cross-modality -- MEX. This memory-efficient technique can be\ndirectly applied to off-the-shelf trackers like iKUN, resulting in significant\narchitectural improvements. Our method proves effective during inference on a\nsingle GPU with 4 GB of memory. Among the various benchmarks, the Refer-KITTI\ndataset, which offers diverse autonomous driving scenes with relevant language\nexpressions, is particularly useful for studying this problem. Empirically, our\nmethod demonstrates effectiveness and efficiency regarding HOTA tracking\nscores, substantially improving memory allocation and processing speed.", "paper_summary_zh": "多目標追蹤 (RMOT) 是一個相對較新的概念，它在電腦視覺和自然語言處理的交叉領域中迅速獲得關注，成為一個有前途的研究方向。與傳統多目標追蹤不同，RMOT 識別並追蹤目標，並將目標類別名稱的文字描述納入其中，使這種方法更直觀。已經提出各種技術來解決這個具有挑戰性的問題；然而，由於其端到端特性，大多數技術都需要訓練整個網路。在這些方法中，iKUN 已成為一個特別有前途的解決方案。因此，我們進一步探索其管道並增強其效能。在本文中，我們介紹了一個稱為 Memory-Efficient Cross-modality -- MEX 的實用模組。這種記憶體高效的技術可以直接應用於現成的追蹤器，例如 iKUN，從而帶來顯著的架構改進。我們的技術證明了在單個具有 4 GB 記憶體的 GPU 上進行推理的有效性。在各種基準中，Refer-KITTI 資料集提供了具有相關語言表達的多樣化自動駕駛場景，對於研究這個問題特別有用。根據經驗，我們的技術在 HOTA 追蹤分數方面證明了有效性和效率，顯著改善了記憶體配置和處理速度。", "author": "Huu-Thien Tran et.al.", "authors": "Huu-Thien Tran, Phuoc-Sang Pham, Thai-Son Tran, Khoa Luu", "id": "2502.13875v1", "paper_url": "http://arxiv.org/abs/2502.13875v1", "repo": "null"}}