{"2406.15329": {"publish_time": "2024-06-21", "title": "An End-to-End, Segmentation-Free, Arabic Handwritten Recognition Model on KHATT", "paper_summary": "An end-to-end, segmentation-free, deep learning model trained from scratch is\nproposed, leveraging DCNN for feature extraction, alongside Bidirectional\nLong-Short Term Memory (BLSTM) for sequence recognition and Connectionist\nTemporal Classification (CTC) loss function on the KHATT database. The training\nphase yields remarkable results 84% recognition rate on the test dataset at the\ncharacter level and 71% on the word level, establishing an image-based sequence\nrecognition framework that operates without segmentation only at the line\nlevel. The analysis and preprocessing of the KFUPM Handwritten Arabic TexT\n(KHATT) database are also presented. Finally, advanced image processing\ntechniques, including filtering, transformation, and line segmentation are\nimplemented. The importance of this work is highlighted by its wide-ranging\napplications. Including digitizing, documentation, archiving, and text\ntranslation in fields such as banking. Moreover, AHR serves as a pivotal tool\nfor making images searchable, enhancing information retrieval capabilities, and\nenabling effortless editing. This functionality significantly reduces the time\nand effort required for tasks such as Arabic data organization and\nmanipulation.", "paper_summary_zh": "<paragraph>提出了一個端到端、無分段的深度學習模型，從頭開始訓練，利用 DCNN 進行特徵提取，同時利用雙向長短期記憶 (BLSTM) 進行序列識別和連接主義時間分類 (CTC) 損失函數在 KHATT 數據庫上。訓練階段在測試數據集上的字元級別和詞彙級別分別產生了顯著的 84% 識別率和 71%，建立了一個僅在行級別操作而無需分段的基於圖像的序列識別框架。還介紹了 KFUPM 手寫阿拉伯語文本 (KHATT) 數據庫的分析和預處理。最後，實施了先進的圖像處理技術，包括濾波、變換和線段分割。這項工作的意義在於其廣泛的應用。包括銀行等領域的數位化、文件化、歸檔和文本翻譯。此外，AHR 作為一個關鍵工具，可用於使圖像可搜索、增強資訊檢索能力，並實現輕鬆編輯。此功能顯著減少了阿拉伯語數據組織和處理等任務所需的時間和精力。</paragraph>", "author": "Sondos Aabed et.al.", "authors": "Sondos Aabed, Ahmad Khairaldin", "id": "2406.15329v1", "paper_url": "http://arxiv.org/abs/2406.15329v1", "repo": "null"}}