{"2410.10728": {"publish_time": "2024-10-14", "title": "Towards LLM-guided Efficient and Interpretable Multi-linear Tensor Network Rank Selection", "paper_summary": "We propose a novel framework that leverages large language models (LLMs) to\nguide the rank selection in tensor network models for higher-order data\nanalysis. By utilising the intrinsic reasoning capabilities and domain\nknowledge of LLMs, our approach offers enhanced interpretability of the rank\nchoices and can effectively optimise the objective function. This framework\nenables users without specialised domain expertise to utilise tensor network\ndecompositions and understand the underlying rationale within the rank\nselection process. Experimental results validate our method on financial\nhigher-order datasets, demonstrating interpretable reasoning, strong\ngeneralisation to unseen test data, and its potential for self-enhancement over\nsuccessive iterations. This work is placed at the intersection of large\nlanguage models and higher-order data analysis.", "paper_summary_zh": "我們提出一個新穎的架構，利用大型語言模型 (LLM) 來引導張量網路模型中的秩選擇，以進行高階資料分析。透過利用 LLM 的內在推理能力和領域知識，我們的做法提供了增強的秩選擇可解釋性，並能有效地最佳化目標函數。這個架構讓沒有專業領域知識的使用者能夠使用張量網路分解，並在秩選擇過程中了解其基本原理。實驗結果驗證了我們在金融高階資料集上的方法，展示了可解釋的推理、對未見測試資料的強泛化能力，以及它在連續迭代中自我增強的可能性。這項工作位於大型語言模型和高階資料分析的交叉點上。", "author": "Giorgos Iacovides et.al.", "authors": "Giorgos Iacovides, Wuyang Zhou, Danilo Mandic", "id": "2410.10728v1", "paper_url": "http://arxiv.org/abs/2410.10728v1", "repo": "null"}}