{"2409.11252": {"publish_time": "2024-09-17", "title": "WER We Stand: Benchmarking Urdu ASR Models", "paper_summary": "This paper presents a comprehensive evaluation of Urdu Automatic Speech\nRecognition (ASR) models. We analyze the performance of three ASR model\nfamilies: Whisper, MMS, and Seamless-M4T using Word Error Rate (WER), along\nwith a detailed examination of the most frequent wrong words and error types\nincluding insertions, deletions, and substitutions. Our analysis is conducted\nusing two types of datasets, read speech and conversational speech. Notably, we\npresent the first conversational speech dataset designed for benchmarking Urdu\nASR models. We find that seamless-large outperforms other ASR models on the\nread speech dataset, while whisper-large performs best on the conversational\nspeech dataset. Furthermore, this evaluation highlights the complexities of\nassessing ASR models for low-resource languages like Urdu using quantitative\nmetrics alone and emphasizes the need for a robust Urdu text normalization\nsystem. Our findings contribute valuable insights for developing robust ASR\nsystems for low-resource languages like Urdu.", "paper_summary_zh": "這篇論文提供了一個全面的烏爾都語自動語音辨識 (ASR) 模型評估。我們分析了三個 ASR 模型家族的效能：Whisper、MMS 和 Seamless-M4T，使用詞語錯誤率 (WER)，以及對最常錯的詞語和錯誤類型進行詳細檢查，包括插入、刪除和替換。我們的分析使用兩種類型的資料集進行：朗讀語音和對話語音。值得注意的是，我們提供了第一個針對烏爾都語 ASR 模型基準測試而設計的對話語音資料集。我們發現 seamless-large 在朗讀語音資料集上的表現優於其他 ASR 模型，而 whisper-large 在對話語音資料集上的表現最佳。此外，此評估強調了僅使用量化指標評估烏爾都語等低資源語言的 ASR 模型的複雜性，並強調了對強健的烏爾都語文字正規化系統的需求。我們的發現為開發針對烏爾都語等低資源語言的強健 ASR 系統提供了寶貴的見解。", "author": "Samee Arif et.al.", "authors": "Samee Arif, Aamina Jamal Khan, Mustafa Abbas, Agha Ali Raza, Awais Athar", "id": "2409.11252v1", "paper_url": "http://arxiv.org/abs/2409.11252v1", "repo": "null"}}