{"2409.10245": {"publish_time": "2024-09-16", "title": "From Text to Emoji: How PEFT-Driven Personality Manipulation Unleashes the Emoji Potential in LLMs", "paper_summary": "As the demand for human-like interactions with LLMs continues to grow, so\ndoes the interest in manipulating their personality traits, which has emerged\nas a key area of research. Methods like prompt-based In-Context Knowledge\nEditing (IKE) and gradient-based Model Editor Networks (MEND) have been\nexplored but show irregularity and variability. IKE depends on the prompt,\nleading to variability and sensitivity, while MEND yields inconsistent and\ngibberish outputs. To address this, we employed Opinion QA Based\nParameter-Efficient Fine-Tuning (PEFT), specifically Quantized Low-Rank\nAdaptation (QLORA), to manipulate the Big Five personality traits: Openness,\nConscientiousness, Extraversion, Agreeableness, and Neuroticism. After PEFT,\nmodels such as Mistral-7B-Instruct and Llama-2-7B-chat began generating emojis,\ndespite their absence in the PEFT data. For instance, Llama-2-7B-chat generated\nemojis in 99.5% of extraversion-related test instances, while\nMistral-8B-Instruct did so in 92.5% of openness-related test instances.\nExplainability analysis indicated that the LLMs used emojis intentionally to\nexpress these traits. This paper provides a number of novel contributions.\nFirst, introducing an Opinion QA dataset for PEFT-driven personality\nmanipulation; second, developing metric models to benchmark LLM personality\ntraits; third, demonstrating PEFT's superiority over IKE in personality\nmanipulation; and finally, analyzing and validating emoji usage through\nexplainability methods such as mechanistic interpretability and in-context\nlearning explainability methods.", "paper_summary_zh": "<paragraph>隨著對 LLM 類人互動需求持續增長，操縱其人格特質的興趣也隨之增加，這已成為研究的一個關鍵領域。基於提示的語境知識編輯 (IKE) 和基於梯度的模型編輯器網路 (MEND) 等方法已經過探討，但表現出不規則性和可變性。IKE 取決於提示，導致可變性和敏感性，而 MEND 產生不一致且無意義的輸出。為了解決這個問題，我們採用了基於意見問答的參數高效微調 (PEFT)，特別是量化低秩適應 (QLORA)，來操縱五大性格特質：開放性、盡責性、外向性、親和性和神經質。在 PEFT 之後，Mistral-7B-Instruct 和 Llama-2-7B-chat 等模型開始產生表情符號，儘管它們在 PEFT 資料中不存在。例如，Llama-2-7B-chat 在 99.5% 的外向性相關測試例項中產生了表情符號，而 Mistral-8B-Instruct 在 92.5% 的開放性相關測試例項中產生了表情符號。可解釋性分析表明，LLM 故意使用表情符號來表達這些特質。本文提供了一些新穎的貢獻。首先，引入意見問答資料集，用於 PEFT 驅動的人格操縱；其次，開發度量模型來評量 LLM 人格特質；第三，展示 PEFT 在人格操縱方面優於 IKE；最後，通過可解釋性方法（例如機制可解釋性和語境學習可解釋性方法）分析和驗證表情符號的使用。</paragraph>", "author": "Navya Jain et.al.", "authors": "Navya Jain, Zekun Wu, Cristian Munoz, Airlie Hilliard, Adriano Koshiyama, Emre Kazim, Philip Treleaven", "id": "2409.10245v1", "paper_url": "http://arxiv.org/abs/2409.10245v1", "repo": "null"}}