{"2409.07265": {"publish_time": "2024-09-11", "title": "Cross-Dialect Text-To-Speech in Pitch-Accent Language Incorporating Multi-Dialect Phoneme-Level BERT", "paper_summary": "We explore cross-dialect text-to-speech (CD-TTS), a task to synthesize\nlearned speakers' voices in non-native dialects, especially in pitch-accent\nlanguages. CD-TTS is important for developing voice agents that naturally\ncommunicate with people across regions. We present a novel TTS model comprising\nthree sub-modules to perform competitively at this task. We first train a\nbackbone TTS model to synthesize dialect speech from a text conditioned on\nphoneme-level accent latent variables (ALVs) extracted from speech by a\nreference encoder. Then, we train an ALV predictor to predict ALVs tailored to\na target dialect from input text leveraging our novel multi-dialect\nphoneme-level BERT. We conduct multi-dialect TTS experiments and evaluate the\neffectiveness of our model by comparing it with a baseline derived from\nconventional dialect TTS methods. The results show that our model improves the\ndialectal naturalness of synthetic speech in CD-TTS.", "paper_summary_zh": "我們探討跨方言文字轉語音 (CD-TTS)，這項任務用於合成學習者在非母語方言中的聲音，特別是在音高重音語言中。CD-TTS 對於開發能與不同地區的人自然溝通的語音代理非常重要。我們提出一個新穎的 TTS 模型，包含三個子模組，以在這個任務中表現出色。我們首先訓練一個主幹 TTS 模型，從一個受語音中由參考編碼器提取的音素級重音潛在變數 (ALV) 條件化的文字中合成方言語音。然後，我們訓練一個 ALV 預測器，利用我們新穎的多方言音素級 BERT 從輸入文字中預測適合目標方言的 ALV。我們進行多方言 TTS 實驗，並透過將我們的模型與源自傳統方言 TTS 方法的基準進行比較，來評估其有效性。結果顯示我們的模型改善了 CD-TTS 中合成語音的方言自然性。", "author": "Kazuki Yamauchi et.al.", "authors": "Kazuki Yamauchi, Yuki Saito, Hiroshi Saruwatari", "id": "2409.07265v1", "paper_url": "http://arxiv.org/abs/2409.07265v1", "repo": "null"}}