{"2410.16119": {"publish_time": "2024-10-21", "title": "SeaDAG: Semi-autoregressive Diffusion for Conditional Directed Acyclic Graph Generation", "paper_summary": "We introduce SeaDAG, a semi-autoregressive diffusion model for conditional\ngeneration of Directed Acyclic Graphs (DAGs). Considering their inherent\nlayer-wise structure, we simulate layer-wise autoregressive generation by\ndesigning different denoising speed for different layers. Unlike conventional\nautoregressive generation that lacks a global graph structure view, our method\nmaintains a complete graph structure at each diffusion step, enabling\noperations such as property control that require the full graph structure.\nLeveraging this capability, we evaluate the DAG properties during training by\nemploying a graph property decoder. We explicitly train the model to learn\ngraph conditioning with a condition loss, which enhances the diffusion model's\ncapacity to generate graphs that are both realistic and aligned with specified\nproperties. We evaluate our method on two representative conditional DAG\ngeneration tasks: (1) circuit generation from truth tables, where precise DAG\nstructures are crucial for realizing circuit functionality, and (2) molecule\ngeneration based on quantum properties. Our approach demonstrates promising\nresults, generating high-quality and realistic DAGs that closely align with\ngiven conditions.", "paper_summary_zh": "我們介紹 SeaDAG，一種用於有向無環圖 (DAG) 條件生成的半自迴歸擴散模型。考慮到它們固有的逐層結構，我們透過為不同層設計不同的去噪速度，來模擬逐層自迴歸生成。與缺乏全局圖結構觀點的傳統自迴歸生成不同，我們的方法在每個擴散步驟中維護一個完整的圖結構，從而能夠執行需要完整圖結構的運算，例如屬性控制。利用此功能，我們在訓練期間透過使用圖屬性解碼器來評估 DAG 屬性。我們明確訓練模型，以條件損失學習圖條件，這增強了擴散模型生成既真實又與指定屬性對齊的圖形的能力。我們在兩個具代表性的條件 DAG 生成任務上評估我們的方法：(1) 從真值表中生成電路，其中精確的 DAG 結構對於實現電路功能至關重要，以及 (2) 基於量子屬性的分子生成。我們的做法展示了有希望的結果，生成了與給定條件緊密對齊的高品質且真實的 DAG。", "author": "Xinyi Zhou et.al.", "authors": "Xinyi Zhou, Xing Li, Yingzhao Lian, Yiwen Wang, Lei Chen, Mingxuan Yuan, Jianye Hao, Guangyong Chen, Pheng Ann Heng", "id": "2410.16119v1", "paper_url": "http://arxiv.org/abs/2410.16119v1", "repo": "null"}}