{"2412.09614": {"publish_time": "2024-12-12", "title": "Context Canvas: Enhancing Text-to-Image Diffusion Models with Knowledge Graph-Based RAG", "paper_summary": "We introduce a novel approach to enhance the capabilities of text-to-image\nmodels by incorporating a graph-based RAG. Our system dynamically retrieves\ndetailed character information and relational data from the knowledge graph,\nenabling the generation of visually accurate and contextually rich images. This\ncapability significantly improves upon the limitations of existing T2I models,\nwhich often struggle with the accurate depiction of complex or culturally\nspecific subjects due to dataset constraints. Furthermore, we propose a novel\nself-correcting mechanism for text-to-image models to ensure consistency and\nfidelity in visual outputs, leveraging the rich context from the graph to guide\ncorrections. Our qualitative and quantitative experiments demonstrate that\nContext Canvas significantly enhances the capabilities of popular models such\nas Flux, Stable Diffusion, and DALL-E, and improves the functionality of\nControlNet for fine-grained image editing tasks. To our knowledge, Context\nCanvas represents the first application of graph-based RAG in enhancing T2I\nmodels, representing a significant advancement for producing high-fidelity,\ncontext-aware multi-faceted images.", "paper_summary_zh": "我們提出了一種新的方法來增強文字轉圖像模型的能力，方法是加入一個基於圖形的 RAG。我們的系統從知識圖譜中動態檢索詳細的角色資訊和關係資料，能夠產生視覺上準確且內容豐富的圖像。這種能力顯著地改善了現有 T2I 模型的限制，這些模型由於資料集的限制，通常難以準確描繪複雜或特定文化的題材。此外，我們提出了一種新的文字轉圖像模型自我修正機制，以確保視覺輸出的連貫性和保真度，利用圖形中的豐富內容來指導修正。我們的定性和定量實驗表明，Context Canvas 大幅增強了 Flux、Stable Diffusion 和 DALL-E 等熱門模型的能力，並改善了 ControlNet 在精細影像編輯任務中的功能。據我們所知，Context Canvas 代表了基於圖形的 RAG 在增強 T2I 模型中的首次應用，這代表了產生高保真、具有脈絡感知的多面向圖像的重大進展。", "author": "Kavana Venkatesh et.al.", "authors": "Kavana Venkatesh, Yusuf Dalva, Ismini Lourentzou, Pinar Yanardag", "id": "2412.09614v1", "paper_url": "http://arxiv.org/abs/2412.09614v1", "repo": "null"}}