{"2408.15491": {"publish_time": "2024-08-28", "title": "Enhancing and Accelerating Large Language Models via Instruction-Aware Contextual Compression", "paper_summary": "Large Language Models (LLMs) have garnered widespread attention due to their\nremarkable performance across various tasks. However, to mitigate the issue of\nhallucinations, LLMs often incorporate retrieval-augmented pipeline to provide\nthem with rich external knowledge and context. Nevertheless, challenges stem\nfrom inaccurate and coarse-grained context retrieved from the retriever.\nSupplying irrelevant context to the LLMs can result in poorer responses,\nincreased inference latency, and higher costs. This paper introduces a method\ncalled Instruction-Aware Contextual Compression, which filters out less\ninformative content, thereby accelerating and enhancing the use of LLMs. The\nexperimental results demonstrate that Instruction-Aware Contextual Compression\nnotably reduces memory consumption and minimizes generation latency while\nmaintaining performance levels comparable to those achieved with the use of the\nfull context. Specifically, we achieved a 50% reduction in context-related\ncosts, resulting in a 5% reduction in inference memory usage and a 2.2-fold\nincrease in inference speed, with only a minor drop of 0.047 in Rouge-1. These\nfindings suggest that our method strikes an effective balance between\nefficiency and performance.", "paper_summary_zh": "大型語言模型 (LLM) 因其在各種任務中的出色表現而廣受關注。然而，為了減輕幻覺問題，LLM 通常會整合檢索增強管道，為它們提供豐富的外部知識和背景。儘管如此，挑戰來自檢索器檢索到的不準確且粗略的背景。向 LLM 提供無關的背景可能會導致較差的回應、增加的推論延遲和更高的成本。本文介紹了一種稱為指令感知上下文壓縮的方法，它可以過濾掉信息量較少的内容，從而加速和增強 LLM 的使用。實驗結果表明，指令感知上下文壓縮顯著降低了內存消耗，並最大程度地減少了生成延遲，同時保持與使用完整背景時相當的性能水平。具體而言，我們將與上下文相關的成本降低了 50%，從而將推論內存使用量降低了 5%，將推論速度提高了 2.2 倍，而 Rouge-1 僅下降了 0.047。這些發現表明，我們的這種方法在效率和性能之間取得了有效的平衡。", "author": "Haowen Hou et.al.", "authors": "Haowen Hou, Fei Ma, Binwen Bai, Xinxin Zhu, Fei Yu", "id": "2408.15491v1", "paper_url": "http://arxiv.org/abs/2408.15491v1", "repo": "https://github.com/howard-hou/instruction-aware-contextual-compressor"}}