{"2406.15966": {"publish_time": "2024-06-23", "title": "Evaluating the Effectiveness of the Foundational Models for Q&A Classification in Mental Health care", "paper_summary": "Pre-trained Language Models (PLMs) have the potential to transform mental\nhealth support by providing accessible and culturally sensitive resources.\nHowever, despite this potential, their effectiveness in mental health care and\nspecifically for the Arabic language has not been extensively explored. To\nbridge this gap, this study evaluates the effectiveness of foundational models\nfor classification of Questions and Answers (Q&A) in the domain of mental\nhealth care. We leverage the MentalQA dataset, an Arabic collection featuring\nQ&A interactions related to mental health. In this study, we conducted\nexperiments using four different types of learning approaches: traditional\nfeature extraction, PLMs as feature extractors, Fine-tuning PLMs and prompting\nlarge language models (GPT-3.5 and GPT-4) in zero-shot and few-shot learning\nsettings. While traditional feature extractors combined with Support Vector\nMachines (SVM) showed promising performance, PLMs exhibited even better results\ndue to their ability to capture semantic meaning. For example, MARBERT achieved\nthe highest performance with a Jaccard Score of 0.80 for question\nclassification and a Jaccard Score of 0.86 for answer classification. We\nfurther conducted an in-depth analysis including examining the effects of\nfine-tuning versus non-fine-tuning, the impact of varying data size, and\nconducting error analysis. Our analysis demonstrates that fine-tuning proved to\nbe beneficial for enhancing the performance of PLMs, and the size of the\ntraining data played a crucial role in achieving high performance. We also\nexplored prompting, where few-shot learning with GPT-3.5 yielded promising\nresults. There was an improvement of 12% for question and classification and\n45% for answer classification. Based on our findings, it can be concluded that\nPLMs and prompt-based approaches hold promise for mental health support in\nArabic.", "paper_summary_zh": "<paragraph>預訓練語言模型 (PLM) 有潛力透過提供可存取且具文化敏感度的資源來轉化心理健康支持。\n然而，儘管有此潛力，它們在心理保健中的有效性，特別是對於阿拉伯語，尚未廣泛探討。為了彌補此差距，本研究評估基礎模型在心理保健領域中對問題與解答 (Q&A) 進行分類的有效性。我們利用 MentalQA 資料集，這是一個以阿拉伯語為特色的集合，包含與心理健康相關的 Q&A 互動。在本研究中，我們使用四種不同類型的學習方法進行實驗：傳統特徵萃取、PLM 作為特徵萃取器、微調 PLM，以及在零次學習和少次學習設定中提示大型語言模型 (GPT-3.5 和 GPT-4)。雖然傳統特徵萃取器結合支援向量機 (SVM) 顯示出有希望的效能，但 PLM 由於能夠擷取語義意義，因此表現得更好。例如，MARBERT 在問題分類中達到最高效能，Jaccard 得分為 0.80，在答案分類中 Jaccard 得分為 0.86。我們進一步進行深入分析，包括檢查微調與非微調的影響、不同資料大小的影響，以及進行錯誤分析。我們的分析表明，微調被證明有助於提升 PLM 的效能，而訓練資料的大小在達成高效能中扮演至關重要的角色。我們也探討了提示，其中使用 GPT-3.5 的少次學習產生有希望的結果。問題與分類進步了 12%，答案分類進步了 45%。根據我們的發現，可以得出結論，PLM 和基於提示的方法有望為阿拉伯語的心理健康提供支持。</paragraph>", "author": "Hassan Alhuzali et.al.", "authors": "Hassan Alhuzali, Ashwag Alasmari", "id": "2406.15966v1", "paper_url": "http://arxiv.org/abs/2406.15966v1", "repo": "null"}}