{"2412.09569": {"publish_time": "2024-12-12", "title": "JuStRank: Benchmarking LLM Judges for System Ranking", "paper_summary": "Given the rapid progress of generative AI, there is a pressing need to\nsystematically compare and choose between the numerous models and\nconfigurations available. The scale and versatility of such evaluations make\nthe use of LLM-based judges a compelling solution for this challenge.\nCrucially, this approach requires first to validate the quality of the LLM\njudge itself. Previous work has focused on instance-based assessment of LLM\njudges, where a judge is evaluated over a set of responses, or response pairs,\nwhile being agnostic to their source systems. We argue that this setting\noverlooks critical factors affecting system-level ranking, such as a judge's\npositive or negative bias towards certain systems. To address this gap, we\nconduct the first large-scale study of LLM judges as system rankers. System\nscores are generated by aggregating judgment scores over multiple system\noutputs, and the judge's quality is assessed by comparing the resulting system\nranking to a human-based ranking. Beyond overall judge assessment, our analysis\nprovides a fine-grained characterization of judge behavior, including their\ndecisiveness and bias.", "paper_summary_zh": "鉴于生成式 AI 的快速发展，迫切需要系统地比较和选择众多可用的模型和配置。此类评估的规模和多功能性使得基于 LLM 的评委的使用成为这一挑战的令人信服的解决方案。至关重要的是，这种方法首先需要验证 LLM 评委本身的质量。以前的工作重点是基于实例的 LLM 评委评估，其中评委在响应集合或响应对上进行评估，同时对它们的源系统不可知。我们认为，这种设置忽略了影响系统级排名的关键因素，例如评委对某些系统的正面或负面偏见。为了解决这一差距，我们对 LLM 评委作为系统排名者进行了首次大规模研究。系统分数是通过汇总对多个系统输出的判断分数生成的，评委的质量通过将生成的系统排名与基于人的排名进行比较来评估。除了整体评委评估之外，我们的分析还提供了对评委行为的细粒度表征，包括他们的果断性和偏见。", "author": "Ariel Gera et.al.", "authors": "Ariel Gera, Odellia Boni, Yotam Perlitz, Roy Bar-Haim, Lilach Eden, Asaf Yehudai", "id": "2412.09569v1", "paper_url": "http://arxiv.org/abs/2412.09569v1", "repo": "null"}}