{"2405.10621": {"publish_time": "2024-05-17", "title": "Historically Relevant Event Structuring for Temporal Knowledge Graph Reasoning", "paper_summary": "Temporal Knowledge Graph (TKG) reasoning focuses on predicting events through\nhistorical information within snapshots distributed on a timeline. Existing\nstudies mainly concentrate on two perspectives of leveraging the history of\nTKGs, including capturing evolution of each recent snapshot or correlations\namong global historical facts. Despite the achieved significant\naccomplishments, these models still fall short of (1) investigating the\ninfluences of multi-granularity interactions across recent snapshots and (2)\nharnessing the expressive semantics of significant links accorded with queries\nthroughout the entire history, especially events exerting a profound impact on\nthe future. These inadequacies restrict representation ability to reflect\nhistorical dependencies and future trends thoroughly. To overcome these\ndrawbacks, we propose an innovative TKG reasoning approach towards\n\\textbf{His}torically \\textbf{R}elevant \\textbf{E}vents \\textbf{S}tructuring\n($\\mathsf{HisRES}$). Concretely, $\\mathsf{HisRES}$ comprises two distinctive\nmodules excelling in structuring historically relevant events within TKGs,\nincluding a multi-granularity evolutionary encoder that captures structural and\ntemporal dependencies of the most recent snapshots, and a global relevance\nencoder that concentrates on crucial correlations among events relevant to\nqueries from the entire history. Furthermore, $\\mathsf{HisRES}$ incorporates a\nself-gating mechanism for adaptively merging multi-granularity recent and\nhistorically relevant structuring representations. Extensive experiments on\nfour event-based benchmarks demonstrate the state-of-the-art performance of\n$\\mathsf{HisRES}$ and indicate the superiority and effectiveness of structuring\nhistorical relevance for TKG reasoning.", "paper_summary_zh": "時序知識圖譜 (TKG) 推理專注於透過時序上分佈於快照中的歷史資訊來預測事件。現有研究主要集中於利用 TKG 歷史的兩個觀點，包括捕捉每個最近快照的演化或全局歷史事實之間的關聯性。儘管已取得顯著成就，但這些模型仍不足以 (1) 調查跨最近快照的多粒度互動影響，以及 (2) 利用與整個歷史中查詢相符的重要連結的表達語義，特別是對未來產生深遠影響的事件。這些不足限制了表示能力，無法徹底反映歷史依賴性和未來趨勢。為了克服這些缺點，我們提出了一個創新的 TKG 推理方法，朝向\\textbf{歷}史\\textbf{相}關\\textbf{事}件\\textbf{結}構（$\\mathsf{HisRES}$）。具體來說，$\\mathsf{HisRES}$ 包含兩個獨特的模組，擅長於建構 TKG 中歷史相關事件，包括一個多粒度演化編碼器，用於捕捉最近快照的結構和時間依賴性，以及一個全局相關編碼器，用於專注於與查詢相關的事件在整個歷史中的關鍵關聯性。此外，$\\mathsf{HisRES}$ 結合了一個自門控機制，用於自適應地合併多粒度最近和歷史相關的建構表示。在四個基於事件的基準上進行的廣泛實驗證明了 $\\mathsf{HisRES}$ 的最先進效能，並表明建構歷史相關性對於 TKG 推理的優越性和有效性。", "author": "Jinchuan Zhang et.al.", "authors": "Jinchuan Zhang, Bei Hui, Chong Mu, Ming Sun, Ling Tian", "id": "2405.10621v1", "paper_url": "http://arxiv.org/abs/2405.10621v1", "repo": "null"}}