{"2410.13445": {"publish_time": "2024-10-17", "title": "Parameter-efficient Adaptation of Multilingual Multimodal Models for Low-resource ASR", "paper_summary": "Automatic speech recognition (ASR) for low-resource languages remains a\nchallenge due to the scarcity of labeled training data. Parameter-efficient\nfine-tuning and text-only adaptation are two popular methods that have been\nused to address such low-resource settings. In this work, we investigate how\nthese techniques can be effectively combined using a multilingual multimodal\nmodel like SeamlessM4T. Multimodal models are able to leverage unlabeled text\nvia text-only adaptation with further parameter-efficient ASR fine-tuning, thus\nboosting ASR performance. We also show cross-lingual transfer from a\nhigh-resource language, achieving up to a relative 17% WER reduction over a\nbaseline in a zero-shot setting without any labeled speech.", "paper_summary_zh": "由於標籤訓練資料的稀少性，低資源語言的自動語音辨識（ASR）仍然是一個挑戰。參數有效微調和僅文字適應是兩種用於解決此類低資源設定的熱門方法。在這項工作中，我們研究如何使用 SeamlessM4T 等多語言多模態模型有效地結合這些技術。多模態模型能夠透過僅文字適應和進一步參數有效的 ASR 微調來利用未標記文字，從而提升 ASR 效能。我們還展示了從高資源語言的跨語言轉移，在沒有任何標籤語音的零次學習設定中，相較於基準，WER 降低了相對 17%。", "author": "Abhishek Gupta et.al.", "authors": "Abhishek Gupta, Amruta Parulekar, Sameep Chattopadhyay, Preethi Jyothi", "id": "2410.13445v1", "paper_url": "http://arxiv.org/abs/2410.13445v1", "repo": "null"}}