{"2501.18328": {"publish_time": "2025-01-30", "title": "CodeBrain: Impute Any Brain MRI via Instance-specific Scalar-quantized Codes", "paper_summary": "MRI imputation aims to synthesize the missing modality from one or more\navailable ones, which is highly desirable since it reduces scanning costs and\ndelivers comprehensive MRI information to enhance clinical diagnosis. In this\npaper, we propose a unified model, CodeBrain, designed to adapt to various\nbrain MRI imputation scenarios. The core design lies in casting various\ninter-modality transformations as a full-modality code prediction task. To this\nend, CodeBrain is trained in two stages: Reconstruction and Code Prediction.\nFirst, in the Reconstruction stage, we reconstruct each MRI modality, which is\nmapped into a shared latent space followed by a scalar quantization. Since such\nquantization is lossy and the code is low dimensional, another MRI modality\nbelonging to the same subject is randomly selected to generate common features\nto supplement the code and boost the target reconstruction. In the second\nstage, we train another encoder by a customized grading loss to predict the\nfull-modality codes from randomly masked MRI samples, supervised by the\ncorresponding quantized codes generated from the first stage. In this way, the\ninter-modality transformation is achieved by mapping the instance-specific\ncodes in a finite scalar space. We evaluated the proposed CodeBrain model on\ntwo public brain MRI datasets (i.e., IXI and BraTS 2023). Extensive experiments\ndemonstrate that our CodeBrain model achieves superior imputation performance\ncompared to four existing methods, establishing a new state of the art for\nunified brain MRI imputation. Codes will be released.", "paper_summary_zh": "MRI 補完旨在從一個或多個可用方式中合成遺失的模態，這是非常理想的，因為它降低了掃描成本，並提供了全面的 MRI 資訊以增強臨床診斷。在本文中，我們提出了一個統一模型 CodeBrain，旨在適應各種腦部 MRI 補完場景。核心設計在於將各種模態間轉換轉換為全模態碼預測任務。為此，CodeBrain 分兩個階段進行訓練：重建和碼預測。首先，在重建階段，我們重建每個 MRI 模態，它被映射到一個共享潛在空間，然後進行標量量化。由於這種量化是有損的，並且碼的維度很低，因此隨機選擇屬於同一個受試者的另一個 MRI 模態來產生共同特徵以補充碼並提升目標重建。在第二階段，我們通過自訂分級損失訓練另一個編碼器，從隨機遮罩的 MRI 樣本預測全模態碼，並由第一階段產生的對應量化碼進行監督。這樣，模態間轉換是通過將特定於例項的碼映射到一個有限的標量空間來實現的。我們在兩個公開的腦部 MRI 資料集（即 IXI 和 BraTS 2023）上評估了所提出的 CodeBrain 模型。大量的實驗證明，與四種現有方法相比，我們的 CodeBrain 模型實現了優異的補完效能，為統一的腦部 MRI 補完建立了新的技術水準。碼將會釋出。", "author": "Yicheng Wu et.al.", "authors": "Yicheng Wu, Tao Song, Zhonghua Wu, Zongyuan Ge, Zhaolin Chen, Jianfei Cai", "id": "2501.18328v1", "paper_url": "http://arxiv.org/abs/2501.18328v1", "repo": "null"}}