{"2406.17761": {"publish_time": "2024-06-25", "title": "CaLMQA: Exploring culturally specific long-form question answering across 23 languages", "paper_summary": "Large language models (LLMs) are commonly used for long-form question\nanswering, which requires them to generate paragraph-length answers to complex\nquestions. While long-form QA has been well-studied in English via many\ndifferent datasets and evaluation metrics, this research has not been extended\nto cover most other languages. To bridge this gap, we introduce CaLMQA, a\ncollection of 2.6K complex questions spanning 23 languages, including\nunder-resourced, rarely-studied languages such as Fijian and Kirundi. Our\ndataset includes both naturally-occurring questions collected from community\nweb forums as well as questions written by native speakers, whom we hire for\nthis purpose. Our process yields diverse, complex questions that reflect\ncultural topics (e.g. traditions, laws, news) and the language usage of native\nspeakers. We conduct automatic evaluation across a suite of open- and\nclosed-source models using our novel metric CaLMScore, which detects incorrect\nlanguage and token repetitions in answers, and observe that the quality of\nLLM-generated answers degrades significantly for some low-resource languages.\nWe perform human evaluation on a subset of models and see that model\nperformance is significantly worse for culturally specific questions than for\nculturally agnostic questions. Our findings highlight the need for further\nresearch in LLM multilingual capabilities and non-English LFQA evaluation.", "paper_summary_zh": "大型語言模型 (LLM) 常用於長篇問答，這需要它們針對複雜問題產生段落長度的答案。雖然長篇問答已透過許多不同的資料集和評估指標在英文中得到充分研究，但此研究尚未擴展到涵蓋大多數其他語言。為了彌補這個差距，我們引入了 CaLMQA，這是一個包含 2.6K 個複雜問題的集合，涵蓋 23 種語言，包括斐濟語和基隆迪語等資源不足、鮮少研究的語言。我們的資料集包含從社群網路論壇收集到的自然發生問題，以及我們為此目的聘請母語人士撰寫的問題。我們的流程產生了多元、複雜的問題，反映了文化主題（例如傳統、法律、新聞）和母語人士的語言使用。我們使用我們的新穎指標 CaLMScore 對一系列開放和閉源模型進行自動評估，該指標會偵測答案中的不正確語言和重複記號，並觀察到 LLM 生成的答案品質對於某些低資源語言會顯著下降。我們對模型的子集進行人工評估，並發現針對特定文化問題的模型效能顯著低於針對文化不可知問題的模型效能。我們的研究結果突顯了進一步研究 LLM 多語言能力和非英文 LFQA 評估的必要性。", "author": "Shane Arora et.al.", "authors": "Shane Arora, Marzena Karpinska, Hung-Ting Chen, Ipsita Bhattacharjee, Mohit Iyyer, Eunsol Choi", "id": "2406.17761v1", "paper_url": "http://arxiv.org/abs/2406.17761v1", "repo": "https://github.com/2015aroras/calmqa"}}