{"2405.17025": {"publish_time": "2024-05-27", "title": "SWAT: Scalable and Efficient Window Attention-based Transformers Acceleration on FPGAs", "paper_summary": "Efficiently supporting long context length is crucial for Transformer models.\nThe quadratic complexity of the self-attention computation plagues traditional\nTransformers. Sliding window-based static sparse attention mitigates the\nproblem by limiting the attention scope of the input tokens, reducing the\ntheoretical complexity from quadratic to linear. Although the sparsity induced\nby window attention is highly structured, it does not align perfectly with the\nmicroarchitecture of the conventional accelerators, leading to suboptimal\nimplementation. In response, we propose a dataflow-aware FPGA-based accelerator\ndesign, SWAT, that efficiently leverages the sparsity to achieve scalable\nperformance for long input. The proposed microarchitecture is based on a design\nthat maximizes data reuse by using a combination of row-wise dataflow, kernel\nfusion optimization, and an input-stationary design considering the distributed\nmemory and computation resources of FPGA. Consequently, it achieves up to\n22$\\times$ and 5.7$\\times$ improvement in latency and energy efficiency\ncompared to the baseline FPGA-based accelerator and 15$\\times$ energy\nefficiency compared to GPU-based solution.", "paper_summary_zh": "有效支援長背景長度對 Transformer 模型至關重要。\n自注意力運算的二次複雜度困擾著傳統 Transformer。\n基於滑動視窗的靜態稀疏注意力透過限制輸入標記的注意力範圍來減輕問題，將理論複雜度從二次降低到線性。\n雖然視窗注意力所引發的稀疏性高度結構化，但它與傳統加速器的微架構並不完全一致，導致次佳實作。\n為了解決這個問題，我們提出一個資料流程感知的基於 FPGA 的加速器設計 SWAT，它有效利用稀疏性，以達成長輸入的可擴充效能。\n所提出的微架構基於一種設計，它透過結合逐行資料流程、核心融合最佳化以及考量 FPGA 的分散式記憶體和運算資源的輸入靜止設計來最大化資料重複使用。\n因此，與基線的基於 FPGA 的加速器相比，它在延遲和能源效率方面分別達到了 22 倍和 5.7 倍的提升，與基於 GPU 的解決方案相比，能源效率提升了 15 倍。", "author": "Zhenyu Bai et.al.", "authors": "Zhenyu Bai, Pranav Dangi, Huize Li, Tulika Mitra", "id": "2405.17025v1", "paper_url": "http://arxiv.org/abs/2405.17025v1", "repo": "null"}}