{"2502.12776": {"publish_time": "2025-02-18", "title": "Portable Reward Tuning: Towards Reusable Fine-Tuning across Different Pretrained Models", "paper_summary": "While foundation models have been exploited for various expert tasks through\nfine-tuning, any foundation model will become outdated due to its old knowledge\nor limited capability. Thus the underlying foundation model should be\neventually replaced by new ones, which leads to repeated cost of fine-tuning\nthese new models. Existing work addresses this problem by inference-time\ntuning, i.e., modifying the output probabilities from the new foundation model\nwith the outputs from the old foundation model and its fine-tuned model, which\ninvolves an additional overhead in inference by the latter two models. In this\npaper, we propose a new fine-tuning principle, Portable Reward Tuning (PRT),\nthat reduces the inference overhead by its nature, based on the reformulation\nof fine-tuning as the reward maximization. Specifically, instead of fine-tuning\nparameters of the foundation models, PRT trains the reward model explicitly\nthrough the same loss function as in fine-tuning. During inference, the reward\nmodel can be used with any foundation model (with the same set of vocabularies\nor labels) through the formulation of reward maximization. Experimental\nresults, covering both vision and language models, demonstrate that the\nPRT-trained model can achieve comparable accuracy to the existing work of\ninference-time tuning, with less inference cost.", "paper_summary_zh": "儘管基礎模型已透過微調用於各種專家任務，任何基礎模型都將因其舊知識或有限功能而過時。因此，基礎模型最終應由新模型取代，這導致重複微調這些新模型的成本。現有工作透過推論時間調整來解決這個問題，即使用舊基礎模型及其微調模型的輸出修改新基礎模型的輸出機率，這涉及後兩個模型在推論中的額外開銷。在本文中，我們提出一個新的微調原則，可攜式獎勵調整 (PRT)，它本質上會減少推論開銷，基於將微調重新表述為獎勵最大化。具體來說，PRT 不是微調基礎模型的參數，而是透過與微調中相同的損失函數明確訓練獎勵模型。在推論期間，獎勵模型可透過獎勵最大化的公式與任何基礎模型（具有相同的詞彙或標籤組）一起使用。涵蓋視覺和語言模型的實驗結果證明，PRT 訓練的模型可以達到與現有推論時間調整工作相當的準確度，且推論成本較低。", "author": "Daiki Chijiwa et.al.", "authors": "Daiki Chijiwa, Taku Hasegawa, Kyosuke Nishida, Kuniko Saito, Susumu Takeuchi", "id": "2502.12776v1", "paper_url": "http://arxiv.org/abs/2502.12776v1", "repo": "null"}}