{"2502.09919": {"publish_time": "2025-02-14", "title": "AttenGluco: Multimodal Transformer-Based Blood Glucose Forecasting on AI-READI Dataset", "paper_summary": "Diabetes is a chronic metabolic disorder characterized by persistently high\nblood glucose levels (BGLs), leading to severe complications such as\ncardiovascular disease, neuropathy, and retinopathy. Predicting BGLs enables\npatients to maintain glucose levels within a safe range and allows caregivers\nto take proactive measures through lifestyle modifications. Continuous Glucose\nMonitoring (CGM) systems provide real-time tracking, offering a valuable tool\nfor monitoring BGLs. However, accurately forecasting BGLs remains challenging\ndue to fluctuations due to physical activity, diet, and other factors. Recent\ndeep learning models show promise in improving BGL prediction. Nonetheless,\nforecasting BGLs accurately from multimodal, irregularly sampled data over long\nprediction horizons remains a challenging research problem. In this paper, we\npropose AttenGluco, a multimodal Transformer-based framework for long-term\nblood glucose prediction. AttenGluco employs cross-attention to effectively\nintegrate CGM and activity data, addressing challenges in fusing data with\ndifferent sampling rates. Moreover, it employs multi-scale attention to capture\nlong-term dependencies in temporal data, enhancing forecasting accuracy. To\nevaluate the performance of AttenGluco, we conduct forecasting experiments on\nthe recently released AIREADI dataset, analyzing its predictive accuracy across\ndifferent subject cohorts including healthy individuals, people with\nprediabetes, and those with type 2 diabetes. Furthermore, we investigate its\nperformance improvements and forgetting behavior as new cohorts are introduced.\nOur evaluations show that AttenGluco improves all error metrics, such as root\nmean square error (RMSE), mean absolute error (MAE), and correlation, compared\nto the multimodal LSTM model. AttenGluco outperforms this baseline model by\nabout 10% and 15% in terms of RMSE and MAE, respectively.", "paper_summary_zh": "糖尿病是一种慢性代谢疾病，其特征是持续高血糖水平 (BGL)，导致严重并发症，如心血管疾病、神经病变和视网膜病变。预测 BGL 使患者能够将葡萄糖水平保持在安全范围内，并允许护理人员通过改变生活方式采取积极措施。持续葡萄糖监测 (CGM) 系统提供实时跟踪，为监测 BGL 提供了一个有价值的工具。然而，由于身体活动、饮食和其他因素导致的波动，准确预测 BGL 仍然具有挑战性。最近的深度学习模型显示出改善 BGL 预测的希望。尽管如此，从多模式、不规则采样的数据中准确预测长期预测范围内的 BGL 仍然是一个具有挑战性的研究问题。在本文中，我们提出了 AttenGluco，一个基于多模式 Transformer 的长期血糖预测框架。AttenGluco 采用交叉注意力来有效地整合 CGM 和活动数据，解决了以不同采样率融合数据中的挑战。此外，它采用多尺度注意力来捕获时间数据中的长期依赖关系，提高预测准确性。为了评估 AttenGluco 的性能，我们在最近发布的 AIREADI 数据集上进行预测实验，分析了其在不同受试者队列中的预测准确性，包括健康个体、患有糖尿病前期的人和患有 2 型糖尿病的人。此外，我们研究了随着新队列的引入，其性能的提升和遗忘行为。我们的评估表明，与多模式 LSTM 模型相比，AttenGluco 改进了所有误差指标，例如均方根误差 (RMSE)、平均绝对误差 (MAE) 和相关性。AttenGluco 在 RMSE 和 MAE 方面分别比这个基准模型高出约 10% 和 15%。", "author": "Ebrahim Farahmand et.al.", "authors": "Ebrahim Farahmand, Reza Rahimi Azghan, Nooshin Taheri Chatrudi, Eric Kim, Gautham Krishna Gudur, Edison Thomaz, Giulia Pedrielli, Pavan Turaga, Hassan Ghasemzadeh", "id": "2502.09919v1", "paper_url": "http://arxiv.org/abs/2502.09919v1", "repo": "null"}}