{"2411.18506": {"publish_time": "2024-11-27", "title": "LLM-ABBA: Understanding time series via symbolic approximation", "paper_summary": "The success of large language models (LLMs) for time series has been\ndemonstrated in previous work. Utilizing a symbolic time series representation,\none can efficiently bridge the gap between LLMs and time series. However, the\nremaining challenge is to exploit the semantic information hidden in time\nseries by using symbols or existing tokens of LLMs, while aligning the\nembedding space of LLMs according to the hidden information of time series. The\nsymbolic time series approximation (STSA) method called adaptive Brownian\nbridge-based symbolic aggregation (ABBA) shows outstanding efficacy in\npreserving salient time series features by modeling time series patterns in\nterms of amplitude and period while using existing tokens of LLMs.\n  In this paper, we introduce a method, called LLM-ABBA, that integrates ABBA\ninto large language models for various downstream time series tasks. By\nsymbolizing time series, LLM-ABBA compares favorably to the recent\nstate-of-the-art (SOTA) in UCR and three medical time series classification\ntasks. Meanwhile, a fixed-polygonal chain trick in ABBA is introduced to\n\\kc{avoid obvious drifting} during prediction tasks by significantly mitigating\nthe effects of cumulative error arising from misused symbols during the\ntransition from symbols to numerical values. In time series regression tasks,\nLLM-ABBA achieves the new SOTA on Time Series Extrinsic Regression (TSER)\nbenchmarks. LLM-ABBA also shows competitive prediction capability compared to\nrecent SOTA time series prediction results. We believe this framework can also\nseamlessly extend to other time series tasks.", "paper_summary_zh": "大型語言模型 (LLM) 在時間序列方面的成功已在先前的研究中得到證明。利用符號時間序列表示，可以有效地彌合 LLM 和時間序列之間的差距。然而，剩下的挑戰是利用符號或現有 LLM 標記來利用隱藏在時間序列中的語義資訊，同時根據時間序列的隱藏資訊對齊 LLM 的嵌入空間。稱為自適應布朗橋符號聚合 (ABBA) 的符號時間序列近似 (STSA) 方法在透過振幅和週期來建模時間序列模式，同時使用現有 LLM 標記方面，展現出在保留顯著時間序列特徵方面的出色功效。\n在本文中，我們介紹一種稱為 LLM-ABBA 的方法，它將 ABBA 整合到大型語言模型中，以執行各種下游時間序列任務。透過將時間序列符號化，LLM-ABBA 與 UCR 和三個醫療時間序列分類任務中的最新技術 (SOTA) 相比，具有明顯的優勢。同時，ABBA 中引入了固定多邊形鏈技巧，透過大幅減輕從符號轉換為數值時，因誤用符號而產生的累積誤差影響，來避免在預測任務期間出現明顯的漂移。在時間序列回歸任務中，LLM-ABBA 在時間序列外在回歸 (TSER) 基準上達到了新的 SOTA。與最近的 SOTA 時間序列預測結果相比，LLM-ABBA 也展現出具競爭力的預測能力。我們相信這個架構也可以無縫地擴充到其他時間序列任務。", "author": "Erin Carson et.al.", "authors": "Erin Carson, Xinye Chen, Cheng Kang", "id": "2411.18506v3", "paper_url": "http://arxiv.org/abs/2411.18506v3", "repo": "null"}}