{"2408.08821": {"publish_time": "2024-08-16", "title": "EasyRec: Simple yet Effective Language Models for Recommendation", "paper_summary": "Deep neural networks have become a powerful technique for learning\nrepresentations from user-item interaction data in collaborative filtering (CF)\nfor recommender systems. However, many existing methods heavily rely on unique\nuser and item IDs, which limits their ability to perform well in practical\nzero-shot learning scenarios where sufficient training data may be unavailable.\nInspired by the success of language models (LMs) and their strong\ngeneralization capabilities, a crucial question arises: How can we harness the\npotential of language models to empower recommender systems and elevate its\ngeneralization capabilities to new heights? In this study, we propose EasyRec -\nan effective and easy-to-use approach that seamlessly integrates text-based\nsemantic understanding with collaborative signals. EasyRec employs a\ntext-behavior alignment framework, which combines contrastive learning with\ncollaborative language model tuning, to ensure a strong alignment between the\ntext-enhanced semantic space and the collaborative behavior information.\nExtensive empirical evaluations across diverse real-world datasets demonstrate\nthe superior performance of EasyRec compared to state-of-the-art alternative\nmodels, particularly in the challenging text-based zero-shot recommendation\nscenarios. Furthermore, the study highlights the potential of seamlessly\nintegrating EasyRec as a plug-and-play component into text-enhanced\ncollaborative filtering frameworks, thereby empowering existing recommender\nsystems to elevate their recommendation performance and adapt to the evolving\nuser preferences in dynamic environments. For better result reproducibility of\nour EasyRec framework, the model implementation details, source code, and\ndatasets are available at the link: https://github.com/HKUDS/EasyRec.", "paper_summary_zh": "深度神经网络已成为一种强大的技术，可用于从协同过滤 (CF) 中的使用者-项目互动资料中学习表征，以用于推荐系统。然而，许多现有方法严重依赖于唯一的使用者和项目 ID，这限制了它们在实际零次学习场景中表现良好的能力，而在实际零次学习场景中，可能无法获得足够的训练资料。在语言模型 (LM) 及其强大的概括能力取得成功后，一个关键问题出现了：我们如何利用语言模型的潜力来增强推荐系统，并将其概括能力提升到新的高度？在本研究中，我们提出了 EasyRec - 一种有效且易于使用的途径，可将基于文本的语义理解与协作信号无缝整合。EasyRec 采用文本行为对齐框架，将对比学习与协作语言模型调整相结合，以确保文本增强语义空间与协作行为信息之间有很强的对齐。在各种实际数据集上进行广泛的实证评估，证明了 EasyRec 与最先进的替代模型相比具有卓越的性能，尤其是在具有挑战性的基于文本的零次推荐场景中。此外，本研究强调了将 EasyRec 无缝整合为即插即用组件到文本增强协作过滤框架中的潜力，从而使现有的推荐系统能够提升其推荐性能，并适应动态环境中不断变化的使用者偏好。为了更好地重现我们 EasyRec 框架的结果，模型实现细节、源代码和数据集可在以下链接获得：https://github.com/HKUDS/EasyRec。", "author": "Xubin Ren et.al.", "authors": "Xubin Ren, Chao Huang", "id": "2408.08821v1", "paper_url": "http://arxiv.org/abs/2408.08821v1", "repo": "https://github.com/hkuds/easyrec"}}