{"2405.15683": {"publish_time": "2024-05-24", "title": "VDGD: Mitigating LVLM Hallucinations in Cognitive Prompts by Bridging the Visual Perception Gap", "paper_summary": "Recent interest in Large Vision-Language Models (LVLMs) for practical\napplications is moderated by the significant challenge of hallucination or the\ninconsistency between the factual information and the generated text. In this\npaper, we first perform an in-depth analysis of hallucinations and discover\nseveral novel insights about how and when LVLMs hallucinate. From our analysis,\nwe show that: (1) The community's efforts have been primarily targeted towards\nreducing hallucinations related to visual recognition (VR) prompts (e.g.,\nprompts that only require describing the image), thereby ignoring\nhallucinations for cognitive prompts (e.g., prompts that require additional\nskills like reasoning on contents of the image). (2) LVLMs lack visual\nperception, i.e., they can see but not necessarily understand or perceive the\ninput image. We analyze responses to cognitive prompts and show that LVLMs\nhallucinate due to a perception gap: although LVLMs accurately recognize visual\nelements in the input image and possess sufficient cognitive skills, they\nstruggle to respond accurately and hallucinate. To overcome this shortcoming,\nwe propose Visual Description Grounded Decoding (VDGD), a simple, robust, and\ntraining-free method for alleviating hallucinations. Specifically, we first\ndescribe the image and add it as a prefix to the instruction. Next, during\nauto-regressive decoding, we sample from the plausible candidates according to\ntheir KL-Divergence (KLD) to the description, where lower KLD is given higher\npreference. Experimental results on several benchmarks and LVLMs show that VDGD\nimproves significantly over other baselines in reducing hallucinations. We also\npropose VaLLu, a benchmark for the comprehensive evaluation of the cognitive\ncapabilities of LVLMs.", "paper_summary_zh": "<paragraph>最近對大型視覺語言模型 (LVLMs) 在實際應用中的興趣受到幻覺或事實資訊與生成文字之間不一致的重大挑戰所影響。在本文中，我們首先對幻覺進行深入分析，並發現有關 LVLMs 如何以及何時產生幻覺的幾個新見解。從我們的分析中，我們表明：(1) 社群的努力主要針對減少與視覺辨識 (VR) 提示相關的幻覺 (例如，僅需要描述影像的提示)，從而忽略認知提示的幻覺 (例如，需要額外技能的提示，例如對影像內容進行推理)。(2) LVLMs 缺乏視覺感知，也就是說，它們可以看到，但不一定能理解或感知輸入影像。我們分析對認知提示的回應，並表明 LVLMs 由於感知差距而產生幻覺：儘管 LVLMs 能準確辨識輸入影像中的視覺元素，並具備足夠的認知技能，但它們難以準確回應並產生幻覺。為了克服這個缺點，我們提出視覺描述接地解碼 (VDGD)，這是一種簡單、強健且無需訓練的方法，可以減輕幻覺。具體來說，我們首先描述影像，並將其作為指令的前綴新增。接下來，在自迴歸解碼過程中，我們根據它們與描述的 KL-散度 (KLD) 從合理的候選項中進行抽樣，其中較低的 KLD 會獲得較高的優先權。在幾個基準和 LVLMs 上的實驗結果表明，VDGD 在減少幻覺方面顯著優於其他基準。我們還提出了 VaLLu，這是一個用於全面評估 LVLMs 認知能力的基準。</paragraph>", "author": "Sreyan Ghosh et.al.", "authors": "Sreyan Ghosh, Chandra Kiran Reddy Evuru, Sonal Kumar, Utkarsh Tyagi, Oriol Nieto, Zeyu Jin, Dinesh Manocha", "id": "2405.15683v1", "paper_url": "http://arxiv.org/abs/2405.15683v1", "repo": "null"}}