{"2406.04029": {"publish_time": "2024-06-06", "title": "Pre-trained Transformer Uncovers Meaningful Patterns in Human Mobility Data", "paper_summary": "We empirically demonstrate that a transformer pre-trained on country-scale\nunlabeled human mobility data learns embeddings capable, through fine-tuning,\nof developing a deep understanding of the target geography and its\ncorresponding mobility patterns. Utilizing an adaptation framework, we evaluate\nthe performance of our pre-trained embeddings in encapsulating a broad spectrum\nof concepts directly and indirectly related to human mobility. This includes\nbasic notions, such as geographic location and distance, and extends to more\ncomplex constructs, such as administrative divisions and land cover. Our\nextensive empirical analysis reveals a substantial performance boost gained\nfrom pre-training, reaching up to 38% in tasks such as tree-cover regression.\nWe attribute this result to the ability of the pre-training to uncover\nmeaningful patterns hidden in the raw data, beneficial for modeling relevant\nhigh-level concepts. The pre-trained embeddings emerge as robust\nrepresentations of regions and trajectories, potentially valuable for a wide\nrange of downstream applications.", "paper_summary_zh": "我們透過實證證明，在國家級規模未標註人類流動性資料上預先訓練的轉換器，學習了能夠透過微調，發展對目標地理及其對應流動性模式的深入理解的嵌入。利用適應架構，我們評估了預先訓練的嵌入在概括與人類流動性直接和間接相關的廣泛概念方面的效能。這包括基本概念，例如地理位置和距離，並延伸到更複雜的結構，例如行政區劃和土地覆蓋。我們廣泛的實證分析揭示了從預訓練中獲得的顯著效能提升，在樹木覆蓋回歸等任務中達到 38%。我們將此結果歸因於預訓練揭示原始資料中隱藏的意義模式的能力，這有助於建模相關的高階概念。預先訓練的嵌入成為區域和軌跡的強健表示，對於廣泛的下游應用潛在有價值。", "author": "Alameen Najjar et.al.", "authors": "Alameen Najjar", "id": "2406.04029v1", "paper_url": "http://arxiv.org/abs/2406.04029v1", "repo": "null"}}