{"2410.10524": {"publish_time": "2024-10-14", "title": "Get Rid of Task Isolation: A Continuous Multi-task Spatio-Temporal Learning Framework", "paper_summary": "Spatiotemporal learning has become a pivotal technique to enable urban\nintelligence. Traditional spatiotemporal models mostly focus on a specific task\nby assuming a same distribution between training and testing sets. However,\ngiven that urban systems are usually dynamic, multi-sourced with imbalanced\ndata distributions, current specific task-specific models fail to generalize to\nnew urban conditions and adapt to new domains without explicitly modeling\ninterdependencies across various dimensions and types of urban data. To this\nend, we argue that there is an essential to propose a Continuous Multi-task\nSpatio-Temporal learning framework (CMuST) to empower collective urban\nintelligence, which reforms the urban spatiotemporal learning from\nsingle-domain to cooperatively multi-dimensional and multi-task learning.\nSpecifically, CMuST proposes a new multi-dimensional spatiotemporal interaction\nnetwork (MSTI) to allow cross-interactions between context and main\nobservations as well as self-interactions within spatial and temporal aspects\nto be exposed, which is also the core for capturing task-level commonality and\npersonalization. To ensure continuous task learning, a novel Rolling Adaptation\ntraining scheme (RoAda) is devised, which not only preserves task uniqueness by\nconstructing data summarization-driven task prompts, but also harnesses\ncorrelated patterns among tasks by iterative model behavior modeling. We\nfurther establish a benchmark of three cities for multi-task spatiotemporal\nlearning, and empirically demonstrate the superiority of CMuST via extensive\nevaluations on these datasets. The impressive improvements on both few-shot\nstreaming data and new domain tasks against existing SOAT methods are achieved.\nCode is available at https://github.com/DILab-USTCSZ/CMuST.", "paper_summary_zh": "時空學習已成為實現城市智能的關鍵技術。傳統的時空模型大多集中在特定任務上，假設訓練集和測試集之間的分布相同。然而，鑑於城市系統通常是動態的、多源的，且資料分佈不平衡，目前特定任務模型無法概括到新的城市條件，也無法適應新的領域，而沒有明確地建模跨各種維度和類型城市資料的相互依賴性。為此，我們認為有必要提出一個連續多任務時空學習框架 (CMuST) 來增強集體城市智能，從單一領域的城市時空學習改革為協作的多維度和多任務學習。具體來說，CMuST 提出了一個新的多維時空交互網路 (MSTI)，允許上下文與主要觀測之間的交互作用以及時空方面內的自我交互作用被揭示，這也是捕捉任務級共性和個性化的核心。為了確保連續任務學習，設計了一個新穎的滾動適應訓練方案 (RoAda)，它不僅通過構建資料摘要驅動的任務提示來保留任務的獨特性，還通過迭代模型行為建模來利用任務之間的關聯模式。我們進一步建立了三個城市的多任務時空學習基準，並通過對這些資料集的廣泛評估，實證地證明了 CMuST 的優越性。相對於現有的 SOAT 方法，在少樣本串流資料和新領域任務上都取得了令人印象深刻的進步。程式碼可在 https://github.com/DILab-USTCSZ/CMuST 獲得。", "author": "Zhongchao Yi et.al.", "authors": "Zhongchao Yi, Zhengyang Zhou, Qihe Huang, Yanjiang Chen, Liheng Yu, Xu Wang, Yang Wang", "id": "2410.10524v1", "paper_url": "http://arxiv.org/abs/2410.10524v1", "repo": "https://github.com/dilab-ustcsz/cmust"}}