{"2501.02977": {"publish_time": "2025-01-06", "title": "CAMP: Collaborative Attention Model with Profiles for Vehicle Routing Problems", "paper_summary": "The profiled vehicle routing problem (PVRP) is a generalization of the\nheterogeneous capacitated vehicle routing problem (HCVRP) in which the\nobjective is to optimize the routes of vehicles to serve client demands subject\nto different vehicle profiles, with each having a preference or constraint on a\nper-client basis. While existing learning methods have shown promise for\nsolving the HCVRP in real-time, no learning method exists to solve the more\npractical and challenging PVRP. In this paper, we propose a Collaborative\nAttention Model with Profiles (CAMP), a novel approach that learns efficient\nsolvers for PVRP using multi-agent reinforcement learning. CAMP employs a\nspecialized attention-based encoder architecture to embed profiled client\nembeddings in parallel for each vehicle profile. We design a communication\nlayer between agents for collaborative decision-making across profiled\nembeddings at each decoding step and a batched pointer mechanism to attend to\nthe profiled embeddings to evaluate the likelihood of the next actions. We\nevaluate CAMP on two variants of PVRPs: PVRP with preferences, which explicitly\ninfluence the reward function, and PVRP with zone constraints with different\nnumbers of agents and clients, demonstrating that our learned solvers achieve\ncompetitive results compared to both classical state-of-the-art neural\nmulti-agent models in terms of solution quality and computational efficiency.\nWe make our code openly available at https://github.com/ai4co/camp.", "paper_summary_zh": "剖面車輛路徑問題 (PVRP) 是異質容量車輛路徑問題 (HCVRP) 的概括，其目標是最佳化車輛路徑以服務客戶需求，但受不同車輛剖面的約束，每個剖面都有對每個客戶的偏好或約束。雖然現有的學習方法已展現出即時解決 HCVRP 的希望，但沒有學習方法可以解決更實際且更具挑戰性的 PVRP。在本文中，我們提出一個帶剖面的協作注意力模型 (CAMP)，這是一種新穎的方法，它使用多智能體強化學習來學習 PVRP 的有效求解器。CAMP 使用一個基於注意力的編碼器架構，為每個車輛剖面並行嵌入剖面客戶嵌入。我們設計了一個通訊層，讓智能體在每個解碼步驟中跨剖面嵌入進行協作決策，並使用一個批次指標機制來關注剖面嵌入，以評估下一個動作的可能性。我們在 PVRP 的兩個變體上評估 CAMP：帶偏好的 PVRP，它明確影響獎勵函數，以及帶區域約束的 PVRP，其中有不同數量的智能體和客戶，證明我們學習的求解器在解決品質和計算效率方面，與傳統最先進的神經多智能體模型相比，取得了具有競爭力的結果。我們在 https://github.com/ai4co/camp 上公開我們的程式碼。", "author": "Chuanbo Hua et.al.", "authors": "Chuanbo Hua, Federico Berto, Jiwoo Son, Seunghyun Kang, Changhyun Kwon, Jinkyoo Park", "id": "2501.02977v1", "paper_url": "http://arxiv.org/abs/2501.02977v1", "repo": "null"}}