{"2410.21028": {"publish_time": "2024-10-28", "title": "Graph Based Traffic Analysis and Delay Prediction", "paper_summary": "This research is focused on traffic congestion in the small island of Malta\nwhich is the most densely populated country in the EU with about 1,672\ninhabitants per square kilometre (4,331 inhabitants/sq mi). Furthermore, Malta\nhas a rapid vehicle growth. Based on our research, the number of vehicles\nincreased by around 11,000 in a little more than 6 months, which shows how\nimportant it is to have an accurate and comprehensive means of collecting data\nto tackle the issue of fluctuating traffic in Malta. In this paper, we first\npresent the newly built comprehensive traffic dataset, called MalTra. This\ndataset includes realistic trips made by members of the public across the\nisland over a period of 200 days. We then describe the methodology we adopted\nto generate syntactic data to complete our data set as much as possible. In our\nresearch, we consider both MalTra and the Q-Traffic dataset, which has been\nused in several other research studies. The statistical ARIMA model and two\ngraph neural networks, the spatial temporal graph convolutional network (STGCN)\nand the diffusion convolutional recurrent network (DCRNN) were used to analyse\nand compare the results with existing research. From the evaluation, we found\nthat the DCRNN model outperforms the STGCN with the former resulting in MAE of\n3.98 (6.65 in the case of the latter) and a RMSE of 7.78 (against 12.73 of the\nlatter).", "paper_summary_zh": "本研究著重於馬爾他這個小島的交通壅塞問題，馬爾他為歐盟人口最密集的國家，每平方公里約有 1,672 名居民（每平方英里 4,331 名居民）。此外，馬爾他的車輛成長快速。根據我們的研究，車輛數量在短短 6 個多月內增加了約 11,000 輛，這顯示出擁有準確且全面的資料收集方式對於解決馬爾他交通波動問題有多麼重要。在本文中，我們首先提出新建立的全面交通資料集，稱為 MalTra。此資料集包括 200 天內公眾在島上進行的實際行程。然後，我們說明我們採用的方法來產生句法資料，以盡可能地完成我們的資料集。在我們的研究中，我們同時考慮了 MalTra 和 Q-Traffic 資料集，後者已用於其他多項研究。統計 ARIMA 模型和兩個圖神經網路，空間時間圖形卷積網路 (STGCN) 和擴散卷積遞迴網路 (DCRNN) 用於分析並將結果與現有研究進行比較。從評估中，我們發現 DCRNN 模型優於 STGCN，前者的 MAE 為 3.98（後者為 6.65），RMSE 為 7.78（後者為 12.73）。", "author": "Gabriele Borg et.al.", "authors": "Gabriele Borg, Charlie Abela", "id": "2410.21028v1", "paper_url": "http://arxiv.org/abs/2410.21028v1", "repo": "null"}}