{"2407.02004": {"publish_time": "2024-07-02", "title": "SAVE: Segment Audio-Visual Easy way using Segment Anything Model", "paper_summary": "The primary aim of Audio-Visual Segmentation (AVS) is to precisely identify\nand locate auditory elements within visual scenes by accurately predicting\nsegmentation masks at the pixel level. Achieving this involves comprehensively\nconsidering data and model aspects to address this task effectively. This study\npresents a lightweight approach, SAVE, which efficiently adapts the pre-trained\nsegment anything model (SAM) to the AVS task. By incorporating an image encoder\nadapter into the transformer blocks to better capture the distinct dataset\ninformation and proposing a residual audio encoder adapter to encode the audio\nfeatures as a sparse prompt, our proposed model achieves effective audio-visual\nfusion and interaction during the encoding stage. Our proposed method\naccelerates the training and inference speed by reducing the input resolution\nfrom 1024 to 256 pixels while achieving higher performance compared with the\nprevious SOTA. Extensive experimentation validates our approach, demonstrating\nthat our proposed model outperforms other SOTA methods significantly. Moreover,\nleveraging the pre-trained model on synthetic data enhances performance on real\nAVSBench data, achieving 84.59 mIoU on the S4 (V1S) subset and 70.28 mIoU on\nthe MS3 (V1M) set with only 256 pixels for input images. This increases up to\n86.16 mIoU on the S4 (V1S) and 70.83 mIoU on the MS3 (V1M) with inputs of 1024\npixels.", "paper_summary_zh": "視覺-聽覺分割 (AVS) 的主要目標是透過精準預測像素層級的分割遮罩，精準識別並定位視覺場景中的聽覺元素。為了有效處理這項任務，需要全面考量資料和模型面向。本研究提出一個輕量級方法 SAVE，它能有效地將預先訓練好的任何模型區段 (SAM) 調整至 AVS 任務。透過將影像編碼器轉接器納入Transformer區塊，以更好地擷取不同的資料集資訊，並提出一個殘差音訊編碼器轉接器，將音訊特徵編碼為一個稀疏提示，我們提出的模型在編碼階段實現了有效的視覺-聽覺融合和互動。我們提出的方法透過將輸入解析度從 1024 降至 256 像素來加速訓練和推論速度，同時與先前的 SOTA 相比，達到了更高的效能。廣泛的實驗驗證了我們的方法，證明我們提出的模型顯著優於其他 SOTA 方法。此外，在合成資料上利用預先訓練好的模型，可以提升在真實 AVSBench 資料上的效能，在 S4 (V1S) 子集中達到 84.59 mIoU，在 MS3 (V1M) 集合中達到 70.28 mIoU，輸入影像僅有 256 像素。使用 1024 像素的輸入，在 S4 (V1S) 上增加到 86.16 mIoU，在 MS3 (V1M) 上增加到 70.83 mIoU。", "author": "Khanh-Binh Nguyen et.al.", "authors": "Khanh-Binh Nguyen, Chae Jung Park", "id": "2407.02004v1", "paper_url": "http://arxiv.org/abs/2407.02004v1", "repo": "null"}}