{"2412.11974": {"publish_time": "2024-12-16", "title": "Emma-X: An Embodied Multimodal Action Model with Grounded Chain of Thought and Look-ahead Spatial Reasoning", "paper_summary": "Traditional reinforcement learning-based robotic control methods are often\ntask-specific and fail to generalize across diverse environments or unseen\nobjects and instructions. Visual Language Models (VLMs) demonstrate strong\nscene understanding and planning capabilities but lack the ability to generate\nactionable policies tailored to specific robotic embodiments. To address this,\nVisual-Language-Action (VLA) models have emerged, yet they face challenges in\nlong-horizon spatial reasoning and grounded task planning. In this work, we\npropose the Embodied Multimodal Action Model with Grounded Chain of Thought and\nLook-ahead Spatial Reasoning, Emma-X. Emma-X leverages our constructed\nhierarchical embodiment dataset based on BridgeV2, containing 60,000 robot\nmanipulation trajectories auto-annotated with grounded task reasoning and\nspatial guidance. Additionally, we introduce a trajectory segmentation strategy\nbased on gripper states and motion trajectories, which can help mitigate\nhallucination in grounding subtask reasoning generation. Experimental results\ndemonstrate that Emma-X achieves superior performance over competitive\nbaselines, particularly in real-world robotic tasks requiring spatial\nreasoning.", "paper_summary_zh": "傳統的強化學習機器人控制方法通常是特定於任務的，並且無法推廣到不同的環境或不可見的物體和指令。視覺語言模型 (VLM) 展示了強大的場景理解和規劃能力，但缺乏生成針對特定機器人具體實例的可行策略的能力。為了解決這個問題，視覺語言動作 (VLA) 模型應運而生，但它們在長時域空間推理和基礎任務規劃中面臨挑戰。在這項工作中，我們提出了具有基礎思想鏈和前瞻性空間推理的具體多模態動作模型 Emma-X。Emma-X 利用我們基於 BridgeV2 構建的分層具體化數據集，其中包含 60,000 個機器人操作軌跡，並使用基礎任務推理和空間指導進行自動註解。此外，我們引入了一種基於夾持器狀態和運動軌跡的軌跡分段策略，這有助於減輕基礎子任務推理生成中的幻覺。實驗結果表明，Emma-X 在競爭基準上取得了優異的性能，特別是在需要空間推理的現實世界機器人任務中。", "author": "Qi Sun et.al.", "authors": "Qi Sun, Pengfei Hong, Tej Deep Pala, Vernon Toh, U-Xuan Tan, Deepanway Ghosal, Soujanya Poria", "id": "2412.11974v1", "paper_url": "http://arxiv.org/abs/2412.11974v1", "repo": "https://github.com/declare-lab/emma-x"}}