{"2412.03904": {"publish_time": "2024-12-05", "title": "MISR: Measuring Instrumental Self-Reasoning in Frontier Models", "paper_summary": "We propose a suite of tasks to evaluate the instrumental self-reasoning\nability of large language model (LLM) agents. Instrumental self-reasoning\nability could improve adaptability and enable self-modification, but it could\nalso pose significant risks, such as enabling deceptive alignment. Prior work\nhas only evaluated self-reasoning in non-agentic settings or in limited\ndomains. In this paper, we propose evaluations for instrumental self-reasoning\nability in agentic tasks in a wide range of scenarios, including\nself-modification, knowledge seeking, and opaque self-reasoning. We evaluate\nagents built using state-of-the-art LLMs, including commercial and open source\nsystems. We find that instrumental self-reasoning ability emerges only in the\nmost capable frontier models and that it is highly context-dependent. No model\npasses the the most difficult versions of our evaluations, hence our evaluation\ncan be used to measure increases in instrumental self-reasoning ability in\nfuture models. We open-source our evaluations at\nhttps://github.com/kaifronsdal/Self-Reasoning-Evals.", "paper_summary_zh": "我們提出了一系列任務，用於評估大型語言模型 (LLM) 代理的工具性自我推理能力。工具性自我推理能力可以提高適應性並實現自我修改，但它也可能帶來重大風險，例如實現欺騙性對齊。先前的研究僅在非代理設定或有限的領域中評估自我推理。在本文中，我們提出了在各種場景中對代理任務中的工具性自我推理能力進行評估，包括自我修改、知識尋求和不透明的自我推理。我們評估了使用最先進的 LLM 建構的代理，包括商業和開源系統。我們發現工具性自我推理能力僅出現在最有能力的前沿模型中，並且它高度依賴於上下文。沒有模型通過我們評估的最困難版本，因此我們的評估可用於衡量未來模型中工具性自我推理能力的提升。我們在 https://github.com/kaifronsdal/Self-Reasoning-Evals 上開放我們的評估。", "author": "Kai Fronsdal et.al.", "authors": "Kai Fronsdal, David Lindner", "id": "2412.03904v1", "paper_url": "http://arxiv.org/abs/2412.03904v1", "repo": "null"}}