{"2501.10326": {"publish_time": "2025-01-17", "title": "Large language models for automated scholarly paper review: A survey", "paper_summary": "Large language models (LLMs) have significantly impacted human society,\ninfluencing various domains. Among them, academia is not simply a domain\naffected by LLMs, but it is also the pivotal force in the development of LLMs.\nIn academic publications, this phenomenon is represented during the\nincorporation of LLMs into the peer review mechanism for reviewing manuscripts.\nWe proposed the concept of automated scholarly paper review (ASPR) in our\nprevious paper. As the incorporation grows, it now enters the coexistence phase\nof ASPR and peer review, which is described in that paper. LLMs hold\ntransformative potential for the full-scale implementation of ASPR, but they\nalso pose new issues and challenges that need to be addressed. In this survey\npaper, we aim to provide a holistic view of ASPR in the era of LLMs. We begin\nwith a survey to find out which LLMs are used to conduct ASPR. Then, we review\nwhat ASPR-related technological bottlenecks have been solved with the\nincorporation of LLM technology. After that, we move on to explore new methods,\nnew datasets, new source code, and new online systems that come with LLMs for\nASPR. Furthermore, we summarize the performance and issues of LLMs in ASPR, and\ninvestigate the attitudes and reactions of publishers and academia to ASPR.\nLastly, we discuss the challenges associated with the development of LLMs for\nASPR. We hope this survey can serve as an inspirational reference for the\nresearchers and promote the progress of ASPR for its actual implementation.", "paper_summary_zh": "大型語言模型 (LLM) 已顯著影響人類社會，影響了各個領域。其中，學術界不僅是受 LLM 影響的領域，也是 LLM 發展中的關鍵力量。在學術出版物中，這種現象在將 LLM 納入同行評審機制以審查手稿的過程中得到體現。我們在之前的論文中提出了自動學術論文審查 (ASPR) 的概念。隨著納入的增加，它現在進入了 ASPR 和同行評審的共存階段，這在該論文中有所描述。LLM 具有全面實施 ASPR 的轉型潛力，但它們也提出了需要解決的新問題和挑戰。在這篇綜述論文中，我們旨在提供 LLM 時代 ASPR 的整體觀點。我們從一項調查開始，找出哪些 LLM 被用於進行 ASPR。然後，我們回顧了哪些 ASPR 相關技術瓶頸已通過整合 LLM 技術得到解決。在那之後，我們繼續探索 ASPR 隨附的 LLM 的新方法、新數據集、新源代碼和新在線系統。此外，我們總結了 LLM 在 ASPR 中的性能和問題，並調查了出版商和學術界對 ASPR 的態度和反應。最後，我們討論了與 LLM 開發相關的挑戰，以供 ASPR 使用。我們希望這項調查可以作為研究人員的靈感參考，並促進 ASPR 的進展以實際實施。", "author": "Zhenzhen Zhuang et.al.", "authors": "Zhenzhen Zhuang, Jiandong Chen, Hongfeng Xu, Yuwen Jiang, Jialiang Lin", "id": "2501.10326v1", "paper_url": "http://arxiv.org/abs/2501.10326v1", "repo": "null"}}