{"2409.09659": {"publish_time": "2024-09-15", "title": "Leveraging Open-Source Large Language Models for Native Language Identification", "paper_summary": "Native Language Identification (NLI) - the task of identifying the native\nlanguage (L1) of a person based on their writing in the second language (L2) -\nhas applications in forensics, marketing, and second language acquisition.\nHistorically, conventional machine learning approaches that heavily rely on\nextensive feature engineering have outperformed transformer-based language\nmodels on this task. Recently, closed-source generative large language models\n(LLMs), e.g., GPT-4, have demonstrated remarkable performance on NLI in a\nzero-shot setting, including promising results in open-set classification.\nHowever, closed-source LLMs have many disadvantages, such as high costs and\nundisclosed nature of training data. This study explores the potential of using\nopen-source LLMs for NLI. Our results indicate that open-source LLMs do not\nreach the accuracy levels of closed-source LLMs when used out-of-the-box.\nHowever, when fine-tuned on labeled training data, open-source LLMs can achieve\nperformance comparable to that of commercial LLMs.", "paper_summary_zh": "母語識別 (NLI) - 根據個人以第二語言 (L2) 書寫的內容來識別其母語 (L1) 的任務 - 在法醫學、行銷和第二語言習得方面有應用。\n從歷史上看，高度依賴於廣泛特徵工程的傳統機器學習方法在此任務上優於基於轉換器的語言模型。最近，閉源生成式大語言模型 (LLM)，例如 GPT-4，在零次學習設置中展示了 NLI 的卓越性能，包括在開放集分類中取得的令人滿意的結果。\n然而，閉源 LLM 有許多缺點，例如高成本和訓練資料的未公開性質。本研究探討了使用開源 LLM 進行 NLI 的可能性。我們的結果表明，開源 LLM 在開箱即用時無法達到閉源 LLM 的準確度等級。\n然而，在標記訓練資料上進行微調時，開源 LLM 可以實現與商業 LLM 相當的性能。", "author": "Yee Man Ng et.al.", "authors": "Yee Man Ng, Ilia Markov", "id": "2409.09659v1", "paper_url": "http://arxiv.org/abs/2409.09659v1", "repo": "null"}}