{"2409.05721": {"publish_time": "2024-09-09", "title": "Referring Expression Generation in Visually Grounded Dialogue with Discourse-aware Comprehension Guiding", "paper_summary": "We propose an approach to referring expression generation (REG) in visually\ngrounded dialogue that is meant to produce referring expressions (REs) that are\nboth discriminative and discourse-appropriate. Our method constitutes a\ntwo-stage process. First, we model REG as a text- and image-conditioned\nnext-token prediction task. REs are autoregressively generated based on their\npreceding linguistic context and a visual representation of the referent.\nSecond, we propose the use of discourse-aware comprehension guiding as part of\na generate-and-rerank strategy through which candidate REs generated with our\nREG model are reranked based on their discourse-dependent discriminatory power.\nResults from our human evaluation indicate that our proposed two-stage approach\nis effective in producing discriminative REs, with higher performance in terms\nof text-image retrieval accuracy for reranked REs compared to those generated\nusing greedy decoding.", "paper_summary_zh": "我們提出一個視覺基礎對話中指稱表達生成 (REG) 的方法，旨在產生既具有區辨力又符合語篇的指稱表達 (RE)。我們的做法構成一個兩階段流程。首先，我們將 REG 建模為一個文本和影像條件化的下一個代幣預測任務。RE 會根據其先前的語言脈絡和指稱物的視覺表示自迴歸生成。其次，我們提出使用語篇感知理解引導作為生成和重新排序策略的一部分，透過該策略，使用我們的 REG 模型生成的候選 RE 會根據其語篇依賴的區辨力重新排序。我們的人員評估結果顯示，我們提出的兩階段方法在產生具有區辨力的 RE 方面有效，與使用貪婪解碼生成的 RE 相比，重新排序的 RE 在文本影像檢索準確度方面具有較高的效能。", "author": "Bram Willemsen et.al.", "authors": "Bram Willemsen, Gabriel Skantze", "id": "2409.05721v1", "paper_url": "http://arxiv.org/abs/2409.05721v1", "repo": "null"}}