{"2501.18310": {"publish_time": "2025-01-30", "title": "Efficient Neural Theorem Proving via Fine-grained Proof Structure Analysis", "paper_summary": "The synergy between deep learning models and traditional automation tools\nplays a pivotal role in developing robust neural theorem provers (NTPs).\nHowever, for proof synthesis with LLMs, previous work applies automation tools\neither only when the model explicitly calls the method, or only at a single\ngranularity level, failing to fully exploit the power of built-in tactics and\noff-the-shelf automated theorem provers. In this work, we propose ProofAug, a\nnovel theorem proving method that enjoys superior sample efficiency through\nequipping proof-generation LLMs with automation methods in different\ngranularities via fine-grained structure analysis of model-generated proof\nproposals. Furthermore, ProofAug serves as a versatile plug-and-play module\nthat seamlessly integrates with any tree-search algorithm, enabling our\nconstruction of an efficient recursive proving (ERP) module to further enhance\nperformance. The superiority of our method is validated on the miniF2F-test\nbenchmark using the open-source deepseek-math-7b-base model and the Isabelle\nproof assistant. Notably, by additionally employing a mixed prompting strategy,\nwe achieve a cumulative pass rate of 66.0% after curation of the dataset (61.9%\nfor the original version), setting a new SOTA across all proof languages with a\ntotal sample budget of only 2100. Our code is available at\nhttps://github.com/haoxiongliu/ProofAug.", "paper_summary_zh": "深度學習模型與傳統自動化工具之間的綜效，在開發強大的神經定理證明器 (NTP) 中扮演著關鍵角色。然而，對於使用 LLM 的證明合成，先前的研究只在模型明確呼叫方法時應用自動化工具，或只在單一粒度層級應用，無法充分利用內建策略和現成的自動化定理證明器的能力。在這項研究中，我們提出 ProofAug，一種創新的定理證明方法，透過對模型產生的證明提案進行細粒度結構分析，以不同粒度為生成證明的 LLM 配備自動化方法，享受優異的樣本效率。此外，ProofAug 可作為一個多功能的即插即用模組，無縫整合到任何樹狀搜尋演算法中，讓我們能夠建構一個高效的遞迴證明 (ERP) 模組，進一步提升效能。我們的方法的優越性已在使用開放原始碼 deepseek-math-7b-base 模型和 Isabelle 證明輔助工具的 miniF2F 測試基準上獲得驗證。特別是，透過額外採用混合提示策略，我們在整理資料集後達成了 66.0% 的累積通過率（原始版本為 61.9%），在所有證明語言中設定了一個新的 SOTA，總樣本預算僅為 2100。我們的程式碼可在 https://github.com/haoxiongliu/ProofAug 取得。", "author": "Haoxiong Liu et.al.", "authors": "Haoxiong Liu, Jiacheng Sun, Zhenguo Li, Andrew C Yao", "id": "2501.18310v1", "paper_url": "http://arxiv.org/abs/2501.18310v1", "repo": "https://github.com/haoxiongliu/proofaug"}}