{"2409.03512": {"publish_time": "2024-09-05", "title": "From MOOC to MAIC: Reshaping Online Teaching and Learning through LLM-driven Agents", "paper_summary": "Since the first instances of online education, where courses were uploaded to\naccessible and shared online platforms, this form of scaling the dissemination\nof human knowledge to reach a broader audience has sparked extensive discussion\nand widespread adoption. Recognizing that personalized learning still holds\nsignificant potential for improvement, new AI technologies have been\ncontinuously integrated into this learning format, resulting in a variety of\neducational AI applications such as educational recommendation and intelligent\ntutoring. The emergence of intelligence in large language models (LLMs) has\nallowed for these educational enhancements to be built upon a unified\nfoundational model, enabling deeper integration. In this context, we propose\nMAIC (Massive AI-empowered Course), a new form of online education that\nleverages LLM-driven multi-agent systems to construct an AI-augmented\nclassroom, balancing scalability with adaptivity. Beyond exploring the\nconceptual framework and technical innovations, we conduct preliminary\nexperiments at Tsinghua University, one of China's leading universities.\nDrawing from over 100,000 learning records of more than 500 students, we obtain\na series of valuable observations and initial analyses. This project will\ncontinue to evolve, ultimately aiming to establish a comprehensive open\nplatform that supports and unifies research, technology, and applications in\nexploring the possibilities of online education in the era of large model AI.\nWe envision this platform as a collaborative hub, bringing together educators,\nresearchers, and innovators to collectively explore the future of AI-driven\nonline education.", "paper_summary_zh": "<paragraph>自線上教育首次出現，課程上傳至可存取且共用的線上平台以來，這種擴展人類知識傳播以接觸更廣泛受眾的形式，已引發廣泛討論並被廣泛採用。認知到個人化學習仍具有顯著的改善潛力，新的 AI 技術已持續整合到這種學習格式中，產生了各種教育 AI 應用程式，例如教育建議和智慧型家教。大型語言模型 (LLM) 中出現的智慧，已允許這些教育增強功能建立在統一的基礎模型上，實現更深入的整合。在此背景下，我們提出 MAIC（大規模 AI 驅動課程），一種新的線上教育形式，利用 LLM 驅動的多重代理系統來建構 AI 增強型教室，在可擴充性與適應性之間取得平衡。除了探討概念架構和技術創新之外，我們還在中國頂尖大學之一的清華大學進行初步實驗。從 500 多名學生的 10 萬多筆學習記錄中，我們獲得一系列有價值的觀察和初步分析。此專案將持續演進，最終目標是建立一個全面的開放平台，支援並統一研究、技術和應用程式，以探索大型模型 AI 時代線上教育的可能性。我們將這個平台視為一個協作中心，匯集教育工作者、研究人員和創新者，共同探索 AI 驅動線上教育的未來。</paragraph>", "author": "Jifan Yu et.al.", "authors": "Jifan Yu, Zheyuan Zhang, Daniel Zhang-li, Shangqing Tu, Zhanxin Hao, Rui Miao Li, Haoxuan Li, Yuanchun Wang, Hanming Li, Linlu Gong, Jie Cao, Jiayin Lin, Jinchang Zhou, Fei Qin, Haohua Wang, Jianxiao Jiang, Lijun Deng, Yisi Zhan, Chaojun Xiao, Xusheng Dai, Xuan Yan, Nianyi Lin, Nan Zhang, Ruixin Ni, Yang Dang, Lei Hou, Yu Zhang, Xu Han, Manli Li, Juanzi Li, Zhiyuan Liu, Huiqin Liu, Maosong Sun", "id": "2409.03512v1", "paper_url": "http://arxiv.org/abs/2409.03512v1", "repo": "null"}}