{"2412.04937": {"publish_time": "2024-12-06", "title": "Who Speaks Next? Multi-party AI Discussion Leveraging the Systematics of Turn-taking in Murder Mystery Games", "paper_summary": "Multi-agent systems utilizing large language models (LLMs) have shown great\npromise in achieving natural dialogue. However, smooth dialogue control and\nautonomous decision making among agents still remain challenges. In this study,\nwe focus on conversational norms such as adjacency pairs and turn-taking found\nin conversation analysis and propose a new framework called \"Murder Mystery\nAgents\" that applies these norms to AI agents' dialogue control. As an\nevaluation target, we employed the \"Murder Mystery\" game, a reasoning-type\ntable-top role-playing game that requires complex social reasoning and\ninformation manipulation. In this game, players need to unravel the truth of\nthe case based on fragmentary information through cooperation and bargaining.\nThe proposed framework integrates next speaker selection based on adjacency\npairs and a self-selection mechanism that takes agents' internal states into\naccount to achieve more natural and strategic dialogue. To verify the\neffectiveness of this new approach, we analyzed utterances that led to dialogue\nbreakdowns and conducted automatic evaluation using LLMs, as well as human\nevaluation using evaluation criteria developed for the Murder Mystery game.\nExperimental results showed that the implementation of the next speaker\nselection mechanism significantly reduced dialogue breakdowns and improved the\nability of agents to share information and perform logical reasoning. The\nresults of this study demonstrate that the systematics of turn-taking in human\nconversation are also effective in controlling dialogue among AI agents, and\nprovide design guidelines for more advanced multi-agent dialogue systems.", "paper_summary_zh": "利用大型語言模型 (LLM) 的多主體系統在實現自然對話方面展現了極佳的潛力。然而，流暢的對話控制和主體間的自主決策仍是挑戰。在本研究中，我們專注於對話分析中發現的鄰接對和輪流發言等對話規範，並提出一個名為「謀殺謎團主體」的新架構，將這些規範應用於 AI 主體的對話控制。作為評量目標，我們採用「謀殺謎團」遊戲，這是一款推理型桌上角色扮演遊戲，需要複雜的社會推理和資訊操縱。在這個遊戲中，玩家需要透過合作和協商，根據片斷資訊解開案件的真相。所提出的架構整合了基於鄰接對的下一個發言者選擇，以及考量主體內部狀態的自我選擇機制，以實現更自然且具策略性的對話。為了驗證這個新方法的有效性，我們分析了導致對話中斷的發話，並使用 LLM 進行自動評量，以及使用為謀殺謎團遊戲開發的評量標準進行人工評量。實驗結果顯示，實施下一個發言者選擇機制顯著減少了對話中斷，並提升了主體分享資訊和進行邏輯推理的能力。本研究結果證明，人類對話中輪流發言的系統性在控制 AI 主體間的對話方面也同樣有效，並為更先進的多主體對話系統提供了設計方針。", "author": "Ryota Nonomura et.al.", "authors": "Ryota Nonomura, Hiroki Mori", "id": "2412.04937v1", "paper_url": "http://arxiv.org/abs/2412.04937v1", "repo": "null"}}