{"2502.03627": {"publish_time": "2025-02-05", "title": "Sorting the Babble in Babel: Assessing the Performance of Language Detection Algorithms on the OpenAlex Database", "paper_summary": "Following a recent study on the quality of OpenAlex linguistic metadata\n(C\\'espedes et al., 2025), the present paper aims to optimize the latter\nthrough the design, use, and evaluation of various linguistic classification\nprocedures based on the latest and most efficient automatic language detection\nalgorithms. Starting from a multilingual set of manually-annotated samples of\narticles indexed in the database, different classification procedures are then\ndesigned, based on the application of a set of language detection algorithms on\na series of corpora generated from different combinations of textual metadata\nof indexed articles. At sample level first, the performance of these different\nprocedures for each of the main languages in the database is evaluated in terms\nof precision, recall, and processing time. Then, overall procedure performance\nis estimated at the database level by means of a probabilistic simulation of\nharmonically aggregated and weighted scores. Results show that procedure\nperformance strongly depends on the importance given to each of the measures\nimplemented: for contexts where precision is preferred, using the LangID\nalgorithm on article titles, abstracts as well as journal names gives the best\nresults; however, for all cases where recall is considered at least slightly\nmore important than precision or as soon as processing times are given any kind\nof consideration, use of the FastSpell algorithm on article titles only\noutperforms all other alternatives. Given the lack of truly multilingual,\nlarge-scale bibliographic databases, it is hoped that these results help\nconfirm and foster the unparalleled potential of the OpenAlex database for\ncross-linguistic, bibliometric-based research and analysis.", "paper_summary_zh": "<paragraph>根據 OpenAlex 語言元資料品質的最新研究 (C\\'espedes 等人，2025)，本文旨在透過設計、使用和評估各種語言分類程序，以及根據最新且最有效率的自動語言偵測演算法，來最佳化後者。從資料庫中索引的文章手動標註的多語言範例開始，接著設計不同的分類程序，根據一系列語料庫應用一組語言偵測演算法，這些語料庫是由索引文章的文字元資料的不同組合產生。首先在範例層級，評估這些不同程序在資料庫中每種主要語言的效能，包括準確度、召回率和處理時間。接著，透過對調和彙總和加權分數進行機率模擬，估計在資料庫層級的整體程序效能。結果顯示，程序效能高度仰賴所實施的每個指標所賦予的重要性：在優先考慮準確度的脈絡中，對文章標題、摘要和期刊名稱使用 LangID 演算法會產生最佳結果；然而，在所有召回率被認為至少比準確度稍重要，或在任何考量處理時間的情況下，僅對文章標題使用 FastSpell 演算法會優於所有其他替代方案。由於缺乏真正多語言、大規模的書目資料庫，我們希望這些結果有助於確認和促進 OpenAlex 資料庫在跨語言、以書目計量為基礎的研究和分析方面的無與倫比潛力。</paragraph>", "author": "Maxime Holmberg Sainte-Marie et.al.", "authors": "Maxime Holmberg Sainte-Marie, Diego Kozlowski, Lucía Céspedes, Vincent Larivière", "id": "2502.03627v1", "paper_url": "http://arxiv.org/abs/2502.03627v1", "repo": "null"}}