{"2405.10517": {"publish_time": "2024-05-17", "title": "Towards Better Question Generation in QA-Based Event Extraction", "paper_summary": "Event Extraction (EE) is an essential information extraction task that aims\nto extract event-related information from unstructured texts. The paradigm of\nthis task has shifted from conventional classification-based methods to more\ncontemporary question-answering (QA)-based approaches. However, in QA-based EE,\nthe questions' quality dramatically affects the extraction accuracy, and how to\ngenerate high-quality questions for QA-based EE still remains a challenge. In\nthis work, to tackle this challenge, we suggest four criteria to evaluate the\nquality of a question and propose a reinforcement learning method for QA-Based\nEE that can generate fluent, generalizable, and context-dependent questions and\nprovides clear guidance to QA models. The extensive experiments conducted on\nACE and RAMS datasets have strongly validated our approach's effectiveness,\nwhich also demonstrates its robustness in scenarios with limited training data.", "paper_summary_zh": "事件萃取 (EE) 是項重要的資訊萃取任務，旨在從非結構化文字中擷取與事件相關的資訊。此任務的典範已從傳統的基於分類的方法轉變為更現代的基於問答 (QA) 的方法。然而，在基於 QA 的 EE 中，問題的品質會大幅影響萃取的準確度，而如何為基於 QA 的 EE 產生高品質的問題仍然是一項挑戰。在這項工作中，為了應對此挑戰，我們建議四項準則來評估問題的品質，並提出一個基於 QA 的 EE 的強化學習方法，該方法可以產生流暢、可概括且依賴於脈絡的問題，並為 QA 模型提供明確的指導。在 ACE 和 RAMS 資料集上進行的廣泛實驗強烈驗證了我們方法的有效性，這也證明了它在訓練資料有限的情況下的穩健性。", "author": "Zijin Hong et.al.", "authors": "Zijin Hong, Jian Liu", "id": "2405.10517v1", "paper_url": "http://arxiv.org/abs/2405.10517v1", "repo": "null"}}