{"2411.08182": {"publish_time": "2024-11-12", "title": "SCORE: Syntactic Code Representations for Static Script Malware Detection", "paper_summary": "As businesses increasingly adopt cloud technologies, they also need to be\naware of new security challenges, such as server-side script attacks, to ensure\nthe integrity of their systems and data. These scripts can steal data,\ncompromise credentials, and disrupt operations. Unlike executables with\nstandardized formats (e.g., ELF, PE), scripts are plaintext files with diverse\nsyntax, making them harder to detect using traditional methods. As a result,\nmore sophisticated approaches are needed to protect cloud infrastructures from\nthese evolving threats. In this paper, we propose novel feature extraction and\ndeep learning (DL)-based approaches for static script malware detection,\ntargeting server-side threats. We extract features from plain-text code using\ntwo techniques: syntactic code highlighting (SCH) and abstract syntax tree\n(AST) construction. SCH leverages complex regexes to parse syntactic elements\nof code, such as keywords, variable names, etc. ASTs generate a hierarchical\nrepresentation of a program's syntactic structure. We then propose a sequential\nand a graph-based model that exploits these feature representations to detect\nscript malware. We evaluate our approach on more than 400K server-side scripts\nin Bash, Python and Perl. We use a balanced dataset of 90K scripts for\ntraining, validation, and testing, with the remaining from 400K reserved for\nfurther analysis. Experiments show that our method achieves a true positive\nrate (TPR) up to 81% higher than leading signature-based antivirus solutions,\nwhile maintaining a low false positive rate (FPR) of 0.17%. Moreover, our\napproach outperforms various neural network-based detectors, demonstrating its\neffectiveness in learning code maliciousness for accurate detection of script\nmalware.", "paper_summary_zh": "<paragraph>隨著企業日益採用雲端技術，他們也需要意識到新的安全挑戰，例如伺服器端腳本攻擊，以確保其系統和資料的完整性。這些腳本可以竊取資料、危害憑證並中斷作業。與具有標準化格式的可執行檔（例如 ELF、PE）不同，腳本是具有不同語法的純文字檔案，這使得它們更難使用傳統方法進行偵測。因此，需要更精密的技術來保護雲端基礎設施免於這些不斷演變的威脅。在本文中，我們提出新穎的特徵萃取和基於深度學習 (DL) 的方法，用於靜態腳本惡意軟體偵測，鎖定伺服器端威脅。我們使用兩種技術從純文字程式碼中萃取特徵：語法程式碼突顯 (SCH) 和抽象語法樹 (AST) 建構。SCH 利用複雜的正規表示式來解析程式碼的語法元素，例如關鍵字、變數名稱等。AST 產生程式的語法結構的階層式表示。然後，我們提出一個序列和一個基於圖形的模型，利用這些特徵表示來偵測腳本惡意軟體。我們針對超過 40 萬個 Bash、Python 和 Perl 中的伺服器端腳本評估我們的技術。我們使用一個平衡的 9 萬個腳本資料集進行訓練、驗證和測試，其餘 40 萬個保留作進一步分析。實驗表明，我們的技術比領先的基於簽章的防毒軟體解決方案高出 81% 的真正陽性率 (TPR)，同時將誤報率 (FPR) 維持在 0.17% 的低水準。此外，我們的技術優於各種基於神經網路的偵測器，證明其在學習程式碼惡意性以準確偵測腳本惡意軟體方面的有效性。</paragraph>", "author": "Ecenaz Erdemir et.al.", "authors": "Ecenaz Erdemir, Kyuhong Park, Michael J. Morais, Vianne R. Gao, Marion Marschalek, Yi Fan", "id": "2411.08182v1", "paper_url": "http://arxiv.org/abs/2411.08182v1", "repo": "null"}}