{"2407.11245": {"publish_time": "2024-07-15", "title": "Pacer and Runner: Cooperative Learning Framework between Single- and Cross-Domain Sequential Recommendation", "paper_summary": "Cross-Domain Sequential Recommendation (CDSR) improves recommendation\nperformance by utilizing information from multiple domains, which contrasts\nwith Single-Domain Sequential Recommendation (SDSR) that relies on a historical\ninteraction within a specific domain. However, CDSR may underperform compared\nto the SDSR approach in certain domains due to negative transfer, which occurs\nwhen there is a lack of relation between domains or different levels of data\nsparsity. To address the issue of negative transfer, our proposed CDSR model\nestimates the degree of negative transfer of each domain and adaptively assigns\nit as a weight factor to the prediction loss, to control gradient flows through\ndomains with significant negative transfer. To this end, our model compares the\nperformance of a model trained on multiple domains (CDSR) with a model trained\nsolely on the specific domain (SDSR) to evaluate the negative transfer of each\ndomain using our asymmetric cooperative network. In addition, to facilitate the\ntransfer of valuable cues between the SDSR and CDSR tasks, we developed an\nauxiliary loss that maximizes the mutual information between the representation\npairs from both tasks on a per-domain basis. This cooperative learning between\nSDSR and CDSR tasks is similar to the collaborative dynamics between pacers and\nrunners in a marathon. Our model outperformed numerous previous works in\nextensive experiments on two real-world industrial datasets across ten service\ndomains. We also have deployed our model in the recommendation system of our\npersonal assistant app service, resulting in 21.4% increase in click-through\nrate compared to existing models, which is valuable to real-world business.", "paper_summary_zh": "跨網域序列推薦 (CDSR) 透過利用多個網域中的資訊來提升推薦效能，這與依賴特定網域內歷史互動的單一網域序列推薦 (SDSR) 形成對比。然而，由於負面轉移，CDSR 在某些網域中可能表現不如 SDSR 方法，負面轉移發生在網域之間缺乏關聯或資料稀疏程度不同時。為了解決負面轉移的問題，我們提出的 CDSR 模型會估計每個網域的負面轉移程度，並將其自適應地指定為預測損失的權重因子，以控制透過具有顯著負面轉移的網域的梯度流。為此，我們的模型會比較在多個網域 (CDSR) 上訓練的模型與僅在特定網域 (SDSR) 上訓練的模型的效能，以使用我們的非對稱協作網路評估每個網域的負面轉移。此外，為了促進 SDSR 和 CDSR 任務之間有價值線索的轉移，我們開發了一個輔助損失，以最大化來自兩個任務的表示對在每個網域基礎上的互惠資訊。SDSR 和 CDSR 任務之間的這種協作學習類似於馬拉松比賽中配速員和跑者之間的協作動態。我們的模型在兩個真實世界產業資料集中的十個服務網域中，在廣泛的實驗中表現優於許多先前的作品。我們也已將我們的模型部署在我們的個人助理應用程式服務的推薦系統中，與現有模型相比，點擊率增加了 21.4%，這對於真實世界的業務來說是有價值的。", "author": "Chung Park et.al.", "authors": "Chung Park, Taesan Kim, Hyungjun Yoon, Junui Hong, Yelim Yu, Mincheol Cho, Minsung Choi, Jaegul Choo", "id": "2407.11245v1", "paper_url": "http://arxiv.org/abs/2407.11245v1", "repo": "https://github.com/cpark88/syncrec"}}