{"2410.02603": {"publish_time": "2024-10-03", "title": "Agents' Room: Narrative Generation through Multi-step Collaboration", "paper_summary": "Writing compelling fiction is a multifaceted process combining elements such\nas crafting a plot, developing interesting characters, and using evocative\nlanguage. While large language models (LLMs) show promise for story writing,\nthey currently rely heavily on intricate prompting, which limits their use. We\npropose Agents' Room, a generation framework inspired by narrative theory, that\ndecomposes narrative writing into subtasks tackled by specialized agents. To\nillustrate our method, we introduce Tell Me A Story, a high-quality dataset of\ncomplex writing prompts and human-written stories, and a novel evaluation\nframework designed specifically for assessing long narratives. We show that\nAgents' Room generates stories that are preferred by expert evaluators over\nthose produced by baseline systems by leveraging collaboration and\nspecialization to decompose the complex story writing task into tractable\ncomponents. We provide extensive analysis with automated and human-based\nmetrics of the generated output.", "paper_summary_zh": "撰寫引人入勝的小說是一個多方面的過程，結合了諸如構思情節、塑造有趣角色和使用引人注目的語言等元素。儘管大型語言模型 (LLM) 在故事寫作方面顯示出前景，但它們目前嚴重依賴於複雜的提示，這限制了它們的使用。我們提出受敘事理論啟發的生成框架「Agents' Room」，它將敘事寫作分解為由專業代理人處理的子任務。為了說明我們的做法，我們引入了 Tell Me A Story，這是一個由複雜寫作提示和人工撰寫的故事組成的優質資料集，以及一個專門用於評估長篇敘事的創新評估框架。我們展示了「Agents' Room」產生的故事比基線系統產生的故事更受專家評估員的青睞，因為它利用協作和專業化將複雜的故事寫作任務分解為易於處理的組成部分。我們提供了對生成輸出的自動化和基於人類的指標的廣泛分析。", "author": "Fantine Huot et.al.", "authors": "Fantine Huot, Reinald Kim Amplayo, Jennimaria Palomaki, Alice Shoshana Jakobovits, Elizabeth Clark, Mirella Lapata", "id": "2410.02603v1", "paper_url": "http://arxiv.org/abs/2410.02603v1", "repo": "https://github.com/google-deepmind/tell-me-a-story"}}