{"2405.15134": {"publish_time": "2024-05-24", "title": "Efficient Biomedical Entity Linking: Clinical Text Standardization with Low-Resource Techniques", "paper_summary": "Clinical text is rich in information, with mentions of treatment, medication\nand anatomy among many other clinical terms. Multiple terms can refer to the\nsame core concepts which can be referred as a clinical entity. Ontologies like\nthe Unified Medical Language System (UMLS) are developed and maintained to\nstore millions of clinical entities including the definitions, relations and\nother corresponding information. These ontologies are used for standardization\nof clinical text by normalizing varying surface forms of a clinical term\nthrough Biomedical entity linking. With the introduction of transformer-based\nlanguage models, there has been significant progress in Biomedical entity\nlinking. In this work, we focus on learning through synonym pairs associated\nwith the entities. As compared to the existing approaches, our approach\nsignificantly reduces the training data and resource consumption. Moreover, we\npropose a suite of context-based and context-less reranking techniques for\nperforming the entity disambiguation. Overall, we achieve similar performance\nto the state-of-the-art zero-shot and distant supervised entity linking\ntechniques on the Medmentions dataset, the largest annotated dataset on UMLS,\nwithout any domain-based training. Finally, we show that retrieval performance\nalone might not be sufficient as an evaluation metric and introduce an article\nlevel quantitative and qualitative analysis to reveal further insights on the\nperformance of entity linking methods.", "paper_summary_zh": "臨床文本資訊豐富，其中包含治療、藥物和解剖學等許多其他臨床術語。多個術語可以指涉同一個核心概念，可以稱之為臨床實體。像統一醫學語言系統 (UMLS) 等本体論的開發和維護，是用於儲存數百萬個臨床實體，包括定義、關係和其他對應資訊。這些本体論用於通過生物醫學實體連結，對臨床文本進行標準化，以標準化臨床術語的不同表面形式。隨著基於轉換器的語言模型的引入，生物醫學實體連結方面取得了重大進展。在這項工作中，我們專注於通過與實體關聯的同義詞對進行學習。與現有方法相比，我們的做法顯著減少了訓練資料和資源消耗。此外，我們提出了一套基於上下文和無上下文的重新排序技術，用於執行實體消歧。總的來說，我們在 Medmentions 資料集（UMLS 上最大的註釋資料集）上實現了與最先進的零次學習和遠程監督實體連結技術相似的效能，而無需任何基於領域的訓練。最後，我們表明，檢索效能本身可能不足以作為評估指標，並引入文章層級的量化和定性分析，以揭示實體連結方法效能的進一步見解。", "author": "Akshit Achara et.al.", "authors": "Akshit Achara, Sanand Sasidharan, Gagan N", "id": "2405.15134v1", "paper_url": "http://arxiv.org/abs/2405.15134v1", "repo": "null"}}