{"2412.20299": {"publish_time": "2024-12-28", "title": "No Preference Left Behind: Group Distributional Preference Optimization", "paper_summary": "Preferences within a group of people are not uniform but follow a\ndistribution. While existing alignment methods like Direct Preference\nOptimization (DPO) attempt to steer models to reflect human preferences, they\nstruggle to capture the distributional pluralistic preferences within a group.\nThese methods often skew toward dominant preferences, overlooking the diversity\nof opinions, especially when conflicting preferences arise. To address this\nissue, we propose Group Distribution Preference Optimization (GDPO), a novel\nframework that aligns language models with the distribution of preferences\nwithin a group by incorporating the concept of beliefs that shape individual\npreferences. GDPO calibrates a language model using statistical estimation of\nthe group's belief distribution and aligns the model with belief-conditioned\npreferences, offering a more inclusive alignment framework than traditional\nmethods. In experiments using both synthetic controllable opinion generation\nand real-world movie review datasets, we show that DPO fails to align with the\ntargeted belief distributions, while GDPO consistently reduces this alignment\ngap during training. Moreover, our evaluation metrics demonstrate that GDPO\noutperforms existing approaches in aligning with group distributional\npreferences, marking a significant advance in pluralistic alignment.", "paper_summary_zh": "群組中個人的偏好並非一致，而是遵循某種分配。現有的對齊方法（如直接偏好最佳化 (DPO)）試圖引導模型以反映人類偏好，但它們難以捕捉群組內部分配式的多元偏好。這些方法通常會偏向於主導偏好，忽略意見的多樣性，特別是在出現相互衝突的偏好時。為了解決這個問題，我們提出群組分配偏好最佳化 (GDPO)，這是一個新的架構，透過納入塑造個人偏好的信念概念，將語言模型與群組內偏好的分配對齊。GDPO 使用群組信念分配的統計估計值校準語言模型，並將模型與信念條件偏好對齊，提供比傳統方法更具包容性的對齊架構。在使用合成可控意見產生和真實電影評論資料集的實驗中，我們發現 DPO 無法與目標信念分配對齊，而 GDPO 在訓練期間持續縮小這個對齊差距。此外，我們的評估指標證明，GDPO 在與群組分配偏好對齊方面優於現有方法，標誌著多元對齊的重大進步。", "author": "Binwei Yao et.al.", "authors": "Binwei Yao, Zefan Cai, Yun-Shiuan Chuang, Shanglin Yang, Ming Jiang, Diyi Yang, Junjie Hu", "id": "2412.20299v1", "paper_url": "http://arxiv.org/abs/2412.20299v1", "repo": "null"}}