{"2501.13333": {"publish_time": "2025-01-23", "title": "AgentRec: Agent Recommendation Using Sentence Embeddings Aligned to Human Feedback", "paper_summary": "Multi-agent systems must decide which agent is the most appropriate for a\ngiven task. We propose a novel architecture for recommending which LLM agent\nout of many should perform a task given a natural language prompt by extending\nthe Sentence-BERT (SBERT) encoder model. On test data, we are able to achieve a\ntop-1 accuracy of 92.2% with each classification taking less than 300\nmilliseconds. In contrast to traditional classification methods, our\narchitecture is computationally cheap, adaptive to new classes, interpretable,\nand controllable with arbitrary metrics through reinforcement learning. By\nencoding natural language prompts into sentence embeddings, our model captures\nthe semantic content relevant to recommending an agent. The distance between\nsentence embeddings that belong to the same agent is then minimized through\nfine-tuning and aligned to human values through reinforcement learning from\nhuman feedback. This allows the classification of natural language prompts\nbased on their nearest neighbors by measuring the cosine similarity between\nembeddings. This work is made possible through the generation of a synthetic\ndataset for agent recommendation, which we have open-sourced to the public\nalong with the code for AgentRec recommendation system at\nhttps://github.com/joshprk/agentrec.", "paper_summary_zh": "多智能體系統必須決定哪個智能體最適合執行某項任務。我們提出了一種新的架構，用於推薦在給定自然語言提示的情況下，眾多 LLM 智能體中的哪一個應該執行任務，方法是擴展 Sentence-BERT (SBERT) 編碼器模型。在測試數據上，我們能夠實現 92.2% 的前 1 名準確率，每次分類花費不到 300 毫秒。與傳統分類方法相比，我們的架構在計算上成本低廉，適應新類別，可解釋，並且可通過強化學習使用任意指標進行控制。通過將自然語言提示編碼為句子嵌入，我們的模型捕獲了與推薦智能體相關的語義內容。然後，通過微調和通過人類反饋的強化學習與人類價值觀保持一致，最小化屬於同一個智能體的句子嵌入之間的距離。這允許基於它們最近的鄰居對自然語言提示進行分類，方法是測量嵌入之間的餘弦相似度。這項工作是通過生成一個用於智能體推薦的合成數據集而得以實現的，我們已將其與 AgentRec 推薦系統的代碼一起公開，網址為 https://github.com/joshprk/agentrec。", "author": "Joshua Park et.al.", "authors": "Joshua Park, Yongfeng Zhang", "id": "2501.13333v1", "paper_url": "http://arxiv.org/abs/2501.13333v1", "repo": "https://github.com/joshprk/agentrec"}}