{"2410.21842": {"publish_time": "2024-10-29", "title": "Diffusion as Reasoning: Enhancing Object Goal Navigation with LLM-Biased Diffusion Model", "paper_summary": "The Object Goal Navigation (ObjectNav) task requires the agent to navigate to\na specified target in an unseen environment. Since the environment layout is\nunknown, the agent needs to perform semantic reasoning to infer the potential\nlocation of the target, based on its accumulated memory of the environment\nduring the navigation process. Diffusion models have been shown to be able to\nlearn the distribution relationships between features in RGB images, and thus\ngenerate new realistic images.In this work, we propose a new approach to\nsolving the ObjectNav task, by training a diffusion model to learn the\nstatistical distribution patterns of objects in semantic maps, and using the\nmap of the explored regions during navigation as the condition to generate the\nmap of the unknown regions, thereby realizing the semantic reasoning of the\ntarget object, i.e., diffusion as reasoning (DAR). Meanwhile, we propose the\nglobal target bias and local LLM bias methods, where the former can constrain\nthe diffusion model to generate the target object more effectively, and the\nlatter utilizes the common sense knowledge extracted from the LLM to improve\nthe generalization of the reasoning process. Based on the generated map in the\nunknown region, the agent sets the predicted location of the target as the goal\nand moves towards it. Experiments on Gibson and MP3D show the effectiveness of\nour method.", "paper_summary_zh": "物件目標導航 (ObjectNav) 任務要求代理在未見環境中導航至指定目標。由於環境佈局未知，代理需要執行語意推理，根據其在導航過程中累積的環境記憶來推論目標的潛在位置。擴散模型已被證明能夠學習 RGB 影像中特徵之間的分布關係，並因此產生新的逼真影像。在這項工作中，我們提出了一種解決 ObjectNav 任務的新方法，透過訓練擴散模型來學習語意地圖中物件的統計分布模式，並使用導航過程中探索區域的地圖作為條件來產生未知區域的地圖，從而實現目標物件的語意推理，即擴散為推理 (DAR)。同時，我們提出了全局目標偏差和局部 LLM 偏差方法，前者可以約束擴散模型更有效地產生目標物件，而後者利用從 LLM 中提取的常識知識來改善推理過程的泛化。基於未知區域中產生的地圖，代理將目標的預測位置設定為目標，並朝向它移動。Gibson 和 MP3D 的實驗顯示了我們方法的有效性。", "author": "Yiming Ji et.al.", "authors": "Yiming Ji, Yang Liu, Zhengpu Wang, Boyu Ma, Zongwu Xie, Hong Liu", "id": "2410.21842v1", "paper_url": "http://arxiv.org/abs/2410.21842v1", "repo": "null"}}