{"2406.16611": {"publish_time": "2024-06-24", "title": "Evaluation of Language Models in the Medical Context Under Resource-Constrained Settings", "paper_summary": "Since the emergence of the Transformer architecture, language model\ndevelopment has increased, driven by their promising potential. However,\nreleasing these models into production requires properly understanding their\nbehavior, particularly in sensitive domains such as medicine. Despite this\nneed, the medical literature still lacks technical assessments of pre-trained\nlanguage models, which are especially valuable in resource-constrained settings\nin terms of computational power or limited budget. To address this gap, we\nprovide a comprehensive survey of language models in the medical domain. In\naddition, we selected a subset of these models for thorough evaluation,\nfocusing on classification and text generation tasks. Our subset encompasses 53\nmodels, ranging from 110 million to 13 billion parameters, spanning the three\nfamilies of Transformer-based models and from diverse knowledge domains. This\nstudy employs a series of approaches for text classification together with\nzero-shot prompting instead of model training or fine-tuning, which closely\nresembles the limited resource setting in which many users of language models\nfind themselves. Encouragingly, our findings reveal remarkable performance\nacross various tasks and datasets, underscoring the latent potential of certain\nmodels to contain medical knowledge, even without domain specialization.\nConsequently, our study advocates for further exploration of model applications\nin medical contexts, particularly in resource-constrained settings. The code is\navailable on https://github.com/anpoc/Language-models-in-medicine.", "paper_summary_zh": "自 Transformer 架構問世以來，語言模型在潛力備受看好下，發展如火如荼。然而，將這些模型應用於生產環境，需要適當地了解其行為，特別是在醫學等敏感領域。儘管有此需求，醫學文獻仍缺乏對預先訓練語言模型的技術評估，而這在運算能力或預算有限的資源受限環境中特別有價值。為了彌補這個缺口，我們對醫學領域的語言模型進行了全面的調查。此外，我們挑選了其中一部分模型進行徹底評估，重點在於分類和文字生成任務。我們的子集涵蓋 53 個模型，參數從 1.1 億到 130 億不等，橫跨 Transformer 為基礎的模型的三個系列，且涵蓋多元的知識領域。本研究採用一系列文字分類方法，並搭配零次提示，而非模型訓練或微調，這與許多語言模型使用者身處的資源受限環境非常類似。令人振奮的是，我們的發現顯示在各種任務和資料集上都有傑出的表現，強調了某些模型在沒有領域專業知識的情況下，蘊含醫學知識的潛力。因此，我們的研究主張進一步探討模型在醫療環境中的應用，特別是在資源受限的環境中。程式碼可在 https://github.com/anpoc/Language-models-in-medicine 取得。", "author": "Andrea Posada et.al.", "authors": "Andrea Posada, Daniel Rueckert, Felix Meissen, Philip Müller", "id": "2406.16611v1", "paper_url": "http://arxiv.org/abs/2406.16611v1", "repo": "https://github.com/anpoc/language-models-in-medicine"}}