{"2407.04678": {"publish_time": "2024-07-05", "title": "XQSV: A Structurally Variable Network to Imitate Human Play in Xiangqi", "paper_summary": "In this paper, we introduce an innovative deep learning architecture, termed\nXiangqi Structurally Variable (XQSV), designed to emulate the behavioral\npatterns of human players in Xiangqi, or Chinese Chess. The unique attribute of\nXQSV is its capacity to alter its structural configuration dynamically,\noptimizing performance for the task based on the particular subset of data on\nwhich it is trained. We have incorporated several design improvements to\nsignificantly enhance the network's predictive accuracy, including a local\nillegal move filter, an Elo range partitioning, a sequential one-dimensional\ninput, and a simulation of imperfect memory capacity. Empirical evaluations\nreveal that XQSV attains a predictive accuracy of approximately 40%, with its\nperformance peaking within the trained Elo range. This indicates the model's\nsuccess in mimicking the play behavior of individuals within that specific\nrange. A three-terminal Turing Test was employed to demonstrate that the XQSV\nmodel imitates human behavior more accurately than conventional Xiangqi\nengines, rendering it indistinguishable from actual human opponents. Given the\ninherent nondeterminism in human gameplay, we propose two supplementary relaxed\nevaluation metrics. To our knowledge, XQSV represents the first model to mimic\nXiangqi players.", "paper_summary_zh": "<paragraph>在本文中，我們介紹了一種創新的深度學習架構，稱為象棋結構變量 (XQSV)，旨在模擬象棋或中國象棋中人類玩家的行為模式。XQSV 的獨特屬性是能夠動態改變其結構配置，根據其接受訓練的特定數據子集，針對任務優化性能。我們已納入多項設計改進，以顯著提高網路的預測準確度，包括局部非法移動過濾器、Elo 範圍分區、序列一維輸入和不完美記憶容量模擬。經驗評估顯示，XQSV 達到了約 40% 的預測準確度，其性能在訓練後的 Elo 範圍內達到峰值。這表明模型在模擬該特定範圍內個體的遊戲行為方面取得了成功。採用三終端圖靈測試來證明 XQSV 模型比傳統象棋引擎更準確地模仿人類行為，使其與實際人類對手無法區分。鑑於人類遊戲中固有的非決定性，我們提出了兩個補充性的放寬評估指標。據我們所知，XQSV 是第一個模擬象棋玩家的模型。</paragraph>", "author": "Chenliang Zhou et.al.", "authors": "Chenliang Zhou", "id": "2407.04678v1", "paper_url": "http://arxiv.org/abs/2407.04678v1", "repo": "null"}}