{"2406.11624": {"publish_time": "2024-06-17", "title": "Words in Motion: Representation Engineering for Motion Forecasting", "paper_summary": "Motion forecasting transforms sequences of past movements and environment\ncontext into future motion. Recent methods rely on learned representations,\nresulting in hidden states that are difficult to interpret. In this work, we\nuse natural language to quantize motion features in a human-interpretable way,\nand measure the degree to which they are embedded in hidden states. Our\nexperiments reveal that hidden states of motion sequences are arranged with\nrespect to our discrete sets of motion features. Following these insights, we\nfit control vectors to motion features, which allow for controlling motion\nforecasts at inference. Consequently, our method enables controlling\ntransformer-based motion forecasting models with textual inputs, providing a\nunique interface to interact with and understand these models. Our\nimplementation is available at https://github.com/kit-mrt/future-motion", "paper_summary_zh": "動作預測將過去動作和環境背景序列轉換為未來動作。最近的方法依賴於學習表徵，導致難以解釋的隱藏狀態。在這項工作中，我們使用自然語言以人類可解釋的方式量化動作特徵，並衡量它們嵌入隱藏狀態的程度。我們的實驗表明，動作序列的隱藏狀態根據我們離散的動作特徵集進行排列。根據這些見解，我們將控制向量擬合到動作特徵，這允許在推理時控制動作預測。因此，我們的方使我們能夠使用文本輸入控制基於轉換器的動作預測模型，提供了一個與這些模型互動和理解的獨特介面。我們的實作可在 https://github.com/kit-mrt/future-motion 取得", "author": "Omer Sahin Tas et.al.", "authors": "Omer Sahin Tas, Royden Wagner", "id": "2406.11624v1", "paper_url": "http://arxiv.org/abs/2406.11624v1", "repo": "https://github.com/kit-mrt/future-motion"}}