{"2410.06665": {"publish_time": "2024-10-09", "title": "Revisiting Multi-Permutation Equivariance through the Lens of Irreducible Representations", "paper_summary": "This paper explores the characterization of equivariant linear layers for\nrepresentations of permutations and related groups. Unlike traditional\napproaches, which address these problems using parameter-sharing, we consider\nan alternative methodology based on irreducible representations and Schur's\nlemma. Using this methodology, we obtain an alternative derivation for existing\nmodels like DeepSets, 2-IGN graph equivariant networks, and Deep Weight Space\n(DWS) networks. The derivation for DWS networks is significantly simpler than\nthat of previous results.\n  Next, we extend our approach to unaligned symmetric sets, where equivariance\nto the wreath product of groups is required. Previous works have addressed this\nproblem in a rather restrictive setting, in which almost all wreath equivariant\nlayers are Siamese. In contrast, we give a full characterization of layers in\nthis case and show that there is a vast number of additional non-Siamese layers\nin some settings. We also show empirically that these additional non-Siamese\nlayers can improve performance in tasks like graph anomaly detection, weight\nspace alignment, and learning Wasserstein distances. Our code is available at\n\\href{https://github.com/yonatansverdlov/Irreducible-Representations-of-Deep-Weight-Spaces}{GitHub}.", "paper_summary_zh": "這篇論文探討了置換和相關群組表示的等變線性層的特性。與使用參數共享來解決這些問題的傳統方法不同，我們考慮基於不可約表示和 Schur 引理的替代方法。使用此方法，我們獲得了現有模型的替代推導，例如 DeepSets、2-IGN 圖形等變網路和深度權重空間 (DWS) 網路。DWS 網路的推導顯著簡單於先前的結果。\n接著，我們將我們的做法延伸到未對齊的對稱集合，其中需要對群的環狀積進行等變。先前的研究已在相當嚴格的設定中解決了這個問題，其中幾乎所有環狀等變層都是連體的。相反，我們在此情況下對層進行了全面表徵，並表明在某些設定中存在大量額外的非連體層。我們還通過實證表明，這些額外的非連體層可以改善圖形異常偵測、權重空間對齊和學習 Wasserstein 距離等任務的效能。我們的程式碼可在 \\href{https://github.com/yonatansverdlov/Irreducible-Representations-of-Deep-Weight-Spaces}{GitHub} 取得。", "author": "Yonatan Sverdlov et.al.", "authors": "Yonatan Sverdlov, Ido Springer, Nadav Dym", "id": "2410.06665v1", "paper_url": "http://arxiv.org/abs/2410.06665v1", "repo": "null"}}