{"2410.23208": {"publish_time": "2024-10-30", "title": "Kinetix: Investigating the Training of General Agents through Open-Ended Physics-Based Control Tasks", "paper_summary": "While large models trained with self-supervised learning on offline datasets\nhave shown remarkable capabilities in text and image domains, achieving the\nsame generalisation for agents that act in sequential decision problems remains\nan open challenge. In this work, we take a step towards this goal by\nprocedurally generating tens of millions of 2D physics-based tasks and using\nthese to train a general reinforcement learning (RL) agent for physical\ncontrol. To this end, we introduce Kinetix: an open-ended space of\nphysics-based RL environments that can represent tasks ranging from robotic\nlocomotion and grasping to video games and classic RL environments, all within\na unified framework. Kinetix makes use of our novel hardware-accelerated\nphysics engine Jax2D that allows us to cheaply simulate billions of environment\nsteps during training. Our trained agent exhibits strong physical reasoning\ncapabilities, being able to zero-shot solve unseen human-designed environments.\nFurthermore, fine-tuning this general agent on tasks of interest shows\nsignificantly stronger performance than training an RL agent *tabula rasa*.\nThis includes solving some environments that standard RL training completely\nfails at. We believe this demonstrates the feasibility of large scale,\nmixed-quality pre-training for online RL and we hope that Kinetix will serve as\na useful framework to investigate this further.", "paper_summary_zh": "<paragraph>儘管使用離線資料集的自監督學習訓練出來的大型模型在文字和影像領域展現出顯著的能力，但對於在順序決策問題中執行的代理人達成相同的概括性仍然是一個公開的挑戰。在這項工作中，我們透過程序化產生數千萬個 2D 基於物理的任務，並使用這些任務訓練一個用於物理控制的一般強化學習 (RL) 代理人，朝這個目標邁進一步。為此，我們引入了 Kinetix：一個開放式的基於物理的 RL 環境空間，它可以在一個統一的架構內表示從機器人運動和抓取到電玩遊戲和經典 RL 環境等各種任務。Kinetix 使用我們新穎的硬體加速物理引擎 Jax2D，它讓我們可以在訓練期間便宜地模擬數十億個環境步驟。我們訓練出來的代理人展現出強大的物理推理能力，能夠在未經訓練的情況下解決人類設計的環境。此外，在感興趣的任務上微調這個一般代理人顯示出比訓練一個「白板」RL 代理人強大的表現。這包括解決一些標準 RL 訓練完全失敗的環境。我們相信這展示了針對線上 RL 進行大規模、混合品質預訓練的可行性，我們希望 Kinetix 能夠作為一個有用的架構來進一步研究這件事。</paragraph>", "author": "Michael Matthews et.al.", "authors": "Michael Matthews, Michael Beukman, Chris Lu, Jakob Foerster", "id": "2410.23208v1", "paper_url": "http://arxiv.org/abs/2410.23208v1", "repo": "null"}}