{"2408.11984": {"publish_time": "2024-08-21", "title": "Chemical Reaction Neural Networks for Fitting Accelerated Rate Calorimetry Data", "paper_summary": "As the demand for lithium-ion batteries rapidly increases there is a need to\ndesign these cells in a safe manner to mitigate thermal runaway. Thermal\nrunaway in batteries leads to an uncontrollable temperature rise and\npotentially fires, which is a major safety concern. Typically, when modelling\nthe chemical kinetics of thermal runaway calorimetry data ( e.g. Accelerated\nRate Calorimetry (ARC)) is needed to determine the temperature-driven\ndecomposition kinetics. Conventional methods of fitting Arrhenius Ordinary\nDifferential Equation (ODE) thermal runaway models to Accelerated Rate\nCalorimetry (ARC) data make several assumptions that reduce the fidelity and\ngeneralizability of the obtained model. In this paper, Chemical Reaction Neural\nNetworks (CRNNs) are trained to fit the kinetic parameters of N-equation\nArrhenius ODEs to ARC data obtained from a Molicel 21700 P45B. The models are\nfound to be better approximations of the experimental data. The flexibility of\nthe method is demonstrated by experimenting with two-equation and four-equation\nmodels. Thermal runaway simulations are conducted in 3D using the obtained\nkinetic parameters, showing the applicability of the obtained thermal runaway\nmodels to large-scale simulations.", "paper_summary_zh": "随着锂离子电池需求的快速增长，需要以安全的方式设计这些电池以减轻热失控。电池中的热失控会导致温度不受控制地升高并可能着火，这是一个主要的安全性问题。通常，在模拟热失控的化学动力学时，需要量热数据（例如加速量热法 (ARC)）来确定温度驱动的分解动力学。将 Arrhenius 常微分方程 (ODE) 热失控模型拟合到加速量热法 (ARC) 数据的传统方法做出了几个假设，这些假设降低了所获得模型的保真度和普遍性。在本文中，训练化学反应神经网络 (CRNN) 以拟合从 Molicel 21700 P45B 获得的 ARC 数据的 N 方程 Arrhenius ODE 的动力学参数。发现这些模型是对实验数据的更好近似。通过对两方程和四方程模型进行实验，证明了该方法的灵活性。使用获得的动力学参数在 3D 中进行热失控模拟，显示了所获得的热失控模型对大规模模拟的适用性。", "author": "Saakaar Bhatnagar et.al.", "authors": "Saakaar Bhatnagar, Andrew Comerford, Zelu Xu, Davide Berti Polato, Araz Banaeizadeh, Alessandro Ferraris", "id": "2408.11984v1", "paper_url": "http://arxiv.org/abs/2408.11984v1", "repo": "null"}}