{"2502.14619": {"publish_time": "2025-02-20", "title": "Reward Models Identify Consistency, Not Causality", "paper_summary": "Reward models (RMs) play a crucial role in aligning large language models\n(LLMs) with human preferences and enhancing reasoning quality. Traditionally,\nRMs are trained to rank candidate outputs based on their correctness and\ncoherence. However, in this work, we present several surprising findings that\nchallenge common assumptions about RM behavior. Our analysis reveals that\nstate-of-the-art reward models prioritize structural consistency over causal\ncorrectness. Specifically, removing the problem statement has minimal impact on\nreward scores, whereas altering numerical values or disrupting the reasoning\nflow significantly affects RM outputs. Furthermore, RMs exhibit a strong\ndependence on complete reasoning trajectories truncated or incomplete steps\nlead to significant variations in reward assignments, indicating that RMs\nprimarily rely on learned reasoning patterns rather than explicit problem\ncomprehension. These findings hold across multiple architectures, datasets, and\ntasks, leading to three key insights: (1) RMs primarily assess coherence rather\nthan true reasoning quality; (2) The role of explicit problem comprehension in\nreward assignment is overstated; (3) Current RMs may be more effective at\nranking responses than verifying logical validity. Our results suggest a\nfundamental limitation in existing reward modeling approaches, emphasizing the\nneed for a shift toward causality-aware reward models that go beyond\nconsistency-driven evaluation.", "paper_summary_zh": "獎勵模型 (RM) 在將大型語言模型 (LLM) 與人類偏好對齊並提升推理品質方面扮演至關重要的角色。傳統上，RM 會訓練來根據候選輸出的正確性和一致性進行排名。然而，在這項工作中，我們提出幾個令人驚訝的發現，挑戰了關於 RM 行為的常見假設。我們的分析顯示，最先進的獎勵模型優先考慮結構一致性，而不是因果正確性。具體來說，移除問題陳述對獎勵分數的影響很小，而改變數值或中斷推理流程則會顯著影響 RM 輸出。此外，RM 表現出對完整推理軌跡的強烈依賴性，截斷或不完整的步驟會導致獎勵分配產生重大變化，這表示 RM 主要依賴於學習到的推理模式，而不是明確的問題理解。這些發現適用於多種架構、資料集和任務，得出三個關鍵見解：(1) RM 主要評估一致性，而不是真正的推理品質；(2) 在獎勵分配中，明確問題理解的角色被誇大了；(3) 目前的 RM 在排名回應方面可能比驗證邏輯有效性更有效。我們的結果表明現有獎勵建模方法存在根本限制，強調需要轉向因果感知獎勵模型，超越以一致性為導向的評估。", "author": "Yuhui Xu et.al.", "authors": "Yuhui Xu, Hanze Dong, Lei Wang, Caiming Xiong, Junnan Li", "id": "2502.14619v1", "paper_url": "http://arxiv.org/abs/2502.14619v1", "repo": "null"}}