{"2502.02088": {"publish_time": "2025-02-04", "title": "IPO: Iterative Preference Optimization for Text-to-Video Generation", "paper_summary": "Video foundation models have achieved significant advancement with the help\nof network upgrade as well as model scale-up. However, they are still hard to\nmeet requirements of applications due to unsatisfied generation quality. To\nsolve this problem, we propose to align video foundation models with human\npreferences from the perspective of post-training in this paper. Consequently,\nwe introduce an Iterative Preference Optimization strategy to enhance generated\nvideo quality by incorporating human feedback. Specifically, IPO exploits a\ncritic model to justify video generations for pairwise ranking as in Direct\nPreference Optimization or point-wise scoring as in Kahneman-Tversky\nOptimization. Given this, IPO optimizes video foundation models with guidance\nof signals from preference feedback, which helps improve generated video\nquality in subject consistency, motion smoothness and aesthetic quality, etc.\nIn addition, IPO incorporates the critic model with the multi-modality large\nlanguage model, which enables it to automatically assign preference labels\nwithout need of retraining or relabeling. In this way, IPO can efficiently\nperform multi-round preference optimization in an iterative manner, without the\nneed of tediously manual labeling. Comprehensive experiments demonstrate that\nthe proposed IPO can effectively improve the video generation quality of a\npretrained model and help a model with only 2B parameters surpass the one with\n5B parameters. Besides, IPO achieves new state-of-the-art performance on VBench\nbenchmark. We will release our source codes, models as well as dataset to\nadvance future research and applications.", "paper_summary_zh": "影片基礎模型在網路升級和模型擴充的幫助下取得顯著進展。然而，由於生成品質無法滿足需求，它們仍難以符合應用程式的需求。為了解決此問題，我們在本文中提出從後訓練的角度，將影片基礎模型與人類偏好結合。因此，我們提出一個迭代偏好最佳化策略，透過整合人類回饋來提升產生的影片品質。具體來說，IPO 利用一個批判模型來證明影片生成，以進行成對排名，就像在直接偏好最佳化中一樣，或像在 Kahneman-Tversky 最佳化中一樣進行點數評分。有鑑於此，IPO 利用偏好回饋訊號的指導來最佳化影片基礎模型，有助於提升產生的影片品質，包括主題一致性、動作流暢度和美學品質等。此外，IPO 將批判模型與多模態大型語言模型整合，使其能夠自動分配偏好標籤，無需重新訓練或重新標記。透過這種方式，IPO 能夠以迭代的方式有效執行多輪偏好最佳化，而無需繁瑣的手動標記。全面的實驗證明，所提出的 IPO 能夠有效提升預訓練模型的影片生成品質，並幫助只有 2B 參數的模型超越具有 5B 參數的模型。此外，IPO 在 VBench 基準測試中取得新的最先進效能。我們將釋出原始碼、模型和資料集，以推動未來的研究和應用。", "author": "Xiaomeng Yang et.al.", "authors": "Xiaomeng Yang, Zhiyu Tan, Xuecheng Nie, Hao Li", "id": "2502.02088v1", "paper_url": "http://arxiv.org/abs/2502.02088v1", "repo": "null"}}