{"2405.15412": {"publish_time": "2024-05-24", "title": "ORCA: A Global Ocean Emulator for Multi-year to Decadal Predictions", "paper_summary": "Ocean dynamics plays a crucial role in driving global weather and climate\npatterns. Accurate and efficient modeling of ocean dynamics is essential for\nimproved understanding of complex ocean circulation and processes, for\npredicting climate variations and their associated teleconnections, and for\naddressing the challenges of climate change. While great efforts have been made\nto improve numerical Ocean General Circulation Models (OGCMs), accurate\nforecasting of global oceanic variations for multi-year remains to be a\nlong-standing challenge. Here, we introduce ORCA (Oceanic Reliable foreCAst),\nthe first data-driven model predicting global ocean circulation from multi-year\nto decadal time scales. ORCA accurately simulates the three-dimensional\ncirculations and dynamics of the global ocean with high physical consistency.\nHindcasts of key oceanic variables demonstrate ORCA's remarkable prediction\nskills in predicting ocean variations compared with state-of-the-art numerical\nOGCMs and abilities in capturing occurrences of extreme events at the\nsubsurface ocean and ENSO vertical patterns. These results demonstrate the\npotential of data-driven ocean models for providing cheap, efficient, and\naccurate global ocean modeling and prediction. Moreover, ORCA stably and\nfaithfully emulates ocean dynamics at decadal timescales, demonstrating its\npotential even for climate projections. The model will be available at\nhttps://github.com/OpenEarthLab/ORCA.", "paper_summary_zh": "海洋動力在推動全球天氣和氣候模式中扮演著至關重要的角色。準確且有效率的海洋動力建模對於增進了解複雜的海洋環流和程序、預測氣候變化及其相關的遙相關、並解決氣候變遷的挑戰至關重要。儘管已投入大量心力改善數值海洋環流模式 (OGCM)，但對於多年期全球海洋變化的準確預測仍是一個長期的挑戰。在此，我們介紹 ORCA（海洋可靠預測），這是第一個從多年期到十年期時間尺度預測全球海洋環流的資料驅動模型。ORCA 以高度物理一致性準確模擬全球海洋的三維環流和動力。關鍵海洋變數的後向預測證明了 ORCA 在預測海洋變化方面的顯著預測技巧，與最先進的數值 OGCM 相比，以及在捕捉海底海洋和 ENSO 垂直模式的極端事件發生方面的能力。這些結果證明了資料驅動海洋模型在提供便宜、有效率且準確的全球海洋建模和預測方面的潛力。此外，ORCA 在十年期時間尺度上穩定且忠實地模擬海洋動力，證明了其甚至在氣候預測方面的潛力。此模型將在 https://github.com/OpenEarthLab/ORCA 上提供。", "author": "Zijie Guo et.al.", "authors": "Zijie Guo, Pumeng Lyu, Fenghua Ling, Jing-Jia Luo, Niklas Boers, Wanli Ouyang, Lei Bai", "id": "2405.15412v1", "paper_url": "http://arxiv.org/abs/2405.15412v1", "repo": "null"}}