{"2409.06411": {"publish_time": "2024-09-10", "title": "Length Desensitization in Directed Preference Optimization", "paper_summary": "Direct Preference Optimization (DPO) is widely utilized in the Reinforcement\nLearning from Human Feedback (RLHF) phase to align Large Language Models (LLMs)\nwith human preferences, thereby enhancing both their harmlessness and efficacy.\nHowever, it has been observed that DPO tends to over-optimize for verbosity,\nwhich can detrimentally affect both performance and user experience. In this\npaper, we conduct an in-depth theoretical analysis of DPO's optimization\nobjective and reveal a strong correlation between its implicit reward and data\nlength. This correlation misguides the optimization direction, resulting in\nlength sensitivity during the DPO training and leading to verbosity. To address\nthis issue, we propose a length-desensitization improvement method for DPO,\ntermed LD-DPO. The proposed method aims to desensitize DPO to data length by\ndecoupling explicit length preference, which is relatively insignificant, from\nthe other implicit preferences, thereby enabling more effective learning of the\nintrinsic preferences. We utilized two settings (Base and Instruct) of\nLlama2-13B, Llama3-8B, and Qwen2-7B for experimental validation on various\nbenchmarks including MT-Bench and AlpacaEval 2. The experimental results\nindicate that LD-DPO consistently outperforms DPO and other baseline methods,\nachieving more concise responses with a 10-40\\% reduction in length compared to\nDPO. We conducted in-depth experimental analyses to demonstrate that LD-DPO can\nindeed achieve length desensitization and align the model more closely with\nhuman-real preferences.", "paper_summary_zh": "直接偏好最佳化（DPO）廣泛用於人類回饋強化學習（RLHF）階段，以將大型語言模型（LLM）與人類偏好結合，從而增強其無害性和效能。然而，觀察到 DPO 傾向於過度最佳化冗長性，這可能會對效能和使用者體驗造成負面影響。在本文中，我們對 DPO 的最佳化目標進行深入的理論分析，並揭示其隱含獎勵與資料長度之間的強烈關聯。這種關聯會誤導最佳化方向，導致 DPO 訓練期間長度敏感，並導致冗長。為了解決這個問題，我們提出了一種長度去敏化改善方法，稱為 LD-DPO。所提出的方法旨在透過將顯式的長度偏好（相對不重要）與其他隱含偏好分開，讓 DPO 對資料長度去敏化，從而能更有效地學習內在偏好。我們利用 Llama2-13B、Llama3-8B 和 Qwen2-7B 的兩個設定（基礎和指令）在各種基準上進行實驗驗證，包括 MT-Bench 和 AlpacaEval 2。實驗結果表明，LD-DPO 持續優於 DPO 和其他基線方法，與 DPO 相比，長度減少了 10-40%，產生了更簡潔的回應。我們進行了深入的實驗分析，以證明 LD-DPO 確實可以實現長度去敏化，並使模型更接近人類真實偏好。", "author": "Wei Liu et.al.", "authors": "Wei Liu, Yang Bai, Chengcheng Han, Rongxiang Weng, Jun Xu, Xuezhi Cao, Jingang Wang, Xunliang Cai", "id": "2409.06411v1", "paper_url": "http://arxiv.org/abs/2409.06411v1", "repo": "null"}}