{"2406.06485": {"publish_time": "2024-06-10", "title": "Can Language Models Serve as Text-Based World Simulators?", "paper_summary": "Virtual environments play a key role in benchmarking advances in complex\nplanning and decision-making tasks but are expensive and complicated to build\nby hand. Can current language models themselves serve as world simulators,\ncorrectly predicting how actions change different world states, thus bypassing\nthe need for extensive manual coding? Our goal is to answer this question in\nthe context of text-based simulators. Our approach is to build and use a new\nbenchmark, called ByteSized32-State-Prediction, containing a dataset of text\ngame state transitions and accompanying game tasks. We use this to directly\nquantify, for the first time, how well LLMs can serve as text-based world\nsimulators. We test GPT-4 on this dataset and find that, despite its impressive\nperformance, it is still an unreliable world simulator without further\ninnovations. This work thus contributes both new insights into current LLM's\ncapabilities and weaknesses, as well as a novel benchmark to track future\nprogress as new models appear.", "paper_summary_zh": "虛擬環境在複雜規劃和決策任務中的基準進展中扮演關鍵角色，但手動建構既昂貴又複雜。目前的語言模型本身能作為世界模擬器嗎？正確預測動作如何改變不同的世界狀態，從而繞過廣泛手動編碼的需要？我們的目標是在基於文字的模擬器背景下回答這個問題。我們的做法是建構並使用一個名為 ByteSized32-State-Prediction 的新基準，其中包含一個文字遊戲狀態轉換和隨附遊戲任務的資料集。我們使用它來直接量化，這是第一次，LLM 如何作為基於文字的世界模擬器。我們在這個資料集上測試了 GPT-4，發現儘管它表現出色，但它仍然是一個不可靠的世界模擬器，沒有進一步的創新。因此，這項工作既為當前 LLM 的能力和弱點提供了新的見解，也為隨著新模型的出現而追蹤未來進展提供了一個新的基準。", "author": "Ruoyao Wang et.al.", "authors": "Ruoyao Wang, Graham Todd, Ziang Xiao, Xingdi Yuan, Marc-Alexandre Côté, Peter Clark, Peter Jansen", "id": "2406.06485v1", "paper_url": "http://arxiv.org/abs/2406.06485v1", "repo": "null"}}