{"2406.02018": {"publish_time": "2024-06-04", "title": "Why Would You Suggest That? Human Trust in Language Model Responses", "paper_summary": "The emergence of Large Language Models (LLMs) has revealed a growing need for\nhuman-AI collaboration, especially in creative decision-making scenarios where\ntrust and reliance are paramount. Through human studies and model evaluations\non the open-ended News Headline Generation task from the LaMP benchmark, we\nanalyze how the framing and presence of explanations affect user trust and\nmodel performance. Overall, we provide evidence that adding an explanation in\nthe model response to justify its reasoning significantly increases\nself-reported user trust in the model when the user has the opportunity to\ncompare various responses. Position and faithfulness of these explanations are\nalso important factors. However, these gains disappear when users are shown\nresponses independently, suggesting that humans trust all model responses,\nincluding deceptive ones, equitably when they are shown in isolation. Our\nfindings urge future research to delve deeper into the nuanced evaluation of\ntrust in human-machine teaming systems.", "paper_summary_zh": "大型語言模型 (LLM) 的出現揭示了對人類與人工智慧協作日益增長的需求，特別是在信任和依賴至上的創意決策情境中。透過人類研究和模型評估，針對 LaMP 基準中的開放式新聞標題產生任務，我們分析解釋的架構和存在如何影響使用者信任和模型效能。總體而言，我們提供證據證明，在模型回應中加入解釋以證明其推理，當使用者有機會比較各種回應時，會顯著增加使用者對模型的自我報告信任。這些解釋的位置和忠實度也是重要因素。然而，當使用者獨立看到回應時，這些收益就會消失，這表示當人類在孤立狀態下看到所有模型回應時，包括具有欺騙性的回應，他們都會公平地信任。我們的研究結果敦促未來的研究深入探討對人類與機器團隊系統信任的細緻評估。", "author": "Manasi Sharma et.al.", "authors": "Manasi Sharma, Ho Chit Siu, Rohan Paleja, Jaime D. Peña", "id": "2406.02018v1", "paper_url": "http://arxiv.org/abs/2406.02018v1", "repo": "null"}}