{"2406.08425": {"publish_time": "2024-06-12", "title": "AWGUNET: Attention-Aided Wavelet Guided U-Net for Nuclei Segmentation in Histopathology Images", "paper_summary": "Accurate nuclei segmentation in histopathological images is crucial for\ncancer diagnosis. Automating this process offers valuable support to clinical\nexperts, as manual annotation is time-consuming and prone to human errors.\nHowever, automating nuclei segmentation presents challenges due to uncertain\ncell boundaries, intricate staining, and diverse structures. In this paper, we\npresent a segmentation approach that combines the U-Net architecture with a\nDenseNet-121 backbone, harnessing the strengths of both to capture\ncomprehensive contextual and spatial information. Our model introduces the\nWavelet-guided channel attention module to enhance cell boundary delineation,\nalong with a learnable weighted global attention module for channel-specific\nattention. The decoder module, composed of an upsample block and convolution\nblock, further refines segmentation in handling staining patterns. The\nexperimental results conducted on two publicly accessible histopathology\ndatasets, namely Monuseg and TNBC, underscore the superiority of our proposed\nmodel, demonstrating its potential to advance histopathological image analysis\nand cancer diagnosis. The code is made available at:\nhttps://github.com/AyushRoy2001/AWGUNET.", "paper_summary_zh": "組織病理學影像中精確的細胞核分割對於癌症診斷至關重要。自動化此程序可為臨床專家提供有價值的支援，因為手動註解既耗時又容易發生人為錯誤。然而，由於細胞邊界不確定、染色複雜且結構多樣，自動化細胞核分割會產生挑戰。在本文中，我們提出了一種分割方法，將 U-Net 架構與 DenseNet-121 主幹結合，利用兩者的優勢來擷取全面的上下文和空間資訊。我們的模型引入了小波導向通道注意模組，以增強細胞邊界的描繪，以及一個可學習的加權全局注意模組，用於特定通道的注意。解碼器模組由上採樣區塊和卷積區塊組成，進一步優化了處理染色模式的分割。在兩個公開可用的組織病理學資料集（即 Monuseg 和 TNBC）上進行的實驗結果，突顯了我們提出的模型的優越性，證明了其在推進組織病理學影像分析和癌症診斷方面的潛力。程式碼可在以下位置取得：https://github.com/AyushRoy2001/AWGUNET。", "author": "Ayush Roy et.al.", "authors": "Ayush Roy, Payel Pramanik, Dmitrii Kaplun, Sergei Antonov, Ram Sarkar", "id": "2406.08425v1", "paper_url": "http://arxiv.org/abs/2406.08425v1", "repo": "https://github.com/ayushroy2001/awgunet"}}