{"2407.15415": {"publish_time": "2024-07-22", "title": "LLaST: Improved End-to-end Speech Translation System Leveraged by Large Language Models", "paper_summary": "We introduces LLaST, a framework for building high-performance Large Language\nmodel based Speech-to-text Translation systems. We address the limitations of\nend-to-end speech translation(E2E ST) models by exploring model architecture\ndesign and optimization techniques tailored for LLMs. Our approach includes\nLLM-based speech translation architecture design, ASR-augmented training,\nmultilingual data augmentation, and dual-LoRA optimization. Our approach\ndemonstrates superior performance on the CoVoST-2 benchmark and showcases\nexceptional scaling capabilities powered by LLMs. We believe this effective\nmethod will serve as a strong baseline for speech translation and provide\ninsights for future improvements of the LLM-based speech translation framework.\nWe release the data, code and models in https://github.com/openaudiolab/LLaST.", "paper_summary_zh": "我們介紹 LLaST，一個用於建構高性能大型語言模型，基於語音轉文字翻譯系統的框架。我們透過探索模型架構設計和針對 LLM 量身打造的最佳化技術，來解決端對端語音翻譯 (E2E ST) 模型的限制。我們的做法包括基於 LLM 的語音翻譯架構設計、ASR 增強訓練、多語言資料擴充，以及雙 LoRA 最佳化。我們的做法在 CoVoST-2 基準測試中展現出卓越的效能，並展示了由 LLM 提供動力的非凡擴充能力。我們相信這個有效的方法將成為語音翻譯的強大基準，並為 LLM 基礎語音翻譯框架的未來改進提供見解。我們在 https://github.com/openaudiolab/LLaST 中釋出資料、程式碼和模型。", "author": "Xi Chen et.al.", "authors": "Xi Chen, Songyang Zhang, Qibing Bai, Kai Chen, Satoshi Nakamura", "id": "2407.15415v1", "paper_url": "http://arxiv.org/abs/2407.15415v1", "repo": "https://github.com/openaudiolab/llast"}}