{"2501.03038": {"publish_time": "2025-01-06", "title": "Piano Transcription by Hierarchical Language Modeling with Pretrained Roll-based Encoders", "paper_summary": "Automatic Music Transcription (AMT), aiming to get musical notes from raw\naudio, typically uses frame-level systems with piano-roll outputs or language\nmodel (LM)-based systems with note-level predictions. However, frame-level\nsystems require manual thresholding, while the LM-based systems struggle with\nlong sequences. In this paper, we propose a hybrid method combining pre-trained\nroll-based encoders with an LM decoder to leverage the strengths of both\nmethods. Besides, our approach employs a hierarchical prediction strategy,\nfirst predicting onset and pitch, then velocity, and finally offset. The\nhierarchical prediction strategy reduces computational costs by breaking down\nlong sequences into different hierarchies. Evaluated on two benchmark\nroll-based encoders, our method outperforms traditional piano-roll outputs 0.01\nand 0.022 in onset-offset-velocity F1 score, demonstrating its potential as a\nperformance-enhancing plug-in for arbitrary roll-based music transcription\nencoder. We release the code of this work at\nhttps://github.com/yongyizang/AMT_train.", "paper_summary_zh": "自動音樂轉錄 (AMT) 旨在從原始音訊中取得音符，通常使用帶有鋼琴卷軸輸出的幀級系統或帶有音符級預測的基於語言模型 (LM) 的系統。然而，幀級系統需要手動設定閾值，而基於 LM 的系統則難以處理長序列。在本文中，我們提出了一種混合方法，將預訓練的基於卷軸的編碼器與 LM 解碼器結合起來，以利用兩種方法的優勢。此外，我們的做法採用了分層預測策略，首先預測起始和音高，然後預測速度，最後預測偏移。分層預測策略通過將長序列分解為不同的層次結構來降低運算成本。在兩個基準卷軸編碼器上進行評估後，我們的模型在起始-偏移-速度 F1 分數上優於傳統的鋼琴卷軸輸出 0.01 和 0.022，證明了其作為任意基於卷軸的音樂轉錄編碼器的效能提升外掛程式之潛力。我們在 https://github.com/yongyizang/AMT_train 上發布了這項工作的程式碼。", "author": "Dichucheng Li et.al.", "authors": "Dichucheng Li, Yongyi Zang, Qiuqiang Kong", "id": "2501.03038v1", "paper_url": "http://arxiv.org/abs/2501.03038v1", "repo": "null"}}