{"2501.04832": {"publish_time": "2025-01-08", "title": "ActPC-Geom: Towards Scalable Online Neural-Symbolic Learning via Accelerating Active Predictive Coding with Information Geometry & Diverse Cognitive Mechanisms", "paper_summary": "This paper introduces ActPC-Geom, an approach to accelerate Active Predictive\nCoding (ActPC) in neural networks by integrating information geometry,\nspecifically using Wasserstein-metric-based methods for measure-dependent\ngradient flows. We propose replacing KL-divergence in ActPC's predictive error\nassessment with the Wasserstein metric, suggesting this may enhance network\nrobustness.\n  To make this computationally feasible, we present strategies including: (1)\nneural approximators for inverse measure-dependent Laplacians, (2) approximate\nkernel PCA embeddings for low-rank approximations feeding into these\napproximators, and (3) compositional hypervector embeddings derived from kPCA\noutputs, with algebra optimized for fuzzy FCA lattices learned through neural\narchitectures analyzing network states.\n  This results in an ActPC architecture capable of real-time online learning\nand integrating continuous (e.g., transformer-like or Hopfield-net-like) and\ndiscrete symbolic ActPC networks, including frameworks like OpenCog Hyperon or\nActPC-Chem for algorithmic chemistry evolution. Shared probabilistic,\nconcept-lattice, and hypervector models enable symbolic-subsymbolic\nintegration.\n  Key features include (1) compositional reasoning via hypervector embeddings\nin transformer-like architectures for tasks like commonsense reasoning, and (2)\nHopfield-net dynamics enabling associative long-term memory and\nattractor-driven cognitive features.\n  We outline how ActPC-Geom combines few-shot learning with online weight\nupdates, enabling deliberative thinking and seamless symbolic-subsymbolic\nreasoning. Ideas from Galois connections are explored for efficient hybrid\nActPC/ActPC-Chem processing. Finally, we propose a specialized HPC design\noptimized for real-time focused attention and deliberative reasoning tailored\nto ActPC-Geom's demands.", "paper_summary_zh": "<paragraph>本文介紹了 ActPC-Geom，一種透過整合資訊幾何來加速神經網路中主動預測編碼 (ActPC) 的方法，特別是使用基於 Wasserstein 度量的測度相關梯度流方法。我們建議以 Wasserstein 度量取代 ActPC 預測誤差評估中的 KL 分歧，並提出這可能會增強網路的穩健性。\n為了讓這在運算上可行，我們提出了以下策略：(1) 逆測度相關拉普拉斯算子的神經近似器，(2) 近似核 PCA 嵌入，用於輸入這些近似器的低秩近似，以及 (3) 源自 kPCA 輸出的組合超向量嵌入，其中代數針對通過分析網路狀態的神經架構所學習到的模糊 FCA 格子進行最佳化。\n這產生了一個 ActPC 架構，它能夠進行即時線上學習，並整合連續的 (例如類 Transformer 或類 Hopfield 網路) 和離散符號 ActPC 網路，包括用於演算法化學演化的 OpenCog Hyperon 或 ActPC-Chem 等架構。共用機率、概念格子和超向量模型實現了符號次符號整合。\n主要特點包括 (1) 透過類 Transformer 架構中的超向量嵌入進行組合推理，以執行常識推理等任務，以及 (2) Hopfield 網路動態，實現聯想長期記憶和吸引子驅動的認知特徵。\n我們概述了 ActPC-Geom 如何將少量學習與線上權重更新結合，從而實現審慎思考和無縫的符號次符號推理。探索了來自伽羅瓦連接的想法，以進行有效的混合 ActPC/ActPC-Chem 處理。最後，我們提出了一種針對 ActPC-Geom 需求進行最佳化的特殊 HPC 設計，針對即時焦點注意和審慎推理進行了最佳化。</paragraph>", "author": "Ben Goertzel et.al.", "authors": "Ben Goertzel", "id": "2501.04832v1", "paper_url": "http://arxiv.org/abs/2501.04832v1", "repo": "null"}}