{"2411.14612": {"publish_time": "2024-11-21", "title": "Exploiting Boosting in Hyperdimensional Computing for Enhanced Reliability in Healthcare", "paper_summary": "Hyperdimensional computing (HDC) enables efficient data encoding and\nprocessing in high-dimensional space, benefiting machine learning and data\nanalysis. However, underutilization of these spaces can lead to overfitting and\nreduced model reliability, especially in data-limited systems a critical issue\nin sectors like healthcare that demand robustness and consistent performance.\nWe introduce BoostHD, an approach that applies boosting algorithms to partition\nthe hyperdimensional space into subspaces, creating an ensemble of weak\nlearners. By integrating boosting with HDC, BoostHD enhances performance and\nreliability beyond existing HDC methods. Our analysis highlights the importance\nof efficient utilization of hyperdimensional spaces for improved model\nperformance. Experiments on healthcare datasets show that BoostHD outperforms\nstate-of-the-art methods. On the WESAD dataset, it achieved an accuracy of\n98.37%, surpassing Random Forest, XGBoost, and OnlineHD. BoostHD also\ndemonstrated superior inference efficiency and stability, maintaining high\naccuracy under data imbalance and noise. In person-specific evaluations, it\nachieved an average accuracy of 96.19%, outperforming other models. By\naddressing the limitations of both boosting and HDC, BoostHD expands the\napplicability of HDC in critical domains where reliability and precision are\nparamount.", "paper_summary_zh": "超維度運算 (HDC) 能有效率地對高維度空間中的資料進行編碼和處理，這對機器學習和資料分析很有好處。然而，如果這些空間沒有充分利用，可能會導致過度擬合和降低模型可靠度，特別是在資料有限的系統中，這在醫療保健等領域是一個關鍵問題，因為這些領域需要強健性和一致的效能。我們介紹 BoostHD，這是一種將提升演算法應用於將超維度空間分割成子空間的方法，創造出一個由弱學習器組成的集合。透過將提升與 HDC 整合，BoostHD 能夠提升效能和可靠度，超越現有的 HDC 方法。我們的分析強調了有效利用超維度空間以改善模型效能的重要性。在醫療保健資料集上的實驗顯示，BoostHD 優於最先進的方法。在 WESAD 資料集上，它的準確度達到 98.37%，超越了 Random Forest、XGBoost 和 OnlineHD。BoostHD 也展現出優異的推論效率和穩定性，在資料不平衡和雜訊的情況下仍能維持高準確度。在特定個人的評估中，它的平均準確度達到 96.19%，優於其他模型。透過解決提升和 HDC 的限制，BoostHD 擴展了 HDC 在可靠度和精確度至關重要的關鍵領域的適用性。", "author": "SungHeon Jeong et.al.", "authors": "SungHeon Jeong, Hamza Errahmouni Barkam, Sanggeon Yun, Yeseong Kim, Shaahin Angizi, Mohsen Imani", "id": "2411.14612v1", "paper_url": "http://arxiv.org/abs/2411.14612v1", "repo": "null"}}