{"2405.14696": {"publish_time": "2024-05-23", "title": "A Declarative System for Optimizing AI Workloads", "paper_summary": "A long-standing goal of data management systems has been to build systems\nwhich can compute quantitative insights over large corpora of unstructured data\nin a cost-effective manner. Until recently, it was difficult and expensive to\nextract facts from company documents, data from scientific papers, or metrics\nfrom image and video corpora. Today's models can accomplish these tasks with\nhigh accuracy. However, a programmer who wants to answer a substantive\nAI-powered query must orchestrate large numbers of models, prompts, and data\noperations. For even a single query, the programmer has to make a vast number\nof decisions such as the choice of model, the right inference method, the most\ncost-effective inference hardware, the ideal prompt design, and so on. The\noptimal set of decisions can change as the query changes and as the\nrapidly-evolving technical landscape shifts. In this paper we present\nPalimpzest, a system that enables anyone to process AI-powered analytical\nqueries simply by defining them in a declarative language. The system uses its\ncost optimization framework to implement the query plan with the best\ntrade-offs between runtime, financial cost, and output data quality. We\ndescribe the workload of AI-powered analytics tasks, the optimization methods\nthat Palimpzest uses, and the prototype system itself. We evaluate Palimpzest\non tasks in Legal Discovery, Real Estate Search, and Medical Schema Matching.\nWe show that even our simple prototype offers a range of appealing plans,\nincluding one that is 3.3x faster and 2.9x cheaper than the baseline method,\nwhile also offering better data quality. With parallelism enabled, Palimpzest\ncan produce plans with up to a 90.3x speedup at 9.1x lower cost relative to a\nsingle-threaded GPT-4 baseline, while obtaining an F1-score within 83.5% of the\nbaseline. These require no additional work by the user.", "paper_summary_zh": "長期以來，資料管理系統的目標一直是建立系統，能夠以經濟有效的方式計算大量非結構化資料的量化見解。直到最近，從公司文件、科學論文中提取事實，或從影像和影片資料中提取指標，仍然困難且昂貴。現今的模型可以高準確度完成這些任務。然而，想要回答實質性 AI 驅動查詢的程式設計師，必須協調大量的模型、提示和資料操作。即使只是一個單一的查詢，程式設計師都必須做出大量的決策，例如模型的選擇、正確的推論方法、最具成本效益的推論硬體、理想的提示設計，等等。最佳決策組合會隨著查詢的改變和快速變化的技術環境而改變。在本文中，我們提出了 Palimpzest，一個系統，讓任何人都能透過在宣告式語言中定義 AI 驅動分析查詢，來處理這些查詢。系統使用其成本最佳化架構，以最佳的執行時間、財務成本和輸出資料品質折衷，來實作查詢計畫。我們描述了 AI 驅動分析任務的工作負載、Palimpzest 使用的最佳化方法，以及原型系統本身。我們在法律發現、房地產搜尋和醫療架構比對的任務中評估 Palimpzest。我們展示了即使是我們的簡單原型也能提供一系列有吸引力的計畫，包括一個比基準方法快 3.3 倍、便宜 2.9 倍的計畫，同時還能提供更好的資料品質。在啟用平行處理的情況下，Palimpzest 可以產生速度提升達 90.3 倍、成本降低 9.1 倍的計畫，相較於單執行緒 GPT-4 基準，同時獲得 F1 分數在基準的 83.5% 以內。這些都不需要使用者額外的作業。", "author": "Chunwei Liu et.al.", "authors": "Chunwei Liu, Matthew Russo, Michael Cafarella, Lei Cao, Peter Baille Chen, Zui Chen, Michael Franklin, Tim Kraska, Samuel Madden, Gerardo Vitagliano", "id": "2405.14696v2", "paper_url": "http://arxiv.org/abs/2405.14696v2", "repo": "null"}}