{"2407.11624": {"publish_time": "2024-07-16", "title": "Rethinking Fair Graph Neural Networks from Re-balancing", "paper_summary": "Driven by the powerful representation ability of Graph Neural Networks\n(GNNs), plentiful GNN models have been widely deployed in many real-world\napplications. Nevertheless, due to distribution disparities between different\ndemographic groups, fairness in high-stake decision-making systems is receiving\nincreasing attention. Although lots of recent works devoted to improving the\nfairness of GNNs and achieved considerable success, they all require\nsignificant architectural changes or additional loss functions requiring more\nhyper-parameter tuning. Surprisingly, we find that simple re-balancing methods\ncan easily match or surpass existing fair GNN methods. We claim that the\nimbalance across different demographic groups is a significant source of\nunfairness, resulting in imbalanced contributions from each group to the\nparameters updating. However, these simple re-balancing methods have their own\nshortcomings during training. In this paper, we propose FairGB, Fair Graph\nNeural Network via re-Balancing, which mitigates the unfairness of GNNs by\ngroup balancing. Technically, FairGB consists of two modules: counterfactual\nnode mixup and contribution alignment loss. Firstly, we select counterfactual\npairs across inter-domain and inter-class, and interpolate the ego-networks to\ngenerate new samples. Guided by analysis, we can reveal the debiasing mechanism\nof our model by the causal view and prove that our strategy can make sensitive\nattributes statistically independent from target labels. Secondly, we reweigh\nthe contribution of each group according to gradients. By combining these two\nmodules, they can mutually promote each other. Experimental results on\nbenchmark datasets show that our method can achieve state-of-the-art results\nconcerning both utility and fairness metrics. Code is available at\nhttps://github.com/ZhixunLEE/FairGB.", "paper_summary_zh": "<paragraph>在图神经网络 (GNN) 强大的表示能力的推动下，大量的 GNN 模型已广泛部署在许多实际应用中。然而，由于不同人口群体之间的分布差异，高风险决策系统中的公平性正受到越来越多的关注。尽管最近有许多致力于提高 GNN 公平性的工作并取得了相当大的成功，但它们都需要大量的架构更改或附加损失函数，需要更多超参数调整。令人惊讶的是，我们发现简单的重新平衡方法可以轻松匹配或超越现有的公平 GNN 方法。我们声称，不同人口群体之间的不平衡是造成不公平的一个重要根源，导致每个群体对参数更新的贡献不平衡。然而，这些简单的重新平衡方法在训练过程中有其自身的缺点。在本文中，我们提出了 FairGB，即通过重新平衡实现公平图神经网络，它通过组平衡来减轻 GNN 的不公平性。从技术上讲，FairGB 由两个模块组成：反事实节点混合和贡献对齐损失。首先，我们在域间和类间选择反事实对，并插值自我网络以生成新样本。在分析的指导下，我们可以通过因果视图揭示我们模型的去偏机制，并证明我们的策略可以使敏感属性在统计上独立于目标标签。其次，我们根据梯度重新权衡每个组的贡献。通过结合这两个模块，它们可以相互促进。基准数据集上的实验结果表明，我们的方法可以实现有关效用和公平性指标的最先进结果。代码可在 https://github.com/ZhixunLEE/FairGB 获得。</paragraph>", "author": "Zhixun Li et.al.", "authors": "Zhixun Li, Yushun Dong, Qiang Liu, Jeffrey Xu Yu", "id": "2407.11624v1", "paper_url": "http://arxiv.org/abs/2407.11624v1", "repo": "https://github.com/zhixunlee/fairgb"}}