{"2406.07935": {"publish_time": "2024-06-12", "title": "Defining and Detecting Vulnerability in Human Evaluation Guidelines: A Preliminary Study Towards Reliable NLG Evaluation", "paper_summary": "Human evaluation serves as the gold standard for assessing the quality of\nNatural Language Generation (NLG) systems. Nevertheless, the evaluation\nguideline, as a pivotal element ensuring reliable and reproducible human\nassessment, has received limited attention.Our investigation revealed that only\n29.84% of recent papers involving human evaluation at top conferences release\ntheir evaluation guidelines, with vulnerabilities identified in 77.09% of these\nguidelines. Unreliable evaluation guidelines can yield inaccurate assessment\noutcomes, potentially impeding the advancement of NLG in the right direction.\nTo address these challenges, we take an initial step towards reliable\nevaluation guidelines and propose the first human evaluation guideline dataset\nby collecting annotations of guidelines extracted from existing papers as well\nas generated via Large Language Models (LLMs). We then introduce a taxonomy of\neight vulnerabilities and formulate a principle for composing evaluation\nguidelines. Furthermore, a method for detecting guideline vulnerabilities has\nbeen explored using LLMs, and we offer a set of recommendations to enhance\nreliability in human evaluation. The annotated human evaluation guideline\ndataset and code for the vulnerability detection method are publicly available\nonline.", "paper_summary_zh": "人類評估是評估自然語言生成 (NLG) 系統品質的黃金標準。儘管如此，評估準則作為確保可靠且可重製人類評估的關鍵要素，卻鮮少受到重視。我們的調查顯示，在頂尖會議中涉及人類評估的近期論文中，只有 29.84% 發布了評估準則，而這些準則中有 77.09% 被找出漏洞。不可靠的評估準則可能會產生不準確的評估結果，進而阻礙 NLG 朝正確的方向前進。為了應對這些挑戰，我們朝著可靠的評估準則邁出第一步，並透過收集從現有論文中萃取的準則註解，以及透過大型語言模型 (LLM) 生成的準則，提出了第一個人類評估準則資料集。接著，我們介紹了八項漏洞的分類法，並制定了撰寫評估準則的原則。此外，我們已使用 LLM 探索了一種偵測準則漏洞的方法，並提供了一組建議，以增強人類評估的可靠性。已註解的人類評估準則資料集和漏洞偵測方法的程式碼已公開於線上。", "author": "Jie Ruan et.al.", "authors": "Jie Ruan, Wenqing Wang, Xiaojun Wan", "id": "2406.07935v1", "paper_url": "http://arxiv.org/abs/2406.07935v1", "repo": "null"}}