{"2408.02462": {"publish_time": "2024-08-05", "title": "An investigation into the causes of race bias in AI-based cine CMR segmentation", "paper_summary": "Artificial intelligence (AI) methods are being used increasingly for the\nautomated segmentation of cine cardiac magnetic resonance (CMR) imaging.\nHowever, these methods have been shown to be subject to race bias, i.e. they\nexhibit different levels of performance for different races depending on the\n(im)balance of the data used to train the AI model. In this paper we\ninvestigate the source of this bias, seeking to understand its root cause(s) so\nthat it can be effectively mitigated. We perform a series of classification and\nsegmentation experiments on short-axis cine CMR images acquired from Black and\nWhite subjects from the UK Biobank and apply AI interpretability methods to\nunderstand the results. In the classification experiments, we found that race\ncan be predicted with high accuracy from the images alone, but less accurately\nfrom ground truth segmentations, suggesting that the distributional shift\nbetween races, which is often the cause of AI bias, is mostly image-based\nrather than segmentation-based. The interpretability methods showed that most\nattention in the classification models was focused on non-heart regions, such\nas subcutaneous fat. Cropping the images tightly around the heart reduced\nclassification accuracy to around chance level. Similarly, race can be\npredicted from the latent representations of a biased segmentation model,\nsuggesting that race information is encoded in the model. Cropping images\ntightly around the heart reduced but did not eliminate segmentation bias. We\nalso investigate the influence of possible confounders on the bias observed.", "paper_summary_zh": "人工智慧 (AI) 方法正日益用於自動分割心臟電影式磁振造影 (CMR) 影像。\n然而，這些方法已被證明會受到種族偏見的影響，即根據用於訓練 AI 模型的資料的 (不) 平衡，它們對不同種族展現出不同層級的效能。在本文中，我們調查此偏見的來源，試圖了解其根本原因，以便能有效減輕它。我們對來自英國生物銀行的黑人和白人受試者所取得的短軸心臟電影式 CMR 影像執行一系列分類和分割實驗，並套用 AI 可解釋性方法來了解結果。在分類實驗中，我們發現僅從影像就能以高準確度預測種族，但從真實分割的準確度較低，這表示種族之間的分配轉移（通常是 AI 偏見的原因）主要是基於影像，而非基於分割。可解釋性方法顯示，分類模型中的大部分注意力都集中在非心臟區域，例如皮下脂肪。緊密裁剪影像以圍繞心臟會將分類準確度降低至接近隨機層級。同樣地，種族可以從有偏見的分割模型的潛在表示中預測，這表示種族資訊已編碼在模型中。緊密裁剪影像以圍繞心臟會降低分割偏見，但無法消除它。我們也調查可能混淆因子對所觀察到的偏見的影響。", "author": "Tiarna Lee et.al.", "authors": "Tiarna Lee, Esther Puyol-Anton, Bram Ruijsink, Sebastien Roujol, Theodore Barfoot, Shaheim Ogbomo-Harmitt, Miaojing Shi, Andrew P. King", "id": "2408.02462v1", "paper_url": "http://arxiv.org/abs/2408.02462v1", "repo": "null"}}