{"2409.02519": {"publish_time": "2024-09-04", "title": "Language is Scary when Over-Analyzed: Unpacking Implied Misogynistic Reasoning with Argumentation Theory-Driven Prompts", "paper_summary": "We propose misogyny detection as an Argumentative Reasoning task and we\ninvestigate the capacity of large language models (LLMs) to understand the\nimplicit reasoning used to convey misogyny in both Italian and English. The\ncentral aim is to generate the missing reasoning link between a message and the\nimplied meanings encoding the misogyny. Our study uses argumentation theory as\na foundation to form a collection of prompts in both zero-shot and few-shot\nsettings. These prompts integrate different techniques, including\nchain-of-thought reasoning and augmented knowledge. Our findings show that LLMs\nfall short on reasoning capabilities about misogynistic comments and that they\nmostly rely on their implicit knowledge derived from internalized common\nstereotypes about women to generate implied assumptions, rather than on\ninductive reasoning.", "paper_summary_zh": "我們將厭女情結偵測視為一種論證推理任務，並探討大型語言模型 (LLM) 理解用於傳達義大利語和英語中厭女情結的隱含推理的能力。核心目標是產生訊息與編碼厭女情結的隱含意義之間遺失的推理連結。我們的研究以論證理論為基礎，在零次學習和少次學習設定中形成一系列提示。這些提示整合了不同的技術，包括思考鏈推理和增強知識。我們的研究結果顯示，LLM 在推理厭女評論的能力上有所不足，而且它們主要依賴於從內化女性的常見刻板印象中衍生的隱含知識來產生隱含假設，而非歸納推理。", "author": "Arianna Muti et.al.", "authors": "Arianna Muti, Federico Ruggeri, Khalid Al-Khatib, Alberto Barrón-Cedeño, Tommaso Caselli", "id": "2409.02519v1", "paper_url": "http://arxiv.org/abs/2409.02519v1", "repo": "null"}}