{"2501.14483": {"publish_time": "2025-01-24", "title": "Registration of Longitudinal Liver Examinations for Tumor Progress Assessment", "paper_summary": "Assessing cancer progression in liver CT scans is a clinical challenge,\nrequiring a comparison of scans at different times for the same patient.\nPractitioners must identify existing tumors, compare them with prior exams,\nidentify new tumors, and evaluate overall disease evolution. This process is\nparticularly complex in liver examinations due to misalignment between exams\ncaused by several factors. Indeed, longitudinal liver examinations can undergo\ndifferent non-pathological and pathological changes due to non-rigid\ndeformations, the appearance or disappearance of pathologies, and other\nvariations. In such cases, existing registration approaches, mainly based on\nintrinsic features may distort tumor regions, biasing the tumor progress\nevaluation step and the corresponding diagnosis. This work proposes a\nregistration method based only on geometrical and anatomical information from\nliver segmentation, aimed at aligning longitudinal liver images for aided\ndiagnosis. The proposed method is trained and tested on longitudinal liver CT\nscans, with 317 patients for training and 53 for testing. Our experimental\nresults support our claims by showing that our method is better than other\nregistration techniques by providing a smoother deformation while preserving\nthe tumor burden (total volume of tissues considered as tumor) within the\nvolume. Qualitative results emphasize the importance of smooth deformations in\npreserving tumor appearance.", "paper_summary_zh": "評估肝臟電腦斷層掃描中的癌症進程是一項臨床上的挑戰，\n需要比較同一病患在不同時間點的掃描結果。\n從業人員必須辨識現有的腫瘤，將其與先前的檢查結果進行比較，\n辨識新的腫瘤，並評估整體疾病的演變。由於種種因素造成檢查結果之間的錯位，這個過程在肝臟檢查中特別複雜。事實上，縱向的肝臟檢查可能會因為非剛性變形、病理的出現或消失，以及其他變化而產生不同的非病理性和病理性的變化。在這種情況下，現有的配準方法（主要基於內在特徵）可能會扭曲腫瘤區域，造成腫瘤進程評估步驟和相應診斷的偏差。本研究提出了一種僅基於肝臟分割的幾何和解剖資訊的配準方法，旨在對縱向肝臟影像進行配準，以協助診斷。所提出的方法在縱向肝臟電腦斷層掃描上進行訓練和測試，訓練資料有 317 位病患，測試資料有 53 位。我們的實驗結果支持我們的說法，證明我們的配準方法比其他配準技術更好，因為它在保留腫瘤負擔（被視為腫瘤的組織總體積）的同時，提供了更平滑的變形。定性結果強調了平滑變形在保留腫瘤外觀方面的重要性。", "author": "Walid Yassine et.al.", "authors": "Walid Yassine, Martin Charachon, Céline Hudelot, Roberto Ardon", "id": "2501.14483v1", "paper_url": "http://arxiv.org/abs/2501.14483v1", "repo": "null"}}