{"2412.07754": {"publish_time": "2024-12-10", "title": "PortraitTalk: Towards Customizable One-Shot Audio-to-Talking Face Generation", "paper_summary": "Audio-driven talking face generation is a challenging task in digital\ncommunication. Despite significant progress in the area, most existing methods\nconcentrate on audio-lip synchronization, often overlooking aspects such as\nvisual quality, customization, and generalization that are crucial to producing\nrealistic talking faces. To address these limitations, we introduce a novel,\ncustomizable one-shot audio-driven talking face generation framework, named\nPortraitTalk. Our proposed method utilizes a latent diffusion framework\nconsisting of two main components: IdentityNet and AnimateNet. IdentityNet is\ndesigned to preserve identity features consistently across the generated video\nframes, while AnimateNet aims to enhance temporal coherence and motion\nconsistency. This framework also integrates an audio input with the reference\nimages, thereby reducing the reliance on reference-style videos prevalent in\nexisting approaches. A key innovation of PortraitTalk is the incorporation of\ntext prompts through decoupled cross-attention mechanisms, which significantly\nexpands creative control over the generated videos. Through extensive\nexperiments, including a newly developed evaluation metric, our model\ndemonstrates superior performance over the state-of-the-art methods, setting a\nnew standard for the generation of customizable realistic talking faces\nsuitable for real-world applications.", "paper_summary_zh": "語音驅動對話人臉生成是數位溝通中的一項艱鉅任務。儘管該領域已取得顯著進展，但現有方法大多集中在音訊唇形同步，往往忽略了視覺品質、自訂化和泛化等對於產生逼真對話人臉至關重要的面向。為了解決這些限制，我們提出了一個新穎、可自訂的單次音訊驅動對話人臉生成架構，名為 PortraitTalk。我們提出的方法利用一個潛在擴散架構，該架構包含兩個主要元件：IdentityNet 和 AnimateNet。IdentityNet 旨在在生成的影片畫格中持續保留身分特徵，而 AnimateNet 則旨在增強時間相干性和動作一致性。此架構還將音訊輸入與參考影像整合，從而減少現有方法中普遍依賴參考風格影片的情況。PortraitTalk 的一項關鍵創新是透過解耦交叉注意力機制納入文字提示，這顯著擴展了對生成影片的創意控制。透過廣泛的實驗，包括一個新開發的評估指標，我們的模型證明了其優於最先進方法的效能，為可自訂的逼真對話人臉生成樹立了新標準，適用於真實世界的應用。", "author": "Fatemeh Nazarieh et.al.", "authors": "Fatemeh Nazarieh, Zhenhua Feng, Diptesh Kanojia, Muhammad Awais, Josef Kittler", "id": "2412.07754v1", "paper_url": "http://arxiv.org/abs/2412.07754v1", "repo": "null"}}