{"2411.02280": {"publish_time": "2024-11-04", "title": "The LLM Language Network: A Neuroscientific Approach for Identifying Causally Task-Relevant Units", "paper_summary": "Large language models (LLMs) exhibit remarkable capabilities on not just\nlanguage tasks, but also various tasks that are not linguistic in nature, such\nas logical reasoning and social inference. In the human brain, neuroscience has\nidentified a core language system that selectively and causally supports\nlanguage processing. We here ask whether similar specialization for language\nemerges in LLMs. We identify language-selective units within 18 popular LLMs,\nusing the same localization approach that is used in neuroscience. We then\nestablish the causal role of these units by demonstrating that ablating LLM\nlanguage-selective units -- but not random units -- leads to drastic deficits\nin language tasks. Correspondingly, language-selective LLM units are more\naligned to brain recordings from the human language system than random units.\nFinally, we investigate whether our localization method extends to other\ncognitive domains: while we find specialized networks in some LLMs for\nreasoning and social capabilities, there are substantial differences among\nmodels. These findings provide functional and causal evidence for\nspecialization in large language models, and highlight parallels with the\nfunctional organization in the brain.", "paper_summary_zh": "大型語言模型 (LLM) 不僅在語言任務上表現出非凡的能力，而且在非語言性質的各種任務上也有表現，例如邏輯推理和社會推論。在人腦中，神經科學已經確定了一個核心語言系統，該系統選擇性地和因果地支持語言處理。我們在此探討 LLM 中是否出現了類似的語言專業化。我們使用神經科學中使用的相同定位方法，在 18 個流行的 LLM 中識別語言選擇單元。然後，我們通過證明消融 LLM 語言選擇單元（而非隨機單元）會導致語言任務出現巨大缺陷，來確立這些單元的因果關係。相應地，語言選擇 LLM 單元與來自人類語言系統的腦部記錄相比，與隨機單元相比更一致。最後，我們探討我們的定位方法是否擴展到其他認知領域：雖然我們在一些 LLM 中發現了推理和社會能力的專門網路，但模型之間存在顯著差異。這些發現為大型語言模型中的專業化提供了功能性和因果證據，並突出了與大腦功能組織的相似之處。", "author": "Badr AlKhamissi et.al.", "authors": "Badr AlKhamissi, Greta Tuckute, Antoine Bosselut, Martin Schrimpf", "id": "2411.02280v1", "paper_url": "http://arxiv.org/abs/2411.02280v1", "repo": "null"}}