{"2502.02407": {"publish_time": "2025-02-04", "title": "Avoiding spurious sharpness minimization broadens applicability of SAM", "paper_summary": "Curvature regularization techniques like Sharpness Aware Minimization (SAM)\nhave shown great promise in improving generalization on vision tasks. However,\nwe find that SAM performs poorly in domains like natural language processing\n(NLP), often degrading performance -- even with twice the compute budget. We\ninvestigate the discrepancy across domains and find that in the NLP setting,\nSAM is dominated by regularization of the logit statistics -- instead of\nimproving the geometry of the function itself. We use this observation to\ndevelop an alternative algorithm we call Functional-SAM, which regularizes\ncurvature only through modification of the statistics of the overall function\nimplemented by the neural network, and avoids spurious minimization through\nlogit manipulation. Furthermore, we argue that preconditioning the SAM\nperturbation also prevents spurious minimization, and when combined with\nFunctional-SAM, it gives further improvements. Our proposed algorithms show\nimproved performance over AdamW and SAM baselines when trained for an equal\nnumber of steps, in both fixed-length and Chinchilla-style training settings,\nat various model scales (including billion-parameter scale). On the whole, our\nwork highlights the importance of more precise characterizations of sharpness\nin broadening the applicability of curvature regularization to large language\nmodels (LLMs).", "paper_summary_zh": "曲率正则化技术，例如 Sharpness Aware Minimization (SAM)，在提高视觉任务的泛化能力方面显示出极大的前景。然而，我们发现 SAM 在自然语言处理 (NLP) 等领域表现不佳，通常会降低性能——即使计算预算增加了一倍。我们调查了不同领域之间的差异，发现 SAM 在 NLP 环境中主要受 logit 统计量的正则化影响——而不是改善函数本身的几何形状。我们利用这一观察结果开发了一种我们称之为 Functional-SAM 的替代算法，该算法仅通过修改神经网络实现的整体函数的统计量来对曲率进行正则化，并通过 logit 操作避免虚假最小化。此外，我们认为对 SAM 微扰进行预处理也可以防止虚假最小化，并且当与 Functional-SAM 结合使用时，它会进一步提高性能。我们提出的算法在固定长度和 Chinchilla 风格的训练设置中，在经过相同步数的训练后，在各种模型规模（包括十亿参数规模）上显示出优于 AdamW 和 SAM 基线的性能。总体而言，我们的工作突出了更精确表征曲率在将曲率正则化应用于大型语言模型 (LLM) 中的重要性。", "author": "Sidak Pal Singh et.al.", "authors": "Sidak Pal Singh, Hossein Mobahi, Atish Agarwala, Yann Dauphin", "id": "2502.02407v1", "paper_url": "http://arxiv.org/abs/2502.02407v1", "repo": "null"}}