{"2501.08848": {"publish_time": "2025-01-15", "title": "RouteNet-Gauss: Hardware-Enhanced Network Modeling with Machine Learning", "paper_summary": "Network simulation is pivotal in network modeling, assisting with tasks\nranging from capacity planning to performance estimation. Traditional\napproaches such as Discrete Event Simulation (DES) face limitations in terms of\ncomputational cost and accuracy. This paper introduces RouteNet-Gauss, a novel\nintegration of a testbed network with a Machine Learning (ML) model to address\nthese challenges. By using the testbed as a hardware accelerator,\nRouteNet-Gauss generates training datasets rapidly and simulates network\nscenarios with high fidelity to real-world conditions. Experimental results\nshow that RouteNet-Gauss significantly reduces prediction errors by up to 95%\nand achieves a 488x speedup in inference time compared to state-of-the-art\nDES-based methods. RouteNet-Gauss's modular architecture is dynamically\nconstructed based on the specific characteristics of the network scenario, such\nas topology and routing. This enables it to understand and generalize to\ndifferent network configurations beyond those seen during training, including\nnetworks up to 10x larger. Additionally, it supports Temporal Aggregated\nPerformance Estimation (TAPE), providing configurable temporal granularity and\nmaintaining high accuracy in flow performance metrics. This approach shows\npromise in improving both simulation efficiency and accuracy, offering a\nvaluable tool for network operators.", "paper_summary_zh": "網路模擬在網路建模中至關重要，協助執行從容量規劃到效能估計的任務。傳統方法（例如離散事件模擬 (DES)）在運算成本和準確性方面面臨限制。本文介紹 RouteNet-Gauss，一種測試網路與機器學習 (ML) 模型的創新整合，以解決這些挑戰。透過使用測試網路作為硬體加速器，RouteNet-Gauss 能快速產生訓練資料集，並模擬與真實世界條件高度吻合的網路場景。實驗結果顯示，RouteNet-Gauss 將預測誤差顯著降低達 95%，並且與最先進的基於 DES 的方法相比，推理時間加快了 488 倍。RouteNet-Gauss 的模組化架構是根據網路場景的特定特性動態建構的，例如拓撲和路由。這使其能夠理解並概括到訓練期間未見的不同網路組態，包括大至 10 倍的網路。此外，它支援時間聚合效能估計 (TAPE)，提供可設定的時間粒度，並在流量效能指標中維持高準確度。這種方法顯示出在改善模擬效率和準確度方面很有前景，為網路營運商提供了一個有價值的工具。", "author": "Carlos Güemes-Palau et.al.", "authors": "Carlos Güemes-Palau, Miquel Ferriol-Galmés, Jordi Paillisse-Vilanova, Albert López-Brescó, Pere Barlet-Ros, Albert Cabellos-Aparicio", "id": "2501.08848v1", "paper_url": "http://arxiv.org/abs/2501.08848v1", "repo": "null"}}