{"2411.19922": {"publish_time": "2024-11-29", "title": "Dynamic EEG-fMRI mapping: Revealing the relationship between brain connectivity and cognitive state", "paper_summary": "This study investigated the dynamic connectivity patterns between EEG and\nfMRI modalities, contributing to our understanding of brain network\ninteractions. By employing a comprehensive approach that integrated static and\ndynamic analyses of EEG-fMRI data, we were able to uncover distinct\nconnectivity states and characterize their temporal fluctuations. The results\nrevealed modular organization within the intrinsic connectivity networks (ICNs)\nof the brain, highlighting the significant roles of sensory systems and the\ndefault mode network. The use of a sliding window technique allowed us to\nassess how functional connectivity varies over time, further elucidating the\ntransient nature of brain connectivity. Additionally, our findings align with\nprevious literature, reinforcing the notion that cognitive states can be\neffectively identified through short-duration data, specifically within the\n30-60 second timeframe. The established relationships between connectivity\nstrength and cognitive processes, particularly during different visual states,\nunderscore the relevance of our approach for future research into brain\ndynamics. Overall, this study not only enhances our understanding of the\ninterplay between EEG and fMRI signals but also paves the way for further\nexploration into the neural correlates of cognitive functions and their\nimplications in clinical settings. Future research should focus on refining\nthese methodologies and exploring their applications in various cognitive and\nclinical contexts.", "paper_summary_zh": "本研究調查了腦電圖和功能性磁振造影之間的動態連接模式，有助於我們了解腦網路互動。透過採用整合靜態和動態腦電圖功能性磁振造影資料分析的綜合方法，我們得以揭示不同的連接狀態並描述其時間波動。結果顯示腦部內在連接網路 (ICN) 中的模組化組織，突顯了感官系統和預設模式網路的重要角色。滑動視窗技術的使用讓我們得以評估功能性連接如何隨時間變化，進一步闡明腦部連接的暫時性。此外，我們的研究結果與先前的文獻一致，強化了透過短時資料（特別是在 30-60 秒的時間範圍內）可以有效識別認知狀態的概念。連接強度和認知過程之間建立的關係，特別是在不同的視覺狀態下，強調了我們的途徑與未來腦部動態研究相關性。整體而言，本研究不僅增強了我們對腦電圖和功能性磁振造影訊號之間交互作用的理解，也為進一步探索認知功能的神經相關性及其在臨床環境中的意義鋪路。未來的研究應專注於優化這些方法並探討其在各種認知和臨床背景中的應用。", "author": "Guiran Liu et.al.", "authors": "Guiran Liu, Binrong Zhu", "id": "2411.19922v1", "paper_url": "http://arxiv.org/abs/2411.19922v1", "repo": "null"}}