{"2411.07763": {"publish_time": "2024-11-12", "title": "Spider 2.0: Evaluating Language Models on Real-World Enterprise Text-to-SQL Workflows", "paper_summary": "Real-world enterprise text-to-SQL workflows often involve complex cloud or\nlocal data across various database systems, multiple SQL queries in various\ndialects, and diverse operations from data transformation to analytics. We\nintroduce Spider 2.0, an evaluation framework comprising 632 real-world\ntext-to-SQL workflow problems derived from enterprise-level database use cases.\nThe databases in Spider 2.0 are sourced from real data applications, often\ncontaining over 1,000 columns and stored in local or cloud database systems\nsuch as BigQuery and Snowflake. We show that solving problems in Spider 2.0\nfrequently requires understanding and searching through database metadata,\ndialect documentation, and even project-level codebases. This challenge calls\nfor models to interact with complex SQL workflow environments, process\nextremely long contexts, perform intricate reasoning, and generate multiple SQL\nqueries with diverse operations, often exceeding 100 lines, which goes far\nbeyond traditional text-to-SQL challenges. Our evaluations indicate that based\non o1-preview, our code agent framework successfully solves only 17.0% of the\ntasks, compared with 91.2% on Spider 1.0 and 73.0% on BIRD. Our results on\nSpider 2.0 show that while language models have demonstrated remarkable\nperformance in code generation -- especially in prior text-to-SQL benchmarks --\nthey require significant improvement in order to achieve adequate performance\nfor real-world enterprise usage. Progress on Spider 2.0 represents crucial\nsteps towards developing intelligent, autonomous, code agents for real-world\nenterprise settings. Our code, baseline models, and data are available at\nhttps://spider2-sql.github.io.", "paper_summary_zh": "<paragraph>真實世界的企業文字轉 SQL 工作流程通常涉及各種資料庫系統中的複雜雲端或本地資料、各種方言中的多個 SQL 查詢，以及從資料轉換到分析的各種作業。我們介紹 Spider 2.0，一個評估架構，包含 632 個源自企業級資料庫使用案例的真實世界文字轉 SQL 工作流程問題。Spider 2.0 中的資料庫來自真實資料應用程式，通常包含超過 1,000 個欄位，並儲存在本地或雲端資料庫系統中，例如 BigQuery 和 Snowflake。我們顯示，解決 Spider 2.0 中的問題通常需要理解和搜尋資料庫元資料、方言文件，甚至專案層級的程式碼庫。這個挑戰要求模型與複雜的 SQL 工作流程環境互動、處理極長的內容、執行複雜的推理，並產生具有各種作業的多個 SQL 查詢，通常超過 100 行，這遠遠超出了傳統的文字轉 SQL 挑戰。我們的評估表明，根據 o1-preview，我們的程式代理架構僅成功解決了 17.0% 的任務，而 Spider 1.0 為 91.2%，BIRD 為 73.0%。我們在 Spider 2.0 上的結果顯示，雖然語言模型在程式碼產生方面表現出顯著的效能——特別是在先前的文字轉 SQL 基準測試中——但它們需要顯著的改進才能達到足夠的效能，以供真實世界的企業使用。Spider 2.0 的進展代表著朝著為真實世界的企業設定開發智慧型、自主的程式碼代理邁出的關鍵一步。我們的程式碼、基線模型和資料可在 https://spider2-sql.github.io/ 取得。</paragraph>", "author": "Fangyu Lei et.al.", "authors": "Fangyu Lei, Jixuan Chen, Yuxiao Ye, Ruisheng Cao, Dongchan Shin, Hongjin Su, Zhaoqing Suo, Hongcheng Gao, Wenjing Hu, Pengcheng Yin, Victor Zhong, Caiming Xiong, Ruoxi Sun, Qian Liu, Sida Wang, Tao Yu", "id": "2411.07763v1", "paper_url": "http://arxiv.org/abs/2411.07763v1", "repo": "null"}}