{"2407.01916": {"publish_time": "2024-07-02", "title": "Sequential Manipulation Against Rank Aggregation: Theory and Algorithm", "paper_summary": "Rank aggregation with pairwise comparisons is widely encountered in\nsociology, politics, economics, psychology, sports, etc . Given the enormous\nsocial impact and the consequent incentives, the potential adversary has a\nstrong motivation to manipulate the ranking list. However, the ideal attack\nopportunity and the excessive adversarial capability cause the existing methods\nto be impractical. To fully explore the potential risks, we leverage an online\nattack on the vulnerable data collection process. Since it is independent of\nrank aggregation and lacks effective protection mechanisms, we disrupt the data\ncollection process by fabricating pairwise comparisons without knowledge of the\nfuture data or the true distribution. From the game-theoretic perspective, the\nconfrontation scenario between the online manipulator and the ranker who takes\ncontrol of the original data source is formulated as a distributionally robust\ngame that deals with the uncertainty of knowledge. Then we demonstrate that the\nequilibrium in the above game is potentially favorable to the adversary by\nanalyzing the vulnerability of the sampling algorithms such as Bernoulli and\nreservoir methods. According to the above theoretical analysis, different\nsequential manipulation policies are proposed under a Bayesian decision\nframework and a large class of parametric pairwise comparison models. For\nattackers with complete knowledge, we establish the asymptotic optimality of\nthe proposed policies. To increase the success rate of the sequential\nmanipulation with incomplete knowledge, a distributionally robust estimator,\nwhich replaces the maximum likelihood estimation in a saddle point problem,\nprovides a conservative data generation solution. Finally, the corroborating\nempirical evidence shows that the proposed method manipulates the results of\nrank aggregation methods in a sequential manner.", "paper_summary_zh": "配對比較中的排名聚合廣泛存在於社會學、政治學、經濟學、心理學、體育等領域。由於其巨大的社會影響和由此產生的誘因，潛在的對手有強烈的動機去操縱排名列表。然而，理想的攻擊機會和過度的對抗能力導致現有方法不切實際。為了充分探索潛在風險，我們利用線上攻擊對脆弱的數據收集過程進行攻擊。由於它獨立於排名聚合，並且缺乏有效的保護機制，我們在不了解未來數據或真實分佈的情況下，通過捏造配對比較來破壞數據收集過程。從博弈論的角度來看，線上操縱者和控制原始數據源的排名者之間的對抗場景被表述為一個分佈穩健博弈，用於應對知識的不確定性。然後，我們通過分析伯努利和水庫方法等抽樣演算法的脆弱性，證明上述博弈中的均衡對對手可能有利。根據上述理論分析，在貝葉斯決策框架和一大類參數化配對比較模型下，提出了不同的順序操縱策略。對於完全知識的攻擊者，我們建立了所提出策略的漸近最優性。為了提高不完全知識的順序操縱的成功率，一個分佈穩健的估計器（它在鞍點問題中取代了最大似然估計）提供了一個保守的數據生成解決方案。最後，佐證的實證證據表明，所提出的方法以順序的方式操縱排名聚合方法的結果。", "author": "Ke Ma et.al.", "authors": "Ke Ma, Qianqian Xu, Jinshan Zeng, Wei Liu, Xiaochun Cao, Yingfei Sun, Qingming Huang", "id": "2407.01916v1", "paper_url": "http://arxiv.org/abs/2407.01916v1", "repo": "null"}}