{"2502.11886": {"publish_time": "2025-02-17", "title": "LIMR: Less is More for RL Scaling", "paper_summary": "In this paper, we ask: what truly determines the effectiveness of RL training\ndata for enhancing language models' reasoning capabilities? While recent\nadvances like o1, Deepseek R1, and Kimi1.5 demonstrate RL's potential, the lack\nof transparency about training data requirements has hindered systematic\nprogress. Starting directly from base models without distillation, we challenge\nthe assumption that scaling up RL training data inherently improves\nperformance. we demonstrate that a strategically selected subset of just 1,389\nsamples can outperform the full 8,523-sample dataset. We introduce Learning\nImpact Measurement (LIM), an automated method to evaluate and prioritize\ntraining samples based on their alignment with model learning trajectories,\nenabling efficient resource utilization and scalable implementation. Our method\nachieves comparable or even superior performance using only 1,389 samples\nversus the full 8,523 samples dataset. Notably, while recent data-efficient\napproaches (e.g., LIMO and s1) show promise with 32B-scale models, we find it\nsignificantly underperforms at 7B-scale through supervised fine-tuning (SFT).\nIn contrast, our RL-based LIMR achieves 16.7% higher accuracy on AIME24 and\noutperforms LIMO and s1 by 13.0% and 22.2% on MATH500. These results\nfundamentally reshape our understanding of RL scaling in LLMs, demonstrating\nthat precise sample selection, rather than data scale, may be the key to\nunlocking enhanced reasoning capabilities. For reproducible research and future\ninnovation, we are open-sourcing LIMR, including implementation of LIM,\ntraining and evaluation code, curated datasets, and trained models at\nhttps://github.com/GAIR-NLP/LIMR.", "paper_summary_zh": "<paragraph>在這篇論文中，我們提出一個問題：究竟是什麼決定了 RL 訓練資料增強語言模型推理能力的有效性？雖然最近的進展，例如 o1、Deepseek R1 和 Kimi1.5，展示了 RL 的潛力，但缺乏關於訓練資料需求的透明度阻礙了系統化的進展。從沒有蒸餾的基本模型直接開始，我們挑戰了擴充 RL 訓練資料本質上就會提升效能的假設。我們證明，策略性地選出僅 1,389 個樣本的子集就能勝過完整的 8,523 個樣本資料集。我們引入了學習影響力測量 (LIM)，這是一種自動化方法，用來評估和優先處理訓練樣本，根據它們與模型學習軌跡的一致性，能有效利用資源和擴充實作。我們的方法使用僅 1,389 個樣本就能達到與使用完整的 8,523 個樣本資料集相當甚至更佳的效能。值得注意的是，雖然最近資料有效率的方法（例如 LIMO 和 s1）在 32B 規模的模型上展現了前景，但我們發現它在 7B 規模上透過監督微調 (SFT) 的表現大幅落後。相比之下，我們基於 RL 的 LIMR 在 AIME24 上達到了高出 16.7% 的準確度，並在 MATH500 上比 LIMO 和 s1 分別高出 13.0% 和 22.2%。這些結果從根本上改變了我們對 LLM 中 RL 擴充的理解，證明精確的樣本選取，而非資料規模，可能是解鎖增強推理能力的關鍵。為了可重製的研究和未來的創新，我們開放原始碼 LIMR，包括 LIM 的實作、訓練和評估程式碼、策展的資料集，以及在 https://github.com/GAIR-NLP/LIMR 上訓練的模型。</paragraph>", "author": "Xuefeng Li et.al.", "authors": "Xuefeng Li, Haoyang Zou, Pengfei Liu", "id": "2502.11886v1", "paper_url": "http://arxiv.org/abs/2502.11886v1", "repo": "null"}}