{"2405.09713": {"publish_time": "2024-05-15", "title": "SOK-Bench: A Situated Video Reasoning Benchmark with Aligned Open-World Knowledge", "paper_summary": "Learning commonsense reasoning from visual contexts and scenes in real-world\nis a crucial step toward advanced artificial intelligence. However, existing\nvideo reasoning benchmarks are still inadequate since they were mainly designed\nfor factual or situated reasoning and rarely involve broader knowledge in the\nreal world. Our work aims to delve deeper into reasoning evaluations,\nspecifically within dynamic, open-world, and structured context knowledge. We\npropose a new benchmark (SOK-Bench), consisting of 44K questions and 10K\nsituations with instance-level annotations depicted in the videos. The\nreasoning process is required to understand and apply situated knowledge and\ngeneral knowledge for problem-solving. To create such a dataset, we propose an\nautomatic and scalable generation method to generate question-answer pairs,\nknowledge graphs, and rationales by instructing the combinations of LLMs and\nMLLMs. Concretely, we first extract observable situated entities, relations,\nand processes from videos for situated knowledge and then extend to open-world\nknowledge beyond the visible content. The task generation is facilitated\nthrough multiple dialogues as iterations and subsequently corrected and refined\nby our designed self-promptings and demonstrations. With a corpus of both\nexplicit situated facts and implicit commonsense, we generate associated\nquestion-answer pairs and reasoning processes, finally followed by manual\nreviews for quality assurance. We evaluated recent mainstream large\nvision-language models on the benchmark and found several insightful\nconclusions. For more information, please refer to our benchmark at\nwww.bobbywu.com/SOKBench.", "paper_summary_zh": "從真實世界的視覺脈絡和場景中學習常識推理是邁向先進人工智慧的關鍵一步。然而，現有的影片推理基準仍不充足，因為它們主要設計用於事實或情境推理，而且很少涉及現實世界中的廣泛知識。我們的研究旨在深入探討推理評估，特別是在動態、開放世界和結構化脈絡知識中。我們提出一個新的基準 (SOK-Bench)，包含 44K 個問題和 10K 個情況，並在影片中以實例層級註解呈現。推理過程需要理解並應用情境知識和一般知識來解決問題。為了建立這樣的資料集，我們提出一個自動且可擴充的產生方法，透過指導 LLM 和 MLLM 的組合來產生問答對、知識圖譜和依據。具體來說，我們首先從影片中萃取可觀察的情境實體、關係和過程，以取得情境知識，然後擴展到可見內容之外的開放世界知識。任務產生透過多重對話作為反覆運算進行，隨後由我們設計的自提示和示範進行修正和改善。透過包含明確情境事實和隱含常識的語料庫，我們產生相關的問答對和推理過程，最後進行人工審查以確保品質。我們在基準上評估了近期主流的大型視覺語言模型，並發現了幾個有見地的結論。如需更多資訊，請參閱我們的基準：www.bobbywu.com/SOKBench。", "author": "Andong Wang et.al.", "authors": "Andong Wang, Bo Wu, Sunli Chen, Zhenfang Chen, Haotian Guan, Wei-Ning Lee, Li Erran Li, Joshua B Tenenbaum, Chuang Gan", "id": "2405.09713v1", "paper_url": "http://arxiv.org/abs/2405.09713v1", "repo": "null"}}