{"2405.18870": {"publish_time": "2024-05-29", "title": "LLMs achieve adult human performance on higher-order theory of mind tasks", "paper_summary": "This paper examines the extent to which large language models (LLMs) have\ndeveloped higher-order theory of mind (ToM); the human ability to reason about\nmultiple mental and emotional states in a recursive manner (e.g. I think that\nyou believe that she knows). This paper builds on prior work by introducing a\nhandwritten test suite -- Multi-Order Theory of Mind Q&A -- and using it to\ncompare the performance of five LLMs to a newly gathered adult human benchmark.\nWe find that GPT-4 and Flan-PaLM reach adult-level and near adult-level\nperformance on ToM tasks overall, and that GPT-4 exceeds adult performance on\n6th order inferences. Our results suggest that there is an interplay between\nmodel size and finetuning for the realisation of ToM abilities, and that the\nbest-performing LLMs have developed a generalised capacity for ToM. Given the\nrole that higher-order ToM plays in a wide range of cooperative and competitive\nhuman behaviours, these findings have significant implications for user-facing\nLLM applications.", "paper_summary_zh": "本文探討大型語言模型 (LLM) 發展高階心智理論 (ToM) 的程度；人類以遞迴方式推理多種心智與情緒狀態的能力 (例如：我認為你相信她知道)。本文建立在先前的工作上，引入了手寫測試套件 -- 多階心智理論問答 -- 並使用它來比較五個 LLM 的效能與新收集的成人人類基準。我們發現 GPT-4 和 Flan-PaLM 在 ToM 任務上整體達到成人等級和接近成人等級的效能，而 GPT-4 在第 6 階推理上超過成人效能。我們的結果表明，模型大小和微調對於實現 ToM 能力之間存在交互作用，並且效能最佳的 LLM 已發展出廣義的 ToM 能力。考量到高階 ToM 在廣泛的合作和競爭人類行為中所扮演的角色，這些發現對使用者導向的 LLM 應用程式具有重要的意義。", "author": "Winnie Street et.al.", "authors": "Winnie Street, John Oliver Siy, Geoff Keeling, Adrien Baranes, Benjamin Barnett, Michael McKibben, Tatenda Kanyere, Alison Lentz, Blaise Aguera y Arcas, Robin I. M. Dunbar", "id": "2405.18870v1", "paper_url": "http://arxiv.org/abs/2405.18870v1", "repo": "null"}}