{"2407.19721": {"publish_time": "2024-07-29", "title": "Rina: Enhancing Ring-AllReduce with In-network Aggregation in Distributed Model Training", "paper_summary": "Parameter Server (PS) and Ring-AllReduce (RAR) are two widely utilized\nsynchronization architectures in multi-worker Deep Learning (DL), also referred\nto as Distributed Deep Learning (DDL). However, PS encounters challenges with\nthe ``incast'' issue, while RAR struggles with problems caused by the long\ndependency chain. The emerging In-network Aggregation (INA) has been proposed\nto integrate with PS to mitigate its incast issue. However, such PS-based INA\nhas poor incremental deployment abilities as it requires replacing all the\nswitches to show significant performance improvement, which is not\ncost-effective. In this study, we present the incorporation of INA capabilities\ninto RAR, called RAR with In-Network Aggregation (Rina), to tackle both the\nproblems above. Rina features its agent-worker mechanism. When an INA-capable\nToR switch is deployed, all workers in this rack run as one abstracted worker\nwith the help of the agent, resulting in both excellent incremental deployment\ncapabilities and better throughput. We conducted extensive testbed and\nsimulation evaluations to substantiate the throughput advantages of Rina over\nexisting DDL training synchronization structures. Compared with the\nstate-of-the-art PS-based INA methods ATP, Rina can achieve more than 50\\%\nthroughput with the same hardware cost.", "paper_summary_zh": "參數伺服器 (PS) 和環形全歸約 (RAR) 是多工作者深度學習 (DL) 中廣泛使用的兩種同步架構，也稱為分布式深度學習 (DDL)。然而，PS 在「內投」問題上遇到挑戰，而 RAR 則在長依賴鏈造成的問題上苦苦掙扎。新興的網路內聚合 (INA) 已被提出與 PS 整合以減輕其內投問題。然而，這種基於 PS 的 INA 具有較差的增量部署能力，因為它需要更換所有交換器才能顯示出顯著的效能提升，這並不具有成本效益。在本研究中，我們提出將 INA 功能整合到 RAR 中，稱為具有網路內聚合的 RAR (Rina)，以解決上述兩個問題。Rina 具備其代理工作者機制。當部署了具有 INA 功能的 ToR 交換器時，此機架中的所有工作者在代理的幫助下作為一個抽象工作者執行，從而同時具有出色的增量部署能力和更好的吞吐量。我們進行了廣泛的測試平台和模擬評估，以證實 Rina 在現有 DDL 訓練同步結構中具有吞吐量優勢。與最先進的基於 PS 的 INA 方法 ATP 相比，Rina 在相同的硬體成本下可以實現超過 50% 的吞吐量。", "author": "Zixuan Chen et.al.", "authors": "Zixuan Chen, Xuandong Liu, Minglin Li, Yinfan Hu, Hao Mei, Huifeng Xing, Hao Wang, Wanxin Shi, Sen Liu, Yang Xu", "id": "2407.19721v1", "paper_url": "http://arxiv.org/abs/2407.19721v1", "repo": "null"}}