{"2503.06828": {"publish_time": "2025-03-10", "title": "Towards a Multimodal MRI-Based Foundation Model for Multi-Level Feature Exploration in Segmentation, Molecular Subtyping, and Grading of Glioma", "paper_summary": "Accurate, noninvasive glioma characterization is crucial for effective\nclinical management. Traditional methods, dependent on invasive tissue\nsampling, often fail to capture the spatial heterogeneity of the tumor. While\ndeep learning has improved segmentation and molecular profiling, few approaches\nsimultaneously integrate tumor morphology and molecular features. Foundation\ndeep learning models, which learn robust, task-agnostic representations from\nlarge-scale datasets, hold great promise but remain underutilized in glioma\nimaging biomarkers. We propose the Multi-Task SWIN-UNETR (MTS-UNET) model, a\nnovel foundation-based framework built on the BrainSegFounder model, pretrained\non large-scale neuroimaging data. MTS-UNET simultaneously performs glioma\nsegmentation, histological grading, and molecular subtyping (IDH mutation and\n1p/19q co-deletion). It incorporates two key modules: Tumor-Aware Feature\nEncoding (TAFE) for multi-scale, tumor-focused feature extraction and\nCross-Modality Differential (CMD) for highlighting subtle T2-FLAIR mismatch\nsignals associated with IDH mutation. The model was trained and validated on a\ndiverse, multi-center cohort of 2,249 glioma patients from seven public\ndatasets. MTS-UNET achieved a mean Dice score of 84% for segmentation, along\nwith AUCs of 90.58% for IDH mutation, 69.22% for 1p/19q co-deletion prediction,\nand 87.54% for grading, significantly outperforming baseline models (p<=0.05).\nAblation studies validated the essential contributions of the TAFE and CMD\nmodules and demonstrated the robustness of the framework. The foundation-based\nMTS-UNET model effectively integrates tumor segmentation with multi-level\nclassification, exhibiting strong generalizability across diverse MRI datasets.\nThis framework shows significant potential for advancing noninvasive,\npersonalized glioma management by improving predictive accuracy and\ninterpretability.", "paper_summary_zh": "<paragraph>準確、非侵入性的膠質瘤表徵對於有效的臨床管理至關重要。傳統方法依賴侵入性組織採樣，通常無法捕捉腫瘤的空間異質性。雖然深度學習改進了分割和分子分析，但很少有方法能同時整合腫瘤形態學和分子特徵。基礎深度學習模型，從大規模數據集中學習穩健的、與任務無關的表徵，具有很大的前景，但在膠質瘤影像生物標記中仍未得到充分利用。我們提出了多任務 SWIN-UNETR (MTS-UNET) 模型，這是一個基於 BrainSegFounder 模型的新型基礎框架，在大型神經影像數據上進行了預訓練。MTS-UNET 同時執行膠質瘤分割、組織學分級和分子分型（IDH 突變和 1p/19q 共缺失）。它包含兩個關鍵模塊：用於多尺度、腫瘤聚焦特徵提取的腫瘤感知特徵編碼 (TAFE) 和用於突出顯示與 IDH 突變相關的細微 T2-FLAIR 不匹配信號的跨模態差異 (CMD)。該模型在來自七個公共數據集的 2,249 名膠質瘤患者的多樣化、多中心隊列上進行了訓練和驗證。MTS-UNET 的平均 Dice 分數為 84%，用於分割，同時 IDH 突變的 AUC 為 90.58%，1p/19q 共缺失預測的 AUC 為 69.22%，分級的 AUC 為 87.54%，顯著優於基準模型 (p<=0.05)。消融研究驗證了 TAFE 和 CMD 模塊的重要貢獻，並證明了該框架的穩健性。基於基礎的 MTS-UNET 模型有效地將腫瘤分割與多級分類相結合，在不同的 MRI 數據集中展現出強大的泛化能力。該框架通過提高預測準確性和可解釋性，顯示出在推進非侵入性、個性化膠質瘤管理方面的巨大潛力。\n</paragraph>\n", "author": "Somayeh Farahani et.al.", "authors": "Somayeh Farahani, Marjaneh Hejazi, Antonio Di Ieva, Emad Fatemizadeh, Sidong Liu", "id": "2503.06828v1", "paper_url": "http://arxiv.org/abs/2503.06828v1", "repo": "null"}}