{"2502.09992": {"publish_time": "2025-02-14", "title": "Large Language Diffusion Models", "paper_summary": "Autoregressive models (ARMs) are widely regarded as the cornerstone of large\nlanguage models (LLMs). We challenge this notion by introducing LLaDA, a\ndiffusion model trained from scratch under the pre-training and supervised\nfine-tuning (SFT) paradigm. LLaDA models distributions through a forward data\nmasking process and a reverse process, parameterized by a vanilla Transformer\nto predict masked tokens. By optimizing a likelihood bound, it provides a\nprincipled generative approach for probabilistic inference. Across extensive\nbenchmarks, LLaDA demonstrates strong scalability, outperforming our\nself-constructed ARM baselines. Remarkably, LLaDA 8B is competitive with strong\nLLMs like LLaMA3 8B in in-context learning and, after SFT, exhibits impressive\ninstruction-following abilities in case studies such as multi-turn dialogue.\nMoreover, LLaDA addresses the reversal curse, surpassing GPT-4o in a reversal\npoem completion task. Our findings establish diffusion models as a viable and\npromising alternative to ARMs, challenging the assumption that key LLM\ncapabilities discussed above are inherently tied to ARMs.", "paper_summary_zh": "自回归模型 (ARM) 被广泛认为是大型语言模型 (LLM) 的基石。我们通过引入 LLaDA 来挑战这一概念，LLaDA 是一种在预训练和监督微调 (SFT) 范例下从头开始训练的扩散模型。LLaDA 通过正向数据掩蔽过程和反向过程对分布建模，由一个香草 Transformer 参数化以预测被掩蔽的标记。通过优化似然界，它为概率推理提供了一种原则性的生成方法。在广泛的基准测试中，LLaDA 表现出很强的可扩展性，优于我们自己构建的 ARM 基线。值得注意的是，LLaDA 8B 在上下文学习中与 LLaMA3 8B 等强大的 LLM 具有竞争力，并且在 SFT 之后，在多轮对话等案例研究中表现出令人印象深刻的指令遵循能力。此外，LLaDA 解决了解析诅咒，在反向诗歌完成任务中超越了 GPT-4o。我们的发现将扩散模型确立为 ARM 的可行且有前途的替代方案，挑战了上述关键 LLM 能力本质上与 ARM 相关联的假设。", "author": "Shen Nie et.al.", "authors": "Shen Nie, Fengqi Zhu, Zebin You, Xiaolu Zhang, Jingyang Ou, Jun Hu, Jun Zhou, Yankai Lin, Ji-Rong Wen, Chongxuan Li", "id": "2502.09992v1", "paper_url": "http://arxiv.org/abs/2502.09992v1", "repo": "null"}}