{"2406.11757": {"publish_time": "2024-06-17", "title": "STAR: SocioTechnical Approach to Red Teaming Language Models", "paper_summary": "This research introduces STAR, a sociotechnical framework that improves on\ncurrent best practices for red teaming safety of large language models. STAR\nmakes two key contributions: it enhances steerability by generating\nparameterised instructions for human red teamers, leading to improved coverage\nof the risk surface. Parameterised instructions also provide more detailed\ninsights into model failures at no increased cost. Second, STAR improves signal\nquality by matching demographics to assess harms for specific groups, resulting\nin more sensitive annotations. STAR further employs a novel step of arbitration\nto leverage diverse viewpoints and improve label reliability, treating\ndisagreement not as noise but as a valuable contribution to signal quality.", "paper_summary_zh": "本研究引入了 STAR，一種社會技術框架，改進了大型語言模型紅隊安全性的現有最佳實務。STAR 做出兩項主要貢獻：它透過為人類紅隊員產生參數化指令來增強可導向性，進而改善風險表面的覆蓋範圍。參數化指令也以無增加成本的方式提供更詳細的模型失敗見解。其次，STAR 透過比對人口統計資料來評估特定群體的危害，進而改善信號品質，產生更靈敏的註解。STAR 進一步採用一種新穎的仲裁步驟，以利用不同的觀點並改善標籤可靠性，將分歧視為信號品質的寶貴貢獻，而不是雜訊。", "author": "Laura Weidinger et.al.", "authors": "Laura Weidinger, John Mellor, Bernat Guillen Pegueroles, Nahema Marchal, Ravin Kumar, Kristian Lum, Canfer Akbulut, Mark Diaz, Stevie Bergman, Mikel Rodriguez, Verena Rieser, William Isaac", "id": "2406.11757v1", "paper_url": "http://arxiv.org/abs/2406.11757v1", "repo": "null"}}