{"2408.10865": {"publish_time": "2024-08-20", "title": "Multi-agent Multi-armed Bandits with Stochastic Sharable Arm Capacities", "paper_summary": "Motivated by distributed selection problems, we formulate a new variant of\nmulti-player multi-armed bandit (MAB) model, which captures stochastic arrival\nof requests to each arm, as well as the policy of allocating requests to\nplayers. The challenge is how to design a distributed learning algorithm such\nthat players select arms according to the optimal arm pulling profile (an arm\npulling profile prescribes the number of players at each arm) without\ncommunicating to each other. We first design a greedy algorithm, which locates\none of the optimal arm pulling profiles with a polynomial computational\ncomplexity. We also design an iterative distributed algorithm for players to\ncommit to an optimal arm pulling profile with a constant number of rounds in\nexpectation. We apply the explore then commit (ETC) framework to address the\nonline setting when model parameters are unknown. We design an exploration\nstrategy for players to estimate the optimal arm pulling profile. Since such\nestimates can be different across different players, it is challenging for\nplayers to commit. We then design an iterative distributed algorithm, which\nguarantees that players can arrive at a consensus on the optimal arm pulling\nprofile in only M rounds. We conduct experiments to validate our algorithm.", "paper_summary_zh": "受分布式选择问题启发，我们制定了一个新的多玩家多臂赌博机 (MAB) 模型，该模型捕获了到达每个手臂的请求的随机到达，以及将请求分配给玩家的策略。挑战在于如何设计一个分布式学习算法，以便玩家根据最优手臂拉取配置文件（手臂拉取配置文件规定每个手臂的玩家数量）选择手臂，而无需相互通信。我们首先设计了一个贪心算法，该算法以多项式计算复杂度找到一个最优手臂拉取配置文件。我们还设计了一个迭代分布式算法，让玩家在期望的恒定轮数内提交一个最优手臂拉取配置文件。我们应用探索然后提交 (ETC) 框架来解决模型参数未知时的在线设置。我们设计了一个探索策略，让玩家估计最优手臂拉取配置文件。由于此类估计在不同玩家之间可能不同，因此玩家提交具有挑战性。然后，我们设计了一个迭代分布式算法，该算法保证玩家可以在仅 M 轮中就最优手臂拉取配置文件达成共识。我们进行实验来验证我们的算法。", "author": "Hong Xie et.al.", "authors": "Hong Xie, Jinyu Mo, Defu Lian, Jie Wang, Enhong Chen", "id": "2408.10865v1", "paper_url": "http://arxiv.org/abs/2408.10865v1", "repo": "null"}}