{"2410.09024": {"publish_time": "2024-10-11", "title": "AgentHarm: A Benchmark for Measuring Harmfulness of LLM Agents", "paper_summary": "The robustness of LLMs to jailbreak attacks, where users design prompts to\ncircumvent safety measures and misuse model capabilities, has been studied\nprimarily for LLMs acting as simple chatbots. Meanwhile, LLM agents -- which\nuse external tools and can execute multi-stage tasks -- may pose a greater risk\nif misused, but their robustness remains underexplored. To facilitate research\non LLM agent misuse, we propose a new benchmark called AgentHarm. The benchmark\nincludes a diverse set of 110 explicitly malicious agent tasks (440 with\naugmentations), covering 11 harm categories including fraud, cybercrime, and\nharassment. In addition to measuring whether models refuse harmful agentic\nrequests, scoring well on AgentHarm requires jailbroken agents to maintain\ntheir capabilities following an attack to complete a multi-step task. We\nevaluate a range of leading LLMs, and find (1) leading LLMs are surprisingly\ncompliant with malicious agent requests without jailbreaking, (2) simple\nuniversal jailbreak templates can be adapted to effectively jailbreak agents,\nand (3) these jailbreaks enable coherent and malicious multi-step agent\nbehavior and retain model capabilities. We publicly release AgentHarm to enable\nsimple and reliable evaluation of attacks and defenses for LLM-based agents. We\npublicly release the benchmark at\nhttps://huggingface.co/ai-safety-institute/AgentHarm.", "paper_summary_zh": "大型語言模型在越獄攻擊中的強健性，也就是使用者設計提示以規避安全措施並濫用模型功能，主要針對充當簡單聊天機器人的大型語言模型進行研究。同時，使用外部工具且可以執行多階段任務的大型語言模型代理，如果被濫用可能會造成更大的風險，但其強健性仍未被充分探討。為了促進對大型語言模型代理濫用的研究，我們提出了一個名為 AgentHarm 的新基準。此基準包含一組多樣化的 110 個明確惡意的代理任務（包含增強功能後為 440 個），涵蓋 11 個危害類別，包括詐騙、網路犯罪和騷擾。除了衡量模型是否拒絕有害的代理請求外，在 AgentHarm 上獲得高分需要越獄代理在攻擊後仍能維持其能力以完成多步驟任務。我們評估了一系列領先的大型語言模型，並發現（1）領先的大型語言模型在沒有越獄的情況下驚人地符合惡意代理請求，（2）簡單的通用越獄範本可以適應有效越獄代理，以及（3）這些越獄允許連貫且惡意的多步驟代理行為並保留模型功能。我們公開發布 AgentHarm，以簡化且可靠地評估大型語言模型代理的攻擊和防禦。我們在 https://huggingface.co/ai-safety-institute/AgentHarm 公開發布基準。", "author": "Maksym Andriushchenko et.al.", "authors": "Maksym Andriushchenko, Alexandra Souly, Mateusz Dziemian, Derek Duenas, Maxwell Lin, Justin Wang, Dan Hendrycks, Andy Zou, Zico Kolter, Matt Fredrikson, Eric Winsor, Jerome Wynne, Yarin Gal, Xander Davies", "id": "2410.09024v1", "paper_url": "http://arxiv.org/abs/2410.09024v1", "repo": "null"}}