{"2501.01821": {"publish_time": "2025-01-03", "title": "SDPO: Segment-Level Direct Preference Optimization for Social Agents", "paper_summary": "Social agents powered by large language models (LLMs) can simulate human\nsocial behaviors but fall short in handling complex goal-oriented social\ndialogues. Direct Preference Optimization (DPO) has proven effective in\naligning LLM behavior with human preferences across a variety of agent tasks.\nExisting DPO-based approaches for multi-turn interactions are divided into\nturn-level and session-level methods. The turn-level method is overly\nfine-grained, focusing exclusively on individual turns, while session-level\nmethods are too coarse-grained, often introducing training noise. To address\nthese limitations, we propose Segment-Level Direct Preference Optimization\n(SDPO), which focuses on specific key segments within interactions to optimize\nmulti-turn agent behavior while minimizing training noise. Evaluations on the\nSOTOPIA benchmark demonstrate that SDPO-tuned agents consistently outperform\nboth existing DPO-based methods and proprietary LLMs like GPT-4o, underscoring\nSDPO's potential to advance the social intelligence of LLM-based agents. We\nrelease our code and data at\nhttps://github.com/AlibabaResearch/DAMO-ConvAI/tree/main/SDPO.", "paper_summary_zh": "大型語言模型（LLM）驅動的社交代理可以模擬人類社交行為，但在處理複雜目標導向的社交對話時卻力有未逮。直接偏好最佳化（DPO）已被證明能有效地將 LLM 行為與人類偏好對齊，適用於各種代理任務。現有的基於 DPO 的多輪互動方法分為輪次級別和會話級別方法。輪次級別方法過於細緻，僅專注於個別輪次，而會話級別方法則過於粗略，通常會引入訓練噪音。為了解決這些限制，我們提出了區段級別直接偏好最佳化（SDPO），它專注於互動中的特定關鍵區段，以最佳化多輪代理行為，同時最小化訓練噪音。在 SOTOPIA 基準上的評估表明，經過 SDPO 調整的代理始終優於現有的基於 DPO 的方法和 GPT-4o 等專有 LLM，這凸顯了 SDPO 在提升基於 LLM 的代理的社交智能方面的潛力。我們在 https://github.com/AlibabaResearch/DAMO-ConvAI/tree/main/SDPO 上發布我們的程式碼和資料。", "author": "Aobo Kong et.al.", "authors": "Aobo Kong, Wentao Ma, Shiwan Zhao, Yongbin Li, Yuchuan Wu, Ke Wang, Xiaoqian Liu, Qicheng Li, Yong Qin, Fei Huang", "id": "2501.01821v1", "paper_url": "http://arxiv.org/abs/2501.01821v1", "repo": "null"}}