{"2412.15504": {"publish_time": "2024-12-20", "title": "Mitigating Social Bias in Large Language Models: A Multi-Objective Approach within a Multi-Agent Framework", "paper_summary": "Natural language processing (NLP) has seen remarkable advancements with the\ndevelopment of large language models (LLMs). Despite these advancements, LLMs\noften produce socially biased outputs. Recent studies have mainly addressed\nthis problem by prompting LLMs to behave ethically, but this approach results\nin unacceptable performance degradation. In this paper, we propose a\nmulti-objective approach within a multi-agent framework (MOMA) to mitigate\nsocial bias in LLMs without significantly compromising their performance. The\nkey idea of MOMA involves deploying multiple agents to perform causal\ninterventions on bias-related contents of the input questions, breaking the\nshortcut connection between these contents and the corresponding answers.\nUnlike traditional debiasing techniques leading to performance degradation,\nMOMA substantially reduces bias while maintaining accuracy in downstream tasks.\nOur experiments conducted on two datasets and two models demonstrate that MOMA\nreduces bias scores by up to 87.7%, with only a marginal performance\ndegradation of up to 6.8% in the BBQ dataset. Additionally, it significantly\nenhances the multi-objective metric icat in the StereoSet dataset by up to\n58.1%. Code will be made available at https://github.com/Cortantse/MOMA.", "paper_summary_zh": "自然語言處理 (NLP) 隨著大型語言模型 (LLM) 的發展而有了顯著的進步。儘管有這些進步，LLM 經常產生社會偏見的輸出。最近的研究主要透過提示 LLM 以符合道德的方式來解決這個問題，但這種方法導致了無法接受的效能下降。在本文中，我們提出了一個多主體架構 (MOMA) 內的多目標方法，以減輕 LLM 中的社會偏見，而不會顯著損害其效能。MOMA 的關鍵思想涉及部署多個主體，對輸入問題中與偏見相關的內容執行因果干預，打破這些內容與對應答案之間的捷徑連接。與導致效能下降的傳統去偏見技術不同，MOMA 在維持下游任務準確性的同時，大幅減少了偏見。我們在兩個資料集和兩個模型上進行的實驗表明，MOMA 將偏見分數降低了 87.7%，在 BBQ 資料集中的效能下降幅度僅為 6.8%。此外，它在 StereoSet 資料集中將多目標指標 icat 大幅提升了 58.1%。程式碼將在 https://github.com/Cortantse/MOMA 上提供。", "author": "Zhenjie Xu et.al.", "authors": "Zhenjie Xu, Wenqing Chen, Yi Tang, Xuanying Li, Cheng Hu, Zhixuan Chu, Kui Ren, Zibin Zheng, Zhichao Lu", "id": "2412.15504v1", "paper_url": "http://arxiv.org/abs/2412.15504v1", "repo": "null"}}