{"2502.05239": {"publish_time": "2025-02-07", "title": "Enhancing Knowledge Graph Construction: Evaluating with Emphasis on Hallucination, Omission, and Graph Similarity Metrics", "paper_summary": "Recent advancements in large language models have demonstrated significant\npotential in the automated construction of knowledge graphs from unstructured\ntext. This paper builds upon our previous work [16], which evaluated various\nmodels using metrics like precision, recall, F1 score, triple matching, and\ngraph matching, and introduces a refined approach to address the critical\nissues of hallucination and omission. We propose an enhanced evaluation\nframework incorporating BERTScore for graph similarity, setting a practical\nthreshold of 95% for graph matching. Our experiments focus on the Mistral\nmodel, comparing its original and fine-tuned versions in zero-shot and few-shot\nsettings. We further extend our experiments using examples from the KELM-sub\ntraining dataset, illustrating that the fine-tuned model significantly improves\nknowledge graph construction accuracy while reducing the exact hallucination\nand omission. However, our findings also reveal that the fine-tuned models\nperform worse in generalization tasks on the KELM-sub dataset. This study\nunderscores the importance of comprehensive evaluation metrics in advancing the\nstate-of-the-art in knowledge graph construction from textual data.", "paper_summary_zh": "大型語言模型的最新進展已證明在從非結構化文字自動建構知識圖譜方面具有顯著的潛力。本文建立在我們先前的研究 [16] 之上，該研究使用準確度、召回率、F1 分數、三元組匹配和圖形匹配等指標評估各種模型，並引入了一種改進的方法來解決幻覺和遺漏的關鍵問題。我們提出一個增強的評估框架，結合 BERTScore 來進行圖形相似性，並將圖形匹配的實際閾值設定為 95%。我們的實驗重點在 Mistral 模型上，比較其原始版本和微調版本在零次學習和少量學習的設定中。我們進一步使用 KELM-sub 訓練資料集中的範例來擴展我們的實驗，說明微調後的模型顯著提高了知識圖譜建構的準確度，同時減少了精確的幻覺和遺漏。然而，我們的研究結果也顯示，微調後的模型在 KELM-sub 資料集上的泛化任務表現較差。這項研究強調了全面評估指標在推進從文字資料建構知識圖譜的最新技術方面的重要性。", "author": "Hussam Ghanem et.al.", "authors": "Hussam Ghanem, Christophe Cruz", "id": "2502.05239v1", "paper_url": "http://arxiv.org/abs/2502.05239v1", "repo": "null"}}