{"2501.13984": {"publish_time": "2025-01-23", "title": "Comprehensive Modeling and Question Answering of Cancer Clinical Practice Guidelines using LLMs", "paper_summary": "The updated recommendations on diagnostic procedures and treatment pathways\nfor a medical condition are documented as graphical flows in Clinical Practice\nGuidelines (CPGs). For effective use of the CPGs in helping medical\nprofessionals in the treatment decision process, it is necessary to fully\ncapture the guideline knowledge, particularly the contexts and their\nrelationships in the graph. While several existing works have utilized these\nguidelines to create rule bases for Clinical Decision Support Systems, limited\nwork has been done toward directly capturing the full medical knowledge\ncontained in CPGs. This work proposes an approach to create a contextually\nenriched, faithful digital representation of National Comprehensive Cancer\nNetwork (NCCN) Cancer CPGs in the form of graphs using automated extraction and\nnode & relationship classification. We also implement semantic enrichment of\nthe model by using Large Language Models (LLMs) for node classification,\nachieving an accuracy of 80.86% and 88.47% with zero-shot learning and few-shot\nlearning, respectively. Additionally, we introduce a methodology for answering\nnatural language questions with constraints to guideline text by leveraging\nLLMs to extract the relevant subgraph from the guideline knowledge base. By\ngenerating natural language answers based on subgraph paths and semantic\ninformation, we mitigate the risk of incorrect answers and hallucination\nassociated with LLMs, ensuring factual accuracy in medical domain Question\nAnswering.", "paper_summary_zh": "已更新的醫療狀況診斷程序和治療途徑建議，以臨床實務指南 (CPG) 中的圖形流程記錄。為了有效使用 CPG 協助醫療專業人員進行治療決策，必須完整擷取指南知識，特別是圖表中的脈絡及其關係。雖然現有許多研究已利用這些指南為臨床決策支援系統建立規則基礎，但直接擷取 CPG 中包含的完整醫療知識的工作卻有限。這項研究提出了一種方法，以自動化擷取和節點與關係分類的方式，建立脈絡豐富、忠實的國家綜合癌症網路 (NCCN) 癌症 CPG 圖形數位表示。我們也透過使用大型語言模型 (LLM) 進行節點分類，實作模型的語意豐富化，分別在零次學習和少次學習中達到 80.86% 和 88.47% 的準確度。此外，我們引進了一種方法，透過運用 LLM 從指南知識庫中擷取相關子圖，來回答具有指南文字限制的自然語言問題。透過根據子圖路徑和語意資訊產生自然語言答案，我們降低了與 LLM 相關的錯誤答案和幻覺風險，確保了醫療領域問題解答中的事實準確性。", "author": "Bhumika Gupta et.al.", "authors": "Bhumika Gupta, Pralaypati Ta, Keerthi Ram, Mohanasankar Sivaprakasam", "id": "2501.13984v1", "paper_url": "http://arxiv.org/abs/2501.13984v1", "repo": "null"}}