{"2412.02058": {"publish_time": "2024-12-03", "title": "BN-AuthProf: Benchmarking Machine Learning for Bangla Author Profiling on Social Media Texts", "paper_summary": "Author profiling, the analysis of texts to uncover attributes such as gender\nand age of the author, has become essential with the widespread use of social\nmedia platforms. This paper focuses on author profiling in the Bangla language,\naiming to extract valuable insights about anonymous authors based on their\nwriting style on social media. The primary objective is to introduce and\nbenchmark the performance of machine learning approaches on a newly created\nBangla Author Profiling dataset, BN-AuthProf. The dataset comprises 30,131\nsocial media posts from 300 authors, labeled by their age and gender. Authors'\nidentities and sensitive information were anonymized to ensure privacy. Various\nclassical machine learning and deep learning techniques were employed to\nevaluate the dataset. For gender classification, the best accuracy achieved was\n80% using Support Vector Machine (SVM), while a Multinomial Naive Bayes (MNB)\nclassifier achieved the best F1 score of 0.756. For age classification, MNB\nattained a maximum accuracy score of 91% with an F1 score of 0.905. This\nresearch highlights the effectiveness of machine learning in gender and age\nclassification for Bangla author profiling, with practical implications\nspanning marketing, security, forensic linguistics, education, and criminal\ninvestigations, considering privacy and biases.", "paper_summary_zh": "作者描繪，文本分析以揭露作者的屬性，例如性別\n與年齡，已隨著社群媒體平台的廣泛使用而變得必要。本文專注於孟加拉語的作者描繪，\n旨在根據作者在社群媒體上的寫作風格，萃取關於匿名作者的寶貴見解。主要目標是介紹並\n基準機器學習方法在一個新建立的孟加拉語作者描繪資料集 BN-AuthProf 上的表現。資料集包含來自 300 位作者的 30,131 篇社群媒體貼文，並標記了他們的年齡和性別。作者的\n身分和敏感資訊已匿名化以確保隱私。採用了各種傳統機器學習和深度學習技術來\n評估資料集。對於性別分類，使用支援向量機 (SVM) 達到了 80% 的最佳準確度，而多項式樸素貝氏 (MNB)\n分類器達到了 0.756 的最佳 F1 分數。對於年齡分類，MNB 達到了 91% 的最大準確度分數，F1 分數為 0.905。本\n研究強調了機器學習在孟加拉語作者描繪中的性別和年齡分類的有效性，並考慮了隱私和偏差，涵蓋了行銷、安全、法庭語言學、教育和犯罪\n調查的實際應用。", "author": "Raisa Tasnim et.al.", "authors": "Raisa Tasnim, Mehanaz Chowdhury, Md Ataur Rahman", "id": "2412.02058v1", "paper_url": "http://arxiv.org/abs/2412.02058v1", "repo": "null"}}