{"2410.14508": {"publish_time": "2024-10-18", "title": "LEAD: Latent Realignment for Human Motion Diffusion", "paper_summary": "Our goal is to generate realistic human motion from natural language. Modern\nmethods often face a trade-off between model expressiveness and text-to-motion\nalignment. Some align text and motion latent spaces but sacrifice\nexpressiveness; others rely on diffusion models producing impressive motions,\nbut lacking semantic meaning in their latent space. This may compromise\nrealism, diversity, and applicability. Here, we address this by combining\nlatent diffusion with a realignment mechanism, producing a novel, semantically\nstructured space that encodes the semantics of language. Leveraging this\ncapability, we introduce the task of textual motion inversion to capture novel\nmotion concepts from a few examples. For motion synthesis, we evaluate LEAD on\nHumanML3D and KIT-ML and show comparable performance to the state-of-the-art in\nterms of realism, diversity, and text-motion consistency. Our qualitative\nanalysis and user study reveal that our synthesized motions are sharper, more\nhuman-like and comply better with the text compared to modern methods. For\nmotion textual inversion, our method demonstrates improved capacity in\ncapturing out-of-distribution characteristics in comparison to traditional\nVAEs.", "paper_summary_zh": "我们的目标是根据自然语言生成逼真的真人动作。现代方法通常会在模型表现力与文本到动作的比对之间面临权衡。一些方法比对了文本和动作的潜在空间，但牺牲了表现力；其他方法依靠扩散模型来制作令人印象深刻的动作，但其潜在空间缺乏语义含义。这可能会损害真实性、多样性和适用性。在这里，我们通过将潜在扩散与重新比对机制相结合来解决这个问题，从而生成一个新颖的、语义结构化的空间，对语言的语义进行编码。利用这种能力，我们引入了文本动作反演任务，以从几个示例中捕捉新颖的动作概念。对于动作合成，我们在 HumanML3D 和 KIT-ML 上评估了 LEAD，并展示了与最先进技术相当的性能，包括真实性、多样性和文本动作一致性。我们的定性分析和用户研究表明，与现代方法相比，我们合成的动作更清晰、更像真人，并且与文本的吻合度更高。对于动作文本反演，我们的方法在捕捉分布外特征方面展示了比传统 VAE 更强的能力。", "author": "Nefeli Andreou et.al.", "authors": "Nefeli Andreou, Xi Wang, Victoria Fernández Abrevaya, Marie-Paule Cani, Yiorgos Chrysanthou, Vicky Kalogeiton", "id": "2410.14508v1", "paper_url": "http://arxiv.org/abs/2410.14508v1", "repo": "null"}}