{"2406.11670": {"publish_time": "2024-06-17", "title": "Benchmarking of LLM Detection: Comparing Two Competing Approaches", "paper_summary": "This article gives an overview of the field of LLM text recognition.\nDifferent approaches and implemented detectors for the recognition of\nLLM-generated text are presented. In addition to discussing the\nimplementations, the article focuses on benchmarking the detectors. Although\nthere are numerous software products for the recognition of LLM-generated text,\nwith a focus on ChatGPT-like LLMs, the quality of the recognition (recognition\nrate) is not clear. Furthermore, while it can be seen that scientific\ncontributions presenting their novel approaches strive for some kind of\ncomparison with other approaches, the construction and independence of the\nevaluation dataset is often not comprehensible. As a result, discrepancies in\nthe performance evaluation of LLM detectors are often visible due to the\ndifferent benchmarking datasets. This article describes the creation of an\nevaluation dataset and uses this dataset to investigate the different\ndetectors. The selected detectors are benchmarked against each other.", "paper_summary_zh": "本文概述了 LLM 文本识别的领域。\n介绍了用于识别 LLM 生成的文本的不同方法和已实现的检测器。除了讨论\n实现之外，本文重点关注检测器的基准测试。虽然\n有许多用于识别 LLM 生成的文本的软件产品，\n专注于类似 ChatGPT 的 LLM，但识别质量（识别\n率）尚不清楚。此外，虽然可以看出科学\n贡献者在提出其新方法时努力与其他方法进行某种\n比较，但评估数据集的构建和独立性通常难以理解。因此，由于\n不同的基准数据集，LLM 检测器的性能评估中经常会出现差异。本文介绍了评估数据集的创建，并使用此数据集来调查不同的\n检测器。选定的检测器相互进行基准测试。", "author": "Thorsten Pröhl et.al.", "authors": "Thorsten Pröhl, Erik Putzier, Rüdiger Zarnekow", "id": "2406.11670v1", "paper_url": "http://arxiv.org/abs/2406.11670v1", "repo": "null"}}