{"2412.12641": {"publish_time": "2024-12-17", "title": "Lagrangian Index Policy for Restless Bandits with Average Reward", "paper_summary": "We study the Lagrangian Index Policy (LIP) for restless multi-armed bandits\nwith long-run average reward. In particular, we compare the performance of LIP\nwith the performance of the Whittle Index Policy (WIP), both heuristic policies\nknown to be asymptotically optimal under certain natural conditions. Even\nthough in most cases their performances are very similar, in the cases when WIP\nshows bad performance, LIP continues to perform very well. We then propose\nreinforcement learning algorithms, both tabular and NN-based, to obtain online\nlearning schemes for LIP in the model-free setting. The proposed reinforcement\nlearning schemes for LIP requires significantly less memory than the analogous\nscheme for WIP. We calculate analytically the Lagrangian index for the restart\nmodel, which describes the optimal web crawling and the minimization of the\nweighted age of information. We also give a new proof of asymptotic optimality\nin case of homogeneous bandits as the number of arms goes to infinity, based on\nexchangeability and de Finetti's theorem.", "paper_summary_zh": "我們研究具有長期平均獎勵的不安分多臂賭徒的拉格朗日指數政策 (LIP)。特別是，我們將 LIP 的效能與惠特爾指數政策 (WIP) 的效能進行比較，這兩種啟發式政策已知在某些自然條件下在漸近上是最佳的。儘管在大多數情況下它們的效能非常相似，但在 WIP 表現不佳的情況下，LIP 仍能持續表現得很好。然後，我們提出表格和基於 NN 的強化學習演算法，以在無模型設定中取得 LIP 的線上學習方案。LIP 的建議強化學習方案所需的記憶體顯著少於 WIP 的類似方案。我們分析計算重新啟動模型的拉格朗日指數，它描述了最佳網路爬取和加權資訊年齡的最小化。我們還根據可交換性和 de Finetti 定理，給出齊次賭徒在手臂數量趨於無限時漸近最佳性的新證明。", "author": "Konstantin Avrachenkov et.al.", "authors": "Konstantin Avrachenkov, Vivek S. Borkar, Pratik Shah", "id": "2412.12641v1", "paper_url": "http://arxiv.org/abs/2412.12641v1", "repo": "null"}}