{"2410.05094": {"publish_time": "2024-10-07", "title": "On the Structure of Game Provenance and its Applications", "paper_summary": "Provenance in databases has been thoroughly studied for positive and for\nrecursive queries, then for first-order (FO) queries, i.e., having negation but\nno recursion. Query evaluation can be understood as a two-player game where the\nopponents argue whether or not a tuple is in the query answer. This\ngame-theoretic approach yields a natural provenance model for FO queries,\nunifying how and why-not provenance. Here, we study the fine-grain structure of\ngame provenance. A game $G=(V,E)$ consists of positions $V$ and moves $E$ and\ncan be solved by computing the well-founded model of a single, unstratifiable\nrule: \\[ \\text{win}(X) \\leftarrow \\text{move}(X, Y), \\neg \\, \\text{win}(Y). \\]\nIn the solved game $G^{\\lambda}$, the value of a position $x\\,{\\in}\\,V$ is\neither won, lost, or drawn. This value is explained by the provenance\n$\\mathscr{P}$(x), i.e., certain (annotated) edges reachable from $x$. We\nidentify seven edge types that give rise to new kinds of provenance, i.e.,\npotential, actual, and primary, and demonstrate that \"not all moves are created\nequal\". We describe the new provenance types, show how they can be computed\nwhile solving games, and discuss applications, e.g., for abstract argumentation\nframeworks.", "paper_summary_zh": "<paragraph>資料庫中的來源已針對正向和遞迴查詢進行徹底研究，然後針對一階 (FO) 查詢（即具有否定但沒有遞迴）進行研究。查詢評估可以理解為一個雙人遊戲，對手爭論元組是否在查詢答案中。這種博弈論方法產生了 FO 查詢的自然來源模型，統一了如何和為何不來源。在此，我們研究了遊戲來源的細粒度結構。遊戲 $G=(V,E)$ 包含位置 $V$ 和移動 $E$，並且可以透過計算單一、不可分層規則的良好基礎模型來解決：\\[\\text{win}(X) \\leftarrow \\text{move}(X, Y), \\neg \\, \\text{win}(Y). \\]在已解決的遊戲 $G^{\\lambda}$ 中，位置 $x\\,{\\in}\\,V$ 的值可以是獲勝、失敗或平手。此值由來源 $\\mathscr{P}$(x) 來解釋，即從 $x$ 可到達的特定（註解）邊緣。我們識別出七種類型的邊緣，這些邊緣產生了新類型的來源，即潛在、實際和主要，並證明「並非所有移動都是平等的」。我們描述了新的來源類型，展示了如何在解決遊戲時計算它們，並討論應用，例如抽象論證框架。</paragraph>", "author": "Shawn Bowers et.al.", "authors": "Shawn Bowers, Yilin Xia, Bertram Ludäscher", "id": "2410.05094v1", "paper_url": "http://arxiv.org/abs/2410.05094v1", "repo": "null"}}