{"2412.13161": {"publish_time": "2024-12-17", "title": "BanglishRev: A Large-Scale Bangla-English and Code-mixed Dataset of Product Reviews in E-Commerce", "paper_summary": "This work presents the BanglishRev Dataset, the largest e-commerce product\nreview dataset to date for reviews written in Bengali, English, a mixture of\nboth and Banglish, Bengali words written with English alphabets. The dataset\ncomprises of 1.74 million written reviews from 3.2 million ratings information\ncollected from a total of 128k products being sold in online e-commerce\nplatforms targeting the Bengali population. It includes an extensive array of\nrelated metadata for each of the reviews including the rating given by the\nreviewer, date the review was posted and date of purchase, number of likes,\ndislikes, response from the seller, images associated with the review etc. With\nsentiment analysis being the most prominent usage of review datasets,\nexperimentation with a binary sentiment analysis model with the review rating\nserving as an indicator of positive or negative sentiment was conducted to\nevaluate the effectiveness of the large amount of data presented in BanglishRev\nfor sentiment analysis tasks. A BanglishBERT model is trained on the data from\nBanglishRev with reviews being considered labeled positive if the rating is\ngreater than 3 and negative if the rating is less than or equal to 3. The model\nis evaluated by being testing against a previously published manually annotated\ndataset for e-commerce reviews written in a mixture of Bangla, English and\nBanglish. The experimental model achieved an exceptional accuracy of 94\\% and\nF1 score of 0.94, demonstrating the dataset's efficacy for sentiment analysis.\nSome of the intriguing patterns and observations seen within the dataset and\nfuture research directions where the dataset can be utilized is also discussed\nand explored. The dataset can be accessed through\nhttps://huggingface.co/datasets/BanglishRev/bangla-english-and-code-mixed-ecommerce-review-dataset.", "paper_summary_zh": "<paragraph>這項工作呈現了 BanglishRev 資料集，這是迄今為止最大的電子商務產品評論資料集，用於以孟加拉語、英語、孟加拉語和英語的混合以及孟加拉語（用英語字母書寫的孟加拉語單字）撰寫的評論。該資料集包含來自 128k 個產品的 320 萬個評分資訊中撰寫的 174 萬個評論，這些產品在針對孟加拉人口的線上電子商務平台上銷售。它包含每個評論的大量相關元資料，包括評論者給出的評分、評論發布日期和購買日期、按讚數、不按讚數、賣方的回應、與評論相關的圖片等。由於情緒分析是評論資料集最突出的用途，因此使用二元情緒分析模型進行實驗，其中評論評分作為正面或負面情緒的指標，以評估 BanglishRev 中呈現的大量資料在情緒分析任務中的有效性。BanglishBERT 模型在 BanglishRev 中的資料上訓練，如果評分大於 3，則評論被視為正面，如果評分小於或等於 3，則被視為負面。該模型的評估方式是針對先前發布的手動註解資料集進行測試，該資料集包含用孟加拉語、英語和孟加拉語混合撰寫的電子商務評論。實驗模型達到了 94% 的出色準確率和 0.94 的 F1 分數，證明了該資料集在情緒分析中的功效。還討論和探討了資料集中看到的一些有趣模式和觀察結果，以及可以利用該資料集的未來研究方向。該資料集可透過 https://huggingface.co/datasets/BanglishRev/bangla-english-and-code-mixed-ecommerce-review-dataset 存取。</paragraph>", "author": "Mohammad Nazmush Shamael et.al.", "authors": "Mohammad Nazmush Shamael, Sabila Nawshin, Swakkhar Shatabda, Salekul Islam", "id": "2412.13161v1", "paper_url": "http://arxiv.org/abs/2412.13161v1", "repo": "null"}}