{"2501.02997": {"publish_time": "2025-01-06", "title": "CALM: Curiosity-Driven Auditing for Large Language Models", "paper_summary": "Auditing Large Language Models (LLMs) is a crucial and challenging task. In\nthis study, we focus on auditing black-box LLMs without access to their\nparameters, only to the provided service. We treat this type of auditing as a\nblack-box optimization problem where the goal is to automatically uncover\ninput-output pairs of the target LLMs that exhibit illegal, immoral, or unsafe\nbehaviors. For instance, we may seek a non-toxic input that the target LLM\nresponds to with a toxic output or an input that induces the hallucinative\nresponse from the target LLM containing politically sensitive individuals. This\nblack-box optimization is challenging due to the scarcity of feasible points,\nthe discrete nature of the prompt space, and the large search space. To address\nthese challenges, we propose Curiosity-Driven Auditing for Large Language\nModels (CALM), which uses intrinsically motivated reinforcement learning to\nfinetune an LLM as the auditor agent to uncover potential harmful and biased\ninput-output pairs of the target LLM. CALM successfully identifies derogatory\ncompletions involving celebrities and uncovers inputs that elicit specific\nnames under the black-box setting. This work offers a promising direction for\nauditing black-box LLMs. Our code is available at\nhttps://github.com/x-zheng16/CALM.git.", "paper_summary_zh": "審核大型語言模型 (LLM) 是一項至關重要且具有挑戰性的任務。在此研究中，我們專注於審核沒有存取其參數的黑箱 LLM，僅存取提供的服務。我們將此類型的審核視為一個黑箱最佳化問題，目標是自動找出目標 LLM 的輸入輸出對，這些輸入輸出對表現出非法、不道德或不安全的行為。例如，我們可能會尋找一個非有害輸入，目標 LLM 對其做出有害輸出，或者一個輸入，它會引發目標 LLM 產生包含政治敏感個體的幻覺回應。此黑箱最佳化具有挑戰性，原因在於可行點的稀少性、提示空間的離散性質以及龐大的搜尋空間。為了應對這些挑戰，我們提出了大型語言模型的好奇心驅動審核 (CALM)，它使用內在動機的強化學習來微調 LLM，作為審核代理，以找出目標 LLM 潛在的有害和有偏見的輸入輸出對。CALM 成功找出涉及名人的貶義完成，並找出在黑箱設定下引發特定名稱的輸入。這項工作為審核黑箱 LLM 提供了一個有希望的方向。我們的程式碼可在 https://github.com/x-zheng16/CALM.git 取得。", "author": "Xiang Zheng et.al.", "authors": "Xiang Zheng, Longxiang Wang, Yi Liu, Xingjun Ma, Chao Shen, Cong Wang", "id": "2501.02997v1", "paper_url": "http://arxiv.org/abs/2501.02997v1", "repo": "null"}}