{"2412.14846": {"publish_time": "2024-12-19", "title": "Head and Neck Tumor Segmentation of MRI from Pre- and Mid-radiotherapy with Pre-training, Data Augmentation and Dual Flow UNet", "paper_summary": "Head and neck tumors and metastatic lymph nodes are crucial for treatment\nplanning and prognostic analysis. Accurate segmentation and quantitative\nanalysis of these structures require pixel-level annotation, making automated\nsegmentation techniques essential for the diagnosis and treatment of head and\nneck cancer. In this study, we investigated the effects of multiple strategies\non the segmentation of pre-radiotherapy (pre-RT) and mid-radiotherapy (mid-RT)\nimages. For the segmentation of pre-RT images, we utilized: 1) a fully\nsupervised learning approach, and 2) the same approach enhanced with\npre-trained weights and the MixUp data augmentation technique. For mid-RT\nimages, we introduced a novel computational-friendly network architecture that\nfeatures separate encoders for mid-RT images and registered pre-RT images with\ntheir labels. The mid-RT encoder branch integrates information from pre-RT\nimages and labels progressively during the forward propagation. We selected the\nhighest-performing model from each fold and used their predictions to create an\nensemble average for inference. In the final test, our models achieved a\nsegmentation performance of 82.38% for pre-RT and 72.53% for mid-RT on\naggregated Dice Similarity Coefficient (DSC) as HiLab. Our code is available at\nhttps://github.com/WltyBY/HNTS-MRG2024_train_code.", "paper_summary_zh": "頭頸部腫瘤和轉移淋巴結對於治療計畫和預後分析至關重要。這些結構的準確分割和定量分析需要像素級註解，使自動分割技術對於頭頸癌的診斷和治療至關重要。在本研究中，我們探討了多種策略對放射治療前 (pre-RT) 和放射治療中期 (mid-RT) 影像分割的影響。對於放射治療前影像的分割，我們利用：1）完全監督式學習方法，以及 2）使用預訓練權重和 MixUp 資料擴充技術增強的相同方法。對於放射治療中期影像，我們引入了一個新穎的計算友好型網路架構，其特點是為放射治療中期影像和註冊的放射治療前影像及其標籤提供了單獨的編碼器。放射治療中期編碼器分支在正向傳播過程中逐步整合來自放射治療前影像和標籤的資訊。我們從每個區塊中選出效能最高的模型，並使用其預測值建立一個集合平均值以進行推論。在最後的測試中，我們的模型在 HiLab 上的預測表現對於放射治療前影像為 82.38%，對於放射治療中期影像為 72.53%，以聚合的 Dice 相似性係數 (DSC) 為準。我們的程式碼可以在 https://github.com/WltyBY/HNTS-MRG2024_train_code 取得。", "author": "Litingyu Wang et.al.", "authors": "Litingyu Wang, Wenjun Liao, Shichuan Zhang, Guotai Wang", "id": "2412.14846v1", "paper_url": "http://arxiv.org/abs/2412.14846v1", "repo": "https://github.com/wltyby/hnts-mrg2024_train_code"}}