{"2411.04981": {"publish_time": "2024-11-07", "title": "Enhancing Reverse Engineering: Investigating and Benchmarking Large Language Models for Vulnerability Analysis in Decompiled Binaries", "paper_summary": "Security experts reverse engineer (decompile) binary code to identify\ncritical security vulnerabilities. The limited access to source code in vital\nsystems - such as firmware, drivers, and proprietary software used in Critical\nInfrastructures (CI) - makes this analysis even more crucial on the binary\nlevel. Even with available source code, a semantic gap persists after\ncompilation between the source and the binary code executed by the processor.\nThis gap may hinder the detection of vulnerabilities in source code. That being\nsaid, current research on Large Language Models (LLMs) overlooks the\nsignificance of decompiled binaries in this area by focusing solely on source\ncode. In this work, we are the first to empirically uncover the substantial\nsemantic limitations of state-of-the-art LLMs when it comes to analyzing\nvulnerabilities in decompiled binaries, largely due to the absence of relevant\ndatasets. To bridge the gap, we introduce DeBinVul, a novel decompiled binary\ncode vulnerability dataset. Our dataset is multi-architecture and\nmulti-optimization, focusing on C/C++ due to their wide usage in CI and\nassociation with numerous vulnerabilities. Specifically, we curate 150,872\nsamples of vulnerable and non-vulnerable decompiled binary code for the task of\n(i) identifying; (ii) classifying; (iii) describing vulnerabilities; and (iv)\nrecovering function names in the domain of decompiled binaries. Subsequently,\nwe fine-tune state-of-the-art LLMs using DeBinVul and report on a performance\nincrease of 19%, 24%, and 21% in the capabilities of CodeLlama, Llama3, and\nCodeGen2 respectively, in detecting binary code vulnerabilities. Additionally,\nusing DeBinVul, we report a high performance of 80-90% on the vulnerability\nclassification task. Furthermore, we report improved performance in function\nname recovery and vulnerability description tasks.", "paper_summary_zh": "<paragraph>安全專家逆向工程（反編譯）二進制程式碼，以找出關鍵的安全漏洞。在重要系統（例如韌體、驅動程式和關鍵基礎設施 (CI) 中使用的專有軟體）中，對原始碼的存取有限，這使得在二進制層級進行此分析變得更加重要。即使有原始碼可用，在編譯後，原始碼和處理器執行的二進制程式碼之間仍存在語意差距。此差距可能會阻礙在原始碼中偵測漏洞。話雖如此，目前對大型語言模型 (LLM) 的研究忽略了反編譯二進制程式碼在此領域的重要性，因為它們只專注於原始碼。在這項工作中，我們率先憑經驗揭露最先進的 LLM 在分析反編譯二進制程式碼中的漏洞時存在大量的語意限制，這主要是因為缺乏相關的資料集。為了彌補這個差距，我們引入了 DeBinVul，這是一個新穎的反編譯二進制程式碼漏洞資料集。我們的資料集是多架構和多最佳化的，由於 C/C++ 在 CI 中廣泛使用且與許多漏洞相關，因此我們專注於 C/C++。具體來說，我們策劃了 150,872 個有漏洞和無漏洞的反編譯二進制程式碼範例，用於 (i) 識別；(ii) 分類；(iii) 描述漏洞；以及 (iv) 在反編譯二進制程式碼的領域中復原函式名稱。隨後，我們使用 DeBinVul 微調最先進的 LLM，並報告 CodeLlama、Llama3 和 CodeGen2 在偵測二進制程式碼漏洞方面的能力分別提升了 19%、24% 和 21%。此外，使用 DeBinVul，我們報告了在漏洞分類任務中 80-90% 的高性能。此外，我們報告了函式名稱復原和漏洞描述任務的效能提升。</paragraph>", "author": "Dylan Manuel et.al.", "authors": "Dylan Manuel, Nafis Tanveer Islam, Joseph Khoury, Ana Nunez, Elias Bou-Harb, Peyman Najafirad", "id": "2411.04981v1", "paper_url": "http://arxiv.org/abs/2411.04981v1", "repo": "null"}}