{"2411.17123": {"publish_time": "2024-11-26", "title": "Advancing Content Moderation: Evaluating Large Language Models for Detecting Sensitive Content Across Text, Images, and Videos", "paper_summary": "The widespread dissemination of hate speech, harassment, harmful and sexual\ncontent, and violence across websites and media platforms presents substantial\nchallenges and provokes widespread concern among different sectors of society.\nGovernments, educators, and parents are often at odds with media platforms\nabout how to regulate, control, and limit the spread of such content.\nTechnologies for detecting and censoring the media contents are a key solution\nto addressing these challenges. Techniques from natural language processing and\ncomputer vision have been used widely to automatically identify and filter out\nsensitive content such as offensive languages, violence, nudity, and addiction\nin both text, images, and videos, enabling platforms to enforce content\npolicies at scale. However, existing methods still have limitations in\nachieving high detection accuracy with fewer false positives and false\nnegatives. Therefore, more sophisticated algorithms for understanding the\ncontext of both text and image may open rooms for improvement in content\ncensorship to build a more efficient censorship system. In this paper, we\nevaluate existing LLM-based content moderation solutions such as OpenAI\nmoderation model and Llama-Guard3 and study their capabilities to detect\nsensitive contents. Additionally, we explore recent LLMs such as GPT, Gemini,\nand Llama in identifying inappropriate contents across media outlets. Various\ntextual and visual datasets like X tweets, Amazon reviews, news articles, human\nphotos, cartoons, sketches, and violence videos have been utilized for\nevaluation and comparison. The results demonstrate that LLMs outperform\ntraditional techniques by achieving higher accuracy and lower false positive\nand false negative rates. This highlights the potential to integrate LLMs into\nwebsites, social media platforms, and video-sharing services for regulatory and\ncontent moderation purposes.", "paper_summary_zh": "仇恨言論、騷擾、有害和性內容以及暴力在網站和媒體平台上的廣泛傳播對社會各個階層提出了重大的挑戰，並引起了廣泛的關注。政府、教育工作者和家長經常與媒體平台就如何規範、控制和限制此類內容的傳播發生分歧。檢測和審查媒體內容的技術是應對這些挑戰的關鍵解決方案。自然語言處理和電腦視覺技術已被廣泛用於自動識別和過濾敏感內容，例如攻擊性語言、暴力、裸露和成癮，無論是文本、圖像還是影片，使平台能夠大規模執行內容政策。然而，現有方法在以較少的誤報和漏報實現高檢測準確性方面仍然存在局限性。因此，更複雜的演算法用於理解文本和圖像的背景，可能會為內容審查的改進打開空間，以建立更有效的審查系統。在本文中，我們評估了現有的基於 LLM 的內容審核解決方案，例如 OpenAI 審核模型和 Llama-Guard3，並研究它們檢測敏感內容的能力。此外，我們探索了 GPT、Gemini 和 Llama 等最近的 LLM，以識別媒體機構中不適當的內容。各種文本和視覺資料集，例如 X 推文、亞馬遜評論、新聞文章、人像照片、卡通、素描和暴力影片已被用於評估和比較。結果表明，LLM 通過實現更高的準確性和更低的誤報和漏報率，優於傳統技術。這突出了將 LLM 整合到網站、社交媒體平台和影片分享服務中以進行監管和內容審核目的的潛力。", "author": "Nouar AlDahoul et.al.", "authors": "Nouar AlDahoul, Myles Joshua Toledo Tan, Harishwar Reddy Kasireddy, Yasir Zaki", "id": "2411.17123v1", "paper_url": "http://arxiv.org/abs/2411.17123v1", "repo": "null"}}