{"2408.13282": {"publish_time": "2024-08-26", "title": "Question answering system of bridge design specification based on large language model", "paper_summary": "This paper constructs question answering system for bridge design\nspecification based on large language model. Three implementation schemes are\ntried: full fine-tuning of the Bert pretrained model, parameter-efficient\nfine-tuning of the Bert pretrained model, and self-built language model from\nscratch. Through the self-built question and answer task dataset, based on the\ntensorflow and keras deep learning platform framework, the model is constructed\nand trained to predict the start position and end position of the answer in the\nbridge design specification given by the user. The experimental results show\nthat full fine-tuning of the Bert pretrained model achieves 100% accuracy in\nthe training-dataset, validation-dataset and test-dataset, and the system can\nextract the answers from the bridge design specification given by the user to\nanswer various questions of the user; While parameter-efficient fine-tuning of\nthe Bert pretrained model and self-built language model from scratch perform\nwell in the training-dataset, their generalization ability in the test-dataset\nneeds to be improved. The research of this paper provides a useful reference\nfor the development of question answering system in professional field.", "paper_summary_zh": "本文建立了基于大语言模型的桥梁设计规范问答系统。尝试了三种实现方案：Bert 预训练模型的完全微调、Bert 预训练模型的参数高效微调，以及从头开始构建自建语言模型。通过自建的问答任务数据集，基于 tensorflow 和 keras 深度学习平台框架，构建并训练模型，以预测用户给定的桥梁设计规范中答案的开始位置和结束位置。实验结果表明，Bert 预训练模型的完全微调在训练数据集、验证数据集和测试数据集中均达到 100% 的准确率，并且该系统可以从用户给定的桥梁设计规范中提取答案，以回答用户的各种问题；而 Bert 预训练模型的参数高效微调和从头开始构建的自建语言模型在训练数据集中表现良好，但在测试数据集中其泛化能力有待提高。本文的研究为专业领域问答系统的发展提供了有益的参考。", "author": "Leye Zhang et.al.", "authors": "Leye Zhang, Xiangxiang Tian, Hongjun Zhang", "id": "2408.13282v1", "paper_url": "http://arxiv.org/abs/2408.13282v1", "repo": "https://github.com/zhangleye/Bridge-LLM-QA"}}