{"2408.10197": {"publish_time": "2024-08-19", "title": "Demystifying the Communication Characteristics for Distributed Transformer Models", "paper_summary": "Deep learning (DL) models based on the transformer architecture have\nrevolutionized many DL applications such as large language models (LLMs),\nvision transformers, audio generation, and time series prediction. Much of this\nprogress has been fueled by distributed training, yet distributed communication\nremains a substantial bottleneck to training progress. This paper examines the\ncommunication behavior of transformer models - that is, how different\nparallelism schemes used in multi-node/multi-GPU DL Training communicate data\nin the context of transformers. We use GPT-based language models as a case\nstudy of the transformer architecture due to their ubiquity. We validate the\nempirical results obtained from our communication logs using analytical models.\nAt a high level, our analysis reveals a need to optimize small message\npoint-to-point communication further, correlations between sequence length,\nper-GPU throughput, model size, and optimizations used, and where to\npotentially guide further optimizations in framework and HPC middleware design\nand optimization.", "paper_summary_zh": "基於Transformer架構的深度學習 (DL) 模型已徹底改革許多 DL 應用程式，例如大型語言模型 (LLM)、視覺Transformer、音訊產生和時間序列預測。這項進展在很大程度上是由於分散式訓練所推動，然而，分散式通訊仍然是訓練進展的一大瓶頸。本文探討Transformer模型的通訊行為，也就是在多節點/多 GPU DL 訓練中，使用於多重平行處理方案如何通訊Transformer中的資料。由於 GPT-based 語言模型普遍存在，因此我們使用它們作為Transformer架構的案例研究。我們使用分析模型驗證從通訊記錄中取得的經驗結果。在高層級中，我們的分析顯示需要進一步最佳化小型訊息點對點通訊、序列長度、每個 GPU 處理量、模型大小和所使用的最佳化之間的關聯性，以及在架構和 HPC 中間軟體設計和最佳化中潛在引導進一步最佳化的位置。", "author": "Quentin Anthony et.al.", "authors": "Quentin Anthony, Benjamin Michalowicz, Jacob Hatef, Lang Xu, Mustafa Abduljabbar, Aamir Shafi, Hari Subramoni, Dhabaleswar Panda", "id": "2408.10197v1", "paper_url": "http://arxiv.org/abs/2408.10197v1", "repo": "null"}}