{"2501.00779": {"publish_time": "2025-01-01", "title": "REM: A Scalable Reinforced Multi-Expert Framework for Multiplex Influence Maximization", "paper_summary": "In social online platforms, identifying influential seed users to maximize\ninfluence spread is a crucial as it can greatly diminish the cost and efforts\nrequired for information dissemination. While effective, traditional methods\nfor Multiplex Influence Maximization (MIM) have reached their performance\nlimits, prompting the emergence of learning-based approaches. These novel\nmethods aim for better generalization and scalability for more sizable graphs\nbut face significant challenges, such as (1) inability to handle unknown\ndiffusion patterns and (2) reliance on high-quality training samples. To\naddress these issues, we propose the Reinforced Expert Maximization framework\n(REM). REM leverages a Propagation Mixture of Experts technique to encode\ndynamic propagation of large multiplex networks effectively in order to\ngenerate enhanced influence propagation. Noticeably, REM treats a generative\nmodel as a policy to autonomously generate different seed sets and learn how to\nimprove them from a Reinforcement Learning perspective. Extensive experiments\non several real-world datasets demonstrate that REM surpasses state-of-the-art\nmethods in terms of influence spread, scalability, and inference time in\ninfluence maximization tasks.", "paper_summary_zh": "在社交線上平台中，找出有影響力的種子用戶以最大化影響力傳播至關重要，因為它可以大幅降低資訊傳播所需的成本和精力。雖然有效，但傳統的多重影響最大化 (MIM) 方法已達到其效能極限，促使學習型方法的出現。這些新穎的方法旨在針對規模更大的圖形進行更好的概括和擴充，但面臨重大挑戰，例如 (1) 無法處理未知的傳播模式和 (2) 依賴於高品質的訓練樣本。為了解決這些問題，我們提出了強化專家最大化框架 (REM)。REM 利用專家傳播混合技術有效編碼大型多重網路的動態傳播，以產生增強的影響力傳播。值得注意的是，REM 將生成模型視為一種政策，以自主產生不同的種子集，並從強化學習的角度學習如何改進它們。在多個真實世界資料集上的廣泛實驗證明，REM 在影響力傳播、可擴充性和影響力最大化任務中的推論時間方面都超越了最先進的方法。", "author": "Huyen Nguyen et.al.", "authors": "Huyen Nguyen, Hieu Dam, Nguyen Do, Cong Tran, Cuong Pham", "id": "2501.00779v1", "paper_url": "http://arxiv.org/abs/2501.00779v1", "repo": "null"}}