{"2406.09136": {"publish_time": "2024-06-13", "title": "Chain of Preference Optimization: Improving Chain-of-Thought Reasoning in LLMs", "paper_summary": "The recent development of chain-of-thought (CoT) decoding has enabled large\nlanguage models (LLMs) to generate explicit logical reasoning paths for complex\nproblem-solving. However, research indicates that these paths are not always\ndeliberate and optimal. The tree-of-thought (ToT) method employs tree-searching\nto extensively explore the reasoning space and find better reasoning paths that\nCoT decoding might overlook. This deliberation, however, comes at the cost of\nsignificantly increased inference complexity. In this work, we demonstrate that\nfine-tuning LLMs leveraging the search tree constructed by ToT allows CoT to\nachieve similar or better performance, thereby avoiding the substantial\ninference burden. This is achieved through Chain of Preference Optimization\n(CPO), where LLMs are fine-tuned to align each step of the CoT reasoning paths\nwith those of ToT using the inherent preference information in the tree-search\nprocess. Extensive experimental results show that CPO significantly improves\nLLM performance in solving a variety of complex problems, including question\nanswering, fact verification, and arithmetic reasoning, demonstrating its\neffectiveness. Our code is available at https://github.com/sail-sg/CPO.", "paper_summary_zh": "最近鏈式思考 (CoT) 解碼的發展，讓大型語言模型 (LLM) 能夠為複雜問題解決產生明確的邏輯推理路徑。然而，研究表明，這些路徑並不總是深思熟慮且最佳的。思考樹 (ToT) 方法採用樹狀搜尋來廣泛探索推理空間，並找到 CoT 解碼可能忽略的更佳推理路徑。然而，這種深思熟慮是以大幅增加推理複雜性為代價的。在這項工作中，我們證明了微調利用 ToT 建構的搜尋樹的 LLM，讓 CoT 能夠達成類似或更好的效能，從而避免大量的推理負擔。這是透過偏好鏈最佳化 (CPO) 來實現的，其中 LLM 被微調，以使用樹狀搜尋過程中固有的偏好資訊，將 CoT 推理路徑的每一步與 ToT 的路徑對齊。大量的實驗結果顯示，CPO 大幅提升了 LLM 在解決各種複雜問題時的效能，包括問題回答、事實驗證和算術推理，證明了它的有效性。我們的程式碼可在 https://github.com/sail-sg/CPO 取得。", "author": "Xuan Zhang et.al.", "authors": "Xuan Zhang, Chao Du, Tianyu Pang, Qian Liu, Wei Gao, Min Lin", "id": "2406.09136v1", "paper_url": "http://arxiv.org/abs/2406.09136v1", "repo": "https://github.com/sail-sg/cpo"}}