{"2410.23126": {"publish_time": "2024-10-30", "title": "Provably Optimal Memory Capacity for Modern Hopfield Models: Transformer-Compatible Dense Associative Memories as Spherical Codes", "paper_summary": "We study the optimal memorization capacity of modern Hopfield models and\nKernelized Hopfield Models (KHMs), a transformer-compatible class of Dense\nAssociative Memories. We present a tight analysis by establishing a connection\nbetween the memory configuration of KHMs and spherical codes from information\ntheory. Specifically, we treat the stored memory set as a specialized spherical\ncode. This enables us to cast the memorization problem in KHMs into a point\narrangement problem on a hypersphere. We show that the optimal capacity of KHMs\noccurs when the feature space allows memories to form an optimal spherical\ncode. This unique perspective leads to: (i) An analysis of how KHMs achieve\noptimal memory capacity, and identify corresponding necessary conditions.\nImportantly, we establish an upper capacity bound that matches the well-known\nexponential lower bound in the literature. This provides the first tight and\noptimal asymptotic memory capacity for modern Hopfield models. (ii) A\nsub-linear time algorithm $\\mathtt{U}\\text{-}\\mathtt{Hop}$+ to reach KHMs'\noptimal capacity. (iii) An analysis of the scaling behavior of the required\nfeature dimension relative to the number of stored memories. These efforts\nimprove both the retrieval capability of KHMs and the representation learning\nof corresponding transformers. Experimentally, we provide thorough numerical\nresults to back up theoretical findings.", "paper_summary_zh": "我們研究現代 Hopfield 模型和核化 Hopfield 模型 (KHM) 的最佳記憶容量，這是一個與Transformer相容的稠密聯想記憶類別。我們透過建立 KHM 的記憶體組態與資訊理論中的球形碼之間的連結，提出嚴謹的分析。具體來說，我們將儲存的記憶體組視為一個特殊的球形碼。這使我們能夠將 KHM 中的記憶體問題轉換為超球面上的點排列問題。我們證明 KHM 的最佳容量發生在特徵空間允許記憶體形成最佳球形碼時。這個獨特的觀點導致：(i) 對 KHM 如何達到最佳記憶體容量的分析，並找出對應的必要條件。重要的是，我們建立了一個容量上限，與文獻中著名的指數下限相匹配。這為現代 Hopfield 模型提供了第一個嚴謹且最佳的漸近記憶體容量。(ii) 一個次線性時間演算法 $\\mathtt{U}\\text{-}\\mathtt{Hop}$+，以達到 KHM 的最佳容量。(iii) 對所需特徵維度相對於儲存記憶體數量的縮放行為的分析。這些努力同時改善了 KHM 的檢索能力和對應Transformer的表徵學習。在實驗中，我們提供了詳盡的數值結果，以支持理論發現。", "author": "Jerry Yao-Chieh Hu et.al.", "authors": "Jerry Yao-Chieh Hu, Dennis Wu, Han Liu", "id": "2410.23126v1", "paper_url": "http://arxiv.org/abs/2410.23126v1", "repo": "null"}}