{"2412.18424": {"publish_time": "2024-12-24", "title": "LongDocURL: a Comprehensive Multimodal Long Document Benchmark Integrating Understanding, Reasoning, and Locating", "paper_summary": "Large vision language models (LVLMs) have improved the document understanding\ncapabilities remarkably, enabling the handling of complex document elements,\nlonger contexts, and a wider range of tasks. However, existing document\nunderstanding benchmarks have been limited to handling only a small number of\npages and fail to provide a comprehensive analysis of layout elements locating.\nIn this paper, we first define three primary task categories: Long Document\nUnderstanding, numerical Reasoning, and cross-element Locating, and then\npropose a comprehensive benchmark, LongDocURL, integrating above three primary\ntasks and comprising 20 sub-tasks categorized based on different primary tasks\nand answer evidences. Furthermore, we develop a semi-automated construction\npipeline and collect 2,325 high-quality question-answering pairs, covering more\nthan 33,000 pages of documents, significantly outperforming existing\nbenchmarks. Subsequently, we conduct comprehensive evaluation experiments on\nboth open-source and closed-source models across 26 different configurations,\nrevealing critical performance gaps in this field.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 已顯著提升文件理解能力，能處理複雜的文件元素、較長的脈絡以及更廣泛的任務。然而，現有的文件理解基準僅限於處理少數頁面，且無法提供版面元素定位的全面分析。在本文中，我們首先定義三個主要的任務類別：長文件理解、數字推理和跨元素定位，然後提出一個全面的基準 LongDocURL，整合上述三個主要任務並包含 20 個子任務，根據不同的主要任務和答案證據進行分類。此外，我們開發了一個半自動化建構管道，並收集了 2,325 個高品質問答對，涵蓋超過 33,000 頁的文件，大幅優於現有的基準。隨後，我們對 26 種不同配置的開源和閉源模型進行全面的評估實驗，揭露了此領域的關鍵效能差距。", "author": "Chao Deng et.al.", "authors": "Chao Deng, Jiale Yuan, Pi Bu, Peijie Wang, Zhong-Zhi Li, Jian Xu, Xiao-Hui Li, Yuan Gao, Jun Song, Bo Zheng, Cheng-Lin Liu", "id": "2412.18424v1", "paper_url": "http://arxiv.org/abs/2412.18424v1", "repo": "null"}}