{"2501.03403": {"publish_time": "2025-01-06", "title": "BoundingDocs: a Unified Dataset for Document Question Answering with Spatial Annotations", "paper_summary": "We present a unified dataset for document Question-Answering (QA), which is\nobtained combining several public datasets related to Document AI and visually\nrich document understanding (VRDU). Our main contribution is twofold: on the\none hand we reformulate existing Document AI tasks, such as Information\nExtraction (IE), into a Question-Answering task, making it a suitable resource\nfor training and evaluating Large Language Models; on the other hand, we\nrelease the OCR of all the documents and include the exact position of the\nanswer to be found in the document image as a bounding box. Using this dataset,\nwe explore the impact of different prompting techniques (that might include\nbounding box information) on the performance of open-weight models, identifying\nthe most effective approaches for document comprehension.", "paper_summary_zh": "我們提供一個統一的資料集，用於文件問答 (QA)，這是\n透過結合幾個與文件人工智慧和視覺豐富文件理解 (VRDU) 相關的公開資料集而獲得的。我們的貢獻主要有兩個方面：一方面，我們將現有的文件人工智慧任務，例如資訊萃取 (IE)，重新制定成問答任務，使其成為訓練和評估大型語言模型的合適資源；另一方面，我們釋出所有文件的 OCR，並將答案在文件影像中的確切位置包含在邊界框中。使用這個資料集，我們探討了不同的提示技術（可能包括邊界框資訊）對開放權重模型效能的影響，找出最有效的文件理解方法。", "author": "Simone Giovannini et.al.", "authors": "Simone Giovannini, Fabio Coppini, Andrea Gemelli, Simone Marinai", "id": "2501.03403v1", "paper_url": "http://arxiv.org/abs/2501.03403v1", "repo": "null"}}