{"2407.03582": {"publish_time": "2024-07-04", "title": "Integrating Randomness in Large Language Models: A Linear Congruential Generator Approach for Generating Clinically Relevant Content", "paper_summary": "Generating diverse, high-quality outputs from language models is crucial for\napplications in education and content creation. Achieving true randomness and\navoiding repetition remains a significant challenge. This study uses the Linear\nCongruential Generator method for systematic fact selection, combined with\nAI-powered content generation. We ensured unique combinations of\ngastrointestinal physiology and pathology facts across multiple rounds,\nintegrating these facts into prompts for GPT-4o to create clinically relevant,\nvignette-style outputs. Over 14 rounds, 98 unique outputs were generated,\ndemonstrating LCG's effectiveness in producing diverse and high-quality\ncontent. This method addresses key issues of randomness and repetition,\nenhancing the quality and efficiency of language model-generated content for\nvarious applications.", "paper_summary_zh": "在教育和內容創作的應用中，從語言模型產生多樣化、高品質的輸出至關重要。實現真正的隨機性和避免重複仍然是一項重大的挑戰。本研究使用線性同餘產生器方法進行系統性事實選擇，並結合 AI 驅動的內容生成。我們確保了在多輪中胃腸生理和病理事實的獨特組合，將這些事實整合到 GPT-4o 的提示中，以創建具有臨床相關性的短篇故事風格輸出。在 14 輪中，生成了 98 個獨特輸出，證明了 LCG 在產生多樣化和高品質內容方面的有效性。此方法解決了隨機性和重複性的關鍵問題，提高了語言模型生成的內容在各種應用中的品質和效率。", "author": "Andrew Bouras et.al.", "authors": "Andrew Bouras", "id": "2407.03582v1", "paper_url": "http://arxiv.org/abs/2407.03582v1", "repo": "https://github.com/andrewbouras/randomnesspaper"}}