{"2406.05682": {"publish_time": "2024-06-09", "title": "From Basic to Extra Features: Hypergraph Transformer Pretrain-then-Finetuning for Balanced Clinical Predictions on EHR", "paper_summary": "Electronic Health Records (EHRs) contain rich patient information and are\ncrucial for clinical research and practice. In recent years, deep learning\nmodels have been applied to EHRs, but they often rely on massive features,\nwhich may not be readily available for all patients. We propose HTP-Star, which\nleverages hypergraph structures with a pretrain-then-finetune framework for\nmodeling EHR data, enabling seamless integration of additional features.\nAdditionally, we design two techniques, namely (1) Smoothness-inducing\nRegularization and (2) Group-balanced Reweighting, to enhance the model's\nrobustness during fine-tuning. Through experiments conducted on two real EHR\ndatasets, we demonstrate that HTP-Star consistently outperforms various\nbaselines while striking a balance between patients with basic and extra\nfeatures.", "paper_summary_zh": "電子健康紀錄 (EHR) 包含豐富的患者資訊，對於臨床研究和實務至關重要。近年來，深度學習模型已應用於 EHR，但它們通常依賴大量特徵，而這些特徵可能並非所有患者都能輕易取得。我們提出 HTP-Star，它利用超圖結構搭配預訓練再微調架構來建模 EHR 資料，讓額外特徵能無縫整合。此外，我們設計了兩種技術，即 (1) 平滑誘導正則化和 (2) 群組平衡重新加權，以增強模型在微調期間的穩健性。透過在兩個真實 EHR 資料集上進行的實驗，我們證明 HTP-Star 在為具有基本和額外特徵的患者取得平衡的同時，始終優於各種基線。", "author": "Ran Xu et.al.", "authors": "Ran Xu, Yiwen Lu, Chang Liu, Yong Chen, Yan Sun, Xiao Hu, Joyce C Ho, Carl Yang", "id": "2406.05682v1", "paper_url": "http://arxiv.org/abs/2406.05682v1", "repo": "null"}}