{"2411.15240": {"publish_time": "2024-11-22", "title": "Is Attention All You Need For Actigraphy? Foundation Models of Wearable Accelerometer Data for Mental Health Research", "paper_summary": "Wearable accelerometry (actigraphy) has provided valuable data for clinical\ninsights since the 1970s and is increasingly important as wearable devices\ncontinue to become widespread. The effectiveness of actigraphy in research and\nclinical contexts is heavily dependent on the modeling architecture utilized.\nTo address this, we developed the Pretrained Actigraphy Transformer (PAT)--the\nfirst pretrained and fully attention-based model designed specifically to\nhandle actigraphy. PAT was pretrained on actigraphy from 29,307 participants in\nNHANES, enabling it to deliver state-of-the-art performance when fine-tuned\nacross various actigraphy prediction tasks in the mental health domain, even in\ndata-limited scenarios. For example, when trained to predict benzodiazepine\nusage using actigraphy from only 500 labeled participants, PAT achieved an 8.8\npercentage-point AUC improvement over the best baseline. With fewer than 2\nmillion parameters and built-in model explainability, PAT is robust yet easy to\ndeploy in health research settings.\n  GitHub: https://github.com/njacobsonlab/Pretrained-Actigraphy-Transformer/", "paper_summary_zh": "可穿戴式加速度計（活動描記）自 1970 年代以來，為臨床見解提供了有價值的數據，並且隨著可穿戴式裝置日益普及，其重要性也與日俱增。活動描記在研究和臨床環境中的有效性，在很大程度上取決於所使用的建模架構。為了解決這個問題，我們開發了預訓練活動描記轉換器 (PAT)，這是第一個預訓練且完全基於注意力的模型，專門設計用於處理活動描記。PAT 是根據 29,307 位 NHANES 參與者的活動描記進行預訓練，使其能夠在針對心理健康領域的各種活動描記預測任務進行微調時，提供最先進的效能，即使在資料有限的情況下也是如此。例如，當訓練使用僅來自 500 位標記參與者的活動描記來預測苯二氮䓬類藥物使用時，PAT 在最佳基準上實現了 8.8 個百分點的 AUC 改進。PAT 具有不到 200 萬個參數和內建模型可解釋性，因此在健康研究設定中既強大又容易部署。\nGitHub：https://github.com/njacobsonlab/Pretrained-Actigraphy-Transformer/", "author": "Franklin Y. Ruan et.al.", "authors": "Franklin Y. Ruan, Aiwei Zhang, Jenny Y. Oh, SouYoung Jin, Nicholas C Jacobson", "id": "2411.15240v1", "paper_url": "http://arxiv.org/abs/2411.15240v1", "repo": "https://github.com/njacobsonlab/pretrained-actigraphy-transformer"}}