{"2503.07248": {"publish_time": "2025-03-10", "title": "AI-Driven Automated Tool for Abdominal CT Body Composition Analysis in Gastrointestinal Cancer Management", "paper_summary": "The incidence of gastrointestinal cancers remains significantly high,\nparticularly in China, emphasizing the importance of accurate prognostic\nassessments and effective treatment strategies. Research shows a strong\ncorrelation between abdominal muscle and fat tissue composition and patient\noutcomes. However, existing manual methods for analyzing abdominal tissue\ncomposition are time-consuming and costly, limiting clinical research\nscalability. To address these challenges, we developed an AI-driven tool for\nautomated analysis of abdominal CT scans to effectively identify and segment\nmuscle, subcutaneous fat, and visceral fat. Our tool integrates a multi-view\nlocalization model and a high-precision 2D nnUNet-based segmentation model,\ndemonstrating a localization accuracy of 90% and a Dice Score Coefficient of\n0.967 for segmentation. Furthermore, it features an interactive interface that\nallows clinicians to refine the segmentation results, ensuring high-quality\noutcomes effectively. Our tool offers a standardized method for effectively\nextracting critical abdominal tissues, potentially enhancing the management and\ntreatment for gastrointestinal cancers. The code is available at\nhttps://github.com/NanXinyu/AI-Tool4Abdominal-Seg.git}{https://github.com/NanXinyu/AI-Tool4Abdominal-Seg.git.", "paper_summary_zh": "<paragraph>胃腸道癌症的發病率仍然居高不下，尤其是在中國，這更加凸顯了準確的預後評估和有效治療策略的重要性。研究顯示，腹部肌肉和脂肪組織組成與患者的預後有著密切的關聯。然而，現有的手動分析腹部組織組成的方法既耗時又昂貴，限制了臨床研究的規模。為了應對這些挑戰，我們開發了一種基於人工智慧的工具，用於自動分析腹部電腦斷層掃描，以有效識別和分割肌肉、皮下脂肪和內臟脂肪。我們的工具整合了多視圖定位模型和基於高精度 2D nnUNet 的分割模型，定位準確率達 90%，分割的 Dice 相似係數為 0.967。此外，它還具備互動式介面，允許臨床醫生調整分割結果，確保有效獲得高質量的結果。我們的工具提供了一種有效提取關鍵腹部組織的標準化方法，有可能改善胃腸道癌症的管理和治療。程式碼可在 https://github.com/NanXinyu/AI-Tool4Abdominal-Seg.git 取得。</paragraph>\n", "author": "Xinyu Nan et.al.", "authors": "Xinyu Nan, Meng He, Zifan Chen, Bin Dong, Lei Tang, Li Zhang", "id": "2503.07248v1", "paper_url": "http://arxiv.org/abs/2503.07248v1", "repo": "null"}}