{"2407.16695": {"publish_time": "2024-07-23", "title": "Stress-Testing Long-Context Language Models with Lifelong ICL and Task Haystack", "paper_summary": "We introduce Lifelong ICL, a problem setting that challenges long-context\nlanguage models (LMs) to learn from a sequence of language tasks through\nin-context learning (ICL). We further introduce Task Haystack, an evaluation\nsuite dedicated to assessing and diagnosing how long-context LMs utilizes\ncontexts in Lifelong ICL. When given a task instruction and test inputs,\nlong-context LMs are expected to leverage the relevant demonstrations in the\nLifelong ICL prompt, avoid distraction and interference from other tasks, and\nachieve test accuracies that are not significantly worse than the Single-task\nICL baseline.\n  Task Haystack draws inspiration from the widely-adopted\n\"needle-in-a-haystack\" (NIAH) evaluation, but presents new and unique\nchallenges. It demands that models (1) utilize the contexts with deeper\nunderstanding, rather than resorting to simple copying and pasting; (2)\nnavigate through long streams of evolving topics and tasks, which closely\napproximates the complexities of real-world usage of long-context LMs.\nAdditionally, Task Haystack inherits the controllability aspect of NIAH,\nproviding model developers with tools and visualizations to identify model\nvulnerabilities effectively.\n  We benchmark 12 long-context LMs using Task Haystack. We find that\nstate-of-the-art closed models such as GPT-4o still struggle in this setting,\nfailing 15% of the cases on average, while all open-weight models we evaluate\nfurther lack behind by a large margin, failing up to 61% of the cases. In our\ncontrolled analysis, we identify factors such as distraction and recency bias\nas contributors to these failure cases. Further, we observe declines in\nperformance when task instructions are paraphrased at test time or when ICL\ndemonstrations are repeated excessively, raising concerns about the robustness,\ninstruction understanding, and true context utilization of current long-context\nLMs.", "paper_summary_zh": "<paragraph>我們引入了終身 ICL，這是一個挑戰問題設置，讓長期語境語言模型 (LM) 能夠透過語境學習 (ICL) 從一系列語言任務中學習。我們進一步引入了任務乾草堆，這是一個評估套件，專門用於評估和診斷長期語境 LM 如何在終身 ICL 中使用語境。當給定任務說明和測試輸入時，預期長期語境 LM 將利用終身 ICL 提示中的相關示範，避免其他任務的干擾和干擾，並達到與單任務 ICL 基準線相差不大的測試準確度。\n任務乾草堆從廣泛採用的「大海撈針」(NIAH) 評估中汲取靈感，但提出了新的獨特挑戰。它要求模型 (1) 以更深入的理解利用語境，而不是訴諸於簡單的複製和貼上；(2) 瀏覽不斷變化的主題和任務的長串流，這與長期語境 LM 在現實世界中的使用複雜性非常接近。此外，任務乾草堆繼承了 NIAH 的可控性方面，為模型開發人員提供了工具和可視化效果，以有效識別模型漏洞。\n我們使用任務乾草堆對 12 個長期語境 LM 進行基準測試。我們發現，GPT-4o 等最先進的封閉模型在此設置中仍然舉步維艱，平均有 15% 的案例失敗，而我們評估的所有開放權重模型進一步落後一大截，有高達 61% 的案例失敗。在我們的受控分析中，我們將分心和近期偏誤等因素確定為這些失敗案例的成因。此外，我們觀察到，當任務說明在測試時被改寫，或當 ICL 示範被過度重複時，性能會下降，這引起了人們對當前長期語境 LM 的健壯性、指令理解和真實語境利用的擔憂。</paragraph>", "author": "Xiaoyue Xu et.al.", "authors": "Xiaoyue Xu, Qinyuan Ye, Xiang Ren", "id": "2407.16695v1", "paper_url": "http://arxiv.org/abs/2407.16695v1", "repo": "null"}}