{"2412.08389": {"publish_time": "2024-12-11", "title": "SweetieChat: A Strategy-Enhanced Role-playing Framework for Diverse Scenarios Handling Emotional Support Agent", "paper_summary": "Large Language Models (LLMs) have demonstrated promising potential in\nproviding empathetic support during interactions. However, their responses\noften become verbose or overly formulaic, failing to adequately address the\ndiverse emotional support needs of real-world scenarios. To tackle this\nchallenge, we propose an innovative strategy-enhanced role-playing framework,\ndesigned to simulate authentic emotional support conversations. Specifically,\nour approach unfolds in two steps: (1) Strategy-Enhanced Role-Playing\nInteractions, which involve three pivotal roles -- Seeker, Strategy Counselor,\nand Supporter -- engaging in diverse scenarios to emulate real-world\ninteractions and promote a broader range of dialogues; and (2) Emotional\nSupport Agent Training, achieved through fine-tuning LLMs using our specially\nconstructed dataset. Within this framework, we develop the \\textbf{ServeForEmo}\ndataset, comprising an extensive collection of 3.7K+ multi-turn dialogues and\n62.8K+ utterances. We further present \\textbf{SweetieChat}, an emotional\nsupport agent capable of handling diverse open-domain scenarios. Extensive\nexperiments and human evaluations confirm the framework's effectiveness in\nenhancing emotional support, highlighting its unique ability to provide more\nnuanced and tailored assistance.", "paper_summary_zh": "大型語言模型 (LLM) 在互動中提供同理心支持方面已展現出有希望的潛力。然而，他們的回應常常變得冗長或過於公式化，無法充分滿足現實世界場景中多樣的情緒支持需求。為了應對這一挑戰，我們提出了一個創新的策略增強角色扮演框架，旨在模擬真實的情緒支持對話。具體來說，我們的做法分為兩個步驟：(1) 策略增強的角色扮演互動，其中涉及三個關鍵角色——尋求者、策略顧問和支持者——參與不同的場景，模擬現實世界的互動並促進更廣泛的對話；(2) 情緒支持代理訓練，通過使用我們專門構建的數據集對 LLM 進行微調來實現。在此框架內，我們開發了 \\textbf{ServeForEmo} 數據集，其中包含 3.7K+ 多輪對話和 62.8K+ 話語的廣泛集合。我們進一步提出了 \\textbf{SweetieChat}，這是一個能夠處理多樣開放領域場景的情緒支持代理。廣泛的實驗和人類評估證實了該框架在增強情緒支持方面的有效性，突出了其提供更細緻和個性化協助的獨特能力。", "author": "Jing Ye et.al.", "authors": "Jing Ye, Lu Xiang, Yaping Zhang, Chengqing Zong", "id": "2412.08389v1", "paper_url": "http://arxiv.org/abs/2412.08389v1", "repo": "null"}}