{"2407.09395": {"publish_time": "2024-07-12", "title": "Deep Bag-of-Words Model: An Efficient and Interpretable Relevance Architecture for Chinese E-Commerce", "paper_summary": "Text relevance or text matching of query and product is an essential\ntechnique for the e-commerce search system to ensure that the displayed\nproducts can match the intent of the query. Many studies focus on improving the\nperformance of the relevance model in search system. Recently, pre-trained\nlanguage models like BERT have achieved promising performance on the text\nrelevance task. While these models perform well on the offline test dataset,\nthere are still obstacles to deploy the pre-trained language model to the\nonline system as their high latency. The two-tower model is extensively\nemployed in industrial scenarios, owing to its ability to harmonize performance\nwith computational efficiency. Regrettably, such models present an opaque\n``black box'' nature, which prevents developers from making special\noptimizations. In this paper, we raise deep Bag-of-Words (DeepBoW) model, an\nefficient and interpretable relevance architecture for Chinese e-commerce. Our\napproach proposes to encode the query and the product into the sparse BoW\nrepresentation, which is a set of word-weight pairs. The weight means the\nimportant or the relevant score between the corresponding word and the raw\ntext. The relevance score is measured by the accumulation of the matched word\nbetween the sparse BoW representation of the query and the product. Compared to\npopular dense distributed representation that usually suffers from the drawback\nof black-box, the most advantage of the proposed representation model is highly\nexplainable and interventionable, which is a superior advantage to the\ndeployment and operation of online search engines. Moreover, the online\nefficiency of the proposed model is even better than the most efficient inner\nproduct form of dense representation ...", "paper_summary_zh": "文字相關性或查詢與產品的文字配對是電子商務搜尋系統中的一項重要技術，用以確保顯示的產品能符合查詢的意圖。許多研究專注於提升搜尋系統中相關性模型的效能。最近，BERT 等預先訓練的語言模型已在文字相關性任務中取得亮眼的表現。儘管這些模型在離線測試資料集中的表現良好，但將預先訓練的語言模型部署至線上系統仍有障礙，因為它們的延遲很高。雙塔模型廣泛用於產業場景，因為它能調和效能與運算效率。遺憾的是，此類模型呈現不透明的「黑盒子」性質，這會阻礙開發人員進行特殊最佳化。在本文中，我們提出深度詞袋（DeepBoW）模型，這是一種針對中文電子商務的高效且可解釋相關性架構。我們的做法建議將查詢和產品編碼成稀疏詞袋（BoW）表示，這是一組字詞權重對。權重表示對應字詞與原始文字之間的重要程度或相關分數。相關分數是透過累積查詢和產品的稀疏詞袋表示之間的配對字詞來衡量。與通常會受到黑盒子缺點影響的熱門稠密分散表示相比，所提出的表示模型最大的優點是高度可解釋且可介入，這對於線上搜尋引擎的部署和操作而言是一個優勢。此外，所提出的模型的線上效率甚至比稠密表示中最有效率的內積形式還要好。", "author": "Zhe Lin et.al.", "authors": "Zhe Lin, Jiwei Tan, Dan Ou, Xi Chen, Shaowei Yao, Bo Zheng", "id": "2407.09395v1", "paper_url": "http://arxiv.org/abs/2407.09395v1", "repo": "null"}}