{"2406.08183": {"publish_time": "2024-06-12", "title": "Underneath the Numbers: Quantitative and Qualitative Gender Fairness in LLMs for Depression Prediction", "paper_summary": "Recent studies show bias in many machine learning models for depression\ndetection, but bias in LLMs for this task remains unexplored. This work\npresents the first attempt to investigate the degree of gender bias present in\nexisting LLMs (ChatGPT, LLaMA 2, and Bard) using both quantitative and\nqualitative approaches. From our quantitative evaluation, we found that ChatGPT\nperforms the best across various performance metrics and LLaMA 2 outperforms\nother LLMs in terms of group fairness metrics. As qualitative fairness\nevaluation remains an open research question we propose several strategies\n(e.g., word count, thematic analysis) to investigate whether and how a\nqualitative evaluation can provide valuable insights for bias analysis beyond\nwhat is possible with quantitative evaluation. We found that ChatGPT\nconsistently provides a more comprehensive, well-reasoned explanation for its\nprediction compared to LLaMA 2. We have also identified several themes adopted\nby LLMs to qualitatively evaluate gender fairness. We hope our results can be\nused as a stepping stone towards future attempts at improving qualitative\nevaluation of fairness for LLMs especially for high-stakes tasks such as\ndepression detection.", "paper_summary_zh": "最近的研究顯示許多機器學習模型在憂鬱症偵測上存在偏見，但 LLM 在這項任務上的偏見仍未被探討。這項工作首次嘗試使用量化和質化方法研究現有 LLM（ChatGPT、LLaMA 2 和 Bard）中存在的性別偏見程度。從我們的量化評估中，我們發現 ChatGPT 在各種效能指標上表現最佳，而 LLaMA 2 在群組公平性指標方面優於其他 LLM。由於質化公平性評估仍是一個開放的研究問題，我們提出了幾種策略（例如字數統計、主題分析）來探討質化評估是否以及如何能為偏見分析提供有價值的見解，超越量化評估的可能性。我們發現，與 LLaMA 2 相比，ChatGPT 持續提供更全面、更有條理的預測說明。我們也找出 LLM 採用來質化評估性別公平性的幾個主題。我們希望我們的結果可用作未來嘗試改善 LLM 公平性質化評估的踏腳石，特別是對於高風險任務，例如憂鬱症偵測。", "author": "Micol Spitale et.al.", "authors": "Micol Spitale, Jiaee Cheong, Hatice Gunes", "id": "2406.08183v1", "paper_url": "http://arxiv.org/abs/2406.08183v1", "repo": "null"}}