{"2405.15165": {"publish_time": "2024-05-24", "title": "A Solution-based LLM API-using Methodology for Academic Information Seeking", "paper_summary": "Applying large language models (LLMs) for academic API usage shows promise in\nreducing researchers' academic information seeking efforts. However, current\nLLM API-using methods struggle with complex API coupling commonly encountered\nin academic queries. To address this, we introduce SoAy, a solution-based LLM\nAPI-using methodology for academic information seeking. It uses code with a\nsolution as the reasoning method, where a solution is a pre-constructed API\ncalling sequence. The addition of the solution reduces the difficulty for the\nmodel to understand the complex relationships between APIs. Code improves the\nefficiency of reasoning.\n  To evaluate SoAy, we introduce SoAyBench, an evaluation benchmark accompanied\nby SoAyEval, built upon a cloned environment of APIs from AMiner. Experimental\nresults demonstrate a 34.58-75.99\\% performance improvement compared to\nstate-of-the-art LLM API-based baselines. All datasets, codes, tuned models,\nand deployed online services are publicly accessible at\nhttps://github.com/RUCKBReasoning/SoAy.", "paper_summary_zh": "將大型語言模型 (LLM) 應用於學術 API 使用，顯示出有助於降低研究人員在學術資訊尋找上的努力。然而，目前使用 LLM API 的方法，在學術查詢中常見的複雜 API 耦合上仍有困難。為了解決這個問題，我們引入了 SoAy，一種基於解決方案的 LLM API 使用方法，用於學術資訊尋找。它使用具有解決方案的程式碼作為推理方法，其中解決方案是一個預先建構的 API 呼叫順序。加入解決方案後，模型理解 API 之間複雜關係的難度降低了。程式碼改善了推理效率。\n為了評估 SoAy，我們引入了 SoAyBench，一個評估基準，並附帶了 SoAyEval，建立在 AMiner 的 API 克隆環境之上。實驗結果顯示，與最先進的基於 LLM API 的基線相比，效能提升了 34.58-75.99%。所有資料集、程式碼、調整過的模型和部署的線上服務都可以在 https://github.com/RUCKBReasoning/SoAy 公開取得。", "author": "Yuanchun Wang et.al.", "authors": "Yuanchun Wang, Jifan Yu, Zijun Yao, Jing Zhang, Yuyang Xie, Shangqing Tu, Yiyang Fu, Youhe Feng, Jinkai Zhang, Jingyao Zhang, Bowen Huang, Yuanyao Li, Huihui Yuan, Lei Hou, Juanzi Li, Jie Tang", "id": "2405.15165v1", "paper_url": "http://arxiv.org/abs/2405.15165v1", "repo": "https://github.com/ruckbreasoning/soay"}}