{"2412.10982": {"publish_time": "2024-12-14", "title": "MedG-KRP: Medical Graph Knowledge Representation Probing", "paper_summary": "Large language models (LLMs) have recently emerged as powerful tools, finding\nmany medical applications. LLMs' ability to coalesce vast amounts of\ninformation from many sources to generate a response-a process similar to that\nof a human expert-has led many to see potential in deploying LLMs for clinical\nuse. However, medicine is a setting where accurate reasoning is paramount. Many\nresearchers are questioning the effectiveness of multiple choice question\nanswering (MCQA) benchmarks, frequently used to test LLMs. Researchers and\nclinicians alike must have complete confidence in LLMs' abilities for them to\nbe deployed in a medical setting. To address this need for understanding, we\nintroduce a knowledge graph (KG)-based method to evaluate the biomedical\nreasoning abilities of LLMs. Essentially, we map how LLMs link medical concepts\nin order to better understand how they reason. We test GPT-4, Llama3-70b, and\nPalmyraMed-70b, a specialized medical model. We enlist a panel of medical\nstudents to review a total of 60 LLM-generated graphs and compare these graphs\nto BIOS, a large biomedical KG. We observe GPT-4 to perform best in our human\nreview but worst in our ground truth comparison; vice-versa with PalmyraMed,\nthe medical model. Our work provides a means of visualizing the medical\nreasoning pathways of LLMs so they can be implemented in clinical settings\nsafely and effectively.", "paper_summary_zh": "大型語言模型 (LLM) 近期已成為強大的工具，在許多醫療應用中發揮作用。LLM 能夠從許多來源彙整大量資訊以產生回應（類似人類專家的流程），因此許多人看到將 LLM 部署於臨床用途的潛力。然而，醫學是一個準確推理至關重要的領域。許多研究人員質疑多重選擇題答題 (MCQA) 評量基準的有效性，而這項評量基準經常被用於測試 LLM。研究人員和臨床醫生都必須對 LLM 的能力有完全的信心，才能將其部署於醫療場景。為了滿足這種理解需求，我們引進一個基於知識圖譜 (KG) 的方法來評估 LLM 的生物醫學推理能力。基本上，我們繪製 LLM 如何連結醫療概念，以便更了解它們的推理方式。我們測試了 GPT-4、Llama3-70b 和 PalmyraMed-70b（一種專業醫療模型）。我們徵求一組醫學生審查總共 60 個 LLM 生成的圖表，並將這些圖表與 BIOS（一個大型生物醫學 KG）進行比較。我們觀察到 GPT-4 在我們的人類審查中表現最佳，但在我們的地面實況比較中表現最差；而醫療模型 PalmyraMed 則相反。我們的研究提供了一種可視化 LLM 醫療推理路徑的方法，以便它們能安全有效地實作於臨床場景。", "author": "Gabriel R. Rosenbaum et.al.", "authors": "Gabriel R. Rosenbaum, Lavender Yao Jiang, Ivaxi Sheth, Jaden Stryker, Anton Alyakin, Daniel Alexander Alber, Nicolas K. Goff, Young Joon, Kwon, John Markert, Mustafa Nasir-Moin, Jan Moritz Niehues, Karl L. Sangwon, Eunice Yang, Eric Karl Oermann", "id": "2412.10982v1", "paper_url": "http://arxiv.org/abs/2412.10982v1", "repo": "null"}}