{"2410.15460": {"publish_time": "2024-10-20", "title": "Hallucination Detox: Sensitive Neuron Dropout (SeND) for Large Language Model Training", "paper_summary": "As large language models (LLMs) become increasingly deployed across various\nindustries, concerns regarding their reliability, particularly due to\nhallucinations-outputs that are factually inaccurate or irrelevant to user\ninput-have grown. Our research investigates the relationship between the\ntraining process and the emergence of hallucinations to address a key gap in\nexisting research that focuses primarily on post hoc detection and mitigation\nstrategies. Using models from the Pythia suite (70M-12B parameters) and several\nhallucination detection metrics, we analyze hallucination trends throughout\ntraining and explore LLM internal dynamics. We introduce SEnsitive Neuron\nDropout (SeND), a novel training protocol designed to mitigate hallucinations\nby reducing variance during training. SeND achieves this by deterministically\ndropping neurons with significant variability on a dataset, referred to as\nSensitive Neurons. In addition, we develop an unsupervised hallucination\ndetection metric, Efficient EigenScore (EES), which approximates the\ntraditional EigenScore in 2x speed. This efficient metric is integrated into\nour protocol, allowing SeND to be both computationally scalable and effective\nat reducing hallucinations. Our empirical evaluation demonstrates that our\napproach improves LLM reliability at test time by up to 40% compared to normal\ntraining while also providing an efficient method to improve factual accuracy\nwhen adapting LLMs to domains such as Wikipedia and Medical datasets.", "paper_summary_zh": "隨著大型語言模型（LLM）在各產業的部署日益廣泛，對於其可靠性的疑慮也隨之增加，特別是幻覺輸出，即與事實不符或與使用者輸入無關的輸出。我們的研究調查訓練流程與幻覺出現之間的關係，以解決現有研究的關鍵差距，而現有研究主要集中在事後偵測和緩解策略。我們使用 Pythia 組合（70M-12B 參數）中的模型和幾個幻覺偵測指標，分析整個訓練過程中的幻覺趨勢，並探索 LLM 內部動態。我們引入了敏感神經元中斷（SeND），這是一種新穎的訓練協定，旨在透過減少訓練期間的變異來減輕幻覺。SeND 透過確定性地捨棄資料集上變異顯著的神經元（稱為敏感神經元）來達成此目的。此外，我們開發了一個無監督的幻覺偵測指標，即有效特徵值（EES），它以 2 倍的速度近似傳統的特徵值。這個有效的指標整合到我們的協定中，讓 SeND 在計算上可擴充且有效減少幻覺。我們的經驗評估顯示，與一般訓練相比，我們的做法在測試時間將 LLM 的可靠性提升了 40%，同時也提供了一種有效的方法來提升事實準確度，例如將 LLM 適應到維基百科和醫療資料集等領域。", "author": "Shahrad Mohammadzadeh et.al.", "authors": "Shahrad Mohammadzadeh, Juan David Guerra, Marco Bonizzato, Reihaneh Rabbany, Golnoosh Farnadi", "id": "2410.15460v1", "paper_url": "http://arxiv.org/abs/2410.15460v1", "repo": "null"}}