{"2405.06478": {"publish_time": "2024-05-10", "title": "Attention is all they need: Cognitive science and the (techno)political economy of attention in humans and machines", "paper_summary": "This paper critically analyses the \"attention economy\" within the framework\nof cognitive science and techno-political economics, as applied to both human\nand machine interactions. We explore how current business models, particularly\nin digital platform capitalism, harness user engagement by strategically\nshaping attentional patterns. These platforms utilize advanced AI and massive\ndata analytics to enhance user engagement, creating a cycle of attention\ncapture and data extraction. We review contemporary (neuro)cognitive theories\nof attention and platform engagement design techniques and criticize classical\ncognitivist and behaviourist theories for their inadequacies in addressing the\npotential harms of such engagement on user autonomy and wellbeing. 4E\napproaches to cognitive science, instead, emphasizing the embodied, extended,\nenactive, and ecological aspects of cognition, offer us an intrinsic normative\nstandpoint and a more integrated understanding of how attentional patterns are\nactively constituted by adaptive digital environments. By examining the\nprecarious nature of habit formation in digital contexts, we reveal the\ntechno-economic underpinnings that threaten personal autonomy by disaggregating\nhabits away from the individual, into an AI managed collection of behavioural\npatterns. Our current predicament suggests the necessity of a paradigm shift\ntowards an ecology of attention. This shift aims to foster environments that\nrespect and preserve human cognitive and social capacities, countering the\nexploitative tendencies of cognitive capitalism.", "paper_summary_zh": "本文在認知科學和技術政治經濟學的框架內批判性地分析「注意力經濟」，並將其應用於人類和機器互動。我們探討當前商業模式，特別是在數位平台資本主義中，如何透過策略性地塑造注意力模式來利用使用者參與。這些平台利用先進的人工智慧和大量資料分析來提升使用者參與，創造一個注意力捕捉和資料萃取的循環。我們回顧當代（神經）認知理論、注意力和平台參與設計技術，並批評古典認知主義和行為主義理論在處理此類參與對使用者自主性和福祉的潛在危害時存在不足。相反地，認知科學的 4E 方法強調認知的具身、延伸、能動和生態面向，為我們提供了一個內在的規範觀點，以及對注意力模式如何被適應性數位環境積極構成的更整合理解。透過檢視數位環境中習慣養成的脆弱本質，我們揭露了威脅個人自主的技術經濟基礎，將習慣從個人中分解成由人工智慧管理的行為模式集合。我們目前的困境表明，有必要朝向注意力生態系統轉變。這種轉變旨在培養尊重和維護人類認知和社會能力的環境，以對抗認知資本主義的剝削傾向。", "author": "Pablo González de la Torre et.al.", "authors": "Pablo González de la Torre, Marta Pérez-Verdugo, Xabier E. Barandiaran", "id": "2405.06478v1", "paper_url": "http://arxiv.org/abs/2405.06478v1", "repo": "null"}}