{"2407.09355": {"publish_time": "2024-07-12", "title": "FastImpute: A Baseline for Open-source, Reference-Free Genotype Imputation Methods -- A Case Study in PRS313", "paper_summary": "Genotype imputation enhances genetic data by predicting missing SNPs using\nreference haplotype information. Traditional methods leverage linkage\ndisequilibrium (LD) to infer untyped SNP genotypes, relying on the similarity\nof LD structures between genotyped target sets and fully sequenced reference\npanels. Recently, reference-free deep learning-based methods have emerged,\noffering a promising alternative by predicting missing genotypes without\nexternal databases, thereby enhancing privacy and accessibility. However, these\nmethods often produce models with tens of millions of parameters, leading to\nchallenges such as the need for substantial computational resources to train\nand inefficiency for client-sided deployment. Our study addresses these\nlimitations by introducing a baseline for a novel genotype imputation pipeline\nthat supports client-sided imputation models generalizable across any\ngenotyping chip and genomic region. This approach enhances patient privacy by\nperforming imputation directly on edge devices. As a case study, we focus on\nPRS313, a polygenic risk score comprising 313 SNPs used for breast cancer risk\nprediction. Utilizing consumer genetic panels such as 23andMe, our model\ndemocratizes access to personalized genetic insights by allowing 23andMe users\nto obtain their PRS313 score. We demonstrate that simple linear regression can\nsignificantly improve the accuracy of PRS313 scores when calculated using SNPs\nimputed from consumer gene panels, such as 23andMe. Our linear regression model\nachieved an R^2 of 0.86, compared to 0.33 without imputation and 0.28 with\nsimple imputation (substituting missing SNPs with the minor allele frequency).\nThese findings suggest that popular SNP analysis libraries could benefit from\nintegrating linear regression models for genotype imputation, providing a\nviable and light-weight alternative to reference based imputation.", "paper_summary_zh": "基因型推算透過使用參考單倍型資訊來預測遺失的 SNP，進而增強遺傳資料。傳統方法利用連鎖不平衡 (LD) 來推論未分型的 SNP 基因型，依賴於基因分型目標組與完全定序參考面板之間的 LD 結構相似性。最近，無參考深度學習方法應運而生，提供了一個有前途的替代方案，可以在沒有外部資料庫的情況下預測遺失的基因型，從而增強隱私和可及性。然而，這些方法通常會產生具有數千萬個參數的模型，導致諸如需要大量的運算資源進行訓練和客戶端部署效率低下的挑戰。我們的研究透過引入一個新穎基因型推算管線的基準來解決這些限制，該管線支援在任何基因分型晶片和基因組區域中可概化的客戶端推算模型。此方法透過直接在邊緣裝置上執行推算來增強患者隱私。作為案例研究，我們專注於 PRS313，一種由 313 個 SNP 組成的多基因風險評分，用於乳癌風險預測。我們的模型利用 23andMe 等消費者基因面板，透過允許 23andMe 使用者取得他們的 PRS313 評分，民主化地取得個人化基因見解。我們證明，在使用從消費者基因面板（例如 23andMe）推算的 SNP 計算 PRS313 評分時，簡單的線性回歸可以顯著提高準確性。我們的線性回歸模型達到 R^2 為 0.86，而未推算為 0.33，使用簡單推算（用次要等位基因頻率取代遺失的 SNP）為 0.28。這些發現表明，熱門的 SNP 分析程式庫可以從整合線性回歸模型以進行基因型推算中受益，提供一個可行的且輕量化的替代方案，以取代基於參考的推算。", "author": "Aaron Ge et.al.", "authors": "Aaron Ge, Jeya Balasubramanian, Xueyao Wu, Peter Kraft, Jonas S. Almeida", "id": "2407.09355v1", "paper_url": "http://arxiv.org/abs/2407.09355v1", "repo": "https://github.com/aaronge-2020/deepimpute"}}