{"2410.21597": {"publish_time": "2024-10-28", "title": "Reducing the Scope of Language Models with Circuit Breakers", "paper_summary": "Language models are now deployed in a wide variety of user-facing\napplications, often for specific purposes like answering questions about\ndocumentation or acting as coding assistants. As these models are intended for\nparticular purposes, they should not be able to answer irrelevant queries like\nrequests for poetry or questions about physics, or even worse, queries that can\nonly be answered by humans like sensitive company policies. Instead we would\nlike them to only answer queries corresponding to desired behavior and refuse\nall other requests, which we refer to as scoping. We find that, despite the use\nof system prompts, two representative language models can be poorly scoped and\nrespond to queries they should not be addressing. We then conduct a\ncomprehensive empirical evaluation of methods which could be used for scoping\nthe behavior of language models. Among many other results, we show that a\nrecently-proposed method for general alignment, Circuit Breakers (CB), can be\nadapted to scope language models to very specific tasks like sentiment analysis\nor summarization or even tasks with finer-grained scoping (e.g. summarizing\nonly news articles). When compared to standard methods like fine-tuning or\npreference learning, CB is more robust both for out of distribution tasks, and\nto adversarial prompting techniques. We also show that layering SFT and CB\ntogether often results in the best of both worlds: improved performance only on\nrelevant queries, while rejecting irrelevant ones.", "paper_summary_zh": "語言模型現已廣泛部署於各種面向使用者的應用程式中，通常用於特定用途，例如回答文件問題或擔任編碼助理。由於這些模型專為特定用途而設計，因此不應能夠回答與其無關的查詢，例如詩歌請求或物理問題，甚至更糟的是，只有人類才能回答的查詢，例如敏感的公司政策。相反，我們希望它們只回答與所需行為相符的查詢，並拒絕所有其他請求，我們稱之為範圍。我們發現，儘管使用了系統提示，但兩個代表性語言模型的範圍可能很差，並且會回應它們不應處理的查詢。然後，我們對可用於界定語言模型行為的方法進行全面的實證評估。在許多其他結果中，我們展示了一種最近提出的通用對齊方法，電路中斷器 (CB)，可以適應範圍語言模型到非常具體的任務，例如情緒分析或摘要，甚至具有更細粒度範圍的任務（例如僅摘要新聞文章）。與微調或偏好學習等標準方法相比，CB 對分佈任務和對抗提示技術都更強大。我們還表明，將 SFT 和 CB 分層結合在一起通常會產生兩全其美的效果：僅在相關查詢上提高性能，同時拒絕不相關的查詢。", "author": "David Yunis et.al.", "authors": "David Yunis, Siyu Huo, Chulaka Gunasekara, Danish Contractor", "id": "2410.21597v1", "paper_url": "http://arxiv.org/abs/2410.21597v1", "repo": "null"}}