{"2406.19934": {"publish_time": "2024-06-28", "title": "From the Least to the Most: Building a Plug-and-Play Visual Reasoner via Data Synthesis", "paper_summary": "We explore multi-step reasoning in vision-language models (VLMs). The problem\nis challenging, as reasoning data consisting of multiple steps of visual and\nlanguage processing are barely available. To overcome the challenge, we first\nintroduce a least-to-most visual reasoning paradigm, which interleaves steps of\ndecomposing a question into sub-questions and invoking external tools for\nresolving sub-questions. Based on the paradigm, we further propose a novel data\nsynthesis approach that can automatically create questions and multi-step\nreasoning paths for an image in a bottom-up manner. Our approach divides the\ncomplex synthesis task into a few simple sub-tasks, and (almost entirely)\nrelies on open-sourced models to accomplish the sub-tasks. Therefore, the\nentire synthesis process is reproducible and cost-efficient, and the\nsynthesized data is quality guaranteed. With the approach, we construct $50$k\nvisual reasoning examples. Then, we develop a visual reasoner through\nsupervised fine-tuning, which is capable of generally enhancing the reasoning\nabilities of a wide range of existing VLMs in a plug-and-play fashion.\nExtensive experiments indicate that the visual reasoner can consistently and\nsignificantly improve four VLMs on four VQA benchmarks. Our code and dataset\nare available at https://github.com/steven-ccq/VisualReasoner.", "paper_summary_zh": "我們在視覺語言模型 (VLM) 中探索多步驟推理。這個問題具有挑戰性，因為包含多個視覺和語言處理步驟的推理數據幾乎不可用。為了克服這個挑戰，我們首先引入一個由少到多的視覺推理範例，它交織了將問題分解成子問題的步驟，並調用外部工具來解決子問題。基於這個範例，我們進一步提出了一種新穎的數據合成方法，它可以自動為圖像創建問題和多步驟推理路徑，採用由下而上的方式。我們的做法將複雜的合成任務劃分為幾個簡單的子任務，並且（幾乎完全）依賴於開源模型來完成子任務。因此，整個合成過程是可複製且具有成本效益的，並且合成數據的品質有保證。使用這種方法，我們構建了 $50$k 視覺推理範例。然後，我們透過監督微調開發了一個視覺推理器，它能夠以即插即用的方式普遍增強各種現有 VLM 的推理能力。廣泛的實驗表明，視覺推理器可以持續且顯著地改善四個 VQA 基準上的四個 VLM。我們的程式碼和數據集可在 https://github.com/steven-ccq/VisualReasoner 取得。", "author": "Chuanqi Cheng et.al.", "authors": "Chuanqi Cheng, Jian Guan, Wei Wu, Rui Yan", "id": "2406.19934v1", "paper_url": "http://arxiv.org/abs/2406.19934v1", "repo": "null"}}