{"2405.18999": {"publish_time": "2024-05-29", "title": "Continuously Optimizing Radar Placement with Model Predictive Path Integrals", "paper_summary": "Continuously optimizing sensor placement is essential for precise target\nlocalization in various military and civilian applications. While information\ntheory has shown promise in optimizing sensor placement, many studies\noversimplify sensor measurement models or neglect dynamic constraints of mobile\nsensors. To address these challenges, we employ a range measurement model that\nincorporates radar parameters and radar-target distance, coupled with Model\nPredictive Path Integral (MPPI) control to manage complex environmental\nobstacles and dynamic constraints. We compare the proposed approach against\nstationary radars or simplified range measurement models based on the root mean\nsquared error (RMSE) of the Cubature Kalman Filter (CKF) estimator for the\ntargets' state. Additionally, we visualize the evolving geometry of radars and\ntargets over time, highlighting areas of highest measurement information gain,\ndemonstrating the strengths of the approach. The proposed strategy outperforms\nstationary radars and simplified range measurement models in target\nlocalization, achieving a 38-74% reduction in mean RMSE and a 33-79% reduction\nin the upper tail of the 90% Highest Density Interval (HDI) over 500 Monte Carl\n(MC) trials across all time steps.\n  Code will be made publicly available upon acceptance.", "paper_summary_zh": "持續優化感測器配置對於在各種軍事和民用應用中精準定位目標至關重要。雖然資訊理論已在優化感測器配置方面展現前景，但許多研究過於簡化感測器測量模型，或忽略了行動感測器的動態限制。為了應對這些挑戰，我們採用結合雷達參數和雷達目標距離的範圍測量模型，並搭配模型預測路徑積分 (MPPI) 控制來管理複雜的環境障礙和動態限制。我們將提出的方法與根據目標狀態的卡爾曼濾波器 (CKF) 估計器的均方根誤差 (RMSE) 所建立的固定雷達或簡化的範圍測量模型進行比較。此外，我們將隨著時間視覺化雷達和目標的演化幾何形狀，重點標示測量資訊增益最高的區域，以展示此方法的優點。所提出的策略在目標定位方面優於固定雷達和簡化的範圍測量模型，在均方根誤差的平均值減少了 38-74%，在 500 次蒙地卡羅 (MC) 試驗中，90% 最高密度區間 (HDI) 的上尾減少了 33-79%。代碼將在接受後公開。", "author": "Michael Potter et.al.", "authors": "Michael Potter, Shuo Tang, Paul Ghanem, Milica Stojanovic, Pau Closas, Murat Akcakaya, Ben Wright, Marius Necsoiu, Deniz Erdogmus, Michael Everett, Talees Imbiriba", "id": "2405.18999v1", "paper_url": "http://arxiv.org/abs/2405.18999v1", "repo": "null"}}