{"2409.18446": {"publish_time": "2024-09-27", "title": "Exploring Language Model Generalization in Low-Resource Extractive QA", "paper_summary": "In this paper, we investigate Extractive Question Answering (EQA) with Large\nLanguage Models (LLMs) under domain drift, i.e., can LLMs generalize well to\nclosed-domains that require specific knowledge such as medicine and law in a\nzero-shot fashion without additional in-domain training? To this end, we devise\na series of experiments to empirically explain the performance gap. Our\nfindings suggest that: a) LLMs struggle with dataset demands of closed-domains\nsuch as retrieving long answer-spans; b) Certain LLMs, despite showing strong\noverall performance, display weaknesses in meeting basic requirements as\ndiscriminating between domain-specific senses of words which we link to\npre-processing decisions; c) Scaling model parameters is not always effective\nfor cross-domain generalization; and d) Closed-domain datasets are\nquantitatively much different than open-domain EQA datasets and current LLMs\nstruggle to deal with them. Our findings point out important directions for\nimproving existing LLMs.", "paper_summary_zh": "在本文中，我們研究了在領域漂移下使用大型語言模型 (LLM) 的抽取式問答 (EQA)，也就是說，LLM 能否在不進行額外領域內訓練的情況下，以零次學習的方式很好地推廣到需要特定知識（例如醫學和法律）的封閉領域？為此，我們設計了一系列實驗來經驗性地解釋效能差距。我們的研究結果表明：a) LLM 難以應付封閉領域的資料集需求，例如擷取長答案範圍；b) 某些 LLM 儘管表現出強勁的整體效能，但在滿足基本需求方面表現出弱點，例如區分單字的領域特定含義，我們將其連結到前處理決策；c) 擴充模型參數並不總是對跨領域推廣有效；d) 封閉領域資料集在數量上與開放領域 EQA 資料集有很大不同，而目前的 LLM 難以應付它們。我們的研究結果指出了改善現有 LLM 的重要方向。", "author": "Saptarshi Sengupta et.al.", "authors": "Saptarshi Sengupta, Wenpeng Yin, Preslav Nakov, Shreya Ghosh, Suhang Wang", "id": "2409.18446v1", "paper_url": "http://arxiv.org/abs/2409.18446v1", "repo": "null"}}