{"2405.09293": {"publish_time": "2024-05-15", "title": "Do language models capture implied discourse meanings? An investigation with exhaustivity implicatures of Korean morphology", "paper_summary": "Markedness in natural language is often associated with non-literal meanings\nin discourse. Differential Object Marking (DOM) in Korean is one instance of\nthis phenomenon, where post-positional markers are selected based on both the\nsemantic features of the noun phrases and the discourse features that are\northogonal to the semantic features. Previous work has shown that\ndistributional models of language recover certain semantic features of words --\ndo these models capture implied discourse-level meanings as well? We evaluate\nwhether a set of large language models are capable of associating discourse\nmeanings with different object markings in Korean. Results suggest that\ndiscourse meanings of a grammatical marker can be more challenging to encode\nthan that of a discourse marker.", "paper_summary_zh": "自然語言中的標記性通常與話語中的非字面意義有關。韓語中的差異性受格標記 (DOM) 就是這種現象的一個例子，其中後置標記是根據名詞短語的語義特徵和與語義特徵正交的話語特徵來選擇的。先前的研究表明，語言的分配模型可以恢復單詞的某些語義特徵——這些模型是否也捕捉到了隱含的話語級別意義？我們評估了一組大型語言模型是否能夠將話語意義與韓語中的不同受格標記聯繫起來。結果表明，語法標記的話語意義可能比話語標記更難編碼。", "author": "Hagyeong Shin et.al.", "authors": "Hagyeong Shin, Sean Trott", "id": "2405.09293v1", "paper_url": "http://arxiv.org/abs/2405.09293v1", "repo": "null"}}