{"2504.07336": {"publish_time": "2025-04-09", "title": "Zeus: Zero-shot LLM Instruction for Union Segmentation in Multimodal Medical Imaging", "paper_summary": "Medical image segmentation has achieved remarkable success through the\ncontinuous advancement of UNet-based and Transformer-based foundation\nbackbones. However, clinical diagnosis in the real world often requires\nintegrating domain knowledge, especially textual information. Conducting\nmultimodal learning involves visual and text modalities shown as a solution,\nbut collecting paired vision-language datasets is expensive and time-consuming,\nposing significant challenges. Inspired by the superior ability in numerous\ncross-modal tasks for Large Language Models (LLMs), we proposed a novel\nVision-LLM union framework to address the issues. Specifically, we introduce\nfrozen LLMs for zero-shot instruction generation based on corresponding medical\nimages, imitating the radiology scanning and report generation process. {To\nbetter approximate real-world diagnostic processes}, we generate more precise\ntext instruction from multimodal radiology images (e.g., T1-w or T2-w MRI and\nCT). Based on the impressive ability of semantic understanding and rich\nknowledge of LLMs. This process emphasizes extracting special features from\ndifferent modalities and reunion the information for the ultimate clinical\ndiagnostic. With generated text instruction, our proposed union segmentation\nframework can handle multimodal segmentation without prior collected\nvision-language datasets. To evaluate our proposed method, we conduct\ncomprehensive experiments with influential baselines, the statistical results\nand the visualized case study demonstrate the superiority of our novel method.}", "paper_summary_zh": "<paragraph>透過基於 UNet 和 Transformer 的基礎骨幹的不斷進步，醫學影像分割取得了顯著的成功。然而，現實世界中的臨床診斷通常需要整合領域知識，尤其是文本資訊。進行多模態學習涉及視覺和文本模態，這被認為是一種解決方案，但收集配對的視覺語言數據集既昂貴又耗時，構成了巨大的挑戰。受大型語言模型 (LLM) 在眾多跨模態任務中優異能力的啟發，我們提出了一種新穎的視覺-LLM 結合框架來解決這些問題。具體來說，我們引入了凍結的 LLM，用於基於相應的醫學影像進行零樣本指令生成，模仿放射掃描和報告生成過程。{為了更好地模擬真實世界的診斷過程}，我們從多模態放射影像（例如，T1 加權或 T2 加權 MRI 和 CT）生成更精確的文本指令。基於 LLM 令人印象深刻的語義理解能力和豐富的知識，此過程強調從不同模態中提取特殊特徵，並將資訊重新組合以進行最終的臨床診斷。透過生成的文本指令，我們提出的聯合分割框架可以處理多模態分割，而無需事先收集視覺語言數據集。為了評估我們提出的方法，我們使用有影響力的基準進行了全面的實驗，統計結果和視覺化案例研究證明了我們新方法的優越性。</paragraph>\n", "author": "Siyuan Dai et.al.", "authors": "Siyuan Dai, Kai Ye, Guodong Liu, Haoteng Tang, Liang Zhan", "id": "2504.07336v1", "paper_url": "http://arxiv.org/abs/2504.07336v1", "repo": "null"}}