{"2504.13032": {"publish_time": "2025-04-17", "title": "InstructRAG: Leveraging Retrieval-Augmented Generation on Instruction Graphs for LLM-Based Task Planning", "paper_summary": "Recent advancements in large language models (LLMs) have enabled their use as\nagents for planning complex tasks. Existing methods typically rely on a\nthought-action-observation (TAO) process to enhance LLM performance, but these\napproaches are often constrained by the LLMs' limited knowledge of complex\ntasks. Retrieval-augmented generation (RAG) offers new opportunities by\nleveraging external databases to ground generation in retrieved information. In\nthis paper, we identify two key challenges (enlargability and transferability)\nin applying RAG to task planning. We propose InstructRAG, a novel solution\nwithin a multi-agent meta-reinforcement learning framework, to address these\nchallenges. InstructRAG includes a graph to organize past instruction paths\n(sequences of correct actions), an RL-Agent with Reinforcement Learning to\nexpand graph coverage for enlargability, and an ML-Agent with Meta-Learning to\nimprove task generalization for transferability. The two agents are trained\nend-to-end to optimize overall planning performance. Our experiments on four\nwidely used task planning datasets demonstrate that InstructRAG significantly\nenhances performance and adapts efficiently to new tasks, achieving up to a\n19.2% improvement over the best existing approach.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 的最新進展使其能夠用作規劃複雜任務的代理。現有方法通常依賴於思考-行動-觀察 (TAO) 過程來增強 LLM 的效能，但這些方法通常受到 LLM 對複雜任務的有限知識的限制。檢索增強生成 (RAG) 通過利用外部資料庫將生成基於檢索到的資訊，提供了新的機會。在本文中，我們確定了將 RAG 應用於任務規劃的兩個主要挑戰（可擴展性和可遷移性）。我們提出了 InstructRAG，這是一種在多代理元強化學習框架內的新穎解決方案，用於應對這些挑戰。InstructRAG 包括一個圖表來組織過去的指令路徑（正確動作的序列），一個具有強化學習的 RL-Agent 以擴展圖表覆蓋範圍以提高可擴展性，以及一個具有元學習的 ML-Agent 以改進任務泛化以提高可遷移性。這兩個代理經過端到端訓練，以最佳化整體規劃效能。我們在四個廣泛使用的任務規劃資料集上進行的實驗表明，InstructRAG 可顯著提高效能並有效地適應新任務，比現有的最佳方法提高了 19.2%。</paragraph>\n", "author": "Zheng Wang et.al.", "authors": "Zheng Wang, Shu Xian Teo, Jun Jie Chew, Wei Shi", "id": "2504.13032v1", "paper_url": "http://arxiv.org/abs/2504.13032v1", "repo": "null"}}