{"2405.06134": {"publish_time": "2024-05-09", "title": "Muting Whisper: A Universal Acoustic Adversarial Attack on Speech Foundation Models", "paper_summary": "Recent developments in large speech foundation models like Whisper have led\nto their widespread use in many automatic speech recognition (ASR)\napplications. These systems incorporate `special tokens' in their vocabulary,\nsuch as $\\texttt{<endoftext>}$, to guide their language generation process.\nHowever, we demonstrate that these tokens can be exploited by adversarial\nattacks to manipulate the model's behavior. We propose a simple yet effective\nmethod to learn a universal acoustic realization of Whisper's\n$\\texttt{<endoftext>}$ token, which, when prepended to any speech signal,\nencourages the model to ignore the speech and only transcribe the special\ntoken, effectively `muting' the model. Our experiments demonstrate that the\nsame, universal 0.64-second adversarial audio segment can successfully mute a\ntarget Whisper ASR model for over 97\\% of speech samples. Moreover, we find\nthat this universal adversarial audio segment often transfers to new datasets\nand tasks. Overall this work demonstrates the vulnerability of Whisper models\nto `muting' adversarial attacks, where such attacks can pose both risks and\npotential benefits in real-world settings: for example the attack can be used\nto bypass speech moderation systems, or conversely the attack can also be used\nto protect private speech data.", "paper_summary_zh": "近期大型語音基礎模型（例如 Whisper）的發展，已廣泛運用於許多自動語音辨識 (ASR) 應用程式中。這些系統在其詞彙中加入「特殊符號」，例如 $\\texttt{<endoftext>}$，以引導其語言產生流程。然而，我們證明這些符號可被對抗性攻擊利用，以操控模型的行為。我們提出一個簡單但有效的方法，以學習 Whisper 的 $\\texttt{<endoftext>}$ 符號的通用音響實現，當它被附加到任何語音訊號時，會鼓勵模型忽略語音並僅轉錄特殊符號，有效地「靜音」模型。我們的實驗證明，相同的通用 0.64 秒對抗性音訊片段可以成功靜音目標 Whisper ASR 模型，適用於超過 97% 的語音範例。此外，我們發現這個通用對抗性音訊片段通常可以轉移到新的資料集和任務中。整體而言，這項工作證明了 Whisper 模型容易受到「靜音」對抗性攻擊，此類攻擊在現實世界中可能帶來風險和潛在好處：例如，攻擊可用於繞過語音審核系統，反之，攻擊也可被用於保護私人語音資料。", "author": "Vyas Raina et.al.", "authors": "Vyas Raina, Rao Ma, Charles McGhee, Kate Knill, Mark Gales", "id": "2405.06134v1", "paper_url": "http://arxiv.org/abs/2405.06134v1", "repo": "null"}}