{"2409.05564": {"publish_time": "2024-09-09", "title": "LEROjD: Lidar Extended Radar-Only Object Detection", "paper_summary": "Accurate 3D object detection is vital for automated driving. While lidar\nsensors are well suited for this task, they are expensive and have limitations\nin adverse weather conditions. 3+1D imaging radar sensors offer a\ncost-effective, robust alternative but face challenges due to their low\nresolution and high measurement noise. Existing 3+1D imaging radar datasets\ninclude radar and lidar data, enabling cross-modal model improvements. Although\nlidar should not be used during inference, it can aid the training of\nradar-only object detectors. We explore two strategies to transfer knowledge\nfrom the lidar to the radar domain and radar-only object detectors: 1.\nmulti-stage training with sequential lidar point cloud thin-out, and 2.\ncross-modal knowledge distillation. In the multi-stage process, three thin-out\nmethods are examined. Our results show significant performance gains of up to\n4.2 percentage points in mean Average Precision with multi-stage training and\nup to 3.9 percentage points with knowledge distillation by initializing the\nstudent with the teacher's weights. The main benefit of these approaches is\ntheir applicability to other 3D object detection networks without altering\ntheir architecture, as we show by analyzing it on two different object\ndetectors. Our code is available at https://github.com/rst-tu-dortmund/lerojd", "paper_summary_zh": "精確的 3D 物件偵測對於自動駕駛至關重要。儘管雷達感測器非常適合這項任務，但它們價格昂貴，且在惡劣的天氣條件下有其限制。3+1D 影像雷達感測器提供了具有成本效益且強健的替代方案，但由於它們的低解析度和高量測雜訊而面臨挑戰。現有的 3+1D 影像雷達資料集包含雷達和雷射雷達資料，可進行跨模態模型改善。儘管雷射雷達不應在推論期間使用，但它可以協助訓練僅限雷達的物件偵測器。我們探討了將知識從雷射雷達傳輸到雷達域和僅限雷達的物件偵測器的兩種策略：1. 使用循序雷射雷達點雲細化進行多階段訓練，以及 2. 跨模態知識萃取。在多階段過程中，檢查了三種細化方法。我們的結果顯示，在平均精準度方面，多階段訓練的效能顯著提升了 4.2 個百分點，而透過使用教師的權重來初始化學生，知識萃取的效能則提升了 3.9 個百分點。這些方法的主要好處是它們適用於其他 3D 物件偵測網路，而無需改變其架構，正如我們在兩個不同的物件偵測器上分析所顯示的那樣。我們的程式碼可在 https://github.com/rst-tu-dortmund/lerojd 取得", "author": "Patrick Palmer et.al.", "authors": "Patrick Palmer, Martin Krüger, Stefan Schütte, Richard Altendorfer, Ganesh Adam, Torsten Bertram", "id": "2409.05564v1", "paper_url": "http://arxiv.org/abs/2409.05564v1", "repo": "https://github.com/rst-tu-dortmund/lerojd"}}