{"2412.04974": {"publish_time": "2024-12-06", "title": "Putting the Iterative Training of Decision Trees to the Test on a Real-World Robotic Task", "paper_summary": "In previous research, we developed methods to train decision trees (DT) as\nagents for reinforcement learning tasks, based on deep reinforcement learning\n(DRL) networks. The samples from which the DTs are built, use the environment's\nstate as features and the corresponding action as label. To solve the\nnontrivial task of selecting samples, which on one hand reflect the DRL agent's\ncapabilities of choosing the right action but on the other hand also cover\nenough state space to generalize well, we developed an algorithm to iteratively\ntrain DTs.\n  In this short paper, we apply this algorithm to a real-world implementation\nof a robotic task for the first time. Real-world tasks pose additional\nchallenges compared to simulations, such as noise and delays. The task consists\nof a physical pendulum attached to a cart, which moves on a linear track. By\nmovements to the left and to the right, the pendulum is to be swung in the\nupright position and balanced in the unstable equilibrium. Our results\ndemonstrate the applicability of the algorithm to real-world tasks by\ngenerating a DT whose performance matches the performance of the DRL agent,\nwhile consisting of fewer parameters. This research could be a starting point\nfor distilling DTs from DRL agents to obtain transparent, lightweight models\nfor real-world reinforcement learning tasks.", "paper_summary_zh": "在先前的研究中，我們開發了訓練決策樹 (DT) 的方法，作為基於深度強化學習 (DRL) 網路的強化學習任務的代理。DT 建構的範例使用環境的狀態作為特徵，並將對應的動作作為標籤。為了解決選擇範例的非平凡任務，一方面反映 DRL 代理選擇正確動作的能力，但另一方面也涵蓋足夠的狀態空間以進行良好的概化，我們開發了一種反覆訓練 DT 的演算法。\n在這篇短文中，我們首次將此演算法應用於機器人任務的實際實作。與模擬相比，實際任務會帶來額外的挑戰，例如雜訊和延遲。任務包括連接到小車的物理鐘擺，小車在線性軌道上移動。通過向左和向右移動，鐘擺將擺動到直立位置並在不穩定的平衡狀態下保持平衡。我們的結果證明了演算法對實際任務的適用性，它會產生一個 DT，其效能與 DRL 代理的效能相匹配，同時包含較少的參數。這項研究可以作為從 DRL 代理中萃取 DT 的起點，以取得透明、輕量的模型，用於實際的強化學習任務。", "author": "Raphael C. Engelhardt et.al.", "authors": "Raphael C. Engelhardt, Marcel J. Meinen, Moritz Lange, Laurenz Wiskott, Wolfgang Konen", "id": "2412.04974v1", "paper_url": "http://arxiv.org/abs/2412.04974v1", "repo": "null"}}