{"2504.13150": {"publish_time": "2025-04-17", "title": "Readable Twins of Unreadable Models", "paper_summary": "Creating responsible artificial intelligence (AI) systems is an important\nissue in contemporary research and development of works on AI. One of the\ncharacteristics of responsible AI systems is their explainability. In the\npaper, we are interested in explainable deep learning (XDL) systems. On the\nbasis of the creation of digital twins of physical objects, we introduce the\nidea of creating readable twins (in the form of imprecise information flow\nmodels) for unreadable deep learning models. The complete procedure for\nswitching from the deep learning model (DLM) to the imprecise information flow\nmodel (IIFM) is presented. The proposed approach is illustrated with an example\nof a deep learning classification model for image recognition of handwritten\ndigits from the MNIST data set.", "paper_summary_zh": "<paragraph>打造負責任的人工智慧 (AI) 系統是當代 AI 研究和開發工作中的一個重要議題。負責任的 AI 系統的特性之一就是它們的可解釋性。在本文中，我們感興趣的是可解釋深度學習 (XDL) 系統。在創建物理對象數位分身的基礎上，我們提出了為不可讀的深度學習模型創建可讀分身（以不精確資訊流模型的形式）的想法。本文完整地闡述了從深度學習模型 (DLM) 切換到不精確資訊流模型 (IIFM) 的過程。並以一個深度學習分類模型的例子來說明所提出的方法，該模型用於識別 MNIST 數據集中手寫數字的圖像。</paragraph>\n", "author": "Krzysztof Pancerz et.al.", "authors": "Krzysztof Pancerz, Piotr Kulicki, Michał Kalisz, Andrzej Burda, Maciej Stanisławski, Jaromir Sarzyński", "id": "2504.13150v1", "paper_url": "http://arxiv.org/abs/2504.13150v1", "repo": "null"}}