{"2502.15654": {"publish_time": "2025-02-21", "title": "Machine-generated text detection prevents language model collapse", "paper_summary": "As Large Language Models (LLMs) become increasingly prevalent, their\ngenerated outputs are proliferating across the web, risking a future where\nmachine-generated content dilutes human-authored text. Since web data is the\nprimary resource for LLM pretraining, future models will be trained on an\nunknown portion of synthetic data. This will lead to model collapse, a\ndegenerative process which causes models to reinforce their own errors and\nexperience a drop in model performance. In this study, we investigate the\nimpact of decoding strategy on model collapse, where we analyse the\ncharacteristics of the generated data during recursive training, its similarity\nto human references and the resulting model performance. Using the decoding\nstrategies that lead to the most significant model degradation, we tackle the\nquestion: how to avoid model collapse when the origin (human or synthetic) of\nthe training data is unknown. We design a novel methodology based on resampling\nthe data distribution using importance weights from our machine-generated text\ndetector. Our method is validated on two LLM variants (GPT-2 and SmolLM2) on\nthe open-ended text generation task, demonstrating that we can successfully\nprevent model collapse and when there is enough human-authored data in the\ntraining dataset, our method improves model performance.", "paper_summary_zh": "隨著大型語言模型 (LLM) 變得越來越普遍，它們產生的輸出在網路中大量增加，冒著未來機器產生的內容稀釋人類撰寫文字的風險。由於網路資料是 LLM 預訓練的主要資源，未來的模型將在未知部分的合成資料上進行訓練。這將導致模型崩潰，一種退化過程，導致模型強化它們自己的錯誤並經歷模型效能下降。在本研究中，我們探討解碼策略對模型崩潰的影響，我們在遞迴訓練過程中分析生成資料的特徵、它與人類參考的相似性以及產生的模型效能。使用導致最顯著模型退化的解碼策略，我們解決這個問題：當訓練資料的來源（人類或合成）未知時，如何避免模型崩潰。我們設計了一種新的方法，基於使用我們機器產生的文字偵測器的重要性權重對資料分佈進行重新取樣。我們的模型在兩個 LLM 變體（GPT-2 和 SmolLM2）上針對開放式文字生成任務進行驗證，證明我們可以成功防止模型崩潰，並且當訓練資料集中有足夠的人類撰寫資料時，我們的模型可以改善模型效能。", "author": "George Drayson et.al.", "authors": "George Drayson, Vasileios Lampos", "id": "2502.15654v1", "paper_url": "http://arxiv.org/abs/2502.15654v1", "repo": "null"}}