{"2405.11151": {"publish_time": "2024-05-18", "title": "Multi-scale Information Sharing and Selection Network with Boundary Attention for Polyp Segmentation", "paper_summary": "Polyp segmentation for colonoscopy images is of vital importance in clinical\npractice. It can provide valuable information for colorectal cancer diagnosis\nand surgery. While existing methods have achieved relatively good performance,\npolyp segmentation still faces the following challenges: (1) Varying lighting\nconditions in colonoscopy and differences in polyp locations, sizes, and\nmorphologies. (2) The indistinct boundary between polyps and surrounding\ntissue. To address these challenges, we propose a Multi-scale information\nsharing and selection network (MISNet) for polyp segmentation task. We design a\nSelectively Shared Fusion Module (SSFM) to enforce information sharing and\nactive selection between low-level and high-level features, thereby enhancing\nmodel's ability to capture comprehensive information. We then design a Parallel\nAttention Module (PAM) to enhance model's attention to boundaries, and a\nBalancing Weight Module (BWM) to facilitate the continuous refinement of\nboundary segmentation in the bottom-up process. Experiments on five polyp\nsegmentation datasets demonstrate that MISNet successfully improved the\naccuracy and clarity of segmentation result, outperforming state-of-the-art\nmethods.", "paper_summary_zh": "大腸鏡檢查影像中的息肉分割在臨床實務上至關重要。它可以提供有價值的資訊用於大腸癌的診斷和手術。儘管現有方法已取得相對良好的效能，息肉分割仍面臨以下挑戰：(1) 大腸鏡檢查中不同的照明條件，以及息肉位置、大小和形態的差異。(2) 息肉與周圍組織之間模糊的邊界。為了應對這些挑戰，我們提出一個用於息肉分割任務的多尺度資訊共享和選擇網路 (MISNet)。我們設計了一個選擇性共享融合模組 (SSFM) 來強制執行低階和高階特徵之間的資訊共享和主動選擇，從而增強模型擷取全面資訊的能力。然後，我們設計了一個平行注意力模組 (PAM) 來增強模型對邊界的注意力，以及一個平衡權重模組 (BWM) 來促進自下而上的過程中邊界分割的持續精煉。在五個息肉分割資料集上的實驗證明，MISNet 成功地改善了分割結果的準確性和清晰度，優於現有技術。", "author": "Xiaolu Kang et.al.", "authors": "Xiaolu Kang, Zhuoqi Ma, Kang Liu, Yunan Li, Qiguang Miao", "id": "2405.11151v1", "paper_url": "http://arxiv.org/abs/2405.11151v1", "repo": "null"}}