{"2501.14728": {"publish_time": "2025-01-24", "title": "Mitigating GenAI-powered Evidence Pollution for Out-of-Context Multimodal Misinformation Detection", "paper_summary": "While large generative artificial intelligence (GenAI) models have achieved\nsignificant success, they also raise growing concerns about online information\nsecurity due to their potential misuse for generating deceptive content.\nOut-of-context (OOC) multimodal misinformation detection, which often retrieves\nWeb evidence to identify the repurposing of images in false contexts, faces the\nissue of reasoning over GenAI-polluted evidence to derive accurate predictions.\nExisting works simulate GenAI-powered pollution at the claim level with\nstylistic rewriting to conceal linguistic cues, and ignore evidence-level\npollution for such information-seeking applications. In this work, we\ninvestigate how polluted evidence affects the performance of existing OOC\ndetectors, revealing a performance degradation of more than 9 percentage\npoints. We propose two strategies, cross-modal evidence reranking and\ncross-modal claim-evidence reasoning, to address the challenges posed by\npolluted evidence. Extensive experiments on two benchmark datasets show that\nthese strategies can effectively enhance the robustness of existing\nout-of-context detectors amidst polluted evidence.", "paper_summary_zh": "儘管大型生成式人工智能 (GenAI) 模型已取得顯著的成功，但由於它們可能被誤用來產生具有欺騙性的內容，因此也引發了人們對線上資訊安全的擔憂。\n語境外 (OOC) 多模態錯誤資訊偵測通常會擷取網路證據來識別錯誤語境中影像的再利用，它面臨著必須對受到 GenAI 汙染的證據進行推理才能得出準確預測的問題。\n現有作品會以風格化改寫的方式在宣稱層級模擬由 GenAI 驅動的汙染，以隱藏語言線索，並忽略此類資訊搜尋應用程式的證據層級汙染。在這項工作中，我們探討受到汙染的證據如何影響現有 OOC 偵測器的效能，揭露了超過 9 個百分點的效能下降。我們提出了兩種策略，交叉模態證據重新排序和交叉模態宣稱-證據推理，來解決受到汙染的證據所帶來的挑戰。在兩個基準資料集上進行的廣泛實驗顯示，這些策略可以在受到汙染的證據中有效提升現有語境外偵測器的穩健性。", "author": "Zehong Yan et.al.", "authors": "Zehong Yan, Peng Qi, Wynne Hsu, Mong Li Lee", "id": "2501.14728v1", "paper_url": "http://arxiv.org/abs/2501.14728v1", "repo": "null"}}