{"2501.10332": {"publish_time": "2025-01-17", "title": "Agent4Edu: Generating Learner Response Data by Generative Agents for Intelligent Education Systems", "paper_summary": "Personalized learning represents a promising educational strategy within\nintelligent educational systems, aiming to enhance learners' practice\nefficiency. However, the discrepancy between offline metrics and online\nperformance significantly impedes their progress. To address this challenge, we\nintroduce Agent4Edu, a novel personalized learning simulator leveraging recent\nadvancements in human intelligence through large language models (LLMs).\nAgent4Edu features LLM-powered generative agents equipped with learner profile,\nmemory, and action modules tailored to personalized learning algorithms. The\nlearner profiles are initialized using real-world response data, capturing\npractice styles and cognitive factors. Inspired by human psychology theory, the\nmemory module records practice facts and high-level summaries, integrating\nreflection mechanisms. The action module supports various behaviors, including\nexercise understanding, analysis, and response generation. Each agent can\ninteract with personalized learning algorithms, such as computerized adaptive\ntesting, enabling a multifaceted evaluation and enhancement of customized\nservices. Through a comprehensive assessment, we explore the strengths and\nweaknesses of Agent4Edu, emphasizing the consistency and discrepancies in\nresponses between agents and human learners. The code, data, and appendix are\npublicly available at https://github.com/bigdata-ustc/Agent4Edu.", "paper_summary_zh": "個人化學習代表著智慧教育系統中一個有前途的教育策略，目標是提升學習者的練習效率。然而，離線指標和線上表現之間的差異顯著地阻礙了他們的進度。為了應對這個挑戰，我們引入了 Agent4Edu，一個新穎的個人化學習模擬器，透過大型語言模型 (LLM) 利用人類智慧的最新進展。Agent4Edu 的特色是搭載 LLM 的生成式代理，配備學習者檔案、記憶體和專門針對個人化學習演算法的動作模組。學習者檔案使用真實世界的回應資料初始化，擷取練習風格和認知因素。受到人類心理學理論的啟發，記憶體模組記錄練習事實和高階摘要，整合反思機制。動作模組支援各種行為，包括練習理解、分析和回應產生。每個代理都可以與個人化學習演算法互動，例如電腦化適性測驗，讓客製化服務能夠進行多方面的評量和強化。透過全面的評估，我們探討 Agent4Edu 的優點和缺點，強調代理和人類學習者之間回應的一致性和差異。程式碼、資料和附錄已在 https://github.com/bigdata-ustc/Agent4Edu 公開。", "author": "Weibo Gao et.al.", "authors": "Weibo Gao, Qi Liu, Linan Yue, Fangzhou Yao, Rui Lv, Zheng Zhang, Hao Wang, Zhenya Huang", "id": "2501.10332v1", "paper_url": "http://arxiv.org/abs/2501.10332v1", "repo": "null"}}