{"2501.04067": {"publish_time": "2025-01-07", "title": "Explainable Time Series Prediction of Tyre Energy in Formula One Race Strategy", "paper_summary": "Formula One (F1) race strategy takes place in a high-pressure and fast-paced\nenvironment where split-second decisions can drastically affect race results.\nTwo of the core decisions of race strategy are when to make pit stops (i.e.\nreplace the cars' tyres) and which tyre compounds (hard, medium or soft, in\nnormal conditions) to select. The optimal pit stop decisions can be determined\nby estimating the tyre degradation of these compounds, which in turn can be\ncomputed from the energy applied to each tyre, i.e. the tyre energy. In this\nwork, we trained deep learning models, using the Mercedes-AMG PETRONAS F1\nteam's historic race data consisting of telemetry, to forecast tyre energies\nduring races. Additionally, we fitted XGBoost, a decision tree-based machine\nlearning algorithm, to the same dataset and compared the results, with both\ngiving impressive performance. Furthermore, we incorporated two different\nexplainable AI methods, namely feature importance and counterfactual\nexplanations, to gain insights into the reasoning behind the forecasts. Our\ncontributions thus result in an explainable, automated method which could\nassist F1 teams in optimising their race strategy.", "paper_summary_zh": "一級方程式 (F1) 賽車策略在高壓和快節奏的環境中進行，其中瞬間的決定可能會劇烈影響比賽結果。賽車策略的兩個核心決定是何時進站 (即更換賽車輪胎) 以及選擇哪種輪胎配方 (在正常情況下為硬胎、中性胎或軟胎)。最佳進站決策可透過估計這些配方的輪胎磨損來決定，而輪胎磨損反過來又可從施加在每個輪胎上的能量 (即輪胎能量) 計算出來。在這項工作中，我們使用 Mercedes-AMG PETRONAS F1 車隊的歷史比賽數據 (包含遙測) 訓練深度學習模型，以預測比賽期間的輪胎能量。此外，我們將 XGBoost (一種基於決策樹的機器學習演算法) 安裝到相同的資料集，並比較結果，兩者都表現出色。此外，我們納入了兩種不同的可解釋 AI 方法，即特徵重要性和反事實解釋，以深入了解預測背後的推理。因此，我們的貢獻造就了一種可解釋的自動化方法，可協助 F1 車隊優化其比賽策略。", "author": "Jamie Todd et.al.", "authors": "Jamie Todd, Junqi Jiang, Aaron Russo, Steffen Winkler, Stuart Sale, Joseph McMillan, Antonio Rago", "id": "2501.04067v1", "paper_url": "http://arxiv.org/abs/2501.04067v1", "repo": "null"}}