{"2405.10025": {"publish_time": "2024-05-16", "title": "Listen Again and Choose the Right Answer: A New Paradigm for Automatic Speech Recognition with Large Language Models", "paper_summary": "Recent advances in large language models (LLMs) have promoted generative\nerror correction (GER) for automatic speech recognition (ASR), which aims to\npredict the ground-truth transcription from the decoded N-best hypotheses.\nThanks to the strong language generation ability of LLMs and rich information\nin the N-best list, GER shows great effectiveness in enhancing ASR results.\nHowever, it still suffers from two limitations: 1) LLMs are unaware of the\nsource speech during GER, which may lead to results that are grammatically\ncorrect but violate the source speech content, 2) N-best hypotheses usually\nonly vary in a few tokens, making it redundant to send all of them for GER,\nwhich could confuse LLM about which tokens to focus on and thus lead to\nincreased miscorrection. In this paper, we propose ClozeGER, a new paradigm for\nASR generative error correction. First, we introduce a multimodal LLM (i.e.,\nSpeechGPT) to receive source speech as extra input to improve the fidelity of\ncorrection output. Then, we reformat GER as a cloze test with logits\ncalibration to remove the input information redundancy and simplify GER with\nclear instructions. Experiments show that ClozeGER achieves a new breakthrough\nover vanilla GER on 9 popular ASR datasets.", "paper_summary_zh": "最近大型语言模型 (LLM) 的进步促进了生成式错误校正 (GER)，用于自动语音识别 (ASR)，其目标是从解码后的 N 个最佳假设中预测真实转录。\n由于 LLM 强大的语言生成能力和 N 个最佳列表中的丰富信息，GER 在增强 ASR 结果方面显示出极佳的有效性。\n然而，它仍然存在两个限制：1) LLM 在 GER 期间不知道源语音，这可能导致结果在语法上正确，但违反源语音内容，2) N 个最佳假设通常只在几个标记中有所不同，因此将它们全部发送到 GER 是多余的，这可能会混淆 LLM 应该关注哪些标记，从而导致错误校正增加。在本文中，我们提出了 ClozeGER，这是一种用于 ASR 生成式错误校正的新范例。首先，我们引入了一个多模态 LLM（即 SpeechGPT）来接收源语音作为额外的输入，以提高校正输出的保真度。然后，我们将 GER 重新格式化为完形填空测试，并进行 logit 校准，以消除输入信息冗余并简化 GER，并提供明确的说明。实验表明，ClozeGER 在 9 个流行的 ASR 数据集上实现了对香草 GER 的新突破。", "author": "Yuchen Hu et.al.", "authors": "Yuchen Hu, Chen Chen, Chengwei Qin, Qiushi Zhu, Eng Siong Chng, Ruizhe Li", "id": "2405.10025v1", "paper_url": "http://arxiv.org/abs/2405.10025v1", "repo": "null"}}