{"2501.12456": {"publish_time": "2025-01-21", "title": "Deploying Privacy Guardrails for LLMs: A Comparative Analysis of Real-World Applications", "paper_summary": "The adoption of Large Language Models (LLMs) has revolutionized AI\napplications but poses significant challenges in safeguarding user privacy.\nEnsuring compliance with privacy regulations such as GDPR and CCPA while\naddressing nuanced privacy risks requires robust and scalable frameworks. This\npaper presents a detailed study of OneShield Privacy Guard, a framework\ndesigned to mitigate privacy risks in user inputs and LLM outputs across\nenterprise and open-source settings. We analyze two real-world deployments:(1)\na multilingual privacy-preserving system integrated with Data and Model\nFactory, focusing on enterprise-scale data governance; and (2) PR Insights, an\nopen-source repository emphasizing automated triaging and community-driven\nrefinements. In Deployment 1, OneShield achieved a 0.95 F1 score in detecting\nsensitive entities like dates, names, and phone numbers across 26 languages,\noutperforming state-of-the-art tool such as StarPII and Presidio by up to 12\\%.\nDeployment 2, with an average F1 score of 0.86, reduced manual effort by over\n300 hours in three months, accurately flagging 8.25\\% of 1,256 pull requests\nfor privacy risks with enhanced context sensitivity. These results demonstrate\nOneShield's adaptability and efficacy in diverse environments, offering\nactionable insights for context-aware entity recognition, automated compliance,\nand ethical AI adoption. This work advances privacy-preserving frameworks,\nsupporting user trust and compliance across operational contexts.", "paper_summary_zh": "大型語言模型 (LLM) 的採用徹底改變了 AI 應用，但在保護使用者隱私方面卻帶來重大挑戰。在解決細微的隱私風險時，確保符合 GDPR 和 CCPA 等隱私法規，需要強大且可擴充的架構。本文詳細探討了 OneShield Privacy Guard，這是一個旨在減輕使用者輸入和 LLM 輸出中隱私風險的架構，適用於企業和開源設定。我們分析了兩個實際部署：(1) 與資料和模型工廠整合的多語言隱私保護系統，專注於企業規模的資料治理；(2) PR Insights，一個強調自動分流和社群驅動改良的開源儲存庫。在部署 1 中，OneShield 在偵測 26 種語言中日期、姓名和電話號碼等敏感實體時，達到了 0.95 的 F1 分數，優於 StarPII 和 Presidio 等最先進的工具，高出 12%。部署 2 的平均 F1 分數為 0.86，在三個月內減少了超過 300 小時的徒手工作，準確地標記了 1,256 個提交請求的 8.25%，指出隱私風險並提高了情境敏感度。這些結果證明了 OneShield 在不同環境中的適應性和有效性，為情境感知實體辨識、自動化合規和道德 AI 採用提供了可行的見解。這項工作推動了隱私保護架構，支援使用者信任和跨作業情境的合規性。", "author": "Shubhi Asthana et.al.", "authors": "Shubhi Asthana, Bing Zhang, Ruchi Mahindru, Chad DeLuca, Anna Lisa Gentile, Sandeep Gopisetty", "id": "2501.12456v1", "paper_url": "http://arxiv.org/abs/2501.12456v1", "repo": "null"}}