{"2409.16220": {"publish_time": "2024-09-24", "title": "Towards Enhancing Linked Data Retrieval in Conversational UIs using Large Language Models", "paper_summary": "Despite the recent broad adoption of Large Language Models (LLMs) across\nvarious domains, their potential for enriching information systems in\nextracting and exploring Linked Data (LD) and Resource Description Framework\n(RDF) triplestores has not been extensively explored. This paper examines the\nintegration of LLMs within existing systems, emphasising the enhancement of\nconversational user interfaces (UIs) and their capabilities for data extraction\nby producing more accurate SPARQL queries without the requirement for model\nretraining. Typically, conversational UI models necessitate retraining with the\nintroduction of new datasets or updates, limiting their functionality as\ngeneral-purpose extraction tools. Our approach addresses this limitation by\nincorporating LLMs into the conversational UI workflow, significantly enhancing\ntheir ability to comprehend and process user queries effectively. By leveraging\nthe advanced natural language understanding capabilities of LLMs, our method\nimproves RDF entity extraction within web systems employing conventional\nchatbots. This integration facilitates a more nuanced and context-aware\ninteraction model, critical for handling the complex query patterns often\nencountered in RDF datasets and Linked Open Data (LOD) endpoints. The\nevaluation of this methodology shows a marked enhancement in system\nexpressivity and the accuracy of responses to user queries, indicating a\npromising direction for future research in this area. This investigation not\nonly underscores the versatility of LLMs in enhancing existing information\nsystems but also sets the stage for further explorations into their potential\napplications within more specialised domains of web information systems.", "paper_summary_zh": "儘管大型語言模型 (LLM) 近期廣泛地被採用於各種領域，它們在豐富資訊系統中萃取和探索連結資料 (LD) 和資源描述架構 (RDF) 三聯儲存庫的潛力尚未被廣泛探討。本文探討在現有系統中整合 LLM，強調對話式使用者介面 (UI) 的強化，以及它們在無需重新訓練模型的情況下產生更精確的 SPARQL 查詢，以進行資料萃取的能力。一般來說，對話式 UI 模型需要在引入新的資料集或更新時重新訓練，這限制了它們作為通用萃取工具的功能。我們的做法透過將 LLM 整合到對話式 UI 工作流程中來解決這個限制，大幅提升它們理解和有效處理使用者查詢的能力。透過利用 LLM 的進階自然語言理解能力，我們的做法改善了採用傳統聊天機器人的網路系統中的 RDF 實體萃取。這種整合促成了一個更細緻且具備情境感知的互動模型，這對於處理 RDF 資料集和連結開放資料 (LOD) 端點中經常遇到的複雜查詢模式至關重要。對此方法的評估顯示系統表達能力和對使用者查詢回應的準確度都有顯著的提升，這表示此領域未來的研究有望朝這個方向發展。這項調查不僅強調了 LLM 在強化現有資訊系統方面的多功能性，也為進一步探索它們在更專業的網路資訊系統領域中的潛在應用奠定了基礎。", "author": "Omar Mussa et.al.", "authors": "Omar Mussa, Omer Rana, Benoît Goossens, Pablo Orozco-Terwengel, Charith Perera", "id": "2409.16220v1", "paper_url": "http://arxiv.org/abs/2409.16220v1", "repo": "null"}}