{"2410.21909": {"publish_time": "2024-10-29", "title": "SceneGenAgent: Precise Industrial Scene Generation with Coding Agent", "paper_summary": "The modeling of industrial scenes is essential for simulations in industrial\nmanufacturing. While large language models (LLMs) have shown significant\nprogress in generating general 3D scenes from textual descriptions, generating\nindustrial scenes with LLMs poses a unique challenge due to their demand for\nprecise measurements and positioning, requiring complex planning over spatial\narrangement. To address this challenge, we introduce SceneGenAgent, an\nLLM-based agent for generating industrial scenes through C# code. SceneGenAgent\nensures precise layout planning through a structured and calculable format,\nlayout verification, and iterative refinement to meet the quantitative\nrequirements of industrial scenarios. Experiment results demonstrate that LLMs\npowered by SceneGenAgent exceed their original performance, reaching up to\n81.0% success rate in real-world industrial scene generation tasks and\neffectively meeting most scene generation requirements. To further enhance\naccessibility, we construct SceneInstruct, a dataset designed for fine-tuning\nopen-source LLMs to integrate into SceneGenAgent. Experiments show that\nfine-tuning open-source LLMs on SceneInstruct yields significant performance\nimprovements, with Llama3.1-70B approaching the capabilities of GPT-4o. Our\ncode and data are available at https://github.com/THUDM/SceneGenAgent .", "paper_summary_zh": "工業場景的建模對於工業製造中的模擬至關重要。雖然大型語言模型 (LLM) 在從文本描述中生成一般 3D 場景方面已展現出顯著進展，但由於工業場景需要精確的測量和定位，因此使用 LLM 生成工業場景會構成獨特的挑戰，需要對空間配置進行複雜的規劃。為了應對這一挑戰，我們引入了 SceneGenAgent，這是一個基於 LLM 的代理，可透過 C# 程式碼生成工業場景。SceneGenAgent 透過結構化且可計算的格式、配置驗證和反覆改進來確保精確的配置規劃，以滿足工業場景的量化需求。實驗結果表明，由 SceneGenAgent 提供支援的 LLM 超越了其原始效能，在真實世界的工業場景生成任務中達到高達 81.0% 的成功率，並有效滿足大多數場景生成需求。為了進一步提高可及性，我們建構了 SceneInstruct，這是一個資料集，旨在微調開源 LLM 以整合到 SceneGenAgent 中。實驗表明，在 SceneInstruct 上微調開源 LLM 會產生顯著的效能提升，其中 Llama3.1-70B 接近 GPT-4o 的能力。我們的程式碼和資料可在 https://github.com/THUDM/SceneGenAgent 取得。", "author": "Xiao Xia et.al.", "authors": "Xiao Xia, Dan Zhang, Zibo Liao, Zhenyu Hou, Tianrui Sun, Jing Li, Ling Fu, Yuxiao Dong", "id": "2410.21909v1", "paper_url": "http://arxiv.org/abs/2410.21909v1", "repo": "https://github.com/thudm/scenegenagent"}}