{"2411.08249": {"publish_time": "2024-11-12", "title": "Retrieval Augmented Time Series Forecasting", "paper_summary": "Retrieval-augmented generation (RAG) is a central component of modern LLM\nsystems, particularly in scenarios where up-to-date information is crucial for\naccurately responding to user queries or when queries exceed the scope of the\ntraining data. The advent of time-series foundation models (TSFM), such as\nChronos, and the need for effective zero-shot forecasting performance across\nvarious time-series domains motivates the question: Do benefits of RAG\nsimilarly carry over to time series forecasting? In this paper, we advocate\nthat the dynamic and event-driven nature of time-series data makes RAG a\ncrucial component of TSFMs and introduce a principled RAG framework for\ntime-series forecasting, called Retrieval Augmented Forecasting (RAF). Within\nRAF, we develop efficient strategies for retrieving related time-series\nexamples and incorporating them into forecast. Through experiments and\nmechanistic studies, we demonstrate that RAF indeed improves the forecasting\naccuracy across diverse time series domains and the improvement is more\nsignificant for larger TSFM sizes.", "paper_summary_zh": "檢索增強生成 (RAG) 是現代 LLM 系統的核心組成部分，特別是在即時資訊對於準確回應使用者查詢或查詢超出訓練資料範圍至關重要的場景中。時序基礎模型 (TSFM) 的出現，例如 Chronos，以及跨各種時序領域的有效零次學習預測效能需求，激發了一個問題：RAG 的好處是否也同樣適用於時序預測？在本文中，我們主張時序資料的動態和事件驅動特性使 RAG 成為 TSFM 的關鍵組成部分，並介紹了一個用於時序預測的原則性 RAG 架構，稱為檢索增強預測 (RAF)。在 RAF 中，我們開發了有效的策略來檢索相關的時序範例，並將它們納入預測中。透過實驗和機制研究，我們證明 RAF 確實改善了不同時序領域的預測準確度，而且對於較大的 TSFM 規模來說，改善更顯著。", "author": "Kutay Tire et.al.", "authors": "Kutay Tire, Ege Onur Taga, Muhammed Emrullah Ildiz, Samet Oymak", "id": "2411.08249v1", "paper_url": "http://arxiv.org/abs/2411.08249v1", "repo": "https://github.com/kutaytire/retrieval-augmented-time-series-forecasting"}}