{"2412.15628": {"publish_time": "2024-12-20", "title": "Can Input Attributions Interpret the Inductive Reasoning Process Elicited in In-Context Learning?", "paper_summary": "Elucidating the rationale behind neural models' outputs has been challenging\nin the machine learning field, which is indeed applicable in this age of large\nlanguage models (LLMs) and in-context learning (ICL). When it comes to\nestimating input attributions (IA), ICL poses a new issue of interpreting which\nexample in the prompt, consisting of a set of examples, contributed to\nidentifying the task/rule to be solved. To this end, in this paper, we\nintroduce synthetic diagnostic tasks inspired by the poverty of the stimulus\ndesign in inductive reasoning; here, most in-context examples are ambiguous\nw.r.t. their underlying rule, and one critical example disambiguates the task\ndemonstrated. The question is whether conventional IA methods can identify such\nan example in interpreting the inductive reasoning process in ICL. Our\nexperiments provide several practical findings; for example, a certain simple\nIA method works the best, and the larger the model, the generally harder it is\nto interpret the ICL with gradient-based IA methods.", "paper_summary_zh": "闡明神經模型輸出的基本原理一直是機器學習領域的挑戰，這在大型語言模型 (LLM) 和情境學習 (ICL) 的時代確實適用。在估計輸入歸因 (IA) 時，ICL 提出了一個新的問題，即解釋提示中的哪個範例（由一組範例組成）有助於識別要解決的任務/規則。為此，在本文中，我們引入了受歸納推理中刺激設計的貧乏性啟發的合成診斷任務；在這裡，大多數情境範例在其底層規則方面都是模稜兩可的，而一個關鍵範例消除了任務演示的歧義。問題在於傳統的 IA 方法是否可以在解釋 ICL 中的歸納推理過程中識別這樣的範例。我們的實驗提供了幾個實用的發現；例如，某種簡單的 IA 方法效果最好，而且模型越大，通常使用基於梯度的 IA 方法解釋 ICL 就越困難。", "author": "Mengyu Ye et.al.", "authors": "Mengyu Ye, Tatsuki Kuribayashi, Goro Kobayashi, Jun Suzuki", "id": "2412.15628v1", "paper_url": "http://arxiv.org/abs/2412.15628v1", "repo": "null"}}