{"2408.10096": {"publish_time": "2024-08-19", "title": "Convert and Speak: Zero-shot Accent Conversion with Minimum Supervision", "paper_summary": "Low resource of parallel data is the key challenge of accent conversion(AC)\nproblem in which both the pronunciation units and prosody pattern need to be\nconverted. We propose a two-stage generative framework \"convert-and-speak\" in\nwhich the conversion is only operated on the semantic token level and the\nspeech is synthesized conditioned on the converted semantic token with a speech\ngenerative model in target accent domain. The decoupling design enables the\n\"speaking\" module to use massive amount of target accent speech and relieves\nthe parallel data required for the \"conversion\" module. Conversion with the\nbridge of semantic token also relieves the requirement for the data with text\ntranscriptions and unlocks the usage of language pre-training technology to\nfurther efficiently reduce the need of parallel accent speech data. To reduce\nthe complexity and latency of \"speaking\", a single-stage AR generative model is\ndesigned to achieve good quality as well as lower computation cost. Experiments\non Indian-English to general American-English conversion show that the proposed\nframework achieves state-of-the-art performance in accent similarity, speech\nquality, and speaker maintenance with only 15 minutes of weakly parallel data\nwhich is not constrained to the same speaker. Extensive experimentation with\ndiverse accent types suggests that this framework possesses a high degree of\nadaptability, making it readily scalable to accommodate other accents with\nlow-resource data. Audio samples are available at\nhttps://www.microsoft.com/en-us/research/project/convert-and-speak-zero-shot-accent-conversion-with-minimumsupervision/.", "paper_summary_zh": "平行資料資源不足是口音轉換 (AC) 問題的主要挑戰，在口音轉換問題中，發音單位和韻律模式都需要轉換。我們提出了一個兩階段生成架構「轉換和說話」，其中轉換僅在語意標記層級上執行，而語音則根據目標口音領域中語音生成模型轉換的語意標記進行合成。解耦設計使「說話」模組能夠使用大量的目標口音語音，並減輕「轉換」模組所需的平行資料。使用語意標記作為橋樑的轉換也減輕了對具有文字轉錄資料的要求，並解鎖了語言預訓練技術的使用，進一步有效地減少了對平行口音語音資料的需求。為了降低「說話」的複雜性和延遲，「單階段 AR 生成模型」被設計為既能達到良好的品質，又能降低運算成本。印度英語到一般美式英語轉換的實驗表明，所提出的架構在口音相似度、語音品質和說話者維護方面達到了最先進的效能，而僅需 15 分鐘的弱平行資料，且不受限於同一個說話者。使用不同口音類型的廣泛實驗表明，此架構具備高度的適應性，使其能夠輕鬆地擴展到使用低資源資料容納其他口音。音訊範例可在 https://www.microsoft.com/en-us/research/project/convert-and-speak-zero-shot-accent-conversion-with-minimumsupervision/ 取得。", "author": "Zhijun Jia et.al.", "authors": "Zhijun Jia, Huaying Xue, Xiulian Peng, Yan Lu", "id": "2408.10096v1", "paper_url": "http://arxiv.org/abs/2408.10096v1", "repo": "null"}}