{"2412.13663": {"publish_time": "2024-12-18", "title": "Smarter, Better, Faster, Longer: A Modern Bidirectional Encoder for Fast, Memory Efficient, and Long Context Finetuning and Inference", "paper_summary": "Encoder-only transformer models such as BERT offer a great performance-size\ntradeoff for retrieval and classification tasks with respect to larger\ndecoder-only models. Despite being the workhorse of numerous production\npipelines, there have been limited Pareto improvements to BERT since its\nrelease. In this paper, we introduce ModernBERT, bringing modern model\noptimizations to encoder-only models and representing a major Pareto\nimprovement over older encoders. Trained on 2 trillion tokens with a native\n8192 sequence length, ModernBERT models exhibit state-of-the-art results on a\nlarge pool of evaluations encompassing diverse classification tasks and both\nsingle and multi-vector retrieval on different domains (including code). In\naddition to strong downstream performance, ModernBERT is also the most speed\nand memory efficient encoder and is designed for inference on common GPUs.", "paper_summary_zh": "僅編碼器轉換器模型，例如 BERT，對於檢索和分類任務，提供了相對於較大的僅解碼器模型的出色效能大小權衡。儘管是許多生產管線的運作主軸，但自 BERT 發布以來，Pareto 改進一直很有限。在本文中，我們引入了 ModernBERT，將現代模型最佳化帶入僅編碼器模型，並代表了相較於舊編碼器的一項重大 Pareto 改進。ModernBERT 模型以 2 兆個符號和原生 8192 順序長度進行訓練，在包含各種分類任務和不同領域（包括程式碼）的單向量和多向量檢索的大型評估池中展現了最先進的結果。除了強大的下游效能之外，ModernBERT 也是速度和記憶體最有效率的編碼器，並設計用於在常見 GPU 上進行推論。", "author": "Benjamin Warner et.al.", "authors": "Benjamin Warner, Antoine Chaffin, Benjamin Clavié, Orion Weller, Oskar Hallström, Said Taghadouini, Alexis Gallagher, Raja Biswas, Faisal Ladhak, Tom Aarsen, Nathan Cooper, Griffin Adams, Jeremy Howard, Iacopo Poli", "id": "2412.13663v1", "paper_url": "http://arxiv.org/abs/2412.13663v1", "repo": "null"}}