{"2406.05930": {"publish_time": "2024-06-09", "title": "Semisupervised Neural Proto-Language Reconstruction", "paper_summary": "Existing work implementing comparative reconstruction of ancestral languages\n(proto-languages) has usually required full supervision. However, historical\nreconstruction models are only of practical value if they can be trained with a\nlimited amount of labeled data. We propose a semisupervised historical\nreconstruction task in which the model is trained on only a small amount of\nlabeled data (cognate sets with proto-forms) and a large amount of unlabeled\ndata (cognate sets without proto-forms). We propose a neural architecture for\ncomparative reconstruction (DPD-BiReconstructor) incorporating an essential\ninsight from linguists' comparative method: that reconstructed words should not\nonly be reconstructable from their daughter words, but also deterministically\ntransformable back into their daughter words. We show that this architecture is\nable to leverage unlabeled cognate sets to outperform strong semisupervised\nbaselines on this novel task.", "paper_summary_zh": "現有的工作實施祖語的比較重建（原始語言）通常需要完全監督。然而，歷史重建模型只有在使用有限標記資料訓練時才有實用價值。我們提出一個半監督的歷史重建任務，其中模型僅使用少量標記資料（具有原始形式的同源詞組）和大量的未標記資料（沒有原始形式的同源詞組）進行訓練。我們提出了一個比較重建的神經架構（DPD-BiReconstructor），其中融入了語言學家比較方法的一項基本見解：重建的詞彙不僅應該可以從它們的子詞重建，而且還應該可以確定性地轉換回它們的子詞。我們表明，這種架構能夠利用未標記的同源詞組，在這個新任務中優於強大的半監督基準。", "author": "Liang Lu et.al.", "authors": "Liang Lu, Peirong Xie, David R. Mortensen", "id": "2406.05930v1", "paper_url": "http://arxiv.org/abs/2406.05930v1", "repo": "null"}}