{"2405.11942": {"publish_time": "2024-05-20", "title": "FAME-MT Dataset: Formality Awareness Made Easy for Machine Translation Purposes", "paper_summary": "People use language for various purposes. Apart from sharing information,\nindividuals may use it to express emotions or to show respect for another\nperson. In this paper, we focus on the formality level of machine-generated\ntranslations and present FAME-MT -- a dataset consisting of 11.2 million\ntranslations between 15 European source languages and 8 European target\nlanguages classified to formal and informal classes according to target\nsentence formality. This dataset can be used to fine-tune machine translation\nmodels to ensure a given formality level for each European target language\nconsidered. We describe the dataset creation procedure, the analysis of the\ndataset's quality showing that FAME-MT is a reliable source of language\nregister information, and we present a publicly available proof-of-concept\nmachine translation model that uses the dataset to steer the formality level of\nthe translation. Currently, it is the largest dataset of formality annotations,\nwith examples expressed in 112 European language pairs. The dataset is\npublished online: https://github.com/laniqo-public/fame-mt/ .", "paper_summary_zh": "人們使用語言的目的是多種多樣的。除了共享資訊之外，個人可能會使用語言來表達情緒或表示對他人的尊重。在本文中，我們專注於機器產生的翻譯的正式程度，並提出 FAME-MT -- 一個由 1120 萬個翻譯組成的資料集，其中包含 15 種歐洲原始語言與 8 種歐洲目標語言之間的翻譯，並根據目標句子的正式程度分類為正式和非正式類別。此資料集可用於微調機器翻譯模型，以確保每個歐洲目標語言都有既定的正式程度。我們描述了資料集建立程序、資料集品質分析，顯示 FAME-MT 是語言註冊資訊的可靠來源，並提出了一個公開可用的概念驗證機器翻譯模型，該模型使用資料集來引導翻譯的正式程度。目前，它是最大的正式註解資料集，範例使用 112 種歐洲語言對表達。資料集已在線上發布：https://github.com/laniqo-public/fame-mt/。", "author": "Dawid Wiśniewski et.al.", "authors": "Dawid Wiśniewski, Zofia Rostek, Artur Nowakowski", "id": "2405.11942v1", "paper_url": "http://arxiv.org/abs/2405.11942v1", "repo": "https://github.com/laniqo-public/fame-mt"}}