{"2411.18564": {"publish_time": "2024-11-27", "title": "A Pipeline of Neural-Symbolic Integration to Enhance Spatial Reasoning in Large Language Models", "paper_summary": "Large Language Models (LLMs) have demonstrated impressive capabilities across\nvarious tasks. However, LLMs often struggle with spatial reasoning which is one\nessential part of reasoning and inference and requires understanding complex\nrelationships between objects in space. This paper proposes a novel\nneural-symbolic framework that enhances LLMs' spatial reasoning abilities. We\nevaluate our approach on two benchmark datasets: StepGame and SparQA,\nimplementing three distinct strategies: (1) ASP (Answer Set Programming)-based\nsymbolic reasoning, (2) LLM + ASP pipeline using DSPy, and (3) Fact + Logical\nrules. Our experiments demonstrate significant improvements over the baseline\nprompting methods, with accuracy increases of 40-50% on StepGame} dataset and\n3-13% on the more complex SparQA dataset. The \"LLM + ASP\" pipeline achieves\nparticularly strong results on the tasks of Finding Relations (FR) and Finding\nBlock (FB) questions, though performance varies across different question\ntypes. The impressive results suggest that while neural-symbolic approaches\noffer promising directions for enhancing spatial reasoning in LLMs, their\neffectiveness depends heavily on the specific task characteristics and\nimplementation strategies. We propose an integrated, simple yet effective set\nof strategies using a neural-symbolic pipeline to boost spatial reasoning\nabilities in LLMs. This pipeline and its strategies demonstrate strong and\nbroader applicability to other reasoning domains in LLMs, such as temporal\nreasoning, deductive inference etc.", "paper_summary_zh": "大型語言模型 (LLM) 在各種任務中展示了令人印象深刻的能力。然而，LLM 通常難以進行空間推理，而空間推理是推理和推論的重要組成部分，需要理解空間中物件之間的複雜關係。本文提出了一個新的神經符號框架，以增強 LLM 的空間推理能力。我們在兩個基準資料集上評估我們的做法：StepGame 和 SparQA，實施了三種不同的策略：(1) 基於 ASP（Answer Set Programming）的符號推理，(2) 使用 DSPy 的 LLM + ASP 管線，以及 (3) 事實 + 邏輯規則。我們的實驗證明，與基準提示方法相比，有了顯著的改進，StepGame 資料集的準確度提高了 40-50%，而更複雜的 SparQA 資料集的準確度提高了 3-13%。儘管在不同類型的問題中表現不一，但「LLM + ASP」管線在尋找關係 (FR) 和尋找區塊 (FB) 的問題上取得了特別顯著的結果。令人印象深刻的結果表明，雖然神經符號方法為增強 LLM 中的空間推理提供了有希望的方向，但其有效性在很大程度上取決於具體的任務特徵和實施策略。我們提出了一個整合、簡單但有效的策略集，使用神經符號管線來提升 LLM 中的空間推理能力。這個管線及其策略證明了對 LLM 中其他推理領域的強大而更廣泛的適用性，例如時間推理、演繹推理等。", "author": "Rong Wang et.al.", "authors": "Rong Wang, Kun Sun, Jonas Kuhn", "id": "2411.18564v1", "paper_url": "http://arxiv.org/abs/2411.18564v1", "repo": "null"}}