{"2501.07086": {"publish_time": "2025-01-13", "title": "Boosting Text-To-Image Generation via Multilingual Prompting in Large Multimodal Models", "paper_summary": "Previous work on augmenting large multimodal models (LMMs) for text-to-image\n(T2I) generation has focused on enriching the input space of in-context\nlearning (ICL). This includes providing a few demonstrations and optimizing\nimage descriptions to be more detailed and logical. However, as demand for more\ncomplex and flexible image descriptions grows, enhancing comprehension of input\ntext within the ICL paradigm remains a critical yet underexplored area. In this\nwork, we extend this line of research by constructing parallel multilingual\nprompts aimed at harnessing the multilingual capabilities of LMMs. More\nspecifically, we translate the input text into several languages and provide\nthe models with both the original text and the translations. Experiments on two\nLMMs across 3 benchmarks show that our method, PMT2I, achieves superior\nperformance in general, compositional, and fine-grained assessments, especially\nin human preference alignment. Additionally, with its advantage of generating\nmore diverse images, PMT2I significantly outperforms baseline prompts when\nincorporated with reranking methods. Our code and parallel multilingual data\ncan be found at https://github.com/takagi97/PMT2I.", "paper_summary_zh": "先前的研究集中於擴充大型多模態模型 (LMM) 以進行文字轉影像 (T2I) 生成，重點在於豐富情境學習 (ICL) 的輸入空間。這包括提供一些示範和最佳化影像描述，使其更詳細且更具邏輯性。然而，隨著對更複雜且更靈活的影像描述的需求增加，在 ICL 典範中增強對輸入文字的理解仍然是一個關鍵但尚未充分探索的領域。在此研究中，我們透過建構平行多語言提示來擴展這條研究路線，旨在利用 LMM 的多語言能力。更具體地說，我們將輸入文字翻譯成多種語言，並向模型提供原始文字和翻譯。在 3 個基準上對兩個 LMM 進行的實驗顯示，我們的 PMT2I 方法在一般、構成和細緻的評估中都能獲得優異的效能，特別是在人類偏好對齊方面。此外，PMT2I 具有產生更多樣化影像的優勢，在與重新排序方法結合使用時，其效能顯著優於基線提示。我們的程式碼和平行多語言資料可以在 https://github.com/takagi97/PMT2I 找到。", "author": "Yongyu Mu et.al.", "authors": "Yongyu Mu, Hengyu Li, Junxin Wang, Xiaoxuan Zhou, Chenglong Wang, Yingfeng Luo, Qiaozhi He, Tong Xiao, Guocheng Chen, Jingbo Zhu", "id": "2501.07086v1", "paper_url": "http://arxiv.org/abs/2501.07086v1", "repo": "https://github.com/takagi97/pmt2i"}}