{"2406.11665": {"publish_time": "2024-06-17", "title": "See It from My Perspective: Diagnosing the Western Cultural Bias of Large Vision-Language Models in Image Understanding", "paper_summary": "Vision-language models (VLMs) can respond to queries about images in many\nlanguages. However, beyond language, culture affects how we see things. For\nexample, individuals from Western cultures focus more on the central figure in\nan image while individuals from Eastern cultures attend more to scene context.\nIn this work, we present a novel investigation that demonstrates and localizes\nVLMs' Western bias in image understanding. We evaluate large VLMs across\nsubjective and objective visual tasks with culturally diverse images and\nannotations. We find that VLMs perform better on the Western subset than the\nEastern subset of each task. Controlled experimentation tracing the source of\nthis bias highlights the importance of a diverse language mix in text-only\npre-training for building equitable VLMs, even when inference is performed in\nEnglish. Moreover, while prompting in the language of a target culture can lead\nto reductions in bias, it is not a substitute for building AI more\nrepresentative of the world's languages.", "paper_summary_zh": "視覺語言模型 (VLM) 能以多種語言回答關於影像的查詢。然而，除了語言之外，文化也會影響我們看待事物的方式。例如，來自西方文化的人會更專注於影像中的中央人物，而來自東方文化的人則會更關注場景背景。在這項研究中，我們提出了一項新穎的研究，展示並定位了 VLM 在影像理解中的西方偏見。我們在具有文化多元性影像和註解的主觀和客觀視覺任務中評估了大型 VLM。我們發現，VLM 在每個任務的西方子集上表現優於東方子集。追蹤此偏見來源的受控實驗強調了在僅文字預訓練中使用多樣化語言組合對於建構公平的 VLM 的重要性，即使是在英語中執行推論時也是如此。此外，儘管使用目標文化的語言提示可以減少偏見，但它並不能取代建構更能代表世界語言的 AI。", "author": "Amith Ananthram et.al.", "authors": "Amith Ananthram, Elias Stengel-Eskin, Carl Vondrick, Mohit Bansal, Kathleen McKeown", "id": "2406.11665v1", "paper_url": "http://arxiv.org/abs/2406.11665v1", "repo": "https://github.com/amith-ananthram/see-it-from-my-perspective"}}