{"2502.10352": {"publish_time": "2025-02-14", "title": "Agentic Verification for Ambiguous Query Disambiguation", "paper_summary": "In this work, we tackle the challenge of disambiguating queries in\nretrieval-augmented generation (RAG) to diverse yet answerable interpretations.\nState-of-the-arts follow a Diversify-then-Verify (DtV) pipeline, where diverse\ninterpretations are generated by an LLM, later used as search queries to\nretrieve supporting passages. Such a process may introduce noise in either\ninterpretations or retrieval, particularly in enterprise settings, where LLMs\n-- trained on static data -- may struggle with domain-specific disambiguations.\nThus, a post-hoc verification phase is introduced to prune noises. Our\ndistinction is to unify diversification with verification by incorporating\nfeedback from retriever and generator early on. This joint approach improves\nboth efficiency and robustness by reducing reliance on multiple retrieval and\ninference steps, which are susceptible to cascading errors. We validate the\nefficiency and effectiveness of our method, Verified-Diversification with\nConsolidation (VERDICT), on the widely adopted ASQA benchmark to achieve\ndiverse yet verifiable interpretations. Empirical results show that VERDICT\nimproves grounding-aware F1 score by an average of 23% over the strongest\nbaseline across different backbone LLMs.", "paper_summary_zh": "在這項工作中，我們應對了在檢索增強生成 (RAG) 中消除查詢歧義的挑戰，以獲得多元且可回答的詮釋。最先進的技術遵循多元化後驗證 (DtV) 管線，其中不同的詮釋是由 LLM 生成的，稍後用作檢索查詢以檢索支援段落。這樣的過程可能會在詮釋或檢索中引入雜訊，特別是在企業環境中，在靜態資料上訓練的 LLM 可能難以進行特定領域的消除歧義。因此，引入了事後驗證階段以消除雜訊。我們的區別在於透過及早納入檢索器和生成器的回饋，將多元化與驗證統一起來。這種聯合方法透過減少對多重檢索和推論步驟的依賴，來改善效率和穩健性，而這些步驟容易發生連鎖錯誤。我們在廣泛採用的 ASQA 基準上驗證了我們的方法，即合併驗證的多元化 (VERDICT) 的效率和有效性，以達成多元且可驗證的詮釋。經驗結果顯示，VERDICT 將以接地為基礎的 F1 分數平均提高 23%，優於不同主幹 LLM 的最強基線。", "author": "Youngwon Lee et.al.", "authors": "Youngwon Lee, Seung-won Hwang, Ruofan Wu, Feng Yan, Danmei Xu, Moutasem Akkad, Zhewei Yao, Yuxiong He", "id": "2502.10352v1", "paper_url": "http://arxiv.org/abs/2502.10352v1", "repo": "null"}}