{"2408.08661": {"publish_time": "2024-08-16", "title": "MIA-Tuner: Adapting Large Language Models as Pre-training Text Detector", "paper_summary": "The increasing parameters and expansive dataset of large language models\n(LLMs) highlight the urgent demand for a technical solution to audit the\nunderlying privacy risks and copyright issues associated with LLMs. Existing\nstudies have partially addressed this need through an exploration of the\npre-training data detection problem, which is an instance of a membership\ninference attack (MIA). This problem involves determining whether a given piece\nof text has been used during the pre-training phase of the target LLM. Although\nexisting methods have designed various sophisticated MIA score functions to\nachieve considerable detection performance in pre-trained LLMs, how to achieve\nhigh-confidence detection and how to perform MIA on aligned LLMs remain\nchallenging. In this paper, we propose MIA-Tuner, a novel instruction-based MIA\nmethod, which instructs LLMs themselves to serve as a more precise pre-training\ndata detector internally, rather than design an external MIA score function.\nFurthermore, we design two instruction-based safeguards to respectively\nmitigate the privacy risks brought by the existing methods and MIA-Tuner. To\ncomprehensively evaluate the most recent state-of-the-art LLMs, we collect a\nmore up-to-date MIA benchmark dataset, named WIKIMIA-24, to replace the widely\nadopted benchmark WIKIMIA. We conduct extensive experiments across various\naligned and unaligned LLMs over the two benchmark datasets. The results\ndemonstrate that MIA-Tuner increases the AUC of MIAs from 0.7 to a\nsignificantly high level of 0.9.", "paper_summary_zh": "隨著大型語言模型（LLM）參數的增加和資料集的擴展，突顯出對技術解決方案的迫切需求，以稽核與 LLM 相關的基本隱私風險和版權問題。現有的研究已透過探索預訓練資料偵測問題，部分滿足此需求，而這個問題是成員推論攻擊（MIA）的一個範例。這個問題涉及確定特定文字是否已在目標 LLM 的預訓練階段中使用。雖然現有方法已設計各種複雜的 MIA 分數函數，以在預訓練 LLM 中達成相當的偵測效能，但如何達成高信心的偵測以及如何對齊的 LLM 執行 MIA 仍然具有挑戰性。在本文中，我們提出 MIA-Tuner，一種新穎的基於指令的 MIA 方法，它指示 LLM 本身在內部作為更精確的預訓練資料偵測器，而不是設計外部 MIA 分數函數。此外，我們設計了兩個基於指令的防護措施，分別緩解現有方法和 MIA-Tuner 帶來的隱私風險。為了全面評估最新的最先進 LLM，我們收集了一個更最新的 MIA 基準資料集，名為 WIKIMIA-24，以取代廣泛採用的基準 WIKIMIA。我們在兩個基準資料集上對各種對齊和未對齊的 LLM 進行廣泛的實驗。結果證明，MIA-Tuner 將 MIA 的 AUC 從 0.7 提高到顯著高的 0.9 水準。", "author": "Wenjie Fu et.al.", "authors": "Wenjie Fu, Huandong Wang, Chen Gao, Guanghua Liu, Yong Li, Tao Jiang", "id": "2408.08661v1", "paper_url": "http://arxiv.org/abs/2408.08661v1", "repo": "null"}}