{"2502.03214": {"publish_time": "2025-02-05", "title": "iVISPAR -- An Interactive Visual-Spatial Reasoning Benchmark for VLMs", "paper_summary": "Vision-Language Models (VLMs) are known to struggle with spatial reasoning\nand visual alignment. To help overcome these limitations, we introduce iVISPAR,\nan interactive multi-modal benchmark designed to evaluate the spatial reasoning\ncapabilities of VLMs acting as agents. iVISPAR is based on a variant of the\nsliding tile puzzle-a classic problem that demands logical planning, spatial\nawareness, and multi-step reasoning. The benchmark supports visual 2D, 3D, and\ntext-based input modalities, enabling comprehensive assessments of VLMs'\nplanning and reasoning skills. We evaluate a broad suite of state-of-the-art\nopen-source and closed-source VLMs, comparing their performance while also\nproviding optimal path solutions and a human baseline to assess the task's\ncomplexity and feasibility for humans. Results indicate that while some VLMs\nperform well on simple spatial tasks, they encounter difficulties with more\ncomplex configurations and problem properties. Notably, while VLMs generally\nperform better in 2D vision compared to 3D or text-based representations, they\nconsistently fall short of human performance, illustrating the persistent\nchallenge of visual alignment. This highlights critical gaps in current VLM\ncapabilities, highlighting their limitations in achieving human-level\ncognition.", "paper_summary_zh": "視覺語言模型 (VLM) 已知在空間推理和視覺對齊方面有困難。為了幫助克服這些限制，我們引入了 iVISPAR，一個互動的多模態基準，用於評估作為代理的 VLM 的空間推理能力。iVISPAR 基於滑動拼圖的變體，這是一個經典問題，需要邏輯規劃、空間感知和多步驟推理。基準支持視覺 2D、3D 和基於文本的輸入模式，從而能夠全面評估 VLM 的規劃和推理技能。我們評估了一系列最先進的開源和閉源 VLM，比較了它們的性能，同時還提供了最佳路徑解決方案和人類基準，以評估任務對人類的複雜性和可行性。結果表明，雖然一些 VLM 在簡單的空間任務中表現良好，但它們在更複雜的配置和問題屬性中會遇到困難。值得注意的是，雖然 VLM 在 2D 視覺中通常比 3D 或基於文本的表示表現得更好，但它們始終低於人類表現，說明視覺對齊的持續挑戰。這突顯了當前 VLM 能力中的關鍵差距，突顯了它們在實現人類級認知方面的局限性。", "author": "Julius Mayer et.al.", "authors": "Julius Mayer, Mohamad Ballout, Serwan Jassim, Farbod Nosrat Nezami, Elia Bruni", "id": "2502.03214v1", "paper_url": "http://arxiv.org/abs/2502.03214v1", "repo": "null"}}