{"2411.16666": {"publish_time": "2024-11-25", "title": "CatNet: Effective FDR Control in LSTM with Gaussian Mirrors and SHAP Feature Importance", "paper_summary": "We introduce CatNet, an algorithm that effectively controls False Discovery\nRate (FDR) and selects significant features in LSTM with the Gaussian Mirror\n(GM) method. To evaluate the feature importance of LSTM in time series, we\nintroduce a vector of the derivative of the SHapley Additive exPlanations\n(SHAP) to measure feature importance. We also propose a new kernel-based\ndependence measure to avoid multicollinearity in the GM algorithm, to make a\nrobust feature selection with controlled FDR. We use simulated data to evaluate\nCatNet's performance in both linear models and LSTM models with different link\nfunctions. The algorithm effectively controls the FDR while maintaining a high\nstatistical power in all cases. We also evaluate the algorithm's performance in\ndifferent low-dimensional and high-dimensional cases, demonstrating its\nrobustness in various input dimensions. To evaluate CatNet's performance in\nreal world applications, we construct a multi-factor investment portfolio to\nforecast the prices of S\\&P 500 index components. The results demonstrate that\nour model achieves superior predictive accuracy compared to traditional LSTM\nmodels without feature selection and FDR control. Additionally, CatNet\neffectively captures common market-driving features, which helps informed\ndecision-making in financial markets by enhancing the interpretability of\npredictions. Our study integrates of the Gaussian Mirror algorithm with LSTM\nmodels for the first time, and introduces SHAP values as a new feature\nimportance metric for FDR control methods, marking a significant advancement in\nfeature selection and error control for neural networks.", "paper_summary_zh": "<paragraph>我們介紹 CatNet，一種有效控制假陽性發現率 (FDR) 的演算法，並使用高斯鏡像 (GM) 方法選取 LSTM 中的重要特徵。為了評估 LSTM 在時間序列中的特徵重要性，我們引入 SHapley 加法解釋 (SHAP) 的導數向量來衡量特徵重要性。我們還提出一個新的基於核心的依賴性測量，以避免 GM 演算法中的多重共線性，以進行具有受控 FDR 的穩健特徵選取。我們使用模擬資料來評估 CatNet 在具有不同連結函數的線性模型和 LSTM 模型中的效能。該演算法在所有情況下都能有效控制 FDR，同時保持高統計功效。我們還評估了該演算法在不同低維度和高維度情況下的效能，證明了其在各種輸入維度中的穩健性。為了評估 CatNet 在實際應用中的效能，我們建構了一個多因子投資組合來預測標普 500 指數成分的價格。結果表明，與沒有特徵選取和 FDR 控制的傳統 LSTM 模型相比，我們的模型實現了卓越的預測準確度。此外，CatNet 有效地擷取了共同的市場驅動特徵，這有助於透過增強預測的可解釋性，在金融市場中做出明智的決策。我們的研究首次將高斯鏡像演算法與 LSTM 模型整合，並將 SHAP 值作為 FDR 控制方法的新特徵重要性指標，標誌著神經網路特徵選取和錯誤控制的重大進展。</paragraph>", "author": "Jiaan Han et.al.", "authors": "Jiaan Han, Junxiao Chen, Yanzhe Fu", "id": "2411.16666v1", "paper_url": "http://arxiv.org/abs/2411.16666v1", "repo": "null"}}