{"2408.07137": {"publish_time": "2024-08-13", "title": "ELLA: Empowering LLMs for Interpretable, Accurate and Informative Legal Advice", "paper_summary": "Despite remarkable performance in legal consultation exhibited by legal Large\nLanguage Models(LLMs) combined with legal article retrieval components, there\nare still cases when the advice given is incorrect or baseless. To alleviate\nthese problems, we propose {\\bf ELLA}, a tool for {\\bf E}mpowering {\\bf L}LMs\nfor interpretable, accurate, and informative {\\bf L}egal {\\bf A}dvice. ELLA\nvisually presents the correlation between legal articles and LLM's response by\ncalculating their similarities, providing users with an intuitive legal basis\nfor the responses. Besides, based on the users' queries, ELLA retrieves\nrelevant legal articles and displays them to users. Users can interactively\nselect legal articles for LLM to generate more accurate responses. ELLA also\nretrieves relevant legal cases for user reference. Our user study shows that\npresenting the legal basis for the response helps users understand better. The\naccuracy of LLM's responses also improves when users intervene in selecting\nlegal articles for LLM. Providing relevant legal cases also aids individuals in\nobtaining comprehensive information.", "paper_summary_zh": "儘管法律大型語言模型 (LLM) 與法律條文檢索元件結合後在法律諮詢方面表現出色，但有時給出的建議仍不正確或沒有根據。為了緩解這些問題，我們提出了「ELLA」，一個賦能 LLM 以提供可解釋、準確且具參考價值的法律建議的工具。ELLA 透過計算法律條文與 LLM 回應之間的相似性，視覺化呈現兩者之間的關聯性，為使用者提供回應的直觀法律依據。此外，ELLA 會根據使用者的查詢，檢索相關的法律條文並顯示給使用者。使用者可以互動式地選擇法律條文，讓 LLM 產生更準確的回應。ELLA 也會檢索相關的法律案例供使用者參考。我們的使用者研究顯示，呈現回應的法律依據有助於使用者更深入地理解。當使用者介入選擇 LLM 的法律條文時，LLM 回應的準確度也會提高。提供相關的法律案例也有助於個人獲得全面的資訊。", "author": "Yutong Hu et.al.", "authors": "Yutong Hu, Kangcheng Luo, Yansong Feng", "id": "2408.07137v1", "paper_url": "http://arxiv.org/abs/2408.07137v1", "repo": "null"}}