{"2411.15216": {"publish_time": "2024-11-20", "title": "Dist Loss: Enhancing Regression in Few-Shot Region through Distribution Distance Constraint", "paper_summary": "Imbalanced data distributions are prevalent in real-world scenarios, posing\nsignificant challenges in both imbalanced classification and imbalanced\nregression tasks. They often cause deep learning models to overfit in areas of\nhigh sample density (many-shot regions) while underperforming in areas of low\nsample density (few-shot regions). This characteristic restricts the utility of\ndeep learning models in various sectors, notably healthcare, where areas with\nfew-shot data hold greater clinical relevance. While recent studies have shown\nthe benefits of incorporating distribution information in imbalanced\nclassification tasks, such strategies are rarely explored in imbalanced\nregression. In this paper, we address this issue by introducing a novel loss\nfunction, termed Dist Loss, designed to minimize the distribution distance\nbetween the model's predictions and the target labels in a differentiable\nmanner, effectively integrating distribution information into model training.\nDist Loss enables deep learning models to regularize their output distribution\nduring training, effectively enhancing their focus on few-shot regions. We have\nconducted extensive experiments across three datasets spanning computer vision\nand healthcare: IMDB-WIKI-DIR, AgeDB-DIR, and ECG-Ka-DIR. The results\ndemonstrate that Dist Loss effectively mitigates the negative impact of\nimbalanced data distribution on model performance, achieving state-of-the-art\nresults in sparse data regions. Furthermore, Dist Loss is easy to integrate,\ncomplementing existing methods.", "paper_summary_zh": "<paragraph>不平衡資料分佈在實際情況中很常見，對不平衡分類和不平衡回歸任務構成重大挑戰。它們通常導致深度學習模型在樣本密度高（多樣本區域）的區域過度擬合，而在樣本密度低（少樣本區域）的區域表現不佳。這種特性限制了深度學習模型在各個領域的實用性，特別是在醫療保健領域，其中少樣本資料區域具有更大的臨床相關性。儘管最近的研究顯示了在不平衡分類任務中納入分佈資訊的好處，但此類策略在不平衡回歸中很少被探討。在本文中，我們透過引入一種稱為 Dist Loss 的新損失函數來解決此問題，該函數旨在以可微分的方式最小化模型預測與目標標籤之間的分佈距離，有效地將分佈資訊整合到模型訓練中。Dist Loss 能讓深度學習模型在訓練期間調整其輸出分佈，有效地加強它們對少樣本區域的關注。我們跨越電腦視覺和醫療保健領域的三個資料集進行了廣泛的實驗：IMDB-WIKI-DIR、AgeDB-DIR 和 ECG-Ka-DIR。結果表明，Dist Loss 有效地減輕了不平衡資料分佈對模型效能的負面影響，在稀疏資料區域中取得了最先進的結果。此外，Dist Loss 易於整合，可補充現有方法。</paragraph>", "author": "Guangkun Nie et.al.", "authors": "Guangkun Nie, Gongzheng Tang, Shenda Hong", "id": "2411.15216v1", "paper_url": "http://arxiv.org/abs/2411.15216v1", "repo": "null"}}