{"2405.07344": {"publish_time": "2024-05-12", "title": "TKAN: Temporal Kolmogorov-Arnold Networks", "paper_summary": "Recurrent Neural Networks (RNNs) have revolutionized many areas of machine\nlearning, particularly in natural language and data sequence processing. Long\nShort-Term Memory (LSTM) has demonstrated its ability to capture long-term\ndependencies in sequential data. Inspired by the Kolmogorov-Arnold Networks\n(KANs) a promising alternatives to Multi-Layer Perceptrons (MLPs), we proposed\na new neural networks architecture inspired by KAN and the LSTM, the Temporal\nKolomogorov-Arnold Networks (TKANs). TKANs combined the strenght of both\nnetworks, it is composed of Recurring Kolmogorov-Arnold Networks (RKANs) Layers\nembedding memory management. This innovation enables us to perform multi-step\ntime series forecasting with enhanced accuracy and efficiency. By addressing\nthe limitations of traditional models in handling complex sequential patterns,\nthe TKAN architecture offers significant potential for advancements in fields\nrequiring more than one step ahead forecasting.", "paper_summary_zh": "遞迴神經網路 (RNN) 已革新機器學習的許多領域，特別是在自然語言和資料序列處理方面。長期短期記憶 (LSTM) 已展現其擷取序列資料中長期依賴關係的能力。受 Kolmogorov-Arnold 網路 (KAN) 啟發，這是一種多層感知器 (MLP) 的有前途的替代方案，我們提出了一種新的神經網路架構，其靈感來自 KAN 和 LSTM，即時間 Kolomogorov-Arnold 網路 (TKAN)。TKAN 結合了這兩種網路的優點，它由嵌入記憶體管理的遞迴 Kolmogorov-Arnold 網路 (RKAN) 層組成。這項創新使我們能夠執行多步驟時間序列預測，並提高準確度和效率。透過解決傳統模型在處理複雜序列模式方面的限制，TKAN 架構為需要多步超前預測的領域提供了顯著的進步潛力。", "author": "Remi Genet et.al.", "authors": "Remi Genet, Hugo Inzirillo", "id": "2405.07344v1", "paper_url": "http://arxiv.org/abs/2405.07344v1", "repo": "https://github.com/remigenet/tkan"}}