{"2410.03421": {"publish_time": "2024-10-04", "title": "One2set + Large Language Model: Best Partners for Keyphrase Generation", "paper_summary": "Keyphrase generation (KPG) aims to automatically generate a collection of\nphrases representing the core concepts of a given document. The dominant\nparadigms in KPG include one2seq and one2set. Recently, there has been\nincreasing interest in applying large language models (LLMs) to KPG. Our\npreliminary experiments reveal that it is challenging for a single model to\nexcel in both recall and precision. Further analysis shows that: 1) the one2set\nparadigm owns the advantage of high recall, but suffers from improper\nassignments of supervision signals during training; 2) LLMs are powerful in\nkeyphrase selection, but existing selection methods often make redundant\nselections. Given these observations, we introduce a generate-then-select\nframework decomposing KPG into two steps, where we adopt a one2set-based model\nas generator to produce candidates and then use an LLM as selector to select\nkeyphrases from these candidates. Particularly, we make two important\nimprovements on our generator and selector: 1) we design an Optimal\nTransport-based assignment strategy to address the above improper assignments;\n2) we model the keyphrase selection as a sequence labeling task to alleviate\nredundant selections. Experimental results on multiple benchmark datasets show\nthat our framework significantly surpasses state-of-the-art models, especially\nin absent keyphrase prediction.", "paper_summary_zh": "關鍵字生成 (KPG) 旨在自動生成一組代表給定文件核心概念的短語。KPG 中的主要範例包括 one2seq 和 one2set。最近，將大型語言模型 (LLM) 應用於 KPG 的興趣與日俱增。我們的初步實驗表明，單一模型在召回率和準確度方面都很難表現出色。進一步的分析表明：1) one2set 範例擁有高召回率的優勢，但訓練期間監督信號的分配不當；2) LLM 在關鍵字選擇方面很強大，但現有的選擇方法通常會做出重複的選擇。根據這些觀察，我們引入了一個生成然後選擇的框架，將 KPG 分解為兩個步驟，其中我們採用基於 one2set 的模型作為生成器來產生候選項，然後使用 LLM 作為選擇器從這些候選項中選擇關鍵字。特別是，我們對生成器和選擇器進行了兩項重要的改進：1) 我們設計了一種基於最佳傳輸的分配策略來解決上述不當分配；2) 我們將關鍵字選擇建模為一個序列標籤任務，以減輕重複的選擇。在多個基準資料集上的實驗結果表明，我們的框架顯著優於最先進的模型，特別是在沒有關鍵字預測的情況下。", "author": "Liangying Shao et.al.", "authors": "Liangying Shao, Liang Zhang, Minlong Peng, Guoqi Ma, Hao Yue, Mingming Sun, Jinsong Su", "id": "2410.03421v1", "paper_url": "http://arxiv.org/abs/2410.03421v1", "repo": "null"}}