{"2406.09130": {"publish_time": "2024-06-13", "title": "Time-Series Forecasting for Out-of-Distribution Generalization Using Invariant Learning", "paper_summary": "Time-series forecasting (TSF) finds broad applications in real-world\nscenarios. Due to the dynamic nature of time-series data, it is crucial to\nequip TSF models with out-of-distribution (OOD) generalization abilities, as\nhistorical training data and future test data can have different distributions.\nIn this paper, we aim to alleviate the inherent OOD problem in TSF via\ninvariant learning. We identify fundamental challenges of invariant learning\nfor TSF. First, the target variables in TSF may not be sufficiently determined\nby the input due to unobserved core variables in TSF, breaking the conventional\nassumption of invariant learning. Second, time-series datasets lack adequate\nenvironment labels, while existing environmental inference methods are not\nsuitable for TSF.\n  To address these challenges, we propose FOIL, a model-agnostic framework that\nenables timeseries Forecasting for Out-of-distribution generalization via\nInvariant Learning. FOIL employs a novel surrogate loss to mitigate the impact\nof unobserved variables. Further, FOIL implements a joint optimization by\nalternately inferring environments effectively with a multi-head network while\npreserving the temporal adjacency structure, and learning invariant\nrepresentations across inferred environments for OOD generalized TSF. We\ndemonstrate that the proposed FOIL significantly improves the performance of\nvarious TSF models, achieving gains of up to 85%.", "paper_summary_zh": "時間序列預測 (TSF) 在實際情境中廣泛應用。由於時間序列資料的動態特性，因此 TSF 模型必須具備超出分佈 (OOD) 的概化能力，因為歷史訓練資料和未來測試資料可能具有不同的分佈。在本文中，我們旨在透過不變學習來緩解 TSF 中固有的 OOD 問題。我們找出 TSF 中不變學習的基本挑戰。首先，由於 TSF 中未觀察到的核心變數，因此輸入可能無法充分決定 TSF 中的目標變數，打破了不變學習的傳統假設。其次，時間序列資料集缺乏適當的環境標籤，而現有的環境推論方法並不適合 TSF。\n為了應對這些挑戰，我們提出 FOIL，一個與模型無關的架構，它能透過不變學習啟用超出分佈概化之時間序列預測。FOIL 採用一種新穎的替代損失來減輕未觀察變數的影響。此外，FOIL 透過多頭網路有效地交替推論環境，同時保留時間鄰接結構，並學習推論環境中跨 OOD 概化 TSF 的不變表示，來實作聯合最佳化。我們證明所提出的 FOIL 大幅提升各種 TSF 模型的效能，獲得高達 85% 的收益。", "author": "Haoxin Liu et.al.", "authors": "Haoxin Liu, Harshavardhan Kamarthi, Lingkai Kong, Zhiyuan Zhao, Chao Zhang, B. Aditya Prakash", "id": "2406.09130v1", "paper_url": "http://arxiv.org/abs/2406.09130v1", "repo": "null"}}