{"2501.09959": {"publish_time": "2025-01-17", "title": "A Survey on Multi-Turn Interaction Capabilities of Large Language Models", "paper_summary": "Multi-turn interaction in the dialogue system research refers to a system's\nability to maintain context across multiple dialogue turns, enabling it to\ngenerate coherent and contextually relevant responses. Recent advancements in\nlarge language models (LLMs) have significantly expanded the scope of\nmulti-turn interaction, moving beyond chatbots to enable more dynamic agentic\ninteractions with users or environments. In this paper, we provide a focused\nreview of the multi-turn capabilities of LLMs, which are critical for a wide\nrange of downstream applications, including conversational search and\nrecommendation, consultation services, and interactive tutoring. This survey\nexplores four key aspects: (1) the core model capabilities that contribute to\neffective multi-turn interaction, (2) how multi-turn interaction is evaluated\nin current practice, (3) the general algorithms used to enhance multi-turn\ninteraction, and (4) potential future directions for research in this field.", "paper_summary_zh": "多輪互動在對話系統研究中是指系統在多個對話輪次中維護內容的能力，使其能夠產生連貫且與內容相關的回應。最近大型語言模型 (LLM) 的進展顯著擴展了多輪互動的範圍，超越了聊天機器人，實現了與使用者或環境更動態的代理互動。在本文中，我們提供了對 LLM 多輪功能的重點回顧，這些功能對於廣泛的下游應用至關重要，包括對話式搜尋和推薦、諮詢服務和互動式輔導。這項調查探討了四個關鍵方面：(1) 有助於有效的多輪互動的核心模型功能，(2) 如何在當前實務中評估多輪互動，(3) 用於增強多輪互動的一般演算法，以及 (4) 該領域研究的潛在未來方向。", "author": "Chen Zhang et.al.", "authors": "Chen Zhang, Xinyi Dai, Yaxiong Wu, Qu Yang, Yasheng Wang, Ruiming Tang, Yong Liu", "id": "2501.09959v1", "paper_url": "http://arxiv.org/abs/2501.09959v1", "repo": "null"}}