{"2501.08841": {"publish_time": "2025-01-15", "title": "Exploring Task-Level Optimal Prompts for Visual In-Context Learning", "paper_summary": "With the development of Vision Foundation Models (VFMs) in recent years,\nVisual In-Context Learning (VICL) has become a better choice compared to\nmodifying models in most scenarios. Different from retraining or fine-tuning\nmodel, VICL does not require modifications to the model's weights or\narchitecture, and only needs a prompt with demonstrations to teach VFM how to\nsolve tasks. Currently, significant computational cost for finding optimal\nprompts for every test sample hinders the deployment of VICL, as determining\nwhich demonstrations to use for constructing prompts is very costly. In this\npaper, however, we find a counterintuitive phenomenon that most test samples\nactually achieve optimal performance under the same prompts, and searching for\nsample-level prompts only costs more time but results in completely identical\nprompts. Therefore, we propose task-level prompting to reduce the cost of\nsearching for prompts during the inference stage and introduce two time-saving\nyet effective task-level prompt search strategies. Extensive experimental\nresults show that our proposed method can identify near-optimal prompts and\nreach the best VICL performance with a minimal cost that prior work has never\nachieved.", "paper_summary_zh": "隨著近年來 Vision Foundation Models (VFMs) 的發展，與其在多數情況下修改模型，視覺情境學習 (VICL) 已成為更好的選擇。VICL 與重新訓練或微調模型不同，它不需要修改模型的權重或架構，只需要一個帶有示範的提示來教導 VFM 如何解決任務。目前，為每個測試樣本尋找最佳提示的顯著運算成本阻礙了 VICL 的部署，因為決定用於建構提示的示範代價很高。然而，在本文中，我們發現了一個反直覺的現象，即大多數測試樣本實際上在相同的提示下都能達到最佳效能，而且只搜尋樣本層級的提示只會花費更多時間，但會產生完全相同的提示。因此，我們提出任務層級提示，以降低在推論階段搜尋提示的成本，並引入兩種省時且有效的任務層級提示搜尋策略。廣泛的實驗結果顯示，我們提出的方法可以識別接近最佳的提示，並以先前工作從未達成的最小成本達到最佳 VICL 效能。", "author": "Yan Zhu et.al.", "authors": "Yan Zhu, Huan Ma, Changqing Zhang", "id": "2501.08841v1", "paper_url": "http://arxiv.org/abs/2501.08841v1", "repo": "null"}}