{"2502.12988": {"publish_time": "2025-02-18", "title": "Beyond Profile: From Surface-Level Facts to Deep Persona Simulation in LLMs", "paper_summary": "Previous approaches to persona simulation large language models (LLMs) have\ntypically relied on learning basic biographical information, or using limited\nrole-play dialogue datasets to capture a character's responses. However, a\nholistic representation of an individual goes beyond surface-level facts or\nconversations to deeper thoughts and thinking. In this work, we introduce\nCharacterBot, a model designed to replicate both the linguistic patterns and\ndistinctive thought processes of a character. Using Lu Xun, a renowned Chinese\nwriter, as a case study, we propose four training tasks derived from his 17\nessay collections. These include a pre-training task focused on mastering\nexternal linguistic structures and knowledge, as well as three fine-tuning\ntasks: multiple-choice question answering, generative question answering, and\nstyle transfer, each aligning the LLM with Lu Xun's internal ideation and\nwriting style. To optimize learning across these tasks, we introduce a CharLoRA\nparameter updating mechanism, where a general linguistic style expert\ncollaborates with other task-specific experts to better study both the language\nstyle and the understanding of deeper thoughts. We evaluate CharacterBot on\nthree tasks for linguistic accuracy and opinion comprehension, demonstrating\nthat it significantly outperforms the baselines on our adapted metrics. We hope\nthat this work inspires future research on deep character persona simulation\nLLM.", "paper_summary_zh": "<paragraph>以前對角色模擬大型語言模型 (LLM) 的方法通常依賴於學習基本傳記資訊，或使用有限的角色扮演對話資料集來捕捉角色的反應。然而，對個人的整體表徵超越了表面層面的事實或對話，深入到更深層的想法和思考。在這項工作中，我們引入了 CharacterBot，一個旨在複製角色的語言模式和獨特思考過程的模型。以著名的中國作家魯迅為案例研究，我們提出了四個從他的 17 篇散文集中衍生的訓練任務。其中包括一個預訓練任務，專注於掌握外部語言結構和知識，以及三個微調任務：多選題回答、生成式問答和風格轉移，每個任務都將 LLM 與魯迅的內部觀念和寫作風格相結合。為了優化這些任務的學習，我們引入了一個 CharLoRA 參數更新機制，其中一位通曉語言風格的專家與其他特定任務專家合作，以更好地研究語言風格和對深層思想的理解。我們在三項任務上評估了 CharacterBot 的語言準確性和意見理解，證明它在我們調整的指標上顯著優於基準。我們希望這項工作能激勵未來對深度角色角色模擬 LLM 的研究。</paragraph>", "author": "Zixiao Wang et.al.", "authors": "Zixiao Wang, Duzhen Zhang, Ishita Agrawal, Shen Gao, Le Song, Xiuying Chen", "id": "2502.12988v1", "paper_url": "http://arxiv.org/abs/2502.12988v1", "repo": "null"}}