{"2405.15454": {"publish_time": "2024-05-24", "title": "Linearly Controlled Language Generation with Performative Guarantees", "paper_summary": "The increasing prevalence of Large Language Models (LMs) in critical\napplications highlights the need for controlled language generation strategies\nthat are not only computationally efficient but that also enjoy performance\nguarantees. To achieve this, we use a common model of concept semantics as\nlinearly represented in an LM's latent space. In particular, we take the view\nthat natural language generation traces a trajectory in this continuous\nsemantic space, realized by the language model's hidden activations. This view\npermits a control-theoretic treatment of text generation in latent space, in\nwhich we propose a lightweight, gradient-free intervention that dynamically\nsteers trajectories away from regions corresponding to undesired meanings.\nCrucially, we show that this intervention, which we compute in closed form, is\nguaranteed (in probability) to steer the output into the allowed region.\nFinally, we demonstrate on a toxicity avoidance objective that the intervention\nsteers language away from undesired content while maintaining text quality.", "paper_summary_zh": "大型語言模型 (LM) 在關鍵應用程式中日益普遍，這突顯出對受控語言產生策略的需求，這些策略不僅在運算上有效率，而且還能享有效能保證。為達成此目的，我們使用概念語義的共同模型，在 LM 的潛在空間中以線性方式表示。特別是，我們認為自然語言產生會在這個連續語義空間中追蹤一個軌跡，並由語言模型的隱藏啟動實現。這種觀點允許對潛在空間中的文字產生進行控制理論處理，其中我們提出一個輕量級、無梯度的介入措施，動態地將軌跡導離對應於不需要意義的區域。至關重要的是，我們證明了這個我們以封閉形式計算的介入措施，保證 (在機率上) 將輸出導向允許的區域。最後，我們在毒性避免目標上證明，介入措施將語言導離不需要的內容，同時維持文字品質。", "author": "Emily Cheng et.al.", "authors": "Emily Cheng, Marco Baroni, Carmen Amo Alonso", "id": "2405.15454v1", "paper_url": "http://arxiv.org/abs/2405.15454v1", "repo": "null"}}