{"2411.16433": {"publish_time": "2024-11-25", "title": "Finding Structure in Language Models", "paper_summary": "When we speak, write or listen, we continuously make predictions based on our\nknowledge of a language's grammar. Remarkably, children acquire this\ngrammatical knowledge within just a few years, enabling them to understand and\ngeneralise to novel constructions that have never been uttered before. Language\nmodels are powerful tools that create representations of language by\nincrementally predicting the next word in a sentence, and they have had a\ntremendous societal impact in recent years. The central research question of\nthis thesis is whether these models possess a deep understanding of grammatical\nstructure similar to that of humans. This question lies at the intersection of\nnatural language processing, linguistics, and interpretability. To address it,\nwe will develop novel interpretability techniques that enhance our\nunderstanding of the complex nature of large-scale language models. We approach\nour research question from three directions. First, we explore the presence of\nabstract linguistic information through structural priming, a key paradigm in\npsycholinguistics for uncovering grammatical structure in human language\nprocessing. Next, we examine various linguistic phenomena, such as adjective\norder and negative polarity items, and connect a model's comprehension of these\nphenomena to the data distribution on which it was trained. Finally, we\nintroduce a controlled testbed for studying hierarchical structure in language\nmodels using various synthetic languages of increasing complexity and examine\nthe role of feature interactions in modelling this structure. Our findings\noffer a detailed account of the grammatical knowledge embedded in language\nmodel representations and provide several directions for investigating\nfundamental linguistic questions using computational methods.", "paper_summary_zh": "<paragraph>當我們說話、寫作或聆聽時，我們會持續根據自己對語言文法的知識做出預測。值得注意的是，孩童僅在幾年內便能習得這種文法知識，使他們能夠理解並概括出前所未聞的新建構。語言模型是強大的工具，它透過逐步預測句子中的下一個單字來建立語言表徵，且在近年來對社會產生了巨大的影響。本論文的核心研究問題在於這些模型是否具備與人類相似的文法結構深度理解。此問題位於自然語言處理、語言學和可解釋性之間的交會點。為了探討這個問題，我們將開發新穎的可解釋性技術，以增強我們對大型語言模型複雜本質的理解。我們從三個方向探討我們的研究問題。首先，我們透過結構啟動（一種心理語言學中用於揭示人類語言處理中文法結構的主要範例）來探索抽象語言資訊的存在。接下來，我們檢驗各種語言現象，例如形容詞順序和否定極性項目，並將模型對這些現象的理解與其受訓的資料分佈連結起來。最後，我們引入一個受控測試台，使用各種複雜度遞增的合成語言來研究語言模型中的階層結構，並檢驗特徵互動在建模此結構中的作用。我們的發現提供了語言模型表徵中嵌入的文法知識的詳細說明，並提供了使用計算方法探討基本語言學問題的幾個方向。</paragraph>", "author": "Jaap Jumelet et.al.", "authors": "Jaap Jumelet", "id": "2411.16433v1", "paper_url": "http://arxiv.org/abs/2411.16433v1", "repo": "null"}}