{"2410.21061": {"publish_time": "2024-10-28", "title": "Kandinsky 3: Text-to-Image Synthesis for Multifunctional Generative Framework", "paper_summary": "Text-to-image (T2I) diffusion models are popular for introducing image\nmanipulation methods, such as editing, image fusion, inpainting, etc. At the\nsame time, image-to-video (I2V) and text-to-video (T2V) models are also built\non top of T2I models. We present Kandinsky 3, a novel T2I model based on latent\ndiffusion, achieving a high level of quality and photorealism. The key feature\nof the new architecture is the simplicity and efficiency of its adaptation for\nmany types of generation tasks. We extend the base T2I model for various\napplications and create a multifunctional generation system that includes\ntext-guided inpainting/outpainting, image fusion, text-image fusion, image\nvariations generation, I2V and T2V generation. We also present a distilled\nversion of the T2I model, evaluating inference in 4 steps of the reverse\nprocess without reducing image quality and 3 times faster than the base model.\nWe deployed a user-friendly demo system in which all the features can be tested\nin the public domain. Additionally, we released the source code and checkpoints\nfor the Kandinsky 3 and extended models. Human evaluations show that Kandinsky\n3 demonstrates one of the highest quality scores among open source generation\nsystems.", "paper_summary_zh": "文本到影像 (T2I) 擴散模型因引進影像處理方法而廣受歡迎，例如編輯、影像融合、修復等。同時，影像到影片 (I2V) 和文本到影片 (T2V) 模型也建立在 T2I 模型之上。我們提出 Kandinsky 3，一種基於潛在擴散的新型 T2I 模型，可實現高品質和寫實主義。新架構的主要特點是其適應各種生成任務的簡潔性和效率。我們擴展了基本 T2I 模型以適用於各種應用程式，並建立一個多功能生成系統，其中包括文字引導的修復/外繪、影像融合、文字影像融合、影像變化生成、I2V 和 T2V 生成。我們還提出了 T2I 模型的精簡版本，在反向處理的 4 個步驟中評估推論，且不會降低影像品質，而且比基本模型快 3 倍。我們部署了一個使用者友善的示範系統，其中所有功能都可以在公共領域中進行測試。此外，我們發布了 Kandinsky 3 和延伸模型的原始碼和檢查點。人為評估顯示，在開放原始碼生成系統中，Kandinsky 3 展示了最高品質分數之一。", "author": "Vladimir Arkhipkin et.al.", "authors": "Vladimir Arkhipkin, Viacheslav Vasilev, Andrei Filatov, Igor Pavlov, Julia Agafonova, Nikolai Gerasimenko, Anna Averchenkova, Evelina Mironova, Anton Bukashkin, Konstantin Kulikov, Andrey Kuznetsov, Denis Dimitrov", "id": "2410.21061v1", "paper_url": "http://arxiv.org/abs/2410.21061v1", "repo": "null"}}