{"2501.17296": {"publish_time": "2025-01-28", "title": "Multi-Physics Simulations via Coupled Fourier Neural Operator", "paper_summary": "Physical simulations are essential tools across critical fields such as\nmechanical and aerospace engineering, chemistry, meteorology, etc. While neural\noperators, particularly the Fourier Neural Operator (FNO), have shown promise\nin predicting simulation results with impressive performance and efficiency,\nthey face limitations when handling real-world scenarios involving coupled\nmulti-physics outputs. Current neural operator methods either overlook the\ncorrelations between multiple physical processes or employ simplistic\narchitectures that inadequately capture these relationships. To overcome these\nchallenges, we introduce a novel coupled multi-physics neural operator learning\n(COMPOL) framework that extends the capabilities of Fourier operator layers to\nmodel interactions among multiple physical processes. Our approach implements\nfeature aggregation through recurrent and attention mechanisms, enabling\ncomprehensive modeling of coupled interactions. Our method's core is an\ninnovative system for aggregating latent features from multi-physics processes.\nThese aggregated features serve as enriched information sources for neural\noperator layers, allowing our framework to capture complex physical\nrelationships accurately. We evaluated our coupled multi-physics neural\noperator across diverse physical simulation tasks, including biological\nsystems, fluid mechanics, and multiphase flow in porous media. Our proposed\nmodel demonstrates a two to three-fold improvement in predictive performance\ncompared to existing approaches.", "paper_summary_zh": "物理模擬是機械和航空工程、化學、氣象學等關鍵領域的必要工具。雖然神經算子，特別是傅立葉神經算子 (FNO)，已展現出令人印象深刻的效能和效率，預測模擬結果時很有前景，但在處理涉及耦合多物理輸出結果的真實世界場景時，它們會面臨限制。目前的類神經算子方法會忽略多個物理程序之間的關聯性，或採用簡化的架構，無法充分捕捉這些關係。為了克服這些挑戰，我們引入了一個新的耦合多物理神經算子學習 (COMPOL) 架構，它擴展了傅立葉算子層的能力，以建模多個物理程序之間的交互作用。我們的做法通過遞歸和注意機制實作特徵聚合，實現了耦合交互作用的全面建模。我們的方法核心是一個創新的系統，用於聚合來自多物理程序的潛在特徵。這些聚合的特徵作為神經算子層的豐富資訊來源，讓我們的架構能夠準確捕捉複雜的物理關係。我們在不同的物理模擬任務中評估了我們的耦合多物理神經算子，包括生物系統、流體力學和多相流動在多孔介質中。我們提出的模型展示出比現有方法高出兩到三倍的預測效能。", "author": "Shibo Li et.al.", "authors": "Shibo Li, Tao Wang, Yifei Sun, Heiwei Tang", "id": "2501.17296v1", "paper_url": "http://arxiv.org/abs/2501.17296v1", "repo": "null"}}