{"2405.10630": {"publish_time": "2024-05-17", "title": "Medical Dialogue: A Survey of Categories, Methods, Evaluation and Challenges", "paper_summary": "This paper surveys and organizes research works on medical dialog systems,\nwhich is an important yet challenging task. Although these systems have been\nsurveyed in the medical community from an application perspective, a systematic\nreview from a rigorous technical perspective has to date remained noticeably\nabsent. As a result, an overview of the categories, methods, and evaluation of\nmedical dialogue systems remain limited and underspecified, hindering the\nfurther improvement of this area. To fill this gap, we investigate an initial\npool of 325 papers from well-known computer science, and natural language\nprocessing conferences and journals, and make an overview. Recently, large\nlanguage models have shown strong model capacity on downstream tasks, which\nalso reshaped medical dialog systems' foundation. Despite the alluring\npractical application value, current medical dialogue systems still suffer from\nproblems. To this end, this paper lists the grand challenges of medical dialog\nsystems, especially of large language models.", "paper_summary_zh": "這篇論文調查並整理了醫療對話系統的研究工作，這是一項重要且具有挑戰性的任務。儘管這些系統已從應用角度在醫療界進行調查，但迄今為止仍明顯缺乏從嚴謹技術角度進行的系統性回顧。因此，對醫療對話系統的類別、方法和評估的概述仍然有限且未指定，阻礙了該領域的進一步改進。為了填補這一空白，我們研究了來自知名計算機科學、自然語言處理會議和期刊的 325 篇論文的初始庫，並進行了概述。最近，大型語言模型在下游任務上表現出強大的模型能力，這也重塑了醫療對話系統的基礎。儘管具有誘人的實際應用價值，但當前的醫療對話系統仍然存在問題。為此，本文列出了醫療對話系統的重大挑戰，尤其是大型語言模型的挑戰。", "author": "Xiaoming Shi et.al.", "authors": "Xiaoming Shi, Zeming Liu, Li Du, Yuxuan Wang, Hongru Wang, Yuhang Guo, Tong Ruan, Jie Xu, Shaoting Zhang", "id": "2405.10630v1", "paper_url": "http://arxiv.org/abs/2405.10630v1", "repo": "null"}}