{"2407.20124": {"publish_time": "2024-07-29", "title": "AxiomVision: Accuracy-Guaranteed Adaptive Visual Model Selection for Perspective-Aware Video Analytics", "paper_summary": "The rapid evolution of multimedia and computer vision technologies requires\nadaptive visual model deployment strategies to effectively handle diverse tasks\nand varying environments. This work introduces AxiomVision, a novel framework\nthat can guarantee accuracy by leveraging edge computing to dynamically select\nthe most efficient visual models for video analytics under diverse scenarios.\nUtilizing a tiered edge-cloud architecture, AxiomVision enables the deployment\nof a broad spectrum of visual models, from lightweight to complex DNNs, that\ncan be tailored to specific scenarios while considering camera source impacts.\nIn addition, AxiomVision provides three core innovations: (1) a dynamic visual\nmodel selection mechanism utilizing continual online learning, (2) an efficient\nonline method that efficiently takes into account the influence of the camera's\nperspective, and (3) a topology-driven grouping approach that accelerates the\nmodel selection process. With rigorous theoretical guarantees, these\nadvancements provide a scalable and effective solution for visual tasks\ninherent to multimedia systems, such as object detection, classification, and\ncounting. Empirically, AxiomVision achieves a 25.7\\% improvement in accuracy.", "paper_summary_zh": "多媒體和電腦視覺技術的快速演進需要自適應視覺模型部署策略，才能有效處理各種任務和變動的環境。這項工作介紹了 AxiomVision，一個新穎的架構，它能透過利用邊緣運算來動態選擇在各種場景下最有效的視覺模型，從而保證準確性。利用分層邊緣雲架構，AxiomVision 能部署廣泛的視覺模型，從輕量級到複雜的 DNN，這些模型可以根據特定場景進行調整，同時考慮相機來源的影響。此外，AxiomVision 提供了三項核心創新：(1) 利用持續在線學習的動態視覺模型選擇機制，(2) 有效考慮相機視角影響的有效在線方法，以及 (3) 加速模型選擇過程的拓撲驅動分組方法。透過嚴謹的理論保證，這些進展為多媒體系統固有的視覺任務（例如物體偵測、分類和計數）提供了可擴充且有效的解決方案。根據經驗，AxiomVision 在準確度上獲得了 25.7% 的提升。", "author": "Xiangxiang Dai et.al.", "authors": "Xiangxiang Dai, Zeyu Zhang, Peng Yang, Yuedong Xu, Xutong Liu, John C. S. Lui", "id": "2407.20124v2", "paper_url": "http://arxiv.org/abs/2407.20124v2", "repo": "https://github.com/zeyuzhangzyz/axiomvision"}}