{"2410.14615": {"publish_time": "2024-10-18", "title": "Asymptotically Optimal Change Detection for Unnormalized Pre- and Post-Change Distributions", "paper_summary": "This paper addresses the problem of detecting changes when only unnormalized\npre- and post-change distributions are accessible. This situation happens in\nmany scenarios in physics such as in ferromagnetism, crystallography,\nmagneto-hydrodynamics, and thermodynamics, where the energy models are\ndifficult to normalize.\n  Our approach is based on the estimation of the Cumulative Sum (CUSUM)\nstatistics, which is known to produce optimal performance. We first present an\nintuitively appealing approximation method. Unfortunately, this produces a\nbiased estimator of the CUSUM statistics and may cause performance degradation.\nWe then propose the Log-Partition Approximation Cumulative Sum (LPA-CUSUM)\nalgorithm based on thermodynamic integration (TI) in order to estimate the\nlog-ratio of normalizing constants of pre- and post-change distributions. It is\nproved that this approach gives an unbiased estimate of the log-partition\nfunction and the CUSUM statistics, and leads to an asymptotically optimal\nperformance. Moreover, we derive a relationship between the required sample\nsize for thermodynamic integration and the desired detection delay performance,\noffering guidelines for practical parameter selection. Numerical studies are\nprovided demonstrating the efficacy of our approach.", "paper_summary_zh": "本文探讨了在只能获得未归一化的变更前和变更后分布时检测变更的问题。这种情况在许多物理场景中发生，例如铁磁性、晶体学、磁流体动力学和热力学，其中能量模型难以归一化。\n我们的方法基于累积和（CUSUM）统计的估计，已知这种方法可以产生最佳性能。我们首先提出一种直观吸引人的近似方法。不幸的是，这会产生 CUSUM 统计的有偏估计，并可能导致性能下降。然后，我们提出了基于热力学积分（TI）的对数分配近似累积和（LPA-CUSUM）算法，以估计变更前和变更后分布的归一化常数的对数比。证明了该方法对对数分配函数和 CUSUM 统计提供了无偏估计，并导致渐近最优性能。此外，我们推导出热力学积分所需的样本量与所需的检测延迟性能之间的关系，为实际参数选择提供了指导。提供的数值研究证明了我们方法的有效性。", "author": "Arman Adibi et.al.", "authors": "Arman Adibi, Sanjeev Kulkarni, H. Vincent Poor, Taposh Banerjee, Vahid Tarokh", "id": "2410.14615v1", "paper_url": "http://arxiv.org/abs/2410.14615v1", "repo": "null"}}