{"2410.17519": {"publish_time": "2024-10-23", "title": "Large Language Models Still Exhibit Bias in Long Text", "paper_summary": "Existing fairness benchmarks for large language models (LLMs) primarily focus\non simple tasks, such as multiple-choice questions, overlooking biases that may\narise in more complex scenarios like long-text generation. To address this gap,\nwe introduce the Long Text Fairness Test (LTF-TEST), a framework that evaluates\nbiases in LLMs through essay-style prompts. LTF-TEST covers 14 topics and 10\ndemographic axes, including gender and race, resulting in 11,948 samples. By\nassessing both model responses and the reasoning behind them, LTF-TEST uncovers\nsubtle biases that are difficult to detect in simple responses. In our\nevaluation of five recent LLMs, including GPT-4o and LLaMa3, we identify two\nkey patterns of bias. First, these models frequently favor certain demographic\ngroups in their responses. Second, they show excessive sensitivity toward\ntraditionally disadvantaged groups, often providing overly protective responses\nwhile neglecting others. To mitigate these biases, we propose FT-REGARD, a\nfinetuning approach that pairs biased prompts with neutral responses. FT-REGARD\nreduces gender bias by 34.6% and improves performance by 1.4 percentage points\non the BBQ benchmark, offering a promising approach to addressing biases in\nlong-text generation tasks.", "paper_summary_zh": "現有大型語言模型 (LLM) 的公平性基準主要關注於簡單的任務，例如選擇題，而忽略了在長文本生成等更複雜的場景中可能出現的偏見。為了解決這個差距，我們引入了長文本公平性測試 (LTF-TEST)，一個通過論文式提示評估 LLM 中偏見的框架。LTF-TEST 涵蓋 14 個主題和 10 個人口統計軸，包括性別和種族，產生 11,948 個樣本。通過評估模型的回應及其背後的推理，LTF-TEST 揭示了難以在簡單的回應中檢測到的微妙偏見。在我們對包括 GPT-4o 和 LLaMa3 在內的五個最新 LLM 的評估中，我們確定了兩種關鍵的偏見模式。首先，這些模型經常在其回應中偏愛某些人口統計群體。其次，它們對傳統上處於弱勢群體表現出過度的敏感性，經常提供過度保護性的回應，而忽視其他群體。為了減輕這些偏見，我們提出了 FT-REGARD，一種將有偏見的提示與中立回應配對的微調方法。FT-REGARD 將性別偏見降低了 34.6%，並在 BBQ 基準上將性能提高了 1.4 個百分點，為解決長文本生成任務中的偏見提供了一個有前景的方法。", "author": "Wonje Jeung et.al.", "authors": "Wonje Jeung, Dongjae Jeon, Ashkan Yousefpour, Jonghyun Choi", "id": "2410.17519v1", "paper_url": "http://arxiv.org/abs/2410.17519v1", "repo": "null"}}