{"2409.11583": {"publish_time": "2024-09-17", "title": "Uncertainty Decomposition and Error Margin Detection of Homodyned-K Distribution in Quantitative Ultrasound", "paper_summary": "Homodyned K-distribution (HK-distribution) parameter estimation in\nquantitative ultrasound (QUS) has been recently addressed using Bayesian Neural\nNetworks (BNNs). BNNs have been shown to significantly reduce computational\ntime in speckle statistics-based QUS without compromising accuracy and\nprecision. Additionally, they provide estimates of feature uncertainty, which\ncan guide the clinician's trust in the reported feature value. The total\npredictive uncertainty in Bayesian modeling can be decomposed into epistemic\n(uncertainty over the model parameters) and aleatoric (uncertainty inherent in\nthe data) components. By decomposing the predictive uncertainty, we can gain\ninsights into the factors contributing to the total uncertainty. In this study,\nwe propose a method to compute epistemic and aleatoric uncertainties for\nHK-distribution parameters ($\\alpha$ and $k$) estimated by a BNN, in both\nsimulation and experimental data. In addition, we investigate the relationship\nbetween the prediction error and both uncertainties, shedding light on the\ninterplay between these uncertainties and HK parameters errors.", "paper_summary_zh": "同調 K 分布 (HK 分布) 參數估計在定量超音波 (QUS) 中最近已使用貝氏神經網路 (BNN) 進行處理。已證實 BNN 能顯著減少基於散斑統計的 QUS 中的運算時間，同時不影響準確度和精密度。此外，它們能提供特徵不確定性的估計，這可以引導臨床醫生信任所報告的特徵值。貝氏建模中的總預測不確定性可分解為認識論 (模型參數的不確定性) 和隨機 (資料中固有的不確定性) 組成。透過分解預測不確定性，我們可以深入了解造成總不確定性的因素。在本研究中，我們提出一個方法來計算 BNN 估計的 HK 分布參數 ($\\alpha$ 和 $k$) 的認識論和隨機不確定性，這適用於模擬和實驗資料。此外，我們探討預測誤差與這兩種不確定性之間的關係，進而說明這些不確定性和 HK 參數誤差之間的交互作用。", "author": "Dorsa Ameri et.al.", "authors": "Dorsa Ameri, Ali K. Z. Tehrani, Ivan M. Rosado-Mendez, Hassan Rivaz", "id": "2409.11583v1", "paper_url": "http://arxiv.org/abs/2409.11583v1", "repo": "null"}}