{"2501.04844": {"publish_time": "2025-01-08", "title": "Enhancing Listened Speech Decoding from EEG via Parallel Phoneme Sequence Prediction", "paper_summary": "Brain-computer interfaces (BCI) offer numerous human-centered application\npossibilities, particularly affecting people with neurological disorders. Text\nor speech decoding from brain activities is a relevant domain that could\naugment the quality of life for people with impaired speech perception. We\npropose a novel approach to enhance listened speech decoding from\nelectroencephalography (EEG) signals by utilizing an auxiliary phoneme\npredictor that simultaneously decodes textual phoneme sequences. The proposed\nmodel architecture consists of three main parts: EEG module, speech module, and\nphoneme predictor. The EEG module learns to properly represent EEG signals into\nEEG embeddings. The speech module generates speech waveforms from the EEG\nembeddings. The phoneme predictor outputs the decoded phoneme sequences in text\nmodality. Our proposed approach allows users to obtain decoded listened speech\nfrom EEG signals in both modalities (speech waveforms and textual phoneme\nsequences) simultaneously, eliminating the need for a concatenated sequential\npipeline for each modality. The proposed approach also outperforms previous\nmethods in both modalities. The source code and speech samples are publicly\navailable.", "paper_summary_zh": "腦機介面 (BCI) 提供許多以人為中心的應用可能性，特別是影響神經疾病患者。從大腦活動中解碼文字或語音是一個相關領域，可以提升言語感知受損者的生活品質。我們提出一個新方法來增強從腦電圖 (EEG) 訊號中解碼聽到的語音，方法是利用一個輔助音素預測器，它同時解碼文字音素序列。所提出的模型架構包含三個主要部分：EEG 模組、語音模組和音素預測器。EEG 模組學習將 EEG 訊號適當地表示成 EEG 嵌入。語音模組從 EEG 嵌入中產生語音波形。音素預測器輸出以文字型態解碼的音素序列。我們提出的方法讓使用者能夠同時從 EEG 訊號中以兩種型態（語音波形和文字音素序列）取得解碼的聽力語音，消除了對每個型態串接順序管線的需求。所提出的方法在兩種型態中也優於先前的做法。原始碼和語音範例公開提供。", "author": "Jihwan Lee et.al.", "authors": "Jihwan Lee, Tiantian Feng, Aditya Kommineni, Sudarsana Reddy Kadiri, Shrikanth Narayanan", "id": "2501.04844v1", "paper_url": "http://arxiv.org/abs/2501.04844v1", "repo": "null"}}