{"2406.08070": {"publish_time": "2024-06-12", "title": "CFG++: Manifold-constrained Classifier Free Guidance for Diffusion Models", "paper_summary": "Classifier-free guidance (CFG) is a fundamental tool in modern diffusion\nmodels for text-guided generation. Although effective, CFG has notable\ndrawbacks. For instance, DDIM with CFG lacks invertibility, complicating image\nediting; furthermore, high guidance scales, essential for high-quality outputs,\nfrequently result in issues like mode collapse. Contrary to the widespread\nbelief that these are inherent limitations of diffusion models, this paper\nreveals that the problems actually stem from the off-manifold phenomenon\nassociated with CFG, rather than the diffusion models themselves. More\nspecifically, inspired by the recent advancements of diffusion model-based\ninverse problem solvers (DIS), we reformulate text-guidance as an inverse\nproblem with a text-conditioned score matching loss, and develop CFG++, a novel\napproach that tackles the off-manifold challenges inherent in traditional CFG.\nCFG++ features a surprisingly simple fix to CFG, yet it offers significant\nimprovements, including better sample quality for text-to-image generation,\ninvertibility, smaller guidance scales, reduced mode collapse, etc.\nFurthermore, CFG++ enables seamless interpolation between unconditional and\nconditional sampling at lower guidance scales, consistently outperforming\ntraditional CFG at all scales. Experimental results confirm that our method\nsignificantly enhances performance in text-to-image generation, DDIM inversion,\nediting, and solving inverse problems, suggesting a wide-ranging impact and\npotential applications in various fields that utilize text guidance. Project\nPage: https://cfgpp-diffusion.github.io/.", "paper_summary_zh": "<paragraph>無分類器引導 (CFG) 是現代擴散模型中用於文字引導生成的基礎工具。雖然有效，但 CFG 有顯著的缺點。例如，帶有 CFG 的 DDIM 缺乏可逆性，使影像編輯複雜化；此外，對於高品質輸出至關重要的高引導比例，經常導致模式崩潰等問題。與廣泛認為這些是擴散模型的固有限制相反，本文揭示這些問題實際上源自與 CFG 相關的流形外現象，而不是擴散模型本身。更具體地說，受到基於擴散模型的逆問題求解器 (DIS) 的最新進展的啟發，我們將文字引導重新表述為一個具有文字條件分數匹配損失的逆問題，並開發了 CFG++，這是一種新的方法，可以解決傳統 CFG 中固有的流形外挑戰。CFG++ 對 CFG 有一個驚人地簡單的修復，但它提供了顯著的改進，包括文字轉影像生成的更好範本品質、可逆性、更小的引導比例、減少模式崩潰等。此外，CFG++ 能夠在較低的引導比例下在無條件和條件抽樣之間進行無縫插值，在所有比例下都持續優於傳統 CFG。實驗結果證實，我們的模型顯著增強了文字轉影像生成、DDIM 反演、編輯和解決逆問題的效能，這表明在利用文字引導的各個領域中具有廣泛的影響和潛在應用。專案頁面：https://cfgpp-diffusion.github.io/。</paragraph>", "author": "Hyungjin Chung et.al.", "authors": "Hyungjin Chung, Jeongsol Kim, Geon Yeong Park, Hyelin Nam, Jong Chul Ye", "id": "2406.08070v1", "paper_url": "http://arxiv.org/abs/2406.08070v1", "repo": "null"}}