{"2408.14326": {"publish_time": "2024-08-26", "title": "Streamline tractography of the fetal brain in utero with machine learning", "paper_summary": "Diffusion-weighted magnetic resonance imaging (dMRI) is the only non-invasive\ntool for studying white matter tracts and structural connectivity of the brain.\nThese assessments rely heavily on tractography techniques, which reconstruct\nvirtual streamlines representing white matter fibers. Much effort has been\ndevoted to improving tractography methodology for adult brains, while\ntractography of the fetal brain has been largely neglected. Fetal tractography\nfaces unique difficulties due to low dMRI signal quality, immature and rapidly\ndeveloping brain structures, and paucity of reference data. This work presents\nthe first machine learning model for fetal tractography. The model input\nconsists of five sources of information: (1) Fiber orientation, inferred from a\ndiffusion tensor fit to the dMRI signal; (2) Directions of recent propagation\nsteps; (3) Global spatial information, encoded as distances to keypoints in the\nbrain cortex; (4) Tissue segmentation information; and (5) Prior information\nabout the expected local fiber orientations supplied with an atlas. In order to\nmitigate the local tensor estimation error, a large spatial context around the\ncurrent point in the diffusion tensor image is encoded using convolutional and\nattention neural network modules. Moreover, the diffusion tensor information at\na hypothetical next point is included in the model input. Filtering rules based\non anatomically constrained tractography are applied to prune implausible\nstreamlines. We trained the model on manually-refined whole-brain fetal\ntractograms and validated the trained model on an independent set of 11 test\nscans with gestational ages between 23 and 36 weeks. Results show that our\nproposed method achieves superior performance across all evaluated tracts. The\nnew method can significantly advance the capabilities of dMRI for studying\nnormal and abnormal brain development in utero.", "paper_summary_zh": "擴散加權磁振造影 (dMRI) 是唯一用於研究白質束和腦部結構連接性的非侵入性工具。這些評估高度依賴於纖維束描描術，它會重建代表白質纖維的虛擬流線。許多研究致力於改善成人腦部纖維束描描術方法，而胎兒腦部的纖維束描描術則很大程度上被忽略。胎兒纖維束描描術面臨獨特的難題，包括 dMRI 訊號品質低、腦部結構不成熟且快速發展，以及缺乏參考資料。這項研究提出了第一個用於胎兒纖維束描描術的機器學習模型。模型輸入包括五種資訊來源：(1) 纖維方向，從 dMRI 訊號推論而得的擴散張量擬合；(2) 最近傳播步驟的方向；(3) 全域空間資訊，編碼為腦皮質關鍵點的距離；(4) 組織分割資訊；以及 (5) 圖譜提供的預期局部纖維方向的先驗資訊。為了減輕局部張量估計誤差，使用卷積和注意神經網路模組編碼擴散張量影像中當前點周圍的大量空間脈絡。此外，假設下一個點的擴散張量資訊也包含在模型輸入中。基於解剖限制纖維束描描術的過濾規則用於修剪難以置信的流線。我們在人工精修的全腦胎兒纖維束描描圖上訓練模型，並在包含 11 個測試掃描的獨立集上驗證訓練後的模型，這些掃描的胎齡介於 23 到 36 週之間。結果顯示，我們提出的方法在所有評估束中都達到優異的效能。新方法可以大幅提升 dMRI 在研究子宮內正常和異常腦部發育方面的能力。", "author": "Weide Liu et.al.", "authors": "Weide Liu, Camilo Calixto, Simon K. Warfield, Davood Karimi", "id": "2408.14326v1", "paper_url": "http://arxiv.org/abs/2408.14326v1", "repo": "null"}}