{"2407.21330": {"publish_time": "2024-07-31", "title": "Performance of Recent Large Language Models for a Low-Resourced Language", "paper_summary": "Large Language Models (LLMs) have shown significant advances in the past\nyear. In addition to new versions of GPT and Llama, several other LLMs have\nbeen introduced recently. Some of these are open models available for download\nand modification.\n  Although multilingual large language models have been available for some\ntime, their performance on low-resourced languages such as Sinhala has been\npoor. We evaluated four recent LLMs on their performance directly in the\nSinhala language, and by translation to and from English. We also evaluated\ntheir fine-tunability with a small amount of fine-tuning data. Claude and GPT\n4o perform well out-of-the-box and do significantly better than previous\nversions. Llama and Mistral perform poorly but show some promise of improvement\nwith fine tuning.", "paper_summary_zh": "大型語言模型 (LLM) 在過去一年中展現出顯著的進步。除了 GPT 和 Llama 的新版本之外，最近還推出了其他幾種 LLM。其中一些是開放模型，可供下載和修改。\n儘管多語言大型語言模型已經存在一段時間，但它們在僧伽羅語等低資源語言上的表現一直很差。我們直接在僧伽羅語和通過翻譯成英語和從英語翻譯的方式評估了四種最新的 LLM 的表現。我們還評估了它們在少量微調數據下的微調能力。Claude 和 GPT 4o 開箱即用表現良好，並且比之前的版本有顯著的進步。Llama 和 Mistral 表現不佳，但微調後表現出了一些改進的希望。", "author": "Ravindu Jayakody et.al.", "authors": "Ravindu Jayakody, Gihan Dias", "id": "2407.21330v1", "paper_url": "http://arxiv.org/abs/2407.21330v1", "repo": "null"}}