{"2412.02220": {"publish_time": "2024-12-03", "title": "Unlocking Tuning-Free Few-Shot Adaptability in Visual Foundation Models by Recycling Pre-Tuned LoRAs", "paper_summary": "Large Language Models (LLMs) such as ChatGPT demonstrate strong few-shot\nadaptability without requiring fine-tuning, positioning them ideal for\ndata-limited and real-time applications. However, this adaptability has not yet\nbeen replicated in current Visual Foundation Models (VFMs), which require\nexplicit fine-tuning with sufficient tuning data. Besides, the\npretraining-finetuning paradigm has led to the surge of numerous task-specific\nmodular components, such as Low-Rank Adaptation (LoRA). For the first time, we\nexplore the potential of reusing diverse pre-tuned LoRAs without accessing\ntheir original training data, to achieve tuning-free few-shot adaptation in\nVFMs. Our framework, LoRA Recycle, distills a meta-LoRA from diverse pre-tuned\nLoRAs with a meta-learning objective, using surrogate data generated inversely\nfrom pre-tuned LoRAs themselves. The VFM, once equipped with the meta-LoRA, is\nempowered to solve new few-shot tasks in a single forward pass, akin to the\nin-context learning of LLMs. Additionally, we incorporate a double-efficient\nmechanism tailored to our framework, significantly accelerating the\nmeta-training process while maintaining or even improving performance.\nExtensive experiments across various few-shot classification benchmarks across\nboth in- and cross-domain scenarios demonstrate the superiority of our\nframework.", "paper_summary_zh": "大型語言模型 (LLM)，例如 ChatGPT，展示了強大的小樣本適應性，而不需要微調，使其成為數據受限和實時應用程序的理想選擇。然而，這種適應性尚未在當前的視覺基礎模型 (VFM) 中複製，後者需要使用足夠的調整數據進行明確的微調。此外，預訓練微調範例導致大量特定任務模組化組件激增，例如低秩適應 (LoRA)。我們首次探索了在不訪問其原始訓練數據的情況下重複使用各種預調 LoRA 的潛力，以在 VFM 中實現無需調整的小樣本適應。我們的框架 LoRA Recycle 從各種預調 LoRA 中提取一個元 LoRA，並使用從預調 LoRA 本身反向生成的替代數據，使用元學習目標。一旦配備了元 LoRA，VFM 便能夠在單次前向傳遞中解決新的少樣本任務，類似於 LLM 的情境學習。此外，我們結合了一種專門針對我們框架的雙重高效機制，顯著加速了元訓練過程，同時保持或甚至提高了性能。跨各種少樣本分類基準的廣泛實驗，無論是在域內還是跨域場景中，都證明了我們框架的優越性。", "author": "Zixuan Hu et.al.", "authors": "Zixuan Hu, Yongxian Wei, Li Shen, Chun Yuan, Dacheng Tao", "id": "2412.02220v1", "paper_url": "http://arxiv.org/abs/2412.02220v1", "repo": "null"}}