{"2406.11741": {"publish_time": "2024-06-17", "title": "Transcendence: Generative Models Can Outperform The Experts That Train Them", "paper_summary": "Generative models are trained with the simple objective of imitating the\nconditional probability distribution induced by the data they are trained on.\nTherefore, when trained on data generated by humans, we may not expect the\nartificial model to outperform the humans on their original objectives. In this\nwork, we study the phenomenon of transcendence: when a generative model\nachieves capabilities that surpass the abilities of the experts generating its\ndata. We demonstrate transcendence by training an autoregressive transformer to\nplay chess from game transcripts, and show that the trained model can sometimes\nachieve better performance than all players in the dataset. We theoretically\nprove that transcendence is enabled by low-temperature sampling, and rigorously\nassess this experimentally. Finally, we discuss other sources of transcendence,\nlaying the groundwork for future investigation of this phenomenon in a broader\nsetting.", "paper_summary_zh": "生成模型的訓練目標很簡單，就是模仿訓練資料所引發的條件機率分佈。因此，當我們使用人類產生的資料進行訓練時，我們可能不會期望人工模型在原本的目標上超越人類。在這項研究中，我們探討超越現象：當生成模型達到的能力超越產生其資料的專家能力。我們透過訓練一個自迴歸Transformer從遊戲記錄中下棋來證明超越，並顯示訓練出來的模型有時可以在資料集中達成比所有玩家更好的表現。我們在理論上證明了超越是由低溫取樣所促成，並嚴格地以實驗評估這一點。最後，我們討論超越的其他來源，為未來在更廣泛的設定中探討此現象奠定基礎。", "author": "Edwin Zhang et.al.", "authors": "Edwin Zhang, Vincent Zhu, Naomi Saphra, Anat Kleiman, Benjamin L. Edelman, Milind Tambe, Sham M. Kakade, Eran Malach", "id": "2406.11741v1", "paper_url": "http://arxiv.org/abs/2406.11741v1", "repo": "null"}}