{"2411.09595": {"publish_time": "2024-11-14", "title": "LLaMA-Mesh: Unifying 3D Mesh Generation with Language Models", "paper_summary": "This work explores expanding the capabilities of large language models (LLMs)\npretrained on text to generate 3D meshes within a unified model. This offers\nkey advantages of (1) leveraging spatial knowledge already embedded in LLMs,\nderived from textual sources like 3D tutorials, and (2) enabling conversational\n3D generation and mesh understanding. A primary challenge is effectively\ntokenizing 3D mesh data into discrete tokens that LLMs can process seamlessly.\nTo address this, we introduce LLaMA-Mesh, a novel approach that represents the\nvertex coordinates and face definitions of 3D meshes as plain text, allowing\ndirect integration with LLMs without expanding the vocabulary. We construct a\nsupervised fine-tuning (SFT) dataset enabling pretrained LLMs to (1) generate\n3D meshes from text prompts, (2) produce interleaved text and 3D mesh outputs\nas required, and (3) understand and interpret 3D meshes. Our work is the first\nto demonstrate that LLMs can be fine-tuned to acquire complex spatial knowledge\nfor 3D mesh generation in a text-based format, effectively unifying the 3D and\ntext modalities. LLaMA-Mesh achieves mesh generation quality on par with models\ntrained from scratch while maintaining strong text generation performance.", "paper_summary_zh": "本研究探索了擴展大型語言模型 (LLM) 的能力，這些模型經過文字預訓練，可以在統一模型中生成 3D 網格。這提供了下列主要優點：(1) 充分利用 LLM 中已嵌入的空間知識，這些知識來自 3D 教學等文字來源，以及 (2) 支援對話式 3D 生成和網格理解。一個主要的挑戰是有效地將 3D 網格資料代幣化為 LLM 可以無縫處理的離散代幣。為了解決這個問題，我們引入了 LLaMA-Mesh，這是一種新方法，它將 3D 網格的頂點座標和面部定義表示為純文字，允許直接與 LLM 整合，而無需擴充詞彙。我們建構了一個監督微調 (SFT) 資料集，讓預訓練的 LLM 能夠 (1) 從文字提示中生成 3D 網格，(2) 根據需要產生交錯的文字和 3D 網格輸出，以及 (3) 理解和解釋 3D 網格。我們的研究首次證明，LLM 可以微調以獲取複雜的空間知識，用於以文字為基礎的格式進行 3D 網格生成，有效地統一了 3D 和文字模式。LLaMA-Mesh 達到了與從頭開始訓練的模型同等的網格生成品質，同時保持強大的文字生成效能。", "author": "Zhengyi Wang et.al.", "authors": "Zhengyi Wang, Jonathan Lorraine, Yikai Wang, Hang Su, Jun Zhu, Sanja Fidler, Xiaohui Zeng", "id": "2411.09595v1", "paper_url": "http://arxiv.org/abs/2411.09595v1", "repo": "null"}}