{"2406.11160": {"publish_time": "2024-06-17", "title": "Contextual Knowledge Graph", "paper_summary": "Knowledge Graphs (KGs) are foundational structures in many AI applications,\nrepresenting entities and their interrelations through triples. However,\ntriple-based KGs lack the contextual information of relational knowledge, like\ntemporal dynamics and provenance details, which are crucial for comprehensive\nknowledge representation and effective reasoning. Instead, \\textbf{Contextual\nKnowledge Graphs} (CKGs) expand upon the conventional structure by\nincorporating additional information such as time validity, geographic\nlocation, and source provenance. This integration provides a more nuanced and\naccurate understanding of knowledge, enabling KGs to offer richer insights and\nsupport more sophisticated reasoning processes. In this work, we first discuss\nthe inherent limitations of triple-based KGs and introduce the concept of\ncontextual KGs, highlighting their advantages in knowledge representation and\nreasoning. We then present \\textbf{KGR$^3$, a context-enriched KG reasoning\nparadigm} that leverages large language models (LLMs) to retrieve candidate\nentities and related contexts, rank them based on the retrieved information,\nand reason whether sufficient information has been obtained to answer a query.\nOur experimental results demonstrate that KGR$^3$ significantly improves\nperformance on KG completion (KGC) and KG question answering (KGQA) tasks,\nvalidating the effectiveness of incorporating contextual information on KG\nrepresentation and reasoning.", "paper_summary_zh": "知識圖譜 (KG) 是許多 AI 應用中的基礎結構，透過三元組表示實體及其相互關係。然而，基於三元組的 KG 缺乏關係知識的背景資訊，例如時間動態和來源細節，這些資訊對於全面的知識表徵和有效的推理至關重要。相反地，**背景知識圖譜** (CKG) 透過納入時間有效性、地理位置和來源出處等額外資訊，擴展了傳統的結構。這種整合提供了對知識更細緻且準確的理解，使 KG 能提供更豐富的見解並支援更精密的推理過程。在這項工作中，我們首先討論基於三元組的 KG 的內在限制，並介紹背景 KG 的概念，強調它們在知識表徵和推理方面的優勢。然後，我們提出**KGR$^3$，一種背景豐富的 KG 推理範例**，它利用大型語言模型 (LLM) 來擷取候選實體和相關背景，根據擷取的資訊對它們進行排名，並推論是否已獲得足夠的資訊來回答查詢。我們的實驗結果證明，KGR$^3$ 大幅提升了 KG 完成 (KGC) 和 KG 問答 (KGQA) 任務的效能，驗證了在 KG 表徵和推理中納入背景資訊的有效性。", "author": "Chengjin Xu et.al.", "authors": "Chengjin Xu, Muzhi Li, Cehao Yang, Xuhui Jiang, Lumingyuan Tang, Yiyan Qi, Jian Guo", "id": "2406.11160v2", "paper_url": "http://arxiv.org/abs/2406.11160v2", "repo": "null"}}