{"2408.12547": {"publish_time": "2024-08-22", "title": "Towards Evaluating and Building Versatile Large Language Models for Medicine", "paper_summary": "In this study, we present MedS-Bench, a comprehensive benchmark designed to\nevaluate the performance of large language models (LLMs) in clinical contexts.\nUnlike existing benchmarks that focus on multiple-choice question answering,\nMedS-Bench spans 11 high-level clinical tasks, including clinical report\nsummarization, treatment recommendations, diagnosis, named entity recognition,\nand medical concept explanation, among others. We evaluated six leading LLMs,\ne.g., MEDITRON, Mistral, InternLM 2, Llama 3, GPT-4, and Claude-3.5 using\nfew-shot prompting, and found that even the most sophisticated models struggle\nwith these complex tasks. To address these limitations, we developed MedS-Ins,\na large-scale instruction tuning dataset for medicine. MedS-Ins comprises 58\nmedically oriented language corpora, totaling 13.5 million samples across 122\ntasks. To demonstrate the dataset's utility, we conducted a proof-of-concept\nexperiment by performing instruction tuning on a lightweight, open-source\nmedical language model. The resulting model, MMedIns-Llama 3, significantly\noutperformed existing models across nearly all clinical tasks. To promote\nfurther advancements in the application of LLMs to clinical challenges, we have\nmade the MedS-Ins dataset fully accessible and invite the research community to\ncontribute to its expansion.Additionally, we have launched a dynamic\nleaderboard for MedS-Bench, which we plan to regularly update the test set to\ntrack progress and enhance the adaptation of general LLMs to the medical\ndomain. Leaderboard: https://henrychur.github.io/MedS-Bench/. Github:\nhttps://github.com/MAGIC-AI4Med/MedS-Ins.", "paper_summary_zh": "<paragraph>本研究中，我们提出 MedS-Bench，这是一个旨在评估大型语言模型 (LLM) 在临床环境中的性能的综合基准。\n与专注于多项选择问答的现有基准不同，MedS-Bench 涵盖 11 项高级临床任务，包括临床报告摘要、治疗建议、诊断、命名实体识别和医学概念解释等。我们使用少样本提示评估了六个领先的 LLM，例如 MEDITRON、Mistral、InternLM 2、Llama 3、GPT-4 和 Claude-3.5，发现即使是最复杂的模型在这些复杂的任务中也难以应对。为了解决这些限制，我们开发了 MedS-Ins，这是一个用于医学的大规模指令微调数据集。MedS-Ins 包含 58 个医学语言语料库，总计 122 个任务中的 1350 万个样本。为了展示数据集的效用，我们通过对轻量级开源医学语言模型执行指令微调来进行概念验证实验。由此产生的模型 MMedIns-Llama 3 在几乎所有临床任务中都明显优于现有模型。为了促进 LLM 在临床挑战中的应用的进一步发展，我们已经让 MedS-Ins 数据集完全可以访问，并邀请研究界为其扩展做出贡献。此外，我们已经为 MedS-Bench 推出了一个动态排行榜，我们计划定期更新测试集以跟踪进度并增强通用 LLM 对医学领域的适应性。排行榜：https://henrychur.github.io/MedS-Bench/。Github：https://github.com/MAGIC-AI4Med/MedS-Ins。</paragraph>", "author": "Chaoyi Wu et.al.", "authors": "Chaoyi Wu, Pengcheng Qiu, Jinxin Liu, Hongfei Gu, Na Li, Ya Zhang, Yanfeng Wang, Weidi Xie", "id": "2408.12547v1", "paper_url": "http://arxiv.org/abs/2408.12547v1", "repo": "https://github.com/magic-ai4med/meds-ins"}}