{"2412.07429": {"publish_time": "2024-12-10", "title": "Optimizing Alignment with Less: Leveraging Data Augmentation for Personalized Evaluation", "paper_summary": "Automatic evaluation by large language models (LLMs) is a prominent topic\ntoday; however, judgment and evaluation tasks are often subjective and\ninfluenced by various factors, making adaptation challenging. While many\nstudies demonstrate the capabilities of state-of-the-art proprietary LLMs in\ncomparison to human evaluators, they often struggle to adapt to reference\nevaluators over time, a requirement for achieving personalized judgment.\nAdditionally, numerous works have attempted to apply open LLMs as judges or\nevaluators, but these efforts frequently overlook the limitations of working\nwith scarce data. Personalized judgment is inherently associated with limited\ndata scenarios, which are common in many real-world problems. Our work aims to\npresent a data augmentation technique to select a more effective sample from\nlimited data in order to align an open LLM with human preference. Our work\nachieves approximately 7% improvements in Pearson correlation with a reference\njudge over the baseline,and 30% improvement over the base model\n(Llama3.1-8B-Instruct) in the mathematical reasoning evaluation task.\ndemonstrating that augmenting selecting more effective preference data enables\nour approach to surpass baseline methods.", "paper_summary_zh": "大型語言模型 (LLM) 的自動評估是當今的熱門話題；然而，判斷和評估任務通常是主觀的，並受到各種因素的影響，這使得適應具有挑戰性。雖然許多研究展示了最先進的專有 LLM 與人類評估員相比的能力，但它們通常難以隨著時間適應參考評估員，這是實現個性化判斷的要求。此外，許多作品嘗試將開放式 LLM 應用為評判或評估員，但這些努力常常忽略了使用稀疏數據的限制。個性化判斷本質上與有限數據場景相關，這在許多現實世界問題中很常見。我們的目標是提出一種數據擴充技術，從有限數據中選擇一個更有效的樣本，以便將開放式 LLM 與人類偏好保持一致。我們的研究在與參考評審員的皮爾森相關性方面取得了大約 7% 的改進，而在數學推理評估任務中，則比基礎模型 (Llama3.1-8B-Instruct) 提高了 30%。這表明擴充選擇更有效的偏好數據使我們的方法能夠超越基線方法。", "author": "Javad Seraj et.al.", "authors": "Javad Seraj, Mohammad Mahdi Mohajeri, Mohammad Javad Dousti, Majid Nili Ahmadabadi", "id": "2412.07429v1", "paper_url": "http://arxiv.org/abs/2412.07429v1", "repo": "null"}}