{"2412.08460": {"publish_time": "2024-12-11", "title": "Federated Learning for Traffic Flow Prediction with Synthetic Data Augmentation", "paper_summary": "Deep-learning based traffic prediction models require vast amounts of data to\nlearn embedded spatial and temporal dependencies. The inherent privacy and\ncommercial sensitivity of such data has encouraged a shift towards\ndecentralised data-driven methods, such as Federated Learning (FL). Under a\ntraditional Machine Learning paradigm, traffic flow prediction models can\ncapture spatial and temporal relationships within centralised data. In reality,\ntraffic data is likely distributed across separate data silos owned by multiple\nstakeholders. In this work, a cross-silo FL setting is motivated to facilitate\nstakeholder collaboration for optimal traffic flow prediction applications.\nThis work introduces an FL framework, referred to as FedTPS, to generate\nsynthetic data to augment each client's local dataset by training a\ndiffusion-based trajectory generation model through FL. The proposed framework\nis evaluated on a large-scale real world ride-sharing dataset using various FL\nmethods and Traffic Flow Prediction models, including a novel prediction model\nwe introduce, which leverages Temporal and Graph Attention mechanisms to learn\nthe Spatio-Temporal dependencies embedded within regional traffic flow data.\nExperimental results show that FedTPS outperforms multiple other FL baselines\nwith respect to global model performance.", "paper_summary_zh": "深度學習的交通預測模型需要大量的資料來學習內嵌的時空依賴性。這些資料固有的隱私性和商業敏感性促使人們轉向分散式資料驅動方法，例如聯合學習 (FL)。在傳統的機器學習範例中，交通流量預測模型可以在集中式資料中擷取時空關係。實際上，交通資料可能分散在由多個利害關係人擁有的獨立資料倉儲中。在這項工作中，跨倉儲 FL 設定的目的是促進利害關係人合作，以實現最佳的交通流量預測應用。這項工作引入了一個 FL 架構，稱為 FedTPS，用於生成合成資料，以透過 FL 訓練基於擴散的軌跡生成模型，來擴充每個客戶端的本地資料集。所提出的架構在一個大規模的真實世界共乘資料集上進行評估，使用各種 FL 方法和交通流量預測模型，包括我們引入的一個新穎預測模型，它利用時序和圖形注意力機制來學習區域交通流量資料中內嵌的時空依賴性。實驗結果表明，FedTPS 在全球模型效能方面優於其他多個 FL 基準。", "author": "Fermin Orozco et.al.", "authors": "Fermin Orozco, Pedro Porto Buarque de Gusmão, Hongkai Wen, Johan Wahlström, Man Luo", "id": "2412.08460v1", "paper_url": "http://arxiv.org/abs/2412.08460v1", "repo": "null"}}