{"2410.15437": {"publish_time": "2024-10-20", "title": "AttCDCNet: Attention-enhanced Chest Disease Classification using X-Ray Images", "paper_summary": "Chest X-rays (X-ray images) have been proven to be effective for the\ndiagnosis of chest diseases, including Pneumonia, Lung Opacity, and COVID-19.\nHowever, relying on traditional medical methods for diagnosis from X-ray images\nis prone to delays and inaccuracies because the medical personnel who evaluate\nthe X-ray images may have preconceived biases. For this reason, researchers\nhave proposed the use of deep learning-based techniques to facilitate the\ndiagnosis process. The preeminent method is the use of sophisticated\nConvolutional Neural Networks (CNNs). In this paper, we propose a novel\ndetection model named \\textbf{AttCDCNet} for the task of X-ray image diagnosis,\nenhancing the popular DenseNet121 model by adding an attention block to help\nthe model focus on the most relevant regions, using focal loss as a loss\nfunction to overcome the imbalance of the dataset problem, and utilizing\ndepth-wise convolution to reduce the parameters to make the model lighter.\nThrough extensive experimental evaluations, the proposed model demonstrates\nexceptional performance, showing better results than the original DenseNet121.\nThe proposed model achieved an accuracy, precision and recall of 94.94%, 95.14%\nand 94.53%, respectively, on the COVID-19 Radiography Dataset.", "paper_summary_zh": "胸部 X 光（X 光影像）已被證實可有效診斷胸部疾病，包括肺炎、肺部不透明度和 COVID-19。然而，依賴傳統醫學方法從 X 光影像中進行診斷容易延誤和不準確，因為評估 X 光影像的醫護人員可能有預設立場的偏見。因此，研究人員提出使用基於深度學習的技術來促進診斷過程。最主要的方法是使用複雜的卷積神經網路 (CNN)。在本文中，我們提出一個名為 \\textbf{AttCDCNet} 的新檢測模型，用於 X 光影像診斷任務，透過加入一個注意力區塊來增強流行的 DenseNet121 模型，以幫助模型專注於最相關的區域，並使用焦點損失作為損失函數來克服資料集問題的不平衡，並利用深度卷積來減少參數，使模型更輕量化。透過廣泛的實驗評估，所提出的模型展現出非凡的效能，顯示出比原始 DenseNet121 更好的結果。所提出的模型在 COVID-19 放射線照相資料集上分別達到了 94.94%、95.14% 和 94.53% 的準確度、精確度和召回率。", "author": "Omar Hesham Khater et.al.", "authors": "Omar Hesham Khater, Abdullahi Sani Shuaib, Sami Ul Haq, Abdul Jabbar Siddiqui", "id": "2410.15437v1", "paper_url": "http://arxiv.org/abs/2410.15437v1", "repo": "null"}}