{"2409.11267": {"publish_time": "2024-09-17", "title": "Integrating Reinforcement Learning and Model Predictive Control with Applications to Microgrids", "paper_summary": "This work proposes an approach that integrates reinforcement learning and\nmodel predictive control (MPC) to efficiently solve finite-horizon optimal\ncontrol problems in mixed-logical dynamical systems. Optimization-based control\nof such systems with discrete and continuous decision variables entails the\nonline solution of mixed-integer quadratic or linear programs, which suffer\nfrom the curse of dimensionality. Our approach aims at mitigating this issue by\neffectively decoupling the decision on the discrete variables and the decision\non the continuous variables. Moreover, to mitigate the combinatorial growth in\nthe number of possible actions due to the prediction horizon, we conceive the\ndefinition of decoupled Q-functions to make the learning problem more\ntractable. The use of reinforcement learning reduces the online optimization\nproblem of the MPC controller from a mixed-integer linear (quadratic) program\nto a linear (quadratic) program, greatly reducing the computational time.\nSimulation experiments for a microgrid, based on real-world data, demonstrate\nthat the proposed method significantly reduces the online computation time of\nthe MPC approach and that it generates policies with small optimality gaps and\nhigh feasibility rates.", "paper_summary_zh": "本研究提出一种方法，整合强化学习和模型预测控制 (MPC)，以有效解决混合逻辑动态系统中的有限时间最优控制问题。此类具有离散和连续决策变量的基于优化控制的系统需要在线解决混合整数二次或线性规划，这会受到维度灾难的影响。我们的方法旨在通过有效解耦离散变量的决策和连续变量的决策来缓解此问题。此外，为了减轻预测范围导致的可能动作数量的组合增长，我们构想了解耦 Q 函数的定义，以使学习问题更容易处理。强化学习的使用将 MPC 控制器的在线优化问题从混合整数线性（二次）规划减少到线性（二次）规划，从而大大减少了计算时间。基于真实世界数据的微电网仿真实验表明，所提出的方法显著减少了 MPC 方法的在线计算时间，并且它生成的策略具有较小的最优性差距和较高的可行性比率。", "author": "Caio Fabio Oliveira da Silva et.al.", "authors": "Caio Fabio Oliveira da Silva, Azita Dabiri, Bart De Schutter", "id": "2409.11267v1", "paper_url": "http://arxiv.org/abs/2409.11267v1", "repo": "null"}}