{"2501.13418": {"publish_time": "2025-01-23", "title": "Rethinking the Sample Relations for Few-Shot Classification", "paper_summary": "Feature quality is paramount for classification performance, particularly in\nfew-shot scenarios. Contrastive learning, a widely adopted technique for\nenhancing feature quality, leverages sample relations to extract intrinsic\nfeatures that capture semantic information and has achieved remarkable success\nin Few-Shot Learning (FSL). Nevertheless, current few-shot contrastive learning\napproaches often overlook the semantic similarity discrepancies at different\ngranularities when employing the same modeling approach for different sample\nrelations, which limits the potential of few-shot contrastive learning. In this\npaper, we introduce a straightforward yet effective contrastive learning\napproach, Multi-Grained Relation Contrastive Learning (MGRCL), as a\npre-training feature learning model to boost few-shot learning by meticulously\nmodeling sample relations at different granularities. MGRCL categorizes sample\nrelations into three types: intra-sample relation of the same sample under\ndifferent transformations, intra-class relation of homogenous samples, and\ninter-class relation of inhomogeneous samples. In MGRCL, we design\nTransformation Consistency Learning (TCL) to ensure the rigorous semantic\nconsistency of a sample under different transformations by aligning predictions\nof input pairs. Furthermore, to preserve discriminative information, we employ\nClass Contrastive Learning (CCL) to ensure that a sample is always closer to\nits homogenous samples than its inhomogeneous ones, as homogenous samples share\nsimilar semantic content while inhomogeneous samples have different semantic\ncontent. Our method is assessed across four popular FSL benchmarks, showing\nthat such a simple pre-training feature learning method surpasses a majority of\nleading FSL methods. Moreover, our method can be incorporated into other FSL\nmethods as the pre-trained model and help them obtain significant performance\ngains.", "paper_summary_zh": "特徵品質對於分類效能至關重要，特別是在小樣本情境中。對比學習是一種廣泛採用的技術，用於提升特徵品質，它利用樣本關係來萃取內在特徵，以擷取語意資訊，並在小樣本學習 (FSL) 中獲得顯著的成功。儘管如此，目前的少樣本對比學習方法在對不同樣本關係採用相同的建模方法時，通常會忽略不同粒度下的語意相似性差異，這限制了少樣本對比學習的潛力。在本文中，我們介紹一種簡單但有效的對比學習方法，即多粒度關係對比學習 (MGRCL)，作為預訓練特徵學習模型，透過在不同粒度下仔細建模樣本關係來提升少樣本學習。MGRCL 將樣本關係分類為三種類型：同一樣本在不同轉換下的樣本內關係、同類樣本的類內關係，以及不同類樣本的類間關係。在 MGRCL 中，我們設計了轉換一致性學習 (TCL)，透過比對輸入對的預測，來確保樣本在不同轉換下的嚴謹語意一致性。此外，為了保留區辨性資訊，我們採用類對比學習 (CCL)，以確保樣本始終比其不同類樣本更接近其同類樣本，因為同類樣本具有相似的語意內容，而不同類樣本具有不同的語意內容。我們的模型在四個流行的 FSL 基準上進行評估，結果顯示這種簡單的預訓練特徵學習方法優於大多數領先的 FSL 方法。此外，我們的模型可以作為預訓練模型整合到其他 FSL 方法中，並幫助它們獲得顯著的效能提升。", "author": "Guowei Yin et.al.", "authors": "Guowei Yin, Sheng Huang, Luwen Huangfu, Yi Zhang, Xiaohong Zhang", "id": "2501.13418v1", "paper_url": "http://arxiv.org/abs/2501.13418v1", "repo": "null"}}