{"2405.05678": {"publish_time": "2024-05-09", "title": "Beyond Prompts: Learning from Human Communication for Enhanced AI Intent Alignment", "paper_summary": "AI intent alignment, ensuring that AI produces outcomes as intended by users,\nis a critical challenge in human-AI interaction. The emergence of generative\nAI, including LLMs, has intensified the significance of this problem, as\ninteractions increasingly involve users specifying desired results for AI\nsystems. In order to support better AI intent alignment, we aim to explore\nhuman strategies for intent specification in human-human communication. By\nstudying and comparing human-human and human-LLM communication, we identify key\nstrategies that can be applied to the design of AI systems that are more\neffective at understanding and aligning with user intent. This study aims to\nadvance toward a human-centered AI system by bringing together human\ncommunication strategies for the design of AI systems.", "paper_summary_zh": "人工智能意圖對齊，確保人工智能產生符合使用者意圖的結果，\n是人機互動中的關鍵挑戰。生成式人工智能的出現，包括 LLM，加劇了這個問題的重要性，因為互動越來越涉及使用者為人工智能系統指定所需的結果。為了支援更好的 AI 意圖對齊，我們旨在探討人類在人際溝通中意圖規範的策略。透過研究和比較人際溝通和人機溝通，我們找出可以應用於設計 AI 系統的關鍵策略，這些系統更能理解和符合使用者的意圖。本研究旨在透過結合人類溝通策略來設計 AI 系統，朝著以人為中心的 AI 系統邁進。", "author": "Yoonsu Kim et.al.", "authors": "Yoonsu Kim, Kihoon Son, Seoyoung Kim, Juho Kim", "id": "2405.05678v1", "paper_url": "http://arxiv.org/abs/2405.05678v1", "repo": "null"}}