{"2410.07168": {"publish_time": "2024-10-09", "title": "Sylber: Syllabic Embedding Representation of Speech from Raw Audio", "paper_summary": "Syllables are compositional units of spoken language that play a crucial role\nin human speech perception and production. However, current neural speech\nrepresentations lack structure, resulting in dense token sequences that are\ncostly to process. To bridge this gap, we propose a new model, Sylber, that\nproduces speech representations with clean and robust syllabic structure.\nSpecifically, we propose a self-supervised model that regresses features on\nsyllabic segments distilled from a teacher model which is an exponential moving\naverage of the model in training. This results in a highly structured\nrepresentation of speech features, offering three key benefits: 1) a fast,\nlinear-time syllable segmentation algorithm, 2) efficient syllabic tokenization\nwith an average of 4.27 tokens per second, and 3) syllabic units better suited\nfor lexical and syntactic understanding. We also train token-to-speech\ngenerative models with our syllabic units and show that fully intelligible\nspeech can be reconstructed from these tokens. Lastly, we observe that\ncategorical perception, a linguistic phenomenon of speech perception, emerges\nnaturally in our model, making the embedding space more categorical and sparse\nthan previous self-supervised learning approaches. Together, we present a novel\nself-supervised approach for representing speech as syllables, with significant\npotential for efficient speech tokenization and spoken language modeling.", "paper_summary_zh": "音节是口语的组成单位，在人类言语感知和产生中扮演着至关重要的角色。然而，当前的神经语言表征缺乏结构，导致密集的标记序列难以处理。为了弥合这一差距，我们提出了一个新模型 Sylber，它可以生成具有清晰且稳健音节结构的语言表征。具体来说，我们提出了一种自监督模型，它对从教师模型中提取的音节片段进行特征回归，该教师模型是对训练中模型的指数移动平均。这产生了语言特征的高度结构化表征，提供了三个主要好处：1）快速、线性时间的音节分割算法，2）高效的音节标记化，平均每秒 4.27 个标记，以及 3）更适合词法和句法理解的音节单位。我们还使用我们的音节单位训练了标记到语音的生成模型，并表明可以从这些标记重建完全可理解的语音。最后，我们观察到，作为语音感知的语言现象的范畴知觉，自然而然地出现在我们的模型中，这使得嵌入空间比以前的自监督学习方法更具范畴性和稀疏性。总之，我们提出了一种新颖的自监督方法来表示音节形式的语音，它在高效语音标记化和口语建模方面具有显著的潜力。", "author": "Cheol Jun Cho et.al.", "authors": "Cheol Jun Cho, Nicholas Lee, Akshat Gupta, Dhruv Agarwal, Ethan Chen, Alan W Black, Gopala K. Anumanchipalli", "id": "2410.07168v1", "paper_url": "http://arxiv.org/abs/2410.07168v1", "repo": "null"}}