{"2411.05227": {"publish_time": "2024-11-07", "title": "CHATTER: A Character Attribution Dataset for Narrative Understanding", "paper_summary": "Computational narrative understanding studies the identification,\ndescription, and interaction of the elements of a narrative: characters,\nattributes, events, and relations. Narrative research has given considerable\nattention to defining and classifying character types. However, these\ncharacter-type taxonomies do not generalize well because they are small, too\nsimple, or specific to a domain. We require robust and reliable benchmarks to\ntest whether narrative models truly understand the nuances of the character's\ndevelopment in the story. Our work addresses this by curating the Chatter\ndataset that labels whether a character portrays some attribute for 88148\ncharacter-attribute pairs, encompassing 2998 characters, 13324 attributes and\n660 movies. We validate a subset of Chatter, called ChatterEval, using human\nannotations to serve as an evaluation benchmark for the character attribution\ntask in movie scripts. ChatterEval assesses narrative understanding and the\nlong-context modeling capacity of language models.", "paper_summary_zh": "計算敘事理解研究探討敘事的元素識別、描述和互動：角色、屬性、事件和關係。敘事研究非常重視角色類型的定義和分類。然而，這些角色類型分類法無法很好地概括，因為它們規模小、過於簡單或特定於某個領域。我們需要穩健且可靠的基準來測試敘事模型是否真正理解故事中角色發展的細微差別。我們的研究通過整理 Chatter 資料集來解決這個問題，該資料集標記角色是否為 88148 個角色屬性對中的某個屬性，涵蓋 2998 個角色、13324 個屬性和 660 部電影。我們使用人類註釋驗證了 Chatter 的一個子集，稱為 ChatterEval，作為電影腳本中角色歸因任務的評估基準。ChatterEval 評估敘事理解和語言模型的長上下文建模能力。", "author": "Sabyasachee Baruah et.al.", "authors": "Sabyasachee Baruah, Shrikanth Narayanan", "id": "2411.05227v1", "paper_url": "http://arxiv.org/abs/2411.05227v1", "repo": "null"}}