{"2406.10181": {"publish_time": "2024-06-14", "title": "Practical offloading for fine-tuning LLM on commodity GPU via learned subspace projectors", "paper_summary": "Fine-tuning large language models (LLMs) requires significant memory, often\nexceeding the capacity of a single GPU. A common solution to this memory\nchallenge is offloading compute and data from the GPU to the CPU. However, this\napproach is hampered by the limited bandwidth of commodity hardware, which\nconstrains communication between the CPU and GPU.\n  In this paper, we present an offloading framework, LSP_Offload, that enables\nnear-native speed LLM fine-tuning on commodity hardware through learned\nsubspace projectors. Our data-driven approach involves learning an efficient\nsparse compressor that minimizes communication with minimal precision loss.\nAdditionally, we introduce a novel layer-wise communication schedule to\nmaximize parallelism between communication and computation. As a result, our\nframework can fine-tune a 1.3 billion parameter model on a 4GB laptop GPU and a\n7 billion parameter model on an NVIDIA RTX 4090 GPU with 24GB memory, achieving\nonly a 31% slowdown compared to fine-tuning with unlimited memory. Compared to\nstate-of-the-art offloading frameworks, our approach increases fine-tuning\nthroughput by up to 3.33 times and reduces end-to-end fine-tuning time by\n33.1%~62.5% when converging to the same accuracy.", "paper_summary_zh": "微調大型語言模型 (LLM) 需要大量的記憶體，通常會超過單一 GPU 的容量。解決此記憶體挑戰的常見方法是將運算和資料從 GPU 卸載到 CPU。然而，此方法受到商品硬體有限頻寬的阻礙，這會限制 CPU 和 GPU 之間的通訊。\n  在這篇論文中，我們提出一個卸載框架 LSP_Offload，它能透過學習的子空間投影器，在商品硬體上以接近原生速度微調 LLM。我們的資料驅動方法涉及學習一個有效的稀疏壓縮器，它能以最小的精度損失最小化通訊。此外，我們引入一個新穎的分層通訊排程，以最大化通訊和運算之間的平行性。因此，我們的框架可以在 4GB 筆電 GPU 上微調 13 億個參數的模型，並在具有 24GB 記憶體的 NVIDIA RTX 4090 GPU 上微調 70 億個參數的模型，與在不受限記憶體的情況下進行微調相比，只會減慢 31%。與最先進的卸載框架相比，我們的做法將微調處理量提高了 3.33 倍，並在收斂到相同準確度時將端到端微調時間減少了 33.1%~62.5%。", "author": "Siyuan Chen et.al.", "authors": "Siyuan Chen, Zelong Guan, Yudong Liu, Phillip B. Gibbons", "id": "2406.10181v1", "paper_url": "http://arxiv.org/abs/2406.10181v1", "repo": "null"}}