{"2406.07310": {"publish_time": "2024-06-11", "title": "MM-KWS: Multi-modal Prompts for Multilingual User-defined Keyword Spotting", "paper_summary": "In this paper, we propose MM-KWS, a novel approach to user-defined keyword\nspotting leveraging multi-modal enrollments of text and speech templates.\nUnlike previous methods that focus solely on either text or speech features,\nMM-KWS extracts phoneme, text, and speech embeddings from both modalities.\nThese embeddings are then compared with the query speech embedding to detect\nthe target keywords. To ensure the applicability of MM-KWS across diverse\nlanguages, we utilize a feature extractor incorporating several multilingual\npre-trained models. Subsequently, we validate its effectiveness on Mandarin and\nEnglish tasks. In addition, we have integrated advanced data augmentation tools\nfor hard case mining to enhance MM-KWS in distinguishing confusable words.\nExperimental results on the LibriPhrase and WenetPhrase datasets demonstrate\nthat MM-KWS outperforms prior methods significantly.", "paper_summary_zh": "在本文中，我們提出了 MM-KWS，一種利用文字和語音範本的多模態註冊來進行使用者定義關鍵字偵測的新穎方法。與以往僅專注於文字或語音特徵的方法不同，MM-KWS 從兩種模式中提取音素、文字和語音嵌入。然後將這些嵌入與查詢語音嵌入進行比較，以偵測目標關鍵字。為了確保 MM-KWS 適用於各種語言，我們利用了一個結合多個多語言預訓練模型的特徵萃取器。隨後，我們驗證了它在普通話和英語任務上的有效性。此外，我們整合了先進的資料擴充工具，用於困難案例挖掘，以增強 MM-KWS 在區分混淆字詞上的能力。在 LibriPhrase 和 WenetPhrase 資料集上的實驗結果表明，MM-KWS 明顯優於先前的各種方法。", "author": "Zhiqi Ai et.al.", "authors": "Zhiqi Ai, Zhiyong Chen, Shugong Xu", "id": "2406.07310v1", "paper_url": "http://arxiv.org/abs/2406.07310v1", "repo": "null"}}