{"2410.01334": {"publish_time": "2024-10-02", "title": "Unveiling Language Skills under Circuits", "paper_summary": "The exploration of language skills in language models (LMs) has always been\none of the central goals in mechanistic interpretability. However, existing\ncircuit analyses often fall short in representing the full functional scope of\nthese models, primarily due to the exclusion of Feed-Forward layers.\nAdditionally, isolating the effect of a single language skill from a text,\nwhich inherently involves multiple entangled skills, poses a significant\nchallenge. To address these gaps, we introduce a novel concept, Memory Circuit,\na minimum unit that fully and independently manipulates the memory-reading\nfunctionality of a language model, and disentangle the transformer model\nprecisely into a circuit graph which is an ensemble of paths connecting\ndifferent memory circuits. Based on this disentanglement, we identify salient\ncircuit paths, named as skill paths, responsible for three crucial language\nskills, i.e., the Previous Token Skill, Induction Skill and In-Context Learning\n(ICL) Skill, leveraging causal effect estimation through interventions and\ncounterfactuals. Our experiments on various datasets confirm the correspondence\nbetween our identified skill paths and language skills, and validate three\nlongstanding hypotheses: 1) Language skills are identifiable through circuit\ndissection; 2) Simple language skills reside in shallow layers, whereas complex\nlanguage skills are found in deeper layers; 3) Complex language skills are\nformed on top of simpler language skills. Our codes are available at:\nhttps://github.com/Zodiark-ch/Language-Skill-of-LLMs.", "paper_summary_zh": "<paragraph>在語言模型 (LM) 中探索語言技能一直是機械可解釋性的核心目標之一。然而，現有的電路分析往往無法表示這些模型的全部功能範圍，主要是由於排除了前饋層。此外，從文本中分離出單一語言技能的影響（這本質上涉及多種糾纏的技能）構成了一項重大挑戰。為了解決這些差距，我們引入了 Memory Circuit，這是一個新穎的概念，它是一個最小單元，可以完整且獨立地操作語言模型的記憶體讀取功能，並將 Transformer 模型精確地解開成一個電路圖，它是一個連接不同記憶體電路的路徑集合。基於這種解開，我們識別出顯著的電路路徑，稱為技能路徑，它負責三項關鍵的語言技能，即前一個符號技能、歸納技能和語境學習 (ICL) 技能，利用因果效應估計通過干預和反事實。我們在各種資料集上的實驗證實了我們識別出的技能路徑與語言技能之間的對應關係，並驗證了三個長期的假設：1) 語言技能可以透過電路解剖來識別；2) 簡單的語言技能存在於淺層中，而複雜的語言技能則存在於深層中；3) 複雜的語言技能建立在更簡單的語言技能之上。我們的程式碼可在 https://github.com/Zodiark-ch/Language-Skill-of-LLMs 取得。</paragraph>", "author": "Hang Chen et.al.", "authors": "Hang Chen, Jiaying Zhu, Xinyu Yang, Wenya Wang", "id": "2410.01334v1", "paper_url": "http://arxiv.org/abs/2410.01334v1", "repo": "null"}}