{"2501.05707": {"publish_time": "2025-01-10", "title": "Multiagent Finetuning: Self Improvement with Diverse Reasoning Chains", "paper_summary": "Large language models (LLMs) have achieved remarkable performance in recent\nyears but are fundamentally limited by the underlying training data. To improve\nmodels beyond the training data, recent works have explored how LLMs can be\nused to generate synthetic data for autonomous self-improvement. However,\nsuccessive steps of self-improvement can reach a point of diminishing returns.\nIn this work, we propose a complementary approach towards self-improvement\nwhere finetuning is applied to a multiagent society of language models. A group\nof language models, all starting from the same base model, are independently\nspecialized by updating each one using data generated through multiagent\ninteractions among the models. By training each model on independent sets of\ndata, we illustrate how this approach enables specialization across models and\ndiversification over the set of models. As a result, our overall system is able\nto preserve diverse reasoning chains and autonomously improve over many more\nrounds of fine-tuning than single-agent self-improvement methods. We\nquantitatively illustrate the efficacy of the approach across a wide suite of\nreasoning tasks.", "paper_summary_zh": "大型語言模型 (LLM) 近年來取得了顯著的表現，但其根本上受到基礎訓練資料的限制。為了改進訓練資料之外的模型，最近的研究探討了 LLM 如何用於生成合成資料以進行自主自我改善。然而，連續的自我改善步驟可能會達到報酬遞減的程度。在這項工作中，我們提出了一個互補的自改善方法，其中微調應用於語言模型的多主體社會。一群語言模型，全部從同一個基礎模型開始，透過使用模型之間的多主體互動所產生的資料來更新每個模型，獨立地進行專門化。透過訓練每個模型使用獨立的資料集，我們說明了這種方法如何讓模型之間能夠進行專門化，以及模型集合的多樣化。因此，我們的整體系統能夠保留不同的推理鏈，並在比單一主體自我改善方法更多的微調回合中自主改善。我們透過廣泛的推理任務量化說明了這種方法的效能。", "author": "Vighnesh Subramaniam et.al.", "authors": "Vighnesh Subramaniam, Yilun Du, Joshua B. Tenenbaum, Antonio Torralba, Shuang Li, Igor Mordatch", "id": "2501.05707v1", "paper_url": "http://arxiv.org/abs/2501.05707v1", "repo": "null"}}