{"2411.01834": {"publish_time": "2024-11-04", "title": "Align-SLM: Textless Spoken Language Models with Reinforcement Learning from AI Feedback", "paper_summary": "While textless Spoken Language Models (SLMs) have shown potential in\nend-to-end speech-to-speech modeling, they still lag behind text-based Large\nLanguage Models (LLMs) in terms of semantic coherence and relevance. This work\nintroduces the Align-SLM framework, which leverages preference optimization\ninspired by Reinforcement Learning with AI Feedback (RLAIF) to enhance the\nsemantic understanding of SLMs. Our approach generates multiple speech\ncontinuations from a given prompt and uses semantic metrics to create\npreference data for Direct Preference Optimization (DPO). We evaluate the\nframework using ZeroSpeech 2021 benchmarks for lexical and syntactic modeling,\nthe spoken version of the StoryCloze dataset for semantic coherence, and other\nspeech generation metrics, including the GPT4-o score and human evaluation.\nExperimental results show that our method achieves state-of-the-art performance\nfor SLMs on most benchmarks, highlighting the importance of preference\noptimization to improve the semantics of SLMs.", "paper_summary_zh": "儘管無文字的口說語言模型 (SLM) 已在端對端口語轉換模型中展現潛力，它們在語意連貫性和相關性方面仍落後於基於文字的大型語言模型 (LLM)。本研究引入了 Align-SLM 架構，它利用了受強化學習和 AI 回饋 (RLAIF) 啟發的偏好最佳化，以增強 SLM 的語意理解。我們的做法會從給定的提示產生多個語音延續，並使用語意指標為直接偏好最佳化 (DPO) 建立偏好資料。我們使用 ZeroSpeech 2021 基準對架構進行評估，用於詞彙和句法建模，StoryCloze 資料集的口語版本用於語意連貫性，以及其他語音產生指標，包括 GPT4-o 分數和人類評估。實驗結果顯示，我們的做法在多數基準上達到了 SLM 的最新效能，突顯了偏好最佳化對於改善 SLM 語意的重要性。", "author": "Guan-Ting Lin et.al.", "authors": "Guan-Ting Lin, Prashanth Gurunath Shivakumar, Aditya Gourav, Yile Gu, Ankur Gandhe, Hung-yi Lee, Ivan Bulyko", "id": "2411.01834v1", "paper_url": "http://arxiv.org/abs/2411.01834v1", "repo": "null"}}