{"2409.06343": {"publish_time": "2024-09-10", "title": "Compute-Update Federated Learning: A Lattice Coding Approach", "paper_summary": "This paper introduces a federated learning framework that enables\nover-the-air computation via digital communications, using a new joint\nsource-channel coding scheme. Without relying on channel state information at\ndevices, this scheme employs lattice codes to both quantize model parameters\nand exploit interference from the devices. We propose a novel receiver\nstructure at the server, designed to reliably decode an integer combination of\nthe quantized model parameters as a lattice point for the purpose of\naggregation. We present a mathematical approach to derive a convergence bound\nfor the proposed scheme and offer design remarks. In this context, we suggest\nan aggregation metric and a corresponding algorithm to determine effective\ninteger coefficients for the aggregation in each communication round. Our\nresults illustrate that, regardless of channel dynamics and data heterogeneity,\nour scheme consistently delivers superior learning accuracy across various\nparameters and markedly surpasses other over-the-air methodologies.", "paper_summary_zh": "本文提出了一個聯合學習架構，它使用一個新的聯合源通道編碼方案，通過數位通訊進行空中運算。在不依賴於設備上的通道狀態資訊的情況下，此方案採用格碼來量化模型參數並利用來自設備的干擾。我們在伺服器上提出了一個新穎的接收器結構，旨在可靠地將量化模型參數的整數組合解碼為格點，以進行聚合。我們提出了一種數學方法來推導所提出方案的收斂界限，並提供設計說明。在這種情況下，我們建議使用聚合指標和對應演算法來確定每一輪通訊中聚合的有效整數係數。我們的結果表明，無論通道動態和資料異質性如何，我們的方案都能在各種參數中持續提供優異的學習準確度，並顯著超越其他空中方法。", "author": "Seyed Mohammad Azimi-Abarghouyi et.al.", "authors": "Seyed Mohammad Azimi-Abarghouyi, Lav R. Varshney", "id": "2409.06343v1", "paper_url": "http://arxiv.org/abs/2409.06343v1", "repo": "null"}}