{"2410.02693": {"publish_time": "2024-10-03", "title": "Discovering Clues of Spoofed LM Watermarks", "paper_summary": "LLM watermarks stand out as a promising way to attribute ownership of\nLLM-generated text. One threat to watermark credibility comes from spoofing\nattacks, where an unauthorized third party forges the watermark, enabling it to\nfalsely attribute arbitrary texts to a particular LLM. While recent works have\ndemonstrated that state-of-the-art schemes are in fact vulnerable to spoofing,\nthey lack deeper qualitative analysis of the texts produced by spoofing\nmethods. In this work, we for the first time reveal that there are observable\ndifferences between genuine and spoofed watermark texts. Namely, we show that\nregardless of their underlying approach, all current spoofing methods\nconsistently leave observable artifacts in spoofed texts, indicative of\nwatermark forgery. We build upon these findings to propose rigorous statistical\ntests that reliably reveal the presence of such artifacts, effectively\ndiscovering that a watermark was spoofed. Our experimental evaluation shows\nhigh test power across all current spoofing methods, providing insights into\ntheir fundamental limitations, and suggesting a way to mitigate this threat.", "paper_summary_zh": "LLM 水印作為一種有前景的方式，用於標示 LLM 生成的文字所有權。水印的可信度會受到欺騙攻擊的威脅，未經授權的第三方會偽造水印，使其能將任意文字虛假標示為特定 LLM 所生成。儘管最近的研究顯示，最先進的方案實際上容易受到欺騙，但它們缺乏對欺騙方法所產生文字的更深入定性分析。在這項研究中，我們首次揭露真實水印文字和欺騙水印文字之間存在可觀察的差異。具體來說，我們表明，無論其基本方法為何，所有當前的欺騙方法都會一貫地在欺騙文字中留下可觀察的人工製品，表明水印是偽造的。我們根據這些發現提出嚴謹的統計檢定，可靠地揭露此類人工製品的存在，有效地發現水印是否遭到欺騙。我們的實驗評估顯示，在所有當前欺騙方法中，檢定力都非常高，洞察其基本限制，並提出減輕此威脅的方法。", "author": "Thibaud Gloaguen et.al.", "authors": "Thibaud Gloaguen, Nikola Jovanović, Robin Staab, Martin Vechev", "id": "2410.02693v1", "paper_url": "http://arxiv.org/abs/2410.02693v1", "repo": "null"}}