{"2406.15130": {"publish_time": "2024-06-21", "title": "Assessing Good, Bad and Ugly Arguments Generated by ChatGPT: a New Dataset, its Methodology and Associated Tasks", "paper_summary": "The recent success of Large Language Models (LLMs) has sparked concerns about\ntheir potential to spread misinformation. As a result, there is a pressing need\nfor tools to identify ``fake arguments'' generated by such models. To create\nthese tools, examples of texts generated by LLMs are needed. This paper\nintroduces a methodology to obtain good, bad and ugly arguments from\nargumentative essays produced by ChatGPT, OpenAI's LLM. We then describe a\nnovel dataset containing a set of diverse arguments, ArGPT. We assess the\neffectiveness of our dataset and establish baselines for several\nargumentation-related tasks. Finally, we show that the artificially generated\ndata relates well to human argumentation and thus is useful as a tool to train\nand test systems for the defined tasks.", "paper_summary_zh": "大型語言模型 (LLM) 近期的成功引起人們對其散布錯誤訊息潛力的擔憂。因此，迫切需要有工具來識別此類模型產生的「虛假論證」。要建立這些工具，需要有 LLM 生成的文本範例。本文介紹一種方法，從 ChatGPT（OpenAI 的 LLM）產生的論證性文章中取得好、壞和醜陋的論證。然後，我們描述一個包含一組多元論證的新穎資料集 ArGPT。我們評估我們資料集的有效性，並為幾個與論證相關的任務建立基準。最後，我們表明人工產生的資料與人類論證有很好的關聯性，因此可用作訓練和測試定義任務系統的工具。", "author": "Victor Hugo Nascimento Rocha et.al.", "authors": "Victor Hugo Nascimento Rocha, Igor Cataneo Silveira, Paulo Pirozelli, Denis Deratani Mauá, Fabio Gagliardi Cozman", "id": "2406.15130v1", "paper_url": "http://arxiv.org/abs/2406.15130v1", "repo": "https://github.com/c4ai/argpt"}}