{"2408.02970": {"publish_time": "2024-08-06", "title": "EC-Guide: A Comprehensive E-Commerce Guide for Instruction Tuning and Quantization", "paper_summary": "Large language models (LLMs) have attracted considerable attention in various\nfields for their cost-effective solutions to diverse challenges, especially\nwith advancements in instruction tuning and quantization. E-commerce, with its\ncomplex tasks and extensive product-user interactions, presents a promising\napplication area for LLMs. However, the domain-specific concepts and knowledge\ninherent in e-commerce pose significant challenges for adapting general LLMs.\nTo address this issue, we developed EC-Guide\n\\href{https://github.com/fzp0424/EC-Guide-KDDUP-2024}, a comprehensive\ne-commerce guide for instruction tuning and quantization of LLMs. We also\nheuristically integrated Chain-of-Thought (CoT) during inference to enhance\narithmetic performance. Our approach achieved the 2nd place in Track 2 and 5th\nplace in Track 5 at the Amazon KDD Cup'24\n\\href{https://www.aicrowd.com/challenges/amazon-kdd-cup-2024-multi-task-online-shopping-challenge-for-llms}.\nAdditionally, our solution is model-agnostic, enabling effective scalability\nacross larger systems.", "paper_summary_zh": "大型語言模型 (LLM) 因其在各種領域中以具成本效益的方式解決各種挑戰而備受關注，特別是在指令調整和量化方面取得進展。電子商務及其複雜的任務和廣泛的產品使用者互動，為 LLM 呈現了一個大有可為的應用領域。然而，電子商務中固有的特定領域概念和知識，對一般 LLM 的適應提出了重大挑戰。為了解決這個問題，我們開發了 EC-Guide \\href{https://github.com/fzp0424/EC-Guide-KDDUP-2024}，這是一個針對 LLM 指令調整和量化的全面電子商務指南。我們還在推理期間啟發式地整合了思考鏈 (CoT)，以增強算術效能。我們的做法在 Amazon KDD Cup'24 的軌道 2 中獲得第 2 名，在軌道 5 中獲得第 5 名 \\href{https://www.aicrowd.com/challenges/amazon-kdd-cup-2024-multi-task-online-shopping-challenge-for-llms}。此外，我們的解決方案與模型無關，可以在更大的系統中有效擴展。", "author": "Zhaopeng Feng et.al.", "authors": "Zhaopeng Feng, Zijie Meng, Zuozhu Liu", "id": "2408.02970v1", "paper_url": "http://arxiv.org/abs/2408.02970v1", "repo": "null"}}