{"2503.14234": {"publish_time": "2025-03-18", "title": "KG-IRAG: A Knowledge Graph-Based Iterative Retrieval-Augmented Generation Framework for Temporal Reasoning", "paper_summary": "Graph Retrieval-Augmented Generation (GraphRAG) has proven highly effective\nin enhancing the performance of Large Language Models (LLMs) on tasks that\nrequire external knowledge. By leveraging Knowledge Graphs (KGs), GraphRAG\nimproves information retrieval for complex reasoning tasks, providing more\nprecise and comprehensive retrieval and generating more accurate responses to\nQAs. However, most RAG methods fall short in addressing multi-step reasoning,\nparticularly when both information extraction and inference are necessary. To\naddress this limitation, this paper presents Knowledge Graph-Based Iterative\nRetrieval-Augmented Generation (KG-IRAG), a novel framework that integrates KGs\nwith iterative reasoning to improve LLMs' ability to handle queries involving\ntemporal and logical dependencies. Through iterative retrieval steps, KG-IRAG\nincrementally gathers relevant data from external KGs, enabling step-by-step\nreasoning. The proposed approach is particularly suited for scenarios where\nreasoning is required alongside dynamic temporal data extraction, such as\ndetermining optimal travel times based on weather conditions or traffic\npatterns. Experimental results show that KG-IRAG improves accuracy in complex\nreasoning tasks by effectively integrating external knowledge with iterative,\nlogic-based retrieval. Additionally, three new datasets: weatherQA-Irish,\nweatherQA-Sydney, and trafficQA-TFNSW, are formed to evaluate KG-IRAG's\nperformance, demonstrating its potential beyond traditional RAG applications.", "paper_summary_zh": "<paragraph>圖形檢索增強生成 (GraphRAG) 已被證明在增強大型語言模型 (LLM) 處理需要外部知識的任務上的效能非常有效。透過利用知識圖譜 (KG)，GraphRAG 改進了複雜推理任務的資訊檢索，提供更精確、更全面的檢索，並生成更準確的問答回覆。然而，大多數 RAG 方法都無法解決多步驟推理問題，尤其是在需要資訊提取和推論的情況下。為了克服這個限制，本文提出了一種基於知識圖譜的迭代檢索增強生成 (KG-IRAG) 的新穎框架，它將知識圖譜與迭代推理相結合，以提高 LLM 處理涉及時間和邏輯依賴關係的查詢的能力。透過迭代檢索步驟，KG-IRAG 從外部知識圖譜中逐步收集相關數據，實現逐步推理。所提出的方法特別適用於需要推理以及動態時間數據提取的場景，例如根據天氣狀況或交通模式確定最佳旅行時間。實驗結果表明，KG-IRAG 透過將外部知識與基於邏輯的迭代檢索有效結合，提高了複雜推理任務的準確性。此外，還建立了三個新的數據集：weatherQA-Irish、weatherQA-Sydney 和 trafficQA-TFNSW，用於評估 KG-IRAG 的效能，展示其超越傳統 RAG 應用程式的潛力。</paragraph>\n", "author": "Ruiyi Yang et.al.", "authors": "Ruiyi Yang, Hao Xue, Imran Razzak, Hakim Hacid, Flora D. Salim", "id": "2503.14234v2", "paper_url": "http://arxiv.org/abs/2503.14234v2", "repo": "null"}}