{"2407.16485": {"publish_time": "2024-07-23", "title": "Learning General Continuous Constraint from Demonstrations via Positive-Unlabeled Learning", "paper_summary": "Planning for a wide range of real-world tasks necessitates to know and write\nall constraints. However, instances exist where these constraints are either\nunknown or challenging to specify accurately. A possible solution is to infer\nthe unknown constraints from expert demonstration. The majority of prior works\nlimit themselves to learning simple linear constraints, or require strong\nknowledge of the true constraint parameterization or environmental model. To\nmitigate these problems, this paper presents a positive-unlabeled (PU) learning\napproach to infer a continuous, arbitrary and possibly nonlinear, constraint\nfrom demonstration. From a PU learning view, We treat all data in\ndemonstrations as positive (feasible) data, and learn a (sub)-optimal policy to\ngenerate high-reward-winning but potentially infeasible trajectories, which\nserve as unlabeled data containing both feasible and infeasible states. Under\nan assumption on data distribution, a feasible-infeasible classifier (i.e.,\nconstraint model) is learned from the two datasets through a postprocessing PU\nlearning technique. The entire method employs an iterative framework\nalternating between updating the policy, which generates and selects\nhigher-reward policies, and updating the constraint model. Additionally, a\nmemory buffer is introduced to record and reuse samples from previous\niterations to prevent forgetting. The effectiveness of the proposed method is\nvalidated in two Mujoco environments, successfully inferring continuous\nnonlinear constraints and outperforming a baseline method in terms of\nconstraint accuracy and policy safety.", "paper_summary_zh": "<paragraph>要規劃廣泛的真實世界任務，必須知道並寫下所有限制條件。然而，存在這些限制條件未知或難以精確指定的實例。一個可能的解決方案是從專家示範中推斷未知的限制條件。大多數先前的工作僅限於學習簡單的線性限制條件，或需要對真正的限制條件參數化或環境模型有深入的了解。為了緩解這些問題，本文提出了一種正未標記 (PU) 學習方法，以從示範中推斷出連續、任意且可能是非線性的限制條件。從 PU 學習的角度來看，我們將示範中的所有數據視為正 (可行) 數據，並學習一個 (次) 最佳策略來產生高獎勵獲勝但潛在不可行的軌跡，這些軌跡作為包含可行和不可行狀態的未標記數據。在數據分佈的假設下，通過後處理 PU 學習技術從兩個數據集中學習可行不可行分類器 (即約束模型)。整個方法採用了一種迭代框架，在更新策略（生成和選擇更高獎勵策略）和更新約束模型之間交替進行。此外，引入了記憶體緩衝區來記錄和重複使用前一次迭代的樣本，以防止遺忘。所提出的方法的有效性在兩個 Mujoco 環境中得到驗證，成功推斷出連續的非線性約束，並在約束準確性和策略安全性方面優於基線方法。</paragraph>", "author": "Baiyu Peng et.al.", "authors": "Baiyu Peng, Aude Billard", "id": "2407.16485v1", "paper_url": "http://arxiv.org/abs/2407.16485v1", "repo": "null"}}