{"2411.13152": {"publish_time": "2024-11-20", "title": "AGLP: A Graph Learning Perspective for Semi-supervised Domain Adaptation", "paper_summary": "In semi-supervised domain adaptation (SSDA), the model aims to leverage\npartially labeled target domain data along with a large amount of labeled\nsource domain data to enhance its generalization capability for the target\ndomain. A key advantage of SSDA is its ability to significantly reduce reliance\non labeled data, thereby lowering the costs and time associated with data\npreparation. Most existing SSDA methods utilize information from domain labels\nand class labels but overlook the structural information of the data. To\naddress this issue, this paper proposes a graph learning perspective (AGLP) for\nsemi-supervised domain adaptation. We apply the graph convolutional network to\nthe instance graph which allows structural information to propagate along the\nweighted graph edges. The proposed AGLP model has several advantages. First, to\nthe best of our knowledge, this is the first work to model structural\ninformation in SSDA. Second, the proposed model can effectively learn\ndomain-invariant and semantic representations, reducing domain discrepancies in\nSSDA. Extensive experimental results on multiple standard benchmarks\ndemonstrate that the proposed AGLP algorithm outperforms state-of-the-art\nsemi-supervised domain adaptation methods.", "paper_summary_zh": "在半监督域适应 (SSDA) 中，该模型旨在利用部分标记的目标域数据以及大量的标记源域数据来增强其对目标域的泛化能力。SSDA 的一个关键优势在于它能够显著减少对标记数据的依赖，从而降低与数据准备相关联的成本和时间。大多数现有的 SSDA 方法利用来自域标签和类标签的信息，但忽略了数据的结构信息。为了解决这个问题，本文提出了一个用于半监督域适应的图学习视角 (AGLP)。我们将图卷积网络应用于实例图，该图允许结构信息沿着加权图边传播。提出的 AGLP 模型有几个优点。首先，据我们所知，这是第一个在 SSDA 中对结构信息进行建模的工作。其次，所提出的模型可以有效地学习域不变和语义表示，从而减少 SSDA 中的域差异。在多个标准基准上的广泛实验结果表明，所提出的 AGLP 算法优于最先进的半监督域适应方法。", "author": "Houcheng Su et.al.", "authors": "Houcheng Su, Mengzhu Wang, Jiao Li, Nan Yin, Li Shen", "id": "2411.13152v1", "paper_url": "http://arxiv.org/abs/2411.13152v1", "repo": "null"}}