{"2406.10209": {"publish_time": "2024-06-14", "title": "Be like a Goldfish, Don't Memorize! Mitigating Memorization in Generative LLMs", "paper_summary": "Large language models can memorize and repeat their training data, causing\nprivacy and copyright risks. To mitigate memorization, we introduce a subtle\nmodification to the next-token training objective that we call the goldfish\nloss. During training, a randomly sampled subset of tokens are excluded from\nthe loss computation. These dropped tokens are not memorized by the model,\nwhich prevents verbatim reproduction of a complete chain of tokens from the\ntraining set. We run extensive experiments training billion-scale Llama-2\nmodels, both pre-trained and trained from scratch, and demonstrate significant\nreductions in extractable memorization with little to no impact on downstream\nbenchmarks.", "paper_summary_zh": "大型語言模型可以記憶和重複它們的訓練資料，導致隱私和版權風險。為了減輕記憶，我們對下一個代幣訓練目標進行了微妙的修改，我們稱之為金魚損失。在訓練期間，隨機抽取的代幣子集會從損失計算中排除。這些被刪除的代幣不會被模型記憶，這會防止從訓練集中逐字複製完整的代幣鏈。我們運行廣泛的實驗訓練十億規模的 Llama-2 模型，包括預訓練和從頭開始訓練，並證明可提取的記憶力顯著減少，對下游基準幾乎沒有影響。", "author": "Abhimanyu Hans et.al.", "authors": "Abhimanyu Hans, Yuxin Wen, Neel Jain, John Kirchenbauer, Hamid Kazemi, Prajwal Singhania, Siddharth Singh, Gowthami Somepalli, Jonas Geiping, Abhinav Bhatele, Tom Goldstein", "id": "2406.10209v1", "paper_url": "http://arxiv.org/abs/2406.10209v1", "repo": "https://github.com/ahans30/goldfish-loss"}}