{"2405.04561": {"publish_time": "2024-05-07", "title": "Inferring Discussion Topics about Exploitation of Vulnerabilities from Underground Hacking Forums", "paper_summary": "The increasing sophistication of cyber threats necessitates proactive\nmeasures to identify vulnerabilities and potential exploits. Underground\nhacking forums serve as breeding grounds for the exchange of hacking techniques\nand discussions related to exploitation. In this research, we propose an\ninnovative approach using topic modeling to analyze and uncover key themes in\nvulnerabilities discussed within these forums. The objective of our study is to\ndevelop a machine learning-based model that can automatically detect and\nclassify vulnerability-related discussions in underground hacking forums. By\nmonitoring and analyzing the content of these forums, we aim to identify\nemerging vulnerabilities, exploit techniques, and potential threat actors. To\nachieve this, we collect a large-scale dataset consisting of posts and threads\nfrom multiple underground forums. We preprocess and clean the data to ensure\naccuracy and reliability. Leveraging topic modeling techniques, specifically\nLatent Dirichlet Allocation (LDA), we uncover latent topics and their\nassociated keywords within the dataset. This enables us to identify recurring\nthemes and prevalent discussions related to vulnerabilities, exploits, and\npotential targets.", "paper_summary_zh": "由於網路威脅日益複雜，因此需要採取主動措施來識別漏洞和潛在的攻擊手法。地下駭客論壇是交換駭客技術和討論與攻擊相關議題的溫床。在這項研究中，我們提出一個創新的方法，利用主題建模來分析和找出這些論壇中討論的漏洞中的關鍵主題。我們研究的目標是開發一個基於機器學習的模型，可以自動偵測和分類地下駭客論壇中與漏洞相關的討論。透過監控和分析這些論壇的內容，我們希望能找出新興的漏洞、攻擊手法和潛在的威脅者。為了達成這個目標，我們收集了一個由多個地下論壇的貼文和串組成的龐大資料集。我們預先處理並清理資料，以確保其準確性和可靠性。利用主題建模技術，特別是隱含狄利克雷配置（LDA），我們找出資料集中的潛在主題及其相關的關鍵字。這讓我們能夠找出與漏洞、攻擊手法和潛在目標相關的重複主題和盛行的討論。", "author": "Felipe Moreno-Vera et.al.", "authors": "Felipe Moreno-Vera", "id": "2405.04561v1", "paper_url": "http://arxiv.org/abs/2405.04561v1", "repo": "null"}}