{"2412.15084": {"publish_time": "2024-12-19", "title": "AceMath: Advancing Frontier Math Reasoning with Post-Training and Reward Modeling", "paper_summary": "In this paper, we introduce AceMath, a suite of frontier math models that\nexcel in solving complex math problems, along with highly effective reward\nmodels capable of evaluating generated solutions and reliably identifying the\ncorrect ones. To develop the instruction-tuned math models, we propose a\nsupervised fine-tuning (SFT) process that first achieves competitive\nperformance across general domains, followed by targeted fine-tuning for the\nmath domain using a carefully curated set of prompts and synthetically\ngenerated responses. The resulting model, AceMath-72B-Instruct greatly\noutperforms Qwen2.5-Math-72B-Instruct, GPT-4o and Claude-3.5 Sonnet. To develop\nmath-specialized reward model, we first construct AceMath-RewardBench, a\ncomprehensive and robust benchmark for evaluating math reward models across\ndiverse problems and difficulty levels. After that, we present a systematic\napproach to build our math reward models. The resulting model, AceMath-72B-RM,\nconsistently outperforms state-of-the-art reward models. Furthermore, when\ncombining AceMath-72B-Instruct with AceMath-72B-RM, we achieve the highest\naverage rm@8 score across the math reasoning benchmarks. We will release model\nweights, training data, and evaluation benchmarks at:\nhttps://research.nvidia.com/labs/adlr/acemath", "paper_summary_zh": "<paragraph>在本文中，我們介紹 AceMath，這是一套前沿數學模型，擅長解決複雜的數學問題，並具備高效的獎勵模型，能夠評估生成的解並可靠地找出正確的解。為了開發指令調整的數學模型，我們提出了一個監督微調 (SFT) 過程，首先在一般領域中實現競爭力，然後使用精心策劃的提示和合成生成的回應，針對數學領域進行目標微調。由此產生的模型 AceMath-72B-Instruct 大大優於 Qwen2.5-Math-72B-Instruct、GPT-4o 和 Claude-3.5 Sonnet。為了開發數學專業獎勵模型，我們首先構建 AceMath-RewardBench，一個全面且穩健的基準，用於評估數學獎勵模型在不同問題和難度級別上的表現。之後，我們提出了一個系統性的方法來構建我們的數學獎勵模型。由此產生的模型 AceMath-72B-RM，始終優於最先進的獎勵模型。此外，當將 AceMath-72B-Instruct 與 AceMath-72B-RM 結合使用時，我們在數學推理基準中獲得了最高的平均 rm@8 分數。我們將在以下網址發布模型權重、訓練數據和評估基準：\nhttps://research.nvidia.com/labs/adlr/acemath</paragraph>", "author": "Zihan Liu et.al.", "authors": "Zihan Liu, Yang Chen, Mohammad Shoeybi, Bryan Catanzaro, Wei Ping", "id": "2412.15084v1", "paper_url": "http://arxiv.org/abs/2412.15084v1", "repo": "null"}}