{"2405.18119": {"publish_time": "2024-05-28", "title": "Low-Resource Crop Classification from Multi-Spectral Time Series Using Lossless Compressors", "paper_summary": "Deep learning has significantly improved the accuracy of crop classification\nusing multispectral temporal data. However, these models have complex\nstructures with numerous parameters, requiring large amounts of data and costly\ntraining. In low-resource situations with fewer labeled samples, deep learning\nmodels perform poorly due to insufficient data. Conversely, compressors are\ndata-type agnostic, and non-parametric methods do not bring underlying\nassumptions. Inspired by this insight, we propose a non-training alternative to\ndeep learning models, aiming to address these situations. Specifically, the\nSymbolic Representation Module is proposed to convert the reflectivity into\nsymbolic representations. The symbolic representations are then\ncross-transformed in both the channel and time dimensions to generate symbolic\nembeddings. Next, the Multi-scale Normalised Compression Distance (MNCD) is\ndesigned to measure the correlation between any two symbolic embeddings.\nFinally, based on the MNCDs, high quality crop classification can be achieved\nusing only a k-nearest-neighbor classifier kNN. The entire framework is\nready-to-use and lightweight. Without any training, it outperformed, on\naverage, 7 advanced deep learning models trained at scale on three benchmark\ndatasets. It also outperforms more than half of these models in the few-shot\nsetting with sparse crop labels. Therefore, the high performance and robustness\nof our non-training framework makes it truly applicable to real-world crop\nmapping. Codes are available at:\nhttps://github.com/qinfengsama/Compressor-Based-Crop-Mapping.", "paper_summary_zh": "深度学习已大幅提升作物分类的准确度，使用多光谱时间数据。然而，这些模型的结构复杂，参数众多，需要大量数据和高成本的训练。在低资源情况下，带标签样本较少，深度学习模型由于数据不足而表现不佳。相反，压缩器与数据类型无关，非参数方法不会带来潜在假设。受此启发，我们提出了一种深度学习模型的非训练替代方案，旨在解决这些情况。具体来说，提出了符号表征模块，将反射率转换为符号表征。然后在通道和时间维度中交叉转换符号表征，以生成符号嵌入。接下来，设计了多尺度归一化压缩距离 (MNCD)，以测量任意两个符号嵌入之间的相关性。最后，基于 MNCD，仅使用 k 近邻分类器 kNN 即可实现高质量的作物分类。整个框架即用且轻量级。在没有经过任何训练的情况下，它平均优于三个基准数据集上大规模训练的 7 个先进深度学习模型。在稀疏作物标签的少样本设置中，它也优于一半以上的这些模型。因此，我们非训练框架的高性能和鲁棒性使其真正适用于实际作物制图。代码可在此处获得：https://github.com/qinfengsama/Compressor-Based-Crop-Mapping。", "author": "Wei Cheng et.al.", "authors": "Wei Cheng, Hongrui Ye, Xiao Wen, Jiachen Zhang, Jiping Xu, Feifan Zhang", "id": "2405.18119v1", "paper_url": "http://arxiv.org/abs/2405.18119v1", "repo": "https://github.com/qinfengsama/compressor-based-crop-mapping"}}