{"2406.15032": {"publish_time": "2024-06-21", "title": "GiusBERTo: A Legal Language Model for Personal Data De-identification in Italian Court of Auditors Decisions", "paper_summary": "Recent advances in Natural Language Processing have demonstrated the\neffectiveness of pretrained language models like BERT for a variety of\ndownstream tasks. We present GiusBERTo, the first BERT-based model specialized\nfor anonymizing personal data in Italian legal documents. GiusBERTo is trained\non a large dataset of Court of Auditors decisions to recognize entities to\nanonymize, including names, dates, locations, while retaining contextual\nrelevance. We evaluate GiusBERTo on a held-out test set and achieve 97%\ntoken-level accuracy. GiusBERTo provides the Italian legal community with an\naccurate and tailored BERT model for de-identification, balancing privacy and\ndata protection.", "paper_summary_zh": "自然語言處理的最新進展已證明，像 BERT 等預訓練語言模型對各種下游任務都很有效。我們提出 GiusBERTo，這是第一個專門用於匿名化義大利法律文件中的個人資料的 BERT-based 模型。GiusBERTo 接受過大量審計法院判決資料集的訓練，以識別要匿名的實體，包括姓名、日期、地點，同時保留上下文相關性。我們在持有的測試集上評估 GiusBERTo，並達到 97% 的代幣級準確度。GiusBERTo 為義大利法律界提供了一個準確且量身定制的 BERT 模型，用於去識別，平衡隱私和資料保護。", "author": "Giulio Salierno et.al.", "authors": "Giulio Salierno, Rosamaria Bertè, Luca Attias, Carla Morrone, Dario Pettazzoni, Daniela Battisti", "id": "2406.15032v1", "paper_url": "http://arxiv.org/abs/2406.15032v1", "repo": "null"}}