{"2405.20915": {"publish_time": "2024-05-31", "title": "Fast yet Safe: Early-Exiting with Risk Control", "paper_summary": "Scaling machine learning models significantly improves their performance.\nHowever, such gains come at the cost of inference being slow and\nresource-intensive. Early-exit neural networks (EENNs) offer a promising\nsolution: they accelerate inference by allowing intermediate layers to exit and\nproduce a prediction early. Yet a fundamental issue with EENNs is how to\ndetermine when to exit without severely degrading performance. In other words,\nwhen is it 'safe' for an EENN to go 'fast'? To address this issue, we\ninvestigate how to adapt frameworks of risk control to EENNs. Risk control\noffers a distribution-free, post-hoc solution that tunes the EENN's exiting\nmechanism so that exits only occur when the output is of sufficient quality. We\nempirically validate our insights on a range of vision and language tasks,\ndemonstrating that risk control can produce substantial computational savings,\nall the while preserving user-specified performance goals.", "paper_summary_zh": "擴展機器學習模型可以大幅提升其效能。\n然而，這種提升是以推論速度變慢和資源密集為代價。早期退出神經網路 (EENN) 提供了一個有前景的解決方案：它們允許中間層退出並提早產生預測，進而加速推論。然而，EENN 的一個基本問題是如何在不嚴重降低效能的情況下判斷何時退出。換句話說，什麼時候 EENN 可以「安全」地「快速」執行？為了解決這個問題，我們探討如何將風險控制架構調整到 EENN。風險控制提供了一個無分佈、事後解決方案，用於調整 EENN 的退出機制，以便僅在輸出品質足夠時才會退出。我們根據一系列視覺和語言任務實證驗證我們的見解，證明風險控制可以產生大量的運算節省，同時保留使用者指定的效能目標。", "author": "Metod Jazbec et.al.", "authors": "Metod Jazbec, Alexander Timans, Tin Hadži Veljković, Kaspar Sakmann, Dan Zhang, Christian A. Naesseth, Eric Nalisnick", "id": "2405.20915v1", "paper_url": "http://arxiv.org/abs/2405.20915v1", "repo": "null"}}