{"2409.17568": {"publish_time": "2024-09-26", "title": "Showing Many Labels in Multi-label Classification Models: An Empirical Study of Adversarial Examples", "paper_summary": "With the rapid development of Deep Neural Networks (DNNs), they have been\napplied in numerous fields. However, research indicates that DNNs are\nsusceptible to adversarial examples, and this is equally true in the\nmulti-label domain. To further investigate multi-label adversarial examples, we\nintroduce a novel type of attacks, termed \"Showing Many Labels\". The objective\nof this attack is to maximize the number of labels included in the classifier's\nprediction results. In our experiments, we select nine attack algorithms and\nevaluate their performance under \"Showing Many Labels\". Eight of the attack\nalgorithms were adapted from the multi-class environment to the multi-label\nenvironment, while the remaining one was specifically designed for the\nmulti-label environment. We choose ML-LIW and ML-GCN as target models and train\nthem on four popular multi-label datasets: VOC2007, VOC2012, NUS-WIDE, and\nCOCO. We record the success rate of each algorithm when it shows the expected\nnumber of labels in eight different scenarios. Experimental results indicate\nthat under the \"Showing Many Labels\", iterative attacks perform significantly\nbetter than one-step attacks. Moreover, it is possible to show all labels in\nthe dataset.", "paper_summary_zh": "隨著深度神經網路 (DNN) 的快速發展，它們已被應用於許多領域。然而，研究表明 DNN 容易受到對抗性範例的影響，這在多標籤領域中也是如此。為了進一步研究多標籤對抗性範例，我們引入了一種類型的攻擊，稱為「顯示許多標籤」。此攻擊的目標是最大化分類器預測結果中包含的標籤數量。在我們的實驗中，我們選擇了九種攻擊演算法，並評估它們在「顯示許多標籤」下的表現。其中八種攻擊演算法從多類別環境改編為多標籤環境，而剩下的則專門設計用於多標籤環境。我們選擇 ML-LIW 和 ML-GCN 作為目標模型，並在四個流行的多標籤資料集上訓練它們：VOC2007、VOC2012、NUS-WIDE 和 COCO。我們記錄了每個演算法在八種不同情況下顯示預期標籤數量時的成功率。實驗結果表明，在「顯示許多標籤」下，迭代攻擊的表現顯著優於單步攻擊。此外，顯示資料集中所有標籤是可能的。", "author": "Yujiang Liu et.al.", "authors": "Yujiang Liu, Wenjian Luo, Zhijian Chen, Muhammad Luqman Naseem", "id": "2409.17568v1", "paper_url": "http://arxiv.org/abs/2409.17568v1", "repo": "null"}}