{"2412.11540": {"publish_time": "2024-12-16", "title": "SP$^2$T: Sparse Proxy Attention for Dual-stream Point Transformer", "paper_summary": "In 3D understanding, point transformers have yielded significant advances in\nbroadening the receptive field. However, further enhancement of the receptive\nfield is hindered by the constraints of grouping attention. The proxy-based\nmodel, as a hot topic in image and language feature extraction, uses global or\nlocal proxies to expand the model's receptive field. But global proxy-based\nmethods fail to precisely determine proxy positions and are not suited for\ntasks like segmentation and detection in the point cloud, and exist local\nproxy-based methods for image face difficulties in global-local balance, proxy\nsampling in various point clouds, and parallel cross-attention computation for\nsparse association. In this paper, we present SP$^2$T, a local proxy-based dual\nstream point transformer, which promotes global receptive field while\nmaintaining a balance between local and global information. To tackle robust 3D\nproxy sampling, we propose a spatial-wise proxy sampling with vertex-based\npoint proxy associations, ensuring robust point-cloud sampling in many scales\nof point cloud. To resolve economical association computation, we introduce\nsparse proxy attention combined with table-based relative bias, which enables\nlow-cost and precise interactions between proxy and point features.\nComprehensive experiments across multiple datasets reveal that our model\nachieves SOTA performance in downstream tasks. The code has been released in\nhttps://github.com/TerenceWallel/Sparse-Proxy-Point-Transformer .", "paper_summary_zh": "在 3D 理解中，點Transformer在擴大感受野方面取得了重大進展。然而，群組注意力的限制阻礙了感受野的進一步增強。代理模型作為影像和語言特徵提取的熱門主題，使用全局或局部代理來擴展模型的感受野。但是，基於全局代理的方法無法準確確定代理位置，不適合點雲中的分割和檢測等任務，並且存在基於局部代理的方法，在全局-局部平衡、各種點雲中的代理採樣以及稀疏關聯的並行交叉注意計算方面存在困難。在本文中，我們提出了 SP$^2$T，一個基於局部代理的雙流點Transformer，它在保持局部和全局資訊平衡的同時促進全局感受野。為了應對穩健的 3D 代理採樣，我們提出了一種基於頂點的點代理關聯的空間感知代理採樣，確保在點雲的許多尺度上進行穩健的點雲採樣。為了解決經濟型關聯計算，我們引入了稀疏代理注意，並結合了基於表格的相對偏差，這使得代理和點特徵之間的交互低成本且精確。跨多個資料集的綜合實驗表明，我們的模型在下游任務中實現了 SOTA 性能。該程式碼已發佈在 https://github.com/TerenceWallel/Sparse-Proxy-Point-Transformer。", "author": "Jiaxu Wan et.al.", "authors": "Jiaxu Wan, Hong Zhang, Ziqi He, Qishu Wang, Ding Yuan, Yifan Yang", "id": "2412.11540v1", "paper_url": "http://arxiv.org/abs/2412.11540v1", "repo": "https://github.com/terencewallel/sparse-proxy-point-transformer"}}