{"2406.10160": {"publish_time": "2024-06-14", "title": "One-pass Multiple Conformer and Foundation Speech Systems Compression and Quantization Using An All-in-one Neural Model", "paper_summary": "We propose a novel one-pass multiple ASR systems joint compression and\nquantization approach using an all-in-one neural model. A single compression\ncycle allows multiple nested systems with varying Encoder depths, widths, and\nquantization precision settings to be simultaneously constructed without the\nneed to train and store individual target systems separately. Experiments\nconsistently demonstrate the multiple ASR systems compressed in a single\nall-in-one model produced a word error rate (WER) comparable to, or lower by up\nto 1.01\\% absolute (6.98\\% relative) than individually trained systems of equal\ncomplexity. A 3.4x overall system compression and training time speed-up was\nachieved. Maximum model size compression ratios of 12.8x and 3.93x were\nobtained over the baseline Switchboard-300hr Conformer and LibriSpeech-100hr\nfine-tuned wav2vec2.0 models, respectively, incurring no statistically\nsignificant WER increase.", "paper_summary_zh": "我們提出一個新穎的一遍式多重 ASR 系統聯合壓縮和量化方法，使用一個多合一的類神經模型。單一壓縮週期允許同時構造具有不同編碼器深度、寬度和量化精度設定的多重嵌套系統，而無需分別訓練和儲存個別的目標系統。實驗持續證明壓縮在單一多合一模型中的多重 ASR 系統產生一個詞彙錯誤率 (WER)，與個別訓練的相同複雜度系統相當，或低至 1.01% 絕對值 (6.98% 相對值)。實現了 3.4 倍的整體系統壓縮和訓練時間加速。與基準 Switchboard-300hr Conformer 和 LibriSpeech-100hr 微調 wav2vec2.0 模型相比，分別獲得了 12.8 倍和 3.93 倍的最大模型大小壓縮比，不會造成統計上顯著的 WER 增加。", "author": "Zhaoqing Li et.al.", "authors": "Zhaoqing Li, Haoning Xu, Tianzi Wang, Shoukang Hu, Zengrui Jin, Shujie Hu, Jiajun Deng, Mingyu Cui, Mengzhe Geng, Xunying Liu", "id": "2406.10160v1", "paper_url": "http://arxiv.org/abs/2406.10160v1", "repo": "null"}}