{"2407.09181": {"publish_time": "2024-07-12", "title": "Exploring the Effectiveness of Methods for Persona Extraction", "paper_summary": "The paper presents a study of methods for extracting information about\ndialogue participants and evaluating their performance in Russian. To train\nmodels for this task, the Multi-Session Chat dataset was translated into\nRussian using multiple translation models, resulting in improved data quality.\nA metric based on the F-score concept is presented to evaluate the\neffectiveness of the extraction models. The metric uses a trained classifier to\nidentify the dialogue participant to whom the persona belongs. Experiments were\nconducted on MBart, FRED-T5, Starling-7B, which is based on the Mistral, and\nEncoder2Encoder models. The results demonstrated that all models exhibited an\ninsufficient level of recall in the persona extraction task. The incorporation\nof the NCE Loss improved the model's precision at the expense of its recall.\nFurthermore, increasing the model's size led to enhanced extraction of\npersonas.", "paper_summary_zh": "論文提出了一種研究方法，用於提取俄語對話參與者的資訊並評估其表現。為了訓練此任務的模型，Multi-Session Chat 資料集使用多個翻譯模型翻譯成俄語，進而提升資料品質。提出了一個基於 F 分數概念的指標，用於評估提取模型的有效性。該指標使用訓練好的分類器來識別角色所屬的對話參與者。實驗在基於 Mistral 的 MBart、FRED-T5、Starling-7B 和 Encoder2Encoder 模型上進行。結果顯示，所有模型在角色提取任務中都表現出不足夠的召回率。加入 NCE 損失以犧牲召回率為代價來提升模型的準確率。此外，增加模型大小有助於增強角色的提取。", "author": "Konstantin Zaitsev et.al.", "authors": "Konstantin Zaitsev", "id": "2407.09181v1", "paper_url": "http://arxiv.org/abs/2407.09181v1", "repo": "null"}}