{"2501.06382": {"publish_time": "2025-01-10", "title": "Dynamics of \"Spontaneous\" Topic Changes in Next Token Prediction with Self-Attention", "paper_summary": "Human cognition can spontaneously shift conversation topics, often triggered\nby emotional or contextual signals. In contrast, self-attention-based language\nmodels depend on structured statistical cues from input tokens for next-token\nprediction, lacking this spontaneity. Motivated by this distinction, we\ninvestigate the factors that influence the next-token prediction to change the\ntopic of the input sequence. We define concepts of topic continuity, ambiguous\nsequences, and change of topic, based on defining a topic as a set of token\npriority graphs (TPGs). Using a simplified single-layer self-attention\narchitecture, we derive analytical characterizations of topic changes.\nSpecifically, we demonstrate that (1) the model maintains the priority order of\ntokens related to the input topic, (2) a topic change occurs only if\nlower-priority tokens outnumber all higher-priority tokens of the input topic,\nand (3) unlike human cognition, longer context lengths and overlapping topics\nreduce the likelihood of spontaneous redirection. These insights highlight\ndifferences between human cognition and self-attention-based models in\nnavigating topic changes and underscore the challenges in designing\nconversational AI capable of handling \"spontaneous\" conversations more\nnaturally. To our knowledge, this is the first work to address these questions\nin such close relation to human conversation and thought.", "paper_summary_zh": "人類認知可以自發地轉換對話主題，通常是由情緒或語境信號觸發。相比之下，基於自我注意力的語言模型依賴於輸入符號的結構化統計線索來預測下一個符號，缺乏這種自發性。受這種區別的啟發，我們探討了影響下一個符號預測以改變輸入序列主題的因素。我們根據將主題定義為一組符號優先級圖（TPG）來定義主題連續性、歧義序列和主題變化的概念。使用簡化的單層自注意力架構，我們推導出主題變化的分析特徵。具體來說，我們證明（1）模型維護與輸入主題相關的符號的優先順序，（2）只有當較低優先順序的符號多於輸入主題的所有較高優先順序的符號時，才會發生主題變化，以及（3）與人類認知不同，較長的上下文長度和重疊的主題會降低自發重定向的可能性。這些見解突出了人類認知和基於自注意力的模型在應對主題變化時的差異，並強調了在設計能夠更自然地處理「自發」對話的對話式 AI 時所面臨的挑戰。據我們所知，這是第一個如此密切地與人類對話和思維相關地探討這些問題的研究。", "author": "Mumin Jia et.al.", "authors": "Mumin Jia, Jairo Diaz-Rodriguez", "id": "2501.06382v1", "paper_url": "http://arxiv.org/abs/2501.06382v1", "repo": "null"}}