{"2406.12665": {"publish_time": "2024-06-18", "title": "CollabStory: Multi-LLM Collaborative Story Generation and Authorship Analysis", "paper_summary": "The rise of unifying frameworks that enable seamless interoperability of\nLarge Language Models (LLMs) has made LLM-LLM collaboration for open-ended\ntasks a possibility. Despite this, there have not been efforts to explore such\ncollaborative writing. We take the next step beyond human-LLM collaboration to\nexplore this multi-LLM scenario by generating the first exclusively\nLLM-generated collaborative stories dataset called CollabStory. We focus on\nsingle-author ($N=1$) to multi-author (up to $N=5$) scenarios, where multiple\nLLMs co-author stories. We generate over 32k stories using open-source\ninstruction-tuned LLMs. Further, we take inspiration from the PAN tasks that\nhave set the standard for human-human multi-author writing tasks and analysis.\nWe extend their authorship-related tasks for multi-LLM settings and present\nbaselines for LLM-LLM collaboration. We find that current baselines are not\nable to handle this emerging scenario. Thus, CollabStory is a resource that\ncould help propel an understanding as well as the development of techniques to\ndiscern the use of multiple LLMs. This is crucial to study in the context of\nwriting tasks since LLM-LLM collaboration could potentially overwhelm ongoing\nchallenges related to plagiarism detection, credit assignment, maintaining\nacademic integrity in educational settings, and addressing copyright\ninfringement concerns. We make our dataset and code available at\n\\texttt{\\url{https://github.com/saranya-venkatraman/multi_llm_story_writing}}.", "paper_summary_zh": "<paragraph>統一框架的興起，讓大型語言模型 (LLM) 能夠無縫地相互操作，這使得 LLM-LLM 協作成為開放式任務的可能性。儘管如此，尚未有探索這種協作寫作的努力。我們踏出人機協作的下一步，透過產生第一個專門由 LLM 生成的協作故事資料集 CollabStory 來探索這種多 LLM 的場景。我們專注於單一作者 ($N=1$) 到多作者 (最多 $N=5$) 的場景，其中多個 LLM 共同撰寫故事。我們使用開源指令微調的 LLM 產生超過 32k 個故事。此外，我們從 PAN 任務中汲取靈感，PAN 任務已為人機多作者寫作任務和分析設定了標準。我們擴展了他們的作者相關任務，以適用於多 LLM 設定，並為 LLM-LLM 協作提出基準。我們發現目前的基準無法處理這種新興的場景。因此，CollabStory 是一個資源，可以幫助推進對多個 LLM 使用的理解和技術開發。這對於寫作任務的研究至關重要，因為 LLM-LLM 協作可能會對剽竊偵測、學分分配、維護教育環境的學術誠信以及解決版權侵權問題等持續的挑戰造成影響。我們在 \\texttt{\\url{https://github.com/saranya-venkatraman/multi_llm_story_writing}} 提供我們的資料集和程式碼。</paragraph>", "author": "Saranya Venkatraman et.al.", "authors": "Saranya Venkatraman, Nafis Irtiza Tripto, Dongwon Lee", "id": "2406.12665v1", "paper_url": "http://arxiv.org/abs/2406.12665v1", "repo": "https://github.com/saranya-venkatraman/multi_llm_story_writing"}}