{"2408.09675": {"publish_time": "2024-08-19", "title": "Multi-Agent Reinforcement Learning for Autonomous Driving: A Survey", "paper_summary": "Reinforcement Learning (RL) is a potent tool for sequential decision-making\nand has achieved performance surpassing human capabilities across many\nchallenging real-world tasks. As the extension of RL in the multi-agent system\ndomain, multi-agent RL (MARL) not only need to learn the control policy but\nalso requires consideration regarding interactions with all other agents in the\nenvironment, mutual influences among different system components, and the\ndistribution of computational resources. This augments the complexity of\nalgorithmic design and poses higher requirements on computational resources.\nSimultaneously, simulators are crucial to obtain realistic data, which is the\nfundamentals of RL. In this paper, we first propose a series of metrics of\nsimulators and summarize the features of existing benchmarks. Second, to ease\ncomprehension, we recall the foundational knowledge and then synthesize the\nrecently advanced studies of MARL-related autonomous driving and intelligent\ntransportation systems. Specifically, we examine their environmental modeling,\nstate representation, perception units, and algorithm design. Conclusively, we\ndiscuss open challenges as well as prospects and opportunities. We hope this\npaper can help the researchers integrate MARL technologies and trigger more\ninsightful ideas toward the intelligent and autonomous driving.", "paper_summary_zh": "強化學習 (RL) 是用於順序決策制定的一種強大工具，並已在許多具有挑戰性的現實世界任務中實現了超越人類能力的效能。作為 RL 在多主體系統領域的延伸，多主體 RL (MARL) 不僅需要學習控制政策，還需要考慮與環境中所有其他主體的互動、不同系統組件之間的相互影響以及計算資源的分配。這增加了演算法設計的複雜性，並對計算資源提出了更高的要求。同時，模擬器對於取得現實資料至關重要，而這是 RL 的基礎。在本文中，我們首先提出了一系列模擬器的指標，並總結了現有基準的特徵。其次，為了便於理解，我們回顧了基礎知識，然後綜合了最近關於 MARL 相關自動駕駛和智慧運輸系統的先進研究。具體來說，我們探討了它們的環境建模、狀態表示、感知單元和演算法設計。最後，我們討論了開放性挑戰以及前景和機遇。我們希望本文能幫助研究人員整合 MARL 技術，並激發更多關於智慧和自動駕駛的深入見解。", "author": "Ruiqi Zhang et.al.", "authors": "Ruiqi Zhang, Jing Hou, Florian Walter, Shangding Gu, Jiayi Guan, Florian Röhrbein, Yali Du, Panpan Cai, Guang Chen, Alois Knoll", "id": "2408.09675v1", "paper_url": "http://arxiv.org/abs/2408.09675v1", "repo": "https://github.com/huawei-noah/SMARTS"}}