{"2503.13438": {"publish_time": "2025-03-17", "title": "Deep Belief Markov Models for POMDP Inference", "paper_summary": "This work introduces a novel deep learning-based architecture, termed the\nDeep Belief Markov Model (DBMM), which provides efficient, model-formulation\nagnostic inference in Partially Observable Markov Decision Process (POMDP)\nproblems. The POMDP framework allows for modeling and solving sequential\ndecision-making problems under observation uncertainty. In complex,\nhigh-dimensional, partially observable environments, existing methods for\ninference based on exact computations (e.g., via Bayes' theorem) or sampling\nalgorithms do not scale well. Furthermore, ground truth states may not be\navailable for learning the exact transition dynamics. DBMMs extend deep Markov\nmodels into the partially observable decision-making framework and allow\nefficient belief inference entirely based on available observation data via\nvariational inference methods. By leveraging the potency of neural networks,\nDBMMs can infer and simulate non-linear relationships in the system dynamics\nand naturally scale to problems with high dimensionality and discrete or\ncontinuous variables. In addition, neural network parameters can be dynamically\nupdated efficiently based on data availability. DBMMs can thus be used to infer\na belief variable, thus enabling the derivation of POMDP solutions over the\nbelief space. We evaluate the efficacy of the proposed methodology by\nevaluating the capability of model-formulation agnostic inference of DBMMs in\nbenchmark problems that include discrete and continuous variables.", "paper_summary_zh": "<paragraph>這項工作介紹了一種新穎的基於深度學習的架構，稱為深度信念馬可夫模型 (DBMM)，它在部分可觀察馬可夫決策過程 (POMDP) 問題中，提供了高效且與模型公式無關的推論方法。POMDP 框架允許在觀測不確定性下對序列決策問題進行建模和求解。在複雜、高維度、部分可觀察的環境中，現有的基於精確計算（例如，通過貝氏定理）或採樣算法的推論方法無法有效擴展。此外，真實狀態可能無法用於學習精確的轉移動態。DBMM 將深度馬可夫模型擴展到部分可觀察的決策框架中，並允許完全基於可用的觀測數據，通過變分推論方法進行有效的信念推論。藉助神經網絡的強大功能，DBMM 可以推斷和模擬系統動力學中的非線性關係，並且可以自然地擴展到具有高維度和離散或連續變量等問題。此外，可以根據數據的可用性有效地動態更新神經網絡參數。因此，DBMM 可用於推斷信念變量，從而能夠在信念空間上導出 POMDP 解決方案。我們通過評估 DBMM 在包含離散和連續變量的基準問題中進行與模型公式無關的推論能力，來評估所提出方法的有效性。</paragraph>\n", "author": "Giacomo Arcieri et.al.", "authors": "Giacomo Arcieri, Konstantinos G. Papakonstantinou, Daniel Straub, Eleni Chatzi", "id": "2503.13438v1", "paper_url": "http://arxiv.org/abs/2503.13438v1", "repo": "null"}}