{"2409.11321": {"publish_time": "2024-09-17", "title": "SOAP: Improving and Stabilizing Shampoo using Adam", "paper_summary": "There is growing evidence of the effectiveness of Shampoo, a higher-order\npreconditioning method, over Adam in deep learning optimization tasks. However,\nShampoo's drawbacks include additional hyperparameters and computational\noverhead when compared to Adam, which only updates running averages of first-\nand second-moment quantities. This work establishes a formal connection between\nShampoo (implemented with the 1/2 power) and Adafactor -- a memory-efficient\napproximation of Adam -- showing that Shampoo is equivalent to running\nAdafactor in the eigenbasis of Shampoo's preconditioner. This insight leads to\nthe design of a simpler and computationally efficient algorithm:\n$\\textbf{S}$hampo$\\textbf{O}$ with $\\textbf{A}$dam in the\n$\\textbf{P}$reconditioner's eigenbasis (SOAP).\n  With regards to improving Shampoo's computational efficiency, the most\nstraightforward approach would be to simply compute Shampoo's\neigendecomposition less frequently. Unfortunately, as our empirical results\nshow, this leads to performance degradation that worsens with this frequency.\nSOAP mitigates this degradation by continually updating the running average of\nthe second moment, just as Adam does, but in the current (slowly changing)\ncoordinate basis. Furthermore, since SOAP is equivalent to running Adam in a\nrotated space, it introduces only one additional hyperparameter (the\npreconditioning frequency) compared to Adam. We empirically evaluate SOAP on\nlanguage model pre-training with 360m and 660m sized models. In the large batch\nregime, SOAP reduces the number of iterations by over 40% and wall clock time\nby over 35% compared to AdamW, with approximately 20% improvements in both\nmetrics compared to Shampoo. An implementation of SOAP is available at\nhttps://github.com/nikhilvyas/SOAP.", "paper_summary_zh": "越來越多的證據顯示，Shampoo 是一種高階預處理方法，在深度學習最佳化任務中優於 Adam。然而，與僅更新一階和二階矩平均值的 Adam 相比，Shampoo 的缺點包括額外的超參數和運算負擔。這項工作在 Shampoo（以 1/2 次方實作）和 Adafactor（一種記憶體效率佳的 Adam 近似值）之間建立正式的關聯，顯示 Shampoo 等於在 Shampoo 預處理器的特徵基底中執行 Adafactor。這個見解引導我們設計一種更簡單且運算效率更高的演算法：$\\textbf{S}$hampo$\\textbf{O}$ with $\\textbf{A}$dam in the $\\textbf{P}$reconditioner's eigenbasis (SOAP)。\n關於改善 Shampoo 的運算效率，最直接的方法就是減少計算 Shampoo 特徵分解的頻率。不幸的是，正如我們的實證結果顯示，這會導致效能降低，而且頻率越高，效能就會越差。SOAP 透過持續更新二階矩的執行平均值來減輕這種效能降低，就像 Adam 所做的一樣，但使用的是目前的（緩慢變化的）座標基底。此外，由於 SOAP 等於在旋轉空間中執行 Adam，因此與 Adam 相比，它只引入一個額外的超參數（預處理頻率）。我們實證評估 SOAP 在語言模型預訓練中，使用 360m 和 660m 大小的模型。在大批次模式中，與 AdamW 相比，SOAP 將迭代次數減少超過 40%，將實際執行時間減少超過 35%，與 Shampoo 相比，兩項指標皆改善約 20%。SOAP 的實作可於 https://github.com/nikhilvyas/SOAP 取得。", "author": "Nikhil Vyas et.al.", "authors": "Nikhil Vyas, Depen Morwani, Rosie Zhao, Itai Shapira, David Brandfonbrener, Lucas Janson, Sham Kakade", "id": "2409.11321v1", "paper_url": "http://arxiv.org/abs/2409.11321v1", "repo": "https://github.com/nikhilvyas/soap"}}