{"2408.02341": {"publish_time": "2024-08-05", "title": "An approach to optimize inference of the DIART speaker diarization pipeline", "paper_summary": "Speaker diarization answers the question \"who spoke when\" for an audio file.\nIn some diarization scenarios, low latency is required for transcription.\nSpeaker diarization with low latency is referred to as online speaker\ndiarization. The DIART pipeline is an online speaker diarization system. It\nconsists of a segmentation and an embedding model. The embedding model has the\nlargest share of the overall latency. The aim of this paper is to optimize the\ninference latency of the DIART pipeline. Different inference optimization\nmethods such as knowledge distilation, pruning, quantization and layer fusion\nare applied to the embedding model of the pipeline. It turns out that knowledge\ndistillation optimizes the latency, but has a negative effect on the accuracy.\nQuantization and layer fusion also have a positive influence on the latency\nwithout worsening the accuracy. Pruning, on the other hand, does not improve\nlatency.", "paper_summary_zh": "說話者日記化回答音訊檔案的「誰在何時說話」問題。\n在某些日記化情境中，轉錄需要低延遲。\n低延遲的說話者日記化稱為線上說話者日記化。DIART 管線是一個線上說話者日記化系統。它\n包含一個分段和一個嵌入模型。嵌入模型在整體延遲中佔有最大的份額。本文的目的是最佳化\nDIART 管線的推論延遲。不同的推論最佳化方法，例如知識蒸餾、剪枝、量化和層融合\n應用於管線的嵌入模型。結果發現知識蒸餾最佳化延遲，但對準確度有負面影響。\n量化和層融合也對延遲有正向影響，且不會惡化準確度。另一方面，剪枝並未改善\n延遲。", "author": "Roman Aperdannier et.al.", "authors": "Roman Aperdannier, Sigurd Schacht, Alexander Piazza", "id": "2408.02341v1", "paper_url": "http://arxiv.org/abs/2408.02341v1", "repo": "null"}}