{"2407.03863": {"publish_time": "2024-07-04", "title": "Unsupervised Analysis of Alzheimer's Disease Signatures using 3D Deformable Autoencoders", "paper_summary": "With the increasing incidence of neurodegenerative diseases such as\nAlzheimer's Disease (AD), there is a need for further research that enhances\ndetection and monitoring of the diseases. We present MORPHADE (Morphological\nAutoencoders for Alzheimer's Disease Detection), a novel unsupervised learning\napproach which uses deformations to allow the analysis of 3D T1-weighted brain\nimages. To the best of our knowledge, this is the first use of deformations\nwith deep unsupervised learning to not only detect, but also localize and\nassess the severity of structural changes in the brain due to AD. We obtain\nmarkedly higher anomaly scores in clinically important areas of the brain in\nsubjects with AD compared to healthy controls, showcasing that our method is\nable to effectively locate AD-related atrophy. We additionally observe a visual\ncorrelation between the severity of atrophy highlighted in our anomaly maps and\nmedial temporal lobe atrophy scores evaluated by a clinical expert. Finally,\nour method achieves an AUROC of 0.80 in detecting AD, out-performing several\nsupervised and unsupervised baselines. We believe our framework shows promise\nas a tool towards improved understanding, monitoring and detection of AD. To\nsupport further research and application, we have made our code publicly\navailable at github.com/ci-ber/MORPHADE.", "paper_summary_zh": "隨著神經退行性疾病（例如阿茲海默症）的發生率增加，需要進一步的研究來加強對這些疾病的偵測和監控。我們提出 MORPHADE（阿茲海默症偵測的形態自動編碼器），這是一種新穎的無監督學習方法，它使用變形來分析 3D T1 加權腦部影像。據我們所知，這是首次將變形與深度無監督學習結合使用，不僅可以偵測，還可以定位和評估阿茲海默症導致的腦部結構變化嚴重程度。我們在阿茲海默症受試者的腦部臨床上重要區域獲得顯著更高的異常分數，與健康對照組相比，顯示我們的模型能夠有效定位與阿茲海默症相關的萎縮。此外，我們觀察到異常圖中突出的萎縮嚴重程度與臨床專家評估的內側顳葉萎縮分數之間存在視覺相關性。最後，我們的模型在偵測阿茲海默症方面達到了 0.80 的 AUROC，優於多個監督式和無監督式基準。我們相信我們的架構顯示出有望成為改善阿茲海默症理解、監控和偵測的工具。為了支持進一步的研究和應用，我們已在 github.com/ci-ber/MORPHADE 公開我們的程式碼。", "author": "Mehmet Yigit Avci et.al.", "authors": "Mehmet Yigit Avci, Emily Chan, Veronika Zimmer, Daniel Rueckert, Benedikt Wiestler, Julia A. Schnabel, Cosmin I. Bercea", "id": "2407.03863v1", "paper_url": "http://arxiv.org/abs/2407.03863v1", "repo": "https://github.com/ci-ber/morphade"}}