{"2408.16482": {"publish_time": "2024-08-29", "title": "Self-Alignment: Improving Alignment of Cultural Values in LLMs via In-Context Learning", "paper_summary": "Improving the alignment of Large Language Models (LLMs) with respect to the\ncultural values that they encode has become an increasingly important topic. In\nthis work, we study whether we can exploit existing knowledge about cultural\nvalues at inference time to adjust model responses to cultural value probes. We\npresent a simple and inexpensive method that uses a combination of in-context\nlearning (ICL) and human survey data, and show that we can improve the\nalignment to cultural values across 5 models that include both English-centric\nand multilingual LLMs. Importantly, we show that our method could prove useful\nin test languages other than English and can improve alignment to the cultural\nvalues that correspond to a range of culturally diverse countries.", "paper_summary_zh": "改善大型語言模型 (LLM) 與其編碼的文化價值觀之間的一致性已成為越來越重要的主題。在本文中，我們研究是否能利用現有的文化價值觀知識在推論時間調整模型回應以符合文化價值觀探測。我們提出一個簡單且便宜的方法，它結合了情境中學習 (ICL) 和人類調查數據，並展示我們可以改善跨越 5 個模型（包括以英語為中心和多語言的 LLM）的文化價值觀一致性。重要的是，我們展示了我們的方法可能對英語以外的測試語言有用，並且可以改善與各種文化多元國家對應的文化價值觀的一致性。", "author": "Rochelle Choenni et.al.", "authors": "Rochelle Choenni, Ekaterina Shutova", "id": "2408.16482v1", "paper_url": "http://arxiv.org/abs/2408.16482v1", "repo": "null"}}