{"2407.19804": {"publish_time": "2024-07-29", "title": "Imputation for prediction: beware of diminishing returns", "paper_summary": "Missing values are prevalent across various fields, posing challenges for\ntraining and deploying predictive models. In this context, imputation is a\ncommon practice, driven by the hope that accurate imputations will enhance\npredictions. However, recent theoretical and empirical studies indicate that\nsimple constant imputation can be consistent and competitive. This empirical\nstudy aims at clarifying if and when investing in advanced imputation methods\nyields significantly better predictions. Relating imputation and predictive\naccuracies across combinations of imputation and predictive models on 20\ndatasets, we show that imputation accuracy matters less i) when using\nexpressive models, ii) when incorporating missingness indicators as\ncomplementary inputs, iii) matters much more for generated linear outcomes than\nfor real-data outcomes. Interestingly, we also show that the use of the\nmissingness indicator is beneficial to the prediction performance, even in MCAR\nscenarios. Overall, on real-data with powerful models, improving imputation\nonly has a minor effect on prediction performance. Thus, investing in better\nimputations for improved predictions often offers limited benefits.", "paper_summary_zh": "缺失值在各个領域中普遍存在，對訓練和部署預測模型構成挑戰。在此背景下，插補是一種常見的做法，其驅動力是希望準確的插補能增強預測。然而，最近的理論和實證研究表明，簡單的常數插補可以是一致且具有競爭力的。這項實證研究旨在釐清投資於先進插補方法是否以及何時會產生顯著更好的預測。在 20 個資料集上，我們展示了插補準確度在以下情況下較不重要：i) 使用表達性模型時，ii) 將缺失指標作為補充輸入納入時，iii) 對產生的線性結果比對實際資料結果重要得多。有趣的是，我們還表明，即使在 MCAR 場景中，使用缺失指標也有利於預測性能。總體而言，在具有強大模型的實際資料中，改進插補對預測性能的影響很小。因此，投資於更好的插補以改善預測通常只能提供有限的好處。", "author": "Marine Le Morvan et.al.", "authors": "Marine Le Morvan, Gaël Varoquaux", "id": "2407.19804v1", "paper_url": "http://arxiv.org/abs/2407.19804v1", "repo": "null"}}