{"2411.04788": {"publish_time": "2024-11-07", "title": "Enhancing Investment Analysis: Optimizing AI-Agent Collaboration in Financial Research", "paper_summary": "In recent years, the application of generative artificial intelligence\n(GenAI) in financial analysis and investment decision-making has gained\nsignificant attention. However, most existing approaches rely on single-agent\nsystems, which fail to fully utilize the collaborative potential of multiple AI\nagents. In this paper, we propose a novel multi-agent collaboration system\ndesigned to enhance decision-making in financial investment research. The\nsystem incorporates agent groups with both configurable group sizes and\ncollaboration structures to leverage the strengths of each agent group type. By\nutilizing a sub-optimal combination strategy, the system dynamically adapts to\nvarying market conditions and investment scenarios, optimizing performance\nacross different tasks. We focus on three sub-tasks: fundamentals, market\nsentiment, and risk analysis, by analyzing the 2023 SEC 10-K forms of 30\ncompanies listed on the Dow Jones Index. Our findings reveal significant\nperformance variations based on the configurations of AI agents for different\ntasks. The results demonstrate that our multi-agent collaboration system\noutperforms traditional single-agent models, offering improved accuracy,\nefficiency, and adaptability in complex financial environments. This study\nhighlights the potential of multi-agent systems in transforming financial\nanalysis and investment decision-making by integrating diverse analytical\nperspectives.", "paper_summary_zh": "近年來，生成式人工智慧 (GenAI) 在財務分析和投資決策中的應用備受矚目。然而，現有的方法大多依賴於單一代理系統，無法充分利用多個 AI 代理的協作潛力。在本文中，我們提出一個新穎的多代理協作系統，旨在增強財務投資研究中的決策制定。該系統結合了具有可配置群組規模和協作結構的代理群組，以利用每個代理群組類型的優勢。通過使用次優組合策略，該系統可動態適應不同的市場條件和投資情境，優化不同任務的績效。我們專注於三項子任務：基本面、市場情緒和風險分析，方法是分析道瓊指數中 30 家公司的 2023 年 SEC 10-K 表格。我們的研究結果顯示，根據不同任務的 AI 代理配置，績效差異顯著。結果表明，我們的多代理協作系統優於傳統的單一代理模型，在複雜的財務環境中提供更高的準確性、效率和適應性。本研究強調了多代理系統在轉變財務分析和投資決策方面的潛力，方法是整合不同的分析觀點。", "author": "Xuewen Han et.al.", "authors": "Xuewen Han, Neng Wang, Shangkun Che, Hongyang Yang, Kunpeng Zhang, Sean Xin Xu", "id": "2411.04788v1", "paper_url": "http://arxiv.org/abs/2411.04788v1", "repo": "https://github.com/ai4finance-foundation/finrobot"}}