{"2410.08164": {"publish_time": "2024-10-10", "title": "Agent S: An Open Agentic Framework that Uses Computers Like a Human", "paper_summary": "We present Agent S, an open agentic framework that enables autonomous\ninteraction with computers through a Graphical User Interface (GUI), aimed at\ntransforming human-computer interaction by automating complex, multi-step\ntasks. Agent S aims to address three key challenges in automating computer\ntasks: acquiring domain-specific knowledge, planning over long task horizons,\nand handling dynamic, non-uniform interfaces. To this end, Agent S introduces\nexperience-augmented hierarchical planning, which learns from external\nknowledge search and internal experience retrieval at multiple levels,\nfacilitating efficient task planning and subtask execution. In addition, it\nemploys an Agent-Computer Interface (ACI) to better elicit the reasoning and\ncontrol capabilities of GUI agents based on Multimodal Large Language Models\n(MLLMs). Evaluation on the OSWorld benchmark shows that Agent S outperforms the\nbaseline by 9.37% on success rate (an 83.6% relative improvement) and achieves\na new state-of-the-art. Comprehensive analysis highlights the effectiveness of\nindividual components and provides insights for future improvements.\nFurthermore, Agent S demonstrates broad generalizability to different operating\nsystems on a newly-released WindowsAgentArena benchmark. Code available at\nhttps://github.com/simular-ai/Agent-S.", "paper_summary_zh": "<paragraph>我們提出 Agent S，一個開放的代理框架，可透過圖形使用者介面 (GUI) 與電腦進行自主互動，旨在透過自動化複雜的多步驟任務來轉變人機互動。Agent S 旨在解決自動化電腦任務中的三個關鍵挑戰：擷取特定領域知識、規劃長任務時程，以及處理動態、非統一的介面。為此，Agent S 導入了經驗增強階層式規劃，它會從多個層級的外部知識搜尋和內部經驗擷取中學習，促進有效率的任務規劃和子任務執行。此外，它採用代理電腦介面 (ACI)，以根據多模態大型語言模型 (MLLM) 更佳地引出 GUI 代理的推理和控制能力。在 OSWorld 基準上的評估顯示，Agent S 在成功率上比基準高出 9.37%（相對提升 83.6%），並創下新的技術水準。全面的分析突顯了個別元件的有效性，並為未來的改進提供見解。此外，Agent S 在新發布的 WindowsAgentArena 基準上展示了對不同作業系統的廣泛通用性。程式碼可於 https://github.com/simular-ai/Agent-S 取得。</paragraph>", "author": "Saaket Agashe et.al.", "authors": "Saaket Agashe, Jiuzhou Han, Shuyu Gan, Jiachen Yang, Ang Li, Xin Eric Wang", "id": "2410.08164v1", "paper_url": "http://arxiv.org/abs/2410.08164v1", "repo": "https://github.com/simular-ai/agent-s"}}