{"2405.19334": {"publish_time": "2024-05-29", "title": "LLMs Meet Multimodal Generation and Editing: A Survey", "paper_summary": "With the recent advancement in large language models (LLMs), there is a\ngrowing interest in combining LLMs with multimodal learning. Previous surveys\nof multimodal large language models (MLLMs) mainly focus on understanding. This\nsurvey elaborates on multimodal generation across different domains, including\nimage, video, 3D, and audio, where we highlight the notable advancements with\nmilestone works in these fields. Specifically, we exhaustively investigate the\nkey technical components behind methods and multimodal datasets utilized in\nthese studies. Moreover, we dig into tool-augmented multimodal agents that can\nuse existing generative models for human-computer interaction. Lastly, we also\ncomprehensively discuss the advancement in AI safety and investigate emerging\napplications as well as future prospects. Our work provides a systematic and\ninsightful overview of multimodal generation, which is expected to advance the\ndevelopment of Artificial Intelligence for Generative Content (AIGC) and world\nmodels. A curated list of all related papers can be found at\nhttps://github.com/YingqingHe/Awesome-LLMs-meet-Multimodal-Generation", "paper_summary_zh": "隨著大型語言模型 (LLM) 的最新進展，將 LLM 與多模態學習相結合的興趣與日俱增。先前對多模態大型語言模型 (MLLM) 的調查主要集中在理解方面。本調查闡述了不同領域的多模態生成，包括圖像、影片、3D 和音訊，我們在這些領域中強調了具有里程碑意義的作品的顯著進展。具體來說，我們詳盡地探討了這些研究中所用方法和多模態資料集背後的主要技術組成部分。此外，我們深入探討了工具增強的多模態代理，這些代理可以使用現有的生成模型進行人機互動。最後，我們還全面討論了 AI 安全性的進展，並探討了新興應用以及未來前景。我們的研究提供了多模態生成的系統且富有洞察力的概述，預計將推進生成內容 (AIGC) 和世界模型的人工智慧發展。所有相關論文的精選清單可在 https://github.com/YingqingHe/Awesome-LLMs-meet-Multimodal-Generation 找到", "author": "Yingqing He et.al.", "authors": "Yingqing He, Zhaoyang Liu, Jingye Chen, Zeyue Tian, Hongyu Liu, Xiaowei Chi, Runtao Liu, Ruibin Yuan, Yazhou Xing, Wenhai Wang, Jifeng Dai, Yong Zhang, Wei Xue, Qifeng Liu, Yike Guo, Qifeng Chen", "id": "2405.19334v1", "paper_url": "http://arxiv.org/abs/2405.19334v1", "repo": "https://github.com/yingqinghe/awesome-llms-meet-multimodal-generation"}}