{"2408.13211": {"publish_time": "2024-08-23", "title": "Optimal Quantum Circuit Design via Unitary Neural Networks", "paper_summary": "The process of translating a quantum algorithm into a form suitable for\nimplementation on a quantum computing platform is crucial but yet challenging.\nThis entails specifying quantum operations with precision, a typically\nintricate task. In this paper, we present an alternative approach: an automated\nmethod for synthesizing the functionality of a quantum algorithm into a quantum\ncircuit model representation. Our methodology involves training a neural\nnetwork model using diverse input-output mappings of the quantum algorithm. We\ndemonstrate that this trained model can effectively generate a quantum circuit\nmodel equivalent to the original algorithm. Remarkably, our observations\nindicate that the trained model achieves near-perfect mapping of unseen inputs\nto their respective outputs.", "paper_summary_zh": "將量子演算法轉換為適合在量子運算平台上執行的形式的過程至關重要，但卻極具挑戰性。\n這需要精確地指定量子運算，這通常是一項複雜的任務。在本文中，我們提出了一種替代方法：一種將量子演算法的功能合成到量子電路模型表示中的自動化方法。我們的做法包括使用量子演算法的多樣化輸入輸出對應來訓練神經網路模型。我們證明了這個訓練好的模型可以有效地產生等同於原始演算法的量子電路模型。值得注意的是，我們的觀察結果表明，訓練好的模型可以將未見過的輸入近乎完美地對應到它們各自的輸出。", "author": "M. Zomorodi et.al.", "authors": "M. Zomorodi, H. Amini, M. Abbaszadeh, J. Sohrabi, V. Salari, P. Plawiak", "id": "2408.13211v1", "paper_url": "http://arxiv.org/abs/2408.13211v1", "repo": "null"}}