{"2412.10422": {"publish_time": "2024-12-10", "title": "AutoPrep: Natural Language Question-Aware Data Preparation with a Multi-Agent Framework", "paper_summary": "Answering natural language (NL) questions about tables, which is referred to\nas Tabular Question Answering (TQA), is important because it enables users to\nextract meaningful insights quickly and efficiently from structured data,\nbridging the gap between human language and machine-readable formats. Many of\nthese tables originate from web sources or real-world scenarios, necessitating\ncareful data preparation (or data prep for short) to ensure accurate answers.\nHowever, unlike traditional data prep, question-aware data prep introduces new\nrequirements, which include tasks such as column augmentation and filtering for\ngiven questions, and question-aware value normalization or conversion. Because\neach of the above tasks is unique, a single model (or agent) may not perform\neffectively across all scenarios. In this paper, we propose AUTOPREP, a large\nlanguage model (LLM)-based multi-agent framework that leverages the strengths\nof multiple agents, each specialized in a certain type of data prep, ensuring\nmore accurate and contextually relevant responses. Given an NL question over a\ntable, AUTOPREP performs data prep through three key components. Planner:\nDetermines a logical plan, outlining a sequence of high-level operations.\nProgrammer: Translates this logical plan into a physical plan by generating the\ncorresponding low-level code. Executor: Iteratively executes and debugs the\ngenerated code to ensure correct outcomes. To support this multi-agent\nframework, we design a novel chain-of-thought reasoning mechanism for\nhigh-level operation suggestion, and a tool-augmented method for low-level code\ngeneration. Extensive experiments on real-world TQA datasets demonstrate that\nAUTOPREP can significantly improve the SOTA TQA solutions through\nquestion-aware data prep.", "paper_summary_zh": "回答有关表格的自然语言 (NL) 问题，称为表格问题解答 (TQA)，非常重要，因为它使用户能够从结构化数据中快速有效地提取有意义的见解，从而弥合了人类语言和机器可读格式之间的差距。其中许多表格源自网络来源或现实世界场景，因此需要仔细准备数据（或简称为数据准备）以确保答案准确。然而，与传统数据准备不同，考虑问题的数据准备引入了新要求，其中包括针对给定问题进行列增强和过滤，以及考虑问题的价值规范化或转换等任务。由于上述每项任务都是唯一的，因此单个模型（或代理）可能无法在所有场景中有效执行。在本文中，我们提出了 AUTOPREP，这是一个基于大型语言模型 (LLM) 的多代理框架，它利用了多个代理的优势，每个代理都专门从事某种类型的数据准备，从而确保了更准确和与上下文相关的响应。给定一个关于表格的 NL 问题，AUTOPREP 通过三个关键组件执行数据准备。计划程序：确定一个逻辑计划，概述一系列高级操作。程序员：通过生成相应的低级代码将此逻辑计划转换为物理计划。执行器：迭代执行并调试生成的代码以确保正确的结果。为了支持此多代理框架，我们设计了一种新颖的思想链推理机制，用于高级操作建议，以及一种用于低级代码生成​​的工具增强方法。在真实世界 TQA 数据集上进行的广泛实验表明，AUTOPREP 可以通过考虑问题的​​数据准备显着改进 SOTA TQA 解决方案。", "author": "Meihao Fan et.al.", "authors": "Meihao Fan, Ju Fan, Nan Tang, Lei Cao, Xiaoyong Du", "id": "2412.10422v1", "paper_url": "http://arxiv.org/abs/2412.10422v1", "repo": "null"}}