{"2408.13991": {"publish_time": "2024-08-26", "title": "Dual-CBA: Improving Online Continual Learning via Dual Continual Bias Adaptors from a Bi-level Optimization Perspective", "paper_summary": "In online continual learning (CL), models trained on changing distributions\neasily forget previously learned knowledge and bias toward newly received\ntasks. To address this issue, we present Continual Bias Adaptor (CBA), a\nbi-level framework that augments the classification network to adapt to\ncatastrophic distribution shifts during training, enabling the network to\nachieve a stable consolidation of all seen tasks. However, the CBA module\nadjusts distribution shifts in a class-specific manner, exacerbating the\nstability gap issue and, to some extent, fails to meet the need for continual\ntesting in online CL. To mitigate this challenge, we further propose a novel\nclass-agnostic CBA module that separately aggregates the posterior\nprobabilities of classes from new and old tasks, and applies a stable\nadjustment to the resulting posterior probabilities. We combine the two kinds\nof CBA modules into a unified Dual-CBA module, which thus is capable of\nadapting to catastrophic distribution shifts and simultaneously meets the\nreal-time testing requirements of online CL. Besides, we propose Incremental\nBatch Normalization (IBN), a tailored BN module to re-estimate its population\nstatistics for alleviating the feature bias arising from the inner loop\noptimization problem of our bi-level framework. To validate the effectiveness\nof the proposed method, we theoretically provide some insights into how it\nmitigates catastrophic distribution shifts, and empirically demonstrate its\nsuperiority through extensive experiments based on four rehearsal-based\nbaselines and three public continual learning benchmarks.", "paper_summary_zh": "在線上持續學習 (CL) 中，在變化的分佈上訓練的模型很容易忘記先前學習的知識，並對新接收的任務產生偏差。為了解決這個問題，我們提出了持續偏差適應器 (CBA)，一個雙層架構，用於擴充分類網路以適應訓練期間的災難性分佈轉移，使網路能夠穩定整合所有已見的任務。然而，CBA 模組以類別特定的方式調整分佈轉移，加劇了穩定性差距問題，並且在某種程度上無法滿足線上 CL 中持續測試的需求。為了減輕這個挑戰，我們進一步提出了一個新穎的類別不可知 CBA 模組，它分別聚合來自新舊任務的類別後驗機率，並對結果後驗機率套用穩定的調整。我們將這兩種 CBA 模組結合到一個統一的 Dual-CBA 模組中，因此能夠適應災難性分佈轉移，並同時滿足線上 CL 的即時測試需求。此外，我們提出了增量批次正規化 (IBN)，一個量身打造的 BN 模組，用於重新估計其母體統計資料，以減輕源自我們雙層架構內部迴圈最佳化問題的功能偏差。為了驗證所提出方法的有效性，我們在理論上提供了一些見解，說明它如何減輕災難性分佈轉移，並透過基於四個基於複習的基準和三個公開持續學習基準的廣泛實驗，實證展示其優越性。", "author": "Quanziang Wang et.al.", "authors": "Quanziang Wang, Renzhen Wang, Yichen Wu, Xixi Jia, Minghao Zhou, Deyu Meng", "id": "2408.13991v1", "paper_url": "http://arxiv.org/abs/2408.13991v1", "repo": "null"}}