{"2407.08328": {"publish_time": "2024-07-11", "title": "Unveiling Disparities in Maternity Care: A Topic Modelling Approach to Analysing Maternity Incident Investigation Reports", "paper_summary": "This study applies Natural Language Processing techniques, including Latent\nDirichlet Allocation, to analyse anonymised maternity incident investigation\nreports from the Healthcare Safety Investigation Branch. The reports underwent\npreprocessing, annotation using the Safety Intelligence Research taxonomy, and\ntopic modelling to uncover prevalent topics and detect differences in maternity\ncare across ethnic groups. A combination of offline and online methods was\nutilised to ensure data protection whilst enabling advanced analysis, with\noffline processing for sensitive data and online processing for non-sensitive\ndata using the `Claude 3 Opus' language model. Interactive topic analysis and\nsemantic network visualisation were employed to extract and display thematic\ntopics and visualise semantic relationships among keywords. The analysis\nrevealed disparities in care among different ethnic groups, with distinct focus\nareas for the Black, Asian, and White British ethnic groups. The study\ndemonstrates the effectiveness of topic modelling and NLP techniques in\nanalysing maternity incident investigation reports and highlighting disparities\nin care. The findings emphasise the crucial role of advanced data analysis in\nimproving maternity care quality and equity.", "paper_summary_zh": "本研究應用自然語言處理技術，包括潛在狄利克雷分配，分析醫療保健安全調查局的匿名產婦事件調查報告。這些報告經過預處理、使用安全情報研究分類法註解，以及主題建模，以找出普遍的主題並找出不同族群在產前照護的差異。結合離線和線上方法，以確保資料保護，同時進行進階分析，使用 Claude 3 Opus 語言模型對敏感資料進行離線處理，對非敏感資料進行線上處理。採用互動主題分析和語意網路視覺化，以萃取和顯示主題主題，並視覺化關鍵字之間的語意關係。分析顯示不同族群之間的照護差異，黑人、亞洲人和白人英國人族群的關注領域不同。本研究證明了主題建模和自然語言處理技術在分析產婦事件調查報告和強調照護差異方面的有效性。研究結果強調了進階資料分析在提升產前照護品質和公平性方面的關鍵角色。", "author": "Georgina Cosma et.al.", "authors": "Georgina Cosma, Mohit Kumar Singh, Patrick Waterson, Gyuchan Thomas Jun, Jonathan Back", "id": "2407.08328v1", "paper_url": "http://arxiv.org/abs/2407.08328v1", "repo": "null"}}