{"2406.18872": {"publish_time": "2024-06-27", "title": "Efficacy of Language Model Self-Play in Non-Zero-Sum Games", "paper_summary": "Game-playing agents like AlphaGo have achieved superhuman performance through\nself-play, which is theoretically guaranteed to yield optimal policies in\ncompetitive games. However, most language tasks are partially or fully\ncooperative, so it is an open question whether techniques like self-play can\neffectively be used to improve language models. We empirically investigate this\nquestion in a negotiation game setting known as Deal or No Deal (DoND).\nCrucially, the objective in DoND can be modified to produce a fully cooperative\ngame, a strictly competitive one, or anything in between. We finetune language\nmodels in self-play over multiple rounds of filtered behavior cloning in DoND\nfor each of these objectives. Contrary to expectations, we find that language\nmodel self-play leads to significant performance gains in both cooperation and\ncompetition with humans, suggesting that self-play and related techniques have\npromise despite a lack of theoretical guarantees.", "paper_summary_zh": "像 AlphaGo 等遊戲代理已透過自玩遊戲取得超人類的表現，理論上保證在競爭遊戲中產生最佳策略。然而，大多數語言任務是部分或完全合作的，因此自玩遊戲等技術是否能有效用於改善語言模型，仍是一個開放性的問題。我們在稱為「Deal or No Deal」(DoND) 的協商遊戲設定中，對此問題進行實證調查。至關重要的是，DoND 中的目標可以修改為產生完全合作的遊戲、嚴格的競爭遊戲，或介於兩者之間的任何遊戲。我們在 DoND 中對每個目標進行多輪過濾行為複製的自玩遊戲，微調語言模型。與預期相反，我們發現語言模型自玩遊戲會在與人類的合作和競爭中帶來顯著的效能提升，這表示儘管缺乏理論保證，自玩遊戲和相關技術仍有前景。", "author": "Austen Liao et.al.", "authors": "Austen Liao, Nicholas Tomlin, Dan Klein", "id": "2406.18872v1", "paper_url": "http://arxiv.org/abs/2406.18872v1", "repo": "null"}}