{"2406.08695": {"publish_time": "2024-06-12", "title": "Global AI Governance in Healthcare: A Cross-Jurisdictional Regulatory Analysis", "paper_summary": "Artificial Intelligence (AI) is being adopted across the world and promises a\nnew revolution in healthcare. While AI-enabled medical devices in North America\ndominate 42.3% of the global market, the use of AI-enabled medical devices in\nother countries is still a story waiting to be unfolded. We aim to delve deeper\ninto global regulatory approaches towards AI use in healthcare, with a focus on\nhow common themes are emerging globally. We compare these themes to the World\nHealth Organization's (WHO) regulatory considerations and principles on ethical\nuse of AI for healthcare applications. Our work seeks to take a global\nperspective on AI policy by analyzing 14 legal jurisdictions including\ncountries representative of various regions in the world (North America, South\nAmerica, South East Asia, Middle East, Africa, Australia, and the\nAsia-Pacific). Our eventual goal is to foster a global conversation on the\nethical use of AI in healthcare and the regulations that will guide it. We\npropose solutions to promote international harmonization of AI regulations and\nexamine the requirements for regulating generative AI, using China and\nSingapore as examples of countries with well-developed policies in this area.", "paper_summary_zh": "人工智能（AI）正在全球范围内得到採用，並承諾在醫療保健領域掀起一場新的革命。儘管北美的人工智慧醫療設備主導了全球市場的 42.3%，但其他國家/地區的人工智慧醫療設備的使用情況仍是一個有待展開的故事。我們旨在深入探討全球對醫療保健中 AI 使用的法規方法，重點關注全球範圍內如何出現共同的主題。我們將這些主題與世界衛生組織 (WHO) 對醫療保健應用中 AI 道德使用的法規考量和原則進行比較。我們的研究旨在通過分析 14 個法域（包括代表世界各地不同地區的國家/地區（北美、南美、東南亞、中東、非洲、澳大利亞和亞太地區））來對 AI 政策採取全球觀點。我們的最終目標是促進關於醫療保健中 AI 道德使用和將指導它的法規的全球對話。我們提出解決方案以促進 AI 法規的國際協調，並以中國和新加坡為例，探討了對生成式 AI 進行監管的要求，這些國家/地區在這一領域擁有完善的政策。", "author": "Attrayee Chakraborty et.al.", "authors": "Attrayee Chakraborty, Mandar Karhade", "id": "2406.08695v1", "paper_url": "http://arxiv.org/abs/2406.08695v1", "repo": "null"}}