{"2407.05521": {"publish_time": "2024-07-07", "title": "Accelerating MRI Uncertainty Estimation with Mask-based Bayesian Neural Network", "paper_summary": "Accurate and reliable Magnetic Resonance Imaging (MRI) analysis is\nparticularly important for adaptive radiotherapy, a recent medical advance\ncapable of improving cancer diagnosis and treatment. Recent studies have shown\nthat IVIM-NET, a deep neural network (DNN), can achieve high accuracy in MRI\nanalysis, indicating the potential of deep learning to enhance diagnostic\ncapabilities in healthcare. However, IVIM-NET does not provide calibrated\nuncertainty information needed for reliable and trustworthy predictions in\nhealthcare. Moreover, the expensive computation and memory demands of IVIM-NET\nreduce hardware performance, hindering widespread adoption in realistic\nscenarios. To address these challenges, this paper proposes an\nalgorithm-hardware co-optimization flow for high-performance and reliable MRI\nanalysis. At the algorithm level, a transformation design flow is introduced to\nconvert IVIM-NET to a mask-based Bayesian Neural Network (BayesNN),\nfacilitating reliable and efficient uncertainty estimation. At the hardware\nlevel, we propose an FPGA-based accelerator with several hardware\noptimizations, such as mask-zero skipping and operation reordering.\nExperimental results demonstrate that our co-design approach can satisfy the\nuncertainty requirements of MRI analysis, while achieving 7.5 times and 32.5\ntimes speedup on an Xilinx VU13P FPGA compared to GPU and CPU implementations\nwith reduced power consumption.", "paper_summary_zh": "精準可靠的磁振造影 (MRI) 分析對於適應性放射治療特別重要，這是一種近期醫療進展，能夠改善癌症診斷和治療。最近的研究顯示，深度神經網路 (DNN) 的 IVIM-NET 能在 MRI 分析中達到高準確度，顯示深度學習有潛力增強醫療保健中的診斷能力。然而，IVIM-NET 沒有提供在醫療保健中進行可靠且值得信賴的預測所需的校準不確定性資訊。此外，IVIM-NET 昂貴的運算和記憶體需求降低了硬體效能，阻礙了在實際場景中的廣泛採用。為了解決這些挑戰，本文提出了一種演算法與硬體共同最佳化的流程，以進行高性能且可靠的 MRI 分析。在演算法層級，引入了轉換設計流程，將 IVIM-NET 轉換為基於遮罩的貝氏神經網路 (BayesNN)，促進可靠且有效的非確定性估計。在硬體層級，我們提出了一種基於 FPGA 的加速器，具備多項硬體最佳化，例如遮罩零跳過和運算重新排序。實驗結果證明，我們的共同設計方法可以滿足 MRI 分析的不確定性需求，同時在 Xilinx VU13P FPGA 上實現比 GPU 和 CPU 實作快上 7.5 倍和 32.5 倍的速度，且功耗降低。", "author": "Zehuan Zhang et.al.", "authors": "Zehuan Zhang, Matej Genci, Hongxiang Fan, Andreas Wetscherek, Wayne Luk", "id": "2407.05521v1", "paper_url": "http://arxiv.org/abs/2407.05521v1", "repo": "null"}}