{"2407.16347": {"publish_time": "2024-07-23", "title": "FACTTRACK: Time-Aware World State Tracking in Story Outlines", "paper_summary": "While accurately detecting and correcting factual contradictions in language\nmodel outputs has become increasingly important as their capabilities improve,\ndoing so is highly challenging. We propose a novel method, FACTTRACK, for\ntracking atomic facts and addressing factual contradictions. Crucially,\nFACTTRACK also maintains time-aware validity intervals for each fact, allowing\nfor change over time. At a high level, FACTTRACK consists of a four-step\npipeline to update a world state data structure for each new event: (1)\ndecompose the event into directional atomic facts; (2) determine the validity\ninterval of each atomic fact using the world state; (3) detect contradictions\nwith existing facts in the world state; and finally (4) add new facts to the\nworld state and update existing atomic facts. When we apply FACTTRACK to\ncontradiction detection on structured story outlines, we find that FACTTRACK\nusing LLaMA2-7B-Chat substantially outperforms a fair baseline using\nLLaMA2-7B-Chat, and achieves performance comparable to a GPT4 baseline.\nMoreover, when using GPT4, FACTTRACK significantly outperforms the GPT4\nbaseline.", "paper_summary_zh": "随着语言模型输出中事实矛盾的准确检测和纠正变得越来越重要，执行此操作极具挑战性。我们提出了一种新方法 FACTTRACK，用于跟踪原子事实并解决事实矛盾。至关重要的是，FACTTRACK 还为每个事实维护时间感知的有效性间隔，从而允许随着时间的推移而发生变化。在高层次上，FACTTRACK 由一个四步管道组成，用于为每个新事件更新世界状态数据结构：(1) 将事件分解为方向原子事实；(2) 使用世界状态确定每个原子事实的有效性间隔；(3) 检测与世界状态中现有事实的矛盾；最后 (4) 将新事实添加到世界状态并更新现有的原子事实。当我们将 FACTTRACK 应用于结构化故事大纲中的矛盾检测时，我们发现使用 LLaMA2-7B-Chat 的 FACTTRACK 明显优于使用 LLaMA2-7B-Chat 的公平基线，并且实现了与 GPT4 基线相当的性能。此外，在使用 GPT4 时，FACTTRACK 明显优于 GPT4 基线。", "author": "Zhiheng Lyu et.al.", "authors": "Zhiheng Lyu, Kevin Yang, Lingpeng Kong, Daniel Klein", "id": "2407.16347v1", "paper_url": "http://arxiv.org/abs/2407.16347v1", "repo": "null"}}