{"2501.05040": {"publish_time": "2025-01-09", "title": "SWE-Fixer: Training Open-Source LLMs for Effective and Efficient GitHub Issue Resolution", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable proficiency across\na variety of complex tasks. One significant application of LLMs is in tackling\nsoftware engineering challenges, particularly in resolving real-world tasks on\nGitHub by fixing code based on the issues reported by the users. However, many\ncurrent approaches rely on proprietary LLMs, which limits reproducibility,\naccessibility, and transparency. The critical components of LLMs for addressing\nsoftware engineering issues and how their capabilities can be effectively\nenhanced remain unclear. To address these challenges, we introduce SWE-Fixer, a\nnovel open-source LLM designed to effectively and efficiently resolve GitHub\nissues. SWE-Fixer comprises two essential modules: a code file retrieval module\nand a code editing module. The retrieval module employs BM25 along with a\nlightweight LLM model to achieve coarse-to-fine file retrieval. Subsequently,\nthe code editing module utilizes the other LLM model to generate patches for\nthe identified files. Then, to mitigate the lack of publicly available\ndatasets, we compile an extensive dataset that includes 110K GitHub issues\nalong with their corresponding patches, and train the two modules of SWE-Fixer\nseparately. We assess our approach on the SWE-Bench Lite and Verified\nbenchmarks, achieving state-of-the-art performance among open-source models\nwith scores of 23.3% and 30.2%, respectively. These outcomes highlight the\nefficacy of our approach. We will make our model, dataset, and code publicly\navailable at https://github.com/InternLM/SWE-Fixer.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種複雜任務中展現出非凡的能力。LLM 的一項重要應用是解決軟體工程挑戰，特別是透過修復使用者回報問題中的程式碼，來解決 GitHub 上的實際任務。然而，許多現有方法依賴於專有 LLM，這限制了可複製性、可存取性和透明度。LLM 解決軟體工程問題的重要組成部分及其能力如何有效增強仍不清楚。為了應對這些挑戰，我們引入了 SWE-Fixer，這是一個新穎的開源 LLM，旨在有效且高效地解決 GitHub 問題。SWE-Fixer 包含兩個必要的模組：程式碼檔案擷取模組和程式碼編輯模組。擷取模組採用 BM25 以及輕量級 LLM 模型，以實現由粗到細的檔案擷取。隨後，程式碼編輯模組利用另一個 LLM 模型，為識別的檔案產生修補程式。接著，為了減輕公開可用資料集的不足，我們編譯了一個包含 110K 個 GitHub 問題及其對應修補程式的廣泛資料集，並分別訓練 SWE-Fixer 的兩個模組。我們在 SWE-Bench Lite 和 Verified 評量基準上評估了我們的做法，在開源模型中取得了最先進的效能，分別獲得 23.3% 和 30.2% 的分數。這些成果突顯了我們方法的有效性。我們將在 https://github.com/InternLM/SWE-Fixer 公開我們的模型、資料集和程式碼。", "author": "Chengxing Xie et.al.", "authors": "Chengxing Xie, Bowen Li, Chang Gao, He Du, Wai Lam, Difan Zou, Kai Chen", "id": "2501.05040v1", "paper_url": "http://arxiv.org/abs/2501.05040v1", "repo": "null"}}