{"2407.11566": {"publish_time": "2024-07-16", "title": "TGIF: Text-Guided Inpainting Forgery Dataset", "paper_summary": "Digital image manipulation has become increasingly accessible and realistic\nwith the advent of generative AI technologies. Recent developments allow for\ntext-guided inpainting, making sophisticated image edits possible with minimal\neffort. This poses new challenges for digital media forensics. For example,\ndiffusion model-based approaches could either splice the inpainted region into\nthe original image, or regenerate the entire image. In the latter case,\ntraditional image forgery localization (IFL) methods typically fail. This paper\nintroduces the Text-Guided Inpainting Forgery (TGIF) dataset, a comprehensive\ncollection of images designed to support the training and evaluation of image\nforgery localization and synthetic image detection (SID) methods. The TGIF\ndataset includes approximately 80k forged images, originating from popular\nopen-source and commercial methods; SD2, SDXL, and Adobe Firefly. Using this\ndata, we benchmark several state-of-the-art IFL and SID methods. Whereas\ntraditional IFL methods can detect spliced images, they fail to detect\nregenerated inpainted images. Moreover, traditional SID may detect the\nregenerated inpainted images to be fake, but cannot localize the inpainted\narea. Finally, both types of methods fail when exposed to stronger compression,\nwhile they are less robust to modern compression algorithms, such as WEBP. As\nsuch, this work demonstrates the inefficiency of state-of-the-art detectors on\nlocal manipulations performed by modern generative approaches, and aspires to\nhelp with the development of more capable IFL and SID methods. The dataset can\nbe downloaded at https://github.com/IDLabMedia/tgif-dataset.", "paper_summary_zh": "數位影像處理隨著生成式 AI 技術的出現，變得越來越容易取得且逼真。最近的發展允許文字引導的填補，讓複雜的影像編輯變得輕而易舉。這為數位媒體鑑識帶來了新的挑戰。例如，基於擴散模型的方法可以將填補區域拼接至原始影像，或重新產生整張影像。在後者的情況下，傳統的影像偽造定位 (IFL) 方法通常會失敗。本文介紹了文字引導填補偽造 (TGIF) 資料集，這是一個全面的影像集合，旨在支援影像偽造定位和合成影像偵測 (SID) 方法的訓練和評估。TGIF 資料集包含約 80k 張偽造影像，源自於熱門的開源和商業方法；SD2、SDXL 和 Adobe Firefly。使用這些資料，我們評定了數種最先進的 IFL 和 SID 方法。雖然傳統的 IFL 方法可以偵測拼接影像，但無法偵測重新產生的填補影像。此外，傳統的 SID 雖然可以偵測重新產生的填補影像為假，但無法定位填補區域。最後，這兩種方法在遇到較強的壓縮時都會失敗，而它們對現代壓縮演算法（例如 WEBP）的魯棒性較差。因此，這項研究證明了最先進的偵測器對於現代生成方法執行的局部處理的效率低下，並希望有助於開發更強大的 IFL 和 SID 方法。該資料集可於 https://github.com/IDLabMedia/tgif-dataset 下載。", "author": "Hannes Mareen et.al.", "authors": "Hannes Mareen, Dimitrios Karageorgiou, Glenn Van Wallendael, Peter Lambert, Symeon Papadopoulos", "id": "2407.11566v1", "paper_url": "http://arxiv.org/abs/2407.11566v1", "repo": "https://github.com/idlabmedia/tgif-dataset"}}