{"2410.02684": {"publish_time": "2024-10-03", "title": "HiddenGuard: Fine-Grained Safe Generation with Specialized Representation Router", "paper_summary": "As Large Language Models (LLMs) grow increasingly powerful, ensuring their\nsafety and alignment with human values remains a critical challenge. Ideally,\nLLMs should provide informative responses while avoiding the disclosure of\nharmful or sensitive information. However, current alignment approaches, which\nrely heavily on refusal strategies, such as training models to completely\nreject harmful prompts or applying coarse filters are limited by their binary\nnature. These methods either fully deny access to information or grant it\nwithout sufficient nuance, leading to overly cautious responses or failures to\ndetect subtle harmful content. For example, LLMs may refuse to provide basic,\npublic information about medication due to misuse concerns. Moreover, these\nrefusal-based methods struggle to handle mixed-content scenarios and lack the\nability to adapt to context-dependent sensitivities, which can result in\nover-censorship of benign content. To overcome these challenges, we introduce\nHiddenGuard, a novel framework for fine-grained, safe generation in LLMs.\nHiddenGuard incorporates Prism (rePresentation Router for In-Stream\nModeration), which operates alongside the LLM to enable real-time, token-level\ndetection and redaction of harmful content by leveraging intermediate hidden\nstates. This fine-grained approach allows for more nuanced, context-aware\nmoderation, enabling the model to generate informative responses while\nselectively redacting or replacing sensitive information, rather than outright\nrefusal. We also contribute a comprehensive dataset with token-level\nfine-grained annotations of potentially harmful information across diverse\ncontexts. Our experiments demonstrate that HiddenGuard achieves over 90% in F1\nscore for detecting and redacting harmful content while preserving the overall\nutility and informativeness of the model's responses.", "paper_summary_zh": "隨著大型語言模型 (LLM) 變得越來越強大，確保其安全性和與人類價值觀的一致性仍然是一項嚴峻的挑戰。理想情況下，LLM 應提供有意義的回應，同時避免揭露有害或敏感資訊。然而，當前的一致性方法過於依賴拒絕策略，例如訓練模型完全拒絕有害提示或套用粗略的過濾器，而受到其二進位制的限制。這些方法不是完全拒絕存取資訊，就是沒有足夠的細微差別就授予存取，導致過於謹慎的回應或無法偵測到微妙的有害內容。例如，LLM 可能拒絕提供有關藥物的基本公開資訊，因為擔心會被濫用。此外，這些基於拒絕的方法難以處理混合內容的情境，並且缺乏適應依賴於脈絡的敏感性的能力，這可能導致過度審查良性的內容。為了克服這些挑戰，我們引入了 HiddenGuard，一個適用於 LLM 的創新且細緻且安全的生成架構。HiddenGuard 結合了 Prism（串流內審核的表示路由器），與 LLM 並行運作，透過利用中間的隱藏狀態，實現即時的、標記層級的偵測和刪除有害內容。這種細緻的方法允許更細緻、有脈絡意識的審核，使模型能夠產生有意義的回應，同時有選擇地刪除或替換敏感資訊，而不是直接拒絕。我們還貢獻了一個全面的資料集，其中包含在不同脈絡中，標記層級的細緻註解，說明潛在有害的資訊。我們的實驗表明，HiddenGuard 在 F1 得分上達到了 90% 以上，用於偵測和刪除有害內容，同時保留模型回應的整體效用和資訊性。", "author": "Lingrui Mei et.al.", "authors": "Lingrui Mei, Shenghua Liu, Yiwei Wang, Baolong Bi, Ruibin Yuan, Xueqi Cheng", "id": "2410.02684v1", "paper_url": "http://arxiv.org/abs/2410.02684v1", "repo": "https://github.com/Meirtz/HiddenGuard"}}