{"2501.18801": {"publish_time": "2025-01-30", "title": "Every Image Listens, Every Image Dances: Music-Driven Image Animation", "paper_summary": "Image animation has become a promising area in multimodal research, with a\nfocus on generating videos from reference images. While prior work has largely\nemphasized generic video generation guided by text, music-driven dance video\ngeneration remains underexplored. In this paper, we introduce MuseDance, an\ninnovative end-to-end model that animates reference images using both music and\ntext inputs. This dual input enables MuseDance to generate personalized videos\nthat follow text descriptions and synchronize character movements with the\nmusic. Unlike existing approaches, MuseDance eliminates the need for complex\nmotion guidance inputs, such as pose or depth sequences, making flexible and\ncreative video generation accessible to users of all expertise levels. To\nadvance research in this field, we present a new multimodal dataset comprising\n2,904 dance videos with corresponding background music and text descriptions.\nOur approach leverages diffusion-based methods to achieve robust\ngeneralization, precise control, and temporal consistency, setting a new\nbaseline for the music-driven image animation task.", "paper_summary_zh": "影像動畫已成為多模態研究中一個有前景的領域，重點在於從參考影像中產生影片。儘管先前的研究在很大程度上強調由文字引導的通用影片產生，但由音樂驅動的舞蹈影片產生仍未被充分探討。在本文中，我們介紹了 MuseDance，一個創新的端到端模型，它使用音樂和文字輸入對參考影像進行動畫處理。這種雙重輸入使 MuseDance 能夠產生符合文字描述並將角色動作與音樂同步的個人化影片。與現有方法不同，MuseDance 消除了對複雜動作指導輸入（例如姿勢或深度序列）的需求，讓各個專業水準的使用者都能輕鬆進行靈活且有創意的影片產生。為了推進此領域的研究，我們提出了包含 2,904 個舞蹈影片的新多模態資料集，其中包含對應的背景音樂和文字描述。我們的做法利用基於擴散的方法來實現穩健的泛化、精確控制和時間一致性，為由音樂驅動的影像動畫任務設定了新的基準。", "author": "Zhikang Dong et.al.", "authors": "Zhikang Dong, Weituo Hao, Ju-Chiang Wang, Peng Zhang, Pawel Polak", "id": "2501.18801v1", "paper_url": "http://arxiv.org/abs/2501.18801v1", "repo": "null"}}