{"2501.18750": {"publish_time": "2025-01-30", "title": "Revisiting Projection-based Data Transfer for Cross-Lingual Named Entity Recognition in Low-Resource Languages", "paper_summary": "Cross-lingual Named Entity Recognition (NER) leverages knowledge transfer\nbetween languages to identify and classify named entities, making it\nparticularly useful for low-resource languages. We show that the data-based\ncross-lingual transfer method is an effective technique for crosslingual NER\nand can outperform multilingual language models for low-resource languages.\nThis paper introduces two key enhancements to the annotation projection step in\ncross-lingual NER for low-resource languages. First, we explore refining word\nalignments using back-translation to improve accuracy. Second, we present a\nnovel formalized projection approach of matching source entities with extracted\ntarget candidates. Through extensive experiments on two datasets spanning 57\nlanguages, we demonstrated that our approach surpasses existing projectionbased\nmethods in low-resource settings. These findings highlight the robustness of\nprojection-based data transfer as an alternative to model-based methods for\ncrosslingual named entity recognition in lowresource languages.", "paper_summary_zh": "跨語言命名實體辨識 (NER) 利用語言之間的知識轉移來辨識和分類命名實體，這對於低資源語言特別有用。我們展示基於資料的跨語言轉移方法是跨語言 NER 的一種有效技術，並且可以優於多語言語言模型的低資源語言。本文介紹了低資源語言跨語言 NER 中註解投影步驟的兩項關鍵改進。首先，我們探討使用反向翻譯來改善準確度，以改善詞彙對齊。其次，我們提出一個新的形式化投影方法，用於將來源實體與提取的目標候選項目相匹配。透過對橫跨 57 種語言的兩個資料集進行廣泛的實驗，我們證明了我們的做法在低資源設定中超越了現有的基於投影的方法。這些發現突顯了基於投影的資料轉移作為低資源語言中基於模型方法的跨語言命名實體辨識的替代方案的穩健性。", "author": "Andrei Politov et.al.", "authors": "Andrei Politov, Oleh Shkalikov, René Jäkel, Michael Färber", "id": "2501.18750v1", "paper_url": "http://arxiv.org/abs/2501.18750v1", "repo": "https://github.com/cross-lingual-ner/projection-data-transfer-cross-lingual-ner"}}