{"2410.11371": {"publish_time": "2024-10-15", "title": "Learning from Imperfect Data: Towards Efficient Knowledge Distillation of Autoregressive Language Models for Text-to-SQL", "paper_summary": "Large Language Models (LLMs) have shown promising performance in text-to-SQL,\nwhich involves translating natural language questions into SQL queries.\nHowever, current text-to-SQL LLMs are computationally expensive and challenging\nto deploy in real-world applications, highlighting the importance of\ncompressing them. To achieve this goal, knowledge distillation (KD) is a common\napproach, which aims to distill the larger teacher model into a smaller student\nmodel. While numerous KD methods for autoregressive LLMs have emerged recently,\nit is still under-explored whether they work well in complex text-to-SQL\nscenarios. To this end, we conduct a series of analyses and reveal that these\nKD methods generally fall short in balancing performance and efficiency. In\nresponse to this problem, we propose to improve the KD with Imperfect Data,\nnamely KID, which effectively boosts the performance without introducing much\ntraining budget. The core of KID is to efficiently mitigate the\ntraining-inference mismatch by simulating the cascading effect of inference in\nthe imperfect training data. Extensive experiments on 5 text-to-SQL benchmarks\nshow that, KID can not only achieve consistent and significant performance\ngains (up to +5.83% average score) across all model types and sizes, but also\neffectively improve the training efficiency.", "paper_summary_zh": "大型語言模型（LLM）在文本轉 SQL 中展現了有前途的表現，其中涉及將自然語言問題轉換為 SQL 查詢。然而，目前的文本轉 SQL LLM 在運算上很昂貴，且難以部署在真實世界的應用中，這凸顯了壓縮它們的重要性。為了達成這個目標，知識蒸餾（KD）是一種常見的方法，其目標是將較大的教師模型蒸餾成較小的學生模型。儘管最近出現了許多針對自迴歸 LLM 的 KD 方法，但它們是否適用於複雜的文本轉 SQL 場景仍有待探討。為此，我們進行了一系列分析，並揭示這些 KD 方法通常無法在效能和效率之間取得平衡。為了應對這個問題，我們提議使用不完美資料改善 KD，即 KID，它有效地提升了效能，而不會引入太多訓練預算。KID 的核心是透過模擬不完美訓練資料中推論的層疊效應，有效地減輕訓練推論不匹配的問題。在 5 個文本轉 SQL 基準上的廣泛實驗顯示，KID 不僅可以在所有模型類型和規模上實現一致且顯著的效能提升（平均分數提升達 +5.83%），還能有效提升訓練效率。", "author": "Qihuang Zhong et.al.", "authors": "Qihuang Zhong, Kunfeng Chen, Liang Ding, Juhua Liu, Bo Du, Dacheng Tao", "id": "2410.11371v1", "paper_url": "http://arxiv.org/abs/2410.11371v1", "repo": "null"}}