{"2411.04890": {"publish_time": "2024-11-07", "title": "GUI Agents with Foundation Models: A Comprehensive Survey", "paper_summary": "Recent advances in foundation models, particularly Large Language Models\n(LLMs) and Multimodal Large Language Models (MLLMs), facilitate intelligent\nagents being capable of performing complex tasks. By leveraging the ability of\n(M)LLMs to process and interpret Graphical User Interfaces (GUIs), these agents\ncan autonomously execute user instructions by simulating human-like\ninteractions such as clicking and typing. This survey consolidates recent\nresearch on (M)LLM-based GUI agents, highlighting key innovations in data,\nframeworks, and applications. We begin by discussing representative datasets\nand benchmarks. Next, we summarize a unified framework that captures the\nessential components used in prior research, accompanied by a taxonomy.\nAdditionally, we explore commercial applications of (M)LLM-based GUI agents.\nDrawing from existing work, we identify several key challenges and propose\nfuture research directions. We hope this paper will inspire further\ndevelopments in the field of (M)LLM-based GUI agents.", "paper_summary_zh": "最近在基礎模型的進展，特別是大型語言模型 (LLM) 和多模態大型語言模型 (MLLM)，促進智能代理能夠執行複雜的任務。藉由運用 (M)LLM 處理和詮釋圖形使用者介面 (GUI) 的能力，這些代理可以透過模擬點擊和輸入等類似人類的互動，自動執行使用者的指令。此調查彙整了最近關於 (M)LLM 為基礎的 GUI 代理的研究，重點說明了資料、架構和應用程式的關鍵創新。我們從討論具代表性的資料集和基準開始。接著，我們摘要一個統一的架構，其中包含先前研究中使用的基本元件，並附上分類法。此外，我們探討 (M)LLM 為基礎的 GUI 代理的商業應用。根據現有工作，我們找出幾個關鍵挑戰，並提出未來的研究方向。我們希望這篇論文能激發 (M)LLM 為基礎的 GUI 代理領域的進一步發展。", "author": "Shuai Wang et.al.", "authors": "Shuai Wang, Weiwen Liu, Jingxuan Chen, Weinan Gan, Xingshan Zeng, Shuai Yu, Xinlong Hao, Kun Shao, Yasheng Wang, Ruiming Tang", "id": "2411.04890v1", "paper_url": "http://arxiv.org/abs/2411.04890v1", "repo": "null"}}