{"2501.02014": {"publish_time": "2025-01-02", "title": "Machine Learning-Based Differential Diagnosis of Parkinson's Disease Using Kinematic Feature Extraction and Selection", "paper_summary": "Parkinson's disease (PD), the second most common neurodegenerative disorder,\nis characterized by dopaminergic neuron loss and the accumulation of abnormal\nsynuclein. PD presents both motor and non-motor symptoms that progressively\nimpair daily functioning. The severity of these symptoms is typically assessed\nusing the MDS-UPDRS rating scale, which is subjective and dependent on the\nphysician's experience. Additionally, PD shares symptoms with other\nneurodegenerative diseases, such as progressive supranuclear palsy (PSP) and\nmultiple system atrophy (MSA), complicating accurate diagnosis. To address\nthese diagnostic challenges, we propose a machine learning-based system for\ndifferential diagnosis of PD, PSP, MSA, and healthy controls (HC). This system\nutilizes a kinematic feature-based hierarchical feature extraction and\nselection approach. Initially, 18 kinematic features are extracted, including\ntwo newly proposed features: Thumb-to-index vector velocity and acceleration,\nwhich provide insights into motor control patterns. In addition, 41 statistical\nfeatures were extracted here from each kinematic feature, including some new\napproaches such as Average Absolute Change, Rhythm, Amplitude, Frequency,\nStandard Deviation of Frequency, and Slope. Feature selection is performed\nusing One-way ANOVA to rank features, followed by Sequential Forward Floating\nSelection (SFFS) to identify the most relevant ones, aiming to reduce the\ncomputational complexity. The final feature set is used for classification,\nachieving a classification accuracy of 66.67% for each dataset and 88.89% for\neach patient, with particularly high performance for the MSA and HC groups\nusing the SVM algorithm. This system shows potential as a rapid and accurate\ndiagnostic tool in clinical practice, though further data collection and\nrefinement are needed to enhance its reliability.", "paper_summary_zh": "帕金森氏症（PD）是第二常见的脑神经退化性疾病，\n其特征是多巴胺能神经元丧失和异常α-突触核蛋白的积累。PD 同时出现运动和非运动症状，这些症状会逐渐损害日常功能。这些症状的严重程度通常使用 MDS-UPDRS 评定量表进行评估，该量表是主观的，并且依赖于医生的经验。此外，PD 与其他神经退化性疾病（例如进行性核上性麻痹 (PSP) 和多系统萎缩 (MSA)）有相同的症状，这使得准确诊断变得复杂。为了应对这些诊断挑战，我们提出了一种基于机器学习的系统，用于 PD、PSP、MSA 和健康对照 (HC) 的鉴别诊断。该系统利用基于运动学特征的分层特征提取和选择方法。最初，提取了 18 个运动学特征，包括两个新提出的特征：拇指到食指的矢量速度和加速度，它们提供了对运动控制模式的见解。此外，此处从每个运动学特征中提取了 41 个统计特征，包括一些新方法，例如平均绝对变化、节奏、振幅、频率、频率标准差和斜率。使用单向方差分析对特征进行排名，然后使用顺序前向浮动选择 (SFFS) 识别最相关的特征，以降低计算复杂度。最终特征集用于分类，对于每个数据集，分类准确率达到 66.67%，对于每个患者，准确率达到 88.89%，使用 SVM 算法时，MSA 和 HC 组的性能尤其高。该系统显示出作为临床实践中快速且准确的诊断工具的潜力，尽管需要进一步收集数据和改进以增强其可靠性。", "author": "Masahiro Matsumoto et.al.", "authors": "Masahiro Matsumoto, Abu Saleh Musa Miah, Nobuyoshi Asai, Jungpil Shin", "id": "2501.02014v1", "paper_url": "http://arxiv.org/abs/2501.02014v1", "repo": "null"}}