{"2406.03445": {"publish_time": "2024-06-05", "title": "Pre-trained Large Language Models Use Fourier Features to Compute Addition", "paper_summary": "Pre-trained large language models (LLMs) exhibit impressive mathematical\nreasoning capabilities, yet how they compute basic arithmetic, such as\naddition, remains unclear. This paper shows that pre-trained LLMs add numbers\nusing Fourier features -- dimensions in the hidden state that represent numbers\nvia a set of features sparse in the frequency domain. Within the model, MLP and\nattention layers use Fourier features in complementary ways: MLP layers\nprimarily approximate the magnitude of the answer using low-frequency features,\nwhile attention layers primarily perform modular addition (e.g., computing\nwhether the answer is even or odd) using high-frequency features. Pre-training\nis crucial for this mechanism: models trained from scratch to add numbers only\nexploit low-frequency features, leading to lower accuracy. Introducing\npre-trained token embeddings to a randomly initialized model rescues its\nperformance. Overall, our analysis demonstrates that appropriate pre-trained\nrepresentations (e.g., Fourier features) can unlock the ability of Transformers\nto learn precise mechanisms for algorithmic tasks.", "paper_summary_zh": "預先訓練的大型語言模型 (LLM) 展現出令人印象深刻的數學推理能力，但它們如何計算基本算術，例如加法，仍然不清楚。本文顯示預先訓練的 LLM 使用傅立葉特徵來加數字——隱藏狀態中的維度，透過一組在頻域中稀疏的特徵來表示數字。在模型中，MLP 和注意力層以互補的方式使用傅立葉特徵：MLP 層主要使用低頻率特徵來近似答案的幅度，而注意力層主要使用高頻率特徵來執行模組加法（例如，計算答案是偶數還是奇數）。預訓練對於這個機制至關重要：從頭訓練的模型只能使用低頻率特徵來加數字，導致準確度較低。將預先訓練的符號嵌入引入隨機初始化的模型可以挽救其效能。總體而言，我們的分析表明適當的預先訓練表示（例如，傅立葉特徵）可以解鎖 Transformer 學習演算法任務的精確機制的可能性。", "author": "Tianyi Zhou et.al.", "authors": "Tianyi Zhou, Deqing Fu, Vatsal Sharan, Robin Jia", "id": "2406.03445v1", "paper_url": "http://arxiv.org/abs/2406.03445v1", "repo": "null"}}