{"2412.16135": {"publish_time": "2024-12-20", "title": "Can LLMs Obfuscate Code? A Systematic Analysis of Large Language Models into Assembly Code Obfuscation", "paper_summary": "Malware authors often employ code obfuscations to make their malware harder\nto detect. Existing tools for generating obfuscated code often require access\nto the original source code (e.g., C++ or Java), and adding new obfuscations is\na non-trivial, labor-intensive process. In this study, we ask the following\nquestion: Can Large Language Models (LLMs) potentially generate a new\nobfuscated assembly code? If so, this poses a risk to anti-virus engines and\npotentially increases the flexibility of attackers to create new obfuscation\npatterns. We answer this in the affirmative by developing the MetamorphASM\nbenchmark comprising MetamorphASM Dataset (MAD) along with three code\nobfuscation techniques: dead code, register substitution, and control flow\nchange. The MetamorphASM systematically evaluates the ability of LLMs to\ngenerate and analyze obfuscated code using MAD, which contains 328,200\nobfuscated assembly code samples. We release this dataset and analyze the\nsuccess rate of various LLMs (e.g., GPT-3.5/4, GPT-4o-mini, Starcoder,\nCodeGemma, CodeLlama, CodeT5, and LLaMA 3.1) in generating obfuscated assembly\ncode. The evaluation was performed using established information-theoretic\nmetrics and manual human review to ensure correctness and provide the\nfoundation for researchers to study and develop remediations to this risk. The\nsource code can be found at the following GitHub link:\nhttps://github.com/mohammadi-ali/MetamorphASM.", "paper_summary_zh": "<paragraph>惡意軟體作者經常使用程式碼混淆技術，讓他們的惡意軟體更難被偵測到。現有的混淆程式碼產生工具通常需要取得原始原始碼（例如，C++ 或 Java），而新增新的混淆技術是一個不平凡且費工的過程。在這項研究中，我們提出以下問題：大型語言模型 (LLM) 是否有可能產生新的混淆組合碼？如果是這樣，這對防毒軟體引擎構成風險，並可能增加攻擊者建立新的混淆模式的靈活性。我們透過開發包含 MetamorphASM 資料集 (MAD) 的 MetamorphASM 基準，以及三種程式碼混淆技術：無效程式碼、暫存器替換和控制流程變更，來肯定地回答這個問題。MetamorphASM 系統性地評估 LLM 使用 MAD 產生和分析混淆程式碼的能力，其中包含 328,200 個混淆組合碼範例。我們釋出此資料集，並分析各種 LLM（例如，GPT-3.5/4、GPT-4o-mini、Starcoder、CodeGemma、CodeLlama、CodeT5 和 LLaMA 3.1）在產生混淆組合碼中的成功率。評估是使用已建立的資訊理論指標和人工審查進行，以確保正確性並為研究人員研究和開發針對此風險的補救措施提供基礎。原始碼可以在以下 GitHub 連結找到：https://github.com/mohammadi-ali/MetamorphASM。</paragraph>", "author": "Seyedreza Mohseni et.al.", "authors": "Seyedreza Mohseni, Seyedali Mohammadi, Deepa Tilwani, Yash Saxena, Gerald Ndwula, Sriram Vema, Edward Raff, Manas Gaur", "id": "2412.16135v1", "paper_url": "http://arxiv.org/abs/2412.16135v1", "repo": "null"}}