{"2408.13040": {"publish_time": "2024-08-23", "title": "SpeechPrompt: Prompting Speech Language Models for Speech Processing Tasks", "paper_summary": "Prompting has become a practical method for utilizing pre-trained language\nmodels (LMs). This approach offers several advantages. It allows an LM to adapt\nto new tasks with minimal training and parameter updates, thus achieving\nefficiency in both storage and computation. Additionally, prompting modifies\nonly the LM's inputs and harnesses the generative capabilities of language\nmodels to address various downstream tasks in a unified manner. This\nsignificantly reduces the need for human labor in designing task-specific\nmodels. These advantages become even more evident as the number of tasks served\nby the LM scales up. Motivated by the strengths of prompting, we are the first\nto explore the potential of prompting speech LMs in the domain of speech\nprocessing. Recently, there has been a growing interest in converting speech\ninto discrete units for language modeling. Our pioneer research demonstrates\nthat these quantized speech units are highly versatile within our unified\nprompting framework. Not only can they serve as class labels, but they also\ncontain rich phonetic information that can be re-synthesized back into speech\nsignals for speech generation tasks. Specifically, we reformulate speech\nprocessing tasks into speech-to-unit generation tasks. As a result, we can\nseamlessly integrate tasks such as speech classification, sequence generation,\nand speech generation within a single, unified prompting framework. The\nexperiment results show that the prompting method can achieve competitive\nperformance compared to the strong fine-tuning method based on self-supervised\nlearning models with a similar number of trainable parameters. The prompting\nmethod also shows promising results in the few-shot setting. Moreover, with the\nadvanced speech LMs coming into the stage, the proposed prompting framework\nattains great potential.", "paper_summary_zh": "提示已成为利用预训练语言模型 (LM) 的实用方法。这种方法提供了几个优点。它允许 LM 以最少的训练和参数更新适应新任务，从而在存储和计算方面实现效率。此外，提示仅修改 LM 的输入，并利用语言模型的生成能力以统一的方式解决各种下游任务。这大大减少了在设计特定任务模型中对人工劳动力的需求。随着 LM 服务的任务数量的增加，这些优势变得更加明显。受提示优势的启发，我们率先探索了在语音处理领域提示语音 LM 的潜力。最近，人们越来越有兴趣将语音转换成离散单元以进行语言建模。我们的先驱研究表明，这些量化的语音单元在我们统一的提示框架内具有高度通用性。它们不仅可以用作类别标签，还包含丰富的语音信息，可以重新合成回语音信号以用于语音生成任务。具体来说，我们将语音处理任务重新表述为语音到单元生成任务。因此，我们可以在一个单一的统一提示框架内无缝地集成语音分类、序列生成和语音生成等任务。实验结果表明，与基于自监督学习模型的强微调方法相比，提示方法可以在具有相似数量的可训练参数的情况下实现具有竞争力的性能。提示方法在小样本设置中也显示出有希望的结果。此外，随着先进的语音 LM 进入阶段，所提出的提示框架具有巨大的潜力。", "author": "Kai-Wei Chang et.al.", "authors": "Kai-Wei Chang, Haibin Wu, Yu-Kai Wang, Yuan-Kuei Wu, Hua Shen, Wei-Cheng Tseng, Iu-thing Kang, Shang-Wen Li, Hung-yi Lee", "id": "2408.13040v1", "paper_url": "http://arxiv.org/abs/2408.13040v1", "repo": "null"}}