{"2408.01614": {"publish_time": "2024-08-03", "title": "Advancing Mental Health Pre-Screening: A New Custom GPT for Psychological Distress Assessment", "paper_summary": "This study introduces 'Psycho Analyst', a custom GPT model based on OpenAI's\nGPT-4, optimized for pre-screening mental health disorders. Enhanced with\nDSM-5, PHQ-8, detailed data descriptions, and extensive training data, the\nmodel adeptly decodes nuanced linguistic indicators of mental health disorders.\nIt utilizes a dual-task framework that includes binary classification and a\nthree-stage PHQ-8 score computation involving initial assessment, detailed\nbreakdown, and independent assessment, showcasing refined analytic\ncapabilities. Validation with the DAIC-WOZ dataset reveals F1 and Macro-F1\nscores of 0.929 and 0.949, respectively, along with the lowest MAE and RMSE of\n2.89 and 3.69 in PHQ-8 scoring. These results highlight the model's precision\nand transformative potential in enhancing public mental health support,\nimproving accessibility, cost-effectiveness, and serving as a second opinion\nfor professionals.", "paper_summary_zh": "本研究推出了「心理分析師」，一個基於 OpenAI 的 GPT-4 的自訂 GPT 模型，針對心理健康障礙的預篩選而最佳化。此模型經過 DSM-5、PHQ-8、詳細資料描述和廣泛訓練資料的強化，能熟練地解碼心理健康障礙的細微語言指標。它採用一個雙任務架構，包括二元分類和一個三階段 PHQ-8 分數計算，涉及初步評估、詳細細分和獨立評估，展示了精緻的分析能力。使用 DAIC-WOZ 資料集進行驗證，F1 和巨集 F1 分數分別為 0.929 和 0.949，PHQ-8 評分中的 MAE 和 RMSE 最低，分別為 2.89 和 3.69。這些結果突顯了此模型在提升公眾心理健康支持、改善可及性、成本效益，以及作為專業人士的第二意見方面的精準度和變革潛力。", "author": "Jinwen Tang et.al.", "authors": "Jinwen Tang, Yi Shang", "id": "2408.01614v1", "paper_url": "http://arxiv.org/abs/2408.01614v1", "repo": "null"}}