{"2503.16419": {"publish_time": "2025-03-20", "title": "Stop Overthinking: A Survey on Efficient Reasoning for Large Language Models", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities in\ncomplex tasks. Recent advancements in Large Reasoning Models (LRMs), such as\nOpenAI o1 and DeepSeek-R1, have further improved performance in System-2\nreasoning domains like mathematics and programming by harnessing supervised\nfine-tuning (SFT) and reinforcement learning (RL) techniques to enhance the\nChain-of-Thought (CoT) reasoning. However, while longer CoT reasoning sequences\nimprove performance, they also introduce significant computational overhead due\nto verbose and redundant outputs, known as the \"overthinking phenomenon\". In\nthis paper, we provide the first structured survey to systematically\ninvestigate and explore the current progress toward achieving efficient\nreasoning in LLMs. Overall, relying on the inherent mechanism of LLMs, we\ncategorize existing works into several key directions: (1) model-based\nefficient reasoning, which considers optimizing full-length reasoning models\ninto more concise reasoning models or directly training efficient reasoning\nmodels; (2) reasoning output-based efficient reasoning, which aims to\ndynamically reduce reasoning steps and length during inference; (3) input\nprompts-based efficient reasoning, which seeks to enhance reasoning efficiency\nbased on input prompt properties such as difficulty or length control.\nAdditionally, we introduce the use of efficient data for training reasoning\nmodels, explore the reasoning capabilities of small language models, and\ndiscuss evaluation methods and benchmarking.", "paper_summary_zh": "大型語言模型 (LLM) 在處理複雜任務方面展現了非凡的能力。大型推理模型 (LRM) 的最新進展，例如 OpenAI o1 和 DeepSeek-R1，透過利用監督式微調 (SFT) 和強化學習 (RL) 技術來增強思維鏈 (CoT) 推理，進一步提升了系統 2 推理領域（如數學和程式設計）的效能。然而，雖然較長的 CoT 推理序列可以提高效能，但它們也會因為冗長且多餘的輸出而引入顯著的計算開銷，這種現象被稱為「過度思考現象」。在本文中，我們首次提供了結構化的綜述，系統地研究和探討了目前在實現 LLM 高效推理方面的進展。總體而言，基於 LLM 的內在機制，我們將現有工作歸納為幾個主要方向：(1) 基於模型的高效推理，考慮將完整推理模型優化為更簡潔的推理模型，或直接訓練高效推理模型；(2) 基於推理輸出結果的高效推理，旨在動態減少推理步驟和推理過程中的長度；(3) 基於輸入提示的高效推理，旨在根據輸入提示的屬性（例如難度或長度控制）來提高推理效率。此外，我們還介紹了使用高效數據來訓練推理模型，探討了小型語言模型的推理能力，並討論了評估方法和基準測試。\n", "author": "Yang Sui et.al.", "authors": "Yang Sui, Yu-Neng Chuang, Guanchu Wang, Jiamu Zhang, Tianyi Zhang, Jiayi Yuan, Hongyi Liu, Andrew Wen, Shaochen, Zhong, Hanjie Chen, Xia Hu", "id": "2503.16419v1", "paper_url": "http://arxiv.org/abs/2503.16419v1", "repo": "null"}}