{"2501.00777": {"publish_time": "2025-01-01", "title": "FitCF: A Framework for Automatic Feature Importance-guided Counterfactual Example Generation", "paper_summary": "Counterfactual examples are widely used in natural language processing (NLP)\nas valuable data to improve models, and in explainable artificial intelligence\n(XAI) to understand model behavior. The automated generation of counterfactual\nexamples remains a challenging task even for large language models (LLMs),\ndespite their impressive performance on many tasks. In this paper, we first\nintroduce ZeroCF, a faithful approach for leveraging important words derived\nfrom feature attribution methods to generate counterfactual examples in a\nzero-shot setting. Second, we present a new framework, FitCF, which further\nverifies aforementioned counterfactuals by label flip verification and then\ninserts them as demonstrations for few-shot prompting, outperforming two\nstate-of-the-art baselines. Through ablation studies, we identify the\nimportance of each of FitCF's core components in improving the quality of\ncounterfactuals, as assessed through flip rate, perplexity, and similarity\nmeasures. Furthermore, we show the effectiveness of LIME and Integrated\nGradients as backbone attribution methods for FitCF and find that the number of\ndemonstrations has the largest effect on performance. Finally, we reveal a\nstrong correlation between the faithfulness of feature attribution scores and\nthe quality of generated counterfactuals.", "paper_summary_zh": "反事實範例廣泛用於自然語言處理 (NLP) 中，作為改進模型的有價值資料，以及在可解釋人工智慧 (XAI) 中用於了解模型行為。即使對於大型語言模型 (LLM)，自動產生反事實範例仍然是一項具有挑戰性的任務，儘管它們在許多任務上表現出色。在本文中，我們首先介紹 ZeroCF，這是一種忠實的方法，用於利用從特徵歸因方法中衍生的重要字詞，在零次學習設定中產生反事實範例。其次，我們提出了一個新的框架 FitCF，它通過標籤翻轉驗證進一步驗證上述反事實，然後將它們插入作為少次學習提示的範例，優於兩個最先進的基準。通過消融研究，我們確定了 FitCF 各個核心組成部分在提升反事實品質方面的重要性，評估方法為翻轉率、困惑度和相似性測量。此外，我們展示了 LIME 和整合梯度作為 FitCF 的主幹歸因方法的有效性，並發現範例數量對效能有最大的影響。最後，我們揭示了特徵歸因分數的忠實度與產生的反事實品質之間的強相關性。", "author": "Qianli Wang et.al.", "authors": "Qianli Wang, Nils Feldhus, Simon Ostermann, Luis Felipe Villa-Arenas, Sebastian Möller, Vera Schmitt", "id": "2501.00777v1", "paper_url": "http://arxiv.org/abs/2501.00777v1", "repo": "null"}}