{"2406.15085": {"publish_time": "2024-06-21", "title": "A Unified Framework for Input Feature Attribution Analysis", "paper_summary": "Explaining the decision-making process of machine learning models is crucial\nfor ensuring their reliability and fairness. One popular explanation form\nhighlights key input features, such as i) tokens (e.g., Shapley Values and\nIntegrated Gradients), ii) interactions between tokens (e.g., Bivariate Shapley\nand Attention-based methods), or iii) interactions between spans of the input\n(e.g., Louvain Span Interactions). However, these explanation types have only\nbeen studied in isolation, making it difficult to judge their respective\napplicability. To bridge this gap, we propose a unified framework that\nfacilitates a direct comparison between highlight and interactive explanations\ncomprised of four diagnostic properties. Through extensive analysis across\nthese three types of input feature explanations--each utilizing three different\nexplanation techniques--across two datasets and two models, we reveal that each\nexplanation type excels in terms of different diagnostic properties. In our\nexperiments, highlight explanations are the most faithful to a model's\nprediction, and interactive explanations provide better utility for learning to\nsimulate a model's predictions. These insights further highlight the need for\nfuture research to develop combined methods that enhance all diagnostic\nproperties.", "paper_summary_zh": "解釋機器學習模型的決策過程對於確保它們的可靠性和公平性至關重要。一種流行的解釋形式突出了關鍵輸入特徵，例如 i) 代幣（例如，Shapley 值和積分梯度）、ii) 代幣之間的交互（例如，雙變量 Shapley 和基於注意力的方法），或 iii) 輸入跨度的交互（例如，魯汶跨度交互）。然而，這些解釋類型僅在孤立的環境中進行了研究，這使得難以判斷它們各自的適用性。為了彌合這一差距，我們提出了一個統一的框架，該框架促進了由四個診斷屬性組成的亮點和互動解釋之間的直接比較。通過對這三種類型的輸入特徵解釋（每種類型都使用三種不同的解釋技術）在兩個數據集和兩個模型中進行廣泛分析，我們發現每種類型的解釋在不同的診斷屬性方面都非常出色。在我們的實驗中，亮點解釋最忠實於模型的預測，而互動解釋則提供了更好的效用，用於模擬模型的預測。這些見解進一步強調了未來研究需要開發結合方法以增強所有診斷屬性的必要性。", "author": "Jingyi Sun et.al.", "authors": "Jingyi Sun, Pepa Atanasova, Isabelle Augenstein", "id": "2406.15085v1", "paper_url": "http://arxiv.org/abs/2406.15085v1", "repo": "null"}}