{"2411.15274": {"publish_time": "2024-11-22", "title": "Feature-interactive Siamese graph encoder-based image analysis to predict STAS from histopathology images in lung cancer", "paper_summary": "Spread through air spaces (STAS) is a distinct invasion pattern in lung\ncancer, crucial for prognosis assessment and guiding surgical decisions.\nHistopathology is the gold standard for STAS detection, yet traditional methods\nare subjective, time-consuming, and prone to misdiagnosis, limiting large-scale\napplications. We present VERN, an image analysis model utilizing a\nfeature-interactive Siamese graph encoder to predict STAS from lung cancer\nhistopathological images. VERN captures spatial topological features with\nfeature sharing and skip connections to enhance model training. Using 1,546\nhistopathology slides, we built a large single-cohort STAS lung cancer dataset.\nVERN achieved an AUC of 0.9215 in internal validation and AUCs of 0.8275 and\n0.8829 in frozen and paraffin-embedded test sections, respectively,\ndemonstrating clinical-grade performance. Validated on a single-cohort and\nthree external datasets, VERN showed robust predictive performance and\ngeneralizability, providing an open platform (http://plr.20210706.xyz:5000/) to\nenhance STAS diagnosis efficiency and accuracy.", "paper_summary_zh": "<paragraph>經由空氣腔（STAS）擴散是一種肺癌中獨特的侵襲模式，對於預後評估和引導手術決策至關重要。組織病理學是 STAS 檢測的黃金標準，但傳統方法主觀、耗時且容易誤診，限制了大規模應用。我們提出 VERN，一種利用特徵互動式連體圖編碼器從肺癌組織病理學影像預測 STAS 的影像分析模型。VERN 通過特徵共享和跳躍連接捕獲空間拓撲特徵，以增強模型訓練。使用 1,546 張組織病理學切片，我們建立了一個大型單一隊列 STAS 肺癌數據集。VERN 在內部驗證中達到 0.9215 的 AUC，在冷凍和石蠟包埋的試驗切片中分別達到 0.8275 和 0.8829 的 AUC，證明了臨床級的性能。在單一隊列和三個外部數據集上進行驗證，VERN 表現出穩健的預測性能和泛化能力，提供了一個開放平台 (http://plr.20210706.xyz:5000/)，以提高 STAS 診斷效率和準確性。</paragraph>", "author": "Liangrui Pan et.al.", "authors": "Liangrui Pan, Qingchun Liang, Wenwu Zeng, Yijun Peng, Zhenyu Zhao, Yiyi Liang, Jiadi Luo, Xiang Wang, Shaoliang Peng", "id": "2411.15274v1", "paper_url": "http://arxiv.org/abs/2411.15274v1", "repo": "null"}}