{"2408.04449": {"publish_time": "2024-08-08", "title": "RiskAwareBench: Towards Evaluating Physical Risk Awareness for High-level Planning of LLM-based Embodied Agents", "paper_summary": "The integration of large language models (LLMs) into robotics significantly\nenhances the capabilities of embodied agents in understanding and executing\ncomplex natural language instructions. However, the unmitigated deployment of\nLLM-based embodied systems in real-world environments may pose potential\nphysical risks, such as property damage and personal injury. Existing security\nbenchmarks for LLMs overlook risk awareness for LLM-based embodied agents. To\naddress this gap, we propose RiskAwareBench, an automated framework designed to\nassess physical risks awareness in LLM-based embodied agents. RiskAwareBench\nconsists of four modules: safety tips generation, risky scene generation, plan\ngeneration, and evaluation, enabling comprehensive risk assessment with minimal\nmanual intervention. Utilizing this framework, we compile the PhysicalRisk\ndataset, encompassing diverse scenarios with associated safety tips,\nobservations, and instructions. Extensive experiments reveal that most LLMs\nexhibit insufficient physical risk awareness, and baseline risk mitigation\nstrategies yield limited enhancement, which emphasizes the urgency and\ncruciality of improving risk awareness in LLM-based embodied agents in the\nfuture.", "paper_summary_zh": "大型語言模型 (LLM) 整合到機器人技術中，顯著提升了具身代理理解和執行複雜自然語言指令的能力。然而，在現實世界環境中部署基於 LLM 的具身系統可能會造成潛在的物理風險，例如財產損壞和人身傷害。現有的 LLM 安全基準忽略了對基於 LLM 的具身代理的風險意識。為了解決這個問題，我們提出了 RiskAwareBench，這是一個自動化框架，旨在評估基於 LLM 的具身代理中的物理風險意識。RiskAwareBench 包含四個模組：安全提示生成、風險場景生成、計畫生成和評估，以最少的介入實現全面的風險評估。利用這個框架，我們編制了 PhysicalRisk 資料集，其中包含各種場景以及相關的安全提示、觀察和說明。大量的實驗顯示，大多數 LLM 都表現出不足的物理風險意識，而且基準風險緩解策略產生的改善有限，這強調了在未來改善基於 LLM 的具身代理中的風險意識的迫切性和重要性。", "author": "Zihao Zhu et.al.", "authors": "Zihao Zhu, Bingzhe Wu, Zhengyou Zhang, Baoyuan Wu", "id": "2408.04449v1", "paper_url": "http://arxiv.org/abs/2408.04449v1", "repo": "null"}}