{"2409.07016": {"publish_time": "2024-09-11", "title": "Improving Anomalous Sound Detection via Low-Rank Adaptation Fine-Tuning of Pre-Trained Audio Models", "paper_summary": "Anomalous Sound Detection (ASD) has gained significant interest through the\napplication of various Artificial Intelligence (AI) technologies in industrial\nsettings. Though possessing great potential, ASD systems can hardly be readily\ndeployed in real production sites due to the generalization problem, which is\nprimarily caused by the difficulty of data collection and the complexity of\nenvironmental factors. This paper introduces a robust ASD model that leverages\naudio pre-trained models. Specifically, we fine-tune these models using machine\noperation data, employing SpecAug as a data augmentation strategy.\nAdditionally, we investigate the impact of utilizing Low-Rank Adaptation (LoRA)\ntuning instead of full fine-tuning to address the problem of limited data for\nfine-tuning. Our experiments on the DCASE2023 Task 2 dataset establish a new\nbenchmark of 77.75% on the evaluation set, with a significant improvement of\n6.48% compared with previous state-of-the-art (SOTA) models, including top-tier\ntraditional convolutional networks and speech pre-trained models, which\ndemonstrates the effectiveness of audio pre-trained models with LoRA tuning.\nAblation studies are also conducted to showcase the efficacy of the proposed\nscheme.", "paper_summary_zh": "異常聲音偵測 (ASD) 在工業環境中透過應用各種人工智慧 (AI) 技術獲得了極大的關注。儘管擁有巨大的潛力，但 ASD 系統由於泛化問題而難以在實際生產現場中輕易部署，這主要是由於資料收集的困難性和環境因素的複雜性所造成。本文介紹了一個強健的 ASD 模型，它利用了音訊預訓練模型。具體來說，我們使用機器操作資料微調這些模型，採用 SpecAug 作為資料擴充策略。此外，我們研究了使用低秩適應 (LoRA) 微調來解決微調資料有限的問題，而不是進行完全微調。我們在 DCASE2023 任務 2 資料集上的實驗建立了一個新的基準，在評估集中獲得了 77.75%，與之前的最先進 (SOTA) 模型相比，有 6.48% 的顯著提升，其中包括頂級傳統卷積網路和語音預訓練模型，這證明了使用 LoRA 微調的音訊預訓練模型的有效性。消融研究也進行了，以展示所提出方案的功效。", "author": "Xinhu Zheng et.al.", "authors": "Xinhu Zheng, Anbai Jiang, Bing Han, Yanmin Qian, Pingyi Fan, Jia Liu, Wei-Qiang Zhang", "id": "2409.07016v1", "paper_url": "http://arxiv.org/abs/2409.07016v1", "repo": "null"}}