{"2411.14995": {"publish_time": "2024-11-22", "title": "Learning Lifted STRIPS Models from Action Traces Alone: A Simple, General, and Scalable Solution", "paper_summary": "Learning STRIPS action models from action traces alone is a challenging\nproblem as it involves learning the domain predicates as well. In this work, a\nnovel approach is introduced which, like the well-known LOCM systems, is\nscalable, but like SAT approaches, is sound and complete. Furthermore, the\napproach is general and imposes no restrictions on the hidden domain or the\nnumber or arity of the predicates. The new learning method is based on an\n\\emph{efficient, novel test} that checks whether the assumption that a\npredicate is affected by a set of action patterns, namely, actions with\nspecific argument positions, is consistent with the traces. The predicates and\naction patterns that pass the test provide the basis for the learned domain\nthat is then easily completed with preconditions and static predicates. The new\nmethod is studied theoretically and experimentally. For the latter, the method\nis evaluated on traces and graphs obtained from standard classical domains like\nthe 8-puzzle, which involve hundreds of thousands of states and transitions.\nThe learned representations are then verified on larger instances.", "paper_summary_zh": "僅從動作軌跡學習 STRIPS 動作模型是一項具有挑戰性的問題，因為它涉及學習領域謂詞。在這項工作中，引入了一種新方法，就像眾所周知的 LOCM 系統一樣，它是可擴展的，但就像 SAT 方法一樣，它是健全且完整的。此外，該方法是通用的，對隱藏域或謂詞的數量或元數沒有限制。新的學習方法基於一個高效的新測試，該測試檢查假設謂詞受一組動作模式（即具有特定參數位置的動作）影響是否與軌跡一致。通過測試的謂詞和動作模式為學習的領域提供了基礎，然後可以輕鬆地用先決條件和靜態謂詞完成該領域。對新方法進行了理論和實驗研究。對於後者，該方法在從標準經典域（如涉及數十萬個狀態和轉換的 8-puzzle）獲得的軌跡和圖形上進行了評估。然後在更大的實例上驗證學習的表示。", "author": "Jonas Gösgens et.al.", "authors": "Jonas Gösgens, Niklas Jansen, Hector Geffner", "id": "2411.14995v1", "paper_url": "http://arxiv.org/abs/2411.14995v1", "repo": "null"}}