{"2501.09186": {"publish_time": "2025-01-15", "title": "Guiding Retrieval using LLM-based Listwise Rankers", "paper_summary": "Large Language Models (LLMs) have shown strong promise as rerankers,\nespecially in ``listwise'' settings where an LLM is prompted to rerank several\nsearch results at once. However, this ``cascading'' retrieve-and-rerank\napproach is limited by the bounded recall problem: relevant documents not\nretrieved initially are permanently excluded from the final ranking. Adaptive\nretrieval techniques address this problem, but do not work with listwise\nrerankers because they assume a document's score is computed independently from\nother documents. In this paper, we propose an adaptation of an existing\nadaptive retrieval method that supports the listwise setting and helps guide\nthe retrieval process itself (thereby overcoming the bounded recall problem for\nLLM rerankers). Specifically, our proposed algorithm merges results both from\nthe initial ranking and feedback documents provided by the most relevant\ndocuments seen up to that point. Through extensive experiments across diverse\nLLM rerankers, first stage retrievers, and feedback sources, we demonstrate\nthat our method can improve nDCG@10 by up to 13.23% and recall by 28.02%--all\nwhile keeping the total number of LLM inferences constant and overheads due to\nthe adaptive process minimal. The work opens the door to leveraging LLM-based\nsearch in settings where the initial pool of results is limited, e.g., by\nlegacy systems, or by the cost of deploying a semantic first-stage.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出作為重新排序器的強大潛力，特別是在「清單式」設定中，其中 LLM 會收到提示，一次重新排序多個搜尋結果。然而，這種「串聯式」檢索和重新排序方法受到有界召回問題的限制：最初未檢索到的相關文件會永久排除在最終排名之外。自適應檢索技術可解決此問題，但無法與清單式重新排序器搭配使用，因為它們假設文件的評分會獨立於其他文件計算。在本文中，我們提出對現有自適應檢索方法的改編，支援清單式設定，並協助引導檢索程序本身（從而克服 LLM 重新排序器的有界召回問題）。具體來說，我們提出的演算法合併來自初始排名和迄今為止所見最相關文件的回饋文件中的結果。透過對不同的 LLM 重新排序器、第一階段檢索器和回饋來源進行廣泛的實驗，我們證明我們的模型可以將 nDCG@10 提高多達 13.23%，召回率提高 28.02%——同時保持 LLM 推論的總次數不變，並將自適應程序造成的額外負擔降至最低。這項工作開啟了在初始結果池有限的設定中利用基於 LLM 的搜尋的大門，例如，受到傳統系統或部署語意第一階段的成本限制。", "author": "Mandeep Rathee et.al.", "authors": "Mandeep Rathee, Sean MacAvaney, Avishek Anand", "id": "2501.09186v1", "paper_url": "http://arxiv.org/abs/2501.09186v1", "repo": "https://github.com/mandeep-rathee/llmgar"}}