{"2404.03624": {"publish_time": "2024-04-04", "title": "Standardizing Knowledge Engineering Practices with a Reference Architecture", "paper_summary": "Knowledge engineering is the process of creating and maintaining\nknowledge-producing systems. Throughout the history of computer science and AI,\nknowledge engineering workflows have been widely used given the importance of\nhigh-quality knowledge for reliable intelligent agents. Meanwhile, the scope of\nknowledge engineering, as apparent from its target tasks and use cases, has\nbeen shifting, together with its paradigms such as expert systems, semantic\nweb, and language modeling. The intended use cases and supported user\nrequirements between these paradigms have not been analyzed globally, as new\nparadigms often satisfy prior pain points while possibly introducing new ones.\nThe recent abstraction of systemic patterns into a boxology provides an opening\nfor aligning the requirements and use cases of knowledge engineering with the\nsystems, components, and software that can satisfy them best. This paper\nproposes a vision of harmonizing the best practices in the field of knowledge\nengineering by leveraging the software engineering methodology of creating\nreference architectures. We describe how a reference architecture can be\niteratively designed and implemented to associate user needs with recurring\nsystemic patterns, building on top of existing knowledge engineering workflows\nand boxologies. We provide a six-step roadmap that can enable the development\nof such an architecture, providing an initial design and outcome of the\ndefinition of architectural scope, selection of information sources, and\nanalysis. We expect that following through on this vision will lead to\nwell-grounded reference architectures for knowledge engineering, will advance\nthe ongoing initiatives of organizing the neurosymbolic knowledge engineering\nspace, and will build new links to the software architectures and data science\ncommunities.", "paper_summary_zh": "知識工程是建立並維護知識產生系統的過程。在電腦科學和人工智慧的歷史中，由於高品質知識對於可靠的智慧代理人而言十分重要，因此知識工程工作流程被廣泛使用。同時，知識工程的範圍，從其目標任務和使用案例中顯而易見，隨著其典範（例如專家系統、語意網路和語言建模）而有所轉變。這些典範之間的預期使用案例和支援的使用者需求尚未經過全面分析，因為新的典範通常會滿足先前的痛點，同時可能引入新的痛點。最近將系統性模式抽象化為盒學，為調整知識工程的需求和使用案例與最能滿足它們的系統、組件和軟體提供了契機。本文提出了一個願景，即透過利用建立參考架構的軟體工程方法，調和知識工程領域的最佳實務。我們說明了如何反覆設計和實作參考架構，以將使用者需求與反覆出現的系統性模式關聯起來，並建立在現有的知識工程工作流程和盒學之上。我們提供了一個六步驟路線圖，可以支援此類架構的開發，提供架構範圍定義、資訊來源選擇和分析的初步設計和結果。我們預期遵循此願景將導致知識工程的紮實參考架構，推進組織神經符號知識工程空間的持續計畫，並建立與軟體架構和資料科學社群的新連結。", "author": "Bradley P. Allen et.al.", "authors": "Bradley P. Allen, Filip Ilievski", "id": "2404.03624v1", "paper_url": "http://arxiv.org/abs/2404.03624v1", "repo": "null"}}