{"2412.12761": {"publish_time": "2024-12-17", "title": "Revealing the impact of synthetic native samples and multi-tasking strategies in Hindi-English code-mixed humour and sarcasm detection", "paper_summary": "In this paper, we reported our experiments with various strategies to improve\ncode-mixed humour and sarcasm detection. We did all of our experiments for\nHindi-English code-mixed scenario, as we have the linguistic expertise for the\nsame. We experimented with three approaches, namely (i) native sample mixing,\n(ii) multi-task learning (MTL), and (iii) prompting very large multilingual\nlanguage models (VMLMs). In native sample mixing, we added monolingual task\nsamples in code-mixed training sets. In MTL learning, we relied on native and\ncode-mixed samples of a semantically related task (hate detection in our case).\nFinally, in our third approach, we evaluated the efficacy of VMLMs via few-shot\ncontext prompting. Some interesting findings we got are (i) adding native\nsamples improved humor (raising the F1-score up to 6.76%) and sarcasm (raising\nthe F1-score up to 8.64%) detection, (ii) training MLMs in an MTL framework\nboosted performance for both humour (raising the F1-score up to 10.67%) and\nsarcasm (increment up to 12.35% in F1-score) detection, and (iii) prompting\nVMLMs couldn't outperform the other approaches. Finally, our ablation studies\nand error analysis discovered the cases where our model is yet to improve. We\nprovided our code for reproducibility.", "paper_summary_zh": "<paragraph>在這篇論文中，我們報告了我們使用各種策略來改善代碼混合幽默和諷刺偵測的實驗。我們對印地語-英語代碼混合場景進行了所有實驗，因為我們擁有這方面的語言專業知識。我們嘗試了三種方法，分別是 (i) 原生樣本混合、(ii) 多任務學習 (MTL) 和 (iii) 提示非常大的多語言語言模型 (VMLM)。在原生樣本混合中，我們在代碼混合訓練集中添加了單語任務樣本。在 MTL 學習中，我們依賴於語義相關任務（在我們的案例中是仇恨偵測）的原生和代碼混合樣本。最後，在我們的第三種方法中，我們通過少次提示語境提示評估了 VMLM 的功效。我們獲得的一些有趣的發現是 (i) 添加原生樣本改進了幽默（將 F1 分數提高到 6.76%）和諷刺（將 F1 分數提高到 8.64%）偵測，(ii) 在 MTL 框架中訓練 MLM 提升了幽默（將 F1 分數提高到 10.67%）和諷刺（將 F1 分數提高到 12.35%）偵測的效能，以及 (iii) 提示 VMLM 無法優於其他方法。最後，我們的消融研究和錯誤分析發現了我們的模型尚未改進的案例。我們提供了我們的代碼以供重現。</paragraph>", "author": "Debajyoti Mazumder et.al.", "authors": "Debajyoti Mazumder, Aakash Kumar, Jasabanta Patro", "id": "2412.12761v1", "paper_url": "http://arxiv.org/abs/2412.12761v1", "repo": "null"}}