{"2410.08025": {"publish_time": "2024-10-10", "title": "The Computational Complexity of Circuit Discovery for Inner Interpretability", "paper_summary": "Many proposed applications of neural networks in machine learning,\ncognitive/brain science, and society hinge on the feasibility of inner\ninterpretability via circuit discovery. This calls for empirical and\ntheoretical explorations of viable algorithmic options. Despite advances in the\ndesign and testing of heuristics, there are concerns about their scalability\nand faithfulness at a time when we lack understanding of the complexity\nproperties of the problems they are deployed to solve. To address this, we\nstudy circuit discovery with classical and parameterized computational\ncomplexity theory: (1) we describe a conceptual scaffolding to reason about\ncircuit finding queries in terms of affordances for description, explanation,\nprediction and control; (2) we formalize a comprehensive set of queries that\ncapture mechanistic explanation, and propose a formal framework for their\nanalysis; (3) we use it to settle the complexity of many query variants and\nrelaxations of practical interest on multi-layer perceptrons (part of, e.g.,\ntransformers). Our findings reveal a challenging complexity landscape. Many\nqueries are intractable (NP-hard, $\\Sigma^p_2$-hard), remain fixed-parameter\nintractable (W[1]-hard) when constraining model/circuit features (e.g., depth),\nand are inapproximable under additive, multiplicative, and probabilistic\napproximation schemes. To navigate this landscape, we prove there exist\ntransformations to tackle some of these hard problems (NP- vs.\n$\\Sigma^p_2$-complete) with better-understood heuristics, and prove the\ntractability (PTIME) or fixed-parameter tractability (FPT) of more modest\nqueries which retain useful affordances. This framework allows us to understand\nthe scope and limits of interpretability queries, explore viable options, and\ncompare their resource demands among existing and future architectures.", "paper_summary_zh": "許多神經網路在機器學習、認知/腦科學和社會中的應用提案，都仰賴電路發現所帶來的內在可解釋性可行性。這需要經驗和理論探索可行的演算法選項。儘管在啟發法的設計和測試方面有進展，但對於它們的可擴充性和忠實度仍有疑慮，因為我們缺乏對其所部署解決問題的複雜性特性的了解。為了解決這個問題，我們使用經典和參數化計算複雜度理論研究電路發現：(1) 我們描述一個概念性架構，以描述、解釋、預測和控制能力來推論電路查找查詢；(2) 我們形式化一組全面的查詢，以捕捉機制解釋，並提出一個用於分析它們的正式框架；(3) 我們使用它來確定許多查詢變體的複雜性，並放寬對多層感知器的實際興趣(例如，Transformer的一部分)。我們的發現揭示了一個具有挑戰性的複雜性環境。許多查詢難以處理(NP-hard、$\\Sigma^p_2$-hard)，在約束模型/電路特徵(例如，深度)時仍然難以處理固定參數(W[1]-hard)，並且在加法、乘法和機率近似方案下無法近似。為了導航這個環境，我們證明存在轉換來解決其中一些困難的問題(NP- vs. $\\Sigma^p_2$-complete)和更完善的啟發法，並證明更適度的查詢的可處理性(PTIME)或固定參數可處理性(FPT)，這些查詢保留了有用的能力。這個框架讓我們能夠了解可解釋性查詢的範圍和限制，探索可行的選項，並比較它們在現有和未來架構中的資源需求。", "author": "Federico Adolfi et.al.", "authors": "Federico Adolfi, Martina G. Vilas, Todd Wareham", "id": "2410.08025v2", "paper_url": "http://arxiv.org/abs/2410.08025v2", "repo": "null"}}