{"2407.02030": {"publish_time": "2024-07-02", "title": "Breaking Bias, Building Bridges: Evaluation and Mitigation of Social Biases in LLMs via Contact Hypothesis", "paper_summary": "Large Language Models (LLMs) perpetuate social biases, reflecting prejudices\nin their training data and reinforcing societal stereotypes and inequalities.\nOur work explores the potential of the Contact Hypothesis, a concept from\nsocial psychology for debiasing LLMs. We simulate various forms of social\ncontact through LLM prompting to measure their influence on the model's biases,\nmirroring how intergroup interactions can reduce prejudices in social contexts.\nWe create a dataset of 108,000 prompts following a principled approach\nreplicating social contact to measure biases in three LLMs (LLaMA 2, Tulu, and\nNousHermes) across 13 social bias dimensions. We propose a unique debiasing\ntechnique, Social Contact Debiasing (SCD), that instruction-tunes these models\nwith unbiased responses to prompts. Our research demonstrates that LLM\nresponses exhibit social biases when subject to contact probing, but more\nimportantly, these biases can be significantly reduced by up to 40% in 1 epoch\nof instruction tuning LLaMA 2 following our SCD strategy. Our code and data are\navailable at https://github.com/chahatraj/breakingbias.", "paper_summary_zh": "大型語言模型 (LLM) 延續了社會偏見，反映了其訓練數據中的偏見，並加強了社會刻板印象和不平等現象。我們的研究探討了接觸假說的可能性，這是一個來自社會心理學的概念，用於消除 LLM 的偏見。我們模擬了各種形式的社會接觸，通過 LLM 提示來衡量它們對模型偏見的影響，反映了群際互動如何減少社會環境中的偏見。我們根據一個遵循原則性方法的 108,000 個提示建立了一個數據集，複製社會接觸來衡量三個 LLM（LLaMA 2、Tulu 和 NousHermes）在 13 個社會偏見維度上的偏見。我們提出了一種獨特的去偏見技術，即社會接觸去偏見 (SCD)，它使用無偏見的提示對這些模型進行指令調整。我們的研究表明，當受到接觸探測時，LLM 的回應會表現出社會偏見，但更重要的是，這些偏見可以在 LLaMA 2 按照我們的 SCD 策略進行 1 個時期的指令調整後顯著減少多達 40%。我們的程式碼和資料可在 https://github.com/chahatraj/breakingbias 取得。", "author": "Chahat Raj et.al.", "authors": "Chahat Raj, Anjishnu Mukherjee, Aylin Caliskan, Antonios Anastasopoulos, Ziwei Zhu", "id": "2407.02030v1", "paper_url": "http://arxiv.org/abs/2407.02030v1", "repo": "https://github.com/chahatraj/breakingbias"}}