{"2504.16084": {"publish_time": "2025-04-22", "title": "TTRL: Test-Time Reinforcement Learning", "paper_summary": "This paper investigates Reinforcement Learning (RL) on data without explicit\nlabels for reasoning tasks in Large Language Models (LLMs). The core challenge\nof the problem is reward estimation during inference while not having access to\nground-truth information. While this setting appears elusive, we find that\ncommon practices in Test-Time Scaling (TTS), such as majority voting, yield\nsurprisingly effective rewards suitable for driving RL training. In this work,\nwe introduce Test-Time Reinforcement Learning (TTRL), a novel method for\ntraining LLMs using RL on unlabeled data. TTRL enables self-evolution of LLMs\nby utilizing the priors in the pre-trained models. Our experiments demonstrate\nthat TTRL consistently improves performance across a variety of tasks and\nmodels. Notably, TTRL boosts the pass@1 performance of Qwen-2.5-Math-7B by\napproximately 159% on the AIME 2024 with only unlabeled test data. Furthermore,\nalthough TTRL is only supervised by the Maj@N metric, TTRL has demonstrated\nperformance to consistently surpass the upper limit of the initial model, and\napproach the performance of models trained directly on test data with\nground-truth labels. Our experimental findings validate the general\neffectiveness of TTRL across various tasks, and highlight TTRL's potential for\nbroader tasks and domains. GitHub: https://github.com/PRIME-RL/TTRL", "paper_summary_zh": "<paragraph>本文研究了在大型語言模型 (LLM) 中，如何利用沒有明確標籤的數據進行強化學習 (RL) 推理任務。這個問題的核心挑戰在於如何在推理過程中估算獎勵，尤其是在無法獲得真實答案的情況下。雖然這個設定看起來難以捉摸，但我們發現測試時間尺度調整 (TTS) 中的常見做法（例如多數投票）可以產生出乎意料的有效獎勵，足以推動 RL 訓練。在本研究中，我們介紹了一種名為測試時間強化學習 (TTRL) 的新方法，用於在未標記的數據上使用 RL 訓練 LLM。TTRL 能夠利用預訓練模型中的先驗知識，讓 LLM 自我進化。我們的實驗證明，TTRL 能夠在各種任務和模型中持續提高效能。值得注意的是，TTRL 僅使用未標記的測試數據，就將 Qwen-2.5-Math-7B 在 AIME 2024 上的 pass@1 效能提升了約 159%。此外，儘管 TTRL 僅由 Maj@N 指標監督，但它的效能已證明能夠持續超越初始模型的上限，並接近直接使用帶有真實標籤的測試數據訓練的模型的效能。我們的實驗結果驗證了 TTRL 在各種任務中的普遍有效性，並突出了 TTRL 在更廣泛的任務和領域中的潛力。GitHub: https://github.com/PRIME-RL/TTRL</paragraph>\n", "author": "Yuxin Zuo et.al.", "authors": "Yuxin Zuo, Kaiyan Zhang, Shang Qu, Li Sheng, Xuekai Zhu, Biqing Qi, Youbang Sun, Ganqu Cui, Ning Ding, Bowen Zhou", "id": "2504.16084v1", "paper_url": "http://arxiv.org/abs/2504.16084v1", "repo": "null"}}