{"2501.03624": {"publish_time": "2025-01-07", "title": "LlaMADRS: Prompting Large Language Models for Interview-Based Depression Assessment", "paper_summary": "This study introduces LlaMADRS, a novel framework leveraging open-source\nLarge Language Models (LLMs) to automate depression severity assessment using\nthe Montgomery-Asberg Depression Rating Scale (MADRS). We employ a zero-shot\nprompting strategy with carefully designed cues to guide the model in\ninterpreting and scoring transcribed clinical interviews. Our approach, tested\non 236 real-world interviews from the Context-Adaptive Multimodal Informatics\n(CAMI) dataset, demonstrates strong correlations with clinician assessments.\nThe Qwen 2.5--72b model achieves near-human level agreement across most MADRS\nitems, with Intraclass Correlation Coefficients (ICC) closely approaching those\nbetween human raters. We provide a comprehensive analysis of model performance\nacross different MADRS items, highlighting strengths and current limitations.\nOur findings suggest that LLMs, with appropriate prompting, can serve as\nefficient tools for mental health assessment, potentially increasing\naccessibility in resource-limited settings. However, challenges remain,\nparticularly in assessing symptoms that rely on non-verbal cues, underscoring\nthe need for multimodal approaches in future work.", "paper_summary_zh": "這項研究介紹了 LlaMADRS，一個利用開放原始碼大型語言模型 (LLM) 自動評估憂鬱症嚴重程度的創新架構，使用蒙哥馬利-阿斯伯格憂鬱評分量表 (MADRS)。我們採用零次學習提示策略，使用精心設計的提示來引導模型詮釋和評分轉錄的臨床訪談。我們的方法在 Context-Adaptive Multimodal Informatics (CAMI) 資料集的 236 個真實訪談中進行測試，證實與臨床醫師評估有很強的相關性。Qwen 2.5--72b 模型在大部分 MADRS 項目中達到接近人類的評分一致性，類內相關係數 (ICC) 接近人類評分者之間的評分一致性。我們提供模型在不同 MADRS 項目中表現的全面分析，強調優點和目前的限制。我們的研究結果表明，LLM 在適當的提示下，可用作心理健康評估的有效工具，有可能在資源有限的環境中提高可及性。然而，挑戰仍然存在，特別是在評估依賴於非語言提示的症狀時，強調未來工作中需要多模態方法。", "author": "Gaoussou Youssouf Kebe et.al.", "authors": "Gaoussou Youssouf Kebe, Jeffrey M. Girard, Einat Liebenthal, Justin Baker, Fernando De la Torre, Louis-Philippe Morency", "id": "2501.03624v1", "paper_url": "http://arxiv.org/abs/2501.03624v1", "repo": "null"}}