{"2405.21028": {"publish_time": "2024-05-31", "title": "LACIE: Listener-Aware Finetuning for Confidence Calibration in Large Language Models", "paper_summary": "When answering questions, LLMs can convey not only an answer, but a level of\nconfidence about the answer being correct. This includes explicit confidence\nmarkers (e.g. giving a numeric score) as well as implicit markers, like an\nauthoritative tone or elaborating with additional knowledge. For LLMs to be\ntrustworthy knowledge sources, the confidence they convey should match their\nactual expertise; however, most current models tend towards overconfidence. To\ncalibrate both implicit and explicit confidence markers, we introduce a\npragmatic, listener-aware finetuning method (LACIE) that models the listener,\nconsidering not only whether an answer is right, but whether it will be\naccepted by a listener. We cast calibration as preference optimization,\ncreating data via a two-agent game, where a speaker model's outputs are judged\nby a simulated listener. We then finetune three LLMs (Mistral-7B, Llama3-8B,\nLlama3-70B) with LACIE, and show that the resulting models are better\ncalibrated w.r.t. a simulated listener. Crucially, these trends transfer to\nhuman listeners, helping them correctly predict model correctness: we conduct a\nhuman evaluation where annotators accept or reject an LLM's answers, finding\nthat training with LACIE results in 47% fewer incorrect answers being accepted\nwhile maintaining the same level of acceptance for correct answers.\nFurthermore, LACIE generalizes to another dataset, resulting in a large\nincrease in truthfulness on TruthfulQA when trained on TriviaQA. Our analysis\nindicates that LACIE leads to a better confidence separation between correct\nand incorrect examples. Qualitatively, we find that a LACIE-trained model\nhedges more and implicitly signals certainty when it is correct by using an\nauthoritative tone or including details. Finally, LACIE finetuning leads to an\nemergent increase in model abstention (e.g. saying \"I don't know\") for answers\nthat are likely wrong.", "paper_summary_zh": "在回答問題時，LLM 不僅可以傳達答案，還可以傳達對答案正確性的信心程度。這包括明確的信心標記（例如給出數字分數）以及隱含的標記，例如權威的語氣或用額外的知識進行闡述。對於 LLM 來說，要成為值得信賴的知識來源，它們傳達的信心應與它們的實際專業知識相匹配；然而，大多數當前模型都傾向於過度自信。為了校準隱含和明確的信心標記，我們引入了一種實用的、考慮聽眾的微調方法 (LACIE)，該方法對聽眾進行建模，不僅考慮答案是否正確，還考慮答案是否會被聽眾接受。我們將校準視為偏好優化，通過一場雙人遊戲創建數據，其中說話者模型的輸出由模擬聽眾來判斷。然後，我們使用 LACIE 對三個 LLM（Mistral-7B、Llama3-8B、Llama3-70B）進行微調，並表明由此產生的模型在模擬聽眾方面校準得更好。至關重要的是，這些趨勢會傳遞給人類聽眾，幫助他們正確預測模型的正確性：我們進行了一項人類評估，其中註釋者接受或拒絕 LLM 的答案，發現使用 LACIE 進行訓練導致接受的錯誤答案減少了 47%，同時保持了對正確答案的相同接受程度。此外，LACIE 可以推廣到另一個數據集，從而在 TruthfulQA 上訓練時大大提高了真實性。我們的分析表明，LACIE 導致正確和不正確示例之間的信心分離更好。從質量上講，我們發現 LACIE 訓練的模型會更多地迴避，並在正確時通過使用權威的語氣或包含細節來暗示確定性。最後，LACIE 微調導致模型對可能錯誤的答案（例如說「我不知道」）的棄權出現了新的增加。", "author": "Elias Stengel-Eskin et.al.", "authors": "Elias Stengel-Eskin, Peter Hase, Mohit Bansal", "id": "2405.21028v1", "paper_url": "http://arxiv.org/abs/2405.21028v1", "repo": "https://github.com/esteng/pragmatic_calibration"}}