{"2410.05262": {"publish_time": "2024-10-07", "title": "TurtleBench: Evaluating Top Language Models via Real-World Yes/No Puzzles", "paper_summary": "As the application of Large Language Models (LLMs) expands, the demand for\nreliable evaluations increases. Existing LLM evaluation benchmarks primarily\nrely on static datasets, making it challenging to assess model performance in\ndynamic interactions with users. Moreover, these benchmarks often depend on\nspecific background knowledge, complicating the measurement of a model's\nlogical reasoning capabilities. Other dynamic evaluation methods based on\nstrong models or manual efforts may introduce biases and incur high costs and\ntime demands, hindering large-scale application. To address these issues, we\npropose TurtleBench. TurtleBench collects real user guesses from our online\nTurtle Soup Puzzle platform that we developed. This approach allows for the\nrelatively dynamic generation of evaluation datasets, mitigating the risk of\nmodel cheating while aligning assessments more closely with genuine user needs\nfor reasoning capabilities, thus enhancing the reliability of evaluations.\nTurtleBench includes 1,532 user guesses along with the correctness of guesses\nafter annotation. Using this dataset, we thoroughly evaluated nine of the most\nadvanced LLMs available today. Notably, the OpenAI o1 series models did not\nachieve leading results in these evaluations. We propose several hypotheses for\nfurther research, such as \"the latent reasoning of o1 utilizes trivial\nChain-of-Thought (CoT) techniques\" and \"increasing CoT length not only provides\nreasoning benefits but also incurs noise costs.\"", "paper_summary_zh": "隨著大型語言模型 (LLM) 應用範圍的擴展，對可靠評估的需求也隨之增加。現有的 LLM 評估基準主要依賴靜態數據集，這使得評估模型在與使用者的動態互動中的效能變得有挑戰性。此外，這些基準通常依賴於特定的背景知識，這使得衡量模型的邏輯推理能力變得複雜。其他基於強大模型或人工努力的動態評估方法可能會引入偏差，並造成高成本和時間需求，阻礙大規模應用。為了解決這些問題，我們提出了 TurtleBench。TurtleBench 從我們開發的線上 Turtle Soup Puzzle 平台收集真實使用者的猜測。這種方法允許相對動態地產生評估數據集，降低模型作弊的風險，同時讓評估更貼近使用者在推理能力方面的真實需求，從而提高評估的可靠性。TurtleBench 包含 1,532 個使用者猜測，以及猜測在註解後的正確性。使用這個數據集，我們徹底評估了當今最先進的九個 LLM。值得注意的是，OpenAI o1 系列模型在這些評估中未取得領先的結果。我們提出了幾個進一步研究的假設，例如「o1 的潛在推理利用了微不足道的思考鏈 (CoT) 技術」和「增加 CoT 長度不僅提供了推理優勢，還產生了雜訊成本」。", "author": "Qingchen Yu et.al.", "authors": "Qingchen Yu, Shichao Song, Ke Fang, Yunfeng Shi, Zifan Zheng, Hanyu Wang, Simin Niu, Zhiyu Li", "id": "2410.05262v1", "paper_url": "http://arxiv.org/abs/2410.05262v1", "repo": "null"}}