{"2406.02057": {"publish_time": "2024-06-04", "title": "Tabular and Deep Learning for the Whittle Index", "paper_summary": "The Whittle index policy is a heuristic that has shown remarkably good\nperformance (with guaranteed asymptotic optimality) when applied to the class\nof problems known as Restless Multi-Armed Bandit Problems (RMABPs). In this\npaper we present QWI and QWINN, two reinforcement learning algorithms,\nrespectively tabular and deep, to learn the Whittle index for the total\ndiscounted criterion. The key feature is the use of two time-scales, a faster\none to update the state-action Q -values, and a relatively slower one to update\nthe Whittle indices. In our main theoretical result we show that QWI, which is\na tabular implementation, converges to the real Whittle indices. We then\npresent QWINN, an adaptation of QWI algorithm using neural networks to compute\nthe Q -values on the faster time-scale, which is able to extrapolate\ninformation from one state to another and scales naturally to large state-space\nenvironments. For QWINN, we show that all local minima of the Bellman error are\nlocally stable equilibria, which is the first result of its kind for DQN-based\nschemes. Numerical computations show that QWI and QWINN converge faster than\nthe standard Q -learning algorithm, neural-network based approximate Q-learning\nand other state of the art algorithms.", "paper_summary_zh": "惠特爾指數政策是一種啟發法，在應用於稱為不安多臂賭徒問題 (RMABP) 的問題類型時，已展現出極佳的表現（有保證的漸近最優性）。在本文中，我們提出 QWI 和 QWINN，這兩種分別為表格和深度增強學習演算法，用於學習總折現準則的惠特爾指數。其關鍵特徵是使用兩個時間尺度，一個較快的時間尺度用於更新狀態動作 Q 值，另一個較慢的時間尺度用於更新惠特爾指數。在我們的主要理論結果中，我們展示了表格實作的 QWI 會收斂到真正的惠特爾指數。接著，我們提出 QWINN，一種使用神經網路計算較快時間尺度上 Q 值的 QWI 演算法改編，它能夠從一個狀態推斷到另一個狀態，並自然地擴展到大型狀態空間環境。對於 QWINN，我們展示了貝爾曼誤差的所有局部最小值都是局部穩定均衡，這是基於 DQN 的架構首次出現的此類結果。數值運算顯示，QWI 和 QWINN 的收斂速度比標準 Q 學習演算法、基於神經網路的近似 Q 學習和其他最先進的演算法快。", "author": "Francisco Robledo Relaño et.al.", "authors": "Francisco Robledo Relaño, Vivek Borkar, Urtzi Ayesta, Konstantin Avrachenkov", "id": "2406.02057v1", "paper_url": "http://arxiv.org/abs/2406.02057v1", "repo": "null"}}