{"2410.22303": {"publish_time": "2024-10-29", "title": "$\\mathsf{OPA}$: One-shot Private Aggregation with Single Client Interaction and its Applications to Federated Learning", "paper_summary": "Our work aims to minimize interaction in secure computation due to the high\ncost and challenges associated with communication rounds, particularly in\nscenarios with many clients. In this work, we revisit the problem of secure\naggregation in the single-server setting where a single evaluation server can\nsecurely aggregate client-held individual inputs. Our key contribution is the\nintroduction of One-shot Private Aggregation ($\\mathsf{OPA}$) where clients\nspeak only once (or even choose not to speak) per aggregation evaluation. Since\neach client communicates only once per aggregation, this simplifies managing\ndropouts and dynamic participation, contrasting with multi-round protocols and\naligning with plaintext secure aggregation, where clients interact only once.\nWe construct $\\mathsf{OPA}$ based on LWR, LWE, class groups, DCR and\ndemonstrate applications to privacy-preserving Federated Learning (FL) where\nclients \\emph{speak once}. This is a sharp departure from prior multi-round FL\nprotocols whose study was initiated by Bonawitz et al. (CCS, 2017). Moreover,\nunlike the YOSO (You Only Speak Once) model for general secure computation,\n$\\mathsf{OPA}$ eliminates complex committee selection protocols to achieve\nadaptive security. Beyond asymptotic improvements, $\\mathsf{OPA}$ is practical,\noutperforming state-of-the-art solutions. We benchmark logistic regression\nclassifiers for two datasets, while also building an MLP classifier to train on\nMNIST, CIFAR-10, and CIFAR-100 datasets. We build two flavors of $\\caps$ (1)\nfrom (threshold) key homomorphic PRF and (2) from seed homomorphic PRG and\nsecret sharing.", "paper_summary_zh": "<paragraph>我們的研究旨在最小化安全計算中的互動，因為與通訊回合相關的高成本和挑戰，尤其是在有許多客戶端的場景中。在這項研究中，我們重新探討單一伺服器設定中安全聚合的問題，其中單一評估伺服器可以安全地聚合客戶端持有的個別輸入。我們的關鍵貢獻是引入了 One-shot Private Aggregation（$\\mathsf{OPA}$），其中客戶端在每個聚合評估中只說一次（甚至選擇不說話）。由於每個客戶端每個聚合只通訊一次，這簡化了管理中斷和動態參與，與多輪協定形成對比，並與純文字安全聚合保持一致，其中客戶端只互動一次。我們根據 LWR、LWE、類群、DCR 建構 $\\mathsf{OPA}$，並展示了隱私保護聯合學習 (FL) 的應用，其中客戶端「說一次」。這與 Bonawitz 等人發起的先前多輪 FL 協定有明顯區別（CCS，2017）。此外，與一般安全計算的 YOSO（You Only Speak Once）模型不同，$\\mathsf{OPA}$ 消除了複雜的委員會選擇協定以實現適應性安全性。除了漸近改進之外，$\\mathsf{OPA}$ 具有實用性，優於最先進的解決方案。我們對兩個資料集進行邏輯迴歸分類器的基準測試，同時還建立了一個 MLP 分類器，用於訓練 MNIST、CIFAR-10 和 CIFAR-100 資料集。我們建立了兩種風味的 $\\caps$（1）來自（閾值）金鑰同態 PRF 和（2）來自種子同態 PRG 和秘密共享。</paragraph>", "author": "Harish Karthikeyan et.al.", "authors": "Harish Karthikeyan, Antigoni Polychroniadou", "id": "2410.22303v1", "paper_url": "http://arxiv.org/abs/2410.22303v1", "repo": "null"}}