{"2405.04655": {"publish_time": "2024-05-07", "title": "Understanding the Capabilities and Limitations of Large Language Models for Cultural Commonsense", "paper_summary": "Large language models (LLMs) have demonstrated substantial commonsense\nunderstanding through numerous benchmark evaluations. However, their\nunderstanding of cultural commonsense remains largely unexamined. In this\npaper, we conduct a comprehensive examination of the capabilities and\nlimitations of several state-of-the-art LLMs in the context of cultural\ncommonsense tasks. Using several general and cultural commonsense benchmarks,\nwe find that (1) LLMs have a significant discrepancy in performance when tested\non culture-specific commonsense knowledge for different cultures; (2) LLMs'\ngeneral commonsense capability is affected by cultural context; and (3) The\nlanguage used to query the LLMs can impact their performance on\ncultural-related tasks. Our study points to the inherent bias in the cultural\nunderstanding of LLMs and provides insights that can help develop culturally\naware language models.", "paper_summary_zh": "大型語言模型 (LLM) 已通過大量的基準評估證明了其顯著的常識理解能力。然而，它們對文化常識的理解在很大程度上仍未得到檢驗。在本文中，我們對幾個最先進的 LLM 在文化常識任務中的能力和局限性進行了全面檢驗。使用幾個一般和文化常識基準，我們發現 (1) 當針對不同文化的特定文化常識知識進行測試時，LLM 的性能存在顯著差異；(2) LLM 的一般常識能力受文化背景的影響；以及 (3) 用於查詢 LLM 的語言會影響其在與文化相關任務上的性能。我們的研究指出了 LLM 在文化理解中的固有偏差，並提供了可以幫助開發具有文化意識的語言模型的見解。", "author": "Siqi Shen et.al.", "authors": "Siqi Shen, Lajanugen Logeswaran, Moontae Lee, Honglak Lee, Soujanya Poria, Rada Mihalcea", "id": "2405.04655v1", "paper_url": "http://arxiv.org/abs/2405.04655v1", "repo": "null"}}