{"2407.17843": {"publish_time": "2024-07-25", "title": "DragText: Rethinking Text Embedding in Point-based Image Editing", "paper_summary": "Point-based image editing enables accurate and flexible control through\ncontent dragging. However, the role of text embedding in the editing process\nhas not been thoroughly investigated. A significant aspect that remains\nunexplored is the interaction between text and image embeddings. In this study,\nwe show that during the progressive editing of an input image in a diffusion\nmodel, the text embedding remains constant. As the image embedding increasingly\ndiverges from its initial state, the discrepancy between the image and text\nembeddings presents a significant challenge. Moreover, we found that the text\nprompt significantly influences the dragging process, particularly in\nmaintaining content integrity and achieving the desired manipulation. To\nutilize these insights, we propose DragText, which optimizes text embedding in\nconjunction with the dragging process to pair with the modified image\nembedding. Simultaneously, we regularize the text optimization process to\npreserve the integrity of the original text prompt. Our approach can be\nseamlessly integrated with existing diffusion-based drag methods with only a\nfew lines of code.", "paper_summary_zh": "基於點的影像編輯透過內容拖曳實現精準且彈性的控制。然而，文字嵌入在編輯過程中所扮演的角色尚未被徹底研究。文字嵌入與影像嵌入之間的互動是仍未探索的重要面向。在本研究中，我們展示在擴散模型中輸入影像的漸進式編輯過程中，文字嵌入保持不變。隨著影像嵌入與其初始狀態的差異越來越大，影像與文字嵌入之間的差異呈現出重大的挑戰。此外，我們發現文字提示會顯著影響拖曳過程，特別是在維持內容完整性並達成預期的操作。為了利用這些見解，我們提出 DragText，它會最佳化文字嵌入，並結合拖曳過程與修改後的影像嵌入配對。同時，我們規範化文字最佳化過程，以維持原始文字提示的完整性。我們的做法可以無縫整合到現有的基於擴散的拖曳方法中，只需幾行程式碼即可。", "author": "Gayoon Choi et.al.", "authors": "Gayoon Choi, Taejin Jeong, Sujung Hong, Jaehoon Joo, Seong Jae Hwang", "id": "2407.17843v1", "paper_url": "http://arxiv.org/abs/2407.17843v1", "repo": "null"}}