{"2409.14874": {"publish_time": "2024-09-23", "title": "Towards Ground-truth-free Evaluation of Any Segmentation in Medical Images", "paper_summary": "We explore the feasibility and potential of building a ground-truth-free\nevaluation model to assess the quality of segmentations generated by the\nSegment Anything Model (SAM) and its variants in medical imaging. This\nevaluation model estimates segmentation quality scores by analyzing the\ncoherence and consistency between the input images and their corresponding\nsegmentation predictions. Based on prior research, we frame the task of\ntraining this model as a regression problem within a supervised learning\nframework, using Dice scores (and optionally other metrics) along with mean\nsquared error to compute the training loss. The model is trained utilizing a\nlarge collection of public datasets of medical images with segmentation\npredictions from SAM and its variants. We name this model EvanySeg (Evaluation\nof Any Segmentation in Medical Images). Our exploration of convolution-based\nmodels (e.g., ResNet) and transformer-based models (e.g., ViT) suggested that\nViT yields better performance for this task. EvanySeg can be employed for\nvarious tasks, including: (1) identifying poorly segmented samples by detecting\nlow-percentile segmentation quality scores; (2) benchmarking segmentation\nmodels without ground truth by averaging quality scores across test samples;\n(3) alerting human experts to poor-quality segmentation predictions during\nhuman-AI collaboration by applying a threshold within the score space; and (4)\nselecting the best segmentation prediction for each test sample at test time\nwhen multiple segmentation models are available, by choosing the prediction\nwith the highest quality score. Models and code will be made available at\nhttps://github.com/ahjolsenbics/EvanySeg.", "paper_summary_zh": "<paragraph>我們探討建立一個無地面實相的評估模型，以評估由 Segment Anything Model (SAM) 及其在醫學影像中的變體所產生的分割品質的可行性和潛力。此評估模型透過分析輸入影像與其對應分割預測之間的相干性和一致性來估計分割品質分數。根據先前的研究，我們將訓練此模型的任務設定為監督式學習架構中的回歸問題，使用 Dice 分數（以及其他指標，可選擇）與平均平方誤差一起計算訓練損失。此模型使用來自 SAM 及其變體的分割預測的大型公共醫學影像資料集進行訓練。我們將此模型命名為 EvanySeg（醫學影像中任何分割的評估）。我們對基於卷積的模型（例如 ResNet）和基於Transformer的模型（例如 ViT）的探討表明，ViT 在此任務中表現得更好。EvanySeg 可用於各種任務，包括：(1) 透過偵測低百分位數分割品質分數來識別分割不良的樣本；(2) 透過平均測試樣本的品質分數來對沒有地面實相的分割模型進行基準測試；(3) 在人機協作期間，透過在分數空間中應用閾值來提醒人類專家注意品質不佳的分割預測；(4) 在測試時間為每個測試樣本選擇最佳分割預測（當有多個分割模型可用時），透過選擇具有最高品質分數的預測。模型和程式碼將在 https://github.com/ahjolsenbics/EvanySeg 提供。</paragraph>", "author": "Ahjol Senbi et.al.", "authors": "Ahjol Senbi, Tianyu Huang, Fei Lyu, Qing Li, Yuhui Tao, Wei Shao, Qiang Chen, Chengyan Wang, Shuo Wang, Tao Zhou, Yizhe Zhang", "id": "2409.14874v2", "paper_url": "http://arxiv.org/abs/2409.14874v2", "repo": "null"}}