{"2412.04037": {"publish_time": "2024-12-05", "title": "INFP: Audio-Driven Interactive Head Generation in Dyadic Conversations", "paper_summary": "Imagine having a conversation with a socially intelligent agent. It can\nattentively listen to your words and offer visual and linguistic feedback\npromptly. This seamless interaction allows for multiple rounds of conversation\nto flow smoothly and naturally. In pursuit of actualizing it, we propose INFP,\na novel audio-driven head generation framework for dyadic interaction. Unlike\nprevious head generation works that only focus on single-sided communication,\nor require manual role assignment and explicit role switching, our model drives\nthe agent portrait dynamically alternates between speaking and listening state,\nguided by the input dyadic audio. Specifically, INFP comprises a Motion-Based\nHead Imitation stage and an Audio-Guided Motion Generation stage. The first\nstage learns to project facial communicative behaviors from real-life\nconversation videos into a low-dimensional motion latent space, and use the\nmotion latent codes to animate a static image. The second stage learns the\nmapping from the input dyadic audio to motion latent codes through denoising,\nleading to the audio-driven head generation in interactive scenarios. To\nfacilitate this line of research, we introduce DyConv, a large scale dataset of\nrich dyadic conversations collected from the Internet. Extensive experiments\nand visualizations demonstrate superior performance and effectiveness of our\nmethod. Project Page: https://grisoon.github.io/INFP/.", "paper_summary_zh": "想像一下與一個社交智能代理對話。它可以專注聆聽你的話語，並迅速提供視覺和語言回饋。這種無縫的互動允許多輪對話順暢且自然地進行。為了實現它，我們提出了 INFP，一個用於雙人互動的新穎音訊驅動頭部生成架構。與先前僅專注於單邊溝通或需要手動角色分配和明確角色切換的頭部生成作品不同，我們的模型驅動代理肖像在說話和聆聽狀態之間動態交替，由輸入的雙人音訊引導。具體來說，INFP 包含一個基於動作的頭部模仿階段和一個音訊引導的動作生成階段。第一個階段學習將現實生活對話影片中的臉部溝通行為投射到低維動作潛在空間中，並使用動作潛在代碼為靜態影像製作動畫。第二個階段透過去噪學習從輸入的雙人音訊對應到動作潛在代碼，從而導致互動場景中的音訊驅動頭部生成。為了促進這條研究線，我們引入了 DyConv，一個從網際網路收集的大規模豐富雙人對話資料集。廣泛的實驗和視覺化證明了我們方法的優異效能和有效性。專案頁面：https://grisoon.github.io/INFP/。", "author": "Yongming Zhu et.al.", "authors": "Yongming Zhu, Longhao Zhang, Zhengkun Rong, Tianshu Hu, Shuang Liang, Zhipeng Ge", "id": "2412.04037v1", "paper_url": "http://arxiv.org/abs/2412.04037v1", "repo": "null"}}