{"2405.14365": {"publish_time": "2024-05-23", "title": "JiuZhang3.0: Efficiently Improving Mathematical Reasoning by Training Small Data Synthesis Models", "paper_summary": "Mathematical reasoning is an important capability of large language\nmodels~(LLMs) for real-world applications. To enhance this capability, existing\nwork either collects large-scale math-related texts for pre-training, or relies\non stronger LLMs (\\eg GPT-4) to synthesize massive math problems. Both types of\nwork generally lead to large costs in training or synthesis. To reduce the\ncost, based on open-source available texts, we propose an efficient way that\ntrains a small LLM for math problem synthesis, to efficiently generate\nsufficient high-quality pre-training data. To achieve it, we create a dataset\nusing GPT-4 to distill its data synthesis capability into the small LLM.\nConcretely, we craft a set of prompts based on human education stages to guide\nGPT-4, to synthesize problems covering diverse math knowledge and difficulty\nlevels. Besides, we adopt the gradient-based influence estimation method to\nselect the most valuable math-related texts. The both are fed into GPT-4 for\ncreating the knowledge distillation dataset to train the small LLM. We leverage\nit to synthesize 6 million math problems for pre-training our JiuZhang3.0\nmodel, which only needs to invoke GPT-4 API 9.3k times and pre-train on 4.6B\ndata. Experimental results have shown that JiuZhang3.0 achieves\nstate-of-the-art performance on several mathematical reasoning datasets, under\nboth natural language reasoning and tool manipulation settings. Our code and\ndata will be publicly released in\n\\url{https://github.com/RUCAIBox/JiuZhang3.0}.", "paper_summary_zh": "<paragraph>數學推理是大語言模型 (LLM) 在實際應用中的一項重要能力。為了增強此能力，現有工作會收集大量的數學相關文本進行預訓練，或依賴更強大的 LLM（例如 GPT-4）來合成大量的數學問題。這兩種工作通常在訓練或合成中產生高昂的成本。為了降低成本，我們基於開放原始碼的文本提出了一種有效的方法，用於訓練一個小型 LLM 以進行數學問題合成，以有效地產生足夠的高品質預訓練數據。為了實現此目的，我們使用 GPT-4 建立一個資料集，將其數據合成能力提煉到小型 LLM 中。具體來說，我們根據人類教育階段制定了一組提示，以指導 GPT-4，以合成涵蓋多樣化數學知識和難度級別的問題。此外，我們採用基於梯度的影響估計方法來選擇最有價值的數學相關文本。兩者都饋入 GPT-4，用於建立知識提煉資料集，以訓練小型 LLM。我們利用它為我們的 JiuZhang3.0 模型合成了 600 萬個數學問題進行預訓練，這只需要調用 GPT-4 API 9.3k 次，並在 4.6B 的數據上進行預訓練。實驗結果表明，JiuZhang3.0 在多個數學推理資料集上達到了最先進的效能，在自然語言推理和工具操作設定下都是如此。我們的程式碼和數據將在\n\\url{https://github.com/RUCAIBox/JiuZhang3.0} 公開發布。</paragraph>", "author": "Kun Zhou et.al.", "authors": "Kun Zhou, Beichen Zhang, Jiapeng Wang, Zhipeng Chen, Wayne Xin Zhao, Jing Sha, Zhichao Sheng, Shijin Wang, Ji-Rong Wen", "id": "2405.14365v1", "paper_url": "http://arxiv.org/abs/2405.14365v1", "repo": "null"}}