{"2409.18647": {"publish_time": "2024-09-27", "title": "HiCuLR: Hierarchical Curriculum Learning for Rhetorical Role Labeling of Legal Documents", "paper_summary": "Rhetorical Role Labeling (RRL) of legal documents is pivotal for various\ndownstream tasks such as summarization, semantic case search and argument\nmining. Existing approaches often overlook the varying difficulty levels\ninherent in legal document discourse styles and rhetorical roles. In this work,\nwe propose HiCuLR, a hierarchical curriculum learning framework for RRL. It\nnests two curricula: Rhetorical Role-level Curriculum (RC) on the outer layer\nand Document-level Curriculum (DC) on the inner layer. DC categorizes documents\nbased on their difficulty, utilizing metrics like deviation from a standard\ndiscourse structure and exposes the model to them in an easy-to-difficult\nfashion. RC progressively strengthens the model to discern\ncoarse-to-fine-grained distinctions between rhetorical roles. Our experiments\non four RRL datasets demonstrate the efficacy of HiCuLR, highlighting the\ncomplementary nature of DC and RC.", "paper_summary_zh": "法律文件修辭角色標記 (RRL) 對於各種下游任務（例如摘要、語意案例搜尋和論點探勘）至關重要。現有方法通常忽略法律文件論述風格和修辭角色中存在的不同難度等級。在這項工作中，我們提出了 HiCuLR，一個用於 RRL 的分層課程學習框架。它嵌入了兩個課程：外層的修辭角色層級課程 (RC) 和內層的文件層級課程 (DC)。DC 根據難度對文件進行分類，利用標準論述結構的偏差等指標，並以易到難的方式向模型展示這些文件。RC 逐步強化模型，以辨別修辭角色之間粗略到細微的區別。我們在四個 RRL 資料集上的實驗證明了 HiCuLR 的功效，突出了 DC 和 RC 的互補性質。", "author": "T. Y. S. S. Santosh et.al.", "authors": "T. Y. S. S. Santosh, Apolline Isaia, Shiyu Hong, Matthias Grabmair", "id": "2409.18647v1", "paper_url": "http://arxiv.org/abs/2409.18647v1", "repo": "null"}}