{"2408.09734": {"publish_time": "2024-08-19", "title": "Mutually-Aware Feature Learning for Few-Shot Object Counting", "paper_summary": "Few-shot object counting has garnered significant attention for its\npracticality as it aims to count target objects in a query image based on given\nexemplars without the need for additional training. However, there is a\nshortcoming in the prevailing extract-and-match approach: query and exemplar\nfeatures lack interaction during feature extraction since they are extracted\nunaware of each other and later correlated based on similarity. This can lead\nto insufficient target awareness of the extracted features, resulting in target\nconfusion in precisely identifying the actual target when multiple class\nobjects coexist. To address this limitation, we propose a novel framework,\nMutually-Aware FEAture learning(MAFEA), which encodes query and exemplar\nfeatures mutually aware of each other from the outset. By encouraging\ninteraction between query and exemplar features throughout the entire pipeline,\nwe can obtain target-aware features that are robust to a multi-category\nscenario. Furthermore, we introduce a background token to effectively associate\nthe target region of query with exemplars and decouple its background region\nfrom them. Our extensive experiments demonstrate that our model reaches a new\nstate-of-the-art performance on the two challenging benchmarks, FSCD-LVIS and\nFSC-147, with a remarkably reduced degree of the target confusion problem.", "paper_summary_zh": "小样本目标计数因其实用性而备受关注，因为它旨在根据给定的示例在查询图像中计数目标对象，而无需进行额外的训练。然而，流行的提取和匹配方法存在一个缺点：查询和示例特征在特征提取过程中缺乏交互，因为它们在彼此不知情的情况下被提取，并在之后根据相似性进行关联。这会导致提取的特征对目标的感知不足，从而在多个类别对象共存时导致在精确识别实际目标时出现目标混淆。为了解决这一限制，我们提出了一种新颖的框架，即相互感知特征学习 (MAFEA)，它从一开始就对查询和示例特征进行相互感知的编码。通过在整个管道中鼓励查询和示例特征之间的交互，我们可以获得对目标感知的特征，这些特征对多类别场景具有鲁棒性。此外，我们引入了一个背景令牌，以有效地将查询的目标区域与示例关联起来，并将其背景区域与示例分离。我们广泛的实验表明，我们的模型在两个具有挑战性的基准 FSCD-LVIS 和 FSC-147 上达到了新的最先进性能，并且目标混淆问题的程度显著降低。", "author": "Yerim Jeon et.al.", "authors": "Yerim Jeon, Subeen Lee, Jihwan Kim, Jae-Pil Heo", "id": "2408.09734v1", "paper_url": "http://arxiv.org/abs/2408.09734v1", "repo": "null"}}