{"2408.07368": {"publish_time": "2024-08-14", "title": "The Complexity of Manipulation of k-Coalitional Games on Graphs", "paper_summary": "In many settings, there is an organizer who would like to divide a set of\nagents into $k$ coalitions, and cares about the friendships within each\ncoalition. Specifically, the organizer might want to maximize utilitarian\nsocial welfare, maximize egalitarian social welfare, or simply guarantee that\nevery agent will have at least one friend within his coalition. However, in\nmany situations, the organizer is not familiar with the friendship connections,\nand he needs to obtain them from the agents. In this setting, a manipulative\nagent may falsely report friendship connections in order to increase his\nutility. In this paper, we analyze the complexity of finding manipulation in\nsuch $k$-coalitional games on graphs. We also introduce a new type of\nmanipulation, socially-aware manipulation, in which the manipulator would like\nto increase his utility without decreasing the social welfare. We then study\nthe complexity of finding socially-aware manipulation in our setting. Finally,\nwe examine the frequency of socially-aware manipulation and the running time of\nour algorithms via simulation results.", "paper_summary_zh": "在許多情況下，會有一位組織者希望將一組代理劃分為 $k$ 個聯盟，並關心每個聯盟內的友誼。具體而言，組織者可能希望最大化功利主義社會福利、最大化平等主義社會福利，或僅保證每個代理在其聯盟內至少有一位朋友。然而，在許多情況下，組織者並不熟悉友誼關係，他需要從代理中獲取這些關係。在這種情況下，一個具有操縱性的代理可能會虛假報告友誼關係，以增加他的效用。在本文中，我們分析了在圖形上發現這種 $k$-聯盟遊戲中操縱行為的複雜性。我們還引入了一種類型的操縱，即社會意識操縱，其中操縱者希望在不降低社會福利的情況下增加他的效用。然後，我們研究了在我們的環境中發現社會意識操縱的複雜性。最後，我們通過模擬結果檢查了社會意識操縱的頻率和我們演算法的執行時間。", "author": "Hodaya Barr et.al.", "authors": "Hodaya Barr, Yohai Trabelsi, Sarit Kraus, Liam Roditty, Noam Hazon", "id": "2408.07368v1", "paper_url": "http://arxiv.org/abs/2408.07368v1", "repo": "null"}}