{"2501.12599": {"publish_time": "2025-01-22", "title": "Kimi k1.5: Scaling Reinforcement Learning with LLMs", "paper_summary": "Language model pretraining with next token prediction has proved effective\nfor scaling compute but is limited to the amount of available training data.\nScaling reinforcement learning (RL) unlocks a new axis for the continued\nimprovement of artificial intelligence, with the promise that large language\nmodels (LLMs) can scale their training data by learning to explore with\nrewards. However, prior published work has not produced competitive results. In\nlight of this, we report on the training practice of Kimi k1.5, our latest\nmulti-modal LLM trained with RL, including its RL training techniques,\nmulti-modal data recipes, and infrastructure optimization. Long context scaling\nand improved policy optimization methods are key ingredients of our approach,\nwhich establishes a simplistic, effective RL framework without relying on more\ncomplex techniques such as Monte Carlo tree search, value functions, and\nprocess reward models. Notably, our system achieves state-of-the-art reasoning\nperformance across multiple benchmarks and modalities -- e.g., 77.5 on AIME,\n96.2 on MATH 500, 94-th percentile on Codeforces, 74.9 on MathVista -- matching\nOpenAI's o1. Moreover, we present effective long2short methods that use\nlong-CoT techniques to improve short-CoT models, yielding state-of-the-art\nshort-CoT reasoning results -- e.g., 60.8 on AIME, 94.6 on MATH500, 47.3 on\nLiveCodeBench -- outperforming existing short-CoT models such as GPT-4o and\nClaude Sonnet 3.5 by a large margin (up to +550%).", "paper_summary_zh": "語言模型預訓練加上下一個符號預測已證明對於擴充運算有效，但受限於可用的訓練資料量。擴充強化學習 (RL) 為持續改善人工智慧解鎖了一個新軸，承諾大型語言模型 (LLM) 能透過學習探索獎勵來擴充他們的訓練資料。然而，之前發布的作品尚未產生有競爭力的結果。有鑑於此，我們回報 Kimi k1.5 的訓練實務，這是我們最新的多模態 LLM，使用 RL 訓練，包括其 RL 訓練技巧、多模態資料食譜和基礎架構最佳化。長脈絡擴充和改善的策略最佳化方法是我們方法中的關鍵要素，建立了一個簡潔、有效的 RL 架構，而不依賴於更複雜的技巧，例如蒙地卡羅樹狀搜尋、價值函數和處理獎勵模型。值得注意的是，我們的系統在多個基準和模式中達成最先進的推理效能——例如，AIME 中的 77.5、MATH 500 中的 96.2、Codeforces 中的 94 百分位、MathVista 中的 74.9——匹配 OpenAI 的 o1。此外，我們提出有效的 long2short 方法，使用 long-CoT 技巧來改善 short-CoT 模型，產生最先進的 short-CoT 推理結果——例如，AIME 中的 60.8、MATH500 中的 94.6、LiveCodeBench 中的 47.3——大幅超越現有的 short-CoT 模型，例如 GPT-4o 和 Claude Sonnet 3.5（高達 +550%）。", "author": "Kimi Team et.al.", "authors": "Kimi Team, Angang Du, Bofei Gao, Bowei Xing, Changjiu Jiang, Cheng Chen, Cheng Li, Chenjun Xiao, Chenzhuang Du, Chonghua Liao, Chuning Tang, Congcong Wang, Dehao Zhang, Enming Yuan, Enzhe Lu, Fengxiang Tang, Flood Sung, Guangda Wei, Guokun Lai, Haiqing Guo, Han Zhu, Hao Ding, Hao Hu, Hao Yang, Hao Zhang, Haotian Yao, Haotian Zhao, Haoyu Lu, Haoze Li, Haozhen Yu, Hongcheng Gao, Huabin Zheng, Huan Yuan, Jia Chen, Jianhang Guo, Jianlin Su, Jianzhou Wang, Jie Zhao, Jin Zhang, Jingyuan Liu, Junjie Yan, Junyan Wu, Lidong Shi, Ling Ye, Longhui Yu, Mengnan Dong, Neo Zhang, Ningchen Ma, Qiwei Pan, Qucheng Gong, Shaowei Liu, Shengling Ma, Shupeng Wei, Sihan Cao, Siying Huang, Tao Jiang, Weihao Gao, Weimin Xiong, Weiran He, Weixiao Huang, Wenhao Wu, Wenyang He, Xianghui Wei, Xianqing Jia, Xingzhe Wu, Xinran Xu, Xinxing Zu, Xinyu Zhou, Xuehai Pan, Y. Charles, Yang Li, Yangyang Hu, Yangyang Liu, Yanru Chen, Yejie Wang, Yibo Liu, Yidao Qin, Yifeng Liu, Ying Yang, Yiping Bao, Yulun Du, Yuxin Wu, Yuzhi Wang, Zaida Zhou, Zhaoji Wang, Zhaowei Li, Zhen Zhu, Zheng Zhang, Zhexu Wang, Zhilin Yang, Zhiqi Huang, Zihao Huang, Ziyao Xu, Zonghan Yang", "id": "2501.12599v1", "paper_url": "http://arxiv.org/abs/2501.12599v1", "repo": "null"}}