{"2412.19108": {"publish_time": "2024-12-26", "title": "Graph Mixture of Experts and Memory-augmented Routers for Multivariate Time Series Anomaly Detection", "paper_summary": "Multivariate time series (MTS) anomaly detection is a critical task that\ninvolves identifying abnormal patterns or events in data that consist of\nmultiple interrelated time series. In order to better model the complex\ninterdependence between entities and the various inherent characteristics of\neach entity, the GNN based methods are widely adopted by existing methods. In\neach layer of GNN, node features aggregate information from their neighboring\nnodes to update their information. In doing so, from shallow layer to deep\nlayer in GNN, original individual node features continue to be weakened and\nmore structural information,i.e., from short-distance neighborhood to\nlong-distance neighborhood, continues to be enhanced. However, research to date\nhas largely ignored the understanding of how hierarchical graph information is\nrepresented and their characteristics that can benefit anomaly detection.\nExisting methods simply leverage the output from the last layer of GNN for\nanomaly estimation while neglecting the essential information contained in the\nintermediate GNN layers. To address such limitations, in this paper, we propose\na Graph Mixture of Experts (Graph-MoE) network for multivariate time series\nanomaly detection, which incorporates the mixture of experts (MoE) module to\nadaptively represent and integrate hierarchical multi-layer graph information\ninto entity representations. It is worth noting that our Graph-MoE can be\nintegrated into any GNN-based MTS anomaly detection method in a plug-and-play\nmanner. In addition, the memory-augmented routers are proposed in this paper to\ncapture the correlation temporal information in terms of the global historical\nfeatures of MTS to adaptively weigh the obtained entity representations to\nachieve successful anomaly estimation. Extensive experiments on five\nchallenging datasets prove the superiority of our approach and each proposed\nmodule.", "paper_summary_zh": "多變量時間序列 (MTS) 異常偵測是一項重要的任務，涉及識別由多個相互關聯的時間序列組成的資料中的異常模式或事件。為了更好地模擬實體之間複雜的相互依賴性以及每個實體的各種固有特性，現有方法廣泛採用基於 GNN 的方法。在 GNN 的每一層中，節點特徵會彙總來自其鄰近節點的資訊，以更新其資訊。這樣一來，從 GNN 中的淺層到深層，原始的個別節點特徵會持續弱化，而更多的結構資訊（即從短距離鄰域到長距離鄰域）會持續增強。然而，迄今為止的研究在很大程度上忽略了對分層圖形資訊如何表示及其可以使異常偵測受益的特性。現有方法只是利用 GNN 最後一層的輸出進行異常估計，而忽略了中間 GNN 層中包含的重要資訊。為了解決這些限制，在本文中，我們提出了一個圖專家混合 (Graph-MoE) 網路，用於多變量時間序列異常偵測，它結合了專家混合 (MoE) 模組，以自適應地表示和整合分層多層圖形資訊到實體表示中。值得注意的是，我們的 Graph-MoE 可以以即插即用的方式整合到任何基於 GNN 的 MTS 異常偵測方法中。此外，本文提出了記憶增強路由器，以根據 MTS 的整體歷史特徵擷取相關的時間資訊，以自適應地加權獲得的實體表示，以實現成功的異常估計。在五個具有挑戰性的資料集上進行的廣泛實驗證明了我們的方法和每個提出的模組的優越性。", "author": "Xiaoyu Huang et.al.", "authors": "Xiaoyu Huang, Weidong Chen, Bo Hu, Zhendong Mao", "id": "2412.19108v1", "paper_url": "http://arxiv.org/abs/2412.19108v1", "repo": "null"}}