{"2502.12921": {"publish_time": "2025-02-18", "title": "Q-STRUM Debate: Query-Driven Contrastive Summarization for Recommendation Comparison", "paper_summary": "Query-driven recommendation with unknown items poses a challenge for users to\nunderstand why certain items are appropriate for their needs. Query-driven\nContrastive Summarization (QCS) is a methodology designed to address this issue\nby leveraging language-based item descriptions to clarify contrasts between\nthem. However, existing state-of-the-art contrastive summarization methods such\nas STRUM-LLM fall short of this goal. To overcome these limitations, we\nintroduce Q-STRUM Debate, a novel extension of STRUM-LLM that employs\ndebate-style prompting to generate focused and contrastive summarizations of\nitem aspects relevant to a query. Leveraging modern large language models\n(LLMs) as powerful tools for generating debates, Q-STRUM Debate provides\nenhanced contrastive summaries. Experiments across three datasets demonstrate\nthat Q-STRUM Debate yields significant performance improvements over existing\nmethods on key contrastive summarization criteria, thus introducing a novel and\nperformant debate prompting methodology for QCS.", "paper_summary_zh": "以未知項目進行的查詢驅動推薦對使用者來說是一項挑戰，他們難以理解為何某些項目適合自己的需求。查詢驅動對比摘要 (QCS) 是一種方法，旨在透過利用基於語言的項目描述來釐清項目之間的對比，以解決這個問題。然而，現有的最先進對比摘要方法（例如 STRUM-LLM）並未達成此目標。為了克服這些限制，我們引進 Q-STRUM Debate，一種 STRUM-LLM 的新延伸，它採用辯論式提示來產生與查詢相關的項目面向的重點式對比摘要。透過利用現代大型語言模型 (LLM) 作為產生辯論的強大工具，Q-STRUM Debate 提供增強的對比摘要。透過三個資料集的實驗證明，Q-STRUM Debate 在關鍵的對比摘要標準上，比現有方法有顯著的效能改善，因此為 QCS 引進一種新穎且高性能的辯論提示方法。", "author": "George-Kirollos Saad et.al.", "authors": "George-Kirollos Saad, Scott Sanner", "id": "2502.12921v1", "paper_url": "http://arxiv.org/abs/2502.12921v1", "repo": "null"}}