{"2410.19702": {"publish_time": "2024-10-25", "title": "TimeSuite: Improving MLLMs for Long Video Understanding via Grounded Tuning", "paper_summary": "Multimodal Large Language Models (MLLMs) have demonstrated impressive\nperformance in short video understanding. However, understanding long-form\nvideos still remains challenging for MLLMs. This paper proposes TimeSuite, a\ncollection of new designs to adapt the existing short-form video MLLMs for long\nvideo understanding, including a simple yet efficient framework to process long\nvideo sequence, a high-quality video dataset for grounded tuning of MLLMs, and\na carefully-designed instruction tuning task to explicitly incorporate the\ngrounding supervision in the traditional QA format. Specifically, based on\nVideoChat, we propose our long-video MLLM, coined as VideoChat-T, by\nimplementing a token shuffling to compress long video tokens and introducing\nTemporal Adaptive Position Encoding (TAPE) to enhance the temporal awareness of\nvisual representation. Meanwhile, we introduce the TimePro, a comprehensive\ngrounding-centric instruction tuning dataset composed of 9 tasks and 349k\nhigh-quality grounded annotations. Notably, we design a new instruction tuning\ntask type, called Temporal Grounded Caption, to peform detailed video\ndescriptions with the corresponding time stamps prediction. This explicit\ntemporal location prediction will guide MLLM to correctly attend on the visual\ncontent when generating description, and thus reduce the hallucination risk\ncaused by the LLMs. Experimental results demonstrate that our TimeSuite\nprovides a successful solution to enhance the long video understanding\ncapability of short-form MLLM, achieving improvement of 5.6% and 6.8% on the\nbenchmarks of Egoschema and VideoMME, respectively. In addition, VideoChat-T\nexhibits robust zero-shot temporal grounding capabilities, significantly\noutperforming the existing state-of-the-art MLLMs. After fine-tuning, it\nperforms on par with the traditional supervised expert models.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 已在短视频理解中展现了令人印象深刻的性能。然而，理解长篇视频对于 MLLM 来说仍然具有挑战性。本文提出了 TimeSuite，这是一组新设计，用于调整现有的短篇视频 MLLM 以理解长视频，包括一个简单但高效的框架来处理长视频序列、一个用于 MLLM 的基础微调的高质量视频数据集，以及一个精心设计的指令微调任务，以明确地将基础监督纳入传统的问答格式。具体来说，基于 VideoChat，我们提出了我们的长视频 MLLM，称为 VideoChat-T，通过实现令牌改组来压缩长视频令牌，并引入时间自适应位置编码 (TAPE) 来增强视觉表示的时间感知。同时，我们引入了 TimePro，这是一个全面的以基础为中心的指令微调数据集，由 9 个任务和 349k 个高质量的基础注释组成。值得注意的是，我们设计了一种新的指令微调任务类型，称为时间基础字幕，用于执行详细的视频描述，并预测相应的时间戳。这种明确的时间位置预测将指导 MLLM 在生成描述时正确关注视觉内容，从而降低由 LLM 引起的幻觉风险。实验结果表明，我们的 TimeSuite 提供了一个成功的解决方案，可以增强短篇 MLLM 的长视频理解能力，分别在 Egoschema 和 VideoMME 的基准上实现了 5.6% 和 6.8% 的改进。此外，VideoChat-T 展示了强大的零样本时间基础能力，明显优于现有的最先进的 MLLM。经过微调后，它的性能与传统的监督专家模型相当。", "author": "Xiangyu Zeng et.al.", "authors": "Xiangyu Zeng, Kunchang Li, Chenting Wang, Xinhao Li, Tianxiang Jiang, Ziang Yan, Songze Li, Yansong Shi, Zhengrong Yue, Yi Wang, Yali Wang, Yu Qiao, Limin Wang", "id": "2410.19702v1", "paper_url": "http://arxiv.org/abs/2410.19702v1", "repo": "null"}}