{"2409.06016": {"publish_time": "2024-09-09", "title": "Deep Generative Model for Mechanical System Configuration Design", "paper_summary": "Generative AI has made remarkable progress in addressing various design\nchallenges. One prominent area where generative AI could bring significant\nvalue is in engineering design. In particular, selecting an optimal set of\ncomponents and their interfaces to create a mechanical system that meets design\nrequirements is one of the most challenging and time-consuming tasks for\nengineers. This configuration design task is inherently challenging due to its\ncategorical nature, multiple design requirements a solution must satisfy, and\nthe reliance on physics simulations for evaluating potential solutions. These\ncharacteristics entail solving a combinatorial optimization problem with\nmultiple constraints involving black-box functions. To address this challenge,\nwe propose a deep generative model to predict the optimal combination of\ncomponents and interfaces for a given design problem. To demonstrate our\napproach, we solve a gear train synthesis problem by first creating a synthetic\ndataset using a grammar, a parts catalogue, and a physics simulator. We then\ntrain a Transformer using this dataset, named GearFormer, which can not only\ngenerate quality solutions on its own, but also augment search methods such as\nan evolutionary algorithm and Monte Carlo tree search. We show that GearFormer\noutperforms such search methods on their own in terms of satisfying the\nspecified design requirements with orders of magnitude faster generation time.\nAdditionally, we showcase the benefit of hybrid methods that leverage both\nGearFormer and search methods, which further improve the quality of the\nsolutions.", "paper_summary_zh": "生成式 AI 在解決各種設計挑戰方面取得了顯著進展。生成式 AI 可能帶來顯著價值的一個顯著領域是工程設計。特別是，選擇一組最佳的組件及其介面，以建立符合設計要求的機械系統，是工程師最具挑戰性和最耗時的工作之一。此組態設計任務本質上具有挑戰性，因為其分類性質、解決方案必須滿足的各種設計要求，以及依賴物理模擬來評估潛在解決方案。這些特性需要解決一個組合最佳化問題，其中包含涉及黑盒函數的各種約束。為了應對這一挑戰，我們提出了一個深度生成模型，以預測特定設計問題的組件和介面的最佳組合。為了展示我們的做法，我們首先使用語法、零件目錄和物理模擬器建立一個合成資料集，來解決齒輪組合成問題。然後，我們使用此資料集訓練一個 Transformer，命名為 GearFormer，它不僅可以自行產生高品質的解決方案，還可以擴充搜尋方法，例如演化演算法和蒙地卡羅樹搜尋。我們展示了 GearFormer 在滿足指定設計要求方面優於這些搜尋方法，而且生成時間快了幾個數量級。此外，我們展示了同時利用 GearFormer 和搜尋方法的混合方法的優點，這進一步提高了解決方案的品質。", "author": "Yasaman Etesam et.al.", "authors": "Yasaman Etesam, Hyunmin Cheong, Mohammadmehdi Ataei, Pradeep Kumar Jayaraman", "id": "2409.06016v1", "paper_url": "http://arxiv.org/abs/2409.06016v1", "repo": "null"}}