{"2405.18922": {"publish_time": "2024-05-29", "title": "Understanding and Addressing the Under-Translation Problem from the Perspective of Decoding Objective", "paper_summary": "Neural Machine Translation (NMT) has made remarkable progress over the past\nyears. However, under-translation and over-translation remain two challenging\nproblems in state-of-the-art NMT systems. In this work, we conduct an in-depth\nanalysis on the underlying cause of under-translation in NMT, providing an\nexplanation from the perspective of decoding objective. To optimize the beam\nsearch objective, the model tends to overlook words it is less confident about,\nleading to the under-translation phenomenon. Correspondingly, the model's\nconfidence in predicting the End Of Sentence (EOS) diminishes when\nunder-translation occurs, serving as a mild penalty for under-translated\ncandidates. Building upon this analysis, we propose employing the confidence of\npredicting EOS as a detector for under-translation, and strengthening the\nconfidence-based penalty to penalize candidates with a high risk of\nunder-translation. Experiments on both synthetic and real-world data show that\nour method can accurately detect and rectify under-translated outputs, with\nminor impact on other correct translations.", "paper_summary_zh": "神經機器翻譯 (NMT) 近年來取得顯著進展。然而，譯漏和譯過頭仍然是現今最先進的 NMT 系統中的兩個挑戰性問題。在此研究中，我們深入探討 NMT 中譯漏的根本原因，並從解碼目標的角度提供解釋。為了最佳化波束搜尋目標，模型傾向於忽略它較不確定的字詞，導致譯漏現象。相對應地，當譯漏發生時，模型預測句子結束 (EOS) 的信心會降低，作為對譯漏候選項的輕微懲罰。根據此分析，我們建議使用預測 EOS 的信心作為譯漏的偵測器，並強化基於信心的懲罰，以懲罰具有高譯漏風險的候選項。在合成和真實世界資料上的實驗顯示，我們的方法可以準確偵測和修正譯漏的輸出，對其他正確翻譯的影響很小。", "author": "Chenze Shao et.al.", "authors": "Chenze Shao, Fandong Meng, Jiali Zeng, Jie Zhou", "id": "2405.18922v1", "paper_url": "http://arxiv.org/abs/2405.18922v1", "repo": "null"}}