{"2406.15319": {"publish_time": "2024-06-21", "title": "LongRAG: Enhancing Retrieval-Augmented Generation with Long-context LLMs", "paper_summary": "In traditional RAG framework, the basic retrieval units are normally short.\nThe common retrievers like DPR normally work with 100-word Wikipedia\nparagraphs. Such a design forces the retriever to search over a large corpus to\nfind the `needle' unit. In contrast, the readers only need to extract answers\nfrom the short retrieved units. Such an imbalanced `heavy' retriever and\n`light' reader design can lead to sub-optimal performance. In order to\nalleviate the imbalance, we propose a new framework LongRAG, consisting of a\n`long retriever' and a `long reader'. LongRAG processes the entire Wikipedia\ninto 4K-token units, which is 30x longer than before. By increasing the unit\nsize, we significantly reduce the total units from 22M to 700K. This\nsignificantly lowers the burden of retriever, which leads to a remarkable\nretrieval score: answer recall@1=71% on NQ (previously 52%) and answer\nrecall@2=72% (previously 47%) on HotpotQA (full-wiki). Then we feed the top-k\nretrieved units ($\\approx$ 30K tokens) to an existing long-context LLM to\nperform zero-shot answer extraction. Without requiring any training, LongRAG\nachieves an EM of 62.7% on NQ, which is the best known result. LongRAG also\nachieves 64.3% on HotpotQA (full-wiki), which is on par of the SoTA model. Our\nstudy offers insights into the future roadmap for combining RAG with\nlong-context LLMs.", "paper_summary_zh": "在傳統的 RAG 框架中，基本的檢索單元通常很短。\n像 DPR 這樣的常見檢索器通常處理 100 字的維基百科段落。\n這種設計迫使檢索器在大型語料庫中搜尋以找到「針頭」單元。\n相反地，讀者只需要從檢索到的短單元中提取答案。\n這種不平衡的「重」檢索器和「輕」讀取器設計可能會導致次優的效能。\n為了緩解這種不平衡，我們提出了一個新的框架 LongRAG，它由一個「長檢索器」和一個「長讀取器」組成。\nLongRAG 將整個維基百科處理成 4K 令牌單元，比以前長 30 倍。\n透過增加單元大小，我們將總單元數從 22M 大幅減少到 700K。\n這顯著降低了檢索器的負擔，從而產生了顯著的檢索分數：\nNQ 上的答案召回率@1=71%（以前為 52%），HotpotQA（全維基）上的答案召回率@2=72%（以前為 47%）。\n然後，我們將前 k 個檢索到的單元（大約 30K 個令牌）提供給現有的長語境 LLM，以執行零次學習答案提取。\nLongRAG 無需任何訓練，在 NQ 上實現了 62.7% 的 EM，這是已知最好的結果。\nLongRAG 在 HotpotQA（全維基）上也達到了 64.3%，這與 SoTA 模型相當。\n我們的研究為結合 RAG 與長語境 LLM 的未來路線圖提供了見解。", "author": "Ziyan Jiang et.al.", "authors": "Ziyan Jiang, Xueguang Ma, Wenhu Chen", "id": "2406.15319v1", "paper_url": "http://arxiv.org/abs/2406.15319v1", "repo": "null"}}