{"2407.20595": {"publish_time": "2024-07-30", "title": "Harvesting Textual and Structured Data from the HAL Publication Repository", "paper_summary": "HAL (Hyper Articles en Ligne) is the French national publication repository,\nused by most higher education and research organizations for their open science\npolicy. As a digital library, it is a rich repository of scholarly documents,\nbut its potential for advanced research has been underutilized. We present\nHALvest, a unique dataset that bridges the gap between citation networks and\nthe full text of papers submitted on HAL. We craft our dataset by filtering HAL\nfor scholarly publications, resulting in approximately 700,000 documents,\nspanning 34 languages across 13 identified domains, suitable for language model\ntraining, and yielding approximately 16.5 billion tokens (with 8 billion in\nFrench and 7 billion in English, the most represented languages). We transform\nthe metadata of each paper into a citation network, producing a directed\nheterogeneous graph. This graph includes uniquely identified authors on HAL, as\nwell as all open submitted papers, and their citations. We provide a baseline\nfor authorship attribution using the dataset, implement a range of\nstate-of-the-art models in graph representation learning for link prediction,\nand discuss the usefulness of our generated knowledge graph structure.", "paper_summary_zh": "HAL（線上超連結文章）是法國國家出版物資料庫，\n大多數高等教育和研究組織都使用它來制定開放科學\n政策。作為一個數位圖書館，它是一個豐富的學術文件資料庫，\n但它在進階研究的潛力尚未被充分利用。我們提出\nHALvest，一個獨特的資料集，它彌補了引文網路和\n在 HAL 上提交的論文全文之間的差距。我們透過篩選 HAL\n中的學術出版品來建立我們的資料集，最後得到約 70 萬份文件，\n涵蓋 13 個已識別領域的 34 種語言，適合語言模型\n訓練，並產生約 165 億個詞彙（其中法文有 80 億個，\n英文有 70 億個，是最具代表性的語言）。我們將\n每篇論文的元資料轉換成引文網路，產生一個有向\n異質圖形。此圖形包含在 HAL 上唯一識別的作者，以及\n所有公開提交的論文及其引文。我們提供一個基準\n使用資料集進行作者歸屬，實作一系列\n最先進的圖形表示學習模型進行連結預測，\n並討論我們產生的知識圖形結構的實用性。", "author": "Francis Kulumba et.al.", "authors": "Francis Kulumba, Wissam Antoun, Guillaume Vimont, Laurent Romary", "id": "2407.20595v1", "paper_url": "http://arxiv.org/abs/2407.20595v1", "repo": "null"}}