{"2409.10197": {"publish_time": "2024-09-16", "title": "Fit and Prune: Fast and Training-free Visual Token Pruning for Multi-modal Large Language Models", "paper_summary": "Recent progress in Multimodal Large Language Models(MLLMs) often use large\nimage tokens to compensate the visual shortcoming of MLLMs, which not only\nexhibits obvious redundancy but also greatly exacerbates the already high\ncomputation. Token pruning is an effective solution for speeding up MLLMs, but\nwhen and how to drop tokens still remains a challenge. In this paper, we\npropose a novel and training-free approach for the effective visual token\npruning of MLLMs, termed FitPrune, which can quickly produce a complete pruning\nrecipe for MLLMs according to a pre-defined budget. Specifically, FitPrune\nconsiders token pruning as a statistical problem of MLLM and its objective is\nto find out an optimal pruning scheme that can minimize the divergence of the\nattention distributions before and after pruning. In practice, FitPrune can be\nquickly accomplished based on the attention statistics from a small batch of\ninference data, avoiding the expensive trials of MLLMs. According to the\npruning recipe, an MLLM can directly remove the redundant visual tokens of\ndifferent examples during inference. To validate FitPrune, we apply it to a set\nof recent MLLMs, including LLaVA-1.5, LLaVA-HR and LLaVA-NEXT, and conduct\nextensive experiments on a set of benchmarks. The experimental results show\nthat our FitPrune can not only reduce the computational complexity to a large\nextent, while retaining high performance, e.g., -54.9% FLOPs for LLaVA-NEXT\nwith only 0.5% accuracy drop. Notably, the pruning recipe can be obtained in\nabout 5 minutes. Our code is available at https://github.com/ywh187/FitPrune.", "paper_summary_zh": "多模态大语言模型 (MLLM) 的最新进展经常使用大型图像标记来弥补 MLLM 的视觉缺陷，这不仅表现出明显的冗余，而且还极大地加剧了本已很高的计算量。标记剪枝是加速 MLLM 的有效解决方案，但何时以及如何丢弃标记仍然是一个挑战。在本文中，我们提出了一种新颖且无需训练的方法，用于有效地对 MLLM 的视觉标记进行剪枝，称为 FitPrune，它可以根据预定义的预算快速生成 MLLM 的完整剪枝方案。具体来说，FitPrune 将标记剪枝视为 MLLM 的统计问题，其目标是找出一种最优剪枝方案，该方案可以最小化剪枝前后注意力分布的差异。在实践中，FitPrune 可以根据一小批推理数据的注意力统计数据快速完成，避免了对 MLLM 进行昂贵的试验。根据剪枝方案，MLLM 可以在推理过程中直接移除不同示例的冗余视觉标记。为了验证 FitPrune，我们将其应用于一组最新的 MLLM，包括 LLaVA-1.5、LLaVA-HR 和 LLaVA-NEXT，并在基准测试集上进行了广泛的实验。实验结果表明，我们的 FitPrune 不仅可以将计算复杂度降低很大程度，同时保持高性能，例如，LLaVA-NEXT 的 FLOP 减少了 -54.9%，而准确度仅下降了 0.5%。值得注意的是，剪枝方案可以在大约 5 分钟内获得。我们的代码可在 https://github.com/ywh187/FitPrune 获得。", "author": "Weihao Ye et.al.", "authors": "Weihao Ye, Qiong Wu, Wenhao Lin, Yiyi Zhou", "id": "2409.10197v1", "paper_url": "http://arxiv.org/abs/2409.10197v1", "repo": "null"}}