{"2502.14743": {"publish_time": "2025-02-20", "title": "Multi-Agent Coordination across Diverse Applications: A Survey", "paper_summary": "Multi-agent coordination studies the underlying mechanism enabling the\ntrending spread of diverse multi-agent systems (MAS) and has received\nincreasing attention, driven by the expansion of emerging applications and\nrapid AI advances. This survey outlines the current state of coordination\nresearch across applications through a unified understanding that answers four\nfundamental coordination questions: (1) what is coordination; (2) why\ncoordination; (3) who to coordinate with; and (4) how to coordinate. Our\npurpose is to explore existing ideas and expertise in coordination and their\nconnections across diverse applications, while identifying and highlighting\nemerging and promising research directions. First, general coordination\nproblems that are essential to varied applications are identified and analyzed.\nSecond, a number of MAS applications are surveyed, ranging from widely studied\ndomains, e.g., search and rescue, warehouse automation and logistics, and\ntransportation systems, to emerging fields including humanoid and\nanthropomorphic robots, satellite systems, and large language models (LLMs).\nFinally, open challenges about the scalability, heterogeneity, and learning\nmechanisms of MAS are analyzed and discussed. In particular, we identify the\nhybridization of hierarchical and decentralized coordination, human-MAS\ncoordination, and LLM-based MAS as promising future directions.", "paper_summary_zh": "多智能體協調研究探討了促成各種多智能體系統 (MAS) 流行擴散的底層機制，並隨著新興應用擴展和 AI 快速進展而受到越來越多的關注。這項調查透過統一的理解來概述協調研究的現狀，回答了四個基本的協調問題：(1) 什麼是協調；(2) 為什麼協調；(3) 與誰協調；以及 (4) 如何協調。我們的目的是探索協調中現有的想法和專業知識，以及它們在不同應用中的關聯，同時找出並強調新興且有前景的研究方向。首先，找出並分析了對各種應用至關重要的協調問題。其次，調查了許多 MAS 應用，範圍從廣泛研究的領域（例如搜尋和救援、倉庫自動化和物流，以及運輸系統），到新興領域，包括人形機器人和擬人機器人、衛星系統和大語言模型 (LLM)。最後，分析並討論了有關 MAS 的可擴充性、異質性和學習機制的開放挑戰。特別是，我們將分層協調和分散式協調、人類-MAS 協調和基於 LLM 的 MAS 的混合視為有前景的未來方向。", "author": "Lijun Sun et.al.", "authors": "Lijun Sun, Yijun Yang, Qiqi Duan, Yuhui Shi, Chao Lyu, Yu-Cheng Chang, Chin-Teng Lin, Yang Shen", "id": "2502.14743v1", "paper_url": "http://arxiv.org/abs/2502.14743v1", "repo": "null"}}