{"2407.14212": {"publish_time": "2024-07-19", "title": "Braille-to-Speech Generator: Audio Generation Based on Joint Fine-Tuning of CLIP and Fastspeech2", "paper_summary": "An increasing number of Chinese people are troubled by different degrees of\nvisual impairment, which has made the modal conversion between a single image\nor video frame in the visual field and the audio expressing the same\ninformation a research hotspot. Deep learning technologies such as OCR+Vocoder\nand Im2Wav enable English audio synthesis or image-to-sound matching in a\nself-supervised manner. However, the audio data used for training is limited\nand English is not universal for visually impaired people with different\neducational levels. Therefore, for the sake of solving the problems of data\nvolume and language applicability to improve the reading efficiency of visually\nimpaired people, a set of image-to-speech framework CLIP-KNN-Fastspeech2 based\non the Chinese context was constructed. The framework integrates multiple basic\nmodels and adopts the strategy of independent pre-training and joint\nfine-tuning. First, the Chinese CLIP and Fastspeech2 text-to-speech models were\npre-trained on two public datasets, MUGE and Baker, respectively, and their\nconvergence was verified. Subsequently, joint fine-tuning was performed using a\nself-built Braille image dataset. Experimental results on multiple public\ndatasets such as VGGSound, Flickr8k, ImageHear, and the self-built Braille\ndataset BIT-DP show that the model has improved objective indicators such as\nBLEU4,FAD(Fr\\'echet Audio Distance), WER(Word Error Ratio), and even inference\nspeed. This verifies that the constructed model still has the ability to\nsynthesize high-quality speech under limited data, and also proves the\neffectiveness of the joint training strategy that integrates multiple basic\nmodels.", "paper_summary_zh": "<paragraph>越來越多的中國人飽受不同程度的視力障礙困擾，這使得視覺場景中的單幅圖像或影片幀與表達相同資訊的音訊之間的模態轉換成為研究熱點。OCR+Vocoder 和 Im2Wav 等深度學習技術以自監督的方式實現英文音訊合成或影像轉聲音的匹配。然而，用於訓練的音訊資料有限，且英文對於不同教育程度的視障人士而言並非通用。因此，為了解決資料量和語言適用性問題以提升視障人士的閱讀效率，構建了一套基於中文語境的影像轉語音框架 CLIP-KNN-Fastspeech2。該框架整合多個基礎模型，採用獨立預訓練和聯合微調的策略。首先，分別在兩個公開資料集 MUGE 和 Baker 上預訓練中文 CLIP 和 Fastspeech2 文本轉語音模型，並驗證其收斂性。隨後，使用自建的點字影像資料集進行聯合微調。在 VGGSound、Flickr8k、ImageHear 等多個公開資料集和自建點字資料集 BIT-DP 上的實驗結果表明，該模型在 BLEU4、FAD（Fréchet Audio Distance）、WER（Word Error Ratio） 等客觀指標上均有提升，甚至推理速度也有所提升。這驗證了所構建的模型在資料量受限的情況下仍具備合成高品質語音的能力，也證明了整合多個基礎模型的聯合訓練策略的有效性。</paragraph>", "author": "Chun Xu et.al.", "authors": "Chun Xu, En-Wei Sun", "id": "2407.14212v1", "paper_url": "http://arxiv.org/abs/2407.14212v1", "repo": "null"}}