{"2407.17112": {"publish_time": "2024-07-24", "title": "Neural Dueling Bandits", "paper_summary": "Contextual dueling bandit is used to model the bandit problems, where a\nlearner's goal is to find the best arm for a given context using observed noisy\npreference feedback over the selected arms for the past contexts. However,\nexisting algorithms assume the reward function is linear, which can be complex\nand non-linear in many real-life applications like online recommendations or\nranking web search results. To overcome this challenge, we use a neural network\nto estimate the reward function using preference feedback for the previously\nselected arms. We propose upper confidence bound- and Thompson sampling-based\nalgorithms with sub-linear regret guarantees that efficiently select arms in\neach round. We then extend our theoretical results to contextual bandit\nproblems with binary feedback, which is in itself a non-trivial contribution.\nExperimental results on the problem instances derived from synthetic datasets\ncorroborate our theoretical results.", "paper_summary_zh": "情境對決多臂機用於對多臂機問題進行建模，在該問題中，學習者的目標是使用在過去情境中對所選臂進行觀察到的帶噪聲的偏好回饋，找到給定情境下的最佳臂。然而，現有演算法假設獎勵函數是線性的，而這在許多現實生活應用中可能是複雜且非線性的，例如線上推薦或對網路搜尋結果進行排名。為了克服這個挑戰，我們使用神經網路來估計獎勵函數，並使用先前選擇的臂的偏好回饋。我們提出具有次線性後悔保證的上置信界和湯普森抽樣演算法，這些演算法可以在每一輪有效地選擇臂。然後，我們將理論結果擴展到具有二元回饋的情境多臂機問題，這本身就是一個不平凡的貢獻。從合成資料集衍生的問題實例的實驗結果證實了我們的理論結果。", "author": "Arun Verma et.al.", "authors": "Arun Verma, Zhongxiang Dai, Xiaoqiang Lin, Patrick Jaillet, Bryan Kian Hsiang Low", "id": "2407.17112v1", "paper_url": "http://arxiv.org/abs/2407.17112v1", "repo": "null"}}