{"2405.05299": {"publish_time": "2024-05-08", "title": "Challenges for Responsible AI Design and Workflow Integration in Healthcare: A Case Study of Automatic Feeding Tube Qualification in Radiology", "paper_summary": "Nasogastric tubes (NGTs) are feeding tubes that are inserted through the nose\ninto the stomach to deliver nutrition or medication. If not placed correctly,\nthey can cause serious harm, even death to patients. Recent AI developments\ndemonstrate the feasibility of robustly detecting NGT placement from Chest\nX-ray images to reduce risks of sub-optimally or critically placed NGTs being\nmissed or delayed in their detection, but gaps remain in clinical practice\nintegration. In this study, we present a human-centered approach to the problem\nand describe insights derived following contextual inquiry and in-depth\ninterviews with 15 clinical stakeholders. The interviews helped understand\nchallenges in existing workflows, and how best to align technical capabilities\nwith user needs and expectations. We discovered the trade-offs and complexities\nthat need consideration when choosing suitable workflow stages, target users,\nand design configurations for different AI proposals. We explored how to\nbalance AI benefits and risks for healthcare staff and patients within broader\norganizational and medical-legal constraints. We also identified data issues\nrelated to edge cases and data biases that affect model training and\nevaluation; how data documentation practices influence data preparation and\nlabelling; and how to measure relevant AI outcomes reliably in future\nevaluations. We discuss how our work informs design and development of AI\napplications that are clinically useful, ethical, and acceptable in real-world\nhealthcare services.", "paper_summary_zh": "鼻胃管 (NGT) 是經由鼻腔插入胃中以提供營養或藥物的餵食管。如果沒有正確放置，可能會對患者造成嚴重傷害，甚至死亡。最近的 AI 發展證明了從胸部 X 光影像中穩健偵測 NGT 放置位置的可行性，以降低遺漏或延遲偵測位置不佳或危急的 NGT 的風險，但臨床實務整合仍有差距。在這項研究中，我們提出以人為中心的解決問題方法，並描述在脈絡探究和與 15 位臨床利益關係人深度訪談後獲得的見解。訪談有助於了解現有工作流程中的挑戰，以及如何最佳地將技術能力與使用者需求和期望結合起來。我們發現了在選擇適合的工作流程階段、目標使用者和不同 AI 提議的設計配置時需要考量的權衡和複雜性。我們探討了如何在更廣泛的組織和醫療法律約束下平衡 AI 對醫療保健人員和患者的益處和風險。我們也找出影響模型訓練和評估的邊緣案例和資料偏差相關的資料問題；資料文件編寫實務如何影響資料準備和標籤；以及如何在未來的評估中可靠地衡量相關的 AI 結果。我們討論了我們的工作如何為在現實世界的醫療保健服務中臨床上有用、符合道德且可接受的 AI 應用程式設計和開發提供資訊。", "author": "Anja Thieme et.al.", "authors": "Anja Thieme, Abhijith Rajamohan, Benjamin Cooper, Heather Groombridge, Robert Simister, Barney Wong, Nicholas Woznitza, Mark Ames Pinnock, Maria Teodora Wetscherek, Cecily Morrison, Hannah Richardson, Fernando Pérez-García, Stephanie L. Hyland, Shruthi Bannur, Daniel C. Castro, Kenza Bouzid, Anton Schwaighofer, Mercy Ranjit, Harshita Sharma, Matthew P. Lungren, Ozan Oktay, Javier Alvarez-Valle, Aditya Nori, Stephen Harris, Joseph Jacob", "id": "2405.05299v1", "paper_url": "http://arxiv.org/abs/2405.05299v1", "repo": "null"}}