{"2410.24200": {"publish_time": "2024-10-31", "title": "Length-Induced Embedding Collapse in Transformer-based Models", "paper_summary": "Text embeddings enable various applications, but their performance\ndeteriorates on longer texts. In this paper, we find that the performance\ndegradation is due to a phenomenon called Length Collapse, where longer text\nembeddings collapse into a narrow space. This collapse results in a\ndistributional inconsistency between embeddings of different text lengths,\nultimately hurting the performance of downstream tasks. Theoretically, by\nconsidering the self-attention mechanism inherently functions as a low-pass\nfilter, we prove that long sequences increase the attenuation rate of the\nlow-pass filter effect of the self-attention mechanism. With layers going\ndeeper, excessive low-pass filtering causes the token signals to retain only\ntheir Direct-Current (DC) component, which means the input token feature maps\nwill collapse into a narrow space, especially in long texts. Based on the above\nanalysis, we propose to mitigate the undesirable length collapse limitation by\nintroducing a temperature in softmax(), which achieves a higher low-filter\nattenuation rate. The tuning-free method, called TempScale, can be plugged into\nmultiple transformer-based embedding models. Empirically, we demonstrate that\nTempScale can improve existing embedding models, especially on long text\ninputs, bringing up to 0.53% performance gains on 40 datasets from Massive Text\nEmbedding Benchmark (MTEB) and 0.82% performance gains on 4 datasets from\nLongEmbed, which specifically focuses on long context retrieval.", "paper_summary_zh": "文字嵌入可啟用各種應用程式，但其效能會在較長的文字中下降。在本文中，我們發現效能下降是因爲一個稱為長度崩潰的現象，其中較長的文字嵌入會崩潰成一個狹窄的空間。此崩潰導致不同文字長度的嵌入之間的分配不一致，最終損害下游任務的效能。理論上，透過考慮自我注意機制本質上作為低通濾波器運作，我們證明長序列會增加自我注意機制的低通濾波器效應的衰減率。隨著層次更深入，過度的低通濾波會導致權杖訊號僅保留其直流 (DC) 成分，這表示輸入權杖特徵圖會崩潰成一個狹窄的空間，尤其是在長文字中。根據以上的分析，我們提議透過在 softmax() 中引入溫度來減輕不希望的長度崩潰限制，這會達成更高的低濾波器衰減率。稱為 TempScale 的無調校方法可以插入多個基於Transformer的嵌入模型中。根據經驗，我們證明 TempScale 可以改善現有的嵌入模型，尤其是在長文字輸入上，在 Massive Text Embedding Benchmark (MTEB) 的 40 個資料集上帶來高達 0.53% 的效能提升，以及在 LongEmbed 的 4 個資料集上帶來 0.82% 的效能提升，LongEmbed 特別專注於長脈絡檢索。", "author": "Yuqi Zhou et.al.", "authors": "Yuqi Zhou, Sunhao Dai, Zhanshuo Cao, Xiao Zhang, Jun Xu", "id": "2410.24200v1", "paper_url": "http://arxiv.org/abs/2410.24200v1", "repo": "null"}}