{"2501.09943": {"publish_time": "2025-01-17", "title": "Indigenous Languages Spoken in Argentina: A Survey of NLP and Speech Resources", "paper_summary": "Argentina has a diverse, yet little-known, Indigenous language heritage. Most\nof these languages are at risk of disappearing, resulting in a significant loss\nof world heritage and cultural knowledge. Currently, no unified information on\nspeakers and computational tools is available for these languages. In this\nwork, we present a systematization of the Indigenous languages spoken in\nArgentina, along with national demographic data on the country's Indigenous\npopulation. The languages are classified into seven families: Mapuche,\nTup\\'i-Guaran\\'i, Guaycur\\'u, Quechua, Mataco-Mataguaya, Aymara, and Chon. We\nalso provide an introductory survey of the computational resources available\nfor these languages, whether or not they are specifically developed for\nArgentine varieties.", "paper_summary_zh": "阿根廷擁有多元且鮮為人知的原住民語言遺產。這些語言大多面臨消失的風險，導致世界遺產和文化知識的重大損失。目前，沒有統一的資訊可供這些語言的使用者和計算工具使用。在這項工作中，我們對阿根廷所說的原住民語言進行了系統化，並提供了該國原住民人口的國家人口統計資料。這些語言被歸類為七個語系：馬普切語、圖皮-瓜拉尼語、瓜亞庫魯語、克丘亞語、馬塔科-馬塔瓜亞語、艾馬拉語和瓊語。我們還提供了這些語言可用的計算資源的簡介調查，無論它們是否專門為阿根廷品種而開發。", "author": "Belu Ticona et.al.", "authors": "Belu Ticona, Fernando Carranza, Viviana Cotik", "id": "2501.09943v1", "paper_url": "http://arxiv.org/abs/2501.09943v1", "repo": "null"}}