{"2502.11937": {"publish_time": "2025-02-17", "title": "FitLight: Federated Imitation Learning for Plug-and-Play Autonomous Traffic Signal Control", "paper_summary": "Although Reinforcement Learning (RL)-based Traffic Signal Control (TSC)\nmethods have been extensively studied, their practical applications still raise\nsome serious issues such as high learning cost and poor generalizability. This\nis because the ``trial-and-error'' training style makes RL agents extremely\ndependent on the specific traffic environment, which also requires a long\nconvergence time. To address these issues, we propose a novel Federated\nImitation Learning (FIL)-based framework for multi-intersection TSC, named\nFitLight, which allows RL agents to plug-and-play for any traffic environment\nwithout additional pre-training cost. Unlike existing imitation learning\napproaches that rely on pre-training RL agents with demonstrations, FitLight\nallows real-time imitation learning and seamless transition to reinforcement\nlearning. Due to our proposed knowledge-sharing mechanism and novel hybrid\npressure-based agent design, RL agents can quickly find a best control policy\nwith only a few episodes. Moreover, for resource-constrained TSC scenarios,\nFitLight supports model pruning and heterogeneous model aggregation, such that\nRL agents can work on a micro-controller with merely 16{\\it KB} RAM and 32{\\it\nKB} ROM. Extensive experiments demonstrate that, compared to state-of-the-art\nmethods, FitLight not only provides a superior starting point but also\nconverges to a better final solution on both real-world and synthetic datasets,\neven under extreme resource limitations.", "paper_summary_zh": "儘管基於強化學習 (RL) 的交通號誌控制 (TSC) 方法已經廣泛研究，但其實際應用仍會產生一些嚴重的問題，例如學習成本高和泛化能力差。這是因為「試錯法」訓練風格讓 RL 代理極度依賴特定的交通環境，這也需要很長的收斂時間。為了解決這些問題，我們提出一個名為 FitLight 的基於聯邦模仿學習 (FIL) 的多路口 TSC 框架，讓 RL 代理可以即插即用於任何交通環境，而無需額外的預訓練成本。與依賴使用示範預訓練 RL 代理的現有模仿學習方法不同，FitLight 允許即時模仿學習和無縫過渡到強化學習。由於我們提出的知識共享機制和新穎的基於壓力的混合代理設計，RL 代理只需幾個回合即可快速找到最佳控制策略。此外，對於資源受限的 TSC 場景，FitLight 支援模型剪枝和異質模型聚合，讓 RL 代理可以在僅有 16{\\it KB} RAM 和 32{\\it KB} ROM 的微控制器上運行。廣泛的實驗證明，與最先進的方法相比，FitLight 不僅提供了更好的起點，而且在實際和合成資料集上都能收斂到更好的最終解決方案，即使在極端的資源限制下也是如此。", "author": "Yutong Ye et.al.", "authors": "Yutong Ye, Yingbo Zhou, Zhusen Liu, Xiao Du, Hao Zhou, Xiang Lian, Mingsong Chen", "id": "2502.11937v1", "paper_url": "http://arxiv.org/abs/2502.11937v1", "repo": "null"}}