{"2411.02337": {"publish_time": "2024-11-04", "title": "WebRL: Training LLM Web Agents via Self-Evolving Online Curriculum Reinforcement Learning", "paper_summary": "Large language models (LLMs) have shown remarkable potential as autonomous\nagents, particularly in web-based tasks. However, existing LLM web agents\nheavily rely on expensive proprietary LLM APIs, while open LLMs lack the\nnecessary decision-making capabilities. This paper introduces WebRL, a\nself-evolving online curriculum reinforcement learning framework designed to\ntrain high-performance web agents using open LLMs. WebRL addresses three key\nchallenges in building LLM web agents, including the scarcity of training\ntasks, sparse feedback signals, and policy distribution drift in online\nlearning. Specifically, WebRL incorporates 1) a self-evolving curriculum that\ngenerates new tasks from unsuccessful attempts, 2) a robust outcome-supervised\nreward model (ORM), and 3) adaptive reinforcement learning strategies to ensure\nconsistent improvements. We apply WebRL to transform open Llama-3.1 and GLM-4\nmodels into proficient web agents. On WebArena-Lite, WebRL improves the success\nrate of Llama-3.1-8B from 4.8% to 42.4%, and from 6.1% to 43% for GLM-4-9B.\nThese open models significantly surpass the performance of GPT-4-Turbo (17.6%)\nand GPT-4o (13.9%) and outperform previous state-of-the-art web agents trained\non open LLMs (AutoWebGLM, 18.2%). Our findings demonstrate WebRL's\neffectiveness in bridging the gap between open and proprietary LLM-based web\nagents, paving the way for more accessible and powerful autonomous web\ninteraction systems.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出作為自主代理的顯著潛力，特別是在基於網路的任務中。然而，現有的 LLM 網路代理程式嚴重依賴昂貴的專有 LLM API，而開放式 LLM 缺乏必要的決策能力。本文介紹 WebRL，一個自我演化的線上課程強化學習架構，旨在使用開放式 LLM 訓練高性能網路代理程式。WebRL 應對了建立 LLM 網路代理程式的三個主要挑戰，包括訓練任務的稀缺性、稀疏回饋訊號和線上學習中的策略分佈漂移。具體來說，WebRL 結合了 1) 一個自我演化的課程，從不成功的嘗試中產生新的任務，2) 一個強大的結果監督獎勵模型 (ORM)，以及 3) 自適應強化學習策略，以確保持續進步。我們應用 WebRL 將開放式 Llama-3.1 和 GLM-4 模型轉換為熟練的網路代理程式。在 WebArena-Lite 上，WebRL 將 Llama-3.1-8B 的成功率從 4.8% 提高到 42.4%，將 GLM-4-9B 的成功率從 6.1% 提高到 43%。這些開放式模型顯著超越了 GPT-4-Turbo (17.6%) 和 GPT-4o (13.9%) 的效能，並且優於先前在開放式 LLM（AutoWebGLM，18.2%）上訓練的最先進網路代理程式。我們的研究結果證明了 WebRL 在彌合開放式和專有 LLM 基於網路代理程式之間差距的有效性，為更易於使用且功能更強大的自主網路互動系統鋪平了道路。", "author": "Zehan Qi et.al.", "authors": "Zehan Qi, Xiao Liu, Iat Long Iong, Hanyu Lai, Xueqiao Sun, Xinyue Yang, Jiadai Sun, Yu Yang, Shuntian Yao, Tianjie Zhang, Wei Xu, Jie Tang, Yuxiao Dong", "id": "2411.02337v1", "paper_url": "http://arxiv.org/abs/2411.02337v1", "repo": "null"}}