{"2412.12883": {"publish_time": "2024-12-17", "title": "A Comparative Study of Pruning Methods in Transformer-based Time Series Forecasting", "paper_summary": "The current landscape in time-series forecasting is dominated by\nTransformer-based models. Their high parameter count and corresponding demand\nin computational resources pose a challenge to real-world deployment,\nespecially for commercial and scientific applications with low-power embedded\ndevices. Pruning is an established approach to reduce neural network parameter\ncount and save compute. However, the implications and benefits of pruning\nTransformer-based models for time series forecasting are largely unknown. To\nclose this gap, we provide a comparative benchmark study by evaluating\nunstructured and structured pruning on various state-of-the-art multivariate\ntime series models. We study the effects of these pruning strategies on model\npredictive performance and computational aspects like model size, operations,\nand inference time. Our results show that certain models can be pruned even up\nto high sparsity levels, outperforming their dense counterpart. However,\nfine-tuning pruned models is necessary. Furthermore, we demonstrate that even\nwith corresponding hardware and software support, structured pruning is unable\nto provide significant time savings.", "paper_summary_zh": "目前時序預測的主流方法是基於 Transformer 的模型。這些模型具有高參數計數，對運算資源的需求也相對應地高，這對實際部署構成了一項挑戰，特別是對於採用低功耗嵌入式裝置的商業和科學應用。剪枝是一種既定的方法，用於減少神經網路參數計數並節省運算。然而，剪枝 Transformer 模型對時序預測的影響和好處在很大程度上仍未知。為了彌補這一差距，我們提供了一項比較基準研究，通過評估各種最先進的多元時序模型上的非結構化和結構化剪枝。我們研究了這些剪枝策略對模型預測效能和運算方面的影響，例如模型大小、運算和推論時間。我們的結果表明，某些模型甚至可以被剪枝到高稀疏度級別，並優於其密集對應項。然而，微調剪枝模型是必要的。此外，我們證明，即使有相應的硬體和軟體支援，結構化剪枝也無法提供顯著的時間節省。", "author": "Nicholas Kiefer et.al.", "authors": "Nicholas Kiefer, Arvid Weyrauch, Muhammed Öz, Achim Streit, Markus Götz, Charlotte Debus", "id": "2412.12883v1", "paper_url": "http://arxiv.org/abs/2412.12883v1", "repo": "null"}}