{"2408.03033": {"publish_time": "2024-08-06", "title": "L3iTC at the FinLLM Challenge Task: Quantization for Financial Text Classification & Summarization", "paper_summary": "This article details our participation (L3iTC) in the FinLLM Challenge Task\n2024, focusing on two key areas: Task 1, financial text classification, and\nTask 2, financial text summarization. To address these challenges, we\nfine-tuned several large language models (LLMs) to optimize performance for\neach task. Specifically, we used 4-bit quantization and LoRA to determine which\nlayers of the LLMs should be trained at a lower precision. This approach not\nonly accelerated the fine-tuning process on the training data provided by the\norganizers but also enabled us to run the models on low GPU memory. Our\nfine-tuned models achieved third place for the financial classification task\nwith an F1-score of 0.7543 and secured sixth place in the financial\nsummarization task on the official test datasets.", "paper_summary_zh": "本文詳細說明我們（L3iTC）參與 2024 年 FinLLM 挑戰任務，重點關注兩個關鍵領域：任務 1，財務文字分類，以及任務 2，財務文字摘要。為了應對這些挑戰，我們微調了多個大型語言模型 (LLM)，以優化每個任務的效能。具體來說，我們使用 4 位元量化和 LoRA 來確定 LLM 的哪些層次應以較低的精度進行訓練。此方法不僅加速了組織者提供的訓練資料的微調過程，還使我們能夠在低 GPU 記憶體上執行模型。我們微調的模型在財務分類任務中以 0.7543 的 F1 分數獲得第三名，並在官方測試資料集中的財務摘要任務中獲得第六名。", "author": "Elvys Linhares Pontes et.al.", "authors": "Elvys Linhares Pontes, Carlos-Emiliano González-Gallardo, Mohamed Benjannet, Caryn Qu, Antoine Doucet", "id": "2408.03033v1", "paper_url": "http://arxiv.org/abs/2408.03033v1", "repo": "null"}}