{"2406.18899": {"publish_time": "2024-06-27", "title": "Autonomous Control of a Novel Closed Chain Five Bar Active Suspension via Deep Reinforcement Learning", "paper_summary": "Planetary exploration requires traversal in environments with rugged\nterrains. In addition, Mars rovers and other planetary exploration robots often\ncarry sensitive scientific experiments and components onboard, which must be\nprotected from mechanical harm. This paper deals with an active suspension\nsystem focused on chassis stabilisation and an efficient traversal method while\nencountering unavoidable obstacles. Soft Actor-Critic (SAC) was applied along\nwith Proportional Integral Derivative (PID) control to stabilise the chassis\nand traverse large obstacles at low speeds. The model uses the rover's distance\nfrom surrounding obstacles, the height of the obstacle, and the chassis'\norientation to actuate the control links of the suspension accurately.\nSimulations carried out in the Gazebo environment are used to validate the\nproposed active system.", "paper_summary_zh": "行星探索需要在崎嶇的地形中穿越。此外，火星探測車和其他行星探測機器人通常會攜帶敏感的科學實驗和組件，必須保護這些組件免於機械損壞。本文探討了一個主動懸吊系統，專注於底盤穩定和在遇到不可避免的障礙物時的有效穿越方法。軟性動作-評論家 (SAC) 與比例積分微分 (PID) 控制一起應用，以穩定底盤並在低速下穿越大型障礙物。該模型使用探測車與周圍障礙物的距離、障礙物的高度以及底盤的方向來準確地驅動懸吊的控制連桿。在 Gazebo 環境中進行的模擬用於驗證所提出的主動系統。", "author": "Nishesh Singh et.al.", "authors": "Nishesh Singh, Sidharth Ramesh, Abhishek Shankar, Jyotishka Duttagupta, Leander Stephen D'Souza, Sanjay Singh", "id": "2406.18899v1", "paper_url": "http://arxiv.org/abs/2406.18899v1", "repo": "null"}}