{"2409.02050": {"publish_time": "2024-09-03", "title": "Enhancing Code-Switching Speech Recognition with LID-Based Collaborative Mixture of Experts Model", "paper_summary": "Due to the inherent difficulty in modeling phonetic similarities across\ndifferent languages, code-switching speech recognition presents a formidable\nchallenge. This study proposes a Collaborative-MoE, a Mixture of Experts (MoE)\nmodel that leverages a collaborative mechanism among expert groups. Initially,\na preceding routing network explicitly learns Language Identification (LID)\ntasks and selects experts based on acquired LID weights. This process ensures\nrobust routing information to the MoE layer, mitigating interference from\ndiverse language domains on expert network parameter updates. The LID weights\nare also employed to facilitate inter-group collaboration, enabling the\nintegration of language-specific representations. Furthermore, within each\nlanguage expert group, a gating network operates unsupervised to foster\ncollaboration on attributes beyond language. Extensive experiments demonstrate\nthe efficacy of our approach, achieving significant performance enhancements\ncompared to alternative methods. Importantly, our method preserves the\nefficient inference capabilities characteristic of MoE models without\nnecessitating additional pre-training.", "paper_summary_zh": "由於跨語言建模語音相似性的難度，語碼轉換語音辨識是一個巨大的挑戰。本研究提出一個協作式 MoE，一種專家混合 (MoE) 模型，利用專家組之間的協作機制。最初，一個先前的路由網路明確地學習語言辨識 (LID) 任務，並根據獲得的 LID 權重選擇專家。這個過程確保了穩健的路由資訊到 MoE 層，減輕了不同語言網域對專家網路參數更新的干擾。LID 權重也用於促進組間協作，使語言特定表示整合成為可能。此外，在每個語言專家組中，一個閘控網路不受監督地運作，以促進超越語言的屬性協作。廣泛的實驗證明了我們方法的有效性，與替代方法相比，達到了顯著的效能提升。重要的是，我們的模型保留了 MoE 模型特有的高效推論能力，而不需要額外的預訓練。", "author": "Hukai Huang et.al.", "authors": "Hukai Huang, Jiayan Lin, Kaidi Wang, Yishuang Li, Wenhao Guan, Qingyang Hong, Lin Li", "id": "2409.02050v1", "paper_url": "http://arxiv.org/abs/2409.02050v1", "repo": "null"}}