{"2501.12972": {"publish_time": "2025-01-22", "title": "Accessible Smart Contracts Verification: Synthesizing Formal Models with Tamed LLMs", "paper_summary": "When blockchain systems are said to be trustless, what this really means is\nthat all the trust is put into software. Thus, there are strong incentives to\nensure blockchain software is correct -- vulnerabilities here cost millions and\nbreak businesses. One of the most powerful ways of establishing software\ncorrectness is by using formal methods. Approaches based on formal methods,\nhowever, induce a significant overhead in terms of time and expertise required\nto successfully employ them. Our work addresses this critical disadvantage by\nautomating the creation of a formal model -- a mathematical abstraction of the\nsoftware system -- which is often a core task when employing formal methods. We\nperform model synthesis in three phases: we first transpile the code into model\nstubs; then we \"fill in the blanks\" using a large language model (LLM);\nfinally, we iteratively repair the generated model, on both syntactical and\nsemantical level. In this way, we significantly reduce the amount of time\nnecessary to create formal models and increase accessibility of valuable\nsoftware verification methods that rely on them. The practical context of our\nwork was reducing the time-to-value of using formal models for correctness\naudits of smart contracts.", "paper_summary_zh": "當區塊鏈系統被稱作無需信任時，這實際上意味著\n所有的信任都賦予了軟體。因此，有強烈的誘因來\n確保區塊鏈軟體是正確的——此處的漏洞會造成數百萬損失並\n讓企業破產。建立軟體正確性的最有力的方法之一是使用形式化方法。\n然而，基於形式化方法的方法會導致在時間和專業知識方面的顯著開銷\n才能成功地使用它們。我們的作品透過自動化形式化模型的建立來解決這個重大的缺點——軟體系統的數學抽象——這通常是使用形式化方法時的核心任務。我們\n分三個階段執行模型合成：我們首先將程式碼轉譯成模型存根；然後我們使用大型語言模型 (LLM)「填補空白」；\n最後，我們在語法和語義層面上反覆修復產生的模型。透過這種方式，我們大幅減少建立形式化模型所需的時間，並增加依賴它們的寶貴軟體驗證方法的可及性。我們工作的實際背景是減少使用形式化模型進行智慧合約正確性稽核的時間價值。", "author": "Jan Corazza et.al.", "authors": "Jan Corazza, Ivan Gavran, Gabriela Moreira, Daniel Neider", "id": "2501.12972v1", "paper_url": "http://arxiv.org/abs/2501.12972v1", "repo": "null"}}