{"2412.17287": {"publish_time": "2024-12-23", "title": "LLM4AD: A Platform for Algorithm Design with Large Language Model", "paper_summary": "We introduce LLM4AD, a unified Python platform for algorithm design (AD) with\nlarge language models (LLMs). LLM4AD is a generic framework with modularized\nblocks for search methods, algorithm design tasks, and LLM interface. The\nplatform integrates numerous key methods and supports a wide range of algorithm\ndesign tasks across various domains including optimization, machine learning,\nand scientific discovery. We have also designed a unified evaluation sandbox to\nensure a secure and robust assessment of algorithms. Additionally, we have\ncompiled a comprehensive suite of support resources, including tutorials,\nexamples, a user manual, online resources, and a dedicated graphical user\ninterface (GUI) to enhance the usage of LLM4AD. We believe this platform will\nserve as a valuable tool for fostering future development in the merging\nresearch direction of LLM-assisted algorithm design.", "paper_summary_zh": "我們介紹 LLM4AD，一個統一的 Python 平台，用於演算法設計 (AD) 和大型語言模型 (LLM)。LLM4AD 是個通用架構，具有模組化區塊，用於搜尋方法、演算法設計任務和 LLM 介面。該平台整合了許多關鍵方法，並支援各種領域的演算法設計任務，包括最佳化、機器學習和科學發現。我們還設計了一個統一的評估沙盒，以確保演算法的安全且穩健的評估。此外，我們編制了一套全面的支援資源，包括教學課程、範例、使用者手冊、線上資源和專用的圖形使用者介面 (GUI)，以增強 LLM4AD 的使用。我們相信這個平台將成為促進 LLM 輔助演算法設計合併研究方向未來發展的寶貴工具。", "author": "Fei Liu et.al.", "authors": "Fei Liu, Rui Zhang, Zhuoliang Xie, Rui Sun, Kai Li, Xi Lin, Zhenkun Wang, Zhichao Lu, Qingfu Zhang", "id": "2412.17287v1", "paper_url": "http://arxiv.org/abs/2412.17287v1", "repo": "null"}}