{"2412.11694": {"publish_time": "2024-12-16", "title": "From Specific-MLLM to Omni-MLLM: A Survey about the MLLMs alligned with Multi-Modality", "paper_summary": "From the Specific-MLLM, which excels in single-modal tasks, to the Omni-MLLM,\nwhich extends the range of general modalities, this evolution aims to achieve\nunderstanding and generation of multimodal information. Omni-MLLM treats the\nfeatures of different modalities as different \"foreign languages,\" enabling\ncross-modal interaction and understanding within a unified space. To promote\nthe advancement of related research, we have compiled 47 relevant papers to\nprovide the community with a comprehensive introduction to Omni-MLLM. We first\nexplain the four core components of Omni-MLLM for unified modeling and\ninteraction of multiple modalities. Next, we introduce the effective\nintegration achieved through \"alignment pretraining\" and \"instruction\nfine-tuning,\" and discuss open-source datasets and testing of interaction\ncapabilities. Finally, we summarize the main challenges facing current\nOmni-MLLM and outline future directions.", "paper_summary_zh": "從擅長單模態任務的特定 MLLM，到擴展一般模態範圍的 Omni-MLLM，此演進旨在達成理解和產生多模態資訊。Omni-MLLM 將不同模態的特徵視為不同的「外語」，讓跨模態互動和理解在統一空間內成為可能。為了促進相關研究的進展，我們彙編了 47 篇相關論文，提供社群對 Omni-MLLM 的全面性介紹。我們首先說明 Omni-MLLM 的四個核心組成，用於多模態的統一建模和互動。接著，我們介紹透過「比對預訓練」和「指令微調」達成的有效整合，並討論開源資料集和互動能力的測試。最後，我們總結目前 Omni-MLLM 面臨的主要挑戰，並概述未來的方向。", "author": "Shixin Jiang et.al.", "authors": "Shixin Jiang, Jiafeng Liang, Ming Liu, Bing Qin", "id": "2412.11694v1", "paper_url": "http://arxiv.org/abs/2412.11694v1", "repo": "null"}}