{"2408.14176": {"publish_time": "2024-08-26", "title": "SwiftBrush v2: Make Your One-step Diffusion Model Better Than Its Teacher", "paper_summary": "In this paper, we aim to enhance the performance of SwiftBrush, a prominent\none-step text-to-image diffusion model, to be competitive with its multi-step\nStable Diffusion counterpart. Initially, we explore the quality-diversity\ntrade-off between SwiftBrush and SD Turbo: the former excels in image\ndiversity, while the latter excels in image quality. This observation motivates\nour proposed modifications in the training methodology, including better weight\ninitialization and efficient LoRA training. Moreover, our introduction of a\nnovel clamped CLIP loss enhances image-text alignment and results in improved\nimage quality. Remarkably, by combining the weights of models trained with\nefficient LoRA and full training, we achieve a new state-of-the-art one-step\ndiffusion model, achieving an FID of 8.14 and surpassing all GAN-based and\nmulti-step Stable Diffusion models. The evaluation code is available at:\nhttps://github.com/vinairesearch/swiftbrushv2.", "paper_summary_zh": "在本文中，我们旨在提升 SwiftBrush 的性能，SwiftBrush 是一个著名的单步文本到图像扩散模型，以与它的多步 Stable Diffusion 对应模型相竞争。最初，我们探索了 SwiftBrush 和 SD Turbo 之间的质量多样性权衡：前者在图像多样性方面表现出色，而后者在图像质量方面表现出色。这一观察促使我们对训练方法提出了建议的修改，包括更好的权重初始化和高效的 LoRA 训练。此外，我们引入了一种新颖的 clamped CLIP 损失，它增强了图像文本对齐，并提高了图像质量。值得注意的是，通过结合使用经过高效 LoRA 和完整训练训练的模型的权重，我们实现了一个新的最先进的单步扩散模型，达到了 8.14 的 FID，并超越了所有基于 GAN 和多步 Stable Diffusion 的模型。评估代码可在以下网址获得：\nhttps://github.com/vinairesearch/swiftbrushv2。", "author": "Trung Dao et.al.", "authors": "Trung Dao, Thuan Hoang Nguyen, Thanh Le, Duc Vu, Khoi Nguyen, Cuong Pham, Anh Tran", "id": "2408.14176v1", "paper_url": "http://arxiv.org/abs/2408.14176v1", "repo": "null"}}