{"2410.08854": {"publish_time": "2024-10-11", "title": "Hybrid LLM-DDQN based Joint Optimization of V2I Communication and Autonomous Driving", "paper_summary": "Large language models (LLMs) have received considerable interest recently due\nto their outstanding reasoning and comprehension capabilities. This work\nexplores applying LLMs to vehicular networks, aiming to jointly optimize\nvehicle-to-infrastructure (V2I) communications and autonomous driving (AD)\npolicies. We deploy LLMs for AD decision-making to maximize traffic flow and\navoid collisions for road safety, and a double deep Q-learning algorithm (DDQN)\nis used for V2I optimization to maximize the received data rate and reduce\nfrequent handovers. In particular, for LLM-enabled AD, we employ the Euclidean\ndistance to identify previously explored AD experiences, and then LLMs can\nlearn from past good and bad decisions for further improvement. Then, LLM-based\nAD decisions will become part of states in V2I problems, and DDQN will optimize\nthe V2I decisions accordingly. After that, the AD and V2I decisions are\niteratively optimized until convergence. Such an iterative optimization\napproach can better explore the interactions between LLMs and conventional\nreinforcement learning techniques, revealing the potential of using LLMs for\nnetwork optimization and management. Finally, the simulations demonstrate that\nour proposed hybrid LLM-DDQN approach outperforms the conventional DDQN\nalgorithm, showing faster convergence and higher average rewards.", "paper_summary_zh": "大型語言模型 (LLM) 最近因其出色的推理和理解能力而備受關注。本研究探討將 LLM 應用於車輛網路，旨在共同優化車對基礎設施 (V2I) 通訊和自動駕駛 (AD) 政策。我們部署 LLM 進行 AD 決策制定，以最大化交通流量並避免碰撞以確保道路安全，並使用雙重深度 Q 學習演算法 (DDQN) 進行 V2I 優化，以最大化接收資料速率並減少頻繁的切換。特別是對於啟用 LLM 的 AD，我們採用歐幾里得距離來識別先前探索過的 AD 經驗，然後 LLM 可以從過去的良好和錯誤決策中學習以進一步改進。然後，基於 LLM 的 AD 決策將成為 V2I 問題中的狀態的一部分，而 DDQN 將相應地優化 V2I 決策。之後，AD 和 V2I 決策會反覆優化，直到收斂。這種反覆優化方法可以更好地探索 LLM 和傳統強化學習技術之間的互動，揭示了使用 LLM 進行網路優化和管理的潛力。最後，模擬結果表明，我們提出的混合 LLM-DDQN 方法優於傳統的 DDQN 演算法，顯示出更快的收斂速度和更高的平均獎勵。", "author": "Zijiang Yan et.al.", "authors": "Zijiang Yan, Hao Zhou, Hina Tabassum, Xue Liu", "id": "2410.08854v1", "paper_url": "http://arxiv.org/abs/2410.08854v1", "repo": "null"}}