{"2412.09651": {"publish_time": "2024-12-11", "title": "Assisted morbidity coding: the SISCO.web use case for identifying the main diagnosis in Hospital Discharge Records", "paper_summary": "Coding morbidity data using international standard diagnostic classifications\nis increasingly important and still challenging. Clinical coders and physicians\nassign codes to patient episodes based on their interpretation of case notes or\nelectronic patient records. Therefore, accurate coding relies on the legibility\nof case notes and the coders' understanding of medical terminology. During the\nlast ten years, many studies have shown poor reproducibility of clinical\ncoding, even recently, with the application of Artificial Intelligence-based\nmodels. Given this context, the paper aims to present the SISCO.web approach\ndesigned to support physicians in filling in Hospital Discharge Records with\nproper diagnoses and procedures codes using the International Classification of\nDiseases (9th and 10th), and, above all, in identifying the main pathological\ncondition. The web service leverages NLP algorithms, specific coding rules, as\nwell as ad hoc decision trees to identify the main condition, showing promising\nresults in providing accurate ICD coding suggestions.", "paper_summary_zh": "使用國際標準診斷分類對病態資料進行編碼越來越重要，但仍具有挑戰性。臨床編碼員和醫師根據他們對病例記錄或電子病歷的解讀，為患者就診情況分配代碼。因此，準確編碼依賴於病例記錄的可讀性和編碼員對醫學術語的理解。在過去十年中，許多研究表明臨床編碼的可再現性很差，即使在最近，人工智能模型的應用也是如此。鑑於這種情況，本文旨在介紹 SISCO.web 方法，該方法旨在支援醫師使用國際疾病分類 (第 9 版和第 10 版) 填寫出院記錄，並正確診斷和編碼程序，最重要的是，找出主要的病理狀況。網路服務利用 NLP 演算法、特定的編碼規則以及特別決策樹來找出主要狀況，在提供準確的 ICD 編碼建議方面顯示出有希望的結果。", "author": "Elena Cardillo et.al.", "authors": "Elena Cardillo, Lucilla Frattura", "id": "2412.09651v1", "paper_url": "http://arxiv.org/abs/2412.09651v1", "repo": "null"}}