{"2502.09819": {"publish_time": "2025-02-13", "title": "A Solver-Aided Hierarchical Language for LLM-Driven CAD Design", "paper_summary": "Large language models (LLMs) have been enormously successful in solving a\nwide variety of structured and unstructured generative tasks, but they struggle\nto generate procedural geometry in Computer Aided Design (CAD). These\ndifficulties arise from an inability to do spatial reasoning and the necessity\nto guide a model through complex, long range planning to generate complex\ngeometry. We enable generative CAD Design with LLMs through the introduction of\na solver-aided, hierarchical domain specific language (DSL) called AIDL, which\noffloads the spatial reasoning requirements to a geometric constraint solver.\nAdditionally, we show that in the few-shot regime, AIDL outperforms even a\nlanguage with in-training data (OpenSCAD), both in terms of generating visual\nresults closer to the prompt and creating objects that are easier to\npost-process and reason about.", "paper_summary_zh": "大型語言模型 (LLM) 在解決各種結構化和非結構化生成任務方面取得了巨大成功，但它們在電腦輔助設計 (CAD) 中生成程序幾何圖形時卻舉步維艱。這些困難源於無法進行空間推理，以及必須引導模型進行複雜的長期規劃才能生成複雜的幾何圖形。我們透過導入稱為 AIDL 的求解器輔助分層領域特定語言 (DSL) 來啟用 LLM 的生成式 CAD 設計，它將空間推理需求卸載到幾何約束求解器。此外，我們表明在少量樣本的訓練模式中，AIDL 的表現優於在訓練資料（OpenSCAD）中包含語言的模型，無論是在生成更接近提示的視覺結果，還是創建更容易進行後處理和推理的物件方面。", "author": "Benjamin T. Jones et.al.", "authors": "Benjamin T. Jones, Felix Hähnlein, Zihan Zhang, Maaz Ahmad, Vladimir Kim, Adriana Schulz", "id": "2502.09819v1", "paper_url": "http://arxiv.org/abs/2502.09819v1", "repo": "null"}}