{"2301.06009": {"publish_time": "2023-01-15", "title": "Rationalizing Predictions by Adversarial Information Calibration", "paper_summary": "Explaining the predictions of AI models is paramount in safety-critical\napplications, such as in legal or medical domains. One form of explanation for\na prediction is an extractive rationale, i.e., a subset of features of an\ninstance that lead the model to give its prediction on that instance. For\nexample, the subphrase ``he stole the mobile phone'' can be an extractive\nrationale for the prediction of ``Theft''. Previous works on generating\nextractive rationales usually employ a two-phase model: a selector that selects\nthe most important features (i.e., the rationale) followed by a predictor that\nmakes the prediction based exclusively on the selected features. One\ndisadvantage of these works is that the main signal for learning to select\nfeatures comes from the comparison of the answers given by the predictor to the\nground-truth answers. In this work, we propose to squeeze more information from\nthe predictor via an information calibration method. More precisely, we train\ntwo models jointly: one is a typical neural model that solves the task at hand\nin an accurate but black-box manner, and the other is a selector-predictor\nmodel that additionally produces a rationale for its prediction. The first\nmodel is used as a guide for the second model. We use an adversarial technique\nto calibrate the information extracted by the two models such that the\ndifference between them is an indicator of the missed or over-selected\nfeatures. In addition, for natural language tasks, we propose a\nlanguage-model-based regularizer to encourage the extraction of fluent\nrationales. Experimental results on a sentiment analysis task, a hate speech\nrecognition task as well as on three tasks from the legal domain show the\neffectiveness of our approach to rationale extraction.", "paper_summary_zh": "", "author": "Lei Sha et.al.", "authors": "Lei Sha,Oana-Maria Camburu,Thomas Lukasiewicz", "id": "2301.06009v1", "paper_url": "http://arxiv.org/abs/2301.06009v1", "repo": "null"}}