{"2301.06009": {"publish_time": "2023-01-15", "title": "Rationalizing Predictions by Adversarial Information Calibration", "paper_summary": "Explaining the predictions of AI models is paramount in safety-critical\napplications, such as in legal or medical domains. One form of explanation for\na prediction is an extractive rationale, i.e., a subset of features of an\ninstance that lead the model to give its prediction on that instance. For\nexample, the subphrase ``he stole the mobile phone'' can be an extractive\nrationale for the prediction of ``Theft''. Previous works on generating\nextractive rationales usually employ a two-phase model: a selector that selects\nthe most important features (i.e., the rationale) followed by a predictor that\nmakes the prediction based exclusively on the selected features. One\ndisadvantage of these works is that the main signal for learning to select\nfeatures comes from the comparison of the answers given by the predictor to the\nground-truth answers. In this work, we propose to squeeze more information from\nthe predictor via an information calibration method. More precisely, we train\ntwo models jointly: one is a typical neural model that solves the task at hand\nin an accurate but black-box manner, and the other is a selector-predictor\nmodel that additionally produces a rationale for its prediction. The first\nmodel is used as a guide for the second model. We use an adversarial technique\nto calibrate the information extracted by the two models such that the\ndifference between them is an indicator of the missed or over-selected\nfeatures. In addition, for natural language tasks, we propose a\nlanguage-model-based regularizer to encourage the extraction of fluent\nrationales. Experimental results on a sentiment analysis task, a hate speech\nrecognition task as well as on three tasks from the legal domain show the\neffectiveness of our approach to rationale extraction.", "paper_summary_zh": "<paragraph>在安全關鍵應用程式中，例如法律或醫療領域，解釋 AI 模型的預測至關重要。一種預測的解釋形式是萃取依據，亦即某個實例中導致模型對該實例做出預測的子集合特徵。例如，子詞組「他偷了手機」可能是「偷竊」預測的萃取依據。先前關於產生萃取依據的研究通常採用二階段模型：一個選擇器選擇最重要的特徵（即依據），接著是一個預測器，它根據所選的特徵獨家做出預測。這些研究的一個缺點是，學習選擇特徵的主要訊號來自將預測器給出的答案與真實答案進行比較。在這項研究中，我們建議透過資訊校正方法從預測器中擷取更多資訊。更精確地說，我們聯合訓練兩個模型：一個是典型的類神經網路模型，它以準確但黑箱的方式解決手邊的任務，另一個是選擇器預測器模型，它另外為其預測產生依據。第一個模型用作第二個模型的指南。我們使用對抗技術校正兩個模型萃取的資訊，使它們之間的差異成為遺漏或過度選擇的特徵的指標。此外，對於自然語言任務，我們提出一個基於語言模型的正規化器，以鼓勵萃取流暢的依據。情緒分析任務、仇恨言論辨識任務以及法律領域三個任務的實驗結果顯示，我們在依據萃取方面的做法十分有效。</paragraph>", "author": "Lei Sha et.al.", "authors": "Lei Sha, Oana-Maria Camburu, Thomas Lukasiewicz", "id": "2301.06009v1", "paper_url": "http://arxiv.org/abs/2301.06009v1", "repo": "null"}}