{"2412.07246": {"publish_time": "2024-12-10", "title": "Filling Memory Gaps: Enhancing Continual Semantic Parsing via SQL Syntax Variance-Guided LLMs without Real Data Replay", "paper_summary": "Continual Semantic Parsing (CSP) aims to train parsers to convert natural\nlanguage questions into SQL across tasks with limited annotated examples,\nadapting to the real-world scenario of dynamically updated databases. Previous\nstudies mitigate this challenge by replaying historical data or employing\nparameter-efficient tuning (PET), but they often violate data privacy or rely\non ideal continual learning settings. To address these problems, we propose a\nnew Large Language Model (LLM)-Enhanced Continuous Semantic Parsing method,\nnamed LECSP, which alleviates forgetting while encouraging generalization,\nwithout requiring real data replay or ideal settings. Specifically, it first\nanalyzes the commonalities and differences between tasks from the SQL syntax\nperspective to guide LLMs in reconstructing key memories and improving memory\naccuracy through a calibration strategy. Then, it uses a task-aware\ndual-teacher distillation framework to promote the accumulation and transfer of\nknowledge during sequential training. Experimental results on two CSP\nbenchmarks show that our method significantly outperforms existing methods,\neven those utilizing data replay or ideal settings. Additionally, we achieve\ngeneralization performance beyond the upper limits, better adapting to unseen\ntasks.", "paper_summary_zh": "持續語意解析（CSP）旨在訓練解析器將自然語言問題轉換成 SQL，適用於帶有限制標註範例的任務，並適應動態更新資料庫的實際情況。先前的研究透過重播歷史資料或採用參數有效率的調整（PET）來減輕此挑戰，但它們經常會違反資料隱私或依賴理想的持續學習設定。為了解決這些問題，我們提出一個新的大型語言模型（LLM）增強持續語意解析方法，稱為 LECSP，它減輕遺忘同時鼓勵廣義化，而不需要真實資料重播或理想設定。具體來說，它首先從 SQL 語法角度分析任務之間的共性與差異，以引導 LLM 重建關鍵記憶並透過校準策略提升記憶準確性。然後，它使用任務感知的雙教師蒸餾架構來促進知識在順序訓練期間的累積和轉移。在兩個 CSP 基準上的實驗結果顯示，我們的模型顯著優於現有方法，甚至優於使用資料重播或理想設定的方法。此外，我們達到了超越上限的廣義化效能，更能適應未見任務。", "author": "Ruiheng Liu et.al.", "authors": "Ruiheng Liu, Jinyu Zhang, Yanqi Song, Yu Zhang, Bailong Yang", "id": "2412.07246v1", "paper_url": "http://arxiv.org/abs/2412.07246v1", "repo": "null"}}