{"2406.20052": {"publish_time": "2024-06-28", "title": "Understanding and Mitigating Language Confusion in LLMs", "paper_summary": "We investigate a surprising limitation of LLMs: their inability to\nconsistently generate text in a user's desired language. We create the Language\nConfusion Benchmark (LCB) to evaluate such failures, covering 15 typologically\ndiverse languages with existing and newly-created English and multilingual\nprompts. We evaluate a range of LLMs on monolingual and cross-lingual\ngeneration reflecting practical use cases, finding that Llama Instruct and\nMistral models exhibit high degrees of language confusion and even the\nstrongest models fail to consistently respond in the correct language. We\nobserve that base and English-centric instruct models are more prone to\nlanguage confusion, which is aggravated by complex prompts and high sampling\ntemperatures. We find that language confusion can be partially mitigated via\nfew-shot prompting, multilingual SFT and preference tuning. We release our\nlanguage confusion benchmark, which serves as a first layer of efficient,\nscalable multilingual evaluation at\nhttps://github.com/for-ai/language-confusion.", "paper_summary_zh": "我們調查了 LLM 的一個令人驚訝的限制：它們無法持續產生使用者所需語言的文字。我們建立了語言混淆基準 (LCB) 來評估此類失敗，涵蓋 15 種類型不同的語言，並使用現有和新建立的英文和多語言提示。我們評估了各種 LLM 在單語和跨語言生成的表現，反映實際使用案例，發現 Llama Instruct 和 Mistral 模型展現出高度的語言混淆，即使是最強大的模型也無法持續以正確的語言回應。我們觀察到基礎和以英文為中心的指令模型更容易發生語言混淆，而複雜的提示和高取樣溫度會加劇這種情況。我們發現語言混淆可以透過少量提示、多語言 SFT 和偏好調整得到部分緩解。我們發布了我們的語言混淆基準，它作為有效、可擴充的多語言評估的第一層，網址為 https://github.com/for-ai/language-confusion。", "author": "Kelly Marchisio et.al.", "authors": "Kelly Marchisio, Wei-Yin Ko, Alexandre Bérard, Théo Dehaze, Sebastian Ruder", "id": "2406.20052v1", "paper_url": "http://arxiv.org/abs/2406.20052v1", "repo": "null"}}