{"2501.01394": {"publish_time": "2025-01-02", "title": "A Unified Hyperparameter Optimization Pipeline for Transformer-Based Time Series Forecasting Models", "paper_summary": "Transformer-based models for time series forecasting (TSF) have attracted\nsignificant attention in recent years due to their effectiveness and\nversatility. However, these models often require extensive hyperparameter\noptimization (HPO) to achieve the best possible performance, and a unified\npipeline for HPO in transformer-based TSF remains lacking. In this paper, we\npresent one such pipeline and conduct extensive experiments on several\nstate-of-the-art (SOTA) transformer-based TSF models. These experiments are\nconducted on standard benchmark datasets to evaluate and compare the\nperformance of different models, generating practical insights and examples.\nOur pipeline is generalizable beyond transformer-based architectures and can be\napplied to other SOTA models, such as Mamba and TimeMixer, as demonstrated in\nour experiments. The goal of this work is to provide valuable guidance to both\nindustry practitioners and academic researchers in efficiently identifying\noptimal hyperparameters suited to their specific domain applications. The code\nand complete experimental results are available on GitHub.", "paper_summary_zh": "基於Transformer的時序預測 (TSF) 模型近年來因其有效性和多功能性而備受關注。然而，這些模型通常需要廣泛的超參數最佳化 (HPO) 才能達到最佳效能，而基於Transformer的 TSF 中的統一 HPO 管線仍然不足。在本文中，我們提出了一個這樣的管線，並對幾個最先進 (SOTA) 的基於Transformer的 TSF 模型進行廣泛的實驗。這些實驗是在標準基準資料集上進行的，以評估和比較不同模型的效能，產生實用的見解和範例。我們的管線可以推廣到基於Transformer的架構之外，並可以應用於其他 SOTA 模型，例如 Mamba 和 TimeMixer，正如我們的實驗中所示。這項工作的目標是為產業從業者和學術研究人員提供有價值的指導，以有效找出適合其特定領域應用程式的最佳超參數。程式碼和完整的實驗結果可在 GitHub 上取得。", "author": "Jingjing Xu et.al.", "authors": "Jingjing Xu, Caesar Wu, Yuan-Fang Li, Grégoire Danoy, Pascal Bouvry", "id": "2501.01394v1", "paper_url": "http://arxiv.org/abs/2501.01394v1", "repo": "null"}}