{"2407.20485": {"publish_time": "2024-07-30", "title": "A2SF: Accumulative Attention Scoring with Forgetting Factor for Token Pruning in Transformer Decoder", "paper_summary": "Recently, large language models (LLM) based on transformers are facing memory\nbottleneck issues due to KV cache, especially in long sequence handling.\nPrevious researches proposed KV cache compression techniques that identify\ninsignificant tokens based on Accumulative Attention Scores and removes their\nitems from KV cache, noting that only few tokens play an important role in\nattention operations. However, we have observed that the existing Accumulative\nAttention Score is not suitable for the transformer decoder structure. In the\ndecoder model, the number of times the Attention Score accumulates varies\ndepending on the order of token appearance due to the effect of masking,\ncausing an uneven comparison between tokens. To solve this, we propose\nAccumulative Attention Score with Forgetting Factor (A2SF) technique, which\nintroduces a Forgetting Factor in the Attention Score accumulation process.\nA2SF applies a penalty to the past Attention Score generated from old tokens by\nrepeatedly multiplying the Forgetting Factor to the Attention Score over time.\nTherefore, older tokens receive a larger penalty, providing fairness among\ndifferent ages of tokens. Through the fair comparison among tokens, we can more\neffectively select important tokens. We have verified the accuracy improvement\nthrough A2SF in the OPT and LLaMA models and A2SF improves the accuracy of\nLLaMA 2 by up to 7.8% and 5.1% on 1-shot and 0-shot.", "paper_summary_zh": "<paragraph>最近，基於 Transformer 的大型語言模型 (LLM) 因 KV 快取而面臨記憶體瓶頸問題，尤其是在處理長序列時。\n先前的研究提出了 KV 快取壓縮技術，該技術根據累積注意力分數識別不重要的符號，並從 KV 快取中移除其項目，並指出只有少數符號在注意力操作中扮演重要角色。然而，我們觀察到現有的累積注意力分數並不適合 Transformer 解碼器結構。在解碼器模型中，由於遮罩效應，注意力分數累積的次數會根據符號出現的順序而有所不同，導致符號之間的比較不均勻。為了解決這個問題，我們提出了帶有遺忘因子的累積注意力分數 (A2SF) 技術，該技術在注意力分數累積過程中引入了遺忘因子。A2SF 對由舊符號產生的過去注意力分數施加懲罰，方法是隨著時間的推移，反覆將遺忘因子乘以注意力分數。因此，較舊的符號會收到較大的懲罰，從而為不同年齡的符號提供公平性。透過符號之間的公平比較，我們可以更有效地選擇重要的符號。我們已經在 OPT 和 LLaMA 模型中驗證了 A2SF 的準確性改進，而 A2SF 將 LLaMA 2 在 1-shot 和 0-shot 上的準確性分別提高了 7.8% 和 5.1%。</paragraph>", "author": "Hyun-rae Jo et.al.", "authors": "Hyun-rae Jo, Dongkun Shin", "id": "2407.20485v2", "paper_url": "http://arxiv.org/abs/2407.20485v2", "repo": "null"}}