{"2408.06335": {"publish_time": "2024-08-12", "title": "LOLgorithm: Integrating Semantic,Syntactic and Contextual Elements for Humor Classification", "paper_summary": "This paper explores humor detection through a linguistic lens, prioritizing\nsyntactic, semantic, and contextual features over computational methods in\nNatural Language Processing. We categorize features into syntactic, semantic,\nand contextual dimensions, including lexicons, structural statistics, Word2Vec,\nWordNet, and phonetic style. Our proposed model, Colbert, utilizes BERT\nembeddings and parallel hidden layers to capture sentence congruity. By\ncombining syntactic, semantic, and contextual features, we train Colbert for\nhumor detection. Feature engineering examines essential syntactic and semantic\nfeatures alongside BERT embeddings. SHAP interpretations and decision trees\nidentify influential features, revealing that a holistic approach improves\nhumor detection accuracy on unseen data. Integrating linguistic cues from\ndifferent dimensions enhances the model's ability to understand humor\ncomplexity beyond traditional computational methods.", "paper_summary_zh": "本文透過語言學角度探討幽默偵測，在自然語言處理中優先考量句法、語意和語境特徵，而非計算方法。我們將特徵分類為句法、語意和語境面向，包括詞彙、結構統計、Word2Vec、WordNet 和語音風格。我們提出的 Colbert 模型利用 BERT 嵌入和並行隱藏層來擷取句子的相符性。透過結合句法、語意和語境特徵，我們訓練 Colbert 進行幽默偵測。特徵工程會檢視基本的句法和語意特徵，以及 BERT 嵌入。SHAP 解釋和決策樹識別出有影響力的特徵，顯示出整體方法能提升未見資料的幽默偵測準確度。整合不同面向的語言線索，增強模型理解幽默複雜性的能力，超越傳統的計算方法。", "author": "Tanisha Khurana et.al.", "authors": "Tanisha Khurana, Kaushik Pillalamarri, Vikram Pande, Munindar Singh", "id": "2408.06335v1", "paper_url": "http://arxiv.org/abs/2408.06335v1", "repo": "null"}}