{"2408.02487": {"publish_time": "2024-08-05", "title": "A First Look at License Compliance Capability of LLMs in Code Generation", "paper_summary": "Recent advances in Large Language Models (LLMs) have revolutionized code\ngeneration, leading to widespread adoption of AI coding tools by developers.\nHowever, LLMs can generate license-protected code without providing the\nnecessary license information, leading to potential intellectual property\nviolations during software production. This paper addresses the critical, yet\nunderexplored, issue of license compliance in LLM-generated code by\nestablishing a benchmark to evaluate the ability of LLMs to provide accurate\nlicense information for their generated code. To establish this benchmark, we\nconduct an empirical study to identify a reasonable standard for \"striking\nsimilarity\" that excludes the possibility of independent creation, indicating a\ncopy relationship between the LLM output and certain open-source code. Based on\nthis standard, we propose an evaluation benchmark LiCoEval, to evaluate the\nlicense compliance capabilities of LLMs. Using LiCoEval, we evaluate 14 popular\nLLMs, finding that even top-performing LLMs produce a non-negligible proportion\n(0.88% to 2.01%) of code strikingly similar to existing open-source\nimplementations. Notably, most LLMs fail to provide accurate license\ninformation, particularly for code under copyleft licenses. These findings\nunderscore the urgent need to enhance LLM compliance capabilities in code\ngeneration tasks. Our study provides a foundation for future research and\ndevelopment to improve license compliance in AI-assisted software development,\ncontributing to both the protection of open-source software copyrights and the\nmitigation of legal risks for LLM users.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 的近期進展徹底改變了程式碼生成，導致開發人員廣泛採用 AI 編碼工具。然而，LLM 可以生成受許可證保護的程式碼，而沒有提供必要的許可證資訊，這會在軟體製作過程中導致潛在的智慧財產權侵權。本文探討 LLM 生成的程式碼中許可證合規性的關鍵議題（但尚未充分探討），方法是建立基準來評估 LLM 為其生成的程式碼提供準確許可證資訊的能力。為了建立這個基準，我們進行實證研究，以找出「極度相似」的合理標準，排除獨立創作的可能性，表示 LLM 輸出與特定開源程式碼之間的複製關係。基於這個標準，我們提出評估基準 LiCoEval，以評估 LLM 的許可證合規能力。使用 LiCoEval，我們評估了 14 個流行的 LLM，發現即使效能最好的 LLM 仍會產生與現有開源實作極度相似的程式碼，比例不可忽略（0.88% 至 2.01%）。值得注意的是，大多數 LLM 無法提供準確的許可證資訊，特別是受 copyleft 許可證保護的程式碼。這些發現強調了在程式碼生成任務中增強 LLM 合規能力的迫切需求。我們的研究為未來的研究和開發奠定了基礎，以改善 AI 輔助軟體開發中的許可證合規性，有助於保護開源軟體的著作權，並減輕 LLM 使用者的法律風險。</paragraph>", "author": "Weiwei Xu et.al.", "authors": "Weiwei Xu, Kai Gao, Hao He, Minghui Zhou", "id": "2408.02487v1", "paper_url": "http://arxiv.org/abs/2408.02487v1", "repo": "null"}}