{"2501.01156": {"publish_time": "2025-01-02", "title": "TexAVi: Generating Stereoscopic VR Video Clips from Text Descriptions", "paper_summary": "While generative models such as text-to-image, large language models and\ntext-to-video have seen significant progress, the extension to\ntext-to-virtual-reality remains largely unexplored, due to a deficit in\ntraining data and the complexity of achieving realistic depth and motion in\nvirtual environments. This paper proposes an approach to coalesce existing\ngenerative systems to form a stereoscopic virtual reality video from text.\n  Carried out in three main stages, we start with a base text-to-image model\nthat captures context from an input text. We then employ Stable Diffusion on\nthe rudimentary image produced, to generate frames with enhanced realism and\noverall quality. These frames are processed with depth estimation algorithms to\ncreate left-eye and right-eye views, which are stitched side-by-side to create\nan immersive viewing experience. Such systems would be highly beneficial in\nvirtual reality production, since filming and scene building often require\nextensive hours of work and post-production effort.\n  We utilize image evaluation techniques, specifically Fr\\'echet Inception\nDistance and CLIP Score, to assess the visual quality of frames produced for\nthe video. These quantitative measures establish the proficiency of the\nproposed method.\n  Our work highlights the exciting possibilities of using natural\nlanguage-driven graphics in fields like virtual reality simulations.", "paper_summary_zh": "<paragraph>儘管生成模型（例如文字轉圖像、大型語言模型和文字轉影片）已取得顯著進展，但文字轉虛擬實境擴充仍未廣泛探索，原因在於訓練資料不足，以及在虛擬環境中實現逼真深度和動作的複雜性。本文提出了一種方法，將現有的生成系統合併，以從文字形成立體虛擬實境影片。\n  分為三個主要階段進行，我們從基礎文字轉圖像模型開始，該模型會擷取輸入文字的內容。然後，我們在產生的基本圖像上使用 Stable Diffusion，以生成具有增強真實感和整體品質的畫面。這些畫面會使用深度估計演算法進行處理，以建立左眼和右眼的視圖，並將其並排縫合，以創造身歷其境的觀看體驗。此類系統在虛擬實境製作中將非常有益，因為拍攝和場景建置通常需要大量工時和後製工作。\n  我們利用圖像評估技術，特別是 Fr\\'echet Inception Distance 和 CLIP Score，來評估為影片產生的畫面的視覺品質。這些量化措施確立了所提出方法的熟練度。\n  我們的研究突顯了在虛擬實境模擬等領域使用自然語言驅動圖形的令人興奮的可能性。</paragraph>", "author": "Vriksha Srihari et.al.", "authors": "Vriksha Srihari, R. Bhavya, Shruti Jayaraman, V. Mary Anita Rajam", "id": "2501.01156v1", "paper_url": "http://arxiv.org/abs/2501.01156v1", "repo": "null"}}