{"2405.09321": {"publish_time": "2024-05-15", "title": "ReconBoost: Boosting Can Achieve Modality Reconcilement", "paper_summary": "This paper explores a novel multi-modal alternating learning paradigm\npursuing a reconciliation between the exploitation of uni-modal features and\nthe exploration of cross-modal interactions. This is motivated by the fact that\ncurrent paradigms of multi-modal learning tend to explore multi-modal features\nsimultaneously. The resulting gradient prohibits further exploitation of the\nfeatures in the weak modality, leading to modality competition, where the\ndominant modality overpowers the learning process. To address this issue, we\nstudy the modality-alternating learning paradigm to achieve reconcilement.\nSpecifically, we propose a new method called ReconBoost to update a fixed\nmodality each time. Herein, the learning objective is dynamically adjusted with\na reconcilement regularization against competition with the historical models.\nBy choosing a KL-based reconcilement, we show that the proposed method\nresembles Friedman's Gradient-Boosting (GB) algorithm, where the updated\nlearner can correct errors made by others and help enhance the overall\nperformance. The major difference with the classic GB is that we only preserve\nthe newest model for each modality to avoid overfitting caused by ensembling\nstrong learners. Furthermore, we propose a memory consolidation scheme and a\nglobal rectification scheme to make this strategy more effective. Experiments\nover six multi-modal benchmarks speak to the efficacy of the method. We release\nthe code at https://github.com/huacong/ReconBoost.", "paper_summary_zh": "本文探討了一種新穎的多模態交替學習範例，旨在調和單模態特徵的利用和跨模態互動的探索。這項研究的動機來自於目前的多模態學習範例往往傾向於同時探索多模態特徵。所產生的梯度會阻礙進一步利用弱模態中的特徵，導致模態競爭，其中主要模態會壓制學習過程。為了解決此問題，我們研究了模態交替學習範例以達成調和。具體來說，我們提出了一種名為 ReconBoost 的新方法，每次更新一個固定的模態。在此，學習目標會根據與歷史模型競爭的調和正則化而動態調整。藉由選擇基於 KL 的調和，我們證明了所提出的方法類似於 Friedman 的梯度提升 (GB) 演算法，其中更新的學習器可以修正其他學習器所犯的錯誤，並有助於提升整體效能。與經典 GB 的主要差異在於，我們只保留每個模態最新的模型，以避免由整合強學習器所造成的過度擬合。此外，我們提出了一個記憶整合架構和一個全域修正架構，以使此策略更有效。針對六個多模態基準所做的實驗證明了此方法的效能。我們在 https://github.com/huacong/ReconBoost 釋出程式碼。", "author": "Cong Hua et.al.", "authors": "Cong Hua, Qianqian Xu, Shilong Bao, Zhiyong Yang, Qingming Huang", "id": "2405.09321v1", "paper_url": "http://arxiv.org/abs/2405.09321v1", "repo": "https://github.com/huacong/reconboost"}}