{"2501.16662": {"publish_time": "2025-01-28", "title": "Vision-based autonomous structural damage detection using data-driven methods", "paper_summary": "This study addresses the urgent need for efficient and accurate damage\ndetection in wind turbine structures, a crucial component of renewable energy\ninfrastructure. Traditional inspection methods, such as manual assessments and\nnon-destructive testing (NDT), are often costly, time-consuming, and prone to\nhuman error. To tackle these challenges, this research investigates advanced\ndeep learning algorithms for vision-based structural health monitoring (SHM). A\ndataset of wind turbine surface images, featuring various damage types and\npollution, was prepared and augmented for enhanced model training. Three\nalgorithms-YOLOv7, its lightweight variant, and Faster R-CNN- were employed to\ndetect and classify surface damage. The models were trained and evaluated on a\ndataset split into training, testing, and evaluation subsets (80%-10%-10%).\nResults indicate that YOLOv7 outperformed the others, achieving 82.4% mAP@50\nand high processing speed, making it suitable for real-time inspections. By\noptimizing hyperparameters like learning rate and batch size, the models'\naccuracy and efficiency improved further. YOLOv7 demonstrated significant\nadvancements in detection precision and execution speed, especially for\nreal-time applications. However, challenges such as dataset limitations and\nenvironmental variability were noted, suggesting future work on segmentation\nmethods and larger datasets. This research underscores the potential of\nvision-based deep learning techniques to transform SHM practices by reducing\ncosts, enhancing safety, and improving reliability, thus contributing to the\nsustainable maintenance of critical infrastructure and supporting the longevity\nof wind energy systems.", "paper_summary_zh": "本研究探討了風力渦輪機結構中高效且準確的損傷檢測的迫切需求，這是可再生能源基礎設施的關鍵組成部分。傳統的檢查方法，例如人工評估和無損檢測 (NDT)，通常成本高昂、耗時且容易出現人為錯誤。為了應對這些挑戰，本研究探討了用於基於視覺的結構健康監測 (SHM) 的先進深度學習演算法。準備了一組風力渦輪機表面影像的資料集，其中包含各種損壞類型和汙染，並對其進行擴充以增強模型訓練。採用了三種演算法 YOLOv7、其輕量級變體和 Faster R-CNN 來檢測和分類表面損壞。這些模型在分割成訓練、測試和評估子集 (80%-10%-10%) 的資料集上進行訓練和評估。結果表明，YOLOv7 優於其他演算法，達到了 82.4% 的 mAP@50 和高處理速度，使其適用於即時檢查。透過最佳化學習率和批次大小等超參數，模型的準確度和效率進一步提高。YOLOv7 在檢測精度和執行速度方面表現出顯著進步，特別是對於即時應用。然而，也注意到了資料集限制和環境變異性等挑戰，這表明未來將針對分割方法和更大的資料集進行研究。本研究強調了基於視覺的深度學習技術在轉變 SHM 實務方面的潛力，方法是降低成本、增強安全性並提高可靠性，從而有助於關鍵基礎設施的可持續維護和支持風能系統的長壽命。", "author": "Seyyed Taghi Ataei et.al.", "authors": "Seyyed Taghi Ataei, Parviz Mohammad Zadeh, Saeid Ataei", "id": "2501.16662v1", "paper_url": "http://arxiv.org/abs/2501.16662v1", "repo": "null"}}