{"2501.05680": {"publish_time": "2025-01-10", "title": "EXION: Exploiting Inter- and Intra-Iteration Output Sparsity for Diffusion Models", "paper_summary": "Over the past few years, diffusion models have emerged as novel AI solutions,\ngenerating diverse multi-modal outputs from text prompts. Despite their\ncapabilities, they face challenges in computing, such as excessive latency and\nenergy consumption due to their iterative architecture. Although prior works\nspecialized in transformer acceleration can be applied, the iterative nature of\ndiffusion models remains unresolved. In this paper, we present EXION, the first\nSW-HW co-designed diffusion accelerator that solves the computation challenges\nby exploiting the unique inter- and intra-iteration output sparsity in\ndiffusion models. To this end, we propose two SW-level optimizations. First, we\nintroduce the FFN-Reuse algorithm that identifies and skips redundant\ncomputations in FFN layers across different iterations (inter-iteration\nsparsity). Second, we use a modified eager prediction method that employs\ntwo-step leading-one detection to accurately predict the attention score,\nskipping unnecessary computations within an iteration (intra-iteration\nsparsity). We also introduce a novel data compaction mechanism named ConMerge,\nwhich can enhance HW utilization by condensing and merging sparse matrices into\ncompact forms. Finally, it has a dedicated HW architecture that supports the\nabove sparsity-inducing algorithms, translating high output sparsity into\nimproved energy efficiency and performance. To verify the feasibility of the\nEXION, we first demonstrate that it has no impact on accuracy in various types\nof multi-modal diffusion models. We then instantiate EXION in both server- and\nedge-level settings and compare its performance against GPUs with similar\nspecifications. Our evaluation shows that EXION achieves dramatic improvements\nin performance and energy efficiency by 3.2-379.3x and 45.1-3067.6x compared to\na server GPU and by 42.6-1090.9x and 196.9-4668.2x compared to an edge GPU.", "paper_summary_zh": "在過去幾年，擴散模型已成為新穎的人工智慧解決方案，從文字提示中產生多樣化的多模態輸出。儘管有這些功能，但由於其反覆運算架構，它們在運算上仍面臨挑戰，例如過長的延遲和能源消耗。儘管可以應用先前專精於Transformer加速的工作，但擴散模型的反覆運算性質仍未解決。在本文中，我們提出 EXION，這是第一個 SW-HW 共同設計的擴散加速器，它透過利用擴散模型中獨特的迭代間和迭代內輸出稀疏性來解決運算挑戰。為此，我們提出兩種 SW 層級最佳化。首先，我們引入 FFN-Reuse 演算法，它識別並略過不同迭代中 FFN 層中的重複運算（迭代間稀疏性）。其次，我們使用一種修改的熱切預測方法，它採用兩步領先一偵測來準確預測注意力分數，略過迭代中不必要的運算（迭代內稀疏性）。我們還引入一種名為 ConMerge 的新穎資料壓縮機制，它可以透過將稀疏矩陣壓縮並合併成緊湊形式來提高 HW 利用率。最後，它有一個專用的 HW 架構，支援上述稀疏性誘導演算法，將高輸出稀疏性轉化為更高的能源效率和效能。為了驗證 EXION 的可行性，我們首先證明它對各種類型多模態擴散模型的準確性沒有影響。然後，我們在伺服器和邊緣層級設定中實例化 EXION，並將其效能與具有類似規格的 GPU 進行比較。我們的評估顯示，與伺服器 GPU 相比，EXION 在效能和能源效率方面取得顯著進步，分別提高了 3.2-379.3 倍和 45.1-3067.6 倍；與邊緣 GPU 相比，則分別提高了 42.6-1090.9 倍和 196.9-4668.2 倍。", "author": "Jaehoon Heo et.al.", "authors": "Jaehoon Heo, Adiwena Putra, Jieon Yoon, Sungwoong Yune, Hangyeol Lee, Ji-Hoon Kim, Joo-Young Kim", "id": "2501.05680v1", "paper_url": "http://arxiv.org/abs/2501.05680v1", "repo": "null"}}