{"2405.07798": {"publish_time": "2024-05-13", "title": "FreeVA: Offline MLLM as Training-Free Video Assistant", "paper_summary": "This paper undertakes an empirical study to revisit the latest advancements\nin Multimodal Large Language Models (MLLMs): Video Assistant. This study,\nnamely FreeVA, aims to extend existing image-based MLLM to the video domain in\na training-free manner. The study provides an essential, yet must-know\nbaseline, and reveals several surprising findings: 1) FreeVA, leveraging only\noffline image-based MLLM without additional training, excels in zero-shot video\nquestion-answering (e.g., MSVD-QA, ActivityNet-QA, and MSRVTT-QA), even\nsurpassing state-of-the-art methods that involve video instruction tuning. 2)\nWhile mainstream video-based MLLMs typically initialize with an image-based\nMLLM (e.g., LLaVA) and then fine-tune using video instruction tuning, the study\nindicates that utilizing the widely adopted VideoInstruct-100K for video\ninstruction tuning doesn't actually lead to better performance compared to not\ntraining at all. 3) The commonly used evaluation metrics in existing works are\nsignificantly influenced by changes in the GPT API version over time. If\nignored, this could affect the fairness and uniformity of comparisons between\ndifferent methods and impact the analysis and judgment of researchers in the\nfield. The advancement of MLLMs is currently thriving, drawing numerous\nresearchers into the field. We aim for this work to serve as a plug-and-play,\nsimple yet effective baseline, encouraging the direct evaluation of existing\nMLLMs in video domain while also standardizing the field of video\nconversational models to a certain extent. Also, we encourage researchers to\nreconsider: Have current video MLLM methods truly acquired knowledge beyond\nimage MLLM? Code is available at https://github.com/whwu95/FreeVA", "paper_summary_zh": "<paragraph>本文進行一項實證研究，以重新探討多模態大型語言模型 (MLLM) 中的最新進展：影片助理。本研究，即 FreeVA，旨在以無需訓練的方式將現有的基於影像的 MLLM 擴展到影片領域。本研究提供了一個必要的且必須知道的基準，並揭示了幾個令人驚訝的發現：1) FreeVA 僅利用離線的基於影像的 MLLM，而無需額外的訓練，就能在零次學習影片問答（例如 MSVD-QA、ActivityNet-QA 和 MSRVTT-QA）方面表現出色，甚至超越了涉及影片指令微調的現有方法。2) 儘管主流的基於影片的 MLLM 通常使用基於影像的 MLLM（例如 LLaVA）初始化，然後使用影片指令微調進行微調，但研究表明，使用廣泛採用的 VideoInstruct-100K 進行影片指令微調並未真正帶來比完全不進行訓練更好的效能。3) 現有研究中常用的評量指標會隨著時間推移而受到 GPT API 版本變更的顯著影響。如果忽略這一點，可能會影響不同方法之間比較時公平性和一致性，並影響該領域研究人員的分析和判斷。MLLM 的進展目前蓬勃發展，吸引了許多研究人員進入該領域。我們希望這項工作能作為一個即插即用、簡單但有效的基準，鼓勵直接評估影片領域中現有的 MLLM，同時也在一定程度上標準化影片對話模型的領域。此外，我們鼓勵研究人員重新考慮：目前的影片 MLLM 方法是否真正獲得了超越影像 MLLM 的知識？程式碼可在 https://github.com/whwu95/FreeVA 取得</paragraph>", "author": "Wenhao Wu et.al.", "authors": "Wenhao Wu", "id": "2405.07798v1", "paper_url": "http://arxiv.org/abs/2405.07798v1", "repo": "https://github.com/whwu95/freeva"}}