{"2412.18588": {"publish_time": "2024-12-24", "title": "A Paragraph is All It Takes: Rich Robot Behaviors from Interacting, Trusted LLMs", "paper_summary": "Large Language Models (LLMs) are compact representations of all public\nknowledge of our physical environment and animal and human behaviors. The\napplication of LLMs to robotics may offer a path to highly capable robots that\nperform well across most human tasks with limited or even zero tuning. Aside\nfrom increasingly sophisticated reasoning and task planning, networks of\n(suitably designed) LLMs offer ease of upgrading capabilities and allow humans\nto directly observe the robot's thinking. Here we explore the advantages,\nlimitations, and particularities of using LLMs to control physical robots. The\nbasic system consists of four LLMs communicating via a human language data bus\nimplemented via web sockets and ROS2 message passing. Surprisingly, rich robot\nbehaviors and good performance across different tasks could be achieved despite\nthe robot's data fusion cycle running at only 1Hz and the central data bus\nrunning at the extremely limited rates of the human brain, of around 40 bits/s.\nThe use of natural language for inter-LLM communication allowed the robot's\nreasoning and decision making to be directly observed by humans and made it\ntrivial to bias the system's behavior with sets of rules written in plain\nEnglish. These rules were immutably written into Ethereum, a global, public,\nand censorship resistant Turing-complete computer. We suggest that by using\nnatural language as the data bus among interacting AIs, and immutable public\nledgers to store behavior constraints, it is possible to build robots that\ncombine unexpectedly rich performance, upgradability, and durable alignment\nwith humans.", "paper_summary_zh": "大型語言模型 (LLM) 濃縮了我們對物理環境、動物和人類行為的所有公開知識。將 LLM 應用於機器人技術，可能為功能強大的機器人提供一條途徑，這些機器人在大多數人類任務中表現良好，調整有限甚至為零。除了日益複雜的推理和任務規劃之外，（適當設計的）LLM 網路提供輕鬆升級功能，並允許人類直接觀察機器人的思考。在這裡，我們探討了使用 LLM 控制物理機器人的優點、限制和特殊性。基本系統由四個 LLM 組成，它們通過人類語言數據匯流排進行通信，該匯流排通過網路套接字和 ROS2 訊息傳遞來實現。令人驚訝的是，儘管機器人的數據融合週期僅以 1Hz 運行，而中央數據匯流排以人類大腦極其有限的速度（約 40 位元/秒）運行，但仍可以在不同的任務中實現豐富的機器人行為和良好的性能。使用自然語言進行 LLM 間通信，允許人類直接觀察機器人的推理和決策制定，並使系統行為偏向於用簡單英語編寫的規則集變得微不足道。這些規則不可變地寫入以太坊，這是一個全球性的、公開的、且抗審查的圖靈完備電腦。我們建議，通過使用自然語言作為互動 AI 之間的數據匯流排，以及不可變的公共帳本來儲存行為約束，有可能建立結合了意外豐富的性能、可升級性和與人類持久一致性的機器人。", "author": "OpenMind et.al.", "authors": "OpenMind, Shaohong Zhong, Adam Zhou, Boyuan Chen, Homin Luo, Jan Liphardt", "id": "2412.18588v1", "paper_url": "http://arxiv.org/abs/2412.18588v1", "repo": "null"}}