{"2408.16081": {"publish_time": "2024-08-28", "title": "Logic-Enhanced Language Model Agents for Trustworthy Social Simulations", "paper_summary": "We introduce the Logic-Enhanced Language Model Agents (LELMA) framework, a\nnovel approach to enhance the trustworthiness of social simulations that\nutilize large language models (LLMs). While LLMs have gained attention as\nagents for simulating human behaviour, their applicability in this role is\nlimited by issues such as inherent hallucinations and logical inconsistencies.\nLELMA addresses these challenges by integrating LLMs with symbolic AI, enabling\nlogical verification of the reasoning generated by LLMs. This verification\nprocess provides corrective feedback, refining the reasoning output. The\nframework consists of three main components: an LLM-Reasoner for producing\nstrategic reasoning, an LLM-Translator for mapping natural language reasoning\nto logic queries, and a Solver for evaluating these queries. This study focuses\non decision-making in game-theoretic scenarios as a model of human interaction.\nExperiments involving the Hawk-Dove game, Prisoner's Dilemma, and Stag Hunt\nhighlight the limitations of state-of-the-art LLMs, GPT-4 Omni and Gemini 1.0\nPro, in producing correct reasoning in these contexts. LELMA demonstrates high\naccuracy in error detection and improves the reasoning correctness of LLMs via\nself-refinement, particularly in GPT-4 Omni.", "paper_summary_zh": "我們介紹邏輯增強語言模型代理 (LELMA) 架構，一種增強使用大型語言模型 (LLM) 的社會模擬的可信度的創新方法。儘管 LLM 已獲得關注作為模擬人類行為的代理，但它們在這個角色中的適用性受到固有幻覺和邏輯不一致等問題的限制。LELMA 透過將 LLM 與符號 AI 整合，來解決這些挑戰，讓 LLM 產生的推理進行邏輯驗證。此驗證程序提供修正回饋，精煉推理輸出。此架構包含三個主要組成部分：用於產生策略推理的 LLM 推理引擎、用於將自然語言推理對應到邏輯查詢的 LLM 翻譯器，以及用於評估這些查詢的求解器。本研究專注於博弈論情境中的決策制定，作為人類互動的模型。涉及鷹鴿博弈、囚犯困境和麋鹿獵的實驗突顯了最先進的 LLM、GPT-4 Omni 和 Gemini 1.0 Pro 在這些情境中產生正確推理的限制。LELMA 證明了在錯誤偵測中的高準確度，並透過自我精煉改善了 LLM 的推理正確性，特別是在 GPT-4 Omni 中。", "author": "Agnieszka Mensfelt et.al.", "authors": "Agnieszka Mensfelt, Kostas Stathis, Vince Trencsenyi", "id": "2408.16081v1", "paper_url": "http://arxiv.org/abs/2408.16081v1", "repo": "https://github.com/dicelab-rhul/lelma"}}