{"2405.09934": {"publish_time": "2024-05-16", "title": "Detecting Domain Shift in Multiple Instance Learning for Digital Pathology Using Fréchet Domain Distance", "paper_summary": "Multiple-instance learning (MIL) is an attractive approach for digital\npathology applications as it reduces the costs related to data collection and\nlabelling. However, it is not clear how sensitive MIL is to clinically\nrealistic domain shifts, i.e., differences in data distribution that could\nnegatively affect performance, and if already existing metrics for detecting\ndomain shifts work well with these algorithms. We trained an attention-based\nMIL algorithm to classify whether a whole-slide image of a lymph node contains\nbreast tumour metastases. The algorithm was evaluated on data from a hospital\nin a different country and various subsets of this data that correspond to\ndifferent levels of domain shift. Our contributions include showing that MIL\nfor digital pathology is affected by clinically realistic differences in data,\nevaluating which features from a MIL model are most suitable for detecting\nchanges in performance, and proposing an unsupervised metric named Fr\\'echet\nDomain Distance (FDD) for quantification of domain shifts. Shift measure\nperformance was evaluated through the mean Pearson correlation to change in\nclassification performance, where FDD achieved 0.70 on 10-fold cross-validation\nmodels. The baselines included Deep ensemble, Difference of Confidence, and\nRepresentation shift which resulted in 0.45, -0.29, and 0.56 mean Pearson\ncorrelation, respectively. FDD could be a valuable tool for care providers and\nvendors who need to verify if a MIL system is likely to perform reliably when\nimplemented at a new site, without requiring any additional annotations from\npathologists.", "paper_summary_zh": "多實例學習 (MIL) 是一種對數位病理應用而言具有吸引力的方法，因為它降低了與資料蒐集和標籤相關的成本。然而，MIL 對臨床現實領域轉移的敏感度並不清楚，也就是說，資料分佈的差異可能會對效能造成負面影響，而且現有的領域轉移偵測指標是否能順利與這些演算法搭配使用。我們訓練了一個基於注意力的 MIL 演算法，用於分類淋巴結的整張幻燈片影像是否包含乳房腫瘤轉移。該演算法在不同國家的醫院資料和對應於不同程度領域轉移的各種資料子集中進行評估。我們的貢獻包括顯示用於數位病理的 MIL 會受到資料在臨床上實際的差異影響，評估 MIL 模型中的哪些特徵最適合用於偵測效能變化，並提出一個名為 Fr\\'echet 領域距離 (FDD) 的非監督式指標，用於量化領域轉移。轉移測量效能透過與分類效能變化的平均皮爾森相關性進行評估，其中 FDD 在 10 倍交叉驗證模型中達到 0.70。基準線包括深度整體、信心差異和表示轉移，分別產生 0.45、-0.29 和 0.56 的平均皮爾森相關性。FDD 可能是一個有價值的工具，供照護提供者和供應商在實施新的場域時驗證 MIL 系統是否可能執行可靠的效能，而不需要病理學家的任何額外註解。", "author": "Milda Pocevičiūtė et.al.", "authors": "Milda Pocevičiūtė, Gabriel Eilertsen, Stina Garvin, Claes Lundström", "id": "2405.09934v1", "paper_url": "http://arxiv.org/abs/2405.09934v1", "repo": "null"}}