{"2407.16073": {"publish_time": "2024-07-22", "title": "KaPQA: Knowledge-Augmented Product Question-Answering", "paper_summary": "Question-answering for domain-specific applications has recently attracted\nmuch interest due to the latest advancements in large language models (LLMs).\nHowever, accurately assessing the performance of these applications remains a\nchallenge, mainly due to the lack of suitable benchmarks that effectively\nsimulate real-world scenarios. To address this challenge, we introduce two\nproduct question-answering (QA) datasets focused on Adobe Acrobat and Photoshop\nproducts to help evaluate the performance of existing models on domain-specific\nproduct QA tasks. Additionally, we propose a novel knowledge-driven RAG-QA\nframework to enhance the performance of the models in the product QA task. Our\nexperiments demonstrated that inducing domain knowledge through query\nreformulation allowed for increased retrieval and generative performance when\ncompared to standard RAG-QA methods. This improvement, however, is slight, and\nthus illustrates the challenge posed by the datasets introduced.", "paper_summary_zh": "由於大型語言模型 (LLM) 的最新進展，特定領域應用程式的問答最近引起了極大的興趣。然而，準確評估這些應用程式的效能仍然是一項挑戰，主要是由於缺乏能有效模擬真實世界場景的合適基準測試。為了應對這項挑戰，我們引入了兩個產品問答 (QA) 資料集，專注於 Adobe Acrobat 和 Photoshop 產品，以幫助評估現有模型在特定領域產品 QA 任務上的效能。此外，我們提出了一個新穎的知識驅動 RAG-QA 架構，以增強模型在產品 QA 任務中的效能。我們的實驗表明，與標準 RAG-QA 方法相比，透過查詢重新制定來誘導領域知識，可以提高檢索和生成效能。然而，這種改進很小，因此說明了所引入資料集所帶來的挑戰。", "author": "Swetha Eppalapally et.al.", "authors": "Swetha Eppalapally, Daksh Dangi, Chaithra Bhat, Ankita Gupta, Ruiyi Zhang, Shubham Agarwal, Karishma Bagga, Seunghyun Yoon, Nedim Lipka, Ryan A. Rossi, Franck Dernoncourt", "id": "2407.16073v1", "paper_url": "http://arxiv.org/abs/2407.16073v1", "repo": "null"}}