{"2501.01462": {"publish_time": "2024-12-31", "title": "Pan-infection Foundation Framework Enables Multiple Pathogen Prediction", "paper_summary": "Host-response-based diagnostics can improve the accuracy of diagnosing\nbacterial and viral infections, thereby reducing inappropriate antibiotic\nprescriptions. However, the existing cohorts with limited sample size and\ncoarse infections types are unable to support the exploration of an accurate\nand generalizable diagnostic model. Here, we curate the largest infection\nhost-response transcriptome data, including 11,247 samples across 89 blood\ntranscriptome datasets from 13 countries and 21 platforms. We build a\ndiagnostic model for pathogen prediction starting from a pan-infection model as\nfoundation (AUC = 0.97) based on the pan-infection dataset. Then, we utilize\nknowledge distillation to efficiently transfer the insights from this \"teacher\"\nmodel to four lightweight pathogen \"student\" models, i.e., staphylococcal\ninfection (AUC = 0.99), streptococcal infection (AUC = 0.94), HIV infection\n(AUC = 0.93), and RSV infection (AUC = 0.94), as well as a sepsis \"student\"\nmodel (AUC = 0.99). The proposed knowledge distillation framework not only\nfacilitates the diagnosis of pathogens using pan-infection data, but also\nenables an across-disease study from pan-infection to sepsis. Moreover, the\nframework enables high-degree lightweight design of diagnostic models, which is\nexpected to be adaptively deployed in clinical settings.", "paper_summary_zh": "基於宿主反應的診斷可以提高細菌和病毒感染的診斷準確度，從而減少不適當的抗生素處方。然而，現有樣本量有限、感染類型粗糙的群組無法支持準確且可概化的診斷模型的探索。在此，我們整理了最大的感染宿主反應轉錄組數據，包括來自 13 個國家和 21 個平台的 89 個血液轉錄組數據集中的 11,247 個樣本。我們從泛感染模型開始建立一個用於病原體預測的診斷模型，作為基礎 (AUC = 0.97)，該模型基於泛感染數據集。然後，我們利用知識蒸餾有效地將這個「教師」模型中的見解轉移到四個輕量級病原體「學生」模型，即葡萄球菌感染 (AUC = 0.99)、鏈球菌感染 (AUC = 0.94)、HIV 感染 (AUC = 0.93) 和 RSV 感染 (AUC = 0.94)，以及一個敗血症「學生」模型 (AUC = 0.99)。所提出的知識蒸餾框架不僅促進了使用泛感染數據診斷病原體，還實現了從泛感染到敗血症的跨疾病研究。此外，該框架使診斷模型能夠進行高度輕量級設計，預計將適應性地部署在臨床環境中。", "author": "Lingrui Zhang et.al.", "authors": "Lingrui Zhang, Haonan Wu, Nana Jin, Chenqing Zheng, Jize Xie, Qitai Cai, Jun Wang, Qin Cao, Xubin Zheng, Jiankun Wang, Lixin Cheng", "id": "2501.01462v1", "paper_url": "http://arxiv.org/abs/2501.01462v1", "repo": "null"}}