{"2501.19114": {"publish_time": "2025-01-31", "title": "Principal Components for Neural Network Initialization", "paper_summary": "Principal Component Analysis (PCA) is a commonly used tool for dimension\nreduction and denoising. Therefore, it is also widely used on the data prior to\ntraining a neural network. However, this approach can complicate the\nexplanation of explainable AI (XAI) methods for the decision of the model. In\nthis work, we analyze the potential issues with this approach and propose\nPrincipal Components-based Initialization (PCsInit), a strategy to incorporate\nPCA into the first layer of a neural network via initialization of the first\nlayer in the network with the principal components, and its two variants\nPCsInit-Act and PCsInit-Sub. Explanations using these strategies are as direct\nand straightforward as for neural networks and are simpler than using PCA prior\nto training a neural network on the principal components. Moreover, as will be\nillustrated in the experiments, such training strategies can also allow further\nimprovement of training via backpropagation.", "paper_summary_zh": "主成分分析 (PCA) 是一種常用的降維和去噪工具。因此，它也廣泛用於訓練神經網路之前對資料進行處理。然而，這種方法會使可解釋 AI (XAI) 方法對模型決策的解釋變得複雜。在這項工作中，我們分析了這種方法的潛在問題，並提出了基於主成分的初始化 (PCsInit)，這是一種通過使用主成分對網路中的第一層進行初始化，將 PCA 納入神經網路第一層的策略，以及它的兩個變體 PCsInit-Act 和 PCsInit-Sub。使用這些策略的解釋與神經網路一樣直接且簡潔，並且比在對主成分訓練神經網路之前使用 PCA 更簡單。此外，正如實驗中所展示的那樣，這種訓練策略還可以進一步提高通過反向傳播進行的訓練。", "author": "Nhan Phan et.al.", "authors": "Nhan Phan, Thu Nguyen, Pål Halvorsen, Michael A. Riegler", "id": "2501.19114v1", "paper_url": "http://arxiv.org/abs/2501.19114v1", "repo": "null"}}