{"2501.17397": {"publish_time": "2025-01-29", "title": "Leveraging In-Context Learning and Retrieval-Augmented Generation for Automatic Question Generation in Educational Domains", "paper_summary": "Question generation in education is a time-consuming and cognitively\ndemanding task, as it requires creating questions that are both contextually\nrelevant and pedagogically sound. Current automated question generation methods\noften generate questions that are out of context. In this work, we explore\nadvanced techniques for automated question generation in educational contexts,\nfocusing on In-Context Learning (ICL), Retrieval-Augmented Generation (RAG),\nand a novel Hybrid Model that merges both methods. We implement GPT-4 for ICL\nusing few-shot examples and BART with a retrieval module for RAG. The Hybrid\nModel combines RAG and ICL to address these issues and improve question\nquality. Evaluation is conducted using automated metrics, followed by human\nevaluation metrics. Our results show that both the ICL approach and the Hybrid\nModel consistently outperform other methods, including baseline models, by\ngenerating more contextually accurate and relevant questions.", "paper_summary_zh": "在教育中產生問題是一項耗時且認知上要求很高的任務，因為它需要產生在脈絡上相關且在教學法上合理的題目。目前的自動化問題產生方法通常會產生脈絡不符的題目。在這項工作中，我們探討了在教育脈絡中自動化產生問題的進階技術，重點在於脈絡學習 (ICL)、檢索增強產生 (RAG) 和一個合併這兩種方法的新型混合模型。我們實作了 GPT-4 來進行 ICL，使用少量的範例，以及 BART 加上檢索模組來進行 RAG。混合模型結合了 RAG 和 ICL 來解決這些問題，並提升問題品質。評估是使用自動化指標進行，接著是人工評估指標。我們的結果顯示，ICL 方法和混合模型都持續優於其他方法，包括基準模型，透過產生更多脈絡上準確且相關的題目。", "author": "Subhankar Maity et.al.", "authors": "Subhankar Maity, Aniket Deroy, Sudeshna Sarkar", "id": "2501.17397v1", "paper_url": "http://arxiv.org/abs/2501.17397v1", "repo": "null"}}