{"2502.02372": {"publish_time": "2025-02-04", "title": "MaintaAvatar: A Maintainable Avatar Based on Neural Radiance Fields by Continual Learning", "paper_summary": "The generation of a virtual digital avatar is a crucial research topic in the\nfield of computer vision. Many existing works utilize Neural Radiance Fields\n(NeRF) to address this issue and have achieved impressive results. However,\nprevious works assume the images of the training person are available and fixed\nwhile the appearances and poses of a subject could constantly change and\nincrease in real-world scenarios. How to update the human avatar but also\nmaintain the ability to render the old appearance of the person is a practical\nchallenge. One trivial solution is to combine the existing virtual avatar\nmodels based on NeRF with continual learning methods. However, there are some\ncritical issues in this approach: learning new appearances and poses can cause\nthe model to forget past information, which in turn leads to a degradation in\nthe rendering quality of past appearances, especially color bleeding issues,\nand incorrect human body poses. In this work, we propose a maintainable avatar\n(MaintaAvatar) based on neural radiance fields by continual learning, which\nresolves the issues by utilizing a Global-Local Joint Storage Module and a Pose\nDistillation Module. Overall, our model requires only limited data collection\nto quickly fine-tune the model while avoiding catastrophic forgetting, thus\nachieving a maintainable virtual avatar. The experimental results validate the\neffectiveness of our MaintaAvatar model.", "paper_summary_zh": "虛擬數位替身的生成是電腦視覺領域中一個重要的研究課題。許多現有的作品利用神經輻照場 (NeRF) 來解決這個問題，並取得令人印象深刻的成果。然而，先前的作品假設訓練人物的影像可用且固定，而實際場景中主體的外觀和姿勢可能會持續變化和增加。如何更新人類替身，同時保持渲染人物舊外觀的能力，是一個實際的挑戰。一個簡單的解決方案是將現有的基於 NeRF 的虛擬替身模型與持續學習方法結合。然而，這種方法有一些關鍵問題：學習新的外觀和姿勢可能導致模型遺忘過去的資訊，進而導致過去外觀的渲染品質下降，特別是色彩溢位問題和不正確的人體姿勢。在這項工作中，我們提出了一個基於神經輻照場的持續學習的可維護替身 (MaintaAvatar)，它透過利用全局局部聯合儲存模組和姿勢萃取模組來解決這些問題。總的來說，我們的模型只需要有限的資料收集就能快速微調模型，同時避免災難性遺忘，從而實現可維護的虛擬替身。實驗結果驗證了我們 MaintaAvatar 模型的有效性。", "author": "Shengbo Gu et.al.", "authors": "Shengbo Gu, Yu-Kun Qiu, Yu-Ming Tang, Ancong Wu, Wei-Shi Zheng", "id": "2502.02372v1", "paper_url": "http://arxiv.org/abs/2502.02372v1", "repo": "null"}}