{"2406.06251": {"publish_time": "2024-06-10", "title": "Learning Fine-Grained Controllability on Speech Generation via Efficient Fine-Tuning", "paper_summary": "As the scale of generative models continues to grow, efficient reuse and\nadaptation of pre-trained models have become crucial considerations. In this\nwork, we propose Voicebox Adapter, a novel approach that integrates\nfine-grained conditions into a pre-trained Voicebox speech generation model\nusing a cross-attention module. To ensure a smooth integration of newly added\nmodules with pre-trained ones, we explore various efficient fine-tuning\napproaches. Our experiment shows that the LoRA with bias-tuning configuration\nyields the best performance, enhancing controllability without compromising\nspeech quality. Across three fine-grained conditional generation tasks, we\ndemonstrate the effectiveness and resource efficiency of Voicebox Adapter.\nFollow-up experiments further highlight the robustness of Voicebox Adapter\nacross diverse data setups.", "paper_summary_zh": "隨著生成式模型的規模持續成長，預訓練模型的有效再利用和適應已成為關鍵考量。在這項工作中，我們提出 Voicebox Adapter，一種新穎的方法，它使用跨注意力模組將細粒度條件整合到預訓練的 Voicebox 語音生成模型中。為了確保新增加的模組與預訓練模組順利整合，我們探討了各種有效微調方法。我們的實驗顯示，帶有偏差調整組態的 LoRA 產生最佳效能，增強可控性而不會損害語音品質。在三個細粒度條件式生成任務中，我們展示了 Voicebox Adapter 的有效性和資源效率。後續實驗進一步突顯了 Voicebox Adapter 在不同資料設定中的穩健性。", "author": "Chung-Ming Chien et.al.", "authors": "Chung-Ming Chien, Andros Tjandra, Apoorv Vyas, Matt Le, Bowen Shi, Wei-Ning Hsu", "id": "2406.06251v1", "paper_url": "http://arxiv.org/abs/2406.06251v1", "repo": "null"}}