{"2406.07063": {"publish_time": "2024-06-11", "title": "Reconstructing the Tropical Pacific Upper Ocean using Online Data Assimilation with a Deep Learning model", "paper_summary": "A deep learning (DL) model, based on a transformer architecture, is trained\non a climate-model dataset and compared with a standard linear inverse model\n(LIM) in the tropical Pacific. We show that the DL model produces more accurate\nforecasts compared to the LIM when tested on a reanalysis dataset. We then\nassess the ability of an ensemble Kalman filter to reconstruct the\nmonthly-averaged upper ocean from a noisy set of 24 sea-surface temperature\nobservations designed to mimic existing coral proxy measurements, and compare\nresults for the DL model and LIM. Due to signal damping in the DL model, we\nimplement a novel inflation technique by adding noise from hindcast\nexperiments. Results show that assimilating observations with the DL model\nyields better reconstructions than the LIM for observation averaging times\nranging from one month to one year. The improved reconstruction is due to the\nenhanced predictive capabilities of the DL model, which map the memory of past\nobservations to future assimilation times.", "paper_summary_zh": "一個基於Transformer架構的深度學習 (DL) 模型，訓練於一個氣候模型資料集，並與一個標準線性反算模型 (LIM) 在熱帶太平洋中進行比較。我們顯示，當在一個再分析資料集上進行測試時，DL 模型產生比 LIM 更準確的預測。然後我們評估一個集合卡爾曼濾波器從一組 24 個海面溫度觀測值（設計用於模擬現有的珊瑚代理測量值）中重建每月平均的上層海洋的能力，並比較 DL 模型和 LIM 的結果。由於 DL 模型中的信號衰減，我們通過添加來自後測實驗的噪音來實施一種新的膨脹技術。結果顯示，使用 DL 模型同化觀測值會產生比 LIM 更好的重建，觀測平均時間範圍從一個月到一年。改進的重建歸因於 DL 模型增強的預測能力，它將過去觀測的記憶映射到未來的同化時間。", "author": "Zilu Meng et.al.", "authors": "Zilu Meng, Gregory J. Hakim", "id": "2406.07063v1", "paper_url": "http://arxiv.org/abs/2406.07063v1", "repo": "https://github.com/zilum/dataassimlationwithdl"}}