{"2408.08459": {"publish_time": "2024-08-15", "title": "JPEG-LM: LLMs as Image Generators with Canonical Codec Representations", "paper_summary": "Recent work in image and video generation has been adopting the\nautoregressive LLM architecture due to its generality and potentially easy\nintegration into multi-modal systems. The crux of applying autoregressive\ntraining in language generation to visual generation is discretization --\nrepresenting continuous data like images and videos as discrete tokens. Common\nmethods of discretizing images and videos include modeling raw pixel values,\nwhich are prohibitively lengthy, or vector quantization, which requires\nconvoluted pre-hoc training. In this work, we propose to directly model images\nand videos as compressed files saved on computers via canonical codecs (e.g.,\nJPEG, AVC/H.264). Using the default Llama architecture without any\nvision-specific modifications, we pretrain JPEG-LM from scratch to generate\nimages (and AVC-LM to generate videos as a proof of concept), by directly\noutputting compressed file bytes in JPEG and AVC formats. Evaluation of image\ngeneration shows that this simple and straightforward approach is more\neffective than pixel-based modeling and sophisticated vector quantization\nbaselines (on which our method yields a 31% reduction in FID). Our analysis\nshows that JPEG-LM has an especial advantage over vector quantization models in\ngenerating long-tail visual elements. Overall, we show that using canonical\ncodec representations can help lower the barriers between language generation\nand visual generation, facilitating future research on multi-modal\nlanguage/image/video LLMs.", "paper_summary_zh": "最近在影像和影片生成方面的工作开始采用自回归 LLM 架构，因为其通用性高且易于整合到多模式系统中。将自回归训练应用于语言生成到视觉生成的核心是离散化——将影像和影片等连续数据表示为离散标记。离散化影像和影片的常见方法包括建模原始像素值（长度过长）或向量量化（需要复杂的预先训练）。在这项工作中，我们建议直接将影像和影片建模为计算机上以规范编解码器（例如 JPEG、AVC/H.264）储存的压缩档案。在不进行任何特定于视觉的修改的情况下使用默认的 Llama 架构，我们从头预训练 JPEG-LM 来生成影像（并预训练 AVC-LM 以生成影片作为概念验证），方法是直接输出 JPEG 和 AVC 格式的压缩档案位元组。影像生成的评估显示，这种简单而直接的方法比基于像素的建模和复杂的向量量化基线（我们的方法在 FID 上减少了 31%）更有效。我们的分析显示，JPEG-LM 在生成长尾视觉元素方面特别优于向量量化模型。总体而言，我们表明使用规范编解码器表示可以帮助降低语言生成和视觉生成之间的障碍，促进未来对多模式语言/影像/影片 LLM 的研究。", "author": "Xiaochuang Han et.al.", "authors": "Xiaochuang Han, Marjan Ghazvininejad, Pang Wei Koh, Yulia Tsvetkov", "id": "2408.08459v1", "paper_url": "http://arxiv.org/abs/2408.08459v1", "repo": "null"}}