{"2410.14641": {"publish_time": "2024-10-18", "title": "Distance between Relevant Information Pieces Causes Bias in Long-Context LLMs", "paper_summary": "Positional bias in large language models (LLMs) hinders their ability to\neffectively process long inputs. A prominent example is the \"lost in the\nmiddle\" phenomenon, where LLMs struggle to utilize relevant information\nsituated in the middle of the input. While prior research primarily focuses on\nsingle pieces of relevant information, real-world applications often involve\nmultiple relevant information pieces. To bridge this gap, we present\nLongPiBench, a benchmark designed to assess positional bias involving multiple\npieces of relevant information. Thorough experiments are conducted with five\ncommercial and six open-source models. These experiments reveal that while most\ncurrent models are robust against the \"lost in the middle\" issue, there exist\nsignificant biases related to the spacing of relevant information pieces. These\nfindings highlight the importance of evaluating and reducing positional biases\nto advance LLM's capabilities.", "paper_summary_zh": "大型語言模型 (LLM) 中的位置偏差會阻礙其有效處理長輸入的能力。一個顯著的例子是「迷失在中間」現象，其中 LLM 難以利用位於輸入中間的相关資訊。儘管先前的研究主要關注單一相關資訊，但現實世界的應用通常涉及多個相關資訊。為了彌合這個差距，我們提出了 LongPiBench，這是一個基準，旨在評估涉及多個相關資訊的位置偏差。對五個商業和六個開源模型進行了徹底的實驗。這些實驗表明，雖然大多數當前模型對「迷失在中間」問題具有魯棒性，但與相關資訊間距相關的顯著偏差確實存在。這些發現強調了評估和減少位置偏差以提升 LLM 能力的重要性。", "author": "Runchu Tian et.al.", "authors": "Runchu Tian, Yanghao Li, Yuepeng Fu, Siyang Deng, Qinyu Luo, Cheng Qian, Shuo Wang, Xin Cong, Zhong Zhang, Yesai Wu, Yankai Lin, Huadong Wang, Xiaojiang Liu", "id": "2410.14641v1", "paper_url": "http://arxiv.org/abs/2410.14641v1", "repo": "https://github.com/Rachum-thu/LongPiBench"}}