{"2412.14191": {"publish_time": "2024-12-10", "title": "Ontology-Aware RAG for Improved Question-Answering in Cybersecurity Education", "paper_summary": "Integrating AI into education has the potential to transform the teaching of\nscience and technology courses, particularly in the field of cybersecurity.\nAI-driven question-answering (QA) systems can actively manage uncertainty in\ncybersecurity problem-solving, offering interactive, inquiry-based learning\nexperiences. Large language models (LLMs) have gained prominence in AI-driven\nQA systems, offering advanced language understanding and user engagement.\nHowever, they face challenges like hallucinations and limited domain-specific\nknowledge, which reduce their reliability in educational settings. To address\nthese challenges, we propose CyberRAG, an ontology-aware retrieval-augmented\ngeneration (RAG) approach for developing a reliable and safe QA system in\ncybersecurity education. CyberRAG employs a two-step approach: first, it\naugments the domain-specific knowledge by retrieving validated cybersecurity\ndocuments from a knowledge base to enhance the relevance and accuracy of the\nresponse. Second, it mitigates hallucinations and misuse by integrating a\nknowledge graph ontology to validate the final answer. Experiments on publicly\navailable cybersecurity datasets show that CyberRAG delivers accurate, reliable\nresponses aligned with domain knowledge, demonstrating the potential of AI\ntools to enhance education.", "paper_summary_zh": "將 AI 整合到教育中，有潛力轉型科學和技術課程的教學，特別是在網路安全領域。AI 驅動的問題解答 (QA) 系統可以積極管理網路安全問題解決中的不確定性，提供互動式、基於探究的學習體驗。大型語言模型 (LLM) 在 AI 驅動的 QA 系統中獲得顯著地位，提供進階的語言理解和使用者參與。然而，它們面臨幻覺和特定領域知識有限的挑戰，這會降低它們在教育環境中的可靠性。為了應對這些挑戰，我們提出 CyberRAG，一種意識到本體論的檢索增強生成 (RAG) 方法，用於在網路安全教育中開發可靠且安全的 QA 系統。CyberRAG 採用兩步驟方法：首先，它透過從知識庫中檢索已驗證的網路安全文件來擴充特定領域的知識，以增強回應的相關性和準確性。其次，它透過整合知識圖譜本體論來驗證最終答案，以減輕幻覺和誤用。在公開的網路安全資料集上進行的實驗顯示，CyberRAG 提供準確、可靠的回應，符合領域知識，證明了 AI 工具增強教育的潛力。", "author": "Chengshuai Zhao et.al.", "authors": "Chengshuai Zhao, Garima Agrawal, Tharindu Kumarage, Zhen Tan, Yuli Deng, Ying-Chih Chen, Huan Liu", "id": "2412.14191v1", "paper_url": "http://arxiv.org/abs/2412.14191v1", "repo": "null"}}