{"2502.15455": {"publish_time": "2025-02-21", "title": "R-LoRA: Random Initialization of Multi-Head LoRA for Multi-Task Learning", "paper_summary": "Fine-tuning large language models (LLMs) is prohibitively expensive in terms\nof computational and memory costs. Low-rank Adaptation (LoRA), as one of the\nmost popular parameter-efficient fine-tuning (PEFT) methods, offers a\ncost-effective alternative by approximating the model changes $\\Delta W \\in\n\\mathbb{R}^{m \\times n}$ through the product of down-projection matrix $A \\in\n\\mathbb{R}^{m \\times r}$ and head matrix $B \\in \\mathbb{R}^{r \\times n}$, where\n$r \\ll \\min(m, n)$. In real-world scenarios, LLMs are fine-tuned on data from\nmultiple domains to perform tasks across various fields, embodying multi-task\nlearning (MTL). LoRA often underperforms in such complex scenarios. To enhance\nLoRA's capability in multi-task learning, we propose R-LoRA, which incorporates\nMulti-Head Randomization. Multi-Head Randomization diversifies the head\nmatrices through Multi-Head Random Initialization and Multi-Head Dropout,\nenabling more efficient learning of task-specific features while maintaining\nshared knowledge representation. Extensive experiments demonstrate that R-LoRA\nis better at capturing task-specific knowledge, thereby improving performance\nin multi-task scenarios. The code is available at\nhttps://github.com/jinda-liu/R-LoRA.", "paper_summary_zh": "微調大型語言模型 (LLM) 在運算和記憶體成本方面成本高得令人望而卻步。低秩適應 (LoRA) 作為最流行的參數有效微調 (PEFT) 方法之一，提供了一種具有成本效益的替代方案，通過下投影矩陣 A ∈ Rmxr 和頭矩陣 B ∈ Rrxn 的乘積來近似模型變化 ΔW ∈ Rmxn，其中 r ≪ min(m, n)。在實際場景中，LLM 會針對來自多個網域的資料進行微調，以執行跨越各種領域的任務，體現多任務學習 (MTL)。LoRA 在這種複雜的場景中常常表現不佳。為了增強 LoRA 在多任務學習中的能力，我們提出了 R-LoRA，它結合了多頭隨機化。多頭隨機化通過多頭隨機初始化和多頭中斷來使頭矩陣多樣化，從而在維護共享知識表示的同時，更有效地學習特定於任務的特徵。大量的實驗表明，R-LoRA 更善於擷取特定於任務的知識，從而提高多任務場景中的效能。程式碼可於 https://github.com/jinda-liu/R-LoRA 取得。", "author": "Jinda Liu et.al.", "authors": "Jinda Liu, Yi Chang, Yuan Wu", "id": "2502.15455v1", "paper_url": "http://arxiv.org/abs/2502.15455v1", "repo": "null"}}