{"2407.19937": {"publish_time": "2024-07-29", "title": "AOTree: Aspect Order Tree-based Model for Explainable Recommendation", "paper_summary": "Recent recommender systems aim to provide not only accurate recommendations\nbut also explanations that help users understand them better. However, most\nexisting explainable recommendations only consider the importance of content in\nreviews, such as words or aspects, and ignore the ordering relationship among\nthem. This oversight neglects crucial ordering dimensions in the human\ndecision-making process, leading to suboptimal performance. Therefore, in this\npaper, we propose Aspect Order Tree-based (AOTree) explainable recommendation\nmethod, inspired by the Order Effects Theory from cognitive and decision\npsychology, in order to capture the dependency relationships among decisive\nfactors. We first validate the theory in the recommendation scenario by\nanalyzing the reviews of the users. Then, according to the theory, the proposed\nAOTree expands the construction of the decision tree to capture aspect orders\nin users' decision-making processes, and use attention mechanisms to make\npredictions based on the aspect orders. Extensive experiments demonstrate our\nmethod's effectiveness on rating predictions, and our approach aligns more\nconsistently with the user' s decision-making process by displaying\nexplanations in a particular order, thereby enhancing interpretability.", "paper_summary_zh": "最近的推薦系統不僅旨在提供準確的推薦，還旨在提供有助於使用者更了解推薦的解釋。然而，現有的多數可解釋推薦僅考慮評論中內容（例如詞彙或面向）的重要性，而忽略它們之間的排序關係。這種疏忽忽視了人類決策過程中至關重要的排序維度，導致次優的效能。因此，在本文中，我們提出基於面向順序樹 (AOTree) 的可解釋推薦方法，其靈感來自認知和決策心理學中的順序效應理論，目的是捕捉決定性因素之間的依賴關係。我們首先通過分析使用者的評論來驗證推薦情境中的理論。然後，根據理論，所提出的 AOTree 擴展決策樹的建構，以捕捉使用者決策過程中面向順序，並使用注意力機制根據面向順序進行預測。廣泛的實驗證明了我們的方法在評分預測方面的有效性，而且我們的做法透過以特定順序顯示解釋，更一致地與使用者的決策過程保持一致，從而增強了解度。", "author": "Wenxin Zhao et.al.", "authors": "Wenxin Zhao, Peng Zhang, Hansu Gu, Dongsheng Li, Tun Lu, Ning Gu", "id": "2407.19937v1", "paper_url": "http://arxiv.org/abs/2407.19937v1", "repo": "null"}}