{"2411.02695": {"publish_time": "2024-11-05", "title": "JEL: Applying End-to-End Neural Entity Linking in JPMorgan Chase", "paper_summary": "Knowledge Graphs have emerged as a compelling abstraction for capturing key\nrelationship among the entities of interest to enterprises and for integrating\ndata from heterogeneous sources. JPMorgan Chase (JPMC) is leading this trend by\nleveraging knowledge graphs across the organization for multiple mission\ncritical applications such as risk assessment, fraud detection, investment\nadvice, etc. A core problem in leveraging a knowledge graph is to link mentions\n(e.g., company names) that are encountered in textual sources to entities in\nthe knowledge graph. Although several techniques exist for entity linking, they\nare tuned for entities that exist in Wikipedia, and fail to generalize for the\nentities that are of interest to an enterprise. In this paper, we propose a\nnovel end-to-end neural entity linking model (JEL) that uses minimal context\ninformation and a margin loss to generate entity embeddings, and a Wide & Deep\nLearning model to match character and semantic information respectively. We\nshow that JEL achieves the state-of-the-art performance to link mentions of\ncompany names in financial news with entities in our knowledge graph. We report\non our efforts to deploy this model in the company-wide system to generate\nalerts in response to financial news. The methodology used for JEL is directly\napplicable and usable by other enterprises who need entity linking solutions\nfor data that are unique to their respective situations.", "paper_summary_zh": "知識圖譜已成為捕捉企業感興趣實體之間關鍵關係以及整合異質來源資料的強大抽象概念。摩根大通（JPMC）透過在組織內跨多個任務關鍵應用程式（例如風險評估、詐欺偵測、投資建議等）利用知識圖譜，引領這股趨勢。利用知識圖譜的核心問題是將在文字來源中遇到的提及（例如公司名稱）連結到知識圖譜中的實體。儘管有數種實體連結技術，但這些技術針對維基百科中存在的實體進行調整，無法概括到企業感興趣的實體。在本文中，我們提出一個新穎的端對端神經實體連結模型（JEL），該模型使用最少的脈絡資訊和邊際損失來產生實體嵌入，並使用廣泛且深入的學習模型分別比對字元和語義資訊。我們證明 JEL 達到最先進的效能，可以將財經新聞中公司名稱的提及連結到我們知識圖譜中的實體。我們報告我們在公司範圍內系統中部署此模型的成果，以產生對財經新聞的警示。JEL 使用的方法直接適用於且可用於其他企業，這些企業需要針對其各自情況中獨特的資料提供實體連結解決方案。", "author": "Wanying Ding et.al.", "authors": "Wanying Ding, Vinay K. Chaudhri, Naren Chittar, Krishna Konakanchi", "id": "2411.02695v1", "paper_url": "http://arxiv.org/abs/2411.02695v1", "repo": "null"}}