{"2502.10058": {"publish_time": "2025-02-14", "title": "MTLM: an Innovative Language Model Training Paradigm for ASR", "paper_summary": "Pre-training Transformer-based language models (LMs) on a large amount of\ntext has proven crucial for improving automatic speech recognition (ASR)\nperformance. Generally, traditional LMs are unidirectional and unable to access\nthe context on the right. This paper proposes a method for training LMs that\nenable traditional unidirectional LMs to fully utilize left and right contexts.\nCompared with the unidirectional LMs, our LM facilitates ASR to transcribe\nhypotheses more consistently and in a more semantically unambiguous way, as it\nincorporates richer contextual representations. Finally, our experimental\nresults on the LibriSpeech corpus demonstrate that our model outperforms\ntraditional unidirectional LMs, whether n-best rescoring or shallow fusion is\nused as the decoding algorithm.", "paper_summary_zh": "在大量文本上預訓練基於 Transformer 的語言模型 (LM) 已被證明對於提升自動語音辨識 (ASR) 效能至關重要。一般來說，傳統的 LM 是單向的，無法存取右側的內容。本文提出了一種訓練 LM 的方法，使傳統的單向 LM 能夠充分利用左右兩側的內容。與單向 LM 相比，我們的 LM 能夠讓 ASR 更一致且以更明確的語意方式轉錄假設，因為它納入了更豐富的脈絡表示。最後，我們在 LibriSpeech 語料庫上的實驗結果證明，無論是使用 n-best 重新評分或淺層融合作為解碼演算法，我們的模型都優於傳統的單向 LM。", "author": "Qingliang Meng et.al.", "authors": "Qingliang Meng, Pengju Ren, Tian Li, Changsong Dai", "id": "2502.10058v1", "paper_url": "http://arxiv.org/abs/2502.10058v1", "repo": "null"}}