{"2405.06329": {"publish_time": "2024-05-10", "title": "ChatGPTest: opportunities and cautionary tales of utilizing AI for questionnaire pretesting", "paper_summary": "The rapid advancements in generative artificial intelligence have opened up\nnew avenues for enhancing various aspects of research, including the design and\nevaluation of survey questionnaires. However, the recent pioneering\napplications have not considered questionnaire pretesting. This article\nexplores the use of GPT models as a useful tool for pretesting survey\nquestionnaires, particularly in the early stages of survey design. Illustrated\nwith two applications, the article suggests incorporating GPT feedback as an\nadditional stage before human pretesting, potentially reducing successive\niterations. The article also emphasizes the indispensable role of researchers'\njudgment in interpreting and implementing AI-generated feedback.", "paper_summary_zh": "生成式人工智能的快速发展为增强研究的各个方面开辟了新的途径，包括调查问卷的设计和评估。然而，最近的开创性应用并未考虑问卷预测试。本文探讨了将 GPT 模型用作预测试调查问卷的实用工具，特别是在调查设计的早期阶段。本文通过两个应用来说明，建议将 GPT 反馈作为人工预测试前的附加阶段，从而可能减少连续的迭代。本文还强调了研究人员在解释和实施人工智能生成的反馈中的不可或缺的作用。", "author": "Francisco Olivos et.al.", "authors": "Francisco Olivos, Minhui Liu", "id": "2405.06329v1", "paper_url": "http://arxiv.org/abs/2405.06329v1", "repo": "null"}}