{"2407.08733": {"publish_time": "2024-07-11", "title": "Is Your Model Really A Good Math Reasoner? Evaluating Mathematical Reasoning with Checklist", "paper_summary": "Exceptional mathematical reasoning ability is one of the key features that\ndemonstrate the power of large language models (LLMs). How to comprehensively\ndefine and evaluate the mathematical abilities of LLMs, and even reflect the\nuser experience in real-world scenarios, has emerged as a critical issue.\nCurrent benchmarks predominantly concentrate on problem-solving capabilities,\nwhich presents a substantial risk of model overfitting and fails to accurately\nrepresent genuine mathematical reasoning abilities. In this paper, we argue\nthat if a model really understands a problem, it should be robustly and readily\napplied across a diverse array of tasks. Motivated by this, we introduce\nMATHCHECK, a well-designed checklist for testing task generalization and\nreasoning robustness, as well as an automatic tool to generate checklists\nefficiently. MATHCHECK includes multiple mathematical reasoning tasks and\nrobustness test types to facilitate a comprehensive evaluation of both\nmathematical reasoning ability and behavior testing. Utilizing MATHCHECK, we\ndevelop MATHCHECK-GSM and MATHCHECK-GEO to assess mathematical textual\nreasoning and multi-modal reasoning capabilities, respectively, serving as\nupgraded versions of benchmarks including GSM8k, GeoQA, UniGeo, and Geometry3K.\nWe adopt MATHCHECK-GSM and MATHCHECK-GEO to evaluate over 20 LLMs and 11 MLLMs,\nassessing their comprehensive mathematical reasoning abilities. Our results\ndemonstrate that while frontier LLMs like GPT-4o continue to excel in various\nabilities on the checklist, many other model families exhibit a significant\ndecline. Further experiments indicate that, compared to traditional math\nbenchmarks, MATHCHECK better reflects true mathematical abilities and\nrepresents mathematical intelligence more linearly, thereby supporting our\ndesign. On our MATHCHECK, we can easily conduct detailed behavior analysis to\ndeeply investigate models.", "paper_summary_zh": "傑出的數學推理能力是展示大型語言模型 (LLM) 強大的關鍵特徵之一。如何全面定義和評估 LLM 的數學能力，甚至反映真實場景中的使用者體驗，已成為一個關鍵問題。目前的基準主要集中於問題解決能力，這會造成模型過度擬合的重大風險，且無法準確表示真正的數學推理能力。在本文中，我們論證如果一個模型真正理解一個問題，它應該可以穩健且容易地應用於各種任務中。受此啟發，我們引入了 MATHCHECK，這是一個精心設計的檢查清單，用於測試任務概化和推理穩健性，以及一個用於有效產生檢查清單的自動化工具。MATHCHECK 包含多項數學推理任務和穩健性測試類型，以利於對數學推理能力和行為測試進行全面評估。利用 MATHCHECK，我們開發了 MATHCHECK-GSM 和 MATHCHECK-GEO，分別用於評估數學文本推理和多模態推理能力，作為包括 GSM8k、GeoQA、UniGeo 和 Geometry3K 在內的基準的升級版本。我們採用 MATHCHECK-GSM 和 MATHCHECK-GEO 來評估超過 20 個 LLM 和 11 個 MLLM，評估它們的綜合數學推理能力。我們的結果表明，儘管像 GPT-4o 這樣的邊疆 LLM 繼續在檢查清單上的各種能力中表現出色，但許多其他模型系列卻出現顯著下降。進一步的實驗表明，與傳統數學基準相比，MATHCHECK 更好地反映了真正的數學能力，並更線性地表示數學智能，從而支持我們的設計。在我們的 MATHCHECK 上，我們可以輕鬆進行詳細的行為分析，以深入研究模型。", "author": "Zihao Zhou et.al.", "authors": "Zihao Zhou, Shudong Liu, Maizhen Ning, Wei Liu, Jindong Wang, Derek F. Wong, Xiaowei Huang, Qiufeng Wang, Kaizhu Huang", "id": "2407.08733v1", "paper_url": "http://arxiv.org/abs/2407.08733v1", "repo": "null"}}