{"2411.03275": {"publish_time": "2024-11-05", "title": "Causal Responsibility Attribution for Human-AI Collaboration", "paper_summary": "As Artificial Intelligence (AI) systems increasingly influence\ndecision-making across various fields, the need to attribute responsibility for\nundesirable outcomes has become essential, though complicated by the complex\ninterplay between humans and AI. Existing attribution methods based on actual\ncausality and Shapley values tend to disproportionately blame agents who\ncontribute more to an outcome and rely on real-world measures of\nblameworthiness that may misalign with responsible AI standards. This paper\npresents a causal framework using Structural Causal Models (SCMs) to\nsystematically attribute responsibility in human-AI systems, measuring overall\nblameworthiness while employing counterfactual reasoning to account for agents'\nexpected epistemic levels. Two case studies illustrate the framework's\nadaptability in diverse human-AI collaboration scenarios.", "paper_summary_zh": "隨著人工智慧 (AI) 系統越來越影響各個領域的決策制定，為不良後果歸屬責任的需求已變得至關重要，儘管人類與 AI 之間的複雜交互作用讓這件事變得複雜。現有的歸因方法基於實際因果關係和 Shapley 值，往往會對對結果貢獻較多的代理人過度歸咎，並依賴於可能與負責任的 AI 標準不符的現實世界責難程度衡量。本文提出一個使用結構因果模型 (SCM) 的因果框架，以系統性地將責任歸因於人類 AI 系統，衡量整體責難程度，同時採用反事實推理來考量代理人的預期認識層級。兩個案例研究說明了該框架在不同人類 AI 協作情境中的適應性。", "author": "Yahang Qi et.al.", "authors": "Yahang Qi, Bernhard Schölkopf, Zhijing Jin", "id": "2411.03275v1", "paper_url": "http://arxiv.org/abs/2411.03275v1", "repo": "https://github.com/yahang-qi/Causal-Attr-Human-AI"}}