{"2408.08805": {"publish_time": "2024-08-16", "title": "CIKMar: A Dual-Encoder Approach to Prompt-Based Reranking in Educational Dialogue Systems", "paper_summary": "In this study, we introduce CIKMar, an efficient approach to educational\ndialogue systems powered by the Gemma Language model. By leveraging a\nDual-Encoder ranking system that incorporates both BERT and SBERT model, we\nhave designed CIKMar to deliver highly relevant and accurate responses, even\nwith the constraints of a smaller language model size. Our evaluation reveals\nthat CIKMar achieves a robust recall and F1-score of 0.70 using BERTScore\nmetrics. However, we have identified a significant challenge: the Dual-Encoder\ntends to prioritize theoretical responses over practical ones. These findings\nunderscore the potential of compact and efficient models like Gemma in\ndemocratizing access to advanced educational AI systems, ensuring effective and\ncontextually appropriate responses.", "paper_summary_zh": "在這項研究中，我們介紹了 CIKMar，一種由 Gemma 語言模型驅動的教育對話系統的有效方法。透過利用結合 BERT 和 SBERT 模型的雙編碼器排名系統，我們設計 CIKMar 提供高度相關且準確的回應，即使受到較小語言模型大小的限制。我們的評估顯示，CIKMar 使用 BERTScore 指標達到了 0.70 的強健召回率和 F1 分數。然而，我們發現了一個重大的挑戰：雙編碼器傾向於優先考慮理論回應，而不是實際回應。這些發現強調了像 Gemma 這樣的精簡且高效模型在使進階教育 AI 系統民主化、確保有效且適當的回應方面的潛力。", "author": "Joanito Agili Lopo et.al.", "authors": "Joanito Agili Lopo, Marina Indah Prasasti, Alma Permatasari", "id": "2408.08805v1", "paper_url": "http://arxiv.org/abs/2408.08805v1", "repo": "null"}}