{"2409.11663": {"publish_time": "2024-09-18", "title": "GReDP: A More Robust Approach for Differential Privacy Training with Gradient-Preserving Noise Reduction", "paper_summary": "Deep learning models have been extensively adopted in various regions due to\ntheir ability to represent hierarchical features, which highly rely on the\ntraining set and procedures. Thus, protecting the training process and deep\nlearning algorithms is paramount in privacy preservation. Although Differential\nPrivacy (DP) as a powerful cryptographic primitive has achieved satisfying\nresults in deep learning training, the existing schemes still fall short in\npreserving model utility, i.e., they either invoke a high noise scale or\ninevitably harm the original gradients. To address the above issues, in this\npaper, we present a more robust approach for DP training called GReDP.\nSpecifically, we compute the model gradients in the frequency domain and adopt\na new approach to reduce the noise level. Unlike the previous work, our GReDP\nonly requires half of the noise scale compared to DPSGD [1] while keeping all\nthe gradient information intact. We present a detailed analysis of our method\nboth theoretically and empirically. The experimental results show that our\nGReDP works consistently better than the baselines on all models and training\nsettings.", "paper_summary_zh": "深度學習模型已廣泛應用於各個領域，因為它們能夠表示階層特徵，而這在很大程度上依賴於訓練集和程序。因此，在隱私保護中，保護訓練程序和深度學習演算法至關重要。儘管差分隱私 (DP) 作為一種強大的密碼學原語在深度學習訓練中取得了令人滿意的結果，但現有方案在保留模型效用方面仍有不足，即它們會引發高雜訊比例或不可避免地損害原始梯度。為了解決上述問題，在本文中，我們提出了一種更穩健的 DP 訓練方法，稱為 GReDP。具體來說，我們在頻域中計算模型梯度並採用一種新方法來降低雜訊級別。與先前的研究不同，我們的 GReDP 只需要與 DPSGD [1] 相比一半的雜訊比例，同時保持所有梯度資訊完整。我們從理論和經驗上對我們的方法進行了詳細分析。實驗結果表明，我們的 GReDP 在所有模型和訓練設定上都比基準表現得更好。", "author": "Haodi Wang et.al.", "authors": "Haodi Wang, Tangyu Jiang, Yu Guo, Xiaohua Jia, Chengjun Cai", "id": "2409.11663v1", "paper_url": "http://arxiv.org/abs/2409.11663v1", "repo": "null"}}