{"2406.14882": {"publish_time": "2024-06-21", "title": "70B-parameter large language models in Japanese medical question-answering", "paper_summary": "Since the rise of large language models (LLMs), the domain adaptation has\nbeen one of the hot topics in various domains. Many medical LLMs trained with\nEnglish medical dataset have made public recently. However, Japanese LLMs in\nmedical domain still lack its research. Here we utilize multiple 70B-parameter\nLLMs for the first time and show that instruction tuning using Japanese medical\nquestion-answering dataset significantly improves the ability of Japanese LLMs\nto solve Japanese medical license exams, surpassing 50\\% in accuracy. In\nparticular, the Japanese-centric models exhibit a more significant leap in\nimprovement through instruction tuning compared to their English-centric\ncounterparts. This underscores the importance of continual pretraining and the\nadjustment of the tokenizer in our local language. We also examine two slightly\ndifferent prompt formats, resulting in non-negligible performance improvement.", "paper_summary_zh": "自大型語言模型 (LLM) 興起以來，領域適應已成為各個領域的熱門話題。許多使用英語醫療資料集訓練的醫療 LLM 近期已公開。然而，醫療領域的日語 LLM 仍缺乏研究。在此，我們首次利用多個 70B 參數 LLM，並證明使用日語醫療問答資料集進行指令微調可顯著提升日語 LLM 解決日語醫療執照考試的能力，準確度超過 50%。特別是，以日語為中心的模型在指令微調後展現出比以英語為中心的對應模型更顯著的進步。這強調了持續預訓練和調整我們當地語言中分詞器的重要性。我們也檢視了兩種略有不同的提示格式，進而產生顯著的效能提升。", "author": "Issey Sukeda et.al.", "authors": "Issey Sukeda, Risa Kishikawa, Satoshi Kodera", "id": "2406.14882v1", "paper_url": "http://arxiv.org/abs/2406.14882v1", "repo": "null"}}