{"2412.17548": {"publish_time": "2024-12-23", "title": "Resource-Aware Arabic LLM Creation: Model Adaptation, Integration, and Multi-Domain Testing", "paper_summary": "This paper presents a novel approach to fine-tuning the Qwen2-1.5B model for\nArabic language processing using Quantized Low-Rank Adaptation (QLoRA) on a\nsystem with only 4GB VRAM. We detail the process of adapting this large\nlanguage model to the Arabic domain, using diverse datasets including Bactrian,\nOpenAssistant, and Wikipedia Arabic corpora. Our methodology involves custom\ndata preprocessing, model configuration, and training optimization techniques\nsuch as gradient accumulation and mixed-precision training. We address specific\nchallenges in Arabic NLP, including morphological complexity, dialectal\nvariations, and diacritical mark handling. Experimental results over 10,000\ntraining steps show significant performance improvements, with the final loss\nconverging to 0.1083. We provide comprehensive analysis of GPU memory usage,\ntraining dynamics, and model evaluation across various Arabic language tasks,\nincluding text classification, question answering, and dialect identification.\nThe fine-tuned model demonstrates robustness to input perturbations and\nimproved handling of Arabic-specific linguistic phenomena. This research\ncontributes to multilingual AI by demonstrating a resource-efficient approach\nfor creating specialized language models, potentially democratizing access to\nadvanced NLP technologies for diverse linguistic communities. Our work paves\nthe way for future research in low-resource language adaptation and efficient\nfine-tuning of large language models.", "paper_summary_zh": "本文提出了一種新穎的方法，使用量化低秩適應 (QLoRA) 在僅有 4GB VRAM 的系統上，微調 Qwen2-1.5B 模型以進行阿拉伯語處理。我們詳細說明了將這個大型語言模型適應到阿拉伯語領域的過程，使用了包括 Bactrian、OpenAssistant 和 Wikipedia 阿拉伯語語料庫在內的各種數據集。我們的做法包括自定義資料預處理、模型組態和訓練最佳化技術，例如梯度累積和混合精度訓練。我們解決了阿拉伯語 NLP 中的特定挑戰，包括形態複雜性、方言變異和音標符號處理。超過 10,000 個訓練步驟的實驗結果顯示出顯著的效能提升，最終損失收斂至 0.1083。我們提供了對 GPU 記憶體使用、訓練動態和模型評估的全面分析，涵蓋各種阿拉伯語語言任務，包括文字分類、問題解答和方言辨識。微調後的模型展示了對輸入擾動的穩健性，並改進了對阿拉伯語特定語言現象的處理。這項研究透過展示一種資源有效的方法來建立專門的語言模型，對多語言 AI 有所貢獻，有可能讓不同語言社群都能使用進階的 NLP 技術。我們的研究為低資源語言適應和大型語言模型的有效微調鋪平了道路。", "author": "Prakash Aryan et.al.", "authors": "Prakash Aryan", "id": "2412.17548v1", "paper_url": "http://arxiv.org/abs/2412.17548v1", "repo": "https://github.com/prakash-aryan/qwen-arabic-project"}}