{"2502.03304": {"publish_time": "2025-02-05", "title": "Harmony in Divergence: Towards Fast, Accurate, and Memory-efficient Zeroth-order LLM Fine-tuning", "paper_summary": "Large language models (LLMs) excel across various tasks, but standard\nfirst-order (FO) fine-tuning demands considerable memory, significantly\nlimiting real-world deployment. Recently, zeroth-order (ZO) optimization stood\nout as a promising memory-efficient training paradigm, avoiding backward passes\nand relying solely on forward passes for gradient estimation, making it\nattractive for resource-constrained scenarios. However, ZO method lags far\nbehind FO method in both convergence speed and accuracy. To bridge the gap, we\nintroduce a novel layer-wise divergence analysis that uncovers the distinct\nupdate pattern of FO and ZO optimization. Aiming to resemble the learning\ncapacity of FO method from the findings, we propose \\textbf{Di}vergence-driven\n\\textbf{Z}eroth-\\textbf{O}rder (\\textbf{DiZO}) optimization. DiZO conducts\ndivergence-driven layer adaptation by incorporating projections to ZO updates,\ngenerating diverse-magnitude updates precisely scaled to layer-wise individual\noptimization needs. Our results demonstrate that DiZO significantly reduces the\nneeded iterations for convergence without sacrificing throughput, cutting\ntraining GPU hours by up to 48\\% on various datasets. Moreover, DiZO\nconsistently outperforms the representative ZO baselines in fine-tuning\nRoBERTa-large, OPT-series, and Llama-series on downstream tasks and, in some\ncases, even surpasses memory-intensive FO fine-tuning.", "paper_summary_zh": "大型语言模型 (LLM) 在各种任务中表现出色，但标准\n一阶 (FO) 微调需要大量的内存，极大地\n限制了实际部署。最近，零阶 (ZO) 优化作为一种有前途的省内存训练范例脱颖而出，它避免了反向传递\n并且仅依靠前向传递进行梯度估计，使其\n适用于资源受限的场景。然而，ZO 方法在收敛速度和准确性方面都远远落后于 FO 方法。为了弥补这一差距，我们\n引入了一种新颖的逐层差异分析，揭示了 FO 和 ZO 优化不同的更新模式。为了从研究结果中体现 FO 方法的学习能力，我们提出了\\textbf{Di}vergence-driven\n\\textbf{Z}eroth-\\textbf{O}rder (\\textbf{DiZO}) 优化。DiZO 通过将投影合并到 ZO 更新中来进行差异驱动的层适应，\n生成与逐层个体优化需求精确匹配的不同幅度更新。我们的结果表明，DiZO 显着减少了收敛所需的迭代次数，而不会牺牲吞吐量，将各种数据集上的训练 GPU 小时数减少了 48%。此外，DiZO\n在对 RoBERTa-large、OPT 系列和 Llama 系列进行微调时，始终优于有代表性的 ZO 基线\n在下游任务中，在某些情况下，甚至超过了需要大量内存的 FO 微调。", "author": "Qitao Tan et.al.", "authors": "Qitao Tan, Jun Liu, Zheng Zhan, Caiwei Ding, Yanzhi Wang, Jin Lu, Geng Yuan", "id": "2502.03304v1", "paper_url": "http://arxiv.org/abs/2502.03304v1", "repo": "null"}}