{"2502.13137": {"publish_time": "2025-02-18", "title": "Theorem Prover as a Judge for Synthetic Data Generation", "paper_summary": "The demand for synthetic data in mathematical reasoning has increased due to\nits potential to enhance the mathematical capabilities of large language models\n(LLMs). However, ensuring the validity of intermediate reasoning steps remains\na significant challenge, affecting data quality. While formal verification via\ntheorem provers effectively validates LLM reasoning, the autoformalisation of\nmathematical proofs remains error-prone. In response, we introduce iterative\nautoformalisation, an approach that iteratively refines theorem prover\nformalisation to mitigate errors, thereby increasing the execution rate on the\nLean prover from 60% to 87%. Building upon that, we introduce Theorem Prover as\na Judge (TP-as-a-Judge), a method that employs theorem prover formalisation to\nrigorously assess LLM intermediate reasoning, effectively integrating\nautoformalisation with synthetic data generation. Finally, we present\nReinforcement Learning from Theorem Prover Feedback (RLTPF), a framework that\nreplaces human annotation with theorem prover feedback in Reinforcement\nLearning from Human Feedback (RLHF). Across multiple LLMs, applying\nTP-as-a-Judge and RLTPF improves benchmarks with only 3,508 samples, achieving\n5.56% accuracy gain on Mistral-7B for MultiArith, 6.00% on Llama-2-7B for\nSVAMP, and 3.55% on Llama-3.1-8B for AQUA.", "paper_summary_zh": "<paragraph>由於合成資料在數學推理中具有增強大型語言模型 (LLM) 數學能力的潛力，對合成資料的需求已增加。然而，確保中間推理步驟的有效性仍然是一項重大的挑戰，影響資料品質。雖然透過定理證明器進行形式驗證可有效驗證 LLM 推理，但數學證明自動形式化仍然容易出錯。為了解決這個問題，我們引入了迭代自動形式化，這是一種迭代優化定理證明器形式化以減少錯誤的方法，從而將 Lean 證明器的執行率從 60% 提高到 87%。在此基礎上，我們引入了定理證明器作為評審 (TP-as-a-Judge)，這是一種採用定理證明器形式化來嚴格評估 LLM 中間推理的方法，有效地將自動形式化與合成資料產生整合。最後，我們提出了定理證明器回饋強化學習 (RLTPF)，這是一個框架，用定理證明器回饋取代人類標註，以進行人類回饋強化學習 (RLHF)。在多個 LLM 中，應用 TP-as-a-Judge 和 RLTPF 可透過僅 3,508 個樣本改善基準，在 MultiArith 上獲得 5.56% 的準確度提升，在 SVAMP 上獲得 Llama-2-7B 的 6.00% 提升，在 AQUA 上獲得 Llama-3.1-8B 的 3.55% 提升。</paragraph>", "author": "Joshua Ong Jun Leang et.al.", "authors": "Joshua Ong Jun Leang, Giwon Hong, Wenda Li, Shay B. Cohen", "id": "2502.13137v1", "paper_url": "http://arxiv.org/abs/2502.13137v1", "repo": "null"}}