{"2405.09893": {"publish_time": "2024-05-16", "title": "\"Hunt Takes Hare\": Theming Games Through Game-Word Vector Translation", "paper_summary": "A game's theme is an important part of its design -- it conveys narrative\ninformation, rhetorical messages, helps the player intuit strategies, aids in\ntutorialisation and more. Thematic elements of games are notoriously difficult\nfor AI systems to understand and manipulate, however, and often rely on large\namounts of hand-written interpretations and knowledge. In this paper we present\na technique which connects game embeddings, a recent method for modelling game\ndynamics from log data, and word embeddings, which models semantic information\nabout language. We explain two different approaches for using game embeddings\nin this way, and show evidence that game embeddings enhance the linguistic\ntranslations of game concepts from one theme to another, opening up exciting\nnew possibilities for reasoning about the thematic elements of games in the\nfuture.", "paper_summary_zh": "遊戲的主題是其設計中重要的一部分，它傳達敘事資訊、修辭訊息，有助於玩家直覺策略、輔助教學等。然而，遊戲的主題元素對於 AI 系統來說，出了名的難以理解和操作，而且常常依賴大量的親筆書寫詮釋和知識。在本文中，我們提出了一種技術，它連結了遊戲嵌入，一種從日誌資料建模遊戲動態的最新方法，以及字詞嵌入，一種建模語言語義資訊的方法。我們說明了兩種不同的方法，使用遊戲嵌入的方式，並展示了遊戲嵌入增強了遊戲概念從一個主題到另一個主題的語言翻譯的證據，為未來對遊戲主題元素的推理開啟了令人興奮的新可能性。", "author": "Rabii Younès et.al.", "authors": "Rabii Younès, Cook Michael", "id": "2405.09893v1", "paper_url": "http://arxiv.org/abs/2405.09893v1", "repo": "null"}}