{"2411.07404": {"publish_time": "2024-11-11", "title": "Controllable Context Sensitivity and the Knob Behind It", "paper_summary": "When making predictions, a language model must trade off how much it relies\non its context vs. its prior knowledge. Choosing how sensitive the model is to\nits context is a fundamental functionality, as it enables the model to excel at\ntasks like retrieval-augmented generation and question-answering. In this\npaper, we search for a knob which controls this sensitivity, determining\nwhether language models answer from the context or their prior knowledge. To\nguide this search, we design a task for controllable context sensitivity. In\nthis task, we first feed the model a context (Paris is in England) and a\nquestion (Where is Paris?); we then instruct the model to either use its prior\nor contextual knowledge and evaluate whether it generates the correct answer\nfor both intents (either France or England). When fine-tuned on this task,\ninstruction-tuned versions of Llama-3.1, Mistral-v0.3, and Gemma-2 can solve it\nwith high accuracy (85-95%). Analyzing these high-performing models, we narrow\ndown which layers may be important to context sensitivity using a novel linear\ntime algorithm. Then, in each model, we identify a 1-D subspace in a single\nlayer that encodes whether the model follows context or prior knowledge.\nInterestingly, while we identify this subspace in a fine-tuned model, we find\nthat the exact same subspace serves as an effective knob in not only that model\nbut also non-fine-tuned instruct and base models of that model family. Finally,\nwe show a strong correlation between a model's performance and how distinctly\nit separates context-agreeing from context-ignoring answers in this subspace.\nThese results suggest a single subspace facilitates how the model chooses\nbetween context and prior knowledge, hinting at a simple fundamental mechanism\nthat controls this behavior.", "paper_summary_zh": "<paragraph>在进行预测时，语言模型必须权衡其对上下文与先验知识的依赖程度。选择模型对上下文的敏感程度是一项基本功能，因为它使模型能够在检索增强生成和问答等任务中表现出色。在本文中，我们寻找一个控制这种敏感性的旋钮，确定语言模型是根据上下文还是先验知识来回答。为了指导这项搜索，我们设计了一个可控制上下文敏感性的任务。在这个任务中，我们首先向模型提供一个上下文（巴黎在英国）和一个问题（巴黎在哪里？）；然后我们指示模型使用其先验或上下文知识，并评估它是否为两种意图（法国或英国）生成了正确的答案。在针对此任务进行微调后，Llama-3.1、Mistral-v0.3 和 Gemma-2 的指令调整版本可以高精度（85-95%）解决它。通过分析这些高性能模型，我们使用一种新颖的线性时间算法缩小了可能对上下文敏感性很重要的层。然后，在每个模型中，我们在单个层中识别一个一维子空间，该子空间对模型是遵循上下文还是先验知识进行编码。有趣的是，虽然我们在微调模型中识别出这个子空间，但我们发现完全相同的子空间不仅在该模型中，而且在该模型系列的非微调指令和基础模型中都充当有效旋钮。最后，我们展示了模型的性能与其在这个子空间中明显区分上下文同意和上下文忽略答案之间的相关性。这些结果表明，一个子空间促进了模型如何在上下文和先验知识之间进行选择，暗示了一种控制此行为的简单基本机制。</paragraph>", "author": "Julian Minder et.al.", "authors": "Julian Minder, Kevin Du, Niklas Stoehr, Giovanni Monea, Chris Wendler, Robert West, Ryan Cotterell", "id": "2411.07404v1", "paper_url": "http://arxiv.org/abs/2411.07404v1", "repo": "null"}}