{"2408.08216": {"publish_time": "2024-08-15", "title": "The Dawn of KAN in Image-to-Image (I2I) Translation: Integrating Kolmogorov-Arnold Networks with GANs for Unpaired I2I Translation", "paper_summary": "Image-to-Image translation in Generative Artificial Intelligence (Generative\nAI) has been a central focus of research, with applications spanning\nhealthcare, remote sensing, physics, chemistry, photography, and more. Among\nthe numerous methodologies, Generative Adversarial Networks (GANs) with\ncontrastive learning have been particularly successful. This study aims to\ndemonstrate that the Kolmogorov-Arnold Network (KAN) can effectively replace\nthe Multi-layer Perceptron (MLP) method in generative AI, particularly in the\nsubdomain of image-to-image translation, to achieve better generative quality.\nOur novel approach replaces the two-layer MLP with a two-layer KAN in the\nexisting Contrastive Unpaired Image-to-Image Translation (CUT) model,\ndeveloping the KAN-CUT model. This substitution favors the generation of more\ninformative features in low-dimensional vector representations, which\ncontrastive learning can utilize more effectively to produce high-quality\nimages in the target domain. Extensive experiments, detailed in the results\nsection, demonstrate the applicability of KAN in conjunction with contrastive\nlearning and GANs in Generative AI, particularly for image-to-image\ntranslation. This work suggests that KAN could be a valuable component in the\nbroader generative AI domain.", "paper_summary_zh": "生成式人工智能 (生成式 AI) 中的图像到图像转换一直是研究的重点，其应用涵盖医疗保健、遥感、物理、化学、摄影等领域。在众多方法中，具有对比学习的生成对抗网络 (GAN) 特别成功。本研究旨在证明 Kolmogorov-Arnold 网络 (KAN) 可以有效取代生成式 AI 中的多层感知器 (MLP) 方法，特别是在图像到图像转换的子领域中，以实现更好的生成质量。我们的新方法用两层 KAN 替换现有对比无配对图像到图像转换 (CUT) 模型中的两层 MLP，开发出 KAN-CUT 模型。这种替换有利于在低维向量表示中生成更多信息特征，对比学习可以更有效地利用这些特征，从而在目标域中生成高质量图像。结果部分中详细介绍的广泛实验表明了 KAN 与对比学习和 GAN 在生成式 AI 中结合使用的适用性，特别是对于图像到图像转换。这项工作表明，KAN 可能是更广泛的生成式 AI 领域中的一个有价值的组成部分。", "author": "Arpan Mahara et.al.", "authors": "Arpan Mahara, Naphtali D. Rishe, Liangdong Deng", "id": "2408.08216v1", "paper_url": "http://arxiv.org/abs/2408.08216v1", "repo": "null"}}