{"2501.14224": {"publish_time": "2025-01-24", "title": "Top Ten Challenges Towards Agentic Neural Graph Databases", "paper_summary": "Graph databases (GDBs) like Neo4j and TigerGraph excel at handling\ninterconnected data but lack advanced inference capabilities. Neural Graph\nDatabases (NGDBs) address this by integrating Graph Neural Networks (GNNs) for\npredictive analysis and reasoning over incomplete or noisy data. However, NGDBs\nrely on predefined queries and lack autonomy and adaptability. This paper\nintroduces Agentic Neural Graph Databases (Agentic NGDBs), which extend NGDBs\nwith three core functionalities: autonomous query construction, neural query\nexecution, and continuous learning. We identify ten key challenges in realizing\nAgentic NGDBs: semantic unit representation, abductive reasoning, scalable\nquery execution, and integration with foundation models like large language\nmodels (LLMs). By addressing these challenges, Agentic NGDBs can enable\nintelligent, self-improving systems for modern data-driven applications, paving\nthe way for adaptable and autonomous data management solutions.", "paper_summary_zh": "圖形資料庫（GDB），例如 Neo4j 和 TigerGraph，擅長處理相互連接的資料，但缺乏進階的推論能力。神經圖形資料庫（NGDB）透過整合圖形神經網路（GNN）來解決這個問題，以進行預測分析和對不完整或有雜訊的資料進行推理。然而，NGDB 依賴於預先定義的查詢，並且缺乏自主性和適應性。本文介紹了代理神經圖形資料庫（Agentic NGDB），它以三項核心功能擴充了 NGDB：自動查詢建構、神經查詢執行和持續學習。我們找出實現 Agentic NGDB 的十大關鍵挑戰：語義單元表示、演繹推理、可擴充查詢執行，以及與基礎模型（例如大型語言模型 (LLM)）整合。透過解決這些挑戰，Agentic NGDB 可以為現代資料驅動應用打造智慧且自我改善的系統，為適應性和自主資料管理解決方案鋪路。", "author": "Jiaxin Bai et.al.", "authors": "Jiaxin Bai, Zihao Wang, Yukun Zhou, Hang Yin, Weizhi Fei, Qi Hu, Zheye Deng, Jiayang Cheng, Tianshi Zheng, Hong Ting Tsang, Yisen Gao, Zhongwei Xie, Yufei Li, Lixin Fan, Binhang Yuan, Wei Wang, Lei Chen, Xiaofang Zhou, Yangqiu Song", "id": "2501.14224v1", "paper_url": "http://arxiv.org/abs/2501.14224v1", "repo": "null"}}