{"2409.16686": {"publish_time": "2024-09-25", "title": "MSI-Agent: Incorporating Multi-Scale Insight into Embodied Agents for Superior Planning and Decision-Making", "paper_summary": "Long-term memory is significant for agents, in which insights play a crucial\nrole. However, the emergence of irrelevant insight and the lack of general\ninsight can greatly undermine the effectiveness of insight. To solve this\nproblem, in this paper, we introduce Multi-Scale Insight Agent (MSI-Agent), an\nembodied agent designed to improve LLMs' planning and decision-making ability\nby summarizing and utilizing insight effectively across different scales. MSI\nachieves this through the experience selector, insight generator, and insight\nselector. Leveraging a three-part pipeline, MSI can generate task-specific and\nhigh-level insight, store it in a database, and then use relevant insight from\nit to aid in decision-making. Our experiments show that MSI outperforms another\ninsight strategy when planning by GPT3.5. Moreover, We delve into the\nstrategies for selecting seed experience and insight, aiming to provide LLM\nwith more useful and relevant insight for better decision-making. Our\nobservations also indicate that MSI exhibits better robustness when facing\ndomain-shifting scenarios.", "paper_summary_zh": "長期記憶對於智能體來說非常重要，其中見解扮演著關鍵角色。然而，無關見解的出現和一般見解的缺乏會極大地損害見解的有效性。為了解決這個問題，在本文中，我們介紹了多尺度見解智能體 (MSI-Agent)，這是一個具象智能體，旨在透過有效地總結和利用不同尺度的見解來改善 LLM 的規劃和決策能力。MSI 透過經驗選擇器、見解產生器和見解選擇器來實現這一點。MSI 利用一個由三部分組成的管線，可以產生特定於任務和高層級的見解，將其儲存在資料庫中，然後從中使用相關見解來協助決策。我們的實驗顯示，MSI 在 GPT3.5 規劃時優於其他見解策略。此外，我們深入探討了選擇種子經驗和見解的策略，旨在為 LLM 提供更有用且相關的見解，以做出更好的決策。我們的觀察結果還表明，MSI 在面對領域轉換場景時表現出更好的穩健性。", "author": "Dayuan Fu et.al.", "authors": "Dayuan Fu, Biqing Qi, Yihuai Gao, Che Jiang, Guanting Dong, Bowen Zhou", "id": "2409.16686v1", "paper_url": "http://arxiv.org/abs/2409.16686v1", "repo": "null"}}