{"2501.05712": {"publish_time": "2025-01-10", "title": "Multi-Step Reasoning in Korean and the Emergent Mirage", "paper_summary": "We introduce HRMCR (HAE-RAE Multi-Step Commonsense Reasoning), a benchmark\ndesigned to evaluate large language models' ability to perform multi-step\nreasoning in culturally specific contexts, focusing on Korean. The questions\nare automatically generated via templates and algorithms, requiring LLMs to\nintegrate Korean cultural knowledge into sequential reasoning steps. Consistent\nwith prior observations on emergent abilities, our experiments reveal that\nmodels trained on fewer than \\(2 \\cdot 10^{25}\\) training FLOPs struggle to\nsolve any questions, showing near-zero performance. Beyond this threshold,\nperformance improves sharply. State-of-the-art models (e.g., O1) still score\nunder 50\\%, underscoring the difficulty of our tasks. Notably, stepwise\nanalysis suggests the observed emergent behavior may stem from compounding\nerrors across multiple steps rather than reflecting a genuinely new capability.\nWe publicly release the benchmark and commit to regularly updating the dataset\nto prevent contamination.", "paper_summary_zh": "我們推出 HRMCR（HAE-RAE 多步驟常識推理），這是一項基準，用於評估大型語言模型在特定文化背景下執行多步驟推理的能力，重點關注韓語。這些問題是透過範本和演算法自動產生的，要求大型語言模型將韓語文化知識整合到循序推理步驟中。與之前對新興能力的觀察一致，我們的實驗顯示，訓練資料少於 \\(2 \\cdot 10^{25}\\) 訓練 FLOP 的模型難以解決任何問題，表現接近於零。超過這個閾值後，效能大幅提升。最先進的模型（例如 O1）仍低於 50%，凸顯了我們任務的難度。值得注意的是，逐步分析表明觀察到的新興行為可能源於多個步驟中的複合錯誤，而不是反映真正的新能力。我們公開發布基準，並承諾定期更新資料集以防止污染。", "author": "Guijin Son et.al.", "authors": "Guijin Son, Hyunwoo Ko, Dasol Choi", "id": "2501.05712v1", "paper_url": "http://arxiv.org/abs/2501.05712v1", "repo": "null"}}