{"2411.17608": {"publish_time": "2024-11-26", "title": "Mixed-State Quantum Denoising Diffusion Probabilistic Model", "paper_summary": "Generative quantum machine learning has gained significant attention for its\nability to produce quantum states with desired distributions. Among various\nquantum generative models, quantum denoising diffusion probabilistic models\n(QuDDPMs) [Phys. Rev. Lett. 132, 100602 (2024)] provide a promising approach\nwith stepwise learning that resolves the training issues. However, the\nrequirement of high-fidelity scrambling unitaries in QuDDPM poses a challenge\nin near-term implementation. We propose the \\textit{mixed-state quantum\ndenoising diffusion probabilistic model} (MSQuDDPM) to eliminate the need for\nscrambling unitaries. Our approach focuses on adapting the quantum noise\nchannels to the model architecture, which integrates depolarizing noise\nchannels in the forward diffusion process and parameterized quantum circuits\nwith projective measurements in the backward denoising steps. We also introduce\nseveral techniques to improve MSQuDDPM, including a cosine-exponent schedule of\nnoise interpolation, the use of single-qubit random ancilla, and\nsuperfidelity-based cost functions to enhance the convergence. We evaluate\nMSQuDDPM on quantum ensemble generation tasks, demonstrating its successful\nperformance.", "paper_summary_zh": "生成量子機器學習因其產生具有所需分佈的量子態的能力而備受關注。在各種量子生成模型中，量子去噪擴散概率模型 (QuDDPM) [Phys. Rev. Lett. 132, 100602 (2024)] 提供了一種有前途的方法，它採用逐步學習來解決訓練問題。然而，QuDDPM 中對高保真擾動酉算子的要求在近期實作中構成了一項挑戰。我們提出「混合態量子去噪擴散概率模型」(MSQuDDPM) 來消除對擾動酉算子的需求。我們的做法重點在於將量子雜訊通道調整到模型架構，它在正向擴散過程中整合了去極化雜訊通道，並在反向去噪步驟中使用帶有投影測量的參數化量子電路。我們還引入了幾種技術來改進 MSQuDDPM，包括雜訊插值的餘弦指數時程、使用單量子位隨機輔助量子位，以及基於超保真的成本函數來增強收斂。我們在量子系綜生成任務上評估 MSQuDDPM，證明了其成功的效能。", "author": "Gino Kwun et.al.", "authors": "Gino Kwun, Bingzhi Zhang, Quntao Zhuang", "id": "2411.17608v1", "paper_url": "http://arxiv.org/abs/2411.17608v1", "repo": "null"}}