{"2503.23746": {"publish_time": "2025-03-31", "title": "Short-video Propagation Influence Rating: A New Real-world Dataset and A New Large Graph Model", "paper_summary": "Short-video platforms have gained immense popularity, captivating the\ninterest of millions, if not billions, of users globally. Recently, researchers\nhave highlighted the significance of analyzing the propagation of short-videos,\nwhich typically involves discovering commercial values, public opinions, user\nbehaviors, etc. This paper proposes a new Short-video Propagation Influence\nRating (SPIR) task and aims to promote SPIR from both the dataset and method\nperspectives. First, we propose a new Cross-platform Short-Video (XS-Video)\ndataset, which aims to provide a large-scale and real-world short-video\npropagation network across various platforms to facilitate the research on\nshort-video propagation. Our XS-Video dataset includes 117,720 videos, 381,926\nsamples, and 535 topics across 5 biggest Chinese platforms, annotated with the\npropagation influence from level 0 to 9. To the best of our knowledge, this is\nthe first large-scale short-video dataset that contains cross-platform data or\nprovides all of the views, likes, shares, collects, fans, comments, and comment\ncontent. Second, we propose a Large Graph Model (LGM) named NetGPT, based on a\nnovel three-stage training mechanism, to bridge heterogeneous graph-structured\ndata with the powerful reasoning ability and knowledge of Large Language Models\n(LLMs). Our NetGPT can comprehend and analyze the short-video propagation\ngraph, enabling it to predict the long-term propagation influence of\nshort-videos. Comprehensive experimental results evaluated by both\nclassification and regression metrics on our XS-Video dataset indicate the\nsuperiority of our method for SPIR.", "paper_summary_zh": "<paragraph>短影音平台已經獲得了巨大的歡迎，吸引了全球數百萬（甚至數十億）用戶的興趣。最近，研究人員強調了分析短影音傳播的重要性，這通常涉及發現商業價值、輿論、用戶行為等。本文提出了一個新的短影音傳播影響力評級（SPIR）任務，旨在從數據集和方法兩個角度來推動 SPIR 的發展。首先，我們提出了一個新的跨平台短影音（XS-Video）數據集，旨在提供一個大規模且真實的跨多個平台的短影音傳播網絡，以促進短影音傳播的研究。我們的 XS-Video 數據集包含來自中國五大平台的 117,720 個影片、381,926 個樣本和 535 個主題，並標註了從 0 級到 9 級的傳播影響力。據我們所知，這是第一個包含跨平台數據或提供所有觀看次數、點讚數、分享數、收藏數、粉絲數、評論數和評論內容的大規模短影音數據集。其次，我們提出了一個名為 NetGPT 的大型圖模型（LGM），它基於一種新穎的三階段訓練機制，將異構圖結構數據與大型語言模型（LLM）強大的推理能力和知識相結合。我們的 NetGPT 可以理解和分析短影音傳播圖，使其能夠預測短影音的長期傳播影響力。在我們的 XS-Video 數據集上，透過分類和迴歸指標進行的綜合實驗結果表明，我們的方法在 SPIR 任務上具有優越性。</paragraph>\n", "author": "Dizhan Xue et.al.", "authors": "Dizhan Xue, Jing Cui, Shengsheng Qian, Chuanrui Hu, Changsheng Xu", "id": "2503.23746v1", "paper_url": "http://arxiv.org/abs/2503.23746v1", "repo": "https://github.com/livxue/short-video-influence"}}