{"2501.03064": {"publish_time": "2025-01-06", "title": "Trust Modeling in Counseling Conversations: A Benchmark Study", "paper_summary": "In mental health counseling, a variety of earlier studies have focused on\ndialogue modeling. However, most of these studies give limited to no emphasis\non the quality of interaction between a patient and a therapist. The\ntherapeutic bond between a patient and a therapist directly correlates with\neffective mental health counseling. It involves developing the patient's trust\non the therapist over the course of counseling. To assess the therapeutic bond\nin counseling, we introduce trust as a therapist-assistive metric. Our\ndefinition of trust involves patients' willingness and openness to express\nthemselves and, consequently, receive better care. We conceptualize it as a\ndynamic trajectory observable through textual interactions during the\ncounseling. To facilitate trust modeling, we present MENTAL-TRUST, a novel\ncounseling dataset comprising manual annotation of 212 counseling sessions with\nfirst-of-its-kind seven expert-verified ordinal trust levels. We project our\nproblem statement as an ordinal classification task for trust quantification\nand propose a new benchmark, TrustBench, comprising a suite of classical and\nstate-of-the-art language models on MENTAL-TRUST. We evaluate the performance\nacross a suite of metrics and lay out an exhaustive set of findings. Our study\naims to unfold how trust evolves in therapeutic interactions.", "paper_summary_zh": "在心理健康諮商中，許多早期的研究都專注於對話建模。然而，這些研究大多僅強調或不強調患者與治療師之間互動的品質。患者與治療師之間的治療關係與有效的心理健康諮商直接相關。這涉及在諮商過程中建立患者對治療師的信任。為了評估諮商中的治療關係，我們將信任引入作為治療師輔助指標。我們對信任的定義包括患者表達自己的意願和開放性，並因此獲得更好的照護。我們將其概念化為在諮商期間透過文字互動可以觀察到的動態軌跡。為了促進信任建模，我們提出 MENTAL-TRUST，這是一個新穎的諮商資料集，包含 212 個諮商會談的手動註解，以及首創的七個由專家驗證的序數信任等級。我們將我們的問題陳述投射為信任量化的序數分類任務，並提出一個新的基準 TrustBench，其中包含一組 MENTAL-TRUST 上的經典和最先進的語言模型。我們評估了一系列指標的效能，並列出詳盡的發現。我們的研究旨在探討信任如何在治療互動中演變。", "author": "Aseem Srivastava et.al.", "authors": "Aseem Srivastava, Zuhair Hasan Shaik, Tanmoy Chakraborty, Md Shad Akhtar", "id": "2501.03064v1", "paper_url": "http://arxiv.org/abs/2501.03064v1", "repo": "null"}}