{"2406.19121": {"publish_time": "2024-06-27", "title": "Towards Learning Abductive Reasoning using VSA Distributed Representations", "paper_summary": "We introduce the Abductive Rule Learner with Context-awareness (ARLC), a\nmodel that solves abstract reasoning tasks based on Learn-VRF. ARLC features a\nnovel and more broadly applicable training objective for abductive reasoning,\nresulting in better interpretability and higher accuracy when solving Raven's\nprogressive matrices (RPM). ARLC allows both programming domain knowledge and\nlearning the rules underlying a data distribution. We evaluate ARLC on the\nI-RAVEN dataset, showcasing state-of-the-art accuracy across both\nin-distribution and out-of-distribution (unseen attribute-rule pairs) tests.\nARLC surpasses neuro-symbolic and connectionist baselines, including large\nlanguage models, despite having orders of magnitude fewer parameters. We show\nARLC's robustness to post-programming training by incrementally learning from\nexamples on top of programmed knowledge, which only improves its performance\nand does not result in catastrophic forgetting of the programmed solution. We\nvalidate ARLC's seamless transfer learning from a 2x2 RPM constellation to\nunseen constellations. Our code is available at\nhttps://github.com/IBM/abductive-rule-learner-with-context-awareness.", "paper_summary_zh": "我們引入了具有背景感知的演繹規則學習器 (ARLC)，這是一個基於 Learn-VRF 解決抽象推理任務的模型。ARLC 具有演繹推理的新穎且更廣泛適用的訓練目標，在解決雷文的漸進矩陣 (RPM) 時可提高可解釋性和準確性。ARLC 允許程式設計領域知識和學習資料分佈的基礎規則。我們在 I-RAVEN 資料集上評估 ARLC，展示了在分佈內和分佈外（未見屬性規則對）測試中的最先進準確性。儘管參數數量少幾個數量級，但 ARLC 超越了神經符號和連接主義基準，包括大型語言模型。我們通過在程式設計知識之上逐步從範例中學習來展示 ARLC 對程式設計後訓練的穩健性，這只會改善其效能，而不會導致程式設計解決方案的災難性遺忘。我們驗證了 ARLC 從 2x2 RPM 星群到未見星群的無縫遷移學習。我們的程式碼可在 https://github.com/IBM/abductive-rule-learner-with-context-awareness 取得。", "author": "Giacomo Camposampiero et.al.", "authors": "Giacomo Camposampiero, Michael Hersche, Aleksandar Terzić, Roger Wattenhofer, Abu Sebastian, Abbas Rahimi", "id": "2406.19121v1", "paper_url": "http://arxiv.org/abs/2406.19121v1", "repo": "https://github.com/ibm/abductive-rule-learner-with-context-awareness"}}