{"2502.13836": {"publish_time": "2025-02-19", "title": "Quantifying Memorization and Retriever Performance in Retrieval-Augmented Vision-Language Models", "paper_summary": "Large Language Models (LLMs) demonstrate remarkable capabilities in question\nanswering (QA), but metrics for assessing their reliance on memorization versus\nretrieval remain underdeveloped. Moreover, while finetuned models are\nstate-of-the-art on closed-domain tasks, general-purpose models like GPT-4o\nexhibit strong zero-shot performance. This raises questions about the\ntrade-offs between memorization, generalization, and retrieval. In this work,\nwe analyze the extent to which multimodal retrieval-augmented VLMs memorize\ntraining data compared to baseline VLMs. Using the WebQA benchmark, we contrast\nfinetuned models with baseline VLMs on multihop retrieval and question\nanswering, examining the impact of finetuning on data memorization. To quantify\nmemorization in end-to-end retrieval and QA systems, we propose several proxy\nmetrics by investigating instances where QA succeeds despite retrieval failing.\nOur results reveal the extent to which finetuned models rely on memorization.\nIn contrast, retrieval-augmented VLMs have lower memorization scores, at the\ncost of accuracy (72% vs 52% on WebQA test set). As such, our measures pose a\nchallenge for future work to reconcile memorization and generalization in both\nOpen-Domain QA and joint Retrieval-QA tasks.", "paper_summary_zh": "大型語言模型（LLM）在問答（QA）任務中展現出驚人的能力，但用於評估其依賴記憶而非檢索的指標仍未發展成熟。此外，雖然微調模型在封閉領域任務中是目前最先進的技術，但像 GPT-4o 這樣的通用模型展現出強大的零次學習效能。這引發了關於記憶、概化和檢索之間權衡取捨的問題。在這項研究中，我們分析了多模態檢索增強 VLM 與基準 VLM 相比，記憶訓練資料的程度。使用 WebQA 基準，我們在多跳檢索和問答方面比較了微調模型和基準 VLM，並探討微調對資料記憶的影響。為了量化端到端檢索和 QA 系統中的記憶，我們透過探討檢索失敗但 QA 成功的情況，提出了幾個代理指標。我們的結果揭示了微調模型依賴記憶的程度。相比之下，檢索增強 VLM 的記憶分數較低，但代價是準確度（在 WebQA 測試集中為 72% 對 52%）。因此，我們的測量對未來的研究提出了挑戰，以調和開放領域 QA 和聯合檢索-QA 任務中的記憶和概化。", "author": "Peter Carragher et.al.", "authors": "Peter Carragher, Abhinand Jha, R Raghav, Kathleen M. Carley", "id": "2502.13836v1", "paper_url": "http://arxiv.org/abs/2502.13836v1", "repo": "null"}}