{"2411.17666": {"publish_time": "2024-11-26", "title": "How do Multimodal Foundation Models Encode Text and Speech? An Analysis of Cross-Lingual and Cross-Modal Representations", "paper_summary": "Multimodal foundation models aim to create a unified representation space\nthat abstracts away from surface features like language syntax or modality\ndifferences. To investigate this, we study the internal representations of\nthree recent models, analyzing the model activations from semantically\nequivalent sentences across languages in the text and speech modalities. Our\nfindings reveal that: 1) Cross-modal representations converge over model\nlayers, except in the initial layers specialized at text and speech processing.\n2) Length adaptation is crucial for reducing the cross-modal gap between text\nand speech, although current approaches' effectiveness is primarily limited to\nhigh-resource languages. 3) Speech exhibits larger cross-lingual differences\nthan text. 4) For models not explicitly trained for modality-agnostic\nrepresentations, the modality gap is more prominent than the language gap.", "paper_summary_zh": "多模态基础模型的目标是创建一个统一的表示空间，该空间抽象化了语言语法或模态差异等表面特征。为了研究这一点，我们研究了三个最近模型的内部表示，分析了跨语言在文本和语音模式中语义等价句子的模型激活。我们的发现表明：1) 跨模态表示在模型层中收敛，除了专门用于文本和语音处理的初始层。2) 长度适应对于缩小文本和语音之间的跨模态差距至关重要，尽管当前方法的有效性主要限于资源丰富的语言。3) 语音表现出比文本更大的跨语言差异。4) 对于未针对模态不可知表示显式训练的模型，模态差距比语言差距更突出。", "author": "Hyunji Lee et.al.", "authors": "Hyunji Lee, Danni Liu, Supriti Sinhamahapatra, Jan Niehues", "id": "2411.17666v1", "paper_url": "http://arxiv.org/abs/2411.17666v1", "repo": "null"}}