{"2501.03479": {"publish_time": "2025-01-07", "title": "Women, Infamous, and Exotic Beings: What Honorific Usages in Wikipedia Reveal about the Socio-Cultural Norms", "paper_summary": "Honorifics serve as powerful linguistic markers that reflect social\nhierarchies and cultural values. This paper presents a large-scale,\ncross-linguistic exploration of usage of honorific pronouns in Bengali and\nHindi Wikipedia articles, shedding light on how socio-cultural factors shape\nlanguage. Using LLM (GPT-4o), we annotated 10, 000 articles of real and\nfictional beings in each language for several sociodemographic features such as\ngender, age, fame, and exoticness, and the use of honorifics. We find that\nacross all feature combinations, use of honorifics is consistently more common\nin Bengali than Hindi. For both languages, the use non-honorific pronouns is\nmore commonly observed for infamous, juvenile, and exotic beings. Notably, we\nobserve a gender bias in use of honorifics in Hindi, with men being more\ncommonly referred to with honorifics than women.", "paper_summary_zh": "敬語作為強而有力的語言標記，反映了社會階層和文化價值觀。本文提出了一個大規模的、跨語言的探索，探討了孟加拉語和印地語維基百科文章中敬語代詞的使用，揭示了社會文化因素如何塑造語言。使用 LLM (GPT-4o)，我們為每種語言中 10,000 篇真實和虛構人物的文章註釋了幾個社會人口特徵，例如性別、年齡、名聲和異國情調，以及敬語的使用。我們發現，在所有特徵組合中，孟加拉語中使用敬語的情況普遍比印地語中更常見。對於兩種語言來說，非敬語代詞的使用更常出現在聲名狼藉、年輕和異國情調的人物身上。值得注意的是，我們觀察到印地語中使用敬語存在性別偏見，男性比女性更常被稱為敬語。", "author": "Sourabrata Mukherjee et.al.", "authors": "Sourabrata Mukherjee, Soumya Teotia, Sougata Saha, Monojit Choudhury", "id": "2501.03479v1", "paper_url": "http://arxiv.org/abs/2501.03479v1", "repo": "null"}}