{"2405.10251": {"publish_time": "2024-05-16", "title": "A Systematic Evaluation of Large Language Models for Natural Language Generation Tasks", "paper_summary": "Recent efforts have evaluated large language models (LLMs) in areas such as\ncommonsense reasoning, mathematical reasoning, and code generation. However, to\nthe best of our knowledge, no work has specifically investigated the\nperformance of LLMs in natural language generation (NLG) tasks, a pivotal\ncriterion for determining model excellence. Thus, this paper conducts a\ncomprehensive evaluation of well-known and high-performing LLMs, namely\nChatGPT, ChatGLM, T5-based models, LLaMA-based models, and Pythia-based models,\nin the context of NLG tasks. We select English and Chinese datasets\nencompassing Dialogue Generation and Text Summarization. Moreover, we propose a\ncommon evaluation setting that incorporates input templates and post-processing\nstrategies. Our study reports both automatic results, accompanied by a detailed\nanalysis.", "paper_summary_zh": "近期的研究已評估大型語言模型 (LLM) 在常識推理、數學推理和程式碼生成等領域的表現。然而，據我們所知，目前尚未有研究特別探討 LLM 在自然語言生成 (NLG) 任務中的表現，而這項任務是評量模型優異性的關鍵標準。因此，本論文針對廣為人知且表現優異的 LLM 進行全面的評估，包括 ChatGPT、ChatGLM、基於 T5 的模型、基於 LLaMA 的模型和基於 Pythia 的模型，並以 NLG 任務為背景。我們選擇涵蓋對話生成和文字摘要的英文和中文資料集。此外，我們提出一個通用的評估設定，其中包含輸入範本和後處理策略。我們的研究報告了自動化結果，並附有詳細的分析。", "author": "Xuanfan Ni et.al.", "authors": "Xuanfan Ni, Piji Li", "id": "2405.10251v1", "paper_url": "http://arxiv.org/abs/2405.10251v1", "repo": "null"}}