{"2501.04068": {"publish_time": "2025-01-07", "title": "Explainable Reinforcement Learning for Formula One Race Strategy", "paper_summary": "In Formula One, teams compete to develop their cars and achieve the highest\npossible finishing position in each race. During a race, however, teams are\nunable to alter the car, so they must improve their cars' finishing positions\nvia race strategy, i.e. optimising their selection of which tyre compounds to\nput on the car and when to do so. In this work, we introduce a reinforcement\nlearning model, RSRL (Race Strategy Reinforcement Learning), to control race\nstrategies in simulations, offering a faster alternative to the industry\nstandard of hard-coded and Monte Carlo-based race strategies. Controlling cars\nwith a pace equating to an expected finishing position of P5.5 (where P1\nrepresents first place and P20 is last place), RSRL achieves an average\nfinishing position of P5.33 on our test race, the 2023 Bahrain Grand Prix,\noutperforming the best baseline of P5.63. We then demonstrate, in a\ngeneralisability study, how performance for one track or multiple tracks can be\nprioritised via training. Further, we supplement model predictions with feature\nimportance, decision tree-based surrogate models, and decision tree\ncounterfactuals towards improving user trust in the model. Finally, we provide\nillustrations which exemplify our approach in real-world situations, drawing\nparallels between simulations and reality.", "paper_summary_zh": "在一级方程式赛车中，车队竞相开发他们的赛车，并在每场比赛中取得尽可能高的完赛名次。然而，在比赛期间，车队无法改变赛车，因此他们必须通过比赛策略来提高赛车的完赛名次，即优化选择何时为赛车更换哪种轮胎配方。在这项工作中，我们引入了一个强化学习模型，RSRL（比赛策略强化学习），来控制模拟中的比赛策略，为业界标准的硬编码和基于蒙特卡罗的比赛策略提供了一个更快的替代方案。用与预期完赛名次 P5.5 相当的速度控制赛车（其中 P1 代表第一名，P20 为最后一名），RSRL 在我们的测试比赛中获得了 P5.33 的平均完赛名次，2023 年巴林大奖赛，优于 P5.63 的最佳基准。然后我们在一个通用性研究中展示了如何通过训练优先考虑一条赛道或多条赛道的性能。此外，我们用特征重要性、基于决策树的替代模型和决策树反事实来补充模型预测，以提高用户对模型的信任。最后，我们提供了说明我们方法在现实世界情况中的示例，在模拟和现实之间画出相似之处。", "author": "Devin Thomas et.al.", "authors": "Devin Thomas, Junqi Jiang, Avinash Kori, Aaron Russo, Steffen Winkler, Stuart Sale, Joseph McMillan, Francesco Belardinelli, Antonio Rago", "id": "2501.04068v1", "paper_url": "http://arxiv.org/abs/2501.04068v1", "repo": "null"}}