{"2407.06849": {"publish_time": "2024-07-09", "title": "TeVAE: A Variational Autoencoder Approach for Discrete Online Anomaly Detection in Variable-state Multivariate Time-series Data", "paper_summary": "As attention to recorded data grows in the realm of automotive testing and\nmanual evaluation reaches its limits, there is a growing need for automatic\nonline anomaly detection. This real-world data is complex in many ways and\nrequires the modelling of testee behaviour. To address this, we propose a\ntemporal variational autoencoder (TeVAE) that can detect anomalies with minimal\nfalse positives when trained on unlabelled data. Our approach also avoids the\nbypass phenomenon and introduces a new method to remap individual windows to a\ncontinuous time series. Furthermore, we propose metrics to evaluate the\ndetection delay and root-cause capability of our approach and present results\nfrom experiments on a real-world industrial data set. When properly configured,\nTeVAE flags anomalies only 6% of the time wrongly and detects 65% of anomalies\npresent. It also has the potential to perform well with a smaller training and\nvalidation subset but requires a more sophisticated threshold estimation\nmethod.", "paper_summary_zh": "隨著汽車測試領域中對記錄數據的重視不斷提高，手動評估已達到其極限，因此對自動線上異常偵測的需求也日益增加。這些真實世界的數據在許多方面都很複雜，需要對受測者的行為進行建模。為了解決這個問題，我們提出了一種時間變異自動編碼器 (TeVAE)，它可以在未標記數據上訓練時以最小的誤報率來偵測異常。我們的做法也避免了繞過現象，並引入了一種新的方法，將個別窗口重新映射到連續時間序列。此外，我們還提出了評估偵測延遲和根本原因能力的指標，並展示了在真實世界工業數據集上進行實驗的結果。在適當配置的情況下，TeVAE 僅有 6% 的時間錯誤標記異常，並偵測到 65% 的異常。它還有可能在較小的訓練和驗證子集上表現良好，但需要更精密的閾值估計方法。", "author": "Lucas Correia et.al.", "authors": "Lucas Correia, Jan-Christoph Goos, Philipp Klein, Thomas Bäck, Anna V. Kononova", "id": "2407.06849v1", "paper_url": "http://arxiv.org/abs/2407.06849v1", "repo": "https://github.com/lcs-crr/tevae"}}