{"2410.06741": {"publish_time": "2024-10-09", "title": "CoBa: Convergence Balancer for Multitask Finetuning of Large Language Models", "paper_summary": "Multi-task learning (MTL) benefits the fine-tuning of large language models\n(LLMs) by providing a single model with improved performance and generalization\nability across tasks, presenting a resource-efficient alternative to developing\nseparate models for each task. Yet, existing MTL strategies for LLMs often fall\nshort by either being computationally intensive or failing to ensure\nsimultaneous task convergence. This paper presents CoBa, a new MTL approach\ndesigned to effectively manage task convergence balance with minimal\ncomputational overhead. Utilizing Relative Convergence Scores (RCS), Absolute\nConvergence Scores (ACS), and a Divergence Factor (DF), CoBa dynamically\nadjusts task weights during the training process, ensuring that the validation\nloss of all tasks progress towards convergence at an even pace while mitigating\nthe issue of individual task divergence. The results of our experiments\ninvolving three disparate datasets underscore that this approach not only\nfosters equilibrium in task improvement but enhances the LLMs' performance by\nup to 13% relative to the second-best baselines. Code is open-sourced at\nhttps://github.com/codefuse-ai/MFTCoder.", "paper_summary_zh": "多任務學習 (MTL) 透過提供單一模型，進而改善大型語言模型 (LLM) 的微調，提升任務間的效能和泛化能力，提供開發每項任務的獨立模型的省資源替代方案。然而，現有的 LLM MTL 策略通常會因運算密集或無法確保任務同時收斂而不足。本文提出 CoBa，一種新的 MTL 方法，旨在有效管理任務收斂平衡，且運算開銷最小。CoBa 在訓練過程中動態調整任務權重，利用相對收斂分數 (RCS)、絕對收斂分數 (ACS) 和分歧因子 (DF)，確保所有任務的驗證損失以均等的步調朝向收斂進行，同時減輕個別任務分歧的問題。我們在三個不同的資料集進行實驗的結果強調，這種方法不僅促進任務改進的平衡，更將 LLM 的效能提升多達 13%，相較於第二佳基準。程式碼已於 https://github.com/codefuse-ai/MFTCoder 開源。", "author": "Zi Gong et.al.", "authors": "Zi Gong, Hang Yu, Cong Liao, Bingchang Liu, Chaoyu Chen, Jianguo Li", "id": "2410.06741v1", "paper_url": "http://arxiv.org/abs/2410.06741v1", "repo": "https://github.com/codefuse-ai/mftcoder"}}