{"2407.12665": {"publish_time": "2024-07-17", "title": "Patch-Level Training for Large Language Models", "paper_summary": "As Large Language Models (LLMs) achieve remarkable progress in language\nunderstanding and generation, their training efficiency has become a critical\nconcern. Traditionally, LLMs are trained to predict the next token in a\nsequence. Despite the success of token-level training, it suffers from\nconsiderable computational costs due to the need to process an extensive number\nof tokens. To mitigate this issue, this paper introduces patch-level training\nfor LLMs, which reduces the sequence length by compressing multiple tokens into\na single patch. During patch-level training, we feed the language model shorter\nsequences of patches and train it to predict the next patch, thereby processing\nthe majority of the training data at a significantly reduced computational\ncost. Following this, the model continues token-level training on the remaining\ntraining data to align with the inference mode. Experiments on a diverse range\nof models (370M-2.7B parameters) demonstrate that patch-level training can\nreduce overall computational costs to 0.5$\\times$, without compromising the\nmodel performance compared to token-level training. Source code:\n\\url{https://github.com/shaochenze/PatchTrain}.", "paper_summary_zh": "隨著大型語言模型（LLM）在語言理解和生成方面取得顯著進展，其訓練效率已成為關鍵問題。傳統上，LLM 被訓練來預測序列中的下一個符號。儘管符號級別訓練很成功，但由於需要處理大量符號，因此會產生相當大的運算成本。為了緩解這個問題，本文引入了 LLM 的區塊級訓練，它通過將多個符號壓縮成單個區塊來縮短序列長度。在區塊級訓練期間，我們將較短的區塊序列提供給語言模型，並訓練它預測下一個區塊，從而以顯著降低的運算成本處理大部分訓練資料。在此之後，模型繼續對剩餘的訓練資料進行符號級訓練，以與推理模式保持一致。在各種模型（370M-2.7B 參數）上進行的實驗表明，區塊級訓練可以將整體運算成本降低到 0.5 倍，而不會損害模型效能，這與符號級訓練相比。原始碼：\\url{https://github.com/shaochenze/PatchTrain}。", "author": "Chenze Shao et.al.", "authors": "Chenze Shao, Fandong Meng, Jie Zhou", "id": "2407.12665v1", "paper_url": "http://arxiv.org/abs/2407.12665v1", "repo": "https://github.com/shaochenze/patchtrain"}}