{"2412.07334": {"publish_time": "2024-12-10", "title": "Frame Representation Hypothesis: Multi-Token LLM Interpretability and Concept-Guided Text Generation", "paper_summary": "Interpretability is a key challenge in fostering trust for Large Language\nModels (LLMs), which stems from the complexity of extracting reasoning from\nmodel's parameters. We present the Frame Representation Hypothesis, a\ntheoretically robust framework grounded in the Linear Representation Hypothesis\n(LRH) to interpret and control LLMs by modeling multi-token words. Prior\nresearch explored LRH to connect LLM representations with linguistic concepts,\nbut was limited to single token analysis. As most words are composed of several\ntokens, we extend LRH to multi-token words, thereby enabling usage on any\ntextual data with thousands of concepts. To this end, we propose words can be\ninterpreted as frames, ordered sequences of vectors that better capture\ntoken-word relationships. Then, concepts can be represented as the average of\nword frames sharing a common concept. We showcase these tools through Top-k\nConcept-Guided Decoding, which can intuitively steer text generation using\nconcepts of choice. We verify said ideas on Llama 3.1, Gemma 2, and Phi 3\nfamilies, demonstrating gender and language biases, exposing harmful content,\nbut also potential to remediate them, leading to safer and more transparent\nLLMs. Code is available at\nhttps://github.com/phvv-me/frame-representation-hypothesis.git", "paper_summary_zh": "可解釋性是培養對大型語言模型 (LLM) 信任的關鍵挑戰，其源於從模型參數中提取推理的複雜性。我們提出了框架表示假設，這是一個理論上穩健的框架，其基礎是線性表示假設 (LRH)，用於通過建模多個符號詞來解釋和控制 LLM。先前的研究探索了 LRH 以連接 LLM 表示與語言概念，但僅限於單個符號分析。由於大多數詞彙由幾個符號組成，因此我們將 LRH 擴展到多個符號詞，從而可以在包含數千個概念的任何文本數據上使用。為此，我們提出可以將詞彙解釋為框架，即可以更好地捕捉符號詞關係的向量有序序列。然後，可以將概念表示為共享共同概念的詞彙框架的平均值。我們通過 Top-k 概念引導解碼展示了這些工具，該解碼可以使用選擇的概念直觀地引導文本生成。我們在 Llama 3.1、Gemma 2 和 Phi 3 系列上驗證了上述想法，展示了性別和語言偏見，揭露了有害內容，但也展示了補救它們的潛力，從而導致更安全、更透明的 LLM。代碼可在 https://github.com/phvv-me/frame-representation-hypothesis.git 中獲得", "author": "Pedro H. V. Valois et.al.", "authors": "Pedro H. V. Valois, Lincon S. Souza, Erica K. Shimomoto, Kazuhiro Fukui", "id": "2412.07334v1", "paper_url": "http://arxiv.org/abs/2412.07334v1", "repo": "https://github.com/phvv-me/frame-representation-hypothesis"}}