{"2407.17097": {"publish_time": "2024-07-24", "title": "Towards Robust Knowledge Tracing Models via k-Sparse Attention", "paper_summary": "Knowledge tracing (KT) is the problem of predicting students' future\nperformance based on their historical interaction sequences. With the advanced\ncapability of capturing contextual long-term dependency, attention mechanism\nbecomes one of the essential components in many deep learning based KT (DLKT)\nmodels. In spite of the impressive performance achieved by these attentional\nDLKT models, many of them are often vulnerable to run the risk of overfitting,\nespecially on small-scale educational datasets. Therefore, in this paper, we\npropose \\textsc{sparseKT}, a simple yet effective framework to improve the\nrobustness and generalization of the attention based DLKT approaches.\nSpecifically, we incorporate a k-selection module to only pick items with the\nhighest attention scores. We propose two sparsification heuristics : (1)\nsoft-thresholding sparse attention and (2) top-$K$ sparse attention. We show\nthat our \\textsc{sparseKT} is able to help attentional KT models get rid of\nirrelevant student interactions and have comparable predictive performance when\ncompared to 11 state-of-the-art KT models on three publicly available\nreal-world educational datasets. To encourage reproducible research, we make\nour data and code publicly available at\n\\url{https://github.com/pykt-team/pykt-toolkit}\\footnote{We merged our model to\nthe \\textsc{pyKT} benchmark at \\url{https://pykt.org/}.}.", "paper_summary_zh": "<paragraph>知識追蹤 (KT) 的問題在於預測學生的未來表現，依據他們過往的互動序列。在捕捉脈絡長期依賴性的進階能力下，注意力機制成為許多基於深度學習的知識追蹤 (DLKT) 模型中不可或缺的組成部分。儘管這些注意力 DLKT 模型獲得令人印象深刻的表現，但許多模型經常面臨過度擬合的風險，特別是在小規模的教育資料集上。因此，在本文中，我們提出 \\textsc{sparseKT}，一個簡單但有效的架構，以改善基於注意力的 DLKT 方法的穩健性和泛化性。具體來說，我們結合了一個 k 選擇模組，僅挑選具有最高注意力分數的項目。我們提出兩種稀疏化啟發法：(1) 軟閾值稀疏注意力和 (2) 前 $K$ 個稀疏注意力。我們展示了我們的 \\textsc{sparseKT} 能夠幫助注意力 KT 模型擺脫無關的學生互動，並且在與三個公開可用的真實世界教育資料集上的 11 個最先進的 KT 模型相比時，具有相當的預測效能。為了鼓勵可重複的研究，我們公開我們的資料和程式碼於 \\url{https://github.com/pykt-team/pykt-toolkit}\\footnote{我們將我們的模型合併到 \\textsc{pyKT} 基準中，網址為 \\url{https://pykt.org/}.}。</paragraph>", "author": "Shuyan Huang et.al.", "authors": "Shuyan Huang, Zitao Liu, Xiangyu Zhao, Weiqi Luo, Jian Weng", "id": "2407.17097v1", "paper_url": "http://arxiv.org/abs/2407.17097v1", "repo": "https://github.com/pykt-team/pykt-toolkit"}}