{"2405.20319": {"publish_time": "2024-05-30", "title": "ParSEL: Parameterized Shape Editing with Language", "paper_summary": "The ability to edit 3D assets from natural language presents a compelling\nparadigm to aid in the democratization of 3D content creation. However, while\nnatural language is often effective at communicating general intent, it is\npoorly suited for specifying precise manipulation. To address this gap, we\nintroduce ParSEL, a system that enables controllable editing of high-quality 3D\nassets from natural language. Given a segmented 3D mesh and an editing request,\nParSEL produces a parameterized editing program. Adjusting the program\nparameters allows users to explore shape variations with a precise control over\nthe magnitudes of edits. To infer editing programs which align with an input\nedit request, we leverage the abilities of large-language models (LLMs).\nHowever, while we find that LLMs excel at identifying initial edit operations,\nthey often fail to infer complete editing programs, and produce outputs that\nviolate shape semantics. To overcome this issue, we introduce Analytical Edit\nPropagation (AEP), an algorithm which extends a seed edit with additional\noperations until a complete editing program has been formed. Unlike prior\nmethods, AEP searches for analytical editing operations compatible with a range\nof possible user edits through the integration of computer algebra systems for\ngeometric analysis. Experimentally we demonstrate ParSEL's effectiveness in\nenabling controllable editing of 3D objects through natural language requests\nover alternative system designs.", "paper_summary_zh": "透過自然語言編輯 3D 素材的能力，提供了一個引人注目的範例，有助於 3D 內容創作的民主化。然而，儘管自然語言通常能有效傳達一般意圖，但它不適合用於指定精確的處理。為了解決這個差距，我們引入了 ParSEL，一個系統，它能從自然語言中控制性地編輯高品質的 3D 素材。給定一個分段的 3D 網格和一個編輯請求，ParSEL 會產生一個參數化編輯程式。調整程式參數允許使用者探索形狀變化，並精確控制編輯的幅度。為了推斷與輸入編輯請求對齊的編輯程式，我們利用大型語言模型 (LLM) 的能力。然而，儘管我們發現 LLM 在識別初始編輯操作方面表現出色，但它們通常無法推斷出完整的編輯程式，並產生違反形狀語意的輸出。為了克服這個問題，我們引入了分析編輯傳播 (AEP)，一種演算法，它使用額外的操作延伸種子編輯，直到形成一個完整的編輯程式。與先前的做法不同，AEP 透過整合用於幾何分析的電腦代數系統，搜尋與各種可能的使用者編輯相容的分析編輯操作。透過實驗，我們展示了 ParSEL 在透過自然語言請求對 3D 物件進行可控編輯方面的有效性，優於其他系統設計。", "author": "Aditya Ganeshan et.al.", "authors": "Aditya Ganeshan, Ryan Y. Huang, Xianghao Xu, R. Kenny Jones, Daniel Ritchie", "id": "2405.20319v2", "paper_url": "http://arxiv.org/abs/2405.20319v2", "repo": "null"}}