{"2412.18778": {"publish_time": "2024-12-25", "title": "Unified Local and Global Attention Interaction Modeling for Vision Transformers", "paper_summary": "We present a novel method that extends the self-attention mechanism of a\nvision transformer (ViT) for more accurate object detection across diverse\ndatasets. ViTs show strong capability for image understanding tasks such as\nobject detection, segmentation, and classification. This is due in part to\ntheir ability to leverage global information from interactions among visual\ntokens. However, the self-attention mechanism in ViTs are limited because they\ndo not allow visual tokens to exchange local or global information with\nneighboring features before computing global attention. This is problematic\nbecause tokens are treated in isolation when attending (matching) to other\ntokens, and valuable spatial relationships are overlooked. This isolation is\nfurther compounded by dot-product similarity operations that make tokens from\ndifferent semantic classes appear visually similar. To address these\nlimitations, we introduce two modifications to the traditional self-attention\nframework; a novel aggressive convolution pooling strategy for local feature\nmixing, and a new conceptual attention transformation to facilitate interaction\nand feature exchange between semantic concepts. Experimental results\ndemonstrate that local and global information exchange among visual features\nbefore self-attention significantly improves performance on challenging object\ndetection tasks and generalizes across multiple benchmark datasets and\nchallenging medical datasets. We publish source code and a novel dataset of\ncancerous tumors (chimeric cell clusters).", "paper_summary_zh": "<paragraph>我們提出了一種新穎的方法，它擴展了視覺轉換器 (ViT) 的自注意力機制，以在不同的資料集上進行更準確的物件偵測。ViT 顯示出強大的影像理解任務能力，例如物件偵測、分割和分類。這部分歸功於它們能夠利用視覺標記之間互動的全局資訊。然而，ViT 中的自注意力機制受到限制，因為它們不允許視覺標記在計算全局注意力之前與鄰近特徵交換局部或全局資訊。這是個問題，因為在對其他標記進行注意力（比對）時，標記會被孤立處理，而有價值的空間關係則被忽略。這種孤立進一步加劇了點積相似度運算，這使得來自不同語義類別的標記看起來在視覺上相似。為了解決這些限制，我們對傳統的自注意力架構進行了兩項修改；一種新穎的積極卷積池化策略，用於局部特徵混合，以及一種新的概念注意力轉換，以促進語義概念之間的互動和特徵交換。實驗結果表明，在自注意力之前視覺特徵之間的局部和全局資訊交換，顯著改善了具有挑戰性的物件偵測任務的效能，並在多個基準資料集和具有挑戰性的醫療資料集上進行概化。我們發布了癌症腫瘤（嵌合細胞簇）的原始碼和新穎資料集。</paragraph>", "author": "Tan Nguyen et.al.", "authors": "Tan Nguyen, Coy D. Heldermon, Corey Toler-Franklin", "id": "2412.18778v1", "paper_url": "http://arxiv.org/abs/2412.18778v1", "repo": "null"}}