{"2407.16318": {"publish_time": "2024-07-23", "title": "PrimeGuard: Safe and Helpful LLMs through Tuning-Free Routing", "paper_summary": "Deploying language models (LMs) necessitates outputs to be both high-quality\nand compliant with safety guidelines. Although Inference-Time Guardrails (ITG)\noffer solutions that shift model output distributions towards compliance, we\nfind that current methods struggle in balancing safety with helpfulness. ITG\nMethods that safely address non-compliant queries exhibit lower helpfulness\nwhile those that prioritize helpfulness compromise on safety. We refer to this\ntrade-off as the guardrail tax, analogous to the alignment tax. To address\nthis, we propose PrimeGuard, a novel ITG method that utilizes structured\ncontrol flow.\n  PrimeGuard routes requests to different self-instantiations of the LM with\nvarying instructions, leveraging its inherent instruction-following\ncapabilities and in-context learning. Our tuning-free approach dynamically\ncompiles system-designer guidelines for each query. We construct and release\nsafe-eval, a diverse red-team safety benchmark. Extensive evaluations\ndemonstrate that PrimeGuard, without fine-tuning, overcomes the guardrail tax\nby (1) significantly increasing resistance to iterative jailbreak attacks and\n(2) achieving state-of-the-art results in safety guardrailing while (3)\nmatching helpfulness scores of alignment-tuned models. Extensive evaluations\ndemonstrate that PrimeGuard, without fine-tuning, outperforms all competing\nbaselines and overcomes the guardrail tax by improving the fraction of safe\nresponses from 61% to 97% and increasing average helpfulness scores from 4.17\nto 4.29 on the largest models, while reducing attack success rate from 100% to\n8%.\n  PrimeGuard implementation is available at\nhttps://github.com/dynamofl/PrimeGuard and safe-eval dataset is available at\nhttps://huggingface.co/datasets/dynamoai/safe_eval.", "paper_summary_zh": "<paragraph>部署語言模型 (LM) 需要輸出既要高品質，又要符合安全準則。儘管推論時間護欄 (ITG) 提供了解決方案，將模型輸出分佈轉移到合規性，我們發現當前方法在平衡安全性與實用性方面遇到困難。ITG 方法安全地處理不符合規範的查詢，表現出較低的實用性，而優先考慮實用性的方法則會影響安全性。我們將這種權衡稱為護欄稅，類似於對齊稅。為了解決這個問題，我們提出了 PrimeGuard，這是一種利用結構化控制流的新型 ITG 方法。\nPrimeGuard 將請求路由到 LM 的不同自實例化，並附有不同的指示，利用其固有的指令遵循能力和情境學習。我們的無調校方法會動態編譯每個查詢的系統設計人員指南。我們構建並發布 safe-eval，這是一個多樣化的紅隊安全基準。廣泛的評估表明，PrimeGuard 在沒有微調的情況下，通過 (1) 大幅提高對反覆越獄攻擊的抵抗力，以及 (2) 在安全護欄中取得最先進的成果，同時 (3) 匹配對齊調整模型的實用性分數，克服了護欄稅。廣泛的評估表明，PrimeGuard 在沒有微調的情況下，優於所有競爭基準，並通過將安全回應的比例從 61% 提高到 97%，並將平均實用性分數從 4.17 提高到 4.29（在最大的模型上），同時將攻擊成功率從 100% 降低到 8%，克服了護欄稅。\nPrimeGuard 實作可以在 https://github.com/dynamofl/PrimeGuard 取得，而 safe-eval 資料集可以在 https://huggingface.co/datasets/dynamoai/safe_eval 取得。</paragraph>", "author": "Blazej Manczak et.al.", "authors": "Blazej Manczak, Eliott Zemour, Eric Lin, Vaikkunth Mugunthan", "id": "2407.16318v1", "paper_url": "http://arxiv.org/abs/2407.16318v1", "repo": "https://github.com/dynamofl/primeguard"}}