{"2411.14034": {"publish_time": "2024-11-21", "title": "Assessing data-driven predictions of band gap and electrical conductivity for transparent conducting materials", "paper_summary": "Machine Learning (ML) has offered innovative perspectives for accelerating\nthe discovery of new functional materials, leveraging the increasing\navailability of material databases. Despite the promising advances, data-driven\nmethods face constraints imposed by the quantity and quality of available data.\nMoreover, ML is often employed in tandem with simulated datasets originating\nfrom density functional theory (DFT), and assessed through in-sample evaluation\nschemes. This scenario raises questions about the practical utility of ML in\nuncovering new and significant material classes for industrial applications.\nHere, we propose a data-driven framework aimed at accelerating the discovery of\nnew transparent conducting materials (TCMs), an important category of\nsemiconductors with a wide range of applications. To mitigate the shortage of\navailable data, we create and validate unique experimental databases,\ncomprising several examples of existing TCMs. We assess state-of-the-art (SOTA)\nML models for property prediction from the stoichiometry alone. We propose a\nbespoke evaluation scheme to provide empirical evidence on the ability of ML to\nuncover new, previously unseen materials of interest. We test our approach on a\nlist of 55 compositions containing typical elements of known TCMs. Although our\nstudy indicates that ML tends to identify new TCMs compositionally similar to\nthose in the training data, we empirically demonstrate that it can highlight\nmaterial candidates that may have been previously overlooked, offering a\nsystematic approach to identify materials that are likely to display TCMs\ncharacteristics.", "paper_summary_zh": "機器學習 (ML) 提供了創新的觀點，可加速新功能材料的發現，利用日益增加的材料資料庫。儘管有這些有前景的進展，但資料驅動方法面臨可用資料數量和品質所施加的限制。此外，ML 通常與源自密度泛函理論 (DFT) 的模擬資料集結合使用，並透過樣本內評估方案進行評估。此情境引發了關於 ML 在發現工業應用中新的且重要的材料類別方面的實用性問題。在此，我們提出一個資料驅動的架構，旨在加速發現新的透明導電材料 (TCM)，這類半導體非常重要，應用範圍廣泛。為了減少可用資料的短缺，我們建立並驗證了獨特的實驗資料庫，其中包含了現有 TCM 的幾個範例。我們評估了最先進 (SOTA) ML 模型，僅從化學計量學預測特性。我們提出了一個客製化的評估方案，以提供經驗證據，證明 ML 能夠發現新的、以前未見過的感興趣材料。我們在包含已知 TCM 的典型元素的 55 種成分清單上測試了我們的方法。儘管我們的研究表明，ML 傾向於識別與訓練資料中類似的組成新 TCM，但我們經驗性地證明，它可以突顯可能以前被忽略的材料候選，提供一種系統性的方法來識別可能顯示 TCM 特性的材料。", "author": "Federico Ottomano et.al.", "authors": "Federico Ottomano, John Y. Goulermas, Vladimir Gusev, Rahul Savani, Michael W. Gaultois, Troy D. Manning, Hai Lin, Teresa P. Manzanera, Emmeline G. Poole, Matthew S. Dyer, John B. Claridge, Jon Alaria, Luke M. Daniels, Su Varma, David Rimmer, Kevin Sanderson, Matthew J. Rosseinsky", "id": "2411.14034v1", "paper_url": "http://arxiv.org/abs/2411.14034v1", "repo": "null"}}