{"2501.01645": {"publish_time": "2025-01-03", "title": "HLV-1K: A Large-scale Hour-Long Video Benchmark for Time-Specific Long Video Understanding", "paper_summary": "Multimodal large language models have become a popular topic in deep visual\nunderstanding due to many promising real-world applications. However, hour-long\nvideo understanding, spanning over one hour and containing tens of thousands of\nvisual frames, remains under-explored because of 1) challenging long-term video\nanalyses, 2) inefficient large-model approaches, and 3) lack of large-scale\nbenchmark datasets. Among them, in this paper, we focus on building a\nlarge-scale hour-long long video benchmark, HLV-1K, designed to evaluate long\nvideo understanding models. HLV-1K comprises 1009 hour-long videos with 14,847\nhigh-quality question answering (QA) and multi-choice question asnwering (MCQA)\npairs with time-aware query and diverse annotations, covering frame-level,\nwithin-event-level, cross-event-level, and long-term reasoning tasks. We\nevaluate our benchmark using existing state-of-the-art methods and demonstrate\nits value for testing deep long video understanding capabilities at different\nlevels and for various tasks. This includes promoting future long video\nunderstanding tasks at a granular level, such as deep understanding of long\nlive videos, meeting recordings, and movies.", "paper_summary_zh": "多模态大型语言模型由于许多有前景的实际应用，已成为深度视觉理解中的热门话题。然而，长达一小时、跨越一个小时并包含数万个视觉帧的视频理解仍然未得到充分探索，原因有 1）具有挑战性的长期视频分析，2）低效的大模型方法，以及 3）缺乏大规模基准数据集。其中，在本文中，我们专注于构建一个大规模的小时级长视频基准 HLV-1K，旨在评估长视频理解模型。HLV-1K 包含 1009 个小时长的视频，其中有 14,847 个高质量的问答 (QA) 和多项选择问答 (MCQA) 对，带有时间感知查询和多样化的注释，涵盖帧级、事件内级、跨事件级和长期推理任务。我们使用现有的最先进方法评估我们的基准，并展示了其在不同级别和各种任务中测试深度长视频理解能力的价值。这包括在细粒度级别促进未来的长视频理解任务，例如深入理解长直播视频、会议记录和电影。", "author": "Heqing Zou et.al.", "authors": "Heqing Zou, Tianze Luo, Guiyang Xie, Victor, Zhang, Fengmao Lv, Guangcong Wang, Junyang Chen, Zhuochen Wang, Hansheng Zhang, Huaijian Zhang", "id": "2501.01645v1", "paper_url": "http://arxiv.org/abs/2501.01645v1", "repo": "null"}}