{"2405.14535": {"publish_time": "2024-05-23", "title": "Exploring Alignment in Shared Cross-lingual Spaces", "paper_summary": "Despite their remarkable ability to capture linguistic nuances across diverse\nlanguages, questions persist regarding the degree of alignment between\nlanguages in multilingual embeddings. Drawing inspiration from research on\nhigh-dimensional representations in neural language models, we employ\nclustering to uncover latent concepts within multilingual models. Our analysis\nfocuses on quantifying the \\textit{alignment} and \\textit{overlap} of these\nconcepts across various languages within the latent space. To this end, we\nintroduce two metrics \\CA{} and \\CO{} aimed at quantifying these aspects,\nenabling a deeper exploration of multilingual embeddings. Our study encompasses\nthree multilingual models (\\texttt{mT5}, \\texttt{mBERT}, and \\texttt{XLM-R})\nand three downstream tasks (Machine Translation, Named Entity Recognition, and\nSentiment Analysis). Key findings from our analysis include: i) deeper layers\nin the network demonstrate increased cross-lingual \\textit{alignment} due to\nthe presence of language-agnostic concepts, ii) fine-tuning of the models\nenhances \\textit{alignment} within the latent space, and iii) such\ntask-specific calibration helps in explaining the emergence of zero-shot\ncapabilities in the models.\\footnote{The code is available at\n\\url{https://github.com/baselmousi/multilingual-latent-concepts}}", "paper_summary_zh": "儘管多語言嵌入在捕捉不同語言的語言差異方面有顯著能力，但對於多語言嵌入中語言之間的一致性程度仍存在疑問。從神經語言模型中高維表示的研究中汲取靈感，我們採用聚類來揭示多語言模型中的潛在概念。我們的分析重點在於量化潛在空間中各種語言中這些概念的「一致性」和「重疊」。為此，我們引入了兩個指標 \\CA{} 和 \\CO{}，旨在量化這些方面，從而能夠更深入地探討多語言嵌入。我們的研究涵蓋了三個多語言模型（\\texttt{mT5}、\\texttt{mBERT} 和 \\texttt{XLM-R}）和三個下游任務（機器翻譯、命名實體識別和情緒分析）。我們的分析中的一些主要發現包括：i) 由於存在與語言無關的概念，網路中較深的層級展示出增加的跨語言「一致性」，ii) 模型的微調增強了潛在空間中的「一致性」，以及 iii) 這種特定於任務的校準有助於解釋模型中零次學習能力的出現。\\footnote{程式碼可在 \\url{https://github.com/baselmousi/multilingual-latent-concepts} 取得}", "author": "Basel Mousi et.al.", "authors": "Basel Mousi, Nadir Durrani, Fahim Dalvi, Majd Hawasly, Ahmed Abdelali", "id": "2405.14535v1", "paper_url": "http://arxiv.org/abs/2405.14535v1", "repo": "null"}}