{"2503.03987": {"publish_time": "2025-03-06", "title": "RetinalGPT: A Retinal Clinical Preference Conversational Assistant Powered by Large Vision-Language Models", "paper_summary": "Recently, Multimodal Large Language Models (MLLMs) have gained significant\nattention for their remarkable ability to process and analyze non-textual data,\nsuch as images, videos, and audio. Notably, several adaptations of\ngeneral-domain MLLMs to the medical field have been explored, including\nLLaVA-Med. However, these medical adaptations remain insufficiently advanced in\nunderstanding and interpreting retinal images. In contrast, medical experts\nemphasize the importance of quantitative analyses for disease detection and\ninterpretation. This underscores a gap between general-domain and\nmedical-domain MLLMs: while general-domain MLLMs excel in broad applications,\nthey lack the specialized knowledge necessary for precise diagnostic and\ninterpretative tasks in the medical field. To address these challenges, we\nintroduce \\textit{RetinalGPT}, a multimodal conversational assistant for\nclinically preferred quantitative analysis of retinal images. Specifically, we\nachieve this by compiling a large retinal image dataset, developing a novel\ndata pipeline, and employing customized visual instruction tuning to enhance\nboth retinal analysis and enrich medical knowledge. In particular, RetinalGPT\noutperforms MLLM in the generic domain by a large margin in the diagnosis of\nretinal diseases in 8 benchmark retinal datasets. Beyond disease diagnosis,\nRetinalGPT features quantitative analyses and lesion localization, representing\na pioneering step in leveraging LLMs for an interpretable and end-to-end\nclinical research framework. The code is available at\nhttps://github.com/Retinal-Research/RetinalGPT", "paper_summary_zh": "最近，多模態大型語言模型 (MLLM) 因其處理和分析非文本數據（如圖像、影片和音訊）的卓越能力而備受關注。值得注意的是，已經探索了將通用領域 MLLM 應用於醫療領域的幾種改編，包括 LLaVA-Med。然而，這些醫學改編在理解和解釋視網膜圖像方面仍然不夠先進。相比之下，醫學專家強調定量分析對於疾病檢測和解釋的重要性。這突顯了通用領域和醫學領域 MLLM 之間的差距：雖然通用領域 MLLM 在廣泛的應用中表現出色，但它們缺乏在醫療領域進行精確診斷和解釋任務所需的專業知識。為了應對這些挑戰，我們推出了 *RetinalGPT*，這是一款用於臨床首選的視網膜圖像定量分析的多模態對話助手。具體來說，我們通過編譯大型視網膜圖像數據集、開發新的數據管道以及採用客製化的視覺指令調整來增強視網膜分析和豐富醫學知識來實現這一點。特別是，RetinalGPT 在 8 個基準視網膜數據集中診斷視網膜疾病方面的表現遠遠優於通用領域的 MLLM。除了疾病診斷之外，RetinalGPT 還具有定量分析和病灶定位功能，代表著在利用 LLM 建立可解釋的端到端臨床研究框架方面的開創性一步。程式碼可在 https://github.com/Retinal-Research/RetinalGPT 獲得。\n", "author": "Wenhui Zhu et.al.", "authors": "Wenhui Zhu, Xin Li, Xiwen Chen, Peijie Qiu, Vamsi Krishna Vasa, Xuanzhao Dong, Yanxi Chen, Natasha Lepore, Oana Dumitrascu, Yi Su, Yalin Wang", "id": "2503.03987v1", "paper_url": "http://arxiv.org/abs/2503.03987v1", "repo": "null"}}