{"2502.12586": {"publish_time": "2025-02-18", "title": "G-Refer: Graph Retrieval-Augmented Large Language Model for Explainable Recommendation", "paper_summary": "Explainable recommendation has demonstrated significant advantages in\ninforming users about the logic behind recommendations, thereby increasing\nsystem transparency, effectiveness, and trustworthiness. To provide\npersonalized and interpretable explanations, existing works often combine the\ngeneration capabilities of large language models (LLMs) with collaborative\nfiltering (CF) information. CF information extracted from the user-item\ninteraction graph captures the user behaviors and preferences, which is crucial\nfor providing informative explanations. However, due to the complexity of graph\nstructure, effectively extracting the CF information from graphs still remains\na challenge. Moreover, existing methods often struggle with the integration of\nextracted CF information with LLMs due to its implicit representation and the\nmodality gap between graph structures and natural language explanations. To\naddress these challenges, we propose G-Refer, a framework using graph\nretrieval-augmented large language models (LLMs) for explainable\nrecommendation. Specifically, we first employ a hybrid graph retrieval\nmechanism to retrieve explicit CF signals from both structural and semantic\nperspectives. The retrieved CF information is explicitly formulated as\nhuman-understandable text by the proposed graph translation and accounts for\nthe explanations generated by LLMs. To bridge the modality gap, we introduce\nknowledge pruning and retrieval-augmented fine-tuning to enhance the ability of\nLLMs to process and utilize the retrieved CF information to generate\nexplanations. Extensive experiments show that G-Refer achieves superior\nperformance compared with existing methods in both explainability and\nstability. Codes and data are available at https://github.com/Yuhan1i/G-Refer.", "paper_summary_zh": "可解釋建議已證明在告知使用者建議背後的邏輯方面具有顯著優點，從而提高系統透明度、有效性和可信度。為了提供個人化且可解釋的說明，現有作品通常結合大型語言模型 (LLM) 的生成能力與協同過濾 (CF) 資訊。從使用者項目互動圖形中提取的 CF 資訊會擷取使用者行為和偏好，這對於提供資訊性說明至關重要。然而，由於圖形結構的複雜性，從圖形中有效提取 CF 資訊仍然是一個挑戰。此外，現有方法通常難以將提取的 CF 資訊與 LLM 整合，因為其隱含表示和圖形結構與自然語言說明之間的模式差距。為了應對這些挑戰，我們提出 G-Refer，一個使用圖形檢索增強型大型語言模型 (LLM) 的可解釋建議架構。具體來說，我們首先採用混合圖形檢索機制，從結構和語義角度檢索明確的 CF 訊號。檢索到的 CF 資訊由建議的圖形翻譯明確表述為人類可以理解的文字，並說明 LLM 生成的解釋。為了彌合模式差距，我們引入了知識修剪和檢索增強微調，以增強 LLM 處理和利用檢索到的 CF 資訊以產生解釋的能力。廣泛的實驗表明，與現有方法相比，G-Refer 在可解釋性和穩定性方面都取得了卓越的效能。程式碼和資料可在 https://github.com/Yuhan1i/G-Refer 取得。", "author": "Yuhan Li et.al.", "authors": "Yuhan Li, Xinni Zhang, Linhao Luo, Heng Chang, Yuxiang Ren, Irwin King, Jia Li", "id": "2502.12586v1", "paper_url": "http://arxiv.org/abs/2502.12586v1", "repo": "null"}}