{"2408.15204": {"publish_time": "2024-08-27", "title": "Can Unconfident LLM Annotations Be Used for Confident Conclusions?", "paper_summary": "Large language models (LLMs) have shown high agreement with human raters\nacross a variety of tasks, demonstrating potential to ease the challenges of\nhuman data collection. In computational social science (CSS), researchers are\nincreasingly leveraging LLM annotations to complement slow and expensive human\nannotations. Still, guidelines for collecting and using LLM annotations,\nwithout compromising the validity of downstream conclusions, remain limited. We\nintroduce Confidence-Driven Inference: a method that combines LLM annotations\nand LLM confidence indicators to strategically select which human annotations\nshould be collected, with the goal of producing accurate statistical estimates\nand provably valid confidence intervals while reducing the number of human\nannotations needed. Our approach comes with safeguards against LLM annotations\nof poor quality, guaranteeing that the conclusions will be both valid and no\nless accurate than if we only relied on human annotations. We demonstrate the\neffectiveness of Confidence-Driven Inference over baselines in statistical\nestimation tasks across three CSS settings--text politeness, stance, and\nbias--reducing the needed number of human annotations by over 25% in each.\nAlthough we use CSS settings for demonstration, Confidence-Driven Inference can\nbe used to estimate most standard quantities across a broad range of NLP\nproblems.", "paper_summary_zh": "大型語言模型 (LLM) 在各種任務中已展現出與人類評分者高度一致，證明了其減輕人類資料收集挑戰的潛力。在計算社會科學 (CSS) 中，研究人員正日益利用 LLM 標註來補充緩慢且昂貴的人類標註。儘管如此，在不損害下游結論的有效性的前提下，收集和使用 LLM 標註的準則仍然有限。我們引入了信心驅動推論：一種結合 LLM 標註和 LLM 信心指標的方法，以策略性地選擇應收集哪些人類標註，目標是在減少所需人類標註數量的同時產生準確的統計估計和可證明有效的信心區間。我們的做法帶有針對品質不佳的 LLM 標註的保障措施，確保結論既有效又不會比我們僅依賴人類標註時不準確。我們在三個 CSS 設定（文字禮貌、立場和偏見）中，證明了信心驅動推論優於基線的有效性，在每個設定中將所需的人類標註數量減少了 25% 以上。儘管我們使用 CSS 設定進行示範，但信心驅動推論可用於估計廣泛 NLP 問題中的大多數標準量。", "author": "Kristina Gligorić et.al.", "authors": "Kristina Gligorić, Tijana Zrnic, Cinoo Lee, Emmanuel J. Candès, Dan Jurafsky", "id": "2408.15204v1", "paper_url": "http://arxiv.org/abs/2408.15204v1", "repo": "null"}}