{"2412.12583": {"publish_time": "2024-12-17", "title": "Process-Supervised Reward Models for Clinical Note Generation: A Scalable Approach Guided by Domain Expertise", "paper_summary": "Process-supervised reward models (PRMs), which verify large language model\n(LLM) outputs step-by-step, have achieved significant success in mathematical\nand coding problems. However, their application to other domains remains\nlargely unexplored. In this work, we train a PRM to provide step-level reward\nsignals for clinical notes generated by LLMs from patient-doctor dialogues.\nGuided by real-world clinician expertise, we carefully designed step\ndefinitions for clinical notes and utilized Gemini-Pro 1.5 to automatically\ngenerate process supervision data at scale. Our proposed PRM, trained on the\nLLaMA-3.1 8B instruct model, demonstrated superior performance compared to\nGemini-Pro 1.5 and an outcome-supervised reward model (ORM) across two key\nevaluations: (1) the accuracy of selecting gold-reference samples from\nerror-containing samples, achieving 98.8% (versus 61.3% for ORM and 93.8% for\nGemini-Pro 1.5), and (2) the accuracy of selecting physician-preferred notes,\nachieving 56.2% (compared to 51.2% for ORM and 50.0% for Gemini-Pro 1.5).\nAdditionally, we conducted ablation studies to determine optimal loss functions\nand data selection strategies, along with physician reader studies to explore\npredictors of downstream Best-of-N performance. Our promising results suggest\nthe potential of PRMs to extend beyond the clinical domain, offering a scalable\nand effective solution for diverse generative tasks.", "paper_summary_zh": "<paragraph>過程監督獎勵模型 (PRM) 會逐步驗證大型語言模型 (LLM) 的輸出，已在數學和編碼問題中取得重大成功。然而，它們在其他領域的應用仍未廣泛探討。在這項工作中，我們訓練了一個 PRM，以提供 LLM 從患者與醫師對話中產生的臨床筆記的步驟層級獎勵訊號。在真實世界的臨床醫師專業知識指導下，我們仔細設計了臨床筆記的步驟定義，並利用 Gemini-Pro 1.5 自動大規模產生過程監督資料。在 LLaMA-3.1 8B 指令模型上訓練的我們提出的 PRM 在兩項關鍵評估中表現出優於 Gemini-Pro 1.5 和結果監督獎勵模型 (ORM) 的效能：(1) 從含錯誤的範例中選取黃金參考範例的準確度，達到 98.8%（相較於 ORM 的 61.3% 和 Gemini-Pro 1.5 的 93.8%），以及 (2) 選取醫師偏好的筆記的準確度，達到 56.2%（相較於 ORM 的 51.2% 和 Gemini-Pro 1.5 的 50.0%）。此外，我們進行了消融研究以確定最佳損失函數和資料選取策略，並與醫師讀者研究一起探討下游最佳 N 效能的預測因子。我們有前景的結果表明 PRM 有可能擴展到臨床領域以外，為各種生成任務提供可擴充且有效的解決方案。</paragraph>", "author": "Hanyin Wang et.al.", "authors": "Hanyin Wang, Qiping Xu, Bolun Liu, Guleid Hussein, Hariprasad Korsapati, Mohamad El Labban, Kingsley Iheasirim, Mohamed Hassan, Gokhan Anil, Brian Bartlett, Jimeng Sun", "id": "2412.12583v1", "paper_url": "http://arxiv.org/abs/2412.12583v1", "repo": "https://github.com/hanyin88/prm-clinic"}}