{"2407.18541": {"publish_time": "2024-07-26", "title": "Towards Improving NAM-to-Speech Synthesis Intelligibility using Self-Supervised Speech Models", "paper_summary": "We propose a novel approach to significantly improve the intelligibility in\nthe Non-Audible Murmur (NAM)-to-speech conversion task, leveraging\nself-supervision and sequence-to-sequence (Seq2Seq) learning techniques. Unlike\nconventional methods that explicitly record ground-truth speech, our\nmethodology relies on self-supervision and speech-to-speech synthesis to\nsimulate ground-truth speech. Despite utilizing simulated speech, our method\nsurpasses the current state-of-the-art (SOTA) by 29.08% improvement in the\nMel-Cepstral Distortion (MCD) metric. Additionally, we present error rates and\ndemonstrate our model's proficiency to synthesize speech in novel voices of\ninterest. Moreover, we present a methodology for augmenting the existing CSTR\nNAM TIMIT Plus corpus, setting a benchmark with a Word Error Rate (WER) of\n42.57% to gauge the intelligibility of the synthesized speech. Speech samples\ncan be found at https://nam2speech.github.io/NAM2Speech/", "paper_summary_zh": "我們提出了一種新穎的方法，可以顯著提高非可聽雜音 (NAM) 轉換為語音任務中的可懂度，利用自我監督和序列到序列 (Seq2Seq) 學習技術。與明確記錄真實語音的傳統方法不同，我們的技術依賴於自我監督和語音到語音合成來模擬真實語音。儘管使用模擬語音，我們的技術在 Mel-Cepstral Distortion (MCD) 指標中超越了現有的最先進 (SOTA) 技術，改進了 29.08%。此外，我們提供了錯誤率，並展示了我們的模型在合成新穎的目標語音方面的熟練度。此外，我們提出了一種擴充現有 CSTR NAM TIMIT Plus 語料庫的方法，並設定了詞語錯誤率 (WER) 為 42.57% 的基準，以評估合成語音的可懂度。可以在 https://nam2speech.github.io/NAM2Speech/ 找到語音範例", "author": "Neil Shah et.al.", "authors": "Neil Shah, Shirish Karande, Vineet Gandhi", "id": "2407.18541v1", "paper_url": "http://arxiv.org/abs/2407.18541v1", "repo": "null"}}