{"2406.03030": {"publish_time": "2024-06-05", "title": "From Tarzan to Tolkien: Controlling the Language Proficiency Level of LLMs for Content Generation", "paper_summary": "We study the problem of controlling the difficulty level of text generated by\nLarge Language Models (LLMs) for contexts where end-users are not fully\nproficient, such as language learners. Using a novel framework, we evaluate the\neffectiveness of several key approaches for this task, including few-shot\nprompting, supervised finetuning, and reinforcement learning (RL), utilising\nboth GPT-4 and open source alternatives like LLama2-7B and Mistral-7B.\n  Our findings reveal a large performance gap between GPT-4 and the open source\nmodels when using prompt-based strategies. However, we show how to bridge this\ngap with a careful combination of finetuning and RL alignment. Our best model,\nCALM (CEFR-Aligned Language Model), surpasses the performance of GPT-4 and\nother strategies, at only a fraction of the cost. We further validate the\nquality of our results through a small-scale human study.", "paper_summary_zh": "我們研究控制大型語言模型 (LLM) 所產生文字難度等級的問題，適用於最終使用者能力不足的環境，例如語言學習者。我們使用一個新架構，評估幾種關鍵方法的有效性，包括少樣本提示、監督微調和強化學習 (RL)，同時使用 GPT-4 和 LLama2-7B 和 Mistral-7B 等開源替代方案。\n我們的研究結果顯示，在使用基於提示的策略時，GPT-4 和開源模型之間存在很大的效能差距。然而，我們展示如何透過微調和 RL 對齊的仔細組合來縮小這個差距。我們最好的模型 CALM（CEFR 對齊語言模型）超越了 GPT-4 和其他策略的效能，而且成本僅為一小部分。我們進一步透過小規模的人類研究驗證了我們結果的品質。", "author": "Ali Malik et.al.", "authors": "Ali Malik, Stephen Mayhew, Chris Piech, Klinton Bicknell", "id": "2406.03030v1", "paper_url": "http://arxiv.org/abs/2406.03030v1", "repo": "null"}}