{"2411.19930": {"publish_time": "2024-11-29", "title": "On Domain-Specific Post-Training for Multimodal Large Language Models", "paper_summary": "Recent years have witnessed the rapid development of general multimodal large\nlanguage models (MLLMs). However, adapting general MLLMs to specific domains,\nsuch as scientific fields and industrial applications, remains less explored.\nThis paper systematically investigates domain adaptation of MLLMs through\npost-training, focusing on data synthesis, training pipelines, and task\nevaluation. (1) Data Synthesis: Using open-source models, we develop a visual\ninstruction synthesizer that effectively generates diverse visual instruction\ntasks from domain-specific image-caption pairs. Our synthetic tasks surpass\nthose generated by manual rules, GPT-4, and GPT-4V in enhancing the\ndomain-specific performance of MLLMs. (2) Training Pipeline: While the\ntwo-stage training--initially on image-caption pairs followed by visual\ninstruction tasks--is commonly adopted for developing general MLLMs, we apply a\nsingle-stage training pipeline to enhance task diversity for domain-specific\npost-training. (3) Task Evaluation: We conduct experiments in two domains,\nbiomedicine and food, by post-training MLLMs of different sources and scales\n(e.g., Qwen2-VL-2B, LLaVA-v1.6-8B, Llama-3.2-11B), and then evaluating MLLM\nperformance on various domain-specific tasks. To support further research in\nMLLM domain adaptation, we will open-source our implementations.", "paper_summary_zh": "近年來，一般多模態大型語言模型 (MLLM) 的發展十分迅速。然而，將一般 MLLM 適應到特定領域（例如科學領域和產業應用）的研究仍較少。本文透過後訓練系統性地探討 MLLM 的領域適應，重點放在資料合成、訓練管線和任務評估上。(1) 資料合成：我們使用開源模型，開發出一個視覺指令合成器，可有效地從特定領域的影像標題對中產生多樣的視覺指令任務。我們的合成任務超越了手動規則、GPT-4 和 GPT-4V 所產生的任務，以增強 MLLM 的特定領域效能。(2) 訓練管線：雖然兩階段訓練（最初在影像標題對上進行，然後在視覺指令任務上進行）通常用於開發一般 MLLM，但我們採用單階段訓練管線來增強特定領域後訓練的任務多樣性。(3) 任務評估：我們在生物醫學和食品這兩個領域進行實驗，透過後訓練不同來源和規模的 MLLM（例如 Qwen2-VL-2B、LLaVA-v1.6-8B、Llama-3.2-11B），然後評估 MLLM 在各種特定領域任務上的效能。為了支持 MLLM 領域適應的後續研究，我們將開放我們的實作原始碼。", "author": "Daixuan Cheng et.al.", "authors": "Daixuan Cheng, Shaohan Huang, Ziyu Zhu, Xintong Zhang, Wayne Xin Zhao, Zhongzhi Luan, Bo Dai, Zhenliang Zhang", "id": "2411.19930v1", "paper_url": "http://arxiv.org/abs/2411.19930v1", "repo": "null"}}