{"2501.18356": {"publish_time": "2025-01-30", "title": "State Stream Transformer (SST) : Emergent Metacognitive Behaviours Through Latent State Persistence", "paper_summary": "We introduce the State Stream Transformer (SST), a novel LLM architecture\nthat reveals emergent reasoning behaviours and capabilities latent in\npretrained weights through addressing a fundamental limitation in traditional\ntransformer models: the lack of latent computational continuity across\nautoregressive generations in the state space. SST introduces a sliding window\nlatent state (FFN) cache with weighted decay that maintains and evolves\npersistent latent processes throughout autoregressive generations. Through\ncontrolled experiments comparing base and SST architectures using the same\nfrozen weights, we demonstrate that this architectural modification alone\nenables enhanced reasoning capabilities which appear best explained by some\nform of potential higher-order processing, as evidenced by emergent\nmetacognitive behaviours. These behaviours persist under controlled conditions\ndesigned to eliminate confounding factors such as stochastic variation or\nlearned response patterns. Analysis of latent state distributions and\nprocessing dynamics provides evidence that it is solely the 'state stream' that\nis responsible for these phenomena. In quantitative evaluations, the SST\nachieves substantial performance improvements over the base model on two\nreasoning benchmarks, reaching 89.01\\% accuracy on GSM-8K (0-shot) and 91.04\\%\non ARC Challenge (0-shot CoT). These findings indicate that persistent\ncomputation in the latent state space enables fundamentally different\ninformation processing and internal reasoning strategies, with implications for\nour understanding of artificial intelligence systems.", "paper_summary_zh": "我們引入了狀態串流轉換器 (SST)，一種新穎的 LLM 架構，它透過解決傳統轉換器模型中的根本限制，揭示了預訓練權重中潛在的推理行為和能力：狀態空間中自迴歸生成缺乏潛在的計算連續性。SST 引入了具有加權衰減的滑動視窗潛在狀態 (FFN) 快取，可在整個自迴歸生成中維護和演化持久的潛在過程。透過使用相同凍結權重的受控實驗比較基礎和 SST 架構，我們證明了僅此架構修改就能增強推理能力，而這種能力最能透過某種形式的潛在高階處理來解釋，正如新興的元認知行為所證明的那樣。這些行為在受控條件下持續存在，這些條件旨在消除混雜因素，例如隨機變異或學習的反應模式。對潛在狀態分佈和處理動態的分析提供了證據，證明僅「狀態串流」對這些現象負責。在量化評估中，SST 在兩個推理基準上實現了比基礎模型大幅提升的效能，在 GSM-8K（0 次學習）上達到 89.01% 的準確度，在 ARC 挑戰（0 次學習 CoT）上達到 91.04%。這些發現表明，潛在狀態空間中的持續計算能實現根本不同的資訊處理和內部推理策略，對我們理解人工智慧系統具有影響。", "author": "Thea Aviss et.al.", "authors": "Thea Aviss", "id": "2501.18356v1", "paper_url": "http://arxiv.org/abs/2501.18356v1", "repo": "null"}}