{"2405.14333": {"publish_time": "2024-05-23", "title": "DeepSeek-Prover: Advancing Theorem Proving in LLMs through Large-Scale Synthetic Data", "paper_summary": "Proof assistants like Lean have revolutionized mathematical proof\nverification, ensuring high accuracy and reliability. Although large language\nmodels (LLMs) show promise in mathematical reasoning, their advancement in\nformal theorem proving is hindered by a lack of training data. To address this\nissue, we introduce an approach to generate extensive Lean 4 proof data derived\nfrom high-school and undergraduate-level mathematical competition problems.\nThis approach involves translating natural language problems into formal\nstatements, filtering out low-quality statements, and generating proofs to\ncreate synthetic data. After fine-tuning the DeepSeekMath 7B model on this\nsynthetic dataset, which comprises 8 million formal statements with proofs, our\nmodel achieved whole-proof generation accuracies of 46.3% with 64 samples and\n52% cumulatively on the Lean 4 miniF2F test, surpassing the baseline GPT-4 at\n23.0% with 64 samples and a tree search reinforcement learning method at 41.0%.\nAdditionally, our model successfully proved 5 out of 148 problems in the Lean 4\nFormalized International Mathematical Olympiad (FIMO) benchmark, while GPT-4\nfailed to prove any. These results demonstrate the potential of leveraging\nlarge-scale synthetic data to enhance theorem-proving capabilities in LLMs.\nBoth the synthetic dataset and the model will be made available to facilitate\nfurther research in this promising field.", "paper_summary_zh": "<paragraph>像 Lean 這樣的證明助理已經徹底改變數學證明驗證，確保高度準確性和可靠性。儘管大型語言模型 (LLM) 在數學推理方面表現出潛力，但它們在形式化定理證明方面的進展受到訓練資料不足的阻礙。為了解決這個問題，我們提出了一種方法來產生大量的 Lean 4 證明資料，這些資料來自高中和大學程度的數學競賽題目。此方法包括將自然語言題目轉換為形式化陳述、篩選出低品質陳述，以及產生證明以建立合成資料。在這個包含 800 萬個帶有證明之形式化陳述的合成資料集上微調 DeepSeekMath 7B 模型後，我們的模型在 Lean 4 miniF2F 測試中以 64 個樣本獲得 46.3% 的完整證明產生準確度，累計 52%，超越了在 64 個樣本中準確度為 23.0% 的基準 GPT-4，以及準確度為 41.0% 的樹狀搜尋強化學習方法。此外，我們的模型在 Lean 4 Formalized International Mathematical Olympiad (FIMO) 基準測試中成功證明了 148 個題目中的 5 個，而 GPT-4 則未能證明任何題目。這些結果證明了利用大規模合成資料來增強 LLM 中定理證明能力的潛力。合成資料集和模型都將提供出來，以利於這個有前途的領域的進一步研究。</paragraph>", "author": "Huajian Xin et.al.", "authors": "Huajian Xin, Daya Guo, Zhihong Shao, Zhizhou Ren, Qihao Zhu, Bo Liu, Chong Ruan, Wenda Li, Xiaodan Liang", "id": "2405.14333v1", "paper_url": "http://arxiv.org/abs/2405.14333v1", "repo": "null"}}