{"2411.08708": {"publish_time": "2024-11-13", "title": "Are Triggers Needed for Document-Level Event Extraction?", "paper_summary": "Most existing work on event extraction has focused on sentence-level texts\nand presumes the identification of a trigger-span -- a word or phrase in the\ninput that evokes the occurrence of an event of interest. Event arguments are\nthen extracted with respect to the trigger. Indeed, triggers are treated as\nintegral to, and trigger detection as an essential component of, event\nextraction. In this paper, we provide the first investigation of the role of\ntriggers for the more difficult and much less studied task of document-level\nevent extraction. We analyze their usefulness in multiple end-to-end and\npipelined neural event extraction models for three document-level event\nextraction datasets, measuring performance using triggers of varying quality\n(human-annotated, LLM-generated, keyword-based, and random). Our research shows\nthat trigger effectiveness varies based on the extraction task's\ncharacteristics and data quality, with basic, automatically-generated triggers\nserving as a viable alternative to human-annotated ones. Furthermore, providing\ndetailed event descriptions to the extraction model helps maintain robust\nperformance even when trigger quality degrades. Perhaps surprisingly, we also\nfind that the mere existence of trigger input, even random ones, is important\nfor prompt-based LLM approaches to the task.", "paper_summary_zh": "現有關於事件抽取的大多數研究都集中在句子層級的文本，並假設識別觸發範圍——輸入中的一個字詞或詞組，它會引發感興趣事件的發生。然後根據觸發器抽取事件參數。事實上，觸發器被視為事件抽取的組成部分，觸發器檢測被視為事件抽取的必要組成部分。在本文中，我們首次探討觸發器在更困難且鮮少研究的文件層級事件抽取任務中的作用。我們分析了它們在三個文件層級事件抽取資料集的多個端對端和管道式神經事件抽取模型中的效用，使用不同品質的觸發器（人工標註、LLM 生成、基於關鍵字和隨機）來衡量效能。我們的研究表明，觸發器效能會根據抽取任務的特徵和資料品質而有所不同，基本、自動生成的觸發器可用於替代人工標註的觸發器。此外，向抽取模型提供詳細的事件描述有助於在觸發器品質下降時維持穩健的效能。令人驚訝的是，我們還發現，觸發器輸入的存在，即使是隨機的，對於基於提示的 LLM 處理任務的方法也很重要。", "author": "Shaden Shaar et.al.", "authors": "Shaden Shaar, Wayne Chen, Maitreyi Chatterjee, Barry Wang, Wenting Zhao, Claire Cardie", "id": "2411.08708v1", "paper_url": "http://arxiv.org/abs/2411.08708v1", "repo": "null"}}