{"2411.05479": {"publish_time": "2024-11-08", "title": "EUREKHA: Enhancing User Representation for Key Hackers Identification in Underground Forums", "paper_summary": "Underground forums serve as hubs for cybercriminal activities, offering a\nspace for anonymity and evasion of conventional online oversight. In these\nhidden communities, malicious actors collaborate to exchange illicit knowledge,\ntools, and tactics, driving a range of cyber threats from hacking techniques to\nthe sale of stolen data, malware, and zero-day exploits. Identifying the key\ninstigators (i.e., key hackers), behind these operations is essential but\nremains a complex challenge. This paper presents a novel method called EUREKHA\n(Enhancing User Representation for Key Hacker Identification in Underground\nForums), designed to identify these key hackers by modeling each user as a\ntextual sequence. This sequence is processed through a large language model\n(LLM) for domain-specific adaptation, with LLMs acting as feature extractors.\nThese extracted features are then fed into a Graph Neural Network (GNN) to\nmodel user structural relationships, significantly improving identification\naccuracy. Furthermore, we employ BERTopic (Bidirectional Encoder\nRepresentations from Transformers Topic Modeling) to extract personalized\ntopics from user-generated content, enabling multiple textual representations\nper user and optimizing the selection of the most representative sequence. Our\nstudy demonstrates that fine-tuned LLMs outperform state-of-the-art methods in\nidentifying key hackers. Additionally, when combined with GNNs, our model\nachieves significant improvements, resulting in approximately 6% and 10%\nincreases in accuracy and F1-score, respectively, over existing methods.\nEUREKHA was tested on the Hack-Forums dataset, and we provide open-source\naccess to our code.", "paper_summary_zh": "<paragraph>地下論壇是網路犯罪活動的樞紐，提供匿名和規避傳統網路監督的空間。在這些隱藏的社群中，惡意行為者合作交換非法知識、工具和策略，推動從駭客技術到銷售竊取資料、惡意軟體和零時差漏洞的各種網路威脅。找出這些行動背後的關鍵煽動者（即關鍵駭客）至關重要，但仍然是一個複雜的挑戰。本文提出了一種稱為 EUREKHA（增強使用者表徵以識別地下論壇中的關鍵駭客）的新方法，旨在透過將每個使用者建模為文字序列來識別這些關鍵駭客。此序列透過大型語言模型（LLM）處理以進行特定領域的適應，其中 LLM 作為特徵萃取器。然後將這些萃取的特徵輸入圖神經網路（GNN）以建模使用者結構關係，大幅提升識別準確度。此外，我們採用 BERTopic（來自 Transformer 主題建模的雙向編碼器表徵）從使用者產生的內容中萃取個人化主題，為每個使用者啟用多個文字表徵，並最佳化最具代表性序列的選擇。我們的研究表明，微調後的 LLM 在識別關鍵駭客方面優於最先進的方法。此外，當與 GNN 結合使用時，我們的模型獲得顯著的提升，與現有方法相比，準確度和 F1 分數分別提高了約 6% 和 10%。EUREKHA 已在 Hack-Forums 資料集上進行測試，我們提供開源方式存取我們的程式碼。</paragraph>", "author": "Abdoul Nasser Hassane Amadou et.al.", "authors": "Abdoul Nasser Hassane Amadou, Anas Motii, Saida Elouardi, EL Houcine Bergou", "id": "2411.05479v1", "paper_url": "http://arxiv.org/abs/2411.05479v1", "repo": "https://github.com/jumbo110/eurekha"}}