{"2412.02114": {"publish_time": "2024-12-03", "title": "OmniCreator: Self-Supervised Unified Generation with Universal Editing", "paper_summary": "We introduce OmniCreator, a novel framework that can conduct text-prompted\nunified (image+video) generation as well as editing all in one place.\nOmniCreator acquires generative and universal editing capabilities in a\nself-supervised manner, taking original text-video pairs as conditions while\nutilizing the same video as a denoising target to learn the semantic\ncorrespondence between video and text. During inference, when presented with a\ntext prompt and a video, OmniCreator is capable of generating a target that is\nfaithful to both, achieving a universal editing effect that is unconstrained as\nopposed to existing editing work that primarily focuses on certain editing\ntypes or relies on additional controls (e.g., structural conditions, attention\nfeatures, or DDIM inversion). On the other hand, when presented with a text\nprompt only, OmniCreator becomes generative, producing high-quality video as a\nresult of the semantic correspondence learned. Importantly, we found that the\nsame capabilities extend to images as is, making OmniCreator a truly unified\nframework. Further, due to the lack of existing generative video editing\nbenchmarks, we introduce the OmniBench-99 dataset, designed to evaluate the\nperformance of generative video editing models comprehensively. Extensive\nexperiments demonstrate that OmniCreator exhibits substantial superiority over\nall other models.", "paper_summary_zh": "<paragraph>我們介紹 OmniCreator，一種新穎的框架，它可以在一個地方執行文字提示的統一（影像 + 影片）生成以及編輯。OmniCreator 以自監督的方式獲得生成和通用編輯功能，將原始文字影片對作為條件，同時利用相同的影片作為去噪目標，以學習影片和文字之間的語義對應。在推理期間，當提供文字提示和影片時，OmniCreator 能夠生成一個忠於兩者的目標，實現通用編輯效果，不受現有編輯工作的限制，而現有編輯工作主要集中在某些編輯類型或依賴額外的控制（例如結構條件、注意特徵或 DDIM 反演）。另一方面，當僅提供文字提示時，OmniCreator 會變得具有生成性，產生高品質的影片，這是因為學習到的語義對應。重要的是，我們發現相同的機能也延伸到影像，使 OmniCreator 成為一個真正的統一框架。此外，由於缺乏現有的生成影片編輯基準，我們引入了 OmniBench-99 資料集，旨在全面評估生成影片編輯模型的效能。廣泛的實驗證明，OmniCreator 在所有其他模型中表現出顯著的優越性。</paragraph>", "author": "Haodong Chen et.al.", "authors": "Haodong Chen, Lan Wang, Harry Yang, Ser-Nam Lim", "id": "2412.02114v1", "paper_url": "http://arxiv.org/abs/2412.02114v1", "repo": "null"}}