{"2406.17342": {"publish_time": "2024-06-25", "title": "Masked Generative Extractor for Synergistic Representation and 3D Generation of Point Clouds", "paper_summary": "In the field of 2D image generation modeling and representation learning,\nMasked Generative Encoder (MAGE) has demonstrated the synergistic potential\nbetween generative modeling and representation learning. Inspired by this, we\npropose Point-MAGE to extend this concept to point cloud data. Specifically,\nthis framework first utilizes a Vector Quantized Variational Autoencoder\n(VQVAE) to reconstruct a neural field representation of 3D shapes, thereby\nlearning discrete semantic features of point patches. Subsequently, by\ncombining the masking model with variable masking ratios, we achieve\nsynchronous training for both generation and representation learning.\nFurthermore, our framework seamlessly integrates with existing point cloud\nself-supervised learning (SSL) models, thereby enhancing their performance. We\nextensively evaluate the representation learning and generation capabilities of\nPoint-MAGE. In shape classification tasks, Point-MAGE achieved an accuracy of\n94.2% on the ModelNet40 dataset and 92.9% (+1.3%) on the ScanObjectNN dataset.\nAdditionally, it achieved new state-of-the-art performance in few-shot learning\nand part segmentation tasks. Experimental results also confirmed that\nPoint-MAGE can generate detailed and high-quality 3D shapes in both\nunconditional and conditional settings.", "paper_summary_zh": "在 2D 影像生成建模和表徵學習領域中，\n遮罩生成編碼器 (MAGE) 已證明生成建模和表徵學習之間的協同潛力。受此啟發，我們\n提出點 MAGE 將此概念延伸至點雲資料。具體來說，\n此框架首先利用向量量化變分自編碼器 (VQVAE) 來重建 3D 形狀的神經場表徵，從而\n學習點狀圖案的離散語義特徵。隨後，通過將遮罩模型與可變遮罩比率結合，我們實現\n同時訓練生成和表徵學習。此外，我們的框架與現有的點雲\n自我監督學習 (SSL) 模型無縫整合，從而增強其效能。我們\n廣泛評估了點 MAGE 的表徵學習和生成能力。在形狀分類任務中，點 MAGE 在 ModelNet40 資料集上達到了\n94.2% 的準確度，在 ScanObjectNN 資料集上達到了 92.9%（+1.3%）。\n此外，它在小樣本學習和部分分割任務中達到了新的最先進效能。實驗結果也證實了\n點 MAGE 能在無條件和有條件設定下生成詳細且高品質的 3D 形狀。", "author": "Hongliang Zeng et.al.", "authors": "Hongliang Zeng, Ping Zhang, Fang Li, Jiahua Wang, Tingyu Ye, Pengteng Guo", "id": "2406.17342v1", "paper_url": "http://arxiv.org/abs/2406.17342v1", "repo": "null"}}