{"2412.17637": {"publish_time": "2024-12-23", "title": "SCBench: A Sports Commentary Benchmark for Video LLMs", "paper_summary": "Recently, significant advances have been made in Video Large Language Models\n(Video LLMs) in both academia and industry. However, methods to evaluate and\nbenchmark the performance of different Video LLMs, especially their\nfine-grained, temporal visual capabilities, remain very limited. On one hand,\ncurrent benchmarks use relatively simple videos (e.g., subtitled movie clips)\nwhere the model can understand the entire video by processing just a few\nframes. On the other hand, their datasets lack diversity in task format,\ncomprising only QA or multi-choice QA, which overlooks the models' capacity for\ngenerating in-depth and precise texts. Sports videos, which feature intricate\nvisual information, sequential events, and emotionally charged commentary,\npresent a critical challenge for Video LLMs, making sports commentary an ideal\nbenchmarking task. Inspired by these challenges, we propose a novel task:\nsports video commentary generation, developed $\\textbf{SCBench}$ for Video\nLLMs. To construct such a benchmark, we introduce (1) $\\textbf{SCORES}$, a\nsix-dimensional metric specifically designed for our task, upon which we\npropose a GPT-based evaluation method, and (2) $\\textbf{CommentarySet}$, a\ndataset consisting of 5,775 annotated video clips and ground-truth labels\ntailored to our metric. Based on SCBench, we conduct comprehensive evaluations\non multiple Video LLMs (e.g. VILA, Video-LLaVA, etc.) and chain-of-thought\nbaseline methods. Our results found that InternVL-Chat-2 achieves the best\nperformance with 5.44, surpassing the second-best by 1.04. Our work provides a\nfresh perspective for future research, aiming to enhance models' overall\ncapabilities in complex visual understanding tasks. Our dataset will be\nreleased soon.", "paper_summary_zh": "<paragraph>最近，在学术界和产业界中，视频大语言模型（Video LLM）取得了重大进展。然而，评估和比较不同视频 LLM 性能的方法，尤其是它们细粒度的时序视觉能力，仍然非常有限。一方面，当前的基准使用相对简单的视频（例如，带字幕的电影剪辑），其中模型可以通过处理少数帧来理解整个视频。另一方面，它们的数据集缺乏任务格式的多样性，仅包括问答或多项选择问答，这忽略了模型生成深入且精确文本的能力。体育视频具有复杂的可视信息、顺序事件和充满情感的评论，这对视频 LLM 来说是一个严峻的挑战，使得体育评论成为一个理想的基准任务。受这些挑战的启发，我们提出了一项新任务：体育视频评论生成，为视频 LLM 开发了 $\\textbf{SCBench}$。为了构建这样一个基准，我们引入了 (1) $\\textbf{SCORES}$，一个专门为我们的任务设计的六维指标，在此基础上我们提出了一种基于 GPT 的评估方法，以及 (2) $\\textbf{CommentarySet}$，一个由 5,775 个带注释的视频剪辑和针对我们的指标定制的地面实况标签组成的数据集。基于 SCBench，我们对多个视频 LLM（例如 VILA、Video-LLaVA 等）和思维链基线方法进行了综合评估。我们的结果发现 InternVL-Chat-2 以 5.44 的成绩取得了最佳性能，比第二名高出 1.04。我们的工作为未来的研究提供了新的视角，旨在增强模型在复杂视觉理解任务中的整体能力。我们的数据集将很快发布。</paragraph>", "author": "Kuangzhi Ge et.al.", "authors": "Kuangzhi Ge, Lingjun Chen, Kevin Zhang, Yulin Luo, Tianyu Shi, Liaoyuan Fan, Xiang Li, Guanqun Wang, Shanghang Zhang", "id": "2412.17637v1", "paper_url": "http://arxiv.org/abs/2412.17637v1", "repo": "null"}}