{"2405.04097": {"publish_time": "2024-05-07", "title": "Unmasking Illusions: Understanding Human Perception of Audiovisual Deepfakes", "paper_summary": "The emergence of contemporary deepfakes has attracted significant attention\nin machine learning research, as artificial intelligence (AI) generated\nsynthetic media increases the incidence of misinterpretation and is difficult\nto distinguish from genuine content. Currently, machine learning techniques\nhave been extensively studied for automatically detecting deepfakes. However,\nhuman perception has been less explored. Malicious deepfakes could ultimately\ncause public and social problems. Can we humans correctly perceive the\nauthenticity of the content of the videos we watch? The answer is obviously\nuncertain; therefore, this paper aims to evaluate the human ability to discern\ndeepfake videos through a subjective study. We present our findings by\ncomparing human observers to five state-ofthe-art audiovisual deepfake\ndetection models. To this end, we used gamification concepts to provide 110\nparticipants (55 native English speakers and 55 non-native English speakers)\nwith a webbased platform where they could access a series of 40 videos (20 real\nand 20 fake) to determine their authenticity. Each participant performed the\nexperiment twice with the same 40 videos in different random orders. The videos\nare manually selected from the FakeAVCeleb dataset. We found that all AI models\nperformed better than humans when evaluated on the same 40 videos. The study\nalso reveals that while deception is not impossible, humans tend to\noverestimate their detection capabilities. Our experimental results may help\nbenchmark human versus machine performance, advance forensics analysis, and\nenable adaptive countermeasures.", "paper_summary_zh": "<paragraph>當代深度造假的出現，在機器學習研究中引起了極大的關注，因為人工智慧 (AI) 所生成的合成媒體增加了誤解的發生率，並且難以與真實內容區分。目前，機器學習技術已經被廣泛研究，用於自動檢測深度造假。然而，人類的感知卻較少被探索。惡意的深度造假最終可能造成公眾和社會問題。我們人類是否能正確感知我們觀看影片內容的真實性？答案顯然是不確定的；因此，本文旨在透過主觀研究評估人類辨別深度造假影片的能力。我們透過將人類觀察者與五種最先進的視聽深度造假檢測模型進行比較，來呈現我們的研究結果。為此，我們使用了遊戲化概念，為 110 位參與者（55 位英語母語人士和 55 位非英語母語人士）提供了一個網路平台，他們可以在該平台上存取一系列 40 個影片（20 個真實影片和 20 個假影片）以確定其真實性。每位參與者都使用相同的 40 個影片，以不同的隨機順序進行了兩次實驗。這些影片是從 FakeAVCeleb 資料集手動選取的。我們發現，在對相同的 40 個影片進行評估時，所有 AI 模型的表現都優於人類。研究還表明，雖然欺騙並非不可能，但人類傾向於高估他們的檢測能力。我們的實驗結果可能有助於比較人類與機器效能、推進法醫分析，並啟用適應性對策。</paragraph>", "author": "Ammarah Hashmi et.al.", "authors": "Ammarah Hashmi, Sahibzada Adil Shahzad, Chia-Wen Lin, Yu Tsao, Hsin-Min Wang", "id": "2405.04097v1", "paper_url": "http://arxiv.org/abs/2405.04097v1", "repo": "null"}}