{"2407.11573": {"publish_time": "2024-07-16", "title": "Probing the Efficacy of Federated Parameter-Efficient Fine-Tuning of Vision Transformers for Medical Image Classification", "paper_summary": "With the advent of large pre-trained transformer models, fine-tuning these\nmodels for various downstream tasks is a critical problem. Paucity of training\ndata, the existence of data silos, and stringent privacy constraints exacerbate\nthis fine-tuning problem in the medical imaging domain, creating a strong need\nfor algorithms that enable collaborative fine-tuning of pre-trained models.\nMoreover, the large size of these models necessitates the use of\nparameter-efficient fine-tuning (PEFT) to reduce the communication burden in\nfederated learning. In this work, we systematically investigate various\nfederated PEFT strategies for adapting a Vision Transformer (ViT) model\n(pre-trained on a large natural image dataset) for medical image\nclassification. Apart from evaluating known PEFT techniques, we introduce new\nfederated variants of PEFT algorithms such as visual prompt tuning (VPT),\nlow-rank decomposition of visual prompts, stochastic block attention\nfine-tuning, and hybrid PEFT methods like low-rank adaptation (LoRA)+VPT.\nMoreover, we perform a thorough empirical analysis to identify the optimal PEFT\nmethod for the federated setting and understand the impact of data distribution\non federated PEFT, especially for out-of-domain (OOD) and non-IID data. The key\ninsight of this study is that while most federated PEFT methods work well for\nin-domain transfer, there is a substantial accuracy vs. efficiency trade-off\nwhen dealing with OOD and non-IID scenarios, which is commonly the case in\nmedical imaging. Specifically, every order of magnitude reduction in\nfine-tuned/exchanged parameters can lead to a 4% drop in accuracy. Thus, the\ninitial model choice is crucial for federated PEFT. It is preferable to use\nmedical foundation models learned from in-domain medical image data (if\navailable) rather than general vision models.", "paper_summary_zh": "<paragraph>隨著大型預訓練轉換器模型的出現，針對各種下游任務微調這些模型是一個關鍵問題。訓練資料的稀缺性、資料孤島的存在以及嚴格的隱私限制會加劇醫療影像領域中的微調問題，這對能讓預訓練模型進行協作微調的演算法產生了強烈需求。此外，這些模型的龐大規模需要使用參數有效微調 (PEFT) 來降低聯合學習中的通訊負擔。在這項工作中，我們系統性地探討了各種聯合 PEFT 策略，以調整視覺轉換器 (ViT) 模型（在大型自然影像資料集上預先訓練）以進行醫療影像分類。除了評估已知的 PEFT 技術外，我們還引入了 PEFT 演算法的新聯合變體，例如視覺提示調整 (VPT)、視覺提示的低秩分解、隨機區塊注意力微調，以及低秩適應 (LoRA)+VPT 等混合 PEFT 方法。此外，我們進行了徹底的經驗分析，以找出聯合設定的最佳 PEFT 方法，並了解資料分佈對聯合 PEFT 的影響，特別是對於領域外 (OOD) 和非獨立同分佈 (non-IID) 資料。這項研究的主要見解是，儘管大多數聯合 PEFT 方法都適用於領域內轉移，但在處理 OOD 和非獨立同分佈場景時，會有大幅的準確度與效率折衷，這通常是醫療影像中的情況。具體來說，微調/交換參數的每個數量級減少都可能導致準確度下降 4%。因此，初始模型的選擇對於聯合 PEFT 至關重要。最好使用從領域內醫學影像資料（如果有的話）學習的醫學基礎模型，而不是一般視覺模型。</paragraph>", "author": "Naif Alkhunaizi et.al.", "authors": "Naif Alkhunaizi, Faris Almalik, Rouqaiah Al-Refai, Muzammal Naseer, Karthik Nandakumar", "id": "2407.11573v1", "paper_url": "http://arxiv.org/abs/2407.11573v1", "repo": "null"}}