{"2407.16470": {"publish_time": "2024-07-23", "title": "Machine Translation Hallucination Detection for Low and High Resource Languages using Large Language Models", "paper_summary": "Recent advancements in massively multilingual machine translation systems\nhave significantly enhanced translation accuracy; however, even the best\nperforming systems still generate hallucinations, severely impacting user\ntrust. Detecting hallucinations in Machine Translation (MT) remains a critical\nchallenge, particularly since existing methods excel with High-Resource\nLanguages (HRLs) but exhibit substantial limitations when applied to\nLow-Resource Languages (LRLs). This paper evaluates hallucination detection\napproaches using Large Language Models (LLMs) and semantic similarity within\nmassively multilingual embeddings. Our study spans 16 language directions,\ncovering HRLs, LRLs, with diverse scripts. We find that the choice of model is\nessential for performance. On average, for HRLs, Llama3-70B outperforms the\nprevious state of the art by as much as 0.16 MCC (Matthews Correlation\nCoefficient). However, for LRLs we observe that Claude Sonnet outperforms other\nLLMs on average by 0.03 MCC. The key takeaway from our study is that LLMs can\nachieve performance comparable or even better than previously proposed models,\ndespite not being explicitly trained for any machine translation task. However,\ntheir advantage is less significant for LRLs.", "paper_summary_zh": "<paragraph>大型多語言機器翻譯系統的最新進展已大幅提升翻譯的準確性；然而，即使是效能最佳的系統仍會產生幻覺，嚴重影響使用者的信任。在機器翻譯 (MT) 中偵測幻覺仍然是一項重大的挑戰，特別是因為現有的方法在高資源語言 (HRL) 中表現出色，但應用在低資源語言 (LRL) 時卻有很大的限制。本文評估使用大型語言模型 (LLM) 和大量多語言嵌入中的語義相似性來進行幻覺偵測的方法。我們的研究涵蓋 16 種語言方向，包括使用不同文字系統的 HRL 和 LRL。我們發現模型的選擇對於效能至關重要。平均而言，對於 HRL，Llama3-70B 的表現優於先前的技術水準，馬修斯相關係數 (MCC) 提高了 0.16。然而，對於 LRL，我們觀察到 Claude Sonnet 的表現平均優於其他 LLM，MCC 提高了 0.03。我們研究的關鍵結論是，儘管 LLM 並未針對任何機器翻譯任務進行明確訓練，但它們仍能達到與先前提出的模型相當甚至更好的效能。然而，它們在 LRL 的優勢較不顯著。</paragraph>", "author": "Kenza Benkirane et.al.", "authors": "Kenza Benkirane, Laura Gongas, Shahar Pelles, Naomi Fuchs, Joshua Darmon, Pontus Stenetorp, David Ifeoluwa Adelani, Eduardo Sanchez", "id": "2407.16470v1", "paper_url": "http://arxiv.org/abs/2407.16470v1", "repo": "null"}}