{"2405.20320": {"publish_time": "2024-05-30", "title": "Improving the Training of Rectified Flows", "paper_summary": "Diffusion models have shown great promise for image and video generation, but\nsampling from state-of-the-art models requires expensive numerical integration\nof a generative ODE. One approach for tackling this problem is rectified flows,\nwhich iteratively learn smooth ODE paths that are less susceptible to\ntruncation error. However, rectified flows still require a relatively large\nnumber of function evaluations (NFEs). In this work, we propose improved\ntechniques for training rectified flows, allowing them to compete with\nknowledge distillation methods even in the low NFE setting. Our main insight is\nthat under realistic settings, a single iteration of the Reflow algorithm for\ntraining rectified flows is sufficient to learn nearly straight trajectories;\nhence, the current practice of using multiple Reflow iterations is unnecessary.\nWe thus propose techniques to improve one-round training of rectified flows,\nincluding a U-shaped timestep distribution and LPIPS-Huber premetric. With\nthese techniques, we improve the FID of the previous 2-rectified flow by up to\n72% in the 1 NFE setting on CIFAR-10. On ImageNet 64$\\times$64, our improved\nrectified flow outperforms the state-of-the-art distillation methods such as\nconsistency distillation and progressive distillation in both one-step and\ntwo-step settings and rivals the performance of improved consistency training\n(iCT) in FID. Code is available at https://github.com/sangyun884/rfpp.", "paper_summary_zh": "擴散模型在影像和影片生成方面展現出極大的潛力，但從最先進的模型中進行取樣需要進行產生式 ODE 的昂貴數值積分。解決此問題的一種方法是修正流，它反覆學習較不容易受到截斷誤差影響的平滑 ODE 路徑。然而，修正流仍然需要相對大量的函數評估 (NFE)。在這項工作中，我們提出改進的修正流訓練技術，讓它們即使在低 NFE 設定下也能與知識萃取方法競爭。我們的見解在於，在現實的設定下，訓練修正流的 Reflow 演算法只需反覆運算一次就足以學習幾乎是直線的軌跡；因此，目前使用多重 Reflow 反覆運算的做法是不必要的。因此，我們提出改進修正流一輪訓練的技術，包括 U 形時間步長分佈和 LPIPS-Huber 前度量。有了這些技術，我們在 CIFAR-10 的 1 NFE 設定下，將先前 2 修正流的 FID 提升了 72%。在 ImageNet 64×64 上，我們改良的修正流在單步和兩步設定下都優於最先進的萃取方法，例如一致性萃取和漸進式萃取，並且在 FID 中與改良一致性訓練 (iCT) 的效能相匹敵。程式碼可在 https://github.com/sangyun884/rfpp 取得。", "author": "Sangyun Lee et.al.", "authors": "Sangyun Lee, Zinan Lin, Giulia Fanti", "id": "2405.20320v1", "paper_url": "http://arxiv.org/abs/2405.20320v1", "repo": "https://github.com/sangyun884/rfpp"}}