{"2408.07471": {"publish_time": "2024-08-14", "title": "Bridging and Modeling Correlations in Pairwise Data for Direct Preference Optimization", "paper_summary": "Direct preference optimization (DPO), a widely adopted offline preference\noptimization algorithm, aims to align large language models (LLMs) with\nhuman-desired behaviors using pairwise preference data. However, the winning\nresponse and the losing response within pairwise data are generated isolatedly,\nleading to weak correlations between them as well as suboptimal alignment\nperformance. To address this issue, we propose an effective framework named\nBMC, for bridging and modeling correlations in pairwise data. Firstly, we\nincrease the consistency and informativeness of the pairwise preference signals\nby targeted modifications, synthesizing a pseudo winning response through\nimproving the losing response based on the winning response. Secondly, we\nidentify that DPO alone is insufficient to model these correlations and capture\nnuanced variations. Therefore, we propose learning token-level correlations by\ndynamically leveraging the policy model's confidence during training.\nComprehensive experiments on QA, math, and instruction-following tasks\ndemonstrate the effectiveness of our approach, significantly surpassing\ncompetitive baselines, including DPO. Additionally, our in-depth quantitative\nanalysis reveals the reasons behind our method's superior performance over DPO\nand showcases its versatility to other DPO variants.", "paper_summary_zh": "直接偏好最佳化 (DPO) 是一種廣泛採用的離線偏好最佳化演算法，旨在利用成對偏好資料將大型語言模型 (LLM) 與人類想要的行為對齊。但是，成對資料中的獲勝回應和失敗回應是孤立產生的，導致它們之間產生微弱關聯，以及次佳對齊效能。為了解決這個問題，我們提出一個名為 BMC 的有效架構，用於橋接和建模成對資料中的關聯。首先，我們透過目標修改來增加成對偏好訊號的一致性和資訊性，透過根據獲勝回應改善失敗回應來合成一個偽獲勝回應。其次，我們發現單獨使用 DPO 不足以建模這些關聯並擷取細微變化。因此，我們提出透過在訓練期間動態利用策略模型的信心來學習代幣層級關聯。在問答、數學和遵循指示任務上的全面實驗證明了我們方法的有效性，顯著超越競爭基線，包括 DPO。此外，我們深入的量化分析揭示了我們的方法優於 DPO 的原因，並展示了它對其他 DPO 變體的多功能性。", "author": "Yuxin Jiang et.al.", "authors": "Yuxin Jiang, Bo Huang, Yufei Wang, Xingshan Zeng, Liangyou Li, Yasheng Wang, Xin Jiang, Lifeng Shang, Ruiming Tang, Wei Wang", "id": "2408.07471v1", "paper_url": "http://arxiv.org/abs/2408.07471v1", "repo": "null"}}