{"2405.02374": {"publish_time": "2024-05-03", "title": "Protein binding affinity prediction under multiple substitutions applying eGNNs on Residue and Atomic graphs combined with Language model information: eGRAL", "paper_summary": "Protein-protein interactions (PPIs) play a crucial role in numerous\nbiological processes. Developing methods that predict binding affinity changes\nunder substitution mutations is fundamental for modelling and re-engineering\nbiological systems. Deep learning is increasingly recognized as a powerful tool\ncapable of bridging the gap between in-silico predictions and in-vitro\nobservations. With this contribution, we propose eGRAL, a novel SE(3)\nequivariant graph neural network (eGNN) architecture designed for predicting\nbinding affinity changes from multiple amino acid substitutions in protein\ncomplexes. eGRAL leverages residue, atomic and evolutionary scales, thanks to\nfeatures extracted from protein large language models. To address the limited\navailability of large-scale affinity assays with structural information, we\ngenerate a simulated dataset comprising approximately 500,000 data points. Our\nmodel is pre-trained on this dataset, then fine-tuned and tested on\nexperimental data.", "paper_summary_zh": "蛋白-蛋白交互作用 (PPIs) 在許多生物過程中扮演關鍵角色。開發可預測取代突變下結合親和力變化的方法，對於建模和重新設計生物系統至關重要。深度學習逐漸被認為是一種強大的工具，能夠彌合電腦模擬預測和體外觀察之間的差距。透過這項貢獻，我們提出 eGRAL，一種新穎的 SE(3) 等變圖神經網路 (eGNN) 架構，專門設計用來預測蛋白質複合體中多個胺基酸取代的結合親和力變化。eGRAL 透過從蛋白質大型語言模型中萃取的特徵，善用殘基、原子和演化尺度。為了解決大規模親和力測定法與結構資訊可用性有限的問題，我們產生了一個模擬的資料集，包含大約 500,000 個資料點。我們的模型在這組資料集上進行預訓練，然後在實驗資料上微調和測試。", "author": "Arturo Fiorellini-Bernardis et.al.", "authors": "Arturo Fiorellini-Bernardis, Sebastien Boyer, Christoph Brunken, Bakary Diallo, Karim Beguir, Nicolas Lopez-Carranza, Oliver Bent", "id": "2405.02374v1", "paper_url": "http://arxiv.org/abs/2405.02374v1", "repo": "null"}}