{"2408.02923": {"publish_time": "2024-08-06", "title": "Intermediate direct preference optimization", "paper_summary": "We propose the intermediate direct preference optimization (DPO) method to\ncalculate the DPO loss at selected intermediate layers as an auxiliary loss for\nfinetuning large language models (LLMs). The conventional DPO method fine-tunes\na supervised fine-tuning (SFT) model by calculating the DPO loss using logits\nfrom the final layer. In our intermediate DPO approach, DPO losses are\ncalculated using the logits from K-selected intermediate layers and averaged to\nobtain the intermediate DPO loss. For training the intermediate DPO model, the\nfinal loss is obtained by calculating the weighted sum of the DPO and\nintermediate DPO losses. During inference, the intermediate DPO model decodes\nusing the final layer logits similarly to the conventional DPO model. In\nexperiments using the ultrafeedback dataset, the performance of the\nintermediate DPO model was evaluated using GPT-4. As a result, the intermediate\nDPO model trained using the intermediate DPO loss calculated at the 22nd layer\nof a 32-layer SFT model achieved win rates of 52.5% and 67.5% against the\nconventional DPO and SFT models, respectively, demonstrating the effectiveness\nof the proposed method. Furthermore, we report the relationships among the\nposition of the selected intermediate layers, the number of layers, and\nperformance.", "paper_summary_zh": "我們提出中間直接偏好最佳化 (DPO) 方法，以在選定的中間層計算 DPO 損失，作為微調大型語言模型 (LLM) 的輔助損失。傳統的 DPO 方法通過使用來自最終層的 logit 計算 DPO 損失，對監督微調 (SFT) 模型進行微調。在我們的中間 DPO 方法中，DPO 損失使用來自 K 個選定中間層的 logit 計算，並取平均值以獲得中間 DPO 損失。為了訓練中間 DPO 模型，最終損失是通過計算 DPO 和中間 DPO 損失的加權和來獲得的。在推理過程中，中間 DPO 模型使用最終層 logit 解碼，類似於傳統的 DPO 模型。在使用 ultrafeedback 資料集的實驗中，使用 GPT-4 評估了中間 DPO 模型的效能。結果，使用在 32 層 SFT 模型的第 22 層計算的中間 DPO 損失訓練的中間 DPO 模型，分別對傳統 DPO 和 SFT 模型達到了 52.5% 和 67.5% 的獲勝率，證明了所提出方法的有效性。此外，我們報告了選定的中間層的位置、層數和效能之間的關係。", "author": "Atsushi Kojima et.al.", "authors": "Atsushi Kojima", "id": "2408.02923v1", "paper_url": "http://arxiv.org/abs/2408.02923v1", "repo": "null"}}