{"2502.15005": {"publish_time": "2025-02-20", "title": "A Socratic RAG Approach to Connect Natural Language Queries on Research Topics with Knowledge Organization Systems", "paper_summary": "In this paper, we propose a Retrieval Augmented Generation (RAG) agent that\nmaps natural language queries about research topics to precise,\nmachine-interpretable semantic entities. Our approach combines RAG with\nSocratic dialogue to align a user's intuitive understanding of research topics\nwith established Knowledge Organization Systems (KOSs). The proposed approach\nwill effectively bridge \"little semantics\" (domain-specific KOS structures)\nwith \"big semantics\" (broad bibliometric repositories), making complex academic\ntaxonomies more accessible. Such agents have the potential for broad use. We\nillustrate with a sample application called CollabNext, which is a\nperson-centric knowledge graph connecting people, organizations, and research\ntopics. We further describe how the application design has an intentional focus\non HBCUs and emerging researchers to raise visibility of people historically\nrendered invisible in the current science system.", "paper_summary_zh": "在本文中，我們提出了一種檢索增強生成 (RAG) 代理，它將關於研究主題的自然語言查詢對應到精確的、機器可解譯的語義實體。我們的做法結合了 RAG 與蘇格拉底式對話，以將使用者對研究主題的直覺理解與已建立的知識組織系統 (KOS) 對齊。所提出的方法將有效地將「小語義」（特定領域的 KOS 結構）與「大語義」（廣泛的書目資料庫）聯繫起來，使複雜的學術分類法更容易理解。此類代理有廣泛應用的潛力。我們以一個名為 CollabNext 的範例應用程式來說明，它是一個以人為中心的知識圖譜，連接人、組織和研究主題。我們進一步描述應用程式的設計如何有意地關注 HBCU 和新興研究人員，以提高在當前科學體系中歷來被視為隱形的人們的能見度。", "author": "Lew Lefton et.al.", "authors": "Lew Lefton, Kexin Rong, Chinar Dankhara, Lila Ghemri, Firdous Kausar, A. Hannibal Hamdallahi", "id": "2502.15005v1", "paper_url": "http://arxiv.org/abs/2502.15005v1", "repo": "null"}}