{"2408.09773": {"publish_time": "2024-08-19", "title": "Are Large Language Models More Honest in Their Probabilistic or Verbalized Confidence?", "paper_summary": "Large language models (LLMs) have been found to produce hallucinations when\nthe question exceeds their internal knowledge boundaries. A reliable model\nshould have a clear perception of its knowledge boundaries, providing correct\nanswers within its scope and refusing to answer when it lacks knowledge.\nExisting research on LLMs' perception of their knowledge boundaries typically\nuses either the probability of the generated tokens or the verbalized\nconfidence as the model's confidence in its response. However, these studies\noverlook the differences and connections between the two. In this paper, we\nconduct a comprehensive analysis and comparison of LLMs' probabilistic\nperception and verbalized perception of their factual knowledge boundaries.\nFirst, we investigate the pros and cons of these two perceptions. Then, we\nstudy how they change under questions of varying frequencies. Finally, we\nmeasure the correlation between LLMs' probabilistic confidence and verbalized\nconfidence. Experimental results show that 1) LLMs' probabilistic perception is\ngenerally more accurate than verbalized perception but requires an in-domain\nvalidation set to adjust the confidence threshold. 2) Both perceptions perform\nbetter on less frequent questions. 3) It is challenging for LLMs to accurately\nexpress their internal confidence in natural language.", "paper_summary_zh": "大型語言模型 (LLM) 已被發現會在問題超出其內部知識界限時產生幻覺。可靠的模型應清楚了解其知識界限，在其範圍內提供正確答案，並在缺乏知識時拒絕回答。現有關於 LLM 對其知識界限的感知的研究通常使用生成詞彙的機率或口頭表達的信心作為模型對其回應的信心。然而，這些研究忽略了這兩者之間的差異和關聯。在本文中，我們對 LLM 對其事實知識界限的機率感知和口頭表達感知進行了全面的分析和比較。首先，我們探討這兩種感知的優缺點。然後，我們研究它們在不同頻率問題下的變化。最後，我們測量 LLM 的機率信心和口頭表達信心之間的相關性。實驗結果表明：1) LLM 的機率感知通常比口頭表達感知更準確，但需要一個領域內驗證集來調整信心閾值。2) 這兩種感知在頻率較低的問題上表現都較好。3) LLM 難以準確地用自然語言表達其內部信心。", "author": "Shiyu Ni et.al.", "authors": "Shiyu Ni, Keping Bi, Lulu Yu, Jiafeng Guo", "id": "2408.09773v1", "paper_url": "http://arxiv.org/abs/2408.09773v1", "repo": "null"}}