{"2411.16099": {"publish_time": "2024-11-25", "title": "An Empirical Study of Vulnerability Detection using Federated Learning", "paper_summary": "Although Deep Learning (DL) methods becoming increasingly popular in\nvulnerability detection, their performance is seriously limited by insufficient\ntraining data. This is mainly because few existing software organizations can\nmaintain a complete set of high-quality samples for DL-based vulnerability\ndetection. Due to the concerns about privacy leakage, most of them are\nreluctant to share data, resulting in the data silo problem. Since enables\ncollaboratively model training without data sharing, Federated Learning (FL)\nhas been investigated as a promising means of addressing the data silo problem\nin DL-based vulnerability detection. However, since existing FL-based\nvulnerability detection methods focus on specific applications, it is still far\nunclear i) how well FL adapts to common vulnerability detection tasks and ii)\nhow to design a high-performance FL solution for a specific vulnerability\ndetection task. To answer these two questions, this paper first proposes VulFL,\nan effective evaluation framework for FL-based vulnerability detection. Then,\nbased on VulFL, this paper conducts a comprehensive study to reveal the\nunderlying capabilities of FL in dealing with different types of CWEs,\nespecially when facing various data heterogeneity scenarios. Our experimental\nresults show that, compared to independent training, FL can significantly\nimprove the detection performance of common AI models on all investigated CWEs,\nthough the performance of FL-based vulnerability detection is limited by\nheterogeneous data. To highlight the performance differences between different\nFL solutions for vulnerability detection, we extensively investigate the\nimpacts of different configuration strategies for each framework component of\nVulFL. Our study sheds light on the potential of FL in vulnerability detection,\nwhich can be used to guide the design of FL-based solutions for vulnerability\ndetection.", "paper_summary_zh": "儘管深度學習 (DL) 方法在漏洞偵測方面日益普及，但其效能卻受到訓練資料不足的嚴重限制。這主要是因為現有的軟體組織很少能維護一組完整的優質樣本，以進行基於 DL 的漏洞偵測。由於擔心隱私外洩，他們大多不願意分享資料，導致資料孤島問題。由於聯合學習 (FL) 能夠在不共用資料的情況下進行協作模型訓練，因此已將其視為解決基於 DL 的漏洞偵測中資料孤島問題的一種有前途的方法。然而，由於現有的基於 FL 的漏洞偵測方法專注於特定應用程式，因此仍不清楚 i) FL 如何適應常見的漏洞偵測任務，以及 ii) 如何為特定漏洞偵測任務設計高性能的 FL 解決方案。為了回答這兩個問題，本文首先提出了 VulFL，一個用於基於 FL 的漏洞偵測的有效評估架構。然後，本文基於 VulFL 進行了一項全面研究，以揭示 FL 在處理不同類型的 CWE 時的潛在能力，特別是在面對各種資料異質性場景時。我們的實驗結果表明，與獨立訓練相比，FL 可以顯著提升所有調查的 CWE 上常見 AI 模型的偵測效能，儘管基於 FL 的漏洞偵測的效能受到異質性資料的限制。為了強調不同 FL 解決方案在漏洞偵測上的效能差異，我們廣泛探討了 VulFL 各個架構元件的不同配置策略的影響。我們的研究闡明了 FL 在漏洞偵測方面的潛力，可用於指導基於 FL 的漏洞偵測解決方案的設計。", "author": "Peiheng Zhou et.al.", "authors": "Peiheng Zhou, Ming Hu, Xingrun Quan, Yawen Peng, Xiaofei Xie, Yanxin Yang, Chengwei Liu, Yueming Wu, Mingsong Chen", "id": "2411.16099v1", "paper_url": "http://arxiv.org/abs/2411.16099v1", "repo": "null"}}