{"2409.18568": {"publish_time": "2024-09-27", "title": "Experimental Evaluation of Machine Learning Models for Goal-oriented Customer Service Chatbot with Pipeline Architecture", "paper_summary": "Integrating machine learning (ML) into customer service chatbots enhances\ntheir ability to understand and respond to user queries, ultimately improving\nservice performance. However, they may appear artificial to some users and\naffecting customer experience. Hence, meticulous evaluation of ML models for\neach pipeline component is crucial for optimizing performance, though\ndifferences in functionalities can lead to unfair comparisons. In this paper,\nwe present a tailored experimental evaluation approach for goal-oriented\ncustomer service chatbots with pipeline architecture, focusing on three key\ncomponents: Natural Language Understanding (NLU), dialogue management (DM), and\nNatural Language Generation (NLG). Our methodology emphasizes individual\nassessment to determine optimal ML models. Specifically, we focus on optimizing\nhyperparameters and evaluating candidate models for NLU (utilizing BERT and\nLSTM), DM (employing DQN and DDQN), and NLG (leveraging GPT-2 and DialoGPT).\nThe results show that for the NLU component, BERT excelled in intent detection\nwhereas LSTM was superior for slot filling. For the DM component, the DDQN\nmodel outperformed DQN by achieving fewer turns, higher rewards, as well as\ngreater success rates. For NLG, the large language model GPT-2 surpassed\nDialoGPT in BLEU, METEOR, and ROUGE metrics. These findings aim to provide a\nbenchmark for future research in developing and optimizing customer service\nchatbots, offering valuable insights into model performance and optimal\nhyperparameters.", "paper_summary_zh": "<paragraph>將機器學習 (ML) 整合到客服聊天機器人中，可增強其理解和回應使用者查詢的能力，進而提升服務效能。然而，它們在某些使用者眼中可能會顯得生硬，並影響客戶體驗。因此，仔細評估每個管道元件的 ML 模型對於最佳化效能至關重要，儘管功能上的差異可能會導致不公平的比較。在本文中，我們提出針對目標導向客服聊天機器人量身打造的實驗評估方法，著重於管道架構中的三個關鍵元件：自然語言理解 (NLU)、對話管理 (DM) 和自然語言生成 (NLG)。我們的評估方法強調個別評估，以找出最佳的 ML 模型。具體來說，我們專注於最佳化超參數，並評估 NLU (使用 BERT 和 LSTM)、DM (使用 DQN 和 DDQN) 和 NLG (使用 GPT-2 和 DialoGPT) 的候選模型。結果顯示，對於 NLU 元件，BERT 在意圖偵測方面表現出色，而 LSTM 則在槽位填補方面表現優異。對於 DM 元件，DDQN 模型的表現優於 DQN，能以更少的回合、更高的獎勵以及更高的成功率達成目標。對於 NLG，大型語言模型 GPT-2 在 BLEU、METEOR 和 ROUGE 指標方面都超越了 DialoGPT。這些發現旨在為未來開發和最佳化客服聊天機器人的研究提供基準，並提供關於模型效能和最佳超參數的寶貴見解。</paragraph>", "author": "Nurul Ain Nabilah Mohd Isa et.al.", "authors": "Nurul Ain Nabilah Mohd Isa, Siti Nuraishah Agos Jawaddi, Azlan Ismail", "id": "2409.18568v1", "paper_url": "http://arxiv.org/abs/2409.18568v1", "repo": "null"}}