{"2410.22662": {"publish_time": "2024-10-30", "title": "$\\textbf{EMOS}$: $\\textbf{E}$mbodiment-aware Heterogeneous $\\textbf{M}$ulti-robot $\\textbf{O}$perating $\\textbf{S}$ystem with LLM Agents", "paper_summary": "Heterogeneous multi-robot systems (HMRS) have emerged as a powerful approach\nfor tackling complex tasks that single robots cannot manage alone. Current\nlarge-language-model-based multi-agent systems (LLM-based MAS) have shown\nsuccess in areas like software development and operating systems, but applying\nthese systems to robot control presents unique challenges. In particular, the\ncapabilities of each agent in a multi-robot system are inherently tied to the\nphysical composition of the robots, rather than predefined roles. To address\nthis issue, we introduce a novel multi-agent framework designed to enable\neffective collaboration among heterogeneous robots with varying embodiments and\ncapabilities, along with a new benchmark named Habitat-MAS. One of our key\ndesigns is $\\textit{Robot Resume}$: Instead of adopting human-designed role\nplay, we propose a self-prompted approach, where agents comprehend robot URDF\nfiles and call robot kinematics tools to generate descriptions of their physics\ncapabilities to guide their behavior in task planning and action execution. The\nHabitat-MAS benchmark is designed to assess how a multi-agent framework handles\ntasks that require embodiment-aware reasoning, which includes 1) manipulation,\n2) perception, 3) navigation, and 4) comprehensive multi-floor object\nrearrangement. The experimental results indicate that the robot's resume and\nthe hierarchical design of our multi-agent system are essential for the\neffective operation of the heterogeneous multi-robot system within this\nintricate problem context.", "paper_summary_zh": "異質多機器人系統 (HMRS) 已成為一種強而有力的方法，用於解決單一機器人無法單獨管理的複雜任務。目前基於大型語言模型的多代理系統 (LLM-based MAS) 已在軟體開發和作業系統等領域展現成功，但將這些系統應用於機器人控制會產生獨特的挑戰。特別是，多機器人系統中每個代理的能力本質上與機器人的物理組成有關，而不是預定義的角色。為了解決這個問題，我們引入了一個新穎的多代理框架，旨在讓具有不同具體形式和能力的異質機器人之間能夠有效協作，並提供一個名為 Habitat-MAS 的新基準。我們的關鍵設計之一是「機器人履歷」：我們提出了一種自我提示的方法，而不是採用人類設計的角色扮演，代理會理解機器人 URDF 檔案，並呼叫機器人運動學工具來產生其物理能力的描述，以指導其在任務規劃和動作執行中的行為。Habitat-MAS 基準旨在評估多代理框架如何處理需要具體形式感知推理的任務，其中包括 1) 操作、2) 感知、3) 導航，以及 4) 全面的多樓層物件重新排列。實驗結果表明，機器人的履歷和我們多代理系統的階層式設計對於異質多機器人系統在這個複雜的問題背景下有效運作至關重要。", "author": "Junting Chen et.al.", "authors": "Junting Chen, Checheng Yu, Xunzhe Zhou, Tianqi Xu, Yao Mu, Mengkang Hu, Wenqi Shao, Yikai Wang, Guohao Li, Lin Shao", "id": "2410.22662v1", "paper_url": "http://arxiv.org/abs/2410.22662v1", "repo": "null"}}