{"2408.11330": {"publish_time": "2024-08-21", "title": "Design Principle Transfer in Neural Architecture Search via Large Language Models", "paper_summary": "Transferable neural architecture search (TNAS) has been introduced to design\nefficient neural architectures for multiple tasks, to enhance the practical\napplicability of NAS in real-world scenarios. In TNAS, architectural knowledge\naccumulated in previous search processes is reused to warm up the architecture\nsearch for new tasks. However, existing TNAS methods still search in an\nextensive search space, necessitating the evaluation of numerous architectures.\nTo overcome this challenge, this work proposes a novel transfer paradigm, i.e.,\ndesign principle transfer. In this work, the linguistic description of various\nstructural components' effects on architectural performance is termed design\nprinciples. They are learned from established architectures and then can be\nreused to reduce the search space by discarding unpromising architectures.\nSearching in the refined search space can boost both the search performance and\nefficiency for new NAS tasks. To this end, a large language model\n(LLM)-assisted design principle transfer (LAPT) framework is devised. In LAPT,\nLLM is applied to automatically reason the design principles from a set of\ngiven architectures, and then a principle adaptation method is applied to\nrefine these principles progressively based on the new search results.\nExperimental results show that LAPT can beat the state-of-the-art TNAS methods\non most tasks and achieve comparable performance on others.", "paper_summary_zh": "可轉移神經架構搜尋 (TNAS) 已被引入，用於設計適用於多項任務的高效神經架構，以增強 NAS 在真實世界場景中的實際可行性。在 TNAS 中，累積於先前搜尋程序中的架構知識被重新用於為新任務熱身架構搜尋。然而，現有的 TNAS 方法仍會在廣泛的搜尋空間中搜尋，需要評估大量的架構。為了解決這個挑戰，這項工作提出了一種新穎的轉移範例，即設計原則轉移。在這項工作中，各種結構元件對架構效能的影響的語言描述被稱為設計原則。它們從已建立的架構中學習，然後可以被重新用於透過捨棄無望的架構來減少搜尋空間。在經過優化的搜尋空間中搜尋可以提升新 NAS 任務的搜尋效能和效率。為此，設計了一個大型語言模型 (LLM) 輔助的設計原則轉移 (LAPT) 架構。在 LAPT 中，LLM 被應用於自動根據一組給定的架構推論設計原則，然後應用一個原則適應方法，根據新的搜尋結果逐步優化這些原則。實驗結果顯示，LAPT 可以擊敗大多數任務中的最先進 TNAS 方法，並在其他任務中達到相當的效能。", "author": "Xun Zhou et.al.", "authors": "Xun Zhou, Liang Feng, Xingyu Wu, Zhichao Lu, Kay Chen Tan", "id": "2408.11330v1", "paper_url": "http://arxiv.org/abs/2408.11330v1", "repo": "null"}}