{"2412.17483": {"publish_time": "2024-12-23", "title": "A Silver Bullet or a Compromise for Full Attention? A Comprehensive Study of Gist Token-based Context Compression", "paper_summary": "In this work, we provide a thorough investigation of gist-based context\ncompression methods to improve long-context processing in large language\nmodels. We focus on two key questions: (1) How well can these methods replace\nfull attention models? and (2) What potential failure patterns arise due to\ncompression? Through extensive experiments, we show that while gist-based\ncompression can achieve near-lossless performance on tasks like\nretrieval-augmented generation and long-document QA, it faces challenges in\ntasks like synthetic recall. Furthermore, we identify three key failure\npatterns: lost by the boundary, lost if surprise, and lost along the way. To\nmitigate these issues, we propose two effective strategies: fine-grained\nautoencoding, which enhances the reconstruction of original token information,\nand segment-wise token importance estimation, which adjusts optimization based\non token dependencies. Our work provides valuable insights into the\nunderstanding of gist token-based context compression and offers practical\nstrategies for improving compression capabilities.", "paper_summary_zh": "在本文中，我們對基於要點的語境壓縮方法進行了深入研究，以改善大型語言模型中的長語境處理。我們專注於兩個關鍵問題：(1) 這些方法在多大程度上可以取代完全注意模型？(2) 由於壓縮而產生的潛在失敗模式是什麼？通過廣泛的實驗，我們表明，儘管基於要點的壓縮可以在檢索增強生成和長文檔問答等任務上實現近乎無損的性能，但在合成召回等任務中面臨挑戰。此外，我們識別出三種關鍵的失敗模式：被邊界丟失、因驚喜而丟失以及在途中丟失。為了減輕這些問題，我們提出了兩種有效的策略：細粒度自動編碼，它增強了原始令牌信息的重建，以及分段令牌重要性估計，它根據令牌依賴關係調整優化。我們的研究為理解基於要點令牌的語境壓縮提供了寶貴的見解，並為改進壓縮能力提供了實用的策略。", "author": "Chenlong Deng et.al.", "authors": "Chenlong Deng, Zhisong Zhang, Kelong Mao, Shuaiyi Li, Xinting Huang, Dong Yu, Zhicheng Dou", "id": "2412.17483v1", "paper_url": "http://arxiv.org/abs/2412.17483v1", "repo": "null"}}