{"2409.11136": {"publish_time": "2024-09-17", "title": "Promptriever: Instruction-Trained Retrievers Can Be Prompted Like Language Models", "paper_summary": "Instruction-tuned language models (LM) are able to respond to imperative\ncommands, providing a more natural user interface compared to their base\ncounterparts. In this work, we present Promptriever, the first retrieval model\nable to be prompted like an LM. To train Promptriever, we curate and release a\nnew instance-level instruction training set from MS MARCO, spanning nearly 500k\ninstances. Promptriever not only achieves strong performance on standard\nretrieval tasks, but also follows instructions. We observe: (1) large gains\n(reaching SoTA) on following detailed relevance instructions (+14.3 p-MRR /\n+3.1 nDCG on FollowIR), (2) significantly increased robustness to lexical\nchoices/phrasing in the query+instruction (+12.9 Robustness@10 on InstructIR),\nand (3) the ability to perform hyperparameter search via prompting to reliably\nimprove retrieval performance (+1.4 average increase on BEIR). Promptriever\ndemonstrates that retrieval models can be controlled with prompts on a\nper-query basis, setting the stage for future work aligning LM prompting\ntechniques with information retrieval.", "paper_summary_zh": "指令調整語言模型 (LM) 能夠回應命令式指令，與其基礎對應物相比，提供了更自然的使用者介面。在這項工作中，我們展示了 Promptriever，第一個能夠像 LM 一樣提示的檢索模型。為了訓練 Promptriever，我們從 MS MARCO 整理並釋出一個新的實例層級指令訓練集，涵蓋了將近 50 萬個實例。Promptriever 不僅在標準檢索任務中獲得強勁的效能，還能遵循指令。我們觀察到：(1) 在遵循詳細相關性指令方面獲得大幅提升（達到 SoTA，在 FollowIR 上的 p-MRR 增加 +14.3 / nDCG 增加 +3.1），(2) 在查詢+指令中的字彙選擇/措辭方面大幅提升健壯性（在 InstructIR 上的 Robustness@10 增加 +12.9），以及 (3) 能夠透過提示執行超參數搜尋，以可靠地改善檢索效能（在 BEIR 上平均增加 +1.4）。Promptriever 證明了檢索模型可以用提示在每個查詢的基礎上進行控制，為未來的工作奠定了基礎，將 LM 提示技術與資訊檢索結合起來。", "author": "Orion Weller et.al.", "authors": "Orion Weller, Benjamin Van Durme, Dawn Lawrie, Ashwin Paranjape, Yuhao Zhang, Jack Hessel", "id": "2409.11136v1", "paper_url": "http://arxiv.org/abs/2409.11136v1", "repo": "https://github.com/orionw/promptriever"}}