{"2408.09656": {"publish_time": "2024-08-19", "title": "A Comparison of Large Language Model and Human Performance on Random Number Generation Tasks", "paper_summary": "Random Number Generation Tasks (RNGTs) are used in psychology for examining\nhow humans generate sequences devoid of predictable patterns. By adapting an\nexisting human RNGT for an LLM-compatible environment, this preliminary study\ntests whether ChatGPT-3.5, a large language model (LLM) trained on\nhuman-generated text, exhibits human-like cognitive biases when generating\nrandom number sequences. Initial findings indicate that ChatGPT-3.5 more\neffectively avoids repetitive and sequential patterns compared to humans, with\nnotably lower repeat frequencies and adjacent number frequencies. Continued\nresearch into different models, parameters, and prompting methodologies will\ndeepen our understanding of how LLMs can more closely mimic human random\ngeneration behaviors, while also broadening their applications in cognitive and\nbehavioral science research.", "paper_summary_zh": "隨機數字產生任務 (RNGT) 用於心理學中，用於檢驗人類如何產生沒有可預測模式的序列。透過將現有的 RNGT 調整到與 LLM 相容的環境，這項初步研究測試了 ChatGPT-3.5，一個訓練於人類產生文字的大語言模型 (LLM)，在產生隨機數字序列時是否展現出類人的認知偏誤。初步發現顯示，與人類相比，ChatGPT-3.5 更有效地避免重複和順序模式，重複頻率和相鄰數字頻率明顯較低。持續研究不同的模型、參數和提示方法，將加深我們對 LLM 如何更接近人類隨機產生行為的理解，同時也擴展它們在認知和行為科學研究中的應用。", "author": "Rachel M. Harrison et.al.", "authors": "Rachel M. Harrison", "id": "2408.09656v1", "paper_url": "http://arxiv.org/abs/2408.09656v1", "repo": "null"}}