{"2407.03056": {"publish_time": "2024-07-03", "title": "Improving Zero-shot Generalization of Learned Prompts via Unsupervised Knowledge Distillation", "paper_summary": "Vision-Language Models (VLMs) demonstrate remarkable zero-shot generalization\nto unseen tasks, but fall short of the performance of supervised methods in\ngeneralizing to downstream tasks with limited data. Prompt learning is emerging\nas a parameter-efficient method for adapting VLMs, but state-of-the-art\napproaches require annotated samples. In this paper we propose a novel approach\nto prompt learning based on unsupervised knowledge distillation from more\npowerful models. Our approach, which we call Knowledge Distillation Prompt\nLearning (KDPL), can be integrated into existing prompt learning techniques and\neliminates the need for labeled examples during adaptation. Our experiments on\nmore than ten standard benchmark datasets demonstrate that KDPL is very\neffective at improving generalization of learned prompts for zero-shot domain\ngeneralization, zero-shot cross-dataset generalization, and zero-shot\nbase-to-novel class generalization problems. KDPL requires no ground-truth\nlabels for adaptation, and moreover we show that even in the absence of any\nknowledge of training class names it can be used to effectively transfer\nknowledge. The code is publicly available at https://github.com/miccunifi/KDPL.", "paper_summary_zh": "視覺語言模型 (VLM) 展示了卓越的零次學習泛化到未見任務的能力，但在泛化到資料有限的下游任務時，效能卻不如監督式方法。提示學習正逐漸成為一種參數有效的方法，用於調整 VLM，但最先進的方法需要有註解範例。在本文中，我們提出了一種基於更強大模型的非監督式知識萃取的提示學習新方法。我們稱之為知識萃取提示學習 (KDPL) 的方法可以整合到現有的提示學習技術中，並在調整過程中消除了對標記範例的需求。我們在十多個標準基準資料集上進行的實驗證明，KDPL 在改善學習提示的泛化方面非常有效，可用於零次學習領域泛化、零次學習跨資料集泛化，以及零次學習基本到新類別泛化問題。KDPL 不需要任何真實標籤來進行調整，此外，我們證明了即使在不知道訓練類別名稱的情況下，它也可以用於有效地傳輸知識。程式碼已公開發布於 https://github.com/miccunifi/KDPL。", "author": "Marco Mistretta et.al.", "authors": "Marco Mistretta, Alberto Baldrati, Marco Bertini, Andrew D. Bagdanov", "id": "2407.03056v1", "paper_url": "http://arxiv.org/abs/2407.03056v1", "repo": "null"}}