{"2411.11581": {"publish_time": "2024-11-18", "title": "OASIS: Open Agents Social Interaction Simulations on One Million Agents", "paper_summary": "There has been a growing interest in enhancing rule-based agent-based models\n(ABMs) for social media platforms (\\emph{i.e.}, X, Reddit) with more realistic\nlarge language model (LLM) agents, thereby allowing for a more nuanced study of\ncomplex systems. As a result, several LLM-based ABMs have been proposed in the\npast year. While they hold promise, each simulator is specifically designed to\nstudy a particular scenario, making it time-consuming and resource-intensive to\nexplore other phenomena using the same ABM. Additionally, these models simulate\nonly a limited number of agents, whereas real-world social media platforms\ninvolve millions of users. To this end, we propose OASIS, a generalizable and\nscalable social media simulator. OASIS is designed based on real-world social\nmedia platforms, incorporating dynamically updated environments (\\emph{i.e.},\ndynamic social networks and post information), diverse action spaces\n(\\emph{i.e.}, following, commenting), and recommendation systems (\\emph{i.e.},\ninterest-based and hot-score-based). Additionally, OASIS supports large-scale\nuser simulations, capable of modeling up to one million users. With these\nfeatures, OASIS can be easily extended to different social media platforms to\nstudy large-scale group phenomena and behaviors. We replicate various social\nphenomena, including information spreading, group polarization, and herd\neffects across X and Reddit platforms. Moreover, we provide observations of\nsocial phenomena at different agent group scales. We observe that the larger\nagent group scale leads to more enhanced group dynamics and more diverse and\nhelpful agents' opinions. These findings demonstrate OASIS's potential as a\npowerful tool for studying complex systems in digital environments.", "paper_summary_zh": "<paragraph>近年來，對於增強基於規則的基於代理的模型 (ABM) 以用於社交媒體平台（例如 X、Reddit）的興趣日益濃厚，其中加入了更逼真的大型語言模型 (LLM) 代理，從而允許對複雜系統進行更細緻的研究。因此，過去一年中已經提出了多個基於 LLM 的 ABM。雖然它們很有希望，但每個模擬器都是專門設計用於研究特定情境，這使得使用相同的 ABM 來探索其他現象既費時又費資源。此外，這些模型只模擬有限數量的代理，而現實世界的社交媒體平台涉及數百萬用戶。為此，我們提出了 OASIS，一個可概括且可擴充的社交媒體模擬器。OASIS 是根據現實世界的社交媒體平台設計的，它結合了動態更新的環境（例如動態社交網路和文章資訊）、多樣化的動作空間（例如關注、留言）和推薦系統（例如基於興趣和熱門評分）。此外，OASIS 支援大規模使用者模擬，能夠模擬多達一百萬名使用者。有了這些功能，OASIS 可以輕鬆擴充到不同的社交媒體平台，以研究大規模群體現象和行為。我們複製了各種社會現象，包括資訊散布、群體兩極化和羊群效應，橫跨 X 和 Reddit 平台。此外，我們提供了不同代理群組規模的社會現象觀察結果。我們觀察到，較大的代理群組規模會導致更增強的群組動態以及更多元且有用的代理意見。這些發現證明了 OASIS 作為研究數位環境中複雜系統的強大工具的潛力。</paragraph>", "author": "Ziyi Yang et.al.", "authors": "Ziyi Yang, Zaibin Zhang, Zirui Zheng, Yuxian Jiang, Ziyue Gan, Zhiyu Wang, Zijian Ling, Jinsong Chen, Martz Ma, Bowen Dong, Prateek Gupta, Shuyue Hu, Zhenfei Yin, Guohao Li, Xu Jia, Lijun Wang, Bernard Ghanem, Huchuan Lu, Wanli Ouyang, Yu Qiao, Philip Torr, Jing Shao", "id": "2411.11581v1", "paper_url": "http://arxiv.org/abs/2411.11581v1", "repo": "null"}}