{"2502.02027": {"publish_time": "2025-02-04", "title": "From Fog to Failure: How Dehazing Can Harm Clear Image Object Detection", "paper_summary": "This study explores the challenges of integrating human visual cue-based\ndehazing into object detection, given the selective nature of human perception.\nWhile human vision adapts dynamically to environmental conditions,\ncomputational dehazing does not always enhance detection uniformly. We propose\na multi-stage framework where a lightweight detector identifies regions of\ninterest (RoIs), which are then enhanced via spatial attention-based dehazing\nbefore final detection by a heavier model. Though effective in foggy\nconditions, this approach unexpectedly degrades the performance on clear\nimages. We analyze this phenomenon, investigate possible causes, and offer\ninsights for designing hybrid pipelines that balance enhancement and detection.\nOur findings highlight the need for selective preprocessing and challenge\nassumptions about universal benefits from cascading transformations.", "paper_summary_zh": "本研究探讨了在物件偵測中整合人類視覺線索去霧的挑戰，考量到人類感知具有選擇性。\n儘管人類視覺會動態適應環境條件，但計算去霧並非總能均勻提升偵測。我們提出一個多階段架構，其中一個輕量級偵測器會識別出感興趣區域 (RoI)，然後透過基於空間注意力的去霧進行增強，最後再由一個較重的模型進行最終偵測。儘管在有霧的條件下有效，但這種方法意外地降低了在清晰影像上的效能。我們分析了這個現象，探討了可能的原因，並提供了設計平衡增強和偵測的混合管線的見解。我們的發現突顯了選擇性預處理的必要性，並挑戰了串聯轉換的普遍好處的假設。", "author": "Ashutosh Kumar et.al.", "authors": "Ashutosh Kumar, Aman Chadha", "id": "2502.02027v1", "paper_url": "http://arxiv.org/abs/2502.02027v1", "repo": "null"}}