{"2503.21505": {"publish_time": "2025-03-27", "title": "Fine-Grained Evaluation of Large Vision-Language Models in Autonomous Driving", "paper_summary": "Existing benchmarks for Vision-Language Model (VLM) on autonomous driving\n(AD) primarily assess interpretability through open-form visual question\nanswering (QA) within coarse-grained tasks, which remain insufficient to assess\ncapabilities in complex driving scenarios. To this end, we introduce\n$\\textbf{VLADBench}$, a challenging and fine-grained dataset featuring\nclose-form QAs that progress from static foundational knowledge and elements to\nadvanced reasoning for dynamic on-road situations. The elaborate\n$\\textbf{VLADBench}$ spans 5 key domains: Traffic Knowledge Understanding,\nGeneral Element Recognition, Traffic Graph Generation, Target Attribute\nComprehension, and Ego Decision-Making and Planning. These domains are further\nbroken down into 11 secondary aspects and 29 tertiary tasks for a granular\nevaluation. A thorough assessment of general and domain-specific (DS) VLMs on\nthis benchmark reveals both their strengths and critical limitations in AD\ncontexts. To further exploit the cognitive and reasoning interactions among the\n5 domains for AD understanding, we start from a small-scale VLM and train the\nDS models on individual domain datasets (collected from 1.4M DS QAs across\npublic sources). The experimental results demonstrate that the proposed\nbenchmark provides a crucial step toward a more comprehensive assessment of\nVLMs in AD, paving the way for the development of more cognitively\nsophisticated and reasoning-capable AD systems.", "paper_summary_zh": "現有的自動駕駛 (AD) 視覺語言模型 (VLM) 基準主要透過在粗略任務中開放式視覺問答 (QA) 來評估其可解釋性，這仍然不足以評估在複雜駕駛場景中的能力。為此，我們引入了 $\\textbf{VLADBench}$，這是一個具有挑戰性且細粒度的數據集，其特點是封閉式問答，從靜態基礎知識和元素到動態道路情況的高級推理逐步推進。精心設計的 $\\textbf{VLADBench}$ 涵蓋 5 個關鍵領域：交通知識理解、一般元素識別、交通圖生成、目標屬性理解以及自我決策和規劃。這些領域進一步細分為 11 個次要方面和 29 個三級任務，以便進行更精細的評估。對此基準中通用和特定領域 (DS) VLM 的全面評估揭示了它們在自動駕駛環境中的優勢和關鍵局限性。為了進一步利用 5 個領域之間的認知和推理交互作用來理解自動駕駛，我們從一個小型 VLM 開始，並在各個領域數據集（從公共資源中收集的 140 萬個 DS 問答）上訓練 DS 模型。實驗結果表明，所提出的基準為更全面地評估自動駕駛中的 VLM 邁出了關鍵一步，為開發更具認知複雜性和推理能力的自動駕駛系統鋪平了道路。\n", "author": "Yue Li et.al.", "authors": "Yue Li, Meng Tian, Zhenyu Lin, Jiangtong Zhu, Dechang Zhu, Haiqiang Liu, Zining Wang, Yueyi Zhang, Zhiwei Xiong, Xinhai Zhao", "id": "2503.21505v1", "paper_url": "http://arxiv.org/abs/2503.21505v1", "repo": "null"}}