{"2412.11556": {"publish_time": "2024-12-16", "title": "Token Prepending: A Training-Free Approach for Eliciting Better Sentence Embeddings from LLMs", "paper_summary": "Extracting sentence embeddings from large language models (LLMs) is a\npromising direction, as LLMs have demonstrated stronger semantic understanding\ncapabilities. Previous studies typically focus on prompt engineering to elicit\nsentence embeddings from LLMs by prompting the model to encode sentence\ninformation into the embedding of the last token. However, LLMs are mostly\ndecoder-only models with causal attention and the earlier tokens in the\nsentence cannot attend to the latter tokens, resulting in biased encoding of\nsentence information and cascading effects on the final decoded token. To this\nend, we propose a novel Token Prepending (TP) technique that prepends each\nlayer's decoded sentence embedding to the beginning of the sentence in the next\nlayer's input, allowing earlier tokens to attend to the complete sentence\ninformation under the causal attention mechanism. The proposed TP technique is\na plug-and-play and training-free technique, which means it can be seamlessly\nintegrated with various prompt-based sentence embedding methods and\nautoregressive LLMs. Extensive experiments on various Semantic Textual\nSimilarity (STS) tasks and downstream classification tasks demonstrate that our\nproposed TP technique can significantly improve the performance of existing\nprompt-based sentence embedding methods across different LLMs, while incurring\nnegligible additional inference cost.", "paper_summary_zh": "從大型語言模型（LLM）中提取句子嵌入是一種有前途的方向，因為 LLM 已展現出更強大的語義理解能力。先前的研究通常專注於提示工程，以透過提示模型將句子資訊編碼到最後一個記號的嵌入中，來從 LLM 引出句子嵌入。然而，LLM 主要是具有因果注意力的僅解碼器模型，且句子中較早的記號無法注意後面的記號，導致句子資訊的編碼有偏差，並對最後解碼的記號產生連鎖效應。為此，我們提出了一種新穎的記號前置（TP）技術，將每一層的解碼句子嵌入前置到下一層輸入句子的開頭，讓較早的記號可以在因果注意力機制下注意完整的句子資訊。所提出的 TP 技術是一種即插即用且免訓練的技術，這表示它可以無縫地整合到各種基於提示的句子嵌入方法和自迴歸 LLM 中。在各種語義文字相似度（STS）任務和下游分類任務上的廣泛實驗證明，我們提出的 TP 技術可以顯著改善現有基於提示的句子嵌入方法在不同 LLM 中的效能，同時產生可忽略不計的額外推論成本。", "author": "Yuchen Fu et.al.", "authors": "Yuchen Fu, Zifeng Cheng, Zhiwei Jiang, Zhonghui Wang, Yafeng Yin, Zhengliang Li, Qing Gu", "id": "2412.11556v1", "paper_url": "http://arxiv.org/abs/2412.11556v1", "repo": "null"}}