{"2410.17485": {"publish_time": "2024-10-23", "title": "VoiceTextBlender: Augmenting Large Language Models with Speech Capabilities via Single-Stage Joint Speech-Text Supervised Fine-Tuning", "paper_summary": "Recent studies have augmented large language models (LLMs) with speech\ncapabilities, leading to the development of speech language models (SpeechLMs).\nEarlier SpeechLMs focused on single-turn speech-based question answering (QA),\nwhere user input comprised a speech context and a text question. More recent\nstudies have extended this to multi-turn conversations, though they often\nrequire complex, multi-stage supervised fine-tuning (SFT) with diverse data.\nAnother critical challenge with SpeechLMs is catastrophic forgetting-where\nmodels optimized for speech tasks suffer significant degradation in text-only\nperformance. To mitigate these issues, we propose a novel single-stage joint\nspeech-text SFT approach on the low-rank adaptation (LoRA) of the LLM backbone.\nOur joint SFT combines text-only SFT data with three types of speech-related\ndata: speech recognition and translation, speech-based QA, and mixed-modal SFT.\nCompared to previous SpeechLMs with 7B or 13B parameters, our 3B model\ndemonstrates superior performance across various speech benchmarks while\npreserving the original capabilities on text-only tasks. Furthermore, our model\nshows emergent abilities of effectively handling previously unseen prompts and\ntasks, including multi-turn, mixed-modal inputs.", "paper_summary_zh": "最近的研究已擴增大型語言模型 (LLM) 的語音能力，進而開發出語音語言模型 (SpeechLM)。\n早期的 SpeechLM 專注於單輪次基於語音的問答 (QA)，其中使用者輸入包含語音脈絡和文字問題。最近的研究已將此擴展到多輪次對話，儘管它們通常需要複雜的多階段監督微調 (SFT) 與多樣化的資料。\nSpeechLM 的另一個關鍵挑戰是災難性遺忘，其中針對語音任務最佳化的模型在純文字效能上會大幅下降。為了減輕這些問題，我們提出在 LLM 主幹的低秩適應 (LoRA) 上採用新穎的單階段聯合語音文字 SFT 方法。\n我們的聯合 SFT 將純文字 SFT 資料與三種類型的語音相關資料結合：語音辨識與翻譯、基於語音的 QA 以及混合模式 SFT。\n與先前具有 7B 或 13B 參數的 SpeechLM 相比，我們的 3B 模型在各種語音基準上展現出卓越的效能，同時保留純文字任務的原始功能。此外，我們的模型展現出有效處理先前未見提示和任務的新興能力，包括多輪次、混合模式輸入。", "author": "Yifan Peng et.al.", "authors": "Yifan Peng, Krishna C. Puvvada, Zhehuai Chen, Piotr Zelasko, He Huang, Kunal Dhawan, Ke Hu, Shinji Watanabe, Jagadeesh Balam, Boris Ginsburg", "id": "2410.17485v1", "paper_url": "http://arxiv.org/abs/2410.17485v1", "repo": "null"}}