{"2410.02710": {"publish_time": "2024-10-03", "title": "SteerDiff: Steering towards Safe Text-to-Image Diffusion Models", "paper_summary": "Text-to-image (T2I) diffusion models have drawn attention for their ability\nto generate high-quality images with precise text alignment. However, these\nmodels can also be misused to produce inappropriate content. Existing safety\nmeasures, which typically rely on text classifiers or ControlNet-like\napproaches, are often insufficient. Traditional text classifiers rely on\nlarge-scale labeled datasets and can be easily bypassed by rephrasing. As\ndiffusion models continue to scale, fine-tuning these safeguards becomes\nincreasingly challenging and lacks flexibility. Recent red-teaming attack\nresearches further underscore the need for a new paradigm to prevent the\ngeneration of inappropriate content. In this paper, we introduce SteerDiff, a\nlightweight adaptor module designed to act as an intermediary between user\ninput and the diffusion model, ensuring that generated images adhere to ethical\nand safety standards with little to no impact on usability. SteerDiff\nidentifies and manipulates inappropriate concepts within the text embedding\nspace to guide the model away from harmful outputs. We conduct extensive\nexperiments across various concept unlearning tasks to evaluate the\neffectiveness of our approach. Furthermore, we benchmark SteerDiff against\nmultiple red-teaming strategies to assess its robustness. Finally, we explore\nthe potential of SteerDiff for concept forgetting tasks, demonstrating its\nversatility in text-conditioned image generation.", "paper_summary_zh": "文本到图像 (T2I) 扩散模型因其生成具有精确文本对齐的高质量图像的能力而备受关注。然而，这些模型也可能被滥用以产生不当内容。现有的安全措施通常依赖于文本分类器或 ControlNet 等方法，往往不足以应对。传统的文本分类器依赖于大规模标记数据集，并且可以通过改写轻松绕过。随着扩散模型的不断扩展，对这些保障措施进行微调变得越来越具有挑战性，并且缺乏灵活性。最近的红队攻击研究进一步强调了需要一种新的范例来防止生成不当内容。在本文中，我们介绍了 SteerDiff，这是一个轻量级的适配器模块，旨在充当用户输入和扩散模型之间的中介，确保生成的图像符合道德和安全标准，同时几乎不会影响可用性。SteerDiff 在文本嵌入空间中识别和操作不当概念，以引导模型远离有害输出。我们对各种概念取消学习任务进行了广泛的实验，以评估我们方法的有效性。此外，我们对 SteerDiff 进行了基准测试，以针对多个红队策略评估其稳健性。最后，我们探讨了 SteerDiff 在概念遗忘任务中的潜力，展示了它在文本条件图像生成中的多功能性。", "author": "Hongxiang Zhang et.al.", "authors": "Hongxiang Zhang, Yifeng He, Hao Chen", "id": "2410.02710v1", "paper_url": "http://arxiv.org/abs/2410.02710v1", "repo": "null"}}