{"2406.12629": {"publish_time": "2024-06-18", "title": "SeTAR: Out-of-Distribution Detection with Selective Low-Rank Approximation", "paper_summary": "Out-of-distribution (OOD) detection is crucial for the safe deployment of\nneural networks. Existing CLIP-based approaches perform OOD detection by\ndevising novel scoring functions or sophisticated fine-tuning methods. In this\nwork, we propose SeTAR, a novel, training-free OOD detection method that\nleverages selective low-rank approximation of weight matrices in\nvision-language and vision-only models. SeTAR enhances OOD detection via\npost-hoc modification of the model's weight matrices using a simple greedy\nsearch algorithm. Based on SeTAR, we further propose SeTAR+FT, a fine-tuning\nextension optimizing model performance for OOD detection tasks. Extensive\nevaluations on ImageNet1K and Pascal-VOC benchmarks show SeTAR's superior\nperformance, reducing the false positive rate by up to 18.95% and 36.80%\ncompared to zero-shot and fine-tuning baselines. Ablation studies further\nvalidate our approach's effectiveness, robustness, and generalizability across\ndifferent model backbones. Our work offers a scalable, efficient solution for\nOOD detection, setting a new state-of-the-art in this area.", "paper_summary_zh": "異配分 (OOD) 偵測對於神經網路的安全部署至關重要。現有的基於 CLIP 的方法透過設計新穎的評分函數或複雜的微調方法來執行 OOD 偵測。在這項工作中，我們提出 SeTAR，這是一種新穎的、免訓練的 OOD 偵測方法，它利用了視覺語言和純視覺模型中權重矩陣的選擇性低秩近似。SeTAR 透過使用簡單的貪婪搜尋演算法對模型的權重矩陣進行事後修改來增強 OOD 偵測。基於 SeTAR，我們進一步提出 SeTAR+FT，這是一種微調擴充，用於最佳化模型在 OOD 偵測任務中的效能。在 ImageNet1K 和 Pascal-VOC 基準上的廣泛評估顯示了 SeTAR 的優異效能，與零次學習和微調基準線相比，將假陽性率降低了 18.95% 和 36.80%。消融研究進一步驗證了我們的方法在不同模型主幹上的有效性、穩健性和概括性。我們的研究提供了一個可擴充、高效的 OOD 偵測解決方案，為這個領域設定了一個新的最先進水準。", "author": "Yixia Li et.al.", "authors": "Yixia Li, Boya Xiong, Guanhua Chen, Yun Chen", "id": "2406.12629v1", "paper_url": "http://arxiv.org/abs/2406.12629v1", "repo": "https://github.com/X1AOX1A/SeTAR"}}