{"2405.11941": {"publish_time": "2024-05-20", "title": "Biomedical Entity Linking for Dutch: Fine-tuning a Self-alignment BERT Model on an Automatically Generated Wikipedia Corpus", "paper_summary": "Biomedical entity linking, a main component in automatic information\nextraction from health-related texts, plays a pivotal role in connecting\ntextual entities (such as diseases, drugs and body parts mentioned by patients)\nto their corresponding concepts in a structured biomedical knowledge base. The\ntask remains challenging despite recent developments in natural language\nprocessing. This paper presents the first evaluated biomedical entity linking\nmodel for the Dutch language. We use MedRoBERTa.nl as base model and perform\nsecond-phase pretraining through self-alignment on a Dutch biomedical ontology\nextracted from the UMLS and Dutch SNOMED. We derive a corpus from Wikipedia of\nontology-linked Dutch biomedical entities in context and fine-tune our model on\nthis dataset. We evaluate our model on the Dutch portion of the Mantra\nGSC-corpus and achieve 54.7% classification accuracy and 69.8% 1-distance\naccuracy. We then perform a case study on a collection of unlabeled,\npatient-support forum data and show that our model is hampered by the limited\nquality of the preceding entity recognition step. Manual evaluation of small\nsample indicates that of the correctly extracted entities, around 65% is linked\nto the correct concept in the ontology. Our results indicate that biomedical\nentity linking in a language other than English remains challenging, but our\nDutch model can be used to for high-level analysis of patient-generated text.", "paper_summary_zh": "生物醫學實體連結，是從健康相關文本中自動提取資訊的主要組成部分，在將文本實體（例如患者提到的疾病、藥物和身體部位）連結到結構化生物醫學知識庫中的對應概念方面發揮著關鍵作用。儘管自然語言處理最近有發展，但此任務仍然具有挑戰性。本文提出了第一個針對荷蘭語的生物醫學實體連結模型評估。我們使用 MedRoBERTa.nl 作為基礎模型，並透過從 UMLS 和荷蘭 SNOMED 中萃取的荷蘭生物醫學本体進行自我對齊，執行第二階段預訓練。我們從維基百科中衍生了一個語境中的本体連結荷蘭生物醫學實體語料庫，並針對此資料集微調我們的模型。我們在 Mantra GSC 語料庫的荷蘭語部分對我們的模型進行評估，並達到 54.7% 的分類準確率和 69.8% 的 1 距離準確率。然後，我們對一組未標記的患者支援論壇資料進行案例研究，並顯示我們的模型受到前一個實體辨識步驟品質有限的阻礙。對小型樣本的手動評估表明，在正確萃取的實體中，約有 65% 連結到本体中的正確概念。我們的結果表明，以英語以外的語言進行生物醫學實體連結仍然具有挑戰性，但我們的荷蘭語模型可用於對患者產生的文本進行高階分析。", "author": "Fons Hartendorp et.al.", "authors": "Fons Hartendorp, Tom Seinen, Erik van Mulligen, Suzan Verberne", "id": "2405.11941v1", "paper_url": "http://arxiv.org/abs/2405.11941v1", "repo": "null"}}