{"2406.12072": {"publish_time": "2024-06-17", "title": "DTGB: A Comprehensive Benchmark for Dynamic Text-Attributed Graphs", "paper_summary": "Dynamic text-attributed graphs (DyTAGs) are prevalent in various real-world\nscenarios, where each node and edge are associated with text descriptions, and\nboth the graph structure and text descriptions evolve over time. Despite their\nbroad applicability, there is a notable scarcity of benchmark datasets tailored\nto DyTAGs, which hinders the potential advancement in many research fields. To\naddress this gap, we introduce Dynamic Text-attributed Graph Benchmark (DTGB),\na collection of large-scale, time-evolving graphs from diverse domains, with\nnodes and edges enriched by dynamically changing text attributes and\ncategories. To facilitate the use of DTGB, we design standardized evaluation\nprocedures based on four real-world use cases: future link prediction,\ndestination node retrieval, edge classification, and textual relation\ngeneration. These tasks require models to understand both dynamic graph\nstructures and natural language, highlighting the unique challenges posed by\nDyTAGs. Moreover, we conduct extensive benchmark experiments on DTGB,\nevaluating 7 popular dynamic graph learning algorithms and their variants of\nadapting to text attributes with LLM embeddings, along with 6 powerful large\nlanguage models (LLMs). Our results show the limitations of existing models in\nhandling DyTAGs. Our analysis also demonstrates the utility of DTGB in\ninvestigating the incorporation of structural and textual dynamics. The\nproposed DTGB fosters research on DyTAGs and their broad applications. It\noffers a comprehensive benchmark for evaluating and advancing models to handle\nthe interplay between dynamic graph structures and natural language. The\ndataset and source code are available at https://github.com/zjs123/DTGB.", "paper_summary_zh": "<paragraph>動態文本屬性圖 (DyTAG) 在各種真實世界場景中普遍存在，其中每個節點和邊緣都與文本描述相關聯，並且圖形結構和文本描述會隨著時間演變。儘管它們具有廣泛的適用性，但專門針對 DyTAG 的基準數據集卻非常稀少，這阻礙了許多研究領域的潛在進步。為了解決這個差距，我們引入了動態文本屬性圖基準 (DTGB)，這是一個來自不同領域的大規模、隨時間演變的圖形集合，其中節點和邊緣通過動態變化的文本屬性和類別進行豐富。為了促進 DTGB 的使用，我們根據四個真實世界的用例設計了標準化的評估程序：未來鏈路預測、目標節點檢索、邊緣分類和文本關係生成。這些任務要求模型同時理解動態圖形結構和自然語言，強調了 DyTAG 帶來的獨特挑戰。此外，我們對 DTGB 進行了廣泛的基準實驗，評估了 7 種流行的動態圖形學習算法及其適應文本屬性與 LLM 嵌入的變體，以及 6 種強大的大型語言模型 (LLM)。我們的結果顯示了現有模型在處理 DyTAG 方面的局限性。我們的分析還證明了 DTGB 在研究結構和文本動態的整合方面的效用。提議的 DTGB 促進了對 DyTAG 及其廣泛應用的研究。它提供了一個綜合基準，用於評估和改進模型，以處理動態圖形結構和自然語言之間的相互作用。數據集和源代碼可在 https://github.com/zjs123/DTGB 獲得。</paragraph>", "author": "Jiasheng Zhang et.al.", "authors": "Jiasheng Zhang, Jialin Chen, Menglin Yang, Aosong Feng, Shuang Liang, Jie Shao, Rex Ying", "id": "2406.12072v1", "paper_url": "http://arxiv.org/abs/2406.12072v1", "repo": "https://github.com/zjs123/DTGB"}}