{"2408.03585": {"publish_time": "2024-08-07", "title": "Hierarchical Neural Constructive Solver for Real-world TSP Scenarios", "paper_summary": "Existing neural constructive solvers for routing problems have predominantly\nemployed transformer architectures, conceptualizing the route construction as a\nset-to-sequence learning task. However, their efficacy has primarily been\ndemonstrated on entirely random problem instances that inadequately capture\nreal-world scenarios. In this paper, we introduce realistic Traveling Salesman\nProblem (TSP) scenarios relevant to industrial settings and derive the\nfollowing insights: (1) The optimal next node (or city) to visit often lies\nwithin proximity to the current node, suggesting the potential benefits of\nbiasing choices based on current locations. (2) Effectively solving the TSP\nrequires robust tracking of unvisited nodes and warrants succinct grouping\nstrategies. Building upon these insights, we propose integrating a learnable\nchoice layer inspired by Hypernetworks to prioritize choices based on the\ncurrent location, and a learnable approximate clustering algorithm inspired by\nthe Expectation-Maximization algorithm to facilitate grouping the unvisited\ncities. Together, these two contributions form a hierarchical approach towards\nsolving the realistic TSP by considering both immediate local neighbourhoods\nand learning an intermediate set of node representations. Our hierarchical\napproach yields superior performance compared to both classical and recent\ntransformer models, showcasing the efficacy of the key designs.", "paper_summary_zh": "現有的神經建構求解器主要使用Transformer架構，將路線建構概念化為集合到序列的學習任務。然而，它們的效能主要展現在完全隨機的問題實例上，無法充分捕捉現實世界的場景。在本文中，我們引入了與工業環境相關的現實旅行商問題 (TSP) 場景，並得出以下見解：(1) 下一個要拜訪的最佳節點（或城市）通常位於當前節點的附近，這表明根據當前位置調整選擇的潛在好處。(2) 有效地解決 TSP 需要穩健地追蹤未拜訪的節點，並保證簡潔的分組策略。根據這些見解，我們建議整合受 Hypernetworks 啟發的可學習選擇層，以根據當前位置優先選擇，以及受期望最大化演算法啟發的可學習近似分群演算法，以利於對未拜訪的城市進行分組。這兩個貢獻共同形成了一個階層式方法，透過考慮鄰近的局部鄰域和學習一組中間節點表示，來解決現實的 TSP。與傳統和最近的Transformer模型相比，我們的階層式方法產生了更好的效能，展示了關鍵設計的效能。", "author": "Yong Liang Goh et.al.", "authors": "Yong Liang Goh, Zhiguang Cao, Yining Ma, Yanfei Dong, Mohammed Haroon Dupty, Wee Sun Lee", "id": "2408.03585v1", "paper_url": "http://arxiv.org/abs/2408.03585v1", "repo": "null"}}