{"2502.03253": {"publish_time": "2025-02-05", "title": "How do Humans and Language Models Reason About Creativity? A Comparative Analysis", "paper_summary": "Creativity assessment in science and engineering is increasingly based on\nboth human and AI judgment, but the cognitive processes and biases behind these\nevaluations remain poorly understood. We conducted two experiments examining\nhow including example solutions with ratings impact creativity evaluation,\nusing a finegrained annotation protocol where raters were tasked with\nexplaining their originality scores and rating for the facets of remoteness\n(whether the response is \"far\" from everyday ideas), uncommonness (whether the\nresponse is rare), and cleverness. In Study 1, we analyzed creativity ratings\nfrom 72 experts with formal science or engineering training, comparing those\nwho received example solutions with ratings (example) to those who did not (no\nexample). Computational text analysis revealed that, compared to experts with\nexamples, no-example experts used more comparative language (e.g.,\n\"better/worse\") and emphasized solution uncommonness, suggesting they may have\nrelied more on memory retrieval for comparisons. In Study 2, parallel analyses\nwith state-of-the-art LLMs revealed that models prioritized uncommonness and\nremoteness of ideas when rating originality, suggesting an evaluative process\nrooted around the semantic similarity of ideas. In the example condition, while\nLLM accuracy in predicting the true originality scores improved, the\ncorrelations of remoteness, uncommonness, and cleverness with originality also\nincreased substantially - to upwards of 0.99 - suggesting a homogenization in\nthe LLMs evaluation of the individual facets. These findings highlight\nimportant implications for how humans and AI reason about creativity and\nsuggest diverging preferences for what different populations prioritize when\nrating.", "paper_summary_zh": "科學和工程領域的創意評量越來越依賴人類和 AI 的判斷，但這些評量的認知過程和偏見仍鮮為人知。我們進行了兩個實驗，探討包含評分範例解題對創意評量的影響，並使用細緻的註解協定，要求評分者說明其獨創性分數，並評分其偏遠性（回應是否「遠離」日常想法）、罕見性（回應是否罕見）和靈巧性。在研究 1 中，我們分析了 72 位具有正式科學或工程訓練的專家的創意評分，比較了收到評分範例解題的專家（範例組）和未收到範例解題的專家（非範例組）。計算文本分析顯示，與有範例組專家相比，非範例組專家使用了更多的比較語言（例如「較好/較差」），並強調解題的罕見性，這表明他們可能更多地依賴記憶檢索進行比較。在研究 2 中，與最先進的 LLM 進行的平行分析顯示，模型在評分獨創性時優先考慮想法的罕見性和偏遠性，這表明評估過程植基於想法的語義相似性。在範例條件下，儘管 LLM 在預測真實獨創性分數方面的準確性有所提高，但偏遠性、罕見性和靈巧性與獨創性的相關性也大幅增加，高達 0.99，這表明 LLM 對個別方面的評估趨於同質化。這些發現突顯了人類和 AI 如何推理創意以及在評分時不同族群優先考量事項存在分歧的重要意義。", "author": "Antonio Laverghetta Jr. et.al.", "authors": "Antonio Laverghetta Jr., Tuhin Chakrabarty, Tom Hope, Jimmy Pronchick, Krupa Bhawsar, Roger E. Beaty", "id": "2502.03253v1", "paper_url": "http://arxiv.org/abs/2502.03253v1", "repo": "null"}}