{"2410.18629": {"publish_time": "2024-10-24", "title": "Supporting Assessment of Novelty of Design Problems Using Concept of Problem SAPPhIRE", "paper_summary": "This paper proposes a framework for assessing the novelty of design problems\nusing the SAPPhIRE model of causality. The novelty of a problem is measured as\nits minimum distance from the problems in a reference problem database. The\ndistance is calculated by comparing the current problem and each reference past\nproblem at the various levels of abstraction in the SAPPhIRE ontology. The\nbasis for comparison is textual similarity. To demonstrate the applicability of\nthe proposed framework, The current set of problems associated with an\nartifact, as collected from its stakeholders, were compared with the past set\nof problems, as collected from patents and other web sources, to assess the\nnovelty of the current set. This approach is aimed at providing a better\nunderstanding of the degree of novelty of any given set of current problems by\ncomparing them to similar problems available from historical records. Since\nmanual assessment, the current mode of such assessments as reported in the\nliterature, is a tedious process, to reduce time complexity and to afford\nbetter applicability for larger sets of problem statements, an automated\nassessment is proposed and used in this paper.", "paper_summary_zh": "本文提出了一個框架，用因果關係的 SAPPhIRE 模型來評估設計問題的新穎性。問題的新穎性是以它與參考問題資料庫中的問題的最小距離來衡量。距離的計算方法是比較當前問題和每個參考過去問題在 SAPPhIRE ontology 中的各種抽象層級。比較的基礎是文字相似性。為了展示所提出框架的適用性，將從其利害關係人收集到的與某個人工製品相關的當前問題集與從專利和其他網路來源收集到的過去問題集進行比較，以評估當前問題集的新穎性。這種方法旨在透過將當前問題集與從歷史記錄中取得的類似問題進行比較，進一步了解任何給定當前問題集的新穎程度。由於手動評估（如文獻中所報導的此類評估的現行模式）是一個繁瑣的過程，為了降低時間複雜度，並讓更大的問題陳述集有更好的適用性，本文提出並使用了自動化評估。", "author": "Sanjay Singh et.al.", "authors": "Sanjay Singh, Amaresh Chakrabarti", "id": "2410.18629v1", "paper_url": "http://arxiv.org/abs/2410.18629v1", "repo": "null"}}