{"2407.02821": {"publish_time": "2024-07-03", "title": "Effect of a Process Mining based Pre-processing Step in Prediction of the Critical Health Outcomes", "paper_summary": "Predicting critical health outcomes such as patient mortality and hospital\nreadmission is essential for improving survivability. However, healthcare\ndatasets have many concurrences that create complexities, leading to poor\npredictions. Consequently, pre-processing the data is crucial to improve its\nquality. In this study, we use an existing pre-processing algorithm,\nconcatenation, to improve data quality by decreasing the complexity of\ndatasets. Sixteen healthcare datasets were extracted from two databases - MIMIC\nIII and University of Illinois Hospital - converted to the event logs, they\nwere then fed into the concatenation algorithm. The pre-processed event logs\nwere then fed to the Split Miner (SM) algorithm to produce a process model.\nProcess model quality was evaluated before and after concatenation using the\nfollowing metrics: fitness, precision, F-Measure, and complexity. The\npre-processed event logs were also used as inputs to the Decay Replay Mining\n(DREAM) algorithm to predict critical outcomes. We compared predicted results\nbefore and after applying the concatenation algorithm using Area Under the\nCurve (AUC) and Confidence Intervals (CI). Results indicated that the\nconcatenation algorithm improved the quality of the process models and\npredictions of the critical health outcomes.", "paper_summary_zh": "預測病患死亡率和醫院再入院等重大的健康結果，對於提升存活率至關重要。然而，醫療保健資料集有許多同時發生的事件，會造成複雜性，導致預測不佳。因此，預先處理資料對於提升資料品質至關重要。在本研究中，我們使用現有的預先處理演算法，連接，藉由降低資料集的複雜性來提升資料品質。從兩個資料庫中萃取出十六個醫療保健資料集 - MIMIC III 和伊利諾大學醫院 - 轉換成事件記錄，然後將其輸入連接演算法。接著將預先處理的事件記錄輸入 Split Miner (SM) 演算法，以產生流程模型。使用以下指標評估連接前後的流程模型品質：適用性、精確度、F-量測和複雜性。預先處理的事件記錄也用作衰減重播探勘 (DREAM) 演算法的輸入，以預測重大的結果。我們使用曲線下面積 (AUC) 和信心區間 (CI) 比較套用連接演算法前後的預測結果。結果顯示連接演算法提升了流程模型的品質和對重大健康結果的預測。", "author": "Negin Ashrafi et.al.", "authors": "Negin Ashrafi, Armin Abdollahi, Greg Placencia, Maryam Pishgar", "id": "2407.02821v1", "paper_url": "http://arxiv.org/abs/2407.02821v1", "repo": "null"}}