{"2405.08311": {"publish_time": "2024-05-14", "title": "A Decoupling and Aggregating Framework for Joint Extraction of Entities and Relations", "paper_summary": "Named Entity Recognition and Relation Extraction are two crucial and\nchallenging subtasks in the field of Information Extraction. Despite the\nsuccesses achieved by the traditional approaches, fundamental research\nquestions remain open. First, most recent studies use parameter sharing for a\nsingle subtask or shared features for both two subtasks, ignoring their\nsemantic differences. Second, information interaction mainly focuses on the two\nsubtasks, leaving the fine-grained informtion interaction among the\nsubtask-specific features of encoding subjects, relations, and objects\nunexplored. Motivated by the aforementioned limitations, we propose a novel\nmodel to jointly extract entities and relations. The main novelties are as\nfollows: (1) We propose to decouple the feature encoding process into three\nparts, namely encoding subjects, encoding objects, and encoding relations.\nThanks to this, we are able to use fine-grained subtask-specific features. (2)\nWe propose novel inter-aggregation and intra-aggregation strategies to enhance\nthe information interaction and construct individual fine-grained\nsubtask-specific features, respectively. The experimental results demonstrate\nthat our model outperforms several previous state-of-the-art models. Extensive\nadditional experiments further confirm the effectiveness of our model.", "paper_summary_zh": "命名實體辨識與關係萃取是資訊萃取領域中兩個至關重要且具有挑戰性的子任務。儘管傳統方法取得成功，但基本的研究問題仍然懸而未決。首先，大多數最近的研究使用參數共享來執行單一子任務或共享功能來執行兩個子任務，忽略了它們的語義差異。其次，資訊互動主要集中在兩個子任務上，忽略了編碼主詞、關係和物件的子任務特定功能之間的細粒度資訊互動。受到上述限制的啟發，我們提出了一個新穎的模型，用於聯合萃取實體和關係。主要的創新如下：(1) 我們建議將特徵編碼過程解耦成三個部分，即編碼主詞、編碼物件和編碼關係。由於這樣，我們可以使用細粒度的子任務特定功能。(2) 我們提出新穎的交互聚合和內部聚合策略，分別增強資訊互動並建構個別的細粒度子任務特定功能。實驗結果證明，我們的模型優於幾個先前的最先進模型。廣泛的額外實驗進一步證實了我們模型的有效性。", "author": "Yao Wang et.al.", "authors": "Yao Wang, Xin Liu, Weikun Kong, Hai-Tao Yu, Teeradaj Racharak, Kyoung-Sook Kim, Minh Le Nguyen", "id": "2405.08311v1", "paper_url": "http://arxiv.org/abs/2405.08311v1", "repo": "null"}}