{"2410.23577": {"publish_time": "2024-10-31", "title": "MS-Glance: Non-semantic context vectors and the applications in supervising image reconstruction", "paper_summary": "Non-semantic context information is crucial for visual recognition, as the\nhuman visual perception system first uses global statistics to process scenes\nrapidly before identifying specific objects. However, while semantic\ninformation is increasingly incorporated into computer vision tasks such as\nimage reconstruction, non-semantic information, such as global spatial\nstructures, is often overlooked. To bridge the gap, we propose a biologically\ninformed non-semantic context descriptor, \\textbf{MS-Glance}, along with the\nGlance Index Measure for comparing two images. A Global Glance vector is\nformulated by randomly retrieving pixels based on a perception-driven rule from\nan image to form a vector representing non-semantic global context, while a\nlocal Glance vector is a flattened local image window, mimicking a zoom-in\nobservation. The Glance Index is defined as the inner product of two\nstandardized sets of Glance vectors. We evaluate the effectiveness of\nincorporating Glance supervision in two reconstruction tasks: image fitting\nwith implicit neural representation (INR) and undersampled MRI reconstruction.\nExtensive experimental results show that MS-Glance outperforms existing image\nrestoration losses across both natural and medical images. The code is\navailable at \\url{https://github.com/Z7Gao/MSGlance}.", "paper_summary_zh": "非语义上下文信息对于视觉识别至关重要，因为人类视觉感知系统首先使用全局统计数据来快速处理场景，然后再识别特定对象。然而，虽然语义信息正越来越多地融入到图像重建等计算机视觉任务中，但非语义信息（如全局空间结构）却常常被忽视。为了弥合这一差距，我们提出了一个生物信息启发的非语义上下文描述符，即 \\textbf{MS-Glance}，以及用于比较两幅图像的 Glance 指数度量。通过根据感知驱动的规则从图像中随机检索像素来构建一个全局 Glance 向量，以形成一个表示非语义全局上下文的向量，而局部 Glance 向量是一个扁平的局部图像窗口，模仿了放大观察。Glance 指数被定义为两组标准化的 Glance 向量的内积。我们评估了在两个重建任务中纳入 Glance 监督的有效性：具有隐式神经表征 (INR) 的图像拟合和欠采样 MRI 重建。大量的实验结果表明，MS-Glance 在自然图像和医学图像中都优于现有的图像恢复损失。代码可在 \\url{https://github.com/Z7Gao/MSGlance} 获得。", "author": "Ziqi Gao et.al.", "authors": "Ziqi Gao, Wendi Yang, Yujia Li, Lei Xing, S. Kevin Zhou", "id": "2410.23577v1", "paper_url": "http://arxiv.org/abs/2410.23577v1", "repo": "https://github.com/z7gao/msglance"}}