{"2502.21087": {"publish_time": "2025-02-28", "title": "PASemiQA: Plan-Assisted Agent for Question Answering on Semi-Structured Data with Text and Relational Information", "paper_summary": "Large language models (LLMs) have shown impressive abilities in answering\nquestions across various domains, but they often encounter hallucination issues\non questions that require professional and up-to-date knowledge. To address\nthis limitation, retrieval-augmented generation (RAG) techniques have been\nproposed, which retrieve relevant information from external sources to inform\ntheir responses. However, existing RAG methods typically focus on a single type\nof external data, such as vectorized text database or knowledge graphs, and\ncannot well handle real-world questions on semi-structured data containing both\ntext and relational information. To bridge this gap, we introduce PASemiQA, a\nnovel approach that jointly leverages text and relational information in\nsemi-structured data to answer questions. PASemiQA first generates a plan to\nidentify relevant text and relational information to answer the question in\nsemi-structured data, and then uses an LLM agent to traverse the\nsemi-structured data and extract necessary information. Our empirical results\ndemonstrate the effectiveness of PASemiQA across different semi-structured\ndatasets from various domains, showcasing its potential to improve the accuracy\nand reliability of question answering systems on semi-structured data.", "paper_summary_zh": "大型語言模型 (LLM) 在回答各個領域的問題方面展現出令人印象深刻的能力，但它們在需要專業和最新知識的問題上經常會遇到幻覺問題。為了克服這個限制，研究人員提出了檢索增強生成 (RAG) 技術，該技術從外部來源檢索相關資訊來提供答案。然而，現有的 RAG 方法通常只關注單一類型的外部資料，例如向量化文本資料庫或知識圖譜，並且不能很好地處理包含文本和關係資訊的半結構化資料的現實問題。為了彌合這一差距，我們引入了 PASemiQA，這是一種利用半結構化資料中的文本和關係資訊來回答問題的新方法。PASemiQA 首先制定一個計劃，以識別半結構化資料中與回答問題相關的文本和關係資訊，然後使用 LLM 代理遍歷半結構化資料並提取必要的資訊。我們的實驗結果證明了 PASemiQA 在來自不同領域的不同半結構化資料集上的有效性，展示了其提高半結構化資料問答系統準確性和可靠性的潛力。\n", "author": "Hansi Yang et.al.", "authors": "Hansi Yang, Qi Zhang, Wei Jiang, Jianguo Li", "id": "2502.21087v1", "paper_url": "http://arxiv.org/abs/2502.21087v1", "repo": "null"}}