{"2501.14673": {"publish_time": "2025-01-24", "title": "State Space Models for Extractive Summarization in Low Resource Scenarios", "paper_summary": "Extractive summarization involves selecting the most relevant sentences from\na text. Recently, researchers have focused on advancing methods to improve\nstate-of-the-art results in low-resource settings. Motivated by these\nadvancements, we propose the MPoincareSum method. This method applies the Mamba\nstate space model to generate the semantics of reviews and sentences, which are\nthen concatenated. A Poincare compression is used to select the most meaningful\nfeatures, followed by the application of a linear layer to predict sentence\nrelevance based on the corresponding review. Finally, we paraphrase the\nrelevant sentences to create the final summary. To evaluate the effectiveness\nof MPoincareSum, we conducted extensive experiments using the Amazon review\ndataset. The performance of the method was assessed using ROUGE scores. The\nexperimental results demonstrate that MPoincareSum outperforms several existing\napproaches in the literature", "paper_summary_zh": "萃取式摘要涉及從文本中選取最相關的句子。最近，研究人員專注於進步的方法，以改善低資源設定中的最先進結果。受到這些進展的激勵，我們提出 MPoincareSum 方法。此方法應用 Mamba 狀態空間模型來產生評論和句子的語義，然後將其串接。使用 Poincare 壓縮來選擇最有意義的特徵，然後應用線性層根據對應的評論預測句子相關性。最後，我們對相關句子進行改寫，以建立最終摘要。為了評估 MPoincareSum 的有效性，我們使用 Amazon 評論資料集進行了廣泛的實驗。使用 ROUGE 分數評估方法的效能。實驗結果表明，MPoincareSum 優於文獻中現有的幾種方法", "author": "Nisrine Ait Khayi et.al.", "authors": "Nisrine Ait Khayi", "id": "2501.14673v1", "paper_url": "http://arxiv.org/abs/2501.14673v1", "repo": "null"}}