{"2409.08797": {"publish_time": "2024-09-13", "title": "Exploring SSL Discrete Speech Features for Zipformer-based Contextual ASR", "paper_summary": "Self-supervised learning (SSL) based discrete speech representations are\nhighly compact and domain adaptable. In this paper, SSL discrete speech\nfeatures extracted from WavLM models are used as additional cross-utterance\nacoustic context features in Zipformer-Transducer ASR systems. The efficacy of\nreplacing Fbank features with discrete token features for modelling either\ncross-utterance contexts (from preceding and future segments), or current\nutterance's internal contexts alone, or both at the same time, are demonstrated\nthoroughly on the Gigaspeech 1000-hr corpus. The best Zipformer-Transducer\nsystem using discrete tokens based cross-utterance context features outperforms\nthe baseline using utterance internal context only with statistically\nsignificant word error rate (WER) reductions of 0.32% to 0.41% absolute (2.78%\nto 3.54% relative) on the dev and test data. The lowest published WER of 11.15%\nand 11.14% were obtained on the dev and test sets. Our work is open-source and\npublicly available at\nhttps://github.com/open-creator/icefall/tree/master/egs/gigaspeech/Context\\_ASR.", "paper_summary_zh": "基於自我監督學習 (SSL) 的離散語音表徵高度緊湊且具備領域適應性。本文使用從 WavLM 模型中萃取的 SSL 離散語音特徵，作為 Zipformer-Transducer ASR 系統中額外的跨 utterance 音響背景特徵。僅針對跨 utterance 背景（來自前段和後段）、或僅針對當前 utterance 的內部背景，或同時針對兩者建模，以離散代號特徵取代 Fbank 特徵的效能，已在 Gigaspeech 1000 小時語料庫上獲得徹底驗證。使用基於離散代號的跨 utterance 背景特徵的最佳 Zipformer-Transducer 系統，其效能優於僅使用 utterance 內部背景的基準，在開發和測試資料上，字元錯誤率 (WER) 絕對降低 0.32% 至 0.41%（相對降低 2.78% 至 3.54%），且具有統計顯著性。在開發和測試集上，獲得最低已發表的 WER，分別為 11.15% 和 11.14%。我們的作品是開源的，且可於 https://github.com/open-creator/icefall/tree/master/egs/gigaspeech/Context\\_ASR 公開取得。", "author": "Mingyu Cui et.al.", "authors": "Mingyu Cui, Yifan Yang, Jiajun Deng, Jiawen Kang, Shujie Hu, Tianzi Wang, Zhaoqing Li, Shiliang Zhang, Xie Chen, Xunying Liu", "id": "2409.08797v1", "paper_url": "http://arxiv.org/abs/2409.08797v1", "repo": "https://github.com/open-creator/icefall"}}