{"2411.09607": {"publish_time": "2024-11-14", "title": "Initial Nugget Evaluation Results for the TREC 2024 RAG Track with the AutoNuggetizer Framework", "paper_summary": "This report provides an initial look at partial results from the TREC 2024\nRetrieval-Augmented Generation (RAG) Track. We have identified RAG evaluation\nas a barrier to continued progress in information access (and more broadly,\nnatural language processing and artificial intelligence), and it is our hope\nthat we can contribute to tackling the many challenges in this space. The\ncentral hypothesis we explore in this work is that the nugget evaluation\nmethodology, originally developed for the TREC Question Answering Track in\n2003, provides a solid foundation for evaluating RAG systems. As such, our\nefforts have focused on \"refactoring\" this methodology, specifically applying\nlarge language models to both automatically create nuggets and to automatically\nassign nuggets to system answers. We call this the AutoNuggetizer framework.\nWithin the TREC setup, we are able to calibrate our fully automatic process\nagainst a manual process whereby nuggets are created by human assessors\nsemi-manually and then assigned manually to system answers. Based on initial\nresults across 21 topics from 45 runs, we observe a strong correlation between\nscores derived from a fully automatic nugget evaluation and a (mostly) manual\nnugget evaluation by human assessors. This suggests that our fully automatic\nevaluation process can be used to guide future iterations of RAG systems.", "paper_summary_zh": "這份報告提供了 TREC 2024 檢索增強生成 (RAG) 軌道的部分初始結果。我們已將 RAG 評估確定為資訊存取（更廣泛地說，自然語言處理和人工智慧）持續進展的障礙，我們希望我們能為解決這個領域的許多挑戰做出貢獻。我們在這項工作中探討的核心假設是，最初為 2003 年 TREC 問題解答軌道開發的核塊評估方法，可作為評估 RAG 系統的堅實基礎。因此，我們的努力專注於「重構」此方法，特別是將大型語言模型應用於自動建立核塊和自動將核塊指定給系統答案。我們稱之為 AutoNuggetizer 架構。在 TREC 設定中，我們能夠根據人工評估員半自動建立核塊，然後手動指定給系統答案的手動流程，校準我們的全自動流程。根據 45 次執行中 21 個主題的初始結果，我們觀察到從全自動核塊評估衍生的分數與人工評估員的（大多數）手動核塊評估之間存在強烈的相關性。這表明我們全自動評估流程可用於指導 RAG 系統的未來迭代。", "author": "Ronak Pradeep et.al.", "authors": "Ronak Pradeep, Nandan Thakur, Shivani Upadhyay, Daniel Campos, Nick Craswell, Jimmy Lin", "id": "2411.09607v1", "paper_url": "http://arxiv.org/abs/2411.09607v1", "repo": "null"}}