{"2412.21151": {"publish_time": "2024-12-30", "title": "PyG-SSL: A Graph Self-Supervised Learning Toolkit", "paper_summary": "Graph Self-Supervised Learning (SSL) has emerged as a pivotal area of\nresearch in recent years. By engaging in pretext tasks to learn the intricate\ntopological structures and properties of graphs using unlabeled data, these\ngraph SSL models achieve enhanced performance, improved generalization, and\nheightened robustness. Despite the remarkable achievements of these graph SSL\nmethods, their current implementation poses significant challenges for\nbeginners and practitioners due to the complex nature of graph structures,\ninconsistent evaluation metrics, and concerns regarding reproducibility hinder\nfurther progress in this field. Recognizing the growing interest within the\nresearch community, there is an urgent need for a comprehensive,\nbeginner-friendly, and accessible toolkit consisting of the most representative\ngraph SSL algorithms. To address these challenges, we present a Graph SSL\ntoolkit named PyG-SSL, which is built upon PyTorch and is compatible with\nvarious deep learning and scientific computing backends. Within the toolkit, we\noffer a unified framework encompassing dataset loading, hyper-parameter\nconfiguration, model training, and comprehensive performance evaluation for\ndiverse downstream tasks. Moreover, we provide beginner-friendly tutorials and\nthe best hyper-parameters of each graph SSL algorithm on different graph\ndatasets, facilitating the reproduction of results. The GitHub repository of\nthe library is https://github.com/iDEA-iSAIL-Lab-UIUC/pyg-ssl.", "paper_summary_zh": "圖形自監督學習 (SSL) 已成為近年研究中的關鍵領域。透過參與預設任務，利用未標記資料學習圖形的複雜拓撲結構和屬性，這些圖形 SSL 模型可提升效能、改善概化，並增強穩健性。儘管這些圖形 SSL 方法已取得顯著成就，但由於圖形結構的複雜性、不一致的評估指標，以及對再現性的疑慮，使得目前實作對初學者和實務工作者而言具有重大挑戰，阻礙了此領域的進一步進展。鑑於研究社群中日益增長的需求，迫切需要一個全面、對初學者友善且容易取得的工具包，其中包含最具代表性的圖形 SSL 演算法。為了應對這些挑戰，我們提出一個名為 PyG-SSL 的圖形 SSL 工具包，它建立在 PyTorch 之上，並與各種深度學習和科學運算後端相容。在工具包中，我們提供一個統一的架構，涵蓋資料集載入、超參數設定、模型訓練，以及對各種下游任務進行全面的效能評估。此外，我們提供對初學者友善的教學課程，以及每種圖形 SSL 演算法在不同圖形資料集上的最佳超參數，以利於結果的重現。此程式庫的 GitHub 儲存庫為 https://github.com/iDEA-iSAIL-Lab-UIUC/pyg-ssl。", "author": "Lecheng Zheng et.al.", "authors": "Lecheng Zheng, Baoyu Jing, Zihao Li, Zhichen Zeng, Tianxin Wei, Mengting Ai, Xinrui He, Lihui Liu, Dongqi Fu, Jiaxuan You, Hanghang Tong, Jingrui He", "id": "2412.21151v1", "paper_url": "http://arxiv.org/abs/2412.21151v1", "repo": "https://github.com/idea-isail-lab-uiuc/pyg-ssl"}}