{"2501.09004": {"publish_time": "2025-01-15", "title": "Aegis2.0: A Diverse AI Safety Dataset and Risks Taxonomy for Alignment of LLM Guardrails", "paper_summary": "As Large Language Models (LLMs) and generative AI become increasingly\nwidespread, concerns about content safety have grown in parallel. Currently,\nthere is a clear lack of high-quality, human-annotated datasets that address\nthe full spectrum of LLM-related safety risks and are usable for commercial\napplications. To bridge this gap, we propose a comprehensive and adaptable\ntaxonomy for categorizing safety risks, structured into 12 top-level hazard\ncategories with an extension to 9 fine-grained subcategories. This taxonomy is\ndesigned to meet the diverse requirements of downstream users, offering more\ngranular and flexible tools for managing various risk types. Using a hybrid\ndata generation pipeline that combines human annotations with a multi-LLM\n\"jury\" system to assess the safety of responses, we obtain Aegis 2.0, a\ncarefully curated collection of 34,248 samples of human-LLM interactions,\nannotated according to our proposed taxonomy. To validate its effectiveness, we\ndemonstrate that several lightweight models, trained using parameter-efficient\ntechniques on Aegis 2.0, achieve performance competitive with leading safety\nmodels fully fine-tuned on much larger, non-commercial datasets. In addition,\nwe introduce a novel training blend that combines safety with topic following\ndata.This approach enhances the adaptability of guard models, enabling them to\ngeneralize to new risk categories defined during inference. We plan to\nopen-source Aegis 2.0 data and models to the research community to aid in the\nsafety guardrailing of LLMs.", "paper_summary_zh": "隨著大型語言模型 (LLM) 和生成式 AI 日益普及，內容安全方面的擔憂也同步增加。目前，顯著缺乏高品質、人工標註的資料集來解決與 LLM 相關的安全風險全貌，且可供商業應用使用。為了彌補這個差距，我們提出了一個全面且適應性強的分類法，用於分類安全風險，架構成 12 個頂層危害類別，並延伸到 9 個細緻的子類別。此分類法旨在滿足下游使用者的多元需求，提供更細緻且彈性的工具來管理各種風險類型。我們使用結合人工標註和多 LLM「評審團」系統的混合資料產生流程來評估回應的安全性，取得 Aegis 2.0，一個經過仔細整理、包含 34,248 個範例的人類 LLM 互動集合，並根據我們提出的分類法進行標註。為了驗證其有效性，我們示範了數個輕量級模型，使用參數有效技術在 Aegis 2.0 上訓練，其效能與在更大、非商業資料集上進行微調的領先安全模型不相上下。此外，我們引進一種新穎的訓練混合，結合安全性與主題追蹤資料。此方法增強了防護模型的適應性，讓它們能夠在推論期間概化到新的風險類別。我們計畫將 Aegis 2.0 資料和模型開源給研究社群，以協助 LLM 的安全防護。", "author": "Shaona Ghosh et.al.", "authors": "Shaona Ghosh, Prasoon Varshney, Makesh Narsimhan Sreedhar, Aishwarya Padmakumar, Traian Rebedea, Jibin Rajan Varghese, Christopher Parisien", "id": "2501.09004v1", "paper_url": "http://arxiv.org/abs/2501.09004v1", "repo": "null"}}