{"2406.17764": {"publish_time": "2024-06-25", "title": "BMIKE-53: Investigating Cross-Lingual Knowledge Editing with In-Context Learning", "paper_summary": "Large language models (LLMs) possess extensive parametric knowledge, but this\nknowledge is difficult to update with new information because retraining is\nvery expensive and infeasible for closed-source models. Knowledge editing (KE)\nhas emerged as a viable solution for updating the knowledge of LLMs without\ncompromising their overall performance. On-the-fly KE methods, inspired by\nin-context learning (ICL), have shown great promise and allow LLMs to be\ntreated as black boxes. In the past, KE was primarily employed in English\ncontexts, whereas the potential for cross-lingual KE in current English-centric\nLLMs has not been fully explored. To foster more research in this direction, we\nintroduce the BMIKE-53 benchmark for evaluating cross-lingual KE on 53 diverse\nlanguages across three KE task types. We also propose a gradient-free KE method\ncalled Multilingual In-context Knowledge Editing (MIKE) and evaluate it on\nBMIKE-53. Our evaluation focuses on cross-lingual knowledge transfer in terms\nof reliability, generality, locality, and portability, offering valuable\ninsights and a framework for future research in cross-lingual KE. Our code and\ndata are publicly accessible via the anonymous repository at\nhttps://anonymous.4open.science/r/MIKE.", "paper_summary_zh": "大型語言模型 (LLM) 擁有廣泛的參數化知識，但由於重新訓練非常昂貴且對閉源模型不可行，因此難以使用新資訊更新此知識。知識編輯 (KE) 已成為在不影響 LLM 整體效能的情況下更新其知識的可行解決方案。受情境學習 (ICL) 啟發的即時 KE 方法已展現極大潛力，並允許將 LLM 視為黑盒子。過去，KE 主要用於英語情境，而目前以英語為中心的 LLM 中跨語言 KE 的潛力尚未得到充分探索。為了促進更多這方面的研究，我們引入了 BMIKE-53 基準，用於評估 53 種不同語言在三種 KE 任務類型中的跨語言 KE。我們還提出了一種稱為多語言情境知識編輯 (MIKE) 的無梯度 KE 方法，並在 BMIKE-53 上對其進行評估。我們的評估重點在於跨語言知識轉移的可靠性、普遍性、局部性和可移植性，為跨語言 KE 的未來研究提供有價值的見解和框架。我們的程式碼和資料可透過 https://anonymous.4open.science/r/MIKE 上的匿名儲存庫公開存取。", "author": "Ercong Nie et.al.", "authors": "Ercong Nie, Bo Shao, Zifeng Ding, Mingyang Wang, Helmut Schmid, Hinrich Schütze", "id": "2406.17764v1", "paper_url": "http://arxiv.org/abs/2406.17764v1", "repo": "null"}}