{"2407.18517": {"publish_time": "2024-07-26", "title": "SLIM: Style-Linguistics Mismatch Model for Generalized Audio Deepfake Detection", "paper_summary": "Audio deepfake detection (ADD) is crucial to combat the misuse of speech\nsynthesized from generative AI models. Existing ADD models suffer from\ngeneralization issues, with a large performance discrepancy between in-domain\nand out-of-domain data. Moreover, the black-box nature of existing models\nlimits their use in real-world scenarios, where explanations are required for\nmodel decisions. To alleviate these issues, we introduce a new ADD model that\nexplicitly uses the StyleLInguistics Mismatch (SLIM) in fake speech to separate\nthem from real speech. SLIM first employs self-supervised pretraining on only\nreal samples to learn the style-linguistics dependency in the real class. The\nlearned features are then used in complement with standard pretrained acoustic\nfeatures (e.g., Wav2vec) to learn a classifier on the real and fake classes.\nWhen the feature encoders are frozen, SLIM outperforms benchmark methods on\nout-of-domain datasets while achieving competitive results on in-domain data.\nThe features learned by SLIM allow us to quantify the (mis)match between style\nand linguistic content in a sample, hence facilitating an explanation of the\nmodel decision.", "paper_summary_zh": "音訊深度偽造偵測 (ADD) 對於打擊濫用由生成式 AI 模型合成的語音至關重要。現有的 ADD 模型有泛化問題，在網域內和網域外資料之間的效能差異很大。此外，現有模型的黑箱性質限制了它們在現實世界中的應用，因為在現實世界中需要對模型決策進行解釋。為了緩解這些問題，我們引入了一個新的 ADD 模型，它明確地利用了偽造語音中的風格語言不匹配 (SLIM) 來將其與真實語音分開。SLIM 首先僅在真實樣本上採用自我監督預訓練，以學習真實類別中的風格語言依賴性。然後將學習到的特徵與標準預訓練聲學特徵（例如 Wav2vec）一起使用，以學習真實和偽造類別的分類器。當特徵編碼器被凍結時，SLIM 在網域外資料集上優於基準方法，同時在網域內資料上取得了競爭力的結果。SLIM 學習到的特徵讓我們能夠量化樣本中風格和語言內容之間的（不）匹配，從而有助於解釋模型決策。", "author": "Yi Zhu et.al.", "authors": "Yi Zhu, Surya Koppisetti, Trang Tran, Gaurav Bharaj", "id": "2407.18517v1", "paper_url": "http://arxiv.org/abs/2407.18517v1", "repo": "null"}}