{"2407.05975": {"publish_time": "2024-07-08", "title": "LLaMAX: Scaling Linguistic Horizons of LLM by Enhancing Translation Capabilities Beyond 100 Languages", "paper_summary": "Large Language Models~(LLMs) demonstrate remarkable translation capabilities\nin high-resource language tasks, yet their performance in low-resource\nlanguages is hindered by insufficient multilingual data during pre-training. To\naddress this, we dedicate 35,000 A100-SXM4-80GB GPU hours in conducting\nextensive multilingual continual pre-training on the LLaMA series models,\nenabling translation support across more than 100 languages. Through a\ncomprehensive analysis of training strategies, such as vocabulary expansion and\ndata augmentation, we develop LLaMAX. Remarkably, without sacrificing its\ngeneralization ability, LLaMAX achieves significantly higher translation\nperformance compared to existing open-source LLMs~(by more than 10 spBLEU\npoints) and performs on-par with specialized translation model~(M2M-100-12B) on\nthe Flores-101 benchmark. Extensive experiments indicate that LLaMAX can serve\nas a robust multilingual foundation model. The\ncode~\\footnote{\\url{https://github.com/CONE-MT/LLaMAX/.}} and\nmodels~\\footnote{\\url{https://huggingface.co/LLaMAX/.}} are publicly available.", "paper_summary_zh": "大型語言模型~(LLM) 在高資源語言任務中表現出卓越的翻譯能力，但它們在低資源語言中的表現受到預訓練期間多語言數據不足的阻礙。為了解決這個問題，我們投入 35,000 小時的 A100-SXM4-80GB GPU 時間，對 LLaMA 系列模型進行廣泛的多語言持續預訓練，支援超過 100 種語言的翻譯。透過對訓練策略進行全面分析，例如詞彙擴充和資料擴充，我們開發了 LLaMAX。值得注意的是，LLaMAX 在不犧牲其泛化能力的情況下，與現有的開放原始碼 LLM 相比，實現了顯著更高的翻譯性能~(高出 10 個 spBLEU 點)，並在 Flores-101 基準上與專業翻譯模型~(M2M-100-12B) 相當。廣泛的實驗表明，LLaMAX 可以作為一個強大的多語言基礎模型。程式碼~\\footnote{\\url{https://github.com/CONE-MT/LLaMAX/.}} 和模型~\\footnote{\\url{https://huggingface.co/LLaMAX/.}} 皆已公開。", "author": "Yinquan Lu et.al.", "authors": "Yinquan Lu, Wenhao Zhu, Lei Li, Yu Qiao, Fei Yuan", "id": "2407.05975v1", "paper_url": "http://arxiv.org/abs/2407.05975v1", "repo": "https://github.com/cone-mt/llamax"}}