{"2407.04221": {"publish_time": "2024-07-05", "title": "Autoverse: An Evolvable Game Langugage for Learning Robust Embodied Agents", "paper_summary": "We introduce Autoverse, an evolvable, domain-specific language for\nsingle-player 2D grid-based games, and demonstrate its use as a scalable\ntraining ground for Open-Ended Learning (OEL) algorithms. Autoverse uses\ncellular-automaton-like rewrite rules to describe game mechanics, allowing it\nto express various game environments (e.g. mazes, dungeons, sokoban puzzles)\nthat are popular testbeds for Reinforcement Learning (RL) agents. Each rewrite\nrule can be expressed as a series of simple convolutions, allowing for\nenvironments to be parallelized on the GPU, thereby drastically accelerating RL\ntraining. Using Autoverse, we propose jump-starting open-ended learning by\nimitation learning from search. In such an approach, we first evolve Autoverse\nenvironments (their rules and initial map topology) to maximize the number of\niterations required by greedy tree search to discover a new best solution,\nproducing a curriculum of increasingly complex environments and playtraces. We\nthen distill these expert playtraces into a neural-network-based policy using\nimitation learning. Finally, we use the learned policy as a starting point for\nopen-ended RL, where new training environments are continually evolved to\nmaximize the RL player agent's value function error (a proxy for its regret, or\nthe learnability of generated environments), finding that this approach\nimproves the performance and generality of resultant player agents.", "paper_summary_zh": "<paragraph>我們介紹 Autoverse，這是一種可演化的、特定領域的語言，適用於單人 2D 網格遊戲，並展示其作為開放式學習 (OEL) 演算法的可擴充訓練場地的用途。Autoverse 使用類似於細胞自動機的重寫規則來描述遊戲機制，使其能夠表達各種遊戲環境（例如迷宮、地下城、倉庫番拼圖），這些環境是強化學習 (RL) 代理的熱門測試平台。每個重寫規則都可以表示為一系列簡單的卷積，允許在 GPU 上並行化環境，從而大幅加速 RL 訓練。使用 Autoverse，我們提出通過搜尋中的模仿學習來啟動開放式學習。在這種方法中，我們首先演化 Autoverse 環境（其規則和初始地圖拓撲）以最大化貪婪樹搜尋發現新最佳解所需的迭代次數，產生越來越複雜的環境和播放軌跡的課程。然後，我們使用模仿學習將這些專家播放軌跡提煉成基於神經網路的策略。最後，我們使用學習到的策略作為開放式 RL 的起點，其中不斷演化新的訓練環境以最大化 RL 玩家代理的價值函數誤差（其遺憾的代理，或生成環境的可學習性），發現這種方法可以改善結果玩家代理的效能和普遍性。</paragraph>", "author": "Sam Earle et.al.", "authors": "Sam Earle, Julian Togelius", "id": "2407.04221v1", "paper_url": "http://arxiv.org/abs/2407.04221v1", "repo": "null"}}