{"2406.06401": {"publish_time": "2024-06-10", "title": "INTERSPEECH 2009 Emotion Challenge Revisited: Benchmarking 15 Years of Progress in Speech Emotion Recognition", "paper_summary": "We revisit the INTERSPEECH 2009 Emotion Challenge -- the first ever speech\nemotion recognition (SER) challenge -- and evaluate a series of deep learning\nmodels that are representative of the major advances in SER research in the\ntime since then. We start by training each model using a fixed set of\nhyperparameters, and further fine-tune the best-performing models of that\ninitial setup with a grid search. Results are always reported on the official\ntest set with a separate validation set only used for early stopping. Most\nmodels score below or close to the official baseline, while they marginally\noutperform the original challenge winners after hyperparameter tuning. Our work\nillustrates that, despite recent progress, FAU-AIBO remains a very challenging\nbenchmark. An interesting corollary is that newer methods do not consistently\noutperform older ones, showing that progress towards `solving' SER is not\nnecessarily monotonic.", "paper_summary_zh": "我們重新探討 INTERSPEECH 2009 情緒挑戰 -- 第一個語音情緒辨識 (SER) 挑戰 -- 並評估一系列深度學習模型，這些模型代表自那時以來 SER 研究的主要進展。我們首先使用一組固定的超參數訓練每個模型，並使用網格搜尋進一步微調該初始設定中表現最佳的模型。結果總是報告在官方測試集上，並只使用單獨的驗證集進行早期停止。大多數模型的分數低於或接近官方基準，而在超參數調整後，它們的表現略優於原始挑戰賽的獲勝者。我們的研究說明，儘管有近期的進展，FAU-AIBO 仍然是一個非常具有挑戰性的基準。一個有趣的推論是，較新的方法並非始終優於較舊的方法，這表明朝向「解決」SER 的進展不一定會單調。", "author": "Andreas Triantafyllopoulos et.al.", "authors": "Andreas Triantafyllopoulos, Anton Batliner, Simon Rampp, Manuel Milling, Björn Schuller", "id": "2406.06401v1", "paper_url": "http://arxiv.org/abs/2406.06401v1", "repo": "null"}}