{"2302.01104": {"publish_time": "2023-02-02", "title": "LesionAid: Vision Transformers-based Skin Lesion Generation and Classification", "paper_summary": "Skin cancer is one of the most prevalent forms of human cancer. It is\nrecognized mainly visually, beginning with clinical screening and continuing\nwith the dermoscopic examination, histological assessment, and specimen\ncollection. Deep convolutional neural networks (CNNs) perform highly segregated\nand potentially universal tasks against a classified finegrained object. This\nresearch proposes a novel multi-class prediction framework that classifies skin\nlesions based on ViT and ViTGAN. Vision transformers-based GANs (Generative\nAdversarial Networks) are utilized to tackle the class imbalance. The framework\nconsists of four main phases: ViTGANs, Image processing, and explainable AI.\nPhase 1 consists of generating synthetic images to balance all the classes in\nthe dataset. Phase 2 consists of applying different data augmentation\ntechniques and morphological operations to increase the size of the data.\nPhases 3 & 4 involve developing a ViT model for edge computing systems that can\nidentify patterns and categorize skin lesions from the user's skin visible in\nthe image. In phase 3, after classifying the lesions into the desired class\nwith ViT, we will use explainable AI (XAI) that leads to more explainable\nresults (using activation maps, etc.) while ensuring high predictive accuracy.\nReal-time images of skin diseases can capture by a doctor or a patient using\nthe camera of a mobile application to perform an early examination and\ndetermine the cause of the skin lesion. The whole framework is compared with\nthe existing frameworks for skin lesion detection.", "paper_summary_zh": "皮膚癌是人類最普遍的癌症類型之一。它的識別主要依賴視覺，從臨床篩檢開始，接著是皮膚鏡檢查、組織學評估，以及檢體收集。深度卷積神經網路 (CNN) 可針對分類的細粒度物件執行高度區隔且潛在通用的任務。本研究提出一個新穎的多類別預測架構，它以 ViT 和 ViTGAN 為基礎對皮膚病灶進行分類。基於視覺轉換器的 GAN（生成對抗網路）用於解決類別不平衡問題。此架構包含四個主要階段：ViTGAN、影像處理和可解釋 AI。第一階段包括產生合成影像，以平衡資料集中的所有類別。第二階段包括應用不同的資料擴充技術和形態運算，以增加資料大小。第三和第四階段涉及開發適用於邊緣運算系統的 ViT 模型，該模型可以識別圖案，並對影像中用戶皮膚可見的皮膚病灶進行分類。在第三階段，在使用 ViT 將病灶分類到所需的類別後，我們將使用可解釋 AI (XAI)，它會產生更具可解釋性的結果（使用啟用圖等），同時確保高預測準確度。皮膚疾病的即時影像可以用行動應用程式的相機由醫生或患者擷取，以執行早期檢查並確定皮膚病灶的原因。整個架構與現有的皮膚病灶偵測架構進行比較。", "author": "Ghanta Sai Krishna et.al.", "authors": "Ghanta Sai Krishna, Kundrapu Supriya, Mallikharjuna Rao K, Meetiksha Sorgile", "id": "2302.01104v1", "paper_url": "http://arxiv.org/abs/2302.01104v1", "repo": "null"}}