{"2406.19568": {"publish_time": "2024-06-27", "title": "What Matters in Detecting AI-Generated Videos like Sora?", "paper_summary": "Recent advancements in diffusion-based video generation have showcased\nremarkable results, yet the gap between synthetic and real-world videos remains\nunder-explored. In this study, we examine this gap from three fundamental\nperspectives: appearance, motion, and geometry, comparing real-world videos\nwith those generated by a state-of-the-art AI model, Stable Video Diffusion. To\nachieve this, we train three classifiers using 3D convolutional networks, each\ntargeting distinct aspects: vision foundation model features for appearance,\noptical flow for motion, and monocular depth for geometry. Each classifier\nexhibits strong performance in fake video detection, both qualitatively and\nquantitatively. This indicates that AI-generated videos are still easily\ndetectable, and a significant gap between real and fake videos persists.\nFurthermore, utilizing the Grad-CAM, we pinpoint systematic failures of\nAI-generated videos in appearance, motion, and geometry. Finally, we propose an\nEnsemble-of-Experts model that integrates appearance, optical flow, and depth\ninformation for fake video detection, resulting in enhanced robustness and\ngeneralization ability. Our model is capable of detecting videos generated by\nSora with high accuracy, even without exposure to any Sora videos during\ntraining. This suggests that the gap between real and fake videos can be\ngeneralized across various video generative models. Project page:\nhttps://justin-crchang.github.io/3DCNNDetection.github.io/", "paper_summary_zh": "近期在基於擴散的影片生成方面的進展展現了顯著的成果，但合成影片與真實影片之間的差距仍有待探索。在這項研究中，我們從三個基本觀點探討這個差距：外觀、動作和幾何，比較真實影片與由最先進的 AI 模型 Stable Video Diffusion 所生成的影片。為此，我們使用 3D 卷積網路訓練三個分類器，每個分類器針對不同的面向：外觀的視覺基礎模型特徵、動作的光流，以及幾何的單眼深度。每個分類器在假影片偵測中都展現出強勁的表現，無論在質量上或量化上皆然。這表示 AI 生成的影片仍然很容易被偵測出來，而且真實影片與假影片之間仍有顯著的差距。此外，利用 Grad-CAM，我們精確指出 AI 生成的影片在外觀、動作和幾何上的系統性失敗。最後，我們提出一個專家整合模型，整合外觀、光流和深度資訊進行假影片偵測，進而增強穩健性和泛化能力。我們的模型能夠偵測由 Sora 生成的影片，準確率很高，即使在訓練過程中沒有接觸過任何 Sora 影片。這表示真實影片與假影片之間的差距可以泛化到各種影片生成模型。專案頁面：https://justin-crchang.github.io/3DCNNDetection.github.io/", "author": "Chirui Chang et.al.", "authors": "Chirui Chang, Zhengzhe Liu, Xiaoyang Lyu, Xiaojuan Qi", "id": "2406.19568v1", "paper_url": "http://arxiv.org/abs/2406.19568v1", "repo": "null"}}