{"2404.15549": {"publish_time": "2024-04-23", "title": "PRISM: Patient Records Interpretation for Semantic Clinical Trial Matching using Large Language Models", "paper_summary": "Clinical trial matching is the task of identifying trials for which patients\nmay be potentially eligible. Typically, this task is labor-intensive and\nrequires detailed verification of patient electronic health records (EHRs)\nagainst the stringent inclusion and exclusion criteria of clinical trials. This\nprocess is manual, time-intensive, and challenging to scale up, resulting in\nmany patients missing out on potential therapeutic options. Recent advancements\nin Large Language Models (LLMs) have made automating patient-trial matching\npossible, as shown in multiple concurrent research studies. However, the\ncurrent approaches are confined to constrained, often synthetic datasets that\ndo not adequately mirror the complexities encountered in real-world medical\ndata. In this study, we present the first, end-to-end large-scale empirical\nevaluation of clinical trial matching using real-world EHRs. Our study\nshowcases the capability of LLMs to accurately match patients with appropriate\nclinical trials. We perform experiments with proprietary LLMs, including GPT-4\nand GPT-3.5, as well as our custom fine-tuned model called OncoLLM and show\nthat OncoLLM, despite its significantly smaller size, not only outperforms\nGPT-3.5 but also matches the performance of qualified medical doctors. All\nexperiments were carried out on real-world EHRs that include clinical notes and\navailable clinical trials from a single cancer center in the United States.", "paper_summary_zh": "", "author": "Shashi Kant Gupta et.al.", "authors": "Shashi Kant Gupta,Aditya Basu,Mauro Nievas,Jerrin Thomas,Nathan Wolfrath,Adhitya Ramamurthi,Bradley Taylor,Anai N. Kothari,Regina Schwind,Therica M. Miller,Sorena Nadaf-Rahrov,Yanshan Wang,Hrituraj Singh", "id": "2404.15549v2", "paper_url": "http://arxiv.org/abs/2404.15549v2", "repo": "null"}}