{"2406.01314": {"publish_time": "2024-06-03", "title": "Compute-Efficient Medical Image Classification with Softmax-Free Transformers and Sequence Normalization", "paper_summary": "The Transformer model has been pivotal in advancing fields such as natural\nlanguage processing, speech recognition, and computer vision. However, a\ncritical limitation of this model is its quadratic computational and memory\ncomplexity relative to the sequence length, which constrains its application to\nlonger sequences. This is especially crucial in medical imaging where\nhigh-resolution images can reach gigapixel scale. Efforts to address this issue\nhave predominantely focused on complex techniques, such as decomposing the\nsoftmax operation integral to the Transformer's architecture. This paper\naddresses this quadratic computational complexity of Transformer models and\nintroduces a remarkably simple and effective method that circumvents this issue\nby eliminating the softmax function from the attention mechanism and adopting a\nsequence normalization technique for the key, query, and value tokens. Coupled\nwith a reordering of matrix multiplications this approach reduces the memory-\nand compute complexity to a linear scale. We evaluate this approach across\nvarious medical imaging datasets comprising fundoscopic, dermascopic,\nradiologic and histologic imaging data. Our findings highlight that these\nmodels exhibit a comparable performance to traditional transformer models,\nwhile efficiently handling longer sequences.", "paper_summary_zh": "Transformer 模型在自然語言處理、語音辨識和電腦視覺等領域的進展中發揮了關鍵作用。然而，此模型的一個重大限制是其二次計算和記憶體複雜度相對於序列長度，這限制了其在較長序列中的應用。這在醫療影像中尤其重要，其中高解析度影像可以達到吉像素等級。解決此問題的努力主要集中在複雜技術上，例如分解 Transformer 架構中不可或缺的 softmax 運算。本文探討了 Transformer 模型的二次計算複雜度，並介紹了一種非常簡單且有效的方法，透過從注意力機制中移除 softmax 函數並採用關鍵、查詢和值符號的序列正規化技術來解決此問題。結合矩陣乘法的重新排序，此方法將記憶體和運算複雜度降低到線性等級。我們在包含眼底鏡、皮膚鏡、放射學和組織學影像資料的各種醫學影像資料集上評估此方法。我們的發現強調，這些模型表現出與傳統 Transformer 模型相當的效能，同時有效地處理較長的序列。", "author": "Firas Khader et.al.", "authors": "Firas Khader, Omar S. M. El Nahhas, Tianyu Han, Gustav Müller-Franzes, Sven Nebelung, Jakob Nikolas Kather, Daniel Truhn", "id": "2406.01314v1", "paper_url": "http://arxiv.org/abs/2406.01314v1", "repo": "null"}}