{"2410.04585": {"publish_time": "2024-10-06", "title": "Reasoning-Enhanced Healthcare Predictions with Knowledge Graph Community Retrieval", "paper_summary": "Large language models (LLMs) have demonstrated significant potential in\nclinical decision support. Yet LLMs still suffer from hallucinations and lack\nfine-grained contextual medical knowledge, limiting their high-stake healthcare\napplications such as clinical diagnosis. Traditional retrieval-augmented\ngeneration (RAG) methods attempt to address these limitations but frequently\nretrieve sparse or irrelevant information, undermining prediction accuracy. We\nintroduce KARE, a novel framework that integrates knowledge graph (KG)\ncommunity-level retrieval with LLM reasoning to enhance healthcare predictions.\nKARE constructs a comprehensive multi-source KG by integrating biomedical\ndatabases, clinical literature, and LLM-generated insights, and organizes it\nusing hierarchical graph community detection and summarization for precise and\ncontextually relevant information retrieval. Our key innovations include: (1) a\ndense medical knowledge structuring approach enabling accurate retrieval of\nrelevant information; (2) a dynamic knowledge retrieval mechanism that enriches\npatient contexts with focused, multi-faceted medical insights; and (3) a\nreasoning-enhanced prediction framework that leverages these enriched contexts\nto produce both accurate and interpretable clinical predictions. Extensive\nexperiments demonstrate that KARE outperforms leading models by up to\n10.8-15.0% on MIMIC-III and 12.6-12.7% on MIMIC-IV for mortality and\nreadmission predictions. In addition to its impressive prediction accuracy, our\nframework leverages the reasoning capabilities of LLMs, enhancing the\ntrustworthiness of clinical predictions.", "paper_summary_zh": "大型語言模型 (LLM) 已在臨床決策支援中展現出顯著的潛力。然而，LLM 仍有幻覺且缺乏細緻的背景醫療知識，限制了它們在高風險醫療保健應用中的使用，例如臨床診斷。傳統的檢索增強生成 (RAG) 方法試圖解決這些限制，但經常檢索稀疏或無關的資訊，損害預測準確度。我們引入了 KARE，這是一個新穎的架構，整合了知識圖譜 (KG) 社群層級檢索與 LLM 推理，以增強醫療保健預測。KARE 透過整合生物醫學資料庫、臨床文獻和 LLM 生成的見解，建構了一個全面的多來源 KG，並使用階層式圖形社群偵測和摘要進行組織，以進行精確且與背景相關的資訊檢索。我們的關鍵創新包括：(1) 一種密集的醫療知識結構化方法，能夠準確檢索相關資訊；(2) 一種動態知識檢索機制，它使用有焦點、多面向的醫療見解來豐富患者背景；以及 (3) 一個推理增強預測架構，它利用這些豐富的背景來產生準確且可解釋的臨床預測。廣泛的實驗證明，KARE 在 MIMIC-III 上的死亡率和再入院預測中比領先模型高出 10.8-15.0%，在 MIMIC-IV 上高出 12.6-12.7%。除了令人印象深刻的預測準確度外，我們的架構還利用了 LLM 的推理能力，增強了臨床預測的可信度。", "author": "Pengcheng Jiang et.al.", "authors": "Pengcheng Jiang, Cao Xiao, Minhao Jiang, Parminder Bhatia, Taha Kass-Hout, Jimeng Sun, Jiawei Han", "id": "2410.04585v1", "paper_url": "http://arxiv.org/abs/2410.04585v1", "repo": "null"}}