{"2409.05573": {"publish_time": "2024-09-09", "title": "Learning to Model Graph Structural Information on MLPs via Graph Structure Self-Contrasting", "paper_summary": "Recent years have witnessed great success in handling graph-related tasks\nwith Graph Neural Networks (GNNs). However, most existing GNNs are based on\nmessage passing to perform feature aggregation and transformation, where the\nstructural information is explicitly involved in the forward propagation by\ncoupling with node features through graph convolution at each layer. As a\nresult, subtle feature noise or structure perturbation may cause severe error\npropagation, resulting in extremely poor robustness. In this paper, we rethink\nthe roles played by graph structural information in graph data training and\nidentify that message passing is not the only path to modeling structural\ninformation. Inspired by this, we propose a simple but effective Graph\nStructure Self-Contrasting (GSSC) framework that learns graph structural\ninformation without message passing. The proposed framework is based purely on\nMulti-Layer Perceptrons (MLPs), where the structural information is only\nimplicitly incorporated as prior knowledge to guide the computation of\nsupervision signals, substituting the explicit message propagation as in GNNs.\nSpecifically, it first applies structural sparsification to remove potentially\nuninformative or noisy edges in the neighborhood, and then performs structural\nself-contrasting in the sparsified neighborhood to learn robust node\nrepresentations. Finally, structural sparsification and self-contrasting are\nformulated as a bi-level optimization problem and solved in a unified\nframework. Extensive experiments have qualitatively and quantitatively\ndemonstrated that the GSSC framework can produce truly encouraging performance\nwith better generalization and robustness than other leading competitors.", "paper_summary_zh": "近年来，利用图神经网络 (GNN) 处理与图相关的任务取得了巨大的成功。然而，大多数现有的 GNN 都基于消息传递来执行特征聚合和转换，其中结构信息通过在每一层通过图卷积与节点特征耦合而明确地参与前向传播。因此，细微的特征噪声或结构扰动可能会导致严重的错误传播，从而导致极差的鲁棒性。在本文中，我们重新思考图结构信息在图数据训练中所扮演的角色，并确定消息传递并不是建模结构信息的唯一途径。受此启发，我们提出了一种简单但有效的图结构自对比 (GSSC) 框架，该框架可以在不进行消息传递的情况下学习图结构信息。所提出的框架完全基于多层感知器 (MLP)，其中结构信息仅作为先验知识隐式合并，以指导监督信号的计算，从而取代了 GNN 中明确的消息传播。具体来说，它首先应用结构稀疏化以去除邻域中潜在的无信息或有噪声的边，然后在稀疏化邻域中执行结构自对比以学习鲁棒的节点表示。最后，结构稀疏化和自对比被表述为一个双层优化问题，并在一个统一的框架中求解。大量实验已经定性和定量地证明，GSSC 框架可以产生真正令人鼓舞的性能，并且比其他领先的竞争对手具有更好的泛化性和鲁棒性。", "author": "Lirong Wu et.al.", "authors": "Lirong Wu, Haitao Lin, Guojiang Zhao, Cheng Tan, Stan Z. Li", "id": "2409.05573v1", "paper_url": "http://arxiv.org/abs/2409.05573v1", "repo": "null"}}