{"2412.06289": {"publish_time": "2024-12-09", "title": "S$^{2}$FT: Efficient, Scalable and Generalizable LLM Fine-tuning by Structured Sparsity", "paper_summary": "Current PEFT methods for LLMs can achieve either high quality, efficient\ntraining, or scalable serving, but not all three simultaneously. To address\nthis limitation, we investigate sparse fine-tuning and observe a remarkable\nimprovement in generalization ability. Utilizing this key insight, we propose a\nfamily of Structured Sparse Fine-Tuning (S$^{2}$FT) methods for LLMs, which\nconcurrently achieve state-of-the-art fine-tuning performance, training\nefficiency, and inference scalability. S$^{2}$FT accomplishes this by\n\"selecting sparsely and computing densely\". It selects a few heads and channels\nin the MHA and FFN modules for each Transformer block, respectively. Next, it\nco-permutes weight matrices on both sides of the coupled structures in LLMs to\nconnect the selected components in each layer into a dense submatrix. Finally,\nS$^{2}$FT performs in-place gradient updates on all submatrices. Through\ntheoretical analysis and empirical results, our method prevents overfitting and\nforgetting, delivers SOTA performance on both commonsense and arithmetic\nreasoning with 4.6% and 1.3% average improvements compared to LoRA, and\nsurpasses full FT by 11.5% when generalizing to various domains after\ninstruction tuning. Using our partial backpropagation algorithm, S$^{2}$FT\nsaves training memory up to 3$\\times$ and improves latency by 1.5-2.7$\\times$\ncompared to full FT, while delivering an average 10% improvement over LoRA on\nboth metrics. We further demonstrate that the weight updates in S$^{2}$FT can\nbe decoupled into adapters, enabling effective fusion, fast switch, and\nefficient parallelism for serving multiple fine-tuned models.", "paper_summary_zh": "目前用於 LLM 的 PEFT 方法可實現高品質、高效訓練或可擴充服務，但無法同時實現這三項。為了解決這個限制，我們探討稀疏微調，並觀察到泛化能力顯著提升。利用這個關鍵見解，我們提出了一系列 LLM 的結構化稀疏微調 (S$^{2}$FT) 方法，同時實現了最先進的微調效能、訓練效率和推論可擴充性。S$^{2}$FT 透過「稀疏選擇和密集運算」來達成此目標。它分別為每個 Transformer 區塊的 MHA 和 FFN 模組選擇一些頭部和通道。接著，它在 LLM 中耦合結構的兩側對權重矩陣進行共置換，將每一層中選定的組件連接到一個密集子矩陣中。最後，S$^{2}$FT 對所有子矩陣執行就地梯度更新。透過理論分析和實證結果，我們的模型可以防止過度擬合和遺忘，在常識和算術推理上提供 SOTA 效能，與 LoRA 相比，平均改善了 4.6% 和 1.3%，並且在經過指令微調後，對各種領域的泛化能力提升了 11.5%，超越了完整的 FT。使用我們的部分反向傳播演算法，與完整的 FT 相比，S$^{2}$FT 可節省高達 3 倍的訓練記憶體，並將延遲改善 1.5-2.7 倍，同時在兩個指標上比 LoRA 平均改善 10%。我們進一步證明，S$^{2}$FT 中的權重更新可以解耦成適配器，從而實現有效的融合、快速切換和高效並行運算，以服務多個微調模型。", "author": "Xinyu Yang et.al.", "authors": "Xinyu Yang, Jixuan Leng, Geyang Guo, Jiawei Zhao, Ryumei Nakada, Linjun Zhang, Huaxiu Yao, Beidi Chen", "id": "2412.06289v1", "paper_url": "http://arxiv.org/abs/2412.06289v1", "repo": "null"}}