{"2411.10928": {"publish_time": "2024-11-17", "title": "Learn from Downstream and Be Yourself in Multimodal Large Language Model Fine-Tuning", "paper_summary": "Multimodal Large Language Model (MLLM) have demonstrated strong\ngeneralization capabilities across diverse distributions and tasks, largely due\nto extensive pre-training datasets. Fine-tuning MLLM has become a common\npractice to improve performance on specific downstream tasks. However, during\nfine-tuning, MLLM often faces the risk of forgetting knowledge acquired during\npre-training, which can result in a decline in generalization abilities. To\nbalance the trade-off between generalization and specialization, we propose\nmeasuring the parameter importance for both pre-trained and fine-tuning\ndistributions, based on frozen pre-trained weight magnitude and accumulated\nfine-tuning gradient values. We further apply an importance-aware weight\nallocation strategy, selectively updating relatively important parameters for\ndownstream tasks. We conduct empirical evaluations on both image captioning and\nvisual question-answering tasks using various MLLM architectures. The\ncomprehensive experimental analysis demonstrates the effectiveness of the\nproposed solution, highlighting the efficiency of the crucial modules in\nenhancing downstream specialization performance while mitigating generalization\ndegradation in MLLM Fine-Tuning.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 在各种分布和任务中展示出强大的泛化能力，这在很大程度上归功于广泛的预训练数据集。微调 MLLM 已成为提高特定下游任务性能的常见做法。然而，在微调过程中，MLLM 经常面临忘记预训练期间获得的知识的风险，这可能导致泛化能力下降。为了平衡泛化和专业化之间的权衡，我们建议测量预训练和微调分布的参数重要性，基于冻结的预训练权重幅度和累积的微调梯度值。我们进一步应用了重要性感知权重分配策略，有选择地更新了下游任务的相对重要参数。我们使用各种 MLLM 架构对图像字幕和视觉问答任务进行了经验评估。全面的实验分析证明了所提出解决方案的有效性，强调了关键模块在提高下游专业化性能的同时减轻 MLLM 微调中泛化退化的效率。", "author": "Wenke Huang et.al.", "authors": "Wenke Huang, Jian Liang, Zekun Shi, Didi Zhu, Guancheng Wan, He Li, Bo Du, Dacheng Tao, Mang Ye", "id": "2411.10928v1", "paper_url": "http://arxiv.org/abs/2411.10928v1", "repo": "null"}}