{"2409.08522": {"publish_time": "2024-09-13", "title": "MAPX: An explainable model-agnostic framework for the detection of false information on social media networks", "paper_summary": "The automated detection of false information has become a fundamental task in\ncombating the spread of \"fake news\" on online social media networks (OSMN) as\nit reduces the need for manual discernment by individuals. In the literature,\nleveraging various content or context features of OSMN documents have been\nfound useful. However, most of the existing detection models often utilise\nthese features in isolation without regard to the temporal and dynamic changes\noft-seen in reality, thus, limiting the robustness of the models. Furthermore,\nthere has been little to no consideration of the impact of the quality of\ndocuments' features on the trustworthiness of the final prediction. In this\npaper, we introduce a novel model-agnostic framework, called MAPX, which allows\nevidence based aggregation of predictions from existing models in an\nexplainable manner. Indeed, the developed aggregation method is adaptive,\ndynamic and considers the quality of OSMN document features. Further, we\nperform extensive experiments on benchmarked fake news datasets to demonstrate\nthe effectiveness of MAPX using various real-world data quality scenarios. Our\nempirical results show that the proposed framework consistently outperforms all\nstate-of-the-art models evaluated. For reproducibility, a demo of MAPX is\navailable at \\href{https://github.com/SCondran/MAPX_framework}{this link}", "paper_summary_zh": "自動偵測假訊息已成為對抗線上社群媒體網路（OSMN）上「假新聞」散播的基本任務，因為它減少了個人手動辨別的需要。在文獻中，利用 OSMN 文件的各種內容或背景特徵已被發現是有用的。然而，現有的偵測模型大多在不考慮現實中常見的時態和動態變化下，孤立地使用這些特徵，因此限制了模型的穩健性。此外，對於文件特徵品質對最終預測可信度的影響幾乎沒有考慮。在本文中，我們引入一個新的與模型無關的框架，稱為 MAPX，它允許以可解釋的方式從現有模型中聚合基於證據的預測。事實上，開發的聚合方法是自適應的、動態的，並且考慮 OSMN 文件特徵的品質。此外，我們對基準假新聞資料集進行廣泛的實驗，以展示 MAPX 在各種真實世界資料品質場景中的有效性。我們的實證結果表明，所提出的框架始終優於所有評估的最新模型。為確保可複製性，MAPX 的示範可以在 \\href{https://github.com/SCondran/MAPX_framework}{此連結} 取得", "author": "Sarah Condran et.al.", "authors": "Sarah Condran, Michael Bewong, Selasi Kwashie, Md Zahidul Islam, Irfan Altas, Joshua Condran", "id": "2409.08522v1", "paper_url": "http://arxiv.org/abs/2409.08522v1", "repo": "https://github.com/scondran/mapx_framework"}}