{"2502.10050": {"publish_time": "2025-02-14", "title": "A Survey on LLM-powered Agents for Recommender Systems", "paper_summary": "Recommender systems are essential components of many online platforms, yet\ntraditional approaches still struggle with understanding complex user\npreferences and providing explainable recommendations. The emergence of Large\nLanguage Model (LLM)-powered agents offers a promising approach by enabling\nnatural language interactions and interpretable reasoning, potentially\ntransforming research in recommender systems. This survey provides a systematic\nreview of the emerging applications of LLM-powered agents in recommender\nsystems. We identify and analyze three key paradigms in current research: (1)\nRecommender-oriented approaches, which leverage intelligent agents to enhance\nthe fundamental recommendation mechanisms; (2) Interaction-oriented approaches,\nwhich facilitate dynamic user engagement through natural dialogue and\ninterpretable suggestions; and (3) Simulation-oriented approaches, which employ\nmulti-agent frameworks to model complex user-item interactions and system\ndynamics. Beyond paradigm categorization, we analyze the architectural\nfoundations of LLM-powered recommendation agents, examining their essential\ncomponents: profile construction, memory management, strategic planning, and\naction execution. Our investigation extends to a comprehensive analysis of\nbenchmark datasets and evaluation frameworks in this domain. This systematic\nexamination not only illuminates the current state of LLM-powered agent\nrecommender systems but also charts critical challenges and promising research\ndirections in this transformative field.", "paper_summary_zh": "推薦系統是許多線上平台的必要組成部分，但傳統方法仍難以理解複雜的使用者偏好並提供可解釋的推薦。大型語言模型 (LLM) 驅動代理的出現提供了一個有前途的方法，它能實現自然語言互動和可解釋的推理，有可能轉變推薦系統的研究。這項調查對 LLM 驅動代理在推薦系統中新興的應用提供了系統性的回顧。我們找出並分析了當前研究中的三個關鍵範例：(1) 推薦導向方法，它利用智慧代理來增強基本的推薦機制；(2) 互動導向方法，它透過自然對話和可解釋的建議促進動態使用者參與；以及 (3) 模擬導向方法，它採用多代理架構來模擬複雜的使用者-項目互動和系統動態。除了範例分類之外，我們分析了 LLM 驅動推薦代理的架構基礎，檢查其基本組成部分：輪廓建構、記憶體管理、策略規劃和動作執行。我們的調查延伸到對此領域中的基準資料集和評估架構進行全面分析。這項系統性檢查不僅闡明了 LLM 驅動代理推薦系統的現狀，還勾勒出此轉型領域中關鍵的挑戰和有前途的研究方向。", "author": "Qiyao Peng et.al.", "authors": "Qiyao Peng, Hongtao Liu, Hua Huang, Qing Yang, Minglai Shao", "id": "2502.10050v1", "paper_url": "http://arxiv.org/abs/2502.10050v1", "repo": "null"}}