{"2412.18863": {"publish_time": "2024-12-25", "title": "Whose Morality Do They Speak? Unraveling Cultural Bias in Multilingual Language Models", "paper_summary": "Large language models (LLMs) have become integral tools in diverse domains,\nyet their moral reasoning capabilities across cultural and linguistic contexts\nremain underexplored. This study investigates whether multilingual LLMs, such\nas GPT-3.5-Turbo, GPT-4o-mini, Llama 3.1, and MistralNeMo, reflect culturally\nspecific moral values or impose dominant moral norms, particularly those rooted\nin English. Using the updated Moral Foundations Questionnaire (MFQ-2) in eight\nlanguages, Arabic, Farsi, English, Spanish, Japanese, Chinese, French, and\nRussian, the study analyzes the models' adherence to six core moral\nfoundations: care, equality, proportionality, loyalty, authority, and purity.\nThe results reveal significant cultural and linguistic variability, challenging\nthe assumption of universal moral consistency in LLMs. Although some models\ndemonstrate adaptability to diverse contexts, others exhibit biases influenced\nby the composition of the training data. These findings underscore the need for\nculturally inclusive model development to improve fairness and trust in\nmultilingual AI systems.", "paper_summary_zh": "大型語言模型 (LLM) 已成為各個領域不可或缺的工具，\n但它們在不同文化和語言背景下的道德推理能力\n仍未得到充分探討。本研究探討多語言 LLM，例如\nGPT-3.5-Turbo、GPT-4o-mini、Llama 3.1 和 MistralNeMo，是否反映了特定文化的\n道德價值觀或強加了主流道德規範，尤其是植根於英語的規範。使用更新的道德基礎問卷 (MFQ-2) 八種\n語言，阿拉伯語、波斯語、英語、西班牙語、日語、中文、法語和\n俄語，該研究分析了模型對六個核心道德的遵守情況\n基礎：關懷、平等、相稱性、忠誠、權威和純潔。\n結果揭示了顯著的文化和語言變異性，挑戰了 LLM 中普遍道德一致性的假設。儘管一些模型\n證明了對不同背景的適應性，而另一些模型則表現出受訓練數據組成影響的偏見。這些發現強調了\n文化包容模型開發的必要性，以提高公平性和對\n多語言人工智能系統的信任。", "author": "Meltem Aksoy et.al.", "authors": "Meltem Aksoy", "id": "2412.18863v1", "paper_url": "http://arxiv.org/abs/2412.18863v1", "repo": "null"}}