{"2409.02038": {"publish_time": "2024-09-03", "title": "BEAVER: An Enterprise Benchmark for Text-to-SQL", "paper_summary": "Existing text-to-SQL benchmarks have largely been constructed using publicly\navailable tables from the web with human-generated tests containing question\nand SQL statement pairs. They typically show very good results and lead people\nto think that LLMs are effective at text-to-SQL tasks. In this paper, we apply\noff-the-shelf LLMs to a benchmark containing enterprise data warehouse data. In\nthis environment, LLMs perform poorly, even when standard prompt engineering\nand RAG techniques are utilized. As we will show, the reasons for poor\nperformance are largely due to three characteristics: (1) public LLMs cannot\ntrain on enterprise data warehouses because they are largely in the \"dark web\",\n(2) schemas of enterprise tables are more complex than the schemas in public\ndata, which leads the SQL-generation task innately harder, and (3)\nbusiness-oriented questions are often more complex, requiring joins over\nmultiple tables and aggregations. As a result, we propose a new dataset BEAVER,\nsourced from real enterprise data warehouses together with natural language\nqueries and their correct SQL statements which we collected from actual user\nhistory. We evaluated this dataset using recent LLMs and demonstrated their\npoor performance on this task. We hope this dataset will facilitate future\nresearchers building more sophisticated text-to-SQL systems which can do better\non this important class of data.", "paper_summary_zh": "現有的文字轉 SQL 評量基準在很大程度上是使用網路上公開的表格建構，其中包含人類產生的測試，包含問題和 SQL 語句配對。它們通常顯示非常好的結果，並讓人們認為 LLM 在文字轉 SQL 任務中很有效。在本文中，我們將現成的 LLM 應用於包含企業資料倉儲資料的評量基準。在此環境中，即使使用了標準提示工程和 RAG 技術，LLM 的表現也很差。正如我們將展示的，表現不佳的原因在很大程度上是基於三個特徵：(1) 公共 LLM 無法訓練企業資料倉儲，因為它們在很大程度上屬於「暗網」，(2) 企業表格的架構比公共資料中的架構更複雜，這使得 SQL 生成任務天生就更困難，以及 (3) 面向業務的問題通常更複雜，需要跨多個表格和聚合進行聯結。因此，我們提出一個新的資料集 BEAVER，它來自實際的企業資料倉儲，以及我們從實際使用者記錄中收集的自然語言查詢及其正確的 SQL 語句。我們使用最近的 LLM 評估此資料集，並證明它們在此任務上的表現不佳。我們希望這個資料集將有助於未來的研究人員建構更精密的文字轉 SQL 系統，以便在這個重要的資料類別上表現得更好。", "author": "Peter Baile Chen et.al.", "authors": "Peter Baile Chen, Fabian Wenz, Yi Zhang, Moe Kayali, Nesime Tatbul, Michael Cafarella, Çağatay Demiralp, Michael Stonebraker", "id": "2409.02038v1", "paper_url": "http://arxiv.org/abs/2409.02038v1", "repo": "null"}}