{"2406.14228": {"publish_time": "2024-06-20", "title": "EvoAgent: Towards Automatic Multi-Agent Generation via Evolutionary Algorithms", "paper_summary": "The rise of powerful large language models (LLMs) has spurred a new trend in\nbuilding LLM-based autonomous agents for solving complex tasks, especially\nmulti-agent systems. Despite the remarkable progress, we notice that existing\nworks are heavily dependent on human-designed frameworks, which greatly limits\nthe functional scope and scalability of agent systems. How to automatically\nextend the specialized agent to multi-agent systems to improve task-solving\ncapability still remains a significant challenge. In this paper, we introduce\nEvoAgent, a generic method to automatically extend expert agents to multi-agent\nsystems via the evolutionary algorithm, thereby improving the effectiveness of\nLLM-based agents in solving tasks. Specifically, we consider the existing agent\nframeworks as the initial individual and then apply a series of evolutionary\noperators (e.g., mutation, crossover, selection, etc.) to generate multiple\nagents with diverse agent settings. EvoAgent can be generalized to any\nLLM-based agent framework, and can automatically extend the existing agent\nframework to multi-agent systems without any extra human designs. Experimental\nresults across various tasks have shown that EvoAgent can automatically\ngenerate multiple expert agents and significantly enhance the task-solving\ncapabilities of LLM-based agents.", "paper_summary_zh": "強大的大型語言模型 (LLM) 的興起，刺激了建立基於 LLM 的自主代理來解決複雜任務的新趨勢，尤其是多代理系統。儘管取得了顯著進展，我們注意到現有作品嚴重依賴於人類設計的框架，這極大地限制了代理系統的功能範圍和可擴展性。如何自動將專用代理擴展到多代理系統以提高任務解決能力仍然是一個重大的挑戰。在本文中，我們介紹了 EvoAgent，這是一種通過演算法自動將專家代理擴展到多代理系統的通用方法，從而提高了基於 LLM 的代理在解決任務中的有效性。具體來說，我們將現有的代理框架視為初始個體，然後應用一系列演化運算子（例如，突變、交叉、選擇等）來生成具有不同代理設定的多個代理。EvoAgent 可以推廣到任何基於 LLM 的代理框架，並且可以自動將現有的代理框架擴展到多代理系統，而無需任何額外的人工設計。跨各種任務的實驗結果表明，EvoAgent 可以自動生成多個專家代理，並顯著增強基於 LLM 的代理的任務解決能力。", "author": "Siyu Yuan et.al.", "authors": "Siyu Yuan, Kaitao Song, Jiangjie Chen, Xu Tan, Dongsheng Li, Deqing Yang", "id": "2406.14228v1", "paper_url": "http://arxiv.org/abs/2406.14228v1", "repo": "null"}}