{"2501.13007": {"publish_time": "2025-01-22", "title": "Pairwise RM: Perform Best-of-N Sampling with Knockout Tournament", "paper_summary": "Best-of-N (BoN) sampling, a common strategy for test-time scaling of Large\nLanguage Models (LLMs), relies on reward models to select the best candidate\nsolution from multiple generations. However, traditional reward models often\nassign arbitrary and inconsistent scores, limiting their effectiveness. To\naddress this, we propose a Pairwise Reward Model (Pairwise RM) combined with a\nknockout tournament for BoN sampling. Instead of assigning absolute scores,\ngiven one math problem, Pairwise RM evaluates two candidate solutions'\ncorrectness simultaneously. This approach eliminates the need for arbitrary\nscoring and enables cross-validation of solutions through parallel comparison.\nIn the knockout tournament, Pairwise RM conducts pairwise comparisons between\ncandidate solutions and eliminates the incorrect ones iteratively. We construct\n\\ourdataset, a large-scale dataset of 443K pairwise comparisons derived from\nNumiaMath and annotated using \\texttt{gemini-1.5-flash}, and train the Pairwise\nRM via supervised fine-tuning. Experiments on MATH-500 and the Olympiad Bench\ndemonstrate significant improvements over traditional discriminative reward\nmodels. And a 40\\% to 60\\% relative improvement is achieved on the top 50\\%\nchallenging problems.", "paper_summary_zh": "最佳 N (BoN) 抽樣，一種大型語言模型 (LLM) 測試時縮放的常見策略，依賴於獎勵模型從多個世代中選出最佳候選解。然而，傳統的獎勵模型通常會分配任意且不一致的分數，限制了它們的有效性。為了解決這個問題，我們提出了一種配對獎勵模型 (配對 RM)，並結合淘汰賽進行 BoN 抽樣。配對 RM 沒有分配絕對分數，而是給予一個數學問題，同時評估兩個候選解的正確性。這種方法消除了對任意計分的需要，並能透過並行比較對解進行交叉驗證。在淘汰賽中，配對 RM 在候選解之間進行配對比較，並反覆淘汰不正確的解。我們構建了 \\ourdataset，一個從 NumiaMath 衍生的 443K 個配對比較的規模化資料集，並使用 \\texttt{gemini-1.5-flash} 進行註解，並透過監督微調訓練配對 RM。在 MATH-500 和奧林匹克基準上的實驗證明了相較於傳統的判別獎勵模型有顯著的改進。並且在最具挑戰性的問題前 50% 中，獲得了 40% 到 60% 的相對改進。", "author": "Yantao Liu et.al.", "authors": "Yantao Liu, Zijun Yao, Rui Min, Yixin Cao, Lei Hou, Juanzi Li", "id": "2501.13007v1", "paper_url": "http://arxiv.org/abs/2501.13007v1", "repo": "https://github.com/thu-keg/pairwiserm"}}