{"2502.15676": {"publish_time": "2025-02-21", "title": "AutoToM: Automated Bayesian Inverse Planning and Model Discovery for Open-ended Theory of Mind", "paper_summary": "Theory of Mind (ToM), the ability to understand people's mental variables\nbased on their behavior, is key to developing socially intelligent agents.\nCurrent approaches to Theory of Mind reasoning either rely on prompting Large\nLanguage Models (LLMs), which are prone to systematic errors, or use rigid,\nhandcrafted Bayesian Theory of Mind (BToM) models, which are more robust but\ncannot generalize across different domains. In this work, we introduce AutoToM,\nan automated Bayesian Theory of Mind method for achieving open-ended machine\nTheory of Mind. AutoToM can operate in any domain, infer any mental variable,\nand conduct robust Theory of Mind reasoning of any order. Given a Theory of\nMind inference problem, AutoToM first proposes an initial BToM model. It then\nconducts automated Bayesian inverse planning based on the proposed model,\nleveraging an LLM as the backend. Based on the uncertainty of the inference, it\niteratively refines the model, by introducing additional mental variables\nand/or incorporating more timesteps in the context. Empirical evaluations\nacross multiple Theory of Mind benchmarks demonstrate that AutoToM consistently\nachieves state-of-the-art performance, offering a scalable, robust, and\ninterpretable approach to machine Theory of Mind.", "paper_summary_zh": "心智理論（ToM），根據人們的行為理解其心理變數的能力，是發展社交智能代理人的關鍵。\n當前的心智理論推理方法依賴於提示大型語言模型（LLM），它容易出現系統性錯誤，或使用嚴格的手工貝氏心智理論（BToM）模型，它更強大，但無法在不同領域中概括。在這項工作中，我們介紹了 AutoToM，一種用於實現開放式機器心智理論的自動化貝氏心智理論方法。AutoToM 可以運作於任何領域，推斷任何心理變數，並進行任何順序的強健心智理論推理。給定一個心智理論推理問題，AutoToM 首先提出一個初始的 BToM 模型。然後，它基於提議的模型進行自動化貝氏逆向規劃，利用 LLM 作為後端。根據推理的不確定性，它通過引入額外的精神變數和/或在上下文中納入更多時間步長，反覆改進模型。跨多個心智理論基準的經驗評估表明，AutoToM 持續實現最先進的效能，為機器心智理論提供了一個可擴充、強健且可解釋的方法。", "author": "Zhining Zhang et.al.", "authors": "Zhining Zhang, Chuanyang Jin, Mung Yao Jia, Tianmin Shu", "id": "2502.15676v1", "paper_url": "http://arxiv.org/abs/2502.15676v1", "repo": "null"}}