{"2502.02315": {"publish_time": "2025-02-04", "title": "VaiBot: Shuttle Between the Instructions and Parameters", "paper_summary": "How to interact with LLMs through \\emph{instructions} has been widely studied\nby researchers. However, previous studies have treated the emergence of\ninstructions and the training of LLMs on task data as separate processes,\noverlooking the inherent unity between the two. This paper proposes a neural\nnetwork framework, VaiBot, that integrates VAE and VIB, designed to uniformly\nmodel, learn, and infer both deduction and induction tasks under LLMs. Through\nexperiments, we demonstrate that VaiBot performs on par with existing baseline\nmethods in terms of deductive capabilities while significantly surpassing them\nin inductive capabilities. We also find that VaiBot can scale up using general\ninstruction-following data and exhibits excellent one-shot induction abilities.\nWe finally synergistically integrate the deductive and inductive processes of\nVaiBot. Through T-SNE dimensionality reduction, we observe that its\ninductive-deductive process significantly improves the distribution of training\nparameters, enabling it to outperform baseline methods in inductive reasoning\ntasks. The code and data for this paper can be found at\nhttps://anonymous.4open.science/r/VaiBot-021F.", "paper_summary_zh": "研究人員廣泛探討如何透過「指示」與 LLM 互動。然而，先前的研究將指示的出現與 LLM 針對任務資料的訓練視為獨立的過程，忽視兩者之間的內在統一性。本文提出一個神經網路架構 VaiBot，它整合了 VAE 和 VIB，旨在統一建模、學習和推論 LLM 下的演繹和歸納任務。透過實驗，我們證明 VaiBot 在演繹能力方面與現有的基準方法不相上下，同時在歸納能力方面顯著超越它們。我們還發現 VaiBot 可以使用一般的指令遵循資料進行擴充，並展現出優異的一次性歸納能力。最後，我們協同整合 VaiBot 的演繹和歸納過程。透過 T-SNE 降維，我們觀察到其歸納演繹過程顯著改善訓練參數的分布，使其在歸納推理任務中優於基準方法。本文的程式碼和資料可以在 https://anonymous.4open.science/r/VaiBot-021F 找到。", "author": "Wangtao Sun et.al.", "authors": "Wangtao Sun, Haotian Xu, Huanxuan Liao, Xuanqing Yu, Zhongtao Jiang, Shizhu He, Jun Zhao, Kang Liu", "id": "2502.02315v1", "paper_url": "http://arxiv.org/abs/2502.02315v1", "repo": "null"}}