{"2407.18887": {"publish_time": "2024-07-26", "title": "Embedding And Clustering Your Data Can Improve Contrastive Pretraining", "paper_summary": "Recent studies of large-scale contrastive pretraining in the text embedding\ndomain show that using single-source minibatches, rather than mixed-source\nminibatches, can substantially improve overall model accuracy. In this work, we\nexplore extending training data stratification beyond source granularity by\nleveraging a pretrained text embedding model and the classic k-means clustering\nalgorithm to further split training data apart by the semantic clusters within\neach source. Experimentally, we observe a notable increase in NDCG@10 when\npretraining a BERT-based text embedding model on query-passage pairs from the\nMSMARCO passage retrieval dataset. Additionally, we conceptually connect our\nclustering approach to both the Topic Aware Sampling (TAS) aspect of the TAS-B\nmethodology and the nearest-neighbor-based hard-negative mining aspect of the\nANCE methodology and discuss how this unified view motivates future lines of\nresearch on the organization of contrastive pretraining data.", "paper_summary_zh": "最近在文本嵌入領域中進行的大規模對比預訓練研究表明，使用單一來源的小批次，而不是混合來源的小批次，可以大幅提升整體模型準確度。在這項工作中，我們探討了透過利用預訓練文本嵌入模型和經典的 k 均值聚類演算法，將訓練資料分層擴展到來源粒度之外，進一步根據每個來源內的語義群集將訓練資料分開。在實驗中，我們觀察到在 MSMARCO 段落檢索資料集中的查詢-段落對上預訓練基於 BERT 的文本嵌入模型時，NDCG@10 有顯著提升。此外，我們在概念上將我們的聚類方法與 TAS-B 方法論的 Topic Aware Sampling (TAS) 面向和 ANCE 方法論的基於最近鄰的困難負例挖掘面向連結起來，並討論這種統一觀點如何激勵未來在對比預訓練資料組織的研究方向。", "author": "Luke Merrick et.al.", "authors": "Luke Merrick", "id": "2407.18887v1", "paper_url": "http://arxiv.org/abs/2407.18887v1", "repo": "null"}}