{"2409.18578": {"publish_time": "2024-09-27", "title": "An Enhanced Federated Prototype Learning Method under Domain Shift", "paper_summary": "Federated Learning (FL) allows collaborative machine learning training\nwithout sharing private data. Numerous studies have shown that one significant\nfactor affecting the performance of federated learning models is the\nheterogeneity of data across different clients, especially when the data is\nsampled from various domains. A recent paper introduces variance-aware\ndual-level prototype clustering and uses a novel $\\alpha$-sparsity prototype\nloss, which increases intra-class similarity and reduces inter-class\nsimilarity. To ensure that the features converge within specific clusters, we\nintroduce an improved algorithm, Federated Prototype Learning with Convergent\nClusters, abbreviated as FedPLCC. To increase inter-class distances, we weight\neach prototype with the size of the cluster it represents. To reduce\nintra-class distances, considering that prototypes with larger distances might\ncome from different domains, we select only a certain proportion of prototypes\nfor the loss function calculation. Evaluations on the Digit-5, Office-10, and\nDomainNet datasets show that our method performs better than existing\napproaches.", "paper_summary_zh": "联邦学习（FL）允许协作机器学习训练，而无需共享私有数据。大量研究表明，影响联邦学习模型性能的一个重要因素是不同客户端之间数据的异质性，尤其是在数据从各个域中采样时。最近的一篇论文介绍了方差感知双层原型聚类，并使用了一种新颖的 $\\alpha$-稀疏原型损失，它增加了类内相似性并减少了类间相似性。为了确保特征在特定群集中收敛，我们引入了一种改进的算法，即收敛群集的联邦原型学习，缩写为 FedPLCC。为了增加类间距离，我们根据每个原型所代表的群集大小对其进行加权。为了减少类内距离，考虑到距离较大的原型可能来自不同的域，我们仅选择一定比例的原型用于损失函数计算。在 Digit-5、Office-10 和 DomainNet 数据集上的评估表明，我们的方法比现有方法表现得更好。", "author": "Liang Kuang et.al.", "authors": "Liang Kuang, Kuangpu Guo, Jian Liang, Jianguo Zhang", "id": "2409.18578v1", "paper_url": "http://arxiv.org/abs/2409.18578v1", "repo": "null"}}