{"2411.14425": {"publish_time": "2024-11-21", "title": "Whack-a-Chip: The Futility of Hardware-Centric Export Controls", "paper_summary": "U.S. export controls on semiconductors are widely known to be permeable, with\nthe People's Republic of China (PRC) steadily creating state-of-the-art\nartificial intelligence (AI) models with exfiltrated chips. This paper presents\nthe first concrete, public evidence of how leading PRC AI labs evade and\ncircumvent U.S. export controls. We examine how Chinese companies, notably\nTencent, are not only using chips that are restricted under U.S. export\ncontrols but are also finding ways to circumvent these regulations by using\nsoftware and modeling techniques that maximize less capable hardware.\nSpecifically, we argue that Tencent's ability to power its Hunyuan-Large model\nwith non-export controlled NVIDIA H20s exemplifies broader gains in efficiency\nin machine learning that have eroded the moat that the United States initially\nbuilt via its existing export controls. Finally, we examine the implications of\nthis finding for the future of the United States' export control strategy.", "paper_summary_zh": "美國對半導體的出口管制措施眾所周知是具有滲透性的，而中華人民共和國（PRC）則持續透過外洩的晶片打造最先進的人工智慧（AI）模型。本文提出第一個具體的公開證據，說明中國領先的 AI 實驗室如何規避和繞過美國的出口管制。我們探討中國公司，尤其是騰訊，如何不僅使用美國出口管制限制的晶片，還透過使用軟體和建模技術，最大化功能較弱的硬體，來找出規避這些法規的方法。具體來說，我們認為騰訊能夠使用非出口管制的 NVIDIA H20s 來為其 Hunyuan-Large 模型供電，這說明了機器學習效率的更廣泛提升，而這已侵蝕了美國最初透過其現有出口管制措施所建立的護城河。最後，我們探討這一發現對美國未來出口管制策略的影響。", "author": "Ritwik Gupta et.al.", "authors": "Ritwik Gupta, Leah Walker, Andrew W. Reddie", "id": "2411.14425v1", "paper_url": "http://arxiv.org/abs/2411.14425v1", "repo": "null"}}