{"2501.09672": {"publish_time": "2025-01-16", "title": "Robin: a Suite of Multi-Scale Vision-Language Models and the CHIRP Evaluation Benchmark", "paper_summary": "The proliferation of Vision-Language Models (VLMs) in the past several years\ncalls for rigorous and comprehensive evaluation methods and benchmarks. This\nwork analyzes existing VLM evaluation techniques, including automated metrics,\nAI-based assessments, and human evaluations across diverse tasks. We first\nintroduce Robin - a novel suite of VLMs that we built by combining Large\nLanguage Models (LLMs) and Vision Encoders (VEs) at multiple scales, and use\nRobin to identify shortcomings of current evaluation approaches across scales.\nNext, to overcome the identified limitations, we introduce CHIRP - a new long\nform response benchmark we developed for more robust and complete VLM\nevaluation. We provide open access to the Robin training code, model suite, and\nCHIRP benchmark to promote reproducibility and advance VLM research.", "paper_summary_zh": "在過去幾年中，視覺語言模型 (VLM) 的激增\n需要嚴謹且全面的評估方法和基準。這\n項工作分析了現有的 VLM 評估技術，包括自動化指標、\n基於 AI 的評估和跨不同任務的人類評估。我們首先\n介紹 Robin - 我們通過結合大語言模型 (LLM) 和視覺編碼器 (VE) 在多個規模上構建的一組新穎的 VLM，並使用\nRobin 來識別當前評估方法在不同規模上的缺點。\n接下來，為了克服已識別的限制，我們引入了 CHIRP - 一個新的長\n格式回應基準，我們為更健壯且完整的 VLM\n評估而開發。我們提供對 Robin 訓練代碼、模型套件和\nCHIRP 基準的開放訪問，以促進可複製性和推進 VLM 研究。", "author": "Alexis Roger et.al.", "authors": "Alexis Roger, Prateek Humane, Daniel Z. Kaplan, Kshitij Gupta, Qi Sun, George Adamopoulos, Jonathan Siu Chi Lim, Quentin Anthony, Edwin Fennell, Irina Rish", "id": "2501.09672v1", "paper_url": "http://arxiv.org/abs/2501.09672v1", "repo": "null"}}