{"2408.11433": {"publish_time": "2024-08-21", "title": "Towards Aligned Data Removal via Twin Machine Unlearning", "paper_summary": "Modern privacy regulations have spurred the evolution of machine unlearning,\na technique that enables the removal of data from an already trained ML model\nwithout requiring retraining from scratch. Previous unlearning methods tend to\ninduce the model to achieve lowest classification accuracy on the removal data.\nNonetheless, the authentic objective of machine unlearning is to align the\nunlearned model with the gold model, i.e., achieving the same classification\naccuracy as the gold model. For this purpose, we present a Twin Machine\nUnlearning (TMU) approach, where a twin unlearning problem is defined\ncorresponding to the original unlearning problem. As a results, the\ngeneralization-label predictor trained on the twin problem can be transferred\nto the original problem, facilitating aligned data removal. Comprehensive\nempirical experiments illustrate that our approach significantly enhances the\nalignment between the unlearned model and the gold model. Meanwhile, our method\nallows data removal without compromising the model accuracy.", "paper_summary_zh": "現代隱私法規促進了機器去學習的演進，\n這是一種技術，可以在不需從頭開始重新訓練的情況下，\n從已訓練好的 ML 模型中移除資料。先前的去學習方法傾向於\n誘使模型對移除的資料達成最低的分類準確度。\n儘管如此，機器去學習的真實目標是將\n去學習的模型與黃金模型對齊，亦即達成與黃金模型相同的分類\n準確度。為了這個目的，我們提出一個雙機器去學習 (TMU) 方法，\n其中定義了一個雙去學習問題，對應到原始的去學習問題。結果是，\n在雙重問題上訓練的概化標籤預測器可以轉移到原始問題上，\n促進對齊的資料移除。全面的經驗實驗說明我們的做法顯著地加強了\n去學習模型和黃金模型之間的對齊。同時，我們的做法\n允許資料移除而不影響模型準確度。", "author": "Yuyao Sun et.al.", "authors": "Yuyao Sun, Zhenxing Niu, Gang hua, Rong jin", "id": "2408.11433v1", "paper_url": "http://arxiv.org/abs/2408.11433v1", "repo": "null"}}