{"2411.03455": {"publish_time": "2024-11-05", "title": "Watson: A Cognitive Observability Framework for the Reasoning of Foundation Model-Powered Agents", "paper_summary": "As foundation models (FMs) play an increasingly prominent role in complex\nsoftware systems, such as FM-powered agentic software (i.e., Agentware), they\nintroduce significant challenges for developers regarding observability. Unlike\ntraditional software, agents operate autonomously, using extensive data and\nopaque implicit reasoning, making it difficult to observe and understand their\nbehavior during runtime, especially when they take unexpected actions or\nencounter errors. In this paper, we highlight the limitations of traditional\noperational observability in the context of FM-powered software, and introduce\ncognitive observability as a new type of required observability that has\nemerged for such innovative systems. We then propose a novel framework that\nprovides cognitive observability into the implicit reasoning processes of\nagents (a.k.a. reasoning observability), and demonstrate the effectiveness of\nour framework in boosting the debuggability of Agentware and, in turn, the\nabilities of an Agentware through a case study on AutoCodeRover, a cuttingedge\nAgentware for autonomous program improvement.", "paper_summary_zh": "隨著基礎模型 (FM) 在複雜軟體系統中扮演越來越重要的角色，例如 FM 驅動的代理軟體（即 Agentware），它們為開發人員在可觀察性方面帶來了重大的挑戰。與傳統軟體不同，代理軟體使用大量資料和不透明的隱含推理進行自主運作，這使得在執行期間難以觀察和理解它們的行為，特別是在它們採取意外行動或遇到錯誤時。在本文中，我們強調了傳統運作可觀察性在 FM 驅動軟體中的限制，並介紹了認知可觀察性，這是一種新類型的必需可觀察性，它已經出現在這類創新系統中。然後，我們提出了一個新穎的框架，它提供了對代理軟體隱含推理過程的認知可觀察性（又稱推理可觀察性），並展示了我們的框架在提升 Agentware 的除錯能力方面的有效性，進而透過一個關於 AutoCodeRover 的案例研究提升了 Agentware 的能力，AutoCodeRover 是一種用於自主程式改善的尖端 Agentware。", "author": "Benjamin Rombaut et.al.", "authors": "Benjamin Rombaut, Sogol Masoumzadeh, Kirill Vasilevski, Dayi Lin, Ahmed E. Hassan", "id": "2411.03455v1", "paper_url": "http://arxiv.org/abs/2411.03455v1", "repo": "null"}}