{"2407.09136": {"publish_time": "2024-07-12", "title": "Stepwise Verification and Remediation of Student Reasoning Errors with Large Language Model Tutors", "paper_summary": "Large language models (LLMs) present an opportunity to scale high-quality\npersonalized education to all. A promising approach towards this means is to\nbuild dialog tutoring models that scaffold students' problem-solving. However,\neven though existing LLMs perform well in solving reasoning questions, they\nstruggle to precisely detect student's errors and tailor their feedback to\nthese errors. Inspired by real-world teaching practice where teachers identify\nstudent errors and customize their response based on them, we focus on\nverifying student solutions and show how grounding to such verification\nimproves the overall quality of tutor response generation. We collect a dataset\nof 1K stepwise math reasoning chains with the first error step annotated by\nteachers. We show empirically that finding the mistake in a student solution is\nchallenging for current models. We propose and evaluate several verifiers for\ndetecting these errors. Using both automatic and human evaluation we show that\nthe student solution verifiers steer the generation model towards highly\ntargeted responses to student errors which are more often correct with less\nhallucinations compared to existing baselines.", "paper_summary_zh": "大型語言模型 (LLM) 提供了一個機會，可以將高品質的個人化教育擴展到所有人。一種有希望的方法是建立對話輔導模型，以架構學生的問題解決能力。然而，儘管現有的 LLM 在解決推理問題方面表現良好，但它們卻難以準確地檢測學生的錯誤並根據這些錯誤調整他們的反饋。受到現實世界教學實踐的啟發，教師會找出學生的錯誤並根據這些錯誤自訂他們的回應，我們專注於驗證學生的解法，並展示了對此類驗證的依據如何改善導師回應生成的整體品質。我們收集了一個包含 1K 步驟式數學推理鏈的資料集，其中包含由教師註解的第一個錯誤步驟。我們實證地表明，在學生的解法中找到錯誤對目前的模型來說具有挑戰性。我們提出並評估了幾個用於檢測這些錯誤的驗證器。我們透過自動和人工評估表明，學生解法驗證器引導生成模型針對學生的錯誤提出高度針對性的回應，與現有的基準相比，這些回應通常更正確，而且出現幻覺的次數更少。", "author": "Nico Daheim et.al.", "authors": "Nico Daheim, Jakub Macina, Manu Kapur, Iryna Gurevych, Mrinmaya Sachan", "id": "2407.09136v1", "paper_url": "http://arxiv.org/abs/2407.09136v1", "repo": "https://github.com/eth-lre/verify-then-generate"}}