{"2411.02003": {"publish_time": "2024-11-04", "title": "Against Multifaceted Graph Heterogeneity via Asymmetric Federated Prompt Learning", "paper_summary": "Federated Graph Learning (FGL) aims to collaboratively and privately optimize\ngraph models on divergent data for different tasks. A critical challenge in FGL\nis to enable effective yet efficient federated optimization against\nmultifaceted graph heterogeneity to enhance mutual performance. However,\nexisting FGL works primarily address graph data heterogeneity and perform\nincapable of graph task heterogeneity. To address the challenge, we propose a\nFederated Graph Prompt Learning (FedGPL) framework to efficiently enable\nprompt-based asymmetric graph knowledge transfer between multifaceted\nheterogeneous federated participants. Generally, we establish a split federated\nframework to preserve universal and domain-specific graph knowledge,\nrespectively. Moreover, we develop two algorithms to eliminate task and data\nheterogeneity for advanced federated knowledge preservation. First, a\nHierarchical Directed Transfer Aggregator (HiDTA) delivers cross-task\nbeneficial knowledge that is hierarchically distilled according to the\ndirectional transferability. Second, a Virtual Prompt Graph (VPG) adaptively\ngenerates graph structures to enhance data utility by distinguishing dominant\nsubgraphs and neutralizing redundant ones. We conduct theoretical analyses and\nextensive experiments to demonstrate the significant accuracy and efficiency\neffectiveness of FedGPL against multifaceted graph heterogeneity compared to\nstate-of-the-art baselines on large-scale federated graph datasets.", "paper_summary_zh": "联邦图学习 (FGL) 旨在针对不同的任务在发散的数据上协作且私下优化图模型。FGL 中的一个关键挑战是针对多方面的图异质性启用有效且高效的联邦优化，以增强相互性能。然而，现有的 FGL 工作主要解决图数据异质性，并且无法执行图任务异质性。为了应对这一挑战，我们提出了一个联邦图提示学习 (FedGPL) 框架，以有效地实现基于提示的多方面异构联邦参与者之间的非对称图知识转移。一般来说，我们建立了一个分割联邦框架，分别保留通用和特定于域的图知识。此外，我们开发了两种算法来消除任务和数据异质性，以实现高级联邦知识保留。首先，一个分层定向传输聚合器 (HiDTA) 提供根据定向可转移性分层提取的跨任务有益知识。其次，一个虚拟提示图 (VPG) 自适应地生成图结构，通过区分主导子图并中和冗余子图来增强数据效用。我们进行了理论分析和广泛的实验，以证明 FedGPL 在多方面图异质性方面的显着准确性和有效性，与大规模联邦图数据集上的最先进基线相比。", "author": "Zhuoning Guo et.al.", "authors": "Zhuoning Guo, Ruiqian Han, Hao Liu", "id": "2411.02003v1", "paper_url": "http://arxiv.org/abs/2411.02003v1", "repo": "null"}}