{"2406.12442": {"publish_time": "2024-06-18", "title": "Abstraction-of-Thought Makes Language Models Better Reasoners", "paper_summary": "Abstract reasoning, the ability to reason from the abstract essence of a\nproblem, serves as a key to generalization in human reasoning. However,\neliciting language models to perform reasoning with abstraction remains\nunexplored. This paper seeks to bridge this gap by introducing a novel\nstructured reasoning format called Abstraction-of-Thought (AoT). The uniqueness\nof AoT lies in its explicit requirement for varying levels of abstraction\nwithin the reasoning process. This approach could elicit language models to\nfirst contemplate on the abstract level before incorporating concrete details,\nwhich is overlooked by the prevailing step-by-step Chain-of-Thought (CoT)\nmethod. To align models with the AoT format, we present AoT Collection, a\ngeneric finetuning dataset consisting of 348k high-quality samples with AoT\nreasoning processes, collected via an automated and scalable pipeline. We\nfinetune a wide range of language models with AoT Collection and conduct\nextensive evaluations on 23 unseen tasks from the challenging benchmark\nBig-Bench Hard. Experimental results indicate that models aligned to AoT\nreasoning format substantially outperform those aligned to CoT in many\nreasoning tasks.", "paper_summary_zh": "抽象推理，從問題的抽象本質進行推理的能力，是人類推理中概化的關鍵。然而，引發語言模型進行抽象推理仍未被探索。本文旨在通過引入一種稱為抽象思維 (AoT) 的新結構推理格式來彌補這一差距。AoT 的獨特性在於它對推理過程中不同抽象層級的明確要求。這種方法可以引發語言模型在納入具體細節之前首先思考抽象層級，而這正是現行的逐步思考鏈 (CoT) 方法所忽略的。為了使模型與 AoT 格式保持一致，我們提出了 AoT 集合，這是一個通用的微調資料集，包含 348k 個具有 AoT 推理過程的高品質範例，並透過自動化且可擴充的管道收集。我們使用 AoT 集合對各種語言模型進行微調，並對來自具有挑戰性的基準 Big-Bench Hard 的 23 個未見任務進行廣泛評估。實驗結果表明，與 AoT 推理格式保持一致的模型在許多推理任務中明顯優於與 CoT 保持一致的模型。", "author": "Ruixin Hong et.al.", "authors": "Ruixin Hong, Hongming Zhang, Xiaoman Pan, Dong Yu, Changshui Zhang", "id": "2406.12442v1", "paper_url": "http://arxiv.org/abs/2406.12442v1", "repo": "null"}}