{"2411.14461": {"publish_time": "2024-11-16", "title": "Towards Next-Generation Medical Agent: How o1 is Reshaping Decision-Making in Medical Scenarios", "paper_summary": "Artificial Intelligence (AI) has become essential in modern healthcare, with\nlarge language models (LLMs) offering promising advances in clinical\ndecision-making. Traditional model-based approaches, including those leveraging\nin-context demonstrations and those with specialized medical fine-tuning, have\ndemonstrated strong performance in medical language processing but struggle\nwith real-time adaptability, multi-step reasoning, and handling complex medical\ntasks. Agent-based AI systems address these limitations by incorporating\nreasoning traces, tool selection based on context, knowledge retrieval, and\nboth short- and long-term memory. These additional features enable the medical\nAI agent to handle complex medical scenarios where decision-making should be\nbuilt on real-time interaction with the environment. Therefore, unlike\nconventional model-based approaches that treat medical queries as isolated\nquestions, medical AI agents approach them as complex tasks and behave more\nlike human doctors. In this paper, we study the choice of the backbone LLM for\nmedical AI agents, which is the foundation for the agent's overall reasoning\nand action generation. In particular, we consider the emergent o1 model and\nexamine its impact on agents' reasoning, tool-use adaptability, and real-time\ninformation retrieval across diverse clinical scenarios, including high-stakes\nsettings such as intensive care units (ICUs). Our findings demonstrate o1's\nability to enhance diagnostic accuracy and consistency, paving the way for\nsmarter, more responsive AI tools that support better patient outcomes and\ndecision-making efficacy in clinical practice.", "paper_summary_zh": "人工智能 (AI) 已成為現代醫療保健中不可或缺的一部分，其中大型語言模型 (LLM) 為臨床決策制定提供了有希望的進展。傳統的基於模型的方法，包括利用情境中的示範和具有專業醫療微調的方法，已證明在醫學語言處理中具有強勁的性能，但在實時適應性、多步驟推理和處理複雜的醫療任務方面存在困難。基於代理的 AI 系統通過整合推理追蹤、基於情境的工具選擇、知識檢索以及短期和長期記憶來解決這些限制。這些額外的功能使醫療 AI 代理能夠處理複雜的醫療場景，在這些場景中，決策制定應建立在與環境的實時互動之上。因此，與將醫療查詢視為孤立問題的傳統基於模型的方法不同，醫療 AI 代理將它們視為複雜的任務，並且更像人類醫生。在本文中，我們研究了醫療 AI 代理的骨幹 LLM 的選擇，這是代理整體推理和動作生成的基礎。特別是，我們考慮了新興的 o1 模型，並檢查了它對代理推理、工具使用適應性和跨不同臨床場景的實時信息檢索的影響，包括重症監護病房 (ICU) 等高風險環境。我們的研究結果證明了 o1 提高診斷準確性和一致性的能力，為更智能、更靈敏的 AI 工具鋪平了道路，這些工具支持更好的患者預後和臨床實踐中的決策制定效率。", "author": "Shaochen Xu et.al.", "authors": "Shaochen Xu, Yifan Zhou, Zhengliang Liu, Zihao Wu, Tianyang Zhong, Huaqin Zhao, Yiwei Li, Hanqi Jiang, Yi Pan, Junhao Chen, Jin Lu, Wei Zhang, Tuo Zhang, Lu Zhang, Dajiang Zhu, Xiang Li, Wei Liu, Quanzheng Li, Andrea Sikora, Xiaoming Zhai, Zhen Xiang, Tianming Liu", "id": "2411.14461v1", "paper_url": "http://arxiv.org/abs/2411.14461v1", "repo": "null"}}