{"2501.07888": {"publish_time": "2025-01-14", "title": "Tarsier2: Advancing Large Vision-Language Models from Detailed Video Description to Comprehensive Video Understanding", "paper_summary": "We introduce Tarsier2, a state-of-the-art large vision-language model (LVLM)\ndesigned for generating detailed and accurate video descriptions, while also\nexhibiting superior general video understanding capabilities. Tarsier2 achieves\nsignificant advancements through three key upgrades: (1) Scaling pre-training\ndata from 11M to 40M video-text pairs, enriching both volume and diversity; (2)\nPerforming fine-grained temporal alignment during supervised fine-tuning; (3)\nUsing model-based sampling to automatically construct preference data and\napplying DPO training for optimization. Extensive experiments show that\nTarsier2-7B consistently outperforms leading proprietary models, including\nGPT-4o and Gemini 1.5 Pro, in detailed video description tasks. On the DREAM-1K\nbenchmark, Tarsier2-7B improves F1 by 2.8\\% over GPT-4o and 5.8\\% over\nGemini-1.5-Pro. In human side-by-side evaluations, Tarsier2-7B shows a +8.6\\%\nperformance advantage over GPT-4o and +24.9\\% over Gemini-1.5-Pro. Tarsier2-7B\nalso sets new state-of-the-art results across 15 public benchmarks, spanning\ntasks such as video question-answering, video grounding, hallucination test,\nand embodied question-answering, demonstrating its versatility as a robust\ngeneralist vision-language model.", "paper_summary_zh": "<paragraph>我們介紹 Tarsier2，這是一種最先進的大型視覺語言模型 (LVLM)，\n專為產生詳細且準確的影片說明而設計，同時還展現出卓越的整體影片理解能力。Tarsier2 透過三項關鍵升級實現顯著進步：(1) 將預訓練\n資料從 11M 擴充至 40M 的影片文字配對，豐富數量和多樣性；(2)\n在監督微調期間執行細緻的時間對齊；(3)\n使用基於模型的抽樣自動建構偏好資料，並應用 DPO 訓練進行最佳化。廣泛的實驗顯示，\nTarsier2-7B 在詳細的影片說明任務中始終優於領先的專有模型，包括\nGPT-4o 和 Gemini 1.5 Pro。在 DREAM-1K\n基準測試中，Tarsier2-7B 將 F1 提升了 2.8%，優於 GPT-4o，並將\nGemini-1.5-Pro 提升了 5.8%。在人類並排評估中，Tarsier2-7B 顯示出比\nGPT-4o 高出 +8.6%，比 Gemini-1.5-Pro 高出 +24.9% 的效能優勢。Tarsier2-7B\n也創下 15 個公開基準測試的最新技術成果，涵蓋影片問答、影片接地、幻覺測試，\n以及具體問題解答等任務，證明其作為強大通才視覺語言模型的多功能性。</paragraph>", "author": "Liping Yuan et.al.", "authors": "Liping Yuan, Jiawei Wang, Haomiao Sun, Yuchen Zhang, Yuan Lin", "id": "2501.07888v1", "paper_url": "http://arxiv.org/abs/2501.07888v1", "repo": "null"}}