{"2406.14106": {"publish_time": "2024-06-20", "title": "EasyECR: A Library for Easy Implementation and Evaluation of Event Coreference Resolution Models", "paper_summary": "Event Coreference Resolution (ECR) is the task of clustering event mentions\nthat refer to the same real-world event. Despite significant advancements, ECR\nresearch faces two main challenges: limited generalizability across domains due\nto narrow dataset evaluations, and difficulties in comparing models within\ndiverse ECR pipelines. To address these issues, we develop EasyECR, the first\nopen-source library designed to standardize data structures and abstract ECR\npipelines for easy implementation and fair evaluation. More specifically,\nEasyECR integrates seven representative pipelines and ten popular benchmark\ndatasets, enabling model evaluations on various datasets and promoting the\ndevelopment of robust ECR pipelines. By conducting extensive evaluation via our\nEasyECR, we find that, \\lowercase\\expandafter{\\romannumeral1}) the\nrepresentative ECR pipelines cannot generalize across multiple datasets, hence\nevaluating ECR pipelines on multiple datasets is necessary,\n\\lowercase\\expandafter{\\romannumeral2}) all models in ECR pipelines have a\ngreat effect on pipeline performance, therefore, when one model in ECR\npipelines are compared, it is essential to ensure that the other models remain\nconsistent. Additionally, reproducing ECR results is not trivial, and the\ndeveloped library can help reduce this discrepancy. The experimental results\nprovide valuable baselines for future research.", "paper_summary_zh": "事件共指解析（ECR）是將指涉相同真實世界事件的事件提及進行分群的任務。儘管有顯著的進展，ECR 研究面臨兩項主要挑戰：由於評估資料集狹窄，導致跨領域的通用性受限，以及在不同的 ECR 管線中比較模型的困難。為了解決這些問題，我們開發了 EasyECR，這是第一個開放原始碼函式庫，旨在標準化資料結構和抽象 ECR 管線，以便輕鬆實作和公平評估。更具體地說，EasyECR 整合了七個具代表性的管線和十個流行的基準資料集，讓模型能夠在各種資料集上進行評估，並促進穩健 ECR 管線的開發。透過 EasyECR 進行廣泛的評估，我們發現，\\lowercase\\expandafter{\\romannumeral1}) 具代表性的 ECR 管線無法在多個資料集上進行概化，因此，在多個資料集上評估 ECR 管線是必要的，\\lowercase\\expandafter{\\romannumeral2}) ECR 管線中的所有模型對管線效能都有很大的影響，因此，當比較 ECR 管線中的某個模型時，必須確保其他模型保持一致。此外，複製 ECR 結果並非易事，而開發的函式庫可以幫助減少這種差異。實驗結果為未來的研究提供了有價值的基準。", "author": "Yuncong Li et.al.", "authors": "Yuncong Li, Tianhua Xu, Sheng-hua Zhong, Haiqin Yang", "id": "2406.14106v1", "paper_url": "http://arxiv.org/abs/2406.14106v1", "repo": "null"}}