{"2412.19228": {"publish_time": "2024-12-26", "title": "Learning Cross-Domain Representations for Transferable Drug Perturbations on Single-Cell Transcriptional Responses", "paper_summary": "Phenotypic drug discovery has attracted widespread attention because of its\npotential to identify bioactive molecules. Transcriptomic profiling provides a\ncomprehensive reflection of phenotypic changes in cellular responses to\nexternal perturbations. In this paper, we propose XTransferCDR, a novel\ngenerative framework designed for feature decoupling and transferable\nrepresentation learning across domains. Given a pair of perturbed expression\nprofiles, our approach decouples the perturbation representations from basal\nstates through domain separation encoders and then cross-transfers them in the\nlatent space. The transferred representations are then used to reconstruct the\ncorresponding perturbed expression profiles via a shared decoder. This\ncross-transfer constraint effectively promotes the learning of transferable\ndrug perturbation representations. We conducted extensive evaluations of our\nmodel on multiple datasets, including single-cell transcriptional responses to\ndrugs and single- and combinatorial genetic perturbations. The experimental\nresults show that XTransferCDR achieved better performance than current\nstate-of-the-art methods, showcasing its potential to advance phenotypic drug\ndiscovery.", "paper_summary_zh": "表型药物发现因其识别生物活性分子的潜力而备受关注。转录组分析全面反映了细胞对外部扰动的表型变化。在本文中，我们提出了 XTransferCDR，这是一种新颖的生成框架，旨在实现跨域特征解耦和可转移表示学习。给定一对扰动表达谱，我们的方法通过域分离编码器将扰动表示从基础状态中解耦，然后在潜在空间中交叉转移它们。然后使用转移的表示通过共享解码器重建相应的扰动表达谱。这种交叉转移约束有效地促进了可转移药物扰动表示的学习。我们对我们的模型在多个数据集上进行了广泛的评估，包括药物的单细胞转录反应以及单一和组合的遗传扰动。实验结果表明，XTransferCDR 的性能优于当前最先进的方法，展示了其推进表型药物发现的潜力。", "author": "Hui Liu et.al.", "authors": "Hui Liu, Shikai Jin", "id": "2412.19228v1", "paper_url": "http://arxiv.org/abs/2412.19228v1", "repo": "https://github.com/hliulab/xtransfercdr"}}