{"2409.05356": {"publish_time": "2024-09-09", "title": "IndicVoices-R: Unlocking a Massive Multilingual Multi-speaker Speech Corpus for Scaling Indian TTS", "paper_summary": "Recent advancements in text-to-speech (TTS) synthesis show that large-scale\nmodels trained with extensive web data produce highly natural-sounding output.\nHowever, such data is scarce for Indian languages due to the lack of\nhigh-quality, manually subtitled data on platforms like LibriVox or YouTube. To\naddress this gap, we enhance existing large-scale ASR datasets containing\nnatural conversations collected in low-quality environments to generate\nhigh-quality TTS training data. Our pipeline leverages the cross-lingual\ngeneralization of denoising and speech enhancement models trained on English\nand applied to Indian languages. This results in IndicVoices-R (IV-R), the\nlargest multilingual Indian TTS dataset derived from an ASR dataset, with 1,704\nhours of high-quality speech from 10,496 speakers across 22 Indian languages.\nIV-R matches the quality of gold-standard TTS datasets like LJSpeech, LibriTTS,\nand IndicTTS. We also introduce the IV-R Benchmark, the first to assess\nzero-shot, few-shot, and many-shot speaker generalization capabilities of TTS\nmodels on Indian voices, ensuring diversity in age, gender, and style. We\ndemonstrate that fine-tuning an English pre-trained model on a combined dataset\nof high-quality IndicTTS and our IV-R dataset results in better zero-shot\nspeaker generalization compared to fine-tuning on the IndicTTS dataset alone.\nFurther, our evaluation reveals limited zero-shot generalization for Indian\nvoices in TTS models trained on prior datasets, which we improve by fine-tuning\nthe model on our data containing diverse set of speakers across language\nfamilies. We open-source all data and code, releasing the first TTS model for\nall 22 official Indian languages.", "paper_summary_zh": "最近在文本转语音（TTS）合成方面的进步表明，使用大量网络数据训练的大型模型会产生听起来非常自然的声音。然而，由于缺乏 LibriVox 或 YouTube 等平台上高质量的手动字幕数据，此类数据对于印度语言来说非常稀缺。为了解决这一差距，我们增强了现有的包含在低质量环境中收集的自然对话的大型 ASR 数据集，以生成高质量的 TTS 训练数据。我们的管道利用了在英语上训练的去噪和语音增强模型的跨语言泛化，并将其应用于印度语言。这产生了 IndicVoices-R (IV-R)，这是从 ASR 数据集派生的最大的多语言印度 TTS 数据集，包含来自 22 种印度语言的 10,496 名说话者的 1,704 小时高质量语音。IV-R 与 LJSpeech、LibriTTS 和 IndicTTS 等黄金标准 TTS 数据集的质量相匹配。我们还引入了 IV-R 基准，这是第一个评估 TTS 模型在印度语音上的零样本、少样本和多样本说话者泛化能力的基准，确保了年龄、性别和风格的多样性。我们证明，在高质量 IndicTTS 和我们的 IV-R 数据集的组合数据集上微调英语预训练模型与仅在 IndicTTS 数据集上微调相比，产生了更好的零样本说话者泛化。此外，我们的评估显示，在先验数据集上训练的 TTS 模型中，印度语音的零样本泛化能力有限，而我们通过微调包含跨语言系列的不同说话者集合的数据模型来改进泛化能力。我们开源所有数据和代码，发布了首个适用于所有 22 种官方印度语言的 TTS 模型。", "author": "Ashwin Sankar et.al.", "authors": "Ashwin Sankar, Srija Anand, Praveen Srinivasa Varadhan, Sherry Thomas, Mehak Singal, Shridhar Kumar, Deovrat Mehendale, Aditi Krishana, Giri Raju, Mitesh Khapra", "id": "2409.05356v1", "paper_url": "http://arxiv.org/abs/2409.05356v1", "repo": "https://github.com/ai4bharat/indicvoices-r"}}