{"2408.08610": {"publish_time": "2024-08-16", "title": "Generative Dataset Distillation Based on Diffusion Model", "paper_summary": "This paper presents our method for the generative track of The First Dataset\nDistillation Challenge at ECCV 2024. Since the diffusion model has become the\nmainstay of generative models because of its high-quality generative effects,\nwe focus on distillation methods based on the diffusion model. Considering that\nthe track can only generate a fixed number of images in 10 minutes using a\ngenerative model for CIFAR-100 and Tiny-ImageNet datasets, we need to use a\ngenerative model that can generate images at high speed. In this study, we\nproposed a novel generative dataset distillation method based on Stable\nDiffusion. Specifically, we use the SDXL-Turbo model which can generate images\nat high speed and quality. Compared to other diffusion models that can only\ngenerate images per class (IPC) = 1, our method can achieve an IPC = 10 for\nTiny-ImageNet and an IPC = 20 for CIFAR-100, respectively. Additionally, to\ngenerate high-quality distilled datasets for CIFAR-100 and Tiny-ImageNet, we\nuse the class information as text prompts and post data augmentation for the\nSDXL-Turbo model. Experimental results show the effectiveness of the proposed\nmethod, and we achieved third place in the generative track of the ECCV 2024 DD\nChallenge. Codes are available at https://github.com/Guang000/BANKO.", "paper_summary_zh": "本文介紹我們在 ECCV 2024 第一次資料集蒸餾挑戰的生成軌跡方法。由於擴散模型因為其高品質的生成效果而成為生成模型的主流，我們專注於基於擴散模型的蒸餾方法。考量到軌跡只能使用 CIFAR-100 和 Tiny-ImageNet 資料集的生成模型在 10 分鐘內生成固定數量的影像，我們需要使用能夠高速生成影像的生成模型。在本研究中，我們提出一個基於 Stable Diffusion 的新穎生成資料集蒸餾方法。具體來說，我們使用能夠高速高品質生成影像的 SDXL-Turbo 模型。與每類只能生成 1 張影像 (IPC) = 1 的其他擴散模型相比，我們的模型可以分別為 Tiny-ImageNet 達到 IPC = 10，為 CIFAR-100 達到 IPC = 20。此外，為了生成 CIFAR-100 和 Tiny-ImageNet 的高品質蒸餾資料集，我們使用類別資訊作為文字提示，並為 SDXL-Turbo 模型進行後資料擴充。實驗結果顯示所提出方法的有效性，我們在 ECCV 2024 DD 挑戰的生成軌跡中獲得第三名。程式碼可在 https://github.com/Guang000/BANKO 取得。", "author": "Duo Su et.al.", "authors": "Duo Su, Junjie Hou, Guang Li, Ren Togo, Rui Song, Takahiro Ogawa, Miki Haseyama", "id": "2408.08610v1", "paper_url": "http://arxiv.org/abs/2408.08610v1", "repo": "https://github.com/guang000/banko"}}