{"2407.02880": {"publish_time": "2024-07-03", "title": "Knowledge Composition using Task Vectors with Learned Anisotropic Scaling", "paper_summary": "Pre-trained models produce strong generic representations that can be adapted\nvia fine-tuning. The learned weight difference relative to the pre-trained\nmodel, known as a task vector, characterises the direction and stride of\nfine-tuning. The significance of task vectors is such that simple arithmetic\noperations on them can be used to combine diverse representations from\ndifferent domains. This paper builds on these properties of task vectors and\naims to answer (1) whether components of task vectors, particularly parameter\nblocks, exhibit similar characteristics, and (2) how such blocks can be used to\nenhance knowledge composition and transfer. To this end, we introduce aTLAS, an\nalgorithm that linearly combines parameter blocks with different learned\ncoefficients, resulting in anisotropic scaling at the task vector level. We\nshow that such linear combinations explicitly exploit the low intrinsic\ndimensionality of pre-trained models, with only a few coefficients being the\nlearnable parameters. Furthermore, composition of parameter blocks leverages\nthe already learned representations, thereby reducing the dependency on large\namounts of data. We demonstrate the effectiveness of our method in task\narithmetic, few-shot recognition and test-time adaptation, with supervised or\nunsupervised objectives. In particular, we show that (1) learned anisotropic\nscaling allows task vectors to be more disentangled, causing less interference\nin composition; (2) task vector composition excels with scarce or no labeled\ndata and is less prone to domain shift, thus leading to better\ngeneralisability; (3) mixing the most informative parameter blocks across\ndifferent task vectors prior to training can reduce the memory footprint and\nimprove the flexibility of knowledge transfer. Moreover, we show the potential\nof aTLAS as a PEFT method, particularly with less data, and demonstrate that\nits scalibility.", "paper_summary_zh": "<paragraph>預先訓練的模型會產生強大的通用表示，可透過微調進行調整。相對於預先訓練模型的學習權重差異，稱為任務向量，特徵化了微調的方向和步幅。任務向量的意義在於，對它們進行簡單的算術運算可結合來自不同領域的多元表示。本文建立在任務向量的這些屬性之上，並旨在回答 (1) 任務向量的組成部分，特別是參數塊，是否展現出相似的特徵，以及 (2) 這些區塊如何用於增強知識組合和轉移。為此，我們引入了 aTLAS，一種將參數塊與不同的學習係數線性結合的演算法，導致任務向量層級的異向縮放。我們證明了這種線性組合明確地利用了預先訓練模型的低內在維度，只有少數係數是可學習的參數。此外，參數塊的組合利用了已學習的表示，從而減少了對大量資料的依賴。我們展示了我們的方法在任務算術、少次學習識別和測試時間適應中的有效性，並具有監督或非監督的目標。特別是，我們證明了 (1) 學習的異向縮放允許任務向量更為解開，導致組合中較少的干擾；(2) 任務向量組合在稀少或沒有標籤資料的情況下表現出色，並且較不易受到領域轉移的影響，從而導致更好的泛化能力；(3) 在訓練之前混合不同任務向量中最具資訊性的參數塊可以減少記憶體佔用空間並提高知識轉移的靈活性。此外，我們展示了 aTLAS 作為 PEFT 方法的潛力，特別是在資料較少的情況下，並證明了其可擴充性。</paragraph>", "author": "Frederic Z. Zhang et.al.", "authors": "Frederic Z. Zhang, Paul Albert, Cristian Rodriguez-Opazo, Anton van den Hengel, Ehsan Abbasnejad", "id": "2407.02880v1", "paper_url": "http://arxiv.org/abs/2407.02880v1", "repo": "https://github.com/fredzzhang/atlas"}}