{"2412.07367": {"publish_time": "2024-12-10", "title": "My Words Imply Your Opinion: Reader Agent-Based Propagation Enhancement for Personalized Implicit Emotion Analysis", "paper_summary": "In implicit emotion analysis (IEA), the subtlety of emotional expressions\nmakes it particularly sensitive to user-specific characteristics. Existing\nstudies often inject personalization into the analysis by focusing on the\nauthorial dimension of the emotional text. However, these methods overlook the\npotential influence of the intended reader on the reaction of implicit\nemotions. In this paper, we refine the IEA task to Personalized Implicit\nEmotion Analysis (PIEA) and introduce the RAPPIE model, a novel framework\ndesigned to address the issue of missing user information within this task. In\nparticular, 1) we create reader agents based on the Large Language Model to\nsimulate reader reactions, to address challenges of the spiral of silence and\ndata incompleteness encountered when acquiring reader feedback information. 2)\nWe establish a reader propagation role system and develop a role-aware emotion\npropagation multi-view graph learning model, which effectively deals with the\nsparsity of reader information by utilizing the distribution of propagation\nroles. 3) We annotate two Chinese PIEA datasets with detailed user metadata,\nthereby addressing the limitation of prior datasets that primarily focus on\ntextual content annotation. Extensive experiments on these datasets indicate\nthat the RAPPIE model outperforms current state-of-the-art baselines,\nhighlighting the significance and efficacy of incorporating reader feedback\ninto the PIEA process.", "paper_summary_zh": "在隐式情感分析 (IEA) 中，情感表达的微妙性使其对特定于用户的特征特别敏感。现有的研究通常通过关注情感文本的作者维度来将个性化注入到分析中。然而，这些方法忽略了预期读者对隐式情感反应的潜在影响。在本文中，我们将 IEA 任务细化为个性化隐式情感分析 (PIEA)，并引入 RAPPIE 模型，这是一个新颖的框架，旨在解决此任务中缺少用户信息的问题。特别是，1) 我们基于大型语言模型创建读者代理来模拟读者反应，以解决在获取读者反馈信息时遇到的沉默螺旋和数据不完整性的挑战。2) 我们建立了一个读者传播角色系统，并开发了一个角色感知情绪传播多视图图学习模型，该模型通过利用传播角色的分布有效地处理读者信息的稀疏性。3) 我们使用详细的用户元数据注释了两个中文 PIEA 数据集，从而解决了先前主要专注于文本内容注释的数据集的局限性。在这些数据集上进行的广泛实验表明，RAPPIE 模型优于当前最先进的基线，突出了将读者反馈纳入 PIEA 过程的重要性及有效性。", "author": "Jian Liao et.al.", "authors": "Jian Liao, Yu Feng, Xiaoyu Wang, Suge Wang, Jianxing Zheng, Deyu Li", "id": "2412.07367v1", "paper_url": "http://arxiv.org/abs/2412.07367v1", "repo": "null"}}