{"2409.10997": {"publish_time": "2024-09-17", "title": "Contextual Breach: Assessing the Robustness of Transformer-based QA Models", "paper_summary": "Contextual question-answering models are susceptible to adversarial\nperturbations to input context, commonly observed in real-world scenarios.\nThese adversarial noises are designed to degrade the performance of the model\nby distorting the textual input. We introduce a unique dataset that\nincorporates seven distinct types of adversarial noise into the context, each\napplied at five different intensity levels on the SQuAD dataset. To quantify\nthe robustness, we utilize robustness metrics providing a standardized measure\nfor assessing model performance across varying noise types and levels.\nExperiments on transformer-based question-answering models reveal robustness\nvulnerabilities and important insights into the model's performance in\nrealistic textual input.", "paper_summary_zh": "情境式問答模型容易受到對抗性的輸入情境擾動，這在現實世界中很常見。這些對抗性雜訊旨在透過扭曲文字輸入來降低模型的效能。我們引入了一個獨特的資料集，其中包含七種類型的對抗性雜訊，每種類型在 SQuAD 資料集上以五個不同的強度等級應用。為了量化穩健性，我們利用穩健性指標提供標準化的測量，用於評估模型在不同雜訊類型和層級下的效能。在基於Transformer的問答模型上進行的實驗揭示了穩健性漏洞，並對模型在現實文字輸入中的效能提供了重要的見解。", "author": "Asir Saadat et.al.", "authors": "Asir Saadat, Nahian Ibn Asad, Md Farhan Ishmam", "id": "2409.10997v2", "paper_url": "http://arxiv.org/abs/2409.10997v2", "repo": "null"}}