{"2411.09180": {"publish_time": "2024-11-14", "title": "LEAP:D - A Novel Prompt-based Approach for Domain-Generalized Aerial Object Detection", "paper_summary": "Drone-captured images present significant challenges in object detection due\nto varying shooting conditions, which can alter object appearance and shape.\nFactors such as drone altitude, angle, and weather cause these variations,\ninfluencing the performance of object detection algorithms. To tackle these\nchallenges, we introduce an innovative vision-language approach using learnable\nprompts. This shift from conventional manual prompts aims to reduce\ndomain-specific knowledge interference, ultimately improving object detection\ncapabilities. Furthermore, we streamline the training process with a one-step\napproach, updating the learnable prompt concurrently with model training,\nenhancing efficiency without compromising performance. Our study contributes to\ndomain-generalized object detection by leveraging learnable prompts and\noptimizing training processes. This enhances model robustness and adaptability\nacross diverse environments, leading to more effective aerial object detection.", "paper_summary_zh": "無人機拍攝的影像在物體偵測方面面臨重大挑戰，原因在於拍攝條件多變，可能會改變物體的外觀和形狀。無人機高度、角度和天氣等因素會造成這些變化，影響物體偵測演算法的效能。為了應對這些挑戰，我們引進一種創新的視覺語言方法，使用可學習提示。這種從傳統手動提示的轉變旨在減少特定領域知識的干擾，最終提升物體偵測能力。此外，我們透過單步驟方法簡化訓練流程，在模型訓練的同時更新可學習提示，在不影響效能的情況下提升效率。我們的研究透過利用可學習提示和最佳化訓練流程，有助於領域概括的物體偵測。這增強了模型的穩健性和適應性，適用於各種環境，進而提升空中物體偵測的效能。", "author": "Chanyeong Park et.al.", "authors": "Chanyeong Park, Heegwang Kim, Joonki Paik", "id": "2411.09180v1", "paper_url": "http://arxiv.org/abs/2411.09180v1", "repo": "null"}}