{"2406.16756": {"publish_time": "2024-06-24", "title": "Addressing Polarization and Unfairness in Performative Prediction", "paper_summary": "When machine learning (ML) models are used in applications that involve\nhumans (e.g., online recommendation, school admission, hiring, lending), the\nmodel itself may trigger changes in the distribution of targeted data it aims\nto predict. Performative prediction (PP) is a framework that explicitly\nconsiders such model-dependent distribution shifts when learning ML models.\nWhile significant efforts have been devoted to finding performative stable (PS)\nsolutions in PP for system robustness, their societal implications are less\nexplored and it is unclear whether PS solutions are aligned with social norms\nsuch as fairness. In this paper, we set out to examine the fairness property of\nPS solutions in performative prediction. We first show that PS solutions can\nincur severe polarization effects and group-wise loss disparity. Although\nexisting fairness mechanisms commonly used in literature can help mitigate\nunfairness, they may fail and disrupt the stability under model-dependent\ndistribution shifts. We thus propose novel fairness intervention mechanisms\nthat can simultaneously achieve both stability and fairness in PP settings.\nBoth theoretical analysis and experiments are provided to validate the proposed\nmethod.", "paper_summary_zh": "當機器學習 (ML) 模型用於涉及人類的應用程式（例如，線上推薦、學校錄取、聘僱、借貸）時，模型本身可能會觸發其試圖預測的目標資料分佈的變化。執行預測 (PP) 是一個框架，在學習 ML 模型時，會明確考量此類模型依賴的分佈轉移。儘管已投入大量心力在 PP 中尋找執行穩定 (PS) 的解決方案，以確保系統穩健性，但其社會意涵較少被探討，而且不清楚 PS 解決方案是否符合公平性等社會規範。在本文中，我們著手檢視執行預測中 PS 解決方案的公平性屬性。我們首先說明 PS 解決方案可能會造成嚴重的兩極化效應和群組間損失差異。儘管現有文獻中常用的公平性機制有助於減輕不公平性，但它們可能在模型依賴的分佈轉移下失敗並破壞穩定性。因此，我們提出創新的公平性介入機制，可以在 PP 設定中同時達成穩定性和公平性。提供理論分析和實驗，以驗證所提出的方法。", "author": "Kun Jin et.al.", "authors": "Kun Jin, Tian Xie, Yang Liu, Xueru Zhang", "id": "2406.16756v1", "paper_url": "http://arxiv.org/abs/2406.16756v1", "repo": "null"}}