{"2406.16526": {"publish_time": "2024-06-24", "title": "NARRepair: Non-Autoregressive Code Generation Model for Automatic Program Repair", "paper_summary": "With the advancement of deep learning techniques, the performance of\nAutomatic Program Repair(APR) techniques has reached a new level. Previous deep\nlearning-based APR techniques essentially modified program sentences in the\nAutoregressive(AR) manner, which predicts future values based on past values.\nDue to the manner of word-by-word generation, the AR-based APR technique has a\nhuge time delay. This negative consequence overshadows the widespread adoption\nof APR techniques in real-life software development.\n  To address the issue, we aim to apply the Non-Autoregressive(NAR) method to\nthe APR task, which can output target code in a parallel manner to avoid huge\ninference delays. To effectively adapt the NAR manner for the APR task, we in\nthis paper propose NARRepair, the first customized NAR code generation model\nfor the APR task. The NARRepair features three major novelties, including 1)\nusing repair actions to alleviate the over-correction issue, 2) extracting\ndependency information from AST to alleviate the issue of lacking inter-word\ndependency information, 3) employing two-stage decoding to alleviate the issue\nof lacking contextual information. We evaluated NARRepair on three widely used\ndatasets in the APR community, and the results show that our technique can\nsignificantly improve the inference speed while maintaining high repair\naccuracy.", "paper_summary_zh": "隨著深度學習技術的進步，自動程式修復 (APR) 技術的效能已達到新的層級。先前的基於深度學習的 APR 技術基本上以自迴歸 (AR) 的方式修改程式句子，它根據過去的值預測未來值。由於逐字產生的方式，基於 AR 的 APR 技術具有巨大的時間延遲。這個負面後果影響了 APR 技術在實際軟體開發中的廣泛採用。\n為了解決這個問題，我們旨在將非自迴歸 (NAR) 方法應用於 APR 任務，它可以並行輸出目標程式碼以避免巨大的推論延遲。為了有效地將 NAR 方式改編為 APR 任務，我們在本文中提出了 NARRepair，這是第一個針對 APR 任務量身打造的 NAR 程式碼生成模型。NARRepair 具有三大創新，包括 1) 使用修復動作來減輕過度修正問題，2) 從 AST 中提取依賴資訊以減輕缺乏字元間依賴資訊的問題，3) 採用兩階段解碼來減輕缺乏上下文資訊的問題。我們在 APR 社群中廣泛使用的三個資料集上評估了 NARRepair，結果顯示我們的技術可以在維持高修復精確度的同時，顯著提升推論速度。", "author": "Zhenyu Yang et.al.", "authors": "Zhenyu Yang, Zhen Yang, Zhongxing Yu", "id": "2406.16526v1", "paper_url": "http://arxiv.org/abs/2406.16526v1", "repo": "null"}}