{"2407.07890": {"publish_time": "2024-07-10", "title": "Training on the Test Task Confounds Evaluation and Emergence", "paper_summary": "We study a fundamental problem in the evaluation of large language models\nthat we call training on the test task. Unlike wrongful practices like training\non the test data, leakage, or data contamination, training on the test task is\nnot a malpractice. Rather, the term describes a growing set of techniques to\ninclude task-relevant data in the pretraining stage of a language model. We\ndemonstrate that training on the test task confounds both relative model\nevaluations and claims about emergent capabilities. We argue that the seeming\nsuperiority of one model family over another may be explained by a different\ndegree of training on the test task. To this end, we propose an effective\nmethod to adjust for training on the test task by fine-tuning each model under\ncomparison on the same task-relevant data before evaluation. We then show that\ninstances of emergent behavior largely vanish once we adjust for training on\nthe test task. This also applies to reported instances of emergent behavior\nthat cannot be explained by the choice of evaluation metric. Our work promotes\na new perspective on the evaluation of large language models with broad\nimplications for benchmarking and the study of emergent capabilities.", "paper_summary_zh": "我們研究大型語言模型評估中一個基本的難題，我們稱之為測試任務訓練。與訓練測試資料、洩漏或資料污染等不當做法不同，訓練測試任務並非一種不正當行為。反之，此術語描述了一組日益增長的技術，用於在語言模型的預訓練階段納入與任務相關的資料。我們證明，訓練測試任務會混淆相對模型評估和關於新興能力的主張。我們認為，一個模型家族看似優於另一個模型家族，可能是由於訓練測試任務的程度不同。為此，我們提出了一種有效的方法來調整訓練測試任務，方法是在評估之前使用相同的任務相關資料對每個模型進行微調。然後，我們表明，一旦我們調整訓練測試任務，新興行為的實例就會在很大程度上消失。這也適用於無法用評估指標的選擇來解釋的新興行為的報告實例。我們的研究促進了對大型語言模型評估的新觀點，對基準測試和新興能力的研究具有廣泛的影響。", "author": "Ricardo Dominguez-Olmedo et.al.", "authors": "Ricardo Dominguez-Olmedo, Florian E. Dorner, Moritz Hardt", "id": "2407.07890v1", "paper_url": "http://arxiv.org/abs/2407.07890v1", "repo": "https://github.com/socialfoundations/training-on-the-test-task"}}