{"2406.16864": {"publish_time": "2024-06-24", "title": "StableNormal: Reducing Diffusion Variance for Stable and Sharp Normal", "paper_summary": "This work addresses the challenge of high-quality surface normal estimation\nfrom monocular colored inputs (i.e., images and videos), a field which has\nrecently been revolutionized by repurposing diffusion priors. However, previous\nattempts still struggle with stochastic inference, conflicting with the\ndeterministic nature of the Image2Normal task, and costly ensembling step,\nwhich slows down the estimation process. Our method, StableNormal, mitigates\nthe stochasticity of the diffusion process by reducing inference variance, thus\nproducing \"Stable-and-Sharp\" normal estimates without any additional ensembling\nprocess. StableNormal works robustly under challenging imaging conditions, such\nas extreme lighting, blurring, and low quality. It is also robust against\ntransparent and reflective surfaces, as well as cluttered scenes with numerous\nobjects. Specifically, StableNormal employs a coarse-to-fine strategy, which\nstarts with a one-step normal estimator (YOSO) to derive an initial normal\nguess, that is relatively coarse but reliable, then followed by a\nsemantic-guided refinement process (SG-DRN) that refines the normals to recover\ngeometric details. The effectiveness of StableNormal is demonstrated through\ncompetitive performance in standard datasets such as DIODE-indoor, iBims,\nScannetV2 and NYUv2, and also in various downstream tasks, such as surface\nreconstruction and normal enhancement. These results evidence that StableNormal\nretains both the \"stability\" and \"sharpness\" for accurate normal estimation.\nStableNormal represents a baby attempt to repurpose diffusion priors for\ndeterministic estimation. To democratize this, code and models have been\npublicly available in hf.co/Stable-X", "paper_summary_zh": "这项工作解决了从单目彩色输入（即图像和视频）中估计高质量表面法线的问题，该领域最近因重新利用扩散先验而发生了革命性的变化。然而，以往的尝试仍然难以应对随机推理，与 Image2Normal 任务的确定性本质相冲突，并且代价高昂的集成步骤减慢了估计过程。我们的方法 StableNormal 通过降低推理方差来减轻扩散过程的随机性，从而在没有任何额外集成过程的情况下生成“稳定而清晰”的法线估计。StableNormal 在极端光照、模糊和低质量等具有挑战性的成像条件下表现得非常稳健。它还对透明和反射表面以及包含大量对象的混乱场景具有鲁棒性。具体来说，StableNormal 采用了一种从粗到精的策略，从一步法线估计器 (YOSO) 开始，推导出一个初始法线猜测，该猜测相对粗糙但可靠，然后是语义引导细化过程 (SG-DRN)，该过程细化法线以恢复几何细节。StableNormal 的有效性通过在 DIODE-indoor、iBims、ScannetV2 和 NYUv2 等标准数据集以及曲面重建和法线增强等各种下游任务中的竞争性能得到证明。这些结果证明 StableNormal 保留了“稳定性”和“清晰度”，以进行准确的法线估计。StableNormal 代表了重新利用扩散先验进行确定性估计的婴儿尝试。为了实现这一目标，代码和模型已在 hf.co/Stable-X 公开。", "author": "Chongjie Ye et.al.", "authors": "Chongjie Ye, Lingteng Qiu, Xiaodong Gu, Qi Zuo, Yushuang Wu, Zilong Dong, Liefeng Bo, Yuliang Xiu, Xiaoguang Han", "id": "2406.16864v1", "paper_url": "http://arxiv.org/abs/2406.16864v1", "repo": "null"}}