{"2405.04955": {"publish_time": "2024-05-08", "title": "Improving Long Text Understanding with Knowledge Distilled from Summarization Model", "paper_summary": "Long text understanding is important yet challenging for natural language\nprocessing. A long article or document usually contains many redundant words\nthat are not pertinent to its gist and sometimes can be regarded as noise. With\nrecent advances of abstractive summarization, we propose our \\emph{Gist\nDetector} to leverage the gist detection ability of a summarization model and\nintegrate the extracted gist into downstream models to enhance their long text\nunderstanding ability. Specifically, Gist Detector first learns the gist\ndetection knowledge distilled from a summarization model, and then produces\ngist-aware representations to augment downstream models. We evaluate our method\non three different tasks: long document classification, distantly supervised\nopen-domain question answering, and non-parallel text style transfer. The\nexperimental results show that our method can significantly improve the\nperformance of baseline models on all tasks.", "paper_summary_zh": "長文本理解對自然語言處理來說很重要，但也具有挑戰性。長篇論文或文件通常包含許多與其要旨無關的冗餘字詞，有時可以被視為雜訊。隨著摘要摘要的最新進展，我們提出我們的「要點偵測器」，以利用摘要模型的要點偵測能力，並將提取出的要點整合到下游模型中，以增強其長文本理解能力。具體來說，要點偵測器首先學習從摘要模型中提煉出的要點偵測知識，然後產生要點感知表示，以擴充下游模型。我們對我們的模型進行了三項不同的任務評估：長文分類、遠程監督的開放領域問答和非平行文本風格轉換。實驗結果表明，我們的模型可以在所有任務上顯著提高基線模型的效能。", "author": "Yan Liu et.al.", "authors": "Yan Liu, Yazheng Yang, Xiaokang Chen", "id": "2405.04955v1", "paper_url": "http://arxiv.org/abs/2405.04955v1", "repo": "null"}}