{"2411.08563": {"publish_time": "2024-11-13", "title": "Leveraging LLMs for Predictive Insights in Food Policy and Behavioral Interventions", "paper_summary": "Food consumption and production contribute significantly to global greenhouse\ngas emissions, making them crucial entry points for mitigating climate change\nand maintaining a liveable planet. Over the past two decades, food policy\ninitiatives have explored interventions to reshape production and consumption\npatterns, focusing on reducing food waste and curbing ruminant meat\nconsumption. While the evidence of \"what works\" improves, evaluating which\npolicies are appropriate and effective in specific contexts remains difficult\ndue to external validity challenges. This paper demonstrates that a fine-tuned\nlarge language model (LLM) can accurately predict the direction of outcomes in\napproximately 80\\% of empirical studies measuring dietary-based impacts (e.g.\nfood choices, sales, waste) resulting from behavioral interventions and\npolicies. Approximately 75 prompts were required to achieve optimal results,\nwith performance showing signs of catastrophic loss beyond this point. Our\nfindings indicate that greater input detail enhances predictive accuracy,\nalthough the model still faces challenges with unseen studies, underscoring the\nimportance of a representative training sample. As LLMs continue to improve and\ndiversify, they hold promise for advancing data-driven, evidence-based\npolicymaking.", "paper_summary_zh": "食品消費和生產對全球溫室氣體排放有顯著影響，這使其成為減輕氣候變遷和維持宜居地球的重要切入點。在過去二十年來，食品政策倡議探索了重塑生產和消費模式的干預措施，重點在於減少食物浪費和遏制反芻動物肉類消費。儘管「有效方法」的證據有所改善，但由於外部效度挑戰，評估哪些政策在特定背景下適當且有效仍然很困難。本文證明，經過微調的大型語言模型 (LLM) 可以準確預測約 80% 測量飲食影響的實證研究結果的方向（例如，食物選擇、銷售、浪費），這些影響是由行為干預和政策造成的。大約需要 75 個提示才能達到最佳結果，而效能在此點之後顯示出災難性損失的跡象。我們的研究結果表明，輸入的詳細資料越多，預測準確性就越高，儘管該模型在面對未見過的研究時仍面臨挑戰，這強調了具有代表性的訓練樣本的重要性。隨著 LLM 持續改善和多元化，它們有望推進資料驅動的、基於證據的政策制定。", "author": "Micha Kaiser et.al.", "authors": "Micha Kaiser, Paul Lohmann, Peter Ochieng, Billy Shi, Cass R. Sunstein, Lucia A. Reisch", "id": "2411.08563v1", "paper_url": "http://arxiv.org/abs/2411.08563v1", "repo": "null"}}