{"2412.15467": {"publish_time": "2024-12-20", "title": "Non-Uniform Parameter-Wise Model Merging", "paper_summary": "Combining multiple machine learning models has long been a technique for\nenhancing performance, particularly in distributed settings. Traditional\napproaches, such as model ensembles, work well, but are expensive in terms of\nmemory and compute. Recently, methods based on averaging model parameters have\nachieved good results in some settings and have gained popularity. However,\nmerging models initialized differently that do not share a part of their\ntraining trajectories can yield worse results than simply using the base\nmodels, even after aligning their neurons. In this paper, we introduce a novel\napproach, Non-uniform Parameter-wise Model Merging, or NP Merge, which merges\nmodels by learning the contribution of each parameter to the final model using\ngradient-based optimization. We empirically demonstrate the effectiveness of\nour method for merging models of various architectures in multiple settings,\noutperforming past methods. We also extend NP Merge to handle the merging of\nmultiple models, showcasing its scalability and robustness.", "paper_summary_zh": "將多個機器學習模型結合在一起，一直以來都是一種增強效能的技術，特別是在分散式設定中。傳統方法，例如模型組合，效果很好，但在記憶體和運算方面成本很高。最近，基於平均模型參數的方法在某些設定中取得了不錯的成果，並獲得了普及。然而，合併初始化不同的模型，這些模型沒有共用其訓練軌跡的一部分，可能會產生比僅使用基礎模型更差的結果，即使在調整其神經元之後也是如此。在本文中，我們介紹了一種新方法，非均勻參數模型合併，或 NP Merge，它通過使用基於梯度的最佳化來學習每個參數對最終模型的貢獻，從而合併模型。我們實證展示了我們的方法在多種設定中合併各種架構模型的有效性，其效能優於過去的方法。我們還擴充了 NP Merge 以處理多個模型的合併，展示了其可擴充性和穩健性。", "author": "Albert Manuel Orozco Camacho et.al.", "authors": "Albert Manuel Orozco Camacho, Stefan Horoi, Guy Wolf, Eugene Belilovsky", "id": "2412.15467v1", "paper_url": "http://arxiv.org/abs/2412.15467v1", "repo": "null"}}