{"2502.04564": {"publish_time": "2025-02-06", "title": "My LLM might Mimic AAE -- But When Should it?", "paper_summary": "We examine the representation of African American English (AAE) in large\nlanguage models (LLMs), exploring (a) the perceptions Black Americans have of\nhow effective these technologies are at producing authentic AAE, and (b) in\nwhat contexts Black Americans find this desirable. Through both a survey of\nBlack Americans ($n=$ 104) and annotation of LLM-produced AAE by Black\nAmericans ($n=$ 228), we find that Black Americans favor choice and autonomy in\ndetermining when AAE is appropriate in LLM output. They tend to prefer that\nLLMs default to communicating in Mainstream U.S. English in formal settings,\nwith greater interest in AAE production in less formal settings. When LLMs were\nappropriately prompted and provided in context examples, our participants found\ntheir outputs to have a level of AAE authenticity on par with transcripts of\nBlack American speech. Select code and data for our project can be found here:\nhttps://github.com/smelliecat/AAEMime.git", "paper_summary_zh": "我們檢視了大型語言模型 (LLM) 中非裔美國英語 (AAE) 的表徵，探討 (a) 黑人美國人對這些技術產生真實 AAE 的成效的看法，以及 (b) 黑人美國人在什麼情況下發現這一點是可取的。透過對黑人美國人進行調查 ($n=$ 104) 和黑人美國人對 LLM 產生的 AAE 進行註解 ($n=$ 228)，我們發現黑人美國人偏好選擇和自主權，以決定何時在 LLM 輸出中使用 AAE。他們傾向於偏好 LLM 在正式場合中預設以主流美國英語進行溝通，對在較不正式的場合中產生 AAE 更感興趣。當 LLM 得到適當提示並提供情境範例時，我們的參與者發現其輸出具有與黑人美國人演講記錄相當的 AAE 真實性。我們專案的選定程式碼和資料可在這裡找到：https://github.com/smelliecat/AAEMime.git", "author": "Sandra C. Sandoval et.al.", "authors": "Sandra C. Sandoval, Christabel Acquaye, Kwesi Cobbina, Mohammad Nayeem Teli, Hal Daumé III", "id": "2502.04564v1", "paper_url": "http://arxiv.org/abs/2502.04564v1", "repo": "null"}}