{"2409.06427": {"publish_time": "2024-09-10", "title": "GeMuCo: Generalized Multisensory Correlational Model for Body Schema Learning", "paper_summary": "Humans can autonomously learn the relationship between sensation and motion\nin their own bodies, estimate and control their own body states, and move while\ncontinuously adapting to the current environment. On the other hand, current\nrobots control their bodies by learning the network structure described by\nhumans from their experiences, making certain assumptions on the relationship\nbetween sensors and actuators. In addition, the network model does not adapt to\nchanges in the robot's body, the tools that are grasped, or the environment,\nand there is no unified theory, not only for control but also for state\nestimation, anomaly detection, simulation, and so on. In this study, we propose\na Generalized Multisensory Correlational Model (GeMuCo), in which the robot\nitself acquires a body schema describing the correlation between sensors and\nactuators from its own experience, including model structures such as network\ninput/output. The robot adapts to the current environment by updating this body\nschema model online, estimates and controls its body state, and even performs\nanomaly detection and simulation. We demonstrate the effectiveness of this\nmethod by applying it to tool-use considering changes in grasping state for an\naxis-driven robot, to joint-muscle mapping learning for a musculoskeletal\nrobot, and to full-body tool manipulation for a low-rigidity plastic-made\nhumanoid.", "paper_summary_zh": "人類可以自主學習身體中感覺和動作之間的關係，估計和控制自己的身體狀態，並在持續適應當前環境的同時移動。另一方面，當前的機器人通過從經驗中學習人類描述的網路結構來控制其身體，對感測器和致動器之間的關係做出某些假設。此外，網路模型不會適應機器人身體、所抓取的工具或環境的變化，而且不僅對於控制，而且對於狀態估計、異常偵測、模擬等，都沒有統一的理論。在本研究中，我們提出了一個廣義的多感官相關模型 (GeMuCo)，其中機器人本身從自己的經驗中獲取描述感測器和致動器之間相關性的身體模式，包括網路輸入/輸出等模型結構。機器人通過在線上更新這個身體模式模型來適應當前環境，估計和控制其身體狀態，甚至執行異常偵測和模擬。我們通過將此方法應用於考慮軸驅動機器人的抓握狀態變化、用於肌肉骨骼機器人的關節肌肉對應學習以及用於低剛性塑膠製成的類人機器人的全身工具操作，來證明此方法的有效性。", "author": "Kento Kawaharazuka et.al.", "authors": "Kento Kawaharazuka, Kei Okada, Masayuki Inaba", "id": "2409.06427v1", "paper_url": "http://arxiv.org/abs/2409.06427v1", "repo": "null"}}