{"2411.07237": {"publish_time": "2024-11-11", "title": "Contextualized Evaluations: Taking the Guesswork Out of Language Model Evaluations", "paper_summary": "Language model users often issue queries that lack specification, where the\ncontext under which a query was issued -- such as the user's identity, the\nquery's intent, and the criteria for a response to be useful -- is not\nexplicit. For instance, a good response to a subjective query like \"What book\nshould I read next?\" would depend on the user's preferences, and a good\nresponse to an open-ended query like \"How do antibiotics work against\nbacteria?\" would depend on the user's expertise. This makes evaluation of\nresponses to such queries an ill-posed task, as evaluators may make arbitrary\njudgments about the response quality. To remedy this, we present contextualized\nevaluations, a protocol that synthetically constructs context surrounding an\nunderspecified query and provides it during evaluation. We find that the\npresence of context can 1) alter conclusions drawn from evaluation, even\nflipping win rates between model pairs, 2) nudge evaluators to make fewer\njudgments based on surface-level criteria, like style, and 3) provide new\ninsights about model behavior across diverse contexts. Specifically, our\nprocedure uncovers an implicit bias towards WEIRD contexts in models' \"default\"\nresponses and we find that models are not equally sensitive to following\ndifferent contexts, even when they are provided in prompts.", "paper_summary_zh": "語言模型使用者經常發出缺乏規範的查詢，其中發出查詢的背景（例如使用者的身分、查詢的意圖以及回應有用的標準）未明確說明。例如，對於「我下一步該讀什麼書？」這類主觀查詢的良好回應會取決於使用者的喜好，而對於「抗生素如何對抗細菌？」這類開放式查詢的良好回應會取決於使用者的專業知識。這使得評估此類查詢的回應成為一項難以解決的任務，因為評估者可能會對回應品質做出武斷的判斷。為了補救這一點，我們提出了情境化評估，這是一種協定，可以合成構造出未明確指定查詢周圍的背景，並在評估期間提供背景。我們發現背景的存在可以 1) 改變從評估中得出的結論，甚至會顛倒模型配對之間的獲勝率，2) 促使評估者根據表面層標準（例如風格）做出較少的判斷，以及 3) 提供關於模型在不同背景下的行為的新見解。具體來說，我們的程序揭示了模型「預設」回應中對 WEIRD 背景的隱含偏見，我們發現模型對於遵循不同的背景並非同樣敏感，即使這些背景是在提示中提供的。", "author": "Chaitanya Malaviya et.al.", "authors": "Chaitanya Malaviya, Joseph Chee Chang, Dan Roth, Mohit Iyyer, Mark Yatskar, Kyle Lo", "id": "2411.07237v1", "paper_url": "http://arxiv.org/abs/2411.07237v1", "repo": "null"}}