{"2503.19394": {"publish_time": "2025-03-25", "title": "Quantifying Symptom Causality in Clinical Decision Making: An Exploration Using CausaLM", "paper_summary": "Current machine learning approaches to medical diagnosis often rely on\ncorrelational patterns between symptoms and diseases, risking misdiagnoses when\nsymptoms are ambiguous or common across multiple conditions. In this work, we\nmove beyond correlation to investigate the causal influence of key\nsymptoms-specifically \"chest pain\" on diagnostic predictions. Leveraging the\nCausaLM framework, we generate counterfactual text representations in which\ntarget concepts are effectively \"forgotten\" enabling a principled estimation of\nthe causal effect of that concept on a model's predicted disease distribution.\nBy employing Textual Representation-based Average Treatment Effect (TReATE), we\nquantify how the presence or absence of a symptom shapes the model's diagnostic\noutcomes, and contrast these findings against correlation-based baselines such\nas CONEXP. Our results offer deeper insight into the decision-making behavior\nof clinical NLP models and have the potential to inform more trustworthy,\ninterpretable, and causally-grounded decision support tools in medical\npractice.", "paper_summary_zh": "<paragraph>目前的機器學習方法應用於醫療診斷時，通常依賴症狀和疾病之間的相關模式，當症狀模稜兩可或在多種疾病中常見時，就有誤診的風險。在這項工作中，我們超越了相關性，研究關鍵症狀——特別是「胸痛」——對診斷預測的因果影響。利用 CausaLM 框架，我們生成反事實的文本表徵，其中目標概念被有效地「遺忘」，從而能夠對該概念對模型預測疾病分佈的因果效應進行有原則的估計。通過使用基於文本表徵的平均治療效果 (TReATE)，我們量化了症狀的存在或不存在如何影響模型的診斷結果，並將這些發現與基於相關性的基準（例如 CONEXP）進行比較。我們的結果提供了對臨床自然語言處理模型決策行為的更深入了解，並有可能為醫療實踐中更值得信賴、更具可解釋性和基於因果關係的決策支持工具提供信息。</paragraph>\n", "author": "Mehul Shetty et.al.", "authors": "Mehul Shetty, Connor Jordan", "id": "2503.19394v1", "paper_url": "http://arxiv.org/abs/2503.19394v1", "repo": "null"}}