{"2503.08495": {"publish_time": "2025-03-11", "title": "Enhancing Multi-Hop Fact Verification with Structured Knowledge-Augmented Large Language Models", "paper_summary": "The rapid development of social platforms exacerbates the dissemination of\nmisinformation, which stimulates the research in fact verification. Recent\nstudies tend to leverage semantic features to solve this problem as a\nsingle-hop task. However, the process of verifying a claim requires several\npieces of evidence with complicated inner logic and relations to verify the\ngiven claim in real-world situations. Recent studies attempt to improve both\nunderstanding and reasoning abilities to enhance the performance, but they\noverlook the crucial relations between entities that benefit models to\nunderstand better and facilitate the prediction. To emphasize the significance\nof relations, we resort to Large Language Models (LLMs) considering their\nexcellent understanding ability. Instead of other methods using LLMs as the\npredictor, we take them as relation extractors, for they do better in\nunderstanding rather than reasoning according to the experimental results.\nThus, to solve the challenges above, we propose a novel Structured\nKnowledge-Augmented LLM-based Network (LLM-SKAN) for multi-hop fact\nverification. Specifically, we utilize an LLM-driven Knowledge Extractor to\ncapture fine-grained information, including entities and their complicated\nrelations. Besides, we leverage a Knowledge-Augmented Relation Graph Fusion\nmodule to interact with each node and learn better claim-evidence\nrepresentations comprehensively. The experimental results on four common-used\ndatasets demonstrate the effectiveness and superiority of our model.", "paper_summary_zh": "<paragraph>社群平台的快速發展加劇了錯誤資訊的傳播，也因此促進了事實查核的研究。最近的研究趨向於利用語義特徵將此問題作為單跳任務來解決。然而，在現實情況下，驗證一個斷言需要多個證據，這些證據之間有著複雜的內在邏輯和關係。近期的研究嘗試提高理解和推理能力來提升效能，但卻忽略了實體之間的關鍵關係，而這些關係有助於模型更好地理解資訊並促進預測。為了強調關係的重要性，我們考慮到大型語言模型 (LLM) 優秀的理解能力，因此採用它們。不同於其他使用 LLM 作為預測器的方法，我們將它們作為關係提取器，因為根據實驗結果，它們在理解方面比推理方面表現更好。因此，為了應對上述挑戰，我們提出了一種用於多跳事實查核的新型結構化知識增強型基於 LLM 的網路 (LLM-SKAN)。具體來說，我們利用 LLM 驅動的知識提取器來擷取細粒度的資訊，包括實體及其複雜的關係。此外，我們利用知識增強型關係圖融合模組與每個節點進行交互，並更全面地學習斷言-證據表示。在四個常用數據集上的實驗結果證明了我們模型的有效性和優越性。</paragraph>\n", "author": "Han Cao et.al.", "authors": "Han Cao, Lingwei Wei, Wei Zhou, Songlin Hu", "id": "2503.08495v1", "paper_url": "http://arxiv.org/abs/2503.08495v1", "repo": "null"}}