{"2408.17401": {"publish_time": "2024-08-30", "title": "Exploring the Effect of Explanation Content and Format on User Comprehension and Trust", "paper_summary": "In recent years, various methods have been introduced for explaining the\noutputs of \"black-box\" AI models. However, it is not well understood whether\nusers actually comprehend and trust these explanations. In this paper, we focus\non explanations for a regression tool for assessing cancer risk and examine the\neffect of the explanations' content and format on the user-centric metrics of\ncomprehension and trust. Regarding content, we experiment with two explanation\nmethods: the popular SHAP, based on game-theoretic notions and thus potentially\ncomplex for everyday users to comprehend, and occlusion-1, based on feature\nocclusion which may be more comprehensible. Regarding format, we present SHAP\nexplanations as charts (SC), as is conventional, and occlusion-1 explanations\nas charts (OC) as well as text (OT), to which their simpler nature also lends\nitself. The experiments amount to user studies questioning participants, with\ntwo different levels of expertise (the general population and those with some\nmedical training), on their subjective and objective comprehension of and trust\nin explanations for the outputs of the regression tool. In both studies we\nfound a clear preference in terms of subjective comprehension and trust for\nocclusion-1 over SHAP explanations in general, when comparing based on content.\nHowever, direct comparisons of explanations when controlling for format only\nrevealed evidence for OT over SC explanations in most cases, suggesting that\nthe dominance of occlusion-1 over SHAP explanations may be driven by a\npreference for text over charts as explanations. Finally, we found no evidence\nof a difference between the explanation types in terms of objective\ncomprehension. Thus overall, the choice of the content and format of\nexplanations needs careful attention, since in some contexts format, rather\nthan content, may play the critical role in improving user experience.", "paper_summary_zh": "<paragraph>近年來，已經引進各種方法來解釋「黑箱」AI 模型的輸出。然而，目前並不清楚使用者是否實際理解和信任這些解釋。在本文中，我們專注於評估癌症風險的回歸工具的解釋，並探討解釋的內容和格式對以使用者為中心的理解和信任指標的影響。關於內容，我們實驗了兩種解釋方法：流行的 SHAP，基於博弈論概念，因此對於日常使用者來說可能很複雜，以及基於特徵遮蔽的 occlusion-1，可能更易於理解。關於格式，我們將 SHAP 解釋呈現為圖表 (SC)，這是慣例，而將 occlusion-1 解釋呈現為圖表 (OC) 以及文字 (OT)，其較為簡單的性質也適用於此。這些實驗等同於使用者研究，詢問參與者，具有兩種不同程度的專業知識（一般民眾和具備一些醫學訓練的人），他們對回歸工具輸出解釋的主觀和客觀理解和信任。在兩項研究中，我們發現，在基於內容進行比較時，一般來說，occlusion-1 優於 SHAP 解釋，在主觀理解和信任方面有明顯的偏好。然而，在僅控制格式的情況下直接比較解釋，在大多數情況下只顯示 OT 優於 SC 解釋的證據，這表明 occlusion-1 優於 SHAP 解釋的主導地位可能是由偏好文字而非圖表作為解釋所驅動的。最後，我們沒有發現解釋類型在客觀理解方面的差異證據。因此，總體而言，對解釋的內容和格式的選擇需要仔細注意，因為在某些情況下，格式而非內容，可能在改善使用者體驗方面發揮關鍵作用。</paragraph>", "author": "Antonio Rago et.al.", "authors": "Antonio Rago, Bence Palfi, Purin Sukpanichnant, Hannibal Nabli, Kavyesh Vivek, Olga Kostopoulou, James Kinross, Francesca Toni", "id": "2408.17401v1", "paper_url": "http://arxiv.org/abs/2408.17401v1", "repo": "null"}}