{"2408.17401": {"publish_time": "2024-08-30", "title": "Exploring the Effect of Explanation Content and Format on User Comprehension and Trust in Healthcare", "paper_summary": "AI-driven tools for healthcare are widely acknowledged as potentially\nbeneficial to health practitioners and patients, e.g. the QCancer regression\ntool for cancer risk prediction. However, for these tools to be trusted, they\nneed to be supplemented with explanations. We examine how explanations' content\nand format affect user comprehension and trust when explaining QCancer's\npredictions. Regarding content, we deploy SHAP and Occlusion-1. Regarding\nformat, we present SHAP explanations, conventionally, as charts (SC) and\nOcclusion-1 explanations as charts (OC) as well as text (OT), to which their\nsimpler nature lends itself. We conduct experiments with two sets of\nstakeholders: the general public (representing patients) and medical students\n(representing healthcare practitioners). Our experiments showed higher\nsubjective comprehension and trust for Occlusion-1 over SHAP explanations based\non content. However, when controlling for format, only OT outperformed SC,\nsuggesting this trend is driven by preferences for text. Other findings\ncorroborated that explanation format, rather than content, is often the\ncritical factor.", "paper_summary_zh": "由 AI 驅動的醫療保健工具被廣泛認為對醫療從業者和患者有潛在好處，例如用於癌症風險預測的 QCancer 回歸工具。然而，對於這些工具，如果要讓人們信賴，就需要補充說明。我們研究了說明的內容和格式如何影響使用者在解釋 QCancer 預測時的理解和信任。關於內容，我們部署了 SHAP 和 Occlusion-1。關於格式，我們以圖表 (SC) 的形式呈現 SHAP 說明，以圖表 (OC) 和文字 (OT) 的形式呈現 Occlusion-1 說明，因為它們的性質較為簡單。我們對兩組利害關係人進行了實驗：一般民眾（代表患者）和醫學生（代表醫療從業者）。我們的實驗結果顯示，基於內容，Occlusion-1 比 SHAP 說明具有更高的主觀理解和信任。然而，在控制格式時，只有 OT 優於 SC，這表明這種趨勢是由對文字的偏好所驅動的。其他發現證實了說明格式，而不是內容，通常是關鍵因素。", "author": "Antonio Rago et.al.", "authors": "Antonio Rago, Bence Palfi, Purin Sukpanichnant, Hannibal Nabli, Kavyesh Vivek, Olga Kostopoulou, James Kinross, Francesca Toni", "id": "2408.17401v2", "paper_url": "http://arxiv.org/abs/2408.17401v2", "repo": "null"}}