{"2501.13554": {"publish_time": "2025-01-23", "title": "One-Prompt-One-Story: Free-Lunch Consistent Text-to-Image Generation Using a Single Prompt", "paper_summary": "Text-to-image generation models can create high-quality images from input\nprompts. However, they struggle to support the consistent generation of\nidentity-preserving requirements for storytelling. Existing approaches to this\nproblem typically require extensive training in large datasets or additional\nmodifications to the original model architectures. This limits their\napplicability across different domains and diverse diffusion model\nconfigurations. In this paper, we first observe the inherent capability of\nlanguage models, coined context consistency, to comprehend identity through\ncontext with a single prompt. Drawing inspiration from the inherent context\nconsistency, we propose a novel training-free method for consistent\ntext-to-image (T2I) generation, termed \"One-Prompt-One-Story\" (1Prompt1Story).\nOur approach 1Prompt1Story concatenates all prompts into a single input for T2I\ndiffusion models, initially preserving character identities. We then refine the\ngeneration process using two novel techniques: Singular-Value Reweighting and\nIdentity-Preserving Cross-Attention, ensuring better alignment with the input\ndescription for each frame. In our experiments, we compare our method against\nvarious existing consistent T2I generation approaches to demonstrate its\neffectiveness through quantitative metrics and qualitative assessments. Code is\navailable at https://github.com/byliutao/1Prompt1Story.", "paper_summary_zh": "文字轉圖像生成模型可以根據輸入提示建立高品質影像。然而，它們難以支援持續產生說故事所需的維持身分要求。現有的解決方法通常需要大量資料集的訓練或對原始模型架構進行額外修改。這限制了它們在不同領域和多種擴散模型組態中的適用性。在本文中，我們首先觀察到語言模型的內在能力，即所謂的脈絡一致性，可透過單一提示透過脈絡理解身分。從脈絡一致性中汲取靈感，我們提出了一種新穎的無訓練方法，用於持續的文字轉圖像 (T2I) 生成，稱為「一提示一故事」(1Prompt1Story)。我們的 1Prompt1Story 方法將所有提示串接成 T2I 擴散模型的單一輸入，最初保留角色身分。然後，我們使用兩種新技術調整生成程序：奇異值重新加權和維持身分的交叉注意，確保與每個畫面的輸入描述有更好的對齊。在我們的實驗中，我們將我們的模型與各種現有的持續 T2I 生成方法進行比較，以透過量化指標和定性評估證明其有效性。程式碼可於 https://github.com/byliutao/1Prompt1Story 取得。", "author": "Tao Liu et.al.", "authors": "Tao Liu, Kai Wang, Senmao Li, Joost van de Weijer, Fahad Shahbaz Khan, Shiqi Yang, Yaxing Wang, Jian Yang, Ming-Ming Cheng", "id": "2501.13554v1", "paper_url": "http://arxiv.org/abs/2501.13554v1", "repo": "https://github.com/byliutao/1prompt1story"}}