{"2410.06370": {"publish_time": "2024-10-08", "title": "HumVI: A Multilingual Dataset for Detecting Violent Incidents Impacting Humanitarian Aid", "paper_summary": "Humanitarian organizations can enhance their effectiveness by analyzing data\nto discover trends, gather aggregated insights, manage their security risks,\nsupport decision-making, and inform advocacy and funding proposals. However,\ndata about violent incidents with direct impact and relevance for humanitarian\naid operations is not readily available. An automatic data collection and\nNLP-backed classification framework aligned with humanitarian perspectives can\nhelp bridge this gap. In this paper, we present HumVI - a dataset comprising\nnews articles in three languages (English, French, Arabic) containing instances\nof different types of violent incidents categorized by the humanitarian sector\nthey impact, e.g., aid security, education, food security, health, and\nprotection. Reliable labels were obtained for the dataset by partnering with a\ndata-backed humanitarian organization, Insecurity Insight. We provide multiple\nbenchmarks for the dataset, employing various deep learning architectures and\ntechniques, including data augmentation and mask loss, to address different\ntask-related challenges, e.g., domain expansion. The dataset is publicly\navailable at https://github.com/dataminr-ai/humvi-dataset.", "paper_summary_zh": "人道主義組織可以透過分析資料來提升其效能，以發現趨勢、收集彙總的見解、管理其安全風險、支援決策制定，並提供倡議和資金提案的資訊。然而，關於暴力事件的資料，其直接影響和與人道主義援助行動相關性，並不容易取得。一個自動資料收集和 NLP 支援的分類架構，與人道主義觀點一致，有助於彌合此差距。在本文中，我們提出 HumVI - 一個包含三種語言（英語、法語、阿拉伯語）新聞文章的資料集，其中包含人道主義部門分類的不同類型暴力事件的案例，例如援助安全、教育、糧食安全、健康和保護。透過與資料支援的人道主義組織 Insecurity Insight 合作，取得資料集的可靠標籤。我們為資料集提供多個基準，採用各種深度學習架構和技術，包括資料擴充和遮罩損失，以解決不同的任務相關挑戰，例如領域擴充。資料集公開於 https://github.com/dataminr-ai/humvi-dataset。", "author": "Hemank Lamba et.al.", "authors": "Hemank Lamba, Anton Abilov, Ke Zhang, Elizabeth M. Olson, Henry k. Dambanemuya, João c. Bárcia, David S. Batista, Christina Wille, Aoife Cahill, Joel Tetreault, Alex Jaimes", "id": "2410.06370v1", "paper_url": "http://arxiv.org/abs/2410.06370v1", "repo": "null"}}