{"2407.20955": {"publish_time": "2024-07-30", "title": "Emotion-driven Piano Music Generation via Two-stage Disentanglement and Functional Representation", "paper_summary": "Managing the emotional aspect remains a challenge in automatic music\ngeneration. Prior works aim to learn various emotions at once, leading to\ninadequate modeling. This paper explores the disentanglement of emotions in\npiano performance generation through a two-stage framework. The first stage\nfocuses on valence modeling of lead sheet, and the second stage addresses\narousal modeling by introducing performance-level attributes. To further\ncapture features that shape valence, an aspect less explored by previous\napproaches, we introduce a novel functional representation of symbolic music.\nThis representation aims to capture the emotional impact of major-minor\ntonality, as well as the interactions among notes, chords, and key signatures.\nObjective and subjective experiments validate the effectiveness of our\nframework in both emotional valence and arousal modeling. We further leverage\nour framework in a novel application of emotional controls, showing a broad\npotential in emotion-driven music generation.", "paper_summary_zh": "在自動音樂生成中，管理情緒層面仍然是一項挑戰。先前的研究旨在一次學習各種情緒，導致建模不足。本文探討了通過兩階段框架在鋼琴演奏生成中解開情緒。第一階段專注於主導樂譜的情緒價建模，而第二階段則通過引入表演級別屬性來解決喚醒建模。為了進一步捕捉塑造情緒價的特徵，這是以前方法較少探索的一個方面，我們引入了一個符號音樂的新型功能表示。這種表示旨在捕捉大調-小調音調的情緒影響，以及音符、和弦和調號之間的相互作用。客觀和主觀實驗驗證了我們框架在情緒價和喚醒建模中的有效性。我們進一步在情緒控制的新應用中利用我們的框架，展示了在情緒驅動的音樂生成中的廣泛潛力。", "author": "Jingyue Huang et.al.", "authors": "Jingyue Huang, Ke Chen, Yi-Hsuan Yang", "id": "2407.20955v1", "paper_url": "http://arxiv.org/abs/2407.20955v1", "repo": "https://github.com/yuer867/emo-disentanger"}}