{"2410.02744": {"publish_time": "2024-10-03", "title": "Neutral residues: revisiting adapters for model extension", "paper_summary": "We address the problem of extending a pretrained large language model to a\nnew domain that was not seen at training time, like adding a language for which\nthe original model has seen no or little training data. Popular solutions like\nfine-tuning or low-rank adaptation are successful at domain adaptation, but\nformally they do not add any extra capacity and degrade the performance in the\noriginal domain.\n  Our paper analyzes this extension problem under three angles: data,\narchitecture and training procedure, which are advantageously considered\njointly. In particular, we improve adapters and make it possible to learn an\nentire new language while ensuring that the output of the neural network is\nalmost unchanged in the original domain. For this purpose, we modify the new\nresidual blocks in a way that leads each new residual block to output\nnear-zeros in the original domain.\n  This solution of neutral residues, which borrows architectural components\nfrom mixture of experts, is effective: with only 20% extra learnable weights\ncompared to an original model trained on English, we get results that are\nsignificantly better than concurrent approaches (fine-tuning, low-rank or\nvanilla adapters) in terms of the trade-off between learning a new language and\nnot forgetting English.", "paper_summary_zh": "<paragraph>我們解決了將預訓練的大語言模型擴充到訓練時未見過的新領域的問題，例如增加原始模型未見過或訓練資料很少的語言。微調或低階適應等熱門解決方案在領域適應方面很成功，但形式上它們不會增加任何額外容量，並會降低原始領域的效能。\n  我們的論文從資料、架構和訓練程序三個角度分析這個擴充問題，這些角度有利於共同考量。特別是，我們改進了適配器，並讓學習一種全新語言成為可能，同時確保神經網路的輸出在原始領域幾乎保持不變。為此，我們修改了新的殘差區塊，讓每個新的殘差區塊在原始領域輸出接近零。\n  這種中性殘差的解決方案借用了專家混合的架構元件，非常有效：與在英語上訓練的原始模型相比，僅增加 20% 可學習權重，我們獲得的結果在學習新語言和不忘英語之間的權衡方面顯著優於並行方法（微調、低階或香草適配器）。</paragraph>", "author": "Franck Signe Talla et.al.", "authors": "Franck Signe Talla, Herve Jegou, Edouard Grave", "id": "2410.02744v1", "paper_url": "http://arxiv.org/abs/2410.02744v1", "repo": "null"}}