{"2410.15966": {"publish_time": "2024-10-21", "title": "Self-Explained Keywords Empower Large Language Models for Code Generation", "paper_summary": "Large language models (LLMs) have achieved impressive performance in code\ngeneration. However, due to the long-tail distribution of LLMs' training data,\nlow-frequency terms are typically underrepresented in the training process.\nConsequently, LLMs often misunderstand or overlook problem-specific,\nlow-frequency keywords during code generation, compromising the accuracy of the\ngenerated code. To address this, we propose a novel technique named\nSEK(\\textbf{S}elf-\\textbf{E}xplained \\textbf{K}eywords), which empowers an LLM\nfor better code generation by extracting and explaining the key terms in the\nproblem description with the LLM itself and ranking them based on frequency.\nComprehensive experiments across three benchmarks, i.e., HumanEval(+), MBPP(+),\nand APPS, with five representative LLMs, show that SEK can significantly\nimprove LLMs in code generation, yielding substantial and consistent gains. For\ninstance, SEK improves the Pass@1 of DeepSeek-Coder-V2-Instruct from 85.4\\% to\n93.3\\% on the Humaneval benchmark. Further analysis confirms that SEK enables\nthe LLMs to shift their attention from low-frequency keywords to their\ncorresponding high-frequency counterparts.", "paper_summary_zh": "大型語言模型 (LLM) 在程式碼生成中已取得令人印象深刻的表現。然而，由於 LLM 訓練資料的長尾分布，低頻率術語通常在訓練過程中代表性不足。因此，LLM 在程式碼生成過程中經常誤解或忽略特定於問題的低頻率關鍵字，損害了所生成程式碼的準確性。為了解決這個問題，我們提出了一種名為 SEK（**S**elf-**E**xplained **K**eywords）的新技術，它通過使用 LLM 本身從問題描述中提取和解釋關鍵術語並根據頻率對它們進行排序，賦予 LLM 更好的程式碼生成能力。在三個基準，即 HumanEval(+)、MBPP(+) 和 APPS，以及五個具有代表性的 LLM 上進行的綜合實驗表明，SEK 可以顯著改善 LLM 在程式碼生成中的表現，產生顯著且一致的收益。例如，SEK 將 DeepSeek-Coder-V2-Instruct 在 Humaneval 基準上的 Pass@1 從 85.4% 提高到 93.3%。進一步的分析證實，SEK 使 LLM 能夠將注意力從低頻率關鍵字轉移到它們對應的高頻率對應詞。", "author": "Lishui Fan et.al.", "authors": "Lishui Fan, Mouxiang Chen, Zhongxin Liu", "id": "2410.15966v1", "paper_url": "http://arxiv.org/abs/2410.15966v1", "repo": "null"}}