{"2407.06902": {"publish_time": "2024-07-09", "title": "Learning From Crowdsourced Noisy Labels: A Signal Processing Perspective", "paper_summary": "One of the primary catalysts fueling advances in artificial intelligence (AI)\nand machine learning (ML) is the availability of massive, curated datasets. A\ncommonly used technique to curate such massive datasets is crowdsourcing, where\ndata are dispatched to multiple annotators. The annotator-produced labels are\nthen fused to serve downstream learning and inference tasks. This annotation\nprocess often creates noisy labels due to various reasons, such as the limited\nexpertise, or unreliability of annotators, among others. Therefore, a core\nobjective in crowdsourcing is to develop methods that effectively mitigate the\nnegative impact of such label noise on learning tasks. This feature article\nintroduces advances in learning from noisy crowdsourced labels. The focus is on\nkey crowdsourcing models and their methodological treatments, from classical\nstatistical models to recent deep learning-based approaches, emphasizing\nanalytical insights and algorithmic developments. In particular, this article\nreviews the connections between signal processing (SP) theory and methods, such\nas identifiability of tensor and nonnegative matrix factorization, and novel,\nprincipled solutions of longstanding challenges in crowdsourcing -- showing how\nSP perspectives drive the advancements of this field. Furthermore, this article\ntouches upon emerging topics that are critical for developing cutting-edge\nAI/ML systems, such as crowdsourcing in reinforcement learning with human\nfeedback (RLHF) and direct preference optimization (DPO) that are key\ntechniques for fine-tuning large language models (LLMs).", "paper_summary_zh": "人工智慧 (AI) 和機器學習 (ML) 進步的主要催化劑之一是大量整理好的資料集。整理如此龐大資料集的常用技術是眾包，其中資料會分派給多位註解者。然後將註解者產生的標籤融合，以服務於下游學習和推理任務。此註解程序通常會因為各種原因而產生雜訊標籤，例如註解者的專業知識有限或不可靠等。因此，眾包的核心目標是開發有效減輕此類標籤雜訊對學習任務的負面影響的方法。這篇特寫文章介紹了從雜訊眾包標籤中學習的進展。重點在於關鍵的眾包模型及其方法論處理，從經典統計模型到最近基於深度學習的方法，強調分析見解和演算法發展。特別是，本文回顧了訊號處理 (SP) 理論和方法之間的關聯，例如張量和非負矩陣分解的可識別性，以及眾包中長期挑戰的新穎原則性解決方案——展示 SP 觀點如何推動該領域的進展。此外，本文還觸及了對開發尖端 AI/ML 系統至關重要的新興主題，例如在具有人類回饋 (RLHF) 的強化學習中進行眾包，以及直接偏好最佳化 (DPO)，這是微調大型語言模型 (LLM) 的關鍵技術。", "author": "Shahana Ibrahim et.al.", "authors": "Shahana Ibrahim, Panagiotis A. Traganitis, Xiao Fu, Georgios B. Giannakis", "id": "2407.06902v1", "paper_url": "http://arxiv.org/abs/2407.06902v1", "repo": "null"}}