{"2408.06847": {"publish_time": "2024-08-13", "title": "AI Research is not Magic, it has to be Reproducible and Responsible: Challenges in the AI field from the Perspective of its PhD Students", "paper_summary": "With the goal of uncovering the challenges faced by European AI students\nduring their research endeavors, we surveyed 28 AI doctoral candidates from 13\nEuropean countries. The outcomes underscore challenges in three key areas: (1)\nthe findability and quality of AI resources such as datasets, models, and\nexperiments; (2) the difficulties in replicating the experiments in AI papers;\n(3) and the lack of trustworthiness and interdisciplinarity. From our findings,\nit appears that although early stage AI researchers generally tend to share\ntheir AI resources, they lack motivation or knowledge to engage more in dataset\nand code preparation and curation, and ethical assessments, and are not used to\ncooperate with well-versed experts in application domains. Furthermore, we\nexamine existing practices in data governance and reproducibility both in\ncomputer science and in artificial intelligence. For instance, only a minority\nof venues actively promote reproducibility initiatives such as reproducibility\nevaluations.\n  Critically, there is need for immediate adoption of responsible and\nreproducible AI research practices, crucial for society at large, and essential\nfor the AI research community in particular. This paper proposes a combination\nof social and technical recommendations to overcome the identified challenges.\nSocially, we propose the general adoption of reproducibility initiatives in AI\nconferences and journals, as well as improved interdisciplinary collaboration,\nespecially in data governance practices. On the technical front, we call for\nenhanced tools to better support versioning control of datasets and code, and a\ncomputing infrastructure that facilitates the sharing and discovery of AI\nresources, as well as the sharing, execution, and verification of experiments.", "paper_summary_zh": "<paragraph>為了了解歐洲 AI 學生在研究過程中面臨的挑戰，我們調查了來自 13 個歐洲國家的 28 位 AI 博士候選人。結果強調了三個關鍵領域的挑戰：(1) 資料集、模型和實驗等 AI 資源的可查找性和品質；(2) 複製 AI 論文中實驗的困難度；(3) 缺乏可信度和跨領域性。從我們的發現看來，儘管早期階段的 AI 研究人員通常傾向於分享他們的 AI 資源，但他們缺乏參與資料集和程式碼準備及策展、倫理評估的動機或知識，而且不習慣與應用領域的專家合作。此外，我們探討了電腦科學和人工智慧中現有的資料治理和可複製性實務。例如，只有少數場地積極推廣可複製性計畫，例如可複製性評估。\n嚴格來說，需要立即採用負責任且可複製的 AI 研究實務，這對社會整體而言至關重要，對 AI 研究社群尤其重要。本文提出結合社會和技術建議，以克服已確定的挑戰。在社會方面，我們提議在 AI 會議和期刊中普遍採用可複製性計畫，以及改善跨領域合作，特別是在資料治理實務中。在技術方面，我們呼籲加強工具，以更好地支援資料集和程式的版本控制，以及一個運算基礎架構，以促進 AI 資源的分享和發現，以及實驗的分享、執行和驗證。</paragraph>", "author": "Andrea Hrckova et.al.", "authors": "Andrea Hrckova, Jennifer Renoux, Rafael Tolosana Calasanz, Daniela Chuda, Martin Tamajka, Jakub Simko", "id": "2408.06847v1", "paper_url": "http://arxiv.org/abs/2408.06847v1", "repo": "null"}}