{"2405.11804": {"publish_time": "2024-05-20", "title": "(Perhaps) Beyond Human Translation: Harnessing Multi-Agent Collaboration for Translating Ultra-Long Literary Texts", "paper_summary": "Recent advancements in machine translation (MT) have significantly enhanced\ntranslation quality across various domains. However, the translation of\nliterary texts remains a formidable challenge due to their complex language,\nfigurative expressions, and cultural nuances. In this work, we introduce a\nnovel multi-agent framework based on large language models (LLMs) for literary\ntranslation, implemented as a company called TransAgents, which mirrors\ntraditional translation publication process by leveraging the collective\ncapabilities of multiple agents, to address the intricate demands of\ntranslating literary works. To evaluate the effectiveness of our system, we\npropose two innovative evaluation strategies: Monolingual Human Preference\n(MHP) and Bilingual LLM Preference (BLP). MHP assesses translations from the\nperspective of monolingual readers of the target language, while BLP uses\nadvanced LLMs to compare translations directly with the original texts.\nEmpirical findings indicate that despite lower d-BLEU scores, translations from\nTransAgents are preferred by both human evaluators and LLMs over human-written\nreferences, particularly in genres requiring domain-specific knowledge. We also\nhighlight the strengths and limitations of TransAgents through case studies and\nsuggests directions for future research.", "paper_summary_zh": "機器翻譯 (MT) 近期的進展大幅提升了各種領域的翻譯品質。然而，文學文本的翻譯由於其複雜的語言、比喻表達和文化細微差別，仍然是一項艱鉅的挑戰。在這項工作中，我們介紹了一個基於大型語言模型 (LLM) 的創新多重代理架構，用於文學翻譯，並實作為一家名為 TransAgents 的公司，透過利用多個代理的集體能力，模擬傳統的翻譯出版流程，以滿足翻譯文學作品的複雜需求。為了評估我們系統的有效性，我們提出了兩種創新的評估策略：單語人類偏好 (MHP) 和雙語 LLM 偏好 (BLP)。MHP 從目標語言的單語讀者的角度評估翻譯，而 BLP 使用進階 LLM 直接將翻譯與原始文本進行比較。實證結果顯示，儘管 d-BLEU 分數較低，但 TransAgents 的翻譯在需要特定領域知識的類型中，特別受到人類評估者和 LLM 的青睞，優於人類撰寫的參考。我們也透過案例研究強調 TransAgents 的優點和限制，並建議未來的研究方向。", "author": "Minghao Wu et.al.", "authors": "Minghao Wu, Yulin Yuan, Gholamreza Haffari, Longyue Wang", "id": "2405.11804v1", "paper_url": "http://arxiv.org/abs/2405.11804v1", "repo": "null"}}