{"2410.03159": {"publish_time": "2024-10-04", "title": "Autoregressive Moving-average Attention Mechanism for Time Series Forecasting", "paper_summary": "We propose an Autoregressive (AR) Moving-average (MA) attention structure\nthat can adapt to various linear attention mechanisms, enhancing their ability\nto capture long-range and local temporal patterns in time series. In this\npaper, we first demonstrate that, for the time series forecasting (TSF) task,\nthe previously overlooked decoder-only autoregressive Transformer model can\nachieve results comparable to the best baselines when appropriate tokenization\nand training methods are applied. Moreover, inspired by the ARMA model from\nstatistics and recent advances in linear attention, we introduce the full ARMA\nstructure into existing autoregressive attention mechanisms. By using an\nindirect MA weight generation method, we incorporate the MA term while\nmaintaining the time complexity and parameter size of the underlying efficient\nattention models. We further explore how indirect parameter generation can\nproduce implicit MA weights that align with the modeling requirements for local\ntemporal impacts. Experimental results show that incorporating the ARMA\nstructure consistently improves the performance of various AR attentions on TSF\ntasks, achieving state-of-the-art results.", "paper_summary_zh": "我們提出一個自迴歸 (AR) 移動平均 (MA) 注意力結構，它可以適應各種線性注意力機制，增強它們捕捉時間序列中長距離和局部時間模式的能力。在本文中，我們首先證明，對於時間序列預測 (TSF) 任務，以前被忽視的僅解碼器自迴歸 Transformer 模型可以在應用適當的標記化和訓練方法時，達到與最佳基線相當的結果。此外，受到統計學中的 ARMA 模型和線性注意力的最新進展的啟發，我們將完整的 ARMA 結構引入現有的自迴歸注意力機制。通過使用間接 MA 權重生成方法，我們在保持底層高效注意力模型的時間複雜度和參數大小的同時，納入了 MA 項。我們進一步探討了間接參數生成如何產生與局部時間影響的建模需求一致的隱式 MA 權重。實驗結果表明，納入 ARMA 結構持續改善各種 AR 注意力在 TSF 任務上的性能，取得了最先進的結果。", "author": "Jiecheng Lu et.al.", "authors": "Jiecheng Lu, Xu Han, Yan Sun, Shihao Yang", "id": "2410.03159v1", "paper_url": "http://arxiv.org/abs/2410.03159v1", "repo": "null"}}