{"2412.05145": {"publish_time": "2024-12-06", "title": "Explingo: Explaining AI Predictions using Large Language Models", "paper_summary": "Explanations of machine learning (ML) model predictions generated by\nExplainable AI (XAI) techniques such as SHAP are essential for people using ML\noutputs for decision-making. We explore the potential of Large Language Models\n(LLMs) to transform these explanations into human-readable, narrative formats\nthat align with natural communication. We address two key research questions:\n(1) Can LLMs reliably transform traditional explanations into high-quality\nnarratives? and (2) How can we effectively evaluate the quality of narrative\nexplanations? To answer these questions, we introduce Explingo, which consists\nof two LLM-based subsystems, a Narrator and Grader. The Narrator takes in ML\nexplanations and transforms them into natural-language descriptions. The Grader\nscores these narratives on a set of metrics including accuracy, completeness,\nfluency, and conciseness.\n  Our experiments demonstrate that LLMs can generate high-quality narratives\nthat achieve high scores across all metrics, particularly when guided by a\nsmall number of human-labeled and bootstrapped examples. We also identified\nareas that remain challenging, in particular for effectively scoring narratives\nin complex domains. The findings from this work have been integrated into an\nopen-source tool that makes narrative explanations available for further\napplications.", "paper_summary_zh": "機器學習 (ML) 模型預測的說明由可解釋 AI (XAI) 技術 (例如 SHAP) 產生，對於使用 ML 輸出進行決策的人來說至關重要。我們探索大型語言模型 (LLM) 的潛力，將這些說明轉換為與自然溝通一致的人類可讀敘事格式。我們解決了兩個關鍵的研究問題：(1) LLM 能否可靠地將傳統說明轉換為高質量的敘事？(2) 我們如何有效評估敘事說明的品質？為了回答這些問題，我們引入了 Explingo，它包含兩個基於 LLM 的子系統，一個敘述者和一個評分者。敘述者接受 ML 說明，並將它們轉換為自然語言描述。評分者根據準確性、完整性、流暢性和簡潔性等一系列指標對這些敘事進行評分。我們的實驗表明，LLM 可以生成高質量的敘事，在所有指標上都能獲得高分，特別是在少量人工標記和引導式範例的指導下。我們還發現了仍然具有挑戰性的領域，特別是在複雜領域中有效評分敘事。這項工作的發現已整合到一個開源工具中，該工具使敘事說明可供進一步應用。", "author": "Alexandra Zytek et.al.", "authors": "Alexandra Zytek, Sara Pido, Sarah Alnegheimish, Laure Berti-Equille, Kalyan Veeramachaneni", "id": "2412.05145v1", "paper_url": "http://arxiv.org/abs/2412.05145v1", "repo": "null"}}