{"2409.02145": {"publish_time": "2024-09-03", "title": "A Multimodal Object-level Contrast Learning Method for Cancer Survival Risk Prediction", "paper_summary": "Computer-aided cancer survival risk prediction plays an important role in the\ntimely treatment of patients. This is a challenging weakly supervised ordinal\nregression task associated with multiple clinical factors involved such as\npathological images, genomic data and etc. In this paper, we propose a new\ntraining method, multimodal object-level contrast learning, for cancer survival\nrisk prediction. First, we construct contrast learning pairs based on the\nsurvival risk relationship among the samples in the training sample set. Then\nwe introduce the object-level contrast learning method to train the survival\nrisk predictor. We further extend it to the multimodal scenario by applying\ncross-modal constrast. Considering the heterogeneity of pathological images and\ngenomics data, we construct a multimodal survival risk predictor employing\nattention-based and self-normalizing based nerural network respectively.\nFinally, the survival risk predictor trained by our proposed method outperforms\nstate-of-the-art methods on two public multimodal cancer datasets for survival\nrisk prediction.", "paper_summary_zh": "電腦輔助癌症存活風險預測在病患的及時治療中扮演著重要的角色。這是一個困難的弱監督序數回歸任務，與多重臨床因素有關，例如病理圖像、基因組數據等。在本文中，我們提出了一種新的訓練方法，多模態物件層級對比學習，用於癌症存活風險預測。首先，我們根據訓練樣本集中樣本之間的存活風險關係建立對比學習對。接著，我們引入物件層級對比學習方法來訓練存活風險預測器。我們進一步將其延伸至多模態場景，透過應用跨模態對比。考量到病理圖像和基因體數據的異質性，我們分別採用基於注意力的和自標準化的神經網路來建構多模態存活風險預測器。最後，我們提出的方法所訓練的存活風險預測器在兩個公開的多模態癌症資料集上，在存活風險預測方面優於最先進的方法。", "author": "Zekang Yang et.al.", "authors": "Zekang Yang, Hong Liu, Xiangdong Wang", "id": "2409.02145v1", "paper_url": "http://arxiv.org/abs/2409.02145v1", "repo": "null"}}