{"2408.03630": {"publish_time": "2024-08-07", "title": "PAGED: A Benchmark for Procedural Graphs Extraction from Documents", "paper_summary": "Automatic extraction of procedural graphs from documents creates a low-cost\nway for users to easily understand a complex procedure by skimming visual\ngraphs. Despite the progress in recent studies, it remains unanswered: whether\nthe existing studies have well solved this task (Q1) and whether the emerging\nlarge language models (LLMs) can bring new opportunities to this task (Q2). To\nthis end, we propose a new benchmark PAGED, equipped with a large high-quality\ndataset and standard evaluations. It investigates five state-of-the-art\nbaselines, revealing that they fail to extract optimal procedural graphs well\nbecause of their heavy reliance on hand-written rules and limited available\ndata. We further involve three advanced LLMs in PAGED and enhance them with a\nnovel self-refine strategy. The results point out the advantages of LLMs in\nidentifying textual elements and their gaps in building logical structures. We\nhope PAGED can serve as a major landmark for automatic procedural graph\nextraction and the investigations in PAGED can offer insights into the research\non logic reasoning among non-sequential elements.", "paper_summary_zh": "透過文件自動萃取程序圖表，創造低成本的方式，讓使用者透過瀏覽視覺化圖表，輕鬆理解複雜的程序。儘管近期研究有所進展，但仍有未解的問題：現有研究是否已妥善解決此任務 (Q1)，以及新興的大型語言模型 (LLM) 能否為此任務帶來新契機 (Q2)。為此，我們提出一個新的基準 PAGED，配備大型高品質資料集和標準評估。它調查了五個最先進的基準，揭示它們無法有效萃取最佳程序圖表，因為它們過度依賴手寫規則和有限的可用資料。我們進一步在 PAGED 中納入三個先進的 LLM，並透過創新的自我精進策略強化它們。結果指出 LLM 在識別文字元素方面的優勢，以及它們在建立邏輯結構方面的不足。我們希望 PAGED 能作為自動程序圖表萃取的主要里程碑，且 PAGED 中的調查能為非順序元素之間的邏輯推理研究提供見解。", "author": "Weihong Du et.al.", "authors": "Weihong Du, Wenrui Liao, Hongru Liang, Wenqiang Lei", "id": "2408.03630v1", "paper_url": "http://arxiv.org/abs/2408.03630v1", "repo": "null"}}