{"2406.03209": {"publish_time": "2024-06-05", "title": "Challenges and Considerations in the Evaluation of Bayesian Causal Discovery", "paper_summary": "Representing uncertainty in causal discovery is a crucial component for\nexperimental design, and more broadly, for safe and reliable causal decision\nmaking. Bayesian Causal Discovery (BCD) offers a principled approach to\nencapsulating this uncertainty. Unlike non-Bayesian causal discovery, which\nrelies on a single estimated causal graph and model parameters for assessment,\nevaluating BCD presents challenges due to the nature of its inferred quantity -\nthe posterior distribution. As a result, the research community has proposed\nvarious metrics to assess the quality of the approximate posterior. However,\nthere is, to date, no consensus on the most suitable metric(s) for evaluation.\nIn this work, we reexamine this question by dissecting various metrics and\nunderstanding their limitations. Through extensive empirical evaluation, we\nfind that many existing metrics fail to exhibit a strong correlation with the\nquality of approximation to the true posterior, especially in scenarios with\nlow sample sizes where BCD is most desirable. We highlight the suitability (or\nlack thereof) of these metrics under two distinct factors: the identifiability\nof the underlying causal model and the quantity of available data. Both factors\naffect the entropy of the true posterior, indicating that the current metrics\nare less fitting in settings of higher entropy. Our findings underline the\nimportance of a more nuanced evaluation of new methods by taking into account\nthe nature of the true posterior, as well as guide and motivate the development\nof new evaluation procedures for this challenge.", "paper_summary_zh": "在因果發現中表示不確定性是實驗設計中至關重要的一環，更廣泛地說，對於安全且可靠的因果決策制定而言也是如此。貝氏因果發現 (BCD) 提供了一個原則性的方法來概括這種不確定性。與依賴單個估計因果圖和模型參數進行評估的非貝氏因果發現不同，評估 BCD 由於其推論量的性質（後驗分佈）而面臨挑戰。因此，研究社群提出了各種指標來評估近似後驗的品質。然而，到目前為止，對於最適合評估的指標尚未達成共識。在這項工作中，我們透過剖析各種指標並瞭解其限制來重新審視這個問題。透過廣泛的經驗評估，我們發現許多現有指標無法展現與逼近真實後驗品質的強相關性，特別是在 BCD 最理想的低樣本量場景中。我們重點說明了這些指標在兩個不同因素下的適用性（或缺乏適用性）：基礎因果模型的可識別性以及可用資料的數量。這兩個因素都會影響真實後驗的熵，這表示目前的指標在較高熵的設定中較不合適。我們的發現強調了更細緻地評估新方法的重要性，方法是考量真實後驗的性質，並指導和激勵開發新的評估程序來應對此挑戰。", "author": "Amir Mohammad Karimi Mamaghan et.al.", "authors": "Amir Mohammad Karimi Mamaghan, Panagiotis Tigas, Karl Henrik Johansson, Yarin Gal, Yashas Annadani, Stefan Bauer", "id": "2406.03209v1", "paper_url": "http://arxiv.org/abs/2406.03209v1", "repo": "null"}}