{"2411.07417": {"publish_time": "2024-11-11", "title": "Untangling Hate Speech Definitions: A Semantic Componential Analysis Across Cultures and Domains", "paper_summary": "Hate speech relies heavily on cultural influences, leading to varying\nindividual interpretations. For that reason, we propose a Semantic Componential\nAnalysis (SCA) framework for a cross-cultural and cross-domain analysis of hate\nspeech definitions. We create the first dataset of definitions derived from\nfive domains: online dictionaries, research papers, Wikipedia articles,\nlegislation, and online platforms, which are later analyzed into semantic\ncomponents. Our analysis reveals that the components differ from definition to\ndefinition, yet many domains borrow definitions from one another without taking\ninto account the target culture. We conduct zero-shot model experiments using\nour proposed dataset, employing three popular open-sourced LLMs to understand\nthe impact of different definitions on hate speech detection. Our findings\nindicate that LLMs are sensitive to definitions: responses for hate speech\ndetection change according to the complexity of definitions used in the prompt.", "paper_summary_zh": "仇恨言論嚴重依賴文化影響，導致不同的個人詮釋。因此，我們提出語義成分分析 (SCA) 架構，用於跨文化和跨領域分析仇恨言論定義。我們建立第一個定義資料集，其來自五個領域：線上字典、研究論文、維基百科條目、立法和線上平台，隨後分析為語義成分。我們的分析顯示，各成分在不同定義中有所不同，但許多領域會從彼此借用定義，而不考慮目標文化。我們使用建議的資料集執行零次學習模型實驗，採用三個流行的開源 LLM，以了解不同定義對仇恨言論偵測的影響。我們的研究結果指出，LLM 對定義很敏感：仇恨言論偵測的回應會根據提示中使用的定義複雜度而改變。", "author": "Katerina Korre et.al.", "authors": "Katerina Korre, Arianna Muti, Federico Ruggeri, Alberto Barrón-Cedeño", "id": "2411.07417v1", "paper_url": "http://arxiv.org/abs/2411.07417v1", "repo": "null"}}