{"2408.11574": {"publish_time": "2024-08-21", "title": "Drama Engine: A Framework for Narrative Agents", "paper_summary": "This technical report presents the Drama Engine, a novel framework for\nagentic interaction with large language models designed for narrative purposes.\nThe framework adapts multi-agent system principles to create dynamic,\ncontext-aware companions that can develop over time and interact with users and\neach other. Key features include multi-agent workflows with delegation, dynamic\nprompt assembly, and model-agnostic design. The Drama Engine introduces unique\nelements such as companion development, mood systems, and automatic context\nsummarising. It is implemented in TypeScript. The framework's applications\ninclude multi-agent chats and virtual co-workers for creative writing. The\npaper discusses the system's architecture, prompt assembly process, delegation\nmechanisms, and moderation techniques, as well as potential ethical\nconsiderations and future extensions.", "paper_summary_zh": "這份技術報告介紹了 Drama Engine，這是一個新穎的架構，用於與為敘事目的而設計的大型語言模型進行代理互動。\n該架構採用多代理系統原則來創建動態、具備情境感知能力的夥伴，這些夥伴可以隨著時間推移而發展並與使用者和彼此互動。主要功能包括具有委派的多代理工作流程、動態提示組裝和與模型無關的設計。Drama Engine 引入了獨特的元素，例如夥伴開發、情緒系統和自動情境摘要。它使用 TypeScript 實作。該架構的應用包括多代理聊天和虛擬協作者，用於創意寫作。本文討論了系統的架構、提示組裝流程、委派機制和審核技術，以及潛在的道德考量和未來的延伸。", "author": "Martin Pichlmair et.al.", "authors": "Martin Pichlmair, Riddhi Raj, Charlene Putney", "id": "2408.11574v1", "paper_url": "http://arxiv.org/abs/2408.11574v1", "repo": "null"}}