{"2502.03009": {"publish_time": "2025-02-05", "title": "Scaling Laws for Upcycling Mixture-of-Experts Language Models", "paper_summary": "Pretraining large language models (LLMs) is resource-intensive, often\nrequiring months of training time even with high-end GPU clusters. There are\ntwo approaches of mitigating such computational demands: reusing smaller models\nto train larger ones (upcycling), and training computationally efficient models\nlike mixture-of-experts (MoE). In this paper, we study the upcycling of LLMs to\nMoE models, of which the scaling behavior remains underexplored. Through\nextensive experiments, we identify empirical scaling laws that describe how\nperformance depends on dataset size and model configuration. Particularly, we\nshow that, while scaling these factors improves performance, there is a novel\ninteraction term between the dense and upcycled training dataset that limits\nthe efficiency of upcycling at large computational budgets. Based on these\nfindings, we provide guidance to scale upcycling, and establish conditions\nunder which upcycling outperforms from-scratch trainings within budget\nconstraints.", "paper_summary_zh": "預訓練大型語言模型 (LLM) 需要大量的資源，即使使用高階 GPU 集群，也常常需要數個月的訓練時間。有兩種方法可以減輕這種運算需求：重複使用較小的模型來訓練較大的模型（升級），以及訓練運算效率高的模型，例如專家混合（MoE）。在本文中，我們研究了 LLM 到 MoE 模型的升級，其中規模行為仍未得到充分探索。透過廣泛的實驗，我們找出經驗性規模定律，說明效能如何取決於資料集大小和模型組態。特別是，我們展示了在擴展這些因素時會改善效能，但密集和升級訓練資料集之間有一個新的交互作用項，會限制在大型運算預算中升級的效率。根據這些發現，我們提供了擴展升級的指導方針，並建立了在預算限制內，升級優於從頭開始訓練的條件。", "author": "Seng Pei Liew et.al.", "authors": "Seng Pei Liew, Takuya Kato, Sho Takase", "id": "2502.03009v1", "paper_url": "http://arxiv.org/abs/2502.03009v1", "repo": "null"}}