{"2409.11675": {"publish_time": "2024-09-18", "title": "Towards Explainable Goal Recognition Using Weight of Evidence (WoE): A Human-Centered Approach", "paper_summary": "Goal recognition (GR) involves inferring an agent's unobserved goal from a\nsequence of observations. This is a critical problem in AI with diverse\napplications. Traditionally, GR has been addressed using 'inference to the best\nexplanation' or abduction, where hypotheses about the agent's goals are\ngenerated as the most plausible explanations for observed behavior.\nAlternatively, some approaches enhance interpretability by ensuring that an\nagent's behavior aligns with an observer's expectations or by making the\nreasoning behind decisions more transparent. In this work, we tackle a\ndifferent challenge: explaining the GR process in a way that is comprehensible\nto humans. We introduce and evaluate an explainable model for goal recognition\n(GR) agents, grounded in the theoretical framework and cognitive processes\nunderlying human behavior explanation. Drawing on insights from two human-agent\nstudies, we propose a conceptual framework for human-centered explanations of\nGR. Using this framework, we develop the eXplainable Goal Recognition (XGR)\nmodel, which generates explanations for both why and why not questions. We\nevaluate the model computationally across eight GR benchmarks and through three\nuser studies. The first study assesses the efficiency of generating human-like\nexplanations within the Sokoban game domain, the second examines perceived\nexplainability in the same domain, and the third evaluates the model's\neffectiveness in aiding decision-making in illegal fishing detection. Results\ndemonstrate that the XGR model significantly enhances user understanding,\ntrust, and decision-making compared to baseline models, underscoring its\npotential to improve human-agent collaboration.", "paper_summary_zh": "目標辨識 (GR) 涉及從一連串觀察中推論出代理人未觀察到的目標。這是 AI 中的一個關鍵問題，有各種應用。傳統上，GR 已使用「推論出最佳解釋」或「假說」來解決，其中關於代理人目標的假設被產生為觀察到的行為最合理的解釋。或者，一些方法通過確保代理人的行為符合觀察者的期望或讓決策背後的推理更加透明，來增強可解釋性。在這項工作中，我們應對了不同的挑戰：以人類可以理解的方式解釋 GR 過程。我們引入並評估了一個可解釋的目標辨識 (GR) 代理模型，它基於人類行為解釋的理論框架和認知過程。借鑒兩項人機研究的見解，我們提出了以人為中心的 GR 解釋的概念框架。使用這個框架，我們開發了可解釋目標辨識 (XGR) 模型，它為為什麼和為什麼不的問題生成解釋。我們通過八個 GR 基準和三項使用者研究在計算上評估模型。第一項研究評估在數獨遊戲領域內生成類人解釋的效率，第二項研究在同一個領域中檢查感知的可解釋性，第三項評估模型在幫助非法捕魚偵測中進行決策的有效性。結果表明，與基線模型相比，XGR 模型顯著增強了使用者的理解、信任和決策制定，這凸顯了其改善人機協作的潛力。", "author": "Abeer Alshehri et.al.", "authors": "Abeer Alshehri, Amal Abdulrahman, Hajar Alamri, Tim Miller, Mor Vered", "id": "2409.11675v1", "paper_url": "http://arxiv.org/abs/2409.11675v1", "repo": "null"}}