{"2412.14751": {"publish_time": "2024-12-19", "title": "Query pipeline optimization for cancer patient question answering systems", "paper_summary": "Retrieval-augmented generation (RAG) mitigates hallucination in Large\nLanguage Models (LLMs) by using query pipelines to retrieve relevant external\ninformation and grounding responses in retrieved knowledge. However, query\npipeline optimization for cancer patient question-answering (CPQA) systems\nrequires separately optimizing multiple components with domain-specific\nconsiderations. We propose a novel three-aspect optimization approach for the\nRAG query pipeline in CPQA systems, utilizing public biomedical databases like\nPubMed and PubMed Central. Our optimization includes: (1) document retrieval,\nutilizing a comparative analysis of NCBI resources and introducing Hybrid\nSemantic Real-time Document Retrieval (HSRDR); (2) passage retrieval,\nidentifying optimal pairings of dense retrievers and rerankers; and (3)\nsemantic representation, introducing Semantic Enhanced Overlap Segmentation\n(SEOS) for improved contextual understanding. On a custom-developed dataset\ntailored for cancer-related inquiries, our optimized RAG approach improved the\nanswer accuracy of Claude-3-haiku by 5.24% over chain-of-thought prompting and\nabout 3% over a naive RAG setup. This study highlights the importance of\ndomain-specific query optimization in realizing the full potential of RAG and\nprovides a robust framework for building more accurate and reliable CPQA\nsystems, advancing the development of RAG-based biomedical systems.", "paper_summary_zh": "檢索增強生成 (RAG) 透過使用查詢管線來擷取相關外部資訊，並將回應建立在擷取的知識中，以減輕大型語言模型 (LLM) 中的幻覺。然而，癌症患者問答 (CPQA) 系統的查詢管線最佳化需要使用特定於領域的考量，分別最佳化多個元件。我們提出一個創新的三面向最佳化方法，用於 CPQA 系統中的 RAG 查詢管線，利用 PubMed 和 PubMed Central 等公開生物醫學資料庫。我們的最佳化包括：(1) 文件擷取，利用 NCBI 資源的比較分析，並引入混合語義即時文件擷取 (HSRDR)；(2) 段落擷取，找出稠密擷取器和重新排序器的最佳配對；以及 (3) 語意表示，引入語意增強重疊分段 (SEOS) 以改善脈絡理解。在針對癌症相關查詢量身打造的客製化開發資料集上，我們最佳化的 RAG 方法將 Claude-3-haiku 的答案準確度提升了 5.24%，優於思考鏈提示，且比樸素的 RAG 設定提升了約 3%。這項研究強調了特定於領域的查詢最佳化在實現 RAG 充分潛力的重要性，並提供了一個穩健的架構來建構更準確且可靠的 CPQA 系統，促進基於 RAG 的生物醫學系統的發展。", "author": "Maolin He et.al.", "authors": "Maolin He, Rena Gao, Mike Conway, Brian E. Chapman", "id": "2412.14751v1", "paper_url": "http://arxiv.org/abs/2412.14751v1", "repo": "null"}}