{"2410.13343": {"publish_time": "2024-10-17", "title": "Do LLMs Overcome Shortcut Learning? An Evaluation of Shortcut Challenges in Large Language Models", "paper_summary": "Large Language Models (LLMs) have shown remarkable capabilities in various\nnatural language processing tasks. However, LLMs may rely on dataset biases as\nshortcuts for prediction, which can significantly impair their robustness and\ngeneralization capabilities. This paper presents Shortcut Suite, a\ncomprehensive test suite designed to evaluate the impact of shortcuts on LLMs'\nperformance, incorporating six shortcut types, five evaluation metrics, and\nfour prompting strategies. Our extensive experiments yield several key\nfindings: 1) LLMs demonstrate varying reliance on shortcuts for downstream\ntasks, significantly impairing their performance. 2) Larger LLMs are more\nlikely to utilize shortcuts under zero-shot and few-shot in-context learning\nprompts. 3) Chain-of-thought prompting notably reduces shortcut reliance and\noutperforms other prompting strategies, while few-shot prompts generally\nunderperform compared to zero-shot prompts. 4) LLMs often exhibit\noverconfidence in their predictions, especially when dealing with datasets that\ncontain shortcuts. 5) LLMs generally have a lower explanation quality in\nshortcut-laden datasets, with errors falling into three types: distraction,\ndisguised comprehension, and logical fallacy. Our findings offer new insights\nfor evaluating robustness and generalization in LLMs and suggest potential\ndirections for mitigating the reliance on shortcuts. The code is available at\n\\url {https://github.com/yyhappier/ShortcutSuite.git}.", "paper_summary_zh": "大型語言模型 (LLM) 在各種自然語言處理任務中展現出非凡的能力。然而，LLM 可能依賴於資料集偏差作為預測的捷徑，這可能會顯著損害其穩健性和泛化能力。本文提出 Shortcut Suite，這是一個全面的測試套件，旨在評估捷徑對 LLM 效能的影響，並整合六種捷徑類型、五種評估指標和四種提示策略。我們廣泛的實驗產生了幾個關鍵發現：1) LLM 展示出對下游任務捷徑的不同依賴性，顯著損害其效能。2) 較大的 LLM 更可能在零次學習和少量學習情境學習提示下使用捷徑。3) 思考鏈提示顯著降低對捷徑的依賴，並優於其他提示策略，而少量提示通常表現不如零次提示。4) LLM 經常對其預測過度自信，尤其是在處理包含捷徑的資料集時。5) LLM 在捷徑資料集中通常具有較低的解釋品質，錯誤分為三種類型：分心、偽裝理解和邏輯謬誤。我們的發現為評估 LLM 中的穩健性和泛化提供了新的見解，並提出減輕對捷徑依賴的潛在方向。程式碼可在\\url {https://github.com/yyhappier/ShortcutSuite.git} 取得。", "author": "Yu Yuan et.al.", "authors": "Yu Yuan, Lili Zhao, Kai Zhang, Guangting Zheng, Qi Liu", "id": "2410.13343v1", "paper_url": "http://arxiv.org/abs/2410.13343v1", "repo": "null"}}