{"2501.11951": {"publish_time": "2025-01-21", "title": "HERITAGE: An End-to-End Web Platform for Processing Korean Historical Documents in Hanja", "paper_summary": "While Korean historical documents are invaluable cultural heritage,\nunderstanding those documents requires in-depth Hanja expertise. Hanja is an\nancient language used in Korea before the 20th century, whose characters were\nborrowed from old Chinese but had evolved in Korea for centuries. Modern\nKoreans and Chinese cannot understand Korean historical documents without\nsubstantial additional help, and while previous efforts have produced some\nKorean and English translations, this requires in-depth expertise, and so most\nof the documents are not translated into any modern language. To address this\ngap, we present HERITAGE, the first open-source Hanja NLP toolkit to assist in\nunderstanding and translating the unexplored Korean historical documents\nwritten in Hanja. HERITAGE is a web-based platform providing model predictions\nof three critical tasks in historical document understanding via Hanja language\nmodels: punctuation restoration, named entity recognition, and machine\ntranslation (MT). HERITAGE also provides an interactive glossary, which\nprovides the character-level reading of the Hanja characters in modern Korean,\nas well as character-level English definition. HERITAGE serves two purposes.\nFirst, anyone interested in these documents can get a general understanding\nfrom the model predictions and the interactive glossary, especially MT outputs\nin Korean and English. Second, since the model outputs are not perfect, Hanja\nexperts can revise them to produce better annotations and translations. This\nwould boost the translation efficiency and potentially lead to most of the\nhistorical documents being translated into modern languages, lowering the\nbarrier on unexplored Korean historical documents.", "paper_summary_zh": "<paragraph>儘管韓國歷史文件是無價的文化遺產，但要理解這些文件需要深入的漢字專業知識。漢字是一種在 20 世紀前於韓國使用的古代語言，其字元取自古漢語，但在韓國演變了數百年。現代韓國人和中國人無法在沒有大量額外幫助的情況下理解韓國歷史文件，儘管先前的努力產生了一些韓語和英語翻譯，但這需要深入的專業知識，因此大多數文件並未翻譯成任何現代語言。為了解決這個差距，我們提出了 HERITAGE，這是第一個開源漢字 NLP 工具包，用於協助理解和翻譯未探索的以漢字書寫的韓國歷史文件。HERITAGE 是基於網路的平台，透過漢字語言模型提供歷史文件理解中三個關鍵任務的模型預測：標點符號還原、命名實體辨識和機器翻譯 (MT)。HERITAGE 還提供互動式詞彙表，提供漢字字元在現代韓語中的字元級讀音，以及字元級英語定義。HERITAGE 有兩個目的。首先，任何對這些文件感興趣的人都可以從模型預測和互動式詞彙表中獲得一般性的理解，特別是韓語和英語中的 MT 輸出。其次，由於模型輸出並非完美，漢字專家可以修改它們以產生更好的註釋和翻譯。這將提高翻譯效率，並可能導致大多數歷史文件被翻譯成現代語言，降低未探索的韓國歷史文件的門檻。</paragraph>", "author": "Seyoung Song et.al.", "authors": "Seyoung Song, Haneul Yoo, Jiho Jin, Kyunghyun Cho, Alice Oh", "id": "2501.11951v1", "paper_url": "http://arxiv.org/abs/2501.11951v1", "repo": "https://github.com/seyoungsong/hanja-platform"}}