{"2405.17390": {"publish_time": "2024-05-27", "title": "KSW: Khmer Stop Word based Dictionary for Keyword Extraction", "paper_summary": "This paper introduces KSW, a Khmer-specific approach to keyword extraction\nthat leverages a specialized stop word dictionary. Due to the limited\navailability of natural language processing resources for the Khmer language,\neffective keyword extraction has been a significant challenge. KSW addresses\nthis by developing a tailored stop word dictionary and implementing a\npreprocessing methodology to remove stop words, thereby enhancing the\nextraction of meaningful keywords. Our experiments demonstrate that KSW\nachieves substantial improvements in accuracy and relevance compared to\nprevious methods, highlighting its potential to advance Khmer text processing\nand information retrieval. The KSW resources, including the stop word\ndictionary, are available at the following GitHub repository:\n(https://github.com/back-kh/KSWv2-Khmer-Stop-Word-based-Dictionary-for-Keyword-Extraction.git).", "paper_summary_zh": "這篇論文介紹了 KSW，一種利用專門停用詞詞典的專門用於高棉語的關鍵字萃取方法。由於高棉語的自然語言處理資源有限，因此有效的關鍵字萃取一直是一項重大的挑戰。KSW 透過開發一個量身打造的停用詞詞典並實作一個預處理方法來移除停用詞，進而增強有意義關鍵字的萃取，來解決這個問題。我們的實驗證明，與先前的各種方法相比，KSW 在準確度和相關性方面都有顯著的提升，突顯了它在推進高棉語文本處理和資訊檢索方面的潛力。KSW 資源，包括停用詞詞典，可以在以下 GitHub 儲存庫中取得：(https://github.com/back-kh/KSWv2-Khmer-Stop-Word-based-Dictionary-for-Keyword-Extraction.git)。", "author": "Nimol Thuon et.al.", "authors": "Nimol Thuon, Wangrui Zhang, Sada Thuon", "id": "2405.17390v1", "paper_url": "http://arxiv.org/abs/2405.17390v1", "repo": "https://github.com/back-kh/KSWv2-Khmer-Stop-Word-based-Dictionary-for-Keyword-Extraction"}}