{"2410.19128": {"publish_time": "2024-10-24", "title": "Retrieving Implicit and Explicit Emotional Events Using Large Language Models", "paper_summary": "Large language models (LLMs) have garnered significant attention in recent\nyears due to their impressive performance. While considerable research has\nevaluated these models from various perspectives, the extent to which LLMs can\nperform implicit and explicit emotion retrieval remains largely unexplored. To\naddress this gap, this study investigates LLMs' emotion retrieval capabilities\nin commonsense. Through extensive experiments involving multiple models, we\nsystematically evaluate the ability of LLMs on emotion retrieval. Specifically,\nwe propose a supervised contrastive probing method to verify LLMs' performance\nfor implicit and explicit emotion retrieval, as well as the diversity of the\nemotional events they retrieve. The results offer valuable insights into the\nstrengths and limitations of LLMs in handling emotion retrieval.", "paper_summary_zh": "近年來，由於大型語言模型 (LLM) 令人印象深刻的效能，因此備受關注。儘管有大量的研究從各種角度評估這些模型，但 LLM 能執行內隱和外顯情緒擷取的程度仍未被廣泛探討。為了解決這個差距，本研究探討 LLM 在常識中的情緒擷取能力。透過涉及多個模型的廣泛實驗，我們系統性地評估 LLM 在情緒擷取上的能力。具體來說，我們提出一個監督對比探測方法來驗證 LLM 在內隱和外顯情緒擷取上的效能，以及他們擷取的情緒事件的多樣性。研究結果為 LLM 在處理情緒擷取時的優缺點提供了有價值的見解。", "author": "Guimin Hu et.al.", "authors": "Guimin Hu", "id": "2410.19128v1", "paper_url": "http://arxiv.org/abs/2410.19128v1", "repo": "null"}}