{"2404.03868": {"publish_time": "2024-04-05", "title": "Extract, Define, Canonicalize: An LLM-based Framework for Knowledge Graph Construction", "paper_summary": "In this work, we are interested in automated methods for knowledge graph\ncreation (KGC) from input text. Progress on large language models (LLMs) has\nprompted a series of recent works applying them to KGC, e.g., via zero/few-shot\nprompting. Despite successes on small domain-specific datasets, these models\nface difficulties scaling up to text common in many real-world applications. A\nprincipal issue is that in prior methods, the KG schema has to be included in\nthe LLM prompt to generate valid triplets; larger and more complex schema\neasily exceed the LLMs' context window length. To address this problem, we\npropose a three-phase framework named Extract-Define-Canonicalize (EDC): open\ninformation extraction followed by schema definition and post-hoc\ncanonicalization. EDC is flexible in that it can be applied to settings where a\npre-defined target schema is available and when it is not; in the latter case,\nit constructs a schema automatically and applies self-canonicalization. To\nfurther improve performance, we introduce a trained component that retrieves\nschema elements relevant to the input text; this improves the LLMs' extraction\nperformance in a retrieval-augmented generation-like manner. We demonstrate on\nthree KGC benchmarks that EDC is able to extract high-quality triplets without\nany parameter tuning and with significantly larger schemas compared to prior\nworks.", "paper_summary_zh": "在這項工作中，我們有興趣建立從輸入文本中建立知識圖譜 (KGC) 的自動化方法。大型語言模型 (LLM) 的進展促使一系列近期研究將其應用於 KGC，例如透過零次/少次提示。儘管在小規模特定領域的資料集上獲得成功，這些模型在擴展到許多實際應用中常見的文本時會遇到困難。主要問題在於，在先前的模型中，KG 架構必須包含在 LLM 提示中才能產生有效的 triplets；較大且較複雜的架構很容易超過 LLM 的內容視窗長度。為了解決這個問題，我們提出了一個稱為 Extract-Define-Canonicalize (EDC) 的三階段架構：開放資訊萃取，接著是架構定義和事後標準化。EDC 的靈活性在於它可以應用於有預先定義的目標架構和沒有目標架構的設定中；在後者的情況下，它會自動建構一個架構並套用自我標準化。為了進一步提升效能，我們引入一個訓練好的元件，用來擷取與輸入文本相關的架構元素；這以類似於擷取增強生成的方式提升了 LLM 的萃取效能。我們在三個 KGC 基準上展示了 EDC 能夠在沒有任何參數調整的情況下萃取出高品質的 triplets，並且與先前的研究相比，架構也大幅增加。", "author": "Bowen Zhang et.al.", "authors": "Bowen Zhang, Harold Soh", "id": "2404.03868v1", "paper_url": "http://arxiv.org/abs/2404.03868v1", "repo": "null"}}