{"2409.11552": {"publish_time": "2024-09-17", "title": "Multi-Domain Data Aggregation for Axon and Myelin Segmentation in Histology Images", "paper_summary": "Quantifying axon and myelin properties (e.g., axon diameter, myelin\nthickness, g-ratio) in histology images can provide useful information about\nmicrostructural changes caused by neurodegenerative diseases. Automatic tissue\nsegmentation is an important tool for these datasets, as a single stained\nsection can contain up to thousands of axons. Advances in deep learning have\nmade this task quick and reliable with minimal overhead, but a deep learning\nmodel trained by one research group will hardly ever be usable by other groups\ndue to differences in their histology training data. This is partly due to\nsubject diversity (different body parts, species, genetics, pathologies) and\nalso to the range of modern microscopy imaging techniques resulting in a wide\nvariability of image features (i.e., contrast, resolution). There is a pressing\nneed to make AI accessible to neuroscience researchers to facilitate and\naccelerate their workflow, but publicly available models are scarce and poorly\nmaintained. Our approach is to aggregate data from multiple imaging modalities\n(bright field, electron microscopy, Raman spectroscopy) and species (mouse,\nrat, rabbit, human), to create an open-source, durable tool for axon and myelin\nsegmentation. Our generalist model makes it easier for researchers to process\ntheir data and can be fine-tuned for better performance on specific domains. We\nstudy the benefits of different aggregation schemes. This multi-domain\nsegmentation model performs better than single-modality dedicated learners\n(p=0.03077), generalizes better on out-of-distribution data and is easier to\nuse and maintain. Importantly, we package the segmentation tool into a\nwell-maintained open-source software ecosystem (see\nhttps://github.com/axondeepseg/axondeepseg).", "paper_summary_zh": "<paragraph>量化组织学图像中的轴突和髓鞘特性（例如，轴突直径、髓鞘厚度、g 比率）可以提供有关神经退行性疾病引起微观结构变化的有用信息。自动组织分割是这些数据集的重要工具，因为一个单一的染色切片可以包含多达数千个轴突。深度学习的进步使这项任务快速且可靠，且开销最小，但是一个研究小组训练的深度学习模型几乎不可能被其他小组使用，因为他们的组织学训练数据存在差异。这部分是由于受试者多样性（不同的身体部位、物种、遗传学、病理学）以及现代显微成像技术的范围导致图像特征（即对比度、分辨率）有很大差异。迫切需要让神经科学研究人员可以使用 AI，以促进和加速他们的工作流程，但公开可用的模型稀缺且维护不善。我们的方法是汇总来自多种成像方式（明场、电子显微镜、拉曼光谱）和物种（小鼠、大鼠、兔子、人类）的数据，以创建用于轴突和髓鞘分割的开源、耐用的工具。我们的通用模型使研究人员更容易处理他们的数据，并且可以针对特定域进行微调以获得更好的性能。我们研究了不同聚合方案的好处。这种多域分割模型比单模态专用学习器（p=0.03077）表现得更好，在分布外数据上泛化得更好，并且更容易使用和维护。重要的是，我们将分割工具打包到维护良好的开源软件生态系统中（请参阅 https://github.com/axondeepseg/axondeepseg）。</paragraph>", "author": "Armand Collin et.al.", "authors": "Armand Collin, Arthur Boschet, Mathieu Boudreau, Julien Cohen-Adad", "id": "2409.11552v1", "paper_url": "http://arxiv.org/abs/2409.11552v1", "repo": "https://github.com/axondeepseg/axondeepseg"}}