{"2408.02707": {"publish_time": "2024-08-05", "title": "SnapE -- Training Snapshot Ensembles of Link Prediction Models", "paper_summary": "Snapshot ensembles have been widely used in various fields of prediction.\nThey allow for training an ensemble of prediction models at the cost of\ntraining a single one. They are known to yield more robust predictions by\ncreating a set of diverse base models. In this paper, we introduce an approach\nto transfer the idea of snapshot ensembles to link prediction models in\nknowledge graphs. Moreover, since link prediction in knowledge graphs is a\nsetup without explicit negative examples, we propose a novel training loop that\niteratively creates negative examples using previous snapshot models. An\nevaluation with four base models across four datasets shows that this approach\nconstantly outperforms the single model approach, while keeping the training\ntime constant.", "paper_summary_zh": "快照合奏已广泛用于各种预测领域。\n它们允许以训练单个模型的成本训练预测模型合奏。\n众所周知，它们通过创建一组不同的基础模型来产生更稳健的预测。\n在本文中，我们介绍了一种将快照合奏思想转移到知识图谱中链接预测模型的方法。\n此外，由于知识图谱中的链接预测是一个没有明确负面示例的设置，我们提出了一个新颖的训练循环，\n它使用以前的快照模型迭代创建负面示例。\n对四个数据集上的四个基础模型的评估表明，这种方法始终优于单一模型方法，同时保持训练时间不变。", "author": "Ali Shaban et.al.", "authors": "Ali Shaban, Heiko Paulheim", "id": "2408.02707v1", "paper_url": "http://arxiv.org/abs/2408.02707v1", "repo": "null"}}