{"2502.11830": {"publish_time": "2025-02-17", "title": "Text Classification in the LLM Era - Where do we stand?", "paper_summary": "Large Language Models revolutionized NLP and showed dramatic performance\nimprovements across several tasks. In this paper, we investigated the role of\nsuch language models in text classification and how they compare with other\napproaches relying on smaller pre-trained language models. Considering 32\ndatasets spanning 8 languages, we compared zero-shot classification, few-shot\nfine-tuning and synthetic data based classifiers with classifiers built using\nthe complete human labeled dataset. Our results show that zero-shot approaches\ndo well for sentiment classification, but are outperformed by other approaches\nfor the rest of the tasks, and synthetic data sourced from multiple LLMs can\nbuild better classifiers than zero-shot open LLMs. We also see wide performance\ndisparities across languages in all the classification scenarios. We expect\nthat these findings would guide practitioners working on developing text\nclassification systems across languages.", "paper_summary_zh": "大型語言模型革新了自然語言處理，並在多項任務中展現出顯著的效能提升。在本文中，我們探討了此類語言模型在文字分類中的角色，以及它們與依賴較小規模預先訓練語言模型的其他方法相比如何。考量涵蓋 8 種語言的 32 個資料集，我們比較了零次學習分類、少次學習微調和合成資料分類器，以及使用完整人工標記資料集建置的分類器。我們的結果顯示，零次學習方法在情緒分類中表現良好，但在其他任務中則不如其他方法，而來自多個大型語言模型的合成資料可以建置比零次學習開放大型語言模型更好的分類器。我們也看到在所有分類情境中，不同語言之間的效能差異很大。我們預期這些發現將引導從事跨語言文字分類系統開發的實務工作者。", "author": "Sowmya Vajjala et.al.", "authors": "Sowmya Vajjala, Shwetali Shimangaud", "id": "2502.11830v1", "paper_url": "http://arxiv.org/abs/2502.11830v1", "repo": "null"}}