{"2411.19886": {"publish_time": "2024-11-29", "title": "PDDLFuse: A Tool for Generating Diverse Planning Domains", "paper_summary": "Various real-world challenges require planning algorithms that can adapt to a\nbroad range of domains. Traditionally, the creation of planning domains has\nrelied heavily on human implementation, which limits the scale and diversity of\navailable domains. While recent advancements have leveraged generative AI\ntechnologies such as large language models (LLMs) for domain creation, these\nefforts have predominantly focused on translating existing domains from natural\nlanguage descriptions rather than generating novel ones. In contrast, the\nconcept of domain randomization, which has been highly effective in\nreinforcement learning, enhances performance and generalizability by training\non a diverse array of randomized new domains. Inspired by this success, our\ntool, PDDLFuse, aims to bridge this gap in Planning Domain Definition Language\n(PDDL). PDDLFuse is designed to generate new, diverse planning domains that can\nbe used to validate new planners or test foundational planning models. We have\ndeveloped methods to adjust the domain generators parameters to modulate the\ndifficulty of the domains it generates. This adaptability is crucial as\nexisting domain-independent planners often struggle with more complex problems.\nInitial tests indicate that PDDLFuse efficiently creates intricate and varied\ndomains, representing a significant advancement over traditional domain\ngeneration methods and making a contribution towards planning research.", "paper_summary_zh": "各種現實世界的挑戰需要能夠適應廣泛領域的規劃演算法。傳統上，規劃領域的建立高度依賴於人工實作，這限制了可用領域的規模和多樣性。雖然最近的進展已利用生成式 AI 技術，例如大型語言模型 (LLM) 來進行領域建立，但這些努力主要集中於從自然語言描述中翻譯現有領域，而不是生成新的領域。相比之下，在強化學習中非常有效的領域隨機化的概念，透過在各種隨機新領域上進行訓練，增強了效能和泛化能力。受到這種成功的啟發，我們的工具 PDDLFuse 旨在彌補規劃領域定義語言 (PDDL) 中的這一差距。PDDLFuse 旨在產生新的、多樣化的規劃領域，可用於驗證新的規劃器或測試基礎規劃模型。我們已開發出調整領域產生器參數的方法，以調整其所產生領域的難度。這種適應能力至關重要，因為現有的與領域無關的規劃器通常難以處理更複雜的問題。初步測試表明，PDDLFuse 有效地建立了複雜且多樣的領域，代表了傳統領域產生方法的重大進步，並為規劃研究做出了貢獻。", "author": "Vedant Khandelwal et.al.", "authors": "Vedant Khandelwal, Amit Sheth, Forest Agostinelli", "id": "2411.19886v1", "paper_url": "http://arxiv.org/abs/2411.19886v1", "repo": "null"}}