{"2408.10946": {"publish_time": "2024-08-20", "title": "Large Language Model Driven Recommendation", "paper_summary": "While previous chapters focused on recommendation systems (RSs) based on\nstandardized, non-verbal user feedback such as purchases, views, and clicks --\nthe advent of LLMs has unlocked the use of natural language (NL) interactions\nfor recommendation. This chapter discusses how LLMs' abilities for general NL\nreasoning present novel opportunities to build highly personalized RSs -- which\ncan effectively connect nuanced and diverse user preferences to items,\npotentially via interactive dialogues. To begin this discussion, we first\npresent a taxonomy of the key data sources for language-driven recommendation,\ncovering item descriptions, user-system interactions, and user profiles. We\nthen proceed to fundamental techniques for LLM recommendation, reviewing the\nuse of encoder-only and autoregressive LLM recommendation in both tuned and\nuntuned settings. Afterwards, we move to multi-module recommendation\narchitectures in which LLMs interact with components such as retrievers and RSs\nin multi-stage pipelines. This brings us to architectures for conversational\nrecommender systems (CRSs), in which LLMs facilitate multi-turn dialogues where\neach turn presents an opportunity not only to make recommendations, but also to\nengage with the user in interactive preference elicitation, critiquing, and\nquestion-answering.", "paper_summary_zh": "在先前的章节中，我们专注于基于标准化、非语言用户反馈（例如购买、浏览和点击）的推荐系统 (RS)，而 LLM 的出现解锁了自然语言 (NL) 交互在推荐中的使用。本章讨论了 LLM 在一般 NL 推理方面的能力如何为构建高度个性化的 RS 提供新的机会，这些 RS 可以通过交互式对话有效地将细微差别和多样化的用户偏好与商品联系起来。为了开始此讨论，我们首先介绍了语言驱动推荐的关键数据源的分类，涵盖商品描述、用户系统交互和用户个人资料。然后，我们继续研究 LLM 推荐的基本技术，回顾在调整和未调整设置中使用仅编码器和自回归 LLM 推荐。之后，我们转向多模块推荐架构，其中 LLM 与检索器和 RS 等组件在多阶段管道中进行交互。这将我们带到了会话推荐系统 (CRS) 的架构，其中 LLM 促进了多轮对话，在每轮对话中，不仅有机会提出推荐，还可以与用户进行交互式偏好引发、批评和问答。", "author": "Anton Korikov et.al.", "authors": "Anton Korikov, Scott Sanner, Yashar Deldjoo, Zhankui He, Julian McAuley, Arnau Ramisa, Rene Vidal, Mahesh Sathiamoorthy, Atoosa Kasrizadeh, Silvia Milano, Francesco Ricci", "id": "2408.10946v1", "paper_url": "http://arxiv.org/abs/2408.10946v1", "repo": "null"}}