{"2502.13646": {"publish_time": "2025-02-19", "title": "D.Va: Validate Your Demonstration First Before You Use It", "paper_summary": "In-context learning (ICL) has demonstrated significant potential in enhancing\nthe capabilities of large language models (LLMs) during inference. It's\nwell-established that ICL heavily relies on selecting effective demonstrations\nto generate outputs that better align with the expected results. As for\ndemonstration selection, previous approaches have typically relied on intuitive\nmetrics to evaluate the effectiveness of demonstrations, which often results in\nlimited robustness and poor cross-model generalization capabilities. To tackle\nthese challenges, we propose a novel method, \\textbf{D}emonstration\n\\textbf{VA}lidation (\\textbf{D.Va}), which integrates a demonstration\nvalidation perspective into this field. By introducing the demonstration\nvalidation mechanism, our method effectively identifies demonstrations that are\nboth effective and highly generalizable. \\textbf{D.Va} surpasses all existing\ndemonstration selection techniques across both natural language understanding\n(NLU) and natural language generation (NLG) tasks. Additionally, we demonstrate\nthe robustness and generalizability of our approach across various language\nmodels with different retrieval models.", "paper_summary_zh": "情境式學習 (ICL) 已證明在推論期間增強大型語言模型 (LLM) 的能力方面具有顯著潛力。眾所周知，ICL 嚴重依賴於選擇有效的示範來產生更符合預期結果的輸出。至於示範選擇，先前的做法通常依賴於直覺指標來評估示範的有效性，這通常會導致穩健性受限和跨模型泛化能力不佳。為了應對這些挑戰，我們提出了一種新方法，**D**emonstration **VA**lidation（**D.Va**），將示範驗證觀點整合到這個領域。透過引入示範驗證機制，我們的做法有效地找出既有效又高度可泛化的示範。**D.Va** 超越所有現有的示範選擇技術，涵蓋自然語言理解 (NLU) 和自然語言生成 (NLG) 任務。此外，我們展示了我們的方法在具有不同檢索模型的各種語言模型中的穩健性和可泛化性。", "author": "Qi Zhang et.al.", "authors": "Qi Zhang, Zhiqing Xiao, Ruixuan Xiao, Lirong Gao, Junbo Zhao", "id": "2502.13646v1", "paper_url": "http://arxiv.org/abs/2502.13646v1", "repo": "null"}}