{"2409.16089": {"publish_time": "2024-09-24", "title": "From Pixels to Words: Leveraging Explainability in Face Recognition through Interactive Natural Language Processing", "paper_summary": "Face Recognition (FR) has advanced significantly with the development of deep\nlearning, achieving high accuracy in several applications. However, the lack of\ninterpretability of these systems raises concerns about their accountability,\nfairness, and reliability. In the present study, we propose an interactive\nframework to enhance the explainability of FR models by combining\nmodel-agnostic Explainable Artificial Intelligence (XAI) and Natural Language\nProcessing (NLP) techniques. The proposed framework is able to accurately\nanswer various questions of the user through an interactive chatbot. In\nparticular, the explanations generated by our proposed method are in the form\nof natural language text and visual representations, which for example can\ndescribe how different facial regions contribute to the similarity measure\nbetween two faces. This is achieved through the automatic analysis of the\noutput's saliency heatmaps of the face images and a BERT question-answering\nmodel, providing users with an interface that facilitates a comprehensive\nunderstanding of the FR decisions. The proposed approach is interactive,\nallowing the users to ask questions to get more precise information based on\nthe user's background knowledge. More importantly, in contrast to previous\nstudies, our solution does not decrease the face recognition performance. We\ndemonstrate the effectiveness of the method through different experiments,\nhighlighting its potential to make FR systems more interpretable and\nuser-friendly, especially in sensitive applications where decision-making\ntransparency is crucial.", "paper_summary_zh": "人臉辨識 (FR) 已隨著深度學習的發展而進步許多，在多項應用中達到很高的準確度。然而，這些系統缺乏可解釋性，引發了對其責任、公平性和可靠性的疑慮。在本研究中，我們提出一個互動式架構，透過結合與模型無關的可解釋人工智慧 (XAI) 和自然語言處理 (NLP) 技術，來增強 FR 模型的可解釋性。所提出的架構能夠透過互動式聊天機器人，精確回答使用者的各種問題。特別是，我們所提出的方法所產生的解釋，是以自然語言文字和視覺表示的形式呈現，例如可以描述不同臉部區域如何影響兩張臉之間的相似度量度。這是透過自動分析臉部影像的顯著熱點圖和 BERT 問答模型來達成，為使用者提供一個介面，以利全面理解 FR 決策。所提出的方法具有互動性，允許使用者提問，以根據使用者的背景知識取得更精確的資訊。更重要的是，與先前的研究相比，我們的解決方案並未降低人臉辨識效能。我們透過不同的實驗，證明此方法的有效性，強調其讓 FR 系統更具可解釋性及使用者友善性的潛力，特別是在決策透明度至關重要的敏感應用中。", "author": "Ivan DeAndres-Tame et.al.", "authors": "Ivan DeAndres-Tame, Muhammad Faisal, Ruben Tolosana, Rouqaiah Al-Refai, Ruben Vera-Rodriguez, Philipp Terhörst", "id": "2409.16089v1", "paper_url": "http://arxiv.org/abs/2409.16089v1", "repo": "null"}}