{"2412.08578": {"publish_time": "2024-12-11", "title": "Machine Learning Information Retrieval and Summarisation to Support Systematic Review on Outcomes Based Contracting", "paper_summary": "As academic literature proliferates, traditional review methods are\nincreasingly challenged by the sheer volume and diversity of available\nresearch. This article presents a study that aims to address these challenges\nby enhancing the efficiency and scope of systematic reviews in the social\nsciences through advanced machine learning (ML) and natural language processing\n(NLP) tools. In particular, we focus on automating stages within the systematic\nreviewing process that are time-intensive and repetitive for human annotators\nand which lend themselves to immediate scalability through tools such as\ninformation retrieval and summarisation guided by expert advice. The article\nconcludes with a summary of lessons learnt regarding the integrated approach\ntowards systematic reviews and future directions for improvement, including\nexplainability.", "paper_summary_zh": "隨著學術文獻的激增，傳統的審查方法越來越受到可用研究的龐大數量和多樣性的挑戰。本文提出了一項研究，旨在通過先進的機器學習 (ML) 和自然語言處理 (NLP) 工具來提高社會科學中系統性審查的效率和範圍，以應對這些挑戰。特別是，我們專注於自動化系統性審查過程中耗時且對人類註釋者來說重複的階段，這些階段本身就可以通過信息檢索和專家建議指導的摘要等工具立即實現可擴展性。本文最後總結了關於系統性審查的綜合方法和改進的未來方向（包括可解釋性）的經驗教訓。", "author": "Iman Munire Bilal et.al.", "authors": "Iman Munire Bilal, Zheng Fang, Miguel Arana-Catania, Felix-Anselm van Lier, Juliana Outes Velarde, Harry Bregazzi, Eleanor Carter, Mara Airoldi, Rob Procter", "id": "2412.08578v1", "paper_url": "http://arxiv.org/abs/2412.08578v1", "repo": "null"}}