{"2408.12063": {"publish_time": "2024-08-22", "title": "A Deconfounding Approach to Climate Model Bias Correction", "paper_summary": "Global Climate Models (GCMs) are crucial for predicting future climate\nchanges by simulating the Earth systems. However, GCM outputs exhibit\nsystematic biases due to model uncertainties, parameterization simplifications,\nand inadequate representation of complex climate phenomena. Traditional bias\ncorrection methods, which rely on historical observation data and statistical\ntechniques, often neglect unobserved confounders, leading to biased results.\nThis paper proposes a novel bias correction approach to utilize both GCM and\nobservational data to learn a factor model that captures multi-cause latent\nconfounders. Inspired by recent advances in causality based time series\ndeconfounding, our method first constructs a factor model to learn latent\nconfounders from historical data and then applies them to enhance the bias\ncorrection process using advanced time series forecasting models. The\nexperimental results demonstrate significant improvements in the accuracy of\nprecipitation outputs. By addressing unobserved confounders, our approach\noffers a robust and theoretically grounded solution for climate model bias\ncorrection.", "paper_summary_zh": "全球氣候模式 (GCM) 對於預測未來氣候變化至關重要，方法是模擬地球系統。然而，GCM 輸出會因為模型不確定性、參數化簡化和複雜氣候現象的不足表示而展現出系統性偏差。傳統的偏差修正方法依賴於歷史觀測資料和統計技術，常常忽略未觀察到的混雜因素，導致有偏差的結果。本文提出了一種新穎的偏差修正方法，利用 GCM 和觀測資料來學習一個因子模型，以捕捉多因潛在混雜因素。受到因果關係時間序列去混雜的最新進展啟發，我們的模型首先建構一個因子模型，從歷史資料學習潛在混雜因素，然後應用它們來使用進階時間序列預測模型增強偏差修正過程。實驗結果證明降水輸出的準確性有顯著的改善。我們的模型透過解決未觀察到的混雜因素，為氣候模型偏差修正提供了一個穩健且理論紮實的解決方案。", "author": "Wentao Gao et.al.", "authors": "Wentao Gao, Jiuyong Li, Debo Cheng, Lin Liu, Jixue Liu, Thuc Duy Le, Xiaojing Du, Xiongren Chen, Yanchang Zhao, Yun Chen", "id": "2408.12063v1", "paper_url": "http://arxiv.org/abs/2408.12063v1", "repo": "null"}}