{"2501.17555": {"publish_time": "2025-01-29", "title": "An Exceptional Dataset For Rare Pancreatic Tumor Segmentation", "paper_summary": "Pancreatic NEuroendocrine Tumors (pNETs) are very rare endocrine neoplasms\nthat account for less than 5% of all pancreatic malignancies, with an incidence\nof only 1-1.5 cases per 100,000. Early detection of pNETs is critical for\nimproving patient survival, but the rarity of pNETs makes segmenting them from\nCT a very challenging problem. So far, there has not been a dataset\nspecifically for pNETs available to researchers. To address this issue, we\npropose a pNETs dataset, a well-annotated Contrast-Enhanced Computed Tomography\n(CECT) dataset focused exclusively on Pancreatic Neuroendocrine Tumors,\ncontaining data from 469 patients. This is the first dataset solely dedicated\nto pNETs, distinguishing it from previous collections. Additionally, we provide\nthe baseline detection networks with a new slice-wise weight loss function\ndesigned for the UNet-based model, improving the overall pNET segmentation\nperformance. We hope that our dataset can enhance the understanding and\ndiagnosis of pNET Tumors within the medical community, facilitate the\ndevelopment of more accurate diagnostic tools, and ultimately improve patient\noutcomes and advance the field of oncology.", "paper_summary_zh": "胰臟神經內分泌腫瘤 (pNETs) 是非常罕見的內分泌腫瘤，僅佔所有胰臟惡性腫瘤的不到 5%，每 100,000 人中僅發生 1-1.5 個病例。早期發現 pNETs 對改善患者存活率至關重要，但 pNETs 的罕見性使得從 CT 中分割它們成為一個非常具有挑戰性的問題。到目前為止，還沒有專門針對 pNETs 的數據集可供研究人員使用。為了解決這個問題，我們提出了一個 pNETs 數據集，一個專注於胰臟神經內分泌腫瘤的標註良好的對比增強電腦斷層掃描 (CECT) 數據集，包含來自 469 名患者的數據。這是第一個專門針對 pNETs 的數據集，這使其有別於之前的收集。此外，我們為基線檢測網路提供了一個新的基於 UNet 模型設計的切片加權損失函數，改善了整體 pNET 分割性能。我們希望我們的數據集能夠增強醫學界對 pNET 腫瘤的理解和診斷，促進更準確的診斷工具的開發，最終改善患者的預後並推進腫瘤學領域。", "author": "Wenqi Li et.al.", "authors": "Wenqi Li, Yingli Chen, Keyang Zhou, Xiaoxiao Hu, Zilu Zheng, Yue Yan, Xinpeng Zhang, Wei Tang, Zhenxing Qian", "id": "2501.17555v1", "paper_url": "http://arxiv.org/abs/2501.17555v1", "repo": "null"}}