{"2412.07402": {"publish_time": "2024-12-10", "title": "Non-Progressive Influence Maximization in Dynamic Social Networks", "paper_summary": "The influence maximization (IM) problem involves identifying a set of key\nindividuals in a social network who can maximize the spread of influence\nthrough their network connections. With the advent of geometric deep learning\non graphs, great progress has been made towards better solutions for the IM\nproblem. In this paper, we focus on the dynamic non-progressive IM problem,\nwhich considers the dynamic nature of real-world social networks and the\nspecial case where the influence diffusion is non-progressive, i.e., nodes can\nbe activated multiple times. We first extend an existing diffusion model to\ncapture the non-progressive influence propagation in dynamic social networks.\nWe then propose the method, DNIMRL, which employs deep reinforcement learning\nand dynamic graph embedding to solve the dynamic non-progressive IM problem. In\nparticular, we propose a novel algorithm that effectively leverages graph\nembedding to capture the temporal changes of dynamic networks and seamlessly\nintegrates with deep reinforcement learning. The experiments, on different\ntypes of real-world social network datasets, demonstrate that our method\noutperforms state-of-the-art baselines.", "paper_summary_zh": "影響最大化 (IM) 問題涉及在社交網路中識別一組關鍵個人，他們可以透過網路連結最大化影響力的傳播。隨著幾何深度學習在圖形上的出現，針對 IM 問題的解決方案有了很大的進展。在本文中，我們專注於動態非遞進 IM 問題，它考慮了現實世界社交網路的動態特性，以及影響力擴散為非遞進的特例，即節點可以被多次啟動。我們首先擴充現有的擴散模型，以捕捉動態社交網路中的非遞進影響傳播。接著我們提出 DNIMRL 方法，它採用深度強化學習和動態圖形嵌入來解決動態非遞進 IM 問題。特別是，我們提出了一種新演算法，它有效地利用圖形嵌入來捕捉動態網路的時間變化，並與深度強化學習無縫整合。在不同類型的現實世界社交網路資料集上的實驗證明，我們的演算法優於最先進的基準。", "author": "Yunming Hui et.al.", "authors": "Yunming Hui, Shihan Wang, Melisachew Wudage Chekol, Stevan Rudinac, Inez Maria Zwetsloot", "id": "2412.07402v1", "paper_url": "http://arxiv.org/abs/2412.07402v1", "repo": "null"}}