{"2409.11274": {"publish_time": "2024-09-17", "title": "Task Arithmetic for Language Expansion in Speech Translation", "paper_summary": "Recent advances in large language models (LLMs) have gained interest in\nspeech-text multimodal foundation models, achieving strong performance on\ninstruction-based speech translation (ST). However, expanding language pairs\nfrom an existing instruction-tuned ST system is costly due to the necessity of\nre-training on a combination of new and previous datasets. We propose to expand\nnew language pairs by merging the model trained on new language pairs and the\nexisting model, using task arithmetic. We find that the direct application of\ntask arithmetic for ST causes the merged model to fail to follow instructions;\nthus, generating translation in incorrect languages. To eliminate language\nconfusion, we propose an augmented task arithmetic method that merges an\nadditional language control model. It is trained to generate the correct target\nlanguage token following the instructions. Our experiments demonstrate that our\nproposed language control model can achieve language expansion by eliminating\nlanguage confusion. In our MuST-C and CoVoST-2 experiments, it shows up to 4.66\nand 4.92 BLEU scores improvement, respectively. In addition, we demonstrate the\nuse of our task arithmetic framework can expand to a language pair where\nneither paired ST training data nor a pre-trained ST model is available. We\nfirst synthesize the ST system from machine translation (MT) systems via task\nanalogy, then merge the synthesized ST system to the existing ST model.", "paper_summary_zh": "最近，大型语言模型 (LLM) 的最新进展引起了人们对语音文本多模态基础模型的兴趣，在基于指令的语音翻译 (ST) 中取得了强劲的性能。然而，由于需要在新的和以前的数据集的组合上重新训练，因此从现有的指令调整的 ST 系统扩展语言对的成本很高。我们建议通过使用任务算术合并针对新语言对训练的模型和现有模型来扩展新语言对。我们发现，直接将任务算术应用于 ST 会导致合并后的模型无法遵循指令；因此，生成错误语言的翻译。为了消除语言混淆，我们提出了一种增强任务算术的方法，该方法合并了一个额外的语言控制模型。它经过训练，可以按照指令生成正确的目标语言标记。我们的实验表明，我们提出的语言控制模型可以通过消除语言混淆来实现语言扩展。在我们的 MuST-C 和 CoVoST-2 实验中，它分别显示出高达 4.66 和 4.92 的 BLEU 分数改进。此外，我们展示了我们的任务算术框架的使用可以扩展到既没有配对 ST 训练数据也没有预训练 ST 模型的语言对。我们首先通过任务类比从机器翻译 (MT) 系统中合成 ST 系统，然后将合成的 ST 系统合并到现有的 ST 模型中。", "author": "Yao-Fei Cheng et.al.", "authors": "Yao-Fei Cheng, Hayato Futami, Yosuke Kashiwagi, Emiru Tsunoo, Wen Shen Teo, Siddhant Arora, Shinji Watanabe", "id": "2409.11274v1", "paper_url": "http://arxiv.org/abs/2409.11274v1", "repo": "null"}}