{"2407.04047": {"publish_time": "2024-07-04", "title": "Improving Accented Speech Recognition using Data Augmentation based on Unsupervised Text-to-Speech Synthesis", "paper_summary": "This paper investigates the use of unsupervised text-to-speech synthesis\n(TTS) as a data augmentation method to improve accented speech recognition. TTS\nsystems are trained with a small amount of accented speech training data and\ntheir pseudo-labels rather than manual transcriptions, and hence unsupervised.\nThis approach enables the use of accented speech data without manual\ntranscriptions to perform data augmentation for accented speech recognition.\nSynthetic accented speech data, generated from text prompts by using the TTS\nsystems, are then combined with available non-accented speech data to train\nautomatic speech recognition (ASR) systems. ASR experiments are performed in a\nself-supervised learning framework using a Wav2vec2.0 model which was\npre-trained on large amount of unsupervised accented speech data. The accented\nspeech data for training the unsupervised TTS are read speech, selected from\nL2-ARCTIC and British Isles corpora, while spontaneous conversational speech\nfrom the Edinburgh international accents of English corpus are used as the\nevaluation data. Experimental results show that Wav2vec2.0 models which are\nfine-tuned to downstream ASR task with synthetic accented speech data,\ngenerated by the unsupervised TTS, yield up to 6.1% relative word error rate\nreductions compared to a Wav2vec2.0 baseline which is fine-tuned with the\nnon-accented speech data from Librispeech corpus.", "paper_summary_zh": "這篇論文探討了將非監督文字轉語音合成 (TTS) 用作資料擴充方法，以改善重音語音辨識。TTS 系統使用少量重音語音訓練資料和其偽標籤（而非手動轉錄）進行訓練，因此是非監督的。此方法能使用重音語音資料，而無需手動轉錄，就能為重音語音辨識執行資料擴充。由 TTS 系統使用文字提示產生的合成重音語音資料，會與現有的非重音語音資料結合，以訓練自動語音辨識 (ASR) 系統。ASR 實驗是在自監督學習架構中進行，使用 Wav2vec2.0 模型，該模型經過大量非監督重音語音資料預訓練。用於訓練非監督 TTS 的重音語音資料是朗讀語音，選自 L2-ARCTIC 和英國群島語料庫，而愛丁堡國際英語口音語料庫中的自發對話語音則用作評估資料。實驗結果顯示，針對下游 ASR 任務進行微調的 Wav2vec2.0 模型，使用非監督 TTS 生成的合成重音語音資料，與使用 Librispeech 語料庫中的非重音語音資料進行微調的 Wav2vec2.0 基準相比，相對字元錯誤率降低了 6.1%。", "author": "Cong-Thanh Do et.al.", "authors": "Cong-Thanh Do, Shuhei Imai, Rama Doddipatla, Thomas Hain", "id": "2407.04047v1", "paper_url": "http://arxiv.org/abs/2407.04047v1", "repo": "null"}}