{"2409.11272": {"publish_time": "2024-09-17", "title": "LOLA -- An Open-Source Massively Multilingual Large Language Model", "paper_summary": "This paper presents LOLA, a massively multilingual large language model\ntrained on more than 160 languages using a sparse Mixture-of-Experts\nTransformer architecture. Our architectural and implementation choices address\nthe challenge of harnessing linguistic diversity while maintaining efficiency\nand avoiding the common pitfalls of multilinguality. Our analysis of the\nevaluation results shows competitive performance in natural language generation\nand understanding tasks. Additionally, we demonstrate how the learned\nexpert-routing mechanism exploits implicit phylogenetic linguistic patterns to\npotentially alleviate the curse of multilinguality. We provide an in-depth look\nat the training process, an analysis of the datasets, and a balanced\nexploration of the model's strengths and limitations. As an open-source model,\nLOLA promotes reproducibility and serves as a robust foundation for future\nresearch. Our findings enable the development of compute-efficient multilingual\nmodels with strong, scalable performance across languages.", "paper_summary_zh": "本文介紹 LOLA，這是一個經過 160 多種語言訓練的大型多語言語言模型，採用稀疏混合專家 Transformer 架構。我們的架構和實作選擇應對了在維持效率且避免多語言的常見陷阱的同時，利用語言多樣性的挑戰。我們對評估結果的分析顯示，在自然語言生成和理解任務中具有競爭力。此外，我們展示了學習到的專家路由機制如何利用隱含的系統發生語言模式來潛在減輕多語言的詛咒。我們深入探討訓練過程、分析資料集，並平衡探討模型的優缺點。作為一個開源模型，LOLA 促進了可複製性，並作為未來研究的強大基礎。我們的發現使開發出跨語言具有強大、可擴充效能的運算效率多語言模型成為可能。", "author": "Nikit Srivastava et.al.", "authors": "Nikit Srivastava, Denis Kuchelev, Tatiana Moteu, Kshitij Shetty, Michael Roeder, Diego Moussallem, Hamada Zahera, Axel-Cyrille Ngonga Ngomo", "id": "2409.11272v1", "paper_url": "http://arxiv.org/abs/2409.11272v1", "repo": "null"}}