{"2411.12103": {"publish_time": "2024-11-18", "title": "Does Unlearning Truly Unlearn? A Black Box Evaluation of LLM Unlearning Methods", "paper_summary": "Large language model unlearning aims to remove harmful information that LLMs\nhave learnt to prevent their use for malicious purposes. LLMU and RMU have been\nproposed as two methods for LLM unlearning, achieving impressive results on\nunlearning benchmarks. We study in detail the efficacy of these methods by\nevaluating their impact on general model capabilities on the WMDP benchmark as\nwell as a biology benchmark we create. Our experiments show that RMU generally\nleads to better preservation of model capabilities, for similar or better\nunlearning. We further test the robustness of these methods and find that doing\n5-shot prompting or rephrasing the question in simple ways can lead to an over\nten-fold increase in accuracy on unlearning benchmarks. Finally, we show that\ntraining on unrelated data can almost completely recover pre-unlearning\nperformance, demonstrating that these methods fail at truly unlearning. The\ncode is available at\n$\\href{https://github.com/JaiDoshi/Knowledge-Erasure}{this\\, https\\, URL}$.", "paper_summary_zh": "大型语言模型的遗忘旨在消除 LLM 学到的有害信息，以防止其被恶意使用。LLMU 和 RMU 已被提出作为 LLM 遗忘的两种方法，在遗忘基准上取得了令人印象深刻的结果。我们通过评估这些方法对 WMDP 基准和我们创建的生物基准上的一般模型能力的影响，详细研究了这些方法的功效。我们的实验表明，对于类似或更好的遗忘，RMU 通常会导致模型能力得到更好的保留。我们进一步测试了这些方法的鲁棒性，发现进行 5 次提示或以简单的方式重新表述问题会导致遗忘基准的准确性提高十倍以上。最后，我们表明在不相关的训练数据上训练几乎可以完全恢复遗忘前的性能，这表明这些方法未能真正实现遗忘。代码可在此处获得：\n$\\href{https://github.com/JaiDoshi/Knowledge-Erasure}{此\\, https\\, URL}$。", "author": "Jai Doshi et.al.", "authors": "Jai Doshi, Asa Cooper Stickland", "id": "2411.12103v1", "paper_url": "http://arxiv.org/abs/2411.12103v1", "repo": "https://github.com/jaidoshi/knowledge-erasure"}}