{"2410.00163": {"publish_time": "2024-09-30", "title": "Adapting LLMs for the Medical Domain in Portuguese: A Study on Fine-Tuning and Model Evaluation", "paper_summary": "This study evaluates the performance of large language models (LLMs) as\nmedical agents in Portuguese, aiming to develop a reliable and relevant virtual\nassistant for healthcare professionals. The HealthCareMagic-100k-en and MedQuAD\ndatasets, translated from English using GPT-3.5, were used to fine-tune the\nChatBode-7B model using the PEFT-QLoRA method. The InternLM2 model, with\ninitial training on medical data, presented the best overall performance, with\nhigh precision and adequacy in metrics such as accuracy, completeness and\nsafety. However, DrBode models, derived from ChatBode, exhibited a phenomenon\nof catastrophic forgetting of acquired medical knowledge. Despite this, these\nmodels performed frequently or even better in aspects such as grammaticality\nand coherence. A significant challenge was low inter-rater agreement,\nhighlighting the need for more robust assessment protocols. This work paves the\nway for future research, such as evaluating multilingual models specific to the\nmedical field, improving the quality of training data, and developing more\nconsistent evaluation methodologies for the medical field.", "paper_summary_zh": "本研究評估大型語言模型 (LLM) 在葡萄牙語中作為醫療代理的表現，旨在為醫療專業人員開發一個可靠且相關的虛擬助理。HealthCareMagic-100k-en 和 MedQuAD 資料集，使用 GPT-3.5 從英語翻譯，用於使用 PEFT-QLoRA 方法微調 ChatBode-7B 模型。InternLM2 模型，在醫療資料上進行初始訓練，表現出最好的整體表現，在準確性、完整性和安全性等指標上具有很高的精度和充分性。然而，源自 ChatBode 的 DrBode 模型表現出對獲得的醫療知識災難性遺忘的現象。儘管如此，這些模型在語法性和連貫性等方面表現得很好甚至更好。一個重大的挑戰是評分者之間的協議低，這凸顯了對更強大的評估協議的需求。這項工作為未來的研究鋪平了道路，例如評估特定於醫療領域的多語言模型、提高訓練資料的品質，以及為醫療領域開發更一致的評估方法。", "author": "Pedro Henrique Paiola et.al.", "authors": "Pedro Henrique Paiola, Gabriel Lino Garcia, João Renato Ribeiro Manesco, Mateus Roder, Douglas Rodrigues, João Paulo Papa", "id": "2410.00163v1", "paper_url": "http://arxiv.org/abs/2410.00163v1", "repo": "null"}}