{"2410.15978": {"publish_time": "2024-10-21", "title": "PROMPTHEUS: A Human-Centered Pipeline to Streamline SLRs with LLMs", "paper_summary": "The growing volume of academic publications poses significant challenges for\nresearchers conducting timely and accurate Systematic Literature Reviews,\nparticularly in fast-evolving fields like artificial intelligence. This growth\nof academic literature also makes it increasingly difficult for lay people to\naccess scientific knowledge effectively, meaning academic literature is often\nmisrepresented in the popular press and, more broadly, in society. Traditional\nSLR methods are labor-intensive and error-prone, and they struggle to keep up\nwith the rapid pace of new research. To address these issues, we developed\n\\textit{PROMPTHEUS}: an AI-driven pipeline solution that automates the SLR\nprocess using Large Language Models. We aimed to enhance efficiency by reducing\nthe manual workload while maintaining the precision and coherence required for\ncomprehensive literature synthesis. PROMPTHEUS automates key stages of the SLR\nprocess, including systematic search, data extraction, topic modeling using\nBERTopic, and summarization with transformer models. Evaluations conducted\nacross five research domains demonstrate that PROMPTHEUS reduces review time,\nachieves high precision, and provides coherent topic organization, offering a\nscalable and effective solution for conducting literature reviews in an\nincreasingly crowded research landscape. In addition, such tools may reduce the\nincreasing mistrust in science by making summarization more accessible to\nlaypeople.\n  The code for this project can be found on the GitHub repository at\nhttps://github.com/joaopftorres/PROMPTHEUS.git", "paper_summary_zh": "<paragraph>學術出版品的數量持續增加，對於進行及時且準確的系統性文獻回顧的研究人員來說，這構成了重大的挑戰，特別是在像人工智慧等快速發展的領域中。學術文獻的增長也使得一般人越來越難以有效地獲取科學知識，這意味著學術文獻經常在通俗媒體中被錯誤呈現，更廣泛地說，在社會中也是如此。傳統的系統性文獻回顧方法既費力又容易出錯，而且難以跟上新研究的快速步伐。為了解決這些問題，我們開發了PROMPTHEUS：一種由大型語言模型自動化系統性文獻回顧流程的 AI 驅動管道解決方案。我們的目標是通過減少手動工作量來提高效率，同時保持綜合文獻合成所需的精確性和一致性。PROMPTHEUS 自動化了系統性文獻回顧流程的主要階段，包括系統性搜尋、資料萃取、使用 BERTopic 的主題建模，以及使用轉換器模型進行摘要。在五個研究領域進行的評估表明，PROMPTHEUS 縮短了回顧時間，達到了高精度，並提供了連貫的主題組織，為在日益擁擠的研究領域中進行文獻回顧提供了一個可擴充且有效的解決方案。此外，此類工具可以讓一般人更容易取得摘要，從而減少對科學的不信任。這個專案的程式碼可以在 GitHub 儲存庫中找到，網址為 https://github.com/joaopftorres/PROMPTHEUS.git</paragraph>", "author": "João Pedro Fernandes Torres et.al.", "authors": "João Pedro Fernandes Torres, Catherine Mulligan, Joaquim Jorge, Catarina Moreira", "id": "2410.15978v2", "paper_url": "http://arxiv.org/abs/2410.15978v2", "repo": "https://github.com/joaopftorres/promptheus"}}