{"2411.04872": {"publish_time": "2024-11-07", "title": "FrontierMath: A Benchmark for Evaluating Advanced Mathematical Reasoning in AI", "paper_summary": "We introduce FrontierMath, a benchmark of hundreds of original, exceptionally\nchallenging mathematics problems crafted and vetted by expert mathematicians.\nThe questions cover most major branches of modern mathematics -- from\ncomputationally intensive problems in number theory and real analysis to\nabstract questions in algebraic geometry and category theory. Solving a typical\nproblem requires multiple hours of effort from a researcher in the relevant\nbranch of mathematics, and for the upper end questions, multiple days.\nFrontierMath uses new, unpublished problems and automated verification to\nreliably evaluate models while minimizing risk of data contamination. Current\nstate-of-the-art AI models solve under 2% of problems, revealing a vast gap\nbetween AI capabilities and the prowess of the mathematical community. As AI\nsystems advance toward expert-level mathematical abilities, FrontierMath offers\na rigorous testbed that quantifies their progress.", "paper_summary_zh": "我們推出 FrontierMath，這是數百個由專家數學家精心製作和審查的原創、極具挑戰性的數學問題的基準。這些問題涵蓋了現代數學的大多數主要分支——從數論和實分析中的計算密集型問題到代數幾何和範疇論中的抽象問題。解決一個典型問題需要相關數學分支的研究人員花費數小時的精力，而對於較難的問題，則需要數天時間。FrontierMath 使用新的、未發表的題目和自動化驗證來可靠地評估模型，同時最大限度地降低數據污染的風險。當前的最先進 AI 模型只能解決不到 2% 的問題，這揭示了 AI 能力與數學界的實力之間存在巨大差距。隨著 AI 系統向專家級數學能力邁進，FrontierMath 提供了一個嚴格的測試平台，可以量化它們的進度。", "author": "Elliot Glazer et.al.", "authors": "Elliot Glazer, Ege Erdil, Tamay Besiroglu, Diego Chicharro, Evan Chen, Alex Gunning, Caroline Falkman Olsson, Jean-Stanislas Denain, Anson Ho, Emily de Oliveira Santos, Olli Järviniemi, Matthew Barnett, Robert Sandler, Jaime Sevilla, Qiuyu Ren, Elizabeth Pratt, Lionel Levine, Grant Barkley, Natalie Stewart, Bogdan Grechuk, Tetiana Grechuk, Shreepranav Varma Enugandla", "id": "2411.04872v1", "paper_url": "http://arxiv.org/abs/2411.04872v1", "repo": "null"}}