{"2411.16131": {"publish_time": "2024-11-25", "title": "End-to-End Steering for Autonomous Vehicles via Conditional Imitation Co-Learning", "paper_summary": "Autonomous driving involves complex tasks such as data fusion, object and\nlane detection, behavior prediction, and path planning. As opposed to the\nmodular approach which dedicates individual subsystems to tackle each of those\ntasks, the end-to-end approach treats the problem as a single learnable task\nusing deep neural networks, reducing system complexity and minimizing\ndependency on heuristics. Conditional imitation learning (CIL) trains the\nend-to-end model to mimic a human expert considering the navigational commands\nguiding the vehicle to reach its destination, CIL adopts specialist network\nbranches dedicated to learn the driving task for each navigational command.\nNevertheless, the CIL model lacked generalization when deployed to unseen\nenvironments. This work introduces the conditional imitation co-learning (CIC)\napproach to address this issue by enabling the model to learn the relationships\nbetween CIL specialist branches via a co-learning matrix generated by gated\nhyperbolic tangent units (GTUs). Additionally, we propose posing the steering\nregression problem as classification, we use a classification-regression hybrid\nloss to bridge the gap between regression and classification, we also propose\nusing co-existence probability to consider the spatial tendency between the\nsteering classes. Our model is demonstrated to improve autonomous driving\nsuccess rate in unseen environment by 62% on average compared to the CIL\nmethod.", "paper_summary_zh": "自動駕駛涉及複雜的任務，例如資料融合、物體和車道偵測、行為預測和路徑規劃。與將個別子系統專用於處理每個任務的模組化方法相反，端到端方法將問題視為使用深度神經網路的單一可學習任務，降低系統複雜性並最小化對啟發法的依賴。條件模仿學習 (CIL) 訓練端到端模型，以模擬人類專家考慮導航命令，引導車輛到達目的地，CIL 採用專門網路分支，專門學習每個導航命令的駕駛任務。儘管如此，CIL 模型在部署到未見環境時缺乏泛化性。這項工作引入了條件模仿協同學習 (CIC) 方法，透過啟用模型透過門控雙曲正切單元 (GTU) 生成的協同學習矩陣，學習 CIL 專家分支之間的關係來解決這個問題。此外，我們建議將轉向迴歸問題視為分類，我們使用分類迴歸混合損失來彌合迴歸和分類之間的差距，我們還建議使用共存機率來考慮轉向類別之間的空間趨勢。我們的模型被證明可以將在未見環境中的自動駕駛成功率平均提高 62%，與 CIL 方法相比。", "author": "Mahmoud M. Kishky et.al.", "authors": "Mahmoud M. Kishky, Hesham M. Eraqi, Khaled F. Elsayed", "id": "2411.16131v1", "paper_url": "http://arxiv.org/abs/2411.16131v1", "repo": "null"}}