{"2412.13103": {"publish_time": "2024-12-17", "title": "AI PERSONA: Towards Life-long Personalization of LLMs", "paper_summary": "In this work, we introduce the task of life-long personalization of large\nlanguage models. While recent mainstream efforts in the LLM community mainly\nfocus on scaling data and compute for improved capabilities of LLMs, we argue\nthat it is also very important to enable LLM systems, or language agents, to\ncontinuously adapt to the diverse and ever-changing profiles of every distinct\nuser and provide up-to-date personalized assistance. We provide a clear task\nformulation and introduce a simple, general, effective, and scalable framework\nfor life-long personalization of LLM systems and language agents. To facilitate\nfuture research on LLM personalization, we also introduce methods to synthesize\nrealistic benchmarks and robust evaluation metrics. We will release all codes\nand data for building and benchmarking life-long personalized LLM systems.", "paper_summary_zh": "在這項工作中，我們引入了大型語言模型終身個人化的任務。雖然 LLM 社群中近期的主流努力主要集中在擴展資料和運算以提升 LLM 的能力，我們主張讓 LLM 系統或語言代理持續適應每位不同使用者的多元且不斷變化的個人資料，並提供最新的個人化協助，這也十分重要。我們提供了明確的任務表述，並為 LLM 系統和語言代理的終身個人化引入了簡單、通用、有效且可擴充的架構。為了促進未來對 LLM 個人化的研究，我們也引入了合成實際基準和穩健評估指標的方法。我們將釋出所有用於建構和基準化終身個人化 LLM 系統的程式碼和資料。", "author": "Tiannan Wang et.al.", "authors": "Tiannan Wang, Meiling Tao, Ruoyu Fang, Huilin Wang, Shuai Wang, Yuchen Eleanor Jiang, Wangchunshu Zhou", "id": "2412.13103v1", "paper_url": "http://arxiv.org/abs/2412.13103v1", "repo": "null"}}