{"2405.07349": {"publish_time": "2024-05-12", "title": "WeedScout: Real-Time Autonomous blackgrass Classification and Mapping using dedicated hardware", "paper_summary": "Blackgrass (Alopecurus myosuroides) is a competitive weed that has\nwide-ranging impacts on food security by reducing crop yields and increasing\ncultivation costs. In addition to the financial burden on agriculture, the\napplication of herbicides as a preventive to blackgrass can negatively affect\naccess to clean water and sanitation. The WeedScout project introduces a\nReal-Rime Autonomous Black-Grass Classification and Mapping (RT-ABGCM), a\ncutting-edge solution tailored for real-time detection of blackgrass, for\nprecision weed management practices. Leveraging Artificial Intelligence (AI)\nalgorithms, the system processes live image feeds, infers blackgrass density,\nand covers two stages of maturation. The research investigates the deployment\nof You Only Look Once (YOLO) models, specifically the streamlined YOLOv8 and\nYOLO-NAS, accelerated at the edge with the NVIDIA Jetson Nano (NJN). By\noptimising inference speed and model performance, the project advances the\nintegration of AI into agricultural practices, offering potential solutions to\nchallenges such as herbicide resistance and environmental impact. Additionally,\ntwo datasets and model weights are made available to the research community,\nfacilitating further advancements in weed detection and precision farming\ntechnologies.", "paper_summary_zh": "黑草（Alopecurus myosuroides）是一種競爭力強的雜草，會透過降低作物產量和增加耕作成本對糧食安全造成廣泛影響。除了對農業造成財務負擔外，使用除草劑預防黑草也會對乾淨水和衛生造成負面影響。WeedScout 計畫引進即時自主黑草分類和繪製（RT-ABGCM），這是一個專為即時偵測黑草而量身打造的尖端解決方案，用於精準的雜草管理實務。系統利用人工智慧（AI）演算法處理即時影像串流，推論黑草密度，並涵蓋兩個成熟階段。這項研究探討僅看一次（YOLO）模型的部署，特別是精簡的 YOLOv8 和 YOLO-NAS，並在邊緣使用 NVIDIA Jetson Nano（NJN）加速。透過最佳化推論速度和模型效能，此計畫推動 AI 整合到農業實務中，提供對抗除草劑抗性和環境影響等挑戰的潛在解決方案。此外，兩個資料集和模型權重可供研究社群使用，促進雜草偵測和精準農業技術的進一步發展。", "author": "Matthew Gazzard et.al.", "authors": "Matthew Gazzard, Helen Hicks, Isibor Kennedy Ihianle, Jordan J. Bird, Md Mahmudul Hasan, Pedro Machado", "id": "2405.07349v1", "paper_url": "http://arxiv.org/abs/2405.07349v1", "repo": "null"}}