{"2409.04109": {"publish_time": "2024-09-06", "title": "Can LLMs Generate Novel Research Ideas? A Large-Scale Human Study with 100+ NLP Researchers", "paper_summary": "Recent advancements in large language models (LLMs) have sparked optimism\nabout their potential to accelerate scientific discovery, with a growing number\nof works proposing research agents that autonomously generate and validate new\nideas. Despite this, no evaluations have shown that LLM systems can take the\nvery first step of producing novel, expert-level ideas, let alone perform the\nentire research process. We address this by establishing an experimental design\nthat evaluates research idea generation while controlling for confounders and\nperforms the first head-to-head comparison between expert NLP researchers and\nan LLM ideation agent. By recruiting over 100 NLP researchers to write novel\nideas and blind reviews of both LLM and human ideas, we obtain the first\nstatistically significant conclusion on current LLM capabilities for research\nideation: we find LLM-generated ideas are judged as more novel (p < 0.05) than\nhuman expert ideas while being judged slightly weaker on feasibility. Studying\nour agent baselines closely, we identify open problems in building and\nevaluating research agents, including failures of LLM self-evaluation and their\nlack of diversity in generation. Finally, we acknowledge that human judgements\nof novelty can be difficult, even by experts, and propose an end-to-end study\ndesign which recruits researchers to execute these ideas into full projects,\nenabling us to study whether these novelty and feasibility judgements result in\nmeaningful differences in research outcome.", "paper_summary_zh": "大型語言模型 (LLM) 的近期進展點燃了人們對其加速科學發現潛力的樂觀情緒，越來越多的作品提出了自動生成和驗證新思想的研究代理。儘管如此，沒有任何評估表明 LLM 系統可以邁出產生新穎的專家級別思想的第一步，更不用說執行整個研究過程了。我們通過建立一個實驗設計來解決這個問題，該設計評估研究思想的產生，同時控制混雜因素，並對專家 NLP 研究人員和 LLM 構思代理進行首次正面比較。通過招募超過 100 名 NLP 研究人員撰寫新穎的思想並對 LLM 和人類思想進行盲審，我們得出了關於當前 LLM 研究構思能力的第一個具有統計意義的結論：我們發現 LLM 生成的思想被評為比人類專家思想更新穎 (p < 0.05)，同時在可行性上被評為稍弱。通過仔細研究我們的代理基準，我們發現了構建和評估研究代理的開放性問題，包括 LLM 自我評估的失敗及其生成缺乏多樣性。最後，我們承認即使是專家也很難對新穎性做出判斷，並提出了一個端到端的研究所設計，該設計招募研究人員將這些思想執行為完整的項目，使我們能夠研究這些新穎性和可行性判斷是否會導致研究結果的顯著差異。", "author": "Chenglei Si et.al.", "authors": "Chenglei Si, Diyi Yang, Tatsunori Hashimoto", "id": "2409.04109v1", "paper_url": "http://arxiv.org/abs/2409.04109v1", "repo": "null"}}