{"2408.11778": {"publish_time": "2024-08-21", "title": "Sum of Squares Circuits", "paper_summary": "Designing expressive generative models that support exact and efficient\ninference is a core question in probabilistic ML. Probabilistic circuits (PCs)\noffer a framework where this tractability-vs-expressiveness trade-off can be\nanalyzed theoretically. Recently, squared PCs encoding subtractive mixtures via\nnegative parameters have emerged as tractable models that can be exponentially\nmore expressive than monotonic PCs, i.e., PCs with positive parameters only. In\nthis paper, we provide a more precise theoretical characterization of the\nexpressiveness relationships among these models. First, we prove that squared\nPCs can be less expressive than monotonic ones. Second, we formalize a novel\nclass of PCs -- sum of squares PCs -- that can be exponentially more expressive\nthan both squared and monotonic PCs. Around sum of squares PCs, we build an\nexpressiveness hierarchy that allows us to precisely unify and separate\ndifferent tractable model classes such as Born Machines and PSD models, and\nother recently introduced tractable probabilistic models by using complex\nparameters. Finally, we empirically show the effectiveness of sum of squares\ncircuits in performing distribution estimation.", "paper_summary_zh": "<paragraph>設計支援精確且有效率推論的表達式生成模型是機率式 ML 中的核心問題。機率電路 (PC) 提供一個架構，可以在其中從理論上分析這種可追蹤性與表達性之間的取捨。最近，透過負參數編碼減法混合的平方 PC 已成為可追蹤的模型，其表達性可能比單調 PC（即只有正參數的 PC）高出數倍。在本文中，我們提供這些模型之間表達性關係更精確的理論表徵。首先，我們證明平方 PC 的表達性可能低於單調 PC。其次，我們形式化一個新的 PC 類別——平方和 PC——其表達性可能比平方 PC 和單調 PC 都高出數倍。在平方和 PC 的周圍，我們建立一個表達性階層，使我們能夠精確地統一和區分不同的可追蹤模型類別，例如 Born 機器和 PSD 模型，以及其他最近引入的、使用複雜參數的可追蹤機率模型。最後，我們透過實證顯示平方和電路在執行分配估計方面的有效性。</paragraph>", "author": "Lorenzo Loconte et.al.", "authors": "Lorenzo Loconte, Stefan Mengel, Antonio Vergari", "id": "2408.11778v1", "paper_url": "http://arxiv.org/abs/2408.11778v1", "repo": "null"}}