{"2405.07295": {"publish_time": "2024-05-12", "title": "Environmental enrichment: a biological model of forward transfer in continual learning", "paper_summary": "Continual learning (CL) refers to an agent's capability to learn from a\ncontinuous stream of data and transfer knowledge without forgetting old\ninformation. One crucial aspect of CL is forward transfer, i.e., improved and\nfaster learning on a new task by leveraging information from prior knowledge.\nWhile this ability comes naturally to biological brains, it poses a significant\nchallenge for artificial intelligence (AI). Here, we suggest that environmental\nenrichment (EE) can be used as a biological model for studying forward\ntransfer, inspiring human-like AI development. EE refers to animal studies that\nenhance cognitive, social, motor, and sensory stimulation and is a model for\nwhat, in humans, is referred to as 'cognitive reserve'. Enriched animals show\nsignificant improvement in learning speed and performance on new tasks,\ntypically exhibiting forward transfer. We explore anatomical, molecular, and\nneuronal changes post-EE and discuss how artificial neural networks (ANNs) can\nbe used to predict neural computation changes after enriched experiences.\nFinally, we provide a synergistic way of combining neuroscience and AI research\nthat paves the path toward developing AI capable of rapid and efficient new\ntask learning.", "paper_summary_zh": "持續學習（CL）指的是代理人從資料連續串流中學習並傳遞知識而不遺忘舊資訊的能力。CL 的一個關鍵面向是正向傳遞，亦即透過運用先前知識中的資訊，在新的任務中提升且加速學習。雖然這種能力對生物大腦來說是天生的，但對人工智慧（AI）來說卻是一項重大的挑戰。在此，我們建議環境豐富化（EE）可用作研究正向傳遞的生物模型，激發類人 AI 的發展。EE 指的是增強動物認知、社交、運動和感官刺激的動物研究，是人類所謂「認知儲備」的模型。經過豐富化的動物在學習速度和新任務的表現上都有顯著的進步，通常展現出正向傳遞。我們探討 EE 後的解剖、分子和神經元變化，並討論如何使用人工神經網路（ANN）來預測豐富化體驗後的類神經運算變化。最後，我們提供一種結合神經科學和 AI 研究的綜效方式，為開發具備快速且有效率的新任務學習能力的 AI 鋪路。", "author": "Rajat Saxena et.al.", "authors": "Rajat Saxena, Bruce L. McNaughton", "id": "2405.07295v1", "paper_url": "http://arxiv.org/abs/2405.07295v1", "repo": "null"}}