{"2406.18851": {"publish_time": "2024-06-27", "title": "LICO: Large Language Models for In-Context Molecular Optimization", "paper_summary": "Optimizing black-box functions is a fundamental problem in science and\nengineering. To solve this problem, many approaches learn a surrogate function\nthat estimates the underlying objective from limited historical evaluations.\nLarge Language Models (LLMs), with their strong pattern-matching capabilities\nvia pretraining on vast amounts of data, stand out as a potential candidate for\nsurrogate modeling. However, directly prompting a pretrained language model to\nproduce predictions is not feasible in many scientific domains due to the\nscarcity of domain-specific data in the pretraining corpora and the challenges\nof articulating complex problems in natural language. In this work, we\nintroduce LICO, a general-purpose model that extends arbitrary base LLMs for\nblack-box optimization, with a particular application to the molecular domain.\nTo achieve this, we equip the language model with a separate embedding layer\nand prediction layer, and train the model to perform in-context predictions on\na diverse set of functions defined over the domain. Once trained, LICO can\ngeneralize to unseen molecule properties simply via in-context prompting. LICO\nachieves state-of-the-art performance on PMO, a challenging molecular\noptimization benchmark comprising over 20 objective functions.", "paper_summary_zh": "優化黑箱函數是科學和工程中的基本問題。為了解決這個問題，許多方法會學習代理函數，從有限的歷史評估中估計底層目標。大型語言模型 (LLM) 透過在大量資料上進行預訓練，具備強大的模式匹配能力，成為代理建模的潛在候選者。然而，由於預訓練語料庫中缺乏特定領域的資料，以及用自然語言表達複雜問題的挑戰，直接提示預訓練的語言模型產生預測在許多科學領域中不可行。在這項工作中，我們引入了 LICO，這是一個通用模型，它擴充了任意基礎 LLM 以進行黑箱優化，特別應用於分子領域。為此，我們為語言模型配備了一個單獨的嵌入層和預測層，並訓練模型對定義在該領域上的各種函數執行情境預測。訓練後，LICO 可以透過情境提示對未見的分子屬性進行概化。LICO 在 PMO 上取得了最先進的效能，PMO 是包含超過 20 個目標函數的具有挑戰性的分子最佳化基準。", "author": "Tung Nguyen et.al.", "authors": "Tung Nguyen, Aditya Grover", "id": "2406.18851v1", "paper_url": "http://arxiv.org/abs/2406.18851v1", "repo": "null"}}