{"2410.18415": {"publish_time": "2024-10-24", "title": "Decoding on Graphs: Faithful and Sound Reasoning on Knowledge Graphs through Generation of Well-Formed Chains", "paper_summary": "Knowledge Graphs (KGs) can serve as reliable knowledge sources for question\nanswering (QA) due to their structured representation of knowledge. Existing\nresearch on the utilization of KG for large language models (LLMs) prevalently\nrelies on subgraph retriever or iterative prompting, overlooking the potential\nsynergy of LLMs' step-wise reasoning capabilities and KGs' structural nature.\nIn this paper, we present DoG (Decoding on Graphs), a novel framework that\nfacilitates a deep synergy between LLMs and KGs. We first define a concept,\nwell-formed chain, which consists of a sequence of interrelated fact triplets\non the KGs, starting from question entities and leading to answers. We argue\nthat this concept can serve as a principle for making faithful and sound\nreasoning for KGQA. To enable LLMs to generate well-formed chains, we propose\ngraph-aware constrained decoding, in which a constraint derived from the\ntopology of the KG regulates the decoding process of the LLMs. This constrained\ndecoding method ensures the generation of well-formed chains while making full\nuse of the step-wise reasoning capabilities of LLMs. Based on the above, DoG, a\ntraining-free approach, is able to provide faithful and sound reasoning\ntrajectories grounded on the KGs. Experiments across various KGQA tasks with\ndifferent background KGs demonstrate that DoG achieves superior and robust\nperformance. DoG also shows general applicability with various open-source\nLLMs.", "paper_summary_zh": "知識圖譜 (KG) 由於其結構化的知識表示，可用作問答 (QA) 的可靠知識來源。現有關於利用 KG 的大型語言模型 (LLM) 的研究普遍依賴於子圖檢索器或反覆提示，忽視了 LLM 的逐步推理能力和 KG 的結構特性的潛在協同作用。在本文中，我們提出了 DoG（圖形解碼），一個促進 LLM 和 KG 之間深度協同作用的新框架。我們首先定義了一個概念，即良好形成的鏈，它由 KG 上一系列相互關聯的事實三元組組成，從問題實體開始並導致答案。我們認為這個概念可以作為對 KGQA 進行忠實和合理的推理的原則。為了使 LLM 能夠生成良好的鏈，我們提出了圖感知約束解碼，其中源自 KG 拓撲的約束約束了 LLM 的解碼過程。這種受約束的解碼方法確保了良好形成的鏈的生成，同時充分利用了 LLM 的逐步推理能力。基於上述，DoG 是一種無需訓練的方法，能夠提供基於 KG 的忠實且合理的推理軌跡。在具有不同背景 KG 的各種 KGQA 任務中的實驗表明，DoG 達到了卓越且穩健的性能。DoG 還顯示了與各種開源 LLM 的通用適用性。", "author": "Kun Li et.al.", "authors": "Kun Li, Tianhua Zhang, Xixin Wu, Hongyin Luo, James Glass, Helen Meng", "id": "2410.18415v1", "paper_url": "http://arxiv.org/abs/2410.18415v1", "repo": "null"}}