{"2408.04403": {"publish_time": "2024-08-08", "title": "Exploring Reasoning Biases in Large Language Models Through Syllogism: Insights from the NeuBAROCO Dataset", "paper_summary": "This paper explores the question of how accurately current large language\nmodels can perform logical reasoning in natural language, with an emphasis on\nwhether these models exhibit reasoning biases similar to humans. Specifically,\nour study focuses on syllogistic reasoning, a form of deductive reasoning\nextensively studied in cognitive science as a natural form of human reasoning.\nWe present a syllogism dataset called NeuBAROCO, which consists of syllogistic\nreasoning problems in English and Japanese. This dataset was originally\ndesigned for psychological experiments to assess human reasoning capabilities\nusing various forms of syllogisms. Our experiments with leading large language\nmodels indicate that these models exhibit reasoning biases similar to humans,\nalong with other error tendencies. Notably, there is significant room for\nimprovement in reasoning problems where the relationship between premises and\nhypotheses is neither entailment nor contradiction. We also present\nexperimental results and in-depth analysis using a new Chain-of-Thought\nprompting method, which asks LLMs to translate syllogisms into abstract logical\nexpressions and then explain their reasoning process. Our analysis using this\nmethod suggests that the primary limitations of LLMs lie in the reasoning\nprocess itself rather than the interpretation of syllogisms.", "paper_summary_zh": "這篇論文探討了目前大型語言模型在自然語言中執行邏輯推理的準確性，重點在於這些模型是否表現出與人類類似的推理偏差。具體來說，我們的研究重點在於三段論推理，這是一種演繹推理形式，在認知科學中被廣泛研究為人類推理的自然形式。我們提出了一個名為 NeuBAROCO 的三段論數據集，其中包含英語和日語的三段論推理問題。此數據集最初是為心理實驗設計的，用於使用各種形式的三段論評估人類推理能力。我們與領先的大型語言模型進行的實驗表明，這些模型表現出與人類類似的推理偏差，以及其他錯誤傾向。值得注意的是，在前提和假設之間的關係既不是蘊涵也不是矛盾的推理問題中，有很大的改進空間。我們還使用新的思想鏈提示方法提供了實驗結果和深入分析，該方法要求 LLM 將三段論翻譯成抽象邏輯表達式，然後解釋他們的推理過程。我們使用此方法進行的分析表明，LLM 的主要限制在於推理過程本身，而不是對三段論的解釋。", "author": "Kentaro Ozeki et.al.", "authors": "Kentaro Ozeki, Risako Ando, Takanobu Morishita, Hirohiko Abe, Koji Mineshima, Mitsuhiro Okada", "id": "2408.04403v1", "paper_url": "http://arxiv.org/abs/2408.04403v1", "repo": "https://github.com/kmineshima/neubaroco"}}