{"2407.19807": {"publish_time": "2024-07-29", "title": "Cool-Fusion: Fuse Large Language Models without Training", "paper_summary": "We focus on the problem of fusing two or more heterogeneous large language\nmodels (LLMs) to facilitate their complementary strengths. One of the\nchallenges on model fusion is high computational load, i.e. to fine-tune or to\nalign vocabularies via combinatorial optimization. To this end, we propose\n\\emph{Cool-Fusion}, a simple yet effective approach that fuses the knowledge of\nheterogeneous source LLMs to leverage their complementary strengths.\n\\emph{Cool-Fusion} is the first method that does not require any type of\ntraining like the ensemble approaches. But unlike ensemble methods, it is\napplicable to any set of source LLMs that have different vocabularies. The\nbasic idea is to have each source LLM individually generate tokens until the\ntokens can be decoded into a text segment that ends at word boundaries common\nto all source LLMs. Then, the source LLMs jointly rerank the generated text\nsegment and select the best one, which is the fused text generation in one\nstep. Extensive experiments are conducted across a variety of benchmark\ndatasets. On \\emph{GSM8K}, \\emph{Cool-Fusion} increases accuracy from three\nstrong source LLMs by a significant 8\\%-17.8\\%.", "paper_summary_zh": "<paragraph>我们专注于融合两个或多个异构大语言模型 (LLM)，以促进其互补优势。模型融合面临的挑战之一是高计算负载，即通过组合优化微调或对齐词汇表。为此，我们提出了“Cool-Fusion”，这是一种简单但有效的方法，它融合了异构源 LLM 的知识，以利用其互补优势。“Cool-Fusion”是第一种不需要任何类型训练（如集成方法）的方法。但与集成方法不同，它适用于任何具有不同词汇表的源 LLM 集合。基本思想是让每个源 LLM 单独生成标记，直到标记可以解码成文本段落，该段落以所有源 LLM 共有的单词边界结束。然后，源 LLM 联合重新对生成的文本段落进行排名，并选择最佳文本段落，这是单步融合文本生成。在各种基准数据集上进行了广泛的实验。在“GSM8K”上，“Cool-Fusion”将三个强大的源 LLM 的准确性提高了显著的 8%-17.8%。</paragraph>", "author": "Cong Liu et.al.", "authors": "Cong Liu, Xiaojun Quan, Yan Pan, Liang Lin, Weigang Wu, Xu Chen", "id": "2407.19807v1", "paper_url": "http://arxiv.org/abs/2407.19807v1", "repo": "null"}}