{"2407.06460": {"publish_time": "2024-07-08", "title": "MUSE: Machine Unlearning Six-Way Evaluation for Language Models", "paper_summary": "Language models (LMs) are trained on vast amounts of text data, which may\ninclude private and copyrighted content. Data owners may request the removal of\ntheir data from a trained model due to privacy or copyright concerns. However,\nexactly unlearning only these datapoints (i.e., retraining with the data\nremoved) is intractable in modern-day models. This has led to the development\nof many approximate unlearning algorithms. The evaluation of the efficacy of\nthese algorithms has traditionally been narrow in scope, failing to precisely\nquantify the success and practicality of the algorithm from the perspectives of\nboth the model deployers and the data owners. We address this issue by\nproposing MUSE, a comprehensive machine unlearning evaluation benchmark that\nenumerates six diverse desirable properties for unlearned models: (1) no\nverbatim memorization, (2) no knowledge memorization, (3) no privacy leakage,\n(4) utility preservation on data not intended for removal, (5) scalability with\nrespect to the size of removal requests, and (6) sustainability over sequential\nunlearning requests. Using these criteria, we benchmark how effectively eight\npopular unlearning algorithms on 7B-parameter LMs can unlearn Harry Potter\nbooks and news articles. Our results demonstrate that most algorithms can\nprevent verbatim memorization and knowledge memorization to varying degrees,\nbut only one algorithm does not lead to severe privacy leakage. Furthermore,\nexisting algorithms fail to meet deployer's expectations because they often\ndegrade general model utility and also cannot sustainably accommodate\nsuccessive unlearning requests or large-scale content removal. Our findings\nidentify key issues with the practicality of existing unlearning algorithms on\nlanguage models, and we release our benchmark to facilitate further\nevaluations: muse-bench.github.io", "paper_summary_zh": "<paragraph>語言模型 (LM) 是在大量的文字資料上訓練出來的，其中可能包含私人和受版權保護的內容。資料擁有者可能會要求從訓練好的模型中移除他們的資料，原因是隱私或版權問題。然而，精確地取消學習僅這些資料點（即在移除資料後重新訓練）在現代模型中是不可行的。這導致了許多近似取消學習演算法的開發。傳統上，對這些演算法效能的評估範圍很窄，無法精確量化演算法從模型部署者和資料擁有者的角度來看是否成功且實用。我們透過提出 MUSE 來解決這個問題，MUSE 是個全面的機器取消學習評量基準，它列舉了取消學習模型的六個不同的理想屬性：(1) 沒有逐字記憶，(2) 沒有知識記憶，(3) 沒有隱私外洩，(4) 對未打算移除的資料保留效用，(5) 針對移除要求的規模進行調整，以及 (6) 對連續取消學習要求的永續性。使用這些標準，我們評量了八種流行的取消學習演算法在 7B 參數 LM 上取消學習哈利波特書籍和新聞文章的有效性。我們的結果表明，大多數演算法都能在不同程度上防止逐字記憶和知識記憶，但只有一種演算法不會導致嚴重的隱私外洩。此外，現有的演算法無法滿足部署者的期望，因為它們通常會降低一般模型的效用，而且也無法持續滿足連續的取消學習要求或大規模內容移除。我們的研究結果找出了現有取消學習演算法在語言模型上的實用性的關鍵問題，並且我們釋出我們的基準以利進一步評估：muse-bench.github.io</paragraph>", "author": "Weijia Shi et.al.", "authors": "Weijia Shi, Jaechan Lee, Yangsibo Huang, Sadhika Malladi, Jieyu Zhao, Ari Holtzman, Daogao Liu, Luke Zettlemoyer, Noah A. Smith, Chiyuan Zhang", "id": "2407.06460v1", "paper_url": "http://arxiv.org/abs/2407.06460v1", "repo": "null"}}