{"2408.14626": {"publish_time": "2024-08-26", "title": "Hybrid Deep Convolutional Neural Networks Combined with Autoencoders And Augmented Data To Predict The Look-Up Table 2006", "paper_summary": "This study explores the development of a hybrid deep convolutional neural\nnetwork (DCNN) model enhanced by autoencoders and data augmentation techniques\nto predict critical heat flux (CHF) with high accuracy. By augmenting the\noriginal input features using three different autoencoder configurations, the\nmodel's predictive capabilities were significantly improved. The hybrid models\nwere trained and tested on a dataset of 7225 samples, with performance metrics\nincluding the coefficient of determination (R2), Nash-Sutcliffe efficiency\n(NSE), mean absolute error (MAE), and normalized root-mean-squared error\n(NRMSE) used for evaluation. Among the tested models, the DCNN_3F-A2\nconfiguration demonstrated the highest accuracy, achieving an R2 of 0.9908\nduring training and 0.9826 during testing, outperforming the base model and\nother augmented versions. These results suggest that the proposed hybrid\napproach, combining deep learning with feature augmentation, offers a robust\nsolution for CHF prediction, with the potential to generalize across a wider\nrange of conditions.", "paper_summary_zh": "本研究探討了透過自編碼器和資料擴充技術增強的混合深度卷積神經網路 (DCNN) 模型，以高準確度預測臨界熱通量 (CHF) 的發展。透過使用三種不同的自編碼器組態來擴充原始輸入特徵，顯著改善了模型的預測能力。混合模型在包含 7225 個樣本的資料集上進行訓練和測試，並使用決定係數 (R2)、Nash-Sutcliffe 效率 (NSE)、平均絕對誤差 (MAE) 和正規化均方根誤差 (NRMSE) 等效能指標進行評估。在測試的模型中，DCNN_3F-A2 組態表現出最高的準確度，在訓練期間達到 R2 為 0.9908，在測試期間達到 0.9826，優於基礎模型和其他擴充版本。這些結果表明，所提出的結合深度學習與特徵擴充的混合方法，提供了一個穩健的 CHF 預測解決方案，並具有在更廣泛的條件下進行概化的潛力。", "author": "Messaoud Djeddou et.al.", "authors": "Messaoud Djeddou, Aouatef Hellal, Ibrahim A. Hameed, Xingang Zhao, Djehad Al Dallal", "id": "2408.14626v1", "paper_url": "http://arxiv.org/abs/2408.14626v1", "repo": "null"}}