{"2502.04210": {"publish_time": "2025-02-06", "title": "Algorithmic causal structure emerging through compression", "paper_summary": "We explore the relationship between causality, symmetry, and compression. We\nbuild on and generalize the known connection between learning and compression\nto a setting where causal models are not identifiable. We propose a framework\nwhere causality emerges as a consequence of compressing data across multiple\nenvironments. We define algorithmic causality as an alternative definition of\ncausality when traditional assumptions for causal identifiability do not hold.\nWe demonstrate how algorithmic causal and symmetric structures can emerge from\nminimizing upper bounds on Kolmogorov complexity, without knowledge of\nintervention targets. We hypothesize that these insights may also provide a\nnovel perspective on the emergence of causality in machine learning models,\nsuch as large language models, where causal relationships may not be explicitly\nidentifiable.", "paper_summary_zh": "我們探討因果關係、對稱性與壓縮之間的關係。我們建立並概括了學習與壓縮之間已知的關聯，並運用於因果模型不可識別的設定中。我們提出一個架構，其中因果關係會隨著跨多個環境壓縮資料而浮現。當因果可識別性的傳統假設不成立時，我們將演算法因果關係定義為因果關係的替代定義。我們展示演算法因果關係與對稱結構如何從最小化 Kolmogorov 複雜度上限中浮現，而無需知道介入目標。我們假設這些見解也可能提供關於機器學習模型中因果關係浮現的新觀點，例如大型語言模型，其中因果關係可能無法明確識別。", "author": "Liang Wendong et.al.", "authors": "Liang Wendong, Simon Buchholz, Bernhard Schölkopf", "id": "2502.04210v1", "paper_url": "http://arxiv.org/abs/2502.04210v1", "repo": "null"}}