{"2406.11830": {"publish_time": "2024-06-17", "title": "Language Modeling with Editable External Knowledge", "paper_summary": "When the world changes, so does the text that humans write about it. How do\nwe build language models that can be easily updated to reflect these changes?\nOne popular approach is retrieval-augmented generation, in which new documents\nare inserted into a knowledge base and retrieved during prediction for\ndownstream tasks. Most prior work on these systems have focused on improving\nbehavior during prediction through better retrieval or reasoning. This paper\nintroduces ERASE, which instead improves model behavior when new documents are\nacquired, by incrementally deleting or rewriting other entries in the knowledge\nbase each time a document is added. In two new benchmark datasets evaluating\nmodels' ability to answer questions about a stream of news articles or\nconversations, ERASE improves accuracy relative to conventional\nretrieval-augmented generation by 7-13% (Mixtral-8x7B) and 6-10% (Llama-3-8B)\nabsolute. Code and data are available at https://github.com/belindal/ERASE", "paper_summary_zh": "當世界改變，人類對它的文字書寫也跟著改變。我們如何建構可以輕易更新以反映這些改變的語言模型？一種廣受歡迎的方法是檢索增強生成，其中新的文件會插入到知識庫中，並在預測中檢索以進行下游任務。這些系統的大部分先前工作都專注於透過更好的檢索或推理來改善預測期間的行為。本文介紹 ERASE，它在取得新文件時改善模型行為，透過每次新增文件時遞增刪除或改寫知識庫中的其他條目。在兩個新的基準資料集評估模型回答新聞文章或對話串流問題的能力，ERASE 相較於傳統的檢索增強生成，準確性提升 7-13%（Mixtral-8x7B）和 6-10%（Llama-3-8B）絕對值。程式碼和資料可於 https://github.com/belindal/ERASE 取得", "author": "Belinda Z. Li et.al.", "authors": "Belinda Z. Li, Emmy Liu, Alexis Ross, Abbas Zeitoun, Graham Neubig, Jacob Andreas", "id": "2406.11830v1", "paper_url": "http://arxiv.org/abs/2406.11830v1", "repo": "https://github.com/belindal/erase"}}