{"2408.10108": {"publish_time": "2024-08-19", "title": "Envisioning Possibilities and Challenges of AI for Personalized Cancer Care", "paper_summary": "The use of Artificial Intelligence (AI) in healthcare, including in caring\nfor cancer survivors, has gained significant interest. However, gaps remain in\nour understanding of how such AI systems can provide care, especially for\nethnic and racial minority groups who continue to face care disparities.\nThrough interviews with six cancer survivors, we identify critical gaps in\ncurrent healthcare systems such as a lack of personalized care and insufficient\ncultural and linguistic accommodation. AI, when applied to care, was seen as a\nway to address these issues by enabling real-time, culturally aligned, and\nlinguistically appropriate interactions. We also uncovered concerns about the\nimplications of AI-driven personalization, such as data privacy, loss of human\ntouch in caregiving, and the risk of echo chambers that limit exposure to\ndiverse information. We conclude by discussing the trade-offs between\nAI-enhanced personalization and the need for structural changes in healthcare\nthat go beyond technological solutions, leading us to argue that we should\nbegin by asking, ``Why personalization?''", "paper_summary_zh": "在醫療保健中使用人工智慧 (AI)，包括照護癌症倖存者，已經獲得顯著的關注。然而，我們對於此類 AI 系統如何提供照護，特別是針對持續面臨照護差異的種族和少數族裔群體，仍有理解上的差距。透過與六位癌症倖存者的訪談，我們找出當前醫療保健系統中的重大差距，例如缺乏個人化照護，以及文化和語言適應不足。當 AI 應用於照護時，被視為解決這些問題的方法，它能促成即時、符合文化且在語言上適當的互動。我們也發現對 AI 驅動的個人化照護所帶來的影響感到擔憂，例如資料隱私、照護中失去人際接觸，以及限制接觸多元資訊的同溫層風險。我們最後討論了 AI 增強的個人化照護與醫療保健中結構性變革之間的取捨，而這超越了技術解決方案，這讓我們主張我們應該從詢問「為什麼需要個人化照護？」開始。", "author": "Elaine Kong et.al.", "authors": "Elaine Kong, Kuo-Ting, Huang, Aakash Gautam", "id": "2408.10108v1", "paper_url": "http://arxiv.org/abs/2408.10108v1", "repo": "null"}}