{"2405.15383": {"publish_time": "2024-05-24", "title": "Generating Code World Models with Large Language Models Guided by Monte Carlo Tree Search", "paper_summary": "In this work we consider Code World Models, world models generated by a Large\nLanguage Model (LLM) in the form of Python code for model-based Reinforcement\nLearning (RL). Calling code instead of LLMs for planning has the advantages of\nbeing precise, reliable, interpretable, and extremely efficient. However,\nwriting appropriate Code World Models requires the ability to understand\ncomplex instructions, to generate exact code with non-trivial logic and to\nself-debug a long program with feedback from unit tests and environment\ntrajectories. To address these challenges, we propose Generate, Improve and Fix\nwith Monte Carlo Tree Search (GIF-MCTS), a new code generation strategy for\nLLMs. To test our approach, we introduce the Code World Models Benchmark\n(CWMB), a suite of program synthesis and planning tasks comprised of 18 diverse\nRL environments paired with corresponding textual descriptions and curated\ntrajectories. GIF-MCTS surpasses all baselines on the CWMB and two other\nbenchmarks, and we show that the Code World Models synthesized with it can be\nsuccessfully used for planning, resulting in model-based RL agents with greatly\nimproved sample efficiency and inference speed.", "paper_summary_zh": "在這項工作中，我們考慮了程式碼世界模型，由大型語言模型 (LLM) 以 Python 程式碼的形式產生，用於基於模型的強化學習 (RL)。呼叫程式碼而非 LLM 來規劃具有精確、可靠、可詮釋和極高效能的優點。然而，撰寫適當的程式碼世界模型需要理解複雜指令、產生具有非平凡邏輯的確切程式碼，以及使用單元測試和環境軌跡的回饋來自我偵錯長程式碼的能力。為了應對這些挑戰，我們提出了生成、改善和修復與蒙地卡羅樹狀搜尋 (GIF-MCTS) 的新程式碼生成策略，用於 LLM。為了測試我們的做法，我們引入了程式碼世界模型基準 (CWMB)，這是一套程式碼合成和規劃任務，包含 18 種不同的 RL 環境，搭配對應的文字描述和策劃的軌跡。GIF-MCTS 在 CWMB 和其他兩個基準上超越所有基準，我們表明使用它合成的程式碼世界模型可成功用於規劃，從而產生具有大幅改善的樣本效率和推論速度的基於模型的 RL 代理。", "author": "Nicola Dainese et.al.", "authors": "Nicola Dainese, Matteo Merler, Minttu Alakuijala, Pekka Marttinen", "id": "2405.15383v1", "paper_url": "http://arxiv.org/abs/2405.15383v1", "repo": "null"}}