{"2408.02964": {"publish_time": "2024-08-06", "title": "Accuracy and Consistency of LLMs in the Registered Dietitian Exam: The Impact of Prompt Engineering and Knowledge Retrieval", "paper_summary": "Large language models (LLMs) are fundamentally transforming human-facing\napplications in the health and well-being domains: boosting patient engagement,\naccelerating clinical decision-making, and facilitating medical education.\nAlthough state-of-the-art LLMs have shown superior performance in several\nconversational applications, evaluations within nutrition and diet applications\nare still insufficient. In this paper, we propose to employ the Registered\nDietitian (RD) exam to conduct a standard and comprehensive evaluation of\nstate-of-the-art LLMs, GPT-4o, Claude 3.5 Sonnet, and Gemini 1.5 Pro, assessing\nboth accuracy and consistency in nutrition queries. Our evaluation includes\n1050 RD exam questions encompassing several nutrition topics and proficiency\nlevels. In addition, for the first time, we examine the impact of Zero-Shot\n(ZS), Chain of Thought (CoT), Chain of Thought with Self Consistency (CoT-SC),\nand Retrieval Augmented Prompting (RAP) on both accuracy and consistency of the\nresponses. Our findings revealed that while these LLMs obtained acceptable\noverall performance, their results varied considerably with different prompts\nand question domains. GPT-4o with CoT-SC prompting outperformed the other\napproaches, whereas Gemini 1.5 Pro with ZS recorded the highest consistency.\nFor GPT-4o and Claude 3.5, CoT improved the accuracy, and CoT-SC improved both\naccuracy and consistency. RAP was particularly effective for GPT-4o to answer\nExpert level questions. Consequently, choosing the appropriate LLM and\nprompting technique, tailored to the proficiency level and specific domain, can\nmitigate errors and potential risks in diet and nutrition chatbots.", "paper_summary_zh": "大型語言模型 (LLM) 正在從根本上轉變健康和福祉領域中面向人類的應用：提升患者參與度、加速臨床決策制定，並促進醫學教育。儘管最先進的 LLM 已在多項對話式應用中展現出優異的效能，但在營養和飲食應用中的評估仍不足。在本文中，我們提議採用註冊營養師 (RD) 考試來對最先進的 LLM、GPT-4o、Claude 3.5 Sonnet 和 Gemini 1.5 Pro 進行標準且全面的評估，評估營養查詢的準確性和一致性。我們的評估包含 1050 個 RD 考試題目，涵蓋多個營養主題和熟練程度。此外，我們首次探討零次學習 (ZS)、思考鏈 (CoT)、具有自我一致性的思考鏈 (CoT-SC) 和檢索增強提示 (RAP) 對回應準確性和一致性的影響。我們的研究結果顯示，儘管這些 LLM 獲得可接受的整體效能，但其結果因不同的提示和問題領域而有很大差異。使用 CoT-SC 提示的 GPT-4o 優於其他方法，而使用 ZS 的 Gemini 1.5 Pro 則記錄到最高的一致性。對於 GPT-4o 和 Claude 3.5，CoT 提高了準確性，而 CoT-SC 則同時提高了準確性和一致性。RAP 對於 GPT-4o 回答專家級別的問題特別有效。因此，選擇適當的 LLM 和提示技巧，並根據熟練程度和特定領域進行調整，可以減輕飲食和營養聊天機器人的錯誤和潛在風險。", "author": "Iman Azimi et.al.", "authors": "Iman Azimi, Mohan Qi, Li Wang, Amir M. Rahmani, Youlin Li", "id": "2408.02964v1", "paper_url": "http://arxiv.org/abs/2408.02964v1", "repo": "null"}}