{"2410.19235": {"publish_time": "2024-10-25", "title": "Learning Diffusion Policies from Demonstrations For Compliant Contact-rich Manipulation", "paper_summary": "Robots hold great promise for performing repetitive or hazardous tasks, but\nachieving human-like dexterity, especially in contact-rich and dynamic\nenvironments, remains challenging. Rigid robots, which rely on position or\nvelocity control, often struggle with maintaining stable contact and applying\nconsistent force in force-intensive tasks. Learning from Demonstration has\nemerged as a solution, but tasks requiring intricate maneuvers, such as powder\ngrinding, present unique difficulties. This paper introduces Diffusion Policies\nFor Compliant Manipulation (DIPCOM), a novel diffusion-based framework designed\nfor compliant control tasks. By leveraging generative diffusion models, we\ndevelop a policy that predicts Cartesian end-effector poses and adjusts arm\nstiffness to maintain the necessary force. Our approach enhances force control\nthrough multimodal distribution modeling, improves the integration of diffusion\npolicies in compliance control, and extends our previous work by demonstrating\nits effectiveness in real-world tasks. We present a detailed comparison between\nour framework and existing methods, highlighting the advantages and best\npractices for deploying diffusion-based compliance control.", "paper_summary_zh": "機器人極具執行重複性或危險性任務的潛力，但要實現類似人類的靈巧度，特別是在接觸豐富且動態的環境中，仍然具有挑戰性。依賴位置或速度控制的剛性機器人通常難以維持穩定的接觸並在需要力量的任務中施加一致的力量。從示範中學習已成為一種解決方案，但需要複雜操作的任務，例如粉末研磨，會產生獨特的困難。本文介紹了柔性操作的擴散策略 (DIPCOM)，這是一種新穎的基於擴散的框架，專為柔性控制任務而設計。通過利用生成擴散模型，我們制定了一項策略，該策略預測笛卡爾末端執行器的姿勢並調整手臂剛度以維持必要的力。我們的做法通過多模態分佈建模增強了力控制，改進了擴散策略在柔順控制中的整合，並通過展示其在現實世界任務中的有效性來擴展我們之前的工作。我們對我們的框架和現有方法進行了詳細比較，重點介紹了部署基於擴散的柔順控制的優點和最佳實務。", "author": "Malek Aburub et.al.", "authors": "Malek Aburub, Cristian C. Beltran-Hernandez, Tatsuya Kamijo, Masashi Hamaya", "id": "2410.19235v1", "paper_url": "http://arxiv.org/abs/2410.19235v1", "repo": "null"}}