{"2501.17559": {"publish_time": "2025-01-29", "title": "Solving Urban Network Security Games: Learning Platform, Benchmark, and Challenge for AI Research", "paper_summary": "After the great achievement of solving two-player zero-sum games, more and\nmore AI researchers focus on solving multiplayer games. To facilitate the\ndevelopment of designing efficient learning algorithms for solving multiplayer\ngames, we propose a multiplayer game platform for solving Urban Network\nSecurity Games (\\textbf{UNSG}) that model real-world scenarios. That is,\npreventing criminal activity is a highly significant responsibility assigned to\npolice officers in cities, and police officers have to allocate their limited\nsecurity resources to interdict the escaping criminal when a crime takes place\nin a city. This interaction between multiple police officers and the escaping\ncriminal can be modeled as a UNSG. The variants of UNSGs can model different\nreal-world settings, e.g., whether real-time information is available or not,\nand whether police officers can communicate or not. The main challenges of\nsolving this game include the large size of the game and the co-existence of\ncooperation and competition. While previous efforts have been made to tackle\nUNSGs, they have been hampered by performance and scalability issues.\nTherefore, we propose an open-source UNSG platform (\\textbf{GraphChase}) for\ndesigning efficient learning algorithms for solving UNSGs. Specifically,\nGraphChase offers a unified and flexible game environment for modeling various\nvariants of UNSGs, supporting the development, testing, and benchmarking of\nalgorithms. We believe that GraphChase not only facilitates the development of\nefficient algorithms for solving real-world problems but also paves the way for\nsignificant advancements in algorithmic development for solving general\nmultiplayer games.", "paper_summary_zh": "<paragraph>在解決兩人零和博弈獲得重大成就後，越來越多的 AI 研究人員專注於解決多人博弈。為了促進設計用於解決多人博弈的有效學習演算法的開發，我們提出一個多人博弈平台，用於解決模擬真實世界場景的城市網路安全博弈 (UNSG)。也就是說，防止犯罪活動是分配給城市中警察人員的一項極其重要的責任，而警察人員必須在城市中發生犯罪時分配其有限的安全資源來阻止逃逸的罪犯。警察人員和逃逸罪犯之間的這種互動可以建模為 UNSG。UNSG 的變體可以模擬不同的真實世界設定，例如，是否可以使用即時資訊，以及警察人員是否可以溝通。解決此博弈的主要挑戰包括博弈規模龐大，以及合作與競爭並存。儘管之前已做出努力來解決 UNSG，但它們受到效能和可擴充性的問題所阻礙。因此，我們提出一個開源 UNSG 平台 (GraphChase)，用於設計用於解決 UNSG 的有效學習演算法。具體來說，GraphChase 提供一個統一且靈活的博弈環境，用於模擬 UNSG 的各種變體，支援演算法的開發、測試和基準測試。我們相信 GraphChase 不僅促進開發用於解決真實世界問題的有效演算法，也為解決一般多人博弈的演算法開發鋪平了道路。</paragraph>", "author": "Shuxin Zhuang et.al.", "authors": "Shuxin Zhuang, Shuxin Li, Tianji Yang, Muheng Li, Xianjie Shi, Bo An, Youzhi Zhang", "id": "2501.17559v1", "paper_url": "http://arxiv.org/abs/2501.17559v1", "repo": "null"}}