{"2409.06351": {"publish_time": "2024-09-10", "title": "MAGDA: Multi-agent guideline-driven diagnostic assistance", "paper_summary": "In emergency departments, rural hospitals, or clinics in less developed\nregions, clinicians often lack fast image analysis by trained radiologists,\nwhich can have a detrimental effect on patients' healthcare. Large Language\nModels (LLMs) have the potential to alleviate some pressure from these\nclinicians by providing insights that can help them in their decision-making.\nWhile these LLMs achieve high test results on medical exams showcasing their\ngreat theoretical medical knowledge, they tend not to follow medical\nguidelines. In this work, we introduce a new approach for zero-shot\nguideline-driven decision support. We model a system of multiple LLM agents\naugmented with a contrastive vision-language model that collaborate to reach a\npatient diagnosis. After providing the agents with simple diagnostic\nguidelines, they will synthesize prompts and screen the image for findings\nfollowing these guidelines. Finally, they provide understandable\nchain-of-thought reasoning for their diagnosis, which is then self-refined to\nconsider inter-dependencies between diseases. As our method is zero-shot, it is\nadaptable to settings with rare diseases, where training data is limited, but\nexpert-crafted disease descriptions are available. We evaluate our method on\ntwo chest X-ray datasets, CheXpert and ChestX-ray 14 Longtail, showcasing\nperformance improvement over existing zero-shot methods and generalizability to\nrare diseases.", "paper_summary_zh": "在急診室、鄉村醫院或欠發達地區的診所，臨床醫師常常缺乏受過訓練的放射科醫師進行快速的影像分析，這可能會對病患的醫療保健造成不利影響。大型語言模型 (LLM) 有潛力減輕這些臨床醫師的一些壓力，方法是提供見解，協助他們進行決策。儘管這些 LLM 在展示其豐富的理論醫學知識的醫學考試中獲得了很高的測試結果，但它們往往不遵循醫療指南。在這項工作中，我們介紹了一種新的零次學習指導方針驅動決策支援方法。我們模擬了一個多個 LLM 代理系統，並增強了一個對比視覺語言模型，該模型協作以達成病患診斷。在為代理提供簡單的診斷指南後，它們將綜合提示並根據這些指南篩選影像以找出發現。最後，它們為其診斷提供可以理解的思路推理，然後自我精進以考量疾病之間的相互依存關係。由於我們的模型是零次學習，因此它可以適應罕見疾病的設定，在這種設定中，訓練資料有限，但有專家製作的疾病描述可用。我們在兩個胸部 X 光片資料集，CheXpert 和 ChestX-ray 14 Longtail，評估我們的模型，展示了相較於現有的零次學習方法的效能提升，以及對罕見疾病的概括性。", "author": "David Bani-Harouni et.al.", "authors": "David Bani-Harouni, Nassir Navab, Matthias Keicher", "id": "2409.06351v1", "paper_url": "http://arxiv.org/abs/2409.06351v1", "repo": "null"}}