{"2406.14491": {"publish_time": "2024-06-20", "title": "Instruction Pre-Training: Language Models are Supervised Multitask Learners", "paper_summary": "Unsupervised multitask pre-training has been the critical method behind the\nrecent success of language models (LMs). However, supervised multitask learning\nstill holds significant promise, as scaling it in the post-training stage\ntrends towards better generalization. In this paper, we explore supervised\nmultitask pre-training by proposing Instruction Pre-Training, a framework that\nscalably augments massive raw corpora with instruction-response pairs to\npre-train LMs. The instruction-response pairs are generated by an efficient\ninstruction synthesizer built on open-source models. In our experiments, we\nsynthesize 200M instruction-response pairs covering 40+ task categories to\nverify the effectiveness of Instruction Pre-Training. In pre-training from\nscratch, Instruction Pre-Training not only consistently enhances pre-trained\nbase models but also benefits more from further instruction tuning. In\ncontinual pre-training, Instruction Pre-Training enables Llama3-8B to be\ncomparable to or even outperform Llama3-70B. Our model, code, and data are\navailable at https://github.com/microsoft/LMOps.", "paper_summary_zh": "無監督多任務預訓練一直是語言模型 (LM) 近期成功的關鍵方法。然而，監督式多任務學習仍具有顯著的潛力，因為在後訓練階段擴展它趨向於更好的概括能力。在本文中，我們透過提出指令預訓練來探索監督式多任務預訓練，這是一個透過指令回應配對可擴充地增加大量原始語料庫以預訓練 LM 的架構。指令回應配對是由建立在開源模型上的有效指令合成器產生的。在我們的實驗中，我們合成了涵蓋 40 多個任務類別的 2 億個指令回應配對，以驗證指令預訓練的有效性。在從頭開始預訓練時，指令預訓練不僅持續增強預訓練的基本模型，而且還能從進一步的指令微調中受益更多。在持續預訓練中，指令預訓練使 Llama3-8B 能夠與 Llama3-70B 相媲美甚至表現得更好。我們的模型、程式碼和資料可在 https://github.com/microsoft/LMOps 取得。", "author": "Daixuan Cheng et.al.", "authors": "Daixuan Cheng, Yuxian Gu, Shaohan Huang, Junyu Bi, Minlie Huang, Furu Wei", "id": "2406.14491v1", "paper_url": "http://arxiv.org/abs/2406.14491v1", "repo": "https://github.com/microsoft/lmops"}}