{"2501.03045": {"publish_time": "2025-01-06", "title": "Single-Channel Distance-Based Source Separation for Mobile GPU in Outdoor and Indoor Environments", "paper_summary": "This study emphasizes the significance of exploring distance-based source\nseparation (DSS) in outdoor environments. Unlike existing studies that\nprimarily focus on indoor settings, the proposed model is designed to capture\nthe unique characteristics of outdoor audio sources. It incorporates advanced\ntechniques, including a two-stage conformer block, a linear relation-aware\nself-attention (RSA), and a TensorFlow Lite GPU delegate. While the linear RSA\nmay not capture physical cues as explicitly as the quadratic RSA, the linear\nRSA enhances the model's context awareness, leading to improved performance on\nthe DSS that requires an understanding of physical cues in outdoor and indoor\nenvironments. The experimental results demonstrated that the proposed model\novercomes the limitations of existing approaches and considerably enhances\nenergy efficiency and real-time inference speed on mobile devices.", "paper_summary_zh": "本研究強調在戶外環境中探索基於距離的來源分離 (DSS) 的重要性。有別於現有主要專注於室內設定的研究，所提出的模型旨在捕捉戶外音訊來源的獨特特徵。它結合了先進的技術，包括兩階段共形器區塊、線性關係感知自注意力 (RSA) 和 TensorFlow Lite GPU 委派。雖然線性 RSA 可能無法像二次 RSA 那樣明確地捕捉物理線索，但線性 RSA 增強了模型的背景感知，從而提高了對 DSS 的效能，DSS 要求理解戶外和室內環境中的物理線索。實驗結果表明，所提出的模型克服了現有方法的限制，並顯著提高了行動裝置上的能源效率和即時推論速度。", "author": "Hanbin Bae et.al.", "authors": "Hanbin Bae, Byungjun Kang, Jiwon Kim, Jaeyong Hwang, Hosang Sung, Hoon-Young Cho", "id": "2501.03045v1", "paper_url": "http://arxiv.org/abs/2501.03045v1", "repo": "null"}}