{"2502.04963": {"publish_time": "2025-02-07", "title": "Fast Adaptive Anti-Jamming Channel Access via Deep Q Learning and Coarse-Grained Spectrum Prediction", "paper_summary": "This paper investigates the anti-jamming channel access problem in complex\nand unknown jamming environments, where the jammer could dynamically adjust its\nstrategies to target different channels. Traditional channel hopping\nanti-jamming approaches using fixed patterns are ineffective against such\ndynamic jamming attacks. Although the emerging deep reinforcement learning\n(DRL) based dynamic channel access approach could achieve the Nash equilibrium\nunder fast-changing jamming attacks, it requires extensive training episodes.\nTo address this issue, we propose a fast adaptive anti-jamming channel access\napproach guided by the intuition of ``learning faster than the jammer\", where a\nsynchronously updated coarse-grained spectrum prediction serves as an auxiliary\ntask for the deep Q learning (DQN) based anti-jamming model. This helps the\nmodel identify a superior Q-function compared to standard DRL while\nsignificantly reducing the number of training episodes. Numerical results\nindicate that the proposed approach significantly accelerates the rate of\nconvergence in model training, reducing the required training episodes by up to\n70% compared to standard DRL. Additionally, it also achieves a 10% improvement\nin throughput over NE strategies, owing to the effective use of coarse-grained\nspectrum prediction.", "paper_summary_zh": "本文探討複雜且未知的干擾環境中的防干擾頻道存取問題，其中干擾者可以動態調整其策略以鎖定不同的頻道。使用固定模式的傳統頻道跳頻防干擾方法對於此類動態干擾攻擊無效。儘管新興的基於深度強化學習 (DRL) 的動態頻道存取方法可以在快速變化的干擾攻擊下實現納什均衡，但它需要大量的訓練回合。為了解決這個問題，我們提出了一種快速適應性防干擾頻道存取方法，其指導思想是「比干擾者學習得更快」，其中同步更新的粗粒度頻譜預測作為基於深度 Q 學習 (DQN) 的防干擾模型的輔助任務。這有助於模型識別與標準 DRL 相比更優越的 Q 函數，同時顯著減少訓練回合數。數值結果表明，所提出的方法顯著加快了模型訓練中的收斂速度，與標準 DRL 相比，將所需的訓練回合數減少了 70%。此外，由於有效利用了粗粒度頻譜預測，它還將吞吐量提高了 10%，超過了 NE 策略。", "author": "Jianshu Zhang et.al.", "authors": "Jianshu Zhang, Xiaofu Wu, Junquan Hu", "id": "2502.04963v1", "paper_url": "http://arxiv.org/abs/2502.04963v1", "repo": "null"}}