{"2502.11491": {"publish_time": "2025-02-17", "title": "Ontology-Guided Reverse Thinking Makes Large Language Models Stronger on Knowledge Graph Question Answering", "paper_summary": "Large language models (LLMs) have shown remarkable capabilities in natural\nlanguage processing. However, in knowledge graph question answering tasks\n(KGQA), there remains the issue of answering questions that require multi-hop\nreasoning. Existing methods rely on entity vector matching, but the purpose of\nthe question is abstract and difficult to match with specific entities. As a\nresult, it is difficult to establish reasoning paths to the purpose, which\nleads to information loss and redundancy. To address this issue, inspired by\nhuman reverse thinking, we propose Ontology-Guided Reverse Thinking (ORT), a\nnovel framework that constructs reasoning paths from purposes back to\nconditions. ORT operates in three key phases: (1) using LLM to extract purpose\nlabels and condition labels, (2) constructing label reasoning paths based on\nthe KG ontology, and (3) using the label reasoning paths to guide knowledge\nretrieval. Experiments on the WebQSP and CWQ datasets show that ORT achieves\nstate-of-the-art performance and significantly enhances the capability of LLMs\nfor KGQA.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言處理中展現出卓越的能力。然而，在知識圖譜問答任務 (KGQA) 中，仍然存在需要多跳推理才能回答問題的問題。現有方法依賴於實體向量匹配，但問題的目的是抽象的，難以與特定實體匹配。因此，很難建立推理路徑來達成目的，這會導致資訊遺失和冗餘。為了解決這個問題，在人類逆向思維的啟發下，我們提出了基於本体的逆向思維 (ORT)，這是一個創新的架構，可以從目的建構推理路徑，再回推到條件。ORT 運作在三個關鍵階段：(1) 使用 LLM 萃取目的標籤和條件標籤，(2) 基於 KG 本体建構標籤推理路徑，以及 (3) 使用標籤推理路徑來引導知識擷取。在 WebQSP 和 CWQ 資料集上的實驗顯示，ORT 達到了最先進的效能，並顯著增強了 LLM 對 KGQA 的能力。", "author": "Runxuan Liu et.al.", "authors": "Runxuan Liu, Bei Luo, Jiaqi Li, Baoxin Wang, Ming Liu, Dayong Wu, Shijin Wang, Bing Qin", "id": "2502.11491v1", "paper_url": "http://arxiv.org/abs/2502.11491v1", "repo": "null"}}