{"2406.10203": {"publish_time": "2024-06-14", "title": "A Fundamental Trade-off in Aligned Language Models and its Relation to Sampling Adaptors", "paper_summary": "The relationship between the quality of a string and its probability\n$p(\\boldsymbol{y})$ under a language model has been influential in the\ndevelopment of techniques to build good text generation systems. For example,\nseveral decoding algorithms have been motivated to manipulate\n$p(\\boldsymbol{y})$ to produce higher-quality text. In this work, we examine\nthe probability--quality relationship in language models explicitly aligned to\nhuman preferences, e.g., through Reinforcement Learning through Human Feedback\n(RLHF). We find that, given a general language model and its aligned version,\nfor corpora sampled from an aligned language model, there exists a trade-off\nbetween the average reward and average log-likelihood of the strings under the\ngeneral language model. We provide a formal treatment of this issue and\ndemonstrate how a choice of sampling adaptor allows for a selection of how much\nlikelihood we exchange for the reward.", "paper_summary_zh": "語言模型中字串品質與其機率 $p(\\boldsymbol{y})$ 之間的關係，對於建構良好文字產生系統的技術發展具有影響力。例如，已經激勵了多種解碼演算法來操作 $p(\\boldsymbol{y})$ 以產生更高品質的文字。在這項工作中，我們探討與人類偏好明確對齊的語言模型中的機率品質關係，例如透過人類回饋強化學習 (RLHF)。我們發現，給定一般語言模型及其對齊版本，對於從對齊語言模型取樣的語料庫，在一般語言模型下字串的平均獎勵與平均對數似然度之間存在權衡取捨。我們對這個問題提供正式處理，並展示取樣適配器的選擇如何允許選擇我們為獎勵交換多少似然度。", "author": "Naaman Tan et.al.", "authors": "Naaman Tan, Josef Valvoda, Anej Svete, Tianyu Liu, Yanxia Qin, Kan Min-Yen, Ryan Cotterell", "id": "2406.10203v1", "paper_url": "http://arxiv.org/abs/2406.10203v1", "repo": "null"}}