{"2407.15835": {"publish_time": "2024-07-22", "title": "dMel: Speech Tokenization made Simple", "paper_summary": "Large language models have revolutionized natural language processing by\nleveraging self-supervised pretraining on vast textual data. Inspired by this\nsuccess, researchers have investigated complicated speech tokenization methods\nto discretize continuous speech signals so that language modeling techniques\ncan be applied to speech data. However, existing approaches either model\nsemantic tokens, potentially losing acoustic information, or model acoustic\ntokens, risking the loss of semantic information. Having multiple token types\nalso complicates the architecture and requires additional pretraining. Here we\nshow that discretizing mel-filterbank channels into discrete intensity bins\nproduces a simple representation (dMel), that performs better than other\nexisting speech tokenization methods. Using a transformer decoder-only\narchitecture for speech-text modeling, we comprehensively evaluate different\nspeech tokenization methods on speech recognition (ASR), speech synthesis\n(TTS). Our results demonstrate the effectiveness of dMel in achieving high\nperformance on both tasks within a unified framework, paving the way for\nefficient and effective joint modeling of speech and text.", "paper_summary_zh": "大型語言模型透過在大量的文本資料上利用自我監督預訓練，徹底改變了自然語言處理。受到這項成功的啟發，研究人員調查了複雜的語音標記化方法，以便將連續的語音訊號離散化，讓語言建模技術可以應用於語音資料。然而，現有的方法不是對語義標記建模（可能遺失音訊資訊），就是對音訊標記建模（有遺失語義資訊的風險）。擁有多種類型的標記也會使架構複雜化，並需要額外的預訓練。在此，我們展示將梅爾濾波器組通道離散化為離散強度區塊，會產生一個簡單的表示（dMel），其效能優於其他現有的語音標記化方法。我們使用僅具轉換器解碼器的架構進行語音轉文字建模，在語音辨識 (ASR)、語音合成 (TTS) 上全面評估不同的語音標記化方法。我們的結果證明了 dMel 在統一架構中達成這兩個任務的高效能，為有效率且有效的語音和文字聯合建模鋪路。", "author": "He Bai et.al.", "authors": "He Bai, Tatiana Likhomanenko, Ruixiang Zhang, Zijin Gu, Zakaria Aldeneh, Navdeep Jaitly", "id": "2407.15835v1", "paper_url": "http://arxiv.org/abs/2407.15835v1", "repo": "null"}}