{"2502.14909": {"publish_time": "2025-02-19", "title": "PTB-Image: A Scanned Paper ECG Dataset for Digitization and Image-based Diagnosis", "paper_summary": "Electrocardiograms (ECGs) recorded on paper remain prevalent in clinical\npractice, yet their use presents challenges for automated analysis and digital\nstorage. To address this issue, we introduce PTB-Image, a dataset comprising\nscanned paper ECGs with corresponding digital signals, enabling research on ECG\ndigitization. We also provide VinDigitizer, a digitization baseline to convert\npaper-based ECGs into digital time-series signals. The method involves\ndetecting signal rows, extracting waveforms from the background, and\nreconstructing numerical values from the digitized traces. We applied\nVinDigitizer to 549 scanned ECGs and evaluated its performance against the\noriginal PTB dataset (modified to match the printed signals). The results\nachieved a mean signal-to-noise ratio (SNR) of 0.01 dB, highlighting both the\nfeasibility and challenges of ECG digitization, particularly in mitigating\ndistortions from printing and scanning processes. By providing PTB-Image and\nbaseline digitization methods, this work aims to facilitate advancements in ECG\ndigitization, enhancing access to historical ECG data and supporting\napplications in telemedicine and automated cardiac diagnostics.", "paper_summary_zh": "紙本心電圖（ECG）在臨床實務中仍然普遍，但其使用對自動化分析和數位儲存提出了挑戰。為了解決這個問題，我們引入了 PTB-Image，這是一個包含掃描紙本 ECG 和對應數位訊號的資料集，可進行 ECG 數位化的研究。我們還提供了 VinDigitizer，一個數位化基準，用於將紙本 ECG 轉換為數位時間序列訊號。此方法包括偵測訊號列、從背景中萃取波形，以及從數位化的軌跡重建數值。我們將 VinDigitizer 應用於 549 個掃描的 ECG，並根據原始 PTB 資料集（已修改以符合列印訊號）評估其效能。結果達到了平均訊噪比 (SNR) 為 0.01 dB，突顯了 ECG 數位化的可行性與挑戰，特別是在減輕列印和掃描過程中的失真。透過提供 PTB-Image 和基準數位化方法，這項工作旨在促進 ECG 數位化的進展，加強對歷史 ECG 資料的存取，並支援遠距醫療和自動化心臟診斷的應用。", "author": "Cuong V. Nguyen et.al.", "authors": "Cuong V. Nguyen, Hieu X. Nguyen, Dung D. Pham Minh, Cuong D. Do", "id": "2502.14909v1", "paper_url": "http://arxiv.org/abs/2502.14909v1", "repo": "null"}}