{"2411.03039": {"publish_time": "2024-11-05", "title": "Self-Compositional Data Augmentation for Scientific Keyphrase Generation", "paper_summary": "State-of-the-art models for keyphrase generation require large amounts of\ntraining data to achieve good performance. However, obtaining keyphrase-labeled\ndocuments can be challenging and costly. To address this issue, we present a\nself-compositional data augmentation method. More specifically, we measure the\nrelatedness of training documents based on their shared keyphrases, and combine\nsimilar documents to generate synthetic samples. The advantage of our method\nlies in its ability to create additional training samples that keep domain\ncoherence, without relying on external data or resources. Our results on\nmultiple datasets spanning three different domains, demonstrate that our method\nconsistently improves keyphrase generation. A qualitative analysis of the\ngenerated keyphrases for the Computer Science domain confirms this improvement\ntowards their representativity property.", "paper_summary_zh": "最先進的關鍵字生成模型需要大量訓練資料才能達到良好的效能。然而，取得標有關鍵字的文檔具有挑戰性且成本高昂。為了解決這個問題，我們提出一個自組成資料擴充方法。更具體地說，我們根據訓練文件共有的關鍵字來衡量它們的關聯性，並結合類似的文件來產生合成樣本。我們的方法的優點在於它能夠建立額外的訓練樣本，這些樣本保持領域一致性，而不需要依賴外部資料或資源。我們在跨越三個不同領域的多個資料集上的結果表明，我們的方法持續改善關鍵字生成。對電腦科學領域所生成關鍵字的定性分析確認了這種改善朝向它們的代表性屬性。", "author": "Mael Houbre et.al.", "authors": "Mael Houbre, Florian Boudin, Beatrice Daille, Akiko Aizawa", "id": "2411.03039v1", "paper_url": "http://arxiv.org/abs/2411.03039v1", "repo": "null"}}