{"2411.18038": {"publish_time": "2024-11-27", "title": "VLM-HOI: Vision Language Models for Interpretable Human-Object Interaction Analysis", "paper_summary": "The Large Vision Language Model (VLM) has recently addressed remarkable\nprogress in bridging two fundamental modalities. VLM, trained by a sufficiently\nlarge dataset, exhibits a comprehensive understanding of both visual and\nlinguistic to perform diverse tasks. To distill this knowledge accurately, in\nthis paper, we introduce a novel approach that explicitly utilizes VLM as an\nobjective function form for the Human-Object Interaction (HOI) detection task\n(\\textbf{VLM-HOI}). Specifically, we propose a method that quantifies the\nsimilarity of the predicted HOI triplet using the Image-Text matching\ntechnique. We represent HOI triplets linguistically to fully utilize the\nlanguage comprehension of VLMs, which are more suitable than CLIP models due to\ntheir localization and object-centric nature. This matching score is used as an\nobjective for contrastive optimization. To our knowledge, this is the first\nutilization of VLM language abilities for HOI detection. Experiments\ndemonstrate the effectiveness of our method, achieving state-of-the-art HOI\ndetection accuracy on benchmarks. We believe integrating VLMs into HOI\ndetection represents important progress towards more advanced and interpretable\nanalysis of human-object interactions.", "paper_summary_zh": "大型视觉语言模型 (VLM) 最近在桥接两种基本模态方面取得了显着进展。由足够大的数据集训练的 VLM，展示了对视觉和语言的全面理解，以执行各种任务。为了准确地提炼出这种知识，在本文中，我们引入了一种新颖的方法，该方法明确地将 VLM 用作人类-物体交互 (HOI) 检测任务的目标函数形式（VLM-HOI）。具体来说，我们提出了一种使用图像-文本匹配技术量化预测的 HOI 三元组相似性的方法。我们用语言表示 HOI 三元组，以充分利用 VLM 的语言理解能力，由于其定位和以对象为中心的特点，比 CLIP 模型更合适。这个匹配分数被用作对比优化目标。据我们所知，这是首次将 VLM 语言能力用于 HOI 检测。实验表明了我们方法的有效性，在基准测试中实现了最先进的 HOI 检测准确度。我们相信将 VLM 集成到 HOI 检测中代表了朝向更高级和更可解释的人类-物体交互分析的重要进步。", "author": "Donggoo Kang et.al.", "authors": "Donggoo Kang, Dasol Jeong, Hyunmin Lee, Sangwoo Park, Hasil Park, Sunkyu Kwon, Yeongjoon Kim, Joonki Paik", "id": "2411.18038v1", "paper_url": "http://arxiv.org/abs/2411.18038v1", "repo": "null"}}