{"2501.00778": {"publish_time": "2025-01-01", "title": "Decoding the Flow: CauseMotion for Emotional Causality Analysis in Long-form Conversations", "paper_summary": "Long-sequence causal reasoning seeks to uncover causal relationships within\nextended time series data but is hindered by complex dependencies and the\nchallenges of validating causal links. To address the limitations of\nlarge-scale language models (e.g., GPT-4) in capturing intricate emotional\ncausality within extended dialogues, we propose CauseMotion, a long-sequence\nemotional causal reasoning framework grounded in Retrieval-Augmented Generation\n(RAG) and multimodal fusion. Unlike conventional methods relying only on\ntextual information, CauseMotion enriches semantic representations by\nincorporating audio-derived features-vocal emotion, emotional intensity, and\nspeech rate-into textual modalities. By integrating RAG with a sliding window\nmechanism, it effectively retrieves and leverages contextually relevant\ndialogue segments, thus enabling the inference of complex emotional causal\nchains spanning multiple conversational turns. To evaluate its effectiveness,\nwe constructed the first benchmark dataset dedicated to long-sequence emotional\ncausal reasoning, featuring dialogues with over 70 turns. Experimental results\ndemonstrate that the proposed RAG-based multimodal integrated approach, the\nefficacy of substantially enhances both the depth of emotional understanding\nand the causal inference capabilities of large-scale language models. A GLM-4\nintegrated with CauseMotion achieves an 8.7% improvement in causal accuracy\nover the original model and surpasses GPT-4o by 1.2%. Additionally, on the\npublicly available DiaASQ dataset, CauseMotion-GLM-4 achieves state-of-the-art\nresults in accuracy, F1 score, and causal reasoning accuracy.", "paper_summary_zh": "長序列因果推理旨在揭示延伸時間序列資料中的因果關係，但因複雜的依賴關係和驗證因果連結的挑戰而受阻。為了解決大規模語言模型（例如 GPT-4）在捕捉延伸對話中錯綜複雜的情緒因果關係方面的限制，我們提出了 CauseMotion，這是一個基於檢索擴充生成（RAG）和多模態融合的長序列情緒因果推理框架。與僅依賴文字資訊的傳統方法不同，CauseMotion 透過將音訊衍生特徵（語音情緒、情緒強度和語速）融入文字模式來豐富語義表徵。透過將 RAG 與滑動視窗機制整合，它有效地擷取和利用與脈絡相關的對話片段，從而推論跨越多個對話回合的複雜情緒因果鏈。為了評估其有效性，我們建構了第一個專門用於長序列情緒因果推理的基準資料集，其中包含超過 70 回合的對話。實驗結果表明，所提出的基於 RAG 的多模態整合方法顯著提升了大規模語言模型的情緒理解深度和因果推理能力。與 CauseMotion 整合的 GLM-4 在因果準確度上比原始模型提升了 8.7%，並比 GPT-4o 高出 1.2%。此外，在公開的 DiaASQ 資料集上，CauseMotion-GLM-4 在準確度、F1 分數和因果推理準確度方面達到了最先進的結果。", "author": "Yuxuan Zhang et.al.", "authors": "Yuxuan Zhang, Yulong Li, Zichen Yu, Feilong Tang, Zhixiang Lu, Chong Li, Kang Dang, Jionglong Su", "id": "2501.00778v1", "paper_url": "http://arxiv.org/abs/2501.00778v1", "repo": "null"}}