{"2406.04604": {"publish_time": "2024-06-07", "title": "Learning Task Decomposition to Assist Humans in Competitive Programming", "paper_summary": "When using language models (LMs) to solve complex problems, humans might\nstruggle to understand the LM-generated solutions and repair the flawed ones.\nTo assist humans in repairing them, we propose to automatically decompose\ncomplex solutions into multiple simpler pieces that correspond to specific\nsubtasks. We introduce a novel objective for learning task decomposition,\ntermed assistive value (AssistV), which measures the feasibility and speed for\nhumans to repair the decomposed solution. We collect a dataset of human repair\nexperiences on different decomposed solutions. Utilizing the collected data as\nin-context examples, we then learn to critique, refine, and rank decomposed\nsolutions to improve AssistV. We validate our method under competitive\nprogramming problems: under 177 hours of human study, our method enables\nnon-experts to solve 33.3\\% more problems, speeds them up by 3.3x, and empowers\nthem to match unassisted experts.", "paper_summary_zh": "在使用语言模型 (LM) 解決複雜問題時，人類可能會難以理解 LM 生成的解決方案並修復有缺陷的解決方案。為了協助人類修復它們，我們建議自動將複雜的解決方案分解為多個較簡單的部分，這些部分對應於特定的子任務。我們引入了一個用於學習任務分解的新目標，稱為輔助值 (AssistV)，它衡量人類修復分解解決方案的可行性和速度。我們收集了一個關於人類在不同分解解決方案上的修復經驗的數據集。利用收集到的數據作為上下文範例，我們接著學習批評、優化和排列分解的解決方案以改善 AssistV。我們在競爭性程式設計問題中驗證了我們的方法：在 177 小時的研究所需時間內，我們的辦法讓非專家解決了 33.3% 以上的問題，讓他們的速度提升了 3.3 倍，並讓他們的能力與未受協助的專家相匹配。", "author": "Jiaxin Wen et.al.", "authors": "Jiaxin Wen, Ruiqi Zhong, Pei Ke, Zhihong Shao, Hongning Wang, Minlie Huang", "id": "2406.04604v1", "paper_url": "http://arxiv.org/abs/2406.04604v1", "repo": "null"}}