{"2411.12072": {"publish_time": "2024-11-18", "title": "Zoomed In, Diffused Out: Towards Local Degradation-Aware Multi-Diffusion for Extreme Image Super-Resolution", "paper_summary": "Large-scale, pre-trained Text-to-Image (T2I) diffusion models have gained\nsignificant popularity in image generation tasks and have shown unexpected\npotential in image Super-Resolution (SR). However, most existing T2I diffusion\nmodels are trained with a resolution limit of 512x512, making scaling beyond\nthis resolution an unresolved but necessary challenge for image SR. In this\nwork, we introduce a novel approach that, for the first time, enables these\nmodels to generate 2K, 4K, and even 8K images without any additional training.\nOur method leverages MultiDiffusion, which distributes the generation across\nmultiple diffusion paths to ensure global coherence at larger scales, and local\ndegradation-aware prompt extraction, which guides the T2I model to reconstruct\nfine local structures according to its low-resolution input. These innovations\nunlock higher resolutions, allowing T2I diffusion models to be applied to image\nSR tasks without limitation on resolution.", "paper_summary_zh": "大規模預訓練的文字轉圖片 (T2I) 擴散模型在圖片生成任務中獲得顯著的普及，並在圖片超解析度 (SR) 中展現出意想不到的潛力。然而，現有的 T2I 擴散模型大多以 512x512 的解析度限制進行訓練，使得擴展到此解析度之外成為一個尚未解決但對於圖片 SR 而言必要的挑戰。在這項工作中，我們提出了一種新穎的方法，首次讓這些模型能夠在沒有任何額外訓練的情況下生成 2K、4K，甚至 8K 的圖片。我們的技術利用了多重擴散，將生成分布在多個擴散路徑上以確保大規模的整體一致性，以及局部降解感知提示提取，引導 T2I 模型根據其低解析度輸入重建精細的局部結構。這些創新解鎖了更高的解析度，讓 T2I 擴散模型可以應用於圖片 SR 任務，而沒有解析度的限制。", "author": "Brian B. Moser et.al.", "authors": "Brian B. Moser, Stanislav Frolov, Tobias C. Nauen, Federico Raue, Andreas Dengel", "id": "2411.12072v1", "paper_url": "http://arxiv.org/abs/2411.12072v1", "repo": "null"}}