{"2408.00103": {"publish_time": "2024-07-31", "title": "ReLiK: Retrieve and LinK, Fast and Accurate Entity Linking and Relation Extraction on an Academic Budget", "paper_summary": "Entity Linking (EL) and Relation Extraction (RE) are fundamental tasks in\nNatural Language Processing, serving as critical components in a wide range of\napplications. In this paper, we propose ReLiK, a Retriever-Reader architecture\nfor both EL and RE, where, given an input text, the Retriever module undertakes\nthe identification of candidate entities or relations that could potentially\nappear within the text. Subsequently, the Reader module is tasked to discern\nthe pertinent retrieved entities or relations and establish their alignment\nwith the corresponding textual spans. Notably, we put forward an innovative\ninput representation that incorporates the candidate entities or relations\nalongside the text, making it possible to link entities or extract relations in\na single forward pass and to fully leverage pre-trained language models\ncontextualization capabilities, in contrast with previous\nRetriever-Reader-based methods, which require a forward pass for each\ncandidate. Our formulation of EL and RE achieves state-of-the-art performance\nin both in-domain and out-of-domain benchmarks while using academic budget\ntraining and with up to 40x inference speed compared to competitors. Finally,\nwe show how our architecture can be used seamlessly for Information Extraction\n(cIE), i.e. EL + RE, and setting a new state of the art by employing a shared\nReader that simultaneously extracts entities and relations.", "paper_summary_zh": "實體連結 (EL) 和關係抽取 (RE) 是自然語言處理中的基本任務，在廣泛的應用中擔任關鍵組成部分。在本文中，我們提出 ReLiK，一種用於 EL 和 RE 的檢索器-閱讀器架構，其中，在給定輸入文字時，檢索器模組承擔潛在可能出現在文字中的候選實體或關係的識別。隨後，閱讀器模組被指派辨別相關的檢索實體或關係，並建立它們與對應文字區間的對齊。值得注意的是，我們提出了創新的輸入表示，將候選實體或關係與文字結合在一起，使得在單一前向傳遞中連結實體或抽取關係，並充分利用預先訓練的語言模型情境化能力成為可能，這與先前的檢索器-閱讀器方法形成對比，後者需要針對每個候選進行前向傳遞。我們對 EL 和 RE 的公式化在領域內和領域外基準測試中都達到了最先進的效能，同時使用學術預算訓練，並且與競爭者相比，推論速度高達 40 倍。最後，我們展示了我們的架構如何能無縫地用於資訊抽取 (cIE)，即 EL + RE，並透過採用同時抽取實體和關係的共用閱讀器來設定新的最先進技術。", "author": "Riccardo Orlando et.al.", "authors": "Riccardo Orlando, Pere-Lluis Huguet-Cabot, Edoardo Barba, Roberto Navigli", "id": "2408.00103v1", "paper_url": "http://arxiv.org/abs/2408.00103v1", "repo": "null"}}