{"2411.06837": {"publish_time": "2024-11-11", "title": "Persuasion with Large Language Models: a Survey", "paper_summary": "The rapid rise of Large Language Models (LLMs) has created new disruptive\npossibilities for persuasive communication, by enabling fully-automated\npersonalized and interactive content generation at an unprecedented scale. In\nthis paper, we survey the research field of LLM-based persuasion that has\nemerged as a result. We begin by exploring the different modes in which LLM\nSystems are used to influence human attitudes and behaviors. In areas such as\npolitics, marketing, public health, e-commerce, and charitable giving, such LLM\nSystems have already achieved human-level or even super-human persuasiveness.\nWe identify key factors influencing their effectiveness, such as the manner of\npersonalization and whether the content is labelled as AI-generated. We also\nsummarize the experimental designs that have been used to evaluate progress.\nOur survey suggests that the current and future potential of LLM-based\npersuasion poses profound ethical and societal risks, including the spread of\nmisinformation, the magnification of biases, and the invasion of privacy. These\nrisks underscore the urgent need for ethical guidelines and updated regulatory\nframeworks to avoid the widespread deployment of irresponsible and harmful LLM\nSystems.", "paper_summary_zh": "大型語言模型 (LLM) 的快速崛起為具有說服力的溝通創造了新的破壞性可能性，它能以前所未有的規模實現全自動化、個性化和互動式內容生成。在本文中，我們調查了由此產生的基於 LLM 的說服研究領域。我們首先探討了 LLM 系統用於影響人類態度和行為的不同模式。在政治、行銷、公共衛生、電子商務和慈善捐贈等領域，此類 LLM 系統已經達到人類水平甚至超人類的說服力。我們找出影響其有效性的關鍵因素，例如個性化的方式以及內容是否標示為 AI 生成的。我們也總結了用於評估進度的實驗設計。我們的調查表明，基於 LLM 的說服的當前和未來潛力帶來了深遠的倫理和社會風險，包括錯誤訊息的傳播、偏見的放大和隱私的侵犯。這些風險強調了制定道德準則和更新法規框架的迫切需要，以避免不負責任和有害的 LLM 系統的廣泛部署。", "author": "Alexander Rogiers et.al.", "authors": "Alexander Rogiers, Sander Noels, Maarten Buyl, Tijl De Bie", "id": "2411.06837v1", "paper_url": "http://arxiv.org/abs/2411.06837v1", "repo": "null"}}