{"2406.12454": {"publish_time": "2024-06-18", "title": "A Neural Column Generation Approach to the Vehicle Routing Problem with Two-Dimensional Loading and Last-In-First-Out Constraints", "paper_summary": "The vehicle routing problem with two-dimensional loading constraints\n(2L-CVRP) and the last-in-first-out (LIFO) rule presents significant practical\nand algorithmic challenges. While numerous heuristic approaches have been\nproposed to address its complexity, stemming from two NP-hard problems: the\nvehicle routing problem (VRP) and the two-dimensional bin packing problem\n(2D-BPP), less attention has been paid to developing exact algorithms. Bridging\nthis gap, this article presents an exact algorithm that integrates advanced\nmachine learning techniques, specifically a novel combination of attention and\nrecurrence mechanisms. This integration accelerates the state-of-the-art exact\nalgorithm by a median of 29.79% across various problem instances. Moreover, the\nproposed algorithm successfully resolves an open instance in the standard\ntest-bed, demonstrating significant improvements brought about by the\nincorporation of machine learning models. Code is available at\nhttps://github.com/xyfffff/NCG-for-2L-CVRP.", "paper_summary_zh": "具有二维装载限制的车辆路径问题 (2L-CVRP) 和后进先出 (LIFO) 规则提出了重大的实际和算法挑战。虽然已经提出了许多启发式方法来解决其复杂性，但这些方法源自两个 NP 难题：车辆路径问题 (VRP) 和二维装箱问题 (2D-BPP)，对开发精确算法的关注较少。为了弥补这一差距，本文提出了一种精确算法，该算法集成了先进的机器学习技术，特别是注意力和循环机制的新颖组合。这种集成将最先进的精确算法在各种问题实例中平均加速了 29.79%。此外，所提出的算法成功地解决了标准测试平台中的一个开放实例，展示了通过结合机器学习模型带来的重大改进。代码可在 https://github.com/xyfffff/NCG-for-2L-CVRP 获得。", "author": "Yifan Xia et.al.", "authors": "Yifan Xia, Xiangyi Zhang", "id": "2406.12454v1", "paper_url": "http://arxiv.org/abs/2406.12454v1", "repo": "https://github.com/xyfffff/NCG-for-2L-CVRP"}}