{"2502.13499": {"publish_time": "2025-02-19", "title": "Hidden Darkness in LLM-Generated Designs: Exploring Dark Patterns in Ecommerce Web Components Generated by LLMs", "paper_summary": "Recent work has highlighted the risks of LLM-generated content for a wide\nrange of harmful behaviors, including incorrect and harmful code. In this work,\nwe extend this by studying whether LLM-generated web design contains dark\npatterns. This work evaluated designs of ecommerce web components generated by\nfour popular LLMs: Claude, GPT, Gemini, and Llama. We tested 13 commonly used\necommerce components (e.g., search, product reviews) and used them as prompts\nto generate a total of 312 components across all models. Over one-third of\ngenerated components contain at least one dark pattern. The majority of dark\npattern strategies involve hiding crucial information, limiting users' actions,\nand manipulating them into making decisions through a sense of urgency. Dark\npatterns are also more frequently produced in components that are related to\ncompany interests. These findings highlight the need for interventions to\nprevent dark patterns during front-end code generation with LLMs and emphasize\nthe importance of expanding ethical design education to a broader audience.", "paper_summary_zh": "近期研究強調出 LLM 生成的內容對於各種有害行為的風險，包括不正確且有害的程式碼。在這項研究中，我們透過探討 LLM 生成的網頁設計是否包含惡意模式來延伸這項研究。這項研究評估了由四種常見 LLM 生成的電子商務網頁元件設計：Claude、GPT、Gemini 和 Llama。我們測試了 13 個常用的電子商務元件（例如搜尋、產品評論），並將它們用作提示，在所有模型中總共產生了 312 個元件。超過三分之一的已生成元件包含至少一個惡意模式。大多數惡意模式策略涉及隱藏關鍵資訊、限制使用者的操作，以及透過急迫感操縱他們做出決定。惡意模式也更常出現在與公司利益相關的元件中。這些發現強調了在 LLM 前端程式碼產生期間預防惡意模式的干預措施的必要性，並強調將道德設計教育擴展到更廣泛受眾的重要性。", "author": "Ziwei Chen et.al.", "authors": "Ziwei Chen, Jiawen Shen, Luna, Kristen Vaccaro", "id": "2502.13499v1", "paper_url": "http://arxiv.org/abs/2502.13499v1", "repo": "null"}}