{"2501.07108": {"publish_time": "2025-01-13", "title": "How GPT learns layer by layer", "paper_summary": "Large Language Models (LLMs) excel at tasks like language processing,\nstrategy games, and reasoning but struggle to build generalizable internal\nrepresentations essential for adaptive decision-making in agents. For agents to\neffectively navigate complex environments, they must construct reliable world\nmodels. While LLMs perform well on specific benchmarks, they often fail to\ngeneralize, leading to brittle representations that limit their real-world\neffectiveness. Understanding how LLMs build internal world models is key to\ndeveloping agents capable of consistent, adaptive behavior across tasks. We\nanalyze OthelloGPT, a GPT-based model trained on Othello gameplay, as a\ncontrolled testbed for studying representation learning. Despite being trained\nsolely on next-token prediction with random valid moves, OthelloGPT shows\nmeaningful layer-wise progression in understanding board state and gameplay.\nEarly layers capture static attributes like board edges, while deeper layers\nreflect dynamic tile changes. To interpret these representations, we compare\nSparse Autoencoders (SAEs) with linear probes, finding that SAEs offer more\nrobust, disentangled insights into compositional features, whereas linear\nprobes mainly detect features useful for classification. We use SAEs to decode\nfeatures related to tile color and tile stability, a previously unexamined\nfeature that reflects complex gameplay concepts like board control and\nlong-term planning. We study the progression of linear probe accuracy and tile\ncolor using both SAE's and linear probes to compare their effectiveness at\ncapturing what the model is learning. Although we begin with a smaller language\nmodel, OthelloGPT, this study establishes a framework for understanding the\ninternal representations learned by GPT models, transformers, and LLMs more\nbroadly. Our code is publicly available: https://github.com/ALT-JS/OthelloSAE.", "paper_summary_zh": "大型語言模型 (LLM) 在語言處理、策略遊戲和推理等任務中表現出色，但難以建立可適應代理決策制定中不可或缺的概括性內部表徵。代理要有效地應對複雜的環境，他們必須建構可靠的世界模型。雖然 LLM 在特定基準上表現良好，但它們常常無法概括，導致脆弱的表徵，限制了它們在現實世界中的有效性。了解 LLM 如何建構內部世界模型是開發在各項任務中具有一致、適應性行為的代理的關鍵。我們分析了 OthelloGPT，一個基於 GPT 的模型，它接受奧賽羅遊戲訓練，作為研究表徵學習的受控測試平台。儘管僅接受隨機有效移動的下一代預測訓練，OthelloGPT 仍顯示出在理解棋盤狀態和遊戲玩法方面有意義的逐層進展。早期層次捕捉靜態屬性，如棋盤邊緣，而較深層次則反映動態圖塊變化。為了詮釋這些表徵，我們將稀疏自動編碼器 (SAE) 與線性探測進行比較，發現 SAE 提供了對組成特徵更強健、更解開的見解，而線性探測主要檢測對分類有用的特徵。我們使用 SAE 來解碼與圖塊顏色和圖塊穩定性相關的特徵，這是一個以前未經檢驗的特徵，它反映了複雜的遊戲概念，如棋盤控制和長期規劃。我們使用 SAE 和線性探測研究線性探測準確度和圖塊顏色的進展，以比較它們在捕捉模型學習內容方面的有效性。雖然我們從較小的語言模型 OthelloGPT 開始，但這項研究為理解 GPT 模型、Transformer和 LLM 更廣泛學習的內部表徵建立了一個框架。我們的程式碼公開可用：https://github.com/ALT-JS/OthelloSAE。", "author": "Jason Du et.al.", "authors": "Jason Du, Kelly Hong, Alishba Imran, Erfan Jahanparast, Mehdi Khfifi, Kaichun Qiao", "id": "2501.07108v1", "paper_url": "http://arxiv.org/abs/2501.07108v1", "repo": "https://github.com/alt-js/othellosae"}}