{"2408.14262": {"publish_time": "2024-08-26", "title": "Self-supervised Speech Representations Still Struggle with African American Vernacular English", "paper_summary": "Underperformance of ASR systems for speakers of African American Vernacular\nEnglish (AAVE) and other marginalized language varieties is a well-documented\nphenomenon, and one that reinforces the stigmatization of these varieties. We\ninvestigate whether or not the recent wave of Self-Supervised Learning (SSL)\nspeech models can close the gap in ASR performance between AAVE and Mainstream\nAmerican English (MAE). We evaluate four SSL models (wav2vec 2.0, HuBERT,\nWavLM, and XLS-R) on zero-shot Automatic Speech Recognition (ASR) for these two\nvarieties and find that these models perpetuate the bias in performance against\nAAVE. Additionally, the models have higher word error rates on utterances with\nmore phonological and morphosyntactic features of AAVE. Despite the success of\nSSL speech models in improving ASR for low resource varieties, SSL pre-training\nalone may not bridge the gap between AAVE and MAE. Our code is publicly\navailable at https://github.com/cmu-llab/s3m-aave.", "paper_summary_zh": "非裔美國方言 (AAVE) 及其他邊緣語言變體的 ASR 系統表現不佳，這是一個有據可查的現象，而且會加劇這些變體的污名化。我們探討最近一波的自我監督學習 (SSL) 語音模型是否能縮小 AAVE 和主流美式英語 (MAE) 之間的 ASR 效能差距。我們針對這兩種變體評估四個 SSL 模型（wav2vec 2.0、HuBERT、WavLM 和 XLS-R）的零次自動語音辨識 (ASR)，發現這些模型會延續對 AAVE 的效能偏見。此外，這些模型對於具有更多 AAVE 音韻和形態句法特徵的語句，其字元錯誤率較高。儘管 SSL 語音模型在改善低資源變體的 ASR 方面取得成功，但僅靠 SSL 預訓練可能無法縮小 AAVE 和 MAE 之間的差距。我們的程式碼已公開發布於 https://github.com/cmu-llab/s3m-aave。", "author": "Kalvin Chang et.al.", "authors": "Kalvin Chang, Yi-Hui Chou, Jiatong Shi, Hsuan-Ming Chen, Nicole Holliday, Odette Scharenborg, David R. Mortensen", "id": "2408.14262v1", "paper_url": "http://arxiv.org/abs/2408.14262v1", "repo": "https://github.com/cmu-llab/s3m-aave"}}