{"2411.19479": {"publish_time": "2024-11-29", "title": "FLARE: Towards Universal Dataset Purification against Backdoor Attacks", "paper_summary": "Deep neural networks (DNNs) are susceptible to backdoor attacks, where\nadversaries poison datasets with adversary-specified triggers to implant hidden\nbackdoors, enabling malicious manipulation of model predictions. Dataset\npurification serves as a proactive defense by removing malicious training\nsamples to prevent backdoor injection at its source. We first reveal that the\ncurrent advanced purification methods rely on a latent assumption that the\nbackdoor connections between triggers and target labels in backdoor attacks are\nsimpler to learn than the benign features. We demonstrate that this assumption,\nhowever, does not always hold, especially in all-to-all (A2A) and untargeted\n(UT) attacks. As a result, purification methods that analyze the separation\nbetween the poisoned and benign samples in the input-output space or the final\nhidden layer space are less effective. We observe that this separability is not\nconfined to a single layer but varies across different hidden layers. Motivated\nby this understanding, we propose FLARE, a universal purification method to\ncounter various backdoor attacks. FLARE aggregates abnormal activations from\nall hidden layers to construct representations for clustering. To enhance\nseparation, FLARE develops an adaptive subspace selection algorithm to isolate\nthe optimal space for dividing an entire dataset into two clusters. FLARE\nassesses the stability of each cluster and identifies the cluster with higher\nstability as poisoned. Extensive evaluations on benchmark datasets demonstrate\nthe effectiveness of FLARE against 22 representative backdoor attacks,\nincluding all-to-one (A2O), all-to-all (A2A), and untargeted (UT) attacks, and\nits robustness to adaptive attacks.", "paper_summary_zh": "深度神经網路 (DNN) 容易遭受後門攻擊，其中對手會使用對手指定的觸發器來污染資料集，以植入隱藏的後門，進而惡意操縱模型預測。資料集淨化作為一項主動防禦措施，透過移除惡意的訓練樣本來防止後門注入。我們首先揭露，目前進階的淨化方法依賴於一個潛在假設，即後門攻擊中觸發器與目標標籤之間的後門連接比良性特徵更容易學習。然而，我們證明此假設並非總是成立，特別是在全對全 (A2A) 和非目標 (UT) 攻擊中。因此，分析輸入輸出空間或最終隱藏層空間中受污染和良性樣本之間分離度的淨化方法效果較差。我們觀察到，這種可分離性不限於單一層，而會在不同的隱藏層之間變化。基於這種理解，我們提出 FLARE，一種用於對抗各種後門攻擊的通用淨化方法。FLARE 從所有隱藏層聚合異常激活，以建構用於聚類的表示。為了增強分離，FLARE 開發了一種自適應子空間選擇演算法，用於隔離將整個資料集劃分為兩個群集的最佳空間。FLARE 評估每個群集的穩定性，並將穩定性較高的群集識別為受污染的群集。在基準資料集上的廣泛評估證明了 FLARE 對抗 22 種代表性後門攻擊的有效性，包括全對一 (A2O)、全對全 (A2A) 和非目標 (UT) 攻擊，以及其對自適應攻擊的魯棒性。", "author": "Linshan Hou et.al.", "authors": "Linshan Hou, Wei Luo, Zhongyun Hua, Songhua Chen, Leo Yu Zhang, Yiming Li", "id": "2411.19479v1", "paper_url": "http://arxiv.org/abs/2411.19479v1", "repo": "null"}}