{"2501.04899": {"publish_time": "2025-01-09", "title": "SUGAR: Leveraging Contextual Confidence for Smarter Retrieval", "paper_summary": "Bearing in mind the limited parametric knowledge of Large Language Models\n(LLMs), retrieval-augmented generation (RAG) which supplies them with the\nrelevant external knowledge has served as an approach to mitigate the issue of\nhallucinations to a certain extent. However, uniformly retrieving supporting\ncontext makes response generation source-inefficient, as triggering the\nretriever is not always necessary, or even inaccurate, when a model gets\ndistracted by noisy retrieved content and produces an unhelpful answer.\nMotivated by these issues, we introduce Semantic Uncertainty Guided Adaptive\nRetrieval (SUGAR), where we leverage context-based entropy to actively decide\nwhether to retrieve and to further determine between single-step and multi-step\nretrieval. Our empirical results show that selective retrieval guided by\nsemantic uncertainty estimation improves the performance across diverse\nquestion answering tasks, as well as achieves a more efficient inference.", "paper_summary_zh": "考量到大型語言模型（LLM）有限的參數知識，檢索增強生成（RAG）為其提供相關外部知識，在一定程度上作為減輕幻覺問題的方法。然而，統一檢索支援的內容會讓回應生成來源效率低下，因為當模型被有雜訊的檢索內容分散注意力並產生無益的答案時，觸發檢索器並非總是必要的，甚至是不準確的。在這些問題的激勵下，我們引入了語義不確定性引導的自適應檢索（SUGAR），我們利用基於內容的熵來主動決定是否檢索，並進一步確定單步和多步檢索之間的區別。我們的實證結果表明，由語義不確定性估計引導的有選擇性檢索改善了各種問題回答任務的效能，並實現了更有效率的推理。", "author": "Hanna Zubkova et.al.", "authors": "Hanna Zubkova, Ji-Hoon Park, Seong-Whan Lee", "id": "2501.04899v1", "paper_url": "http://arxiv.org/abs/2501.04899v1", "repo": "null"}}