{"2502.13632": {"publish_time": "2025-02-19", "title": "Concept Layers: Enhancing Interpretability and Intervenability via LLM Conceptualization", "paper_summary": "The opaque nature of Large Language Models (LLMs) has led to significant\nresearch efforts aimed at enhancing their interpretability, primarily through\npost-hoc methods. More recent in-hoc approaches, such as Concept Bottleneck\nModels (CBMs), offer both interpretability and intervenability by incorporating\nexplicit concept representations. However, these methods suffer from key\nlimitations, including reliance on labeled concept datasets and significant\narchitectural modifications that challenges re-integration into existing system\npipelines. In this work, we introduce a new methodology for incorporating\ninterpretability and intervenability into an existing model by integrating\nConcept Layers (CLs) into its architecture. Our approach projects the model's\ninternal vector representations into a conceptual, explainable vector space\nbefore reconstructing and feeding them back into the model. Furthermore, we\neliminate the need for a human-selected concept set by algorithmically\nsearching an ontology for a set of concepts that can be either task-specific or\ntask-agnostic. We evaluate CLs across multiple tasks, demonstrating that they\nmaintain the original model's performance and agreement while enabling\nmeaningful interventions. Additionally, we present a proof of concept\nshowcasing an intervenability interface, allowing users to adjust model\nbehavior dynamically, such as mitigating biases during inference.", "paper_summary_zh": "大型語言模型 (LLM) 的不透明本質已導致大量的研究工作，旨在透過後設方法提升其可解釋性。較新的內建方法，例如概念瓶頸模型 (CBM)，透過納入明確的概念表徵，同時提供可解釋性和可介入性。然而，這些方法有其主要的限制，包括依賴標記概念資料集，以及大幅的架構修改，對重新整合到現有的系統管線中構成挑戰。在這項工作中，我們提出了一種新的方法，透過將概念層 (CL) 整合到架構中，將可解釋性和可介入性納入現有模型。我們的做法是將模型的內部向量表徵投影到一個概念性的、可解釋的向量空間，然後再將其重建並回饋到模型中。此外，我們透過演算法搜尋本体，以尋找一組概念（可以是特定於任務或與任務無關），來消除對人類選擇概念集的需求。我們在多項任務中評估 CL，證明它們在維持原始模型的效能和一致性的同時，還能實現有意義的介入。此外，我們提出了一個概念驗證，展示了一個可介入性介面，讓使用者可以動態調整模型行為，例如在推理過程中減輕偏差。", "author": "Or Raphael Bidusa et.al.", "authors": "Or Raphael Bidusa, Shaul Markovitch", "id": "2502.13632v1", "paper_url": "http://arxiv.org/abs/2502.13632v1", "repo": "null"}}