{"2412.09722": {"publish_time": "2024-12-12", "title": "GReaTer: Gradients over Reasoning Makes Smaller Language Models Strong Prompt Optimizers", "paper_summary": "The effectiveness of large language models (LLMs) is closely tied to the\ndesign of prompts, making prompt optimization essential for enhancing their\nperformance across a wide range of tasks. Many existing approaches to\nautomating prompt engineering rely exclusively on textual feedback, refining\nprompts based solely on inference errors identified by large, computationally\nexpensive LLMs. Unfortunately, smaller models struggle to generate high-quality\nfeedback, resulting in complete dependence on large LLM judgment. Moreover,\nthese methods fail to leverage more direct and finer-grained information, such\nas gradients, due to operating purely in text space. To this end, we introduce\nGReaTer, a novel prompt optimization technique that directly incorporates\ngradient information over task-specific reasoning. By utilizing task loss\ngradients, GReaTer enables self-optimization of prompts for open-source,\nlightweight language models without the need for costly closed-source LLMs.\nThis allows high-performance prompt optimization without dependence on massive\nLLMs, closing the gap between smaller models and the sophisticated reasoning\noften needed for prompt refinement. Extensive evaluations across diverse\nreasoning tasks including BBH, GSM8k, and FOLIO demonstrate that GReaTer\nconsistently outperforms previous state-of-the-art prompt optimization methods,\neven those reliant on powerful LLMs. Additionally, GReaTer-optimized prompts\nfrequently exhibit better transferability and, in some cases, boost task\nperformance to levels comparable to or surpassing those achieved by larger\nlanguage models, highlighting the effectiveness of prompt optimization guided\nby gradients over reasoning. Code of GReaTer is available at\nhttps://github.com/psunlpgroup/GreaTer.", "paper_summary_zh": "大型語言模型 (LLM) 的效能與提示設計息息相關，因此提示最佳化對於提升 LLM 在各種任務中的表現至關重要。許多現有的自動化提示工程方法僅依賴文字回饋，根據大型、運算成本高昂的 LLM 識別出的推論錯誤來改進提示。不幸的是，較小的模型難以產生高品質的回饋，導致完全依賴大型 LLM 的判斷。此外，這些方法由於純粹在文字空間中運作，無法利用更直接、更細緻的資訊，例如梯度。為此，我們引入了 GReaTer，這是一種新穎的提示最佳化技術，可直接將梯度資訊納入特定任務的推理中。透過利用任務損失梯度，GReaTer 可以為開放原始碼、輕量級語言模型進行提示自最佳化，無需依賴昂貴的閉源 LLM。這允許執行高性能提示最佳化，而無需依賴大型 LLM，縮小了較小模型與提示改進通常需要的複雜推理之間的差距。在包括 BBH、GSM8k 和 FOLIO 在內的各種推理任務中進行的廣泛評估表明，GReaTer 一致優於先前的提示最佳化方法，即使是依賴強大 LLM 的方法也是如此。此外，GReaTer 最佳化的提示通常表現出更好的可移植性，在某些情況下，任務效能提升至與較大型語言模型相當或超越其效能的程度，突顯了透過推理梯度引導的提示最佳化的效能。GReaTer 的程式碼可在 https://github.com/psunlpgroup/GreaTer 取得。", "author": "Sarkar Snigdha Sarathi Das et.al.", "authors": "Sarkar Snigdha Sarathi Das, Ryo Kamoi, Bo Pang, Yusen Zhang, Caiming Xiong, Rui Zhang", "id": "2412.09722v1", "paper_url": "http://arxiv.org/abs/2412.09722v1", "repo": "null"}}