{"2501.06678": {"publish_time": "2025-01-12", "title": "Imbalanced Medical Image Segmentation with Pixel-dependent Noisy Labels", "paper_summary": "Accurate medical image segmentation is often hindered by noisy labels in\ntraining data, due to the challenges of annotating medical images. Prior\nresearch works addressing noisy labels tend to make class-dependent\nassumptions, overlooking the pixel-dependent nature of most noisy labels.\nFurthermore, existing methods typically apply fixed thresholds to filter out\nnoisy labels, risking the removal of minority classes and consequently\ndegrading segmentation performance. To bridge these gaps, our proposed\nframework, Collaborative Learning with Curriculum Selection (CLCS), addresses\npixel-dependent noisy labels with class imbalance. CLCS advances the existing\nworks by i) treating noisy labels as pixel-dependent and addressing them\nthrough a collaborative learning framework, and ii) employing a curriculum\ndynamic thresholding approach adapting to model learning progress to select\nclean data samples to mitigate the class imbalance issue, and iii) applying a\nnoise balance loss to noisy data samples to improve data utilization instead of\ndiscarding them outright. Specifically, our CLCS contains two modules:\nCurriculum Noisy Label Sample Selection (CNS) and Noise Balance Loss (NBL). In\nthe CNS module, we designed a two-branch network with discrepancy loss for\ncollaborative learning so that different feature representations of the same\ninstance could be extracted from distinct views and used to vote the class\nprobabilities of pixels. Besides, a curriculum dynamic threshold is adopted to\nselect clean-label samples through probability voting. In the NBL module,\ninstead of directly dropping the suspiciously noisy labels, we further adopt a\nrobust loss to leverage such instances to boost the performance.", "paper_summary_zh": "<paragraph>准确的医学影像分割通常会受到训练数据中标签有噪声的阻碍，这是因为对医学影像进行注释具有挑战性。解决标签有噪声的先前研究工作倾向于做出类相关的假设，而忽略了大多数标签有噪声的像素相关性质。此外，现有方法通常应用固定阈值来过滤掉标签有噪声，这有将少数类别的标签移除的风险，从而降低分割性能。为了弥合这些差距，我们提出的框架，即具有课程选择的协作学习 (CLCS)，解决了类别不平衡的像素相关标签有噪声的问题。CLCS 通过以下方式提升了现有工作：i) 将标签有噪声视为像素相关，并通过协作学习框架解决它们，ii) 采用课程动态阈值化方法，适应模型学习进度，选择干净的数据样本以减轻类别不平衡问题，以及 iii) 对标签有噪声的数据样本应用噪声平衡损失，以提高数据利用率，而不是直接丢弃它们。具体而言，我们的 CLCS 包含两个模块：课程标签有噪声样本选择 (CNS) 和噪声平衡损失 (NBL)。在 CNS 模块中，我们设计了一个具有差异损失的两分支网络，用于协作学习，以便可以从不同的视图中提取同一实例的不同特征表示，并用于投票像素的类别概率。此外，采用课程动态阈值通过概率投票选择干净标签样本。在 NBL 模块中，我们没有直接丢弃可疑的标签有噪声，而是进一步采用鲁棒损失来利用此类实例以提升性能。</paragraph>", "author": "Erjian Guo et.al.", "authors": "Erjian Guo, Zicheng Wang, Zhen Zhao, Luping Zhou", "id": "2501.06678v1", "paper_url": "http://arxiv.org/abs/2501.06678v1", "repo": "https://github.com/erjian96/clcs"}}