{"2502.10707": {"publish_time": "2025-02-15", "title": "Reading Your Heart: Learning ECG Words and Sentences via Pre-training ECG Language Model", "paper_summary": "Electrocardiogram (ECG) is essential for the clinical diagnosis of\narrhythmias and other heart diseases, but deep learning methods based on ECG\noften face limitations due to the need for high-quality annotations. Although\nprevious ECG self-supervised learning (eSSL) methods have made significant\nprogress in representation learning from unannotated ECG data, they typically\ntreat ECG signals as ordinary time-series data, segmenting the signals using\nfixed-size and fixed-step time windows, which often ignore the form and rhythm\ncharacteristics and latent semantic relationships in ECG signals. In this work,\nwe introduce a novel perspective on ECG signals, treating heartbeats as words\nand rhythms as sentences. Based on this perspective, we first designed the\nQRS-Tokenizer, which generates semantically meaningful ECG sentences from the\nraw ECG signals. Building on these, we then propose HeartLang, a novel\nself-supervised learning framework for ECG language processing, learning\ngeneral representations at form and rhythm levels. Additionally, we construct\nthe largest heartbeat-based ECG vocabulary to date, which will further advance\nthe development of ECG language processing. We evaluated HeartLang across six\npublic ECG datasets, where it demonstrated robust competitiveness against other\neSSL methods. Our data and code are publicly available at\nhttps://github.com/PKUDigitalHealth/HeartLang.", "paper_summary_zh": "心電圖 (ECG) 對於心律不整和其他心臟疾病的臨床診斷至關重要，但基於心電圖的深度學習方法通常會因需要高品質註解而面臨限制。儘管先前的 ECG 自我監督學習 (eSSL) 方法在從未註解的 ECG 資料中學習表徵方面取得顯著進展，但它們通常將 ECG 訊號視為普通的時間序列資料，使用固定大小和固定步長的時窗對訊號進行分段，這通常會忽略 ECG 訊號中的形式和節律特徵以及潛在的語義關係。在這項工作中，我們對 ECG 訊號引入了新的觀點，將心跳視為單字，將節律視為句子。基於此觀點，我們首先設計了 QRS-Tokenizer，它從原始 ECG 訊號中產生語義有意義的 ECG 句子。在此基礎上，我們提出了 HeartLang，一種用於 ECG 語言處理的新型自我監督學習框架，在形式和節律層面上學習一般表徵。此外，我們構建了迄今為止最大的基於心跳的 ECG 詞彙表，這將進一步促進 ECG 語言處理的發展。我們在六個公開的 ECG 資料集上評估了 HeartLang，它展示了與其他 eSSL 方法相比的強大競爭力。我們的資料和程式碼可在 https://github.com/PKUDigitalHealth/HeartLang 公開取得。", "author": "Jiarui Jin et.al.", "authors": "Jiarui Jin, Haoyu Wang, Hongyan Li, Jun Li, Jiahui Pan, Shenda Hong", "id": "2502.10707v1", "paper_url": "http://arxiv.org/abs/2502.10707v1", "repo": "null"}}