{"2412.04871": {"publish_time": "2024-12-06", "title": "Building a Family of Data Augmentation Models for Low-cost LLM Fine-tuning on the Cloud", "paper_summary": "Specializing LLMs in various domain-specific tasks has emerged as a critical\nstep towards achieving high performance. However, the construction and\nannotation of datasets in specific domains are always very costly. Apart from\nusing superior and expensive closed-source LLM APIs to construct datasets, some\nopen-source models have become strong enough to handle dataset construction in\nmany scenarios. Thus, we present a family of data augmentation models designed\nto significantly improve the efficiency for model fine-tuning. These models,\ntrained based on sufficiently small LLMs, support key functionalities with low\ninference costs: instruction expansion, instruction refinement, and\ninstruction-response pair expansion. To fulfill this goal, we first construct\nan automatic data collection system with seed datasets generated from both\npublic repositories and our in-house datasets. This system leverages powerful\nLLMs to expand, refine and re-write the instructions and responses,\nincorporating quality assessment techniques. Following this, we introduce the\ntraining process of our models, which effectively distills task-solving and\ntext synthesis abilities from teacher LLMs. Finally, we demonstrate how we\nintegrate these functionalities into a machine learning platform to support\nlow-cost LLM fine-tuning from both dataset preparation and training\nperspectives for users. Experiments and an application study prove the\neffectiveness of our approach.", "paper_summary_zh": "將 LLM 專門用於各種特定領域任務已成為實現高性能的一項關鍵步驟。然而，在特定領域構建和註解資料集的成本總是十分高昂。除了使用優越且昂貴的封閉原始碼 LLM API 來構建資料集之外，一些開放原始碼模型已變得足夠強大，足以在許多場景中處理資料集構建。因此，我們提出了一系列數據擴充模型，旨在顯著提高模型微調的效率。這些模型基於足夠小的 LLM 進行訓練，支援具有低推論成本的主要功能：指令擴充、指令改進和指令回應配對擴充。為實現此目標，我們首先使用從公共儲存庫和我們內部資料集產生的種子資料集構建自動數據收集系統。此系統利用強大的 LLM 來擴充、改進和重寫指令和回應，並納入品質評估技術。在此之後，我們介紹了我們模型的訓練過程，該過程有效地從教師 LLM 中提煉了解決任務和文字合成能力。最後，我們展示了如何將這些功能整合到機器學習平台中，以支援使用者從資料集準備和訓練角度進行低成本 LLM 微調。實驗和應用研究證明了我們方法的有效性。", "author": "Yuanhao Yue et.al.", "authors": "Yuanhao Yue, Chengyu Wang, Jun Huang, Peng Wang", "id": "2412.04871v1", "paper_url": "http://arxiv.org/abs/2412.04871v1", "repo": "null"}}