{"2410.11290": {"publish_time": "2024-10-15", "title": "Backdoor Attack on Vertical Federated Graph Neural Network Learning", "paper_summary": "Federated Graph Neural Network (FedGNN) is a privacy-preserving machine\nlearning technology that combines federated learning (FL) and graph neural\nnetworks (GNNs). It offers a privacy-preserving solution for training GNNs\nusing isolated graph data. Vertical Federated Graph Neural Network (VFGNN) is\nan important branch of FedGNN, where data features and labels are distributed\namong participants, and each participant has the same sample space. Due to the\ndifficulty of accessing and modifying distributed data and labels, the\nvulnerability of VFGNN to backdoor attacks remains largely unexplored. In this\ncontext, we propose BVG, the first method for backdoor attacks in VFGNN.\nWithout accessing or modifying labels, BVG uses multi-hop triggers and requires\nonly four target class nodes for an effective backdoor attack. Experiments show\nthat BVG achieves high attack success rates (ASR) across three datasets and\nthree different GNN models, with minimal impact on main task accuracy (MTA). We\nalso evaluate several defense methods, further validating the robustness and\neffectiveness of BVG. This finding also highlights the need for advanced\ndefense mechanisms to counter sophisticated backdoor attacks in practical VFGNN\napplications.", "paper_summary_zh": "聯邦圖形神經網路（FedGNN）是一種隱私保護機器\n學習技術，它結合了聯邦學習（FL）和圖形神經\n網路（GNN）。它提供了一個隱私保護的解決方案，用於訓練 GNN\n使用孤立的圖形資料。垂直聯合圖形神經網路（VFGNN）是\nFedGNN 的一個重要分支，其中資料特徵和標籤分佈\n在參與者之間，每個參與者都有相同的樣本空間。由於\n難以存取和修改分佈式資料和標籤，VFGNN 對後門攻擊的\n脆弱性在很大程度上仍未被探索。在此背景下，我們提出 BVG，這\n是 VFGNN 中後門攻擊的第一種方法。在不存取或修改標籤的情況下，\nBVG 使用多跳觸發器，並且只需要四個目標類別節點即可進行有效的後門攻擊。\n實驗表明，BVG 在三個資料集和三個不同的 GNN 模型中實現了很高的攻擊成功率 (ASR)，\n對主要任務準確度 (MTA) 的影響最小。我們\n還評估了幾種防禦方法，進一步驗證了 BVG 的穩健性和\n有效性。這一發現也強調了在實際 VFGNN\n應用中應對複雜後門攻擊的需要。", "author": "Jirui Yang et.al.", "authors": "Jirui Yang, Peng Chen, Zhihui Lu, Ruijun Deng, Qiang Duan, Jianping Zeng", "id": "2410.11290v1", "paper_url": "http://arxiv.org/abs/2410.11290v1", "repo": "null"}}