{"2408.07904": {"publish_time": "2024-08-15", "title": "Assessing Language Models' Worldview for Fiction Generation", "paper_summary": "The use of Large Language Models (LLMs) has become ubiquitous, with abundant\napplications in computational creativity. One such application is fictional\nstory generation. Fiction is a narrative that occurs in a story world that is\nslightly different than ours. With LLMs becoming writing partners, we question\nhow suitable they are to generate fiction. This study investigates the ability\nof LLMs to maintain a state of world essential to generate fiction. Through a\nseries of questions to nine LLMs, we find that only two models exhibit\nconsistent worldview, while the rest are self-conflicting. Subsequent analysis\nof stories generated by four models revealed a strikingly uniform narrative\npattern. This uniformity across models further suggests a lack of `state'\nnecessary for fiction. We highlight the limitations of current LLMs in fiction\nwriting and advocate for future research to test and create story worlds for\nLLMs to reside in. All code, dataset, and the generated responses can be found\nin https://github.com/tanny411/llm-reliability-and-consistency-evaluation.", "paper_summary_zh": "大型語言模型 (LLM) 的使用已變得無處不在，在計算創意中擁有豐富的應用。其中一項應用就是虛構故事生成。虛構是一種發生在與我們略有不同的故事世界中的敘述。隨著 LLM 成為寫作夥伴，我們質疑它們是否適合產生虛構作品。本研究調查了 LLM 維持對產生虛構作品至關重要的世界狀態的能力。通過向九個 LLM 提出了一系列問題，我們發現只有兩個模型表現出一致的世界觀，而其餘的則自相矛盾。隨後對四個模型產生的故事進行的分析揭示了一個顯著統一的敘事模式。跨模型的這種統一性進一步表明缺乏虛構所必需的「狀態」。我們強調了當前 LLM 在虛構寫作中的局限性，並提倡未來的研究來測試和創建故事世界，供 LLM 存在。所有代碼、數據集和生成的回應都可以在 https://github.com/tanny411/llm-reliability-and-consistency-evaluation 中找到。", "author": "Aisha Khatun et.al.", "authors": "Aisha Khatun, Daniel G. Brown", "id": "2408.07904v1", "paper_url": "http://arxiv.org/abs/2408.07904v1", "repo": "https://github.com/tanny411/llm-reliability-and-consistency-evaluation"}}