{"2502.12995": {"publish_time": "2025-02-18", "title": "Free Argumentative Exchanges for Explaining Image Classifiers", "paper_summary": "Deep learning models are powerful image classifiers but their opacity hinders\ntheir trustworthiness. Explanation methods for capturing the reasoning process\nwithin these classifiers faithfully and in a clear manner are scarce, due to\ntheir sheer complexity and size. We provide a solution for this problem by\ndefining a novel method for explaining the outputs of image classifiers with\ndebates between two agents, each arguing for a particular class. We obtain\nthese debates as concrete instances of Free Argumentative eXchanges (FAXs), a\nnovel argumentation-based multi-agent framework allowing agents to internalise\nopinions by other agents differently than originally stated. We define two\nmetrics (consensus and persuasion rate) to assess the usefulness of FAXs as\nargumentative explanations for image classifiers. We then conduct a number of\nempirical experiments showing that FAXs perform well along these metrics as\nwell as being more faithful to the image classifiers than conventional,\nnon-argumentative explanation methods. All our implementations can be found at\nhttps://github.com/koriavinash1/FAX.", "paper_summary_zh": "深度學習模型是強大的影像分類器，但其不透明性阻礙了其可信度。由於其極高的複雜性和規模，忠實且清楚地捕捉這些分類器內部推理過程的解釋方法很少見。我們透過定義一種新穎的方法來解決這個問題，該方法透過兩個代理之間的辯論來解釋影像分類器的輸出，每個代理都主張一個特定類別。我們將這些辯論作為自由論證交換 (FAX) 的具體實例，這是一個新穎的基於論證的多代理架構，允許代理以不同於原始陳述的方式內化其他代理的意見。我們定義了兩個指標（共識率和說服率）來評估 FAX 作為影像分類器論證解釋的有用性。然後，我們進行了多項實證實驗，表明 FAX 在這些指標上表現良好，並且比傳統的非論證解釋方法更忠實於影像分類器。我們所有的實作都可以在 https://github.com/koriavinash1/FAX 中找到。", "author": "Avinash Kori et.al.", "authors": "Avinash Kori, Antonio Rago, Francesca Toni", "id": "2502.12995v1", "paper_url": "http://arxiv.org/abs/2502.12995v1", "repo": "null"}}