{"2501.08429": {"publish_time": "2025-01-14", "title": "Modeling Discrimination with Causal Abstraction", "paper_summary": "A person is directly racially discriminated against only if her race caused\nher worse treatment. This implies that race is an attribute sufficiently\nseparable from other attributes to isolate its causal role. But race is\nembedded in a nexus of social factors that resist isolated treatment. If race\nis socially constructed, in what sense can it cause worse treatment? Some\npropose that the perception of race, rather than race itself, causes worse\ntreatment. Others suggest that since causal models require modularity, i.e. the\nability to isolate causal effects, attempts to causally model discrimination\nare misguided.\n  This paper addresses the problem differently. We introduce a framework for\nreasoning about discrimination, in which race is a high-level abstraction of\nlower-level features. In this framework, race can be modeled as itself causing\nworse treatment. Modularity is ensured by allowing assumptions about social\nconstruction to be precisely and explicitly stated, via an alignment between\nrace and its constituents. Such assumptions can then be subjected to normative\nand empirical challenges, which lead to different views of when discrimination\noccurs. By distinguishing constitutive and causal relations, the abstraction\nframework pinpoints disagreements in the current literature on modeling\ndiscrimination, while preserving a precise causal account of discrimination.", "paper_summary_zh": "一個人只有在她的種族導致她受到更差的待遇時，才會直接受到種族歧視。這意味著種族是一個與其他屬性足夠分離的屬性，可以孤立其因果關係。但種族根植於一個抵抗孤立對待的社會因素網絡中。如果種族是社會建構的，那麼它在什麼意義上會導致更差的待遇？有些人提出，種族本身，而不是種族的認知，會導致更差的待遇。另一些人則認為，由於因果模型需要模組化，即隔離因果效應的能力，因此嘗試對歧視進行因果建模是錯誤的。\n本文以不同的方式解決這個問題。我們引入了一個推理歧視的框架，其中種族是低層級特徵的高層級抽象。在這個框架中，種族可以被建模為本身導致更差的待遇。通過允許對社會建構的假設通過種族及其組成部分之間的一致性進行精確和明確的陳述，確保了模組化。然後，這些假設可以受到規範性和經驗性挑戰，這會導致對何時發生歧視的不同看法。通過區分構成性和因果關係，抽象框架指出了當前歧視建模文獻中的分歧，同時保留了對歧視的精確因果說明。", "author": "Milan Mossé et.al.", "authors": "Milan Mossé, Kara Schechtman, Frederick Eberhardt, Thomas Icard", "id": "2501.08429v1", "paper_url": "http://arxiv.org/abs/2501.08429v1", "repo": "null"}}