{"2411.01841": {"publish_time": "2024-11-04", "title": "Leveraging Label Semantics and Meta-Label Refinement for Multi-Label Question Classification", "paper_summary": "Accurate annotation of educational resources is critical in the rapidly\nadvancing field of online education due to the complexity and volume of\ncontent. Existing classification methods face challenges with semantic overlap\nand distribution imbalance of labels in the multi-label context, which impedes\neffective personalized learning and resource recommendation. This paper\nintroduces RR2QC, a novel Retrieval Reranking method To multi-label Question\nClassification by leveraging label semantics and meta-label refinement.\nFirstly, RR2QC leverages semantic relationships within and across label groups\nto enhance pre-training strategie in multi-label context. Next, a class center\nlearning task is introduced, integrating label texts into downstream training\nto ensure questions consistently align with label semantics, retrieving the\nmost relevant label sequences. Finally, this method decomposes labels into\nmeta-labels and trains a meta-label classifier to rerank the retrieved label\nsequences. In doing so, RR2QC enhances the understanding and prediction\ncapability of long-tail labels by learning from meta-labels frequently\nappearing in other labels. Addtionally, a Math LLM is used to generate\nsolutions for questions, extracting latent information to further refine the\nmodel's insights. Experimental results demonstrate that RR2QC outperforms\nexisting classification methods in Precision@k and F1 scores across multiple\neducational datasets, establishing it as a potent enhancement for online\neducational content utilization.", "paper_summary_zh": "<paragraph>在快速發展的線上教育領域中，準確標註教育資源至關重要，這是因為內容的複雜性和數量。現有的分類方法在多標籤情境中面臨語意重疊和標籤分佈不平衡的挑戰，這阻礙了有效的個人化學習和資源推薦。本文介紹了 RR2QC，一種新穎的檢索重新排序方法，通過利用標籤語意和元標籤優化來進行多標籤問題分類。首先，RR2QC 利用標籤組內部和組間的語義關係來增強多標籤情境中的預訓練策略。接下來，引入了類別中心學習任務，將標籤文字整合到下游訓練中，以確保問題始終與標籤語意保持一致，並檢索最相關的標籤序列。最後，此方法將標籤分解為元標籤，並訓練元標籤分類器對檢索到的標籤序列進行重新排序。這樣一來，RR2QC 通過學習經常出現在其他標籤中的元標籤，增強了對長尾標籤的理解和預測能力。此外，數學 LLM 用於為問題生成解決方案，提取潛在資訊以進一步優化模型的見解。實驗結果表明，RR2QC 在多個教育資料集中的 Precision@k 和 F1 分數方面優於現有的分類方法，確立了其作為線上教育內容利用的強大增強功能。</paragraph>", "author": "Shi Dong et.al.", "authors": "Shi Dong, Xiaobei Niu, Rui Zhong, Zhifeng Wang, Mingzhang Zuo", "id": "2411.01841v1", "paper_url": "http://arxiv.org/abs/2411.01841v1", "repo": "null"}}