{"2409.16252": {"publish_time": "2024-09-24", "title": "Fields of The World: A Machine Learning Benchmark Dataset For Global Agricultural Field Boundary Segmentation", "paper_summary": "Crop field boundaries are foundational datasets for agricultural monitoring\nand assessments but are expensive to collect manually. Machine learning (ML)\nmethods for automatically extracting field boundaries from remotely sensed\nimages could help realize the demand for these datasets at a global scale.\nHowever, current ML methods for field instance segmentation lack sufficient\ngeographic coverage, accuracy, and generalization capabilities. Further,\nresearch on improving ML methods is restricted by the lack of labeled datasets\nrepresenting the diversity of global agricultural fields. We present Fields of\nThe World (FTW) -- a novel ML benchmark dataset for agricultural field instance\nsegmentation spanning 24 countries on four continents (Europe, Africa, Asia,\nand South America). FTW is an order of magnitude larger than previous datasets\nwith 70,462 samples, each containing instance and semantic segmentation masks\npaired with multi-date, multi-spectral Sentinel-2 satellite images. We provide\nresults from baseline models for the new FTW benchmark, show that models\ntrained on FTW have better zero-shot and fine-tuning performance in held-out\ncountries than models that aren't pre-trained with diverse datasets, and show\npositive qualitative zero-shot results of FTW models in a real-world scenario\n-- running on Sentinel-2 scenes over Ethiopia.", "paper_summary_zh": "作物田界線是農業監測和評估的基本資料集，但人工收集成本昂貴。機器學習 (ML) 方法可自動從遙測影像中萃取田界線，有助於在全球規模實現這些資料集的需求。然而，目前的田區實例分割 ML 方法缺乏足夠的地理覆蓋範圍、準確度和概化能力。此外，改善 ML 方法的研究受到標記資料集缺乏代表全球農業田區多樣性的限制。我們提出世界田野 (FTW)——一種新的 ML 基準資料集，用於橫跨四大洲 (歐洲、非洲、亞洲和南美洲) 24 個國家的農業田區實例分割。FTW 的規模比先前的資料集大一個數量級，有 70,462 個樣本，每個樣本都包含實例和語義分割遮罩，並與多日期、多光譜 Sentinel-2 衛星影像配對。我們提供了新的 FTW 基準的基準模型結果，顯示在 FTW 上訓練的模型在未見過資料的國家中擁有比未經多樣化資料集預先訓練的模型更好的零次學習和微調效能，並在真實世界的場景中顯示 FTW 模型的正面定性零次學習結果——在衣索比亞上執行 Sentinel-2 場景。", "author": "Hannah Kerner et.al.", "authors": "Hannah Kerner, Snehal Chaudhari, Aninda Ghosh, Caleb Robinson, Adeel Ahmad, Eddie Choi, Nathan Jacobs, Chris Holmes, Matthias Mohr, Rahul Dodhia, Juan M. Lavista Ferres, Jennifer Marcus", "id": "2409.16252v1", "paper_url": "http://arxiv.org/abs/2409.16252v1", "repo": "null"}}