{"2405.16852": {"publish_time": "2024-05-27", "title": "EM Distillation for One-step Diffusion Models", "paper_summary": "While diffusion models can learn complex distributions, sampling requires a\ncomputationally expensive iterative process. Existing distillation methods\nenable efficient sampling, but have notable limitations, such as performance\ndegradation with very few sampling steps, reliance on training data access, or\nmode-seeking optimization that may fail to capture the full distribution. We\npropose EM Distillation (EMD), a maximum likelihood-based approach that\ndistills a diffusion model to a one-step generator model with minimal loss of\nperceptual quality. Our approach is derived through the lens of\nExpectation-Maximization (EM), where the generator parameters are updated using\nsamples from the joint distribution of the diffusion teacher prior and inferred\ngenerator latents. We develop a reparametrized sampling scheme and a noise\ncancellation technique that together stabilizes the distillation process. We\nfurther reveal an interesting connection of our method with existing methods\nthat minimize mode-seeking KL. EMD outperforms existing one-step generative\nmethods in terms of FID scores on ImageNet-64 and ImageNet-128, and compares\nfavorably with prior work on distilling text-to-image diffusion models.", "paper_summary_zh": "儘管擴散模型可以學習複雜的分布，但取樣需要一個計算成本昂貴的迭代過程。現有的蒸餾方法能夠進行有效率的取樣，但有明顯的限制，例如在取樣步驟非常少時效能下降、依賴訓練資料存取，或是尋求模式的最佳化可能會無法捕捉到完整的分布。我們提出 EM 蒸餾 (EMD)，一種基於最大似然估計的方法，將擴散模型蒸餾成一個步驟生成器模型，同時將感知品質的損失降到最低。我們的做法是透過期望最大化 (EM) 的觀點衍生而來，其中生成器參數使用擴散教師先驗和推論生成器潛在變數的聯合分布中的樣本來更新。我們開發出一個重新參數化的取樣方案和一個雜訊消除技術，它們共同穩定蒸餾過程。我們進一步揭示了我們的方法與最小化尋求模式 KL 的現有方法之間的有趣連結。EMD 在 ImageNet-64 和 ImageNet-128 上的 FID 分數方面優於現有的單步生成方法，並且與先前蒸餾文本到影像擴散模型的研究相比，表現也相當不錯。", "author": "Sirui Xie et.al.", "authors": "Sirui Xie, Zhisheng Xiao, Diederik P Kingma, Tingbo Hou, Ying Nian Wu, Kevin Patrick Murphy, Tim Salimans, Ben Poole, Ruiqi Gao", "id": "2405.16852v1", "paper_url": "http://arxiv.org/abs/2405.16852v1", "repo": "null"}}