{"2412.04682": {"publish_time": "2024-12-06", "title": "Two stages domain invariant representation learners solve the large co-variate shift in unsupervised domain adaptation with two dimensional data domains", "paper_summary": "Recent developments in the unsupervised domain adaptation (UDA) enable the\nunsupervised machine learning (ML) prediction for target data, thus this will\naccelerate real world applications with ML models such as image recognition\ntasks in self-driving. Researchers have reported the UDA techniques are not\nworking well under large co-variate shift problems where e.g. supervised source\ndata consists of handwritten digits data in monotone color and unsupervised\ntarget data colored digits data from the street view. Thus there is a need for\na method to resolve co-variate shift and transfer source labelling rules under\nthis dynamics. We perform two stages domain invariant representation learning\nto bridge the gap between source and target with semantic intermediate data\n(unsupervised). The proposed method can learn domain invariant features\nsimultaneously between source and intermediate also intermediate and target.\nFinally this achieves good domain invariant representation between source and\ntarget plus task discriminability owing to source labels. This induction for\nthe gradient descent search greatly eases learning convergence in terms of\nclassification performance for target data even when large co-variate shift. We\nalso derive a theorem for measuring the gap between trained models and\nunsupervised target labelling rules, which is necessary for the free parameters\noptimization. Finally we demonstrate that proposing method is superiority to\nprevious UDA methods using 4 representative ML classification datasets\nincluding 38 UDA tasks. Our experiment will be a basis for challenging UDA\nproblems with large co-variate shift.", "paper_summary_zh": "最近在無監督領域適應 (UDA) 的發展，使得無監督機器學習 (ML) 預測可應用於目標資料，因此這將加速 ML 模型的實際應用，例如自駕車中的影像辨識任務。研究人員報告指出，UDA 技術在大型共變異數轉移問題下無法順利運作，例如監督來源資料包含單色手寫數字資料，而無監督目標資料則包含來自街景的彩色數字資料。因此，需要一種方法來解決共變異數轉移，並在此動態下轉移來源標籤規則。我們執行兩階段網域不變表示學習，以透過語意中間資料（無監督）來彌合來源與目標之間的差距。所提出的方法可以在來源與中間，以及中間與目標之間同時學習網域不變特徵。最後，這在來源標籤的幫助下，達到了來源與目標之間良好的網域不變表示，以及任務可辨別性。這種用於梯度下降搜尋的歸納，即使在大型共變異數轉移的情況下，也能大幅簡化目標資料分類效能的學習收斂。我們也推導了一個用於測量訓練模型與無監督目標標籤規則之間差距的定理，這對於自由參數最佳化而言是必要的。最後，我們證明了所提出的方法優於先前的 UDA 方法，使用 4 個具代表性的 ML 分類資料集，其中包括 38 個 UDA 任務。我們的實驗將成為挑戰具有大型共變異數轉移的 UDA 問題的基礎。", "author": "Hisashi Oshima et.al.", "authors": "Hisashi Oshima, Tsuyoshi Ishizone, Tomoyuki Higuchi", "id": "2412.04682v1", "paper_url": "http://arxiv.org/abs/2412.04682v1", "repo": "https://github.com/oh-yu/domain-invariant-learning"}}