{"2502.06751": {"publish_time": "2025-02-10", "title": "What makes a good feedforward computational graph?", "paper_summary": "As implied by the plethora of literature on graph rewiring, the choice of\ncomputational graph employed by a neural network can make a significant impact\non its downstream performance. Certain effects related to the computational\ngraph, such as under-reaching and over-squashing, may even render the model\nincapable of learning certain functions. Most of these effects have only been\nthoroughly studied in the domain of undirected graphs; however, recent years\nhave seen a significant rise in interest in feedforward computational graphs:\ndirected graphs without any back edges. In this paper, we study the desirable\nproperties of a feedforward computational graph, discovering two important\ncomplementary measures: fidelity and mixing time, and evaluating a few popular\nchoices of graphs through the lens of these measures. Our study is backed by\nboth theoretical analyses of the metrics' asymptotic behaviour for various\ngraphs, as well as correlating these metrics to the performance of trained\nneural network models using the corresponding graphs.", "paper_summary_zh": "根據圖形重新連接的豐富文獻所暗示，神經網路採用的計算圖形選擇可能會對其下游效能產生重大影響。與計算圖形相關的某些效應，例如低於預期和過度壓縮，甚至可能導致模型無法學習某些功能。其中大多數效應僅在無向圖的領域中得到徹底研究；然而，近年來，對前饋計算圖形（無任何反向邊緣的有向圖）的興趣顯著增加。在本文中，我們研究了前饋計算圖形所需的特性，發現了兩個重要的互補測量：保真度和混合時間，並透過這些測量的角度評估幾個流行的圖形選擇。我們的研究既得到對各種圖形指標漸近行為的理論分析的支持，也得到將這些指標與使用對應圖形訓練的神經網路模型效能相關聯的支持。", "author": "Alex Vitvitskyi et.al.", "authors": "Alex Vitvitskyi, João G. M. Araújo, Marc Lackenby, Petar Veličković", "id": "2502.06751v1", "paper_url": "http://arxiv.org/abs/2502.06751v1", "repo": "null"}}