{"2407.04601": {"publish_time": "2024-07-05", "title": "Written Term Detection Improves Spoken Term Detection", "paper_summary": "End-to-end (E2E) approaches to keyword search (KWS) are considerably simpler\nin terms of training and indexing complexity when compared to approaches which\nuse the output of automatic speech recognition (ASR) systems. This\nsimplification however has drawbacks due to the loss of modularity. In\nparticular, where ASR-based KWS systems can benefit from external unpaired text\nvia a language model, current formulations of E2E KWS systems have no such\nmechanism. Therefore, in this paper, we propose a multitask training objective\nwhich allows unpaired text to be integrated into E2E KWS without complicating\nindexing and search. In addition to training an E2E KWS model to retrieve text\nqueries from spoken documents, we jointly train it to retrieve text queries\nfrom masked written documents. We show empirically that this approach can\neffectively leverage unpaired text for KWS, with significant improvements in\nsearch performance across a wide variety of languages. We conduct analysis\nwhich indicates that these improvements are achieved because the proposed\nmethod improves document representations for words in the unpaired text.\nFinally, we show that the proposed method can be used for domain adaptation in\nsettings where in-domain paired data is scarce or nonexistent.", "paper_summary_zh": "端對端 (E2E) 關鍵字搜尋 (KWS) 方法在訓練和索引複雜度方面比使用自動語音辨識 (ASR) 系統結果的方法簡單許多。然而，這種簡化由於模組化的喪失而有其缺點。特別是，基於 ASR 的 KWS 系統可以透過語言模型從外部未配對文字中受益，目前 E2E KWS 系統的公式化並無此機制。因此，在本文中，我們提出了一個多任務訓練目標，允許將未配對文字整合到 E2E KWS 中，而不會使索引和搜尋複雜化。除了訓練 E2E KWS 模型從口述文件中擷取文字查詢之外，我們還聯合訓練它從遮罩書面文件中擷取文字查詢。我們透過經驗證明，此方法可以有效地利用未配對文字進行 KWS，在各種語言中大幅提升搜尋效能。我們進行的分析指出，這些提升之所以達成，是因為所提出的方法改進了未配對文字中單字的文件表示。最後，我們展示所提出的方法可用於領域適應，在其中網域內配對資料稀少或不存在的情況下。", "author": "Bolaji Yusuf et.al.", "authors": "Bolaji Yusuf, Murat Saraçlar", "id": "2407.04601v1", "paper_url": "http://arxiv.org/abs/2407.04601v1", "repo": "https://github.com/bolajiy/golden-retriever"}}