{"2407.09088": {"publish_time": "2024-07-12", "title": "FD-SOS: Vision-Language Open-Set Detectors for Bone Fenestration and Dehiscence Detection from Intraoral Images", "paper_summary": "Accurate detection of bone fenestration and dehiscence (FD) is crucial for\neffective treatment planning in dentistry. While cone-beam computed tomography\n(CBCT) is the gold standard for evaluating FD, it comes with limitations such\nas radiation exposure, limited accessibility, and higher cost compared to\nintraoral images. In intraoral images, dentists face challenges in the\ndifferential diagnosis of FD. This paper presents a novel and clinically\nsignificant application of FD detection solely from intraoral images. To\nachieve this, we propose FD-SOS, a novel open-set object detector for FD\ndetection from intraoral images. FD-SOS has two novel components: conditional\ncontrastive denoising (CCDN) and teeth-specific matching assignment (TMA).\nThese modules enable FD-SOS to effectively leverage external dental semantics.\nExperimental results showed that our method outperformed existing detection\nmethods and surpassed dental professionals by 35% recall under the same level\nof precision. Code is available at: https://github.com/xmed-lab/FD-SOS.", "paper_summary_zh": "骨骼穿孔和骨缺損 (FD) 的準確偵測對於牙科的有效治療計畫至關重要。錐形束電腦斷層掃描 (CBCT) 雖然是評估 FD 的黃金標準，但它存在著諸如輻射曝露、取得不易和與口腔內影像相比成本較高等限制。在口腔內影像中，牙醫師在 FD 的鑑別診斷中面臨挑戰。本文提出了一個創新且臨床上重要的應用，可僅從口腔內影像中偵測 FD。為達成此目標，我們提出 FD-SOS，這是一種用於從口腔內影像中偵測 FD 的新型開放式物件偵測器。FD-SOS 有兩個新穎的組成部分：條件對比去噪 (CCDN) 和特定於牙齒的匹配指定 (TMA)。這些模組使 FD-SOS 能有效利用外部牙科語義。實驗結果顯示，我們的技術優於現有的偵測技術，且在相同的準確度下，比牙科專業人員高出 35% 的召回率。程式碼可在 https://github.com/xmed-lab/FD-SOS 取得。", "author": "Marawan Elbatel et.al.", "authors": "Marawan Elbatel, Keyuan Liu, Yanqi Yang, Xiaomeng Li", "id": "2407.09088v1", "paper_url": "http://arxiv.org/abs/2407.09088v1", "repo": "null"}}