{"2411.14371": {"publish_time": "2024-11-21", "title": "Synthesising Robust Controllers for Robot Collectives with Recurrent Tasks: A Case Study", "paper_summary": "When designing correct-by-construction controllers for autonomous\ncollectives, three key challenges are the task specification, the modelling,\nand its use at practical scale. In this paper, we focus on a simple yet useful\nabstraction for high-level controller synthesis for robot collectives with\noptimisation goals (e.g., maximum cleanliness, minimum energy consumption) and\nrecurrence (e.g., re-establish contamination and charge thresholds) and safety\n(e.g., avoid full discharge, mutually exclusive room occupation) constraints.\nDue to technical limitations (related to scalability and using constraints in\nthe synthesis), we simplify our graph-based setting from a stochastic\ntwo-player game into a single-player game on a partially observable Markov\ndecision process (POMDP). Robustness against environmental uncertainty is\nencoded via partial observability. Linear-time correctness properties are\nverified separately after synthesising the POMDP strategy. We contribute\nat-scale guidance on POMDP modelling and controller synthesis for tasked robot\ncollectives exemplified by the scenario of battery-driven robots responsible\nfor cleaning public buildings with utilisation constraints.", "paper_summary_zh": "在為自主集體設計正確的建構控制器時，有三個主要的挑戰：任務規範、建模，以及在實際規模下的使用。在本文中，我們專注於一個簡單但有用的抽象化，用於具有最佳化目標（例如，最大清潔度、最低能源消耗）和遞迴（例如，重新建立污染和充電閾值）以及安全（例如，避免完全放電、相互排斥的房間佔用）約束的機器人集體的高階控制器合成。由於技術限制（與擴充性和在合成中使用約束有關），我們將基於圖表的設定從隨機雙人遊戲簡化為部分可觀察馬可夫決策過程 (POMDP) 中的單人遊戲。對環境不確定性的魯棒性通過部分可觀察性編碼。線性時間正確性屬性在合成 POMDP 策略後單獨驗證。我們為任務機器人集體的 POMDP 建模和控制器合成提供了大規模指導，這些集體以負責在利用約束下清潔公共建築的電池驅動機器人為例。", "author": "Till Schnittka et.al.", "authors": "Till Schnittka, Mario Gleirscher", "id": "2411.14371v1", "paper_url": "http://arxiv.org/abs/2411.14371v1", "repo": "null"}}