{"2409.12150": {"publish_time": "2024-09-18", "title": "Decoding Style: Efficient Fine-Tuning of LLMs for Image-Guided Outfit Recommendation with Preference", "paper_summary": "Personalized outfit recommendation remains a complex challenge, demanding\nboth fashion compatibility understanding and trend awareness. This paper\npresents a novel framework that harnesses the expressive power of large\nlanguage models (LLMs) for this task, mitigating their \"black box\" and static\nnature through fine-tuning and direct feedback integration. We bridge the item\nvisual-textual gap in items descriptions by employing image captioning with a\nMultimodal Large Language Model (MLLM). This enables the LLM to extract style\nand color characteristics from human-curated fashion images, forming the basis\nfor personalized recommendations. The LLM is efficiently fine-tuned on the\nopen-source Polyvore dataset of curated fashion images, optimizing its ability\nto recommend stylish outfits. A direct preference mechanism using negative\nexamples is employed to enhance the LLM's decision-making process. This creates\na self-enhancing AI feedback loop that continuously refines recommendations in\nline with seasonal fashion trends. Our framework is evaluated on the Polyvore\ndataset, demonstrating its effectiveness in two key tasks: fill-in-the-blank,\nand complementary item retrieval. These evaluations underline the framework's\nability to generate stylish, trend-aligned outfit suggestions, continuously\nimproving through direct feedback. The evaluation results demonstrated that our\nproposed framework significantly outperforms the base LLM, creating more\ncohesive outfits. The improved performance in these tasks underscores the\nproposed framework's potential to enhance the shopping experience with accurate\nsuggestions, proving its effectiveness over the vanilla LLM based outfit\ngeneration.", "paper_summary_zh": "<paragraph>個人化服裝推薦仍然是一項複雜的挑戰，既需要對時尚相容性有深入的了解，又需要了解趨勢。本文提出了一個新穎的框架，利用大型語言模型 (LLM) 的表達能力來執行這項任務，透過微調和直接回饋整合來減輕其「黑盒子」和靜態性質。我們透過使用具有多模態大型語言模型 (MLLM) 的影像標題，來彌合項目視覺與文字在項目描述中的差距。這使 LLM 能夠從人工策展的時尚影像中提取風格和色彩特徵，作為個人化推薦的基礎。LLM 在策展時尚影像的開源 Polyvore 資料集上進行了高效的微調，優化了其推薦時尚服裝的能力。使用負面範例的直接偏好機制被用來增強 LLM 的決策過程。這創造了一個自我增強的 AI 回饋迴路，根據季節性時尚趨勢不斷優化推薦。我們的框架在 Polyvore 資料集上進行了評估，證明了其在兩個關鍵任務中的有效性：填空和互補項目檢索。這些評估強調了該框架生成時尚、符合趨勢的服裝建議的能力，並透過直接回饋不斷改進。評估結果表明，我們提出的框架顯著優於基礎 LLM，創造出更具凝聚力的服裝。在這些任務中改進的效能突顯了所提出的框架在透過準確的建議增強購物體驗方面的潛力，證明了其優於基於香草 LLM 的服裝生成的效能。</paragraph>", "author": "Najmeh Forouzandehmehr et.al.", "authors": "Najmeh Forouzandehmehr, Nima Farrokhsiar, Ramin Giahi, Evren Korpeoglu, Kannan Achan", "id": "2409.12150v1", "paper_url": "http://arxiv.org/abs/2409.12150v1", "repo": "null"}}