{"2411.14972": {"publish_time": "2024-11-22", "title": "Open-Amp: Synthetic Data Framework for Audio Effect Foundation Models", "paper_summary": "This paper introduces Open-Amp, a synthetic data framework for generating\nlarge-scale and diverse audio effects data. Audio effects are relevant to many\nmusical audio processing and Music Information Retrieval (MIR) tasks, such as\nmodelling of analog audio effects, automatic mixing, tone matching and\ntranscription. Existing audio effects datasets are limited in scope, usually\nincluding relatively few audio effects processors and a limited amount of input\naudio signals. Our proposed framework overcomes these issues, by crowdsourcing\nneural network emulations of guitar amplifiers and effects, created by users of\nopen-source audio effects emulation software. This allows users of Open-Amp\ncomplete control over the input signals to be processed by the effects models,\nas well as providing high-quality emulations of hundreds of devices. Open-Amp\ncan render audio online during training, allowing great flexibility in data\naugmentation. Our experiments show that using Open-Amp to train a guitar\neffects encoder achieves new state-of-the-art results on multiple guitar\neffects classification tasks. Furthermore, we train a one-to-many guitar\neffects model using Open-Amp, and use it to emulate unseen analog effects via\nmanipulation of its learned latent space, indicating transferability to analog\nguitar effects data.", "paper_summary_zh": "本文介紹 Open-Amp，一種用於生成大規模且多樣化音效資料的合成資料架構。音效與許多音樂音訊處理和音樂資訊檢索 (MIR) 任務相關，例如類比音效建模、自動混音、音色匹配和轉錄。現有的音效資料集範圍有限，通常只包含相對較少的音效處理器和有限的輸入音訊訊號。我們提出的架構克服了這些問題，透過群眾外包由開源音效模擬軟體使用者建立的吉他擴大器和效果的神經網路模擬。這讓 Open-Amp 的使用者可以完全控制要由效果模型處理的輸入訊號，並提供數百種裝置的高品質模擬。Open-Amp 能在訓練期間線上渲染音訊，讓資料擴充極具彈性。我們的實驗顯示，使用 Open-Amp 訓練吉他效果編碼器在多個吉他效果分類任務中達成新的最先進成果。此外，我們使用 Open-Amp 訓練一個一對多的吉他效果模型，並使用它透過操作其學習到的潛在空間來模擬未見的類比效果，表示可轉移到類比吉他效果資料。", "author": "Alec Wright et.al.", "authors": "Alec Wright, Alistair Carson, Lauri Juvela", "id": "2411.14972v1", "paper_url": "http://arxiv.org/abs/2411.14972v1", "repo": "null"}}