{"2411.02344": {"publish_time": "2024-11-04", "title": "Seq-VCR: Preventing Collapse in Intermediate Transformer Representations for Enhanced Reasoning", "paper_summary": "Decoder-only Transformers often struggle with complex reasoning tasks,\nparticularly arithmetic reasoning requiring multiple sequential operations. In\nthis work, we identify representation collapse in the model's intermediate\nlayers as a key factor limiting their reasoning capabilities. To address this,\nwe propose Sequential Variance-Covariance Regularization (Seq-VCR), which\nenhances the entropy of intermediate representations and prevents collapse.\nCombined with dummy pause tokens as substitutes for chain-of-thought (CoT)\ntokens, our method significantly improves performance in arithmetic reasoning\nproblems. In the challenging $5 \\times 5$ integer multiplication task, our\napproach achieves $99.5\\%$ exact match accuracy, outperforming models of the\nsame size (which yield $0\\%$ accuracy) and GPT-4 with five-shot CoT prompting\n($44\\%$). We also demonstrate superior results on arithmetic expression and\nlongest increasing subsequence (LIS) datasets. Our findings highlight the\nimportance of preventing intermediate layer representation collapse to enhance\nthe reasoning capabilities of Transformers and show that Seq-VCR offers an\neffective solution without requiring explicit CoT supervision.", "paper_summary_zh": "僅解碼器 Transformer 通常難以應付複雜的推理任務，特別是需要多個順序運算的算術推理。在此研究中，我們發現模型中間層的表徵崩潰是限制其推理能力的一個關鍵因素。為了解決此問題，我們提出了順序變異協方差規範化 (Seq-VCR)，它增強了中間表徵的熵並防止崩潰。我們的這種方法結合了作為思想鏈 (CoT) 標記的替換項的虛擬暫停標記，大幅改善了算術推理問題的效能。在具有挑戰性的 $5 \\times 5$ 整數乘法任務中，我們的做法達到了 $99.5\\%$ 的精確匹配準確度，優於同等規模的模型（產生 $0\\%$ 的準確度）和具有五次 CoT 提示的 GPT-4（$44\\%$）。我們也在算術表達式和最長遞增子序列 (LIS) 資料集上證明了優異的結果。我們的發現強調了防止中間層表徵崩潰以增強 Transformer 的推理能力的重要性，並顯示 Seq-VCR 提供了一個有效的解決方案，而不需要明確的 CoT 監督。", "author": "Md Rifat Arefin et.al.", "authors": "Md Rifat Arefin, Gopeshh Subbaraj, Nicolas Gontier, Yann LeCun, Irina Rish, Ravid Shwartz-Ziv, Christopher Pal", "id": "2411.02344v1", "paper_url": "http://arxiv.org/abs/2411.02344v1", "repo": "null"}}