{"2409.07930": {"publish_time": "2024-09-12", "title": "A convolutional neural network approach to deblending seismic data", "paper_summary": "For economic and efficiency reasons, blended acquisition of seismic data is\nbecoming more and more commonplace. Seismic deblending methods are always\ncomputationally demanding and normally consist of multiple processing steps.\nBesides, the parameter setting is not always trivial. Machine learning-based\nprocessing has the potential to significantly reduce processing time and to\nchange the way seismic deblending is carried out. We present a data-driven deep\nlearning-based method for fast and efficient seismic deblending. The blended\ndata are sorted from the common source to the common channel domain to\ntransform the character of the blending noise from coherent events to\nincoherent distributions. A convolutional neural network (CNN) is designed\naccording to the special character of seismic data, and performs deblending\nwith comparable results to those obtained with conventional industry deblending\nalgorithms. To ensure authenticity, the blending was done numerically and only\nfield seismic data were employed, including more than 20000 training examples.\nAfter training and validation of the network, seismic deblending can be\nperformed in near real time. Experiments also show that the initial signal to\nnoise ratio (SNR) is the major factor controlling the quality of the final\ndeblended result. The network is also demonstrated to be robust and adaptive by\nusing the trained model to firstly deblend a new data set from a different\ngeological area with a slightly different delay time setting, and secondly\ndeblend shots with blending noise in the top part of the data.", "paper_summary_zh": "<paragraph>基於經濟和效率考量，混合式地震資料取得正變得越來越普遍。地震去混合方法通常在計算上要求很高，且通常包含多個處理步驟。此外，參數設定並不總是微不足道的。基於機器學習的處理有潛力顯著減少處理時間，並改變地震去混合的執行方式。我們提出一個資料驅動的深度學習方法，用於快速且有效率的地震去混合。混合資料從共用來源排序到共用通道網域，將混合雜訊的特性從相干事件轉換為非相干分佈。根據地震資料的特殊特性設計了一個卷積神經網路 (CNN)，並執行去混合，其結果可與傳統產業去混合演算法所獲得的結果相提並論。為了確保真實性，混合是以數值方式完成，且僅採用現場地震資料，其中包含超過 20000 個訓練範例。在網路訓練和驗證後，地震去混合可以在近乎即時的情況下執行。實驗也顯示，初始訊號雜訊比 (SNR) 是控制最終去混合結果品質的主要因素。透過使用訓練好的模型，首先去混合來自不同地質區域的新資料集，並使用稍微不同的延遲時間設定，其次去混合資料頂部具有混合雜訊的射擊，證明了該網路的強健性和適應性。</paragraph>", "author": "Jing Sun et.al.", "authors": "Jing Sun, Sigmund Slang, Thomas Elboth, Thomas Larsen Greiner, Steven McDonald, Leiv-J Gelius", "id": "2409.07930v1", "paper_url": "http://arxiv.org/abs/2409.07930v1", "repo": "null"}}