{"2411.11843": {"publish_time": "2024-11-18", "title": "Bi-Mamba: Towards Accurate 1-Bit State Space Models", "paper_summary": "The typical selective state-space model (SSM) of Mamba addresses several\nlimitations of Transformers, such as quadratic computational complexity with\nsequence length and significant inference-time memory requirements due to the\nkey-value cache. However, the growing size of Mamba models continues to pose\ntraining and deployment challenges and raises environmental concerns due to\nconsiderable energy consumption. In this work, we introduce Bi-Mamba, a\nscalable and powerful 1-bit Mamba architecture designed for more efficient\nlarge language models with multiple sizes across 780M, 1.3B, and 2.7B. Bi-Mamba\nmodels are trained from scratch on data volume as regular LLM pertaining using\nan autoregressive distillation loss. Extensive experimental results on language\nmodeling demonstrate that Bi-Mamba achieves performance comparable to its\nfull-precision counterparts (e.g., FP16 or BF16) and much better accuracy than\npost-training-binarization (PTB) Mamba baselines, while significantly reducing\nmemory footprint and energy consumption compared to the original Mamba model.\nOur study pioneers a new linear computational complexity LLM framework under\nlow-bit representation and facilitates the future design of specialized\nhardware tailored for efficient 1-bit Mamba-based LLMs.", "paper_summary_zh": "典型的 Mamba 選擇性狀態空間模型 (SSM) 處理了 Transformer 的幾個限制，例如二次計算複雜度與序列長度和由於鍵值快取而導致的顯著推論時間記憶體需求。然而，Mamba 模型日益增長的規模持續對訓練和部署造成挑戰，並由於可觀的能耗而引發環境問題。在這項工作中，我們介紹了 Bi-Mamba，一種可擴充且強大的 1 位元 Mamba 架構，針對更有效率的大型語言模型而設計，具有 780M、1.3B 和 2.7B 等多種大小。Bi-Mamba 模型從頭開始訓練，資料量與使用自迴歸蒸餾損失相關的常規 LLM 相同。語言建模的廣泛實驗結果證明，與其全精度對應物（例如 FP16 或 BF16）相比，Bi-Mamba 達到了相當的效能，而且比訓練後二元化 (PTB) Mamba 基準的準確度高出許多，同時與原始 Mamba 模型相比，顯著減少了記憶體佔用空間和能耗。我們的研究開創了一個新的線性計算複雜度 LLM 框架，在低位元表示下，並促進了針對有效率的 1 位元 Mamba 基礎 LLM 而量身打造的專用硬體的未來設計。", "author": "Shengkun Tang et.al.", "authors": "Shengkun Tang, Liqun Ma, Haonan Li, Mingjie Sun, Zhiqiang Shen", "id": "2411.11843v1", "paper_url": "http://arxiv.org/abs/2411.11843v1", "repo": "null"}}