{"2410.03429": {"publish_time": "2024-10-04", "title": "How Hard is this Test Set? NLI Characterization by Exploiting Training Dynamics", "paper_summary": "Natural Language Inference (NLI) evaluation is crucial for assessing language\nunderstanding models; however, popular datasets suffer from systematic spurious\ncorrelations that artificially inflate actual model performance. To address\nthis, we propose a method for the automated creation of a challenging test set\nwithout relying on the manual construction of artificial and unrealistic\nexamples. We categorize the test set of popular NLI datasets into three\ndifficulty levels by leveraging methods that exploit training dynamics. This\ncategorization significantly reduces spurious correlation measures, with\nexamples labeled as having the highest difficulty showing markedly decreased\nperformance and encompassing more realistic and diverse linguistic phenomena.\nWhen our characterization method is applied to the training set, models trained\nwith only a fraction of the data achieve comparable performance to those\ntrained on the full dataset, surpassing other dataset characterization\ntechniques. Our research addresses limitations in NLI dataset construction,\nproviding a more authentic evaluation of model performance with implications\nfor diverse NLU applications.", "paper_summary_zh": "自然語言推論 (NLI) 評估對於評估語言理解模型至關重要；然而，熱門資料集存在系統性的虛假相關性，這會人為地提升實際模型效能。為了解決這個問題，我們提出一個自動建立具挑戰性測試集的方法，而不需要人工建構不自然且不切實際的範例。我們透過利用訓練動態的方法，將熱門 NLI 資料集的測試集分類成三個難度等級。這種分類大幅降低虛假相關性測量，標記為難度最高級別的範例顯示出效能顯著下降，且包含更多現實且多樣的語言現象。當我們的特徵化方法套用於訓練集時，僅使用部分資料訓練的模型就能達到與使用完整資料集訓練的模型相近的效能，超越其他資料集特徵化技術。我們的研究解決了 NLI 資料集建構的限制，提供更真實的模型效能評估，並對各種 NLU 應用產生影響。", "author": "Adrian Cosma et.al.", "authors": "Adrian Cosma, Stefan Ruseti, Mihai Dascalu, Cornelia Caragea", "id": "2410.03429v1", "paper_url": "http://arxiv.org/abs/2410.03429v1", "repo": "null"}}