{"2406.16437": {"publish_time": "2024-06-24", "title": "Theory on Mixture-of-Experts in Continual Learning", "paper_summary": "Continual learning (CL) has garnered significant attention because of its\nability to adapt to new tasks that arrive over time. Catastrophic forgetting\n(of old tasks) has been identified as a major issue in CL, as the model adapts\nto new tasks. The Mixture-of-Experts (MoE) model has recently been shown to\neffectively mitigate catastrophic forgetting in CL, by employing a gating\nnetwork to sparsify and distribute diverse tasks among multiple experts.\nHowever, there is a lack of theoretical analysis of MoE and its impact on the\nlearning performance in CL. This paper provides the first theoretical results\nto characterize the impact of MoE in CL via the lens of overparameterized\nlinear regression tasks. We establish the benefit of MoE over a single expert\nby proving that the MoE model can diversify its experts to specialize in\ndifferent tasks, while its router learns to select the right expert for each\ntask and balance the loads across all experts. Our study further suggests an\nintriguing fact that the MoE in CL needs to terminate the update of the gating\nnetwork after sufficient training rounds to attain system convergence, which is\nnot needed in the existing MoE studies that do not consider the continual task\narrival. Furthermore, we provide explicit expressions for the expected\nforgetting and overall generalization error to characterize the benefit of MoE\nin the learning performance in CL. Interestingly, adding more experts requires\nadditional rounds before convergence, which may not enhance the learning\nperformance. Finally, we conduct experiments on both synthetic and real\ndatasets to extend these insights from linear models to deep neural networks\n(DNNs), which also shed light on the practical algorithm design for MoE in CL.", "paper_summary_zh": "持續學習 (CL) 因其適應隨著時間推移而出現的新任務的能力而備受關注。災難性遺忘 (舊任務) 已被確定為 CL 中的一個主要問題，因為模型適應新任務。混合專家 (MoE) 模型最近被證明可以有效減輕 CL 中的災難性遺忘，方法是採用閘控網路在多個專家之間稀疏化和分配不同的任務。然而，缺乏對 MoE 及其對 CL 中學習效能影響的理論分析。本文提供了第一個理論結果，透過過度參數化線性回歸任務的視角來描述 MoE 在 CL 中的影響。我們透過證明 MoE 模型可以使其專家多樣化以專精於不同的任務，同時其路由器學會為每個任務選擇正確的專家並平衡所有專家的負載，來確立 MoE 優於單一專家的優點。我們的研究進一步表明了一個有趣的事實，CL 中的 MoE 需要在足夠的訓練回合後終止閘控網路的更新，以達到系統收斂，這在不考慮持續任務到來的現有 MoE 研究中是不需要的。此外，我們提供了預期遺忘和整體泛化誤差的明確表達式，以描述 MoE 在 CL 中學習效能的優點。有趣的是，增加更多專家需要在收斂前進行額外的回合，這可能不會增強學習效能。最後，我們在合成和真實資料集上進行實驗，將這些見解從線性模型延伸到深度神經網路 (DNN)，這也為 MoE 在 CL 中的實務演算法設計提供了啟示。", "author": "Hongbo Li et.al.", "authors": "Hongbo Li, Sen Lin, Lingjie Duan, Yingbin Liang, Ness B. Shroff", "id": "2406.16437v1", "paper_url": "http://arxiv.org/abs/2406.16437v1", "repo": "null"}}