{"2407.21264": {"publish_time": "2024-07-31", "title": "Model Attribution in Machine-Generated Disinformation: A Domain Generalization Approach with Supervised Contrastive Learning", "paper_summary": "Model attribution for machine-generated disinformation poses a significant\nchallenge in understanding its origins and mitigating its spread. This task is\nespecially challenging because modern large language models (LLMs) produce\ndisinformation with human-like quality. Additionally, the diversity in\nprompting methods used to generate disinformation complicates accurate source\nattribution. These methods introduce domain-specific features that can mask the\nfundamental characteristics of the models. In this paper, we introduce the\nconcept of model attribution as a domain generalization problem, where each\nprompting method represents a unique domain. We argue that an effective\nattribution model must be invariant to these domain-specific features. It\nshould also be proficient in identifying the originating models across all\nscenarios, reflecting real-world detection challenges. To address this, we\nintroduce a novel approach based on Supervised Contrastive Learning. This\nmethod is designed to enhance the model's robustness to variations in prompts\nand focuses on distinguishing between different source LLMs. We evaluate our\nmodel through rigorous experiments involving three common prompting methods:\n``open-ended'', ``rewriting'', and ``paraphrasing'', and three advanced LLMs:\n``llama 2'', ``chatgpt'', and ``vicuna''. Our results demonstrate the\neffectiveness of our approach in model attribution tasks, achieving\nstate-of-the-art performance across diverse and unseen datasets.", "paper_summary_zh": "機器產生的錯誤訊息的模型歸因對了解其起源和減輕其傳播構成重大挑戰。這項任務特別具有挑戰性，因為現代大型語言模型 (LLM) 會產生具有類人品質的錯誤訊息。此外，用於產生錯誤訊息的提示方法的多樣性使得準確的來源歸因變得複雜。這些方法引入了特定於領域的功能，這些功能可能會掩蓋模型的基本特徵。在本文中，我們將模型歸因的概念引入為領域概化問題，其中每個提示方法代表一個獨特的領域。我們認為，一個有效的歸因模型必須不變於這些特定於領域的功能。它還應該能夠識別所有場景中的原始模型，反映現實世界的偵測挑戰。為了解決這個問題，我們引入了一個基於監督對比學習的新方法。此方法旨在增強模型對提示變化的魯棒性，並專注於區分不同的來源 LLM。我們透過涉及三種常見提示方法的嚴格實驗來評估我們的模型：``開放式''、``重寫''和``改寫''，以及三種進階 LLM：``llama 2''、``chatgpt''和``vicuna''。我們的結果證明了我們的方法在模型歸因任務中的有效性，在多樣化且未見的資料集上實現了最先進的效能。", "author": "Alimohammad Beigi et.al.", "authors": "Alimohammad Beigi, Zhen Tan, Nivedh Mudiam, Canyu Chen, Kai Shu, Huan Liu", "id": "2407.21264v1", "paper_url": "http://arxiv.org/abs/2407.21264v1", "repo": "null"}}