{"2405.05295": {"publish_time": "2024-05-08", "title": "Relevant Irrelevance: Generating Alterfactual Explanations for Image Classifiers", "paper_summary": "In this paper, we demonstrate the feasibility of alterfactual explanations\nfor black box image classifiers. Traditional explanation mechanisms from the\nfield of Counterfactual Thinking are a widely-used paradigm for Explainable\nArtificial Intelligence (XAI), as they follow a natural way of reasoning that\nhumans are familiar with. However, most common approaches from this field are\nbased on communicating information about features or characteristics that are\nespecially important for an AI's decision. However, to fully understand a\ndecision, not only knowledge about relevant features is needed, but the\nawareness of irrelevant information also highly contributes to the creation of\na user's mental model of an AI system. To this end, a novel approach for\nexplaining AI systems called alterfactual explanations was recently proposed on\na conceptual level. It is based on showing an alternative reality where\nirrelevant features of an AI's input are altered. By doing so, the user\ndirectly sees which input data characteristics can change arbitrarily without\ninfluencing the AI's decision. In this paper, we show for the first time that\nit is possible to apply this idea to black box models based on neural networks.\nTo this end, we present a GAN-based approach to generate these alterfactual\nexplanations for binary image classifiers. Further, we present a user study\nthat gives interesting insights on how alterfactual explanations can complement\ncounterfactual explanations.", "paper_summary_zh": "<paragraph>在本文中，我們展示了黑盒子影像分類器的反事實解釋的可行性。來自反事實思考領域的傳統解釋機制是廣泛用於可解釋人工智慧 (XAI) 的典範，因為它們遵循人類熟悉的自然推理方式。然而，這個領域最常見的方法是基於傳達關於對 AI 決策特別重要的特徵或特性的資訊。但是，要完全理解一個決策，不僅需要關於相關特徵的知識，而且對無關資訊的認識也有助於建立使用者對 AI 系統的心智模式。為此，最近在概念層面上提出了一種稱為反事實解釋的新方法來解釋 AI 系統。它是基於展示一個替代現實，其中 AI 輸入的無關特徵被改變。藉由這樣做，使用者可以直接看到哪些輸入資料特性可以在不影響 AI 決策的情況下任意改變。在本文中，我們首次展示了將這個想法應用於基於神經網路的黑盒子模型是可行的。為此，我們提出了一個基於 GAN 的方法來為二元影像分類器產生這些反事實解釋。此外，我們提出了一項使用者研究，提供了關於反事實解釋如何補充反事實解釋的有趣見解。</paragraph>", "author": "Silvan Mertes et.al.", "authors": "Silvan Mertes, Tobias Huber, Christina Karle, Katharina Weitz, Ruben Schlagowski, Cristina Conati, Elisabeth André", "id": "2405.05295v1", "paper_url": "http://arxiv.org/abs/2405.05295v1", "repo": "null"}}