{"2411.11667": {"publish_time": "2024-11-18", "title": "Dissecting Misalignment of Multimodal Large Language Models via Influence Function", "paper_summary": "Multi-modal Large Language models (MLLMs) are always trained on data from\ndiverse and unreliable sources, which may contain misaligned or mislabeled\ntext-image pairs. This frequently causes robustness issues and hallucinations,\nleading to performance degradation. Data valuation is an efficient way to\ndetect and trace these misalignments. Nevertheless, existing methods are\ncomputationally expensive for MLLMs. While computationally efficient, the\nclassical influence functions are inadequate for contrastive learning models\nbecause they were originally designed for pointwise loss. Additionally,\ncontrastive learning involves minimizing the distance between the modalities of\npositive samples and maximizing the distance between the modalities of negative\nsamples. This requires us to evaluate the influence of samples from both\nperspectives. To tackle these challenges, we introduce the Extended Influence\nFunction for Contrastive Loss (ECIF), an influence function crafted for\ncontrastive loss. ECIF considers both positive and negative samples and\nprovides a closed-form approximation of contrastive learning models,\neliminating the need for retraining. Building upon ECIF, we develop a series of\nalgorithms for data evaluation in MLLM, misalignment detection, and\nmisprediction trace-back tasks. Experimental results demonstrate our ECIF\nadvances the transparency and interpretability of MLLMs by offering a more\naccurate assessment of data impact and model alignment compared to traditional\nbaseline methods.", "paper_summary_zh": "多模态大语言模型 (MLLM) 总是针对来自不同且不可靠来源的数据进行训练，其中可能包含未对齐或标记错误的文本图像对。这经常导致鲁棒性问题和幻觉，从而导致性能下降。数据评估是一种检测和追踪这些未对齐的有效方法。然而，现有方法对 MLLM 来说计算成本很高。虽然计算效率高，但经典影响函数不适用于对比学习模型，因为它们最初是为逐点损失设计的。此外，对比学习涉及最小化正样本模态之间的距离，并最大化负样本模态之间的距离。这要求我们从两个角度评估样本的影响。为了应对这些挑战，我们引入了对比损失的扩展影响函数 (ECIF)，这是一种专门为对比损失设计的的影响函数。ECIF 考虑正负样本，并提供对比学习模型的闭式近似，无需重新训练。在 ECIF 的基础上，我们开发了一系列用于 MLLM 中的数据评估、未对齐检测和错误预测回溯任务的算法。实验结果表明，与传统的基线方法相比，我们的 ECIF 通过提供对数据影响和模型对齐的更准确评估，提高了 MLLM 的透明度和可解释性。", "author": "Lijie Hu et.al.", "authors": "Lijie Hu, Chenyang Ren, Huanyi Xie, Khouloud Saadi, Shu Yang, Jingfeng Zhang, Di Wang", "id": "2411.11667v1", "paper_url": "http://arxiv.org/abs/2411.11667v1", "repo": "null"}}