{"2408.05767": {"publish_time": "2024-08-11", "title": "Reference-free Hallucination Detection for Large Vision-Language Models", "paper_summary": "Large vision-language models (LVLMs) have made significant progress in recent\nyears. While LVLMs exhibit excellent ability in language understanding,\nquestion answering, and conversations of visual inputs, they are prone to\nproducing hallucinations. While several methods are proposed to evaluate the\nhallucinations in LVLMs, most are reference-based and depend on external tools,\nwhich complicates their practical application. To assess the viability of\nalternative methods, it is critical to understand whether the reference-free\napproaches, which do not rely on any external tools, can efficiently detect\nhallucinations. Therefore, we initiate an exploratory study to demonstrate the\neffectiveness of different reference-free solutions in detecting hallucinations\nin LVLMs. In particular, we conduct an extensive study on three kinds of\ntechniques: uncertainty-based, consistency-based, and supervised uncertainty\nquantification methods on four representative LVLMs across two different tasks.\nThe empirical results show that the reference-free approaches are capable of\neffectively detecting non-factual responses in LVLMs, with the supervised\nuncertainty quantification method outperforming the others, achieving the best\nperformance across different settings.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 近年來取得顯著進展。雖然 LVLMs 在語言理解、問題解答和視覺輸入對話方面表現出色的能力，但它們容易產生幻覺。雖然已經提出多種方法來評估 LVLMs 中的幻覺，但大多數都是基於參考且依賴於外部工具，這使得它們的實際應用變得複雜。為了評估替代方法的可行性，了解不依賴任何外部工具的無參考方法是否能有效檢測幻覺至關重要。因此，我們啟動了一項探索性研究，以證明不同的無參考解決方案在檢測 LVLMs 中的幻覺方面的有效性。特別是，我們對三種類型的技術進行了廣泛的研究：不確定性基準、一致性基準和監督不確定性量化方法，針對四個代表性的 LVLMs 進行了兩個不同的任務。實證結果表明，無參考方法能夠有效檢測 LVLMs 中的非事實回應，其中監督不確定性量化方法優於其他方法，在不同的設置中實現了最佳性能。", "author": "Qing Li et.al.", "authors": "Qing Li, Chenyang Lyu, Jiahui Geng, Derui Zhu, Maxim Panov, Fakhri Karray", "id": "2408.05767v1", "paper_url": "http://arxiv.org/abs/2408.05767v1", "repo": "null"}}