{"2411.00594": {"publish_time": "2024-11-01", "title": "Deep learning-based auto-contouring of organs/structures-at-risk for pediatric upper abdominal radiotherapy", "paper_summary": "Purposes: This study aimed to develop a computed tomography (CT)-based\nmulti-organ segmentation model for delineating organs-at-risk (OARs) in\npediatric upper abdominal tumors and evaluate its robustness across multiple\ndatasets. Materials and methods: In-house postoperative CTs from pediatric\npatients with renal tumors and neuroblastoma (n=189) and a public dataset\n(n=189) with CTs covering thoracoabdominal regions were used. Seventeen OARs\nwere delineated: nine by clinicians (Type 1) and eight using TotalSegmentator\n(Type 2). Auto-segmentation models were trained using in-house (ModelPMC-UMCU)\nand a combined dataset of public data (Model-Combined). Performance was\nassessed with Dice Similarity Coefficient (DSC), 95% Hausdorff Distance (HD95),\nand mean surface distance (MSD). Two clinicians rated clinical acceptability on\na 5-point Likert scale across 15 patient contours. Model robustness was\nevaluated against sex, age, intravenous contrast, and tumor type. Results:\nModel-PMC-UMCU achieved mean DSC values above 0.95 for five of nine OARs, while\nspleen and heart ranged between 0.90 and 0.95. The stomach-bowel and pancreas\nexhibited DSC values below 0.90. Model-Combined demonstrated improved\nrobustness across both datasets. Clinical evaluation revealed good usability,\nwith both clinicians rating six of nine Type 1 OARs above four and six of eight\nType 2 OARs above three. Significant performance 2 differences were only found\nacross age groups in both datasets, specifically in the left lung and pancreas.\nThe 0-2 age group showed the lowest performance. Conclusion: A multi-organ\nsegmentation model was developed, showcasing enhanced robustness when trained\non combined datasets. This model is suitable for various OARs and can be\napplied to multiple datasets in clinical settings.", "paper_summary_zh": "<paragraph>目的：本研究旨在开发一个基于计算机断层扫描 (CT) 的多器官分割模型，用于描绘小儿上腹部肿瘤中的危险器官 (OAR)，并评估其在多个数据集中的稳健性。材料和方法：使用小儿肾肿瘤和神经母细胞瘤患者 (n=189) 的院内术后 CT 以及包含胸腹区域 CT 的公共数据集 (n=189)。描绘了 17 个 OAR：9 个由临床医生描绘 (类型 1)，8 个使用 TotalSegmentator 描绘 (类型 2)。使用院内 (ModelPMC-UMCU) 和公共数据组合数据集 (Model-Combined) 训练自动分割模型。使用骰子相似性系数 (DSC)、95% 霍斯多夫距离 (HD95) 和平均表面距离 (MSD) 评估性能。两位临床医生使用 5 点李克特量表对 15 个患者轮廓的临床可接受性进行评级。针对性别、年龄、静脉对比和肿瘤类型评估模型的稳健性。结果：Model-PMC-UMCU 对九个 OAR 中的五个 OAR 的平均 DSC 值达到 0.95 以上，而脾脏和心脏在 0.90 到 0.95 之间。胃肠和胰腺的 DSC 值低于 0.90。Model-Combined 在两个数据集上都表现出改进的稳健性。临床评估显示出良好的可用性，两位临床医生对六个九个类型 1 OAR 的评分均高于四分，对八个类型 2 OAR 中的六个评分均高于三分。仅在两个数据集的年龄组中发现了显着的性能 2 差异，特别是在左肺和胰腺中。0-2 岁年龄组表现最差。结论：开发了一个多器官分割模型，在合并数据集上训练时显示出增强的稳健性。该模型适用于各种 OAR，并且可以在临床环境中应用于多个数据集。</paragraph>", "author": "Mianyong Ding et.al.", "authors": "Mianyong Ding, Matteo Maspero, Annemieke S Littooij, Martine van Grotel, Raquel Davila Fajardo, Max M van Noesel, Marry M van den Heuvel-Eibrink, Geert O Janssens", "id": "2411.00594v1", "paper_url": "http://arxiv.org/abs/2411.00594v1", "repo": "https://github.com/MMianyong/-PedAbdSeg-"}}