{"2407.11442": {"publish_time": "2024-07-16", "title": "EARN Fairness: Explaining, Asking, Reviewing and Negotiating Artificial Intelligence Fairness Metrics Among Stakeholders", "paper_summary": "Numerous fairness metrics have been proposed and employed by artificial\nintelligence (AI) experts to quantitatively measure bias and define fairness in\nAI models. Recognizing the need to accommodate stakeholders' diverse fairness\nunderstandings, efforts are underway to solicit their input. However, conveying\nAI fairness metrics to stakeholders without AI expertise, capturing their\npersonal preferences, and seeking a collective consensus remain challenging and\nunderexplored. To bridge this gap, we propose a new framework, EARN Fairness,\nwhich facilitates collective metric decisions among stakeholders without\nrequiring AI expertise. The framework features an adaptable interactive system\nand a stakeholder-centered EARN Fairness process to Explain fairness metrics,\nAsk stakeholders' personal metric preferences, Review metrics collectively, and\nNegotiate a consensus on metric selection. To gather empirical results, we\napplied the framework to a credit rating scenario and conducted a user study\ninvolving 18 decision subjects without AI knowledge. We identify their personal\nmetric preferences and their acceptable level of unfairness in individual\nsessions. Subsequently, we uncovered how they reached metric consensus in team\nsessions. Our work shows that the EARN Fairness framework enables stakeholders\nto express personal preferences and reach consensus, providing practical\nguidance for implementing human-centered AI fairness in high-risk contexts.\nThrough this approach, we aim to harmonize fairness expectations of diverse\nstakeholders, fostering more equitable and inclusive AI fairness.", "paper_summary_zh": "人工智能 (AI) 專家已提出並採用許多公平性指標，以量化衡量偏見並定義 AI 模型中的公平性。認識到需要適應利害關係人對公平性的不同理解，目前正努力徵求他們的意見。然而，向沒有 AI 專業知識的利害關係人傳達 AI 公平性指標、掌握他們的個人偏好，並尋求集體共識仍然具有挑戰性，且尚未充分探討。為了彌合這一差距，我們提出一個新的架構，EARN 公平性，它可以在不需 AI 專業知識的情況下，促進利害關係人之間的集體指標決策。該架構具有適應性互動系統，以及以利害關係人為中心的 EARN 公平性流程，用於說明公平性指標、詢問利害關係人的個人指標偏好、共同檢視指標，並協商指標選擇的共識。為了收集實證結果，我們將此架構應用於信用評分情境，並進行了一項使用者研究，其中包含 18 位沒有 AI 知識的決策主體。我們在個別會議中找出他們的個人指標偏好和他們可接受的不公平程度。隨後，我們揭露他們如何在團隊會議中達成指標共識。我們的研究顯示，EARN 公平性架構讓利害關係人能夠表達個人偏好並達成共識，為在高風險環境中實施以人為中心的 AI 公平性提供實務指導。透過此方法，我們旨在調和不同利害關係人的公平性期望，促進更公平且包容的 AI 公平性。", "author": "Lin Luo et.al.", "authors": "Lin Luo, Yuri Nakao, Mathieu Chollet, Hiroya Inakoshi, Simone Stumpf", "id": "2407.11442v1", "paper_url": "http://arxiv.org/abs/2407.11442v1", "repo": "null"}}