{"2501.08035": {"publish_time": "2025-01-14", "title": "READ: Reinforcement-based Adversarial Learning for Text Classification with Limited Labeled Data", "paper_summary": "Pre-trained transformer models such as BERT have shown massive gains across\nmany text classification tasks. However, these models usually need enormous\nlabeled data to achieve impressive performances. Obtaining labeled data is\noften expensive and time-consuming, whereas collecting unlabeled data using\nsome heuristics is relatively much cheaper for any task. Therefore, this paper\nproposes a method that encapsulates reinforcement learning-based text\ngeneration and semi-supervised adversarial learning approaches in a novel way\nto improve the model's performance. Our method READ, Reinforcement-based\nAdversarial learning, utilizes an unlabeled dataset to generate diverse\nsynthetic text through reinforcement learning, improving the model's\ngeneralization capability using adversarial learning. Our experimental results\nshow that READ outperforms the existing state-of-art methods on multiple\ndatasets.", "paper_summary_zh": "預訓練過的Transformer模型，例如 BERT，已在許多文字分類任務中展現出巨大的進步。然而，這些模型通常需要大量的標籤資料才能達到令人印象深刻的效能。取得標籤資料通常昂貴且耗時，而使用一些啟發法收集未標籤資料對於任何任務來說相對便宜得多。因此，本文提出了一種方法，以新穎的方式將基於強化學習的文字生成和半監督對抗學習方法封裝起來，以提升模型的效能。我們的 READ 方法（基於強化對抗學習）利用未標籤的資料集透過強化學習產生多樣化的合成文字，並使用對抗學習提升模型的泛化能力。我們的實驗結果顯示，READ 在多個資料集上優於現有的最先進方法。", "author": "Rohit Sharma et.al.", "authors": "Rohit Sharma, Shanu Kumar, Avinash Kumar", "id": "2501.08035v1", "paper_url": "http://arxiv.org/abs/2501.08035v1", "repo": "null"}}