{"2502.10051": {"publish_time": "2025-02-14", "title": "ORI: O Routing Intelligence", "paper_summary": "Single large language models (LLMs) often fall short when faced with the\never-growing range of tasks, making a single-model approach insufficient. We\naddress this challenge by proposing ORI (O Routing Intelligence), a dynamic\nframework that leverages a set of LLMs. By intelligently routing incoming\nqueries to the most suitable model, ORI not only improves task-specific\naccuracy, but also maintains efficiency. Comprehensive evaluations across\ndiverse benchmarks demonstrate consistent accuracy gains while controlling\ncomputational overhead. By intelligently routing queries, ORI outperforms the\nstrongest individual models by up to 2.7 points on MMLU and 1.8 points on MuSR,\nties the top performance on ARC, and on BBH. These results underscore the\nbenefits of a multi-model strategy and demonstrate how ORI's adaptive\narchitecture can more effectively handle diverse tasks, offering a scalable,\nhigh-performance solution for a system of multiple large language models.", "paper_summary_zh": "大型單一語言模型 (LLM) 在面對不斷增加的任務範圍時，通常會表現不佳，使得單一模型方法不足以應付。我們透過提出 ORI (O 路由情報) 來解決這個挑戰，ORI 是一個利用一組 LLM 的動態架構。透過將傳入的查詢智能路由到最合適的模型，ORI 不僅提升了任務特定的準確度，還維持了效率。跨不同基準的全面評估顯示，在控制運算負擔的同時，持續提升準確度。透過智能路由查詢，ORI 在 MMLU 上比最強的個別模型高出 2.7 個百分點，在 MuSR 上高出 1.8 個百分點，在 ARC 和 BBH 上則與最高效能並列。這些結果強調了多模型策略的優點，並展示了 ORI 的自適應架構如何更有效地處理各種任務，為多個大型語言模型的系統提供可擴充、高性能的解決方案。", "author": "Ahmad Shadid et.al.", "authors": "Ahmad Shadid, Rahul Kumar, Mohit Mayank", "id": "2502.10051v1", "paper_url": "http://arxiv.org/abs/2502.10051v1", "repo": "null"}}