{"2408.11366": {"publish_time": "2024-08-21", "title": "GeoReasoner: Reasoning On Geospatially Grounded Context For Natural Language Understanding", "paper_summary": "In human reading and communication, individuals tend to engage in geospatial\nreasoning, which involves recognizing geographic entities and making informed\ninferences about their interrelationships. To mimic such cognitive process,\ncurrent methods either utilize conventional natural language understanding\ntoolkits, or directly apply models pretrained on geo-related natural language\ncorpora. However, these methods face two significant challenges: i) they do not\ngeneralize well to unseen geospatial scenarios, and ii) they overlook the\nimportance of integrating geospatial context from geographical databases with\nlinguistic information from the Internet. To handle these challenges, we\npropose GeoReasoner, a language model capable of reasoning on geospatially\ngrounded natural language. Specifically, it first leverages Large Language\nModels (LLMs) to generate a comprehensive location description based on\nlinguistic and geospatial information. It also encodes direction and distance\ninformation into spatial embedding via treating them as pseudo-sentences.\nConsequently, the model is trained on both anchor-level and neighbor-level\ninputs to learn geo-entity representation. Extensive experimental results\ndemonstrate GeoReasoner's superiority in three tasks: toponym recognition,\ntoponym linking, and geo-entity typing, compared to the state-of-the-art\nbaselines.", "paper_summary_zh": "在人類的閱讀和溝通中，個人傾向於從事地理空間推理，這涉及識別地理實體並對它們的相互關係做出明智的推論。為了模擬這種認知過程，當前的做法是利用傳統的自然語言理解工具包，或直接應用預先在與地理相關的自然語言語料庫上訓練的模型。然而，這些方法面臨著兩個重大的挑戰：i) 它們無法很好地推廣到未見過的地理空間場景，以及 ii) 它們忽視了將來自地理資料庫的地理空間背景與來自網際網路的語言資訊整合起來的重要性。為了應對這些挑戰，我們提出了 GeoReasoner，這是一個能夠對地理空間基礎自然語言進行推理的語言模型。具體來說，它首先利用大型語言模型 (LLM) 根據語言和地理空間資訊生成全面的位置描述。它還將方向和距離資訊編碼到空間嵌入中，將它們視為偽句子。因此，該模型在錨點級別和鄰居級別的輸入上進行訓練，以學習地理實體表示。大量的實驗結果證明了 GeoReasoner 在三項任務中的優越性：地名識別、地名連結和地理實體類型，與最先進的基準相比。", "author": "Yibo Yan et.al.", "authors": "Yibo Yan, Joey Lee", "id": "2408.11366v1", "paper_url": "http://arxiv.org/abs/2408.11366v1", "repo": "null"}}