{"2406.04866": {"publish_time": "2024-06-07", "title": "ComplexTempQA: A Large-Scale Dataset for Complex Temporal Question Answering", "paper_summary": "We introduce ComplexTempQA,a large-scale dataset consisting of over 100\nmillion question-answer pairs designed to tackle the challenges in temporal\nquestion answering. ComplexTempQA significantly surpasses existing benchmarks\nlike HOTPOTQA, TORQUE, and TEQUILA in scale and scope. Utilizing data from\nWikipedia and Wikidata, the dataset covers questions spanning over two decades\nand offers an unmatched breadth of topics. We introduce a unique taxonomy that\ncategorizes questions as attributes, comparisons, and counting questions, each\nrevolving around events, entities, and time periods. One standout feature of\nComplexTempQA is the high complexity of its questions, which demand effective\ncapabilities for answering such as across-time comparison, temporal\naggregation, and multi-hop reasoning involving temporal event ordering and\nentity recognition. Additionally, each question is accompanied by detailed\nmetadata, including specific time scopes, allowing for comprehensive evaluation\nand enhancement of the temporal reasoning abilities of large language models.\nComplexTempQA serves both as a testing ground for developing sophisticated AI\nmodels and as a foundation for advancing research in question answering,\ninformation retrieval, and language understanding. Dataset and code are freely\navailable at: https://github.com/DataScienceUIBK/ComplexTempQA.", "paper_summary_zh": "我們引入了 ComplexTempQA，一個由超過 1 億個問答對組成的大規模資料集，旨在解決時序問答中的挑戰。ComplexTempQA 在規模和範圍上都顯著超越了現有的基準，例如 HOTPOTQA、TORQUE 和 TEQUILA。利用來自維基百科和 Wikidata 的資料，該資料集涵蓋了跨越二十年的問題，並提供了無與倫比的主題廣度。我們引入了獨特的分類法，將問題分類為屬性、比較和計數問題，每個問題都圍繞事件、實體和時間段展開。ComplexTempQA 的一個突出特點是其問題的高度複雜性，這需要有效的回答能力，例如跨時間比較、時間聚合以及涉及時間事件排序和實體識别的多跳推理。此外，每個問題都附有詳細的元資料，包括具體的時間範圍，允許對大型語言模型的時間推理能力進行全面的評估和增強。ComplexTempQA 既可用作開發複雜 AI 模型的測試場域，也可用作推進問答、資訊檢索和語言理解研究的基礎。資料集和程式碼可免費取得：https://github.com/DataScienceUIBK/ComplexTempQA。", "author": "Raphael Gruber et.al.", "authors": "Raphael Gruber, Abdelrahman Abdallah, Michael Färber, Adam Jatowt", "id": "2406.04866v1", "paper_url": "http://arxiv.org/abs/2406.04866v1", "repo": "https://github.com/datascienceuibk/complextempqa"}}