{"2408.10802": {"publish_time": "2024-08-20", "title": "Inverse Deep Learning Ray Tracing for Heliostat Surface Prediction", "paper_summary": "Concentrating Solar Power (CSP) plants play a crucial role in the global\ntransition towards sustainable energy. A key factor in ensuring the safe and\nefficient operation of CSP plants is the distribution of concentrated flux\ndensity on the receiver. However, the non-ideal flux density generated by\nindividual heliostats can undermine the safety and efficiency of the power\nplant. The flux density from each heliostat is influenced by its precise\nsurface profile, which includes factors such as canting and mirror errors.\nAccurately measuring these surface profiles for a large number of heliostats in\noperation is a formidable challenge. Consequently, control systems often rely\non the assumption of ideal surface conditions, which compromises both safety\nand operational efficiency. In this study, we introduce inverse Deep Learning\nRay Tracing (iDLR), an innovative method designed to predict heliostat surfaces\nbased solely on target images obtained during heliostat calibration. Our\nsimulation-based investigation demonstrates that sufficient information\nregarding the heliostat surface is retained in the flux density distribution of\na single heliostat, enabling deep learning models to accurately predict the\nunderlying surface with deflectometry-like precision for the majority of\nheliostats. Additionally, we assess the limitations of this method,\nparticularly in relation to surface accuracy and resultant flux density\npredictions. Furthermore, we are presenting a new comprehensive heliostat model\nusing Non-Uniform Rational B-Spline (NURBS) that has the potential to become\nthe new State of the Art for heliostat surface parameterization. Our findings\nreveal that iDLR has significant potential to enhance CSP plant operations,\npotentially increasing the overall efficiency and energy output of the power\nplants.", "paper_summary_zh": "<paragraph>聚光太陽能 (CSP) 電廠在全球邁向永續能源的過程中扮演著至關重要的角色。確保 CSP 電廠安全且有效運作的關鍵因素之一是接收器上聚光通量密度的分佈。然而，個別定日鏡產生的非理想通量密度可能會損害電廠的安全性和效率。每個定日鏡的通量密度會受到其精確表面輪廓的影響，其中包括傾斜和鏡面誤差等因素。準確測量大量運作中的定日鏡的這些表面輪廓是一項艱鉅的挑戰。因此，控制系統通常依賴於理想表面條件的假設，這會影響安全性和運作效率。在這項研究中，我們引進了反向深度學習光線追蹤 (iDLR)，這是一種創新的方法，旨在根據定日鏡校正期間取得的目標影像來預測定日鏡表面。我們基於模擬的調查顯示，關於定日鏡表面的足夠資訊保留在單個定日鏡的通量密度分佈中，使深度學習模型能夠準確預測大多數定日鏡的底層表面，其精確度類似於偏光干涉術。此外，我們評估了此方法的限制，特別是與表面準確度和結果通量密度預測相關的限制。此外，我們提出了一個使用非均勻有理 B 樣條 (NURBS) 的全新綜合定日鏡模型，它有可能成為定日鏡表面參數化的最新技術。我們的研究結果顯示，iDLR 具有顯著的潛力可以提升 CSP 電廠的運作，進而提升電廠的整體效率和能源輸出。</paragraph>", "author": "Jan Lewen et.al.", "authors": "Jan Lewen, Max Pargmann, Mehdi Cherti, Jenia Jitsev, Robert Pitz-Paal, Daniel Maldonado Quinto", "id": "2408.10802v1", "paper_url": "http://arxiv.org/abs/2408.10802v1", "repo": "null"}}