{"2406.04175": {"publish_time": "2024-06-06", "title": "Confabulation: The Surprising Value of Large Language Model Hallucinations", "paper_summary": "This paper presents a systematic defense of large language model (LLM)\nhallucinations or 'confabulations' as a potential resource instead of a\ncategorically negative pitfall. The standard view is that confabulations are\ninherently problematic and AI research should eliminate this flaw. In this\npaper, we argue and empirically demonstrate that measurable semantic\ncharacteristics of LLM confabulations mirror a human propensity to utilize\nincreased narrativity as a cognitive resource for sense-making and\ncommunication. In other words, it has potential value. Specifically, we analyze\npopular hallucination benchmarks and reveal that hallucinated outputs display\nincreased levels of narrativity and semantic coherence relative to veridical\noutputs. This finding reveals a tension in our usually dismissive\nunderstandings of confabulation. It suggests, counter-intuitively, that the\ntendency for LLMs to confabulate may be intimately associated with a positive\ncapacity for coherent narrative-text generation.", "paper_summary_zh": "本文系統性地論述了大型語言模型 (LLM) 的幻覺或「捏造」，將其視為一種潛在資源，而非絕對負面的陷阱。標準觀點認為捏造本質上是有問題的，人工智慧研究應消除此缺陷。在本文中，我們論證並實證證明，LLM 捏造的可測量語義特徵反映了人類傾向於利用增加的敘事性作為理解和溝通的認知資源。換句話說，它具有潛在價值。具體來說，我們分析了流行的幻覺基準，並揭示了幻覺輸出的敘事性和語義一致性高於真實輸出的層級。此發現揭示了我們通常對捏造的不屑理解中的緊張關係。它反直覺地表明，LLM 捏造的傾向可能與連貫敘事文本生成的正面能力密切相關。", "author": "Peiqi Sui et.al.", "authors": "Peiqi Sui, Eamon Duede, Sophie Wu, Richard Jean So", "id": "2406.04175v1", "paper_url": "http://arxiv.org/abs/2406.04175v1", "repo": "null"}}