{"2502.10385": {"publish_time": "2025-02-14", "title": "Simplifying DINO via Coding Rate Regularization", "paper_summary": "DINO and DINOv2 are two model families being widely used to learn\nrepresentations from unlabeled imagery data at large scales. Their learned\nrepresentations often enable state-of-the-art performance for downstream tasks,\nsuch as image classification and segmentation. However, they employ many\nempirically motivated design choices and their training pipelines are highly\ncomplex and unstable -- many hyperparameters need to be carefully tuned to\nensure that the representations do not collapse -- which poses considerable\ndifficulty to improving them or adapting them to new domains. In this work, we\nposit that we can remove most such-motivated idiosyncrasies in the pre-training\npipelines, and only need to add an explicit coding rate term in the loss\nfunction to avoid collapse of the representations. As a result, we obtain\nhighly simplified variants of the DINO and DINOv2 which we call SimDINO and\nSimDINOv2, respectively. Remarkably, these simplified models are more robust to\ndifferent design choices, such as network architecture and hyperparameters, and\nthey learn even higher-quality representations, measured by performance on\ndownstream tasks, offering a Pareto improvement over the corresponding DINO and\nDINOv2 models. This work highlights the potential of using simplifying design\nprinciples to improve the empirical practice of deep learning.", "paper_summary_zh": "DINO 和 DINOv2 是兩個模型系列，它們被廣泛用於從大型未標記影像資料中學習表徵。它們學習到的表徵通常能讓下游任務（例如影像分類和分割）達到最先進的效能。然而，它們採用許多以經驗為依據的設計選擇，而且它們的訓練管道非常複雜且不穩定，需要仔細調整許多超參數，以確保表徵不會崩潰，這對改善它們或將它們適應到新領域造成了相當大的困難。在這項工作中，我們假設我們可以在預訓練管道中移除大多數此類動機特質，而且只需要在損失函數中加入明確的編碼率項，就能避免表徵崩潰。因此，我們獲得了 DINO 和 DINOv2 的高度簡化變體，我們分別稱之為 SimDINO 和 SimDINOv2。值得注意的是，這些簡化的模型對不同的設計選擇（例如網路架構和超參數）更為穩健，而且它們學習到品質更高的表徵，這以在下游任務中的效能來衡量，對應應的 DINO 和 DINOv2 模型提供了帕雷托改善。這項工作突顯了使用簡化設計原則來改善深度學習的實務潛力。", "author": "Ziyang Wu et.al.", "authors": "Ziyang Wu, Jingyuan Zhang, Druv Pai, XuDong Wang, Chandan Singh, Jianwei Yang, Jianfeng Gao, Yi Ma", "id": "2502.10385v1", "paper_url": "http://arxiv.org/abs/2502.10385v1", "repo": "null"}}