{"2407.15793": {"publish_time": "2024-07-22", "title": "CLIP with Generative Latent Replay: a Strong Baseline for Incremental Learning", "paper_summary": "With the emergence of Transformers and Vision-Language Models (VLMs) such as\nCLIP, large pre-trained models have become a common strategy to enhance\nperformance in Continual Learning scenarios. This led to the development of\nnumerous prompting strategies to effectively fine-tune transformer-based models\nwithout succumbing to catastrophic forgetting. However, these methods struggle\nto specialize the model on domains significantly deviating from the\npre-training and preserving its zero-shot capabilities. In this work, we\npropose Continual Generative training for Incremental prompt-Learning, a novel\napproach to mitigate forgetting while adapting a VLM, which exploits generative\nreplay to align prompts to tasks. We also introduce a new metric to evaluate\nzero-shot capabilities within CL benchmarks. Through extensive experiments on\ndifferent domains, we demonstrate the effectiveness of our framework in\nadapting to new tasks while improving zero-shot capabilities. Further analysis\nreveals that our approach can bridge the gap with joint prompt tuning. The\ncodebase is available at https://github.com/aimagelab/mammoth.", "paper_summary_zh": "隨著 Transformers 和 CLIP 等視覺語言模型 (VLM) 的出現，大型預訓練模型已成為在持續學習場景中增強效能的常見策略。這導致了許多提示策略的開發，以有效微調基於轉換器的模型，而不會屈服於災難性遺忘。然而，這些方法難以將模型專門化到與預訓練顯著不同的領域，並保留其零次學習能力。在這項工作中，我們提出持續生成訓練以進行增量提示學習，這是一種減輕遺忘同時適應 VLM 的新方法，它利用生成重播將提示與任務對齊。我們還引入了一個新指標來評估 CL 基準中的零次學習能力。通過在不同領域進行廣泛的實驗，我們展示了我們的框架在適應新任務同時提高零次學習能力方面的有效性。進一步的分析表明，我們的做法可以彌合理論提示調整的差距。程式碼庫可在 https://github.com/aimagelab/mammoth 取得。", "author": "Emanuele Frascaroli et.al.", "authors": "Emanuele Frascaroli, Aniello Panariello, Pietro Buzzega, Lorenzo Bonicelli, Angelo Porrello, Simone Calderara", "id": "2407.15793v1", "paper_url": "http://arxiv.org/abs/2407.15793v1", "repo": "https://github.com/aimagelab/mammoth"}}