{"2408.01343": {"publish_time": "2024-08-02", "title": "StitchFusion: Weaving Any Visual Modalities to Enhance Multimodal Semantic Segmentation", "paper_summary": "Multimodal semantic segmentation shows significant potential for enhancing\nsegmentation accuracy in complex scenes. However, current methods often\nincorporate specialized feature fusion modules tailored to specific modalities,\nthereby restricting input flexibility and increasing the number of training\nparameters. To address these challenges, we propose StitchFusion, a\nstraightforward yet effective modal fusion framework that integrates\nlarge-scale pre-trained models directly as encoders and feature fusers. This\napproach facilitates comprehensive multi-modal and multi-scale feature fusion,\naccommodating any visual modal inputs. Specifically, Our framework achieves\nmodal integration during encoding by sharing multi-modal visual information. To\nenhance information exchange across modalities, we introduce a\nmulti-directional adapter module (MultiAdapter) to enable cross-modal\ninformation transfer during encoding. By leveraging MultiAdapter to propagate\nmulti-scale information across pre-trained encoders during the encoding\nprocess, StitchFusion achieves multi-modal visual information integration\nduring encoding. Extensive comparative experiments demonstrate that our model\nachieves state-of-the-art performance on four multi-modal segmentation datasets\nwith minimal additional parameters. Furthermore, the experimental integration\nof MultiAdapter with existing Feature Fusion Modules (FFMs) highlights their\ncomplementary nature. Our code is available at StitchFusion_repo.", "paper_summary_zh": "多模態語意分割在增強複雜場景中的分割準確度方面展現出顯著的潛力。然而，當前方法通常會納入針對特定模態量身打造的專業特徵融合模組，從而限制輸入彈性並增加訓練參數數量。為了解決這些挑戰，我們提出 StitchFusion，一個直接將大規模預訓練模型作為編碼器和特徵融合器的簡單卻有效的模態融合架構。這種方法促進了全面的多模態和多尺度特徵融合，容納任何視覺模態輸入。具體來說，我們的架構透過共享多模態視覺資訊，在編碼過程中實現模態整合。為了增強跨模態的資訊交換，我們引入了一個多向適配器模組 (MultiAdapter)，以便在編碼過程中實現跨模態資訊傳輸。透過利用 MultiAdapter 在編碼過程中跨預訓練編碼器傳播多尺度資訊，StitchFusion 在編碼過程中實現了多模態視覺資訊整合。廣泛的比較實驗證明，我們的模型在四個多模態分割資料集上實現了最先進的效能，且額外參數最少。此外，MultiAdapter 與現有特徵融合模組 (FFM) 的實驗整合突顯了它們的互補性質。我們的程式碼可在 StitchFusion_repo 取得。", "author": "Bingyu Li et.al.", "authors": "Bingyu Li, Da Zhang, Zhiyuan Zhao, Junyu Gao, Xuelong Li", "id": "2408.01343v1", "paper_url": "http://arxiv.org/abs/2408.01343v1", "repo": "null"}}