{"2407.05983": {"publish_time": "2024-07-08", "title": "Towards A Comprehensive Visual Saliency Explanation Framework for AI-based Face Recognition Systems", "paper_summary": "Over recent years, deep convolutional neural networks have significantly\nadvanced the field of face recognition techniques for both verification and\nidentification purposes. Despite the impressive accuracy, these neural networks\nare often criticized for lacking explainability. There is a growing demand for\nunderstanding the decision-making process of AI-based face recognition systems.\nSome studies have investigated the use of visual saliency maps as explanations,\nbut they have predominantly focused on the specific face verification case. The\ndiscussion on more general face recognition scenarios and the corresponding\nevaluation methodology for these explanations have long been absent in current\nresearch. Therefore, this manuscript conceives a comprehensive explanation\nframework for face recognition tasks. Firstly, an exhaustive definition of\nvisual saliency map-based explanations for AI-based face recognition systems is\nprovided, taking into account the two most common recognition situations\nindividually, i.e., face verification and identification. Secondly, a new\nmodel-agnostic explanation method named CorrRISE is proposed to produce\nsaliency maps, which reveal both the similar and dissimilar regions between any\ngiven face images. Subsequently, the explanation framework conceives a new\nevaluation methodology that offers quantitative measurement and comparison of\nthe performance of general visual saliency explanation methods in face\nrecognition. Consequently, extensive experiments are carried out on multiple\nverification and identification scenarios. The results showcase that CorrRISE\ngenerates insightful saliency maps and demonstrates superior performance,\nparticularly in similarity maps in comparison with the state-of-the-art\nexplanation approaches.", "paper_summary_zh": "<paragraph>近年來，深度卷積神經網路在人臉辨識技術領域，無論是驗證或辨識目的，都有顯著進展。儘管準確度令人印象深刻，但這些神經網路常被批評缺乏可解釋性。對於理解基於 AI 的人臉辨識系統的決策過程，需求日益增加。一些研究探討了使用視覺顯著性圖作為解釋，但它們主要關注具體的人臉驗證案例。目前的研究中，對於更一般的人臉辨識情境以及這些解釋對應的評估方法的討論長期缺席。因此，本手稿構想了一個全面的解釋架構，用於人臉辨識任務。首先，提供了基於視覺顯著性圖的 AI 人臉辨識系統解釋的詳盡定義，個別考慮了兩種最常見的辨識情況，即人臉驗證和辨識。其次，提出了一種新的與模型無關的解釋方法，稱為 CorrRISE，用於產生顯著性圖，揭示任何給定人臉影像之間的相似和相異區域。隨後，解釋架構構想了一種新的評估方法，提供量化測量和比較一般視覺顯著性解釋方法在人臉辨識中的效能。因此，在多個人臉驗證和辨識情境中進行了廣泛的實驗。結果表明，CorrRISE 生成了有見地的顯著性圖，並展示出優異的效能，特別是在相似性圖中，與最先進的解釋方法相比。</paragraph>", "author": "Yuhang Lu et.al.", "authors": "Yuhang Lu, Zewei Xu, Touradj Ebrahimi", "id": "2407.05983v1", "paper_url": "http://arxiv.org/abs/2407.05983v1", "repo": "null"}}