{"2411.15811": {"publish_time": "2024-11-24", "title": "FastTrackTr:Towards Fast Multi-Object Tracking with Transformers", "paper_summary": "Transformer-based multi-object tracking (MOT) methods have captured the\nattention of many researchers in recent years. However, these models often\nsuffer from slow inference speeds due to their structure or other issues. To\naddress this problem, we revisited the Joint Detection and Tracking (JDT)\nmethod by looking back at past approaches. By integrating the original JDT\napproach with some advanced theories, this paper employs an efficient method of\ninformation transfer between frames on the DETR, constructing a fast and novel\nJDT-type MOT framework: FastTrackTr. Thanks to the superiority of this\ninformation transfer method, our approach not only reduces the number of\nqueries required during tracking but also avoids the excessive introduction of\nnetwork structures, ensuring model simplicity. Experimental results indicate\nthat our method has the potential to achieve real-time tracking and exhibits\ncompetitive tracking accuracy across multiple datasets.", "paper_summary_zh": "近年來，基於 Transformer 的多目標追蹤 (MOT) 方法已引起許多研究人員的關注。然而，這些模型由於其結構或其他問題，通常會導致推論速度較慢。為了解決這個問題，我們回顧過去的方法，重新審視了聯合偵測與追蹤 (JDT) 方法。本文透過將原始 JDT 方法與一些先進的理論整合，在 DETR 上採用了一種有效的幀間資訊傳遞方法，建構了一個快速且新穎的 JDT 類型 MOT 框架：FastTrackTr。由於這種資訊傳遞方法的優越性，我們的做法不僅減少了追蹤過程中所需的查詢數量，還避免了過度引入網路結構，確保了模型的簡潔性。實驗結果表明，我們的模型具有實現即時追蹤的潛力，並在多個資料集上展現出具有競爭力的追蹤準確度。", "author": "Pan Liao et.al.", "authors": "Pan Liao, Feng Yang, Di Wu, Jinwen Yu, Wenhui Zhao, Bo Liu", "id": "2411.15811v1", "paper_url": "http://arxiv.org/abs/2411.15811v1", "repo": "null"}}