{"2501.00868": {"publish_time": "2025-01-01", "title": "Large Language Models Are Read/Write Policy-Makers for Simultaneous Generation", "paper_summary": "Simultaneous generation models write generation results while reading\nstreaming inputs, necessitating a policy-maker to determine the appropriate\noutput timing. Existing simultaneous generation methods generally adopt the\ntraditional encoder-decoder architecture and learn the generation and\npolicy-making capabilities through complex dynamic programming techniques.\nAlthough LLMs excel at text generation, they face challenges in taking on the\nrole of policy-makers through traditional training methods, limiting their\nexploration in simultaneous generation. To overcome these limitations, we\npropose a novel LLM-driven Simultaneous Generation (LSG) framework, which\nallows the off-the-shelf LLM to decide the generation timing and produce output\nconcurrently. Specifically, LSG selects the generation policy that minimizes\nlatency as the baseline policy. Referring to the baseline policy, LSG enables\nthe LLM to devise an improved generation policy that better balances latency\nand generation quality, and writes generation results accordingly. Experiments\non simultaneous translation and streaming automatic speech recognition tasks\nshow that our method can achieve state-of-the-art performance utilizing the\nopen-source LLMs and demonstrate practicality in real-world scenarios.", "paper_summary_zh": "同步生成模型在讀取串流輸入時撰寫生成結果，需要一位策略制定者來決定適當的輸出時間。現有的同步生成方法通常採用傳統編碼器解碼器架構，並透過複雜的動態規劃技術來學習生成和策略制定能力。儘管大型語言模型 (LLM) 擅長文字生成，但它們在透過傳統訓練方法擔任策略制定者的角色時面臨挑戰，這限制了它們在同步生成中的探索。為了克服這些限制，我們提出一個新穎的 LLM 驅動同步生成 (LSG) 架構，它允許現成的 LLM 決定生成時間並同時產生輸出。具體來說，LSG 選擇將延遲最小化的生成策略作為基準策略。參照基準策略，LSG 能讓 LLM 設計出一個改進的生成策略，以更好地平衡延遲和生成品質，並相應地撰寫生成結果。在同步翻譯和串流自動語音辨識任務上的實驗顯示，我們的方法可以使用開源 LLM 達到最先進的效能，並證明在實際場景中的實用性。", "author": "Shoutao Guo et.al.", "authors": "Shoutao Guo, Shaolei Zhang, Zhengrui Ma, Yang Feng", "id": "2501.00868v1", "paper_url": "http://arxiv.org/abs/2501.00868v1", "repo": "null"}}