{"2407.15714": {"publish_time": "2024-07-22", "title": "Mamba meets crack segmentation", "paper_summary": "Cracks pose safety risks to infrastructure and cannot be overlooked. The\nprevailing structures in existing crack segmentation networks predominantly\nconsist of CNNs or Transformers. However, CNNs exhibit a deficiency in global\nmodeling capability, hindering the representation to entire crack features.\nTransformers can capture long-range dependencies but suffer from high and\nquadratic complexity. Recently, Mamba has garnered extensive attention due to\nits linear spatial and computational complexity and its powerful global\nperception. This study explores the representation capabilities of Mamba to\ncrack features. Specifically, this paper uncovers the connection between Mamba\nand the attention mechanism, providing a profound insight, an attention\nperspective, into interpreting Mamba and devising a novel Mamba module\nfollowing the principles of attention blocks, namely CrackMamba. We compare\nCrackMamba with the most prominent visual Mamba modules, Vim and Vmamba, on two\ndatasets comprising asphalt pavement and concrete pavement cracks, and steel\ncracks, respectively. The quantitative results show that CrackMamba stands out\nas the sole Mamba block consistently enhancing the baseline model's performance\nacross all evaluation measures, while reducing its parameters and computational\ncosts. Moreover, this paper substantiates that Mamba can achieve global\nreceptive fields through both theoretical analysis and visual interpretability.\nThe discoveries of this study offer a dual contribution. First, as a\nplug-and-play and simple yet effective Mamba module, CrackMamba exhibits\nimmense potential for integration into various crack segmentation models.\nSecond, the proposed innovative Mamba design concept, integrating Mamba with\nthe attention mechanism, holds significant reference value for all Mamba-based\ncomputer vision models, not limited to crack segmentation networks, as\ninvestigated in this study.", "paper_summary_zh": "<paragraph>裂縫會對基礎設施構成安全風險，不可忽視。\n現有裂縫分割網路中的主要結構主要由 CNN 或 Transformer 組成。然而，CNN 在全局建模能力方面存在缺陷，阻礙了對整個裂縫特徵的表示。Transformer 可以捕捉長距離依賴關係，但會帶來高二次複雜度。最近，Mamba 因其線性空間和計算複雜度以及強大的全局感知而備受關注。本研究探討了 Mamba 對裂縫特徵的表示能力。具體來說，本文揭示了 Mamba 與注意力機制之間的聯繫，提供了深刻的見解，一種注意力視角，用於解釋 Mamba 並設計一個遵循注意力區塊原理的新 Mamba 模塊，即 CrackMamba。我們在包含瀝青路面和混凝土路面裂縫以及鋼鐵裂縫的兩個數據集上將 CrackMamba 與最突出的視覺 Mamba 模塊 Vim 和 Vmamba 進行了比較。定量結果表明，CrackMamba 脫穎而出，成為唯一始終如一地提高基線模型在所有評估指標上的性能的 Mamba 區塊，同時減少其參數和計算成本。此外，本文通過理論分析和視覺可解釋性證實了 Mamba 可以實現全局感受野。本研究的發現提供了雙重貢獻。首先，作為一個即插即用且簡單但有效的 Mamba 模塊，CrackMamba 展示了巨大的潛力，可以整合到各種裂縫分割模型中。其次，提出的創新的 Mamba 設計概念，將 Mamba 與注意力機制相結合，對所有基於 Mamba 的計算機視覺模型具有重要的參考價值，不僅限於裂縫分割網路，如本研究中所探討的。</paragraph>", "author": "Zhili He et.al.", "authors": "Zhili He, Yu-Hsing Wang", "id": "2407.15714v1", "paper_url": "http://arxiv.org/abs/2407.15714v1", "repo": "https://github.com/hzlbbfrog/crackmamba"}}