{"2412.18639": {"publish_time": "2024-12-23", "title": "A Grounded Observer Framework for Establishing Guardrails for Foundation Models in Socially Sensitive Domains", "paper_summary": "As foundation models increasingly permeate sensitive domains such as\nhealthcare, finance, and mental health, ensuring their behavior meets desired\noutcomes and social expectations becomes critical. Given the complexities of\nthese high-dimensional models, traditional techniques for constraining agent\nbehavior, which typically rely on low-dimensional, discrete state and action\nspaces, cannot be directly applied. Drawing inspiration from robotic action\nselection techniques, we propose the grounded observer framework for\nconstraining foundation model behavior that offers both behavioral guarantees\nand real-time variability. This method leverages real-time assessment of\nlow-level behavioral characteristics to dynamically adjust model actions and\nprovide contextual feedback. To demonstrate this, we develop a system capable\nof sustaining contextually appropriate, casual conversations (\"small talk\"),\nwhich we then apply to a robot for novel, unscripted interactions with humans.\nFinally, we discuss potential applications of the framework for other social\ncontexts and areas for further research.", "paper_summary_zh": "隨著基礎模型日益滲透醫療保健、金融和心理健康等敏感領域，確保其行為符合預期的結果和社會期望至關重要。鑑於這些高維度模型的複雜性，傳統的約束代理行為技術（通常依賴於低維度、離散狀態和動作空間）無法直接應用。從機器人動作選擇技術中汲取靈感，我們提出了基礎模型行為約束的基礎觀察者框架，該框架既提供了行為保證，又提供了實時變異性。此方法利用對低層行為特徵的實時評估，來動態調整模型動作並提供情境回饋。為了證明這一點，我們開發了一個系統，能夠維持適當的語境、隨意的對話（「閒聊」），然後我們將其應用於機器人，以進行與人類的新穎、非腳本互動。最後，我們討論了該框架在其他社會環境中的潛在應用，以及進一步研究的領域。", "author": "Rebecca Ramnauth et.al.", "authors": "Rebecca Ramnauth, Dražen Brščić, Brian Scassellati", "id": "2412.18639v1", "paper_url": "http://arxiv.org/abs/2412.18639v1", "repo": "null"}}