{"2411.01807": {"publish_time": "2024-11-04", "title": "Can Language Models Enable In-Context Database?", "paper_summary": "Large language models (LLMs) are emerging as few-shot learners capable of\nhandling a variety of tasks, including comprehension, planning, reasoning,\nquestion answering, arithmetic calculations, and more. At the core of these\ncapabilities is LLMs' proficiency in representing and understanding structural\nor semi-structural data, such as tables and graphs. Numerous studies have\ndemonstrated that reasoning on tabular data or graphs is not only feasible for\nLLMs but also gives a promising research direction which treats these data as\nin-context data. The lightweight and human readable characteristics of\nin-context database can potentially make it an alternative for the traditional\ndatabase in typical RAG (Retrieval Augmented Generation) settings. However,\nalmost all current work focuses on static in-context data, which does not allow\ndynamic update. In this paper, to enable dynamic database update, delta\nencoding of database is proposed. We explore how data stored in traditional\nRDBMS can be encoded as in-context text and evaluate LLMs' proficiency for CRUD\n(Create, Read, Update and Delete) operations on in-context databases. A\nbenchmark named InConDB is presented and extensive experiments are conducted to\nshow the performance of different language models in enabling in-context\ndatabase by varying the database encoding method, prompting method, operation\ntype and input data distribution, revealing both the proficiency and\nlimitations.", "paper_summary_zh": "大型語言模型 (LLM) 逐漸成為僅需少量範例就能處理各種任務的學習者，包括理解、規劃、推理、問答、算術計算等。這些能力的核心是 LLM 在表示和理解結構化或半結構化資料（例如表格和圖形）方面的能力。許多研究已證明，LLM 不僅可以推論表格資料或圖形，還提供了一個有前景的研究方向，將這些資料視為語境資料。語境資料庫的輕量級和人類可讀取特性有可能使其成為典型 RAG（檢索擴充生成）設定中傳統資料庫的替代方案。然而，幾乎所有目前的工作都專注於靜態語境資料，這不允許動態更新。在本文中，為了實現動態資料庫更新，提出了資料庫的 delta 編碼。我們探討了如何將儲存在傳統 RDBMS 中的資料編碼為語境文字，並評估 LLM 在語境資料庫上進行 CRUD（建立、讀取、更新和刪除）操作的能力。提出了名為 InConDB 的基準，並進行了廣泛的實驗，以顯示不同語言模型在通過改變資料庫編碼方法、提示方法、操作類型和輸入資料分佈來啟用語境資料庫方面的效能，揭示了能力和限制。", "author": "Yu Pan et.al.", "authors": "Yu Pan, Hongfeng Yu, Tianjiao Zhao, Jianxin Sun", "id": "2411.01807v1", "paper_url": "http://arxiv.org/abs/2411.01807v1", "repo": "null"}}