{"2410.10596": {"publish_time": "2024-10-14", "title": "Neural networks that overcome classic challenges through practice", "paper_summary": "Since the earliest proposals for neural network models of the mind and brain,\ncritics have pointed out key weaknesses in these models compared to human\ncognitive abilities. Here we review recent work that has used metalearning to\nhelp overcome some of these challenges. We characterize their successes as\naddressing an important developmental problem: they provide machines with an\nincentive to improve X (where X represents the desired capability) and\nopportunities to practice it, through explicit optimization for X; unlike\nconventional approaches that hope for achieving X through generalization from\nrelated but different objectives. We review applications of this principle to\nfour classic challenges: systematicity, catastrophic forgetting, few-shot\nlearning and multi-step reasoning; we also discuss related aspects of human\ndevelopment in natural environments.", "paper_summary_zh": "自最早提出神经网络模型對心智與大腦的模型以來，批評者已指出這些模型與人類認知能力相比存在關鍵弱點。在此，我們回顧最近使用元學習來幫助克服其中一些挑戰的研究。我們將其成功歸因於解決一個重要的發展問題：它們為機器提供了一個改進 X（其中 X 代表所需的機能）的誘因，並透過針對 X 的明確最佳化來提供實踐它的機會；這與傳統方法不同，傳統方法希望透過對相關但不同的目標進行概化來達成 X。我們回顧了這個原理在四個經典挑戰中的應用：系統性、災難性遺忘、少量學習和多步驟推理；我們也討論了人類在自然環境中發展的相關面向。", "author": "Kazuki Irie et.al.", "authors": "Kazuki Irie, Brenden M. Lake", "id": "2410.10596v1", "paper_url": "http://arxiv.org/abs/2410.10596v1", "repo": "null"}}