{"2409.05370": {"publish_time": "2024-09-09", "title": "KARGEN: Knowledge-enhanced Automated Radiology Report Generation Using Large Language Models", "paper_summary": "Harnessing the robust capabilities of Large Language Models (LLMs) for\nnarrative generation, logical reasoning, and common-sense knowledge\nintegration, this study delves into utilizing LLMs to enhance automated\nradiology report generation (R2Gen). Despite the wealth of knowledge within\nLLMs, efficiently triggering relevant knowledge within these large models for\nspecific tasks like R2Gen poses a critical research challenge. This paper\npresents KARGEN, a Knowledge-enhanced Automated radiology Report GENeration\nframework based on LLMs. Utilizing a frozen LLM to generate reports, the\nframework integrates a knowledge graph to unlock chest disease-related\nknowledge within the LLM to enhance the clinical utility of generated reports.\nThis is achieved by leveraging the knowledge graph to distill disease-related\nfeatures in a designed way. Since a radiology report encompasses both normal\nand disease-related findings, the extracted graph-enhanced disease-related\nfeatures are integrated with regional image features, attending to both\naspects. We explore two fusion methods to automatically prioritize and select\nthe most relevant features. The fused features are employed by LLM to generate\nreports that are more sensitive to diseases and of improved quality. Our\napproach demonstrates promising results on the MIMIC-CXR and IU-Xray datasets.", "paper_summary_zh": "<paragraph>利用大型語言模型 (LLM) 強大的功能，進行敘事生成、邏輯推理和常識知識整合，本研究深入探討利用 LLM 來增強自動化放射報告生成 (R2Gen)。儘管 LLM 擁有豐富的知識，但要有效觸發這些大型模型中與特定任務（如 R2Gen）相關的知識，是一個重要的研究挑戰。本文提出了 KARGEN，一個基於 LLM 的知識增強自動化放射報告生成框架。利用凍結的 LLM 來生成報告，該框架整合了一個知識圖譜，以解鎖 LLM 中與胸部疾病相關的知識，以增強生成報告的臨床效用。這是透過利用知識圖譜以設計的方式提取與疾病相關的特徵來實現的。由於放射報告包含正常和疾病相關的發現，因此提取的圖形增強疾病相關特徵與區域影像特徵整合，兼顧兩個方面。我們探索了兩種融合方法，以自動優先排序和選擇最相關的特徵。融合的特徵由 LLM 使用，以生成對疾病更敏感且品質更高的報告。我們的做法在 MIMIC-CXR 和 IU-Xray 資料集上展示了有希望的結果。</paragraph>", "author": "Yingshu Li et.al.", "authors": "Yingshu Li, Zhanyu Wang, Yunyi Liu, Lei Wang, Lingqiao Liu, Luping Zhou", "id": "2409.05370v1", "paper_url": "http://arxiv.org/abs/2409.05370v1", "repo": "null"}}