{"2407.06990": {"publish_time": "2024-07-09", "title": "Segment-Based Interactive Machine Translation for Pre-trained Models", "paper_summary": "Pre-trained large language models (LLM) are starting to be widely used in\nmany applications. In this work, we explore the use of these models in\ninteractive machine translation (IMT) environments. In particular, we have\nchosen mBART (multilingual Bidirectional and Auto-Regressive Transformer) and\nmT5 (multilingual Text-to-Text Transfer Transformer) as the LLMs to perform our\nexperiments. The system generates perfect translations interactively using the\nfeedback provided by the user at each iteration. The Neural Machine Translation\n(NMT) model generates a preliminary hypothesis with the feedback, and the user\nvalidates new correct segments and performs a word correction--repeating the\nprocess until the sentence is correctly translated. We compared the performance\nof mBART, mT5, and a state-of-the-art (SoTA) machine translation model on a\nbenchmark dataset regarding user effort, Word Stroke Ratio (WSR), Key Stroke\nRatio (KSR), and Mouse Action Ratio (MAR). The experimental results indicate\nthat mBART performed comparably with SoTA models, suggesting that it is a\nviable option for this field of IMT. The implications of this finding extend to\nthe development of new machine translation models for interactive environments,\nas it indicates that some novel pre-trained models exhibit SoTA performance in\nthis domain, highlighting the potential benefits of adapting these models to\nspecific needs.", "paper_summary_zh": "<paragraph>預先訓練過的大型語言模型 (LLM) 開始在許多應用程式中廣泛使用。在這項工作中，我們探討在互動式機器翻譯 (IMT) 環境中使用這些模型。特別是，我們選擇 mBART（多語言雙向自迴歸轉換器）和 mT5（多語言文字轉文字傳輸轉換器）作為 LLM 來執行我們的實驗。系統使用使用者在每次反覆運算中提供的回饋，互動式地產生完美的翻譯。神經機器翻譯 (NMT) 模型使用回饋產生初步假設，使用者驗證新的正確區段並執行單字更正，重複這個程序，直到句子正確翻譯為止。我們比較了 mBART、mT5 和最先進 (SoTA) 機器翻譯模型在基準資料集中的效能，包括使用者工作量、單字筆劃比率 (WSR)、按鍵筆劃比率 (KSR) 和滑鼠動作比率 (MAR)。實驗結果顯示，mBART 的表現與 SoTA 模型相當，這表示它是 IMT 領域中可行的選項。這項發現的意義延伸到為互動式環境開發新的機器翻譯模型，因為這表示一些新穎的預先訓練模型在此領域展現出 SoTA 效能，突顯出將這些模型調整至特定需求的潛在好處。</paragraph>", "author": "Angel Navarro et.al.", "authors": "Angel Navarro, Francisco Casacuberta", "id": "2407.06990v1", "paper_url": "http://arxiv.org/abs/2407.06990v1", "repo": "null"}}