{"2209.06528": {"publish_time": "2022-09-14", "title": "Explainable AI for clinical and remote health applications: a survey on tabular and time series data", "paper_summary": "Nowadays Artificial Intelligence (AI) has become a fundamental component of\nhealthcare applications, both clinical and remote, but the best performing AI\nsystems are often too complex to be self-explaining. Explainable AI (XAI)\ntechniques are defined to unveil the reasoning behind the system's predictions\nand decisions, and they become even more critical when dealing with sensitive\nand personal health data. It is worth noting that XAI has not gathered the same\nattention across different research areas and data types, especially in\nhealthcare. In particular, many clinical and remote health applications are\nbased on tabular and time series data, respectively, and XAI is not commonly\nanalysed on these data types, while computer vision and Natural Language\nProcessing (NLP) are the reference applications. To provide an overview of XAI\nmethods that are most suitable for tabular and time series data in the\nhealthcare domain, this paper provides a review of the literature in the last 5\nyears, illustrating the type of generated explanations and the efforts provided\nto evaluate their relevance and quality. Specifically, we identify clinical\nvalidation, consistency assessment, objective and standardised quality\nevaluation, and human-centered quality assessment as key features to ensure\neffective explanations for the end users. Finally, we highlight the main\nresearch challenges in the field as well as the limitations of existing XAI\nmethods.", "paper_summary_zh": "現今，人工智慧 (AI) 已成為醫療保健應用程式中不可或缺的組成部分，無論是臨床或遠距醫療，但效能最佳的 AI 系統通常過於複雜，無法自行解釋。可解釋 AI (XAI) 技術被定義為揭示系統預測和決策背後的推理，當處理敏感且個人的健康資料時，它們變得更為關鍵。值得注意的是，XAI 並未在不同的研究領域和資料類型中獲得相同的關注，特別是在醫療保健中。特別是，許多臨床和遠距醫療應用程式分別基於表格和時間序列資料，而 XAI 並未針對這些資料類型進行分析，而電腦視覺和自然語言處理 (NLP) 則為參考應用程式。為了提供最適合醫療保健領域中表格和時間序列資料的 XAI 方法概觀，本文回顧了過去 5 年的文獻，說明產生的解釋類型以及評估其相關性和品質所做的努力。具體來說，我們將臨床驗證、一致性評估、客觀且標準化的品質評估以及以人為中心的品質評估確定為確保對最終使用者提供有效解釋的主要特徵。最後，我們強調了該領域的主要研究挑戰以及現有 XAI 方法的限制。", "author": "Flavio Di Martino et.al.", "authors": "Flavio Di Martino, Franca Delmastro", "id": "2209.06528v1", "paper_url": "http://arxiv.org/abs/2209.06528v1", "repo": "null"}}