{"2408.14026": {"publish_time": "2024-08-26", "title": "Empowering Low-Resource Language ASR via Large-Scale Pseudo Labeling", "paper_summary": "In this study, we tackle the challenge of limited labeled data for\nlow-resource languages in ASR, focusing on Hindi. Specifically, we explore\npseudo-labeling, by proposing a generic framework combining multiple ideas from\nexisting works. Our framework integrates multiple base models for transcription\nand evaluators for assessing audio-transcript pairs, resulting in robust\npseudo-labeling for low resource languages. We validate our approach with a new\nbenchmark, IndicYT, comprising diverse YouTube audio files from multiple\ncontent categories. Our findings show that augmenting pseudo labeled data from\nYouTube with existing training data leads to significant performance\nimprovements on IndicYT, without affecting performance on out-of-domain\nbenchmarks, demonstrating the efficacy of pseudo-labeled data in enhancing ASR\ncapabilities for low-resource languages. The benchmark, code and models\ndeveloped as a part of this work will be made publicly available.", "paper_summary_zh": "在這項研究中，我們應對低資源語言在 ASR 中標籤資料有限的挑戰，專注於印地語。具體來說，我們探討偽標籤，提出一個通用框架，結合現有作品中的多個想法。我們的框架整合多個基礎模型，用於轉錄和評估器，用於評估音訊轉錄對，從而為低資源語言提供穩健的偽標籤。我們使用一個新的基準 IndicYT 來驗證我們的做法，其中包含來自多個內容類別的各種 YouTube 音訊檔案。我們的研究結果表明，使用現有訓練資料擴充來自 YouTube 的偽標籤資料，會顯著提升 IndicYT 的效能，而不會影響領域外基準的效能，這證明了偽標籤資料在提升低資源語言的 ASR 能力方面的效用。作為這項工作一部分開發的基準、程式碼和模型將公開提供。", "author": "Kaushal Santosh Bhogale et.al.", "authors": "Kaushal Santosh Bhogale, Deovrat Mehendale, Niharika Parasa, Sathish Kumar Reddy G, Tahir Javed, Pratyush Kumar, Mitesh M. Khapra", "id": "2408.14026v1", "paper_url": "http://arxiv.org/abs/2408.14026v1", "repo": "null"}}