{"2407.04067": {"publish_time": "2024-07-04", "title": "Semantic Graphs for Syntactic Simplification: A Revisit from the Age of LLM", "paper_summary": "Symbolic sentence meaning representations, such as AMR (Abstract Meaning\nRepresentation) provide expressive and structured semantic graphs that act as\nintermediates that simplify downstream NLP tasks. However, the\ninstruction-following capability of large language models (LLMs) offers a\nshortcut to effectively solve NLP tasks, questioning the utility of semantic\ngraphs. Meanwhile, recent work has also shown the difficulty of using meaning\nrepresentations merely as a helpful auxiliary for LLMs. We revisit the position\nof semantic graphs in syntactic simplification, the task of simplifying\nsentence structures while preserving their meaning, which requires semantic\nunderstanding, and evaluate it on a new complex and natural dataset. The\nAMR-based method that we propose, AMRS$^3$, demonstrates that state-of-the-art\nmeaning representations can lead to easy-to-implement simplification methods\nwith competitive performance and unique advantages in cost, interpretability,\nand generalization. With AMRS$^3$ as an anchor, we discover that syntactic\nsimplification is a task where semantic graphs are helpful in LLM prompting. We\npropose AMRCoC prompting that guides LLMs to emulate graph algorithms for\nexplicit symbolic reasoning on AMR graphs, and show its potential for improving\nLLM on semantic-centered tasks like syntactic simplification.", "paper_summary_zh": "符號句子意義表徵，例如 AMR（抽象意義表徵），提供表達性和結構化的語義圖表，作為簡化下游 NLP 任務的中介。然而，大型語言模型 (LLM) 的指令遵循能力提供了一個捷徑來有效解決 NLP 任務，質疑語義圖表的效用。同時，最近的研究也表明僅將意義表徵用作 LLM 的輔助工具的難度。我們重新審視語義圖表在語法簡化中的位置，語法簡化的任務是在保留句子結構的同時簡化句子結構，這需要語義理解，並在一個新的複雜且自然的數據集上對其進行評估。我們提出的基於 AMR 的方法 AMRS$^3$ 證明了最先進的意義表徵可以導致易於實現的簡化方法，在成本、可解釋性和泛化方面具有競爭優勢和獨特優勢。以 AMRS$^3$ 為錨點，我們發現語法簡化是一項語義圖表有助於 LLM 提示的任務。我們提出 AMRCoC 提示，指導 LLM 模擬圖形演算法，對 AMR 圖形進行明確的符號推理，並展示其在改進 LLM 在以語義為中心的任務（如語法簡化）方面的潛力。", "author": "Peiran Yao et.al.", "authors": "Peiran Yao, Kostyantyn Guzhva, Denilson Barbosa", "id": "2407.04067v1", "paper_url": "http://arxiv.org/abs/2407.04067v1", "repo": "null"}}