{"2405.12502": {"publish_time": "2024-05-21", "title": "EntropyStop: Unsupervised Deep Outlier Detection with Loss Entropy", "paper_summary": "Unsupervised Outlier Detection (UOD) is an important data mining task. With\nthe advance of deep learning, deep Outlier Detection (OD) has received broad\ninterest. Most deep UOD models are trained exclusively on clean datasets to\nlearn the distribution of the normal data, which requires huge manual efforts\nto clean the real-world data if possible. Instead of relying on clean datasets,\nsome approaches directly train and detect on unlabeled contaminated datasets,\nleading to the need for methods that are robust to such conditions. Ensemble\nmethods emerged as a superior solution to enhance model robustness against\ncontaminated training sets. However, the training time is greatly increased by\nthe ensemble.\n  In this study, we investigate the impact of outliers on the training phase,\naiming to halt training on unlabeled contaminated datasets before performance\ndegradation. Initially, we noted that blending normal and anomalous data causes\nAUC fluctuations, a label-dependent measure of detection accuracy. To\ncircumvent the need for labels, we propose a zero-label entropy metric named\nLoss Entropy for loss distribution, enabling us to infer optimal stopping\npoints for training without labels. Meanwhile, we theoretically demonstrate\nnegative correlation between entropy metric and the label-based AUC. Based on\nthis, we develop an automated early-stopping algorithm, EntropyStop, which\nhalts training when loss entropy suggests the maximum model detection\ncapability. We conduct extensive experiments on ADBench (including 47 real\ndatasets), and the overall results indicate that AutoEncoder (AE) enhanced by\nour approach not only achieves better performance than ensemble AEs but also\nrequires under 1\\% of training time. Lastly, our proposed metric and\nearly-stopping approach are evaluated on other deep OD models, exhibiting their\nbroad potential applicability.", "paper_summary_zh": "無監督異常值偵測 (UOD) 是一項重要的資料探勘任務。隨著深度學習的進展，深度異常值偵測 (OD) 已廣受關注。大多數深度 UOD 模型僅在乾淨的資料集上訓練，以了解正常資料的分布，如果可能的話，這需要大量手動工作來清理真實世界的資料。有些方法並非依賴乾淨的資料集，而是直接在未標籤的受污染資料集上進行訓練和偵測，導致需要對此類狀況具有穩健性的方法。整體方法已成為增強模型對受污染訓練集穩健性的優異解決方案。然而，整體會大幅增加訓練時間。\n在本研究中，我們探討異常值對訓練階段的影響，旨在暫停在未標籤的受污染資料集上進行訓練，以避免效能下降。最初，我們注意到混合正常和異常資料會導致 AUC 波動，這是一種與標籤相關的偵測準確度測量。為了避免需要標籤，我們提出一個名為損失熵的零標籤熵指標，用於損失分佈，使我們能夠推論出沒有標籤的最佳訓練停止點。同時，我們在理論上證明了熵指標和基於標籤的 AUC 之間存在負相關性。基於此，我們開發了一種自動早期停止演算法 EntropyStop，當損失熵建議最大模型偵測能力時，便會停止訓練。我們在 ADBench（包括 47 個真實資料集）上進行廣泛的實驗，整體結果表明，由我們的方法增強的自動編碼器 (AE) 不僅比整體 AE 達到更好的效能，而且訓練時間不到 1%。最後，我們提出的指標和早期停止方法在其他深度 OD 模型上進行評估，展示了它們廣泛的潛在應用性。", "author": "Yihong Huang et.al.", "authors": "Yihong Huang, Yuang Zhang, Liping Wang, Fan Zhang, Xuemin Lin", "id": "2405.12502v1", "paper_url": "http://arxiv.org/abs/2405.12502v1", "repo": "null"}}