{"2502.11812": {"publish_time": "2025-02-17", "title": "Towards Understanding Fine-Tuning Mechanisms of LLMs via Circuit Analysis", "paper_summary": "Fine-tuning significantly improves the performance of Large Language Models\n(LLMs), yet its underlying mechanisms remain poorly understood. This paper aims\nto provide an in-depth interpretation of the fine-tuning process through\ncircuit analysis, a popular tool in Mechanistic Interpretability (MI). Unlike\nprevious studies\n\\cite{prakash2024finetuningenhancesexistingmechanisms,chhabra2024neuroplasticity}\nthat focus on tasks where pre-trained models already perform well, we develop a\nset of mathematical tasks where fine-tuning yields substantial performance\ngains, which are closer to the practical setting. In our experiments, we\nidentify circuits at various checkpoints during fine-tuning and examine the\ninterplay between circuit analysis, fine-tuning methods, and task complexities.\nFirst, we find that while circuits maintain high node similarity before and\nafter fine-tuning, their edges undergo significant changes, which is in\ncontrast to the previous work\n\\cite{prakash2024finetuningenhancesexistingmechanisms,chhabra2024neuroplasticity}\nthat show circuits only add some additional components after fine-tuning. Based\non these observations, we develop a circuit-aware Low-Rank Adaptation (LoRA)\nmethod, which assigns ranks to layers based on edge changes in the circuits.\nExperimental results demonstrate that our circuit-based LoRA algorithm achieves\nan average performance improvement of 2.46\\% over standard LoRA with similar\nparameter sizes. Furthermore, we explore how combining circuits from subtasks\ncan enhance fine-tuning in compositional tasks, providing new insights into the\ndesign of such tasks and deepening the understanding of circuit dynamics and\nfine-tuning mechanisms.", "paper_summary_zh": "微調大幅提升大型語言模型 (LLM) 的效能，但其底層機制仍鮮為人知。本文旨在透過電路分析，一種機械可解釋性 (MI) 中廣泛使用的工具，提供微調過程的深入詮釋。不同於先前的研究\n\\cite{prakash2024finetuningenhancesexistingmechanisms,chhabra2024neuroplasticity}\n專注於預訓練模型已表現良好的任務，我們開發了一組數學任務，其中微調產生顯著的效能提升，更接近實際設定。在我們的實驗中，我們在微調期間的各種檢查點識別電路，並探討電路分析、微調方法和任務複雜度之間的交互作用。首先，我們發現電路在微調前後雖然維持高節點相似度，但其邊緣卻經歷顯著變化，這與先前的研究\n\\cite{prakash2024finetuningenhancesexistingmechanisms,chhabra2024neuroplasticity}\n顯示電路僅在微調後新增一些額外組件的結果相反。基於這些觀察，我們開發了一個電路感知低秩適應 (LoRA) 方法，根據電路中的邊緣變化為層級分配秩。實驗結果證明，我們的基於電路的 LoRA 演算法在參數大小相似的條件下，比標準 LoRA 平均提升了 2.46% 的效能。此外，我們探討如何結合子任務的電路來增強組合任務中的微調，為此類任務的設計提供新的見解，並加深對電路動態和微調機制的理解。", "author": "Xu Wang et.al.", "authors": "Xu Wang, Yan Hu, Wenyu Du, Reynold Cheng, Benyou Wang, Difan Zou", "id": "2502.11812v1", "paper_url": "http://arxiv.org/abs/2502.11812v1", "repo": "null"}}