{"2407.02996": {"publish_time": "2024-07-03", "title": "Are Large Language Models Consistent over Value-laden Questions?", "paper_summary": "Large language models (LLMs) appear to bias their survey answers toward\ncertain values. Nonetheless, some argue that LLMs are too inconsistent to\nsimulate particular values. Are they? To answer, we first define value\nconsistency as the similarity of answers across (1) paraphrases of one\nquestion, (2) related questions under one topic, (3) multiple-choice and\nopen-ended use-cases of one question, and (4) multilingual translations of a\nquestion to English, Chinese, German, and Japanese. We apply these measures to\na few large ($>=34b$), open LLMs including llama-3, as well as gpt-4o, using\neight thousand questions spanning more than 300 topics. Unlike prior work, we\nfind that models are relatively consistent across paraphrases, use-cases,\ntranslations, and within a topic. Still, some inconsistencies remain. Models\nare more consistent on uncontroversial topics (e.g., in the U.S.,\n\"Thanksgiving\") than on controversial ones (\"euthanasia\"). Base models are both\nmore consistent compared to fine-tuned models and are uniform in their\nconsistency across topics, while fine-tuned models are more inconsistent about\nsome topics (\"euthanasia\") than others (\"women's rights\") like our human\nsubjects (n=165).", "paper_summary_zh": "大型語言模型 (LLM) 似乎會將其調查答案偏向於某些價值觀。儘管如此，有人認為 LLM 的不一致性過高，無法模擬特定值。是這樣嗎？為了回答這個問題，我們首先將價值一致性定義為以下各項答案的相似性：(1) 一個問題的同義詞改寫，(2) 一個主題下的相關問題，(3) 一個問題的多選和開放式用例，以及 (4) 一個問題的多語言翻譯成英文、中文、德文和日文。我們將這些措施應用於幾個大型 ($>=34b$) 開放式 LLM，包括 llama-3 和 gpt-4o，使用涵蓋 300 多個主題的 8,000 個問題。與先前的研究不同，我們發現模型在同義詞改寫、用例、翻譯以及主題內部具有相對一致性。儘管如此，仍存在一些不一致性。模型在無爭議性主題（例如，在美國，「感恩節」）上的表現比在有爭議性主題（「安樂死」）上更一致。基礎模型與微調模型相比，既更一致，且其在各個主題間的一致性也較為均勻，而微調模型在某些主題（「安樂死」）上比在其他主題（「婦女權利」）上更不一致，就像我們的人類受試者 (n=165) 一樣。", "author": "Jared Moore et.al.", "authors": "Jared Moore, Tanvi Deshpande, Diyi Yang", "id": "2407.02996v1", "paper_url": "http://arxiv.org/abs/2407.02996v1", "repo": "null"}}