{"2407.15390": {"publish_time": "2024-07-22", "title": "ALLaM: Large Language Models for Arabic and English", "paper_summary": "We present ALLaM: Arabic Large Language Model, a series of large language\nmodels to support the ecosystem of Arabic Language Technologies (ALT). ALLaM is\ncarefully trained considering the values of language alignment and knowledge\ntransfer at scale. Our autoregressive decoder-only architecture models\ndemonstrate how second-language acquisition via vocabulary expansion and\npretraining on a mixture of Arabic and English text can steer a model towards a\nnew language (Arabic) without any catastrophic forgetting in the original\nlanguage (English). Furthermore, we highlight the effectiveness of using\nparallel/translated data to aid the process of knowledge alignment between\nlanguages. Finally, we show that extensive alignment with human preferences can\nsignificantly enhance the performance of a language model compared to models of\na larger scale with lower quality alignment. ALLaM achieves state-of-the-art\nperformance in various Arabic benchmarks, including MMLU Arabic, ACVA, and\nArabic Exams. Our aligned models improve both in Arabic and English from their\nbase aligned models.", "paper_summary_zh": "我們展示 ALLaM：阿拉伯大型語言模型，一系列大型語言模型，以支援阿拉伯語言技術 (ALT) 生態系統。ALLaM 經過仔細訓練，考慮了語言對齊和知識轉移的價值。我們的自迴歸僅解碼器架構模型展示了如何透過詞彙擴充和在阿拉伯語和英語文本混合體上進行預訓練，來引導模型朝向一種新語言（阿拉伯語），而不會對原始語言（英語）造成任何災難性遺忘。此外，我們強調使用平行/翻譯資料來協助語言之間知識對齊過程的有效性。最後，我們表明與人類偏好的廣泛對齊可以顯著提升語言模型的效能，與規模較大但對齊品質較低的模型相比。ALLaM 在各種阿拉伯語基準測試中達成最先進的效能，包括 MMLU Arabic、ACVA 和 Arabic Exams。我們對齊的模型從其基礎對齊模型中在阿拉伯語和英語方面都有所改進。", "author": "M Saiful Bari et.al.", "authors": "M Saiful Bari, Yazeed Alnumay, Norah A. Alzahrani, Nouf M. Alotaibi, Hisham A. Alyahya, Sultan AlRashed, Faisal A. Mirza, Shaykhah Z. Alsubaie, Hassan A. Alahmed, Ghadah Alabduljabbar, Raghad Alkhathran, Yousef Almushayqih, Raneem Alnajim, Salman Alsubaihi, Maryam Al Mansour, Majed Alrubaian, Ali Alammari, Zaki Alawami, Abdulmohsen Al-Thubaity, Ahmed Abdelali, Jeril Kuriakose, Abdalghani Abujabal, Nora Al-Twairesh, Areeb Alowisheq, Haidar Khan", "id": "2407.15390v1", "paper_url": "http://arxiv.org/abs/2407.15390v1", "repo": "null"}}