{"2410.14602": {"publish_time": "2024-10-18", "title": "How Does Data Diversity Shape the Weight Landscape of Neural Networks?", "paper_summary": "To enhance the generalization of machine learning models to unseen data,\ntechniques such as dropout, weight decay ($L_2$ regularization), and noise\naugmentation are commonly employed. While regularization methods (i.e., dropout\nand weight decay) are geared toward adjusting model parameters to prevent\noverfitting, data augmentation increases the diversity of the input training\nset, a method purported to improve accuracy and calibration error. In this\npaper, we investigate the impact of each of these techniques on the parameter\nspace of neural networks, with the goal of understanding how they alter the\nweight landscape in transfer learning scenarios. To accomplish this, we employ\nRandom Matrix Theory to analyze the eigenvalue distributions of pre-trained\nmodels, fine-tuned using these techniques but using different levels of data\ndiversity, for the same downstream tasks. We observe that diverse data\ninfluences the weight landscape in a similar fashion as dropout. Additionally,\nwe compare commonly used data augmentation methods with synthetic data created\nby generative models. We conclude that synthetic data can bring more diversity\ninto real input data, resulting in a better performance on out-of-distribution\ntest instances.", "paper_summary_zh": "為了增強機器學習模型對未見資料的概化能力，常使用諸如中輟、權重衰減（$L_2$ 正則化）和雜訊擴充等技術。雖然正則化方法（例如中輟和權重衰減）旨在調整模型參數以防止過度擬合，但資料擴充增加了輸入訓練組的多樣性，這是一種據稱可以改善準確性和校準誤差的方法。在本文中，我們探討了這些技術對神經網路參數空間的影響，目的是了解它們如何在轉移學習場景中改變權重景觀。為了達成此目標，我們採用隨機矩陣理論來分析預訓練模型的特徵值分佈，使用這些技術進行微調，但使用不同程度的資料多樣性，以執行相同的下游任務。我們觀察到，多樣化的資料以類似於中輟的方式影響權重景觀。此外，我們將常用的資料擴充方法與生成模型所建立的合成資料進行比較。我們得出結論，合成資料可以為真實輸入資料帶來更多樣性，從而提高對分布外測試例項的效能。", "author": "Yang Ba et.al.", "authors": "Yang Ba, Michelle V. Mancenido, Rong Pan", "id": "2410.14602v1", "paper_url": "http://arxiv.org/abs/2410.14602v1", "repo": "null"}}