{"2410.15884": {"publish_time": "2024-10-21", "title": "Using GPT Models for Qualitative and Quantitative News Analytics in the 2024 US Presidental Election Process", "paper_summary": "The paper considers an approach of using Google Search API and GPT-4o model\nfor qualitative and quantitative analyses of news through retrieval-augmented\ngeneration (RAG). This approach was applied to analyze news about the 2024 US\npresidential election process. Different news sources for different time\nperiods have been analyzed. Quantitative scores generated by GPT model have\nbeen analyzed using Bayesian regression to derive trend lines. The\ndistributions found for the regression parameters allow for the analysis of\nuncertainty in the election process. The obtained results demonstrate that\nusing the GPT models for news analysis, one can get informative analytics and\nprovide key insights that can be applied in further analyses of election\nprocesses.", "paper_summary_zh": "本文考慮使用 Google Search API 和 GPT-4o 模型的方法，透過檢索增強生成 (RAG) 進行新聞的定性和定量分析。此方法用於分析有關 2024 年美國總統選舉過程的新聞。已分析不同時間段的不同新聞來源。已使用貝氏迴歸分析 GPT 模型產生的量化分數，以導出趨勢線。迴歸參數中發現的分布允許分析選舉過程中的不確定性。獲得的結果表明，使用 GPT 模型進行新聞分析，可以獲得有意義的分析並提供關鍵見解，這些見解可以應用於選舉過程的進一步分析中。", "author": "Bohdan M. Pavlyshenko et.al.", "authors": "Bohdan M. Pavlyshenko", "id": "2410.15884v1", "paper_url": "http://arxiv.org/abs/2410.15884v1", "repo": "null"}}