{"2409.20374": {"publish_time": "2024-09-30", "title": "Word-wise intonation model for cross-language TTS systems", "paper_summary": "In this paper we propose a word-wise intonation model for Russian language\nand show how it can be generalized for other languages. The proposed model is\nsuitable for automatic data markup and its extended application to\ntext-to-speech systems. It can also be implemented for an intonation contour\nmodeling by using rule-based algorithms or by predicting contours with language\nmodels. The key idea is a partial elimination of the variability connected with\ndifferent placements of a stressed syllable in a word. It is achieved with\nsimultaneous applying of pitch simplification with a dynamic time warping\nclustering. The proposed model could be used as a tool for intonation research\nor as a backbone for prosody description in text-to-speech systems. As the\nadvantage of the model, we show its relations with the existing intonation\nsystems as well as the possibility of using language models for prosody\nprediction. Finally, we demonstrate some practical evidence of the system\nrobustness to parameter variations.", "paper_summary_zh": "在本文中，我们提出了俄语单词级的语调模型，并展示了如何将其推广到其他语言。所提出的模型适用于自动数据标记及其在文本到语音系统的扩展应用。它还可以通过使用基于规则的算法或通过使用语言模型预测轮廓来实现语调轮廓建模。关键思想是部分消除与单词中重读音节不同位置相关的可变性。这是通过同时应用音高简化和动态时间扭曲聚类来实现的。所提出的模型可以用作语调研究的工具，或作为文本到语音系统中韵律描述的骨干。作为该模型的优点，我们展示了它与现有语调系统的关系，以及使用语言模型进行韵律预测的可能性。最后，我们展示了系统对参数变化的鲁棒性的实际证据。", "author": "Tomilov A. A. et.al.", "authors": "Tomilov A. A., Gromova A. Y., Svischev A. N", "id": "2409.20374v1", "paper_url": "http://arxiv.org/abs/2409.20374v1", "repo": "null"}}