{"2410.01706": {"publish_time": "2024-10-02", "title": "Performant, Memory Efficient and Scalable Multi-Agent Reinforcement Learning", "paper_summary": "As the field of multi-agent reinforcement learning (MARL) progresses towards\nlarger and more complex environments, achieving strong performance while\nmaintaining memory efficiency and scalability to many agents becomes\nincreasingly important. Although recent research has led to several advanced\nalgorithms, to date, none fully address all of these key properties\nsimultaneously. In this work, we introduce Sable, a novel and theoretically\nsound algorithm that adapts the retention mechanism from Retentive Networks to\nMARL. Sable's retention-based sequence modelling architecture allows for\ncomputationally efficient scaling to a large number of agents, as well as\nmaintaining a long temporal context, making it well-suited for large-scale\npartially observable environments. Through extensive evaluations across six\ndiverse environments, we demonstrate how Sable is able to significantly\noutperform existing state-of-the-art methods in the majority of tasks (34 out\nof 45, roughly 75\\%). Furthermore, Sable demonstrates stable performance as we\nscale the number of agents, handling environments with more than a thousand\nagents while exhibiting a linear increase in memory usage. Finally, we conduct\nablation studies to isolate the source of Sable's performance gains and confirm\nits efficient computational memory usage. Our results highlight Sable's\nperformance and efficiency, positioning it as a leading approach to MARL at\nscale.", "paper_summary_zh": "隨著多重代理強化學習 (MARL) 領域朝向更大型、更複雜的環境邁進，在維持記憶效率和可擴充性至許多代理的同時達成強勁的效能變得越來越重要。儘管最近的研究已導致數種進階演算法，但迄今為止，沒有任何演算法能同時完全解決所有這些關鍵屬性。在這項研究中，我們介紹 Sable，一種新穎且理論上健全的演算法，它將保留機制從保留式網路改編至 MARL。Sable 基於保留的序列建模架構允許以計算上有效率的方式擴充至大量代理，並維持長期的時間脈絡，使其非常適合於大規模的部分可觀察環境。透過在六個不同的環境中進行廣泛評估，我們展示 Sable 如何在大部分任務中（45 個中的 34 個，大約 75%）顯著優於現有的最先進方法。此外，當我們擴充代理數量時，Sable 展現出穩定的效能，處理具有超過一千個代理的環境，同時展現出記憶體使用量的線性增加。最後，我們進行消融研究以分離 Sable 效能提升的來源，並確認其有效率的計算記憶體使用。我們的結果突顯了 Sable 的效能和效率，將其定位為大規模 MARL 的領先方法。", "author": "Omayma Mahjoub et.al.", "authors": "Omayma Mahjoub, Sasha Abramowitz, Ruan de Kock, Wiem Khlifi, Simon du Toit, Jemma Daniel, Louay Ben Nessir, Louise Beyers, Claude Formanek, Liam Clark, Arnu Pretorius", "id": "2410.01706v1", "paper_url": "http://arxiv.org/abs/2410.01706v1", "repo": "null"}}