{"2409.11074": {"publish_time": "2024-09-17", "title": "RoMath: A Mathematical Reasoning Benchmark in Romanian", "paper_summary": "Mathematics has long been conveyed through natural language, primarily for\nhuman understanding. With the rise of mechanized mathematics and proof\nassistants, there is a growing need to understand informal mathematical text,\nyet most existing benchmarks focus solely on English, overlooking other\nlanguages. This paper introduces RoMath, a Romanian mathematical reasoning\nbenchmark suite comprising three datasets: RoMath-Baccalaureate,\nRoMath-Competitions and RoMath-Synthetic, which cover a range of mathematical\ndomains and difficulty levels, aiming to improve non-English language models\nand promote multilingual AI development. By focusing on Romanian, a\nlow-resource language with unique linguistic features, RoMath addresses the\nlimitations of Anglo-centric models and emphasizes the need for dedicated\nresources beyond simple automatic translation. We benchmark several open-weight\nlanguage models, highlighting the importance of creating resources for\nunderrepresented languages. We make the code and dataset available.", "paper_summary_zh": "數學長期以來透過自然語言傳達，主要供人類理解。隨著機械化數學和證明輔助的興起，理解非正式數學文本的需求日益增加，但現有的基準測試大多只關注英文，忽略了其他語言。本文介紹 RoMath，一個羅馬尼亞數學推理基準測試套件，包含三個資料集：RoMath-Baccalaureate、RoMath-Competitions 和 RoMath-Synthetic，涵蓋範圍廣泛的數學領域和難度等級，旨在改善非英語語言模型並促進多語言 AI 開發。RoMath 專注於羅馬尼亞語，一種具有獨特語言特徵的低資源語言，解決了以英語為中心的模型的限制，並強調了除了簡單的自動翻譯之外，需要專門的資源。我們對幾個開放權重的語言模型進行基準測試，強調為代表性不足的語言建立資源的重要性。我們提供程式碼和資料集。", "author": "Adrian Cosma et.al.", "authors": "Adrian Cosma, Ana-Maria Bucur, Emilian Radoi", "id": "2409.11074v1", "paper_url": "http://arxiv.org/abs/2409.11074v1", "repo": "https://github.com/cosmaadrian/romath"}}