{"2408.04693": {"publish_time": "2024-08-08", "title": "Understanding the Performance and Estimating the Cost of LLM Fine-Tuning", "paper_summary": "Due to the cost-prohibitive nature of training Large Language Models (LLMs),\nfine-tuning has emerged as an attractive alternative for specializing LLMs for\nspecific tasks using limited compute resources in a cost-effective manner. In\nthis paper, we characterize sparse Mixture of Experts (MoE) based LLM\nfine-tuning to understand their accuracy and runtime performance on a single\nGPU. Our evaluation provides unique insights into the training efficacy of\nsparse and dense versions of MoE models, as well as their runtime\ncharacteristics, including maximum batch size, execution time breakdown,\nend-to-end throughput, GPU hardware utilization, and load distribution. Our\nstudy identifies the optimization of the MoE layer as crucial for further\nimproving the performance of LLM fine-tuning. Using our profiling results, we\nalso develop and validate an analytical model to estimate the cost of LLM\nfine-tuning on the cloud. This model, based on parameters of the model and GPU\narchitecture, estimates LLM throughput and the cost of training, aiding\npractitioners in industry and academia to budget the cost of fine-tuning a\nspecific model.", "paper_summary_zh": "由於訓練大型語言模型 (LLM) 的成本過高，微調已成為一種有吸引力的替代方案，可以利用有限的運算資源以具有成本效益的方式將 LLM 專門化於特定任務。在本文中，我們描述了稀疏專家混合 (MoE) 基於 LLM 的微調，以了解它們在單一 GPU 上的準確度和執行時間效能。我們的評估提供了對稀疏和密集版本的 MoE 模型訓練效能的獨特見解，以及它們的執行時間特性，包括最大批次大小、執行時間細目、端到端吞吐量、GPU 硬體使用率和負載分佈。我們的研究發現，MoE 層的最佳化對於進一步提升 LLM 微調效能至關重要。利用我們的分析結果，我們還開發並驗證了一個分析模型，以估計雲端上 LLM 微調的成本。此模型基於模型和 GPU 架構的參數，估計 LLM 吞吐量和訓練成本，協助業界和學術界的從業人員預算微調特定模型的成本。", "author": "Yuchen Xia et.al.", "authors": "Yuchen Xia, Jiho Kim, Yuhan Chen, Haojie Ye, Souvik Kundu, Cong, Hao, Nishil Talati", "id": "2408.04693v1", "paper_url": "http://arxiv.org/abs/2408.04693v1", "repo": "https://github.com/stsxxx/finetune"}}