{"2409.11241": {"publish_time": "2024-09-17", "title": "Spontaneous Informal Speech Dataset for Punctuation Restoration", "paper_summary": "Presently, punctuation restoration models are evaluated almost solely on\nwell-structured, scripted corpora. On the other hand, real-world ASR systems\nand post-processing pipelines typically apply towards spontaneous speech with\nsignificant irregularities, stutters, and deviations from perfect grammar. To\naddress this discrepancy, we introduce SponSpeech, a punctuation restoration\ndataset derived from informal speech sources, which includes punctuation and\ncasing information. In addition to publicly releasing the dataset, we\ncontribute a filtering pipeline that can be used to generate more data. Our\nfiltering pipeline examines the quality of both speech audio and transcription\ntext. We also carefully construct a ``challenging\" test set, aimed at\nevaluating models' ability to leverage audio information to predict otherwise\ngrammatically ambiguous punctuation. SponSpeech is available at\nhttps://github.com/GitHubAccountAnonymous/PR, along with all code for dataset\nbuilding and model runs.", "paper_summary_zh": "目前，標點符號還原模型幾乎只針對結構良好的腳本語料庫進行評估。另一方面，現實世界的 ASR 系統和後處理管道通常適用於自發性語音，其中存在顯著的不規則性、口吃和語法缺陷。為了解決這種差異，我們引入了 SponSpeech，這是一個從非正式語音來源派生的標點符號還原資料集，其中包括標點符號和大小寫資訊。除了公開發佈資料集外，我們還提供了一個過濾管道，可用於生成更多資料。我們的過濾管道檢查語音音訊和轉錄文字的品質。我們還仔細構建了一個「具挑戰性」的測試集，旨在評估模型利用音訊資訊來預測在語法上模稜兩可的標點符號的能力。SponSpeech 可在 https://github.com/GitHubAccountAnonymous/PR 取得，其中包含所有用於資料集建置和模型運行的程式碼。", "author": "Xing Yi Liu et.al.", "authors": "Xing Yi Liu, Homayoon Beigi", "id": "2409.11241v1", "paper_url": "http://arxiv.org/abs/2409.11241v1", "repo": "https://github.com/githubaccountanonymous/pr"}}