{"2406.07887": {"publish_time": "2024-06-12", "title": "An Empirical Study of Mamba-based Language Models", "paper_summary": "Selective state-space models (SSMs) like Mamba overcome some of the\nshortcomings of Transformers, such as quadratic computational complexity with\nsequence length and large inference-time memory requirements from the key-value\ncache. Moreover, recent studies have shown that SSMs can match or exceed the\nlanguage modeling capabilities of Transformers, making them an attractive\nalternative. In a controlled setting (e.g., same data), however, studies so far\nhave only presented small scale experiments comparing SSMs to Transformers. To\nunderstand the strengths and weaknesses of these architectures at larger\nscales, we present a direct comparison between 8B-parameter Mamba, Mamba-2, and\nTransformer models trained on the same datasets of up to 3.5T tokens. We also\ncompare these models to a hybrid architecture consisting of 43% Mamba-2, 7%\nattention, and 50% MLP layers (Mamba-2-Hybrid). Using a diverse set of tasks,\nwe answer the question of whether Mamba models can match Transformers at larger\ntraining budgets. Our results show that while pure SSMs match or exceed\nTransformers on many tasks, they lag behind Transformers on tasks which require\nstrong copying or in-context learning abilities (e.g., 5-shot MMLU, Phonebook)\nor long-context reasoning. In contrast, we find that the 8B Mamba-2-Hybrid\nexceeds the 8B Transformer on all 12 standard tasks we evaluated (+2.65 points\non average) and is predicted to be up to 8x faster when generating tokens at\ninference time. To validate long-context capabilities, we provide additional\nexperiments evaluating variants of the Mamba-2-Hybrid and Transformer extended\nto support 16K, 32K, and 128K sequences. On an additional 23 long-context\ntasks, the hybrid model continues to closely match or exceed the Transformer on\naverage. To enable further study, we release the checkpoints as well as the\ncode used to train our models as part of NVIDIA's Megatron-LM project.", "paper_summary_zh": "選擇性狀態空間模型 (SSM)，例如 Mamba，克服了 Transformer 的一些缺點，例如序列長度的二次計算複雜度和來自鍵值快取的大量推論時間記憶體需求。此外，最近的研究表明，SSM 可以匹配或超過 Transformer 的語言建模能力，使其成為有吸引力的替代方案。然而，在受控環境（例如，相同資料）中，迄今為止的研究僅提出了小規模實驗，將 SSM 與 Transformer 進行比較。為了了解這些架構在更大規模上的優缺點，我們對在最多 3.5T 個標記的相同資料集上訓練的 8B 參數 Mamba、Mamba-2 和 Transformer 模型進行直接比較。我們還將這些模型與由 43% Mamba-2、7% 注意力和 50% MLP 層（Mamba-2-Hybrid）組成的混合架構進行比較。使用多樣化的任務集，我們回答了 Mamba 模型是否可以在更大的訓練預算下匹配 Transformer 的問題。我們的結果表明，儘管純 SSM 在許多任務上匹配或超過 Transformer，但它們在需要強大的複製或情境學習能力（例如，5 次 MMLU、電話簿）或長情境推理的任務上落後於 Transformer。相比之下，我們發現 8B Mamba-2-Hybrid 在我們評估的所有 12 個標準任務上都超過了 8B Transformer（平均高出 2.65 分），並且預測在推論時間生成標記時速度最高可達 8 倍。為了驗證長情境能力，我們提供了額外的實驗，評估了 Mamba-2-Hybrid 和 Transformer 的變體，以支援 16K、32K 和 128K 序列。在另外 23 個長情境任務中，混合模型繼續與 Transformer 緊密匹配或超過 Transformer。為了進一步研究，我們釋出了檢查點以及用於訓練我們模型的程式碼，作為 NVIDIA 的 Megatron-LM 項目的其中一部分。", "author": "Roger Waleffe et.al.", "authors": "Roger Waleffe, Wonmin Byeon, Duncan Riach, Brandon Norick, Vijay Korthikanti, Tri Dao, Albert Gu, Ali Hatamizadeh, Sudhakar Singh, Deepak Narayanan, Garvit Kulshreshtha, Vartika Singh, Jared Casper, Jan Kautz, Mohammad Shoeybi, Bryan Catanzaro", "id": "2406.07887v1", "paper_url": "http://arxiv.org/abs/2406.07887v1", "repo": "null"}}