{"2407.09174": {"publish_time": "2024-07-12", "title": "DART: An Automated End-to-End Object Detection Pipeline with Data Diversification, Open-Vocabulary Bounding Box Annotation, Pseudo-Label Review, and Model Training", "paper_summary": "Swift and accurate detection of specified objects is crucial for many\nindustrial applications, such as safety monitoring on construction sites.\nHowever, traditional approaches rely heavily on arduous manual annotation and\ndata collection, which struggle to adapt to ever-changing environments and\nnovel target objects. To address these limitations, this paper presents DART,\nan automated end-to-end pipeline designed to streamline the entire workflow of\nan object detection application from data collection to model deployment. DART\neliminates the need for human labeling and extensive data collection while\nexcelling in diverse scenarios. It employs a subject-driven image generation\nmodule (DreamBooth with SDXL) for data diversification, followed by an\nannotation stage where open-vocabulary object detection (Grounding DINO)\ngenerates bounding box annotations for both generated and original images.\nThese pseudo-labels are then reviewed by a large multimodal model (GPT-4o) to\nguarantee credibility before serving as ground truth to train real-time object\ndetectors (YOLO). We apply DART to a self-collected dataset of construction\nmachines named Liebherr Product, which contains over 15K high-quality images\nacross 23 categories. The current implementation of DART significantly\nincreases average precision (AP) from 0.064 to 0.832. Furthermore, we adopt a\nmodular design for DART to ensure easy exchangeability and extensibility. This\nallows for a smooth transition to more advanced algorithms in the future,\nseamless integration of new object categories without manual labeling, and\nadaptability to customized environments without extra data collection. The code\nand dataset are released at https://github.com/chen-xin-94/DART.", "paper_summary_zh": "<paragraph>在許多產業應用中，快速且準確地偵測特定物體至關重要，例如建築工地的安全監控。然而，傳統方法過度依賴繁瑣的手動註解和資料收集，難以適應不斷變化的環境和新穎的目標物體。為了解決這些限制，本文提出了 DART，一個自動化的端到端管道，旨在簡化物件偵測應用程式的整個工作流程，從資料收集到模型部署。DART 消除了人工標記和大量資料收集的需要，同時在各種場景中表現出色。它採用主題驅動的影像生成模組（DreamBooth with SDXL）進行資料多元化，接著進行註解階段，其中開放式詞彙物件偵測（Grounding DINO）為生成的影像和原始影像產生邊界框註解。這些偽標籤接著由大型多模態模型（GPT-4o）審查，以確保可信度，然後作為訓練即時物件偵測器（YOLO）的真實依據。我們將 DART 應用於一個自收集的建築機械資料集，名為利勃海爾產品，其中包含 23 個類別的 15K 張以上高品質影像。DART 的目前實作大幅提升平均準確率 (AP) 從 0.064 到 0.832。此外，我們採用模組化設計，確保 DART 容易替換和擴充。這允許未來順利轉換到更進階的演算法，無需人工標記即可無縫整合新的物件類別，並在不需額外資料收集的情況下適應自訂環境。程式碼和資料集已於 https://github.com/chen-xin-94/DART 發布。</paragraph>", "author": "Chen Xin et.al.", "authors": "Chen Xin, Andreas Hartel, Enkelejda Kasneci", "id": "2407.09174v1", "paper_url": "http://arxiv.org/abs/2407.09174v1", "repo": "https://github.com/chen-xin-94/dart"}}