{"2408.03497": {"publish_time": "2024-08-07", "title": "Advanced User Credit Risk Prediction Model using LightGBM, XGBoost and Tabnet with SMOTEENN", "paper_summary": "Bank credit risk is a significant challenge in modern financial transactions,\nand the ability to identify qualified credit card holders among a large number\nof applicants is crucial for the profitability of a bank'sbank's credit card\nbusiness. In the past, screening applicants'applicants' conditions often\nrequired a significant amount of manual labor, which was time-consuming and\nlabor-intensive. Although the accuracy and reliability of previously used ML\nmodels have been continuously improving, the pursuit of more reliable and\npowerful AI intelligent models is undoubtedly the unremitting pursuit by major\nbanks in the financial industry. In this study, we used a dataset of over\n40,000 records provided by a commercial bank as the research object. We\ncompared various dimensionality reduction techniques such as PCA and T-SNE for\npreprocessing high-dimensional datasets and performed in-depth adaptation and\ntuning of distributed models such as LightGBM and XGBoost, as well as deep\nmodels like Tabnet. After a series of research and processing, we obtained\nexcellent research results by combining SMOTEENN with these techniques. The\nexperiments demonstrated that LightGBM combined with PCA and SMOTEENN\ntechniques can assist banks in accurately predicting potential high-quality\ncustomers, showing relatively outstanding performance compared to other models.", "paper_summary_zh": "銀行信貸風險是現代金融交易中的重大挑戰，在眾多申請人中識別出合格的信用卡持有人對於銀行的信用卡業務獲利至關重要。過去，篩選申請人的條件通常需要大量的人工勞動，這既耗時又費力。儘管先前使用的 ML 模型的準確性和可靠性持續提升，但追求更可靠且強大的 AI 智能模型無疑是金融產業中各大銀行的不懈追求。在本研究中，我們使用一家商業銀行提供的超過 40,000 筆記錄的資料集作為研究對象。我們比較了 PCA 和 T-SNE 等各種降維技術以預處理高維度資料集，並對 LightGBM 和 XGBoost 等分散式模型以及 Tabnet 等深度模型進行深度調整和微調。經過一系列的研究和處理，我們結合 SMOTEENN 與這些技術獲得了優異的研究成果。實驗證明，LightGBM 結合 PCA 和 SMOTEENN 技術可以協助銀行準確預測潛在的高品質客戶，與其他模型相比表現相對出色。", "author": "Chang Yu et.al.", "authors": "Chang Yu, Yixin Jin, Qianwen Xing, Ye Zhang, Shaobo Guo, Shuchen Meng", "id": "2408.03497v1", "paper_url": "http://arxiv.org/abs/2408.03497v1", "repo": "null"}}