{"2411.08348": {"publish_time": "2024-11-13", "title": "Refining Translations with LLMs: A Constraint-Aware Iterative Prompting Approach", "paper_summary": "Large language models (LLMs) have demonstrated remarkable proficiency in\nmachine translation (MT), even without specific training on the languages in\nquestion. However, translating rare words in low-resource or domain-specific\ncontexts remains challenging for LLMs. To address this issue, we propose a\nmulti-step prompt chain that enhances translation faithfulness by prioritizing\nkey terms crucial for semantic accuracy. Our method first identifies these\nkeywords and retrieves their translations from a bilingual dictionary,\nintegrating them into the LLM's context using Retrieval-Augmented Generation\n(RAG). We further mitigate potential output hallucinations caused by long\nprompts through an iterative self-checking mechanism, where the LLM refines its\ntranslations based on lexical and semantic constraints. Experiments using Llama\nand Qwen as base models on the FLORES-200 and WMT datasets demonstrate\nsignificant improvements over baselines, highlighting the effectiveness of our\napproach in enhancing translation faithfulness and robustness, particularly in\nlow-resource scenarios.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出在機器翻譯 (MT) 方面的卓越能力，即使沒有針對特定語言進行特定訓練。然而，在低資源或特定領域的語境中翻譯罕見字詞對 LLM 來說仍然具有挑戰性。為了解決這個問題，我們提出了一個多步驟提示鏈，透過優先考慮對語意準確性至關重要的關鍵術語，來增強翻譯的忠實度。我們的做法首先識別這些關鍵字，並從雙語詞典中擷取其翻譯，使用檢索增強生成 (RAG) 將它們整合到 LLM 的語境中。我們進一步透過一個反覆自我檢查機制，來減輕長提示所造成的潛在輸出幻覺，其中 LLM 會根據詞彙和語義約束來調整其翻譯。使用 Llama 和 Qwen 作為基礎模型，在 FLORES-200 和 WMT 資料集上的實驗證明了與基準相比有顯著的改進，突顯了我們的方法在增強翻譯忠實度和穩健性方面的有效性，特別是在低資源場景中。", "author": "Shangfeng Chen et.al.", "authors": "Shangfeng Chen, Xiayang Shi, Pu Li, Yinlin Li, Jingjing Liu", "id": "2411.08348v1", "paper_url": "http://arxiv.org/abs/2411.08348v1", "repo": "null"}}