{"2406.03847": {"publish_time": "2024-06-06", "title": "Lean Workbook: A large-scale Lean problem set formalized from natural language math problems", "paper_summary": "Large language models have demonstrated impressive capabilities across\nvarious natural language processing tasks, especially in solving mathematical\nproblems. However, large language models are not good at math theorem proving\nusing formal languages like Lean. A significant challenge in this area is the\nscarcity of training data available in these formal languages. To address this\nissue, we propose a novel pipeline that iteratively generates and filters\nsynthetic data to translate natural language mathematical problems into Lean 4\nstatements, and vice versa. Our results indicate that the synthetic data\npipeline can provide useful training data and improve the performance of LLMs\nin translating and understanding complex mathematical problems and proofs. Our\nfinal dataset contains about 57K formal-informal question pairs along with\nsearched proof from the math contest forum and 21 new IMO questions. We\nopen-source our code at https://github.com/InternLM/InternLM-Math and our data\nat https://huggingface.co/datasets/InternLM/Lean-Workbook.", "paper_summary_zh": "大型語言模型在各種自然語言處理任務中展現出令人印象深刻的能力，尤其是在解決數學問題方面。然而，大型語言模型並不太擅長使用 Lean 等形式語言證明數學定理。這個領域中的一項重大挑戰是這些形式語言中可用的訓練資料稀少。為了解決這個問題，我們提出一個新穎的管道，以反覆產生和過濾合成資料，將自然語言數學問題轉換成 Lean 4 陳述，反之亦然。我們的結果表明，合成資料管道可以提供有用的訓練資料，並提升 LLM 在翻譯和理解複雜數學問題和證明方面的效能。我們的最終資料集包含約 57K 個形式非形式問題配對，以及從數學競賽論壇搜尋到的證明和 21 個新的 IMO 問題。我們在 https://github.com/InternLM/InternLM-Math 開放原始碼，並在 https://huggingface.co/datasets/InternLM/Lean-Workbook 開放資料。", "author": "Huaiyuan Ying et.al.", "authors": "Huaiyuan Ying, Zijian Wu, Yihan Geng, Jiayu Wang, Dahua Lin, Kai Chen", "id": "2406.03847v1", "paper_url": "http://arxiv.org/abs/2406.03847v1", "repo": "https://github.com/internlm/internlm-math"}}