{"2406.07393": {"publish_time": "2024-06-11", "title": "Limited Out-of-Context Knowledge Reasoning in Large Language Models", "paper_summary": "Large Language Models (LLMs) have demonstrated strong capabilities as\nknowledge bases and significant in-context reasoning capabilities. However,\nprevious work challenges their out-of-context reasoning ability, i.e., the\nability to infer information from their training data, instead of from the\ncontext or prompt. This paper focuses on a significant facet of out-of-context\nreasoning: Out-of-Context Knowledge Reasoning (OCKR), which is to combine\nmultiple knowledge to infer new knowledge. We designed a synthetic dataset with\nseven representative OCKR tasks to systematically assess the OCKR capabilities\nof LLMs. Using this dataset, we evaluated the LLaMA2-13B-chat model and\ndiscovered that its proficiency in this aspect is limited, regardless of\nwhether the knowledge is trained in a separate or adjacent training settings.\nMoreover, training the model to reason with complete reasoning data did not\nresult in significant improvement. Training the model to perform explicit\nknowledge retrieval helps in only one of the tasks, indicating that the model's\nlimited OCKR capabilities are due to difficulties in retrieving relevant\nknowledge. Furthermore, we treat cross-lingual knowledge transfer as a distinct\nform of OCKR, and evaluate this ability. Our results show that the evaluated\nmodel also exhibits limited ability in transferring knowledge across languages.\nThe dataset used in this study is available at\nhttps://github.com/NJUNLP/ID-OCKR.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出作為知識庫的強大功能，以及重要的語境推理能力。然而，先前的研究挑戰了它們的語境外推理能力，也就是從訓練資料中推論資訊的能力，而不是從語境或提示中推論。本文著重於語境外推理的重要面向：語境外知識推理 (OCKR)，也就是結合多種知識推論新知識。我們設計了一個包含七項具代表性的 OCKR 任務的合成資料集，以系統性評估 LLM 的 OCKR 能力。我們使用這個資料集評估了 LLaMA2-13B-chat 模型，發現它在這方面的能力有限，無論知識是在分開或相鄰的訓練設定中訓練。此外，訓練模型使用完整的推理資料進行推理並未帶來顯著的進步。訓練模型執行明確的知識擷取只對其中一項任務有幫助，這表示模型有限的 OCKR 能力是源於擷取相關知識的困難。此外，我們將跨語言知識轉移視為 OCKR 的一種不同形式，並評估這種能力。我們的結果顯示，所評估的模型在跨語言轉移知識方面的能力也受到限制。本研究中使用的資料集可在 https://github.com/NJUNLP/ID-OCKR 取得。", "author": "Peng Hu et.al.", "authors": "Peng Hu, Changjiang Gao, Ruiqi Gao, Jiajun Chen, Shujian Huang", "id": "2406.07393v1", "paper_url": "http://arxiv.org/abs/2406.07393v1", "repo": "null"}}