{"2502.04066": {"publish_time": "2025-02-06", "title": "Predicting Large Language Model Capabilities on Closed-Book QA Tasks Using Only Information Available Prior to Training", "paper_summary": "The GPT-4 technical report from OpenAI suggests that model performance on\nspecific tasks can be predicted prior to training, though methodologies remain\nunspecified. This approach is crucial for optimizing resource allocation and\nensuring data alignment with target tasks. To achieve this vision, we focus on\npredicting performance on Closed-book Question Answering (CBQA) tasks, which\nare closely tied to pre-training data and knowledge retention. We address three\nmajor challenges: 1) mastering the entire pre-training process, especially data\nconstruction; 2) evaluating a model's knowledge retention; and 3) predicting\ntask-specific knowledge retention using only information available prior to\ntraining. To tackle these challenges, we pre-train three large language models\n(i.e., 1.6B, 7B, and 13B) using 560k dollars and 520k GPU hours. We analyze the\npre-training data with knowledge triples and assess knowledge retention using\nestablished methods. Additionally, we introduce the SMI metric, an\ninformation-theoretic measure that quantifies the relationship between\npre-training data, model size, and task-specific knowledge retention. Our\nexperiments reveal a strong linear correlation ($\\text{R}^2 > 0.84$) between\nthe SMI metric and the model's accuracy on CBQA tasks across models of varying\nsizes (i.e., 1.1B, 1.6B, 7B, and 13B). The dataset, model, and code are\navailable at https://github.com/yuhui1038/SMI.", "paper_summary_zh": "OpenAI 的 GPT-4 技術報告指出，儘管方法仍未明確，但可以在訓練前預測模型在特定任務上的表現。這種方法對於優化資源配置和確保資料與目標任務的一致性至關重要。為了實現這個願景，我們專注於預測閉卷式問答 (CBQA) 任務的表現，這些任務與預訓練資料和知識保留密切相關。我們解決了三大挑戰：1) 掌握整個預訓練過程，特別是資料建構；2) 評估模型的知識保留；以及 3) 僅使用訓練前可得的資訊預測特定任務的知識保留。為了應對這些挑戰，我們使用 56 萬美元和 52 萬 GPU 小時預訓練了三個大型語言模型（即 1.6B、7B 和 13B）。我們使用知識三元組分析預訓練資料，並使用既定方法評估知識保留。此外，我們引入了 SMI 指標，這是一種資訊理論測量，用於量化預訓練資料、模型大小和特定任務知識保留之間的關係。我們的實驗揭示了一個強烈的線性相關性（$\\text{R}^2 > 0.84$），在不同大小的模型（即 1.1B、1.6B、7B 和 13B）中，SMI 指標和模型在 CBQA 任務上的準確性之間。資料集、模型和程式碼可在 https://github.com/yuhui1038/SMI 取得。", "author": "Changhao Jiang et.al.", "authors": "Changhao Jiang, Ming Zhang, Junjie Ye, Xiaoran Fan, Yifei Cao, Jiajun Sun, Zhiheng Xi, Shihan Dou, Yi Dong, Yujiong Shen, Jingqi Tong, Zhen Wang, Tao Liang, Zhihui Fei, Mingyang Wan, Guojun Ma, Qi Zhang, Tao Gui, Xuanjing Huang", "id": "2502.04066v1", "paper_url": "http://arxiv.org/abs/2502.04066v1", "repo": "null"}}