{"2409.11636": {"publish_time": "2024-09-18", "title": "\"A Woman is More Culturally Knowledgeable than A Man?\": The Effect of Personas on Cultural Norm Interpretation in LLMs", "paper_summary": "As the deployment of large language models (LLMs) expands, there is an\nincreasing demand for personalized LLMs. One method to personalize and guide\nthe outputs of these models is by assigning a persona -- a role that describes\nthe expected behavior of the LLM (e.g., a man, a woman, an engineer). This\nstudy investigates whether an LLM's understanding of social norms varies across\nassigned personas. Ideally, the perception of a social norm should remain\nconsistent regardless of the persona, since acceptability of a social norm\nshould be determined by the region the norm originates from, rather than by\nindividual characteristics such as gender, body size, or race. A norm is\nuniversal within its cultural context. In our research, we tested 36 distinct\npersonas from 12 sociodemographic categories (e.g., age, gender, beauty) across\nfour different LLMs. We find that LLMs' cultural norm interpretation varies\nbased on the persona used and the norm interpretation also varies within a\nsociodemographic category (e.g., a fat person and a thin person as in physical\nappearance group) where an LLM with the more socially desirable persona (e.g.,\na thin person) interprets social norms more accurately than with the less\nsocially desirable persona (e.g., a fat person). We also discuss how different\ntypes of social biases may contribute to the results that we observe.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的部署擴展，對個性化 LLM 的需求也越來越大。一種個性化和引導這些模型輸出結果的方法是指定一個角色，即描述 LLM 預期行為的角色（例如，男人、女人、工程師）。本研究探討 LLM 對社會規範的理解是否會因指定的角色而異。理想情況下，對社會規範的認知應保持一致，無論角色為何，因為對社會規範的可接受性應取決於規範的來源地區，而不是取決於性別、體型或種族等個人特徵。規範在其文化背景中是普遍的。在我們的研究中，我們在四個不同的 LLM 中測試了來自 12 個社會人口類別（例如，年齡、性別、美麗）的 36 個不同的角色。我們發現，LLM 的文化規範解讀會根據所使用的角色而有所不同，而且規範解讀也會在社會人口類別中有所不同（例如，一個胖子和一個瘦子，就像在身體外觀組中），其中具有較高社會期望的角色（例如，一個瘦子）比具有較低社會期望的角色（例如，一個胖子）更準確地解讀社會規範。我們還討論了不同類型的社會偏見如何導致我們觀察到的結果。", "author": "Mahammed Kamruzzaman et.al.", "authors": "Mahammed Kamruzzaman, Hieu Nguyen, Nazmul Hassan, Gene Louis Kim", "id": "2409.11636v1", "paper_url": "http://arxiv.org/abs/2409.11636v1", "repo": "null"}}