{"2408.08376": {"publish_time": "2024-08-15", "title": "Decoding the human brain tissue response to radiofrequency excitation using a biophysical-model-free deep MRI on a chip framework", "paper_summary": "Magnetic resonance imaging (MRI) relies on radiofrequency (RF) excitation of\nproton spin. Clinical diagnosis requires a comprehensive collation of\nbiophysical data via multiple MRI contrasts, acquired using a series of RF\nsequences that lead to lengthy examinations. Here, we developed a vision\ntransformer-based framework that captures the spatiotemporal magnetic signal\nevolution and decodes the brain tissue response to RF excitation, constituting\nan MRI on a chip. Following a per-subject rapid calibration scan (28.2 s), a\nwide variety of image contrasts including fully quantitative molecular, water\nrelaxation, and magnetic field maps can be generated automatically. The method\nwas validated across healthy subjects and a cancer patient in two different\nimaging sites, and proved to be 94% faster than alternative protocols. The deep\nMRI on a chip (DeepMonC) framework may reveal the molecular composition of the\nhuman brain tissue in a wide range of pathologies, while offering clinically\nattractive scan times.", "paper_summary_zh": "磁振造影 (MRI) 仰賴射頻 (RF) 激發質子自旋。臨床診斷需要透過多種 MRI 對比，收集全面的生物物理資料，使用一系列 RF 序列取得，這會導致檢查時間冗長。在此，我們開發了一個基於視覺轉換器的架構，用來擷取時空磁訊號演變，並解碼腦組織對 RF 激發的反應，構成晶片上的 MRI。在每位受試者進行快速校正掃描 (28.2 秒) 之後，可以自動產生各種影像對比，包括完全量化的分子、水弛緩和磁場圖。此方法已在兩個不同的影像地點針對健康受試者和一名癌症患者進行驗證，並證明比替代方案快 94%。晶片上的深度 MRI (DeepMonC) 架構可能會揭示各種病理中人腦組織的分子組成，同時提供臨床上有吸引力的掃描時間。", "author": "Dinor Nagar et.al.", "authors": "Dinor Nagar, Moritz Zaiss, Or Perlman", "id": "2408.08376v2", "paper_url": "http://arxiv.org/abs/2408.08376v2", "repo": "null"}}