{"2501.10057": {"publish_time": "2025-01-17", "title": "MSTS: A Multimodal Safety Test Suite for Vision-Language Models", "paper_summary": "Vision-language models (VLMs), which process image and text inputs, are\nincreasingly integrated into chat assistants and other consumer AI\napplications. Without proper safeguards, however, VLMs may give harmful advice\n(e.g. how to self-harm) or encourage unsafe behaviours (e.g. to consume drugs).\nDespite these clear hazards, little work so far has evaluated VLM safety and\nthe novel risks created by multimodal inputs. To address this gap, we introduce\nMSTS, a Multimodal Safety Test Suite for VLMs. MSTS comprises 400 test prompts\nacross 40 fine-grained hazard categories. Each test prompt consists of a text\nand an image that only in combination reveal their full unsafe meaning. With\nMSTS, we find clear safety issues in several open VLMs. We also find some VLMs\nto be safe by accident, meaning that they are safe because they fail to\nunderstand even simple test prompts. We translate MSTS into ten languages,\nshowing non-English prompts to increase the rate of unsafe model responses. We\nalso show models to be safer when tested with text only rather than multimodal\nprompts. Finally, we explore the automation of VLM safety assessments, finding\neven the best safety classifiers to be lacking.", "paper_summary_zh": "視覺語言模型（VLM）處理影像和文字輸入，正逐漸整合到聊天機器人和其他消費者人工智慧應用程式中。然而，在沒有適當的防護措施下，VLM 可能會提供有害的建議（例如如何自殘）或鼓勵不安全的行為（例如吸毒）。儘管有這些明顯的危害，到目前為止，很少有研究評估 VLM 的安全性以及多模態輸入所造成的全新風險。為了解決這個問題，我們引入了 MSTS，這是一個針對 VLM 的多模態安全測試套件。MSTS 包含 40 個細緻的危害類別中 400 個測試提示。每個測試提示都包含一個文字和一個影像，只有將它們組合起來才能揭示其完整的危險含義。透過 MSTS，我們在幾個開放的 VLM 中發現了明顯的安全問題。我們也發現一些 VLM 意外地安全，這表示它們是安全的，因為它們甚至無法理解簡單的測試提示。我們將 MSTS 翻譯成十種語言，顯示非英文提示以增加不安全的模型回應率。我們也發現，當僅使用文字而不是多模態提示進行測試時，模型會更安全。最後，我們探索 VLM 安全評估的自動化，發現即使是最好的安全分類器也有所欠缺。", "author": "Paul Röttger et.al.", "authors": "Paul Röttger, Giuseppe Attanasio, Felix Friedrich, Janis Goldzycher, Alicia Parrish, Rishabh Bhardwaj, Chiara Di Bonaventura, Roman Eng, Gaia El Khoury Geagea, Sujata Goswami, Jieun Han, Dirk Hovy, Seogyeong Jeong, Paloma Jeretič, Flor Miriam Plaza-del-Arco, Donya Rooein, Patrick Schramowski, Anastassia Shaitarova, Xudong Shen, Richard Willats, Andrea Zugarini, Bertie Vidgen", "id": "2501.10057v1", "paper_url": "http://arxiv.org/abs/2501.10057v1", "repo": "https://github.com/paul-rottger/msts-multimodal-safety"}}