{"2501.18016": {"publish_time": "2025-01-29", "title": "Digital Twin-Enabled Real-Time Control in Robotic Additive Manufacturing via Soft Actor-Critic Reinforcement Learning", "paper_summary": "Smart manufacturing systems increasingly rely on adaptive control mechanisms\nto optimize complex processes. This research presents a novel approach\nintegrating Soft Actor-Critic (SAC) reinforcement learning with digital twin\ntechnology to enable real-time process control in robotic additive\nmanufacturing. We demonstrate our methodology using a Viper X300s robot arm,\nimplementing two distinct control scenarios: static target acquisition and\ndynamic trajectory following. The system architecture combines Unity's\nsimulation environment with ROS2 for seamless digital twin synchronization,\nwhile leveraging transfer learning to efficiently adapt trained models across\ntasks. Our hierarchical reward structure addresses common reinforcement\nlearning challenges including local minima avoidance, convergence acceleration,\nand training stability. Experimental results show rapid policy convergence and\nrobust task execution in both simulated and physical environments, with\nperformance metrics including cumulative reward, value prediction accuracy,\npolicy loss, and discrete entropy coefficient demonstrating the effectiveness\nof our approach. This work advances the integration of reinforcement learning\nwith digital twins for industrial robotics applications, providing a framework\nfor enhanced adaptive real-time control for smart additive manufacturing\nprocess.", "paper_summary_zh": "智慧製造系統越來越依賴適應控制機制來最佳化複雜的製程。本研究提出一個新穎的方法，將 Soft Actor-Critic (SAC) 強化學習與數位孿生技術整合，以在機器人增材製造中實現即時製程控制。我們使用 Viper X300s 機器手臂來展示我們的技術，實作兩個不同的控制場景：靜態目標擷取和動態軌跡追蹤。系統架構結合 Unity 的模擬環境和 ROS2，以實現無縫的數位孿生同步，同時利用遷移學習來有效地調整訓練好的模型以應付各種任務。我們的階層式獎勵結構解決了常見的強化學習挑戰，包括避免局部最小值、加速收斂和訓練穩定性。實驗結果顯示，在模擬和實際環境中，策略收斂速度快且任務執行強健，包括累積獎勵、值預測準確度、策略損失和離散熵係數等效能指標，證明了我們方法的有效性。這項工作推動了強化學習與數位孿生在工業機器人應用中的整合，為智慧增材製造製程提供增強式適應即時控制的架構。", "author": "Matsive Ali et.al.", "authors": "Matsive Ali, Sandesh Giri, Sen Liu, Qin Yang", "id": "2501.18016v1", "paper_url": "http://arxiv.org/abs/2501.18016v1", "repo": "null"}}