{"2412.08955": {"publish_time": "2024-12-12", "title": "Align, Generate, Learn: A Novel Closed-Loop Framework for Cross-Lingual In-Context Learning", "paper_summary": "Cross-lingual in-context learning (XICL) has emerged as a transformative\nparadigm for leveraging large language models (LLMs) to tackle multilingual\ntasks, especially for low-resource languages. However, existing approaches\noften rely on external retrievers or task-specific fine-tuning, limiting their\nscalability and generalizability. In this paper, we propose a novel\nself-supervised framework that harnesses the generative capabilities of LLMs to\ninternally select and utilize task-relevant examples. Our method introduces two\nkey objectives: a retrieval-generation alignment loss to optimize the quality\nof selected examples and a semantic coherence loss to ensure cross-lingual\nconsistency. Through extensive experiments on multilingual benchmarks, our\napproach achieves state-of-the-art performance, significantly outperforming\nexisting baselines. Further analysis highlights its robustness across diverse\nlanguage families and its ability to generalize to unseen tasks. Human\nevaluations confirm the superior fluency, relevance, and semantic correctness\nof outputs generated by our method. This work provides a scalable, effective,\nand generalizable solution for cross-lingual in-context learning.", "paper_summary_zh": "跨語言情境學習 (XICL) 已成為利用大型語言模型 (LLM) 來處理多語言任務的轉型範例，特別是對於低資源語言。然而，現有方法通常依賴於外部檢索器或特定任務的微調，這限制了它們的可擴充性和概括性。在本文中，我們提出了一個新穎的自我監督框架，利用 LLM 的生成能力來內部選擇和利用與任務相關的範例。我們的模型引入了兩個關鍵目標：檢索生成對齊損失，以最佳化所選範例的品質；以及語義一致性損失，以確保跨語言一致性。透過對多語言基準進行廣泛的實驗，我們的模型達到了最先進的效能，顯著優於現有的基準。進一步的分析突顯了它在不同語言系列中的穩健性，以及它對未見任務的概括能力。人工評估確認了我們的方法所產生的輸出的優越流暢性、相關性和語義正確性。這項工作提供了一個可擴充、有效且可概括的跨語言情境學習解決方案。", "author": "Mateo Alejandro Rojas et.al.", "authors": "Mateo Alejandro Rojas, Rafael Carranza", "id": "2412.08955v1", "paper_url": "http://arxiv.org/abs/2412.08955v1", "repo": "null"}}