{"2405.17103": {"publish_time": "2024-05-27", "title": "Empowering Character-level Text Infilling by Eliminating Sub-Tokens", "paper_summary": "In infilling tasks, sub-tokens, representing instances where a complete token\nis segmented into two parts, often emerge at the boundaries of prefixes,\nmiddles, and suffixes. Traditional methods focused on training models at the\ntoken level, leading to sub-optimal performance in character-level infilling\ntasks during the inference stage. Alternately, some approaches considered\ncharacter-level infilling, but they relied on predicting sub-tokens in\ninference, yet this strategy diminished ability in character-level infilling\ntasks due to the large perplexity of the model on sub-tokens. In this paper, we\nintroduce FIM-SE, which stands for Fill-In-the-Middle with both Starting and\nEnding character constraints. The proposed method addresses character-level\ninfilling tasks by utilizing a line-level format to avoid predicting any\nsub-token in inference. In addition, we incorporate two special tokens to\nsignify the rest of the incomplete lines, thereby enhancing generation\nguidance. Extensive experiments demonstrate that our proposed approach\nsurpasses previous methods, offering a significant advantage. Code is available\nat https://github.com/SenseLLM/FIM-SE.", "paper_summary_zh": "在填充任務中，子代幣（表示將一個完整代幣分割成兩部分的實例）通常出現在前綴、中間和後綴的邊界。傳統方法專注於在代幣級別訓練模型，導致在推理階段字元級別填充任務的效能不佳。或者，一些方法考慮了字元級別填充，但它們依賴於在推理中預測子代幣，然而，由於模型對子代幣的困惑性很大，這種策略降低了字元級別填充任務的能力。在本文中，我們介紹了 FIM-SE，它代表了具有開始和結束字元約束的填充中間。所提出的方法通過利用行級格式來解決字元級別填充任務，以避免在推理中預測任何子代幣。此外，我們加入了兩個特殊代幣來表示不完整行的其餘部分，從而增強了生成指導。大量的實驗表明，我們提出的方法優於以前的方法，提供了顯著的優勢。程式碼可在 https://github.com/SenseLLM/FIM-SE 中取得。", "author": "Houxing Ren et.al.", "authors": "Houxing Ren, Mingjie Zhan, Zhongyuan Wu, Hongsheng Li", "id": "2405.17103v1", "paper_url": "http://arxiv.org/abs/2405.17103v1", "repo": "null"}}