{"2412.11908": {"publish_time": "2024-12-16", "title": "Can Language Models Rival Mathematics Students? Evaluating Mathematical Reasoning through Textual Manipulation and Human Experiments", "paper_summary": "In this paper we look at the ability of recent large language models (LLMs)\nat solving mathematical problems in combinatorics. We compare models LLaMA-2,\nLLaMA-3.1, GPT-4, and Mixtral against each other and against human pupils and\nundergraduates with prior experience in mathematical olympiads. To facilitate\nthese comparisons we introduce the Combi-Puzzles dataset, which contains 125\nproblem variants based on 25 combinatorial reasoning problems. Each problem is\npresented in one of five distinct forms, created by systematically manipulating\nthe problem statements through adversarial additions, numeric parameter\nchanges, and linguistic obfuscation. Our variations preserve the mathematical\ncore and are designed to measure the generalisability of LLM problem-solving\nabilities, while also increasing confidence that problems are submitted to LLMs\nin forms that have not been seen as training instances. We found that a model\nbased on GPT-4 outperformed all other models in producing correct responses,\nand performed significantly better in the mathematical variation of the\nproblems than humans. We also found that modifications to problem statements\nsignificantly impact the LLM's performance, while human performance remains\nunaffected.", "paper_summary_zh": "在本文中，我們探討了近期大型語言模型（LLM）在組合數學問題求解能力。我們比較 LLaMA-2、LLaMA-3.1、GPT-4 和 Mixtral 這幾個模型，並將它們與具有數學奧林匹克競賽經驗的人類學生和大學生進行比較。為了促進這些比較，我們引入了 Combi-Puzzles 資料集，其中包含 125 個基於 25 個組合推理問題的問題變體。每個問題都以五種不同的形式之一呈現，這些形式是透過系統性地透過對抗性添加、數字參數更改和語言混淆來處理問題陳述而建立的。我們的變體保留了數學核心，旨在衡量 LLM 問題解決能力的概括性，同時也增加了信心，即以訓練實例未曾見過的形式將問題提交給 LLM。我們發現基於 GPT-4 的模型在產生正確的回應方面優於所有其他模型，並且在問題的數學變體中表現明顯優於人類。我們還發現，對問題陳述的修改會顯著影響 LLM 的表現，而人類表現則不受影響。", "author": "Andrii Nikolaiev et.al.", "authors": "Andrii Nikolaiev, Yiannos Stathopoulos, Simone Teufel", "id": "2412.11908v1", "paper_url": "http://arxiv.org/abs/2412.11908v1", "repo": "null"}}