{"2501.05891": {"publish_time": "2025-01-10", "title": "Affordably Fine-tuned LLMs Provide Better Answers to Course-specific MCQs", "paper_summary": "In education, the capability of generating human-like text of Large Language\nModels (LLMs) inspired work on how they can increase the efficiency of learning\nand teaching. We study the affordability of these models for educators and\nstudents by investigating how LLMs answer multiple-choice questions (MCQs) with\nrespect to hardware constraints and refinement techniques. We explore this\nspace by using generic pre-trained LLMs (the 7B, 13B, and 70B variants of\nLLaMA-2) to answer 162 undergraduate-level MCQs from a course on Programming\nLanguages (PL) -- the MCQ dataset is a contribution of this work, which we make\npublicly available. Specifically, we dissect how different factors, such as\nusing readily-available material -- (parts of) the course's textbook -- for\nfine-tuning and quantisation (to decrease resource usage) can change the\naccuracy of the responses. The main takeaway is that smaller textbook-based\nfine-tuned models outperform generic larger ones (whose pre-training requires\nconspicuous resources), making the usage of LLMs for answering MCQs resource-\nand material-wise affordable.", "paper_summary_zh": "在教育中，生成类似人类文本的大型语言模型 (LLM) 的能力激发了人们对如何提高学习和教学效率的研究。我们通过调查 LLM 如何在硬件限制和优化技术方面回答多项选择题 (MCQ) 来研究这些模型对教育者和学生的可负担性。我们通过使用通用的预训练 LLM（LLaMA-2 的 7B、13B 和 70B 变体）来探索这个空间，以回答来自编程语言 (PL) 课程的 162 个本科生级别的 MCQ——MCQ 数据集是这项工作的贡献，我们公开提供。具体来说，我们剖析了不同因素如何改变响应的准确性，例如使用现成的材料——（课程教科书的）部分——进行微调和量化（以减少资源使用）。最主要的收获是，较小的基于教科书的微调模型优于通用的较大模型（其预训练需要显着的资源），这使得使用 LLM 来回答 MCQ 在资源和材料方面变得可负担。", "author": "Bianca Raimondi et.al.", "authors": "Bianca Raimondi, Saverio Giallorenzo, Maurizio Gabbrielli", "id": "2501.05891v1", "paper_url": "http://arxiv.org/abs/2501.05891v1", "repo": "https://github.com/biancaraimondi/llama2_for_mcqs"}}