{"2412.01233": {"publish_time": "2024-12-02", "title": "Best Practices for Large Language Models in Radiology", "paper_summary": "At the heart of radiological practice is the challenge of integrating complex\nimaging data with clinical information to produce actionable insights. Nuanced\napplication of language is key for various activities, including managing\nrequests, describing and interpreting imaging findings in the context of\nclinical data, and concisely documenting and communicating the outcomes. The\nemergence of large language models (LLMs) offers an opportunity to improve the\nmanagement and interpretation of the vast data in radiology. Despite being\nprimarily general-purpose, these advanced computational models demonstrate\nimpressive capabilities in specialized language-related tasks, even without\nspecific training. Unlocking the potential of LLMs for radiology requires basic\nunderstanding of their foundations and a strategic approach to navigate their\nidiosyncrasies. This review, drawing from practical radiology and machine\nlearning expertise and recent literature, provides readers insight into the\npotential of LLMs in radiology. It examines best practices that have so far\nstood the test of time in the rapidly evolving landscape of LLMs. This includes\npractical advice for optimizing LLM characteristics for radiology practices\nalong with limitations, effective prompting, and fine-tuning strategies.", "paper_summary_zh": "放射學實務的核心挑戰，在於整合複雜的影像資料與臨床資訊，以產生可行的見解。語言的細緻運用是各種活動的關鍵，包括管理請求、描述和解讀影像結果的臨床資料，以及簡潔地記錄和傳達結果。大型語言模型 (LLM) 的出現，提供了一個機會來改善放射學中大量資料的管理和解讀。儘管主要是一般用途，這些先進的計算模型在專業的語言相關任務中展現出令人印象深刻的能力，即使沒有特定的訓練。要解鎖 LLM 在放射學中的潛力，需要基本了解其基礎，以及應對其獨特之處的策略性方法。這篇評論從實務放射學和機器學習專業知識以及近期文獻中汲取，為讀者提供 LLM 在放射學中的潛力的見解。它檢視了迄今為止在 LLM 快速演變的領域中經得起時間考驗的最佳實務。這包括針對放射學實務最佳化 LLM 特性的實務建議，以及限制、有效的提示和微調策略。", "author": "Christian Bluethgen et.al.", "authors": "Christian Bluethgen, Dave Van Veen, Cyril Zakka, Katherine Link, Aaron Fanous, Roxana Daneshjou, Thomas Frauenfelder, Curtis Langlotz, Sergios Gatidis, Akshay Chaudhari", "id": "2412.01233v1", "paper_url": "http://arxiv.org/abs/2412.01233v1", "repo": "null"}}