{"2409.11827": {"publish_time": "2024-09-18", "title": "Extract-and-Abstract: Unifying Extractive and Abstractive Summarization within Single Encoder-Decoder Framework", "paper_summary": "Extract-then-Abstract is a naturally coherent paradigm to conduct abstractive\nsummarization with the help of salient information identified by the extractive\nmodel. Previous works that adopt this paradigm train the extractor and\nabstractor separately and introduce extra parameters to highlight the extracted\nsalients to the abstractor, which results in error accumulation and additional\ntraining costs. In this paper, we first introduce a parameter-free highlight\nmethod into the encoder-decoder framework: replacing the encoder attention mask\nwith a saliency mask in the cross-attention module to force the decoder to\nfocus only on salient parts of the input. A preliminary analysis compares\ndifferent highlight methods, demonstrating the effectiveness of our saliency\nmask. We further propose the novel extract-and-abstract paradigm, ExtAbs, which\njointly and seamlessly performs Extractive and Abstractive summarization tasks\nwithin single encoder-decoder model to reduce error accumulation. In ExtAbs,\nthe vanilla encoder is augmented to extract salients, and the vanilla decoder\nis modified with the proposed saliency mask to generate summaries. Built upon\nBART and PEGASUS, experiments on three datasets show that ExtAbs can achieve\nsuperior performance than baselines on the extractive task and performs\ncomparable, or even better than the vanilla models on the abstractive task.", "paper_summary_zh": "抽取再摘要是一種自然連貫的範例，可用於在抽取模型識別的顯著資訊的幫助下執行摘要摘要。採用此範例的前人工作會分別訓練抽取器和摘要器，並引入額外參數以突顯抽取的顯著資訊給摘要器，這會導致錯誤累積和額外的訓練成本。在本文中，我們首先將無參數突顯方法引入編碼器-解碼器架構：在交叉注意力模組中用顯著性遮罩取代編碼器注意力遮罩，以強制解碼器僅關注輸入的顯著部分。初步分析比較了不同的突顯方法，證明了我們的顯著性遮罩的有效性。我們進一步提出了新穎的抽取和摘要範例 ExtAbs，它在單一編碼器-解碼器模型中聯合且無縫地執行抽取和摘要摘要任務，以減少錯誤累積。在 ExtAbs 中，香草編碼器被擴充以抽取顯著資訊，而香草解碼器則使用建議的顯著性遮罩進行修改以產生摘要。在 BART 和 PEGASUS 的基礎上，對三個資料集的實驗表明，ExtAbs 在抽取任務上可以達到比基準更好的效能，並且在摘要任務上表現得與香草模型相當，甚至更好。", "author": "Yuping Wu et.al.", "authors": "Yuping Wu, Hao Li, Hongbo Zhu, Goran Nenadic, Xiao-Jun Zeng", "id": "2409.11827v1", "paper_url": "http://arxiv.org/abs/2409.11827v1", "repo": "null"}}