{"2406.02919": {"publish_time": "2024-06-05", "title": "MultifacetEval: Multifaceted Evaluation to Probe LLMs in Mastering Medical Knowledge", "paper_summary": "Large language models (LLMs) have excelled across domains, also delivering\nnotable performance on the medical evaluation benchmarks, such as MedQA.\nHowever, there still exists a significant gap between the reported performance\nand the practical effectiveness in real-world medical scenarios. In this paper,\nwe aim to explore the causes of this gap by employing a multifaceted\nexamination schema to systematically probe the actual mastery of medical\nknowledge by current LLMs. Specifically, we develop a novel evaluation\nframework MultifacetEval to examine the degree and coverage of LLMs in encoding\nand mastering medical knowledge at multiple facets (comparison, rectification,\ndiscrimination, and verification) concurrently. Based on the MultifacetEval\nframework, we construct two multifaceted evaluation datasets: MultiDiseK (by\nproducing questions from a clinical disease knowledge base) and MultiMedQA (by\nrephrasing each question from a medical benchmark MedQA into multifaceted\nquestions). The experimental results on these multifaceted datasets demonstrate\nthat the extent of current LLMs in mastering medical knowledge is far below\ntheir performance on existing medical benchmarks, suggesting that they lack\ndepth, precision, and comprehensiveness in mastering medical knowledge.\nConsequently, current LLMs are not yet ready for application in real-world\nmedical tasks. The codes and datasets are available at\nhttps://github.com/THUMLP/MultifacetEval.", "paper_summary_zh": "大型語言模型 (LLM) 在各個領域都表現出色，也在醫療評估基準（例如 MedQA）上取得顯著的成效。然而，在實際的醫療場景中，報告的成效與實際的效能之間仍存在顯著的差距。在本文中，我們旨在透過採用多面向的檢驗架構來系統性地探討實際醫療知識掌握程度，進而探討造成此差距的原因。具體來說，我們開發了一個新的評估架構 MultifacetEval，以檢驗 LLM 在編碼和掌握醫療知識的多個面向（比較、修正、區分和驗證）的程度和涵蓋範圍。基於 MultifacetEval 架構，我們構建了兩個多面向的評估資料集：MultiDiseK（透過從臨床疾病知識庫產生問題）和 MultiMedQA（透過將醫療基準 MedQA 中的每個問題改寫為多面向問題）。在這些多面向資料集上的實驗結果表明，當前 LLM 在掌握醫療知識方面的程度遠低於其在現有醫療基準上的表現，這表明它們在掌握醫療知識方面缺乏深度、精確度和全面性。因此，當前的 LLM 尚未準備好應用於實際的醫療任務。程式碼和資料集可在 https://github.com/THUMLP/MultifacetEval 取得。", "author": "Yuxuan Zhou et.al.", "authors": "Yuxuan Zhou, Xien Liu, Chen Ning, Ji Wu", "id": "2406.02919v1", "paper_url": "http://arxiv.org/abs/2406.02919v1", "repo": "https://github.com/thumlp/multifaceteval"}}