{"2412.05210": {"publish_time": "2024-12-06", "title": "Evaluating and Aligning CodeLLMs on Human Preference", "paper_summary": "Code large language models (codeLLMs) have made significant strides in code\ngeneration. Most previous code-related benchmarks, which consist of various\nprogramming exercises along with the corresponding test cases, are used as a\ncommon measure to evaluate the performance and capabilities of code LLMs.\nHowever, the current code LLMs focus on synthesizing the correct code snippet,\nignoring the alignment with human preferences, where the query should be\nsampled from the practical application scenarios and the model-generated\nresponses should satisfy the human preference. To bridge the gap between the\nmodel-generated response and human preference, we present a rigorous\nhuman-curated benchmark CodeArena to emulate the complexity and diversity of\nreal-world coding tasks, where 397 high-quality samples spanning 40 categories\nand 44 programming languages, carefully curated from user queries. Further, we\npropose a diverse synthetic instruction corpus SynCode-Instruct (nearly 20B\ntokens) by scaling instructions from the website to verify the effectiveness of\nthe large-scale synthetic instruction fine-tuning, where Qwen2.5-SynCoder\ntotally trained on synthetic instruction data can achieve top-tier performance\nof open-source code LLMs. The results find performance differences between\nexecution-based benchmarks and CodeArena. Our systematic experiments of\nCodeArena on 40+ LLMs reveal a notable performance gap between open SOTA code\nLLMs (e.g. Qwen2.5-Coder) and proprietary LLMs (e.g., OpenAI o1), underscoring\nthe importance of the human preference\nalignment.\\footnote{\\url{https://codearenaeval.github.io/ }}", "paper_summary_zh": "<paragraph>大型語言模型（codeLLM）在程式碼生成方面取得了顯著進展。大多數先前的程式碼相關基準，包含各種程式設計練習以及對應的測試案例，用作評估 code LLM 效能和功能的常見測量標準。然而，目前的 code LLM 專注於合成正確的程式碼片段，忽略與人類偏好的對齊，其中查詢應從實際應用情境中抽樣，而模型產生的回應應滿足人類偏好。為了彌合模型產生的回應與人類偏好之間的差距，我們提出了一個嚴謹的人工策展基準 CodeArena，以模擬真實世界程式設計任務的複雜性和多樣性，其中 397 個高品質範例涵蓋 40 個類別和 44 種程式語言，從使用者查詢中仔細策展。此外，我們提出了一個多樣化的合成指令語料庫 SynCode-Instruct（將近 20B 個代幣），透過擴充網站上的指令來驗證大規模合成指令微調的有效性，其中 Qwen2.5-SynCoder 完全訓練於合成指令資料，可以達到開放原始碼 code LLM 的頂級效能。結果發現基於執行的基準和 CodeArena 之間的效能差異。我們在 40 多個 LLM 上進行 CodeArena 的系統性實驗，揭示了開放 SOTA code LLM（例如 Qwen2.5-Coder）和專有 LLM（例如 OpenAI o1）之間顯著的效能差距，強調了人類偏好對齊的重要性。\\footnote{\\url{https://codearenaeval.github.io/ }}</paragraph>", "author": "Jian Yang et.al.", "authors": "Jian Yang, Jiaxi Yang, Ke Jin, Yibo Miao, Lei Zhang, Liqun Yang, Zeyu Cui, Yichang Zhang, Binyuan Hui, Junyang Lin", "id": "2412.05210v1", "paper_url": "http://arxiv.org/abs/2412.05210v1", "repo": "null"}}