{"2407.16221": {"publish_time": "2024-07-23", "title": "Do LLMs Know When to NOT Answer? Investigating Abstention Abilities of Large Language Models", "paper_summary": "As Large Language Models (LLMs) achieve remarkable performance across various\nNLP tasks, their reliability becomes essential for widespread adoption. This\npaper focuses on Abstention Ability (AA), a critical yet under explored aspect\nof reliability - the ability of LLMs to refrain from answering questions when\nthey are uncertain or when definitive answer is not possible, while maintaining\nquestion-answering (QA) task performance. While previous works have focused on\nunderstanding the recollection abilities of LLMs or their ability to identify\nimponderable/unanswerable questions, we believe there is a need for an\neffective AA evaluation method. Therefore, we propose a black-box evaluation\nmethodology to examine and understand the AA of LLMs across a variety of\nmultiple-choice QA tasks. We measure AA by rewarding models for abstaining from\nanswering when their predictions are incorrect or when the questions are\ninherently unanswerable. We investigate three strategies, Strict Prompting,\nVerbal Confidence Thresholding, and Chain-of-Thought (CoT), to understand their\nimpact on abstention across different LLMs. Our findings reveal that while even\nstate-of-the-art LLMs like GPT-4 struggle with abstention, strategic prompting\nsuch as CoT, can significantly enhance this ability. Furthermore, we\ndemonstrate that improving AA also leads to better overall QA task performance,\nunderscoring the importance of evaluating AA in LLMs.", "paper_summary_zh": "隨著大型語言模型 (LLM) 在各種自然語言處理任務中取得顯著進展，其可靠性對於廣泛採用至關重要。本文重點探討戒除能力 (AA)，這是可靠性中一個關鍵但尚未充分探討的面向 - LLM 在不確定或無法提供明確答案時，在維持問答 (QA) 任務表現的同時，拒絕回答問題的能力。儘管先前的研究重點在於了解 LLM 的回憶能力或其識別不可思議/無解問題的能力，但我們相信需要一種有效的 AA 評估方法。因此，我們提出了一種黑盒評估方法，用於檢查和了解 LLM 在各種多選題 QA 任務中的 AA。我們通過獎勵模型在預測不正確或問題本質上無法回答時拒絕回答來衡量 AA。我們研究了嚴格提示、言語信心閾值和思維鏈 (CoT) 三種策略，以了解它們對不同 LLM 中戒除的影響。我們的研究結果表明，儘管像 GPT-4 這樣的最先進 LLM 也在戒除方面苦苦掙扎，但 CoT 等策略提示可以顯著增強這種能力。此外，我們證明改進 AA 也有助於提高整體 QA 任務表現，這強調了評估 LLM 中 AA 的重要性。", "author": "Nishanth Madhusudhan et.al.", "authors": "Nishanth Madhusudhan, Sathwik Tejaswi Madhusudhan, Vikas Yadav, Masoud Hashemi", "id": "2407.16221v1", "paper_url": "http://arxiv.org/abs/2407.16221v1", "repo": "null"}}