{"2408.00540": {"publish_time": "2024-08-01", "title": "The Energy Cost of Artificial Intelligence of Things Lifecycle", "paper_summary": "Artificial intelligence (AI)coupled with existing Internet of Things (IoT)\nenables more streamlined and autonomous operations across various economic\nsectors. Consequently, the paradigm of Artificial Intelligence of Things (AIoT)\nhaving AI techniques at its core implies additional energy and carbon costs\nthat may become significant with more complex neural architectures. To better\nunderstand the energy and Carbon Footprint (CF) of some AIoT components, very\nrecent studies employ conventional metrics. However, these metrics are not\ndesigned to capture energy efficiency aspects of inference. In this paper, we\npropose a new metric, the Energy Cost of AIoT Lifecycle (eCAL) to capture the\noverall energy cost of inference over the lifecycle of an AIoT system. We\ndevise a new methodology for determining eCAL of an AIoT system by analyzing\nthe complexity of data manipulation in individual components involved in the\nAIoT lifecycle and derive the overall and per bit energy consumption. With eCAL\nwe show that the better a model is and the more it is used, the more energy\nefficient an inference is. For an example AIoT configuration, eCAL for making\n$100$ inferences is $1.43$ times higher than for $1000$ inferences. We also\nevaluate the CF of the AIoT system by calculating the equivalent CO$_{2}$\nemissions based on the energy consumption and the Carbon Intensity (CI) across\ndifferent countries. Using 2023 renewable data, our analysis reveals that\ndeploying an AIoT system in Germany results in emitting $4.62$ times higher\nCO$_2$ than in Finland, due to latter using more low-CI energy sources.", "paper_summary_zh": "人工智慧 (AI) 搭配現有的物聯網 (IoT)\n能使各種經濟部門的運作更流暢且更自主。因此，以人工智慧技術為核心的物聯網人工智慧 (AIoT) 典範，暗示著額外的能源與碳成本，而這可能會隨著更複雜的神經架構而顯著增加。為了更了解一些 AIoT 元件的能源與碳足跡 (CF)，最近的研究採用傳統的指標。然而，這些指標並非設計用來捕捉推理的能源效率面向。在本文中，我們提出一個新的指標，即 AIoT 生命周期能源成本 (eCAL)，以捕捉 AIoT 系統生命周期中推理的整體能源成本。我們設計了一種新的方法來確定 AIoT 系統的 eCAL，方法是分析參與 AIoT 生命周期中個別元件中資料處理的複雜性，並推導出整體和每位元能源消耗。有了 eCAL，我們表明模型越好且使用越多，推理的能源效率就越高。對於範例 AIoT 組態，進行 100 次推理的 eCAL 比進行 1000 次推理高出 1.43 倍。我們也透過計算基於不同國家/地區的能源消耗和碳強度 (CI) 的等效 CO2 排放量，來評估 AIoT 系統的 CF。我們的分析使用 2023 年可再生能源資料，揭示在德國部署 AIoT 系統會排放比芬蘭高出 4.62 倍的 CO2，這是因為後者使用更多低 CI 能源。", "author": "Shih-Kai Chou et.al.", "authors": "Shih-Kai Chou, Jernej Hribar, Mihael Mohorčič, Carolina Fortuna", "id": "2408.00540v1", "paper_url": "http://arxiv.org/abs/2408.00540v1", "repo": "null"}}