{"2412.15495": {"publish_time": "2024-12-20", "title": "TL-Training: A Task-Feature-Based Framework for Training Large Language Models in Tool Use", "paper_summary": "Large language models (LLMs) achieve remarkable advancements by leveraging\ntools to interact with external environments, a critical step toward\ngeneralized AI. However, the standard supervised fine-tuning (SFT) approach,\nwhich relies on large-scale datasets, often overlooks task-specific\ncharacteristics in tool use, leading to performance bottlenecks. To address\nthis issue, we analyze three existing LLMs and uncover key insights: training\ndata can inadvertently impede tool-use behavior, token importance is\ndistributed unevenly, and errors in tool calls fall into a small set of\ndistinct categories. Building on these findings, we propose TL-Training, a\ntask-feature-based framework that mitigates the effects of suboptimal training\ndata, dynamically adjusts token weights to prioritize key tokens during SFT,\nand incorporates a robust reward mechanism tailored to error categories,\noptimized through proximal policy optimization. We validate TL-Training by\ntraining CodeLLaMA-2-7B and evaluating it on four diverse open-source test\nsets. Our results demonstrate that the LLM trained by our method matches or\nsurpasses both open- and closed-source LLMs in tool-use performance using only\n1,217 training data points. Additionally, our method enhances robustness in\nnoisy environments and improves general task performance, offering a scalable\nand efficient paradigm for tool-use training in LLMs. The code and data are\navailable at https://github.com/Junjie-Ye/TL-Training.", "paper_summary_zh": "大型語言模型（LLM）透過利用與外部環境互動的工具取得顯著進展，這是邁向通用 AI 的關鍵一步。然而，標準的監督式微調（SFT）方法依賴於大規模的資料集，經常忽略工具使用中的特定任務特徵，導致效能瓶頸。為了解決這個問題，我們分析了三個現有的 LLM，並發現了關鍵見解：訓練資料可能會無意中阻礙工具使用行為、標記重要性分佈不均，以及工具呼叫中的錯誤屬於少數不同的類別。根據這些發現，我們提出了 TL-Training，一個基於任務特徵的架構，它可以減輕次佳訓練資料的影響，在 SFT 期間動態調整標記權重以優先考慮關鍵標記，並結合針對錯誤類別量身打造的強健獎勵機制，透過近端策略最佳化進行最佳化。我們透過訓練 CodeLLaMA-2-7B 並在四個不同的開源測試集中評估它來驗證 TL-Training。我們的結果證明，使用我們的方法訓練的 LLM 在工具使用效能上比開源和閉源 LLM 相同或更好，僅使用 1,217 個訓練資料點。此外，我們的方法增強了在有雜訊環境中的穩健性，並改進了整體任務效能，為 LLM 中的工具使用訓練提供了可擴充且有效率的範例。程式碼和資料可在 https://github.com/Junjie-Ye/TL-Training 取得。", "author": "Junjie Ye et.al.", "authors": "Junjie Ye, Yilong Wu, Sixian Li, Yuming Yang, Tao Gui, Qi Zhang, Xuanjing Huang, Peng Wang, Zhongchao Shi, Jianping Fan, Zhengyin Du", "id": "2412.15495v1", "paper_url": "http://arxiv.org/abs/2412.15495v1", "repo": "https://github.com/junjie-ye/tl-training"}}