{"2406.12634": {"publish_time": "2024-06-18", "title": "News Without Borders: Domain Adaptation of Multilingual Sentence Embeddings for Cross-lingual News Recommendation", "paper_summary": "Rapidly growing numbers of multilingual news consumers pose an increasing\nchallenge to news recommender systems in terms of providing customized\nrecommendations. First, existing neural news recommenders, even when powered by\nmultilingual language models (LMs), suffer substantial performance losses in\nzero-shot cross-lingual transfer (ZS-XLT). Second, the current paradigm of\nfine-tuning the backbone LM of a neural recommender on task-specific data is\ncomputationally expensive and infeasible in few-shot recommendation and\ncold-start setups, where data is scarce or completely unavailable. In this\nwork, we propose a news-adapted sentence encoder (NaSE), domain-specialized\nfrom a pretrained massively multilingual sentence encoder (SE). To this end, we\nconstruct and leverage PolyNews and PolyNewsParallel, two multilingual\nnews-specific corpora. With the news-adapted multilingual SE in place, we test\nthe effectiveness of (i.e., question the need for) supervised fine-tuning for\nnews recommendation, and propose a simple and strong baseline based on (i)\nfrozen NaSE embeddings and (ii) late click-behavior fusion. We show that NaSE\nachieves state-of-the-art performance in ZS-XLT in true cold-start and few-shot\nnews recommendation.", "paper_summary_zh": "隨著多語言新聞消費者數量快速增長，對新聞推薦系統在提供客製化推薦方面提出了越來越大的挑戰。首先，現有的神經新聞推薦系統，即使由多語言語言模型 (LM) 支援，在零次學習跨語言轉移 (ZS-XLT) 中也會遭受顯著的效能損失。其次，在神經推薦系統上微調主幹 LM 以執行特定任務資料的現行模式在次數學習推薦和冷啟動設定中需要大量運算，而且不可行，因為資料稀少或完全不可用。在這項工作中，我們提出一個新聞適應句子編碼器 (NaSE)，從預先訓練的大規模多語言句子編碼器 (SE) 中進行領域專門化。為此，我們建構並利用 PolyNews 和 PolyNewsParallel 這兩個多語言新聞特定語料庫。有了新聞適應的多語言 SE，我們測試監督微調對新聞推薦的有效性（即質疑其必要性），並提出一個基於 (i) 凍結 NaSE 嵌入和 (ii) 晚期點擊行為融合的簡單且強大的基準。我們證明 NaSE 在真正的冷啟動和次數學習新聞推薦中實現了 ZS-XLT 中的最新效能。", "author": "Andreea Iana et.al.", "authors": "Andreea Iana, Fabian David Schmidt, Goran Glavaš, Heiko Paulheim", "id": "2406.12634v1", "paper_url": "http://arxiv.org/abs/2406.12634v1", "repo": "https://github.com/andreeaiana/nase"}}