{"2405.12754": {"publish_time": "2024-05-21", "title": "Neural Operator for Accelerating Coronal Magnetic Field Model", "paper_summary": "Studying the sun's outer atmosphere is challenging due to its complex\nmagnetic fields impacting solar activities. Magnetohydrodynamics (MHD)\nsimulations help model these interactions but are extremely time-consuming\n(usually on a scale of days). Our research applies the Fourier Neural Operator\n(FNO) to accelerate the coronal magnetic field modeling, specifically, the\nBifrost MHD model. We apply Tensorized FNO (TFNO) to generate solutions from\npartial differential equations (PDEs) over a 3D domain efficiently. TFNO's\nperformance is compared with other deep learning methods, highlighting its\naccuracy and scalability. Physics analysis confirms that TFNO is reliable and\ncapable of accelerating MHD simulations with high precision. This advancement\nimproves efficiency in data handling, enhances predictive capabilities, and\nprovides a better understanding of magnetic topologies.", "paper_summary_zh": "由於太陽外大氣層複雜的磁場會影響太陽活動，因此研究太陽外大氣層是一項挑戰。磁流體動力學 (MHD) 模擬有助於建立這些交互作用的模型，但極為耗時（通常以天為單位）。我們的研究將傅立葉神經算子 (FNO) 應用於加速日冕磁場建模，特別是 Bifrost MHD 模型。我們應用張量化 FNO (TFNO) 來有效地根據 3D 域上的偏微分方程式 (PDE) 生成解。TFNO 的效能與其他深度學習方法進行比較，突出了它的準確性和可擴充性。物理分析證實 TFNO 是可靠的，並且能夠以高精度加速 MHD 模擬。此進展提升了資料處理的效率，增強了預測能力，並且提供了對磁場拓撲結構的更深入了解。", "author": "Yutao Du et.al.", "authors": "Yutao Du, Qin Li, Raghav Gnanasambandam, Mengnan Du, Haimin Wang, Bo Shen", "id": "2405.12754v1", "paper_url": "http://arxiv.org/abs/2405.12754v1", "repo": "null"}}