{"2412.20290": {"publish_time": "2024-12-28", "title": "Transformer-Based Contrastive Meta-Learning For Low-Resource Generalizable Activity Recognition", "paper_summary": "Deep learning has been widely adopted for human activity recognition (HAR)\nwhile generalizing a trained model across diverse users and scenarios remains\nchallenging due to distribution shifts. The inherent low-resource challenge in\nHAR, i.e., collecting and labeling adequate human-involved data can be\nprohibitively costly, further raising the difficulty of tackling DS. We propose\nTACO, a novel transformer-based contrastive meta-learning approach for\ngeneralizable HAR. TACO addresses DS by synthesizing virtual target domains in\ntraining with explicit consideration of model generalizability. Additionally,\nwe extract expressive feature with the attention mechanism of Transformer and\nincorporate the supervised contrastive loss function within our\nmeta-optimization to enhance representation learning. Our evaluation\ndemonstrates that TACO achieves notably better performance across various\nlow-resource DS scenarios.", "paper_summary_zh": "深度學習已被廣泛採用於人類活動辨識 (HAR)，然而，由於分佈轉移，在不同使用者和場景中推廣已訓練模型仍然具有挑戰性。HAR 中固有的低資源挑戰，即收集和標記足夠的人類參與資料可能成本高昂，進一步增加了應對 DS 的難度。我們提出 TACO，一種新穎的基於 Transformer 的對比元學習方法，用於可推廣的 HAR。TACO 通過在訓練中合成虛擬目標域來解決 DS，並明確考慮模型的可推廣性。此外，我們利用 Transformer 的注意力機制提取表達性特徵，並在我們的元優化中納入監督對比損失函數，以增強表示學習。我們的評估表明，TACO 在各種低資源 DS 場景中取得了顯著更好的效能。", "author": "Junyao Wang et.al.", "authors": "Junyao Wang, Mohammad Abdullah Al Faruque", "id": "2412.20290v1", "paper_url": "http://arxiv.org/abs/2412.20290v1", "repo": "null"}}