{"2408.14229": {"publish_time": "2024-08-26", "title": "Gallery-Aware Uncertainty Estimation For Open-Set Face Recognition", "paper_summary": "Accurately estimating image quality and model robustness improvement are\ncritical challenges in unconstrained face recognition, which can be addressed\nthrough uncertainty estimation via probabilistic face embeddings. Previous\nresearch mainly focused on uncertainty estimation in face verification, leaving\nthe open-set face recognition task underexplored. In open-set face recognition,\none seeks to classify an image, which could also be unknown. Here, the low\nvariance of probabilistic embedding does not imply a low error probability: an\nimage embedding could be close to several classes in a gallery, thus yielding\nhigh uncertainty. We propose a method aware of two sources of ambiguity in the\nopen-set recognition system: (1) the gallery uncertainty caused by overlapping\nclasses and (2) the uncertainty of the face embeddings. To detect both types,\nwe use a Bayesian probabilistic model of embedding distribution, which provides\na principled uncertainty estimate. Challenging open-set face recognition\ndatasets, such as IJB-C, serve as a testbed for our method. We also propose a\nnew open-set recognition protocol for whale and dolphin identification. The\nproposed approach better identifies recognition errors than uncertainty\nestimation methods based solely on image quality.", "paper_summary_zh": "準確估計影像品質和模型健壯性提升是無約束人臉辨識的重大挑戰，這可透過機率人臉嵌入的非確定性估計來解決。先前的研究主要集中於人臉驗證中的非確定性估計，而未探討開放式人臉辨識任務。在開放式人臉辨識中，人們試圖對影像進行分類，而影像也可能是未知的。在此，機率嵌入的低變異性並不意味著低錯誤機率：影像嵌入可能接近圖庫中的多個類別，因此產生高非確定性。我們提出一個方法，了解開放式辨識系統中兩個含糊來源：(1) 重疊類別造成的圖庫非確定性，以及 (2) 人臉嵌入的非確定性。為了偵測這兩種類型，我們使用嵌入分佈的貝氏機率模型，這提供了有原則的非確定性估計。具挑戰性的開放式人臉辨識資料集，例如 IJB-C，可做為我們方法的測試平台。我們也提出一個新的開放式辨識協定，用於鯨魚和海豚辨識。所提出的方法比僅根據影像品質的非確定性估計方法更能辨識出辨識錯誤。", "author": "Leonid Erlygin et.al.", "authors": "Leonid Erlygin, Alexey Zaytsev", "id": "2408.14229v1", "paper_url": "http://arxiv.org/abs/2408.14229v1", "repo": "null"}}