{"2501.13726": {"publish_time": "2025-01-23", "title": "RPO: Retrieval Preference Optimization for Robust Retrieval-Augmented Generation", "paper_summary": "While Retrieval-Augmented Generation (RAG) has exhibited promise in utilizing\nexternal knowledge, its generation process heavily depends on the quality and\naccuracy of the retrieved context. Large language models (LLMs) struggle to\nevaluate the correctness of non-parametric knowledge retrieved externally when\nit differs from internal memorization, leading to knowledge conflicts during\nresponse generation. To this end, we introduce the Retrieval Preference\nOptimization (RPO), a lightweight and effective alignment method to adaptively\nleverage multi-source knowledge based on retrieval relevance. An implicit\nrepresentation of retrieval relevance is derived and incorporated into the\nreward model to integrate retrieval evaluation and response generation into a\nsingle model, solving the problem that previous methods necessitate the\nadditional procedure to assess the retrieval quality. Notably, RPO is the only\nRAG-dedicated alignment approach that quantifies the awareness of retrieval\nrelevance in training, overcoming mathematical obstacles. Experiments on four\ndatasets demonstrate that RPO outperforms RAG by 4-10% in accuracy without any\nextra component, exhibiting its robust generalization.", "paper_summary_zh": "檢索增強生成（RAG）雖然在利用外部知識方面表現出前景，但其生成過程嚴重依賴於檢索語境的品質和準確性。大型語言模型（LLM）在評估外部檢索的非參數知識的正確性時會遇到困難，特別是在其與內部記憶不同時，這會在回應生成期間導致知識衝突。為此，我們引入了檢索偏好最佳化（RPO），這是一種輕量且有效的比對方法，可根據檢索相關性自適應地利用多來源知識。我們衍生了一個檢索相關性的隱含表徵，並將其納入獎勵模型，以將檢索評估和回應生成整合到一個模型中，解決了先前方法需要額外程序來評估檢索品質的問題。值得注意的是，RPO 是唯一量化訓練中檢索相關性認知的 RAG 專用比對方法，克服了數學障礙。在四個資料集上的實驗表明，RPO 在準確性上比 RAG 高出 4-10%，且無任何額外元件，展現出其穩健的泛化性。", "author": "Shi-Qi Yan et.al.", "authors": "Shi-Qi Yan, Zhen-Hua Ling", "id": "2501.13726v1", "paper_url": "http://arxiv.org/abs/2501.13726v1", "repo": "null"}}