{"2406.02921": {"publish_time": "2024-06-05", "title": "Text Injection for Neural Contextual Biasing", "paper_summary": "Neural contextual biasing effectively improves automatic speech recognition\n(ASR) for crucial phrases within a speaker's context, particularly those that\nare infrequent in the training data. This work proposes contextual text\ninjection (CTI) to enhance contextual ASR. CTI leverages not only the paired\nspeech-text data, but also a much larger corpus of unpaired text to optimize\nthe ASR model and its biasing component. Unpaired text is converted into\nspeech-like representations and used to guide the model's attention towards\nrelevant bias phrases. Moreover, we introduce a contextual text-injected (CTI)\nminimum word error rate (MWER) training, which minimizes the expected WER\ncaused by contextual biasing when unpaired text is injected into the model.\nExperiments show that CTI with 100 billion text sentences can achieve up to\n43.3% relative WER reduction from a strong neural biasing model. CTI-MWER\nprovides a further relative improvement of 23.5%.", "paper_summary_zh": "神經脈絡偏置有效改善了自動語音辨識 (ASR) 中說話者脈絡內關鍵詞彙的辨識，特別是那些在訓練資料中出現頻率低的詞彙。本研究提出脈絡文本注入 (CTI) 來增強脈絡 ASR。CTI 不僅利用配對的語音文字資料，還利用一個更大的未配對文字語料庫來最佳化 ASR 模型及其偏置組成。未配對的文字轉換成類語音的表示，並用於引導模型的注意力朝向相關的偏置詞彙。此外，我們引入了脈絡文本注入 (CTI) 最小詞彙錯誤率 (MWER) 訓練，它會將未配對的文字注入模型時所造成的預期 WER 降到最低。實驗顯示，使用 1,000 億個文字句子的 CTI 可以讓強大的神經偏置模型的 WER 相對減少多達 43.3%。CTI-MWER 進一步提供了 23.5% 的相對進步。", "author": "Zhong Meng et.al.", "authors": "Zhong Meng, Zelin Wu, Rohit Prabhavalkar, Cal Peyser, Weiran Wang, Nanxin Chen, Tara N. Sainath, Bhuvana Ramabhadran", "id": "2406.02921v1", "paper_url": "http://arxiv.org/abs/2406.02921v1", "repo": "null"}}