{"2405.03328": {"publish_time": "2024-05-06", "title": "Enhancing Spatiotemporal Disease Progression Models via Latent Diffusion and Prior Knowledge", "paper_summary": "In this work, we introduce Brain Latent Progression (BrLP), a novel\nspatiotemporal disease progression model based on latent diffusion. BrLP is\ndesigned to predict the evolution of diseases at the individual level on 3D\nbrain MRIs. Existing deep generative models developed for this task are\nprimarily data-driven and face challenges in learning disease progressions.\nBrLP addresses these challenges by incorporating prior knowledge from disease\nmodels to enhance the accuracy of predictions. To implement this, we propose to\nintegrate an auxiliary model that infers volumetric changes in various brain\nregions. Additionally, we introduce Latent Average Stabilization (LAS), a novel\ntechnique to improve spatiotemporal consistency of the predicted progression.\nBrLP is trained and evaluated on a large dataset comprising 11,730 T1-weighted\nbrain MRIs from 2,805 subjects, collected from three publicly available,\nlongitudinal Alzheimer's Disease (AD) studies. In our experiments, we compare\nthe MRI scans generated by BrLP with the actual follow-up MRIs available from\nthe subjects, in both cross-sectional and longitudinal settings. BrLP\ndemonstrates significant improvements over existing methods, with an increase\nof 22% in volumetric accuracy across AD-related brain regions and 43% in image\nsimilarity to the ground-truth scans. The ability of BrLP to generate\nconditioned 3D scans at the subject level, along with the novelty of\nintegrating prior knowledge to enhance accuracy, represents a significant\nadvancement in disease progression modeling, opening new avenues for precision\nmedicine. The code of BrLP is available at the following link:\nhttps://github.com/LemuelPuglisi/BrLP.", "paper_summary_zh": "", "author": "Lemuel Puglisi et.al.", "authors": "Lemuel Puglisi,Daniel C. Alexander,Daniele Ravì", "id": "2405.03328v1", "paper_url": "http://arxiv.org/abs/2405.03328v1", "repo": "null"}}