{"2406.17282": {"publish_time": "2024-06-25", "title": "SetBERT: Enhancing Retrieval Performance for Boolean Logic and Set Operation Queries", "paper_summary": "We introduce SetBERT, a fine-tuned BERT-based model designed to enhance query\nembeddings for set operations and Boolean logic queries, such as Intersection\n(AND), Difference (NOT), and Union (OR). SetBERT significantly improves\nretrieval performance for logic-structured queries, an area where both\ntraditional and neural retrieval methods typically underperform. We propose an\ninnovative use of inversed-contrastive loss, focusing on identifying the\nnegative sentence, and fine-tuning BERT with a dataset generated via prompt\nGPT. Furthermore, we demonstrate that, unlike other BERT-based models,\nfine-tuning with triplet loss actually degrades performance for this specific\ntask. Our experiments reveal that SetBERT-base not only significantly\noutperforms BERT-base (up to a 63% improvement in Recall) but also achieves\nperformance comparable to the much larger BERT-large model, despite being only\none-third the size.", "paper_summary_zh": "我們引入了 SetBERT，一個經過微調的 BERT 模型，旨在增強集合運算和布林邏輯查詢（例如交集 (AND)、差集 (NOT) 和聯集 (OR)）的查詢嵌入。SetBERT 大幅提升了邏輯結構查詢的檢索效能，這是傳統和神經網路檢索方法通常表現不佳的領域。我們提出了一種創新的反向對比損失使用方式，專注於識別負向句子，並使用透過提示 GPT 生成的資料集微調 BERT。此外，我們證明了與其他 BERT 模型不同，使用三重損失進行微調實際上會降低此特定任務的效能。我們的實驗顯示，SetBERT-base 不僅顯著優於 BERT-base（召回率提升達 63%），而且儘管只有三分之一的大小，但效能可與大得多的 BERT-large 模型相媲美。", "author": "Quan Mai et.al.", "authors": "Quan Mai, Susan Gauch, Douglas Adams", "id": "2406.17282v2", "paper_url": "http://arxiv.org/abs/2406.17282v2", "repo": "null"}}