{"2407.19681": {"publish_time": "2024-07-29", "title": "Motion Manifold Flow Primitives for Language-Guided Trajectory Generation", "paper_summary": "Developing text-based robot trajectory generation models is made particularly\ndifficult by the small dataset size, high dimensionality of the trajectory\nspace, and the inherent complexity of the text-conditional motion distribution.\nRecent manifold learning-based methods have partially addressed the\ndimensionality and dataset size issues, but struggle with the complex\ntext-conditional distribution. In this paper we propose a text-based trajectory\ngeneration model that attempts to address all three challenges while relying on\nonly a handful of demonstration trajectory data. Our key idea is to leverage\nrecent flow-based models capable of capturing complex conditional\ndistributions, not directly in the high-dimensional trajectory space, but\nrather in the low-dimensional latent coordinate space of the motion manifold,\nwith deliberately designed regularization terms to ensure smoothness of motions\nand robustness to text variations. We show that our {\\it Motion Manifold Flow\nPrimitive (MMFP)} framework can accurately generate qualitatively distinct\nmotions for a wide range of text inputs, significantly outperforming existing\nmethods.", "paper_summary_zh": "開發基於文字的機器人軌跡生成模型特別困難，因為資料集規模小、軌跡空間維度高，以及文字條件運動分佈的內在複雜性。最近基於流形的學習方法已部分解決了維度和資料集規模問題，但仍難以處理複雜的文字條件分佈。在本文中，我們提出了一個基於文字的軌跡生成模型，試圖解決這三個挑戰，同時僅依賴少數示範軌跡資料。我們的關鍵想法是利用最近的基於流動的模型，它能夠捕捉複雜的條件分佈，不是直接在高維軌跡空間中，而是在運動流形的低維潛在座標空間中，並透過精心設計的正則化項來確保動作的平滑性和對文字變化的魯棒性。我們展示了我們的「運動流形流動基本體 (MMFP)」架構可以準確地為廣泛的文字輸入生成定性上不同的動作，顯著優於現有方法。", "author": "Yonghyeon Lee et.al.", "authors": "Yonghyeon Lee, Byeongho Lee, Seungyeon Kim, Frank C. Park", "id": "2407.19681v1", "paper_url": "http://arxiv.org/abs/2407.19681v1", "repo": "null"}}