{"2410.03399": {"publish_time": "2024-10-04", "title": "EBES: Easy Benchmarking for Event Sequences", "paper_summary": "Event sequences, characterized by irregular sampling intervals and a mix of\ncategorical and numerical features, are common data structures in various\nreal-world domains such as healthcare, finance, and user interaction logs.\nDespite advances in temporal data modeling techniques, there is no standardized\nbenchmarks for evaluating their performance on event sequences. This\ncomplicates result comparison across different papers due to varying evaluation\nprotocols, potentially misleading progress in this field. We introduce EBES, a\ncomprehensive benchmarking tool with standardized evaluation scenarios and\nprotocols, focusing on regression and classification problems with\nsequence-level targets. Our library simplifies benchmarking, dataset addition,\nand method integration through a unified interface. It includes a novel\nsynthetic dataset and provides preprocessed real-world datasets, including the\nlargest publicly available banking dataset. Our results provide an in-depth\nanalysis of datasets, identifying some as unsuitable for model comparison. We\ninvestigate the importance of modeling temporal and sequential components, as\nwell as the robustness and scaling properties of the models. These findings\nhighlight potential directions for future research. Our benchmark aim is to\nfacilitate reproducible research, expediting progress and increasing real-world\nimpacts.", "paper_summary_zh": "事件序列的特征是不规则的采样间隔和类别与数值特征的混合，在医疗保健、金融和用户交互日志等各种现实世界领域中是常见的资料结构。尽管时间资料建模技术不断进步，但尚未有标准化的基准来评估其在事件序列上的效能。这使得不同论文之间的结果比较变得复杂，因为评估协议不同，可能会误导该领域的进展。我们引入了 EBES，这是一个全面的基准测试工具，具有标准化的评估场景和协议，重点关注序列级别目标的回归和分类问题。我们的资料库通过统一的界面简化了基准测试、数据集添加和方法整合。它包括一个新颖的合成数据集，并提供预处理的现实世界数据集，包括最大的公开银行数据集。我们的结果提供了对数据集的深入分析，指出一些数据集不适合模型比较。我们调查了对时间和顺序组件进行建模的重要性，以及模型的鲁棒性和缩放特性。这些发现突出了未来研究的潜在方向。我们的基准测试的目标是促进可重复的研究，加快进度并增加现实世界的影响。", "author": "Dmitry Osin et.al.", "authors": "Dmitry Osin, Igor Udovichenko, Viktor Moskvoretskii, Egor Shvetsov, Evgeny Burnaev", "id": "2410.03399v1", "paper_url": "http://arxiv.org/abs/2410.03399v1", "repo": "null"}}