{"2408.07539": {"publish_time": "2024-08-14", "title": "Cross-aware Early Fusion with Stage-divided Vision and Language Transformer Encoders for Referring Image Segmentation", "paper_summary": "Referring segmentation aims to segment a target object related to a natural\nlanguage expression. Key challenges of this task are understanding the meaning\nof complex and ambiguous language expressions and determining the relevant\nregions in the image with multiple objects by referring to the expression.\nRecent models have focused on the early fusion with the language features at\nthe intermediate stage of the vision encoder, but these approaches have a\nlimitation that the language features cannot refer to the visual information.\nTo address this issue, this paper proposes a novel architecture, Cross-aware\nearly fusion with stage-divided Vision and Language Transformer encoders\n(CrossVLT), which allows both language and vision encoders to perform the early\nfusion for improving the ability of the cross-modal context modeling. Unlike\nprevious methods, our method enables the vision and language features to refer\nto each other's information at each stage to mutually enhance the robustness of\nboth encoders. Furthermore, unlike the conventional scheme that relies solely\non the high-level features for the cross-modal alignment, we introduce a\nfeature-based alignment scheme that enables the low-level to high-level\nfeatures of the vision and language encoders to engage in the cross-modal\nalignment. By aligning the intermediate cross-modal features in all encoder\nstages, this scheme leads to effective cross-modal fusion. In this way, the\nproposed approach is simple but effective for referring image segmentation, and\nit outperforms the previous state-of-the-art methods on three public\nbenchmarks.", "paper_summary_zh": "參考分割旨在區隔與自然語言表達相關的目標物件。此任務的主要挑戰在於理解複雜且模稜兩可的語言表達，並根據表達來決定影像中有多個物件時相關區域。最近的模型專注於在視覺編碼器的中間階段與語言特徵進行早期融合，但這些方法有一個限制，即語言特徵無法參考視覺資訊。為了解決這個問題，本文提出了一種新穎的架構，即在階段劃分的視覺和語言轉換器編碼器（CrossVLT）中進行跨感知的早期融合，這允許語言和視覺編碼器執行早期融合以提升跨模態情境建模的能力。與先前的做法不同，我們的做法使視覺和語言特徵能夠在每個階段參考彼此的資訊，以相互提升兩個編碼器的穩健性。此外，與僅依賴高層級特徵進行跨模態對齊的傳統方案不同，我們引入了一個基於特徵的對齊方案，使視覺和語言編碼器的低層級到高層級特徵能夠參與跨模態對齊。透過在所有編碼器階段對齊中間跨模態特徵，此方案可帶來有效的跨模態融合。透過這種方式，所提出的方法對於參考影像分割來說既簡單又有效，而且在三個公開基準上優於先前的最先進方法。", "author": "Yubin Cho et.al.", "authors": "Yubin Cho, Hyunwoo Yu, Suk-ju Kang", "id": "2408.07539v1", "paper_url": "http://arxiv.org/abs/2408.07539v1", "repo": "null"}}