{"2407.04467": {"publish_time": "2024-07-05", "title": "Are Large Language Models Strategic Decision Makers? A Study of Performance and Bias in Two-Player Non-Zero-Sum Games", "paper_summary": "Large Language Models (LLMs) have been increasingly used in real-world\nsettings, yet their strategic abilities remain largely unexplored. Game theory\nprovides a good framework for assessing the decision-making abilities of LLMs\nin interactions with other agents. Although prior studies have shown that LLMs\ncan solve these tasks with carefully curated prompts, they fail when the\nproblem setting or prompt changes. In this work we investigate LLMs' behaviour\nin strategic games, Stag Hunt and Prisoner Dilemma, analyzing performance\nvariations under different settings and prompts. Our results show that the\ntested state-of-the-art LLMs exhibit at least one of the following systematic\nbiases: (1) positional bias, (2) payoff bias, or (3) behavioural bias.\nSubsequently, we observed that the LLMs' performance drops when the game\nconfiguration is misaligned with the affecting biases. Performance is assessed\nbased on the selection of the correct action, one which agrees with the\nprompted preferred behaviours of both players. Alignment refers to whether the\nLLM's bias aligns with the correct action. For example, GPT-4o's average\nperformance drops by 34% when misaligned. Additionally, the current trend of\n\"bigger and newer is better\" does not hold for the above, where GPT-4o (the\ncurrent best-performing LLM) suffers the most substantial performance drop.\nLastly, we note that while chain-of-thought prompting does reduce the effect of\nthe biases on most models, it is far from solving the problem at the\nfundamental level.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 在現實世界中的應用日益廣泛，但它們的策略能力仍未得到充分探索。博弈論提供了一個良好的框架，用於評估 LLM 在與其他代理互動時的決策能力。儘管先前的研究表明，LLM 可以通過精心策劃的提示來解決這些任務，但當問題設置或提示發生變化時，它們就會失敗。在這項工作中，我們研究了 LLM 在策略博弈、Stag Hunt 和囚徒困境中的行為，分析了在不同設置和提示下的性能變化。我們的結果表明，經過測試的最新 LLM 表現出以下系統性偏差中至少一種：(1) 位置偏差，(2) 報酬偏差，或 (3) 行為偏差。隨後，我們觀察到，當遊戲配置與影響偏差不一致時，LLM 的性能會下降。性能評估基於正確動作的選擇，該動作與提示的兩個玩家的首選行為一致。對齊是指 LLM 的偏差是否與正確的動作對齊。例如，當 GPT-4o 錯位時，其平均性能下降 34%。此外，上述情況並不符合「越大、更新越好」的當前趨勢，其中 GPT-4o（當前性能最佳的 LLM）遭受了最顯著的性能下降。最後，我們注意到，儘管思考鏈提示確實減少了偏差對大多數模型的影響，但遠未從根本上解決問題。</paragraph>", "author": "Nathan Herr et.al.", "authors": "Nathan Herr, Fernando Acero, Roberta Raileanu, María Pérez-Ortiz, Zhibin Li", "id": "2407.04467v1", "paper_url": "http://arxiv.org/abs/2407.04467v1", "repo": "null"}}