{"2406.11668": {"publish_time": "2024-06-17", "title": "\"Not Aligned\" is Not \"Malicious\": Being Careful about Hallucinations of Large Language Models' Jailbreak", "paper_summary": "\"Jailbreak\" is a major safety concern of Large Language Models (LLMs), which\noccurs when malicious prompts lead LLMs to produce harmful outputs, raising\nissues about the reliability and safety of LLMs. Therefore, an effective\nevaluation of jailbreaks is very crucial to develop its mitigation strategies.\nHowever, our research reveals that many jailbreaks identified by current\nevaluations may actually be hallucinations-erroneous outputs that are mistaken\nfor genuine safety breaches. This finding suggests that some perceived\nvulnerabilities might not represent actual threats, indicating a need for more\nprecise red teaming benchmarks. To address this problem, we propose the\n$\\textbf{B}$enchmark for reli$\\textbf{AB}$ilit$\\textbf{Y}$ and\njail$\\textbf{B}$reak ha$\\textbf{L}$l$\\textbf{U}$cination $\\textbf{E}$valuation\n(BabyBLUE). BabyBLUE introduces a specialized validation framework including\nvarious evaluators to enhance existing jailbreak benchmarks, ensuring outputs\nare useful malicious instructions. Additionally, BabyBLUE presents a new\ndataset as an augmentation to the existing red teaming benchmarks, specifically\naddressing hallucinations in jailbreaks, aiming to evaluate the true potential\nof jailbroken LLM outputs to cause harm to human society.", "paper_summary_zh": "「越獄」是大型語言模型（LLM）的主要安全問題，它發生在惡意提示導致 LLM 產生有害輸出時，引發了關於 LLM 的可靠性和安全性問題。因此，對越獄進行有效的評估對於制定其緩解策略至關重要。然而，我們的研究表明，當前評估中識別出的許多越獄實際上可能是幻覺——錯誤的輸出，被誤認為真正的安全漏洞。這一發現表明，一些感知到的漏洞可能並不能代表實際威脅，這表明需要更精確的紅隊基準。為了解決這個問題，我們提出了$\\textbf{B}$enchmark for reli$\\textbf{AB}$ilit$\\textbf{Y}$ and jail$\\textbf{B}$reak ha$\\textbf{L}$l$\\textbf{U}$cination $\\textbf{E}$valuation（BabyBLUE）。BabyBLUE 引入了一個專門的驗證框架，包括各種評估器，以增強現有的越獄基準，確保輸出是有用的惡意指令。此外，BabyBLUE 還提供了一個新數據集作為對現有紅隊基準的擴充，特別針對越獄中的幻覺，旨在評估越獄 LLM 輸出對人類社會造成傷害的真正潛力。", "author": "Lingrui Mei et.al.", "authors": "Lingrui Mei, Shenghua Liu, Yiwei Wang, Baolong Bi, Jiayi Mao, Xueqi Cheng", "id": "2406.11668v1", "paper_url": "http://arxiv.org/abs/2406.11668v1", "repo": "null"}}