{"2411.16405": {"publish_time": "2024-11-25", "title": "Synthesising Handwritten Music with GANs: A Comprehensive Evaluation of CycleWGAN, ProGAN, and DCGAN", "paper_summary": "The generation of handwritten music sheets is a crucial step toward enhancing\nOptical Music Recognition (OMR) systems, which rely on large and diverse\ndatasets for optimal performance. However, handwritten music sheets, often\nfound in archives, present challenges for digitisation due to their fragility,\nvaried handwriting styles, and image quality. This paper addresses the data\nscarcity problem by applying Generative Adversarial Networks (GANs) to\nsynthesise realistic handwritten music sheets. We provide a comprehensive\nevaluation of three GAN models - DCGAN, ProGAN, and CycleWGAN - comparing their\nability to generate diverse and high-quality handwritten music images. The\nproposed CycleWGAN model, which enhances style transfer and training stability,\nsignificantly outperforms DCGAN and ProGAN in both qualitative and quantitative\nevaluations. CycleWGAN achieves superior performance, with an FID score of\n41.87, an IS of 2.29, and a KID of 0.05, making it a promising solution for\nimproving OMR systems.", "paper_summary_zh": "手寫樂譜的生成是提升光學音樂辨識 (OMR) 系統的關鍵步驟，而 OMR 系統仰賴龐大且多元的資料集才能發揮最佳效能。然而，手寫樂譜通常存放在檔案館中，由於其脆弱性、書寫風格多變，以及影像品質不佳，因此在數位化過程中會面臨挑戰。本文透過應用生成對抗網路 (GAN) 來合成逼真的手寫樂譜，以解決資料稀少的問題。我們提供三種 GAN 模型的全面評估，包括 DCGAN、ProGAN 和 CycleWGAN，並比較它們生成多樣化且高品質手寫樂譜影像的能力。所提出的 CycleWGAN 模型增強了樣式轉移和訓練穩定性，在定性和定量評估中都明顯優於 DCGAN 和 ProGAN。CycleWGAN 達到優異的效能，FID 分數為 41.87，IS 為 2.29，KID 為 0.05，使其成為改善 OMR 系統的潛在解決方案。", "author": "Elona Shatri et.al.", "authors": "Elona Shatri, Kalikidhar Palavala, George Fazekas", "id": "2411.16405v1", "paper_url": "http://arxiv.org/abs/2411.16405v1", "repo": "null"}}