{"2411.04371": {"publish_time": "2024-11-07", "title": "ComFairGNN: Community Fair Graph Neural Network", "paper_summary": "Graph Neural Networks (GNNs) have become the leading approach for addressing\ngraph analytical problems in various real-world scenarios. However, GNNs may\nproduce biased predictions against certain demographic subgroups due to node\nattributes and neighbors surrounding a node. Most current research on GNN\nfairness focuses predominantly on debiasing GNNs using oversimplified fairness\nevaluation metrics, which can give a misleading impression of fairness.\nUnderstanding the potential evaluation paradoxes due to the complicated nature\nof the graph structure is crucial for developing effective GNN debiasing\nmechanisms. In this paper, we examine the effectiveness of current GNN\ndebiasing methods in terms of unfairness evaluation. Specifically, we introduce\na community-level strategy to measure bias in GNNs and evaluate debiasing\nmethods at this level. Further, We introduce ComFairGNN, a novel framework\ndesigned to mitigate community-level bias in GNNs. Our approach employs a\nlearnable coreset-based debiasing function that addresses bias arising from\ndiverse local neighborhood distributions during GNNs neighborhood aggregation.\nComprehensive evaluations on three benchmark datasets demonstrate our model's\neffectiveness in both accuracy and fairness metrics.", "paper_summary_zh": "圖形神經網路 (GNN) 已成為解決各種實際場景中圖形分析問題的主要方法。然而，由於節點屬性和節點周圍的鄰居，GNN 可能會對某些人口統計子群產生有偏見的預測。目前大多數關於 GNN 公平性的研究主要集中在使用過於簡化的公平性評估指標對 GNN 進行去偏，這可能會給人造成公平性的錯誤印象。了解由於圖形結構的複雜性而導致的潛在評估悖論對於開發有效的 GNN 去偏機制至關重要。在本文中，我們檢查了當前 GNN 去偏方法在不公平評估方面的有效性。具體來說，我們引入了一個社區級策略來衡量 GNN 中的偏差，並在此級別評估去偏方法。此外，我們引入了 ComFairGNN，這是一個旨在減輕 GNN 中社區級偏差的新框架。我們的做法採用了一個可學習的基於核心的去偏函數，該函數解決了 GNN 鄰域聚合過程中來自不同局部鄰域分佈的偏差。在三個基準數據集上的綜合評估證明了我們的模型在準確性和公平性指標方面的有效性。", "author": "Yonas Sium et.al.", "authors": "Yonas Sium, Qi Li", "id": "2411.04371v1", "paper_url": "http://arxiv.org/abs/2411.04371v1", "repo": "null"}}