{"2501.11851": {"publish_time": "2025-01-21", "title": "Challenges in Expanding Portuguese Resources: A View from Open Information Extraction", "paper_summary": "Open Information Extraction (Open IE) is the task of extracting structured\ninformation from textual documents, independent of domain. While traditional\nOpen IE methods were based on unsupervised approaches, recently, with the\nemergence of robust annotated datasets, new data-based approaches have been\ndeveloped to achieve better results. These innovations, however, have focused\nmainly on the English language due to a lack of datasets and the difficulty of\nconstructing such resources for other languages. In this work, we present a\nhigh-quality manually annotated corpus for Open Information Extraction in the\nPortuguese language, based on a rigorous methodology grounded in established\nsemantic theories. We discuss the challenges encountered in the annotation\nprocess, propose a set of structural and contextual annotation rules, and\nvalidate our corpus by evaluating the performance of state-of-the-art Open IE\nsystems. Our resource addresses the lack of datasets for Open IE in Portuguese\nand can support the development and evaluation of new methods and systems in\nthis area.", "paper_summary_zh": "開放式資訊萃取（Open IE）是一項從文本文件中萃取出結構化資訊的任務，與領域無關。雖然傳統的開放式資訊萃取方法是基於非監督式方法，但最近，隨著強健標註資料集的出現，新的資料驅動方法已被開發出來以獲得更好的結果。然而，這些創新主要集中在英語上，因為缺乏資料集和建構此類資源的困難性。在這項工作中，我們提出了一個基於嚴謹方法學（根植於已建立的語義理論）的高品質手動標註語料庫，用於葡萄牙語的開放式資訊萃取。我們討論標註過程中遇到的挑戰，提出了一組結構化和脈絡標註規則，並透過評估最先進的開放式資訊萃取系統的效能來驗證我們的語料庫。我們的資源解決了葡萄牙語開放式資訊萃取缺乏資料集的問題，並可以支援此領域中新方法和系統的開發和評估。", "author": "Marlo Souza et.al.", "authors": "Marlo Souza, Bruno Cabral, Daniela Claro, Lais Salvador", "id": "2501.11851v1", "paper_url": "http://arxiv.org/abs/2501.11851v1", "repo": "null"}}