{"2409.10883": {"publish_time": "2024-09-17", "title": "CREAM: Comparison-Based Reference-Free ELO-Ranked Automatic Evaluation for Meeting Summarization", "paper_summary": "Large Language Models (LLMs) have spurred interest in automatic evaluation\nmethods for summarization, offering a faster, more cost-effective alternative\nto human evaluation. However, existing methods often fall short when applied to\ncomplex tasks like long-context summarizations and dialogue-based meeting\nsummarizations. In this paper, we introduce CREAM (Comparison-Based\nReference-Free Elo-Ranked Automatic Evaluation for Meeting Summarization), a\nnovel framework that addresses the unique challenges of evaluating meeting\nsummaries. CREAM leverages a combination of chain-of-thought reasoning and key\nfacts alignment to assess conciseness and completeness of model-generated\nsummaries without requiring reference. By employing an ELO ranking system, our\napproach provides a robust mechanism for comparing the quality of different\nmodels or prompt configurations.", "paper_summary_zh": "大型語言模型 (LLM) 促使人們對摘要的自動評估方法產生興趣，提供比人工評估更快速、更具成本效益的替代方案。然而，現有的方法在應用於複雜任務（例如長文脈摘要和基於對話的會議摘要）時，往往會有所不足。在本文中，我們介紹了 CREAM（基於比較的無參考 Elo 排名自動評估會議摘要），這是一個新穎的框架，用於解決評估會議摘要的獨特挑戰。CREAM 採用思想鏈推理和關鍵事實對齊的組合，來評估模型生成的摘要的簡潔性和完整性，而無需參考。通過採用 ELO 排名系統，我們的做法提供了一個強大的機制，用於比較不同模型或提示配置的品質。", "author": "Ziwei Gong et.al.", "authors": "Ziwei Gong, Lin Ai, Harshsaiprasad Deshpande, Alexander Johnson, Emmy Phung, Zehui Wu, Ahmad Emami, Julia Hirschberg", "id": "2409.10883v1", "paper_url": "http://arxiv.org/abs/2409.10883v1", "repo": "null"}}