{"2407.02489": {"publish_time": "2024-07-02", "title": "Magic Insert: Style-Aware Drag-and-Drop", "paper_summary": "We present Magic Insert, a method for dragging-and-dropping subjects from a\nuser-provided image into a target image of a different style in a physically\nplausible manner while matching the style of the target image. This work\nformalizes the problem of style-aware drag-and-drop and presents a method for\ntackling it by addressing two sub-problems: style-aware personalization and\nrealistic object insertion in stylized images. For style-aware personalization,\nour method first fine-tunes a pretrained text-to-image diffusion model using\nLoRA and learned text tokens on the subject image, and then infuses it with a\nCLIP representation of the target style. For object insertion, we use\nBootstrapped Domain Adaption to adapt a domain-specific photorealistic object\ninsertion model to the domain of diverse artistic styles. Overall, the method\nsignificantly outperforms traditional approaches such as inpainting. Finally,\nwe present a dataset, SubjectPlop, to facilitate evaluation and future progress\nin this area. Project page: https://magicinsert.github.io/", "paper_summary_zh": "<paragraph>我們提出 Magic Insert，一種以物理合理的方式將主體從使用者提供的影像拖放至不同風格的目標影像，同時匹配目標影像的風格。這項工作將風格感知拖放的問題形式化，並提出一個方法來解決它，方法是解決兩個子問題：風格感知個性化和樣式化影像中的真實物件插入。對於風格感知個性化，我們的做法首先使用 LoRA 和學習到的主體影像文字代號微調預訓練的文字轉影像擴散模型，然後注入目標風格的 CLIP 表徵。對於物件插入，我們使用引導域適應將特定於領域的照片寫實物件插入模型適應到各種藝術風格的領域。總體而言，此方法顯著優於傳統方法，例如修復。最後，我們提出一個資料集 SubjectPlop，以利於評估和未來進展。專案頁面：https://magicinsert.github.io/</paragraph>", "author": "Nataniel Ruiz et.al.", "authors": "Nataniel Ruiz, Yuanzhen Li, Neal Wadhwa, Yael Pritch, Michael Rubinstein, David E. Jacobs, Shlomi Fruchter", "id": "2407.02489v1", "paper_url": "http://arxiv.org/abs/2407.02489v1", "repo": "null"}}