{"2405.05908": {"publish_time": "2024-05-09", "title": "Diag2Diag: Multi modal super resolution for physics discovery with application to fusion", "paper_summary": "This paper introduces a groundbreaking multi-modal neural network model\ndesigned for resolution enhancement, which innovatively leverages\ninter-diagnostic correlations within a system. Traditional approaches have\nprimarily focused on uni-modal enhancement strategies, such as pixel-based\nimage enhancement or heuristic signal interpolation. In contrast, our model\nemploys a novel methodology by harnessing the diagnostic relationships within\nthe physics of fusion plasma. Initially, we establish the correlation among\ndiagnostics within the tokamak. Subsequently, we utilize these correlations to\nsubstantially enhance the temporal resolution of the Thomson Scattering\ndiagnostic, which assesses plasma density and temperature. By increasing its\nresolution from conventional 200Hz to 500kHz, we facilitate a new level of\ninsight into plasma behavior, previously attainable only through\ncomputationally intensive simulations. This enhancement goes beyond simple\ninterpolation, offering novel perspectives on the underlying physical phenomena\ngoverning plasma dynamics.", "paper_summary_zh": "本文介紹了一種創新的多模態神經網路模型，專為解析度提升而設計，它創新地利用系統內的診斷間相關性。傳統方法主要集中於單模態增強策略，例如基於像素的影像增強或啟發式訊號插值。相反地，我們的模型採用一種新的方法，利用融合電漿物理學中的診斷關係。最初，我們在托卡馬克內建立診斷之間的相關性。隨後，我們利用這些相關性來大幅提升湯姆森散射診斷的時間解析度，該診斷評估電漿密度和溫度。透過將其解析度從傳統的 200Hz 提升至 500kHz，我們促成對電漿行為的新層次見解，以前只能透過計算密集型模擬才能達成。這種增強超越了單純的插值，提供了對支配電漿動態的基礎物理現象的新觀點。", "author": "Azarakhsh Jalalvand et.al.", "authors": "Azarakhsh Jalalvand, Max Curie, SangKyeun Kim, Peter Steiner, Jaemin Seo, Qiming Hu, Andrew Oakleigh Nelson, Egemen Kolemen", "id": "2405.05908v1", "paper_url": "http://arxiv.org/abs/2405.05908v1", "repo": "null"}}