{"2412.13862": {"publish_time": "2024-12-18", "title": "Energy-Based Preference Model Offers Better Offline Alignment than the Bradley-Terry Preference Model", "paper_summary": "Since the debut of DPO, it has been shown that aligning a target LLM with\nhuman preferences via the KL-constrained RLHF loss is mathematically equivalent\nto a special kind of reward modeling task. Concretely, the task requires: 1)\nusing the target LLM to parameterize the reward model, and 2) tuning the reward\nmodel so that it has a 1:1 linear relationship with the true reward. However,\nwe identify a significant issue: the DPO loss might have multiple minimizers,\nof which only one satisfies the required linearity condition. The problem\narises from a well-known issue of the underlying Bradley-Terry preference\nmodel: it does not always have a unique maximum likelihood estimator (MLE).\nConsequently,the minimizer of the RLHF loss might be unattainable because it is\nmerely one among many minimizers of the DPO loss. As a better alternative, we\npropose an energy-based model (EBM) that always has a unique MLE, inherently\nsatisfying the linearity requirement. To approximate the MLE in practice, we\npropose a contrastive loss named Energy Preference Alignment (EPA), wherein\neach positive sample is contrasted against one or more strong negatives as well\nas many free weak negatives. Theoretical properties of our EBM enable the\napproximation error of EPA to almost surely vanish when a sufficient number of\nnegatives are used. Empirically, we demonstrate that EPA consistently delivers\nbetter performance on open benchmarks compared to DPO, thereby showing the\nsuperiority of our EBM.", "paper_summary_zh": "自 DPO 問世以來，已經證明透過 KL 約束 RLHF 損失將目標 LLM 與人類偏好對齊在數學上等同於一種特殊類型的獎勵建模任務。具體而言，該任務需要：1) 使用目標 LLM 將獎勵模型參數化，以及 2) 調整獎勵模型，使其與真實獎勵具有 1:1 的線性關係。然而，我們發現一個重要問題：DPO 損失可能有多個最小化器，其中只有一個滿足所需的線性條件。這個問題源自於基礎 Bradley-Terry 偏好模型的一個眾所周知的問題：它並不總是具有唯一的最大似然估計器 (MLE)。因此，RLHF 損失的最小化器可能是無法達成的，因為它只是 DPO 損失的許多最小化器之一。作為一個更好的替代方案，我們提出了一個始終具有唯一 MLE 的基於能量的模型 (EBM)，它固有地滿足線性要求。為了在實務中估計 MLE，我們提出了一個名為能量偏好對齊 (EPA) 的對比損失，其中每個正樣本都與一個或多個強負樣本以及許多自由弱負樣本進行對比。我們的 EBM 的理論性質使 EPA 的近似誤差幾乎可以在使用足夠數量的負樣本時消失。根據經驗，我們證明 EPA 在開放基準測試中始終提供比 DPO 更好的效能，從而顯示出我們的 EBM 的優越性。", "author": "Yuzhong Hong et.al.", "authors": "Yuzhong Hong, Hanshan Zhang, Junwei Bao, Hongfei Jiang, Yang Song", "id": "2412.13862v1", "paper_url": "http://arxiv.org/abs/2412.13862v1", "repo": "null"}}