{"2408.09626": {"publish_time": "2024-08-19", "title": "On the Foundations of Conflict-Driven Solving for Hybrid MKNF Knowledge Bases", "paper_summary": "Hybrid MKNF Knowledge Bases (HMKNF-KBs) constitute a formalism for tightly\nintegrated reasoning over closed-world rules and open-world ontologies. This\napproach allows for accurate modeling of real-world systems, which often rely\non both categorical and normative reasoning. Conflict-driven solving is the\nleading approach for computationally hard problems, such as satisfiability\n(SAT) and answer set programming (ASP), in which MKNF is rooted. This paper\ninvestigates the theoretical underpinnings required for a conflict-driven\nsolver of HMKNF-KBs. The approach defines a set of completion and loop\nformulas, whose satisfaction characterizes MKNF models. This forms the basis\nfor a set of nogoods, which in turn can be used as the backbone for a\nconflict-driven solver.", "paper_summary_zh": "混合 MKNF 知識庫 (HMKNF-KBs) 構成了一種形式主義，用於對封閉世界規則和開放世界本体進行緊密整合的推理。這種方法允許對現實世界系統進行準確建模，這些系統通常依賴於範疇推理和規範推理。衝突驅動求解是計算困難問題的主要方法，例如可滿足性 (SAT) 和答案集程式設計 (ASP)，MKNF 根植於其中。本文探討了 HMKNF-KB 的衝突驅動求解器所需的理論基礎。該方法定義了一組完備性和迴圈公式，其滿足度表徵了 MKNF 模型。這構成了禁止集的基礎，而禁止集反過來可以用作衝突驅動求解器的骨幹。", "author": "Riley Kinahan et.al.", "authors": "Riley Kinahan, Spencer Killen, Kevin Wan, Jia-Huai You", "id": "2408.09626v1", "paper_url": "http://arxiv.org/abs/2408.09626v1", "repo": "null"}}