{"2409.18961": {"publish_time": "2024-09-27", "title": "ProMerge: Prompt and Merge for Unsupervised Instance Segmentation", "paper_summary": "Unsupervised instance segmentation aims to segment distinct object instances\nin an image without relying on human-labeled data. This field has recently seen\nsignificant advancements, partly due to the strong local correspondences\nafforded by rich visual feature representations from self-supervised models\n(e.g., DINO). Recent state-of-the-art approaches use self-supervised features\nto represent images as graphs and solve a generalized eigenvalue system (i.e.,\nnormalized-cut) to generate foreground masks. While effective, this strategy is\nlimited by its attendant computational demands, leading to slow inference\nspeeds. In this paper, we propose Prompt and Merge (ProMerge), which leverages\nself-supervised visual features to obtain initial groupings of patches and\napplies a strategic merging to these segments, aided by a sophisticated\nbackground-based mask pruning technique. ProMerge not only yields competitive\nresults but also offers a significant reduction in inference time compared to\nstate-of-the-art normalized-cut-based approaches. Furthermore, when training an\nobject detector using our mask predictions as pseudo-labels, the resulting\ndetector surpasses the current leading unsupervised model on various\nchallenging instance segmentation benchmarks.", "paper_summary_zh": "無監督實例分割旨在區分影像中不同的物件實例，而無需依賴人工標記的資料。此領域最近有了顯著的進展，部分原因是自監督模型（例如 DINO）提供的豐富視覺特徵表示所具有的強大局部對應關係。最近的最新方法使用自監督特徵將影像表示為圖形，並解決廣義特徵值系統（即正規化切割）以產生前景遮罩。儘管有效，但此策略受到其伴隨的運算需求限制，導致推論速度變慢。在本文中，我們提出提示與合併 (ProMerge)，它利用自監督視覺特徵來取得區塊的初始群組，並對這些區塊應用策略性合併，並借助一種精密的基於背景的遮罩剪枝技術。ProMerge 不僅產生具有競爭力的結果，而且與基於正規化切割的最新方法相比，推論時間也顯著減少。此外，在使用我們的遮罩預測作為偽標籤訓練物件偵測器時，所產生的偵測器在各種具有挑戰性的實例分割基準上超越了目前的領先無監督模型。", "author": "Dylan Li et.al.", "authors": "Dylan Li, Gyungin Shin", "id": "2409.18961v1", "paper_url": "http://arxiv.org/abs/2409.18961v1", "repo": "null"}}