{"2410.02507": {"publish_time": "2024-10-03", "title": "Can Large Language Models Grasp Legal Theories? Enhance Legal Reasoning with Insights from Multi-Agent Collaboration", "paper_summary": "Large Language Models (LLMs) could struggle to fully understand legal\ntheories and perform complex legal reasoning tasks. In this study, we introduce\na challenging task (confusing charge prediction) to better evaluate LLMs'\nunderstanding of legal theories and reasoning capabilities. We also propose a\nnovel framework: Multi-Agent framework for improving complex Legal Reasoning\ncapability (MALR). MALR employs non-parametric learning, encouraging LLMs to\nautomatically decompose complex legal tasks and mimic human learning process to\nextract insights from legal rules, helping LLMs better understand legal\ntheories and enhance their legal reasoning abilities. Extensive experiments on\nmultiple real-world datasets demonstrate that the proposed framework\neffectively addresses complex reasoning issues in practical scenarios, paving\nthe way for more reliable applications in the legal domain.", "paper_summary_zh": "大型語言模型 (LLM) 可能難以完全理解法律理論並執行複雜的法律推理任務。在本研究中，我們引入了一項具有挑戰性的任務（混淆指控預測），以更好地評估 LLM 對法律理論和推理能力的理解。我們還提出了一個新的框架：用於改進複雜法律推理能力的多代理框架 (MALR)。MALR 採用非參數學習，鼓勵 LLM 自動分解複雜的法律任務並模擬人類學習過程以從法律規則中提取見解，幫助 LLM 更深入地理解法律理論並增強其法律推理能力。在多個真實世界數據集上進行的廣泛實驗表明，所提出的框架有效地解決了實際場景中的複雜推理問題，為在法律領域中更可靠的應用鋪平了道路。", "author": "Weikang Yuan et.al.", "authors": "Weikang Yuan, Junjie Cao, Zhuoren Jiang, Yangyang Kang, Jun Lin, Kaisong Song, tianqianjin lin, Pengwei Yan, Changlong Sun, Xiaozhong Liu", "id": "2410.02507v1", "paper_url": "http://arxiv.org/abs/2410.02507v1", "repo": "https://github.com/yuanwk99/malr"}}