{"2504.18353": {"publish_time": "2025-04-25", "title": "Testing Individual Fairness in Graph Neural Networks", "paper_summary": "The biases in artificial intelligence (AI) models can lead to automated\ndecision-making processes that discriminate against groups and/or individuals\nbased on sensitive properties such as gender and race. While there are many\nstudies on diagnosing and mitigating biases in various AI models, there is\nlittle research on individual fairness in Graph Neural Networks (GNNs). Unlike\ntraditional models, which treat data features independently and overlook their\ninter-relationships, GNNs are designed to capture graph-based structure where\nnodes are interconnected. This relational approach enables GNNs to model\ncomplex dependencies, but it also means that biases can propagate through these\nconnections, complicating the detection and mitigation of individual fairness\nviolations. This PhD project aims to develop a testing framework to assess and\nensure individual fairness in GNNs. It first systematically reviews the\nliterature on individual fairness, categorizing existing approaches to define,\nmeasure, test, and mitigate model biases, creating a taxonomy of individual\nfairness. Next, the project will develop a framework for testing and ensuring\nfairness in GNNs by adapting and extending current fairness testing and\nmitigation techniques. The framework will be evaluated through industrial case\nstudies, focusing on graph-based large language models.", "paper_summary_zh": "人工智慧 (AI) 模型中的偏差可能導致自動決策過程，基於性別和種族等敏感屬性歧視群體和/或個人。雖然有許多關於診斷和減輕各種 AI 模型偏差的研究，但關於圖神經網路 (GNN) 中個體公平性的研究卻很少。與獨立處理數據特徵並忽略其相互關係的傳統模型不同，GNN 旨在捕獲節點相互連接的基於圖的結構。這種關係方法使 GNN 能夠對複雜的依賴關係進行建模，但這也意味著偏差可以通過這些連接傳播，從而使檢測和減輕個體公平性違規行為變得更加複雜。這個博士研究項目旨在開發一個測試框架來評估和確保 GNN 中的個體公平性。它首先系統地回顧了關於個體公平性的文獻，將現有的定義、測量、測試和減輕模型偏差的方法進行分類，創建了一個個體公平性分類法。接下來，該項目將通過調整和擴展現有的公平性測試和減輕技術來開發一個測試和確保 GNN 公平性的框架。該框架將通過產業案例研究進行評估，重點關注基於圖的大型語言模型。\n", "author": "Roya Nasiri et.al.", "authors": "Roya Nasiri", "id": "2504.18353v1", "paper_url": "http://arxiv.org/abs/2504.18353v1", "repo": "null"}}