{"2406.14971": {"publish_time": "2024-06-21", "title": "Domain Adaptation of Llama3-70B-Instruct through Continual Pre-Training and Model Merging: A Comprehensive Evaluation", "paper_summary": "We conducted extensive experiments on domain adaptation of the\nMeta-Llama-3-70B-Instruct model on SEC data, exploring its performance on both\ngeneral and domain-specific benchmarks. Our focus included continual\npre-training (CPT) and model merging, aiming to enhance the model's\ndomain-specific capabilities while mitigating catastrophic forgetting. Through\nthis study, we evaluated the impact of integrating financial regulatory data\ninto a robust language model and examined the effectiveness of our model\nmerging techniques in preserving and improving the model's instructive\nabilities. The model is accessible at hugging face:\nhttps://huggingface.co/arcee-ai/Llama-3-SEC-Base, arcee-ai/Llama-3-SEC-Base.\nThis is an intermediate checkpoint of our final model, which has seen 20B\ntokens so far. The full model is still in the process of training. This is a\npreprint technical report with thorough evaluations to understand the entire\nprocess.", "paper_summary_zh": "我們對 Meta-Llama-3-70B-Instruct 模型在 SEC 數據上的領域適應進行了廣泛的實驗，探討了它在通用和特定領域基準上的效能。我們的重點包括持續預訓練 (CPT) 和模型合併，目的是增強模型的特定領域能力，同時減輕災難性遺忘。透過這項研究，我們評估了將金融監管數據整合到強大的語言模型中的影響，並檢視了我們的模型合併技術在保留和改善模型指導能力方面的有效性。模型可以在 hugging face 取得：\nhttps://huggingface.co/arcee-ai/Llama-3-SEC-Base, arcee-ai/Llama-3-SEC-Base。\n這是我們最終模型的其中一個中間檢查點，到目前為止已經看到 20B 個代幣。完整模型仍在訓練過程中。這是一份預印本技術報告，包含深入的評估，以了解整個過程。", "author": "Shamane Siriwardhana et.al.", "authors": "Shamane Siriwardhana, Mark McQuade, Thomas Gauthier, Lucas Atkins, Fernando Fernandes Neto, Luke Meyers, Anneketh Vij, Tyler Odenthal, Charles Goddard, Mary MacCarthy, Jacob Solawetz", "id": "2406.14971v1", "paper_url": "http://arxiv.org/abs/2406.14971v1", "repo": "null"}}