{"2410.03529": {"publish_time": "2024-10-04", "title": "No Need to Talk: Asynchronous Mixture of Language Models", "paper_summary": "We introduce SmallTalk LM, an innovative method for training a mixture of\nlanguage models in an almost asynchronous manner. Each model of the mixture\nspecializes in distinct parts of the data distribution, without the need of\nhigh-bandwidth communication between the nodes training each model. At\ninference, a lightweight router directs a given sequence to a single expert,\naccording to a short prefix. This inference scheme naturally uses a fraction of\nthe parameters from the overall mixture model. Our experiments on language\nmodeling demonstrate tha SmallTalk LM achieves significantly lower perplexity\nthan dense model baselines for the same total training FLOPs and an almost\nidentical inference cost. Finally, in our downstream evaluations we outperform\nthe dense baseline on $75\\%$ of the tasks.", "paper_summary_zh": "我們介紹 SmallTalk LM，一種創新的方法，用於以幾乎非同步的方式訓練混合語言模型。混合中的每個模型專注於資料分佈的不同部分，無需在訓練每個模型的節點之間進行高頻寬通訊。在推論時，輕量級路由器根據簡短的前綴將給定的序列導向單個專家。這種推論方案自然會使用來自整體混合模型的一小部分參數。我們在語言建模上的實驗表明，SmallTalk LM 的困惑度顯著低於相同總訓練 FLOP 的密集模型基線，並且推理成本幾乎相同。最後，在我們的下游評估中，我們在 $75\\%$ 的任務上優於密集基線。", "author": "Anastasiia Filippova et.al.", "authors": "Anastasiia Filippova, Angelos Katharopoulos, David Grangier, Ronan Collobert", "id": "2410.03529v1", "paper_url": "http://arxiv.org/abs/2410.03529v1", "repo": "null"}}