{"2408.10608": {"publish_time": "2024-08-20", "title": "Promoting Equality in Large Language Models: Identifying and Mitigating the Implicit Bias based on Bayesian Theory", "paper_summary": "Large language models (LLMs) are trained on extensive text corpora, which\ninevitably include biased information. Although techniques such as Affective\nAlignment can mitigate some negative impacts of these biases, existing\nprompt-based attack methods can still extract these biases from the model's\nweights. Moreover, these biases frequently appear subtly when LLMs are prompted\nto perform identical tasks across different demographic groups, thereby\ncamouflaging their presence. To address this issue, we have formally defined\nthe implicit bias problem and developed an innovative framework for bias\nremoval based on Bayesian theory, Bayesian-Theory based Bias Removal (BTBR).\nBTBR employs likelihood ratio screening to pinpoint data entries within\npublicly accessible biased datasets that represent biases inadvertently\nincorporated during the LLM training phase. It then automatically constructs\nrelevant knowledge triples and expunges bias information from LLMs using model\nediting techniques. Through extensive experimentation, we have confirmed the\npresence of the implicit bias problem in LLMs and demonstrated the\neffectiveness of our BTBR approach.", "paper_summary_zh": "大型語言模型 (LLM) 接受過大量文本語料庫的訓練，其中不可避免地包含有偏差的資訊。雖然情感對齊等技術可以減輕這些偏差的一些負面影響，但現有的基於提示的攻擊方法仍然可以從模型的權重中提取這些偏差。此外，當提示 LLM 對不同人口群體執行相同的任務時，這些偏差經常會以微妙的方式出現，從而掩蓋它們的存在。為了解決這個問題，我們正式定義了隱含偏差問題，並基於貝葉斯理論開發了一個創新的偏差消除框架，即基於貝葉斯理論的偏差消除 (BTBR)。BTBR 採用似然比篩選來精確定位 LLM 訓練階段中無意中納入偏差的公開可訪問偏差資料集中的資料條目。然後，它自動構建相關知識三元組，並使用模型編輯技術從 LLM 中刪除偏差資訊。通過廣泛的實驗，我們確認了 LLM 中隱含偏差問題的存在，並證明了我們的 BTBR 方法的有效性。", "author": "Yongxin Deng et.al.", "authors": "Yongxin Deng, Xihe Qiu, Xiaoyu Tan, Jing Pan, Chen Jue, Zhijun Fang, Yinghui Xu, Wei Chu, Yuan Qi", "id": "2408.10608v1", "paper_url": "http://arxiv.org/abs/2408.10608v1", "repo": "null"}}