{"2411.08868": {"publish_time": "2024-11-13", "title": "CamemBERT 2.0: A Smarter French Language Model Aged to Perfection", "paper_summary": "French language models, such as CamemBERT, have been widely adopted across\nindustries for natural language processing (NLP) tasks, with models like\nCamemBERT seeing over 4 million downloads per month. However, these models face\nchallenges due to temporal concept drift, where outdated training data leads to\na decline in performance, especially when encountering new topics and\nterminology. This issue emphasizes the need for updated models that reflect\ncurrent linguistic trends. In this paper, we introduce two new versions of the\nCamemBERT base model-CamemBERTav2 and CamemBERTv2-designed to address these\nchallenges. CamemBERTav2 is based on the DeBERTaV3 architecture and makes use\nof the Replaced Token Detection (RTD) objective for better contextual\nunderstanding, while CamemBERTv2 is built on RoBERTa, which uses the Masked\nLanguage Modeling (MLM) objective. Both models are trained on a significantly\nlarger and more recent dataset with longer context length and an updated\ntokenizer that enhances tokenization performance for French. We evaluate the\nperformance of these models on both general-domain NLP tasks and\ndomain-specific applications, such as medical field tasks, demonstrating their\nversatility and effectiveness across a range of use cases. Our results show\nthat these updated models vastly outperform their predecessors, making them\nvaluable tools for modern NLP systems. All our new models, as well as\nintermediate checkpoints, are made openly available on Huggingface.", "paper_summary_zh": "法語語言模型，例如 CamemBERT，已在各產業廣泛採用於自然語言處理 (NLP) 任務，而 CamemBERT 等模型每月下載量超過 400 萬次。然而，這些模型會因時間概念漂移而面臨挑戰，過時的訓練資料會導致效能下降，特別是在遇到新主題和術語時。此問題強調了需要更新的模型來反映當前的語言趨勢。在本文中，我們介紹了 CamemBERT 基礎模型的兩個新版本，CamemBERTav2 和 CamemBERTv2，旨在解決這些挑戰。CamemBERTav2 基於 DeBERTaV3 架構，並利用替換代幣偵測 (RTD) 目標，以獲得更好的脈絡理解，而 CamemBERTv2 則建構在 RoBERTa 上，使用遮蔽語言模型 (MLM) 目標。這兩個模型都訓練於一個顯著更大且更新的資料集，具有較長的脈絡長度和一個更新的 tokenizer，可增強法語的 tokenization 效能。我們評估了這些模型在一般領域 NLP 任務和特定領域應用程式（例如醫學領域任務）上的效能，展示了它們在各種使用案例中的多功能性和有效性。我們的結果顯示，這些更新的模型大幅優於它們的前身，使其成為現代 NLP 系統的寶貴工具。我們所有的新模型，以及中間檢查點，都公開在 Huggingface 上。", "author": "Wissam Antoun et.al.", "authors": "Wissam Antoun, Francis Kulumba, Rian Touchent, Éric de la Clergerie, Benoît Sagot, Djamé Seddah", "id": "2411.08868v1", "paper_url": "http://arxiv.org/abs/2411.08868v1", "repo": "null"}}