{"2303.04731": {"publish_time": "2023-03-08", "title": "Towards Trust of Explainable AI in Thyroid Nodule Diagnosis", "paper_summary": "The ability to explain the prediction of deep learning models to end-users is\nan important feature to leverage the power of artificial intelligence (AI) for\nthe medical decision-making process, which is usually considered\nnon-transparent and challenging to comprehend. In this paper, we apply\nstate-of-the-art eXplainable artificial intelligence (XAI) methods to explain\nthe prediction of the black-box AI models in the thyroid nodule diagnosis\napplication. We propose new statistic-based XAI methods, namely Kernel Density\nEstimation and Density map, to explain the case of no nodule detected. XAI\nmethods' performances are considered under a qualitative and quantitative\ncomparison as feedback to improve the data quality and the model performance.\nFinally, we survey to assess doctors' and patients' trust in XAI explanations\nof the model's decisions on thyroid nodule images.", "paper_summary_zh": "解釋深度學習模型預測結果的能力對最終使用者而言是一項重要功能，可利用人工智慧 (AI) 的力量進行醫療決策流程，這通常被認為是不透明且難以理解的。在本文中，我們運用最先進的可解釋人工智慧 (XAI) 方法來解釋黑盒 AI 模型在甲狀腺結節診斷應用中的預測結果。我們提出新的基於統計的 XAI 方法，即核密度估計和密度圖，來解釋未檢測到結節的情況。XAI 方法的效能會在定性和定量比較下被視為改善資料品質和模型效能的回饋。最後，我們進行調查以評估醫師和患者對 XAI 對模型在甲狀腺結節影像中決策的解釋的信任度。", "author": "Truong Thanh Hung Nguyen et.al.", "authors": "Truong Thanh Hung Nguyen, Van Binh Truong, Vo Thanh Khang Nguyen, Quoc Hung Cao, Quoc Khanh Nguyen", "id": "2303.04731v1", "paper_url": "http://arxiv.org/abs/2303.04731v1", "repo": "https://github.com/hungntt/xai_thyroid"}}