{"2406.14938": {"publish_time": "2024-06-21", "title": "Towards Retrieval Augmented Generation over Large Video Libraries", "paper_summary": "Video content creators need efficient tools to repurpose content, a task that\noften requires complex manual or automated searches. Crafting a new video from\nlarge video libraries remains a challenge. In this paper we introduce the task\nof Video Library Question Answering (VLQA) through an interoperable\narchitecture that applies Retrieval Augmented Generation (RAG) to video\nlibraries. We propose a system that uses large language models (LLMs) to\ngenerate search queries, retrieving relevant video moments indexed by speech\nand visual metadata. An answer generation module then integrates user queries\nwith this metadata to produce responses with specific video timestamps. This\napproach shows promise in multimedia content retrieval, and AI-assisted video\ncontent creation.", "paper_summary_zh": "影片內容創作者需要有效率的工具來重新利用內容，這項任務通常需要複雜的人工或自動化搜尋。從大型影片庫中製作新的影片仍然是一項挑戰。在本文中，我們透過一個可互操作的架構介紹影片庫問答 (VLQA) 任務，該架構將檢索擴充產生 (RAG) 應用於影片庫。我們提出一個使用大型語言模型 (LLM) 來產生搜尋查詢的系統，擷取由語音和視覺元資料索引的相關影片片段。然後，一個答案產生模組將使用者查詢與這些元資料整合，以產生具有特定影片時間戳記的回應。此方法在多媒體內容擷取和 AI 輔助影片內容創作中顯示出前景。", "author": "Yannis Tevissen et.al.", "authors": "Yannis Tevissen, Khalil Guetari, Frédéric Petitpont", "id": "2406.14938v1", "paper_url": "http://arxiv.org/abs/2406.14938v1", "repo": "null"}}