{"2405.09857": {"publish_time": "2024-05-16", "title": "IGOT: Information Gain Optimized Tokenizer on Domain Adaptive Pretraining", "paper_summary": "Pretrained Large Language Models (LLM) such as ChatGPT, Claude, etc. have\ndemonstrated strong capabilities in various fields of natural language\ngeneration. However, there are still many problems when using LLM in\nspecialized domain-specific fields. When using generative AI to process\ndownstream tasks, a common approach is to add new knowledge (e.g., private\ndomain knowledge, cutting-edge information) to a pretrained model through\ncontinued training or fine-tuning. However, whether there is a universal\nparadigm for domain adaptation training is still an open question. In this\narticle, we proposed Information Gain Optimized Tokenizer (IGOT), which\nanalyzes the special token set of downstream tasks, constructs a new subset\nusing heuristic function $\\phi$ with the special token and its information\ngain, to build new domain-specific tokenizer, and continues pretraining on the\ndownstream task data. We explored the many positive effects of this method's\ncustomized tokenizer on domain-adaptive pretraining and verified this method\ncan perform better than the ordinary method of just collecting data and\nfine-tuning. Based on our experiment, the continued pretraining process of IGOT\nwith LLaMA-7B achieved 11.9\\% token saving, 12.2\\% training time saving, and\n5.8\\% maximum GPU VRAM usage saving, combined with the T5 model, we can even\nreach a 31.5\\% of training time saving, making porting general generative AI to\nspecific domains more effective than before. In domain-specific tasks,\nsupervised $IGOT_\\tau$ shows great performance on reducing both the convergence\nradius and convergence point during keep pretraining.", "paper_summary_zh": "<paragraph>大型預訓練語言模型（LLM），例如 ChatGPT、Claude 等，已在自然語言生成的各個領域展現出強大的能力。然而，在特定領域中使用 LLM 時，仍存在許多問題。使用生成式 AI 處理下游任務時，一個常見的方法是透過持續訓練或微調，將新知識（例如私人領域知識、前沿資訊）新增到預訓練模型中。然而，是否有一個通用範例適用於領域適應訓練，仍是一個開放性的問題。在本文中，我們提出了資訊增益最佳化標記器 (IGOT)，它分析下游任務的特殊標記集，使用啟發式函數 $\\phi$ 和特殊標記及其資訊增益建構一個新的子集，以建構新的特定領域標記器，並繼續在下游任務資料上進行預訓練。我們探討了這種方法的客製化標記器對領域適應預訓練的許多正面影響，並驗證此方法的表現優於僅收集資料和微調的傳統方法。根據我們的實驗，IGOT 與 LLaMA-7B 的持續預訓練過程節省了 11.9% 的標記、12.2% 的訓練時間，以及 5.8% 的最大 GPU VRAM 使用量，結合 T5 模型，我們甚至可以節省 31.5% 的訓練時間，使將通用生成式 AI 移植到特定領域比以前更有效。在特定領域任務中，監督式 $IGOT_\\tau$ 在持續預訓練期間展現出極佳的效能，可減少收斂半徑和收斂點。</paragraph>", "author": "Dawei Feng et.al.", "authors": "Dawei Feng, Yihai Zhang, Zhixuan Xu", "id": "2405.09857v1", "paper_url": "http://arxiv.org/abs/2405.09857v1", "repo": "null"}}