{"2405.07590": {"publish_time": "2024-05-13", "title": "Evaluating the Explainable AI Method Grad-CAM for Breath Classification on Newborn Time Series Data", "paper_summary": "With the digitalization of health care systems, artificial intelligence\nbecomes more present in medicine. Especially machine learning shows great\npotential for complex tasks such as time series classification, usually at the\ncost of transparency and comprehensibility. This leads to a lack of trust by\nhumans and thus hinders its active usage. Explainable artificial intelligence\ntries to close this gap by providing insight into the decision-making process,\nthe actual usefulness of its different methods is however unclear. This paper\nproposes a user study based evaluation of the explanation method Grad-CAM with\napplication to a neural network for the classification of breaths in time\nseries neonatal ventilation data. We present the perceived usefulness of the\nexplainability method by different stakeholders, exposing the difficulty to\nachieve actual transparency and the wish for more in-depth explanations by many\nof the participants.", "paper_summary_zh": "隨著醫療保健系統的數位化，人工智慧在醫學領域中變得更加普及。特別是機器學習在時間序列分類等複雜任務中展現出極大的潛力，但通常是以透明度和可理解性為代價。這導致人類缺乏信任，從而阻礙了其積極使用。可解釋的人工智慧試圖通過提供對決策過程的洞察來彌補這一差距，但其不同方法的實際效用尚不清楚。本文提出了一個基於使用者研究的評估，其中包含了 Grad-CAM 解釋方法，並將其應用於神經網路以分類時間序列新生兒呼吸數據中的呼吸。我們展示了不同利益相關者對可解釋性方法的感知效用，揭示了實現實際透明度的難度，以及許多參與者希望獲得更深入的解釋。", "author": "Camelia Oprea et.al.", "authors": "Camelia Oprea, Mike Grüne, Mateusz Buglowski, Lena Olivier, Thorsten Orlikowsky, Stefan Kowalewski, Mark Schoberer, André Stollenwerk", "id": "2405.07590v1", "paper_url": "http://arxiv.org/abs/2405.07590v1", "repo": "null"}}