{"2406.02366": {"publish_time": "2024-06-04", "title": "Finding NeMo: Localizing Neurons Responsible For Memorization in Diffusion Models", "paper_summary": "Diffusion models (DMs) produce very detailed and high-quality images. Their\npower results from extensive training on large amounts of data, usually scraped\nfrom the internet without proper attribution or consent from content creators.\nUnfortunately, this practice raises privacy and intellectual property concerns,\nas DMs can memorize and later reproduce their potentially sensitive or\ncopyrighted training images at inference time. Prior efforts prevent this issue\nby either changing the input to the diffusion process, thereby preventing the\nDM from generating memorized samples during inference, or removing the\nmemorized data from training altogether. While those are viable solutions when\nthe DM is developed and deployed in a secure and constantly monitored\nenvironment, they hold the risk of adversaries circumventing the safeguards and\nare not effective when the DM itself is publicly released. To solve the\nproblem, we introduce NeMo, the first method to localize memorization of\nindividual data samples down to the level of neurons in DMs' cross-attention\nlayers. Through our experiments, we make the intriguing finding that in many\ncases, single neurons are responsible for memorizing particular training\nsamples. By deactivating these memorization neurons, we can avoid the\nreplication of training data at inference time, increase the diversity in the\ngenerated outputs, and mitigate the leakage of private and copyrighted data. In\nthis way, our NeMo contributes to a more responsible deployment of DMs.", "paper_summary_zh": "擴散模型 (DM) 可產生非常詳細且高品質的影像。其效能源自於大量資料的廣泛訓練，通常未經適當的歸屬或內容創作者的同意，便從網路上擷取。不幸的是，此作法引發了隱私和智慧財產權的疑慮，因為 DM 可以記憶並在推論時重製其潛在敏感或受版權保護的訓練影像。先前的努力透過改變擴散程序的輸入來防止此問題，從而防止 DM 在推論期間產生記憶的樣本，或從訓練中完全移除記憶的資料。儘管這些在 DM 於安全且持續監控的環境中開發和部署時是可行的解決方案，但它們具有對手規避防護措施的風險，且在 DM 本身公開發布時無效。為了解決此問題，我們引入了 NeMo，這是第一個將個別資料樣本的記憶定位到 DM 交叉注意力層中神經元層級的方法。透過我們的實驗，我們得出了有趣的發現，在許多情況下，單一神經元負責記憶特定訓練樣本。透過停用這些記憶神經元，我們可以避免在推論時複製訓練資料，增加產生輸出的多樣性，並減輕私人和受版權保護資料的洩漏。透過這種方式，我們的 NeMo 有助於更負責任地部署 DM。", "author": "Dominik Hintersdorf et.al.", "authors": "Dominik Hintersdorf, Lukas Struppek, Kristian Kersting, Adam Dziedzic, Franziska Boenisch", "id": "2406.02366v1", "paper_url": "http://arxiv.org/abs/2406.02366v1", "repo": "https://github.com/ml-research/localizing_memorization_in_diffusion_models"}}