{"2501.14334": {"publish_time": "2025-01-24", "title": "Exploring the sustainable scaling of AI dilemma: A projective study of corporations' AI environmental impacts", "paper_summary": "The rapid growth of artificial intelligence (AI), particularly Large Language\nModels (LLMs), has raised concerns regarding its global environmental impact\nthat extends beyond greenhouse gas emissions to include consideration of\nhardware fabrication and end-of-life processes. The opacity from major\nproviders hinders companies' abilities to evaluate their AI-related\nenvironmental impacts and achieve net-zero targets.In this paper, we propose a\nmethodology to estimate the environmental impact of a company's AI portfolio,\nproviding actionable insights without necessitating extensive AI and Life-Cycle\nAssessment (LCA) expertise. Results confirm that large generative AI models\nconsume up to 4600x more energy than traditional models. Our modelling\napproach, which accounts for increased AI usage, hardware computing efficiency,\nand changes in electricity mix in line with IPCC scenarios, forecasts AI\nelectricity use up to 2030. Under a high adoption scenario, driven by\nwidespread Generative AI and agents adoption associated to increasingly complex\nmodels and frameworks, AI electricity use is projected to rise by a factor of\n24.4.Mitigating the environmental impact of Generative AI by 2030 requires\ncoordinated efforts across the AI value chain. Isolated measures in hardware\nefficiency, model efficiency, or grid improvements alone are insufficient. We\nadvocate for standardized environmental assessment frameworks, greater\ntransparency from the all actors of the value chain and the introduction of a\n\"Return on Environment\" metric to align AI development with net-zero goals.", "paper_summary_zh": "人工智慧（AI），特別是大型語言模型（LLM）的快速發展，引發了對其全球環境影響的擔憂，其影響範圍不僅限於溫室氣體排放，還包括對硬體製造和報廢流程的考量。主要供應商的不透明性阻礙了公司評估其 AI 相關環境影響並實現淨零目標的能力。在本文中，我們提出了一種方法，用於估計公司 AI 組合的環境影響，提供可行的見解，而無需大量的 AI 和生命週期評估 (LCA) 專業知識。結果證實，大型生成式 AI 模型消耗的能源比傳統模型多達 4600 倍。我們的建模方法考慮了 AI 使用量的增加、硬體運算效率以及與 IPCC 情境一致的電力結構變化，預測了 AI 的電力使用量至 2030 年。在高採用率情境下，受廣泛採用的生成式 AI 和代理人採用所驅動，這些代理人與日益複雜的模型和架構相關，預計 AI 電力使用量將增加 24.4 倍。到 2030 年減輕生成式 AI 的環境影響需要在整個 AI 價值鏈中協調努力。單靠硬體效率、模型效率或電網改善等孤立措施是不夠的。我們提倡標準化的環境評估框架、價值鏈中所有參與者的更大透明度，以及引入「環境投資報酬率」指標，以使 AI 開發與淨零目標保持一致。", "author": "Clément Desroches et.al.", "authors": "Clément Desroches, Martin Chauvin, Louis Ladan, Caroline Vateau, Simon Gosset, Philippe Cordier", "id": "2501.14334v1", "paper_url": "http://arxiv.org/abs/2501.14334v1", "repo": "null"}}