{"2406.10197": {"publish_time": "2024-06-14", "title": "Crafting Parts for Expressive Object Composition", "paper_summary": "Text-to-image generation from large generative models like Stable Diffusion,\nDALLE-2, etc., have become a common base for various tasks due to their\nsuperior quality and extensive knowledge bases. As image composition and\ngeneration are creative processes the artists need control over various parts\nof the images being generated. We find that just adding details about parts in\nthe base text prompt either leads to an entirely different image (e.g.,\nmissing/incorrect identity) or the extra part details simply being ignored. To\nmitigate these issues, we introduce PartCraft, which enables image generation\nbased on fine-grained part-level details specified for objects in the base text\nprompt. This allows more control for artists and enables novel object\ncompositions by combining distinctive object parts. PartCraft first localizes\nobject parts by denoising the object region from a specific diffusion process.\nThis enables each part token to be localized to the right object region. After\nobtaining part masks, we run a localized diffusion process in each of the part\nregions based on fine-grained part descriptions and combine them to produce the\nfinal image. All the stages of PartCraft are based on repurposing a pre-trained\ndiffusion model, which enables it to generalize across various domains without\ntraining. We demonstrate the effectiveness of part-level control provided by\nPartCraft qualitatively through visual examples and quantitatively in\ncomparison to the contemporary baselines.", "paper_summary_zh": "<paragraph>像 Stable Diffusion、DALLE-2 等大型生成模型的文字轉圖像生成，由於其優異的品質和廣泛的知識庫，已成為各種任務的共同基礎。由於影像合成和生成是創意的過程，藝術家需要控制所生成影像的各個部分。我們發現，僅在基本文字提示中加入有關部分的細節，就會導致產生完全不同的影像（例如，遺失/錯誤的身份）或額外的部分細節被忽略。為了減輕這些問題，我們引入了 PartCraft，它可以根據基本文字提示中指定物件的細緻部分層級細節來產生影像。這讓藝術家可以更靈活地控制，並透過結合獨特的物件部分來產生新穎的物件組合。PartCraft 首先透過從特定擴散過程中對物件區域進行去噪來定位物件部分。這讓每個部分標記都能定位到正確的物件區域。取得部分遮罩後，我們在每個部分區域中執行局部擴散程序，根據細緻的部分描述進行處理，並將它們組合起來產生最終影像。PartCraft 的所有階段都是基於重新利用預先訓練好的擴散模型，讓它可以在各種領域中概化，而不需要訓練。我們透過視覺範例定性地展示了 PartCraft 提供的部分層級控制的有效性，並與當代基準進行定量比較。</paragraph>", "author": "Harsh Rangwani et.al.", "authors": "Harsh Rangwani, Aishwarya Agarwal, Kuldeep Kulkarni, R. Venkatesh Babu, Srikrishna Karanam", "id": "2406.10197v1", "paper_url": "http://arxiv.org/abs/2406.10197v1", "repo": "null"}}