{"2407.13122": {"publish_time": "2024-07-18", "title": "MO-EMT-NAS: Multi-Objective Continuous Transfer of Architectural Knowledge Between Tasks from Different Datasets", "paper_summary": "Deploying models across diverse devices demands tradeoffs among multiple\nobjectives due to different resource constraints. Arguably, due to the small\nmodel trap problem in multi-objective neural architecture search (MO-NAS) based\non a supernet, existing approaches may fail to maintain large models. Moreover,\nmulti-tasking neural architecture search (MT-NAS) excels in handling multiple\ntasks simultaneously, but most existing efforts focus on tasks from the same\ndataset, limiting their practicality in real-world scenarios where multiple\ntasks may come from distinct datasets. To tackle the above challenges, we\npropose a Multi-Objective Evolutionary Multi-Tasking framework for NAS\n(MO-EMT-NAS) to achieve architectural knowledge transfer across tasks from\ndifferent datasets while finding Pareto optimal architectures for\nmulti-objectives, model accuracy and computational efficiency. To alleviate the\nsmall model trap issue, we introduce an auxiliary objective that helps maintain\nmultiple larger models of similar accuracy. Moreover, the computational\nefficiency is further enhanced by parallelizing the training and validation of\nthe weight-sharing-based supernet. Experimental results on seven datasets with\ntwo, three, and four task combinations show that MO-EMT-NAS achieves a better\nminimum classification error while being able to offer flexible trade-offs\nbetween model performance and complexity, compared to the state-of-the-art\nsingle-objective MT-NAS algorithms. The runtime of MO-EMT-NAS is reduced by\n59.7% to 77.7%, compared to the corresponding multi-objective single-task\napproaches.", "paper_summary_zh": "<paragraph>由於不同的資源限制，在各種裝置上部署模型需要在多重目標之間進行權衡。可以說，由於基於超網路的多目標神經架構搜尋 (MO-NAS) 中存在小型模型陷阱問題，現有方法可能無法維護大型模型。此外，多任務神經架構搜尋 (MT-NAS) 擅長同時處理多項任務，但大多數現有工作都專注於來自相同資料集的任務，這限制了它們在現實世界中的實用性，在現實世界中，多項任務可能來自不同的資料集。為了應對上述挑戰，我們提出了多目標演化多任務 NAS 框架 (MO-EMT-NAS)，以在來自不同資料集的任務之間實現架構知識轉移，同時為多目標、模型準確性和計算效率找到帕累托最優架構。為了緩解小型模型陷阱問題，我們引入了一個輔助目標，有助於維護多個具有類似準確度的大型模型。此外，通過並行化基於權重共享的超網路的訓練和驗證，進一步提高了計算效率。在具有兩個、三個和四個任務組合的七個資料集上的實驗結果表明，與最先進的單目標 MT-NAS 演算法相比，MO-EMT-NAS 在能夠提供模型效能和複雜度之間的靈活權衡的同時，達到了較佳的最小分類誤差。與對應的多目標單任務方法相比，MO-EMT-NAS 的執行時間減少了 59.7% 至 77.7%。</paragraph>", "author": "Peng Liao et.al.", "authors": "Peng Liao, XiLu Wang, Yaochu Jin, WenLi Du", "id": "2407.13122v1", "paper_url": "http://arxiv.org/abs/2407.13122v1", "repo": "null"}}