{"2412.16188": {"publish_time": "2024-12-13", "title": "A Decade of Deep Learning: A Survey on The Magnificent Seven", "paper_summary": "Deep learning has fundamentally reshaped the landscape of artificial\nintelligence over the past decade, enabling remarkable achievements across\ndiverse domains. At the heart of these developments lie multi-layered neural\nnetwork architectures that excel at automatic feature extraction, leading to\nsignificant improvements in machine learning tasks. To demystify these advances\nand offer accessible guidance, we present a comprehensive overview of the most\ninfluential deep learning algorithms selected through a broad-based survey of\nthe field. Our discussion centers on pivotal architectures, including Residual\nNetworks, Transformers, Generative Adversarial Networks, Variational\nAutoencoders, Graph Neural Networks, Contrastive Language-Image Pre-training,\nand Diffusion models. We detail their historical context, highlight their\nmathematical foundations and algorithmic principles, and examine subsequent\nvariants, extensions, and practical considerations such as training\nmethodologies, normalization techniques, and learning rate schedules. Beyond\nhistorical and technical insights, we also address their applications,\nchallenges, and potential research directions. This survey aims to serve as a\npractical manual for both newcomers seeking an entry point into cutting-edge\ndeep learning methods and experienced researchers transitioning into this\nrapidly evolving domain.", "paper_summary_zh": "深度學習在過去十年中從根本上重塑了人工智慧的格局，在各個領域取得了顯著的成就。這些發展的核心是多層神經網路架構，它擅長自動特徵提取，從而顯著改進機器學習任務。為了揭開這些進步的神秘面紗並提供易於理解的指導，我們對通過廣泛的領域調查所選出的最有影響力的深度學習演算法進行了全面的概述。我們的討論集中在關鍵架構上，包括殘差網路、Transformer、生成對抗網路、變異自動編碼器、圖神經網路、對比語言影像預訓練和擴散模型。我們詳細說明了它們的歷史背景，重點介紹了它們的數學基礎和演算法原理，並探討了後續的變體、擴充和實務考量，例如訓練方法、正規化技術和學習率規劃。除了歷史和技術見解之外，我們還探討了它們的應用、挑戰和潛在的研究方向。本調查旨在作為一本實務手冊，既適合尋求進入尖端深度學習方法的新手，也適合轉型到這個快速發展領域的經驗豐富的研究人員。", "author": "Dilshod Azizov et.al.", "authors": "Dilshod Azizov, Muhammad Arslan Manzoor, Velibor Bojkovic, Yingxu Wang, Zixiao Wang, Zangir Iklassov, Kailong Zhao, Liang Li, Siwei Liu, Yu Zhong, Wei Liu, Shangsong Liang", "id": "2412.16188v1", "paper_url": "http://arxiv.org/abs/2412.16188v1", "repo": "null"}}