{"2412.11912": {"publish_time": "2024-12-16", "title": "CharacterBench: Benchmarking Character Customization of Large Language Models", "paper_summary": "Character-based dialogue (aka role-playing) enables users to freely customize\ncharacters for interaction, which often relies on LLMs, raising the need to\nevaluate LLMs' character customization capability. However, existing benchmarks\nfail to ensure a robust evaluation as they often only involve a single\ncharacter category or evaluate limited dimensions. Moreover, the sparsity of\ncharacter features in responses makes feature-focused generative evaluation\nboth ineffective and inefficient. To address these issues, we propose\nCharacterBench, the largest bilingual generative benchmark, with 22,859\nhuman-annotated samples covering 3,956 characters from 25 detailed character\ncategories. We define 11 dimensions of 6 aspects, classified as sparse and\ndense dimensions based on whether character features evaluated by specific\ndimensions manifest in each response. We enable effective and efficient\nevaluation by crafting tailored queries for each dimension to induce\ncharacters' responses related to specific dimensions. Further, we develop\nCharacterJudge model for cost-effective and stable evaluations. Experiments\nshow its superiority over SOTA automatic judges (e.g., GPT-4) and our\nbenchmark's potential to optimize LLMs' character customization. Our repository\nis at https://github.com/thu-coai/CharacterBench.", "paper_summary_zh": "基於字元的對話（又稱角色扮演）允許使用者自由自訂角色以進行互動，這通常仰賴 LLM，並提升了評估 LLM 角色自訂功能的需求。然而，現有的基準並未確保穩健的評估，因為它們通常只涉及單一的角色類別或評估有限的維度。此外，回應中角色特徵的稀疏性使得以特徵為中心的生成式評估既無效又低效。為了解決這些問題，我們提出了 CharacterBench，這是最大的雙語生成式基準，包含 22,859 個由人類註解的範例，涵蓋來自 25 個詳細角色類別的 3,956 個角色。我們定義了 6 個面向的 11 個維度，根據由特定維度評估的角色特徵是否在每個回應中顯現，將其分類為稀疏和稠密維度。我們透過為每個維度制定客製化查詢來誘導與特定維度相關的角色回應，進而實現有效且高效的評估。此外，我們開發了 CharacterJudge 模型以進行具成本效益且穩定的評估。實驗顯示其優於 SOTA 自動評分器（例如 GPT-4），而我們的基準有潛力最佳化 LLM 的角色自訂。我們的儲存庫位於 https://github.com/thu-coai/CharacterBench。", "author": "Jinfeng Zhou et.al.", "authors": "Jinfeng Zhou, Yongkang Huang, Bosi Wen, Guanqun Bi, Yuxuan Chen, Pei Ke, Zhuang Chen, Xiyao Xiao, Libiao Peng, Kuntian Tang, Rongsheng Zhang, Le Zhang, Tangjie Lv, Zhipeng Hu, Hongning Wang, Minlie Huang", "id": "2412.11912v1", "paper_url": "http://arxiv.org/abs/2412.11912v1", "repo": "https://github.com/thu-coai/characterbench"}}