{"2408.12250": {"publish_time": "2024-08-22", "title": "Can Artificial Intelligence Embody Moral Values?", "paper_summary": "The neutrality thesis holds that technology cannot be laden with values. This\nlong-standing view has faced critiques, but much of the argumentation against\nneutrality has focused on traditional, non-smart technologies like bridges and\nrazors. In contrast, AI is a smart technology increasingly used in high-stakes\ndomains like healthcare, finance, and policing, where its decisions can cause\nmoral harm. In this paper, we argue that artificial intelligence, particularly\nartificial agents that autonomously make decisions to pursue their goals,\nchallenge the neutrality thesis. Our central claim is that the computational\nmodels underlying artificial agents can integrate representations of moral\nvalues such as fairness, honesty and avoiding harm. We provide a conceptual\nframework discussing the neutrality thesis, values, and AI. Moreover, we\nexamine two approaches to designing computational models of morality,\nartificial conscience and ethical prompting, and present empirical evidence\nfrom text-based game environments that artificial agents with such models\nexhibit more ethical behavior compared to agents without these models. The\nfindings support that AI can embody moral values, which contradicts the claim\nthat all technologies are necessarily value-neutral.", "paper_summary_zh": "中立性論點認為科技無法承載價值觀。這個長久以來的觀點面臨批評，但許多反對中立性的論點都集中在傳統的非智慧型科技，例如橋樑和剃刀。相比之下，人工智慧是一種智慧型科技，日益運用於醫療保健、金融和警政等高風險領域，其決策可能會造成道德傷害。在本文中，我們論證人工智慧，尤其是自主做出決策以追求目標的人工代理，挑戰了中立性論點。我們的核心主張是，人工代理背後的運算模型可以整合道德價值觀的表徵，例如公平、誠實和避免傷害。我們提供了一個概念架構，討論中立性論點、價值觀和人工智慧。此外，我們探討了設計道德運算模型的兩種方法，即人工良心和道德提示，並從基於文字的遊戲環境中提出實證證據，證明具備此類模型的人工代理與沒有這些模型的代理相比，表現出更道德的行為。這些發現支持人工智慧可以體現道德價值觀，這與所有科技都必然價值中立的主張相矛盾。", "author": "Torben Swoboda et.al.", "authors": "Torben Swoboda, Lode Lauwaert", "id": "2408.12250v1", "paper_url": "http://arxiv.org/abs/2408.12250v1", "repo": "null"}}