{"2410.21228": {"publish_time": "2024-10-28", "title": "LoRA vs Full Fine-tuning: An Illusion of Equivalence", "paper_summary": "Fine-tuning is a crucial paradigm for adapting pre-trained large language\nmodels to downstream tasks. Recently, methods like Low-Rank Adaptation (LoRA)\nhave been shown to match the performance of fully fine-tuned models on various\ntasks with an extreme reduction in the number of trainable parameters. Even in\nsettings where both methods learn similarly accurate models, \\emph{are their\nlearned solutions really equivalent?} We study how different fine-tuning\nmethods change pre-trained models by analyzing the model's weight matrices\nthrough the lens of their spectral properties. We find that full fine-tuning\nand LoRA yield weight matrices whose singular value decompositions exhibit very\ndifferent structure; moreover, the fine-tuned models themselves show distinct\ngeneralization behaviors when tested outside the adaptation task's\ndistribution. More specifically, we first show that the weight matrices trained\nwith LoRA have new, high-ranking singular vectors, which we call \\emph{intruder\ndimensions}. Intruder dimensions do not appear during full fine-tuning. Second,\nwe show that LoRA models with intruder dimensions, despite achieving similar\nperformance to full fine-tuning on the target task, become worse models of the\npre-training distribution and adapt less robustly to multiple tasks\nsequentially. Higher-rank, rank-stabilized LoRA models closely mirror full\nfine-tuning, even when performing on par with lower-rank LoRA models on the\nsame tasks. These results suggest that models updated with LoRA and full\nfine-tuning access different parts of parameter space, even when they perform\nequally on the fine-tuned distribution. We conclude by examining why intruder\ndimensions appear in LoRA fine-tuned models, why they are undesirable, and how\ntheir effects can be minimized.", "paper_summary_zh": "微调是将预先训练的大语言模型适应下游任务的关键范例。最近，已证明诸如低秩适应 (LoRA) 之类的方法能够在各种任务上匹配完全微调模型的性能，同时极大地减少了可训练参数的数量。即使在两种方法都学习到同样准确的模型的情况下，\\emph{它们学习到的解决方案是否真的等效？} 我们通过光谱特性的视角分析模型的权重矩阵，研究了不同的微调方法如何改变预先训练的模型。我们发现，完全微调和 LoRA 产生的权重矩阵的奇异值分解呈现出非常不同的结构；此外，微调模型本身在适应任务的分布之外进行测试时表现出不同的泛化行为。更具体地说，我们首先表明使用 LoRA 训练的权重矩阵具有新的高秩奇异向量，我们称之为\\emph{入侵维度}。在完全微调期间不会出现入侵维度。其次，我们表明，具有入侵维度的 LoRA 模型尽管在目标任务上实现了与完全微调相似的性能，但它们却成为预训练分布的更差模型，并且在多个任务上按顺序适应的鲁棒性较差。即使在与低秩 LoRA 模型在相同任务上表现相当时，高秩、秩稳定的 LoRA 模型也与完全微调非常相似。这些结果表明，即使在微调分布上表现相同，使用 LoRA 和完全微调更新的模型也会访问参数空间的不同部分。我们通过检查为什么入侵维度出现在 LoRA 微调模型中、为什么它们不受欢迎以及如何最小化它们的影响来结束本文。", "author": "Reece Shuttleworth et.al.", "authors": "Reece Shuttleworth, Jacob Andreas, Antonio Torralba, Pratyusha Sharma", "id": "2410.21228v1", "paper_url": "http://arxiv.org/abs/2410.21228v1", "repo": "null"}}