{"2410.23072": {"publish_time": "2024-10-30", "title": "CNN Explainability with Multivector Tucker Saliency Maps for Self-Supervised Models", "paper_summary": "Interpreting the decisions of Convolutional Neural Networks (CNNs) is\nessential for understanding their behavior, yet explainability remains a\nsignificant challenge, particularly for self-supervised models. Most existing\nmethods for generating saliency maps rely on ground truth labels, restricting\ntheir use to supervised tasks. EigenCAM is the only notable label-independent\nalternative, leveraging Singular Value Decomposition to generate saliency maps\napplicable across CNN models, but it does not fully exploit the tensorial\nstructure of feature maps. In this work, we introduce the Tucker Saliency Map\n(TSM) method, which applies Tucker tensor decomposition to better capture the\ninherent structure of feature maps, producing more accurate singular vectors\nand values. These are used to generate high-fidelity saliency maps, effectively\nhighlighting objects of interest in the input. We further extend EigenCAM and\nTSM into multivector variants -Multivec-EigenCAM and Multivector Tucker\nSaliency Maps (MTSM)- which utilize all singular vectors and values, further\nimproving saliency map quality. Quantitative evaluations on supervised\nclassification models demonstrate that TSM, Multivec-EigenCAM, and MTSM achieve\ncompetitive performance with label-dependent methods. Moreover, TSM enhances\nexplainability by approximately 50% over EigenCAM for both supervised and\nself-supervised models. Multivec-EigenCAM and MTSM further advance\nstate-of-the-art explainability performance on self-supervised models, with\nMTSM achieving the best results.", "paper_summary_zh": "詮釋卷積神經網路 (CNN) 的決策對於理解其行為至關重要，然而可解釋性仍然是一項重大的挑戰，特別是對於自監督模型。現有的大多數生成顯著性圖的方法依賴於真實標籤，將其使用限制在監督式任務中。EigenCAM 是唯一值得注意的標籤無關替代方案，利用奇異值分解來生成適用於所有 CNN 模型的顯著性圖，但它並未充分利用特徵圖的張量結構。在這項工作中，我們引入了塔克顯著性圖 (TSM) 方法，該方法應用塔克張量分解以更好地捕捉特徵圖的內在結構，產生更準確的奇異向量和值。這些用於生成高保真顯著性圖，有效地突顯輸入中的感興趣對象。我們進一步將 EigenCAM 和 TSM 擴展到多向量變體 - 多向量 EigenCAM 和多向量塔克顯著性圖 (MTSM) - 利用所有奇異向量和值，進一步提高顯著性圖的品質。在監督式分類模型上的定量評估表明，TSM、多向量 EigenCAM 和 MTSM 與標籤依賴方法相比，達到了競爭性的效能。此外，TSM 對監督式和自監督式模型的解釋性比 EigenCAM 提高了大約 50%。多向量 EigenCAM 和 MTSM 進一步提升了自監督式模型的現有最佳解釋性效能，其中 MTSM 達到了最佳結果。", "author": "Aymene Mohammed Bouayed et.al.", "authors": "Aymene Mohammed Bouayed, Samuel Deslauriers-Gauthier, Adrian Iaccovelli, David Naccache", "id": "2410.23072v1", "paper_url": "http://arxiv.org/abs/2410.23072v1", "repo": "null"}}