{"2411.19331": {"publish_time": "2024-11-28", "title": "Talking to DINO: Bridging Self-Supervised Vision Backbones with Language for Open-Vocabulary Segmentation", "paper_summary": "Open-Vocabulary Segmentation (OVS) aims at segmenting images from free-form\ntextual concepts without predefined training classes. While existing\nvision-language models such as CLIP can generate segmentation masks by\nleveraging coarse spatial information from Vision Transformers, they face\nchallenges in spatial localization due to their global alignment of image and\ntext features. Conversely, self-supervised visual models like DINO excel in\nfine-grained visual encoding but lack integration with language. To bridge this\ngap, we present Talk2DINO, a novel hybrid approach that combines the spatial\naccuracy of DINOv2 with the language understanding of CLIP. Our approach aligns\nthe textual embeddings of CLIP to the patch-level features of DINOv2 through a\nlearned mapping function without the need to fine-tune the underlying\nbackbones. At training time, we exploit the attention maps of DINOv2 to\nselectively align local visual patches with textual embeddings. We show that\nthe powerful semantic and localization abilities of Talk2DINO can enhance the\nsegmentation process, resulting in more natural and less noisy segmentations,\nand that our approach can also effectively distinguish foreground objects from\nthe background. Experimental results demonstrate that Talk2DINO achieves\nstate-of-the-art performance across several unsupervised OVS benchmarks. Source\ncode and models are publicly available at:\nhttps://lorebianchi98.github.io/Talk2DINO/.", "paper_summary_zh": "開放式詞彙分割 (OVS) 旨在從自由形式文本概念中分割影像，而無需預先定義的訓練類別。雖然現有的視覺語言模型（例如 CLIP）可以透過利用 Vision Transformers 中的粗略空間資訊來產生分割遮罩，但由於其影像和文字特徵的整體對齊，它們在空間定位方面面臨挑戰。相反地，自監督視覺模型（例如 DINO）擅長精細的視覺編碼，但缺乏與語言的整合。為了彌合這一差距，我們提出了 Talk2DINO，這是一種新穎的混合方法，結合了 DINOv2 的空間準確性和 CLIP 的語言理解。我們的做法透過一個學習的對應函數，將 CLIP 的文本嵌入與 DINOv2 的區塊層級特徵對齊，而無需微調底層主幹。在訓練期間，我們利用 DINOv2 的注意力圖有選擇性地將局部視覺區塊與文本嵌入對齊。我們展示了 Talk2DINO 強大的語義和定位能力可以增強分割過程，產生更自然、雜訊更少的分割，並且我們的做法也可以有效地將前景物體與背景區分開來。實驗結果表明，Talk2DINO 在多個非監督 OVS 基準測試中實現了最先進的效能。原始程式碼和模型已公開在以下網址取得：\nhttps://lorebianchi98.github.io/Talk2DINO/。", "author": "Luca Barsellotti et.al.", "authors": "Luca Barsellotti, Lorenzo Bianchi, Nicola Messina, Fabio Carrara, Marcella Cornia, Lorenzo Baraldi, Fabrizio Falchi, Rita Cucchiara", "id": "2411.19331v1", "paper_url": "http://arxiv.org/abs/2411.19331v1", "repo": "null"}}