{"2412.13636": {"publish_time": "2024-12-18", "title": "Consistency of Compositional Generalization across Multiple Levels", "paper_summary": "Compositional generalization is the capability of a model to understand novel\ncompositions composed of seen concepts. There are multiple levels of novel\ncompositions including phrase-phrase level, phrase-word level, and word-word\nlevel. Existing methods achieve promising compositional generalization, but the\nconsistency of compositional generalization across multiple levels of novel\ncompositions remains unexplored. The consistency refers to that a model should\ngeneralize to a phrase-phrase level novel composition, and\nphrase-word/word-word level novel compositions that can be derived from it\nsimultaneously. In this paper, we propose a meta-learning based framework, for\nachieving consistent compositional generalization across multiple levels. The\nbasic idea is to progressively learn compositions from simple to complex for\nconsistency. Specifically, we divide the original training set into multiple\nvalidation sets based on compositional complexity, and introduce multiple\nmeta-weight-nets to generate sample weights for samples in different validation\nsets. To fit the validation sets in order of increasing compositional\ncomplexity, we optimize the parameters of each meta-weight-net independently\nand sequentially in a multilevel optimization manner. We build a GQA-CCG\ndataset to quantitatively evaluate the consistency. Experimental results on\nvisual question answering and temporal video grounding, demonstrate the\neffectiveness of the proposed framework. We release GQA-CCG at\nhttps://github.com/NeverMoreLCH/CCG.", "paper_summary_zh": "組合泛化是指模型理解由已見概念組成的創新組合的能力。創新組合有多個層次，包括片語-片語層次、片語-詞彙層次和詞彙-詞彙層次。現有方法實現了有前景的組合泛化，但組合泛化在多個創新組合層次中的一致性仍未探索。一致性是指模型應概化為片語-片語層次的創新組合，以及可以同時從中衍生的片語-詞彙/詞彙-詞彙層次的創新組合。在本文中，我們提出了一個基於元學習的框架，用於在多個層次實現一致的組合泛化。基本思想是逐步學習從簡單到複雜的組合以保持一致性。具體來說，我們根據組合複雜性將原始訓練集劃分為多個驗證集，並引入多個元權重網路來為不同驗證集中的樣本生成樣本權重。為了按照組合複雜性遞增的順序擬合驗證集，我們以多層次優化的方式獨立且依序優化每個元權重網路的參數。我們建立了一個 GQA-CCG 資料集來定量評估一致性。視覺問題解答和時序影片接地的實驗結果證明了所提出框架的有效性。我們在 https://github.com/NeverMoreLCH/CCG 釋出 GQA-CCG。", "author": "Chuanhao Li et.al.", "authors": "Chuanhao Li, Zhen Li, Chenchen Jing, Xiaomeng Fan, Wenbo Ye, Yuwei Wu, Yunde Jia", "id": "2412.13636v1", "paper_url": "http://arxiv.org/abs/2412.13636v1", "repo": "https://github.com/nevermorelch/ccg"}}