{"2406.04109": {"publish_time": "2024-06-06", "title": "Intention and Face in Dialog", "paper_summary": "The notion of face described by Brown and Levinson (1987) has been studied in\ngreat detail, but a critical aspect of the framework, that which focuses on how\nintentions mediate the planning of turns which impose upon face, has received\nfar less attention. We present an analysis of three computational systems\ntrained for classifying both intention and politeness, focusing on how the\nformer influences the latter. In politeness theory, agents attend to the desire\nto have their wants appreciated (positive face), and a complementary desire to\nact unimpeded and maintain freedom (negative face). Similar to speech acts,\nutterances can perform so-called face acts which can either raise or threaten\nthe positive or negative face of the speaker or hearer. We begin by using an\nexisting corpus to train a model which classifies face acts, achieving a new\nSoTA in the process. We then observe that every face act has an underlying\nintention that motivates it and perform additional experiments integrating\ndialog act annotations to provide these intentions by proxy. Our analysis finds\nthat dialog acts improve performance on face act detection for minority classes\nand points to a close relationship between aspects of face and intent.", "paper_summary_zh": "布朗和莱文森 (1987) 所描述的面子概念已获得详细研究，但该框架的一个关键方面，即关注意图如何调解强加于面的轮流计划，却鲜受关注。我们对三个计算系统进行了分析，这些系统经过训练可以对意图和礼貌进行分类，重点关注前者如何影响后者。在礼貌理论中，代理人会关注希望得到欣赏的愿望（积极的面子），以及不受阻碍和保持自由的互补愿望（消极的面子）。与言语行为类似，话语可以执行所谓的言语行为，这些行为可以提升或威胁说话者或听者的积极或消极面子。我们首先使用现有语料库来训练一个模型，该模型对言语行为进行分类，在此过程中实现了新的 SoTA。然后我们观察到，每个言语行为都有一个潜在的意图来激励它，并执行额外的实验，整合对话行为注释以通过代理提供这些意图。我们的分析发现，对话行为提高了少数类别的言语行为检测性能，并指出了面部和意图方面之间的密切关系。", "author": "Adil Soubki et.al.", "authors": "Adil Soubki, Owen Rambow", "id": "2406.04109v1", "paper_url": "http://arxiv.org/abs/2406.04109v1", "repo": "null"}}