{"2410.16152": {"publish_time": "2024-10-21", "title": "Warped Diffusion: Solving Video Inverse Problems with Image Diffusion Models", "paper_summary": "Using image models naively for solving inverse video problems often suffers\nfrom flickering, texture-sticking, and temporal inconsistency in generated\nvideos. To tackle these problems, in this paper, we view frames as continuous\nfunctions in the 2D space, and videos as a sequence of continuous warping\ntransformations between different frames. This perspective allows us to train\nfunction space diffusion models only on images and utilize them to solve\ntemporally correlated inverse problems. The function space diffusion models\nneed to be equivariant with respect to the underlying spatial transformations.\nTo ensure temporal consistency, we introduce a simple post-hoc test-time\nguidance towards (self)-equivariant solutions. Our method allows us to deploy\nstate-of-the-art latent diffusion models such as Stable Diffusion XL to solve\nvideo inverse problems. We demonstrate the effectiveness of our method for\nvideo inpainting and $8\\times$ video super-resolution, outperforming existing\ntechniques based on noise transformations. We provide generated video results:\nhttps://giannisdaras.github.io/warped_diffusion.github.io/.", "paper_summary_zh": "使用图像模型来解决逆视频问题时，通常会出现闪烁、纹理粘连和生成视频的时间不一致问题。为了解决这些问题，在本文中，我们将帧视为 2D 空间中的连续函数，并将视频视为不同帧之间的连续扭曲变换序列。这种观点使我们能够仅在图像上训练函数空间扩散模型，并利用它们来解决时间相关逆问题。函数空间扩散模型需要相对于底层空间变换保持等变性。为了确保时间一致性，我们在事后测试时间指导中引入了一个简单的（自）等变解。我们的方法使我们能够部署最先进的潜在扩散模型（例如 Stable Diffusion XL）来解决视频逆问题。我们展示了我们的方法在视频修复和 8 倍视频超分辨率方面的有效性，优于基于噪声变换的现有技术。我们提供了生成的视频结果：https://giannisdaras.github.io/warped_diffusion.github.io/。", "author": "Giannis Daras et.al.", "authors": "Giannis Daras, Weili Nie, Karsten Kreis, Alex Dimakis, Morteza Mardani, Nikola Borislavov Kovachki, Arash Vahdat", "id": "2410.16152v2", "paper_url": "http://arxiv.org/abs/2410.16152v2", "repo": "null"}}