{"2409.10403": {"publish_time": "2024-09-16", "title": "A Knowledge-Enhanced Disease Diagnosis Method Based on Prompt Learning and BERT Integration", "paper_summary": "This paper proposes a knowledge-enhanced disease diagnosis method based on a\nprompt learning framework. The method retrieves structured knowledge from\nexternal knowledge graphs related to clinical cases, encodes it, and injects it\ninto the prompt templates to enhance the language model's understanding and\nreasoning capabilities for the task.We conducted experiments on three public\ndatasets: CHIP-CTC, IMCS-V2-NER, and KUAKE-QTR. The results show that the\nproposed method significantly outperforms existing models across multiple\nevaluation metrics, with an F1 score improvement of 2.4% on the CHIP-CTC\ndataset, 3.1% on the IMCS-V2-NER dataset,and 4.2% on the KUAKE-QTR dataset.\nAdditionally,ablation studies confirmed the critical role of the knowledge\ninjection module,as the removal of this module resulted in a significant drop\nin F1 score. The experimental results demonstrate that the proposed method not\nonly effectively improves the accuracy of disease diagnosis but also enhances\nthe interpretability of the predictions, providing more reliable support and\nevidence for clinical diagnosis.", "paper_summary_zh": "本文提出了一种基于提示学习框架的知识增强疾病诊断方法。该方法从与临床病例相关的外部知识图谱中检索结构化知识，对其进行编码，并将其注入到提示模板中，以增强语言模型对任务的理解和推理能力。我们在三个公共数据集上进行了实验：CHIP-CTC、IMCS-V2-NER 和 KUAKE-QTR。结果表明，所提出的方法在多个评估指标上明显优于现有模型，在 CHIP-CTC 数据集上的 F1 得分提高了 2.4%，在 IMCS-V2-NER 数据集上提高了 3.1%，在 KUAKE-QTR 数据集上提高了 4.2%。此外，消融研究证实了知识注入模块的关键作用，因为移除此模块会导致 F1 得分显着下降。实验结果表明，所提出的方法不仅有效提高了疾病诊断的准确性，而且增强了预测的可解释性，为临床诊断提供了更可靠的支持和证据。", "author": "Zhang Zheng et.al.", "authors": "Zhang Zheng", "id": "2409.10403v1", "paper_url": "http://arxiv.org/abs/2409.10403v1", "repo": "null"}}