{"2407.08966": {"publish_time": "2024-07-12", "title": "LAPT: Label-driven Automated Prompt Tuning for OOD Detection with Vision-Language Models", "paper_summary": "Out-of-distribution (OOD) detection is crucial for model reliability, as it\nidentifies samples from unknown classes and reduces errors due to unexpected\ninputs. Vision-Language Models (VLMs) such as CLIP are emerging as powerful\ntools for OOD detection by integrating multi-modal information. However, the\npractical application of such systems is challenged by manual prompt\nengineering, which demands domain expertise and is sensitive to linguistic\nnuances. In this paper, we introduce Label-driven Automated Prompt Tuning\n(LAPT), a novel approach to OOD detection that reduces the need for manual\nprompt engineering. We develop distribution-aware prompts with in-distribution\n(ID) class names and negative labels mined automatically. Training samples\nlinked to these class labels are collected autonomously via image synthesis and\nretrieval methods, allowing for prompt learning without manual effort. We\nutilize a simple cross-entropy loss for prompt optimization, with cross-modal\nand cross-distribution mixing strategies to reduce image noise and explore the\nintermediate space between distributions, respectively. The LAPT framework\noperates autonomously, requiring only ID class names as input and eliminating\nthe need for manual intervention. With extensive experiments, LAPT consistently\noutperforms manually crafted prompts, setting a new standard for OOD detection.\nMoreover, LAPT not only enhances the distinction between ID and OOD samples,\nbut also improves the ID classification accuracy and strengthens the\ngeneralization robustness to covariate shifts, resulting in outstanding\nperformance in challenging full-spectrum OOD detection tasks. Codes are\navailable at \\url{https://github.com/YBZh/LAPT}.", "paper_summary_zh": "<paragraph>異分布 (OOD) 偵測對於模型可靠性至關重要，因為它能識別來自未知類別的樣本，並減少由於意外輸入造成的錯誤。視覺語言模型 (VLM)，例如 CLIP，正透過整合多模態資訊，成為 OOD 偵測的強大工具。然而，此類系統的實際應用受到手動提示工程的挑戰，這需要領域專業知識，而且對語言差異很敏感。在本文中，我們介紹標籤驅動自動化提示調整 (LAPT)，這是一種新的 OOD 偵測方法，可減少對手動提示工程的需求。我們開發出具有分佈感知的提示，其中包含自動挖掘的同分佈 (ID) 類別名稱和負面標籤。連結到這些類別標籤的訓練樣本是透過影像合成和檢索方法自主收集的，允許提示學習而無需手動操作。我們利用簡單的交叉熵損失進行提示最佳化，並採用跨模態和跨分佈混合策略，分別用於減少影像雜訊和探索分佈之間的中間空間。LAPT 框架自主運作，僅需要 ID 類別名稱作為輸入，並消除了手動介入的需要。透過廣泛的實驗，LAPT 持續優於手動製作的提示，為 OOD 偵測設定了新標準。此外，LAPT 不僅增強了 ID 和 OOD 樣本之間的區別，還改善了 ID 分類的準確性，並加強了對協變數轉移的泛化穩健性，從而產生了在具有挑戰性的全光譜 OOD 偵測任務中的傑出表現。程式碼可在 \\url{https://github.com/YBZh/LAPT} 取得。</paragraph>", "author": "Yabin Zhang et.al.", "authors": "Yabin Zhang, Wenjie Zhu, Chenhang He, Lei Zhang", "id": "2407.08966v1", "paper_url": "http://arxiv.org/abs/2407.08966v1", "repo": "https://github.com/ybzh/lapt"}}