{"2412.13943": {"publish_time": "2024-12-18", "title": "On Explaining Knowledge Distillation: Measuring and Visualising the Knowledge Transfer Process", "paper_summary": "Knowledge distillation (KD) remains challenging due to the opaque nature of\nthe knowledge transfer process from a Teacher to a Student, making it difficult\nto address certain issues related to KD. To address this, we proposed UniCAM, a\nnovel gradient-based visual explanation method, which effectively interprets\nthe knowledge learned during KD. Our experimental results demonstrate that with\nthe guidance of the Teacher's knowledge, the Student model becomes more\nefficient, learning more relevant features while discarding those that are not\nrelevant. We refer to the features learned with the Teacher's guidance as\ndistilled features and the features irrelevant to the task and ignored by the\nStudent as residual features. Distilled features focus on key aspects of the\ninput, such as textures and parts of objects. In contrast, residual features\ndemonstrate more diffused attention, often targeting irrelevant areas,\nincluding the backgrounds of the target objects. In addition, we proposed two\nnovel metrics: the feature similarity score (FSS) and the relevance score (RS),\nwhich quantify the relevance of the distilled knowledge. Experiments on the\nCIFAR10, ASIRRA, and Plant Disease datasets demonstrate that UniCAM and the two\nmetrics offer valuable insights to explain the KD process.", "paper_summary_zh": "知識蒸餾（KD）由於教師到學生的知識傳輸過程的不透明本質而仍然具有挑戰性，這使得難以解決與 KD 相關的某些問題。為了解決這個問題，我們提出了 UniCAM，一種新穎的基於梯度的視覺解釋方法，它有效地解釋了 KD 期間學習到的知識。我們的實驗結果表明，在教師知識的指導下，學生模型變得更有效率，學習更多相關特徵，同時捨棄不相關的特徵。我們將在教師指導下學習到的特徵稱為蒸餾特徵，而與任務無關且學生忽略的特徵稱為殘差特徵。蒸餾特徵關注輸入的關鍵方面，例如紋理和物體的部分。相比之下，殘差特徵表現出更分散的注意力，通常針對無關區域，包括目標物體的背景。此外，我們提出了兩個新穎的指標：特徵相似度分數（FSS）和相關性分數（RS），它們量化了蒸餾知識的相關性。在 CIFAR10、ASIRRA 和植物病害數據集上的實驗表明，UniCAM 和這兩個指標提供了寶貴的見解來解釋 KD 過程。", "author": "Gereziher Adhane et.al.", "authors": "Gereziher Adhane, Mohammad Mahdi Dehshibi, Dennis Vetter, David Masip, Gemma Roig", "id": "2412.13943v1", "paper_url": "http://arxiv.org/abs/2412.13943v1", "repo": "null"}}