{"2408.15354": {"publish_time": "2024-08-27", "title": "What Is Required for Empathic AI? It Depends, and Why That Matters for AI Developers and Users", "paper_summary": "Interest is growing in artificial empathy, but so is confusion about what\nartificial empathy is or needs to be. This confusion makes it challenging to\nnavigate the technical and ethical issues that accompany empathic AI\ndevelopment. Here, we outline a framework for thinking about empathic AI based\non the premise that different constellations of capabilities associated with\nempathy are important for different empathic AI applications. We describe\ndistinctions of capabilities that we argue belong under the empathy umbrella,\nand show how three medical empathic AI use cases require different sets of\nthese capabilities. We conclude by discussing why appreciation of the diverse\ncapabilities under the empathy umbrella is important for both AI creators and\nusers.", "paper_summary_zh": "對人工同理心越來越感興趣，但對於人工同理心是什麼或需要什麼也越來越困惑。這種混淆使得難以解決伴隨同理心 AI 開發而來的技術和倫理問題。在此，我們概述了一個思考同理心 AI 的架構，其基於這樣一個前提：與同理心相關的不同能力組合對於不同的同理心 AI 應用很重要。我們描述了我們認為屬於同理心範疇的能力區別，並展示了三個醫療同理心 AI 使用案例需要這些能力的不同組合。我們最後討論了為什麼欣賞同理心範疇下的各種能力對於 AI 創造者和使用者都很重要的原因。", "author": "Jana Schaich Borg et.al.", "authors": "Jana Schaich Borg, Hannah Read", "id": "2408.15354v1", "paper_url": "http://arxiv.org/abs/2408.15354v1", "repo": "null"}}