{"2409.07691": {"publish_time": "2024-09-12", "title": "Enhancing Q&A Text Retrieval with Ranking Models: Benchmarking, fine-tuning and deploying Rerankers for RAG", "paper_summary": "Ranking models play a crucial role in enhancing overall accuracy of text\nretrieval systems. These multi-stage systems typically utilize either dense\nembedding models or sparse lexical indices to retrieve relevant passages based\non a given query, followed by ranking models that refine the ordering of the\ncandidate passages by its relevance to the query.\n  This paper benchmarks various publicly available ranking models and examines\ntheir impact on ranking accuracy. We focus on text retrieval for\nquestion-answering tasks, a common use case for Retrieval-Augmented Generation\nsystems. Our evaluation benchmarks include models some of which are\ncommercially viable for industrial applications.\n  We introduce a state-of-the-art ranking model, NV-RerankQA-Mistral-4B-v3,\nwhich achieves a significant accuracy increase of ~14% compared to pipelines\nwith other rerankers. We also provide an ablation study comparing the\nfine-tuning of ranking models with different sizes, losses and self-attention\nmechanisms.\n  Finally, we discuss challenges of text retrieval pipelines with ranking\nmodels in real-world industry applications, in particular the trade-offs among\nmodel size, ranking accuracy and system requirements like indexing and serving\nlatency / throughput.", "paper_summary_zh": "排名模型在提升整體文字檢索系統的準確度方面扮演著至關重要的角色。這些多階段系統通常會利用密集嵌入模型或稀疏詞彙索引來依據給定的查詢檢索相關段落，接著再由排名模型依據候選段落與查詢相關性來優化排序。\n  本文對各種公開的排名模型進行基準測試，並檢視它們對排名準確度的影響。我們專注於問答任務的文字檢索，這是檢索增強生成系統的常見使用案例。我們的評估基準包含一些在產業應用中具有商業可行性的模型。\n  我們引進了最先進的排名模型 NV-RerankQA-Mistral-4B-v3，與其他重新排名器的管道相比，它達到了約 14% 的顯著準確度提升。我們也提供了一項消融研究，比較不同大小、損失和自注意力機制的排名模型微調。\n  最後，我們討論了在實際產業應用中使用排名模型的文字檢索管道的挑戰，特別是在模型大小、排名準確度和系統需求（例如索引和提供服務的延遲/吞吐量）之間的權衡。", "author": "Gabriel de Souza P. Moreira et.al.", "authors": "Gabriel de Souza P. Moreira, Ronay Ak, Benedikt Schifferer, Mengyao Xu, Radek Osmulski, Even Oldridge", "id": "2409.07691v1", "paper_url": "http://arxiv.org/abs/2409.07691v1", "repo": "null"}}