{"2501.01039": {"publish_time": "2025-01-02", "title": "MSWA: Refining Local Attention with Multi-ScaleWindow Attention", "paper_summary": "Transformer-based LLMs have achieved exceptional performance across a wide\nrange of NLP tasks. However, the standard self-attention mechanism suffers from\nquadratic time complexity and linearly increased cache size. Sliding window\nattention (SWA) solves this problem by restricting the attention range to a\nfixed-size local context window. Nevertheless, SWA employs a uniform window\nsize for each head in each layer, making it inefficient in capturing context of\nvarying scales. To mitigate this limitation, we propose Multi-Scale Window\nAttention (MSWA) which applies diverse window sizes across heads and layers in\nthe Transformer. It not only allows for different window sizes among heads\nwithin the same layer but also progressively increases window size allocation\nfrom shallow to deep layers, thus enabling the model to capture contextual\ninformation with different lengths and distances. Experimental results on\nlanguage modeling and common-sense reasoning tasks substantiate that MSWA\noutperforms traditional local attention in both effectiveness and efficiency.", "paper_summary_zh": "基於 Transformer 的 LLM 在廣泛的 NLP 任務中已取得卓越的效能。然而，標準自我注意機制會產生二次時間複雜度和線性增加的快取大小。滑動視窗注意力 (SWA) 透過將注意力範圍限制在固定大小的局部內容視窗中來解決這個問題。儘管如此，SWA 在每一層的每個頭部都使用統一的視窗大小，這使得它在擷取不同規模的內容時效率不彰。為了減輕這個限制，我們提出多尺度視窗注意力 (MSWA)，它在 Transformer 中對頭部和層級套用不同的視窗大小。它不僅允許在同一層中的頭部之間使用不同的視窗大小，而且還逐步增加從淺層到深層的視窗大小配置，從而使模型能夠擷取具有不同長度和距離的內容資訊。在語言建模和常識推理任務上的實驗結果證實，MSWA 在有效性和效率方面都優於傳統的局部注意力。", "author": "Yixing Xu et.al.", "authors": "Yixing Xu, Shivank Nag, Dong Li, Lu Tian, Emad Barsoum", "id": "2501.01039v1", "paper_url": "http://arxiv.org/abs/2501.01039v1", "repo": "null"}}