{"2412.08111": {"publish_time": "2024-12-11", "title": "Seeing Syntax: Uncovering Syntactic Learning Limitations in Vision-Language Models", "paper_summary": "Vision-language models (VLMs), serve as foundation models for multi-modal\napplications such as image captioning and text-to-image generation. Recent\nstudies have highlighted limitations in VLM text encoders, particularly in\nareas like compositionality and semantic understanding, though the underlying\nreasons for these limitations remain unclear. In this work, we aim to address\nthis gap by analyzing the syntactic information, one of the fundamental\nlinguistic properties, encoded by the text encoders of VLMs. We perform a\nthorough analysis comparing VLMs with different objective functions, parameter\nsize and training data size, and with uni-modal language models (ULMs) in their\nability to encode syntactic knowledge. Our findings suggest that ULM text\nencoders acquire syntactic information more effectively than those in VLMs. The\nsyntactic information learned by VLM text encoders is shaped primarily by the\npre-training objective, which plays a more crucial role than other factors such\nas model architecture, model size, or the volume of pre-training data. Models\nexhibit different layer-wise trends where CLIP performance dropped across\nlayers while for other models, middle layers are rich in encoding syntactic\nknowledge.", "paper_summary_zh": "視覺語言模型 (VLM) 是多模態應用程式的基礎模型，例如影像標題和文字轉影像生成。最近的研究強調了 VLM 文字編碼器的限制，特別是在組合性和語義理解等領域，儘管這些限制的根本原因仍不清楚。在這項工作中，我們旨在透過分析語法資訊（語言基本屬性之一）來解決這個差距，由 VLM 的文字編碼器編碼。我們執行了一項徹底的分析，比較具有不同目標函數、參數大小和訓練資料大小的 VLM，以及在其編碼語法知識的能力中具有單模態語言模型 (ULM)。我們的研究結果表明，ULM 文字編碼器比 VLM 中的編碼器更有效地獲取語法資訊。VLM 文字編碼器學習到的語法資訊主要由預訓練目標形成，它比其他因素（例如模型架構、模型大小或預訓練資料量）扮演更重要的角色。模型展現出不同的逐層趨勢，其中 CLIP 性能在各層下降，而對於其他模型，中間層富含編碼語法知識。", "author": "Sri Harsha Dumpala et.al.", "authors": "Sri Harsha Dumpala, David Arps, Sageev Oore, Laura Kallmeyer, Hassan Sajjad", "id": "2412.08111v1", "paper_url": "http://arxiv.org/abs/2412.08111v1", "repo": "null"}}