{"2411.11623": {"publish_time": "2024-11-18", "title": "Federated Incremental Named Entity Recognition", "paper_summary": "Federated Named Entity Recognition (FNER) boosts model training within each\nlocal client by aggregating the model updates of decentralized local clients,\nwithout sharing their private data. However, existing FNER methods assume fixed\nentity types and local clients in advance, leading to their ineffectiveness in\npractical applications. In a more realistic scenario, local clients receive new\nentity types continuously, while new local clients collecting novel data may\nirregularly join the global FNER training. This challenging setup, referred to\nhere as Federated Incremental NER, renders the global model suffering from\nheterogeneous forgetting of old entity types from both intra-client and\ninter-client perspectives. To overcome these challenges, we propose a\nLocal-Global Forgetting Defense (LGFD) model. Specifically, to address\nintra-client forgetting, we develop a structural knowledge distillation loss to\nretain the latent space's feature structure and a pseudo-label-guided\ninter-type contrastive loss to enhance discriminative capability over different\nentity types, effectively preserving previously learned knowledge within local\nclients. To tackle inter-client forgetting, we propose a task switching monitor\nthat can automatically identify new entity types under privacy protection and\nstore the latest old global model for knowledge distillation and\npseudo-labeling. Experiments demonstrate significant improvement of our LGFD\nmodel over comparison methods.", "paper_summary_zh": "聯邦命名實體識別 (FNER) 透過彙總分散式本地用戶端的模型更新，在每個本地用戶端內提升模型訓練，而無需分享他們的私人資料。然而，現有的 FNER 方法預先假設固定的實體類型和本地用戶端，導致它們在實際應用中效率不彰。在更實際的場景中，本地用戶端會持續接收新的實體類型，而收集新資料的新本地用戶端可能會不定期加入全球 FNER 訓練。此具有挑戰性的設定，在此稱為聯邦增量 NER，會使全球模型遭受來自用戶端內部和用戶端之間觀點的舊實體類型異質性遺忘。為了克服這些挑戰，我們提出了一個局部-全局遺忘防禦 (LGFD) 模型。具體來說，為了解決用戶端內部遺忘，我們開發了一個結構知識蒸餾損失，以保留潛在空間的特徵結構，以及一個偽標籤引導的類型間對比損失，以增強對不同實體類型的辨別能力，有效地保留先前在本地用戶端中學習到的知識。為了應對用戶端之間的遺忘，我們提出了一個任務切換監控器，它可以在隱私保護下自動識別新的實體類型，並儲存最新的舊全局模型，以進行知識蒸餾和偽標籤。實驗證明了我們的 LGFD 模型比比較方法有顯著的改進。", "author": "Duzhen Zhang et.al.", "authors": "Duzhen Zhang, Yahan Yu, Chenxing Li, Jiahua Dong, Dong Yu", "id": "2411.11623v1", "paper_url": "http://arxiv.org/abs/2411.11623v1", "repo": "null"}}