{"2407.02122": {"publish_time": "2024-07-02", "title": "Fake News Detection: It's All in the Data!", "paper_summary": "This comprehensive survey serves as an indispensable resource for researchers\nembarking on the journey of fake news detection. By highlighting the pivotal\nrole of dataset quality and diversity, it underscores the significance of these\nelements in the effectiveness and robustness of detection models. The survey\nmeticulously outlines the key features of datasets, various labeling systems\nemployed, and prevalent biases that can impact model performance. Additionally,\nit addresses critical ethical issues and best practices, offering a thorough\noverview of the current state of available datasets. Our contribution to this\nfield is further enriched by the provision of GitHub repository, which\nconsolidates publicly accessible datasets into a single, user-friendly portal.\nThis repository is designed to facilitate and stimulate further research and\ndevelopment efforts aimed at combating the pervasive issue of fake news.", "paper_summary_zh": "這份全面的調查是研究人員踏上辨識假新聞之旅時不可或缺的資源。它強調了資料集品質與多樣性的關鍵角色，突顯出這些元素對於偵測模型的有效性和穩健性的重要性。這份調查仔細概述了資料集的主要特徵、所使用的各種標籤系統，以及可能影響模型效能的普遍偏差。此外，它還探討了關鍵的道德問題和最佳實務，提供了可用資料集現況的全面概述。我們對這個領域的貢獻，進一步透過提供 GitHub 儲存庫而得到豐富，該儲存庫將公開可存取的資料集整合到一個單一的、使用者友善的入口網站中。這個儲存庫旨在促進和激勵進一步的研究和開發工作，目標是打擊假新聞這個普遍的問題。", "author": "Soveatin Kuntur et.al.", "authors": "Soveatin Kuntur, Anna Wróblewska, Marcin Paprzycki, Maria Ganzha", "id": "2407.02122v1", "paper_url": "http://arxiv.org/abs/2407.02122v1", "repo": "null"}}