{"2407.11854": {"publish_time": "2024-07-16", "title": "Zero-shot Cross-Lingual Transfer for Synthetic Data Generation in Grammatical Error Detection", "paper_summary": "Grammatical Error Detection (GED) methods rely heavily on human annotated\nerror corpora. However, these annotations are unavailable in many low-resource\nlanguages. In this paper, we investigate GED in this context. Leveraging the\nzero-shot cross-lingual transfer capabilities of multilingual pre-trained\nlanguage models, we train a model using data from a diverse set of languages to\ngenerate synthetic errors in other languages. These synthetic error corpora are\nthen used to train a GED model. Specifically we propose a two-stage fine-tuning\npipeline where the GED model is first fine-tuned on multilingual synthetic data\nfrom target languages followed by fine-tuning on human-annotated GED corpora\nfrom source languages. This approach outperforms current state-of-the-art\nannotation-free GED methods. We also analyse the errors produced by our method\nand other strong baselines, finding that our approach produces errors that are\nmore diverse and more similar to human errors.", "paper_summary_zh": "語法錯誤偵測 (GED) 方法極度依賴人工標註的錯誤語料庫。然而，這些標註在許多低資源語言中並不可用。在本文中，我們研究此脈絡中的 GED。利用多語言預訓練語言模型的零次學習跨語言轉移能力，我們使用來自各種語言的資料訓練一個模型，以產生其他語言中的合成錯誤。這些合成錯誤語料庫接著用於訓練 GED 模型。具體來說，我們提出一個兩階段微調管道，其中 GED 模型首先針對目標語言的多語言合成資料進行微調，然後針對來源語言的人工標註 GED 語料庫進行微調。此方法優於目前最先進的無標註 GED 方法。我們也分析我們的模型和其他的強大基準所產生的錯誤，發現我們的模型所產生的錯誤更多元且更類似於人類的錯誤。", "author": "Gaetan Lopez Latouche et.al.", "authors": "Gaetan Lopez Latouche, Marc-André Carbonneau, Ben Swanson", "id": "2407.11854v1", "paper_url": "http://arxiv.org/abs/2407.11854v1", "repo": "null"}}