{"2501.12835": {"publish_time": "2025-01-22", "title": "Adaptive Retrieval Without Self-Knowledge? Bringing Uncertainty Back Home", "paper_summary": "Retrieval Augmented Generation (RAG) improves correctness of Question\nAnswering (QA) and addresses hallucinations in Large Language Models (LLMs),\nyet greatly increase computational costs. Besides, RAG is not always needed as\nmay introduce irrelevant information. Recent adaptive retrieval methods\nintegrate LLMs' intrinsic knowledge with external information appealing to LLM\nself-knowledge, but they often neglect efficiency evaluations and comparisons\nwith uncertainty estimation techniques. We bridge this gap by conducting a\ncomprehensive analysis of 35 adaptive retrieval methods, including 8 recent\napproaches and 27 uncertainty estimation techniques, across 6 datasets using 10\nmetrics for QA performance, self-knowledge, and efficiency. Our findings show\nthat uncertainty estimation techniques often outperform complex pipelines in\nterms of efficiency and self-knowledge, while maintaining comparable QA\nperformance.", "paper_summary_zh": "檢索增強生成（RAG）改善了問題回答（QA）的正確性，並解決了大型語言模型（LLM）中的幻覺，但大幅增加了運算成本。此外，RAG 並非總是需要，因為可能會引入無關資訊。最近的自適應檢索方法將 LLM 的內在知識與外部資訊整合，吸引 LLM 的自我知識，但它們常常忽略效率評估和與不確定性估計技術的比較。我們透過對 35 種自適應檢索方法進行全面分析來彌補此差距，其中包括 8 種近期方法和 27 種不確定性估計技術，使用 10 種量度衡量 6 個資料集的 QA 效能、自我知識和效率。我們的研究結果顯示，不確定性估計技術在效率和自我知識方面通常優於複雜的管道，同時維持相當的 QA 效能。", "author": "Viktor Moskvoretskii et.al.", "authors": "Viktor Moskvoretskii, Maria Lysyuk, Mikhail Salnikov, Nikolay Ivanov, Sergey Pletenev, Daria Galimzianova, Nikita Krayko, Vasily Konovalov, Irina Nikishina, Alexander Panchenko", "id": "2501.12835v1", "paper_url": "http://arxiv.org/abs/2501.12835v1", "repo": "null"}}