{"2412.20340": {"publish_time": "2024-12-29", "title": "Distilling Desired Comments for Enhanced Code Review with Large Language Models", "paper_summary": "There has been a growing interest in using Large Language Models (LLMs) for\ncode review thanks to their proven proficiency in code comprehension. The\nprimary objective of most review scenarios is to generate desired review\ncomments (DRCs) that explicitly identify issues to trigger code fixes. However,\nexisting LLM-based solutions are not so effective in generating DRCs for\nvarious reasons such as hallucination. To enhance their code review ability,\nthey need to be fine-tuned with a customized dataset that is ideally full of\nDRCs. Nevertheless, such a dataset is not yet available, while manual\nannotation of DRCs is too laborious to be practical. In this paper, we propose\na dataset distillation method, Desiview, which can automatically construct a\ndistilled dataset by identifying DRCs from a code review dataset. Experiments\non the CodeReviewer dataset comprising more than 150K review entries show that\nDesiview achieves an impressive performance of 88.93%, 80.37%, 86.67%, and\n84.44% in terms of Precision, Recall, Accuracy, and F1, respectively,\nsurpassing state-of-the-art methods. To validate the effect of such a distilled\ndataset on enhancing LLMs' code review ability, we first fine-tune the latest\nLLaMA series (i.e., LLaMA 3 and LLaMA 3.1) to build model Desiview4FT. We then\nenhance the model training effect through KTO alignment by feeding those review\ncomments identified as non-DRCs to the LLMs, resulting in model Desiview4FA.\nVerification results indicate that Desiview4FA slightly outperforms\nDesiview4FT, while both models have significantly improved against the base\nmodels in terms of generating DRCs. Human evaluation confirms that both models\nidentify issues more accurately and tend to generate review comments that\nbetter describe the issues contained in the code than the base LLMs do.", "paper_summary_zh": "<paragraph>由於大型語言模型 (LLM) 在程式碼理解方面已證明其能力，因此使用 LLM 進行程式碼檢閱的興趣日益增加。大多數檢閱情境的初階目標是產生明確指出問題以觸發程式碼修正的預期檢閱評論 (DRC)。然而，現有的基於 LLM 的解決方案由於幻覺等各種原因，在產生 DRC 方面並非如此有效。為了增強其程式碼檢閱能力，需要使用理想情況下充滿 DRC 的自訂資料集對其進行微調。儘管如此，此類資料集尚未推出，而 DRC 的手動註解又太過費力，不切實際。在本文中，我們提出了一種資料集萃取方法 Desiview，它可以透過從程式碼檢閱資料集中識別 DRC 來自動建構萃取的資料集。在包含超過 15 萬個檢閱條目的 CodeReviewer 資料集上進行的實驗表明，Desiview 在準確度、召回率、準確性和 F1 方面分別達到了令人印象深刻的 88.93%、80.37%、86.67% 和 84.44%，超越了最先進的方法。為了驗證此類萃取資料集對增強 LLM 程式碼檢閱能力的影響，我們首先微調了最新的 LLaMA 系列（即 LLaMA 3 和 LLaMA 3.1）來建構模型 Desiview4FT。然後，我們透過 KTO 對齊來增強模型訓練效果，方法是將那些被識別為非 DRC 的檢閱評論提供給 LLM，從而產生模型 Desiview4FA。驗證結果表明，Desiview4FA 略勝於 Desiview4FT，而這兩個模型在產生 DRC 方面都顯著優於基礎模型。人工評估證實，這兩個模型都能更準確地識別問題，並且傾向於產生比基礎 LLM 更能描述程式碼中所含問題的檢閱評論。</paragraph>", "author": "Yongda Yu et.al.", "authors": "Yongda Yu, Lei Zhang, Guoping Rong, Haifeng Shen, Jiahao Zhang, Haoxiang Yan, Guohao Shi, Dong Shao, Ruiqi Pan, Yuan Li, Qiushi Wang, Zhao Tian", "id": "2412.20340v1", "paper_url": "http://arxiv.org/abs/2412.20340v1", "repo": "null"}}