{"2407.02060": {"publish_time": "2024-07-02", "title": "Terminating Differentiable Tree Experts", "paper_summary": "We advance the recently proposed neuro-symbolic Differentiable Tree Machine,\nwhich learns tree operations using a combination of transformers and Tensor\nProduct Representations. We investigate the architecture and propose two key\ncomponents. We first remove a series of different transformer layers that are\nused in every step by introducing a mixture of experts. This results in a\nDifferentiable Tree Experts model with a constant number of parameters for any\narbitrary number of steps in the computation, compared to the previous method\nin the Differentiable Tree Machine with a linear growth. Given this flexibility\nin the number of steps, we additionally propose a new termination algorithm to\nprovide the model the power to choose how many steps to make automatically. The\nresulting Terminating Differentiable Tree Experts model sluggishly learns to\npredict the number of steps without an oracle. It can do so while maintaining\nthe learning capabilities of the model, converging to the optimal amount of\nsteps.", "paper_summary_zh": "我們進一步發展最近提出的神經符號可微分樹機，\n它使用Transformer和張量乘積表示的組合來學習樹操作。我們研究架構並提出兩個關鍵組成部分。我們首先移除一系列不同的Transformer層，這些層在每一步中通過引入專家組合使用。與可微分樹機中採用線性增長的先前方法相比，這導致可微分樹專家模型在任意數量的計算步驟中具有恆定的參數數量。由於步驟數具有這種靈活性，我們另外提出一個新的終止演算法，讓模型能夠自動選擇執行多少個步驟。由此產生的終止可微分樹專家模型緩慢地學習預測步驟數，而無需預言機。它可以在執行此操作的同時維持模型的學習能力，收斂到最佳步驟數。", "author": "Jonathan Thomm et.al.", "authors": "Jonathan Thomm, Michael Hersche, Giacomo Camposampiero, Aleksandar Terzić, Bernhard Schölkopf, Abbas Rahimi", "id": "2407.02060v1", "paper_url": "http://arxiv.org/abs/2407.02060v1", "repo": "null"}}