{"2408.11800": {"publish_time": "2024-08-21", "title": "PermitQA: A Benchmark for Retrieval Augmented Generation in Wind Siting and Permitting domain", "paper_summary": "In the rapidly evolving landscape of Natural Language Processing (NLP) and\ntext generation, the emergence of Retrieval Augmented Generation (RAG) presents\na promising avenue for improving the quality and reliability of generated text\nby leveraging information retrieved from user specified database. Benchmarking\nis essential to evaluate and compare the performance of the different RAG\nconfigurations in terms of retriever and generator, providing insights into\ntheir effectiveness, scalability, and suitability for the specific domain and\napplications. In this paper, we present a comprehensive framework to generate a\ndomain relevant RAG benchmark. Our framework is based on automatic\nquestion-answer generation with Human (domain experts)-AI Large Language Model\n(LLM) teaming. As a case study, we demonstrate the framework by introducing\nPermitQA, a first-of-its-kind benchmark on the wind siting and permitting\ndomain which comprises of multiple scientific documents/reports related to\nenvironmental impact of wind energy projects. Our framework systematically\nevaluates RAG performance using diverse metrics and multiple question types\nwith varying complexity level. We also demonstrate the performance of different\nmodels on our benchmark.", "paper_summary_zh": "在自然語言處理 (NLP) 和文本生成快速演進的領域中，檢索增強生成 (RAG) 的出現提供了一個有前景的方法，透過利用從使用者指定的資料庫中檢索的資訊來提升生成文字的品質和可靠性。基準測試對於評估和比較不同 RAG 組態在檢索器和生成器方面的效能至關重要，提供對其在特定領域和應用中的有效性、可擴充性和適用性的見解。在本文中，我們提出一個全面的架構來產生與領域相關的 RAG 基準測試。我們的架構基於自動問答生成，由人類 (領域專家) 和大型語言模型 (LLM) 團隊合作。作為一個案例研究，我們透過介紹 PermitQA 來展示這個架構，PermitQA 是第一個針對風場選址和許可領域的基準測試，其中包含多份與風能專案環境影響相關的科學文件/報告。我們的架構使用不同的指標和多種類型的問題，並具有不同的複雜程度，系統性地評估 RAG 效能。我們還在我們的基準測試中展示了不同模型的效能。", "author": "Rounak Meyur et.al.", "authors": "Rounak Meyur, Hung Phan, Sridevi Wagle, Jan Strube, Mahantesh Halappanavar, Sameera Horawalavithana, Anurag Acharya, Sai Munikoti", "id": "2408.11800v1", "paper_url": "http://arxiv.org/abs/2408.11800v1", "repo": "null"}}