{"2407.14229": {"publish_time": "2024-07-19", "title": "Words2Contact: Identifying Support Contacts from Verbal Instructions Using Foundation Models", "paper_summary": "This paper presents Words2Contact, a language-guided multi-contact placement\npipeline leveraging large language models and vision language models. Our\nmethod is a key component for language-assisted teleoperation and human-robot\ncooperation, where human operators can instruct the robots where to place their\nsupport contacts before whole-body reaching or manipulation using natural\nlanguage. Words2Contact transforms the verbal instructions of a human operator\ninto contact placement predictions; it also deals with iterative corrections,\nuntil the human is satisfied with the contact location identified in the\nrobot's field of view. We benchmark state-of-the-art LLMs and VLMs for size and\nperformance in contact prediction. We demonstrate the effectiveness of the\niterative correction process, showing that users, even naive, quickly learn how\nto instruct the system to obtain accurate locations. Finally, we validate\nWords2Contact in real-world experiments with the Talos humanoid robot,\ninstructed by human operators to place support contacts on different locations\nand surfaces to avoid falling when reaching for distant objects.", "paper_summary_zh": "本文提出 Words2Contact，一種利用大型語言模型和視覺語言模型的語言導向多接觸點放置管道。我們的\n方法是語言輔助遙控操作和人機協作的一個關鍵組成部分，其中人類操作員可以使用自然\n語言指導機器人在全身接觸或操作之前放置其支撐接觸點的位置。Words2Contact 將人類操作員的口頭指令轉換為接觸點放置預測；它還處理迭代更正，\n直到人類對機器人視野中識別的接觸點位置感到滿意為止。我們對最先進的 LLM 和 VLM 的大小和\n接觸點預測性能進行基準測試。我們展示了迭代更正過程的有效性，表明用戶，即使是新手，也能快速學會\n如何指導系統獲取準確的位置。最後，我們在 Talos 類人機器人的真實世界實驗中驗證了 Words2Contact，\n由人類操作員指導它在不同的位置和表面放置支撐接觸點，以避免在接觸遠處物體時摔倒。", "author": "Dionis Totsila et.al.", "authors": "Dionis Totsila, Quentin Rouxel, Jean-Baptiste Mouret, Serena Ivaldi", "id": "2407.14229v1", "paper_url": "http://arxiv.org/abs/2407.14229v1", "repo": "null"}}