{"2407.00104": {"publish_time": "2024-06-27", "title": "AI-Driven Skin Cancer Diagnosis: Grad-CAM and Expert Annotations for Enhanced Interpretability", "paper_summary": "An AI tool has been developed to provide interpretable support for the\ndiagnosis of BCC via teledermatology, thus speeding up referrals and optimizing\nresource utilization. The interpretability is provided in two ways: on the one\nhand, the main BCC dermoscopic patterns are found in the image to justify the\nBCC/Non BCC classification. Secondly, based on the common visual XAI Grad-CAM,\na clinically inspired visual explanation is developed where the relevant\nfeatures for diagnosis are located. Since there is no established ground truth\nfor BCC dermoscopic features, a standard reference is inferred from the\ndiagnosis of four dermatologists using an Expectation Maximization (EM) based\nalgorithm. The results demonstrate significant improvements in classification\naccuracy and interpretability, positioning this approach as a valuable tool for\nearly BCC detection and referral to dermatologists. The BCC/non-BCC\nclassification achieved an accuracy rate of 90%. For Clinically-inspired XAI\nresults, the detection of BCC patterns useful to clinicians reaches 99%\naccuracy. As for the Clinically-inspired Visual XAI results, the mean of the\nGrad-CAM normalized value within the manually segmented clinical features is\n0.57, while outside this region it is 0.16. This indicates that the model\nstruggles to accurately identify the regions of the BCC patterns. These results\nprove the ability of the AI tool to provide a useful explanation.", "paper_summary_zh": "<paragraph>已開發出 AI 工具，透過遠距皮膚科提供可解釋的支援以診斷 BCC，進而加速轉診並優化資源利用。可解釋性透過兩種方式提供：一方面，在影像中找到主要的 BCC 皮膚鏡模式以證明 BCC/非 BCC 分類。其次，根據常見的視覺 XAI Grad-CAM，開發出以臨床為靈感的視覺說明，說明診斷相關特徵的位置。由於 BCC 皮膚鏡特徵沒有既定的基本事實，因此從四位皮膚科醫師的診斷推論出標準參考，使用基於期望最大化 (EM) 的演算法。結果顯示分類準確度和可解釋性有顯著改善，將此方法定位為早期 BCC 偵測和轉診給皮膚科醫師的寶貴工具。BCC/非 BCC 分類達到 90% 的準確率。對於以臨床為靈感的 XAI 結果，偵測對臨床醫師有用的 BCC 模式達到 99% 的準確率。至於以臨床為靈感的視覺 XAI 結果，手動分割的臨床特徵中 Grad-CAM 標準化值的平均值為 0.57，而此區域外的平均值為 0.16。這表示模型難以準確辨識 BCC 模式的區域。這些結果證明 AI 工具有能力提供有用的說明。</paragraph>", "author": "Iván Matas et.al.", "authors": "Iván Matas, Carmen Serrano, Francisca Silva, Amalia Serrano, Tomás Toledo-Pastrana, Begoña Acha", "id": "2407.00104v1", "paper_url": "http://arxiv.org/abs/2407.00104v1", "repo": "null"}}