{"2408.09819": {"publish_time": "2024-08-19", "title": "CMoralEval: A Moral Evaluation Benchmark for Chinese Large Language Models", "paper_summary": "What a large language model (LLM) would respond in ethically relevant\ncontext? In this paper, we curate a large benchmark CMoralEval for morality\nevaluation of Chinese LLMs. The data sources of CMoralEval are two-fold: 1) a\nChinese TV program discussing Chinese moral norms with stories from the society\nand 2) a collection of Chinese moral anomies from various newspapers and\nacademic papers on morality. With these sources, we aim to create a moral\nevaluation dataset characterized by diversity and authenticity. We develop a\nmorality taxonomy and a set of fundamental moral principles that are not only\nrooted in traditional Chinese culture but also consistent with contemporary\nsocietal norms. To facilitate efficient construction and annotation of\ninstances in CMoralEval, we establish a platform with AI-assisted instance\ngeneration to streamline the annotation process. These help us curate\nCMoralEval that encompasses both explicit moral scenarios (14,964 instances)\nand moral dilemma scenarios (15,424 instances), each with instances from\ndifferent data sources. We conduct extensive experiments with CMoralEval to\nexamine a variety of Chinese LLMs. Experiment results demonstrate that\nCMoralEval is a challenging benchmark for Chinese LLMs. The dataset is publicly\navailable at \\url{https://github.com/tjunlp-lab/CMoralEval}.", "paper_summary_zh": "大型語言模型 (LLM) 在道德相關的語境中會如何回應？在本文中，我們策劃了一個大型基準 CMoralEval，用於評估中文 LLM 的道德標準。CMoralEval 的數據來源有兩個：1) 一個討論中國社會道德規範的中文電視節目，以及 2) 一些來自各種報紙和道德學術論文的中文道德規範異常現象。有了這些來源，我們希望創建一個以多樣性和真實性為特徵的道德評估數據集。我們制定了一個道德分類法和一套基本道德原則，這些原則不僅根植於傳統的中國文化，而且與當代社會規範一致。為了促進 CMoralEval 中實例的高效構建和註解，我們建立了一個具有 AI 輔助實例生成功能的平台，以簡化註解過程。這些幫助我們策劃了 CMoralEval，其中既包含明確的道德場景（14,964 個實例），又包含道德困境場景（15,424 個實例），每個實例都來自不同的數據源。我們使用 CMoralEval 進行了廣泛的實驗，以檢驗各種中文 LLM。實驗結果表明，CMoralEval 是中文 LLM 的一個具有挑戰性的基準。該數據集可在 \\url{https://github.com/tjunlp-lab/CMoralEval} 公開獲得。", "author": "Linhao Yu et.al.", "authors": "Linhao Yu, Yongqi Leng, Yufei Huang, Shang Wu, Haixin Liu, Xinmeng Ji, Jiahui Zhao, Jinwang Song, Tingting Cui, Xiaoqing Cheng, Tao Liu, Deyi Xiong", "id": "2408.09819v1", "paper_url": "http://arxiv.org/abs/2408.09819v1", "repo": "null"}}