{"2406.16828": {"publish_time": "2024-06-24", "title": "Ragnarök: A Reusable RAG Framework and Baselines for TREC 2024 Retrieval-Augmented Generation Track", "paper_summary": "Did you try out the new Bing Search? Or maybe you fiddled around with Google\nAI~Overviews? These might sound familiar because the modern-day search stack\nhas recently evolved to include retrieval-augmented generation (RAG) systems.\nThey allow searching and incorporating real-time data into large language\nmodels (LLMs) to provide a well-informed, attributed, concise summary in\ncontrast to the traditional search paradigm that relies on displaying a ranked\nlist of documents. Therefore, given these recent advancements, it is crucial to\nhave an arena to build, test, visualize, and systematically evaluate RAG-based\nsearch systems. With this in mind, we propose the TREC 2024 RAG Track to foster\ninnovation in evaluating RAG systems. In our work, we lay out the steps we've\nmade towards making this track a reality -- we describe the details of our\nreusable framework, Ragnar\\\"ok, explain the curation of the new MS MARCO V2.1\ncollection choice, release the development topics for the track, and\nstandardize the I/O definitions which assist the end user. Next, using\nRagnar\\\"ok, we identify and provide key industrial baselines such as OpenAI's\nGPT-4o or Cohere's Command R+. Further, we introduce a web-based user interface\nfor an interactive arena allowing benchmarking pairwise RAG systems by\ncrowdsourcing. We open-source our Ragnar\\\"ok framework and baselines to achieve\na unified standard for future RAG systems.", "paper_summary_zh": "<paragraph>您試用過新的 Bing 搜尋嗎？或者您可能使用過 Google AI~概覽？這些聽起來可能很熟悉，因為現代搜尋堆疊最近已演進到包含檢索增強生成 (RAG) 系統。它們允許搜尋並將即時資料納入大型語言模型 (LLM)，以提供充分資訊、有依據、簡潔的摘要，這與依賴顯示文件排名清單的傳統搜尋模式形成對比。因此，鑑於這些最近的進展，建立一個用於建置、測試、視覺化和系統性評估基於 RAG 的搜尋系統的領域至關重要。有鑑於此，我們提議 TREC 2024 RAG 軌道來促進評估 RAG 系統的創新。在我們的研究中，我們概述了我們為讓此軌道成為現實而採取的步驟——我們描述了我們的可重複使用框架 Ragnar\\\"ok 的詳細資訊，說明新 MS MARCO V2.1 蒐集選擇的策展，釋出此軌道的開發主題，並標準化有助於最終使用者的 I/O 定義。接下來，使用 Ragnar\\\"ok，我們識別並提供關鍵產業基準，例如 OpenAI 的 GPT-4o 或 Cohere 的 Command R+。此外，我們為互動式領域引進一個基於網路的使用者介面，允許透過群眾外包對成對的 RAG 系統進行基準測試。我們開放原始碼的 Ragnar\\\"ok 框架和基準，以達成未來 RAG 系統的統一標準。</paragraph>", "author": "Ronak Pradeep et.al.", "authors": "Ronak Pradeep, Nandan Thakur, Sahel Sharifymoghaddam, Eric Zhang, Ryan Nguyen, Daniel Campos, Nick Craswell, Jimmy Lin", "id": "2406.16828v1", "paper_url": "http://arxiv.org/abs/2406.16828v1", "repo": "null"}}