{"2410.03568": {"publish_time": "2024-10-04", "title": "Towards Linguistically-Aware and Language-Independent Tokenization for Large Language Models (LLMs)", "paper_summary": "This paper presents a comprehensive study on the tokenization techniques\nemployed by state-of-the-art large language models (LLMs) and their\nimplications on the cost and availability of services across different\nlanguages, especially low resource languages. The analysis considers multiple\nLLMs, including GPT-4 (using cl100k_base embeddings), GPT-3 (with p50k_base\nembeddings), and DaVinci (employing r50k_base embeddings), as well as the\nwidely used BERT base tokenizer. The study evaluates the tokenization\nvariability observed across these models and investigates the challenges of\nlinguistic representation in subword tokenization. The research underscores the\nimportance of fostering linguistically-aware development practices, especially\nfor languages that are traditionally under-resourced. Moreover, this paper\nintroduces case studies that highlight the real-world implications of\ntokenization choices, particularly in the context of electronic health record\n(EHR) systems. This research aims to promote generalizable Internationalization\n(I18N) practices in the development of AI services in this domain and beyond,\nwith a strong emphasis on inclusivity, particularly for languages traditionally\nunderrepresented in AI applications.", "paper_summary_zh": "本文對最先進大型語言模型 (LLM) 所採用的標記化技術進行了全面研究，並探討了這些技術對不同語言（尤其是低資源語言）服務的成本和可用性的影響。分析考量了多個 LLM，包括 GPT-4（使用 cl100k_base 嵌入）、GPT-3（使用 p50k_base 嵌入）和 DaVinci（使用 r50k_base 嵌入），以及廣泛使用的 BERT 基礎標記器。研究評估了這些模型中觀察到的標記化變異性，並探討了詞彙化標記化中語言表示的挑戰。研究強調了培養語言感知開發實務的重要性，特別是對於傳統上資源不足的語言。此外，本文介紹了案例研究，重點說明標記化選擇的實際影響，特別是在電子健康紀錄 (EHR) 系統的背景下。本研究旨在推廣此領域（及其他領域）AI 服務開發中可概化的國際化 (I18N) 實務，並特別強調包容性，特別是對於傳統上在 AI 應用中代表性不足的語言。", "author": "Abrar Rahman et.al.", "authors": "Abrar Rahman, Garry Bowlin, Binit Mohanty, Sean McGunigal", "id": "2410.03568v1", "paper_url": "http://arxiv.org/abs/2410.03568v1", "repo": "null"}}