{"2410.08133": {"publish_time": "2024-10-10", "title": "Assessing Episodic Memory in LLMs with Sequence Order Recall Tasks", "paper_summary": "Current LLM benchmarks focus on evaluating models' memory of facts and\nsemantic relations, primarily assessing semantic aspects of long-term memory.\nHowever, in humans, long-term memory also includes episodic memory, which links\nmemories to their contexts, such as the time and place they occurred. The\nability to contextualize memories is crucial for many cognitive tasks and\neveryday functions. This form of memory has not been evaluated in LLMs with\nexisting benchmarks. To address the gap in evaluating memory in LLMs, we\nintroduce Sequence Order Recall Tasks (SORT), which we adapt from tasks used to\nstudy episodic memory in cognitive psychology. SORT requires LLMs to recall the\ncorrect order of text segments, and provides a general framework that is both\neasily extendable and does not require any additional annotations. We present\nan initial evaluation dataset, Book-SORT, comprising 36k pairs of segments\nextracted from 9 books recently added to the public domain. Based on a human\nexperiment with 155 participants, we show that humans can recall sequence order\nbased on long-term memory of a book. We find that models can perform the task\nwith high accuracy when relevant text is given in-context during the SORT\nevaluation. However, when presented with the book text only during training,\nLLMs' performance on SORT falls short. By allowing to evaluate more aspects of\nmemory, we believe that SORT will aid in the emerging development of\nmemory-augmented models.", "paper_summary_zh": "現有的 LLM 基準側重於評估模型對事實和語義關係的記憶，主要評估長期記憶的語義方面。然而，在人類中，長期記憶也包括情節記憶，它將記憶與其背景聯繫起來，例如它們發生的時間和地點。將記憶情境化的能力對於許多認知任務和日常功能至關重要。這種形式的記憶尚未在現有基準中使用 LLM 進行評估。為了解決評估 LLM 中記憶的差距，我們引入了序列順序召回任務 (SORT)，我們根據用於研究認知心理學中情節記憶的任務對其進行了改編。SORT 要求 LLM 召回文本片段的正確順序，並提供了一個既容易擴展又不需要任何額外註釋的通用框架。我們提出了初始評估數據集 Book-SORT，其中包含從最近添加到公共領域的 9 本書中提取的 36k 對片段。根據對 155 名參與者的實驗，我們表明人類可以根據一本書的長期記憶來回憶序列順序。我們發現，當在 SORT 評估期間在上下文中給出相關文本時，模型可以非常準確地執行任務。然而，當在訓練期間僅提供書籍文本時，LLM 在 SORT 上的表現會下降。通過允許評估記憶的更多方面，我們相信 SORT 將有助於記憶增強模型的新興發展。", "author": "Mathis Pink et.al.", "authors": "Mathis Pink, Vy A. Vo, Qinyuan Wu, Jianing Mu, Javier S. Turek, Uri Hasson, Kenneth A. Norman, Sebastian Michelmann, Alexander Huth, Mariya Toneva", "id": "2410.08133v1", "paper_url": "http://arxiv.org/abs/2410.08133v1", "repo": "null"}}