{"2407.06862": {"publish_time": "2024-07-09", "title": "Trust and Resilience in Federated Learning Through Smart Contracts Enabled Decentralized Systems", "paper_summary": "In this paper, we present a study of a Federated Learning (FL) system, based\non the use of decentralized architectures to ensure trust and increase\nreliability. The system is based on the idea that the FL collaborators upload\nthe (ciphered) model parameters on the Inter-Planetary File System (IPFS) and\ninteract with a dedicated smart contract to track their behavior. Thank to this\nsmart contract, the phases of parameter updates are managed efficiently,\nthereby strengthening data security. We have carried out an experimental study\nthat exploits two different methods of weight aggregation, i.e., a classic\naveraging scheme and a federated proximal aggregation. The results confirm the\nfeasibility of the proposal.", "paper_summary_zh": "在本文中，我們提出了一個聯合學習 (FL) 系統的研究，它基於分散式架構的使用，以確保信任並提高可靠性。該系統基於這樣的想法：FL 協作者將（密碼）模型參數上傳到星際檔案系統 (IPFS) 並與專用智慧合約互動以追蹤其行為。感謝這個智慧合約，參數更新階段得到有效管理，從而加強了資料安全性。我們進行了一項實驗研究，利用了兩種不同的權重聚合方法，即經典平均方案和聯合近端聚合。結果證實了該提案的可行性。", "author": "Lorenzo Cassano et.al.", "authors": "Lorenzo Cassano, Jacopo D'Abramo, Siraj Munir, Stefano Ferretti", "id": "2407.06862v1", "paper_url": "http://arxiv.org/abs/2407.06862v1", "repo": "null"}}