{"2406.17972": {"publish_time": "2024-06-25", "title": "LABOR-LLM: Language-Based Occupational Representations with Large Language Models", "paper_summary": "Many empirical studies of labor market questions rely on estimating\nrelatively simple predictive models using small, carefully constructed\nlongitudinal survey datasets based on hand-engineered features. Large Language\nModels (LLMs), trained on massive datasets, encode vast quantities of world\nknowledge and can be used for the next job prediction problem. However, while\nan off-the-shelf LLM produces plausible career trajectories when prompted, the\nprobability with which an LLM predicts a particular job transition conditional\non career history will not, in general, align with the true conditional\nprobability in a given population. Recently, Vafa et al. (2024) introduced a\ntransformer-based \"foundation model\", CAREER, trained using a large,\nunrepresentative resume dataset, that predicts transitions between jobs; it\nfurther demonstrated how transfer learning techniques can be used to leverage\nthe foundation model to build better predictive models of both transitions and\nwages that reflect conditional transition probabilities found in nationally\nrepresentative survey datasets. This paper considers an alternative where the\nfine-tuning of the CAREER foundation model is replaced by fine-tuning LLMs. For\nthe task of next job prediction, we demonstrate that models trained with our\napproach outperform several alternatives in terms of predictive performance on\nthe survey data, including traditional econometric models, CAREER, and LLMs\nwith in-context learning, even though the LLM can in principle predict job\ntitles that are not allowed in the survey data. Further, we show that our\nfine-tuned LLM-based models' predictions are more representative of the career\ntrajectories of various workforce subpopulations than off-the-shelf LLM models\nand CAREER. We conduct experiments and analyses that highlight the sources of\nthe gains in the performance of our models for representative predictions.", "paper_summary_zh": "許多勞動市場問題的實證研究依賴於估計相對簡單的預測模型，這些模型使用基於手工特徵的小型、仔細建構的縱向調查資料集。大型語言模型 (LLM) 在大量資料集上訓練，編碼了大量的世界知識，可用於下一個工作預測問題。然而，雖然現成的 LLM 在提示下會產生合理的職業軌跡，但 LLM 預測特定工作轉換的機率，以職業歷史為條件，通常不會與特定人口中的真實條件機率一致。最近，Vafa 等人 (2024) 介紹了一個基於Transformer的「基礎模型」CAREER，使用大型、非代表性履歷資料集進行訓練，預測工作之間的轉換；它進一步展示了如何使用遷移學習技術來利用基礎模型建立更好的轉換和工資預測模型，以反映在全國代表性調查資料集中發現的條件轉換機率。本文考慮了一個替代方案，其中 CAREER 基礎模型的微調被微調 LLM 取代。對於下一個工作預測任務，我們證明使用我們的方法訓練的模型在預測效能方面優於幾種替代方案，包括傳統計量經濟模型、CAREER 和具有情境學習的 LLM，即使 LLM 原則上可以預測調查資料中不允許的職稱。此外，我們表明，我們微調後的基於 LLM 的模型的預測比現成的 LLM 模型和 CAREER 更能代表各種勞動力子群體的職業軌跡。我們進行實驗和分析，重點說明我們模型在代表性預測效能方面獲得提升的來源。", "author": "Tianyu Du et.al.", "authors": "Tianyu Du, Ayush Kanodia, Herman Brunborg, Keyon Vafa, Susan Athey", "id": "2406.17972v1", "paper_url": "http://arxiv.org/abs/2406.17972v1", "repo": "null"}}