{"2407.19340": {"publish_time": "2024-07-27", "title": "Integrating Large Language Models into a Tri-Modal Architecture for Automated Depression Classification", "paper_summary": "Major Depressive Disorder (MDD) is a pervasive mental health condition that\naffects 300 million people worldwide. This work presents a novel, BiLSTM-based\ntri-modal model-level fusion architecture for the binary classification of\ndepression from clinical interview recordings. The proposed architecture\nincorporates Mel Frequency Cepstral Coefficients, Facial Action Units, and uses\na two-shot learning based GPT-4 model to process text data. This is the first\nwork to incorporate large language models into a multi-modal architecture for\nthis task. It achieves impressive results on the DAIC-WOZ AVEC 2016 Challenge\ncross-validation split and Leave-One-Subject-Out cross-validation split,\nsurpassing all baseline models and multiple state-of-the-art models. In\nLeave-One-Subject-Out testing, it achieves an accuracy of 91.01%, an F1-Score\nof 85.95%, a precision of 80%, and a recall of 92.86%.", "paper_summary_zh": "重度憂鬱症 (MDD) 是一種普遍的精神健康疾病，\n影響全球 3 億人。這項工作提出了一種新穎的、基於 BiLSTM\n的三模態模型級融合架構，用於從臨床訪談錄音中對憂鬱症進行二元分類。所提出的架構\n結合了梅爾頻率倒譜係數、面部動作單元，並使用基於 GPT-4 的兩次學習模型來處理文本數據。這是第一個\n將大型語言模型納入多模態架構以執行此任務的工作。它在 DAIC-WOZ AVEC 2016 挑戰賽\n交叉驗證分割和留一受試者交叉驗證分割中取得了令人印象深刻的結果，超越了所有基線模型和多個最先進的模型。在\n留一受試者測試中，它的準確率達到 91.01%，F1 分數\n為 85.95%，準確度為 80%，召回率為 92.86%。", "author": "Santosh V. Patapati et.al.", "authors": "Santosh V. Patapati", "id": "2407.19340v1", "paper_url": "http://arxiv.org/abs/2407.19340v1", "repo": "null"}}