{"2406.15279": {"publish_time": "2024-06-21", "title": "Cross-Modality Safety Alignment", "paper_summary": "As Artificial General Intelligence (AGI) becomes increasingly integrated into\nvarious facets of human life, ensuring the safety and ethical alignment of such\nsystems is paramount. Previous studies primarily focus on single-modality\nthreats, which may not suffice given the integrated and complex nature of\ncross-modality interactions. We introduce a novel safety alignment challenge\ncalled Safe Inputs but Unsafe Output (SIUO) to evaluate cross-modality safety\nalignment. Specifically, it considers cases where single modalities are safe\nindependently but could potentially lead to unsafe or unethical outputs when\ncombined. To empirically investigate this problem, we developed the SIUO, a\ncross-modality benchmark encompassing 9 critical safety domains, such as\nself-harm, illegal activities, and privacy violations. Our findings reveal\nsubstantial safety vulnerabilities in both closed- and open-source LVLMs, such\nas GPT-4V and LLaVA, underscoring the inadequacy of current models to reliably\ninterpret and respond to complex, real-world scenarios.", "paper_summary_zh": "隨著人工通用智慧 (AGI) 日益融入人類生活的各個方面，確保此類系統的安全性和道德一致性至關重要。先前的研究主要著重於單一模式的威脅，但這可能不足以應對跨模式互動的整合和複雜性質。我們引入了一個名為「安全輸入但輸出不安全」(SIUO) 的新安全一致性挑戰，以評估跨模式安全一致性。具體來說，它考慮了單一模式獨立安全，但組合時可能會導致不安全或不道德輸出的情況。為了實證研究此問題，我們開發了 SIUO，這是一個跨模式基準測試，涵蓋 9 個關鍵安全領域，例如自殘、非法活動和隱私侵犯。我們的研究結果揭示了閉源和開源 LVLMs（例如 GPT-4V 和 LLaVA）中存在大量安全漏洞，這凸顯了當前模型在可靠地解釋和回應複雜的現實世界場景方面的不足。", "author": "Siyin Wang et.al.", "authors": "Siyin Wang, Xingsong Ye, Qinyuan Cheng, Junwen Duan, Shimin Li, Jinlan Fu, Xipeng Qiu, Xuanjing Huang", "id": "2406.15279v1", "paper_url": "http://arxiv.org/abs/2406.15279v1", "repo": "https://github.com/sinwang20/siuo"}}