{"2407.07304": {"publish_time": "2024-07-10", "title": "Inference Performance Optimization for Large Language Models on CPUs", "paper_summary": "Large language models (LLMs) have shown exceptional performance and vast\npotential across diverse tasks. However, the deployment of LLMs with high\nperformance in low-resource environments has garnered significant attention in\nthe industry. When GPU hardware resources are limited, we can explore\nalternative options on CPUs. To mitigate the financial burden and alleviate\nconstraints imposed by hardware resources, optimizing inference performance is\nnecessary. In this paper, we introduce an easily deployable inference\nperformance optimization solution aimed at accelerating LLMs on CPUs. In this\nsolution, we implement an effective way to reduce the KV cache size while\nensuring precision. We propose a distributed inference optimization approach\nand implement it based on oneAPI Collective Communications Library.\nFurthermore, we propose optimization approaches for LLMs on CPU, and conduct\ntailored optimizations for the most commonly used models. The code is\nopen-sourced at https://github.com/intel/xFasterTransformer.", "paper_summary_zh": "大型語言模型 (LLM) 在各種任務中展現出非凡的效能和廣泛的潛力。然而，在低資源環境中部署高效能的 LLM 已引起業界的極大關注。當 GPU 硬體資源有限時，我們可以在 CPU 上探索其他選項。為了減輕財務負擔並緩解硬體資源帶來的限制，最佳化推理效能是必要的。在本文中，我們介紹了一個易於部署的推理效能最佳化解決方案，旨在加速 CPU 上的 LLM。在此解決方案中，我們實作了一種有效的方法來減少 KV 快取大小，同時確保精確度。我們提出了一種分散式推理最佳化方法，並根據 oneAPI Collective Communications Library 來實作它。此外，我們提出了針對 CPU 上 LLM 的最佳化方法，並針對最常用的模型進行客製化最佳化。程式碼已在 https://github.com/intel/xFasterTransformer 開源。", "author": "Pujiang He et.al.", "authors": "Pujiang He, Shan Zhou, Wenhuan Huang, Changqing Li, Duyi Wang, Bin Guo, Chen Meng, Sheng Gui, Weifei Yu, Yi Xie", "id": "2407.07304v1", "paper_url": "http://arxiv.org/abs/2407.07304v1", "repo": "https://github.com/intel/xfastertransformer"}}