{"2501.15791": {"publish_time": "2025-01-27", "title": "Harnessing Diverse Perspectives: A Multi-Agent Framework for Enhanced Error Detection in Knowledge Graphs", "paper_summary": "Knowledge graphs are widely used in industrial applications, making error\ndetection crucial for ensuring the reliability of downstream applications.\nExisting error detection methods often fail to effectively leverage\nfine-grained subgraph information and rely solely on fixed graph structures,\nwhile also lacking transparency in their decision-making processes, which\nresults in suboptimal detection performance. In this paper, we propose a novel\nMulti-Agent framework for Knowledge Graph Error Detection (MAKGED) that\nutilizes multiple large language models (LLMs) in a collaborative setting. By\nconcatenating fine-grained, bidirectional subgraph embeddings with LLM-based\nquery embeddings during training, our framework integrates these\nrepresentations to produce four specialized agents. These agents utilize\nsubgraph information from different dimensions to engage in multi-round\ndiscussions, thereby improving error detection accuracy and ensuring a\ntransparent decision-making process. Extensive experiments on FB15K and WN18RR\ndemonstrate that MAKGED outperforms state-of-the-art methods, enhancing the\naccuracy and robustness of KG evaluation. For specific industrial scenarios,\nour framework can facilitate the training of specialized agents using\ndomain-specific knowledge graphs for error detection, which highlights the\npotential industrial application value of our framework. Our code and datasets\nare available at https://github.com/kse-ElEvEn/MAKGED.", "paper_summary_zh": "知識圖譜廣泛應用於工業應用中，使得錯誤偵測對於確保下游應用的可靠性至關重要。現有的錯誤偵測方法通常無法有效利用細粒度的子圖資訊，並且僅依賴於固定的圖形結構，同時在它們的決策過程中也缺乏透明度，這導致次佳的偵測效能。在本文中，我們提出了一個用於知識圖譜錯誤偵測 (MAKGED) 的新多代理架構，它在協作設定中利用了多個大型語言模型 (LLM)。透過在訓練期間將細粒度、雙向子圖嵌入與基於 LLM 的查詢嵌入串接，我們的架構整合了這些表示以產生四個專門代理。這些代理利用不同維度的子圖資訊參與多輪討論，從而提高錯誤偵測準確度並確保透明的決策過程。在 FB15K 和 WN18RR 上的廣泛實驗表明，MAKGED 優於最先進的方法，增強了 KG 評估的準確性和穩健性。對於特定產業情境，我們的架構可以利用特定領域的知識圖譜來促進專門代理的訓練以進行錯誤偵測，這突顯了我們架構的潛在產業應用價值。我們的程式碼和資料集可在 https://github.com/kse-ElEvEn/MAKGED 取得。", "author": "Yu Li et.al.", "authors": "Yu Li, Yi Huang, Guilin Qi, Junlan Feng, Nan Hu, Songlin Zhai, Haohan Xue, Yongrui Chen, Ruoyan Shen, Tongtong Wu", "id": "2501.15791v1", "paper_url": "http://arxiv.org/abs/2501.15791v1", "repo": "https://github.com/kse-eleven/makged"}}