{"2501.14300": {"publish_time": "2025-01-24", "title": "Fast Think-on-Graph: Wider, Deeper and Faster Reasoning of Large Language Model on Knowledge Graph", "paper_summary": "Graph Retrieval Augmented Generation (GRAG) is a novel paradigm that takes\nthe naive RAG system a step further by integrating graph information, such as\nknowledge graph (KGs), into large-scale language models (LLMs) to mitigate\nhallucination. However, existing GRAG still encounter limitations: 1) simple\nparadigms usually fail with the complex problems due to the narrow and shallow\ncorrelations capture from KGs 2) methods of strong coupling with KGs tend to be\nhigh computation cost and time consuming if the graph is dense. In this paper,\nwe propose the Fast Think-on-Graph (FastToG), an innovative paradigm for\nenabling LLMs to think ``community by community\" within KGs. To do this,\nFastToG employs community detection for deeper correlation capture and two\nstages community pruning - coarse and fine pruning for faster retrieval.\nFurthermore, we also develop two Community-to-Text methods to convert the graph\nstructure of communities into textual form for better understanding by LLMs.\nExperimental results demonstrate the effectiveness of FastToG, showcasing\nhigher accuracy, faster reasoning, and better explainability compared to the\nprevious works.", "paper_summary_zh": "圖表檢索增強生成 (GRAG) 是一種新穎的範例，它透過將圖表資訊（例如知識圖表 (KG)) 整合到大型語言模型 (LLM) 中，進一步提升了樸素的 RAG 系統以減輕幻覺。然而，現有的 GRAG 仍會遇到限制：1) 簡單的範例通常會因從 KG 中擷取的關聯性狹隘且淺薄而無法解決複雜的問題 2) 如果圖表很密集，與 KG 強耦合的方法往往會導致高運算成本和耗時。在本文中，我們提出了 Fast Think-on-Graph (FastToG)，這是一種創新的範例，可讓 LLM 在 KG 中「逐個社群」進行思考。為此，FastToG 使用社群偵測來擷取更深入的關聯性，並使用兩個階段的社群修剪（粗略修剪和精細修剪）來加快檢索速度。此外，我們還開發了兩種社群到文字的方法，將社群的圖表結構轉換為文字形式，以便 LLM 更容易理解。實驗結果證明了 FastToG 的有效性，與先前的研究相比，展示出更高的準確性、更快的推理速度和更好的可解釋性。", "author": "Xujian Liang et.al.", "authors": "Xujian Liang, Zhaoquan Gu", "id": "2501.14300v1", "paper_url": "http://arxiv.org/abs/2501.14300v1", "repo": "https://github.com/dosonleung/fasttog"}}