{"2409.05211": {"publish_time": "2024-09-08", "title": "ICML Topological Deep Learning Challenge 2024: Beyond the Graph Domain", "paper_summary": "This paper describes the 2nd edition of the ICML Topological Deep Learning\nChallenge that was hosted within the ICML 2024 ELLIS Workshop on\nGeometry-grounded Representation Learning and Generative Modeling (GRaM). The\nchallenge focused on the problem of representing data in different discrete\ntopological domains in order to bridge the gap between Topological Deep\nLearning (TDL) and other types of structured datasets (e.g. point clouds,\ngraphs). Specifically, participants were asked to design and implement\ntopological liftings, i.e. mappings between different data structures and\ntopological domains --like hypergraphs, or simplicial/cell/combinatorial\ncomplexes. The challenge received 52 submissions satisfying all the\nrequirements. This paper introduces the main scope of the challenge, and\nsummarizes the main results and findings.", "paper_summary_zh": "本文描述了 ICML 拓撲深度學習挑戰賽的第 2 版，該挑戰賽在 ICML 2024 ELLIS 幾何基礎表示學習和生成模型（GRaM）研討會中舉辦。挑戰賽專注於在不同的離散拓撲域中表示資料的問題，以縮小拓撲深度學習 (TDL) 和其他類型結構化資料集（例如點雲、圖形）之間的差距。具體來說，要求參與者設計和實作拓撲提升，即不同資料結構和拓撲域之間的對應——例如超圖形或單純/胞/組合複合物。挑戰賽收到了 52 份符合所有要求的提交。本文介紹了挑戰賽的主要範圍，並總結了主要結果和發現。", "author": "Guillermo Bernárdez et.al.", "authors": "Guillermo Bernárdez, Lev Telyatnikov, Marco Montagna, Federica Baccini, Mathilde Papillon, Miquel Ferriol-Galmés, Mustafa Hajij, Theodore Papamarkou, Maria Sofia Bucarelli, Olga Zaghen, Johan Mathe, Audun Myers, Scott Mahan, Hansen Lillemark, Sharvaree Vadgama, Erik Bekkers, Tim Doster, Tegan Emerson, Henry Kvinge, Katrina Agate, Nesreen K Ahmed, Pengfei Bai, Michael Banf, Claudio Battiloro, Maxim Beketov, Paul Bogdan, Martin Carrasco, Andrea Cavallo, Yun Young Choi, George Dasoulas, Matouš Elphick, Giordan Escalona, Dominik Filipiak, Halley Fritze, Thomas Gebhart, Manel Gil-Sorribes, Salvish Goomanee, Victor Guallar, Liliya Imasheva, Andrei Irimia, Hongwei Jin, Graham Johnson, Nikos Kanakaris, Boshko Koloski, Veljko Kovač, Manuel Lecha, Minho Lee, Pierrick Leroy, Theodore Long, German Magai, Alvaro Martinez, Marissa Masden, Sebastian Mežnar, Bertran Miquel-Oliver, Alexis Molina, Alexander Nikitin, Marco Nurisso, Matt Piekenbrock, Yu Qin, Patryk Rygiel, Alessandro Salatiello, Max Schattauer, Pavel Snopov, Julian Suk, Valentina Sánchez, Mauricio Tec, Francesco Vaccarino, Jonas Verhellen, Frederic Wantiez, Alexander Weers, Patrik Zajec, Blaž Škrlj, Nina Miolane", "id": "2409.05211v1", "paper_url": "http://arxiv.org/abs/2409.05211v1", "repo": "null"}}