{"2503.10626": {"publish_time": "2025-03-13", "title": "NIL: No-data Imitation Learning by Leveraging Pre-trained Video Diffusion Models", "paper_summary": "Acquiring physically plausible motor skills across diverse and unconventional\nmorphologies-including humanoid robots, quadrupeds, and animals-is essential\nfor advancing character simulation and robotics. Traditional methods, such as\nreinforcement learning (RL) are task- and body-specific, require extensive\nreward function engineering, and do not generalize well. Imitation learning\noffers an alternative but relies heavily on high-quality expert demonstrations,\nwhich are difficult to obtain for non-human morphologies. Video diffusion\nmodels, on the other hand, are capable of generating realistic videos of\nvarious morphologies, from humans to ants. Leveraging this capability, we\npropose a data-independent approach for skill acquisition that learns 3D motor\nskills from 2D-generated videos, with generalization capability to\nunconventional and non-human forms. Specifically, we guide the imitation\nlearning process by leveraging vision transformers for video-based comparisons\nby calculating pair-wise distance between video embeddings. Along with\nvideo-encoding distance, we also use a computed similarity between segmented\nvideo frames as a guidance reward. We validate our method on locomotion tasks\ninvolving unique body configurations. In humanoid robot locomotion tasks, we\ndemonstrate that 'No-data Imitation Learning' (NIL) outperforms baselines\ntrained on 3D motion-capture data. Our results highlight the potential of\nleveraging generative video models for physically plausible skill learning with\ndiverse morphologies, effectively replacing data collection with data\ngeneration for imitation learning.", "paper_summary_zh": "<paragraph>在包括人形機器人、四足動物和一般動物在內的各種非常規形態中習得物理上合理的運動技能，對於推進角色模擬和機器人技術至關重要。傳統方法，例如強化學習 (RL)，是針對特定任務和身體的，需要大量的獎勵函數工程，而且泛化能力不佳。模仿學習提供了一種替代方案，但嚴重依賴於難以獲得的非人類形態的高質量專家示範。另一方面，視頻擴散模型能夠生成從人類到螞蟻等各種形態的逼真視頻。利用此功能，我們提出了一種與數據無關的技能習得方法，可以從 2D 生成的視頻中學習 3D 運動技能，並具有泛化到非常規和非人類形態的能力。具體來說，我們利用視覺變換器進行基於視頻的比較，通過計算視頻嵌入之間的成對距離來引導模仿學習過程。除了視頻編碼距離之外，我們還使用計算出的分段視頻幀之間的相似度作為指導獎勵。我們在涉及獨特身體結構的運動任務上驗證了我們的方法。在人形機器人運動任務中，我們證明了「無數據模仿學習」(NIL) 的表現優於使用 3D 運動捕捉數據訓練的基準模型。我們的結果突出了利用生成視頻模型進行各種形態的物理上合理的技能學習的潛力，有效地用數據生成取代了模仿學習的數據收集。</paragraph>\n", "author": "Mert Albaba et.al.", "authors": "Mert Albaba, Chenhao Li, Markos Diomataris, Omid Taheri, Andreas Krause, Michael Black", "id": "2503.10626v1", "paper_url": "http://arxiv.org/abs/2503.10626v1", "repo": "null"}}