{"2406.18354": {"publish_time": "2024-06-26", "title": "Kolmogorov-Arnold Graph Neural Networks", "paper_summary": "Graph neural networks (GNNs) excel in learning from network-like data but\noften lack interpretability, making their application challenging in domains\nrequiring transparent decision-making. We propose the Graph Kolmogorov-Arnold\nNetwork (GKAN), a novel GNN model leveraging spline-based activation functions\non edges to enhance both accuracy and interpretability. Our experiments on five\nbenchmark datasets demonstrate that GKAN outperforms state-of-the-art GNN\nmodels in node classification, link prediction, and graph classification tasks.\nIn addition to the improved accuracy, GKAN's design inherently provides clear\ninsights into the model's decision-making process, eliminating the need for\npost-hoc explainability techniques. This paper discusses the methodology,\nperformance, and interpretability of GKAN, highlighting its potential for\napplications in domains where interpretability is crucial.", "paper_summary_zh": "圖形神經網路 (GNN) 擅長從網路狀資料學習，但通常缺乏可解釋性，這使得它們在需要透明決策的領域中應用具有挑戰性。我們提出圖形 Kolmogorov-Arnold 網路 (GKAN)，這是一種新穎的 GNN 模型，在邊緣上利用基於樣條的激活函數來增強準確性和可解釋性。我們在五個基準資料集上的實驗表明，GKAN 在節點分類、連結預測和圖形分類任務中優於最先進的 GNN 模型。除了提高準確性之外，GKAN 的設計本身就對模型的決策過程提供了清晰的見解，消除了對事後可解釋性技術的需求。本文討論了 GKAN 的方法、性能和可解釋性，強調了其在可解釋性至關重要的領域中的應用潛力。", "author": "Gianluca De Carlo et.al.", "authors": "Gianluca De Carlo, Andrea Mastropietro, Aris Anagnostopoulos", "id": "2406.18354v1", "paper_url": "http://arxiv.org/abs/2406.18354v1", "repo": "null"}}