{"2410.18077": {"publish_time": "2024-10-23", "title": "ALTA: Compiler-Based Analysis of Transformers", "paper_summary": "We propose a new programming language called ALTA and a compiler that can map\nALTA programs to Transformer weights. ALTA is inspired by RASP, a language\nproposed by Weiss et al. (2021), and Tracr (Lindner et al., 2023), a compiler\nfrom RASP programs to Transformer weights. ALTA complements and extends this\nprior work, offering the ability to express loops and to compile programs to\nUniversal Transformers, among other advantages. ALTA allows us to\nconstructively show how Transformers can represent length-invariant algorithms\nfor computing parity and addition, as well as a solution to the SCAN benchmark\nof compositional generalization tasks, without requiring intermediate\nscratchpad decoding steps. We also propose tools to analyze cases where the\nexpressibility of an algorithm is established, but end-to-end training on a\ngiven training set fails to induce behavior consistent with the desired\nalgorithm. To this end, we explore training from ALTA execution traces as a\nmore fine-grained supervision signal. This enables additional experiments and\ntheoretical analyses relating the learnability of various algorithms to data\navailability and modeling decisions, such as positional encodings. We make the\nALTA framework -- language specification, symbolic interpreter, and weight\ncompiler -- available to the community to enable further applications and\ninsights.", "paper_summary_zh": "<paragraph>我們提出了一種名為 ALTA 的新程式語言，以及一個可以將 ALTA 程式對應到 Transformer 權重的編譯器。ALTA 的靈感來自 RASP，一種由 Weiss 等人 (2021) 提出的語言，以及 Tracr (Lindner 等人，2023)，一個將 RASP 程式編譯到 Transformer 權重的編譯器。ALTA 補充並延伸了這項先前的研究，提供了表達迴圈和將程式編譯到通用 Transformer 的能力，以及其他優點。ALTA 讓我們能夠建構性地展示 Transformer 如何表示用於計算奇偶校驗和加法的長度不變演算法，以及 SCAN 組合概化任務基準的解決方案，而不需要中間暫存區解碼步驟。我們也提出了工具來分析演算法的可表達性已建立，但給定訓練集上的端到端訓練無法誘導與所需演算法一致的行為的情況。為此，我們探索從 ALTA 執行追蹤訓練，作為更細緻的監督訊號。這啟用了額外的實驗和理論分析，將各種演算法的可學習性與資料可用性和建模決策（例如位置編碼）關聯起來。我們將 ALTA 框架（語言規範、符號解釋器和權重編譯器）提供給社群，以啟用進一步的應用和見解。</paragraph>", "author": "Peter Shaw et.al.", "authors": "Peter Shaw, James Cohan, Jacob Eisenstein, Kenton Lee, Jonathan Berant, Kristina Toutanova", "id": "2410.18077v1", "paper_url": "http://arxiv.org/abs/2410.18077v1", "repo": "https://github.com/google-deepmind/alta"}}