{"2406.07012": {"publish_time": "2024-06-11", "title": "Bridging Language Gaps in Audio-Text Retrieval", "paper_summary": "Audio-text retrieval is a challenging task, requiring the search for an audio\nclip or a text caption within a database. The predominant focus of existing\nresearch on English descriptions poses a limitation on the applicability of\nsuch models, given the abundance of non-English content in real-world data. To\naddress these linguistic disparities, we propose a language enhancement (LE),\nusing a multilingual text encoder (SONAR) to encode the text data with\nlanguage-specific information. Additionally, we optimize the audio encoder\nthrough the application of consistent ensemble distillation (CED), enhancing\nsupport for variable-length audio-text retrieval. Our methodology excels in\nEnglish audio-text retrieval, demonstrating state-of-the-art (SOTA) performance\non commonly used datasets such as AudioCaps and Clotho. Simultaneously, the\napproach exhibits proficiency in retrieving content in seven other languages\nwith only 10% of additional language-enhanced training data, yielding promising\nresults. The source code is publicly available\nhttps://github.com/zyyan4/ml-clap.", "paper_summary_zh": "音訊文字檢索是一項具有挑戰性的任務，需要在資料庫中搜尋音訊片段或文字標題。現有英文說明的研究重點，限制了此類模型的適用性，因為現實世界資料中存在大量非英文內容。為了解決這些語言差異，我們提出語言增強 (LE)，使用多語言文字編碼器 (SONAR) 編碼具有語言特定資訊的文字資料。此外，我們透過應用一致的整體蒸餾 (CED) 來最佳化音訊編碼器，加強對可變長度音訊文字檢索的支援。我們的技術在英文音訊文字檢索中表現優異，在 AudioCaps 和 Clotho 等常用資料集上展現最先進 (SOTA) 的效能。同時，此方法僅使用 10% 的額外語言增強訓練資料，就能熟練地檢索七種其他語言的內容，產生有希望的結果。原始程式碼公開於 https://github.com/zyyan4/ml-clap。", "author": "Zhiyong Yan et.al.", "authors": "Zhiyong Yan, Heinrich Dinkel, Yongqing Wang, Jizhong Liu, Junbo Zhang, Yujun Wang, Bin Wang", "id": "2406.07012v1", "paper_url": "http://arxiv.org/abs/2406.07012v1", "repo": "null"}}