{"2501.08312": {"publish_time": "2025-01-14", "title": "Everybody Likes to Sleep: A Computer-Assisted Comparison of Object Naming Data from 30 Languages", "paper_summary": "Object naming - the act of identifying an object with a word or a phrase - is\na fundamental skill in interpersonal communication, relevant to many\ndisciplines, such as psycholinguistics, cognitive linguistics, or language and\nvision research. Object naming datasets, which consist of concept lists with\npicture pairings, are used to gain insights into how humans access and select\nnames for objects in their surroundings and to study the cognitive processes\ninvolved in converting visual stimuli into semantic concepts. Unfortunately,\nobject naming datasets often lack transparency and have a highly idiosyncratic\nstructure. Our study tries to make current object naming data transparent and\ncomparable by using a multilingual, computer-assisted approach that links\nindividual items of object naming lists to unified concepts. Our current sample\nlinks 17 object naming datasets that cover 30 languages from 10 different\nlanguage families. We illustrate how the comparative dataset can be explored by\nsearching for concepts that recur across the majority of datasets and comparing\nthe conceptual spaces of covered object naming datasets with classical basic\nvocabulary lists from historical linguistics and linguistic typology. Our\nfindings can serve as a basis for enhancing cross-linguistic object naming\nresearch and as a guideline for future studies dealing with object naming\ntasks.", "paper_summary_zh": "<paragraph>對象命名——用一個詞或一個短語識別一個對象的行為——是一項人際溝通的基本技能，與許多領域相關，例如心理語言學、認知語言學或語言和視覺研究。對象命名數據集包含帶有圖片配對的概念清單，用於深入了解人類如何訪問和選擇周圍對象的名稱，以及研究將視覺刺激轉換為語義概念所涉及的認知過程。不幸的是，對象命名數據集通常缺乏透明度，並且具有高度的獨特性結構。我們的研究試圖通過使用多語言、計算機輔助的方法將對象命名清單的單個項目鏈接到統一的概念，從而使當前對象命名數據透明且具有可比性。我們目前的樣本鏈接了 17 個對象命名數據集，這些數據集涵蓋了來自 10 個不同語言家族的 30 種語言。我們說明瞭如何通過搜索跨大多數數據集重複出現的概念以及將涵蓋的對象命名數據集的概念空間與歷史語言學和語言類型學中的經典基本詞彙表進行比較來探索比較數據集。我們的研究結果可以作為增強跨語言對象命名研究的基礎，並作為處理對象命名任務的未來研究的指導方針。</paragraph>", "author": "Alžběta Kučerová et.al.", "authors": "Alžběta Kučerová, Johann-Mattis List", "id": "2501.08312v1", "paper_url": "http://arxiv.org/abs/2501.08312v1", "repo": "https://github.com/calc-project/object-naming-data"}}