{"2502.11989": {"publish_time": "2025-02-17", "title": "Characterizing Photorealism and Artifacts in Diffusion Model-Generated Images", "paper_summary": "Diffusion model-generated images can appear indistinguishable from authentic\nphotographs, but these images often contain artifacts and implausibilities that\nreveal their AI-generated provenance. Given the challenge to public trust in\nmedia posed by photorealistic AI-generated images, we conducted a large-scale\nexperiment measuring human detection accuracy on 450 diffusion-model generated\nimages and 149 real images. Based on collecting 749,828 observations and 34,675\ncomments from 50,444 participants, we find that scene complexity of an image,\nartifact types within an image, display time of an image, and human curation of\nAI-generated images all play significant roles in how accurately people\ndistinguish real from AI-generated images. Additionally, we propose a taxonomy\ncharacterizing artifacts often appearing in images generated by diffusion\nmodels. Our empirical observations and taxonomy offer nuanced insights into the\ncapabilities and limitations of diffusion models to generate photorealistic\nimages in 2024.", "paper_summary_zh": "擴散模型生成的影像看起來可能與真實照片無異，但這些影像通常包含人工智慧生成來源的瑕疵和不合理之處。由於寫實的人工智慧生成影像對公眾對媒體的信任構成挑戰，我們進行了一項大規模實驗，測量人類對 450 張擴散模型生成影像和 149 張真實影像的檢測準確度。根據收集自 50,444 位參與者的 749,828 次觀察和 34,675 則評論，我們發現影像的場景複雜性、影像中的瑕疵類型、影像的顯示時間，以及人類對人工智慧生成影像的策展，在人們準確區分真實影像和人工智慧生成影像方面都扮演重要的角色。此外，我們提出了一種分類法，用於描述經常出現在擴散模型生成的影像中的瑕疵。我們的經驗觀察和分類法為擴散模型在 2024 年生成寫實影像的能力和限制提供了細緻的見解。", "author": "Negar Kamali et.al.", "authors": "Negar Kamali, Karyn Nakamura, Aakriti Kumar, Angelos Chatzimparmpas, Jessica Hullman, Matthew Groh", "id": "2502.11989v1", "paper_url": "http://arxiv.org/abs/2502.11989v1", "repo": "null"}}