{"2502.13076": {"publish_time": "2025-02-18", "title": "KAPPA: A Generic Patent Analysis Framework with Keyphrase-Based Portraits", "paper_summary": "Patent analysis highly relies on concise and interpretable document\nrepresentations, referred to as patent portraits. Keyphrases, both present and\nabsent, are ideal candidates for patent portraits due to their brevity,\nrepresentativeness, and clarity. In this paper, we introduce KAPPA, an\nintegrated framework designed to construct keyphrase-based patent portraits and\nenhance patent analysis. KAPPA operates in two phases: patent portrait\nconstruction and portrait-based analysis. To ensure effective portrait\nconstruction, we propose a semantic-calibrated keyphrase generation paradigm\nthat integrates pre-trained language models with a prompt-based hierarchical\ndecoding strategy to leverage the multi-level structural characteristics of\npatents. For portrait-based analysis, we develop a comprehensive framework that\nemploys keyphrase-based patent portraits to enable efficient and accurate\npatent analysis. Extensive experiments on benchmark datasets of keyphrase\ngeneration, the proposed model achieves significant improvements compared to\nstate-of-the-art baselines. Further experiments conducted on real-world patent\napplications demonstrate that our keyphrase-based portraits effectively capture\ndomain-specific knowledge and enrich semantic representation for patent\nanalysis tasks.", "paper_summary_zh": "專利分析高度依賴簡潔且可解讀的文件表示，稱為專利描述。關鍵字組，無論是存在的還是不存在的，都是專利描述的理想候選者，因為它們簡潔、具有代表性且清晰。在本文中，我們介紹了 KAPPA，一個用於建構基於關鍵字組的專利描述和增強專利分析的整合式架構。KAPPA 分為兩個階段執行：專利描述建構和基於描述的分析。為確保有效的描述建構，我們提出了一個語義校準關鍵字組生成範例，它將預先訓練的語言模型與基於提示的分層解碼策略整合在一起，以利用專利的多分層結構特性。對於基於描述的分析，我們開發了一個全面的架構，它採用基於關鍵字組的專利描述，以實現高效且準確的專利分析。在關鍵字組生成基準資料集上進行的廣泛實驗中，與最先進的基準線相比，所提出的模型取得了顯著的改進。在真實世界專利申請上進行的進一步實驗表明，我們基於關鍵字組的描述有效地擷取了特定領域的知識，並豐富了專利分析任務的語義表示。", "author": "Xin Xia et.al.", "authors": "Xin Xia, Yujin Wang, Jun Zhou, Guisheng Zhong, Linning Cai, Chen Zhang", "id": "2502.13076v1", "paper_url": "http://arxiv.org/abs/2502.13076v1", "repo": "null"}}