{"2412.20292": {"publish_time": "2024-12-28", "title": "An analytic theory of creativity in convolutional diffusion models", "paper_summary": "We obtain the first analytic, interpretable and predictive theory of\ncreativity in convolutional diffusion models. Indeed, score-based diffusion\nmodels can generate highly creative images that lie far from their training\ndata. But optimal score-matching theory suggests that these models should only\nbe able to produce memorized training examples. To reconcile this\ntheory-experiment gap, we identify two simple inductive biases, locality and\nequivariance, that: (1) induce a form of combinatorial creativity by preventing\noptimal score-matching; (2) result in a fully analytic, completely\nmechanistically interpretable, equivariant local score (ELS) machine that, (3)\nwithout any training can quantitatively predict the outputs of trained\nconvolution only diffusion models (like ResNets and UNets) with high accuracy\n(median $r^2$ of $0.90, 0.91, 0.94$ on CIFAR10, FashionMNIST, and MNIST). Our\nELS machine reveals a locally consistent patch mosaic model of creativity, in\nwhich diffusion models create exponentially many novel images by mixing and\nmatching different local training set patches in different image locations. Our\ntheory also partially predicts the outputs of pre-trained self-attention\nenabled UNets (median $r^2 \\sim 0.75$ on CIFAR10), revealing an intriguing role\nfor attention in carving out semantic coherence from local patch mosaics.", "paper_summary_zh": "<paragraph>我們獲得了卷積擴散模型中創造力的第一個分析、可解釋和預測理論。事實上，基於分數的擴散模型可以生成高度創造性的圖像，這些圖像遠離其訓練資料。但最佳分數匹配理論表明，這些模型應該只能產生記憶的訓練範例。為了調和這個理論與實驗的差距，我們找出兩個簡單的歸納偏差，即局部性和等變性，它們：(1) 透過防止最佳分數匹配來誘導一種組合創造力；(2) 導致一個完全分析、完全機械可解釋、等變的局部分數 (ELS) 機器，(3) 在沒有任何訓練的情況下，可以定量預測僅訓練卷積擴散模型（如 ResNets 和 UNets）的輸出，準確度很高（CIFAR10、FashionMNIST 和 MNIST 上的中位數 r2 分別為 0.90、0.91 和 0.94）。我們的 ELS 機器揭示了一個局部一致的拼貼馬賽克創造力模型，其中擴散模型透過在不同圖像位置混合和匹配不同的局部訓練集拼貼，以指數級的方式創造許多新穎的圖像。我們的理論也部分預測了預先訓練的支援自我注意 UNets 的輸出（CIFAR10 上的中位數 r2 約為 0.75），揭示了注意在從局部拼貼馬賽克中刻畫語義一致性方面扮演著有趣的角色。</paragraph>", "author": "Mason Kamb et.al.", "authors": "Mason Kamb, Surya Ganguli", "id": "2412.20292v1", "paper_url": "http://arxiv.org/abs/2412.20292v1", "repo": "null"}}