{"2502.03860": {"publish_time": "2025-02-06", "title": "BOLT: Bootstrap Long Chain-of-Thought in Language Models without Distillation", "paper_summary": "Large language models (LLMs), such as o1 from OpenAI, have demonstrated\nremarkable reasoning capabilities. o1 generates a long chain-of-thought\n(LongCoT) before answering a question. LongCoT allows LLMs to analyze problems,\ndevise plans, reflect, and backtrack effectively. These actions empower LLM to\nsolve complex problems. After the release of o1, many teams have attempted to\nreplicate its LongCoT and reasoning capabilities. In terms of methods, they\nprimarily rely on knowledge distillation with data from existing models with\nLongCoT capacities (e.g., OpenAI-o1, Qwen-QwQ, DeepSeek-R1-Preview), leaving\nsignificant uncertainties on systematically developing such reasoning\nabilities. In terms of data domains, these works focus narrowly on math while a\nfew others include coding, limiting their generalizability. This paper\nintroduces a novel approach to enable LLM's LongCoT capacity without\ndistillation from o1-like models or expensive human annotations, where we\nbootstrap LongCoT (BOLT) from a standard instruct model. BOLT involves three\nstages: 1) LongCoT data bootstrapping with in-context learning on a standard\ninstruct model; 2) LongCoT supervised finetuning; 3) online training to further\nrefine LongCoT capacities. In BOLT, only a few in-context examples need to be\nconstructed during the bootstrapping stage; in our experiments, we created 10\nexamples, demonstrating the feasibility of this approach. We use\nLlama-3.1-70B-Instruct to bootstrap LongCoT and apply our method to various\nmodel scales (7B, 8B, 70B). We achieve impressive performance on a variety of\nbenchmarks, Arena-Hard, MT-Bench, WildBench, ZebraLogic, MATH500, which\nevaluate diverse task-solving and reasoning capabilities.", "paper_summary_zh": "大型語言模型 (LLM)，例如 OpenAI 的 o1，已經展示出非凡的推理能力。o1 在回答問題之前會產生一個長鏈的想法 (LongCoT)。LongCoT 允許 LLM 分析問題、制定計劃、反思和有效回溯。這些動作賦能 LLM 解決複雜的問題。在 o1 發布後，許多團隊都嘗試複製其 LongCoT 和推理能力。在方法方面，他們主要依賴於具有 LongCoT 能力的現有模型的數據進行知識蒸餾（例如，OpenAI-o1、Qwen-QwQ、DeepSeek-R1-Preview），在系統性地開發這種推理能力方面留下重大的不確定性。在數據領域方面，這些工作狹隘地集中在數學上，而其他一些則包括編碼，限制了它們的普遍性。本文介紹了一種新穎的方法，可以在不從類似 o1 的模型或昂貴的人工註釋中進行蒸餾的情況下實現 LLM 的 LongCoT 能力，我們從標準指令模型中引導 LongCoT (BOLT)。BOLT 涉及三個階段：1) 在標準指令模型上通過語境學習引導 LongCoT 數據；2) LongCoT 監督微調；3) 在線訓練以進一步完善 LongCoT 能力。在 BOLT 中，在引導階段只需要構造幾個語境範例；在我們的實驗中，我們創建了 10 個範例，證明了這種方法的可行性。我們使用 Llama-3.1-70B-Instruct 引導 LongCoT，並將我們的模型應用於各種模型規模（7B、8B、70B）。我們在各種基準測試中取得了令人印象深刻的性能，Arena-Hard、MT-Bench、WildBench、ZebraLogic、MATH500，這些測試評估了不同的任務解決和推理能力。", "author": "Bo Pang et.al.", "authors": "Bo Pang, Hanze Dong, Jiacheng Xu, Silvio Savarese, Yingbo Zhou, Caiming Xiong", "id": "2502.03860v1", "paper_url": "http://arxiv.org/abs/2502.03860v1", "repo": "null"}}