{"2406.19317": {"publish_time": "2024-06-27", "title": "Jump Starting Bandits with LLM-Generated Prior Knowledge", "paper_summary": "We present substantial evidence demonstrating the benefits of integrating\nLarge Language Models (LLMs) with a Contextual Multi-Armed Bandit framework.\nContextual bandits have been widely used in recommendation systems to generate\npersonalized suggestions based on user-specific contexts. We show that LLMs,\npre-trained on extensive corpora rich in human knowledge and preferences, can\nsimulate human behaviours well enough to jump-start contextual multi-armed\nbandits to reduce online learning regret. We propose an initialization\nalgorithm for contextual bandits by prompting LLMs to produce a pre-training\ndataset of approximate human preferences for the bandit. This significantly\nreduces online learning regret and data-gathering costs for training such\nmodels. Our approach is validated empirically through two sets of experiments\nwith different bandit setups: one which utilizes LLMs to serve as an oracle and\na real-world experiment utilizing data from a conjoint survey experiment.", "paper_summary_zh": "我們提出大量的證據，證明將大型語言模型 (LLM) 與情境多臂老虎機架構整合起來的好處。情境多臂老虎機已廣泛用於推薦系統中，以根據使用者特定的情境產生個人化的建議。我們證明，在豐富的人類知識和偏好的廣泛語料庫上預先訓練的 LLM，能夠很好地模擬人類行為，以啟動情境多臂老虎機，減少線上學習遺憾。我們提出了一種情境多臂老虎機的初始化演算法，透過提示 LLM 產生近似人類偏好的預訓練資料集，供老虎機使用。這顯著減少了此類模型的線上學習遺憾和資料收集成本。我們的做法透過兩組具有不同老虎機設定的實驗進行實證驗證：一組利用 LLM 作為神諭，另一組實際實驗利用聯合調查實驗的資料。", "author": "Parand A. Alamdari et.al.", "authors": "Parand A. Alamdari, Yanshuai Cao, Kevin H. Wilson", "id": "2406.19317v1", "paper_url": "http://arxiv.org/abs/2406.19317v1", "repo": "null"}}