{"2410.10588": {"publish_time": "2024-10-14", "title": "TRESTLE: A Model of Concept Formation in Structured Domains", "paper_summary": "The literature on concept formation has demonstrated that humans are capable\nof learning concepts incrementally, with a variety of attribute types, and in\nboth supervised and unsupervised settings. Many models of concept formation\nfocus on a subset of these characteristics, but none account for all of them.\nIn this paper, we present TRESTLE, an incremental account of probabilistic\nconcept formation in structured domains that unifies prior concept learning\nmodels. TRESTLE works by creating a hierarchical categorization tree that can\nbe used to predict missing attribute values and cluster sets of examples into\nconceptually meaningful groups. It updates its knowledge by partially matching\nnovel structures and sorting them into its categorization tree. Finally, the\nsystem supports mixed-data representations, including nominal, numeric,\nrelational, and component attributes. We evaluate TRESTLE's performance on a\nsupervised learning task and an unsupervised clustering task. For both tasks,\nwe compare it to a nonincremental model and to human participants. We find that\nthis new categorization model is competitive with the nonincremental approach\nand more closely approximates human behavior on both tasks. These results serve\nas an initial demonstration of TRESTLE's capabilities and show that, by taking\nkey characteristics of human learning into account, it can better model\nbehavior than approaches that ignore them.", "paper_summary_zh": "概念形成的文獻已證明，人類有能力逐步學習概念，使用各種屬性類型，並在有監督和無監督的環境中學習。許多概念形成模型側重於這些特徵的子集，但沒有任何模型能解釋所有這些特徵。在本文中，我們提出了 TRESTLE，這是一個在結構化領域中逐步形成概率概念的說明，它統一了先前的概念學習模型。TRESTLE 通過創建一個分層分類樹來工作，該樹可用於預測缺失的屬性值和將示例集聚合到概念上有意義的組中。它通過部分匹配新結構並將它們分類到其分類樹中來更新其知識。最後，該系統支持混合數據表示，包括標稱、數字、關係和組成屬性。我們評估了 TRESTLE 在有監督學習任務和無監督聚類任務上的性能。對於這兩個任務，我們將其與非增量模型和人類參與者進行了比較。我們發現，這種新的分類模型與非增量方法具有競爭力，並且在兩個任務上都更接近人類行為。這些結果初步證明了 TRESTLE 的能力，並表明，通過考慮人類學習的主要特徵，它可以比忽略這些特徵的方法更好地建模行為。", "author": "Christopher J. MacLellan et.al.", "authors": "Christopher J. MacLellan, Erik Harpstead, Vincent Aleven, Kenneth R. Koedinger", "id": "2410.10588v1", "paper_url": "http://arxiv.org/abs/2410.10588v1", "repo": "https://github.com/cmaclell/concept_formation"}}