{"2408.13836": {"publish_time": "2024-08-25", "title": "PropSAM: A Propagation-Based Model for Segmenting Any 3D Objects in Multi-Modal Medical Images", "paper_summary": "Volumetric segmentation is crucial for medical imaging but is often\nconstrained by labor-intensive manual annotations and the need for\nscenario-specific model training. Furthermore, existing general segmentation\nmodels are inefficient due to their design and inferential approaches.\nAddressing this clinical demand, we introduce PropSAM, a propagation-based\nsegmentation model that optimizes the use of 3D medical structure information.\nPropSAM integrates a CNN-based UNet for intra-slice processing with a\nTransformer-based module for inter-slice propagation, focusing on structural\nand semantic continuities to enhance segmentation across various modalities.\nDistinctively, PropSAM operates on a one-view prompt, such as a 2D bounding box\nor sketch mask, unlike conventional models that require two-view prompts. It\nhas demonstrated superior performance, significantly improving the Dice\nSimilarity Coefficient (DSC) across 44 medical datasets and various imaging\nmodalities, outperforming models like MedSAM and SegVol with an average DSC\nimprovement of 18.1%. PropSAM also maintains stable predictions despite prompt\ndeviations and varying propagation configurations, confirmed by one-way ANOVA\ntests with P>0.5985 and P>0.6131, respectively. Moreover, PropSAM's efficient\narchitecture enables faster inference speeds (Wilcoxon rank-sum test, P<0.001)\nand reduces user interaction time by 37.8% compared to two-view prompt models.\nIts ability to handle irregular and complex objects with robust performance\nfurther demonstrates its potential in clinical settings, facilitating more\nautomated and reliable medical imaging analyses with minimal retraining.", "paper_summary_zh": "體積分割對於醫學影像至關重要，但通常受到耗費大量人力的標註和特定場景模型訓練需求的限制。此外，現有的通用分割模型由於其設計和推論方法而效率低下。為了滿足這項臨床需求，我們引入了 PropSAM，這是一種基於傳播的分割模型，優化了 3D 醫學結構資訊的使用。PropSAM 整合了一個基於 CNN 的 UNet，用於切片內處理，以及一個基於 Transformer 的模組，用於切片間傳播，重點關注結構和語義連續性，以增強各種模式下的分割。與需要兩視提示的傳統模型不同，PropSAM 獨特地運作於單視提示上，例如 2D 邊界框或草圖遮罩。它已證明具有優異的效能，顯著改善了 44 個醫學資料集和各種影像模式下的骰子相似係數 (DSC)，優於 MedSAM 和 SegVol 等模型，平均 DSC 提升了 18.1%。儘管提示偏差和傳播配置不同，PropSAM 仍能維持穩定的預測，這已通過單向 ANOVA 測試得到證實，分別為 P>0.5985 和 P>0.6131。此外，PropSAM 的高效架構能實現更快的推論速度（Wilcoxon 等級和總和檢定，P<0.001），並將使用者互動時間減少了 37.8%，優於兩視提示模型。它在處理不規則和複雜物件時能展現出穩健的效能，進一步證明了其在臨床環境中的潛力，有助於以最少的重新訓練進行更自動化和可靠的醫學影像分析。", "author": "Zifan Chen et.al.", "authors": "Zifan Chen, Xinyu Nan, Jiazheng Li, Jie Zhao, Haifeng Li, Zilin Lin, Haoshen Li, Heyun Chen, Yiting Liu, Bin Dong, Li Zhang, Lei Tang", "id": "2408.13836v1", "paper_url": "http://arxiv.org/abs/2408.13836v1", "repo": "null"}}