{"2409.03810": {"publish_time": "2024-09-05", "title": "How Do Your Code LLMs Perform? Empowering Code Instruction Tuning with High-Quality Data", "paper_summary": "Recently, there has been a growing interest in studying how to construct\nbetter code instruction tuning data. However, we observe Code models trained\nwith these datasets exhibit high performance on HumanEval but perform worse on\nother benchmarks such as LiveCodeBench. Upon further investigation, we find\nthat many datasets suffer from severe data leakage. After cleaning up most of\nthe leaked data, some well-known high-quality datasets perform poorly. This\ndiscovery reveals a new challenge: identifying which dataset genuinely qualify\nas high-quality code instruction data. To address this, we propose an efficient\ncode data pruning strategy for selecting good samples. Our approach is based on\nthree dimensions: instruction complexity, response quality, and instruction\ndiversity. Based on our selected data, we present XCoder, a family of models\nfinetuned from LLaMA3. Our experiments show XCoder achieves new\nstate-of-the-art performance using fewer training data, which verify the\neffectiveness of our data strategy. Moreover, we perform a comprehensive\nanalysis on the data composition and find existing code datasets have different\ncharacteristics according to their construction methods, which provide new\ninsights for future code LLMs. Our models and dataset are released in\nhttps://github.com/banksy23/XCoder", "paper_summary_zh": "<paragraph>最近，研究如何构建更好的代码指令调整数据引起了越来越多的兴趣。然而，我们观察到使用这些数据集训练的代码模型在 HumanEval 上表现出很高的性能，但在 LiveCodeBench 等其他基准上表现较差。经过进一步调查，我们发现许多数据集存在严重的数据泄露。在清理了大部分泄露数据后，一些著名的高质量数据集表现不佳。这一发现揭示了一个新的挑战：识别哪些数据集真正符合高质量代码指令数据。为了解决这个问题，我们提出了一种有效的代码数据剪枝策略来选择好的样本。我们的方法基于三个维度：指令复杂性、响应质量和指令多样性。基于我们选择的数据，我们提出了 XCoder，这是一个从 LLaMA3 微调的模型系列。我们的实验表明，XCoder 使用更少的训练数据实现了新的最先进的性能，这验证了我们数据策略的有效性。此外，我们对数据构成进行了全面分析，发现现有的代码数据集根据其构建方法具有不同的特征，这为未来的代码 LLM 提供了新的见解。我们的模型和数据集已在 https://github.com/banksy23/XCoder 中发布</paragraph>", "author": "Yejie Wang et.al.", "authors": "Yejie Wang, Keqing He, Dayuan Fu, Zhuoma Gongque, Heyang Xu, Yanxu Chen, Zhexu Wang, Yujia Fu, Guanting Dong, Muxi Diao, Jingang Wang, Mengdi Zhang, Xunliang Cai, Weiran Xu", "id": "2409.03810v1", "paper_url": "http://arxiv.org/abs/2409.03810v1", "repo": "null"}}