{"2411.04006": {"publish_time": "2024-11-06", "title": "Select2Plan: Training-Free ICL-Based Planning through VQA and Memory Retrieval", "paper_summary": "This study explores the potential of off-the-shelf Vision-Language Models\n(VLMs) for high-level robot planning in the context of autonomous navigation.\nIndeed, while most of existing learning-based approaches for path planning\nrequire extensive task-specific training/fine-tuning, we demonstrate how such\ntraining can be avoided for most practical cases. To do this, we introduce\nSelect2Plan (S2P), a novel training-free framework for high-level robot\nplanning which completely eliminates the need for fine-tuning or specialised\ntraining. By leveraging structured Visual Question-Answering (VQA) and\nIn-Context Learning (ICL), our approach drastically reduces the need for data\ncollection, requiring a fraction of the task-specific data typically used by\ntrained models, or even relying only on online data. Our method facilitates the\neffective use of a generally trained VLM in a flexible and cost-efficient way,\nand does not require additional sensing except for a simple monocular camera.\nWe demonstrate its adaptability across various scene types, context sources,\nand sensing setups. We evaluate our approach in two distinct scenarios:\ntraditional First-Person View (FPV) and infrastructure-driven Third-Person View\n(TPV) navigation, demonstrating the flexibility and simplicity of our method.\nOur technique significantly enhances the navigational capabilities of a\nbaseline VLM of approximately 50% in TPV scenario, and is comparable to trained\nmodels in the FPV one, with as few as 20 demonstrations.", "paper_summary_zh": "本研究探討了現成的視覺語言模型 (VLM) 在自主導航背景下用於高階機器人規劃的潛力。的確，雖然現有的基於學習的路徑規劃方法大多需要大量的特定任務訓練/微調，但我們展示了在大部分實際案例中如何避免這種訓練。為此，我們引入了 Select2Plan (S2P)，這是一種用於高階機器人規劃的新型免訓練框架，它完全消除了微調或專門訓練的需要。通過利用結構化的視覺問答 (VQA) 和語境學習 (ICL)，我們的做法大幅減少了對數據收集的需求，只需要訓練模型通常使用的特定任務數據的一小部分，甚至只依賴於在線數據。我們的辦法促進了以靈活且具有成本效益的方式有效使用經過一般訓練的 VLM，並且除了簡單的單目相機外，不需要額外的感測。我們展示了它對各種場景類型、上下文來源和感測設定的適應性。我們在兩種不同的場景中評估了我們的做法：傳統的第一人稱視角 (FPV) 和基礎設施驅動的第三人稱視角 (TPV) 導航，展示了我們方法的靈活性與簡潔性。我們的技術顯著增強了 TPV 場景中約 50% 的基準 VLM 的導航能力，並且在 FPV 場景中與訓練模型相當，僅需 20 次示範。", "author": "Davide Buoso et.al.", "authors": "Davide Buoso, Luke Robinson, Giuseppe Averta, Philip Torr, Tim Franzmeyer, Daniele De Martini", "id": "2411.04006v1", "paper_url": "http://arxiv.org/abs/2411.04006v1", "repo": "null"}}