{"2405.03821": {"publish_time": "2024-05-06", "title": "Thoughtful Things: Building Human-Centric Smart Devices with Small Language Models", "paper_summary": "Everyday devices like light bulbs and kitchen appliances are now embedded\nwith so many features and automated behaviors that they have become complicated\nto actually use. While such \"smart\" capabilities can better support users'\ngoals, the task of learning the \"ins and outs\" of different devices is\ndaunting. Voice assistants aim to solve this problem by providing a natural\nlanguage interface to devices, yet such assistants cannot understand\nloosely-constrained commands, they lack the ability to reason about and explain\ndevices' behaviors to users, and they rely on connectivity to intrusive cloud\ninfrastructure. Toward addressing these issues, we propose thoughtful things:\ndevices that leverage lightweight, on-device language models to take actions\nand explain their behaviors in response to unconstrained user commands. We\npropose an end-to-end framework that leverages formal modeling, automated\ntraining data synthesis, and generative language models to create devices that\nare both capable and thoughtful in the presence of unconstrained user goals and\ninquiries. Our framework requires no labeled data and can be deployed\non-device, with no cloud dependency. We implement two thoughtful things (a lamp\nand a thermostat) and deploy them on real hardware, evaluating their practical\nperformance.", "paper_summary_zh": "日常用品，例如燈泡和廚房電器，現在都內嵌了許多功能和自動化行為，導致它們變得複雜難用。雖然這些「智慧」功能可以更好地支援使用者的目標，但學習不同裝置的「內外」是一項艱鉅的任務。語音助理旨在透過提供自然語言裝置介面來解決這個問題，但這些助理無法理解約束較少的指令，它們缺乏推論和向使用者解釋裝置行為的能力，而且它們依賴於侵入式雲端基礎架構的連線。為了解決這些問題，我們提出 thoughtful things：裝置利用輕量級的裝置語言模型，根據使用者不受約束的指令採取行動並說明其行為。我們提出一個端對端框架，利用正式建模、自動化訓練資料合成和生成式語言模型，建立在不受約束使用者目標和查詢的情況下既有能力又貼心的裝置。我們的框架不需要標籤資料，而且可以部署在裝置上，無需依賴雲端。我們實作了兩個 thoughtful things（一盞燈和一個恆溫器），並將它們部署在真實硬體上，評估它們的實際效能。", "author": "Evan King et.al.", "authors": "Evan King, Haoxiang Yu, Sahil Vartak, Jenna Jacob, Sangsu Lee, Christine Julien", "id": "2405.03821v1", "paper_url": "http://arxiv.org/abs/2405.03821v1", "repo": "null"}}