{"2405.20605": {"publish_time": "2024-05-31", "title": "Searching for internal symbols underlying deep learning", "paper_summary": "Deep learning (DL) enables deep neural networks (DNNs) to automatically learn\ncomplex tasks or rules from given examples without instructions or guiding\nprinciples. As we do not engineer DNNs' functions, it is extremely difficult to\ndiagnose their decisions, and multiple lines of studies proposed to explain\nprinciples of DNNs/DL operations. Notably, one line of studies suggests that\nDNNs may learn concepts, the high level features recognizable to humans. Thus,\nwe hypothesized that DNNs develop abstract codes, not necessarily recognizable\nto humans, which can be used to augment DNNs' decision-making. To address this\nhypothesis, we combined foundation segmentation models and unsupervised\nlearning to extract internal codes and identify potential use of abstract codes\nto make DL's decision-making more reliable and safer.", "paper_summary_zh": "深度學習 (DL) 使得深度神經網路 (DNN) 能夠自動學習複雜任務或規則，而無需說明或指導原則。由於我們並未設計 DNN 的功能，因此極難診斷其決策，而多條研究路線則提出解釋 DNN/DL 運作原理。值得注意的是，一條研究路線表明 DNN 可能學習人類可識別的高階特徵概念。因此，我們假設 DNN 會開發出抽象代碼，而這些代碼不一定為人類所識別，可用於擴增 DNN 的決策制定。為了解決這個假設，我們結合基礎分割模型和無監督學習，以提取內部代碼並找出抽象代碼的潛在用途，讓 DL 的決策制定更可靠且更安全。", "author": "Jung H. Lee et.al.", "authors": "Jung H. Lee, Sujith Vijayan", "id": "2405.20605v1", "paper_url": "http://arxiv.org/abs/2405.20605v1", "repo": "null"}}