{"2407.01948": {"publish_time": "2024-07-02", "title": "Extracting and Encoding: Leveraging Large Language Models and Medical Knowledge to Enhance Radiological Text Representation", "paper_summary": "Advancing representation learning in specialized fields like medicine remains\nchallenging due to the scarcity of expert annotations for text and images. To\ntackle this issue, we present a novel two-stage framework designed to extract\nhigh-quality factual statements from free-text radiology reports in order to\nimprove the representations of text encoders and, consequently, their\nperformance on various downstream tasks. In the first stage, we propose a\n\\textit{Fact Extractor} that leverages large language models (LLMs) to identify\nfactual statements from well-curated domain-specific datasets. In the second\nstage, we introduce a \\textit{Fact Encoder} (CXRFE) based on a BERT model\nfine-tuned with objective functions designed to improve its representations\nusing the extracted factual data. Our framework also includes a new\nembedding-based metric (CXRFEScore) for evaluating chest X-ray text generation\nsystems, leveraging both stages of our approach. Extensive evaluations show\nthat our fact extractor and encoder outperform current state-of-the-art methods\nin tasks such as sentence ranking, natural language inference, and label\nextraction from radiology reports. Additionally, our metric proves to be more\nrobust and effective than existing metrics commonly used in the radiology\nreport generation literature. The code of this project is available at\n\\url{https://github.com/PabloMessina/CXR-Fact-Encoder}.", "paper_summary_zh": "<paragraph>由於缺乏文本和影像的專業註解，在醫學等專業領域推進表徵學習仍然具有挑戰性。為了解決這個問題，我們提出一個新穎的兩階段架構，旨在從自由文本放射科報告中擷取高品質的事實陳述，以改善文本編碼器的表徵，並進而改善它們在各種下游任務上的效能。在第一階段，我們提出一個利用大型語言模型 (LLM) 從經過精心策劃的特定領域資料集識別事實陳述的「事實萃取器」。在第二階段，我們基於 BERT 模型引入一個微調後的「事實編碼器」(CXRFE)，使用旨在利用萃取事實資料改善其表徵的目標函數。我們的架構還包括一個新的基於嵌入的指標 (CXRFEScore)，用於評估胸部 X 光文本生成系統，利用我們方法的兩個階段。廣泛的評估顯示，我們的事實萃取器和編碼器在句子排序、自然語言推論和從放射科報告中萃取標籤等任務中優於目前的最新方法。此外，我們的指標證明比放射科報告生成文獻中常用的現有指標更強大且有效。此專案的程式碼可在 \\url{https://github.com/PabloMessina/CXR-Fact-Encoder} 取得。</paragraph>", "author": "Pablo Messina et.al.", "authors": "Pablo Messina, René Vidal, Denis Parra, Álvaro Soto, Vladimir Araujo", "id": "2407.01948v1", "paper_url": "http://arxiv.org/abs/2407.01948v1", "repo": "null"}}