{"2405.19109": {"publish_time": "2024-05-29", "title": "PathReasoner: Modeling Reasoning Path with Equivalent Extension for Logical Question Answering", "paper_summary": "Logical reasoning task has attracted great interest since it was proposed.\nFaced with such a task, current competitive models, even large language models\n(e.g., ChatGPT and PaLM 2), still perform badly. Previous promising LMs\nstruggle in logical consistency modeling and logical structure perception. To\nthis end, we model the logical reasoning task by transforming each logical\nsample into reasoning paths and propose an architecture \\textbf{PathReasoner}.\nIt addresses the task from the views of both data and model. To expand the\ndiversity of the logical samples, we propose an atom extension strategy\nsupported by equivalent logical formulas, to form new reasoning paths. From the\nmodel perspective, we design a stack of transformer-style blocks. In\nparticular, we propose a path-attention module to joint model in-atom and\ncross-atom relations with the high-order diffusion strategy. Experiments show\nthat PathReasoner achieves competitive performances on two logical reasoning\nbenchmarks and great generalization abilities.", "paper_summary_zh": "邏輯推理任務自提出以來便引起了極大的興趣。\n面對這樣的任務，當前的競爭模型，甚至是大型語言模型\n（例如 ChatGPT 和 PaLM 2），表現仍然很差。先前有前景的 LM\n在邏輯一致性建模和邏輯結構感知方面遇到困難。為此，我們通過將每個邏輯\n範例轉換為推理路徑來建模邏輯推理任務，並提出一個架構 \\textbf{PathReasoner}。\n它從數據和模型的角度來處理任務。為了擴展邏輯範例的多樣性，我們提出了一個\n由等效邏輯公式支持的原子擴展策略，以形成新的推理路徑。從\n模型的角度來看，我們設計了一堆Transformer風格的區塊。特別是，我們提出了一個路徑注意力模組，以高階擴散策略聯合建模原子內和原子間關係。實驗表明\nPathReasoner 在兩個邏輯推理基準測試中實現了競爭效能，並具有極佳的泛化能力。", "author": "Fangzhi Xu et.al.", "authors": "Fangzhi Xu, Qika Lin, Tianzhe Zhao, Jiawei Han, Jun Liu", "id": "2405.19109v1", "paper_url": "http://arxiv.org/abs/2405.19109v1", "repo": "null"}}