{"2412.04144": {"publish_time": "2024-12-05", "title": "If You Can't Use Them, Recycle Them: Optimizing Merging at Scale Mitigates Performance Tradeoffs", "paper_summary": "Model merging has shown great promise at combining expert models, but the\nbenefit of merging is unclear when merging ``generalist'' models trained on\nmany tasks. We explore merging in the context of large ($\\sim100$B) models, by\n\\textit{recycling} checkpoints that exhibit tradeoffs among different tasks.\nSuch checkpoints are often created in the process of developing a frontier\nmodel, and many suboptimal ones are usually discarded. Given a pool of model\ncheckpoints obtained from different training runs (e.g., different stages,\nobjectives, hyperparameters, and data mixtures), which naturally show tradeoffs\nacross different language capabilities (e.g., instruction following vs. code\ngeneration), we investigate whether merging can recycle such suboptimal models\ninto a Pareto-optimal one. Our optimization algorithm tunes the weight of each\ncheckpoint in a linear combination, resulting in a Pareto-optimal models that\noutperforms both individual models and merge-based baselines. Further analysis\nshows that good merges tend to include almost all checkpoints with with\nnon-zero weights, indicating that even seemingly bad initial checkpoints can\ncontribute to good final merges.", "paper_summary_zh": "模型合并已在结合专家模型方面显示出巨大的前景，但当合并训练了许多任务的“通才”模型时，合并的好处尚不清楚。我们通过\\textit{回收}在不同任务之间表现出权衡的检查点，探索在大（约 100B）模型的上下文中进行合并。此类检查点通常在开发前沿模型的过程中创建，许多次优检查点通常会被丢弃。给定从不同训练运行（例如，不同的阶段、目标、超参数和数据混合）获得的一组模型检查点，它们自然会显示不同语言能力之间的权衡（例如，指令遵循与代码生成），我们调查合并是否可以将此类次优模型回收成帕累托最优模型。我们的优化算法调整线性组合中每个检查点的权重，从而生成帕累托最优模型，该模型优于单个模型和基于合并的基准。进一步的分析表明，良好的合并往往包括几乎所有具有非零权重的检查点，这表明即使看似糟糕的初始检查点也可以促成良好的最终合并。", "author": "Muhammad Khalifa et.al.", "authors": "Muhammad Khalifa, Yi-Chern Tan, Arash Ahmadian, Tom Hosking, Honglak Lee, Lu Wang, Ahmet Üstün, Tom Sherborne, Matthias Gallé", "id": "2412.04144v1", "paper_url": "http://arxiv.org/abs/2412.04144v1", "repo": "null"}}