{"2412.17484": {"publish_time": "2024-12-23", "title": "Power- and Fragmentation-aware Online Scheduling for GPU Datacenters", "paper_summary": "The rise of Artificial Intelligence and Large Language Models is driving\nincreased GPU usage in data centers for complex training and inference tasks,\nimpacting operational costs, energy demands, and the environmental footprint of\nlarge-scale computing infrastructures. This work addresses the online\nscheduling problem in GPU datacenters, which involves scheduling tasks without\nknowledge of their future arrivals. We focus on two objectives: minimizing GPU\nfragmentation and reducing power consumption. GPU fragmentation occurs when\npartial GPU allocations hinder the efficient use of remaining resources,\nespecially as the datacenter nears full capacity. A recent scheduling policy,\nFragmentation Gradient Descent (FGD), leverages a fragmentation metric to\naddress this issue. Reducing power consumption is also crucial due to the\nsignificant power demands of GPUs. To this end, we propose PWR, a novel\nscheduling policy to minimize power usage by selecting power-efficient GPU and\nCPU combinations. This involves a simplified model for measuring power\nconsumption integrated into a Kubernetes score plugin. Through an extensive\nexperimental evaluation in a simulated cluster, we show how PWR, when combined\nwith FGD, achieves a balanced trade-off between reducing power consumption and\nminimizing GPU fragmentation.", "paper_summary_zh": "人工智慧與大型語言模型的崛起，推動了資料中心中 GPU 的使用量，以進行複雜的訓練和推理任務，影響了營運成本、能源需求，以及大型運算基礎設施的環境足跡。這項工作探討了 GPU 資料中心中的線上排程問題，這涉及在不知道未來到達情況下排程任務。我們專注於兩個目標：最小化 GPU 分割和減少耗電量。當部分 GPU 分配阻礙了剩餘資源的有效使用時，就會發生 GPU 分割，特別是在資料中心接近滿載時。最近的排程政策，分割梯度下降 (FGD)，利用分割指標來解決這個問題。由於 GPU 的龐大電力需求，減少耗電量也至關重要。為此，我們提出了 PWR，一種新的排程政策，透過選擇省電的 GPU 和 CPU 組合來最小化電力使用。這涉及簡化的電力消耗測量模型，整合到 Kubernetes 分數外掛程式中。透過在模擬叢集中進行廣泛的實驗評估，我們展示了 PWR 與 FGD 結合使用時，如何在減少耗電量和最小化 GPU 分割之間取得平衡的折衷。", "author": "Francesco Lettich et.al.", "authors": "Francesco Lettich, Emanuele Carlini, Franco Maria Nardini, Raffaele Perego, Salvatore Trani", "id": "2412.17484v1", "paper_url": "http://arxiv.org/abs/2412.17484v1", "repo": "https://github.com/fr4nz83/pwr-plugin-kubernetes"}}