{"2411.12882": {"publish_time": "2024-11-19", "title": "ProSec: Fortifying Code LLMs with Proactive Security Alignment", "paper_summary": "Recent advances in code-specific large language models (LLMs) have greatly\nenhanced code generation and refinement capabilities. However, the safety of\ncode LLMs remains under-explored, posing potential risks as insecure code\ngenerated by these models may introduce vulnerabilities into real-world\nsystems. Previous work proposes to collect security-focused instruction-tuning\ndataset from real-world vulnerabilities. It is constrained by the data sparsity\nof vulnerable code, and has limited applicability in the iterative\npost-training workflows of modern LLMs. In this paper, we propose ProSec, a\nnovel proactive security alignment approach designed to align code LLMs with\nsecure coding practices. ProSec systematically exposes the vulnerabilities in a\ncode LLM by synthesizing error-inducing coding scenarios from Common Weakness\nEnumerations (CWEs), and generates fixes to vulnerable code snippets, allowing\nthe model to learn secure practices through advanced preference learning\nobjectives. The scenarios synthesized by ProSec triggers 25 times more\nvulnerable code than a normal instruction-tuning dataset, resulting in a\nsecurity-focused alignment dataset 7 times larger than the previous work.\nExperiments show that models trained with ProSec is 29.2% to 35.5% more secure\ncompared to previous work, with a marginal negative effect of less than 2\npercentage points on model's utility.", "paper_summary_zh": "<paragraph>最近在特定代码大型语言模型 (LLM) 方面的进展极大地增强了代码生成和优化能力。然而，代码 LLM 的安全性仍未得到充分探索，因为这些模型生成的非安全代码可能会给现实世界的系统引入漏洞，从而带来潜在风险。以前的工作建议从现实世界的漏洞中收集以安全性为重点的指令微调数据集。它受到易受攻击代码数据稀疏性的限制，并且在现代 LLM 的迭代后训练工作流中的适用性有限。在本文中，我们提出了 ProSec，这是一种新颖的主动安全对齐方法，旨在将代码 LLM 与安全编码实践相一致。ProSec 通过从通用弱点枚举 (CWE) 中合成诱发错误的编码场景，系统地揭示了代码 LLM 中的漏洞，并生成易受攻击的代码片段的修复程序，从而使模型能够通过高级偏好学习目标来学习安全实践。ProSec 合成的场景触发比普通指令微调数据集多 25 倍的易受攻击代码，从而生成的安全重点对齐数据集比以前的工作大 7 倍。实验表明，与以前的工作相比，使用 ProSec 训练的模型的安全性提高了 29.2% 至 35.5%，对模型效用的负面影响不到 2 个百分点。</paragraph>", "author": "Xiangzhe Xu et.al.", "authors": "Xiangzhe Xu, Zian Su, Jinyao Guo, Kaiyuan Zhang, Zhenting Wang, Xiangyu Zhang", "id": "2411.12882v1", "paper_url": "http://arxiv.org/abs/2411.12882v1", "repo": "null"}}