{"2412.04121": {"publish_time": "2024-12-05", "title": "DeepFEA: Deep Learning for Prediction of Transient Finite Element Analysis Solutions", "paper_summary": "Finite Element Analysis (FEA) is a powerful but computationally intensive\nmethod for simulating physical phenomena. Recent advancements in machine\nlearning have led to surrogate models capable of accelerating FEA. Yet there\nare still limitations in developing surrogates of transient FEA models that can\nsimultaneously predict the solutions for both nodes and elements with\napplicability on both the 2D and 3D domains. Motivated by this research gap,\nthis study proposes DeepFEA, a deep learning-based framework that leverages a\nmultilayer Convolutional Long Short-Term Memory (ConvLSTM) network branching\ninto two parallel convolutional neural networks to predict the solutions for\nboth nodes and elements of FEA models. The proposed network is optimized using\na novel adaptive learning algorithm, called Node-Element Loss Optimization\n(NELO). NELO minimizes the error occurring at both branches of the network\nenabling the prediction of solutions for transient FEA simulations. The\nexperimental evaluation of DeepFEA is performed on three datasets in the\ncontext of structural mechanics, generated to serve as publicly available\nreference datasets. The results show that DeepFEA can achieve less than 3%\nnormalized mean and root mean squared error for 2D and 3D simulation scenarios,\nand inference times that are two orders of magnitude faster than FEA. In\ncontrast, relevant state-of-the-art methods face challenges with\nmulti-dimensional output and dynamic input prediction. Furthermore, DeepFEA's\nrobustness was demonstrated in a real-life biomedical scenario, confirming its\nsuitability for accurate and efficient predictions of FEA simulations.", "paper_summary_zh": "有限元分析 (FEA) 是一種強大但計算密集的方法，用於模擬物理現象。機器學習的最新進展導致了能夠加速 FEA 的代理模型。然而，仍存在開發瞬態 FEA 模型代理的限制，這些模型可以同時預測 2D 和 3D 域中節點和單元的解。受這一研究差距的啟發，本研究提出了 DeepFEA，這是一個基於深度學習的框架，利用多層卷積長短期記憶 (ConvLSTM) 網路分支到兩個並行的卷積神經網路，以預測 FEA 模型的節點和單元解。所提出的網路使用一種稱為節點元素損失優化 (NELO) 的新型自適應學習演算法進行優化。NELO 最小化網路兩個分支發生的錯誤，從而能夠預測瞬態 FEA 模擬的解。DeepFEA 的實驗評估是在結構力學的背景下對三個資料集進行的，這些資料集生成的目的是作為公開可用的參考資料集。結果表明，DeepFEA 可以實現 2D 和 3D 模擬場景的歸一化平均值和均方根誤差小於 3%，並且推理時間比 FEA 快兩個數量級。相比之下，相關的最新方法面臨多維輸出和動態輸入預測的挑戰。此外，DeepFEA 的穩健性在真實的生物醫學場景中得到證明，證實了其適用於準確有效地預測 FEA 模擬。", "author": "Georgios Triantafyllou et.al.", "authors": "Georgios Triantafyllou, Panagiotis G. Kalozoumis, George Dimas, Dimitris K. Iakovidis", "id": "2412.04121v1", "paper_url": "http://arxiv.org/abs/2412.04121v1", "repo": "null"}}