{"2408.14211": {"publish_time": "2024-08-26", "title": "MagicMan: Generative Novel View Synthesis of Humans with 3D-Aware Diffusion and Iterative Refinement", "paper_summary": "Existing works in single-image human reconstruction suffer from weak\ngeneralizability due to insufficient training data or 3D inconsistencies for a\nlack of comprehensive multi-view knowledge. In this paper, we introduce\nMagicMan, a human-specific multi-view diffusion model designed to generate\nhigh-quality novel view images from a single reference image. As its core, we\nleverage a pre-trained 2D diffusion model as the generative prior for\ngeneralizability, with the parametric SMPL-X model as the 3D body prior to\npromote 3D awareness. To tackle the critical challenge of maintaining\nconsistency while achieving dense multi-view generation for improved 3D human\nreconstruction, we first introduce hybrid multi-view attention to facilitate\nboth efficient and thorough information interchange across different views.\nAdditionally, we present a geometry-aware dual branch to perform concurrent\ngeneration in both RGB and normal domains, further enhancing consistency via\ngeometry cues. Last but not least, to address ill-shaped issues arising from\ninaccurate SMPL-X estimation that conflicts with the reference image, we\npropose a novel iterative refinement strategy, which progressively optimizes\nSMPL-X accuracy while enhancing the quality and consistency of the generated\nmulti-views. Extensive experimental results demonstrate that our method\nsignificantly outperforms existing approaches in both novel view synthesis and\nsubsequent 3D human reconstruction tasks.", "paper_summary_zh": "現有的單一影像人類重建工作由於訓練數據不足或缺乏全面的多視角知識而導致通用性較差。在本文中，我們介紹了 MagicMan，這是一個特定於人類的多視角擴散模型，旨在從單個參考影像生成高品質的新視角影像。作為其核心，我們利用預訓練的 2D 擴散模型作為生成先驗以提高通用性，並使用參數化 SMPL-X 模型作為 3D 身體先驗以促進 3D 感知。為了應對在改進的 3D 人體重建中保持一致性同時實現密集多視角生成的關鍵挑戰，我們首先引入了混合多視角注意力，以促進不同視角之間高效且徹底的資訊交換。此外，我們提出了一个感知幾何的雙分支，以在 RGB 和法線域中執行並行生成，進一步通過幾何線索增強一致性。最後但並非最不重要的一點是，為了解決因與參考影像衝突的不準確 SMPL-X 估計而產生的形狀不佳問題，我們提出了一種新的迭代精煉策略，該策略在提高生成多視角的品質和一致性的同時，逐步優化 SMPL-X 的準確性。大量的實驗結果表明，我們的方法在新的視角合成和後續的 3D 人體重建任務中都明顯優於現有的方法。", "author": "Xu He et.al.", "authors": "Xu He, Xiaoyu Li, Di Kang, Jiangnan Ye, Chaopeng Zhang, Liyang Chen, Xiangjun Gao, Han Zhang, Zhiyong Wu, Haolin Zhuang", "id": "2408.14211v1", "paper_url": "http://arxiv.org/abs/2408.14211v1", "repo": "null"}}