{"2411.12498": {"publish_time": "2024-11-19", "title": "Enhancing Reasoning Capabilities of LLMs via Principled Synthetic Logic Corpus", "paper_summary": "Large language models (LLMs) are capable of solving a wide range of tasks,\nyet they have struggled with reasoning. To address this, we propose\n$\\textbf{Additional Logic Training (ALT)}$, which aims to enhance LLMs'\nreasoning capabilities by program-generated logical reasoning samples. We first\nestablish principles for designing high-quality samples by integrating symbolic\nlogic theory and previous empirical insights. Then, based on these principles,\nwe construct a synthetic corpus named $\\textbf{Formal Logic Deduction Diverse}$\n($\\textbf{FLD}$$^{\\times 2}$), comprising numerous samples of multi-step\ndeduction with unknown facts, diverse reasoning rules, diverse linguistic\nexpressions, and challenging distractors. Finally, we empirically show that ALT\non FLD$^{\\times2}$ substantially enhances the reasoning capabilities of\nstate-of-the-art LLMs, including LLaMA-3.1-70B. Improvements include gains of\nup to 30 points on logical reasoning benchmarks, up to 10 points on math and\ncoding benchmarks, and 5 points on the benchmark suite BBH.", "paper_summary_zh": "大型語言模型 (LLM) 能解決廣泛的任務，但它們在推理方面卻遇到困難。為了解決這個問題，我們提出「額外邏輯訓練 (ALT)」，其目標是透過程式產生的邏輯推理範例來增強 LLM 的推理能力。我們首先透過整合符號邏輯理論和先前的經驗見解，建立設計高品質範例的原則。然後，根據這些原則，我們建構了一個名為「形式邏輯演繹多樣化」($\\textbf{FLD}$$^{\\times 2}$) 的合成語料庫，其中包含許多包含未知事實、多樣推理規則、多樣語言表達和具挑戰性干擾項的多步驟演繹範例。最後，我們透過實證顯示，針對 FLD$^{\\times2}$ 進行 ALT 能大幅增強最先進的 LLM（包括 LLaMA-3.1-70B）的推理能力。改進包括在邏輯推理基準上獲得高達 30 分的提升、在數學和程式設計基準上獲得高達 10 分的提升，以及在基準套件 BBH 上獲得 5 分的提升。", "author": "Terufumi Morishita et.al.", "authors": "Terufumi Morishita, Gaku Morio, Atsuki Yamaguchi, Yasuhiro Sogawa", "id": "2411.12498v1", "paper_url": "http://arxiv.org/abs/2411.12498v1", "repo": "null"}}