{"2406.17647": {"publish_time": "2024-06-25", "title": "Variationist: Exploring Multifaceted Variation and Bias in Written Language Data", "paper_summary": "Exploring and understanding language data is a fundamental stage in all areas\ndealing with human language. It allows NLP practitioners to uncover quality\nconcerns and harmful biases in data before training, and helps linguists and\nsocial scientists to gain insight into language use and human behavior. Yet,\nthere is currently a lack of a unified, customizable tool to seamlessly inspect\nand visualize language variation and bias across multiple variables, language\nunits, and diverse metrics that go beyond descriptive statistics. In this\npaper, we introduce Variationist, a highly-modular, extensible, and\ntask-agnostic tool that fills this gap. Variationist handles at once a\npotentially unlimited combination of variable types and semantics across\ndiversity and association metrics with regards to the language unit of choice,\nand orchestrates the creation of up to five-dimensional interactive charts for\nover 30 variable type-semantics combinations. Through our case studies on\ncomputational dialectology, human label variation, and text generation, we show\nhow Variationist enables researchers from different disciplines to effortlessly\nanswer specific research questions or unveil undesired associations in language\ndata. A Python library, code, documentation, and tutorials are made publicly\navailable to the research community.", "paper_summary_zh": "探索和理解語言資料是所有處理人類語言領域的基本階段。它允許 NLP 從業人員在訓練前發現資料中的品質問題和有害偏見，並幫助語言學家和社會科學家深入了解語言使用和人類行為。然而，目前缺乏一個統一的、可自訂的工具來無縫地檢查和視覺化跨多個變數、語言單位和超越描述性統計的各種指標的語言變異和偏見。在本文中，我們介紹了 Variationist，這是一個高度模組化、可擴充且與任務無關的工具，填補了這一空白。Variationist 同時處理變數類型和語義的潛在無限組合，跨越與所選語言單位的相關性和關聯性指標，並協調建立多達五維互動圖表，以涵蓋 30 多個變數類型語義組合。透過我們在計算方言學、人類標籤變異和文本生成的案例研究，我們展示了 Variationist 如何使不同領域的研究人員能夠毫不費力地回答具體的研究問題或揭示語言資料中不需要的關聯性。Python 庫、程式碼、文件和教學課程已公開提供給研究社群。", "author": "Alan Ramponi et.al.", "authors": "Alan Ramponi, Camilla Casula, Stefano Menini", "id": "2406.17647v1", "paper_url": "http://arxiv.org/abs/2406.17647v1", "repo": "null"}}