{"2503.07675": {"publish_time": "2025-03-10", "title": "DynTaskMAS: A Dynamic Task Graph-driven Framework for Asynchronous and Parallel LLM-based Multi-Agent Systems", "paper_summary": "The emergence of Large Language Models (LLMs) in Multi-Agent Systems (MAS)\nhas opened new possibilities for artificial intelligence, yet current\nimplementations face significant challenges in resource management, task\ncoordination, and system efficiency. While existing frameworks demonstrate the\npotential of LLM-based agents in collaborative problem-solving, they often lack\nsophisticated mechanisms for parallel execution and dynamic task management.\nThis paper introduces DynTaskMAS, a novel framework that orchestrates\nasynchronous and parallel operations in LLM-based MAS through dynamic task\ngraphs. The framework features four key innovations: (1) a Dynamic Task Graph\nGenerator that intelligently decomposes complex tasks while maintaining logical\ndependencies, (2) an Asynchronous Parallel Execution Engine that optimizes\nresource utilization through efficient task scheduling, (3) a Semantic-Aware\nContext Management System that enables efficient information sharing among\nagents, and (4) an Adaptive Workflow Manager that dynamically optimizes system\nperformance. Experimental evaluations demonstrate that DynTaskMAS achieves\nsignificant improvements over traditional approaches: a 21-33% reduction in\nexecution time across task complexities (with higher gains for more complex\ntasks), a 35.4% improvement in resource utilization (from 65% to 88%), and\nnear-linear throughput scaling up to 16 concurrent agents (3.47X improvement\nfor 4X agents). Our framework establishes a foundation for building scalable,\nhigh-performance LLM-based multi-agent systems capable of handling complex,\ndynamic tasks efficiently.", "paper_summary_zh": "大型語言模型 (LLM) 出現在多代理系統 (MAS) 中為人工智慧開闢了新的可能性，但目前的實現在資源管理、任務協調和系統效率方面仍面臨重大挑戰。雖然現有框架展示了基於 LLM 的代理在協作解決問題方面的潛力，但它們通常缺乏用於平行執行和動態任務管理的複雜機制。本文介紹了 DynTaskMAS，這是一個通過動態任務圖來協調基於 LLM 的 MAS 中的非同步和平行操作的新穎框架。該框架具有四項關鍵創新：(1) 一個動態任務圖生成器，它可以智能地分解複雜任務，同時保持邏輯依賴關係；(2) 一個非同步平行執行引擎，它可以通過有效的任務調度來優化資源利用率；(3) 一個語義感知上下文管理系統，它可以在代理之間實現高效的信息共享；以及 (4) 一個自適應工作流程管理器，它可以動態優化系統性能。實驗評估表明，DynTaskMAS比傳統方法取得了顯著的改進：在各種任務複雜度下執行時間減少了 21-33%（更複雜的任務獲得更高的收益），資源利用率提高了 35.4%（從 65% 提高到 88%），並且在多達 16 個並行代理的情況下吞吐量接近線性擴展（4 倍代理的情況下提高了 3.47 倍）。我們的框架為構建可擴展、高性能的基於 LLM 的多代理系統奠定了基礎，使其能夠高效地處理複雜的動態任務。\n", "author": "Junwei Yu et.al.", "authors": "Junwei Yu, Yepeng Ding, Hiroyuki Sato", "id": "2503.07675v1", "paper_url": "http://arxiv.org/abs/2503.07675v1", "repo": "null"}}