{"2406.14503": {"publish_time": "2024-06-20", "title": "Overview of the CAIL 2023 Argument Mining Track", "paper_summary": "We give a detailed overview of the CAIL 2023 Argument Mining Track, one of\nthe Chinese AI and Law Challenge (CAIL) 2023 tracks. The main goal of the track\nis to identify and extract interacting argument pairs in trial dialogs. It\nmainly uses summarized judgment documents but can also refer to trial\nrecordings. The track consists of two stages, and we introduce the tasks\ndesigned for each stage; we also extend the data from previous events into a\nnew dataset -- CAIL2023-ArgMine -- with annotated new cases from various causes\nof action. We outline several submissions that achieve the best results,\nincluding their methods for different stages. While all submissions rely on\nlanguage models, they have incorporated strategies that may benefit future work\nin this field.", "paper_summary_zh": "我們提供了 CAIL 2023 論證挖掘軌道的詳細概述，這是中國人工智能與法律挑戰 (CAIL) 2023 軌道之一。軌道的目標是識別和提取審判對話中的互動論證對。它主要使用總結的判決文件，但也可以參考審判記錄。軌道包含兩個階段，我們介紹了為每個階段設計的任務；我們還將以前活動的數據擴展到一個新的數據集——CAIL2023-ArgMine——其中包含來自各種訴因的註釋新案例。我們概述了取得最佳結果的幾個提交，包括它們在不同階段的方法。雖然所有提交都依賴於語言模型，但它們已納入可能有利於該領域未來工作的策略。", "author": "Jingcong Liang et.al.", "authors": "Jingcong Liang, Junlong Wang, Xinyu Zhai, Yungui Zhuang, Yiyang Zheng, Xin Xu, Xiandong Ran, Xiaozheng Dong, Honghui Rong, Yanlun Liu, Hao Chen, Yuhan Wei, Donghai Li, Jiajie Peng, Xuanjing Huang, Chongde Shi, Yansong Feng, Yun Song, Zhongyu Wei", "id": "2406.14503v1", "paper_url": "http://arxiv.org/abs/2406.14503v1", "repo": "null"}}