{"2411.08561": {"publish_time": "2024-11-13", "title": "LogLLM: Log-based Anomaly Detection Using Large Language Models", "paper_summary": "Software systems often record important runtime information in logs to help\nwith troubleshooting. Log-based anomaly detection has become a key research\narea that aims to identify system issues through log data, ultimately enhancing\nthe reliability of software systems. Traditional deep learning methods often\nstruggle to capture the semantic information embedded in log data, which is\ntypically organized in natural language. In this paper, we propose LogLLM, a\nlog-based anomaly detection framework that leverages large language models\n(LLMs). LogLLM employs BERT for extracting semantic vectors from log messages,\nwhile utilizing Llama, a transformer decoder-based model, for classifying log\nsequences. Additionally, we introduce a projector to align the vector\nrepresentation spaces of BERT and Llama, ensuring a cohesive understanding of\nlog semantics. Unlike conventional methods that require log parsers to extract\ntemplates, LogLLM preprocesses log messages with regular expressions,\nstreamlining the entire process. Our framework is trained through a novel\nthree-stage procedure designed to enhance performance and adaptability.\nExperimental results across four public datasets demonstrate that LogLLM\noutperforms state-of-the-art methods. Even when handling unstable logs, it\neffectively captures the semantic meaning of log messages and detects anomalies\naccurately.", "paper_summary_zh": "軟體系統通常會在記錄檔中記錄重要的執行時間資訊，以協助進行疑難排解。基於記錄檔的異常偵測已成為一個重要的研究領域，其目標是透過記錄檔資料找出系統問題，最終提升軟體系統的可靠性。傳統的深度學習方法通常難以擷取嵌入在記錄檔資料中的語意資訊，而這些資訊通常以自然語言組織。在本文中，我們提出 LogLLM，一個基於記錄檔的異常偵測架構，它利用大型語言模型 (LLM)。LogLLM 使用 BERT 從記錄檔訊息中萃取語意向量，同時利用 Llama，一個基於轉換器解碼器的模型，來分類記錄檔序列。此外，我們引入一個投影機來對齊 BERT 和 Llama 的向量表示空間，確保對記錄檔語意的理解具有一致性。與需要記錄檔解析器來萃取範本的傳統方法不同，LogLLM 使用正規表示式預處理記錄檔訊息，簡化了整個流程。我們的架構透過一個創新的三階段程序進行訓練，旨在提升效能和適應性。在四個公開資料集上的實驗結果證明，LogLLM 優於最先進的方法。即使在處理不穩定的記錄檔時，它也能有效地擷取記錄檔訊息的語意意義，並準確地偵測異常。", "author": "Wei Guan et.al.", "authors": "Wei Guan, Jian Cao, Shiyou Qian, Jianqi Gao", "id": "2411.08561v1", "paper_url": "http://arxiv.org/abs/2411.08561v1", "repo": "https://github.com/guanwei49/logllm"}}