{"2407.04681": {"publish_time": "2024-07-05", "title": "Rethinking Visual Prompting for Multimodal Large Language Models with External Knowledge", "paper_summary": "In recent years, multimodal large language models (MLLMs) have made\nsignificant strides by training on vast high-quality image-text datasets,\nenabling them to generally understand images well. However, the inherent\ndifficulty in explicitly conveying fine-grained or spatially dense information\nin text, such as masks, poses a challenge for MLLMs, limiting their ability to\nanswer questions requiring an understanding of detailed or localized visual\nelements. Drawing inspiration from the Retrieval-Augmented Generation (RAG)\nconcept, this paper proposes a new visual prompt approach to integrate\nfine-grained external knowledge, gleaned from specialized vision models (e.g.,\ninstance segmentation/OCR models), into MLLMs. This is a promising yet\nunderexplored direction for enhancing MLLMs' performance. Our approach diverges\nfrom concurrent works, which transform external knowledge into additional text\nprompts, necessitating the model to indirectly learn the correspondence between\nvisual content and text coordinates. Instead, we propose embedding fine-grained\nknowledge information directly into a spatial embedding map as a visual prompt.\nThis design can be effortlessly incorporated into various MLLMs, such as LLaVA\nand Mipha, considerably improving their visual understanding performance.\nThrough rigorous experiments, we demonstrate that our method can enhance MLLM\nperformance across nine benchmarks, amplifying their fine-grained context-aware\ncapabilities.", "paper_summary_zh": "近年來，多模態大型語言模型 (MLLM) 在大量高品質影像文字資料集上訓練後，已取得顯著進展，讓它們能普遍理解影像。然而，在文字中明確傳達精細或空間密集的資訊（例如遮罩）的固有困難，對 MLLM 構成挑戰，限制了它們回答需要了解詳細或局部視覺元素的問題的能力。本文從檢索增強生成 (RAG) 概念中汲取靈感，提出了一種新的視覺提示方法，以整合從專業視覺模型（例如實例分割/OCR 模型）收集到的精細外部知識，融入 MLLM 中。這是增強 MLLM 效能的一個有前景但尚未充分探索的方向。我們的做法與同時進行的工作不同，這些工作將外部知識轉換為額外的文字提示，需要模型間接學習視覺內容和文字座標之間的對應關係。相反地，我們建議將精細的知識資訊直接嵌入空間嵌入映射中，作為視覺提示。此設計可以毫不費力地整合到各種 MLLM 中，例如 LLaVA 和 Mipha，大幅提升它們的視覺理解效能。透過嚴謹的實驗，我們證明了我們的方法可以增強 MLLM 在九個基準測試中的效能，擴大它們的精細脈絡感知能力。", "author": "Yuanze Lin et.al.", "authors": "Yuanze Lin, Yunsheng Li, Dongdong Chen, Weijian Xu, Ronald Clark, Philip Torr, Lu Yuan", "id": "2407.04681v1", "paper_url": "http://arxiv.org/abs/2407.04681v1", "repo": "null"}}