{"2410.14763": {"publish_time": "2024-10-18", "title": "Enabling Scalable Evaluation of Bias Patterns in Medical LLMs", "paper_summary": "Large language models (LLMs) have shown impressive potential in helping with\nnumerous medical challenges. Deploying LLMs in high-stakes applications such as\nmedicine, however, brings in many concerns. One major area of concern relates\nto biased behaviors of LLMs in medical applications, leading to unfair\ntreatment of individuals. To pave the way for the responsible and impactful\ndeployment of Med LLMs, rigorous evaluation is a key prerequisite. Due to the\nhuge complexity and variability of different medical scenarios, existing work\nin this domain has primarily relied on using manually crafted datasets for bias\nevaluation. In this study, we present a new method to scale up such bias\nevaluations by automatically generating test cases based on rigorous medical\nevidence. We specifically target the challenges of a) domain-specificity of\nbias characterization, b) hallucinating while generating the test cases, and c)\nvarious dependencies between the health outcomes and sensitive attributes. To\nthat end, we offer new methods to address these challenges integrated with our\ngenerative pipeline, using medical knowledge graphs, medical ontologies, and\ncustomized general LLM evaluation frameworks in our method. Through a series of\nextensive experiments, we show that the test cases generated by our proposed\nmethod can effectively reveal bias patterns in Med LLMs at larger and more\nflexible scales than human-crafted datasets. We publish a large bias evaluation\ndataset using our pipeline, which is dedicated to a few medical case studies. A\nlive demo of our application for vignette generation is available at\nhttps://vignette.streamlit.app. Our code is also available at\nhttps://github.com/healthylaife/autofair.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出在協助解決\n許多醫療挑戰方面的驚人潛力。然而，在高風險應用程式（例如\n醫療）中部署 LLM 會帶來許多疑慮。一個主要的疑慮領域與\n醫療應用程式中 LLM 的偏見行為有關，導致對個人不公平的\n待遇。為了為負責任且有影響力的 Med LLM 部署鋪路，嚴謹的\n評估是一項關鍵前提。由於不同醫療場景的複雜性和變異性極大，\n此領域現有的工作主要依賴使用人工製作的資料集進行偏見\n評估。在本研究中，我們提出了一種新的方法，可以根據嚴謹的醫療\n證據自動產生測試案例，以擴大此類偏見評估。我們特別針對\na) 偏見特徵的領域專屬性、b) 在產生測試案例時出現幻覺，以及 c)\n健康結果和敏感屬性之間的各種依賴性等挑戰。為此，我們提供\n新的方法來解決這些挑戰，並將其與我們的生成管道整合，在我們的\n方法中使用醫療知識圖、醫療本体和自訂的通用 LLM 評估架構。透過\n一系列廣泛的實驗，我們表明我們提出的方法產生的測試案例可以有效\n揭示 Med LLM 中的偏見模式，其規模比人工製作的資料集更大且更具\n彈性。我們使用我們的管道發布了一個大型偏見評估資料集，該資料集\n專門針對一些醫療案例研究。我們的小插圖生成應用程式的現場示範\n可在 https://vignette.streamlit.app 取得。我們的程式碼也可在\nhttps://github.com/healthylaife/autofair 取得。", "author": "Hamed Fayyaz et.al.", "authors": "Hamed Fayyaz, Raphael Poulain, Rahmatollah Beheshti", "id": "2410.14763v1", "paper_url": "http://arxiv.org/abs/2410.14763v1", "repo": "https://github.com/healthylaife/autofair"}}