{"2410.08023": {"publish_time": "2024-10-10", "title": "GrabDAE: An Innovative Framework for Unsupervised Domain Adaptation Utilizing Grab-Mask and Denoise Auto-Encoder", "paper_summary": "Unsupervised Domain Adaptation (UDA) aims to adapt a model trained on a\nlabeled source domain to an unlabeled target domain by addressing the domain\nshift. Existing Unsupervised Domain Adaptation (UDA) methods often fall short\nin fully leveraging contextual information from the target domain, leading to\nsuboptimal decision boundary separation during source and target domain\nalignment. To address this, we introduce GrabDAE, an innovative UDA framework\ndesigned to tackle domain shift in visual classification tasks. GrabDAE\nincorporates two key innovations: the Grab-Mask module, which blurs background\ninformation in target domain images, enabling the model to focus on essential,\ndomain-relevant features through contrastive learning; and the Denoising\nAuto-Encoder (DAE), which enhances feature alignment by reconstructing features\nand filtering noise, ensuring a more robust adaptation to the target domain.\nThese components empower GrabDAE to effectively handle unlabeled target domain\ndata, significantly improving both classification accuracy and robustness.\nExtensive experiments on benchmark datasets, including VisDA-2017, Office-Home,\nand Office31, demonstrate that GrabDAE consistently surpasses state-of-the-art\nUDA methods, setting new performance benchmarks. By tackling UDA's critical\nchallenges with its novel feature masking and denoising approach, GrabDAE\noffers both significant theoretical and practical advancements in domain\nadaptation.", "paper_summary_zh": "無監督域適應 (UDA) 旨在透過解決域轉移，將在標籤來源域上訓練的模型適應到未標籤目標域。現有的無監督域適應 (UDA) 方法通常無法充分利用來自目標域的上下文資訊，導致在來源和目標域比對期間，次佳決策邊界分離。為了解決這個問題，我們引入了 GrabDAE，這是一個創新的 UDA 架構，旨在處理視覺分類任務中的域轉移。GrabDAE 結合了兩項關鍵創新：Grab-Mask 模組，它模糊了目標域影像中的背景資訊，使模型能夠透過對比學習專注於必要的、與域相關的特徵；以及去雜訊自動編碼器 (DAE)，它透過重建特徵和過濾雜訊來增強特徵比對，確保更強健的目標域適應。這些元件賦予 GrabDAE 有效處理未標籤目標域資料的能力，大幅提升分類準確度和強健性。在包括 VisDA-2017、Office-Home 和 Office31 在內的基準資料集上進行的廣泛實驗證明，GrabDAE 持續超越最先進的 UDA 方法，設定新的效能基準。透過利用其新穎的特徵遮罩和去雜訊方法來解決 UDA 的關鍵挑戰，GrabDAE 在域適應中提供了重要的理論和實務進展。", "author": "Junzhou Chen et.al.", "authors": "Junzhou Chen, Xuan Wen, Ronghui Zhang, Bingtao Ren, Di Wu, Zhigang Xu, Danwei Wang", "id": "2410.08023v1", "paper_url": "http://arxiv.org/abs/2410.08023v1", "repo": "null"}}