{"2408.14283": {"publish_time": "2024-08-26", "title": "Predictability and Causality in Spanish and English Natural Language Generation", "paper_summary": "In recent years, the field of Natural Language Generation (NLG) has been\nboosted by the recent advances in deep learning technologies. Nonetheless,\nthese new data-intensive methods introduce language-dependent disparities in\nNLG as the main training data sets are in English. Also, most neural NLG\nsystems use decoder-only (causal) transformer language models, which work well\nfor English, but were not designed with other languages in mind. In this work\nwe depart from the hypothesis that they may introduce generation bias in target\nlanguages with less rigid word ordering, subject omission, or different\nattachment preferences for relative clauses, so that for these target languages\nother language generation strategies may be more desirable. This paper first\ncompares causal and non-causal language modeling for English and Spanish, two\nlanguages with different grammatical structures and over 1.5 billion and 0.5\nbillion speakers, respectively. For this purpose, we define a novel metric of\naverage causal and non-causal context-conditioned entropy of the grammatical\ncategory distribution for both languages as an information-theoretic a priori\napproach. The evaluation of natural text sources (such as training data) in\nboth languages reveals lower average non-causal conditional entropy in Spanish\nand lower causal conditional entropy in English. According to this experiment,\nSpanish is more predictable than English given a non-causal context. Then, by\napplying a conditional relative entropy metric to text generation experiments,\nwe obtain as insights that the best performance is respectively achieved with\ncausal NLG in English, and with non-causal NLG in Spanish. These insights\nsupport further research in NLG in Spanish using bidirectional transformer\nlanguage models.", "paper_summary_zh": "近年來，自然語言生成（NLG）領域因深度學習技術的最新進展而獲得提升。儘管如此，這些新的資料密集方法引入了 NLG 中依賴語言的差異，因為主要的訓練資料集都是英文。此外，大多數神經 NLG 系統使用僅解碼器（因果）Transformer語言模型，這些模型適用於英文，但並非針對其他語言設計。在這項工作中，我們跳脫了它們可能會在目標語言中引入生成偏差的假設，這些語言的詞序較不嚴謹、省略主詞，或對關聯子句有不同的依附偏好，因此對於這些目標語言，其他語言生成策略可能更可取。本文首先比較了因果和非因果語言建模，比較英文和西班牙文這兩種語法結構不同的語言，分別有超過 15 億和 5 億的使用者。為此，我們定義了一個新的指標，即語法類別分佈的平均因果和非因果條件熵，作為這兩種語言的資訊理論先驗方法。對這兩種語言的自然文字來源（例如訓練資料）的評估顯示，西班牙文的平均非因果條件熵較低，而英文的因果條件熵較低。根據這個實驗，在非因果條件下，西班牙文比英文更具可預測性。然後，透過將條件相對熵指標應用於文字生成實驗，我們獲得的見解是，在英文中使用因果 NLG，在西班牙文中使用非因果 NLG，分別能獲得最佳效能。這些見解支持使用雙向Transformer語言模型進一步研究西班牙文的 NLG。", "author": "Andrea Busto-Castiñeira et.al.", "authors": "Andrea Busto-Castiñeira, Francisco J. González-Castaño, Silvia García-Méndez, Francisco de Arriba-Pérez", "id": "2408.14283v1", "paper_url": "http://arxiv.org/abs/2408.14283v1", "repo": "null"}}