{"2409.18014": {"publish_time": "2024-09-26", "title": "Role-RL: Online Long-Context Processing with Role Reinforcement Learning for Distinct LLMs in Their Optimal Roles", "paper_summary": "Large language models (LLMs) with long-context processing are still\nchallenging because of their implementation complexity, training efficiency and\ndata sparsity. To address this issue, a new paradigm named Online Long-context\nProcessing (OLP) is proposed when we process a document of unlimited length,\nwhich typically occurs in the information reception and organization of diverse\nstreaming media such as automated news reporting, live e-commerce, and viral\nshort videos. Moreover, a dilemma was often encountered when we tried to select\nthe most suitable LLM from a large number of LLMs amidst explosive growth\naiming for outstanding performance, affordable prices, and short response\ndelays. In view of this, we also develop Role Reinforcement Learning (Role-RL)\nto automatically deploy different LLMs in their respective roles within the OLP\npipeline according to their actual performance. Extensive experiments are\nconducted on our OLP-MINI dataset and it is found that OLP with Role-RL\nframework achieves OLP benchmark with an average recall rate of 93.2% and the\nLLM cost saved by 79.4%. The code and dataset are publicly available at:\nhttps://anonymous.4open.science/r/Role-RL.", "paper_summary_zh": "大型語言模型 (LLM) 具有長語境處理能力，但由於其複雜的實作、訓練效率和資料稀疏性，仍面臨挑戰。為了解決這個問題，當我們處理長度不限的文件時，提出了一種名為線上長語境處理 (OLP) 的新範例，這通常發生在自動化新聞報導、直播電子商務和病毒式短影片等各種串流媒體的資訊接收和組織中。此外，在爆炸性的成長中，我們嘗試從大量的 LLM 中選擇最合適的 LLM 時，經常會遇到兩難的局面，目標是追求傑出的效能、負擔得起的價格和短暫的回應延遲。有鑑於此，我們也開發了角色強化學習 (Role-RL) 以根據其實際效能，在 OLP 管線中自動部署不同的 LLM 到各自的角色中。在我們的 OLP-MINI 資料集上進行了廣泛的實驗，發現採用角色強化學習架構的 OLP 達到了 OLP 評量標準，平均召回率為 93.2%，且 LLM 成本節省了 79.4%。程式碼和資料集已公開於：https://anonymous.4open.science/r/Role-RL。", "author": "Lewei He et.al.", "authors": "Lewei He, Tianyu Shi, Pengran Huang, Bingzhi Chen, Qianglong Chen, Jiahui Pan", "id": "2409.18014v1", "paper_url": "http://arxiv.org/abs/2409.18014v1", "repo": "null"}}