{"2503.20648": {"publish_time": "2025-03-26", "title": "TN-Eval: Rubric and Evaluation Protocols for Measuring the Quality of Behavioral Therapy Notes", "paper_summary": "Behavioral therapy notes are important for both legal compliance and patient\ncare. Unlike progress notes in physical health, quality standards for\nbehavioral therapy notes remain underdeveloped. To address this gap, we\ncollaborated with licensed therapists to design a comprehensive rubric for\nevaluating therapy notes across key dimensions: completeness, conciseness, and\nfaithfulness. Further, we extend a public dataset of behavioral health\nconversations with therapist-written notes and LLM-generated notes, and apply\nour evaluation framework to measure their quality. We find that: (1) A\nrubric-based manual evaluation protocol offers more reliable and interpretable\nresults than traditional Likert-scale annotations. (2) LLMs can mimic human\nevaluators in assessing completeness and conciseness but struggle with\nfaithfulness. (3) Therapist-written notes often lack completeness and\nconciseness, while LLM-generated notes contain hallucination. Surprisingly, in\na blind test, therapists prefer and judge LLM-generated notes to be superior to\ntherapist-written notes.", "paper_summary_zh": "行為治療紀錄對於法律合規性和病患照護都至關重要。與身體健康方面的進展紀錄不同，行為治療紀錄的品質標準仍然不夠完善。為了彌補這一差距，我們與持有執照的治療師合作，設計了一個全面的評分標準，用於從完整性、簡潔性和準確性等關鍵面向評估治療紀錄。此外，我們擴展了一個公開的行為健康對話數據集，其中包含治療師撰寫的紀錄和大型語言模型 (LLM) 生成的紀錄，並應用我們的評估框架來衡量它們的品質。我們發現：(1) 與傳統的李克特量表註釋相比，基於評分標準的人工評估協議能提供更可靠且更易於理解的結果。(2) 大型語言模型可以模仿人類評估者評估完整性和簡潔性，但在準確性方面卻有所不足。(3) 治療師撰寫的紀錄通常缺乏完整性和簡潔性，而大型語言模型生成的紀錄則包含虛構的內容。令人驚訝的是，在盲測中，治療師更喜歡大型語言模型生成的紀錄，並認為它們優於治療師撰寫的紀錄。\n", "author": "Raj Sanjay Shah et.al.", "authors": "Raj Sanjay Shah, Lei Xu, Qianchu Liu, Jon Burnsky, Drew Bertagnolli, Chaitanya Shivade", "id": "2503.20648v1", "paper_url": "http://arxiv.org/abs/2503.20648v1", "repo": "null"}}