{"2409.16096": {"publish_time": "2024-09-24", "title": "Exploring Hint Generation Approaches in Open-Domain Question Answering", "paper_summary": "Automatic Question Answering (QA) systems rely on contextual information to\nprovide accurate answers. Commonly, contexts are prepared through either\nretrieval-based or generation-based methods. The former involves retrieving\nrelevant documents from a corpus like Wikipedia, whereas the latter uses\ngenerative models such as Large Language Models (LLMs) to generate the context.\nIn this paper, we introduce a novel context preparation approach called HINTQA,\nwhich employs Automatic Hint Generation (HG) techniques. Unlike traditional\nmethods, HINTQA prompts LLMs to produce hints about potential answers for the\nquestion rather than generating relevant context. We evaluate our approach\nacross three QA datasets including TriviaQA, NaturalQuestions, and Web\nQuestions, examining how the number and order of hints impact performance. Our\nfindings show that the HINTQA surpasses both retrieval-based and\ngeneration-based approaches. We demonstrate that hints enhance the accuracy of\nanswers more than retrieved and generated contexts.", "paper_summary_zh": "自動問答 (QA) 系統依賴上下文資訊提供精確答案。一般來說，上下文是透過擷取式或生成式方法準備的。前者涉及從維基百科等語料庫中擷取相關文件，而後者使用生成式模型，例如大型語言模型 (LLM)，來產生上下文。在本文中，我們介紹一種稱為 HINTQA 的新穎上下文準備方法，它採用自動提示生成 (HG) 技術。與傳統方法不同，HINTQA 會提示 LLM 產生有關問題潛在答案的提示，而不是產生相關的上下文。我們在三個 QA 資料集（包括 TriviaQA、NaturalQuestions 和 Web Questions）中評估我們的做法，探討提示的數量和順序如何影響效能。我們的研究結果顯示，HINTQA 超越了基於擷取和基於生成的兩種方法。我們證明提示比擷取和生成的上下文更能增強答案的準確性。", "author": "Jamshid Mozafari et.al.", "authors": "Jamshid Mozafari, Abdelrahman Abdallah, Bhawna Piryani, Adam Jatowt", "id": "2409.16096v1", "paper_url": "http://arxiv.org/abs/2409.16096v1", "repo": "https://github.com/datascienceuibk/hintqa"}}