{"2408.06303": {"publish_time": "2024-08-12", "title": "Long-Form Answers to Visual Questions from Blind and Low Vision People", "paper_summary": "Vision language models can now generate long-form answers to questions about\nimages - long-form visual question answers (LFVQA). We contribute VizWiz-LF, a\ndataset of long-form answers to visual questions posed by blind and low vision\n(BLV) users. VizWiz-LF contains 4.2k long-form answers to 600 visual questions,\ncollected from human expert describers and six VQA models. We develop and\nannotate functional roles of sentences of LFVQA and demonstrate that long-form\nanswers contain information beyond the question answer such as explanations and\nsuggestions. We further conduct automatic and human evaluations with BLV and\nsighted people to evaluate long-form answers. BLV people perceive both\nhuman-written and generated long-form answers to be plausible, but generated\nanswers often hallucinate incorrect visual details, especially for unanswerable\nvisual questions (e.g., blurry or irrelevant images). To reduce hallucinations,\nwe evaluate the ability of VQA models to abstain from answering unanswerable\nquestions across multiple prompting strategies.", "paper_summary_zh": "視覺語言模型現在可以針對圖片問題產生長篇答案，也就是長篇視覺問題解答 (LFVQA)。我們貢獻了 VizWiz-LF，這是一個長篇答案的資料集，由失明和視力低 (BLV) 的使用者提出的視覺問題。VizWiz-LF 包含 4.2k 個長篇答案，針對 600 個視覺問題，由人類專家描述者和六個 VQA 模型收集。我們開發並註解 LFVQA 句子的功能角色，並證明長篇答案包含了問題答案以外的資訊，例如解釋和建議。我們進一步與 BLV 和視力正常的人進行自動和人工評估，以評估長篇答案。BLV 人士認為，人類撰寫和產生的長篇答案都合理，但產生的答案通常會產生不正確的視覺細節，特別是針對無法回答的視覺問題（例如模糊或不相關的圖片）。為了減少幻覺，我們評估 VQA 模型在多種提示策略下，避免回答無法回答的問題的能力。", "author": "Mina Huh et.al.", "authors": "Mina Huh, Fangyuan Xu, Yi-Hao Peng, Chongyan Chen, Hansika Murugu, Danna Gurari, Eunsol Choi, Amy Pavel", "id": "2408.06303v1", "paper_url": "http://arxiv.org/abs/2408.06303v1", "repo": "null"}}