{"2406.16743": {"publish_time": "2024-06-24", "title": "Adversarial Contrastive Decoding: Boosting Safety Alignment of Large Language Models via Opposite Prompt Optimization", "paper_summary": "With the widespread application of Large Language Models (LLMs), it has\nbecome a significant concern to ensure their safety and prevent harmful\nresponses. While current safe-alignment methods based on instruction\nfine-tuning and Reinforcement Learning from Human Feedback (RLHF) can\neffectively reduce harmful responses from LLMs, they often require high-quality\ndatasets and heavy computational overhead during model training. Another way to\nalign language models is to modify the logit of tokens in model outputs without\nheavy training. Recent studies have shown that contrastive decoding can enhance\nthe performance of language models by reducing the likelihood of confused\ntokens. However, these methods require the manual selection of contrastive\nmodels or instruction templates. To this end, we propose Adversarial\nContrastive Decoding (ACD), an optimization-based framework to generate two\nopposite system prompts for prompt-based contrastive decoding. ACD only needs\nto apply a lightweight prompt tuning on a rather small anchor dataset (< 3 min\nfor each model) without training the target model. Experiments conducted on\nextensive models and benchmarks demonstrate that the proposed method achieves\nmuch better safety performance than previous model training-free decoding\nmethods without sacrificing its original generation ability.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的廣泛應用，確保其安全性並防止有害回應已成為一個重要的問題。雖然基於指令微調和人類回饋強化學習 (RLHF) 的現有安全對齊方法可以有效減少 LLM 的有害回應，但它們通常需要高品質的資料集和在模型訓練期間大量的計算負擔。對齊語言模型的另一種方法是在不進行大量訓練的情況下修改模型輸出中標記的 logit。最近的研究表明，對比解碼可以透過降低混淆標記的可能性來增強語言模型的效能。然而，這些方法需要手動選擇對比模型或指令範本。為此，我們提出了對抗性對比解碼 (ACD)，這是一個基於最佳化的架構，用於為基於提示的對比解碼產生兩個相反的系統提示。ACD 只需要在一個相當小的錨定資料集上套用輕量級提示調整（每個模型小於 3 分鐘），而無需訓練目標模型。在廣泛的模型和基準上進行的實驗表明，所提出的方法比先前的模型訓練免費解碼方法實現了更好的安全性，同時不犧牲其原始的生成能力。", "author": "Zhengyue Zhao et.al.", "authors": "Zhengyue Zhao, Xiaoyun Zhang, Kaidi Xu, Xing Hu, Rui Zhang, Zidong Du, Qi Guo, Yunji Chen", "id": "2406.16743v1", "paper_url": "http://arxiv.org/abs/2406.16743v1", "repo": "null"}}