{"2407.13292": {"publish_time": "2024-07-18", "title": "Low-Resourced Speech Recognition for Iu Mien Language via Weakly-Supervised Phoneme-based Multilingual Pre-training", "paper_summary": "The mainstream automatic speech recognition (ASR) technology usually requires\nhundreds to thousands of hours of annotated speech data. Three approaches to\nlow-resourced ASR are phoneme or subword based supervised pre-training, and\nself-supervised pre-training over multilingual data. The Iu Mien language is\nthe main ethnic language of the Yao ethnic group in China and is low-resourced\nin the sense that the annotated speech is very limited. With less than 10 hours\nof transcribed Iu Mien language, this paper investigates and compares the three\napproaches for Iu Mien speech recognition. Our experiments are based on the\nrecently released, three backbone models pretrained over the 10 languages from\nthe CommonVoice dataset (CV-Lang10), which correspond to the three approaches\nfor low-resourced ASR. It is found that phoneme supervision can achieve better\nresults compared to subword supervision and self-supervision, thereby providing\nhigher data-efficiency. Particularly, the Whistle models, i.e., obtained by the\nweakly-supervised phoneme-based multilingual pre-training, obtain the most\ncompetitive results.", "paper_summary_zh": "主流的自動語音辨識（ASR）技術通常需要數百到數千小時的標註語音資料。低資源 ASR 的三種方法是基於音素或子字的監督式預訓練，以及多語言資料的自我監督式預訓練。勉語是中國瑤族的主要民族語言，在標註語音非常有限的意義上屬於低資源語言。本文使用不到 10 小時的轉錄勉語，探討並比較了勉語語音辨識的這三種方法。我們的實驗基於最近發布的三個主幹模型，它們在 CommonVoice 資料集（CV-Lang10）的 10 種語言上進行了預訓練，這三種方法分別對應於低資源 ASR 的三種方法。研究發現，與子字監督和自我監督相比，音素監督可以獲得更好的結果，從而提供更高的資料效率。特別是 Whistle 模型，即透過弱監督音素為基礎的多語言預訓練獲得的模型，獲得了最具競爭力的結果。", "author": "Lukuan Dong et.al.", "authors": "Lukuan Dong, Donghong Qin, Fengbo Bai, Fanhua Song, Yan Liu, Chen Xu, Zhijian Ou", "id": "2407.13292v1", "paper_url": "http://arxiv.org/abs/2407.13292v1", "repo": "null"}}