{"2502.02807": {"publish_time": "2025-02-05", "title": "CAMI: A Counselor Agent Supporting Motivational Interviewing through State Inference and Topic Exploration", "paper_summary": "Conversational counselor agents have become essential tools for addressing\nthe rising demand for scalable and accessible mental health support. This paper\nintroduces CAMI, a novel automated counselor agent grounded in Motivational\nInterviewing (MI) -- a client-centered counseling approach designed to address\nambivalence and facilitate behavior change. CAMI employs a novel STAR\nframework, consisting of client's state inference, motivation topic\nexploration, and response generation modules, leveraging large language models\n(LLMs). These components work together to evoke change talk, aligning with MI\nprinciples and improving counseling outcomes for clients from diverse\nbackgrounds. We evaluate CAMI's performance through both automated and manual\nevaluations, utilizing simulated clients to assess MI skill competency,\nclient's state inference accuracy, topic exploration proficiency, and overall\ncounseling success. Results show that CAMI not only outperforms several\nstate-of-the-art methods but also shows more realistic counselor-like behavior.\nAdditionally, our ablation study underscores the critical roles of state\ninference and topic exploration in achieving this performance.", "paper_summary_zh": "對話式諮商代理已成為滿足可擴充且可取得心理健康支援日益增長需求的必要工具。本文介紹 CAMI，一種新型自動化諮商代理，其基礎是動機性訪談 (MI)，一種以客戶為中心的諮商方法，旨在解決猶豫不決並促進行為改變。CAMI 使用一種新型的 STAR 架構，包括客戶狀態推論、動機主題探討和回應產生模組，並利用大型語言模型 (LLM)。這些元件共同作用以引發改變對話，與 MI 原則保持一致，並改善來自不同背景的客戶的諮商成果。我們透過自動化和手動評估來評估 CAMI 的效能，利用模擬客戶來評估 MI 技能能力、客戶狀態推論準確度、主題探討熟練度和整體諮商成功率。結果顯示，CAMI 不僅優於多種最先進的方法，還表現出更逼真的諮商師行為。此外，我們的消融研究強調了狀態推論和主題探討在達成此效能中所扮演的關鍵角色。", "author": "Yizhe Yang et.al.", "authors": "Yizhe Yang, Palakorn Achananuparp, Heyan Huang, Jing Jiang, Kit Phey Leng, Nicholas Gabriel Lim, Cameron Tan Shi Ern, Ee-peng Lim", "id": "2502.02807v1", "paper_url": "http://arxiv.org/abs/2502.02807v1", "repo": "null"}}