{"2502.02095": {"publish_time": "2025-02-04", "title": "LongDPO: Unlock Better Long-form Generation Abilities for LLMs via Critique-augmented Stepwise Information", "paper_summary": "Long-form generation is crucial for academic writing papers and repo-level\ncode generation. Despite this, current models, including GPT-4o, still exhibit\nunsatisfactory performance. Existing methods that utilize preference learning\nwith outcome supervision often fail to provide detailed feedback for extended\ncontexts. This shortcoming can lead to content that does not fully satisfy\nquery requirements, resulting in issues like length deviations, and diminished\nquality. In this paper, we propose enhancing long-form generation by\nincorporating process supervision. We employ Monte Carlo Tree Search to gather\nstepwise preference pairs, utilizing a global memory pool to maintain\nconsistency. To address the issue of suboptimal candidate selection, we\nintegrate external critiques to refine and improve the quality of the\npreference pairs. Finally, we apply step-level DPO using the collected stepwise\npreference pairs. Experimental results show that our method improves length and\nquality on long-form generation benchmarks, with almost lossless performance on\ngeneral benchmarks across various model backbones.", "paper_summary_zh": "長篇生成對於學術寫作論文和 repo 層級的程式碼生成至關重要。儘管如此，包括 GPT-4o 在內的當前模型仍然表現不佳。利用具有結果監督的偏好學習的現有方法通常無法為擴充的內容提供詳細的回饋。此缺點可能導致內容無法完全滿足查詢需求，進而產生長度偏差和品質下降等問題。在本文中，我們提出透過納入程序監督來增強長篇生成。我們採用蒙地卡羅樹狀搜尋來收集逐步偏好對，並利用全域記憶池來維持一致性。為了解決次佳候選選擇的問題，我們整合外部評論來改善偏好對的品質。最後，我們使用收集到的逐步偏好對套用步驟層級的 DPO。實驗結果顯示，我們的模型在長篇生成基準上改善了長度和品質，在各種模型主幹上的通用基準上幾乎沒有損失效能。", "author": "Bowen Ping et.al.", "authors": "Bowen Ping, Jiali Zeng, Fandong Meng, Shuo Wang, Jie Zhou, Shanghang Zhang", "id": "2502.02095v1", "paper_url": "http://arxiv.org/abs/2502.02095v1", "repo": "null"}}