{"2412.12710": {"publish_time": "2024-12-17", "title": "Enhancing Naturalness in LLM-Generated Utterances through Disfluency Insertion", "paper_summary": "Disfluencies are a natural feature of spontaneous human speech but are\ntypically absent from the outputs of Large Language Models (LLMs). This absence\ncan diminish the perceived naturalness of synthesized speech, which is an\nimportant criteria when building conversational agents that aim to mimick human\nbehaviours. We show how the insertion of disfluencies can alleviate this\nshortcoming. The proposed approach involves (1) fine-tuning an LLM with\nLow-Rank Adaptation (LoRA) to incorporate various types of disfluencies into\nLLM-generated utterances and (2) synthesizing those utterances using a\ntext-to-speech model that supports the generation of speech phenomena such as\ndisfluencies. We evaluated the quality of the generated speech across two\nmetrics: intelligibility and perceived spontaneity. We demonstrate through a\nuser study that the insertion of disfluencies significantly increase the\nperceived spontaneity of the generated speech. This increase came, however,\nalong with a slight reduction in intelligibility.", "paper_summary_zh": "口語失流是人類自發性語言的自然特徵，但大型語言模型 (LLM) 的輸出中通常沒有這種現象。這種現象的缺失會降低合成語音的自然性，而這在建立旨在模仿人類行為的對話式代理時是一個重要的標準。我們將展示如何插入口語失流來緩解這個缺點。所提出的方法包括：(1) 使用低秩適應 (LoRA) 微調 LLM，以將各種類型的口語失流納入 LLM 生成的語句中，以及 (2) 使用支援產生語音現象（例如口語失流）的文字轉語音模型來合成這些語句。我們根據兩個指標評估了所生成語音的品質：清晰度和感知自發性。我們透過使用者研究證明，插入口語失流會顯著增加所生成語音的感知自發性。然而，這種增加伴隨著清晰度的輕微下降。", "author": "Syed Zohaib Hassan et.al.", "authors": "Syed Zohaib Hassan, Pierre Lison, Pål Halvorsen", "id": "2412.12710v1", "paper_url": "http://arxiv.org/abs/2412.12710v1", "repo": "null"}}