{"2408.16345": {"publish_time": "2024-08-29", "title": "The Unreasonable Ineffectiveness of Nucleus Sampling on Mitigating Text Memorization", "paper_summary": "This work analyses the text memorization behavior of large language models\n(LLMs) when subjected to nucleus sampling. Stochastic decoding methods like\nnucleus sampling are typically applied to overcome issues such as monotonous\nand repetitive text generation, which are often observed with\nmaximization-based decoding techniques. We hypothesize that nucleus sampling\nmight also reduce the occurrence of memorization patterns, because it could\nlead to the selection of tokens outside the memorized sequence. To test this\nhypothesis we create a diagnostic dataset with a known distribution of\nduplicates that gives us some control over the likelihood of memorization of\ncertain parts of the training data. Our analysis of two GPT-Neo models\nfine-tuned on this dataset interestingly shows that (i) an increase of the\nnucleus size reduces memorization only modestly, and (ii) even when models do\nnot engage in \"hard\" memorization -- a verbatim reproduction of training\nsamples -- they may still display \"soft\" memorization whereby they generate\noutputs that echo the training data but without a complete one-by-one\nresemblance.", "paper_summary_zh": "本研究分析了大型語言模型 (LLM) 在接受核取樣時，其文字記憶行為。隨機解碼方法（如核取樣）通常用於克服單調且重複的文字生成等問題，而這些問題通常在基於最大化的解碼技術中可見。我們假設核取樣也可能減少記憶模式的發生，因為它可能導致選擇記憶序列之外的符號。為了測試這個假設，我們建立了一個診斷資料集，其中包含已知的重複分佈，讓我們可以控制訓練資料特定部分的記憶可能性。我們對兩個在這個資料集上進行微調的 GPT-Neo 模型的分析有趣地顯示出：(i) 增加核取樣大小僅能適度減少記憶，以及 (ii) 即使模型沒有從事「硬」記憶（訓練樣本的逐字重現），它們仍然可能顯示「軟」記憶，即它們生成的輸出呼應訓練資料，但沒有完全逐一相似。", "author": "Luka Borec et.al.", "authors": "Luka Borec, Philipp Sadler, David Schlangen", "id": "2408.16345v1", "paper_url": "http://arxiv.org/abs/2408.16345v1", "repo": "https://github.com/lukaborec/memorization-nucleus-sampling"}}