{"2408.08724": {"publish_time": "2024-08-16", "title": "ChatZero:Zero-shot Cross-Lingual Dialogue Generation via Pseudo-Target Language", "paper_summary": "Although large language models(LLMs) show amazing capabilities, among various\nexciting applications discovered for LLMs fall short in other low-resource\nlanguages. Besides, most existing methods depend on large-scale dialogue\ncorpora and thus building systems for dialogue generation in a zero-shot\nscenario remains a considerable challenge. To address this challenge, we\npropose a novel end-to-end zero-shot dialogue generation model ChatZero based\non cross-lingual code-switching method. First, we construct code-switching\nlanguage and pseudo-target language with placeholders. Then for cross-lingual\nsemantic transfer, we employ unsupervised contrastive learning to minimize the\nsemantics gap of the source language, code-switching language, and\npseudo-target language that are mutually positive examples in the high\ndimensional semantic space. Experiments on the multilingual DailyDialog and\nDSTC7-AVSD datasets demonstrate that ChatZero can achieve more than 90\\% of the\noriginal performance under the zero-shot case compared to supervised learning,\nand achieve state-of-the-art performance compared with other baselines.", "paper_summary_zh": "儘管大型語言模型 (LLM) 展現驚人的能力，在為 LLM 發現的各種令人興奮的應用中，在其他低資源語言中卻表現不佳。此外，現有的大多數方法都依賴於大規模對話語料庫，因此在零次學習場景中建立對話生成系統仍然是一項相當大的挑戰。為了應對這一挑戰，我們提出了一個基於跨語言代碼轉換方法的新型端到端零次學習對話生成模型 ChatZero。首先，我們使用佔位符構建代碼轉換語言和偽目標語言。然後，對於跨語言語義轉移，我們採用無監督對比學習來最小化源語言、代碼轉換語言和偽目標語言的語義差距，這些語言在高維語義空間中是相互的正例。在多語言 DailyDialog 和 DSTC7-AVSD 資料集上的實驗表明，與監督學習相比，ChatZero 在零次學習情況下可以達到原始效能的 90% 以上，並且與其他基準相比，達到最先進的效能。", "author": "Yongkang Liu et.al.", "authors": "Yongkang Liu, Feng Shi, Daling Wang, Yifei Zhang, Hinrich Schütze", "id": "2408.08724v1", "paper_url": "http://arxiv.org/abs/2408.08724v1", "repo": "null"}}