{"2409.19977": {"publish_time": "2024-09-30", "title": "Knowledge Graph Embedding by Normalizing Flows", "paper_summary": "A key to knowledge graph embedding (KGE) is to choose a proper representation\nspace, e.g., point-wise Euclidean space and complex vector space. In this\npaper, we propose a unified perspective of embedding and introduce uncertainty\ninto KGE from the view of group theory. Our model can incorporate existing\nmodels (i.e., generality), ensure the computation is tractable (i.e.,\nefficiency) and enjoy the expressive power of complex random variables (i.e.,\nexpressiveness). The core idea is that we embed entities/relations as elements\nof a symmetric group, i.e., permutations of a set. Permutations of different\nsets can reflect different properties of embedding. And the group operation of\nsymmetric groups is easy to compute. In specific, we show that the embedding of\nmany existing models, point vectors, can be seen as elements of a symmetric\ngroup. To reflect uncertainty, we first embed entities/relations as\npermutations of a set of random variables. A permutation can transform a simple\nrandom variable into a complex random variable for greater expressiveness,\ncalled a normalizing flow. We then define scoring functions by measuring the\nsimilarity of two normalizing flows, namely NFE. We construct several\ninstantiating models and prove that they are able to learn logical rules.\nExperimental results demonstrate the effectiveness of introducing uncertainty\nand our model. The code is available at https://github.com/changyi7231/NFE.", "paper_summary_zh": "知識圖譜嵌入 (KGE) 的關鍵在於選擇適當的表示空間，例如點狀歐幾里得空間和複數向量空間。在本文中，我們提出了嵌入的統一觀點，並從群論的角度將不確定性引入 KGE。我們的模型可以整合現有模型（即一般性），確保計算是可行的（即效率），並享有複數隨機變數的表達能力（即表達性）。核心思想是我們將實體/關係嵌入為對稱群的元素，即集合的排列。不同集合的排列可以反映嵌入的不同屬性。而對稱群的群運算很容易計算。具體來說，我們表明許多現有模型的嵌入，點向量，可以看作是對稱群的元素。為了反映不確定性，我們首先將實體/關係嵌入為一組隨機變數的排列。一個排列可以將一個簡單的隨機變數轉換為一個複雜的隨機變數以獲得更大的表達能力，稱為正規化流。然後，我們通過測量兩個正規化流的相似性來定義評分函數，即 NFE。我們構建了幾個實例化模型，並證明它們能夠學習邏輯規則。實驗結果證明了引入不確定性和我們模型的有效性。程式碼可在 https://github.com/changyi7231/NFE 取得。", "author": "Changyi Xiao et.al.", "authors": "Changyi Xiao, Xiangnan He, Yixin Cao", "id": "2409.19977v1", "paper_url": "http://arxiv.org/abs/2409.19977v1", "repo": "https://github.com/changyi7231/nfe"}}