{"2411.14684": {"publish_time": "2024-11-22", "title": "Cross Group Attention and Group-wise Rolling for Multimodal Medical Image Synthesis", "paper_summary": "Multimodal MR image synthesis aims to generate missing modality image by\nfusing and mapping a few available MRI data. Most existing approaches typically\nadopt an image-to-image translation scheme. However, these methods often suffer\nfrom sub-optimal performance due to the spatial misalignment between different\nmodalities while they are typically treated as input channels. Therefore, in\nthis paper, we propose an Adaptive Group-wise Interaction Network (AGI-Net)\nthat explores both inter-modality and intra-modality relationships for\nmultimodal MR image synthesis. Specifically, groups are first pre-defined along\nthe channel dimension and then we perform an adaptive rolling for the standard\nconvolutional kernel to capture inter-modality spatial correspondences. At the\nsame time, a cross-group attention module is introduced to fuse information\nacross different channel groups, leading to better feature representation. We\nevaluated the effectiveness of our model on the publicly available IXI and\nBraTS2023 datasets, where the AGI-Net achieved state-of-the-art performance for\nmultimodal MR image synthesis. Code will be released.", "paper_summary_zh": "多模态磁共振图像合成旨在通过融合和映射一些可用的 MRI 数据来生成缺失模态图像。大多数现有方法通常采用图像到图像的转换方案。然而，由于不同模态之间的空间错位，这些方法通常会出现次优性能，而它们通常被视为输入通道。因此，在本文中，我们提出了一种自适应组交互网络 (AGI-Net)，它探索了用于多模态磁共振图像合成的模态间和模态内关系。具体而言，首先沿着通道维度预定义组，然后我们对标准卷积核执行自适应滚动以捕获模态间空间对应关系。同时，引入跨组注意力模块以融合不同通道组之间的信息，从而获得更好的特征表示。我们在公开可用的 IXI 和 BraTS2023 数据集上评估了我们模型的有效性，其中 AGI-Net 在多模态磁共振图像合成方面取得了最先进的性能。代码将被释放。", "author": "Tao Song et.al.", "authors": "Tao Song, Yicheng Wu, Minhao Hu, Xiangde Luo, Linda Wei, Guotai Wang, Yi Guo, Feng Xu, Shaoting Zhang", "id": "2411.14684v1", "paper_url": "http://arxiv.org/abs/2411.14684v1", "repo": "null"}}