{"2501.07764": {"publish_time": "2025-01-14", "title": "Deep Learning for Disease Outbreak Prediction: A Robust Early Warning Signal for Transcritical Bifurcations", "paper_summary": "Early Warning Signals (EWSs) are vital for implementing preventive measures\nbefore a disease turns into a pandemic. While new diseases exhibit unique\nbehaviors, they often share fundamental characteristics from a dynamical\nsystems perspective. Moreover, measurements during disease outbreaks are often\ncorrupted by different noise sources, posing challenges for Time Series\nClassification (TSC) tasks. In this study, we address the problem of having a\nrobust EWS for disease outbreak prediction using a best-performing deep\nlearning model in the domain of TSC. We employed two simulated datasets to\ntrain the model: one representing generated dynamical systems with randomly\nselected polynomial terms to model new disease behaviors, and another\nsimulating noise-induced disease dynamics to account for noisy measurements.\nThe model's performance was analyzed using both simulated data from different\ndisease models and real-world data, including influenza and COVID-19. Results\ndemonstrate that the proposed model outperforms previous models, effectively\nproviding EWSs of impending outbreaks across various scenarios. This study\nbridges advancements in deep learning with the ability to provide robust early\nwarning signals in noisy environments, making it highly applicable to\nreal-world crises involving emerging disease outbreaks.", "paper_summary_zh": "早期预警信号 (EWS) 对于在疾病演变成大流行之前实施预防措施至关重要。虽然新疾病表现出独特的行为，但从动态系统角度来看，它们通常具有共同的基本特征。此外，在疾病爆发期间的测量值经常受到不同噪声源的干扰，这对时间序列分类 (TSC) 任务构成了挑战。在这项研究中，我们解决了使用 TSC 领域中表现最佳的深度学习模型来预测疾病爆发以获得稳健 EWS 的问题。我们采用了两个模拟数据集来训练模型：一个表示使用随机选择的多项式项生成动态系统来模拟新疾病行为，另一个模拟噪声引起的疾病动态来解释有噪声的测量值。该模型的性能使用来自不同疾病模型的模拟数据和现实世界数据（包括流感和 COVID-19）进行分析。结果表明，所提出的模型优于以前的模型，有效地提供了各种情况下即将爆发的 EWS。本研究将深度学习的进步与在有噪声环境中提供稳健的早期预警信号的能力联系起来，使其高度适用于涉及新发疾病爆发的现实世界危机。", "author": "Reza Miry et.al.", "authors": "Reza Miry, Amit K. Chakraborty, Russell Greiner, Mark A. Lewis, Hao Wang, Tianyu Guan, Pouria Ramazi", "id": "2501.07764v1", "paper_url": "http://arxiv.org/abs/2501.07764v1", "repo": "null"}}