{"2409.20196": {"publish_time": "2024-09-30", "title": "Melody Is All You Need For Music Generation", "paper_summary": "We present the Melody Guided Music Generation (MMGen) model, the first novel\napproach using melody to guide the music generation that, despite a pretty\nsimple method and extremely limited resources, achieves excellent performance.\nSpecifically, we first align the melody with audio waveforms and their\nassociated descriptions using the multimodal alignment module. Subsequently, we\ncondition the diffusion module on the learned melody representations. This\nallows MMGen to generate music that matches the style of the provided audio\nwhile also producing music that reflects the content of the given text\ndescription. To address the scarcity of high-quality data, we construct a\nmulti-modal dataset, MusicSet, which includes melody, text, and audio, and will\nbe made publicly available. We conduct extensive experiments which demonstrate\nthe superiority of the proposed model both in terms of experimental metrics and\nactual performance quality.", "paper_summary_zh": "我們提出旋律引導音樂生成（MMGen）模型，這是第一個使用旋律來引導音樂生成的新穎方法，儘管方法相當簡單且資源極為有限，但仍能達到極佳的表現。具體來說，我們首先使用多模態對齊模組將旋律與音訊波形及其相關描述對齊。隨後，我們對擴散模組進行條件處理，以學習旋律表示。這讓 MMGen 能夠生成符合所提供音訊風格的音樂，同時也能產生反映給定文字描述內容的音樂。為了解決高品質資料的稀缺問題，我們建構了一個包含旋律、文字和音訊的多模態資料集 MusicSet，並將公開提供。我們進行了廣泛的實驗，證明了所提出的模型在實驗指標和實際效能品質方面都具有優越性。", "author": "Shaopeng Wei et.al.", "authors": "Shaopeng Wei, Manzhen Wei, Haoyu Wang, Yu Zhao, Gang Kou", "id": "2409.20196v1", "paper_url": "http://arxiv.org/abs/2409.20196v1", "repo": "null"}}