{"2406.19136": {"publish_time": "2024-06-27", "title": "YZS-model: A Predictive Model for Organic Drug Solubility Based on Graph Convolutional Networks and Transformer-Attention", "paper_summary": "The accurate prediction of drug molecule solubility is essential for\ndetermining their therapeutic effectiveness and safety, influencing the drug's\nADME processes. Traditional solubility prediction techniques often fail to\ncapture the complex nature of molecular tructures, leading to notable\ndeviations between predictions and actual results. For example, the Discussion\non Advanced Drug-Like Compound Structures. Lusci highlighted issues in\ncapturing crucial cyclic structural information in molecules with ring\nstructures. To overcome this issue, our research introduces a novel deep\nlearning framework combining attention-based transformers, Long Short-Term\nMemory (LSTM) networks, and Graph Convolutional Networks (GCN), aimed at\nenhancing the precision of solubility predictions. Utilizing a training set of\n9,943 compounds and testing on an anticancer compound dataset, our method\nachieved a correlation coefficient ($R^2$) of 0.55 and a Root Mean Square Error\n(RMSE) of 0.59, which outperforms the benchmark models' scores of 0.52 ($R^2$)\nand 0.61 (RMSE). Importantly, in an additional independent test, our model\nsignificantly outperformed the baseline with an RMSE of 1.05 compared to 1.28,\na relative accuracy improvement of 45.9%. This research not only demonstrates\nthe vast potential of deep learning for improving solubility prediction\naccuracy but also offers novel insights for drug design and selection in the\nfuture. Continued efforts will be directed towards optimizing the model\narchitecture and extending its application to better support the drug\ndevelopment process, underscoring the pivotal role of deep learning in drug\ndiscovery.", "paper_summary_zh": "準確預測藥物分子的溶解度對於決定其治療效果和安全性至關重要，並影響藥物的 ADME 程序。傳統的溶解度預測技術通常無法捕捉到分子結構的複雜性，導致預測與實際結果之間出現顯著偏差。例如，關於先進類藥物化合物結構的討論。Lusci 強調了捕捉具有環狀結構的分子中關鍵環狀結構信息的問題。為了克服這個問題，我們的研究引入了一種新穎的深度學習框架，結合了基於注意力的Transformer、長短期記憶 (LSTM) 網路和圖形卷積網路 (GCN)，旨在提高溶解度預測的精度。利用 9,943 個化合物的訓練集並在抗癌化合物數據集上進行測試，我們的模型達到了 0.55 的相關係數 ($R^2$) 和 0.59 的均方根誤差 (RMSE)，優於基準模型的 0.52 ($R^2$) 和 0.61 (RMSE) 分數。重要的是，在額外的獨立測試中，我們的模型顯著優於基準，RMSE 為 1.05，而基準為 1.28，相對準確度提高了 45.9%。這項研究不僅展示了深度學習在提高溶解度預測準確性方面的巨大潛力，還為未來的藥物設計和選擇提供了新見解。持續的努力將致力於優化模型架構並擴展其應用，以更好地支持藥物開發過程，強調深度學習在藥物發現中的關鍵作用。", "author": "Chenxu Wang et.al.", "authors": "Chenxu Wang, Haowei Ming, Jian He, Yao Lu", "id": "2406.19136v1", "paper_url": "http://arxiv.org/abs/2406.19136v1", "repo": "null"}}