{"2502.11211": {"publish_time": "2025-02-16", "title": "A Survey of LLM-based Agents in Medicine: How far are we from Baymax?", "paper_summary": "Large Language Models (LLMs) are transforming healthcare through the\ndevelopment of LLM-based agents that can understand, reason about, and assist\nwith medical tasks. This survey provides a comprehensive review of LLM-based\nagents in medicine, examining their architectures, applications, and\nchallenges. We analyze the key components of medical agent systems, including\nsystem profiles, clinical planning mechanisms, medical reasoning frameworks,\nand external capacity enhancement. The survey covers major application\nscenarios such as clinical decision support, medical documentation, training\nsimulations, and healthcare service optimization. We discuss evaluation\nframeworks and metrics used to assess these agents' performance in healthcare\nsettings. While LLM-based agents show promise in enhancing healthcare delivery,\nseveral challenges remain, including hallucination management, multimodal\nintegration, implementation barriers, and ethical considerations. The survey\nconcludes by highlighting future research directions, including advances in\nmedical reasoning inspired by recent developments in LLM architectures,\nintegration with physical systems, and improvements in training simulations.\nThis work provides researchers and practitioners with a structured overview of\nthe current state and future prospects of LLM-based agents in medicine.", "paper_summary_zh": "大型語言模型 (LLM) 透過開發可理解、推理並協助醫療任務的 LLM 基礎代理人，轉變了醫療保健。本調查提供了 LLM 基礎代理人在醫學中的全面回顧，探討其架構、應用和挑戰。我們分析了醫療代理系統的主要組成部分，包括系統概況、臨床規劃機制、醫療推理架構和外部能力提升。本調查涵蓋了主要的應用場景，例如臨床決策支援、醫療文件、訓練模擬和醫療保健服務最佳化。我們討論了用於評估這些代理人在醫療保健環境中表現的評估架構和指標。雖然 LLM 基礎代理人顯示出在增強醫療保健提供方面的潛力，但仍有許多挑戰，包括幻覺管理、多模態整合、實施障礙和倫理考量。本調查最後強調了未來的研究方向，包括受 LLM 架構近期發展啟發的醫療推理進展、與物理系統的整合和訓練模擬的改進。這項工作為研究人員和從業人員提供了 LLM 基礎代理人在醫學中當前狀態和未來前景的結構化概觀。", "author": "Wenxuan Wang et.al.", "authors": "Wenxuan Wang, Zizhan Ma, Zheng Wang, Chenghan Wu, Wenting Chen, Xiang Li, Yixuan Yuan", "id": "2502.11211v1", "paper_url": "http://arxiv.org/abs/2502.11211v1", "repo": "null"}}