{"2405.05905": {"publish_time": "2024-05-09", "title": "Truthful Aggregation of LLMs with an Application to Online Advertising", "paper_summary": "We address the challenge of aggregating the preferences of multiple agents\nover LLM-generated replies to user queries, where agents might modify or\nexaggerate their preferences. New agents may participate for each new query,\nmaking fine-tuning LLMs on these preferences impractical. To overcome these\nchallenges, we propose an auction mechanism that operates without fine-tuning\nor access to model weights. This mechanism is designed to provably converge to\nthe ouput of the optimally fine-tuned LLM as computational resources are\nincreased. The mechanism can also incorporate contextual information about the\nagents when avaiable, which significantly accelerates its convergence. A\nwell-designed payment rule ensures that truthful reporting is the optimal\nstrategy for all agents, while also promoting an equity property by aligning\neach agent's utility with her contribution to social welfare - an essential\nfeature for the mechanism's long-term viability. While our approach can be\napplied whenever monetary transactions are permissible, our flagship\napplication is in online advertising. In this context, advertisers try to steer\nLLM-generated responses towards their brand interests, while the platform aims\nto maximize advertiser value and ensure user satisfaction. Experimental results\nconfirm that our mechanism not only converges efficiently to the optimally\nfine-tuned LLM but also significantly boosts advertiser value and platform\nrevenue, all with minimal computational overhead.", "paper_summary_zh": "<paragraph>我們解決了匯總多個代理對 LLM 生成的使用者查詢回覆的偏好的挑戰，其中代理可能會修改或誇大其偏好。新的代理可能會參與每個新的查詢，這使得對這些偏好進行微調 LLM 變得不切實際。為了克服這些挑戰，我們提出了一種拍賣機制，它在不微調或訪問模型權重的條件下運作。此機制旨在隨著計算資源的增加，可證明地收斂到經過最佳微調的 LLM 的輸出。該機制還可以納入有關代理的上下文訊息（如果可用），這會顯著加速其收斂。設計良好的支付規則確保如實報告是所有代理的最佳策略，同時還通過將每個代理的效用與其對社會福利的貢獻相一致來促進公平屬性——這是該機制長期可行性的基本特徵。儘管我們的方法可以在允許金錢交易時應用，但我們的旗艦應用是在線上廣告中。在此背景下，廣告客戶試圖將 LLM 生成的回應引導至其品牌利益，而平台旨在最大化廣告客戶價值並確保使用者滿意度。實驗結果證實，我們的機制不僅有效地收斂到經過最佳微調的 LLM，而且還顯著提升了廣告客戶價值和平台收益，所有這些都以最小的計算開銷實現。</paragraph>", "author": "Ermis Soumalias et.al.", "authors": "Ermis Soumalias, Michael J. Curry, Sven Seuken", "id": "2405.05905v1", "paper_url": "http://arxiv.org/abs/2405.05905v1", "repo": "null"}}