{"2410.01481": {"publish_time": "2024-10-02", "title": "SonicSim: A customizable simulation platform for speech processing in moving sound source scenarios", "paper_summary": "The systematic evaluation of speech separation and enhancement models under\nmoving sound source conditions typically requires extensive data comprising\ndiverse scenarios. However, real-world datasets often contain insufficient data\nto meet the training and evaluation requirements of models. Although synthetic\ndatasets offer a larger volume of data, their acoustic simulations lack\nrealism. Consequently, neither real-world nor synthetic datasets effectively\nfulfill practical needs. To address these issues, we introduce SonicSim, a\nsynthetic toolkit de-designed to generate highly customizable data for moving\nsound sources. SonicSim is developed based on the embodied AI simulation\nplatform, Habitat-sim, supporting multi-level adjustments, including\nscene-level, microphone-level, and source-level, thereby generating more\ndiverse synthetic data. Leveraging SonicSim, we constructed a moving sound\nsource benchmark dataset, SonicSet, using the Librispeech, the Freesound\nDataset 50k (FSD50K) and Free Music Archive (FMA), and 90 scenes from the\nMatterport3D to evaluate speech separation and enhancement models.\nAdditionally, to validate the differences between synthetic data and real-world\ndata, we randomly selected 5 hours of raw data without reverberation from the\nSonicSet validation set to record a real-world speech separation dataset, which\nwas then compared with the corresponding synthetic datasets. Similarly, we\nutilized the real-world speech enhancement dataset RealMAN to validate the\nacoustic gap between other synthetic datasets and the SonicSet dataset for\nspeech enhancement. The results indicate that the synthetic data generated by\nSonicSim can effectively generalize to real-world scenarios. Demo and code are\npublicly available at https://cslikai.cn/SonicSim/.", "paper_summary_zh": "<paragraph>在移動聲源條件下，語音分離和增強模型的系統評估通常需要包含各種情境的廣泛數據。然而，現實世界的數據集通常包含不足的數據，無法滿足模型的訓練和評估需求。儘管合成數據集提供了更多的數據量，但它們的聲學模擬缺乏真實性。因此，現實世界或合成數據集都不能有效地滿足實際需求。為了解決這些問題，我們引入了 SonicSim，這是一個合成工具包，專門設計用於為移動聲源生成高度可自訂的數據。SonicSim 是基於具身 AI 模擬平台 Habitat-sim 開發的，支持多層級調整，包括場景級、麥克風級和聲源級，從而生成更多樣化的合成數據。利用 SonicSim，我們構建了一個移動聲源基準數據集 SonicSet，使用 Librispeech、Freesound 數據集 50k (FSD50K) 和 Free Music Archive (FMA) 以及來自 Matterport3D 的 90 個場景來評估語音分離和增強模型。此外，為了驗證合成數據和現實世界數據之間的差異，我們從 SonicSet 驗證集中隨機選擇了 5 小時的未混響原始數據，以記錄一個現實世界的語音分離數據集，然後將其與對應的合成數據集進行比較。類似地，我們利用現實世界的語音增強數據集 RealMAN 來驗證其他合成數據集和 SonicSet 數據集在語音增強方面的聲學差距。結果表明，SonicSim 生成的合成數據可以有效地推廣到現實世界的場景中。示範和代碼可在 https://cslikai.cn/SonicSim/ 公開獲得。</paragraph>", "author": "Kai Li et.al.", "authors": "Kai Li, Wendi Sang, Chang Zeng, Runxuan Yang, Guo Chen, Xiaolin Hu", "id": "2410.01481v1", "paper_url": "http://arxiv.org/abs/2410.01481v1", "repo": "https://github.com/jusperlee/sonicsim"}}