{"2501.12844": {"publish_time": "2025-01-22", "title": "GAMED-Snake: Gradient-aware Adaptive Momentum Evolution Deep Snake Model for Multi-organ Segmentation", "paper_summary": "Multi-organ segmentation is a critical yet challenging task due to complex\nanatomical backgrounds, blurred boundaries, and diverse morphologies. This\nstudy introduces the Gradient-aware Adaptive Momentum Evolution Deep Snake\n(GAMED-Snake) model, which establishes a novel paradigm for contour-based\nsegmentation by integrating gradient-based learning with adaptive momentum\nevolution mechanisms. The GAMED-Snake model incorporates three major\ninnovations: First, the Distance Energy Map Prior (DEMP) generates a\npixel-level force field that effectively attracts contour points towards the\ntrue boundaries, even in scenarios with complex backgrounds and blurred edges.\nSecond, the Differential Convolution Inception Module (DCIM) precisely extracts\ncomprehensive energy gradients, significantly enhancing segmentation accuracy.\nThird, the Adaptive Momentum Evolution Mechanism (AMEM) employs cross-attention\nto establish dynamic features across different iterations of evolution,\nenabling precise boundary alignment for diverse morphologies. Experimental\nresults on four challenging multi-organ segmentation datasets demonstrate that\nGAMED-Snake improves the mDice metric by approximately 2% compared to\nstate-of-the-art methods. Code will be available at\nhttps://github.com/SYSUzrc/GAMED-Snake.", "paper_summary_zh": "多器官分割是一項關鍵且具有挑戰性的任務，其原因在於複雜的解剖學背景、模糊的邊界和多樣化的形態。本研究引入了梯度感知自適應動量演化深度蛇模型 (GAMED-Snake)，它建立了一個基於輪廓的分割新範例，方法是將基於梯度的學習與自適應動量演化機制整合在一起。GAMED-Snake 模型包含三大創新：首先，距離能量圖先驗 (DEMP) 會產生一個像素級力的場，它能有效地吸引輪廓點朝向真實的邊界，即使在背景複雜且邊緣模糊的情況下也能發揮作用。其次，差分卷積起始模組 (DCIM) 精確地提取了全面的能量梯度，顯著地提高了分割準確度。第三，自適應動量演化機制 (AMEM) 採用交叉注意來建立不同演化迭代之間的動態特徵，從而實現對不同形態的精確邊界對齊。在四個具有挑戰性的多器官分割資料集上的實驗結果表明，與最先進的方法相比，GAMED-Snake 將 mDice 指標提高了大約 2%。程式碼將在 https://github.com/SYSUzrc/GAMED-Snake 上提供。", "author": "Ruicheng Zhang et.al.", "authors": "Ruicheng Zhang, Haowei Guo, Zeyu Zhang, Puxin Yan, Shen Zhao", "id": "2501.12844v1", "paper_url": "http://arxiv.org/abs/2501.12844v1", "repo": "https://github.com/sysuzrc/gamed-snake"}}