{"2404.15492": {"publish_time": "2024-04-23", "title": "Multi-scale Intervention Planning based on Generative Design", "paper_summary": "The scarcity of green spaces, in urban environments, consists a critical\nchallenge. There are multiple adverse effects, impacting the health and\nwell-being of the citizens. Small scale interventions, e.g. pocket parks, is a\nviable solution, but comes with multiple constraints, involving the design and\nimplementation over a specific area. In this study, we harness the capabilities\nof generative AI for multi-scale intervention planning, focusing on nature\nbased solutions. By leveraging image-to-image and image inpainting algorithms,\nwe propose a methodology to address the green space deficit in urban areas.\nFocusing on two alleys in Thessaloniki, where greenery is lacking, we\ndemonstrate the efficacy of our approach in visualizing NBS interventions. Our\nfindings underscore the transformative potential of emerging technologies in\nshaping the future of urban intervention planning processes.", "paper_summary_zh": "在城市環境中，綠地空間的稀缺是一個嚴峻的挑戰。這會造成多種負面影響，對市民的健康和福祉造成衝擊。小規模的干預措施，例如袖珍公園，是一個可行的解決方案，但會伴隨著多種限制，包括在特定區域的設計和實施。在本研究中，我們利用生成式人工智慧的能力進行多尺度干預規劃，重點放在基於自然的解決方案上。透過利用影像轉影像和影像修復演算法，我們提出了一種方法來解決城市地區的綠地空間不足問題。我們專注於塞薩洛尼基的兩條缺乏綠意的巷道，展示了我們的方法在可視化 NBS 干預措施方面的效能。我們的研究結果強調了新興技術在塑造未來城市干預規劃流程方面具有變革的潛力。", "author": "Ioannis Kavouras et.al.", "authors": "Ioannis Kavouras, Ioannis Rallis, Emmanuel Sardis, Eftychios Protopapadakis, Anastasios Doulamis, Nikolaos Doulamis", "id": "2404.15492v1", "paper_url": "http://arxiv.org/abs/2404.15492v1", "repo": "null"}}