{"2406.02009": {"publish_time": "2024-06-04", "title": "Phonetic Enhanced Language Modeling for Text-to-Speech Synthesis", "paper_summary": "Recent language model-based text-to-speech (TTS) frameworks demonstrate\nscalability and in-context learning capabilities. However, they suffer from\nrobustness issues due to the accumulation of errors in speech unit predictions\nduring autoregressive language modeling. In this paper, we propose a phonetic\nenhanced language modeling method to improve the performance of TTS models. We\nleverage self-supervised representations that are phonetically rich as the\ntraining target for the autoregressive language model. Subsequently, a\nnon-autoregressive model is employed to predict discrete acoustic codecs that\ncontain fine-grained acoustic details. The TTS model focuses solely on\nlinguistic modeling during autoregressive training, thereby reducing the error\npropagation that occurs in non-autoregressive training. Both objective and\nsubjective evaluations validate the effectiveness of our proposed method.", "paper_summary_zh": "近期的基於語言模型的文字轉語音 (TTS) 框架展示了可擴充性和情境學習的能力。然而，它們因為在自迴歸語言模型中語音單元預測的錯誤累積而導致穩健性問題。在本文中，我們提出了一種增強型音標語言模型方法來改善 TTS 模型的效能。我們利用音標豐富的自監督表徵作為自迴歸語言模型的訓練目標。隨後，採用非自迴歸模型來預測包含細緻音訊細節的離散音訊編解碼器。TTS 模型在自迴歸訓練期間僅專注於語言模型，從而減少了在非自迴歸訓練中發生的錯誤傳播。客觀和主觀評估都驗證了我們所提出的方法的有效性。", "author": "Kun Zhou et.al.", "authors": "Kun Zhou, Shengkui Zhao, Yukun Ma, Chong Zhang, Hao Wang, Dianwen Ng, Chongjia Ni, Nguyen Trung Hieu, Jia Qi Yip, Bin Ma", "id": "2406.02009v1", "paper_url": "http://arxiv.org/abs/2406.02009v1", "repo": "null"}}