{"2501.07818": {"publish_time": "2025-01-14", "title": "A Multi-Encoder Frozen-Decoder Approach for Fine-Tuning Large Language Models", "paper_summary": "Among parameter-efficient fine-tuning methods, freezing has emerged as a\npopular strategy for speeding up training, reducing catastrophic forgetting,\nand improving downstream performance. We investigate the impact of freezing the\ndecoder in a multi-task setup comprising diverse natural language tasks, aiming\nto reduce deployment overhead and enhance portability to novel tasks. Our\nexperiments, conducted by fine-tuning both individual and multi-task setups on\nthe AlexaTM model, reveal that freezing decoders is highly effective for tasks\nwith natural language outputs and mitigates catastrophic forgetting in\nmultilingual tasks. However, we find that pairing frozen decoders with a larger\nmodel can effectively maintain or even enhance performance in structured and QA\ntasks, making it a viable strategy for a broader range of task types.", "paper_summary_zh": "在參數高效微調方法中，凍結已成為一種流行的策略，用於加速訓練、減少災難性遺忘，並改善下游效能。我們研究了在包含多種自然語言任務的多任務設定中凍結解碼器的影響，旨在減少部署開銷並增強對新任務的可移植性。我們的實驗通過在 AlexaTM 模型上微調個別和多任務設定進行，結果表明凍結解碼器對於具有自然語言輸出的任務非常有效，並減輕了多語言任務中的災難性遺忘。然而，我們發現將凍結的解碼器與較大的模型配對可以有效地維持甚至增強結構化和問答任務中的效能，這使其成為更廣泛任務類型的可行策略。", "author": "Kaustubh D. Dhole et.al.", "authors": "Kaustubh D. Dhole", "id": "2501.07818v1", "paper_url": "http://arxiv.org/abs/2501.07818v1", "repo": "null"}}