{"2412.02228": {"publish_time": "2024-12-03", "title": "BANER: Boundary-Aware LLMs for Few-Shot Named Entity Recognition", "paper_summary": "Despite the recent success of two-stage prototypical networks in few-shot\nnamed entity recognition (NER), challenges such as over/under-detected false\nspans in the span detection stage and unaligned entity prototypes in the type\nclassification stage persist. Additionally, LLMs have not proven to be\neffective few-shot information extractors in general. In this paper, we propose\nan approach called Boundary-Aware LLMs for Few-Shot Named Entity Recognition to\naddress these issues. We introduce a boundary-aware contrastive learning\nstrategy to enhance the LLM's ability to perceive entity boundaries for\ngeneralized entity spans. Additionally, we utilize LoRAHub to align information\nfrom the target domain to the source domain, thereby enhancing adaptive\ncross-domain classification capabilities. Extensive experiments across various\nbenchmarks demonstrate that our framework outperforms prior methods, validating\nits effectiveness. In particular, the proposed strategies demonstrate\neffectiveness across a range of LLM architectures. The code and data are\nreleased on https://github.com/UESTC-GQJ/BANER.", "paper_summary_zh": "儘管雙階段原型網路在少量樣本命名實體識別 (NER) 中獲得近期成功，但跨度偵測階段中偵測過多/過少錯誤跨度以及類型分類階段中不對齊實體原型等挑戰依然存在。此外，LLM 已被證實無法普遍有效地萃取少量樣本資訊。在本文中，我們提出一個稱為少量樣本命名實體識別邊界感知 LLM 的方法來解決這些問題。我們引入邊界感知對比學習策略，以增強 LLM 感知實體邊界的能力，進而產生一般化的實體跨度。此外，我們使用 LoRAHub 將目標網域的資訊與來源網域對齊，藉此增強適應性跨網域分類能力。透過各種基準的廣泛實驗證明，我們的架構優於先前的各種方法，驗證其有效性。特別是，提出的策略證明了其在各種 LLM 架構中的有效性。程式碼和資料已發布於 https://github.com/UESTC-GQJ/BANER。", "author": "Quanjiang Guo et.al.", "authors": "Quanjiang Guo, Yihong Dong, Ling Tian, Zhao Kang, Yu Zhang, Sijie Wang", "id": "2412.02228v1", "paper_url": "http://arxiv.org/abs/2412.02228v1", "repo": "https://github.com/uestc-gqj/baner"}}