{"2410.23996": {"publish_time": "2024-10-31", "title": "An Information Criterion for Controlled Disentanglement of Multimodal Data", "paper_summary": "Multimodal representation learning seeks to relate and decompose information\ninherent in multiple modalities. By disentangling modality-specific information\nfrom information that is shared across modalities, we can improve\ninterpretability and robustness and enable downstream tasks such as the\ngeneration of counterfactual outcomes. Separating the two types of information\nis challenging since they are often deeply entangled in many real-world\napplications. We propose Disentangled Self-Supervised Learning\n(DisentangledSSL), a novel self-supervised approach for learning disentangled\nrepresentations. We present a comprehensive analysis of the optimality of each\ndisentangled representation, particularly focusing on the scenario not covered\nin prior work where the so-called Minimum Necessary Information (MNI) point is\nnot attainable. We demonstrate that DisentangledSSL successfully learns shared\nand modality-specific features on multiple synthetic and real-world datasets\nand consistently outperforms baselines on various downstream tasks, including\nprediction tasks for vision-language data, as well as molecule-phenotype\nretrieval tasks for biological data.", "paper_summary_zh": "多模态表征学习旨在关联和分解内含于多模态中的信息。通过将特定于模态的信息从跨模态共享的信息中解开，我们可以提高可解释性和鲁棒性，并实现下游任务，例如反事实结果的生成。由于在许多实际应用中，这两种类型的信息通常深度纠缠在一起，因此将它们分开具有挑战性。我们提出了解耦的自监督学习 (DisentangledSSL)，这是一种用于学习解耦表征的新型自监督方法。我们对每个解耦表征的最优性进行了全面分析，特别是关注先前工作中未涵盖的所谓最小必要信息 (MNI) 点不可达到的场景。我们证明，DisentangledSSL 成功学习了多个合成和实际数据集上的共享和特定于模态的特征，并且在各种下游任务上持续优于基准，包括视觉语言数据的预测任务以及生物数据的分子表型检索任务。", "author": "Chenyu Wang et.al.", "authors": "Chenyu Wang, Sharut Gupta, Xinyi Zhang, Sana Tonekaboni, Stefanie Jegelka, Tommi Jaakkola, Caroline Uhler", "id": "2410.23996v1", "paper_url": "http://arxiv.org/abs/2410.23996v1", "repo": "null"}}