{"2408.08444": {"publish_time": "2024-08-15", "title": "W-RAG: Weakly Supervised Dense Retrieval in RAG for Open-domain Question Answering", "paper_summary": "In knowledge-intensive tasks such as open-domain question answering (OpenQA),\nLarge Language Models (LLMs) often struggle to generate factual answers relying\nsolely on their internal (parametric) knowledge. To address this limitation,\nRetrieval-Augmented Generation (RAG) systems enhance LLMs by retrieving\nrelevant information from external sources, thereby positioning the retriever\nas a pivotal component. Although dense retrieval demonstrates state-of-the-art\nperformance, its training poses challenges due to the scarcity of ground-truth\nevidence, largely attributed to the high costs of human annotation. In this\npaper, we propose W-RAG by utilizing the ranking capabilities of LLMs to create\nweakly labeled data for training dense retrievers. Specifically, we rerank the\ntop-$K$ passages retrieved via BM25 by assessing the probability that LLMs will\ngenerate the correct answer based on the question and each passage. The\nhighest-ranking passages are then used as positive training examples for dense\nretrieval. Our comprehensive experiments across four publicly available OpenQA\ndatasets demonstrate that our approach enhances both retrieval and OpenQA\nperformance compared to baseline models.", "paper_summary_zh": "在開放領域問答 (OpenQA) 等知識密集型任務中，大型語言模型 (LLM) 常常難以僅憑藉其內部 (參數化) 知識來產生事實性的答案。為了解決這個限制，檢索增強型生成 (RAG) 系統透過從外部來源檢索相關資訊來增強 LLM，從而將檢索器定位為一個關鍵組成部分。儘管稠密檢索展示了最先進的效能，但由於缺乏基本事實證據，其訓練構成了挑戰，這在很大程度上歸因於人工標註的高成本。在本文中，我們提出 W-RAG，利用 LLM 的排名能力來建立用於訓練稠密檢索器的弱標籤資料。具體來說，我們透過評估 LLM 根據問題和每個章節產生正確答案的機率，重新對透過 BM25 檢索到的前 K 個章節進行排名。排名最高的章節隨後用作稠密檢索的正面訓練範例。我們在四個公開可用的 OpenQA 資料集上進行的全面實驗證明，與基準模型相比，我們的做法增強了檢索和 OpenQA 效能。", "author": "Jinming Nian et.al.", "authors": "Jinming Nian, Zhiyuan Peng, Qifan Wang, Yi Fang", "id": "2408.08444v1", "paper_url": "http://arxiv.org/abs/2408.08444v1", "repo": "https://github.com/jmnian/weak_label_for_rag"}}