{"2501.18794": {"publish_time": "2025-01-30", "title": "Survey and Improvement Strategies for Gene Prioritization with Large Language Models", "paper_summary": "Rare diseases are challenging to diagnose due to limited patient data and\ngenetic diversity. Despite advances in variant prioritization, many cases\nremain undiagnosed. While large language models (LLMs) have performed well in\nmedical exams, their effectiveness in diagnosing rare genetic diseases has not\nbeen assessed. To identify causal genes, we benchmarked various LLMs for gene\nprioritization. Using multi-agent and Human Phenotype Ontology (HPO)\nclassification, we categorized patients based on phenotypes and solvability\nlevels. As gene set size increased, LLM performance deteriorated, so we used a\ndivide-and-conquer strategy to break the task into smaller subsets. At\nbaseline, GPT-4 outperformed other LLMs, achieving near 30% accuracy in ranking\ncausal genes correctly. The multi-agent and HPO approaches helped distinguish\nconfidently solved cases from challenging ones, highlighting the importance of\nknown gene-phenotype associations and phenotype specificity. We found that\ncases with specific phenotypes or clear associations were more accurately\nsolved. However, we observed biases toward well-studied genes and input order\nsensitivity, which hindered gene prioritization. Our divide-and-conquer\nstrategy improved accuracy by overcoming these biases. By utilizing HPO\nclassification, novel multi-agent techniques, and our LLM strategy, we improved\ncausal gene identification accuracy compared to our baseline evaluation. This\napproach streamlines rare disease diagnosis, facilitates reanalysis of unsolved\ncases, and accelerates gene discovery, supporting the development of targeted\ndiagnostics and therapies.", "paper_summary_zh": "罕見疾病由於患者數據有限和遺傳多樣性，診斷起來具有挑戰性。儘管變異優先級排序技術進步，但許多病例仍未得到診斷。儘管大型語言模型 (LLM) 在醫學考試中表現良好，但它們在診斷罕見遺傳疾病方面的有效性尚未得到評估。為了識別致病基因，我們對各種 LLM 進行了基因優先級排序基準測試。使用多智能體和人類表型本体 (HPO) 分類，我們根據表型和可解決性對患者進行了分類。隨著基因組大小的增加，LLM 性能下降，因此我們使用分而治之策略將任務分解為更小的子集。在基線中，GPT-4 優於其他 LLM，在正確排序致病基因方面達到近 30% 的準確度。多智能體和 HPO 方法有助於區分解決有信心的病例和具有挑戰性的病例，強調已知基因-表型關聯和表型特異性的重要性。我們發現具有特定表型或明確關聯的病例得到更準確的解決。然而，我們觀察到對研究充分的基因和輸入順序敏感性的偏差，這阻礙了基因優先級排序。我們的分而治之策略通過克服這些偏差來提高準確性。通過利用 HPO 分類、新穎的多智能體技術和我們的 LLM 策略，我們與我們的基線評估相比提高了致病基因識別準確性。這種方法簡化了罕見疾病的診斷，促進了對未解決病例的重新分析，並加速了基因發現，支持了靶向診斷和治療的開發。", "author": "Matthew Neeley et.al.", "authors": "Matthew Neeley, Guantong Qi, Guanchu Wang, Ruixiang Tang, Dongxue Mao, Chaozhong Liu, Sasidhar Pasupuleti, Bo Yuan, Fan Xia, Pengfei Liu, Zhandong Liu, Xia Hu", "id": "2501.18794v1", "paper_url": "http://arxiv.org/abs/2501.18794v1", "repo": "null"}}