{"2412.04343": {"publish_time": "2024-12-05", "title": "RMD: A Simple Baseline for More General Human Motion Generation via Training-free Retrieval-Augmented Motion Diffuse", "paper_summary": "While motion generation has made substantial progress, its practical\napplication remains constrained by dataset diversity and scale, limiting its\nability to handle out-of-distribution scenarios. To address this, we propose a\nsimple and effective baseline, RMD, which enhances the generalization of motion\ngeneration through retrieval-augmented techniques. Unlike previous\nretrieval-based methods, RMD requires no additional training and offers three\nkey advantages: (1) the external retrieval database can be flexibly replaced;\n(2) body parts from the motion database can be reused, with an LLM facilitating\nsplitting and recombination; and (3) a pre-trained motion diffusion model\nserves as a prior to improve the quality of motions obtained through retrieval\nand direct combination. Without any training, RMD achieves state-of-the-art\nperformance, with notable advantages on out-of-distribution data.", "paper_summary_zh": "儘管動作生成取得重大進展，其實際應用仍受限於資料集的多樣性和規模，這限制了其處理分布外場景的能力。為了解決這個問題，我們提出了一個簡單且有效的基準 RMD，它透過檢索增強技術增強動作生成的泛化能力。與先前的基於檢索的方法不同，RMD 不需要額外的訓練，並提供三個關鍵優勢：(1) 外部檢索資料庫可以靈活替換；(2) 動作資料庫中的身體部位可以重複使用，LLM 促進了拆分和重組；(3) 預先訓練好的動作擴散模型作為先驗，以提高透過檢索和直接組合獲得的動作品質。在沒有任何訓練的情況下，RMD 達到了最先進的效能，在分布外資料上具有顯著優勢。", "author": "Zhouyingcheng Liao et.al.", "authors": "Zhouyingcheng Liao, Mingyuan Zhang, Wenjia Wang, Lei Yang, Taku Komura", "id": "2412.04343v1", "paper_url": "http://arxiv.org/abs/2412.04343v1", "repo": "null"}}