{"2501.01273": {"publish_time": "2025-01-02", "title": "Does a Large Language Model Really Speak in Human-Like Language?", "paper_summary": "Large Language Models (LLMs) have recently emerged, attracting considerable\nattention due to their ability to generate highly natural, human-like text.\nThis study compares the latent community structures of LLM-generated text and\nhuman-written text within a hypothesis testing procedure. Specifically, we\nanalyze three text sets: original human-written texts ($\\mathcal{O}$), their\nLLM-paraphrased versions ($\\mathcal{G}$), and a twice-paraphrased set\n($\\mathcal{S}$) derived from $\\mathcal{G}$. Our analysis addresses two key\nquestions: (1) Is the difference in latent community structures between\n$\\mathcal{O}$ and $\\mathcal{G}$ the same as that between $\\mathcal{G}$ and\n$\\mathcal{S}$? (2) Does $\\mathcal{G}$ become more similar to $\\mathcal{O}$ as\nthe LLM parameter controlling text variability is adjusted? The first question\nis based on the assumption that if LLM-generated text truly resembles human\nlanguage, then the gap between the pair ($\\mathcal{O}$, $\\mathcal{G}$) should\nbe similar to that between the pair ($\\mathcal{G}$, $\\mathcal{S}$), as both\npairs consist of an original text and its paraphrase. The second question\nexamines whether the degree of similarity between LLM-generated and human text\nvaries with changes in the breadth of text generation. To address these\nquestions, we propose a statistical hypothesis testing framework that leverages\nthe fact that each text has corresponding parts across all datasets due to\ntheir paraphrasing relationship. This relationship enables the mapping of one\ndataset's relative position to another, allowing two datasets to be mapped to a\nthird dataset. As a result, both mapped datasets can be quantified with respect\nto the space characterized by the third dataset, facilitating a direct\ncomparison between them. Our results indicate that GPT-generated text remains\ndistinct from human-authored text.", "paper_summary_zh": "大型語言模型 (LLM) 最近浮出檯面，由於它們生成高度自然、類似人類文字的能力而備受關注。本研究比較了 LLM 生成的文字和人類撰寫的文字在假設檢定程序中的潛在社群結構。具體來說，我們分析了三組文字：原始的人類撰寫文字（$\\mathcal{O}$）、它們的 LLM 釋義版本（$\\mathcal{G}$）以及從 $\\mathcal{G}$ 衍生的二次釋義組（$\\mathcal{S}$）。我們的分析探討了兩個關鍵問題：(1) $\\mathcal{O}$ 和 $\\mathcal{G}$ 之間潛在社群結構的差異是否與 $\\mathcal{G}$ 和 $\\mathcal{S}$ 之間的差異相同？(2) 隨著控制文字變異性的 LLM 參數進行調整，$\\mathcal{G}$ 是否會變得更類似於 $\\mathcal{O}$？第一個問題基於以下假設：如果 LLM 生成的文字確實類似於人類語言，那麼成對（$\\mathcal{O}$，$\\mathcal{G}$）之間的差距應該類似於成對（$\\mathcal{G}$，$\\mathcal{S}$）之間的差距，因為這兩對都包含原始文字及其釋義。第二個問題探討 LLM 生成的文字和人類文字之間的相似度是否會隨著文字生成廣度的變化而變化。為了探討這些問題，我們提出了一個統計假設檢定架構，利用了每個文字在所有資料集之間都有對應部分的事實，因為它們之間存在釋義關係。這種關係使得一個資料集的相對位置可以對應到另一個資料集，從而允許兩個資料集對應到第三個資料集。因此，這兩個對應的資料集都可以根據第三個資料集的特徵空間進行量化，從而便於在它們之間進行直接比較。我們的結果表明，GPT 生成的文字仍然有別於人類撰寫的文字。", "author": "Mose Park et.al.", "authors": "Mose Park, Yunjin Choi, Jong-June Jeon", "id": "2501.01273v1", "paper_url": "http://arxiv.org/abs/2501.01273v1", "repo": "null"}}