{"2502.12904": {"publish_time": "2025-02-18", "title": "Fraud-R1 : A Multi-Round Benchmark for Assessing the Robustness of LLM Against Augmented Fraud and Phishing Inducements", "paper_summary": "We introduce Fraud-R1, a benchmark designed to evaluate LLMs' ability to\ndefend against internet fraud and phishing in dynamic, real-world scenarios.\nFraud-R1 comprises 8,564 fraud cases sourced from phishing scams, fake job\npostings, social media, and news, categorized into 5 major fraud types. Unlike\nprevious benchmarks, Fraud-R1 introduces a multi-round evaluation pipeline to\nassess LLMs' resistance to fraud at different stages, including credibility\nbuilding, urgency creation, and emotional manipulation. Furthermore, we\nevaluate 15 LLMs under two settings: 1. Helpful-Assistant, where the LLM\nprovides general decision-making assistance, and 2. Role-play, where the model\nassumes a specific persona, widely used in real-world agent-based interactions.\nOur evaluation reveals the significant challenges in defending against fraud\nand phishing inducement, especially in role-play settings and fake job\npostings. Additionally, we observe a substantial performance gap between\nChinese and English, underscoring the need for improved multilingual fraud\ndetection capabilities.", "paper_summary_zh": "我們推出 Fraud-R1，一個基準，旨在評估 LLM 在動態、真實世界場景中防範網路詐騙和網路釣魚的能力。Fraud-R1 包含 8,564 起詐騙案例，來源包括網路釣魚詐騙、虛假職缺、社群媒體和新聞，分類為 5 種類型的主要詐騙手法。與先前的基準不同，Fraud-R1 引入多輪評估管道，以評估 LLM 在不同階段對詐騙的抵抗力，包括建立信譽、製造急迫感和情感操縱。此外，我們在兩種設定下評估 15 個 LLM：1. 協助助理，其中 LLM 提供一般決策協助，以及 2. 角色扮演，其中模型假設特定角色，廣泛用於現實世界中基於代理的互動。我們的評估揭示了在防範詐騙和網路釣魚誘導方面面臨的重大挑戰，尤其是在角色扮演設定和虛假職缺中。此外，我們觀察到中文和英文之間有顯著的效能差距，這凸顯了改進多語言詐騙偵測功能的必要性。", "author": "Shu Yang et.al.", "authors": "Shu Yang, Shenzhe Zhu, Zeyu Wu, Keyu Wang, Junchi Yao, Junchao Wu, Lijie Hu, Mengdi Li, Derek F. Wong, Di Wang", "id": "2502.12904v1", "paper_url": "http://arxiv.org/abs/2502.12904v1", "repo": "null"}}