{"2410.13310": {"publish_time": "2024-10-17", "title": "Active inference and deep generative modeling for cognitive ultrasound", "paper_summary": "Ultrasound (US) has the unique potential to offer access to medical imaging\nto anyone, everywhere. Devices have become ultra-portable and cost-effective,\nakin to the stethoscope. Nevertheless US image quality and diagnostic efficacy\nare still highly operator- and patient-dependent. In difficult-to-image\npatients, image quality is often insufficient for reliable diagnosis. In this\npaper, we put forth that US imaging systems can be recast as\ninformation-seeking agents that engage in reciprocal interactions with their\nanatomical environment. Such agents autonomously adapt their transmit-receive\nsequences to fully personalize imaging and actively maximize information gain\nin-situ. To that end, we will show that the sequence of pulse-echo experiments\nthat a US system performs can be interpreted as a perception-action loop: the\naction is the data acquisition, probing tissue with acoustic waves and\nrecording reflections at the detection array, and perception is the inference\nof the anatomical and or functional state, potentially including associated\ndiagnostic quantities. We then equip systems with a mechanism to actively\nreduce uncertainty and maximize diagnostic value across a sequence of\nexperiments, treating action and perception jointly using Bayesian inference\ngiven generative models of the environment and action-conditional pulse-echo\nobservations. Since the representation capacity of the generative models\ndictates both the quality of inferred anatomical states and the effectiveness\nof inferred sequences of future imaging actions, we will be greatly leveraging\nthe enormous advances in deep generative modelling that are currently\ndisrupting many fields and society at large. Finally, we show some examples of\ncognitive, closed-loop, US systems that perform active beamsteering and\nadaptive scanline selection, based on deep generative models that track\nanatomical belief states.", "paper_summary_zh": "超音波 (US) 具有提供醫療影像的獨特潛力，可供任何人在任何地方使用。裝置已變得極為便攜且經濟實惠，類似於聽診器。儘管如此，超音波影像品質和診斷效能仍然高度依賴操作者和患者。在難以成像的患者中，影像品質通常不足以進行可靠的診斷。在本文中，我們提出超音波影像系統可以重新定義為資訊尋求代理，與其解剖環境進行交互作用。此類代理會自主調整其傳輸接收序列，以完全個人化影像並積極最大化現場資訊獲取。為此，我們將展示超音波系統執行的脈衝回波實驗序列可以解釋為感知動作迴圈：動作是資料擷取，使用聲波探測組織並記錄偵測陣列的反射，而感知是解剖和功能狀態的推論，可能包括相關的診斷量。然後，我們為系統配備一種機制，以積極減少不確定性並在實驗序列中最大化診斷價值，使用貝氏推論共同處理動作和感知，並提供環境的生成模型和動作條件脈衝回波觀測。由於生成模型的表示能力決定了推論解剖狀態的品質和推論未來影像動作序列的有效性，我們將大力利用深度生成模型的巨大進展，這些進展目前正在顛覆許多領域和整個社會。最後，我們展示了一些認知、閉迴路超音波系統的範例，這些系統執行主動波束導引和自適應掃描線選取，基於追蹤解剖信念狀態的深度生成模型。", "author": "Ruud JG van Sloun et.al.", "authors": "Ruud JG van Sloun", "id": "2410.13310v1", "paper_url": "http://arxiv.org/abs/2410.13310v1", "repo": "null"}}