{"2409.17904": {"publish_time": "2024-09-26", "title": "Learning to Love Edge Cases in Formative Math Assessment: Using the AMMORE Dataset and Chain-of-Thought Prompting to Improve Grading Accuracy", "paper_summary": "This paper introduces AMMORE, a new dataset of 53,000 math open-response\nquestion-answer pairs from Rori, a learning platform used by students in\nseveral African countries and conducts two experiments to evaluate the use of\nlarge language models (LLM) for grading particularly challenging student\nanswers. The AMMORE dataset enables various potential analyses and provides an\nimportant resource for researching student math acquisition in understudied,\nreal-world, educational contexts. In experiment 1 we use a variety of\nLLM-driven approaches, including zero-shot, few-shot, and chain-of-thought\nprompting, to grade the 1% of student answers that a rule-based classifier\nfails to grade accurately. We find that the best-performing approach --\nchain-of-thought prompting -- accurately scored 92% of these edge cases,\neffectively boosting the overall accuracy of the grading from 98.7% to 99.9%.\nIn experiment 2, we aim to better understand the consequential validity of the\nimproved grading accuracy, by passing grades generated by the best-performing\nLLM-based approach to a Bayesian Knowledge Tracing (BKT) model, which estimated\nstudent mastery of specific lessons. We find that relatively modest\nimprovements in model accuracy at the individual question level can lead to\nsignificant changes in the estimation of student mastery. Where the rules-based\nclassifier currently used to grade student, answers misclassified the mastery\nstatus of 6.9% of students across their completed lessons, using the LLM\nchain-of-thought approach this misclassification rate was reduced to 2.6% of\nstudents. Taken together, these findings suggest that LLMs could be a valuable\ntool for grading open-response questions in K-12 mathematics education,\npotentially enabling encouraging wider adoption of open-ended questions in\nformative assessment.", "paper_summary_zh": "本論文介紹了 AMMORE，這是一個包含 53,000 個數學開放式問答配對的新資料集，這些資料集來自 Rori，這是幾個非洲國家的學生所使用的學習平台，並進行了兩項實驗來評估使用大型語言模型 (LLM) 來評分特別具有挑戰性的學生答案。AMMORE 資料集啟用了各種潛在分析，並提供了研究學生數學能力在未被充分研究的現實世界教育環境中的重要資源。在實驗 1 中，我們使用各種 LLM 驅動的方法，包括零次學習、少次學習和思考鏈提示，來評分規則式分類器無法準確評分的 1% 學生答案。我們發現，表現最好的方法——思考鏈提示——準確地評分了這些邊緣案例的 92%，有效地將評分的整體準確度從 98.7% 提升至 99.9%。在實驗 2 中，我們旨在通過將表現最好的基於 LLM 的方法產生的成績傳遞給貝氏知識追蹤 (BKT) 模型，來更好地了解改進的評分準確性的後果有效性，該模型估計了學生對特定課程的掌握程度。我們發現，在個別問題層面上模型準確度的相對適度的改進可能會導致學生掌握程度估計的顯著變化。目前用於評分學生的基於規則的分類器錯誤地分類了學生在完成課程中的 6.9% 的掌握狀態，使用 LLM 思考鏈方法將此錯誤分類率降低至 2.6% 的學生。綜上所述，這些發現表明 LLM 可能是 K-12 數學教育中評分開放式問題的寶貴工具，有可能促進在形成性評估中更廣泛地採用開放式問題。", "author": "Owen Henkel et.al.", "authors": "Owen Henkel, Hannah Horne-Robinson, Maria Dyshel, Nabil Ch, Baptiste Moreau-Pernet, Ralph Abood", "id": "2409.17904v1", "paper_url": "http://arxiv.org/abs/2409.17904v1", "repo": "null"}}