{"2406.16567": {"publish_time": "2024-06-24", "title": "Data Augmentation of Multi-turn Psychological Dialogue via Knowledge-driven Progressive Thought Prompting", "paper_summary": "Existing dialogue data augmentation (DA) techniques predominantly focus on\naugmenting utterance-level dialogues, which makes it difficult to take dialogue\ncontextual information into account. The advent of large language models (LLMs)\nhas simplified the implementation of multi-turn dialogues. Due to absence of\nprofessional understanding and knowledge, it remains challenging to deliver\nsatisfactory performance in low-resource domain, like psychological dialogue\ndialogue. DA involves creating new training or prompting data based on the\nexisting data, which help the model better understand and generate\npsychology-related responses. In this paper, we aim to address the issue of\nmulti-turn dialogue data augmentation for boosted performance in the psychology\ndomain. We propose a knowledge-driven progressive thought prompting method to\nguide LLM to generate multi-turn psychology-related dialogue. This method\nintegrates a progressive thought generator, a psychology knowledge generator,\nand a multi-turn dialogue generator. The thought generated by the progressive\nthought generator serves as a prompt to prevent the generated dialogue from\nhaving significant semantic deviations, while the psychology knowledge\ngenerator produces psychological knowledge to serve as the dialogue history for\nthe LLM, guiding the dialogue generator to create multi-turn psychological\ndialogue. To ensure the precision of multi-turn psychological dialogue\ngeneration by LLM, a meticulous professional evaluation is required. Extensive\nexperiments conducted on three datasets related to psychological dialogue\nverify the effectiveness of the proposed method.", "paper_summary_zh": "現有對話資料擴充 (DA) 技術主要集中於擴充話語層級的對話，這使得難以考量對話的脈絡資訊。大型語言模型 (LLM) 的出現簡化了多輪對話的實作。由於缺乏專業的理解和知識，在低資源領域（例如心理對話對話）中提供令人滿意的表現仍然是一項挑戰。DA 涉及根據現有資料建立新的訓練或提示資料，這有助於模型更好地理解和產生與心理相關的回應。在本文中，我們旨在解決多輪對話資料擴充的問題，以提升心理領域的表現。我們提出了一種知識驅動的漸進式思考提示方法，以引導 LLM 產生多輪與心理相關的對話。此方法整合了一個漸進式思考產生器、一個心理知識產生器和一個多輪對話產生器。漸進式思考產生器產生的思考作為一個提示，以防止產生的對話產生重大的語義偏差，而心理知識產生器則產生心理知識作為 LLM 的對話歷程，引導對話產生器建立多輪心理對話。為了確保 LLM 產生多輪心理對話的精確性，需要進行細緻的專業評估。在與心理對話相關的三個資料集上進行的廣泛實驗驗證了所提出方法的有效性。", "author": "Jiyue Jiang et.al.", "authors": "Jiyue Jiang, Liheng Chen, Sheng Wang, Lingpeng Kong, Yu Li, Chuan Wu", "id": "2406.16567v1", "paper_url": "http://arxiv.org/abs/2406.16567v1", "repo": "null"}}