{"2408.10934": {"publish_time": "2024-08-20", "title": "SDI-Net: Toward Sufficient Dual-View Interaction for Low-light Stereo Image Enhancement", "paper_summary": "Currently, most low-light image enhancement methods only consider information\nfrom a single view, neglecting the correlation between cross-view information.\nTherefore, the enhancement results produced by these methods are often\nunsatisfactory. In this context, there have been efforts to develop methods\nspecifically for low-light stereo image enhancement. These methods take into\naccount the cross-view disparities and enable interaction between the left and\nright views, leading to improved performance. However, these methods still do\nnot fully exploit the interaction between left and right view information. To\naddress this issue, we propose a model called Toward Sufficient Dual-View\nInteraction for Low-light Stereo Image Enhancement (SDI-Net). The backbone\nstructure of SDI-Net is two encoder-decoder pairs, which are used to learn the\nmapping function from low-light images to normal-light images. Among the\nencoders and the decoders, we design a module named Cross-View Sufficient\nInteraction Module (CSIM), aiming to fully exploit the correlations between the\nbinocular views via the attention mechanism. The quantitative and visual\nresults on public datasets validate the superiority of our method over other\nrelated methods. Ablation studies also demonstrate the effectiveness of the key\nelements in our model.", "paper_summary_zh": "目前，大多数低光图像增强方法只考虑单一视图的信息，忽略了跨视图信息之间的相关性。因此，这些方法产生的增强结果通常不令人满意。在此背景下，人们一直努力开发专门用于低光立体图像增强的算法。这些方法考虑了跨视图差异，并实现了左右视图之间的交互，从而提高了性能。然而，这些方法仍然没有充分利用左右视图信息之间的交互。为了解决这个问题，我们提出了一个名为低光立体图像增强充分双视图交互（SDI-Net）的模型。SDI-Net 的主干结构是两个编码器-解码器对，用于学习从低光图像到正常光图像的映射函数。在编码器和解码器中，我们设计了一个名为跨视图充分交互模块（CSIM）的模块，旨在通过注意力机制充分利用双目视图之间的相关性。公开数据集上的定量和视觉结果验证了我们方法优于其他相关方法。消融研究还证明了我们模型中关键元素的有效性。", "author": "Linlin Hu et.al.", "authors": "Linlin Hu, Ao Sun, Shijie Hao, Richang Hong, Meng Wang", "id": "2408.10934v1", "paper_url": "http://arxiv.org/abs/2408.10934v1", "repo": "null"}}