{"2407.19610": {"publish_time": "2024-07-28", "title": "Mixture of Modular Experts: Distilling Knowledge from a Multilingual Teacher into Specialized Modular Language Models", "paper_summary": "This research combines Knowledge Distillation (KD) and Mixture of Experts\n(MoE) to develop modular, efficient multilingual language models. Key\nobjectives include evaluating adaptive versus fixed alpha methods in KD and\ncomparing modular MoE architectures for handling multi-domain inputs and\npreventing catastrophic forgetting. KD compresses large language models (LLMs)\ninto smaller, efficient models, while MoE enhances modularity with specialized\ntasks. Experiments showed similar performance for both KD methods, with\nmarginal improvements from adaptive alpha. A combined loss approach provided\nmore stable learning. The router, trained to classify input sequences into\nEnglish, French, German, or Python, achieved 99.95% precision, recall, and F1\nscore, with Logistic Regression being the most effective classifier.\nEvaluations of modular MoE architectures revealed that Pre-trained Language\nExperts (PLE) and Joint Expert Embedding Training (JEET) performed similarly,\nwhile the MoE with Common Expert (MoE-CE) setup showed slightly lower\nperformance. Including a common expert in MoE-CE improved its performance.\nStudies on catastrophic forgetting indicated that sequential training led to\nsignificant forgetting, while single-session training with balanced batches and\nthe MoE approach mitigated this issue. The MoE architecture preserved knowledge\nacross multiple languages effectively.\n  The research contributes open-sourced resources including the dataset\n(https://zenodo.org/doi/10.5281/zenodo.12677631), a balanced dataset creation\ntool (https://github.com/padas-lab-de/multi-language-dataset-creator), and the\nresearch codebase (https://github.com/ModMaamari/mixture-modular-experts).", "paper_summary_zh": "<paragraph>本研究結合知識蒸餾 (KD) 和專家混合 (MoE) 來開發模組化、高效的多語言語言模型。主要目標包括評估 KD 中的適應性與固定 alpha 方法，以及比較模組化 MoE 架構以處理多領域輸入並防止災難性遺忘。KD 將大型語言模型 (LLM) 壓縮成更小、更有效率的模型，而 MoE 則透過專門任務增強模組化。實驗顯示兩種 KD 方法的效能相似，適應性 alpha 的邊際改善。結合損失法提供了更穩定的學習。經過訓練以將輸入序列分類為英語、法語、德語或 Python 的路由器達到了 99.95% 的精確度、召回率和 F1 分數，其中邏輯迴歸是最有效的分類器。對模組化 MoE 架構的評估顯示，預先訓練的語言專家 (PLE) 和聯合專家嵌入訓練 (JEET) 的表現相似，而具有共同專家 (MoE-CE) 設定的 MoE 顯示出略低的表現。在 MoE-CE 中加入一個共同專家改善了其表現。對災難性遺忘的研究表明，順序訓練導致顯著的遺忘，而使用平衡批次和 MoE 方法的單一課程訓練減輕了這個問題。MoE 架構有效地保留了多種語言的知識。本研究提供了開放原始碼資源，包括資料集 (https://zenodo.org/doi/10.5281/zenodo.12677631)、平衡資料集建立工具 (https://github.com/padas-lab-de/multi-language-dataset-creator) 和研究程式碼庫 (https://github.com/ModMaamari/mixture-modular-experts)。</paragraph>", "author": "Mohammed Al-Maamari et.al.", "authors": "Mohammed Al-Maamari, Mehdi Ben Amor, Michael Granitzer", "id": "2407.19610v1", "paper_url": "http://arxiv.org/abs/2407.19610v1", "repo": "https://github.com/padas-lab-de/multi-language-dataset-creator"}}