{"2407.12200": {"publish_time": "2024-07-16", "title": "This Probably Looks Exactly Like That: An Invertible Prototypical Network", "paper_summary": "We combine concept-based neural networks with generative, flow-based\nclassifiers into a novel, intrinsically explainable, exactly invertible\napproach to supervised learning. Prototypical neural networks, a type of\nconcept-based neural network, represent an exciting way forward in realizing\nhuman-comprehensible machine learning without concept annotations, but a\nhuman-machine semantic gap continues to haunt current approaches. We find that\nreliance on indirect interpretation functions for prototypical explanations\nimposes a severe limit on prototypes' informative power. From this, we posit\nthat invertibly learning prototypes as distributions over the latent space\nprovides more robust, expressive, and interpretable modeling. We propose one\nsuch model, called ProtoFlow, by composing a normalizing flow with Gaussian\nmixture models. ProtoFlow (1) sets a new state-of-the-art in joint generative\nand predictive modeling and (2) achieves predictive performance comparable to\nexisting prototypical neural networks while enabling richer interpretation.", "paper_summary_zh": "我們將基於概念的神經網路與生成式、基於流動的分類器結合到一個新穎、內在可解釋、精確可逆的監督學習方法中。原型神經網路是一種基於概念的神經網路，代表了一種令人興奮的實現人類可理解機器學習的方法，無需概念註解，但人類與機器語義差距持續困擾著當前的做法。我們發現依賴原型解釋的間接解釋功能對原型的資訊能力施加了嚴格的限制。從此，我們假設將可逆學習原型視為潛在空間上的分佈提供了更強健、更有表現力且更可解釋的建模。我們提出一個這樣的模型，稱為 ProtoFlow，透過將正規化流與高斯混合模型組合而成。ProtoFlow (1) 設定了聯合生成式和預測建模的最新技術，並 (2) 達到與現有原型神經網路相當的預測效能，同時支援更豐富的解釋。", "author": "Zachariah Carmichael et.al.", "authors": "Zachariah Carmichael, Timothy Redgrave, Daniel Gonzalez Cedre, Walter J. Scheirer", "id": "2407.12200v1", "paper_url": "http://arxiv.org/abs/2407.12200v1", "repo": "https://github.com/craymichael/protoflow"}}