{"2406.17763": {"publish_time": "2024-06-25", "title": "DiffusionPDE: Generative PDE-Solving Under Partial Observation", "paper_summary": "We introduce a general framework for solving partial differential equations\n(PDEs) using generative diffusion models. In particular, we focus on the\nscenarios where we do not have the full knowledge of the scene necessary to\napply classical solvers. Most existing forward or inverse PDE approaches\nperform poorly when the observations on the data or the underlying coefficients\nare incomplete, which is a common assumption for real-world measurements. In\nthis work, we propose DiffusionPDE that can simultaneously fill in the missing\ninformation and solve a PDE by modeling the joint distribution of the solution\nand coefficient spaces. We show that the learned generative priors lead to a\nversatile framework for accurately solving a wide range of PDEs under partial\nobservation, significantly outperforming the state-of-the-art methods for both\nforward and inverse directions.", "paper_summary_zh": "我們提出一個通用架構，用生成擴散模型解決偏微分方程式 (PDE)。特別是，我們專注於我們沒有場景的完整知識，無法應用經典求解器的情況。當資料或基礎係數的觀測不完整時，現有的正向或反向 PDE 方法大多表現不佳，這是現實世界測量的一個常見假設。在這項工作中，我們提出 DiffusionPDE，它可以同時填補遺失的資訊並透過對解和係數空間的聯合分佈建模來求解 PDE。我們展示了學習到的生成先驗導致了一個通用的框架，用於在部分觀測下準確求解各種 PDE，顯著優於正向和反向方向的最新方法。", "author": "Jiahe Huang et.al.", "authors": "Jiahe Huang, Guandao Yang, Zichen Wang, Jeong Joon Park", "id": "2406.17763v1", "paper_url": "http://arxiv.org/abs/2406.17763v1", "repo": "null"}}