{"2407.03076": {"publish_time": "2024-07-03", "title": "A Case Study on Context-Aware Neural Machine Translation with Multi-Task Learning", "paper_summary": "In document-level neural machine translation (DocNMT), multi-encoder\napproaches are common in encoding context and source sentences. Recent studies\n\\cite{li-etal-2020-multi-encoder} have shown that the context encoder generates\nnoise and makes the model robust to the choice of context. This paper further\ninvestigates this observation by explicitly modelling context encoding through\nmulti-task learning (MTL) to make the model sensitive to the choice of context.\nWe conduct experiments on cascade MTL architecture, which consists of one\nencoder and two decoders. Generation of the source from the context is\nconsidered an auxiliary task, and generation of the target from the source is\nthe main task. We experimented with German--English language pairs on News,\nTED, and Europarl corpora. Evaluation results show that the proposed MTL\napproach performs better than concatenation-based and multi-encoder DocNMT\nmodels in low-resource settings and is sensitive to the choice of context.\nHowever, we observe that the MTL models are failing to generate the source from\nthe context. These observations align with the previous studies, and this might\nsuggest that the available document-level parallel corpora are not\ncontext-aware, and a robust sentence-level model can outperform the\ncontext-aware models.", "paper_summary_zh": "在文件級神經機器翻譯 (DocNMT) 中，多編碼器方法在編碼上下文和原始句子時很常見。最近的研究\\cite{li-etal-2020-multi-encoder}表明，上下文編碼器會產生雜訊並使模型對上下文選擇具有魯棒性。本文通過多任務學習 (MTL) 明確建模上下文編碼，進一步探討了這一觀察結果，以使模型對上下文選擇敏感。我們對串聯 MTL 架構進行了實驗，該架構由一個編碼器和兩個解碼器組成。從上下文中生成來源被認為是一種輔助任務，而從來源生成目標是主要任務。我們對 News、TED 和 Europarl 語料庫上的德語-英語語言對進行了實驗。評估結果表明，所提出的 MTL 方法在低資源設置中比基於串接的多編碼器 DocNMT 模型表現得更好，並且對上下文選擇很敏感。然而，我們觀察到 MTL 模型無法從上下文中生成來源。這些觀察結果與先前的研究一致，這可能表明可用的文件級平行語料庫沒有上下文感知，並且魯棒的句子級模型可以優於上下文感知模型。", "author": "Ramakrishna Appicharla et.al.", "authors": "Ramakrishna Appicharla, Baban Gain, Santanu Pal, Asif Ekbal, Pushpak Bhattacharyya", "id": "2407.03076v1", "paper_url": "http://arxiv.org/abs/2407.03076v1", "repo": "null"}}