{"2405.07943": {"publish_time": "2024-05-13", "title": "Hierarchical Decision Mamba", "paper_summary": "Recent advancements in imitation learning have been largely fueled by the\nintegration of sequence models, which provide a structured flow of information\nto effectively mimic task behaviours. Currently, Decision Transformer (DT) and\nsubsequently, the Hierarchical Decision Transformer (HDT), presented\nTransformer-based approaches to learn task policies. Recently, the Mamba\narchitecture has shown to outperform Transformers across various task domains.\nIn this work, we introduce two novel methods, Decision Mamba (DM) and\nHierarchical Decision Mamba (HDM), aimed at enhancing the performance of the\nTransformer models. Through extensive experimentation across diverse\nenvironments such as OpenAI Gym and D4RL, leveraging varying demonstration data\nsets, we demonstrate the superiority of Mamba models over their Transformer\ncounterparts in a majority of tasks. Results show that HDM outperforms other\nmethods in most settings. The code can be found at\nhttps://github.com/meowatthemoon/HierarchicalDecisionMamba.", "paper_summary_zh": "最近的模仿學習進展在很大程度上是由序列模型的整合推動的，這些模型提供了結構化的資訊流，以有效地模仿任務行為。目前，決策Transformer (DT) 以及隨後的層級決策Transformer (HDT) 提出基於Transformer的策略來學習任務政策。最近，Mamba 架構已證明在各種任務領域中優於Transformer。在這項工作中，我們介紹了兩種新方法，即決策 Mamba (DM) 和層級決策 Mamba (HDM)，旨在增強Transformer模型的效能。透過在不同的環境（例如 OpenAI Gym 和 D4RL）中進行廣泛的實驗，利用不同的示範資料集，我們證明了 Mamba 模型在大部分任務中優於其Transformer對應模型。結果顯示，HDM 在大多數設定中優於其他方法。程式碼可以在 https://github.com/meowatthemoon/HierarchicalDecisionMamba 中找到。", "author": "André Correia et.al.", "authors": "André Correia, Luís A. Alexandre", "id": "2405.07943v1", "paper_url": "http://arxiv.org/abs/2405.07943v1", "repo": "https://github.com/meowatthemoon/hierarchicaldecisionmamba"}}