{"2502.04058": {"publish_time": "2025-02-06", "title": "Strategic Learning with Local Explanations as Feedback", "paper_summary": "We investigate algorithmic decision problems where agents can respond\nstrategically to the decision maker's (DM) models. The demand for clear and\nactionable explanations from DMs to (potentially strategic) agents continues to\nrise. While prior work often treats explanations as full model disclosures,\nexplanations in practice might convey only partial information, which can lead\nto misinterpretations and harmful responses. When full disclosure of the\npredictive model is neither feasible nor desirable, a key open question is how\nDMs can use explanations to maximise their utility without compromising agent\nwelfare. In this work, we explore well-known local and global explanation\nmethods, and establish a necessary condition to prevent explanations from\nmisleading agents into self-harming actions. Moreover, with conditional\nhomogeneity, we establish that action recommendation (AR)-based explanations\nare sufficient for non-harmful responses, akin to the revelation principle in\ninformation design. To operationalise AR-based explanations, we propose a\nsimple algorithm to jointly optimise the predictive model and AR policy to\nbalance DM outcomes with agent welfare. Our empirical results demonstrate the\nbenefits of this approach as a more refined strategy for safe and effective\npartial model disclosure in algorithmic decision-making.", "paper_summary_zh": "我們研究演算法決策問題，其中代理人可以對決策者 (DM) 的模型做出策略性回應。DM 對（潛在策略性）代理人的明確且可操作的解釋需求持續增加。雖然先前的研究通常將解釋視為完整的模型揭露，但實際上的解釋可能只傳達部分資訊，這可能導致誤解和有害的回應。當預測模型的完全揭露既不可行也不可取時，一個關鍵的開放性問題是 DM 如何使用解釋來最大化其效用，而不會損害代理人的福利。在這項工作中，我們探討了著名的局部和全局解釋方法，並建立了一個必要條件，以防止解釋誤導代理人採取自殘行為。此外，透過條件同質性，我們確立基於動作建議 (AR) 的解釋足以產生無害的回應，類似於資訊設計中的揭露原則。為了操作基於 AR 的解釋，我們提出了一個簡單的演算法，以共同最佳化預測模型和 AR 策略，以平衡 DM 結果與代理人福利。我們的實證結果證明了這種方法的好處，作為演算法決策中安全且有效的局部模型揭露的更精緻策略。", "author": "Kiet Q. H. Vo et.al.", "authors": "Kiet Q. H. Vo, Siu Lun Chau, Masahiro Kato, Yixin Wang, Krikamol Muandet", "id": "2502.04058v1", "paper_url": "http://arxiv.org/abs/2502.04058v1", "repo": "null"}}