{"2207.05811": {"publish_time": "2022-07-12", "title": "Revealing Unfair Models by Mining Interpretable Evidence", "paper_summary": "The popularity of machine learning has increased the risk of unfair models\ngetting deployed in high-stake applications, such as justice system,\ndrug/vaccination design, and medical diagnosis. Although there are effective\nmethods to train fair models from scratch, how to automatically reveal and\nexplain the unfairness of a trained model remains a challenging task. Revealing\nunfairness of machine learning models in interpretable fashion is a critical\nstep towards fair and trustworthy AI. In this paper, we systematically tackle\nthe novel task of revealing unfair models by mining interpretable evidence\n(RUMIE). The key idea is to find solid evidence in the form of a group of data\ninstances discriminated most by the model. To make the evidence interpretable,\nwe also find a set of human-understandable key attributes and decision rules\nthat characterize the discriminated data instances and distinguish them from\nthe other non-discriminated data. As demonstrated by extensive experiments on\nmany real-world data sets, our method finds highly interpretable and solid\nevidence to effectively reveal the unfairness of trained models. Moreover, it\nis much more scalable than all of the baseline methods.", "paper_summary_zh": "機器學習的普及性已增加不公平模型被部署在高風險應用程式的風險，例如司法系統、藥物/疫苗設計和醫療診斷。儘管有從頭開始訓練公平模型的有效方法，但如何自動揭露和解釋訓練模型的不公平性仍然是一項具有挑戰性的任務。以可解釋的方式揭露機器學習模型的不公平性是邁向公平且值得信賴的人工智慧的關鍵一步。在本文中，我們系統性地應對揭露不公平模型的新任務，方法是挖掘可解釋的證據 (RUMIE)。關鍵的想法是以一組資料實例的形式找到確鑿證據，這些實例受到模型最大的歧視。為了使證據可解釋，我們還找到了一組人類可以理解的關鍵屬性和決策規則，這些屬性和決策規則描述了受到歧視的資料實例，並將它們與其他未受到歧視的資料區分開來。正如在許多實際資料集上進行的廣泛實驗所證明的那樣，我們的模型找到了高度可解釋且確鑿的證據，可以有效地揭露訓練模型的不公平性。此外，它比所有基線方法的可擴充性都要高得多。", "author": "Mohit Bajaj et.al.", "authors": "Mohit Bajaj, Lingyang Chu, Vittorio Romaniello, Gursimran Singh, Jian Pei, Zirui Zhou, Lanjun Wang, Yong Zhang", "id": "2207.05811v1", "paper_url": "http://arxiv.org/abs/2207.05811v1", "repo": "null"}}