{"2407.08206": {"publish_time": "2024-07-11", "title": "System Report for CCL24-Eval Task 7: Multi-Error Modeling and Fluency-Targeted Pre-training for Chinese Essay Evaluation", "paper_summary": "This system report presents our approaches and results for the Chinese Essay\nFluency Evaluation (CEFE) task at CCL-2024. For Track 1, we optimized\npredictions for challenging fine-grained error types using binary\nclassification models and trained coarse-grained models on the Chinese Learner\n4W corpus. In Track 2, we enhanced performance by constructing a pseudo-dataset\nwith multiple error types per sentence. For Track 3, where we achieved first\nplace, we generated fluency-rated pseudo-data via back-translation for\npre-training and used an NSP-based strategy with Symmetric Cross Entropy loss\nto capture context and mitigate long dependencies. Our methods effectively\naddress key challenges in Chinese Essay Fluency Evaluation.", "paper_summary_zh": "本系統報告介紹了我們在 CCL-2024 中文作文流暢度評估 (CEFE) 任務中的方法和結果。對於軌道 1，我們使用二元分類模型優化了對具有挑戰性的細粒度錯誤類型的預測，並在中文學習者 4W 語料庫上訓練了粗粒度模型。在軌道 2 中，我們通過構建每句話具有多種錯誤類型的偽數據集來增強性能。對於我們獲得第一名的軌道 3，我們通過反向翻譯生成了流暢度評級的偽數據，用於預訓練，並使用基於 NSP 的策略與對稱交叉熵損失來捕捉上下文並減輕長依賴性。我們的這些方法有效地應對了中文作文流暢度評估中的關鍵挑戰。", "author": "Jingshen Zhang et.al.", "authors": "Jingshen Zhang, Xiangyu Yang, Xinkai Su, Xinglu Chen, Tianyou Huang, Xinying Qiu", "id": "2407.08206v1", "paper_url": "http://arxiv.org/abs/2407.08206v1", "repo": "null"}}