{"2405.20718": {"publish_time": "2024-05-31", "title": "Popularity-Aware Alignment and Contrast for Mitigating Popularity Bias", "paper_summary": "Collaborative Filtering (CF) typically suffers from the significant challenge\nof popularity bias due to the uneven distribution of items in real-world\ndatasets. This bias leads to a significant accuracy gap between popular and\nunpopular items. It not only hinders accurate user preference understanding but\nalso exacerbates the Matthew effect in recommendation systems. To alleviate\npopularity bias, existing efforts focus on emphasizing unpopular items or\nseparating the correlation between item representations and their popularity.\nDespite the effectiveness, existing works still face two persistent challenges:\n(1) how to extract common supervision signals from popular items to improve the\nunpopular item representations, and (2) how to alleviate the representation\nseparation caused by popularity bias. In this work, we conduct an empirical\nanalysis of popularity bias and propose Popularity-Aware Alignment and Contrast\n(PAAC) to address two challenges. Specifically, we use the common supervisory\nsignals modeled in popular item representations and propose a novel\npopularity-aware supervised alignment module to learn unpopular item\nrepresentations. Additionally, we suggest re-weighting the contrastive learning\nloss to mitigate the representation separation from a popularity-centric\nperspective. Finally, we validate the effectiveness and rationale of PAAC in\nmitigating popularity bias through extensive experiments on three real-world\ndatasets. Our code is available at\nhttps://github.com/miaomiao-cai2/KDD2024-PAAC.", "paper_summary_zh": "協同過濾 (CF) 通常會因為真實世界資料集中項目分佈不均而遭受顯著的熱門偏差挑戰。此偏差導致熱門和冷門項目之間的顯著準確度差距。它不僅妨礙準確了解使用者的偏好，還會加劇推薦系統中的馬太效應。為了減輕熱門偏差，現有的方法專注於強調冷門項目或分離項目表示與其熱門程度之間的關聯性。儘管有效，但現有的工作仍面臨兩個持續的挑戰：(1) 如何從熱門項目中提取共同的監督信號來改善冷門項目表示，以及 (2) 如何減輕熱門偏差造成的表示分離。在這項工作中，我們對熱門偏差進行了實證分析，並提出 Popularity-Aware Alignment and Contrast (PAAC) 來應對這兩個挑戰。具體來說，我們使用在熱門項目表示中建模的共同監督信號，並提出一個新穎的熱門感知監督式對齊模組來學習冷門項目表示。此外，我們建議重新加權對比學習損失，以從以熱門為中心的觀點減輕表示分離。最後，我們通過在三個真實世界資料集上進行廣泛的實驗，驗證了 PAAC 在減輕熱門偏差方面的有效性和原理。我們的程式碼可在 https://github.com/miaomiao-cai2/KDD2024-PAAC 取得。", "author": "Miaomiao Cai et.al.", "authors": "Miaomiao Cai, Lei Chen, Yifan Wang, Haoyue Bai, Peijie Sun, Le Wu, Min Zhang, Meng Wang", "id": "2405.20718v1", "paper_url": "http://arxiv.org/abs/2405.20718v1", "repo": "https://github.com/miaomiao-cai2/kdd2024-paac"}}