{"2406.12620": {"publish_time": "2024-06-18", "title": "What makes two models think alike?", "paper_summary": "Do architectural differences significantly affect the way models represent\nand process language? We propose a new approach, based on metric-learning\nencoding models (MLEMs), as a first step to answer this question. The approach\nprovides a feature-based comparison of how any two layers of any two models\nrepresent linguistic information. We apply the method to BERT, GPT-2 and Mamba.\nUnlike previous methods, MLEMs offer a transparent comparison, by identifying\nthe specific linguistic features responsible for similarities and differences.\nMore generally, the method uses formal, symbolic descriptions of a domain, and\nuse these to compare neural representations. As such, the approach can\nstraightforwardly be extended to other domains, such as speech and vision, and\nto other neural systems, including human brains.", "paper_summary_zh": "架構差異是否會顯著影響模型呈現和處理語言的方式？我們提出一個新的方法，以度量學習編碼模型 (MLEM) 為基礎，作為回答這個問題的第一步。此方法提供一個基於特徵的比較，說明任何兩個模型的任意兩層如何呈現語言資訊。我們將此方法應用於 BERT、GPT-2 和 Mamba。與先前的模型不同，MLEM 透過找出對相似性和差異性負責任的特定語言特徵，提供透明的比較。更普遍來說，此方法使用正式的、象徵性的領域說明，並使用這些說明來比較神經表徵。因此，此方法可以很直接地擴展到其他領域，例如語音和視覺，以及其他神經系統，包括人腦。", "author": "Jeanne Salle et.al.", "authors": "Jeanne Salle, Louis Jalouzot, Nur Lan, Emmanuel Chemla, Yair Lakretz", "id": "2406.12620v1", "paper_url": "http://arxiv.org/abs/2406.12620v1", "repo": "null"}}