{"2411.14103": {"publish_time": "2024-11-21", "title": "Lost in Inference: Rediscovering the Role of Natural Language Inference for Large Language Models", "paper_summary": "In the recent past, a popular way of evaluating natural language\nunderstanding (NLU), was to consider a model's ability to perform natural\nlanguage inference (NLI) tasks. In this paper, we investigate if NLI tasks,\nthat are rarely used for LLM evaluation, can still be informative for\nevaluating LLMs. Focusing on five different NLI benchmarks across six models of\ndifferent scales, we investigate if they are able to discriminate models of\ndifferent size and quality and how their accuracies develop during training.\nFurthermore, we investigate the extent to which the softmax distributions of\nmodels align with human distributions in cases where statements are ambiguous\nor vague. Overall, our results paint a positive picture for the NLI tasks: we\nfind that they are able to discriminate well between models at various stages\nof training, yet are not (all) saturated. Furthermore, we find that while the\nsimilarity of model distributions with human label distributions increases with\nscale, it is still much higher than the similarity between two populations of\nhumans, making it a potentially interesting statistic to consider.", "paper_summary_zh": "在不久的過去，評估自然語言理解 (NLU) 的一種流行方式，是考慮模型執行自然語言推理 (NLI) 任務的能力。在本文中，我們探討了很少用於 LLM 評估的 NLI 任務，是否仍能為評估 LLM 提供資訊。我們專注於六個不同規模模型中的五個不同的 NLI 基準，探討它們是否能夠區分不同大小和品質的模型，以及它們的準確度如何在訓練過程中發展。此外，我們探討了在語句模稜兩可或含糊不清的情況下，模型的 softmax 分布與人類分布一致的程度。總的來說，我們的結果為 NLI 任務描繪了一幅正面的圖像：我們發現它們能夠很好地區分訓練不同階段的模型，但並未（全部）飽和。此外，我們發現雖然模型分布與人類標籤分布的相似性隨著規模而增加，但它仍然遠高於兩個人群之間的相似性，這使其成為一個值得考慮的潛在有趣統計數據。", "author": "Lovish Madaan et.al.", "authors": "Lovish Madaan, David Esiobu, Pontus Stenetorp, Barbara Plank, Dieuwke Hupkes", "id": "2411.14103v1", "paper_url": "http://arxiv.org/abs/2411.14103v1", "repo": "null"}}