{"2502.15401": {"publish_time": "2025-02-21", "title": "Problem-Solving Logic Guided Curriculum In-Context Learning for LLMs Complex Reasoning", "paper_summary": "In-context learning (ICL) can significantly enhance the complex reasoning\ncapabilities of large language models (LLMs), with the key lying in the\nselection and ordering of demonstration examples. Previous methods typically\nrelied on simple features to measure the relevance between examples. We argue\nthat these features are not sufficient to reflect the intrinsic connections\nbetween examples. In this study, we propose a curriculum ICL strategy guided by\nproblem-solving logic. We select demonstration examples by analyzing the\nproblem-solving logic and order them based on curriculum learning.\nSpecifically, we constructed a problem-solving logic instruction set based on\nthe BREAK dataset and fine-tuned a language model to analyze the\nproblem-solving logic of examples. Subsequently, we selected appropriate\ndemonstration examples based on problem-solving logic and assessed their\ndifficulty according to the number of problem-solving steps. In accordance with\nthe principles of curriculum learning, we ordered the examples from easy to\nhard to serve as contextual prompts. Experimental results on multiple\nbenchmarks indicate that our method outperforms previous ICL approaches in\nterms of performance and efficiency, effectively enhancing the complex\nreasoning capabilities of LLMs. Our project will be publicly available\nsubsequently.", "paper_summary_zh": "情境式學習 (ICL) 可以顯著增強大型語言模型 (LLM) 的複雜推理能力，關鍵在於示範範例的選擇和排序。以往的方法通常依賴於簡單的特徵來衡量範例之間的關聯性。我們認為這些特徵不足以反映範例之間的內在聯繫。在本研究中，我們提出了一個由問題解決邏輯引導的課程 ICL 策略。我們透過分析問題解決邏輯來選擇示範範例，並根據課程學習對其進行排序。具體來說，我們根據 BREAK 資料集構建了一個問題解決邏輯指令集，並微調語言模型來分析範例的問題解決邏輯。隨後，我們根據問題解決邏輯選擇適當的示範範例，並根據問題解決步驟的數量評估其難度。根據課程學習的原則，我們將範例從易到難排序，作為情境提示。在多個基準上的實驗結果表明，我們的模型在效能和效率方面優於以往的 ICL 方法，有效增強了 LLM 的複雜推理能力。我們的專案將在稍後公開。", "author": "Xuetao Ma et.al.", "authors": "Xuetao Ma, Wenbin Jiang, Hua Huang", "id": "2502.15401v1", "paper_url": "http://arxiv.org/abs/2502.15401v1", "repo": "null"}}