{"2409.12437": {"publish_time": "2024-09-19", "title": "Enhancing Logical Reasoning in Large Language Models through Graph-based Synthetic Data", "paper_summary": "Despite recent advances in training and prompting strategies for Large\nLanguage Models (LLMs), these models continue to face challenges with complex\nlogical reasoning tasks that involve long reasoning chains. In this work, we\nexplore the potential and limitations of using graph-based synthetic reasoning\ndata as training signals to enhance LLMs' reasoning capabilities. Our extensive\nexperiments, conducted on two established natural language reasoning tasks --\ninductive reasoning and spatial reasoning -- demonstrate that supervised\nfine-tuning (SFT) with synthetic graph-based reasoning data effectively\nenhances LLMs' reasoning performance without compromising their effectiveness\non other standard evaluation benchmarks.", "paper_summary_zh": "儘管在大型語言模型 (LLM) 的訓練和提示策略方面有近期的進展，這些模型在涉及長推理鏈的複雜邏輯推理任務中仍面臨挑戰。在這項工作中，我們探討了使用基於圖形的合成推理數據作為訓練訊號以增強 LLM 推理能力的潛力和限制。我們在兩個既定的自然語言推理任務（歸納推理和空間推理）上進行了廣泛的實驗，證明了使用基於圖形的合成推理數據進行監督微調 (SFT) 有效地增強了 LLM 的推理性能，而不會損害其在其他標準評估基準上的效能。", "author": "Jiaming Zhou et.al.", "authors": "Jiaming Zhou, Abbas Ghaddar, Ge Zhang, Liheng Ma, Yaochen Hu, Soumyasundar Pal, Mark Coates, Bin Wang, Yingxue Zhang, Jianye Hao", "id": "2409.12437v1", "paper_url": "http://arxiv.org/abs/2409.12437v1", "repo": "https://github.com/riddickzhou/llm-graph-synthetic-reasoning"}}