{"2410.02675": {"publish_time": "2024-10-03", "title": "FAN: Fourier Analysis Networks", "paper_summary": "Despite the remarkable success achieved by neural networks, particularly\nthose represented by MLP and Transformer, we reveal that they exhibit potential\nflaws in the modeling and reasoning of periodicity, i.e., they tend to memorize\nthe periodic data rather than genuinely understanding the underlying principles\nof periodicity. However, periodicity is a crucial trait in various forms of\nreasoning and generalization, underpinning predictability across natural and\nengineered systems through recurring patterns in observations. In this paper,\nwe propose FAN, a novel network architecture based on Fourier Analysis, which\nempowers the ability to efficiently model and reason about periodic phenomena.\nBy introducing Fourier Series, the periodicity is naturally integrated into the\nstructure and computational processes of the neural network, thus achieving a\nmore accurate expression and prediction of periodic patterns. As a promising\nsubstitute to multi-layer perceptron (MLP), FAN can seamlessly replace MLP in\nvarious models with fewer parameters and FLOPs. Through extensive experiments,\nwe demonstrate the effectiveness of FAN in modeling and reasoning about\nperiodic functions, and the superiority and generalizability of FAN across a\nrange of real-world tasks, including symbolic formula representation, time\nseries forecasting, and language modeling.", "paper_summary_zh": "儘管神經網路取得了顯著的成功，尤其是 MLP 和 Transformer 所代表的神經網路，我們發現它們在週期性的建模和推理中表現出潛在的缺陷，也就是說，它們傾向於記憶週期性資料，而不是真正理解週期性的基本原理。然而，週期性是各種推理和概括中的一項關鍵特徵，它通過觀察中的重複模式支撐著自然和工程系統中的可預測性。在本文中，我們提出了 FAN，一種基於傅立葉分析的新網路架構，它賦予了有效建模和推理週期現象的能力。透過引入傅立葉級數，週期性自然地整合到神經網路的結構和計算過程中，從而更準確地表達和預測週期性模式。作為多層感知器 (MLP) 的有希望的替代品，FAN 可以無縫地取代各種模型中的 MLP，而參數和 FLOP 更少。透過廣泛的實驗，我們證明了 FAN 在週期性函數建模和推理方面的有效性，以及 FAN 在各種實際任務中的優越性和概括性，包括符號公式表示、時間序列預測和語言建模。", "author": "Yihong Dong et.al.", "authors": "Yihong Dong, Ge Li, Yongding Tao, Xue Jiang, Kechi Zhang, Jia Li, Jing Su, Jun Zhang, Jingjing Xu", "id": "2410.02675v1", "paper_url": "http://arxiv.org/abs/2410.02675v1", "repo": "null"}}