{"2408.04691": {"publish_time": "2024-08-08", "title": "Improving Relational Database Interactions with Large Language Models: Column Descriptions and Their Impact on Text-to-SQL Performance", "paper_summary": "Relational databases often suffer from uninformative descriptors of table\ncontents, such as ambiguous columns and hard-to-interpret values, impacting\nboth human users and Text-to-SQL models. This paper explores the use of large\nlanguage models (LLMs) to generate informative column descriptions as a\nsemantic layer for relational databases. Using the BIRD-Bench development set,\nwe created \\textsc{ColSQL}, a dataset with gold-standard column descriptions\ngenerated and refined by LLMs and human annotators. We evaluated several\ninstruction-tuned models, finding that GPT-4o and Command R+ excelled in\ngenerating high-quality descriptions. Additionally, we applied an\nLLM-as-a-judge to evaluate model performance. Although this method does not\nalign well with human evaluations, we included it to explore its potential and\nto identify areas for improvement. More work is needed to improve the\nreliability of automatic evaluations for this task. We also find that detailed\ncolumn descriptions significantly improve Text-to-SQL execution accuracy,\nespecially when columns are uninformative. This study establishes LLMs as\neffective tools for generating detailed metadata, enhancing the usability of\nrelational databases.", "paper_summary_zh": "<paragraph>關聯資料庫通常會因為表格內容的描述性不足而受害，例如模稜兩可的欄位和難以解讀的值，會影響人類使用者和文字轉 SQL 模型。本文探討使用大型語言模型 (LLM) 來產生資料欄位的描述性資訊，作為關聯資料庫的語意層。我們使用 BIRD-Bench 開發設定，建立了 \\textsc{ColSQL}，一個由 LLM 和人類註解者產生並優化的黃金標準欄位描述資料集。我們評估了數個經過指令微調的模型，發現 GPT-4o 和 Command R+ 在產生高品質描述方面表現優異。此外，我們應用 LLM 作為評審者來評估模型效能。雖然這個方法與人類評估不一致，但我們還是納入它來探討其潛力並找出需要改進的地方。需要更多工作來提升這個任務的自動評估的可靠性。我們也發現詳細的欄位描述會顯著提升文字轉 SQL 執行精確度，特別是在欄位描述性不足時。這項研究確立了 LLM 作為產生詳細元資料的有效工具，增強了關聯資料庫的可用性。</paragraph>", "author": "Niklas Wretblad et.al.", "authors": "Niklas Wretblad, Oskar Holmström, Erik Larsson, Axel Wiksäter, Oscar Söderlund, Hjalmar Öhman, Ture Pontén, Martin Forsberg, Martin Sörme, Fredrik Heintz", "id": "2408.04691v1", "paper_url": "http://arxiv.org/abs/2408.04691v1", "repo": "null"}}