{"2412.05130": {"publish_time": "2024-12-06", "title": "Technology as uncharted territory: Contextual integrity and the notion of AI as new ethical ground", "paper_summary": "Recent research illustrates how AI can be developed and deployed in a manner\ndetached from the concrete social context of application. By abstracting from\nthe contexts of AI application, practitioners also disengage from the distinct\nnormative structures that govern them. Building upon Helen Nissenbaum's\nframework of contextual integrity, I illustrate how disregard for contextual\nnorms can threaten the integrity of a context with often decisive ethical\nimplications. I argue that efforts to promote responsible and ethical AI can\ninadvertently contribute to and seemingly legitimize this disregard for\nestablished contextual norms. Echoing a persistent undercurrent in technology\nethics of understanding emerging technologies as uncharted moral territory,\ncertain approaches to AI ethics can promote a notion of AI as a novel and\ndistinct realm for ethical deliberation, norm setting, and virtue cultivation.\nThis narrative of AI as new ethical ground, however, can come at the expense of\npractitioners, policymakers and ethicists engaging with already established\nnorms and virtues that were gradually cultivated to promote successful and\nresponsible practice within concrete social contexts. In response, I question\nthe current narrow prioritization in AI ethics of moral innovation over moral\npreservation. Engaging also with emerging foundation models, I advocate for a\nmoderately conservative approach to the ethics of AI that prioritizes the\nresponsible and considered integration of AI within established social contexts\nand their respective normative structures.", "paper_summary_zh": "最近的研究说明了如何以脱离應用具體社會背景的方式開發和部署 AI。透過從 AI 應用的背景中抽象出來，從業人員也擺脫了規範它們的不同規範結構。建立在 Helen Nissenbaum 的脈絡完整性框架之上，我說明了對脈絡規範的不重視如何威脅到脈絡的完整性，並常常造成決定性的倫理影響。我主張，促進負責任和倫理 AI 的努力可能會無意間助長並看似使這種對既定脈絡規範的不重視合法化。呼應技術倫理中將新興技術理解為未探索道德領域的持續暗流，某些 AI 倫理方法可能會促進一種觀念，即 AI 是倫理審議、規範設定和美德培養的一個新穎且獨特的領域。然而，將 AI 視為新的倫理基礎的這種敘述可能會犧牲從業人員、政策制定者和倫理學家與既定規範和美德接觸的機會，而這些規範和美德是逐漸培養出來的，目的是在具體的社會背景中促進成功且負責任的實務。作為回應，我質疑 AI 倫理中目前對道德創新高於道德保存的狹隘優先順序。我也接觸新興基礎模型，主張採取適度保守的方法來處理 AI 倫理，這種方法將 AI 負責任且經過深思熟慮的整合作為優先考量，整合在既定的社會背景及其各自的規範結構中。", "author": "Alexander Martin Mussgnug et.al.", "authors": "Alexander Martin Mussgnug", "id": "2412.05130v1", "paper_url": "http://arxiv.org/abs/2412.05130v1", "repo": "null"}}