{"2412.06143": {"publish_time": "2024-12-09", "title": "Precise, Fast, and Low-cost Concept Erasure in Value Space: Orthogonal Complement Matters", "paper_summary": "The success of text-to-image generation enabled by diffuion models has\nimposed an urgent need to erase unwanted concepts, e.g., copyrighted,\noffensive, and unsafe ones, from the pre-trained models in a precise, timely,\nand low-cost manner. The twofold demand of concept erasure requires a precise\nremoval of the target concept during generation (i.e., erasure efficacy), while\na minimal impact on non-target content generation (i.e., prior preservation).\nExisting methods are either computationally costly or face challenges in\nmaintaining an effective balance between erasure efficacy and prior\npreservation. To improve, we propose a precise, fast, and low-cost concept\nerasure method, called Adaptive Vaule Decomposer (AdaVD), which is\ntraining-free. This method is grounded in a classical linear algebraic\northogonal complement operation, implemented in the value space of each\ncross-attention layer within the UNet of diffusion models. An effective shift\nfactor is designed to adaptively navigate the erasure strength, enhancing prior\npreservation without sacrificing erasure efficacy. Extensive experimental\nresults show that the proposed AdaVD is effective at both single and multiple\nconcept erasure, showing a 2- to 10-fold improvement in prior preservation as\ncompared to the second best, meanwhile achieving the best or near best erasure\nefficacy, when comparing with both training-based and training-free state of\nthe arts. AdaVD supports a series of diffusion models and downstream image\ngeneration tasks, the code is available on the project page:\nhttps://github.com/WYuan1001/AdaVD", "paper_summary_zh": "<paragraph>扩散模型所实现的文本到图像生成技术成功后，迫切需要以精确、及时且低成本的方式从预先训练的模型中消除不需要的概念，例如受版权保护、冒犯性和不安全的概念。概念消除的双重需求需要在生成过程中精确移除目标概念（即消除功效），同时对非目标内容生成（即先验保留）的影响最小。现有的方法要么计算成本高，要么在保持消除功效和先验保留之间的有效平衡方面面临挑战。为了改进，我们提出了一种精确、快速且低成本的概念消除方法，称为自适应值分解器 (AdaVD)，它无需训练。此方法基于经典线性代数正交补操作，在扩散模型的 UNet 中每个交叉注意层的值空间中实现。设计了一个有效的偏移因子来自适应地控制消除强度，在不牺牲消除功效的情况下增强先验保留。广泛的实验结果表明，所提出的 AdaVD 在单概念和多概念消除方面都非常有效，与第二好的方法相比，先验保留提高了 2 到 10 倍，同时在与基于训练和无训练的最新技术进行比较时，实现了最佳或接近最佳的消除效果。AdaVD 支持一系列扩散模型和下游图像生成任务，代码可在项目页面上获取：https://github.com/WYuan1001/AdaVD</paragraph>", "author": "Yuan Wang et.al.", "authors": "Yuan Wang, Ouxiang Li, Tingting Mu, Yanbin Hao, Kuien Liu, Xiang Wang, Xiangnan He", "id": "2412.06143v1", "paper_url": "http://arxiv.org/abs/2412.06143v1", "repo": "null"}}