{"2411.19733": {"publish_time": "2024-11-29", "title": "A Deep Learning Approach to Language-independent Gender Prediction on Twitter", "paper_summary": "This work presents a set of experiments conducted to predict the gender of\nTwitter users based on language-independent features extracted from the text of\nthe users' tweets. The experiments were performed on a version of TwiSty\ndataset including tweets written by the users of six different languages:\nPortuguese, French, Dutch, English, German, and Italian. Logistic regression\n(LR), and feed-forward neural networks (FFNN) with back-propagation were used\nto build models in two different settings: Inter-Lingual (IL) and Cross-Lingual\n(CL). In the IL setting, the training and testing were performed on the same\nlanguage whereas in the CL, Italian and German datasets were set aside and only\nused as test sets and the rest were combined to compose training and\ndevelopment sets. In the IL, the highest accuracy score belongs to LR whereas\nin the CL, FFNN with three hidden layers yields the highest score. The results\nshow that neural network based models underperform traditional models when the\nsize of the training set is small; however, they beat traditional models by a\nnon-trivial margin, when they are fed with large enough data. Finally, the\nfeature analysis confirms that men and women have different writing styles\nindependent of their language.", "paper_summary_zh": "本研究提出了一組實驗，用來預測 Twitter 使用者的性別，基礎是從使用者推文文字中萃取出的與語言無關的特徵。這些實驗是在 TwiSty 資料集的版本上執行，其中包含六種不同語言的使用者所寫的推文：葡萄牙語、法語、荷蘭語、英語、德語和義大利語。邏輯迴歸 (LR) 和帶反向傳播的饋送前向神經網路 (FFNN) 用於在兩種不同的設定中建立模型：語言間 (IL) 和跨語言 (CL)。在 IL 設定中，訓練和測試是在同一種語言上執行，而在 CL 中，義大利語和德語資料集被保留，僅用作測試集，而其餘的則合併用於組成訓練和開發集。在 IL 中，最高的準確度分數屬於 LR，而在 CL 中，具有三個隱藏層的 FFNN 產生最高分數。結果顯示，當訓練集較小時，基於神經網路的模型表現不如傳統模型；然而，當它們被輸入足夠大的資料時，它們會以非顯著的幅度超越傳統模型。最後，特徵分析證實，男性和女性有不同的寫作風格，與他們的語言無關。", "author": "Reyhaneh Hashempour et.al.", "authors": "Reyhaneh Hashempour, Barbara Plank, Aline Villavicencio, Renato Cordeiro de Amorim", "id": "2411.19733v1", "paper_url": "http://arxiv.org/abs/2411.19733v1", "repo": "null"}}