{"2502.06634": {"publish_time": "2025-02-10", "title": "Automatic Annotation Augmentation Boosts Translation between Molecules and Natural Language", "paper_summary": "Recent advancements in AI for biological research focus on integrating\nmolecular data with natural language to accelerate drug discovery. However, the\nscarcity of high-quality annotations limits progress in this area. This paper\nintroduces LA$^3$, a Language-based Automatic Annotation Augmentation framework\nthat leverages large language models to augment existing datasets, thereby\nimproving AI training. We demonstrate the effectiveness of LA$^3$ by creating\nan enhanced dataset, LaChEBI-20, where we systematically rewrite the\nannotations of molecules from an established dataset. These rewritten\nannotations preserve essential molecular information while providing more\nvaried sentence structures and vocabulary. Using LaChEBI-20, we train LaMolT5\nbased on a benchmark architecture to learn the mapping between molecular\nrepresentations and augmented annotations.\n  Experimental results on text-based *de novo* molecule generation and molecule\ncaptioning demonstrate that LaMolT5 outperforms state-of-the-art models.\nNotably, incorporating LA$^3$ leads to improvements of up to 301% over the\nbenchmark architecture. Furthermore, we validate the effectiveness of LA$^3$\nnotable applications in *image*, *text* and *graph* tasks, affirming its\nversatility and utility.", "paper_summary_zh": "<paragraph>人工智慧在生物研究上的最新進展，專注於將分子資料與自然語言整合，以加速藥物發現。然而，高品質註解的稀少限制了此領域的進展。這篇論文介紹了 LA$^3$，一個基於語言的自動註解擴充框架，它利用大型語言模型來擴充現有的資料集，進而改善人工智慧訓練。我們透過建立一個增強的資料集 LaChEBI-20 來展示 LA$^3$ 的有效性，我們系統性地改寫了一個既定資料集中分子的註解。這些改寫的註解保留了重要的分子資訊，同時提供了更多樣化的句子結構和詞彙。使用 LaChEBI-20，我們在基於基準架構上訓練 LaMolT5，以學習分子表示和擴充註解之間的對應。\n在基於文字的 *從頭開始* 分子生成和分子標題上的實驗結果表明，LaMolT5 優於最先進的模型。值得注意的是，納入 LA$^3$ 可讓基準架構的改進幅度高達 301%。此外，我們驗證了 LA$^3$ 在 *影像*、*文字* 和 *圖形* 任務中的有效性，肯定了它的多功能性和實用性。</paragraph>", "author": "Zhiqiang Zhong et.al.", "authors": "Zhiqiang Zhong, Simon Sataa-Yu Larsen, Haoyu Guo, Tao Tang, Kuangyu Zhou, Davide Mottin", "id": "2502.06634v1", "paper_url": "http://arxiv.org/abs/2502.06634v1", "repo": "null"}}