{"2410.21803": {"publish_time": "2024-10-29", "title": "SimSiam Naming Game: A Unified Approach for Representation Learning and Emergent Communication", "paper_summary": "Emergent communication, driven by generative models, enables agents to\ndevelop a shared language for describing their individual views of the same\nobjects through interactions. Meanwhile, self-supervised learning (SSL),\nparticularly SimSiam, uses discriminative representation learning to make\nrepresentations of augmented views of the same data point closer in the\nrepresentation space. Building on the prior work of VI-SimSiam, which\nincorporates a generative and Bayesian perspective into the SimSiam framework\nvia variational inference (VI) interpretation, we propose SimSiam+VAE, a\nunified approach for both representation learning and emergent communication.\nSimSiam+VAE integrates a variational autoencoder (VAE) into the predictor of\nthe SimSiam network to enhance representation learning and capture uncertainty.\nExperimental results show that SimSiam+VAE outperforms both SimSiam and\nVI-SimSiam. We further extend this model into a communication framework called\nthe SimSiam Naming Game (SSNG), which applies the generative and Bayesian\napproach based on VI to develop internal representations and emergent language,\nwhile utilizing the discriminative process of SimSiam to facilitate mutual\nunderstanding between agents. In experiments with established models, despite\nthe dynamic alternation of agent roles during interactions, SSNG demonstrates\ncomparable performance to the referential game and slightly outperforms the\nMetropolis-Hastings naming game.", "paper_summary_zh": "由生成模型驱动的紧急通信，使代理能够通过交互为描述其对同一对象的个人观点，开发一种共享语言。同时，自监督学习（SSL），特别是 SimSiam，使用判别式表征学习，使同一数据点的增强视图的表征在表征空间中更接近。基于 VI-SimSiam 的先前工作，它通过变分推理（VI）解释将生成式和贝叶斯观点纳入 SimSiam 框架，我们提出了 SimSiam+VAE，这是一种用于表征学习和紧急通信的统一方法。SimSiam+VAE 将变分自动编码器（VAE）集成到 SimSiam 网络的预测器中，以增强表征学习并捕捉不确定性。实验结果表明，SimSiam+VAE 优于 SimSiam 和 VI-SimSiam。我们进一步将此模型扩展到一个称为 SimSiam 命名游戏（SSNG）的通信框架中，它应用基于 VI 的生成式和贝叶斯方法来开发内部表征和紧急语言，同时利用 SimSiam 的判别过程来促进代理之间的相互理解。在使用已建立模型的实验中，尽管代理角色在交互过程中动态交替，但 SSNG 表现出与指称游戏相当的性能，并且略微优于 Metropolis-Hastings 命名游戏。", "author": "Nguyen Le Hoang et.al.", "authors": "Nguyen Le Hoang, Tadahiro Taniguchi, Fang Tianwei, Akira Taniguchi", "id": "2410.21803v1", "paper_url": "http://arxiv.org/abs/2410.21803v1", "repo": "null"}}