{"2411.05330": {"publish_time": "2024-11-08", "title": "Inversion-based Latent Bayesian Optimization", "paper_summary": "Latent Bayesian optimization (LBO) approaches have successfully adopted\nBayesian optimization over a continuous latent space by employing an\nencoder-decoder architecture to address the challenge of optimization in a high\ndimensional or discrete input space. LBO learns a surrogate model to\napproximate the black-box objective function in the latent space. However, we\nobserved that most LBO methods suffer from the `misalignment problem`, which is\ninduced by the reconstruction error of the encoder-decoder architecture. It\nhinders learning an accurate surrogate model and generating high-quality\nsolutions. In addition, several trust region-based LBO methods select the\nanchor, the center of the trust region, based solely on the objective function\nvalue without considering the trust region`s potential to enhance the\noptimization process. To address these issues, we propose Inversion-based\nLatent Bayesian Optimization (InvBO), a plug-and-play module for LBO. InvBO\nconsists of two components: an inversion method and a potential-aware trust\nregion anchor selection. The inversion method searches the latent code that\ncompletely reconstructs the given target data. The potential-aware trust region\nanchor selection considers the potential capability of the trust region for\nbetter local optimization. Experimental results demonstrate the effectiveness\nof InvBO on nine real-world benchmarks, such as molecule design and arithmetic\nexpression fitting tasks. Code is available at https://github.com/mlvlab/InvBO.", "paper_summary_zh": "潛在貝氏最佳化 (LBO) 方法已成功採用在連續潛在空間上的貝氏最佳化，透過採用編碼器-解碼器架構來解決在高維度或離散輸入空間中最佳化的挑戰。LBO 學習一個替代模型來近似潛在空間中的黑盒目標函數。然而，我們觀察到，大多數 LBO 方法都會遇到「未對齊問題」，這是由編碼器-解碼器架構的重建誤差所引發的。它會阻礙學習準確的替代模型和產生高品質的解。此外，許多基於信任區域的 LBO 方法會根據目標函數值來選擇錨點（信任區域的中心），而不會考慮信任區域增強最佳化程序的潛力。為了解決這些問題，我們提出基於反演的潛在貝氏最佳化 (InvBO)，一個 LBO 的即插即用模組。InvBO 包含兩個元件：反演方法和具潛力感知的信任區域錨點選擇。反演方法會搜尋完全重建給定目標資料的潛在代碼。具潛力感知的信任區域錨點選擇會考慮信任區域的潛在能力，以進行更好的局部最佳化。實驗結果顯示 InvBO 在九個真實世界的基準上的有效性，例如分子設計和算術表達式擬合任務。程式碼可在 https://github.com/mlvlab/InvBO 取得。", "author": "Jaewon Chu et.al.", "authors": "Jaewon Chu, Jinyoung Park, Seunghun Lee, Hyunwoo J. Kim", "id": "2411.05330v1", "paper_url": "http://arxiv.org/abs/2411.05330v1", "repo": "https://github.com/mlvlab/invbo"}}