{"2409.16710": {"publish_time": "2024-09-25", "title": "Beyond Turing Test: Can GPT-4 Sway Experts' Decisions?", "paper_summary": "In the post-Turing era, evaluating large language models (LLMs) involves\nassessing generated text based on readers' reactions rather than merely its\nindistinguishability from human-produced content. This paper explores how\nLLM-generated text impacts readers' decisions, focusing on both amateur and\nexpert audiences. Our findings indicate that GPT-4 can generate persuasive\nanalyses affecting the decisions of both amateurs and professionals.\nFurthermore, we evaluate the generated text from the aspects of grammar,\nconvincingness, logical coherence, and usefulness. The results highlight a high\ncorrelation between real-world evaluation through audience reactions and the\ncurrent multi-dimensional evaluators commonly used for generative models.\nOverall, this paper shows the potential and risk of using generated text to\nsway human decisions and also points out a new direction for evaluating\ngenerated text, i.e., leveraging the reactions and decisions of readers. We\nrelease our dataset to assist future research.", "paper_summary_zh": "在後圖靈時代，評估大型語言模型 (LLM) 涉及\n根據讀者的反應評估產生的文字，而不是僅僅根據其與人類產生的內容是否難以區分。本文探討\nLLM 生成的文字如何影響讀者的決策，同時關注業餘和\n專業受眾。我們的研究結果表明，GPT-4 可以產生影響業餘人士和專業人士決策的有說服力的分析。\n此外，我們從語法、\n說服力、邏輯連貫性和有用性方面評估產生的文字。結果強調了通過受眾反應進行的真實世界評估與\n當前通常用於生成模型的多維評估器之間的高度相關性。\n總的來說，本文展示了使用生成的文字來影響人類決策的潛力和風險，並指出了評估\n生成文本的新方向，即利用讀者的反應和決策。我們發布我們的數據集以協助未來的研究。", "author": "Takehiro Takayanagi et.al.", "authors": "Takehiro Takayanagi, Hiroya Takamura, Kiyoshi Izumi, Chung-Chi Chen", "id": "2409.16710v1", "paper_url": "http://arxiv.org/abs/2409.16710v1", "repo": "null"}}