{"2410.11526": {"publish_time": "2024-10-15", "title": "Human-LLM Collaborative Construction of a Cantonese Emotion Lexicon", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities in\nlanguage understanding and generation. Advanced utilization of the knowledge\nembedded in LLMs for automated annotation has consistently been explored. This\nstudy proposed to develop an emotion lexicon for Cantonese, a low-resource\nlanguage, through collaborative efforts between LLM and human annotators. By\nintegrating emotion labels provided by LLM and human annotators, the study\nleveraged existing linguistic resources including lexicons in other languages\nand local forums to construct a Cantonese emotion lexicon enriched with\ncolloquial expressions. The consistency of the proposed emotion lexicon in\nemotion extraction was assessed through modification and utilization of three\ndistinct emotion text datasets. This study not only validates the efficacy of\nthe constructed lexicon but also emphasizes that collaborative annotation\nbetween human and artificial intelligence can significantly enhance the quality\nof emotion labels, highlighting the potential of such partnerships in\nfacilitating natural language processing tasks for low-resource languages.", "paper_summary_zh": "大型語言模型 (LLM) 在語言理解和生成方面展現了卓越的能力。持續探索如何進階利用 LLM 中嵌入的知識進行自動化註解。本研究提議透過 LLM 和人類註解員的協作，為廣東話（一種低資源語言）開發一個情感詞彙。透過整合 LLM 和人類註解員提供的語意標籤，本研究利用現有的語言資源（包括其他語言的詞彙和本地論壇）來建構一個豐富的廣東話情感詞彙，其中包含了口語表達。透過修改和使用三個不同的情感文本資料集，評估了所提出的情感詞彙在情感抽取中的一致性。本研究不僅驗證了所建構詞彙的效能，也強調了人類與人工智慧之間的協作註解可以顯著提升情感標籤的品質，突顯了此類夥伴關係在促進低資源語言的自然語言處理任務方面的潛力。", "author": "Yusong Zhang et.al.", "authors": "Yusong Zhang, Dong Dong, Chi-tim Hung, Leonard Heyerdahl, Tamara Giles-Vernick, Eng-kiong Yeoh", "id": "2410.11526v1", "paper_url": "http://arxiv.org/abs/2410.11526v1", "repo": "null"}}