{"2412.19102": {"publish_time": "2024-12-26", "title": "\"I've Heard of You!\": Generate Spoken Named Entity Recognition Data for Unseen Entities", "paper_summary": "Spoken named entity recognition (NER) aims to identify named entities from\nspeech, playing an important role in speech processing. New named entities\nappear every day, however, annotating their Spoken NER data is costly. In this\npaper, we demonstrate that existing Spoken NER systems perform poorly when\ndealing with previously unseen named entities. To tackle this challenge, we\npropose a method for generating Spoken NER data based on a named entity\ndictionary (NED) to reduce costs. Specifically, we first use a large language\nmodel (LLM) to generate sentences from the sampled named entities and then use\na text-to-speech (TTS) system to generate the speech. Furthermore, we introduce\na noise metric to filter out noisy data. To evaluate our approach, we release a\nnovel Spoken NER benchmark along with a corresponding NED containing 8,853\nentities. Experiment results show that our method achieves state-of-the-art\n(SOTA) performance in the in-domain, zero-shot domain adaptation, and fully\nzero-shot settings. Our data will be available at\nhttps://github.com/DeepLearnXMU/HeardU.", "paper_summary_zh": "口語化命名實體識別 (NER) 旨在從語音中識別命名實體，在語音處理中扮演重要角色。每天都會出現新的命名實體，然而對其口語化 NER 資料進行註解的成本很高。在本文中，我們證明現有的口語化 NER 系統在處理以前未見過的命名實體時表現不佳。為了應對這個挑戰，我們提出了一種基於命名實體字典 (NED) 來產生口語化 NER 資料的方法，以降低成本。具體來說，我們首先使用大型語言模型 (LLM) 從取樣的命名實體中產生句子，然後使用文字轉語音 (TTS) 系統產生語音。此外，我們引入了一個雜訊指標來過濾雜訊資料。為了評估我們的做法，我們發布了一個新的口語化 NER 基準，以及一個包含 8,853 個實體的對應 NED。實驗結果表明，我們的做法在特定領域、零次學習領域適應和完全零次學習設定中實現了最先進 (SOTA) 的效能。我們的資料將在 https://github.com/DeepLearnXMU/HeardU 上提供。", "author": "Jiawei Yu et.al.", "authors": "Jiawei Yu, Xiang Geng, Yuang Li, Mengxin Ren, Wei Tang, Jiahuan Li, Zhibin Lan, Min Zhang, Hao Yang, Shujian Huang, Jinsong Su", "id": "2412.19102v1", "paper_url": "http://arxiv.org/abs/2412.19102v1", "repo": "null"}}