{"2411.16251": {"publish_time": "2024-11-25", "title": "Transparent Neighborhood Approximation for Text Classifier Explanation", "paper_summary": "Recent literature highlights the critical role of neighborhood construction\nin deriving model-agnostic explanations, with a growing trend toward deploying\ngenerative models to improve synthetic instance quality, especially for\nexplaining text classifiers. These approaches overcome the challenges in\nneighborhood construction posed by the unstructured nature of texts, thereby\nimproving the quality of explanations. However, the deployed generators are\nusually implemented via neural networks and lack inherent explainability,\nsparking arguments over the transparency of the explanation process itself. To\naddress this limitation while preserving neighborhood quality, this paper\nintroduces a probability-based editing method as an alternative to black-box\ntext generators. This approach generates neighboring texts by implementing\nmanipulations based on in-text contexts. Substituting the generator-based\nconstruction process with recursive probability-based editing, the resultant\nexplanation method, XPROB (explainer with probability-based editing), exhibits\ncompetitive performance according to the evaluation conducted on two real-world\ndatasets. Additionally, XPROB's fully transparent and more controllable\nconstruction process leads to superior stability compared to the\ngenerator-based explainers.", "paper_summary_zh": "近期的文獻強調了鄰域建構在推導與模型無關的解釋中所扮演的重要角色，並朝著部署生成模型以改善合成實例品質的方向發展，特別是針對解釋文字分類器。這些方法克服了文字非結構化性質在鄰域建構中產生的挑戰，進而提升了解釋的品質。然而，所部署的生成器通常透過神經網路實作，且缺乏內在的可解釋性，引發了對於解釋過程本身透明度的爭論。為了在維持鄰域品質的同時解決此限制，本文引入了基於機率的編輯方法，作為黑箱文字生成器的替代方案。此方法透過實作基於文字內文脈的操控來產生鄰近文字。透過以遞迴的基於機率的編輯取代基於生成器的建構過程，所產生的解釋方法 XPROB（基於機率編輯的解釋器）在針對兩個真實世界資料集進行的評估中展現了具有競爭力的效能。此外，與基於生成器的解釋器相比，XPROB 完全透明且更可控的建構過程，帶來了優異的穩定性。", "author": "Yi Cai et.al.", "authors": "Yi Cai, Arthur Zimek, Eirini Ntoutsi, Gerhard Wunder", "id": "2411.16251v1", "paper_url": "http://arxiv.org/abs/2411.16251v1", "repo": "null"}}