{"2410.04133": {"publish_time": "2024-10-05", "title": "From Hospital to Portables: A Universal ECG Foundation Model Built on 10+ Million Diverse Recordings", "paper_summary": "Artificial Intelligence (AI) has shown great promise in electrocardiogram\n(ECG) analysis and cardiovascular disease detection. However, developing a\ngeneral AI-ECG model has been challenging due to inter-individual variability\nand the diversity of ECG diagnoses, limiting existing models to specific\ndiagnostic tasks and datasets. Moreover, current AI-ECG models struggle to\nachieve comparable performance between single-lead and 12-lead ECGs, limiting\nthe application of AI-ECG to portable and wearable ECG devices. To address\nthese limitations, we introduce an ECG Foundation Model (ECGFounder), a\ngeneral-purpose model that leverages real-world ECG annotations from cardiology\nexperts to broaden the diagnostic capabilities of ECG analysis. ECGFounder is\ntrained on over 10 million ECGs with 150 label categories from the\nHarvard-Emory ECG Database, enabling comprehensive cardiovascular disease\ndiagnosis through ECG analysis. The model is designed to be both effective\nout-of-the-box and fine-tunable for downstream tasks, maximizing usability.\nMore importantly, we extend its application to single-lead ECGs, enabling\ncomplex condition diagnoses and supporting various downstream tasks in mobile\nand remote monitoring scenarios. Experimental results demonstrate that\nECGFounder achieves expert-level performance on internal validation sets for\nboth 12-lead and single-lead ECGs, while also exhibiting strong classification\nperformance and generalization across various diagnoses on external validation\nsets. When fine-tuned, ECGFounder outperforms baseline models in demographics\ndetection, clinical event detection, and cross-modality cardiac rhythm\ndiagnosis. The trained model and data will be publicly released upon\npublication through the bdsp.io. Our code is available at\nhttps://github.com/bdsp-core/ECGFounder.", "paper_summary_zh": "人工智慧（AI）在心電圖（ECG）分析和心血管疾病檢測方面已展現極佳的前景。然而，由於個體間變異性和 ECG 診斷的多樣性，開發通用 AI-ECG 模型一直是一項挑戰，這限制了現有模型只能用於特定的診斷任務和資料集。此外，目前的 AI-ECG 模型難以在單導程和 12 導程 ECG 之間取得相當的效能，這限制了 AI-ECG 應用於可攜式和可穿戴 ECG 裝置。為了克服這些限制，我們引進了一種 ECG 基礎模型（ECGFounder），這是一種通用模型，它利用來自心臟病專家的真實世界 ECG 標註，以擴展 ECG 分析的診斷能力。ECGFounder 經由哈佛-艾默里 ECG 資料庫中超過 1 千萬個 ECG 和 150 個標籤類別進行訓練，能透過 ECG 分析進行全面的心血管疾病診斷。該模型被設計為開箱即用且可微調以進行下游任務，以最大化可用性。更重要的是，我們將其應用延伸至單導程 ECG，能進行複雜狀況診斷，並支援行動和遠端監控情境中的各種下游任務。實驗結果顯示，ECGFounder 在 12 導程和單導程 ECG 的內部驗證集中達到了專家級的效能，同時在外部驗證集中對各種診斷也展現出強大的分類效能和泛化能力。經過微調後，ECGFounder 在人口統計資料檢測、臨床事件檢測和跨模態心律診斷方面優於基準模型。訓練好的模型和資料將在出版後透過 bdsp.io 公開發布。我們的程式碼可在 https://github.com/bdsp-core/ECGFounder 取得。", "author": "Jun Li et.al.", "authors": "Jun Li, Aaron Aguirre, Junior Moura, Che Liu, Lanhai Zhong, Chenxi Sun, Gari Clifford, Brandon Westover, Shenda Hong", "id": "2410.04133v1", "paper_url": "http://arxiv.org/abs/2410.04133v1", "repo": "null"}}