{"2503.10635": {"publish_time": "2025-03-13", "title": "A Frustratingly Simple Yet Highly Effective Attack Baseline: Over 90% Success Rate Against the Strong Black-box Models of GPT-4.5/4o/o1", "paper_summary": "Despite promising performance on open-source large vision-language models\n(LVLMs), transfer-based targeted attacks often fail against black-box\ncommercial LVLMs. Analyzing failed adversarial perturbations reveals that the\nlearned perturbations typically originate from a uniform distribution and lack\nclear semantic details, resulting in unintended responses. This critical\nabsence of semantic information leads commercial LVLMs to either ignore the\nperturbation entirely or misinterpret its embedded semantics, thereby causing\nthe attack to fail. To overcome these issues, we notice that identifying core\nsemantic objects is a key objective for models trained with various datasets\nand methodologies. This insight motivates our approach that refines semantic\nclarity by encoding explicit semantic details within local regions, thus\nensuring interoperability and capturing finer-grained features, and by\nconcentrating modifications on semantically rich areas rather than applying\nthem uniformly. To achieve this, we propose a simple yet highly effective\nsolution: at each optimization step, the adversarial image is cropped randomly\nby a controlled aspect ratio and scale, resized, and then aligned with the\ntarget image in the embedding space. Experimental results confirm our\nhypothesis. Our adversarial examples crafted with local-aggregated\nperturbations focused on crucial regions exhibit surprisingly good\ntransferability to commercial LVLMs, including GPT-4.5, GPT-4o,\nGemini-2.0-flash, Claude-3.5-sonnet, Claude-3.7-sonnet, and even reasoning\nmodels like o1, Claude-3.7-thinking and Gemini-2.0-flash-thinking. Our approach\nachieves success rates exceeding 90% on GPT-4.5, 4o, and o1, significantly\noutperforming all prior state-of-the-art attack methods. Our optimized\nadversarial examples under different configurations and training code are\navailable at https://github.com/VILA-Lab/M-Attack.", "paper_summary_zh": "<paragraph>儘管在開源大型視覺語言模型 (LVLMs) 上表現出色，基於遷移的目標攻擊通常對黑箱商業 LVLMs 無效。分析失敗的對抗性擾動發現，學習到的擾動通常來自均勻分佈，缺乏清晰的語義細節，導致意外的響應。這種語義信息的嚴重缺失導致商業 LVLMs 要麼完全忽略擾動，要麼誤解其嵌入的語義，從而導致攻擊失敗。為了克服這些問題，我們注意到識別核心語義對象是使用各種數據集和方法訓練模型的關鍵目標。這種見解促使我們採用一種方法，通過在局部區域內編碼明確的語義細節來提高語義清晰度，從而確保互操作性和捕獲更細粒度的特徵，並將修改集中在語義豐富的區域，而不是均勻應用。為此，我們提出了一個簡單但高效的解決方案：在每個優化步驟中，對抗性圖像會以受控的縱橫比和比例隨機裁剪，調整大小，然後在嵌入空間中與目標圖像對齊。實驗結果證實了我們的假設。我們用局部聚合擾動精心製作的對抗性示例，集中在關鍵區域，對商業 LVLMs 表現出驚人的良好遷移性，包括 GPT-4.5、GPT-4o、Gemini-2.0-flash、Claude-3.5-sonnet、Claude-3.7-sonnet，甚至推理模型，如 o1、Claude-3.7-thinking 和 Gemini-2.0-flash-thinking。我們的方法在 GPT-4.5、4o 和 o1 上的成功率超過 90%，顯著優於所有先前最先進的攻擊方法。我們在不同配置下優化的對抗性示例和訓練代碼可在 https://github.com/VILA-Lab/M-Attack 獲取。</paragraph>\n", "author": "Zhaoyi Li et.al.", "authors": "Zhaoyi Li, Xiaohan Zhao, Dong-Dong Wu, Jiacheng Cui, Zhiqiang Shen", "id": "2503.10635v1", "paper_url": "http://arxiv.org/abs/2503.10635v1", "repo": "null"}}