{"2406.04752": {"publish_time": "2024-06-07", "title": "CRiskEval: A Chinese Multi-Level Risk Evaluation Benchmark Dataset for Large Language Models", "paper_summary": "Large language models (LLMs) are possessed of numerous beneficial\ncapabilities, yet their potential inclination harbors unpredictable risks that\nmay materialize in the future. We hence propose CRiskEval, a Chinese dataset\nmeticulously designed for gauging the risk proclivities inherent in LLMs such\nas resource acquisition and malicious coordination, as part of efforts for\nproactive preparedness. To curate CRiskEval, we define a new risk taxonomy with\n7 types of frontier risks and 4 safety levels, including extremely\nhazardous,moderately hazardous, neutral and safe. We follow the philosophy of\ntendency evaluation to empirically measure the stated desire of LLMs via\nfine-grained multiple-choice question answering. The dataset consists of 14,888\nquestions that simulate scenarios related to predefined 7 types of frontier\nrisks. Each question is accompanied with 4 answer choices that state opinions\nor behavioral tendencies corresponding to the question. All answer choices are\nmanually annotated with one of the defined risk levels so that we can easily\nbuild a fine-grained frontier risk profile for each assessed LLM. Extensive\nevaluation with CRiskEval on a spectrum of prevalent Chinese LLMs has unveiled\na striking revelation: most models exhibit risk tendencies of more than 40%\n(weighted tendency to the four risk levels). Furthermore, a subtle increase in\nthe model's inclination toward urgent self-sustainability, power seeking and\nother dangerous goals becomes evident as the size of models increase. To\npromote further research on the frontier risk evaluation of LLMs, we publicly\nrelease our dataset at https://github.com/lingshi6565/Risk_eval.", "paper_summary_zh": "大型語言模型 (LLM) 擁有許多有益的功能，但其潛在傾向卻隱藏著難以預測的風險，這些風險可能會在未來實現。因此，我們提出了 CRiskEval，這是一個精心設計的中文資料集，用於評量 LLM 中固有的風險傾向，例如資源獲取和惡意協調，作為積極準備工作的一部分。為了策劃 CRiskEval，我們定義了一個新的風險分類法，其中包含 7 種類型的邊緣風險和 4 個安全級別，包括極度危險、中度危險、中立和安全。我們遵循傾向評估的理念，通過細粒度的多選題回答來實證測量 LLM 的既定願望。該資料集包含 14,888 個問題，模擬與預定義的 7 種類型邊緣風險相關的情境。每個問題都附有 4 個答案選項，這些選項陳述了與問題相應的意見或行為傾向。所有答案選項都經過人工註解，並標示為已定義風險級別之一，以便我們可以輕鬆為每個評估的 LLM 建立細粒度的邊緣風險概況。在各種流行的中文 LLM 上使用 CRiskEval 進行廣泛評估後，揭示了一個驚人的發現：大多數模型表現出超過 40% 的風險傾向（對四個風險級別的加權傾向）。此外，隨著模型規模的增加，模型傾向於緊急自我維持、尋求權力和其他危險目標的趨勢會變得明顯。為了促進對 LLM 邊緣風險評估的進一步研究，我們在 https://github.com/lingshi6565/Risk_eval 上公開發布我們的資料集。", "author": "Ling Shi et.al.", "authors": "Ling Shi, Deyi Xiong", "id": "2406.04752v1", "paper_url": "http://arxiv.org/abs/2406.04752v1", "repo": "null"}}