{"2503.13441": {"publish_time": "2025-03-17", "title": "Humanoid Policy ~ Human Policy", "paper_summary": "Training manipulation policies for humanoid robots with diverse data enhances\ntheir robustness and generalization across tasks and platforms. However,\nlearning solely from robot demonstrations is labor-intensive, requiring\nexpensive tele-operated data collection which is difficult to scale. This paper\ninvestigates a more scalable data source, egocentric human demonstrations, to\nserve as cross-embodiment training data for robot learning. We mitigate the\nembodiment gap between humanoids and humans from both the data and modeling\nperspectives. We collect an egocentric task-oriented dataset (PH2D) that is\ndirectly aligned with humanoid manipulation demonstrations. We then train a\nhuman-humanoid behavior policy, which we term Human Action Transformer (HAT).\nThe state-action space of HAT is unified for both humans and humanoid robots\nand can be differentiably retargeted to robot actions. Co-trained with\nsmaller-scale robot data, HAT directly models humanoid robots and humans as\ndifferent embodiments without additional supervision. We show that human data\nimproves both generalization and robustness of HAT with significantly better\ndata collection efficiency. Code and data: https://human-as-robot.github.io/", "paper_summary_zh": "<paragraph>訓練具備多樣化數據的人形機器人操控策略，能增強其在不同任務和平台上的穩健性和泛化能力。然而，僅從機器人演示中學習非常耗費人力，需要昂貴的遠程操作數據採集，難以擴展規模。本文研究了一種更具擴展性的數據來源：以人為中心的演示數據，作為機器人學習的跨具身訓練數據。我們從數據和建模兩個角度來減輕人形機器人和人類之間的具身差異。我們收集了一個以任務為導向的以人為中心的數據集 (PH2D)，該數據集與人形機器人操控演示直接對齊。然後，我們訓練了一種人-人形機器人行為策略，我們稱之為人體動作轉換器 (HAT)。HAT 的狀態-動作空間對於人類和人形機器人都是統一的，並且可以以可微分的方式重新定位到機器人動作。通過與較小規模的機器人數據共同訓練，HAT 直接將人形機器人和人類建模為不同的具身，而無需額外的監督。我們證明，人類數據提高了 HAT 的泛化能力和穩健性，並顯著提高了數據採集效率。程式碼和數據：https://human-as-robot.github.io/</paragraph>\n", "author": "Ri-Zhao Qiu et.al.", "authors": "Ri-Zhao Qiu, Shiqi Yang, Xuxin Cheng, Chaitanya Chawla, Jialong Li, Tairan He, Ge Yan, Lars Paulsen, Ge Yang, Sha Yi, Guanya Shi, Xiaolong Wang", "id": "2503.13441v1", "paper_url": "http://arxiv.org/abs/2503.13441v1", "repo": "null"}}