{"2502.09870": {"publish_time": "2025-02-14", "title": "A Taxonomy of Linguistic Expressions That Contribute To Anthropomorphism of Language Technologies", "paper_summary": "Recent attention to anthropomorphism -- the attribution of human-like\nqualities to non-human objects or entities -- of language technologies like\nLLMs has sparked renewed discussions about potential negative impacts of\nanthropomorphism. To productively discuss the impacts of this anthropomorphism\nand in what contexts it is appropriate, we need a shared vocabulary for the\nvast variety of ways that language can be anthropomorphic. In this work, we\ndraw on existing literature and analyze empirical cases of user interactions\nwith language technologies to develop a taxonomy of textual expressions that\ncan contribute to anthropomorphism. We highlight challenges and tensions\ninvolved in understanding linguistic anthropomorphism, such as how all language\nis fundamentally human and how efforts to characterize and shift perceptions of\nhumanness in machines can also dehumanize certain humans. We discuss ways that\nour taxonomy supports more precise and effective discussions of and decisions\nabout anthropomorphism of language technologies.", "paper_summary_zh": "最近對擬人化的關注——將類人的品質歸因於非人類的物體或實體——例如 LLM 等語言技術，已引發了關於擬人化潛在負面影響的重新討論。為了富有成效地討論這種擬人化的影響以及在哪些情況下它是適當的，我們需要一個共享的詞彙，用於語言可以擬人化的各種方式。在這項工作中，我們借鑒現有文獻並分析使用者與語言技術互動的經驗案例，以開發一個文本表達分類法，有助於擬人化。我們強調了理解語言擬人化所涉及的挑戰和緊張關係，例如所有語言從根本上來說都是人類的，以及如何表徵和改變機器中人類感知的努力也可能使某些人類非人化。我們討論了我們的分類法如何支持對語言技術的擬人化進行更準確和有效的討論和決策。", "author": "Alicia DeVrio et.al.", "authors": "Alicia DeVrio, Myra Cheng, Lisa Egede, Alexandra Olteanu, Su Lin Blodgett", "id": "2502.09870v1", "paper_url": "http://arxiv.org/abs/2502.09870v1", "repo": "null"}}