{"2405.07749": {"publish_time": "2024-05-13", "title": "DeepHYDRA: Resource-Efficient Time-Series Anomaly Detection in Dynamically-Configured Systems", "paper_summary": "Anomaly detection in distributed systems such as High-Performance Computing\n(HPC) clusters is vital for early fault detection, performance optimisation,\nsecurity monitoring, reliability in general but also operational insights. Deep\nNeural Networks have seen successful use in detecting long-term anomalies in\nmultidimensional data, originating for instance from industrial or medical\nsystems, or weather prediction. A downside of such methods is that they require\na static input size, or lose data through cropping, sampling, or other\ndimensionality reduction methods, making deployment on systems with variability\non monitored data channels, such as computing clusters difficult. To address\nthese problems, we present DeepHYDRA (Deep Hybrid DBSCAN/Reduction-Based\nAnomaly Detection) which combines DBSCAN and learning-based anomaly detection.\nDBSCAN clustering is used to find point anomalies in time-series data,\nmitigating the risk of missing outliers through loss of information when\nreducing input data to a fixed number of channels. A deep learning-based\ntime-series anomaly detection method is then applied to the reduced data in\norder to identify long-term outliers. This hybrid approach reduces the chances\nof missing anomalies that might be made indistinguishable from normal data by\nthe reduction process, and likewise enables the algorithm to be scalable and\ntolerate partial system failures while retaining its detection capabilities.\nUsing a subset of the well-known SMD dataset family, a modified variant of the\nEclipse dataset, as well as an in-house dataset with a large variability in\nactive data channels, made publicly available with this work, we furthermore\nanalyse computational intensity, memory footprint, and activation counts.\nDeepHYDRA is shown to reliably detect different types of anomalies in both\nlarge and complex datasets.", "paper_summary_zh": "<paragraph>在分布式系統（例如高性能運算 (HPC) 集群）中進行異常偵測，對於早期故障偵測、效能最佳化、安全性監控、整體可靠性以及營運洞察至關重要。深度神經網路已成功用於偵測多維資料中的長期異常，例如來自產業或醫療系統或天氣預測的資料。此類方法的缺點是它們需要靜態輸入大小，或透過裁切、抽樣或其他降維方法來損失資料，這使得在監控資料通道存在變異性的系統（例如運算叢集）上進行部署變得困難。為了解決這些問題，我們提出了 DeepHYDRA（基於深度混合 DBSCAN/降維的異常偵測），它結合了 DBSCAN 和基於學習的異常偵測。DBSCAN 聚類用於在時間序列資料中找出點異常，透過在將輸入資料減少到固定數量的通道時降低因資訊損失而遺漏異常值的風險。然後將基於深度學習的時間序列異常偵測方法應用於減少的資料，以識別長期異常值。這種混合方法降低了遺漏異常值的機率，這些異常值在經過簡化處理後可能與正常資料無法區分，並且同樣使演算法能夠擴展並容忍部分系統故障，同時保留其偵測能力。使用廣為人知的 SMD 資料集家族的子集、Eclipse 資料集的修改版本，以及一個主動資料通道變異性大的內部資料集（隨此工作公開），我們進一步分析了運算強度、記憶體使用量和啟動次數。DeepHYDRA 已被證明能夠在大型和複雜的資料集中可靠地偵測不同類型的異常。</paragraph>", "author": "Franz Kevin Stehle et.al.", "authors": "Franz Kevin Stehle, Wainer Vandelli, Giuseppe Avolio, Felix Zahn, Holger Fröning", "id": "2405.07749v1", "paper_url": "http://arxiv.org/abs/2405.07749v1", "repo": "https://github.com/unihd-ceg/deephydra"}}