{"2409.17652": {"publish_time": "2024-09-26", "title": "FactorSim: Generative Simulation via Factorized Representation", "paper_summary": "Generating simulations to train intelligent agents in game-playing and\nrobotics from natural language input, from user input or task documentation,\nremains an open-ended challenge. Existing approaches focus on parts of this\nchallenge, such as generating reward functions or task hyperparameters. Unlike\nprevious work, we introduce FACTORSIM that generates full simulations in code\nfrom language input that can be used to train agents. Exploiting the structural\nmodularity specific to coded simulations, we propose to use a factored\npartially observable Markov decision process representation that allows us to\nreduce context dependence during each step of the generation. For evaluation,\nwe introduce a generative simulation benchmark that assesses the generated\nsimulation code's accuracy and effectiveness in facilitating zero-shot\ntransfers in reinforcement learning settings. We show that FACTORSIM\noutperforms existing methods in generating simulations regarding prompt\nalignment (e.g., accuracy), zero-shot transfer abilities, and human evaluation.\nWe also demonstrate its effectiveness in generating robotic tasks.", "paper_summary_zh": "從自然語言輸入（來自使用者輸入或任務文件）產生模擬，以訓練遊戲和機器人中的智慧代理，這仍然是一個開放式的挑戰。現有方法專注於此挑戰的一部分，例如產生獎勵函數或任務超參數。與先前的研究不同，我們引入了 FACTORSIM，它從可用於訓練代理的語言輸入中產生代碼中的完整模擬。利用特定於編碼模擬的結構模組化，我們建議使用分層的部分可觀察馬可夫決策過程表示，這允許我們在生成的每個步驟中減少背景依賴性。為了評估，我們引入了一個生成式模擬基準，用於評估生成的模擬代碼在促進強化學習設定中的零次學習轉移方面的準確性和有效性。我們表明 FACTORSIM 在產生模擬方面優於現有方法，包括提示對齊（例如，準確性）、零次學習轉移能力和人類評估。我們還展示了它在產生機器人任務方面的有效性。", "author": "Fan-Yun Sun et.al.", "authors": "Fan-Yun Sun, S. I. Harini, Angela Yi, Yihan Zhou, Alex Zook, Jonathan Tremblay, Logan Cross, Jiajun Wu, Nick Haber", "id": "2409.17652v1", "paper_url": "http://arxiv.org/abs/2409.17652v1", "repo": "null"}}