{"2409.11844": {"publish_time": "2024-09-18", "title": "MEOW: MEMOry Supervised LLM Unlearning Via Inverted Facts", "paper_summary": "Large Language Models (LLMs) can memorize sensitive information, raising\nconcerns about potential misuse. LLM Unlearning, a post-hoc approach to remove\nthis information from trained LLMs, offers a promising solution to mitigate\nthese risks. However, previous practices face three key challenges: 1. Utility:\nsuccessful unlearning often causes catastrophic collapse on unrelated tasks. 2.\nEfficiency: many methods either involve adding similarly sized models, which\nslows down unlearning or inference, or require retain data that are difficult\nto obtain. 3. Robustness: even effective methods may still leak data via\nextraction techniques. To address these challenges, we propose MEOW, a simple\nyet effective gradient descent-based unlearning method. Specifically, we use an\noffline LLM to generate a set of inverted facts. Then, we design a new metric,\nMEMO, to quantify memorization in LLMs. Finally, based on the signals provided\nby MEMO, we select the most appropriate set of inverted facts and finetune the\nmodel based on them. We evaluate MEOW on the commonly used unlearn benchmark,\nToFU, with Llama2-7B-Chat and Phi-1.5B, and test it on both NLU and NLG tasks.\nResults demonstrate significant improvement of MEOW in forget quality without\nsubstantial loss in model utility. Meanwhile, MEOW does not exhibit significant\ndegradation in NLU or NLG capabilities, and there is even a slight improvement\nin NLU performance.", "paper_summary_zh": "大型語言模型 (LLM) 可以記住敏感資訊，這引起了人們對潛在誤用的擔憂。LLM 遺忘是一種事後方法，用於從訓練過的 LLM 中移除這些資訊，這提供了一個有希望的解決方案來減輕這些風險。然而，先前的做法面臨三個關鍵挑戰：1. 實用性：成功的遺忘通常會導致與任務無關的災難性崩潰。2. 效率：許多方法都涉及新增相似大小的模型，這會減慢遺忘或推理速度，或者需要保留難以取得的資料。3. 穩健性：即使是有效的方法，也可能透過萃取技術洩漏資料。為了應對這些挑戰，我們提出了 MEOW，一種簡單但有效的基於梯度下降的遺忘方法。具體來說，我們使用離線 LLM 來產生一組反向事實。然後，我們設計了一個新的指標 MEMO，用於量化 LLM 中的記憶。最後，根據 MEMO 提供的信號，我們選擇最合適的反向事實集，並根據它們微調模型。我們在常用的遺忘基準 ToFU 上評估了 MEOW，其中包含 Llama2-7B-Chat 和 Phi-1.5B，並在 NLU 和 NLG 任務上對其進行了測試。結果表明，MEOW 在遺忘品質上有了顯著的提升，而模型實用性沒有顯著下降。同時，MEOW 在 NLU 或 NLG 能力上沒有表現出顯著的下降，甚至在 NLU 性能上還略有提升。", "author": "Tianle Gu et.al.", "authors": "Tianle Gu, Kexin Huang, Ruilin Luo, Yuanqi Yao, Yujiu Yang, Yan Teng, Yingchun Wang", "id": "2409.11844v1", "paper_url": "http://arxiv.org/abs/2409.11844v1", "repo": "https://github.com/carol-gutianle/meow"}}