{"2408.02044": {"publish_time": "2024-08-04", "title": "Fine-tuning multilingual language models in Twitter/X sentiment analysis: a study on Eastern-European V4 languages", "paper_summary": "The aspect-based sentiment analysis (ABSA) is a standard NLP task with\nnumerous approaches and benchmarks, where large language models (LLM) represent\nthe current state-of-the-art. We focus on ABSA subtasks based on Twitter/X data\nin underrepresented languages. On such narrow tasks, small tuned language\nmodels can often outperform universal large ones, providing available and cheap\nsolutions.\n  We fine-tune several LLMs (BERT, BERTweet, Llama2, Llama3, Mistral) for\nclassification of sentiment towards Russia and Ukraine in the context of the\nongoing military conflict. The training/testing dataset was obtained from the\nacademic API from Twitter/X during 2023, narrowed to the languages of the V4\ncountries (Czech Republic, Slovakia, Poland, Hungary). Then we measure their\nperformance under a variety of settings including translations, sentiment\ntargets, in-context learning and more, using GPT4 as a reference model. We\ndocument several interesting phenomena demonstrating, among others, that some\nmodels are much better fine-tunable on multilingual Twitter tasks than others,\nand that they can reach the SOTA level with a very small training set. Finally\nwe identify combinations of settings providing the best results.", "paper_summary_zh": "基於面向方面的觀點分析 (ABSA) 是一項標準的 NLP 任務，有\n許多方法和基準，其中大型語言模型 (LLM) 代表了當前技術水準。我們專注於基於 Twitter/X 資料的 ABSA 子任務，使用代表性不足的語言。在這些狹窄的任務中，經過微調的小語言模型通常可以優於通用的大型語言模型，提供可用且便宜的解決方案。\n我們微調了多個 LLM（BERT、BERTweet、Llama2、Llama3、Mistral），以便在持續的軍事衝突背景下對俄羅斯和烏克蘭的情感進行分類。訓練/測試資料集是從 Twitter/X 的學術 API 在 2023 年獲得的，並縮小到 V4 國家的語言（捷克共和國、斯洛伐克、波蘭、匈牙利）。然後，我們使用 GPT4 作為參考模型，在各種設定（包括翻譯、情感目標、情境學習等）下衡量它們的效能。我們記錄了幾個有趣的現象，其中包括一些模型比其他模型更適合在多語言的 Twitter 任務上進行微調，而且它們可以使用非常小的訓練集達到 SOTA 水準。最後，我們找出提供最佳結果的設定組合。", "author": "Tomáš Filip et.al.", "authors": "Tomáš Filip, Martin Pavlíček, Petr Sosík", "id": "2408.02044v1", "paper_url": "http://arxiv.org/abs/2408.02044v1", "repo": "null"}}