{"2411.14626": {"publish_time": "2024-11-21", "title": "Unveiling the Hidden: A Comprehensive Evaluation of Underwater Image Enhancement and Its Impact on Object Detection", "paper_summary": "Underwater imagery often suffers from severe degradation that results in low\nvisual quality and object detection performance. This work aims to evaluate\nstate-of-the-art image enhancement models, investigate their impact on\nunderwater object detection, and explore their potential to improve detection\nperformance. To this end, we selected representative underwater image\nenhancement models covering major enhancement categories and applied them\nseparately to two recent datasets: 1) the Real-World Underwater Object\nDetection Dataset (RUOD), and 2) the Challenging Underwater Plant Detection\nDataset (CUPDD). Following this, we conducted qualitative and quantitative\nanalyses on the enhanced images and developed a quality index (Q-index) to\ncompare the quality distribution of the original and enhanced images.\nSubsequently, we compared the performance of several YOLO-NAS detection models\nthat are separately trained and tested on the original and enhanced image sets.\nThen, we performed a correlation study to examine the relationship between\nenhancement metrics and detection performance. We also analyzed the inference\nresults from the trained detectors presenting cases where enhancement increased\nthe detection performance as well as cases where enhancement revealed missed\nobjects by human annotators. This study suggests that although enhancement\ngenerally deteriorates the detection performance, it can still be harnessed in\nsome cases for increased detection performance and more accurate human\nannotation.", "paper_summary_zh": "水下影像经常遭受严重劣化，导致视觉品质低落，且物体侦测效能不佳。这项研究旨在评估最先进的影像增强模型，调查它们对水下物体侦测的影响，并探索它们改善侦测效能的可能性。为此，我们选择了涵盖主要增强类别的代表性水下影像增强模型，并将它们分别应用于两个最近的数据集：1) 真实世界水下物体侦测数据集 (RUOD)，以及 2) 具有挑战性的水下植物侦测数据集 (CUPDD)。在此之后，我们对增强后的影像进行了定性和定量分析，并开发了一个质量指标 (Q 指标) 来比较原始影像和增强影像的质量分布。随后，我们比较了几个 YOLO-NAS 侦测模型的效能，这些模型分别在原始影像和增强影像集上进行训练和测试。然后，我们进行了一项相关性研究，以检验增强指标和侦测效能之间的关系。我们还分析了训练过的侦测器的推论结果，呈现出增强提升侦测效能的案例，以及增强揭露了人类注释员遗漏物体的案例。这项研究表明，虽然增强通常会降低侦测效能，但在某些情况下，它仍然可以被利用来提升侦测效能和更准确的人类注释。", "author": "Ali Awad et.al.", "authors": "Ali Awad, Ashraf Saleem, Sidike Paheding, Evan Lucas, Serein Al-Ratrout, Timothy C. Havens", "id": "2411.14626v1", "paper_url": "http://arxiv.org/abs/2411.14626v1", "repo": "null"}}