{"2501.18154": {"publish_time": "2025-01-30", "title": "Mixed-Precision Graph Neural Quantization for Low Bit Large Language Models", "paper_summary": "Post-Training Quantization (PTQ) is pivotal for deploying large language\nmodels (LLMs) within resource-limited settings by significantly reducing\nresource demands. However, existing PTQ strategies underperform at low bit\nlevels < 3 bits due to the significant difference between the quantized and\noriginal weights. To enhance the quantization performance at low bit widths, we\nintroduce a Mixed-precision Graph Neural PTQ (MG-PTQ) approach, employing a\ngraph neural network (GNN) module to capture dependencies among weights and\nadaptively assign quantization bit-widths. Through the information propagation\nof the GNN module, our method more effectively captures dependencies among\ntarget weights, leading to a more accurate assessment of weight importance and\noptimized allocation of quantization strategies. Extensive experiments on the\nWikiText2 and C4 datasets demonstrate that our MG-PTQ method outperforms\nprevious state-of-the-art PTQ method GPTQ, setting new benchmarks for\nquantization performance under low-bit conditions.", "paper_summary_zh": "訓練後量化 (PTQ) 對於在資源受限的設定中部署大型語言模型 (LLM) 至關重要，因為它能顯著降低資源需求。然而，現有的 PTQ 策略在低位元層級 < 3 位元時表現不佳，因為量化後的權重與原始權重之間有顯著的差異。為了提升低位元寬度的量化效能，我們提出混合精度圖神經網路 PTQ (MG-PTQ) 方法，採用圖神經網路 (GNN) 模組來擷取權重之間的依存關係，並動態分配量化位元寬度。透過 GNN 模組的資訊傳播，我們的方法能更有效地擷取目標權重之間的依存關係，進而更準確地評估權重重要性，並最佳化量化策略的配置。在 WikiText2 和 C4 資料集上的廣泛實驗證明，我們的 MG-PTQ 方法優於先前的最先進 PTQ 方法 GPTQ，在低位元條件下設定了量化效能的新基準。", "author": "Wanlong Liu et.al.", "authors": "Wanlong Liu, Yichen Xiao, Dingyi Zeng, Hongyang Zhao, Wenyu Chen, Malu Zhang", "id": "2501.18154v1", "paper_url": "http://arxiv.org/abs/2501.18154v1", "repo": "null"}}