{"2412.07411": {"publish_time": "2024-12-10", "title": "DSFEC: Efficient and Deployable Deep Radar Object Detection", "paper_summary": "Deploying radar object detection models on resource-constrained edge devices\nlike the Raspberry Pi poses significant challenges due to the large size of the\nmodel and the limited computational power and the memory of the Pi. In this\nwork, we explore the efficiency of Depthwise Separable Convolutions in radar\nobject detection networks and integrate them into our model. Additionally, we\nintroduce a novel Feature Enhancement and Compression (FEC) module to the\nPointPillars feature encoder to further improve the model performance. With\nthese innovations, we propose the DSFEC-L model and its two versions, which\noutperform the baseline (23.9 mAP of Car class, 20.72 GFLOPs) on nuScenes\ndataset: 1). An efficient DSFEC-M model with a 14.6% performance improvement\nand a 60% reduction in GFLOPs. 2). A deployable DSFEC-S model with a 3.76%\nperformance improvement and a remarkable 78.5% reduction in GFLOPs. Despite\nmarginal performance gains, our deployable model achieves an impressive 74.5%\nreduction in runtime on the Raspberry Pi compared to the baseline.", "paper_summary_zh": "在樹莓派等資源受限的邊緣裝置上部署雷達物件偵測模型，由於模型尺寸龐大，且 Pi 的運算能力和記憶體有限，因此會帶來重大挑戰。在這項工作中，我們探討深度可分離卷積在雷達物件偵測網路中的效率，並將它們整合到我們的模型中。此外，我們在 PointPillars 特徵編碼器中引入了一個新穎的特徵增強和壓縮 (FEC) 模組，以進一步提升模型效能。有了這些創新，我們提出了 DSFEC-L 模型及其兩個版本，它們在 nuScenes 資料集上優於基準 (汽車類別的 23.9 mAP，20.72 GFLOPs)：1) 效能提升 14.6%，GFLOPs 減少 60% 的高效 DSFEC-M 模型。2) 效能提升 3.76%，GFLOPs 減少 78.5% 的可部署 DSFEC-S 模型。儘管效能提升幅度不大，但與基準相比，我們的可部署模型在樹莓派上實現了令人印象深刻的執行時間減少 74.5%。", "author": "Gayathri Dandugula et.al.", "authors": "Gayathri Dandugula, Santhosh Boddana, Sudesh Mirashi", "id": "2412.07411v1", "paper_url": "http://arxiv.org/abs/2412.07411v1", "repo": "null"}}