{"2501.19328": {"publish_time": "2025-01-31", "title": "Capturing Temporal Dynamics in Large-Scale Canopy Tree Height Estimation", "paper_summary": "With the rise in global greenhouse gas emissions, accurate large-scale tree\ncanopy height maps are essential for understanding forest structure, estimating\nabove-ground biomass, and monitoring ecological disruptions. To this end, we\npresent a novel approach to generate large-scale, high-resolution canopy height\nmaps over time. Our model accurately predicts canopy height over multiple years\ngiven Sentinel-2 time series satellite data. Using GEDI LiDAR data as the\nground truth for training the model, we present the first 10m resolution\ntemporal canopy height map of the European continent for the period 2019-2022.\nAs part of this product, we also offer a detailed canopy height map for 2020,\nproviding more precise estimates than previous studies. Our pipeline and the\nresulting temporal height map are publicly available, enabling comprehensive\nlarge-scale monitoring of forests and, hence, facilitating future research and\necological analyses. For an interactive viewer, see\nhttps://europetreemap.projects.earthengine.app/view/temporalcanopyheight.", "paper_summary_zh": "隨著全球溫室氣體排放量的增加，準確的大規模樹冠高度圖對於理解森林結構、估計地上生物量和監測生態破壞至關重要。為此，我們提出了一種新的方法來生成大規模、高解析度的樹冠高度圖。我們的模型準確預測了多年來給定 Sentinel-2 時間序列衛星數據的樹冠高度。使用 GEDI LiDAR 數據作為訓練模型的真實情況，我們展示了第一個 2019-2022 年期間歐洲大陸 10m 解析度的時間樹冠高度圖。作為該產品的一部分，我們還提供 2020 年的詳細樹冠高度圖，提供比以前的研究更精確的估計。我們的管道和生成的時態高度圖是公開的，可以對森林進行全面的大規模監控，從而促進未來的研究和生態分析。有關互動查看器，請參閱 https://europetreemap.projects.earthengine.app/view/temporalcanopyheight。", "author": "Jan Pauls et.al.", "authors": "Jan Pauls, Max Zimmer, Berkant Turan, Sassan Saatchi, Philippe Ciais, Sebastian Pokutta, Fabian Gieseke", "id": "2501.19328v1", "paper_url": "http://arxiv.org/abs/2501.19328v1", "repo": "null"}}