{"2411.13874": {"publish_time": "2024-11-21", "title": "Next-Generation Phishing: How LLM Agents Empower Cyber Attackers", "paper_summary": "The escalating threat of phishing emails has become increasingly\nsophisticated with the rise of Large Language Models (LLMs). As attackers\nexploit LLMs to craft more convincing and evasive phishing emails, it is\ncrucial to assess the resilience of current phishing defenses. In this study we\nconduct a comprehensive evaluation of traditional phishing detectors, such as\nGmail Spam Filter, Apache SpamAssassin, and Proofpoint, as well as machine\nlearning models like SVM, Logistic Regression, and Naive Bayes, in identifying\nboth traditional and LLM-rephrased phishing emails. We also explore the\nemerging role of LLMs as phishing detection tools, a method already adopted by\ncompanies like NTT Security Holdings and JPMorgan Chase. Our results reveal\nnotable declines in detection accuracy for rephrased emails across all\ndetectors, highlighting critical weaknesses in current phishing defenses. As\nthe threat landscape evolves, our findings underscore the need for stronger\nsecurity controls and regulatory oversight on LLM-generated content to prevent\nits misuse in creating advanced phishing attacks. This study contributes to the\ndevelopment of more effective Cyber Threat Intelligence (CTI) by leveraging\nLLMs to generate diverse phishing variants that can be used for data\naugmentation, harnessing the power of LLMs to enhance phishing detection, and\npaving the way for more robust and adaptable threat detection systems.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的興起，網路釣魚電子郵件的威脅日益嚴重且複雜。由於攻擊者利用 LLM 製作更具說服力和規避性的網路釣魚電子郵件，因此評估當前網路釣魚防禦的韌性至關重要。在這項研究中，我們對傳統的網路釣魚偵測器進行全面評估，例如 Gmail 垃圾郵件過濾器、Apache SpamAssassin 和 Proofpoint，以及機器學習模型（例如 SVM、邏輯迴歸和樸素貝氏），以識別傳統和 LLM 改寫的網路釣魚電子郵件。我們還探討了 LLM 作為網路釣魚偵測工具的新興角色，這是一種 NTT Security Holdings 和 JPMorgan Chase 等公司已採用的方法。我們的結果顯示，所有偵測器對改寫電子郵件的偵測準確度都有顯著下降，突顯出當前網路釣魚防禦的嚴重弱點。隨著威脅環境的演變，我們的研究結果強調需要對 LLM 生成的內容進行更強的安全性控制和法規監督，以防止其被濫用於製造進階網路釣魚攻擊。本研究有助於開發更有效的網路威脅情報 (CTI)，方法是利用 LLM 生成可用于資料擴充的多樣化網路釣魚變體，利用 LLM 的功能來增強網路釣魚偵測，並為更強大且適應性更強的威脅偵測系統鋪路。", "author": "Khalifa Afane et.al.", "authors": "Khalifa Afane, Wenqi Wei, Ying Mao, Junaid Farooq, Juntao Chen", "id": "2411.13874v1", "paper_url": "http://arxiv.org/abs/2411.13874v1", "repo": "null"}}