{"2502.04314": {"publish_time": "2025-02-06", "title": "BOUQuET: dataset, Benchmark and Open initiative for Universal Quality Evaluation in Translation", "paper_summary": "This paper presents BOUQuET, a multicentric and multi-register/domain dataset\nand benchmark, and its broader collaborative extension initiative. This dataset\nis handcrafted in non-English languages first, each of these source languages\nbeing represented among the 23 languages commonly used by half of the world's\npopulation and therefore having the potential to serve as pivot languages that\nwill enable more accurate translations. The dataset is specially designed to\navoid contamination and be multicentric, so as to enforce representation of\nmultilingual language features. In addition, the dataset goes beyond the\nsentence level, as it is organized in paragraphs of various lengths. Compared\nwith related machine translation (MT) datasets, we show that BOUQuET has a\nbroader representation of domains while simplifying the translation task for\nnon-experts. Therefore, BOUQuET is specially suitable for the open initiative\nand call for translation participation that we are launching to extend it to a\nmulti-way parallel corpus to any written language.", "paper_summary_zh": "本論文提出 BOUQuET，這是一個多中心、多註冊/網域資料集和基準，以及其更廣泛的協作延伸計畫。此資料集首先以非英語語言手工製作，這些原始語言中的每一種語言都代表著世界一半人口常用的 23 種語言之一，因此有可能作為樞紐語言，能實現更準確的翻譯。此資料集經過特別設計，可避免污染並成為多中心，以便強制執行多語言語言特徵的表示。此外，資料集超越句子層級，因為它是以不同長度的段落組織的。與相關機器翻譯 (MT) 資料集相比，我們顯示 BOUQuET 具有更廣泛的網域表示，同時簡化了非專家的翻譯任務。因此，BOUQuET 特別適合開放計畫，並呼籲翻譯參與，我們正在啟動它，將其擴充為任何書面語言的多向平行語料庫。", "author": "The Omnilingual MT Team et.al.", "authors": "The Omnilingual MT Team, Pierre Andrews, Mikel Artetxe, Mariano Coria Meglioli, Marta R. Costa-jussà, Joe Chuang, David Dale, Cynthia Gao, Jean Maillard, Alex Mourachko, Christophe Ropers, Safiyyah Saleem, Eduardo Sánchez, Ioannis Tsiamas, Arina Turkatenko, Albert Ventayol-Boada, Shireen Yates", "id": "2502.04314v1", "paper_url": "http://arxiv.org/abs/2502.04314v1", "repo": "null"}}