{"2407.15600": {"publish_time": "2024-07-22", "title": "A Pairwise Comparison Relation-assisted Multi-objective Evolutionary Neural Architecture Search Method with Multi-population Mechanism", "paper_summary": "Neural architecture search (NAS) enables re-searchers to automatically\nexplore vast search spaces and find efficient neural networks. But NAS suffers\nfrom a key bottleneck, i.e., numerous architectures need to be evaluated during\nthe search process, which requires a lot of computing resources and time. In\norder to improve the efficiency of NAS, a series of methods have been proposed\nto reduce the evaluation time of neural architectures. However, they are not\nefficient enough and still only focus on the accuracy of architectures. In\naddition to the classification accuracy, more efficient and smaller network\narchitectures are required in real-world applications. To address the above\nproblems, we propose the SMEM-NAS, a pairwise com-parison relation-assisted\nmulti-objective evolutionary algorithm based on a multi-population mechanism.\nIn the SMEM-NAS, a surrogate model is constructed based on pairwise compari-son\nrelations to predict the accuracy ranking of architectures, rather than the\nabsolute accuracy. Moreover, two populations cooperate with each other in the\nsearch process, i.e., a main population guides the evolution, while a vice\npopulation expands the diversity. Our method aims to provide high-performance\nmodels that take into account multiple optimization objectives. We conduct a\nseries of experiments on the CIFAR-10, CIFAR-100 and ImageNet datasets to\nverify its effectiveness. With only a single GPU searching for 0.17 days,\ncompetitive architectures can be found by SMEM-NAS which achieves 78.91%\naccuracy with the MAdds of 570M on the ImageNet. This work makes a significant\nadvance in the important field of NAS.", "paper_summary_zh": "<paragraph>神經網路架構搜尋 (NAS) 能讓研究人員自動探索廣大的搜尋空間，並找到有效率的神經網路。但 NAS 會遇到一個主要的瓶頸，也就是在搜尋過程中需要評估大量的架構，這需要大量的運算資源和時間。為了提升 NAS 的效率，已經提出了一系列的方法來減少神經網路架構的評估時間。然而，這些方法還不夠有效率，而且仍然只著重於架構的準確度。除了分類準確度之外，在實際應用中還需要更有效率且更小的網路架構。為了解決上述問題，我們提出 SMEM-NAS，這是一種基於多族群機制的成對比較關係輔助多目標演化演算法。在 SMEM-NAS 中，會根據成對比較關係建構一個代理模型，用來預測架構的準確度排名，而不是絕對準確度。此外，在搜尋過程中，兩個族群會互相合作，也就是說，一個主族群引導演化，而一個副族群則擴展多樣性。我們的方法旨在提供考量多個最佳化目標的高效能模型。我們在 CIFAR-10、CIFAR-100 和 ImageNet 資料集上進行了一系列的實驗，以驗證其有效性。SMEM-NAS 只使用單一 GPU 搜尋 0.17 天，就能找到競爭力的架構，在 ImageNet 上以 570M 的 MAdds 達到 78.91% 的準確度。這項工作在 NAS 的重要領域中取得顯著進展。</paragraph>", "author": "Yu Xue et.al.", "authors": "Yu Xue, Chenchen Zhu, MengChu Zhou, Mohamed Wahib, Moncef Gabbouj", "id": "2407.15600v1", "paper_url": "http://arxiv.org/abs/2407.15600v1", "repo": "null"}}