{"2407.08952": {"publish_time": "2024-07-12", "title": "Detect, Investigate, Judge and Determine: A Novel LLM-based Framework for Few-shot Fake News Detection", "paper_summary": "Few-Shot Fake News Detection (FS-FND) aims to distinguish inaccurate news\nfrom real ones in extremely low-resource scenarios. This task has garnered\nincreased attention due to the widespread dissemination and harmful impact of\nfake news on social media. Large Language Models (LLMs) have demonstrated\ncompetitive performance with the help of their rich prior knowledge and\nexcellent in-context learning abilities. However, existing methods face\nsignificant limitations, such as the Understanding Ambiguity and Information\nScarcity, which significantly undermine the potential of LLMs. To address these\nshortcomings, we propose a Dual-perspective Augmented Fake News Detection\n(DAFND) model, designed to enhance LLMs from both inside and outside\nperspectives. Specifically, DAFND first identifies the keywords of each news\narticle through a Detection Module. Subsequently, DAFND creatively designs an\nInvestigation Module to retrieve inside and outside valuable information\nconcerning to the current news, followed by another Judge Module to derive its\nrespective two prediction results. Finally, a Determination Module further\nintegrates these two predictions and derives the final result. Extensive\nexperiments on two publicly available datasets show the efficacy of our\nproposed method, particularly in low-resource settings.", "paper_summary_zh": "少樣本假新聞偵測 (FS-FND) 的目標是在極度低資源的場景中，區分不準確的新聞和真實新聞。由於假新聞在社群媒體上的廣泛傳播和有害影響，這項任務獲得了越來越多的關注。大型語言模型 (LLM) 在豐富先驗知識和出色的情境學習能力的幫助下，展現了競爭力的表現。然而，現有方法面臨著顯著的限制，例如理解模稜兩可和資訊稀少，這會顯著削弱 LLM 的潛力。為了解決這些缺點，我們提出了一個雙視角增強假新聞偵測 (DAFND) 模型，旨在從內部和外部視角增強 LLM。具體來說，DAFND 首先透過偵測模組識別每篇新聞文章的關鍵字。隨後，DAFND 創意地設計了一個調查模組，以擷取與當前新聞相關的內部和外部有價值資訊，接著再透過另一個判斷模組來推導其各自的兩個預測結果。最後，一個判定模組進一步整合這兩個預測，並推导出最終結果。在兩個公開可用的資料集上進行的廣泛實驗顯示了我們提出的方法的功效，特別是在低資源的設定中。", "author": "Ye Liu et.al.", "authors": "Ye Liu, Jiajun Zhu, Kai Zhang, Haoyu Tang, Yanghai Zhang, Xukai Liu, Qi Liu, Enhong Chen", "id": "2407.08952v1", "paper_url": "http://arxiv.org/abs/2407.08952v1", "repo": "null"}}