{"2408.06737": {"publish_time": "2024-08-13", "title": "Multilingual Models for Check-Worthy Social Media Posts Detection", "paper_summary": "This work presents an extensive study of transformer-based NLP models for\ndetection of social media posts that contain verifiable factual claims and\nharmful claims. The study covers various activities, including dataset\ncollection, dataset pre-processing, architecture selection, setup of settings,\nmodel training (fine-tuning), model testing, and implementation. The study\nincludes a comprehensive analysis of different models, with a special focus on\nmultilingual models where the same model is capable of processing social media\nposts in both English and in low-resource languages such as Arabic, Bulgarian,\nDutch, Polish, Czech, Slovak. The results obtained from the study were\nvalidated against state-of-the-art models, and the comparison demonstrated the\nrobustness of the proposed models. The novelty of this work lies in the\ndevelopment of multi-label multilingual classification models that can\nsimultaneously detect harmful posts and posts that contain verifiable factual\nclaims in an efficient way.", "paper_summary_zh": "本研究針對基於 Transformer 的 NLP 模型進行廣泛的研究，以偵測包含可驗證事實聲明和有害聲明的社群媒體貼文。本研究涵蓋各種活動，包括資料集收集、資料集預處理、架構選擇、設定設定、模型訓練（微調）、模型測試和實作。本研究包含對不同模型的全面分析，特別關注多語言模型，其中同一個模型能夠處理英文和低資源語言（例如阿拉伯文、保加利亞文、荷蘭文、波蘭文、捷克文、斯洛伐克文）的社群媒體貼文。本研究獲得的結果已針對最先進的模型進行驗證，而比較結果則證明了所提出模型的穩健性。本研究的新穎之處在於開發多標籤多語言分類模型，能夠同時有效率地偵測有害貼文和包含可驗證事實聲明的貼文。", "author": "Sebastian Kula et.al.", "authors": "Sebastian Kula, Michal Gregor", "id": "2408.06737v1", "paper_url": "http://arxiv.org/abs/2408.06737v1", "repo": "null"}}