{"2412.09812": {"publish_time": "2024-12-13", "title": "ScaleOT: Privacy-utility-scalable Offsite-tuning with Dynamic LayerReplace and Selective Rank Compression", "paper_summary": "Offsite-tuning is a privacy-preserving method for tuning large language\nmodels (LLMs) by sharing a lossy compressed emulator from the LLM owners with\ndata owners for downstream task tuning. This approach protects the privacy of\nboth the model and data owners. However, current offsite tuning methods often\nsuffer from adaptation degradation, high computational costs, and limited\nprotection strength due to uniformly dropping LLM layers or relying on\nexpensive knowledge distillation. To address these issues, we propose ScaleOT,\na novel privacy-utility-scalable offsite-tuning framework that effectively\nbalances privacy and utility. ScaleOT introduces a novel layerwise lossy\ncompression algorithm that uses reinforcement learning to obtain the importance\nof each layer. It employs lightweight networks, termed harmonizers, to replace\nthe raw LLM layers. By combining important original LLM layers and harmonizers\nin different ratios, ScaleOT generates emulators tailored for optimal\nperformance with various model scales for enhanced privacy protection.\nAdditionally, we present a rank reduction method to further compress the\noriginal LLM layers, significantly enhancing privacy with negligible impact on\nutility. Comprehensive experiments show that ScaleOT can achieve nearly\nlossless offsite tuning performance compared with full fine-tuning while\nobtaining better model privacy.", "paper_summary_zh": "場外微調是一種隱私保護方法，用於透過 LLM 所有者與資料所有者分享有損失壓縮的 LLM 模擬器，以進行下游任務微調，進而微調大型語言模型 (LLM)。此方法保護模型和資料所有者的隱私。然而，目前的場外微調方法通常會因為適應性降低、高運算成本和有限的保護強度而受苦，這是因為均勻地捨棄 LLM 層或依賴昂貴的知識萃取。為了解決這些問題，我們提出 ScaleOT，這是一個新穎的隱私公用事業可擴充場外微調架構，能有效平衡隱私和公用事業。ScaleOT 介紹了一種新穎的逐層有損失壓縮演算法，該演算法使用強化學習來取得每一層的重要性。它採用稱為調和器的輕量級網路，以取代原始的 LLM 層。透過以不同的比例結合重要的原始 LLM 層和調和器，ScaleOT 能產生針對最佳效能量身打造的模擬器，並具備各種模型規模以增強隱私保護。此外，我們提出一個秩次簡約法，以進一步壓縮原始的 LLM 層，大幅提升隱私，且對公用事業的影響可以忽略不計。全面的實驗顯示，與完全微調相比，ScaleOT 能夠達成近乎無損失的場外微調效能，同時還能取得更好的模型隱私。", "author": "Kai Yao et.al.", "authors": "Kai Yao, Zhaorui Tan, Tiandi Ye, Lichun Li, Yuan Zhao, Wenyan Liu, Wei Wang, Jianke Zhu", "id": "2412.09812v1", "paper_url": "http://arxiv.org/abs/2412.09812v1", "repo": "null"}}