{"2501.02629": {"publish_time": "2025-01-05", "title": "Layer-Level Self-Exposure and Patch: Affirmative Token Mitigation for Jailbreak Attack Defense", "paper_summary": "As large language models (LLMs) are increasingly deployed in diverse\napplications, including chatbot assistants and code generation, aligning their\nbehavior with safety and ethical standards has become paramount. However,\njailbreak attacks, which exploit vulnerabilities to elicit unintended or\nharmful outputs, threaten LLMs' safety significantly. In this paper, we\nintroduce Layer-AdvPatcher, a novel methodology designed to defend against\njailbreak attacks by utilizing an unlearning strategy to patch specific layers\nwithin LLMs through self-augmented datasets. Our insight is that certain\nlayer(s), tend to produce affirmative tokens when faced with harmful prompts.\nBy identifying these layers and adversarially exposing them to generate more\nharmful data, one can understand their inherent and diverse vulnerabilities to\nattacks. With these exposures, we then \"unlearn\" these issues, reducing the\nimpact of affirmative tokens and hence minimizing jailbreak risks while keeping\nthe model's responses to safe queries intact. We conduct extensive experiments\non two models, four benchmark datasets, and multiple state-of-the-art jailbreak\nbenchmarks to demonstrate the efficacy of our approach. Results indicate that\nour framework reduces the harmfulness and attack success rate of jailbreak\nattacks without compromising utility for benign queries compared to recent\ndefense methods.", "paper_summary_zh": "隨著大型語言模型（LLM）在各種應用程式中越來越廣泛地部署，包括聊天機器人助理和程式碼產生，使其行為與安全和倫理標準保持一致已變得至關重要。然而，利用漏洞引發意外或有害輸出的越獄攻擊，嚴重威脅到 LLM 的安全性。在本文中，我們介紹了 Layer-AdvPatcher，這是一種新穎的方法，旨在通過利用非學習策略來修補 LLM 中的特定層，從而防禦越獄攻擊通過自我擴充的資料集。我們的見解是，某些層在面對有害提示時往往會產生肯定的標記。通過識別這些層並對抗性地讓它們產生更多有害資料，人們可以了解它們固有的和對攻擊的多種漏洞。有了這些曝光，我們接著「忘記」這些問題，減少肯定標記的影響，從而最大程度地降低越獄風險，同時保持模型對安全查詢的回應不變。我們對兩個模型、四個基準資料集和多個最先進的越獄基準進行了廣泛的實驗，以證明我們方法的有效性。結果表明，與最近的防禦方法相比，我們的框架降低了越獄攻擊的危害性和攻擊成功率，同時不損害良性查詢的效用。", "author": "Yang Ouyang et.al.", "authors": "Yang Ouyang, Hengrui Gu, Shuhang Lin, Wenyue Hua, Jie Peng, Bhavya Kailkhura, Tianlong Chen, Kaixiong Zhou", "id": "2501.02629v1", "paper_url": "http://arxiv.org/abs/2501.02629v1", "repo": "null"}}