{"2412.02149": {"publish_time": "2024-12-03", "title": "Leveraging Large Language Models for Comparative Literature Summarization with Reflective Incremental Mechanisms", "paper_summary": "In this paper, we introduce ChatCite, a novel method leveraging large\nlanguage models (LLMs) for generating comparative literature summaries. The\nability to summarize research papers with a focus on key comparisons between\nstudies is an essential task in academic research. Existing summarization\nmodels, while effective at generating concise summaries, fail to provide deep\ncomparative insights. ChatCite addresses this limitation by incorporating a\nmulti-step reasoning mechanism that extracts critical elements from papers,\nincrementally builds a comparative summary, and refines the output through a\nreflective memory process. We evaluate ChatCite on a custom dataset,\nCompLit-LongContext, consisting of 1000 research papers with annotated\ncomparative summaries. Experimental results show that ChatCite outperforms\nseveral baseline methods, including GPT-4, BART, T5, and CoT, across various\nautomatic evaluation metrics such as ROUGE and the newly proposed G-Score.\nHuman evaluation further confirms that ChatCite generates more coherent,\ninsightful, and fluent summaries compared to these baseline models. Our method\nprovides a significant advancement in automatic literature review generation,\noffering researchers a powerful tool for efficiently comparing and synthesizing\nscientific research.", "paper_summary_zh": "在本文中，我們介紹了 ChatCite，一種利用大型語言模型 (LLM) 生成比較文學摘要的新方法。摘要研究論文並專注於研究之間的關鍵比較的能力，是學術研究中的一項重要任務。現有的摘要模型雖然能夠產生簡潔的摘要，但無法提供深入的比較見解。ChatCite 通過整合一個多步驟推理機制來解決這個限制，該機制從論文中提取關鍵元素，逐步建立一個比較摘要，並通過反思記憶過程優化輸出。我們在一個自訂資料集 CompLit-LongContext 上評估 ChatCite，該資料集包含 1000 篇帶有註解比較摘要的研究論文。實驗結果表明，ChatCite 在各種自動評估指標（例如 ROUGE 和新提出的 G-Score）中優於多種基線方法，包括 GPT-4、BART、T5 和 CoT。人工評估進一步證實，與這些基線模型相比，ChatCite 生成的摘要更具連貫性、洞察力和流暢性。我們的這項方法在自動文獻回顧生成方面取得了重大進展，為研究人員提供了一個強大的工具，可以高效地比較和綜合科學研究。", "author": "Fernando Gabriela Garcia et.al.", "authors": "Fernando Gabriela Garcia, Spencer Burns, Harrison Fuller", "id": "2412.02149v1", "paper_url": "http://arxiv.org/abs/2412.02149v1", "repo": "null"}}