{"2501.05885": {"publish_time": "2025-01-10", "title": "EDNet: Edge-Optimized Small Target Detection in UAV Imagery -- Faster Context Attention, Better Feature Fusion, and Hardware Acceleration", "paper_summary": "Detecting small targets in drone imagery is challenging due to low\nresolution, complex backgrounds, and dynamic scenes. We propose EDNet, a novel\nedge-target detection framework built on an enhanced YOLOv10 architecture,\noptimized for real-time applications without post-processing. EDNet\nincorporates an XSmall detection head and a Cross Concat strategy to improve\nfeature fusion and multi-scale context awareness for detecting tiny targets in\ndiverse environments. Our unique C2f-FCA block employs Faster Context Attention\nto enhance feature extraction while reducing computational complexity. The WIoU\nloss function is employed for improved bounding box regression. With seven\nmodel sizes ranging from Tiny to XL, EDNet accommodates various deployment\nenvironments, enabling local real-time inference and ensuring data privacy.\nNotably, EDNet achieves up to a 5.6% gain in mAP@50 with significantly fewer\nparameters. On an iPhone 12, EDNet variants operate at speeds ranging from 16\nto 55 FPS, providing a scalable and efficient solution for edge-based object\ndetection in challenging drone imagery. The source code and pre-trained models\nare available at: https://github.com/zsniko/EDNet.", "paper_summary_zh": "由於解析度低、背景複雜且場景動態，在無人機影像中偵測小型目標是一項挑戰。我們提出 EDNet，一個建構在增強的 YOLOv10 架構上的新型邊緣目標偵測架構，針對即時應用進行最佳化，無需後處理。EDNet 結合一個 XSmall 偵測頭和一個 Cross Concat 策略，以改善特徵融合和多尺度背景感知，用於在各種環境中偵測微小目標。我們獨特的 C2f-FCA 區塊採用 Faster Context Attention 來增強特徵萃取，同時降低運算複雜度。WIoU 損失函數用於改善邊界框回歸。EDNet 有七種型號尺寸，從 Tiny 到 XL，可適應各種部署環境，支援本地即時推論並確保資料隱私。值得注意的是，EDNet 在 mAP@50 中獲得高達 5.6% 的增益，而參數卻明顯減少。在 iPhone 12 上，EDNet 變體運作速度範圍從 16 到 55 FPS，為具挑戰性的無人機影像中的邊緣物件偵測提供可擴充且高效的解決方案。原始程式碼和預先訓練的模型可在 https://github.com/zsniko/EDNet 取得。", "author": "Zhifan Song et.al.", "authors": "Zhifan Song, Yuan Zhang, Abd Al Rahman M. Abu Ebayyeh", "id": "2501.05885v1", "paper_url": "http://arxiv.org/abs/2501.05885v1", "repo": "null"}}