{"2501.12521": {"publish_time": "2025-01-21", "title": "An Empirically-grounded tool for Automatic Prompt Linting and Repair: A Case Study on Bias, Vulnerability, and Optimization in Developer Prompts", "paper_summary": "The tidal wave of advancements in Large Language Models (LLMs) has led to\ntheir swift integration into application-level logic. Many software systems now\nuse prompts to interact with these black-box models, combining natural language\nwith dynamic values interpolated at runtime, to perform tasks ranging from\nsentiment analysis to question answering. Due to the programmatic and\nstructured natural language aspects of these prompts, we refer to them as\nDeveloper Prompts. Unlike traditional software artifacts, Dev Prompts blend\nnatural language instructions with artificial languages such as programming and\nmarkup languages, thus requiring specialized tools for analysis, distinct from\nclassical software evaluation methods.\n  In response to this need, we introduce PromptDoctor, a tool explicitly\ndesigned to detect and correct issues of Dev Prompts. PromptDoctor identifies\nand addresses problems related to bias, vulnerability, and sub-optimal\nperformance in Dev Prompts, helping mitigate their possible harms. In our\nanalysis of 2,173 Dev Prompts, selected as a representative sample of 40,573\nDev Prompts, we found that 3.46% contained one or more forms of bias, 10.75%\nwere vulnerable to prompt injection attacks. Additionally, 3,310 were amenable\nto automated prompt optimization. To address these issues, we applied\nPromptDoctor to the flawed Dev Prompts we discovered. PromptDoctor de-biased\n68.29% of the biased Dev Prompts, hardened 41.81% of the vulnerable Dev\nPrompts, and improved the performance of 37.1% sub-optimal Dev Prompts.\nFinally, we developed a PromptDoctor VSCode extension, enabling developers to\neasily enhance Dev Prompts in their existing development workflows. The data\nand source code for this work are available at", "paper_summary_zh": "大型語言模型 (LLM) 的進展浪潮導致它們迅速整合到應用程式層級邏輯中。許多軟體系統現在使用提示與這些黑盒模型互動，結合自然語言與執行時內插的動態值，以執行從情緒分析到問題解答的各種任務。由於這些提示具有程式化和結構化的自然語言方面，我們將它們稱為開發人員提示。與傳統軟體人工製品不同，開發人員提示將自然語言指令與人工語言（例如程式設計和標記語言）混合在一起，因此需要專門的分析工具，不同於傳統的軟體評估方法。\n為了滿足這個需求，我們引入了 PromptDoctor，這是一個專門設計用於偵測和修正開發人員提示問題的工具。PromptDoctor 識別並解決與開發人員提示中的偏差、漏洞和次佳效能相關的問題，有助於減輕其可能的危害。在我們對 2,173 個開發人員提示的分析中，這些提示被選為 40,573 個開發人員提示的代表性樣本，我們發現 3.46% 包含一種或多種形式的偏差，10.75% 容易受到提示注入攻擊。此外，3,310 個提示可以進行自動化提示最佳化。為了解決這些問題，我們將 PromptDoctor 應用於我們發現的錯誤開發人員提示。PromptDoctor 消除了 68.29% 有偏差的開發人員提示的偏差，強化了 41.81% 容易受到攻擊的開發人員提示，並改善了 37.1% 次佳開發人員提示的效能。最後，我們開發了一個 PromptDoctor VSCode 擴充功能，讓開發人員可以輕鬆地在現有的開發工作流程中增強開發人員提示。這項工作的資料和原始碼可在", "author": "Dhia Elhaq Rzig et.al.", "authors": "Dhia Elhaq Rzig, Dhruba Jyoti Paul, Kaiser Pister, Jordan Henkel, Foyzul Hassan", "id": "2501.12521v1", "paper_url": "http://arxiv.org/abs/2501.12521v1", "repo": "null"}}