{"2405.11816": {"publish_time": "2024-05-20", "title": "Transfer Learning for CSI-based Positioning with Multi-environment Meta-learning", "paper_summary": "Utilizing deep learning (DL) techniques for radio-based positioning of user\nequipment (UE) through channel state information (CSI) fingerprints has\ndemonstrated significant potential. DL models can extract complex\ncharacteristics from the CSI fingerprints of a particular environment and\naccurately predict the position of a UE. Nonetheless, the effectiveness of the\nDL model trained on CSI fingerprints is highly dependent on the particular\ntraining environment, limiting the trained model's applicability across\ndifferent environments. This paper proposes a novel DL model structure\nconsisting of two parts, where the first part aims at identifying features that\nare independent from any specific environment, while the second part combines\nthose features in an environment specific way with the goal of positioning. To\ntrain such a two-part model, we propose the multi-environment meta-learning\n(MEML) approach for the first part to facilitate training across various\nenvironments, while the second part of the model is trained solely on data from\na specific environment. Our findings indicate that employing the MEML approach\nfor initializing the weights of the DL model for a new unseen environment\nsignificantly boosts the accuracy of UE positioning in the new target\nenvironment as well the reliability of its uncertainty estimation. This method\noutperforms traditional transfer learning methods, whether direct transfer\nlearning (DTL) between environments or completely training from scratch with\ndata from a new environment. The proposed approach is verified with real\nmeasurements for both line-of-sight (LOS) and non-LOS (NLOS) environments.", "paper_summary_zh": "利用深度學習（DL）技術透過信道狀態資訊（CSI）指紋進行無線電定位的使用者端設備（UE），已展現出顯著的潛力。DL 模型可以從特定環境的 CSI 指紋中萃取出複雜的特徵，並準確預測 UE 的位置。儘管如此，在 CSI 指紋上訓練的 DL 模型的有效性高度依賴於特定的訓練環境，這限制了訓練模型在不同環境中的適用性。本文提出了一個新穎的 DL 模型結構，由兩部分組成，其中第一部分旨在識別獨立於任何特定環境的特徵，而第二部分則以環境特定方式結合這些特徵，以定位為目標。為了訓練這樣的兩部分模型，我們提出了多環境元學習（MEML）方法，用於第一部分，以促進在各種環境中進行訓練，而模型的第二部分僅在來自特定環境的資料上進行訓練。我們的研究結果表明，採用 MEML 方法來初始化 DL 模型的權重，以適應新的未知環境，顯著提高了在新的目標環境中 UE 定位的準確性，以及其不確定性估計的可靠性。此方法優於傳統的遷移學習方法，無論是在環境之間的直接遷移學習（DTL），或完全從新環境的資料中從頭開始訓練。所提出的方法已透過實際測量，驗證了適用於視線（LOS）和非視線（NLOS）環境。", "author": "Anastasios Foliadis et.al.", "authors": "Anastasios Foliadis, Mario H. Castañeda, Richard A. Stirling-Gallacher, Reiner S. Thomä", "id": "2405.11816v1", "paper_url": "http://arxiv.org/abs/2405.11816v1", "repo": "null"}}