{"2502.11771": {"publish_time": "2025-02-17", "title": "The Validation Gap: A Mechanistic Analysis of How Language Models Compute Arithmetic but Fail to Validate It", "paper_summary": "The ability of large language models (LLMs) to validate their output and\nidentify potential errors is crucial for ensuring robustness and reliability.\nHowever, current research indicates that LLMs struggle with self-correction,\nencountering significant challenges in detecting errors. While studies have\nexplored methods to enhance self-correction in LLMs, relatively little\nattention has been given to understanding the models' internal mechanisms\nunderlying error detection. In this paper, we present a mechanistic analysis of\nerror detection in LLMs, focusing on simple arithmetic problems. Through\ncircuit analysis, we identify the computational subgraphs responsible for\ndetecting arithmetic errors across four smaller-sized LLMs. Our findings reveal\nthat all models heavily rely on $\\textit{consistency heads}$--attention heads\nthat assess surface-level alignment of numerical values in arithmetic\nsolutions. Moreover, we observe that the models' internal arithmetic\ncomputation primarily occurs in higher layers, whereas validation takes place\nin middle layers, before the final arithmetic results are fully encoded. This\nstructural dissociation between arithmetic computation and validation seems to\nexplain why current LLMs struggle to detect even simple arithmetic errors.", "paper_summary_zh": "大型語言模型 (LLM) 驗證其輸出並識別潛在錯誤的能力對於確保穩健性和可靠性至關重要。\n然而，目前的研究所示，LLM 難以進行自我修正，在檢測錯誤時遇到重大挑戰。儘管研究已探討增強 LLM 自我修正的方法，但對於瞭解模型內部錯誤檢測機制卻關注較少。在本文中，我們提出對 LLM 中錯誤檢測的機制分析，重點關注簡單的算術問題。通過電路分析，我們識別出負責檢測四個較小規模 LLM 中算術錯誤的計算子圖。我們的研究結果表明，所有模型都嚴重依賴於「一致性頭部」--注意頭部，用於評估算術解中數值表面的對齊方式。此外，我們觀察到模型的內部算術運算主要發生在較高層，而驗證則發生在中間層，在最終算術結果完全編碼之前。算術運算和驗證之間的這種結構性分離似乎解釋了為什麼當前的 LLM 難以檢測到即使是簡單的算術錯誤。", "author": "Leonardo Bertolazzi et.al.", "authors": "Leonardo Bertolazzi, Philipp Mondorf, Barbara Plank, Raffaella Bernardi", "id": "2502.11771v1", "paper_url": "http://arxiv.org/abs/2502.11771v1", "repo": "null"}}