{"2410.13726": {"publish_time": "2024-10-17", "title": "DAWN: Dynamic Frame Avatar with Non-autoregressive Diffusion Framework for Talking Head Video Generation", "paper_summary": "Talking head generation intends to produce vivid and realistic talking head\nvideos from a single portrait and speech audio clip. Although significant\nprogress has been made in diffusion-based talking head generation, almost all\nmethods rely on autoregressive strategies, which suffer from limited context\nutilization beyond the current generation step, error accumulation, and slower\ngeneration speed. To address these challenges, we present DAWN (Dynamic frame\nAvatar With Non-autoregressive diffusion), a framework that enables all-at-once\ngeneration of dynamic-length video sequences. Specifically, it consists of two\nmain components: (1) audio-driven holistic facial dynamics generation in the\nlatent motion space, and (2) audio-driven head pose and blink generation.\nExtensive experiments demonstrate that our method generates authentic and vivid\nvideos with precise lip motions, and natural pose/blink movements.\nAdditionally, with a high generation speed, DAWN possesses strong extrapolation\ncapabilities, ensuring the stable production of high-quality long videos. These\nresults highlight the considerable promise and potential impact of DAWN in the\nfield of talking head video generation. Furthermore, we hope that DAWN sparks\nfurther exploration of non-autoregressive approaches in diffusion models. Our\ncode will be publicly available at https://github.com/Hanbo-Cheng/DAWN-pytorch.", "paper_summary_zh": "對話頭像生成旨在從單一肖像和語音音訊剪輯中產生生動且逼真的對話頭像影片。儘管基於擴散的對話頭像生成已取得顯著進展，但幾乎所有方法都依賴於自迴歸策略，這會導致受限的內容利用（超出當前生成步驟、錯誤累積和較慢的生成速度）。為了應對這些挑戰，我們提出了 DAWN（非自迴歸擴散動態框架頭像），一個能一次生成動態長度影片序列的框架。具體來說，它包含兩個主要組成部分：（1）在潛在運動空間中進行音訊驅動的整體面部動態生成，以及（2）音訊驅動的頭部姿勢和眨眼生成。廣泛的實驗證明，我們的方法能生成具有精確唇部動作和自然姿勢/眨眼動作的真實且生動的影片。此外，DAWN 具有高速生成，具備強大的外推能力，確保穩定產生高品質的長影片。這些結果突顯了 DAWN 在對話頭像影片生成領域中相當有前景和潛在影響力。此外，我們希望 DAWN 能激發進一步探索擴散模型中的非自迴歸方法。我們的程式碼將於 https://github.com/Hanbo-Cheng/DAWN-pytorch 公開。", "author": "Hanbo Cheng et.al.", "authors": "Hanbo Cheng, Limin Lin, Chenyu Liu, Pengcheng Xia, Pengfei Hu, Jiefeng Ma, Jun Du, Jia Pan", "id": "2410.13726v2", "paper_url": "http://arxiv.org/abs/2410.13726v2", "repo": "https://github.com/hanbo-cheng/dawn-pytorch"}}