{"2411.19652": {"publish_time": "2024-11-29", "title": "Uniform Attention Maps: Boosting Image Fidelity in Reconstruction and Editing", "paper_summary": "Text-guided image generation and editing using diffusion models have achieved\nremarkable advancements. Among these, tuning-free methods have gained attention\nfor their ability to perform edits without extensive model adjustments,\noffering simplicity and efficiency. However, existing tuning-free approaches\noften struggle with balancing fidelity and editing precision. Reconstruction\nerrors in DDIM Inversion are partly attributed to the cross-attention mechanism\nin U-Net, which introduces misalignments during the inversion and\nreconstruction process. To address this, we analyze reconstruction from a\nstructural perspective and propose a novel approach that replaces traditional\ncross-attention with uniform attention maps, significantly enhancing image\nreconstruction fidelity. Our method effectively minimizes distortions caused by\nvarying text conditions during noise prediction. To complement this\nimprovement, we introduce an adaptive mask-guided editing technique that\nintegrates seamlessly with our reconstruction approach, ensuring consistency\nand accuracy in editing tasks. Experimental results demonstrate that our\napproach not only excels in achieving high-fidelity image reconstruction but\nalso performs robustly in real image composition and editing scenarios. This\nstudy underscores the potential of uniform attention maps to enhance the\nfidelity and versatility of diffusion-based image processing methods. Code is\navailable at https://github.com/Mowenyii/Uniform-Attention-Maps.", "paper_summary_zh": "文本引导的图像生成和编辑使用扩散模型已取得显著进展。其中，无调优方法因其无需大量模型调整即可执行编辑的能力而备受关注，提供了简单性和效率。然而，现有的无调优方法通常难以平衡保真度和编辑精度。DDIM 反演中的重建误差部分归因于 U-Net 中的交叉注意力机制，该机制在反演和重建过程中引入了错位。为了解决这个问题，我们从结构的角度分析重建，并提出了一种新颖的方法，用统一的注意力图替换传统的交叉注意力，显著提高了图像重建保真度。我们的方法有效地最小化了噪声预测过程中不同文本条件引起的失真。为了补充这一改进，我们引入了一种自适应遮罩引导编辑技术，该技术与我们的重建方法无缝集成，确保了编辑任务的一致性和准确性。实验结果表明，我们的方法不仅在实现高保真图像重建方面表现出色，而且在真实图像合成和编辑场景中也表现得很稳健。本研究强调了统一注意力图在增强基于扩散的图像处理方法的保真度和多功能性方面的潜力。代码可在 https://github.com/Mowenyii/Uniform-Attention-Maps 获得。", "author": "Wenyi Mo et.al.", "authors": "Wenyi Mo, Tianyu Zhang, Yalong Bai, Bing Su, Ji-Rong Wen", "id": "2411.19652v1", "paper_url": "http://arxiv.org/abs/2411.19652v1", "repo": "https://github.com/mowenyii/uniform-attention-maps"}}