{"2410.04731": {"publish_time": "2024-10-07", "title": "Efficient transformer with reinforced position embedding for language models", "paper_summary": "In this paper, we propose an efficient transformer architecture that uses\nreinforced positional embedding to obtain superior performance with half the\nnumber of encoder decoder layers. We demonstrate that concatenating positional\nencoding with trainable token embeddings, normalizing columns in the token\nembedding matrix, and using the normalized token embedding matrix as the value\nof the attention layer improve the training and validation loss and the\ntraining time in an encoder-decoder Transformer model for a Portuguese-English\ntranslation task with 10 epochs or 12 hours of training across 10 trials. Our\nmethod, with roughly a threefold parameter reduction compared to the baseline\nmodel, yields a mean training loss of 1.21, a mean validation loss of 1.51, and\nan average training time of 1352.27 seconds per epoch, surpassing the baseline\nmodel with the same embedding dimension that employs addition of positional\nencoding and token embeddings, which achieves a mean training loss of 1.96, a\nvalidation loss of 2.18, and an average training time of 4297.79 seconds per\nepoch. Additionally, we evaluated our proposed architecture and the baseline\nacross 14 diverse translation datasets from TensorFlow. The results indicate\nthat our method consistently achieves lower or comparable training and\nvalidation losses, suggesting enhanced learning efficiency.", "paper_summary_zh": "<paragraph>在本文中，我們提出了一種高效的 Transformer 架構，它使用增強的位置嵌入，以使用編碼器解碼器層的一半來獲得更好的性能。我們證明了將位置編碼與可訓練的令牌嵌入串聯、對令牌嵌入矩陣中的列進行正規化以及使用正規化的令牌嵌入矩陣作為注意力層的值，可以改善編碼器-解碼器 Transformer 模型的訓練和驗證損失以及訓練時間，用於葡萄牙語-英語翻譯任務，在 10 次試驗中進行了 10 個時期或 12 小時的訓練。與基線模型相比，我們的模型將參數減少了大約三分之一，平均訓練損失為 1.21，平均驗證損失為 1.51，平均訓練時間為每個時期 1352.27 秒，超過了採用位置編碼和令牌嵌入相加的相同嵌入維度的基線模型，後者實現了 1.96 的平均訓練損失、2.18 的驗證損失以及每個時期 4297.79 秒的平均訓練時間。此外，我們在 TensorFlow 的 14 個不同的翻譯數據集中評估了我們提出的架構和基線。結果表明，我們的模型始終實現更低或相當的訓練和驗證損失，這表明增強的學習效率。</paragraph>", "author": "Yen-Che Hsiao et.al.", "authors": "Yen-Che Hsiao, Abhishek Dutta", "id": "2410.04731v1", "paper_url": "http://arxiv.org/abs/2410.04731v1", "repo": "null"}}