{"2408.08531": {"publish_time": "2024-08-16", "title": "Detecting Unsuccessful Students in Cybersecurity Exercises in Two Different Learning Environments", "paper_summary": "This full paper in the research track evaluates the usage of data logged from\ncybersecurity exercises in order to predict students who are potentially at\nrisk of performing poorly. Hands-on exercises are essential for learning since\nthey enable students to practice their skills. In cybersecurity, hands-on\nexercises are often complex and require knowledge of many topics. Therefore,\nstudents may miss solutions due to gaps in their knowledge and become\nfrustrated, which impedes their learning. Targeted aid by the instructor helps,\nbut since the instructor's time is limited, efficient ways to detect struggling\nstudents are needed. This paper develops automated tools to predict when a\nstudent is having difficulty. We formed a dataset with the actions of 313\nstudents from two countries and two learning environments: KYPO CRP and\nEDURange. These data are used in machine learning algorithms to predict the\nsuccess of students in exercises deployed in these environments. After\nextracting features from the data, we trained and cross-validated eight\nclassifiers for predicting the exercise outcome and evaluated their predictive\npower. The contribution of this paper is comparing two approaches to feature\nengineering, modeling, and classification performance on data from two learning\nenvironments. Using the features from either learning environment, we were able\nto detect and distinguish between successful and struggling students. A\ndecision tree classifier achieved the highest balanced accuracy and sensitivity\nwith data from both learning environments. The results show that activity data\nfrom cybersecurity exercises are suitable for predicting student success. In a\npotential application, such models can aid instructors in detecting struggling\nstudents and providing targeted help. We publish data and code for building\nthese models so that others can adopt or adapt them.", "paper_summary_zh": "<paragraph>這篇研究軌跡的完整論文評估了從網路安全練習中記錄的資料的使用，以預測潛在表現不佳的學生。動手練習對學習至關重要，因為它們能讓學生練習他們的技能。在網路安全中，動手練習通常很複雜，需要了解許多主題。因此，學生可能會因為知識上的差距而錯失解決方案，並感到沮喪，這會阻礙他們的學習。指導員的目標協助有幫助，但由於指導員的時間有限，因此需要有效的方法來找出有困難的學生。本文開發了自動化工具來預測學生何時遇到困難。我們從兩個國家和兩個學習環境（KYPO CRP 和 EDURange）的 313 名學生的行為中形成了一個資料集。這些資料用於機器學習演算法，以預測這些環境中部署的練習中學生的成功。從資料中提取特徵後，我們訓練並交叉驗證了八個分類器，以預測練習結果，並評估它們的預測能力。本文的貢獻是比較兩種特徵工程、建模和分類效能的方法，這些方法來自兩個學習環境的資料。使用來自任何學習環境的特徵，我們能夠檢測並區分成功的學生和有困難的學生。一個決策樹分類器在來自兩個學習環境的資料中達到了最高的平衡準確度和敏感度。結果表明，來自網路安全練習的活動資料適用於預測學生的成功。在潛在的應用中，此類模型可以幫助指導員檢測有困難的學生並提供目標協助。我們發布了用於建立這些模型的資料和程式碼，以便其他人可以採用或調整它們。</paragraph>", "author": "Valdemar Švábenský et.al.", "authors": "Valdemar Švábenský, Kristián Tkáčik, Aubrey Birdwell, Richard Weiss, Ryan S. Baker, Pavel Čeleda, Jan Vykopal, Jens Mache, Ankur Chattopadhyay", "id": "2408.08531v1", "paper_url": "http://arxiv.org/abs/2408.08531v1", "repo": "null"}}