{"2406.04638": {"publish_time": "2024-06-07", "title": "Large Language Model-guided Document Selection", "paper_summary": "Large Language Model (LLM) pre-training exhausts an ever growing compute\nbudget, yet recent research has demonstrated that careful document selection\nenables comparable model quality with only a fraction of the FLOPs. Inspired by\nefforts suggesting that domain-specific training document selection is in fact\nan interpretable process [Gunasekar et al., 2023], as well as research showing\nthat instruction-finetuned LLMs are adept zero-shot data labelers [Gilardi et\nal.,2023], we explore a promising direction for scalable general-domain\ndocument selection; employing a prompted LLM as a document grader, we distill\nquality labels into a classifier model, which is applied at scale to a large,\nand already heavily-filtered, web-crawl-derived corpus autonomously. Following\nthe guidance of this classifier, we drop 75% of the corpus and train LLMs on\nthe remaining data. Results across multiple benchmarks show that: 1. Filtering\nallows us to quality-match a model trained on the full corpus across diverse\nbenchmarks with at most 70% of the FLOPs, 2. More capable LLM labelers and\nclassifier models lead to better results that are less sensitive to the\nlabeler's prompt, 3. In-context learning helps to boost the performance of\nless-capable labeling models. In all cases we use open-source datasets, models,\nrecipes, and evaluation frameworks, so that results can be reproduced by the\ncommunity.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 預訓練耗盡了不斷增長的運算預算，但最近的研究表明，仔細的文件選取僅需一小部分 FLOP 就能實現相當的模型品質。受到以下努力的啟發：建議特定領域訓練文件選取實際上是一個可詮釋的過程 [Gunasekar 等人，2023]，以及研究表明經過指令微調的 LLM 是熟練的零次資料標籤器 [Gilardi 等人，2023]，我們探索了一個有望用於可擴充一般領域文件選取的方向；使用提示式 LLM 作為文件評分員，我們將品質標籤提煉成一個分類器模型，大規模應用於一個大型且經過大量篩選的網路爬取衍生語料庫中，而且是自動化的。遵循這個分類器的指導，我們捨棄了語料庫的 75%，並使用剩餘的資料訓練 LLM。多個基準測試的結果顯示：1. 透過篩選，我們能夠在最多 70% 的 FLOP 中，針對不同基準測試比對訓練完整語料庫的模型品質，2. 更有能力的 LLM 標籤器和分類器模型會產生更好的結果，且這些結果對標籤器的提示較不敏感，3. 情境學習有助於提升較不具備能力的標籤模型的效能。在所有情況下，我們都使用開源資料集、模型、範例和評估架構，以便社群可以複製結果。</paragraph>", "author": "Xiang Kong et.al.", "authors": "Xiang Kong, Tom Gunter, Ruoming Pang", "id": "2406.04638v1", "paper_url": "http://arxiv.org/abs/2406.04638v1", "repo": "null"}}