{"2501.14120": {"publish_time": "2025-01-23", "title": "On the Transfer of Knowledge in Quantum Algorithms", "paper_summary": "The field of quantum computing is generating significant anticipation within\nthe scientific and industrial communities due to its potential to revolutionize\ncomputing paradigms. Recognizing this potential, this paper explores the\nintegration of transfer of knowledge techniques, traditionally used in\nclassical artificial intelligence, into quantum computing. We present a\ncomprehensive classification of the transfer models, focusing on Transfer\nLearning and Transfer Optimization. Additionally, we analyze relevant schemes\nin quantum computing that can benefit from knowledge sharing, and we delve into\nthe potential synergies, supported by theoretical insights and initial\nexperimental results. Our findings suggest that leveraging the transfer of\nknowledge can enhance the efficiency and effectiveness of quantum algorithms,\nparticularly in the context of hybrid solvers. This approach not only\naccelerates the optimization process but also reduces the computational burden\non quantum processors, making it a valuable tool for advancing quantum\ncomputing technologies.", "paper_summary_zh": "量子運算領域在科學和產業界中產生了重大的期待，因為它有潛力革新運算模式。為了了解這種潛力，本文探討了將知識傳輸技術（傳統上用於古典人工智慧）整合到量子運算中的方法。我們提出了傳輸模型的全面分類，重點在於遷移學習和遷移最佳化。此外，我們分析了量子運算中可以從知識共享中受益的相关方案，並深入探討了由理論見解和初步實驗結果支持的潛在協同效應。我們的研究結果表明，利用知識傳輸可以提高量子演算法的效率和效能，特別是在混合求解器的背景下。這種方法不僅加速了最佳化流程，還減輕了量子處理器的運算負擔，使其成為推進量子運算技術的寶貴工具。", "author": "Esther Villar-Rodriguez et.al.", "authors": "Esther Villar-Rodriguez, Eneko Osaba, Izaskun Oregi, Sebastián V. Romero, Julián Ferreiro-Vélez", "id": "2501.14120v1", "paper_url": "http://arxiv.org/abs/2501.14120v1", "repo": "null"}}