{"2404.19729": {"publish_time": "2024-04-30", "title": "A Framework for Leveraging Human Computation Gaming to Enhance Knowledge Graphs for Accuracy Critical Generative AI Applications", "paper_summary": "External knowledge graphs (KGs) can be used to augment large language models\n(LLMs), while simultaneously providing an explainable knowledge base of facts\nthat can be inspected by a human. This approach may be particularly valuable in\ndomains where explainability is critical, like human trafficking data analysis.\nHowever, creating KGs can pose challenges. KGs parsed from documents may\ncomprise explicit connections (those directly stated by a document) but miss\nimplicit connections (those obvious to a human although not directly stated).\nTo address these challenges, this preliminary research introduces the GAME-KG\nframework, standing for \"Gaming for Augmenting Metadata and Enhancing Knowledge\nGraphs.\" GAME-KG is a federated approach to modifying explicit as well as\nimplicit connections in KGs by using crowdsourced feedback collected through\nvideo games. GAME-KG is shown through two demonstrations: a Unity test scenario\nfrom Dark Shadows, a video game that collects feedback on KGs parsed from US\nDepartment of Justice (DOJ) Press Releases on human trafficking, and a\nfollowing experiment where OpenAI's GPT-4 is prompted to answer questions based\non a modified and unmodified KG. Initial results suggest that GAME-KG can be an\neffective framework for enhancing KGs, while simultaneously providing an\nexplainable set of structured facts verified by humans.", "paper_summary_zh": "外部知識圖譜 (KG) 可用於擴充大型語言模型 (LLM)，同時提供人類可以檢視的事實可解釋知識庫。這種方法在可解釋性至關重要的領域中特別有價值，例如人口販運資料分析。然而，建立 KG 可能會帶來挑戰。從文件中解析的 KG 可能包含明確的連接（文件中直接陳述的連接），但會遺漏隱含的連接（對人類來說很明顯，但並未直接陳述）。為了應對這些挑戰，這項初步研究引入了 GAME-KG 架構，代表「透過遊戲擴充元資料並增強知識圖譜」。GAME-KG 是一種透過使用透過電玩遊戲收集的外包意見來修改 KG 中明確和隱含連接的聯合方法。GAME-KG 透過兩個示範說明：一個來自黑暗陰影的 Unity 測試場景，這是一款收集美國司法部 (DOJ) 人口販運新聞稿中解析的 KG 回饋的電玩遊戲，以及後續的實驗，其中提示 OpenAI 的 GPT-4 根據已修改和未修改的 KG 回答問題。初步結果表明，GAME-KG 可以成為增強 KG 的有效架構，同時提供人類驗證的可解釋結構化事實集。", "author": "Steph Buongiorno et.al.", "authors": "Steph Buongiorno, Corey Clark", "id": "2404.19729v1", "paper_url": "http://arxiv.org/abs/2404.19729v1", "repo": "null"}}