{"2407.08639": {"publish_time": "2024-07-11", "title": "$β$-DPO: Direct Preference Optimization with Dynamic $β$", "paper_summary": "Direct Preference Optimization (DPO) has emerged as a compelling approach for\ntraining Large Language Models (LLMs) to adhere to human preferences. However,\nthe performance of DPO is sensitive to the fine-tuning of its trade-off\nparameter $\\beta$, as well as to the quality of the preference data. We analyze\nthe impact of $\\beta$ and data quality on DPO, uncovering that optimal $\\beta$\nvalues vary with the informativeness of pairwise data. Addressing the\nlimitations of static $\\beta$ values, we introduce a novel framework that\ndynamically calibrates $\\beta$ at the batch level, informed by data quality\nconsiderations. Additionally, our method incorporates $\\beta$-guided data\nfiltering to safeguard against the influence of outliers. Through empirical\nevaluation, we demonstrate that our dynamic $\\beta$ adjustment technique\nsignificantly improves DPO's performance across a range of models and datasets,\noffering a more robust and adaptable training paradigm for aligning LLMs with\nhuman feedback. The code is available at\n\\url{https://github.com/junkangwu/beta-DPO}.", "paper_summary_zh": "直接偏好最佳化 (DPO) 已成為訓練大型語言模型 (LLM) 以符合人類偏好的引人注目的方法。然而，DPO 的效能對其折衷參數 $\\beta$ 的微調以及偏好資料的品質很敏感。我們分析了 $\\beta$ 和資料品質對 DPO 的影響，發現最佳 $\\beta$ 值會隨著成對資料的資訊量而有所不同。針對靜態 $\\beta$ 值的限制，我們引入了在批次層級動態校準 $\\beta$ 的新穎架構，並根據資料品質考量提供資訊。此外，我們的技術結合了 $\\beta$ 引導資料過濾，以防止異常值的影響。透過實證評估，我們證明了我們的動態 $\\beta$ 調整技術大幅改善了 DPO 在各種模型和資料集上的效能，為與人類回饋對齊 LLM 提供了更穩健且適應性更強的訓練範例。程式碼可在\n\\url{https://github.com/junkangwu/beta-DPO} 取得。", "author": "Junkang Wu et.al.", "authors": "Junkang Wu, Yuexiang Xie, Zhengyi Yang, Jiancan Wu, Jinyang Gao, Bolin Ding, Xiang Wang, Xiangnan He", "id": "2407.08639v1", "paper_url": "http://arxiv.org/abs/2407.08639v1", "repo": "https://github.com/junkangwu/beta-dpo"}}