{"2502.05282": {"publish_time": "2025-02-07", "title": "Homeomorphism Prior for False Positive and Negative Problem in Medical Image Dense Contrastive Representation Learning", "paper_summary": "Dense contrastive representation learning (DCRL) has greatly improved the\nlearning efficiency for image-dense prediction tasks, showing its great\npotential to reduce the large costs of medical image collection and dense\nannotation. However, the properties of medical images make unreliable\ncorrespondence discovery, bringing an open problem of large-scale false\npositive and negative (FP&N) pairs in DCRL. In this paper, we propose GEoMetric\nvIsual deNse sImilarity (GEMINI) learning which embeds the homeomorphism prior\nto DCRL and enables a reliable correspondence discovery for effective dense\ncontrast. We propose a deformable homeomorphism learning (DHL) which models the\nhomeomorphism of medical images and learns to estimate a deformable mapping to\npredict the pixels' correspondence under topological preservation. It\neffectively reduces the searching space of pairing and drives an implicit and\nsoft learning of negative pairs via a gradient. We also propose a geometric\nsemantic similarity (GSS) which extracts semantic information in features to\nmeasure the alignment degree for the correspondence learning. It will promote\nthe learning efficiency and performance of deformation, constructing positive\npairs reliably. We implement two practical variants on two typical\nrepresentation learning tasks in our experiments. Our promising results on\nseven datasets which outperform the existing methods show our great\nsuperiority. We will release our code on a companion link:\nhttps://github.com/YutingHe-list/GEMINI.", "paper_summary_zh": "密集对比表征学习（DCRL）极大地提高了影像密集预测任务的学习效率，显示出其在降低医学影像收集和密集标注的大量成本方面的巨大潜力。然而，医学影像的特性使得对应关系发现不可靠，给 DCRL 带来大规模假阳性和假阴性（FP&N）对的开放性问题。在本文中，我们提出了 GEoMetric vIsual deNse sImilarity（GEMINI）学习，它将同胚先验嵌入 DCRL 中，并针对有效密集对比提供了可靠的对应关系发现。我们提出了一种可变形同胚学习（DHL），它对医学影像的同胚进行建模，并学习估计可变形映射，以预测在拓扑保持下的像素对应关系。它有效地减少了配对的搜索空间，并通过梯度驱动了负对的隐式和软学习。我们还提出了几何语义相似性（GSS），它提取特征中的语义信息，以测量对应关系学习的对齐度。它将促进变形学习的效率和性能，可靠地构建正对。我们在实验中针对两个典型的表征学习任务实现了两个实际变体。我们在七个数据集上的有希望的结果优于现有方法，显示出我们的巨大优势。我们将在配套链接中发布我们的代码：https://github.com/YutingHe-list/GEMINI。", "author": "Yuting He et.al.", "authors": "Yuting He, Boyu Wang, Rongjun Ge, Yang Chen, Guanyu Yang, Shuo Li", "id": "2502.05282v1", "paper_url": "http://arxiv.org/abs/2502.05282v1", "repo": "null"}}