{"2501.14079": {"publish_time": "2025-01-23", "title": "Enhancing Biomedical Relation Extraction with Directionality", "paper_summary": "Biological relation networks contain rich information for understanding the\nbiological mechanisms behind the relationship of entities such as genes,\nproteins, diseases, and chemicals. The vast growth of biomedical literature\nposes significant challenges updating the network knowledge. The recent\nBiomedical Relation Extraction Dataset (BioRED) provides valuable manual\nannotations, facilitating the develop-ment of machine-learning and pre-trained\nlanguage model approaches for automatically identifying novel document-level\n(inter-sentence context) relationships. Nonetheless, its annotations lack\ndirectionality (subject/object) for the entity roles, essential for studying\ncomplex biological networks. Herein we annotate the entity roles of the\nrelationships in the BioRED corpus and subsequently propose a novel multi-task\nlanguage model with soft-prompt learning to jointly identify the relationship,\nnovel findings, and entity roles. Our results in-clude an enriched BioRED\ncorpus with 10,864 directionality annotations. Moreover, our proposed method\noutperforms existing large language models such as the state-of-the-art GPT-4\nand Llama-3 on two benchmarking tasks. Our source code and dataset are\navailable at https://github.com/ncbi-nlp/BioREDirect.", "paper_summary_zh": "生物關係網路包含豐富的資訊，用於了解基因、蛋白質、疾病和化學物質等實體關係背後的生物機制。生物醫學文獻的快速成長對更新網路知識構成重大挑戰。最近的生物醫學關係萃取資料集 (BioRED) 提供了有價值的手動註解，促進了機器學習和預先訓練語言模型方法的發展，用於自動識別新的文件層級（句子間脈絡）關係。儘管如此，其註解缺乏實體角色的方向性（主詞/受詞），這對於研究複雜的生物網路至關重要。在此，我們註解了 BioRED 語料庫中關係的實體角色，並隨後提出了一個新穎的多任務語言模型，採用軟提示學習來聯合識別關係、新發現和實體角色。我們的結果包括一個豐富的 BioRED 語料庫，其中包含 10,864 個方向性註解。此外，我們提出的方法優於現有的大型語言模型，例如最先進的 GPT-4 和 Llama-3，在兩個基準任務上。我們的原始碼和資料集可在 https://github.com/ncbi-nlp/BioREDirect 取得。", "author": "Po-Ting Lai et.al.", "authors": "Po-Ting Lai, Chih-Hsuan Wei, Shubo Tian, Robert Leaman, Zhiyong Lu", "id": "2501.14079v1", "paper_url": "http://arxiv.org/abs/2501.14079v1", "repo": "https://github.com/ncbi-nlp/bioredirect"}}