{"2411.14717": {"publish_time": "2024-11-22", "title": "FedMLLM: Federated Fine-tuning MLLM on Multimodal Heterogeneity Data", "paper_summary": "Multimodal Large Language Models (MLLMs) have made significant advancements,\ndemonstrating powerful capabilities in processing and understanding multimodal\ndata. Fine-tuning MLLMs with Federated Learning (FL) allows for expanding the\ntraining data scope by including private data sources, thereby enhancing their\npractical applicability in privacy-sensitive domains. However, current research\nremains in the early stage, particularly in addressing the \\textbf{multimodal\nheterogeneities} in real-world applications. In this paper, we introduce a\nbenchmark for evaluating various downstream tasks in the federated fine-tuning\nof MLLMs within multimodal heterogeneous scenarios, laying the groundwork for\nthe research in the field. Our benchmark encompasses two datasets, five\ncomparison baselines, and four multimodal scenarios, incorporating over ten\ntypes of modal heterogeneities. To address the challenges posed by modal\nheterogeneity, we develop a general FedMLLM framework that integrates four\nrepresentative FL methods alongside two modality-agnostic strategies. Extensive\nexperimental results show that our proposed FL paradigm improves the\nperformance of MLLMs by broadening the range of training data and mitigating\nmultimodal heterogeneity. Code is available at https://github.com/1xbq1/FedMLLM", "paper_summary_zh": "多模態大型語言模型 (MLLM) 已取得重大進展，在處理和理解多模態數據方面展現強大的能力。透過聯合學習 (FL) 微調 MLLM，可以透過納入私人資料來源來擴展訓練資料範圍，進而提升其在注重隱私的領域中的實用性。然而，目前的研​​究仍處於早期階段，特別是在處理實際應用中的「多模態異質性」方面。在本文中，我們介紹了一個基準，用於評估 MLLM 在多模態異質場景中進行聯合微調的各種下游任務，為該領域的研究奠定基礎。我們的基準包含兩個資料集、五個比較基準線和四個多模態場景，結合了十多種類型的模態異質性。為了應對模態異質性帶來的挑戰，我們開發了一個通用的 FedMLLM 框架，該框架整合了四種代表性的 FL 方法以及兩種與模態無關的策略。廣泛的實驗結果表明，我們提出的 FL 典範透過擴展訓練資料範圍和減輕多模態異質性來提升 MLLM 的效能。程式碼可在 https://github.com/1xbq1/FedMLLM 取得", "author": "Binqian Xu et.al.", "authors": "Binqian Xu, Xiangbo Shu, Haiyang Mei, Guosen Xie, Basura Fernando, Mike Zheng Shou, Jinhui Tang", "id": "2411.14717v1", "paper_url": "http://arxiv.org/abs/2411.14717v1", "repo": "https://github.com/1xbq1/fedmllm"}}