{"2503.13419": {"publish_time": "2025-03-17", "title": "Securing Virtual Reality Experiences: Unveiling and Tackling Cybersickness Attacks with Explainable AI", "paper_summary": "The synergy between virtual reality (VR) and artificial intelligence (AI),\nspecifically deep learning (DL)-based cybersickness detection models, has\nushered in unprecedented advancements in immersive experiences by automatically\ndetecting cybersickness severity and adaptively various mitigation techniques,\noffering a smooth and comfortable VR experience. While this DL-enabled\ncybersickness detection method provides promising solutions for enhancing user\nexperiences, it also introduces new risks since these models are vulnerable to\nadversarial attacks; a small perturbation of the input data that is visually\nundetectable to human observers can fool the cybersickness detection model and\ntrigger unexpected mitigation, thus disrupting user immersive experiences (UIX)\nand even posing safety risks. In this paper, we present a new type of VR\nattack, i.e., a cybersickness attack, which successfully stops the triggering\nof cybersickness mitigation by fooling DL-based cybersickness detection models\nand dramatically hinders the UIX. Next, we propose a novel explainable\nartificial intelligence (XAI)-guided cybersickness attack detection framework\nto detect such attacks in VR to ensure UIX and a comfortable VR experience. We\nevaluate the proposed attack and the detection framework using two\nstate-of-the-art open-source VR cybersickness datasets: Simulation 2021 and\nGameplay dataset. Finally, to verify the effectiveness of our proposed method,\nwe implement the attack and the XAI-based detection using a testbed with a\ncustom-built VR roller coaster simulation with an HTC Vive Pro Eye headset and\nperform a user study. Our study shows that such an attack can dramatically\nhinder the UIX. However, our proposed XAI-guided cybersickness attack detection\ncan successfully detect cybersickness attacks and trigger the proper\nmitigation, effectively reducing VR cybersickness.", "paper_summary_zh": "<paragraph>虛擬實境 (VR) 與人工智慧 (AI) 的協同作用，特別是基於深度學習 (DL) 的暈動症偵測模型，透過自動偵測暈動症的嚴重程度並自適應地調整各種緩解技術，為沉浸式體驗帶來了前所未有的進步，提供了流暢舒適的 VR 體驗。雖然這種基於深度學習的暈動症偵測方法為提升使用者體驗提供了有希望的解決方案，但它也帶來了新的風險，因為這些模型容易受到對抗性攻擊的影響；輸入數據的微小擾動，在視覺上人類觀察者無法察覺，卻可以欺騙暈動症偵測模型並觸發意外的緩解措施，從而破壞使用者沉浸式體驗 (UIX)，甚至造成安全風險。在本文中，我們提出了一種新型 VR 攻擊，即暈動症攻擊，它透過欺騙基於深度學習的暈動症偵測模型，成功阻止了暈動症緩解措施的觸發，並嚴重妨礙了 UIX。接下來，我們提出了一種新穎的可解釋人工智慧 (XAI) 引導的暈動症攻擊偵測框架，用於偵測 VR 中的此類攻擊，以確保 UIX 和舒適的 VR 體驗。我們使用兩個最先進的開源 VR 暈動症數據集：Simulation 2021 和 Gameplay 數據集，評估了所提出的攻擊和偵測框架。最後，為了驗證我們提出的方法的有效性，我們使用配備了 HTC Vive Pro Eye 頭戴式裝置的客製化 VR 雲霄飛車模擬測試平台，實施了攻擊和基於 XAI 的偵測，並進行了使用者研究。我們的研究表明，這種攻擊會嚴重妨礙 UIX。然而，我們提出的 XAI 引導的暈動症攻擊偵測可以成功偵測暈動症攻擊並觸發適當的緩解措施，有效減少 VR 暈動症。 </paragraph>\n", "author": "Ripan Kumar Kundu et.al.", "authors": "Ripan Kumar Kundu, Matthew Denton, Genova Mongalo, Prasad Calyam, Khaza Anuarul Hoque", "id": "2503.13419v1", "paper_url": "http://arxiv.org/abs/2503.13419v1", "repo": "null"}}