{"2410.22446": {"publish_time": "2024-10-29", "title": "Do Large Language Models Align with Core Mental Health Counseling Competencies?", "paper_summary": "The rapid evolution of Large Language Models (LLMs) offers promising\npotential to alleviate the global scarcity of mental health professionals.\nHowever, LLMs' alignment with essential mental health counseling competencies\nremains understudied. We introduce CounselingBench, a novel NCMHCE-based\nbenchmark evaluating LLMs across five key mental health counseling\ncompetencies. Testing 22 general-purpose and medical-finetuned LLMs, we find\nfrontier models exceed minimum thresholds but fall short of expert-level\nperformance, with significant variations: they excel in Intake, Assessment &\nDiagnosis yet struggle with Core Counseling Attributes and Professional\nPractice & Ethics. Medical LLMs surprisingly underperform generalist models\naccuracy-wise, while at the same time producing slightly higher-quality\njustifications but making more context-related errors. Our findings highlight\nthe complexities of developing AI systems for mental health counseling,\nparticularly for competencies requiring empathy and contextual understanding.\nWe found that frontier LLMs perform at a level exceeding the minimal required\nlevel of aptitude for all key mental health counseling competencies, but fall\nshort of expert-level performance, and that current medical LLMs do not\nsignificantly improve upon generalist models in mental health counseling\ncompetencies. This underscores the critical need for specialized, mental health\ncounseling-specific fine-tuned LLMs that rigorously aligns with core\ncompetencies combined with appropriate human supervision before any responsible\nreal-world deployment can be considered.", "paper_summary_zh": "大型語言模型 (LLM) 的快速發展，提供了緩解全球心理健康專業人員短缺的潛在希望。\n然而，LLM 與基本心理健康諮商能力的對齊程度，仍未獲得充分研究。我們引入了 CounselingBench，一個基於 NCMHCE 的新基準，用於評估 LLM 在五項關鍵心理健康諮商能力上的表現。我們測試了 22 個通用和醫學微調的 LLM，發現前沿模型超過了最低門檻，但未達到專家級別的表現，且差異顯著：它們在「攝取、評估和診斷」方面表現出色，但在「核心諮商屬性」和「專業實務和倫理」方面卻有困難。令人驚訝的是，醫療 LLM 在準確性方面表現不如通用模型，但同時產生的理由品質略高，但產生更多與脈絡相關的錯誤。我們的研究結果突出了為心理健康諮商開發 AI 系統的複雜性，特別是對於需要同理心和脈絡理解的能力。我們發現，前沿 LLM 的表現水平超過了所有關鍵心理健康諮商能力所需的最低能力水準，但未達到專家級別的表現，而且目前的醫療 LLM 並未顯著改善通用模型在心理健康諮商能力上的表現。這強調了對專門的、針對心理健康諮詢的微調 LLM 的迫切需求，這些 LLM 必須嚴格符合核心能力，並結合適當的人類監督，才能考慮任何負責任的實際部署。", "author": "Viet Cuong Nguyen et.al.", "authors": "Viet Cuong Nguyen, Mohammad Taher, Dongwan Hong, Vinicius Konkolics Possobom, Vibha Thirunellayi Gopalakrishnan, Ekta Raj, Zihang Li, Heather J. Soled, Michael L. Birnbaum, Srijan Kumar, Munmun De Choudhury", "id": "2410.22446v1", "paper_url": "http://arxiv.org/abs/2410.22446v1", "repo": "null"}}