{"2501.09164": {"publish_time": "2025-01-15", "title": "The Veln(ia)s is in the Details: Evaluating LLM Judgment on Latvian and Lithuanian Short Answer Matching", "paper_summary": "In this work, we address the challenge of evaluating large language models\n(LLMs) on the short answer matching task for Latvian and Lithuanian languages.\nWe introduce novel datasets consisting of 502 Latvian and 690 Lithuanian\nquestion-answer pairs. For each question-answer pair, we generated matched and\nnon-matched answers using a set of alteration rules specifically designed to\nintroduce small but meaningful changes in the text. These generated answers\nserve as test cases to assess the ability of LLMs to detect subtle differences\nin matching of the original answers. A subset of the datasets was manually\nverified for quality and accuracy. Our results show that while larger LLMs,\nsuch as QWEN2.5 72b and LLaMa3.1 70b, demonstrate near-perfect performance in\ndistinguishing matched and non-matched answers, smaller models show more\nvariance. For instance, LLaMa3.1 8b and EuroLLM 9b benefited from few-shot\nexamples, while Mistral Nemo 12b underperformed on detection of subtle text\nalteration, particularly in Lithuanian, even with additional examples. QWEN2.5\n7b and Mistral 7b were able to obtain a strong and comparable performance to\nthe larger 70b models in zero and few shot experiments. Moreover, the\nperformance of Mistral 7b was weaker in few shot experiments.", "paper_summary_zh": "在這項工作中，我們解決了在拉脫維亞語和立陶宛語的簡答配對任務中評估大型語言模型 (LLM) 的挑戰。我們引入了由 502 個拉脫維亞語和 690 個立陶宛語問答對組成的新穎資料集。對於每個問答對，我們使用專門設計的一組變更規則生成了匹配和不匹配的答案，以在文本中引入細微但有意義的變更。這些生成的答案作為測試案例，用於評估 LLM 檢測原始答案匹配中的細微差異的能力。資料集的子集經過手動驗證以確保品質和準確性。我們的結果顯示，雖然較大的 LLM（例如 QWEN2.5 72b 和 LLaMa3.1 70b）在區分匹配和不匹配的答案方面表現接近完美，但較小的模型顯示出更多差異。例如，LLaMa3.1 8b 和 EuroLLM 9b 受益於少次嘗試的範例，而 Mistral Nemo 12b 在檢測細微文字變更方面表現不佳，特別是在立陶宛語中，即使有額外的範例也是如此。QWEN2.5 7b 和 Mistral 7b 能夠在零次和少次嘗試的實驗中獲得與較大的 70b 模型相當的強勁效能。此外，Mistral 7b 在少次嘗試的實驗中的效能較弱。", "author": "Yevhen Kostiuk et.al.", "authors": "Yevhen Kostiuk, Oxana Vitman, Łukasz Gagała, Artur Kiulian", "id": "2501.09164v1", "paper_url": "http://arxiv.org/abs/2501.09164v1", "repo": "null"}}