{"2407.02136": {"publish_time": "2024-07-02", "title": "Black Big Boxes: Do Language Models Hide a Theory of Adjective Order?", "paper_summary": "In English and other languages, multiple adjectives in a complex noun phrase\nshow intricate ordering patterns that have been a target of much linguistic\ntheory. These patterns offer an opportunity to assess the ability of language\nmodels (LMs) to learn subtle rules of language involving factors that cross the\ntraditional divisions of syntax, semantics, and pragmatics. We review existing\nhypotheses designed to explain Adjective Order Preferences (AOPs) in humans and\ndevelop a setup to study AOPs in LMs: we present a reusable corpus of adjective\npairs and define AOP measures for LMs. With these tools, we study a series of\nLMs across intermediate checkpoints during training. We find that all models'\npredictions are much closer to human AOPs than predictions generated by factors\nidentified in theoretical linguistics. At the same time, we demonstrate that\nthe observed AOPs in LMs are strongly correlated with the frequency of the\nadjective pairs in the training data and report limited generalization to\nunseen combinations. This highlights the difficulty in establishing the link\nbetween LM performance and linguistic theory. We therefore conclude with a road\nmap for future studies our results set the stage for, and a discussion of key\nquestions about the nature of knowledge in LMs and their ability to generalize\nbeyond the training sets.", "paper_summary_zh": "在英語和其他語言中，複雜名詞短語中的多個形容詞顯示出錯綜複雜的排序模式，一直是許多語言理論的目標。這些模式提供了一個機會來評估語言模型 (LM) 學習語言微妙規則的能力，涉及跨越句法、語義和語用學傳統劃分的因素。我們回顧了旨在解釋人類形容詞順序偏好 (AOP) 的現有假設，並制定了一個在 LM 中研究 AOP 的設置：我們提供了一個可重複使用的形容詞對語料庫，並定義了 LM 的 AOP 測量。利用這些工具，我們在訓練期間研究了一系列跨中間檢查點的 LM。我們發現，所有模型的預測都比理論語言學中確定的因素產生的預測更接近人類 AOP。同時，我們證明了在 LM 中觀察到的 AOP 與訓練數據中形容詞對的頻率密切相關，並報告了對未見組合的有限概括。這突出了在建立 LM 性能與語言理論之間的聯繫方面的難度。因此，我們以我們的研究結果設定的未來研究路線圖作為結論，並討論了有關 LM 中知識的性質及其在訓練集之外概括的能力的關鍵問題。", "author": "Jaap Jumelet et.al.", "authors": "Jaap Jumelet, Lisa Bylinina, Willem Zuidema, Jakub Szymanik", "id": "2407.02136v1", "paper_url": "http://arxiv.org/abs/2407.02136v1", "repo": "null"}}