{"2411.12064": {"publish_time": "2024-11-18", "title": "TSPRank: Bridging Pairwise and Listwise Methods with a Bilinear Travelling Salesman Model", "paper_summary": "Traditional Learning-To-Rank (LETOR) approaches, including pairwise methods\nlike RankNet and LambdaMART, often fall short by solely focusing on pairwise\ncomparisons, leading to sub-optimal global rankings. Conversely, deep learning\nbased listwise methods, while aiming to optimise entire lists, require complex\ntuning and yield only marginal improvements over robust pairwise models. To\novercome these limitations, we introduce Travelling Salesman Problem Rank\n(TSPRank), a hybrid pairwise-listwise ranking method. TSPRank reframes the\nranking problem as a Travelling Salesman Problem (TSP), a well-known\ncombinatorial optimisation challenge that has been extensively studied for its\nnumerous solution algorithms and applications. This approach enables the\nmodelling of pairwise relationships and leverages combinatorial optimisation to\ndetermine the listwise ranking. This approach can be directly integrated as an\nadditional component into embeddings generated by existing backbone models to\nenhance ranking performance. Our extensive experiments across three backbone\nmodels on diverse tasks, including stock ranking, information retrieval, and\nhistorical events ordering, demonstrate that TSPRank significantly outperforms\nboth pure pairwise and listwise methods. Our qualitative analysis reveals that\nTSPRank's main advantage over existing methods is its ability to harness global\ninformation better while ranking. TSPRank's robustness and superior performance\nacross different domains highlight its potential as a versatile and effective\nLETOR solution. The code and preprocessed data are available at\nhttps://github.com/waylonli/TSPRank-KDD2025.", "paper_summary_zh": "傳統的學習排名 (LETOR) 方法，包括成對方法，例如 RankNet 和 LambdaMART，通常僅專注於成對比較，導致次優的全局排名。相反，基於深度學習的成列方法，雖然旨在優化整個清單，但需要複雜的調整，並且僅對穩健的成對模型產生邊際改進。為了克服這些限制，我們引入了旅行商問題排名 (TSPRank)，這是一種混合成對-成列排名方法。TSPRank 將排名問題重新定義為旅行商問題 (TSP)，這是一個眾所周知的組合優化挑戰，由於其眾多的解決演算法和應用而被廣泛研究。這種方法能夠對成對關係進行建模，並利用組合優化來確定成列排名。這種方法可以直接整合為現有主幹模型生成的嵌入中的附加組件，以增強排名效能。我們在三種主幹模型中進行了廣泛的實驗，涉及各種任務，包括股票排名、資訊檢索和歷史事件排序，結果表明 TSPRank 明顯優於純成對和成列方法。我們的質性分析表明，TSPRank 優於現有方法的主要優勢在於它在排名時能更好地利用全局資訊。TSPRank 在不同領域的穩健性和卓越效能突顯了其作為多功能且有效的 LETOR 解決方案的潛力。程式碼和預處理資料可在 https://github.com/waylonli/TSPRank-KDD2025 取得。", "author": "Weixian Waylon Li et.al.", "authors": "Weixian Waylon Li, Yftah Ziser, Yifei Xie, Shay B. Cohen, Tiejun Ma", "id": "2411.12064v1", "paper_url": "http://arxiv.org/abs/2411.12064v1", "repo": "https://github.com/waylonli/tsprank-kdd2025"}}