{"2407.18219": {"publish_time": "2024-07-25", "title": "Recursive Introspection: Teaching Language Model Agents How to Self-Improve", "paper_summary": "A central piece in enabling intelligent agentic behavior in foundation models\nis to make them capable of introspecting upon their behavior, reasoning, and\ncorrecting their mistakes as more computation or interaction is available. Even\nthe strongest proprietary large language models (LLMs) do not quite exhibit the\nability of continually improving their responses sequentially, even in\nscenarios where they are explicitly told that they are making a mistake. In\nthis paper, we develop RISE: Recursive IntroSpEction, an approach for\nfine-tuning LLMs to introduce this capability, despite prior work hypothesizing\nthat this capability may not be possible to attain. Our approach prescribes an\niterative fine-tuning procedure, which attempts to teach the model how to alter\nits response after having executed previously unsuccessful attempts to solve a\nhard test-time problem, with optionally additional environment feedback. RISE\nposes fine-tuning for a single-turn prompt as solving a multi-turn Markov\ndecision process (MDP), where the initial state is the prompt. Inspired by\nprinciples in online imitation learning and reinforcement learning, we propose\nstrategies for multi-turn data collection and training so as to imbue an LLM\nwith the capability to recursively detect and correct its previous mistakes in\nsubsequent iterations. Our experiments show that RISE enables Llama2, Llama3,\nand Mistral models to improve themselves with more turns on math reasoning\ntasks, outperforming several single-turn strategies given an equal amount of\ninference-time computation. We also find that RISE scales well, often attaining\nlarger benefits with more capable models. Our analysis shows that RISE makes\nmeaningful improvements to responses to arrive at the correct solution for\nchallenging prompts, without disrupting one-turn abilities as a result of\nexpressing more complex distributions.", "paper_summary_zh": "<paragraph>在基礎模型中啟用智慧代理行為的核心部分是讓它們能夠內省自己的行為、推理，並在有更多運算或互動時更正自己的錯誤。即使是最強大的專有大型語言模型 (LLM) 也無法完全展現連續循序漸進地改善其回應的能力，即使在明確告知它們犯錯的情況下也是如此。在本文中，我們開發了 RISE：遞迴內省，一種微調 LLM 的方法來引入這種能力，儘管先前的研究假設無法獲得這種能力。我們的做法規定了一種反覆微調程序，該程序嘗試教導模型如何在執行先前不成功的嘗試來解決困難的測試時間問題後改變其回應，並可選擇額外提供環境回饋。RISE 將單輪提示的微調視為解決多輪馬可夫決策過程 (MDP) 的問題，其中初始狀態是提示。受到在線模仿學習和強化學習原則的啟發，我們提出了多輪數據收集和訓練策略，以賦予 LLM 在後續迭代中遞迴檢測和糾正其先前錯誤的能力。我們的實驗表明，RISE 能讓 Llama2、Llama3 和 Mistral 模型在數學推理任務中隨著更多輪次而自我提升，在給定相同推理時間運算的情況下，表現優於多種單輪策略。我們還發現 RISE 具有良好的擴展性，通常能隨著模型功能更強大而獲得更大的好處。我們的分析表明，RISE 對回應進行了有意義的改進，以針對具有挑戰性的提示得出正確的解決方案，而不會因為表達更複雜的分布而破壞單輪能力。</paragraph>", "author": "Yuxiao Qu et.al.", "authors": "Yuxiao Qu, Tianjun Zhang, Naman Garg, Aviral Kumar", "id": "2407.18219v1", "paper_url": "http://arxiv.org/abs/2407.18219v1", "repo": "null"}}