{"2408.00108": {"publish_time": "2024-07-31", "title": "Preference-Based Abstract Argumentation for Case-Based Reasoning (with Appendix)", "paper_summary": "In the pursuit of enhancing the efficacy and flexibility of interpretable,\ndata-driven classification models, this work introduces a novel incorporation\nof user-defined preferences with Abstract Argumentation and Case-Based\nReasoning (CBR). Specifically, we introduce Preference-Based Abstract\nArgumentation for Case-Based Reasoning (which we call AA-CBR-P), allowing users\nto define multiple approaches to compare cases with an ordering that specifies\ntheir preference over these comparison approaches. We prove that the model\ninherently follows these preferences when making predictions and show that\nprevious abstract argumentation for case-based reasoning approaches are\ninsufficient at expressing preferences over constituents of an argument. We\nthen demonstrate how this can be applied to a real-world medical dataset\nsourced from a clinical trial evaluating differing assessment methods of\npatients with a primary brain tumour. We show empirically that our approach\noutperforms other interpretable machine learning models on this dataset.", "paper_summary_zh": "為了提升可解釋、資料驅動分類模型的效能和靈活性，此研究引入了使用者自訂偏好與抽象論證和案例基礎推理 (CBR) 的新結合。具體來說，我們引入了案例基礎推理的偏好基礎抽象論證 (我們稱之為 AA-CBR-P)，允許使用者定義多種方法來比較案例，並透過排序來指定他們對這些比較方法的偏好。我們證明了此模型在進行預測時會自然遵循這些偏好，並顯示先前案例基礎推理的抽象論證方法不足以表達對論證組成的偏好。然後，我們展示了如何將此方法應用於實際的醫療資料集，該資料集來自評估原發性腦腫瘤患者不同評估方法的臨床試驗。我們經驗性地證明，我們的做法在這個資料集上優於其他可解釋的機器學習模型。", "author": "Adam Gould et.al.", "authors": "Adam Gould, Guilherme Paulino-Passos, Seema Dadhania, Matthew Williams, Francesca Toni", "id": "2408.00108v2", "paper_url": "http://arxiv.org/abs/2408.00108v2", "repo": "null"}}