{"2406.08184": {"publish_time": "2024-06-12", "title": "MobileAgentBench: An Efficient and User-Friendly Benchmark for Mobile LLM Agents", "paper_summary": "Large language model (LLM)-based mobile agents are increasingly popular due\nto their capability to interact directly with mobile phone Graphic User\nInterfaces (GUIs) and their potential to autonomously manage daily tasks.\nDespite their promising prospects in both academic and industrial sectors,\nlittle research has focused on benchmarking the performance of existing mobile\nagents, due to the inexhaustible states of apps and the vague definition of\nfeasible action sequences. To address this challenge, we propose an efficient\nand user-friendly benchmark, MobileAgentBench, designed to alleviate the burden\nof extensive manual testing. We initially define 100 tasks across 10\nopen-source apps, categorized by multiple levels of difficulty. Subsequently,\nwe evaluate several existing mobile agents, including AppAgent and MobileAgent,\nto thoroughly and systematically compare their performance. All materials are\naccessible on our project webpage: https://MobileAgentBench.github.io,\ncontributing to the advancement of both academic and industrial fields.", "paper_summary_zh": "大型語言模型 (LLM) 行動代理日益普及，因為它們能直接與行動電話圖形使用者介面 (GUI) 互動，並具備自主管理日常任務的潛力。儘管它們在學術和產業領域都具有良好的前景，但由於應用程式的狀態取之不盡，而且可行動作序列的定義模糊，因此很少有研究專注於評量現有行動代理的效能。為了應對這項挑戰，我們提出一個有效且使用者友善的基準測試 MobileAgentBench，旨在減輕廣泛手動測試的負擔。我們最初定義了 10 個開源應用程式中的 100 個任務，並依據多個難度層級進行分類。隨後，我們評估了幾個現有的行動代理，包括 AppAgent 和 MobileAgent，以全面且系統性地比較它們的效能。所有材料都可以在我們的專案網頁上取得：https://MobileAgentBench.github.io，為學術和產業領域的進步做出貢獻。", "author": "Luyuan Wang et.al.", "authors": "Luyuan Wang, Yongyu Deng, Yiwei Zha, Guodong Mao, Qinmin Wang, Tianchen Min, Wei Chen, Shoufa Chen", "id": "2406.08184v1", "paper_url": "http://arxiv.org/abs/2406.08184v1", "repo": "null"}}