{"2405.09118": {"publish_time": "2024-05-15", "title": "BonnBot-I Plus: A Bio-diversity Aware Precise Weed Management Robotic Platform", "paper_summary": "In this article, we focus on the critical tasks of plant protection in arable\nfarms, addressing a modern challenge in agriculture: integrating ecological\nconsiderations into the operational strategy of precision weeding robots like\n\\bbot. This article presents the recent advancements in weed management\nalgorithms and the real-world performance of \\bbot\\ at the University of Bonn's\nKlein-Altendorf campus. We present a novel Rolling-view observation model for\nthe BonnBot-Is weed monitoring section which leads to an average absolute\nweeding performance enhancement of $3.4\\%$. Furthermore, for the first time, we\nshow how precision weeding robots could consider bio-diversity-aware concerns\nin challenging weeding scenarios. We carried out comprehensive weeding\nexperiments in sugar-beet fields, covering both weed-only and mixed crop-weed\nsituations, and introduced a new dataset compatible with precision weeding. Our\nreal-field experiments revealed that our weeding approach is capable of\nhandling diverse weed distributions, with a minimal loss of only $11.66\\%$\nattributable to intervention planning and $14.7\\%$ to vision system limitations\nhighlighting required improvements of the vision system.", "paper_summary_zh": "<paragraph>在本文中，我們專注於可耕種農場中植物保護的關鍵任務，解決農業中的現代挑戰：將生態考量納入像 \\bbot\\ 等精準除草機器人的運作策略。本文介紹了除草管理演算法的最新進展，以及 \\bbot\\ 在波恩大學 Klein-Altendorf 校區的實際效能。我們為 BonnBot-Is 除草監控區塊提出了一種新的滾動檢視觀察模型，這導致平均絕對除草效能提升了 $3.4\\%$。此外，我們首次展示了精準除草機器人在具挑戰性的除草場景中如何考量生物多樣性相關的考量。我們在甜菜田進行了全面的除草實驗，涵蓋了僅有雜草和作物雜草混合的情況，並引進了一個與精準除草相容的新資料集。我們的實地實驗顯示，我們的除草方式能夠處理各種雜草分佈，而僅有 $11.66\\%$ 歸因於干預規劃和 $14.7\\%$ 歸因於視覺系統限制所造成的損失最小化，突顯了視覺系統需要改進之處。</paragraph>", "author": "Alireza Ahmadi et.al.", "authors": "Alireza Ahmadi, Michael Halstead, Claus Smitt, Chris McCool", "id": "2405.09118v1", "paper_url": "http://arxiv.org/abs/2405.09118v1", "repo": "null"}}