{"2405.04053": {"publish_time": "2024-05-07", "title": "Evaluating Text Summaries Generated by Large Language Models Using OpenAI's GPT", "paper_summary": "This research examines the effectiveness of OpenAI's GPT models as\nindependent evaluators of text summaries generated by six transformer-based\nmodels from Hugging Face: DistilBART, BERT, ProphetNet, T5, BART, and PEGASUS.\nWe evaluated these summaries based on essential properties of high-quality\nsummary - conciseness, relevance, coherence, and readability - using\ntraditional metrics such as ROUGE and Latent Semantic Analysis (LSA). Uniquely,\nwe also employed GPT not as a summarizer but as an evaluator, allowing it to\nindependently assess summary quality without predefined metrics. Our analysis\nrevealed significant correlations between GPT evaluations and traditional\nmetrics, particularly in assessing relevance and coherence. The results\ndemonstrate GPT's potential as a robust tool for evaluating text summaries,\noffering insights that complement established metrics and providing a basis for\ncomparative analysis of transformer-based models in natural language processing\ntasks.", "paper_summary_zh": "本研究檢視了 OpenAI 的 GPT 模型作為 Hugging Face 中六個Transformer模型（DistilBART、BERT、ProphetNet、T5、BART 和 PEGASUS）所產生文字摘要的獨立評估員的有效性。我們根據高品質摘要的基本屬性（簡潔性、相關性、一致性和可讀性）來評估這些摘要，並使用傳統指標，例如 ROUGE 和潛在語義分析 (LSA)。獨特的是，我們不僅將 GPT 用作摘要工具，還用作評估工具，讓它能夠在沒有預定義指標的情況下獨立評估摘要品質。我們的分析顯示 GPT 評估與傳統指標之間存在顯著相關性，特別是在評估相關性和一致性方面。結果證明了 GPT 作為評估文字摘要的強大工具的潛力，它提供的見解補充了既定的指標，並為自然語言處理任務中Transformer模型的比較分析提供了基礎。", "author": "Hassan Shakil et.al.", "authors": "Hassan Shakil, Atqiya Munawara Mahi, Phuoc Nguyen, Zeydy Ortiz, Mamoun T. Mardini", "id": "2405.04053v1", "paper_url": "http://arxiv.org/abs/2405.04053v1", "repo": "null"}}