{"2412.12955": {"publish_time": "2024-12-17", "title": "Learning from Noisy Labels via Self-Taught On-the-Fly Meta Loss Rescaling", "paper_summary": "Correct labels are indispensable for training effective machine learning\nmodels. However, creating high-quality labels is expensive, and even\nprofessionally labeled data contains errors and ambiguities. Filtering and\ndenoising can be applied to curate labeled data prior to training, at the cost\nof additional processing and loss of information. An alternative is on-the-fly\nsample reweighting during the training process to decrease the negative impact\nof incorrect or ambiguous labels, but this typically requires clean seed data.\nIn this work we propose unsupervised on-the-fly meta loss rescaling to reweight\ntraining samples. Crucially, we rely only on features provided by the model\nbeing trained, to learn a rescaling function in real time without knowledge of\nthe true clean data distribution. We achieve this via a novel meta learning\nsetup that samples validation data for the meta update directly from the noisy\ntraining corpus by employing the rescaling function being trained. Our proposed\nmethod consistently improves performance across various NLP tasks with minimal\ncomputational overhead. Further, we are among the first to attempt on-the-fly\ntraining data reweighting on the challenging task of dialogue modeling, where\nnoisy and ambiguous labels are common. Our strategy is robust in the face of\nnoisy and clean data, handles class imbalance, and prevents overfitting to\nnoisy labels. Our self-taught loss rescaling improves as the model trains,\nshowing the ability to keep learning from the model's own signals. As training\nprogresses, the impact of correctly labeled data is scaled up, while the impact\nof wrongly labeled data is suppressed.", "paper_summary_zh": "正確的標籤對於訓練有效的機器學習模型來說是不可或缺的。然而，建立高品質標籤的成本很高，而且即使專業標記的資料也包含錯誤和模糊性。過濾和去噪可以應用於在訓練前整理標籤資料，但代價是額外的處理和資訊的遺失。另一個替代方案是在訓練過程中進行即時樣本重新加權，以減少不正確或模糊標籤的負面影響，但這通常需要乾淨的種子資料。在這項工作中，我們提出無監督的即時元損失重新調整，以重新加權訓練樣本。至關重要的是，我們僅依賴模型提供的特徵，在不瞭解真實乾淨資料分佈的情況下，即時學習重新調整函數。我們透過一個新穎的元學習設定來實現這一點，該設定直接從嘈雜的訓練語料庫中抽取驗證資料，以進行元更新，方法是採用正在訓練的重新調整函數。我們提出的方法在各種自然語言處理任務中持續改善效能，且運算負擔極小。此外，我們是首批嘗試對話建模這項艱鉅任務進行即時訓練資料重新加權的人員之一，在對話建模中，嘈雜和模糊的標籤很常見。我們的策略在面對嘈雜和乾淨的資料時很穩健，能處理類別不平衡，並防止過度擬合到嘈雜的標籤。我們自學的損失重新調整會隨著模型訓練而改善，顯示出從模型本身訊號持續學習的能力。隨著訓練的進行，正確標記資料的影響會擴大，而錯誤標記資料的影響則會被抑制。", "author": "Michael Heck et.al.", "authors": "Michael Heck, Christian Geishauser, Nurul Lubis, Carel van Niekerk, Shutong Feng, Hsien-Chin Lin, Benjamin Matthias Ruppik, Renato Vukovic, Milica Gašić", "id": "2412.12955v1", "paper_url": "http://arxiv.org/abs/2412.12955v1", "repo": "null"}}