{"2501.02570": {"publish_time": "2025-01-05", "title": "Decoding fMRI Data into Captions using Prefix Language Modeling", "paper_summary": "With the advancements in Large Language and Latent Diffusion models, brain\ndecoding has achieved remarkable results in recent years. The works on the NSD\ndataset, with stimuli images from the COCO dataset, leverage the embeddings\nfrom the CLIP model for image reconstruction and GIT for captioning. However,\nthe current captioning approach introduces the challenge of potential data\ncontamination given that the GIT model was trained on the COCO dataset. In this\nwork, we present an alternative method for decoding brain signals into image\ncaptions by predicting a DINOv2 model's embedding of an image from the\ncorresponding fMRI signal and then providing its [CLS] token as the prefix to\nthe GPT-2 language model which decreases computational requirements\nconsiderably. Additionally, instead of commonly used Linear Regression, we\nexplore 3D Convolutional Neural Network mapping of fMRI signals to image\nembedding space for better accounting positional information of voxels.", "paper_summary_zh": "隨著大型語言和潛在擴散模型的進步，大腦解碼在近年來取得了顯著的成果。NSD 資料集的研究，使用來自 COCO 資料集的刺激圖像，利用 CLIP 模型的嵌入進行影像重建和 GIT 進行標題說明。然而，目前的標題說明方法引入了潛在資料污染的挑戰，因為 GIT 模型是在 COCO 資料集上訓練的。在這項工作中，我們提出了一種替代方法，將大腦訊號解碼為影像標題，方法是根據對應的 fMRI 訊號預測 DINOv2 模型的影像嵌入，然後將其 [CLS] 標記作為 GPT-2 語言模型的前綴，這顯著降低了運算需求。此外，我們探索了 3D 卷積神經網路將 fMRI 訊號對應到影像嵌入空間，以更好地說明體素的位置資訊，而不是常用的線性回歸。", "author": "Vyacheslav Shen et.al.", "authors": "Vyacheslav Shen, Kassymzhomart Kunanbayev, Dae-Shik Kim", "id": "2501.02570v1", "paper_url": "http://arxiv.org/abs/2501.02570v1", "repo": "null"}}