{"2405.15624": {"publish_time": "2024-05-24", "title": "Inverse-RLignment: Inverse Reinforcement Learning from Demonstrations for LLM Alignment", "paper_summary": "Aligning Large Language Models (LLMs) is crucial for enhancing their safety\nand utility. However, existing methods, primarily based on preference datasets,\nface challenges such as noisy labels, high annotation costs, and privacy\nconcerns. In this work, we introduce Alignment from Demonstrations (AfD), a\nnovel approach leveraging high-quality demonstration data to overcome these\nchallenges. We formalize AfD within a sequential decision-making framework,\nhighlighting its unique challenge of missing reward signals. Drawing insights\nfrom forward and inverse reinforcement learning, we introduce divergence\nminimization objectives for AfD. Analytically, we elucidate the mass-covering\nand mode-seeking behaviors of various approaches, explaining when and why\ncertain methods are superior. Practically, we propose a computationally\nefficient algorithm that extrapolates over a tailored reward model for AfD. We\nvalidate our key insights through experiments on the Harmless and Helpful\ntasks, demonstrating their strong empirical performance while maintaining\nsimplicity.", "paper_summary_zh": "對齊大型語言模型 (LLM) 對於增強其安全性\n和實用性至關重要。然而，現有方法（主要基於偏好資料集）\n面臨諸如標籤雜訊、標註成本高和隱私等挑戰\n疑慮。在這項工作中，我們引入了示範對齊 (AfD)，一種\n利用高品質示範資料來克服這些挑戰的新方法。我們在序貫決策制定架構中形式化 AfD，\n強調其錯失獎勵訊號的獨特挑戰。從正向和反向強化學習中汲取見解，我們引入了 AfD 的差異最小化目標。在分析上，我們闡明了各種方法的質量覆蓋\n和模式尋求行為，解釋了某些方法何時以及為何優越。在實務上，我們提出了一種計算\n一種對於 AfD 的量身打造獎勵模型進行外推的有效率演算法。我們\n通過在無害和有益任務上的實驗驗證我們的關鍵見解，證明其強大的經驗效能，同時維持\n簡潔性。", "author": "Hao Sun et.al.", "authors": "Hao Sun, Mihaela van der Schaar", "id": "2405.15624v1", "paper_url": "http://arxiv.org/abs/2405.15624v1", "repo": "null"}}