{"2405.18556": {"publish_time": "2024-05-28", "title": "Reinforcement Learning in Dynamic Treatment Regimes Needs Critical Reexamination", "paper_summary": "In the rapidly changing healthcare landscape, the implementation of offline\nreinforcement learning (RL) in dynamic treatment regimes (DTRs) presents a mix\nof unprecedented opportunities and challenges. This position paper offers a\ncritical examination of the current status of offline RL in the context of\nDTRs. We argue for a reassessment of applying RL in DTRs, citing concerns such\nas inconsistent and potentially inconclusive evaluation metrics, the absence of\nnaive and supervised learning baselines, and the diverse choice of RL\nformulation in existing research. Through a case study with more than 17,000\nevaluation experiments using a publicly available Sepsis dataset, we\ndemonstrate that the performance of RL algorithms can significantly vary with\nchanges in evaluation metrics and Markov Decision Process (MDP) formulations.\nSurprisingly, it is observed that in some instances, RL algorithms can be\nsurpassed by random baselines subjected to policy evaluation methods and reward\ndesign. This calls for more careful policy evaluation and algorithm development\nin future DTR works. Additionally, we discussed potential enhancements toward\nmore reliable development of RL-based dynamic treatment regimes and invited\nfurther discussion within the community. Code is available at\nhttps://github.com/GilesLuo/ReassessDTR.", "paper_summary_zh": "在快速變化的醫療保健環境中，離線強化學習 (RL) 在動態治療方案 (DTR) 中的實施呈現了前所未有的機會和挑戰。本立場文件對離線 RL 在 DTR 背景下的現狀進行了批判性審查。我們主張重新評估在 DTR 中應用 RL，並提出了一些疑慮，例如不一致且可能沒有定論的評估指標、缺乏天真的和監督式的學習基線，以及現有研究中 RL 公式的多樣選擇。通過一個使用公開 Sepsis 數據集進行的超過 17,000 次評估實驗的案例研究，我們證明了 RL 演算法的效能會隨著評估指標和馬可夫決策過程 (MDP) 公式的變化而有顯著差異。令人驚訝的是，我們觀察到在某些情況下，RL 演算法可能會被隨機基線所超越，這些基線會受到策略評估方法和獎勵設計的影響。這要求在未來的 DTR 工作中進行更仔細的策略評估和演算法開發。此外，我們討論了朝著更可靠的基於 RL 的動態治療方案開發的潛在改進，並邀請社群進一步討論。程式碼可在 https://github.com/GilesLuo/ReassessDTR 取得。", "author": "Zhiyao Luo et.al.", "authors": "Zhiyao Luo, Yangchen Pan, Peter Watkinson, Tingting Zhu", "id": "2405.18556v1", "paper_url": "http://arxiv.org/abs/2405.18556v1", "repo": "null"}}