{"2407.15739": {"publish_time": "2024-07-22", "title": "Diffusion for Out-of-Distribution Detection on Road Scenes and Beyond", "paper_summary": "In recent years, research on out-of-distribution (OoD) detection for semantic\nsegmentation has mainly focused on road scenes -- a domain with a constrained\namount of semantic diversity. In this work, we challenge this constraint and\nextend the domain of this task to general natural images. To this end, we\nintroduce: 1. the ADE-OoD benchmark, which is based on the ADE20k dataset and\nincludes images from diverse domains with a high semantic diversity, and 2. a\nnovel approach that uses Diffusion score matching for OoD detection (DOoD) and\nis robust to the increased semantic diversity. ADE-OoD features indoor and\noutdoor images, defines 150 semantic categories as in-distribution, and\ncontains a variety of OoD objects. For DOoD, we train a diffusion model with an\nMLP architecture on semantic in-distribution embeddings and build on the score\nmatching interpretation to compute pixel-wise OoD scores at inference time. On\ncommon road scene OoD benchmarks, DOoD performs on par or better than the state\nof the art, without using outliers for training or making assumptions about the\ndata domain. On ADE-OoD, DOoD outperforms previous approaches, but leaves much\nroom for future improvements.", "paper_summary_zh": "近年來，針對語意分割的分布外 (OoD) 偵測研究主要集中在道路場景，這是一個語意多樣性受限的領域。在此研究中，我們挑戰此限制，並將此任務的領域擴展到一般自然影像。為此，我們提出：1. ADE-OoD 基準，它基於 ADE20k 資料集，並包含來自具有高度語意多樣性的不同領域的影像，以及 2. 一種使用擴散分數配對進行 OoD 偵測 (DOoD) 的新穎方法，且對增加的語意多樣性具有魯棒性。ADE-OoD 具有室內和室外影像，定義 150 個語意類別作為分布內，並包含各種 OoD 物件。對於 DOoD，我們使用 MLP 架構訓練一個擴散模型，在語意分布內嵌入中，並建立在分數配對詮釋上，以在推理時計算逐像素的 OoD 分數。在常見道路場景 OoD 基準上，DOoD 的表現與現有技術相當或更好，而無需使用異常值進行訓練或對資料領域做出假設。在 ADE-OoD 上，DOoD 優於先前的做法，但仍有很大的改進空間。", "author": "Silvio Galesso et.al.", "authors": "Silvio Galesso, Philipp Schröppel, Hssan Driss, Thomas Brox", "id": "2407.15739v1", "paper_url": "http://arxiv.org/abs/2407.15739v1", "repo": "https://github.com/lmb-freiburg/diffusion-for-ood"}}