{"2411.01751": {"publish_time": "2024-11-04", "title": "RAGViz: Diagnose and Visualize Retrieval-Augmented Generation", "paper_summary": "Retrieval-augmented generation (RAG) combines knowledge from domain-specific\nsources into large language models to ground answer generation. Current RAG\nsystems lack customizable visibility on the context documents and the model's\nattentiveness towards such documents. We propose RAGViz, a RAG diagnosis tool\nthat visualizes the attentiveness of the generated tokens in retrieved\ndocuments. With a built-in user interface, retrieval index, and Large Language\nModel (LLM) backbone, RAGViz provides two main functionalities: (1) token and\ndocument-level attention visualization, and (2) generation comparison upon\ncontext document addition and removal. As an open-source toolkit, RAGViz can be\neasily hosted with a custom embedding model and HuggingFace-supported LLM\nbackbone. Using a hybrid ANN (Approximate Nearest Neighbor) index,\nmemory-efficient LLM inference tool, and custom context snippet method, RAGViz\noperates efficiently with a median query time of about 5 seconds on a moderate\nGPU node. Our code is available at https://github.com/cxcscmu/RAGViz. A demo\nvideo of RAGViz can be found at https://youtu.be/cTAbuTu6ur4.", "paper_summary_zh": "檢索增強生成 (RAG) 將來自特定領域來源的知識結合到大型語言模型中，以建立答案生成。目前的 RAG 系統缺乏對脈絡文件和模型對此類文件的關注度的可自訂可視化。我們提出 RAGViz，這是一個 RAG 診斷工具，用於視覺化檢索文件中生成代碼的關注度。RAGViz 有一個內建使用者介面、檢索索引和大型語言模型 (LLM) 主幹，提供兩個主要功能：(1) 代碼和文件層級的關注度視覺化，以及 (2) 在加入和移除脈絡文件後進行生成比較。作為一個開源工具包，RAGViz 可以輕鬆地使用自訂嵌入模型和 HuggingFace 支援的 LLM 主幹進行主機。透過使用混合 ANN (近似最近鄰) 索引、記憶體效率良好的 LLM 推論工具和自訂脈絡片段方法，RAGViz 在中等 GPU 節點上以約 5 秒的中位數查詢時間有效率地運作。我們的程式碼可在 https://github.com/cxcscmu/RAGViz 取得。RAGViz 的示範影片可在 https://youtu.be/cTAbuTu6ur4 找到。", "author": "Tevin Wang et.al.", "authors": "Tevin Wang, Jingyuan He, Chenyan Xiong", "id": "2411.01751v1", "paper_url": "http://arxiv.org/abs/2411.01751v1", "repo": "https://github.com/cxcscmu/ragviz"}}