{"2409.08147": {"publish_time": "2024-09-12", "title": "LLM-POTUS Score: A Framework of Analyzing Presidential Debates with Large Language Models", "paper_summary": "Large language models have demonstrated remarkable capabilities in natural\nlanguage processing, yet their application to political discourse analysis\nremains underexplored. This paper introduces a novel approach to evaluating\npresidential debate performances using LLMs, addressing the longstanding\nchallenge of objectively assessing debate outcomes. We propose a framework that\nanalyzes candidates' \"Policies, Persona, and Perspective\" (3P) and how they\nresonate with the \"Interests, Ideologies, and Identity\" (3I) of four key\naudience groups: voters, businesses, donors, and politicians. Our method\nemploys large language models to generate the LLM-POTUS Score, a quantitative\nmeasure of debate performance based on the alignment between 3P and 3I. We\napply this framework to analyze transcripts from recent U.S. presidential\ndebates, demonstrating its ability to provide nuanced, multi-dimensional\nassessments of candidate performances. Our results reveal insights into the\neffectiveness of different debating strategies and their impact on various\naudience segments. This study not only offers a new tool for political analysis\nbut also explores the potential and limitations of using LLMs as impartial\njudges in complex social contexts. In addition, this framework provides\nindividual citizens with an independent tool to evaluate presidential debate\nperformances, which enhances democratic engagement and reduces reliance on\npotentially biased media interpretations and institutional influence, thereby\nstrengthening the foundation of informed civic participation.", "paper_summary_zh": "大型語言模型在自然語言處理中展現了非凡的能力，但其應用於政治論述分析仍未得到充分探討。本文介紹了一種使用大型語言模型評估總統辯論表現的新穎方法，以解決客觀評估辯論結果的長期挑戰。我們提出了分析候選人的「政策、人格和觀點」(3P) 的架構，以及它們如何與四個主要受眾群體：「選民、企業、捐助者和政治家」的「利益、意識形態和認同」(3I) 產生共鳴。我們的模型採用大型語言模型來產生 LLM-POTUS 分數，這是一個基於 3P 和 3I 之間的一致性的辯論表現量化測量。我們將此架構應用於分析最近美國總統辯論的逐字稿，證明了它提供細緻、多維度候選人表現評估的能力。我們的結果揭示了對不同辯論策略的有效性及其對不同受眾群體的影響的見解。本研究不僅提供了政治分析的新工具，還探討了在複雜的社會環境中使用大型語言模型作為公正評判的潛力和局限性。此外，此架構為個人公民提供了一個獨立工具來評估總統辯論表現，這增強了民主參與，減少了對潛在有偏見的媒體解讀和制度影響的依賴，從而加強了知情公民參與的基礎。", "author": "Zhengliang Liu et.al.", "authors": "Zhengliang Liu, Yiwei Li, Oleksandra Zolotarevych, Rongwei Yang, Tianming Liu", "id": "2409.08147v1", "paper_url": "http://arxiv.org/abs/2409.08147v1", "repo": "null"}}