{"2502.02963": {"publish_time": "2025-02-05", "title": "(Neural-Symbolic) Machine Learning for Inconsistency Measurement", "paper_summary": "We present machine-learning-based approaches for determining the\n\\emph{degree} of inconsistency -- which is a numerical value -- for\npropositional logic knowledge bases. Specifically, we present regression- and\nneural-based models that learn to predict the values that the inconsistency\nmeasures $\\incmi$ and $\\incat$ would assign to propositional logic knowledge\nbases. Our main motivation is that computing these values conventionally can be\nhard complexity-wise. As an important addition, we use specific postulates,\nthat is, properties, of the underlying inconsistency measures to infer symbolic\nrules, which we combine with the learning-based models in the form of\nconstraints. We perform various experiments and show that a) predicting the\ndegree values is feasible in many situations, and b) including the symbolic\nconstraints deduced from the rationality postulates increases the prediction\nquality.", "paper_summary_zh": "我們提出基於機器學習的方法來確定不一致性的程度，這是一個數值，用於命題邏輯知識庫。具體來說，我們提出回歸和基於神經網路的模型，用於學習預測不一致性測量 $\\incmi$ 和 $\\incat$ 會指派給命題邏輯知識庫的值。我們的動機主要是，傳統上計算這些值在複雜度上可能很困難。作為一個重要的補充，我們使用基礎不一致性測量的特定假設，也就是屬性，來推論符號規則，我們將其與學習模型結合在約束的形式中。我們執行各種實驗，並顯示 a) 在許多情況下預測程度值是可行的，以及 b) 包含從合理性假設中推論出的符號約束會提高預測品質。", "author": "Sven Weinzierl et.al.", "authors": "Sven Weinzierl, Carl Cora", "id": "2502.02963v1", "paper_url": "http://arxiv.org/abs/2502.02963v1", "repo": "null"}}