{"2412.08279": {"publish_time": "2024-12-11", "title": "Y-NQ: English-Yorùbá Evaluation dataset for Open-Book Reading Comprehension and Text Generation", "paper_summary": "The purpose of this work is to share an English-Yor\\`ub\\'a evaluation dataset\nfor open-book reading comprehension and text generation to assess the\nperformance of models both in a high- and a low- resource language. The dataset\ncontains 358 questions and answers on 338 English documents and 208 Yor\\`ub\\'a\ndocuments. The average document length is ~ 10k words for English and 430 words\nfor Yor\\`ub\\'a. Experiments show a consistent disparity in performance between\nthe two languages, with Yor\\`ub\\'a falling behind English for automatic metrics\neven if documents are much shorter for this language. For a small set of\ndocuments with comparable length, performance of Yor\\`ub\\'a drops by x2.5\ntimes. When analyzing performance by length, we observe that Yor\\`ub\\'a\ndecreases performance dramatically for documents that reach 1500 words while\nEnglish performance is barely affected at that length. Our dataset opens the\ndoor to showcasing if English LLM reading comprehension capabilities extend to\nYor\\`ub\\'a, which for the evaluated LLMs is not the case.", "paper_summary_zh": "本研究的目的是分享一个英语-约鲁巴语评估数据集，用于开放式阅读理解和文本生成，以评估模型在高资源和低资源语言中的表现。该数据集包含 358 个问题和答案，涉及 338 篇英语文档和 208 篇约鲁巴语文档。英语文档的平均长度约为 10k 个单词，约鲁巴语文档的平均长度为 430 个单词。实验表明，两种语言在表现上存在持续的差异，约鲁巴语在自动指标方面落后于英语，即使该语言的文档要短得多。对于一组长度相当的文档，约鲁巴语的表现下降了 x2.5 倍。在按长度分析表现时，我们观察到，约鲁巴语在文档达到 1500 个单词时表现急剧下降，而英语在该长度下的表现几乎没有受到影响。我们的数据集展示了英语 LLM 阅读理解能力是否扩展到约鲁巴语，对于评估过的 LLM 来说，事实并非如此。", "author": "Marta R. Costa-jussà et.al.", "authors": "Marta R. Costa-jussà, Joy Chen, Ifeoluwanimi Adebara, Joe Chuang, Christophe Ropers, Eduardo Sánchez", "id": "2412.08279v1", "paper_url": "http://arxiv.org/abs/2412.08279v1", "repo": "null"}}