{"2406.08035": {"publish_time": "2024-06-12", "title": "LVBench: An Extreme Long Video Understanding Benchmark", "paper_summary": "Recent progress in multimodal large language models has markedly enhanced the\nunderstanding of short videos (typically under one minute), and several\nevaluation datasets have emerged accordingly. However, these advancements fall\nshort of meeting the demands of real-world applications such as embodied\nintelligence for long-term decision-making, in-depth movie reviews and\ndiscussions, and live sports commentary, all of which require comprehension of\nlong videos spanning several hours. To address this gap, we introduce LVBench,\na benchmark specifically designed for long video understanding. Our dataset\ncomprises publicly sourced videos and encompasses a diverse set of tasks aimed\nat long video comprehension and information extraction. LVBench is designed to\nchallenge multimodal models to demonstrate long-term memory and extended\ncomprehension capabilities. Our extensive evaluations reveal that current\nmultimodal models still underperform on these demanding long video\nunderstanding tasks. Through LVBench, we aim to spur the development of more\nadvanced models capable of tackling the complexities of long video\ncomprehension. Our data and code are publicly available at:\nhttps://lvbench.github.io.", "paper_summary_zh": "最近多模态大型语言模型的进展显著增强了对短视频（通常在 1 分钟内）的理解，因此出现了几个评估数据集。然而，这些进步未能满足现实世界应用程序的需求，例如面向长期决策制定的具身智能、深入的电影评论和讨论以及现场体育评论，所有这些都需要理解跨越数小时的长视频。为了解决这一差距，我们引入了 LVBench，这是一个专门为理解长视频而设计的基准。我们的数据集包括公开获取的视频，并包含一组针对长视频理解和信息提取的任务。LVBench 旨在挑战多模态模型，以展示长期记忆和扩展理解能力。我们广泛的评估表明，当前的多模态模型在这些要求苛刻的长视频理解任务上仍然表现不佳。通过 LVBench，我们旨在促进能够应对长视频理解的复杂性的更高级模型的开发。我们的数据和代码可公开获取：https://lvbench.github.io。", "author": "Weihan Wang et.al.", "authors": "Weihan Wang, Zehai He, Wenyi Hong, Yean Cheng, Xiaohan Zhang, Ji Qi, Shiyu Huang, Bin Xu, Yuxiao Dong, Ming Ding, Jie Tang", "id": "2406.08035v1", "paper_url": "http://arxiv.org/abs/2406.08035v1", "repo": "null"}}