{"2406.13862": {"publish_time": "2024-06-19", "title": "Knowledge Graph-Enhanced Large Language Models via Path Selection", "paper_summary": "Large Language Models (LLMs) have shown unprecedented performance in various\nreal-world applications. However, they are known to generate factually\ninaccurate outputs, a.k.a. the hallucination problem. In recent years,\nincorporating external knowledge extracted from Knowledge Graphs (KGs) has\nbecome a promising strategy to improve the factual accuracy of LLM-generated\noutputs. Nevertheless, most existing explorations rely on LLMs themselves to\nperform KG knowledge extraction, which is highly inflexible as LLMs can only\nprovide binary judgment on whether a certain knowledge (e.g., a knowledge path\nin KG) should be used. In addition, LLMs tend to pick only knowledge with\ndirect semantic relationship with the input text, while potentially useful\nknowledge with indirect semantics can be ignored. In this work, we propose a\nprincipled framework KELP with three stages to handle the above problems.\nSpecifically, KELP is able to achieve finer granularity of flexible knowledge\nextraction by generating scores for knowledge paths with input texts via latent\nsemantic matching. Meanwhile, knowledge paths with indirect semantic\nrelationships with the input text can also be considered via trained encoding\nbetween the selected paths in KG and the input text. Experiments on real-world\ndatasets validate the effectiveness of KELP.", "paper_summary_zh": "大型語言模型 (LLM) 在各種實際應用中展現了前所未有的效能。然而，它們會產生事實上不準確的輸出，也就是所謂的幻覺問題。近年來，納入從知識圖譜 (KG) 中萃取的外部知識已成為改善 LLM 生成的輸出事實準確性的有前途策略。儘管如此，現有的探索大多依賴 LLM 本身來執行 KG 知識萃取，這非常不靈活，因為 LLM 只會對特定知識（例如，KG 中的知識路徑）是否應該使用提供二元判斷。此外，LLM 傾向僅挑選與輸入文字有直接語義關係的知識，而可能對語意有間接關聯的有用知識可能會被忽略。在這項工作中，我們提出一個有原則的 KELP 架構，包含三個階段來處理上述問題。具體來說，KELP 能夠透過隱含語義比對為知識路徑與輸入文字產生分數，進而達成更細緻的彈性知識萃取。同時，也可以透過在 KG 中選定的路徑與輸入文字之間訓練編碼的方式，考量與輸入文字有間接語義關係的知識路徑。在實際資料集上的實驗驗證了 KELP 的有效性。", "author": "Haochen Liu et.al.", "authors": "Haochen Liu, Song Wang, Yaochen Zhu, Yushun Dong, Jundong Li", "id": "2406.13862v1", "paper_url": "http://arxiv.org/abs/2406.13862v1", "repo": "https://github.com/haochenliu2000/kelp"}}