{"2406.04289": {"publish_time": "2024-06-06", "title": "What Languages are Easy to Language-Model? A Perspective from Learning Probabilistic Regular Languages", "paper_summary": "What can large language models learn? By definition, language models (LM) are\ndistributions over strings. Therefore, an intuitive way of addressing the above\nquestion is to formalize it as a matter of learnability of classes of\ndistributions over strings. While prior work in this direction focused on\nassessing the theoretical limits, in contrast, we seek to understand the\nempirical learnability. Unlike prior empirical work, we evaluate neural LMs on\ntheir home turf-learning probabilistic languages-rather than as classifiers of\nformal languages. In particular, we investigate the learnability of regular LMs\n(RLMs) by RNN and Transformer LMs. We empirically test the learnability of RLMs\nas a function of various complexity parameters of the RLM and the hidden state\nsize of the neural LM. We find that the RLM rank, which corresponds to the size\nof linear space spanned by the logits of its conditional distributions, and the\nexpected length of sampled strings are strong and significant predictors of\nlearnability for both RNNs and Transformers. Several other predictors also\nreach significance, but with differing patterns between RNNs and Transformers.", "paper_summary_zh": "大型語言模型可以學習什麼？根據定義，語言模型 (LM) 是字串上的分佈。因此，解決上述問題的一個直觀方法是將其形式化為字串上分佈類別的可學習性問題。雖然過去朝這個方向的研究專注於評估理論限制，但我們試圖了解經驗可學習性。與過去的經驗研究不同，我們在它們的主場上評估神經語言模型，學習機率語言，而不是作為形式語言的分類器。特別是，我們研究 RNN 和 Transformer LM 對正則語言模型 (RLM) 的可學習性。我們根據 RLM 的各種複雜度參數和神經語言模型的隱藏狀態大小，實證測試 RLM 的可學習性。我們發現 RLM 等級（對應於其條件分佈的對數機率所跨越的線性空間大小）和抽樣字串的預期長度是 RNN 和 Transformer 可學習性的強有力且顯著的預測因子。其他幾個預測因子也達到顯著性，但在 RNN 和 Transformer 之間有不同的模式。", "author": "Nadav Borenstein et.al.", "authors": "Nadav Borenstein, Anej Svete, Robin Chan, Josef Valvoda, Franz Nowak, Isabelle Augenstein, Eleanor Chodroff, Ryan Cotterell", "id": "2406.04289v1", "paper_url": "http://arxiv.org/abs/2406.04289v1", "repo": "null"}}