{"2503.20786": {"publish_time": "2025-03-26", "title": "Mobile-MMLU: A Mobile Intelligence Language Understanding Benchmark", "paper_summary": "Rapid advancements in large language models (LLMs) have increased interest in\ndeploying them on mobile devices for on-device AI applications. Mobile users\ninteract differently with LLMs compared to desktop users, creating unique\nexpectations and data biases. Current benchmark datasets primarily target at\nserver and desktop environments, and there is a notable lack of extensive\ndatasets specifically designed for mobile contexts. Additionally, mobile\ndevices face strict limitations in storage and computing resources,\nconstraining model size and capabilities, thus requiring optimized efficiency\nand prioritized knowledge. To address these challenges, we introduce\nMobile-MMLU, a large-scale benchmark dataset tailored for mobile intelligence.\nIt consists of 16,186 questions across 80 mobile-related fields, designed to\nevaluate LLM performance in realistic mobile scenarios. A challenging subset,\nMobile-MMLU-Pro, provides advanced evaluation similar in size to MMLU-Pro but\nsignificantly more difficult than our standard full set. Both benchmarks use\nmultiple-choice, order-invariant questions focused on practical mobile\ninteractions, such as recipe suggestions, travel planning, and essential daily\ntasks. The dataset emphasizes critical mobile-specific metrics like inference\nlatency, energy consumption, memory usage, and response quality, offering\ncomprehensive insights into model performance under mobile constraints.\nMoreover, it prioritizes privacy and adaptability, assessing models' ability to\nperform on-device processing, maintain user privacy, and adapt to personalized\nusage patterns. Mobile-MMLU family offers a standardized framework for\ndeveloping and comparing mobile-optimized LLMs, enabling advancements in\nproductivity and decision-making within mobile computing environments. Our code\nand data are available at: https://github.com/VILA-Lab/Mobile-MMLU.", "paper_summary_zh": "大型語言模型 (LLM) 的快速發展，提高了人們將其部署在行動裝置上以實現裝置端 AI 應用的興趣。與桌面用戶相比，行動用戶與 LLM 的互動方式不同，產生了獨特的期望和數據偏差。目前的基準數據集主要針對伺服器和桌面環境，顯然缺乏專為行動裝置環境設計的大型數據集。此外，行動裝置在儲存和運算資源方面受到嚴格限制，這也限制了模型的大小和功能，因此需要最佳化的效率和優先的知識。為了應對這些挑戰，我們推出了 Mobile-MMLU，這是一個專為行動智慧量身打造的大型基準數據集。它包含 80 個行動相關領域的 16,186 個問題，旨在評估 LLM 在真實行動裝置場景中的效能。Mobile-MMLU-Pro 這個更具挑戰性的子集，提供了與 MMLU-Pro 規模相似的進階評估，但比我們的標準完整數據集要困難得多。這兩個基準測試都使用多選題、順序不變的問題，側重於實際的行動裝置互動，例如食譜建議、旅行規劃和必要的日常任務。該數據集強調關鍵的行動裝置特定指標，如推論延遲、能耗、記憶體使用和回應品質，提供在行動裝置限制下模型效能的全面洞察。此外，它還優先考慮隱私和適應性，評估模型在裝置上執行處理、維護用戶隱私以及適應個人化使用模式的能力。Mobile-MMLU 系列提供了一個標準化框架，用於開發和比較行動裝置最佳化的 LLM，從而促進行動運算環境中生產力和決策的進步。我們的程式碼和數據可在以下網址獲得：https://github.com/VILA-Lab/Mobile-MMLU。\n", "author": "Sondos Mahmoud Bsharat et.al.", "authors": "Sondos Mahmoud Bsharat, Mukul Ranjan, Aidar Myrzakhan, Jiacheng Liu, Bowei Guo, Shengkun Tang, Zhuang Liu, Yuanzhi Li, Zhiqiang Shen", "id": "2503.20786v1", "paper_url": "http://arxiv.org/abs/2503.20786v1", "repo": "null"}}