{"2406.14871": {"publish_time": "2024-06-21", "title": "I don't trust you (anymore)! -- The effect of students' LLM use on Lecturer-Student-Trust in Higher Education", "paper_summary": "Trust plays a pivotal role in Lecturer-Student-Collaboration, encompassing\nteaching and research aspects. The advent of Large Language Models (LLMs) in\nplatforms like Open AI's ChatGPT, coupled with their cost-effectiveness and\nhigh-quality results, has led to their rapid adoption among university\nstudents. However, discerning genuine student input from LLM-generated output\nposes a challenge for lecturers. This dilemma jeopardizes the trust\nrelationship between lecturers and students, potentially impacting university\ndownstream activities, particularly collaborative research initiatives. Despite\nattempts to establish guidelines for student LLM use, a clear framework\nmutually beneficial for lecturers and students in higher education remains\nelusive. This study addresses the research question: How does the use of LLMs\nby students impact Informational and Procedural Justice, influencing Team Trust\nand Expected Team Performance? Methodically, we applied a quantitative\nconstruct-based survey, evaluated using techniques of Structural Equation\nModelling (PLS- SEM) to examine potential relationships among these constructs.\nOur findings based on 23 valid respondents from Ndejje University indicate that\nlecturers are less concerned about the fairness of LLM use per se but are more\nfocused on the transparency of student utilization, which significantly\ninfluences Team Trust positively. This research contributes to the global\ndiscourse on integrating and regulating LLMs and subsequent models in\neducation. We propose that guidelines should support LLM use while enforcing\ntransparency in Lecturer-Student- Collaboration to foster Team Trust and\nPerformance. The study contributes valuable insights for shaping policies\nenabling ethical and transparent LLMs usage in education to ensure\neffectiveness of collaborative learning environments.", "paper_summary_zh": "<paragraph>信任在講師與學生的合作中扮演著關鍵角色，涵蓋教學和研究層面。大型語言模型（LLM）在 Open AI 的 ChatGPT 等平台的出現，加上其成本效益和高品質的成果，導致大學生迅速採用。然而，對於講師來說，要從 LLM 生成的輸出中辨別出真正的學生輸入是一項挑戰。這種困境危及講師與學生之間的信任關係，可能會影響大學的後續活動，特別是合作研究計畫。儘管已嘗試為學生的 LLM 使用制定準則，但一個對高等教育中的講師和學生都有利的明確架構仍難以捉摸。本研究探討以下研究問題：學生使用 LLM 如何影響資訊和程序正義，進而影響團隊信任和預期的團隊績效？在方法上，我們應用基於建構的量化調查，使用結構方程模型（PLS-SEM）的技術進行評估，以檢驗這些建構之間的潛在關係。我們根據恩德傑大學 23 位有效受訪者的研究結果指出，講師不太關心 LLM 使用的公平性本身，但更注重學生使用過程的透明度，這會顯著地對團隊信任產生正面影響。本研究有助於全球關於整合和規範 LLM 及其後續模型在教育中的論述。我們建議準則應支援 LLM 的使用，同時在講師與學生合作中加強透明度，以促進團隊信任和績效。本研究提供了有價值的見解，有助於制定政策，讓教育中使用 LLM 符合倫理且透明，以確保協作學習環境的有效性。</paragraph>", "author": "Simon Kloker et.al.", "authors": "Simon Kloker, Matthew Bazanya, Twaha Kateete", "id": "2406.14871v1", "paper_url": "http://arxiv.org/abs/2406.14871v1", "repo": "null"}}