{"2407.13157": {"publish_time": "2024-07-18", "title": "Learning Camouflaged Object Detection from Noisy Pseudo Label", "paper_summary": "Existing Camouflaged Object Detection (COD) methods rely heavily on\nlarge-scale pixel-annotated training sets, which are both time-consuming and\nlabor-intensive. Although weakly supervised methods offer higher annotation\nefficiency, their performance is far behind due to the unclear visual\ndemarcations between foreground and background in camouflaged images. In this\npaper, we explore the potential of using boxes as prompts in camouflaged scenes\nand introduce the first weakly semi-supervised COD method, aiming for\nbudget-efficient and high-precision camouflaged object segmentation with an\nextremely limited number of fully labeled images. Critically, learning from\nsuch limited set inevitably generates pseudo labels with serious noisy pixels.\nTo address this, we propose a noise correction loss that facilitates the\nmodel's learning of correct pixels in the early learning stage, and corrects\nthe error risk gradients dominated by noisy pixels in the memorization stage,\nultimately achieving accurate segmentation of camouflaged objects from noisy\nlabels. When using only 20% of fully labeled data, our method shows superior\nperformance over the state-of-the-art methods.", "paper_summary_zh": "現有的偽裝物體偵測 (COD) 方法高度依賴於大規模像素註解訓練集，這既耗時又費力。儘管弱監督方法提供了更高的註解效率，但由於偽裝影像中前景和背景之間的視覺界線不明確，因此它們的效能遠遠落後。在本文中，我們探討了在偽裝場景中使用方塊作為提示的可能性，並介紹了第一個弱半監督 COD 方法，目標是使用極少數的完全標籤影像，進行經濟高效且高精準度的偽裝物體分割。至關重要的是，從如此有限的集合中學習，不可避免地會產生帶有嚴重雜訊像素的偽標籤。為了解決這個問題，我們提出了一個雜訊修正損失，有助於模型在早期學習階段學習正確的像素，並在記憶階段修正由雜訊像素主導的錯誤風險梯度，最終實現從雜訊標籤中準確分割偽裝物體。當僅使用 20% 的完全標籤資料時，我們的模型顯示出優於最先進模型的效能。", "author": "Jin Zhang et.al.", "authors": "Jin Zhang, Ruiheng Zhang, Yanjiao Shi, Zhe Cao, Nian Liu, Fahad Shahbaz Khan", "id": "2407.13157v1", "paper_url": "http://arxiv.org/abs/2407.13157v1", "repo": "null"}}