{"2408.08021": {"publish_time": "2024-08-15", "title": "DIVE: Towards Descriptive and Diverse Visual Commonsense Generation", "paper_summary": "Towards human-level visual understanding, visual commonsense generation has\nbeen introduced to generate commonsense inferences beyond images. However,\ncurrent research on visual commonsense generation has overlooked an important\nhuman cognitive ability: generating descriptive and diverse inferences. In this\nwork, we propose a novel visual commonsense generation framework, called DIVE,\nwhich aims to improve the descriptiveness and diversity of generated\ninferences. DIVE involves two methods, generic inference filtering and\ncontrastive retrieval learning, which address the limitations of existing\nvisual commonsense resources and training objectives. Experimental results\nverify that DIVE outperforms state-of-the-art models for visual commonsense\ngeneration in terms of both descriptiveness and diversity, while showing a\nsuperior quality in generating unique and novel inferences. Notably, DIVE\nachieves human-level descriptiveness and diversity on Visual Commonsense\nGraphs. Furthermore, human evaluations confirm that DIVE aligns closely with\nhuman judgments on descriptiveness and diversity\\footnote{Our code and dataset\nare available at https://github.com/Park-ing-lot/DIVE.", "paper_summary_zh": "為了達到人類層級的視覺理解，視覺常識生成已經被引入，以產生超越圖像的常識推論。然而，目前關於視覺常識生成的的研究忽略了一種重要的人類認知能力：產生描述性和多樣性的推論。在這項工作中，我們提出了一個新穎的視覺常識生成框架，稱為 DIVE，其目標是提高生成推論的描述性和多樣性。DIVE 涉及兩種方法，即通用推論過濾和對比檢索學習，它們解決了現有視覺常識資源和訓練目標的限制。實驗結果驗證了 DIVE 在描述性和多樣性方面優於視覺常識生成的最新模型，同時在生成獨特和新穎的推論方面表現出優異的品質。值得注意的是，DIVE 在視覺常識圖上達到了人類層級的描述性和多樣性。此外，人類評估證實，DIVE 在描述性和多樣性方面與人類判斷緊密一致。", "author": "Jun-Hyung Park et.al.", "authors": "Jun-Hyung Park, Hyuntae Park, Youjin Kang, Eojin Jeon, SangKeun Lee", "id": "2408.08021v1", "paper_url": "http://arxiv.org/abs/2408.08021v1", "repo": "https://github.com/park-ing-lot/dive"}}