{"2410.20777": {"publish_time": "2024-10-28", "title": "KD-LoRA: A Hybrid Approach to Efficient Fine-Tuning with LoRA and Knowledge Distillation", "paper_summary": "Large language models (LLMs) have demonstrated remarkable performance across\nvarious downstream tasks. However, the high computational and memory\nrequirements of LLMs are a major bottleneck. To address this,\nparameter-efficient fine-tuning (PEFT) methods such as low-rank adaptation\n(LoRA) have been proposed to reduce computational costs while ensuring minimal\nloss in performance. Additionally, knowledge distillation (KD) has been a\npopular choice for obtaining compact student models from teacher models. In\nthis work, we present KD-LoRA, a novel fine-tuning method that combines LoRA\nwith KD. Our results demonstrate that KD-LoRA achieves performance comparable\nto full fine-tuning (FFT) and LoRA while significantly reducing resource\nrequirements. Specifically, KD-LoRA retains 98% of LoRA's performance on the\nGLUE benchmark, while being 40% more compact. Additionally, KD-LoRA reduces GPU\nmemory usage by 30% compared to LoRA, while decreasing inference time by 30%\ncompared to both FFT and LoRA. We evaluate KD-LoRA across three encoder-only\nmodels: BERT, RoBERTa, and DeBERTaV3. Code is available at\nhttps://github.com/rambodazimi/KD-LoRA.", "paper_summary_zh": "大型語言模型 (LLM) 在各種下游任務中展示了非凡的表現。然而，LLM 的高計算和記憶體需求是一個主要的瓶頸。為了解決這個問題，已經提出參數有效微調 (PEFT) 方法，例如低秩適應 (LoRA)，以降低計算成本，同時確保效能的最小損失。此外，知識蒸餾 (KD) 一直是從教師模型中獲取精簡學生模型的熱門選擇。在這項工作中，我們提出了 KD-LoRA，一種結合 LoRA 與 KD 的新微調方法。我們的結果表明，KD-LoRA 達到了與完全微調 (FFT) 和 LoRA 相當的效能，同時顯著降低了資源需求。具體來說，KD-LoRA 在 GLUE 基準測試中保留了 LoRA 98% 的效能，同時精簡了 40%。此外，與 LoRA 相比，KD-LoRA 將 GPU 記憶體使用量減少了 30%，與 FFT 和 LoRA 相比，將推理時間減少了 30%。我們在三個僅編碼器模型：BERT、RoBERTa 和 DeBERTaV3 中評估了 KD-LoRA。程式碼可在 https://github.com/rambodazimi/KD-LoRA 取得。", "author": "Rambod Azimi et.al.", "authors": "Rambod Azimi, Rishav Rishav, Marek Teichmann, Samira Ebrahimi Kahou", "id": "2410.20777v1", "paper_url": "http://arxiv.org/abs/2410.20777v1", "repo": "https://github.com/rambodazimi/kd-lora"}}