{"2411.17375": {"publish_time": "2024-11-26", "title": "The Extractive-Abstractive Spectrum: Uncovering Verifiability Trade-offs in LLM Generations", "paper_summary": "Across all fields of academic study, experts cite their sources when sharing\ninformation. While large language models (LLMs) excel at synthesizing\ninformation, they do not provide reliable citation to sources, making it\ndifficult to trace and verify the origins of the information they present. In\ncontrast, search engines make sources readily accessible to users and place the\nburden of synthesizing information on the user. Through a survey, we find that\nusers prefer search engines over LLMs for high-stakes queries, where concerns\nregarding information provenance outweigh the perceived utility of LLM\nresponses. To examine the interplay between verifiability and utility of\ninformation-sharing tools, we introduce the extractive-abstractive spectrum, in\nwhich search engines and LLMs are extreme endpoints encapsulating multiple\nunexplored intermediate operating points. Search engines are extractive because\nthey respond to queries with snippets of sources with links (citations) to the\noriginal webpages. LLMs are abstractive because they address queries with\nanswers that synthesize and logically transform relevant information from\ntraining and in-context sources without reliable citation. We define five\noperating points that span the extractive-abstractive spectrum and conduct\nhuman evaluations on seven systems across four diverse query distributions that\nreflect real-world QA settings: web search, language simplification, multi-step\nreasoning, and medical advice. As outputs become more abstractive, we find that\nperceived utility improves by as much as 200%, while the proportion of properly\ncited sentences decreases by as much as 50% and users take up to 3 times as\nlong to verify cited information. Our findings recommend distinct operating\npoints for domain-specific LLM systems and our failure analysis informs\napproaches to high-utility LLM systems that empower users to verify\ninformation.", "paper_summary_zh": "<paragraph>在所有學術研究領域中，專家在分享資訊時都會引用他們的來源。儘管大型語言模型 (LLM) 在綜合資訊方面表現優異，但它們並未提供可靠的來源引用，這使得追蹤和驗證他們所提供的資訊來源變得困難。相比之下，搜尋引擎讓使用者可以輕易取得來源，並將綜合資訊的負擔交給使用者。透過一項調查，我們發現使用者在高風險查詢中偏好搜尋引擎而非 LLM，因為對於資訊來源的疑慮大於對 LLM 回應的感知效用。為了探討驗證性和資訊分享工具效用之間的交互作用，我們引入了萃取式-抽象式光譜，其中搜尋引擎和 LLM 是涵蓋多個未探索的中間操作點的極端端點。搜尋引擎是萃取式的，因為它們會以來源片段回應查詢，並附有連結 (引文) 至原始網頁。LLM 是抽象式的，因為它們會以答案回應查詢，這些答案綜合並邏輯性地轉換來自訓練和情境來源的相關資訊，但沒有可靠的引文。我們定義了五個操作點，涵蓋萃取式-抽象式光譜，並對七個系統進行了人為評估，這些系統涵蓋四種不同的查詢分佈，反映了真實世界的問答設定：網路搜尋、語言簡化、多步驟推理和醫療建議。隨著輸出變得更抽象，我們發現感知效用提高了多達 200%，而適當引用的句子比例則減少了多達 50%，使用者驗證引文資訊的時間也增加了 3 倍。我們的研究結果建議針對特定領域的 LLM 系統採用不同的操作點，我們的失敗分析為高效用 LLM 系統提供了方法，讓使用者能夠驗證資訊。</paragraph>", "author": "Theodora Worledge et.al.", "authors": "Theodora Worledge, Tatsunori Hashimoto, Carlos Guestrin", "id": "2411.17375v1", "paper_url": "http://arxiv.org/abs/2411.17375v1", "repo": "https://github.com/guestrin-lab/extractive-abstractive-spectrum"}}