{"2407.05750": {"publish_time": "2024-07-08", "title": "Large Language Models Understand Layouts", "paper_summary": "Large language models (LLMs) demonstrate extraordinary abilities in a wide\nrange of natural language processing (NLP) tasks. In this paper, we show that,\nbeyond text understanding capability, LLMs are capable of processing text\nlayouts that are denoted by spatial markers. They are able to answer questions\nthat require explicit spatial perceiving and reasoning, while a drastic\nperformance drop is observed when the spatial markers from the original data\nare excluded. We perform a series of experiments with the GPT-3.5, Baichuan2,\nLlama2 and ChatGLM3 models on various types of layout-sensitive datasets for\nfurther analysis. The experimental results reveal that the layout understanding\nability of LLMs is mainly introduced by the coding data for pretraining, which\nis further enhanced at the instruction-tuning stage. In addition, layout\nunderstanding can be enhanced by integrating low-cost, auto-generated data\napproached by a novel text game. Finally, we show that layout understanding\nability is beneficial for building efficient visual question-answering (VQA)\nsystems.", "paper_summary_zh": "大型語言模型 (LLM) 在廣泛的自然語言處理 (NLP) 任務中展現出非凡的能力。在本文中，我們展示出，除了理解文本的能力之外，LLM 還能夠處理由空間標記表示的文本佈局。它們能夠回答需要明確的空間感知和推理的問題，而當原始數據中的空間標記被排除時，會觀察到性能急劇下降。我們使用 GPT-3.5、Baichuan2、Llama2 和 ChatGLM3 模型對各種類型的佈局敏感數據集進行了一系列實驗，以進行進一步分析。實驗結果表明，LLM 的佈局理解能力主要是由預訓練的編碼數據引入的，這在指令調整階段進一步增強。此外，佈局理解能力可以通過整合由新穎文本遊戲接近的低成本、自動生成數據得到增強。最後，我們展示了佈局理解能力有助於構建高效的視覺問答 (VQA) 系統。", "author": "Weiming Li et.al.", "authors": "Weiming Li, Manni Duan, Dong An, Yan Shao", "id": "2407.05750v1", "paper_url": "http://arxiv.org/abs/2407.05750v1", "repo": "null"}}