{"2407.11373": {"publish_time": "2024-07-16", "title": "Reliable Reasoning Beyond Natural Language", "paper_summary": "Despite their linguistic competence, Large Language models (LLMs) often\nexhibit limitations in their ability to reason reliably and flexibly. To\naddress this, we propose a neurosymbolic approach that prompts LLMs to extract\nand encode all relevant information from a problem statement as logical code\nstatements, and then use a logic programming language (Prolog) to conduct the\niterative computations of explicit deductive reasoning. Our approach\nsignificantly enhances the performance of LLMs on the standard mathematical\nreasoning benchmark, GSM8k, and the Navigate dataset from the BIG-bench\ndataset. Additionally, we introduce a novel dataset, the Non-Linear Reasoning\n(NLR) dataset, consisting of 55 unique word problems that target the\nshortcomings of the next token prediction paradigm of LLMs and require complex\nnon-linear reasoning but only basic arithmetic skills to solve. Our findings\ndemonstrate that the integration of Prolog enables LLMs to achieve high\nperformance on the NLR dataset, which even the most advanced language models\n(including GPT4) fail to solve using text only.", "paper_summary_zh": "儘管具備語言能力，大型語言模型 (LLM) 經常在可靠且靈活地推理的能力上展現出限制。為了解決此問題，我們提出了一種神經符號方法，提示 LLM 從問題陳述中提取和編碼所有相關資訊作為邏輯程式碼陳述，然後使用邏輯程式設計語言 (Prolog) 進行明確演繹推理的迭代運算。我們的做法顯著提升 LLM 在標準數學推理基準 GSM8k 和 BIG-bench 資料集中的 Navigate 資料集上的效能。此外，我們引進了一個新穎的資料集，非線性推理 (NLR) 資料集，包含 55 個獨特的文字題，針對 LLM 的下一個符號預測範例的缺點，需要複雜的非線性推理，但只需要基本的算術技巧就能解題。我們的發現證明，整合 Prolog 能讓 LLM 在 NLR 資料集上達成高效能，這甚至是進階的語言模型（包含 GPT4）都無法僅使用文字解題的。", "author": "Nasim Borazjanizadeh et.al.", "authors": "Nasim Borazjanizadeh, Steven T. Piantadosi", "id": "2407.11373v1", "paper_url": "http://arxiv.org/abs/2407.11373v1", "repo": "null"}}