{"2501.13893": {"publish_time": "2025-01-23", "title": "Pix2Cap-COCO: Advancing Visual Comprehension via Pixel-Level Captioning", "paper_summary": "We present Pix2Cap-COCO, the first panoptic pixel-level caption dataset\ndesigned to advance fine-grained visual understanding. To achieve this, we\ncarefully design an automated annotation pipeline that prompts GPT-4V to\ngenerate pixel-aligned, instance-specific captions for individual objects\nwithin images, enabling models to learn more granular relationships between\nobjects and their contexts. This approach results in 167,254 detailed captions,\nwith an average of 22.94 words per caption. Building on Pix2Cap-COCO, we\nintroduce a novel task, panoptic segmentation-captioning, which challenges\nmodels to recognize instances in an image and provide detailed descriptions for\neach simultaneously. To benchmark this task, we design a robust baseline based\non X-Decoder. The experimental results demonstrate that Pix2Cap-COCO is a\nparticularly challenging dataset, as it requires models to excel in both\nfine-grained visual understanding and detailed language generation.\nFurthermore, we leverage Pix2Cap-COCO for Supervised Fine-Tuning (SFT) on large\nmultimodal models (LMMs) to enhance their performance. For example, training\nwith Pix2Cap-COCO significantly improves the performance of GPT4RoI, yielding\ngains in CIDEr +1.4%, ROUGE +0.4%, and SPICE +0.5% on Visual Genome dataset,\nand strengthens its region understanding ability on the ViP-BENCH, with an\noverall improvement of +5.1%, including notable increases in recognition\naccuracy +11.2% and language generation quality +22.2%.", "paper_summary_zh": "<paragraph>我們提出 Pix2Cap-COCO，這是第一個全景像素級標題資料集，旨在推進精細的視覺理解。為此，我們仔細設計了一個自動化標註管道，提示 GPT-4V 為影像中的個別物件產生像素對齊的特定實例標題，使模型能夠學習物件及其脈絡之間更細緻的關係。此方法產生了 167,254 個詳細標題，每個標題平均有 22.94 個字。在 Pix2Cap-COCO 的基礎上，我們引入了一項新任務，全景分割標題，它挑戰模型識別影像中的實例，並同時為每個實例提供詳細描述。為了對此任務進行基準測試，我們設計了一個基於 X-Decoder 的穩健基準。實驗結果表明，Pix2Cap-COCO 是一個特別具有挑戰性的資料集，因為它要求模型在精細的視覺理解和詳細的語言生成方面都表現出色。此外，我們利用 Pix2Cap-COCO 對大型多模態模型 (LMM) 進行監督微調 (SFT)，以增強其效能。例如，使用 Pix2Cap-COCO 進行訓練可顯著提升 GPT4RoI 的效能，在 Visual Genome 資料集上獲得 CIDEr +1.4%、ROUGE +0.4% 和 SPICE +0.5% 的提升，並在 ViP-BENCH 上增強其區域理解能力，整體提升 +5.1%，包括識別準確度 +11.2% 和語言生成品質 +22.2% 的顯著提升。</paragraph>", "author": "Zuyao You et.al.", "authors": "Zuyao You, Junke Wang, Lingyu Kong, Bo He, Zuxuan Wu", "id": "2501.13893v1", "paper_url": "http://arxiv.org/abs/2501.13893v1", "repo": "https://github.com/geshang777/pix2cap"}}