{"2405.18015": {"publish_time": "2024-05-28", "title": "MultiADE: A Multi-domain Benchmark for Adverse Drug Event Extraction", "paper_summary": "Objective. Active adverse event surveillance monitors Adverse Drug Events\n(ADE) from different data sources, such as electronic health records, medical\nliterature, social media and search engine logs. Over years, many datasets are\ncreated, and shared tasks are organised to facilitate active adverse event\nsurveillance. However, most-if not all-datasets or shared tasks focus on\nextracting ADEs from a particular type of text. Domain generalisation-the\nability of a machine learning model to perform well on new, unseen domains\n(text types)-is under-explored. Given the rapid advancements in natural\nlanguage processing, one unanswered question is how far we are from having a\nsingle ADE extraction model that are effective on various types of text, such\nas scientific literature and social media posts}. Methods. We contribute to\nanswering this question by building a multi-domain benchmark for adverse drug\nevent extraction, which we named MultiADE. The new benchmark comprises several\nexisting datasets sampled from different text types and our newly created\ndataset-CADECv2, which is an extension of CADEC (Karimi, et al., 2015),\ncovering online posts regarding more diverse drugs than CADEC. Our new dataset\nis carefully annotated by human annotators following detailed annotation\nguidelines. Conclusion. Our benchmark results show that the generalisation of\nthe trained models is far from perfect, making it infeasible to be deployed to\nprocess different types of text. In addition, although intermediate transfer\nlearning is a promising approach to utilising existing resources, further\ninvestigation is needed on methods of domain adaptation, particularly\ncost-effective methods to select useful training instances.", "paper_summary_zh": "<paragraph>目的。主动不良事件监测从电子健康记录、医学文献、社交媒体和搜索引擎日志等不同数据源监测不良药物事件 (ADE)。多年来，创建了许多数据集，并组织了共享任务以促进主动不良事件监测。然而，大多数（如果不是全部）数据集或共享任务都专注于从特定类型的文本中提取 ADE。领域泛化——机器学习模型在新领域（文本类型）中表现良好的能力——尚未得到充分探索。鉴于自然语言处理的快速发展，一个尚未回答的问题是我们离拥有一个对各种类型的文本（如科学文献和社交媒体帖子）有效的单一 ADE 提取模型还有多远。方法。我们通过构建一个多领域不良药物事件提取基准来回答这个问题，我们将其命名为 MultiADE。新的基准包含几个从不同文本类型中抽取的现有数据集和我们新创建的数据集-CADECv2，它是 CADEC（Karimi 等人，2015 年）的扩展，涵盖了比 CADEC 更广泛的药物的在线帖子。我们的新数据集由人类注释者按照详细的注释指南仔细注释。结论。我们的基准结果表明，训练模型的泛化远不完美，使其无法部署到处理不同类型的文本中。此外，尽管中间迁移学习是利用现有资源的一种有前途的方法，但仍需要进一步研究领域自适应的方法，特别是选择有用训练实例的经济有效的方法。</paragraph>", "author": "Xiang Dai et.al.", "authors": "Xiang Dai, Sarvnaz Karimi, Abeed Sarker, Ben Hachey, Cecile Paris", "id": "2405.18015v1", "paper_url": "http://arxiv.org/abs/2405.18015v1", "repo": "null"}}