{"2408.05940": {"publish_time": "2024-08-12", "title": "Spb3DTracker: A Robust LiDAR-Based Person Tracker for Noisy Environment", "paper_summary": "Person detection and tracking (PDT) has seen significant advancements with 2D\ncamera-based systems in the autonomous vehicle field, leading to widespread\nadoption of these algorithms. However, growing privacy concerns have recently\nemerged as a major issue, prompting a shift towards LiDAR-based PDT as a viable\nalternative. Within this domain, \"Tracking-by-Detection\" (TBD) has become a\nprominent methodology. Despite its effectiveness, LiDAR-based PDT has not yet\nachieved the same level of performance as camera-based PDT. This paper examines\nkey components of the LiDAR-based PDT framework, including detection\npost-processing, data association, motion modeling, and lifecycle management.\nBuilding upon these insights, we introduce SpbTrack, a robust person tracker\ndesigned for diverse environments. Our method achieves superior performance on\nnoisy datasets and state-of-the-art results on KITTI Dataset benchmarks and\ncustom office indoor dataset among LiDAR-based trackers.", "paper_summary_zh": "行人偵測與追蹤 (PDT) 已在自駕車領域中，透過 2D 攝影機為基礎的系統取得顯著的進展，並廣泛採用這些演算法。然而，日益增長的隱私問題最近已成為一個主要議題，促使轉向以 LiDAR 為基礎的 PDT 作為可行的替代方案。在這個領域中，「追蹤偵測」(TBD) 已成為一個顯著的方法。儘管其有效性，但以 LiDAR 為基礎的 PDT 尚未達到與以攝影機為基礎的 PDT 相同的效能。本文探討以 LiDAR 為基礎的 PDT 架構之關鍵組成，包括偵測後處理、資料關聯、動作建模和生命週期管理。根據這些見解，我們引進 SpbTrack，一個強健的行人追蹤器，專為多樣化的環境而設計。我們的技術在有雜訊的資料集上達成卓越的效能，並在 LiDAR 為基礎的追蹤器中，於 KITTI 資料集基準和自訂辦公室室內資料集上達成最先進的結果。", "author": "Eunsoo Im et.al.", "authors": "Eunsoo Im, Changhyun Jee, Jung Kwon Lee", "id": "2408.05940v2", "paper_url": "http://arxiv.org/abs/2408.05940v2", "repo": "null"}}