{"2406.14266": {"publish_time": "2024-06-20", "title": "Intelligent Interface: Enhancing Lecture Engagement with Didactic Activity Summaries", "paper_summary": "Recently, multiple applications of machine learning have been introduced.\nThey include various possibilities arising when image analysis methods are\napplied to, broadly understood, video streams. In this context, a novel tool,\ndeveloped for academic educators to enhance the teaching process by automating,\nsummarizing, and offering prompt feedback on conducting lectures, has been\ndeveloped. The implemented prototype utilizes machine learning-based techniques\nto recognise selected didactic and behavioural teachers' features within\nlecture video recordings.\n  Specifically, users (teachers) can upload their lecture videos, which are\npreprocessed and analysed using machine learning models. Next, users can view\nsummaries of recognized didactic features through interactive charts and\ntables. Additionally, stored ML-based prediction results support comparisons\nbetween lectures based on their didactic content. In the developed application\ntext-based models trained on lecture transcriptions, with enhancements to the\ntranscription quality, by adopting an automatic speech recognition solution are\napplied. Furthermore, the system offers flexibility for (future) integration of\nnew/additional machine-learning models and software modules for image and video\nanalysis.", "paper_summary_zh": "近期，機器學習的多種應用已陸續推出。\n其中包括將影像分析方法應用於廣義的影片串流時出現的各種可能性。在此脈絡下，已開發出一種新工具，供學術教育者透過自動化、摘要和提供關於進行演講的即時回饋來增強教學過程。已實作的原型利用基於機器學習的技術，在演講影片錄製中辨識選定的教學和行為教師特徵。\n具體來說，使用者（教師）可以上傳他們的演講影片，這些影片會使用機器學習模型進行預處理和分析。接著，使用者可以透過互動式圖表和表格檢視已辨識教學特徵的摘要。此外，儲存的基於 ML 的預測結果支援根據教學內容比較演講。在已開發的應用程式中，已套用在演講轉錄上訓練的基於文字的模型，並透過採用自動語音辨識解決方案來提升轉錄品質。此外，此系統提供彈性，可（未來）整合新的/額外的機器學習模型和用於影像和影片分析的軟體模組。", "author": "Anna Wróblewska et.al.", "authors": "Anna Wróblewska, Marcel Witas, Kinga Frańczak, Arkadiusz Kniaź, Siew Ann Cheong, Tan Seng Chee, Janusz Hołyst, Marcin Paprzycki", "id": "2406.14266v1", "paper_url": "http://arxiv.org/abs/2406.14266v1", "repo": "null"}}