{"2405.03842": {"publish_time": "2024-05-06", "title": "A Novel Cross-band CSI Prediction Scheme for Multi-band Fingerprint based Localization", "paper_summary": "Because of the advantages of computation complexity compared with traditional\nlocalization algorithms, fingerprint based localization is getting increasing\ndemand. Expanding the fingerprint database from the frequency domain by channel\nreconstruction can improve localization accuracy. However, in a mobility\nenvironment, the channel reconstruction accuracy is limited by the time-varying\nparameters. In this paper, we proposed a system to extract the time-varying\nparameters based on space-alternating generalized expectation maximization\n(SAGE) algorithm, then used variational auto-encoder (VAE) to reconstruct the\nchannel state information on another channel. The proposed scheme is tested on\nthe data generated by the deep-MIMO channel model. Mathematical analysis for\nthe viability of our system is also shown in this paper.", "paper_summary_zh": "由於運算複雜度優於傳統定位演算法，因此基於指紋的定位越來越受到重視。透過通道重建從頻域擴充指紋資料庫可以提升定位的準確度。然而，在一個移動環境中，通道重建的準確度會受到時變參數的限制。在本文中，我們提出了一個系統，以空間交替廣義期望最大化 (SAGE) 演算法萃取出時變參數，然後使用變異自動編碼器 (VAE) 在另一個通道上重建通道狀態資訊。我們在深層 MIMO 通道模型所產生的資料上測試了所提出的方案。本文也顯示了對我們系統可行性的數學分析。", "author": "Yuan Ruihao et.al.", "authors": "Yuan Ruihao, Huang Kaixuan, Zhang Shunqing", "id": "2405.03842v1", "paper_url": "http://arxiv.org/abs/2405.03842v1", "repo": "null"}}