{"2411.09420": {"publish_time": "2024-11-14", "title": "SAG-ViT: A Scale-Aware, High-Fidelity Patching Approach with Graph Attention for Vision Transformers", "paper_summary": "Image classification is a computer vision task where a model analyzes an\nimage to categorize it into a specific label. Vision Transformers (ViT) improve\nthis task by leveraging self-attention to capture complex patterns and long\nrange relationships between image patches. However, a key challenge for ViTs is\nefficiently incorporating multiscale feature representations, which is inherent\nin CNNs through their hierarchical structure. In this paper, we introduce the\nScale-Aware Graph Attention Vision Transformer (SAG-ViT), a novel framework\nthat addresses this challenge by integrating multi-scale features. Using\nEfficientNet as a backbone, the model extracts multi-scale feature maps, which\nare divided into patches to preserve semantic information. These patches are\norganized into a graph based on spatial and feature similarities, with a Graph\nAttention Network (GAT) refining the node embeddings. Finally, a Transformer\nencoder captures long-range dependencies and complex interactions. The SAG-ViT\nis evaluated on benchmark datasets, demonstrating its effectiveness in\nenhancing image classification performance.", "paper_summary_zh": "影像分類是一種電腦視覺任務，其中模型會分析影像並將其分類為特定標籤。視覺Transformer (ViT) 透過利用自我注意力來捕捉複雜模式和影像區塊之間的長距離關係，進而改善此任務。然而，ViT 的一項主要挑戰是有效地結合多尺度特徵表示，而這在 CNN 中透過其階層結構是與生俱來的。在本文中，我們介紹了尺度感知圖注意力視覺Transformer (SAG-ViT)，這是一個新穎的架構，透過整合多尺度特徵來解決此挑戰。模型以 EfficientNet 為基礎，提取多尺度特徵圖，並將其分割為區塊以保留語義資訊。這些區塊根據空間和特徵相似性組織成一個圖形，並透過圖形注意力網路 (GAT) 來改善節點嵌入。最後，Transformer編碼器會捕捉長距離依賴關係和複雜互動。SAG-ViT 在基準資料集上進行評估，證明其在增強影像分類效能方面的有效性。", "author": "Shravan Venkatraman et.al.", "authors": "Shravan Venkatraman, Jaskaran Singh Walia, Joe Dhanith P R", "id": "2411.09420v1", "paper_url": "http://arxiv.org/abs/2411.09420v1", "repo": "null"}}