{"2502.10614": {"publish_time": "2025-02-15", "title": "Optimizing CNN Architectures for Advanced Thoracic Disease Classification", "paper_summary": "Machine learning, particularly convolutional neural networks (CNNs), has\nshown promise in medical image analysis, especially for thoracic disease\ndetection using chest X-ray images. In this study, we evaluate various CNN\narchitectures, including binary classification, multi-label classification, and\nResNet50 models, to address challenges like dataset imbalance, variations in\nimage quality, and hidden biases. We introduce advanced preprocessing\ntechniques such as principal component analysis (PCA) for image compression and\npropose a novel class-weighted loss function to mitigate imbalance issues. Our\nresults highlight the potential of CNNs in medical imaging but emphasize that\nissues like unbalanced datasets and variations in image acquisition methods\nmust be addressed for optimal model performance.", "paper_summary_zh": "機器學習，特別是卷積神經網路 (CNN) 已在醫學影像分析中展現出潛力，特別是使用胸部 X 光影像進行胸腔疾病偵測。在此研究中，我們評估各種 CNN 架構，包括二元分類、多標籤分類和 ResNet50 模型，以解決資料集不平衡、影像品質差異和隱藏偏差等挑戰。我們導入進階前處理技術，例如主成分分析 (PCA) 以進行影像壓縮，並提出一個新穎的類別加權損失函數來緩解不平衡問題。我們的結果突顯了 CNN 在醫學影像中的潛力，但強調必須解決資料集不平衡和影像擷取方法差異等問題，才能獲得最佳模型效能。", "author": "Tejas Mirthipati et.al.", "authors": "Tejas Mirthipati", "id": "2502.10614v1", "paper_url": "http://arxiv.org/abs/2502.10614v1", "repo": "null"}}