{"2407.18992": {"publish_time": "2024-07-26", "title": "Towards Automated Solution Recipe Generation for Industrial Asset Management with LLM", "paper_summary": "This study introduces a novel approach to Industrial Asset Management (IAM)\nby incorporating Conditional-Based Management (CBM) principles with the latest\nadvancements in Large Language Models (LLMs). Our research introduces an\nautomated model-building process, traditionally reliant on intensive\ncollaboration between data scientists and domain experts. We present two\nprimary innovations: a taxonomy-guided prompting generation that facilitates\nthe automatic creation of AI solution recipes and a set of LLM pipelines\ndesigned to produce a solution recipe containing a set of artifacts composed of\ndocuments, sample data, and models for IAM. These pipelines, guided by\nstandardized principles, enable the generation of initial solution templates\nfor heterogeneous asset classes without direct human input, reducing reliance\non extensive domain knowledge and enhancing automation. We evaluate our\nmethodology by assessing asset health and sustainability across a spectrum of\nten asset classes. Our findings illustrate the potential of LLMs and\ntaxonomy-based LLM prompting pipelines in transforming asset management,\noffering a blueprint for subsequent research and development initiatives to be\nintegrated into a rapid client solution.", "paper_summary_zh": "本研究引入了一種創新的工業資產管理 (IAM) 方法，方法是將基於條件的管理 (CBM) 原則與大型語言模型 (LLM) 的最新進展相結合。我們的研究引入了一個自動化模型建構流程，傳統上依賴於數據科學家和領域專家之間的密集合作。我們提出了兩項主要的創新：一種分類引導的提示生成，它促進了 AI 解決方案配方（recipe）的自動創建，以及一組 LLM 管道，旨在產生一個解決方案配方，其中包含一組由文件、範例資料和 IAM 模型組成的成品。這些管道在標準化原則的指導下，能夠為異質資產類別產生初始解決方案範本，無需直接的人工輸入，從而減少對廣泛領域知識的依賴並增強自動化。我們通過評估十個資產類別的資產健康狀況和永續性來評估我們的技術。我們的研究結果說明了 LLM 和基於分類的 LLM 提示管線在轉型資產管理方面的潛力，為後續的研究和開發計畫提供了藍圖，這些計畫將整合到快速客戶解決方案中。", "author": "Nianjun Zhou et.al.", "authors": "Nianjun Zhou, Dhaval Patel, Shuxin Lin, Fearghal O'Donncha", "id": "2407.18992v1", "paper_url": "http://arxiv.org/abs/2407.18992v1", "repo": "null"}}