{"2405.14767": {"publish_time": "2024-05-23", "title": "FinRobot: An Open-Source AI Agent Platform for Financial Applications using Large Language Models", "paper_summary": "As financial institutions and professionals increasingly incorporate Large\nLanguage Models (LLMs) into their workflows, substantial barriers, including\nproprietary data and specialized knowledge, persist between the finance sector\nand the AI community. These challenges impede the AI community's ability to\nenhance financial tasks effectively. Acknowledging financial analysis's\ncritical role, we aim to devise financial-specialized LLM-based toolchains and\ndemocratize access to them through open-source initiatives, promoting wider AI\nadoption in financial decision-making.\n  In this paper, we introduce FinRobot, a novel open-source AI agent platform\nsupporting multiple financially specialized AI agents, each powered by LLM.\nSpecifically, the platform consists of four major layers: 1) the Financial AI\nAgents layer that formulates Financial Chain-of-Thought (CoT) by breaking\nsophisticated financial problems down into logical sequences; 2) the Financial\nLLM Algorithms layer dynamically configures appropriate model application\nstrategies for specific tasks; 3) the LLMOps and DataOps layer produces\naccurate models by applying training/fine-tuning techniques and using\ntask-relevant data; 4) the Multi-source LLM Foundation Models layer that\nintegrates various LLMs and enables the above layers to access them directly.\nFinally, FinRobot provides hands-on for both professional-grade analysts and\nlaypersons to utilize powerful AI techniques for advanced financial analysis.\nWe open-source FinRobot at\n\\url{https://github.com/AI4Finance-Foundation/FinRobot}.", "paper_summary_zh": "隨著金融機構和專業人士將大型語言模型（LLM）納入其工作流程，專有數據和專業知識等實質性障礙持續存在於金融部門和 AI 社群之間。這些挑戰阻礙了 AI 社群有效提升金融任務的能力。認識到金融分析的關鍵作用，我們旨在設計以 LLM 為基礎的金融專業工具鏈，並透過開源計畫讓所有人都能使用它們，以促進在金融決策中更廣泛地採用 AI。\n在本文中，我們介紹 FinRobot，一個新穎的開源 AI 代理平台，支援多個以 LLM 為動力的金融專業 AI 代理。具體來說，這個平台包含四個主要層級：1) 金融 AI 代理層，透過將複雜的金融問題分解為邏輯序列，制定金融思維鏈（CoT）；2) 金融 LLM 演算法層，針對特定任務動態配置適當的模型應用策略；3) LLMOps 和 DataOps 層，透過應用訓練/微調技術並使用與任務相關的數據，產生準確的模型；4) 多來源 LLM 基礎模型層，整合各種 LLM 並讓上述層級能夠直接存取它們。\n最後，FinRobot 為專業級分析師和外行人提供實作方式，以利用強大的 AI 技術進行進階的金融分析。我們在\n\\url{https://github.com/AI4Finance-Foundation/FinRobot} 開源 FinRobot。", "author": "Hongyang Yang et.al.", "authors": "Hongyang Yang, Boyu Zhang, Neng Wang, Cheng Guo, Xiaoli Zhang, Likun Lin, Junlin Wang, Tianyu Zhou, Mao Guan, Runjia Zhang, Christina Dan Wang", "id": "2405.14767v1", "paper_url": "http://arxiv.org/abs/2405.14767v1", "repo": "https://github.com/ai4finance-foundation/finrobot"}}