{"2410.24070": {"publish_time": "2024-10-31", "title": "Dynamical similarity analysis uniquely captures how computations develop in RNNs", "paper_summary": "Methods for analyzing representations in neural systems are increasingly\npopular tools in neuroscience and mechanistic interpretability. Measures\ncomparing neural activations across conditions, architectures, and species give\nscalable ways to understand information transformation within different neural\nnetworks. However, recent findings show that some metrics respond to spurious\nsignals, leading to misleading results. Establishing benchmark test cases is\nthus essential for identifying the most reliable metric and potential\nimprovements. We propose that compositional learning in recurrent neural\nnetworks (RNNs) can provide a test case for dynamical representation alignment\nmetrics. Implementing this case allows us to evaluate if metrics can identify\nrepresentations that develop throughout learning and determine if\nrepresentations identified by metrics reflect the network's actual\ncomputations. Building both attractor and RNN based test cases, we show that\nthe recently proposed Dynamical Similarity Analysis (DSA) is more noise robust\nand reliably identifies behaviorally relevant representations compared to prior\nmetrics (Procrustes, CKA). We also demonstrate how such test cases can extend\nbeyond metric evaluation to study new architectures. Specifically, testing DSA\nin modern (Mamba) state space models suggests that these models, unlike RNNs,\nmay not require changes in recurrent dynamics due to their expressive hidden\nstates. Overall, we develop test cases that showcase how DSA's enhanced ability\nto detect dynamical motifs makes it highly effective for identifying ongoing\ncomputations in RNNs and revealing how networks learn tasks.", "paper_summary_zh": "神經系統中分析表徵的方法在神經科學和機制可解釋性中越來越受歡迎。比較神經活化在不同條件、架構和物種中的測量方法提供了可擴充的方法來了解不同神經網路中的資訊轉換。然而，最近的研究發現，有些指標會對虛假訊號產生反應，導致結果具有誤導性。因此，建立基準測試案例對於找出最可靠的指標和潛在的改善方法至關重要。我們提出，遞迴神經網路 (RNN) 中的組合學習可以提供一個測試案例，用於動態表徵比對指標。實作這個案例讓我們能夠評估指標是否能找出在整個學習過程中發展的表徵，並確定指標所找出的表徵是否反映了網路的實際運算。透過建立吸引子 (attractor) 和基於 RNN 的測試案例，我們展示了最近提出的動態相似性分析 (DSA) 在雜訊中更強健，而且與之前的指標 (Procrustes、CKA) 相比，更可靠地找出與行為相關的表徵。我們也展示了這些測試案例如何擴充到指標評估以外，用於研究新的架構。特別是，在現代 (Mamba) 狀態空間模型中測試 DSA，顯示這些模型與 RNN 不同，可能不需要改變遞迴動態，因為它們具有表現力的隱藏狀態。總體而言，我們開發了測試案例，展示 DSA 增強的動態模式偵測能力如何讓它能非常有效地找出 RNN 中正在進行的運算，並揭示網路如何學習任務。", "author": "Quentin Guilhot et.al.", "authors": "Quentin Guilhot, Michał Wójcik, Jascha Achterberg, Rui Ponte Costa", "id": "2410.24070v2", "paper_url": "http://arxiv.org/abs/2410.24070v2", "repo": "https://github.com/qglht/repal"}}