{"2409.08351": {"publish_time": "2024-09-12", "title": "Bayesian Inverse Graphics for Few-Shot Concept Learning", "paper_summary": "Humans excel at building generalizations of new concepts from just one single\nexample. Contrary to this, current computer vision models typically require\nlarge amount of training samples to achieve a comparable accuracy. In this work\nwe present a Bayesian model of perception that learns using only minimal data,\na prototypical probabilistic program of an object. Specifically, we propose a\ngenerative inverse graphics model of primitive shapes, to infer posterior\ndistributions over physically consistent parameters from one or several images.\nWe show how this representation can be used for downstream tasks such as\nfew-shot classification and pose estimation. Our model outperforms existing\nfew-shot neural-only classification algorithms and demonstrates generalization\nacross varying lighting conditions, backgrounds, and out-of-distribution\nshapes. By design, our model is uncertainty-aware and uses our new\ndifferentiable renderer for optimizing global scene parameters through gradient\ndescent, sampling posterior distributions over object parameters with Markov\nChain Monte Carlo (MCMC), and using a neural based likelihood function.", "paper_summary_zh": "人類擅長僅從一個單一範例建立新概念的概括。與此相反，目前的電腦視覺模型通常需要大量的訓練樣本才能達到可比較的準確度。在這項工作中，我們提出一個貝氏感知模型，它僅使用最少的數據進行學習，一個物體的原型機率程式。具體來說，我們提出一個原始形狀的生成式反向圖形模型，以從一個或多個影像推論出物理一致參數上的後驗分佈。我們展示如何將此表徵用於下游任務，例如少樣本分類和姿勢估計。我們的模型優於現有的僅神經少樣本分類演算法，並展示了在不同光照條件、背景和分布外形狀下的概括能力。根據設計，我們的模型具有不確定性感知，並使用我們新的可微分渲染器透過梯度下降最佳化全局場景參數，使用馬可夫鏈蒙地卡羅 (MCMC) 對物件參數進行後驗分佈取樣，並使用基於神經的似然函數。", "author": "Octavio Arriaga et.al.", "authors": "Octavio Arriaga, Jichen Guo, Rebecca Adam, Sebastian Houben, Frank Kirchner", "id": "2409.08351v1", "paper_url": "http://arxiv.org/abs/2409.08351v1", "repo": "null"}}