{"2408.12979": {"publish_time": "2024-08-23", "title": "Internal and External Knowledge Interactive Refinement Framework for Knowledge-Intensive Question Answering", "paper_summary": "Recent works have attempted to integrate external knowledge into LLMs to\naddress the limitations and potential factual errors in LLM-generated content.\nHowever, how to retrieve the correct knowledge from the large amount of\nexternal knowledge imposes a challenge. To this end, we empirically observe\nthat LLMs have already encoded rich knowledge in their pretrained parameters\nand utilizing these internal knowledge improves the retrieval of external\nknowledge when applying them to knowledge-intensive tasks. In this paper, we\npropose a new internal and external knowledge interactive refinement paradigm\ndubbed IEKR to utilize internal knowledge in LLM to help retrieve relevant\nknowledge from the external knowledge base, as well as exploit the external\nknowledge to refine the hallucination of generated internal knowledge. By\nsimply adding a prompt like 'Tell me something about' to the LLMs, we try to\nreview related explicit knowledge and insert them with the query into the\nretriever for external retrieval. The external knowledge is utilized to\ncomplement the internal knowledge into input of LLM for answers. We conduct\nexperiments on 3 benchmark datasets in knowledge-intensive question answering\ntask with different LLMs and domains, achieving the new state-of-the-art.\nFurther analysis shows the effectiveness of different modules in our approach.", "paper_summary_zh": "最近的研究尝试将外部知识整合到 LLM 中，以解决 LLM 生成的内容中存在的局限性和潜在的事实错误。然而，如何从大量的外部知识中检索到正确的知识是一个挑战。为此，我们通过经验观察到，LLM 已在其预训练参数中编码了丰富的知识，利用这些内部知识可以改善在将它们应用于知识密集型任务时检索外部知识。在本文中，我们提出了一种新的内部和外部知识交互式细化范例，称为 IEKR，以利用 LLM 中的内部知识来帮助从外部知识库中检索相关知识，并利用外部知识来细化生成的内部知识的幻觉。通过简单地向 LLM 添加一个提示，如“告诉我一些关于”的内容，我们尝试查看相关的显式知识，并将它们与查询一起插入检索器中以进行外部检索。外部知识被用来补充 LLM 输入中的内部知识以获得答案。我们使用不同的 LLM 和领域对知识密集型问题回答任务中的 3 个基准数据集进行了实验，取得了新的最先进技术。进一步的分析显示了我们方法中不同模块的有效性。", "author": "Haowei Du et.al.", "authors": "Haowei Du, Dongyan Zhao", "id": "2408.12979v1", "paper_url": "http://arxiv.org/abs/2408.12979v1", "repo": "null"}}