{"2406.16767": {"publish_time": "2024-06-24", "title": "The GPT-WritingPrompts Dataset: A Comparative Analysis of Character Portrayal in Short Stories", "paper_summary": "The improved generative capabilities of large language models have made them\na powerful tool for creative writing and storytelling. It is therefore\nimportant to quantitatively understand the nature of generated stories, and how\nthey differ from human storytelling. We augment the Reddit WritingPrompts\ndataset with short stories generated by GPT-3.5, given the same prompts. We\nquantify and compare the emotional and descriptive features of storytelling\nfrom both generative processes, human and machine, along a set of six\ndimensions. We find that generated stories differ significantly from human\nstories along all six dimensions, and that human and machine generations\ndisplay similar biases when grouped according to the narrative point-of-view\nand gender of the main protagonist. We release our dataset and code at\nhttps://github.com/KristinHuangg/gpt-writing-prompts.", "paper_summary_zh": "大型語言模型生成能力的提升，讓它們成為創作寫作和說故事的有力工具。因此，定量了解生成故事的本質，以及它們與人類說故事的不同之處，非常重要。我們使用 GPT-3.5 生成的短篇故事，擴充了 Reddit WritingPrompts 資料集，並給予相同的提示。我們量化並比較了來自生成過程（人類和機器）的情感和描述性說故事特徵，並沿著六個面向進行比較。我們發現，生成的故事在所有六個面向都與人類的故事有顯著差異，並且當根據敘事觀點和主要角色的性別進行分組時，人類和機器產生的故事會展現出類似的偏見。我們在 https://github.com/KristinHuangg/gpt-writing-prompts 釋出我們的資料集和程式碼。", "author": "Xi Yu Huang et.al.", "authors": "Xi Yu Huang, Krishnapriya Vishnubhotla, Frank Rudzicz", "id": "2406.16767v1", "paper_url": "http://arxiv.org/abs/2406.16767v1", "repo": "https://github.com/kristinhuangg/gpt-writing-prompts"}}