{"2502.14838": {"publish_time": "2025-02-20", "title": "Revealing and Mitigating Over-Attention in Knowledge Editing", "paper_summary": "Large Language Models have demonstrated superior performance across a wide\nrange of tasks, but they still exhibit undesirable errors due to incorrect\nknowledge learned from the training data. To avoid this, knowledge editing\nmethods emerged to precisely edit the specific model knowledge via efficiently\nmodifying a very small percentage of parameters. % However, those methods can\nlead to the problem of Specificity Failure: when the content related to the\nedited knowledge occurs in the context, it can inadvertently corrupt other\npre-existing knowledge. However, those methods can lead to the problem of\nSpecificity Failure, where the existing knowledge and capabilities are severely\ndegraded due to editing. Our preliminary indicates that Specificity Failure\nprimarily stems from the model's attention heads assigning excessive attention\nscores to entities related to the edited knowledge, thereby unduly focusing on\nspecific snippets within the context, which we denote as the Attention Drift\nphenomenon. To mitigate such Attention Drift issue, we introduce a simple yet\neffective method Selective Attention Drift Restriction}(SADR), which introduces\nan additional regularization term during the knowledge editing process to\nrestrict changes in the attention weight distribution, thereby preventing undue\nfocus on the edited entity. Experiments on five frequently used strong LLMs\ndemonstrate the effectiveness of our method, where SADR can significantly\nmitigate Specificity Failure in the predominant knowledge editing tasks.", "paper_summary_zh": "大型語言模型已在廣泛任務中展現出卓越的效能，但由於從訓練資料中學習到不正確的知識，它們仍會出現令人不滿意的錯誤。為避免此情況，知識編輯方法應運而生，透過有效修改極少數參數來精準編輯特定模型知識。% 然而，這些方法可能會導致特異性失敗問題：當與已編輯知識相關的內容出現在文中時，可能會無意間損害其他既有知識。然而，這些方法可能會導致特異性失敗問題，因為現有知識和能力會因編輯而嚴重降低。我們的初步研究表明，特異性失敗主要源於模型的注意力權重將過度注意力分數分配給與已編輯知識相關的實體，從而過度關注文中特定的片段，我們將此現象稱為注意力偏移。為減輕這種注意力偏移問題，我們引入了一個簡單但有效的方法選擇性注意力偏移限制}(SADR)，在知識編輯過程中引入一個額外的正則化項來限制注意力權重分配的變動，從而防止過度關注已編輯實體。在五個經常使用的強大 LLM 上進行的實驗證明了我們方法的有效性，其中 SADR 可以顯著減輕主要知識編輯任務中的特異性失敗。", "author": "Pinzheng Wang et.al.", "authors": "Pinzheng Wang, Zecheng Tang, Keyan Zhou, Juntao Li, Qiaoming Zhu, Min Zhang", "id": "2502.14838v1", "paper_url": "http://arxiv.org/abs/2502.14838v1", "repo": "null"}}