{"2407.04538": {"publish_time": "2024-07-05", "title": "PDiscoFormer: Relaxing Part Discovery Constraints with Vision Transformers", "paper_summary": "Computer vision methods that explicitly detect object parts and reason on\nthem are a step towards inherently interpretable models. Existing approaches\nthat perform part discovery driven by a fine-grained classification task make\nvery restrictive assumptions on the geometric properties of the discovered\nparts; they should be small and compact. Although this prior is useful in some\ncases, in this paper we show that pre-trained transformer-based vision models,\nsuch as self-supervised DINOv2 ViT, enable the relaxation of these constraints.\nIn particular, we find that a total variation (TV) prior, which allows for\nmultiple connected components of any size, substantially outperforms previous\nwork. We test our approach on three fine-grained classification benchmarks:\nCUB, PartImageNet and Oxford Flowers, and compare our results to previously\npublished methods as well as a re-implementation of the state-of-the-art method\nPDiscoNet with a transformer-based backbone. We consistently obtain substantial\nimprovements across the board, both on part discovery metrics and the\ndownstream classification task, showing that the strong inductive biases in\nself-supervised ViT models require to rethink the geometric priors that can be\nused for unsupervised part discovery.", "paper_summary_zh": "電腦視覺方法明確偵測物件部分並對其進行推理，這是朝向內在可解釋模型邁進的一步。現有方法執行由細緻分類任務驅動的部分發現，對發現部分的幾何屬性做出非常嚴格的假設；它們應該小而緊湊。雖然此先驗在某些情況下很有用，但在本文中，我們展示了預先訓練好的基於轉換器的視覺模型（例如自監督 DINOv2 ViT）能夠放寬這些約束。特別是，我們發現允許多個任意大小的連接組件的總變異 (TV) 先驗，大幅優於先前的研究。我們在三個細緻分類基準測試：CUB、PartImageNet 和 Oxford Flowers 上測試我們的做法，並將我們的結果與先前發表的各種方法以及使用基於轉換器的骨幹對最先進方法 PDiscoNet 進行重新實作的方法進行比較。我們在各方面持續獲得大幅改善，無論是在部分發現指標或下游分類任務上，這顯示自監督 ViT 模型中的強誘導偏差需要重新思考可用於無監督部分發現的幾何先驗。", "author": "Ananthu Aniraj et.al.", "authors": "Ananthu Aniraj, Cassio F. Dantas, Dino Ienco, Diego Marcos", "id": "2407.04538v1", "paper_url": "http://arxiv.org/abs/2407.04538v1", "repo": "https://github.com/ananthu-aniraj/pdiscoformer"}}