{"2407.08554": {"publish_time": "2024-07-11", "title": "Establishing Rigorous and Cost-effective Clinical Trials for Artificial Intelligence Models", "paper_summary": "A profound gap persists between artificial intelligence (AI) and clinical\npractice in medicine, primarily due to the lack of rigorous and cost-effective\nevaluation methodologies. State-of-the-art and state-of-the-practice AI model\nevaluations are limited to laboratory studies on medical datasets or direct\nclinical trials with no or solely patient-centered controls. Moreover, the\ncrucial role of clinicians in collaborating with AI, pivotal for determining\nits impact on clinical practice, is often overlooked. For the first time, we\nemphasize the critical necessity for rigorous and cost-effective evaluation\nmethodologies for AI models in clinical practice, featuring\npatient/clinician-centered (dual-centered) AI randomized controlled trials\n(DC-AI RCTs) and virtual clinician-based in-silico trials (VC-MedAI) as an\neffective proxy for DC-AI RCTs. Leveraging 7500 diagnosis records from two-step\ninaugural DC-AI RCTs across 14 medical centers with 125 clinicians, our results\ndemonstrate the necessity of DC-AI RCTs and the effectiveness of VC-MedAI.\nNotably, VC-MedAI performs comparably to human clinicians, replicating insights\nand conclusions from prospective DC-AI RCTs. We envision DC-AI RCTs and\nVC-MedAI as pivotal advancements, presenting innovative and transformative\nevaluation methodologies for AI models in clinical practice, offering a\npreclinical-like setting mirroring conventional medicine, and reshaping\ndevelopment paradigms in a cost-effective and fast-iterative manner. Chinese\nClinical Trial Registration: ChiCTR2400086816.", "paper_summary_zh": "<paragraph>人工智慧（AI）與臨床醫療實務之間存在著巨大的鴻溝，這主要是由於缺乏嚴謹且具成本效益的評估方法。最先進且最實用的 AI 模型評估僅限於醫療資料集的實驗室研究或直接臨床試驗，而沒有或僅有以患者為中心的對照組。此外，臨床醫師在與 AI 合作中所扮演的關鍵角色，對於確定其對臨床實務的影響至關重要，但這點常常被忽略。我們首次強調在臨床實務中對 AI 模型進行嚴謹且具成本效益的評估方法至關重要，其特點是採用以患者／臨床醫師為中心的（雙中心）AI 隨機對照試驗（DC-AI RCT）和虛擬臨床醫師為基礎的電腦模擬試驗（VC-MedAI），作為 DC-AI RCT 的有效替代方案。利用來自 14 個醫療中心、125 位臨床醫師的兩階段首次 DC-AI RCT 中的 7500 筆診斷紀錄，我們的結果證明了 DC-AI RCT 的必要性以及 VC-MedAI 的有效性。值得注意的是，VC-MedAI 的表現與人類臨床醫師相當，複製了前瞻性 DC-AI RCT 的見解和結論。我們將 DC-AI RCT 和 VC-MedAI 視為關鍵進展，它們為臨床實務中的 AI 模型提供了創新且具有變革性的評估方法，提供了一個類似於傳統醫學的臨床前設定，並以具有成本效益且快速迭代的方式重塑開發範例。中國臨床試驗註冊：ChiCTR2400086816。</paragraph>", "author": "Wanling Gao et.al.", "authors": "Wanling Gao, Yunyou Huang, Dandan Cui, Zhuoming Yu, Wenjing Liu, Xiaoshuang Liang, Jiahui Zhao, Jiyue Xie, Hao Li, Li Ma, Ning Ye, Yumiao Kang, Dingfeng Luo, Peng Pan, Wei Huang, Zhongmou Liu, Jizhong Hu, Gangyuan Zhao, Chongrong Jiang, Fan Huang, Tianyi Wei, Suqin Tang, Bingjie Xia, Zhifei Zhang, Jianfeng Zhan", "id": "2407.08554v2", "paper_url": "http://arxiv.org/abs/2407.08554v2", "repo": "https://github.com/benchcouncil/vc-medai"}}