{"2407.00984": {"publish_time": "2024-07-01", "title": "Individual brain parcellation: Review of methods, validations and applications", "paper_summary": "Individual brains vary greatly in morphology, connectivity and organization.\nThe applicability of group-level parcellations is limited by the rapid\ndevelopment of precision medicine today because they do not take into account\nthe variation of parcels at the individual level. Accurate mapping of brain\nfunctional regions at the individual level is pivotal for a comprehensive\nunderstanding of the variations in brain function and behaviors, early and\nprecise identification of brain abnormalities, as well as personalized\ntreatments for neuropsychiatric disorders. With the development of neuroimaging\nand machine learning techniques, studies on individual brain parcellation are\nbooming. In this paper, we offer an overview of recent advances in the\nmethodologies of individual brain parcellation, including optimization- and\nlearning-based methods. Comprehensive evaluation metrics to validate individual\nbrain mapping have been introduced. We also review the studies of how\nindividual brain mapping promotes neuroscience research and clinical medicine.\nFinally, we summarize the major challenges and important future directions of\nindividualized brain parcellation. Collectively, we intend to offer a thorough\noverview of individual brain parcellation methods, validations, and\napplications, along with highlighting the current challenges that call for an\nurgent demand for integrated platforms that integrate datasets, methods, and\nvalidations.", "paper_summary_zh": "各個大腦在形態、連接性和組織上差異極大。\n群體層級的區塊化適用性受到當今精準醫療的快速發展所限制，因為它們沒有考慮到個體層級的區塊變異。在個體層級準確繪製大腦功能區域對於全面了解大腦功能和行為的變異、早期且精確地識別大腦異常，以及神經精神疾病的個人化治療至關重要。隨著神經影像和機器學習技術的發展，關於個別大腦區塊化的研究正在蓬勃發展。在本文中，我們概述了個別大腦區塊化方法學的最新進展，包括基於最佳化和學習的方法。已經引入了全面的評估指標來驗證個別大腦對應。我們還回顧了個別大腦對應如何促進神經科學研究和臨床醫學的研究。最後，我們總結了個別化大腦區塊化的主要挑戰和重要的未來方向。總的來說，我們打算對個別大腦區塊化方法、驗證和應用提供全面的概述，同時強調當前挑戰，這些挑戰迫切需要整合數據集、方法和驗證的整合平台。", "author": "Chengyi Li et.al.", "authors": "Chengyi Li, Shan Yu, Yue Cui", "id": "2407.00984v1", "paper_url": "http://arxiv.org/abs/2407.00984v1", "repo": "null"}}