{"2406.19227": {"publish_time": "2024-06-27", "title": "Aligning Teacher with Student Preferences for Tailored Training Data Generation", "paper_summary": "Large Language Models (LLMs) have shown significant promise as copilots in\nvarious tasks. Local deployment of LLMs on edge devices is necessary when\nhandling privacy-sensitive data or latency-sensitive tasks. The computational\nconstraints of such devices make direct deployment of powerful large-scale LLMs\nimpractical, necessitating the Knowledge Distillation from large-scale models\nto lightweight models. Lots of work has been done to elicit diversity and\nquality training examples from LLMs, but little attention has been paid to\naligning teacher instructional content based on student preferences, akin to\n\"responsive teaching\" in pedagogy. Thus, we propose ARTE, dubbed Aligning\nTeacheR with StudenT PreferencEs, a framework that aligns the teacher model\nwith student preferences to generate tailored training examples for Knowledge\nDistillation. Specifically, we elicit draft questions and rationales from the\nteacher model, then collect student preferences on these questions and\nrationales using students' performance with in-context learning as a proxy, and\nfinally align the teacher model with student preferences. In the end, we repeat\nthe first step with the aligned teacher model to elicit tailored training\nexamples for the student model on the target task. Extensive experiments on\nacademic benchmarks demonstrate the superiority of ARTE over existing\ninstruction-tuning datasets distilled from powerful LLMs. Moreover, we\nthoroughly investigate the generalization of ARTE, including the generalization\nof fine-tuned student models in reasoning ability and the generalization of\naligned teacher models to generate tailored training data across tasks and\nstudents. In summary, our contributions lie in proposing a novel framework for\ntailored training example generation, demonstrating its efficacy in\nexperiments, and investigating the generalization of both student & aligned\nteacher models in ARTE.", "paper_summary_zh": "大型語言模型 (LLM) 已在擔任各種任務的副駕駛方面展現出顯著的潛力。在處理隱私敏感資料或延遲敏感任務時，必須在邊緣設備上部署 LLM。此類設備的運算限制使得直接部署強大的大型 LLM 變得不切實際，因此必須將大規模模型的知識蒸餾到輕量級模型。已經做了大量工作來引發 LLM 的多樣性和高品質訓練範例，但很少有人關注根據學生的偏好來調整老師的教學內容，這類似於教學法中的「反應式教學」。因此，我們提出了 ARTE，稱為 Aligning TeacheR with StudenT PreferencEs，這是一個框架，它將教師模型與學生的偏好相結合，為知識蒸餾產生量身打造的訓練範例。具體來說，我們從教師模型中引發出草稿問題和依據，然後使用學生的表現作為情境學習的代理，收集學生對這些問題和依據的偏好，最後將教師模型與學生的偏好相結合。最後，我們使用結合的教師模型重複第一步，為目標任務上的學生模型引發量身打造的訓練範例。在學術基準上的廣泛實驗證明了 ARTE 優於從強大的 LLM 中提取的現有教學調整資料集。此外，我們徹底研究了 ARTE 的概括化，包括微調學生模型在推理能力中的概括化，以及結合的教師模型在跨任務和學生中產生量身打造的訓練資料的概括化。總之，我們的貢獻在於提出一個用於量身打造訓練範例生成的新穎框架，在實驗中展示其功效，並研究 ARTE 中學生和結合教師模型的概括化。", "author": "Yantao Liu et.al.", "authors": "Yantao Liu, Zhao Zhang, Zijun Yao, Shulin Cao, Lei Hou, Juanzi Li", "id": "2406.19227v1", "paper_url": "http://arxiv.org/abs/2406.19227v1", "repo": "null"}}