{"2410.21868": {"publish_time": "2024-10-29", "title": "Improving In-Context Learning with Small Language Model Ensembles", "paper_summary": "Large language models (LLMs) have shown impressive capabilities across\nvarious tasks, but their performance on domain-specific tasks remains limited.\nWhile methods like retrieval augmented generation and fine-tuning can help to\naddress this, they require significant resources. In-context learning (ICL) is\na cheap and efficient alternative but cannot match the accuracies of advanced\nmethods. We present Ensemble SuperICL, a novel approach that enhances ICL by\nleveraging the expertise of multiple fine-tuned small language models (SLMs).\nEnsemble SuperICL achieves state of the art (SoTA) results on several natural\nlanguage understanding benchmarks. Additionally, we test it on a medical-domain\nlabelling task and showcase its practicality by using off-the-shelf SLMs\nfine-tuned on a general language task, achieving superior accuracy in\nlarge-scale data labelling compared to all baselines. Finally, we conduct an\nablation study and sensitivity analyses to elucidate the underlying mechanism\nof Ensemble SuperICL. Our research contributes to the growing demand for\nefficient domain specialisation methods in LLMs, offering a cheap and effective\nmethod for practitioners.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種任務中展現令人印象深刻的能力，但它們在特定領域任務中的表現仍然有限。雖然像檢索擴充生成和微調等方法可以幫助解決這個問題，但它們需要大量的資源。情境內學習 (ICL) 是一種便宜且有效率的替代方案，但無法匹敵先進方法的準確性。我們提出 Ensemble SuperICL，這是一種創新的方法，它透過利用多個微調小型語言模型 (SLM) 的專業知識來增強 ICL。Ensemble SuperICL 在幾個自然語言理解基準上獲得了最先進 (SoTA) 的結果。此外，我們在醫學領域標籤任務上對它進行了測試，並透過使用在一般語言任務上微調的現成 SLM 來展示它的實用性，在與所有基線相比之下，在大型數據標籤中獲得了更高的準確性。最後，我們進行了消融研究和敏感性分析，以闡明 Ensemble SuperICL 的底層機制。我們的研究有助於滿足對 LLM 中高效領域專業化方法日益增長的需求，為實務工作者提供一種便宜且有效的方法。", "author": "M. Mehdi Mojarradi et.al.", "authors": "M. Mehdi Mojarradi, Lingyi Yang, Robert McCraith, Adam Mahdi", "id": "2410.21868v1", "paper_url": "http://arxiv.org/abs/2410.21868v1", "repo": "https://github.com/mehdimojarradi/Ensemble-SuperICL"}}