{"2411.05361": {"publish_time": "2024-11-08", "title": "Dynamic-SUPERB Phase-2: A Collaboratively Expanding Benchmark for Measuring the Capabilities of Spoken Language Models with 180 Tasks", "paper_summary": "Multimodal foundation models, such as Gemini and ChatGPT, have revolutionized\nhuman-machine interactions by seamlessly integrating various forms of data.\nDeveloping a universal spoken language model that comprehends a wide range of\nnatural language instructions is critical for bridging communication gaps and\nfacilitating more intuitive interactions. However, the absence of a\ncomprehensive evaluation benchmark poses a significant challenge. We present\nDynamic-SUPERB Phase-2, an open and evolving benchmark for the comprehensive\nevaluation of instruction-based universal speech models. Building upon the\nfirst generation, this second version incorporates 125 new tasks contributed\ncollaboratively by the global research community, expanding the benchmark to a\ntotal of 180 tasks, making it the largest benchmark for speech and audio\nevaluation. While the first generation of Dynamic-SUPERB was limited to\nclassification tasks, Dynamic-SUPERB Phase-2 broadens its evaluation\ncapabilities by introducing a wide array of novel and diverse tasks, including\nregression and sequence generation, across speech, music, and environmental\naudio. Evaluation results indicate that none of the models performed well\nuniversally. SALMONN-13B excelled in English ASR, while WavLLM demonstrated\nhigh accuracy in emotion recognition, but current models still require further\ninnovations to handle a broader range of tasks. We will soon open-source all\ntask data and the evaluation pipeline.", "paper_summary_zh": "多模态基础模型，例如 Gemini 和 ChatGPT，通过无缝集成各种形式的数据，彻底改变了人机交互。开发一个理解广泛自然语言指令的通用口语语言模型对于弥合沟通鸿沟和促进更直观的交互至关重要。然而，缺乏综合评估基准构成了重大挑战。我们提出了 Dynamic-SUPERB 2 阶段，这是一个开放且不断发展的基准，用于对基于指令的通用语音模型进行综合评估。在此第一代的基础上，此第二版纳入了由全球研究界协作贡献的 125 项新任务，将基准扩展到总共 180 项任务，使其成为语音和音频评估中最大的基准。虽然第一代 Dynamic-SUPERB 仅限于分类任务，但 Dynamic-SUPERB 2 阶段通过引入广泛的新颖且多样的任务，包括回归和序列生成，跨越语音、音乐和环境音频，扩展了其评估能力。评估结果表明，没有一个模型在所有方面表现良好。SALMONN-13B 在英语 ASR 中表现出色，而 WavLLM 在情绪识别方面表现出很高的准确性，但当前模型仍需要进一步创新才能处理更广泛的任务。我们很快将开源所有任务数据和评估管道。", "author": "Chien-yu Huang et.al.", "authors": "Chien-yu Huang, Wei-Chih Chen, Shu-wen Yang, Andy T. Liu, Chen-An Li, Yu-Xiang Lin, Wei-Cheng Tseng, Anuj Diwan, Yi-Jen Shih, Jiatong Shi, William Chen, Xuanjun Chen, Chi-Yuan Hsiao, Puyuan Peng, Shih-Heng Wang, Chun-Yi Kuan, Ke-Han Lu, Kai-Wei Chang, Chih-Kai Yang, Fabian Ritter-Gutierrez, Ming To Chuang, Kuan-Po Huang, Siddhant Arora, You-Kuan Lin, Eunjung Yeo, Kalvin Chang, Chung-Ming Chien, Kwanghee Choi, Cheng-Hsiu Hsieh, Yi-Cheng Lin, Chee-En Yu, I-Hsiang Chiu, Heitor R. Guimarães, Jionghao Han, Tzu-Quan Lin, Tzu-Yuan Lin, Homu Chang, Ting-Wu Chang, Chun Wei Chen, Shou-Jen Chen, Yu-Hua Chen, Hsi-Chun Cheng, Kunal Dhawan, Jia-Lin Fang, Shi-Xin Fang, Kuan-Yu Fang Chiang, Chi An Fu, Hsien-Fu Hsiao, Ching Yu Hsu, Shao-Syuan Huang, Lee Chen Wei, Hsi-Che Lin, Hsuan-Hao Lin, Hsuan-Ting Lin, Jian-Ren Lin, Ting-Chun Liu, Li-Chun Lu, Tsung-Min Pai, Ankita Pasad, Shih-Yun Shan Kuan, Suwon Shon, Yuxun Tang, Yun-Shao Tsai, Jui-Chiang Wei, Tzu-Chieh Wei, Chengxi Wu, Dien-Ruei Wu, Chao-Han Huck Yang, Chieh-Chi Yang, Jia Qi Yip, Shao-Xiang Yuan, Vahid Noroozi, Zhehuai Chen, Haibin Wu, Karen Livescu, David Harwath, Shinji Watanabe, Hung-yi Lee", "id": "2411.05361v1", "paper_url": "http://arxiv.org/abs/2411.05361v1", "repo": "null"}}