{"2502.14525": {"publish_time": "2025-02-20", "title": "Small Graph Is All You Need: DeepStateGNN for Scalable Traffic Forecasting", "paper_summary": "We propose a novel Graph Neural Network (GNN) model, named DeepStateGNN, for\nanalyzing traffic data, demonstrating its efficacy in two critical tasks:\nforecasting and reconstruction. Unlike typical GNN methods that treat each\ntraffic sensor as an individual graph node, DeepStateGNN clusters sensors into\nhigher-level graph nodes, dubbed Deep State Nodes, based on various similarity\ncriteria, resulting in a fixed number of nodes in a Deep State graph. The term\n\"Deep State\" nodes is a play on words, referencing hidden networks of power\nthat, like these nodes, secretly govern traffic independently of visible\nsensors. These Deep State Nodes are defined by several similarity factors,\nincluding spatial proximity (e.g., sensors located nearby in the road network),\nfunctional similarity (e.g., sensors on similar types of freeways), and\nbehavioral similarity under specific conditions (e.g., traffic behavior during\nrain). This clustering approach allows for dynamic and adaptive node grouping,\nas sensors can belong to multiple clusters and clusters may evolve over time.\nOur experimental results show that DeepStateGNN offers superior scalability and\nfaster training, while also delivering more accurate results than competitors.\nIt effectively handles large-scale sensor networks, outperforming other methods\nin both traffic forecasting and reconstruction accuracy.", "paper_summary_zh": "<paragraph>我們提出一個名為 DeepStateGNN 的新穎圖形神經網路 (GNN) 模型，用於分析交通數據，並展示其在兩個關鍵任務中的效能：預測和重建。與將每個交通感測器視為個別圖形節點的典型 GNN 方法不同，DeepStateGNN 會根據各種相似性準則將感測器群集到較高層級的圖形節點中，稱為 Deep State 節點，這會在 Deep State 圖形中產生固定數量的節點。「Deep State」節點這個術語是文字遊戲，指的是隱藏的權力網路，就像這些節點一樣，秘密地獨立於可見感測器管理交通。這些 Deep State 節點由幾個相似性因素定義，包括空間接近性（例如，位於道路網路中附近的感測器）、功能相似性（例如，位於類似類型高速公路上的感測器）以及特定條件下的行為相似性（例如，雨中的交通行為）。這種群集方法允許動態和自適應節點分組，因為感測器可以屬於多個群集，而且群集可能會隨著時間演變。我們的實驗結果顯示，DeepStateGNN 提供了卓越的可擴充性和更快的訓練速度，同時也比競爭對手提供了更準確的結果。它有效地處理了大規模感測器網路，在交通預測和重建準確度方面都優於其他方法。</paragraph>", "author": "Yannick Wölker et.al.", "authors": "Yannick Wölker, Arash Hajisafi, Cyrus Shahabi, Matthias Renz", "id": "2502.14525v1", "paper_url": "http://arxiv.org/abs/2502.14525v1", "repo": "null"}}