{"2410.13671": {"publish_time": "2024-10-17", "title": "HEALTH-PARIKSHA: Assessing RAG Models for Health Chatbots in Real-World Multilingual Settings", "paper_summary": "Assessing the capabilities and limitations of large language models (LLMs)\nhas garnered significant interest, yet the evaluation of multiple models in\nreal-world scenarios remains rare. Multilingual evaluation often relies on\ntranslated benchmarks, which typically do not capture linguistic and cultural\nnuances present in the source language. This study provides an extensive\nassessment of 24 LLMs on real world data collected from Indian patients\ninteracting with a medical chatbot in Indian English and 4 other Indic\nlanguages. We employ a uniform Retrieval Augmented Generation framework to\ngenerate responses, which are evaluated using both automated techniques and\nhuman evaluators on four specific metrics relevant to our application. We find\nthat models vary significantly in their performance and that instruction tuned\nIndic models do not always perform well on Indic language queries. Further, we\nempirically show that factual correctness is generally lower for responses to\nIndic queries compared to English queries. Finally, our qualitative work shows\nthat code-mixed and culturally relevant queries in our dataset pose challenges\nto evaluated models.", "paper_summary_zh": "評估大型語言模型 (LLM) 的能力和限制已引起極大興趣，但在實際情況中評估多個模型的情況仍然很少見。多語言評估通常依賴於翻譯基準，而翻譯基準通常無法捕捉到原始語言中存在的語言和文化差異。本研究對 24 個 LLM 進行了廣泛評估，這些 LLM 來自與印度病患互動的醫療聊天機器人所收集的真實世界資料，這些病患使用印度英語和其他 4 種印度語言。我們採用統一的檢索擴增生成架構來產生回應，並使用自動化技術和人類評估員對四個與我們的應用程式相關的特定指標進行評估。我們發現，模型的效能差異很大，而且針對指示調整的印度語言模型在印度語言查詢中的表現並不總是很好。此外，我們憑經驗顯示，與英語查詢相比，印度語言查詢的回應事實正確性通常較低。最後，我們的質化研究顯示，資料集中混合程式碼和文化相關的查詢對評估模型構成挑戰。", "author": "Varun Gumma et.al.", "authors": "Varun Gumma, Anandhita Raghunath, Mohit Jain, Sunayana Sitaram", "id": "2410.13671v1", "paper_url": "http://arxiv.org/abs/2410.13671v1", "repo": "null"}}