{"2504.07087": {"publish_time": "2025-04-09", "title": "KG-LLM-Bench: A Scalable Benchmark for Evaluating LLM Reasoning on Textualized Knowledge Graphs", "paper_summary": "Knowledge graphs have emerged as a popular method for injecting up-to-date,\nfactual knowledge into large language models (LLMs). This is typically achieved\nby converting the knowledge graph into text that the LLM can process in\ncontext. While multiple methods of encoding knowledge graphs have been\nproposed, the impact of this textualization process on LLM performance remains\nunder-explored. We introduce KG-LLM-Bench, a comprehensive and extensible\nbenchmark spanning five knowledge graph understanding tasks, and evaluate how\ndifferent encoding strategies affect performance across various base models.\nOur extensive experiments with seven language models and five textualization\nstrategies provide insights for optimizing LLM performance on KG reasoning\ntasks.", "paper_summary_zh": "知識圖譜已成為將最新事實知識注入大型語言模型 (LLM) 的一種流行方法。這通常是通過將知識圖譜轉換為 LLM 可以在上下文中處理的文本來實現的。雖然已經提出了多種編碼知識圖譜的方法，但這種文本化過程對 LLM 效能的影響仍未得到充分探索。我們引入了 KG-LLM-Bench，這是一個涵蓋五個知識圖譜理解任務的全面且可擴展的基準測試，並評估不同的編碼策略如何影響各種基礎模型的效能。我們使用七種語言模型和五種文本化策略進行的廣泛實驗，為優化 LLM 在知識圖譜推理任務上的效能提供了見解。\n", "author": "Elan Markowitz et.al.", "authors": "Elan Markowitz, Krupa Galiya, Greg Ver Steeg, Aram Galstyan", "id": "2504.07087v1", "paper_url": "http://arxiv.org/abs/2504.07087v1", "repo": "null"}}