{"2502.11919": {"publish_time": "2025-02-17", "title": "From Text to Trust: Empowering AI-assisted Decision Making with Adaptive LLM-powered Analysis", "paper_summary": "AI-assisted decision making becomes increasingly prevalent, yet individuals\noften fail to utilize AI-based decision aids appropriately especially when the\nAI explanations are absent, potentially as they do not %understand reflect on\nAI's decision recommendations critically. Large language models (LLMs), with\ntheir exceptional conversational and analytical capabilities, present great\nopportunities to enhance AI-assisted decision making in the absence of AI\nexplanations by providing natural-language-based analysis of AI's decision\nrecommendation, e.g., how each feature of a decision making task might\ncontribute to the AI recommendation. In this paper, via a randomized\nexperiment, we first show that presenting LLM-powered analysis of each task\nfeature, either sequentially or concurrently, does not significantly improve\npeople's AI-assisted decision performance. To enable decision makers to better\nleverage LLM-powered analysis, we then propose an algorithmic framework to\ncharacterize the effects of LLM-powered analysis on human decisions and\ndynamically decide which analysis to present. Our evaluation with human\nsubjects shows that this approach effectively improves decision makers'\nappropriate reliance on AI in AI-assisted decision making.", "paper_summary_zh": "隨著 AI 輔助決策越來越普遍，但個人常常無法適當地利用 AI 決策輔助，特別是在沒有 AI 解釋的情況下，潛在原因是他們無法批判性地理解 AI 的決策建議。大型語言模型 (LLM) 擁有卓越的對話和分析能力，在沒有 AI 解釋的情況下，透過提供基於自然語言的 AI 決策建議分析，例如決策任務的每個特徵如何影響 AI 建議，為增強 AI 輔助決策提供了絕佳的機會。在本文中，我們透過隨機實驗，首先展示了以循序或並行的方式呈現 LLM 分析的每個任務特徵，並未顯著改善人們的 AI 輔助決策表現。為了讓決策者能更好地利用 LLM 分析，我們接著提出了演算法架構，用於描述 LLM 分析對人類決策的影響，並動態決定要呈現哪種分析。我們對人類受試者的評估顯示，這種方法有效地改善了決策者在 AI 輔助決策中對 AI 的適當依賴性。", "author": "Zhuoyan Li et.al.", "authors": "Zhuoyan Li, Hangxiao Zhu, Zhuoran Lu, Ziang Xiao, Ming Yin", "id": "2502.11919v1", "paper_url": "http://arxiv.org/abs/2502.11919v1", "repo": "null"}}