{"2409.10007": {"publish_time": "2024-09-16", "title": "SelECT-SQL: Self-correcting ensemble Chain-of-Thought for Text-to-SQL", "paper_summary": "In recent years,Text-to-SQL, the problem of automatically converting\nquestions posed in natural language to formal SQL queries, has emerged as an\nimportant problem at the intersection of natural language processing and data\nmanagement research. Large language models (LLMs) have delivered impressive\nperformance when used in an off-the-shelf performance, but still fall\nsignificantly short of expected expert-level performance. Errors are especially\nprobable when a nuanced understanding is needed of database schemas, questions,\nand SQL clauses to do proper Text-to-SQL conversion. We introduce SelECT-SQL, a\nnovel in-context learning solution that uses an algorithmic combination of\nchain-of-thought (CoT) prompting, self-correction, and ensemble methods to\nyield a new state-of-the-art result on challenging Text-to-SQL benchmarks.\nSpecifically, when configured using GPT-3.5-Turbo as the base LLM, SelECT-SQL\nachieves 84.2% execution accuracy on the Spider leaderboard's development set,\nexceeding both the best results of other baseline GPT-3.5-Turbo-based solutions\n(81.1%), and the peak performance (83.5%) of the GPT-4 result reported on the\nleaderboard.", "paper_summary_zh": "近年来，文本到 SQL，将自然语言中提出的问题自动转换为正式 SQL 查询的问题，已成为自然语言处理和数据管理研究交叉领域的一个重要问题。大型语言模型 (LLM) 在现成性能中使用时提供了令人印象深刻的性能，但仍远未达到预期的专家级性能。当需要对数据库架构、问题和 SQL 子句有细致的理解以进行适当的文本到 SQL 转换时，尤其容易出错。我们介绍了 SelECT-SQL，这是一种新颖的上下文学习解决方案，它使用思想链 (CoT) 提示、自我纠正和集成方法的算法组合，在具有挑战性的文本到 SQL 基准上产生新的最先进的结果。具体来说，当使用 GPT-3.5-Turbo 作为基础 LLM 进行配置时，SelECT-SQL 在 Spider 排行榜的开发集上实现了 84.2% 的执行准确率，超过了其他基于 GPT-3.5-Turbo 的基线解决方案的最佳结果 (81.1%)，以及排行榜上报告的 GPT-4 结果的峰值性能 (83.5%)。", "author": "Ke Shen et.al.", "authors": "Ke Shen, Mayank Kejriwal", "id": "2409.10007v1", "paper_url": "http://arxiv.org/abs/2409.10007v1", "repo": "https://github.com/neuripspublishingresearchcode/select-sql"}}