{"2406.04216": {"publish_time": "2024-06-06", "title": "What Do Language Models Learn in Context? The Structured Task Hypothesis", "paper_summary": "Large language models (LLMs) exhibit an intriguing ability to learn a novel\ntask from in-context examples presented in a demonstration, termed in-context\nlearning (ICL). Understandably, a swath of research has been dedicated to\nuncovering the theories underpinning ICL. One popular hypothesis explains ICL\nby task selection. LLMs identify the task based on the demonstration and\ngeneralize it to the prompt. Another popular hypothesis is that ICL is a form\nof meta-learning, i.e., the models learn a learning algorithm at pre-training\ntime and apply it to the demonstration. Finally, a third hypothesis argues that\nLLMs use the demonstration to select a composition of tasks learned during\npre-training to perform ICL. In this paper, we empirically explore these three\nhypotheses that explain LLMs' ability to learn in context with a suite of\nexperiments derived from common text classification tasks. We invalidate the\nfirst two hypotheses with counterexamples and provide evidence in support of\nthe last hypothesis. Our results suggest an LLM could learn a novel task in\ncontext via composing tasks learned during pre-training.", "paper_summary_zh": "大型語言模型 (LLM) 展現出從示範中以脈絡中的範例學習新任務的有趣能力，稱為脈絡中學習 (ICL)。可以理解的是，大量的研究致力於揭示支撐 ICL 的理論。一個流行的假設通過任務選擇來解釋 ICL。LLM 根據示範識別任務並將其概括為提示。另一個流行的假設是 ICL 是元學習的一種形式，即模型在預訓練時學習學習演算法並將其應用於示範。最後，第三個假設認為 LLM 使用示範來選擇在預訓練期間學習的任務組合以執行 ICL。在本文中，我們根據常見文字分類任務衍生的一系列實驗，實證探討這三個解釋 LLM 在脈絡中學習能力的假設。我們使用反例推翻前兩個假設，並提供證據支持最後一個假設。我們的結果表明，LLM 可以透過組合預訓練期間學習的任務，在脈絡中學習新的任務。", "author": "Jiaoda Li et.al.", "authors": "Jiaoda Li, Yifan Hou, Mrinmaya Sachan, Ryan Cotterell", "id": "2406.04216v1", "paper_url": "http://arxiv.org/abs/2406.04216v1", "repo": "null"}}