{"2406.04240": {"publish_time": "2024-06-06", "title": "Hypernetworks for Personalizing ASR to Atypical Speech", "paper_summary": "Parameter-efficient fine-tuning (PEFT) for personalizing automatic speech\nrecognition (ASR) has recently shown promise for adapting general population\nmodels to atypical speech. However, these approaches assume a priori knowledge\nof the atypical speech disorder being adapted for -- the diagnosis of which\nrequires expert knowledge that is not always available. Even given this\nknowledge, data scarcity and high inter/intra-speaker variability further limit\nthe effectiveness of traditional fine-tuning. To circumvent these challenges,\nwe first identify the minimal set of model parameters required for ASR\nadaptation. Our analysis of each individual parameter's effect on adaptation\nperformance allows us to reduce Word Error Rate (WER) by half while adapting\n0.03\\% of all weights. Alleviating the need for cohort-specific models, we next\npropose the novel use of a meta-learned hypernetwork to generate highly\nindividualized, utterance-level adaptations on-the-fly for a diverse set of\natypical speech characteristics. Evaluating adaptation at the global, cohort\nand individual-level, we show that hypernetworks generalize better to\nout-of-distribution speakers, while maintaining an overall relative WER\nreduction of 75.2% using 0.1% of the full parameter budget.", "paper_summary_zh": "參數高效微調 (PEFT) 用於個人化自動語音辨識 (ASR)，最近已展現出將一般族群模型調整為非典型語音的潛力。然而，這些方法假設先驗知識，即針對非典型語言障礙進行調整，而診斷需要專家知識，且並非總是可用。即使有此知識，資料稀少和高層級/講者內變異性進一步限制傳統微調的有效性。為了解決這些挑戰，我們首先找出 ASR 調整所需的最小模型參數組。我們分析每個個別參數對調整效能的影響，讓我們得以將字元錯誤率 (WER) 降低一半，同時調整所有權重的 0.03%。減輕對特定族群模型的需求，我們接著提出創新的元學習超網路使用方式，用於即時產生高度個人化、語句等級的調整，以適應各種非典型語音特徵。在全球、族群和個人層級評估調整時，我們發現超網路對分佈外講者有更好的概化能力，同時使用 0.1% 的完整參數預算，維持整體相對 WER 降低 75.2%。", "author": "Max Mueller-Eberstein et.al.", "authors": "Max Mueller-Eberstein, Dianna Yee, Karren Yang, Gautam Varma Mantena, Colin Lea", "id": "2406.04240v1", "paper_url": "http://arxiv.org/abs/2406.04240v1", "repo": "null"}}