{"2404.16346": {"publish_time": "2024-04-25", "title": "Light-weight Retinal Layer Segmentation with Global Reasoning", "paper_summary": "Automatic retinal layer segmentation with medical images, such as optical\ncoherence tomography (OCT) images, serves as an important tool for diagnosing\nophthalmic diseases. However, it is challenging to achieve accurate\nsegmentation due to low contrast and blood flow noises presented in the images.\nIn addition, the algorithm should be light-weight to be deployed for practical\nclinical applications. Therefore, it is desired to design a light-weight\nnetwork with high performance for retinal layer segmentation. In this paper, we\npropose LightReSeg for retinal layer segmentation which can be applied to OCT\nimages. Specifically, our approach follows an encoder-decoder structure, where\nthe encoder part employs multi-scale feature extraction and a Transformer block\nfor fully exploiting the semantic information of feature maps at all scales and\nmaking the features have better global reasoning capabilities, while the\ndecoder part, we design a multi-scale asymmetric attention (MAA) module for\npreserving the semantic information at each encoder scale. The experiments show\nthat our approach achieves a better segmentation performance compared to the\ncurrent state-of-the-art method TransUnet with 105.7M parameters on both our\ncollected dataset and two other public datasets, with only 3.3M parameters.", "paper_summary_zh": "自動視網膜層分割使用醫學影像，例如光學相干斷層掃描 (OCT) 影像，做為診斷眼科疾病的重要工具。然而，由於影像中對比度低和血流雜訊，要達成精確的分割具有挑戰性。此外，演算法應輕量化，才能部署於實際的臨床應用。因此，需要設計一個輕量級且高性能的網路，用於視網膜層分割。在本文中，我們提出 LightReSeg 用於視網膜層分割，可應用於 OCT 影像。具體來說，我們的做法遵循編碼器-解碼器結構，其中編碼器部分採用多尺度特徵萃取和 Transformer 區塊，以充分利用各種尺度特徵圖的語義資訊，並讓特徵具備更好的全局推理能力，而解碼器部分，我們設計了一個多尺度非對稱注意力 (MAA) 模組，用於保留每個編碼器尺度的語義資訊。實驗顯示，與現有最先進方法 TransUnet 相比，我們的做法在我們收集的資料集和兩個其他公開資料集上，以僅 330 萬個參數，達到了更好的分割效能，而 TransUnet 有 10570 萬個參數。", "author": "Xiang He et.al.", "authors": "Xiang He, Weiye Song, Yiming Wang, Fabio Poiesi, Ji Yi, Manishi Desai, Quanqing Xu, Kongzheng Yang, Yi Wan", "id": "2404.16346v1", "paper_url": "http://arxiv.org/abs/2404.16346v1", "repo": "null"}}