{"2408.02555": {"publish_time": "2024-08-05", "title": "MeshAnything V2: Artist-Created Mesh Generation With Adjacent Mesh Tokenization", "paper_summary": "We introduce MeshAnything V2, an autoregressive transformer that generates\nArtist-Created Meshes (AM) aligned to given shapes. It can be integrated with\nvarious 3D asset production pipelines to achieve high-quality, highly\ncontrollable AM generation. MeshAnything V2 surpasses previous methods in both\nefficiency and performance using models of the same size. These improvements\nare due to our newly proposed mesh tokenization method: Adjacent Mesh\nTokenization (AMT). Different from previous methods that represent each face\nwith three vertices, AMT uses a single vertex whenever possible. Compared to\nprevious methods, AMT requires about half the token sequence length to\nrepresent the same mesh in average. Furthermore, the token sequences from AMT\nare more compact and well-structured, fundamentally benefiting AM generation.\nOur extensive experiments show that AMT significantly improves the efficiency\nand performance of AM generation. Project Page:\nhttps://buaacyw.github.io/meshanything-v2/", "paper_summary_zh": "我們介紹了 MeshAnything V2，這是一種自迴歸轉換器，可生成與給定形狀對齊的藝術家創建網格 (AM)。它可以與各種 3D 資產製作管道整合，以實現高品質、高度可控的 AM 生成。MeshAnything V2 在效率和效能方面都超越了之前的模型，使用相同大小的模型。這些改進歸功於我們新提出的網格標記化方法：相鄰網格標記化 (AMT)。與之前用三個頂點表示每個面的方法不同，AMT 盡可能使用單個頂點。與之前的模型相比，AMT 平均需要大約一半的標記序列長度來表示相同的網格。此外，來自 AMT 的標記序列更緊湊且結構良好，從根本上有利於 AM 生成。我們廣泛的實驗表明，AMT 大幅提高了 AM 生成效率和效能。專案頁面：\nhttps://buaacyw.github.io/meshanything-v2/", "author": "Yiwen Chen et.al.", "authors": "Yiwen Chen, Yikai Wang, Yihao Luo, Zhengyi Wang, Zilong Chen, Jun Zhu, Chi Zhang, Guosheng Lin", "id": "2408.02555v1", "paper_url": "http://arxiv.org/abs/2408.02555v1", "repo": "null"}}