{"2411.07070": {"publish_time": "2024-11-11", "title": "On Active Privacy Auditing in Supervised Fine-tuning for White-Box Language Models", "paper_summary": "The pretraining and fine-tuning approach has become the leading technique for\nvarious NLP applications. However, recent studies reveal that fine-tuning data,\ndue to their sensitive nature, domain-specific characteristics, and\nidentifiability, pose significant privacy concerns. To help develop more\nprivacy-resilient fine-tuning models, we introduce a novel active privacy\nauditing framework, dubbed Parsing, designed to identify and quantify privacy\nleakage risks during the supervised fine-tuning (SFT) of language models (LMs).\nThe framework leverages improved white-box membership inference attacks (MIAs)\nas the core technology, utilizing novel learning objectives and a two-stage\npipeline to monitor the privacy of the LMs' fine-tuning process, maximizing the\nexposure of privacy risks. Additionally, we have improved the effectiveness of\nMIAs on large LMs including GPT-2, Llama2, and certain variants of them. Our\nresearch aims to provide the SFT community of LMs with a reliable, ready-to-use\nprivacy auditing tool, and to offer valuable insights into safeguarding privacy\nduring the fine-tuning process. Experimental results confirm the framework's\nefficiency across various models and tasks, emphasizing notable privacy\nconcerns in the fine-tuning process. Project code available for\nhttps://github.com/mapleleavesss/PARSING.", "paper_summary_zh": "預訓練和微調方法已成為各種 NLP 應用程式的主流技術。然而，最近的研究顯示，微調資料由於其敏感的本質、特定領域的特徵和可識別性，會造成重大的隱私問題。為了協助開發更具隱私彈性的微調模型，我們引進一個創新的主動式隱私稽核架構，稱為 Parsing，其設計目的是在語言模型 (LM) 的監督式微調 (SFT) 過程中識別和量化隱私外洩風險。此架構利用改良的白盒成員身分推論攻擊 (MIA) 作為核心技術，採用新穎的學習目標和兩階段管線來監控 LM 微調程序的隱私，最大化隱私風險的暴露。此外，我們已經改善了 MIA 在大型 LM（包括 GPT-2、Llama2 和某些變體）上的效能。我們的研究旨在為 LM 的 SFT 社群提供一個可靠、可立即使用的隱私稽核工具，並提供有價值的見解，以在微調過程中保護隱私。實驗結果證實了此架構在各種模型和任務中的效率，強調了微調過程中顯著的隱私問題。專案程式碼可於 https://github.com/mapleleavesss/PARSING 取得。", "author": "Qian Sun et.al.", "authors": "Qian Sun, Hanpeng Wu, Xi Sheryl Zhang", "id": "2411.07070v1", "paper_url": "http://arxiv.org/abs/2411.07070v1", "repo": "null"}}