{"2407.08495": {"publish_time": "2024-07-11", "title": "Investigating LLMs as Voting Assistants via Contextual Augmentation: A Case Study on the European Parliament Elections 2024", "paper_summary": "Instruction-finetuned Large Language Models exhibit unprecedented Natural\nLanguage Understanding capabilities. Recent work has been exploring political\nbiases and political reasoning capabilities in LLMs, mainly scoped in the US\ncontext. In light of the recent 2024 European Parliament elections, we are\ninvestigating if LLMs can be used as Voting Advice Applications (VAAs). We\naudit MISTRAL and MIXTRAL models and evaluate their accuracy in predicting the\nstance of political parties based on the latest \"EU and I\" voting assistance\nquestionnaire. Furthermore, we explore alternatives to improve models'\nperformance by augmenting the input context via Retrieval-Augmented Generation\n(RAG) relying on web search, and Self-Reflection using staged conversations\nthat aim to re-collect relevant content from the model's internal memory. We\nfind that MIXTRAL is highly accurate with an 82% accuracy on average.\nAugmenting the input context with expert-curated information can lead to a\nsignificant boost of approx. 9%, which remains an open challenge for automated\napproaches.", "paper_summary_zh": "經過指令微調的大型語言模型展現出前所未有的自然語言理解能力。最近的研究探索了大型語言模型的政治偏見和政治推理能力，主要集中在美國的背景下。鑑於最近 2024 年歐洲議會選舉，我們正在調查大型語言模型是否可用作投票建議應用程式 (VAA)。我們審查 MISTRAL 和 MIXTRAL 模型，並根據最新的「歐盟和我」投票協助問卷評估它們在預測政黨立場方面的準確性。此外，我們探索了通過檢索增強生成 (RAG)（依賴網路搜尋）和使用旨在從模型內部記憶體重新收集相關內容的分階段對話的自省來擴充輸入內容以改善模型效能的替代方案。我們發現 MIXTRAL 非常準確，平均準確度為 82%。使用專家策劃的資訊擴充輸入內容可能會導致約 9% 的顯著提升，這對於自動化方法來說仍然是一個公開的挑戰。", "author": "Ilias Chalkidis et.al.", "authors": "Ilias Chalkidis", "id": "2407.08495v1", "paper_url": "http://arxiv.org/abs/2407.08495v1", "repo": "null"}}