{"2406.16842": {"publish_time": "2024-06-24", "title": "Exploring Factual Entailment with NLI: A News Media Study", "paper_summary": "We explore the relationship between factuality and Natural Language Inference\n(NLI) by introducing FactRel -- a novel annotation scheme that models\n\\textit{factual} rather than \\textit{textual} entailment, and use it to\nannotate a dataset of naturally occurring sentences from news articles. Our\nanalysis shows that 84\\% of factually supporting pairs and 63\\% of factually\nundermining pairs do not amount to NLI entailment or contradiction,\nrespectively, suggesting that factual relationships are more apt for analyzing\nmedia discourse. We experiment with models for pairwise classification on the\nnew dataset, and find that in some cases, generating synthetic data with GPT-4\non the basis of the annotated dataset can improve performance. Surprisingly,\nfew-shot learning with GPT-4 yields strong results on par with medium LMs\n(DeBERTa) trained on the labelled dataset. We hypothesize that these results\nindicate the fundamental dependence of this task on both world knowledge and\nadvanced reasoning abilities.", "paper_summary_zh": "我們透過引入 FactRel 探索事實性和自然語言推論 (NLI) 之間的關係，FactRel 是一種新穎的標註方案，其建模的是「事實上」而非「文字上」的蘊涵，並使用它來標註一個由新聞文章中自然發生的句子所組成的資料集。我們的分析顯示，84% 的事實支持對和 63% 的事實破壞對並未分別構成 NLI 蘊涵或矛盾，這表示事實關係更適合用於分析媒體論述。我們對新資料集上的成對分類模型進行實驗，並發現，在某些情況下，根據標註資料集，使用 GPT-4 生成合成資料可以提升效能。令人驚訝的是，使用 GPT-4 進行小樣本學習會產生與在標籤資料集上訓練的中型 LM（DeBERTa）相當的強勁結果。我們假設這些結果表明此任務在根本上依賴於世界知識和進階推理能力。", "author": "Guy Mor-Lan et.al.", "authors": "Guy Mor-Lan, Effi Levi", "id": "2406.16842v1", "paper_url": "http://arxiv.org/abs/2406.16842v1", "repo": "null"}}