{"2404.17926": {"publish_time": "2024-04-27", "title": "Pre-training on High Definition X-ray Images: An Experimental Study", "paper_summary": "Existing X-ray based pre-trained vision models are usually conducted on a\nrelatively small-scale dataset (less than 500k samples) with limited resolution\n(e.g., 224 $\\times$ 224). However, the key to the success of self-supervised\npre-training large models lies in massive training data, and maintaining high\nresolution in the field of X-ray images is the guarantee of effective solutions\nto difficult miscellaneous diseases. In this paper, we address these issues by\nproposing the first high-definition (1280 $\\times$ 1280) X-ray based\npre-trained foundation vision model on our newly collected large-scale dataset\nwhich contains more than 1 million X-ray images. Our model follows the masked\nauto-encoder framework which takes the tokens after mask processing (with a\nhigh rate) is used as input, and the masked image patches are reconstructed by\nthe Transformer encoder-decoder network. More importantly, we introduce a novel\ncontext-aware masking strategy that utilizes the chest contour as a boundary\nfor adaptive masking operations. We validate the effectiveness of our model on\ntwo downstream tasks, including X-ray report generation and disease\nrecognition. Extensive experiments demonstrate that our pre-trained medical\nfoundation vision model achieves comparable or even new state-of-the-art\nperformance on downstream benchmark datasets. The source code and pre-trained\nmodels of this paper will be released on\nhttps://github.com/Event-AHU/Medical_Image_Analysis.", "paper_summary_zh": "現有的基於 X 光的預訓練視覺模型通常在具有有限解析度（例如 224 $\\times$ 224）的相對小規模數據集（少於 500k 個樣本）上進行。然而，自監督預訓練大型模型成功的關鍵在於海量的訓練數據，而在 X 光影像領域中保持高解析度是對困難雜症有效解決方案的保證。在本文中，我們通過提出第一個基於高解析度（1280 $\\times$ 1280）X 光的預訓練基礎視覺模型來解決這些問題，該模型建立在我們新收集的大規模數據集上，其中包含 100 多萬張 X 光影像。我們的模型遵循遮罩自動編碼器框架，其中採用遮罩處理（以高比率）後的 token 作為輸入，並由 Transformer 編碼器-解碼器網路重建遮罩的影像區塊。更重要的是，我們引入了一種新穎的上下文感知遮罩策略，它利用胸部輪廓作為自適應遮罩操作的邊界。我們在兩個下游任務（包括 X 光報告生成和疾病識別）上驗證了我們模型的有效性。大量的實驗表明，我們的預訓練醫學基礎視覺模型在下游基準數據集上達到了可比甚至新的最先進效能。本文的原始程式碼和預訓練模型將在 https://github.com/Event-AHU/Medical_Image_Analysis 上發布。", "author": "Xiao Wang et.al.", "authors": "Xiao Wang, Yuehang Li, Wentao Wu, Jiandong Jin, Yao Rong, Bo Jiang, Chuanfu Li, Jin Tang", "id": "2404.17926v1", "paper_url": "http://arxiv.org/abs/2404.17926v1", "repo": "https://github.com/event-ahu/medical_image_analysis"}}