{"2404.16885": {"publish_time": "2024-04-23", "title": "Adapting an Artificial Intelligence Sexually Transmitted Diseases Symptom Checker Tool for Mpox Detection: The HeHealth Experience", "paper_summary": "Artificial Intelligence applications have shown promise in the management of\npandemics and have been widely used to assist the identification,\nclassification, and diagnosis of medical images. In response to the global\noutbreak of Monkeypox (Mpox), the HeHealth.ai team leveraged an existing tool\nto screen for sexually transmitted diseases to develop a digital screening test\nfor symptomatic Mpox through AI approaches. Prior to the global outbreak of\nMpox, the team developed a smartphone app, where app users can use their own\nsmartphone cameras to take pictures of their own penises to screen for\nsymptomatic STD. The AI model was initially developed using 5000 cases and use\na modified convolutional neural network to output prediction scores across\nvisually diagnosable penis pathologies including Syphilis, Herpes Simplex\nVirus, and Human Papilloma Virus. From June 2022 to October 2022, a total of\nabout 22,000 users downloaded the HeHealth app, and about 21,000 images have\nbeen analyzed using HeHealth AI technology. We then engaged in formative\nresearch, stakeholder engagement, rapid consolidation images, a validation\nstudy, and implementation of the tool from July 2022. From July 2022 to October\n2022, a total of 1000 Mpox related images had been used to train the Mpox\nsymptom checker tool. Our digital symptom checker tool showed accuracy of 87%\nto rule in Mpox and 90% to rule out symptomatic Mpox. Several hurdles\nidentified included issues of data privacy and security for app users, initial\nlack of data to train the AI tool, and the potential generalizability of input\ndata. We offer several suggestions to help others get started on similar\nprojects in emergency situations, including engaging a wide range of\nstakeholders, having a multidisciplinary team, prioritizing pragmatism, as well\nas the concept that big data in fact is made up of small data.", "paper_summary_zh": "人工智慧應用在疫情管理中展現出前景，並廣泛用於協助醫學影像的辨識、分類和診斷。為了應對猴痘 (Mpox) 的全球爆發，HeHealth.ai 團隊利用現有的性病篩檢工具，透過人工智慧方法開發出針對有症狀的 Mpox 進行數位篩檢的測試。在 Mpox 全球爆發之前，該團隊開發了一款智慧型手機應用程式，應用程式使用者可以使用自己的智慧型手機相機拍攝自己陰莖的照片，以篩檢有症狀的性病。人工智慧模型最初是使用 5000 個案例開發，並使用修改過的卷積神經網路，針對包括梅毒、單純疱疹病毒和人類乳突病毒在內的視覺可診斷陰莖病理輸出預測分數。從 2022 年 6 月到 2022 年 10 月，總計約有 22,000 名使用者下載了 HeHealth 應用程式，並使用 HeHealth 人工智慧技術分析了約 21,000 張影像。我們隨後參與了形成性研究、利害關係人參與、快速整合影像、驗證研究，以及從 2022 年 7 月開始實施該工具。從 2022 年 7 月到 2022 年 10 月，總計有 1000 張與 Mpox 相關的影像用於訓練 Mpox 症狀檢查工具。我們的數位症狀檢查工具顯示，在確認 Mpox 的準確度為 87%，排除有症狀的 Mpox 的準確度為 90%。識別出的幾個障礙包括應用程式使用者的資料隱私和安全性問題、訓練人工智慧工具的初始資料不足，以及輸入資料的潛在概括性。我們提出了一些建議，以協助其他人著手進行緊急情況下的類似專案，包括廣泛參與各利益相關者、組成跨領域團隊、優先考量實用性，以及大資料實際上是由小資料組成這一概念。", "author": "Rayner Kay Jin Tan et.al.", "authors": "Rayner Kay Jin Tan, Dilruk Perera, Salomi Arasaratnam, Yudara Kularathne", "id": "2404.16885v1", "paper_url": "http://arxiv.org/abs/2404.16885v1", "repo": "null"}}