{"2410.24190": {"publish_time": "2024-10-31", "title": "Hidden Persuaders: LLMs' Political Leaning and Their Influence on Voters", "paper_summary": "How could LLMs influence our democracy? We investigate LLMs' political\nleanings and the potential influence of LLMs on voters by conducting multiple\nexperiments in a U.S. presidential election context. Through a voting\nsimulation, we first demonstrate 18 open- and closed-weight LLMs' political\npreference for a Democratic nominee over a Republican nominee. We show how this\nleaning towards the Democratic nominee becomes more pronounced in\ninstruction-tuned models compared to their base versions by analyzing their\nresponses to candidate-policy related questions. We further explore the\npotential impact of LLMs on voter choice by conducting an experiment with 935\nU.S. registered voters. During the experiments, participants interacted with\nLLMs (Claude-3, Llama-3, and GPT-4) over five exchanges. The experiment results\nshow a shift in voter choices towards the Democratic nominee following LLM\ninteraction, widening the voting margin from 0.7% to 4.6%, even though LLMs\nwere not asked to persuade users to support the Democratic nominee during the\ndiscourse. This effect is larger than many previous studies on the\npersuasiveness of political campaigns, which have shown minimal effects in\npresidential elections. Many users also expressed a desire for further\npolitical interaction with LLMs. Which aspects of LLM interactions drove these\nshifts in voter choice requires further study. Lastly, we explore how a safety\nmethod can make LLMs more politically neutral, while leaving some open\nquestions.", "paper_summary_zh": "LLM 如何影響我們的民主？我們透過在美國總統選舉背景下進行多項實驗，調查 LLM 的政治傾向和 LLM 對選民的潛在影響。首先，我們透過投票模擬，展示 18 個開放式和封閉式權重的 LLM 對於民主黨候選人相對於共和黨候選人的政治偏好。我們透過分析他們對候選人政策相關問題的回應，展示這個傾向於民主黨候選人的傾向在經過指令調整的模型中，與其基礎版本相比變得更加明顯。我們進一步透過對 935 位美國註冊選民進行實驗，探討 LLM 對選民選擇的潛在影響。在實驗期間，參與者透過五次交流與 LLM（Claude-3、Llama-3 和 GPT-4）互動。實驗結果顯示，在 LLM 互動後，選民選擇轉向民主黨候選人，將投票差距從 0.7% 擴大到 4.6%，即使在討論期間，並未要求 LLM 說服使用者支持民主黨候選人。這個影響大於許多先前關於政治運動說服力的研究，這些研究顯示在總統選舉中影響很小。許多使用者也表達了進一步與 LLM 進行政治互動的願望。哪些方面的 LLM 互動驅動了這些選民選擇的轉變，需要進一步研究。最後，我們探討安全方法如何讓 LLM 在政治上更加中立，同時留下一些開放性的問題。", "author": "Yujin Potter et.al.", "authors": "Yujin Potter, Shiyang Lai, Junsol Kim, James Evans, Dawn Song", "id": "2410.24190v1", "paper_url": "http://arxiv.org/abs/2410.24190v1", "repo": "null"}}