{"2412.04784": {"publish_time": "2024-12-06", "title": "NLP-ADBench: NLP Anomaly Detection Benchmark", "paper_summary": "Anomaly detection (AD) is a critical machine learning task with diverse\napplications in web systems, including fraud detection, content moderation, and\nuser behavior analysis. Despite its significance, AD in natural language\nprocessing (NLP) remains underexplored, limiting advancements in detecting\nanomalies in text data such as harmful content, phishing attempts, or spam\nreviews. In this paper, we introduce NLP-ADBench, the most comprehensive\nbenchmark for NLP anomaly detection (NLP-AD), comprising eight curated datasets\nand evaluations of nineteen state-of-the-art algorithms. These include three\nend-to-end methods and sixteen two-step algorithms that apply traditional\nanomaly detection techniques to language embeddings generated by\nbert-base-uncased and OpenAI's text-embedding-3-large models.\n  Our results reveal critical insights and future directions for NLP-AD.\nNotably, no single model excels across all datasets, highlighting the need for\nautomated model selection. Moreover, two-step methods leveraging\ntransformer-based embeddings consistently outperform specialized end-to-end\napproaches, with OpenAI embeddings demonstrating superior performance over BERT\nembeddings. By releasing NLP-ADBench at\nhttps://github.com/USC-FORTIS/NLP-ADBench, we provide a standardized framework\nfor evaluating NLP-AD methods, fostering the development of innovative\napproaches. This work fills a crucial gap in the field and establishes a\nfoundation for advancing NLP anomaly detection, particularly in the context of\nimproving the safety and reliability of web-based systems.", "paper_summary_zh": "異常偵測 (AD) 是一項重要的機器學習任務，在網路系統中具有多樣化的應用，包括詐欺偵測、內容審核和使用者行為分析。儘管異常偵測具有重要性，但自然語言處理 (NLP) 中的異常偵測仍未被充分探索，這限制了偵測文字資料中異常現象的進展，例如有害內容、網路釣魚嘗試或垃圾評論。在本文中，我們介紹了 NLP-ADBench，這是 NLP 異常偵測 (NLP-AD) 最全面的基準，包含八個策劃好的資料集和十九種最先進演算法的評估。這些包括三種端對端方法和十六種兩步驟演算法，它們將傳統的異常偵測技術應用於由 bert-base-uncased 和 OpenAI 的 text-embedding-3-large 模型產生的語言嵌入。我們的結果揭示了 NLP-AD 的關鍵見解和未來方向。值得注意的是，沒有單一模型在所有資料集上表現優異，這突顯了自動化模型選擇的必要性。此外，利用基於 Transformer 的嵌入的兩步驟方法始終優於專門的端對端方法，而 OpenAI 嵌入表現出優於 BERT 嵌入的效能。透過在 https://github.com/USC-FORTIS/NLP-ADBench 上發布 NLP-ADBench，我們提供了一個標準化的框架來評估 NLP-AD 方法，促進創新方法的發展。這項工作填補了該領域的關鍵空白，並建立了推進 NLP 異常偵測的基礎，特別是在改善基於網路系統的安全性和可靠性的情況下。", "author": "Yuangang Li et.al.", "authors": "Yuangang Li, Jiaqi Li, Zhuo Xiao, Tiankai Yang, Yi Nian, Xiyang Hu, Yue Zhao", "id": "2412.04784v1", "paper_url": "http://arxiv.org/abs/2412.04784v1", "repo": "https://github.com/usc-fortis/nlp-adbench"}}