{"2412.19312": {"publish_time": "2024-12-26", "title": "From Interets to Insights: An LLM Approach to Course Recommendations Using Natural Language Queries", "paper_summary": "Most universities in the United States encourage their students to explore\nacademic areas before declaring a major and to acquire academic breadth by\nsatisfying a variety of requirements. Each term, students must choose among\nmany thousands of offerings, spanning dozens of subject areas, a handful of\ncourses to take. The curricular environment is also dynamic, and poor\ncommunication and search functions on campus can limit a student's ability to\ndiscover new courses of interest. To support both students and their advisers\nin such a setting, we explore a novel Large Language Model (LLM) course\nrecommendation system that applies a Retrieval Augmented Generation (RAG)\nmethod to the corpus of course descriptions. The system first generates an\n'ideal' course description based on the user's query. This description is\nconverted into a search vector using embeddings, which is then used to find\nactual courses with similar content by comparing embedding similarities. We\ndescribe the method and assess the quality and fairness of some example\nprompts. Steps to deploy a pilot system on campus are discussed.", "paper_summary_zh": "美國的大學多鼓勵學生在選定主修前探索學術領域，並透過滿足各種要求來獲得學術廣度。每學期，學生必須在數十個科目領域的數千門課程中選擇幾門課程來修習。課程環境也具有動態性，校園內不良的溝通和搜尋功能可能會限制學生發現新課程的興趣。為了在這種環境中支援學生和他們的顧問，我們探索了一種新的大語言模型 (LLM) 課程推薦系統，該系統將檢索擴充生成 (RAG) 方法應用於課程描述語料庫。該系統會根據使用者的查詢先產生「理想」的課程描述。此描述會使用嵌入轉換成搜尋向量，然後用於透過比較嵌入相似性來尋找具有類似內容的實際課程。我們描述了此方法，並評估了一些範例提示的品質和公平性。文中也討論了在校園中部署試點系統的步驟。", "author": "Hugh Van Deventer et.al.", "authors": "Hugh Van Deventer, Mark Mills, August Evrard", "id": "2412.19312v1", "paper_url": "http://arxiv.org/abs/2412.19312v1", "repo": "null"}}