{"2407.20956": {"publish_time": "2024-07-30", "title": "An Effective Dynamic Gradient Calibration Method for Continual Learning", "paper_summary": "Continual learning (CL) is a fundamental topic in machine learning, where the\ngoal is to train a model with continuously incoming data and tasks. Due to the\nmemory limit, we cannot store all the historical data, and therefore confront\nthe ``catastrophic forgetting'' problem, i.e., the performance on the previous\ntasks can substantially decrease because of the missing information in the\nlatter period. Though a number of elegant methods have been proposed, the\ncatastrophic forgetting phenomenon still cannot be well avoided in practice. In\nthis paper, we study the problem from the gradient perspective, where our aim\nis to develop an effective algorithm to calibrate the gradient in each updating\nstep of the model; namely, our goal is to guide the model to be updated in the\nright direction under the situation that a large amount of historical data are\nunavailable. Our idea is partly inspired by the seminal stochastic variance\nreduction methods (e.g., SVRG and SAGA) for reducing the variance of gradient\nestimation in stochastic gradient descent algorithms. Another benefit is that\nour approach can be used as a general tool, which is able to be incorporated\nwith several existing popular CL methods to achieve better performance. We also\nconduct a set of experiments on several benchmark datasets to evaluate the\nperformance in practice.", "paper_summary_zh": "持續學習 (CL) 是機器學習中的一項基本主題，其目標是使用持續輸入的資料和任務訓練模型。由於記憶體限制，我們無法儲存所有歷史資料，因此面臨「災難性遺忘」問題，亦即在後期的任務中，由於缺少資訊，之前任務的效能可能會大幅下降。儘管已經提出許多優雅的方法，但災難性遺忘現象在實務上仍無法有效避免。在本文中，我們從梯度觀點探討這個問題，我們的目標是開發一種有效的演算法來校正模型在每個更新步驟中的梯度；換句話說，我們的目標是在大量歷史資料不可用的情況下，引導模型朝正確的方向更新。我們的想法部分受到影響，影響來自於用於減少隨機梯度下降演算法中梯度估計變異的開創性隨機變異減少方法 (例如 SVRG 和 SAGA)。另一個好處是，我們的做法可用作一般工具，可以與現有的幾種流行 CL 方法結合使用，以達成更好的效能。我們也對幾個基準資料集進行一組實驗，以評估在實務中的效能。", "author": "Weichen Lin et.al.", "authors": "Weichen Lin, Jiaxiang Chen, Ruomin Huang, Hu Ding", "id": "2407.20956v1", "paper_url": "http://arxiv.org/abs/2407.20956v1", "repo": "null"}}