{"2504.16047": {"publish_time": "2025-04-22", "title": "Evaluating Vision Language Models (VLMs) for Radiology: A Comprehensive Analysis", "paper_summary": "Foundation models, trained on vast amounts of data using self-supervised\ntechniques, have emerged as a promising frontier for advancing artificial\nintelligence (AI) applications in medicine. This study evaluates three\ndifferent vision-language foundation models (RAD-DINO, CheXagent, and\nBiomedCLIP) on their ability to capture fine-grained imaging features for\nradiology tasks. The models were assessed across classification, segmentation,\nand regression tasks for pneumothorax and cardiomegaly on chest radiographs.\nSelf-supervised RAD-DINO consistently excelled in segmentation tasks, while\ntext-supervised CheXagent demonstrated superior classification performance.\nBiomedCLIP showed inconsistent performance across tasks. A custom segmentation\nmodel that integrates global and local features substantially improved\nperformance for all foundation models, particularly for challenging\npneumothorax segmentation. The findings highlight that pre-training methodology\nsignificantly influences model performance on specific downstream tasks. For\nfine-grained segmentation tasks, models trained without text supervision\nperformed better, while text-supervised models offered advantages in\nclassification and interpretability. These insights provide guidance for\nselecting foundation models based on specific clinical applications in\nradiology.", "paper_summary_zh": "<paragraph>基於自監督技術、利用海量數據訓練而成的基礎模型，已成為推進醫學領域人工智慧 (AI) 應用前景的明日之星。這項研究評估了三種不同的視覺語言基礎模型（RAD-DINO、CheXagent 和 BiomedCLIP）在捕捉放射學任務細粒度影像特徵方面的能力。這些模型在針對胸部 X 光片進行氣胸和心臟肥大的分類、分割和回歸任務中接受了評估。自監督的 RAD-DINO 在分割任務中表現始終出色，而文字監督的 CheXagent 則展現出卓越的分類性能。BiomedCLIP 在各項任務中的表現不一致。整合全局和局部特徵的客製化分割模型大幅提升了所有基礎模型的性能，尤其是在挑戰性氣胸分割方面。研究結果表明，預訓練方法顯著影響模型在特定下游任務中的性能。對於細粒度分割任務，未經文字監督訓練的模型表現更佳，而文字監督模型在分類和可解釋性方面則具有優勢。這些見解為根據放射學中的特定臨床應用選擇基礎模型提供了指導。\n</paragraph>\n", "author": "Frank Li et.al.", "authors": "Frank Li, Hari Trivedi, Bardia Khosravi, Theo Dapamede, Mohammadreza Chavoshi, Abdulhameed Dere, Rohan Satya Isaac, Aawez Mansuri, Janice Newsome, Saptarshi Purkayastha, Judy Gichoya", "id": "2504.16047v1", "paper_url": "http://arxiv.org/abs/2504.16047v1", "repo": "null"}}