{"2409.10516": {"publish_time": "2024-09-16", "title": "RetrievalAttention: Accelerating Long-Context LLM Inference via Vector Retrieval", "paper_summary": "Transformer-based large Language Models (LLMs) become increasingly important\nin various domains. However, the quadratic time complexity of attention\noperation poses a significant challenge for scaling to longer contexts due to\nthe extremely high inference latency and GPU memory consumption for caching\nkey-value (KV) vectors. This paper proposes RetrievalAttention, a training-free\napproach to accelerate attention computation. To leverage the dynamic sparse\nproperty of attention, RetrievalAttention builds approximate nearest neighbor\nsearch (ANNS) indexes upon KV vectors in CPU memory and retrieves the most\nrelevant ones via vector search during generation. Due to the\nout-of-distribution (OOD) between query vectors and key vectors, off-the-shelf\nANNS indexes still need to scan O(N) (usually 30% of all keys) data for\naccurate retrieval, which fails to exploit the high sparsity.\nRetrievalAttention first identifies the OOD challenge of ANNS-based attention,\nand addresses it via an attention-aware vector search algorithm that can adapt\nto queries and only access 1--3% of data, thus achieving a sub-linear time\ncomplexity. RetrievalAttention greatly reduces the inference cost of\nlong-context LLM with much lower GPU memory requirements while maintaining the\nmodel accuracy. Especially, RetrievalAttention only needs 16GB GPU memory for\nserving 128K tokens in LLMs with 8B parameters, which is capable of generating\none token in 0.188 seconds on a single NVIDIA RTX4090 (24GB).", "paper_summary_zh": "<paragraph>基於 Transformer 的大型語言模型 (LLM) 在各種領域變得越來越重要。然而，注意力運算的二次時間複雜度對擴展到更長的內容提出了重大挑戰，原因是極高的推論延遲和用於快取鍵值 (KV) 向量的高 GPU 記憶體消耗。本文提出 RetrievalAttention，這是一種免訓練的方法，用於加速注意力運算。為了利用注意力的動態稀疏屬性，RetrievalAttention 在 CPU 記憶體中建立近似最近鄰搜尋 (ANNS) 索引，並在生成期間透過向量搜尋擷取最相關的向量。由於查詢向量和金鑰向量之間的分布外 (OOD)，現成的 ANNS 索引仍需要掃描 O(N)（通常為所有金鑰的 30%）資料以進行準確的擷取，這無法利用高稀疏性。RetrievalAttention 首先找出基於 ANNS 的注意力的 OOD 挑戰，並透過可適應查詢且僅存取 1--3% 資料的注意力感知向量搜尋演算法來解決此問題，從而實現次線性時間複雜度。RetrievalAttention 大幅降低了長內容 LLM 的推論成本，同時 GPU 記憶體需求也低很多，但仍維持模型準確度。特別是，RetrievalAttention 只需要 16GB GPU 記憶體就能在具備 8B 參數的 LLM 中提供 128K 個符號，這可以在單一 NVIDIA RTX4090（24GB）上以 0.188 秒產生一個符號。</paragraph>", "author": "Di Liu et.al.", "authors": "Di Liu, Meng Chen, Baotong Lu, Huiqiang Jiang, Zhenhua Han, Qianxi Zhang, Qi Chen, Chengruidong Zhang, Bailu Ding, Kai Zhang, Chen Chen, Fan Yang, Yuqing Yang, Lili Qiu", "id": "2409.10516v1", "paper_url": "http://arxiv.org/abs/2409.10516v1", "repo": "null"}}