{"2501.02793": {"publish_time": "2025-01-06", "title": "Fairness Through Matching", "paper_summary": "Group fairness requires that different protected groups, characterized by a\ngiven sensitive attribute, receive equal outcomes overall. Typically, the level\nof group fairness is measured by the statistical gap between predictions from\ndifferent protected groups. In this study, we reveal an implicit property of\nexisting group fairness measures, which provides an insight into how the\ngroup-fair models behave. Then, we develop a new group-fair constraint based on\nthis implicit property to learn group-fair models. To do so, we first introduce\na notable theoretical observation: every group-fair model has an implicitly\ncorresponding transport map between the input spaces of each protected group.\nBased on this observation, we introduce a new group fairness measure termed\nMatched Demographic Parity (MDP), which quantifies the averaged gap between\npredictions of two individuals (from different protected groups) matched by a\ngiven transport map. Then, we prove that any transport map can be used in MDP\nto learn group-fair models, and develop a novel algorithm called Fairness\nThrough Matching (FTM), which learns a group-fair model using MDP constraint\nwith an user-specified transport map. We specifically propose two favorable\ntypes of transport maps for MDP, based on the optimal transport theory, and\ndiscuss their advantages. Experiments reveal that FTM successfully trains\ngroup-fair models with certain desirable properties by choosing the transport\nmap accordingly.", "paper_summary_zh": "群體公平性要求由給定的敏感屬性特徵的不同受保護群體整體獲得平等的結果。通常，群體公平性的水準由不同受保護群體的預測之間的統計差距來衡量。在這個研究中，我們揭示了現有群體公平性衡量標準的隱含屬性，這提供了群體公平模型行為方式的見解。然後，我們根據這個隱含屬性開發了一個新的群體公平約束，以學習群體公平模型。為此，我們首先引入了一個顯著的理論觀察：每個群體公平模型在每個受保護群體的輸入空間之間都有隱含對應的傳輸映射。基於這個觀察，我們引入了一個新的群體公平性衡量標準，稱為匹配人口統計學平價 (MDP)，它量化了兩個個體（來自不同的受保護群體）的預測之間的平均差距，這些個體由給定的傳輸映射匹配。然後，我們證明任何傳輸映射都可以用於 MDP 中，以學習群體公平模型，並開發了一個名為 Fairness Through Matching (FTM) 的新演算法，它使用具有使用者指定傳輸映射的 MDP 約束來學習群體公平模型。我們特別根據最優傳輸理論提出了兩種有利於 MDP 的傳輸映射類型，並討論了它們的優點。實驗表明，FTM 通過相應地選擇傳輸映射，成功地訓練了具有某些理想屬性的群體公平模型。", "author": "Kunwoong Kim et.al.", "authors": "Kunwoong Kim, Insung Kong, Jongjin Lee, Minwoo Chae, Sangchul Park, Yongdai Kim", "id": "2501.02793v1", "paper_url": "http://arxiv.org/abs/2501.02793v1", "repo": "https://github.com/kwkimonline/ftm"}}