{"2406.10087": {"publish_time": "2024-06-14", "title": "Biomarker based Cancer Classification using an Ensemble with Pre-trained Models", "paper_summary": "Certain cancer types, namely pancreatic cancer is difficult to detect at an\nearly stage; sparking the importance of discovering the causal relationship\nbetween biomarkers and cancer to identify cancer efficiently. By allowing for\nthe detection and monitoring of specific biomarkers through a non-invasive\nmethod, liquid biopsies enhance the precision and efficacy of medical\ninterventions, advocating the move towards personalized healthcare. Several\nmachine learning algorithms such as Random Forest, SVM are utilized for\nclassification, yet causing inefficiency due to the need for conducting\nhyperparameter tuning. We leverage a meta-trained Hyperfast model for\nclassifying cancer, accomplishing the highest AUC of 0.9929 and simultaneously\nachieving robustness especially on highly imbalanced datasets compared to other\nML algorithms in several binary classification tasks (e.g. breast invasive\ncarcinoma; BRCA vs. non-BRCA). We also propose a novel ensemble model combining\npre-trained Hyperfast model, XGBoost, and LightGBM for multi-class\nclassification tasks, achieving an incremental increase in accuracy (0.9464)\nwhile merely using 500 PCA features; distinguishable from previous studies\nwhere they used more than 2,000 features for similar results.", "paper_summary_zh": "某些类型的癌症，例如胰臟癌，在早期階段難以檢測出來；這點凸顯了找出生物標記與癌症之間的因果關係以有效辨識癌症的重要性。液態切片透過非侵入性方法檢測和監控特定生物標記，進而提升醫療介入的精準度和效能，並倡導朝向個人化醫療保健邁進。隨機森林、SVM 等多種機器學習演算法用於分類，但由於需要進行超參數調整，因此造成效率不彰。我們利用經過元訓練的 Hyperfast 模型來分類癌症，達到了 0.9929 的最高 AUC，同時在多項二元分類任務中（例如乳房浸潤性癌；BRCA 與非 BRCA）實現了穩健性，特別是在高度不平衡的資料集上，優於其他 ML 演算法。我們還提出了一個新穎的整合模型，結合預先訓練的 Hyperfast 模型、XGBoost 和 LightGBM，用於多類別分類任務，僅使用 500 個 PCA 特徵便達到了精準度的增量提升（0.9464）；這點有別於先前的研究，它們使用超過 2,000 個特徵來獲得類似的結果。", "author": "Chongmin Lee et.al.", "authors": "Chongmin Lee, Jihie Kim", "id": "2406.10087v1", "paper_url": "http://arxiv.org/abs/2406.10087v1", "repo": "null"}}