{"2409.09636": {"publish_time": "2024-09-15", "title": "Towards understanding evolution of science through language model series", "paper_summary": "We introduce AnnualBERT, a series of language models designed specifically to\ncapture the temporal evolution of scientific text. Deviating from the\nprevailing paradigms of subword tokenizations and \"one model to rule them all\",\nAnnualBERT adopts whole words as tokens and is composed of a base RoBERTa model\npretrained from scratch on the full-text of 1.7 million arXiv papers published\nuntil 2008 and a collection of progressively trained models on arXiv papers at\nan annual basis. We demonstrate the effectiveness of AnnualBERT models by\nshowing that they not only have comparable performances in standard tasks but\nalso achieve state-of-the-art performances on domain-specific NLP tasks as well\nas link prediction tasks in the arXiv citation network. We then utilize probing\ntasks to quantify the models' behavior in terms of representation learning and\nforgetting as time progresses. Our approach enables the pretrained models to\nnot only improve performances on scientific text processing tasks but also to\nprovide insights into the development of scientific discourse over time. The\nseries of the models is available at https://huggingface.co/jd445/AnnualBERTs.", "paper_summary_zh": "我們介紹 AnnualBERT，這是一系列專門設計用於捕捉科學文本時間演化的語言模型。偏離分詞標記和「一個模型統治所有」的主流模式，AnnualBERT 採用整個單詞作為標記，並由一個基礎 RoBERTa 模型組成，該模型從頭開始預訓練在 2008 年之前發表的 170 萬篇 arXiv 全文上，以及每年在 arXiv 論文上訓練的一系列模型。我們通過展示 AnnualBERT 模型不僅在標準任務中具有可比的性能，而且在特定領域的 NLP 任務以及 arXiv 引文網路中的連結預測任務中也取得了最先進的性能，證明了 AnnualBERT 模型的有效性。然後，我們利用探測任務來量化模型在表示學習和隨著時間推移而遺忘方面的行為。我們的做法使預訓練模型不僅可以改善科學文本處理任務的性能，還可以深入了解科學論述的發展。該系列模型可在 https://huggingface.co/jd445/AnnualBERTs 中獲得。", "author": "Junjie Dong et.al.", "authors": "Junjie Dong, Zhuoqi Lyu, Qing Ke", "id": "2409.09636v1", "paper_url": "http://arxiv.org/abs/2409.09636v1", "repo": "null"}}