{"2406.18002": {"publish_time": "2024-06-26", "title": "Decoding with Limited Teacher Supervision Requires Understanding When to Trust the Teacher", "paper_summary": "How can sLLMs efficiently utilize the supervision of LLMs to improve their\ngenerative quality? This question has been well studied in scenarios where\nthere is no restriction on the number of LLM supervisions one can use, giving\nbirth to many decoding algorithms that utilize supervision without further\ntraining. However, it is still unclear what is an effective strategy under the\nlimited supervision scenario, where we assume that no more than a few tokens\ncan be generated by LLMs. To this end, we develop an algorithm to effectively\naggregate the sLLM and LLM predictions on initial tokens so that the generated\ntokens can more accurately condition the subsequent token generation by sLLM\nonly. Critically, we find that it is essential to adaptively overtrust or\ndisregard the LLM prediction based on the confidence of the sLLM. Through our\nexperiments on a wide range of models and datasets, we demonstrate that our\nmethod provides a consistent improvement over conventional decoding strategies.", "paper_summary_zh": "sLLM 如何有效利用 LLM 的監督，以提升其生成品質？這個問題在沒有 LLM 監督次數限制的情況下已被廣泛探討，並衍生出許多利用監督而無需進一步訓練的解碼演算法。然而，在有限監督的情況下，我們假設 LLM 最多只能產生幾個符號，而有效策略為何仍不清楚。為此，我們開發了一種演算法，可有效彙整 sLLM 和 LLM 對初始符號的預測，以便產生的符號能更準確地調整 sLLM 後續的符號產生。至關重要的是，我們發現基於 sLLM 的信心，適應性地過度信任或忽略 LLM 預測至關重要。透過在各種模型和資料集上進行實驗，我們證明了我們的方法相較於傳統的解碼策略，提供了穩定的改進。", "author": "Hyunjong Ok et.al.", "authors": "Hyunjong Ok, Jegwang Ryu, Jaeho Lee", "id": "2406.18002v1", "paper_url": "http://arxiv.org/abs/2406.18002v1", "repo": "null"}}