{"2405.09086": {"publish_time": "2024-05-15", "title": "Chaos-based reinforcement learning with TD3", "paper_summary": "Chaos-based reinforcement learning (CBRL) is a method in which the agent's\ninternal chaotic dynamics drives exploration. This approach offers a model for\nconsidering how the biological brain can create variability in its behavior and\nlearn in an exploratory manner. At the same time, it is a learning model that\nhas the ability to automatically switch between exploration and exploitation\nmodes and the potential to realize higher explorations that reflect what it has\nlearned so far. However, the learning algorithms in CBRL have not been\nwell-established in previous studies and have yet to incorporate recent\nadvances in reinforcement learning. This study introduced Twin Delayed Deep\nDeterministic Policy Gradients (TD3), which is one of the state-of-the-art deep\nreinforcement learning algorithms that can treat deterministic and continuous\naction spaces, to CBRL. The validation results provide several insights. First,\nTD3 works as a learning algorithm for CBRL in a simple goal-reaching task.\nSecond, CBRL agents with TD3 can autonomously suppress their exploratory\nbehavior as learning progresses and resume exploration when the environment\nchanges. Finally, examining the effect of the agent's chaoticity on learning\nshows that extremely strong chaos negatively impacts the flexible switching\nbetween exploration and exploitation.", "paper_summary_zh": "<paragraph>基於混沌的強化學習 (CBRL) 是一種方法，其中代理的內部混沌動力驅動探索。此方法提供了一個模型，用於考量生物大腦如何在其行為中創造變異性，並以探索方式學習。同時，它是一個學習模型，具有在探索和利用模式之間自動切換的能力，以及實現反映到目前為止所學內容的更高探索的潛力。然而，CBRL 中的學習演算法在先前的研究中尚未建立完善，並且尚未納入強化學習的最新進展。本研究引入了雙重延遲深度確定性策略梯度 (TD3)，這是最先進的深度強化學習演算法之一，可以處理確定性和連續動作空間，到 CBRL。驗證結果提供了多項見解。首先，TD3 可作為 CBRL 的學習演算法，用於簡單的目標達成任務。其次，具有 TD3 的 CBRL 代理可以在學習進展時自主抑制其探索行為，並在環境發生變化時恢復探索。最後，檢視代理的混沌性對學習的影響顯示，極強的混沌會對探索和利用之間的靈活切換產生負面影響。</paragraph>", "author": "Toshitaka Matsuki et.al.", "authors": "Toshitaka Matsuki, Yusuke Sakemi, Kazuyuki Aihara", "id": "2405.09086v1", "paper_url": "http://arxiv.org/abs/2405.09086v1", "repo": "null"}}