{"2408.06042": {"publish_time": "2024-08-12", "title": "Understanding Byzantine Robustness in Federated Learning with A Black-box Server", "paper_summary": "Federated learning (FL) becomes vulnerable to Byzantine attacks where some of\nparticipators tend to damage the utility or discourage the convergence of the\nlearned model via sending their malicious model updates. Previous works propose\nto apply robust rules to aggregate updates from participators against different\ntypes of Byzantine attacks, while at the same time, attackers can further\ndesign advanced Byzantine attack algorithms targeting specific aggregation rule\nwhen it is known. In practice, FL systems can involve a black-box server that\nmakes the adopted aggregation rule inaccessible to participants, which can\nnaturally defend or weaken some Byzantine attacks. In this paper, we provide an\nin-depth understanding on the Byzantine robustness of the FL system with a\nblack-box server. Our investigation demonstrates the improved Byzantine\nrobustness of a black-box server employing a dynamic defense strategy. We\nprovide both empirical evidence and theoretical analysis to reveal that the\nblack-box server can mitigate the worst-case attack impact from a maximum level\nto an expectation level, which is attributed to the inherent inaccessibility\nand randomness offered by a black-box server.The source code is available at\nhttps://github.com/alibaba/FederatedScope/tree/Byzantine_attack_defense to\npromote further research in the community.", "paper_summary_zh": "联邦学习 (FL) 容易遭受拜占庭攻击，在拜占庭攻击中，一些参与者倾向于通过发送其恶意模型更新来破坏效用或阻止学习模型的收敛。以前的工作提出应用稳健规则来聚合参与者针对不同类型的拜占庭攻击的更新，同时，攻击者可以进一步设计高级拜占庭攻击算法，在已知的情况下针对特定的聚合规则。在实践中，FL 系统可以涉及一个黑盒服务器，该服务器使参与者无法访问所采用的聚合规则，这可以自然地防御或削弱一些拜占庭攻击。在本文中，我们对具有黑盒服务器的 FL 系统的拜占庭鲁棒性提供了深入的理解。我们的调查证明了采用动态防御策略的黑盒服务器的拜占庭鲁棒性得到了提高。我们提供了经验证据和理论分析来揭示黑盒服务器可以将最坏情况下的攻击影响从最大级别降低到期望级别，这归因于黑盒服务器固有的不可访问性和随机性。源代码可在 https://github.com/alibaba/FederatedScope/tree/Byzantine_attack_defense 获得，以促进社区的进一步研究。", "author": "Fangyuan Zhao et.al.", "authors": "Fangyuan Zhao, Yuexiang Xie, Xuebin Ren, Bolin Ding, Shusen Yang, Yaliang Li", "id": "2408.06042v1", "paper_url": "http://arxiv.org/abs/2408.06042v1", "repo": "https://github.com/alibaba/federatedscope"}}