{"2501.12375": {"publish_time": "2025-01-21", "title": "Video Depth Anything: Consistent Depth Estimation for Super-Long Videos", "paper_summary": "Depth Anything has achieved remarkable success in monocular depth estimation\nwith strong generalization ability. However, it suffers from temporal\ninconsistency in videos, hindering its practical applications. Various methods\nhave been proposed to alleviate this issue by leveraging video generation\nmodels or introducing priors from optical flow and camera poses. Nonetheless,\nthese methods are only applicable to short videos (< 10 seconds) and require a\ntrade-off between quality and computational efficiency. We propose Video Depth\nAnything for high-quality, consistent depth estimation in super-long videos\n(over several minutes) without sacrificing efficiency. We base our model on\nDepth Anything V2 and replace its head with an efficient spatial-temporal head.\nWe design a straightforward yet effective temporal consistency loss by\nconstraining the temporal depth gradient, eliminating the need for additional\ngeometric priors. The model is trained on a joint dataset of video depth and\nunlabeled images, similar to Depth Anything V2. Moreover, a novel\nkey-frame-based strategy is developed for long video inference. Experiments\nshow that our model can be applied to arbitrarily long videos without\ncompromising quality, consistency, or generalization ability. Comprehensive\nevaluations on multiple video benchmarks demonstrate that our approach sets a\nnew state-of-the-art in zero-shot video depth estimation. We offer models of\ndifferent scales to support a range of scenarios, with our smallest model\ncapable of real-time performance at 30 FPS.", "paper_summary_zh": "Depth Anything 在单目深度估计中取得了显著的成功，具有很强的泛化能力。然而，它在视频中存在时间不一致的问题，阻碍了其实际应用。已经提出了各种方法来通过利用视频生成模型或引入光流和相机位姿先验来缓解这个问题。尽管如此，这些方法仅适用于短视频（< 10 秒），并且需要在质量和计算效率之间进行权衡。我们提出了视频深度 Anything，用于在超长视频（几分钟以上）中进行高质量、一致的深度估计，而不会牺牲效率。我们基于 Depth Anything V2 构建我们的模型，并用一个高效的时空头部替换它的头部。我们通过约束时间深度梯度设计了一个简单但有效的时序一致性损失，消除了对附加几何先验的需求。该模型在与 Depth Anything V2 类似的视频深度和未标记图像的联合数据集上进行训练。此外，还开发了一种新颖的关键帧策略用于长视频推理。实验表明，我们的模型可以应用于任意长的视频，而不会损害质量、一致性或泛化能力。对多个视频基准的综合评估表明，我们的方法在零镜头视频深度估计中树立了新的最先进水平。我们提供不同规模的模型来支持各种场景，我们最小的模型能够以 30 FPS 的速度实时执行。", "author": "Sili Chen et.al.", "authors": "Sili Chen, Hengkai Guo, Shengnan Zhu, Feihu Zhang, Zilong Huang, Jiashi Feng, Bingyi Kang", "id": "2501.12375v2", "paper_url": "http://arxiv.org/abs/2501.12375v2", "repo": "null"}}