{"2410.08044": {"publish_time": "2024-10-10", "title": "The Rise of AI-Generated Content in Wikipedia", "paper_summary": "The rise of AI-generated content in popular information sources raises\nsignificant concerns about accountability, accuracy, and bias amplification.\nBeyond directly impacting consumers, the widespread presence of this content\nposes questions for the long-term viability of training language models on vast\ninternet sweeps. We use GPTZero, a proprietary AI detector, and Binoculars, an\nopen-source alternative, to establish lower bounds on the presence of\nAI-generated content in recently created Wikipedia pages. Both detectors reveal\na marked increase in AI-generated content in recent pages compared to those\nfrom before the release of GPT-3.5. With thresholds calibrated to achieve a 1%\nfalse positive rate on pre-GPT-3.5 articles, detectors flag over 5% of newly\ncreated English Wikipedia articles as AI-generated, with lower percentages for\nGerman, French, and Italian articles. Flagged Wikipedia articles are typically\nof lower quality and are often self-promotional or partial towards a specific\nviewpoint on controversial topics.", "paper_summary_zh": "人工智能生成內容在熱門資訊來源中興起，引發了對於問責制、準確性和偏見擴散的重大疑慮。\n除了直接影響消費者之外，此類內容的廣泛存在也對在廣泛網際網路掃描中訓練語言模型的長期可行性提出了質疑。我們使用專有的 AI 偵測器 GPTZero 和開放原始碼替代方案 Binoculars，來建立最近建立的維基百科頁面中 AI 生成的內容存在的下限。與 GPT-3.5 發布之前的頁面相比，兩個偵測器都顯示最近的頁面中 AI 生成的內容顯著增加。設定閾值以在 GPT-3.5 之前的文章中達到 1% 的誤判率，偵測器將超過 5% 的新建立的英文維基百科文章標記為 AI 生成的，德文、法文和義大利文文章的百分比較低。標記的維基百科文章通常品質較低，而且經常自我宣傳或偏向於有爭議性主題的特定觀點。", "author": "Creston Brooks et.al.", "authors": "Creston Brooks, Samuel Eggert, Denis Peskoff", "id": "2410.08044v1", "paper_url": "http://arxiv.org/abs/2410.08044v1", "repo": "null"}}