{"2411.08147": {"publish_time": "2024-11-12", "title": "Large Language Models Can Self-Improve in Long-context Reasoning", "paper_summary": "Large language models (LLMs) have achieved substantial progress in processing\nlong contexts but still struggle with long-context reasoning. Existing\napproaches typically involve fine-tuning LLMs with synthetic data, which\ndepends on annotations from human experts or advanced models like GPT-4, thus\nrestricting further advancements. To address this issue, we investigate the\npotential for LLMs to self-improve in long-context reasoning and propose \\ours,\nan approach specifically designed for this purpose. This approach is\nstraightforward: we sample multiple outputs for each question, score them with\nMinimum Bayes Risk, and then apply supervised fine-tuning or preference\noptimization based on these outputs. Extensive experiments on several leading\nLLMs demonstrate the effectiveness of \\ours, with an absolute improvement of\n$4.2$ points for Llama-3.1-8B-Instruct. Furthermore, \\ours achieves superior\nperformance compared to prior approaches that depend on data produced by human\nexperts or advanced models. We anticipate that this work will open new avenues\nfor self-improvement techniques in long-context scenarios, which are essential\nfor the continual advancement of LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 在處理長語境方面取得了顯著進展，但仍難以應對長語境推理。現有方法通常涉及使用合成資料微調 LLM，這依賴於人類專家的註解或 GPT-4 等進階模型，因此限制了進一步的進展。為了解決這個問題，我們探討了 LLM 在長語境推理中自我提升的潛力，並提出 \\ours，一種專門為此目的設計的方法。這種方法很簡單：我們為每個問題抽取多個輸出，使用最小貝葉斯風險對它們進行評分，然後根據這些輸出應用監督微調或偏好最佳化。對幾個領先的 LLM 進行的廣泛實驗證明了 \\ours 的有效性，Llama-3.1-8B-Instruct 的絕對改進為 4.2 分。此外，\\ours 與依賴人類專家或進階模型產生的資料的先前方法相比，取得了更好的效能。我們預期這項工作將為長語境場景中的自我提升技術開啟新途徑，這對於 LLM 的持續進步至關重要。", "author": "Siheng Li et.al.", "authors": "Siheng Li, Cheng Yang, Zesen Cheng, Lemao Liu, Mo Yu, Yujiu Yang, Wai Lam", "id": "2411.08147v1", "paper_url": "http://arxiv.org/abs/2411.08147v1", "repo": "https://github.com/sihengli99/sealong"}}