{"2410.21943": {"publish_time": "2024-10-29", "title": "Beyond Text: Optimizing RAG with Multimodal Inputs for Industrial Applications", "paper_summary": "Large Language Models (LLMs) have demonstrated impressive capabilities in\nanswering questions, but they lack domain-specific knowledge and are prone to\nhallucinations. Retrieval Augmented Generation (RAG) is one approach to address\nthese challenges, while multimodal models are emerging as promising AI\nassistants for processing both text and images. In this paper we describe a\nseries of experiments aimed at determining how to best integrate multimodal\nmodels into RAG systems for the industrial domain. The purpose of the\nexperiments is to determine whether including images alongside text from\ndocuments within the industrial domain increases RAG performance and to find\nthe optimal configuration for such a multimodal RAG system. Our experiments\ninclude two approaches for image processing and retrieval, as well as two LLMs\n(GPT4-Vision and LLaVA) for answer synthesis. These image processing strategies\ninvolve the use of multimodal embeddings and the generation of textual\nsummaries from images. We evaluate our experiments with an LLM-as-a-Judge\napproach. Our results reveal that multimodal RAG can outperform single-modality\nRAG settings, although image retrieval poses a greater challenge than text\nretrieval. Additionally, leveraging textual summaries from images presents a\nmore promising approach compared to the use of multimodal embeddings, providing\nmore opportunities for future advancements.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出令人印象深刻的問答能力，但它們缺乏特定領域的知識，而且容易出現幻覺。檢索擴增生成 (RAG) 是一種解決這些挑戰的方法，而多模態模型正成為處理文字和影像的 AI 助理。在本文中，我們描述了一系列實驗，旨在確定如何最佳整合多模態模型到工業領域的 RAG 系統中。實驗的目的是確定在工業領域的文件中包含影像和文字是否能提升 RAG 的效能，並找出此類多模態 RAG 系統的最佳組態。我們的實驗包含兩種影像處理和檢索方法，以及兩種 LLM（GPT4-Vision 和 LLaVA）用於答案合成。這些影像處理策略涉及使用多模態嵌入和從影像產生文字摘要。我們使用 LLM-as-a-Judge 方法評估我們的實驗。我們的結果顯示，多模態 RAG 能優於單模態 RAG 設定，儘管影像檢索比文字檢索更具挑戰性。此外，與使用多模態嵌入相比，利用影像的文字摘要呈現出更有前景的方法，為未來的進展提供了更多機會。", "author": "Monica Riedler et.al.", "authors": "Monica Riedler, Stefan Langer", "id": "2410.21943v1", "paper_url": "http://arxiv.org/abs/2410.21943v1", "repo": "https://github.com/riedlerm/multimodal_rag_for_industry"}}