{"2412.06095": {"publish_time": "2024-12-08", "title": "Measuring Grammatical Diversity from Small Corpora: Derivational Entropy Rates, Mean Length of Utterances, and Annotation Invariance", "paper_summary": "In many fields, such as language acquisition, neuropsychology of language,\nthe study of aging, and historical linguistics, corpora are used for estimating\nthe diversity of grammatical structures that are produced during a period by an\nindividual, community, or type of speakers. In these cases, treebanks are taken\nas representative samples of the syntactic structures that might be\nencountered. Generalizing the potential syntactic diversity from the structures\ndocumented in a small corpus requires careful extrapolation whose accuracy is\nconstrained by the limited size of representative sub-corpora. In this article,\nI demonstrate -- theoretically, and empirically -- that a grammar's\nderivational entropy and the mean length of the utterances (MLU) it generates\nare fundamentally linked, giving rise to a new measure, the derivational\nentropy rate. The mean length of utterances becomes the most practical index of\nsyntactic complexity; I demonstrate that MLU is not a mere proxy, but a\nfundamental measure of syntactic diversity. In combination with the new\nderivational entropy rate measure, it provides a theory-free assessment of\ngrammatical complexity. The derivational entropy rate indexes the rate at which\ndifferent grammatical annotation frameworks determine the grammatical\ncomplexity of treebanks. I introduce the Smoothed Induced Treebank Entropy\n(SITE) as a tool for estimating these measures accurately, even from very small\ntreebanks. I conclude by discussing important implications of these results for\nboth NLP and human language processing.", "paper_summary_zh": "在許多領域中，例如語言習得、語言神經心理學、老化研究和歷史語言學，語料庫用於估計個人、社群或說話者類型在某個時段內產生的語法結構的多樣性。在這些案例中，樹庫被視為可能遭遇的句法結構的代表性樣本。從小型語料庫中記錄的結構概化潛在的句法多樣性需要仔細推論，其準確性受到代表性子語料庫的有限大小所限制。在本文中，我證明——在理論上和經驗上——語法的派生熵和它產生的發話平均長度 (MLU) 在根本上是相關聯的，產生了一個新的測量值，即派生熵率。發話的平均長度成為句法複雜性的最實用指標；我證明 MLU 不僅僅是一個代理，而且是句法多樣性的基本測量值。結合新的派生熵率測量值，它提供了一個無理論的語法複雜性評估。派生熵率對應於不同語法註解框架確定樹庫的語法複雜性的速率。我介紹了平滑誘導樹庫熵 (SITE) 作為準確估計這些測量值的工具，即使是來自非常小的樹庫。我最後討論了這些結果對自然語言處理和人類語言處理的重要影響。", "author": "Fermin Moscoso del Prado Martin et.al.", "authors": "Fermin Moscoso del Prado Martin", "id": "2412.06095v1", "paper_url": "http://arxiv.org/abs/2412.06095v1", "repo": "null"}}