{"2409.10775": {"publish_time": "2024-09-16", "title": "Are Deep Learning Models Robust to Partial Object Occlusion in Visual Recognition Tasks?", "paper_summary": "Image classification models, including convolutional neural networks (CNNs),\nperform well on a variety of classification tasks but struggle under conditions\nof partial occlusion, i.e., conditions in which objects are partially covered\nfrom the view of a camera. Methods to improve performance under occlusion,\nincluding data augmentation, part-based clustering, and more inherently robust\narchitectures, including Vision Transformer (ViT) models, have, to some extent,\nbeen evaluated on their ability to classify objects under partial occlusion.\nHowever, evaluations of these methods have largely relied on images containing\nartificial occlusion, which are typically computer-generated and therefore\ninexpensive to label. Additionally, methods are rarely compared against each\nother, and many methods are compared against early, now outdated, deep learning\nmodels. We contribute the Image Recognition Under Occlusion (IRUO) dataset,\nbased on the recently developed Occluded Video Instance Segmentation (OVIS)\ndataset (arXiv:2102.01558). IRUO utilizes real-world and artificially occluded\nimages to test and benchmark leading methods' robustness to partial occlusion\nin visual recognition tasks. In addition, we contribute the design and results\nof a human study using images from IRUO that evaluates human classification\nperformance at multiple levels and types of occlusion. We find that modern\nCNN-based models show improved recognition accuracy on occluded images compared\nto earlier CNN-based models, and ViT-based models are more accurate than\nCNN-based models on occluded images, performing only modestly worse than human\naccuracy. We also find that certain types of occlusion, including diffuse\nocclusion, where relevant objects are seen through \"holes\" in occluders such as\nfences and leaves, can greatly reduce the accuracy of deep recognition models\nas compared to humans, especially those with CNN backbones.", "paper_summary_zh": "影像分類模型，包括卷積神經網路 (CNN)，在各種分類任務中表現良好，但在部分遮擋的情況下表現不佳，也就是物件在相機視角中被部分遮住的情況。改善遮擋下的表現的方法，包括資料擴充、基於部分的群集，以及本質上更穩健的架構，包括視覺Transformer (ViT) 模型，在某種程度上已根據其在部分遮擋下分類物件的能力進行評估。然而，對這些方法的評估主要依賴包含人工遮擋的影像，這些影像通常是電腦產生的，因此標記成本低廉。此外，很少將方法相互比較，而且許多方法都是與現在已過時的早期深度學習模型進行比較。我們貢獻了遮擋下的影像辨識 (IRUO) 資料集，它是基於最近開發的遮擋視訊實例分割 (OVIS) 資料集 (arXiv:2102.01558)。IRUO 利用真實世界和人工遮擋的影像來測試和評量領先方法在視覺辨識任務中對部分遮擋的穩健性。此外，我們貢獻了使用來自 IRUO 的影像的人類研究的設計和結果，該研究評估了人類在多個層級和遮擋類型下的分類表現。我們發現，與早期的基於 CNN 的模型相比，現代的基於 CNN 的模型在遮擋影像上展現出更高的辨識準確率，而基於 ViT 的模型在遮擋影像上的準確率高於基於 CNN 的模型，僅比人類準確率低一點。我們還發現，某些類型的遮擋，包括漫射遮擋，其中相關物件透過遮擋物（例如圍欄和樹葉）的「孔洞」可見，與人類相比，會大幅降低深度辨識模型的準確率，特別是那些具有 CNN 主幹的模型。", "author": "Kaleb Kassaw et.al.", "authors": "Kaleb Kassaw, Francesco Luzi, Leslie M. Collins, Jordan M. Malof", "id": "2409.10775v1", "paper_url": "http://arxiv.org/abs/2409.10775v1", "repo": "null"}}