{"2502.08987": {"publish_time": "2025-02-13", "title": "Neural Force Field: Learning Generalized Physical Representation from a Few Examples", "paper_summary": "Physical reasoning is a remarkable human ability that enables rapid learning\nand generalization from limited experience. Current AI models, despite\nextensive training, still struggle to achieve similar generalization,\nespecially in Out-of-distribution (OOD) settings. This limitation stems from\ntheir inability to abstract core physical principles from observations. A key\nchallenge is developing representations that can efficiently learn and\ngeneralize physical dynamics from minimal data. Here we present Neural Force\nField (NFF) a modeling framework built on Neural Ordinary Differential Equation\n(NODE) that learns interpretable force field representations which can be\nefficiently integrated through an Ordinary Differential Equation ( ODE) solver\nto predict object trajectories. Unlike existing approaches that rely on\nhigh-dimensional latent spaces, NFF captures fundamental physical concepts such\nas gravity, support, and collision in an interpretable manner. Experiments on\ntwo challenging physical reasoning tasks demonstrate that NFF, trained with\nonly a few examples, achieves strong generalization to unseen scenarios. This\nphysics-grounded representation enables efficient forward-backward planning and\nrapid adaptation through interactive refinement. Our work suggests that\nincorporating physics-inspired representations into learning systems can help\nbridge the gap between artificial and human physical reasoning capabilities.", "paper_summary_zh": "物理推理是人类非凡的能力，它能从有限的经验中快速学习和概括。尽管经过广泛的训练，但当前的人工智能模型在实现类似的概括方面仍然存在困难，尤其是在分布外 (OOD) 设置中。这种限制源于它们无法从观察中抽象出核心物理原理。一个关键挑战是开发能够从最少数据中有效学习和概括物理动力学的表示。在这里，我们介绍了神经力场 (NFF)，这是一种建立在神经常微分方程 (NODE) 上的建模框架，它学习可解释的力场表示，这些表示可以通过常微分方程 (ODE) 求解器有效地进行积分，以预测物体轨迹。与依赖于高维潜在空间的现有方法不同，NFF 以可解释的方式捕获了诸如重力、支撑和碰撞等基本物理概念。在两个具有挑战性的物理推理任务上的实验表明，仅通过几个示例训练的 NFF 实现了对看不见场景的强大概括。这种基于物理的表示能够进行高效的前向后向规划，并通过交互式细化实现快速适应。我们的工作表明，将受物理启发的表示纳入学习系统可以帮助弥合人工智能和人类物理推理能力之间的差距。", "author": "Shiqian Li et.al.", "authors": "Shiqian Li, Ruihong Shen, Chi Zhang, Yixin Zhu", "id": "2502.08987v1", "paper_url": "http://arxiv.org/abs/2502.08987v1", "repo": "null"}}