{"2407.10341": {"publish_time": "2024-07-14", "title": "Affordance-Guided Reinforcement Learning via Visual Prompting", "paper_summary": "Robots equipped with reinforcement learning (RL) have the potential to learn\na wide range of skills solely from a reward signal. However, obtaining a robust\nand dense reward signal for general manipulation tasks remains a challenge.\nExisting learning-based approaches require significant data, such as\ndemonstrations or examples of success and failure, to learn task-specific\nreward functions. Recently, there is also a growing adoption of large\nmulti-modal foundation models for robotics. These models can perform visual\nreasoning in physical contexts and generate coarse robot motions for various\nmanipulation tasks. Motivated by this range of capability, in this work, we\npropose and study rewards shaped by vision-language models (VLMs).\nState-of-the-art VLMs have demonstrated an impressive ability to reason about\naffordances through keypoints in zero-shot, and we leverage this to define\ndense rewards for robotic learning. On a real-world manipulation task specified\nby natural language description, we find that these rewards improve the sample\nefficiency of autonomous RL and enable successful completion of the task in 20K\nonline finetuning steps. Additionally, we demonstrate the robustness of the\napproach to reductions in the number of in-domain demonstrations used for\npretraining, reaching comparable performance in 35K online finetuning steps.", "paper_summary_zh": "配備強化學習 (RL) 的機器人有潛力僅從回饋訊號中學習廣泛的技能。然而，為一般操作任務取得穩健且密集的回饋訊號仍然是一項挑戰。現有的基於學習的方法需要大量的資料，例如展示或成功與失敗的範例，才能學習特定於任務的回饋函數。最近，大型多模態基礎模型在機器人技術的採用也日益增加。這些模型可以在物理背景中執行視覺推理，並為各種操作任務產生粗略的機器人動作。受此能力範圍的啟發，在這項工作中，我們提出並研究由視覺語言模型 (VLM) 塑造的回饋。最先進的 VLM 已展現出令人印象深刻的能力，可以透過零次學習中的關鍵點來推論可負擔性，我們利用這一點來定義機器人學習的密集回饋。在由自然語言描述指定的真實世界操作任務中，我們發現這些回饋提高了自主 RL 的取樣效率，並能在 20K 線上微調步驟中成功完成任務。此外，我們展示了該方法對用於預訓練的領域內示範次數減少的穩健性，在 35K 線上微調步驟中達到相當的效能。", "author": "Olivia Y. Lee et.al.", "authors": "Olivia Y. Lee, Annie Xie, Kuan Fang, Karl Pertsch, Chelsea Finn", "id": "2407.10341v1", "paper_url": "http://arxiv.org/abs/2407.10341v1", "repo": "null"}}