{"2411.07387": {"publish_time": "2024-11-11", "title": "Isochrony-Controlled Speech-to-Text Translation: A study on translating from Sino-Tibetan to Indo-European Languages", "paper_summary": "End-to-end speech translation (ST), which translates source language speech\ndirectly into target language text, has garnered significant attention in\nrecent years. Many ST applications require strict length control to ensure that\nthe translation duration matches the length of the source audio, including both\nspeech and pause segments. Previous methods often controlled the number of\nwords or characters generated by the Machine Translation model to approximate\nthe source sentence's length without considering the isochrony of pauses and\nspeech segments, as duration can vary between languages. To address this, we\npresent improvements to the duration alignment component of our\nsequence-to-sequence ST model. Our method controls translation length by\npredicting the duration of speech and pauses in conjunction with the\ntranslation process. This is achieved by providing timing information to the\ndecoder, ensuring it tracks the remaining duration for speech and pauses while\ngenerating the translation. The evaluation on the Zh-En test set of CoVoST 2,\ndemonstrates that the proposed Isochrony-Controlled ST achieves 0.92 speech\noverlap and 8.9 BLEU, which has only a 1.4 BLEU drop compared to the ST\nbaseline.", "paper_summary_zh": "端對端語音翻譯 (ST) 可直接將原始語言語音翻譯成目標語言文字，近年來備受關注。許多 ST 應用程式需要嚴格的長度控制，以確保翻譯時間與原始音訊長度相符，包括語音和暫停片段。先前的做法通常控制機器翻譯模型產生的字數或字元數，以估計原始句子的長度，而不考慮暫停和語音片段的等時性，因為不同語言的持續時間可能有所不同。為了解決這個問題，我們對序列對序列 ST 模型的持續時間比對元件進行了改進。我們的做法透過預測語音和暫停的持續時間，並與翻譯過程結合，來控制翻譯長度。這是透過提供計時資訊給解碼器來達成，確保它在產生翻譯時追蹤語音和暫停的剩餘時間。在 CoVoST 2 的中英測試集中進行評估，顯示所提出的等時性控制 ST 可達到 0.92 的語音重疊和 8.9 的 BLEU，與 ST 基準相比，BLEU 分數僅下降 1.4。", "author": "Midia Yousefi et.al.", "authors": "Midia Yousefi, Yao Qian, Junkun Chen, Gang Wang, Yanqing Liu, Dongmei Wang, Xiaofei Wang, Jian Xue", "id": "2411.07387v1", "paper_url": "http://arxiv.org/abs/2411.07387v1", "repo": "null"}}