{"2412.19726": {"publish_time": "2024-12-27", "title": "Can Large Language Models Adapt to Other Agents In-Context?", "paper_summary": "As the research community aims to build better AI assistants that are more\ndynamic and personalized to the diversity of humans that they interact with,\nthere is increased interest in evaluating the theory of mind capabilities of\nlarge language models (LLMs). Indeed, several recent studies suggest that LLM\ntheory of mind capabilities are quite impressive, approximating human-level\nperformance. Our paper aims to rebuke this narrative and argues instead that\npast studies were not directly measuring agent performance, potentially leading\nto findings that are illusory in nature as a result. We draw a strong\ndistinction between what we call literal theory of mind i.e. measuring the\nagent's ability to predict the behavior of others and functional theory of mind\ni.e. adapting to agents in-context based on a rational response to predictions\nof their behavior. We find that top performing open source LLMs may display\nstrong capabilities in literal theory of mind, depending on how they are\nprompted, but seem to struggle with functional theory of mind -- even when\npartner policies are exceedingly simple. Our work serves to highlight the\ndouble sided nature of inductive bias in LLMs when adapting to new situations.\nWhile this bias can lead to strong performance over limited horizons, it often\nhinders convergence to optimal long-term behavior.", "paper_summary_zh": "隨著研究社群致力於打造更優良的人工智慧助理，讓其更具動態性且個人化，以符合與之互動的人類的多樣性，因此對於評估大型語言模型 (LLM) 的心智理論能力也越來越感興趣。事實上，最近的多項研究指出，LLM 心智理論能力相當令人印象深刻，近似於人類等級的表現。我們的論文旨在駁斥這種說法，並主張先前的研究並未直接測量代理人的表現，因此可能導致所得結果本質上具有幻覺性質。我們在所謂的字面心智理論（即測量代理人預測他人行為的能力）與功能性心智理論（即根據對代理人行為預測的合理回應，在情境中適應代理人）之間，做出了明確的區別。我們發現，表現最佳的開源 LLM 可能在字面心智理論中展現強大能力，具體取決於提示方式，但似乎在功能性心智理論中會遇到困難，即使合作夥伴政策過於簡單也是如此。我們的研究旨在強調 LLM 在適應新情況時歸納偏差的雙重性質。雖然這種偏差在有限範圍內可能導致強勁表現，但通常會阻礙收斂至最佳長期行為。", "author": "Matthew Riemer et.al.", "authors": "Matthew Riemer, Zahra Ashktorab, Djallel Bouneffouf, Payel Das, Miao Liu, Justin D. Weisz, Murray Campbell", "id": "2412.19726v1", "paper_url": "http://arxiv.org/abs/2412.19726v1", "repo": "null"}}