{"2409.05977": {"publish_time": "2024-09-09", "title": "AI for Mathematics Mathematical Formalized Problem Solving and Theorem Proving in Different Fields in Lean4", "paper_summary": "Using computerized verifiable formal languages like Lean 4 to prove\nmathematical theorems has a significant impact on mathematical formalization.\nLean 4 offers prominent potential for advancing mathematical reasoning.\nHowever, existing efforts are limited to mathematical formalization languages\nin substantial online corpora and are dedicated to keeping pace with rapidly\nevolving languages. To bridge the gap between the traditional and computerized\nproof, my approach to formalizing theorem proving involves generating formal\nsteps and complete proofs using Large Language Models (LLMs) based on Natural\nLanguage (NL) proofs. The method is to introduce the basic structure and\ntactics in general, determine how AI can assist the mathematical formalization\nprocess to improve its performance, and give examples of solving problems in\nLean 4 comparing to NL, mainly in IMO, and a sample theorem proving in abstract\nalgebra.", "paper_summary_zh": "使用 Lean 4 等可計算驗證形式語言來證明數學定理對數學形式化有重大影響。\nLean 4 為推進數學推理提供了顯著的潛力。\n然而，現有的努力僅限於大量的在線語料庫中的數學形式化語言，並且致力於跟上快速發展的語言。為了彌合傳統和計算機化證明之間的差距，我對定理證明形式化的方法涉及使用基於自然語言 (NL) 證明的生成形式步驟和完整證明的大語言模型 (LLM)。該方法是介紹一般性的基本結構和策略，確定 AI 如何協助數學形式化過程以提高其性能，並給出在 Lean 4 中解決問題的示例，與 NL 進行比較，主要在 IMO 中，以及在抽象代數中的樣本定理證明。", "author": "Xichen Tang et.al.", "authors": "Xichen Tang", "id": "2409.05977v1", "paper_url": "http://arxiv.org/abs/2409.05977v1", "repo": "null"}}