{"2405.05175": {"publish_time": "2024-05-08", "title": "Air Gap: Protecting Privacy-Conscious Conversational Agents", "paper_summary": "The growing use of large language model (LLM)-based conversational agents to\nmanage sensitive user data raises significant privacy concerns. While these\nagents excel at understanding and acting on context, this capability can be\nexploited by malicious actors. We introduce a novel threat model where\nadversarial third-party apps manipulate the context of interaction to trick\nLLM-based agents into revealing private information not relevant to the task at\nhand.\n  Grounded in the framework of contextual integrity, we introduce AirGapAgent,\na privacy-conscious agent designed to prevent unintended data leakage by\nrestricting the agent's access to only the data necessary for a specific task.\nExtensive experiments using Gemini, GPT, and Mistral models as agents validate\nour approach's effectiveness in mitigating this form of context hijacking while\nmaintaining core agent functionality. For example, we show that a single-query\ncontext hijacking attack on a Gemini Ultra agent reduces its ability to protect\nuser data from 94% to 45%, while an AirGapAgent achieves 97% protection,\nrendering the same attack ineffective.", "paper_summary_zh": "隨著基於大型語言模型 (LLM) 的對話式代理程式日益用於管理敏感的使用者資料，這會引發重大的隱私問題。雖然這些代理程式擅長理解和處理脈絡，但惡意行為者可能會利用此功能。我們引入了一個新的威脅模型，其中惡意的第三方應用程式會操縱互動脈絡，誘騙基於 LLM 的代理程式揭露與手邊任務無關的私人資訊。\n  基於脈絡完整性的架構，我們引入了 AirGapAgent，這是一個注重隱私的代理程式，旨在透過限制代理程式僅存取特定任務所需的資料來防止意外的資料外洩。使用 Gemini、GPT 和 Mistral 模型作為代理程式的廣泛實驗驗證了我們的方法在減輕這種形式的脈絡劫持時的有效性，同時維持核心代理程式功能。例如，我們展示了對 Gemini Ultra 代理程式的單一查詢脈絡劫持攻擊，會將其保護使用者資料的能力從 94% 降低到 45%，而 AirGapAgent 達到了 97% 的保護，讓相同的攻擊無效。", "author": "Eugene Bagdasaryan et.al.", "authors": "Eugene Bagdasaryan, Ren Yi, Sahra Ghalebikesabi, Peter Kairouz, Marco Gruteser, Sewoong Oh, Borja Balle, Daniel Ramage", "id": "2405.05175v1", "paper_url": "http://arxiv.org/abs/2405.05175v1", "repo": "null"}}