{"2410.08928": {"publish_time": "2024-10-11", "title": "Towards Cross-Lingual LLM Evaluation for European Languages", "paper_summary": "The rise of Large Language Models (LLMs) has revolutionized natural language\nprocessing across numerous languages and tasks. However, evaluating LLM\nperformance in a consistent and meaningful way across multiple European\nlanguages remains challenging, especially due to the scarcity of multilingual\nbenchmarks. We introduce a cross-lingual evaluation approach tailored for\nEuropean languages. We employ translated versions of five widely-used\nbenchmarks to assess the capabilities of 40 LLMs across 21 European languages.\nOur contributions include examining the effectiveness of translated benchmarks,\nassessing the impact of different translation services, and offering a\nmultilingual evaluation framework for LLMs that includes newly created\ndatasets: EU20-MMLU, EU20-HellaSwag, EU20-ARC, EU20-TruthfulQA, and EU20-GSM8K.\nThe benchmarks and results are made publicly available to encourage further\nresearch in multilingual LLM evaluation.", "paper_summary_zh": "大型語言模型 (LLM) 的興起徹底改變了各種語言和任務的自然語言處理。然而，以一致且有意義的方式評估多種歐洲語言的 LLM 效能仍然具有挑戰性，特別是因為缺乏多語言基準。我們提出了一種針對歐洲語言量身打造的跨語言評估方法。我們採用五個廣泛使用的基準的翻譯版本來評估 40 種 LLM 在 21 種歐洲語言中的能力。我們的貢獻包括檢查翻譯基準的有效性、評估不同翻譯服務的影響，以及提供一個多語言評估架構，其中包含新建立的資料集：EU20-MMLU、EU20-HellaSwag、EU20-ARC、EU20-TruthfulQA 和 EU20-GSM8K。這些基準和結果公開可用，以鼓勵對多語言 LLM 評估進行進一步的研究。", "author": "Klaudia Thellmann et.al.", "authors": "Klaudia Thellmann, Bernhard Stadler, Michael Fromm, Jasper Schulze Buschhoff, Alex Jude, Fabio Barth, Johannes Leveling, Nicolas Flores-Herr, Joachim Köhler, René Jäkel, Mehdi Ali", "id": "2410.08928v1", "paper_url": "http://arxiv.org/abs/2410.08928v1", "repo": "null"}}