{"2409.03381": {"publish_time": "2024-09-05", "title": "CogniDual Framework: Self-Training Large Language Models within a Dual-System Theoretical Framework for Improving Cognitive Tasks", "paper_summary": "Cognitive psychology investigates perception, attention, memory, language,\nproblem-solving, decision-making, and reasoning. Kahneman's dual-system theory\nelucidates the human decision-making process, distinguishing between the rapid,\nintuitive System 1 and the deliberative, rational System 2. Recent advancements\nhave positioned large language Models (LLMs) as formidable tools nearing\nhuman-level proficiency in various cognitive tasks. Nonetheless, the presence\nof a dual-system framework analogous to human cognition in LLMs remains\nunexplored. This study introduces the \\textbf{CogniDual Framework for LLMs}\n(CFLLMs), designed to assess whether LLMs can, through self-training, evolve\nfrom deliberate deduction to intuitive responses, thereby emulating the human\nprocess of acquiring and mastering new information. Our findings reveal the\ncognitive mechanisms behind LLMs' response generation, enhancing our\nunderstanding of their capabilities in cognitive psychology. Practically,\nself-trained models can provide faster responses to certain queries, reducing\ncomputational demands during inference.", "paper_summary_zh": "認知心理學研究知覺、注意力、記憶、語言、問題解決、決策和推理。卡尼曼的雙系統理論闡明了人類決策過程，區分了快速、直覺的系統 1 和深思熟慮、理性的系統 2。最近的進展已將大型語言模型 (LLM) 定位為強大的工具，在各種認知任務中接近人類水平的熟練度。儘管如此，在 LLM 中類似於人類認知的雙系統架構的存在仍未被探索。本研究介紹了 LLM 的 CogniDual 框架 (CFLLM)，旨在評估 LLM 是否能透過自我訓練，從深思熟慮的推論演變為直覺反應，從而模擬人類獲取和掌握新資訊的過程。我們的研究結果揭示了 LLM 回應產生的認知機制，增強了我們對其在認知心理學中的能力的理解。實際上，自我訓練的模型可以對某些查詢提供更快的回應，從而減少推理過程中的運算需求。", "author": "Yongxin Deng et.al.", "authors": "Yongxin Deng, Xihe Qiu, Xiaoyu Tan, Chao Qu, Jing Pan, Yuan Cheng, Yinghui Xu, Wei Chu", "id": "2409.03381v1", "paper_url": "http://arxiv.org/abs/2409.03381v1", "repo": "null"}}