{"2411.03055": {"publish_time": "2024-11-05", "title": "ATM: Improving Model Merging by Alternating Tuning and Merging", "paper_summary": "Model merging has recently emerged as a cost-efficient paradigm for\nmulti-task learning. Among current approaches, task arithmetic stands out for\nits simplicity and effectiveness. In this paper, we motivate the effectiveness\nof task vectors by linking them to multi-task gradients. We show that in a\nsingle-epoch scenario, task vectors are mathematically equivalent to the\ngradients obtained via gradient descent in a multi-task setting, and still\napproximate these gradients in subsequent epochs. Furthermore, we show that\ntask vectors perform optimally when equality is maintained, and their\neffectiveness is largely driven by the first epoch's gradient. Building on this\ninsight, we propose viewing model merging as a single step in an iterative\nprocess that Alternates between Tuning and Merging (ATM). This method acts as a\nbridge between model merging and multi-task gradient descent, achieving\nstate-of-the-art results with the same data and computational requirements. We\nextensively evaluate ATM across diverse settings, achieving up to 20% higher\naccuracy in computer vision and NLP tasks, compared to the best\nbaselines.Finally, we provide both empirical and theoretical support for its\neffectiveness, demonstrating increased orthogonality between task vectors and\nproving that ATM minimizes an upper bound on the loss obtained by jointly\nfinetuning all tasks.", "paper_summary_zh": "模型合并最近已成为多任务学习中一种经济高效的范例。在当前方法中，任务算术因其简单性和有效性而脱颖而出。在本文中，我们通过将任务向量与多任务梯度联系起来，激发了任务向量的有效性。我们表明，在单次迭代的情况下，任务向量在数学上等效于在多任务设置中通过梯度下降获得的梯度，并且在后续迭代中仍然近似于这些梯度。此外，我们表明，当维护相等性时，任务向量执行得最佳，并且它们的有效性在很大程度上是由第一个迭代的梯度驱动的。基于这一见解，我们建议将模型合并视为在交替调整和合并 (ATM) 的迭代过程中采取的单一步骤。此方法充当了模型合并和多任务梯度下降之间的桥梁，在相同的数据和计算需求下实现了最先进的结果。我们对 ATM 在不同设置中进行了广泛评估，与最佳基线相比，在计算机视觉和 NLP 任务中实现了高达 20% 的更高准确度。最后，我们为其有效性提供了经验和理论支持，证明了任务向量之间的正交性增加，并证明 ATM 最小化了通过联合微调所有任务获得的损失的上限。", "author": "Luca Zhou et.al.", "authors": "Luca Zhou, Daniele Solombrino, Donato Crisostomi, Maria Sofia Bucarelli, Fabrizio Silvestri, Emanuele Rodolà", "id": "2411.03055v1", "paper_url": "http://arxiv.org/abs/2411.03055v1", "repo": "null"}}