{"2407.11774": {"publish_time": "2024-07-16", "title": "Sharif-MGTD at SemEval-2024 Task 8: A Transformer-Based Approach to Detect Machine Generated Text", "paper_summary": "Detecting Machine-Generated Text (MGT) has emerged as a significant area of\nstudy within Natural Language Processing. While language models generate text,\nthey often leave discernible traces, which can be scrutinized using either\ntraditional feature-based methods or more advanced neural language models. In\nthis research, we explore the effectiveness of fine-tuning a RoBERTa-base\ntransformer, a powerful neural architecture, to address MGT detection as a\nbinary classification task. Focusing specifically on Subtask A\n(Monolingual-English) within the SemEval-2024 competition framework, our\nproposed system achieves an accuracy of 78.9% on the test dataset, positioning\nus at 57th among participants. Our study addresses this challenge while\nconsidering the limited hardware resources, resulting in a system that excels\nat identifying human-written texts but encounters challenges in accurately\ndiscerning MGTs.", "paper_summary_zh": "機器產生的文字（MGT）偵測已成為自然語言處理中一個重要的研究領域。雖然語言模型會產生文字，但它們通常會留下可辨識的痕跡，可以使用傳統的基於特徵的方法或更先進的神經語言模型來檢視這些痕跡。在這項研究中，我們探討了微調 RoBERTa-base 轉換器（一種強大的神經架構）來處理 MGT 偵測作為二元分類任務的有效性。特別專注於 SemEval-2024 競賽架構中的子任務 A（單語英語），我們提出的系統在測試資料集上達到了 78.9% 的準確度，在參與者中排名第 57 位。我們的研究在考慮有限硬體資源的同時應對了這一挑戰，從而產生了一個在識別人類撰寫的文字方面表現出色，但在準確辨別 MGT 方面遇到挑戰的系統。", "author": "Seyedeh Fatemeh Ebrahimi et.al.", "authors": "Seyedeh Fatemeh Ebrahimi, Karim Akhavan Azari, Amirmasoud Iravani, Arian Qazvini, Pouya Sadeghi, Zeinab Sadat Taghavi, Hossein Sameti", "id": "2407.11774v1", "paper_url": "http://arxiv.org/abs/2407.11774v1", "repo": "null"}}