{"2406.11135": {"publish_time": "2024-06-17", "title": "Towards Understanding Emotions for Engaged Mental Health Conversations", "paper_summary": "Providing timely support and intervention is crucial in mental health\nsettings. As the need to engage youth comfortable with texting increases,\nmental health providers are exploring and adopting text-based media such as\nchatbots, community-based forums, online therapies with licensed professionals,\nand helplines operated by trained responders. To support these text-based media\nfor mental health--particularly for crisis care--we are developing a system to\nperform passive emotion-sensing using a combination of keystroke dynamics and\nsentiment analysis. Our early studies of this system posit that the analysis of\nshort text messages and keyboard typing patterns can provide emotion\ninformation that may be used to support both clients and responders. We use our\npreliminary findings to discuss the way forward for applying AI to support\nmental health providers in providing better care.", "paper_summary_zh": "在心理健康環境中提供及時的支援和介入至關重要。隨著與青少年互動時，使用文字訊息的需求增加，心理健康服務提供者正在探索和採用基於文字訊息的媒體，例如聊天機器人、社群論壇、由持照專業人員提供的線上療法，以及由受過訓練的回應者營運的求助專線。為了支援這些用於心理健康的基於文字訊息的媒體——特別是危機照護——我們正在開發一個系統，使用按鍵動力學和情緒分析的組合來執行被動情緒感測。我們對這個系統的早期研究假設，對簡短文字訊息和鍵盤輸入模式的分析可以提供情緒資訊，可用於支援個案和回應者。我們使用我們的初步發現來討論將 AI 應用於支援心理健康服務提供者提供更好照護的未來方向。", "author": "Kellie Yu Hui Sim et.al.", "authors": "Kellie Yu Hui Sim, Kohleen Tijing Fortuno, Kenny Tsu Wei Choo", "id": "2406.11135v1", "paper_url": "http://arxiv.org/abs/2406.11135v1", "repo": "null"}}