{"2411.03562": {"publish_time": "2024-11-05", "title": "Large Language Models Orchestrating Structured Reasoning Achieve Kaggle Grandmaster Level", "paper_summary": "We introduce Agent K v1.0, an end-to-end autonomous data science agent\ndesigned to automate, optimise, and generalise across diverse data science\ntasks. Fully automated, Agent K v1.0 manages the entire data science life cycle\nby learning from experience. It leverages a highly flexible structured\nreasoning framework to enable it to dynamically process memory in a nested\nstructure, effectively learning from accumulated experience stored to handle\ncomplex reasoning tasks. It optimises long- and short-term memory by\nselectively storing and retrieving key information, guiding future decisions\nbased on environmental rewards. This iterative approach allows it to refine\ndecisions without fine-tuning or backpropagation, achieving continuous\nimprovement through experiential learning. We evaluate our agent's apabilities\nusing Kaggle competitions as a case study. Following a fully automated\nprotocol, Agent K v1.0 systematically addresses complex and multimodal data\nscience tasks, employing Bayesian optimisation for hyperparameter tuning and\nfeature engineering. Our new evaluation framework rigorously assesses Agent K\nv1.0's end-to-end capabilities to generate and send submissions starting from a\nKaggle competition URL. Results demonstrate that Agent K v1.0 achieves a 92.5\\%\nsuccess rate across tasks, spanning tabular, computer vision, NLP, and\nmultimodal domains. When benchmarking against 5,856 human Kaggle competitors by\ncalculating Elo-MMR scores for each, Agent K v1.0 ranks in the top 38\\%,\ndemonstrating an overall skill level comparable to Expert-level users. Notably,\nits Elo-MMR score falls between the first and third quartiles of scores\nachieved by human Grandmasters. Furthermore, our results indicate that Agent K\nv1.0 has reached a performance level equivalent to Kaggle Grandmaster, with a\nrecord of 6 gold, 3 silver, and 7 bronze medals, as defined by Kaggle's\nprogression system.", "paper_summary_zh": "<paragraph>我們推出 Agent K v1.0，一個端到端的自主資料科學代理程式，\n旨在自動化、最佳化，並概括各種資料科學任務。Agent K v1.0 全自動化管理整個資料科學生命週期，\n透過從經驗中學習。它利用高度靈活的結構化推理框架，使其能夠動態處理巢狀結構中的記憶體，有效地從儲存的累積經驗中學習，以處理複雜的推理任務。它透過選擇性儲存和擷取關鍵資訊，最佳化長期和短期記憶體，根據環境獎勵引導未來的決策。這種迭代方法允許它在不進行微調或反向傳播的情況下改善決策，透過體驗式學習實現持續改進。我們使用 Kaggle 競賽作為案例研究，評估我們代理程式的功能。遵循全自動化協定，Agent K v1.0 系統性地處理複雜且多模態的資料科學任務，採用貝氏最佳化進行超參數調整和特徵工程。我們新的評估框架嚴格評估 Agent K v1.0 的端到端功能，從 Kaggle 競賽 URL 開始產生並發送提交。結果表明，Agent K v1.0 在各項任務中實現了 92.5% 的成功率，涵蓋表格、電腦視覺、NLP 和多模態領域。透過計算每個人的 Elo-MMR 分數，在與 5,856 名人類 Kaggle 競爭者進行基準比較時，Agent K v1.0 排名前 38%，表現出與專家級使用者相當的整體技能水準。值得注意的是，它的 Elo-MMR 分數介於人類大師所獲得分數的第一和第三個四分位數之間。此外，我們的結果表明，Agent K v1.0 已達到與 Kaggle 大師同等的效能水準，根據 Kaggle 的進度系統定義，擁有 6 面金牌、3 面銀牌和 7 面銅牌的紀錄。</paragraph>", "author": "Antoine Grosnit et.al.", "authors": "Antoine Grosnit, Alexandre Maraval, James Doran, Giuseppe Paolo, Albert Thomas, Refinath Shahul Hameed Nabeezath Beevi, Jonas Gonzalez, Khyati Khandelwal, Ignacio Iacobacci, Abdelhakim Benechehab, Hamza Cherkaoui, Youssef Attia El-Hili, Kun Shao, Jianye Hao, Jun Yao, Balazs Kegl, Haitham Bou-Ammar, Jun Wang", "id": "2411.03562v1", "paper_url": "http://arxiv.org/abs/2411.03562v1", "repo": "null"}}