{"2406.02443": {"publish_time": "2024-06-04", "title": "Explainable Deep Learning Analysis for Raga Identification in Indian Art Music", "paper_summary": "The task of Raga Identification is a very popular research problem in Music\nInformation Retrieval. Few studies that have explored this task employed\nvarious approaches, such as signal processing, Machine Learning (ML) methods,\nand more recently Deep Learning (DL) based methods. However, a key question\nremains unanswered in all of these works: do these ML/DL methods learn and\ninterpret Ragas in a manner similar to human experts? Besides, a significant\nroadblock in this research is the unavailability of ample supply of rich,\nlabeled datasets, which drives these ML/DL based methods. In this paper, we\nintroduce \"Prasarbharti Indian Music\" version-1 (PIM-v1), a novel dataset\ncomprising of 191 hours of meticulously labeled Hindustani Classical Music\n(HCM) recordings, which is the largest labeled dataset for HCM recordings to\nthe best of our knowledge. Our approach involves conducting ablation studies to\nfind the benchmark classification model for Automatic Raga Identification (ARI)\nusing PIM-v1 dataset. We achieve a chunk-wise f1-score of 0.89 for a subset of\n12 Raga classes. Subsequently, we employ model explainability techniques to\nevaluate the classifier's predictions, aiming to ascertain whether they align\nwith human understanding of Ragas or are driven by arbitrary patterns. We\nvalidate the correctness of model's predictions by comparing the explanations\ngiven by two ExAI models with human expert annotations. Following this, we\nanalyze explanations for individual test examples to understand the role of\nregions highlighted by explanations in correct or incorrect predictions made by\nthe model.", "paper_summary_zh": "拉格识别任务是音乐信息检索中非常流行的研究问题。探索这项任务的少数研究采用了各种方法，例如信号处理、机器学习 (ML) 方法，以及最近基于深度学习 (DL) 的方法。然而，所有这些工作中都仍然有一个关键问题没有得到解答：这些 ML/DL 方法是否以类似于人类专家的方式学习和解释拉格？此外，这项研究中的一个重大障碍是缺乏丰富且标记良好的数据集，而这正是这些基于 ML/DL 的方法的驱动力。在本文中，我们介绍了“Prasarbharti Indian Music”版本 1 (PIM-v1)，这是一个新颖的数据集，包含 191 小时的精心标记的印度斯坦古典音乐 (HCM) 录音，据我们所知，这是 HCM 录音中最大的标记数据集。我们的方法包括进行消融研究，以找到使用 PIM-v1 数据集进行自动拉格识别 (ARI) 的基准分类模型。对于 12 个拉格类别的子集，我们实现了 0.89 的分块 f1 分数。随后，我们采用模型可解释性技术来评估分类器的预测，目的是确定它们是否与人类对拉格的理解一致，或者是由任意模式驱动的。我们通过将两个 ExAI 模型给出的解释与人类专家注释进行比较来验证模型预测的正确性。在此之后，我们分析了单个测试示例的解释，以了解解释中突出显示的区域在模型做出的正确或不正确的预测中所扮演的角色。", "author": "Parampreet Singh et.al.", "authors": "Parampreet Singh, Vipul Arora", "id": "2406.02443v1", "paper_url": "http://arxiv.org/abs/2406.02443v1", "repo": "https://github.com/parampreetsingh97/pim_v1_exai"}}