{"2411.18247": {"publish_time": "2024-11-27", "title": "A gentle push funziona benissimo: making instructed models in Italian via contrastive activation steering", "paper_summary": "Adapting models to a language that was only partially present in the\npre-training data requires fine-tuning, which is expensive in terms of both\ndata and computational resources. As an alternative to fine-tuning, we explore\nthe potential of activation steering-based techniques to enhance model\nperformance on Italian tasks. Through our experiments we show that Italian\nsteering (i) can be successfully applied to different models, (ii) achieves\nperformances comparable to, or even better than, fine-tuned models for Italian,\nand (iii) yields higher quality and consistency in Italian generations. We also\ndiscuss the utility of steering and fine-tuning in the contemporary LLM\nlandscape where models are anyway getting high Italian performances even if not\nexplicitly trained in this language.", "paper_summary_zh": "要將模型套用到在預訓練資料中僅部分出現的語言，需要進行微調，這在資料和運算資源方面都很昂貴。我們探討基於啟動引導的技術的潛力，作為微調的替代方案，以增強模型在義大利語任務上的效能。透過我們的實驗，我們顯示義大利語引導 (i) 可以成功套用於不同的模型，(ii) 達到與義大利語微調模型相當甚至更好的效能，以及 (iii) 產生更高品質且一致的義大利語。我們也討論在當代 LLM 環境中引導和微調的效用，其中模型即使未針對此語言進行明確訓練，也能獲得很高的義大利語效能。", "author": "Daniel Scalena et.al.", "authors": "Daniel Scalena, Elisabetta Fersini, Malvina Nissim", "id": "2411.18247v1", "paper_url": "http://arxiv.org/abs/2411.18247v1", "repo": "null"}}