{"2406.04692": {"publish_time": "2024-06-07", "title": "Mixture-of-Agents Enhances Large Language Model Capabilities", "paper_summary": "Recent advances in large language models (LLMs) demonstrate substantial\ncapabilities in natural language understanding and generation tasks. With the\ngrowing number of LLMs, how to harness the collective expertise of multiple\nLLMs is an exciting open direction. Toward this goal, we propose a new approach\nthat leverages the collective strengths of multiple LLMs through a\nMixture-of-Agents (MoA) methodology. In our approach, we construct a layered\nMoA architecture wherein each layer comprises multiple LLM agents. Each agent\ntakes all the outputs from agents in the previous layer as auxiliary\ninformation in generating its response. MoA models achieves state-of-art\nperformance on AlpacaEval 2.0, MT-Bench and FLASK, surpassing GPT-4 Omni. For\nexample, our MoA using only open-source LLMs is the leader of AlpacaEval 2.0 by\na substantial gap, achieving a score of 65.1% compared to 57.5% by GPT-4 Omni.", "paper_summary_zh": "大型語言模型（LLM）的最新進展在自然語言理解和生成任務中展現了強大的能力。隨著 LLM 數量的增加，如何利用多個 LLM 的集體專業知識是一個令人興奮的開放方向。為了實現這一目標，我們提出了一種新方法，該方法通過混合代理（MoA）方法利用多個 LLM 的集體優勢。在我們的做法中，我們構建了一個分層的 MoA 架構，其中每一層都包含多個 LLM 代理。每個代理都將前一層代理的所有輸出作為輔助信息，以生成其響應。MoA 模型在 AlpacaEval 2.0、MT-Bench 和 FLASK 上實現了最先進的性能，超越了 GPT-4 Omni。例如，我們僅使用開源 LLM 的 MoA 以大幅差距領先 AlpacaEval 2.0，與 GPT-4 Omni 的 57.5% 相比，達到 65.1% 的分數。", "author": "Junlin Wang et.al.", "authors": "Junlin Wang, Jue Wang, Ben Athiwaratkun, Ce Zhang, James Zou", "id": "2406.04692v1", "paper_url": "http://arxiv.org/abs/2406.04692v1", "repo": "null"}}