{"2406.02110": {"publish_time": "2024-06-04", "title": "UniOQA: A Unified Framework for Knowledge Graph Question Answering with Large Language Models", "paper_summary": "OwnThink stands as the most extensive Chinese open-domain knowledge graph\nintroduced in recent times. Despite prior attempts in question answering over\nOwnThink (OQA), existing studies have faced limitations in model representation\ncapabilities, posing challenges in further enhancing overall accuracy in\nquestion answering. In this paper, we introduce UniOQA, a unified framework\nthat integrates two complementary parallel workflows. Unlike conventional\napproaches, UniOQA harnesses large language models (LLMs) for precise question\nanswering and incorporates a direct-answer-prediction process as a\ncost-effective complement. Initially, to bolster representation capacity, we\nfine-tune an LLM to translate questions into the Cypher query language (CQL),\ntackling issues associated with restricted semantic understanding and\nhallucinations. Subsequently, we introduce the Entity and Relation Replacement\nalgorithm to ensure the executability of the generated CQL. Concurrently, to\naugment overall accuracy in question answering, we further adapt the\nRetrieval-Augmented Generation (RAG) process to the knowledge graph.\nUltimately, we optimize answer accuracy through a dynamic decision algorithm.\nExperimental findings illustrate that UniOQA notably advances SpCQL Logical\nAccuracy to 21.2% and Execution Accuracy to 54.9%, achieving the new\nstate-of-the-art results on this benchmark. Through ablation experiments, we\ndelve into the superior representation capacity of UniOQA and quantify its\nperformance breakthrough.", "paper_summary_zh": "OwnThink 是近來介紹的最廣泛的中文開放領域知識圖譜。儘管先前嘗試在 OwnThink（OQA）上進行問題解答，但現有研究在模型表示能力方面面臨限制，對進一步提高問題解答的整體準確性構成挑戰。在本文中，我們介紹了 UniOQA，這是一個統一的框架，它整合了兩個互補的並行工作流程。與傳統方法不同，UniOQA 利用大型語言模型 (LLM) 進行精準問題解答，並將直接答案預測過程作為一種具有成本效益的補充。最初，為了加強表示能力，我們微調 LLM 以將問題轉換為 Cypher 查詢語言 (CQL)，解決與受限語義理解和幻覺相關的問題。隨後，我們引入了實體和關係替換演算法，以確保生成的 CQL 的可執行性。同時，為了提高問題解答的整體準確性，我們進一步將檢索增強生成 (RAG) 過程適應到知識圖譜。最終，我們透過動態決策演算法最佳化答案準確性。實驗結果表明，UniOQA 將 SpCQL 邏輯準確度顯著提升至 21.2%，執行準確度提升至 54.9%，在這個基準上取得了新的最先進結果。透過消融實驗，我們深入探討 UniOQA 的優異表示能力，並量化其效能突破。", "author": "Zhuoyang Li et.al.", "authors": "Zhuoyang Li, Liran Deng, Hui Liu, Qiaoqiao Liu, Junzhao Du", "id": "2406.02110v1", "paper_url": "http://arxiv.org/abs/2406.02110v1", "repo": "null"}}