{"2406.19276": {"publish_time": "2024-06-27", "title": "VERISCORE: Evaluating the factuality of verifiable claims in long-form text generation", "paper_summary": "Existing metrics for evaluating the factuality of long-form text, such as\nFACTSCORE (Min et al., 2023) and SAFE (Wei et al., 2024), decompose an input\ntext into \"atomic claims\" and verify each against a knowledge base like\nWikipedia. These metrics are not suitable for most generation tasks because\nthey assume that every claim is verifiable (i.e., can plausibly be proven true\nor false). We address this issue with VERISCORE, a metric for diverse long-form\ngeneration tasks that contain both verifiable and unverifiable content.\nVERISCORE can be effectively implemented with either closed or fine-tuned\nopen-weight language models, and human evaluation confirms that VERISCORE's\nextracted claims are more sensible than those from competing methods across\neight different long-form tasks. We use VERISCORE to evaluate generations from\n16 different models across multiple long-form tasks and find that while GPT-4o\nis the best-performing model overall, open-weight models such as Mixtral-8x22\nare closing the gap. We show that an LM's VERISCORE on one task (e.g.,\nbiography generation) does not necessarily correlate to its VERISCORE on a\ndifferent task (e.g., long-form QA), highlighting the need for expanding\nfactuality evaluation across tasks with varying fact density.", "paper_summary_zh": "現有的長篇文字事實性評估指標，例如 FACTSCORE (Min 等人，2023) 和 SAFE (Wei 等人，2024)，將輸入文字分解成「原子性宣稱」，並根據知識庫（例如維基百科）驗證每個宣稱。這些指標並不適合大多數生成任務，因為它們假設每個宣稱都是可驗證的（即合理地被證明為真或假）。我們使用 VERISCORE 解決此問題，VERISCORE 是適用於包含可驗證和不可驗證內容的多元長篇生成任務的指標。VERISCORE 可以有效地使用封閉或微調的開放權重語言模型實作，而人工評估確認 VERISCORE 提取的宣稱比八種不同長篇任務中競爭方法提取的宣稱更合理。我們使用 VERISCORE 評估來自 16 個不同模型在多個長篇任務中的生成，並發現儘管 GPT-4o 整體表現最佳，但 Mixtral-8x22 等開放權重模型正在縮小差距。我們表明，語言模型在一個任務（例如傳記生成）上的 VERISCORE 並不一定與其在不同任務（例如長篇問答）上的 VERISCORE 相關，這突顯了在事實密度不同的任務中擴展事實性評估的必要性。", "author": "Yixiao Song et.al.", "authors": "Yixiao Song, Yekyung Kim, Mohit Iyyer", "id": "2406.19276v1", "paper_url": "http://arxiv.org/abs/2406.19276v1", "repo": "null"}}