{"2405.07896": {"publish_time": "2024-04-30", "title": "Almanac Copilot: Towards Autonomous Electronic Health Record Navigation", "paper_summary": "Clinicians spend large amounts of time on clinical documentation, and\ninefficiencies impact quality of care and increase clinician burnout. Despite\nthe promise of electronic medical records (EMR), the transition from\npaper-based records has been negatively associated with clinician wellness, in\npart due to poor user experience, increased burden of documentation, and alert\nfatigue. In this study, we present Almanac Copilot, an autonomous agent capable\nof assisting clinicians with EMR-specific tasks such as information retrieval\nand order placement. On EHR-QA, a synthetic evaluation dataset of 300 common\nEHR queries based on real patient data, Almanac Copilot obtains a successful\ntask completion rate of 74% (n = 221 tasks) with a mean score of 2.45 over 3\n(95% CI:2.34-2.56). By automating routine tasks and streamlining the\ndocumentation process, our findings highlight the significant potential of\nautonomous agents to mitigate the cognitive load imposed on clinicians by\ncurrent EMR systems.", "paper_summary_zh": "臨床醫師花費大量時間在臨床文件上，而低效率會影響照護品質並增加臨床醫師的倦怠感。儘管電子病歷 (EMR) 充滿希望，但從紙本病歷過渡到電子病歷與臨床醫師的健康狀況負相關，部分原因在於使用者體驗不佳、文件負擔增加以及警示疲勞。在本研究中，我們提出 Almanac Copilot，這是一個自主代理人，能夠協助臨床醫師執行 EMR 特定任務，例如資訊擷取和訂單下達。在 EHR-QA（一個基於真實病患資料的 300 個常見 EHR 查詢的合成評估資料集）上，Almanac Copilot 在 3 分中取得 74%（n = 221 項任務）的成功任務完成率，平均得分為 2.45（95% CI：2.34-2.56）。透過自動化例行任務並簡化文件處理流程，我們的研究結果突顯了自主代理人減輕當前 EMR 系統對臨床醫師造成的認知負擔的顯著潛力。", "author": "Cyril Zakka et.al.", "authors": "Cyril Zakka, Joseph Cho, Gracia Fahed, Rohan Shad, Michael Moor, Robyn Fong, Dhamanpreet Kaur, Vishnu Ravi, Oliver Aalami, Roxana Daneshjou, Akshay Chaudhari, William Hiesinger", "id": "2405.07896v2", "paper_url": "http://arxiv.org/abs/2405.07896v2", "repo": "null"}}