{"2408.15257": {"publish_time": "2024-08-09", "title": "Text classification optimization algorithm based on graph neural network", "paper_summary": "In the field of natural language processing, text classification, as a basic\ntask, has important research value and application prospects. Traditional text\nclassification methods usually rely on feature representations such as the bag\nof words model or TF-IDF, which overlook the semantic connections between words\nand make it challenging to grasp the deep structural details of the text.\nRecently, GNNs have proven to be a valuable asset for text classification\ntasks, thanks to their capability to handle non-Euclidean data efficiently.\nHowever, the existing text classification methods based on GNN still face\nchallenges such as complex graph structure construction and high cost of model\ntraining. This paper introduces a text classification optimization algorithm\nutilizing graph neural networks. By introducing adaptive graph construction\nstrategy and efficient graph convolution operation, the accuracy and efficiency\nof text classification are effectively improved. The experimental results\ndemonstrate that the proposed method surpasses traditional approaches and\nexisting GNN models across multiple public datasets, highlighting its superior\nperformance and feasibility for text classification tasks.", "paper_summary_zh": "在自然語言處理領域，文本分類作為一項基礎任務，具有重要的研究價值和應用前景。傳統的文本分類方法通常依賴於詞袋模型或 TF-IDF 等特徵表示，這忽視了詞彙之間的語義聯繫，使得難以把握文本的深層結構細節。近年來，GNN 已被證明是文本分類任務的寶貴資產，這歸功於它們有效處理非歐幾里得數據的能力。然而，基於 GNN 的現有文本分類方法仍然面臨著圖結構構建複雜、模型訓練成本高等挑戰。本文提出了一種利用圖神經網絡的文本分類優化算法。通過引入自適應圖構建策略和高效的圖卷積運算，有效地提高了文本分類的準確率和效率。實驗結果表明，該方法在多個公開數據集上超越了傳統方法和現有的 GNN 模型，凸顯了其在文本分類任務中的優越性能和可行性。", "author": "Erdi Gao et.al.", "authors": "Erdi Gao, Haowei Yang, Dan Sun, Haohao Xia, Yuhan Ma, Yuanjing Zhu", "id": "2408.15257v1", "paper_url": "http://arxiv.org/abs/2408.15257v1", "repo": "null"}}