{"2412.10008": {"publish_time": "2024-12-13", "title": "Automated Collection of Evaluation Dataset for Semantic Search in Low-Resource Domain Language", "paper_summary": "Domain-specific languages that use a lot of specific terminology often fall\ninto the category of low-resource languages. Collecting test datasets in a\nnarrow domain is time-consuming and requires skilled human resources with\ndomain knowledge and training for the annotation task. This study addresses the\nchallenge of automated collecting test datasets to evaluate semantic search in\nlow-resource domain-specific German language of the process industry. Our\napproach proposes an end-to-end annotation pipeline for automated query\ngeneration to the score reassessment of query-document pairs. To overcome the\nlack of text encoders trained in the German chemistry domain, we explore a\nprinciple of an ensemble of \"weak\" text encoders trained on common knowledge\ndatasets. We combine individual relevance scores from diverse models to\nretrieve document candidates and relevance scores generated by an LLM, aiming\nto achieve consensus on query-document alignment. Evaluation results\ndemonstrate that the ensemble method significantly improves alignment with\nhuman-assigned relevance scores, outperforming individual models in both\ninter-coder agreement and accuracy metrics. These findings suggest that\nensemble learning can effectively adapt semantic search systems for\nspecialized, low-resource languages, offering a practical solution to resource\nlimitations in domain-specific contexts.", "paper_summary_zh": "<paragraph>使用大量特定術語的特定領域語言通常屬於低資源語言類別。在狹窄的領域中收集測試數據集非常耗時，並且需要具備領域知識和標註任務訓練的熟練人力資源。本研究解決了自動收集測試數據集的挑戰，以評估流程產業中低資源特定領域德語的語義搜索。我們的做法提出了一個端到端的標註管道，用於自動查詢生成，以重新評分查詢文件對。為了克服在德語化學領域中訓練的文本編碼器的不足，我們探討了一個由在常識數據集上訓練的「弱」文本編碼器組成的集合原理。我們結合了來自不同模型的個別相關性分數，以擷取文件候選項和 LLM 生成的相關性分數，旨在達成查詢文件比對的共識。評估結果表明，集合方法顯著改善了與人工指定的相關性分數的比對，在編碼器間的一致性和準確性指標方面都優於個別模型。這些發現表明，集合學習可以有效地調整語義搜索系統以適應專業的低資源語言，為特定領域背景中的資源限制提供實用的解決方案。</paragraph>", "author": "Anastasia Zhukova et.al.", "authors": "Anastasia Zhukova, Christian E. Matt, Bela Gipp", "id": "2412.10008v1", "paper_url": "http://arxiv.org/abs/2412.10008v1", "repo": "null"}}