{"2407.06658": {"publish_time": "2024-07-09", "title": "TriQXNet: Forecasting Dst Index from Solar Wind Data Using an Interpretable Parallel Classical-Quantum Framework with Uncertainty Quantification", "paper_summary": "Geomagnetic storms, caused by solar wind energy transfer to Earth's magnetic\nfield, can disrupt critical infrastructure like GPS, satellite communications,\nand power grids. The disturbance storm-time (Dst) index measures storm\nintensity. Despite advancements in empirical, physics-based, and\nmachine-learning models using real-time solar wind data, accurately forecasting\nextreme geomagnetic events remains challenging due to noise and sensor\nfailures. This research introduces TriQXNet, a novel hybrid classical-quantum\nneural network for Dst forecasting. Our model integrates classical and quantum\ncomputing, conformal prediction, and explainable AI (XAI) within a hybrid\narchitecture. To ensure high-quality input data, we developed a comprehensive\npreprocessing pipeline that included feature selection, normalization,\naggregation, and imputation. TriQXNet processes preprocessed solar wind data\nfrom NASA's ACE and NOAA's DSCOVR satellites, predicting the Dst index for the\ncurrent hour and the next, providing vital advance notice to mitigate\ngeomagnetic storm impacts. TriQXNet outperforms 13 state-of-the-art hybrid\ndeep-learning models, achieving a root mean squared error of 9.27 nanoteslas\n(nT). Rigorous evaluation through 10-fold cross-validated paired t-tests\nconfirmed its superior performance with 95% confidence. Conformal prediction\ntechniques provide quantifiable uncertainty, which is essential for operational\ndecisions, while XAI methods like ShapTime enhance interpretability.\nComparative analysis shows TriQXNet's superior forecasting accuracy, setting a\nnew level of expectations for geomagnetic storm prediction and highlighting the\npotential of classical-quantum hybrid models in space weather forecasting.", "paper_summary_zh": "地磁風暴是由太陽風能量傳遞至地球磁場所造成，可能會中斷 GPS、衛星通訊和電網等關鍵基礎設施。擾動風暴時間 (Dst) 指數用於測量風暴強度。儘管已經在使用即時太陽風資料的經驗、基於物理的和機器學習模型方面取得進展，但由於雜訊和感測器故障，精確預測極端地磁事件仍然具有挑戰性。本研究引入了 TriQXNet，這是一種用於 Dst 預測的新型混合古典量子神經網路。我們的模型在混合架構中整合了古典和量子運算、共形預測和可解釋 AI (XAI)。為了確保高品質的輸入資料，我們開發了一個全面的預處理管道，其中包括特徵選擇、正規化、聚合和估計。TriQXNet 處理來自 NASA 的 ACE 和 NOAA 的 DSCOVR 衛星的預處理太陽風資料，預測當前小時和下一個小時的 Dst 指數，提供重要的預先通知以減輕地磁風暴影響。TriQXNet 優於 13 種最先進的混合深度學習模型，均方根誤差達到 9.27 納特斯拉 (nT)。透過 10 倍交叉驗證配對 t 檢定進行的嚴格評估，以 95% 的信心確認其優異的效能。共形預測技術提供可量化的不確定性，這對於運作決策至關重要，而像 ShapTime 這樣的 XAI 方法則增強了可解釋性。比較分析顯示 TriQXNet 優異的預測準確度，為地磁風暴預測設定了新的期望水準，並突顯了古典量子混合模型在太空天氣預測中的潛力。", "author": "Md Abrar Jahin et.al.", "authors": "Md Abrar Jahin, M. F. Mridha, Zeyar Aung, Nilanjan Dey, R. Simon Sherratt", "id": "2407.06658v1", "paper_url": "http://arxiv.org/abs/2407.06658v1", "repo": "null"}}