{"2411.02063": {"publish_time": "2024-11-04", "title": "Scalable Efficient Training of Large Language Models with Low-dimensional Projected Attention", "paper_summary": "Improving the effectiveness and efficiency of large language models (LLMs)\nsimultaneously is a critical yet challenging research goal. In this paper, we\nfind that low-rank pre-training, normally considered as efficient methods that\nwill compromise performance, can be scalably effective when reduced parameters\nare precisely targeted. Specifically, applying the low-dimensional module only\nto the attention layer -- resolves this issue and enhances both effectiveness\nand efficiency. We refer to this structure as Low-dimensional Projected\nAttention (LPA) and provide an explanatory analysis. Through extensive\nexperimentation at parameter scales of 130M, 370M, and scaling up to 3B, we\nhave validated the effectiveness and scalability of LPA. Our results show that\nLPA model can save up to 12.4% in time while achieving an approximate 5%\nimprovement in test perplexity (ppl) and on downstream tasks compared with the\nvanilla Transformer.", "paper_summary_zh": "同時提升大型語言模型 (LLM) 的效能和效率，是一項重要卻艱鉅的研究目標。在本文中，我們發現低秩預訓練，通常被視為會影響效能的有效率方法，當精確鎖定參數時，可以有效地擴充。具體來說，僅將低維度模組應用於注意力層，可以解決此問題，並提升效能和效率。我們將此結構稱為低維度投影注意力 (LPA)，並提供說明性分析。透過在 130M、370M 的參數規模進行廣泛的實驗，並擴充到 3B，我們驗證了 LPA 的效能和可擴充性。我們的結果顯示，與原始 Transformer 相比，LPA 模型可以節省多達 12.4% 的時間，同時在測試困惑度 (ppl) 和下游任務中獲得約 5% 的提升。", "author": "Xingtai Lv et.al.", "authors": "Xingtai Lv, Ning Ding, Kaiyan Zhang, Ermo Hua, Ganqu Cui, Bowen Zhou", "id": "2411.02063v1", "paper_url": "http://arxiv.org/abs/2411.02063v1", "repo": "null"}}