{"2406.12035": {"publish_time": "2024-06-17", "title": "Socially Interactive Agents for Robotic Neurorehabilitation Training: Conceptualization and Proof-of-concept Study", "paper_summary": "Individuals with diverse motor abilities often benefit from intensive and\nspecialized rehabilitation therapies aimed at enhancing their functional\nrecovery. Nevertheless, the challenge lies in the restricted availability of\nneurorehabilitation professionals, hindering the effective delivery of the\nnecessary level of care. Robotic devices hold great potential in reducing the\ndependence on medical personnel during therapy but, at the same time, they\ngenerally lack the crucial human interaction and motivation that traditional\nin-person sessions provide. To bridge this gap, we introduce an AI-based system\naimed at delivering personalized, out-of-hospital assistance during\nneurorehabilitation training. This system includes a rehabilitation training\ndevice, affective signal classification models, training exercises, and a\nsocially interactive agent as the user interface. With the assistance of a\nprofessional, the envisioned system is designed to be tailored to accommodate\nthe unique rehabilitation requirements of an individual patient. Conceptually,\nafter a preliminary setup and instruction phase, the patient is equipped to\ncontinue their rehabilitation regimen autonomously in the comfort of their\nhome, facilitated by a socially interactive agent functioning as a virtual\ncoaching assistant. Our approach involves the integration of an interactive\nsocially-aware virtual agent into a neurorehabilitation robotic framework, with\nthe primary objective of recreating the social aspects inherent to in-person\nrehabilitation sessions. We also conducted a feasibility study to test the\nframework with healthy patients. The results of our preliminary investigation\nindicate that participants demonstrated a propensity to adapt to the system.\nNotably, the presence of the interactive agent during the proposed exercises\ndid not act as a source of distraction; instead, it positively impacted users'\nengagement.", "paper_summary_zh": "肢體能力不同的個人往往受益於密集且專業的復健療法，目的是增進其功能性復原。儘管如此，挑戰在於神經復健專業人員數量有限，阻礙了必要照護等級的有效提供。機器人裝置在降低治療期間對醫療人員的依賴方面具有極大的潛力，但同時，它們通常缺乏傳統面對面療程提供的關鍵人際互動和動機。為了彌補這個差距，我們引進了一個基於人工智慧的系統，旨在於神經復健訓練期間提供個人化、院外的協助。此系統包含復健訓練裝置、情感訊號分類模型、訓練練習和一個作為使用者介面的社會互動代理人。在專業人員的協助下，預想中的系統旨在量身打造，以適應個別病患獨特的神經復健需求。在概念上，在初步設定和說明階段後，病患具備在舒適的家中自主持續其復健計畫的條件，並由一個作為虛擬教練助理的社會互動代理人提供協助。我們的做法涉及將一個互動且具社會意識的虛擬代理人整合到神經復健機器人架構中，其主要目的是重建面對面復健療程中固有的社會面向。我們也進行了一項可行性研究，以健康病患測試此架構。我們初步調查的結果顯示，參與者表現出適應此系統的傾向。值得注意的是，在所建議的練習期間，互動代理人的存在並未成為分心的來源；相反地，它對使用者的參與產生了正面的影響。", "author": "Rhythm Arora et.al.", "authors": "Rhythm Arora, Pooja Prajod, Matteo Lavit Nicora, Daniele Panzeri, Giovanni Tauro, Rocco Vertechy, Matteo Malosio, Elisabeth André, Patrick Gebhard", "id": "2406.12035v1", "paper_url": "http://arxiv.org/abs/2406.12035v1", "repo": "null"}}