{"2407.08182": {"publish_time": "2024-07-11", "title": "Beyond Text: Leveraging Multi-Task Learning and Cognitive Appraisal Theory for Post-Purchase Intention Analysis", "paper_summary": "Supervised machine-learning models for predicting user behavior offer a\nchallenging classification problem with lower average prediction performance\nscores than other text classification tasks. This study evaluates multi-task\nlearning frameworks grounded in Cognitive Appraisal Theory to predict user\nbehavior as a function of users' self-expression and psychological attributes.\nOur experiments show that users' language and traits improve predictions above\nand beyond models predicting only from text. Our findings highlight the\nimportance of integrating psychological constructs into NLP to enhance the\nunderstanding and prediction of user actions. We close with a discussion of the\nimplications for future applications of large language models for computational\npsychology.", "paper_summary_zh": "監督機器學習模型用於預測使用者行為，提供具有較低平均預測效能評分的挑戰性分類問題，低於其他文字分類任務。本研究評估以認知評估理論為基礎的多任務學習架構，以預測使用者行為為使用者自我表達和心理屬性的函數。我們的實驗顯示，使用者的語言和特質可改善預測，且優於僅從文字預測的模型。我們的研究結果強調將心理建構整合到自然語言處理中的重要性，以增進對使用者行為的理解和預測。我們以討論大型語言模型在計算心理學中未來應用程式之含意做為結尾。", "author": "Gerard Christopher Yeo et.al.", "authors": "Gerard Christopher Yeo, Shaz Furniturewala, Kokil Jaidka", "id": "2407.08182v1", "paper_url": "http://arxiv.org/abs/2407.08182v1", "repo": "null"}}