{"2409.04057": {"publish_time": "2024-09-06", "title": "Self-Harmonized Chain of Thought", "paper_summary": "Chain-of-Thought (CoT) prompting reveals that large language models are\ncapable of performing complex reasoning via intermediate steps. CoT prompting\nis primarily categorized into three approaches. The first approach utilizes\nstraightforward prompts like ``Let's think step by step'' to generate a\nsequential thought process before yielding an answer. The second approach makes\nuse of human-crafted, step-by-step demonstrations to guide the model's\nreasoning process. The third automates the generation of reasoned\ndemonstrations with the 'Let's think step by step'.This approach sometimes\nleads to reasoning errors, highlighting the need to diversify demonstrations to\nmitigate its misleading effects. However, diverse demonstrations pose\nchallenges for effective representations. In this work, we propose ECHO, a\nself-harmonized chain-of-thought prompting method. It consolidates diverse\nsolution paths into a uniform and effective solution pattern.ECHO demonstrates\nthe best overall performance across three reasoning domains.", "paper_summary_zh": "鏈式思考（CoT）提示揭示了大型語言模型能夠通過中間步驟執行複雜的推理。CoT 提示主要分為三種方法。第一種方法利用直接的提示，例如 ``讓我們一步一步思考''，在得出答案之前生成一個順序的思考過程。第二種方法利用人工製作的、逐步的演示來指導模型的推理過程。第三種方法通過 ``讓我們一步一步思考'' 自動生成合理的演示。這種方法有時會導致推理錯誤，強調了多樣化演示以減輕其誤導效應的必要性。然而，多樣化的演示對有效表示提出了挑戰。在這項工作中，我們提出了 ECHO，一種自我和諧的鏈式思考提示方法。它將不同的解決方案路徑整合到一個統一且有效的解決方案模式中。ECHO 在三個推理領域中展示了最佳的整體性能。", "author": "Ziqi Jin et.al.", "authors": "Ziqi Jin, Wei Lu", "id": "2409.04057v1", "paper_url": "http://arxiv.org/abs/2409.04057v1", "repo": "null"}}