{"2408.14772": {"publish_time": "2024-08-27", "title": "A global AI community requires language-diverse publishing", "paper_summary": "In this provocation, we discuss the English dominance of the AI research\ncommunity, arguing that the requirement for English language publishing upholds\nand reinforces broader regimes of extraction in AI. While large language models\nand machine translation have been celebrated as a way to break down barriers,\nwe regard their use as a symptom of linguistic exclusion of scientists and\npotential readers. We propose alternative futures for a healthier publishing\nculture, organized around three themes: administering conferences in the\nlanguages of the country in which they are held, instructing peer reviewers not\nto adjudicate the language appropriateness of papers, and offering\nopportunities to publish and present in multiple languages. We welcome new\ntranslations of this piece. Please contact the authors if you would like to\ncontribute one.", "paper_summary_zh": "在這項挑釁中，我們討論了人工智慧研究社群中英語的支配地位，並主張英語語言出版的要求維護並強化了人工智慧中更廣泛的提取制度。雖然大型語言模型和機器翻譯被譽為打破藩籬的方法，但我們認為它們的使用是科學家和潛在讀者語言排斥的症狀。我們提出了一個更健康的出版文化的替代未來，圍繞三個主題組織：以舉辦會議的國家的語言管理會議、指示同行評審員不要裁決論文的語言適當性，並提供以多種語言發表和展示的機會。我們歡迎這篇文章的新翻譯。如果您有興趣貢獻一份，請聯繫作者。", "author": "Haley Lepp et.al.", "authors": "Haley Lepp, Parth Sarin", "id": "2408.14772v1", "paper_url": "http://arxiv.org/abs/2408.14772v1", "repo": "null"}}