{"2411.17522": {"publish_time": "2024-11-26", "title": "On Statistical Rates of Conditional Diffusion Transformers: Approximation, Estimation and Minimax Optimality", "paper_summary": "We investigate the approximation and estimation rates of conditional\ndiffusion transformers (DiTs) with classifier-free guidance. We present a\ncomprehensive analysis for ``in-context'' conditional DiTs under four common\ndata assumptions. We show that both conditional DiTs and their latent variants\nlead to the minimax optimality of unconditional DiTs under identified settings.\nSpecifically, we discretize the input domains into infinitesimal grids and then\nperform a term-by-term Taylor expansion on the conditional diffusion score\nfunction under H\\\"older smooth data assumption. This enables fine-grained use\nof transformers' universal approximation through a more detailed piecewise\nconstant approximation and hence obtains tighter bounds. Additionally, we\nextend our analysis to the latent setting under the linear latent subspace\nassumption. We not only show that latent conditional DiTs achieve lower bounds\nthan conditional DiTs both in approximation and estimation, but also show the\nminimax optimality of latent unconditional DiTs. Our findings establish\nstatistical limits for conditional and unconditional DiTs, and offer practical\nguidance toward developing more efficient and accurate DiT models.", "paper_summary_zh": "我們研究了使用無分類器指導的條件擴散Transformer (DiT) 的逼近和估計率。我們對「情境內」條件 DiT 在四個常見資料假設下進行了全面分析。我們表明，在已識別的設定下，條件 DiT 及其潛在變體都會導致無條件 DiT 的極小極大最優性。具體來說，我們將輸入域離散化為無限小的網格，然後在 Hölder 平滑資料假設下對條件擴散分數函數執行逐項泰勒展開。這能夠通過更詳細的分段常數逼近來精細地使用Transformer的通用逼近，從而獲得更嚴格的界限。此外，我們將我們的分析擴展到線性潛在子空間假設下的潛在設定。我們不僅表明潛在條件 DiT 在逼近和估計中都比條件 DiT 達到較低的界限，而且還表明潛在無條件 DiT 的極小極大最優性。我們的發現為條件和無條件 DiT 建立了統計限制，並為開發更有效率和準確的 DiT 模型提供了實用的指導。", "author": "Jerry Yao-Chieh Hu et.al.", "authors": "Jerry Yao-Chieh Hu, Weimin Wu, Yi-Chen Lee, Yu-Chao Huang, Minshuo Chen, Han Liu", "id": "2411.17522v1", "paper_url": "http://arxiv.org/abs/2411.17522v1", "repo": "null"}}