{"2406.03248": {"publish_time": "2024-06-05", "title": "Large Language Models as Evaluators for Recommendation Explanations", "paper_summary": "The explainability of recommender systems has attracted significant attention\nin academia and industry. Many efforts have been made for explainable\nrecommendations, yet evaluating the quality of the explanations remains a\nchallenging and unresolved issue. In recent years, leveraging LLMs as\nevaluators presents a promising avenue in Natural Language Processing tasks\n(e.g., sentiment classification, information extraction), as they perform\nstrong capabilities in instruction following and common-sense reasoning.\nHowever, evaluating recommendation explanatory texts is different from these\nNLG tasks, as its criteria are related to human perceptions and are usually\nsubjective. In this paper, we investigate whether LLMs can serve as evaluators\nof recommendation explanations. To answer the question, we utilize real user\nfeedback on explanations given from previous work and additionally collect\nthird-party annotations and LLM evaluations. We design and apply a 3-level meta\nevaluation strategy to measure the correlation between evaluator labels and the\nground truth provided by users. Our experiments reveal that LLMs, such as GPT4,\ncan provide comparable evaluations with appropriate prompts and settings. We\nalso provide further insights into combining human labels with the LLM\nevaluation process and utilizing ensembles of multiple heterogeneous LLM\nevaluators to enhance the accuracy and stability of evaluations. Our study\nverifies that utilizing LLMs as evaluators can be an accurate, reproducible and\ncost-effective solution for evaluating recommendation explanation texts. Our\ncode is available at https://github.com/Xiaoyu-SZ/LLMasEvaluator.", "paper_summary_zh": "推薦系統的可解釋性已在學術界和產業中引起廣泛關注。許多努力都致力於可解釋的推薦，然而評估解釋品質仍然是一個具有挑戰性和尚未解決的問題。近年來，利用 LLM 作為評估者在自然語言處理任務（例如情緒分類、資訊萃取）中提供了一條有前途的途徑，因為它們在遵循指令和常識推理方面表現出強大的能力。然而，評估推薦說明文字與這些 NLG 任務不同，因為它的標準與人類的感知有關，而且通常是主觀的。在本文中，我們探討 LLM 是否可以作為推薦說明的評估者。為了回答這個問題，我們利用真實使用者對先前工作提供的說明的回饋，並另外收集第三方註解和 LLM 評估。我們設計並應用了一個 3 級元評估策略來衡量評估者標籤與使用者提供的真實資料之間的關聯性。我們的實驗表明，LLM（例如 GPT4）可以提供具有適當提示和設定的比較評估。我們還進一步深入探討將人類標籤與 LLM 評估過程相結合，並利用多個異質 LLM 評估者的集合來提高評估的準確性和穩定性。我們的研究驗證了利用 LLM 作為評估者可以成為評估推薦說明文字的準確、可複製且具有成本效益的解決方案。我們的程式碼可在 https://github.com/Xiaoyu-SZ/LLMasEvaluator 取得。", "author": "Xiaoyu Zhang et.al.", "authors": "Xiaoyu Zhang, Yishan Li, Jiayin Wang, Bowen Sun, Weizhi Ma, Peijie Sun, Min Zhang", "id": "2406.03248v1", "paper_url": "http://arxiv.org/abs/2406.03248v1", "repo": "https://github.com/xiaoyu-sz/llmasevaluator"}}