{"2502.15189": {"publish_time": "2025-02-21", "title": "Scale-Free Graph-Language Models", "paper_summary": "Graph-language models (GLMs) have demonstrated great potential in graph-based\nsemi-supervised learning. A typical GLM consists of two key stages: graph\ngeneration and text embedding, which are usually implemented by inferring a\nlatent graph and finetuning a language model (LM), respectively. However, the\nformer often relies on artificial assumptions about the underlying edge\ndistribution, while the latter requires extensive data annotations. To tackle\nthese challenges, this paper introduces a novel GLM that integrates graph\ngeneration and text embedding within a unified framework. Specifically, for\ngraph generation, we leverage an inherent characteristic of real edge\ndistribution--the scale-free property--as a structural prior. We unexpectedly\nfind that this natural property can be effectively approximated by a simple\nk-nearest neighbor (KNN) graph. For text embedding, we develop a graph-based\npseudo-labeler that utilizes scale-free graphs to provide complementary\nsupervision for improved LM finetuning. Extensive experiments on representative\ndatasets validate our findings on the scale-free structural approximation of\nKNN graphs and demonstrate the effectiveness of integrating graph generation\nand text embedding with a real structural prior. Our code is available at\nhttps://github.com/Jianglin954/SFGL.", "paper_summary_zh": "圖語言模型 (GLM) 已在基於圖形的半監督學習中展現出極大的潛力。典型的 GLM 包含兩個關鍵階段：圖形生成和文字嵌入，它們通常分別透過推斷潛在圖形和微調語言模型 (LM) 來實作。然而，前者通常依賴於對底層邊緣分佈的人工假設，而後者需要大量的資料標註。為了應對這些挑戰，本文介紹了一種新的 GLM，它將圖形生成和文字嵌入整合在一個統一的架構中。具體來說，對於圖形生成，我們利用真實邊緣分佈的內在特性——無尺度屬性——作為結構先驗。我們意外地發現，這個自然屬性可以用一個簡單的 k-最近鄰 (KNN) 圖形來有效近似。對於文字嵌入，我們開發了一個基於圖形的偽標籤器，它利用無尺度圖形來提供互補監督，以改善 LM 微調。在代表性資料集上進行的大量實驗驗證了我們對 KNN 圖形的無尺度結構近似的發現，並證明了將圖形生成和文字嵌入與真實結構先驗整合的有效性。我們的程式碼可在 https://github.com/Jianglin954/SFGL 獲得。", "author": "Jianglin Lu et.al.", "authors": "Jianglin Lu, Yixuan Liu, Yitian Zhang, Yun Fu", "id": "2502.15189v1", "paper_url": "http://arxiv.org/abs/2502.15189v1", "repo": "null"}}