{"2410.19461": {"publish_time": "2024-10-25", "title": "EDGE: Enhanced Grounded GUI Understanding with Enriched Multi-Granularity Synthetic Data", "paper_summary": "Autonomous agents operating on the graphical user interfaces (GUIs) of\nvarious applications hold immense practical value. Unlike the large language\nmodel (LLM)-based methods which rely on structured texts and customized\nbackends, the approaches using large vision-language models (LVLMs) are more\nintuitive and adaptable as they can visually perceive and directly interact\nwith screens, making them indispensable in general scenarios without text\nmetadata and tailored backends. Given the lack of high-quality training data\nfor GUI-related tasks in existing work, this paper aims to enhance the GUI\nunderstanding and interacting capabilities of LVLMs through a data-driven\napproach. We propose EDGE, a general data synthesis framework that\nautomatically generates large-scale, multi-granularity training data from\nwebpages across the Web. Evaluation results on various GUI and agent benchmarks\ndemonstrate that the model trained with the dataset generated through EDGE\nexhibits superior webpage understanding capabilities, which can then be easily\ntransferred to previously unseen desktop and mobile environments. Our approach\nsignificantly reduces the dependence on manual annotations, empowering\nresearchers to harness the vast public resources available on the Web to\nadvance their work. Our source code, the dataset and the model are available at\nhttps://anonymous.4open.science/r/EDGE-1CDB.", "paper_summary_zh": "<paragraph>在各種應用程式的圖形使用者介面 (GUI) 上運作的自主代理，具有極大的實用價值。與依賴結構化文字和自訂後端的基於大型語言模型 (LLM) 的方法不同，使用大型視覺語言模型 (LVLMs) 的方法更直觀且具有適應性，因為它們可以視覺感知並直接與螢幕互動，這使得它們在沒有文字元資料和自訂後端的通用場景中不可或缺。鑑於現有工作中缺乏用於 GUI 相關任務的高品質訓練資料，本文旨在透過資料驅動的方法增強 LVLMs 的 GUI 理解和互動能力。我們提出 EDGE，這是一個通用的資料合成架構，可以自動從網際網路上的網頁產生大規模、多粒度的訓練資料。在各種 GUI 和代理基準上的評估結果表明，使用透過 EDGE 產生的資料集訓練的模型展現出優異的網頁理解能力，然後可以輕鬆地轉移到以前未見的桌面和行動環境。我們的做法大幅減少了對手動註解的依賴，讓研究人員能夠利用網際網路上大量的公開資源來推進他們的進度。我們的原始碼、資料集和模型可在 https://anonymous.4open.science/r/EDGE-1CDB 取得。</paragraph>", "author": "Xuetian Chen et.al.", "authors": "Xuetian Chen, Hangcheng Li, Jiaqing Liang, Sihang Jiang, Deqing Yang", "id": "2410.19461v1", "paper_url": "http://arxiv.org/abs/2410.19461v1", "repo": "null"}}