{"2408.08242": {"publish_time": "2024-08-15", "title": "A Conflicts-free, Speed-lossless KAN-based Reinforcement Learning Decision System for Interactive Driving in Roundabouts", "paper_summary": "Safety and efficiency are crucial for autonomous driving in roundabouts,\nespecially in the context of mixed traffic where autonomous vehicles (AVs) and\nhuman-driven vehicles coexist. This paper introduces a learning-based algorithm\ntailored to foster safe and efficient driving behaviors across varying levels\nof traffic flows in roundabouts. The proposed algorithm employs a deep\nQ-learning network to effectively learn safe and efficient driving strategies\nin complex multi-vehicle roundabouts. Additionally, a KAN (Kolmogorov-Arnold\nnetwork) enhances the AVs' ability to learn their surroundings robustly and\nprecisely. An action inspector is integrated to replace dangerous actions to\navoid collisions when the AV interacts with the environment, and a route\nplanner is proposed to enhance the driving efficiency and safety of the AVs.\nMoreover, a model predictive control is adopted to ensure stability and\nprecision of the driving actions. The results show that our proposed system\nconsistently achieves safe and efficient driving whilst maintaining a stable\ntraining process, as evidenced by the smooth convergence of the reward function\nand the low variance in the training curves across various traffic flows.\nCompared to state-of-the-art benchmarks, the proposed algorithm achieves a\nlower number of collisions and reduced travel time to destination.", "paper_summary_zh": "在環島中，安全性和效率對於自動駕駛至關重要，特別是在自動駕駛汽車 (AV) 和人類駕駛汽車並存的混合交通環境中。本文介紹了一種基於學習的演算法，專門用於促進在環島中不同交通流量等級的安全且有效的駕駛行為。所提出的演算法採用深度 Q 學習網路，可在複雜的多車輛環島中有效學習安全且有效的駕駛策略。此外，KAN（柯爾莫哥洛夫-阿諾德網路）增強了自動駕駛汽車在環境中穩健且精確學習的能力。整合了動作檢查器，可在自動駕駛汽車與環境互動時取代危險動作，避免碰撞，並提出了路線規劃器，以增強自動駕駛汽車的駕駛效率和安全性。此外，採用了模型預測控制，以確保駕駛動作的穩定性和精確性。結果表明，我們提出的系統始終能實現安全且有效的駕駛，同時保持穩定的訓練過程，這從回報函數的平穩收斂和訓練曲線在各種交通流量中的低變異中可以得到證明。與最先進的基準相比，所提出的演算法可減少碰撞次數並縮短到達目的地的行程時間。", "author": "Zhihao Lin et.al.", "authors": "Zhihao Lin, Zhen Tian, Qi Zhang, Ziyang Ye, Hanyang Zhuang, Jianglin Lan", "id": "2408.08242v1", "paper_url": "http://arxiv.org/abs/2408.08242v1", "repo": "null"}}