{"2411.14739": {"publish_time": "2024-11-22", "title": "IRLab@iKAT24: Learned Sparse Retrieval with Multi-aspect LLM Query Generation for Conversational Search", "paper_summary": "The Interactive Knowledge Assistant Track (iKAT) 2024 focuses on advancing\nconversational assistants, able to adapt their interaction and responses from\npersonalized user knowledge. The track incorporates a Personal Textual\nKnowledge Base (PTKB) alongside Conversational AI tasks, such as passage\nranking and response generation. Query Rewrite being an effective approach for\nresolving conversational context, we explore Large Language Models (LLMs), as\nquery rewriters. Specifically, our submitted runs explore multi-aspect query\ngeneration using the MQ4CS framework, which we further enhance with Learned\nSparse Retrieval via the SPLADE architecture, coupled with robust cross-encoder\nmodels. We also propose an alternative to the previous interleaving strategy,\naggregating multiple aspects during the reranking phase. Our findings indicate\nthat multi-aspect query generation is effective in enhancing performance when\nintegrated with advanced retrieval and reranking models. Our results also lead\nthe way for better personalization in Conversational Search, relying on LLMs to\nintegrate personalization within query rewrite, and outperforming human rewrite\nperformance.", "paper_summary_zh": "2024 年互動知識助理軌道 (iKAT) 專注於推進對話助理，能夠根據個人化使用者知識調整互動和回應。該軌道結合了個人文本知識庫 (PTKB) 和對話式 AI 任務，例如段落排名和回應產生。查詢改寫是一種解決對話內容的有效方法，我們探索大型語言模型 (LLM) 作為查詢改寫器。具體來說，我們提交的執行探索使用 MQ4CS 框架的多方面查詢產生，我們進一步透過 SPLADE 架構的學習稀疏檢索來增強它，並結合穩健的交叉編碼模型。我們還提出了一個替代先前的交錯策略，在重新排名階段彙總多個方面。我們的發現表明，多方面查詢產生在與先進的檢索和重新排名模型整合時，能夠有效提升效能。我們的結果也為對話式搜尋中更好的個人化鋪路，依賴 LLM 在查詢改寫中整合個人化，並且優於人類改寫效能。", "author": "Simon Lupart et.al.", "authors": "Simon Lupart, Zahra Abbasiantaeb, Mohammad Aliannejadi", "id": "2411.14739v1", "paper_url": "http://arxiv.org/abs/2411.14739v1", "repo": "null"}}