{"2408.14776": {"publish_time": "2024-08-27", "title": "MROVSeg: Breaking the Resolution Curse of Vision-Language Models in Open-Vocabulary Semantic Segmentation", "paper_summary": "Open-vocabulary semantic segmentation aims to segment and recognize\nsemantically meaningful regions based on text-based descriptions during\ninference. A typical solution to address this task is to leverage powerful\nvision-language models (VLMs), such as CLIP, to bridge the gap between open-\nand close-vocabulary recognition. As VLMs are usually pretrained with\nlow-resolution images (e.g. $224\\times224$), most previous methods operate only\non downscaled images. We question this design as low resolution features often\nfail to preserve fine details. Although employing additional image backbones\nfor high-resolution inputs can mitigate this issue, it may also introduce\nsignificant computation overhead. Therefore, we propose MROVSeg, a\nmulti-resolution training framework for open-vocabulary semantic segmentation\nwith a single pretrained CLIP backbone, that uses sliding windows to slice the\nhigh-resolution input into uniform patches, each matching the input size of the\nwell-trained image encoder. Its key components include a Multi-Res Adapter,\nwhich restores the spatial geometry and grasps local-global correspondences\nacross patches by learnable convolutional and scale attention layers. To\nachieve accurate segmentation, we introduce Multi-grained Masked Attention\nscheme to aggregate multi-grained semantics by performing cross-attention\nbetween object queries and multi-resolution CLIP features within the region of\ninterests. Through comprehensive experiments, we demonstrate the superiority of\nMROVSeg on well-established open-vocabulary semantic segmentation benchmarks,\nparticularly for high-resolution inputs, establishing new standards for\nopen-vocabulary semantic segmentation.", "paper_summary_zh": "開放詞彙語意分割旨在根據推理期間的文字描述，分割和辨識語意有意義的區域。解決此任務的典型方法是利用強大的視覺語言模型 (VLM)，例如 CLIP，來彌合開放和封閉詞彙辨識之間的差距。由於 VLM 通常使用低解析度影像 (例如 $224\\times224$) 進行預訓練，因此大多數先前的方法僅在縮小的影像上執行。我們質疑此設計，因為低解析度特徵通常無法保留精細的細節。儘管採用額外的影像主幹進行高解析度輸入可以減輕此問題，但它也可能會引入大量的運算負擔。因此，我們提出 MROVSeg，這是一個單一預訓練 CLIP 主幹的開放詞彙語意分割多解析度訓練架構，它使用滑動視窗將高解析度輸入切成均勻的區塊，每個區塊都與訓練良好的影像編碼器的輸入大小相符。它的關鍵組成部分包括多解析度適配器，它透過可學習的卷積和縮放注意層，恢復空間幾何形狀並掌握區塊間的局部和全局對應關係。為了達成精確的分割，我們引入了多粒度遮罩注意機制，透過在興趣區域內執行物件查詢和多解析度 CLIP 特徵之間的交叉注意，來彙總多粒度語意。透過全面的實驗，我們證明了 MROVSeg 在建立良好的開放詞彙語意分割基準上的優越性，特別是對於高解析度輸入，為開放詞彙語意分割建立了新的標準。", "author": "Yuanbing Zhu et.al.", "authors": "Yuanbing Zhu, Bingke Zhu, Zhen Chen, Huan Xu, Ming Tang, Jinqiao Wang", "id": "2408.14776v1", "paper_url": "http://arxiv.org/abs/2408.14776v1", "repo": "null"}}