{"2405.17898": {"publish_time": "2024-05-28", "title": "FlashST: A Simple and Universal Prompt-Tuning Framework for Traffic Prediction", "paper_summary": "The objective of traffic prediction is to accurately forecast and analyze the\ndynamics of transportation patterns, considering both space and time. However,\nthe presence of distribution shift poses a significant challenge in this field,\nas existing models struggle to generalize well when faced with test data that\nsignificantly differs from the training distribution. To tackle this issue,\nthis paper introduces a simple and universal spatio-temporal prompt-tuning\nframework-FlashST, which adapts pre-trained models to the specific\ncharacteristics of diverse downstream datasets, improving generalization in\ndiverse traffic prediction scenarios. Specifically, the FlashST framework\nemploys a lightweight spatio-temporal prompt network for in-context learning,\ncapturing spatio-temporal invariant knowledge and facilitating effective\nadaptation to diverse scenarios. Additionally, we incorporate a distribution\nmapping mechanism to align the data distributions of pre-training and\ndownstream data, facilitating effective knowledge transfer in spatio-temporal\nforecasting. Empirical evaluations demonstrate the effectiveness of our FlashST\nacross different spatio-temporal prediction tasks using diverse urban datasets.\nCode is available at https://github.com/HKUDS/FlashST.", "paper_summary_zh": "交通预测的目标是准确预测和分析交通模式的动态，同时考虑空间和时间。然而，分布变化的存在对该领域提出了重大挑战，因为现有模型在面对与训练分布显着不同的测试数据时难以很好地泛化。为了解决这个问题，本文介绍了一个简单且通用的时空提示调整框架 FlashST，该框架将预训练模型调整为不同下游数据集的特定特征，从而提高了在不同交通预测场景中的泛化能力。具体来说，FlashST 框架采用轻量级的时空提示网络进行上下文学习，捕获时空不变知识并促进对不同场景的有效适应。此外，我们结合了一种分布映射机制来对齐预训练和下游数据的分布，从而促进时空预测中的有效知识转移。实证评估表明，我们的 FlashST 在使用不同城市数据集的不同时空预测任务中都表现出有效性。代码可在 https://github.com/HKUDS/FlashST 获得。", "author": "Zhonghang Li et.al.", "authors": "Zhonghang Li, Lianghao Xia, Yong Xu, Chao Huang", "id": "2405.17898v1", "paper_url": "http://arxiv.org/abs/2405.17898v1", "repo": "https://github.com/hkuds/flashst"}}