{"2408.03246": {"publish_time": "2024-08-06", "title": "Making Long-Context Language Models Better Multi-Hop Reasoners", "paper_summary": "Recent advancements in long-context modeling have enhanced language models\n(LMs) for complex tasks across multiple NLP applications. Despite this\nprogress, we find that these models struggle with multi-hop reasoning and\nexhibit decreased performance in the presence of noisy contexts. In this paper,\nwe introduce Reasoning with Attributions, a novel approach that prompts LMs to\nsupply attributions for each assertion during their reasoning. We validate our\napproach through experiments on three multi-hop datasets, employing both\nproprietary and open-source models, and demonstrate its efficacy and\nresilience. Furthermore, we explore methods to augment reasoning capabilities\nvia fine-tuning and offer an attribution-annotated dataset and a specialized\ntraining strategy. Our fine-tuned model achieves competitive performance on\nmulti-hop reasoning benchmarks, closely paralleling proprietary LMs such as\nChatGPT and Claude-instant.", "paper_summary_zh": "最近在長文本建模方面的進展增強了語言模型 (LM) 在多個 NLP 應用中處理複雜任務的能力。儘管有這些進展，我們發現這些模型在多跳推理方面遇到困難，並且在存在嘈雜環境時表現下降。在本文中，我們介紹了歸因推理，這是一種新穎的方法，它提示 LM 在推理過程中為每個斷言提供歸因。我們通過在三個多跳數據集上進行實驗驗證了我們的做法，同時採用專有模型和開源模型，並展示了其有效性和彈性。此外，我們探索了通過微調來擴充推理能力的方法，並提供了一個歸因註釋數據集和一個專門的訓練策略。我們微調後的模型在多跳推理基準上取得了有競爭力的表現，與專有 LM（例如 ChatGPT 和 Claude-instant）密切相關。", "author": "Yanyang Li et.al.", "authors": "Yanyang Li, Shuo Liang, Michael R. Lyu, Liwei Wang", "id": "2408.03246v1", "paper_url": "http://arxiv.org/abs/2408.03246v1", "repo": "null"}}