{"2502.14677": {"publish_time": "2025-02-20", "title": "Data-Constrained Synthesis of Training Data for De-Identification", "paper_summary": "Many sensitive domains -- such as the clinical domain -- lack widely\navailable datasets due to privacy risks. The increasing generative capabilities\nof large language models (LLMs) have made synthetic datasets a viable path\nforward. In this study, we domain-adapt LLMs to the clinical domain and\ngenerate synthetic clinical texts that are machine-annotated with tags for\npersonally identifiable information using capable encoder-based NER models. The\nsynthetic corpora are then used to train synthetic NER models. The results show\nthat training NER models using synthetic corpora incurs only a small drop in\npredictive performance. The limits of this process are investigated in a\nsystematic ablation study -- using both Swedish and Spanish data. Our analysis\nshows that smaller datasets can be sufficient for domain-adapting LLMs for data\nsynthesis. Instead, the effectiveness of this process is almost entirely\ncontingent on the performance of the machine-annotating NER models trained\nusing the original data.", "paper_summary_zh": "許多敏感領域（例如臨床領域）由於隱私風險而缺乏廣泛可用的資料集。大型語言模型 (LLM) 日益增強的生成能力使合成資料集成為可行的前進道路。在這項研究中，我們將 LLM 領域適應到臨床領域，並生成合成臨床文本，這些文本已使用功能強大的基於編碼器的 NER 模型機器標記了個人身份資訊標籤。然後使用合成語料庫訓練合成 NER 模型。結果表明，使用合成語料庫訓練 NER 模型只會導致預測效能略微下降。在系統消融研究中探討了此過程的限制，同時使用了瑞典語和西班牙語資料。我們的分析表明，較小的資料集足以用於領域適應 LLM 以進行資料合成。相反，此過程的有效性幾乎完全取決於使用原始資料訓練的機器標註 NER 模型的效能。", "author": "Thomas Vakili et.al.", "authors": "Thomas Vakili, Aron Henriksson, Hercules Dalianis", "id": "2502.14677v2", "paper_url": "http://arxiv.org/abs/2502.14677v2", "repo": "null"}}