{"2412.11763": {"publish_time": "2024-12-16", "title": "QUENCH: Measuring the gap between Indic and Non-Indic Contextual General Reasoning in LLMs", "paper_summary": "The rise of large language models (LLMs) has created a need for advanced\nbenchmarking systems beyond traditional setups. To this end, we introduce\nQUENCH, a novel text-based English Quizzing Benchmark manually curated and\ntranscribed from YouTube quiz videos. QUENCH possesses masked entities and\nrationales for the LLMs to predict via generation. At the intersection of\ngeographical context and common sense reasoning, QUENCH helps assess world\nknowledge and deduction capabilities of LLMs via a zero-shot, open-domain\nquizzing setup. We perform an extensive evaluation on 7 LLMs and 4 metrics,\ninvestigating the influence of model size, prompting style, geographical\ncontext, and gold-labeled rationale generation. The benchmarking concludes with\nan error analysis to which the LLMs are prone.", "paper_summary_zh": "大型語言模型（LLM）的興起，創造了對超越傳統設定的高級基準系統的需求。為此，我們引入了 QUENCH，一個新穎的基於文本的英文測驗基準，由 YouTube 測驗影片手動策劃和轉錄。QUENCH 擁有遮罩實體和理由，供 LLM 通過生成進行預測。在地理背景和常識推理的交匯處，QUENCH 有助於通過零次學習、開放領域測驗設置評估 LLM 的世界知識和推理能力。我們對 7 個 LLM 和 4 個指標進行了廣泛的評估，調查了模型大小、提示樣式、地理背景和黃金標籤理由生成的影響。基準測試以 LLM 容易出現的錯誤分析作為結尾。", "author": "Mohammad Aflah Khan et.al.", "authors": "Mohammad Aflah Khan, Neemesh Yadav, Sarah Masud, Md. Shad Akhtar", "id": "2412.11763v1", "paper_url": "http://arxiv.org/abs/2412.11763v1", "repo": "https://github.com/aflah02/quench"}}