{"2411.00843": {"publish_time": "2024-10-30", "title": "The Graph's Apprentice: Teaching an LLM Low Level Knowledge for Circuit Quality Estimation", "paper_summary": "Logic synthesis is a crucial phase in the circuit design process, responsible\nfor transforming hardware description language (HDL) designs into optimized\nnetlists. However, traditional logic synthesis methods are computationally\nintensive, restricting their iterative use in refining chip designs. Recent\nadvancements in large language models (LLMs), particularly those fine-tuned on\nprogramming languages, present a promising alternative. In this paper, we\nintroduce VeriDistill, the first end-to-end machine learning model that\ndirectly processes raw Verilog code to predict circuit quality-of-result\nmetrics. Our model employs a novel knowledge distillation method, transferring\nlow-level circuit insights via graphs into the predictor based on LLM.\nExperiments show VeriDistill outperforms state-of-the-art baselines on\nlarge-scale Verilog datasets and demonstrates robust performance when evaluated\non out-of-distribution datasets.", "paper_summary_zh": "邏輯合成是電路設計過程中至關重要的一個階段，負責將硬體描述語言 (HDL) 設計轉換為最佳化的網路表。然而，傳統的邏輯合成方法在運算上很密集，限制了它們在精煉晶片設計中的反覆使用。最近大型語言模型 (LLM) 的進展，特別是那些經過程式語言微調的，提供了一個有希望的替代方案。在本文中，我們介紹了 VeriDistill，第一個端到端的機器學習模型，它直接處理原始 Verilog 程式碼以預測電路品質結果指標。我們的模型採用了一種新穎的知識提煉方法，通過圖表將低階電路見解傳輸到基於 LLM 的預測器中。實驗表明，VeriDistill 在大規模 Verilog 資料集上優於最先進的基準，並且在在分佈外資料集上進行評估時表現出穩健的效能。", "author": "Reza Moravej et.al.", "authors": "Reza Moravej, Saurabh Bodhe, Zhanguang Zhang, Didier Chetelat, Dimitrios Tsaras, Yingxue Zhang, Hui-Ling Zhen, Jianye Hao, Mingxuan Yuan", "id": "2411.00843v1", "paper_url": "http://arxiv.org/abs/2411.00843v1", "repo": "null"}}