{"2410.11655": {"publish_time": "2024-10-15", "title": "Retrieval Augmented Spelling Correction for E-Commerce Applications", "paper_summary": "The rapid introduction of new brand names into everyday language poses a\nunique challenge for e-commerce spelling correction services, which must\ndistinguish genuine misspellings from novel brand names that use unconventional\nspelling. We seek to address this challenge via Retrieval Augmented Generation\n(RAG). On this approach, product names are retrieved from a catalog and\nincorporated into the context used by a large language model (LLM) that has\nbeen fine-tuned to do contextual spelling correction. Through quantitative\nevaluation and qualitative error analyses, we find improvements in spelling\ncorrection utilizing the RAG framework beyond a stand-alone LLM. We also\ndemonstrate the value of additional finetuning of the LLM to incorporate\nretrieved context.", "paper_summary_zh": "在日常語言中快速引入新品牌名稱對電子商務拼寫校正服務構成一項獨特挑戰，該服務必須區分真正的拼寫錯誤和使用非常規拼寫的新品牌名稱。我們尋求透過檢索增強生成 (RAG) 來解決此挑戰。在此方法中，產品名稱會從目錄中檢索，並併入大型語言模型 (LLM) 所使用的語境中，該模型已微調為執行語境拼寫校正。透過量化評估和質化錯誤分析，我們發現使用 RAG 架構進行拼寫校正的改進優於獨立的 LLM。我們還展示了針對 LLM 進行額外微調以納入檢索語境的價值。", "author": "Xuan Guo et.al.", "authors": "Xuan Guo, Rohit Patki, Dante Everaert, Christopher Potts", "id": "2410.11655v1", "paper_url": "http://arxiv.org/abs/2410.11655v1", "repo": "null"}}