{"2407.02118": {"publish_time": "2024-07-02", "title": "Breaking Language Barriers: Cross-Lingual Continual Pre-Training at Scale", "paper_summary": "In recent years, Large Language Models (LLMs) have made significant strides\ntowards Artificial General Intelligence. However, training these models from\nscratch requires substantial computational resources and vast amounts of text\ndata. In this paper, we explore an alternative approach to constructing an LLM\nfor a new language by continually pretraining (CPT) from existing pretrained\nLLMs, instead of using randomly initialized parameters. Based on parallel\nexperiments on 40 model sizes ranging from 40M to 5B parameters, we find that\n1) CPT converges faster and saves significant resources in a scalable manner;\n2) CPT adheres to an extended scaling law derived from Hoffmann et al. (2022)\nwith a joint data-parameter scaling term; 3) The compute-optimal data-parameter\nallocation for CPT markedly differs based on our estimated scaling factors; 4)\nThe effectiveness of transfer at scale is influenced by training duration and\nlinguistic properties, while robust to data replaying, a method that\neffectively mitigates catastrophic forgetting in CPT. We hope our findings\nprovide deeper insights into the transferability of LLMs at scale for the\nresearch community.", "paper_summary_zh": "近年來，大型語言模型（LLM）在人工通用智能方面取得了重大進展。然而，從頭訓練這些模型需要大量的計算資源和大量的文本數據。在本文中，我們探討了一種替代方法，通過持續預訓練（CPT）現有的預訓練 LLM，而不是使用隨機初始化的參數，來構建一種新語言的 LLM。基於對 40 個模型大小（範圍從 40M 到 5B 參數）的並行實驗，我們發現 1) CPT 收斂得更快，並以可擴展的方式節省了大量資源；2) CPT 遵循 Hoffmann 等人（2022）推導出的擴展縮放定律，並帶有一個聯合數據參數縮放項；3) 根據我們估計的縮放因子，CPT 的計算最佳數據參數分配顯著不同；4) 大規模轉移的有效性受訓練持續時間和語言屬性的影響，同時對數據重放具有魯棒性，這是一種有效減輕 CPT 中災難性遺忘的方法。我們希望我們的發現能為研究界提供對大規模 LLM 可轉移性的更深入見解。", "author": "Wenzhen Zheng et.al.", "authors": "Wenzhen Zheng, Wenbo Pan, Xu Xu, Libo Qin, Li Yue, Ming Zhou", "id": "2407.02118v1", "paper_url": "http://arxiv.org/abs/2407.02118v1", "repo": "null"}}