{"2501.13457": {"publish_time": "2025-01-23", "title": "Zero-Shot Trajectory Planning for Signal Temporal Logic Tasks", "paper_summary": "Signal Temporal Logic (STL) is a powerful specification language for\ndescribing complex temporal behaviors of continuous signals, making it\nwell-suited for high-level robotic task descriptions. However, generating\nexecutable plans for STL tasks is challenging, as it requires consideration of\nthe coupling between the task specification and the system dynamics. Existing\napproaches either follow a model-based setting that explicitly requires\nknowledge of the system dynamics or adopt a task-oriented data-driven approach\nto learn plans for specific tasks. In this work, we investigate the problem of\ngenerating executable STL plans for systems whose dynamics are unknown a\npriori. We propose a new planning framework that uses only task-agnostic data\nduring the offline training stage, enabling zero-shot generalization to new STL\ntasks. Our framework is hierarchical, involving: (i) decomposing the STL task\ninto a set of progress and time constraints, (ii) searching for time-aware\nwaypoints guided by task-agnostic data, and (iii) generating trajectories using\na pre-trained safe diffusion model. Simulation results demonstrate the\neffectiveness of our method indeed in achieving zero-shot generalization to\nvarious STL tasks.", "paper_summary_zh": "訊號時序邏輯 (STL) 是一種強大的規格語言，用於描述連續訊號的複雜時序行為，使其非常適合用於高階機器人任務描述。然而，為 STL 任務產生可執行計畫具有挑戰性，因為它需要考慮任務規格和系統動態之間的耦合。現有的方法遵循基於模型的設定，明確需要系統動態的知識，或採用以任務為導向的資料驅動方法來學習特定任務的計畫。在這項工作中，我們探討了為動態未知的系統產生可執行 STL 計畫的問題。我們提出一個新的規劃架構，在離線訓練階段僅使用與任務無關的資料，實現對新 STL 任務的零次學習泛化。我們的架構是階層式的，涉及：(i) 將 STL 任務分解為一組進度和時間約束，(ii) 搜尋由與任務無關的資料引導的時間感知路徑點，以及 (iii) 使用預先訓練的安全擴散模型產生軌跡。模擬結果證明了我們的方法在實現對各種 STL 任務的零次學習泛化方面的確有效。", "author": "Ruijia Liu et.al.", "authors": "Ruijia Liu, Ancheng Hou, Xiao Yu, Xiang Yin", "id": "2501.13457v1", "paper_url": "http://arxiv.org/abs/2501.13457v1", "repo": "null"}}