{"2410.03531": {"publish_time": "2024-10-04", "title": "MARE: Multi-Aspect Rationale Extractor on Unsupervised Rationale Extraction", "paper_summary": "Unsupervised rationale extraction aims to extract text snippets to support\nmodel predictions without explicit rationale annotation. Researchers have made\nmany efforts to solve this task. Previous works often encode each aspect\nindependently, which may limit their ability to capture meaningful internal\ncorrelations between aspects. While there has been significant work on\nmitigating spurious correlations, our approach focuses on leveraging the\nbeneficial internal correlations to improve multi-aspect rationale extraction.\nIn this paper, we propose a Multi-Aspect Rationale Extractor (MARE) to explain\nand predict multiple aspects simultaneously. Concretely, we propose a\nMulti-Aspect Multi-Head Attention (MAMHA) mechanism based on hard deletion to\nencode multiple text chunks simultaneously. Furthermore, multiple special\ntokens are prepended in front of the text with each corresponding to one\ncertain aspect. Finally, multi-task training is deployed to reduce the training\noverhead. Experimental results on two unsupervised rationale extraction\nbenchmarks show that MARE achieves state-of-the-art performance. Ablation\nstudies further demonstrate the effectiveness of our method. Our codes have\nbeen available at https://github.com/CSU-NLP-Group/MARE.", "paper_summary_zh": "無監督基礎抽取旨在抽取文字片段以支援模型預測，而無需明確的基礎標註。研究人員已為了解決此任務做出了許多努力。先前的作品通常獨立編碼每個面向，這可能會限制它們捕捉面向之間有意義的內部關聯性的能力。儘管已經有大量工作在減輕虛假關聯性上，但我們的做法著重於利用有益的內部關聯性來改善多面向基礎抽取。在本文中，我們提出了一個多面向基礎抽取器 (MARE) 來同時解釋和預測多個面向。具體來說，我們提出了一個基於硬刪除的多面向多頭注意力 (MAMHA) 機制，以同時編碼多個文字塊。此外，多個特殊標記會預先加在文字前面，每個標記都對應一個特定面向。最後，部署多任務訓練以減少訓練開銷。兩個無監督基礎抽取基準上的實驗結果表明，MARE 達到了最先進的效能。消融研究進一步證明了我們方法的有效性。我們的程式碼已在 https://github.com/CSU-NLP-Group/MARE 中提供。", "author": "Han Jiang et.al.", "authors": "Han Jiang, Junwen Duan, Zhe Qu, Jianxin Wang", "id": "2410.03531v1", "paper_url": "http://arxiv.org/abs/2410.03531v1", "repo": "null"}}