{"2502.13006": {"publish_time": "2025-02-18", "title": "Integrating Reinforcement Learning, Action Model Learning, and Numeric Planning for Tackling Complex Tasks", "paper_summary": "Automated Planning algorithms require a model of the domain that specifies\nthe preconditions and effects of each action. Obtaining such a domain model is\nnotoriously hard. Algorithms for learning domain models exist, yet it remains\nunclear whether learning a domain model and planning is an effective approach\nfor numeric planning environments, i.e., where states include discrete and\nnumeric state variables. In this work, we explore the benefits of learning a\nnumeric domain model and compare it with alternative model-free solutions. As a\ncase study, we use two tasks in Minecraft, a popular sandbox game that has been\nused as an AI challenge. First, we consider an offline learning setting, where\na set of expert trajectories are available to learn from. This is the standard\nsetting for learning domain models. We used the Numeric Safe Action Model\nLearning (NSAM) algorithm to learn a numeric domain model and solve new\nproblems with the learned domain model and a numeric planner. We call this\nmodel-based solution NSAM_(+p), and compare it to several model-free Imitation\nLearning (IL) and Offline Reinforcement Learning (RL) algorithms. Empirical\nresults show that some IL algorithms can learn faster to solve simple tasks,\nwhile NSAM_(+p) allows solving tasks that require long-term planning and\nenables generalizing to solve problems in larger environments. Then, we\nconsider an online learning setting, where learning is done by moving an agent\nin the environment. For this setting, we introduce RAMP. In RAMP, observations\ncollected during the agent's execution are used to simultaneously train an RL\npolicy and learn a planning domain action model. This forms a positive feedback\nloop between the RL policy and the learned domain model. We demonstrate\nexperimentally the benefits of using RAMP, showing that it finds more efficient\nplans and solves more problems than several RL baselines.", "paper_summary_zh": "<paragraph>自動化規劃演算法需要一個網域模型，來指定每個動作的前提條件和效果。取得這樣的網域模型出了名的困難。學習網域模型的演算法確實存在，但學習網域模型和規劃是否為數值規劃環境的有效方法仍然不清楚，也就是說，其中狀態包含離散和數值狀態變數。在這項工作中，我們探討學習數值網域模型的優點，並將其與替代的無模型解決方案進行比較。作為一個案例研究，我們使用 Minecraft 中的兩個任務，Minecraft 是一個流行的沙盒遊戲，已被用作 AI 挑戰。首先，我們考慮離線學習設定，其中有一組專家軌跡可供學習。這是學習網域模型的標準設定。我們使用數值安全動作模型學習 (NSAM) 演算法來學習數值網域模型，並使用已學習的網域模型和數值規劃器解決新問題。我們稱此模型為基礎的解決方案 NSAM_(+p)，並將其與多種無模型模仿學習 (IL) 和離線強化學習 (RL) 演算法進行比較。經驗結果顯示，一些 IL 演算法可以更快地學習解決簡單任務，而 NSAM_(+p) 允許解決需要長期規劃的任務，並能夠推廣到在更大環境中解決問題。然後，我們考慮線上學習設定，其中學習是透過在環境中移動代理來完成的。對於此設定，我們引入了 RAMP。在 RAMP 中，在代理執行期間收集的觀察結果用於同時訓練 RL 政策和學習規劃網域動作模型。這在 RL 政策和已學習的網域模型之間形成了一個正向回饋迴路。我們透過實驗證明了使用 RAMP 的好處，顯示它比多個 RL 基準找到了更有效的計畫，並解決了更多問題。</paragraph>", "author": "Yarin Benyamin et.al.", "authors": "Yarin Benyamin, Argaman Mordoch, Shahaf S. Shperberg, Roni Stern", "id": "2502.13006v1", "paper_url": "http://arxiv.org/abs/2502.13006v1", "repo": "null"}}