{"2410.04838": {"publish_time": "2024-10-07", "title": "Rationale-Aware Answer Verification by Pairwise Self-Evaluation", "paper_summary": "Answer verification identifies correct solutions among candidates generated\nby large language models (LLMs). Current approaches typically train verifier\nmodels by labeling solutions as correct or incorrect based solely on whether\nthe final answer matches the gold answer. However, this approach neglects any\nflawed rationale in the solution yielding the correct answer, undermining the\nverifier's ability to distinguish between sound and flawed rationales. We\nempirically show that in StrategyQA, only 19% of LLM-generated solutions with\ncorrect answers have valid rationales, thus leading to an unreliable verifier.\nFurthermore, we demonstrate that training a verifier on valid rationales\nsignificantly improves its ability to distinguish valid and flawed rationale.\nTo make a better verifier without extra human supervision, we introduce REPS\n(Rationale Enhancement through Pairwise Selection), a method for selecting\nvalid rationales from candidates by iteratively applying pairwise\nself-evaluation using the same LLM that generates the solutions. Verifiers\ntrained on solutions selected by REPS outperform those trained using\nconventional training methods on three reasoning benchmarks (ARC-Challenge,\nDROP, and StrategyQA). Our results suggest that training reliable verifiers\nrequires ensuring the validity of rationales in addition to the correctness of\nthe final answers, which would be critical for models assisting humans in\nsolving complex reasoning tasks.", "paper_summary_zh": "答案驗證會從大型語言模型 (LLM) 生成的候選答案中找出正確的解答。目前的作法通常會根據最終答案是否與正確答案相符，將解答標記為正確或不正確，進而訓練驗證模型。然而，這種作法忽略了產生正確答案的解答中任何有缺陷的依據，這會損害驗證器區分合理依據和有缺陷依據的能力。我們透過實證顯示，在 StrategyQA 中，只有 19% 產生正確答案的 LLM 生成的解答具有有效的依據，因此導致驗證器不可靠。此外，我們證明了在有效的依據上訓練驗證器，可以顯著提升其區分有效和有缺陷依據的能力。為了在沒有額外人工監督的情況下製作出更好的驗證器，我們引入了 REPS（透過成對選擇進行依據強化），這是一種透過使用產生解答的相同 LLM，反覆套用成對自我評估來從候選答案中選擇有效依據的方法。使用 REPS 選擇的解答所訓練的驗證器，在三個推理基準測試（ARC-Challenge、DROP 和 StrategyQA）上的表現優於使用傳統訓練方法訓練的驗證器。我們的結果顯示，訓練可靠的驗證器需要確保依據的有效性，以及最終答案的正確性，這對於協助人類解決複雜推理任務的模型至關重要。", "author": "Akira Kawabata et.al.", "authors": "Akira Kawabata, Saku Sugawara", "id": "2410.04838v1", "paper_url": "http://arxiv.org/abs/2410.04838v1", "repo": "null"}}