{"2407.15695": {"publish_time": "2024-07-22", "title": "Supporting the Digital Autonomy of Elders Through LLM Assistance", "paper_summary": "The internet offers tremendous access to services, social connections, and\nneeded products. However, to those without sufficient experience, engaging with\nbusinesses and friends across the internet can be daunting due to the ever\npresent danger of scammers and thieves, to say nothing of the myriad of\npotential computer viruses. Like a forest rich with both edible and poisonous\nplants, those familiar with the norms inhabit it safely with ease while\nnewcomers need a guide. However, reliance on a human digital guide can be\ntaxing and often impractical. We propose and pilot a simple but unexplored\nidea: could an LLM provide the necessary support to help the elderly who are\nseparated by the digital divide safely achieve digital autonomy?", "paper_summary_zh": "網路提供了極大的服務、社交連結，以及必需產品的存取權。然而，對於沒有足夠經驗的人來說，與企業和朋友透過網路互動可能會令人望而生畏，因為詐騙者和小偷無所不在，更別說還有無數潛在的電腦病毒。就像一座富含可食用和有毒植物的森林，熟悉規範的人可以輕鬆安全地居住其中，而新手則需要一位嚮導。然而，依賴人類數位嚮導可能會很累人，而且常常不切實際。我們提出並試行了一個簡單但尚未探索的想法：大型語言模型 (LLM) 能否提供必要的支援，以幫助被數位鴻溝隔開的老年人安全地實現數位自主？", "author": "Jesse Roberts et.al.", "authors": "Jesse Roberts, Lindsey Roberts, Alice Reed", "id": "2407.15695v1", "paper_url": "http://arxiv.org/abs/2407.15695v1", "repo": "null"}}