{"2406.09154": {"publish_time": "2024-06-13", "title": "Diffusion Gaussian Mixture Audio Denoise", "paper_summary": "Recent diffusion models have achieved promising performances in\naudio-denoising tasks. The unique property of the reverse process could recover\nclean signals. However, the distribution of real-world noises does not comply\nwith a single Gaussian distribution and is even unknown. The sampling of\nGaussian noise conditions limits its application scenarios. To overcome these\nchallenges, we propose a DiffGMM model, a denoising model based on the\ndiffusion and Gaussian mixture models. We employ the reverse process to\nestimate parameters for the Gaussian mixture model. Given a noisy audio signal,\nwe first apply a 1D-U-Net to extract features and train linear layers to\nestimate parameters for the Gaussian mixture model, and we approximate the real\nnoise distributions. The noisy signal is continuously subtracted from the\nestimated noise to output clean audio signals. Extensive experimental results\ndemonstrate that the proposed DiffGMM model achieves state-of-the-art\nperformance.", "paper_summary_zh": "最近的擴散模型在音訊去噪任務中取得了令人滿意的表現。反向程序的獨特屬性可以復原乾淨的訊號。然而，真實世界雜訊的分布並不符合單一的高斯分布，甚至未知。高斯雜訊條件的取樣限制了其應用場景。為了克服這些挑戰，我們提出了 DiffGMM 模型，這是一個基於擴散和高斯混合模型的去噪模型。我們採用反向程序來估計高斯混合模型的參數。給定一個有雜訊的音訊訊號，我們首先應用 1D-U-Net 來提取特徵並訓練線性層以估計高斯混合模型的參數，並且我們近似真實的雜訊分佈。從估計的雜訊中持續減去有雜訊的訊號以輸出乾淨的音訊訊號。大量的實驗結果表明，所提出的 DiffGMM 模型達到了最先進的效能。", "author": "Pu Wang et.al.", "authors": "Pu Wang, Junhui Li, Jialu Li, Liangdong Guo, Youshan Zhang", "id": "2406.09154v1", "paper_url": "http://arxiv.org/abs/2406.09154v1", "repo": "null"}}