{"2410.11469": {"publish_time": "2024-10-15", "title": "O-Edit: Orthogonal Subspace Editing for Language Model Sequential Editing", "paper_summary": "Large language models (LLMs) acquire knowledge during pre-training, but over\ntime, this knowledge may become incorrect or outdated, necessitating updates\nafter training. Knowledge editing techniques address this issue without the\nneed for costly re-training. However, most existing methods are designed for\nsingle edits, and as the number of edits increases, they often cause a decline\nin the model's overall performance, posing significant challenges for\nsequential editing. To overcome this, we propose Orthogonal Subspace Editing,\nO-Edit. This algorithm orthogonalizes the direction of each knowledge update,\nminimizing interference between successive updates and reducing the impact of\nnew updates on unrelated knowledge. Our approach does not require replaying\npreviously edited data and processes each edit knowledge on time. It can\nperform thousands of edits on mainstream LLMs, achieving an average performance\nimprovement that is 4.2 times better than existing methods while effectively\npreserving the model's performance on downstream tasks, all with minimal\nadditional parameter overhead.", "paper_summary_zh": "大型語言模型 (LLM) 在預訓練期間會獲取知識，但隨著時間推移，這些知識可能會變得不正確或過時，因此需要在訓練後進行更新。知識編輯技術解決了這個問題，而無需進行代價高昂的重新訓練。然而，現有的方法大多是針對單一編輯而設計的，隨著編輯次數的增加，它們通常會導致模型的整體效能下降，對順序編輯構成重大挑戰。為了克服這個問題，我們提出正交子空間編輯，即 O-Edit。此演算法正交化每個知識更新的方向，將連續更新之間的干擾最小化，並減少新更新對不相關知識的影響。我們的做法不需要重播先前編輯的資料，並即時處理每個編輯知識。它可以在主流 LLM 上執行數千次編輯，實現平均效能提升，比現有方法高出 4.2 倍，同時有效地保留模型在下游任務上的效能，而額外的參數開銷極小。", "author": "Yuchen Cai et.al.", "authors": "Yuchen Cai, Ding Cao", "id": "2410.11469v1", "paper_url": "http://arxiv.org/abs/2410.11469v1", "repo": "null"}}