{"2412.15483": {"publish_time": "2024-12-20", "title": "Task-Specific Preconditioner for Cross-Domain Few-Shot Learning", "paper_summary": "Cross-Domain Few-Shot Learning~(CDFSL) methods typically parameterize models\nwith task-agnostic and task-specific parameters. To adapt task-specific\nparameters, recent approaches have utilized fixed optimization strategies,\ndespite their potential sub-optimality across varying domains or target tasks.\nTo address this issue, we propose a novel adaptation mechanism called\nTask-Specific Preconditioned gradient descent~(TSP). Our method first\nmeta-learns Domain-Specific Preconditioners~(DSPs) that capture the\ncharacteristics of each meta-training domain, which are then linearly combined\nusing task-coefficients to form the Task-Specific Preconditioner. The\npreconditioner is applied to gradient descent, making the optimization adaptive\nto the target task. We constrain our preconditioners to be positive definite,\nguiding the preconditioned gradient toward the direction of steepest descent.\nEmpirical evaluations on the Meta-Dataset show that TSP achieves\nstate-of-the-art performance across diverse experimental scenarios.", "paper_summary_zh": "跨域小样本学习~(CDFSL) 方法通常使用与任务无关和特定于任务的参数对模型进行参数化。为了适应特定于任务的参数，最近的方法利用了固定的优化策略，尽管它们在不同域或目标任务中存在潜在的次优性。为了解决这个问题，我们提出了一种称为任务特定预处理梯度下降~(TSP) 的新颖自适应机制。我们的方法首先元学习领域特定预处理程序~(DSP)，它捕获每个元训练域的特征，然后使用任务系数线性组合它们以形成任务特定预处理程序。预处理程序应用于梯度下降，使优化适应目标任务。我们限制我们的预处理程序为正定，引导预处理梯度朝向最陡下降的方向。Meta-Dataset 上的经验评估表明，TSP 在各种实验场景中实现了最先进的性能。", "author": "Suhyun Kang et.al.", "authors": "Suhyun Kang, Jungwon Park, Wonseok Lee, Wonjong Rhee", "id": "2412.15483v1", "paper_url": "http://arxiv.org/abs/2412.15483v1", "repo": "null"}}