{"2411.10028": {"publish_time": "2024-11-15", "title": "MOT\\_FCG++: Enhanced Representation of Motion and Appearance Features", "paper_summary": "The goal of multi-object tracking (MOT) is to detect and track all objects in\na scene across frames, while maintaining a unique identity for each object.\nMost existing methods rely on the spatial motion features and appearance\nembedding features of the detected objects in consecutive frames. Effectively\nand robustly representing the spatial and appearance features of long\ntrajectories has become a critical factor affecting the performance of MOT. We\npropose a novel approach for appearance and spatial feature representation,\nimproving upon the clustering association method MOT\\_FCG. For spatial motion\nfeatures, we propose Diagonal Modulated GIoU, which more accurately represents\nthe relationship between the position and shape of the objects. For appearance\nfeatures, we utilize a dynamic appearance representation that incorporates\nconfidence information, enabling the trajectory appearance features to be more\nrobust and global. Based on the baseline model MOT\\_FCG, we achieved 76.1 HOTA,\n80.4 MOTA and 81.3 IDF1 on the MOT17 validation set, and also achieved\ncompetitive performance on the MOT20 and DanceTrack validation sets.", "paper_summary_zh": "多目標追蹤 (MOT) 的目標是偵測和追蹤場景中所有物體在各個畫格中的位置，同時為每個物體維持一個獨特的識別碼。\n大多數現有的方法依賴於連續畫格中偵測到物體的空間運動特徵和外觀嵌入特徵。有效且穩健地表示長軌跡的空間和外觀特徵已成為影響 MOT 效能的關鍵因素。我們提出了一種外觀和空間特徵表示的新方法，改進了群集關聯方法 MOT\\_FCG。對於空間運動特徵，我們提出了對角調製 GIoU，它更準確地表示物體位置和形狀之間的關係。對於外觀特徵，我們利用了結合信心資訊的動態外觀表示，使軌跡外觀特徵更加穩健且全面。根據基準模型 MOT\\_FCG，我們在 MOT17 驗證集上達到了 76.1 HOTA、80.4 MOTA 和 81.3 IDF1，並且在 MOT20 和 DanceTrack 驗證集上也取得了具有競爭力的效能。", "author": "Yanzhao Fang et.al.", "authors": "Yanzhao Fang", "id": "2411.10028v1", "paper_url": "http://arxiv.org/abs/2411.10028v1", "repo": "null"}}