{"2409.20064": {"publish_time": "2024-09-30", "title": "Knowledge Discovery using Unsupervised Cognition", "paper_summary": "Knowledge discovery is key to understand and interpret a dataset, as well as\nto find the underlying relationships between its components. Unsupervised\nCognition is a novel unsupervised learning algorithm that focus on modelling\nthe learned data. This paper presents three techniques to perform knowledge\ndiscovery over an already trained Unsupervised Cognition model. Specifically,\nwe present a technique for pattern mining, a technique for feature selection\nbased on the previous pattern mining technique, and a technique for\ndimensionality reduction based on the previous feature selection technique. The\nfinal goal is to distinguish between relevant and irrelevant features and use\nthem to build a model from which to extract meaningful patterns. We evaluated\nour proposals with empirical experiments and found that they overcome the\nstate-of-the-art in knowledge discovery.", "paper_summary_zh": "知識發現是了解和詮釋資料集的關鍵，以及找出其組成部分之間的基礎關係。無監督認知是一種新穎的無監督學習演算法，專注於對學習到的資料進行建模。本文提出了三種技術，以對已訓練好的無監督認知模型執行知識發現。具體來說，我們提出了一種模式探勘技術、一種基於先前模式探勘技術的特徵選取技術，以及一種基於先前特徵選取技術的降維技術。最終目標是區分相關和無關特徵，並使用它們來建立一個模型，從中提取有意義的模式。我們使用經驗實驗評估了我們的提案，發現它們克服了知識發現的最新技術。", "author": "Alfredo Ibias et.al.", "authors": "Alfredo Ibias, Hector Antona, Guillem Ramirez-Miranda, Enric Guinovart", "id": "2409.20064v1", "paper_url": "http://arxiv.org/abs/2409.20064v1", "repo": "null"}}