{"2410.17656": {"publish_time": "2024-10-23", "title": "AutoRNet: Automatically Optimizing Heuristics for Robust Network Design via Large Language Models", "paper_summary": "Achieving robust networks is a challenging problem due to its NP-hard nature\nand complex solution space. Current methods, from handcrafted feature\nextraction to deep learning, have made progress but remain rigid, requiring\nmanual design and large labeled datasets. To address these issues, we propose\nAutoRNet, a framework that integrates large language models (LLMs) with\nevolutionary algorithms to generate heuristics for robust network design. We\ndesign network optimization strategies to provide domain-specific prompts for\nLLMs, utilizing domain knowledge to generate advanced heuristics. Additionally,\nwe introduce an adaptive fitness function to balance convergence and diversity\nwhile maintaining degree distributions. AutoRNet is evaluated on sparse and\ndense scale-free networks, outperforming current methods by reducing the need\nfor manual design and large datasets.", "paper_summary_zh": "由於 NP 難度性質和複雜的解空間，實現穩健網路是一個具有挑戰性的問題。目前的方法，從手工特徵萃取到深度學習，已經取得進展，但仍然僵化，需要手動設計和大量的標籤資料集。為了解決這些問題，我們提出了 AutoRNet，一個整合大型語言模型 (LLM) 與演算法的框架，用於產生用於穩健網路設計的啟發式方法。我們設計網路最佳化策略，為 LLM 提供特定於領域的提示，利用領域知識產生進階啟發式方法。此外，我們引入了一個適應性適應度函數，在維持度數分佈的同時平衡收斂性和多樣性。AutoRNet 在稀疏和密集的無標度網路中進行評估，通過減少對手動設計和大資料集的需求，優於目前的方法。", "author": "He Yu et.al.", "authors": "He Yu, Jing Liu", "id": "2410.17656v1", "paper_url": "http://arxiv.org/abs/2410.17656v1", "repo": "null"}}