{"2411.08447": {"publish_time": "2024-11-13", "title": "Learning Dynamic Cognitive Map with Autonomous Navigation", "paper_summary": "Inspired by animal navigation strategies, we introduce a novel computational\nmodel to navigate and map a space rooted in biologically inspired principles.\nAnimals exhibit extraordinary navigation prowess, harnessing memory,\nimagination, and strategic decision-making to traverse complex and aliased\nenvironments adeptly. Our model aims to replicate these capabilities by\nincorporating a dynamically expanding cognitive map over predicted poses within\nan Active Inference framework, enhancing our agent's generative model\nplasticity to novelty and environmental changes. Through structure learning and\nactive inference navigation, our model demonstrates efficient exploration and\nexploitation, dynamically expanding its model capacity in response to\nanticipated novel un-visited locations and updating the map given new evidence\ncontradicting previous beliefs. Comparative analyses in mini-grid environments\nwith the Clone-Structured Cognitive Graph model (CSCG), which shares similar\nobjectives, highlight our model's ability to rapidly learn environmental\nstructures within a single episode, with minimal navigation overlap. Our model\nachieves this without prior knowledge of observation and world dimensions,\nunderscoring its robustness and efficacy in navigating intricate environments.", "paper_summary_zh": "受動物導航策略的啟發，我們引進了一個新穎的運算模型，以導航和繪製一個植根於生物靈感原則的空間。動物展現出非凡的導航能力，利用記憶、想像力和策略決策來靈巧地穿越複雜和別名的環境。我們的模型旨在透過在主動推理框架中納入一個動態擴展的認知地圖，在預測的姿勢上複製這些能力，增強我們代理的生成模型對新奇事物和環境變化的可塑性。透過結構學習和主動推理導航，我們的模型展示了有效的探索和利用，動態擴展其模型容量以響應預期的未拜訪新地點，並根據與先前信念相矛盾的新證據更新地圖。在與具有類似目標的 Clone-Structured Cognitive Graph 模型 (CSCG) 的迷你網格環境中進行比較分析，突顯了我們的模型在單一情節中快速學習環境結構的能力，導航重疊最少。我們的模型在沒有事先了解觀察和世界維度的知識下實現了這一點，強調了它在導航複雜環境中的穩健性和有效性。", "author": "Daria de Tinguy et.al.", "authors": "Daria de Tinguy, Tim Verbelen, Bart Dhoedt", "id": "2411.08447v1", "paper_url": "http://arxiv.org/abs/2411.08447v1", "repo": "null"}}