{"2411.15862": {"publish_time": "2024-11-24", "title": "LLMs Do Not Think Step-by-step In Implicit Reasoning", "paper_summary": "It has been well-known that Chain-of-Thought can remarkably enhance LLMs'\nperformance on complex tasks. However, because it also introduces slower\ninference speeds and higher computational costs, many researches have attempted\nto use implicit CoT, which does not need LLMs to explicitly generate the\nintermediate steps. But there is still gap between their efficacy and typical\nexplicit CoT methods. This leaves us a doubt that, does implicit CoT really\nequal to explicit CoT? Therefore, in this study, we address this question\nthrough experiments. We probe the information of intermediate steps from the\nmodel's hidden states when it is performing implicit CoT. The results\nsurprisingly indicate that LLMs hardly think about intermediate steps,\nsuggesting they may just rely on experience rather than strict step-by-step\nreasoning. Moreover, we find LLMs' implicit reasoning capabilities are\nsusceptible and unstable, reaffirming the necessity of explicit CoT to\neffectively support complex tasks.", "paper_summary_zh": "眾所周知，思想鏈可以顯著增強 LLM 在複雜任務上的性能。然而，由於它還會導致較慢的推論速度和較高的計算成本，許多研究嘗試使用隱式 CoT，它不需要 LLM 明確生成中間步驟。但它們的效能與典型的顯式 CoT 方法之間仍然存在差距。這讓我們產生一個疑問，隱式 CoT 是否真的等於顯式 CoT？因此，在本研究中，我們透過實驗來探討這個問題。我們在模型執行隱式 CoT 時，探討其隱藏狀態中關於中間步驟的資訊。結果令人驚訝地表明，LLM 幾乎不會考慮中間步驟，這表明它們可能僅依賴於經驗，而不是嚴格的逐步推理。此外，我們發現 LLM 的隱式推理能力是敏感且不穩定的，這再次肯定了顯式 CoT 在有效支援複雜任務中的必要性。", "author": "Yijiong Yu et.al.", "authors": "Yijiong Yu", "id": "2411.15862v1", "paper_url": "http://arxiv.org/abs/2411.15862v1", "repo": "null"}}