{"2405.10446": {"publish_time": "2024-05-16", "title": "Tell me more: Intent Fulfilment Framework for Enhancing User Experiences in Conversational XAI", "paper_summary": "The evolution of Explainable Artificial Intelligence (XAI) has emphasised the\nsignificance of meeting diverse user needs. The approaches to identifying and\naddressing these needs must also advance, recognising that explanation\nexperiences are subjective, user-centred processes that interact with users\ntowards a better understanding of AI decision-making. This paper delves into\nthe interrelations in multi-faceted XAI and examines how different types of\nexplanations collaboratively meet users' XAI needs. We introduce the Intent\nFulfilment Framework (IFF) for creating explanation experiences. The novelty of\nthis paper lies in recognising the importance of \"follow-up\" on explanations\nfor obtaining clarity, verification and/or substitution. Moreover, the\nExplanation Experience Dialogue Model integrates the IFF and \"Explanation\nFollowups\" to provide users with a conversational interface for exploring their\nexplanation needs, thereby creating explanation experiences. Quantitative and\nqualitative findings from our comparative user study demonstrate the impact of\nthe IFF in improving user engagement, the utility of the AI system and the\noverall user experience. Overall, we reinforce the principle that \"one\nexplanation does not fit all\" to create explanation experiences that guide the\ncomplex interaction through conversation.", "paper_summary_zh": "可解釋人工智慧 (XAI) 的演進強調滿足多元使用者需求的重要性。辨識及滿足這些需求的方法也必須進步，認知到解釋體驗是主觀、以使用者為中心的流程，與使用者互動以期更了解 AI 決策制定。本文探討多面向 XAI 中的相互關係，並探討不同類型的解釋如何協作滿足使用者的 XAI 需求。我們介紹意圖滿足架構 (IFF)，用於建立解釋體驗。本文的新穎性在於認知到「後續」對解釋的重要性，以獲得清晰度、驗證和/或替換。此外，解釋體驗對話模式整合 IFF 和「解釋後續」，為使用者提供對話介面以探索其解釋需求，進而建立解釋體驗。我們比較使用者研究中的量化和質化發現，證明 IFF 在改善使用者參與度、AI 系統的效用和整體使用者體驗方面的影響。總體而言，我們強化「一種解釋無法適用所有」的原則，以建立解釋體驗，透過對話引導複雜的互動。", "author": "Anjana Wijekoon et.al.", "authors": "Anjana Wijekoon, David Corsar, Nirmalie Wiratunga, Kyle Martin, Pedram Salimi", "id": "2405.10446v1", "paper_url": "http://arxiv.org/abs/2405.10446v1", "repo": "null"}}