{"2407.09019": {"publish_time": "2024-07-12", "title": "Heterogeneous Subgraph Network with Prompt Learning for Interpretable Depression Detection on Social Media", "paper_summary": "Massive social media data can reflect people's authentic thoughts, emotions,\ncommunication, etc., and therefore can be analyzed for early detection of\nmental health problems such as depression. Existing works about early\ndepression detection on social media lacked interpretability and neglected the\nheterogeneity of social media data. Furthermore, they overlooked the global\ninteraction among users. To address these issues, we develop a novel method\nthat leverages a Heterogeneous Subgraph Network with Prompt Learning(HSNPL) and\ncontrastive learning mechanisms. Specifically, prompt learning is employed to\nmap users' implicit psychological symbols with excellent interpretability while\ndeep semantic and diverse behavioral features are incorporated by a\nheterogeneous information network. Then, the heterogeneous graph network with a\ndual attention mechanism is constructed to model the relationships among\nheterogeneous social information at the feature level. Furthermore, the\nheterogeneous subgraph network integrating subgraph attention and\nself-supervised contrastive learning is developed to explore complicated\ninteractions among users and groups at the user level. Extensive experimental\nresults demonstrate that our proposed method significantly outperforms\nstate-of-the-art methods for depression detection on social media.", "paper_summary_zh": "龐大的社群媒體資料可以反映人們真實的想法、情緒、溝通等，因此可以分析這些資料，以早期偵測憂鬱症等心理健康問題。現有關於社群媒體上早期憂鬱症偵測的研究缺乏可解釋性，且忽略了社群媒體資料的異質性。此外，這些研究忽視了使用者之間的整體互動。為了解決這些問題，我們開發了一種新穎的方法，這種方法利用帶有提示學習（HSNPL）的異質子圖網路和對比學習機制。具體而言，提示學習被用於繪製使用者具有出色可解釋性的隱含心理符號，同時通過異質資訊網路整合了深層語義和多樣化的行為特徵。然後，構建具有雙重注意機制的異質圖網路，以在特徵層級建模異質社群資訊之間的關係。此外，開發了整合子圖注意和自我監督對比學習的異質子圖網路，以探索使用者和群組之間在使用者層級的複雜互動。大量的實驗結果表明，我們提出的方法在社群媒體上的憂鬱症偵測方面顯著優於最先進的方法。", "author": "Chen Chen et.al.", "authors": "Chen Chen, Mingwei Li, Fenghuan Li, Haopeng Chen, Yuankun Lin", "id": "2407.09019v1", "paper_url": "http://arxiv.org/abs/2407.09019v1", "repo": "null"}}