{"2407.16040": {"publish_time": "2024-07-22", "title": "Generalizing Teacher Networks for Effective Knowledge Distillation Across Student Architectures", "paper_summary": "Knowledge distillation (KD) is a model compression method that entails\ntraining a compact student model to emulate the performance of a more complex\nteacher model. However, the architectural capacity gap between the two models\nlimits the effectiveness of knowledge transfer. Addressing this issue, previous\nworks focused on customizing teacher-student pairs to improve compatibility, a\ncomputationally expensive process that needs to be repeated every time either\nmodel changes. Hence, these methods are impractical when a teacher model has to\nbe compressed into different student models for deployment on multiple hardware\ndevices with distinct resource constraints. In this work, we propose Generic\nTeacher Network (GTN), a one-off KD-aware training to create a generic teacher\ncapable of effectively transferring knowledge to any student model sampled from\na given finite pool of architectures. To this end, we represent the student\npool as a weight-sharing supernet and condition our generic teacher to align\nwith the capacities of various student architectures sampled from this\nsupernet. Experimental evaluation shows that our method both improves overall\nKD effectiveness and amortizes the minimal additional training cost of the\ngeneric teacher across students in the pool.", "paper_summary_zh": "知识蒸馏 (KD) 是一种模型压缩方法，它需要\n训练一个紧凑的学生模型来模拟一个更复杂的\n教师模型的性能。然而，这两个模型之间的架构容量差距\n限制了知识转移的有效性。为了解决这个问题，以前\n的工作重点是定制师生对以提高兼容性，这是一个\n计算成本很高的过程，需要在每次模型更改时重复进行。因此，这些方法在教师模型必须\n被压缩成不同的学生模型以在具有不同资源约束的多个硬件\n设备上部署时是不切实际的。在这项工作中，我们提出了通用\n教师网络 (GTN)，一种一次性的 KD 感知训练，用于创建通用教师\n能够有效地将知识转移到从\n给定的有限架构池中采样的任何学生模型。为此，我们将学生\n池表示为一个权重共享的超网络，并对我们的通用教师进行条件设置，使其与容量保持一致\n从这个超网络中采样的各种学生架构。实验评估表明，我们的方法既提高了整体\nKD 的有效性，并且摊销了通用教师在池中的学生之间的最低额外训练成本。", "author": "Kuluhan Binici et.al.", "authors": "Kuluhan Binici, Weiming Wu, Tulika Mitra", "id": "2407.16040v1", "paper_url": "http://arxiv.org/abs/2407.16040v1", "repo": "null"}}