{"2412.13050": {"publish_time": "2024-12-17", "title": "Modality-Inconsistent Continual Learning of Multimodal Large Language Models", "paper_summary": "In this paper, we introduce Modality-Inconsistent Continual Learning (MICL),\na new continual learning scenario for Multimodal Large Language Models (MLLMs)\nthat involves tasks with inconsistent modalities (image, audio, or video) and\nvarying task types (captioning or question-answering). Unlike existing\nvision-only or modality-incremental settings, MICL combines modality and task\ntype shifts, both of which drive catastrophic forgetting. To address these\nchallenges, we propose MoInCL, which employs a Pseudo Targets Generation Module\nto mitigate forgetting caused by task type shifts in previously seen\nmodalities. It also incorporates Instruction-based Knowledge Distillation to\npreserve the model's ability to handle previously learned modalities when new\nones are introduced. We benchmark MICL using a total of six tasks and conduct\nexperiments to validate the effectiveness of our proposed MoInCL. The\nexperimental results highlight the superiority of MoInCL, showing significant\nimprovements over representative and state-of-the-art continual learning\nbaselines.", "paper_summary_zh": "在本文中，我們介紹了模態不一致的持續學習 (MICL)，這是一種新的持續學習情境，適用於多模態大型語言模型 (MLLM)，其中涉及具有不一致模態（圖像、音訊或影片）和不同任務類型（標題或問答）的任務。與現有的僅視覺或模態增量設定不同，MICL 結合了模態和任務類型轉換，這兩者都會導致災難性遺忘。為了應對這些挑戰，我們提出了 MoInCL，它採用偽目標生成模組來減輕先前所見模態中任務類型轉換所造成的遺忘。它還整合了基於指令的知識蒸餾，以在引入新模態時保留模型處理先前學習模態的能力。我們使用總共六項任務對 MICL 進行基準測試，並進行實驗驗證我們提出的 MoInCL 的有效性。實驗結果突出了 MoInCL 的優越性，顯示出比具代表性和最先進的持續學習基準顯著的進步。", "author": "Weiguo Pian et.al.", "authors": "Weiguo Pian, Shijian Deng, Shentong Mo, Yunhui Guo, Yapeng Tian", "id": "2412.13050v1", "paper_url": "http://arxiv.org/abs/2412.13050v1", "repo": "null"}}