{"2407.13035": {"publish_time": "2024-07-17", "title": "Pre-Trained Foundation Model representations to uncover Breathing patterns in Speech", "paper_summary": "The process of human speech production involves coordinated respiratory\naction to elicit acoustic speech signals. Typically, speech is produced when\nair is forced from the lungs and is modulated by the vocal tract, where such\nactions are interspersed by moments of breathing in air (inhalation) to refill\nthe lungs again. Respiratory rate (RR) is a vital metric that is used to assess\nthe overall health, fitness, and general well-being of an individual. Existing\napproaches to measure RR (number of breaths one takes in a minute) are\nperformed using specialized equipment or training. Studies have demonstrated\nthat machine learning algorithms can be used to estimate RR using bio-sensor\nsignals as input. Speech-based estimation of RR can offer an effective approach\nto measure the vital metric without requiring any specialized equipment or\nsensors. This work investigates a machine learning based approach to estimate\nRR from speech segments obtained from subjects speaking to a close-talking\nmicrophone device. Data were collected from N=26 individuals, where the\ngroundtruth RR was obtained through commercial grade chest-belts and then\nmanually corrected for any errors. A convolutional long-short term memory\nnetwork (Conv-LSTM) is proposed to estimate respiration time-series data from\nthe speech signal. We demonstrate that the use of pre-trained representations\nobtained from a foundation model, such as Wav2Vec2, can be used to estimate\nrespiration-time-series with low root-mean-squared error and high correlation\ncoefficient, when compared with the baseline. The model-driven time series can\nbe used to estimate $RR$ with a low mean absolute error (MAE) ~ 1.6\nbreaths/min.", "paper_summary_zh": "人類說話的過程涉及協調的呼吸作用以引發聲學語音訊號。通常，當空氣從肺部排出並由聲道調節時會產生語音，其中這些動作會穿插吸入空氣（吸氣）的時刻，以再次填滿肺部。呼吸率 (RR) 是一項重要的指標，用於評估個人的整體健康、體能和一般幸福感。現有的測量 RR（每分鐘呼吸次數）方法是使用專業設備或訓練來執行。研究表明，機器學習演算法可用於使用生物感測器訊號作為輸入來估計 RR。基於語音的 RR 估計可以提供一種有效的測量方法，無需任何專業設備或感測器。這項工作探討了一種基於機器學習的方法，用於從受試者對著近講麥克風裝置說話所獲得的語音片段中估計 RR。資料是從 N=26 個人收集的，其中透過商用等級胸帶取得基準 RR，然後手動更正任何錯誤。提出了一個卷積長短期記憶網路 (Conv-LSTM) 來從語音訊號估計呼吸時間序列資料。我們證明，與基準相比，使用從基礎模型（例如 Wav2Vec2）獲得的預訓練表示可以估計具有低均方根誤差和高相關係數的呼吸時間序列。模型驅動的時間序列可用於估計平均絕對誤差 (MAE) 約為 1.6 次/分鐘的低 $RR$。", "author": "Vikramjit Mitra et.al.", "authors": "Vikramjit Mitra, Anirban Chatterjee, Ke Zhai, Helen Weng, Ayuko Hill, Nicole Hay, Christopher Webb, Jamie Cheng, Erdrin Azemi", "id": "2407.13035v1", "paper_url": "http://arxiv.org/abs/2407.13035v1", "repo": "null"}}