{"2411.01796": {"publish_time": "2024-11-04", "title": "Constrained Human-AI Cooperation: An Inclusive Embodied Social Intelligence Challenge", "paper_summary": "We introduce Constrained Human-AI Cooperation (CHAIC), an inclusive embodied\nsocial intelligence challenge designed to test social perception and\ncooperation in embodied agents. In CHAIC, the goal is for an embodied agent\nequipped with egocentric observations to assist a human who may be operating\nunder physical constraints -- e.g., unable to reach high places or confined to\na wheelchair -- in performing common household or outdoor tasks as efficiently\nas possible. To achieve this, a successful helper must: (1) infer the human's\nintents and constraints by following the human and observing their behaviors\n(social perception), and (2) make a cooperative plan tailored to the human\npartner to solve the task as quickly as possible, working together as a team\n(cooperative planning). To benchmark this challenge, we create four new agents\nwith real physical constraints and eight long-horizon tasks featuring both\nindoor and outdoor scenes with various constraints, emergency events, and\npotential risks. We benchmark planning- and learning-based baselines on the\nchallenge and introduce a new method that leverages large language models and\nbehavior modeling. Empirical evaluations demonstrate the effectiveness of our\nbenchmark in enabling systematic assessment of key aspects of machine social\nintelligence. Our benchmark and code are publicly available at this URL:\nhttps://github.com/UMass-Foundation-Model/CHAIC.", "paper_summary_zh": "我們提出受限人類人工智慧合作 (CHAIC)，這是一項包容性的具身社交智慧挑戰，旨在測試具身代理的社交認知和合作。在 CHAIC 中，目標是讓具備自我中心觀察能力的具身代理協助可能在身體限制下操作的人類——例如，無法觸及高處或只能坐在輪椅上——盡可能有效地執行常見的家務或戶外任務。為達成此目標，成功的助手必須：(1) 通過追蹤人類並觀察其行為來推斷人類的意圖和限制（社交認知），以及 (2) 制定適合人類夥伴的合作計畫，以盡可能快速地解決任務，並作為一個團隊合作（合作計畫）。為了對此挑戰進行基準測試，我們使用實際身體限制創建了四個新代理，以及八項長時程任務，其中包含具有各種限制、緊急事件和潛在風險的室內和室外場景。我們在挑戰中對基於計畫和學習的基準線進行基準測試，並引入一種利用大型語言模型和行為建模的新方法。實證評估證明了我們的基準在啟用對機器社交智慧關鍵方面的系統評估方面的有效性。我們的基準和程式碼在此 URL 公開提供：https://github.com/UMass-Foundation-Model/CHAIC。", "author": "Weihua Du et.al.", "authors": "Weihua Du, Qiushi Lyu, Jiaming Shan, Zhenting Qi, Hongxin Zhang, Sunli Chen, Andi Peng, Tianmin Shu, Kwonjoon Lee, Behzad Dariush, Chuang Gan", "id": "2411.01796v1", "paper_url": "http://arxiv.org/abs/2411.01796v1", "repo": "https://github.com/umass-foundation-model/chaic"}}