{"2501.08496": {"publish_time": "2025-01-14", "title": "Quantifying the Importance of Data Alignment in Downstream Model Performance", "paper_summary": "Contrary to the conventional emphasis on dataset size, we explore the role of\ndata alignment -- an often overlooked aspect of data quality -- in training\ncapable Large Language Models (LLMs). To do so, we use the Task2Vec-based\nalignment coefficient, a quantitative measure of the similarity between two\ndatasets, to quantify the impact of alignment between training data and\nevaluation data on downstream performance. In particular, we conduct controlled\n\\textit{interventional} experiments for two settings: 1. the impact of\nincreased alignment coefficients between various pre-training (pt) against\nevaluation datasets, and 2. the impact of increased alignment coefficients\nbetween domain specific fine-tuning (ft) against domain specific evaluation.\nThe domain specific task we explore is Autoformalization -- the machine\ntranslation task between natural language and code for formal verification. In\nboth settings, we find a strong, predictable negative correlation between the\nalignment coefficient of a model's training and evaluation data and the model's\nloss/perplexity on the respective downstream task. These findings suggest a\nre-evaluation of LLM training approaches, demonstrating the relevance of data\nalignment compared to data quantity, especially in specialized downstream tasks\nsuch as Autoformalization.", "paper_summary_zh": "與傳統強調資料集大小相反，我們探討資料對齊的角色 - 資料品質中經常被忽略的層面 - 在訓練大型語言模型 (LLM) 中。為此，我們使用基於 Task2Vec 的對齊係數，這是衡量兩個資料集相似性的量化指標，用於量化訓練資料和評估資料之間的對齊對下游效能的影響。特別是，我們針對兩種設定進行受控的「介入」實驗：1. 各種預訓練 (pt) 與評估資料集之間增加對齊係數的影響，以及 2. 領域特定微調 (ft) 與領域特定評估之間增加對齊係數的影響。我們探討的領域特定任務是自動形式化 - 自然語言與程式碼之間的機器翻譯，用於形式驗證。在這兩種設定中，我們發現模型訓練和評估資料的對齊係數與模型在各自下游任務上的損失/困惑度之間存在強烈的、可預測的負相關。這些發現表明重新評估 LLM 訓練方法，證明資料對齊與資料量相比具有相關性，特別是在自動形式化等專業的下游任務中。", "author": "Krrish Chawla et.al.", "authors": "Krrish Chawla, Aryan Sahai, Mario DePavia, Sudharsan Sundar, Brando Miranda", "id": "2501.08496v1", "paper_url": "http://arxiv.org/abs/2501.08496v1", "repo": "null"}}