{"2405.06164": {"publish_time": "2024-05-10", "title": "Skeet: Towards a Lightweight Serverless Framework Supporting Modern AI-Driven App Development", "paper_summary": "The field of web and mobile software frameworks is relatively mature, with a\nlarge variety of tools in different languages that facilitate traditional app\ndevelopment where data in a relational database is displayed and modified. Our\nposition is that many current frameworks became popular during single server\ndeployment of MVC architecture apps, and do not facilitate modern aspects of\napp development such as cloud computing and the incorporation of emerging\ntechnologies such as AI. We present a novel framework which accomplishes these\npurposes, Skeet, which was recently released to general use, alongside an\ninitial evaluation. Skeet provides an app structure that reflects current\ntrends in architecture, and tool suites that allow developers with minimal\nknowledge of AI internals to easily incorporate such technologies into their\napps and deploy them.", "paper_summary_zh": "網頁和行動軟體架構領域已經相對成熟，有各種不同語言的工具，可用於顯示和修改關聯式資料庫中的資料的傳統應用程式開發。我們的立場是，許多當前的架構在 MVC 架構應用程式的單一伺服器部署期間變得流行，並且無法促進應用程式開發的現代化面向，例如雲端運算和整合新興技術，例如 AI。我們提出了一個實現這些目的的新穎架構 Skeet，它最近已發布供一般使用，並附有初步評估。Skeet 提供了一個反映當前架構趨勢的應用程式結構，以及允許開發人員在對 AI 內部結構知之甚少的情況下，輕鬆地將這些技術整合到他們的應用程式中並部署它們的工具組。", "author": "Kawasaki Fumitake et.al.", "authors": "Kawasaki Fumitake, Shota Kishi, James Neve", "id": "2405.06164v1", "paper_url": "http://arxiv.org/abs/2405.06164v1", "repo": "null"}}