{"2412.17377": {"publish_time": "2024-12-23", "title": "A Plug-and-Play Physical Motion Restoration Approach for In-the-Wild High-Difficulty Motions", "paper_summary": "Extracting physically plausible 3D human motion from videos is a critical\ntask. Although existing simulation-based motion imitation methods can enhance\nthe physical quality of daily motions estimated from monocular video capture,\nextending this capability to high-difficulty motions remains an open challenge.\nThis can be attributed to some flawed motion clips in video-based motion\ncapture results and the inherent complexity in modeling high-difficulty\nmotions. Therefore, sensing the advantage of segmentation in localizing human\nbody, we introduce a mask-based motion correction module (MCM) that leverages\nmotion context and video mask to repair flawed motions, producing\nimitation-friendly motions; and propose a physics-based motion transfer module\n(PTM), which employs a pretrain and adapt approach for motion imitation,\nimproving physical plausibility with the ability to handle in-the-wild and\nchallenging motions. Our approach is designed as a plug-and-play module to\nphysically refine the video motion capture results, including high-difficulty\nin-the-wild motions. Finally, to validate our approach, we collected a\nchallenging in-the-wild test set to establish a benchmark, and our method has\ndemonstrated effectiveness on both the new benchmark and existing public\ndatasets.https://physicalmotionrestoration.github.io", "paper_summary_zh": "從影片中擷取物理上合理的 3D 人體動作是一項重要的任務。儘管現有的基於模擬的動作模仿方法可以提升從單眼影片擷取的日常動作之物理品質，將此能力擴展到高難度動作仍然是一項公開的挑戰。這可以歸因於影片動作擷取結果中一些有缺陷的動作片段，以及建模高難度動作的複雜性。因此，我們感知到分割在定位人體中的優勢，我們引入了一個基於遮罩的動作校正模組 (MCM)，它利用動作內容和影片遮罩來修復有缺陷的動作，產生友善的模仿動作；並提出了一個基於物理的動作轉移模組 (PTM)，它採用預訓練和適應的方式進行動作模仿，透過處理野外和具挑戰性的動作來提升物理合理性。我們的做法被設計成一個即插即用的模組，用於物理精煉影片動作擷取結果，包括野外的高難度動作。最後，為了驗證我們的做法，我們收集了一個具挑戰性的野外測試集來建立基準，我們的做法已在新的基準和現有的公開資料集上證明其有效性。https://physicalmotionrestoration.github.io", "author": "Youliang Zhang et.al.", "authors": "Youliang Zhang, Ronghui Li, Yachao Zhang, Liang Pan, Jingbo Wang, Yebin Liu, Xiu Li", "id": "2412.17377v1", "paper_url": "http://arxiv.org/abs/2412.17377v1", "repo": "null"}}