{"2411.18269": {"publish_time": "2024-11-27", "title": "Hidden Data Privacy Breaches in Federated Learning", "paper_summary": "Federated Learning (FL) emerged as a paradigm for conducting machine learning\nacross broad and decentralized datasets, promising enhanced privacy by\nobviating the need for direct data sharing. However, recent studies show that\nattackers can steal private data through model manipulation or gradient\nanalysis. Existing attacks are constrained by low theft quantity or\nlow-resolution data, and they are often detected through anomaly monitoring in\ngradients or weights. In this paper, we propose a novel data-reconstruction\nattack leveraging malicious code injection, supported by two key techniques,\ni.e., distinctive and sparse encoding design and block partitioning. Unlike\nconventional methods that require detectable changes to the model, our method\nstealthily embeds a hidden model using parameter sharing to systematically\nextract sensitive data. The Fibonacci-based index design ensures efficient,\nstructured retrieval of memorized data, while the block partitioning method\nenhances our method's capability to handle high-resolution images by dividing\nthem into smaller, manageable units. Extensive experiments on 4 datasets\nconfirmed that our method is superior to the five state-of-the-art\ndata-reconstruction attacks under the five respective detection methods. Our\nmethod can handle large-scale and high-resolution data without being detected\nor mitigated by state-of-the-art data reconstruction defense methods. In\ncontrast to baselines, our method can be directly applied to both FedAVG and\nFedSGD scenarios, underscoring the need for developers to devise new defenses\nagainst such vulnerabilities. We will open-source our code upon acceptance.", "paper_summary_zh": "<paragraph>聯邦學習 (FL) 成為一種跨廣泛且分散式資料集進行機器學習的範例，承諾透過消除直接資料共用需求來增強隱私。然而，最近的研究顯示攻擊者可以透過模型操作或梯度分析竊取私人資料。現有的攻擊受限於竊取量低或資料解析度低，而且通常會透過梯度或權重中的異常監控來偵測。在本文中，我們提出了一種新穎的資料重建攻擊，利用惡意程式碼注入，並由兩種關鍵技術支援，即獨特且稀疏的編碼設計和區塊分割。與需要對模型進行可偵測變更的傳統方法不同，我們的方法秘密地使用參數共用嵌入一個隱藏模型，以系統化地提取敏感資料。基於費氏數列的索引設計確保有效率且結構化的記憶資料擷取，而區塊分割方法透過將高解析度影像分割為較小且可管理的單元，增強了我們的方法處理高解析度影像的能力。在 4 個資料集上的廣泛實驗證實，我們的模型優於五種現有技術資料重建攻擊，在五種各自的偵測方法下。我們的模型可以在不被現有技術資料重建防禦方法偵測或減輕的情況下處理大規模且高解析度資料。與基準相比，我們的模型可以同時直接應用於 FedAVG 和 FedSGD 場景，強調開發人員需要設計新的防禦措施來對抗此類漏洞。我們將在接受後開放原始碼。</paragraph>", "author": "Xueluan Gong et.al.", "authors": "Xueluan Gong, Yuji Wang, Shuaike Li, Mengyuan Sun, Songze Li, Qian Wang, Kwok-Yan Lam, Chen Chen", "id": "2411.18269v1", "paper_url": "http://arxiv.org/abs/2411.18269v1", "repo": "null"}}