{"2407.02775": {"publish_time": "2024-07-03", "title": "MLKD-BERT: Multi-level Knowledge Distillation for Pre-trained Language Models", "paper_summary": "Knowledge distillation is an effective technique for pre-trained language\nmodel compression. Although existing knowledge distillation methods perform\nwell for the most typical model BERT, they could be further improved in two\naspects: the relation-level knowledge could be further explored to improve\nmodel performance; and the setting of student attention head number could be\nmore flexible to decrease inference time. Therefore, we are motivated to\npropose a novel knowledge distillation method MLKD-BERT to distill multi-level\nknowledge in teacher-student framework. Extensive experiments on GLUE benchmark\nand extractive question answering tasks demonstrate that our method outperforms\nstate-of-the-art knowledge distillation methods on BERT. In addition, MLKD-BERT\ncan flexibly set student attention head number, allowing for substantial\ninference time decrease with little performance drop.", "paper_summary_zh": "知識蒸餾是一種針對預訓練語言模型壓縮的有效技術。儘管現有的知識蒸餾方法對最典型的模型 BERT 執行良好，但它們可以在兩個方面進一步改進：可以進一步探索關係層級知識以提高模型效能；並且可以更靈活地設定學生注意力頭部數量以減少推論時間。因此，我們有動力提出一個新穎的知識蒸餾方法 MLKD-BERT，以在師生架構中蒸餾多層級知識。在 GLUE 基準和萃取式問答任務上的廣泛實驗證明，我們的模型優於 BERT 上最先進的知識蒸餾方法。此外，MLKD-BERT 可以靈活地設定學生注意力頭部數量，允許在效能下降不多的情況下大幅減少推論時間。", "author": "Ying Zhang et.al.", "authors": "Ying Zhang, Ziheng Yang, Shufan Ji", "id": "2407.02775v1", "paper_url": "http://arxiv.org/abs/2407.02775v1", "repo": "null"}}