{"2408.08084": {"publish_time": "2024-08-15", "title": "An Efficient Replay for Class-Incremental Learning with Pre-trained Models", "paper_summary": "In general class-incremental learning, researchers typically use sample sets\nas a tool to avoid catastrophic forgetting during continuous learning. At the\nsame time, researchers have also noted the differences between\nclass-incremental learning and Oracle training and have attempted to make\ncorrections. In recent years, researchers have begun to develop\nclass-incremental learning algorithms utilizing pre-trained models, achieving\nsignificant results. This paper observes that in class-incremental learning,\nthe steady state among the weight guided by each class center is disrupted,\nwhich is significantly correlated with catastrophic forgetting. Based on this,\nwe propose a new method to overcoming forgetting . In some cases, by retaining\nonly a single sample unit of each class in memory for replay and applying\nsimple gradient constraints, very good results can be achieved. Experimental\nresults indicate that under the condition of pre-trained models, our method can\nachieve competitive performance with very low computational cost and by simply\nusing the cross-entropy loss.", "paper_summary_zh": "在一般的類別增量學習中，研究人員通常使用樣本集作為一種工具，以避免在持續學習過程中發生災難性遺忘。同時，研究人員也注意到了類別增量學習和 Oracle 訓練之間的差異，並嘗試進行修正。近年來，研究人員已開始開發利用預訓練模型的類別增量學習演算法，並取得了顯著的成果。本文觀察到在類別增量學習中，由每個類別中心引導的權重之間的穩態會被破壞，這與災難性遺忘有顯著相關性。基於此，我們提出了一種克服遺忘的新方法。在某些情況下，通過僅保留每個類別的單個樣本單元進行重播，並應用簡單的梯度約束，就可以取得非常好的結果。實驗結果表明，在預訓練模型的條件下，我們的模型僅通過使用交叉熵損失，就可以在非常低的計算成本下實現具有競爭力的效能。", "author": "Weimin Yin et.al.", "authors": "Weimin Yin, Bin Chen adn Chunzhao Xie, Zhenhao Tan", "id": "2408.08084v1", "paper_url": "http://arxiv.org/abs/2408.08084v1", "repo": "null"}}