{"2408.06503": {"publish_time": "2024-08-12", "title": "Decentralized Cooperation in Heterogeneous Multi-Agent Reinforcement Learning via Graph Neural Network-Based Intrinsic Motivation", "paper_summary": "Multi-agent Reinforcement Learning (MARL) is emerging as a key framework for\nvarious sequential decision-making and control tasks. Unlike their single-agent\ncounterparts, multi-agent systems necessitate successful cooperation among the\nagents. The deployment of these systems in real-world scenarios often requires\ndecentralized training, a diverse set of agents, and learning from infrequent\nenvironmental reward signals. These challenges become more pronounced under\npartial observability and the lack of prior knowledge about agent\nheterogeneity. While notable studies use intrinsic motivation (IM) to address\nreward sparsity or cooperation in decentralized settings, those dealing with\nheterogeneity typically assume centralized training, parameter sharing, and\nagent indexing. To overcome these limitations, we propose the CoHet algorithm,\nwhich utilizes a novel Graph Neural Network (GNN) based intrinsic motivation to\nfacilitate the learning of heterogeneous agent policies in decentralized\nsettings, under the challenges of partial observability and reward sparsity.\nEvaluation of CoHet in the Multi-agent Particle Environment (MPE) and\nVectorized Multi-Agent Simulator (VMAS) benchmarks demonstrates superior\nperformance compared to the state-of-the-art in a range of cooperative\nmulti-agent scenarios. Our research is supplemented by an analysis of the\nimpact of the agent dynamics model on the intrinsic motivation module, insights\ninto the performance of different CoHet variants, and its robustness to an\nincreasing number of heterogeneous agents.", "paper_summary_zh": "多智能體強化學習 (MARL) 正成為各種順序決策和控制任務的關鍵框架。與單一智能體不同，多智能體系統需要智能體之間的成功合作。在現實世界中部署這些系統通常需要分散式訓練、多樣化的智能體，以及從不頻繁的環境獎勵信號中學習。在部分可觀察性和缺乏關於智能體異質性的先驗知識的情況下，這些挑戰變得更加明顯。雖然著名的研究使用內在動機 (IM) 來解決分散式環境中的獎勵稀疏性或合作，但處理異質性的研究通常假設集中式訓練、參數共享和智能體索引。為了克服這些限制，我們提出了 CoHet 演算法，該演算法利用基於圖神經網路 (GNN) 的新穎內在動機，在部分可觀察性和獎勵稀疏性的挑戰下，促進在分散式環境中學習異質智能體策略。在多智能體粒子環境 (MPE) 和向量化多智能體模擬器 (VMAS) 基準測試中對 CoHet 的評估顯示，與各種合作多智能體場景中的最新技術相比，其效能優異。我們的研究補充了對智能體動態模型對內在動機模組的影響的分析、對不同 CoHet 變體效能的見解，以及其對越來越多的異質智能體的穩健性。", "author": "Jahir Sadik Monon et.al.", "authors": "Jahir Sadik Monon, Deeparghya Dutta Barua, Md. Mosaddek Khan", "id": "2408.06503v1", "paper_url": "http://arxiv.org/abs/2408.06503v1", "repo": "https://github.com/jahirsadik/cohet-implementation"}}