{"2411.05706": {"publish_time": "2024-11-08", "title": "Image2Text2Image: A Novel Framework for Label-Free Evaluation of Image-to-Text Generation with Text-to-Image Diffusion Models", "paper_summary": "Evaluating the quality of automatically generated image descriptions is a\ncomplex task that requires metrics capturing various dimensions, such as\ngrammaticality, coverage, accuracy, and truthfulness. Although human evaluation\nprovides valuable insights, its cost and time-consuming nature pose\nlimitations. Existing automated metrics like BLEU, ROUGE, METEOR, and CIDEr\nattempt to fill this gap, but they often exhibit weak correlations with human\njudgment. To address this challenge, we propose a novel evaluation framework\ncalled Image2Text2Image, which leverages diffusion models, such as Stable\nDiffusion or DALL-E, for text-to-image generation. In the Image2Text2Image\nframework, an input image is first processed by a selected image captioning\nmodel, chosen for evaluation, to generate a textual description. Using this\ngenerated description, a diffusion model then creates a new image. By comparing\nfeatures extracted from the original and generated images, we measure their\nsimilarity using a designated similarity metric. A high similarity score\nsuggests that the model has produced a faithful textual description, while a\nlow score highlights discrepancies, revealing potential weaknesses in the\nmodel's performance. Notably, our framework does not rely on human-annotated\nreference captions, making it a valuable tool for assessing image captioning\nmodels. Extensive experiments and human evaluations validate the efficacy of\nour proposed Image2Text2Image evaluation framework. The code and dataset will\nbe published to support further research in the community.", "paper_summary_zh": "評估自動產生圖片描述的品質是一項複雜的任務，需要指標來捕捉各種面向，例如語法、涵蓋範圍、準確度和真實性。儘管人工評估提供了有價值的見解，但其成本和耗時性質會造成限制。現有的自動化指標，例如 BLEU、ROUGE、METEOR 和 CIDEr，試圖填補這個空白，但它們通常與人工判斷相關性較弱。為了應對這項挑戰，我們提出了一個名為 Image2Text2Image 的新評估框架，它利用擴散模型（例如 Stable Diffusion 或 DALL-E）進行文字到圖片的產生。在 Image2Text2Image 框架中，輸入圖片首先由選定的圖片標註模型（選擇用於評估）處理，以產生文字描述。使用這個產生的描述，擴散模型接著會產生一個新圖片。透過比較從原始圖片和產生圖片中萃取出的特徵，我們使用指定的相似性指標來測量它們的相似性。高相似度分數表示模型產生了忠實的文字描述，而低分數則突顯出差異，揭示模型效能的潛在弱點。值得注意的是，我們的框架不依賴人工標註的參考標題，這使其成為評估圖片標註模型的寶貴工具。廣泛的實驗和人工評估驗證了我們提出的 Image2Text2Image 評估框架的有效性。程式碼和資料集將會發布，以支持社群中的進一步研究。", "author": "Jia-Hong Huang et.al.", "authors": "Jia-Hong Huang, Hongyi Zhu, Yixian Shen, Stevan Rudinac, Evangelos Kanoulas", "id": "2411.05706v1", "paper_url": "http://arxiv.org/abs/2411.05706v1", "repo": "null"}}