{"2409.08357": {"publish_time": "2024-09-12", "title": "An Experimental Study of Competitive Market Behavior Through LLMs", "paper_summary": "This study explores the potential of large language models (LLMs) to conduct\nmarket experiments, aiming to understand their capability to comprehend\ncompetitive market dynamics. We model the behavior of market agents in a\ncontrolled experimental setting, assessing their ability to converge toward\ncompetitive equilibria. The results reveal the challenges current LLMs face in\nreplicating the dynamic decision-making processes characteristic of human\ntrading behavior. Unlike humans, LLMs lacked the capacity to achieve market\nequilibrium. The research demonstrates that while LLMs provide a valuable tool\nfor scalable and reproducible market simulations, their current limitations\nnecessitate further advancements to fully capture the complexities of market\nbehavior. Future work that enhances dynamic learning capabilities and\nincorporates elements of behavioral economics could improve the effectiveness\nof LLMs in the economic domain, providing new insights into market dynamics and\naiding in the refinement of economic policies.", "paper_summary_zh": "本研究探討大型語言模型 (LLM) 進行市場實驗的潛力，旨在了解其理解競爭市場動態的能力。我們在受控實驗環境中模擬市場代理人的行為，評估他們收斂於競爭均衡的能力。結果揭示了當前 LLM 在複製人類交易行為特有的動態決策制定過程中面臨的挑戰。與人類不同，LLM 缺乏實現市場均衡的能力。研究表明，儘管 LLM 為可擴充且可重製的市場模擬提供了有價值的工具，但其當前的限制需要進一步的進展才能全面掌握市場行為的複雜性。增強動態學習能力並納入行為經濟學元素的未來工作可以提高 LLM 在經濟領域的有效性，提供對市場動態的新見解，並有助於完善經濟政策。", "author": "Jingru Jia et.al.", "authors": "Jingru Jia, Zehua Yuan", "id": "2409.08357v1", "paper_url": "http://arxiv.org/abs/2409.08357v1", "repo": "null"}}