{"2405.17044": {"publish_time": "2024-05-27", "title": "Generation and human-expert evaluation of interesting research ideas using knowledge graphs and large language models", "paper_summary": "Advanced artificial intelligence (AI) systems with access to millions of\nresearch papers could inspire new research ideas that may not be conceived by\nhumans alone. However, how interesting are these AI-generated ideas, and how\ncan we improve their quality? Here, we introduce SciMuse, a system that uses an\nevolving knowledge graph built from more than 58 million scientific papers to\ngenerate personalized research ideas via an interface to GPT-4. We conducted a\nlarge-scale human evaluation with over 100 research group leaders from the Max\nPlanck Society, who ranked more than 4,000 personalized research ideas based on\ntheir level of interest. This evaluation allows us to understand the\nrelationships between scientific interest and the core properties of the\nknowledge graph. We find that data-efficient machine learning can predict\nresearch interest with high precision, allowing us to optimize the\ninterest-level of generated research ideas. This work represents a step towards\nan artificial scientific muse that could catalyze unforeseen collaborations and\nsuggest interesting avenues for scientists.", "paper_summary_zh": "進階人工智慧（AI）系統能存取數百萬篇研究論文，這能激發人類單獨無法構思的新研究點子。然而，這些 AI 生成的點子有多有趣，我們又該如何提升它們的品質？在此，我們介紹 SciMuse，一個利用從超過 5800 萬篇科學論文建構的演化知識圖譜，透過與 GPT-4 的介面產生個人化研究點子的系統。我們執行了大規模的人類評估，由超過 100 位來自馬克斯普朗克學會的研究小組負責人，根據他們的興趣等級對超過 4000 個個人化研究點子進行排名。這項評估讓我們得以了解科學興趣與知識圖譜核心屬性之間的關係。我們發現資料有效率的機器學習可以高精準度預測研究興趣，讓我們能最佳化生成研究點子的興趣等級。這項工作代表邁向人工科學繆思的一步，它能催化預想不到的協作，並為科學家建議有趣的途徑。", "author": "Xuemei Gu et.al.", "authors": "Xuemei Gu, Mario Krenn", "id": "2405.17044v1", "paper_url": "http://arxiv.org/abs/2405.17044v1", "repo": "null"}}