{"2409.05558": {"publish_time": "2024-09-09", "title": "Seeing Through the Mask: Rethinking Adversarial Examples for CAPTCHAs", "paper_summary": "Modern CAPTCHAs rely heavily on vision tasks that are supposedly hard for\ncomputers but easy for humans. However, advances in image recognition models\npose a significant threat to such CAPTCHAs. These models can easily be fooled\nby generating some well-hidden \"random\" noise and adding it to the image, or\nhiding objects in the image. However, these methods are model-specific and thus\ncan not aid CAPTCHAs in fooling all models. We show in this work that by\nallowing for more significant changes to the images while preserving the\nsemantic information and keeping it solvable by humans, we can fool many\nstate-of-the-art models. Specifically, we demonstrate that by adding masks of\nvarious intensities the Accuracy @ 1 (Acc@1) drops by more than 50%-points for\nall models, and supposedly robust models such as vision transformers see an\nAcc@1 drop of 80%-points.\n  These masks can therefore effectively fool modern image classifiers, thus\nshowing that machines have not caught up with humans -- yet.", "paper_summary_zh": "現代 CAPTCHA 嚴重依賴於視覺任務，這對電腦來說很困難，但對人類來說卻很容易。然而，影像辨識模型的進步對此類 CAPTCHA 構成重大威脅。這些模型很容易被產生一些隱藏良好的「隨機」雜訊並將其加入影像，或將物件隱藏在影像中所愚弄。然而，這些方法特定於模型，因此無法幫助 CAPTCHA 愚弄所有模型。我們在此工作中展示，透過允許對影像進行更顯著的變更，同時保留語意資訊並保持人類可以解決，我們可以愚弄許多最先進的模型。具體來說，我們證明透過加入各種強度遮罩，所有模型的準確率 @ 1 (Acc@1) 下降超過 50%，而據稱強健的模型，例如視覺轉換器，其準確率 @ 1 下降 80%。因此，這些遮罩可以有效愚弄現代影像分類器，從而表明機器尚未趕上人類——至少目前還沒有。", "author": "Yahya Jabary et.al.", "authors": "Yahya Jabary, Andreas Plesner, Turlan Kuzhagaliyev, Roger Wattenhofer", "id": "2409.05558v1", "paper_url": "http://arxiv.org/abs/2409.05558v1", "repo": "null"}}