{"2405.12689": {"publish_time": "2024-05-21", "title": "Spotting AI's Touch: Identifying LLM-Paraphrased Spans in Text", "paper_summary": "AI-generated text detection has attracted increasing attention as powerful\nlanguage models approach human-level generation. Limited work is devoted to\ndetecting (partially) AI-paraphrased texts. However, AI paraphrasing is\ncommonly employed in various application scenarios for text refinement and\ndiversity. To this end, we propose a novel detection framework, paraphrased\ntext span detection (PTD), aiming to identify paraphrased text spans within a\ntext. Different from text-level detection, PTD takes in the full text and\nassigns each of the sentences with a score indicating the paraphrasing degree.\nWe construct a dedicated dataset, PASTED, for paraphrased text span detection.\nBoth in-distribution and out-of-distribution results demonstrate the\neffectiveness of PTD models in identifying AI-paraphrased text spans.\nStatistical and model analysis explains the crucial role of the surrounding\ncontext of the paraphrased text spans. Extensive experiments show that PTD\nmodels can generalize to versatile paraphrasing prompts and multiple\nparaphrased text spans. We release our resources at\nhttps://github.com/Linzwcs/PASTED.", "paper_summary_zh": "AI 生成的文字偵測已吸引越來越多的關注，因為強大的語言模型接近人類層級的生成。有限的工作致力於偵測（部分）AI 改寫的文字。然而，AI 改寫通常用於各種應用場景中，以進行文字精煉和多元化。為此，我們提出一個新穎的偵測架構，改寫文字跨距偵測 (PTD)，旨在識別文字中的改寫文字跨距。不同於文字層級偵測，PTD 會輸入完整文字，並為每個句子指定一個分數，表示改寫程度。我們建構了一個專門的資料集 PASTED，用於改寫文字跨距偵測。分佈內和分佈外結果都證明了 PTD 模型在識別 AI 改寫文字跨距方面的有效性。統計和模型分析說明了改寫文字跨距周圍環境的重要角色。廣泛的實驗表明，PTD 模型可以概括為多功能改寫提示和多個改寫文字跨距。我們在 https://github.com/Linzwcs/PASTED 上發布我們的資源。", "author": "Yafu Li et.al.", "authors": "Yafu Li, Zhilin Wang, Leyang Cui, Wei Bi, Shuming Shi, Yue Zhang", "id": "2405.12689v1", "paper_url": "http://arxiv.org/abs/2405.12689v1", "repo": "null"}}