{"2409.15729": {"publish_time": "2024-09-24", "title": "Sequential Learning in the Dense Associative Memory", "paper_summary": "Sequential learning involves learning tasks in a sequence, and proves\nchallenging for most neural networks. Biological neural networks regularly\nconquer the sequential learning challenge and are even capable of transferring\nknowledge both forward and backwards between tasks. Artificial neural networks\noften totally fail to transfer performance between tasks, and regularly suffer\nfrom degraded performance or catastrophic forgetting on previous tasks. Models\nof associative memory have been used to investigate the discrepancy between\nbiological and artificial neural networks due to their biological ties and\ninspirations, of which the Hopfield network is perhaps the most studied model.\nThe Dense Associative Memory, or modern Hopfield network, generalizes the\nHopfield network, allowing for greater capacities and prototype learning\nbehaviors, while still retaining the associative memory structure. We\ninvestigate the performance of the Dense Associative Memory in sequential\nlearning problems, and benchmark various sequential learning techniques in the\nnetwork. We give a substantial review of the sequential learning space with\nparticular respect to the Hopfield network and associative memories, as well as\ndescribe the techniques we implement in detail. We also draw parallels between\nthe classical and Dense Associative Memory in the context of sequential\nlearning, and discuss the departures from biological inspiration that may\ninfluence the utility of the Dense Associative Memory as a tool for studying\nbiological neural networks. We present our findings, and show that existing\nsequential learning methods can be applied to the Dense Associative Memory to\nimprove sequential learning performance.", "paper_summary_zh": "序列學習涉及按順序學習任務，並證明對大多數神經網路而言具有挑戰性。生物神經網路定期克服序列學習挑戰，甚至能夠在任務之間向前和向後傳遞知識。人工神經網路通常無法在任務之間傳遞效能，並且經常遭受效能下降或先前任務的災難性遺忘。聯想記憶模型已被用於研究生物和人工神經網路之間的差異，因為它們具有生物聯繫和靈感，其中霍普菲爾德網路可能是研究最多的模型。密集聯想記憶或現代霍普菲爾德網路概括了霍普菲爾德網路，允許更大的容量和原型學習行為，同時仍保留聯想記憶結構。我們研究密集聯想記憶在序列學習問題中的效能，並在網路中對各種序列學習技術進行基準測試。我們對序列學習空間進行了實質性回顧，特別是關於霍普菲爾德網路和聯想記憶，並詳細描述了我們實作的技術。我們還在序列學習的背景下描繪了經典和密集聯想記憶之間的相似之處，並討論了可能影響密集聯想記憶作為研究生物神經網路工具的效用的生物靈感偏離。我們提出我們的發現，並表明現有的序列學習方法可以應用於密集聯想記憶以改善序列學習效能。", "author": "Hayden McAlister et.al.", "authors": "Hayden McAlister, Anthony Robins, Lech Szymanski", "id": "2409.15729v1", "paper_url": "http://arxiv.org/abs/2409.15729v1", "repo": "null"}}