{"2406.07954": {"publish_time": "2024-06-12", "title": "Dataset and Lessons Learned from the 2024 SaTML LLM Capture-the-Flag Competition", "paper_summary": "Large language model systems face important security risks from maliciously\ncrafted messages that aim to overwrite the system's original instructions or\nleak private data. To study this problem, we organized a capture-the-flag\ncompetition at IEEE SaTML 2024, where the flag is a secret string in the LLM\nsystem prompt. The competition was organized in two phases. In the first phase,\nteams developed defenses to prevent the model from leaking the secret. During\nthe second phase, teams were challenged to extract the secrets hidden for\ndefenses proposed by the other teams. This report summarizes the main insights\nfrom the competition. Notably, we found that all defenses were bypassed at\nleast once, highlighting the difficulty of designing a successful defense and\nthe necessity for additional research to protect LLM systems. To foster future\nresearch in this direction, we compiled a dataset with over 137k multi-turn\nattack chats and open-sourced the platform.", "paper_summary_zh": "大型語言模型系統面臨惡意製作訊息的重要安全風險，旨在覆寫系統的原始指令或洩露私人數據。為了研究這個問題，我們在 IEEE SaTML 2024 舉辦了一場攻防競賽，其中旗幟是 LLM 系統提示中的秘密字串。比賽分為兩個階段。在第一階段，團隊開發了防禦措施來防止模型洩露秘密。在第二階段，團隊面臨挑戰，必須找出其他團隊提出的防禦措施中隱藏的秘密。本報告總結了比賽的主要見解。值得注意的是，我們發現所有防禦措施都至少被繞過一次，這凸顯了設計成功防禦措施的難度，以及保護 LLM 系統的額外研究必要性。為了促進未來在這個方向的研究，我們編制了一個包含超過 137k 個多輪攻擊聊天記錄的資料集，並開放了平台的原始碼。", "author": "Edoardo Debenedetti et.al.", "authors": "Edoardo Debenedetti, Javier Rando, Daniel Paleka, Silaghi Fineas Florin, Dragos Albastroiu, Niv Cohen, Yuval Lemberg, Reshmi Ghosh, Rui Wen, Ahmed Salem, Giovanni Cherubin, Santiago Zanella-Beguelin, Robin Schmid, Victor Klemm, Takahiro Miki, Chenhao Li, Stefan Kraft, Mario Fritz, Florian Tramèr, Sahar Abdelnabi, Lea Schönherr", "id": "2406.07954v1", "paper_url": "http://arxiv.org/abs/2406.07954v1", "repo": "null"}}