{"2407.20371": {"publish_time": "2024-07-29", "title": "Gender, Race, and Intersectional Bias in Resume Screening via Language Model Retrieval", "paper_summary": "Artificial intelligence (AI) hiring tools have revolutionized resume\nscreening, and large language models (LLMs) have the potential to do the same.\nHowever, given the biases which are embedded within LLMs, it is unclear whether\nthey can be used in this scenario without disadvantaging groups based on their\nprotected attributes. In this work, we investigate the possibilities of using\nLLMs in a resume screening setting via a document retrieval framework that\nsimulates job candidate selection. Using that framework, we then perform a\nresume audit study to determine whether a selection of Massive Text Embedding\n(MTE) models are biased in resume screening scenarios. We simulate this for\nnine occupations, using a collection of over 500 publicly available resumes and\n500 job descriptions. We find that the MTEs are biased, significantly favoring\nWhite-associated names in 85.1\\% of cases and female-associated names in only\n11.1\\% of cases, with a minority of cases showing no statistically significant\ndifferences. Further analyses show that Black males are disadvantaged in up to\n100\\% of cases, replicating real-world patterns of bias in employment settings,\nand validate three hypotheses of intersectionality. We also find an impact of\ndocument length as well as the corpus frequency of names in the selection of\nresumes. These findings have implications for widely used AI tools that are\nautomating employment, fairness, and tech policy.", "paper_summary_zh": "人工智慧（AI）招聘工具徹底改變了履歷審查，而大型語言模型（LLM）也有潛力做到這一點。\n然而，鑑於 LLM 中存在偏見，目前尚不清楚是否可以在不讓群體因其受保護的屬性而處於不利地位的情況下使用 LLM。在這項工作中，我們透過模擬求職者甄選的文件檢索框架來探討在履歷審查設定中使用 LLM 的可能性。然後，我們使用該框架執行履歷稽核研究，以確定大規模文本嵌入（MTE）模型的選擇是否在履歷審查情境中存在偏見。我們模擬了九項職業，使用超過 500 份公開履歷和 500 份工作說明的集合。我們發現 MTE 存在偏見，在 85.1% 的情況下顯著偏好與白人相關的名字，而在只有 11.1% 的情況下偏好與女性相關的名字，少數情況沒有顯示出統計顯著差異。進一步的分析顯示，黑人男性在高達 100% 的情況下處於不利地位，複製了就業環境中偏見的真實模式，並驗證了三個交叉性的假設。我們還發現文件長度以及名字在履歷選擇中的語料庫頻率會產生影響。這些發現對廣泛使用的自動化就業、公平性和技術政策的 AI 工具具有影響。", "author": "Kyra Wilson et.al.", "authors": "Kyra Wilson, Aylin Caliskan", "id": "2407.20371v1", "paper_url": "http://arxiv.org/abs/2407.20371v1", "repo": "null"}}