{"2504.13173": {"publish_time": "2025-04-17", "title": "It's All Connected: A Journey Through Test-Time Memorization, Attentional Bias, Retention, and Online Optimization", "paper_summary": "Designing efficient and effective architectural backbones has been in the\ncore of research efforts to enhance the capability of foundation models.\nInspired by the human cognitive phenomenon of attentional bias-the natural\ntendency to prioritize certain events or stimuli-we reconceptualize neural\narchitectures, including Transformers, Titans, and modern linear recurrent\nneural networks as associative memory modules that learn a mapping of keys and\nvalues using an internal objective, referred to as attentional bias.\nSurprisingly, we observed that most existing sequence models leverage either\n(1) dot-product similarity, or (2) L2 regression objectives as their\nattentional bias. Going beyond these objectives, we present a set of\nalternative attentional bias configurations along with their effective\napproximations to stabilize their training procedure. We then reinterpret\nforgetting mechanisms in modern deep learning architectures as a form of\nretention regularization, providing a novel set of forget gates for sequence\nmodels. Building upon these insights, we present Miras, a general framework to\ndesign deep learning architectures based on four choices of: (i) associative\nmemory architecture, (ii) attentional bias objective, (iii) retention gate, and\n(iv) memory learning algorithm. We present three novel sequence models-Moneta,\nYaad, and Memora-that go beyond the power of existing linear RNNs while\nmaintaining a fast parallelizable training process. Our experiments show\ndifferent design choices in Miras yield models with varying strengths. For\nexample, certain instances of Miras achieve exceptional performance in special\ntasks such as language modeling, commonsense reasoning, and recall intensive\ntasks, even outperforming Transformers and other modern linear recurrent\nmodels.", "paper_summary_zh": "<paragraph>設計高效且有效的架構骨幹一直是提升基礎模型能力的核心研究方向。受人類認知現象「注意力偏差」（一種優先關注特定事件或刺激的自然傾向）的啟發，我們重新構思了神經架構，包括 Transformers、Titans 和現代線性遞迴神經網路，將其視為關聯記憶體模組，這些模組使用稱為注意力偏差的內部目標來學習鍵和值的映射。令人驚訝的是，我們觀察到大多數現有的序列模型都利用 (1) 點積相似度或 (2) L2 迴歸目標作為其注意力偏差。除了這些目標之外，我們還提出了一組替代的注意力偏差配置及其有效近似值，以穩定其訓練過程。然後，我們將現代深度學習架構中的遺忘機制重新詮釋為一種保留正規化，為序列模型提供了一組新穎的遺忘閘門。基於這些見解，我們提出了 Miras，這是一個基於以下四種選擇來設計深度學習架構的通用框架：(i) 關聯記憶體架構，(ii) 注意力偏差目標，(iii) 保留閘門，以及 (iv) 記憶體學習演算法。我們提出了三種新穎的序列模型：Moneta、Yaad 和 Memora，它們超越了現有線性 RNN 的能力，同時保持了快速的並行化訓練過程。我們的實驗表明，Miras 中不同的設計選擇會產生具有不同優勢的模型。例如，Miras 的某些實例在特殊任務（例如語言建模、常識推理和記憶密集型任務）中取得了卓越的性能，甚至超越了 Transformers 和其他現代線性遞迴模型。</paragraph>\n", "author": "Ali Behrouz et.al.", "authors": "Ali Behrouz, Meisam Razaviyayn, Peilin Zhong, Vahab Mirrokni", "id": "2504.13173v1", "paper_url": "http://arxiv.org/abs/2504.13173v1", "repo": "null"}}