{"2405.18203": {"publish_time": "2024-05-28", "title": "IAPT: Instruction-Aware Prompt Tuning for Large Language Models", "paper_summary": "Soft prompt tuning is a widely studied parameter-efficient fine-tuning\nmethod. However, it has a clear drawback: many soft tokens must be inserted\ninto the input sequences to guarantee downstream performance. As a result, soft\nprompt tuning is less considered than Low-rank adaptation (LoRA) in the large\nlanguage modeling (LLM) era. In this work, we propose a novel prompt tuning\nmethod, Instruction-Aware Prompt Tuning (IAPT), that requires only four soft\ntokens. First, we install a parameter-efficient soft prompt generator at each\nTransformer layer to generate idiosyncratic soft prompts for each input\ninstruction. The generated soft prompts can be seen as a semantic summary of\nthe input instructions and can effectively guide the output generation. Second,\nthe soft prompt generators are modules with a bottleneck architecture\nconsisting of a self-attention pooling operation, two linear projections, and\nan activation function. Pilot experiments show that prompt generators at\ndifferent Transformer layers require different activation functions. Thus, we\npropose to learn the idiosyncratic activation functions for prompt generators\nautomatically with the help of rational functions. We have conducted\nexperiments on various tasks, and the experimental results demonstrate that (a)\nour IAPT method can outperform the recent baselines with comparable tunable\nparameters. (b) Our IAPT method is more efficient than LoRA under the\nsingle-backbone multi-tenant setting.", "paper_summary_zh": "軟提示調整是一種廣泛研究的參數有效微調方法。然而，它有一個明顯的缺點：必須將許多軟標記插入輸入序列中以保證下游性能。因此，在大型語言建模 (LLM) 時代，軟提示調整不如低秩適應 (LoRA) 受重視。在這項工作中，我們提出了一種新穎的提示調整方法，即指令感知提示調整 (IAPT)，它只需要四個軟標記。首先，我們在每個 Transformer 層安裝一個參數高效的軟提示生成器，為每個輸入指令生成獨特的軟提示。生成的軟提示可以看作是輸入指令的語義摘要，並且可以有效地指導輸出生成。其次，軟提示生成器是具有瓶頸架構的模組，包括自注意力池化操作、兩個線性投影和一個激活函數。試驗表明，不同 Transformer 層的提示生成器需要不同的激活函數。因此，我們提出使用有理函數的幫助自動學習提示生成器的獨特激活函數。我們對各種任務進行了實驗，實驗結果表明：(a) 我們的 IAPT 方法可以在具有可比較可調參數的情況下優於最近的基準。(b) 在單骨幹多租戶設置下，我們的 IAPT 方法比 LoRA 更有效率。", "author": "Wei Zhu et.al.", "authors": "Wei Zhu, Aaron Xuxiang Tian, Congrui Yin, Yuan Ni, Xiaoling Wang, Guotong Xie", "id": "2405.18203v1", "paper_url": "http://arxiv.org/abs/2405.18203v1", "repo": "null"}}