{"2405.00623": {"publish_time": "2024-05-01", "title": "\"I'm Not Sure, But...\": Examining the Impact of Large Language Models' Uncertainty Expression on User Reliance and Trust", "paper_summary": "Widely deployed large language models (LLMs) can produce convincing yet\nincorrect outputs, potentially misleading users who may rely on them as if they\nwere correct. To reduce such overreliance, there have been calls for LLMs to\ncommunicate their uncertainty to end users. However, there has been little\nempirical work examining how users perceive and act upon LLMs' expressions of\nuncertainty. We explore this question through a large-scale, pre-registered,\nhuman-subject experiment (N=404) in which participants answer medical questions\nwith or without access to responses from a fictional LLM-infused search engine.\nUsing both behavioral and self-reported measures, we examine how different\nnatural language expressions of uncertainty impact participants' reliance,\ntrust, and overall task performance. We find that first-person expressions\n(e.g., \"I'm not sure, but...\") decrease participants' confidence in the system\nand tendency to agree with the system's answers, while increasing participants'\naccuracy. An exploratory analysis suggests that this increase can be attributed\nto reduced (but not fully eliminated) overreliance on incorrect answers. While\nwe observe similar effects for uncertainty expressed from a general perspective\n(e.g., \"It's not clear, but...\"), these effects are weaker and not\nstatistically significant. Our findings suggest that using natural language\nexpressions of uncertainty may be an effective approach for reducing\noverreliance on LLMs, but that the precise language used matters. This\nhighlights the importance of user testing before deploying LLMs at scale.", "paper_summary_zh": "", "author": "Sunnie S. Y. Kim et.al.", "authors": "Sunnie S. Y. Kim,Q. Vera Liao,Mihaela Vorvoreanu,Stephanie Ballard,Jennifer Wortman Vaughan", "id": "2405.00623v1", "paper_url": "http://arxiv.org/abs/2405.00623v1", "repo": "null"}}