{"2405.09595": {"publish_time": "2024-05-15", "title": "Simplicity within biological complexity", "paper_summary": "Heterogeneous, interconnected, systems-level, molecular data have become\nincreasingly available and key in precision medicine. We need to utilize them\nto better stratify patients into risk groups, discover new biomarkers and\ntargets, repurpose known and discover new drugs to personalize medical\ntreatment. Existing methodologies are limited and a paradigm shift is needed to\nachieve quantitative and qualitative breakthroughs. In this perspective paper,\nwe survey the literature and argue for the development of a comprehensive,\ngeneral framework for embedding of multi-scale molecular network data that\nwould enable their explainable exploitation in precision medicine in linear\ntime. Network embedding methods map nodes to points in low-dimensional space,\nso that proximity in the learned space reflects the network's topology-function\nrelationships. They have recently achieved unprecedented performance on hard\nproblems of utilizing few omic data in various biomedical applications.\nHowever, research thus far has been limited to special variants of the problems\nand data, with the performance depending on the underlying topology-function\nnetwork biology hypotheses, the biomedical applications and evaluation metrics.\nThe availability of multi-omic data, modern graph embedding paradigms and\ncompute power call for a creation and training of efficient, explainable and\ncontrollable models, having no potentially dangerous, unexpected behaviour,\nthat make a qualitative breakthrough. We propose to develop a general,\ncomprehensive embedding framework for multi-omic network data, from models to\nefficient and scalable software implementation, and to apply it to biomedical\ninformatics. It will lead to a paradigm shift in computational and biomedical\nunderstanding of data and diseases that will open up ways to solving some of\nthe major bottlenecks in precision medicine and other domains.", "paper_summary_zh": "異質、相互連接、系統層級的分子資料已變得越來越容易取得，並成為精準醫療的關鍵。我們需要利用它們將患者更精確地分層到風險群組中，發現新的生物標記和目標，重新利用已知的藥物並發現新的藥物以個人化醫療治療。現有的方法論有限，需要範式轉移才能實現量化和質化的突破。在這篇觀點文章中，我們調查了文獻並主張開發一個全面的通用框架，用於嵌入多尺度分子網路資料，這將使它們能夠在線性時間內在精準醫療中進行可解釋的利用。網路嵌入方法將節點映射到低維空間中的點，以便在學習空間中的接近度反映網路的拓撲功能關係。它們最近在利用少數組學資料解決各種生物醫學應用中的困難問題方面取得了前所未有的效能。然而，迄今為止的研究僅限於問題和資料的特殊變體，其效能取決於基礎的拓撲功能網路生物學假設、生物醫學應用和評估指標。多組學資料、現代圖形嵌入範例和運算能力的可用性要求建立和訓練有效、可解釋和可控的模型，這些模型沒有潛在的危險、意外的行為，並能取得質化的突破。我們建議開發一個通用的、全面的嵌入框架，用於多組學網路資料，從模型到高效且可擴充的軟體實作，並將其應用於生物醫學資訊學。這將導致對資料和疾病的計算和生物醫學理解的範式轉移，這將開啟解決精準醫療和其他領域中一些主要瓶頸的方法。", "author": "Natasa Przulj et.al.", "authors": "Natasa Przulj, Noel Malod-Dognin", "id": "2405.09595v1", "paper_url": "http://arxiv.org/abs/2405.09595v1", "repo": "null"}}