{"2502.14504": {"publish_time": "2025-02-20", "title": "PLPHP: Per-Layer Per-Head Vision Token Pruning for Efficient Large Vision-Language Models", "paper_summary": "Large Vision-Language Models (LVLMs) have demonstrated remarkable\ncapabilities across a range of multimodal tasks. However, their inference\nefficiency is constrained by the large number of visual tokens processed during\ndecoding. To address this challenge, we propose Per-Layer Per-Head Vision Token\nPruning (PLPHP), a two-level fine-grained pruning method including Layer-Level\nRetention Rate Allocation and Head-Level Vision Token Pruning. Motivated by the\nVision Token Re-attention phenomenon across decoder layers, we dynamically\nadjust token retention rates layer by layer. Layers that exhibit stronger\nattention to visual information preserve more vision tokens, while layers with\nlower vision attention are aggressively pruned. Furthermore, PLPHP applies\npruning at the attention head level, enabling different heads within the same\nlayer to independently retain critical context. Experiments on multiple\nbenchmarks demonstrate that PLPHP delivers an 18% faster decoding speed and\nreduces the Key-Value Cache (KV Cache) size by over 50%, all at the cost of\n0.46% average performance drop, while also achieving notable performance\nimprovements in multi-image tasks. These results highlight the effectiveness of\nfine-grained token pruning and contribute to advancing the efficiency and\nscalability of LVLMs. Our source code will be made publicly available.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 已在各種多模態任務中展現出非凡的能力。然而，其推理效率受到解碼過程中處理的大量視覺符號的限制。為了應對這一挑戰，我們提出逐層逐頭視覺符號剪枝 (PLPHP)，這是一種包括層級保留率分配和頭級視覺符號剪枝的兩級細粒度剪枝方法。受解碼器層中視覺符號重新關注現象的啟發，我們動態地逐層調整符號保留率。對視覺資訊表現出更強關注力的層保留更多視覺符號，而視覺關注力較低的層則被積極剪枝。此外，PLPHP 在關注頭級別應用剪枝，使同一層中的不同頭部可以獨立保留關鍵上下文。在多個基準測試上的實驗表明，PLPHP 的解碼速度提高了 18%，且將鍵值快取 (KV 快取) 大小減少了 50% 以上，而代價僅為平均效能下降 0.46%，同時還在多影像任務中實現了顯著的效能提升。這些結果突顯了細粒度符號剪枝的有效性，並有助於提升 LVLMs 的效率和可擴充性。我們的原始碼將公開提供。", "author": "Yu Meng et.al.", "authors": "Yu Meng, Kaiyuan Li, Chenran Huang, Chen Gao, Xinlei Chen, Yong Li, Xiaoping Zhang", "id": "2502.14504v1", "paper_url": "http://arxiv.org/abs/2502.14504v1", "repo": "null"}}