{"2402.15027": {"publish_time": "2024-02-22", "title": "Multi-stakeholder Perspective on Responsible Artificial Intelligence and Acceptability in Education", "paper_summary": "This study investigates the acceptability of different artificial\nintelligence (AI) applications in education from a multi-stakeholder\nperspective, including students, teachers, and parents. Acknowledging the\ntransformative potential of AI in education, it addresses concerns related to\ndata privacy, AI agency, transparency, explainability and the ethical\ndeployment of AI. Through a vignette methodology, participants were presented\nwith four scenarios where AI's agency, transparency, explainability, and\nprivacy were manipulated. After each scenario, participants completed a survey\nthat captured their perceptions of AI's global utility, individual usefulness,\njustice, confidence, risk, and intention to use each scenario's AI if\navailable. The data collection comprising a final sample of 1198\nmulti-stakeholder participants was distributed through a partner institution\nand social media campaigns and focused on individual responses to four AI use\ncases. A mediation analysis of the data indicated that acceptance and trust in\nAI varies significantly across stakeholder groups. We found that the key\nmediators between high and low levels of AI's agency, transparency, and\nexplainability, as well as the intention to use the different educational AI,\nincluded perceived global utility, justice, and confidence. The study\nhighlights that the acceptance of AI in education is a nuanced and multifaceted\nissue that requires careful consideration of specific AI applications and their\ncharacteristics, in addition to the diverse stakeholders' perceptions.", "paper_summary_zh": "", "author": "A. J. Karran et.al.", "authors": "A. J. Karran,P. Charland,J-T. Martineau,A. Ortiz de Guinea Lopez de Arana,AM. Lesage,S. Senecal,P-M. Leger", "id": "2402.15027v2", "paper_url": "http://arxiv.org/abs/2402.15027v2", "repo": "null"}}