{"2409.12191": {"publish_time": "2024-09-18", "title": "Qwen2-VL: Enhancing Vision-Language Model's Perception of the World at Any Resolution", "paper_summary": "We present the Qwen2-VL Series, an advanced upgrade of the previous Qwen-VL\nmodels that redefines the conventional predetermined-resolution approach in\nvisual processing. Qwen2-VL introduces the Naive Dynamic Resolution mechanism,\nwhich enables the model to dynamically process images of varying resolutions\ninto different numbers of visual tokens. This approach allows the model to\ngenerate more efficient and accurate visual representations, closely aligning\nwith human perceptual processes. The model also integrates Multimodal Rotary\nPosition Embedding (M-RoPE), facilitating the effective fusion of positional\ninformation across text, images, and videos. We employ a unified paradigm for\nprocessing both images and videos, enhancing the model's visual perception\ncapabilities. To explore the potential of large multimodal models, Qwen2-VL\ninvestigates the scaling laws for large vision-language models (LVLMs). By\nscaling both the model size-with versions at 2B, 8B, and 72B parameters-and the\namount of training data, the Qwen2-VL Series achieves highly competitive\nperformance. Notably, the Qwen2-VL-72B model achieves results comparable to\nleading models such as GPT-4o and Claude3.5-Sonnet across various multimodal\nbenchmarks, outperforming other generalist models. Code is available at\n\\url{https://github.com/QwenLM/Qwen2-VL}.", "paper_summary_zh": "我們提出了 Qwen2-VL 系列，這是先前 Qwen-VL 模型的先進升級版，重新定義了視覺處理中傳統的預先設定解析度方法。Qwen2-VL 引入了 Naive Dynamic Resolution 機制，使模型能夠動態處理不同解析度的影像，並轉換成不同數量的視覺符號。此方法讓模型能夠產生更有效率且精確的視覺表示，與人類的知覺過程緊密結合。該模型還整合了多模態旋轉位置嵌入 (M-RoPE)，促進跨文本、影像和影片的位置資訊有效融合。我們採用統一的範例來處理影像和影片，增強模型的視覺感知能力。為了探索大型多模態模型的潛力，Qwen2-VL 探討了大型視覺語言模型 (LVLMs) 的規模定律。透過擴充模型大小（版本有 2B、8B 和 72B 參數）和訓練資料量，Qwen2-VL 系列達到了極具競爭力的效能。值得注意的是，Qwen2-VL-72B 模型在各種多模態基準測試中達到了與 GPT-4o 和 Claude3.5-Sonnet 等領先模型相當的結果，優於其他通用模型。程式碼可以在 \\url{https://github.com/QwenLM/Qwen2-VL} 取得。", "author": "Peng Wang et.al.", "authors": "Peng Wang, Shuai Bai, Sinan Tan, Shijie Wang, Zhihao Fan, Jinze Bai, Keqin Chen, Xuejing Liu, Jialin Wang, Wenbin Ge, Yang Fan, Kai Dang, Mengfei Du, Xuancheng Ren, Rui Men, Dayiheng Liu, Chang Zhou, Jingren Zhou, Junyang Lin", "id": "2409.12191v1", "paper_url": "http://arxiv.org/abs/2409.12191v1", "repo": "https://github.com/qwenlm/qwen2-vl"}}