{"2501.10319": {"publish_time": "2025-01-17", "title": "Natural Language Processing of Privacy Policies: A Survey", "paper_summary": "Natural Language Processing (NLP) is an essential subset of artificial\nintelligence. It has become effective in several domains, such as healthcare,\nfinance, and media, to identify perceptions, opinions, and misuse, among\nothers. Privacy is no exception, and initiatives have been taken to address the\nchallenges of usable privacy notifications to users with the help of NLP. To\nthis aid, we conduct a literature review by analyzing 109 papers at the\nintersection of NLP and privacy policies. First, we provide a brief\nintroduction to privacy policies and discuss various facets of associated\nproblems, which necessitate the application of NLP to elevate the current state\nof privacy notices and disclosures to users. Subsequently, we a) provide an\noverview of the implementation and effectiveness of NLP approaches for better\nprivacy policy communication; b) identify the methodologies that can be further\nenhanced to provide robust privacy policies; and c) identify the gaps in the\ncurrent state-of-the-art research. Our systematic analysis reveals that several\nresearch papers focus on annotating and classifying privacy texts for analysis\nbut need to adequately dwell on other aspects of NLP applications, such as\nsummarization. More specifically, ample research opportunities exist in this\ndomain, covering aspects such as corpus generation, summarization vectors,\ncontextualized word embedding, identification of privacy-relevant statement\ncategories, fine-grained classification, and domain-specific model tuning.", "paper_summary_zh": "自然語言處理 (NLP) 是人工智慧的重要子集。它已在醫療保健、金融和媒體等多個領域發揮作用，用於識別感知、意見和濫用等。隱私也不例外，並且已經採取了一些措施，借助 NLP 來解決可用的隱私通知對使用者的挑戰。為此，我們透過分析 109 篇 NLP 和隱私政策交集的論文來進行文獻探討。首先，我們簡要介紹隱私政策，並討論相關問題的各個方面，這需要應用 NLP 來提升當前隱私通知和使用者揭露的狀態。隨後，我們 a) 提供 NLP 方法在改善隱私政策傳達方面的實作和有效性概觀；b) 找出可以進一步增強以提供穩健隱私政策的方法；以及 c) 找出目前最先進的研究現況中的差距。我們的系統分析顯示，許多研究論文專注於註解和分類隱私文字以進行分析，但需要適當地探討 NLP 應用程式的其他方面，例如摘要。更具體地說，這個領域存在大量的研究機會，涵蓋語料庫產生、摘要向量、語境化詞嵌入、隱私相關陳述類別的識別、細粒度分類和特定領域模型調整等方面。", "author": "Andrick Adhikari et.al.", "authors": "Andrick Adhikari, Sanchari Das, Rinku Dewri", "id": "2501.10319v1", "paper_url": "http://arxiv.org/abs/2501.10319v1", "repo": "null"}}