{"2504.11544": {"publish_time": "2025-04-15", "title": "NodeRAG: Structuring Graph-based RAG with Heterogeneous Nodes", "paper_summary": "Retrieval-augmented generation (RAG) empowers large language models to access\nexternal and private corpus, enabling factually consistent responses in\nspecific domains. By exploiting the inherent structure of the corpus,\ngraph-based RAG methods further enrich this process by building a knowledge\ngraph index and leveraging the structural nature of graphs. However, current\ngraph-based RAG approaches seldom prioritize the design of graph structures.\nInadequately designed graph not only impede the seamless integration of diverse\ngraph algorithms but also result in workflow inconsistencies and degraded\nperformance. To further unleash the potential of graph for RAG, we propose\nNodeRAG, a graph-centric framework introducing heterogeneous graph structures\nthat enable the seamless and holistic integration of graph-based methodologies\ninto the RAG workflow. By aligning closely with the capabilities of LLMs, this\nframework ensures a fully cohesive and efficient end-to-end process. Through\nextensive experiments, we demonstrate that NodeRAG exhibits performance\nadvantages over previous methods, including GraphRAG and LightRAG, not only in\nindexing time, query time, and storage efficiency but also in delivering\nsuperior question-answering performance on multi-hop benchmarks and open-ended\nhead-to-head evaluations with minimal retrieval tokens. Our GitHub repository\ncould be seen at https://github.com/Terry-Xu-666/NodeRAG.", "paper_summary_zh": "<paragraph>檢索增強生成 (RAG) 使大型語言模型能夠訪問外部和私有語料庫，從而在特定領域中生成事實一致的響應。基於圖的 RAG 方法通過構建知識圖譜索引並利用圖的結構特性，進一步利用語料庫的內在結構來豐富此過程。然而，目前基於圖的 RAG 方法很少優先考慮圖結構的設計。設計不當的圖不僅會阻礙各種圖算法的無縫集成，還會導致工作流程不一致和性能下降。為了進一步釋放圖在 RAG 中的潛力，我們提出了NodeRAG，一個以圖為中心的框架，引入了異構圖結構，使基於圖的方法能夠無縫、全面地集成到 RAG 工作流程中。通過與大型語言模型的功能緊密結合，該框架確保了完全一致且高效的端到端流程。通過大量實驗，我們證明 NodeRAG 的性能優於先前的方法，包括 GraphRAG 和 LightRAG，不僅在索引時間、查詢時間和存儲效率方面，而且在多跳基準測試和開放式與最小檢索token的頭對頭評估中提供卓越的問答性能。我們的 GitHub 儲存庫可以在 https://github.com/Terry-Xu-666/NodeRAG 找到。</paragraph>\n", "author": "Tianyang Xu et.al.", "authors": "Tianyang Xu, Haojie Zheng, Chengze Li, Haoxiang Chen, Yixin Liu, Ruoxi Chen, Lichao Sun", "id": "2504.11544v1", "paper_url": "http://arxiv.org/abs/2504.11544v1", "repo": "null"}}