{"2411.09507": {"publish_time": "2024-11-14", "title": "Toward a Cohesive AI and Simulation Software Ecosystem for Scientific Innovation", "paper_summary": "In this paper, we discuss the need for an integrated software stack that\nunites artificial intelligence (AI) and modeling and simulation (ModSim) tools\nto advance scientific discovery. The authors advocate for a unified AI/ModSim\nsoftware ecosystem that ensures compatibility across a wide range of software\non diverse high-performance computing systems, promoting ease of deployment,\nversion management, and binary distribution. Key challenges highlighted include\nbalancing the distinct needs of AI and ModSim, especially in terms of software\nbuild practices, dependency management, and compatibility. The document\nunderscores the importance of continuous integration, community-driven\nstewardship, and collaboration with the Department of Energy (DOE) to develop a\nportable and cohesive scientific software ecosystem. Recommendations focus on\nsupporting standardized environments through initiatives like the Extreme-scale\nScientific Software Stack (E4S) and Spack to foster interdisciplinary\ninnovation and facilitate new scientific advancements.", "paper_summary_zh": "在本文中，我們討論了整合軟體堆疊的需求，它結合了人工智慧 (AI) 和建模與模擬 (ModSim) 工具，以推進科學發現。作者提倡統一的 AI/ModSim 軟體生態系統，以確保在各種軟體中相容性，涵蓋多樣化的高效能運算系統，促進部署、版本管理和二進位制發行。重點挑戰包括平衡 AI 和 ModSim 的不同需求，特別是在軟體建置實務、依賴管理和相容性方面。本文強調持續整合、社群驅動管理和與能源部 (DOE) 合作，以開發可攜式且有凝聚力的科學軟體生態系統。建議重點在於透過極端規模科學軟體堆疊 (E4S) 和 Spack 等計畫支援標準化環境，以促進跨領域創新並促進新的科學進展。", "author": "Michael A. Heroux et.al.", "authors": "Michael A. Heroux, Sameer Shende, Lois Curfman McInnes, Todd Gamblin, James M. Willenbring", "id": "2411.09507v1", "paper_url": "http://arxiv.org/abs/2411.09507v1", "repo": "null"}}