{"2410.20746": {"publish_time": "2024-10-28", "title": "ElectionSim: Massive Population Election Simulation Powered by Large Language Model Driven Agents", "paper_summary": "The massive population election simulation aims to model the preferences of\nspecific groups in particular election scenarios. It has garnered significant\nattention for its potential to forecast real-world social trends. Traditional\nagent-based modeling (ABM) methods are constrained by their ability to\nincorporate complex individual background information and provide interactive\nprediction results. In this paper, we introduce ElectionSim, an innovative\nelection simulation framework based on large language models, designed to\nsupport accurate voter simulations and customized distributions, together with\nan interactive platform to dialogue with simulated voters. We present a\nmillion-level voter pool sampled from social media platforms to support\naccurate individual simulation. We also introduce PPE, a poll-based\npresidential election benchmark to assess the performance of our framework\nunder the U.S. presidential election scenario. Through extensive experiments\nand analyses, we demonstrate the effectiveness and robustness of our framework\nin U.S. presidential election simulations.", "paper_summary_zh": "大規模人口選舉模擬旨在模擬特定群體在特定選舉情境中的偏好。它因其預測現實世界社會趨勢的潛力而備受關注。傳統的基於主體的建模 (ABM) 方法受到其整合複雜的個人背景資訊和提供互動預測結果的能力的限制。在本文中，我們介紹了 ElectionSim，這是一個創新的選舉模擬框架，基於大型語言模型，旨在支援準確的選民模擬和客製化分佈，並結合一個互動平台與模擬選民對話。我們展示了一個從社群媒體平台取樣的百萬級選民庫，以支援準確的個人模擬。我們還介紹了 PPE，一個基於民意調查的總統選舉基準，用於評估我們框架在美國總統選舉情境下的效能。透過廣泛的實驗和分析，我們證明了我們框架在美國總統選舉模擬中的有效性和穩健性。", "author": "Xinnong Zhang et.al.", "authors": "Xinnong Zhang, Jiayu Lin, Libo Sun, Weihong Qi, Yihang Yang, Yue Chen, Hanjia Lyu, Xinyi Mou, Siming Chen, Jiebo Luo, Xuanjing Huang, Shiping Tang, Zhongyu Wei", "id": "2410.20746v1", "paper_url": "http://arxiv.org/abs/2410.20746v1", "repo": "null"}}