{"2411.04865": {"publish_time": "2024-11-07", "title": "ZAHA: Introducing the Level of Facade Generalization and the Large-Scale Point Cloud Facade Semantic Segmentation Benchmark Dataset", "paper_summary": "Facade semantic segmentation is a long-standing challenge in photogrammetry\nand computer vision. Although the last decades have witnessed the influx of\nfacade segmentation methods, there is a lack of comprehensive facade classes\nand data covering the architectural variability. In ZAHA, we introduce Level of\nFacade Generalization (LoFG), novel hierarchical facade classes designed based\non international urban modeling standards, ensuring compatibility with\nreal-world challenging classes and uniform methods' comparison. Realizing the\nLoFG, we present to date the largest semantic 3D facade segmentation dataset,\nproviding 601 million annotated points at five and 15 classes of LoFG2 and\nLoFG3, respectively. Moreover, we analyze the performance of baseline semantic\nsegmentation methods on our introduced LoFG classes and data, complementing it\nwith a discussion on the unresolved challenges for facade segmentation. We\nfirmly believe that ZAHA shall facilitate further development of 3D facade\nsemantic segmentation methods, enabling robust segmentation indispensable in\ncreating urban digital twins.", "paper_summary_zh": "外觀語義分割是攝影測量和電腦視覺中長期存在的挑戰。儘管在過去的幾十年中見證了外觀分割方法的湧入，但仍缺乏涵蓋建築可變性的綜合外觀類別和資料。在 ZAHA 中，我們引入了外觀概括層級 (LoFG)，一種基於國際城市建模標準設計的新階層式外觀類別，確保與現實世界中的挑戰性類別和統一方法的比較相容。實現 LoFG 後，我們迄今為止提供了最大的語義 3D 外觀分割資料集，分別在 LoFG2 和 LoFG3 的五個和 15 個類別中提供了 6 億個註解點。此外，我們分析了基線語義分割方法在其引入的 LoFG 類別和資料上的效能，並補充討論了外觀分割中未解決的挑戰。我們堅信 ZAHA 將促進 3D 外觀語義分割方法的進一步發展，實現強健的分割，這對於建立城市數位雙胞胎至關重要。", "author": "Olaf Wysocki et.al.", "authors": "Olaf Wysocki, Yue Tan, Thomas Froech, Yan Xia, Magdalena Wysocki, Ludwig Hoegner, Daniel Cremers, Christoph Holst", "id": "2411.04865v1", "paper_url": "http://arxiv.org/abs/2411.04865v1", "repo": "https://github.com/oloocki/zaha"}}