{"2406.16479": {"publish_time": "2024-06-24", "title": "Emerging NeoHebbian Dynamics in Forward-Forward Learning: Implications for Neuromorphic Computing", "paper_summary": "Advances in neural computation have predominantly relied on the gradient\nbackpropagation algorithm (BP). However, the recent shift towards\nnon-stationary data modeling has highlighted the limitations of this heuristic,\nexposing that its adaptation capabilities are far from those seen in biological\nbrains. Unlike BP, where weight updates are computed through a reverse error\npropagation path, Hebbian learning dynamics provide synaptic updates using only\ninformation within the layer itself. This has spurred interest in biologically\nplausible learning algorithms, hypothesized to overcome BP's shortcomings. In\nthis context, Hinton recently introduced the Forward-Forward Algorithm (FFA),\nwhich employs local learning rules for each layer and has empirically proven\nits efficacy in multiple data modeling tasks. In this work we argue that when\nemploying a squared Euclidean norm as a goodness function driving the local\nlearning, the resulting FFA is equivalent to a neo-Hebbian Learning Rule. To\nverify this result, we compare the training behavior of FFA in analog networks\nwith its Hebbian adaptation in spiking neural networks. Our experiments\ndemonstrate that both versions of FFA produce similar accuracy and latent\ndistributions. The findings herein reported provide empirical evidence linking\nbiological learning rules with currently used training algorithms, thus paving\nthe way towards extrapolating the positive outcomes from FFA to Hebbian\nlearning rules. Simultaneously, our results imply that analog networks trained\nunder FFA could be directly applied to neuromorphic computing, leading to\nreduced energy usage and increased computational speed.", "paper_summary_zh": "神經運算的進展主要依賴於梯度反向傳播演算法 (BP)。然而，最近朝向非平穩資料建模的轉變突顯了這種啟發法的限制，揭露其適應能力遠低於生物大腦。與 BP 不同，其中權重更新是透過反向誤差傳播路徑計算，赫布學習動態僅使用層本身內的資訊提供突觸更新。這激發了對生物上合理的學習演算法的興趣，假設可以克服 BP 的缺點。在此脈絡中，Hinton 最近引入了正向正向演算法 (FFA)，它為每一層採用局部學習規則，並在其效能上經過多項資料建模任務的實證證明。在這項工作中，我們主張，當採用平方歐幾里得範數作為驅動局部學習的適當性函數時，所產生的 FFA 等同於新赫布學習規則。為了驗證此結果，我們比較類比網路中 FFA 的訓練行為與其在脈衝神經網路中的赫布適應。我們的實驗證明，FFA 的兩個版本都產生類似的準確度和潛在分佈。本文報告的發現提供實證，將生物學習規則與目前使用的訓練演算法連結，因此為從 FFA 推論出赫布學習規則的正面結果鋪路。同時，我們的結果暗示，在 FFA 下訓練的類比網路可以直接應用於類腦運算，進而減少能源使用並提升運算速度。", "author": "Erik B. Terres-Escudero et.al.", "authors": "Erik B. Terres-Escudero, Javier Del Ser, Pablo García-Bringas", "id": "2406.16479v1", "paper_url": "http://arxiv.org/abs/2406.16479v1", "repo": "https://github.com/erikberter/hebbian_ffa"}}