{"2412.13324": {"publish_time": "2024-12-17", "title": "BadSAD: Clean-Label Backdoor Attacks against Deep Semi-Supervised Anomaly Detection", "paper_summary": "Image anomaly detection (IAD) is essential in applications such as industrial\ninspection, medical imaging, and security. Despite the progress achieved with\ndeep learning models like Deep Semi-Supervised Anomaly Detection (DeepSAD),\nthese models remain susceptible to backdoor attacks, presenting significant\nsecurity challenges. In this paper, we introduce BadSAD, a novel backdoor\nattack framework specifically designed to target DeepSAD models. Our approach\ninvolves two key phases: trigger injection, where subtle triggers are embedded\ninto normal images, and latent space manipulation, which positions and clusters\nthe poisoned images near normal images to make the triggers appear benign.\nExtensive experiments on benchmark datasets validate the effectiveness of our\nattack strategy, highlighting the severe risks that backdoor attacks pose to\ndeep learning-based anomaly detection systems.", "paper_summary_zh": "影像異常偵測（IAD）在工業檢查、醫療影像和安全等應用中至關重要。儘管深度學習模型（如深度半監督異常偵測（DeepSAD））已取得進展，但這些模型仍然容易受到後門攻擊，造成重大的安全挑戰。在本文中，我們介紹 BadSAD，一個專門針對 DeepSAD 模型設計的新型後門攻擊架構。我們的做法包含兩個關鍵階段：觸發注入，其中將細微觸發嵌入到正常影像中，以及潛在空間操作，將中毒影像定位並群集在正常影像附近，以使觸發看起來是良性的。在基準資料集上進行的廣泛實驗驗證了我們攻擊策略的有效性，突顯了後門攻擊對基於深度學習的異常偵測系統造成的嚴重風險。", "author": "He Cheng et.al.", "authors": "He Cheng, Depeng Xu, Shuhan Yuan", "id": "2412.13324v1", "paper_url": "http://arxiv.org/abs/2412.13324v1", "repo": "null"}}