{"2410.13396": {"publish_time": "2024-10-17", "title": "Linguistically Grounded Analysis of Language Models using Shapley Head Values", "paper_summary": "Understanding how linguistic knowledge is encoded in language models is\ncrucial for improving their generalisation capabilities. In this paper, we\ninvestigate the processing of morphosyntactic phenomena, by leveraging a\nrecently proposed method for probing language models via Shapley Head Values\n(SHVs). Using the English language BLiMP dataset, we test our approach on two\nwidely used models, BERT and RoBERTa, and compare how linguistic constructions\nsuch as anaphor agreement and filler-gap dependencies are handled. Through\nquantitative pruning and qualitative clustering analysis, we demonstrate that\nattention heads responsible for processing related linguistic phenomena cluster\ntogether. Our results show that SHV-based attributions reveal distinct patterns\nacross both models, providing insights into how language models organize and\nprocess linguistic information. These findings support the hypothesis that\nlanguage models learn subnetworks corresponding to linguistic theory, with\npotential implications for cross-linguistic model analysis and interpretability\nin Natural Language Processing (NLP).", "paper_summary_zh": "理解语言模型如何对语言知识进行编码对于提升其泛化能力至关重要。在本文中，我们通过利用一种最近提出的方法来探查语言模型，该方法通过 Shapley Head Values (SHV) 来探查语言模型，从而研究形态句法现象的处理。使用英语 BLiMP 数据集，我们在两个广泛使用的模型 BERT 和 RoBERTa 上测试我们的方法，并比较了语言结构（例如代词一致性和填充词-空缺依赖关系）是如何被处理的。通过定量剪枝和定性聚类分析，我们证明了负责处理相关语言现象的注意力头部会聚在一起。我们的结果表明，基于 SHV 的归因揭示了两个模型中不同的模式，从而提供了语言模型如何组织和处理语言信息的一些见解。这些发现支持了这样的假设：语言模型学习与语言理论相对应的子网络，这对于跨语言模型分析和自然语言处理 (NLP) 中的可解释性具有潜在影响。", "author": "Marcell Fekete et.al.", "authors": "Marcell Fekete, Johannes Bjerva", "id": "2410.13396v1", "paper_url": "http://arxiv.org/abs/2410.13396v1", "repo": "null"}}