{"2501.08587": {"publish_time": "2025-01-15", "title": "Sound Scene Synthesis at the DCASE 2024 Challenge", "paper_summary": "This paper presents Task 7 at the DCASE 2024 Challenge: sound scene\nsynthesis. Recent advances in sound synthesis and generative models have\nenabled the creation of realistic and diverse audio content. We introduce a\nstandardized evaluation framework for comparing different sound scene synthesis\nsystems, incorporating both objective and subjective metrics. The challenge\nattracted four submissions, which are evaluated using the Fr\\'echet Audio\nDistance (FAD) and human perceptual ratings. Our analysis reveals significant\ninsights into the current capabilities and limitations of sound scene synthesis\nsystems, while also highlighting areas for future improvement in this rapidly\nevolving field.", "paper_summary_zh": "這篇論文介紹了 DCASE 2024 挑戰中的任務 7：聲音場景合成。聲音合成和生成模型的最新進展使得能夠創造出逼真且多樣化的音訊內容。我們引入了一個標準化的評估架構，用於比較不同的聲音場景合成系統，結合了客觀和主觀的指標。此挑戰吸引了四份提交，這些提交使用 Fr\\'echet 音訊距離 (FAD) 和人類感知評分進行評估。我們的分析揭示了對聲音場景合成系統當前能力和限制的重大見解，同時也強調了這個快速發展領域中未來改進的領域。", "author": "Mathieu Lagrange et.al.", "authors": "Mathieu Lagrange, Junwon Lee, Modan Tailleur, Laurie M. Heller, Keunwoo Choi, Brian McFee, Keisuke Imoto, Yuki Okamoto", "id": "2501.08587v1", "paper_url": "http://arxiv.org/abs/2501.08587v1", "repo": "null"}}