{"2406.11678": {"publish_time": "2024-06-17", "title": "TourRank: Utilizing Large Language Models for Documents Ranking with a Tournament-Inspired Strategy", "paper_summary": "Large Language Models (LLMs) are increasingly employed in zero-shot documents\nranking, yielding commendable results. However, several significant challenges\nstill persist in LLMs for ranking: (1) LLMs are constrained by limited input\nlength, precluding them from processing a large number of documents\nsimultaneously; (2) The output document sequence is influenced by the input\norder of documents, resulting in inconsistent ranking outcomes; (3) Achieving a\nbalance between cost and ranking performance is quite challenging. To tackle\nthese issues, we introduce a novel documents ranking method called TourRank,\nwhich is inspired by the tournament mechanism. This approach alleviates the\nimpact of LLM's limited input length through intelligent grouping, while the\ntournament-like points system ensures robust ranking, mitigating the influence\nof the document input sequence. We test TourRank with different LLMs on the\nTREC DL datasets and the BEIR benchmark. Experimental results show that\nTourRank achieves state-of-the-art performance at a reasonable cost.", "paper_summary_zh": "大型語言模型 (LLM)  zunehmend in Zero-Shot-Dokumenten eingesetzt\nRanking, was zu lobenswerten Ergebnissen führt. Allerdings bestehen bei LLMs für das Ranking immer noch mehrere erhebliche Herausforderungen: (1) LLMs sind durch eine begrenzte Eingabelänge eingeschränkt, was sie daran hindert, eine große Anzahl von Dokumenten gleichzeitig zu verarbeiten; (2) Die Ausgabe-Dokumentsequenz wird durch die Eingabereihenfolge der Dokumente beeinflusst, was zu inkonsistenten Ranking-Ergebnissen führt; (3) Es ist eine ziemliche Herausforderung, ein Gleichgewicht zwischen Kosten und Ranking-Leistung zu erreichen. Um diese Probleme anzugehen, stellen wir eine neuartige Dokumenten-Ranking-Methode namens TourRank vor, die vom Turniermechanismus inspiriert ist. Dieser Ansatz mildert die Auswirkungen der begrenzten Eingabelänge von LLM durch intelligente Gruppierung, während das turnierähnliche Punktesystem ein robustes Ranking gewährleistet und den Einfluss der Dokumenteneingabesequenz abschwächt. Wir testen TourRank mit verschiedenen LLMs auf den TREC DL-Datensätzen und dem BEIR-Benchmark. Experimentelle Ergebnisse zeigen, dass TourRank zu einem vernünftigen Preis eine hochmoderne Leistung erzielt.", "author": "Yiqun Chen et.al.", "authors": "Yiqun Chen, Qi Liu, Yi Zhang, Weiwei Sun, Daiting Shi, Jiaxin Mao, Dawei Yin", "id": "2406.11678v1", "paper_url": "http://arxiv.org/abs/2406.11678v1", "repo": "null"}}