{"2402.09474": {"publish_time": "2024-02-12", "title": "Deciphering Heartbeat Signatures: A Vision Transformer Approach to Explainable Atrial Fibrillation Detection from ECG Signals", "paper_summary": "Remote patient monitoring based on wearable single-lead electrocardiogram\n(ECG) devices has significant potential for enabling the early detection of\nheart disease, especially in combination with artificial intelligence (AI)\napproaches for automated heart disease detection. There have been prior studies\napplying AI approaches based on deep learning for heart disease detection.\nHowever, these models are yet to be widely accepted as a reliable aid for\nclinical diagnostics, in part due to the current black-box perception\nsurrounding many AI algorithms. In particular, there is a need to identify the\nkey features of the ECG signal that contribute toward making an accurate\ndiagnosis, thereby enhancing the interpretability of the model. In the present\nstudy, we develop a vision transformer approach to identify atrial fibrillation\nbased on single-lead ECG data. A residual network (ResNet) approach is also\ndeveloped for comparison with the vision transformer approach. These models are\napplied to the Chapman-Shaoxing dataset to classify atrial fibrillation, as\nwell as another common arrhythmia, sinus bradycardia, and normal sinus rhythm\nheartbeats. The models enable the identification of the key regions of the\nheartbeat that determine the resulting classification, and highlight the\nimportance of P-waves and T-waves, as well as heartbeat duration and signal\namplitude, in distinguishing normal sinus rhythm from atrial fibrillation and\nsinus bradycardia.", "paper_summary_zh": "<paragraph>基於可穿戴式單導程心電圖 (ECG) 裝置的遠端病患監測在早期偵測心臟疾病方面具有顯著的潛力，特別是與用於自動化心臟疾病偵測的人工智慧 (AI) 方法結合使用時。先前已有研究應用基於深度學習的 AI 方法進行心臟疾病偵測。然而，這些模型尚未被廣泛接受為臨床診斷的可靠輔助工具，部分原因在於圍繞許多 AI 演算法的當前黑箱感知。特別是，有必要找出有助於做出準確診斷的 ECG 訊號關鍵特徵，從而增強模型的可解釋性。在本研究中，我們開發了一種視覺轉換器方法，以根據單導程 ECG 資料找出心房顫動。殘差網路 (ResNet) 方法也已開發出來，以便與視覺轉換器方法進行比較。這些模型應用於 Chapman-Shaoxing 資料集，以分類心房顫動，以及另一種常見的心律不整，竇性心動過緩，和正常竇性心律的心跳。這些模型能夠找出決定最終分類的心跳關鍵區域，並強調 P 波和 T 波，以及心跳持續時間和訊號振幅在區分正常竇性心律與心房顫動和竇性心動過緩方面的重要性。</paragraph>", "author": "Aruna Mohan et.al.", "authors": "Aruna Mohan, Danne Elbers, Or Zilbershot, Fatemeh Afghah, David Vorchheimer", "id": "2402.09474v2", "paper_url": "http://arxiv.org/abs/2402.09474v2", "repo": "null"}}