{"2405.10301": {"publish_time": "2024-05-16", "title": "Conformal Alignment: Knowing When to Trust Foundation Models with Guarantees", "paper_summary": "Before deploying outputs from foundation models in high-stakes tasks, it is\nimperative to ensure that they align with human values. For instance, in\nradiology report generation, reports generated by a vision-language model must\nalign with human evaluations before their use in medical decision-making. This\npaper presents Conformal Alignment, a general framework for identifying units\nwhose outputs meet a user-specified alignment criterion. It is guaranteed that\non average, a prescribed fraction of selected units indeed meet the alignment\ncriterion, regardless of the foundation model or the data distribution. Given\nany pre-trained model and new units with model-generated outputs, Conformal\nAlignment leverages a set of reference data with ground-truth alignment status\nto train an alignment predictor. It then selects new units whose predicted\nalignment scores surpass a data-dependent threshold, certifying their\ncorresponding outputs as trustworthy. Through applications to question\nanswering and radiology report generation, we demonstrate that our method is\nable to accurately identify units with trustworthy outputs via lightweight\ntraining over a moderate amount of reference data. En route, we investigate the\ninformativeness of various features in alignment prediction and combine them\nwith standard models to construct the alignment predictor.", "paper_summary_zh": "在將基礎模型的輸出部署到高風險任務之前，務必確保它們符合人類價值觀。例如，在放射學報告生成中，由視覺語言模型生成的報告必須符合人類評估，才能用於醫療決策制定。本文提出了一致性校準，一個用於識別其輸出符合使用者指定一致性準則的單元的通用架構。可以保證平均而言，所選單元中一定比例的單元確實符合一致性準則，而與基礎模型或資料分佈無關。給定任何預訓練模型和具有模型生成輸出的新單元，一致性校準會利用具備基本事實一致性狀態的參考資料集來訓練一致性預測器。然後，它會選擇預測一致性分數超過資料相關閾值的單元，並證明其對應的輸出值得信賴。透過應用於問題解答和放射學報告生成，我們證明了我們的方法能夠透過大量參考資料上的輕量級訓練，準確識別具有可信賴輸出的單元。在過程中，我們探討了各種特徵在一致性預測中的資訊量，並將它們與標準模型結合起來建構一致性預測器。", "author": "Yu Gui et.al.", "authors": "Yu Gui, Ying Jin, Zhimei Ren", "id": "2405.10301v2", "paper_url": "http://arxiv.org/abs/2405.10301v2", "repo": "null"}}