{"2410.01739": {"publish_time": "2024-10-02", "title": "Mimicking Human Intuition: Cognitive Belief-Driven Q-Learning", "paper_summary": "Reinforcement learning encounters challenges in various environments related\nto robustness and explainability. Traditional Q-learning algorithms cannot\neffectively make decisions and utilize the historical learning experience. To\novercome these limitations, we propose Cognitive Belief-Driven Q-Learning\n(CBDQ), which integrates subjective belief modeling into the Q-learning\nframework, enhancing decision-making accuracy by endowing agents with\nhuman-like learning and reasoning capabilities. Drawing inspiration from\ncognitive science, our method maintains a subjective belief distribution over\nthe expectation of actions, leveraging a cluster-based subjective belief model\nthat enables agents to reason about the potential probability associated with\neach decision. CBDQ effectively mitigates overestimated phenomena and optimizes\ndecision-making policies by integrating historical experiences with current\ncontextual information, mimicking the dynamics of human decision-making. We\nevaluate the proposed method on discrete control benchmark tasks in various\ncomplicate environments. The results demonstrate that CBDQ exhibits stronger\nadaptability, robustness, and human-like characteristics in handling these\nenvironments, outperforming other baselines. We hope this work will give\nresearchers a fresh perspective on understanding and explaining Q-learning.", "paper_summary_zh": "強化學習在各種與穩健性和可解釋性相關的環境中遇到挑戰。傳統的 Q 學習演算法無法有效做出決策並利用歷史學習經驗。為了克服這些限制，我們提出了認知信念驅動的 Q 學習 (CBDQ)，它將主觀信念建模整合到 Q 學習架構中，透過賦予代理人類似人類的學習和推理能力來增強決策制定準確性。我們的模型從認知科學中汲取靈感，在動作預期上維持主觀信念分佈，利用基於群集的主觀信念模型，讓代理人能夠推理與每個決策相關的潛在機率。CBDQ 有效減輕高估現象，並透過將歷史經驗與當前背景資訊整合，最佳化決策制定政策，模擬人類決策制定的動態。我們在各種複雜環境中的離散控制基準任務上評估所提出的方法。結果表明，CBDQ 在處理這些環境時展現出更強的適應性、穩健性和類人特徵，優於其他基準。我們希望這項工作將為研究人員提供一個新的觀點，以理解和解釋 Q 學習。", "author": "Xingrui Gu et.al.", "authors": "Xingrui Gu, Guanren Qiao, Chuyi Jiang, Tianqing Xia, Hangyu Mao", "id": "2410.01739v1", "paper_url": "http://arxiv.org/abs/2410.01739v1", "repo": "null"}}