{"2410.18070": {"publish_time": "2024-10-23", "title": "Training Free Guided Flow Matching with Optimal Control", "paper_summary": "Controlled generation with pre-trained Diffusion and Flow Matching models has\nvast applications. One strategy for guiding ODE-based generative models is\nthrough optimizing a target loss $R(x_1)$ while staying close to the prior\ndistribution. Along this line, some recent work showed the effectiveness of\nguiding flow model by differentiating through its ODE sampling process. Despite\nthe superior performance, the theoretical understanding of this line of methods\nis still preliminary, leaving space for algorithm improvement. Moreover,\nexisting methods predominately focus on Euclidean data manifold, and there is a\ncompelling need for guided flow methods on complex geometries such as SO(3),\nwhich prevails in high-stake scientific applications like protein design. We\npresent OC-Flow, a general and theoretically grounded training-free framework\nfor guided flow matching using optimal control. Building upon advances in\noptimal control theory, we develop effective and practical algorithms for\nsolving optimal control in guided ODE-based generation and provide a systematic\ntheoretical analysis of the convergence guarantee in both Euclidean and SO(3).\nWe show that existing backprop-through-ODE methods can be interpreted as\nspecial cases of Euclidean OC-Flow. OC-Flow achieved superior performance in\nextensive experiments on text-guided image manipulation, conditional molecule\ngeneration, and all-atom peptide design.", "paper_summary_zh": "預訓練擴散與流匹配模型的受控生成有廣泛的應用。引導基於 ODE 的生成模型的一種策略是透過最佳化目標損失 $R(x_1)$，同時貼近先驗分佈。在此基礎上，一些近期研究顯示了透過其 ODE 採樣程序進行微分的有效性，以引導流模型。儘管有優異的效能，但對此方法系列的理論理解仍屬初步階段，為演算法的改善留下了空間。此外，現有方法主要關注歐幾里得資料流形，而對於複雜幾何（例如 SO(3)）上的引導流方法有迫切需求，這在蛋白質設計等高風險科學應用中很普遍。我們提出了 OC-Flow，這是一個使用最佳控制進行引導流匹配的通用且理論基礎紮實的無訓練框架。在最佳控制理論的進展基礎上，我們開發了有效且實用的演算法，用於求解引導式基於 ODE 的生成中的最佳控制，並對歐幾里得和 SO(3) 中的收斂保證提供了系統性的理論分析。我們表明，現有的透過 ODE 反向傳播的方法可以解釋為歐幾里得 OC-Flow 的特例。OC-Flow 在文字引導的影像處理、條件分子生成和全原子胜肽設計的廣泛實驗中獲得了優異的效能。", "author": "Luran Wang et.al.", "authors": "Luran Wang, Chaoran Cheng, Yizhen Liao, Yanru Qu, Ge Liu", "id": "2410.18070v1", "paper_url": "http://arxiv.org/abs/2410.18070v1", "repo": "null"}}