{"2407.02040": {"publish_time": "2024-07-02", "title": "ScaleDreamer: Scalable Text-to-3D Synthesis with Asynchronous Score Distillation", "paper_summary": "By leveraging the text-to-image diffusion priors, score distillation can\nsynthesize 3D contents without paired text-3D training data. Instead of\nspending hours of online optimization per text prompt, recent studies have been\nfocused on learning a text-to-3D generative network for amortizing multiple\ntext-3D relations, which can synthesize 3D contents in seconds. However,\nexisting score distillation methods are hard to scale up to a large amount of\ntext prompts due to the difficulties in aligning pretrained diffusion prior\nwith the distribution of rendered images from various text prompts. Current\nstate-of-the-arts such as Variational Score Distillation finetune the\npretrained diffusion model to minimize the noise prediction error so as to\nalign the distributions, which are however unstable to train and will impair\nthe model's comprehension capability to numerous text prompts. Based on the\nobservation that the diffusion models tend to have lower noise prediction\nerrors at earlier timesteps, we propose Asynchronous Score Distillation (ASD),\nwhich minimizes the noise prediction error by shifting the diffusion timestep\nto earlier ones. ASD is stable to train and can scale up to 100k prompts. It\nreduces the noise prediction error without changing the weights of pre-trained\ndiffusion model, thus keeping its strong comprehension capability to prompts.\nWe conduct extensive experiments across different 2D diffusion models,\nincluding Stable Diffusion and MVDream, and text-to-3D generators, including\nHyper-iNGP, 3DConv-Net and Triplane-Transformer. The results demonstrate ASD's\neffectiveness in stable 3D generator training, high-quality 3D content\nsynthesis, and its superior prompt-consistency, especially under large prompt\ncorpus.", "paper_summary_zh": "<paragraph>透過利用文本到影像擴散先驗，分數蒸餾可以在沒有成對文本 3D 訓練資料的情況下，合成 3D 內容。最近的研究不再花費數小時對每個文本提示進行線上最佳化，而是專注於學習文本到 3D 生成網路，以攤銷多個文本 3D 關係，可以在幾秒鐘內合成 3D 內容。然而，現有的分數蒸餾方法很難擴充到大量的文本提示，因為難以將預訓練的擴散先驗與來自各種文本提示的渲染影像分佈對齊。目前的技術，例如變異分數蒸餾，會微調預訓練的擴散模型，以最小化雜訊預測誤差，進而對齊分佈，然而這些分佈的訓練並不穩定，而且會損害模型對大量文本提示的理解能力。根據擴散模型在較早時間步長中往往具有較低雜訊預測誤差的觀察，我們提出了非同步分數蒸餾 (ASD)，它透過將擴散時間步長轉移到較早的時間步長來最小化雜訊預測誤差。ASD 訓練穩定，且可以擴充到 100k 個提示。它在不改變預訓練擴散模型權重的情況下降低了雜訊預測誤差，從而保持了其對提示的強大理解能力。我們對不同的 2D 擴散模型（包括 Stable Diffusion 和 MVDream）以及文本到 3D 生成器（包括 Hyper-iNGP、3DConv-Net 和 Triplane-Transformer）進行了廣泛的實驗。結果證明了 ASD 在穩定的 3D 生成器訓練、高品質 3D 內容合成以及其優異的提示一致性（尤其是在大型提示語料庫中）方面的有效性。</paragraph>", "author": "Zhiyuan Ma et.al.", "authors": "Zhiyuan Ma, Yuxiang Wei, Yabin Zhang, Xiangyu Zhu, Zhen Lei, Lei Zhang", "id": "2407.02040v1", "paper_url": "http://arxiv.org/abs/2407.02040v1", "repo": "https://github.com/theericma/scaledreamer"}}