{"2409.09046": {"publish_time": "2024-08-29", "title": "HyPA-RAG: A Hybrid Parameter Adaptive Retrieval-Augmented Generation System for AI Legal and Policy Applications", "paper_summary": "While Large Language Models (LLMs) excel in text generation and\nquestion-answering, their effectiveness in AI legal and policy is limited by\noutdated knowledge, hallucinations, and inadequate reasoning in complex\ncontexts. Retrieval-Augmented Generation (RAG) systems improve response\naccuracy by integrating external knowledge but struggle with retrieval errors,\npoor context integration, and high costs, particularly in interpreting\nqualitative and quantitative AI legal texts. This paper introduces a Hybrid\nParameter-Adaptive RAG (HyPA-RAG) system tailored for AI legal and policy,\nexemplified by NYC Local Law 144 (LL144). HyPA-RAG uses a query complexity\nclassifier for adaptive parameter tuning, a hybrid retrieval strategy combining\ndense, sparse, and knowledge graph methods, and an evaluation framework with\nspecific question types and metrics. By dynamically adjusting parameters,\nHyPA-RAG significantly improves retrieval accuracy and response fidelity.\nTesting on LL144 shows enhanced correctness, faithfulness, and contextual\nprecision, addressing the need for adaptable NLP systems in complex,\nhigh-stakes AI legal and policy applications.", "paper_summary_zh": "大型語言模型 (LLM) 雖然在文字產生和問答方面表現優異，但其在 AI 法律和政策中的效能卻受到過時知識、幻覺以及在複雜脈絡中推理不足的限制。檢索增強生成 (RAG) 系統透過整合外部知識來改善回應準確性，但卻在檢索錯誤、脈絡整合不良以及成本高昂方面面臨挑戰，特別是在詮釋定性和定量的 AI 法律文本時。本文介紹了一種專為 AI 法律和政策量身打造的混合參數自適應 RAG (HyPA-RAG) 系統，以紐約市地方法律 144 (LL144) 為例。HyPA-RAG 使用查詢複雜度分類器進行自適應參數調整，結合稠密、稀疏和知識圖表方法的混合檢索策略，以及包含特定問題類型和指標的評估架構。透過動態調整參數，HyPA-RAG 大幅改善了檢索準確性和回應保真度。在 LL144 上的測試顯示出增強的正確性、忠實度和脈絡準確度，滿足了在複雜、高風險的 AI 法律和政策應用中對可適應 NLP 系統的需求。", "author": "Rishi Kalra et.al.", "authors": "Rishi Kalra, Zekun Wu, Ayesha Gulley, Airlie Hilliard, Xin Guan, Adriano Koshiyama, Philip Treleaven", "id": "2409.09046v1", "paper_url": "http://arxiv.org/abs/2409.09046v1", "repo": "null"}}