{"2407.04125": {"publish_time": "2024-07-04", "title": "Query-Guided Self-Supervised Summarization of Nursing Notes", "paper_summary": "Nursing notes, an important component of Electronic Health Records (EHRs),\nkeep track of the progression of a patient's health status during a care\nepisode. Distilling the key information in nursing notes through text\nsummarization techniques can improve clinicians' efficiency in understanding\npatients' conditions when reviewing nursing notes. However, existing\nabstractive summarization methods in the clinical setting have often overlooked\nnursing notes and require the creation of reference summaries for supervision\nsignals, which is time-consuming. In this work, we introduce QGSumm, a\nquery-guided self-supervised domain adaptation framework for nursing note\nsummarization. Using patient-related clinical queries as guidance, our approach\ngenerates high-quality, patient-centered summaries without relying on reference\nsummaries for training. Through automatic and manual evaluation by an expert\nclinician, we demonstrate the strengths of our approach compared to the\nstate-of-the-art Large Language Models (LLMs) in both zero-shot and few-shot\nsettings. Ultimately, our approach provides a new perspective on conditional\ntext summarization, tailored to the specific interests of clinical personnel.", "paper_summary_zh": "護理記錄是電子健康紀錄 (EHR) 的重要組成部分，\n在照護過程中追蹤病患的健康狀態進展。利用文字摘要技術提煉護理記錄中的關鍵資訊，可以提升臨床醫師在檢視護理記錄時了解病患狀況的效率。然而，現有的臨床摘要方法常常忽略護理記錄，且需要建立參考摘要作為監督訊號，這非常耗時。在這項工作中，我們提出 QGSumm，一個用於護理記錄摘要的查詢引導式自我監督領域適應架構。我們的做法使用與病患相關的臨床查詢作為指引，在訓練中不依賴參考摘要，就能產生高品質、以病患為中心的摘要。透過專家臨床醫師的自動和手動評估，我們展示了我們的方法與最先進的大語言模型 (LLM) 相比在零次學習和少次學習設定中的優勢。最終，我們的做法為條件式文字摘要提供了新的觀點，專門針對臨床人員的特定興趣量身打造。", "author": "Ya Gao et.al.", "authors": "Ya Gao, Hans Moen, Saila Koivusalo, Miika Koskinen, Pekka Marttinen", "id": "2407.04125v1", "paper_url": "http://arxiv.org/abs/2407.04125v1", "repo": "null"}}