{"2501.05567": {"publish_time": "2025-01-09", "title": "Approximate Supervised Object Distance Estimation on Unmanned Surface Vehicles", "paper_summary": "Unmanned surface vehicles (USVs) and boats are increasingly important in\nmaritime operations, yet their deployment is limited due to costly sensors and\ncomplexity. LiDAR, radar, and depth cameras are either costly, yield sparse\npoint clouds or are noisy, and require extensive calibration. Here, we\nintroduce a novel approach for approximate distance estimation in USVs using\nsupervised object detection. We collected a dataset comprising images with\nmanually annotated bounding boxes and corresponding distance measurements.\nLeveraging this data, we propose a specialized branch of an object detection\nmodel, not only to detect objects but also to predict their distances from the\nUSV. This method offers a cost-efficient and intuitive alternative to\nconventional distance measurement techniques, aligning more closely with human\nestimation capabilities. We demonstrate its application in a marine assistance\nsystem that alerts operators to nearby objects such as boats, buoys, or other\nwaterborne hazards.", "paper_summary_zh": "無人水面載具 (USV) 和船隻在海事作業中越來越重要，但由於感測器成本高昂且複雜，因此部署受到限制。LiDAR、雷達和深度相機不是成本高昂，就是產生稀疏點雲或有雜訊，且需要廣泛校正。在此，我們介紹一種使用監督物件偵測在 USV 中進行近似距離估計的新穎方法。我們收集了一個包含手動標註邊界框和對應距離測量的影像資料集。利用這些資料，我們提出一個物件偵測模型的專用分支，不僅可以偵測物件，還可以預測它們與 USV 的距離。此方法提供了一個經濟且直觀的替代方案，用於傳統距離測量技術，更貼近人類的估計能力。我們展示了它在海上輔助系統中的應用，該系統會對附近的物體（例如船隻、浮標或其他水域危害）向操作員發出警報。", "author": "Benjamin Kiefer et.al.", "authors": "Benjamin Kiefer, Yitong Quan, Andreas Zell", "id": "2501.05567v1", "paper_url": "http://arxiv.org/abs/2501.05567v1", "repo": "null"}}