{"2409.11786": {"publish_time": "2024-09-18", "title": "Efficient Low-Resolution Face Recognition via Bridge Distillation", "paper_summary": "Face recognition in the wild is now advancing towards light-weight models,\nfast inference speed and resolution-adapted capability. In this paper, we\npropose a bridge distillation approach to turn a complex face model pretrained\non private high-resolution faces into a light-weight one for low-resolution\nface recognition. In our approach, such a cross-dataset resolution-adapted\nknowledge transfer problem is solved via two-step distillation. In the first\nstep, we conduct cross-dataset distillation to transfer the prior knowledge\nfrom private high-resolution faces to public high-resolution faces and generate\ncompact and discriminative features. In the second step, the resolution-adapted\ndistillation is conducted to further transfer the prior knowledge to synthetic\nlow-resolution faces via multi-task learning. By learning low-resolution face\nrepresentations and mimicking the adapted high-resolution knowledge, a\nlight-weight student model can be constructed with high efficiency and\npromising accuracy in recognizing low-resolution faces. Experimental results\nshow that the student model performs impressively in recognizing low-resolution\nfaces with only 0.21M parameters and 0.057MB memory. Meanwhile, its speed\nreaches up to 14,705, ~934 and 763 faces per second on GPU, CPU and mobile\nphone, respectively.", "paper_summary_zh": "人臉辨識現在朝向輕量級模型、快速的推論速度和適應解析度的能力邁進。在本文中，我們提出一個橋樑蒸餾方法，將一個複雜的人臉模型預先訓練在私人高解析度人臉上，轉換成一個低解析度人臉辨識的輕量級模型。在我們的做法中，這種跨資料集適應解析度的知識轉移問題透過兩階段蒸餾來解決。在第一階段，我們進行跨資料集蒸餾，將先驗知識從私人高解析度人臉轉移到公開高解析度人臉，並產生緊湊且具區別性的特徵。在第二階段，進行適應解析度的蒸餾，以透過多任務學習進一步將先驗知識轉移到合成低解析度人臉。透過學習低解析度人臉表示和模擬適應的高解析度知識，可以建構一個輕量級的學生模型，在辨識低解析度人臉時具有高效率和良好的準確度。實驗結果顯示，學生模型在辨識低解析度人臉時表現出色，只有 0.21M 參數和 0.057MB 記憶體。同時，它的速度分別在 GPU、CPU 和手機上達到每秒 14,705、~934 和 763 張人臉。", "author": "Shiming Ge et.al.", "authors": "Shiming Ge, Shengwei Zhao, Chenyu Li, Yu Zhang, Jia Li", "id": "2409.11786v1", "paper_url": "http://arxiv.org/abs/2409.11786v1", "repo": "null"}}