{"2412.08937": {"publish_time": "2024-12-12", "title": "Multi-Scale Heterogeneous Text-Attributed Graph Datasets From Diverse Domains", "paper_summary": "Heterogeneous Text-Attributed Graphs (HTAGs), where different types of\nentities are not only associated with texts but also connected by diverse\nrelationships, have gained widespread popularity and application across various\ndomains. However, current research on text-attributed graph learning\npredominantly focuses on homogeneous graphs, which feature a single node and\nedge type, thus leaving a gap in understanding how methods perform on HTAGs.\nOne crucial reason is the lack of comprehensive HTAG datasets that offer\noriginal textual content and span multiple domains of varying sizes. To this\nend, we introduce a collection of challenging and diverse benchmark datasets\nfor realistic and reproducible evaluation of machine learning models on HTAGs.\nOur HTAG datasets are multi-scale, span years in duration, and cover a wide\nrange of domains, including movie, community question answering, academic,\nliterature, and patent networks. We further conduct benchmark experiments on\nthese datasets with various graph neural networks. All source data, dataset\nconstruction codes, processed HTAGs, data loaders, benchmark codes, and\nevaluation setup are publicly available at GitHub and Hugging Face.", "paper_summary_zh": "異質文本屬性圖 (HTAG)，其中不同類型的實體不僅與文本相關聯，而且還通過不同的關係連接，在各個領域獲得了廣泛的普及和應用。然而，當前關於文本屬性圖學習的研究主要集中在同質圖上，同質圖特徵是單個節點和邊緣類型，因此在理解方法如何在 HTAG 上執行時留下了空白。一個關鍵原因是缺乏提供原始文本內容並跨越不同規模的多個域的綜合 HTAG 數據集。為此，我們引入了一組具有挑戰性和多樣性的基準數據集，用於對機器學習模型在 HTAG 上進行真實且可重現的評估。我們的 HTAG 數據集是多尺度的，跨越多年的持續時間，並涵蓋了廣泛的領域，包括電影、社區問答、學術、文學和專利網路。我們進一步在這些數據集上使用各種圖神經網路進行基準實驗。所有原始數據、數據集構造代碼、處理過的 HTAG、數據加載器、基準代碼和評估設置都可以在 GitHub 和 Hugging Face 上公開獲得。", "author": "Yunhui Liu et.al.", "authors": "Yunhui Liu, Qizhuo Xie, Jinwei Shi, Jiaxu Shen, Tieke He", "id": "2412.08937v1", "paper_url": "http://arxiv.org/abs/2412.08937v1", "repo": "null"}}