{"2407.03253": {"publish_time": "2024-07-03", "title": "STF: Sentence Transformer Fine-Tuning For Topic Categorization With Limited Data", "paper_summary": "Nowadays, topic classification from tweets attracts considerable research\nattention. Different classification systems have been suggested thanks to these\nresearch efforts. Nevertheless, they face major challenges owing to low\nperformance metrics due to the limited amount of labeled data. We propose\nSentence Transformers Fine-tuning (STF), a topic detection system that\nleverages pretrained Sentence Transformers models and fine-tuning to classify\ntopics from tweets accurately. Moreover, extensive parameter sensitivity\nanalyses were conducted to finetune STF parameters for our topic classification\ntask to achieve the best performance results. Experiments on two benchmark\ndatasets demonstrated that (1) the proposed STF can be effectively used for\nclassifying tweet topics and outperforms the latest state-of-the-art\napproaches, and (2) the proposed STF does not require a huge amount of labeled\ntweets to achieve good accuracy, which is a limitation of many state-of-the-art\napproaches. Our main contribution is the achievement of promising results in\ntweet topic classification by applying pretrained sentence transformers\nlanguage models.", "paper_summary_zh": "如今，从推文中进行主题分类引起了相当大的研究关注。由于这些研究工作，已经提出了不同的分类系统。然而，由于标记数据量有限，它们面临着因性能指标低而带来的重大挑战。我们提出了句子转换器微调 (STF)，这是一种主题检测系统，它利用预训练的句子转换器模型和微调来准确地对推文中的主题进行分类。此外，进行了广泛的参数敏感性分析，以微调用于主题分类任务的 STF 参数，以实现最佳性能结果。在两个基准数据集上的实验表明：(1) 提出的 STF 可有效用于对推文主题进行分类，并且优于最新的最先进方法；(2) 提出的 STF 不需要大量标记推文就能实现良好的准确性，这是许多最先进方法的限制。我们的主要贡献是通过应用预训练的句子转换器语言模型在推文主题分类中取得了有希望的结果。", "author": "Kheir Eddine Daouadi et.al.", "authors": "Kheir Eddine Daouadi, Yaakoub Boualleg, Oussama Guehairia", "id": "2407.03253v1", "paper_url": "http://arxiv.org/abs/2407.03253v1", "repo": "null"}}