{"2409.11703": {"publish_time": "2024-09-18", "title": "Harnessing LLMs for API Interactions: A Framework for Classification and Synthetic Data Generation", "paper_summary": "As Large Language Models (LLMs) advance in natural language processing, there\nis growing interest in leveraging their capabilities to simplify software\ninteractions. In this paper, we propose a novel system that integrates LLMs for\nboth classifying natural language inputs into corresponding API calls and\nautomating the creation of sample datasets tailored to specific API functions.\nBy classifying natural language commands, our system allows users to invoke\ncomplex software functionalities through simple inputs, improving interaction\nefficiency and lowering the barrier to software utilization. Our dataset\ngeneration approach also enables the efficient and systematic evaluation of\ndifferent LLMs in classifying API calls, offering a practical tool for\ndevelopers or business owners to assess the suitability of LLMs for customized\nAPI management. We conduct experiments on several prominent LLMs using\ngenerated sample datasets for various API functions. The results show that\nGPT-4 achieves a high classification accuracy of 0.996, while LLaMA-3-8B\nperforms much worse at 0.759. These findings highlight the potential of LLMs to\ntransform API management and validate the effectiveness of our system in\nguiding model testing and selection across diverse applications.", "paper_summary_zh": "隨著大型語言模型 (LLM) 在自然語言處理方面的進展，人們越來越有興趣利用其功能來簡化軟體互動。在本文中，我們提出了一個新穎的系統，它整合了 LLM，既可以將自然語言輸入分類為對應的 API 呼叫，又可以自動建立針對特定 API 功能量身打造的範例資料集。透過分類自然語言命令，我們的系統允許使用者透過簡單的輸入來呼叫複雜的軟體功能，進而提升互動效率並降低使用軟體的門檻。我們的資料集生成方法還能有效率且系統性地評估不同的 LLM 在分類 API 呼叫方面的表現，為開發人員或企業主提供一個實用的工具，用於評估 LLM 是否適合自訂的 API 管理。我們使用針對各種 API 功能生成的範例資料集，對幾個知名的 LLM 進行實驗。結果顯示，GPT-4 達到了 0.996 的高分類準確度，而 LLaMA-3-8B 的表現則差很多，僅有 0.759。這些發現突顯了 LLM 轉變 API 管理的潛力，並驗證了我們的系統在引導不同應用程式的模型測試和選擇方面的有效性。", "author": "Chunliang Tao et.al.", "authors": "Chunliang Tao, Xiaojing Fan, Yahe Yang", "id": "2409.11703v1", "paper_url": "http://arxiv.org/abs/2409.11703v1", "repo": "null"}}