{"2407.02042": {"publish_time": "2024-07-02", "title": "Fake News Detection and Manipulation Reasoning via Large Vision-Language Models", "paper_summary": "Fake news becomes a growing threat to information security and public opinion\nwith the rapid sprawl of media manipulation. Therefore, fake news detection\nattracts widespread attention from academic community. Traditional fake news\ndetection models demonstrate remarkable performance on authenticity binary\nclassification but their ability to reason detailed faked traces based on the\nnews content remains under-explored. Furthermore, due to the lack of external\nknowledge, the performance of existing methods on fact-related news is\nquestionable, leaving their practical implementation unclear. In this paper, we\npropose a new multi-media research topic, namely manipulation reasoning.\nManipulation reasoning aims to reason manipulations based on news content. To\nsupport the research, we introduce a benchmark for fake news detection and\nmanipulation reasoning, referred to as Human-centric and Fact-related Fake News\n(HFFN). The benchmark highlights the centrality of human and the high factual\nrelevance, with detailed manual annotations. HFFN encompasses four realistic\ndomains with fake news samples generated through three manipulation approaches.\nMoreover, a Multi-modal news Detection and Reasoning langUage Model (M-DRUM) is\npresented not only to judge on the authenticity of multi-modal news, but also\nraise analytical reasoning about potential manipulations. On the feature\nextraction level, a cross-attention mechanism is employed to extract\nfine-grained fusion features from multi-modal inputs. On the reasoning level, a\nlarge vision-language model (LVLM) serves as the backbone to facilitate\nfact-related reasoning. A two-stage training framework is deployed to better\nactivate the capacity of identification and reasoning. Comprehensive\nexperiments demonstrate that our model outperforms state-of-the-art (SOTA) fake\nnews detection models and powerful LVLMs like GPT-4 and LLaVA.", "paper_summary_zh": "<paragraph>隨著媒體操弄的快速蔓延，假新聞已成為資訊安全和輿論日益嚴重的威脅。因此，假新聞偵測吸引了學術界的廣泛關注。傳統的假新聞偵測模型在真偽二元分類上表現出色，但它們根據新聞內容推論詳細偽造痕跡的能力仍未得到充分探討。此外，由於缺乏外部知識，現有方法在與事實相關的新聞上的表現令人質疑，這讓它們的實際應用不明朗。在本文中，我們提出了一個新的多媒體研究主題，即操弄推理。操弄推理旨在根據新聞內容推論操弄。為了支持這項研究，我們引入了假新聞偵測和操弄推理的基準，稱為以人為中心且與事實相關的假新聞 (HFFN)。該基準強調了人類的中心性和高度的事實相關性，並附有詳細的手動註解。HFFN 涵蓋了四個現實領域，其中假新聞範例是透過三種操弄方法產生的。此外，我們提出了一個多模態新聞偵測和推理語言模型 (M-DRUM)，它不僅可以判斷多模態新聞的真偽，還能對潛在操弄提出分析推理。在特徵提取層面，我們採用了一個交叉注意力機制，從多模態輸入中提取細粒度的融合特徵。在推理層面，一個大型視覺語言模型 (LVLM) 作為主幹，以利於與事實相關的推理。我們部署了一個兩階段訓練架構，以更好地啟動識別和推理能力。全面的實驗表明，我們的模型優於最先進 (SOTA) 的假新聞偵測模型和強大的 LVLMs，例如 GPT-4 和 LLaVA。</paragraph>", "author": "Ruihan Jin et.al.", "authors": "Ruihan Jin, Ruibo Fu, Zhengqi Wen, Shuai Zhang, Yukun Liu, Jianhua Tao", "id": "2407.02042v1", "paper_url": "http://arxiv.org/abs/2407.02042v1", "repo": "null"}}