{"2406.17982": {"publish_time": "2024-06-25", "title": "EDEN: Empathetic Dialogues for English learning", "paper_summary": "Dialogue systems have been used as conversation partners in English learning,\nbut few have studied whether these systems improve learning outcomes. Student\npassion and perseverance, or grit, has been associated with language learning\nsuccess. Recent work establishes that as students perceive their English\nteachers to be more supportive, their grit improves. Hypothesizing that the\nsame pattern applies to English-teaching chatbots, we create EDEN, a robust\nopen-domain chatbot for spoken conversation practice that provides empathetic\nfeedback. To construct EDEN, we first train a specialized spoken utterance\ngrammar correction model and a high-quality social chit-chat conversation\nmodel. We then conduct a preliminary user study with a variety of strategies\nfor empathetic feedback. Our experiment suggests that using adaptive empathetic\nfeedback leads to higher perceived affective support, which, in turn, predicts\nincreased student grit.", "paper_summary_zh": "對話系統已被用作英語學習的對話夥伴，但很少有人研究這些系統是否能改善學習成果。學生的熱情和毅力，或堅韌不拔的精神，與語言學習的成功有關。最近的研究表明，當學生認為他們的英語老師更支持時，他們的毅力就會得到提升。我們假設同樣的模式也適用於英語教學聊天機器人，因此我們創造了 EDEN，一個強大的開放領域聊天機器人，用於口語對話練習，並提供同理心的回饋。為了構建 EDEN，我們首先訓練一個專門的口語表達語法校正模型和一個高品質的社交閒聊對話模型。然後，我們對各種同理心回饋策略進行了初步的使用者研究。我們的實驗表明，使用適應性同理心回饋會導致更高的感知情感支持，而這反過來又預測了學生的毅力會增加。", "author": "Li Siyan et.al.", "authors": "Li Siyan, Teresa Shao, Zhou Yu, Julia Hirschberg", "id": "2406.17982v1", "paper_url": "http://arxiv.org/abs/2406.17982v1", "repo": "null"}}