{"2412.02831": {"publish_time": "2024-12-03", "title": "FLAME 3 Dataset: Unleashing the Power of Radiometric Thermal UAV Imagery for Wildfire Management", "paper_summary": "The increasing accessibility of radiometric thermal imaging sensors for\nunmanned aerial vehicles (UAVs) offers significant potential for advancing\nAI-driven aerial wildfire management. Radiometric imaging provides per-pixel\ntemperature estimates, a valuable improvement over non-radiometric data that\nrequires irradiance measurements to be converted into visible images using RGB\ncolor palettes. Despite its benefits, this technology has been underutilized\nlargely due to a lack of available data for researchers. This study addresses\nthis gap by introducing methods for collecting and processing synchronized\nvisual spectrum and radiometric thermal imagery using UAVs at prescribed fires.\nThe included imagery processing pipeline drastically simplifies and partially\nautomates each step from data collection to neural network input. Further, we\npresent the FLAME 3 dataset, the first comprehensive collection of side-by-side\nvisual spectrum and radiometric thermal imagery of wildland fires. Building on\nour previous FLAME 1 and FLAME 2 datasets, FLAME 3 includes radiometric thermal\nTag Image File Format (TIFFs) and nadir thermal plots, providing a new data\ntype and collection method. This dataset aims to spur a new generation of\nmachine learning models utilizing radiometric thermal imagery, potentially\ntrivializing tasks such as aerial wildfire detection, segmentation, and\nassessment. A single-burn subset of FLAME 3 for computer vision applications is\navailable on Kaggle with the full 6 burn set available to readers upon request.", "paper_summary_zh": "無人機（UAV）的放射熱影像感測器越來越普及，為推進人工智慧驅動的空中野火管理提供了巨大的潛力。放射熱影像提供每個像素的溫度估計值，這比非放射熱數據的寶貴改進，後者需要將輻照度測量值轉換為使用 RGB 調色板的可見影像。儘管有這些優點，但由於研究人員缺乏可用的數據，這項技術的使用率一直偏低。本研究透過介紹使用無人機在規定的火災中收集和處理同步可見光譜和放射熱影像的方法來解決這個差距。所包含的影像處理管道大幅簡化並部分自動化從數據收集到神經網路輸入的每一個步驟。此外，我們展示了 FLAME 3 資料集，這是第一個並排收集野生火災的可見光譜和放射熱影像的綜合資料集。FLAME 3 建構在我們之前的 FLAME 1 和 FLAME 2 資料集之上，包含放射熱標籤影像檔案格式 (TIFF) 和天底熱區塊，提供新的資料類型和收集方法。此資料集旨在激發新一代機器學習模型，利用放射熱影像，潛在地簡化空中野火偵測、分割和評估等任務。FLAME 3 的單次燃燒子集可供電腦視覺應用程式在 Kaggle 上使用，而完整的 6 次燃燒設定可應讀者要求提供。", "author": "Bryce Hopkins et.al.", "authors": "Bryce Hopkins, Leo ONeill, Michael Marinaccio, Eric Rowell, Russell Parsons, Sarah Flanary, Irtija Nazim, Carl Seielstad, Fatemeh Afghah", "id": "2412.02831v1", "paper_url": "http://arxiv.org/abs/2412.02831v1", "repo": "null"}}