{"2502.13897": {"publish_time": "2025-02-19", "title": "DataSciBench: An LLM Agent Benchmark for Data Science", "paper_summary": "This paper presents DataSciBench, a comprehensive benchmark for evaluating\nLarge Language Model (LLM) capabilities in data science. Recent related\nbenchmarks have primarily focused on single tasks, easily obtainable ground\ntruth, and straightforward evaluation metrics, which limits the scope of tasks\nthat can be evaluated. In contrast, DataSciBench is constructed based on a more\ncomprehensive and curated collection of natural and challenging prompts for\nuncertain ground truth and evaluation metrics. We develop a semi-automated\npipeline for generating ground truth (GT) and validating evaluation metrics.\nThis pipeline utilizes and implements an LLM-based self-consistency and human\nverification strategy to produce accurate GT by leveraging collected prompts,\npredefined task types, and aggregate functions (metrics). Furthermore, we\npropose an innovative Task - Function - Code (TFC) framework to assess each\ncode execution outcome based on precisely defined metrics and programmatic\nrules. Our experimental framework involves testing 6 API-based models, 8\nopen-source general models, and 9 open-source code generation models using the\ndiverse set of prompts we have gathered. This approach aims to provide a more\ncomprehensive and rigorous evaluation of LLMs in data science, revealing their\nstrengths and weaknesses. Experimental results demonstrate that API-based\nmodels outperform open-sourced models on all metrics and\nDeepseek-Coder-33B-Instruct achieves the highest score among open-sourced\nmodels. We release all code and data at https://github.com/THUDM/DataSciBench.", "paper_summary_zh": "<paragraph>這篇論文提出了 DataSciBench，一個用於評估大型語言模型 (LLM) 在資料科學能力的綜合基準。最近相關的基準主要集中在單一任務、容易取得的基礎真實值和直接的評估指標上，這限制了可評估任務的範圍。相比之下，DataSciBench 是基於更全面且經過整理的自然且具有挑戰性的提示集合，用於不確定的基礎真實值和評估指標。我們開發了一個半自動化的管道，用於產生基礎真實值 (GT) 和驗證評估指標。此管道利用並實作了基於 LLM 的自我一致性和人工驗證策略，透過利用收集的提示、預定義的任務類型和聚合函數（指標）來產生準確的 GT。此外，我們提出了一個創新的任務 - 函數 - 程式碼 (TFC) 架構，用於根據精確定義的指標和程式規則評估每個程式碼執行結果。我們的實驗架構涉及使用我們收集的多樣化提示，測試 6 個基於 API 的模型、8 個開源通用模型和 9 個開源程式碼生成模型。此方法旨在提供對資料科學中 LLM 的更全面且嚴謹的評估，揭示其優點和缺點。實驗結果表明，基於 API 的模型在所有指標上都優於開源模型，而 Deepseek-Coder-33B-Instruct 在開源模型中獲得最高分。我們在 https://github.com/THUDM/DataSciBench 釋出所有程式碼和資料。</paragraph>", "author": "Dan Zhang et.al.", "authors": "Dan Zhang, Sining Zhoubian, Min Cai, Fengzu Li, Lekang Yang, Wei Wang, Tianjiao Dong, Ziniu Hu, Jie Tang, Yisong Yue", "id": "2502.13897v1", "paper_url": "http://arxiv.org/abs/2502.13897v1", "repo": "null"}}