{"2408.05777": {"publish_time": "2024-08-11", "title": "Seg-CycleGAN : SAR-to-optical image translation guided by a downstream task", "paper_summary": "Optical remote sensing and Synthetic Aperture Radar(SAR) remote sensing are\ncrucial for earth observation, offering complementary capabilities. While\noptical sensors provide high-quality images, they are limited by weather and\nlighting conditions. In contrast, SAR sensors can operate effectively under\nadverse conditions. This letter proposes a GAN-based SAR-to-optical image\ntranslation method named Seg-CycleGAN, designed to enhance the accuracy of ship\ntarget translation by leveraging semantic information from a pre-trained\nsemantic segmentation model. Our method utilizes the downstream task of ship\ntarget semantic segmentation to guide the training of image translation\nnetwork, improving the quality of output Optical-styled images. The potential\nof foundation-model-annotated datasets in SAR-to-optical translation tasks is\nrevealed. This work suggests broader research and applications for\ndownstream-task-guided frameworks. The code will be available at\nhttps://github.com/NPULHH/", "paper_summary_zh": "光學遙測與合成孔徑雷達(SAR)遙測對於地球觀測至關重要，提供互補的能力。儘管光學感測器提供高品質影像，但受到天氣和光照條件的限制。相比之下，SAR感測器可以在惡劣條件下有效運作。這封信提出一個基於GAN的SAR到光學影像轉換方法，稱為Seg-CycleGAN，旨在透過利用預先訓練的語意分割模型的語意資訊來增強船舶目標轉換的準確性。我們的模型利用船舶目標語意分割的下游任務來引導影像轉換網路的訓練，改善輸出光學樣式影像的品質。揭示了基礎模型註解資料集在SAR到光學轉換任務中的潛力。這項工作建議更廣泛的研究和應用於下游任務引導的框架。程式碼將在https://github.com/NPULHH/提供。", "author": "Hannuo Zhang et.al.", "authors": "Hannuo Zhang, Huihui Li, Jiarui Lin, Yujie Zhang, Jianghua Fan, Hang Liu", "id": "2408.05777v1", "paper_url": "http://arxiv.org/abs/2408.05777v1", "repo": "null"}}