{"2405.20680": {"publish_time": "2024-05-31", "title": "Unraveling and Mitigating Retriever Inconsistencies in Retrieval-Augmented Large Language Models", "paper_summary": "Although Retrieval-Augmented Large Language Models (RALMs) demonstrate their\nsuperiority in terms of factuality, they do not consistently outperform the\noriginal retrieval-free Language Models (LMs). Our experiments reveal that this\nexample-level performance inconsistency exists not only between\nretrieval-augmented and retrieval-free LM but also among different retrievers.\nTo understand this phenomenon, we investigate the degeneration behavior of\nRALMs and theoretically decompose it into four categories. Further analysis\nbased on our decomposition reveals that the innate difference in knowledge\nsources and the unpredictable degeneration of the reader model contribute most\nto the inconsistency. Drawing from our analysis, we introduce Ensemble of\nRetrievers (EoR), a trainable framework that can adaptively retrieve from\ndifferent knowledge sources and effectively decrease unpredictable reader\nerrors. Our experiments on Open Domain Question Answering show that EoR\nsubstantially improves performance over the RALM with a single retriever by\nconsiderably reducing inconsistent behaviors.", "paper_summary_zh": "儘管檢索增強大型語言模型 (RALM) 在事實性方面展現其優越性，但它們並非始終優於原始的非檢索語言模型 (LM)。我們的實驗揭示，這種範例層級效能不一致不僅存在於檢索增強和非檢索 LM 之間，也存在於不同的檢索器之間。為了了解這種現象，我們研究了 RALM 的退化行為，並在理論上將其分解為四種類別。根據我們的分解進行進一步的分析，揭示了知識來源的內在差異和閱讀器模型不可預測的退化對不一致性的影響最大。根據我們的分析，我們引入了檢索器合奏 (EoR)，這是一個可訓練的架構，可以自適應地從不同的知識來源中檢索，並有效減少不可預測的閱讀器錯誤。我們在開放領域問答上的實驗表明，EoR 大幅改善了使用單一檢索器的 RALM 的效能，方法是大幅減少不一致的行為。", "author": "Mingda Li et.al.", "authors": "Mingda Li, Xinyu Li, Yifan Chen, Wenfeng Xuan, Weinan Zhang", "id": "2405.20680v2", "paper_url": "http://arxiv.org/abs/2405.20680v2", "repo": "null"}}