{"2501.06986": {"publish_time": "2025-01-13", "title": "LEO: Boosting Mixture of Vision Encoders for Multimodal Large Language Models", "paper_summary": "Enhanced visual understanding serves as a cornerstone for multimodal large\nlanguage models (MLLMs). Recent hybrid MLLMs incorporate a mixture of vision\nexperts to address the limitations of using a single vision encoder and\nexcessively long visual tokens. Despite the progress of these MLLMs, a research\ngap remains in effectively integrating diverse vision encoders. This work\nexplores fusion strategies of visual tokens for hybrid MLLMs, leading to the\ndesign of LEO, a novel MLLM with a dual-branch vision encoder framework that\nincorporates a post-adaptation fusion strategy and adaptive tiling: for each\nsegmented tile of the input images, LEO sequentially interleaves the visual\ntokens from its two vision encoders. Extensive evaluation across 13\nvision-language benchmarks reveals that LEO outperforms state-of-the-art\nopen-source MLLMs and hybrid MLLMs on the majority of tasks. Furthermore, we\nshow that LEO can be adapted to the specialized domain of autonomous driving\nwithout altering the model architecture or training recipe, achieving\ncompetitive performance compared to existing baselines. The code and model will\nbe publicly available.", "paper_summary_zh": "增強的視覺理解是多模態大型語言模型 (MLLM) 的基石。最近的混合 MLLM 結合了視覺專家的混合，以解決使用單一視覺編碼器和過長的視覺符號的限制。儘管這些 MLLM 取得了進展，但有效整合不同的視覺編碼器仍然存在研究空白。這項工作探討了混合 MLLM 的視覺符號融合策略，從而設計出 LEO，一種具有雙分支視覺編碼器框架的新型 MLLM，它結合了後適應融合策略和自適應平鋪：對於輸入影像的每個分割平鋪，LEO 依序交織其兩個視覺編碼器的視覺符號。在 13 個視覺語言基準上的廣泛評估顯示，LEO 在大多數任務上優於最先進的開源 MLLM 和混合 MLLM。此外，我們展示了 LEO 可以適應自動駕駛的專業領域，而無需改變模型架構或訓練配方，與現有的基準相比，實現了競爭力。代碼和模型將公開提供。", "author": "Mozhgan Nasr Azadani et.al.", "authors": "Mozhgan Nasr Azadani, James Riddell, Sean Sedwards, Krzysztof Czarnecki", "id": "2501.06986v1", "paper_url": "http://arxiv.org/abs/2501.06986v1", "repo": "https://github.com/mozhgan91/leo"}}