{"2502.15304": {"publish_time": "2025-02-21", "title": "SVDq: 1.25-bit and 410x Key Cache Compression for LLM Attention", "paper_summary": "For the efficient inference of Large Language Models (LLMs), the effective\ncompression of key-value (KV) cache is essential. Three main types of KV cache\ncompression techniques, namely sparsity, channel compression, and quantization,\nhave been identified. This study presents SVDq, a Singular Value Decomposition\n(SVD) - based mixed precision quantization method for K cache. Initially, K\ncache is transformed into latent channels using SVD basis representations.\nSince the values in latent channels decay rapidly and become negligible after\nonly a few latent channels, our method then incorporates importance-aware\nquantization and compression for latent channels. This enables the effective\nallocation of higher precision to more significant channels. Theoretically, we\nprove that SVDq results in quantization errors (x0.1 or even lower) that are\nmuch lower than those of per-channel key quantization in the original space.\nOur findings based on RULER and LongBench benchmarks demonstrate that SVDq can\nachieve an equivalent key cache precision as low as 1.25-bit. When combined\nwith key sparsity, it can reach a key compression ratio of up to 410x for\nattention computation, all while maintaining comparable model performance.\nNotably, our method is nearly lossless for LongBench datasets. This indicates\nthat SVDq enables high-precision low-bit quantization, providing a more\nefficient solution for KV cache compression in LLMs.", "paper_summary_zh": "對於大型語言模型 (LLM) 的有效推論，鍵值 (KV) 快取的有效壓縮至關重要。已經找出三種主要的 KV 快取壓縮技術類型，即稀疏性、通道壓縮和量化。本研究提出 SVDq，一種基於奇異值分解 (SVD) 的混合精度量化方法，用於 K 快取。最初，K 快取使用 SVD 基底表示轉換為潛在通道。由於潛在通道中的值衰減很快，並且僅在幾個潛在通道後變得可以忽略不計，因此我們的模型接著為潛在通道納入重要性感知量化和壓縮。這使得能夠有效地將更高的精度分配給更重要的通道。在理論上，我們證明 SVDq 導致的量化誤差 (x0.1 甚至更低) 遠低於原始空間中的逐通道鍵量化。我們基於 RULER 和 LongBench 基準的發現表明，SVDq 可以實現低至 1.25 位的等效鍵快取精度。當與鍵稀疏性結合使用時，它可以達到高達 410 倍的鍵壓縮比，同時保持可比較的模型效能。值得注意的是，我們的模型對於 LongBench 資料集幾乎沒有損失。這表明 SVDq 能夠進行高精度低位元量化，為 LLM 中的 KV 快取壓縮提供更有效的解決方案。", "author": "Hong Yankun et.al.", "authors": "Hong Yankun, Li Xing, Zhen Hui-Ling, Yu Xianzhi, Liu Wulong, Yuan Mingxuan", "id": "2502.15304v1", "paper_url": "http://arxiv.org/abs/2502.15304v1", "repo": "null"}}