{"2412.13737": {"publish_time": "2024-12-18", "title": "On the Compression of Language Models for Code: An Empirical Study on CodeBERT", "paper_summary": "Language models have proven successful across a wide range of software\nengineering tasks, but their significant computational costs often hinder their\npractical adoption. To address this challenge, researchers have begun applying\nvarious compression strategies to improve the efficiency of language models for\ncode. These strategies aim to optimize inference latency and memory usage,\nthough often at the cost of reduced model effectiveness. However, there is\nstill a significant gap in understanding how these strategies influence the\nefficiency and effectiveness of language models for code. Here, we empirically\ninvestigate the impact of three well-known compression strategies -- knowledge\ndistillation, quantization, and pruning -- across three different classes of\nsoftware engineering tasks: vulnerability detection, code summarization, and\ncode search. Our findings reveal that the impact of these strategies varies\ngreatly depending on the task and the specific compression method employed.\nPractitioners and researchers can use these insights to make informed decisions\nwhen selecting the most appropriate compression strategy, balancing both\nefficiency and effectiveness based on their specific needs.", "paper_summary_zh": "語言模型已被證明在廣泛的軟體工程任務中取得成功，但其顯著的運算成本通常會阻礙其實際採用。為了應對這一挑戰，研究人員已開始應用各種壓縮策略來提高語言模型對程式碼的效率。這些策略旨在最佳化推論延遲和記憶體使用率，儘管通常以降低模型有效性為代價。然而，對於這些策略如何影響語言模型對程式碼的效率和有效性，仍有顯著的理解差距。在此，我們根據三個不同的軟體工程任務類別：漏洞偵測、程式碼摘要和程式碼搜尋，實證調查三種眾所周知的壓縮策略的影響——知識萃取、量化和剪枝。我們的研究結果顯示，這些策略的影響會根據任務和所採用的特定壓縮方法而有很大差異。從業人員和研究人員可以使用這些見解，在根據其特定需求平衡效率和有效性的同時，做出明智的決定，選擇最合適的壓縮策略。", "author": "Giordano d'Aloisio et.al.", "authors": "Giordano d'Aloisio, Luca Traini, Federica Sarro, Antinisca Di Marco", "id": "2412.13737v1", "paper_url": "http://arxiv.org/abs/2412.13737v1", "repo": "null"}}