{"2412.15606": {"publish_time": "2024-12-20", "title": "Multi-modal Agent Tuning: Building a VLM-Driven Agent for Efficient Tool Usage", "paper_summary": "The advancement of large language models (LLMs) prompts the development of\nmulti-modal agents, which are used as a controller to call external tools,\nproviding a feasible way to solve practical tasks. In this paper, we propose a\nmulti-modal agent tuning method that automatically generates multi-modal\ntool-usage data and tunes a vision-language model (VLM) as the controller for\npowerful tool-usage reasoning. To preserve the data quality, we prompt the\nGPT-4o mini model to generate queries, files, and trajectories, followed by\nquery-file and trajectory verifiers. Based on the data synthesis pipeline, we\ncollect the MM-Traj dataset that contains 20K tasks with trajectories of tool\nusage. Then, we develop the T3-Agent via \\underline{T}rajectory\n\\underline{T}uning on VLMs for \\underline{T}ool usage using MM-Traj.\nEvaluations on the GTA and GAIA benchmarks show that the T3-Agent consistently\nachieves improvements on two popular VLMs: MiniCPM-V-8.5B and {Qwen2-VL-7B},\nwhich outperforms untrained VLMs by $20\\%$, showing the effectiveness of the\nproposed data synthesis pipeline, leading to high-quality data for tool-usage\ncapabilities.", "paper_summary_zh": "大型語言模型 (LLM) 的進步促使了多模態代理的發展，這些代理用作控制器來呼叫外部工具，提供了解決實際任務的可行方式。在本文中，我們提出了一種多模態代理調整方法，該方法自動生成多模態工具使用數據，並調整視覺語言模型 (VLM) 作為強大工具使用推理的控制器。為了保留數據質量，我們提示 GPT-4o 迷你模型生成查詢、文件和軌跡，然後再使用查詢文件和軌跡驗證器。根據數據合成管道，我們收集了 MM-Traj 數據集，其中包含 20K 個具有工具使用軌跡的任務。然後，我們通過使用 MM-Traj 在 VLM 上進行軌跡調整，開發了 T3-Agent，用於工具使用。對 GTA 和 GAIA 基準的評估表明，T3-Agent 在兩個流行的 VLM 上持續取得改進：MiniCPM-V-8.5B 和 {Qwen2-VL-7B}，其優於未訓練的 VLM 20%，顯示了所提出的數據合成管道的有效性，從而為工具使用能力提供了高質量的數據。", "author": "Zhi Gao et.al.", "authors": "Zhi Gao, Bofei Zhang, Pengxiang Li, Xiaojian Ma, Tao Yuan, Yue Fan, Yuwei Wu, Yunde Jia, Song-Chun Zhu, Qing Li", "id": "2412.15606v1", "paper_url": "http://arxiv.org/abs/2412.15606v1", "repo": "null"}}