{"2408.07990": {"publish_time": "2024-08-15", "title": "FuseChat: Knowledge Fusion of Chat Models", "paper_summary": "While training large language models (LLMs) from scratch can indeed lead to\nmodels with distinct capabilities and strengths, it incurs substantial costs\nand may lead to redundancy in competencies. Knowledge fusion aims to integrate\nexisting LLMs of diverse architectures and capabilities into a more potent LLM\nthrough lightweight continual training, thereby reducing the need for costly\nLLM development. In this work, we propose a new framework for the knowledge\nfusion of chat LLMs through two main stages, resulting in FuseChat. Firstly, we\nconduct pairwise knowledge fusion on source chat LLMs of varying structures and\nscales to create multiple target LLMs with identical structure and size via\nlightweight fine-tuning. During this process, a statistics-based token\nalignment approach is introduced as the cornerstone for fusing LLMs with\ndifferent structures. Secondly, we merge these target LLMs within the parameter\nspace, where we propose a novel method for determining the merging coefficients\nbased on the magnitude of parameter updates before and after fine-tuning. We\nimplement and validate FuseChat using six prominent chat LLMs with diverse\narchitectures and scales, including OpenChat-3.5-7B, Starling-LM-7B-alpha,\nNH2-SOLAR-10.7B, InternLM2-Chat-20B, Mixtral-8x7B-Instruct, and\nQwen-1.5-Chat-72B. Experimental results on two instruction-following\nbenchmarks, AlpacaEval 2.0 and MT-Bench, demonstrate the superiority of\nFuseChat-7B over baselines of various sizes. Our model is even comparable to\nthe larger Mixtral-8x7B-Instruct and approaches GPT-3.5-Turbo-1106 on MT-Bench.\nOur code, model weights, and data are public at\n\\url{https://github.com/fanqiwan/FuseAI}.", "paper_summary_zh": "<paragraph>從頭訓練大型語言模型 (LLM) 確實可以產生具有不同功能和優勢的模型，但會產生大量成本，並可能導致能力冗餘。知識融合旨在透過輕量級的持續訓練，將不同架構和功能的現有 LLM 整合到更強大的 LLM 中，從而減少對昂貴 LLM 開發的需求。在這項工作中，我們提出了一個新的聊天 LLM 知識融合架構，分為兩個主要階段，產生 FuseChat。首先，我們對不同結構和規模的原始聊天 LLM 進行成對知識融合，透過輕量級微調，建立多個具有相同結構和大小的目標 LLM。在此過程中，引入了基於統計的代碼對齊方法，作為融合具有不同結構的 LLM 的基石。其次，我們在參數空間中合併這些目標 LLM，我們提出了一種新穎的方法，用於根據微調前後參數更新的幅度來確定合併係數。我們使用六個具有不同架構和規模的著名聊天 LLM 實作並驗證了 FuseChat，包括 OpenChat-3.5-7B、Starling-LM-7B-alpha、NH2-SOLAR-10.7B、InternLM2-Chat-20B、Mixtral-8x7B-Instruct 和 Qwen-1.5-Chat-72B。在兩個指令遵循基準測試 AlpacaEval 2.0 和 MT-Bench 上的實驗結果證明了 FuseChat-7B 優於各種規模的基準。我們的模型甚至可以與較大的 Mixtral-8x7B-Instruct 相媲美，並在 MT-Bench 上接近 GPT-3.5-Turbo-1106。我們的程式碼、模型權重和資料已公開於\\url{https://github.com/fanqiwan/FuseAI}。</paragraph>", "author": "Fanqi Wan et.al.", "authors": "Fanqi Wan, Longguang Zhong, Ziyi Yang, Ruijun Chen, Xiaojun Quan", "id": "2408.07990v1", "paper_url": "http://arxiv.org/abs/2408.07990v1", "repo": "https://github.com/fanqiwan/fuseai"}}