{"2501.09056": {"publish_time": "2025-01-15", "title": "Decompose-ToM: Enhancing Theory of Mind Reasoning in Large Language Models through Simulation and Task Decomposition", "paper_summary": "Theory of Mind (ToM) is the ability to understand and reflect on the mental\nstates of others. Although this capability is crucial for human interaction,\ntesting on Large Language Models (LLMs) reveals that they possess only a\nrudimentary understanding of it. Although the most capable closed-source LLMs\nhave come close to human performance on some ToM tasks, they still perform\npoorly on complex variations of the task that involve more structured\nreasoning. In this work, we utilize the concept of \"pretend-play\", or\n``Simulation Theory'' from cognitive psychology to propose ``Decompose-ToM'':\nan LLM-based inference algorithm that improves model performance on complex ToM\ntasks. We recursively simulate user perspectives and decompose the ToM task\ninto a simpler set of functions: subject identification, question-reframing,\nworld model updation, and knowledge availability. We test the algorithm on\nhigher-order ToM tasks and a task testing for ToM capabilities in a\nconversational setting, demonstrating that our approach shows significant\nimprovement across models compared to baseline methods while requiring minimal\nprompt tuning across tasks and no additional model training.", "paper_summary_zh": "心智理論（ToM）是理解和反思他人心智狀態的能力。儘管這種能力對人類互動至關重要，但對大型語言模型（LLM）的測試表明，它們對此的理解僅僅是初步的。儘管功能最強的閉源 LLM 在某些 ToM 任務上接近人類表現，但它們在涉及更多結構化推理的任務的複雜變化上表現仍然很差。在這項工作中，我們利用認知心理學中的「假裝遊戲」或「模擬理論」的概念，提出「分解心智理論」：一種基於 LLM 的推理演算法，可以改善模型在複雜心智理論任務上的表現。我們遞迴模擬使用者觀點，並將心智理論任務分解為一組更簡單的功能：主體識別、問題重新建構、世界模型更新和知識可用性。我們在高階心智理論任務和在對話環境中測試心智理論能力的任務上測試了該演算法，證明與基線方法相比，我們的做法在各種模型上都顯示出顯著的改進，同時在各種任務中需要最少的提示調整，並且不需要額外的模型訓練。", "author": "Sneheel Sarangi et.al.", "authors": "Sneheel Sarangi, Maha Elgarf, Hanan Salam", "id": "2501.09056v1", "paper_url": "http://arxiv.org/abs/2501.09056v1", "repo": "https://github.com/xarangi/decompose-tom"}}