{"2502.06773": {"publish_time": "2025-02-10", "title": "On the Emergence of Thinking in LLMs I: Searching for the Right Intuition", "paper_summary": "Recent AI advancements, such as OpenAI's new models, are transforming LLMs\ninto LRMs (Large Reasoning Models) that perform reasoning during inference,\ntaking extra time and compute for higher-quality outputs. We aim to uncover the\nalgorithmic framework for training LRMs. Methods like self-consistency, PRM,\nand AlphaZero suggest reasoning as guided search. We ask: what is the simplest,\nmost scalable way to enable search in LLMs?\n  We propose a post-training framework called Reinforcement Learning via\nSelf-Play (RLSP). RLSP involves three steps: (1) supervised fine-tuning with\nhuman or synthetic demonstrations of the reasoning process, (2) using an\nexploration reward signal to encourage diverse and efficient reasoning\nbehaviors, and (3) RL training with an outcome verifier to ensure correctness\nwhile preventing reward hacking. Our key innovation is to decouple exploration\nand correctness signals during PPO training, carefully balancing them to\nimprove performance and efficiency.\n  Empirical studies in the math domain show that RLSP improves reasoning. On\nthe Llama-3.1-8B-Instruct model, RLSP can boost performance by 23% in MATH-500\ntest set; On AIME 2024 math problems, Qwen2.5-32B-Instruct improved by 10% due\nto RLSP. However, a more important finding of this work is that the models\ntrained using RLSP, even with the simplest exploration reward that encourages\nthe model to take more intermediate steps, showed several emergent behaviors\nsuch as backtracking, exploration of ideas, and verification. These findings\ndemonstrate that RLSP framework might be enough to enable emergence of complex\nreasoning abilities in LLMs when scaled. Lastly, we propose a theory as to why\nRLSP search strategy is more suitable for LLMs inspired by a remarkable result\nthat says CoT provably increases computational power of LLMs, which grows as\nthe number of steps in CoT \\cite{li2024chain,merrill2023expresssive}.", "paper_summary_zh": "<paragraph>最近的人工智慧進展，例如 OpenAI 的新模型，正在將 LLM 轉變為 LRM（大型推理模型），它們在推理過程中執行推理，花費額外的時間並計算以獲得更高品質的輸出。我們的目標是揭示訓練 LRM 的演算法架構。自一致性、PRM 和 AlphaZero 等方法建議將推理視為引導式搜尋。我們問：什麼是最簡單、最具擴充性的方法來啟用 LLM 中的搜尋？\n  我們提出一個稱為透過自玩強化學習 (RLSP) 的訓練後架構。RLSP 涉及三個步驟：(1) 使用推理過程的人類或合成示範進行監督微調，(2) 使用探索獎勵訊號來鼓勵多樣化且有效的推理行為，以及 (3) 使用結果驗證器進行 RL 訓練，以確保正確性，同時防止獎勵破解。我們的關鍵創新是在 PPO 訓練期間解耦探索和正確性訊號，並仔細平衡它們以提高效能和效率。\n  數學領域的實證研究表明，RLSP 改善了推理。在 Llama-3.1-8B-Instruct 模型上，RLSP 可以將 MATH-500 測試集的效能提升 23%；在 AIME 2024 數學題目上，由於 RLSP，Qwen2.5-32B-Instruct 改善了 10%。然而，這項工作更重要的發現是，即使使用最簡單的探索獎勵來鼓勵模型採取更多中間步驟，使用 RLSP 訓練的模型也顯示出幾種新興行為，例如回溯、探索想法和驗證。這些發現證明了 RLSP 架構可能足以在擴充時讓 LLM 出現複雜的推理能力。最後，我們提出一個理論來說明為什麼 RLSP 搜尋策略更適合 LLM，靈感來自一個顯著的結果，該結果指出 CoT 可證明地增加了 LLM 的計算能力，隨著 CoT 中步驟數的增加而增長\\cite{li2024chain,merrill2023expresssive}。</paragraph>", "author": "Guanghao Ye et.al.", "authors": "Guanghao Ye, Khiem Duc Pham, Xinzhi Zhang, Sivakanth Gopi, Baolin Peng, Beibin Li, Janardhan Kulkarni, Huseyin A. Inan", "id": "2502.06773v1", "paper_url": "http://arxiv.org/abs/2502.06773v1", "repo": "null"}}