{"2410.17504": {"publish_time": "2024-10-23", "title": "An Ontology-Enabled Approach For User-Centered and Knowledge-Enabled Explanations of AI Systems", "paper_summary": "Explainable Artificial Intelligence (AI) focuses on helping humans understand\nthe working of AI systems or their decisions and has been a cornerstone of AI\nfor decades. Recent research in explainability has focused on explaining the\nworkings of AI models or model explainability. There have also been several\nposition statements and review papers detailing the needs of end-users for\nuser-centered explainability but fewer implementations. Hence, this thesis\nseeks to bridge some gaps between model and user-centered explainability. We\ncreate an explanation ontology (EO) to represent literature-derived explanation\ntypes via their supporting components. We implement a knowledge-augmented\nquestion-answering (QA) pipeline to support contextual explanations in a\nclinical setting. Finally, we are implementing a system to combine explanations\nfrom different AI methods and data modalities. Within the EO, we can represent\nfifteen different explanation types, and we have tested these representations\nin six exemplar use cases. We find that knowledge augmentations improve the\nperformance of base large language models in the contextualized QA, and the\nperformance is variable across disease groups. In the same setting, clinicians\nalso indicated that they prefer to see actionability as one of the main foci in\nexplanations. In our explanations combination method, we plan to use similarity\nmetrics to determine the similarity of explanations in a chronic disease\ndetection setting. Overall, through this thesis, we design methods that can\nsupport knowledge-enabled explanations across different use cases, accounting\nfor the methods in today's AI era that can generate the supporting components\nof these explanations and domain knowledge sources that can enhance them.", "paper_summary_zh": "可解釋人工智慧（AI）專注於協助人類了解 AI 系統運作或其決策，數十年來一直是 AI 的基石。最近的可解釋性研究專注於解釋 AI 模型或模型可解釋性的運作。也有幾份立場聲明和評論論文詳細說明了最終使用者對以使用者為中心的可解釋性的需求，但實作較少。因此，本論文旨在彌補模型和以使用者為中心的可解釋性之間的一些差距。我們建立一個解釋本體（EO）以透過其支援元件來表示從文獻中衍生的解釋類型。我們實作一個知識增強的問答（QA）管線，以在臨床環境中支援情境解釋。最後，我們正在實作一個系統，以結合來自不同 AI 方法和資料模式的解釋。在 EO 中，我們可以表示 15 種不同的解釋類型，並且我們已在六個範例使用案例中測試這些表示。我們發現，知識增強改善了基礎大型語言模型在情境化 QA 中的效能，並且效能因疾病群組而異。在相同的環境中，臨床醫生也表示他們希望將可操作性視為解釋中的主要焦點之一。在我們的解釋組合方法中，我們計畫使用相似性指標來確定慢性病偵測環境中解釋的相似性。總體而言，透過本論文，我們設計了可以在不同使用案例中支援知識啟用解釋的方法，考量到當今 AI 時代中可以產生這些解釋的支援元件和可以增強這些解釋的領域知識來源的方法。", "author": "Shruthi Chari et.al.", "authors": "Shruthi Chari", "id": "2410.17504v1", "paper_url": "http://arxiv.org/abs/2410.17504v1", "repo": "null"}}