{"2411.15106": {"publish_time": "2024-11-22", "title": "About Time: Advances, Challenges, and Outlooks of Action Understanding", "paper_summary": "We have witnessed impressive advances in video action understanding.\nIncreased dataset sizes, variability, and computation availability have enabled\nleaps in performance and task diversification. Current systems can provide\ncoarse- and fine-grained descriptions of video scenes, extract segments\ncorresponding to queries, synthesize unobserved parts of videos, and predict\ncontext. This survey comprehensively reviews advances in uni- and multi-modal\naction understanding across a range of tasks. We focus on prevalent challenges,\noverview widely adopted datasets, and survey seminal works with an emphasis on\nrecent advances. We broadly distinguish between three temporal scopes: (1)\nrecognition tasks of actions observed in full, (2) prediction tasks for ongoing\npartially observed actions, and (3) forecasting tasks for subsequent unobserved\naction. This division allows us to identify specific action modeling and video\nrepresentation challenges. Finally, we outline future directions to address\ncurrent shortcomings.", "paper_summary_zh": "我們見證了影片動作理解的顯著進展。\n資料集大小、變異性與運算可用性的增加，促成了效能的躍進與任務的多樣化。目前的系統能提供影片場景的粗略和細緻描述、萃取與查詢相符的片段、綜合影片中未觀察到的部分，以及預測脈絡。這份調查全面回顧了單模態和多模態動作理解在各種任務上的進展。我們專注於普遍的挑戰、概觀廣泛採用的資料集，並調查具有開創性意義的作品，特別強調最近的進展。我們廣泛區分三種時間範圍：(1) 完整觀察動作的辨識任務、(2) 持續進行的部分觀察動作的預測任務，以及 (3) 後續未觀察動作的預測任務。這種區分讓我們能找出特定動作建模和影片表示的挑戰。最後，我們概述了未來的方向，以解決目前的缺點。", "author": "Alexandros Stergiou et.al.", "authors": "Alexandros Stergiou, Ronald Poppe", "id": "2411.15106v1", "paper_url": "http://arxiv.org/abs/2411.15106v1", "repo": "null"}}