{"2406.19108": {"publish_time": "2024-06-27", "title": "Computational Life: How Well-formed, Self-replicating Programs Emerge from Simple Interaction", "paper_summary": "The fields of Origin of Life and Artificial Life both question what life is\nand how it emerges from a distinct set of \"pre-life\" dynamics. One common\nfeature of most substrates where life emerges is a marked shift in dynamics\nwhen self-replication appears. While there are some hypotheses regarding how\nself-replicators arose in nature, we know very little about the general\ndynamics, computational principles, and necessary conditions for\nself-replicators to emerge. This is especially true on \"computational\nsubstrates\" where interactions involve logical, mathematical, or programming\nrules. In this paper we take a step towards understanding how self-replicators\narise by studying several computational substrates based on various simple\nprogramming languages and machine instruction sets. We show that when random,\nnon self-replicating programs are placed in an environment lacking any explicit\nfitness landscape, self-replicators tend to arise. We demonstrate how this\noccurs due to random interactions and self-modification, and can happen with\nand without background random mutations. We also show how increasingly complex\ndynamics continue to emerge following the rise of self-replicators. Finally, we\nshow a counterexample of a minimalistic programming language where\nself-replicators are possible, but so far have not been observed to arise.", "paper_summary_zh": "生命起源和人工生命領域都質疑生命是什麼，以及它是如何從一組不同的「生命前」動力學中出現的。生命出現的大多數基質的一個共同特徵，是在自複製出現時動力學的顯著轉變。雖然有一些關於自複製器如何在自然界中產生的假設，但我們對自複製器出現的普遍動力學、計算原則和必要條件知之甚少。在交互涉及邏輯、數學或程式設計規則的「計算基質」上尤其如此。在本文中，我們透過研究基於各種簡單程式語言和機器指令集的幾個計算基質，朝著了解自複製器如何產生的方向邁出了一步。我們表明，當隨機、非自複製程式被放置在缺乏任何明確適應度環境中時，自複製器往往會產生。我們展示了這是如何由於隨機交互和自我修改而發生的，並且可以在有或沒有背景隨機突變的情況下發生。我們還展示了隨著自複製器的興起，如何持續出現越來越複雜的動力學。最後，我們展示了一個極簡程式語言的反例，其中自複製器是可能的，但到目前為止尚未觀察到它們的出現。", "author": "Blaise Agüera y Arcas et.al.", "authors": "Blaise Agüera y Arcas, Jyrki Alakuijala, James Evans, Ben Laurie, Alexander Mordvintsev, Eyvind Niklasson, Ettore Randazzo, Luca Versari", "id": "2406.19108v1", "paper_url": "http://arxiv.org/abs/2406.19108v1", "repo": "null"}}