{"2410.04990": {"publish_time": "2024-10-07", "title": "Stage-Wise and Prior-Aware Neural Speech Phase Prediction", "paper_summary": "This paper proposes a novel Stage-wise and Prior-aware Neural Speech Phase\nPrediction (SP-NSPP) model, which predicts the phase spectrum from input\namplitude spectrum by two-stage neural networks. In the initial\nprior-construction stage, we preliminarily predict a rough prior phase spectrum\nfrom the amplitude spectrum. The subsequent refinement stage transforms the\namplitude spectrum into a refined high-quality phase spectrum conditioned on\nthe prior phase. Networks in both stages use ConvNeXt v2 blocks as the backbone\nand adopt adversarial training by innovatively introducing a phase spectrum\ndiscriminator (PSD). To further improve the continuity of the refined phase, we\nalso incorporate a time-frequency integrated difference (TFID) loss in the\nrefinement stage. Experimental results confirm that, compared to neural\nnetwork-based no-prior phase prediction methods, the proposed SP-NSPP achieves\nhigher phase prediction accuracy, thanks to introducing the coarse phase priors\nand diverse training criteria. Compared to iterative phase estimation\nalgorithms, our proposed SP-NSPP does not require multiple rounds of staged\niterations, resulting in higher generation efficiency.", "paper_summary_zh": "本文提出了一個新穎的分階段且先驗感知神經語音相位預測 (SP-NSPP) 模型，該模型通過兩階段神經網路從輸入振幅譜預測相位譜。在初始先驗構建階段，我們從振幅譜預測一個粗略的先驗相位譜。後續的細化階段將振幅譜轉換為一個細化的、高品質的相位譜，以先驗相位為條件。兩個階段的網路都使用 ConvNeXt v2 區塊作為主幹，並通過創新地引入相位譜判別器 (PSD) 採用對抗訓練。為了進一步提高細化相位的連續性，我們還在細化階段中加入了時頻整合差分 (TFID) 損失。實驗結果證實，與基於神經網路的無先驗相位預測方法相比，所提出的 SP-NSPP 得益於引入了粗略相位先驗和多樣化的訓練標準，實現了更高的相位預測準確度。與迭代相位估計演算法相比，我們提出的 SP-NSPP 不需要多輪分階段迭代，從而產生更高的生成效率。", "author": "Fei Liu et.al.", "authors": "Fei Liu, Yang Ai, Hui-Peng Du, Ye-Xin Lu, Rui-Chen Zheng, Zhen-Hua Ling", "id": "2410.04990v1", "paper_url": "http://arxiv.org/abs/2410.04990v1", "repo": "null"}}