{"2411.14880": {"publish_time": "2024-11-22", "title": "Leveraging Hierarchical Prototypes as the Verbalizer for Implicit Discourse Relation Recognition", "paper_summary": "Implicit discourse relation recognition involves determining relationships\nthat hold between spans of text that are not linked by an explicit discourse\nconnective. In recent years, the pre-train, prompt, and predict paradigm has\nemerged as a promising approach for tackling this task. However, previous work\nsolely relied on manual verbalizers for implicit discourse relation\nrecognition, which suffer from issues of ambiguity and even incorrectness. To\novercome these limitations, we leverage the prototypes that capture certain\nclass-level semantic features and the hierarchical label structure for\ndifferent classes as the verbalizer. We show that our method improves on\ncompetitive baselines. Besides, our proposed approach can be extended to enable\nzero-shot cross-lingual learning, facilitating the recognition of discourse\nrelations in languages with scarce resources. These advancement validate the\npracticality and versatility of our approach in addressing the issues of\nimplicit discourse relation recognition across different languages.", "paper_summary_zh": "隱含話語關係辨識涉及判定未透過明確話語連接詞連結的文本範圍之間的關係。近年來，預訓練、提示和預測範例已成為處理這項任務的有前景方法。然而，先前的研究僅依賴手動言語化器進行隱含話語關係辨識，而這會產生模稜兩可甚至不正確的問題。為了克服這些限制，我們利用原型來擷取特定類別層級語意特徵和不同類別的階層標籤結構作為言語化器。我們展示我們的模型優於競爭基準線。此外，我們提出的方法可以延伸以啟用零次學習跨語言學習，促進辨識資源稀少的語言中的話語關係。這些進展驗證了我們的方法在解決不同語言中隱含話語關係辨識問題的實用性和多功能性。", "author": "Wanqiu Long et.al.", "authors": "Wanqiu Long, Bonnie Webber", "id": "2411.14880v1", "paper_url": "http://arxiv.org/abs/2411.14880v1", "repo": "null"}}