{"2412.13952": {"publish_time": "2024-12-18", "title": "Prompting Strategies for Enabling Large Language Models to Infer Causation from Correlation", "paper_summary": "The reasoning abilities of Large Language Models (LLMs) are attracting\nincreasing attention. In this work, we focus on causal reasoning and address\nthe task of establishing causal relationships based on correlation information,\na highly challenging problem on which several LLMs have shown poor performance.\nWe introduce a prompting strategy for this problem that breaks the original\ntask into fixed subquestions, with each subquestion corresponding to one step\nof a formal causal discovery algorithm, the PC algorithm. The proposed\nprompting strategy, PC-SubQ, guides the LLM to follow these algorithmic steps,\nby sequentially prompting it with one subquestion at a time, augmenting the\nnext subquestion's prompt with the answer to the previous one(s). We evaluate\nour approach on an existing causal benchmark, Corr2Cause: our experiments\nindicate a performance improvement across five LLMs when comparing PC-SubQ to\nbaseline prompting strategies. Results are robust to causal query\nperturbations, when modifying the variable names or paraphrasing the\nexpressions.", "paper_summary_zh": "大型語言模型 (LLM) 的推理能力正吸引越來越多的關注。在這項工作中，我們專注於因果推理，並解決基於相關資訊建立因果關係的任務，這是一個極具挑戰性的問題，多個 LLM 在此問題上表現不佳。我們為此問題引入了一個提示策略，將原始任務分解為固定的子問題，每個子問題對應於形式因果發現演算法（PC 演算法）的一個步驟。建議的提示策略 PC-SubQ 引導 LLM 按照這些演算法步驟進行，一次提示一個子問題，並使用前一個（或多個）子問題的答案擴充下一個子問題的提示。我們在現有的因果基準 Corr2Cause 上評估了我們的方法：我們的實驗表明，與基準提示策略相比，PC-SubQ 在比較五個 LLM 時改進了效能。當修改變數名稱或改寫表達式時，結果對因果查詢擾動具有魯棒性。", "author": "Eleni Sgouritsa et.al.", "authors": "Eleni Sgouritsa, Virginia Aglietti, Yee Whye Teh, Arnaud Doucet, Arthur Gretton, Silvia Chiappa", "id": "2412.13952v1", "paper_url": "http://arxiv.org/abs/2412.13952v1", "repo": "null"}}