{"2406.05612": {"publish_time": "2024-06-09", "title": "Which Backbone to Use: A Resource-efficient Domain Specific Comparison for Computer Vision", "paper_summary": "In contemporary computer vision applications, particularly image\nclassification, architectural backbones pre-trained on large datasets like\nImageNet are commonly employed as feature extractors. Despite the widespread\nuse of these pre-trained convolutional neural networks (CNNs), there remains a\ngap in understanding the performance of various resource-efficient backbones\nacross diverse domains and dataset sizes. Our study systematically evaluates\nmultiple lightweight, pre-trained CNN backbones under consistent training\nsettings across a variety of datasets, including natural images, medical\nimages, galaxy images, and remote sensing images. This comprehensive analysis\naims to aid machine learning practitioners in selecting the most suitable\nbackbone for their specific problem, especially in scenarios involving small\ndatasets where fine-tuning a pre-trained network is crucial. Even though\nattention-based architectures are gaining popularity, we observed that they\ntend to perform poorly under low data finetuning tasks compared to CNNs. We\nalso observed that some CNN architectures such as ConvNeXt, RegNet and\nEfficientNet performs well compared to others on a diverse set of domains\nconsistently. Our findings provide actionable insights into the performance\ntrade-offs and effectiveness of different backbones, facilitating informed\ndecision-making in model selection for a broad spectrum of computer vision\ndomains. Our code is available here: https://github.com/pranavphoenix/Backbones", "paper_summary_zh": "<paragraph>在當代電腦視覺應用中，特別是影像分類，預先在大型資料集（例如 ImageNet）上訓練的架構主幹通常用作特徵萃取器。儘管廣泛使用這些預先訓練的卷積神經網路 (CNN)，但對於各種資源效率主幹在不同網域和資料集大小上的效能仍缺乏了解。我們的研究系統性地評估多個輕量級、預先訓練的 CNN 主幹，在各種資料集（包括自然影像、醫學影像、星系影像和遙測影像）上採用一致的訓練設定。這項全面的分析旨在協助機器學習從業人員為其特定問題選擇最合適的主幹，特別是在涉及小型資料集的情況下，其中微調預先訓練的網路至關重要。儘管基於注意力的架構越來越受歡迎，但我們觀察到，與 CNN 相比，它們在低資料量微調任務中的表現往往較差。我們還觀察到，與其他架構相比，某些 CNN 架構（例如 ConvNeXt、RegNet 和 EfficientNet）在各種網域上表現良好且一致。我們的研究結果提供了可操作的見解，說明不同主幹的效能取捨和有效性，有助於在廣泛的電腦視覺網域中進行模型選擇的明智決策。我們的程式碼可在此取得：https://github.com/pranavphoenix/Backbones</paragraph>", "author": "Pranav Jeevan et.al.", "authors": "Pranav Jeevan, Amit Sethi", "id": "2406.05612v1", "paper_url": "http://arxiv.org/abs/2406.05612v1", "repo": "https://github.com/pranavphoenix/Backbones"}}