{"2501.18738": {"publish_time": "2025-01-30", "title": "Examining the Robustness of Large Language Models across Language Complexity", "paper_summary": "With the advancement of large language models (LLMs), an increasing number of\nstudent models have leveraged LLMs to analyze textual artifacts generated by\nstudents to understand and evaluate their learning. These student models\ntypically employ pre-trained LLMs to vectorize text inputs into embeddings and\nthen use the embeddings to train models to detect the presence or absence of a\nconstruct of interest. However, how reliable and robust are these models at\nprocessing language with different levels of complexity? In the context of\nlearning where students may have different language backgrounds with various\nlevels of writing skills, it is critical to examine the robustness of such\nmodels to ensure that these models work equally well for text with varying\nlevels of language complexity. Coincidentally, a few (but limited) research\nstudies show that the use of language can indeed impact the performance of\nLLMs. As such, in the current study, we examined the robustness of several\nLLM-based student models that detect student self-regulated learning (SRL) in\nmath problem-solving. Specifically, we compared how the performance of these\nmodels vary using texts with high and low lexical, syntactic, and semantic\ncomplexity measured by three linguistic measures.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的進步，越來越多的學生模型利用 LLM 來分析學生產生的文本製品，以了解和評估他們的學習情況。這些學生模型通常採用預先訓練的 LLM，將文本輸入向量化為嵌入，然後使用嵌入來訓練模型，以檢測目標結構是否存在。然而，這些模型在處理不同複雜程度的語言時，其可靠性和穩健性如何？在學生可能具有不同語言背景和各種寫作技能的學習背景下，審查此類模型的穩健性至關重要，以確保這些模型對語言複雜程度不同的文本同樣有效。巧合的是，一些（但有限的）研究表明，語言的使用確實會影響 LLM 的效能。因此，在當前的研究中，我們檢驗了幾個基於 LLM 的學生模型的穩健性，這些模型可以檢測數學問題解決中的學生自我調節學習 (SRL)。具體來說，我們比較了這些模型使用語言複雜度由三種語言測量測得的高低詞彙、句法和語義複雜度的文本時，效能如何變化。", "author": "Jiayi Zhang et.al.", "authors": "Jiayi Zhang", "id": "2501.18738v1", "paper_url": "http://arxiv.org/abs/2501.18738v1", "repo": "null"}}