{"2408.08739": {"publish_time": "2024-08-16", "title": "ASVspoof 5: Crowdsourced Speech Data, Deepfakes, and Adversarial Attacks at Scale", "paper_summary": "ASVspoof 5 is the fifth edition in a series of challenges that promote the\nstudy of speech spoofing and deepfake attacks, and the design of detection\nsolutions. Compared to previous challenges, the ASVspoof 5 database is built\nfrom crowdsourced data collected from a vastly greater number of speakers in\ndiverse acoustic conditions. Attacks, also crowdsourced, are generated and\ntested using surrogate detection models, while adversarial attacks are\nincorporated for the first time. New metrics support the evaluation of\nspoofing-robust automatic speaker verification (SASV) as well as stand-alone\ndetection solutions, i.e., countermeasures without ASV. We describe the two\nchallenge tracks, the new database, the evaluation metrics, baselines, and the\nevaluation platform, and present a summary of the results. Attacks\nsignificantly compromise the baseline systems, while submissions bring\nsubstantial improvements.", "paper_summary_zh": "ASVspoof 5 是在促進語音欺騙和深度偽造攻擊的研究，以及設計偵測解決方案的挑戰系列中的第五版。與先前的挑戰相比，ASVspoof 5 資料庫是從大量更廣泛的講者在多樣化聲學條件下收集的群眾外包資料中建立的。攻擊，也是群眾外包的，使用代理偵測模型產生和測試，同時首次加入了對抗性攻擊。新的指標支援欺騙性強的自動說話者驗證 (SASV) 以及獨立偵測解決方案的評估，即沒有 ASV 的對策。我們描述了兩個挑戰軌道、新的資料庫、評估指標、基準和評估平台，並提供結果摘要。攻擊顯著地危害了基準系統，而提交則帶來了實質性的改進。", "author": "Xin Wang et.al.", "authors": "Xin Wang, Hector Delgado, Hemlata Tak, Jee-weon Jung, Hye-jin Shim, Massimiliano Todisco, Ivan Kukanov, Xuechen Liu, Md Sahidullah, Tomi Kinnunen, Nicholas Evans, Kong Aik Lee, Junichi Yamagishi", "id": "2408.08739v1", "paper_url": "http://arxiv.org/abs/2408.08739v1", "repo": "null"}}