{"2407.03302": {"publish_time": "2024-07-03", "title": "A Review of the Applications of Deep Learning-Based Emergent Communication", "paper_summary": "Emergent communication, or emergent language, is the field of research which\nstudies how human language-like communication systems emerge de novo in deep\nmulti-agent reinforcement learning environments. The possibilities of\nreplicating the emergence of a complex behavior like language have strong\nintuitive appeal, yet it is necessary to complement this with clear notions of\nhow such research can be applicable to other fields of science, technology, and\nengineering. This paper comprehensively reviews the applications of emergent\ncommunication research across machine learning, natural language processing,\nlinguistics, and cognitive science. Each application is illustrated with a\ndescription of its scope, an explication of emergent communication's unique\nrole in addressing it, a summary of the extant literature working towards the\napplication, and brief recommendations for near-term research directions.", "paper_summary_zh": "新興溝通，或新興語言，是研究人類語言類型的溝通系統如何在深度多重代理強化學習環境中從頭開始出現的研究領域。複製語言等複雜行為出現的可能性具有強烈的直覺吸引力，然而有必要補充明確的概念，說明此類研究如何適用於其他科學、技術和工程領域。本文全面回顧了新興溝通研究在機器學習、自然語言處理、語言學和認知科學中的應用。每個應用程式都附有其範圍說明、新興溝通在解決它時獨特角色的說明、致力於應用程式的既有文獻摘要，以及近期研究方向的簡要建議。", "author": "Brendon Boldt et.al.", "authors": "Brendon Boldt, David Mortensen", "id": "2407.03302v1", "paper_url": "http://arxiv.org/abs/2407.03302v1", "repo": "null"}}