{"2412.05968": {"publish_time": "2024-12-08", "title": "LVS-Net: A Lightweight Vessels Segmentation Network for Retinal Image Analysis", "paper_summary": "The analysis of retinal images for the diagnosis of various diseases is one\nof the emerging areas of research. Recently, the research direction has been\ninclined towards investigating several changes in retinal blood vessels in\nsubjects with many neurological disorders, including dementia. This research\nfocuses on detecting diseases early by improving the performance of models for\nsegmentation of retinal vessels with fewer parameters, which reduces\ncomputational costs and supports faster processing. This paper presents a novel\nlightweight encoder-decoder model that segments retinal vessels to improve the\nefficiency of disease detection. It incorporates multi-scale convolutional\nblocks in the encoder to accurately identify vessels of various sizes and\nthicknesses. The bottleneck of the model integrates the Focal Modulation\nAttention and Spatial Feature Refinement Blocks to refine and enhance essential\nfeatures for efficient segmentation. The decoder upsamples features and\nintegrates them with the corresponding feature in the encoder using skip\nconnections and the spatial feature refinement block at every upsampling stage\nto enhance feature representation at various scales. The estimated computation\ncomplexity of our proposed model is around 29.60 GFLOP with 0.71 million\nparameters and 2.74 MB of memory size, and it is evaluated using public\ndatasets, that is, DRIVE, CHASE\\_DB, and STARE. It outperforms existing models\nwith dice scores of 86.44\\%, 84.22\\%, and 87.88\\%, respectively.", "paper_summary_zh": "視網膜影像分析用於診斷各種疾病是新興的研究領域之一。最近，研究方向傾向於探討許多神經疾病（包括失智症）患者視網膜血管的各種變化。這項研究專注於透過改善視網膜血管分割模型的效能來及早偵測疾病，同時減少參數，以降低運算成本並支援更快速的處理。本文提出了一個新穎的輕量級編碼器-解碼器模型，用於分割視網膜血管以提高疾病偵測的效率。它在編碼器中結合了多尺度卷積區塊，以準確識別各種大小和厚度的血管。該模型的瓶頸整合了焦點調製注意力和空間特徵精化區塊，以精化和增強特徵，以進行有效的分割。解碼器對特徵進行上採樣，並在每個上採樣階段使用跳躍連接和空間特徵精化區塊將它們與編碼器中的對應特徵整合，以增強各種尺度的特徵表示。我們提出的模型的估計運算複雜度約為 29.60 GFLOP，參數為 0.71 百萬，記憶體大小為 2.74 MB，並使用公開的資料集（即 DRIVE、CHASE_DB 和 STARE）進行評估。它的骰子分數分別為 86.44%、84.22% 和 87.88%，優於現有模型。", "author": "Mehwish Mehmood et.al.", "authors": "Mehwish Mehmood, Shahzaib Iqbal, Tariq Mahmood Khan, Ivor Spence, Muhammad Fahim", "id": "2412.05968v1", "paper_url": "http://arxiv.org/abs/2412.05968v1", "repo": "null"}}