{"2411.18002": {"publish_time": "2024-11-27", "title": "An End-to-End Two-Stream Network Based on RGB Flow and Representation Flow for Human Action Recognition", "paper_summary": "With the rapid advancements in deep learning, computer vision tasks have seen\nsignificant improvements, making two-stream neural networks a popular focus for\nvideo based action recognition. Traditional models using RGB and optical flow\nstreams achieve strong performance but at a high computational cost. To address\nthis, we introduce a representation flow algorithm to replace the optical flow\nbranch in the egocentric action recognition model, enabling end-to-end training\nwhile reducing computational cost and prediction time. Our model, designed for\negocentric action recognition, uses class activation maps (CAMs) to improve\naccuracy and ConvLSTM for spatio temporal encoding with spatial attention. When\nevaluated on the GTEA61, EGTEA GAZE+, and HMDB datasets, our model matches the\naccuracy of the original model on GTEA61 and exceeds it by 0.65% and 0.84% on\nEGTEA GAZE+ and HMDB, respectively. Prediction runtimes are significantly\nreduced to 0.1881s, 0.1503s, and 0.1459s, compared to the original model's\n101.6795s, 25.3799s, and 203.9958s. Ablation studies were also conducted to\nstudy the impact of different parameters on model performance.\n  Keywords: two-stream, egocentric, action recognition, CAM, representation\nflow, CAM, ConvLSTM", "paper_summary_zh": "<paragraph>隨著深度學習的快速進展，電腦視覺任務已見顯著進步，使雙流神經網路成為基於影片動作辨識的熱門焦點。使用 RGB 和光流串流的傳統模型可達成強勁的效能，但計算成本高昂。為了解決此問題，我們引入表示流演算法來取代自我中心動作辨識模型中的光流分支，同時降低計算成本和預測時間，實現端到端訓練。我們的模型專為自我中心動作辨識而設計，使用類別激活圖 (CAM) 來提高準確度，並使用 ConvLSTM 進行時空編碼，並具備空間注意力。在 GTEA61、EGTEA GAZE+ 和 HMDB 資料集上進行評估時，我們的模型在 GTEA61 上與原始模型的準確度相符，而在 EGTEA GAZE+ 和 HMDB 上分別超過了 0.65% 和 0.84%。與原始模型的 101.6795 秒、25.3799 秒和 203.9958 秒相比，預測執行時間顯著降低至 0.1881 秒、0.1503 秒和 0.1459 秒。還進行了消融研究，以研究不同參數對模型效能的影響。\n關鍵字：雙流、自我中心、動作辨識、CAM、表示流、CAM、ConvLSTM</paragraph>", "author": "Song-Jiang Lai et.al.", "authors": "Song-Jiang Lai, Tsun-Hin Cheung, Ka-Chun Fung, Tian-Shan Liu, Kin-Man Lam", "id": "2411.18002v1", "paper_url": "http://arxiv.org/abs/2411.18002v1", "repo": "null"}}