{"2502.16459": {"publish_time": "2025-02-23", "title": "Deep learning approaches to surgical video segmentation and object detection: A Scoping Review", "paper_summary": "Introduction: Computer vision (CV) has had a transformative impact in\nbiomedical fields such as radiology, dermatology, and pathology. Its real-world\nadoption in surgical applications, however, remains limited. We review the\ncurrent state-of-the-art performance of deep learning (DL)-based CV models for\nsegmentation and object detection of anatomical structures in videos obtained\nduring surgical procedures.\n  Methods: We conducted a scoping review of studies on semantic segmentation\nand object detection of anatomical structures published between 2014 and 2024\nfrom 3 major databases - PubMed, Embase, and IEEE Xplore. The primary objective\nwas to evaluate the state-of-the-art performance of semantic segmentation in\nsurgical videos. Secondary objectives included examining DL models, progress\ntoward clinical applications, and the specific challenges with segmentation of\norgans/tissues in surgical videos.\n  Results: We identified 58 relevant published studies. These focused\npredominantly on procedures from general surgery [20(34.4%)], colorectal\nsurgery [9(15.5%)], and neurosurgery [8(13.8%)]. Cholecystectomy [14(24.1%)]\nand low anterior rectal resection [5(8.6%)] were the most common procedures\naddressed. Semantic segmentation [47(81%)] was the primary CV task. U-Net\n[14(24.1%)] and DeepLab [13(22.4%)] were the most widely used models. Larger\norgans such as the liver (Dice score: 0.88) had higher accuracy compared to\nsmaller structures such as nerves (Dice score: 0.49). Models demonstrated\nreal-time inference potential ranging from 5-298 frames-per-second (fps).\n  Conclusion: This review highlights the significant progress made in DL-based\nsemantic segmentation for surgical videos with real-time applicability,\nparticularly for larger organs. Addressing challenges with smaller structures,\ndata availability, and generalizability remains crucial for future\nadvancements.", "paper_summary_zh": "<paragraph>引言：電腦視覺 (CV) 已在放射科、皮膚科和病理學等生物醫學領域產生變革性影響。然而，它在外科應用中的實際應用仍然有限。我們回顧了在外科手術過程中獲得的影片中，基於深度學習 (DL) 的 CV 模型在解剖結構分割和物件偵測方面的現有最新技術表現。\n方法：我們對 2014 年至 2024 年間發表的解剖結構語意分割和物件偵測研究進行了範圍探討，資料來自 3 個主要資料庫 - PubMed、Embase 和 IEEE Xplore。主要目標是評估外科影片中語意分割的最新技術表現。次要目標包括檢查 DL 模型、朝向臨床應用邁進的進展，以及外科影片中器官/組織分割的具體挑戰。\n結果：我們找出 58 項相關已發表的研究所。這些研究主要集中在普通外科 [20(34.4%)], 大腸直腸外科 [9(15.5%)] 和神經外科 [8(13.8%)] 的手術。膽囊切除術 [14(24.1%)] 和低位前位直腸切除術 [5(8.6%)] 是最常見的手術。語意分割 [47(81%)] 是主要的 CV 任務。U-Net [14(24.1%)] 和 DeepLab [13(22.4%)] 是使用最廣泛的模型。與神經等較小的結構相比，肝臟等較大的器官（骰子分數：0.88）具有較高的準確度（骰子分數：0.49）。模型展示了從每秒 5-298 幀（fps）的即時推論潛力。\n結論：這篇回顧強調了基於 DL 的語意分割在外科影片中取得的顯著進展，具有即時適用的特性，特別是對於較大的器官。解決較小結構、資料可用性和可概括性的挑戰對於未來的進展仍然至關重要。</paragraph>", "author": "Devanish N. Kamtam et.al.", "authors": "Devanish N. Kamtam, Joseph B. Shrager, Satya Deepya Malla, Nicole Lin, Juan J. Cardona, Jake J. Kim, Clarence Hu", "id": "2502.16459v1", "paper_url": "http://arxiv.org/abs/2502.16459v1", "repo": "null"}}