{"2408.12185": {"publish_time": "2024-08-22", "title": "Rank and Align: Towards Effective Source-free Graph Domain Adaptation", "paper_summary": "Graph neural networks (GNNs) have achieved impressive performance in graph\ndomain adaptation. However, extensive source graphs could be unavailable in\nreal-world scenarios due to privacy and storage concerns. To this end, we\ninvestigate an underexplored yet practical problem of source-free graph domain\nadaptation, which transfers knowledge from source models instead of source\ngraphs to a target domain. To solve this problem, we introduce a novel\nGNN-based approach called Rank and Align (RNA), which ranks graph similarities\nwith spectral seriation for robust semantics learning, and aligns inharmonic\ngraphs with harmonic graphs which close to the source domain for subgraph\nextraction. In particular, to overcome label scarcity, we employ the spectral\nseriation algorithm to infer the robust pairwise rankings, which can guide\nsemantic learning using a similarity learning objective. To depict distribution\nshifts, we utilize spectral clustering and the silhouette coefficient to detect\nharmonic graphs, which the source model can easily classify. To reduce\npotential domain discrepancy, we extract domain-invariant subgraphs from\ninharmonic graphs by an adversarial edge sampling process, which guides the\ninvariant learning of GNNs. Extensive experiments on several benchmark datasets\ndemonstrate the effectiveness of our proposed RNA.", "paper_summary_zh": "圖形神經網路 (GNN) 在圖形領域適應中獲得令人印象深刻的效能。然而，廣泛的來源圖形在現實世界中可能由於隱私和儲存問題而無法使用。為此，我們探討了一個尚未開發但實用的來源免費圖形領域適應問題，它將知識從來源模型傳輸到目標領域，而不是來源圖形。為了解決這個問題，我們引入一種稱為排名和對齊 (RNA) 的新穎 GNN 方法，它使用光譜序列對圖形相似性進行排名以進行穩健語義學習，並將不和諧圖形與接近來源領域的和諧圖形對齊以進行子圖提取。特別是，為了克服標籤稀少性，我們採用光譜序列演算法來推斷穩健成對排名，它可以使用相似性學習目標來指導語義學習。為了描述分佈轉移，我們利用光譜聚類和輪廓係數來檢測和諧圖形，來源模型可以輕鬆對其進行分類。為了減少潛在的領域差異，我們通過對抗性邊緣取樣過程從不和諧圖形中提取領域不變子圖，這指導了 GNN 的不變學習。在幾個基準資料集上的廣泛實驗證明了我們提出的 RNA 的有效性。", "author": "Junyu Luo et.al.", "authors": "Junyu Luo, Zhiping Xiao, Yifan Wang, Xiao Luo, Jingyang Yuan, Wei Ju, Langechuan Liu, Ming Zhang", "id": "2408.12185v1", "paper_url": "http://arxiv.org/abs/2408.12185v1", "repo": "null"}}