{"2502.12052": {"publish_time": "2025-02-17", "title": "A Dual-Perspective NLG Meta-Evaluation Framework with Automatic Benchmark and Better Interpretability", "paper_summary": "In NLG meta-evaluation, evaluation metrics are typically assessed based on\ntheir consistency with humans. However, we identify some limitations in\ntraditional NLG meta-evaluation approaches, such as issues in handling human\nratings and ambiguous selections of correlation measures, which undermine the\neffectiveness of meta-evaluation. In this work, we propose a dual-perspective\nNLG meta-evaluation framework that focuses on different evaluation\ncapabilities, thereby providing better interpretability. In addition, we\nintroduce a method of automatically constructing the corresponding benchmarks\nwithout requiring new human annotations. Furthermore, we conduct experiments\nwith 16 representative LLMs as the evaluators based on our proposed framework,\ncomprehensively analyzing their evaluation performance from different\nperspectives.", "paper_summary_zh": "在 NLG 元評估中，評估指標通常根據其與人類的一致性進行評估。然而，我們在傳統的 NLG 元評估方法中發現了一些限制，例如在處理人類評分和模稜兩可的相關性測量選擇方面存在問題，這會損害元評估的有效性。在這項工作中，我們提出了一個雙視角 NLG 元評估框架，該框架專注於不同的評估能力，從而提供更好的可解釋性。此外，我們引入了一種自動構建相應基準的方法，而不需要新的手動註釋。此外，我們根據我們提出的框架對 16 個具有代表性的 LLM 作為評估器進行了實驗，從不同的角度全面分析了它們的評估性能。", "author": "Xinyu Hu et.al.", "authors": "Xinyu Hu, Mingqi Gao, Li Lin, Zhenghan Yu, Xiaojun Wan", "id": "2502.12052v1", "paper_url": "http://arxiv.org/abs/2502.12052v1", "repo": "null"}}