{"2411.03888": {"publish_time": "2024-11-06", "title": "Multi3Hate: Multimodal, Multilingual, and Multicultural Hate Speech Detection with Vision-Language Models", "paper_summary": "Warning: this paper contains content that may be offensive or upsetting\n  Hate speech moderation on global platforms poses unique challenges due to the\nmultimodal and multilingual nature of content, along with the varying cultural\nperceptions. How well do current vision-language models (VLMs) navigate these\nnuances? To investigate this, we create the first multimodal and multilingual\nparallel hate speech dataset, annotated by a multicultural set of annotators,\ncalled Multi3Hate. It contains 300 parallel meme samples across 5 languages:\nEnglish, German, Spanish, Hindi, and Mandarin. We demonstrate that cultural\nbackground significantly affects multimodal hate speech annotation in our\ndataset. The average pairwise agreement among countries is just 74%,\nsignificantly lower than that of randomly selected annotator groups. Our\nqualitative analysis indicates that the lowest pairwise label agreement-only\n67% between the USA and India-can be attributed to cultural factors. We then\nconduct experiments with 5 large VLMs in a zero-shot setting, finding that\nthese models align more closely with annotations from the US than with those\nfrom other cultures, even when the memes and prompts are presented in the\ndominant language of the other culture. Code and dataset are available at\nhttps://github.com/MinhDucBui/Multi3Hate.", "paper_summary_zh": "警告：本文包含可能令人反感或不安的內容\n由於內容的多模態和多語言性質以及不同的文化觀念，在全球平台上對仇恨言論進行審核會帶來獨特挑戰。當前的視覺語言模型 (VLM) 在處理這些細微差別方面表現如何？為了解決此問題，我們建立了第一個由多元文化標註者標註的多模態和多語言平行仇恨言論數據集，稱為 Multi3Hate。它包含 5 種語言的 300 個平行迷因樣本：英語、德語、西班牙語、印地語和普通話。我們證明，文化背景會顯著影響我們數據集中對多模態仇恨言論的標註。各國之間的平均成對一致性僅為 74%，顯著低於隨機選擇的標註者組。我們的定性分析表明，最低的成對標籤一致性——美國和印度之間僅為 67%——可歸因於文化因素。然後，我們在零次學習設置中對 5 個大型 VLM 進行了實驗，發現這些模型與美國的標註更一致，而不是與其他文化的標註更一致，即使迷因和提示以其他文化的語言呈現。程式碼和數據集可在 https://github.com/MinhDucBui/Multi3Hate 找到。", "author": "Minh Duc Bui et.al.", "authors": "Minh Duc Bui, Katharina von der Wense, Anne Lauscher", "id": "2411.03888v1", "paper_url": "http://arxiv.org/abs/2411.03888v1", "repo": "https://github.com/minhducbui/multi3hate"}}