{"2411.15976": {"publish_time": "2024-11-24", "title": "DRIVE: Dual-Robustness via Information Variability and Entropic Consistency in Source-Free Unsupervised Domain Adaptation", "paper_summary": "Adapting machine learning models to new domains without labeled data,\nespecially when source data is inaccessible, is a critical challenge in\napplications like medical imaging, autonomous driving, and remote sensing. This\ntask, known as Source-Free Unsupervised Domain Adaptation (SFUDA), involves\nadapting a pre-trained model to a target domain using only unlabeled target\ndata, which can lead to issues such as overfitting, underfitting, and poor\ngeneralization due to domain discrepancies and noise. Existing SFUDA methods\noften rely on single-model architectures, struggling with uncertainty and\nvariability in the target domain. To address these challenges, we propose DRIVE\n(Dual-Robustness through Information Variability and Entropy), a novel SFUDA\nframework leveraging a dual-model architecture. The two models, initialized\nwith identical weights, work in parallel to capture diverse target domain\ncharacteristics. One model is exposed to perturbations via projection gradient\ndescent (PGD) guided by mutual information, focusing on high-uncertainty\nregions. We also introduce an entropy-aware pseudo-labeling strategy that\nadjusts label weights based on prediction uncertainty, ensuring the model\nfocuses on reliable data while avoiding noisy regions. The adaptation process\nhas two stages: the first aligns the models on stable features using a mutual\ninformation consistency loss, and the second dynamically adjusts the\nperturbation level based on the loss from the first stage, encouraging the\nmodel to explore a broader range of the target domain while preserving existing\nperformance. This enhances generalization capabilities and robustness against\ninterference. Evaluations on standard SFUDA benchmarks show that DRIVE\nconsistently outperforms previous methods, delivering improved adaptation\naccuracy and stability across complex target domains.", "paper_summary_zh": "<paragraph>在沒有標籤資料的情況下將機器學習模型調整到新的領域，特別是在無法取得原始資料時，是醫療影像、自動駕駛和遙測等應用中的一項關鍵挑戰。這項任務稱為無來源非監督領域適應 (SFUDA)，涉及使用僅有的未標籤目標資料將預先訓練的模型調整到目標領域，這可能會導致過度擬合、欠擬合和因領域差異和雜訊而導致的概化不良等問題。現有的 SFUDA 方法通常依賴於單一模型架構，難以應對目標領域中的不確定性和變異性。為了應對這些挑戰，我們提出了 DRIVE（透過資訊變異性和熵的雙重穩健性），一種利用雙模型架構的新穎 SFUDA 架構。這兩個模型以相同的權重初始化，並行工作以擷取不同的目標領域特徵。其中一個模型透過由互資訊引導的投影梯度下降 (PGD) 暴露於擾動，重點在於高度不確定的區域。我們還引入了一種熵感知偽標籤策略，該策略根據預測不確定性調整標籤權重，確保模型專注於可靠的資料，同時避免雜訊區域。適應過程分為兩個階段：第一個階段使用互資訊一致性損失在穩定特徵上對齊模型，第二個階段根據第一個階段的損失動態調整擾動級別，鼓勵模型探索目標領域的更廣泛範圍，同時保留現有的效能。這增強了概化能力和對干擾的穩健性。在標準 SFUDA 基準上的評估顯示，DRIVE 持續優於先前的各種方法，在複雜的目標領域中提供改善的適應準確性和穩定性。</paragraph>", "author": "Ruiqiang Xiao et.al.", "authors": "Ruiqiang Xiao, Songning Lai, Yijun Yang, Jiemin Wu, Yutao Yue, Lei Zhu", "id": "2411.15976v1", "paper_url": "http://arxiv.org/abs/2411.15976v1", "repo": "null"}}