{"2406.04215": {"publish_time": "2024-06-06", "title": "mCSQA: Multilingual Commonsense Reasoning Dataset with Unified Creation Strategy by Language Models and Humans", "paper_summary": "It is very challenging to curate a dataset for language-specific knowledge\nand common sense in order to evaluate natural language understanding\ncapabilities of language models. Due to the limitation in the availability of\nannotators, most current multilingual datasets are created through translation,\nwhich cannot evaluate such language-specific aspects. Therefore, we propose\nMultilingual CommonsenseQA (mCSQA) based on the construction process of CSQA\nbut leveraging language models for a more efficient construction, e.g., by\nasking LM to generate questions/answers, refine answers and verify QAs followed\nby reduced human efforts for verification. Constructed dataset is a benchmark\nfor cross-lingual language-transfer capabilities of multilingual LMs, and\nexperimental results showed high language-transfer capabilities for questions\nthat LMs could easily solve, but lower transfer capabilities for questions\nrequiring deep knowledge or commonsense. This highlights the necessity of\nlanguage-specific datasets for evaluation and training. Finally, our method\ndemonstrated that multilingual LMs could create QA including language-specific\nknowledge, significantly reducing the dataset creation cost compared to manual\ncreation. The datasets are available at\nhttps://huggingface.co/datasets/yusuke1997/mCSQA.", "paper_summary_zh": "對於語言特定的知識和常識，要策展一個資料集以便評估語言模型的自然語言理解能力，是一件非常具有挑戰性的事情。由於標註員的可用性有限，目前大多數多語言資料集都是透過翻譯建立的，而翻譯無法評估此類語言特定的面向。因此，我們提出了多語言常識問答 (mCSQA)，其建立過程是基於 CSQA，但利用語言模型來進行更有效率的建立，例如讓語言模型產生問題/答案、精煉答案，並驗證 QA，然後再減少人工驗證的工作。建立的資料集是多語言語言模型跨語言語言轉移能力的基準，而實驗結果顯示，對於語言模型可以輕易解決的問題，其語言轉移能力很高，但對於需要深入知識或常識的問題，其轉移能力較低。這突顯了語言特定資料集對於評估和訓練的必要性。最後，我們的方法證明了多語言語言模型可以建立包含語言特定知識的 QA，與人工建立相比，大幅降低了資料集建立成本。資料集可在 https://huggingface.co/datasets/yusuke1997/mCSQA 取得。", "author": "Yusuke Sakai et.al.", "authors": "Yusuke Sakai, Hidetaka Kamigaito, Taro Watanabe", "id": "2406.04215v1", "paper_url": "http://arxiv.org/abs/2406.04215v1", "repo": "null"}}