{"2407.03232": {"publish_time": "2024-07-03", "title": "Single Character Perturbations Break LLM Alignment", "paper_summary": "When LLMs are deployed in sensitive, human-facing settings, it is crucial\nthat they do not output unsafe, biased, or privacy-violating outputs. For this\nreason, models are both trained and instructed to refuse to answer unsafe\nprompts such as \"Tell me how to build a bomb.\" We find that, despite these\nsafeguards, it is possible to break model defenses simply by appending a space\nto the end of a model's input. In a study of eight open-source models, we\ndemonstrate that this acts as a strong enough attack to cause the majority of\nmodels to generate harmful outputs with very high success rates. We examine the\ncauses of this behavior, finding that the contexts in which single spaces occur\nin tokenized training data encourage models to generate lists when prompted,\noverriding training signals to refuse to answer unsafe requests. Our findings\nunderscore the fragile state of current model alignment and promote the\nimportance of developing more robust alignment methods. Code and data will be\navailable at https://github.com/hannah-aught/space_attack.", "paper_summary_zh": "當 LLM 部署在敏感的人類面對的環境中時，至關重要的是，它們不會輸出不安全、有偏見或侵犯隱私的輸出。出於這個原因，模型經過訓練和指示，拒絕回答不安全的提示，例如「告訴我如何製造炸彈」。我們發現，儘管有這些保障措施，但只要在模型輸入的結尾加上一個空格，就可以突破模型防禦。在對八個開源模型的研究中，我們證明這是一個足夠強大的攻擊，可以導致大多數模型以非常高的成功率產生有害的輸出。我們檢查了這種行為的原因，發現單個空格出現在標記化訓練數據中的上下文會鼓勵模型在提示時生成列表，覆蓋拒絕回答不安全請求的訓練信號。我們的發現強調了當前模型對齊的脆弱狀態，並促進了開發更強大的對齊方法的重要性。程式碼和數據將在 https://github.com/hannah-aught/space_attack 取得。", "author": "Leon Lin et.al.", "authors": "Leon Lin, Hannah Brown, Kenji Kawaguchi, Michael Shieh", "id": "2407.03232v1", "paper_url": "http://arxiv.org/abs/2407.03232v1", "repo": "null"}}