{"2407.13408": {"publish_time": "2024-07-18", "title": "DISCOVER: A Data-driven Interactive System for Comprehensive Observation, Visualization, and ExploRation of Human Behaviour", "paper_summary": "Understanding human behavior is a fundamental goal of social sciences, yet\nits analysis presents significant challenges. Conventional methodologies\nemployed for the study of behavior, characterized by labor-intensive data\ncollection processes and intricate analyses, frequently hinder comprehensive\nexploration due to their time and resource demands. In response to these\nchallenges, computational models have proven to be promising tools that help\nresearchers analyze large amounts of data by automatically identifying\nimportant behavioral indicators, such as social signals. However, the\nwidespread adoption of such state-of-the-art computational models is impeded by\ntheir inherent complexity and the substantial computational resources necessary\nto run them, thereby constraining accessibility for researchers without\ntechnical expertise and adequate equipment. To address these barriers, we\nintroduce DISCOVER -- a modular and flexible, yet user-friendly software\nframework specifically developed to streamline computational-driven data\nexploration for human behavior analysis. Our primary objective is to\ndemocratize access to advanced computational methodologies, thereby enabling\nresearchers across disciplines to engage in detailed behavioral analysis\nwithout the need for extensive technical proficiency. In this paper, we\ndemonstrate the capabilities of DISCOVER using four exemplary data exploration\nworkflows that build on each other: Interactive Semantic Content Exploration,\nVisual Inspection, Aided Annotation, and Multimodal Scene Search. By\nillustrating these workflows, we aim to emphasize the versatility and\naccessibility of DISCOVER as a comprehensive framework and propose a set of\nblueprints that can serve as a general starting point for exploratory data\nanalysis.", "paper_summary_zh": "<paragraph>了解人類行為是社會科學的基本目標，但其分析卻面臨著重大的挑戰。傳統上用於行為研究的方法，其特徵是勞動密集型的資料收集過程和複雜的分析，由於時間和資源需求，常常阻礙全面的探索。為了應對這些挑戰，計算模型已被證明是一種很有前途的工具，它可以通過自動識別重要的行為指標（例如社交信號）來幫助研究人員分析大量的資料。然而，這些最先進的計算模型的廣泛採用受到其固有的複雜性和運行它們所需的巨大計算資源的阻礙，從而限制了沒有技術專長和適當設備的研究人員的可及性。為了消除這些障礙，我們引入了 DISCOVER——一個模組化且靈活但又友好的軟體框架，專門開發用於簡化計算驅動的資料探索以進行人類行為分析。我們的首要目標是使先進的計算方法民主化，從而使各個學科的研究人員能夠從事詳細的行為分析，而無需廣泛的技術能力。在本文中，我們使用四個範例資料探索工作流程展示了 DISCOVER 的功能，這些工作流程相互建立：互動式語義內容探索、視覺檢查、輔助註解和多模態場景搜索。通過說明這些工作流程，我們旨在強調 DISCOVER 作為一個綜合框架的多功能性和可及性，並提出了一組藍圖，可以用作探索性資料分析的通用起點。</paragraph>", "author": "Dominik Schiller et.al.", "authors": "Dominik Schiller, Tobias Hallmen, Daksitha Withanage Don, Elisabeth André, Tobias Baur", "id": "2407.13408v1", "paper_url": "http://arxiv.org/abs/2407.13408v1", "repo": "null"}}