{"2411.13365": {"publish_time": "2024-11-20", "title": "Explainable Finite-Memory Policies for Partially Observable Markov Decision Processes", "paper_summary": "Partially Observable Markov Decision Processes (POMDPs) are a fundamental\nframework for decision-making under uncertainty and partial observability.\nSince in general optimal policies may require infinite memory, they are hard to\nimplement and often render most problems undecidable. Consequently,\nfinite-memory policies are mostly considered instead. However, the algorithms\nfor computing them are typically very complex, and so are the resulting\npolicies. Facing the need for their explainability, we provide a representation\nof such policies, both (i) in an interpretable formalism and (ii) typically of\nsmaller size, together yielding higher explainability. To that end, we combine\nmodels of Mealy machines and decision trees; the latter describing simple,\nstationary parts of the policies and the former describing how to switch among\nthem. We design a translation for policies of the finite-state-controller (FSC)\nform from standard literature and show how our method smoothly generalizes to\nother variants of finite-memory policies. Further, we identify specific\nproperties of recently used \"attractor-based\" policies, which allow us to\nconstruct yet simpler and smaller representations. Finally, we illustrate the\nhigher explainability in a few case studies.", "paper_summary_zh": "部分可觀察馬可夫決策過程 (POMDP) 是在不確定性和部分可觀察性下的決策制定基礎架構。由於一般最佳策略可能需要無限記憶，因此它們難以實作，而且通常會讓大多數問題無法判定。因此，大多數情況下會考慮有限記憶策略。然而，用於計算它們的演算法通常非常複雜，所產生的策略也是如此。面對需要解釋它們的情況，我們提供此類策略的表示，（i）以可解釋的形式和（ii）通常較小的規模，共同產生更高的可解釋性。為此，我們結合了 Mealy 機器和決策樹模型；後者描述策略的簡單、穩定的部分，前者描述如何在其中進行切換。我們設計了一種從標準文獻中轉換有限狀態控制器 (FSC) 形式策略的方法，並展示了我們的這種方法如何順利推廣到其他版本的有限記憶策略。此外，我們找出最近使用的「基於吸引子」策略的特定屬性，這些屬性讓我們能夠建構更簡單、更小的表示。最後，我們在幾個案例研究中說明了更高的可解釋性。", "author": "Muqsit Azeem et.al.", "authors": "Muqsit Azeem, Debraj Chakraborty, Sudeep Kanav, Jan Kretinsky", "id": "2411.13365v1", "paper_url": "http://arxiv.org/abs/2411.13365v1", "repo": "null"}}