{"2407.21300": {"publish_time": "2024-07-31", "title": "Implementing Streaming algorithm and k-means clusters to RAG", "paper_summary": "Retrieval-augmented generation (RAG) has achieved great success in\ninformation retrieval to assist large models because it builds an external\nknowledge database. However, it also has many problems: it consumes a lot of\nmemory because of the huge database. When faced with massive streaming data, it\nis unable to update the established index database in time. To save the memory\nof building the database and maintain accuracy simultaneously, we proposed a\nnew approach combining a streaming algorithm and k-means cluster with RAG. Our\napproach applies a streaming algorithm to update the index and reduce memory\nconsumption. Then use the k-means algorithm to cluster documents with high\nsimilarities together, the query time will be shortened by doing this. We\nconducted comparative experiments on four methods, and the results show that\nRAG with streaming algorithm and k-means cluster performs well in accuracy and\nmemory. For massive streaming data, we find that our method behaves better than\ntraditional RAG", "paper_summary_zh": "檢索增強式生成（RAG）在資訊檢索方面已取得巨大成功，可協助大型模型建置外部知識資料庫。然而，它也存在許多問題：由於資料庫龐大，它會消耗大量記憶體。當面對大量串流資料時，它無法即時更新已建立的索引資料庫。為了同時節省建置資料庫的記憶體並維持準確性，我們提出了一種結合串流演算法和 k 平均值群集與 RAG 的新方法。我們的做法是應用串流演算法來更新索引並減少記憶體消耗。然後使用 k 平均值演算法將相似度高的文件分群，這樣可以縮短查詢時間。我們對四種方法進行了比較實驗，結果顯示，採用串流演算法和 k 平均值群集的 RAG 在準確性和記憶體方面表現良好。對於大量串流資料，我們發現我們的做法優於傳統 RAG", "author": "Haoyu Kang et.al.", "authors": "Haoyu Kang, Yuzhou Zhu, Yukun Zhong, Ke Wang", "id": "2407.21300v1", "paper_url": "http://arxiv.org/abs/2407.21300v1", "repo": "null"}}