{"2405.17067": {"publish_time": "2024-05-27", "title": "Tokenization Matters! Degrading Large Language Models through Challenging Their Tokenization", "paper_summary": "Large Language Models (LLMs) have shown remarkable capabilities in language\nunderstanding and generation. Nonetheless, it was also witnessed that LLMs tend\nto produce inaccurate responses to specific queries. This deficiency can be\ntraced to the tokenization step LLMs must undergo, which is an inevitable\nlimitation inherent to all LLMs. In fact, incorrect tokenization is the\ncritical point that hinders LLMs in understanding the input precisely, thus\nleading to unsatisfactory output. To demonstrate this flaw of LLMs, we\nconstruct an adversarial dataset, named as $\\textbf{ADT (Adversarial Dataset\nfor Tokenizer)}$, which draws upon the vocabularies of various open-source LLMs\nto challenge LLMs' tokenization. ADT consists of two subsets: the manually\nconstructed ADT-Human and the automatically generated ADT-Auto. Our empirical\nresults reveal that our ADT is highly effective on challenging the tokenization\nof leading LLMs, including GPT-4o, Llama-3, Qwen2.5-max and so on, thus\ndegrading these LLMs' capabilities. Moreover, our method of automatic data\ngeneration has been proven efficient and robust, which can be applied to any\nopen-source LLMs. To the best of our knowledge, our study is the first to\ninvestigating LLMs' vulnerability in terms of challenging their token\nsegmentation, which will shed light on the subsequent research of improving\nLLMs' capabilities through optimizing their tokenization process and\nalgorithms.", "paper_summary_zh": "大型語言模型 (LLM) 在語言理解和生成方面展現出驚人的能力。儘管如此，我們也觀察到 LLM 傾向於對特定查詢產生不準確的回應。這種缺陷可以追溯到 LLM 必須經歷的標記化步驟，這是所有 LLM 固有的不可避免的限制。事實上，不正確的標記化是阻礙 LLM 精確理解輸入的關鍵點，從而導致不令人滿意的輸出。為了證明 LLM 的這個缺陷，我們構建了一個對抗性資料集，稱為 $\\textbf{ADT（標記化對抗性資料集）}$，它利用了各種開源 LLM 的詞彙來挑戰 LLM 的標記化。ADT 包含兩個子集：手動構建的 ADT-Human 和自動生成的 ADT-Auto。我們的實證結果表明，我們的 ADT 在挑戰包括 GPT-4o、Llama-3、Qwen2.5-max 等領先 LLM 的標記化方面非常有效，從而降低了這些 LLM 的能力。此外，我們的自動資料生成方法已被證明是高效且強大的，可以應用於任何開源 LLM。據我們所知，我們的研究是第一個在挑戰 LLM 的標記分割方面的漏洞進行調查的研究，這將為通過優化其標記化過程和演算法來改進 LLM 能力的後續研究提供指引。", "author": "Dixuan Wang et.al.", "authors": "Dixuan Wang, Yanda Li, Junyuan Jiang, Zepeng Ding, Guochao Jiang, Jiaqing Liang, Deqing Yang", "id": "2405.17067v1", "paper_url": "http://arxiv.org/abs/2405.17067v1", "repo": "null"}}