{"2501.13758": {"publish_time": "2025-01-23", "title": "2-Tier SimCSE: Elevating BERT for Robust Sentence Embeddings", "paper_summary": "Effective sentence embeddings that capture semantic nuances and generalize\nwell across diverse contexts are crucial for natural language processing tasks.\nWe address this challenge by applying SimCSE (Simple Contrastive Learning of\nSentence Embeddings) using contrastive learning to fine-tune the minBERT model\nfor sentiment analysis, semantic textual similarity (STS), and paraphrase\ndetection. Our contributions include experimenting with three different dropout\ntechniques, namely standard dropout, curriculum dropout, and adaptive dropout,\nto tackle overfitting, proposing a novel 2-Tier SimCSE Fine-tuning Model that\ncombines both unsupervised and supervised SimCSE on STS task, and exploring\ntransfer learning potential for Paraphrase and SST tasks. Our findings\ndemonstrate the effectiveness of SimCSE, with the 2-Tier model achieving\nsuperior performance on the STS task, with an average test score of 0.742\nacross all three downstream tasks. The results of error analysis reveals\nchallenges in handling complex sentiments and reliance on lexical overlap for\nparaphrase detection, highlighting areas for future research. The ablation\nstudy revealed that removing Adaptive Dropout in the Single-Task Unsupervised\nSimCSE Model led to improved performance on the STS task, indicating\noverfitting due to added parameters. Transfer learning from SimCSE models on\nParaphrase and SST tasks did not enhance performance, suggesting limited\ntransferability of knowledge from the STS task.", "paper_summary_zh": "有效的句子嵌入可以捕捉语义细微差别，并在不同的语境中很好地概括，这对自然语言处理任务至关重要。\n我们通过应用 SimCSE（句子嵌入的简单对比学习）来解决这一挑战，使用对比学习对 minBERT 模型进行微调，以进行情感分析、语义文本相似性 (STS) 和释义检测。我们的贡献包括尝试使用三种不同的 dropout 技术，即标准 dropout、课程 dropout 和自适应 dropout，以解决过度拟合问题，提出了一种新颖的 2 层 SimCSE 微调模型，该模型结合了 STS 任务中的无监督和有监督 SimCSE，并探索了释义和 SST 任务的迁移学习潜力。我们的研究结果证明了 SimCSE 的有效性，2 层模型在 STS 任务上取得了卓越的性能，在所有三个下游任务中的平均测试得分为 0.742。错误分析的结果揭示了在处理复杂情感和依赖词法重叠进行释义检测方面的挑战，突出了未来研究的领域。消融研究表明，在单任务无监督 SimCSE 模型中移除自适应 Dropout 会提高 STS 任务的性能，这表明由于添加了参数而导致过度拟合。从 SimCSE 模型到释义和 SST 任务的迁移学习并没有提高性能，这表明从 STS 任务中获取知识的可转移性有限。", "author": "Yumeng Wang et.al.", "authors": "Yumeng Wang, Ziran Zhou, Junjin Wang", "id": "2501.13758v1", "paper_url": "http://arxiv.org/abs/2501.13758v1", "repo": "null"}}