{"2409.05292": {"publish_time": "2024-09-09", "title": "Mpox Narrative on Instagram: A Labeled Multilingual Dataset of Instagram Posts on Mpox for Sentiment, Hate Speech, and Anxiety Analysis", "paper_summary": "The world is currently experiencing an outbreak of mpox, which has been\ndeclared a Public Health Emergency of International Concern by WHO. No prior\nwork related to social media mining has focused on the development of a dataset\nof Instagram posts about the mpox outbreak. The work presented in this paper\naims to address this research gap and makes two scientific contributions to\nthis field. First, it presents a multilingual dataset of 60,127 Instagram posts\nabout mpox, published between July 23, 2022, and September 5, 2024. The\ndataset, available at https://dx.doi.org/10.21227/7fvc-y093, contains Instagram\nposts about mpox in 52 languages. For each of these posts, the Post ID, Post\nDescription, Date of publication, language, and translated version of the post\n(translation to English was performed using the Google Translate API) are\npresented as separate attributes in the dataset. After developing this dataset,\nsentiment analysis, hate speech detection, and anxiety or stress detection were\nperformed. This process included classifying each post into (i) one of the\nsentiment classes, i.e., fear, surprise, joy, sadness, anger, disgust, or\nneutral, (ii) hate or not hate, and (iii) anxiety/stress detected or no\nanxiety/stress detected. These results are presented as separate attributes in\nthe dataset. Second, this paper presents the results of performing sentiment\nanalysis, hate speech analysis, and anxiety or stress analysis. The variation\nof the sentiment classes - fear, surprise, joy, sadness, anger, disgust, and\nneutral were observed to be 27.95%, 2.57%, 8.69%, 5.94%, 2.69%, 1.53%, and\n50.64%, respectively. In terms of hate speech detection, 95.75% of the posts\ndid not contain hate and the remaining 4.25% of the posts contained hate.\nFinally, 72.05% of the posts did not indicate any anxiety/stress, and the\nremaining 27.95% of the posts represented some form of anxiety/stress.", "paper_summary_zh": "<paragraph>目前，全球正經歷猴痘疫情，世界衛生組織已宣布為國際關注的公共衛生緊急事件。此前，沒有與社群媒體探勘相關的研究專注於開發關於猴痘疫情的 Instagram 貼文資料集。本論文提出的研究旨在解決這個研究缺口，並對此領域做出兩項科學貢獻。首先，它提供了 60,127 則關於猴痘的 Instagram 多語言貼文資料集，這些貼文發布於 2022 年 7 月 23 日至 2024 年 9 月 5 日之間。該資料集可於 https://dx.doi.org/10.21227/7fvc-y093 取得，其中包含 52 種語言的關於猴痘的 Instagram 貼文。對於這些貼文中的每則貼文，貼文 ID、貼文說明、發布日期、語言和貼文的翻譯版本（使用 Google 翻譯 API 翻譯成英文）都以資料集中的獨立屬性呈現。在開發此資料集後，執行了情緒分析、仇恨言論偵測和焦慮或壓力偵測。此程序包括將每則貼文分類為 (i) 情緒類別之一，例如恐懼、驚訝、喜悅、悲傷、憤怒、厭惡或中立，(ii) 仇恨或非仇恨，以及 (iii) 偵測到焦慮/壓力或未偵測到焦慮/壓力。這些結果以資料集中的獨立屬性呈現。其次，本論文提供了執行情緒分析、仇恨言論分析和焦慮或壓力分析的結果。觀察到情緒類別（恐懼、驚訝、喜悅、悲傷、憤怒、厭惡和中立）的變化分別為 27.95%、2.57%、8.69%、5.94%、2.69%、1.53% 和 50.64%。在仇恨言論偵測方面，95.75% 的貼文不包含仇恨，其餘 4.25% 的貼文包含仇恨。最後，72.05% 的貼文沒有顯示任何焦慮/壓力，其餘 27.95% 的貼文則代表某種形式的焦慮/壓力。</paragraph>", "author": "Nirmalya Thakur et.al.", "authors": "Nirmalya Thakur", "id": "2409.05292v3", "paper_url": "http://arxiv.org/abs/2409.05292v3", "repo": "null"}}