{"2501.02950": {"publish_time": "2025-01-06", "title": "Key-value memory in the brain", "paper_summary": "Classical models of memory in psychology and neuroscience rely on\nsimilarity-based retrieval of stored patterns, where similarity is a function\nof retrieval cues and the stored patterns. While parsimonious, these models do\nnot allow distinct representations for storage and retrieval, despite their\ndistinct computational demands. Key-value memory systems, in contrast,\ndistinguish representations used for storage (values) and those used for\nretrieval (keys). This allows key-value memory systems to optimize\nsimultaneously for fidelity in storage and discriminability in retrieval. We\nreview the computational foundations of key-value memory, its role in modern\nmachine learning systems, related ideas from psychology and neuroscience,\napplications to a number of empirical puzzles, and possible biological\nimplementations.", "paper_summary_zh": "古典心理學和神經科學的記憶模型依賴於儲存模式的相似性檢索，其中相似性是檢索線索和儲存模式的函數。儘管節儉，但這些模型不允許儲存和檢索有不同的表示，儘管它們有不同的計算需求。相反，鍵值記憶系統區分用於儲存（值）的表示和用於檢索（鍵）的表示。這允許鍵值記憶系統同時優化儲存中的保真度和檢索中的可辨別性。我們回顧了鍵值記憶的計算基礎、它在現代機器學習系統中的作用、心理學和神經科學的相關思想、對許多經驗謎題的應用，以及可能的生物學實現。", "author": "Samuel J. Gershman et.al.", "authors": "Samuel J. Gershman, Ila Fiete, Kazuki Irie", "id": "2501.02950v1", "paper_url": "http://arxiv.org/abs/2501.02950v1", "repo": "https://github.com/kazuki-irie/kv-memory-brain"}}