{"2502.06814": {"publish_time": "2025-02-04", "title": "Diffusion Instruction Tuning", "paper_summary": "We introduce Lavender, a simple supervised fine-tuning (SFT) method that\nboosts the performance of advanced vision-language models (VLMs) by leveraging\nstate-of-the-art image generation models such as Stable Diffusion.\nSpecifically, Lavender aligns the text-vision attention in the VLM transformer\nwith the equivalent used by Stable Diffusion during SFT, instead of adapting\nseparate encoders. This alignment enriches the model's visual understanding and\nsignificantly boosts performance across in- and out-of-distribution tasks.\nLavender requires just 0.13 million training examples, 2.5% of typical\nlarge-scale SFT datasets, and fine-tunes on standard hardware (8 GPUs) in a\nsingle day. It consistently improves state-of-the-art open-source multimodal\nLLMs (e.g., Llama-3.2-11B, MiniCPM-Llama3-v2.5), achieving up to 30% gains and\na 68% boost on challenging out-of-distribution medical QA tasks. By efficiently\ntransferring the visual expertise of image generators with minimal supervision,\nLavender offers a scalable solution for more accurate vision-language systems.\nAll code, training data, and models will be shared at\nhttps://astrazeneca.github.io/vlm/.", "paper_summary_zh": "<paragraph>我們介紹 Lavender，一種簡單的監督微調 (SFT) 方法，它透過利用 Stable Diffusion 等最先進的影像生成模型來提升先進視覺語言模型 (VLM) 的效能。\n具體來說，Lavender 在 SFT 期間將 VLM 轉換器中的文字視覺注意力與 Stable Diffusion 使用的等效注意力對齊，而不是調整單獨的編碼器。此對齊豐富了模型的視覺理解，並顯著提升了分佈內外任務的效能。\nLavender 只需要 0.13 百萬個訓練範例，相當於典型大型 SFT 資料集的 2.5%，並在標準硬體 (8 個 GPU) 上於一天內進行微調。它持續改善最先進的開放原始碼多模態 LLM（例如 Llama-3.2-11B、MiniCPM-Llama3-v2.5），在具有挑戰性的分佈外醫療 QA 任務中獲得高達 30% 的收益和 68% 的提升。透過有效轉移影像生成器的視覺專業知識，並僅需最少的監督，Lavender 提供了一個可擴充的解決方案，以實現更準確的視覺語言系統。\n所有程式碼、訓練資料和模型將在 https://astrazeneca.github.io/vlm/ 分享。</paragraph>", "author": "Chen Jin et.al.", "authors": "Chen Jin, Ryutaro Tanno, Amrutha Saseendran, Tom Diethe, Philip Teare", "id": "2502.06814v1", "paper_url": "http://arxiv.org/abs/2502.06814v1", "repo": "null"}}