{"2412.06018": {"publish_time": "2024-12-08", "title": "Imputation Matters: A Deeper Look into an Overlooked Step in Longitudinal Health and Behavior Sensing Research", "paper_summary": "Longitudinal passive sensing studies for health and behavior outcomes often\nhave missing and incomplete data. Handling missing data effectively is thus a\ncritical data processing and modeling step. Our formative interviews with\nresearchers working in longitudinal health and behavior passive sensing\nrevealed a recurring theme: most researchers consider imputation a low-priority\nstep in their analysis and inference pipeline, opting to use simple and\noff-the-shelf imputation strategies without comprehensively evaluating its\nimpact on study outcomes. Through this paper, we call attention to the\nimportance of imputation. Using publicly available passive sensing datasets for\ndepression, we show that prioritizing imputation can significantly impact the\nstudy outcomes -- with our proposed imputation strategies resulting in up to\n31% improvement in AUROC to predict depression over the original imputation\nstrategy. We conclude by discussing the challenges and opportunities with\neffective imputation in longitudinal sensing studies.", "paper_summary_zh": "縱向被動感測研究對於健康和行為結果常常有缺失和不完整的資料。有效處理缺失資料因此是資料處理和建模的重要步驟。我們與從事縱向健康和行為被動感測的研究人員進行的形成性訪談揭露了一個反覆出現的主題：大多數研究人員認為內插是其分析和推論流程中優先順序較低的一個步驟，選擇使用簡單且現成的內插策略，而沒有全面評估其對研究結果的影響。透過這篇論文，我們呼籲重視內插。使用公開的被動感測資料集進行憂鬱症研究，我們證明優先考慮內插會對研究結果產生重大影響——我們提出的內插策略使 AUROC 預測憂鬱症的能力比原始內插策略提高了 31%。最後，我們討論了在縱向感測研究中有效內插的挑戰和機會。", "author": "Akshat Choube et.al.", "authors": "Akshat Choube, Rahul Majethia, Sohini Bhattacharya, Vedant Das Swain, Jiachen Li, Varun Mishra", "id": "2412.06018v1", "paper_url": "http://arxiv.org/abs/2412.06018v1", "repo": "null"}}