{"2407.02750": {"publish_time": "2024-07-03", "title": "Learning to Reduce: Towards Improving Performance of Large Language Models on Structured Data", "paper_summary": "Large Language Models (LLMs) have been achieving competent performance on a\nwide range of downstream tasks, yet existing work shows that inference on\nstructured data is challenging for LLMs. This is because LLMs need to either\nunderstand long structured data or select the most relevant evidence before\ninference, and both approaches are not trivial. This paper proposes a\nframework, Learning to Reduce, that fine-tunes a language model with On-Policy\nLearning to generate a reduced version of an input structured data. When\ncompared to state-of-the-art LLMs like GPT-4, Learning to Reduce not only\nachieves outstanding performance in reducing the input, but shows\ngeneralizability on different datasets. We further show that the model\nfine-tuned with our framework helps LLMs better perform on table QA tasks\nespecially when the context is longer.", "paper_summary_zh": "大型語言模型 (LLM) 已在廣泛的下游任務中實現勝任的表現，但現有工作顯示，LLM 對結構化資料的推論具有挑戰性。這是因為 LLM 需要在推論之前了解長結構化資料或選擇最相關的證據，而這兩種方法都不是微不足道的。本文提出一個框架，即學習簡化，微調一個語言模型，採用策略學習，以產生輸入結構化資料的簡化版本。與 GPT-4 等最先進的 LLM 相比，學習簡化不僅在簡化輸入方面取得傑出的表現，而且在不同的資料集上顯示出泛化性。我們進一步表明，使用我們的框架微調的模型有助於 LLM 在表格問答任務中表現得更好，特別是在上下文較長的情況下。", "author": "Younghun Lee et.al.", "authors": "Younghun Lee, Sungchul Kim, Ryan A. Rossi, Tong Yu, Xiang Chen", "id": "2407.02750v1", "paper_url": "http://arxiv.org/abs/2407.02750v1", "repo": "null"}}