{"2412.18390": {"publish_time": "2024-12-24", "title": "RDPM: Solve Diffusion Probabilistic Models via Recurrent Token Prediction", "paper_summary": "Diffusion Probabilistic Models (DPMs) have emerged as the de facto approach\nfor high-fidelity image synthesis, operating diffusion processes on continuous\nVAE latent, which significantly differ from the text generation methods\nemployed by Large Language Models (LLMs). In this paper, we introduce a novel\ngenerative framework, the Recurrent Diffusion Probabilistic Model (RDPM), which\nenhances the diffusion process through a recurrent token prediction mechanism,\nthereby pioneering the field of Discrete Diffusion. By progressively\nintroducing Gaussian noise into the latent representations of images and\nencoding them into vector-quantized tokens in a recurrent manner, RDPM\nfacilitates a unique diffusion process on discrete-value domains. This process\niteratively predicts the token codes for subsequent timesteps, transforming the\ninitial standard Gaussian noise into the source data distribution, aligning\nwith GPT-style models in terms of the loss function. RDPM demonstrates superior\nperformance while benefiting from the speed advantage of requiring only a few\ninference steps. This model not only leverages the diffusion process to ensure\nhigh-quality generation but also converts continuous signals into a series of\nhigh-fidelity discrete tokens, thereby maintaining a unified optimization\nstrategy with other discrete tokens, such as text. We anticipate that this work\nwill contribute to the development of a unified model for multimodal\ngeneration, specifically by integrating continuous signal domains such as\nimages, videos, and audio with text. We will release the code and model weights\nto the open-source community.", "paper_summary_zh": "擴散機率模型 (DPM) 已經成為高保真影像合成的實際方法，在連續 VAE 潛在變數上操作擴散程序，這與大型語言模型 (LLM) 所採用的文字生成方法有顯著差異。在本文中，我們介紹了一個新穎的生成架構，稱為遞迴擴散機率模型 (RDPM)，它透過遞迴符號預測機制增強擴散程序，從而開創了離散擴散領域。透過逐步將高斯雜訊引入影像的潛在表示中，並以遞迴方式將其編碼為向量量化的符號，RDPM 在離散值域上促進了獨特的擴散程序。此程序會反覆預測後續時間步長的符號碼，將初始的標準高斯雜訊轉換為來源資料分佈，在損失函數方面與 GPT 類型的模型對齊。RDPM 展現出優異的效能，同時受益於僅需要幾個推論步驟的速度優勢。此模型不僅利用擴散程序確保高品質的生成，還將連續訊號轉換為一系列高保真離散符號，從而與其他離散符號（例如文字）保持統一的最佳化策略。我們預期這項工作將有助於開發多模態生成的統一模型，特別是透過將影像、影片和音訊等連續訊號域與文字整合在一起。我們將向開源社群釋出程式碼和模型權重。", "author": "Wu Xiaoping et.al.", "authors": "Wu Xiaoping, Hu Jie, Wei Xiaoming", "id": "2412.18390v1", "paper_url": "http://arxiv.org/abs/2412.18390v1", "repo": "null"}}