{"2407.18690": {"publish_time": "2024-07-26", "title": "Collaborative Evolving Strategy for Automatic Data-Centric Development", "paper_summary": "Artificial Intelligence (AI) significantly influences many fields, largely\nthanks to the vast amounts of high-quality data for machine learning models.\nThe emphasis is now on a data-centric AI strategy, prioritizing data\ndevelopment over model design progress. Automating this process is crucial. In\nthis paper, we serve as the first work to introduce the automatic data-centric\ndevelopment (AD^2) task and outline its core challenges, which require\ndomain-experts-like task scheduling and implementation capability, largely\nunexplored by previous work.\n  By leveraging the strong complex problem-solving capabilities of large\nlanguage models (LLMs), we propose an LLM-based autonomous agent, equipped with\na strategy named Collaborative Knowledge-STudying-Enhanced Evolution by\nRetrieval (Co-STEER), to simultaneously address all the challenges.\nSpecifically, our proposed Co-STEER agent enriches its domain knowledge through\nour proposed evolving strategy and develops both its scheduling and\nimplementation skills by accumulating and retrieving domain-specific practical\nexperience. With an improved schedule, the capability for implementation\naccelerates. Simultaneously, as implementation feedback becomes more thorough,\nthe scheduling accuracy increases. These two capabilities evolve together\nthrough practical feedback, enabling a collaborative evolution process.\n  Extensive experimental results demonstrate that our Co-STEER agent breaks new\nground in AD^2 research, possesses strong evolvable schedule and implementation\nability, and demonstrates the significant effectiveness of its components. Our\nCo-STEER paves the way for AD^2 advancements.", "paper_summary_zh": "<paragraph>人工智慧 (AI) 在許多領域中產生了重大的影響，這在很大程度上要歸功於機器學習模型的大量高品質資料。現在的重點在於以資料為中心的 AI 策略，將資料開發優先於模型設計進度。自動化這個流程至關重要。在本文中，我們作為第一個介紹自動以資料為中心開發 (AD^2) 任務並概述其核心挑戰的工作，這些挑戰需要像領域專家一樣的任務排程和實作能力，而這在先前的研究中大多未被探討。\n  透過利用大型語言模型 (LLM) 強大的複雜問題解決能力，我們提出一個基於 LLM 的自主代理，配備一個名為透過檢索進行協作知識研究增強演化 (Co-STEER) 的策略，以同時解決所有挑戰。\n具體來說，我們提出的 Co-STEER 代理透過我們提出的演化策略豐富其領域知識，並透過累積和檢索特定領域的實務經驗來培養其排程和實作技能。透過改善的排程，實作能力加速。同時，隨著實作回饋變得更全面，排程準確度也會提高。這兩種能力透過實務回饋共同演化，促成協作演化流程。\n  廣泛的實驗結果證明，我們的 Co-STEER 代理在 AD^2 研究中開創了新局，具備強大的可演化排程和實作能力，並證明了其組成部分的顯著有效性。我們的 Co-STEER 為 AD^2 的進步鋪平了道路。</paragraph>", "author": "Xu Yang et.al.", "authors": "Xu Yang, Haotian Chen, Wenjun Feng, Haoxue Wang, Zeqi Ye, Xinjie Shen, Xiao Yang, Shizhao Sun, Weiqing Liu, Jiang Bian", "id": "2407.18690v1", "paper_url": "http://arxiv.org/abs/2407.18690v1", "repo": "null"}}