{"2408.00534": {"publish_time": "2024-08-01", "title": "The Monetisation of Toxicity: Analysing YouTube Content Creators and Controversy-Driven Engagement", "paper_summary": "YouTube is a major social media platform that plays a significant role in\ndigital culture, with content creators at its core. These creators often engage\nin controversial behaviour to drive engagement, which can foster toxicity. This\npaper presents a quantitative analysis of controversial content on YouTube,\nfocusing on the relationship between controversy, toxicity, and monetisation.\nWe introduce a curated dataset comprising 20 controversial YouTube channels\nextracted from Reddit discussions, including 16,349 videos and more than 105\nmillion comments. We identify and categorise monetisation cues from video\ndescriptions into various models, including affiliate marketing and direct\nselling, using lists of URLs and keywords. Additionally, we train a machine\nlearning model to measure the toxicity of comments in these videos. Our\nfindings reveal that while toxic comments correlate with higher engagement,\nthey negatively impact monetisation, indicating that controversy-driven\ninteraction does not necessarily lead to financial gain. We also observed\nsignificant variation in monetisation strategies, with some creators showing\nextensive monetisation despite high toxicity levels. Our study introduces a\ncurated dataset, lists of URLs and keywords to categorise monetisation, a\nmachine learning model to measure toxicity, and is a significant step towards\nunderstanding the complex relationship between controversy, engagement, and\nmonetisation on YouTube. The lists used for detecting and categorising\nmonetisation cues are available on https://github.com/thalesbertaglia/toxmon.", "paper_summary_zh": "YouTube 是一个重要的社交媒體平台，在數位文化中扮演著重要的角色，而內容創作者則是其核心。這些創作者經常參與有爭議的行為以推動參與，這可能會助長毒性。本文提出對 YouTube 上有爭議內容的量化分析，重點關注爭議、毒性和獲利之間的關係。我們引入了一個精選的資料集，其中包含從 Reddit 討論中提取的 20 個有爭議的 YouTube 頻道，包括 16,349 個影片和超過 1.05 億則留言。我們從影片說明中識別並分類出各種獲利線索，包括聯盟行銷和直接銷售，並使用 URL 和關鍵字清單。此外，我們訓練了一個機器學習模型來衡量這些影片中留言的毒性。我們的研究結果顯示，雖然有毒的留言與較高的參與度相關，但它們會對獲利產生負面影響，這表示由爭議驅動的互動不一定會帶來財務收益。我們還觀察到獲利策略有顯著差異，一些創作者即使毒性程度很高，也表現出廣泛的獲利。我們的研究引入了精選的資料集、用於分類獲利的 URL 和關鍵字清單、用於衡量毒性的機器學習模型，並且是了解 YouTube 上爭議、參與度和獲利之間複雜關係的重要一步。用於偵測和分類獲利線索的清單可在 https://github.com/thalesbertaglia/toxmon 上取得。", "author": "Thales Bertaglia et.al.", "authors": "Thales Bertaglia, Catalina Goanta, Adriana Iamnitchi", "id": "2408.00534v1", "paper_url": "http://arxiv.org/abs/2408.00534v1", "repo": "null"}}