{"2405.15302": {"publish_time": "2024-05-24", "title": "Towards Understanding How Transformer Perform Multi-step Reasoning with Matching Operation", "paper_summary": "Large language models have consistently struggled with complex reasoning\ntasks, such as mathematical problem-solving. Investigating the internal\nreasoning mechanisms of these models can help us design better model\narchitectures and training strategies, ultimately enhancing their reasoning\ncapabilities. In this study, we examine the matching mechanism employed by\nTransformer for multi-step reasoning on a constructed dataset. We investigate\nfactors that influence the model's matching mechanism and discover that small\ninitialization and post-LayerNorm can facilitate the formation of the matching\nmechanism, thereby enhancing the model's reasoning ability. Moreover, we\npropose a method to improve the model's reasoning capability by adding\northogonal noise. Finally, we investigate the parallel reasoning mechanism of\nTransformers and propose a conjecture on the upper bound of the model's\nreasoning ability based on this phenomenon. These insights contribute to a\ndeeper understanding of the reasoning processes in large language models and\nguide designing more effective reasoning architectures and training strategies.", "paper_summary_zh": "大型語言模型在複雜推理任務（例如數學問題求解）方面一直面臨挑戰。探討這些模型的內部推理機制有助於我們設計更好的模型架構和訓練策略，最終提升其推理能力。在本研究中，我們檢視 Transformer 在建構資料集上進行多步驟推理時所採用的配對機制。我們探討影響模型配對機制的因素，並發現小的初始化和 LayerNorm 後處理有助於配對機制的形成，進而提升模型的推理能力。此外，我們提出了一種方法，透過加入正交雜訊來提升模型的推理能力。最後，我們探討 Transformer 的平行推理機制，並根據此現象提出模型推理能力的上限猜想。這些見解有助於更深入地了解大型語言模型中的推理過程，並指導設計更有效的推理架構和訓練策略。", "author": "Zhiwei Wang et.al.", "authors": "Zhiwei Wang, Yunji Wang, Zhongwang Zhang, Zhangchen Zhou, Hui Jin, Tianyang Hu, Jiacheng Sun, Zhenguo Li, Yaoyu Zhang, Zhi-Qin John Xu", "id": "2405.15302v1", "paper_url": "http://arxiv.org/abs/2405.15302v1", "repo": "null"}}