{"2501.03462": {"publish_time": "2025-01-07", "title": "ISSR: Iterative Selection with Self-Review for Vocabulary Test Distractor Generation", "paper_summary": "Vocabulary acquisition is essential to second language learning, as it\nunderpins all core language skills. Accurate vocabulary assessment is\nparticularly important in standardized exams, where test items evaluate\nlearners' comprehension and contextual use of words. Previous research has\nexplored methods for generating distractors to aid in the design of English\nvocabulary tests. However, current approaches often rely on lexical databases\nor predefined rules, and frequently produce distractors that risk invalidating\nthe question by introducing multiple correct options. In this study, we focus\non English vocabulary questions from Taiwan's university entrance exams. We\nanalyze student response distributions to gain insights into the\ncharacteristics of these test items and provide a reference for future\nresearch. Additionally, we identify key limitations in how large language\nmodels (LLMs) support teachers in generating distractors for vocabulary test\ndesign. To address these challenges, we propose the iterative selection with\nself-review (ISSR) framework, which makes use of a novel LLM-based self-review\nmechanism to ensure that the distractors remain valid while offering diverse\noptions. Experimental results show that ISSR achieves promising performance in\ngenerating plausible distractors, and the self-review mechanism effectively\nfilters out distractors that could invalidate the question.", "paper_summary_zh": "詞彙習得對於第二語言學習至關重要，因為它是所有核心語言技能的基礎。準確的詞彙評量在標準化考試中特別重要，考試項目評量學習者的理解力與詞彙的語境使用。先前的研究已探討產生干擾項以協助設計英語詞彙測驗的方法。然而，目前的做法通常依賴詞彙資料庫或預先定義的規則，而且經常產生干擾項，可能會因為引進多個正確選項而使問題無效。在本研究中，我們專注於台灣大學入學考試中的英語詞彙題目。我們分析學生的答題分佈，以深入了解這些考試項目的特徵，並為未來的研究提供參考。此外，我們找出大型語言模型 (LLM) 在支援教師產生詞彙測驗設計的干擾項時的主要限制。為了應對這些挑戰，我們提出具有自評功能的迭代選擇 (ISSR) 架構，它利用一種新穎的基於 LLM 的自評機制，以確保干擾項保持有效，同時提供多樣化的選項。實驗結果顯示，ISSR 在產生合理的干擾項方面表現出色，而自評機制有效過濾掉可能使問題無效的干擾項。", "author": "Yu-Cheng Liu et.al.", "authors": "Yu-Cheng Liu, An-Zi Yen", "id": "2501.03462v1", "paper_url": "http://arxiv.org/abs/2501.03462v1", "repo": "null"}}