{"2501.13365": {"publish_time": "2025-01-23", "title": "Enhanced Extractor-Selector Framework and Symmetrization Weighted Binary Cross-Entropy for Edge Detections", "paper_summary": "Recent advancements have demonstrated the effectiveness of the\nextractor-selector (E-S) framework in edge detection (ED) tasks, which achieves\nstate-of-the-art (SOTA) performance in both quantitative metrics and perceptual\nquality. However, this method still falls short of fully exploiting the\npotential of feature extractors, as selectors only operate on highly compressed\nfeature maps that lack diversity and suffer from substantial information loss.\nAdditionally, while union training can improve perceptual quality, the highest\nevaluation scores are typically obtained without it, creating a trade-off\nbetween quantitative accuracy and perceptual fidelity. To address these\nlimitations, we propose an enhanced E-S architecture, which utilizes richer,\nless-loss feature representations and incorporates auxiliary features during\nthe selection process, thereby improving the effectiveness of the feature\nselection mechanism. Additionally, we introduce a novel loss function, the\nSymmetrization Weight Binary Cross-Entropy (SWBCE), which simultaneously\nemphasizes both the recall of edge pixels and the suppression of erroneous edge\npredictions, thereby enhancing the predictions both in the perceptual quality\nand the prediction accuracy. The effectiveness and superiority of our\napproaches over baseline models, the standard E-S framework, and the standard\nWeight Binary Cross-Entropy (WBCE) loss function are demonstrated by extensive\nexperiments. For example, our enhanced E-S architecture trained with SWBCE loss\nfunction achieves average improvements of 8.25$\\%$, 8.01$\\%$, and 33.25$\\%$ in\nODS, OIS, and AP, measured on BIPED2 compared with the baseline models,\nsignificantly outperforming the standard E-S method. The results set new\nbenchmarks for ED tasks, and highlight the potential of the methods in beyond.", "paper_summary_zh": "<paragraph>最近的进步展示了提取器-选择器 (E-S) 框架在边缘检测 (ED) 任务中的有效性，在定量指标和感知质量方面都取得了最先进 (SOTA) 的性能。然而，这种方法仍然没有充分利用特征提取器的潜力，因为选择器只作用于高度压缩的特征图，这些特征图缺乏多样性并遭受大量信息丢失。此外，虽然联合训练可以提高感知质量，但通常在没有联合训练的情况下获得最高评估分数，从而在定量准确性和感知保真度之间形成权衡。为了解决这些限制，我们提出了一种增强的 E-S 架构，它利用更丰富、更少损失的特征表示，并在选择过程中纳入辅助特征，从而提高了特征选择机制的有效性。此外，我们引入了一种新颖的损失函数，即对称加权二元交叉熵 (SWBCE)，它同时强调了边缘像素的召回和错误边缘预测的抑制，从而在感知质量和预测准确性方面都增强了预测。通过广泛的实验，证明了我们方法相对于基线模型、标准 E-S 框架和标准加权二元交叉熵 (WBCE) 损失函数的有效性和优越性。例如，我们使用 SWBCE 损失函数训练的增强型 E-S 架构在 ODS、OIS 和 AP 中实现了 8.25%、8.01% 和 33.25% 的平均改进，与基线模型相比，在 BIPED2 上测量，明显优于标准 E-S 方法。结果为 ED 任务设定了新的基准，并突出了这些方法在其他领域的潜力。</paragraph>", "author": "Hao Shu et.al.", "authors": "Hao Shu", "id": "2501.13365v1", "paper_url": "http://arxiv.org/abs/2501.13365v1", "repo": "null"}}