{"2406.04854": {"publish_time": "2024-06-07", "title": "Uncertainty Aware Learning for Language Model Alignment", "paper_summary": "As instruction-tuned large language models (LLMs) evolve, aligning pretrained\nfoundation models presents increasing challenges. Existing alignment\nstrategies, which typically leverage diverse and high-quality data sources,\noften overlook the intrinsic uncertainty of tasks, learning all data samples\nequally. This may lead to suboptimal data efficiency and model performance. In\nresponse, we propose uncertainty-aware learning (UAL) to improve the model\nalignment of different task scenarios, by introducing the sample uncertainty\n(elicited from more capable LLMs). We implement UAL in a simple fashion --\nadaptively setting the label smoothing value of training according to the\nuncertainty of individual samples. Analysis shows that our UAL indeed\nfacilitates better token clustering in the feature space, validating our\nhypothesis. Extensive experiments on widely used benchmarks demonstrate that\nour UAL significantly and consistently outperforms standard supervised\nfine-tuning. Notably, LLMs aligned in a mixed scenario have achieved an average\nimprovement of 10.62\\% on high-entropy tasks (i.e., AlpacaEval leaderboard),\nand 1.81\\% on complex low-entropy tasks (i.e., MetaMath and GSM8K).", "paper_summary_zh": "隨著指令微調大型語言模型 (LLM) 的演進，比對預訓練基礎模型面臨的挑戰越來越大。現有的比對策略通常利用多樣且高品質的資料來源，卻常常忽略任務的內在不確定性，一視同仁地學習所有資料樣本。這可能會導致次佳的資料效率和模型效能。為了解決這個問題，我們提出不確定性感知學習 (UAL)，透過引入樣本不確定性（從更強大的 LLM 獲得），來改善不同任務場景的模型比對。我們以一種簡單的方式實作 UAL，根據個別樣本的不確定性，自適應地設定訓練的標籤平滑值。分析顯示，我們的 UAL 確實促進了特徵空間中更好的標記聚類，驗證了我們的假設。在廣泛使用的基準上進行的大量實驗證明，我們的 UAL 明顯且持續地優於標準監督微調。值得注意的是，在混合場景中比對的 LLM 在高熵任務（即 AlpacaEval 排行榜）上平均提升了 10.62%，在複雜低熵任務（即 MetaMath 和 GSM8K）上提升了 1.81%。", "author": "Yikun Wang et.al.", "authors": "Yikun Wang, Rui Zheng, Liang Ding, Qi Zhang, Dahua Lin, Dacheng Tao", "id": "2406.04854v1", "paper_url": "http://arxiv.org/abs/2406.04854v1", "repo": "null"}}