{"2412.04964": {"publish_time": "2024-12-06", "title": "Flash Communication: Reducing Tensor Parallelization Bottleneck for Fast Large Language Model Inference", "paper_summary": "The ever-increasing sizes of large language models necessitate distributed\nsolutions for fast inference that exploit multi-dimensional parallelism, where\ncomputational loads are split across various accelerators such as GPU clusters.\nHowever, this approach often introduces significant communication overhead,\nespecially on devices with limited bandwidth. In this paper, we introduce\n\\emph{Flash Communication}, a novel low-bit compression technique designed to\nalleviate the tensor-parallelism communication bottleneck during inference. Our\nmethod substantially boosts intra-node communication speed by more than 3x and\nreduces the \\emph{time-to-first-token} by 2x, with nearly no sacrifice in model\naccuracy. Extensive experiments on various up-to-date LLMs demonstrate the\neffectiveness of our approach.", "paper_summary_zh": "隨著大型語言模型的規模不斷擴大，需要分散式解決方案來快速推論，以利用多維並行性，其中計算負載會分散到各種加速器（例如 GPU 集群）上。\n不過，這種方法通常會引入大量的通訊開銷，特別是在頻寬受限的裝置上。在本文中，我們介紹了「閃電通訊」，這是一種新穎的低位元壓縮技術，旨在緩解推論期間的張量並行通訊瓶頸。我們的技術大幅提升了節點內通訊速度，超過 3 倍，並將「首次標記時間」縮短了 2 倍，幾乎沒有犧牲模型準確度。在各種最新的 LLM 上進行的廣泛實驗證明了我們方法的有效性。", "author": "Qingyuan Li et.al.", "authors": "Qingyuan Li, Bo Zhang, Liang Ye, Yifan Zhang, Wei Wu, Yerui Sun, Lin Ma, Yuchen Xie", "id": "2412.04964v1", "paper_url": "http://arxiv.org/abs/2412.04964v1", "repo": "null"}}