{"2407.03185": {"publish_time": "2024-07-03", "title": "Multiple-Resolution Tokenization for Time Series Forecasting with an Application to Pricing", "paper_summary": "We propose a transformer architecture for time series forecasting with a\nfocus on time series tokenisation and apply it to a real-world prediction\nproblem from the pricing domain. Our architecture aims to learn effective\nrepresentations at many scales across all available data simultaneously. The\nmodel contains a number of novel modules: a differentiated form of time series\npatching which employs multiple resolutions, a multiple-resolution module for\ntime-varying known variables, a mixer-based module for capturing cross-series\ninformation, and a novel output head with favourable scaling to account for the\nincreased number of tokens. We present an application of this model to a real\nworld prediction problem faced by the markdown team at a very large retailer.\nOn the experiments conducted our model outperforms in-house models and the\nselected existing deep learning architectures.", "paper_summary_zh": "我們提出一個Transformer架構，用於時間序列預測，重點在於時間序列標記化，並將其應用於定價領域的實際預測問題。我們的架構旨在同時在所有可用資料中學習多個尺度的有效表示。該模型包含許多新穎的模組：一種採用多重解析度的時間序列修補差異化形式、一個用於時變已知變數的多重解析度模組、一個用於擷取跨序列資訊的基於混合器的模組，以及一個具有有利縮放的新穎輸出頭，用於考量增加的標記數量。我們展示了此模型在一個非常大型零售商的降價團隊所面臨的實際預測問題中的應用。在進行的實驗中，我們的模型優於內部模型和選定的現有深度學習架構。", "author": "Egon Peršak et.al.", "authors": "Egon Peršak, Miguel F. Anjos, Sebastian Lautz, Aleksandar Kolev", "id": "2407.03185v1", "paper_url": "http://arxiv.org/abs/2407.03185v1", "repo": "null"}}