{"2405.15189": {"publish_time": "2024-05-24", "title": "SOAP: Enhancing Efficiency of Generated Code via Self-Optimization", "paper_summary": "Large language models (LLMs) have shown remarkable progress in code\ngeneration, but their generated code often suffers from inefficiency, resulting\nin longer execution times and higher memory consumption. To address this issue,\nwe propose Self Optimization based on OverheAd Profile (SOAP), a\nself-optimization framework that utilizes execution overhead profiles to\nimprove the efficiency of LLM-generated code. SOAP first generates code using\nan LLM, then executes it locally to capture execution time and memory usage\nprofiles. These profiles are fed back to the LLM, which then revises the code\nto reduce overhead. To evaluate the effectiveness of SOAP, we conduct extensive\nexperiments on the EffiBench, HumanEval, and MBPP with 16 open-source and 6\nclosed-source models. Our evaluation results demonstrate that through iterative\nself-optimization, SOAP significantly enhances the efficiency of LLM-generated\ncode. For example, the execution time (ET) of StarCoder2-15B for the EffiBench\ndecreases from 0.93 (s) to 0.12 (s) which reduces 87.1% execution time\nrequirement compared with the initial code. The total memory usage (TMU) of\nStarCoder2-15B also decreases from 22.02 (Mb*s) to 2.03 (Mb*s), which decreases\n90.8% total memory consumption during the execution process. The source code of\nSOAP was released in https://github.com/huangd1999/SOAP.", "paper_summary_zh": "大型語言模型 (LLM) 在程式碼生成方面展現了顯著的進展，但其生成的程式碼常常效率不彰，導致執行時間較長且記憶體消耗較高。為了解決這個問題，我們提出了基於開銷剖析的自最佳化 (SOAP)，這是一個自最佳化架構，利用執行開銷剖析來改善 LLM 生成的程式碼效率。SOAP 首先使用 LLM 產生程式碼，然後在本地執行它以擷取執行時間和記憶體使用量剖析。這些剖析會回饋給 LLM，然後 LLM 會修改程式碼以減少開銷。為了評估 SOAP 的有效性，我們在 EffiBench、HumanEval 和 MBPP 上針對 16 個開源模型和 6 個閉源模型進行了廣泛的實驗。我們的評估結果表明，透過反覆的自最佳化，SOAP 大幅提升了 LLM 生成的程式碼效率。例如，EffiBench 中 StarCoder2-15B 的執行時間 (ET) 從 0.93 (秒) 減少到 0.12 (秒)，與初始程式碼相比，減少了 87.1% 的執行時間需求。StarCoder2-15B 的總記憶體使用量 (TMU) 也從 22.02 (Mb*s) 減少到 2.03 (Mb*s)，在執行過程中減少了 90.8% 的總記憶體消耗。SOAP 的原始程式碼已發布在 https://github.com/huangd1999/SOAP。", "author": "Dong Huang et.al.", "authors": "Dong Huang, Jianbo Dai, Han Weng, Puzhen Wu, Yuhao Qing, Jie M. Zhang, Heming Cui, Zhijiang Guo", "id": "2405.15189v1", "paper_url": "http://arxiv.org/abs/2405.15189v1", "repo": "https://github.com/huangd1999/soap"}}