{"2410.13803": {"publish_time": "2024-10-17", "title": "A Pattern to Align Them All: Integrating Different Modalities to Define Multi-Modal Entities", "paper_summary": "The ability to reason with and integrate different sensory inputs is the\nfoundation underpinning human intelligence and it is the reason for the growing\ninterest in modelling multi-modal information within Knowledge Graphs.\nMulti-Modal Knowledge Graphs extend traditional Knowledge Graphs by associating\nan entity with its possible modal representations, including text, images,\naudio, and videos, all of which are used to convey the semantics of the entity.\nDespite the increasing attention that Multi-Modal Knowledge Graphs have\nreceived, there is a lack of consensus about the definitions and modelling of\nmodalities, whose definition is often determined by application domains. In\nthis paper, we propose a novel ontology design pattern that captures the\nseparation of concerns between an entity (and the information it conveys),\nwhose semantics can have different manifestations across different media, and\nits realisation in terms of a physical information entity. By introducing this\nabstract model, we aim to facilitate the harmonisation and integration of\ndifferent existing multi-modal ontologies which is crucial for many intelligent\napplications across different domains spanning from medicine to digital\nhumanities.", "paper_summary_zh": "推理和整合不同感官輸入的能力是支撐人類智慧的基礎，也是知識圖譜中對多模態資訊建模興趣日益增長的原因。多模態知識圖譜藉由將實體與其可能的模態表徵（包括文字、影像、音訊和影片）關聯起來，擴充了傳統的知識圖譜，而這些表徵全部用於傳達實體的語意。儘管多模態知識圖譜獲得了越來越多的關注，但在模態的定義和建模方面仍缺乏共識，而模態的定義通常由應用領域決定。在本文中，我們提出了一種新穎的本体設計模式，它捕獲了實體（及其傳達的資訊）之間的關注點分離，其語意可以在不同的媒體中呈現不同的表現形式，以及其實體資訊實體方面的實現。藉由導入這個抽象模型，我們旨在促進現有的不同多模態本体的和諧化和整合，這對於跨越從醫學到數位人文的不同領域的許多智慧應用至關重要。", "author": "Gianluca Apriceno et.al.", "authors": "Gianluca Apriceno, Valentina Tamma, Tania Bailoni, Jacopo de Berardinis, Mauro Dragoni", "id": "2410.13803v1", "paper_url": "http://arxiv.org/abs/2410.13803v1", "repo": "https://github.com/ida-fbk/multimodalpattern"}}