{"2408.03078": {"publish_time": "2024-08-06", "title": "BodySLAM: A Generalized Monocular Visual SLAM Framework for Surgical Applications", "paper_summary": "Endoscopic surgery relies on two-dimensional views, posing challenges for\nsurgeons in depth perception and instrument manipulation. While Simultaneous\nLocalization and Mapping (SLAM) has emerged as a promising solution to address\nthese limitations, its implementation in endoscopic procedures presents\nsignificant challenges due to hardware limitations, such as the use of a\nmonocular camera and the absence of odometry sensors. This study presents a\nrobust deep learning-based SLAM approach that combines state-of-the-art and\nnewly developed models. It consists of three main parts: the Monocular Pose\nEstimation Module that introduces a novel unsupervised method based on the\nCycleGAN architecture, the Monocular Depth Estimation Module that leverages the\nnovel Zoe architecture, and the 3D Reconstruction Module which uses information\nfrom the previous models to create a coherent surgical map. The performance of\nthe procedure was rigorously evaluated using three publicly available datasets\n(Hamlyn, EndoSLAM, and SCARED) and benchmarked against two state-of-the-art\nmethods, EndoSFMLearner and EndoDepth. The integration of Zoe in the MDEM\ndemonstrated superior performance compared to state-of-the-art depth estimation\nalgorithms in endoscopy, whereas the novel approach in the MPEM exhibited\ncompetitive performance and the lowest inference time. The results showcase the\nrobustness of our approach in laparoscopy, gastroscopy, and colonoscopy, three\ndifferent scenarios in endoscopic surgery. The proposed SLAM approach has the\npotential to improve the accuracy and efficiency of endoscopic procedures by\nproviding surgeons with enhanced depth perception and 3D reconstruction\ncapabilities.", "paper_summary_zh": "內視鏡手術依賴於二維視圖，對外科醫生在深度感知和器械操作方面構成挑戰。雖然同時定位與建圖 (SLAM) 已成為解決這些限制的有希望的方案，但由於硬體限制，例如使用單眼相機和缺乏里程計感測器，其在內視鏡手術中的實施面臨重大挑戰。本研究提出了一種強大的深度學習式 SLAM 方法，結合了最先進和新開發的模型。它包含三個主要部分：單眼姿勢估計模組，引入了基於 CycleGAN 架構的新型非監督式方法；單眼深度估計模組，利用了新型 Zoe 架構；以及 3D 重建模組，它使用前一模型中的資訊來建立一個連貫的手術地圖。使用三個公開可用的資料集（Hamlyn、EndoSLAM 和 SCARED）嚴格評估了該手術的效能，並根據兩個最先進的方法 EndoSFMLearner 和 EndoDepth 進行基準測試。與內視鏡中最先進的深度估計演算法相比，Zoe 在 MDEM 中的整合表現出優異的效能，而 MPEM 中的新方法表現出競爭力且推論時間最短。結果展示了我們的方法在腹腔鏡檢查、胃鏡檢查和結腸鏡檢查中的穩健性，這是內視鏡手術中的三種不同場景。所提出的 SLAM 方法有可能透過為外科醫生提供增強的深度感知和 3D 重建能力，來提高內視鏡手術的準確性和效率。", "author": "G. Manni et.al.", "authors": "G. Manni, C. Lauretti, F. Prata, R. Papalia, L. Zollo, P. Soda", "id": "2408.03078v1", "paper_url": "http://arxiv.org/abs/2408.03078v1", "repo": "null"}}