{"2501.08197": {"publish_time": "2025-01-14", "title": "OpenCSG Chinese Corpus: A Series of High-quality Chinese Datasets for LLM Training", "paper_summary": "Large language models (LLMs) have demonstrated remarkable capabilities, but\ntheir success heavily relies on the quality of pretraining corpora. For Chinese\nLLMs, the scarcity of high-quality Chinese datasets presents a significant\nchallenge, often limiting their performance. To address this issue, we propose\nthe OpenCSG Chinese Corpus, a series of high-quality datasets specifically\ndesigned for LLM pretraining, post-training, and fine-tuning. This corpus\nincludes Fineweb-edu-chinese, Fineweb-edu-chinese-v2, Cosmopedia-chinese, and\nSmoltalk-chinese, each with distinct characteristics: Fineweb-edu datasets\nfocus on filtered, high-quality content derived from diverse Chinese web\nsources; Cosmopedia-chinese provides synthetic, textbook-style data for\nknowledge-intensive training; and Smoltalk-chinese emphasizes stylistic and\ndiverse chat-format data. The OpenCSG Chinese Corpus is characterized by its\nhigh-quality text, diverse coverage across domains, and scalable, reproducible\ndata curation processes. Additionally, we conducted extensive experimental\nanalyses, including evaluations on smaller parameter models, which demonstrated\nsignificant performance improvements in tasks such as C-Eval, showcasing the\neffectiveness of the corpus for training Chinese LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 已展示出非凡的能力，但其成功很大程度上依賴於預訓練語料庫的品質。對於中文 LLM，高品質中文資料集的稀缺性是一個重大挑戰，通常會限制其效能。為了解決這個問題，我們提出 OpenCSG 中文語料庫，這是一系列專門設計用於 LLM 預訓練、後訓練和微調的高品質資料集。此語料庫包含 Fineweb-edu-chinese、Fineweb-edu-chinese-v2、Cosmopedia-chinese 和 Smoltalk-chinese，每個資料集都有不同的特點：Fineweb-edu 資料集專注於從各種中文網路來源衍生的經過篩選的高品質內容；Cosmopedia-chinese 提供用於知識密集訓練的合成教科書式資料；而 Smoltalk-chinese 則強調風格化和多樣化的聊天格式資料。OpenCSG 中文語料庫的特點是其高品質文字、跨領域的多樣化涵蓋範圍，以及可擴充且可重製的資料策展流程。此外，我們進行了廣泛的實驗分析，包括對較小參數模型的評估，這證明了在任務（例如 C-Eval）中效能有顯著提升，展示了該語料庫在訓練中文 LLM 方面的有效性。", "author": "Yijiong Yu et.al.", "authors": "Yijiong Yu, Ziyun Dai, Zekun Wang, Wei Wang, Ran Chen, Ji Pei", "id": "2501.08197v1", "paper_url": "http://arxiv.org/abs/2501.08197v1", "repo": "https://github.com/yuyijiong/fineweb-edu-chinese"}}