{"2411.18335": {"publish_time": "2024-11-27", "title": "Helvipad: A Real-World Dataset for Omnidirectional Stereo Depth Estimation", "paper_summary": "Despite considerable progress in stereo depth estimation, omnidirectional\nimaging remains underexplored, mainly due to the lack of appropriate data. We\nintroduce Helvipad, a real-world dataset for omnidirectional stereo depth\nestimation, consisting of 40K frames from video sequences across diverse\nenvironments, including crowded indoor and outdoor scenes with diverse lighting\nconditions. Collected using two 360{\\deg} cameras in a top-bottom setup and a\nLiDAR sensor, the dataset includes accurate depth and disparity labels by\nprojecting 3D point clouds onto equirectangular images. Additionally, we\nprovide an augmented training set with a significantly increased label density\nby using depth completion. We benchmark leading stereo depth estimation models\nfor both standard and omnidirectional images. The results show that while\nrecent stereo methods perform decently, a significant challenge persists in\naccurately estimating depth in omnidirectional imaging. To address this, we\nintroduce necessary adaptations to stereo models, achieving improved\nperformance.", "paper_summary_zh": "儘管在立體深度估計方面取得了顯著的進展，但全向影像仍然未被充分探索，這主要是由於缺乏適當的資料。我們引進了 Helvipad，這是一個用於全向立體深度估計的真實世界資料集，包含來自各種環境的影片序列中的 40K 幀，包括擁擠的室內和室外場景，以及不同的照明條件。使用兩個 360 度相機在頂部和底部設置以及一個 LiDAR 感測器收集，該資料集透過將 3D 點雲投影到等距矩形影像上，包含準確的深度和視差標籤。此外，我們透過使用深度完成來提供一個擴充的訓練集，大幅增加標籤密度。我們對標準和全向影像進行了領先的立體深度估計模型基準測試。結果顯示，雖然最近的立體方法表現得很好，但在全向影像中準確估計深度仍然是一個重大的挑戰。為了解決這個問題，我們引進了對立體模型必要的調整，以達到更好的效能。", "author": "Mehdi Zayene et.al.", "authors": "Mehdi Zayene, Jannik Endres, Albias Havolli, Charles Corbière, Salim Cherkaoui, Alexandre Kontouli, Alexandre Alahi", "id": "2411.18335v1", "paper_url": "http://arxiv.org/abs/2411.18335v1", "repo": "null"}}