{"2409.05591": {"publish_time": "2024-09-09", "title": "MemoRAG: Moving towards Next-Gen RAG Via Memory-Inspired Knowledge Discovery", "paper_summary": "Retrieval-Augmented Generation (RAG) leverages retrieval tools to access\nexternal databases, thereby enhancing the generation quality of large language\nmodels (LLMs) through optimized context. However, the existing retrieval\nmethods are constrained inherently, as they can only perform relevance matching\nbetween explicitly stated queries and well-formed knowledge, but unable to\nhandle tasks involving ambiguous information needs or unstructured knowledge.\nConsequently, existing RAG systems are primarily effective for straightforward\nquestion-answering tasks. In this work, we propose \\textbf{MemoRAG}, a novel\nretrieval-augmented generation paradigm empowered by long-term memory. MemoRAG\nadopts a dual-system architecture. On the one hand, it employs a \\textit{light\nbut long-range} LLM to form the global memory of database. Once a task is\npresented, it generates draft answers, cluing the retrieval tools to locate\nuseful information within the database. On the other hand, it leverages an\n\\textit{expensive but expressive} LLM, which generates the ultimate answer\nbased on the retrieved information. Building on this general framework, we\nfurther optimize MemoRAG's performance by enhancing its cluing mechanism and\nmemorization capacity. In our experiment, MemoRAG achieves superior performance\nacross a variety of evaluation tasks, including both complex ones where\nconventional RAG fails and straightforward ones where RAG is commonly applied.", "paper_summary_zh": "撷取增强式生成 (RAG) 运用撷取工具存取\n外部资料库，藉由最佳化语境，进而提升大型语言\n模型 (LLM) 的生成品质。然而，现有的撷取\n方法本质上受到限制，因为它们只能在明确陈述的查询和完善的知识之间执行相关性比对，但无法\n处理涉及模棱两可的信息需求或非结构化知识的任务。\n因此，现有的 RAG 系统主要适用于直接的\n问答任务。在这项工作中，我们提出 \\textbf{MemoRAG}，一种由长期记忆赋能的新型撷取增强式生成范例。MemoRAG\n采用双系统架构。一方面，它采用一个\\textit{轻量但远距离} LLM 来形成资料库的全局记忆。一旦任务被提出，它会生成答案草稿，提示撷取工具在资料库中找到有用的信息。另一方面，它利用一个\\textit{昂贵但具有表现力}的 LLM，根据撷取的信息生成最终答案。在此一般架构的基础上，我们进一步优化 MemoRAG 的效能，藉由增强其提示机制和记忆容量。在我们的实验中，MemoRAG 在各种评估任务中达到卓越的效能，包括传统 RAG 无法处理的复杂任务，以及 RAG 常被应用的直接任务。", "author": "Hongjin Qian et.al.", "authors": "Hongjin Qian, Peitian Zhang, Zheng Liu, Kelong Mao, Zhicheng Dou", "id": "2409.05591v1", "paper_url": "http://arxiv.org/abs/2409.05591v1", "repo": "null"}}