{"2412.14570": {"publish_time": "2024-12-19", "title": "Characterising Simulation-Based Program Equilibria", "paper_summary": "In Tennenholtz's program equilibrium, players of a game submit programs to\nplay on their behalf. Each program receives the other programs' source code and\noutputs an action. This can model interactions involving AI agents, mutually\ntransparent institutions, or commitments. Tennenholtz (2004) proves a folk\ntheorem for program games, but the equilibria constructed are very brittle. We\ntherefore consider simulation-based programs -- i.e., programs that work by\nrunning opponents' programs. These are relatively robust (in particular, two\nprograms that act the same are treated the same) and are more practical than\nproof-based approaches. Oesterheld's (2019) $\\epsilon$Grounded$\\pi$Bot is such\nan approach. Unfortunately, it is not generally applicable to games of three or\nmore players, and only allows for a limited range of equilibria in two player\ngames. In this paper, we propose a generalisation to Oesterheld's (2019)\n$\\epsilon$Grounded$\\pi$Bot. We prove a folk theorem for our programs in a\nsetting with access to a shared source of randomness. We then characterise\ntheir equilibria in a setting without shared randomness. Both with and without\nshared randomness, we achieve a much wider range of equilibria than\nOesterheld's (2019) $\\epsilon$Grounded$\\pi$Bot. Finally, we explore the limits\nof simulation-based program equilibrium, showing that the Tennenholtz folk\ntheorem cannot be attained by simulation-based programs without access to\nshared randomness.", "paper_summary_zh": "在 Tennenholtz 的程式平衡中，遊戲玩家提交程式代表他們進行遊戲。每個程式接收其他程式的原始碼並輸出一個動作。這可以模擬涉及 AI 代理、相互透明的機構或承諾的互動。Tennenholtz (2004) 為程式遊戲證明了一個民間定理，但所建構的均衡非常脆弱。因此，我們考慮基於模擬的程式，即透過執行對手的程式來工作的程式。這些程式相對健全（特別是執行相同動作的兩個程式會受到相同對待），且比基於證明的途徑更實務。Oesterheld (2019) 的 $\\epsilon$Grounded$\\pi$Bot 就是這種途徑。不幸的是，它通常不適用於三名或更多玩家的遊戲，且僅允許在雙人遊戲中有限範圍的均衡。在本文中，我們提出對 Oesterheld (2019) 的 $\\epsilon$Grounded$\\pi$Bot 的概括。我們在可以存取共用隨機來源的設定中為我們的程式證明一個民間定理。然後，我們在沒有共用隨機來源的設定中描述其均衡。在有和沒有共用隨機來源的情況下，我們達到的均衡範圍都比 Oesterheld (2019) 的 $\\epsilon$Grounded$\\pi$Bot 更廣。最後，我們探討基於模擬的程式均衡的限制，顯示 Tennenholtz 民間定理無法由沒有存取共用隨機來源的基於模擬的程式達成。", "author": "Emery Cooper et.al.", "authors": "Emery Cooper, Caspar Oesterheld, Vincent Conitzer", "id": "2412.14570v1", "paper_url": "http://arxiv.org/abs/2412.14570v1", "repo": "null"}}