{"2410.07928": {"publish_time": "2024-10-10", "title": "The Function-Representation Unification Framework", "paper_summary": "Cognitive Architectures are the forefront of our research into developing an\nartificial cognition. However, they approach the problem from a separated\nmemory and program model of computation. This model of computation poses a\nfundamental problem: the knowledge retrieval heuristic. In this paper we\npropose to solve this problem by using a new model of computation, one where\nthe memory and the program are united: the Function-Representation. We propose\na whole framework about how to implement and use these\nFunction-Representations, and we explore their potential through mathematical\ndefinitions and proofs. We also talk about different ways to organise multiple\nFunction-Representations, and explore the kind of functions that these\nFunction-Representations can implement. Finally, we also explore the\nlimitations of our proposal.", "paper_summary_zh": "認知架構是我們開發人工認知研究的前沿。然而，他們從分離的記憶和程式計算模型來探討問題。這個計算模型提出了基本問題：知識擷取啟發法。在本文中，我們提議使用新的計算模型來解決這個問題，一個記憶體和程式結合的模型：函數表示。我們提出一個關於如何實作和使用這些函數表示的完整架構，並透過數學定義和證明來探討它們的潛力。我們也討論組織多個函數表示的不同方法，並探討這些函數表示可以實作的函數類型。最後，我們也探討我們提議的限制。", "author": "Alfredo Ibias et.al.", "authors": "Alfredo Ibias, Hector Antona, Guillem Ramirez-Miranda, Enric Guinovart, Eduard Alarcon", "id": "2410.07928v1", "paper_url": "http://arxiv.org/abs/2410.07928v1", "repo": "null"}}