{"2412.06009": {"publish_time": "2024-12-08", "title": "1-800-SHARED-TASKS at RegNLP: Lexical Reranking of Semantic Retrieval (LeSeR) for Regulatory Question Answering", "paper_summary": "This paper presents the system description of our entry for the COLING 2025\nRegNLP RIRAG (Regulatory Information Retrieval and Answer Generation)\nchallenge, focusing on leveraging advanced information retrieval and answer\ngeneration techniques in regulatory domains. We experimented with a combination\nof embedding models, including Stella, BGE, CDE, and Mpnet, and leveraged\nfine-tuning and reranking for retrieving relevant documents in top ranks. We\nutilized a novel approach, LeSeR, which achieved competitive results with a\nrecall@10 of 0.8201 and map@10 of 0.6655 for retrievals. This work highlights\nthe transformative potential of natural language processing techniques in\nregulatory applications, offering insights into their capabilities for\nimplementing a retrieval augmented generation system while identifying areas\nfor future improvement in robustness and domain adaptation.", "paper_summary_zh": "這篇論文提出我們在 COLING 2025 RegNLP RIRAG（法規資訊檢索與答案生成）挑戰中的系統描述，重點在於在法規領域中利用進階的資訊檢索與答案生成技術。我們實驗了嵌入模型的組合，包括 Stella、BGE、CDE 和 Mpnet，並利用微調和重新排序來檢索頂級排名中的相關文件。我們利用了一種新穎的方法 LeSeR，在檢索中取得了具有競爭力的結果，recall@10 為 0.8201，map@10 為 0.6655。這項工作突顯了自然語言處理技術在法規應用中的轉型潛力，提供了對其在實作檢索增強生成系統時的能力的見解，同時也找出在穩健性和領域適應性方面未來改進的領域。", "author": "Jebish Purbey et.al.", "authors": "Jebish Purbey, Drishti Sharma, Siddhant Gupta, Khawaja Murad, Siddartha Pullakhandam, Ram Mohan Rao Kadiyala", "id": "2412.06009v1", "paper_url": "http://arxiv.org/abs/2412.06009v1", "repo": "null"}}