{"2501.01644": {"publish_time": "2025-01-03", "title": "Multimodal Contrastive Representation Learning in Augmented Biomedical Knowledge Graphs", "paper_summary": "Biomedical Knowledge Graphs (BKGs) integrate diverse datasets to elucidate\ncomplex relationships within the biomedical field. Effective link prediction on\nthese graphs can uncover valuable connections, such as potential novel\ndrug-disease relations. We introduce a novel multimodal approach that unifies\nembeddings from specialized Language Models (LMs) with Graph Contrastive\nLearning (GCL) to enhance intra-entity relationships while employing a\nKnowledge Graph Embedding (KGE) model to capture inter-entity relationships for\neffective link prediction. To address limitations in existing BKGs, we present\nPrimeKG++, an enriched knowledge graph incorporating multimodal data, including\nbiological sequences and textual descriptions for each entity type. By\ncombining semantic and relational information in a unified representation, our\napproach demonstrates strong generalizability, enabling accurate link\npredictions even for unseen nodes. Experimental results on PrimeKG++ and the\nDrugBank drug-target interaction dataset demonstrate the effectiveness and\nrobustness of our method across diverse biomedical datasets. Our source code,\npre-trained models, and data are publicly available at\nhttps://github.com/HySonLab/BioMedKG", "paper_summary_zh": "生物医学知識圖譜 (BKG) 整合多樣化的資料集，以闡明生物醫學領域內的複雜關係。在這些圖譜上進行有效的連結預測，可以發現有價值的連結，例如潛在的新藥物-疾病關係。我們引入了一種新穎的多模態方法，它將來自專用語言模型 (LM) 的嵌入與圖形對比學習 (GCL) 統一起來，以增強實體內關係，同時採用知識圖形嵌入 (KGE) 模型來捕捉實體間關係，以進行有效的連結預測。為了解決現有 BKG 中的限制，我們提出了 PrimeKG++，這是一個豐富的知識圖形，它結合了多模態數據，包括每種類型實體的生物序列和文字描述。通過在統一表示中結合語義和關係資訊，我們的做法展示了強大的概括性，即使對於未見節點也能進行準確的連結預測。在 PrimeKG++ 和 DrugBank 藥物-標靶交互作用資料集上的實驗結果證明了我們的方法在各種生物醫學資料集中的有效性和穩健性。我們的原始碼、預訓練模型和資料可在 https://github.com/HySonLab/BioMedKG 公開取得。", "author": "Tien Dang et.al.", "authors": "Tien Dang, Viet Thanh Duy Nguyen, Minh Tuan Le, Truong-Son Hy", "id": "2501.01644v1", "paper_url": "http://arxiv.org/abs/2501.01644v1", "repo": "null"}}