{"2502.02862": {"publish_time": "2025-02-05", "title": "Learning Generalizable Features for Tibial Plateau Fracture Segmentation Using Masked Autoencoder and Limited Annotations", "paper_summary": "Accurate automated segmentation of tibial plateau fractures (TPF) from\ncomputed tomography (CT) requires large amounts of annotated data to train deep\nlearning models, but obtaining such annotations presents unique challenges. The\nprocess demands expert knowledge to identify diverse fracture patterns, assess\nseverity, and account for individual anatomical variations, making the\nannotation process highly time-consuming and expensive. Although\nsemi-supervised learning methods can utilize unlabeled data, existing\napproaches often struggle with the complexity and variability of fracture\nmorphologies, as well as limited generalizability across datasets. To tackle\nthese issues, we propose an effective training strategy based on masked\nautoencoder (MAE) for the accurate TPF segmentation in CT. Our method leverages\nMAE pretraining to capture global skeletal structures and fine-grained fracture\ndetails from unlabeled data, followed by fine-tuning with a small set of\nlabeled data. This strategy reduces the dependence on extensive annotations\nwhile enhancing the model's ability to learn generalizable and transferable\nfeatures. The proposed method is evaluated on an in-house dataset containing\n180 CT scans with TPF. Experimental results demonstrate that our method\nconsistently outperforms semi-supervised methods, achieving an average Dice\nsimilarity coefficient (DSC) of 95.81%, average symmetric surface distance\n(ASSD) of 1.91mm, and Hausdorff distance (95HD) of 9.42mm with only 20\nannotated cases. Moreover, our method exhibits strong transferability when\napplying to another public pelvic CT dataset with hip fractures, highlighting\nits potential for broader applications in fracture segmentation tasks.", "paper_summary_zh": "脛骨平台骨折 (TPF) 的精確自動分割來自電腦斷層掃描 (CT)，需要大量標註的資料來訓練深度學習模型，但取得這些標註會產生獨特的挑戰。這個過程需要專家知識來識別不同的骨折模式、評估嚴重程度，並考量個別的解剖學變異，這使得標註過程非常耗時且昂貴。雖然半監督式學習方法可以利用未標籤的資料，但現有的方法通常難以應付骨折形態的複雜性和變異性，以及跨資料集的通用性有限。為了解決這些問題，我們提出一個基於遮罩式自動編碼器 (MAE) 的有效訓練策略，用於 CT 中精確的 TPF 分割。我們的辦法利用 MAE 預訓練來擷取未標籤資料中的整體骨骼結構和細微骨折細節，然後使用一小組標籤資料進行微調。這個策略減少了對大量標註的依賴，同時增強了模型學習可概括和可轉移特徵的能力。所提出的方法在一個包含 180 個 TPF 的 CT 掃描的內部資料集上進行評估。實驗結果證明，我們的辦法始終優於半監督式方法，實現了平均 Dice 相似性係數 (DSC) 為 95.81%，平均對稱表面距離 (ASSD) 為 1.91mm，以及 Hausdorff 距離 (95HD) 為 9.42mm，僅有 20 個標註案例。此外，我們的辦法在應用於另一個有髖部骨折的公共骨盆 CT 資料集時展現出強大的可轉移性，突顯了其在骨折分割任務中更廣泛應用的潛力。", "author": "Peiyan Yue et.al.", "authors": "Peiyan Yue, Die Cai, Chu Guo, Mengxing Liu, Jun Xia, Yi Wang", "id": "2502.02862v1", "paper_url": "http://arxiv.org/abs/2502.02862v1", "repo": "null"}}