{"2409.08264": {"publish_time": "2024-09-12", "title": "Windows Agent Arena: Evaluating Multi-Modal OS Agents at Scale", "paper_summary": "Large language models (LLMs) show remarkable potential to act as computer\nagents, enhancing human productivity and software accessibility in multi-modal\ntasks that require planning and reasoning. However, measuring agent performance\nin realistic environments remains a challenge since: (i) most benchmarks are\nlimited to specific modalities or domains (e.g. text-only, web navigation, Q&A,\ncoding) and (ii) full benchmark evaluations are slow (on order of magnitude of\ndays) given the multi-step sequential nature of tasks. To address these\nchallenges, we introduce the Windows Agent Arena: a reproducible, general\nenvironment focusing exclusively on the Windows operating system (OS) where\nagents can operate freely within a real Windows OS and use the same wide range\nof applications, tools, and web browsers available to human users when solving\ntasks. We adapt the OSWorld framework (Xie et al., 2024) to create 150+ diverse\nWindows tasks across representative domains that require agent abilities in\nplanning, screen understanding, and tool usage. Our benchmark is scalable and\ncan be seamlessly parallelized in Azure for a full benchmark evaluation in as\nlittle as 20 minutes. To demonstrate Windows Agent Arena's capabilities, we\nalso introduce a new multi-modal agent, Navi. Our agent achieves a success rate\nof 19.5% in the Windows domain, compared to 74.5% performance of an unassisted\nhuman. Navi also demonstrates strong performance on another popular web-based\nbenchmark, Mind2Web. We offer extensive quantitative and qualitative analysis\nof Navi's performance, and provide insights into the opportunities for future\nresearch in agent development and data generation using Windows Agent Arena.\n  Webpage: https://microsoft.github.io/WindowsAgentArena\n  Code: https://github.com/microsoft/WindowsAgentArena", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 展現出作為電腦代理的非凡潛力，在需要規劃和推理的多模態任務中提升人類生產力和軟體可及性。然而，在逼真的環境中測量代理效能仍然是一項挑戰，原因如下：(i) 大多數基準測試僅限於特定模態或領域 (例如純文字、網頁瀏覽、問答、編碼)，以及 (ii) 由於任務的多步驟順序性質，完整的基準測試評估很慢 (以天為單位)。為了應對這些挑戰，我們引入了 Windows 代理競技場：一個可重複、通用的環境，專注於 Windows 作業系統 (OS)，代理可以在真正的 Windows 作業系統中自由運作，並使用與人類使用者在解決任務時可用的相同廣泛的應用程式、工具和網路瀏覽器。我們調整 OSWorld 框架 (Xie 等人，2024 年) 來建立 150 多項跨代表性領域的多元 Windows 任務，這些任務需要代理具備規劃、螢幕理解和工具使用方面的能力。我們的基準測試具有可擴展性，可以在 Azure 中無縫並行處理，在短短 20 分鐘內完成完整的基準測試評估。為了展示 Windows 代理競技場的能力，我們還引入了一個新的多模態代理 Navi。我們的代理在 Windows 領域達到了 19.5% 的成功率，而未受協助的人類效能為 74.5%。Navi 也在另一個流行的網路基準測試 Mind2Web 上展現了強勁的效能。我們對 Navi 的效能進行了廣泛的量化和質化分析，並提供了對使用 Windows 代理競技場進行代理開發和資料生成的未來研究機會的見解。\n網站：https://microsoft.github.io/WindowsAgentArena\n程式碼：https://github.com/microsoft/WindowsAgentArena</paragraph>", "author": "Rogerio Bonatti et.al.", "authors": "Rogerio Bonatti, Dan Zhao, Francesco Bonacci, Dillon Dupont, Sara Abdali, Yinheng Li, Justin Wagle, Kazuhito Koishida, Arthur Bucker, Lawrence Jang, Zack Hui", "id": "2409.08264v1", "paper_url": "http://arxiv.org/abs/2409.08264v1", "repo": "https://github.com/microsoft/windowsagentarena"}}