{"2408.11247": {"publish_time": "2024-08-20", "title": "Unboxing Occupational Bias: Grounded Debiasing LLMs with U.S. Labor Data", "paper_summary": "Large Language Models (LLMs) are prone to inheriting and amplifying societal\nbiases embedded within their training data, potentially reinforcing harmful\nstereotypes related to gender, occupation, and other sensitive categories. This\nissue becomes particularly problematic as biased LLMs can have far-reaching\nconsequences, leading to unfair practices and exacerbating social inequalities\nacross various domains, such as recruitment, online content moderation, or even\nthe criminal justice system. Although prior research has focused on detecting\nbias in LLMs using specialized datasets designed to highlight intrinsic biases,\nthere has been a notable lack of investigation into how these findings\ncorrelate with authoritative datasets, such as those from the U.S. National\nBureau of Labor Statistics (NBLS). To address this gap, we conduct empirical\nresearch that evaluates LLMs in a ``bias-out-of-the-box\" setting, analyzing how\nthe generated outputs compare with the distributions found in NBLS data.\nFurthermore, we propose a straightforward yet effective debiasing mechanism\nthat directly incorporates NBLS instances to mitigate bias within LLMs. Our\nstudy spans seven different LLMs, including instructable, base, and\nmixture-of-expert models, and reveals significant levels of bias that are often\noverlooked by existing bias detection techniques. Importantly, our debiasing\nmethod, which does not rely on external datasets, demonstrates a substantial\nreduction in bias scores, highlighting the efficacy of our approach in creating\nfairer and more reliable LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 容易繼承和放大其訓練資料中內嵌的社會偏見，潛在強化與性別、職業和其他敏感類別相關的有害刻板印象。這個問題變得特別有問題，因為有偏見的 LLM 可能會產生深遠的後果，導致不公平的行為，並加劇各種領域的社會不平等，例如招聘、線上內容審核，甚至是刑事司法系統。儘管先前的研究專注於使用專門設計來強調內在偏見的資料集來偵測 LLM 中的偏見，但對於這些發現如何與權威資料集相關聯的研究卻明顯不足，例如來自美國國家勞工統計局 (NBLS) 的資料集。為了解決這個差距，我們進行實證研究來評估 LLM 在「偏見開箱即用」的設定中，分析產生的輸出與在 NBLS 資料中發現的分配如何比較。此外，我們提出一個簡單但有效的去偏機制，直接納入 NBLS 實例以減輕 LLM 中的偏見。我們的研究涵蓋七種不同的 LLM，包括可指導、基礎和專家混合模型，並揭示出大量偏見，這些偏見通常被現有的偏見偵測技術所忽略。重要的是，我們的去偏方法不依賴於外部資料集，證明了偏見評分顯著降低，突顯了我們的方法在創造更公平、更可靠的 LLM 中的效力。", "author": "Atmika Gorti et.al.", "authors": "Atmika Gorti, Manas Gaur, Aman Chadha", "id": "2408.11247v1", "paper_url": "http://arxiv.org/abs/2408.11247v1", "repo": "null"}}