{"2408.09688": {"publish_time": "2024-08-19", "title": "Recording for Eyes, Not Echoing to Ears: Contextualized Spoken-to-Written Conversion of ASR Transcripts", "paper_summary": "Automatic Speech Recognition (ASR) transcripts exhibit recognition errors and\nvarious spoken language phenomena such as disfluencies, ungrammatical\nsentences, and incomplete sentences, hence suffering from poor readability. To\nimprove readability, we propose a Contextualized Spoken-to-Written conversion\n(CoS2W) task to address ASR and grammar errors and also transfer the informal\ntext into the formal style with content preserved, utilizing contexts and\nauxiliary information. This task naturally matches the in-context learning\ncapabilities of Large Language Models (LLMs). To facilitate comprehensive\ncomparisons of various LLMs, we construct a document-level Spoken-to-Written\nconversion of ASR Transcripts Benchmark (SWAB) dataset. Using SWAB, we study\nthe impact of different granularity levels on the CoS2W performance, and\npropose methods to exploit contexts and auxiliary information to enhance the\noutputs. Experimental results reveal that LLMs have the potential to excel in\nthe CoS2W task, particularly in grammaticality and formality, our methods\nachieve effective understanding of contexts and auxiliary information by LLMs.\nWe further investigate the effectiveness of using LLMs as evaluators and find\nthat LLM evaluators show strong correlations with human evaluations on rankings\nof faithfulness and formality, which validates the reliability of LLM\nevaluators for the CoS2W task.", "paper_summary_zh": "自動語音辨識 (ASR) 轉錄會出現辨識錯誤和各種口語現象，例如言語不流暢、不符合文法的句子和不完整的句子，因此可讀性很差。為了改善可讀性，我們提出語境化口語轉書寫轉換 (CoS2W) 任務來解決 ASR 和文法錯誤，並在保留內容的情況下將非正式文字轉換為正式風格，利用語境和輔助資訊。此任務自然符合大型語言模型 (LLM) 的語境學習能力。為了促進對各種 LLM 的全面比較，我們建構了 ASR 轉錄基準 (SWAB) 資料集的文檔級口語轉書寫轉換。使用 SWAB，我們研究了不同粒度層級對 CoS2W 效能的影響，並提出利用語境和輔助資訊來增強輸出的方法。實驗結果顯示，LLM 有潛力在 CoS2W 任務中表現出色，特別是在文法和正式性方面，我們的這些方法讓 LLM 有效理解語境和輔助資訊。我們進一步探討將 LLM 用作評估器的有效性，發現 LLM 評估器在忠實度和正式性的排名上與人類評估有很強的相關性，這驗證了 LLM 評估器在 CoS2W 任務中的可靠性。", "author": "Jiaqing Liu et.al.", "authors": "Jiaqing Liu, Chong Deng, Qinglin Zhang, Qian Chen, Hai Yu, Wen Wang", "id": "2408.09688v1", "paper_url": "http://arxiv.org/abs/2408.09688v1", "repo": "null"}}