{"2410.22689": {"publish_time": "2024-10-30", "title": "Multi-Task Interactive Robot Fleet Learning with Visual World Models", "paper_summary": "Recent advancements in large-scale multi-task robot learning offer the\npotential for deploying robot fleets in household and industrial settings,\nenabling them to perform diverse tasks across various environments. However,\nAI-enabled robots often face challenges with generalization and robustness when\nexposed to real-world variability and uncertainty. We introduce Sirius-Fleet, a\nmulti-task interactive robot fleet learning framework to address these\nchallenges. Sirius-Fleet monitors robot performance during deployment and\ninvolves humans to correct the robot's actions when necessary. We employ a\nvisual world model to predict the outcomes of future actions and build anomaly\npredictors to predict whether they will likely result in anomalies. As the\nrobot autonomy improves, the anomaly predictors automatically adapt their\nprediction criteria, leading to fewer requests for human intervention and\ngradually reducing human workload over time. Evaluations on large-scale\nbenchmarks demonstrate Sirius-Fleet's effectiveness in improving multi-task\npolicy performance and monitoring accuracy. We demonstrate Sirius-Fleet's\nperformance in both RoboCasa in simulation and Mutex in the real world, two\ndiverse, large-scale multi-task benchmarks. More information is available on\nthe project website: https://ut-austin-rpl.github.io/sirius-fleet", "paper_summary_zh": "大型多任务机器人学习的近期进展提供了在家庭和工业环境中部署机器人车队的潜力，使他们能够在各种环境中执行不同的任务。然而，人工智能驱动的机器人经常面临泛化和鲁棒性方面的挑战，当暴露于现实世界的可变性和不确定性时。我们引入了 Sirius-Fleet，一个多任务交互式机器人车队学习框架来解决这些挑战。Sirius-Fleet 在部署期间监控机器人性能，并在必要时让人类来纠正机器人的动作。我们采用了一个视觉世界模型来预测未来动作的结果，并构建异常预测器来预测它们是否可能导致异常。随着机器人自主性的提高，异常预测器会自动调整其预测标准，从而减少对人类干预的请求，并随着时间的推移逐渐减少人类的工作量。在大规模基准测试上的评估证明了 Sirius-Fleet 在提高多任务策略性能和监控准确性方面的有效性。我们展示了 Sirius-Fleet 在模拟中的 RoboCasa 和现实世界中的 Mutex 中的性能，这两个大型多任务基准测试具有多样性。更多信息可在项目网站上找到：https://ut-austin-rpl.github.io/sirius-fleet", "author": "Huihan Liu et.al.", "authors": "Huihan Liu, Yu Zhang, Vaarij Betala, Evan Zhang, James Liu, Crystal Ding, Yuke Zhu", "id": "2410.22689v1", "paper_url": "http://arxiv.org/abs/2410.22689v1", "repo": "null"}}