{"2407.13744": {"publish_time": "2024-07-18", "title": "LLMs as Function Approximators: Terminology, Taxonomy, and Questions for Evaluation", "paper_summary": "Natural Language Processing has moved rather quickly from modelling specific\ntasks to taking more general pre-trained models and fine-tuning them for\nspecific tasks, to a point where we now have what appear to be inherently\ngeneralist models. This paper argues that the resultant loss of clarity on what\nthese models model leads to metaphors like \"artificial general intelligences\"\nthat are not helpful for evaluating their strengths and weaknesses. The\nproposal is to see their generality, and their potential value, in their\nability to approximate specialist function, based on a natural language\nspecification. This framing brings to the fore questions of the quality of the\napproximation, but beyond that, also questions of discoverability, stability,\nand protectability of these functions. As the paper will show, this framing\nhence brings together in one conceptual framework various aspects of\nevaluation, both from a practical and a theoretical perspective, as well as\nquestions often relegated to a secondary status (such as \"prompt injection\" and\n\"jailbreaking\").", "paper_summary_zh": "自然語言處理已經從建模特定任務相當快速地轉移到採用更通用的預訓練模型，並針對特定任務微調它們，進展到我們現在擁有看似本質上是通才模型的地步。這篇論文認為，對於這些模型建模的內容缺乏明確性，導致出現「人工通用智慧」等比喻，而這對於評估它們的優缺點沒有幫助。建議在它們近似專家功能的能力中，根據自然語言規格，了解它們的通用性和潛在價值。此架構凸顯了近似品質的問題，但除此之外，也凸顯了這些功能的可發現性、穩定性和可保護性的問題。正如本文將展示的，此架構因此在一個概念架構中彙整了評估的各個方面，無論是從實務或理論的角度，以及經常降級為次要狀態的問題（例如「提示注入」和「越獄」）。", "author": "David Schlangen et.al.", "authors": "David Schlangen", "id": "2407.13744v1", "paper_url": "http://arxiv.org/abs/2407.13744v1", "repo": "null"}}