{"2409.02370": {"publish_time": "2024-09-04", "title": "Do Large Language Models Possess Sensitive to Sentiment?", "paper_summary": "Large Language Models (LLMs) have recently displayed their extraordinary\ncapabilities in language understanding. However, how to comprehensively assess\nthe sentiment capabilities of LLMs continues to be a challenge. This paper\ninvestigates the ability of LLMs to detect and react to sentiment in text\nmodal. As the integration of LLMs into diverse applications is on the rise, it\nbecomes highly critical to comprehend their sensitivity to emotional tone, as\nit can influence the user experience and the efficacy of sentiment-driven\ntasks. We conduct a series of experiments to evaluate the performance of\nseveral prominent LLMs in identifying and responding appropriately to\nsentiments like positive, negative, and neutral emotions. The models' outputs\nare analyzed across various sentiment benchmarks, and their responses are\ncompared with human evaluations. Our discoveries indicate that although LLMs\nshow a basic sensitivity to sentiment, there are substantial variations in\ntheir accuracy and consistency, emphasizing the requirement for further\nenhancements in their training processes to better capture subtle emotional\ncues. Take an example in our findings, in some cases, the models might wrongly\nclassify a strongly positive sentiment as neutral, or fail to recognize sarcasm\nor irony in the text. Such misclassifications highlight the complexity of\nsentiment analysis and the areas where the models need to be refined. Another\naspect is that different LLMs might perform differently on the same set of\ndata, depending on their architecture and training datasets. This variance\ncalls for a more in-depth study of the factors that contribute to the\nperformance differences and how they can be optimized.", "paper_summary_zh": "大型語言模型 (LLM) 近期展現出它們在語言理解方面的非凡能力。然而，如何全面評估 LLM 的情緒能力仍然是一項挑戰。本文探討 LLM 在文字模式中偵測和回應情緒的能力。由於 LLM 整合到各種應用程式的趨勢日益盛行，理解它們對情緒語氣的敏感度變得至關重要，因為它會影響使用者體驗和情緒驅動任務的效能。我們進行了一系列實驗，以評估幾個著名的 LLM 在識別和適當回應正面、負面和中立情緒等情緒方面的表現。我們在各種情緒基準上分析模型的輸出，並將其回應與人類評估進行比較。我們的發現表明，儘管 LLM 對情緒表現出基本的敏感性，但它們的準確性和一致性存在很大差異，這強調了需要進一步加強其訓練過程以更好地捕捉微妙的情緒線索。以我們的發現為例，在某些情況下，模型可能會錯誤地將強烈的正面情緒歸類為中立，或者無法識別文字中的諷刺或反諷。這種錯誤分類突顯了情緒分析的複雜性以及模型需要改進的領域。另一個方面是，不同的 LLM 在同一組資料上的表現可能不同，具體取決於它們的架構和訓練資料集。這種差異要求更深入地研究導致效能差異的因素，以及如何對其進行最佳化。", "author": "Yang Liu et.al.", "authors": "Yang Liu, Xichou Zhu, Zhou Shen, Yi Liu, Min Li, Yujun Chen, Benzi John, Zhenzhen Ma, Tao Hu, Zhiyang Xu, Wei Luo, Junhui Wang", "id": "2409.02370v1", "paper_url": "http://arxiv.org/abs/2409.02370v1", "repo": "null"}}