{"2405.10299": {"publish_time": "2024-05-16", "title": "HW-GPT-Bench: Hardware-Aware Architecture Benchmark for Language Models", "paper_summary": "The expanding size of language models has created the necessity for a\ncomprehensive examination across various dimensions that reflect the desiderata\nwith respect to the tradeoffs between various hardware metrics, such as\nlatency, energy consumption, GPU memory usage, and performance. There is a\ngrowing interest in establishing Pareto frontiers for different language model\nconfigurations to identify optimal models with specified hardware constraints.\nNotably, architectures that excel in latency on one device may not perform\noptimally on another. However, exhaustive training and evaluation of numerous\narchitectures across diverse hardware configurations is computationally\nprohibitive. To this end, we propose HW-GPT-Bench, a hardware-aware language\nmodel surrogate benchmark, where we leverage weight-sharing techniques from\nNeural Architecture Search (NAS) to efficiently train a supernet proxy,\nencompassing language models of varying scales in a single model. We conduct\nprofiling of these models across 13 devices, considering 5 hardware metrics and\n3 distinct model scales. Finally, we showcase the usability of HW-GPT-Bench\nusing 8 different multi-objective NAS algorithms and evaluate the quality of\nthe resultant Pareto fronts. Through this benchmark, our objective is to propel\nand expedite research in the advancement of multi-objective methods for NAS and\nstructural pruning in large language models.", "paper_summary_zh": "<paragraph>語言模型的規模擴大，讓人有必要從各種面向進行全面檢視，這些面向反映了在各種硬體指標（例如延遲、能源消耗、GPU 記憶體使用量和效能）之間的折衷考量。對於建立不同語言模型組態的 Pareto 前緣，以找出符合特定硬體限制的最佳模型，人們的興趣與日俱增。值得注意的是，在一個裝置上延遲表現優異的架構，在另一個裝置上可能無法達到最佳效能。然而，在各種硬體組態中對眾多架構進行窮舉式訓練和評估，在運算上是禁止的。為此，我們提出了 HW-GPT-Bench，這是一個硬體感知語言模型替代基準，我們在其中利用神經架構搜尋 (NAS) 的權重共用技術，有效率地訓練一個超級網路代理，在單一模型中涵蓋各種規模的語言模型。我們在 13 個裝置上對這些模型進行分析，考量 5 個硬體指標和 3 個不同的模型規模。最後，我們展示了 HW-GPT-Bench 的可用性，使用了 8 種不同的多目標 NAS 演算法，並評估所得 Pareto 前緣的品質。透過這個基準，我們的目標是推動和加速在 NAS 和大型語言模型結構化剪枝的多目標方法的進展。</paragraph>", "author": "Rhea Sanjay Sukthanker et.al.", "authors": "Rhea Sanjay Sukthanker, Arber Zela, Benedikt Staffler, Jorg K. H. Franke, Frank Hutter", "id": "2405.10299v1", "paper_url": "http://arxiv.org/abs/2405.10299v1", "repo": "null"}}