{"2501.18511": {"publish_time": "2025-01-30", "title": "WILDCHAT-50M: A Deep Dive Into the Role of Synthetic Data in Post-Training", "paper_summary": "Language model (LLM) post-training, from DPO to distillation, can refine\nbehaviors and unlock new skills, but the open science supporting these\npost-training techniques is still in its infancy. One limiting factor has been\nthe difficulty of conducting large-scale comparative analyses of synthetic data\ngenerating models and LLM judges. To close this gap, we introduce WILDCHAT-50M,\nthe largest public chat dataset to date. We extend the existing WildChat\ndataset to include responses not only from GPT, but from over 50 different\nopen-weight models, ranging in size from 0.5B to 104B parameters. We conduct an\nextensive comparative analysis and demonstrate the potential of this dataset by\ncreating RE-WILD, our own public SFT mix, which outperforms the recent Tulu-3\nSFT mixture from Allen AI with only 40% as many samples. Our dataset, samples\nand code are available at https://github.com/penfever/wildchat-50m.", "paper_summary_zh": "語言模型 (LLM) 後訓練，從 DPO 到蒸餾，可以改善行為並解鎖新技能，但支援這些後訓練技術的開放科學仍處於起步階段。一個限制因素是難以對合成資料產生模型和 LLM 評審進行大規模比較分析。為了縮小這個差距，我們引入了 WILDCHAT-50M，這是迄今為止最大的公開聊天資料集。我們擴充現有的 WildChat 資料集，不僅包含來自 GPT 的回應，還包含來自 50 多種不同的開放權重模型的回應，規模從 0.5B 到 104B 參數不等。我們進行了廣泛的比較分析，並透過建立我們自己的公開 SFT 混合 RE-WILD 來展示此資料集的潛力，它以僅 40% 的樣本數量就優於 Allen AI 最近的 Tulu-3 SFT 混合。我們的資料集、範例和程式碼可在 https://github.com/penfever/wildchat-50m 取得。", "author": "Benjamin Feuer et.al.", "authors": "Benjamin Feuer, Chinmay Hegde", "id": "2501.18511v1", "paper_url": "http://arxiv.org/abs/2501.18511v1", "repo": "https://github.com/penfever/wildchat-50m"}}