{"2407.06645": {"publish_time": "2024-07-09", "title": "Entropy Law: The Story Behind Data Compression and LLM Performance", "paper_summary": "Data is the cornerstone of large language models (LLMs), but not all data is\nuseful for model learning. Carefully selected data can better elicit the\ncapabilities of LLMs with much less computational overhead. Most methods\nconcentrate on evaluating the quality of individual samples in data selection,\nwhile the combinatorial effects among samples are neglected. Even if each\nsample is of perfect quality, their combinations may be suboptimal in teaching\nLLMs due to their intrinsic homogeneity or contradiction. In this paper, we aim\nto uncover the underlying relationships between LLM performance and data\nselection. Inspired by the information compression nature of LLMs, we uncover\nan ``entropy law'' that connects LLM performance with data compression ratio\nand first-epoch training loss, which reflect the information redundancy of a\ndataset and the mastery of inherent knowledge encoded in this dataset,\nrespectively. Through both theoretical deduction and empirical evaluation, we\nfind that model performance is negatively correlated to the compression ratio\nof training data, which usually yields a lower training loss. Based on the\nfindings of the entropy law, we propose a quite efficient and universal data\nselection method named \\textbf{ZIP} for training LLMs, which aim to prioritize\ndata subsets exhibiting a low compression ratio. Based on a multi-stage\nalgorithm that selects diverse data in a greedy manner, we can obtain a good\ndata subset with satisfactory diversity. Extensive experiments have been\nconducted to validate the entropy law and the superiority of ZIP across\ndifferent LLM backbones and alignment stages. We also present an interesting\napplication of entropy law that can detect potential performance risks at the\nbeginning of model training.", "paper_summary_zh": "<paragraph>資料是大語言模型 (LLM) 的基石，但並非所有資料都對模型學習有幫助。仔細挑選的資料能以更少的運算開銷，更好地引發 LLM 的功能。大多數方法專注於評估資料選擇中個別範例的品質，而範例之間的組合效應則被忽略。即使每個範例的品質都完美無缺，它們的組合可能由於其內在的同質性或矛盾性，而無法以次佳的方式來訓練 LLM。在本文中，我們旨在揭示 LLM 效能與資料選擇之間的潛在關係。受到 LLM 的資訊壓縮特性的啟發，我們揭示了一個「熵律」，它將 LLM 效能與資料壓縮率和第一個時期的訓練損失聯繫起來，它們分別反映了資料集的資訊冗餘和對編碼在該資料集中固有知識的掌握。透過理論推論和經驗評估，我們發現模型效能與訓練資料的壓縮率呈負相關，這通常會產生較低的訓練損失。根據熵律的發現，我們提出了一個相當有效且通用的資料選擇方法，稱為 \\textbf{ZIP}，用於訓練 LLM，其目標是優先處理表現出低壓縮率的資料子集。基於一個以貪婪的方式選擇多樣化資料的多階段演算法，我們可以獲得一個具有令人滿意多樣性的良好資料子集。已經進行了廣泛的實驗來驗證熵律和 ZIP 在不同 LLM 主幹和比對階段的優越性。我們還展示了熵律的一個有趣的應用，它可以在模型訓練開始時檢測潛在的效能風險。</paragraph>", "author": "Mingjia Yin et.al.", "authors": "Mingjia Yin, Chuhan Wu, Yufei Wang, Hao Wang, Wei Guo, Yasheng Wang, Yong Liu, Ruiming Tang, Defu Lian, Enhong Chen", "id": "2407.06645v1", "paper_url": "http://arxiv.org/abs/2407.06645v1", "repo": "null"}}