{"2410.07765": {"publish_time": "2024-10-10", "title": "GameTraversalBenchmark: Evaluating Planning Abilities Of Large Language Models Through Traversing 2D Game Maps", "paper_summary": "Large language models (LLMs) have recently demonstrated great success in\ngenerating and understanding natural language. While they have also shown\npotential beyond the domain of natural language, it remains an open question as\nto what extent and in which way these LLMs can plan. We investigate their\nplanning capabilities by proposing GameTraversalBenchmark (GTB), a benchmark\nconsisting of diverse 2D grid-based game maps. An LLM succeeds if it can\ntraverse through given objectives, with a minimum number of steps and a minimum\nnumber of generation errors. We evaluate a number of LLMs on GTB and found that\nGPT-4-Turbo achieved the highest score of 44.97% on GTB\\_Score (GTBS), a\ncomposite score that combines the three above criteria. Furthermore, we\npreliminarily test large reasoning models, namely o1, which scores $67.84\\%$ on\nGTBS, indicating that the benchmark remains challenging for current models.\nCode, data, and documentation are available at\nhttps://github.com/umair-nasir14/Game-Traversal-Benchmark.", "paper_summary_zh": "大型語言模型 (LLM) 最近在生成和理解自然語言方面取得了巨大的成功。儘管它們也展現了超越自然語言領域的潛力，但這些 LLM 能在多大程度上以及以何種方式進行規劃，仍然是一個開放性的問題。我們通過提出 GameTraversalBenchmark (GTB) 來探討它們的規劃能力，GTB 是由多種 2D 網格化遊戲地圖組成的基準。如果 LLM 能以最少的步驟數和最少的生成錯誤，穿過給定的目標，則表示它成功了。我們在 GTB 上評估了多個 LLM，發現 GPT-4-Turbo 在 GTB\\_Score (GTBS) 上取得了 44.97% 的最高分，GTBS 是結合上述三個標準的綜合分數。此外，我們初步測試了大型推理模型，即 o1，它在 GTBS 上的得分為 67.84%，這表示該基準對於目前的模型來說仍然具有挑戰性。可以在 https://github.com/umair-nasir14/Game-Traversal-Benchmark 找到程式碼、資料和文件。", "author": "Muhammad Umair Nasir et.al.", "authors": "Muhammad Umair Nasir, Steven James, Julian Togelius", "id": "2410.07765v1", "paper_url": "http://arxiv.org/abs/2410.07765v1", "repo": "https://github.com/umair-nasir14/game-traversal-benchmark"}}