{"2502.14776": {"publish_time": "2025-02-20", "title": "SurveyX: Academic Survey Automation via Large Language Models", "paper_summary": "Large Language Models (LLMs) have demonstrated exceptional comprehension\ncapabilities and a vast knowledge base, suggesting that LLMs can serve as\nefficient tools for automated survey generation. However, recent research\nrelated to automated survey generation remains constrained by some critical\nlimitations like finite context window, lack of in-depth content discussion,\nand absence of systematic evaluation frameworks. Inspired by human writing\nprocesses, we propose SurveyX, an efficient and organized system for automated\nsurvey generation that decomposes the survey composing process into two phases:\nthe Preparation and Generation phases. By innovatively introducing online\nreference retrieval, a pre-processing method called AttributeTree, and a\nre-polishing process, SurveyX significantly enhances the efficacy of survey\ncomposition. Experimental evaluation results show that SurveyX outperforms\nexisting automated survey generation systems in content quality (0.259\nimprovement) and citation quality (1.76 enhancement), approaching human expert\nperformance across multiple evaluation dimensions. Examples of surveys\ngenerated by SurveyX are available on www.surveyx.cn", "paper_summary_zh": "大型語言模型 (LLM) 已展現出卓越的理解能力和廣泛的知識庫，表示 LLM 可作為自動調查生成的有用工具。然而，與自動調查生成相關的最新研究仍受到一些關鍵限制的約束，例如有限的上下文視窗、缺乏深入的內容討論以及系統評估架構的缺失。受到人類寫作過程的啟發，我們提出 SurveyX，這是一個用於自動調查生成的有效且有組織的系統，它將調查組成過程分解為兩個階段：準備和生成階段。透過創新地引入線上參考檢索、一種稱為 AttributeTree 的預處理方法和重新潤飾過程，SurveyX 大幅提升了調查組成的效能。實驗評估結果顯示，SurveyX 在內容品質（提升 0.259）和引用品質（提升 1.76）方面優於現有的自動調查生成系統，在多個評估面向中接近人類專家的表現。由 SurveyX 生成的調查範例可在 www.surveyx.cn 取得", "author": "Xun Liang et.al.", "authors": "Xun Liang, Jiawei Yang, Yezhaohui Wang, Chen Tang, Zifan Zheng, Simin Niu, Shichao Song, Hanyu Wang, Bo Tang, Feiyu Xiong, Keming Mao, Zhiyu li", "id": "2502.14776v1", "paper_url": "http://arxiv.org/abs/2502.14776v1", "repo": "null"}}