{"2408.08310": {"publish_time": "2024-08-15", "title": "ScalingFilter: Assessing Data Quality through Inverse Utilization of Scaling Laws", "paper_summary": "High-quality data is crucial for the pre-training performance of large\nlanguage models. Unfortunately, existing quality filtering methods rely on a\nknown high-quality dataset as reference, which can introduce potential bias and\ncompromise diversity. In this paper, we propose ScalingFilter, a novel approach\nthat evaluates text quality based on the perplexity difference between two\nlanguage models trained on the same data, thereby eliminating the influence of\nthe reference dataset in the filtering process. An theoretical analysis shows\nthat ScalingFilter is equivalent to an inverse utilization of scaling laws.\nThrough training models with 1.3B parameters on the same data source processed\nby various quality filters, we find ScalingFilter can improve zero-shot\nperformance of pre-trained models in downstream tasks. To assess the bias\nintroduced by quality filtering, we introduce semantic diversity, a metric of\nutilizing text embedding models for semantic representations. Extensive\nexperiments reveal that semantic diversity is a reliable indicator of dataset\ndiversity, and ScalingFilter achieves an optimal balance between downstream\nperformance and semantic diversity.", "paper_summary_zh": "高质量的数据对于大型语言模型的预训练性能至关重要。不幸的是，现有的质量过滤方法依赖于已知的高质量数据集作为参考，这可能会引入潜在的偏差并损害多样性。在本文中，我们提出了 ScalingFilter，这是一种新颖的方法，它根据在同一数据上训练的两个语言模型之间的困惑度差异来评估文本质量，从而消除了过滤过程中参考数据集的影响。理论分析表明，ScalingFilter 等效于对标度定律的反向利用。通过使用各种质量过滤器处理的相同数据源对具有 1.3B 参数的训练模型，我们发现 ScalingFilter 可以提高预训练模型在下游任务中的零样本性能。为了评估质量过滤引入的偏差，我们引入了语义多样性，这是一种利用文本嵌入模型进行语义表示的度量。大量的实验表明，语义多样性是数据集多样性的可靠指标，而 ScalingFilter 在下游性能和语义多样性之间实现了最佳平衡。", "author": "Ruihang Li et.al.", "authors": "Ruihang Li, Yixuan Wei, Miaosen Zhang, Nenghai Yu, Han Hu, Houwen Peng", "id": "2408.08310v1", "paper_url": "http://arxiv.org/abs/2408.08310v1", "repo": "null"}}