{"2410.21819": {"publish_time": "2024-10-29", "title": "Self-Preference Bias in LLM-as-a-Judge", "paper_summary": "Automated evaluation leveraging large language models (LLMs), commonly\nreferred to as LLM evaluators or LLM-as-a-judge, has been widely used in\nmeasuring the performance of dialogue systems. However, the self-preference\nbias in LLMs has posed significant risks, including promoting specific styles\nor policies intrinsic to the LLMs. Despite the importance of this issue, there\nis a lack of established methods to measure the self-preference bias\nquantitatively, and its underlying causes are poorly understood. In this paper,\nwe introduce a novel quantitative metric to measure the self-preference bias.\nOur experimental results demonstrate that GPT-4 exhibits a significant degree\nof self-preference bias. To explore the causes, we hypothesize that LLMs may\nfavor outputs that are more familiar to them, as indicated by lower perplexity.\nWe analyze the relationship between LLM evaluations and the perplexities of\noutputs. Our findings reveal that LLMs assign significantly higher evaluations\nto outputs with lower perplexity than human evaluators, regardless of whether\nthe outputs were self-generated. This suggests that the essence of the bias\nlies in perplexity and that the self-preference bias exists because LLMs prefer\ntexts more familiar to them.", "paper_summary_zh": "利用大型語言模型（LLM）進行自動評估（通常稱為 LLM 評估器或 LLM 作為評審），已廣泛用於衡量對話系統的效能。然而，LLM 中的自我偏好偏差會造成重大風險，包括宣傳 LLM 內在的特定風格或政策。儘管此問題非常重要，但缺乏用於定量衡量自我偏好偏差的既定方法，而且其根本原因鮮為人知。在本文中，我們提出了一種新穎的定量指標來衡量自我偏好偏差。我們的實驗結果證明，GPT-4 表現出顯著程度的自我偏好偏差。為了探討原因，我們假設 LLM 可能偏好對他們來說較熟悉的輸出，這由較低的困惑度所表示。我們分析了 LLM 評估與輸出困惑度之間的關係。我們的發現顯示，LLM 對困惑度較低的輸出給予的評分顯著高於人類評估者，無論輸出是否是由他們自己產生的。這表示偏差的本質在於困惑度，而且自我偏好偏差存在是因為 LLM 偏好對他們來說較熟悉的文字。", "author": "Koki Wataoka et.al.", "authors": "Koki Wataoka, Tsubasa Takahashi, Ryokan Ri", "id": "2410.21819v1", "paper_url": "http://arxiv.org/abs/2410.21819v1", "repo": "null"}}