{"2410.07025": {"publish_time": "2024-10-09", "title": "Preference Fine-Tuning for Factuality in Chest X-Ray Interpretation Models Without Human Feedback", "paper_summary": "Radiologists play a crucial role by translating medical images into medical\nreports. However, the field faces staffing shortages and increasing workloads.\nWhile automated approaches using vision-language models (VLMs) show promise as\nassistants, they require exceptionally high accuracy. Most current VLMs in\nradiology rely solely on supervised fine-tuning (SFT). Meanwhile, in the\ngeneral domain, additional preference fine-tuning has become standard practice.\nThe challenge in radiology lies in the prohibitive cost of obtaining\nradiologist feedback. We propose a scalable automated preference alignment\ntechnique for VLMs in radiology, focusing on chest X-ray (CXR) report\ngeneration. Our method leverages publicly available datasets with an\nLLM-as-a-Judge mechanism, eliminating the need for additional expert\nradiologist feedback. We evaluate and benchmark five direct alignment\nalgorithms (DAAs). Our results show up to a 57.4% improvement in average GREEN\nscores, a LLM-based metric for evaluating CXR reports, and a 9.2% increase in\nan average across six metrics (domain specific and general), compared to the\nSFT baseline. We study reward overoptimization via length exploitation, with\nreports lengthening by up to 3.2x. To assess a potential alignment tax, we\nbenchmark on six additional diverse tasks, finding no significant degradations.\nA reader study involving four board-certified radiologists indicates win rates\nof up to 0.62 over the SFT baseline, while significantly penalizing verbosity.\nOur analysis provides actionable insights for the development of VLMs in\nhigh-stakes fields like radiology.", "paper_summary_zh": "<paragraph>放射科醫師透過將醫學影像轉換成醫學報告扮演著至關重要的角色。然而，該領域面臨人手短缺和工作量增加的問題。雖然使用視覺語言模型 (VLM) 的自動化方法顯示出作為助理的潛力，但它們需要極高的準確度。放射科中大多數現有的 VLM 僅依賴監督微調 (SFT)。同時，在一般領域，額外的偏好微調已成為標準做法。放射科的挑戰在於取得放射科醫師回饋的成本過高。我們提出了一種可擴充的自動化偏好對齊技術，用於放射科的 VLM，專注於胸部 X 光 (CXR) 報告生成。我們的技術利用具備 LLM 作為評審機制的公開可用資料集，消除了需要額外專家放射科醫師回饋的必要性。我們評估和比較了五種直接對齊演算法 (DAA)。我們的結果顯示，平均 GREEN 分數（用於評估 CXR 報告的基於 LLM 的指標）提高了 57.4%，與 SFT 基準相比，六項指標（特定領域和一般）的平均值增加了 9.2%。我們透過長度利用研究獎勵過度最佳化，報告長度最多增加了 3.2 倍。為了評估潛在對齊稅，我們在六項額外的不同任務中進行基準測試，發現沒有顯著的降低。一項涉及四位通過認證的放射科醫師的讀者研究指出，與 SFT 基準相比，獲勝率最高可達 0.62，同時顯著懲罰冗長。我們的分析為放射科等高風險領域的 VLM 開發提供了可行的見解。</paragraph>", "author": "Dennis Hein et.al.", "authors": "Dennis Hein, Zhihong Chen, Sophie Ostmeier, Justin Xu, Maya Varma, Eduardo Pontes Reis, Arne Edward Michalson, Christian Bluethgen, Hyun Joo Shin, Curtis Langlotz, Akshay S Chaudhari", "id": "2410.07025v1", "paper_url": "http://arxiv.org/abs/2410.07025v1", "repo": "null"}}