{"2409.19058": {"publish_time": "2024-09-27", "title": "CLLMate: A Multimodal LLM for Weather and Climate Events Forecasting", "paper_summary": "Forecasting weather and climate events is crucial for making appropriate\nmeasures to mitigate environmental hazards and minimize associated losses.\nPrevious research on environmental forecasting focuses on predicting numerical\nmeteorological variables related to closed-set events rather than forecasting\nopen-set events directly, which limits the comprehensiveness of event\nforecasting. We propose Weather and Climate Event Forecasting (WCEF), a new\ntask that leverages meteorological raster data and textual event data to\npredict potential weather and climate events. However, due to difficulties in\naligning multimodal data and the lack of sufficient supervised datasets, this\ntask is challenging to accomplish. Therefore, we first propose a framework to\nalign historical meteorological data with past weather and climate events using\nthe large language model (LLM). In this framework, we construct a knowledge\ngraph by using LLM to extract information about weather and climate events from\na corpus of over 41k highly environment-focused news articles. Subsequently, we\nmapped these events with meteorological raster data, creating a supervised\ndataset, which is the largest and most novel for LLM tuning on the WCEF task.\nFinally, we introduced our aligned models, CLLMate (LLM for climate), a\nmultimodal LLM to forecast weather and climate events using meteorological\nraster data. In evaluating CLLMate, we conducted extensive experiments. The\nresults indicate that CLLMate surpasses both the baselines and other multimodal\nLLMs, showcasing the potential of utilizing LLM to align weather and climate\nevents with meteorological data and highlighting the promising future for\nresearch on the WCEF task.", "paper_summary_zh": "預測天氣和氣候事件對於採取適當措施減輕環境危害和將相關損失降至最低至關重要。\n先前有關環境預測的研究著重於預測與封閉集事件相關的數值氣象變數，而非直接預測開放集事件，這限制了事件預測的全面性。\n我們提出天氣和氣候事件預測 (WCEF)，這是一項利用氣象柵格資料和文字事件資料來預測潛在天氣和氣候事件的新任務。\n然而，由於多模態資料對齊的困難以及缺乏足夠的監督式資料集，因此此任務難以達成。\n因此，我們首先提出一個架構，使用大型語言模型 (LLM) 將歷史氣象資料與過去的天氣和氣候事件對齊。\n在此架構中，我們透過使用 LLM 從超過 41,000 篇高度關注環境的新聞文章中擷取有關天氣和氣候事件的資訊來建構知識圖譜。\n隨後，我們將這些事件對應到氣象柵格資料，建立一個監督式資料集，這是 LLM 在 WCEF 任務上調整中最大且最新穎的資料集。\n最後，我們引入了我們的對齊模型，CLLMate（氣候的 LLM），這是一個多模態 LLM，使用氣象柵格資料來預測天氣和氣候事件。\n在評估 CLLMate 時，我們進行了大量的實驗。\n結果表明，CLLMate 超越了基準和其他的多模態 LLM，展示了利用 LLM 將天氣和氣候事件與氣象資料對齊的潛力，並強調了 WCEF 任務研究的未來前景。", "author": "Haobo Li et.al.", "authors": "Haobo Li, Zhaowei Wang, Jiachen Wang, Alexis Kai Hon Lau, Huamin Qu", "id": "2409.19058v1", "paper_url": "http://arxiv.org/abs/2409.19058v1", "repo": "null"}}