{"2411.03742": {"publish_time": "2024-11-06", "title": "Adaptive Consensus Gradients Aggregation for Scaled Distributed Training", "paper_summary": "Distributed machine learning has recently become a critical paradigm for\ntraining large models on vast datasets. We examine the stochastic optimization\nproblem for deep learning within synchronous parallel computing environments\nunder communication constraints. While averaging distributed gradients is the\nmost widely used method for gradient estimation, whether this is the optimal\nstrategy remains an open question. In this work, we analyze the distributed\ngradient aggregation process through the lens of subspace optimization. By\nformulating the aggregation problem as an objective-aware subspace optimization\nproblem, we derive an efficient weighting scheme for gradients, guided by\nsubspace coefficients. We further introduce subspace momentum to accelerate\nconvergence while maintaining statistical unbiasedness in the aggregation. Our\nmethod demonstrates improved performance over the ubiquitous gradient averaging\non multiple MLPerf tasks while remaining extremely efficient in both\ncommunicational and computational complexity.", "paper_summary_zh": "分布式機器學習最近已成為在龐大資料集上訓練大型模型的重要範例。我們在通訊約束下，探討同步並行運算環境中深度學習的隨機最佳化問題。雖然平均分佈式梯度是梯度估計最廣泛使用的方法，但這是否是最佳策略仍是一個開放性的問題。在這項工作中，我們透過子空間最佳化的角度分析分佈式梯度聚合過程。透過將聚合問題制定為目標感知子空間最佳化問題，我們導出一個有效的梯度加權機制，由子空間係數引導。我們進一步引入子空間動量來加速收斂，同時在聚合中維持統計無偏性。我們的模型在多個 MLPerf 任務上展現出優於普遍梯度平均的效能，同時在通訊和運算複雜度方面保持極高的效率。", "author": "Yoni Choukroun et.al.", "authors": "Yoni Choukroun, Shlomi Azoulay, Pavel Kisilev", "id": "2411.03742v1", "paper_url": "http://arxiv.org/abs/2411.03742v1", "repo": "null"}}