{"2405.18731": {"publish_time": "2024-05-29", "title": "VBIM-Net: Variational Born Iterative Network for Inverse Scattering Problems", "paper_summary": "Recently, studies have shown the potential of integrating field-type\niterative methods with deep learning (DL) techniques in solving inverse\nscattering problems (ISPs). In this article, we propose a novel Variational\nBorn Iterative Network, namely, VBIM-Net, to solve the full-wave ISPs with\nsignificantly improved flexibility and inversion quality. The proposed VBIM-Net\nemulates the alternating updates of the total electric field and the contrast\nin the variational Born iterative method (VBIM) by multiple layers of\nsubnetworks. We embed the calculation of the contrast variation into each of\nthe subnetworks, converting the scattered field residual into an approximate\ncontrast variation and then enhancing it by a U-Net, thus avoiding the\nrequirement of matched measurement dimension and grid resolution as in existing\napproaches. The total field and contrast of each layer's output is supervised\nin the loss function of VBIM-Net, which guarantees the physical\ninterpretability of variables of the subnetworks. In addition, we design a\ntraining scheme with extra noise to enhance the model's stability. Extensive\nnumerical results on synthetic and experimental data both verify the inversion\nquality, generalization ability, and robustness of the proposed VBIM-Net. This\nwork may provide some new inspiration for the design of efficient field-type DL\nschemes.", "paper_summary_zh": "<paragraph>最近的研究表明，將場類型迭代方法與深度學習 (DL) 技術整合，在解決逆散射問題 (ISP) 方面具有潛力。在本文中，我們提出了一種新穎的變分 Born 迭代網路，即 VBIM-Net，以解決全波 ISP，大幅提升靈活性與反演品質。所提出的 VBIM-Net 模擬變分 Born 迭代方法 (VBIM) 中總電場與對比度的交替更新，透過多層子網路。我們將對比度變化的計算嵌入每個子網路中，將散射場殘差轉換為近似的對比度變化，然後透過 U-Net 強化，因此避免了現有方法中匹配量測維度與網格解析度的需求。在 VBIM-Net 的損失函數中監督每一層輸出的總場與對比度，這保證了子網路變數的物理可解釋性。此外，我們設計了一個訓練方案，其中包含額外的雜訊，以增強模型的穩定性。在合成資料與實驗資料上的廣泛數值結果驗證了所提出的 VBIM-Net 的反演品質、泛化能力與穩健性。這項工作可能為高效場類型 DL 架構的設計提供一些新的靈感。</paragraph>", "author": "Ziqing Xing et.al.", "authors": "Ziqing Xing, Zhaoyang Zhang, Zirui Chen, Yusong Wang, Haoran Ma, Zhun Wei, Gang Bao", "id": "2405.18731v1", "paper_url": "http://arxiv.org/abs/2405.18731v1", "repo": "null"}}