{"2410.21791": {"publish_time": "2024-10-29", "title": "Enhancing Adversarial Attacks through Chain of Thought", "paper_summary": "Large language models (LLMs) have demonstrated impressive performance across\nvarious domains but remain susceptible to safety concerns. Prior research\nindicates that gradient-based adversarial attacks are particularly effective\nagainst aligned LLMs and the chain of thought (CoT) prompting can elicit\ndesired answers through step-by-step reasoning. This paper proposes enhancing\nthe robustness of adversarial attacks on aligned LLMs by integrating CoT\nprompts with the greedy coordinate gradient (GCG) technique. Using CoT triggers\ninstead of affirmative targets stimulates the reasoning abilities of backend\nLLMs, thereby improving the transferability and universality of adversarial\nattacks. We conducted an ablation study comparing our CoT-GCG approach with\nAmazon Web Services auto-cot. Results revealed our approach outperformed both\nthe baseline GCG attack and CoT prompting. Additionally, we used Llama Guard to\nevaluate potentially harmful interactions, providing a more objective risk\nassessment of entire conversations compared to matching outputs to rejection\nphrases. The code of this paper is available at\nhttps://github.com/sujingbo0217/CS222W24-LLM-Attack.", "paper_summary_zh": "大型語言模型 (LLM) 已在各個領域展現出令人印象深刻的效能，但仍容易受到安全問題的影響。先前的研究表明，基於梯度的對抗攻擊對經過校準的 LLM 特別有效，而思考鏈 (CoT) 提示可以透過逐步推理引出所需的答案。本文提出透過將 CoT 提示與貪婪座標梯度 (GCG) 技術整合，來加強經過校準的 LLM 對抗攻擊的穩健性。使用 CoT 觸發器，而不是肯定目標，會刺激後端 LLM 的推理能力，從而改善對抗攻擊的可傳輸性和通用性。我們進行了一項消融研究，將我們的 CoT-GCG 方法與 Amazon Web Services auto-cot 進行比較。結果顯示，我們的做法優於基準 GCG 攻擊和 CoT 提示。此外，我們使用 Llama Guard 來評估潛在有害的互動，與將輸出與拒絕短語進行比對相比，這提供了對整個對話的更客觀風險評估。本文的程式碼可在 https://github.com/sujingbo0217/CS222W24-LLM-Attack 取得。", "author": "Jingbo Su et.al.", "authors": "Jingbo Su", "id": "2410.21791v1", "paper_url": "http://arxiv.org/abs/2410.21791v1", "repo": "https://github.com/sujingbo0217/cs222w24-llm-attack"}}