{"2502.14583": {"publish_time": "2025-02-20", "title": "A Theory for Conditional Generative Modeling on Multiple Data Sources", "paper_summary": "The success of large generative models has driven a paradigm shift,\nleveraging massive multi-source data to enhance model capabilities. However,\nthe interaction among these sources remains theoretically underexplored. This\npaper takes the first step toward a rigorous analysis of multi-source training\nin conditional generative modeling, where each condition represents a distinct\ndata source. Specifically, we establish a general distribution estimation error\nbound in average total variation distance for conditional maximum likelihood\nestimation based on the bracketing number. Our result shows that when source\ndistributions share certain similarities and the model is expressive enough,\nmulti-source training guarantees a sharper bound than single-source training.\nWe further instantiate the general theory on conditional Gaussian estimation\nand deep generative models including autoregressive and flexible energy-based\nmodels, by characterizing their bracketing numbers. The results highlight that\nthe number of sources and similarity among source distributions improve the\nadvantage of multi-source training. Simulations and real-world experiments\nvalidate our theory. Code is available at:\n\\url{https://github.com/ML-GSAI/Multi-Source-GM}.", "paper_summary_zh": "大型生成模型的成功推動了範例轉移，利用大量多來源資料來增強模型功能。然而，這些來源之間的互動在理論上仍未得到充分探討。本文踏出了嚴謹分析條件生成模型中多來源訓練的第一步，其中每個條件代表一個不同的資料來源。具體來說，我們建立了一個基於括號數的條件最大似然估計的平均總變異距離中的通用分佈估計誤差界限。我們的結果表明，當來源分佈具有一定的相似性且模型具有足夠的表達力時，多來源訓練保證了比單來源訓練更嚴格的界限。我們進一步在條件高斯估計和深度生成模型（包括自迴歸和靈活的基於能量的模型）上例證了通用理論，通過表徵它們的括號數。結果強調了來源數和來源分佈之間的相似性提高了多來源訓練的優勢。模擬和真實世界的實驗驗證了我們的理論。程式碼可在以下網址取得：\\url{https://github.com/ML-GSAI/Multi-Source-GM}。", "author": "Rongzhen Wang et.al.", "authors": "Rongzhen Wang, Yan Zhang, Chenyu Zheng, Chongxuan Li, Guoqiang Wu", "id": "2502.14583v1", "paper_url": "http://arxiv.org/abs/2502.14583v1", "repo": "null"}}