{"2405.14398": {"publish_time": "2024-05-23", "title": "SpGesture: Source-Free Domain-adaptive sEMG-based Gesture Recognition with Jaccard Attentive Spiking Neural Network", "paper_summary": "Surface electromyography (sEMG) based gesture recognition offers a natural\nand intuitive interaction modality for wearable devices. Despite significant\nadvancements in sEMG-based gesture-recognition models, existing methods often\nsuffer from high computational latency and increased energy consumption.\nAdditionally, the inherent instability of sEMG signals, combined with their\nsensitivity to distribution shifts in real-world settings, compromises model\nrobustness.\n  To tackle these challenges, we propose a novel SpGesture framework based on\nSpiking Neural Networks, which possesses several unique merits compared with\nexisting methods: (1) Robustness: By utilizing membrane potential as a memory\nlist, we pioneer the introduction of Source-Free Domain Adaptation into SNN for\nthe first time. This enables SpGesture to mitigate the accuracy degradation\ncaused by distribution shifts. (2) High Accuracy: With a novel Spiking Jaccard\nAttention, SpGesture enhances the SNNs' ability to represent sEMG features,\nleading to a notable rise in system accuracy. To validate SpGesture's\nperformance, we collected a new sEMG gesture dataset which has different\nforearm postures, where SpGesture achieved the highest accuracy among the\nbaselines ($89.26\\%$). Moreover, the actual deployment on the CPU demonstrated\na system latency below 100ms, well within real-time requirements. This\nimpressive performance showcases SpGesture's potential to enhance the\napplicability of sEMG in real-world scenarios. The code is available at\nhttps://anonymous.4open.science/r/SpGesture.", "paper_summary_zh": "表面肌電圖 (sEMG) 手勢辨識為穿戴式裝置提供了自然且直覺的互動方式。儘管 sEMG 手勢辨識模型有顯著的進展，現有的方法通常會遇到高運算延遲和增加的能源消耗。此外，sEMG 訊號內在的不穩定性，加上它們對真實環境中分佈轉移的敏感性，損害了模型的穩健性。\n為了應對這些挑戰，我們提出了一個基於尖峰神經網路的創新 SpGesture 架構，與現有方法相比，它具備幾個獨特的優點：(1) 穩健性：透過利用膜電位作為記憶清單，我們率先將無來源域適應引入 SNN。這使 SpGesture 能夠減輕由分佈轉移造成的準確度下降。(2) 高準確度：透過創新的尖峰 Jaccard 注意力，SpGesture 增強了 SNN 表示 sEMG 特徵的能力，導致系統準確度顯著提升。為了驗證 SpGesture 的效能，我們收集了一個新的 sEMG 手勢資料集，其中有不同的前臂姿勢，SpGesture 在基線中獲得最高的準確度 ($89.26\\%$)。此外，在 CPU 上的實際部署證明系統延遲低於 100ms，遠低於即時需求。這種令人印象深刻的效能展示了 SpGesture 在現實場景中增強 sEMG 適用性的潛力。程式碼可在 https://anonymous.4open.science/r/SpGesture 取得。", "author": "Weiyu Guo et.al.", "authors": "Weiyu Guo, Ying Sun, Yijie Xu, Ziyue Qiao, Yongkui Yang, Hui Xiong", "id": "2405.14398v1", "paper_url": "http://arxiv.org/abs/2405.14398v1", "repo": "null"}}