{"2407.06023": {"publish_time": "2024-07-08", "title": "Distilling System 2 into System 1", "paper_summary": "Large language models (LLMs) can spend extra compute during inference to\ngenerate intermediate thoughts, which helps to produce better final responses.\nSince Chain-of-Thought (Wei et al., 2022), many such System 2 techniques have\nbeen proposed such as Rephrase and Respond (Deng et al., 2023a), System 2\nAttention (Weston and Sukhbaatar, 2023) and Branch-Solve-Merge (Saha et al.,\n2023). In this work we investigate self-supervised methods to ``compile''\n(distill) higher quality outputs from System 2 techniques back into LLM\ngenerations without intermediate reasoning token sequences, as this reasoning\nhas been distilled into System 1. We show that several such techniques can be\nsuccessfully distilled, resulting in improved results compared to the original\nSystem 1 performance, and with less inference cost than System 2. We posit that\nsuch System 2 distillation will be an important feature of future continually\nlearning AI systems, enabling them to focus System 2 capabilities on the\nreasoning tasks that they cannot yet do well.", "paper_summary_zh": "大型語言模型 (LLM) 可在推理過程中花費額外的運算來產生中間想法，這有助於產生更好的最終回應。自從有了思想鏈 (Wei 等人，2022 年) 以來，許多此類系統 2 技術已被提出，例如改述和回應 (Deng 等人，2023a)、系統 2 注意力 (Weston 和 Sukhbaatar，2023 年) 和分支求解合併 (Saha 等人，2023 年)。在這項工作中，我們研究了自監督方法，用於「編譯」(提煉) 來自系統 2 技術的高品質輸出，並將其返回 LLM 生成，而無需中間推理標記序列，因為這種推理已提煉到系統 1 中。我們展示了幾種此類技術可以成功地進行提煉，與原始系統 1 性能相比，改進了結果，而且推理成本低於系統 2。我們認為，這種系統 2 提煉將成為未來持續學習 AI 系統的一項重要功能，使它們能夠將系統 2 能力集中於它們目前還無法很好執行的推理任務上。", "author": "Ping Yu et.al.", "authors": "Ping Yu, Jing Xu, Jason Weston, Ilia Kulikov", "id": "2407.06023v1", "paper_url": "http://arxiv.org/abs/2407.06023v1", "repo": "null"}}