{"2406.04127": {"publish_time": "2024-06-06", "title": "Are We Done with MMLU?", "paper_summary": "Maybe not. We identify and analyse errors in the popular Massive Multitask\nLanguage Understanding (MMLU) benchmark. Even though MMLU is widely adopted,\nour analysis demonstrates numerous ground truth errors that obscure the true\ncapabilities of LLMs. For example, we find that 57% of the analysed questions\nin the Virology subset contain errors. To address this issue, we introduce a\ncomprehensive framework for identifying dataset errors using a novel error\ntaxonomy. Then, we create MMLU-Redux, which is a subset of 3,000 manually\nre-annotated questions across 30 MMLU subjects. Using MMLU-Redux, we\ndemonstrate significant discrepancies with the model performance metrics that\nwere originally reported. Our results strongly advocate for revising MMLU's\nerror-ridden questions to enhance its future utility and reliability as a\nbenchmark. Therefore, we open up MMLU-Redux for additional annotation\nhttps://huggingface.co/datasets/edinburgh-dawg/mmlu-redux.", "paper_summary_zh": "也許不是。我們識別和分析了流行的大規模多任務語言理解 (MMLU) 基準中的錯誤。儘管 MMLU 被廣泛採用，但我們的分析證明了許多掩蓋了 LLM 真正能力的真實錯誤。例如，我們發現病毒學子集中 57% 的分析問題包含錯誤。為了解決這個問題，我們引入了一個使用新錯誤分類法識別資料集錯誤的綜合框架。然後，我們建立了 MMLU-Redux，它是 30 個 MMLU 主題中 3,000 個手動重新註釋問題的子集。使用 MMLU-Redux，我們展示了與最初報告的模型效能指標有顯著差異。我們的結果強烈主張修改 MMLU 充滿錯誤的問題，以增強其作為基準的未來效用和可靠性。因此，我們開放 MMLU-Redux 以進行額外註釋 https://huggingface.co/datasets/edinburgh-dawg/mmlu-redux。", "author": "Aryo Pradipta Gema et.al.", "authors": "Aryo Pradipta Gema, Joshua Ong Jun Leang, Giwon Hong, Alessio Devoto, Alberto Carlo Maria Mancino, Rohit Saxena, Xuanli He, Yu Zhao, Xiaotang Du, Mohammad Reza Ghasemi Madani, Claire Barale, Robert McHardy, Joshua Harris, Jean Kaddour, Emile van Krieken, Pasquale Minervini", "id": "2406.04127v2", "paper_url": "http://arxiv.org/abs/2406.04127v2", "repo": "null"}}