{"2412.10011": {"publish_time": "2024-12-13", "title": "Enhanced Speech Emotion Recognition with Efficient Channel Attention Guided Deep CNN-BiLSTM Framework", "paper_summary": "Speech emotion recognition (SER) is crucial for enhancing affective computing\nand enriching the domain of human-computer interaction. However, the main\nchallenge in SER lies in selecting relevant feature representations from speech\nsignals with lower computational costs. In this paper, we propose a lightweight\nSER architecture that integrates attention-based local feature blocks (ALFBs)\nto capture high-level relevant feature vectors from speech signals. We also\nincorporate a global feature block (GFB) technique to capture sequential,\nglobal information and long-term dependencies in speech signals. By aggregating\nattention-based local and global contextual feature vectors, our model\neffectively captures the internal correlation between salient features that\nreflect complex human emotional cues. To evaluate our approach, we extracted\nfour types of spectral features from speech audio samples: mel-frequency\ncepstral coefficients, mel-spectrogram, root mean square value, and\nzero-crossing rate. Through a 5-fold cross-validation strategy, we tested the\nproposed method on five multi-lingual standard benchmark datasets: TESS,\nRAVDESS, BanglaSER, SUBESCO, and Emo-DB, and obtained a mean accuracy of\n99.65%, 94.88%, 98.12%, 97.94%, and 97.19% respectively. The results indicate\nthat our model achieves state-of-the-art (SOTA) performance compared to most\nexisting methods.", "paper_summary_zh": "語音情緒辨識 (SER) 對於加強情感運算和豐富人機互動領域至關重要。然而，SER 的主要挑戰在於以較低的運算成本從語音訊號中選擇相關特徵表徵。在本文中，我們提出了一種輕量級 SER 架構，它整合了基於注意力的局部特徵區塊 (ALFB) 以從語音訊號中擷取高層級相關特徵向量。我們還結合了全局特徵區塊 (GFB) 技術，以擷取語音訊號中的順序、全局資訊和長期依賴性。透過彙總基於注意力的局部和全局脈絡特徵向量，我們的模型有效地擷取了反映複雜人類情緒線索的顯著特徵之間的內部關聯性。為了評估我們的作法，我們從語音音訊範例中萃取了四種類型的頻譜特徵：梅爾頻率倒頻率譜係數、梅爾頻譜圖、均方根值和零交越率。透過 5 倍交叉驗證策略，我們在五個多語言標準基準資料集：TESS、RAVDESS、BanglaSER、SUBESCO 和 Emo-DB 上測試了所提出的方法，並分別獲得了 99.65%、94.88%、98.12%、97.94% 和 97.19% 的平均準確度。結果表明，與大多數現有方法相比，我們的模型達到了最先進 (SOTA) 的效能。", "author": "Niloy Kumar Kundu et.al.", "authors": "Niloy Kumar Kundu, Sarah Kobir, Md. Rayhan Ahmed, Tahmina Aktar, Niloya Roy", "id": "2412.10011v1", "paper_url": "http://arxiv.org/abs/2412.10011v1", "repo": "null"}}