{"2501.05147": {"publish_time": "2025-01-09", "title": "A Systematic Literature Review on Deep Learning-based Depth Estimation in Computer Vision", "paper_summary": "Depth estimation (DE) provides spatial information about a scene and enables\ntasks such as 3D reconstruction, object detection, and scene understanding.\nRecently, there has been an increasing interest in using deep learning\n(DL)-based methods for DE. Traditional techniques rely on handcrafted features\nthat often struggle to generalise to diverse scenes and require extensive\nmanual tuning. However, DL models for DE can automatically extract relevant\nfeatures from input data, adapt to various scene conditions, and generalise\nwell to unseen environments. Numerous DL-based methods have been developed,\nmaking it necessary to survey and synthesize the state-of-the-art (SOTA).\nPrevious reviews on DE have mainly focused on either monocular or stereo-based\ntechniques, rather than comprehensively reviewing DE. Furthermore, to the best\nof our knowledge, there is no systematic literature review (SLR) that\ncomprehensively focuses on DE. Therefore, this SLR study is being conducted.\nInitially, electronic databases were searched for relevant publications,\nresulting in 1284 publications. Using defined exclusion and quality criteria,\n128 publications were shortlisted and further filtered to select 59\nhigh-quality primary studies. These studies were analysed to extract data and\nanswer defined research questions. Based on the results, DL methods were\ndeveloped for mainly three different types of DE: monocular, stereo, and\nmulti-view. 20 publicly available datasets were used to train, test, and\nevaluate DL models for DE, with KITTI, NYU Depth V2, and Make 3D being the most\nused datasets. 29 evaluation metrics were used to assess the performance of DE.\n35 base models were reported in the primary studies, and the top five most-used\nbase models were ResNet-50, ResNet-18, ResNet-101, U-Net, and VGG-16. Finally,\nthe lack of ground truth data was among the most significant challenges\nreported by primary studies.", "paper_summary_zh": "深度估計 (DE) 提供場景的空間資訊，並能執行 3D 重建、物體偵測和場景理解等任務。最近，使用深度學習 (DL) 的方法進行 DE 逐漸受到重視。傳統技術仰賴手工特徵，而這些特徵通常難以推廣到不同的場景，並且需要廣泛的手動調整。然而，DE 的 DL 模型可以自動從輸入資料中萃取相關特徵、適應各種場景條件，並能推廣到未知的環境。已經開發出許多基於 DL 的方法，因此有必要調查和綜合現有技術 (SOTA)。先前關於 DE 的回顧主要專注於單眼或立體技術，而不是全面回顧 DE。此外，據我們所知，沒有系統性的文獻回顧 (SLR) 全面關注 DE。因此，正在進行這項 SLR 研究。最初，在電子資料庫中搜尋相關出版品，共得到 1284 篇出版品。使用定義的排除和品質標準，將 128 篇出版品列入候選名單，並進一步篩選出 59 項高品質的主要研究。分析這些研究以萃取資料並回答定義的研究問題。根據結果，DL 方法主要針對三種類型的 DE 進行開發：單眼、立體和多視圖。20 個公開可用的資料集用於訓練、測試和評估 DE 的 DL 模型，其中 KITTI、NYU Depth V2 和 Make 3D 是最常用的資料集。29 個評估指標用於評估 DE 的效能。35 個基礎模型在主要研究中被報導，前五個最常使用的基礎模型是 ResNet-50、ResNet-18、ResNet-101、U-Net 和 VGG-16。最後，主要研究報告的重大挑戰之一是缺乏真實資料。", "author": "Ali Rohan et.al.", "authors": "Ali Rohan, Md Junayed Hasan, Andrei Petrovski", "id": "2501.05147v1", "paper_url": "http://arxiv.org/abs/2501.05147v1", "repo": "null"}}