{"2408.08650": {"publish_time": "2024-08-16", "title": "An End-to-End Model for Photo-Sharing Multi-modal Dialogue Generation", "paper_summary": "Photo-Sharing Multi-modal dialogue generation requires a dialogue agent not\nonly to generate text responses but also to share photos at the proper moment.\nUsing image text caption as the bridge, a pipeline model integrates an image\ncaption model, a text generation model, and an image generation model to handle\nthis complex multi-modal task. However, representing the images with text\ncaptions may loss important visual details and information and cause error\npropagation in the complex dialogue system. Besides, the pipeline model\nisolates the three models separately because discrete image text captions\nhinder end-to-end gradient propagation. We propose the first end-to-end model\nfor photo-sharing multi-modal dialogue generation, which integrates an image\nperceptron and an image generator with a large language model. The large\nlanguage model employs the Q-Former to perceive visual images in the input end.\nFor image generation in the output end, we propose a dynamic vocabulary\ntransformation matrix and use straight-through and gumbel-softmax techniques to\nalign the large language model and stable diffusion model and achieve\nend-to-end gradient propagation. We perform experiments on PhotoChat and\nDialogCC datasets to evaluate our end-to-end model. Compared with pipeline\nmodels, the end-to-end model gains state-of-the-art performances on various\nmetrics of text and image generation. More analysis experiments also verify the\neffectiveness of the end-to-end model for photo-sharing multi-modal dialogue\ngeneration.", "paper_summary_zh": "照片分享多模态对话生成需要一个对话代理，不仅要生成文本响应，还要在适当的时刻分享照片。使用图像文本标题作为桥梁，管道模型集成了一个图像标题模型、一个文本生成模型和一个图像生成模型来处理这个复杂的多模态任务。然而，用文本标题表示图像可能会丢失重要的视觉细节和信息，并导致复杂对话系统中的错误传播。此外，管道模型将这三个模型分别隔离，因为离散图像文本标题阻碍了端到端的梯度传播。我们提出了第一个用于照片分享多模态对话生成的端到端模型，它将图像感知器和图像生成器与大型语言模型集成在一起。大型语言模型采用 Q-Former 在输入端感知视觉图像。对于输出端的图像生成，我们提出了一个动态词汇转换矩阵，并使用直通和 gumbel-softmax 技术来对齐大型语言模型和稳定扩散模型，并实现端到端的梯度传播。我们在 PhotoChat 和 DialogCC 数据集上执行实验，以评估我们的端到端模型。与管道模型相比，端到端模型在文本和图像生成的不同指标上获得了最先进的性能。更多的分析实验也验证了端到端模型在照片分享多模态对话生成中的有效性。", "author": "Peiming Guo et.al.", "authors": "Peiming Guo, Sinuo Liu, Yanzhao Zhang, Dingkun Long, Pengjun Xie, Meishan Zhang, Min Zhang", "id": "2408.08650v1", "paper_url": "http://arxiv.org/abs/2408.08650v1", "repo": "null"}}