{"2412.08063": {"publish_time": "2024-12-11", "title": "ContextModule: Improving Code Completion via Repository-level Contextual Information", "paper_summary": "Large Language Models (LLMs) have demonstrated impressive capabilities in\ncode completion tasks, where they assist developers by predicting and\ngenerating new code in real-time. However, existing LLM-based code completion\nsystems primarily rely on the immediate context of the file being edited, often\nmissing valuable repository-level information, user behaviour and edit history\nthat could improve suggestion accuracy. Additionally, challenges such as\nefficiently retrieving relevant code snippets from large repositories,\nincorporating user behavior, and balancing accuracy with low-latency\nrequirements in production environments remain unresolved. In this paper, we\npropose ContextModule, a framework designed to enhance LLM-based code\ncompletion by retrieving and integrating three types of contextual information\nfrom the repository: user behavior-based code, similar code snippets, and\ncritical symbol definitions. By capturing user interactions across files and\nleveraging repository-wide static analysis, ContextModule improves the\nrelevance and precision of generated code. We implement performance\noptimizations, such as index caching, to ensure the system meets the latency\nconstraints of real-world coding environments. Experimental results and\nindustrial practise demonstrate that ContextModule significantly improves code\ncompletion accuracy and user acceptance rates.", "paper_summary_zh": "大型語言模型 (LLM) 已在代碼完成任務中展現出令人印象深刻的能力，它們能協助開發人員即時預測和產生新代碼。然而，現有的 LLM 基於代碼完成系統主要依賴於正在編輯檔案的即時內容，通常會遺漏有價值的儲存庫層級資訊、使用者行為和編輯記錄，而這些資訊可以提升建議的準確度。此外，在生產環境中有效率地從大型儲存庫擷取相關程式碼片段、納入使用者行為，以及平衡準確度與低延遲需求等挑戰仍然未獲解決。在本文中，我們提出 ContextModule，一個旨在透過從儲存庫擷取和整合三種類型的內容資訊來增強 LLM 基於代碼完成的架構：基於使用者行為的代碼、類似的程式碼片段和關鍵符號定義。透過擷取跨檔案的使用者互動並利用儲存庫範圍的靜態分析，ContextModule 提升了所產生代碼的相關性和精確度。我們實作效能最佳化，例如索引快取，以確保系統符合真實世界編碼環境的延遲限制。實驗結果和產業實務證明，ContextModule 大幅提升了代碼完成的準確度和使用者接受率。", "author": "Zhanming Guan et.al.", "authors": "Zhanming Guan, Junlin Liu, Jierui Liu, Chao Peng, Dexin Liu, Ningyuan Sun, Bo Jiang, Wenchao Li, Jie Liu, Hang Zhu", "id": "2412.08063v1", "paper_url": "http://arxiv.org/abs/2412.08063v1", "repo": "null"}}