{"2501.13725": {"publish_time": "2025-01-23", "title": "You Only Crash Once v2: Perceptually Consistent Strong Features for One-Stage Domain Adaptive Detection of Space Terrain", "paper_summary": "The in-situ detection of planetary, lunar, and small-body surface terrain is\ncrucial for autonomous spacecraft applications, where learning-based computer\nvision methods are increasingly employed to enable intelligence without prior\ninformation or human intervention. However, many of these methods remain\ncomputationally expensive for spacecraft processors and prevent real-time\noperation. Training of such algorithms is additionally complex due to the\nscarcity of labeled data and reliance on supervised learning approaches.\nUnsupervised Domain Adaptation (UDA) offers a promising solution by\nfacilitating model training with disparate data sources such as simulations or\nsynthetic scenes, although UDA is difficult to apply to celestial environments\nwhere challenging feature spaces are paramount. To alleviate such issues, You\nOnly Crash Once (YOCOv1) has studied the integration of Visual Similarity-based\nAlignment (VSA) into lightweight one-stage object detection architectures to\nimprove space terrain UDA. Although proven effective, the approach faces\nnotable limitations, including performance degradations in multi-class and\nhigh-altitude scenarios. Building upon the foundation of YOCOv1, we propose\nnovel additions to the VSA scheme that enhance terrain detection capabilities\nunder UDA, and our approach is evaluated across both simulated and real-world\ndata. Our second YOCO rendition, YOCOv2, is capable of achieving\nstate-of-the-art UDA performance on surface terrain detection, where we\nshowcase improvements upwards of 31% compared with YOCOv1 and terrestrial\nstate-of-the-art. We demonstrate the practical utility of YOCOv2 with\nspacecraft flight hardware performance benchmarking and qualitative evaluation\nof NASA mission data.", "paper_summary_zh": "行星、月球和小天體表面地形的原位探測對於自主太空船應用至關重要，其中基於學習的電腦視覺方法正日益廣泛地用於在沒有先驗資訊或人工干預的情況下實現智慧。然而，其中許多方法對於太空船處理器而言仍然計算成本高昂，且無法進行即時操作。由於標記資料的稀缺性和對監督式學習方法的依賴性，此類演算法的訓練也更加複雜。非監督域適應 (UDA) 提供了一個有前景的解決方案，它促進了使用不同資料來源（例如模擬或合成場景）進行模型訓練，儘管 UDA 難以應用於以具有挑戰性的特徵空間為主的星體環境。為了緩解此類問題，您只崩潰一次 (YOCOv1) 研究了將基於視覺相似性的對齊 (VSA) 整合到輕量級一階段物件偵測架構中，以改善太空地形 UDA。儘管被證明有效，但該方法面臨顯著的限制，包括在多類和高海拔場景中的效能下降。在 YOCOv1 的基礎上，我們提出對 VSA 方案的新增功能，以增強 UDA 下的地形偵測能力，並且我們的做法已在模擬和真實世界資料中進行評估。我們的第二個 YOCO 版本 YOCOv2 能夠在表面地形偵測上實現最先進的 UDA 效能，與 YOCOv1 和陸地最先進技術相比，我們展示了高達 31% 的進步。我們透過太空船飛行硬體效能基準測試和 NASA 任務資料的定性評估，展示了 YOCOv2 的實用性。", "author": "Timothy Chase Jr et.al.", "authors": "Timothy Chase Jr, Christopher Wilson, Karthik Dantu", "id": "2501.13725v1", "paper_url": "http://arxiv.org/abs/2501.13725v1", "repo": "null"}}