{"2412.17566": {"publish_time": "2024-12-23", "title": "The Dynamic Duo of Collaborative Masking and Target for Advanced Masked Autoencoder Learning", "paper_summary": "Masked autoencoders (MAE) have recently succeeded in self-supervised vision\nrepresentation learning. Previous work mainly applied custom-designed (e.g.,\nrandom, block-wise) masking or teacher (e.g., CLIP)-guided masking and targets.\nHowever, they ignore the potential role of the self-training (student) model in\ngiving feedback to the teacher for masking and targets. In this work, we\npresent to integrate Collaborative Masking and Targets for boosting Masked\nAutoEncoders, namely CMT-MAE. Specifically, CMT-MAE leverages a simple\ncollaborative masking mechanism through linear aggregation across attentions\nfrom both teacher and student models. We further propose using the output\nfeatures from those two models as the collaborative target of the decoder. Our\nsimple and effective framework pre-trained on ImageNet-1K achieves\nstate-of-the-art linear probing and fine-tuning performance. In particular,\nusing ViT-base, we improve the fine-tuning results of the vanilla MAE from\n83.6% to 85.7%.", "paper_summary_zh": "遮罩式自动编码器 (MAE) 最近在自监督视觉表示学习中取得了成功。先前的工作主要应用自定义设计（例如，随机、区块式）遮罩或教师（例如，CLIP）指导的遮罩和目标。然而，他们忽略了自训练（学生）模型在向教师提供遮罩和目标反馈方面的潜在作用。在这项工作中，我们提出了集成协作遮罩和目标以提升遮罩自动编码器，即 CMT-MAE。具体来说，CMT-MAE 通过教师和学生模型的注意力跨线性聚合利用了一种简单的协作遮罩机制。我们进一步提出使用这两个模型的输出特征作为解码器的协作目标。我们简单而有效的框架在 ImageNet-1K 上经过预训练，实现了最先进的线性探测和微调性能。特别是，使用 ViT-base，我们将原始 MAE 的微调结果从 83.6% 提高到 85.7%。", "author": "Shentong Mo et.al.", "authors": "Shentong Mo", "id": "2412.17566v1", "paper_url": "http://arxiv.org/abs/2412.17566v1", "repo": "null"}}