{"2407.04183": {"publish_time": "2024-07-04", "title": "Seeing Like an AI: How LLMs Apply (and Misapply) Wikipedia Neutrality Norms", "paper_summary": "Large language models (LLMs) are trained on broad corpora and then used in\ncommunities with specialized norms. Is providing LLMs with community rules\nenough for models to follow these norms? We evaluate LLMs' capacity to detect\n(Task 1) and correct (Task 2) biased Wikipedia edits according to Wikipedia's\nNeutral Point of View (NPOV) policy. LLMs struggled with bias detection,\nachieving only 64% accuracy on a balanced dataset. Models exhibited contrasting\nbiases (some under- and others over-predicted bias), suggesting distinct priors\nabout neutrality. LLMs performed better at generation, removing 79% of words\nremoved by Wikipedia editors. However, LLMs made additional changes beyond\nWikipedia editors' simpler neutralizations, resulting in high-recall but\nlow-precision editing. Interestingly, crowdworkers rated AI rewrites as more\nneutral (70%) and fluent (61%) than Wikipedia-editor rewrites. Qualitative\nanalysis found LLMs sometimes applied NPOV more comprehensively than Wikipedia\neditors but often made extraneous non-NPOV-related changes (such as grammar).\nLLMs may apply rules in ways that resonate with the public but diverge from\ncommunity experts. While potentially effective for generation, LLMs may reduce\neditor agency and increase moderation workload (e.g., verifying additions).\nEven when rules are easy to articulate, having LLMs apply them like community\nmembers may still be difficult.", "paper_summary_zh": "大型語言模型（LLM）在廣泛的語料庫上進行訓練，然後在具有特殊規範的社群中使用。提供 LLM 社群規則是否足以讓模型遵循這些規範？我們評估 LLM 根據維基百科的中立觀點（NPOV）政策檢測（任務 1）和更正（任務 2）有偏差的維基百科編輯的能力。LLM 在偏差檢測方面遇到困難，在平衡的資料集上只達到 64% 的準確度。模型表現出對比的偏差（一些預測偏差不足，另一些則預測過度），這表明對中立性的先驗不同。LLM 在生成方面表現得更好，移除了維基百科編輯者移除的 79% 的字詞。然而，LLM 做出了超出維基百科編輯者更簡單的中立化的額外更改，導致高召回率但低精確度的編輯。有趣的是，群眾工作者將 AI 重寫評為比維基百科編輯重寫更中立（70%）和流暢（61%）。定性分析發現，LLM 有時比維基百科編輯者更全面地應用 NPOV，但經常做出與 NPOV 無關的額外更改（例如語法）。LLM 可能以與公眾產生共鳴的方式應用規則，但與社群專家不同。儘管在生成方面可能有效，但 LLM 可能會減少編輯者代理並增加審核工作量（例如，驗證新增內容）。即使規則很容易表達，讓 LLM 像社群成員一樣應用它們可能仍然很困難。", "author": "Joshua Ashkinaze et.al.", "authors": "Joshua Ashkinaze, Ruijia Guan, Laura Kurek, Eytan Adar, Ceren Budak, Eric Gilbert", "id": "2407.04183v1", "paper_url": "http://arxiv.org/abs/2407.04183v1", "repo": "null"}}