{"2410.20971": {"publish_time": "2024-10-28", "title": "BlueSuffix: Reinforced Blue Teaming for Vision-Language Models Against Jailbreak Attacks", "paper_summary": "Despite their superb multimodal capabilities, Vision-Language Models (VLMs)\nhave been shown to be vulnerable to jailbreak attacks, which are inference-time\nattacks that induce the model to output harmful responses with tricky prompts.\nIt is thus essential to defend VLMs against potential jailbreaks for their\ntrustworthy deployment in real-world applications. In this work, we focus on\nblack-box defense for VLMs against jailbreak attacks. Existing black-box\ndefense methods are either unimodal or bimodal. Unimodal methods enhance either\nthe vision or language module of the VLM, while bimodal methods robustify the\nmodel through text-image representation realignment. However, these methods\nsuffer from two limitations: 1) they fail to fully exploit the cross-modal\ninformation, or 2) they degrade the model performance on benign inputs. To\naddress these limitations, we propose a novel blue-team method BlueSuffix that\ndefends the black-box target VLM against jailbreak attacks without compromising\nits performance. BlueSuffix includes three key components: 1) a visual purifier\nagainst jailbreak images, 2) a textual purifier against jailbreak texts, and 3)\na blue-team suffix generator fine-tuned via reinforcement learning for\nenhancing cross-modal robustness. We empirically show on three VLMs (LLaVA,\nMiniGPT-4, and Gemini) and two safety benchmarks (MM-SafetyBench and\nRedTeam-2K) that BlueSuffix outperforms the baseline defenses by a significant\nmargin. Our BlueSuffix opens up a promising direction for defending VLMs\nagainst jailbreak attacks.", "paper_summary_zh": "儘管具有優異的多模態功能，但已證明視覺語言模型 (VLM) 容易受到越獄攻擊，這是一種在推論時誘使模型使用棘手的提示來輸出有害回應的攻擊。因此，必須為 VLM 提供防禦潛在越獄攻擊的保護，以確保其在實際應用中的可信賴部署。在這項工作中，我們專注於針對越獄攻擊對 VLM 進行黑盒防禦。現有的黑盒防禦方法不是單模態就是雙模態。單模態方法增強 VLM 的視覺或語言模組，而雙模態方法則透過文字影像表示重新對齊來強化模型。然而，這些方法有兩個限制：1) 無法充分利用跨模態資訊，或 2) 降低模型對良性輸入的效能。為了解決這些限制，我們提出了一種新穎的藍隊方法 BlueSuffix，它可以在不影響效能的情況下，針對黑盒目標 VLM 防禦越獄攻擊。BlueSuffix 包含三個主要組成部分：1) 針對越獄影像的視覺淨化器，2) 針對越獄文字的文字淨化器，以及 3) 透過強化學習微調的藍隊後綴產生器，以增強跨模態的穩健性。我們在三個 VLM (LLaVA、MiniGPT-4 和 Gemini) 和兩個安全基準 (MM-SafetyBench 和 RedTeam-2K) 上實證顯示，BlueSuffix 以顯著的幅度優於基線防禦措施。我們的 BlueSuffix 為防禦 VLM 針對越獄攻擊開闢了一個有希望的方向。", "author": "Yunhan Zhao et.al.", "authors": "Yunhan Zhao, Xiang Zheng, Lin Luo, Yige Li, Xingjun Ma, Yu-Gang Jiang", "id": "2410.20971v1", "paper_url": "http://arxiv.org/abs/2410.20971v1", "repo": "null"}}