{"2406.18193": {"publish_time": "2024-06-26", "title": "MammothModa: Multi-Modal Large Language Model", "paper_summary": "In this report, we introduce MammothModa, yet another multi-modal large\nlanguage model (MLLM) designed to achieve state-of-the-art performance starting\nfrom an elementary baseline. We focus on three key design insights: (i)\nIntegrating Visual Capabilities while Maintaining Complex Language\nUnderstanding: In addition to the vision encoder, we incorporated the Visual\nAttention Experts into the LLM to enhance its visual capabilities. (ii)\nExtending Context Window for High-Resolution and Long-Duration Visual Feature:\nWe explore the Visual Merger Module to effectively reduce the token number of\nhigh-resolution images and incorporated frame position ids to avoid position\ninterpolation. (iii) High-Quality Bilingual Datasets: We meticulously curated\nand filtered a high-quality bilingual multimodal dataset to reduce visual\nhallucinations. With above recipe we build MammothModa that consistently\noutperforms the state-of-the-art models, e.g., LLaVA-series, across main\nreal-world visual language benchmarks without bells and whistles.", "paper_summary_zh": "在本文中，我們介紹 MammothModa，另一個多模態大型語言模型 (MLLM)，旨在從基礎基準開始實現最先進的效能。我們專注於三個關鍵設計見解：(i) 整合視覺功能，同時維持複雜語言理解：除了視覺編碼器之外，我們將視覺注意力專家納入 LLM，以增強其視覺功能。(ii) 擴展內容視窗以獲得高解析度和長時程視覺特徵：我們探討視覺合併模組，以有效減少高解析度影像的代幣數，並納入影像位置 ID，以避免位置內插。(iii) 高品質雙語資料集：我們仔細策劃並過濾高品質雙語多模態資料集，以減少視覺幻覺。透過上述方法，我們建構出 MammothModa，它在主要的真實世界視覺語言基準中，始終優於最先進的模型，例如 LLaVA 系列，而且沒有花俏的技巧。", "author": "Qi She et.al.", "authors": "Qi She, Junwen Pan, Xin Wan, Rui Zhang, Dawei Lu, Kai Huang", "id": "2406.18193v1", "paper_url": "http://arxiv.org/abs/2406.18193v1", "repo": "null"}}