{"2406.04267": {"publish_time": "2024-06-06", "title": "Transformers need glasses! Information over-squashing in language tasks", "paper_summary": "We study how information propagates in decoder-only Transformers, which are\nthe architectural backbone of most existing frontier large language models\n(LLMs). We rely on a theoretical signal propagation analysis -- specifically,\nwe analyse the representations of the last token in the final layer of the\nTransformer, as this is the representation used for next-token prediction. Our\nanalysis reveals a representational collapse phenomenon: we prove that certain\ndistinct sequences of inputs to the Transformer can yield arbitrarily close\nrepresentations in the final token. This effect is exacerbated by the\nlow-precision floating-point formats frequently used in modern LLMs. As a\nresult, the model is provably unable to respond to these sequences in different\nways -- leading to errors in, e.g., tasks involving counting or copying.\nFurther, we show that decoder-only Transformer language models can lose\nsensitivity to specific tokens in the input, which relates to the well-known\nphenomenon of over-squashing in graph neural networks. We provide empirical\nevidence supporting our claims on contemporary LLMs. Our theory also points to\nsimple solutions towards ameliorating these issues.", "paper_summary_zh": "我們研究資訊在僅解碼器 Transformer 中如何傳播，而僅解碼器 Transformer 是現有最前沿大型語言模型 (LLM) 的架構主幹。我們依賴於理論訊號傳播分析，特別是，我們分析 Transformer 最後一層中最後一個代幣的表徵，因為這是用於下一個代幣預測的表徵。我們的分析揭示了一個表徵崩潰現象：我們證明輸入到 Transformer 的某些不同順序序列可以在最後一個代幣中產生任意接近的表徵。這種效應會因現代 LLM 中經常使用的低精度浮點格式而加劇。結果，該模型無法對這些序列以不同的方式做出回應，導致錯誤，例如涉及計數或複製的任務。此外，我們表明僅解碼器 Transformer 語言模型可能會對輸入中的特定代幣失去敏感性，這與圖神經網路中眾所周知的過度壓縮現象有關。我們提供經驗證據支持我們對當代 LLM 的說法。我們的理論也指出了改善這些問題的簡單解決方案。", "author": "Federico Barbero et.al.", "authors": "Federico Barbero, Andrea Banino, Steven Kapturowski, Dharshan Kumaran, João G. M. Araújo, Alex Vitvitskyi, Razvan Pascanu, Petar Veličković", "id": "2406.04267v1", "paper_url": "http://arxiv.org/abs/2406.04267v1", "repo": "null"}}