{"2501.04974": {"publish_time": "2025-01-09", "title": "SensorQA: A Question Answering Benchmark for Daily-Life Monitoring", "paper_summary": "With the rapid growth in sensor data, effectively interpreting and\ninterfacing with these data in a human-understandable way has become crucial.\nWhile existing research primarily focuses on learning classification models,\nfewer studies have explored how end users can actively extract useful insights\nfrom sensor data, often hindered by the lack of a proper dataset. To address\nthis gap, we introduce \\Dataset, the first human-created question-answering\n(QA) dataset for long-term time-series sensor data for daily life monitoring.\n\\Dataset is created by human workers and includes 5.6K diverse and practical\nqueries that reflect genuine human interests, paired with accurate answers\nderived from sensor data. We further establish benchmarks for state-of-the-art\nAI models on this dataset and evaluate their performance on typical edge\ndevices. Our results reveal a gap between current models and optimal QA\nperformance and efficiency, highlighting the need for new contributions. The\ndataset and code are available at:\n\\url{https://github.com/benjamin-reichman/SensorQA}.", "paper_summary_zh": "隨著感測器資料快速成長，以人類可理解的方式有效解讀和介接這些資料已變得至關重要。雖然現有研究主要專注於學習分類模型，但較少研究探討最終使用者如何能主動從感測器資料中提取有用的見解，這通常受到缺乏適當資料集的阻礙。為了解決這個差距，我們引入了 \\Dataset，這是第一個由人類建立的長期時間序列感測器資料問答 (QA) 資料集，用於日常生活監控。\\Dataset 是由人類工作者建立的，包含 5.6K 個反映真實人類興趣的多元且實用的查詢，並配對從感測器資料衍生的準確答案。我們進一步為這個資料集建立了最先進 AI 模型的基準，並評估它們在典型邊緣裝置上的效能。我們的結果揭露了當前模型與最佳 QA 效能和效率之間的差距，突顯了對新貢獻的需求。資料集和程式碼可在以下位置取得：\\url{https://github.com/benjamin-reichman/SensorQA}。", "author": "Benjamin Reichman et.al.", "authors": "Benjamin Reichman, Xiaofan Yu, Lanxiang Hu, Jack Truxal, Atishay Jain, Rushil Chandrupatla, Tajana Šimunić Rosing, Larry Heck", "id": "2501.04974v1", "paper_url": "http://arxiv.org/abs/2501.04974v1", "repo": "null"}}