{"2408.04560": {"publish_time": "2024-08-08", "title": "Conversational Prompt Engineering", "paper_summary": "Prompts are how humans communicate with LLMs. Informative prompts are\nessential for guiding LLMs to produce the desired output. However, prompt\nengineering is often tedious and time-consuming, requiring significant\nexpertise, limiting its widespread use. We propose Conversational Prompt\nEngineering (CPE), a user-friendly tool that helps users create personalized\nprompts for their specific tasks. CPE uses a chat model to briefly interact\nwith users, helping them articulate their output preferences and integrating\nthese into the prompt. The process includes two main stages: first, the model\nuses user-provided unlabeled data to generate data-driven questions and utilize\nuser responses to shape the initial instruction. Then, the model shares the\noutputs generated by the instruction and uses user feedback to further refine\nthe instruction and the outputs. The final result is a few-shot prompt, where\nthe outputs approved by the user serve as few-shot examples. A user study on\nsummarization tasks demonstrates the value of CPE in creating personalized,\nhigh-performing prompts. The results suggest that the zero-shot prompt obtained\nis comparable to its - much longer - few-shot counterpart, indicating\nsignificant savings in scenarios involving repetitive tasks with large text\nvolumes.", "paper_summary_zh": "提示是人類與 LLM 溝通的方式。提供資訊的提示對於引導 LLM 產生所需的輸出至關重要。然而，提示工程通常既乏味又耗時，需要大量的專業知識，限制了其廣泛使用。我們提出對話式提示工程 (CPE)，這是一個使用者友善的工具，可協助使用者為其特定任務建立個人化的提示。CPE 使用聊天模型與使用者進行簡短的互動，協助他們表達其輸出偏好並將這些偏好整合到提示中。這個過程包含兩個主要階段：首先，模型使用使用者提供的未標記資料來產生資料驅動的問題，並利用使用者的回應來塑造初始指令。然後，模型分享由指令產生的輸出，並使用使用者的回饋進一步改善指令和輸出。最終結果是一個少次提示，其中使用者核准的輸出作為少次範例。針對摘要任務進行的使用者研究證明了 CPE 在建立個人化、高執行效能提示方面的價值。結果顯示，獲得的零次提示與其長得多的少次對應提示相當，這表示在涉及大量文字內容的重複性任務中可以大幅節省。", "author": "Liat Ein-Dor et.al.", "authors": "Liat Ein-Dor, Orith Toledo-Ronen, Artem Spector, Shai Gretz, Lena Dankin, Alon Halfon, Yoav Katz, Noam Slonim", "id": "2408.04560v1", "paper_url": "http://arxiv.org/abs/2408.04560v1", "repo": "null"}}