{"2408.08640": {"publish_time": "2024-08-16", "title": "Math-PUMA: Progressive Upward Multimodal Alignment to Enhance Mathematical Reasoning", "paper_summary": "Multimodal Large Language Models (MLLMs) excel in solving text-based\nmathematical problems, but they struggle with mathematical diagrams since they\nare primarily trained on natural scene images. For humans, visual aids\ngenerally enhance problem-solving, but MLLMs perform worse as information\nshifts from textual to visual modality. This decline is mainly due to their\nshortcomings in aligning images and text. To tackle aforementioned challenges,\nwe propose Math-PUMA, a methodology focused on Progressive Upward Multimodal\nAlignment. This approach is designed to improve the mathematical reasoning\nskills of MLLMs through a three-stage training process, with the second stage\nbeing the critical alignment stage. We first enhance the language model's\nmathematical reasoning capabilities with extensive set of textual mathematical\nproblems. We then construct a multimodal dataset with varying degrees of\ntextual and visual information, creating data pairs by presenting each problem\nin at least two forms. By leveraging the Kullback-Leibler (KL) divergence of\nnext-token prediction distributions to align visual and textual modalities,\nconsistent problem-solving abilities are ensured. Finally, we utilize\nmultimodal instruction tuning for MLLMs with high-quality multimodal data.\nExperimental results on multiple mathematical reasoning benchmarks demonstrate\nthat the MLLMs trained with Math-PUMA surpass most open-source MLLMs. Our\napproach effectively narrows the performance gap for problems presented in\ndifferent modalities.", "paper_summary_zh": "多模態大型語言模型 (MMLM) 擅於解決基於文字的數學問題，但它們在處理數學圖表時會遇到困難，因為它們主要在自然場景圖像上進行訓練。對於人類來說，視覺輔助通常可以增強問題解決能力，但當資訊從文字模式轉換為視覺模式時，MMLM 的表現會變差。這種衰退主要是因為它們在對齊圖像和文字時有缺陷。為了應對上述挑戰，我們提出了 Math-PUMA，這是一種專注於漸進向上多模態對齊的方法。這種方法旨在通過三階段訓練過程來改善 MMLM 的數學推理技能，其中第二階段是關鍵對齊階段。我們首先使用大量的文字數學問題來增強語言模型的數學推理能力。然後，我們構建了一個具有不同程度文字和視覺資訊的多模態資料集，通過以至少兩種形式呈現每個問題來建立資料對。透過利用 Kullback-Leibler (KL) 差異來對齊視覺和文字模式的後續詞彙預測分佈，確保了一致的問題解決能力。最後，我們利用高品質的多模態資料為 MMLM 進行多模態指令微調。在多個數學推理基準上的實驗結果表明，使用 Math-PUMA 訓練的 MMLM 超越了大多數開源 MMLM。我們的做法有效縮小了以不同模式呈現的問題的效能差距。", "author": "Wenwen Zhuang et.al.", "authors": "Wenwen Zhuang, Xin Huang, Xiantao Zhang, Jin Zeng", "id": "2408.08640v1", "paper_url": "http://arxiv.org/abs/2408.08640v1", "repo": "null"}}