{"2501.05403": {"publish_time": "2025-01-09", "title": "TimeDP: Learning to Generate Multi-Domain Time Series with Domain Prompts", "paper_summary": "Time series generation models are crucial for applications like data\naugmentation and privacy preservation. Most existing time series generation\nmodels are typically designed to generate data from one specified domain. While\nleveraging data from other domain for better generalization is proved to work\nin other application areas, this approach remains challenging for time series\nmodeling due to the large divergence in patterns among different real world\ntime series categories. In this paper, we propose a multi-domain time series\ndiffusion model with domain prompts, named TimeDP. In TimeDP, we utilize a time\nseries semantic prototype module which defines time series prototypes to\nrepresent time series basis, each prototype vector serving as \"word\"\nrepresenting some elementary time series feature. A prototype assignment module\nis applied to extract the extract domain specific prototype weights, for\nlearning domain prompts as generation condition. During sampling, we extract\n\"domain prompt\" with few-shot samples from the target domain and use the domain\nprompts as condition to generate time series samples. Experiments demonstrate\nthat our method outperforms baselines to provide the state-of-the-art in-domain\ngeneration quality and strong unseen domain generation capability.", "paper_summary_zh": "時間序列生成模型對於資料擴充和隱私保護等應用至關重要。現有的時間序列生成模型通常設計用於從一個指定領域生成資料。雖然利用其他領域的資料以獲得更好的泛化能力被證明在其他應用領域有效，但這種方法對於時間序列建模來說仍然具有挑戰性，因為不同現實世界時間序列類別之間的模式差異很大。在本文中，我們提出了一個帶有領域提示的多領域時間序列擴散模型，名為 TimeDP。在 TimeDP 中，我們利用了一個時間序列語義原型模組，它定義了時間序列原型以表示時間序列基礎，每個原型向量作為「詞彙」表示一些基本的時間序列特徵。應用原型分配模組來提取提取領域特定的原型權重，以學習領域提示作為生成條件。在採樣過程中，我們從目標領域中提取少數樣本的「領域提示」，並使用領域提示作為條件來生成時間序列樣本。實驗表明，我們的方法優於基準，在領域內生成品質和強大的未知領域生成能力方面提供最先進的技術。", "author": "Yu-Hao Huang et.al.", "authors": "Yu-Hao Huang, Chang Xu, Yueying Wu, Wu-Jun Li, Jiang Bian", "id": "2501.05403v1", "paper_url": "http://arxiv.org/abs/2501.05403v1", "repo": "null"}}