{"2406.09095": {"publish_time": "2024-06-13", "title": "Modeling Comparative Logical Relation with Contrastive Learning for Text Generation", "paper_summary": "Data-to-Text Generation (D2T), a classic natural language generation problem,\naims at producing fluent descriptions for structured input data, such as a\ntable. Existing D2T works mainly focus on describing the superficial\nassociative relations among entities, while ignoring the deep comparative\nlogical relations, such as A is better than B in a certain aspect with a\ncorresponding opinion, which is quite common in our daily life. In this paper,\nwe introduce a new D2T task named comparative logical relation generation\n(CLRG). Additionally, we propose a Comparative Logic (CoLo) based text\ngeneration method, which generates texts following specific comparative logical\nrelations with contrastive learning. Specifically, we first construct various\npositive and negative samples by fine-grained perturbations in entities,\naspects and opinions. Then, we perform contrastive learning in the encoder\nlayer to have a better understanding of the comparative logical relations, and\nintegrate it in the decoder layer to guide the model to correctly generate the\nrelations. Noting the data scarcity problem, we construct a Chinese Comparative\nLogical Relation Dataset (CLRD), which is a high-quality human-annotated\ndataset and challenging for text generation with descriptions of multiple\nentities and annotations on their comparative logical relations. Extensive\nexperiments show that our method achieves impressive performance in both\nautomatic and human evaluations.", "paper_summary_zh": "資料轉文字生成（D2T）是一個經典的自然語言生成問題，旨在為結構化輸入資料（例如表格）產生流暢的描述。現有的 D2T 工作主要專注於描述實體之間表面的關聯關係，而忽略了深層的比較邏輯關係，例如 A 在某個方面比 B 好，並帶有相應的意見，這在我們的日常生活中很常見。在本文中，我們介紹了一項名為比較邏輯關係生成（CLRG）的新 D2T 任務。此外，我們提出了一個基於比較邏輯（CoLo）的文字生成方法，該方法遵循特定的比較邏輯關係並使用對比學習來生成文字。具體來說，我們首先通過實體、方面和意見的細粒度擾動來構造各種正負樣本。然後，我們在編碼器層中執行對比學習，以更好地理解比較邏輯關係，並將其整合到解碼器層中以指導模型正確生成關係。注意到資料稀缺的問題，我們構建了一個中文比較邏輯關係資料集（CLRD），這是一個高品質的人工標註資料集，對於具有多個實體描述和其比較邏輯關係標註的文字生成來說具有挑戰性。大量的實驗表明，我們的模型在自動和人工評估中都取得了令人印象深刻的表現。", "author": "Yuhao Dan et.al.", "authors": "Yuhao Dan, Junfeng Tian, Jie Zhou, Ming Yan, Ji Zhang, Qin Chen, Liang He", "id": "2406.09095v1", "paper_url": "http://arxiv.org/abs/2406.09095v1", "repo": "null"}}