{"2406.11431": {"publish_time": "2024-06-17", "title": "Super(ficial)-alignment: Strong Models May Deceive Weak Models in Weak-to-Strong Generalization", "paper_summary": "Superalignment, where humans are weak supervisors of superhuman models, has\nbecome an important and widely discussed issue in the current era of rapid\ndevelopment of Large Language Models (LLMs). The recent work preliminarily\nstudies this problem by using weak models to supervise strong models. It\ndiscovers that weakly supervised strong students can consistently outperform\nweak teachers towards the alignment target, leading to a weak-to-strong\ngeneralization phenomenon. However, we are concerned that behind such a\npromising phenomenon, whether there exists an issue of weak-to-strong\ndeception, where strong models may deceive weak models by exhibiting\nwell-aligned in areas known to weak models but producing misaligned behaviors\nin cases weak models do not know. We then take an initial step towards\nexploring this security issue in a specific but realistic multi-objective\nalignment case, where there may be some alignment targets conflicting with each\nother (e.g., helpfulness v.s. harmlessness). Such a conflict is likely to cause\nstrong models to deceive weak models in one alignment dimension to gain high\nreward in other alignment dimension. Our experiments on both the reward\nmodeling task and the preference optimization scenario indicate: (1) the\nweak-to-strong deception exists; (2) the deception phenomenon may intensify as\nthe capability gap between weak and strong models increases. We also discuss\npotential solutions and find bootstrapping with an intermediate model can\nmitigate the deception to some extent. Our work highlights the urgent need to\npay more attention to the true reliability of superalignment.", "paper_summary_zh": "超對齊（人類是超人類模型的弱監督者）已成為大型語言模型 (LLM) 快速發展的當前時代中一個重要且廣泛討論的問題。最近的研究初步透過使用弱模型監督強模型來探討這個問題。它發現弱監督的強學生可以持續在對齊目標上優於弱教師，導致弱到強的概化現象。然而，我們擔心在這樣一個有希望的現象背後，是否存在弱到強的欺騙問題，其中強模型可能透過在弱模型已知的領域表現出良好對齊，但在弱模型不知道的情況下產生失衡行為來欺騙弱模型。然後，我們採取初步步驟在特定但實際的多目標對齊案例中探討這個安全問題，其中可能有一些對齊目標相互衝突（例如，有益性 v.s. 無害性）。這種衝突可能會導致強模型在一個對齊維度欺騙弱模型，以在其他對齊維度獲得高回報。我們在回報建模任務和偏好最佳化情境中的實驗表明：(1) 弱到強的欺騙存在；(2) 隨著弱模型和強模型之間能力差距的增加，欺騙現象可能會加劇。我們也討論潛在的解決方案，並發現使用中介模型進行自舉可在某種程度上減輕欺騙。我們的研究強調迫切需要更注意超對齊的真實可靠性。", "author": "Wenkai Yang et.al.", "authors": "Wenkai Yang, Shiqi Shen, Guangyao Shen, Zhi Gong, Yankai Lin", "id": "2406.11431v1", "paper_url": "http://arxiv.org/abs/2406.11431v1", "repo": "https://github.com/keven980716/weak-to-strong-deception"}}