{"2406.15168": {"publish_time": "2024-06-21", "title": "This actually looks like that: Proto-BagNets for local and global interpretability-by-design", "paper_summary": "Interpretability is a key requirement for the use of machine learning models\nin high-stakes applications, including medical diagnosis. Explaining black-box\nmodels mostly relies on post-hoc methods that do not faithfully reflect the\nmodel's behavior. As a remedy, prototype-based networks have been proposed, but\ntheir interpretability is limited as they have been shown to provide coarse,\nunreliable, and imprecise explanations. In this work, we introduce\nProto-BagNets, an interpretable-by-design prototype-based model that combines\nthe advantages of bag-of-local feature models and prototype learning to provide\nmeaningful, coherent, and relevant prototypical parts needed for accurate and\ninterpretable image classification tasks. We evaluated the Proto-BagNet for\ndrusen detection on publicly available retinal OCT data. The Proto-BagNet\nperformed comparably to the state-of-the-art interpretable and\nnon-interpretable models while providing faithful, accurate, and clinically\nmeaningful local and global explanations. The code is available at\nhttps://github.com/kdjoumessi/Proto-BagNets.", "paper_summary_zh": "可解釋性是機器學習模型在高風險應用（包括醫療診斷）中使用的關鍵要求。解釋黑盒模型主要依賴於事後方法，而這些方法無法忠實地反映模型的行為。作為補救措施，已經提出了基於原型的網路，但由於它們已被證明會提供粗略、不可靠且不精確的解釋，因此它們的可解釋性受到限制。在這項工作中，我們引入了 Proto-BagNets，這是一個可解釋的基於設計的原型模型，它結合了局部特徵模型和原型學習的優點，以提供準確且可解釋的影像分類任務所需的、有意義、連貫且相關的原型部分。我們評估了 Proto-BagNet 在公開可用的視網膜 OCT 資料上的黃斑點檢測。Proto-BagNet 的表現與最先進的可解釋和不可解釋模型相當，同時提供了忠實、準確且在臨床上有意義的局部和整體解釋。程式碼可在 https://github.com/kdjoumessi/Proto-BagNets 取得。", "author": "Kerol Djoumessi et.al.", "authors": "Kerol Djoumessi, Bubacarr Bah, Laura Kühlewein, Philipp Berens, Lisa Koch", "id": "2406.15168v2", "paper_url": "http://arxiv.org/abs/2406.15168v2", "repo": "https://github.com/kdjoumessi/proto-bagnets"}}