{"2410.20936": {"publish_time": "2024-10-28", "title": "Autoformalize Mathematical Statements by Symbolic Equivalence and Semantic Consistency", "paper_summary": "Autoformalization, the task of automatically translating natural language\ndescriptions into a formal language, poses a significant challenge across\nvarious domains, especially in mathematics. Recent advancements in large\nlanguage models (LLMs) have unveiled their promising capabilities to formalize\neven competition-level math problems. However, we observe a considerable\ndiscrepancy between pass@1 and pass@k accuracies in LLM-generated\nformalizations. To address this gap, we introduce a novel framework that scores\nand selects the best result from k autoformalization candidates based on two\ncomplementary self-consistency methods: symbolic equivalence and semantic\nconsistency. Elaborately, symbolic equivalence identifies the logical\nhomogeneity among autoformalization candidates using automated theorem provers,\nand semantic consistency evaluates the preservation of the original meaning by\ninformalizing the candidates and computing the similarity between the\nembeddings of the original and informalized texts. Our extensive experiments on\nthe MATH and miniF2F datasets demonstrate that our approach significantly\nenhances autoformalization accuracy, achieving up to 0.22-1.35x relative\nimprovements across various LLMs and baseline methods.", "paper_summary_zh": "自動形式化，即自動將自然語言描述轉換為形式語言的任務，在各個領域，特別是在數學領域，都面臨著重大挑戰。大型語言模型 (LLM) 的最新進展揭示了它們將競賽級別的數學問題形式化的強大功能。然而，我們觀察到 LLM 生成的形式化中的 pass@1 和 pass@k 準確度之間存在相當大的差異。為了解決這一差距，我們引入了一個新框架，該框架根據兩種互補的自洽方法（符號等價和語義一致性）對 k 個自動形式化候選項進行評分並選擇最佳結果。具體來說，符號等價使用自動定理證明器識別自動形式化候選項之間的邏輯同質性，而語義一致性通過將候選項非形式化並計算原始文本和非形式化文本的嵌入之間的相似性來評估原始含義的保留。我們在 MATH 和 miniF2F 數據集上進行的廣泛實驗表明，我們的做法顯著提高了自動形式化的準確性，在各種 LLM 和基線方法中實現了高達 0.22-1.35 倍的相對改進。", "author": "Zenan Li et.al.", "authors": "Zenan Li, Yifan Wu, Zhaoyu Li, Xinming Wei, Xian Zhang, Fan Yang, Xiaoxing Ma", "id": "2410.20936v1", "paper_url": "http://arxiv.org/abs/2410.20936v1", "repo": "https://github.com/miracle-messi/isa-autoformal"}}