{"2405.03882": {"publish_time": "2024-05-06", "title": "Trio-ViT: Post-Training Quantization and Acceleration for Softmax-Free Efficient Vision Transformer", "paper_summary": "Motivated by the huge success of Transformers in the field of natural\nlanguage processing (NLP), Vision Transformers (ViTs) have been rapidly\ndeveloped and achieved remarkable performance in various computer vision tasks.\nHowever, their huge model sizes and intensive computations hinder ViTs'\ndeployment on embedded devices, calling for effective model compression\nmethods, such as quantization. Unfortunately, due to the existence of\nhardware-unfriendly and quantization-sensitive non-linear operations,\nparticularly {Softmax}, it is non-trivial to completely quantize all operations\nin ViTs, yielding either significant accuracy drops or non-negligible hardware\ncosts. In response to challenges associated with \\textit{standard ViTs}, we\nfocus our attention towards the quantization and acceleration for\n\\textit{efficient ViTs}, which not only eliminate the troublesome Softmax but\nalso integrate linear attention with low computational complexity, and propose\n\\emph{Trio-ViT} accordingly. Specifically, at the algorithm level, we develop a\n{tailored post-training quantization engine} taking the unique activation\ndistributions of Softmax-free efficient ViTs into full consideration, aiming to\nboost quantization accuracy. Furthermore, at the hardware level, we build an\naccelerator dedicated to the specific Convolution-Transformer hybrid\narchitecture of efficient ViTs, thereby enhancing hardware efficiency.\nExtensive experimental results consistently prove the effectiveness of our\nTrio-ViT framework. {Particularly, we can gain up to\n$\\uparrow$$\\mathbf{7.2}\\times$ and $\\uparrow$$\\mathbf{14.6}\\times$ FPS under\ncomparable accuracy over state-of-the-art ViT accelerators, as well as\n$\\uparrow$$\\mathbf{5.9}\\times$ and $\\uparrow$$\\mathbf{2.0}\\times$ DSP\nefficiency.} Codes will be released publicly upon acceptance.", "paper_summary_zh": "<paragraph>受 Transformer 在自然語言處理 (NLP) 領域取得巨大成功的啟發，視覺 Transformer (ViT) 已被迅速開發，並在各種電腦視覺任務中取得顯著成效。然而，它們龐大的模型規模和密集運算阻礙了 ViT 在嵌入式裝置上的部署，這需要有效的模型壓縮方法，例如量化。不幸的是，由於存在硬體不友善且對量化敏感的非線性運算，特別是 {Softmax}，因此要完全量化 ViT 中的所有運算並非易事，這會導致顯著的準確度下降或不可忽視的硬體成本。為了應對與\\textit{標準 ViT}相關的挑戰，我們將注意力集中在\\textit{高效 ViT}的量化和加速上，這不僅消除了麻煩的 Softmax，還整合了低運算複雜度的線性注意力，並據此提出了\\emph{Trio-ViT}。具體來說，在演算法層級，我們開發了一個{量身打造的訓練後量化引擎}，充分考慮了無 Softmax 高效 ViT 的獨特激活分佈，旨在提升量化準確度。此外，在硬體層級，我們建立了一個專門用於高效 ViT 的特定卷積Transformer混合架構的加速器，從而提升硬體效率。廣泛的實驗結果一致證明了我們 Trio-ViT 框架的有效性。{特別是，在與最先進的 ViT 加速器相當的準確度下，我們可以獲得高達 $\\uparrow$$\\mathbf{7.2}\\times$ 和 $\\uparrow$$\\mathbf{14.6}\\times$ FPS，以及 $\\uparrow$$\\mathbf{5.9}\\times$ 和 $\\uparrow$$\\mathbf{2.0}\\times$ DSP 效率。}代碼將在接受後公開發布。</paragraph>", "author": "Huihong Shi et.al.", "authors": "Huihong Shi, Haikuo Shao, Wendong Mao, Zhongfeng Wang", "id": "2405.03882v1", "paper_url": "http://arxiv.org/abs/2405.03882v1", "repo": "null"}}