{"2408.02677": {"publish_time": "2024-07-31", "title": "Patient-centered data science: an integrative framework for evaluating and predicting clinical outcomes in the digital health era", "paper_summary": "This study proposes a novel, integrative framework for patient-centered data\nscience in the digital health era. We developed a multidimensional model that\ncombines traditional clinical data with patient-reported outcomes, social\ndeterminants of health, and multi-omic data to create comprehensive digital\npatient representations. Our framework employs a multi-agent artificial\nintelligence approach, utilizing various machine learning techniques including\nlarge language models, to analyze complex, longitudinal datasets. The model\naims to optimize multiple patient outcomes simultaneously while addressing\nbiases and ensuring generalizability. We demonstrate how this framework can be\nimplemented to create a learning healthcare system that continuously refines\nstrategies for optimal patient care. This approach has the potential to\nsignificantly improve the translation of digital health innovations into\nreal-world clinical benefits, addressing current limitations in AI-driven\nhealthcare models.", "paper_summary_zh": "本研究提出了一個創新的、整合性的架構，用於數位健康時代的以患者為中心的資料科學。我們開發了一個多面向模型，結合傳統的臨床資料、患者回報的結果、健康的社會決定因素和多組學資料，以建立全面的數位患者表徵。我們的架構採用多主體人工智慧方法，利用各種機器學習技術，包括大型語言模型，來分析複雜的縱向資料集。該模型旨在同時最佳化多個患者結果，同時解決偏差並確保可概化性。我們展示了如何實作此架構，以建立一個持續優化最佳患者照護策略的學習型醫療保健系統。此方法有可能顯著改善數位健康創新的轉譯，使其成為真實世界的臨床效益，解決 AI 驅動的醫療保健模型中的當前限制。", "author": "Mohsen Amoei et.al.", "authors": "Mohsen Amoei, Dan Poenaru", "id": "2408.02677v1", "paper_url": "http://arxiv.org/abs/2408.02677v1", "repo": "null"}}