{"2502.08662": {"publish_time": "2025-02-10", "title": "RoToR: Towards More Reliable Responses for Order-Invariant Inputs", "paper_summary": "Mitigating positional bias of language models (LMs) for listwise inputs is a\nwell-known and important problem (e.g., lost-in-the-middle). While zero-shot\norder-invariant LMs have been proposed to solve this issue, their success on\npractical listwise problems has been limited. In this work, as a first\ncontribution, we identify and overcome two limitations to make zero-shot\ninvariant LMs more practical: (1) training and inference distribution mismatch\narising from modifying positional ID assignments to enforce invariance, and (2)\nfailure to adapt to a mixture of order-invariant and sensitive inputs in\npractical listwise problems. To overcome, we propose (1) RoToR, a zero-shot\ninvariant LM for genuinely order-invariant inputs with minimal modifications of\npositional IDs, and (2) Selective Routing, an adaptive framework that handles\nboth order-invariant and order-sensitive inputs in listwise tasks. On the Lost\nin the middle (LitM), Knowledge Graph Question Answering (KGQA), and MMLU\nbenchmarks, we show that RoToR with Selective Routing can effectively handle\npractical listwise input tasks in a zero-shot manner.", "paper_summary_zh": "語言模型 (LM) 的位置偏差緩解對於列表輸入來說是一個廣為人知且重要的問題（例如，迷失在中間）。雖然已經提出零次學習順序不變的 LM 來解決這個問題，但它們在實際列表問題上的成功卻很有限。在這項工作中，作為第一個貢獻，我們找出並克服了兩個限制，讓零次學習不變的 LM 更有實用性：(1) 訓練和推論分布不匹配，這是由於修改位置 ID 分配以強制不變性所造成的，以及 (2) 無法適應實際列表問題中不變和敏感輸入的組合。為了克服這些問題，我們提出 (1) RoToR，一個零次學習不變的 LM，用於真正不變的輸入，並對位置 ID 進行最小的修改，以及 (2) 選擇性路由，一個自適應框架，用於處理列表任務中不變和敏感的輸入。在迷失在中間 (LitM)、知識圖譜問答 (KGQA) 和 MMLU 基準測試中，我們展示了 RoToR 與選擇性路由可以有效地以零次學習的方式處理實際的列表輸入任務。", "author": "Soyoung Yoon et.al.", "authors": "Soyoung Yoon, Dongha Ahn, Youngwon Lee, Minkyu Jung, HyungJoo Jang, Seung-won Hwang", "id": "2502.08662v1", "paper_url": "http://arxiv.org/abs/2502.08662v1", "repo": "null"}}