{"2411.15844": {"publish_time": "2024-11-24", "title": "Unveiling the Superior Paradigm: A Comparative Study of Source-Free Domain Adaptation and Unsupervised Domain Adaptation", "paper_summary": "In domain adaptation, there are two popular paradigms: Unsupervised Domain\nAdaptation (UDA), which aligns distributions using source data, and Source-Free\nDomain Adaptation (SFDA), which leverages pre-trained source models without\naccessing source data. Evaluating the superiority of UDA versus SFDA is an open\nand timely question with significant implications for deploying adaptive\nalgorithms in practical applications. In this study, we demonstrate through\npredictive coding theory and extensive experiments on multiple benchmark\ndatasets that SFDA generally outperforms UDA in real-world scenarios.\nSpecifically, SFDA offers advantages in time efficiency, storage requirements,\ntargeted learning objectives, reduced risk of negative transfer, and increased\nrobustness against overfitting. Notably, SFDA is particularly effective in\nmitigating negative transfer when there are substantial distribution\ndiscrepancies between source and target domains. Additionally, we introduce a\nnovel data-model fusion scenario, where data sharing among stakeholders varies\n(e.g., some provide raw data while others provide only models), and reveal that\ntraditional UDA and SFDA methods do not fully exploit their potential in this\ncontext. To address this limitation and capitalize on the strengths of SFDA, we\npropose a novel weight estimation method that effectively integrates available\nsource data into multi-SFDA (MSFDA) approaches, thereby enhancing model\nperformance within this scenario. This work provides a thorough analysis of UDA\nversus SFDA and advances a practical approach to model adaptation across\ndiverse real-world environments.", "paper_summary_zh": "<paragraph>在領域適應中，有兩種流行的範例：無監督領域適應 (UDA)，它使用來源數據對齊分佈，以及無來源領域適應 (SFDA)，它利用預訓練的來源模型而無需存取來源數據。評估 UDA 與 SFDA 的優越性是一個開放且及時的問題，對於在實際應用中部署適應性演算法具有重大意義。在本研究中，我們透過預測編碼理論和在多個基準資料集上的廣泛實驗證明，SFDA 通常在實際場景中優於 UDA。具體來說，SFDA 在時間效率、儲存需求、目標學習目標、降低負面轉移風險和增加對過度擬合的穩健性方面具有優勢。值得注意的是，當來源和目標領域之間存在實質性分佈差異時，SFDA 在減輕負面轉移方面特別有效。此外，我們引入了一個新穎的資料模型融合場景，其中利益相關者之間的資料共享有所不同（例如，一些提供原始資料，而另一些只提供模型），並揭示傳統的 UDA 和 SFDA 方法並未充分發揮其在這種情況下的潛力。為了解決這個限制並利用 SFDA 的優勢，我們提出了一種新穎的權重估計方法，該方法有效地將可用的來源數據整合到多 SFDA (MSFDA) 方法中，從而增強模型在這種場景中的效能。這項工作對 UDA 與 SFDA 進行了徹底的分析，並提出了一種實用的方法來適應不同實際環境中的模型。</paragraph>", "author": "Fan Wang et.al.", "authors": "Fan Wang, Zhongyi Han, Xingbo Liu, Xin Gao, Yilong Yin", "id": "2411.15844v1", "paper_url": "http://arxiv.org/abs/2411.15844v1", "repo": "null"}}