{"2407.12498": {"publish_time": "2024-07-17", "title": "Evaluating Linguistic Capabilities of Multimodal LLMs in the Lens of Few-Shot Learning", "paper_summary": "The linguistic capabilities of Multimodal Large Language Models (MLLMs) are\ncritical for their effective application across diverse tasks. This study aims\nto evaluate the performance of MLLMs on the VALSE benchmark, focusing on the\nefficacy of few-shot In-Context Learning (ICL), and Chain-of-Thought (CoT)\nprompting. We conducted a comprehensive assessment of state-of-the-art MLLMs,\nvarying in model size and pretraining datasets. The experimental results reveal\nthat ICL and CoT prompting significantly boost model performance, particularly\nin tasks requiring complex reasoning and contextual understanding. Models\npretrained on captioning datasets show superior zero-shot performance, while\nthose trained on interleaved image-text data benefit from few-shot learning.\nOur findings provide valuable insights into optimizing MLLMs for better\ngrounding of language in visual contexts, highlighting the importance of the\ncomposition of pretraining data and the potential of few-shot learning\nstrategies to improve the reasoning abilities of MLLMs.", "paper_summary_zh": "多模態大型語言模型 (MLLM) 的語言能力對於它們在不同任務中的有效應用至關重要。本研究旨在評估 MLLM 在 VALSE 基準上的表現，重點關注少量 In-Context Learning (ICL) 和 Chain-of-Thought (CoT) 提示的效能。我們對最先進的 MLLM 進行了全面評估，這些模型在模型大小和預訓練資料集方面各不相同。實驗結果表明，ICL 和 CoT 提示顯著提升了模型效能，尤其是在需要複雜推理和語境理解的任務中。在標題資料集上預訓練的模型展現出優異的零次學習效能，而那些在交錯圖像文字資料上訓練的模型則受益於少量學習。我們的研究結果為優化 MLLM 以便在視覺語境中更好地建構語言提供了寶貴的見解，強調了預訓練資料的組成和少量學習策略在提升 MLLM 推理能力方面的潛力。", "author": "Mustafa Dogan et.al.", "authors": "Mustafa Dogan, Ilker Kesen, Iacer Calixto, Aykut Erdem, Erkut Erdem", "id": "2407.12498v1", "paper_url": "http://arxiv.org/abs/2407.12498v1", "repo": "null"}}