{"2405.19074": {"publish_time": "2024-05-29", "title": "Resurrecting Old Classes with New Data for Exemplar-Free Continual Learning", "paper_summary": "Continual learning methods are known to suffer from catastrophic forgetting,\na phenomenon that is particularly hard to counter for methods that do not store\nexemplars of previous tasks. Therefore, to reduce potential drift in the\nfeature extractor, existing exemplar-free methods are typically evaluated in\nsettings where the first task is significantly larger than subsequent tasks.\nTheir performance drops drastically in more challenging settings starting with\na smaller first task. To address this problem of feature drift estimation for\nexemplar-free methods, we propose to adversarially perturb the current samples\nsuch that their embeddings are close to the old class prototypes in the old\nmodel embedding space. We then estimate the drift in the embedding space from\nthe old to the new model using the perturbed images and compensate the\nprototypes accordingly. We exploit the fact that adversarial samples are\ntransferable from the old to the new feature space in a continual learning\nsetting. The generation of these images is simple and computationally cheap. We\ndemonstrate in our experiments that the proposed approach better tracks the\nmovement of prototypes in embedding space and outperforms existing methods on\nseveral standard continual learning benchmarks as well as on fine-grained\ndatasets. Code is available at https://github.com/dipamgoswami/ADC.", "paper_summary_zh": "持續學習方法已知會遭受災難性遺忘，\n這是一個特別難以對抗的現象，對於不儲存先前任務範例的方法而言更是如此。因此，為了減少特徵萃取器中的潛在偏移，現有的無範例方法通常在第一個任務顯著大於後續任務的設定中進行評估。他們的表現會在從較小的第一個任務開始的更具挑戰性的設定中急劇下降。為了解決無範例方法的特徵偏移估計問題，我們建議對當前樣本進行對抗性擾動，使其嵌入與舊模型嵌入空間中的舊類別原型相近。然後，我們使用擾動的影像從舊模型估計到新模型的嵌入空間中的偏移，並相應地補償原型。我們利用對抗樣本在持續學習設定中可以從舊特徵空間傳輸到新特徵空間的事實。這些影像的生成簡單且計算成本低廉。我們在實驗中證明，所提出的方法可以更好地追蹤嵌入空間中原型的移動，並在多個標準持續學習基準以及細粒度資料集上優於現有方法。程式碼可在 https://github.com/dipamgoswami/ADC 取得。", "author": "Dipam Goswami et.al.", "authors": "Dipam Goswami, Albin Soutif--Cormerais, Yuyang Liu, Sandesh Kamath, Bartłomiej Twardowski, Joost van de Weijer", "id": "2405.19074v1", "paper_url": "http://arxiv.org/abs/2405.19074v1", "repo": "https://github.com/dipamgoswami/adc"}}