{"2408.05966": {"publish_time": "2024-08-12", "title": "Freehand Sketch Generation from Mechanical Components", "paper_summary": "Drawing freehand sketches of mechanical components on multimedia devices for\nAI-based engineering modeling has become a new trend. However, its development\nis being impeded because existing works cannot produce suitable sketches for\ndata-driven research. These works either generate sketches lacking a freehand\nstyle or utilize generative models not originally designed for this task\nresulting in poor effectiveness. To address this issue, we design a two-stage\ngenerative framework mimicking the human sketching behavior pattern, called\nMSFormer, which is the first time to produce humanoid freehand sketches\ntailored for mechanical components. The first stage employs Open CASCADE\ntechnology to obtain multi-view contour sketches from mechanical components,\nfiltering perturbing signals for the ensuing generation process. Meanwhile, we\ndesign a view selector to simulate viewpoint selection tasks during human\nsketching for picking out information-rich sketches. The second stage\ntranslates contour sketches into freehand sketches by a transformer-based\ngenerator. To retain essential modeling features as much as possible and\nrationalize stroke distribution, we introduce a novel edge-constraint stroke\ninitialization. Furthermore, we utilize a CLIP vision encoder and a new loss\nfunction incorporating the Hausdorff distance to enhance the generalizability\nand robustness of the model. Extensive experiments demonstrate that our\napproach achieves state-of-the-art performance for generating freehand sketches\nin the mechanical domain. Project page: https://mcfreeskegen.github.io .", "paper_summary_zh": "<paragraph>在多媒體裝置上徒手繪製機械元件的素描，用於基於 AI 的工程建模，已成為一種新趨勢。然而，其發展受到阻礙，因為現有作品無法產生適合資料驅動研究的素描。這些作品要么產生缺乏徒手風格的素描，要么使用最初未針對此任務設計的生成模型，導致效果不佳。為了解決這個問題，我們設計了一個兩階段生成框架，模擬人類素描行為模式，稱為 MSFomer，這是首次產生針對機械元件量身定制的人形徒手素描。第一階段採用 Open CASCADE 技術從機械元件中獲取多視圖輪廓素描，過濾後續生成過程中的擾動信號。同時，我們設計了一個視圖選擇器來模擬人類素描期間的視點選擇任務，以挑選出資訊豐富的素描。第二階段通過基於Transformer的生成器將輪廓素描轉換為徒手素描。為了盡可能保留必要的建模特徵並合理化筆觸分佈，我們引入了一種新的邊緣約束筆觸初始化。此外，我們利用 CLIP 視覺編碼器和一個新的損失函數，結合豪斯多夫距離來增強模型的泛化性和魯棒性。大量的實驗證明，我們的模型在機械域中產生徒手素描方面取得了最先進的效能。專案頁面：https://mcfreeskegen.github.io。</paragraph>", "author": "Zhichao Liao et.al.", "authors": "Zhichao Liao, Di Huang, Heming Fang, Yue Ma, Fengyuan Piao, Xinghui Li, Long Zeng, Pingfa Feng", "id": "2408.05966v1", "paper_url": "http://arxiv.org/abs/2408.05966v1", "repo": "null"}}