{"2406.16694": {"publish_time": "2024-06-24", "title": "Task Oriented In-Domain Data Augmentation", "paper_summary": "Large Language Models (LLMs) have shown superior performance in various\napplications and fields. To achieve better performance on specialized domains\nsuch as law and advertisement, LLMs are often continue pre-trained on in-domain\ndata. However, existing approaches suffer from two major issues. First,\nin-domain data are scarce compared with general domain-agnostic data. Second,\ndata used for continual pre-training are not task-aware, such that they may not\nbe helpful to downstream applications. We propose TRAIT, a task-oriented\nin-domain data augmentation framework. Our framework is divided into two parts:\nin-domain data selection and task-oriented synthetic passage generation. The\ndata selection strategy identifies and selects a large amount of in-domain data\nfrom general corpora, and thus significantly enriches domain knowledge in the\ncontinual pre-training data. The synthetic passages contain guidance on how to\nuse domain knowledge to answer questions about downstream tasks. By training on\nsuch passages, the model aligns with the need of downstream applications. We\nadapt LLMs to two domains: advertisement and math. On average, TRAIT improves\nLLM performance by 8% in the advertisement domain and 7.5% in the math domain.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種應用程式和領域中展現出優異的效能。為了在法律和廣告等特定領域中獲得更好的效能，LLM 經常持續在特定領域的資料中進行預先訓練。然而，現有的方法有兩個主要問題。首先，與一般領域無關的資料相比，特定領域的資料較為稀少。其次，用於持續預先訓練的資料並非任務導向，因此可能對下游應用程式沒有幫助。我們提出 TRAIT，一個任務導向的特定領域資料擴充架構。我們的架構分為兩個部分：特定領域資料選取和任務導向合成段落產生。資料選取策略從一般語料庫中識別並選取大量的特定領域資料，從而顯著豐富了持續預先訓練資料中的領域知識。合成段落包含有關如何使用領域知識來回答下游任務問題的指導方針。透過訓練這些段落，模型與下游應用程式的需求保持一致。我們將 LLM 調整到兩個領域：廣告和數學。平均而言，TRAIT 將廣告領域的 LLM 效能提升了 8%，數學領域的效能提升了 7.5%。", "author": "Xiao Liang et.al.", "authors": "Xiao Liang, Xinyu Hu, Simiao Zuo, Yeyun Gong, Qiang Lou, Yi Liu, Shao-Lun Huang, Jian Jiao", "id": "2406.16694v1", "paper_url": "http://arxiv.org/abs/2406.16694v1", "repo": "null"}}