{"2412.13771": {"publish_time": "2024-12-18", "title": "Semantic Convergence: Harmonizing Recommender Systems via Two-Stage Alignment and Behavioral Semantic Tokenization", "paper_summary": "Large language models (LLMs), endowed with exceptional reasoning\ncapabilities, are adept at discerning profound user interests from historical\nbehaviors, thereby presenting a promising avenue for the advancement of\nrecommendation systems. However, a notable discrepancy persists between the\nsparse collaborative semantics typically found in recommendation systems and\nthe dense token representations within LLMs. In our study, we propose a novel\nframework that harmoniously merges traditional recommendation models with the\nprowess of LLMs. We initiate this integration by transforming ItemIDs into\nsequences that align semantically with the LLMs space, through the proposed\nAlignment Tokenization module. Additionally, we design a series of specialized\nsupervised learning tasks aimed at aligning collaborative signals with the\nsubtleties of natural language semantics. To ensure practical applicability, we\noptimize online inference by pre-caching the top-K results for each user,\nreducing latency and improving effciency. Extensive experimental evidence\nindicates that our model markedly improves recall metrics and displays\nremarkable scalability of recommendation systems.", "paper_summary_zh": "大型語言模型 (LLM) 擁有卓越的推理能力，擅長從歷史行為中辨識出深刻的使用者興趣，因此為推薦系統的進步提供了一條有前途的途徑。然而，推薦系統中通常發現的稀疏協作語義與 LLM 中的密集標記表示之間存在明顯的差異。在我們的研究中，我們提出了一個新的框架，將傳統的推薦模型與 LLM 的優勢和諧地結合起來。我們通過建議的對齊標記化模組，將 ItemID 轉換成在語義上與 LLM 空間對齊的序列，來啟動此整合。此外，我們設計了一系列專門的監督式學習任務，旨在將協作訊號與自然語言語義的細微差別對齊。為了確保實際應用性，我們透過預先快取每個使用者的前 K 個結果來最佳化線上推論，進而減少延遲並提高效率。廣泛的實驗證據表明，我們的模型顯著改善了召回指標，並展現出推薦系統的顯著可擴充性。", "author": "Guanghan Li et.al.", "authors": "Guanghan Li, Xun Zhang, Yufei Zhang, Yifan Yin, Guojun Yin, Wei Lin", "id": "2412.13771v1", "paper_url": "http://arxiv.org/abs/2412.13771v1", "repo": "null"}}