{"2502.09897": {"publish_time": "2025-02-14", "title": "Artificial Intelligence in Spectroscopy: Advancing Chemistry from Prediction to Generation and Beyond", "paper_summary": "The rapid advent of machine learning (ML) and artificial intelligence (AI)\nhas catalyzed major transformations in chemistry, yet the application of these\nmethods to spectroscopic and spectrometric data, referred to as Spectroscopy\nMachine Learning (SpectraML), remains relatively underexplored. Modern\nspectroscopic techniques (MS, NMR, IR, Raman, UV-Vis) generate an ever-growing\nvolume of high-dimensional data, creating a pressing need for automated and\nintelligent analysis beyond traditional expert-based workflows. In this survey,\nwe provide a unified review of SpectraML, systematically examining\nstate-of-the-art approaches for both forward tasks (molecule-to-spectrum\nprediction) and inverse tasks (spectrum-to-molecule inference). We trace the\nhistorical evolution of ML in spectroscopy, from early pattern recognition to\nthe latest foundation models capable of advanced reasoning, and offer a\ntaxonomy of representative neural architectures, including graph-based and\ntransformer-based methods. Addressing key challenges such as data quality,\nmultimodal integration, and computational scalability, we highlight emerging\ndirections such as synthetic data generation, large-scale pretraining, and few-\nor zero-shot learning. To foster reproducible research, we also release an\nopen-source repository containing recent papers and their corresponding curated\ndatasets (https://github.com/MINE-Lab-ND/SpectrumML_Survey_Papers). Our survey\nserves as a roadmap for researchers, guiding progress at the intersection of\nspectroscopy and AI.", "paper_summary_zh": "機器學習 (ML) 和人工智慧 (AI) 的快速發展\n催化了化學領域的重大轉變，然而將這些\n方法應用於光譜和光譜儀數據，稱為光譜\n機器學習 (SpectraML)，仍然相對未被充分探索。現代\n光譜技術 (MS、NMR、IR、拉曼、UV-Vis) 產生了不斷增長的\n高維數據量，對傳統基於專家的工作流程之外的自動化和\n智能分析產生了迫切需求。在此調查中，\n我們提供了 SpectraML 的統一回顧，系統地檢查\n最先進的方法，包括正向任務（分子到光譜\n預測）和逆向任務（光譜到分子推論）。我們追溯了\n光譜學中機器學習的歷史演變，從早期的模式識別到\n具有先進推理能力的最新基礎模型，並提供了一個\n代表性神經架構的分類，包括基於圖形和\n基於Transformer的的方法。針對數據質量、\n多模態整合和計算可擴展性等關鍵挑戰，我們重點介紹了新興\n方向，例如合成數據生成、大規模預訓練和少\n或零次學習。為了促進可重現的研究，我們還發布了一個\n開源倉庫，其中包含最近的論文及其對應的策展\n數據集 (https://github.com/MINE-Lab-ND/SpectrumML_Survey_Papers)。我們的調查\n作為研究人員的路線圖，指導光譜學和人工智能交叉領域的進展。", "author": "Kehan Guo et.al.", "authors": "Kehan Guo, Yili Shen, Gisela Abigail Gonzalez-Montiel, Yue Huang, Yujun Zhou, Mihir Surve, Zhichun Guo, Prayel Das, Nitesh V Chawla, Olaf Wiest, Xiangliang Zhang", "id": "2502.09897v1", "paper_url": "http://arxiv.org/abs/2502.09897v1", "repo": "null"}}