{"2502.13247": {"publish_time": "2025-02-18", "title": "Grounding LLM Reasoning with Knowledge Graphs", "paper_summary": "Knowledge Graphs (KGs) are valuable tools for representing relationships\nbetween entities in a structured format. Traditionally, these knowledge bases\nare queried to extract specific information. However, question-answering (QA)\nover such KGs poses a challenge due to the intrinsic complexity of natural\nlanguage compared to the structured format and the size of these graphs.\nDespite these challenges, the structured nature of KGs can provide a solid\nfoundation for grounding the outputs of Large Language Models (LLMs), offering\norganizations increased reliability and control.\n  Recent advancements in LLMs have introduced reasoning methods at inference\ntime to improve their performance and maximize their capabilities. In this\nwork, we propose integrating these reasoning strategies with KGs to anchor\nevery step or \"thought\" of the reasoning chains in KG data. Specifically, we\nevaluate both agentic and automated search methods across several reasoning\nstrategies, including Chain-of-Thought (CoT), Tree-of-Thought (ToT), and\nGraph-of-Thought (GoT), using GRBench, a benchmark dataset for graph reasoning\nwith domain-specific graphs. Our experiments demonstrate that this approach\nconsistently outperforms baseline models, highlighting the benefits of\ngrounding LLM reasoning processes in structured KG data.", "paper_summary_zh": "知識圖譜 (KG) 是以結構化格式表示實體之間關係的寶貴工具。傳統上，這些知識庫會被查詢以萃取特定資訊。然而，由於自然語言與結構化格式之間的內在複雜性，以及這些圖譜的規模，在這些 KG 上進行問答 (QA) 會構成挑戰。儘管有這些挑戰，KG 的結構化特性可以為大型語言模型 (LLM) 的輸出提供穩固的基礎，為組織提供更高的可靠性和控制力。\nLLM 的最新進展在推論時間引入了推理方法，以提升其效能並最大化其能力。在這項工作中，我們建議將這些推理策略與 KG 整合，以將推理鏈的每一步或「思考」錨定在 KG 資料中。具體來說，我們在多種推理策略中評估代理和自動化搜尋方法，包括思考鏈 (CoT)、思考樹 (ToT) 和思考圖 (GoT)，使用 GRBench，這是一個針對圖形推理的基準資料集，其中包含特定領域的圖形。我們的實驗證明，這種方法始終優於基準模型，突顯了將 LLM 推理過程建立在結構化 KG 資料中的好處。", "author": "Alfonso Amayuelas et.al.", "authors": "Alfonso Amayuelas, Joy Sain, Simerjot Kaur, Charese Smiley", "id": "2502.13247v1", "paper_url": "http://arxiv.org/abs/2502.13247v1", "repo": "null"}}