{"2409.07154": {"publish_time": "2024-09-11", "title": "Recurrent Aggregators in Neural Algorithmic Reasoning", "paper_summary": "Neural algorithmic reasoning (NAR) is an emerging field that seeks to design\nneural networks that mimic classical algorithmic computations. Today, graph\nneural networks (GNNs) are widely used in neural algorithmic reasoners due to\ntheir message passing framework and permutation equivariance. In this extended\nabstract, we challenge this design choice, and replace the equivariant\naggregation function with a recurrent neural network. While seemingly\ncounter-intuitive, this approach has appropriate grounding when nodes have a\nnatural ordering -- and this is the case frequently in established reasoning\nbenchmarks like CLRS-30. Indeed, our recurrent NAR (RNAR) model performs very\nstrongly on such tasks, while handling many others gracefully. A notable\nachievement of RNAR is its decisive state-of-the-art result on the Heapsort and\nQuickselect tasks, both deemed as a significant challenge for contemporary\nneural algorithmic reasoners -- especially the latter, where RNAR achieves a\nmean micro-F1 score of 87%.", "paper_summary_zh": "神經演算法推理 (NAR) 是一個新興領域，旨在設計模擬經典演算法運算的神經網路。現今，圖形神經網路 (GNN) 由於其訊息傳遞架構和排列等變性，廣泛用於神經演算法推理器中。在此延伸摘要中，我們挑戰此設計選擇，並以遞迴神經網路取代等變聚合函式。雖然看似反直覺，但當節點具有自然排序時，此方法有適當的基礎，而這在已建立的推理基準（如 CLRS-30）中很常見。事實上，我們的遞迴 NAR (RNAR) 模型在這些任務上表現得非常好，同時也能優雅地處理許多其他任務。RNAR 的一個顯著成就是其在堆排序和快速選擇任務上取得的決定性最新結果，這兩個任務都被視為當代神經演算法推理器的一項重大挑戰，特別是後者，RNAR 在此任務上取得了 87% 的平均微 F1 分數。", "author": "Kaijia Xu et.al.", "authors": "Kaijia Xu, Petar Veličković", "id": "2409.07154v1", "paper_url": "http://arxiv.org/abs/2409.07154v1", "repo": "null"}}