{"2412.03148": {"publish_time": "2024-12-04", "title": "Fine-Grained Behavior Simulation with Role-Playing Large Language Model on Social Media", "paper_summary": "Large language models (LLMs) have demonstrated impressive capabilities in\nrole-playing tasks. However, there is limited research on whether LLMs can\naccurately simulate user behavior in real-world scenarios, such as social\nmedia. This requires models to effectively analyze a user's history and\nsimulate their role. In this paper, we introduce \\textbf{FineRob}, a novel\nfine-grained behavior simulation dataset. We collect the complete behavioral\nhistory of 1,866 distinct users across three social media platforms. Each\nbehavior is decomposed into three fine-grained elements: object, type, and\ncontent, resulting in 78.6k QA records. Based on FineRob, we identify two\ndominant reasoning patterns in LLMs' behavior simulation processes and propose\nthe \\textbf{OM-CoT} fine-tuning method to enhance the capability. Through\ncomprehensive experiments, we conduct an in-depth analysis of key factors of\nbehavior simulation and also demonstrate the effectiveness of OM-CoT\napproach\\footnote{Code and dataset are available at\n\\url{https://github.com/linkseed18612254945/FineRob}}", "paper_summary_zh": "大型語言模型 (LLM) 已在角色扮演任務中展示了令人印象深刻的能力。然而，關於 LLM 是否可以在現實世界場景中準確模擬使用者行為（例如社交媒體）的研究有限。這需要模型有效分析使用者的歷史記錄並模擬其角色。在本文中，我們介紹了 FineRob，這是一個新穎的細粒度行為模擬數據集。我們收集了 1,866 個不同使用者在三個社交媒體平台上的完整行為歷史記錄。每個行為被分解為三個細粒度元素：對象、類型和內容，產生了 78.6k 個問答記錄。基於 FineRob，我們在 LLM 的行為模擬過程中識別了兩種主要的推理模式，並提出了 OM-CoT 微調方法來增強能力。通過全面的實驗，我們對行為模擬的關鍵因素進行了深入分析，並展示了 OM-CoT 方法的有效性。", "author": "Kun Li et.al.", "authors": "Kun Li, Chenwei Dai, Wei Zhou, Songlin Hu", "id": "2412.03148v1", "paper_url": "http://arxiv.org/abs/2412.03148v1", "repo": "https://github.com/linkseed18612254945/finerob"}}