{"2405.14838": {"publish_time": "2024-05-23", "title": "From Explicit CoT to Implicit CoT: Learning to Internalize CoT Step by Step", "paper_summary": "When leveraging language models for reasoning tasks, generating explicit\nchain-of-thought (CoT) steps often proves essential for achieving high accuracy\nin final outputs. In this paper, we investigate if models can be taught to\ninternalize these CoT steps. To this end, we propose a simple yet effective\nmethod for internalizing CoT steps: starting with a model trained for explicit\nCoT reasoning, we gradually remove the intermediate steps and finetune the\nmodel. This process allows the model to internalize the intermediate reasoning\nsteps, thus simplifying the reasoning process while maintaining high\nperformance. Our approach enables a GPT-2 Small model to solve 9-by-9\nmultiplication with up to 99% accuracy, whereas standard training cannot solve\nbeyond 4-by-4 multiplication. Furthermore, our method proves effective on\nlarger language models, such as Mistral 7B, achieving over 50% accuracy on\nGSM8K without producing any intermediate steps.", "paper_summary_zh": "在利用語言模型進行推理任務時，產生明確的思考鏈（CoT）步驟通常被證明對於在最終輸出中實現高準確度至關重要。在本文中，我們探討模型是否可以被教授內化這些 CoT 步驟。為此，我們提出了一種簡單但有效的內化 CoT 步驟的方法：從一個訓練用於明確 CoT 推理的模型開始，我們逐漸移除中間步驟並微調模型。此過程允許模型內化中間推理步驟，從而簡化推理過程，同時保持高性能。我們的做法使 GPT-2 Small 模型能夠以高達 99% 的準確度解決 9x9 乘法，而標準訓練無法解決 4x4 乘法以上的問題。此外，我們的做法被證明對大型語言模型（例如 Mistral 7B）有效，在 GSM8K 上實現了 50% 以上的準確度，而沒有產生任何中間步驟。", "author": "Yuntian Deng et.al.", "authors": "Yuntian Deng, Yejin Choi, Stuart Shieber", "id": "2405.14838v1", "paper_url": "http://arxiv.org/abs/2405.14838v1", "repo": "null"}}