{"2412.11620": {"publish_time": "2024-12-16", "title": "Combating Semantic Contamination in Learning with Label Noise", "paper_summary": "Noisy labels can negatively impact the performance of deep neural networks.\nOne common solution is label refurbishment, which involves reconstructing noisy\nlabels through predictions and distributions. However, these methods may\nintroduce problematic semantic associations, a phenomenon that we identify as\nSemantic Contamination. Through an analysis of Robust LR, a representative\nlabel refurbishment method, we found that utilizing the logits of views for\nrefurbishment does not adequately balance the semantic information of\nindividual classes. Conversely, using the logits of models fails to maintain\nconsistent semantic relationships across models, which explains why label\nrefurbishment methods frequently encounter issues related to Semantic\nContamination. To address this issue, we propose a novel method called\nCollaborative Cross Learning, which utilizes semi-supervised learning on\nrefurbished labels to extract appropriate semantic associations from embeddings\nacross views and models. Experimental results show that our method outperforms\nexisting approaches on both synthetic and real-world noisy datasets,\neffectively mitigating the impact of label noise and Semantic Contamination.", "paper_summary_zh": "有雜訊的標籤會對深度神經網路的效能造成負面影響。\n一種常見的解決方案是標籤修復，它涉及透過預測和分佈重建有雜訊的標籤。然而，這些方法可能會引入有問題的語義關聯，我們將此現象認定為語義污染。透過分析一個具代表性的標籤修復方法 Robust LR，我們發現利用檢視的 logit 進行修復並未適當地平衡各個類別的語義資訊。相反地，使用模型的 logit 無法在模型之間維持一致的語義關係，這解釋了為什麼標籤修復方法經常會遇到與語義污染相關的問題。為了解決這個問題，我們提出了一種稱為協同交叉學習的新方法，它利用半監督學習對修復後的標籤進行學習，以從檢視和模型中的嵌入中提取適當的語義關聯。實驗結果顯示，我們的模型在合成和真實世界雜訊資料集上都優於現有方法，有效減輕了標籤雜訊和語義污染的影響。", "author": "Wenxiao Fan et.al.", "authors": "Wenxiao Fan, Kan Li", "id": "2412.11620v1", "paper_url": "http://arxiv.org/abs/2412.11620v1", "repo": "null"}}