{"2411.05409": {"publish_time": "2024-11-08", "title": "Web Archives Metadata Generation with GPT-4o: Challenges and Insights", "paper_summary": "Current metadata creation for web archives is time consuming and costly due\nto reliance on human effort. This paper explores the use of gpt-4o for metadata\ngeneration within the Web Archive Singapore, focusing on scalability,\nefficiency, and cost effectiveness. We processed 112 Web ARChive (WARC) files\nusing data reduction techniques, achieving a notable 99.9% reduction in\nmetadata generation costs. By prompt engineering, we generated titles and\nabstracts, which were evaluated both intrinsically using Levenshtein Distance\nand BERTScore, and extrinsically with human cataloguers using McNemar's test.\nResults indicate that while our method offers significant cost savings and\nefficiency gains, human curated metadata maintains an edge in quality. The\nstudy identifies key challenges including content inaccuracies, hallucinations,\nand translation issues, suggesting that Large Language Models (LLMs) should\nserve as complements rather than replacements for human cataloguers. Future\nwork will focus on refining prompts, improving content filtering, and\naddressing privacy concerns through experimentation with smaller models. This\nresearch advances the integration of LLMs in web archiving, offering valuable\ninsights into their current capabilities and outlining directions for future\nenhancements. The code is available at\nhttps://github.com/masamune-prog/warc2summary for further development and use\nby institutions facing similar challenges.", "paper_summary_zh": "目前網路檔案的建立元資料十分耗時且昂貴，因為仰賴人力。本文探討在新加坡網路檔案中使用 gpt-4o 產生元資料，著重於可擴充性、效率和成本效益。我們使用資料減少技術處理了 112 個網路檔案 (WARC) 檔案，大幅降低了 99.9% 的元資料產生成本。透過提示工程，我們產生了標題和摘要，並使用 Levenshtein 距離和 BERTScore 內在評估，以及使用 McNemar 的檢定與人類分類員外在評估。結果顯示，雖然我們的方法提供了顯著的成本節省和效率提升，但人類策展的元資料在品質上仍有一定優勢。研究找出了一些關鍵挑戰，包括內容不正確、幻覺和翻譯問題，這表示大型語言模型 (LLM) 應該作為人類分類員的補充，而不是取代。未來的研究將專注於改善提示、提升內容過濾，並透過實驗較小的模型來解決隱私問題。這項研究推動了 LLM 在網路檔案中的整合，提供了有價值的見解，了解它們目前的效能，並概述了未來增強的方向。程式碼可在 https://github.com/masamune-prog/warc2summary 取得，供面臨類似挑戰的機構進一步開發和使用。", "author": "Abigail Yongping Huang et.al.", "authors": "Abigail Yongping Huang, Ashwin Nair, Zhen Rong Goh, Tianrui Liu", "id": "2411.05409v1", "paper_url": "http://arxiv.org/abs/2411.05409v1", "repo": "https://github.com/masamune-prog/warc2summary"}}