{"2407.21740": {"publish_time": "2024-07-31", "title": "Contrastive Factor Analysis", "paper_summary": "Factor analysis, often regarded as a Bayesian variant of matrix\nfactorization, offers superior capabilities in capturing uncertainty, modeling\ncomplex dependencies, and ensuring robustness. As the deep learning era\narrives, factor analysis is receiving less and less attention due to their\nlimited expressive ability. On the contrary, contrastive learning has emerged\nas a potent technique with demonstrated efficacy in unsupervised\nrepresentational learning. While the two methods are different paradigms,\nrecent theoretical analysis has revealed the mathematical equivalence between\ncontrastive learning and matrix factorization, providing a potential\npossibility for factor analysis combined with contrastive learning. Motivated\nby the interconnectedness of contrastive learning, matrix factorization, and\nfactor analysis, this paper introduces a novel Contrastive Factor Analysis\nframework, aiming to leverage factor analysis's advantageous properties within\nthe realm of contrastive learning. To further leverage the interpretability\nproperties of non-negative factor analysis, which can learn disentangled\nrepresentations, contrastive factor analysis is extended to a non-negative\nversion. Finally, extensive experimental validation showcases the efficacy of\nthe proposed contrastive (non-negative) factor analysis methodology across\nmultiple key properties, including expressiveness, robustness,\ninterpretability, and accurate uncertainty estimation.", "paper_summary_zh": "因子分析通常被視為矩陣分解的貝氏變體，在捕捉不確定性、建模複雜依賴關係和確保穩健性方面提供卓越的能力。隨著深度學習時代的到來，由於其表達能力有限，因子分析受到的關注越來越少。相反，對比學習已成為一種強有力的技術，在無監督表示學習中展現出顯著的功效。雖然這兩種方法是不同的範例，但最近的理論分析揭示了對比學習和矩陣分解之間的數學等價性，為結合對比學習的因子分析提供了潛在可能性。受對比學習、矩陣分解和因子分析之間的相互聯繫的啟發，本文介紹了一個新穎的對比因子分析框架，旨在利用因子分析在對比學習領域內的優勢屬性。為了進一步利用非負因子分析的可解釋性屬性（它可以學習解開的表示），對比因子分析被擴展到非負版本。最後，廣泛的實驗驗證展示了所提出的對比（非負）因子分析方法在多個關鍵屬性（包括表達性、穩健性、可解釋性和準確的不確定性估計）上的有效性。", "author": "Zhibin Duan et.al.", "authors": "Zhibin Duan, Tiansheng Wen, Yifei Wang, Chen Zhu, Bo Chen, Mingyuan Zhou", "id": "2407.21740v1", "paper_url": "http://arxiv.org/abs/2407.21740v1", "repo": "null"}}