{"2411.09547": {"publish_time": "2024-11-14", "title": "Piecing It All Together: Verifying Multi-Hop Multimodal Claims", "paper_summary": "Existing claim verification datasets often do not require systems to perform\ncomplex reasoning or effectively interpret multimodal evidence. To address\nthis, we introduce a new task: multi-hop multimodal claim verification. This\ntask challenges models to reason over multiple pieces of evidence from diverse\nsources, including text, images, and tables, and determine whether the combined\nmultimodal evidence supports or refutes a given claim. To study this task, we\nconstruct MMCV, a large-scale dataset comprising 16k multi-hop claims paired\nwith multimodal evidence, generated and refined using large language models,\nwith additional input from human feedback. We show that MMCV is challenging\neven for the latest state-of-the-art multimodal large language models,\nespecially as the number of reasoning hops increases. Additionally, we\nestablish a human performance benchmark on a subset of MMCV. We hope this\ndataset and its evaluation task will encourage future research in multimodal\nmulti-hop claim verification.", "paper_summary_zh": "現有的聲明驗證資料集通常不需要系統執行複雜的推理或有效地詮釋多模態證據。為了解決此問題，我們引入一個新任務：多跳多模態聲明驗證。此任務挑戰模型對來自不同來源（包括文字、圖像和表格）的多個證據進行推理，並確定組合的多模態證據是否支持或反駁給定的聲明。為了研究此任務，我們建構了 MMCV，一個包含 16k 個多跳聲明的大規模資料集，與多模態證據配對，使用大型語言模型生成和優化，並加入了人類回饋的額外輸入。我們證明 MMCV 即使對於最新的最先進多模態大型語言模型來說也很具有挑戰性，特別是隨著推理跳數的增加。此外，我們在 MMCV 的子集上建立了人類效能基準。我們希望此資料集及其評估任務將鼓勵未來在多模態多跳聲明驗證方面的研究。", "author": "Haoran Wang et.al.", "authors": "Haoran Wang, Aman Rangapur, Xiongxiao Xu, Yueqing Liang, Haroon Gharwi, Carl Yang, Kai Shu", "id": "2411.09547v1", "paper_url": "http://arxiv.org/abs/2411.09547v1", "repo": "null"}}