{"2407.08734": {"publish_time": "2024-07-11", "title": "Transformer Circuit Faithfulness Metrics are not Robust", "paper_summary": "Mechanistic interpretability work attempts to reverse engineer the learned\nalgorithms present inside neural networks. One focus of this work has been to\ndiscover 'circuits' -- subgraphs of the full model that explain behaviour on\nspecific tasks. But how do we measure the performance of such circuits? Prior\nwork has attempted to measure circuit 'faithfulness' -- the degree to which the\ncircuit replicates the performance of the full model. In this work, we survey\nmany considerations for designing experiments that measure circuit faithfulness\nby ablating portions of the model's computation. Concerningly, we find existing\nmethods are highly sensitive to seemingly insignificant changes in the ablation\nmethodology. We conclude that existing circuit faithfulness scores reflect both\nthe methodological choices of researchers as well as the actual components of\nthe circuit - the task a circuit is required to perform depends on the ablation\nused to test it. The ultimate goal of mechanistic interpretability work is to\nunderstand neural networks, so we emphasize the need for more clarity in the\nprecise claims being made about circuits. We open source a library at\nhttps://github.com/UFO-101/auto-circuit that includes highly efficient\nimplementations of a wide range of ablation methodologies and circuit discovery\nalgorithms.", "paper_summary_zh": "<paragraph>机制可解释性工作尝试对神经网络中存在的学习算法进行逆向工程。这项工作的重点之一是发现“电路”-- 完整模型的子图，它解释了特定任务的行为。但是，我们如何衡量此类电路的性能？先前的工作尝试测量电路“保真度”-- 电路复制完整模型性能的程度。在这项工作中，我们调查了许多考虑因素，用于设计通过消融模型计算部分来测量电路保真度的实验。令人担忧的是，我们发现现有方法对消融方法中看似微不足道的变化高度敏感。我们得出结论，现有的电路保真度得分反映了研究人员的方法论选择以及电路的实际组件 - 电路需要执行的任务取决于用于测试它的消融。机制可解释性工作的最终目标是理解神经网络，因此我们强调需要更清楚地阐述关于电路的具体主张。我们在 https://github.com/UFO-101/auto-circuit 开源了一个库，其中包括广泛的消融方法和电路发现算法的高效实现。</paragraph>", "author": "Joseph Miller et.al.", "authors": "Joseph Miller, Bilal Chughtai, William Saunders", "id": "2407.08734v1", "paper_url": "http://arxiv.org/abs/2407.08734v1", "repo": "https://github.com/ufo-101/auto-circuit"}}