{"2502.11817": {"publish_time": "2025-02-17", "title": "AAKT: Enhancing Knowledge Tracing with Alternate Autoregressive Modeling", "paper_summary": "Knowledge Tracing (KT) aims to predict students' future performances based on\ntheir former exercises and additional information in educational settings. KT\nhas received significant attention since it facilitates personalized\nexperiences in educational situations. Simultaneously, the autoregressive\nmodeling on the sequence of former exercises has been proven effective for this\ntask. One of the primary challenges in autoregressive modeling for Knowledge\nTracing is effectively representing the anterior (pre-response) and posterior\n(post-response) states of learners across exercises. Existing methods often\nemploy complex model architectures to update learner states using question and\nresponse records. In this study, we propose a novel perspective on knowledge\ntracing task by treating it as a generative process, consistent with the\nprinciples of autoregressive models. We demonstrate that knowledge states can\nbe directly represented through autoregressive encodings on a question-response\nalternate sequence, where model generate the most probable representation in\nhidden state space by analyzing history interactions. This approach underpins\nour framework, termed Alternate Autoregressive Knowledge Tracing (AAKT).\nAdditionally, we incorporate supplementary educational information, such as\nquestion-related skills, into our framework through an auxiliary task, and\ninclude extra exercise details, like response time, as additional inputs. Our\nproposed framework is implemented using advanced autoregressive technologies\nfrom Natural Language Generation (NLG) for both training and prediction.\nEmpirical evaluations on four real-world KT datasets indicate that AAKT\nconsistently outperforms all baseline models in terms of AUC, ACC, and RMSE.\nFurthermore, extensive ablation studies and visualized analysis validate the\neffectiveness of key components in AAKT.", "paper_summary_zh": "<paragraph>知識追蹤 (KT) 旨在根據學生的前次練習和教育環境中的額外資訊，預測學生的未來表現。KT 自從促進教育情境中的個人化體驗後，便備受關注。同時，前次練習序列上的自迴歸模型已被證明對此任務有效。知識追蹤中自迴歸模型的主要挑戰之一，是有效表示學習者在各項練習中的先驗 (反應前) 和後驗 (反應後) 狀態。現有方法通常採用複雜的模型架構，使用問題和反應記錄來更新學習者狀態。在本研究中，我們提出了一個關於知識追蹤任務的新觀點，將其視為一個生成過程，與自迴歸模型的原理一致。我們證明了知識狀態可以直接透過問答交替序列上的自迴歸編碼來表示，其中模型透過分析歷史互動來生成隱藏狀態空間中最可能的表示。此方法支撐了我們的架構，稱為交替自迴歸知識追蹤 (AAKT)。此外，我們透過輔助任務將補充教育資訊（例如與問題相關的技能）納入我們的架構，並將額外練習細節（例如反應時間）納入額外輸入。我們提出的架構是使用自然語言生成 (NLG) 的先進自迴歸技術，用於訓練和預測。對四個真實世界的 KT 資料集進行的經驗評估表明，AAKT 在 AUC、ACC 和 RMSE 方面始終優於所有基準模型。此外，廣泛的消融研究和視覺化分析驗證了 AAKT 中關鍵組件的有效性。</paragraph>", "author": "Hao Zhou et.al.", "authors": "Hao Zhou, Wenge Rong, Jianfei Zhang, Qing Sun, Yuanxin Ouyang, Zhang Xiong", "id": "2502.11817v1", "paper_url": "http://arxiv.org/abs/2502.11817v1", "repo": "null"}}