{"2502.04308": {"publish_time": "2025-02-06", "title": "HOG-Diff: Higher-Order Guided Diffusion for Graph Generation", "paper_summary": "Graph generation is a critical yet challenging task as empirical analyses\nrequire a deep understanding of complex, non-Euclidean structures. Although\ndiffusion models have recently made significant achievements in graph\ngeneration, these models typically adapt from the frameworks designed for image\ngeneration, making them ill-suited for capturing the topological properties of\ngraphs. In this work, we propose a novel Higher-order Guided Diffusion\n(HOG-Diff) model that follows a coarse-to-fine generation curriculum and is\nguided by higher-order information, enabling the progressive generation of\nplausible graphs with inherent topological structures. We further prove that\nour model exhibits a stronger theoretical guarantee than classical diffusion\nframeworks. Extensive experiments on both molecular and generic graph\ngeneration tasks demonstrate that our method consistently outperforms or\nremains competitive with state-of-the-art baselines. Our code is available at\nhttps://github.com/Yiminghh/HOG-Diff.", "paper_summary_zh": "圖形生成是一項至關重要的任務，但由於經驗分析需要對複雜的非歐幾何結構有深入的了解，因此具有挑戰性。儘管擴散模型最近在圖形生成方面取得了顯著進展，但這些模型通常會根據為圖像生成設計的框架進行調整，這使得它們不適合捕捉圖形的拓撲屬性。在這項工作中，我們提出了一個新的高階引導擴散 (HOG-Diff) 模型，它遵循從粗到精的生成課程，並由高階資訊引導，能夠逐步生成具有內在拓撲結構的合理圖形。我們進一步證明，我們的模型比經典擴散框架具有更強的理論保證。在分子和通用圖形生成任務上的大量實驗表明，我們的模型始終優於或與最先進的基準保持競爭力。我們的程式碼可在 https://github.com/Yiminghh/HOG-Diff 取得。", "author": "Yiming Huang et.al.", "authors": "Yiming Huang, Tolga Birdal", "id": "2502.04308v1", "paper_url": "http://arxiv.org/abs/2502.04308v1", "repo": "null"}}