{"2408.11749": {"publish_time": "2024-08-21", "title": "Against All Odds: Overcoming Typology, Script, and Language Confusion in Multilingual Embedding Inversion Attacks", "paper_summary": "Large Language Models (LLMs) are susceptible to malicious influence by cyber\nattackers through intrusions such as adversarial, backdoor, and embedding\ninversion attacks. In response, the burgeoning field of LLM Security aims to\nstudy and defend against such threats. Thus far, the majority of works in this\narea have focused on monolingual English models, however, emerging research\nsuggests that multilingual LLMs may be more vulnerable to various attacks than\ntheir monolingual counterparts. While previous work has investigated embedding\ninversion over a small subset of European languages, it is challenging to\nextrapolate these findings to languages from different linguistic families and\nwith differing scripts. To this end, we explore the security of multilingual\nLLMs in the context of embedding inversion attacks and investigate\ncross-lingual and cross-script inversion across 20 languages, spanning over 8\nlanguage families and 12 scripts. Our findings indicate that languages written\nin Arabic script and Cyrillic script are particularly vulnerable to embedding\ninversion, as are languages within the Indo-Aryan language family. We further\nobserve that inversion models tend to suffer from language confusion, sometimes\ngreatly reducing the efficacy of an attack. Accordingly, we systematically\nexplore this bottleneck for inversion models, uncovering predictable patterns\nwhich could be leveraged by attackers. Ultimately, this study aims to further\nthe field's understanding of the outstanding security vulnerabilities facing\nmultilingual LLMs and raise awareness for the languages most at risk of\nnegative impact from these attacks.", "paper_summary_zh": "大型語言模型 (LLM) 容易受到網路攻擊者的惡意影響，例如對抗性、後門和嵌入式反轉攻擊等入侵。為了解決這個問題，新興的 LLM 安全領域旨在研究和防禦此類威脅。到目前為止，這個領域的大多數研究都集中在單語的英文模型上，然而，新興的研究表明，多語言 LLM 可能比單語的 LLM 更容易受到各種攻擊。雖然先前的研究已經調查了對少數歐洲語言的嵌入式反轉，但很難將這些發現推廣到來自不同語言家族且具有不同腳本的語言。為此，我們在嵌入式反轉攻擊的背景下探討多語言 LLM 的安全性，並調查跨 20 種語言的跨語言和跨腳本反轉，涵蓋超過 8 個語言家族和 12 種腳本。我們的研究結果表明，使用阿拉伯文字和西里爾文字書寫的語言特別容易受到嵌入式反轉的影響，印歐語系語言也是如此。我們進一步觀察到，反轉模型往往會出現語言混淆，有時會大大降低攻擊的效力。因此，我們系統地探討了反轉模型的這個瓶頸，揭示了攻擊者可以利用的可預測模式。最終，本研究旨在進一步加深該領域對多語言 LLM 面臨的突出安全漏洞的理解，並提高對這些攻擊最容易造成負面影響的語言的認識。", "author": "Yiyi Chen et.al.", "authors": "Yiyi Chen, Russa Biswas, Heather Lent, Johannes Bjerva", "id": "2408.11749v1", "paper_url": "http://arxiv.org/abs/2408.11749v1", "repo": "null"}}