{"2412.16022": {"publish_time": "2024-12-20", "title": "The Only Way is Ethics: A Guide to Ethical Research with Large Language Models", "paper_summary": "There is a significant body of work looking at the ethical considerations of\nlarge language models (LLMs): critiquing tools to measure performance and\nharms; proposing toolkits to aid in ideation; discussing the risks to workers;\nconsidering legislation around privacy and security etc. As yet there is no\nwork that integrates these resources into a single practical guide that focuses\non LLMs; we attempt this ambitious goal. We introduce 'LLM Ethics Whitepaper',\nwhich we provide as an open and living resource for NLP practitioners, and\nthose tasked with evaluating the ethical implications of others' work. Our goal\nis to translate ethics literature into concrete recommendations and\nprovocations for thinking with clear first steps, aimed at computer scientists.\n'LLM Ethics Whitepaper' distils a thorough literature review into clear Do's\nand Don'ts, which we present also in this paper. We likewise identify useful\ntoolkits to support ethical work. We refer the interested reader to the full\nLLM Ethics Whitepaper, which provides a succinct discussion of ethical\nconsiderations at each stage in a project lifecycle, as well as citations for\nthe hundreds of papers from which we drew our recommendations. The present\npaper can be thought of as a pocket guide to conducting ethical research with\nLLMs.", "paper_summary_zh": "有大量研究探討大型語言模型 (LLM) 的道德考量：批判用於衡量效能和危害的工具；提出有助於發想點子的工具組；討論對工作者的風險；考量與隱私和安全相關的法規等。目前尚未有將這些資源整合到單一實用指南中的研究，而我們嘗試達成這個雄心勃勃的目標。我們推出「LLM 倫理白皮書」，我們將其提供給 NLP 從業人員和負責評估他人工作中倫理意涵的人員，作為開放且活的資源。我們的目標是將倫理文獻轉化為具體的建議和思考的挑釁，並針對電腦科學家提出明確的第一步。LLM 倫理白皮書將徹底的文獻回顧提煉成明確的應為和不應為，我們也會在本文中呈現。我們同樣找出有助於倫理工作的有用工具組。我們請有興趣的讀者參閱完整的 LLM 倫理白皮書，其中簡潔地討論專案生命週期中每個階段的倫理考量，以及我們從中汲取建議的數百篇論文的引文。本文可被視為使用 LLM 進行倫理研究的口袋指南。", "author": "Eddie L. Ungless et.al.", "authors": "Eddie L. Ungless, Nikolas Vitsakis, Zeerak Talat, James Garforth, Björn Ross, Arno Onken, Atoosa Kasirzadeh, Alexandra Birch", "id": "2412.16022v1", "paper_url": "http://arxiv.org/abs/2412.16022v1", "repo": "https://github.com/mxeddie/ethics-whitepaper"}}