{"2405.04108": {"publish_time": "2024-05-07", "title": "A2-DIDM: Privacy-preserving Accumulator-enabled Auditing for Distributed Identity of DNN Model", "paper_summary": "Recent booming development of Generative Artificial Intelligence (GenAI) has\nfacilitated an emerging model commercialization for the purpose of\nreinforcement on model performance, such as licensing or trading Deep Neural\nNetwork (DNN) models. However, DNN model trading may trigger concerns of the\nunauthorized replications or misuses over the model, so that the benefit of the\nmodel ownership will be violated. Model identity auditing is a challenging\nissue in protecting intellectual property of DNN models and verifying the\nintegrity and ownership of models for guaranteeing trusts in transactions is\none of the critical obstacles. In this paper, we focus on the above issue and\npropose a novel Accumulator-enabled Auditing for Distributed Identity of DNN\nModel (A2-DIDM) that utilizes blockchain and zero-knowledge techniques to\nprotect data and function privacy while ensuring the lightweight on-chain\nownership verification. The proposed model presents a scheme of identity\nrecords via configuring model weight checkpoints with corresponding\nzero-knowledge proofs, which incorporates predicates to capture incremental\nstate changes in model weight checkpoints. Our scheme ensures both\ncomputational integrity of DNN training process and programmability, so that\nthe uniqueness of the weight checkpoint sequence in a DNN model is preserved,\nensuring the correctness of the model identity auditing. In addition, A2-DIDM\nalso addresses privacy protections in distributed identity via a proposed\nmethod of accumulators. We systematically analyze the security and robustness\nof our proposed model and further evaluate the effectiveness and usability of\nauditing DNN model identities.", "paper_summary_zh": "最近生成式人工智能 (GenAI) 的蓬勃發展\n促進了新興模式商業化，以加強模型效能，例如授權或交易深度神經網路 (DNN) 模型。然而，DNN 模型交易可能會引發對未經授權複製或濫用模型的擔憂，因此模型所有權的好處將會受到侵犯。模型身分稽核是保護 DNN 模型智慧財產權的一項挑戰，而驗證模型的完整性和所有權以保證交易中的信任是關鍵障礙之一。在本文中，我們專注於上述問題，並提出一個新的累加器啟用 DNN 模型分佈式身分稽核 (A2-DIDM)，利用區塊鏈和零知識技術來保護資料和功能隱私，同時確保輕量級的鏈上所有權驗證。所提出的模型提出了一個身分記錄方案，通過使用對應的零知識證明配置模型權重檢查點，其中包含了用於擷取模型權重檢查點中增量狀態變化的謂詞。我們的方案確保了 DNN 訓練過程的計算完整性和可程式性，從而保留了 DNN 模型中權重檢查點序列的唯一性，確保了模型身分稽核的正確性。此外，A2-DIDM 還通過提出的累加器方法來解決分佈式身分中的隱私保護。我們系統地分析了我們所提出的模型的安全性與穩健性，並進一步評估了稽核 DNN 模型身分的有效性和可用性。", "author": "Tianxiu Xie et.al.", "authors": "Tianxiu Xie, Keke Gai, Jing Yu, Liehuang Zhu, Kim-Kwang Raymond Choo", "id": "2405.04108v1", "paper_url": "http://arxiv.org/abs/2405.04108v1", "repo": "null"}}