{"2501.04694": {"publish_time": "2025-01-08", "title": "EpiCoder: Encompassing Diversity and Complexity in Code Generation", "paper_summary": "Effective instruction tuning is indispensable for optimizing code LLMs,\naligning model behavior with user expectations and enhancing model performance\nin real-world applications. However, most existing methods focus on code\nsnippets, which are limited to specific functionalities and rigid structures,\nrestricting the complexity and diversity of the synthesized data. To address\nthese limitations, we introduce a novel feature tree-based synthesis framework\ninspired by Abstract Syntax Trees (AST). Unlike AST, which captures syntactic\nstructure of code, our framework models semantic relationships between code\nelements, enabling the generation of more nuanced and diverse data. The feature\ntree is constructed from raw data and refined iteratively to increase the\nquantity and diversity of the extracted features. This process enables the\nidentification of more complex patterns and relationships within the code. By\nsampling subtrees with controlled depth and breadth, our framework allows\nprecise adjustments to the complexity of the generated code, supporting a wide\nrange of tasks from simple function-level operations to intricate multi-file\nscenarios. We fine-tuned widely-used base models to create the EpiCoder series,\nachieving state-of-the-art performance at both the function and file levels\nacross multiple benchmarks. Notably, empirical evidence indicates that our\napproach shows significant potential in synthesizing highly complex\nrepository-level code data. Further analysis elucidates the merits of this\napproach by rigorously assessing data complexity and diversity through software\nengineering principles and LLM-as-a-judge method.", "paper_summary_zh": "有效的指令調整對於最佳化程式碼 LLM 至關重要，可將模型行為與使用者預期保持一致，並提升模型在實際應用中的效能。然而，現有的方法大多著重於程式碼片段，僅限於特定功能和僵化的結構，限制了合成資料的複雜性和多樣性。為了解決這些限制，我們引入一種新穎的基於特徵樹的合成架構，靈感來自抽象語法樹 (AST)。與擷取程式碼語法結構的 AST 不同，我們的架構會對程式碼元素之間的語意關係建模，能夠產生更細緻且多樣化的資料。特徵樹是由原始資料建構而成，並反覆精煉以增加提取特徵的數量和多樣性。此程序能識別程式碼中更複雜的模式和關係。透過以受控深度和廣度取樣子樹，我們的架構允許精確調整產生程式碼的複雜度，支援從簡單函式層級操作到複雜多檔案場景的各種任務。我們微調廣泛使用的基礎模型以建立 EpiCoder 系列，在函式和檔案層級上於多個基準測試中達成最先進的效能。值得注意的是，實證證據顯示，我們的做法在合成高度複雜的儲存庫層級程式碼資料方面具有顯著的潛力。進一步的分析透過軟體工程原則和 LLM 作為評判方法，嚴謹地評估資料的複雜性和多樣性，闡明此方法的優點。", "author": "Yaoxiang Wang et.al.", "authors": "Yaoxiang Wang, Haoling Li, Xin Zhang, Jie Wu, Xiao Liu, Wenxiang Hu, Zhongxin Guo, Yangyu Huang, Ying Xin, Yujiu Yang, Jinsong Su, Qi Chen, Scarlett Li", "id": "2501.04694v1", "paper_url": "http://arxiv.org/abs/2501.04694v1", "repo": "null"}}