{"2410.05099": {"publish_time": "2024-10-07", "title": "Investigating large language models for their competence in extracting grammatically sound sentences from transcribed noisy utterances", "paper_summary": "Selectively processing noisy utterances while effectively disregarding\nspeech-specific elements poses no considerable challenge for humans, as they\nexhibit remarkable cognitive abilities to separate semantically significant\ncontent from speech-specific noise (i.e. filled pauses, disfluencies, and\nrestarts). These abilities may be driven by mechanisms based on acquired\ngrammatical rules that compose abstract syntactic-semantic structures within\nutterances. Segments without syntactic and semantic significance are\nconsistently disregarded in these structures. The structures, in tandem with\nlexis, likely underpin language comprehension and thus facilitate effective\ncommunication. In our study, grounded in linguistically motivated experiments,\nwe investigate whether large language models (LLMs) can effectively perform\nanalogical speech comprehension tasks. In particular, we examine the ability of\nLLMs to extract well-structured utterances from transcriptions of noisy\ndialogues. We conduct two evaluation experiments in the Polish language\nscenario, using a~dataset presumably unfamiliar to LLMs to mitigate the risk of\ndata contamination. Our results show that not all extracted utterances are\ncorrectly structured, indicating that either LLMs do not fully acquire\nsyntactic-semantic rules or they acquire them but cannot apply them\neffectively. We conclude that the ability of LLMs to comprehend noisy\nutterances is still relatively superficial compared to human proficiency in\nprocessing them.", "paper_summary_zh": "有选择地处理嘈杂的言语，同时有效地忽略特定于语音的元素，对人类来说并不是一个很大的挑战，因为他们表现出非凡的认知能力，可以将语义上重要的内容与特定于语音的噪音（即填充停顿、言语失利和重新开始）分开。这些能力可能是由基于习得的语法规则的机制驱动的，这些规则在言语中构成抽象的句法语义结构。在这些结构中，没有句法和语义意义的片段始终被忽略。这些结构与词汇一起，可能支撑着语言理解，从而促进有效的沟通。在我们的研究中，基于语言学动机的实验，我们调查了大型语言模型 (LLM) 是否可以有效地执行类比语音理解任务。特别是，我们研究了 LLM 从嘈杂对话的转录中提取结构良好的言语的能力。我们在波兰语场景中进行了两个评估实验，使用 LLM 可能不熟悉的~数据集来减轻数据污染的风险。我们的结果表明，并非所有提取的言语都结构正确，这表明 LLM 或者没有完全习得句法语义规则，或者习得了这些规则但无法有效地应用它们。我们得出结论，与人类处理嘈杂言语的能力相比，LLM 理解嘈杂言语的能力仍然相对肤浅。", "author": "Alina Wróblewska et.al.", "authors": "Alina Wróblewska", "id": "2410.05099v1", "paper_url": "http://arxiv.org/abs/2410.05099v1", "repo": "null"}}