{"2408.02711": {"publish_time": "2024-08-05", "title": "Text Conditioned Symbolic Drumbeat Generation using Latent Diffusion Models", "paper_summary": "This study introduces a text-conditioned approach to generating drumbeats\nwith Latent Diffusion Models (LDMs). It uses informative conditioning text\nextracted from training data filenames. By pretraining a text and drumbeat\nencoder through contrastive learning within a multimodal network, aligned\nfollowing CLIP, we align the modalities of text and music closely.\nAdditionally, we examine an alternative text encoder based on multihot text\nencodings. Inspired by musics multi-resolution nature, we propose a novel LSTM\nvariant, MultiResolutionLSTM, designed to operate at various resolutions\nindependently. In common with recent LDMs in the image space, it speeds up the\ngeneration process by running diffusion in a latent space provided by a\npretrained unconditional autoencoder. We demonstrate the originality and\nvariety of the generated drumbeats by measuring distance (both over binary\npianorolls and in the latent space) versus the training dataset and among the\ngenerated drumbeats. We also assess the generated drumbeats through a listening\ntest focused on questions of quality, aptness for the prompt text, and novelty.\nWe show that the generated drumbeats are novel and apt to the prompt text, and\ncomparable in quality to those created by human musicians.", "paper_summary_zh": "本研究引入一種以文字為條件的方法，用潛在擴散模型 (LDM) 產生鼓點。它使用從訓練資料檔名中提取的資訊性條件文字。透過在多模態網路中使用對比學習預訓練文字和鼓點編碼器，並按照 CLIP 對齊，我們緊密對齊文字和音樂的模態。此外，我們探討一種基於多熱文字編碼的替代文字編碼器。受音樂的多解析度特性的啟發，我們提出一個新穎的 LSTM 變體 MultiResolutionLSTM，旨在獨立運作於各種解析度。與影像空間中最近的 LDM 相同，它透過在預訓練無條件自動編碼器提供的潛在空間中執行擴散來加速生成過程。我們透過測量距離（在二進制鋼琴捲軸和潛在空間中）相對於訓練資料集和生成的鼓點，來證明生成鼓點的獨創性和多樣性。我們還透過專注於品質、對提示文字的適當性和新穎性的聆聽測試評估生成的鼓點。我們展示生成的鼓點新穎且適於提示文字，並且品質與人類音樂家創作的鼓點相當。", "author": "Pushkar Jajoria et.al.", "authors": "Pushkar Jajoria, James McDermott", "id": "2408.02711v1", "paper_url": "http://arxiv.org/abs/2408.02711v1", "repo": "null"}}