{"2408.01808": {"publish_time": "2024-08-03", "title": "ALIF: Low-Cost Adversarial Audio Attacks on Black-Box Speech Platforms using Linguistic Features", "paper_summary": "Extensive research has revealed that adversarial examples (AE) pose a\nsignificant threat to voice-controllable smart devices. Recent studies have\nproposed black-box adversarial attacks that require only the final\ntranscription from an automatic speech recognition (ASR) system. However, these\nattacks typically involve many queries to the ASR, resulting in substantial\ncosts. Moreover, AE-based adversarial audio samples are susceptible to ASR\nupdates. In this paper, we identify the root cause of these limitations, namely\nthe inability to construct AE attack samples directly around the decision\nboundary of deep learning (DL) models. Building on this observation, we propose\nALIF, the first black-box adversarial linguistic feature-based attack pipeline.\nWe leverage the reciprocal process of text-to-speech (TTS) and ASR models to\ngenerate perturbations in the linguistic embedding space where the decision\nboundary resides. Based on the ALIF pipeline, we present the ALIF-OTL and\nALIF-OTA schemes for launching attacks in both the digital domain and the\nphysical playback environment on four commercial ASRs and voice assistants.\nExtensive evaluations demonstrate that ALIF-OTL and -OTA significantly improve\nquery efficiency by 97.7% and 73.3%, respectively, while achieving competitive\nperformance compared to existing methods. Notably, ALIF-OTL can generate an\nattack sample with only one query. Furthermore, our test-of-time experiment\nvalidates the robustness of our approach against ASR updates.", "paper_summary_zh": "廣泛的研究顯示，對抗範例 (AE) 對語音控制智慧裝置構成重大威脅。最近的研究提出了黑盒對抗攻擊，僅需要自動語音辨識 (ASR) 系統的最終轉錄。然而，這些攻擊通常涉及對 ASR 的大量查詢，導致成本高昂。此外，基於 AE 的對抗性音訊範例容易受到 ASR 更新的影響。在本文中，我們找出這些限制的根本原因，即無法直接在深度學習 (DL) 模型的決策邊界周圍建構 AE 攻擊範例。根據此觀察，我們提出 ALIF，這是第一個基於黑盒對抗語言特徵的攻擊管道。我們利用文字轉語音 (TTS) 和 ASR 模型的互惠程序，在決策邊界所在的語言嵌入空間中產生擾動。根據 ALIF 管道，我們提出 ALIF-OTL 和 ALIF-OTA 計畫，在數位領域和實體播放環境中對四個商用 ASR 和語音助理發動攻擊。廣泛的評估顯示，與現有方法相比，ALIF-OTL 和 -OTA 分別顯著提高了 97.7% 和 73.3% 的查詢效率，同時達到了競爭力的效能。值得注意的是，ALIF-OTL 僅能透過一次查詢產生一個攻擊範例。此外，我們的時間測試實驗驗證了我們的方法對抗 ASR 更新的穩健性。", "author": "Peng Cheng et.al.", "authors": "Peng Cheng, Yuwei Wang, Peng Huang, Zhongjie Ba, Xiaodong Lin, Feng Lin, Li Lu, Kui Ren", "id": "2408.01808v1", "paper_url": "http://arxiv.org/abs/2408.01808v1", "repo": "null"}}