{"2410.07675": {"publish_time": "2024-10-10", "title": "Adversarial Robustness Overestimation and Instability in TRADES", "paper_summary": "This paper examines the phenomenon of probabilistic robustness overestimation\nin TRADES, a prominent adversarial training method. Our study reveals that\nTRADES sometimes yields disproportionately high PGD validation accuracy\ncompared to the AutoAttack testing accuracy in the multiclass classification\ntask. This discrepancy highlights a significant overestimation of robustness\nfor these instances, potentially linked to gradient masking. We further analyze\nthe parameters contributing to unstable models that lead to overestimation. Our\nfindings indicate that smaller batch sizes, lower beta values (which control\nthe weight of the robust loss term in TRADES), larger learning rates, and\nhigher class complexity (e.g., CIFAR-100 versus CIFAR-10) are associated with\nan increased likelihood of robustness overestimation. By examining metrics such\nas the First-Order Stationary Condition (FOSC), inner-maximization, and\ngradient information, we identify the underlying cause of this phenomenon as\ngradient masking and provide insights into it. Furthermore, our experiments\nshow that certain unstable training instances may return to a state without\nrobust overestimation, inspiring our attempts at a solution. In addition to\nadjusting parameter settings to reduce instability or retraining when\noverestimation occurs, we recommend incorporating Gaussian noise in inputs when\nthe FOSC score exceed the threshold. This method aims to mitigate robustness\noverestimation of TRADES and other similar methods at its source, ensuring more\nreliable representation of adversarial robustness during evaluation.", "paper_summary_zh": "這篇論文探討了 TRADES 中機率穩健性高估的現象，TRADES 是一種著名的對抗性訓練方法。我們的研究顯示，在多類別分類任務中，與 AutoAttack 測試準確度相比，TRADES 有時會產生不成比例的高 PGD 驗證準確度。這種差異突顯了對這些實例的穩健性高估，可能與梯度遮蔽有關。我們進一步分析了導致高估的不穩定模型的參數。我們的發現表明，較小的批次大小、較低的 beta 值（控制 TRADES 中穩健損失項的權重）、較高的學習率和較高的類別複雜度（例如，CIFAR-100 與 CIFAR-10）與穩健性高估的可能性增加有關。通過檢查一階平穩條件 (FOSC)、內部最大化和梯度資訊等指標，我們將這種現象的根本原因確定為梯度遮蔽，並對其提供了見解。此外，我們的實驗表明，某些不穩定的訓練實例可能會返回到沒有穩健高估的狀態，這激發了我們嘗試解決方案。除了調整參數設定以減少不穩定性或在發生高估時重新訓練之外，我們建議在 FOSC 分數超過閾值時在輸入中加入高斯噪聲。這種方法旨在從源頭減輕 TRADES 和其他類似方法的穩健性高估，確保在評估過程中更可靠地表示對抗性穩健性。", "author": "Jonathan Weiping Li et.al.", "authors": "Jonathan Weiping Li, Ren-Wei Liang, Cheng-Han Yeh, Cheng-Chang Tsai, Kuanchun Yu, Chun-Shien Lu, Shang-Tse Chen", "id": "2410.07675v1", "paper_url": "http://arxiv.org/abs/2410.07675v1", "repo": "null"}}