{"2411.08733": {"publish_time": "2024-11-13", "title": "Dynamic Rewarding with Prompt Optimization Enables Tuning-free Self-Alignment of Language Models", "paper_summary": "Aligning Large Language Models (LLMs) traditionally relies on costly training\nand human preference annotations. Self-alignment seeks to reduce these expenses\nby enabling models to align themselves. To further lower costs and achieve\nalignment without any expensive tuning or annotations, we introduce a new\ntuning-free approach for self-alignment, Dynamic Rewarding with Prompt\nOptimization (\\ours). Our approach leverages a search-based optimization\nframework that allows LLMs to iteratively self-improve and craft the optimal\nalignment instructions, all without additional training or human intervention.\nThe core of \\ours is a dynamic rewarding mechanism, which identifies and\nrectifies model-specific alignment weaknesses, allowing LLMs to adapt\nefficiently to diverse alignment challenges. Empirical evaluations on eight\nrecent LLMs, both open- and closed-sourced, demonstrate that \\ours\nsignificantly enhances alignment performance, with base models outperforming\ntheir SFT/RLHF-tuned counterparts. Moreover, the prompts automatically\noptimized by \\ours surpass those curated by human experts, further validating\nthe effectiveness of our approach. Our findings highlight the great potential\nof current LLMs to achieve adaptive self-alignment through inference-time\noptimization, complementing tuning-based alignment methods.", "paper_summary_zh": "大型語言模型（LLM）的對齊傳統上依賴於昂貴的訓練和人工偏好註解。自我對齊試圖通過使模型能夠自我對齊來降低這些費用。為了進一步降低成本並在沒有任何昂貴的調整或註解的情況下實現對齊，我們引入了一種新的無調整自我對齊方法，即帶提示優化的動態獎勵（\\ours）。我們的做法利用了一個基於搜索的優化框架，允許 LLM 迭代式地自我改進並制定最佳對齊指令，所有這些都不需要額外的訓練或人工干預。\\ours 的核心是一個動態獎勵機制，它識別和糾正特定於模型的對齊弱點，允許 LLM 有效地適應不同的對齊挑戰。對八種最近的 LLM（包括開源和閉源）進行的經驗評估表明，\\ours顯著提高了對齊性能，基本模型優於經過 SFT/RLHF 調整的模型。此外，由 \\ours 自動優化的提示優於由人類專家策劃的提示，進一步驗證了我們方法的有效性。我們的發現強調了當前 LLM 通過推理時間優化實現自適應自我對齊的巨大潛力，補充了基於調整的對齊方法。", "author": "Somanshu Singla et.al.", "authors": "Somanshu Singla, Zhen Wang, Tianyang Liu, Abdullah Ashfaq, Zhiting Hu, Eric P. Xing", "id": "2411.08733v1", "paper_url": "http://arxiv.org/abs/2411.08733v1", "repo": "null"}}