{"2407.20990": {"publish_time": "2024-07-30", "title": "From Feature Importance to Natural Language Explanations Using LLMs with RAG", "paper_summary": "As machine learning becomes increasingly integral to autonomous\ndecision-making processes involving human interaction, the necessity of\ncomprehending the model's outputs through conversational means increases. Most\nrecently, foundation models are being explored for their potential as post hoc\nexplainers, providing a pathway to elucidate the decision-making mechanisms of\npredictive models. In this work, we introduce traceable question-answering,\nleveraging an external knowledge repository to inform the responses of Large\nLanguage Models (LLMs) to user queries within a scene understanding task. This\nknowledge repository comprises contextual details regarding the model's output,\ncontaining high-level features, feature importance, and alternative\nprobabilities. We employ subtractive counterfactual reasoning to compute\nfeature importance, a method that entails analysing output variations resulting\nfrom decomposing semantic features. Furthermore, to maintain a seamless\nconversational flow, we integrate four key characteristics - social, causal,\nselective, and contrastive - drawn from social science research on human\nexplanations into a single-shot prompt, guiding the response generation\nprocess. Our evaluation demonstrates that explanations generated by the LLMs\nencompassed these elements, indicating its potential to bridge the gap between\ncomplex model outputs and natural language expressions.", "paper_summary_zh": "隨著機器學習在涉及人類互動的自主決策過程中變得越來越不可或缺，透過對話方式理解模型輸出的必要性也隨之增加。最近，基礎模型正因其作為事後解釋器的潛力而受到探索，為闡明預測模型的決策機制提供了一條途徑。在這項工作中，我們引入了可追溯的問答，利用外部知識庫為大型語言模型 (LLM) 在場景理解任務中對使用者查詢的回應提供資訊。這個知識庫包含有關模型輸出的背景詳細資料，包含高階特徵、特徵重要性以及替代機率。我們採用減法反事實推理來計算特徵重要性，這是一種需要分析由語義特徵分解產生的輸出變化的方法。此外，為了維持無縫的對話流程，我們將來自人類解釋社會科學研究的四個關鍵特徵（社會、因果、選擇和對比）整合到單次提示中，引導回應產生過程。我們的評估表明，LLM 生成的解釋涵蓋了這些元素，這表明它有可能彌合複雜模型輸出與自然語言表達之間的差距。", "author": "Sule Tekkesinoglu et.al.", "authors": "Sule Tekkesinoglu, Lars Kunze", "id": "2407.20990v1", "paper_url": "http://arxiv.org/abs/2407.20990v1", "repo": "null"}}