{"2406.04671": {"publish_time": "2024-06-07", "title": "The Reasonable Person Standard for AI", "paper_summary": "As AI systems are increasingly incorporated into domains where human behavior\nhas set the norm, a challenge for AI governance and AI alignment research is to\nregulate their behavior in a way that is useful and constructive for society.\nOne way to answer this question is to ask: how do we govern the human behavior\nthat the models are emulating? To evaluate human behavior, the American legal\nsystem often uses the \"Reasonable Person Standard.\" The idea of \"reasonable\"\nbehavior comes up in nearly every area of law. The legal system often judges\nthe actions of parties with respect to what a reasonable person would have done\nunder similar circumstances. This paper argues that the reasonable person\nstandard provides useful guidelines for the type of behavior we should develop,\nprobe, and stress-test in models. It explains how reasonableness is defined and\nused in key areas of the law using illustrative cases, how the reasonable\nperson standard could apply to AI behavior in each of these areas and contexts,\nand how our societal understanding of \"reasonable\" behavior provides useful\ntechnical goals for AI researchers.", "paper_summary_zh": "隨著 AI 系統日益融入人類行為已設下規範的領域，AI 治理和 AI 對齊研究的一項挑戰是要以對社會有益且具建設性的方式規範其行為。回答這個問題的方法之一是詢問：我們要如何治理模型所模擬的人類行為？為了評估人類行為，美國法律體系通常使用「合理人標準」。「合理」行為的概念出現在幾乎每個法律領域。法律體系通常根據合理人在類似情況下會採取的行動來判斷當事人的行為。本文認為，合理人標準為我們應在模型中開發、探討和進行壓力測試的行為類型提供了有用的準則。本文說明了在法律關鍵領域中如何定義和使用合理性，並使用說明性案例說明了合理人標準如何適用於這些領域和背景中的 AI 行為，以及我們對「合理」行為的社會理解如何為 AI 研究人員提供有用的技術目標。", "author": "Sunayana Rane et.al.", "authors": "Sunayana Rane", "id": "2406.04671v1", "paper_url": "http://arxiv.org/abs/2406.04671v1", "repo": "null"}}