{"2408.15562": {"publish_time": "2024-08-28", "title": "Boosting Lossless Speculative Decoding via Feature Sampling and Partial Alignment Distillation", "paper_summary": "Lossless speculative decoding accelerates target large language model (LLM)\ninference by employing a lightweight draft model for generating tree-structured\ncandidates, which are subsequently verified in parallel by the target LLM.\nCurrently, effective approaches leverage feature-level rather than token-level\nautoregression within the draft model to facilitate more straightforward\npredictions and enhanced knowledge distillation. In this paper, we reassess\nthese approaches and propose FSPAD (Feature Sampling and Partial Alignment\nDistillation for Lossless Speculative Decoding), which introduces two\nstraightforward and effective components within the existing framework to boost\nlossless speculative decoding. Firstly, FSPAD utilizes token embeddings to\nsample features of the target LLM in high-dimensional space before feeding them\ninto the draft model, due to the inherent uncertainty of the features\npreventing the draft model from obtaining the specific token output by the\ntarget LLM. Secondly, FSPAD introduces partial alignment distillation to weaken\nthe draft model's connection between features and logits, aiming to reduce the\nconflict between feature alignment and logit confidence during training. Our\nexperiments include both greedy and non-greedy decoding on the largest and\nsmallest models from the Vicuna and LLaMA3-Instruct series, as well as tasks in\nmulti-turn conversation, translation, summarization, question answering,\nmathematical reasoning, and retrieval-augmented generation. The results show\nthat FSPAD outperforms the state-of-the-art method across all the\naforementioned tasks and target LLMs.", "paper_summary_zh": "無失真推測解碼透過採用輕量級草稿模型來加速目標大型語言模型 (LLM) 推論，以產生樹狀結構候選，隨後由目標 LLM 平行驗證。目前，有效的方法利用草稿模型中特徵層級而非代幣層級自迴歸，以促進更直接的預測和增強知識萃取。在本文中，我們重新評估這些方法，並提出 FSPAD（特徵取樣和部分對齊萃取用於無失真推測解碼），在現有架構中引入兩個直接且有效的元件，以提升無失真推測解碼。首先，由於特徵的固有不確定性會妨礙草稿模型取得目標 LLM 的特定代幣輸出，FSPAD 利用代幣嵌入在高維空間中取樣目標 LLM 的特徵，然後將其輸入草稿模型。其次，FSPAD 引入部分對齊萃取，以弱化草稿模型中特徵和 logit 之間的關聯，旨在減少特徵對齊和 logit 信心在訓練期間的衝突。我們的實驗包括在 Vicuna 和 LLaMA3-Instruct 系列中最大和最小的模型上進行貪婪和非貪婪解碼，以及多輪對話、翻譯、摘要、問答、數學推理和檢索增強生成中的任務。結果顯示，FSPAD 在所有上述任務和目標 LLM 中都優於最先進的方法。", "author": "Lujun Gui et.al.", "authors": "Lujun Gui, Bin Xiao, Lei Su, Weipeng Chen", "id": "2408.15562v1", "paper_url": "http://arxiv.org/abs/2408.15562v1", "repo": "null"}}