{"2407.13603": {"publish_time": "2024-07-18", "title": "dzStance at StanceEval2024: Arabic Stance Detection based on Sentence Transformers", "paper_summary": "This study compares Term Frequency-Inverse Document Frequency (TF-IDF)\nfeatures with Sentence Transformers for detecting writers' stances--favorable,\nopposing, or neutral--towards three significant topics: COVID-19 vaccine,\ndigital transformation, and women empowerment. Through empirical evaluation, we\ndemonstrate that Sentence Transformers outperform TF-IDF features across\nvarious experimental setups. Our team, dzStance, participated in a stance\ndetection competition, achieving the 13th position (74.91%) among 15 teams in\nWomen Empowerment, 10th (73.43%) in COVID Vaccine, and 12th (66.97%) in Digital\nTransformation. Overall, our team's performance ranked 13th (71.77%) among all\nparticipants. Notably, our approach achieved promising F1-scores, highlighting\nits effectiveness in identifying writers' stances on diverse topics. These\nresults underscore the potential of Sentence Transformers to enhance stance\ndetection models for addressing critical societal issues.", "paper_summary_zh": "本研究比較了詞頻-逆向文件頻率 (TF-IDF) 特徵和句子轉換器，用於偵測作者對三個重要主題的立場，包括支持、反對或中立：COVID-19 疫苗、數位轉型和女性賦權。透過實證評估，我們證明句子轉換器在各種實驗設定中優於 TF-IDF 特徵。我們的團隊 dzStance 參加了立場偵測競賽，在 15 個團隊中獲得了第 13 名 (74.91%) 的成績，其中在女性賦權中排名第 10 (73.43%)，在 COVID 疫苗中排名第 10 (73.43%)，在數位轉型中排名第 12 (66.97%)。總體而言，我們團隊的表現排名第 13 (71.77%)。值得注意的是，我們的策略達到了有希望的 F1 分數，突顯了其在辨識作者對不同主題立場的有效性。這些結果強調了句子轉換器在加強立場偵測模型以解決關鍵社會問題方面的潛力。", "author": "Mohamed Lichouri et.al.", "authors": "Mohamed Lichouri, Khaled Lounnas, Khelil Rafik Ouaras, Mohamed Abi, Anis Guechtouli", "id": "2407.13603v1", "paper_url": "http://arxiv.org/abs/2407.13603v1", "repo": "null"}}