{"2411.03817": {"publish_time": "2024-11-06", "title": "From Novice to Expert: LLM Agent Policy Optimization via Step-wise Reinforcement Learning", "paper_summary": "The outstanding capabilities of large language models (LLMs) render them a\ncrucial component in various autonomous agent systems. While traditional\nmethods depend on the inherent knowledge of LLMs without fine-tuning, more\nrecent approaches have shifted toward the reinforcement learning strategy to\nfurther enhance agents' ability to solve complex interactive tasks with\nenvironments and tools. However, previous approaches are constrained by the\nsparse reward issue, where existing datasets solely provide a final scalar\nreward for each multi-step reasoning chain, potentially leading to\nineffectiveness and inefficiency in policy learning. In this paper, we\nintroduce StepAgent, which utilizes step-wise reward to optimize the agent's\nreinforcement learning process. Inheriting the spirit of novice-to-expert\ntheory, we first compare the actions of the expert and the agent to\nautomatically generate intermediate rewards for fine-grained optimization.\nAdditionally, we propose implicit-reward and inverse reinforcement learning\ntechniques to facilitate agent reflection and policy adjustment. Further\ntheoretical analysis demonstrates that the action distribution of the agent can\nconverge toward the expert action distribution over multiple training cycles.\nExperimental results across various datasets indicate that StepAgent\noutperforms existing baseline methods.", "paper_summary_zh": "大型語言模型 (LLM) 的傑出功能讓它們成為各種自主代理系統中至關重要的組成部分。雖然傳統方法依賴於 LLM 的固有知識而無需微調，但最近的方法已轉向強化學習策略，以進一步增強代理解決複雜互動任務的能力，包括環境和工具。然而，先前的做法受到稀疏獎勵問題的限制，其中現有資料集僅為每個多步驟推理鏈提供最終標量獎勵，這可能會導致策略學習的無效性和低效率。在本文中，我們介紹了 StepAgent，它利用逐步獎勵來優化代理的強化學習過程。繼承初學者到專家的理論精神，我們首先比較專家和代理的行動，以自動產生用於細化優化的中間獎勵。此外，我們提出了隱式獎勵和逆向強化學習技術，以促進代理反思和策略調整。進一步的理論分析表明，代理的行動分佈可以在多個訓練週期中收斂到專家行動分佈。跨各種資料集的實驗結果表明，StepAgent 優於現有的基準方法。", "author": "Zhirui Deng et.al.", "authors": "Zhirui Deng, Zhicheng Dou, Yutao Zhu, Ji-Rong Wen, Ruibin Xiong, Mang Wang, Weipeng Chen", "id": "2411.03817v1", "paper_url": "http://arxiv.org/abs/2411.03817v1", "repo": "null"}}