{"2408.15543": {"publish_time": "2024-08-28", "title": "An Investigation of Warning Erroneous Chat Translations in Cross-lingual Communication", "paper_summary": "The complexities of chats pose significant challenges for machine translation\nmodels. Recognizing the need for a precise evaluation metric to address the\nissues of chat translation, this study introduces Multidimensional Quality\nMetrics for Chat Translation (MQM-Chat). Through the experiments of five models\nusing MQM-Chat, we observed that all models generated certain fundamental\nerrors, while each of them has different shortcomings, such as omission, overly\ncorrecting ambiguous source content, and buzzword issues, resulting in the loss\nof stylized information. Our findings underscore the effectiveness of MQM-Chat\nin evaluating chat translation, emphasizing the importance of stylized content\nand dialogue consistency for future studies.", "paper_summary_zh": "聊天對話的複雜性對機器翻譯模型造成極大的挑戰。為了滿足對精確評估指標的需求以解決聊天翻譯的問題，本研究引入了聊天翻譯的多維度品質指標 (MQM-Chat)。透過使用 MQM-Chat 對五個模型進行的實驗，我們觀察到所有模型都會產生某些根本性的錯誤，而每個模型都有不同的缺點，例如遺漏、過度修正模稜兩可的原始內容，以及流行用語問題，導致文體化資訊的遺失。我們的研究結果強調了 MQM-Chat 在評估聊天翻譯中的有效性，並強調了文體化內容和對話一致性對未來研究的重要性。", "author": "Yunmeng Li et.al.", "authors": "Yunmeng Li, Jun Suzuki, Makoto Morishita, Kaori Abe, Kentaro Inui", "id": "2408.15543v1", "paper_url": "http://arxiv.org/abs/2408.15543v1", "repo": "null"}}