{"2501.13610": {"publish_time": "2025-01-23", "title": "Efficient Synaptic Delay Implementation in Digital Event-Driven AI Accelerators", "paper_summary": "Synaptic delay parameterization of neural network models have remained\nlargely unexplored but recent literature has been showing promising results,\nsuggesting the delay parameterized models are simpler, smaller, sparser, and\nthus more energy efficient than similar performing (e.g. task accuracy)\nnon-delay parameterized ones. We introduce Shared Circular Delay Queue (SCDQ),\na novel hardware structure for supporting synaptic delays on digital\nneuromorphic accelerators. Our analysis and hardware results show that it\nscales better in terms of memory, than current commonly used approaches, and is\nmore amortizable to algorithm-hardware co-optimizations, where in fact, memory\nscaling is modulated by model sparsity and not merely network size. Next to\nmemory we also report performance on latency area and energy per inference.", "paper_summary_zh": "神經網路模型的突觸延遲參數化在很大程度上仍未被探索，但最近的文獻顯示了有希望的結果，表明延遲參數化模型更簡單、更小、更稀疏，因此比執行類似（例如任務準確度）的非延遲參數化模型更節能。我們引入了共享循環延遲佇列 (SCDQ)，這是一種用於支持數位神經形態加速器上突觸延遲的新穎硬體結構。我們的分析和硬體結果表明，與當前常用的方法相比，它在記憶體方面具有更好的擴充性，並且更適合演算法硬體協同最佳化，其中記憶體擴充性實際上是由模型稀疏性調節的，而不仅仅是網路規模。除了記憶體之外，我們還報告了每個推論的延遲面積和能量效能。", "author": "Roy Meijer et.al.", "authors": "Roy Meijer, Paul Detterer, Amirreza Yousefzadeh, Alberto Patino-Saucedo, Guanghzi Tang, Kanishkan Vadivel, Yinfu Xu, Manil-Dev Gomony, Federico Corradi, Bernabe Linares-Barranco, Manolis Sifalakis", "id": "2501.13610v1", "paper_url": "http://arxiv.org/abs/2501.13610v1", "repo": "null"}}