{"2408.05882": {"publish_time": "2024-08-12", "title": "Creating Arabic LLM Prompts at Scale", "paper_summary": "The debut of chatGPT and BARD has popularized instruction following text\ngeneration using LLMs, where a user can interrogate an LLM using natural\nlanguage requests and obtain natural language answers that matches their\nrequests. Training LLMs to respond in this manner requires a large number of\nworked out examples of user requests (aka prompts) with corresponding gold\nresponses. In this paper, we introduce two methods for creating such prompts\nfor Arabic cheaply and quickly. The first methods entails automatically\ntranslating existing prompt datasets from English, such as PromptSource and\nSuper-NaturalInstructions, and then using machine translation quality\nestimation to retain high quality translations only. The second method involves\ncreating natural language prompts on top of existing Arabic NLP datasets. Using\nthese two methods we were able to create more than 67.4 million Arabic prompts\nthat cover a variety of tasks including summarization, headline generation,\ngrammar checking, open/closed question answering, creative writing, etc. We\nshow that fine tuning an open 7 billion parameter large language model, namely\nbase Qwen2 7B, enables it to outperform a state-of-the-art 70 billion parameter\ninstruction tuned model, namely Llama3 70B, in handling Arabic prompts.", "paper_summary_zh": "ChatGPT 和 BARD 的首次亮相普及了使用 LLM 的指令遵循文本生成，其中用户可以使用自然语言请求询问 LLM，并获得与他们的请求相匹配的自然语言答案。训练 LLM 以这种方式进行响应需要大量已解决的用户请求（又称提示）示例，并带有相应的黄金响应。在本文中，我们介绍了两种方法，可用于快速且廉价地为阿拉伯语创建此类提示。第一个方法需要自动翻译现有的提示数据集（例如 PromptSource 和 Super-NaturalInstructions）从英语，然后使用机器翻译质量评估仅保留高质量的翻译。第二种方法涉及在现有的阿拉伯语 NLP 数据集之上创建自然语言提示。使用这两种方法，我们能够创建超过 6740 万个阿拉伯语提示，涵盖各种任务，包括摘要、标题生成、语法检查、开放/封闭式问题解答、创意写作等。我们表明，对开放的 70 亿参数大语言模型（即基础 Qwen2 7B）进行微调，使其能够在处理阿拉伯语提示方面优于最先进的 700 亿参数指令调整模型（即 Llama3 70B）。", "author": "Abdelrahman El-Sheikh et.al.", "authors": "Abdelrahman El-Sheikh, Ahmed Elmogtaba, Kareem Darwish, Muhammad Elmallah, Ashraf Elneima, Hassan Sawaf", "id": "2408.05882v1", "paper_url": "http://arxiv.org/abs/2408.05882v1", "repo": "null"}}