{"2501.12909": {"publish_time": "2025-01-22", "title": "FilmAgent: A Multi-Agent Framework for End-to-End Film Automation in Virtual 3D Spaces", "paper_summary": "Virtual film production requires intricate decision-making processes,\nincluding scriptwriting, virtual cinematography, and precise actor positioning\nand actions. Motivated by recent advances in automated decision-making with\nlanguage agent-based societies, this paper introduces FilmAgent, a novel\nLLM-based multi-agent collaborative framework for end-to-end film automation in\nour constructed 3D virtual spaces. FilmAgent simulates various crew roles,\nincluding directors, screenwriters, actors, and cinematographers, and covers\nkey stages of a film production workflow: (1) idea development transforms\nbrainstormed ideas into structured story outlines; (2) scriptwriting elaborates\non dialogue and character actions for each scene; (3) cinematography determines\nthe camera setups for each shot. A team of agents collaborates through\niterative feedback and revisions, thereby verifying intermediate scripts and\nreducing hallucinations. We evaluate the generated videos on 15 ideas and 4 key\naspects. Human evaluation shows that FilmAgent outperforms all baselines across\nall aspects and scores 3.98 out of 5 on average, showing the feasibility of\nmulti-agent collaboration in filmmaking. Further analysis reveals that\nFilmAgent, despite using the less advanced GPT-4o model, surpasses the\nsingle-agent o1, showing the advantage of a well-coordinated multi-agent\nsystem. Lastly, we discuss the complementary strengths and weaknesses of\nOpenAI's text-to-video model Sora and our FilmAgent in filmmaking.", "paper_summary_zh": "虛擬電影製作需要複雜的決策過程，包括編劇、虛擬電影攝影、以及精準的演員定位和動作。受到語言代理人為基礎的社會自動決策制定近期進展的激勵，本文介紹了 FilmAgent，一個新穎的 LLM 為基礎的多重代理人合作架構，用於在我們建構的 3D 虛擬空間中進行端到端的電影自動化。FilmAgent 模擬了各種劇組角色，包括導演、編劇、演員和電影攝影師，涵蓋了電影製作工作流程的主要階段：(1) 構思開發將集思廣益的想法轉化為結構化的故事大綱；(2) 編劇為每個場景的對話和角色動作進行詳細說明；(3) 電影攝影決定每個鏡頭的攝影機設置。一組代理人透過反覆的回饋和修改進行合作，從而驗證中間腳本並減少幻覺。我們在 15 個想法和 4 個關鍵面向評估產生的影片。人類評估顯示，FilmAgent 在所有面向都優於所有基準，平均得分為 5 分中的 3.98 分，顯示了多重代理人在電影製作中合作的可行性。進一步的分析顯示，FilmAgent 儘管使用了較不先進的 GPT-4o 模型，但超越了單一代理人 o1，顯示了一個協調良好的多重代理人系統的優勢。最後，我們討論了 OpenAI 的文字轉影片模型 Sora 和我們的 FilmAgent 在電影製作中的互補優缺點。", "author": "Zhenran Xu et.al.", "authors": "Zhenran Xu, Longyue Wang, Jifang Wang, Zhouyi Li, Senbao Shi, Xue Yang, Yiyu Wang, Baotian Hu, Jun Yu, Min Zhang", "id": "2501.12909v1", "paper_url": "http://arxiv.org/abs/2501.12909v1", "repo": "null"}}