{"2407.12481": {"publish_time": "2024-07-17", "title": "Pretraining Data and Tokenizer for Indic LLM", "paper_summary": "We present a novel approach to data preparation for developing multilingual\nIndic large language model. Our meticulous data acquisition spans open-source\nand proprietary sources, including Common Crawl, Indic books, news articles,\nand Wikipedia, ensuring a diverse and rich linguistic representation. For each\nIndic language, we design a custom preprocessing pipeline to effectively\neliminate redundant and low-quality text content. Additionally, we perform\ndeduplication on Common Crawl data to address the redundancy present in 70% of\nthe crawled web pages. This study focuses on developing high-quality data,\noptimizing tokenization for our multilingual dataset for Indic large language\nmodels with 3B and 7B parameters, engineered for superior performance in Indic\nlanguages. We introduce a novel multilingual tokenizer training strategy,\ndemonstrating our custom-trained Indic tokenizer outperforms the\nstate-of-the-art OpenAI Tiktoken tokenizer, achieving a superior token-to-word\nratio for Indic languages.", "paper_summary_zh": "我們提出了一種用於開發多語言印度大型語言模型的資料準備新方法。我們嚴謹的資料收集涵蓋開源和專有來源，包括 Common Crawl、印度書籍、新聞文章和維基百科，確保語言表達的多樣性和豐富性。對於每種印度語言，我們設計一個自訂的前處理管道，以有效消除冗餘和低品質的文字內容。此外，我們對 Common Crawl 資料執行重複資料刪除，以解決 70% 已爬取網頁中存在的冗餘問題。本研究專注於開發高品質資料，針對我們的多語言資料集最佳化用於印度大型語言模型的標記化，參數為 3B 和 7B，旨在提升印度語言的卓越效能。我們引入一種新的多語言標記化訓練策略，證明我們自訂訓練的印度標記化器優於最先進的 OpenAI Tiktoken 標記化器，在印度語言中達成優異的詞彙標記比例。", "author": "Rahul Kumar et.al.", "authors": "Rahul Kumar, Shubham Kakde, Divyansh Rajput, Daud Ibrahim, Rishabh Nahata, Pidathala Sowjanya, Deepak Kumar", "id": "2407.12481v1", "paper_url": "http://arxiv.org/abs/2407.12481v1", "repo": "null"}}