{"2409.06096": {"publish_time": "2024-09-09", "title": "Latent Diffusion Bridges for Unsupervised Musical Audio Timbre Transfer", "paper_summary": "Music timbre transfer is a challenging task that involves modifying the\ntimbral characteristics of an audio signal while preserving its melodic\nstructure. In this paper, we propose a novel method based on dual diffusion\nbridges, trained using the CocoChorales Dataset, which consists of unpaired\nmonophonic single-instrument audio data. Each diffusion model is trained on a\nspecific instrument with a Gaussian prior. During inference, a model is\ndesignated as the source model to map the input audio to its corresponding\nGaussian prior, and another model is designated as the target model to\nreconstruct the target audio from this Gaussian prior, thereby facilitating\ntimbre transfer. We compare our approach against existing unsupervised timbre\ntransfer models such as VAEGAN and Gaussian Flow Bridges (GFB). Experimental\nresults demonstrate that our method achieves both better Fr\\'echet Audio\nDistance (FAD) and melody preservation, as reflected by lower pitch distances\n(DPD) compared to VAEGAN and GFB. Additionally, we discover that the noise\nlevel from the Gaussian prior, $\\sigma$, can be adjusted to control the degree\nof melody preservation and amount of timbre transferred.", "paper_summary_zh": "音樂音色轉移是一項具有挑戰性的任務，它涉及修改音訊訊號的音色特徵，同時保留其旋律結構。在本文中，我們提出了一種基於雙擴散橋接的新方法，使用 CocoChorales 資料集進行訓練，該資料集包含未配對的單音單樂器音訊資料。每個擴散模型都使用具有高斯先驗的特定樂器進行訓練。在推理過程中，一個模型被指定為源模型，將輸入音訊對應到其對應的高斯先驗，另一個模型被指定為目標模型，從這個高斯先驗重建目標音訊，從而促進音色轉移。我們將我們的模型與現有的無監督音色轉移模型（例如 VAEGAN 和高斯流橋接 (GFB)）進行比較。實驗結果表明，與 VAEGAN 和 GFB 相比，我們的模型在 Fr\\'echet 音訊距離 (FAD) 和旋律保留方面都取得了更好的效果，這反映在較低的音高距離 (DPD) 上。此外，我們發現來自高斯先驗的噪聲級別 $\\sigma$ 可以調整，以控制旋律保留的程度和轉移的音色數量。", "author": "Michele Mancusi et.al.", "authors": "Michele Mancusi, Yurii Halychansky, Kin Wai Cheuk, Chieh-Hsin Lai, Stefan Uhlich, Junghyun Koo, Marco A. Martínez-Ramírez, Wei-Hsiang Liao, Giorgio Fabbro, Yuhki Mitsufuji", "id": "2409.06096v1", "paper_url": "http://arxiv.org/abs/2409.06096v1", "repo": "null"}}