{"2407.13647": {"publish_time": "2024-07-18", "title": "Weak-to-Strong Reasoning", "paper_summary": "When large language models (LLMs) exceed human-level capabilities, it becomes\nincreasingly challenging to provide full-scale and accurate supervisions for\nthese models. Weak-to-strong learning, which leverages a less capable model to\nunlock the latent abilities of a stronger model, proves valuable in this\ncontext. Yet, the efficacy of this approach for complex reasoning tasks is\nstill untested. Furthermore, tackling reasoning tasks under the weak-to-strong\nsetting currently lacks efficient methods to avoid blindly imitating the weak\nsupervisor including its errors. In this paper, we introduce a progressive\nlearning framework that enables the strong model to autonomously refine its\ntraining data, without requiring input from either a more advanced model or\nhuman-annotated data. This framework begins with supervised fine-tuning on a\nselective small but high-quality dataset, followed by preference optimization\non contrastive samples identified by the strong model itself. Extensive\nexperiments on the GSM8K and MATH datasets demonstrate that our method\nsignificantly enhances the reasoning capabilities of Llama2-70b using three\nseparate weak models. This method is further validated in a forward-looking\nexperimental setup, where Llama3-8b-instruct effectively supervises Llama3-70b\non the highly challenging OlympicArena dataset. This work paves the way for a\nmore scalable and sophisticated strategy to enhance AI reasoning powers. All\nrelevant code and resources are available in\n\\url{https://github.com/GAIR-NLP/weak-to-strong-reasoning}.", "paper_summary_zh": "<paragraph>當大型語言模型 (LLM) 超越人類層級的能力時，為這些模型提供全面且精準的監督變得越來越具有挑戰性。弱到強學習利用能力較差的模型來解鎖較強模型的潛在能力，在此背景下證明了其價值。然而，這種方法對複雜推理任務的效能仍未經過測試。此外，在弱到強的設定下處理推理任務，目前缺乏有效的方法來避免盲目模仿較弱的監督者，包括其錯誤。在本文中，我們介紹一個漸進式學習架構，使強模型能夠自主精進其訓練資料，而無需來自更先進模型或人工標註資料的輸入。此架構從對精選的小型但高品質資料集進行監督微調開始，然後對強模型本身識別出的對比樣本進行偏好最佳化。在 GSM8K 和 MATH 資料集上的廣泛實驗證明，我們的方法使用三個獨立的弱模型，顯著提升了 Llama2-70b 的推理能力。此方法在一個前瞻性的實驗設置中進一步得到驗證，其中 Llama3-8b-instruct 有效地監督 Llama3-70b 處理極具挑戰性的 OlympicArena 資料集。這項工作為提升 AI 推理能力提供了更具可擴充性和精緻性的策略。所有相關程式碼和資源都可以在 \\url{https://github.com/GAIR-NLP/weak-to-strong-reasoning} 中取得。</paragraph>", "author": "Yuqing Yang et.al.", "authors": "Yuqing Yang, Yan Ma, Pengfei Liu", "id": "2407.13647v1", "paper_url": "http://arxiv.org/abs/2407.13647v1", "repo": "null"}}