{"2502.02561": {"publish_time": "2025-02-04", "title": "Decision Theoretic Foundations for Conformal Prediction: Optimal Uncertainty Quantification for Risk-Averse Agents", "paper_summary": "A fundamental question in data-driven decision making is how to quantify the\nuncertainty of predictions in ways that can usefully inform downstream action.\nThis interface between prediction uncertainty and decision-making is especially\nimportant in risk-sensitive domains, such as medicine. In this paper, we\ndevelop decision-theoretic foundations that connect uncertainty quantification\nusing prediction sets with risk-averse decision-making. Specifically, we answer\nthree fundamental questions: (1) What is the correct notion of uncertainty\nquantification for risk-averse decision makers? We prove that prediction sets\nare optimal for decision makers who wish to optimize their value at risk. (2)\nWhat is the optimal policy that a risk averse decision maker should use to map\nprediction sets to actions? We show that a simple max-min decision policy is\noptimal for risk-averse decision makers. Finally, (3) How can we derive\nprediction sets that are optimal for such decision makers? We provide an exact\ncharacterization in the population regime and a distribution free finite-sample\nconstruction. Answering these questions naturally leads to an algorithm,\nRisk-Averse Calibration (RAC), which follows a provably optimal design for\nderiving action policies from predictions. RAC is designed to be both\npractical-capable of leveraging the quality of predictions in a black-box\nmanner to enhance downstream utility-and safe-adhering to a user-defined risk\nthreshold and optimizing the corresponding risk quantile of the user's\ndownstream utility. Finally, we experimentally demonstrate the significant\nadvantages of RAC in applications such as medical diagnosis and recommendation\nsystems. Specifically, we show that RAC achieves a substantially improved\ntrade-off between safety and utility, offering higher utility compared to\nexisting methods while maintaining the safety guarantee.", "paper_summary_zh": "<paragraph>在資料驅動決策中，一個基本問題是，如何量化預測的不確定性，以能有用地告知下游行動。\n預測不確定性和決策制定之間的這種介面，在風險敏感領域中特別重要，例如醫學。在本文中，我們\n發展了決策理論基礎，它利用預測集合將不確定性量化與風險規避決策制定聯繫起來。具體來說，我們回答\n了三個基本問題：(1) 對於風險規避決策者來說，不確定性量化的正確概念是什麼？我們證明，對於希望最佳化其風險價值的決策者來說，預測集合是最佳的。(2)\n風險規避決策者應使用什麼最佳政策，將預測集合映射到行動？我們表明，對於風險規避決策者來說，一個簡單的最大最小決策政策是最佳的。最後，(3) 我們如何推導出對此類決策者來說最佳的預測集合？我們在總體範圍內提供了一個確切的表徵，並提供了一個不依賴分佈的有限樣本建構。回答這些問題自然會導致一個演算法，風險規避校準 (RAC)，它遵循一個可證明最佳的設計，從預測中推導出行動政策。RAC 被設計為既實用——能夠以黑盒方式利用預測的品質來增強下游效用——又安全——遵守使用者定義的風險閾值，並最佳化使用者的下游效用的對應風險分位數。最後，我們在醫學診斷和推薦系統等應用中，以實驗方式證明了 RAC 的顯著優點。具體來說，我們表明，與現有方法相比，RAC 在安全性和效用之間實現了顯著改善的折衷，在維持安全保證的同時，提供了更高的效用。</paragraph>", "author": "Shayan Kiyani et.al.", "authors": "Shayan Kiyani, George Pappas, Aaron Roth, Hamed Hassani", "id": "2502.02561v1", "paper_url": "http://arxiv.org/abs/2502.02561v1", "repo": "null"}}