{"2412.19331": {"publish_time": "2024-12-26", "title": "CALICO: Part-Focused Semantic Co-Segmentation with Large Vision-Language Models", "paper_summary": "Recent advances in Large Vision-Language Models (LVLMs) have sparked\nsignificant progress in general-purpose vision tasks through visual instruction\ntuning. While some works have demonstrated the capability of LVLMs to generate\nsegmentation masks that align phrases with natural language descriptions in a\nsingle image, they struggle with segmentation-grounded comparisons across\nmultiple images, particularly at finer granularities such as object parts. In\nthis paper, we introduce the new task of part-focused semantic co-segmentation,\nwhich seeks to identify and segment common and unique objects and parts across\nimages. To address this task, we present CALICO, the first LVLM that can\nsegment and reason over multiple masks across images, enabling object\ncomparison based on their constituent parts. CALICO features two proposed\ncomponents, a novel Correspondence Extraction Module, which captures\nsemantic-rich information to identify part-level correspondences between\nobjects, and a Correspondence Adaptation Module, which embeds this information\ninto the LVLM to facilitate multi-image understanding in a parameter-efficient\nmanner. To support training and evaluation, we curate MixedParts, a\ncomprehensive multi-image segmentation dataset containing $\\sim$2.4M samples\nacross $\\sim$44K images with diverse object and part categories. Experimental\nresults show CALICO, finetuned on only 0.3% of its architecture, achieves\nrobust performance in part-focused semantic co-segmentation.", "paper_summary_zh": "最近大型视觉语言模型 (LVLMs) 的进步引发了通过视觉指令微调在通用视觉任务中取得的重大进展。虽然一些工作已经展示了 LVLMs 生成分割掩码的能力，这些掩码将短语与单个图像中的自然语言描述对齐，但它们难以处理跨多个图像的分割基础比较，尤其是在对象部分等更精细的粒度上。在本文中，我们介绍了部分聚焦语义共分割的新任务，该任务旨在识别和分割图像中的常见对象和部分以及唯一的对象和部分。为了解决这一任务，我们提出了 CALICO，这是第一个可以在图像中分割和推理多个掩码的 LVLM，从而能够根据组成部分比较对象。CALICO 具有两个提出的组件，一个新颖的对应提取模块，它捕获语义丰富的信息以识别对象之间的部分级对应关系，以及一个对应适应模块，它将此信息嵌入 LVLM 中，以参数有效的方式促进多图像理解。为了支持训练和评估，我们整理了 MixedParts，这是一个全面的多图像分割数据集，包含跨越约 44K 张图像的约 240 万个样本，其中包含各种对象和部分类别。实验结果表明，仅对其架构的 0.3% 进行微调的 CALICO 在部分聚焦语义共分割中取得了稳健的性能。", "author": "Kiet A. Nguyen et.al.", "authors": "Kiet A. Nguyen, Adheesh Juvekar, Tianjiao Yu, Muntasir Wahed, Ismini Lourentzou", "id": "2412.19331v1", "paper_url": "http://arxiv.org/abs/2412.19331v1", "repo": "null"}}