{"2405.12021": {"publish_time": "2024-05-20", "title": "Can AI Relate: Testing Large Language Model Response for Mental Health Support", "paper_summary": "Large language models (LLMs) are already being piloted for clinical use in\nhospital systems like NYU Langone, Dana-Farber and the NHS. A proposed\ndeployment use case is psychotherapy, where a LLM-powered chatbot can treat a\npatient undergoing a mental health crisis. Deployment of LLMs for mental health\nresponse could hypothetically broaden access to psychotherapy and provide new\npossibilities for personalizing care. However, recent high-profile failures,\nlike damaging dieting advice offered by the Tessa chatbot to patients with\neating disorders, have led to doubt about their reliability in high-stakes and\nsafety-critical settings.\n  In this work, we develop an evaluation framework for determining whether LLM\nresponse is a viable and ethical path forward for the automation of mental\nhealth treatment. Using human evaluation with trained clinicians and automatic\nquality-of-care metrics grounded in psychology research, we compare the\nresponses provided by peer-to-peer responders to those provided by a\nstate-of-the-art LLM.\n  We show that LLMs like GPT-4 use implicit and explicit cues to infer patient\ndemographics like race. We then show that there are statistically significant\ndiscrepancies between patient subgroups: Responses to Black posters\nconsistently have lower empathy than for any other demographic group (2%-13%\nlower than the control group). Promisingly, we do find that the manner in which\nresponses are generated significantly impacts the quality of the response. We\nconclude by proposing safety guidelines for the potential deployment of LLMs\nfor mental health response.", "paper_summary_zh": "大型語言模型 (LLM) 已在紐約大學朗格尼、達納法伯和英國國家醫療服務體系等醫院系統中試行用於臨床用途。建議的部署用例是心理治療，其中由 LLM 驅動的聊天機器人可以治療正在經歷心理健康危機的患者。假設 LLM 部署於心理健康應對，可以擴大心理治療的普及度，並提供新的可能性來實現個性化護理。然而，最近備受矚目的失敗，例如 Tessa 聊天機器人為飲食失調患者提供的有害飲食建議，讓人們對其在高風險和安全關鍵環境中的可靠性產生了懷疑。\n  在這項工作中，我們開發了一個評估框架，用於確定 LLM 回應是否是一個可行且合乎道德的途徑，用於自動化心理健康治療。我們利用經過培訓的臨床醫生進行的人類評估和基於心理學研究的自動質量護理指標，比較了點對點回應者提供的回應與最先進的 LLM 提供的回應。\n  我們展示了 GPT-4 等 LLM 使用隱式和顯式線索來推斷患者人口統計資料，例如種族。然後我們展示了患者亞組之間存在統計上顯著的差異：對黑人海報的回應始終低於任何其他人口統計組（比對照組低 2%-13%）。可喜的是，我們確實發現回應的生成方式會顯著影響回應的品質。最後，我們提出 LLM 在心理健康應對中潛在部署的安全指南。", "author": "Saadia Gabriel et.al.", "authors": "Saadia Gabriel, Isha Puri, Xuhai Xu, Matteo Malgaroli, Marzyeh Ghassemi", "id": "2405.12021v1", "paper_url": "http://arxiv.org/abs/2405.12021v1", "repo": "null"}}