{"2411.13251": {"publish_time": "2024-11-20", "title": "BelHouse3D: A Benchmark Dataset for Assessing Occlusion Robustness in 3D Point Cloud Semantic Segmentation", "paper_summary": "Large-scale 2D datasets have been instrumental in advancing machine learning;\nhowever, progress in 3D vision tasks has been relatively slow. This disparity\nis largely due to the limited availability of 3D benchmarking datasets. In\nparticular, creating real-world point cloud datasets for indoor scene semantic\nsegmentation presents considerable challenges, including data collection within\nconfined spaces and the costly, often inaccurate process of per-point labeling\nto generate ground truths. While synthetic datasets address some of these\nchallenges, they often fail to replicate real-world conditions, particularly\nthe occlusions that occur in point clouds collected from real environments.\nExisting 3D benchmarking datasets typically evaluate deep learning models under\nthe assumption that training and test data are independently and identically\ndistributed (IID), which affects the models' usability for real-world point\ncloud segmentation. To address these challenges, we introduce the BelHouse3D\ndataset, a new synthetic point cloud dataset designed for 3D indoor scene\nsemantic segmentation. This dataset is constructed using real-world references\nfrom 32 houses in Belgium, ensuring that the synthetic data closely aligns with\nreal-world conditions. Additionally, we include a test set with data occlusion\nto simulate out-of-distribution (OOD) scenarios, reflecting the occlusions\ncommonly encountered in real-world point clouds. We evaluate popular\npoint-based semantic segmentation methods using our OOD setting and present a\nbenchmark. We believe that BelHouse3D and its OOD setting will advance research\nin 3D point cloud semantic segmentation for indoor scenes, providing valuable\ninsights for the development of more generalizable models.", "paper_summary_zh": "<paragraph>大型 2D 資料集對於推進機器學習發揮了重要作用；\n然而，3D 視覺任務的進展相對緩慢。這種差異\n主要是由於 3D 基準資料集的可取得性有限。特別是，\n建立室內場景語義分割的真實世界點雲資料集會出現相當大的挑戰，包括在密閉空間內收集資料，以及代價高昂、通常不準確的逐點標籤處理程序，以產生基本事實。儘管合成資料集解決了其中一些\n挑戰，但它們通常無法複製真實世界的條件，特別是從真實環境收集的點雲中發生的遮擋。\n現有的 3D 基準資料集通常在訓練資料和測試資料獨立且同質分佈 (IID) 的假設下評估深度學習模型，這會影響模型在真實世界點雲分割中的可用性。為了應對這些挑戰，我們引入了 BelHouse3D 資料集，這是一個新的合成點雲資料集，專為 3D 室內場景語義分割而設計。這個資料集是使用比利時 32 間房屋的真實世界參考建立的，確保合成資料與真實世界條件緊密對齊。此外，我們還包括一個測試集，其中包含資料遮擋，以模擬分佈外 (OOD) 場景，反映真實世界點雲中常見的遮擋。我們使用我們的 OOD 設定評估了流行的基於點的語義分割方法，並提出了基準。我們相信 BelHouse3D 及其 OOD 設定將推進室內場景的 3D 點雲語義分割研究，為開發更具概括性的模型提供有價值的見解。</paragraph>", "author": "Umamaheswaran Raman Kumar et.al.", "authors": "Umamaheswaran Raman Kumar, Abdur Razzaq Fayjie, Jurgen Hannaert, Patrick Vandewalle", "id": "2411.13251v1", "paper_url": "http://arxiv.org/abs/2411.13251v1", "repo": "null"}}