{"2407.14564": {"publish_time": "2024-07-18", "title": "APS-USCT: Ultrasound Computed Tomography on Sparse Data via AI-Physic Synergy", "paper_summary": "Ultrasound computed tomography (USCT) is a promising technique that achieves\nsuperior medical imaging reconstruction resolution by fully leveraging waveform\ninformation, outperforming conventional ultrasound methods. Despite its\nadvantages, high-quality USCT reconstruction relies on extensive data\nacquisition by a large number of transducers, leading to increased costs,\ncomputational demands, extended patient scanning times, and manufacturing\ncomplexities. To mitigate these issues, we propose a new USCT method called\nAPS-USCT, which facilitates imaging with sparse data, substantially reducing\ndependence on high-cost dense data acquisition. Our APS-USCT method consists of\ntwo primary components: APS-wave and APS-FWI. The APS-wave component, an\nencoder-decoder system, preprocesses the waveform data, converting sparse data\ninto dense waveforms to augment sample density prior to reconstruction. The\nAPS-FWI component, utilizing the InversionNet, directly reconstructs the speed\nof sound (SOS) from the ultrasound waveform data. We further improve the\nmodel's performance by incorporating Squeeze-and-Excitation (SE) Blocks and\nsource encoding techniques. Testing our method on a breast cancer dataset\nyielded promising results. It demonstrated outstanding performance with an\naverage Structural Similarity Index (SSIM) of 0.8431. Notably, over 82% of\nsamples achieved an SSIM above 0.8, with nearly 61% exceeding 0.85,\nhighlighting the significant potential of our approach in improving USCT image\nreconstruction by efficiently utilizing sparse data.", "paper_summary_zh": "超音波電腦斷層攝影 (USCT) 是一種很有前景的技術，它能透過充分利用波形資訊，達成優異的醫學影像重建解析度，表現優於傳統超音波方法。儘管有其優點，高品質的 USCT 重建依賴於大量換能器廣泛的資料擷取，導致成本增加、運算需求、病患掃描時間延長，以及製造複雜度。為了減輕這些問題，我們提出了一種名為 APS-USCT 的新型 USCT 方法，它促進使用稀疏資料進行影像處理，大幅降低對高成本密集資料擷取的依賴。我們的 APS-USCT 方法包含兩個主要組成部分：APS-wave 和 APS-FWI。APS-wave 組件是一個編碼器解碼器系統，它預先處理波形資料，將稀疏資料轉換為密集波形，以在重建之前增加取樣密度。APS-FWI 組件利用 InversionNet，直接從超音波波形資料重建音速 (SOS)。我們進一步透過結合 Squeeze-and-Excitation (SE) 區塊和原始編碼技術來提升模型效能。在乳癌資料集上測試我們的這個方法，得到了有前景的結果。它展現了傑出的效能，結構相似性指標 (SSIM) 平均為 0.8431。值得注意的是，超過 82% 的樣本達成 SSIM 高於 0.8，近 61% 超過 0.85，突顯了我們的方法在透過有效利用稀疏資料來改善 USCT 影像重建方面的顯著潛力。", "author": "Yi Sheng et.al.", "authors": "Yi Sheng, Hanchen Wang, Yipei Liu, Junhuan Yang, Weiwen Jiang, Youzuo Lin, Lei Yang", "id": "2407.14564v1", "paper_url": "http://arxiv.org/abs/2407.14564v1", "repo": "null"}}