{"2410.22013": {"publish_time": "2024-10-29", "title": "Modeling Temporal Positive and Negative Excitation for Sequential Recommendation", "paper_summary": "Sequential recommendation aims to predict the next item which interests users\nvia modeling their interest in items over time. Most of the existing works on\nsequential recommendation model users' dynamic interest in specific items while\noverlooking users' static interest revealed by some static attribute\ninformation of items, e.g., category, or brand. Moreover, existing works often\nonly consider the positive excitation of a user's historical interactions on\nhis/her next choice on candidate items while ignoring the commonly existing\nnegative excitation, resulting in insufficient modeling dynamic interest. The\noverlook of static interest and negative excitation will lead to incomplete\ninterest modeling and thus impede the recommendation performance. To this end,\nin this paper, we propose modeling both static interest and negative excitation\nfor dynamic interest to further improve the recommendation performance.\nAccordingly, we design a novel Static-Dynamic Interest Learning (SDIL)\nframework featured with a novel Temporal Positive and Negative Excitation\nModeling (TPNE) module for accurate sequential recommendation. TPNE is\nspecially designed for comprehensively modeling dynamic interest based on\ntemporal positive and negative excitation learning. Extensive experiments on\nthree real-world datasets show that SDIL can effectively capture both static\nand dynamic interest and outperforms state-of-the-art baselines.", "paper_summary_zh": "序列推薦旨在預測使用者感興趣的下一項，並透過建模他們對商品的興趣來預測。現有的大部分序列推薦模型使用者對特定商品的動態興趣，同時忽略使用者透過商品的某些靜態屬性資訊（例如類別或品牌）所揭示的靜態興趣。此外，現有模型通常只考慮使用者過往互動對其在候選商品上的下一個選擇的正面激勵，而忽略普遍存在的負面激勵，導致動態興趣建模不足。忽視靜態興趣和負面激勵將導致不完整的興趣建模，進而阻礙推薦效能。因此，在本文中，我們提出對靜態興趣和負面激勵進行建模，以進一步提升推薦效能。相應地，我們設計了一個新穎的靜態動態興趣學習 (SDIL) 框架，其特點是採用新穎的時序正負激勵建模 (TPNE) 模組，用於精準的序列推薦。TPNE 專門設計用於根據時序正負激勵學習，全面建模動態興趣。在三個真實世界資料集上進行的廣泛實驗表明，SDIL 可以有效捕捉靜態和動態興趣，並且優於最先進的基準。", "author": "Chengkai Huang et.al.", "authors": "Chengkai Huang, Shoujin Wang, Xianzhi Wang, Lina Yao", "id": "2410.22013v1", "paper_url": "http://arxiv.org/abs/2410.22013v1", "repo": "null"}}