{"2407.14081": {"publish_time": "2024-07-19", "title": "DisenSemi: Semi-supervised Graph Classification via Disentangled Representation Learning", "paper_summary": "Graph classification is a critical task in numerous multimedia applications,\nwhere graphs are employed to represent diverse types of multimedia data,\nincluding images, videos, and social networks. Nevertheless, in real-world\nscenarios, labeled graph data can be limited or scarce. To address this issue,\nwe focus on the problem of semi-supervised graph classification, which involves\nboth supervised and unsupervised models learning from labeled and unlabeled\ndata. In contrast to recent approaches that transfer the entire knowledge from\nthe unsupervised model to the supervised one, we argue that an effective\ntransfer should only retain the relevant semantics that align well with the\nsupervised task. In this paper, we propose a novel framework named DisenSemi,\nwhich learns disentangled representation for semi-supervised graph\nclassification. Specifically, a disentangled graph encoder is proposed to\ngenerate factor-wise graph representations for both supervised and unsupervised\nmodels. Then we train two models via supervised objective and mutual\ninformation (MI)-based constraints respectively. To ensure the meaningful\ntransfer of knowledge from the unsupervised encoder to the supervised one, we\nfurther define an MI-based disentangled consistency regularization between two\nmodels and identify the corresponding rationale that aligns well with the\ncurrent graph classification task. Experimental results on a range of publicly\naccessible datasets reveal the effectiveness of our DisenSemi.", "paper_summary_zh": "圖形分類在眾多多媒體應用中是一項重要的任務，\n其中圖形用於表示各種類型的多媒體數據，\n包括圖像、影片和社交網路。儘管如此，在實際\n場景中，標籤圖形數據可能有限或稀少。為了解決這個問題，\n我們專注於半監督圖形分類問題，其中涉及\n監督式和非監督式模型從標籤和未標籤\n數據中學習。與最近將整個知識從\n非監督式模型轉移到監督式模型的方法相反，我們認為有效的\n轉移應該只保留與監督式任務密切對齊的相關語義。在本文中，我們提出一個名為 DisenSemi 的新框架，\n它學習 disentangled 表示法用於半監督圖形\n分類。具體來說，提出了一個 disentangled 圖形編碼器來\n為監督式和非監督式模型生成基於因子的圖形表示。然後我們通過監督式目標和基於互信息 (MI) 的約束分別訓練兩個模型。為了確保從非監督式編碼器到監督式編碼器的知識有意義地轉移，我們\n進一步定義了兩個模型之間基於 MI 的 disentangled 一致性正則化，並找出與\n當前圖形分類任務密切對齊的相應依據。在各種公開\n可存取的資料集上的實驗結果揭示了我們 DisenSemi 的有效性。", "author": "Yifan Wang et.al.", "authors": "Yifan Wang, Xiao Luo, Chong Chen, Xian-Sheng Hua, Ming Zhang, Wei Ju", "id": "2407.14081v1", "paper_url": "http://arxiv.org/abs/2407.14081v1", "repo": "https://github.com/jamesyifan/DisenSemi"}}