{"2408.03603": {"publish_time": "2024-08-07", "title": "EnJa: Ensemble Jailbreak on Large Language Models", "paper_summary": "As Large Language Models (LLMs) are increasingly being deployed in\nsafety-critical applications, their vulnerability to potential jailbreaks --\nmalicious prompts that can disable the safety mechanism of LLMs -- has\nattracted growing research attention. While alignment methods have been\nproposed to protect LLMs from jailbreaks, many have found that aligned LLMs can\nstill be jailbroken by carefully crafted malicious prompts, producing content\nthat violates policy regulations. Existing jailbreak attacks on LLMs can be\ncategorized into prompt-level methods which make up stories/logic to circumvent\nsafety alignment and token-level attack methods which leverage gradient methods\nto find adversarial tokens. In this work, we introduce the concept of Ensemble\nJailbreak and explore methods that can integrate prompt-level and token-level\njailbreak into a more powerful hybrid jailbreak attack. Specifically, we\npropose a novel EnJa attack to hide harmful instructions using prompt-level\njailbreak, boost the attack success rate using a gradient-based attack, and\nconnect the two types of jailbreak attacks via a template-based connector. We\nevaluate the effectiveness of EnJa on several aligned models and show that it\nachieves a state-of-the-art attack success rate with fewer queries and is much\nstronger than any individual jailbreak.", "paper_summary_zh": "隨著大型語言模型（LLM）日益廣泛地部署在安全關鍵型應用程式中，它們容易受到潛在越獄的攻擊，惡意提示可以停用 LLM 的安全機制，這引起了越來越多的研究關注。儘管已提出比對方法來保護 LLM 不受越獄攻擊，但許多人發現，精心設計的惡意提示仍然可以越獄比對後的 LLM，產生違反政策法規的內容。現有的針對 LLM 的越獄攻擊可分為提示層級方法，該方法編造故事/邏輯來規避安全比對，以及利用梯度方法來尋找對抗性權杖的權杖層級攻擊方法。在這項工作中，我們引入了整體越獄的概念，並探討了可以將提示層級和權杖層級越獄整合到更強大的混合越獄攻擊中的方法。具體來說，我們提出了一種新穎的 EnJa 攻擊，使用提示層級越獄來隱藏有害指令，使用基於梯度的攻擊來提高攻擊成功率，並通過基於範本的連接器連接兩種類型的越獄攻擊。我們評估了 EnJa 在多個比對模型上的有效性，並表明它以較少的查詢達到了最先進的攻擊成功率，並且比任何單獨的越獄攻擊都強得多。", "author": "Jiahao Zhang et.al.", "authors": "Jiahao Zhang, Zilong Wang, Ruofan Wang, Xingjun Ma, Yu-Gang Jiang", "id": "2408.03603v1", "paper_url": "http://arxiv.org/abs/2408.03603v1", "repo": "null"}}