{"2411.08726": {"publish_time": "2024-11-13", "title": "Analyst Reports and Stock Performance: Evidence from the Chinese Market", "paper_summary": "This article applies natural language processing (NLP) to extract and\nquantify textual information to predict stock performance. Using an extensive\ndataset of Chinese analyst reports and employing a customized BERT deep\nlearning model for Chinese text, this study categorizes the sentiment of the\nreports as positive, neutral, or negative. The findings underscore the\npredictive capacity of this sentiment indicator for stock volatility, excess\nreturns, and trading volume. Specifically, analyst reports with strong positive\nsentiment will increase excess return and intraday volatility, and vice versa,\nreports with strong negative sentiment also increase volatility and trading\nvolume, but decrease future excess return. The magnitude of this effect is\ngreater for positive sentiment reports than for negative sentiment reports.\nThis article contributes to the empirical literature on sentiment analysis and\nthe response of the stock market to news in the Chinese stock market.", "paper_summary_zh": "本文應用自然語言處理 (NLP) 來擷取和量化文本資訊，以預測股票表現。本研究使用廣泛的中文分析師報告資料集，並採用客製化的中文文本 BERT 深度學習模型，將報告的情緒分類為正面、中立或負面。研究結果強調此情緒指標對於股票波動、超額報酬和交易量的預測能力。具體來說，具有強烈正面情緒的分析師報告將增加超額報酬和盤中波動，反之，具有強烈負面情緒的報告也會增加波動和交易量，但會減少未來的超額報酬。這種效應的幅度對於正面情緒報告來說大於負面情緒報告。本文有助於關於情緒分析的實證文獻，以及中國股市中股市對新聞的反應。", "author": "Rui Liu et.al.", "authors": "Rui Liu, Jiayou Liang, Haolong Chen, Yujia Hu", "id": "2411.08726v1", "paper_url": "http://arxiv.org/abs/2411.08726v1", "repo": "null"}}