{"2411.08842": {"publish_time": "2024-11-13", "title": "AstroM$^3$: A self-supervised multimodal model for astronomy", "paper_summary": "While machine-learned models are now routinely employed to facilitate\nastronomical inquiry, model inputs tend to be limited to a primary data source\n(namely images or time series) and, in the more advanced approaches, some\nmetadata. Yet with the growing use of wide-field, multiplexed observational\nresources, individual sources of interest often have a broad range of\nobservational modes available. Here we construct an astronomical multimodal\ndataset and propose AstroM$^3$, a self-supervised pre-training approach that\nenables a model to learn from multiple modalities simultaneously. Specifically,\nwe extend the CLIP (Contrastive Language-Image Pretraining) model to a trimodal\nsetting, allowing the integration of time-series photometry data, spectra, and\nastrophysical metadata. In a fine-tuning supervised setting, our results\ndemonstrate that CLIP pre-training improves classification performance for\ntime-series photometry, where accuracy increases from 84.6% to 91.5%.\nFurthermore, CLIP boosts classification accuracy by up to 12.6% when the\navailability of labeled data is limited, showing the effectiveness of\nleveraging larger corpora of unlabeled data. In addition to fine-tuned\nclassification, we can use the trained model in other downstream tasks that are\nnot explicitly contemplated during the construction of the self-supervised\nmodel. In particular we show the efficacy of using the learned embeddings for\nmisclassifications identification, similarity search, and anomaly detection.\nOne surprising highlight is the \"rediscovery\" of Mira subtypes and two\nRotational variable subclasses using manifold learning and dimension reduction\nalgorithm. To our knowledge this is the first construction of an $n>2$ mode\nmodel in astronomy. Extensions to $n>3$ modes is naturally anticipated with\nthis approach.", "paper_summary_zh": "<paragraph>雖然機器學習模型現在例行用於促進天文學探究，但模型輸入往往僅限於主要的資料來源（即影像或時間序列），而在更進階的方法中，則為一些元資料。但隨著廣視場、多工觀測資源的使用增加，個別感興趣的來源通常有廣泛的觀測模式可用。在此，我們建構一個天文學多模態資料集，並提出 AstroM$^3$，一種自我監督預訓練方法，使模型能夠同時從多種模態中學習。具體來說，我們將 CLIP（對比式語言影像預訓練）模型擴充到三模態設定，允許整合時間序列光度測量資料、光譜和天體物理元資料。在微調監督設定中，我們的結果證明 CLIP 預訓練改善了時間序列光度測量的分類效能，其中準確度從 84.6% 提升至 91.5%。此外，當標記資料的可用性受限時，CLIP 可將分類準確度提高多達 12.6%，顯示出利用較大規模的未標記資料的有效性。除了微調分類外，我們可以在其他下游任務中使用訓練好的模型，這些任務並未在自我監督模型的建構過程中明確考慮。特別是，我們展示了使用已學習嵌入進行錯誤分類識別、相似性搜尋和異常偵測的效能。一個令人驚訝的亮點是使用流形學習和降維演算法「重新發現」米拉子類型和兩個旋轉變數子類別。據我們所知，這是天文學中第一個建構 $n>2$ 模式模型。使用這種方法自然會預期擴充至 $n>3$ 模式。</paragraph>", "author": "Mariia Rizhko et.al.", "authors": "Mariia Rizhko, Joshua S. Bloom", "id": "2411.08842v1", "paper_url": "http://arxiv.org/abs/2411.08842v1", "repo": "null"}}