{"2412.19423": {"publish_time": "2024-12-27", "title": "Revisiting PCA for time series reduction in temporal dimension", "paper_summary": "Revisiting PCA for Time Series Reduction in Temporal Dimension; Jiaxin Gao,\nWenbo Hu, Yuntian Chen; Deep learning has significantly advanced time series\nanalysis (TSA), enabling the extraction of complex patterns for tasks like\nclassification, forecasting, and regression. Although dimensionality reduction\nhas traditionally focused on the variable space-achieving notable success in\nminimizing data redundancy and computational complexity-less attention has been\npaid to reducing the temporal dimension. In this study, we revisit Principal\nComponent Analysis (PCA), a classical dimensionality reduction technique, to\nexplore its utility in temporal dimension reduction for time series data. It is\ngenerally thought that applying PCA to the temporal dimension would disrupt\ntemporal dependencies, leading to limited exploration in this area. However,\nour theoretical analysis and extensive experiments demonstrate that applying\nPCA to sliding series windows not only maintains model performance, but also\nenhances computational efficiency. In auto-regressive forecasting, the temporal\nstructure is partially preserved through windowing, and PCA is applied within\nthese windows to denoise the time series while retaining their statistical\ninformation. By preprocessing time-series data with PCA, we reduce the temporal\ndimensionality before feeding it into TSA models such as Linear, Transformer,\nCNN, and RNN architectures. This approach accelerates training and inference\nand reduces resource consumption. Notably, PCA improves Informer training and\ninference speed by up to 40% and decreases GPU memory usage of TimesNet by 30%,\nwithout sacrificing model accuracy. Comparative analysis against other\nreduction methods further highlights the effectiveness of PCA in improving the\nefficiency of TSA models.", "paper_summary_zh": "<paragraph>重訪時間維度中 PCA 時序簡約；賈鑫高、胡文波、陳雲天；深度學習顯著地提升了時序分析 (TSA)，能為分類、預測和迴歸等任務萃取複雜模式。儘管降維傳統上專注於變數空間，在最小化資料冗餘和運算複雜度上取得顯著成功，但較少關注於減少時間維度。在這項研究中，我們重新探討主成分分析 (PCA)，一種經典的降維技術，以探索其在時序資料時間維度簡約中的效用。一般認為將 PCA 應用於時間維度會破壞時間依賴性，導致在這個領域的探索有限。然而，我們的理論分析和廣泛實驗證明，將 PCA 應用於滑動序列視窗不僅能維持模型效能，還能提升運算效率。在自迴歸預測中，時間結構部分地透過視窗化保留，而 PCA 在這些視窗中應用以去除時序雜訊，同時保留其統計資訊。透過 PCA 預處理時序資料，我們在將其輸入 TSA 模型（例如線性、Transformer、CNN 和 RNN 架構）之前降低時間維度。這種方法加速訓練和推論，並減少資源消耗。值得注意的是，PCA 將 Informer 訓練和推論速度提升了 40%，並將 TimesNet 的 GPU 記憶體使用量減少了 30%，且不犧牲模型準確度。與其他簡約方法的比較分析進一步突顯了 PCA 在提升 TSA 模型效率方面的效用。</paragraph>", "author": "Jiaxin Gao et.al.", "authors": "Jiaxin Gao, Wenbo Hu, Yuntian Chen", "id": "2412.19423v1", "paper_url": "http://arxiv.org/abs/2412.19423v1", "repo": "null"}}