{"2405.18281": {"publish_time": "2024-05-28", "title": "MODL: Multilearner Online Deep Learning", "paper_summary": "Online deep learning solves the problem of learning from streams of data,\nreconciling two opposing objectives: learn fast and learn deep. Existing work\nfocuses almost exclusively on exploring pure deep learning solutions, which are\nmuch better suited to handle the \"deep\" than the \"fast\" part of the online\nlearning equation. In our work, we propose a different paradigm, based on a\nhybrid multilearner approach. First, we develop a fast online logistic\nregression learner. This learner does not rely on backpropagation. Instead, it\nuses closed form recursive updates of model parameters, handling the fast\nlearning part of the online learning problem. We then analyze the existing\nonline deep learning theory and show that the widespread ODL approach,\ncurrently operating at complexity $O(L^2)$ in terms of the number of layers\n$L$, can be equivalently implemented in $O(L)$ complexity. This further leads\nus to the cascaded multilearner design, in which multiple shallow and deep\nlearners are co-trained to solve the online learning problem in a cooperative,\nsynergistic fashion. We show that this approach achieves state-of-the-art\nresults on common online learning datasets, while also being able to handle\nmissing features gracefully. Our code is publicly available at\nhttps://github.com/AntonValk/MODL.", "paper_summary_zh": "線上深度學習解決了從資料串流中學習的問題，調和了兩個對立的目標：快速學習和深入學習。現有研究幾乎完全專注於探索純深度學習解決方案，而這更適合處理線上學習方程式中的「深入」而非「快速」部分。在我們的研究中，我們提出一個不同的範例，基於混合多學習者方法。首先，我們開發一個快速的線上邏輯迴歸學習器。這個學習器不依賴反向傳播。相反，它使用模型參數的封閉形式遞迴更新，處理線上學習問題的快速學習部分。然後我們分析現有的線上深度學習理論，並展示廣泛的 ODL 方法，目前在層數 $L$ 方面以 $O(L^2)$ 的複雜度運作，可以用 $O(L)$ 的複雜度等效實作。這進一步引領我們到串聯多學習者設計，其中多個淺層和深層學習器共同訓練，以協作、協同的方式解決線上學習問題。我們展示這個方法在常見的線上學習資料集上取得最先進的結果，同時也能優雅地處理遺失的特徵。我們的程式碼公開於 https://github.com/AntonValk/MODL。", "author": "Antonios Valkanas et.al.", "authors": "Antonios Valkanas, Boris N. Oreshkin, Mark Coates", "id": "2405.18281v1", "paper_url": "http://arxiv.org/abs/2405.18281v1", "repo": "null"}}