{"2412.04835": {"publish_time": "2024-12-06", "title": "Maximizing Alignment with Minimal Feedback: Efficiently Learning Rewards for Visuomotor Robot Policy Alignment", "paper_summary": "Visuomotor robot policies, increasingly pre-trained on large-scale datasets,\npromise significant advancements across robotics domains. However, aligning\nthese policies with end-user preferences remains a challenge, particularly when\nthe preferences are hard to specify. While reinforcement learning from human\nfeedback (RLHF) has become the predominant mechanism for alignment in\nnon-embodied domains like large language models, it has not seen the same\nsuccess in aligning visuomotor policies due to the prohibitive amount of human\nfeedback required to learn visual reward functions. To address this limitation,\nwe propose Representation-Aligned Preference-based Learning (RAPL), an\nobservation-only method for learning visual rewards from significantly less\nhuman preference feedback. Unlike traditional RLHF, RAPL focuses human feedback\non fine-tuning pre-trained vision encoders to align with the end-user's visual\nrepresentation and then constructs a dense visual reward via feature matching\nin this aligned representation space. We first validate RAPL through simulation\nexperiments in the X-Magical benchmark and Franka Panda robotic manipulation,\ndemonstrating that it can learn rewards aligned with human preferences, more\nefficiently uses preference data, and generalizes across robot embodiments.\nFinally, our hardware experiments align pre-trained Diffusion Policies for\nthree object manipulation tasks. We find that RAPL can fine-tune these policies\nwith 5x less real human preference data, taking the first step towards\nminimizing human feedback while maximizing visuomotor robot policy alignment.", "paper_summary_zh": "視覺運動機器人策略日益在大型資料集上進行預訓練，承諾在機器人領域中取得重大進展。然而，將這些策略與最終使用者的偏好保持一致仍然是一個挑戰，特別是在偏好難以具體說明時。雖然從人類回饋中進行強化學習 (RLHF) 已成為大型語言模型等非具身領域中進行調整的主要機制，但由於學習視覺獎勵函數需要大量的人類回饋，因此在調整視覺運動策略方面尚未取得相同的成功。為了解決這個限制，我們提出基於表示對齊偏好的學習 (RAPL)，這是一種僅觀察的方法，可以用少得多的偏好回饋來學習視覺獎勵。與傳統的 RLHF 不同，RAPL 將人類回饋集中在微調預訓練的視覺編碼器上，以與最終使用者的視覺表示保持一致，然後通過在這個對齊的表示空間中進行特徵匹配來構建密集的視覺獎勵。我們首先通過 X-Magical 基準和 Franka Panda 機器人操作中的模擬實驗驗證了 RAPL，證明它可以學習與人類偏好一致的獎勵，更有效地使用偏好數據，並在機器人具體實例中進行概括。最後，我們的硬體實驗調整了預訓練的擴散策略，以執行三個物體操作任務。我們發現 RAPL 可以使用少 5 倍的真實人類偏好數據微調這些策略，這是朝著最大程度減少人類回饋並最大程度提高視覺運動機器人策略對齊邁出的第一步。", "author": "Ran Tian et.al.", "authors": "Ran Tian, Yilin Wu, Chenfeng Xu, Masayoshi Tomizuka, Jitendra Malik, Andrea Bajcsy", "id": "2412.04835v1", "paper_url": "http://arxiv.org/abs/2412.04835v1", "repo": "null"}}