{"2406.06131": {"publish_time": "2024-06-10", "title": "Building Bridges: A Dataset for Evaluating Gender-Fair Machine Translation into German", "paper_summary": "The translation of gender-neutral person-referring terms (e.g., the students)\nis often non-trivial. Translating from English into German poses an interesting\ncase -- in German, person-referring nouns are usually gender-specific, and if\nthe gender of the referent(s) is unknown or diverse, the generic masculine (die\nStudenten (m.)) is commonly used. This solution, however, reduces the\nvisibility of other genders, such as women and non-binary people. To counteract\ngender discrimination, a societal movement towards using gender-fair language\nexists (e.g., by adopting neosystems). However, gender-fair German is currently\nbarely supported in machine translation (MT), requiring post-editing or manual\ntranslations. We address this research gap by studying gender-fair language in\nEnglish-to-German MT. Concretely, we enrich a community-created gender-fair\nlanguage dictionary and sample multi-sentence test instances from encyclopedic\ntext and parliamentary speeches. Using these novel resources, we conduct the\nfirst benchmark study involving two commercial systems and six neural MT models\nfor translating words in isolation and natural contexts across two domains. Our\nfindings show that most systems produce mainly masculine forms and rarely\ngender-neutral variants, highlighting the need for future research. We release\ncode and data at\nhttps://github.com/g8a9/building-bridges-gender-fair-german-mt.", "paper_summary_zh": "性別中立的人稱術語（例如學生）的翻譯通常非同小可。從英語翻譯成德語是一個有趣的案例——在德語中，人稱名詞通常是性別特定的，如果所指者的性別未知或多樣，則通常使用一般陽性（die Studenten (m.)）。然而，這種解決方案降低了其他性別（例如女性和非二元性別者）的能見度。為了對抗性別歧視，存在著一種使用性別公平語言的社會運動（例如，通過採用新系統）。然而，性別公平的德語目前在機器翻譯（MT）中幾乎沒有支持，需要後編輯或人工翻譯。我們通過研究英譯德 MT 中的性別公平語言來解決這一研究差距。具體來說，我們豐富了一本社區創建的性別公平語言詞典，並從百科全書文本和議會演講中抽取了多句測試實例。使用這些新資源，我們進行了第一個基準研究，其中涉及兩個商業系統和六個神經 MT 模型，用於翻譯兩個領域中孤立的單詞和自然語境。我們的研究結果表明，大多數系統主要產生陽性形式，很少產生性別中立的變體，這突顯了未來研究的必要性。我們在 https://github.com/g8a9/building-bridges-gender-fair-german-mt. 發布代碼和數據。", "author": "Manuel Lardelli et.al.", "authors": "Manuel Lardelli, Giuseppe Attanasio, Anne Lauscher", "id": "2406.06131v1", "paper_url": "http://arxiv.org/abs/2406.06131v1", "repo": "https://github.com/g8a9/building-bridges-gender-fair-german-mt"}}