{"2412.15726": {"publish_time": "2024-12-20", "title": "Fine-tuning Whisper on Low-Resource Languages for Real-World Applications", "paper_summary": "This paper presents a new approach to fine-tuning OpenAI's Whisper model for\nlow-resource languages by introducing a novel data generation method that\nconverts sentence-level data into a long-form corpus, using Swiss German as a\ncase study. Non-sentence-level data, which could improve the performance of\nlong-form audio, is difficult to obtain and often restricted by copyright laws.\nOur method bridges this gap by transforming more accessible sentence-level data\ninto a format that preserves the model's ability to handle long-form audio and\nperform segmentation without requiring non-sentence-level data. Our data\ngeneration process improves performance in several real-world applications and\nleads to the development of a new state-of-the-art speech-to-text (STT) model\nfor Swiss German. We compare our model with a non-fine-tuned Whisper and our\nprevious state-of-the-art Swiss German STT models, where our new model achieves\nhigher BLEU scores. Our results also indicate that the proposed method is\nadaptable to other low-resource languages, supported by written guidance and\ncode that allows the creation of fine-tuned Whisper models, which keep\nsegmentation capabilities and allow the transcription of longer audio files\nusing only sentence-level data with high quality.", "paper_summary_zh": "本文提出了一種微調 OpenAI 的 Whisper 模型的新方法，適用於資源匱乏的語言，方法是引入一種新穎的資料產生方法，將句子層級的資料轉換為長篇語料庫，並以瑞士德語作為案例研究。非句子層級的資料可能會改善長篇音訊的效能，但難以取得，且通常受到著作權法的限制。我們的做法透過將較容易取得的句子層級資料轉換為一種格式，來彌補這個差距，這種格式能保留模型處理長篇音訊和執行分段的能力，而不需要非句子層級的資料。我們的資料產生程序改善了多種真實世界應用程式的效能，並導致開發出一個新的瑞士德語語音轉文字 (STT) 最先進模型。我們將我們的模型與未微調的 Whisper 和我們先前最先進的瑞士德語 STT 模型進行比較，我們的模型獲得更高的 BLEU 分數。我們的結果還表明，所提出的方法適用於其他資源匱乏的語言，並受書面指南和程式碼支援，這些指南和程式碼允許建立微調的 Whisper 模型，這些模型保留分段功能，並允許僅使用高品質的句子層級資料轉錄較長的音訊檔案。", "author": "Vincenzo Timmel et.al.", "authors": "Vincenzo Timmel, Claudio Paonessa, Reza Kakooee, Manfred Vogel, Daniel Perruchoud", "id": "2412.15726v1", "paper_url": "http://arxiv.org/abs/2412.15726v1", "repo": "https://github.com/i4ds/whisper-finetune"}}