{"2407.11978": {"publish_time": "2024-05-27", "title": "\"It depends\": Configuring AI to Improve Clinical Usefulness Across Contexts", "paper_summary": "Artificial Intelligence (AI) repeatedly match or outperform radiologists in\nlab experiments. However, real-world implementations of radiological AI-based\nsystems are found to provide little to no clinical value. This paper explores\nhow to design AI for clinical usefulness in different contexts. We conducted 19\ndesign sessions and design interventions with 13 radiologists from 7 clinical\nsites in Denmark and Kenya, based on three iterations of a functional AI-based\nprototype. Ten sociotechnical dependencies were identified as crucial for the\ndesign of AI in radiology. We conceptualised four technical dimensions that\nmust be configured to the intended clinical context of use: AI functionality,\nAI medical focus, AI decision threshold, and AI Explainability. We present four\ndesign recommendations on how to address dependencies pertaining to the medical\nknowledge, clinic type, user expertise level, patient context, and user\nsituation that condition the configuration of these technical dimensions.", "paper_summary_zh": "人工智慧（AI）在實驗室實驗中不斷地與放射科醫師匹敵或表現得更出色。然而，發現放射科 AI 為基礎系統的實際執行幾乎沒有提供臨床價值。本文探討如何為 AI 設計在不同情境中臨床上的效用。我們根據功能性 AI 為基礎原型的三次迭代，在丹麥和肯亞的 7 個臨床場域與 13 位放射科醫師進行了 19 次設計會議和設計介入。十個社會技術依賴關係被認為對於放射科中 AI 的設計至關重要。我們概念化了四個技術面向，必須根據預期的臨床使用情境進行設定：AI 功能、AI 醫療重點、AI 決策門檻，以及 AI 可解釋性。我們提出四項設計建議，說明如何處理與醫療知識、診所類型、使用者專業知識等級、患者情境，以及影響這些技術面向設定的使用者情境相關的依賴關係。", "author": "Hubert D. Zając et.al.", "authors": "Hubert D. Zając, Jorge M. N. Ribeiro, Silvia Ingala, Simona Gentile, Ruth Wanjohi, Samuel N. Gitau, Jonathan F. Carlsen, Michael B. Nielsen, Tariq O. Andersen", "id": "2407.11978v1", "paper_url": "http://arxiv.org/abs/2407.11978v1", "repo": "null"}}