{"2501.03824": {"publish_time": "2025-01-07", "title": "Online Reinforcement Learning-Based Dynamic Adaptive Evaluation Function for Real-Time Strategy Tasks", "paper_summary": "Effective evaluation of real-time strategy tasks requires adaptive mechanisms\nto cope with dynamic and unpredictable environments. This study proposes a\nmethod to improve evaluation functions for real-time responsiveness to\nbattle-field situation changes, utilizing an online reinforcement\nlearning-based dynam-ic weight adjustment mechanism within the real-time\nstrategy game. Building on traditional static evaluation functions, the method\nemploys gradient descent in online reinforcement learning to update weights\ndynamically, incorporating weight decay techniques to ensure stability.\nAdditionally, the AdamW optimizer is integrated to adjust the learning rate and\ndecay rate of online reinforcement learning in real time, further reducing the\ndependency on manual parameter tun-ing. Round-robin competition experiments\ndemonstrate that this method signifi-cantly enhances the application\neffectiveness of the Lanchester combat model evaluation function, Simple\nevaluation function, and Simple Sqrt evaluation function in planning algorithms\nincluding IDABCD, IDRTMinimax, and Port-folio AI. The method achieves a notable\nimprovement in scores, with the en-hancement becoming more pronounced as the\nmap size increases. Furthermore, the increase in evaluation function\ncomputation time induced by this method is kept below 6% for all evaluation\nfunctions and planning algorithms. The pro-posed dynamic adaptive evaluation\nfunction demonstrates a promising approach for real-time strategy task\nevaluation.", "paper_summary_zh": "<paragraph>有效評估即時策略任務需要適應機制來應對動態且不可預測的環境。本研究提出了一種方法，用於改善即時響應戰場狀況變化的評估函數，利用即時策略遊戲中的基於線上強化學習的動態權重調整機制。在傳統靜態評估函數的基礎上，該方法採用線上強化學習中的梯度下降法動態更新權重，並結合權重衰減技術來確保穩定性。此外，AdamW 優化器被整合用於調整線上強化學習的學習率和衰減率，進一步降低了對手動參數調整的依賴性。輪詢競爭實驗表明，這種方法顯著提高了蘭徹斯特戰鬥模型評估函數、簡單評估函數和簡單平方根評估函數在包括 IDABCD、IDRTMinimax 和組合 AI 在內的規劃演算法中的應用效果。該方法在分數上取得了顯著的改進，隨著地圖大小的增加，這種改進變得更加明顯。此外，該方法引起的評估函數計算時間增加對於所有評估函數和規劃演算法都保持在 6% 以下。所提出的動態自適應評估函數展示了即時策略任務評估的有前景的方法。</paragraph>", "author": "Weilong Yang et.al.", "authors": "Weilong Yang, Jie Zhang, Xunyun Liu, Yanqing Ye", "id": "2501.03824v1", "paper_url": "http://arxiv.org/abs/2501.03824v1", "repo": "null"}}