{"2410.06704": {"publish_time": "2024-10-09", "title": "PII-Scope: A Benchmark for Training Data PII Leakage Assessment in LLMs", "paper_summary": "In this work, we introduce PII-Scope, a comprehensive benchmark designed to\nevaluate state-of-the-art methodologies for PII extraction attacks targeting\nLLMs across diverse threat settings. Our study provides a deeper understanding\nof these attacks by uncovering several hyperparameters (e.g., demonstration\nselection) crucial to their effectiveness. Building on this understanding, we\nextend our study to more realistic attack scenarios, exploring PII attacks that\nemploy advanced adversarial strategies, including repeated and diverse\nquerying, and leveraging iterative learning for continual PII extraction.\nThrough extensive experimentation, our results reveal a notable underestimation\nof PII leakage in existing single-query attacks. In fact, we show that with\nsophisticated adversarial capabilities and a limited query budget, PII\nextraction rates can increase by up to fivefold when targeting the pretrained\nmodel. Moreover, we evaluate PII leakage on finetuned models, showing that they\nare more vulnerable to leakage than pretrained models. Overall, our work\nestablishes a rigorous empirical benchmark for PII extraction attacks in\nrealistic threat scenarios and provides a strong foundation for developing\neffective mitigation strategies.", "paper_summary_zh": "在這項工作中，我們介紹 PII-Scope，一個全面的基準，旨在評估針對 LLM 的 PII 提取攻擊的最先進方法，涵蓋各種威脅設定。我們的研究透過揭露幾個對其有效性至關重要的超參數（例如，示範選擇）來更深入地了解這些攻擊。根據這項了解，我們將研究擴展到更實際的攻擊場景，探索採用進階對抗策略的 PII 攻擊，包括重複且多樣化的查詢，以及利用反覆學習進行持續的 PII 提取。透過廣泛的實驗，我們的結果揭示了現有單一查詢攻擊中對 PII 洩漏的顯著低估。事實上，我們表明，在具備精密的對抗能力和有限的查詢預算下，針對預訓練模型時，PII 提取率可以提高五倍。此外，我們評估了微調模型上的 PII 洩漏，表明它們比預訓練模型更容易受到洩漏的影響。總體而言，我們的研究為實際威脅場景中的 PII 提取攻擊建立了一個嚴謹的經驗基準，並為開發有效的緩解策略奠定了堅實的基礎。", "author": "Krishna Kanth Nakka et.al.", "authors": "Krishna Kanth Nakka, Ahmed Frikha, Ricardo Mendes, Xue Jiang, Xuebing Zhou", "id": "2410.06704v1", "paper_url": "http://arxiv.org/abs/2410.06704v1", "repo": "null"}}