{"2409.04481": {"publish_time": "2024-09-06", "title": "Large Language Models in Drug Discovery and Development: From Disease Mechanisms to Clinical Trials", "paper_summary": "The integration of Large Language Models (LLMs) into the drug discovery and\ndevelopment field marks a significant paradigm shift, offering novel\nmethodologies for understanding disease mechanisms, facilitating drug\ndiscovery, and optimizing clinical trial processes. This review highlights the\nexpanding role of LLMs in revolutionizing various stages of the drug\ndevelopment pipeline. We investigate how these advanced computational models\ncan uncover target-disease linkage, interpret complex biomedical data, enhance\ndrug molecule design, predict drug efficacy and safety profiles, and facilitate\nclinical trial processes. Our paper aims to provide a comprehensive overview\nfor researchers and practitioners in computational biology, pharmacology, and\nAI4Science by offering insights into the potential transformative impact of\nLLMs on drug discovery and development.", "paper_summary_zh": "大型語言模型（LLM）整合到藥物發現和開發領域標誌著重大的典範轉移，提供了解疾病機制、促進藥物發現和優化臨床試驗流程的新方法。本綜述重點介紹了 LLM 在革新藥物開發管線各個階段中日益重要的作用。我們探討了這些先進的計算模型如何揭示靶點疾病關聯性、解釋複雜的生物醫學數據、增強藥物分子設計、預測藥物療效和安全性，以及促進臨床試驗流程。我們的論文旨在為計算生物學、藥理學和 AI4Science 的研究人員和從業者提供全面的概述，深入了解 LLM 對藥物發現和開發的潛在變革性影響。", "author": "Yizhen Zheng et.al.", "authors": "Yizhen Zheng, Huan Yee Koh, Maddie Yang, Li Li, Lauren T. May, Geoffrey I. Webb, Shirui Pan, George Church", "id": "2409.04481v1", "paper_url": "http://arxiv.org/abs/2409.04481v1", "repo": "null"}}