{"2407.02217": {"publish_time": "2024-07-02", "title": "Physics-Informed Model and Hybrid Planning for Efficient Dyna-Style Reinforcement Learning", "paper_summary": "Applying reinforcement learning (RL) to real-world applications requires\naddressing a trade-off between asymptotic performance, sample efficiency, and\ninference time. In this work, we demonstrate how to address this triple\nchallenge by leveraging partial physical knowledge about the system dynamics.\nOur approach involves learning a physics-informed model to boost sample\nefficiency and generating imaginary trajectories from this model to learn a\nmodel-free policy and Q-function. Furthermore, we propose a hybrid planning\nstrategy, combining the learned policy and Q-function with the learned model to\nenhance time efficiency in planning. Through practical demonstrations, we\nillustrate that our method improves the compromise between sample efficiency,\ntime efficiency, and performance over state-of-the-art methods.", "paper_summary_zh": "將強化學習 (RL) 應用於實際應用中需要\n解決漸近效能、樣本效率和推論時間之間的權衡。在這項工作中，我們展示如何透過利用系統動態的部分物理知識來解決這個三重挑戰。\n我們的做法包括學習一個物理資訊模型來提升樣本效率，並從這個模型產生假想軌跡來學習一個無模型策略和 Q 函數。此外，我們提出一個混合規劃策略，將學習到的策略和 Q 函數與學習到的模型結合，以提升規劃中的時間效率。透過實際示範，我們說明我們的方法改善了樣本效率、時間效率和效能之間的折衷，優於最先進的方法。", "author": "Zakariae El Asri et.al.", "authors": "Zakariae El Asri, Olivier Sigaud, Nicolas Thome", "id": "2407.02217v1", "paper_url": "http://arxiv.org/abs/2407.02217v1", "repo": "null"}}