{"2412.18288": {"publish_time": "2024-12-24", "title": "Towards understanding how attention mechanism works in deep learning", "paper_summary": "Attention mechanism has been extensively integrated within mainstream neural\nnetwork architectures, such as Transformers and graph attention networks. Yet,\nits underlying working principles remain somewhat elusive. What is its essence?\nAre there any connections between it and traditional machine learning\nalgorithms? In this study, we inspect the process of computing similarity using\nclassic metrics and vector space properties in manifold learning, clustering,\nand supervised learning. We identify the key characteristics of similarity\ncomputation and information propagation in these methods and demonstrate that\nthe self-attention mechanism in deep learning adheres to the same principles\nbut operates more flexibly and adaptively. We decompose the self-attention\nmechanism into a learnable pseudo-metric function and an information\npropagation process based on similarity computation. We prove that the\nself-attention mechanism converges to a drift-diffusion process through\ncontinuous modeling provided the pseudo-metric is a transformation of a metric\nand certain reasonable assumptions hold. This equation could be transformed\ninto a heat equation under a new metric. In addition, we give a first-order\nanalysis of attention mechanism with a general pseudo-metric function. This\nstudy aids in understanding the effects and principle of attention mechanism\nthrough physical intuition. Finally, we propose a modified attention mechanism\ncalled metric-attention by leveraging the concept of metric learning to\nfacilitate the ability to learn desired metrics more effectively. Experimental\nresults demonstrate that it outperforms self-attention regarding training\nefficiency, accuracy, and robustness.", "paper_summary_zh": "注意力机制已被广泛集成到主流神经网络架构中，例如 Transformer 和图注意力网络。然而，其底层工作原理仍然有些难以捉摸。它的本质是什么？它与传统机器学习算法之间有什么联系？在这项研究中，我们考察了使用经典度量和流形学习、聚类和监督学习中的向量空间属性计算相似性的过程。我们识别了这些方法中相似性计算和信息传播的关键特征，并证明了深度学习中的自注意力机制遵循相同的原则，但操作更灵活和自适应。我们将自注意力机制分解为可学习的伪度量函数和基于相似性计算的信息传播过程。我们证明了自注意力机制通过连续建模收敛到漂移扩散过程，前提是伪度量是度量的变换，并且某些合理的假设成立。该方程可以在新度量下转换为热方程。此外，我们对具有通用伪度量函数的注意力机制进行了**一阶分析**。本研究有助于通过物理直觉理解注意力机制的影响和原理。最后，我们提出了一种称为度量注意力的修改注意力机制，通过利用度量学习的概念来促进更有效地学习所需度量的能力。实验结果表明，它在训练效率、准确性和鲁棒性方面优于自注意力。", "author": "Tianyu Ruan et.al.", "authors": "Tianyu Ruan, Shihua Zhang", "id": "2412.18288v1", "paper_url": "http://arxiv.org/abs/2412.18288v1", "repo": "null"}}