{"2407.06405": {"publish_time": "2024-07-08", "title": "AI-driven multi-omics integration for multi-scale predictive modeling of causal genotype-environment-phenotype relationships", "paper_summary": "Despite the wealth of single-cell multi-omics data, it remains challenging to\npredict the consequences of novel genetic and chemical perturbations in the\nhuman body. It requires knowledge of molecular interactions at all biological\nlevels, encompassing disease models and humans. Current machine learning\nmethods primarily establish statistical correlations between genotypes and\nphenotypes but struggle to identify physiologically significant causal factors,\nlimiting their predictive power. Key challenges in predictive modeling include\nscarcity of labeled data, generalization across different domains, and\ndisentangling causation from correlation. In light of recent advances in\nmulti-omics data integration, we propose a new artificial intelligence\n(AI)-powered biology-inspired multi-scale modeling framework to tackle these\nissues. This framework will integrate multi-omics data across biological\nlevels, organism hierarchies, and species to predict causal\ngenotype-environment-phenotype relationships under various conditions. AI\nmodels inspired by biology may identify novel molecular targets, biomarkers,\npharmaceutical agents, and personalized medicines for presently unmet medical\nneeds.", "paper_summary_zh": "儘管有豐富的單細胞多組學資料，但預測人體中新的遺傳和化學擾動的後果仍然具有挑戰性。這需要了解所有生物層級的分子交互作用，包括疾病模型和人類。目前的機器學習方法主要建立基因型和表型之間的統計相關性，但難以識別生理上重要的因果因素，從而限制了其預測能力。預測建模中的主要挑戰包括標記資料的稀缺性、跨不同領域的概化，以及將因果關係從相關性中解開。鑑於多組學資料整合的最新進展，我們提出了一個新的由人工智慧 (AI) 驅動的、受生物啟發的多尺度建模框架來解決這些問題。此框架將整合跨生物層級、生物體層級和物種的多組學資料，以預測在各種條件下的因果基因型-環境-表型關係。受生物啟發的 AI 模型可能會識別出新的分子靶標、生物標記、藥物和個性化藥物，以滿足目前尚未滿足的醫療需求。", "author": "You Wu et.al.", "authors": "You Wu, Lei Xie", "id": "2407.06405v1", "paper_url": "http://arxiv.org/abs/2407.06405v1", "repo": "null"}}