{"2411.07516": {"publish_time": "2024-11-12", "title": "SparrowVQE: Visual Question Explanation for Course Content Understanding", "paper_summary": "Visual Question Answering (VQA) research seeks to create AI systems to answer\nnatural language questions in images, yet VQA methods often yield overly\nsimplistic and short answers. This paper aims to advance the field by\nintroducing Visual Question Explanation (VQE), which enhances the ability of\nVQA to provide detailed explanations rather than brief responses and address\nthe need for more complex interaction with visual content. We first created an\nMLVQE dataset from a 14-week streamed video machine learning course, including\n885 slide images, 110,407 words of transcripts, and 9,416 designed\nquestion-answer (QA) pairs. Next, we proposed a novel SparrowVQE, a small 3\nbillion parameters multimodal model. We trained our model with a three-stage\ntraining mechanism consisting of multimodal pre-training (slide images and\ntranscripts feature alignment), instruction tuning (tuning the pre-trained\nmodel with transcripts and QA pairs), and domain fine-tuning (fine-tuning slide\nimage and QA pairs). Eventually, our SparrowVQE can understand and connect\nvisual information using the SigLIP model with transcripts using the Phi-2\nlanguage model with an MLP adapter. Experimental results demonstrate that our\nSparrowVQE achieves better performance in our developed MLVQE dataset and\noutperforms state-of-the-art methods in the other five benchmark VQA datasets.\nThe source code is available at\n\\url{https://github.com/YoushanZhang/SparrowVQE}.", "paper_summary_zh": "<paragraph>視覺問答 (VQA) 研究致力於建立 AI 系統，以回答圖像中的自然語言問題，但 VQA 方法通常會產生過於簡化且簡短的答案。本文旨在透過引入視覺問題解釋 (VQE) 來推動該領域的進步，VQE 增強了 VQA 提供詳細解釋而非簡短回應的能力，並滿足了與視覺內容進行更複雜互動的需求。我們首先從 14 週串流影片機器學習課程中建立了 MLVQE 資料集，其中包含 885 張投影片圖片、110,407 個字的逐字稿和 9,416 個設計好的問答 (QA) 對。接下來，我們提出了一種新穎的 SparrowVQE，這是一個具有 30 億個參數的多模態模型。我們使用三階段訓練機制訓練我們的模型，包括多模態預訓練（投影片圖片和逐字稿特徵對齊）、指令微調（使用逐字稿和 QA 對微調預訓練模型）和領域微調（微調投影片圖片和 QA 對）。最終，我們的 SparrowVQE 能夠使用 SigLIP 模型理解和連結視覺資訊，並使用 Phi-2 語言模型和 MLP 適配器使用逐字稿。實驗結果證明，我們的 SparrowVQE 在我們開發的 MLVQE 資料集中取得了更好的效能，並在其他五個基準 VQA 資料集中優於最先進的方法。原始碼可在\n\\url{https://github.com/YoushanZhang/SparrowVQE} 取得。</paragraph>", "author": "Jialu Li et.al.", "authors": "Jialu Li, Manish Kumar Thota, Ruslan Gokhman, Radek Holik, Youshan Zhang", "id": "2411.07516v1", "paper_url": "http://arxiv.org/abs/2411.07516v1", "repo": "https://github.com/youshanzhang/sparrowvqe"}}