{"2406.18532": {"publish_time": "2024-06-26", "title": "Symbolic Learning Enables Self-Evolving Agents", "paper_summary": "The AI community has been exploring a pathway to artificial general\nintelligence (AGI) by developing \"language agents\", which are complex large\nlanguage models (LLMs) pipelines involving both prompting techniques and tool\nusage methods. While language agents have demonstrated impressive capabilities\nfor many real-world tasks, a fundamental limitation of current language agents\nresearch is that they are model-centric, or engineering-centric. That's to say,\nthe progress on prompts, tools, and pipelines of language agents requires\nsubstantial manual engineering efforts from human experts rather than\nautomatically learning from data. We believe the transition from model-centric,\nor engineering-centric, to data-centric, i.e., the ability of language agents\nto autonomously learn and evolve in environments, is the key for them to\npossibly achieve AGI.\n  In this work, we introduce agent symbolic learning, a systematic framework\nthat enables language agents to optimize themselves on their own in a\ndata-centric way using symbolic optimizers. Specifically, we consider agents as\nsymbolic networks where learnable weights are defined by prompts, tools, and\nthe way they are stacked together. Agent symbolic learning is designed to\noptimize the symbolic network within language agents by mimicking two\nfundamental algorithms in connectionist learning: back-propagation and gradient\ndescent. Instead of dealing with numeric weights, agent symbolic learning works\nwith natural language simulacrums of weights, loss, and gradients. We conduct\nproof-of-concept experiments on both standard benchmarks and complex real-world\ntasks and show that agent symbolic learning enables language agents to update\nthemselves after being created and deployed in the wild, resulting in\n\"self-evolving agents\".", "paper_summary_zh": "人工智慧社群已經透過開發「語言代理」，也就是包含提示技術和工具使用方式的複雜大型語言模型 (LLM) 管線，探索通往人工通用智慧 (AGI) 的途徑。儘管語言代理在許多實際任務中展現出令人印象深刻的能力，但目前語言代理研究的基本限制在於它們以模型為中心，或以工程為中心。也就是說，語言代理的提示、工具和管線的進度需要人類專家的大量手動工程，而不是自動從資料中學習。我們相信從以模型為中心或以工程為中心轉變為以資料為中心，也就是語言代理在環境中自主學習和演化的能力，是它們可能實現 AGI 的關鍵。\n在這項工作中，我們引入了代理符號學習，這是一個系統性的架構，讓語言代理能夠使用符號最佳化器以資料為中心的方式自行最佳化。具體來說，我們將代理視為符號網路，其中可學習的權重由提示、工具和堆疊在一起的方式定義。代理符號學習旨在透過模仿連接主義學習中的兩個基本演算法：反向傳播和梯度下降，來最佳化語言代理中的符號網路。代理符號學習並非處理數值權重，而是處理權重、損失和梯度的自然語言模擬。我們在標準基準和複雜的實際任務上進行了概念驗證實驗，並展示代理符號學習讓語言代理能夠在被建立和部署到實際環境後更新自己，進而產生「自我演化代理」。", "author": "Wangchunshu Zhou et.al.", "authors": "Wangchunshu Zhou, Yixin Ou, Shengwei Ding, Long Li, Jialong Wu, Tiannan Wang, Jiamin Chen, Shuai Wang, Xiaohua Xu, Ningyu Zhang, Huajun Chen, Yuchen Eleanor Jiang", "id": "2406.18532v1", "paper_url": "http://arxiv.org/abs/2406.18532v1", "repo": "https://github.com/aiwaves-cn/agents"}}