{"2504.18380": {"publish_time": "2025-04-25", "title": "Spatial Reasoner: A 3D Inference Pipeline for XR Applications", "paper_summary": "Modern extended reality XR systems provide rich analysis of image data and\nfusion of sensor input and demand AR/VR applications that can reason about 3D\nscenes in a semantic manner. We present a spatial reasoning framework that\nbridges geometric facts with symbolic predicates and relations to handle key\ntasks such as determining how 3D objects are arranged among each other ('on',\n'behind', 'near', etc.). Its foundation relies on oriented 3D bounding box\nrepresentations, enhanced by a comprehensive set of spatial predicates, ranging\nfrom topology and connectivity to directionality and orientation, expressed in\na formalism related to natural language. The derived predicates form a spatial\nknowledge graph and, in combination with a pipeline-based inference model,\nenable spatial queries and dynamic rule evaluation. Implementations for client-\nand server-side processing demonstrate the framework's capability to\nefficiently translate geometric data into actionable knowledge, ensuring\nscalable and technology-independent spatial reasoning in complex 3D\nenvironments. The Spatial Reasoner framework is fostering the creation of\nspatial ontologies, and seamlessly integrates with and therefore enriches\nmachine learning, natural language processing, and rule systems in XR\napplications.", "paper_summary_zh": "現代擴增實境 XR 系統提供豐富的影像資料分析和感測器輸入融合，並需要能夠以語義方式推理 3D 場景的 AR/VR 應用程式。我們提出了一個空間推理框架，它將幾何事實與符號謂詞和關係聯繫起來，以處理關鍵任務，例如確定 3D 物體如何相互排列（「在...上面」、「在...後面」、「靠近」等等）。它的基礎依賴於定向 3D 邊界框表示，並通過一組全面的空間謂詞進行增強，範圍從拓撲和連通性到方向性和方位，並以與自然語言相關的形式表達。導出的謂詞形成一個空間知識圖，並與基於管線的推理模型相結合，實現空間查詢和動態規則評估。客戶端和伺服器端處理的實作展示了該框架有效地將幾何資料轉化為可操作知識的能力，確保在複雜 3D 環境中進行可擴展且獨立於技術的空間推理。空間推理器框架正在促進空間本體的創建，並與機器學習、自然語言處理和 XR 應用程式中的規則系統無縫整合，從而豐富它們。\n", "author": "Steven Häsler et.al.", "authors": "Steven Häsler, Philipp Ackermann", "id": "2504.18380v1", "paper_url": "http://arxiv.org/abs/2504.18380v1", "repo": "null"}}