{"2409.10080": {"publish_time": "2024-09-16", "title": "DAE-Fuse: An Adaptive Discriminative Autoencoder for Multi-Modality Image Fusion", "paper_summary": "Multi-modality image fusion aims to integrate complementary data information\nfrom different imaging modalities into a single image. Existing methods often\ngenerate either blurry fused images that lose fine-grained semantic information\nor unnatural fused images that appear perceptually cropped from the inputs. In\nthis work, we propose a novel two-phase discriminative autoencoder framework,\ntermed DAE-Fuse, that generates sharp and natural fused images. In the\nadversarial feature extraction phase, we introduce two discriminative blocks\ninto the encoder-decoder architecture, providing an additional adversarial loss\nto better guide feature extraction by reconstructing the source images. While\nthe two discriminative blocks are adapted in the attention-guided\ncross-modality fusion phase to distinguish the structural differences between\nthe fused output and the source inputs, injecting more naturalness into the\nresults. Extensive experiments on public infrared-visible, medical image\nfusion, and downstream object detection datasets demonstrate our method's\nsuperiority and generalizability in both quantitative and qualitative\nevaluations.", "paper_summary_zh": "多模態影像融合旨在將來自不同影像模態的互補資料資訊整合到單一影像中。現有方法通常會產生模糊的融合影像，失去細緻的語意資訊，或是不自然的融合影像，在感知上看起來像是從輸入中裁切出來的。在這項工作中，我們提出一個新穎的兩階段判別式自編碼器框架，稱為 DAE-Fuse，可產生清晰且自然的融合影像。在對抗特徵提取階段，我們在編碼器-解碼器架構中引入兩個判別式區塊，提供額外的對抗損失，藉由重建原始影像來更好地引導特徵提取。雖然兩個判別式區塊在注意力引導的跨模態融合階段中進行調整，以區分融合輸出與原始輸入之間的結構差異，為結果注入更多自然性。針對公開紅外線可見光、醫學影像融合和下游物件偵測資料集進行的廣泛實驗證明了我們的方法在量化和定性評估中的優越性和泛化性。", "author": "Yuchen Guo et.al.", "authors": "Yuchen Guo, Ruoxiang Xu, Rongcheng Li, Zhenghao Wu, Weifeng Su", "id": "2409.10080v1", "paper_url": "http://arxiv.org/abs/2409.10080v1", "repo": "null"}}