{"2407.15754": {"publish_time": "2024-07-22", "title": "LongVideoBench: A Benchmark for Long-context Interleaved Video-Language Understanding", "paper_summary": "Large multimodal models (LMMs) are processing increasingly longer and richer\ninputs. Albeit the progress, few public benchmark is available to measure such\ndevelopment. To mitigate this gap, we introduce LongVideoBench, a\nquestion-answering benchmark that features video-language interleaved inputs up\nto an hour long. Our benchmark includes 3,763 varying-length web-collected\nvideos with their subtitles across diverse themes, designed to comprehensively\nevaluate LMMs on long-term multimodal understanding. To achieve this, we\ninterpret the primary challenge as to accurately retrieve and reason over\ndetailed multimodal information from long inputs. As such, we formulate a novel\nvideo question-answering task termed referring reasoning. Specifically, as part\nof the question, it contains a referring query that references related video\ncontexts, called referred context. The model is then required to reason over\nrelevant video details from the referred context. Following the paradigm of\nreferring reasoning, we curate 6,678 human-annotated multiple-choice questions\nin 17 fine-grained categories, establishing one of the most comprehensive\nbenchmarks for long-form video understanding. Evaluations suggest that the\nLongVideoBench presents significant challenges even for the most advanced\nproprietary models (e.g. GPT-4o, Gemini-1.5-Pro, GPT-4-Turbo), while their\nopen-source counterparts show an even larger performance gap. In addition, our\nresults indicate that model performance on the benchmark improves only when\nthey are capable of processing more frames, positioning LongVideoBench as a\nvaluable benchmark for evaluating future-generation long-context LMMs.", "paper_summary_zh": "大型多模態模型 (LMM) 正在處理越來越長且豐富的輸入。儘管進展順利，但很少有公開基準可用於衡量此類開發。為了縮小這種差距，我們引入了 LongVideoBench，這是一個問答基準，其特點是長達一小時的視訊語言交錯輸入。我們的基準包括 3,763 個長度不同的網路收集視訊及其字幕，涵蓋各種主題，旨在全面評估 LMM 在長期多模態理解上的表現。為此，我們將主要挑戰詮釋為準確擷取和推論長輸入中的詳細多模態資訊。因此，我們制定了一項新穎的視訊問答任務，稱為指涉推理。具體來說，它包含一個指涉查詢作為問題的一部分，該查詢參考相關視訊內容，稱為指涉內容。然後，模型需要根據指涉內容中的相關視訊細節進行推理。遵循指涉推理的範例，我們策劃了 6,678 個由人工標註的多重選擇題，分為 17 個細緻類別，建立了最全面的長篇視訊理解基準之一。評估表明，即使是最先進的專有模型（例如 GPT-4o、Gemini-1.5-Pro、GPT-4-Turbo），LongVideoBench 也提出了重大挑戰，而它們的開源對應模型則顯示出更大的效能差距。此外，我們的結果表明，模型在基準上的效能只有在它們能夠處理更多幀時才會提升，這使得 LongVideoBench 成為評估未來世代長內容 LMM 的寶貴基準。", "author": "Haoning Wu et.al.", "authors": "Haoning Wu, Dongxu Li, Bei Chen, Junnan Li", "id": "2407.15754v1", "paper_url": "http://arxiv.org/abs/2407.15754v1", "repo": "https://github.com/longvideobench/longvideobench"}}