{"2412.11927": {"publish_time": "2024-12-16", "title": "Explainable Procedural Mistake Detection", "paper_summary": "Automated task guidance has recently attracted attention from the AI research\ncommunity. Procedural mistake detection (PMD) is a challenging sub-problem of\nclassifying whether a human user (observed through egocentric video) has\nsuccessfully executed the task at hand (specified by a procedural text).\nDespite significant efforts in building resources and models for PMD, machine\nperformance remains nonviable, and the reasoning processes underlying this\nperformance are opaque. As such, we recast PMD to an explanatory self-dialog of\nquestions and answers, which serve as evidence for a decision. As this\nreformulation enables an unprecedented transparency, we leverage a fine-tuned\nnatural language inference (NLI) model to formulate two automated coherence\nmetrics for generated explanations. Our results show that while open-source\nVLMs struggle with this task off-the-shelf, their accuracy, coherence, and\ndialog efficiency can be vastly improved by incorporating these coherence\nmetrics into common inference and fine-tuning methods. Furthermore, our\nmulti-faceted metrics can visualize common outcomes at a glance, highlighting\nareas for improvement.", "paper_summary_zh": "自動化任務指導最近引起了人工智慧研究社群的關注。程序錯誤偵測 (PMD) 是分類人類使用者 (透過自我中心視訊觀察) 是否已成功執行手邊任務 (由程序文字指定) 的一個具有挑戰性的子問題。儘管在建構 PMD 資源和模型方面投入了大量心力，但機器效能仍無法發揮作用，而此效能背後的推理程序也不透明。因此，我們將 PMD 改寫為一個說明性的自我對話，包含問題和答案，作為決策的證據。由於這種重新表述提供了前所未有的透明度，我們利用微調後的自然語言推理 (NLI) 模型來制定兩個用於生成說明的自動化一致性指標。我們的結果顯示，雖然開放原始碼 VLM 在此任務上現階段仍有困難，但透過將這些一致性指標納入常見的推理和微調方法，它們的準確性、一致性和對話效率可以大幅提升。此外，我們多面向的指標可以一目了然地視覺化常見結果，並強調需要改進的地方。", "author": "Shane Storks et.al.", "authors": "Shane Storks, Itamar Bar-Yossef, Yayuan Li, Zheyuan Zhang, Jason J. Corso, Joyce Chai", "id": "2412.11927v1", "paper_url": "http://arxiv.org/abs/2412.11927v1", "repo": "null"}}