{"2410.07751": {"publish_time": "2024-10-10", "title": "Learning Low-Level Causal Relations using a Simulated Robotic Arm", "paper_summary": "Causal learning allows humans to predict the effect of their actions on the\nknown environment and use this knowledge to plan the execution of more complex\nactions. Such knowledge also captures the behaviour of the environment and can\nbe used for its analysis and the reasoning behind the behaviour. This type of\nknowledge is also crucial in the design of intelligent robotic systems with\ncommon sense. In this paper, we study causal relations by learning the forward\nand inverse models based on data generated by a simulated robotic arm involved\nin two sensorimotor tasks. As a next step, we investigate feature attribution\nmethods for the analysis of the forward model, which reveals the low-level\ncausal effects corresponding to individual features of the state vector related\nto both the arm joints and the environment features. This type of analysis\nprovides solid ground for dimensionality reduction of the state\nrepresentations, as well as for the aggregation of knowledge towards the\nexplainability of causal effects at higher levels.", "paper_summary_zh": "因果學習讓人們能夠預測其行為對已知環境的影響，並利用此知識來規劃執行更複雜的行為。此類知識也捕捉環境的行為，可供其分析和行為背後的推理使用。此類型的知識在具備常識的智慧型機器人系統設計中也至關重要。在本文中，我們透過學習基於模擬機器手臂參與兩項感測運動任務所產生資料的正向和反向模型來研究因果關係。作為下一步，我們調查正向模型分析的功能屬性方法，揭示與手臂關節和環境特徵相關的狀態向量的個別特徵對應的低階因果效應。此類型的分析為狀態表示的維度縮減提供了堅實的基礎，並為更高層級因果效應的可解釋性彙整知識。", "author": "Miroslav Cibula et.al.", "authors": "Miroslav Cibula, Matthias Kerzel, Igor Farkaš", "id": "2410.07751v1", "paper_url": "http://arxiv.org/abs/2410.07751v1", "repo": "null"}}