{"2501.02765": {"publish_time": "2025-01-06", "title": "Visual Large Language Models for Generalized and Specialized Applications", "paper_summary": "Visual-language models (VLM) have emerged as a powerful tool for learning a\nunified embedding space for vision and language. Inspired by large language\nmodels, which have demonstrated strong reasoning and multi-task capabilities,\nvisual large language models (VLLMs) are gaining increasing attention for\nbuilding general-purpose VLMs. Despite the significant progress made in VLLMs,\nthe related literature remains limited, particularly from a comprehensive\napplication perspective, encompassing generalized and specialized applications\nacross vision (image, video, depth), action, and language modalities. In this\nsurvey, we focus on the diverse applications of VLLMs, examining their using\nscenarios, identifying ethics consideration and challenges, and discussing\nfuture directions for their development. By synthesizing these contents, we aim\nto provide a comprehensive guide that will pave the way for future innovations\nand broader applications of VLLMs. The paper list repository is available:\nhttps://github.com/JackYFL/awesome-VLLMs.", "paper_summary_zh": "視覺語言模型 (VLM) 已成為學習視覺和語言統一嵌入空間的強大工具。受大型語言模型的啟發，這些模型已展現出強大的推理和多任務能力，視覺大型語言模型 (VLLM) 正越來越受到關注，用於建構通用 VLM。儘管 VLLM 已取得顯著進展，但相關文獻仍然有限，特別是從全面的應用觀點來看，涵蓋視覺（影像、影片、深度）、動作和語言模式的廣義和專門應用。在這項調查中，我們專注於 VLLM 的多樣化應用，探討它們的使用情境、找出道德考量和挑戰，並討論它們未來的發展方向。透過綜合這些內容，我們旨在提供一份全面的指南，為 VLLM 未來的創新和更廣泛的應用鋪路。論文清單儲存庫已提供：https://github.com/JackYFL/awesome-VLLMs。", "author": "Yifan Li et.al.", "authors": "Yifan Li, Zhixin Lai, Wentao Bao, Zhen Tan, Anh Dao, Kewei Sui, Jiayi Shen, Dong Liu, Huan Liu, Yu Kong", "id": "2501.02765v1", "paper_url": "http://arxiv.org/abs/2501.02765v1", "repo": "https://github.com/jackyfl/awesome-vllms"}}