{"2407.16142": {"publish_time": "2024-07-23", "title": "Diffusion Models as Optimizers for Efficient Planning in Offline RL", "paper_summary": "Diffusion models have shown strong competitiveness in offline reinforcement\nlearning tasks by formulating decision-making as sequential generation.\nHowever, the practicality of these methods is limited due to the lengthy\ninference processes they require. In this paper, we address this problem by\ndecomposing the sampling process of diffusion models into two decoupled\nsubprocesses: 1) generating a feasible trajectory, which is a time-consuming\nprocess, and 2) optimizing the trajectory. With this decomposition approach, we\nare able to partially separate efficiency and quality factors, enabling us to\nsimultaneously gain efficiency advantages and ensure quality assurance. We\npropose the Trajectory Diffuser, which utilizes a faster autoregressive model\nto handle the generation of feasible trajectories while retaining the\ntrajectory optimization process of diffusion models. This allows us to achieve\nmore efficient planning without sacrificing capability. To evaluate the\neffectiveness and efficiency of the Trajectory Diffuser, we conduct experiments\non the D4RL benchmarks. The results demonstrate that our method achieves $\\it\n3$-$\\it 10 \\times$ faster inference speed compared to previous sequence\nmodeling methods, while also outperforming them in terms of overall\nperformance. https://github.com/RenMing-Huang/TrajectoryDiffuser\n  Keywords: Reinforcement Learning and Efficient Planning and Diffusion Model", "paper_summary_zh": "擴散模型透過將決策制定表述為順序生成，在離線強化學習任務中展現強勁的競爭力。然而，這些方法的實用性受到其所需的冗長推論過程所限制。在本文中，我們透過將擴散模型的採樣過程分解為兩個解耦的子程序來解決此問題：1) 生成可行的軌跡，這是一個耗時費力的過程，以及 2) 最佳化軌跡。透過這種分解方法，我們能夠部分地將效率和品質因素分開，讓我們能夠同時獲得效率優勢並確保品質保證。我們提出軌跡擴散器，它利用更快速的自動迴歸模型來處理可行軌跡的生成，同時保留擴散模型的軌跡最佳化過程。這讓我們能夠在不犧牲能力的情況下實現更有效的規劃。為了評估軌跡擴散器的有效性和效率，我們在 D4RL 基準上進行實驗。結果表明，與先前的序列建模方法相比，我們的模型實現了快 $\\it 3$-$\\it 10 \\times$ 倍的推論速度，同時在整體效能方面也優於它們。https://github.com/RenMing-Huang/TrajectoryDiffuser\n關鍵字：強化學習與高效規劃與擴散模型", "author": "Renming Huang et.al.", "authors": "Renming Huang, Yunqiang Pei, Guoqing Wang, Yangming Zhang, Yang Yang, Peng Wang, Hengtao Shen", "id": "2407.16142v1", "paper_url": "http://arxiv.org/abs/2407.16142v1", "repo": "https://github.com/renming-huang/trajectorydiffuser"}}