{"2405.14758": {"publish_time": "2024-05-23", "title": "Axioms for AI Alignment from Human Feedback", "paper_summary": "In the context of reinforcement learning from human feedback (RLHF), the\nreward function is generally derived from maximum likelihood estimation of a\nrandom utility model based on pairwise comparisons made by humans. The problem\nof learning a reward function is one of preference aggregation that, we argue,\nlargely falls within the scope of social choice theory. From this perspective,\nwe can evaluate different aggregation methods via established axioms, examining\nwhether these methods meet or fail well-known standards. We demonstrate that\nboth the Bradley-Terry-Luce Model and its broad generalizations fail to meet\nbasic axioms. In response, we develop novel rules for learning reward functions\nwith strong axiomatic guarantees. A key innovation from the standpoint of\nsocial choice is that our problem has a linear structure, which greatly\nrestricts the space of feasible rules and leads to a new paradigm that we call\nlinear social choice.", "paper_summary_zh": "在人類回饋（RLHF）的強化學習背景下，獎勵函數通常來自基於人類進行的成對比較的最大似然估計隨機效用模型。學習獎勵函數的問題是一種偏好聚合，我們認為這在很大程度上屬於社會選擇理論的範圍。從這個角度來看，我們可以通過既定的公理評估不同的聚合方法，考察這些方法是否滿足或不滿足眾所周知的標準。我們證明了 Bradley-Terry-Luce 模型及其廣泛的概括都無法滿足基本公理。作為回應，我們制定了具有強有力的公理保證的學習獎勵函數的新規則。從社會選擇的觀點來看，一個關鍵的創新是我們的問題具有線性結構，這極大地限制了可行規則的空間，並導致了一個我們稱之為線性社會選擇的新範例。", "author": "Luise Ge et.al.", "authors": "Luise Ge, Daniel Halpern, Evi Micha, Ariel D. Procaccia, Itai Shapira, Yevgeniy Vorobeychik, Junlin Wu", "id": "2405.14758v1", "paper_url": "http://arxiv.org/abs/2405.14758v1", "repo": "null"}}