{"2409.12184": {"publish_time": "2024-09-02", "title": "Democratizing MLLMs in Healthcare: TinyLLaVA-Med for Efficient Healthcare Diagnostics in Resource-Constrained Settings", "paper_summary": "Deploying Multi-Modal Large Language Models (MLLMs) in healthcare is hindered\nby their high computational demands and significant memory requirements, which\nare particularly challenging for resource-constrained devices like the Nvidia\nJetson Xavier. This problem is particularly evident in remote medical settings\nwhere advanced diagnostics are needed but resources are limited. In this paper,\nwe introduce an optimization method for the general-purpose MLLM, TinyLLaVA,\nwhich we have adapted and renamed TinyLLaVA-Med. This adaptation involves\ninstruction-tuning and fine-tuning TinyLLaVA on a medical dataset by drawing\ninspiration from the LLaVA-Med training pipeline. Our approach successfully\nminimizes computational complexity and power consumption, with TinyLLaVA-Med\noperating at 18.9W and using 11.9GB of memory, while achieving accuracies of\n64.54% on VQA-RAD and 70.70% on SLAKE for closed-ended questions. Therefore,\nTinyLLaVA-Med achieves deployment viability in hardware-constrained\nenvironments with low computational resources, maintaining essential\nfunctionalities and delivering accuracies close to state-of-the-art models.", "paper_summary_zh": "部署多模态大型语言模型 (MLLM) 于医疗保健领域时，会受到其高计算需求和庞大内存需求的阻碍，而这对于 Nvidia Jetson Xavier 等资源受限设备来说尤其具有挑战性。此问题在需要高级诊断但资源有限的远程医疗环境中尤为明显。在此篇论文中，我们介绍了一种针对通用 MLLM TinyLLaVA 的优化方法，我们调整并重新命名此方法为 TinyLLaVA-Med。此调整包括指令调整和根据 LLaVA-Med 训练管道汲取灵感，对医学数据集进行 TinyLLaVA 微调。我们的方法成功地将计算复杂度和功耗降至最低，TinyLLaVA-Med 在 18.9W 下运行，使用 11.9GB 内存，同时在 VQA-RAD 上实现 64.54% 的准确度，在 SLAKE 上针对封闭式问题实现 70.70% 的准确度。因此，TinyLLaVA-Med 在计算资源受限的硬件环境中实现了部署可行性，维持了基本功能，并实现了接近最先进模型的准确度。", "author": "Aya El Mir et.al.", "authors": "Aya El Mir, Lukelo Thadei Luoga, Boyuan Chen, Muhammad Abdullah Hanif, Muhammad Shafique", "id": "2409.12184v1", "paper_url": "http://arxiv.org/abs/2409.12184v1", "repo": "null"}}