{"2405.11524": {"publish_time": "2024-05-19", "title": "Simple-Sampling and Hard-Mixup with Prototypes to Rebalance Contrastive Learning for Text Classification", "paper_summary": "Text classification is a crucial and fundamental task in natural language\nprocessing. Compared with the previous learning paradigm of pre-training and\nfine-tuning by cross entropy loss, the recently proposed supervised contrastive\nlearning approach has received tremendous attention due to its powerful feature\nlearning capability and robustness. Although several studies have incorporated\nthis technique for text classification, some limitations remain. First, many\ntext datasets are imbalanced, and the learning mechanism of supervised\ncontrastive learning is sensitive to data imbalance, which may harm the model\nperformance. Moreover, these models leverage separate classification branch\nwith cross entropy and supervised contrastive learning branch without explicit\nmutual guidance. To this end, we propose a novel model named SharpReCL for\nimbalanced text classification tasks. First, we obtain the prototype vector of\neach class in the balanced classification branch to act as a representation of\neach class. Then, by further explicitly leveraging the prototype vectors, we\nconstruct a proper and sufficient target sample set with the same size for each\nclass to perform the supervised contrastive learning procedure. The empirical\nresults show the effectiveness of our model, which even outperforms popular\nlarge language models across several datasets.", "paper_summary_zh": "文本分类是自然语言处理中一项关键且基础的任务。与之前通过交叉熵损失进行预训练和微调的学习范例相比，最近提出的监督对比学习方法因其强大的特征学习能力和鲁棒性而受到极大关注。虽然有几项研究将此技术应用于文本分类，但仍存在一些局限性。首先，许多文本数据集是不平衡的，而监督对比学习的学习机制对数据不平衡很敏感，这可能会损害模型性能。此外，这些模型利用带有交叉熵的单独分类分支和带有监督对比学习分支，而没有明确的相互指导。为此，我们提出了一种名为 SharpReCL 的新模型，用于不平衡文本分类任务。首先，我们在平衡分类分支中获取每个类的原型向量，作为每个类的表示。然后，通过进一步明确利用原型向量，我们为每个类构建一个大小相同的适当且充分的目标样本集，以执行监督对比学习过程。实证结果表明了我们模型的有效性，它甚至在几个数据集上优于流行的大语言模型。", "author": "Mengyu Li et.al.", "authors": "Mengyu Li, Yonghao Liu, Fausto Giunchiglia, Xiaoyue Feng, Renchu Guan", "id": "2405.11524v1", "paper_url": "http://arxiv.org/abs/2405.11524v1", "repo": "null"}}