{"2405.04765": {"publish_time": "2024-05-08", "title": "When Foresight Pruning Meets Zeroth-Order Optimization: Efficient Federated Learning for Low-Memory Devices", "paper_summary": "Although Federated Learning (FL) enables collaborative learning in Artificial\nIntelligence of Things (AIoT) design, it fails to work on low-memory AIoT\ndevices due to its heavy memory usage. To address this problem, various\nfederated pruning methods are proposed to reduce memory usage during inference.\nHowever, few of them can substantially mitigate the memory burdens during\npruning and training. As an alternative, zeroth-order or backpropagation-free\n(BP-Free) methods can partially alleviate the memory consumption, but they\nsuffer from scaling up and large computation overheads, since the gradient\nestimation error and floating point operations (FLOPs) increase as the\ndimensionality of the model parameters grows. In this paper, we propose a\nfederated foresight pruning method based on Neural Tangent Kernel (NTK), which\ncan seamlessly integrate with federated BP-Free training frameworks. We present\nan approximation to the computation of federated NTK by using the local NTK\nmatrices. Moreover, we demonstrate that the data-free property of our method\ncan substantially reduce the approximation error in extreme data heterogeneity\nscenarios. Since our approach improves the performance of the vanilla BP-Free\nmethod with fewer FLOPs and truly alleviates memory pressure during training\nand inference, it makes FL more friendly to low-memory devices. Comprehensive\nexperimental results obtained from simulation- and real test-bed-based\nplatforms show that our federated foresight-pruning method not only preserves\nthe ability of the dense model with a memory reduction up to 9x but also boosts\nthe performance of the vanilla BP-Free method with dramatically fewer FLOPs.", "paper_summary_zh": "雖然聯合學習 (FL) 能讓人工智慧物聯網 (AIoT) 設計中的協作學習成為可能，但由於其龐大的記憶體使用量，它無法在低記憶體的 AIoT 裝置上運作。為了解決這個問題，提出了各種聯合剪枝方法，以便在推論期間減少記憶體使用量。然而，其中只有少數能實質上減輕剪枝和訓練期間的記憶體負擔。作為一種替代方案，零階或反向傳播 (BP-Free) 方法可以部分減輕記憶體消耗，但它們會導致擴展和大量的運算開銷，因為隨著模型參數維度的增加，梯度估計誤差和浮點運算 (FLOP) 會增加。在本文中，我們提出了一個基於神經切線核 (NTK) 的聯合預見性剪枝方法，它可以無縫整合到聯合 BP-Free 訓練架構中。我們提出了一個使用局部 NTK 矩陣來計算聯合 NTK 的近似值。此外，我們證明了我們方法的無資料特性可以在極端資料異質性場景中大幅減少近似誤差。由於我們的方法以較少的 FLOP 改善了香草 BP-Free 方法的效能，並真正減輕了訓練和推論期間的記憶體壓力，它讓 FL 更適用於低記憶體裝置。從模擬和基於真實測試平台取得的綜合實驗結果顯示，我們的聯合預見性剪枝方法不僅保留了密集模型的能力，記憶體減少了 9 倍，而且還以大幅減少的 FLOP 提升了香草 BP-Free 方法的效能。", "author": "Pengyu Zhang et.al.", "authors": "Pengyu Zhang, Yingjie Liu, Yingbo Zhou, Xiao Du, Xian Wei, Ting Wang, Mingsong Chen", "id": "2405.04765v1", "paper_url": "http://arxiv.org/abs/2405.04765v1", "repo": "null"}}