{"2410.21264": {"publish_time": "2024-10-28", "title": "LARP: Tokenizing Videos with a Learned Autoregressive Generative Prior", "paper_summary": "We present LARP, a novel video tokenizer designed to overcome limitations in\ncurrent video tokenization methods for autoregressive (AR) generative models.\nUnlike traditional patchwise tokenizers that directly encode local visual\npatches into discrete tokens, LARP introduces a holistic tokenization scheme\nthat gathers information from the visual content using a set of learned\nholistic queries. This design allows LARP to capture more global and semantic\nrepresentations, rather than being limited to local patch-level information.\nFurthermore, it offers flexibility by supporting an arbitrary number of\ndiscrete tokens, enabling adaptive and efficient tokenization based on the\nspecific requirements of the task. To align the discrete token space with\ndownstream AR generation tasks, LARP integrates a lightweight AR transformer as\na training-time prior model that predicts the next token on its discrete latent\nspace. By incorporating the prior model during training, LARP learns a latent\nspace that is not only optimized for video reconstruction but is also\nstructured in a way that is more conducive to autoregressive generation.\nMoreover, this process defines a sequential order for the discrete tokens,\nprogressively pushing them toward an optimal configuration during training,\nensuring smoother and more accurate AR generation at inference time.\nComprehensive experiments demonstrate LARP's strong performance, achieving\nstate-of-the-art FVD on the UCF101 class-conditional video generation\nbenchmark. LARP enhances the compatibility of AR models with videos and opens\nup the potential to build unified high-fidelity multimodal large language\nmodels (MLLMs).", "paper_summary_zh": "<paragraph>我們提出 LARP，一種新穎的影片分詞器，旨在克服自回歸 (AR) 生成式模型中現有影片分詞方法的限制。\n與直接將局部視覺區塊編碼成離散符號的傳統區塊分詞器不同，LARP 引入了一種整體分詞方案，使用一組學習到的整體查詢從視覺內容中收集資訊。這種設計讓 LARP 能夠擷取更全域和語義的表示，而不會侷限於局部區塊層級的資訊。\n此外，它提供靈活性，支援任意數量的離散符號，根據任務的具體需求啟用適應性和高效的分詞。為了將離散符號空間與下游 AR 生成任務對齊，LARP 整合了一個輕量級 AR 轉換器作為訓練時間先驗模型，以預測其離散潛在空間上的下一個符號。透過在訓練期間納入先驗模型，LARP 學習了一個潛在空間，不僅針對影片重建進行了最佳化，而且結構上更有利於自回歸生成。\n此外，此程序定義了離散符號的順序，在訓練期間逐步將它們推向最佳配置，確保在推論時間更順暢、更準確的 AR 生成。\n全面的實驗證明了 LARP 的強大效能，在 UCF101 類條件影片生成基準上達到了最先進的 FVD。LARP 增強了 AR 模型與影片的相容性，並開啟了建構統一的高保真多模態大型語言模型 (MLLM) 的可能性。</paragraph>", "author": "Hanyu Wang et.al.", "authors": "Hanyu Wang, Saksham Suri, Yixuan Ren, Hao Chen, Abhinav Shrivastava", "id": "2410.21264v1", "paper_url": "http://arxiv.org/abs/2410.21264v1", "repo": "null"}}