{"2405.12461": {"publish_time": "2024-05-21", "title": "WorldAfford: Affordance Grounding based on Natural Language Instructions", "paper_summary": "Affordance grounding aims to localize the interaction regions for the\nmanipulated objects in the scene image according to given instructions. A\ncritical challenge in affordance grounding is that the embodied agent should\nunderstand human instructions and analyze which tools in the environment can be\nused, as well as how to use these tools to accomplish the instructions. Most\nrecent works primarily supports simple action labels as input instructions for\nlocalizing affordance regions, failing to capture complex human objectives.\nMoreover, these approaches typically identify affordance regions of only a\nsingle object in object-centric images, ignoring the object context and\nstruggling to localize affordance regions of multiple objects in complex scenes\nfor practical applications. To address this concern, for the first time, we\nintroduce a new task of affordance grounding based on natural language\ninstructions, extending it from previously using simple labels for complex\nhuman instructions. For this new task, we propose a new framework, WorldAfford.\nWe design a novel Affordance Reasoning Chain-of-Thought Prompting to reason\nabout affordance knowledge from LLMs more precisely and logically.\nSubsequently, we use SAM and CLIP to localize the objects related to the\naffordance knowledge in the image. We identify the affordance regions of the\nobjects through an affordance region localization module. To benchmark this new\ntask and validate our framework, an affordance grounding dataset, LLMaFF, is\nconstructed. We conduct extensive experiments to verify that WorldAfford\nperforms state-of-the-art on both the previous AGD20K and the new LLMaFF\ndataset. In particular, WorldAfford can localize the affordance regions of\nmultiple objects and provide an alternative when objects in the environment\ncannot fully match the given instruction.", "paper_summary_zh": "affordance grounding 旨在根据给定的指令对场景图像中受操纵对象的交互区域进行定位。affordance grounding 中的一个关键挑战在于，具身代理应该理解人类指令并分析环境中哪些工具可以使用，以及如何使用这些工具来完成指令。最近的大多数工作主要支持简单的动作标签作为定位 affordance 区域的输入指令，未能捕捉复杂的人类目标。此外，这些方法通常只识别以对象为中心的图像中单个对象的 affordance 区域，忽略了对象上下文，并且难以在复杂场景中定位多个对象的 affordance 区域以用于实际应用。为了解决这一问题，我们首次引入了一种基于自然语言指令的 affordance grounding 新任务，将其从以前使用简单标签扩展到复杂的人类指令。对于这个新任务，我们提出了一个新框架 WorldAfford。我们设计了一个新颖的 Affordance 推理思维链提示，以更精确和合乎逻辑地推理来自 LLM 的 affordance 知识。随后，我们使用 SAM 和 CLIP 来定位图像中与 affordance 知识相关的对象。我们通过 affordance 区域定位模块识别对象的 affordance 区域。为了对这个新任务进行基准测试并验证我们的框架，构建了一个 affordance grounding 数据集 LLMaFF。我们进行了广泛的实验来验证 WorldAfford 在之前的 AGD20K 和新的 LLMaFF 数据集上都表现出最先进的水平。特别是，WorldAfford 可以定位多个对象的 affordance 区域，并在环境中的对象无法完全匹配给定指令时提供替代方案。", "author": "Changmao Chen et.al.", "authors": "Changmao Chen, Yuren Cong, Zhen Kan", "id": "2405.12461v1", "paper_url": "http://arxiv.org/abs/2405.12461v1", "repo": "null"}}