{"2411.02125": {"publish_time": "2024-11-04", "title": "Revisiting K-mer Profile for Effective and Scalable Genome Representation Learning", "paper_summary": "Obtaining effective representations of DNA sequences is crucial for genome\nanalysis. Metagenomic binning, for instance, relies on genome representations\nto cluster complex mixtures of DNA fragments from biological samples with the\naim of determining their microbial compositions. In this paper, we revisit\nk-mer-based representations of genomes and provide a theoretical analysis of\ntheir use in representation learning. Based on the analysis, we propose a\nlightweight and scalable model for performing metagenomic binning at the genome\nread level, relying only on the k-mer compositions of the DNA fragments. We\ncompare the model to recent genome foundation models and demonstrate that while\nthe models are comparable in performance, the proposed model is significantly\nmore effective in terms of scalability, a crucial aspect for performing\nmetagenomic binning of real-world datasets.", "paper_summary_zh": "獲得 DNA 序列的有效表示對於基因組分析至關重要。例如，宏基因組分箱依賴於基因組表示，以群集來自生物樣本的 DNA 片段的複雜混合物，目的是確定它們的微生物組成。在本文中，我們重新審視了基於 k-mer 的基因組表示，並對它們在表示學習中的使用提供了理論分析。基於分析，我們提出了一個輕量級且可擴充的模型，用於在基因組讀取層級執行宏基因組分箱，僅依賴於 DNA 片段的 k-mer 組成。我們將該模型與最近的基因組基礎模型進行比較，並證明雖然這些模型在性能上相當，但所提出的模型在可擴充性方面顯著更有效，這是執行實際世界資料集的宏基因組分箱的一個關鍵方面。", "author": "Abdulkadir Celikkanat et.al.", "authors": "Abdulkadir Celikkanat, Andres R. Masegosa, Thomas D. Nielsen", "id": "2411.02125v1", "paper_url": "http://arxiv.org/abs/2411.02125v1", "repo": "https://github.com/abdcelikkanat/revisitingkmers"}}