{"2410.11494": {"publish_time": "2024-10-15", "title": "DynamicER: Resolving Emerging Mentions to Dynamic Entities for RAG", "paper_summary": "In the rapidly evolving landscape of language, resolving new linguistic\nexpressions in continuously updating knowledge bases remains a formidable\nchallenge. This challenge becomes critical in retrieval-augmented generation\n(RAG) with knowledge bases, as emerging expressions hinder the retrieval of\nrelevant documents, leading to generator hallucinations. To address this issue,\nwe introduce a novel task aimed at resolving emerging mentions to dynamic\nentities and present DynamicER benchmark. Our benchmark includes dynamic entity\nmention resolution and entity-centric knowledge-intensive QA task, evaluating\nentity linking and RAG model's adaptability to new expressions, respectively.\nWe discovered that current entity linking models struggle to link these new\nexpressions to entities. Therefore, we propose a temporal segmented clustering\nmethod with continual adaptation, effectively managing the temporal dynamics of\nevolving entities and emerging mentions. Extensive experiments demonstrate that\nour method outperforms existing baselines, enhancing RAG model performance on\nQA task with resolved mentions.", "paper_summary_zh": "在語言快速演進的環境中，在持續更新的知識庫中解析新的語言表達式仍然是一項艱鉅的挑戰。這個挑戰在具有知識庫的檢索增強產生 (RAG) 中變得至關重要，因為新興表達式會阻礙相關文件之檢索，導致產生器出現幻覺。為了解決這個問題，我們提出了一項新任務，旨在解析新興提及的動態實體，並提出 DynamicER 基準。我們的基準包括動態實體提及解析和以實體為中心的知識密集型問答任務，分別評估實體連結和 RAG 模型對新表達式的適應性。我們發現目前的實體連結模型難以將這些新表達式連結到實體。因此，我們提出了一種具有持續適應性的時間分段聚類方法，有效管理不斷演化的實體和新興提及的時間動態。大量的實驗證明，我們的模型優於現有的基準，增強了 RAG 模型在解析提及的問答任務上的性能。", "author": "Jinyoung Kim et.al.", "authors": "Jinyoung Kim, Dayoon Ko, Gunhee Kim", "id": "2410.11494v1", "paper_url": "http://arxiv.org/abs/2410.11494v1", "repo": "null"}}