{"2501.03229": {"publish_time": "2025-01-06", "title": "Gaussian Masked Autoencoders", "paper_summary": "This paper explores Masked Autoencoders (MAE) with Gaussian Splatting. While\nreconstructive self-supervised learning frameworks such as MAE learns good\nsemantic abstractions, it is not trained for explicit spatial awareness. Our\napproach, named Gaussian Masked Autoencoder, or GMAE, aims to learn semantic\nabstractions and spatial understanding jointly. Like MAE, it reconstructs the\nimage end-to-end in the pixel space, but beyond MAE, it also introduces an\nintermediate, 3D Gaussian-based representation and renders images via\nsplatting. We show that GMAE can enable various zero-shot learning capabilities\nof spatial understanding (e.g., figure-ground segmentation, image layering,\nedge detection, etc.) while preserving the high-level semantics of\nself-supervised representation quality from MAE. To our knowledge, we are the\nfirst to employ Gaussian primitives in an image representation learning\nframework beyond optimization-based single-scene reconstructions. We believe\nGMAE will inspire further research in this direction and contribute to\ndeveloping next-generation techniques for modeling high-fidelity visual data.\nMore details at https://brjathu.github.io/gmae", "paper_summary_zh": "這篇論文探討了具有高斯潑點的遮罩式自動編碼器 (MAE)。雖然像 MAE 這樣的重建式自我監督學習架構學習了良好的語義抽象，但它並未針對明確的空間感知進行訓練。我們的方法稱為高斯遮罩式自動編碼器或 GMAE，旨在共同學習語義抽象和空間理解。它與 MAE 一樣，在像素空間中端對端重建影像，但除此之外，它還引入了中間的 3D 高斯表示，並透過潑點渲染影像。我們展示了 GMAE 能夠啟用各種空間理解的零次學習能力（例如，圖形分割、影像分層、邊緣檢測等），同時保留 MAE 自我監督表示品質的高階語義。據我們所知，我們是第一個在影像表示學習架構中採用高斯基元，而這超越了基於最佳化的單一場景重建。我們相信 GMAE 將激勵此方向的進一步研究，並有助於開發新一代的高保真視覺資料建模技術。更多詳情請見 https://brjathu.github.io/gmae", "author": "Jathushan Rajasegaran et.al.", "authors": "Jathushan Rajasegaran, Xinlei Chen, Rulilong Li, Christoph Feichtenhofer, Jitendra Malik, Shiry Ginosar", "id": "2501.03229v1", "paper_url": "http://arxiv.org/abs/2501.03229v1", "repo": "null"}}