{"2501.01335": {"publish_time": "2025-01-02", "title": "CySecBench: Generative AI-based CyberSecurity-focused Prompt Dataset for Benchmarking Large Language Models", "paper_summary": "Numerous studies have investigated methods for jailbreaking Large Language\nModels (LLMs) to generate harmful content. Typically, these methods are\nevaluated using datasets of malicious prompts designed to bypass security\npolicies established by LLM providers. However, the generally broad scope and\nopen-ended nature of existing datasets can complicate the assessment of\njailbreaking effectiveness, particularly in specific domains, notably\ncybersecurity. To address this issue, we present and publicly release\nCySecBench, a comprehensive dataset containing 12662 prompts specifically\ndesigned to evaluate jailbreaking techniques in the cybersecurity domain. The\ndataset is organized into 10 distinct attack-type categories, featuring\nclose-ended prompts to enable a more consistent and accurate assessment of\njailbreaking attempts. Furthermore, we detail our methodology for dataset\ngeneration and filtration, which can be adapted to create similar datasets in\nother domains. To demonstrate the utility of CySecBench, we propose and\nevaluate a jailbreaking approach based on prompt obfuscation. Our experimental\nresults show that this method successfully elicits harmful content from\ncommercial black-box LLMs, achieving Success Rates (SRs) of 65% with ChatGPT\nand 88% with Gemini; in contrast, Claude demonstrated greater resilience with a\njailbreaking SR of 17%. Compared to existing benchmark approaches, our method\nshows superior performance, highlighting the value of domain-specific\nevaluation datasets for assessing LLM security measures. Moreover, when\nevaluated using prompts from a widely used dataset (i.e., AdvBench), it\nachieved an SR of 78.5%, higher than the state-of-the-art methods.", "paper_summary_zh": "<paragraph>許多研究探討了越獄大型語言模型 (LLM) 以產生有害內容的方法。通常，這些方法使用惡意提示的資料集進行評估，這些提示旨在繞過 LLM 提供者建立的安全政策。然而，現有資料集的廣泛範圍和開放式性質通常會使越獄有效性的評估變得複雜，特別是在特定領域，尤其是網路安全。為了解決這個問題，我們提出並公開發布 CySecBench，這是一個全面的資料集，包含 12662 個提示，專門用於評估網路安全領域的越獄技術。該資料集組織成 10 個不同的攻擊類型類別，採用封閉式提示，以便對越獄嘗試進行更一致且準確的評估。此外，我們詳細說明了我們的資料集生成和過濾方法，該方法可以調整以在其他領域建立類似的資料集。為了展示 CySecBench 的效用，我們提出並評估了一種基於提示混淆的越獄方法。我們的實驗結果顯示，此方法成功地從商業黑盒 LLM 獲取有害內容，在 ChatGPT 中達到 65% 的成功率 (SR)，在 Gemini 中達到 88%；相比之下，Claude 以 17% 的越獄 SR 表現出更大的韌性。與現有的基準方法相比，我們的模型顯示出優異的性能，突顯了特定領域評估資料集對於評估 LLM 安全措施的價值。此外，當使用來自廣泛使用資料集 (即 AdvBench) 的提示進行評估時，它達到了 78.5% 的 SR，高於最先進的方法。</paragraph>", "author": "Johan Wahréus et.al.", "authors": "Johan Wahréus, Ahmed Mohamed Hussain, Panos Papadimitratos", "id": "2501.01335v1", "paper_url": "http://arxiv.org/abs/2501.01335v1", "repo": "null"}}