{"2406.01126": {"publish_time": "2024-06-03", "title": "TCMBench: A Comprehensive Benchmark for Evaluating Large Language Models in Traditional Chinese Medicine", "paper_summary": "Large language models (LLMs) have performed remarkably well in various\nnatural language processing tasks by benchmarking, including in the Western\nmedical domain. However, the professional evaluation benchmarks for LLMs have\nyet to be covered in the traditional Chinese medicine(TCM) domain, which has a\nprofound history and vast influence. To address this research gap, we introduce\nTCM-Bench, an comprehensive benchmark for evaluating LLM performance in TCM. It\ncomprises the TCM-ED dataset, consisting of 5,473 questions sourced from the\nTCM Licensing Exam (TCMLE), including 1,300 questions with authoritative\nanalysis. It covers the core components of TCMLE, including TCM basis and\nclinical practice. To evaluate LLMs beyond accuracy of question answering, we\npropose TCMScore, a metric tailored for evaluating the quality of answers\ngenerated by LLMs for TCM related questions. It comprehensively considers the\nconsistency of TCM semantics and knowledge. After conducting comprehensive\nexperimental analyses from diverse perspectives, we can obtain the following\nfindings: (1) The unsatisfactory performance of LLMs on this benchmark\nunderscores their significant room for improvement in TCM. (2) Introducing\ndomain knowledge can enhance LLMs' performance. However, for in-domain models\nlike ZhongJing-TCM, the quality of generated analysis text has decreased, and\nwe hypothesize that their fine-tuning process affects the basic LLM\ncapabilities. (3) Traditional metrics for text generation quality like Rouge\nand BertScore are susceptible to text length and surface semantic ambiguity,\nwhile domain-specific metrics such as TCMScore can further supplement and\nexplain their evaluation results. These findings highlight the capabilities and\nlimitations of LLMs in the TCM and aim to provide a more profound assistance to\nmedical research.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 在各種自然語言處理任務中表現出色，包括在西方醫學領域。然而，LLM 的專業評估基準尚未涵蓋中醫領域，而中醫領域擁有深厚的歷史和廣泛的影響力。為了彌補這一研究空白，我們引入了 TCM-Bench，這是一個用於評估 LLM 在中醫領域表現的綜合基準。它包含 TCM-ED 數據集，其中包含 5,473 個來自中醫執照考試 (TCMLE) 的問題，包括 1,300 個具有權威分析的問題。它涵蓋了 TCMLE 的核心組成部分，包括中醫基礎和臨床實踐。為了評估 LLM 超越問題回答的準確性，我們提出了 TCMScore，這是一個專門用於評估 LLM 為中醫相關問題生成的答案質量的指標。它全面考慮了中醫語義和知識的一致性。在從不同角度進行綜合實驗分析後，我們可以得出以下發現：(1) LLM 在此基準上的表現不盡人意，這凸顯了它們在中醫領域有很大的改進空間。(2) 引入領域知識可以提升 LLM 的表現。然而，對於像 ZhongJing-TCM 這樣的領域模型，生成的分析文本的質量有所下降，我們假設它們的微調過程影響了基本的 LLM 能力。(3) 傳統的文本生成質量指標，例如 Rouge 和 BertScore，容易受到文本長度和表面語義模糊性的影響，而像 TCMScore 這樣的特定領域指標可以進一步補充和解釋它們的評估結果。這些發現突出了 LLM 在中醫領域的能力和局限性，並旨在為醫學研究提供更深入的幫助。</paragraph>", "author": "Wenjing Yue et.al.", "authors": "Wenjing Yue, Xiaoling Wang, Wei Zhu, Ming Guan, Huanran Zheng, Pengfei Wang, Changzhi Sun, Xin Ma", "id": "2406.01126v1", "paper_url": "http://arxiv.org/abs/2406.01126v1", "repo": "null"}}