{"2406.02362": {"publish_time": "2024-06-04", "title": "Temporal Graph Rewiring with Expander Graphs", "paper_summary": "Evolving relations in real-world networks are often modelled by temporal\ngraphs. Graph rewiring techniques have been utilised on Graph Neural Networks\n(GNNs) to improve expressiveness and increase model performance. In this work,\nwe propose Temporal Graph Rewiring (TGR), the first approach for graph rewiring\non temporal graphs. TGR enables communication between temporally distant nodes\nin a continuous time dynamic graph by utilising expander graph propagation to\nconstruct a message passing highway for message passing between distant nodes.\nExpander graphs are suitable candidates for rewiring as they help overcome the\noversquashing problem often observed in GNNs. On the public tgbl-wiki\nbenchmark, we show that TGR improves the performance of a widely used TGN model\nby a significant margin. Our code repository is accessible at\nhttps://anonymous.4open.science/r/TGR-254C.", "paper_summary_zh": "現實世界網路中的演化關係通常以時間圖形建模。圖形重新連線技術已用於圖形神經網路 (GNN)，以改善表達能力並提升模型效能。在這項工作中，我們提出時間圖形重新連線 (TGR)，這是時間圖形上圖形重新連線的第一種方法。TGR 透過利用擴充圖形傳播來建立訊息傳遞高速公路，以在連續時間動態圖形中實現時間距離節點之間的通訊，以便在遠距離節點之間傳遞訊息。擴充圖形是重新連線的合適候選者，因為它們有助於克服在 GNN 中常見的過度壓縮問題。在公開的 tgbl-wiki 基準測試中，我們表明 TGR 大幅提升了廣泛使用的 TGN 模型的效能。我們的程式碼存放庫可以在 https://anonymous.4open.science/r/TGR-254C 取得。", "author": "Katarina Petrović et.al.", "authors": "Katarina Petrović, Shenyang Huang, Farimah Poursafaei, Petar Veličković", "id": "2406.02362v1", "paper_url": "http://arxiv.org/abs/2406.02362v1", "repo": "https://github.com/kpetrovicc/tgr"}}