{"2405.18902": {"publish_time": "2024-05-29", "title": "A Causal Framework for Evaluating Deferring Systems", "paper_summary": "Deferring systems extend supervised Machine Learning (ML) models with the\npossibility to defer predictions to human experts. However, evaluating the\nimpact of a deferring strategy on system accuracy is still an overlooked area.\nThis paper fills this gap by evaluating deferring systems through a causal\nlens. We link the potential outcomes framework for causal inference with\ndeferring systems. This allows us to identify the causal impact of the\ndeferring strategy on predictive accuracy. We distinguish two scenarios. In the\nfirst one, we can access both the human and the ML model predictions for the\ndeferred instances. In such a case, we can identify the individual causal\neffects for deferred instances and aggregates of them. In the second scenario,\nonly human predictions are available for the deferred instances. In this case,\nwe can resort to regression discontinuity design to estimate a local causal\neffect. We empirically evaluate our approach on synthetic and real datasets for\nseven deferring systems from the literature.", "paper_summary_zh": "延遲系統擴充了監督式機器學習 (ML) 模型，讓人類專家可以延遲預測。然而，評估延遲策略對系統精確度的影響仍是一個被忽略的領域。本文透過因果關係透鏡評估延遲系統，填補了這項空白。我們將因果推論的潛在結果架構與延遲系統連結起來。這讓我們可以找出延遲策略對預測精確度的因果影響。我們區分出兩種情境。在第一種情境中，我們可以取得人類和 ML 模型對延遲個體的預測。在這種情況下，我們可以找出延遲個體和其彙總資料的個別因果效應。在第二種情境中，只有延遲個體的人類預測可用。在這種情況下，我們可以訴諸回歸不連續性設計來估計局部因果效應。我們透過文獻中的七個延遲系統，對合成和真實資料集實證評估我們的做法。", "author": "Filippo Palomba et.al.", "authors": "Filippo Palomba, Andrea Pugnana, José Manuel Alvarez, Salvatore Ruggieri", "id": "2405.18902v1", "paper_url": "http://arxiv.org/abs/2405.18902v1", "repo": "https://github.com/andrepugni/pods"}}