{"2407.13891": {"publish_time": "2024-07-18", "title": "Uncovering Political Bias in Emotion Inference Models: Implications for sentiment analysis in social science research", "paper_summary": "This paper investigates the presence of political bias in emotion inference\nmodels used for sentiment analysis (SA) in social science research. Machine\nlearning models often reflect biases in their training data, impacting the\nvalidity of their outcomes. While previous research has highlighted gender and\nrace biases, our study focuses on political bias - an underexplored yet\npervasive issue that can skew the interpretation of text data across a wide\narray of studies. We conducted a bias audit on a Polish sentiment analysis\nmodel developed in our lab. By analyzing valence predictions for names and\nsentences involving Polish politicians, we uncovered systematic differences\ninfluenced by political affiliations. Our findings indicate that annotations by\nhuman raters propagate political biases into the model's predictions. To\nmitigate this, we pruned the training dataset of texts mentioning these\npoliticians and observed a reduction in bias, though not its complete\nelimination. Given the significant implications of political bias in SA, our\nstudy emphasizes caution in employing these models for social science research.\nWe recommend a critical examination of SA results and propose using\nlexicon-based systems as a more ideologically neutral alternative. This paper\nunderscores the necessity for ongoing scrutiny and methodological adjustments\nto ensure the reliability and impartiality of the use of machine learning in\nacademic and applied contexts.", "paper_summary_zh": "這篇論文探討了用於社會科學研究的情感分析 (SA) 中的情緒推論模型中政治偏見的存在。機器學習模型通常會反映其訓練資料中的偏見，進而影響其結果的有效性。雖然先前的研究強調了性別和種族偏見，但我們的研究著重於政治偏見，這是一個尚未充分探討但普遍存在的問題，可能會扭曲各種研究中對文字資料的詮釋。我們對我們實驗室開發的波蘭語情緒分析模型進行了偏見審計。透過分析涉及波蘭政治人物的名字和句子的情緒預測，我們發現了受政治派系影響的系統性差異。我們的研究結果指出，人類評分者的註解會將政治偏見傳播到模型的預測中。為了減輕這種情況，我們刪除了訓練資料集中提到這些政治人物的文字，並觀察到偏見有所減少，但並未完全消除。鑑於政治偏見在 SA 中的重大影響，我們的研究強調在社會科學研究中採用這些模型時應保持謹慎。我們建議批判性地檢視 SA 結果，並建議使用基於詞彙的系統作為更具意識形態中立性的替代方案。這篇論文強調了持續審查和方法調整的必要性，以確保機器學習在學術和應用環境中使用的可靠性和公正性。", "author": "Hubert Plisiecki et.al.", "authors": "Hubert Plisiecki, Paweł Lenartowicz, Maria Flakus, Artur Pokropek", "id": "2407.13891v1", "paper_url": "http://arxiv.org/abs/2407.13891v1", "repo": "null"}}