{"2407.17638": {"publish_time": "2024-07-24", "title": "Time Matters: Examine Temporal Effects on Biomedical Language Models", "paper_summary": "Time roots in applying language models for biomedical applications: models\nare trained on historical data and will be deployed for new or future data,\nwhich may vary from training data. While increasing biomedical tasks have\nemployed state-of-the-art language models, there are very few studies have\nexamined temporal effects on biomedical models when data usually shifts across\ndevelopment and deployment. This study fills the gap by statistically probing\nrelations between language model performance and data shifts across three\nbiomedical tasks. We deploy diverse metrics to evaluate model performance,\ndistance methods to measure data drifts, and statistical methods to quantify\ntemporal effects on biomedical language models. Our study shows that time\nmatters for deploying biomedical language models, while the degree of\nperformance degradation varies by biomedical tasks and statistical\nquantification approaches. We believe this study can establish a solid\nbenchmark to evaluate and assess temporal effects on deploying biomedical\nlanguage models.", "paper_summary_zh": "時間植根於將語言模型應用於生物醫學應用：模型\n經過歷史數據訓練，將部署於新數據或未來數據，\n這可能會與訓練數據有所不同。雖然越來越多的生物醫學任務已經\n採用了最先進的語言模型，但當數據通常在開發和部署之間轉移時，很少有研究\n檢查了對生物醫學模型的時序效應。本研究通過統計探查\n語言模型性能與三個生物醫學任務之間的數據轉移關係來填補這一空白。我們部署多種指標來評估模型性能，\n距離方法來測量數據漂移，以及統計方法來量化\n對生物醫學語言模型的時序效應。我們的研究表明，時間\n對於部署生物醫學語言模型很重要，而性能下降的程度因生物醫學任務和統計\n量化方法而異。我們相信這項研究可以建立一個穩固的\n基準來評估和評估對部署生物醫學的時序效應\n語言模型。", "author": "Weisi Liu et.al.", "authors": "Weisi Liu, Zhe He, Xiaolei Huang", "id": "2407.17638v1", "paper_url": "http://arxiv.org/abs/2407.17638v1", "repo": "null"}}