{"2406.17425": {"publish_time": "2024-06-25", "title": "CuDA2: An approach for Incorporating Traitor Agents into Cooperative Multi-Agent Systems", "paper_summary": "Cooperative Multi-Agent Reinforcement Learning (CMARL) strategies are well\nknown to be vulnerable to adversarial perturbations. Previous works on\nadversarial attacks have primarily focused on white-box attacks that directly\nperturb the states or actions of victim agents, often in scenarios with a\nlimited number of attacks. However, gaining complete access to victim agents in\nreal-world environments is exceedingly difficult. To create more realistic\nadversarial attacks, we introduce a novel method that involves injecting\ntraitor agents into the CMARL system. We model this problem as a Traitor Markov\nDecision Process (TMDP), where traitors cannot directly attack the victim\nagents but can influence their formation or positioning through collisions. In\nTMDP, traitors are trained using the same MARL algorithm as the victim agents,\nwith their reward function set as the negative of the victim agents' reward.\nDespite this, the training efficiency for traitors remains low because it is\nchallenging for them to directly associate their actions with the victim\nagents' rewards. To address this issue, we propose the Curiosity-Driven\nAdversarial Attack (CuDA2) framework. CuDA2 enhances the efficiency and\naggressiveness of attacks on the specified victim agents' policies while\nmaintaining the optimal policy invariance of the traitors. Specifically, we\nemploy a pre-trained Random Network Distillation (RND) module, where the extra\nreward generated by the RND module encourages traitors to explore states\nunencountered by the victim agents. Extensive experiments on various scenarios\nfrom SMAC demonstrate that our CuDA2 framework offers comparable or superior\nadversarial attack capabilities compared to other baselines.", "paper_summary_zh": "合作多智能體強化學習 (CMARL) 策略已廣為人知，容易受到對抗性擾動的影響。先前對抗性攻擊的研究主要集中在直接擾動受害者智能體的狀態或動作的白盒攻擊，通常在攻擊次數有限的場景中。然而，在現實環境中完全存取受害者智能體極為困難。為了創造更逼真的對抗性攻擊，我們引入了一種新方法，包括將叛徒智能體注入 CMARL 系統。我們將此問題建模為叛徒馬可夫決策過程 (TMDP)，其中叛徒無法直接攻擊受害者智能體，但可以透過碰撞影響其形成或定位。在 TMDP 中，叛徒使用與受害者智能體相同的 MARL 演算法進行訓練，其獎勵函數設定為受害者智能體獎勵的負值。儘管如此，叛徒的訓練效率仍然很低，因為他們難以將自己的動作直接與受害者智能體的獎勵聯繫起來。為了解決這個問題，我們提出了好奇心驅動對抗性攻擊 (CuDA2) 框架。CuDA2 提高了對指定受害者智能體策略的攻擊效率和侵略性，同時維持叛徒的最佳策略不變性。具體來說，我們採用預先訓練的隨機網路蒸餾 (RND) 模組，其中 RND 模組產生的額外獎勵鼓勵叛徒探索受害者智能體未遭遇的狀態。在 SMAC 的各種場景中進行的廣泛實驗表明，與其他基準相比，我們的 CuDA2 框架提供了相當或更優越的對抗性攻擊能力。", "author": "Zhen Chen et.al.", "authors": "Zhen Chen, Yong Liao, Youpeng Zhao, Zipeng Dai, Jian Zhao", "id": "2406.17425v1", "paper_url": "http://arxiv.org/abs/2406.17425v1", "repo": "null"}}