{"2410.10796": {"publish_time": "2024-10-14", "title": "Context-Parametric Inversion: Why Instruction Finetuning May Not Actually Improve Context Reliance", "paper_summary": "Large language models are instruction-finetuned to enhance their ability to\nfollow user instructions and process the input context. However, even\nstate-of-the-art models often struggle to follow the instruction, especially\nwhen the input context is not aligned with the model's parametric knowledge.\nThis manifests as various failures, such as hallucinations where the responses\nare outdated, biased or contain unverified facts. In this work, we try to\nunderstand the underlying reason for this poor context reliance, especially\nafter instruction tuning. We observe an intriguing phenomenon: during\ninstruction tuning, the context reliance initially increases as expected, but\nthen gradually decreases as instruction finetuning progresses. We call this\nphenomenon context-parametric inversion and observe it across multiple general\npurpose instruction tuning datasets like TULU, Alpaca and Ultrachat, as well as\nmodel families such as Llama, Mistral and Pythia. In a simple theoretical\nsetup, we isolate why context-parametric inversion occurs along the gradient\ndescent trajectory of instruction finetuning. We tie this phenomena to examples\nin the instruction finetuning data mixture where the input context provides\ninformation that is already present in the model's parametric knowledge. Our\nanalysis suggests natural mitigation strategies that provide some limited\ngains, while also validating our theoretical insights. We hope that our work\nserves as a starting point in addressing this failure mode in a staple part of\nLLM training.", "paper_summary_zh": "大型語言模型經過指令微調，以增強其遵循使用者指令和處理輸入內容的能力。然而，即使是最新穎的模型也經常難以遵循指令，特別是在輸入內容與模型的參數化知識不一致時。這會表現為各種失敗，例如幻覺，其中回應過時、有偏差或包含未經驗證的事實。在這項工作中，我們嘗試了解這種不良內容依賴性的根本原因，特別是在指令微調之後。我們觀察到一個有趣的現象：在指令微調期間，內容依賴性最初如預期般增加，但隨著指令微調的進行，逐漸下降。我們將這種現象稱為內容參數反轉，並在多個通用指令微調資料集（例如 TULU、Alpaca 和 Ultrachat）以及 Llama、Mistral 和 Pythia 等模型系列中觀察到這種現象。在一個簡單的理論設定中，我們隔離了在指令微調的梯度下降軌跡中發生內容參數反轉的原因。我們將這種現象與指令微調資料混合中的範例聯繫起來，其中輸入內容提供了模型參數化知識中已存在資訊。我們的分析建議了自然緩解策略，這些策略提供了一些有限的收益，同時也驗證了我們的理論見解。我們希望我們的研究能作為解決 LLM 訓練中這個失敗模式的起點。", "author": "Sachin Goyal et.al.", "authors": "Sachin Goyal, Christina Baek, J. Zico Kolter, Aditi Raghunathan", "id": "2410.10796v1", "paper_url": "http://arxiv.org/abs/2410.10796v1", "repo": "https://github.com/locuslab/context-parametric-inversion"}}