{"2405.18172": {"publish_time": "2024-05-28", "title": "AnyFit: Controllable Virtual Try-on for Any Combination of Attire Across Any Scenario", "paper_summary": "While image-based virtual try-on has made significant strides, emerging\napproaches still fall short of delivering high-fidelity and robust fitting\nimages across various scenarios, as their models suffer from issues of\nill-fitted garment styles and quality degrading during the training process,\nnot to mention the lack of support for various combinations of attire.\nTherefore, we first propose a lightweight, scalable, operator known as Hydra\nBlock for attire combinations. This is achieved through a parallel attention\nmechanism that facilitates the feature injection of multiple garments from\nconditionally encoded branches into the main network. Secondly, to\nsignificantly enhance the model's robustness and expressiveness in real-world\nscenarios, we evolve its potential across diverse settings by synthesizing the\nresiduals of multiple models, as well as implementing a mask region boost\nstrategy to overcome the instability caused by information leakage in existing\nmodels. Equipped with the above design, AnyFit surpasses all baselines on\nhigh-resolution benchmarks and real-world data by a large gap, excelling in\nproducing well-fitting garments replete with photorealistic and rich details.\nFurthermore, AnyFit's impressive performance on high-fidelity virtual try-ons\nin any scenario from any image, paves a new path for future research within the\nfashion community.", "paper_summary_zh": "儘管基於影像的虛擬試穿已取得顯著進展，但新興方法仍無法在各種場景中提供高保真和穩健的合身影像，因為其模型存在服裝款式不合身和訓練過程中品質下降的問題，更別提缺乏對各種服裝組合的支持。因此，我們首先提出一個輕量級、可擴充的運算元，稱為 Hydra Block，用於服裝組合。這透過一個並行注意力機制實現，該機制促進了將多件服裝的特徵從條件編碼分支注入主網路中。其次，為了顯著增強模型在真實世界場景中的穩健性和表現力，我們透過合成多個模型的殘差，並實作遮罩區域提升策略來克服現有模型中資訊外洩造成的不安定性，從而提升其在不同設定中的潛力。有了上述設計，AnyFit 在高解析度基準和真實世界資料上都大幅超越所有基準，擅長製作合身的服裝，並具有逼真且豐富的細節。此外，AnyFit 在任何影像中任何場景的高保真虛擬試穿上的出色表現，為時尚社群中的未來研究鋪出了一條新路。", "author": "Yuhan Li et.al.", "authors": "Yuhan Li, Hao Zhou, Wenxiang Shang, Ran Lin, Xuanhong Chen, Bingbing Ni", "id": "2405.18172v1", "paper_url": "http://arxiv.org/abs/2405.18172v1", "repo": "null"}}