{"2410.17856": {"publish_time": "2024-10-23", "title": "ROCKET-1: Master Open-World Interaction with Visual-Temporal Context Prompting", "paper_summary": "Vision-language models (VLMs) have excelled in multimodal tasks, but adapting\nthem to embodied decision-making in open-world environments presents\nchallenges. A key issue is the difficulty in smoothly connecting individual\nentities in low-level observations with abstract concepts required for\nplanning. A common approach to address this problem is through the use of\nhierarchical agents, where VLMs serve as high-level reasoners that break down\ntasks into executable sub-tasks, typically specified using language and\nimagined observations. However, language often fails to effectively convey\nspatial information, while generating future images with sufficient accuracy\nremains challenging. To address these limitations, we propose visual-temporal\ncontext prompting, a novel communication protocol between VLMs and policy\nmodels. This protocol leverages object segmentation from both past and present\nobservations to guide policy-environment interactions. Using this approach, we\ntrain ROCKET-1, a low-level policy that predicts actions based on concatenated\nvisual observations and segmentation masks, with real-time object tracking\nprovided by SAM-2. Our method unlocks the full potential of VLMs\nvisual-language reasoning abilities, enabling them to solve complex creative\ntasks, especially those heavily reliant on spatial understanding. Experiments\nin Minecraft demonstrate that our approach allows agents to accomplish\npreviously unattainable tasks, highlighting the effectiveness of\nvisual-temporal context prompting in embodied decision-making. Codes and demos\nwill be available on the project page: https://craftjarvis.github.io/ROCKET-1.", "paper_summary_zh": "視覺語言模型 (VLM) 在多模態任務中表現出色，但將其適應於開放世界環境中的具身決策會帶來挑戰。一個關鍵問題是難以將低層級觀察中的個別實體與規劃所需的抽象概念順利連接起來。解決此問題的常見方法是使用階層式代理，其中 VLM 作為高級推理器，將任務分解為可執行的子任務，通常使用語言和想像的觀察來指定。然而，語言通常無法有效傳達空間資訊，同時產生具有足夠準確度的未來影像仍然具有挑戰性。為了解決這些限制，我們提出視覺時間脈絡提示，一種 VLM 和策略模型之間的新穎通訊協定。此協定利用過去和現在觀察的物件分割來引導策略環境互動。使用此方法，我們訓練 ROCKET-1，一種低層級策略，它根據串接的視覺觀察和分割遮罩預測動作，並由 SAM-2 提供即時物件追蹤。我們的技術發揮了 VLM 視覺語言推理能力的全部潛力，使它們能夠解決複雜的創意任務，特別是那些高度依賴空間理解的任務。在 Minecraft 中的實驗證明，我們的技術使代理能夠完成以前無法達成的任務，突顯了視覺時間脈絡提示在具身決策中的有效性。程式碼和範例將在專案頁面中提供：https://craftjarvis.github.io/ROCKET-1。", "author": "Shaofei Cai et.al.", "authors": "Shaofei Cai, Zihao Wang, Kewei Lian, Zhancun Mu, Xiaojian Ma, Anji Liu, Yitao Liang", "id": "2410.17856v1", "paper_url": "http://arxiv.org/abs/2410.17856v1", "repo": "null"}}