{"2412.03307": {"publish_time": "2024-12-04", "title": "Contextual Data Integration for Bike-sharing Demand Prediction with Graph Neural Networks in Degraded Weather Conditions", "paper_summary": "Demand for bike sharing is impacted by various factors, such as weather\nconditions, events, and the availability of other transportation modes. This\nimpact remains elusive due to the complex interdependence of these factors or\nlocationrelated user behavior variations. It is also not clear which factor is\nadditional information which are not already contained in the historical\ndemand. Intermodal dependencies between bike-sharing and other modes are also\nunderexplored, and the value of this information has not been studied in\ndegraded situations. The proposed study analyzes the impact of adding\ncontextual data, such as weather, time embedding, and road traffic flow, to\npredict bike-sharing Origin-Destination (OD) flows in atypical weather\nsituations Our study highlights a mild relationship between prediction quality\nof bike-sharing demand and road traffic flow, while the introduced time\nembedding allows outperforming state-of-the-art results, particularly in the\ncase of degraded weather conditions. Including weather data as an additional\ninput further improves our model with respect to the basic ST-ED-RMGC\nprediction model by reducing of more than 20% the prediction error in degraded\nweather condition.", "paper_summary_zh": "自行車共享的需求會受到各種因素的影響，例如天氣狀況、活動和其它交通方式的可用性。由於這些因素的複雜相互依賴性或與位置相關的使用者行為變化，這種影響仍然難以捉摸。目前也不清楚哪個因素是歷史需求中尚未包含的附加資訊。自行車共享與其它方式之間的跨模式依賴性也尚未充分探討，而且在惡劣情況下，此資訊的價值尚未獲得研究。所提出的研究分析加入背景資料（例如天氣、時間嵌入和道路交通流量）對預測非典型天氣狀況下的自行車共享起迄點 (OD) 流量的影響。我們的研究強調自行車共享需求預測品質與道路交通流量之間的輕微關係，而所引入的時間嵌入允許超越最先進的結果，特別是在惡劣天氣條件的情況下。將天氣資料作為附加輸入，進一步改善我們的模型，相較於基本的 ST-ED-RMGC 預測模型，在惡劣天氣條件下將預測誤差降低超過 20%。", "author": "Romain Rochas et.al.", "authors": "Romain Rochas, Angelo Furno, Nour-Eddin El Faouzi", "id": "2412.03307v1", "paper_url": "http://arxiv.org/abs/2412.03307v1", "repo": "null"}}