{"2408.07637": {"publish_time": "2024-08-14", "title": "Hierarchical Working Memory and a New Magic Number", "paper_summary": "The extremely limited working memory span, typically around four items,\ncontrasts sharply with our everyday experience of processing much larger\nstreams of sensory information concurrently. This disparity suggests that\nworking memory can organize information into compact representations such as\nchunks, yet the underlying neural mechanisms remain largely unknown. Here, we\npropose a recurrent neural network model for chunking within the framework of\nthe synaptic theory of working memory. We showed that by selectively\nsuppressing groups of stimuli, the network can maintain and retrieve the\nstimuli in chunks, hence exceeding the basic capacity. Moreover, we show that\nour model can dynamically construct hierarchical representations within working\nmemory through hierarchical chunking. A consequence of this proposed mechanism\nis a new limit on the number of items that can be stored and subsequently\nretrieved from working memory, depending only on the basic working memory\ncapacity when chunking is not invoked. Predictions from our model were\nconfirmed by analyzing single-unit responses in epileptic patients and memory\nexperiments with verbal material. Our work provides a novel conceptual and\nanalytical framework for understanding the on-the-fly organization of\ninformation in the brain that is crucial for cognition.", "paper_summary_zh": "極度有限的工作記憶範圍，通常約為四個項目，與我們日常處理大量感官資訊流的經驗形成鮮明對比。這種差異表明工作記憶可以將資訊組織成緊湊的表示，例如塊，但其背後的神經機制在很大程度上仍然未知。在這裡，我們提出了一個遞迴神經網路模型，用於在工作記憶突觸理論的框架內進行分塊。我們表明，通過選擇性地抑制刺激組，網路可以維護和檢索塊中的刺激，從而超過基本容量。此外，我們表明我們的模型可以通過分層分塊在工作記憶中動態構建分層表示。這種提議機制的後果是對可以儲存並隨後從工作記憶中檢索的項目數量的新限制，僅取決於在未調用分塊時的基本工作記憶容量。通過分析癲癇患者的單元反應和使用言語材料的記憶實驗，證實了我們模型的預測。我們的研究提供了一個新的概念和分析框架，用於理解大腦中即時組織資訊，這對於認知至關重要。", "author": "Weishun Zhong et.al.", "authors": "Weishun Zhong, Mikhail Katkov, Misha Tsodyks", "id": "2408.07637v1", "paper_url": "http://arxiv.org/abs/2408.07637v1", "repo": "null"}}