{"2411.13237": {"publish_time": "2024-11-20", "title": "BIPro: Zero-shot Chinese Poem Generation via Block Inverse Prompting Constrained Generation Framework", "paper_summary": "Recently, generative pre-trained models have made significant strides,\nparticularly highlighted by the release of ChatGPT and GPT-4, which exhibit\nsuperior cross-domain capabilities. However, these models still face challenges\non constrained writing tasks like poem generation under open-domain titles. In\nresponse to this challenge, we introduce Block Inverse Prompting (BIPro)\nconstrained generation framework. BIPro leverages two block inverse prompting\nmethods, revise and rewrite, that mimic the process of human text writing using\nblock generative models. It significantly improves the zero-shot generation\nquality on the formidable constrained generation task of open-domain\ntraditional-form Chinese poem generation. Based on a less powerful block\ngenerative model GLM-10B-Chinese, poems composed via BIPro without priming or\nadditional training outperform both most advanced direct generative systems\nlike GPT-4 or GLM-4 and best domain-specific systems such as Yusheng,\nShisanbai, or Baidu Poetry Helper in human evaluation by proficient poets.\nFinally, BIPro considerably narrows the gap between AI-generated works and\nshort-listed human literary arts in another human evaluation, unveiling the\npromising potential of block generative models in improving the quality of\nconstrained generation.", "paper_summary_zh": "近来，生成式预训练模型取得了重大进展，特别是 ChatGPT 和 GPT-4 的发布，表现出优异的跨领域能力。然而，这些模型在开放领域标题下的受限写作任务（如诗歌生成）中仍然面临挑战。为了应对这一挑战，我们引入了块逆提示（BIPro）受限生成框架。BIPro 借助两种块逆提示方法（修改和重写）来模拟使用块生成模型进行人类文本写作的过程。它显著提高了开放领域传统形式中文诗歌生成这一艰巨的受限生成任务的零样本生成质量。基于功能较弱的块生成模型 GLM-10B-Chinese，通过 BIPro 创作的诗歌在没有预处理或额外训练的情况下，在熟练诗人的人类评估中优于最先进的直接生成系统（如 GPT-4 或 GLM-4）和最佳领域特定系统（如御胜、十三白或百度诗词助手）。最后，BIPro 在另一项人类评估中显著缩小了 AI 生成的作品与入围人类文学艺术之间的差距，揭示了块生成模型在提高受限生成质量方面的巨大潜力。", "author": "Xu Zou et.al.", "authors": "Xu Zou", "id": "2411.13237v1", "paper_url": "http://arxiv.org/abs/2411.13237v1", "repo": "null"}}