{"2412.03568": {"publish_time": "2024-12-04", "title": "The Matrix: Infinite-Horizon World Generation with Real-Time Moving Control", "paper_summary": "We present The Matrix, the first foundational realistic world simulator\ncapable of generating continuous 720p high-fidelity real-scene video streams\nwith real-time, responsive control in both first- and third-person\nperspectives, enabling immersive exploration of richly dynamic environments.\nTrained on limited supervised data from AAA games like Forza Horizon 5 and\nCyberpunk 2077, complemented by large-scale unsupervised footage from\nreal-world settings like Tokyo streets, The Matrix allows users to traverse\ndiverse terrains -- deserts, grasslands, water bodies, and urban landscapes --\nin continuous, uncut hour-long sequences. Operating at 16 FPS, the system\nsupports real-time interactivity and demonstrates zero-shot generalization,\ntranslating virtual game environments to real-world contexts where collecting\ncontinuous movement data is often infeasible. For example, The Matrix can\nsimulate a BMW X3 driving through an office setting--an environment present in\nneither gaming data nor real-world sources. This approach showcases the\npotential of AAA game data to advance robust world models, bridging the gap\nbetween simulations and real-world applications in scenarios with limited data.", "paper_summary_zh": "我們展示了 The Matrix，這是第一個基礎性的逼真世界模擬器\n能夠產生連續的 720p 高保真實場景影片串流\n在第一人稱和第三人稱\n視角中進行即時、靈敏的控制，讓身歷其境的探索豐富動態的環境。\n使用來自 AAA 遊戲（例如 Forza Horizon 5 和\nCyberpunk 2077）的有限監督數據進行訓練，並輔以來自\n東京街頭等真實世界場景的大規模無監督片段，The Matrix 允許使用者穿越\n各種地形——沙漠、草原、水體和城市景觀——\n在連續、未剪輯的一小時序列中。系統以 16 FPS 運作\n支援即時互動，並展示零次學習泛化，\n將虛擬遊戲環境轉換為真實世界的環境，在其中收集\n連續的移動數據通常不可行。例如，The Matrix 可以\n模擬 BMW X3 在辦公室環境中行駛——一個既不在遊戲數據中也不在真實世界來源中的環境。這種方法展示了\nAAA 遊戲數據在推進強健世界模型方面的潛力，縮小了\n模擬和真實世界應用之間的差距，在資料有限的情況下。", "author": "Ruili Feng et.al.", "authors": "Ruili Feng, Han Zhang, Zhantao Yang, Jie Xiao, Zhilei Shu, Zhiheng Liu, Andy Zheng, Yukun Huang, Yu Liu, Hongyang Zhang", "id": "2412.03568v1", "paper_url": "http://arxiv.org/abs/2412.03568v1", "repo": "null"}}