{"2409.19816": {"publish_time": "2024-09-29", "title": "Grounded Curriculum Learning", "paper_summary": "The high cost of real-world data for robotics Reinforcement Learning (RL)\nleads to the wide usage of simulators. Despite extensive work on building\nbetter dynamics models for simulators to match with the real world, there is\nanother, often-overlooked mismatch between simulations and the real world,\nnamely the distribution of available training tasks. Such a mismatch is further\nexacerbated by existing curriculum learning techniques, which automatically\nvary the simulation task distribution without considering its relevance to the\nreal world. Considering these challenges, we posit that curriculum learning for\nrobotics RL needs to be grounded in real-world task distributions. To this end,\nwe propose Grounded Curriculum Learning (GCL), which aligns the simulated task\ndistribution in the curriculum with the real world, as well as explicitly\nconsiders what tasks have been given to the robot and how the robot has\nperformed in the past. We validate GCL using the BARN dataset on complex\nnavigation tasks, achieving a 6.8% and 6.5% higher success rate compared to a\nstate-of-the-art CL method and a curriculum designed by human experts,\nrespectively. These results show that GCL can enhance learning efficiency and\nnavigation performance by grounding the simulation task distribution in the\nreal world within an adaptive curriculum.", "paper_summary_zh": "機器人強化學習 (RL) 中真實世界數據的高昂成本導致廣泛使用模擬器。儘管在建立更好的動態模型以使模擬器與真實世界相匹配方面做了大量工作，但模擬與真實世界之間還存在另一個經常被忽視的不匹配，即可用訓練任務的分布。現有的課程學習技術進一步加劇了這種不匹配，這些技術會自動改變模擬任務分佈，而不會考慮其與真實世界的相關性。考慮到這些挑戰，我們假設機器人 RL 的課程學習需要以真實世界的任務分佈為基礎。為此，我們提出了基於真實世界的課程學習 (GCL)，它將課程中的模擬任務分佈與真實世界保持一致，並明確考慮了機器人已獲得哪些任務以及機器人在過去的表現。我們使用 BARN 資料集驗證了 GCL 在複雜導航任務中，與最先進的 CL 方法和由人類專家設計的課程相比，分別實現了 6.8% 和 6.5% 的更高成功率。這些結果表明，GCL 能夠通過在自適應課程中將模擬任務分佈建立在真實世界中來提高學習效率和導航性能。", "author": "Linji Wang et.al.", "authors": "Linji Wang, Zifan Xu, Peter Stone, Xuesu Xiao", "id": "2409.19816v1", "paper_url": "http://arxiv.org/abs/2409.19816v1", "repo": "null"}}