{"2412.09416": {"publish_time": "2024-12-12", "title": "Unifying AI Tutor Evaluation: An Evaluation Taxonomy for Pedagogical Ability Assessment of LLM-Powered AI Tutors", "paper_summary": "In this paper, we investigate whether current state-of-the-art large language\nmodels (LLMs) are effective as AI tutors and whether they demonstrate\npedagogical abilities necessary for good AI tutoring in educational dialogues.\nPrevious efforts towards evaluation have been limited to subjective protocols\nand benchmarks. To bridge this gap, we propose a unified evaluation taxonomy\nwith eight pedagogical dimensions based on key learning sciences principles,\nwhich is designed to assess the pedagogical value of LLM-powered AI tutor\nresponses grounded in student mistakes or confusion in the mathematical domain.\nWe release MRBench -- a new evaluation benchmark containing 192 conversations\nand 1,596 responses from seven state-of-the-art LLM-based and human tutors,\nproviding gold annotations for eight pedagogical dimensions. We assess\nreliability of the popular Prometheus2 LLM as an evaluator and analyze each\ntutor's pedagogical abilities, highlighting which LLMs are good tutors and\nwhich ones are more suitable as question-answering systems. We believe that the\npresented taxonomy, benchmark, and human-annotated labels will streamline the\nevaluation process and help track the progress in AI tutors' development.", "paper_summary_zh": "在本文中，我們探討目前最先進的大語言模型 (LLM) 是否能有效作為 AI 導師，以及它們是否展現出在教育對話中進行良好 AI 輔導所需的教學能力。以前在評估方面的努力僅限於主觀協定和基準。為了彌補這個差距，我們提出了統一的評估分類法，其中包含八個基於關鍵學習科學原則的教學面向，旨在評估以學生在數學領域的錯誤或困惑為基礎的 LLM 驅動 AI 導師回應的教學價值。我們發布了 MRBench——一個新的評估基準，其中包含來自七個最先進的基於 LLM 和人類導師的 192 次對話和 1,596 個回應，為八個教學面向提供了黃金註解。我們評估了流行的 Prometheus2 LLM 作為評估者的可靠性，並分析了每位導師的教學能力，重點說明了哪些 LLM 是好的導師，哪些更適合作為問答系統。我們相信，所提出的分類法、基準和人工註解標籤將簡化評估過程，並有助於追蹤 AI 導師發展的進度。", "author": "Kaushal Kumar Maurya et.al.", "authors": "Kaushal Kumar Maurya, KV Aditya Srivatsa, Kseniia Petukhova, Ekaterina Kochmar", "id": "2412.09416v1", "paper_url": "http://arxiv.org/abs/2412.09416v1", "repo": "null"}}