{"2408.16293": {"publish_time": "2024-08-29", "title": "Physics of Language Models: Part 2.2, How to Learn From Mistakes on Grade-School Math Problems", "paper_summary": "Language models have demonstrated remarkable performance in solving reasoning\ntasks; however, even the strongest models still occasionally make reasoning\nmistakes. Recently, there has been active research aimed at improving reasoning\naccuracy, particularly by using pretrained language models to \"self-correct\"\ntheir mistakes via multi-round prompting. In this paper, we follow this line of\nwork but focus on understanding the usefulness of incorporating\n\"error-correction\" data directly into the pretraining stage. This data consists\nof erroneous solution steps immediately followed by their corrections. Using a\nsynthetic math dataset, we show promising results: this type of pretrain data\ncan help language models achieve higher reasoning accuracy directly (i.e.,\nthrough simple auto-regression, without multi-round prompting) compared to\npretraining on the same amount of error-free data. We also delve into many\ndetails, such as (1) how this approach differs from beam search, (2) how such\ndata can be prepared, (3) whether masking is needed on the erroneous tokens,\n(4) the amount of error required, (5) whether such data can be deferred to the\nfine-tuning stage, and many others.", "paper_summary_zh": "語言模型在解決推理任務方面展示了卓越的性能；然而，即使是最強大的模型偶爾也會犯推理錯誤。最近，有積極的研究旨在提高推理準確性，特別是通過使用預訓練語言模型通過多輪提示來「自我修正」錯誤。在本文中，我們遵循這一思路，但重點在於了解將「錯誤更正」資料直接納入預訓練階段的有用性。此資料包含錯誤的解題步驟，其後緊接著是更正。使用合成數學資料集，我們展示了有希望的結果：與在相同數量的無錯誤資料上進行預訓練相比，此類型的預訓練資料可以幫助語言模型直接（即通過簡單的自動迴歸，無需多輪提示）實現更高的推理準確性。我們還深入探討了許多細節，例如 (1) 此方法與波束搜尋有何不同，(2) 如何準備此類資料，(3) 是否需要對錯誤的標記進行遮罩，(4) 所需的錯誤量，(5) 此類資料是否可以推遲到微調階段，以及許多其他方面。", "author": "Tian Ye et.al.", "authors": "Tian Ye, Zicheng Xu, Yuanzhi Li, Zeyuan Allen-Zhu", "id": "2408.16293v1", "paper_url": "http://arxiv.org/abs/2408.16293v1", "repo": "null"}}