{"2409.10064": {"publish_time": "2024-09-16", "title": "MindGuard: Towards Accessible and Sitgma-free Mental Health First Aid via Edge LLM", "paper_summary": "Mental health disorders are among the most prevalent diseases worldwide,\naffecting nearly one in four people. Despite their widespread impact, the\nintervention rate remains below 25%, largely due to the significant cooperation\nrequired from patients for both diagnosis and intervention. The core issue\nbehind this low treatment rate is stigma, which discourages over half of those\naffected from seeking help. This paper presents MindGuard, an accessible,\nstigma-free, and professional mobile mental healthcare system designed to\nprovide mental health first aid. The heart of MindGuard is an innovative edge\nLLM, equipped with professional mental health knowledge, that seamlessly\nintegrates objective mobile sensor data with subjective Ecological Momentary\nAssessment records to deliver personalized screening and intervention\nconversations. We conduct a broad evaluation of MindGuard using open datasets\nspanning four years and real-world deployment across various mobile devices\ninvolving 20 subjects for two weeks. Remarkably, MindGuard achieves results\ncomparable to GPT-4 and outperforms its counterpart with more than 10 times the\nmodel size. We believe that MindGuard paves the way for mobile LLM\napplications, potentially revolutionizing mental healthcare practices by\nsubstituting self-reporting and intervention conversations with passive,\nintegrated monitoring within daily life, thus ensuring accessible and\nstigma-free mental health support.", "paper_summary_zh": "心理健康疾病是全球最普遍的疾病之一，\n影響了近四分之一的人。儘管其影響廣泛，\n但介入率仍低於 25%，很大程度上是因為\n患者在診斷和介入時需要大量配合。背後導致\n治療率低下的核心問題是污名化，這讓超過一半的\n受影響者不願意尋求幫助。本文提出了 MindGuard，一個\n易於取得、無污名化且專業的手機心理保健系統，旨在\n提供心理急救。MindGuard 的核心是一個創新的邊緣\n大型語言模型 (LLM)，具備專業的心理健康知識，它能無縫\n整合客觀的手機感測器資料與主觀的生態瞬時評估記錄，提供\n個人化的篩檢和介入對話。我們使用橫跨四年的開放資料集\n對 MindGuard 進行廣泛的評估，並在各種行動裝置上進行為期\n兩週、涉及 20 位受試者的實際部署。值得注意的是，MindGuard\n達到的結果與 GPT-4 相當，並且優於模型規模大於其 10 倍以上的\n對應模型。我們相信 MindGuard 為行動 LLM 應用鋪平了道路，\n有可能透過在日常生活中進行被動、整合的監控來取代自我報告\n和介入對話，從而徹底改變心理保健實務，進而確保可取得且\n無污名化的精神健康支持。", "author": "Sijie Ji et.al.", "authors": "Sijie Ji, Xinzhe Zheng, Jiawei Sun, Renqi Chen, Wei Gao, Mani Srivastava", "id": "2409.10064v1", "paper_url": "http://arxiv.org/abs/2409.10064v1", "repo": "null"}}