{"2408.09839": {"publish_time": "2024-08-19", "title": "Segment-Anything Models Achieve Zero-shot Robustness in Autonomous Driving", "paper_summary": "Semantic segmentation is a significant perception task in autonomous driving.\nIt suffers from the risks of adversarial examples. In the past few years, deep\nlearning has gradually transitioned from convolutional neural network (CNN)\nmodels with a relatively small number of parameters to foundation models with a\nhuge number of parameters. The segment-anything model (SAM) is a generalized\nimage segmentation framework that is capable of handling various types of\nimages and is able to recognize and segment arbitrary objects in an image\nwithout the need to train on a specific object. It is a unified model that can\nhandle diverse downstream tasks, including semantic segmentation, object\ndetection, and tracking. In the task of semantic segmentation for autonomous\ndriving, it is significant to study the zero-shot adversarial robustness of\nSAM. Therefore, we deliver a systematic empirical study on the robustness of\nSAM without additional training. Based on the experimental results, the\nzero-shot adversarial robustness of the SAM under the black-box corruptions and\nwhite-box adversarial attacks is acceptable, even without the need for\nadditional training. The finding of this study is insightful in that the\ngigantic model parameters and huge amounts of training data lead to the\nphenomenon of emergence, which builds a guarantee of adversarial robustness.\nSAM is a vision foundation model that can be regarded as an early prototype of\nan artificial general intelligence (AGI) pipeline. In such a pipeline, a\nunified model can handle diverse tasks. Therefore, this research not only\ninspects the impact of vision foundation models on safe autonomous driving but\nalso provides a perspective on developing trustworthy AGI. The code is\navailable at: https://github.com/momo1986/robust_sam_iv.", "paper_summary_zh": "語意分割是自動駕駛中一項重要的感知任務。\n它會受到對抗範例的風險影響。在過去幾年，深度學習已逐漸從參數數量相對較少的卷積神經網路 (CNN) 模型轉變為參數數量龐大的基礎模型。區段任何事物模型 (SAM) 是一個通用的影像分割架構，它能夠處理各種類型的影像，並且能夠在影像中辨識和分割任意物件，而無需針對特定物件進行訓練。它是一個統一的模型，可以處理各種下游任務，包括語意分割、物件偵測和追蹤。在自動駕駛的語意分割任務中，研究 SAM 的零次學習對抗魯棒性非常重要。因此，我們對 SAM 的魯棒性進行了系統性的經驗研究，而無需額外訓練。根據實驗結果，即使無需額外訓練，SAM 在黑盒損壞和白盒對抗攻擊下的零次學習對抗魯棒性也是可以接受的。這項研究的發現很有見地，因為龐大的模型參數和大量的訓練資料會導致湧現現象，這建立了對抗魯棒性的保證。SAM 是視覺基礎模型，可視為人工通用智慧 (AGI) 管線的早期原型。在這樣的管線中，統一的模型可以處理各種任務。因此，這項研究不僅檢視了視覺基礎模型對安全自動駕駛的影響，還提供了開發可信賴 AGI 的觀點。程式碼可在 https://github.com/momo1986/robust_sam_iv 取得。", "author": "Jun Yan et.al.", "authors": "Jun Yan, Pengyu Wang, Danni Wang, Weiquan Huang, Daniel Watzenig, Huilin Yin", "id": "2408.09839v1", "paper_url": "http://arxiv.org/abs/2408.09839v1", "repo": "https://github.com/momo1986/robust_sam_iv"}}