{"2409.04272": {"publish_time": "2024-09-06", "title": "Cycle Pixel Difference Network for Crisp Edge Detection", "paper_summary": "Edge detection, as a fundamental task in computer vision, has garnered\nincreasing attention. The advent of deep learning has significantly advanced\nthis field. However, recent deep learning-based methods which rely on\nlarge-scale pre-trained weights cannot be trained from scratch, with very\nlimited research addressing this issue. This paper proposes a novel cycle pixel\ndifference convolution (CPDC), which effectively integrates image gradient\ninformation with modern convolution operations. Based on the CPDC, we develop a\nU-shape encoder-decoder model named CPD-Net, which is a purely end-to-end\nnetwork. Additionally, to address the issue of edge thickness produced by most\nexisting methods, we construct a multi-scale information enhancement module\n(MSEM) to enhance the discriminative ability of the model, thereby generating\ncrisp and clean contour maps. Comprehensive experiments conducted on three\nstandard benchmarks demonstrate that our method achieves competitive\nperformance on the BSDS500 dataset (ODS=0.813), NYUD-V2 (ODS=0.760), and BIPED\ndataset (ODS=0.898). Our approach provides a novel perspective for addressing\nthese challenges in edge detection.", "paper_summary_zh": "邊緣檢測作為電腦視覺中的一項基本任務，已獲得越來越多的關注。深度學習的出現顯著推動了這一領域的發展。然而，依賴於大規模預訓練權重的近期深度學習方法無法從頭開始訓練，而針對此問題的研究非常有限。本文提出了一種新穎的循環像素差分卷積 (CPDC)，它有效地將圖像梯度資訊與現代卷積運算整合在一起。基於 CPDC，我們開發了一個名為 CPD-Net 的 U 形編碼器-解碼器模型，它是一個純粹的端到端網路。此外，為了解決大多數現有方法產生的邊緣粗細問題，我們構建了一個多尺度資訊增強模組 (MSEM) 來增強模型的辨別能力，從而生成清晰乾淨的輪廓圖。在三個標準基準上進行的綜合實驗表明，我們的模型在 BSDS500 資料集 (ODS=0.813)、NYUD-V2 (ODS=0.760) 和 BIPED 資料集 (ODS=0.898) 上取得了有競爭力的效能。我們的模型為解決邊緣檢測中的這些挑戰提供了一個新的視角。", "author": "Changsong Liu et.al.", "authors": "Changsong Liu, Wei Zhang, Yanyan Liu, Mingyang Li, Wenlin Li, Yimeng Fan, Xiangnan Bai, Liang Zhangd", "id": "2409.04272v1", "paper_url": "http://arxiv.org/abs/2409.04272v1", "repo": "null"}}