{"2412.02664": {"publish_time": "2024-12-03", "title": "Probing the statistical properties of enriched co-occurrence networks", "paper_summary": "Recent studies have explored the addition of virtual edges to word\nco-occurrence networks using word embeddings to enhance graph representations,\nparticularly for short texts. While these enriched networks have demonstrated\nsome success, the impact of incorporating semantic edges into traditional\nco-occurrence networks remains uncertain. This study investigates two key\nstatistical properties of text-based network models. First, we assess whether\nnetwork metrics can effectively distinguish between meaningless and meaningful\ntexts. Second, we analyze whether these metrics are more sensitive to syntactic\nor semantic aspects of the text. Our results show that incorporating virtual\nedges can have positive and negative effects, depending on the specific network\nmetric. For instance, the informativeness of the average shortest path and\ncloseness centrality improves in short texts, while the clustering\ncoefficient's informativeness decreases as more virtual edges are added.\nAdditionally, we found that including stopwords affects the statistical\nproperties of enriched networks. Our results can serve as a guideline for\ndetermining which network metrics are most appropriate for specific\napplications, depending on the typical text size and the nature of the problem.", "paper_summary_zh": "<paragraph>最近的研究探索了使用詞嵌入將虛擬邊緣添加到詞共現網路，以增強圖形表示，特別是對於簡短文字。儘管這些豐富的網路已展示出一些成功，但將語義邊緣納入傳統共現網路的影響仍然不確定。本研究探討了基於文字的網路模型的兩個關鍵統計屬性。首先，我們評估網路指標是否能有效區分無意義和有意義的文字。其次，我們分析這些指標是否對文字的句法或語義方面更敏感。我們的結果顯示，納入虛擬邊緣可能會產生正面和負面影響，具體取決於特定的網路指標。例如，平均最短路徑和接近中心性的資訊量在簡短文字中有所改善，而隨著添加更多虛擬邊緣，群集係數的資訊量會降低。此外，我們發現包含停止詞會影響豐富網路的統計屬性。我們的結果可作為指南，用於確定哪些網路指標最適合特定應用，具體取決於典型的文字大小和問題的性質。</paragraph>", "author": "Diego R. Amancio et.al.", "authors": "Diego R. Amancio, Jeaneth Machicao, Laura V. C. Quispe", "id": "2412.02664v1", "paper_url": "http://arxiv.org/abs/2412.02664v1", "repo": "null"}}