{"2408.15729": {"publish_time": "2024-08-28", "title": "LM-PUB-QUIZ: A Comprehensive Framework for Zero-Shot Evaluation of Relational Knowledge in Language Models", "paper_summary": "Knowledge probing evaluates the extent to which a language model (LM) has\nacquired relational knowledge during its pre-training phase. It provides a\ncost-effective means of comparing LMs of different sizes and training setups\nand is useful for monitoring knowledge gained or lost during continual learning\n(CL). In prior work, we presented an improved knowledge probe called BEAR\n(Wiland et al., 2024), which enables the comparison of LMs trained with\ndifferent pre-training objectives (causal and masked LMs) and addresses issues\nof skewed distributions in previous probes to deliver a more unbiased reading\nof LM knowledge. With this paper, we present LM-PUB- QUIZ, a Python framework\nand leaderboard built around the BEAR probing mechanism that enables\nresearchers and practitioners to apply it in their work. It provides options\nfor standalone evaluation and direct integration into the widely-used training\npipeline of the Hugging Face TRANSFORMERS library. Further, it provides a\nfine-grained analysis of different knowledge types to assist users in better\nunderstanding the knowledge in each evaluated LM. We publicly release\nLM-PUB-QUIZ as an open-source project.", "paper_summary_zh": "知識探測評估語言模型 (LM) 在其預訓練階段中獲取關係知識的程度。它提供一種具有成本效益的方法，用於比較不同規模和訓練設定的 LM，並有助於監控在持續學習 (CL) 期間獲得或失去的知識。在先前的研究中，我們提出了一個名為 BEAR（Wiland 等人，2024 年）的改進知識探測，它能夠比較使用不同預訓練目標（因果和遮罩 LM）訓練的 LM，並解決先前探測中分佈偏斜的問題，以提供更公正的 LM 知識解讀。在本文中，我們提出了 LM-PUB-QUIZ，這是一個圍繞 BEAR 探測機制構建的 Python 框架和排行榜，使研究人員和從業人員能夠將其應用於自己的工作中。它提供了獨立評估和直接整合到 Hugging Face TRANSFORMERS 庫廣泛使用的訓練管道中的選項。此外，它提供了對不同知識類型的細粒度分析，以幫助用戶更好地理解每個評估 LM 中的知識。我們公開發布 LM-PUB-QUIZ 作為一個開源項目。", "author": "Max Ploner et.al.", "authors": "Max Ploner, Jacek Wiland, Sebastian Pohl, Alan Akbik", "id": "2408.15729v1", "paper_url": "http://arxiv.org/abs/2408.15729v1", "repo": "null"}}