{"2405.15731": {"publish_time": "2024-05-24", "title": "Understanding the differences in Foundation Models: Attention, State Space Models, and Recurrent Neural Networks", "paper_summary": "Softmax attention is the principle backbone of foundation models for various\nartificial intelligence applications, yet its quadratic complexity in sequence\nlength can limit its inference throughput in long-context settings. To address\nthis challenge, alternative architectures such as linear attention, State Space\nModels (SSMs), and Recurrent Neural Networks (RNNs) have been considered as\nmore efficient alternatives. While connections between these approaches exist,\nsuch models are commonly developed in isolation and there is a lack of\ntheoretical understanding of the shared principles underpinning these\narchitectures and their subtle differences, greatly influencing performance and\nscalability. In this paper, we introduce the Dynamical Systems Framework (DSF),\nwhich allows a principled investigation of all these architectures in a common\nrepresentation. Our framework facilitates rigorous comparisons, providing new\ninsights on the distinctive characteristics of each model class. For instance,\nwe compare linear attention and selective SSMs, detailing their differences and\nconditions under which both are equivalent. We also provide principled\ncomparisons between softmax attention and other model classes, discussing the\ntheoretical conditions under which softmax attention can be approximated.\nAdditionally, we substantiate these new insights with empirical validations and\nmathematical arguments. This shows the DSF's potential to guide the systematic\ndevelopment of future more efficient and scalable foundation models.", "paper_summary_zh": "Softmax 注意力是各種人工智能應用中基礎模型的主要骨幹，但其在序列長度中的二次複雜度可能會限制其在長情境設定中的推論吞吐量。為了應對這一挑戰，線性注意力、狀態空間模型 (SSM) 和遞迴神經網路 (RNN) 等替代架構被視為更有效的替代方案。儘管這些方法之間存在聯繫，但這些模型通常是孤立開發的，並且缺乏對支撐這些架構及其細微差異的共同原理的理論理解，這極大地影響了效能和可擴充性。在本文中，我們引入了動態系統框架 (DSF)，它允許在一個共同表示中對所有這些架構進行原則性研究。我們的框架促進了嚴謹的比較，提供了對每個模型類別的獨特特徵的新見解。例如，我們比較了線性注意力和選擇性 SSM，詳細說明了它們的差異以及在哪些條件下兩者是等效的。我們還對 softmax 注意力和其他模型類別進行了原則性比較，討論了可以在哪些理論條件下近似 softmax 注意力。此外，我們用經驗驗證和數學論證來證實這些新見解。這顯示了 DSF 指導未來更有效率且可擴充的基礎模型的系統化開發的潛力。", "author": "Jerome Sieber et.al.", "authors": "Jerome Sieber, Carmen Amo Alonso, Alexandre Didier, Melanie N. Zeilinger, Antonio Orvieto", "id": "2405.15731v1", "paper_url": "http://arxiv.org/abs/2405.15731v1", "repo": "https://github.com/intelligentcontrolsystems/dsf-mqar"}}