{"2412.03800": {"publish_time": "2024-12-05", "title": "ELEMENT: Episodic and Lifelong Exploration via Maximum Entropy", "paper_summary": "This paper proposes \\emph{Episodic and Lifelong Exploration via Maximum\nENTropy} (ELEMENT), a novel, multiscale, intrinsically motivated reinforcement\nlearning (RL) framework that is able to explore environments without using any\nextrinsic reward and transfer effectively the learned skills to downstream\ntasks. We advance the state of the art in three ways. First, we propose a\nmultiscale entropy optimization to take care of the fact that previous maximum\nstate entropy, for lifelong exploration with millions of state observations,\nsuffers from vanishing rewards and becomes very expensive computationally\nacross iterations. Therefore, we add an episodic maximum entropy over each\nepisode to speedup the search further. Second, we propose a novel intrinsic\nreward for episodic entropy maximization named \\emph{average episodic state\nentropy} which provides the optimal solution for a theoretical upper bound of\nthe episodic state entropy objective. Third, to speed the lifelong entropy\nmaximization, we propose a $k$ nearest neighbors ($k$NN) graph to organize the\nestimation of the entropy and updating processes that reduces the computation\nsubstantially. Our ELEMENT significantly outperforms state-of-the-art intrinsic\nrewards in both episodic and lifelong setups. Moreover, it can be exploited in\ntask-agnostic pre-training, collecting data for offline reinforcement learning,\netc.", "paper_summary_zh": "本文提出了一种新颖的多尺度、内在动机强化学习 (RL) 框架，名为“通过最大熵进行情景和终身探索”(ELEMENT)，该框架能够在不使用任何外在奖励的情况下探索环境，并有效地将所学技能转移到下游任务中。我们在三个方面提升了技术水平。首先，我们提出了多尺度熵优化，以解决以下事实：先前的最大状态熵在进行数百万次状态观察的终身探索时，会遭受奖励消失的影响，并且在每次迭代中都会变得非常昂贵。因此，我们在每个情景中添加了一个情景最大熵，以进一步加快搜索速度。其次，我们提出了一种新的内在奖励，用于情景熵最大化，名为“平均情景状态熵”，它为情景状态熵目标的理论上限提供了最优解。第三，为了加快终身熵最大化，我们提出了一个 $k$ 近邻 ($k$NN) 图，用于组织熵的估计和更新过程，从而大幅减少了计算。我们的 ELEMENT 在情景和终身设置中都明显优于最先进的内在奖励。此外，它还可以用于与任务无关的预训练、收集离线强化学习数据等。", "author": "Hongming Li et.al.", "authors": "Hongming Li, Shujian Yu, Bin Liu, Jose C. Principe", "id": "2412.03800v1", "paper_url": "http://arxiv.org/abs/2412.03800v1", "repo": "null"}}