{"2406.14928": {"publish_time": "2024-06-21", "title": "Autonomous Agents for Collaborative Task under Information Asymmetry", "paper_summary": "Large Language Model Multi-Agent Systems (LLM-MAS) have achieved great\nprogress in solving complex tasks. It performs communication among agents\nwithin the system to collaboratively solve tasks, under the premise of shared\ninformation. However, when agents' communication is leveraged to enhance human\ncooperation, a new challenge arises due to information asymmetry, since each\nagent can only access the information of its human user. Previous MAS struggle\nto complete tasks under this condition. To address this, we propose a new MAS\nparadigm termed iAgents, which denotes Informative Multi-Agent Systems. In\niAgents, the human social network is mirrored in the agent network, where\nagents proactively exchange human information necessary for task resolution,\nthereby overcoming information asymmetry. iAgents employs a novel agent\nreasoning mechanism, InfoNav, to navigate agents' communication towards\neffective information exchange. Together with InfoNav, iAgents organizes human\ninformation in a mixed memory to provide agents with accurate and comprehensive\ninformation for exchange. Additionally, we introduce InformativeBench, the\nfirst benchmark tailored for evaluating LLM agents' task-solving ability under\ninformation asymmetry. Experimental results show that iAgents can collaborate\nwithin a social network of 140 individuals and 588 relationships, autonomously\ncommunicate over 30 turns, and retrieve information from nearly 70,000 messages\nto complete tasks within 3 minutes.", "paper_summary_zh": "大型語言模型多智能體系統 (LLM-MAS) 在解決複雜任務方面取得了巨大的進展。它在系統內的智能體之間進行溝通，在共享資訊的前提下協作解決任務。然而，當智能體的溝通被用於增強人類合作時，由於資訊不對稱，一個新的挑戰出現了，因為每個智能體只能存取其人類使用者的資訊。先前的 MAS 在這種情況下難以完成任務。為了解決這個問題，我們提出了一個新的 MAS 典範，稱為 iAgents，它表示資訊性多智能體系統。在 iAgents 中，人類社交網路反映在智能體網路中，智能體主動交換任務解決所需的資訊，從而克服資訊不對稱。iAgents 使用一種新穎的智能體推理機制 InfoNav，引導智能體的溝通朝向有效的資訊交換。與 InfoNav 一起，iAgents 在混合記憶體中組織人類資訊，為智能體提供準確且全面的資訊進行交換。此外，我們引入了 InformativeBench，這是第一個專門用於評估 LLM 智能體在資訊不對稱下的任務解決能力的基準測試。實驗結果表明，iAgents 能夠在一個由 140 個人和 588 個關係組成的社交網路中協作，在 30 輪中自主溝通，並從近 70,000 條訊息中檢索資訊，在 3 分鐘內完成任務。", "author": "Wei Liu et.al.", "authors": "Wei Liu, Chenxi Wang, Yifei Wang, Zihao Xie, Rennai Qiu, Yufan Dang, Zhuoyun Du, Weize Chen, Cheng Yang, Chen Qian", "id": "2406.14928v1", "paper_url": "http://arxiv.org/abs/2406.14928v1", "repo": "null"}}