{"2410.06621": {"publish_time": "2024-10-09", "title": "Effective Exploration Based on the Structural Information Principles", "paper_summary": "Traditional information theory provides a valuable foundation for\nReinforcement Learning, particularly through representation learning and\nentropy maximization for agent exploration. However, existing methods primarily\nconcentrate on modeling the uncertainty associated with RL's random variables,\nneglecting the inherent structure within the state and action spaces. In this\npaper, we propose a novel Structural Information principles-based Effective\nExploration framework, namely SI2E. Structural mutual information between two\nvariables is defined to address the single-variable limitation in structural\ninformation, and an innovative embedding principle is presented to capture\ndynamics-relevant state-action representations. The SI2E analyzes value\ndifferences in the agent's policy between state-action pairs and minimizes\nstructural entropy to derive the hierarchical state-action structure, referred\nto as the encoding tree. Under this tree structure, value-conditional\nstructural entropy is defined and maximized to design an intrinsic reward\nmechanism that avoids redundant transitions and promotes enhanced coverage in\nthe state-action space. Theoretical connections are established between SI2E\nand classical information-theoretic methodologies, highlighting our framework's\nrationality and advantage. Comprehensive evaluations in the MiniGrid,\nMetaWorld, and DeepMind Control Suite benchmarks demonstrate that SI2E\nsignificantly outperforms state-of-the-art exploration baselines regarding\nfinal performance and sample efficiency, with maximum improvements of 37.63%\nand 60.25%, respectively.", "paper_summary_zh": "傳統資訊理論為強化學習提供了有價值的基礎，特別是透過表示學習和代理探索的熵最大化。然而，現有方法主要集中於建立與 RL 隨機變數相關的不確定性模型，忽略了狀態和動作空間中的內在結構。在本文中，我們提出了一個基於結構資訊原則的新型有效探索框架，即 SI2E。定義了兩個變數之間的結構互資訊，以解決結構資訊中的單一變數限制，並提出了一個創新的嵌入原則來擷取與動態相關的狀態動作表示。SI2E 分析了代理策略中狀態動作對之間的價值差異，並最小化結構熵以推導階層式狀態動作結構，稱為編碼樹。在此樹狀結構下，定義並最大化值條件結構熵，以設計一種內在獎勵機制，避免重複的轉換，並促進在狀態動作空間中的擴展覆蓋率。在 SI2E 和經典資訊理論方法之間建立了理論聯繫，突出了我們框架的合理性和優勢。在 MiniGrid、MetaWorld 和 DeepMind Control Suite 基準中的綜合評估表明，SI2E 在最終效能和樣本效率方面顯著優於最先進的探索基準，最大改進分別為 37.63% 和 60.25%。", "author": "Xianghua Zeng et.al.", "authors": "Xianghua Zeng, Hao Peng, Angsheng Li", "id": "2410.06621v1", "paper_url": "http://arxiv.org/abs/2410.06621v1", "repo": "null"}}