{"2410.22821": {"publish_time": "2024-10-30", "title": "EvoCodeBench: An Evolving Code Generation Benchmark with Domain-Specific Evaluations", "paper_summary": "How to evaluate Large Language Models (LLMs) in code generation remains an\nopen question. Existing benchmarks have two limitations - data leakage and lack\nof domain-specific evaluation. The former hurts the fairness of benchmarks, and\nthe latter hinders practitioners from selecting superior LLMs for specific\nprogramming domains. To address these two limitations, we propose a new\nbenchmark - EvoCodeBench, which has the following advances: (1) Evolving data.\nEvoCodeBench will be dynamically updated every period (e.g., 6 months) to avoid\ndata leakage. This paper releases the first version - EvoCodeBench-2403,\ncontaining 275 samples from 25 repositories. (2) A domain taxonomy and domain\nlabels. Based on the statistics of open-source communities, we design a\nprogramming domain taxonomy consisting of 10 popular domains. Based on the\ntaxonomy, we annotate each sample in EvoCodeBench with a domain label. (3)\nDomain-specific evaluations. Besides the Pass@k, we compute the Domain-Specific\nImprovement (DSI) and define LLMs' comfort and strange domains. These\nevaluations help practitioners select superior LLMs in specific domains and\ndiscover the shortcomings of existing LLMs. We evaluate 8 popular LLMs (e.g.,\ngpt-4, DeepSeek Coder) on EvoCodeBench and summarize some insights.\nEvoCodeBench reveals the actual abilities of these LLMs in real-world\nrepositories. For example, the highest Pass@1 of gpt-4 on EvoCodeBench-2403 is\nonly 20.74%. Besides, we evaluate LLMs in different domains and discover their\ncomfort and strange domains. For example, gpt-4 performs best in most domains\nbut falls behind others in the Internet domain. StarCoder 2-15B unexpectedly\nperforms well in the Database domain and even outperforms 33B LLMs.\nEvoCodeBench has been released.", "paper_summary_zh": "<paragraph>如何評估大型語言模型 (LLM) 在程式碼生成中的表現仍然是一個開放性的問題。現有的基準有兩個限制 - 資料外洩和缺乏特定領域的評估。前者損害了基準的公平性，而後者阻礙了從業者為特定程式設計領域選擇優越的 LLM。為了解決這兩個限制，我們提出了一個新的基準 - EvoCodeBench，它具有以下進展：(1) 演進資料。EvoCodeBench 將每隔一段時間（例如 6 個月）動態更新，以避免資料外洩。本文發布了第一個版本 - EvoCodeBench-2403，其中包含來自 25 個儲存庫的 275 個範例。(2) 領域分類法和領域標籤。根據開源社群的統計資料，我們設計了一個包含 10 個熱門領域的程式設計領域分類法。根據分類法，我們使用領域標籤註解 EvoCodeBench 中的每個範例。(3) 領域特定的評估。除了 Pass@k，我們計算了特定領域的改進 (DSI) 並定義了 LLM 的舒適領域和陌生領域。這些評估有助於從業者在特定領域中選擇優越的 LLM，並發現現有 LLM 的缺點。我們在 EvoCodeBench 上評估了 8 個流行的 LLM（例如 gpt-4、DeepSeek Coder），並總結了一些見解。EvoCodeBench 揭示了這些 LLM 在真實世界儲存庫中的實際能力。例如，gpt-4 在 EvoCodeBench-2403 上的最高 Pass@1 僅為 20.74%。此外，我們評估了不同領域中的 LLM，並發現了它們的舒適領域和陌生領域。例如，gpt-4 在大多數領域中表現最佳，但在網際網路領域落後於其他領域。StarCoder 2-15B 在資料庫領域表現出乎意料地好，甚至優於 33B LLM。EvoCodeBench 已發布。</paragraph>", "author": "Jia Li et.al.", "authors": "Jia Li, Ge Li, Xuanming Zhang, Yunfei Zhao, Yihong Dong, Zhi Jin, Binhua Li, Fei Huang, Yongbin Li", "id": "2410.22821v1", "paper_url": "http://arxiv.org/abs/2410.22821v1", "repo": "null"}}