{"2410.16267": {"publish_time": "2024-10-21", "title": "xGen-MM-Vid (BLIP-3-Video): You Only Need 32 Tokens to Represent a Video Even in VLMs", "paper_summary": "We present xGen-MM-Vid (BLIP-3-Video): a multimodal language model for\nvideos, particularly designed to efficiently capture temporal information over\nmultiple frames. BLIP-3-Video takes advantage of the 'temporal encoder' in\naddition to the conventional visual tokenizer, which maps a sequence of tokens\nover multiple frames into a compact set of visual tokens. This enables\nBLIP3-Video to use much fewer visual tokens than its competing models (e.g., 32\nvs. 4608 tokens). We explore different types of temporal encoders, including\nlearnable spatio-temporal pooling as well as sequential models like Token\nTuring Machines. We experimentally confirm that BLIP-3-Video obtains video\nquestion-answering accuracies comparable to much larger state-of-the-art models\n(e.g., 34B), while being much smaller (i.e., 4B) and more efficient by using\nfewer visual tokens. The project website is at\nhttps://www.salesforceairesearch.com/opensource/xGen-MM-Vid/index.html", "paper_summary_zh": "我們提出了 xGen-MM-Vid (BLIP-3-Video)：一種多模態語言模型，適用於影片，特別設計用於有效捕捉多個畫格的時間資訊。BLIP-3-Video 除了傳統的視覺標記化器外，還利用「時間編碼器」，將多個畫格的標記序列對應到一組精簡的視覺標記。這使得 BLIP3-Video 能夠使用的視覺標記比競爭模型少得多（例如，32 個標記對 4608 個標記）。我們探索了不同類型的時間編碼器，包括可學習的時空池化以及序列模型，例如標記圖靈機。我們透過實驗確認，BLIP-3-Video 獲得的影片問答準確度可與更大的最先進模型（例如，34B）相媲美，同時體積小得多（即 4B），並且透過使用較少的視覺標記而更有效率。專案網站位於 https://www.salesforceairesearch.com/opensource/xGen-MM-Vid/index.html", "author": "Michael S. Ryoo et.al.", "authors": "Michael S. Ryoo, Honglu Zhou, Shrikant Kendre, Can Qin, Le Xue, Manli Shu, Silvio Savarese, Ran Xu, Caiming Xiong, Juan Carlos Niebles", "id": "2410.16267v1", "paper_url": "http://arxiv.org/abs/2410.16267v1", "repo": "null"}}