{"2411.19537": {"publish_time": "2024-11-29", "title": "Deepfake Media Generation and Detection in the Generative AI Era: A Survey and Outlook", "paper_summary": "With the recent advancements in generative modeling, the realism of deepfake\ncontent has been increasing at a steady pace, even reaching the point where\npeople often fail to detect manipulated media content online, thus being\ndeceived into various kinds of scams. In this paper, we survey deepfake\ngeneration and detection techniques, including the most recent developments in\nthe field, such as diffusion models and Neural Radiance Fields. Our literature\nreview covers all deepfake media types, comprising image, video, audio and\nmultimodal (audio-visual) content. We identify various kinds of deepfakes,\naccording to the procedure used to alter or generate the fake content. We\nfurther construct a taxonomy of deepfake generation and detection methods,\nillustrating the important groups of methods and the domains where these\nmethods are applied. Next, we gather datasets used for deepfake detection and\nprovide updated rankings of the best performing deepfake detectors on the most\npopular datasets. In addition, we develop a novel multimodal benchmark to\nevaluate deepfake detectors on out-of-distribution content. The results\nindicate that state-of-the-art detectors fail to generalize to deepfake content\ngenerated by unseen deepfake generators. Finally, we propose future directions\nto obtain robust and powerful deepfake detectors. Our project page and new\nbenchmark are available at https://github.com/CroitoruAlin/biodeep.", "paper_summary_zh": "隨著生成式模型的最新進展，深度偽造內容的逼真度正穩定地提升，甚至達到人們經常無法在網路上偵測出被竄改的媒體內容的程度，因此被各種詐騙手法所欺騙。在本文中，我們調查深度偽造生成和偵測技術，包括該領域最新的發展，例如擴散模型和神經輻射場。我們的文獻回顧涵蓋所有深度偽造媒體類型，包括影像、影片、音訊和多模式（音訊視覺）內容。我們根據用於變更或生成偽造內容的程序，識別出各種深度偽造。我們進一步建構深度偽造生成和偵測方法的分類法，說明方法的重要群組和這些方法的應用領域。接下來，我們收集用於深度偽造偵測的資料集，並提供在最熱門資料集上效能最佳的深度偽造偵測器的最新排名。此外，我們開發一個新穎的多模式基準，以評估深度偽造偵測器在分佈外內容上的表現。結果顯示，最先進的偵測器無法概化到由未見過的深度偽造生成器生成的深度偽造內容。最後，我們提出未來的方向，以獲得強健且強大的深度偽造偵測器。我們的專案頁面和新基準可在 https://github.com/CroitoruAlin/biodeep 取得。", "author": "Florinel-Alin Croitoru et.al.", "authors": "Florinel-Alin Croitoru, Andrei-Iulian Hiji, Vlad Hondru, Nicolae Catalin Ristea, Paul Irofti, Marius Popescu, Cristian Rusu, Radu Tudor Ionescu, Fahad Shahbaz Khan, Mubarak Shah", "id": "2411.19537v1", "paper_url": "http://arxiv.org/abs/2411.19537v1", "repo": "https://github.com/croitorualin/biodeep"}}