{"2411.14571": {"publish_time": "2024-11-21", "title": "Assessment of LLM Responses to End-user Security Questions", "paper_summary": "Answering end user security questions is challenging. While large language\nmodels (LLMs) like GPT, LLAMA, and Gemini are far from error-free, they have\nshown promise in answering a variety of questions outside of security. We\nstudied LLM performance in the area of end user security by qualitatively\nevaluating 3 popular LLMs on 900 systematically collected end user security\nquestions.\n  While LLMs demonstrate broad generalist ``knowledge'' of end user security\ninformation, there are patterns of errors and limitations across LLMs\nconsisting of stale and inaccurate answers, and indirect or unresponsive\ncommunication styles, all of which impacts the quality of information received.\nBased on these patterns, we suggest directions for model improvement and\nrecommend user strategies for interacting with LLMs when seeking assistance\nwith security.", "paper_summary_zh": "回答最終用戶的安全問題是一項挑戰。雖然大型語言模型 (LLM)，例如 GPT、LLAMA 和 Gemini 遠非沒有錯誤，但它們在回答各種安全問題方面已展現出前景。我們透過定性評估 3 個流行的 LLM，針對 900 個系統收集的最終用戶安全問題，研究了 LLM 在最終用戶安全領域的表現。\n\n雖然 LLM 證明對最終用戶安全資訊有廣泛的通才「知識」，但 LLM 中存在著錯誤和限制的模式，包括陳舊和不準確的答案，以及間接或無回應的溝通方式，所有這些都會影響所接收資訊的品質。基於這些模式，我們建議模型改進的方向，並建議用戶在尋求安全協助時與 LLM 互動的策略。", "author": "Vijay Prakash et.al.", "authors": "Vijay Prakash, Kevin Lee, Arkaprabha Bhattacharya, Danny Yuxing Huang, Jessica Staddon", "id": "2411.14571v1", "paper_url": "http://arxiv.org/abs/2411.14571v1", "repo": "null"}}