{"2407.15017": {"publish_time": "2024-07-22", "title": "Knowledge Mechanisms in Large Language Models: A Survey and Perspective", "paper_summary": "Understanding knowledge mechanisms in Large Language Models (LLMs) is crucial\nfor advancing towards trustworthy AGI. This paper reviews knowledge mechanism\nanalysis from a novel taxonomy including knowledge utilization and evolution.\nKnowledge utilization delves into the mechanism of memorization, comprehension\nand application, and creation. Knowledge evolution focuses on the dynamic\nprogression of knowledge within individual and group LLMs. Moreover, we discuss\nwhat knowledge LLMs have learned, the reasons for the fragility of parametric\nknowledge, and the potential dark knowledge (hypothesis) that will be\nchallenging to address. We hope this work can help understand knowledge in LLMs\nand provide insights for future research.", "paper_summary_zh": "理解大型語言模型 (LLM) 中的知識機制對於推進值得信賴的 AGI 至關重要。本文從一個新的分類法回顧了知識機制的分析，包括知識利用和演化。知識利用深入探討了記憶、理解和應用以及創造的機制。知識演化專注於個體和群體 LLM 中知識的動態進程。此外，我們討論了 LLM 學習到的知識、參數化知識脆弱性的原因，以及將會帶來挑戰的潛在黑暗知識（假設）。我們希望這項工作有助於理解 LLM 中的知識，並為未來的研究提供見解。", "author": "Mengru Wang et.al.", "authors": "Mengru Wang, Yunzhi Yao, Ziwen Xu, Shuofei Qiao, Shumin Deng, Peng Wang, Xiang Chen, Jia-Chen Gu, Yong Jiang, Pengjun Xie, Fei Huang, Huajun Chen, Ningyu Zhang", "id": "2407.15017v1", "paper_url": "http://arxiv.org/abs/2407.15017v1", "repo": "null"}}