{"2501.03826": {"publish_time": "2025-01-07", "title": "Investigating the Impact of Data Selection Strategies on Language Model Performance", "paper_summary": "Data selection is critical for enhancing the performance of language models,\nparticularly when aligning training datasets with a desired target\ndistribution. This study explores the effects of different data selection\nmethods and feature types on model performance. We evaluate whether selecting\ndata subsets can influence downstream tasks, whether n-gram features improve\nalignment with target distributions, and whether embedding-based neural\nfeatures provide complementary benefits. Through comparative experiments using\nbaseline random selection methods and distribution aligned approaches, we\nprovide insights into the interplay between data selection strategies and model\ntraining efficacy. All code for this study can be found on\n\\href{https://github.com/jgu13/HIR-Hybrid-Importance-Resampling-for-Language-Models}{github\nrepository}.", "paper_summary_zh": "資料選擇對於增強語言模型的效能至關重要，特別是在將訓練資料集與目標目標分佈對齊時。本研究探討不同資料選擇方法和特徵類型對模型效能的影響。我們評估選擇資料子集是否會影響下游任務，n-gram 特徵是否會改善與目標分佈的對齊，以及基於嵌入的神經特徵是否提供額外的優點。透過使用基準隨機選擇方法和分佈對齊方法進行比較實驗，我們深入了解資料選擇策略和模型訓練效能之間的交互作用。本研究的所有程式碼都可以在\n\\href{https://github.com/jgu13/HIR-Hybrid-Importance-Resampling-for-Language-Models}{github 儲存庫}中找到。", "author": "Jiayao Gu et.al.", "authors": "Jiayao Gu, Liting Chen, Yihong Li", "id": "2501.03826v1", "paper_url": "http://arxiv.org/abs/2501.03826v1", "repo": "https://github.com/jgu13/hir-hybrid-importance-resampling-for-language-models"}}