{"2410.18239": {"publish_time": "2024-10-23", "title": "E2E-Swin-Unet++: An Enhanced End-to-End Swin-Unet Architecture With Dual Decoders For PTMC Segmentation", "paper_summary": "Efficiently managing papillary thyroid microcarcinoma (PTMC) while minimizing\npatient discomfort poses a significant clinical challenge. Radiofrequency\nablation (RFA) offers a less invasive alternative to surgery and radiation\ntherapy for PTMC treatment, characterized by shorter recovery times and reduced\npain. As an image-guided procedure, RFA generates localized heat by delivering\nhigh-frequency electrical currents through electrodes to the targeted area\nunder ultrasound imaging guidance. However, the precision and skill required by\noperators for accurate guidance using current ultrasound B-mode imaging\ntechnologies remain significant challenges. To address these challenges, we\ndevelop a novel AI segmentation model, E2E-Swin-Unet++. This model enhances\nultrasound B-mode imaging by enabling real-time identification and segmentation\nof PTMC tumors and monitoring of the region of interest for precise targeting\nduring treatment. E2E-Swin- Unet++ is an advanced end-to-end extension of the\nSwin-Unet architecture, incorporating thyroid region information to minimize\nthe risk of false PTMC segmentation while providing fast inference\ncapabilities. Experimental results on a real clinical RFA dataset demonstrate\nthe superior performance of E2E-Swin-Unet++ compared to related models. Our\nproposed solution significantly improves the precision and control of RFA\nablation treatment by enabling real-time identification and segmentation of\nPTMC margins during the procedure.", "paper_summary_zh": "在最大程度降低患者不适感的同时有效管理乳头状甲状腺微小癌 (PTMC) 对临床提出了重大挑战。射频消融术 (RFA) 为 PTMC 治疗提供了一种创伤更小的替代手术和放射治疗的方法，其特点是恢复时间更短且疼痛感更低。作为一种图像引导手术，RFA 通过在超声成像引导下通过电极向目标区域输送高频电流来产生局部热量。然而，操作者使用当前超声 B 模式成像技术进行精确引导所需的精确度和技能仍然是重大挑战。为了应对这些挑战，我们开发了一种新的人工智能分割模型 E2E-Swin-Unet++。该模型通过实现 PTMC 肿瘤的实时识别和分割以及在治疗期间监测感兴趣区域以进行精确靶向来增强超声 B 模式成像。E2E-Swin- Unet++ 是 Swin-Unet 架构的高级端到端扩展，它结合了甲状腺区域信息以最大程度地降低错误分割 PTMC 的风险，同时提供快速的推理能力。在真实临床 RFA 数据集上的实验结果证明了 E2E-Swin-Unet++ 与相关模型相比具有卓越的性能。我们提出的解决方案通过在手术期间实现 PTMC 边缘的实时识别和分割，显著提高了 RFA 消融治疗的精确度和控制力。", "author": "Maryam Dialameh et.al.", "authors": "Maryam Dialameh, Hossein Rajabzadeh, Moslem Sadeghi-Goughari, Jung Suk Sim, Hyock Ju Kwon", "id": "2410.18239v1", "paper_url": "http://arxiv.org/abs/2410.18239v1", "repo": "null"}}