{"2504.13165": {"publish_time": "2025-04-17", "title": "RUKA: Rethinking the Design of Humanoid Hands with Learning", "paper_summary": "Dexterous manipulation is a fundamental capability for robotic systems, yet\nprogress has been limited by hardware trade-offs between precision,\ncompactness, strength, and affordability. Existing control methods impose\ncompromises on hand designs and applications. However, learning-based\napproaches present opportunities to rethink these trade-offs, particularly to\naddress challenges with tendon-driven actuation and low-cost materials. This\nwork presents RUKA, a tendon-driven humanoid hand that is compact, affordable,\nand capable. Made from 3D-printed parts and off-the-shelf components, RUKA has\n5 fingers with 15 underactuated degrees of freedom enabling diverse human-like\ngrasps. Its tendon-driven actuation allows powerful grasping in a compact,\nhuman-sized form factor. To address control challenges, we learn\njoint-to-actuator and fingertip-to-actuator models from motion-capture data\ncollected by the MANUS glove, leveraging the hand's morphological accuracy.\nExtensive evaluations demonstrate RUKA's superior reachability, durability, and\nstrength compared to other robotic hands. Teleoperation tasks further showcase\nRUKA's dexterous movements. The open-source design and assembly instructions of\nRUKA, code, and data are available at https://ruka-hand.github.io/.", "paper_summary_zh": "<paragraph>靈巧的操作是機器人系統的一項基本能力，然而由於精度、緊湊性、強度和價格之間的硬體權衡，其進展一直受到限制。現有的控制方法對手的設計和應用做出了妥協。然而，基於學習的方法為重新思考這些權衡提供了機會，特別是解決肌腱驅動致動和低成本材料帶來的挑戰。這項工作展示了 RUKA，這是一款緊湊、價格合理且功能強大的肌腱驅動人形機械手。RUKA 由 3D 列印部件和現成組件製成，具有5 根手指，15 個欠驅動自由度，可實現各種類似人類的抓握。其肌腱驅動致動允許在緊湊的人體尺寸外形中進行強大的抓握。為了應對控制挑戰，我們從MANUS 手套收集的運動捕捉數據中學習關節到致動器和指尖到致動器的模型，利用手部形態的準確性。 廣泛的評估證明，與其他機器人手相比，RUKA 具有卓越的可達性、耐用性和強度。遠程操作任務進一步展示了RUKA 的靈巧運動。RUKA 的開源設計和組裝說明、代碼和數據可在 https://ruka-hand.github.io/ 上找到。</paragraph>\n", "author": "Anya Zorin et.al.", "authors": "Anya Zorin, Irmak Guzey, Billy Yan, Aadhithya Iyer, Lisa Kondrich, Nikhil X. Bhattasali, Lerrel Pinto", "id": "2504.13165v1", "paper_url": "http://arxiv.org/abs/2504.13165v1", "repo": "null"}}