{"2406.11661": {"publish_time": "2024-06-17", "title": "Cultural Conditioning or Placebo? On the Effectiveness of Socio-Demographic Prompting", "paper_summary": "Socio-demographic prompting is a commonly employed approach to study cultural\nbiases in LLMs as well as for aligning models to certain cultures. In this\npaper, we systematically probe four LLMs (Llama 3, Mistral v0.2, GPT-3.5 Turbo\nand GPT-4) with prompts that are conditioned on culturally sensitive and\nnon-sensitive cues, on datasets that are supposed to be culturally sensitive\n(EtiCor and CALI) or neutral (MMLU and ETHICS). We observe that all models\nexcept GPT-4 show significant variations in their responses on both kinds of\ndatasets for both kinds of prompts, casting doubt on the robustness of the\nculturally-conditioned prompting as a method for eliciting cultural bias in\nmodels or as an alignment strategy. The work also calls rethinking the control\nexperiment design to tease apart the cultural conditioning of responses from\n\"placebo effect\", i.e., random perturbations of model responses due to\narbitrary tokens in the prompt.", "paper_summary_zh": "社會人口提示是一種廣泛採用的方法，用於研究 LLM 中的文化偏見，以及將模型與特定文化對齊。在本文中，我們系統性地探查了四個 LLM（Llama 3、Mistral v0.2、GPT-3.5 Turbo 和 GPT-4），提示它們以文化敏感和不敏感的線索為條件，在假設為文化敏感（EtiCor 和 CALI）或中立（MMLU 和 ETHICS）的數據集上。我們觀察到除了 GPT-4 之外，所有模型在兩種提示的兩種數據集上的回應都出現顯著差異，這對文化條件提示作為引發模型中文化偏見的方法或作為對齊策略的穩健性提出質疑。這項工作也要求重新思考對照實驗設計，以區分回應的文化條件和「安慰劑效應」，即提示中任意符號導致模型回應的隨機擾動。", "author": "Sagnik Mukherjee et.al.", "authors": "Sagnik Mukherjee, Muhammad Farid Adilazuarda, Sunayana Sitaram, Kalika Bali, Alham Fikri Aji, Monojit Choudhury", "id": "2406.11661v1", "paper_url": "http://arxiv.org/abs/2406.11661v1", "repo": "null"}}