{"2408.14371": {"publish_time": "2024-08-26", "title": "SelEx: Self-Expertise in Fine-Grained Generalized Category Discovery", "paper_summary": "In this paper, we address Generalized Category Discovery, aiming to\nsimultaneously uncover novel categories and accurately classify known ones.\nTraditional methods, which lean heavily on self-supervision and contrastive\nlearning, often fall short when distinguishing between fine-grained categories.\nTo address this, we introduce a novel concept called `self-expertise', which\nenhances the model's ability to recognize subtle differences and uncover\nunknown categories. Our approach combines unsupervised and supervised\nself-expertise strategies to refine the model's discernment and generalization.\nInitially, hierarchical pseudo-labeling is used to provide `soft supervision',\nimproving the effectiveness of self-expertise. Our supervised technique differs\nfrom traditional methods by utilizing more abstract positive and negative\nsamples, aiding in the formation of clusters that can generalize to novel\ncategories. Meanwhile, our unsupervised strategy encourages the model to\nsharpen its category distinctions by considering within-category examples as\n`hard' negatives. Supported by theoretical insights, our empirical results\nshowcase that our method outperforms existing state-of-the-art techniques in\nGeneralized Category Discovery across several fine-grained datasets. Our code\nis available at: https://github.com/SarahRastegar/SelEx.", "paper_summary_zh": "在本文中，我们探讨廣義類別發現，旨在同時發現新類別並準確分類已知類別。傳統方法過度依賴自我監督和對比學習，在區分細粒度類別時常常力不從心。為了解決此問題，我們引入了一個稱為「自我專業知識」的新概念，它增強了模型識別細微差異和發現未知類別的能力。我們的做法結合了無監督和監督自我專業知識策略，以優化模型的辨識和概化能力。最初，層次偽標籤用於提供「軟監督」，提高自我專業知識的有效性。我們的監督技術不同於傳統方法，它利用更抽象的正負樣本，協助形成可以概化到新類別的群集。同時，我們的無監督策略鼓勵模型將類別內部範例視為「硬」負例，藉此強化其類別區分能力。在理論見解的支援下，我們的實證結果顯示，我們的模型在廣義類別發現方面優於現有的最先進技術，且涵蓋多個細粒度資料集。我們的程式碼可在 https://github.com/SarahRastegar/SelEx 取得。", "author": "Sarah Rastegar et.al.", "authors": "Sarah Rastegar, Mohammadreza Salehi, Yuki M. Asano, Hazel Doughty, Cees G. M. Snoek", "id": "2408.14371v1", "paper_url": "http://arxiv.org/abs/2408.14371v1", "repo": "https://github.com/sarahrastegar/selex"}}