{"2409.07779": {"publish_time": "2024-09-12", "title": "ASSNet: Adaptive Semantic Segmentation Network for Microtumors and Multi-Organ Segmentation", "paper_summary": "Medical image segmentation, a crucial task in computer vision, facilitates\nthe automated delineation of anatomical structures and pathologies, supporting\nclinicians in diagnosis, treatment planning, and disease monitoring. Notably,\ntransformers employing shifted window-based self-attention have demonstrated\nexceptional performance. However, their reliance on local window attention\nlimits the fusion of local and global contextual information, crucial for\nsegmenting microtumors and miniature organs. To address this limitation, we\npropose the Adaptive Semantic Segmentation Network (ASSNet), a transformer\narchitecture that effectively integrates local and global features for precise\nmedical image segmentation. ASSNet comprises a transformer-based U-shaped\nencoder-decoder network. The encoder utilizes shifted window self-attention\nacross five resolutions to extract multi-scale features, which are then\npropagated to the decoder through skip connections. We introduce an augmented\nmulti-layer perceptron within the encoder to explicitly model long-range\ndependencies during feature extraction. Recognizing the constraints of\nconventional symmetrical encoder-decoder designs, we propose an Adaptive\nFeature Fusion (AFF) decoder to complement our encoder. This decoder\nincorporates three key components: the Long Range Dependencies (LRD) block, the\nMulti-Scale Feature Fusion (MFF) block, and the Adaptive Semantic Center (ASC)\nblock. These components synergistically facilitate the effective fusion of\nmulti-scale features extracted by the decoder while capturing long-range\ndependencies and refining object boundaries. Comprehensive experiments on\ndiverse medical image segmentation tasks, including multi-organ, liver tumor,\nand bladder tumor segmentation, demonstrate that ASSNet achieves\nstate-of-the-art results. Code and models are available at:\n\\url{https://github.com/lzeeorno/ASSNet}.", "paper_summary_zh": "<paragraph>醫學影像分割是電腦視覺中一項重要的任務，有助於自動描繪解剖結構和病理，協助臨床醫師進行診斷、治療計畫和疾病監控。值得注意的是，採用位移視窗自注意力機制的Transformer展現出非凡的效能。然而，它們依賴於區域視窗注意力，這限制了區域和全域脈絡資訊的融合，而這對於分割微小腫瘤和微型器官至關重要。為了解決這個限制，我們提出了自適應語義分割網路 (ASSNet)，這是一個Transformer架構，可以有效整合區域和全域特徵，以進行精確的醫學影像分割。ASSNet 包含一個基於Transformer的 U 型編碼器-解碼器網路。編碼器利用五個解析度的位移視窗自注意力來萃取多尺度特徵，然後透過跳躍連線將這些特徵傳播到解碼器。我們在編碼器中引入了擴增的多層感知器，以便在特徵萃取期間明確地建模長程依賴性。鑑於傳統對稱編碼器-解碼器設計的限制，我們提出了一個自適應特徵融合 (AFF) 解碼器來補充我們的編碼器。此解碼器包含三個關鍵組成部分：長程依賴性 (LRD) 區塊、多尺度特徵融合 (MFF) 區塊和自適應語義中心 (ASC) 區塊。這些組成部分相互配合，促成解碼器萃取的多尺度特徵有效融合，同時捕捉長程依賴性並微調物件邊界。在多器官、肝臟腫瘤和膀胱腫瘤分割等各種醫學影像分割任務上的全面實驗證明，ASSNet 達到了最先進的成果。程式碼和模型可於以下網址取得：\\url{https://github.com/lzeeorno/ASSNet}。</paragraph>", "author": "Fuchen Zheng et.al.", "authors": "Fuchen Zheng, Xinyi Chen, Xuhang Chen, Haolun Li, Xiaojiao Guo, Guoheng Huang, Chi-Man Pun, Shoujun Zhou", "id": "2409.07779v1", "paper_url": "http://arxiv.org/abs/2409.07779v1", "repo": "https://github.com/lzeeorno/assnet"}}