{"2409.18339": {"publish_time": "2024-09-26", "title": "AER-LLM: Ambiguity-aware Emotion Recognition Leveraging Large Language Models", "paper_summary": "Recent advancements in Large Language Models (LLMs) have demonstrated great\nsuccess in many Natural Language Processing (NLP) tasks. In addition to their\ncognitive intelligence, exploring their capabilities in emotional intelligence\nis also crucial, as it enables more natural and empathetic conversational AI.\nRecent studies have shown LLMs' capability in recognizing emotions, but they\noften focus on single emotion labels and overlook the complex and ambiguous\nnature of human emotions. This study is the first to address this gap by\nexploring the potential of LLMs in recognizing ambiguous emotions, leveraging\ntheir strong generalization capabilities and in-context learning. We design\nzero-shot and few-shot prompting and incorporate past dialogue as context\ninformation for ambiguous emotion recognition. Experiments conducted using\nthree datasets indicate significant potential for LLMs in recognizing ambiguous\nemotions, and highlight the substantial benefits of including context\ninformation. Furthermore, our findings indicate that LLMs demonstrate a high\ndegree of effectiveness in recognizing less ambiguous emotions and exhibit\npotential for identifying more ambiguous emotions, paralleling human perceptual\ncapabilities.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展已在許多自然語言處理 (NLP) 任務中展現出巨大的成功。除了認知智能外，探索其在情緒智能方面的能力也至關重要，因為它能讓對話式 AI 更自然且富有同理心。最近的研究顯示，LLM 具有辨識情緒的能力，但它們通常只關注單一的情緒標籤，而忽略了人類情緒複雜且含糊的本質。本研究首次探討 LLM 在辨識含糊情緒方面的潛力，利用其強大的概括能力和情境學習，來解決這個問題。我們設計了零次學習和少次學習提示，並將過去的對話納入作為含糊情緒辨識的背景資訊。使用三個資料集進行的實驗顯示，LLM 在辨識含糊情緒方面具有顯著的潛力，並突顯了納入背景資訊的顯著好處。此外，我們的研究結果表明，LLM 在辨識較不含糊的情緒方面表現出高度的有效性，並且在辨識較含糊的情緒方面展現出潛力，這與人類的感知能力相符。", "author": "Xin Hong et.al.", "authors": "Xin Hong, Yuan Gong, Vidhyasaharan Sethu, Ting Dang", "id": "2409.18339v1", "paper_url": "http://arxiv.org/abs/2409.18339v1", "repo": "null"}}