{"2412.00245": {"publish_time": "2024-11-29", "title": "Integrating Social Determinants of Health into Knowledge Graphs: Evaluating Prediction Bias and Fairness in Healthcare", "paper_summary": "Social determinants of health (SDoH) play a crucial role in patient health\noutcomes, yet their integration into biomedical knowledge graphs remains\nunderexplored. This study addresses this gap by constructing an SDoH-enriched\nknowledge graph using the MIMIC-III dataset and PrimeKG. We introduce a novel\nfairness formulation for graph embeddings, focusing on invariance with respect\nto sensitive SDoH information. Via employing a heterogeneous-GCN model for\ndrug-disease link prediction, we detect biases related to various SDoH factors.\nTo mitigate these biases, we propose a post-processing method that\nstrategically reweights edges connected to SDoHs, balancing their influence on\ngraph representations. This approach represents one of the first comprehensive\ninvestigations into fairness issues within biomedical knowledge graphs\nincorporating SDoH. Our work not only highlights the importance of considering\nSDoH in medical informatics but also provides a concrete method for reducing\nSDoH-related biases in link prediction tasks, paving the way for more equitable\nhealthcare recommendations. Our code is available at\n\\url{https://github.com/hwq0726/SDoH-KG}.", "paper_summary_zh": "社會健康決定因素（SDoH）在患者健康結果中扮演著至關重要的角色，但它們整合到生物醫學知識圖譜中的部分仍有待探討。本研究透過使用 MIMIC-III 資料集和 PrimeKG 建構一個 SDoH 豐富的知識圖譜來解決這個差距。我們針對圖形嵌入引入一個新的公平性公式，專注於對敏感的 SDoH 資訊保持不變性。透過採用異質 GCN 模型進行藥物疾病連結預測，我們偵測到與各種 SDoH 因子相關的偏差。為了減輕這些偏差，我們提出一個後處理方法，該方法策略性地重新加權連接到 SDoH 的邊緣，平衡它們對圖表表示的影響。此方法代表了將 SDoH 納入生物醫學知識圖譜中公平性問題的第一個全面調查之一。我們的研究不僅強調了在醫學資訊學中考量 SDoH 的重要性，也提供了一個具體的方法來減少連結預測任務中與 SDoH 相關的偏差，為更公平的醫療保健建議鋪路。我們的程式碼可在 \\url{https://github.com/hwq0726/SDoH-KG} 取得。", "author": "Tianqi Shang et.al.", "authors": "Tianqi Shang, Weiqing He, Tianlong Chen, Ying Ding, Huanmei Wu, Kaixiong Zhou, Li Shen", "id": "2412.00245v1", "paper_url": "http://arxiv.org/abs/2412.00245v1", "repo": "null"}}