{"2410.03834": {"publish_time": "2024-10-04", "title": "GraphRouter: A Graph-based Router for LLM Selections", "paper_summary": "The rapidly growing number and variety of Large Language Models (LLMs)\npresent significant challenges in efficiently selecting the appropriate LLM for\na given query, especially considering the trade-offs between performance and\ncomputational cost. Current LLM selection methods often struggle to generalize\nacross new LLMs and different tasks because of their limited ability to\nleverage contextual interactions among tasks, queries, and LLMs, as well as\ntheir dependence on a transductive learning framework. To address these\nshortcomings, we introduce a novel inductive graph framework, named as\nGraphRouter, which fully utilizes the contextual information among tasks,\nqueries, and LLMs to enhance the LLM selection process. GraphRouter constructs\na heterogeneous graph comprising task, query, and LLM nodes, with interactions\nrepresented as edges, which efficiently captures the contextual information\nbetween the query's requirements and the LLM's capabilities. Through an\ninnovative edge prediction mechanism, GraphRouter is able to predict attributes\n(the effect and cost of LLM response) of potential edges, allowing for\noptimized recommendations that adapt to both existing and newly introduced LLMs\nwithout requiring retraining. Comprehensive experiments across three distinct\neffect-cost weight scenarios have shown that GraphRouter substantially\nsurpasses existing routers, delivering a minimum performance improvement of\n12.3%. In addition, it achieves enhanced generalization across new LLMs\nsettings and supports diverse tasks with at least a 9.5% boost in effect and a\nsignificant reduction in computational demands. This work endeavors to apply a\ngraph-based approach for the contextual and adaptive selection of LLMs,\noffering insights for real-world applications. Our codes for GraphRouter will\nsoon be released at https://github.com/ulab-uiuc/GraphRouter.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 的數量和種類快速增長，在有效地針對特定查詢選擇適當的 LLM 時會帶來重大的挑戰，特別是考慮到效能和運算成本之間的權衡。目前的 LLM 選擇方法通常難以概括到新的 LLM 和不同的任務，因為它們在利用任務、查詢和 LLM 之間的脈絡互動方面的能力有限，而且依賴於轉導學習架構。為了解決這些缺點，我們引進了一個名為 GraphRouter 的新歸納圖形架構，它充分利用任務、查詢和 LLM 之間的脈絡資訊來增強 LLM 選擇流程。GraphRouter 構建了一個異質圖形，包含任務、查詢和 LLM 節點，並將互動表示為邊緣，有效地擷取查詢需求和 LLM 能力之間的脈絡資訊。透過創新的邊緣預測機制，GraphRouter 能夠預測潛在邊緣的屬性（LLM 回應的效果和成本），允許最佳化建議，以適應現有和新推出的 LLM，而無需重新訓練。在三個不同的效果成本權重情境中進行的全面實驗顯示，GraphRouter 明顯超越現有的路由器，效能至少提升 12.3%。此外，它在新的 LLM 設定中實現了增強的概括性，並支援多樣化的任務，效果至少提升 9.5%，並大幅降低運算需求。這項工作致力於應用基於圖形的方法，以進行 LLM 的脈絡和適應性選擇，為真實世界的應用提供見解。我們的 GraphRouter 程式碼將很快在 https://github.com/ulab-uiuc/GraphRouter 發布。</paragraph>", "author": "Tao Feng et.al.", "authors": "Tao Feng, Yanzhen Shen, Jiaxuan You", "id": "2410.03834v1", "paper_url": "http://arxiv.org/abs/2410.03834v1", "repo": "null"}}