{"2409.09869": {"publish_time": "2024-09-15", "title": "Critic as Lyapunov function (CALF): a model-free, stability-ensuring agent", "paper_summary": "This work presents and showcases a novel reinforcement learning agent called\nCritic As Lyapunov Function (CALF) which is model-free and ensures online\nenvironment, in other words, dynamical system stabilization. Online means that\nin each learning episode, the said environment is stabilized. This, as\ndemonstrated in a case study with a mobile robot simulator, greatly improves\nthe overall learning performance. The base actor-critic scheme of CALF is\nanalogous to SARSA. The latter did not show any success in reaching the target\nin our studies. However, a modified version thereof, called SARSA-m here, did\nsucceed in some learning scenarios. Still, CALF greatly outperformed the said\napproach. CALF was also demonstrated to improve a nominal stabilizer provided\nto it. In summary, the presented agent may be considered a viable approach to\nfusing classical control with reinforcement learning. Its concurrent approaches\nare mostly either offline or model-based, like, for instance, those that fuse\nmodel-predictive control into the agent.", "paper_summary_zh": "本研究提出並展示了一種稱為 Lyapunov 函數批評者 (CALF) 的新型強化學習代理，它無模型且確保線上環境，換句話說，動態系統穩定。線上表示在每個學習情節中，所述環境會穩定下來。正如在行動機器人模擬器的案例研究中所展示的那樣，這極大地改善了整體學習表現。CALF 的基本動作批評者方案類似於 SARSA。後者在我們的研究中未顯示出任何達到目標的成功。然而，其修改版本，在此稱為 SARSA-m，確實在一些學習場景中獲得成功。儘管如此，CALF 仍大大優於所述方法。CALF 也被證明可以改進提供給它的標稱穩定器。總之，提出的代理可以被視為將經典控制與強化學習融合的可行方法。它的並發方法大多是離線或基於模型的，例如將模型預測控制融合到代理中的方法。", "author": "Pavel Osinenko et.al.", "authors": "Pavel Osinenko, Grigory Yaremenko, Roman Zashchitin, Anton Bolychev, Sinan Ibrahim, Dmitrii Dobriborsci", "id": "2409.09869v1", "paper_url": "http://arxiv.org/abs/2409.09869v1", "repo": "null"}}