{"2405.07407": {"publish_time": "2024-05-13", "title": "PitcherNet: Powering the Moneyball Evolution in Baseball Video Analytics", "paper_summary": "In the high-stakes world of baseball, every nuance of a pitcher's mechanics\nholds the key to maximizing performance and minimizing runs. Traditional\nanalysis methods often rely on pre-recorded offline numerical data, hindering\ntheir application in the dynamic environment of live games. Broadcast video\nanalysis, while seemingly ideal, faces significant challenges due to factors\nlike motion blur and low resolution. To address these challenges, we introduce\nPitcherNet, an end-to-end automated system that analyzes pitcher kinematics\ndirectly from live broadcast video, thereby extracting valuable pitch\nstatistics including velocity, release point, pitch position, and release\nextension. This system leverages three key components: (1) Player tracking and\nidentification by decoupling actions from player kinematics; (2) Distribution\nand depth-aware 3D human modeling; and (3) Kinematic-driven pitch statistics.\nExperimental validation demonstrates that PitcherNet achieves robust analysis\nresults with 96.82% accuracy in pitcher tracklet identification, reduced joint\nposition error by 1.8mm and superior analytics compared to baseline methods. By\nenabling performance-critical kinematic analysis from broadcast video,\nPitcherNet paves the way for the future of baseball analytics by optimizing\npitching strategies, preventing injuries, and unlocking a deeper understanding\nof pitcher mechanics, forever transforming the game.", "paper_summary_zh": "在棒球這個高風險的世界裡，投手力學的每個細微差別\n掌握著最大化表現和最小化失分的關鍵。傳統\n分析方法通常依賴於預先錄製的離線數值資料，阻礙\n它們在動態的現場比賽環境中的應用。廣播影片\n分析雖然看似理想，但由於運動模糊和低解析度等因素而面臨重大挑戰。為了應對這些挑戰，我們引入了\nPitcherNet，一個端到端的自動化系統，它直接從現場廣播影片分析投手的動作，從而提取有價值的投球\n統計數據，包括速度、出手點、投球位置和出手延展。這個系統利用了三個關鍵組成部分：(1) 透過將動作與投手動作分離來進行球員追蹤和識別；(2) 分布和深度感知 3D 人體建模；以及 (3) 以動作為主的投球統計數據。實驗驗證表明，PitcherNet 在投手軌跡識別方面達到了 96.82% 的準確度，關節位置誤差減少了 1.8 毫米，並且與基準方法相比具有出色的分析能力。透過從廣播影片中實現對表現至關重要的動作分析，\nPitcherNet 為棒球分析的未來鋪平了道路，透過優化\n投球策略、預防受傷，以及深入了解投手力學，永遠改變比賽。", "author": "Jerrin Bright et.al.", "authors": "Jerrin Bright, Bavesh Balaji, Yuhao Chen, David A Clausi, John S Zelek", "id": "2405.07407v1", "paper_url": "http://arxiv.org/abs/2405.07407v1", "repo": "null"}}