{"2405.18065": {"publish_time": "2024-05-28", "title": "EffoVPR: Effective Foundation Model Utilization for Visual Place Recognition", "paper_summary": "The task of Visual Place Recognition (VPR) is to predict the location of a\nquery image from a database of geo-tagged images. Recent studies in VPR have\nhighlighted the significant advantage of employing pre-trained foundation\nmodels like DINOv2 for the VPR task. However, these models are often deemed\ninadequate for VPR without further fine-tuning on task-specific data. In this\npaper, we propose a simple yet powerful approach to better exploit the\npotential of a foundation model for VPR. We first demonstrate that features\nextracted from self-attention layers can serve as a powerful re-ranker for VPR.\nUtilizing these features in a zero-shot manner, our method surpasses previous\nzero-shot methods and achieves competitive results compared to supervised\nmethods across multiple datasets. Subsequently, we demonstrate that a\nsingle-stage method leveraging internal ViT layers for pooling can generate\nglobal features that achieve state-of-the-art results, even when reduced to a\ndimensionality as low as 128D. Nevertheless, incorporating our local foundation\nfeatures for re-ranking, expands this gap. Our approach further demonstrates\nremarkable robustness and generalization, achieving state-of-the-art results,\nwith a significant gap, in challenging scenarios, involving occlusion,\nday-night variations, and seasonal changes.", "paper_summary_zh": "視覺場景辨識 (VPR) 的任務是從地理標籤影像資料庫中預測查詢影像的位置。VPR 的近期研究強調了在 VPR 任務中採用預先訓練好的基礎模型（如 DINOv2）的顯著優勢。然而，這些模型通常被認為在沒有針對特定任務資料進行進一步微調的情況下，不足以用於 VPR。在本文中，我們提出了一個簡單但強大的方法，以更好地發揮基礎模型在 VPR 中的潛力。我們首先證明從自我注意層中提取的特徵可以用作 VPR 的強大重新排名器。我們的模型以零次學習的方式使用這些特徵，超越了先前的零次學習方法，並在多個資料集上達到了與監督式方法相當的競爭力。隨後，我們證明了一個利用內部 ViT 層進行池化的單階段方法，即使降至低至 128D 的維度，也能產生達到最先進結果的全局特徵。儘管如此，結合我們用於重新排名的局部基礎特徵，擴大了這個差距。我們的模型進一步證明了卓越的穩健性和泛化能力，在涉及遮擋、晝夜變化和季節變化的挑戰性場景中，達到了最先進的結果，並有顯著的差距。", "author": "Issar Tzachor et.al.", "authors": "Issar Tzachor, Boaz Lerner, Matan Levy, Michael Green, Tal Berkovitz Shalev, Gavriel Habib, Dvir Samuel, Noam Korngut Zailer, Or Shimshi, Nir Darshan, Rami Ben-Ari", "id": "2405.18065v1", "paper_url": "http://arxiv.org/abs/2405.18065v1", "repo": "null"}}