{"2405.04386": {"publish_time": "2024-05-07", "title": "Pragmatist Intelligence: Where the Principle of Usefulness Can Take ANNs", "paper_summary": "Artificial neural networks (ANNs) perform extraordinarily on numerous tasks\nincluding classification or prediction, e.g., speech processing and image\nclassification. These new functions are based on a computational model that is\nenabled to select freely all necessary internal model parameters as long as it\neventually delivers the functionality it is supposed to exhibit. Here, we\nreview the connection between the model parameter selection in machine learning\n(ML) algorithms running on ANNs and the epistemological theory of neopragmatism\nfocusing on the theory's utility and anti-representationalist aspects. To\nunderstand the consequences of the model parameter selection of an ANN, we\nsuggest using neopragmatist theories whose implications are well studied.\nIncidentally, neopragmatism's notion of optimization is also based on utility\nconsiderations. This means that applying this approach elegantly reveals the\ninherent connections between optimization in ML, using a numerical method\nduring the learning phase, and optimization in the ethical theory of\nconsequentialism, where it occurs as a maxim of action. We suggest that these\nconnections originate from the way relevance is calculated in ML systems. This\ncould ultimately reveal a tendency for specific actions in ML systems.", "paper_summary_zh": "人工神經網路 (ANN) 在許多任務上表現得非常好，包括分類或預測，例如語音處理和影像分類。這些新功能基於一個計算模型，只要它最終提供它應該展示的功能，就能自由選擇所有必要的內部模型參數。在這裡，我們回顧機器學習 (ML) 演算法中模型參數選擇與人工神經網路執行的運作，以及新實用主義的認識論，重點在於該理論的效用和反表象方面。為了了解人工神經網路模型參數選擇的後果，我們建議使用新實用主義理論，其含義已得到充分的研究。順便一提，新實用主義的最佳化概念也基於效用考量。這表示應用這種方法優雅地揭示了機器學習中最佳化的內在關聯，在學習階段使用數值方法，以及後果主義的倫理理論中的最佳化，在其中它作為行動格言出現。我們建議這些關聯源自機器學習系統中計算相關性的方式。這最終可能會揭示機器學習系統中特定動作的趨勢。", "author": "Antonio Bikić et.al.", "authors": "Antonio Bikić, Sayan Mukherjee", "id": "2405.04386v1", "paper_url": "http://arxiv.org/abs/2405.04386v1", "repo": "null"}}