{"2406.12606": {"publish_time": "2024-06-18", "title": "Low-Redundant Optimization for Large Language Model Alignment", "paper_summary": "Large language models (LLMs) are still struggling in aligning with human\npreference in complex tasks and scenarios. They are prone to overfit into the\nunexpected patterns or superficial styles in the training data. We conduct an\nempirical study that only selects the top-10\\% most updated parameters in LLMs\nfor alignment training, and see improvements in the convergence process and\nfinal performance. It indicates the existence of redundant neurons in LLMs for\nalignment training. To reduce its influence, we propose a low-redundant\nalignment method named \\textbf{ALLO}, focusing on optimizing the most related\nneurons with the most useful supervised signals. Concretely, we first identify\nthe neurons that are related to the human preference data by a gradient-based\nstrategy, then identify the alignment-related key tokens by reward models for\ncomputing loss. Besides, we also decompose the alignment process into the\nforgetting and learning stages, where we first forget the tokens with unaligned\nknowledge and then learn aligned knowledge, by updating different ratios of\nneurons, respectively. Experimental results on 10 datasets have shown the\neffectiveness of ALLO. Our code and data are available at\n\\url{https://github.com/RUCAIBox/ALLO}.", "paper_summary_zh": "大型語言模型 (LLM) 在複雜任務和場景中仍難以與人類偏好保持一致。它們容易過度擬合訓練資料中的意外模式或表面風格。我們進行了一項實證研究，僅選取 LLM 中更新幅度最高的前 10% 參數進行對齊訓練，並觀察到收斂過程和最終效能的改善。這表明 LLM 中存在多餘的神經元，可用於對齊訓練。為了減少其影響，我們提出了一種名為 \\textbf{ALLO} 的低冗餘對齊方法，專注於最佳化與最有用的監督訊號最相關的神經元。具體來說，我們首先通過基於梯度的策略識別與人類偏好資料相關的神經元，然後通過獎勵模型識別與對齊相關的關鍵代碼，以計算損失。此外，我們還將對齊過程分解為遺忘和學習階段，在這些階段中，我們首先遺忘具有未對齊知識的代碼，然後通過分別更新不同比例的神經元來學習對齊的知識。在 10 個資料集上的實驗結果顯示了 ALLO 的有效性。我們的程式碼和資料可在 \\url{https://github.com/RUCAIBox/ALLO} 取得。", "author": "Zhipeng Chen et.al.", "authors": "Zhipeng Chen, Kun Zhou, Wayne Xin Zhao, Jingyuan Wang, Ji-Rong Wen", "id": "2406.12606v1", "paper_url": "http://arxiv.org/abs/2406.12606v1", "repo": "https://github.com/rucaibox/allo"}}