{"2406.03853": {"publish_time": "2024-06-06", "title": "Speculative Decoding via Early-exiting for Faster LLM Inference with Thompson Sampling Control Mechanism", "paper_summary": "The recent advancements in large language models (LLMs) have been\nextraordinary, yet the escalating inference costs associated with them present\nchallenges in real-world applications. To address these challenges, we propose\na novel approach called Early-exiting Speculative Decoding (EESD) with lossless\nacceleration. Specifically, EESD utilizes a segment of the LLM to generate\ndraft tokens, incorporating Early-exiting structures after the first N layers.\nTo enhance the quality of draft tokens, a self-distillation method is\nintegrated. This early-exiting design not only reduces deployment and training\ncosts but also significantly accelerates the token generation speed. Moreover,\nwe introduce a novel sampling mechanism that leverages Thompson Sampling to\nregulate the generation processes, automatically determining the quantity of\ndraft tokens in each round. The original LLM is then employed to validate these\ndraft tokens through a single forward pass, and thus guarantees that the final\noutput text maintains a distribution consistent with vanilla auto-regressive\ndecoding. The experimental results on both 13B and 70B models demonstrate that\nour approach decodes tokens at a markedly accelerated rate compared to prior\nmethods, showing the effectiveness of our approach.", "paper_summary_zh": "大型語言模型 (LLM) 近期的進展非凡，但與之相關的推論成本不斷增加，對實際應用構成了挑戰。為了應對這些挑戰，我們提出了一種名為早期退出推論解碼 (EESD) 的新方法，具有無損加速功能。具體來說，EESD 利用 LLM 的一部分來生成草稿代幣，並在第一個 N 層之後加入早期退出結構。為了提高草稿代幣的品質，整合了一種自蒸餾方法。這種早期退出的設計不僅降低了部署和訓練成本，還顯著加快了代幣生成速度。此外，我們引入了一種新穎的抽樣機制，它利用 Thompson 抽樣來調節生成過程，自動確定每一輪中草稿代幣的數量。然後使用原始 LLM 通過單次前向傳遞來驗證這些草稿代幣，從而保證最終輸出文本保持與香草自迴歸解碼一致的分布。在 13B 和 70B 模型上的實驗結果表明，與先前的技術相比，我們的技術以顯著加速的速度解碼代幣，顯示了我們技術的有效性。", "author": "Jiahao Liu et.al.", "authors": "Jiahao Liu, Qifan Wang, Jingang Wang, Xunliang Cai", "id": "2406.03853v1", "paper_url": "http://arxiv.org/abs/2406.03853v1", "repo": "null"}}