{"2412.02285": {"publish_time": "2024-12-03", "title": "GQWformer: A Quantum-based Transformer for Graph Representation Learning", "paper_summary": "Graph Transformers (GTs) have demonstrated significant advantages in graph\nrepresentation learning through their global attention mechanisms. However, the\nself-attention mechanism in GTs tends to neglect the inductive biases inherent\nin graph structures, making it chanllenging to effectively capture essential\nstructural information. To address this issue, we propose a novel approach that\nintegrate graph inductive bias into self-attention mechanisms by leveraging\nquantum technology for structural encoding. In this paper, we introduce the\nGraph Quantum Walk Transformer (GQWformer), a groundbreaking GNN framework that\nutilizes quantum walks on attributed graphs to generate node quantum states.\nThese quantum states encapsulate rich structural attributes and serve as\ninductive biases for the transformer, thereby enabling the generation of more\nmeaningful attention scores. By subsequently incorporating a recurrent neural\nnetwork, our design amplifies the model's ability to focus on both local and\nglobal information. We conducted comprehensive experiments across five publicly\navailable datasets to evaluate the effectiveness of our model. These results\nclearly indicate that GQWformer outperforms existing state-of-the-art graph\nclassification algorithms. These findings highlight the significant potential\nof integrating quantum computing methodologies with traditional GNNs to advance\nthe field of graph representation learning, providing a promising direction for\nfuture research and applications.", "paper_summary_zh": "圖形Transformer (GT) 已透過其全球注意力機制證明了在圖形表示學習中的顯著優勢。然而，GT 中的自我注意力機制傾向於忽略圖形結構中固有的歸納偏差，這使得有效擷取必要的結構資訊變得具有挑戰性。為了解決這個問題，我們提出了一種新方法，透過利用量子技術進行結構編碼，將圖形歸納偏差整合到自我注意力機制中。在本文中，我們介紹了圖形量子漫步Transformer (GQWformer)，這是一個突破性的 GNN 框架，它利用帶屬性圖形上的量子漫步來產生節點量子態。這些量子態包含豐富的結構屬性，並作為Transformer的歸納偏差，從而能夠產生更有意義的注意力分數。透過後續整合遞迴神經網路，我們的設計擴大了模型關注局部和全局資訊的能力。我們在五個公開可用的資料集上進行了全面的實驗，以評估我們模型的有效性。這些結果清楚地表明，GQWformer 優於現有的最先進圖形分類演算法。這些發現突顯了將量子運算方法與傳統 GNN 整合以推動圖形表示學習領域的巨大潛力，為未來的研究和應用提供了有希望的方向。", "author": "Lei Yu et.al.", "authors": "Lei Yu, Hongyang Chen, Jingsong Lv, Linyao Yang", "id": "2412.02285v1", "paper_url": "http://arxiv.org/abs/2412.02285v1", "repo": "null"}}