{"2412.05243": {"publish_time": "2024-12-06", "title": "CompCap: Improving Multimodal Large Language Models with Composite Captions", "paper_summary": "How well can Multimodal Large Language Models (MLLMs) understand composite\nimages? Composite images (CIs) are synthetic visuals created by merging\nmultiple visual elements, such as charts, posters, or screenshots, rather than\nbeing captured directly by a camera. While CIs are prevalent in real-world\napplications, recent MLLM developments have primarily focused on interpreting\nnatural images (NIs). Our research reveals that current MLLMs face significant\nchallenges in accurately understanding CIs, often struggling to extract\ninformation or perform complex reasoning based on these images. We find that\nexisting training data for CIs are mostly formatted for question-answer tasks\n(e.g., in datasets like ChartQA and ScienceQA), while high-quality\nimage-caption datasets, critical for robust vision-language alignment, are only\navailable for NIs. To bridge this gap, we introduce Composite Captions\n(CompCap), a flexible framework that leverages Large Language Models (LLMs) and\nautomation tools to synthesize CIs with accurate and detailed captions. Using\nCompCap, we curate CompCap-118K, a dataset containing 118K image-caption pairs\nacross six CI types. We validate the effectiveness of CompCap-118K by\nsupervised fine-tuning MLLMs of three sizes: xGen-MM-inst.-4B and\nLLaVA-NeXT-Vicuna-7B/13B. Empirical results show that CompCap-118K\nsignificantly enhances MLLMs' understanding of CIs, yielding average gains of\n1.7%, 2.0%, and 2.9% across eleven benchmarks, respectively.", "paper_summary_zh": "多模態大型語言模型 (MLLM) 能有多好地理解合成影像？合成影像 (CI) 是透過合併多個視覺元素（例如圖表、海報或螢幕截圖）所建立的合成視覺效果，而不是直接由相機拍攝。儘管 CI 在現實世界的應用中很普遍，但最近的 MLLM 發展主要集中在詮釋自然影像 (NI)。我們的研究顯示，現有的 MLLM 在準確理解 CI 時面臨重大挑戰，經常難以根據這些影像擷取資訊或執行複雜的推理。我們發現，CI 的現有訓練資料大多以問答任務的格式呈現（例如 ChartQA 和 ScienceQA 等資料集），而對於穩健的視覺語言對齊至關重要的優質影像標題資料集僅適用於 NI。為了彌補這個差距，我們引入了合成標題 (CompCap)，這是一個靈活的架構，利用大型語言模型 (LLM) 和自動化工具來合成具有準確且詳細標題的 CI。使用 CompCap，我們整理了 CompCap-118K，一個包含 118K 影像標題對應的資料集，涵蓋六種類型的 CI。我們透過監督微調三種尺寸的 MLLM 來驗證 CompCap-118K 的有效性：xGen-MM-inst.-4B 和 LLaVA-NeXT-Vicuna-7B/13B。經驗結果顯示，CompCap-118K 大幅提升了 MLLM 對 CI 的理解，在 11 個基準中分別產生了平均 1.7%、2.0% 和 2.9% 的增益。", "author": "Xiaohui Chen et.al.", "authors": "Xiaohui Chen, Satya Narayan Shukla, Mahmoud Azab, Aashu Singh, Qifan Wang, David Yang, ShengYun Peng, Hanchao Yu, Shen Yan, Xuewen Zhang, Baosheng He", "id": "2412.05243v1", "paper_url": "http://arxiv.org/abs/2412.05243v1", "repo": "null"}}