{"2412.12981": {"publish_time": "2024-12-17", "title": "Unlocking LLMs: Addressing Scarce Data and Bias Challenges in Mental Health", "paper_summary": "Large language models (LLMs) have shown promising capabilities in healthcare\nanalysis but face several challenges like hallucinations, parroting, and bias\nmanifestation. These challenges are exacerbated in complex, sensitive, and\nlow-resource domains. Therefore, in this work we introduce IC-AnnoMI, an\nexpert-annotated motivational interviewing (MI) dataset built upon AnnoMI by\ngenerating in-context conversational dialogues leveraging LLMs, particularly\nChatGPT. IC-AnnoMI employs targeted prompts accurately engineered through cues\nand tailored information, taking into account therapy style (empathy,\nreflection), contextual relevance, and false semantic change. Subsequently, the\ndialogues are annotated by experts, strictly adhering to the Motivational\nInterviewing Skills Code (MISC), focusing on both the psychological and\nlinguistic dimensions of MI dialogues. We comprehensively evaluate the\nIC-AnnoMI dataset and ChatGPT's emotional reasoning ability and understanding\nof domain intricacies by modeling novel classification tasks employing several\nclassical machine learning and current state-of-the-art transformer approaches.\nFinally, we discuss the effects of progressive prompting strategies and the\nimpact of augmented data in mitigating the biases manifested in IC-AnnoM. Our\ncontributions provide the MI community with not only a comprehensive dataset\nbut also valuable insights for using LLMs in empathetic text generation for\nconversational therapy in supervised settings.", "paper_summary_zh": "大型語言模型 (LLM) 在醫療保健分析中展現了前景看好的能力，但面臨了幻覺、鸚鵡學舌和偏見表現等多項挑戰。這些挑戰在複雜、敏感和資源不足的領域中會更加嚴重。因此，在這項工作中，我們引入了 IC-AnnoMI，一個由專家註解的動機性訪談 (MI) 資料集，它建立在 AnnoMI 上，透過利用 LLM，特別是 ChatGPT，產生情境對話。IC-AnnoMI 採用了透過提示和客製化資訊準確設計的目標提示，並考量了治療風格（同理心、反思）、情境相關性和錯誤語義變化。隨後，對話由專家註解，嚴格遵守動機性訪談技能準則 (MISC)，重點關注 MI 對話的心理和語言面向。我們透過採用多種經典機器學習和目前最先進的轉換器方法，對 IC-AnnoMI 資料集和 ChatGPT 的情緒推理能力以及對領域複雜性的理解進行全面評估。最後，我們討論了漸進提示策略的影響，以及擴充資料在減輕 IC-AnnoM 中表現出的偏見方面的影響。我們的貢獻不僅為 MI 社群提供了全面的資料集，也提供了在監督式環境中使用 LLM 進行同理心文字生成以進行對話治療的寶貴見解。", "author": "Vivek Kumar et.al.", "authors": "Vivek Kumar, Eirini Ntoutsi, Pushpraj Singh Rajawat, Giacomo Medda, Diego Reforgiato Recupero", "id": "2412.12981v1", "paper_url": "http://arxiv.org/abs/2412.12981v1", "repo": "https://github.com/vsrana-ai/IC-AnnoMI"}}