{"2407.04641": {"publish_time": "2024-07-05", "title": "Speculative Speech Recognition by Audio-Prefixed Low-Rank Adaptation of Language Models", "paper_summary": "This paper explores speculative speech recognition (SSR), where we empower\nconventional automatic speech recognition (ASR) with speculation capabilities,\nallowing the recognizer to run ahead of audio. We introduce a metric for\nmeasuring SSR performance and we propose a model which does SSR by combining a\nRNN-Transducer-based ASR system with an audio-prefixed language model (LM). The\nASR system transcribes ongoing audio and feeds the resulting transcripts, along\nwith an audio-dependent prefix, to the LM, which speculates likely completions\nfor the transcriptions. We experiment with a variety of ASR datasets on which\nshow the efficacy our method and the feasibility of SSR as a method of reducing\nASR latency.", "paper_summary_zh": "本文探討推測性語音辨識 (SSR)，我們賦予傳統自動語音辨識 (ASR) 推測能力，讓辨識器能超前音訊執行。我們引入一個用於衡量 SSR 效能的指標，並提出一個模型，透過結合基於 RNN-Transducer 的 ASR 系統與音訊前置語言模型 (LM) 來執行 SSR。ASR 系統轉錄正在進行的音訊，並將轉錄結果與音訊相關的前置詞一起提供給 LM，由 LM 推測轉錄的可能完成內容。我們使用各種 ASR 資料集進行實驗，結果顯示我們的方法有效，且 SSR 可行作為一種降低 ASR 延遲的方法。", "author": "Bolaji Yusuf et.al.", "authors": "Bolaji Yusuf, Murali Karthick Baskar, Andrew Rosenberg, Bhuvana Ramabhadran", "id": "2407.04641v1", "paper_url": "http://arxiv.org/abs/2407.04641v1", "repo": "null"}}