{"2407.16200": {"publish_time": "2024-07-23", "title": "MCTS Based Dispatch of Autonomous Vehicles under Operational Constraints for Continuous Transportation", "paper_summary": "Continuous transportation of material in the mining industry is achieved by\nthe dispatch of autonomous haul-trucks with discrete haulage capacities.\nRecently, Monte Carlo Tree Search (MCTS) was successfully deployed in tackling\nchallenges of long-run optimality, scalability and adaptability in haul-truck\ndispatch. Typically, operational constraints imposed on the mine site are\nsatisfied by heuristic controllers or human operators independent of the\ndispatch planning. This article incorporates operational constraint\nsatisfaction into the dispatch planning by utilising the MCTS based dispatch\nplanner Flow-Achieving Scheduling Tree (FAST). Operational constraint violation\nand satisfaction are modelled as opportunity costs in the combinatorial\noptimisation problem of dispatch. Explicit cost formulations are avoided by\nutilising MCTS generator models to derive opportunity costs. Experimental\nstudies with four types of operational constraints demonstrate the success of\nutilising opportunity costs for constraint satisfaction, and the effectiveness\nof integrating constraints into dispatch planning.", "paper_summary_zh": "透過派遣具備離散運輸能力的自動化運輸車輛，可達成採礦產業中材料的持續運輸。\n最近，蒙地卡羅樹狀搜尋 (MCTS) 已成功部署於解決運輸車輛調度中的長期最佳化、可擴充性和適應性挑戰。通常，礦場施加於作業的限制，會由啟發式控制器或人為操作員獨立於調度規劃來滿足。本文透過利用基於 MCTS 的調度規劃器 Flow-Achieving Scheduling Tree (FAST)，將作業限制滿足納入調度規劃中。作業限制違規和滿足會建模為調度組合最佳化問題中的機會成本。透過利用 MCTS 生成器模型來推導機會成本，可避免明確的成本公式。透過四種類型的作業限制進行的實驗研究，證明了利用機會成本來滿足限制的成功性，以及將限制整合到調度規劃中的有效性。", "author": "Milan Tomy et.al.", "authors": "Milan Tomy, Konstantin M. Seiler, Andrew J. Hill", "id": "2407.16200v1", "paper_url": "http://arxiv.org/abs/2407.16200v1", "repo": "null"}}