{"2502.12799": {"publish_time": "2025-02-18", "title": "Towards Text-Image Interleaved Retrieval", "paper_summary": "Current multimodal information retrieval studies mainly focus on single-image\ninputs, which limits real-world applications involving multiple images and\ntext-image interleaved content. In this work, we introduce the text-image\ninterleaved retrieval (TIIR) task, where the query and document are interleaved\ntext-image sequences, and the model is required to understand the semantics\nfrom the interleaved context for effective retrieval. We construct a TIIR\nbenchmark based on naturally interleaved wikiHow tutorials, where a specific\npipeline is designed to generate interleaved queries. To explore the task, we\nadapt several off-the-shelf retrievers and build a dense baseline by\ninterleaved multimodal large language model (MLLM). We then propose a novel\nMatryoshka Multimodal Embedder (MME), which compresses the number of visual\ntokens at different granularity, to address the challenge of excessive visual\ntokens in MLLM-based TIIR models. Experiments demonstrate that simple adaption\nof existing models does not consistently yield effective results. Our MME\nachieves significant improvements over the baseline by substantially fewer\nvisual tokens. We provide extensive analysis and will release the dataset and\ncode to facilitate future research.", "paper_summary_zh": "目前的多模態資訊檢索研究主要集中在單一影像輸入，這限制了涉及多個影像和文字影像交錯內容的實際應用。在這項工作中，我們引入了文字影像交錯檢索 (TIIR) 任務，其中查詢和文件是交錯的文字影像序列，並且模型需要理解交錯內容的語意以進行有效檢索。我們根據自然交錯的 wikiHow 教學課程建構了一個 TIIR 基準，其中設計了一個特定的管線來產生交錯查詢。為了探索這個任務，我們調整了幾個現成的檢索器，並透過交錯的多模態大型語言模型 (MLLM) 建立了一個密集的基準。然後，我們提出了一個新穎的 Matryoshka 多模態嵌入器 (MME)，它壓縮了不同粒度視覺符號的數量，以解決基於 MLLM 的 TIIR 模型中過多視覺符號的挑戰。實驗表明，對現有模型的簡單調整並未持續產生有效結果。我們的 MME 透過大幅減少視覺符號，達到了比基準顯著的改進。我們提供了廣泛的分析，並將釋出資料集和程式碼以促進未來的研究。", "author": "Xin Zhang et.al.", "authors": "Xin Zhang, Ziqi Dai, Yongqi Li, Yanzhao Zhang, Dingkun Long, Pengjun Xie, Meishan Zhang, Jun Yu, Wenjie Li, Min Zhang", "id": "2502.12799v1", "paper_url": "http://arxiv.org/abs/2502.12799v1", "repo": "null"}}