{"2410.18615": {"publish_time": "2024-10-24", "title": "FairQueue: Rethinking Prompt Learning for Fair Text-to-Image Generation", "paper_summary": "Recently, prompt learning has emerged as the state-of-the-art (SOTA) for fair\ntext-to-image (T2I) generation. Specifically, this approach leverages readily\navailable reference images to learn inclusive prompts for each target Sensitive\nAttribute (tSA), allowing for fair image generation. In this work, we first\nreveal that this prompt learning-based approach results in degraded sample\nquality. Our analysis shows that the approach's training objective -- which\naims to align the embedding differences of learned prompts and reference images\n-- could be sub-optimal, resulting in distortion of the learned prompts and\ndegraded generated images. To further substantiate this claim, as our major\ncontribution, we deep dive into the denoising subnetwork of the T2I model to\ntrack down the effect of these learned prompts by analyzing the cross-attention\nmaps. In our analysis, we propose a novel prompt switching analysis: I2H and\nH2I. Furthermore, we propose new quantitative characterization of\ncross-attention maps. Our analysis reveals abnormalities in the early denoising\nsteps, perpetuating improper global structure that results in degradation in\nthe generated samples. Building on insights from our analysis, we propose two\nideas: (i) Prompt Queuing and (ii) Attention Amplification to address the\nquality issue. Extensive experimental results on a wide range of tSAs show that\nour proposed method outperforms SOTA approach's image generation quality, while\nachieving competitive fairness. More resources at FairQueue Project site:\nhttps://sutd-visual-computing-group.github.io/FairQueue", "paper_summary_zh": "<paragraph>最近，提示学习已成为公平文本到图像 (T2I) 生成的最先进 (SOTA) 技术。具体来说，这种方法利用现成的参考图像来学习每个目标敏感属性 (tSA) 的包容性提示，从而实现公平的图像生成。在这项工作中，我们首先揭示了这种基于提示学习的方法会导致样本质量下降。我们的分析表明，该方法的训练目标——旨在调整学习提示和参考图像的嵌入差异——可能是次优的，导致学习提示失真和生成图像质量下降。为了进一步证实这一说法，作为我们的主要贡献，我们深入研究了 T2I 模型的去噪子网络，通过分析交叉注意图来追踪这些学习提示的影响。在我们的分析中，我们提出了一种新颖的提示切换分析：I2H 和 H2I。此外，我们提出了交叉注意图的新定量表征。我们的分析揭示了早期去噪步骤中的异常，导致不适当的全局结构，从而导致生成样本退化。基于我们分析中的见解，我们提出了两个想法：(i) 提示排队和 (ii) 注意力放大，以解决质量问题。在广泛的 tSA 上进行的广泛实验结果表明，我们提出的方法在图像生成质量上优于 SOTA 方法，同时实现了有竞争力的公平性。FairQueue 项目网站上有更多资源：https://sutd-visual-computing-group.github.io/FairQueue</paragraph>", "author": "Christopher T. H Teo et.al.", "authors": "Christopher T. H Teo, Milad Abdollahzadeh, Xinda Ma, Ngai-man Cheung", "id": "2410.18615v1", "paper_url": "http://arxiv.org/abs/2410.18615v1", "repo": "null"}}