{"2410.02609": {"publish_time": "2024-10-03", "title": "Ethio-Fake: Cutting-Edge Approaches to Combat Fake News in Under-Resourced Languages Using Explainable AI", "paper_summary": "The proliferation of fake news has emerged as a significant threat to the\nintegrity of information dissemination, particularly on social media platforms.\nMisinformation can spread quickly due to the ease of creating and disseminating\ncontent, affecting public opinion and sociopolitical events. Identifying false\ninformation is therefore essential to reducing its negative consequences and\nmaintaining the reliability of online news sources. Traditional approaches to\nfake news detection often rely solely on content-based features, overlooking\nthe crucial role of social context in shaping the perception and propagation of\nnews articles. In this paper, we propose a comprehensive approach that\nintegrates social context-based features with news content features to enhance\nthe accuracy of fake news detection in under-resourced languages. We perform\nseveral experiments utilizing a variety of methodologies, including traditional\nmachine learning, neural networks, ensemble learning, and transfer learning.\nAssessment of the outcomes of the experiments shows that the ensemble learning\napproach has the highest accuracy, achieving a 0.99 F1 score. Additionally,\nwhen compared with monolingual models, the fine-tuned model with the target\nlanguage outperformed others, achieving a 0.94 F1 score. We analyze the\nfunctioning of the models, considering the important features that contribute\nto model performance, using explainable AI techniques.", "paper_summary_zh": "假新聞的激增已成為資訊傳播的完整性一大威脅，特別是在社群媒體平台上。由於內容的建立和傳播十分容易，錯誤資訊能快速散布，影響公眾輿論和社會政治事件。因此，辨識假資訊對於減少其負面影響和維持線上新聞來源的可靠性至關重要。傳統的假新聞偵測方法通常僅依賴於基於內容的特徵，忽略了社會脈絡在塑造新聞文章的認知和傳播過程中所扮演的關鍵角色。在本文中，我們提出了一個綜合性的方法，將基於社會脈絡的特徵與新聞內容特徵整合，以提升在資源不足的語言中偵測假新聞的準確性。我們執行多項實驗，利用各種方法，包括傳統機器學習、神經網路、集成學習和遷移學習。實驗結果的評估顯示，集成學習方法具有最高的準確性，達到 0.99 的 F1 分數。此外，與單語模型相比，使用目標語言微調的模型表現優於其他模型，達到 0.94 的 F1 分數。我們分析模型的功能，考量有助於模型效能的重要特徵，並使用可解釋的 AI 技術。", "author": "Mesay Gemeda Yigezu et.al.", "authors": "Mesay Gemeda Yigezu, Melkamu Abay Mersha, Girma Yohannis Bade, Jugal Kalita, Olga Kolesnikova, Alexander Gelbukh", "id": "2410.02609v1", "paper_url": "http://arxiv.org/abs/2410.02609v1", "repo": "null"}}