{"2410.02653": {"publish_time": "2024-10-03", "title": "Measuring and Improving Persuasiveness of Generative Models", "paper_summary": "LLMs are increasingly being used in workflows involving generating content to\nbe consumed by humans (e.g., marketing) and also in directly interacting with\nhumans (e.g., through chatbots). The development of such systems that are\ncapable of generating verifiably persuasive messages presents both\nopportunities and challenges for society. On the one hand, such systems could\npositively impact domains like advertising and social good, such as addressing\ndrug addiction, and on the other, they could be misused for spreading\nmisinformation and shaping political opinions. To channel LLMs' impact on\nsociety, we need to develop systems to measure and benchmark their\npersuasiveness. With this motivation, we introduce PersuasionBench and\nPersuasionArena, the first large-scale benchmark and arena containing a battery\nof tasks to measure the persuasion ability of generative models automatically.\nWe investigate to what extent LLMs know and leverage linguistic patterns that\ncan help them generate more persuasive language. Our findings indicate that the\npersuasiveness of LLMs correlates positively with model size, but smaller\nmodels can also be made to have a higher persuasiveness than much larger\nmodels. Notably, targeted training using synthetic and natural datasets\nsignificantly enhances smaller models' persuasive capabilities, challenging\nscale-dependent assumptions. Our findings carry key implications for both model\ndevelopers and policymakers. For instance, while the EU AI Act and California's\nSB-1047 aim to regulate AI models based on the number of floating point\noperations, we demonstrate that simple metrics like this alone fail to capture\nthe full scope of AI's societal impact. We invite the community to explore and\ncontribute to PersuasionArena and PersuasionBench, available at\nhttps://bit.ly/measure-persuasion, to advance our understanding of AI-driven\npersuasion and its societal implications.", "paper_summary_zh": "大型語言模型（LLM）正日益用於涉及產生人類可消費內容（例如行銷）的工作流程中，也用於直接與人類互動（例如透過聊天機器人）。開發出能夠產生可驗證說服性訊息的此類系統，對社會既帶來機遇，也帶來挑戰。一方面，此類系統可以對廣告和社會公益等領域產生積極影響，例如解決藥物成癮問題；另一方面，它們可能會被濫用於散布錯誤訊息和塑造政治觀點。為了引導 LLM 對社會的影響，我們需要開發系統來衡量和評估它們的說服力。基於這一動機，我們介紹了 PersuasionBench 和 PersuasionArena，這是第一個包含一系列任務的大規模基準測試和競技場，用於自動衡量生成模型的說服能力。我們探討了 LLM 在多大程度上了解並利用了可以幫助它們產生更具說服力的語言的語言模式。我們的研究結果表明，LLM 的說服力與模型大小呈正相關，但較小的模型也可以比大得多的模型具有更高的說服力。值得注意的是，使用合成和自然資料集進行的目標訓練顯著增強了較小模型的說服能力，從而挑戰了依賴規模的假設。我們的研究結果對模型開發人員和政策制定者都具有重要意義。例如，儘管歐盟人工智能法案和加州的 SB-1047 旨在根據浮點運算的數量對人工智能模型進行監管，但我們證明了僅憑藉這樣的簡單指標無法捕捉人工智能對社會影響的全部範圍。我們邀請社群探索和貢獻 PersuasionArena 和 PersuasionBench，網址為 https://bit.ly/measure-persuasion，以增進我們對人工智能驅動的說服及其社會影響的理解。", "author": "Somesh Singh et.al.", "authors": "Somesh Singh, Yaman K Singla, Harini SI, Balaji Krishnamurthy", "id": "2410.02653v1", "paper_url": "http://arxiv.org/abs/2410.02653v1", "repo": "null"}}