{"2405.12933": {"publish_time": "2024-05-21", "title": "Skin-in-the-Game: Decision Making via Multi-Stakeholder Alignment in LLMs", "paper_summary": "Large Language Models (LLMs) have shown remarkable capabilities in tasks such\nas summarization, arithmetic reasoning, and question answering. However, they\nencounter significant challenges in the domain of moral reasoning and ethical\ndecision-making, especially in complex scenarios with multiple stakeholders.\nThis paper introduces the Skin-in-the-Game (SKIG) framework, aimed at enhancing\nmoral reasoning in LLMs by exploring decisions' consequences from multiple\nstakeholder perspectives. Central to SKIG's mechanism is simulating\naccountability for actions, which, alongside empathy exercises and risk\nassessment, is pivotal to its effectiveness. We validate SKIG's performance\nacross various moral reasoning benchmarks with proprietary and opensource LLMs,\nand investigate its crucial components through extensive ablation analyses.", "paper_summary_zh": "大型語言模型 (LLM) 在摘要、算術推理和問題解答等任務中展現出非凡的能力。然而，它們在道德推理和道德決策領域中遇到重大挑戰，特別是在涉及多個利害關係人的複雜場景中。本文介紹了 Skin-in-the-Game (SKIG) 框架，旨在通過從多個利害關係人的角度探討決策的後果來增強 LLM 的道德推理。SKIG 機制的核心是模擬對行動的負責，這與同理心練習和風險評估一起，對其有效性至關重要。我們使用專有和開源 LLM 在各種道德推理基準上驗證了 SKIG 的性能，並通過廣泛的消融分析研究了其關鍵組成部分。", "author": "Bilgehan Sel et.al.", "authors": "Bilgehan Sel, Priya Shanmugasundaram, Mohammad Kachuee, Kun Zhou, Ruoxi Jia, Ming Jin", "id": "2405.12933v1", "paper_url": "http://arxiv.org/abs/2405.12933v1", "repo": "null"}}