{"2409.09957": {"publish_time": "2024-09-16", "title": "Deep Graph Anomaly Detection: A Survey and New Perspectives", "paper_summary": "Graph anomaly detection (GAD), which aims to identify unusual graph instances\n(nodes, edges, subgraphs, or graphs), has attracted increasing attention in\nrecent years due to its significance in a wide range of applications. Deep\nlearning approaches, graph neural networks (GNNs) in particular, have been\nemerging as a promising paradigm for GAD, owing to its strong capability in\ncapturing complex structure and/or node attributes in graph data. Considering\nthe large number of methods proposed for GNN-based GAD, it is of paramount\nimportance to summarize the methodologies and findings in the existing GAD\nstudies, so that we can pinpoint effective model designs for tackling open GAD\nproblems. To this end, in this work we aim to present a comprehensive review of\ndeep learning approaches for GAD. Existing GAD surveys are focused on\ntask-specific discussions, making it difficult to understand the technical\ninsights of existing methods and their limitations in addressing some unique\nchallenges in GAD. To fill this gap, we first discuss the problem complexities\nand their resulting challenges in GAD, and then provide a systematic review of\ncurrent deep GAD methods from three novel perspectives of methodology,\nincluding GNN backbone design, proxy task design for GAD, and graph anomaly\nmeasures. To deepen the discussions, we further propose a taxonomy of 13\nfine-grained method categories under these three perspectives to provide more\nin-depth insights into the model designs and their capabilities. To facilitate\nthe experiments and validation, we also summarize a collection of widely-used\nGAD datasets and empirical comparison. We further discuss multiple open\nproblems to inspire more future high-quality research. A continuously updated\nrepository for datasets, links to the codes of algorithms, and empirical\ncomparison is available at\nhttps://github.com/mala-lab/Awesome-Deep-Graph-Anomaly-Detection.", "paper_summary_zh": "圖形異常偵測 (GAD) 旨在識別異常的圖形實例 (節點、邊緣、子圖形或圖形)，近年來由於其在廣泛應用中的重要性而備受關注。深度學習方法，特別是圖形神經網路 (GNN) 已成為 GAD 的一個有前途的範例，因為它具有擷取圖形資料中複雜結構和/或節點屬性的強大能力。考慮到為基於 GNN 的 GAD 提出的方法數量龐大，因此總結現有 GAD 研究中的方法論和發現至關重要，以便我們可以找出解決開放式 GAD 問題的有效模型設計。為此，在這項工作中，我們旨在對 GAD 的深度學習方法提出全面的回顧。現有的 GAD 調查集中在特定任務的討論上，這使得難以理解現有方法的技術見解及其在解決 GAD 中一些獨特挑戰方面的局限性。為了填補這一空白，我們首先討論問題的複雜性和它們在 GAD 中產生的挑戰，然後從方法論的三个新觀點對當前的深度 GAD 方法進行系統性回顧，包括 GNN 主幹設計、GAD 的代理任務設計和圖形異常測量。為了加深討論，我們進一步提出了這三個觀點下 13 個細粒度方法類別的分類法，以提供對模型設計及其功能的更深入見解。為了促進實驗和驗證，我們還總結了一系列廣泛使用的 GAD 資料集和實證比較。我們進一步討論了多個開放性問題，以激勵更多未來的優質研究。一個持續更新的資料集存放庫、演算法程式碼的連結和實證比較可在 https://github.com/mala-lab/Awesome-Deep-Graph-Anomaly-Detection 取得。", "author": "Hezhe Qiao et.al.", "authors": "Hezhe Qiao, Hanghang Tong, Bo An, Irwin King, Charu Aggarwal, Guansong Pang", "id": "2409.09957v1", "paper_url": "http://arxiv.org/abs/2409.09957v1", "repo": "https://github.com/mala-lab/awesome-deep-graph-anomaly-detection"}}