{"2406.17557": {"publish_time": "2024-06-25", "title": "The FineWeb Datasets: Decanting the Web for the Finest Text Data at Scale", "paper_summary": "The performance of a large language model (LLM) depends heavily on the\nquality and size of its pretraining dataset. However, the pretraining datasets\nfor state-of-the-art open LLMs like Llama 3 and Mixtral are not publicly\navailable and very little is known about how they were created. In this work,\nwe introduce FineWeb, a 15-trillion token dataset derived from 96 Common Crawl\nsnapshots that produces better-performing LLMs than other open pretraining\ndatasets. To advance the understanding of how best to curate high-quality\npretraining datasets, we carefully document and ablate all of the design\nchoices used in FineWeb, including in-depth investigations of deduplication and\nfiltering strategies. In addition, we introduce FineWeb-Edu, a 1.3-trillion\ntoken collection of educational text filtered from FineWeb. LLMs pretrained on\nFineWeb-Edu exhibit dramatically better performance on knowledge- and\nreasoning-intensive benchmarks like MMLU and ARC. Along with our datasets, we\npublicly release our data curation codebase and all of the models trained\nduring our ablation experiments.", "paper_summary_zh": "大型語言模型 (LLM) 的效能取決於其預訓練資料集的品質和規模。然而，最先進的開放 LLM（例如 Llama 3 和 Mixtral）的預訓練資料集並未公開，而且我們對於它們的建立方式所知甚少。在這項工作中，我們引入了 FineWeb，這是一個由 96 個 Common Crawl 快照衍生的 15 兆個代幣的資料集，它產生的 LLM 效能優於其他開放預訓練資料集。為了增進我們對於如何最佳策劃高品質預訓練資料集的理解，我們仔細記錄並消融了 FineWeb 中使用的所有設計選擇，包括對重複資料刪除和過濾策略的深入探討。此外，我們引入了 FineWeb-Edu，這是一個從 FineWeb 中過濾出的 1.3 兆個代幣的教育文本集合。在 FineWeb-Edu 上預訓練的 LLM 在知識和推理密集的基準（例如 MMLU 和 ARC）上展現出顯著更好的效能。除了我們的資料集之外，我們還公開發布了我們的資料策劃程式碼庫以及在我們的消融實驗中訓練的所有模型。", "author": "Guilherme Penedo et.al.", "authors": "Guilherme Penedo, Hynek Kydlíček, Loubna Ben allal, Anton Lozhkov, Margaret Mitchell, Colin Raffel, Leandro Von Werra, Thomas Wolf", "id": "2406.17557v1", "paper_url": "http://arxiv.org/abs/2406.17557v1", "repo": "null"}}