{"2502.16610": {"publish_time": "2025-02-23", "title": "AdverX-Ray: Ensuring X-Ray Integrity Through Frequency-Sensitive Adversarial VAEs", "paper_summary": "Ensuring the quality and integrity of medical images is crucial for\nmaintaining diagnostic accuracy in deep learning-based Computer-Aided Diagnosis\nand Computer-Aided Detection (CAD) systems. Covariate shifts are subtle\nvariations in the data distribution caused by different imaging devices or\nsettings and can severely degrade model performance, similar to the effects of\nadversarial attacks. Therefore, it is vital to have a lightweight and fast\nmethod to assess the quality of these images prior to using CAD models.\nAdverX-Ray addresses this need by serving as an image-quality assessment layer,\ndesigned to detect covariate shifts effectively. This Adversarial Variational\nAutoencoder prioritizes the discriminator's role, using the suboptimal outputs\nof the generator as negative samples to fine-tune the discriminator's ability\nto identify high-frequency artifacts. Images generated by adversarial networks\noften exhibit severe high-frequency artifacts, guiding the discriminator to\nfocus excessively on these components. This makes the discriminator ideal for\nthis approach. Trained on patches from X-ray images of specific machine models,\nAdverX-Ray can evaluate whether a scan matches the training distribution, or if\na scan from the same machine is captured under different settings. Extensive\ncomparisons with various OOD detection methods show that AdverX-Ray\nsignificantly outperforms existing techniques, achieving a 96.2% average AUROC\nusing only 64 random patches from an X-ray. Its lightweight and fast\narchitecture makes it suitable for real-time applications, enhancing the\nreliability of medical imaging systems. The code and pretrained models are\npublicly available.", "paper_summary_zh": "確保醫療影像的品質和完整性對於維持深度學習為基礎的電腦輔助診斷和電腦輔助偵測 (CAD) 系統的診斷準確性至關重要。共變量轉移是資料分佈中微妙的變化，是由不同的影像裝置或設定所造成，並且可能嚴重降低模型效能，類似於對抗攻擊的效果。因此，在使用 CAD 模型之前，採用輕量且快速的評估方法來評估這些影像的品質至關重要。AdverX-Ray 透過作為影像品質評估層來滿足此需求，旨在有效偵測共變量轉移。此對抗變異自動編碼器將判別器的角色優先化，使用生成器的次佳輸出作為負面範例，以微調判別器辨識高頻人工製品的能力。對抗網路產生的影像通常會出現嚴重的頻率人工製品，引導判別器過度關注這些組成部分。這使得判別器非常適合這種方法。AdverX-Ray 針對特定機器模型的 X 光影像中的小區域進行訓練，可以評估掃描是否符合訓練分佈，或是否在不同的設定下擷取來自同一台機器上的掃描。與各種 OOD 偵測方法進行廣泛的比較顯示，AdverX-Ray 明顯優於現有技術，僅使用來自 X 光的 64 個隨機小區域就達到了 96.2% 的平均 AUROC。其輕量且快速的架構使其適用於即時應用程式，增強了醫療影像系統的可靠性。程式碼和預訓練模型已公開提供。", "author": "Francisco Caetano et.al.", "authors": "Francisco Caetano, Christiaan Viviers, Lena Filatova, Peter H. N. de With, Fons van der Sommen", "id": "2502.16610v1", "paper_url": "http://arxiv.org/abs/2502.16610v1", "repo": "null"}}