{"2407.10805": {"publish_time": "2024-07-15", "title": "Think-on-Graph 2.0: Deep and Interpretable Large Language Model Reasoning with Knowledge Graph-guided Retrieval", "paper_summary": "Retrieval-augmented generation (RAG) has significantly advanced large\nlanguage models (LLMs) by enabling dynamic information retrieval to mitigate\nknowledge gaps and hallucinations in generated content. However, these systems\noften falter with complex reasoning and consistency across diverse queries. In\nthis work, we present Think-on-Graph 2.0, an enhanced RAG framework that aligns\nquestions with the knowledge graph and uses it as a navigational tool, which\ndeepens and refines the RAG paradigm for information collection and\nintegration. The KG-guided navigation fosters deep and long-range associations\nto uphold logical consistency and optimize the scope of retrieval for precision\nand interoperability. In conjunction, factual consistency can be better ensured\nthrough semantic similarity guided by precise directives. ToG${2.0}$ not only\nimproves the accuracy and reliability of LLMs' responses but also demonstrates\nthe potential of hybrid structured knowledge systems to significantly advance\nLLM reasoning, aligning it closer to human-like performance. We conducted\nextensive experiments on four public datasets to demonstrate the advantages of\nour method compared to the baseline.", "paper_summary_zh": "檢索增強生成（RAG）透過啟用動態資訊檢索來緩解生成內容中的知識差距和幻覺，從而顯著進步了大型語言模型（LLM）。然而，這些系統在複雜推理和跨不同查詢的一致性方面常常會出錯。在這項工作中，我們提出了 Think-on-Graph 2.0，一種增強的 RAG 框架，它將問題與知識圖譜對齊並將其用作導航工具，這加深並改進了用於資訊收集和整合的 RAG 典範。受知識圖譜引導的導航促進了深入且長距離的關聯，以維持邏輯一致性並最佳化檢索範圍以提高精確度和互操作性。結合起來，事實一致性可以透過由精確指示引導的語義相似性得到更好的確保。ToG${2.0}$ 不僅提升了 LLM 回應的準確性和可靠性，還展示了混合結構化知識系統在顯著推進 LLM 推理方面的潛力，使之更接近人類般的表現。我們在四個公共數據集上進行了廣泛的實驗，以展示我們的方法與基線相比的優勢。", "author": "Shengjie Ma et.al.", "authors": "Shengjie Ma, Chengjin Xu, Xuhui Jiang, Muzhi Li, Huaren Qu, Jian Guo", "id": "2407.10805v2", "paper_url": "http://arxiv.org/abs/2407.10805v2", "repo": "null"}}