{"2407.15748": {"publish_time": "2024-07-22", "title": "MoRSE: Bridging the Gap in Cybersecurity Expertise with Retrieval Augmented Generation", "paper_summary": "In this paper, we introduce MoRSE (Mixture of RAGs Security Experts), the\nfirst specialised AI chatbot for cybersecurity. MoRSE aims to provide\ncomprehensive and complete knowledge about cybersecurity. MoRSE uses two RAG\n(Retrieval Augmented Generation) systems designed to retrieve and organize\ninformation from multidimensional cybersecurity contexts. MoRSE differs from\ntraditional RAGs by using parallel retrievers that work together to retrieve\nsemantically related information in different formats and structures. Unlike\ntraditional Large Language Models (LLMs) that rely on Parametric Knowledge\nBases, MoRSE retrieves relevant documents from Non-Parametric Knowledge Bases\nin response to user queries. Subsequently, MoRSE uses this information to\ngenerate accurate answers. In addition, MoRSE benefits from real-time updates\nto its knowledge bases, enabling continuous knowledge enrichment without\nretraining. We have evaluated the effectiveness of MoRSE against other\nstate-of-the-art LLMs, evaluating the system on 600 cybersecurity specific\nquestions. The experimental evaluation has shown that the improvement in terms\nof relevance and correctness of the answer is more than 10\\% compared to known\nsolutions such as GPT-4 and Mixtral 7x8.", "paper_summary_zh": "在本文中，我們介紹 MoRSE（RAG 安全專家的混合），第一個專門用於網路安全的 AI 聊天機器人。MoRSE 旨在提供關於網路安全的全面且完整的知識。MoRSE 使用兩個 RAG（檢索增強生成）系統，旨在從多維網路安全情境中檢索和整理資訊。MoRSE 與傳統的 RAG 不同，它使用並行檢索器共同運作，以檢索不同格式和結構中的語義相關資訊。與依賴參數化知識庫的傳統大型語言模型 (LLM) 不同，MoRSE 根據使用者查詢從非參數化知識庫中檢索相關文件。隨後，MoRSE 使用這些資訊產生準確的答案。此外，MoRSE 受益於其知識庫的即時更新，可以在不重新訓練的情況下持續豐富知識。我們已經評估了 MoRSE 對比其他最先進的 LLM 的有效性，在 600 個網路安全特定問題上評估系統。實驗評估表明，與已知的解決方案（例如 GPT-4 和 Mixtral 7x8）相比，答案相關性和正確性的改進超過 10%。", "author": "Marco Simoni et.al.", "authors": "Marco Simoni, Andrea Saracino, Vinod P., Mauro Conti", "id": "2407.15748v1", "paper_url": "http://arxiv.org/abs/2407.15748v1", "repo": "null"}}