{"2411.04434": {"publish_time": "2024-11-07", "title": "Scaling Laws for Pre-training Agents and World Models", "paper_summary": "The performance of embodied agents has been shown to improve by increasing\nmodel parameters, dataset size, and compute. This has been demonstrated in\ndomains from robotics to video games, when generative learning objectives on\noffline datasets (pre-training) are used to model an agent's behavior\n(imitation learning) or their environment (world modeling). This paper\ncharacterizes the role of scale in these tasks more precisely. Going beyond the\nsimple intuition that `bigger is better', we show that the same types of power\nlaws found in language modeling (e.g. between loss and optimal model size),\nalso arise in world modeling and imitation learning. However, the coefficients\nof these laws are heavily influenced by the tokenizer, task \\& architecture --\nthis has important implications on the optimal sizing of models and data.", "paper_summary_zh": "具身代理的效能已證實能透過增加模型參數、資料集大小和運算而提升。這已在機器人技術到電玩遊戲等領域中獲得驗證，當離線資料集（預訓練）上的生成式學習目標用於建模代理行為（模仿學習）或其環境（世界建模）時。本文更精確地描述了規模在這些任務中的角色。除了「越大越好」的直覺之外，我們展示了在語言建模中發現的相同類型的冪律（例如，損失和最佳模型大小之間）也出現在世界建模和模仿學習中。然而，這些定律的係數受到分詞器、任務和架構的極大影響——這對模型和資料的最佳大小有重要的影響。", "author": "Tim Pearce et.al.", "authors": "Tim Pearce, Tabish Rashid, Dave Bignell, Raluca Georgescu, Sam Devlin, Katja Hofmann", "id": "2411.04434v1", "paper_url": "http://arxiv.org/abs/2411.04434v1", "repo": "null"}}