{"2406.08024": {"publish_time": "2024-06-12", "title": "Fewer Tokens and Fewer Videos: Extending Video Understanding Abilities in Large Vision-Language Models", "paper_summary": "Amidst the advancements in image-based Large Vision-Language Models\n(image-LVLM), the transition to video-based models (video-LVLM) is hindered by\nthe limited availability of quality video data. This paper addresses the\nchallenge by leveraging the visual commonalities between images and videos to\nefficiently evolve image-LVLMs into video-LVLMs. We present a cost-effective\nvideo-LVLM that enhances model architecture, introduces innovative training\nstrategies, and identifies the most effective types of video instruction data.\nOur innovative weighted token sampler significantly compresses the visual token\nnumbers of each video frame, effectively cutting computational expenses. We\nalso find that judiciously using just 10% of the video data, compared to prior\nvideo-LVLMs, yields impressive results during various training phases.\nMoreover, we delve into the influence of video instruction data in\nlimited-resource settings, highlighting the significance of incorporating video\ntraining data that emphasizes temporal understanding to enhance model\nperformance. The resulting Fewer Tokens and Fewer Videos LVLM (FTFV-LVLM)\nexhibits exceptional performance across video and image benchmarks, validating\nour model's design and training approaches.", "paper_summary_zh": "在基於影像的大型視覺語言模型 (image-LVLM) 進展中，轉換為基於影片的模型 (video-LVLM) 受到影片資料品質有限的阻礙。本文透過利用影像和影片之間的視覺共性，提出一個解決方案，有效地將 image-LVLM 轉變為 video-LVLM。我們提出一個具有成本效益的 video-LVLM，它增強了模型架構、引進創新的訓練策略，並找出最有效的影片教學資料類型。我們創新的加權代幣取樣器大幅壓縮每個影片畫格的視覺代幣數量，有效地降低運算成本。我們也發現，與先前的 video-LVLM 相比，明智地只使用 10% 的影片資料，就能在各種訓練階段產生令人印象深刻的結果。此外，我們深入探討影片教學資料在資源有限的設定中的影響，強調納入強調時間理解的影片訓練資料，以增強模型效能的重要性。產生的更少代幣和更少影片 LVLM (FTFV-LVLM) 在影片和影像基準上展現出傑出的效能，驗證了我們模型的設計和訓練方法。", "author": "Shimin Chen et.al.", "authors": "Shimin Chen, Yitian Yuan, Shaoxiang Chen, Zequn Jie, Lin Ma", "id": "2406.08024v1", "paper_url": "http://arxiv.org/abs/2406.08024v1", "repo": "null"}}