{"2405.17483": {"publish_time": "2024-05-24", "title": "Concept-based Explainable Malignancy Scoring on Pulmonary Nodules in CT Images", "paper_summary": "To increase the transparency of modern computer-aided diagnosis (CAD) systems\nfor assessing the malignancy of lung nodules, an interpretable model based on\napplying the generalized additive models and the concept-based learning is\nproposed. The model detects a set of clinically significant attributes in\naddition to the final malignancy regression score and learns the association\nbetween the lung nodule attributes and a final diagnosis decision as well as\ntheir contributions into the decision. The proposed concept-based learning\nframework provides human-readable explanations in terms of different concepts\n(numerical and categorical), their values, and their contribution to the final\nprediction. Numerical experiments with the LIDC-IDRI dataset demonstrate that\nthe diagnosis results obtained using the proposed model, which explicitly\nexplores internal relationships, are in line with similar patterns observed in\nclinical practice. Additionally, the proposed model shows the competitive\nclassification and the nodule attribute scoring performance, highlighting its\npotential for effective decision-making in the lung nodule diagnosis.", "paper_summary_zh": "為了提升現代電腦輔助診斷（CAD）系統對肺結節惡性程度評估的透明度，提出一個基於廣義加法模型和基於概念的學習的可解釋模型。此模型除了最終惡性回歸分數外，還能偵測一組臨床顯著屬性，並學習肺結節屬性與最終診斷決策之間的關聯，以及它們對決策的貢獻。所提出的基於概念的學習架構提供人類可讀的解釋，包括不同的概念（數值和類別）、它們的值，以及它們對最終預測的貢獻。使用 LIDC-IDRI 資料集進行的數值實驗證明，使用所提出的模型獲得的診斷結果明確探索內部關係，與臨床實務中觀察到的類似模式一致。此外，所提出的模型顯示出競爭性的分類和結節屬性評分表現，突顯其在肺結節診斷中進行有效決策的潛力。", "author": "Rinat I. Dumaev et.al.", "authors": "Rinat I. Dumaev, Sergei A. Molodyakov, Lev V. Utkin", "id": "2405.17483v1", "paper_url": "http://arxiv.org/abs/2405.17483v1", "repo": "null"}}