{"2410.02458": {"publish_time": "2024-10-03", "title": "MedVisionLlama: Leveraging Pre-Trained Large Language Model Layers to Enhance Medical Image Segmentation", "paper_summary": "Large Language Models (LLMs), known for their versatility in textual data,\nare increasingly being explored for their potential to enhance medical image\nsegmentation, a crucial task for accurate diagnostic imaging. This study\nexplores enhancing Vision Transformers (ViTs) for medical image segmentation by\nintegrating pre-trained LLM transformer blocks. Our approach, which\nincorporates a frozen LLM transformer block into the encoder of a ViT-based\nmodel, leads to substantial improvements in segmentation performance across\nvarious medical imaging modalities. We propose a Hybrid Attention Mechanism\nthat combines global and local feature learning with a Multi-Scale Fusion Block\nfor aggregating features across different scales. The enhanced model shows\nsignificant performance gains, including an average Dice score increase from\n0.74 to 0.79 and improvements in accuracy, precision, and the Jaccard Index.\nThese results demonstrate the effectiveness of LLM-based transformers in\nrefining medical image segmentation, highlighting their potential to\nsignificantly boost model accuracy and robustness. The source code and our\nimplementation are available at: https://bit.ly/3zf2CVs", "paper_summary_zh": "大型語言模型 (LLM) 以其在文本數據中的多功能性而聞名，\n正越來越多地被探索其增強醫學影像分割的潛力，這對於準確的診斷影像至關重要。這項研究\n探討了通過整合預先訓練的 LLM transformer 塊來增強用於醫學影像分割的 Vision Transformers (ViT)。我們的做法是，\n將凍結的 LLM transformer 塊整合到基於 ViT 的模型的編碼器中，從而大幅提升了各種醫學影像模式的分割效能。我們提出了一種混合注意力機制，\n結合全局和局部特徵學習，並使用多尺度融合塊來彙總不同尺度的特徵。增強後的模型顯示出顯著的效能提升，包括 Dice 評分平均從\n0.74 提升至 0.79，以及準確度、精確度和 Jaccard 指數的提升。\n這些結果證明了基於 LLM 的 transformer 在優化醫學影像分割方面的有效性，突顯了其大幅提升模型準確度和穩健性的潛力。\n原始碼和我們的實作可於以下網址取得：https://bit.ly/3zf2CVs", "author": "Gurucharan Marthi Krishna Kumar et.al.", "authors": "Gurucharan Marthi Krishna Kumar, Aman Chadha, Janine Mendola, Amir Shmuel", "id": "2410.02458v1", "paper_url": "http://arxiv.org/abs/2410.02458v1", "repo": "null"}}