{"2408.01024": {"publish_time": "2024-08-02", "title": "Semantic Skill Grounding for Embodied Instruction-Following in Cross-Domain Environments", "paper_summary": "In embodied instruction-following (EIF), the integration of pretrained\nlanguage models (LMs) as task planners emerges as a significant branch, where\ntasks are planned at the skill level by prompting LMs with pretrained skills\nand user instructions. However, grounding these pretrained skills in different\ndomains remains challenging due to their intricate entanglement with the\ndomain-specific knowledge. To address this challenge, we present a semantic\nskill grounding (SemGro) framework that leverages the hierarchical nature of\nsemantic skills. SemGro recognizes the broad spectrum of these skills, ranging\nfrom short-horizon low-semantic skills that are universally applicable across\ndomains to long-horizon rich-semantic skills that are highly specialized and\ntailored for particular domains. The framework employs an iterative skill\ndecomposition approach, starting from the higher levels of semantic skill\nhierarchy and then moving downwards, so as to ground each planned skill to an\nexecutable level within the target domain. To do so, we use the reasoning\ncapabilities of LMs for composing and decomposing semantic skills, as well as\ntheir multi-modal extension for assessing the skill feasibility in the target\ndomain. Our experiments in the VirtualHome benchmark show the efficacy of\nSemGro in 300 cross-domain EIF scenarios.", "paper_summary_zh": "在體現指令遵循 (EIF) 中，預訓練語言模型 (LM) 作為任務規劃者的整合成為一個重要的分支，其中任務在技能層級上被規劃，通過提示 LM 預訓練技能和使用者指令。然而，由於預訓練技能與特定領域知識的複雜糾纏，將這些預訓練技能基礎化在不同的領域中仍然具有挑戰性。為了應對這一挑戰，我們提出了一個語義技能基礎化 (SemGro) 框架，該框架利用了語義技能的層次結構。SemGro 認識到這些技能的廣泛範圍，從普遍適用於跨領域的短視界低語義技能到高度專業化且針對特定領域量身定制的長視界豐富語義技能。該框架採用了一種迭代技能分解方法，從語義技能層次的較高層級開始，然後向下移動，以便將每個計劃技能基礎化到目標領域中的可執行層級。為此，我們使用 LM 的推理能力來組合和分解語義技能，以及它們的多模式擴充功能來評估目標領域中的技能可行性。我們在 VirtualHome 基準測試中的實驗顯示了 SemGro 在 300 個跨領域 EIF 場景中的功效。", "author": "Sangwoo Shin et.al.", "authors": "Sangwoo Shin, Seunghyun Kim, Youngsoo Jang, Moontae Lee, Honguk Woo", "id": "2408.01024v1", "paper_url": "http://arxiv.org/abs/2408.01024v1", "repo": "null"}}