{"2409.05215": {"publish_time": "2024-09-08", "title": "Synthetic Tabular Data Generation for Class Imbalance and Fairness: A Comparative Study", "paper_summary": "Due to their data-driven nature, Machine Learning (ML) models are susceptible\nto bias inherited from data, especially in classification problems where class\nand group imbalances are prevalent. Class imbalance (in the classification\ntarget) and group imbalance (in protected attributes like sex or race) can\nundermine both ML utility and fairness. Although class and group imbalances\ncommonly coincide in real-world tabular datasets, limited methods address this\nscenario. While most methods use oversampling techniques, like interpolation,\nto mitigate imbalances, recent advancements in synthetic tabular data\ngeneration offer promise but have not been adequately explored for this\npurpose. To this end, this paper conducts a comparative analysis to address\nclass and group imbalances using state-of-the-art models for synthetic tabular\ndata generation and various sampling strategies. Experimental results on four\ndatasets, demonstrate the effectiveness of generative models for bias\nmitigation, creating opportunities for further exploration in this direction.", "paper_summary_zh": "由於機器學習 (ML) 模型以資料為依據，因此容易受到資料中繼承的偏差影響，特別是在分類問題中，類別和群組不平衡的現象很普遍。類別不平衡（在分類目標中）和群組不平衡（在受保護的屬性中，例如性別或種族）會損害 ML 的效用和公平性。儘管類別和群組不平衡通常在現實世界的表格資料集中同時發生，但解決此情境的可用方法有限。雖然大多數方法都使用過採樣技術（例如插補）來減輕不平衡的現象，但合成表格資料生成方面的最新進展提供了希望，但尚未充分探索此目的。為此，本文進行比較分析，以使用最先進的合成表格資料生成模型和各種抽樣策略來解決類別和群組不平衡的問題。在四個資料集上的實驗結果證明了生成模型在偏差減緩方面的有效性，為進一步探索此方向創造了機會。", "author": "Emmanouil Panagiotou et.al.", "authors": "Emmanouil Panagiotou, Arjun Roy, Eirini Ntoutsi", "id": "2409.05215v1", "paper_url": "http://arxiv.org/abs/2409.05215v1", "repo": "null"}}