{"2411.04915": {"publish_time": "2024-11-07", "title": "Evaluating Robustness of Reinforcement Learning Algorithms for Autonomous Shipping", "paper_summary": "Recently, there has been growing interest in autonomous shipping due to its\npotential to improve maritime efficiency and safety. The use of advanced\ntechnologies, such as artificial intelligence, can address the current\nnavigational and operational challenges in autonomous shipping. In particular,\ninland waterway transport (IWT) presents a unique set of challenges, such as\ncrowded waterways and variable environmental conditions. In such dynamic\nsettings, the reliability and robustness of autonomous shipping solutions are\ncritical factors for ensuring safe operations. This paper examines the\nrobustness of benchmark deep reinforcement learning (RL) algorithms,\nimplemented for IWT within an autonomous shipping simulator, and their ability\nto generate effective motion planning policies. We demonstrate that a\nmodel-free approach can achieve an adequate policy in the simulator,\nsuccessfully navigating port environments never encountered during training. We\nfocus particularly on Soft-Actor Critic (SAC), which we show to be inherently\nmore robust to environmental disturbances compared to MuZero, a\nstate-of-the-art model-based RL algorithm. In this paper, we take a significant\nstep towards developing robust, applied RL frameworks that can be generalized\nto various vessel types and navigate complex port- and inland environments and\nscenarios.", "paper_summary_zh": "<paragraph>最近，由於自動航運有望提升航海效率和安全性，因此備受關注。使用人工智慧等先進技術，可以解決自動航運中現有的導航和營運挑戰。特別是，內陸水道運輸 (IWT) 提出了一組獨特的挑戰，例如擁擠的水道和多變的環境條件。在這種動態環境中，自動航運解決方案的可靠性和穩健性是確保安全營運的關鍵因素。本文探討了基準深度強化學習 (RL) 演算法的穩健性，這些演算法是在自動航運模擬器中為 IWT 實作，以及它們產生有效運動規劃政策的能力。我們證明了無模型方法可以在模擬器中實現適當的政策，成功導航在訓練期間從未遭遇過的港口環境。我們特別關注 Soft-Actor Critic (SAC)，我們展示它與 MuZero（一種最先進的基於模型的 RL 演算法）相比，本質上對環境干擾更穩健。在本文中，我們邁出了重要一步，開發穩健的應用 RL 架構，可以推廣到各種船舶類型，並導航複雜的港口和內陸環境和場景。</paragraph>", "author": "Bavo Lesy et.al.", "authors": "Bavo Lesy, Ali Anwar, Siegfried Mercelis", "id": "2411.04915v1", "paper_url": "http://arxiv.org/abs/2411.04915v1", "repo": "null"}}