{"2407.09999": {"publish_time": "2024-07-13", "title": "Pay Less On Clinical Images: Asymmetric Multi-Modal Fusion Method For Efficient Multi-Label Skin Lesion Classification", "paper_summary": "Existing multi-modal approaches primarily focus on enhancing multi-label skin\nlesion classification performance through advanced fusion modules, often\nneglecting the associated rise in parameters. In clinical settings, both\nclinical and dermoscopy images are captured for diagnosis; however, dermoscopy\nimages exhibit more crucial visual features for multi-label skin lesion\nclassification. Motivated by this observation, we introduce a novel asymmetric\nmulti-modal fusion method in this paper for efficient multi-label skin lesion\nclassification. Our fusion method incorporates two innovative schemes. Firstly,\nwe validate the effectiveness of our asymmetric fusion structure. It employs a\nlight and simple network for clinical images and a heavier, more complex one\nfor dermoscopy images, resulting in significant parameter savings compared to\nthe symmetric fusion structure using two identical networks for both\nmodalities. Secondly, in contrast to previous approaches using mutual attention\nmodules for interaction between image modalities, we propose an asymmetric\nattention module. This module solely leverages clinical image information to\nenhance dermoscopy image features, considering clinical images as supplementary\ninformation in our pipeline. We conduct the extensive experiments on the\nseven-point checklist dataset. Results demonstrate the generality of our\nproposed method for both networks and Transformer structures, showcasing its\nsuperiority over existing methods We will make our code publicly available.", "paper_summary_zh": "現有的多模式方法主要專注於透過先進的融合模組來增強多標籤皮膚病變分類效能，往往忽略了相關參數的增加。在臨床環境中，臨床上和皮膚鏡影像都會被擷取用於診斷；然而，皮膚鏡影像展現出更重要的視覺特徵，用於多標籤皮膚病變分類。受此觀察結果啟發，我們在本文中介紹一種新穎的不對稱多模式融合方法，用於有效的多標籤皮膚病變分類。我們的融合方法包含兩個創新的方案。首先，我們驗證了我們的不對稱融合結構的有效性。它採用一個輕量且簡單的網路用於臨床影像，以及一個較重且複雜的網路用於皮膚鏡影像，與使用兩個相同的網路用於兩種模式的對稱融合結構相比，這會節省大量的參數。其次，與先前使用相互注意力模組用於影像模式之間互動的方法相反，我們提出了一個不對稱注意力模組。這個模組僅利用臨床影像資訊來增強皮膚鏡影像特徵，將臨床影像視為我們流程中的補充資訊。我們在七點核對清單資料集上進行了廣泛的實驗。結果證明了我們提出的方法對網路和 Transformer 結構的普遍性，展示了它優於現有方法的優越性。我們將公開我們的程式碼。", "author": "Peng Tang et.al.", "authors": "Peng Tang, Tobias Lasser", "id": "2407.09999v1", "paper_url": "http://arxiv.org/abs/2407.09999v1", "repo": "null"}}