{"2407.02805": {"publish_time": "2024-07-03", "title": "Efficient DNN-Powered Software with Fair Sparse Models", "paper_summary": "With the emergence of the Software 3.0 era, there is a growing trend of\ncompressing and integrating large models into software systems, with\nsignificant societal implications. Regrettably, in numerous instances, model\ncompression techniques impact the fairness performance of these models and thus\nthe ethical behavior of DNN-powered software. One of the most notable example\nis the Lottery Ticket Hypothesis (LTH), a prevailing model pruning approach.\nThis paper demonstrates that fairness issue of LTHbased pruning arises from\nboth its subnetwork selection and training procedures, highlighting the\ninadequacy of existing remedies. To address this, we propose a novel pruning\nframework, Ballot, which employs a novel conflict-detection-based subnetwork\nselection to find accurate and fair subnetworks, coupled with a refined\ntraining process to attain a high-performance model, thereby improving the\nfairness of DNN-powered software. By means of this procedure, Ballot improves\nthe fairness of pruning by 38.00%, 33.91%, 17.96%, and 35.82% compared to\nstate-of-the-art baselines, namely Magnitude Pruning, Standard LTH,\nSafeCompress, and FairScratch respectively, based on our evaluation of five\npopular datasets and three widely used models. Our code is available at\nhttps://anonymous.4open.science/r/Ballot-506E.", "paper_summary_zh": "隨著軟體 3.0 時代的來臨，將大型模型壓縮並整合到軟體系統中的趨勢日益盛行，對社會產生重大影響。遺憾的是，在許多情況下，模型壓縮技術會影響這些模型的公平性表現，進而影響 DNN 驅動軟體的道德行為。最著名的範例之一是樂透假說 (LTH)，一種盛行的模型修剪方法。本文證明，基於 LTH 的修剪的公平性問題源自於其子網路選擇和訓練程序，突顯現有補救措施的不足。為了解決這個問題，我們提出一個創新的修剪架構 Ballot，它採用一種基於衝突偵測的子網路選擇來尋找準確且公平的子網路，並結合精緻的訓練流程來獲得高性能模型，從而改善 DNN 驅動軟體的公平性。透過這個程序，與目前最先進的基準（分別為 Magnitude Pruning、Standard LTH、SafeCompress 和 FairScratch）相比，Ballot 將修剪的公平性提升了 38.00%、33.91%、17.96% 和 35.82%，根據我們對五個熱門資料集和三個廣泛使用的模型的評估。我們的程式碼可在 https://anonymous.4open.science/r/Ballot-506E 取得。", "author": "Xuanqi Gao et.al.", "authors": "Xuanqi Gao, Weipeng Jiang, Juan Zhai, Shiqing Ma, Xiaoyu Zhang, Chao Shen", "id": "2407.02805v1", "paper_url": "http://arxiv.org/abs/2407.02805v1", "repo": "null"}}