{"2406.14267": {"publish_time": "2024-06-20", "title": "On the Evaluation Practices in Multilingual NLP: Can Machine Translation Offer an Alternative to Human Translations?", "paper_summary": "While multilingual language models (MLMs) have been trained on 100+\nlanguages, they are typically only evaluated across a handful of them due to a\nlack of available test data in most languages. This is particularly problematic\nwhen assessing MLM's potential for low-resource and unseen languages. In this\npaper, we present an analysis of existing evaluation frameworks in multilingual\nNLP, discuss their limitations, and propose several directions for more robust\nand reliable evaluation practices. Furthermore, we empirically study to what\nextent machine translation offers a {reliable alternative to human translation}\nfor large-scale evaluation of MLMs across a wide set of languages. We use a\nSOTA translation model to translate test data from 4 tasks to 198 languages and\nuse them to evaluate three MLMs. We show that while the selected subsets of\nhigh-resource test languages are generally sufficiently representative of a\nwider range of high-resource languages, we tend to overestimate MLMs' ability\non low-resource languages. Finally, we show that simpler baselines can achieve\nrelatively strong performance without having benefited from large-scale\nmultilingual pretraining.", "paper_summary_zh": "儘管多國語言模型 (MLM) 已針對 100 多種語言進行訓練，但由於大多數語言缺乏可用的測試資料，因此通常僅在少數語言中進行評估。在評估 MLM 對低資源和未知語言的潛力時，這尤其成問題。在本文中，我們分析了多國語言 NLP 中現有的評估架構，討論其限制，並提出多項方針以獲得更穩健且可靠的評估實務。此外，我們實證研究機器翻譯在多大程度上提供了一個 {可靠的人工翻譯替代方案}，用於跨廣泛語言集對 MLM 進行大規模評估。我們使用 SOTA 翻譯模型將 4 個任務的測試資料翻譯成 198 種語言，並使用它們來評估三個 MLM。我們表明，儘管所選的高資源測試語言子集通常足以代表更廣泛的高資源語言，但我們往往會高估 MLM 對低資源語言的能力。最後，我們表明，較簡單的基準線可以在沒有受益於大規模多國語言預訓練的情況下，獲得相對強大的效能。", "author": "Rochelle Choenni et.al.", "authors": "Rochelle Choenni, Sara Rajaee, Christof Monz, Ekaterina Shutova", "id": "2406.14267v1", "paper_url": "http://arxiv.org/abs/2406.14267v1", "repo": "null"}}