{"2410.08208": {"publish_time": "2024-10-10", "title": "SPA: 3D Spatial-Awareness Enables Effective Embodied Representation", "paper_summary": "In this paper, we introduce SPA, a novel representation learning framework\nthat emphasizes the importance of 3D spatial awareness in embodied AI. Our\napproach leverages differentiable neural rendering on multi-view images to\nendow a vanilla Vision Transformer (ViT) with intrinsic spatial understanding.\nWe present the most comprehensive evaluation of embodied representation\nlearning to date, covering 268 tasks across 8 simulators with diverse policies\nin both single-task and language-conditioned multi-task scenarios. The results\nare compelling: SPA consistently outperforms more than 10 state-of-the-art\nrepresentation methods, including those specifically designed for embodied AI,\nvision-centric tasks, and multi-modal applications, while using less training\ndata. Furthermore, we conduct a series of real-world experiments to confirm its\neffectiveness in practical scenarios. These results highlight the critical role\nof 3D spatial awareness for embodied representation learning. Our strongest\nmodel takes more than 6000 GPU hours to train and we are committed to\nopen-sourcing all code and model weights to foster future research in embodied\nrepresentation learning. Project Page: https://haoyizhu.github.io/spa/.", "paper_summary_zh": "<paragraph>在本文中，我們介紹 SPA，一種新穎的表徵學習框架，強調了 3D 空間感知在具身 AI 中的重要性。我們的做法利用多視圖影像上的可微分神經渲染，賦予 vanilla 視覺 Transformer (ViT) 內在的空間理解。我們展示了迄今為止最全面的具身表徵學習評估，涵蓋了 8 個模擬器中的 268 個任務，在單一任務和語言條件的多任務場景中採用不同的策略。結果令人信服：SPA 持續優於 10 種以上的最新表徵方法，包括專門為具身 AI、以視覺為中心的任務和多模態應用程式設計的方法，同時使用較少的訓練資料。此外，我們進行了一系列真實世界的實驗，以確認其在實際場景中的有效性。這些結果突出了 3D 空間感知對於具身表徵學習的關鍵作用。我們最強大的模型需要超過 6000 個 GPU 小時才能訓練，我們致力於開放原始碼和所有模型權重，以促進具身表徵學習的未來研究。專案頁面：https://haoyizhu.github.io/spa/。</paragraph>", "author": "Haoyi Zhu et.al.", "authors": "Haoyi Zhu, Honghui Yang, Yating Wang, Jiange Yang, Limin Wang, Tong He", "id": "2410.08208v1", "paper_url": "http://arxiv.org/abs/2410.08208v1", "repo": "null"}}