{"2411.15831": {"publish_time": "2024-11-24", "title": "Efficient and Private: Memorisation under differentially private parameter-efficient fine-tuning in language models", "paper_summary": "Fine-tuning large language models (LLMs) for specific tasks introduces\nprivacy risks, as models may inadvertently memorise and leak sensitive training\ndata. While Differential Privacy (DP) offers a solution to mitigate these\nrisks, it introduces significant computational and performance trade-offs,\nparticularly with standard fine-tuning approaches. Previous work has primarily\nfocused on full-parameter updates, which are computationally intensive and may\nnot fully leverage DPs potential in large models. In this work, we address\nthese shortcomings by investigating Parameter-Efficient Fine-Tuning (PEFT)\nmethods under DP constraints. We show that PEFT methods achieve comparable\nperformance to standard fine-tuning while requiring fewer parameters and\nsignificantly reducing privacy leakage. Furthermore, we incorporate a data\npoisoning experiment involving intentional mislabelling to assess model\nmemorisation and directly measure privacy risks. Our findings indicate that\nPEFT methods not only provide a promising alternative but also serve as a\ncomplementary approach for privacy-preserving, resource-efficient fine-tuning\nof LLMs.", "paper_summary_zh": "微調大型語言模型 (LLM) 以應對特定任務時會引發隱私風險，因為模型可能會無意間記憶並洩露敏感的訓練資料。雖然差分隱私 (DP) 提供了解決這些風險的方法，但它會造成顯著的運算和效能取捨，特別是採用標準微調方法時。先前的研究主要集中於全參數更新，這在運算上很密集，而且可能無法充分發揮大型模型中 DP 的潛力。在這項研究中，我們透過研究 DP 約束下的參數有效微調 (PEFT) 方法來解決這些缺點。我們顯示 PEFT 方法可達成與標準微調相當的效能，同時所需參數較少，並大幅降低隱私外洩。此外，我們納入一項資料中毒實驗，其中涉及故意錯誤標籤，以評估模型記憶並直接衡量隱私風險。我們的研究結果顯示，PEFT 方法不僅提供了一個有希望的替代方案，也作為一種補充方法，用於 LLM 的隱私保護、資源有效微調。", "author": "Olivia Ma et.al.", "authors": "Olivia Ma, Jonathan Passerat-Palmbach, Dmitrii Usynin", "id": "2411.15831v1", "paper_url": "http://arxiv.org/abs/2411.15831v1", "repo": "null"}}