{"2405.11739": {"publish_time": "2024-05-20", "title": "Contactless Polysomnography: What Radio Waves Tell Us about Sleep", "paper_summary": "The ability to assess sleep at home, capture sleep stages, and detect the\noccurrence of apnea (without on-body sensors) simply by analyzing the radio\nwaves bouncing off people's bodies while they sleep is quite powerful. Such a\ncapability would allow for longitudinal data collection in patients' homes,\ninforming our understanding of sleep and its interaction with various diseases\nand their therapeutic responses, both in clinical trials and routine care. In\nthis article, we develop an advanced machine learning algorithm for passively\nmonitoring sleep and nocturnal breathing from radio waves reflected off people\nwhile asleep. Validation results in comparison with the gold standard (i.e.,\npolysomnography) (n=849) demonstrate that the model captures the sleep\nhypnogram (with an accuracy of 81% for 30-second epochs categorized into Wake,\nLight Sleep, Deep Sleep, or REM), detects sleep apnea (AUROC = 0.88), and\nmeasures the patient's Apnea-Hypopnea Index (ICC=0.95; 95% CI = [0.93, 0.97]).\nNotably, the model exhibits equitable performance across race, sex, and age.\nMoreover, the model uncovers informative interactions between sleep stages and\na range of diseases including neurological, psychiatric, cardiovascular, and\nimmunological disorders. These findings not only hold promise for clinical\npractice and interventional trials but also underscore the significance of\nsleep as a fundamental component in understanding and managing various\ndiseases.", "paper_summary_zh": "<paragraph>僅透過分析人們睡覺時從身體反射的無線電波，就能評估居家睡眠、捕捉睡眠階段並偵測呼吸中止（無需配戴身體感測器）的能力非常強大。這種能力能讓患者在家中進行縱向資料收集，有助於我們了解睡眠及其與各種疾病的交互作用，以及在臨床試驗和例行照護中的治療反應。在本文中，我們開發了一種先進的機器學習演算法，可被動監控人們睡覺時從身體反射的無線電波中的睡眠和夜間呼吸。與黃金標準（即多重睡眠生理檢查）（n=849）相比的驗證結果顯示，該模型捕捉到了睡眠腦波圖（30 秒時間區段分類為清醒、淺眠、深眠或快速動眼期，準確度為 81%），可偵測睡眠呼吸中止（AUROC = 0.88），並測量患者的呼吸中止低通氣指數（ICC=0.95；95% CI = [0.93, 0.97]）。值得注意的是，該模型在種族、性別和年齡上表現出公平的效能。此外，該模型揭示了睡眠階段與神經、精神、心血管和免疫疾病等一系列疾病之間的資訊性交互作用。這些發現不僅對臨床實務和介入試驗有望，也強調了睡眠作為理解和管理各種疾病的基本組成部分的重要性。</paragraph>", "author": "Hao He et.al.", "authors": "Hao He, Chao Li, Wolfgang Ganglberger, Kaileigh Gallagher, Rumen Hristov, Michail Ouroutzoglou, Haoqi Sun, Jimeng Sun, Brandon Westover, Dina Katabi", "id": "2405.11739v1", "paper_url": "http://arxiv.org/abs/2405.11739v1", "repo": "null"}}