{"2501.08418": {"publish_time": "2025-01-14", "title": "CVaR-Based Variational Quantum Optimization for User Association in Handoff-Aware Vehicular Networks", "paper_summary": "Efficient resource allocation is essential for optimizing various tasks in\nwireless networks, which are usually formulated as generalized assignment\nproblems (GAP). GAP, as a generalized version of the linear sum assignment\nproblem, involves both equality and inequality constraints that add\ncomputational challenges. In this work, we present a novel Conditional Value at\nRisk (CVaR)-based Variational Quantum Eigensolver (VQE) framework to address\nGAP in vehicular networks (VNets). Our approach leverages a hybrid\nquantum-classical structure, integrating a tailored cost function that balances\nboth objective and constraint-specific penalties to improve solution quality\nand stability. Using the CVaR-VQE model, we handle the GAP efficiently by\nfocusing optimization on the lower tail of the solution space, enhancing both\nconvergence and resilience on noisy intermediate-scale quantum (NISQ) devices.\nWe apply this framework to a user-association problem in VNets, where our\nmethod achieves 23.5% improvement compared to the deep neural network (DNN)\napproach.", "paper_summary_zh": "有效資源配置對於優化無線網路中的各種任務至關重要，這些任務通常被制定為廣義分配問題 (GAP)。GAP 作為線性總和分配問題的廣義版本，涉及等式和不等式約束，增加了運算挑戰。在這項工作中，我們提出一個新的條件價值風險 (CVaR) 為基礎的變分量子本徵求解器 (VQE) 框架，以解決車輛網路 (VNet) 中的 GAP。我們的做法利用混合量子經典結構，整合一個量身訂做的成本函數，平衡目標和約束特定懲罰，以提高解的品質和穩定性。使用 CVaR-VQE 模型，我們透過將最佳化集中在解空間的下尾，有效地處理 GAP，增強在有雜訊的中間量級量子 (NISQ) 裝置上的收斂性和復原力。我們將此框架應用於 VNet 中的使用者關聯問題，我們的做法與深度神經網路 (DNN) 方法相比，獲得了 23.5% 的改進。", "author": "Zijiang Yan et.al.", "authors": "Zijiang Yan, Hao Zhou, Jianhua Pei, Aryan Kaushik, Hina Tabassum, Ping Wang", "id": "2501.08418v1", "paper_url": "http://arxiv.org/abs/2501.08418v1", "repo": "null"}}