{"2501.08655": {"publish_time": "2025-01-15", "title": "Application of Deep Reinforcement Learning to UAV Swarming for Ground Surveillance", "paper_summary": "This paper summarizes in depth the state of the art of aerial swarms,\ncovering both classical and new reinforcement-learning-based approaches for\ntheir management. Then, it proposes a hybrid AI system, integrating deep\nreinforcement learning in a multi-agent centralized swarm architecture. The\nproposed system is tailored to perform surveillance of a specific area,\nsearching and tracking ground targets, for security and law enforcement\napplications. The swarm is governed by a central swarm controller responsible\nfor distributing different search and tracking tasks among the cooperating\nUAVs. Each UAV agent is then controlled by a collection of cooperative\nsub-agents, whose behaviors have been trained using different deep\nreinforcement learning models, tailored for the different task types proposed\nby the swarm controller. More specifically, proximal policy optimization (PPO)\nalgorithms were used to train the agents' behavior. In addition, several\nmetrics to assess the performance of the swarm in this application were\ndefined. The results obtained through simulation show that our system searches\nthe operation area effectively, acquires the targets in a reasonable time, and\nis capable of tracking them continuously and consistently.", "paper_summary_zh": "本文深入总结了空中蜂群的最新技术，涵盖了用于管理空中蜂群的经典方法和新的基于强化学习的方法。然后，本文提出了一种混合人工智能系统，将深度强化学习整合到多智能体集中蜂群架构中。所提出的系统专门用于执行特定区域的监视、搜索和跟踪地面目标，以用于安全和执法应用。蜂群由一个中央蜂群控制器管理，负责在合作无人机之间分配不同的搜索和跟踪任务。然后，每个无人机代理由一组协作子代理控制，这些子代理的行为已使用不同的深度强化学习模型进行训练，这些模型针对蜂群控制器提出的不同任务类型量身定制。更具体地说，近端策略优化 (PPO) 算法用于训练代理行为。此外，还定义了几个指标来评估蜂群在此应用中的性能。通过仿真获得的结果表明，我们的系统有效地搜索了操作区域，在合理的时间内获取了目标，并且能够持续不断地跟踪目标。", "author": "Raúl Arranz et.al.", "authors": "Raúl Arranz, David Carramiñana, Gonzalo de Miguel, Juan A. Besada, Ana M. Bernardos", "id": "2501.08655v1", "paper_url": "http://arxiv.org/abs/2501.08655v1", "repo": "null"}}