{"2405.17381": {"publish_time": "2024-05-27", "title": "Various Lengths, Constant Speed: Efficient Language Modeling with Lightning Attention", "paper_summary": "We present Lightning Attention, the first linear attention implementation\nthat maintains a constant training speed for various sequence lengths under\nfixed memory consumption. Due to the issue with cumulative summation operations\n(cumsum), previous linear attention implementations cannot achieve their\ntheoretical advantage in a casual setting. However, this issue can be\neffectively solved by utilizing different attention calculation strategies to\ncompute the different parts of attention. Specifically, we split the attention\ncalculation into intra-blocks and inter-blocks and use conventional attention\ncomputation for intra-blocks and linear attention kernel tricks for\ninter-blocks. This eliminates the need for cumsum in the linear attention\ncalculation. Furthermore, a tiling technique is adopted through both forward\nand backward procedures to take full advantage of the GPU hardware. To enhance\naccuracy while preserving efficacy, we introduce TransNormerLLM (TNL), a new\narchitecture that is tailored to our lightning attention. We conduct rigorous\ntesting on standard and self-collected datasets with varying model sizes and\nsequence lengths. TNL is notably more efficient than other language models. In\naddition, benchmark results indicate that TNL performs on par with\nstate-of-the-art LLMs utilizing conventional transformer structures. The source\ncode is released at github.com/OpenNLPLab/TransnormerLLM.", "paper_summary_zh": "<paragraph>我們提出 Lightning Attention，這是第一個線性注意力實作，在固定記憶體消耗下，可維持各種序列長度的恆定訓練速度。由於累積總和運算 (cumsum) 的問題，先前的線性注意力實作無法在休閒設定中獲得理論優勢。然而，這個問題可以用不同的注意力計算策略來有效解決，以計算注意力的不同部分。具體來說，我們將注意力計算拆分為區塊內和區塊間，並對區塊內使用傳統的注意力計算，對區塊間使用線性注意力核技巧。這消除了線性注意力計算中對 cumsum 的需求。此外，在正向和反向程序中都採用平鋪技術，以充分利用 GPU 硬體。為了在保留效能的同時提升準確度，我們引入了 TransNormerLLM (TNL)，這是一種針對我們的 lightning attention 量身打造的新架構。我們對標準和自收集的資料集進行嚴格的測試，並採用不同的模型大小和序列長度。TNL 明顯比其他語言模型更有效率。此外，基準測試結果顯示，TNL 的效能與使用傳統Transformer結構的最新 LLM 相當。原始碼已發布在 github.com/OpenNLPLab/TransnormerLLM。</paragraph>", "author": "Zhen Qin et.al.", "authors": "Zhen Qin, Weigao Sun, Dong Li, Xuyang Shen, Weixuan Sun, Yiran Zhong", "id": "2405.17381v1", "paper_url": "http://arxiv.org/abs/2405.17381v1", "repo": "https://github.com/opennlplab/transnormerllm"}}