{"2411.09125": {"publish_time": "2024-11-14", "title": "DROJ: A Prompt-Driven Attack against Large Language Models", "paper_summary": "Large Language Models (LLMs) have demonstrated exceptional capabilities\nacross various natural language processing tasks. Due to their training on\ninternet-sourced datasets, LLMs can sometimes generate objectionable content,\nnecessitating extensive alignment with human feedback to avoid such outputs.\nDespite massive alignment efforts, LLMs remain susceptible to adversarial\njailbreak attacks, which usually are manipulated prompts designed to circumvent\nsafety mechanisms and elicit harmful responses. Here, we introduce a novel\napproach, Directed Rrepresentation Optimization Jailbreak (DROJ), which\noptimizes jailbreak prompts at the embedding level to shift the hidden\nrepresentations of harmful queries towards directions that are more likely to\nelicit affirmative responses from the model. Our evaluations on LLaMA-2-7b-chat\nmodel show that DROJ achieves a 100\\% keyword-based Attack Success Rate (ASR),\neffectively preventing direct refusals. However, the model occasionally\nproduces repetitive and non-informative responses. To mitigate this, we\nintroduce a helpfulness system prompt that enhances the utility of the model's\nresponses. Our code is available at\nhttps://github.com/Leon-Leyang/LLM-Safeguard.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種自然語言處理任務中展現出非凡的能力。由於在網際網路來源的資料集上進行訓練，LLM 有時會產生令人反感的內容，因此需要大量比對人類回饋，以避免此類輸出。儘管進行了大量比對工作，LLM 仍然容易受到對抗性越獄攻擊，這通常是為了規避安全機制和引發有害回應而設計的操縱提示。在此，我們介紹一種新方法，即定向表示最佳化越獄 (DROJ)，它在嵌入層最佳化越獄提示，以將有害查詢的隱藏表示轉移到更可能從模型引發肯定回應的方向。我們對 LLaMA-2-7b-chat 模型的評估顯示，DROJ 達到了 100% 基於關鍵字的攻擊成功率 (ASR)，有效防止直接拒絕。然而，該模型偶爾會產生重複且無意義的回應。為了減輕這個問題，我們引入了有助益的系統提示，以增強模型回應的效用。我們的程式碼可在 https://github.com/Leon-Leyang/LLM-Safeguard 取得。", "author": "Leyang Hu et.al.", "authors": "Leyang Hu, Boran Wang", "id": "2411.09125v1", "paper_url": "http://arxiv.org/abs/2411.09125v1", "repo": "https://github.com/leon-leyang/llm-safeguard"}}