{"2412.06559": {"publish_time": "2024-12-09", "title": "ProcessBench: Identifying Process Errors in Mathematical Reasoning", "paper_summary": "As language models regularly make mistakes when solving math problems,\nautomated identification of errors in the reasoning process becomes\nincreasingly significant for their scalable oversight. In this paper, we\nintroduce ProcessBench for measuring the ability to identify erroneous steps in\nmathematical reasoning. It consists of 3,400 test cases, primarily focused on\ncompetition- and Olympiad-level math problems. Each test case contains a\nstep-by-step solution with error location annotated by human experts. Models\nare required to identify the earliest step that contains an error, or conclude\nthat all steps are correct. We conduct extensive evaluation on ProcessBench,\ninvolving two types of models: process reward models (PRMs) and critic models,\nwhere for the latter we prompt general language models to critique each\nsolution step by step. We draw two main observations: (1) Existing PRMs\ntypically fail to generalize to more challenging math problems beyond GSM8K and\nMATH. They underperform both critic models (i.e., prompted general language\nmodels) and our own trained PRM that is straightforwardly fine-tuned on the\nPRM800K dataset. (2) The best open-source model, QwQ-32B-Preview, has\ndemonstrated the critique capability competitive with the proprietary model\nGPT-4o, despite that it still lags behind the reasoning-specialized o1-mini. We\nhope ProcessBench can foster future research in reasoning process assessment,\npaving the way toward scalable oversight of language models.", "paper_summary_zh": "由於語言模型在解決數學問題時經常犯錯，自動化識別推理過程中的錯誤對於其可擴充的監督變得越來越重要。在本文中，我們介紹了 ProcessBench，用於衡量識別數學推理中錯誤步驟的能力。它包含 3,400 個測試案例，主要集中於競賽和奧林匹克級別的數學問題。每個測試案例都包含一個分步解決方案，其中錯誤位置由人類專家註解。模型需要識別包含錯誤的最早步驟，或得出所有步驟都正確的結論。我們對 ProcessBench 進行了廣泛的評估，涉及兩種類型的模型：過程獎勵模型 (PRM) 和批評者模型，後者我們提示通用語言模型逐步驟批評每個解決步驟。我們得出兩個主要觀察結果：(1) 現有的 PRM 通常無法概括到 GSM8K 和 MATH 之外更具挑戰性的數學問題。它們的表現不如批評者模型（即提示的通用語言模型）和我們自己訓練的 PRM，該 PRM 在 PRM800K 數據集上進行了直接微調。(2) 最好的開源模型 QwQ-32B-Preview 已展示出與專有模型 GPT-4o 相當的批評能力，儘管它仍然落後於推理專用的 o1-mini。我們希望 ProcessBench 能夠促進未來在推理過程評估方面的研究，為語言模型的可擴充監督鋪平道路。", "author": "Chujie Zheng et.al.", "authors": "Chujie Zheng, Zhenru Zhang, Beichen Zhang, Runji Lin, Keming Lu, Bowen Yu, Dayiheng Liu, Jingren Zhou, Junyang Lin", "id": "2412.06559v1", "paper_url": "http://arxiv.org/abs/2412.06559v1", "repo": "null"}}