{"2407.09378": {"publish_time": "2024-07-12", "title": "Graph Neural Network Causal Explanation via Neural Causal Models", "paper_summary": "Graph neural network (GNN) explainers identify the important subgraph that\nensures the prediction for a given graph. Until now, almost all GNN explainers\nare based on association, which is prone to spurious correlations. We propose\n{\\name}, a GNN causal explainer via causal inference. Our explainer is based on\nthe observation that a graph often consists of a causal underlying subgraph.\n{\\name} includes three main steps: 1) It builds causal structure and the\ncorresponding structural causal model (SCM) for a graph, which enables the\ncause-effect calculation among nodes. 2) Directly calculating the cause-effect\nin real-world graphs is computationally challenging. It is then enlightened by\nthe recent neural causal model (NCM), a special type of SCM that is trainable,\nand design customized NCMs for GNNs. By training these GNN NCMs, the\ncause-effect can be easily calculated. 3) It uncovers the subgraph that\ncausally explains the GNN predictions via the optimized GNN-NCMs. Evaluation\nresults on multiple synthetic and real-world graphs validate that {\\name}\nsignificantly outperforms existing GNN explainers in exact groundtruth\nexplanation identification", "paper_summary_zh": "圖形神經網路（GNN）解釋器會找出重要的子圖，以確保對特定圖形的預測。迄今為止，幾乎所有的 GNN 解釋器都是基於關聯性，這容易產生虛假的關聯。我們提出 {\\name}，一種透過因果推論的 GNN 因果解釋器。我們的解釋器基於這樣的觀察：一個圖形通常包含一個因果基礎子圖。{\\name} 包含三個主要步驟：1) 它為圖形建立因果結構和對應的結構因果模型 (SCM)，這能計算節點之間的因果關係。2) 直接計算真實世界圖形中的因果關係在運算上具有挑戰性。它隨後受到近期可訓練的神經因果模型 (NCM) 的啟發，NCM 是一種特殊類型的 SCM，並為 GNN 設計自訂的 NCM。透過訓練這些 GNN NCM，可以輕鬆計算因果關係。3) 它透過最佳化的 GNN-NCM 揭示因果解釋 GNN 預測的子圖。在多個合成和真實世界圖形上的評估結果驗證了 {\\name} 在準確的真實解釋識別上顯著優於現有的 GNN 解釋器", "author": "Arman Behnam et.al.", "authors": "Arman Behnam, Binghui Wang", "id": "2407.09378v1", "paper_url": "http://arxiv.org/abs/2407.09378v1", "repo": "https://github.com/armanbehnam/cxgnn"}}