{"2408.10602": {"publish_time": "2024-08-20", "title": "MV-MOS: Multi-View Feature Fusion for 3D Moving Object Segmentation", "paper_summary": "Effectively summarizing dense 3D point cloud data and extracting motion\ninformation of moving objects (moving object segmentation, MOS) is crucial to\nautonomous driving and robotics applications. How to effectively utilize motion\nand semantic features and avoid information loss during 3D-to-2D projection is\nstill a key challenge. In this paper, we propose a novel multi-view MOS model\n(MV-MOS) by fusing motion-semantic features from different 2D representations\nof point clouds. To effectively exploit complementary information, the motion\nbranches of the proposed model combines motion features from both bird's eye\nview (BEV) and range view (RV) representations. In addition, a semantic branch\nis introduced to provide supplementary semantic features of moving objects.\nFinally, a Mamba module is utilized to fuse the semantic features with motion\nfeatures and provide effective guidance for the motion branches. We validated\nthe effectiveness of the proposed multi-branch fusion MOS framework via\ncomprehensive experiments, and our proposed model outperforms existing\nstate-of-the-art models on the SemanticKITTI benchmark.", "paper_summary_zh": "有效摘要密集 3D 點雲資料和萃取移動物體的動作資訊（移動物體分割，MOS）對於自動駕駛和機器人應用程式至關重要。如何有效利用動作和語意特徵，並在 3D 到 2D 投影期間避免資訊遺失，仍然是一項關鍵的挑戰。在本文中，我們提出一個新的多視圖 MOS 模型 (MV-MOS)，透過融合來自點雲不同 2D 表示的動作語意特徵。為了有效利用互補資訊，所提出模型的動作分支結合了來自鳥瞰圖 (BEV) 和範圍視圖 (RV) 表示的動作特徵。此外，還引入了一個語意分支來提供移動物體的補充語意特徵。最後，利用 Mamba 模組將語意特徵與動作特徵融合，並為動作分支提供有效的指導。我們透過全面的實驗驗證了所提出的多分支融合 MOS 架構的有效性，而我們提出的模型在 SemanticKITTI 基準測試中優於現有的最先進模型。", "author": "Jintao Cheng et.al.", "authors": "Jintao Cheng, Xingming Chen, Jinxin Liang, Xiaoyu Tang, Xieyuanli Chen, Dachuan Li", "id": "2408.10602v1", "paper_url": "http://arxiv.org/abs/2408.10602v1", "repo": "null"}}