{"2411.18203": {"publish_time": "2024-11-27", "title": "Critic-V: VLM Critics Help Catch VLM Errors in Multimodal Reasoning", "paper_summary": "Vision-language models~(VLMs) have shown remarkable advancements in\nmultimodal reasoning tasks. However, they still often generate inaccurate or\nirrelevant responses due to issues like hallucinated image understandings or\nunrefined reasoning paths. To address these challenges, we introduce Critic-V,\na novel framework inspired by the Actor-Critic paradigm to boost the reasoning\ncapability of VLMs. This framework decouples the reasoning process and critic\nprocess by integrating two independent components: the Reasoner, which\ngenerates reasoning paths based on visual and textual inputs, and the Critic,\nwhich provides constructive critique to refine these paths. In this approach,\nthe Reasoner generates reasoning responses according to text prompts, which can\nevolve iteratively as a policy based on feedback from the Critic. This\ninteraction process was theoretically driven by a reinforcement learning\nframework where the Critic offers natural language critiques instead of scalar\nrewards, enabling more nuanced feedback to boost the Reasoner's capability on\ncomplex reasoning tasks. The Critic model is trained using Direct Preference\nOptimization (DPO), leveraging a preference dataset of critiques ranked by\nRule-based Reward(RBR) to enhance its critic capabilities. Evaluation results\nshow that the Critic-V framework significantly outperforms existing methods,\nincluding GPT-4V, on 5 out of 8 benchmarks, especially regarding reasoning\naccuracy and efficiency. Combining a dynamic text-based policy for the Reasoner\nand constructive feedback from the preference-optimized Critic enables a more\nreliable and context-sensitive multimodal reasoning process. Our approach\nprovides a promising solution to enhance the reliability of VLMs, improving\ntheir performance in real-world reasoning-heavy multimodal applications such as\nautonomous driving and embodied intelligence.", "paper_summary_zh": "<paragraph>視覺語言模型 (VLM) 在多模態推理任務中展現出顯著的進步。然而，由於幻覺影像理解或未經提煉的推理路徑等問題，它們仍然經常產生不準確或不相關的回應。為了應對這些挑戰，我們引入了 Critic-V，這是一個受 Actor-Critic 典範啟發的新穎架構，用於提升 VLM 的推理能力。此架構透過整合兩個獨立的組件來解耦推理程序和批評程序：推理器，它根據視覺和文字輸入產生推理路徑，以及批評者，它提供建設性的批評來優化這些路徑。在此方法中，推理器根據文字提示產生推理回應，這些回應可以根據批評者的回饋作為政策反覆演進。此互動程序在理論上是由強化學習架構推動的，其中批評者提供自然語言批評，而不是標量獎勵，從而能夠提供更多細微的回饋，以提升推理器在複雜推理任務中的能力。批評者模型使用直接偏好最佳化 (DPO) 進行訓練，利用基於規則的獎勵 (RBR) 排名的批評偏好資料集來增強其批評能力。評估結果顯示，Critic-V 架構在 8 個基準中的 5 個基準上顯著優於現有方法，包括 GPT-4V，特別是在推理準確性和效率方面。結合推理器的動態基於文字的政策和偏好最佳化批評者的建設性回饋，可以實現更可靠且對情境敏感的多模態推理程序。我們的做法提供了一個有前途的解決方案，用於增強 VLM 的可靠性，改善它們在現實世界中以推理為主的多模態應用程式（例如自動駕駛和具身智能）中的性能。</paragraph>", "author": "Di Zhang et.al.", "authors": "Di Zhang, Jingdi Lei, Junxian Li, Xunzhi Wang, Yujie Liu, Zonglin Yang, Jiatong Li, Weida Wang, Suorong Yang, Jianbo Wu, Peng Ye, Wanli Ouyang, Dongzhan Zhou", "id": "2411.18203v1", "paper_url": "http://arxiv.org/abs/2411.18203v1", "repo": "null"}}