{"2406.14117": {"publish_time": "2024-06-20", "title": "An Investigation of Prompt Variations for Zero-shot LLM-based Rankers", "paper_summary": "We provide a systematic understanding of the impact of specific components\nand wordings used in prompts on the effectiveness of rankers based on zero-shot\nLarge Language Models (LLMs). Several zero-shot ranking methods based on LLMs\nhave recently been proposed. Among many aspects, methods differ across (1) the\nranking algorithm they implement, e.g., pointwise vs. listwise, (2) the\nbackbone LLMs used, e.g., GPT3.5 vs. FLAN-T5, (3) the components and wording\nused in prompts, e.g., the use or not of role-definition (role-playing) and the\nactual words used to express this. It is currently unclear whether performance\ndifferences are due to the underlying ranking algorithm, or because of spurious\nfactors such as better choice of words used in prompts. This confusion risks to\nundermine future research. Through our large-scale experimentation and\nanalysis, we find that ranking algorithms do contribute to differences between\nmethods for zero-shot LLM ranking. However, so do the LLM backbones -- but even\nmore importantly, the choice of prompt components and wordings affect the\nranking. In fact, in our experiments, we find that, at times, these latter\nelements have more impact on the ranker's effectiveness than the actual ranking\nalgorithms, and that differences among ranking methods become more blurred when\nprompt variations are considered.", "paper_summary_zh": "我們系統性地了解了提示中使用的特定組件和措辭對基於零次學習大型語言模型 (LLM) 的排名器的有效性的影響。最近已經提出了幾種基於 LLM 的零次學習排名方法。在許多方面，方法因 (1) 它們實作的排名演算法而異，例如逐點對比清單，(2) 使用的骨幹 LLM，例如 GPT3.5 對比 FLAN-T5，(3) 提示中使用的組件和措辭，例如是否使用角色定義 (角色扮演) 以及用於表達此角色定義的實際字詞。目前尚不清楚效能差異是歸因於基礎排名演算法，還是因為提示中使用的字詞選擇較佳等虛假因素。這種混淆有損害未來研究的風險。透過我們的大規模實驗和分析，我們發現排名演算法確實會造成零次學習 LLM 排名的不同方法之間的差異。然而，LLM 骨幹也是如此，但更重要的是，提示組件和措辭的選擇會影響排名。事實上，在我們的實驗中，我們發現後者有時對排名器的有效性影響大於實際排名演算法，並且當考慮提示變異時，排名方法之間的差異會變得更加模糊。", "author": "Shuoqi Sun et.al.", "authors": "Shuoqi Sun, Shengyao Zhuang, Shuai Wang, Guido Zuccon", "id": "2406.14117v1", "paper_url": "http://arxiv.org/abs/2406.14117v1", "repo": "null"}}