{"2407.04371": {"publish_time": "2024-07-05", "title": "Exploiting the equivalence between quantum neural networks and perceptrons", "paper_summary": "Quantum machine learning models based on parametrized quantum circuits, also\ncalled quantum neural networks (QNNs), are considered to be among the most\npromising candidates for applications on near-term quantum devices. Here we\nexplore the expressivity and inductive bias of QNNs by exploiting an exact\nmapping from QNNs with inputs $x$ to classical perceptrons acting on $x \\otimes\nx$ (generalised to complex inputs). The simplicity of the perceptron\narchitecture allows us to provide clear examples of the shortcomings of current\nQNN models, and the many barriers they face to becoming useful general-purpose\nlearning algorithms. For example, a QNN with amplitude encoding cannot express\nthe Boolean parity function for $n\\geq 3$, which is but one of an exponential\nnumber of data structures that such a QNN is unable to express. Mapping a QNN\nto a classical perceptron simplifies training, allowing us to systematically\nstudy the inductive biases of other, more expressive embeddings on Boolean\ndata. Several popular embeddings primarily produce an inductive bias towards\nfunctions with low class balance, reducing their generalisation performance\ncompared to deep neural network architectures which exhibit much richer\ninductive biases. We explore two alternate strategies that move beyond standard\nQNNs. In the first, we use a QNN to help generate a classical DNN-inspired\nkernel. In the second we draw an analogy to the hierarchical structure of deep\nneural networks and construct a layered non-linear QNN that is provably fully\nexpressive on Boolean data, while also exhibiting a richer inductive bias than\nsimple QNNs. Finally, we discuss characteristics of the QNN literature that may\nobscure how hard it is to achieve quantum advantage over deep learning\nalgorithms on classical data.", "paper_summary_zh": "<paragraph>基於參數化量子電路，也稱為量子神經網路 (QNN) 的量子機器學習模型，被認為是近期量子裝置應用中最有前途的候選者之一。在此，我們透過利用從輸入 $x$ 的 QNN 到作用於 $x \\otimes x$ 的經典感知器的精確對應（推廣到複數輸入），來探討 QNN 的表達能力和歸納偏誤。感知器架構的簡潔性使我們能夠提供當前 QNN 模型缺點的明確範例，以及它們成為有用的通用學習演算法所面臨的許多障礙。例如，具有振幅編碼的 QNN 無法表達 $n\\geq 3$ 的布林同位函數，而這只是此類 QNN 無法表達的指數級別資料結構之一。將 QNN 對應到經典感知器簡化了訓練，使我們能夠系統性地研究布林資料上其他更具表達力的嵌入的歸納偏誤。幾個廣受歡迎的嵌入主要產生對類別平衡低的功能的歸納偏誤，與表現出更豐富歸納偏誤的深度神經網路架構相比，降低了它們的泛化效能。我們探索了超越標準 QNN 的兩種替代策略。在第一個策略中，我們使用 QNN 來幫助產生經典 DNN 啟發的核。在第二個策略中，我們將類比於深度神經網路的階層結構，並建構一個分層非線性 QNN，它在布林資料上已被證明具有完全的表達能力，同時也表現出比簡單 QNN 更豐富的歸納偏誤。最後，我們討論了 QNN 文獻的特徵，這些特徵可能會模糊在經典資料上實現量子優勢優於深度學習演算法的難度。</paragraph>", "author": "Chris Mingard et.al.", "authors": "Chris Mingard, Jessica Pointing, Charles London, Yoonsoo Nam, Ard A. Louis", "id": "2407.04371v1", "paper_url": "http://arxiv.org/abs/2407.04371v1", "repo": "null"}}