{"2408.04692": {"publish_time": "2024-08-08", "title": "Exploring Scalability in Large-Scale Time Series in DeepVATS framework", "paper_summary": "Visual analytics is essential for studying large time series due to its\nability to reveal trends, anomalies, and insights. DeepVATS is a tool that\nmerges Deep Learning (Deep) with Visual Analytics (VA) for the analysis of\nlarge time series data (TS). It has three interconnected modules. The Deep\nLearning module, developed in R, manages the load of datasets and Deep Learning\nmodels from and to the Storage module. This module also supports models\ntraining and the acquisition of the embeddings from the latent space of the\ntrained model. The Storage module operates using the Weights and Biases system.\nSubsequently, these embeddings can be analyzed in the Visual Analytics module.\nThis module, based on an R Shiny application, allows the adjustment of the\nparameters related to the projection and clustering of the embeddings space.\nOnce these parameters are set, interactive plots representing both the\nembeddings, and the time series are shown. This paper introduces the tool and\nexamines its scalability through log analytics. The execution time evolution is\nexamined while the length of the time series is varied. This is achieved by\nresampling a large data series into smaller subsets and logging the main\nexecution and rendering times for later analysis of scalability.", "paper_summary_zh": "視覺分析對於研究大型時間序列至關重要，因為它能夠揭示趨勢、異常和見解。DeepVATS 是一個將深度學習 (Deep) 與視覺分析 (VA) 合併用於分析大型時間序列資料 (TS) 的工具。它有三個相互連接的模組。在 R 中開發的深度學習模組管理資料集和深度學習模型從儲存模組到儲存模組。此模組還支援模型訓練和從訓練模型的潛在空間中擷取嵌入。儲存模組使用權重和偏差系統運作。隨後，可以在視覺分析模組中分析這些嵌入。此模組基於 R Shiny 應用程式，允許調整與嵌入空間的投影和叢集相關的參數。設定這些參數後，會顯示同時表示嵌入和時間序列的互動式圖表。本文介紹該工具，並透過日誌分析探討其可擴充性。在時間序列長度不同的情況下，會檢查執行時間演進。這是透過將大型資料序列重新取樣為較小的子集，並記錄主要執行和渲染時間以供稍後分析可擴充性來實現的。", "author": "Inmaculada Santamaria-Valenzuela et.al.", "authors": "Inmaculada Santamaria-Valenzuela, Victor Rodriguez-Fernandez, David Camacho", "id": "2408.04692v1", "paper_url": "http://arxiv.org/abs/2408.04692v1", "repo": "https://github.com/vrodriguezf/deepvats"}}