{"2410.17736": {"publish_time": "2024-10-23", "title": "MojoBench: Language Modeling and Benchmarks for Mojo", "paper_summary": "The recently introduced Mojo programming language (PL) by Modular, has\nreceived significant attention in the scientific community due to its claimed\nsignificant speed boost over Python. Despite advancements in code Large\nLanguage Models (LLMs) across various PLs, Mojo remains unexplored in this\ncontext. To address this gap, we introduce MojoBench, the first framework for\nMojo code generation. MojoBench includes HumanEval-Mojo, a benchmark dataset\ndesigned for evaluating code LLMs on Mojo, and Mojo-Coder, the first LLM\npretrained and finetuned for Mojo code generation, which supports instructions\nin 5 natural languages (NLs). Our results show that Mojo-Coder achieves a\n30-35% performance improvement over leading models like GPT-4o and\nClaude-3.5-Sonnet. Furthermore, we provide insights into LLM behavior with\nunderrepresented and unseen PLs, offering potential strategies for enhancing\nmodel adaptability. MojoBench contributes to our understanding of LLM\ncapabilities and limitations in emerging programming paradigms fostering more\nrobust code generation systems.", "paper_summary_zh": "最近由 Modular 推出的 Mojo 程式語言 (PL) 由於聲稱比 Python 有顯著的加速提升，因此在科學界備受關注。儘管各種 PL 的程式碼大型語言模型 (LLM) 已有進展，但 Mojo 在這個背景下仍未被探索。為了解決這個差距，我們推出了 MojoBench，這是第一個用於 Mojo 程式碼生成的架構。MojoBench 包含 HumanEval-Mojo，這是一個基準資料集，用於評估 Mojo 上的程式碼 LLM，以及 Mojo-Coder，這是第一個針對 Mojo 程式碼生成進行預訓練和微調的 LLM，它支援 5 種自然語言 (NL) 的指令。我們的結果顯示，Mojo-Coder 比 GPT-4o 和 Claude-3.5-Sonnet 等領先模型的效能提升了 30-35%。此外，我們提供了 LLM 行為的見解，包括代表性不足和未見過的 PL，提供了增強模型適應性的潛在策略。MojoBench 有助於我們了解 LLM 在新興程式設計範例中的能力和限制，從而促進更強大的程式碼生成系統。", "author": "Nishat Raihan et.al.", "authors": "Nishat Raihan, Joanna C. S. Santos, Marcos Zampieri", "id": "2410.17736v1", "paper_url": "http://arxiv.org/abs/2410.17736v1", "repo": "null"}}