{"2410.19715": {"publish_time": "2024-10-25", "title": "Adversarial Environment Design via Regret-Guided Diffusion Models", "paper_summary": "Training agents that are robust to environmental changes remains a\nsignificant challenge in deep reinforcement learning (RL). Unsupervised\nenvironment design (UED) has recently emerged to address this issue by\ngenerating a set of training environments tailored to the agent's capabilities.\nWhile prior works demonstrate that UED has the potential to learn a robust\npolicy, their performance is constrained by the capabilities of the environment\ngeneration. To this end, we propose a novel UED algorithm, adversarial\nenvironment design via regret-guided diffusion models (ADD). The proposed\nmethod guides the diffusion-based environment generator with the regret of the\nagent to produce environments that the agent finds challenging but conducive to\nfurther improvement. By exploiting the representation power of diffusion\nmodels, ADD can directly generate adversarial environments while maintaining\nthe diversity of training environments, enabling the agent to effectively learn\na robust policy. Our experimental results demonstrate that the proposed method\nsuccessfully generates an instructive curriculum of environments, outperforming\nUED baselines in zero-shot generalization across novel, out-of-distribution\nenvironments. Project page: https://github.com/rllab-snu.github.io/projects/ADD", "paper_summary_zh": "在深度强化學習 (RL) 中，訓練出對環境變化具有魯棒性的代理仍然是一項重大挑戰。無監督環境設計 (UED) 最近興起，透過產生一套針對代理能力量身打造的訓練環境來解決此問題。雖然先前的研究表明 UED 有可能學習到穩健的策略，但其效能受到環境產生能力的限制。為此，我們提出了一種新穎的 UED 演算法，透過後悔引導擴散模型 (ADD) 進行對抗性環境設計。所提出的方法以代理的後悔為指導，引導基於擴散的環境產生器，產生代理覺得具有挑戰性但有助於進一步改進的環境。透過利用擴散模型的表示能力，ADD 可以直接產生對抗性環境，同時維持訓練環境的多樣性，使代理能夠有效地學習穩健的策略。我們的實驗結果表明，所提出的方法成功地產生了一套具有指導性的環境課程，在對新穎的、分布外環境進行零次學習泛化方面優於 UED 基準。專案頁面：https://github.com/rllab-snu.github.io/projects/ADD", "author": "Hojun Chung et.al.", "authors": "Hojun Chung, Junseo Lee, Minsoo Kim, Dohyeong Kim, Songhwai Oh", "id": "2410.19715v1", "paper_url": "http://arxiv.org/abs/2410.19715v1", "repo": "null"}}