{"2412.04726": {"publish_time": "2024-12-06", "title": "BESSTIE: A Benchmark for Sentiment and Sarcasm Classification for Varieties of English", "paper_summary": "Despite large language models (LLMs) being known to exhibit bias against\nnon-mainstream varieties, there are no known labeled datasets for sentiment\nanalysis of English. To address this gap, we introduce BESSTIE, a benchmark for\nsentiment and sarcasm classification for three varieties of English: Australian\n(en-AU), Indian (en-IN), and British (en-UK). Using web-based content from two\ndomains, namely, Google Place reviews and Reddit comments, we collect datasets\nfor these language varieties using two methods: location-based and topic-based\nfiltering. Native speakers of the language varieties manually annotate the\ndatasets with sentiment and sarcasm labels. Subsequently, we fine-tune nine\nlarge language models (LLMs) (representing a range of encoder/decoder and\nmono/multilingual models) on these datasets, and evaluate their performance on\nthe two tasks. Our results reveal that the models consistently perform better\non inner-circle varieties (i.e., en-AU and en-UK), with significant performance\ndrops for en-IN, particularly in sarcasm detection. We also report challenges\nin cross-variety generalisation, highlighting the need for language\nvariety-specific datasets such as ours. BESSTIE promises to be a useful\nevaluative benchmark for future research in equitable LLMs, specifically in\nterms of language varieties. The BESSTIE datasets, code, and models are\ncurrently available on request, while the paper is under review. Please email\naditya.joshi@unsw.edu.au.", "paper_summary_zh": "儘管大型語言模型 (LLM) 已知會對非主流變體表現出偏見，但目前沒有已知的標籤資料集可供分析英語的情感。為了解決此差距，我們引入了 BESSTIE，這是一個針對三種英語變體（澳洲英語 (en-AU)、印度英語 (en-IN) 和英國英語 (en-UK)）的情感和諷刺分類基準。我們使用來自兩個網域（即 Google 地點評論和 Reddit 留言）的網路內容，使用兩種方法（基於位置和基於主題的篩選）收集這些語言變體的資料集。這些語言變體的母語人士會手動註解資料集，並加上情感和諷刺標籤。隨後，我們針對這些資料集微調了九個大型語言模型 (LLM)（代表一系列編碼器/解碼器和單語/多語模型），並評估它們在兩個任務中的表現。我們的結果顯示，這些模型在內圈變體（即 en-AU 和 en-UK）上的表現始終較好，而 en-IN 的表現顯著下降，特別是在諷刺偵測方面。我們也報告了跨變體概括的挑戰，強調了對像我們這樣的語言變體特定資料集的需求。BESSTIE 承諾成為未來在公平 LLM 中進行研究的有用評估基準，特別是在語言變體方面。BESSTIE 資料集、程式碼和模型目前可應要求取得，而論文則正在審查中。請寄電子郵件至 aditya.joshi@unsw.edu.au。", "author": "Dipankar Srirag et.al.", "authors": "Dipankar Srirag, Aditya Joshi, Jordan Painter, Diptesh Kanojia", "id": "2412.04726v1", "paper_url": "http://arxiv.org/abs/2412.04726v1", "repo": "null"}}