{"2408.14137": {"publish_time": "2024-08-26", "title": "Multi-Faceted Evaluation of Modeling Languages for Augmented Reality Applications -- The Case of ARWFML", "paper_summary": "The evaluation of modeling languages for augmented reality applications poses\nparticular challenges due to the three-dimensional environment they target. The\npreviously introduced Augmented Reality Workflow Modeling Language (ARWFML)\nenables the model-based creation of augmented reality scenarios without\nprogramming knowledge. Building upon the first design cycle of the language's\nspecification, this paper presents two further design iterations for refining\nthe language based on multi-faceted evaluations. These include a comparative\nevaluation of implementation options and workflow capabilities, the\nintroduction of a 3D notation, and the development of a new 3D modeling\nenvironment. On this basis, a comprehensibility study of the language was\nconducted. Thereby, we show how modeling languages for augmented reality can be\nevolved towards a maturity level suitable for empirical evaluations.", "paper_summary_zh": "由於擴增實境應用程式鎖定的三維環境，對建模語言的評估構成了特殊的挑戰。先前導入的擴增實境工作流程建模語言 (ARWFML) 能讓沒有程式設計知識的人，以模型為基礎建立擴增實境場景。本文根據多面向的評估，在語言規範的第一個設計週期上建構，提出了兩個進一步的設計迭代，以精煉語言。這些評估包括實作選項和工作流程功能的比較評估、3D 標記的導入，以及新的 3D 建模環境的開發。在這個基礎上，進行了語言的可理解性研究。因此，我們展示了如何讓擴增實境建模語言演進到適合經驗評估的成熟度等級。", "author": "Fabian Muff et.al.", "authors": "Fabian Muff, Hans-Georg Fill", "id": "2408.14137v1", "paper_url": "http://arxiv.org/abs/2408.14137v1", "repo": "null"}}