{"2408.10239": {"publish_time": "2024-08-05", "title": "A Conceptual Framework for Ethical Evaluation of Machine Learning Systems", "paper_summary": "Research in Responsible AI has developed a range of principles and practices\nto ensure that machine learning systems are used in a manner that is ethical\nand aligned with human values. However, a critical yet often neglected aspect\nof ethical ML is the ethical implications that appear when designing\nevaluations of ML systems. For instance, teams may have to balance a trade-off\nbetween highly informative tests to ensure downstream product safety, with\npotential fairness harms inherent to the implemented testing procedures. We\nconceptualize ethics-related concerns in standard ML evaluation techniques.\nSpecifically, we present a utility framework, characterizing the key trade-off\nin ethical evaluation as balancing information gain against potential ethical\nharms. The framework is then a tool for characterizing challenges teams face,\nand systematically disentangling competing considerations that teams seek to\nbalance. Differentiating between different types of issues encountered in\nevaluation allows us to highlight best practices from analogous domains, such\nas clinical trials and automotive crash testing, which navigate these issues in\nways that can offer inspiration to improve evaluation processes in ML. Our\nanalysis underscores the critical need for development teams to deliberately\nassess and manage ethical complexities that arise during the evaluation of ML\nsystems, and for the industry to move towards designing institutional policies\nto support ethical evaluations.", "paper_summary_zh": "在負責任的人工智慧的研究中，已經發展出一系列的原則和實務，以確保機器學習系統的使用方式符合道德，且與人類價值觀一致。然而，一個重要的但經常被忽略的道德 ML 面向，是出現在設計 ML 系統評估時的道德意涵。例如，團隊可能必須在確保下游產品安全的極具參考價值的測試，與實施測試程序中潛在的公平性危害之間取得平衡。我們將標準 ML 評估技術中的道德相關疑慮概念化。具體來說，我們提出一個效用架構，將道德評估中的關鍵取捨描述為在資訊獲益與潛在道德危害之間取得平衡。然後，這個架構將成為描述團隊面臨的挑戰的工具，並系統性地解開團隊尋求平衡的相互競爭的考量。區分評估中遇到的不同類型的問題，讓我們能夠從類似的領域（例如臨床試驗和汽車碰撞測試）中找出最佳實務，這些領域以提供靈感的方式來解決這些問題，以改善 ML 中的評估程序。我們的分析強調了開發團隊在 ML 系統評估期間審慎評估和管理道德複雜性的關鍵需求，以及產業朝向設計制度政策以支援道德評估的趨勢。", "author": "Neha R. Gupta et.al.", "authors": "Neha R. Gupta, Jessica Hullman, Hari Subramonyam", "id": "2408.10239v1", "paper_url": "http://arxiv.org/abs/2408.10239v1", "repo": "null"}}