{"2501.08618": {"publish_time": "2025-01-15", "title": "Disjoint Processing Mechanisms of Hierarchical and Linear Grammars in Large Language Models", "paper_summary": "All natural languages are structured hierarchically. In humans, this\nstructural restriction is neurologically coded: when two grammars are presented\nwith identical vocabularies, brain areas responsible for language processing\nare only sensitive to hierarchical grammars. Using large language models\n(LLMs), we investigate whether such functionally distinct hierarchical\nprocessing regions can arise solely from exposure to large-scale language\ndistributions. We generate inputs using English, Italian, Japanese, or nonce\nwords, varying the underlying grammars to conform to either hierarchical or\nlinear/positional rules. Using these grammars, we first observe that language\nmodels show distinct behaviors on hierarchical versus linearly structured\ninputs. Then, we find that the components responsible for processing\nhierarchical grammars are distinct from those that process linear grammars; we\ncausally verify this in ablation experiments. Finally, we observe that\nhierarchy-selective components are also active on nonce grammars; this suggests\nthat hierarchy sensitivity is not tied to meaning, nor in-distribution inputs.", "paper_summary_zh": "所有自然語言都是層級結構的。在人類身上，這種結構限制是由神經編碼的：當兩個文法被賦予相同的詞彙時，負責語言處理的大腦區域只對層級文法敏感。使用大型語言模型 (LLM)，我們研究這種功能上不同的層級處理區域是否僅能從接觸大規模語言分佈中產生。我們使用英語、義大利語、日語或虛構詞彙產生輸入，改變基礎文法以符合層級或線性/位置規則。使用這些文法，我們首先觀察到語言模型在層級結構的輸入與線性結構的輸入上表現出不同的行為。接著，我們發現處理層級文法的組成部分與處理線性文法的組成部分不同；我們在消融實驗中因果驗證了這一點。最後，我們觀察到層級選擇性組成部分在虛構文法中也活躍；這表示層級敏感性與意義或分佈中的輸入無關。", "author": "Aruna Sankaranarayanan et.al.", "authors": "Aruna Sankaranarayanan, Dylan Hadfield-Menell, Aaron Mueller", "id": "2501.08618v1", "paper_url": "http://arxiv.org/abs/2501.08618v1", "repo": "https://github.com/arunasank/disjoint-processing-llms"}}