{"2504.05767": {"publish_time": "2025-04-08", "title": "Cross-Document Contextual Coreference Resolution in Knowledge Graphs", "paper_summary": "Coreference resolution across multiple documents poses a significant\nchallenge in natural language processing, particularly within the domain of\nknowledge graphs. This study introduces an innovative method aimed at\nidentifying and resolving references to the same entities that appear across\ndiffering texts, thus enhancing the coherence and collaboration of information.\nOur method employs a dynamic linking mechanism that associates entities in the\nknowledge graph with their corresponding textual mentions. By utilizing\ncontextual embeddings along with graph-based inference strategies, we\neffectively capture the relationships and interactions among entities, thereby\nimproving the accuracy of coreference resolution. Rigorous evaluations on\nvarious benchmark datasets highlight notable advancements in our approach over\ntraditional methodologies. The results showcase how the contextual information\nderived from knowledge graphs enhances the understanding of complex\nrelationships across documents, leading to better entity linking and\ninformation extraction capabilities in applications driven by knowledge. Our\ntechnique demonstrates substantial improvements in both precision and recall,\nunderscoring its effectiveness in the area of cross-document coreference\nresolution.", "paper_summary_zh": "<paragraph>跨多個文件的共指消解在自然語言處理中是一個巨大的挑戰，尤其是在知識圖譜領域。本研究介紹了一種創新的方法，旨在識別和解決不同文本中出現的同一實體的引用，從而增強資訊的連貫性和協作性。我們的方法採用了一種動態連結機制，將知識圖譜中的實體與其對應的文本提及關聯起來。通過利用上下文嵌入以及基於圖的推理策略，我們有效地捕捉實體之間的關係和交互，從而提高共指消解的準確性。在各種基準數據集上進行的嚴格評估突顯了我們的方法相較於傳統方法的顯著進步。結果表明，從知識圖譜中獲得的上下文資訊如何增強對跨文件複雜關係的理解，從而提升知識驅動應用程式中的實體連結和資訊提取能力。我們的技術在準確率和召回率方面都展現了顯著的改進，突顯了其在跨文件共指消解領域的有效性。</paragraph>\n", "author": "Zhang Dong et.al.", "authors": "Zhang Dong, Mingbang Wang, Songhang deng, Le Dai, Jiyuan Li, Xingzu Liu, Ruilin Nong", "id": "2504.05767v1", "paper_url": "http://arxiv.org/abs/2504.05767v1", "repo": "null"}}