{"2410.20817": {"publish_time": "2024-10-28", "title": "The Zeno's Paradox of `Low-Resource' Languages", "paper_summary": "The disparity in the languages commonly studied in Natural Language\nProcessing (NLP) is typically reflected by referring to languages as low vs\nhigh-resourced. However, there is limited consensus on what exactly qualifies\nas a `low-resource language.' To understand how NLP papers define and study\n`low resource' languages, we qualitatively analyzed 150 papers from the ACL\nAnthology and popular speech-processing conferences that mention the keyword\n`low-resource.' Based on our analysis, we show how several interacting axes\ncontribute to `low-resourcedness' of a language and why that makes it difficult\nto track progress for each individual language. We hope our work (1) elicits\nexplicit definitions of the terminology when it is used in papers and (2)\nprovides grounding for the different axes to consider when connoting a language\nas low-resource.", "paper_summary_zh": "在自然語言處理 (NLP) 中，常見研究語言的差異通常反映在語言被稱為低資源或高資源。然而，對於什麼才算是「低資源語言」的資格，並沒有明確的共識。為了了解 NLP 論文如何定義和研究「低資源」語言，我們從 ACL Anthology 和熱門語音處理研討會中，定性分析了 150 篇提到關鍵字「低資源」的論文。根據我們的分析，我們展示了幾個相互作用的軸線如何影響語言的「低資源性」，以及為什麼這使得難以追蹤每種個別語言的進度。我們希望我們的研究 (1) 引起明確定義術語的重視，當它用於論文中時，以及 (2) 提供不同軸線的基礎，以便在指稱語言為低資源時考慮。", "author": "Hellina Hailu Nigatu et.al.", "authors": "Hellina Hailu Nigatu, Atnafu Lambebo Tonja, Benjamin Rosman, Thamar Solorio, Monojit Choudhury", "id": "2410.20817v1", "paper_url": "http://arxiv.org/abs/2410.20817v1", "repo": "null"}}