{"2502.14768": {"publish_time": "2025-02-20", "title": "Logic-RL: Unleashing LLM Reasoning with Rule-Based Reinforcement Learning", "paper_summary": "Inspired by the success of DeepSeek-R1, we explore the potential of\nrule-based reinforcement learning (RL) in large reasoning models. To analyze\nreasoning dynamics, we use synthetic logic puzzles as training data due to\ntheir controllable complexity and straightforward answer verification. We make\nsome key technical contributions that lead to effective and stable RL training:\na system prompt that emphasizes the thinking and answering process, a stringent\nformat reward function that penalizes outputs for taking shortcuts, and a\nstraightforward training recipe that achieves stable convergence. Our 7B model\ndevelops advanced reasoning skills-such as reflection, verification, and\nsummarization-that are absent from the logic corpus. Remarkably, after training\non just 5K logic problems, it demonstrates generalization abilities to the\nchallenging math benchmarks AIME and AMC.", "paper_summary_zh": "在 DeepSeek-R1 成功案例的启发下，我们探索了基于规则的强化学习 (RL) 在大型推理模型中的潜力。为了分析推理动态，我们使用合成逻辑难题作为训练数据，因为它们的可控复杂性和直接的答案验证。我们做出了一些关键的技术贡献，这些贡献导致了有效且稳定的 RL 训练：一个强调思考和回答过程的系统提示、一个严格的格式奖励函数，用于惩罚采取捷径的输出，以及一个实现稳定收敛的直接训练配方。我们的 7B 模型发展了高级推理技能，例如反射、验证和总结，这些技能在逻辑语料库中是不存在的。值得注意的是，在仅对 5K 个逻辑问题进行训练后，它展示了对具有挑战性的数学基准 AIME 和 AMC 的泛化能力。", "author": "Tian Xie et.al.", "authors": "Tian Xie, Zitian Gao, Qingnan Ren, Haoming Luo, Yuqian Hong, Bryan Dai, Joey Zhou, Kai Qiu, Zhirong Wu, Chong Luo", "id": "2502.14768v1", "paper_url": "http://arxiv.org/abs/2502.14768v1", "repo": "null"}}