{"2405.14414": {"publish_time": "2024-05-23", "title": "Proving Theorems Recursively", "paper_summary": "Recent advances in automated theorem proving leverages language models to\nexplore expanded search spaces by step-by-step proof generation. However, such\napproaches are usually based on short-sighted heuristics (e.g., log probability\nor value function scores) that potentially lead to suboptimal or even\ndistracting subgoals, preventing us from finding longer proofs. To address this\nchallenge, we propose POETRY (PrOvE Theorems RecursivelY), which proves\ntheorems in a recursive, level-by-level manner in the Isabelle theorem prover.\nUnlike previous step-by-step methods, POETRY searches for a verifiable sketch\nof the proof at each level and focuses on solving the current level's theorem\nor conjecture. Detailed proofs of intermediate conjectures within the sketch\nare temporarily replaced by a placeholder tactic called sorry, deferring their\nproofs to subsequent levels. This approach allows the theorem to be tackled\nincrementally by outlining the overall theorem at the first level and then\nsolving the intermediate conjectures at deeper levels. Experiments are\nconducted on the miniF2F and PISA datasets and significant performance gains\nare observed in our POETRY approach over state-of-the-art methods. POETRY on\nminiF2F achieves an average proving success rate improvement of 5.1%. Moreover,\nwe observe a substantial increase in the maximum proof length found by POETRY,\nfrom 10 to 26.", "paper_summary_zh": "自動定理證明最近的進展利用語言模型，透過逐步證明產生來探索擴展的搜尋空間。然而，此類方法通常基於短視的啟發法（例如，對數機率或價值函數分數），可能會導致次佳甚至令人分心的次目標，讓我們無法找到更長的證明。為了應對此挑戰，我們提出 POETRY（遞迴證明定理），它在 Isabelle 定理證明器中以遞迴、逐層的方式證明定理。與先前的逐步方法不同，POETRY 在每個層級搜尋可驗證的證明草圖，並專注於解決當前層級的定理或猜想。草圖中中間猜想的詳細證明暫時由稱為 sorry 的佔位符策略取代，將其證明遞延到後續層級。此方法允許透過在第一層級概述整體定理，然後在更深層級解決中間猜想，以逐步解決定理。在 miniF2F 和 PISA 資料集上進行實驗，並觀察到我們的 POETRY 方法相較於最先進的方法有顯著的效能提升。POETRY 在 miniF2F 上達成平均證明成功率提升 5.1%。此外，我們觀察到 POETRY 找到的最大證明長度大幅增加，從 10 增加到 26。", "author": "Haiming Wang et.al.", "authors": "Haiming Wang, Huajian Xin, Zhengying Liu, Wenda Li, Yinya Huang, Jianqiao Lu, Zhicheng Yang, Jing Tang, Jian Yin, Zhenguo Li, Xiaodan Liang", "id": "2405.14414v1", "paper_url": "http://arxiv.org/abs/2405.14414v1", "repo": "null"}}