{"2409.09989": {"publish_time": "2024-09-16", "title": "Comprehensive Study on Sentiment Analysis: From Rule-based to modern LLM based system", "paper_summary": "This paper provides a comprehensive survey of sentiment analysis within the\ncontext of artificial intelligence (AI) and large language models (LLMs).\nSentiment analysis, a critical aspect of natural language processing (NLP), has\nevolved significantly from traditional rule-based methods to advanced deep\nlearning techniques. This study examines the historical development of\nsentiment analysis, highlighting the transition from lexicon-based and\npattern-based approaches to more sophisticated machine learning and deep\nlearning models. Key challenges are discussed, including handling bilingual\ntexts, detecting sarcasm, and addressing biases. The paper reviews\nstate-of-the-art approaches, identifies emerging trends, and outlines future\nresearch directions to advance the field. By synthesizing current methodologies\nand exploring future opportunities, this survey aims to understand sentiment\nanalysis in the AI and LLM context thoroughly.", "paper_summary_zh": "本文全面探討在人工智慧 (AI) 和大型語言模型 (LLM) 的脈絡中進行情緒分析。情緒分析是自然語言處理 (NLP) 的一個重要面向，已經從傳統的基於規則的方法顯著演進到先進的深度學習技術。本研究探討情緒分析的歷史發展，重點說明從基於詞彙和基於模式的方法轉變到更精密的機器學習和深度學習模型。本文討論了關鍵挑戰，包括處理雙語文本、偵測諷刺和解決偏見。本文回顧了最先進的方法，找出新興趨勢，並概述未來的研究方向以推進此領域。透過綜合當前方法並探索未來機會，本調查旨在全面了解 AI 和 LLM 脈絡中的情緒分析。", "author": "Shailja Gupta et.al.", "authors": "Shailja Gupta, Rajesh Ranjan, Surya Narayan Singh", "id": "2409.09989v1", "paper_url": "http://arxiv.org/abs/2409.09989v1", "repo": "null"}}