{"2407.13069": {"publish_time": "2024-07-18", "title": "Dynamic Sentiment Analysis with Local Large Language Models using Majority Voting: A Study on Factors Affecting Restaurant Evaluation", "paper_summary": "User-generated contents (UGCs) on online platforms allow marketing\nresearchers to understand consumer preferences for products and services. With\nthe advance of large language models (LLMs), some studies utilized the models\nfor annotation and sentiment analysis. However, the relationship between the\naccuracy and the hyper-parameters of LLMs is yet to be thoroughly examined. In\naddition, the issues of variability and reproducibility of results from each\ntrial of LLMs have rarely been considered in existing literature. Since actual\nhuman annotation uses majority voting to resolve disagreements among\nannotators, this study introduces a majority voting mechanism to a sentiment\nanalysis model using local LLMs. By a series of three analyses of online\nreviews on restaurant evaluations, we demonstrate that majority voting with\nmultiple attempts using a medium-sized model produces more robust results than\nusing a large model with a single attempt. Furthermore, we conducted further\nanalysis to investigate the effect of each aspect on the overall evaluation.", "paper_summary_zh": "線上平台上的使用者產生內容 (UGC) 能讓行銷研究人員了解消費者對產品和服務的喜好。隨著大型語言模型 (LLM) 的進步，有些研究利用這些模型進行標註和情緒分析。然而，LLM 的準確度和超參數之間的關係尚未得到徹底檢驗。此外，現有文獻很少考量 LLM 每一次試驗結果的可變性和可複製性問題。由於實際的人工標註使用多數決來解決標註者之間的分歧，本研究在使用局部 LLM 的情緒分析模型中引入了多數決機制。透過對餐廳評價的線上評論進行三項分析，我們證明使用中等規模的模型進行多次嘗試的多數決，會產生比使用大型模型進行一次嘗試更穩健的結果。此外，我們進一步進行分析，探討每個面向對整體評價的影響。", "author": "Junichiro Niimi et.al.", "authors": "Junichiro Niimi", "id": "2407.13069v1", "paper_url": "http://arxiv.org/abs/2407.13069v1", "repo": "null"}}