{"2411.08534": {"publish_time": "2024-11-13", "title": "Neural Topic Modeling with Large Language Models in the Loop", "paper_summary": "Topic modeling is a fundamental task in natural language processing, allowing\nthe discovery of latent thematic structures in text corpora. While Large\nLanguage Models (LLMs) have demonstrated promising capabilities in topic\ndiscovery, their direct application to topic modeling suffers from issues such\nas incomplete topic coverage, misalignment of topics, and inefficiency. To\naddress these limitations, we propose LLM-ITL, a novel LLM-in-the-loop\nframework that integrates LLMs with many existing Neural Topic Models (NTMs).\nIn LLM-ITL, global topics and document representations are learned through the\nNTM, while an LLM refines the topics via a confidence-weighted Optimal\nTransport (OT)-based alignment objective. This process enhances the\ninterpretability and coherence of the learned topics, while maintaining the\nefficiency of NTMs. Extensive experiments demonstrate that LLM-ITL can help\nNTMs significantly improve their topic interpretability while maintaining the\nquality of document representation.", "paper_summary_zh": "主題模型建立是自然語言處理中的一項基本任務，允許在文本語料庫中發現潛在的主題結構。雖然大型語言模型 (LLM) 已在主題發現方面展現出有前途的能力，但將其直接應用於主題模型會產生不完整的主題涵蓋範圍、主題錯位和效率低落等問題。為了解決這些限制，我們提出了 LLM-ITL，這是一個新的 LLM 循環架構，將 LLM 與許多現有的神經主題模型 (NTM) 整合在一起。在 LLM-ITL 中，透過 NTM 學習全局主題和文件表示，而 LLM 則透過基於信心加權的最適傳輸 (OT) 對齊目標來優化這些主題。此程序增強了學習主題的可解釋性和一致性，同時維持了 NTM 的效率。廣泛的實驗證明，LLM-ITL 可以幫助 NTM 大幅提升其主題可解釋性，同時維持文件表示的品質。", "author": "Xiaohao Yang et.al.", "authors": "Xiaohao Yang, He Zhao, Weijie Xu, Yuanyuan Qi, Jueqing Lu, Dinh Phung, Lan Du", "id": "2411.08534v1", "paper_url": "http://arxiv.org/abs/2411.08534v1", "repo": "null"}}