{"2410.11650": {"publish_time": "2024-10-15", "title": "ED-ViT: Splitting Vision Transformer for Distributed Inference on Edge Devices", "paper_summary": "Deep learning models are increasingly deployed on resource-constrained edge\ndevices for real-time data analytics. In recent years, Vision Transformer\nmodels and their variants have demonstrated outstanding performance across\nvarious computer vision tasks. However, their high computational demands and\ninference latency pose significant challenges for model deployment on\nresource-constraint edge devices. To address this issue, we propose a novel\nVision Transformer splitting framework, ED-ViT, designed to execute complex\nmodels across multiple edge devices efficiently. Specifically, we partition\nVision Transformer models into several sub-models, where each sub-model is\ntailored to handle a specific subset of data classes. To further minimize\ncomputation overhead and inference latency, we introduce a class-wise pruning\ntechnique that reduces the size of each sub-model. We conduct extensive\nexperiments on five datasets with three model structures, demonstrating that\nour approach significantly reduces inference latency on edge devices and\nachieves a model size reduction of up to 28.9 times and 34.1 times,\nrespectively, while maintaining test accuracy comparable to the original Vision\nTransformer. Additionally, we compare ED-ViT with two state-of-the-art methods\nthat deploy CNN and SNN models on edge devices, evaluating accuracy, inference\ntime, and overall model size. Our comprehensive evaluation underscores the\neffectiveness of the proposed ED-ViT framework.", "paper_summary_zh": "深度學習模型越來越多地部署在資源受限的邊緣設備上，用於執行即時數據分析。近年來，視覺轉換器模型及其變體已在各種電腦視覺任務中展現出傑出的效能。然而，它們的高計算需求和推論延遲對資源受限的邊緣設備上的模型部署構成重大挑戰。為了解決這個問題，我們提出了一個創新的視覺轉換器分割框架 ED-ViT，旨在有效地在多個邊緣設備上執行複雜的模型。具體來說，我們將視覺轉換器模型分割成幾個子模型，其中每個子模型都經過調整，以處理特定數據類別的子集。為了進一步最小化計算開銷和推論延遲，我們引入了一種類別級別的剪枝技術，以縮小每個子模型的大小。我們對五個數據集和三種模型結構進行了廣泛的實驗，證明我們的做法顯著降低了邊緣設備上的推論延遲，並分別實現了高達 28.9 倍和 34.1 倍的模型大小縮減，同時維持與原始視覺轉換器相當的測試準確度。此外，我們將 ED-ViT 與兩種在邊緣設備上部署 CNN 和 SNN 模型的最新方法進行比較，評估準確度、推論時間和整體模型大小。我們全面的評估強調了所提出的 ED-ViT 框架的有效性。", "author": "Xiang Liu et.al.", "authors": "Xiang Liu, Yijun Song, Xia Li, Yifei Sun, Huiying Lan, Zemin Liu, Linshan Jiang, Jialin Li", "id": "2410.11650v1", "paper_url": "http://arxiv.org/abs/2410.11650v1", "repo": "null"}}