{"2412.06308": {"publish_time": "2024-12-09", "title": "PRECISE: Pre-training Sequential Recommenders with Collaborative and Semantic Information", "paper_summary": "Real-world recommendation systems commonly offer diverse content scenarios\nfor users to interact with. Considering the enormous number of users in\nindustrial platforms, it is infeasible to utilize a single unified\nrecommendation model to meet the requirements of all scenarios. Usually,\nseparate recommendation pipelines are established for each distinct scenario.\nThis practice leads to challenges in comprehensively grasping users' interests.\nRecent research endeavors have been made to tackle this problem by pre-training\nmodels to encapsulate the overall interests of users. Traditional pre-trained\nrecommendation models mainly capture user interests by leveraging collaborative\nsignals. Nevertheless, a prevalent drawback of these systems is their\nincapacity to handle long-tail items and cold-start scenarios. With the recent\nadvent of large language models, there has been a significant increase in\nresearch efforts focused on exploiting LLMs to extract semantic information for\nusers and items. However, text-based recommendations highly rely on elaborate\nfeature engineering and frequently fail to capture collaborative similarities.\nTo overcome these limitations, we propose a novel pre-training framework for\nsequential recommendation, termed PRECISE. This framework combines\ncollaborative signals with semantic information. Moreover, PRECISE employs a\nlearning framework that initially models users' comprehensive interests across\nall recommendation scenarios and subsequently concentrates on the specific\ninterests of target-scene behaviors. We demonstrate that PRECISE precisely\ncaptures the entire range of user interests and effectively transfers them to\nthe target interests. Empirical findings reveal that the PRECISE framework\nattains outstanding performance on both public and industrial datasets.", "paper_summary_zh": "現實世界的推薦系統通常提供多樣化的內容情境，供使用者互動。考量到產業平台中龐大的使用者數量，要使用單一的統一推薦模型來滿足所有情境的需要並不可行。通常，會為每個不同的情境建立獨立的推薦管道。這種做法帶來全面掌握使用者興趣的挑戰。最近的研究努力嘗試透過預訓練模型來解決這個問題，以概括使用者的整體興趣。傳統的預訓練推薦模型主要透過利用協同訊號來擷取使用者興趣。儘管如此，這些系統普遍存在的缺點是無法處理長尾項目和冷啟動情境。隨著大型語言模型的近期出現，研究工作大幅增加，專注於利用 LLM 來擷取使用者的語意資訊和項目。然而，基於文字的推薦高度仰賴精密的特徵工程，而且經常無法擷取協同相似性。為了克服這些限制，我們提出一個序列推薦的新穎預訓練架構，稱為 PRECISE。這個架構結合了協同訊號與語意資訊。此外，PRECISE 採用一個學習架構，最初會對所有推薦情境建模使用者的綜合興趣，然後專注於目標場景行為的特定興趣。我們展示 PRECISE 精確擷取使用者興趣的完整範圍，並有效地將它們轉移到目標興趣。經驗發現顯示，PRECISE 架構在公開和產業資料集上皆獲得傑出的效能。", "author": "Chonggang Song et.al.", "authors": "Chonggang Song, Chunxu Shen, Hao Gu, Yaoming Wu, Lingling Yi, Jie Wen, Chuan Chen", "id": "2412.06308v1", "paper_url": "http://arxiv.org/abs/2412.06308v1", "repo": "null"}}