{"2410.14669": {"publish_time": "2024-10-18", "title": "NaturalBench: Evaluating Vision-Language Models on Natural Adversarial Samples", "paper_summary": "Vision-language models (VLMs) have made significant progress in recent\nvisual-question-answering (VQA) benchmarks that evaluate complex\nvisio-linguistic reasoning. However, are these models truly effective? In this\nwork, we show that VLMs still struggle with natural images and questions that\nhumans can easily answer, which we term natural adversarial samples. We also\nfind it surprisingly easy to generate these VQA samples from natural image-text\ncorpora using off-the-shelf models like CLIP and ChatGPT. We propose a\nsemi-automated approach to collect a new benchmark, NaturalBench, for reliably\nevaluating VLMs with 10,000 human-verified VQA samples. Crucially, we adopt a\n$\\textbf{vision-centric}$ design by pairing each question with two images that\nyield different answers, preventing blind solutions from answering without\nusing the images. This makes NaturalBench more challenging than previous\nbenchmarks that can be solved with commonsense priors. We evaluate 53\nstate-of-the-art VLMs on NaturalBench, showing that models like\nLLaVA-OneVision, Cambrian-1, Llama3.2-Vision, Molmo, Qwen2-VL, and even GPT-4o\nlag 50%-70% behind human performance (over 90%). We analyze why NaturalBench is\nhard from two angles: (1) Compositionality: Solving NaturalBench requires\ndiverse visio-linguistic skills, including understanding attribute bindings,\nobject relationships, and advanced reasoning like logic and counting. To this\nend, unlike prior work that uses a single tag per sample, we tag each\nNaturalBench sample with 1 to 8 skill tags for fine-grained evaluation. (2)\nBiases: NaturalBench exposes severe biases in VLMs, as models often choose the\nsame answer regardless of the image. Lastly, we apply our benchmark curation\nmethod to diverse data sources, including long captions (over 100 words) and\nnon-English languages like Chinese and Hindi, highlighting its potential for\ndynamic evaluations of VLMs.", "paper_summary_zh": "<paragraph>視覺語言模型 (VLM) 在最近的視覺問答 (VQA) 基準測試中取得顯著進展，這些基準測試評估了複雜的視覺語言推理能力。然而，這些模型是否真正有效？在這項工作中，我們展示了 VLM 仍難以處理人類可以輕鬆回答的自然影像和問題，我們將其稱為自然對抗樣本。我們還發現，使用現成的模型（例如 CLIP 和 ChatGPT）從自然影像文字語料庫中生成這些 VQA 樣本出奇地容易。我們提出了一種半自動化方法來收集一個新的基準測試 NaturalBench，以便使用 10,000 個經人類驗證的 VQA 樣本可靠地評估 VLM。至關重要的是，我們採用了**以視覺為中心**的設計，將每個問題與兩張產生不同答案的影像配對，防止盲解在不使用影像的情況下回答問題。這使得 NaturalBench 比可以使用常識先驗來解決的先前基準測試更具挑戰性。我們在 NaturalBench 上評估了 53 個最先進的 VLM，結果顯示 LLaVA-OneVision、Cambrian-1、Llama3.2-Vision、Molmo、Qwen2-VL，甚至 GPT-4o 等模型落後於人類表現 (超過 90%) 50%-70%。我們從兩個角度分析了 NaturalBench 的難點：(1) 組合性：解決 NaturalBench 需要多樣化的視覺語言技能，包括理解屬性繫結、物件關係以及高級推理，例如邏輯和計數。為此，與先前使用每個樣本一個標籤的工作不同，我們使用 1 到 8 個技能標籤標記每個 NaturalBench 樣本，以進行細微的評估。(2) 偏差：NaturalBench 揭露了 VLM 中嚴重的偏差，因為模型通常會選擇相同的答案，而不管影像為何。最後，我們將基準策展方法應用於各種數據來源，包括長標題（超過 100 個字）和非英語語言（例如中文和印地語），突顯了其對 VLM 進行動態評估的潛力。</paragraph>", "author": "Baiqi Li et.al.", "authors": "Baiqi Li, Zhiqiu Lin, Wenxuan Peng, Jean de Dieu Nyandwi, Daniel Jiang, Zixian Ma, Simran Khanuja, Ranjay Krishna, Graham Neubig, Deva Ramanan", "id": "2410.14669v1", "paper_url": "http://arxiv.org/abs/2410.14669v1", "repo": "null"}}