{"2412.12063": {"publish_time": "2024-12-16", "title": "Revelations: A Decidable Class of POMDPs with Omega-Regular Objectives", "paper_summary": "Partially observable Markov decision processes (POMDPs) form a prominent\nmodel for uncertainty in sequential decision making. We are interested in\nconstructing algorithms with theoretical guarantees to determine whether the\nagent has a strategy ensuring a given specification with probability 1. This\nwell-studied problem is known to be undecidable already for very simple\nomega-regular objectives, because of the difficulty of reasoning on uncertain\nevents. We introduce a revelation mechanism which restricts information loss by\nrequiring that almost surely the agent has eventually full information of the\ncurrent state. Our main technical results are to construct exact algorithms for\ntwo classes of POMDPs called weakly and strongly revealing. Importantly, the\ndecidable cases reduce to the analysis of a finite belief-support Markov\ndecision process. This yields a conceptually simple and exact algorithm for a\nlarge class of POMDPs.", "paper_summary_zh": "部分可觀察馬可夫決策過程 (POMDP) 形成了一個用於順序決策制定中不確定性的顯著模型。我們有興趣建構具有理論保證的演算法，以確定代理是否有一個策略來確保給定規格的機率為 1。這個研究得很透徹的問題已知對於非常簡單的 omega 正規目標是不可判定的，因為在不確定事件上推論很困難。我們引入一個揭示機制，它透過要求代理幾乎肯定最終完全了解當前狀態來限制資訊遺失。我們的技術主要成果是為稱為弱揭示和強揭示的兩類 POMDP 建構精確的演算法。重要的是，可判定的情況會簡化為對有限信念支援馬可夫決策過程的分析。這產生了一個概念上簡單且精確的演算法，適用於一大類 POMDP。", "author": "Marius Belly et.al.", "authors": "Marius Belly, Nathanaël Fijalkow, Hugo Gimbert, Florian Horn, Guillermo A. Pérez, Pierre Vandenhove", "id": "2412.12063v1", "paper_url": "http://arxiv.org/abs/2412.12063v1", "repo": "null"}}