{"2502.02072": {"publish_time": "2025-02-04", "title": "ASCenD-BDS: Adaptable, Stochastic and Context-aware framework for Detection of Bias, Discrimination and Stereotyping", "paper_summary": "The rapid evolution of Large Language Models (LLMs) has transformed natural\nlanguage processing but raises critical concerns about biases inherent in their\ndeployment and use across diverse linguistic and sociocultural contexts. This\npaper presents a framework named ASCenD BDS (Adaptable, Stochastic and\nContext-aware framework for Detection of Bias, Discrimination and\nStereotyping). The framework presents approach to detecting bias,\ndiscrimination, stereotyping across various categories such as gender, caste,\nage, disability, socioeconomic status, linguistic variations, etc., using an\napproach which is Adaptive, Stochastic and Context-Aware. The existing\nframeworks rely heavily on usage of datasets to generate scenarios for\ndetection of Bias, Discrimination and Stereotyping. Examples include datasets\nsuch as Civil Comments, Wino Gender, WinoBias, BOLD, CrowS Pairs and BBQ.\nHowever, such an approach provides point solutions. As a result, these datasets\nprovide a finite number of scenarios for assessment. The current framework\novercomes this limitation by having features which enable Adaptability,\nStochasticity, Context Awareness. Context awareness can be customized for any\nnation or culture or sub-culture (for example an organization's unique\nculture). In this paper, context awareness in the Indian context has been\nestablished. Content has been leveraged from Indian Census 2011 to have a\ncommonality of categorization. A framework has been developed using Category,\nSub-Category, STEM, X-Factor, Synonym to enable the features for Adaptability,\nStochasticity and Context awareness. The framework has been described in detail\nin Section 3. Overall 800 plus STEMs, 10 Categories, 31 unique SubCategories\nwere developed by a team of consultants at Saint Fox Consultancy Private Ltd.\nThe concept has been tested out in SFCLabs as part of product development.", "paper_summary_zh": "大型語言模型 (LLM) 的快速演進轉化了自然語言處理，然而也對其在不同語言及社會文化脈絡中的部署和使用所固有的偏見提出了重大的疑慮。本文提出了一個名為 ASCenD BDS（偏見、歧視和刻板印象偵測的可適應、隨機和情境感知框架）的框架。此框架提出了一種偵測偏見、歧視和刻板印象的方法，涵蓋性別、種姓、年齡、殘疾、社會經濟地位、語言變異等各種類別，並採用可適應、隨機和情境感知的方法。現有的框架高度依賴資料集的使用，以產生偏見、歧視和刻板印象偵測的場景。資料集範例包括 Civil Comments、Wino Gender、WinoBias、BOLD、CrowS Pairs 和 BBQ。然而，此種方法提供了點狀解法。因此，這些資料集提供了有限數量的評估場景。目前的框架透過具備可適應性、隨機性和情境感知的功能來克服此項限制。情境感知可以針對任何國家、文化或次文化（例如組織獨特的文化）進行客製化。本文中建立了印度脈絡中的情境感知。內容利用 2011 年印度人口普查資料，以建立分類的共性。已使用類別、次類別、STEM、X 因子、同義詞開發了一個框架，以啟用可適應性、隨機性和情境感知的功能。此框架已在第 3 節中詳細說明。總計 800 多個 STEM、10 個類別、31 個獨特的次類別是由 Saint Fox Consultancy Private Ltd. 的顧問團隊開發的。此概念已在 SFCLabs 中作為產品開發的一部分進行測試。", "author": "Rajiv Bahl et.al.", "authors": "Rajiv Bahl, Venkatesan N, Parimal Aglawe, Aastha Sarasapalli, Bhavya Kancharla, Chaitanya kolukuluri, Harish Mohite, Japneet Hora, Kiran Kakollu, Rahul Diman, Shubham Kapale, Sri Bhagya Kathula, Vamsikrishna Motru, Yogeshwar Reddy", "id": "2502.02072v1", "paper_url": "http://arxiv.org/abs/2502.02072v1", "repo": "null"}}