{"2405.17398": {"publish_time": "2024-05-27", "title": "Vista: A Generalizable Driving World Model with High Fidelity and Versatile Controllability", "paper_summary": "World models can foresee the outcomes of different actions, which is of\nparamount importance for autonomous driving. Nevertheless, existing driving\nworld models still have limitations in generalization to unseen environments,\nprediction fidelity of critical details, and action controllability for\nflexible application. In this paper, we present Vista, a generalizable driving\nworld model with high fidelity and versatile controllability. Based on a\nsystematic diagnosis of existing methods, we introduce several key ingredients\nto address these limitations. To accurately predict real-world dynamics at high\nresolution, we propose two novel losses to promote the learning of moving\ninstances and structural information. We also devise an effective latent\nreplacement approach to inject historical frames as priors for coherent\nlong-horizon rollouts. For action controllability, we incorporate a versatile\nset of controls from high-level intentions (command, goal point) to low-level\nmaneuvers (trajectory, angle, and speed) through an efficient learning\nstrategy. After large-scale training, the capabilities of Vista can seamlessly\ngeneralize to different scenarios. Extensive experiments on multiple datasets\nshow that Vista outperforms the most advanced general-purpose video generator\nin over 70% of comparisons and surpasses the best-performing driving world\nmodel by 55% in FID and 27% in FVD. Moreover, for the first time, we utilize\nthe capacity of Vista itself to establish a generalizable reward for real-world\naction evaluation without accessing the ground truth actions.", "paper_summary_zh": "世界模型可以預測不同動作的結果，這對於自動駕駛至關重要。儘管如此，現有的駕駛世界模型在推廣到未見環境、關鍵細節的預測保真度和靈活應用動作可控性方面仍然存在局限性。在本文中，我們展示了 Vista，一個具有高保真度和多功能可控性的可推廣駕駛世界模型。基於對現有方法的系統診斷，我們引入了幾個關鍵要素來解決這些限制。為了準確預測高解析度的真實世界動態，我們提出了兩種新損失來促進移動實例和結構信息的學習。我們還設計了一種有效的潛在替換方法，將歷史幀作為連貫長時程滾動的先驗注入。對於動作可控性，我們通過一種有效的學習策略，將來自高層級意圖（命令、目標點）到低層級操作（軌跡、角度和速度）的多功能控制集合整合起來。經過大規模訓練後，Vista 的功能可以無縫推廣到不同的場景。在多個數據集上的廣泛實驗表明，Vista 在超過 70% 的比較中優於最先進的通用視頻生成器，並且在 FID 中比性能最好的駕駛世界模型高出 55%，在 FVD 中高出 27%。此外，我們首次利用 Vista 本身的能力為真實世界的動作評估建立一個可推廣的獎勵，而無需訪問真實的動作。", "author": "Shenyuan Gao et.al.", "authors": "Shenyuan Gao, Jiazhi Yang, Li Chen, Kashyap Chitta, Yihang Qiu, Andreas Geiger, Jun Zhang, Hongyang Li", "id": "2405.17398v1", "paper_url": "http://arxiv.org/abs/2405.17398v1", "repo": "https://github.com/opendrivelab/vista"}}