{"2407.16286": {"publish_time": "2024-07-23", "title": "A deeper look at depth pruning of LLMs", "paper_summary": "Large Language Models (LLMs) are not only resource-intensive to train but\neven more costly to deploy in production. Therefore, recent work has attempted\nto prune blocks of LLMs based on cheap proxies for estimating block importance,\neffectively removing 10% of blocks in well-trained LLaMa-2 and Mistral 7b\nmodels without any significant degradation of downstream metrics. In this\npaper, we explore different block importance metrics by considering adaptive\nmetrics such as Shapley value in addition to static ones explored in prior\nwork. We show that adaptive metrics exhibit a trade-off in performance between\ntasks i.e., improvement on one task may degrade performance on the other due to\ndifferences in the computed block influences. Furthermore, we extend this\nanalysis from a complete block to individual self-attention and feed-forward\nlayers, highlighting the propensity of the self-attention layers to be more\namendable to pruning, even allowing removal of upto 33% of the self-attention\nlayers without incurring any performance degradation on MMLU for Mistral 7b\n(significant reduction in costly maintenance of KV-cache). Finally, we look at\nsimple performance recovery techniques to emulate the pruned layers by training\nlightweight additive bias or low-rank linear adapters. Performance recovery\nusing emulated updates avoids performance degradation for the initial blocks\n(up to 5% absolute improvement on MMLU), which is either competitive or\nsuperior to the learning-based technique.", "paper_summary_zh": "大型語言模型 (LLM) 不僅訓練資源密集，部署至生產環境的成本更高。因此，最近的研究嘗試根據估計區塊重要性的廉價代理來修剪 LLM 區塊，有效地移除了訓練良好的 LLaMa-2 和 Mistral 7b 模型中 10% 的區塊，而不會顯著降低下游指標。在本文中，我們除了探討先前研究中探索的靜態指標外，還考慮了 Shapley 值等自適應指標，來探索不同的區塊重要性指標。我們展示了自適應指標在任務之間的性能權衡，即在一個任務上的改進可能會由於計算的區塊影響的差異而降低在另一個任務上的性能。此外，我們將此分析從一個完整區塊擴展到個別自注意力和前饋層，突出了自注意力層更容易進行修剪的傾向，甚至允許移除多達 33% 的自注意力層，而不會對 Mistral 7b 的 MMLU 造成任何性能下降（大幅減少 KV 快取的昂貴維護）。最後，我們探討了簡單的性能恢復技術，通過訓練輕量級加性偏差或低秩線性適配器來模擬修剪的層。使用模擬更新的性能恢復避免了初始區塊的性能下降（在 MMLU 上絕對提升高達 5%），這與基於學習的技術相比具有競爭力或優勢。", "author": "Shoaib Ahmed Siddiqui et.al.", "authors": "Shoaib Ahmed Siddiqui, Xin Dong, Greg Heinrich, Thomas Breuel, Jan Kautz, David Krueger, Pavlo Molchanov", "id": "2407.16286v1", "paper_url": "http://arxiv.org/abs/2407.16286v1", "repo": "https://github.com/shoaibahmed/llm_depth_pruning"}}