{"2412.17365": {"publish_time": "2024-12-23", "title": "Boosting LLM via Learning from Data Iteratively and Selectively", "paper_summary": "Datasets nowadays are generally constructed from multiple sources and using\ndifferent synthetic techniques, making data de-noising and de-duplication\ncrucial before being used for post-training. In this work, we propose to\nperform instruction tuning by iterative data selection (\\ApproachName{}). We\nmeasure the quality of a sample from complexity and diversity simultaneously.\nInstead of calculating the complexity score once for all before fine-tuning, we\nhighlight the importance of updating this model-specific score during\nfine-tuning to accurately accommodate the dynamic changes of the model. On the\nother hand, the diversity score is defined on top of the samples' responses\nunder the consideration of their informativeness. IterIT integrates the\nstrengths of both worlds by iteratively updating the complexity score for the\ntop-ranked samples and greedily selecting the ones with the highest\ncomplexity-diversity score. Experiments on multiple instruction-tuning data\ndemonstrate consistent improvements of IterIT over strong baselines. Moreover,\nour approach also generalizes well to domain-specific scenarios and different\nbackbone models. All resources will be available at\nhttps://github.com/JiaQiSJTU/IterIT.", "paper_summary_zh": "現今的資料集通常由多個來源建構，並使用不同的合成技術，這使得資料去雜訊和去重在用於後訓練之前至關重要。在這項工作中，我們建議透過反覆資料選擇來執行指令微調（\\ApproachName{}）。我們同時從複雜性和多樣性來衡量樣本的品質。我們並非在微調之前一次計算所有複雜性分數，而是強調在微調期間更新此模型特定分數以準確適應模型的動態變化。另一方面，多樣性分數是在樣本回應的基礎上定義的，並考慮到它們的資訊性。IterIT 整合了這兩個世界的優點，透過反覆更新排名前幾名的樣本的複雜性分數，並貪婪地選擇複雜性多樣性分數最高的樣本。對多個指令微調資料進行的實驗證明了 IterIT 在強大的基線上的一致改進。此外，我們的做法也很好地推廣到特定領域的場景和不同的主幹模型。所有資源都可以在 https://github.com/JiaQiSJTU/IterIT 獲得。", "author": "Qi Jia et.al.", "authors": "Qi Jia, Siyu Ren, Ziheng Qin, Fuzhao Xue, Jinjie Ni, Yang You", "id": "2412.17365v1", "paper_url": "http://arxiv.org/abs/2412.17365v1", "repo": "null"}}