{"2409.04958": {"publish_time": "2024-09-08", "title": "DDNet: Deformable Convolution and Dense FPN for Surface Defect Detection in Recycled Books", "paper_summary": "Recycled and recirculated books, such as ancient texts and reused textbooks,\nhold significant value in the second-hand goods market, with their worth\nlargely dependent on surface preservation. However, accurately assessing\nsurface defects is challenging due to the wide variations in shape, size, and\nthe often imprecise detection of defects. To address these issues, we propose\nDDNet, an innovative detection model designed to enhance defect localization\nand classification. DDNet introduces a surface defect feature extraction module\nbased on a deformable convolution operator (DC) and a densely connected FPN\nmodule (DFPN). The DC module dynamically adjusts the convolution grid to better\nalign with object contours, capturing subtle shape variations and improving\nboundary delineation and prediction accuracy. Meanwhile, DFPN leverages dense\nskip connections to enhance feature fusion, constructing a hierarchical\nstructure that generates multi-resolution, high-fidelity feature maps, thus\neffectively detecting defects of various sizes. In addition to the model, we\npresent a comprehensive dataset specifically curated for surface defect\ndetection in recycled and recirculated books. This dataset encompasses a\ndiverse range of defect types, shapes, and sizes, making it ideal for\nevaluating the robustness and effectiveness of defect detection models. Through\nextensive evaluations, DDNet achieves precise localization and classification\nof surface defects, recording a mAP value of 46.7% on our proprietary dataset -\nan improvement of 14.2% over the baseline model - demonstrating its superior\ndetection capabilities.", "paper_summary_zh": "再利用和再循環的書籍，例如古籍和再利用的教科書，在二手商品市場中具有重要的價值，其價值在很大程度上取決於表面保存狀況。然而，由於形狀、大小變化很大，且缺陷檢測通常不精確，因此準確評估表面缺陷具有挑戰性。為了解決這些問題，我們提出了 DDNet，這是一種創新的檢測模型，旨在增強缺陷定位和分類。DDNet 引入了基於可變形卷積運算子 (DC) 和密集連接 FPN 模塊 (DFPN) 的表面缺陷特徵提取模塊。DC 模塊動態調整卷積網格以更好地與對象輪廓對齊，捕捉微妙的形狀變化並改善邊界描繪和預測精度。與此同時，DFPN 利用密集跳躍連接增強特徵融合，構建一個生成多解析度、高保真特徵圖的層次結構，從而有效檢測各種尺寸的缺陷。除了模型之外，我們還提供了一個專門為再利用和再循環書籍中的表面缺陷檢測而策劃的綜合數據集。該數據集涵蓋了各種缺陷類型、形狀和尺寸，非常適合評估缺陷檢測模型的魯棒性和有效性。通過廣泛的評估，DDNet 在我們的專有數據集上實現了表面缺陷的精確定位和分類，記錄了 46.7% 的 mAP 值——比基準模型提高了 14.2%——證明了其卓越的檢測能力。", "author": "Jun Yu et.al.", "authors": "Jun Yu, WenJian Wang", "id": "2409.04958v1", "paper_url": "http://arxiv.org/abs/2409.04958v1", "repo": "null"}}