{"2407.05858": {"publish_time": "2024-07-08", "title": "Empowering 1000 tokens/second on-device LLM prefilling with mllm-NPU", "paper_summary": "On-device large language models (LLMs) are catalyzing novel mobile\napplications such as UI task automation and personalized email auto-reply,\nwithout giving away users' private data. However, on-device LLMs still suffer\nfrom unacceptably long inference latency, especially the time to first token\n(prefill stage) due to the need of long context for accurate, personalized\ncontent generation, as well as the lack of parallel computing capacity of\nmobile CPU/GPU.\n  To enable practical on-device LLM, we present mllm-NPU, the first-of-its-kind\nLLM inference system that efficiently leverages on-device Neural Processing\nUnit (NPU) offloading. Essentially, mllm-NPU is an algorithm-system co-design\nthat tackles a few semantic gaps between the LLM architecture and contemporary\nNPU design. Specifically, it re-constructs the prompt and model in three\nlevels: (1) At prompt level, it divides variable-length prompts into multiple\nfixed-sized chunks while maintaining data dependencies; (2) At tensor level, it\nidentifies and extracts significant outliers to run on the CPU/GPU in parallel\nwith minimal overhead; (3) At block level, it schedules Transformer blocks in\nan out-of-order manner to the CPU/GPU and NPU based on their hardware affinity\nand sensitivity to accuracy. Compared to competitive baselines, mllm-NPU\nachieves 22.4x faster prefill speed and 30.7x energy savings on average, and up\nto 32.8x speedup in an end-to-end real-world application. For the first time,\nmllm-NPU achieves more than 1,000 tokens/sec prefilling for a billion-sized\nmodel (Qwen1.5-1.8B), paving the way towards practical on-device LLM.", "paper_summary_zh": "裝置上的大型語言模型 (LLM) 正在催化新穎的行動應用程式，例如 UI 任務自動化和個人化電子郵件自動回覆，而不會洩漏使用者的私人資料。然而，裝置上的 LLM 仍會遭受無法接受的長推論延遲，特別是到第一個符號的時間（預填階段），這是因為需要長背景才能產生準確、個人化的內容，以及行動裝置 CPU/GPU 缺乏平行運算能力。\n為了啟用實用的裝置上 LLM，我們提出 mllm-NPU，這是同類產品中第一個有效利用裝置上神經處理單元 (NPU) 卸載的 LLM 推論系統。基本上，mllm-NPU 是一種演算法系統共同設計，它解決了 LLM 架構和當代 NPU 設計之間的一些語義差距。具體來說，它在三個層級中重建提示和模型：(1) 在提示層級，它將變長提示分割成多個固定大小的區塊，同時維護資料依賴性；(2) 在張量層級，它識別並提取顯著的異常值，以便與 CPU/GPU 並行執行，且開銷最小；(3) 在區塊層級，它以亂序的方式將 Transformer 區塊排程到 CPU/GPU 和 NPU，根據它們的硬體親和性和對精確度的敏感性。與競爭基準相比，mllm-NPU 平均達到 22.4 倍更快的預填速度和 30.7 倍的節能，以及在端到端實際應用中最高達到 32.8 倍的加速。mllm-NPU 首次實現了十億大小模型 (Qwen1.5-1.8B) 的每秒超過 1,000 個符號預填，為實用的裝置上 LLM 鋪路。", "author": "Daliang Xu et.al.", "authors": "Daliang Xu, Hao Zhang, Liming Yang, Ruiqi Liu, Gang Huang, Mengwei Xu, Xuanzhe Liu", "id": "2407.05858v1", "paper_url": "http://arxiv.org/abs/2407.05858v1", "repo": "null"}}