{"2405.14394": {"publish_time": "2024-05-23", "title": "Instruction Tuning With Loss Over Instructions", "paper_summary": "Instruction tuning plays a crucial role in shaping the outputs of language\nmodels (LMs) to desired styles. In this work, we propose a simple yet effective\nmethod, Instruction Modelling (IM), which trains LMs by applying a loss\nfunction to the instruction and prompt part rather than solely to the output\npart. Through experiments across 21 diverse benchmarks, we show that, in many\nscenarios, IM can effectively improve the LM performance on both NLP tasks\n(e.g., MMLU, TruthfulQA, and HumanEval) and open-ended generation benchmarks\n(e.g., MT-Bench and AlpacaEval). Remarkably, in the most advantageous case, IM\nboosts model performance on AlpacaEval 1.0 by over 100%. We identify two key\nfactors influencing the effectiveness of IM: (1) The ratio between instruction\nlength and output length in the training data; and (2) The number of training\nexamples. We observe that IM is especially beneficial when trained on datasets\nwith lengthy instructions paired with brief outputs, or under the Superficial\nAlignment Hypothesis (SAH) where a small amount of training examples are used\nfor instruction tuning. Further analysis substantiates our hypothesis that the\nimprovement can be attributed to reduced overfitting to instruction tuning\ndatasets. Our work provides practical guidance for instruction tuning LMs,\nespecially in low-resource scenarios.", "paper_summary_zh": "指令微调在塑造语言模型 (LM) 的输出以达到所需的风格方面发挥着至关重要的作用。在这项工作中，我们提出了一种简单但有效的方法，指令建模 (IM)，它通过对指令和提示部分应用损失函数来训练 LM，而不是仅对输出部分应用损失函数。通过对 21 个不同的基准测试进行的实验，我们表明，在许多情况下，IM 可以有效地提高 LM 在 NLP 任务（例如，MMLU、TruthfulQA 和 HumanEval）和开放式生成基准测试（例如，MT-Bench 和 AlpacaEval）上的性能。值得注意的是，在最有利的情况下，IM 将 AlpacaEval 1.0 上的模型性能提升了 100% 以上。我们确定了影响 IM 有效性的两个关键因素：(1) 训练数据中指令长度与输出长度之间的比率；(2) 训练示例的数量。我们观察到，当在指令与简短输出配对的长指令数据集上进行训练时，IM 特别有益，或者在使用少量训练示例进行指令微调的表面对齐假设 (SAH) 下。进一步的分析证实了我们的假设，即改进可以归因于对指令微调数据集的过度拟合减少。我们的工作为指令微调 LM 提供了实用指导，尤其是在资源匮乏的情况下。", "author": "Zhengyan Shi et.al.", "authors": "Zhengyan Shi, Adam X. Yang, Bin Wu, Laurence Aitchison, Emine Yilmaz, Aldo Lipani", "id": "2405.14394v1", "paper_url": "http://arxiv.org/abs/2405.14394v1", "repo": "null"}}