{"2503.04725": {"publish_time": "2025-03-06", "title": "L$^2$M: Mutual Information Scaling Law for Long-Context Language Modeling", "paper_summary": "We rigorously establish a bipartite mutual information scaling law in natural\nlanguage that governs long-range dependencies. This scaling law, which we show\nis distinct from and scales independently of the conventional two-point mutual\ninformation, is the key to understanding long-context language modeling. Using\nthis scaling law, we formulate the Long-context Language Modeling (L$^2$M)\ncondition, which relates a model's capacity for effective long context length\nmodeling to the scaling of its latent state size for storing past information.\nOur results are validated through experiments on both transformers and state\nspace models. This work establishes a theoretical foundation that guides the\ndevelopment of large language models toward longer context lengths.", "paper_summary_zh": "<paragraph>我們嚴謹地建立了一個自然語言中的二分互信息尺度律，用以控制長程依存關係。這個尺度律，我們證明它不同於傳統的兩點互信息，並且獨立於其進行尺度變化，是理解長文本語言建模的關鍵。利用這個尺度律，我們制定了長文本語言建模（L$^2$M）條件，它將模型有效長文本建模的能力與其用於儲存過去信息的潛在狀態大小的尺度聯繫起來。我們的結果通過對transformer和狀態空間模型的實驗得到了驗證。這項工作建立了一個理論基礎，指導大型語言模型向更長文本方向發展。</paragraph>\n", "author": "Zhuo Chen et.al.", "authors": "Zhuo Chen, Oriol Mayné i Comas, Zhuotao Jin, Di Luo, Marin Soljačić", "id": "2503.04725v1", "paper_url": "http://arxiv.org/abs/2503.04725v1", "repo": "null"}}