{"2406.15050": {"publish_time": "2024-06-21", "title": "Tri-VQA: Triangular Reasoning Medical Visual Question Answering for Multi-Attribute Analysis", "paper_summary": "The intersection of medical Visual Question Answering (Med-VQA) is a\nchallenging research topic with advantages including patient engagement and\nclinical expert involvement for second opinions. However, existing Med-VQA\nmethods based on joint embedding fail to explain whether their provided results\nare based on correct reasoning or coincidental answers, which undermines the\ncredibility of VQA answers. In this paper, we investigate the construction of a\nmore cohesive and stable Med-VQA structure. Motivated by causal effect, we\npropose a novel Triangular Reasoning VQA (Tri-VQA) framework, which constructs\nreverse causal questions from the perspective of \"Why this answer?\" to\nelucidate the source of the answer and stimulate more reasonable forward\nreasoning processes. We evaluate our method on the Endoscopic Ultrasound (EUS)\nmulti-attribute annotated dataset from five centers, and test it on medical VQA\ndatasets. Experimental results demonstrate the superiority of our approach over\nexisting methods. Our codes and pre-trained models are available at\nhttps://anonymous.4open.science/r/Tri_VQA.", "paper_summary_zh": "醫學視覺問答 (Med-VQA) 的交叉領域是一個具有挑戰性的研究主題，其優點包括患者參與和臨床專家的參與以提供第二意見。然而，現有的基於聯合嵌入的 Med-VQA 方法無法解釋其提供的結果是基於正確的推理還是巧合的答案，這會損害 VQA 答案的可信度。在本文中，我們探討了構建更緊密且穩定的 Med-VQA 結構。受到因果關係的啟發，我們提出了一個新穎的三角推理 VQA (Tri-VQA) 框架，該框架從「為什麼這個答案？」的角度構建反向因果問題，以闡明答案的來源並激發更合理的正向推理過程。我們在來自五個中心的內視鏡超音波 (EUS) 多屬性註釋資料集上評估了我們的模型，並在醫學 VQA 資料集上對其進行測試。實驗結果證明了我們的方法優於現有方法。我們的程式碼和預先訓練的模型可在 https://anonymous.4open.science/r/Tri_VQA 取得。", "author": "Lin Fan et.al.", "authors": "Lin Fan, Xun Gong, Cenyang Zheng, Yafei Ou", "id": "2406.15050v1", "paper_url": "http://arxiv.org/abs/2406.15050v1", "repo": "null"}}