{"2412.02869": {"publish_time": "2024-12-03", "title": "Constrained Identifiability of Causal Effects", "paper_summary": "We study the identification of causal effects in the presence of different\ntypes of constraints (e.g., logical constraints) in addition to the causal\ngraph. These constraints impose restrictions on the models (parameterizations)\ninduced by the causal graph, reducing the set of models considered by the\nidentifiability problem. We formalize the notion of constrained\nidentifiability, which takes a set of constraints as another input to the\nclassical definition of identifiability. We then introduce a framework for\ntesting constrained identifiability by employing tractable Arithmetic Circuits\n(ACs), which enables us to accommodate constraints systematically. We show that\nthis AC-based approach is at least as complete as existing algorithms (e.g.,\ndo-calculus) for testing classical identifiability, which only assumes the\nconstraint of strict positivity. We use examples to demonstrate the\neffectiveness of this AC-based approach by showing that unidentifiable causal\neffects may become identifiable under different types of constraints.", "paper_summary_zh": "我們研究在因果圖之外，存在不同類型約束（例如邏輯約束）的情況下，因果效應的識別。這些約束對因果圖所引發的模型（參數化）施加限制，減少識別問題所考慮的模型集。我們將受約束識別的概念形式化，這將一組約束作為可識別性的經典定義的另一個輸入。然後，我們引入一個測試受約束識別的框架，通過使用易於處理的算術電路 (AC) 來實現，這使我們能夠系統地適應約束。我們表明，這種基於 AC 的方法至少與現有的演算法（例如，do 演算）一樣完整，用於測試經典可識別性，這僅假設嚴格正定的約束。我們使用範例來證明基於 AC 的方法的有效性，方法是表明不可識別的因果效應在不同類型的約束下可能變得可識別。", "author": "Yizuo Chen et.al.", "authors": "Yizuo Chen, Adnan Darwiche", "id": "2412.02869v1", "paper_url": "http://arxiv.org/abs/2412.02869v1", "repo": "null"}}