{"2411.14550": {"publish_time": "2024-11-21", "title": "The importance of the clustering model to detect new types of intrusion in data traffic", "paper_summary": "In the current digital age, the volume of data generated by various cyber\nactivities has become enormous and is constantly increasing. The data may\ncontain valuable insights that can be harnessed to improve cyber security\nmeasures. However, much of this data is unclassified and qualitative, which\nposes significant challenges to traditional analysis methods. Clustering\nfacilitates the identification of hidden patterns and structures in data\nthrough grouping similar data points, which makes it simpler to identify and\naddress threats. Clustering can be defined as a data mining (DM) approach,\nwhich uses similarity calculations for dividing a data set into several\ncategories. Hierarchical, density-based, along with partitioning clustering\nalgorithms are typical. The presented work use K-means algorithm, which is a\npopular clustering technique. Utilizing K-means algorithm, we worked with two\ndifferent types of data: first, we gathered data with the use of XG-boost\nalgorithm following completing the aggregation with K-means algorithm. Data was\ngathered utilizing Kali Linux environment, cicflowmeter traffic, and Putty\nSoftware tools with the use of diverse and simple attacks. The concept could\nassist in identifying new attack types, which are distinct from the known\nattacks, and labeling them based on the characteristics they will exhibit, as\nthe dynamic nature regarding cyber threats means that new attack types often\nemerge, for which labeled data might not yet exist. The model counted the\nattacks and assigned numbers to each one of them. Secondly, We tried the same\nwork on the ready data inside the Kaggle repository called (Intrusion Detection\nin Internet of Things Network), and the clustering model worked well and\ndetected the number of attacks correctly as shown in the results section.", "paper_summary_zh": "<paragraph>在當今數位時代，各種網路活動所產生的資料量已變得龐大且持續增加。資料可能包含有價值的見解，可加以利用來改善網路安全措施。然而，這些資料大多未分類且為質性資料，這對傳統分析方法構成重大挑戰。叢集透過將相似資料點分組，進而促進識別資料中隱藏的模式和結構，這使得識別和處理威脅變得更簡單。叢集可定義為一資料探勘 (DM) 方法，該方法使用相似度計算來將資料集劃分為數個類別。階層式、基於密度的分群演算法與分割式分群演算法是常見的。所提出的工作使用 K 平均演算法，這是一種流行的群集技術。利用 K 平均演算法，我們處理了兩種不同類型的資料：首先，我們使用 XG-boost 演算法收集資料，然後使用 K 平均演算法完成匯總。資料是利用 Kali Linux 環境、cicflowmeter 流量和 Putty 軟體工具收集的，並使用多樣且簡單的攻擊。這個概念有助於識別新的攻擊類型，這些攻擊類型不同於已知的攻擊，並根據其所表現出的特徵對其進行標記，因為網路威脅的動態特性表示新的攻擊類型經常出現，而標記資料可能尚未存在。該模型計算了攻擊次數，並為每個攻擊次數指定編號。其次，我們嘗試對 Kaggle 儲存庫中稱為 (物聯網網路中的入侵偵測) 的現成資料進行相同的工作，而群集模型運作良好，並正確偵測到攻擊次數，如結果部分所示。</paragraph>", "author": "Noor Saud Abd et.al.", "authors": "Noor Saud Abd, Kamel Karoui", "id": "2411.14550v1", "paper_url": "http://arxiv.org/abs/2411.14550v1", "repo": "null"}}