{"2410.13510": {"publish_time": "2024-10-17", "title": "GeoCoder: Solving Geometry Problems by Generating Modular Code through Vision-Language Models", "paper_summary": "Geometry problem-solving demands advanced reasoning abilities to process\nmultimodal inputs and employ mathematical knowledge effectively.\nVision-language models (VLMs) have made significant progress in various\nmultimodal tasks. Yet, they still struggle with geometry problems and are\nsignificantly limited by their inability to perform mathematical operations not\nseen during pre-training, such as calculating the cosine of an arbitrary angle,\nand by difficulties in correctly applying relevant geometry formulas. To\novercome these challenges, we present GeoCoder, which leverages modular\ncode-finetuning to generate and execute code using a predefined geometry\nfunction library. By executing the code, we achieve accurate and deterministic\ncalculations, contrasting the stochastic nature of autoregressive token\nprediction, while the function library minimizes errors in formula usage. We\nalso propose a multimodal retrieval-augmented variant of GeoCoder, named\nRAG-GeoCoder, which incorporates a non-parametric memory module for retrieving\nfunctions from the geometry library, thereby reducing reliance on parametric\nmemory. Our modular code-finetuning approach enhances the geometric reasoning\ncapabilities of VLMs, yielding an average improvement of over 16% across\nvarious question complexities on the GeomVerse dataset compared to other\nfinetuning methods.", "paper_summary_zh": "幾何問題求解需要進階推理能力來處理多模態輸入並有效運用數學知識。視覺語言模型 (VLM) 已在各種多模態任務中取得重大進展。然而，它們在幾何問題上仍面臨挑戰，且因無法執行預訓練期間未見過的數學運算（例如計算任意角度的餘弦）以及難以正確套用相關幾何公式而受到顯著限制。為了克服這些挑戰，我們提出了 GeoCoder，它利用模組化程式碼微調來產生和執行程式碼，並使用預先定義的幾何函式庫。透過執行程式碼，我們能達成精確且確定的計算，與自迴歸權杖預測的隨機性質形成對比，而函式庫則能將公式使用中的錯誤降到最低。我們也提出 GeoCoder 的多模態檢索擴充變體，稱為 RAG-GeoCoder，它結合非參數記憶體模組來從幾何函式庫中檢索函式，進而減少對參數記憶體的依賴。我們模組化的程式碼微調方法增強了 VLM 的幾何推理能力，與其他微調方法相比，在 GeomVerse 資料集上各種問題複雜度方面平均提升超過 16%。", "author": "Aditya Sharma et.al.", "authors": "Aditya Sharma, Aman Dalmia, Mehran Kazemi, Amal Zouaq, Christopher J. Pal", "id": "2410.13510v1", "paper_url": "http://arxiv.org/abs/2410.13510v1", "repo": "null"}}