{"2407.09007": {"publish_time": "2024-07-12", "title": "Benchmarking Language Model Creativity: A Case Study on Code Generation", "paper_summary": "As LLMs become increasingly prevalent, it is interesting to consider how\n``creative'' these models can be. From cognitive science, creativity consists\nof at least two key characteristics: \\emph{convergent} thinking (purposefulness\nto achieve a given goal) and \\emph{divergent} thinking (adaptability to new\nenvironments or constraints) \\citep{runco2003critical}. In this work, we\nintroduce a framework for quantifying LLM creativity that incorporates the two\ncharacteristics. This is achieved by (1) Denial Prompting pushes LLMs to come\nup with more creative solutions to a given problem by incrementally imposing\nnew constraints on the previous solution, compelling LLMs to adopt new\nstrategies, and (2) defining and computing the NeoGauge metric which examines\nboth convergent and divergent thinking in the generated creative responses by\nLLMs. We apply the proposed framework on Codeforces problems, a natural data\nsource for collecting human coding solutions. We quantify NeoGauge for various\nproprietary and open-source models and find that even the most creative model,\nGPT-4, still falls short of demonstrating human-like creativity. We also\nexperiment with advanced reasoning strategies (MCTS, self-correction, etc.) and\nobserve no significant improvement in creativity. As a by-product of our\nanalysis, we release NeoCoder dataset for reproducing our results on future\nmodels.", "paper_summary_zh": "隨著 LLM 變得越來越普遍，思考這些模型可以有多「有創意」是一件很有趣的事。從認知科學的角度來看，創意至少包含兩個關鍵特徵：\\emph{收斂}思考（實現特定目標的目標性）和\\emph{發散}思考（適應新環境或限制）\\citep{runco2003critical}。在本文中，我們介紹了一個量化 LLM 創意的框架，其中包含這兩個特徵。這可以透過 (1) 否定提示讓 LLM 透過逐步對先前的解決方案施加新的限制，提出更多有創意的解決方案來解決特定問題，迫使 LLM 採用新的策略，以及 (2) 定義和計算 NeoGauge 指標，它會檢查 LLM 生成的創意回應中的收斂和發散思考。我們在 Codeforces 問題上應用所提出的框架，這是收集人類編碼解決方案的自然資料來源。我們量化了各種專有和開源模型的 NeoGauge，發現即使是最有創意的模型 GPT-4，仍未達到人類般的創意。我們也嘗試了進階推理策略（MCTS、自我修正等），並觀察到創意沒有顯著改善。作為我們分析的副產品，我們發布了 NeoCoder 資料集，以便在未來的模型上重現我們的結果。", "author": "Yining Lu et.al.", "authors": "Yining Lu, Dixuan Wang, Tianjian Li, Dongwei Jiang, Daniel Khashabi", "id": "2407.09007v1", "paper_url": "http://arxiv.org/abs/2407.09007v1", "repo": "null"}}