{"2406.16674": {"publish_time": "2024-06-24", "title": "Computational Approaches to the Detection of Lesser-Known Rhetorical Figures: A Systematic Survey and Research Challenges", "paper_summary": "Rhetorical figures play a major role in our everyday communication as they\nmake text more interesting, more memorable, or more persuasive. Therefore, it\nis important to computationally detect rhetorical figures to fully understand\nthe meaning of a text. We provide a comprehensive overview of computational\napproaches to lesser-known rhetorical figures. We explore the linguistic and\ncomputational perspectives on rhetorical figures, emphasizing their\nsignificance for the domain of Natural Language Processing. We present\ndifferent figures in detail, delving into datasets, definitions, rhetorical\nfunctions, and detection approaches. We identified challenges such as dataset\nscarcity, language limitations, and reliance on rule-based methods.", "paper_summary_zh": "修辭手法在我們的日常溝通中扮演著重要的角色，因為它們讓文字更有趣、更令人難忘或更有說服力。因此，以計算方式偵測修辭手法對於充分理解文字的意義非常重要。我們提供了對較不為人知的修辭手法的計算方法的全面概觀。我們探討了修辭手法的語言學和計算觀點，強調它們對自然語言處理領域的重要性。我們詳細說明了不同的手法，深入探討了資料集、定義、修辭功能和偵測方法。我們發現了資料集稀少、語言限制和依賴基於規則的方法等挑戰。", "author": "Ramona Kühn et.al.", "authors": "Ramona Kühn, Jelena Mitrović, Michael Granitzer", "id": "2406.16674v1", "paper_url": "http://arxiv.org/abs/2406.16674v1", "repo": "null"}}