{"2501.16382": {"publish_time": "2025-01-24", "title": "GraPPI: A Retrieve-Divide-Solve GraphRAG Framework for Large-scale Protein-protein Interaction Exploration", "paper_summary": "Drug discovery (DD) has tremendously contributed to maintaining and improving\npublic health. Hypothesizing that inhibiting protein misfolding can slow\ndisease progression, researchers focus on target identification (Target ID) to\nfind protein structures for drug binding. While Large Language Models (LLMs)\nand Retrieval-Augmented Generation (RAG) frameworks have accelerated drug\ndiscovery, integrating models into cohesive workflows remains challenging. We\nconducted a user study with drug discovery researchers to identify the\napplicability of LLMs and RAGs in Target ID. We identified two main findings:\n1) an LLM should provide multiple Protein-Protein Interactions (PPIs) based on\nan initial protein and protein candidates that have a therapeutic impact; 2)\nthe model must provide the PPI and relevant explanations for better\nunderstanding. Based on these observations, we identified three limitations in\nprevious approaches for Target ID: 1) semantic ambiguity, 2) lack of\nexplainability, and 3) short retrieval units. To address these issues, we\npropose GraPPI, a large-scale knowledge graph (KG)-based retrieve-divide-solve\nagent pipeline RAG framework to support large-scale PPI signaling pathway\nexploration in understanding therapeutic impacts by decomposing the analysis of\nentire PPI pathways into sub-tasks focused on the analysis of PPI edges.", "paper_summary_zh": "药物发现 (DD) 极大地促进了公共卫生的维护和改善。研究人员假设抑制蛋白质错误折叠可以减缓疾病进展，因此专注于靶点识别 (Target ID) 以找到用于药物结合的蛋白质结构。虽然大型语言模型 (LLM) 和检索增强生成 (RAG) 框架加速了药物发现，但将模型整合到内聚工作流中仍然具有挑战性。我们与药物发现研究人员进行了一项用户研究，以确定 LLM 和 RAG 在 Target ID 中的适用性。我们确定了两个主要发现：1) LLM 应该基于初始蛋白质和具有治疗作用的蛋白质候选物提供多个蛋白质-蛋白质相互作用 (PPI)；2) 该模型必须提供 PPI 和相关解释以更好地理解。基于这些观察，我们发现了先前 Target ID 方法中的三个局限性：1) 语义歧义，2) 缺乏可解释性，3) 检索单元短。为了解决这些问题，我们提出了 GraPPI，这是一种基于大规模知识图 (KG) 的检索-分解-求解代理管道 RAG 框架，以支持大规模 PPI 信号通路探索，通过将整个 PPI 通路的分析分解为专注于 PPI 边缘分析的子任务来理解治疗影响。", "author": "Ziwen Li et.al.", "authors": "Ziwen Li, Xiang 'Anthony' Chen, Youngseung Jeon", "id": "2501.16382v1", "paper_url": "http://arxiv.org/abs/2501.16382v1", "repo": "https://github.com/aaronli43/grappi"}}