{"2409.15697": {"publish_time": "2024-09-24", "title": "dnaGrinder: a lightweight and high-capacity genomic foundation model", "paper_summary": "The task of understanding and interpreting the complex information encoded\nwithin genomic sequences remains a grand challenge in biological research and\nclinical applications. In this context, recent advancements in large language\nmodel research have led to the development of both encoder-only and\ndecoder-only foundation models designed to decode intricate information in DNA\nsequences. However, several issues persist, particularly regarding the\nefficient management of long-range dependencies inherent in genomic sequences,\nthe effective representation of nucleotide variations, and the considerable\ncomputational costs associated with large model architectures and extensive\npretraining datasets. Current genomic foundation models often face a critical\ntradeoff: smaller models with mediocre performance versus large models with\nimproved performance. To address these challenges, we introduce dnaGrinder, a\nunique and efficient genomic foundation model. dnaGrinder excels at managing\nlong-range dependencies within genomic sequences while minimizing computational\ncosts without compromising performance. It achieves results that are not just\ncomparable but often superior to leading DNA models such as Nucleotide\nTransformer and DNABERT-2. Furthermore, dnaGrinder is designed for easy\nfine-tuning on workstation-grade GPUs, accommodating input lengths exceeding\n17,000 tokens. On a single high-performance GPU, it supports sequences longer\nthan 140,000 tokens, making it a highly efficient and accessible tool for both\nbasic biological research and clinical applications.", "paper_summary_zh": "理解和詮釋編碼在基因組序列中的複雜資訊，在生物研究和臨床應用中仍是一項重大挑戰。在此背景下，大型語言模型研究的最新進展已導致編碼器專用和解碼器專用基礎模型的開發，旨在解碼 DNA 序列中的複雜資訊。然而，仍存在一些問題，特別是在基因組序列中固有的長距離依賴性的有效管理、核苷酸變異的有效表示，以及與大型模型架構和廣泛預訓練資料集相關的龐大計算成本。目前的基因組基礎模型通常面臨一個關鍵的權衡：效能平庸的小型模型與效能提升的大型模型。為了解決這些挑戰，我們引入了 dnaGrinder，一個獨特且高效的基因組基礎模型。dnaGrinder 擅長管理基因組序列中的長距離依賴性，同時最小化計算成本，而不會損害效能。它所取得的成果不僅與領先的 DNA 模型（例如 Nucleotide Transformer 和 DNABERT-2）相當，而且往往更勝一籌。此外，dnaGrinder 設計為可輕鬆在工作站級 GPU 上進行微調，可容納長度超過 17,000 個符號的輸入。在單一高效能 GPU 上，它支援長度超過 140,000 個符號的序列，使其成為基礎生物研究和臨床應用中高效且易於存取的工具。", "author": "Qihang Zhao et.al.", "authors": "Qihang Zhao, Chi Zhang, Weixiong Zhang", "id": "2409.15697v1", "paper_url": "http://arxiv.org/abs/2409.15697v1", "repo": "null"}}