{"2410.19315": {"publish_time": "2024-10-25", "title": "A prescriptive theory for brain-like inference", "paper_summary": "The Evidence Lower Bound (ELBO) is a widely used objective for training deep\ngenerative models, such as Variational Autoencoders (VAEs). In the neuroscience\nliterature, an identical objective is known as the variational free energy,\nhinting at a potential unified framework for brain function and machine\nlearning. Despite its utility in interpreting generative models, including\ndiffusion models, ELBO maximization is often seen as too broad to offer\nprescriptive guidance for specific architectures in neuroscience or machine\nlearning. In this work, we show that maximizing ELBO under Poisson assumptions\nfor general sequence data leads to a spiking neural network that performs\nBayesian posterior inference through its membrane potential dynamics. The\nresulting model, the iterative Poisson VAE (iP-VAE), has a closer connection to\nbiological neurons than previous brain-inspired predictive coding models based\non Gaussian assumptions. Compared to amortized and iterative VAEs, iP-VAElearns\nsparser representations and exhibits superior generalization to\nout-of-distribution samples. These findings suggest that optimizing ELBO,\ncombined with Poisson assumptions, provides a solid foundation for developing\nprescriptive theories in NeuroAI.", "paper_summary_zh": "證據下限 (ELBO) 是訓練深度生成模型（例如變異自動編碼器 (VAE)）時廣泛使用的目標。在神經科學文獻中，一個相同的目標稱為變異自由能，暗示了大腦功能和機器學習的潛在統一框架。儘管 ELBO 最大化在解釋生成模型（包括擴散模型）方面很有用，但它通常被視為太廣泛，無法為神經科學或機器學習中的特定架構提供規範指導。在這項工作中，我們表明在一般序列資料的泊松假設下最大化 ELBO 會導致一個尖峰神經網路，它透過其膜電位動態執行貝氏後驗推論。由此產生的模型，即迭代泊松 VAE (iP-VAE)，與基於高斯假設的先前受大腦啟發的預測編碼模型相比，與生物神經元有更緊密的聯繫。與攤銷和迭代 VAE 相比，iP-VAE 學習更稀疏的表示，並對分布外樣本表現出優異的泛化能力。這些發現表明，優化 ELBO，結合泊松假設，為在 NeuroAI 中開發規範理論提供了堅實的基礎。", "author": "Hadi Vafaii et.al.", "authors": "Hadi Vafaii, Dekel Galor, Jacob L. Yates", "id": "2410.19315v1", "paper_url": "http://arxiv.org/abs/2410.19315v1", "repo": "null"}}