{"2406.07886": {"publish_time": "2024-06-12", "title": "Label-aware Hard Negative Sampling Strategies with Momentum Contrastive Learning for Implicit Hate Speech Detection", "paper_summary": "Detecting implicit hate speech that is not directly hateful remains a\nchallenge. Recent research has attempted to detect implicit hate speech by\napplying contrastive learning to pre-trained language models such as BERT and\nRoBERTa, but the proposed models still do not have a significant advantage over\ncross-entropy loss-based learning. We found that contrastive learning based on\nrandomly sampled batch data does not encourage the model to learn hard negative\nsamples. In this work, we propose Label-aware Hard Negative sampling strategies\n(LAHN) that encourage the model to learn detailed features from hard negative\nsamples, instead of naive negative samples in random batch, using\nmomentum-integrated contrastive learning. LAHN outperforms the existing models\nfor implicit hate speech detection both in- and cross-datasets. The code is\navailable at https://github.com/Hanyang-HCC-Lab/LAHN", "paper_summary_zh": "偵測非直接仇恨的隱含仇恨言論仍然是一項挑戰。最近的研究嘗試透過將對比學習應用於預先訓練的語言模型，例如 BERT 和 RoBERTa，來偵測隱含仇恨言論，但所提出的模型在基於交叉熵損失的學習上仍沒有顯著優勢。我們發現，基於隨機取樣批次資料的對比學習並不會鼓勵模型學習困難的負面樣本。在這項工作中，我們提出標籤感知困難負面取樣策略 (LAHN)，使用動量整合對比學習，鼓勵模型從困難的負面樣本中學習詳細特徵，而不是隨機批次中的單純負面樣本。LAHN 在隱含仇恨言論偵測上優於現有模型，無論是在資料集內還是跨資料集。程式碼可在 https://github.com/Hanyang-HCC-Lab/LAHN 取得", "author": "Jaehoon Kim et.al.", "authors": "Jaehoon Kim, Seungwan Jin, Sohyun Park, Someen Park, Kyungsik Han", "id": "2406.07886v1", "paper_url": "http://arxiv.org/abs/2406.07886v1", "repo": "https://github.com/hanyang-hcc-lab/lahn"}}