{"2407.02147": {"publish_time": "2024-07-02", "title": "LlamAr & GemmAr: Enhancing LLMs Through Arabic Instruction-Tuning", "paper_summary": "Large language models (LLMs) have greatly impacted the natural language\nprocessing (NLP) field, particularly for the English language. These models\nhave demonstrated capabilities in understanding and generating human-like text.\nThe success of language models largely depends on the availability of\nhigh-quality instruction datasets, which consist of detailed task descriptions\nand corresponding responses that are essential for training the models to\naccurately address a variety of prompts. However, the availability and quality\nof these resources vary by language. While models perform well in English, they\noften struggle with languages like Arabic, due to the lack of datasets for\nfine-tuning Arabic-specific tasks. To address this issue, we introduce\nInstAr-500k, a new Arabic instruction dataset created by generating and\ncollecting content that covers several domains and instruction types. We then\nassess this dataset by fine-tuning two open-source models, Llama-3-8B-Instruct\nand Gemma-7B-IT, on several downstream tasks to scale improvements in their\nfunctionality. Based on multiple evaluations, our fine-tuned models achieve\nstate-of-the-art performance on several Arabic NLP benchmarks. These outcomes\nemphasize the effectiveness of our dataset in elevating the capabilities of\nlanguage models for Arabic. Our instruction dataset bridges the performance gap\nbetween English and Arabic language models by providing resources that amplify\nArabic NLP development. Building on this foundation, we developed two\nstate-of-the-art models, LlamAr-8B and GemmAr-7B, which are specifically tuned\nto excel at a wide range of Arabic NLP tasks.", "paper_summary_zh": "大型語言模型 (LLM) 極大地影響了自然語言處理 (NLP) 領域，特別是對英語而言。這些模型已證明在理解和產生類人文本方面具有能力。語言模型的成功在很大程度上取決於高品質教學資料集的可用性，其中包含詳細的任務說明和相應的回應，這些說明和回應對於訓練模型以準確處理各種提示至關重要。然而，這些資源的可用性和品質因語言而異。儘管模型在英語方面表現良好，但由於缺乏用於微調阿拉伯語特定任務的資料集，它們通常難以處理阿拉伯語等語言。為了解決這個問題，我們引入了 InstAr-500k，這是一個新的阿拉伯語教學資料集，它是透過產生和收集涵蓋多個領域和教學類型的內容而建立的。然後，我們透過微調兩個開源模型，即 Llama-3-8B-Instruct 和 Gemma-7B-IT，在幾個下游任務中評估這個資料集，以擴展其功能的改進。根據多項評估，我們微調的模型在幾個阿拉伯語 NLP 基準上達到了最先進的效能。這些結果強調了我們的資料集在提升阿拉伯語語言模型能力方面的有效性。我們的教學資料集透過提供擴大阿拉伯語 NLP 開發的資源，彌補了英語和阿拉伯語語言模型之間的效能差距。在此基礎上，我們開發了兩個最先進的模型，即 LlamAr-8B 和 GemmAr-7B，它們經過特別調整，可以在廣泛的阿拉伯語 NLP 任務中表現出色。", "author": "Hasna Chouikhi et.al.", "authors": "Hasna Chouikhi, Manel Aloui, Cyrine Ben Hammou, Ghaith Chaabane, Haithem Kchaou, Chehir Dhaouadi", "id": "2407.02147v1", "paper_url": "http://arxiv.org/abs/2407.02147v1", "repo": "null"}}