{"2409.05484": {"publish_time": "2024-09-09", "title": "CRADLE-VAE: Enhancing Single-Cell Gene Perturbation Modeling with Counterfactual Reasoning-based Artifact Disentanglement", "paper_summary": "Predicting cellular responses to various perturbations is a critical focus in\ndrug discovery and personalized therapeutics, with deep learning models playing\na significant role in this endeavor. Single-cell datasets contain technical\nartifacts that may hinder the predictability of such models, which poses\nquality control issues highly regarded in this area. To address this, we\npropose CRADLE-VAE, a causal generative framework tailored for single-cell gene\nperturbation modeling, enhanced with counterfactual reasoning-based artifact\ndisentanglement. Throughout training, CRADLE-VAE models the underlying latent\ndistribution of technical artifacts and perturbation effects present in\nsingle-cell datasets. It employs counterfactual reasoning to effectively\ndisentangle such artifacts by modulating the latent basal spaces and learns\nrobust features for generating cellular response data with improved quality.\nExperimental results demonstrate that this approach improves not only treatment\neffect estimation performance but also generative quality as well. The\nCRADLE-VAE codebase is publicly available at\nhttps://github.com/dmis-lab/CRADLE-VAE.", "paper_summary_zh": "預測細胞對各種擾動的反應在藥物發現和個人化治療中是一個重要的重點，深度學習模型在這個努力中扮演著重要的角色。單細胞數據集包含可能阻礙此類模型可預測性的技術性人工製品，這對這個領域高度重視的品質控管議題構成挑戰。為了解決這個問題，我們提出 CRADLE-VAE，一個專為單細胞基因擾動建模量身打造的因果生成架構，並透過反事實推理為基礎的人工製品去糾纏而增強。在整個訓練過程中，CRADLE-VAE 對單細胞數據集中技術性人工製品和擾動效應的潛在分佈進行建模。它採用反事實推理，透過調整潛在基礎空間來有效地去糾纏這些人工製品，並學習強健特徵，以生成品質更好的細胞反應數據。實驗結果證明，這種方法不僅改善了治療效果估計的效能，也改善了生成品質。CRADLE-VAE 碼庫已公開於 https://github.com/dmis-lab/CRADLE-VAE。", "author": "Seungheun Baek et.al.", "authors": "Seungheun Baek, Soyon Park, Yan Ting Chok, Junhyun Lee, Jueon Park, Mogan Gim, Jaewoo Kang", "id": "2409.05484v1", "paper_url": "http://arxiv.org/abs/2409.05484v1", "repo": "null"}}