{"2502.13909": {"publish_time": "2025-02-19", "title": "Lost in Sequence: Do Large Language Models Understand Sequential Recommendation?", "paper_summary": "Large Language Models (LLMs) have recently emerged as promising tools for\nrecommendation thanks to their advanced textual understanding ability and\ncontext-awareness. Despite the current practice of training and evaluating\nLLM-based recommendation (LLM4Rec) models under a sequential recommendation\nscenario, we found that whether these models understand the sequential\ninformation inherent in users' item interaction sequences has been largely\noverlooked. In this paper, we first demonstrate through a series of experiments\nthat existing LLM4Rec models do not fully capture sequential information both\nduring training and inference. Then, we propose a simple yet effective\nLLM-based sequential recommender, called LLM-SRec, a method that enhances the\nintegration of sequential information into LLMs by distilling the user\nrepresentations extracted from a pre-trained CF-SRec model into LLMs. Our\nextensive experiments show that LLM-SRec enhances LLMs' ability to understand\nusers' item interaction sequences, ultimately leading to improved\nrecommendation performance. Furthermore, unlike existing LLM4Rec models that\nrequire fine-tuning of LLMs, LLM-SRec achieves state-of-the-art performance by\ntraining only a few lightweight MLPs, highlighting its practicality in\nreal-world applications. Our code is available at\nhttps://github.com/Sein-Kim/LLM-SRec.", "paper_summary_zh": "大型語言模型 (LLM) 最近因其先進的文本理解能力和情境感知能力而成為推薦的潛力工具。儘管目前在順序推薦情境下訓練和評估 LLM 為基礎的推薦 (LLM4Rec) 模型的作法，我們發現這些模型是否理解使用者項目互動順序中固有的順序資訊在很大程度上被忽略了。在本文中，我們首先透過一系列實驗證明現有的 LLM4Rec 模型在訓練和推論期間並未完全擷取順序資訊。然後，我們提出一個簡單但有效的 LLM 為基礎的順序推薦器，稱為 LLM-SRec，一種透過將從預先訓練的 CF-SRec 模型中萃取的使用者表徵萃取到 LLM 中來增強順序資訊整合到 LLM 的方法。我們廣泛的實驗顯示 LLM-SRec 增強了 LLM 理解使用者項目互動順序的能力，最終導致推薦效能提升。此外，與需要微調 LLM 的現有 LLM4Rec 模型不同，LLM-SRec 透過僅訓練少數輕量級 MLP 來達成最先進的效能，突顯其在真實世界應用中的實用性。我們的程式碼可於 https://github.com/Sein-Kim/LLM-SRec 取得。", "author": "Sein Kim et.al.", "authors": "Sein Kim, Hongseok Kang, Kibum Kim, Jiwan Kim, Donghyun Kim, Minchul Yang, Kwangjin Oh, Julian McAuley, Chanyoung Park", "id": "2502.13909v1", "paper_url": "http://arxiv.org/abs/2502.13909v1", "repo": "null"}}