{"2412.05161": {"publish_time": "2024-12-06", "title": "DNF: Unconditional 4D Generation with Dictionary-based Neural Fields", "paper_summary": "While remarkable success has been achieved through diffusion-based 3D\ngenerative models for shapes, 4D generative modeling remains challenging due to\nthe complexity of object deformations over time. We propose DNF, a new 4D\nrepresentation for unconditional generative modeling that efficiently models\ndeformable shapes with disentangled shape and motion while capturing\nhigh-fidelity details in the deforming objects. To achieve this, we propose a\ndictionary learning approach to disentangle 4D motion from shape as neural\nfields. Both shape and motion are represented as learned latent spaces, where\neach deformable shape is represented by its shape and motion global latent\ncodes, shape-specific coefficient vectors, and shared dictionary information.\nThis captures both shape-specific detail and global shared information in the\nlearned dictionary. Our dictionary-based representation well balances fidelity,\ncontiguity and compression -- combined with a transformer-based diffusion\nmodel, our method is able to generate effective, high-fidelity 4D animations.", "paper_summary_zh": "儘管在形狀的基於擴散的 3D 生成模型中獲得了顯著的成功，但由於物件隨時間變形的複雜性，4D 生成模型仍然具有挑戰性。我們提出 DNF，這是一種新的 4D 表示法，用於無條件生成模型，該模型有效地對可變形形狀進行建模，同時分離形狀和運動，並捕捉變形物件中的高保真細節。為實現此目的，我們提出了一種字典學習方法，將 4D 運動從形狀中分離出來，作為神經場。形狀和運動都表示為學習到的潛在空間，其中每個可變形形狀由其形狀和運動全局潛在代碼、特定於形狀的係數向量和共享字典資訊表示。這會捕捉學習到的字典中的特定於形狀的細節和全局共享資訊。我們基於字典的表示很好地平衡了保真度、連續性和壓縮性——結合基於Transformer的擴散模型，我們的方法能夠生成有效的高保真 4D 動畫。", "author": "Xinyi Zhang et.al.", "authors": "Xinyi Zhang, Naiqi Li, Angela Dai", "id": "2412.05161v1", "paper_url": "http://arxiv.org/abs/2412.05161v1", "repo": "null"}}