{"2501.14506": {"publish_time": "2025-01-24", "title": "WanJuanSiLu: A High-Quality Open-Source Webtext Dataset for Low-Resource Languages", "paper_summary": "This paper introduces the open-source dataset WanJuanSiLu, designed to\nprovide high-quality training corpora for low-resource languages, thereby\nadvancing the research and development of multilingual models. To achieve this,\nwe have developed a systematic data processing framework tailored for\nlow-resource languages. This framework encompasses key stages such as data\nextraction, corpus cleaning, content deduplication, security filtering, quality\nevaluation, and theme classification. Through the implementation of this\nframework, we have significantly improved both the quality and security of the\ndataset, while maintaining its linguistic diversity. As of now, data for all\nfive languages have been fully open-sourced. The dataset can be accessed at\nhttps://opendatalab.com/applyMultilingualCorpus, and GitHub repository is\navailable at https://github.com/opendatalab/WanJuan3.0", "paper_summary_zh": "本文介紹了開源資料集 WanJuanSiLu，其設計目的是為低資源語言提供高品質的訓練語料庫，進而推動多語言模型的研究與開發。為此，我們開發了一個系統性的資料處理架構，專門針對低資源語言。此架構包含資料萃取、語料庫清理、內容去重、安全性過濾、品質評估和主題分類等主要階段。透過實作此架構，我們大幅提升了資料集的品質和安全性，同時維持其語言的多樣性。目前，所有五種語言的資料都已完全開源。可在 https://opendatalab.com/applyMultilingualCorpus 存取資料集，GitHub 儲存庫可於 https://github.com/opendatalab/WanJuan3.0 取得", "author": "Jia Yu et.al.", "authors": "Jia Yu, Fei Yuan, Rui Min, Jing Yu, Pei Chu, Jiayang Li, Wei Li, Ruijie Zhang, Zhenxiang Li, Zhifei Ren, Dong Zheng, Wenjian Zhang, Yan Teng, Lingyu Meng, ZhenJiang Jin, Jiantao Qiu, ShaSha Wang, Zhongying Tu, Dahua Lin, Yu Wang, Yu Qiao, Yanfeng Wang, Conghui He", "id": "2501.14506v1", "paper_url": "http://arxiv.org/abs/2501.14506v1", "repo": "null"}}