{"2412.00573": {"publish_time": "2024-11-30", "title": "Opus: A Large Work Model for Complex Workflow Generation", "paper_summary": "This paper introduces Opus, a novel framework for generating and optimizing\nWorkflows tailored to complex Business Process Outsourcing (BPO) use cases,\nfocusing on cost reduction and quality enhancement while adhering to\nestablished industry processes and operational constraints. Our approach\ngenerates executable Workflows from Intention, defined as the alignment of\nClient Input, Client Output, and Process Context. These Workflows are\nrepresented as Directed Acyclic Graphs (DAGs), with nodes as Tasks consisting\nof sequences of executable Instructions, including tools and human expert\nreviews. We adopt a two-phase methodology: Workflow Generation and Workflow\nOptimization. In the Generation phase, Workflows are generated using a Large\nWork Model (LWM) informed by a Work Knowledge Graph (WKG) that encodes\ndomain-specific procedural and operational knowledge. In the Optimization\nphase, Workflows are transformed into Workflow Graphs (WFGs), where optimal\nWorkflows are determined through path optimization. Our experiments demonstrate\nthat state-of-the-art Large Language Models (LLMs) face challenges in reliably\nretrieving detailed process data as well as generating industry-compliant\nworkflows. The key contributions of this paper include: - The integration of a\nWork Knowledge Graph (WKG) into a Large Work Model (LWM), enabling the\ngeneration of context-aware, semantically aligned, structured and auditable\nWorkflows. - A two-phase approach that combines Workflow Generation from\nIntention with graph-based Workflow Optimization. - Opus Alpha 1 Large and Opus\nAlpha 1 Small, models that outperform state-of-the-art LLMs by 38\\% and 29\\%\nrespectively in Workflow Generation for a Medical Coding use case.", "paper_summary_zh": "<paragraph>這篇論文介紹了 Opus，一個用於產生和最佳化工作流程的新穎架構，專為複雜的業務流程外包 (BPO) 使用案例而設計，專注於在遵守既定的產業流程和營運限制的情況下，降低成本並提升品質。我們的做法是根據意圖產生可執行的工作流程，定義為客戶輸入、客戶輸出和流程背景的一致性。這些工作流程表示為有向無環圖 (DAG)，其中節點為任務，包含可執行指令的順序，包括工具和人類專家審查。我們採用兩階段方法：工作流程產生和工作流程最佳化。在產生階段，工作流程使用大型工作模型 (LWM) 產生，該模型由編碼特定領域程序和運作知識的工作知識圖 (WKG) 提供資訊。在最佳化階段，工作流程轉換為工作流程圖 (WFG)，其中最佳工作流程透過路徑最佳化來確定。我們的實驗證明，最先進的大語言模型 (LLM) 在可靠地擷取詳細的流程資料以及產生符合產業規範的工作流程方面面臨挑戰。本文的主要貢獻包括：- 將工作知識圖 (WKG) 整合到大型工作模型 (LWM) 中，讓產生有脈絡感知、語意對齊、結構化且可稽核的工作流程成為可能。- 一種結合意圖工作流程產生與基於圖形的工作流程最佳化的兩階段方法。- Opus Alpha 1 大型和 Opus Alpha 1 小型，在醫療編碼使用案例中，其工作流程產生表現分別優於最先進的 LLM 38% 和 29%。</paragraph>", "author": "Théo Fagnoni et.al.", "authors": "Théo Fagnoni, Bellinda Mesbah, Mahsun Altin, Phillip Kingston", "id": "2412.00573v1", "paper_url": "http://arxiv.org/abs/2412.00573v1", "repo": "null"}}