{"2406.11617": {"publish_time": "2024-06-17", "title": "DELLA-Merging: Reducing Interference in Model Merging through Magnitude-Based Sampling", "paper_summary": "With the proliferation of domain-specific models, model merging has emerged\nas a set of techniques that combine the capabilities of multiple models into\none that can multitask without the cost of additional training. In this paper,\nwe propose a new model merging technique, Drop and rEscaLe via sampLing with\nmAgnitude (DELLA-Merging), that employs a novel pruning technique, MAGPRUNE,\nwhich shows significant advantages over DARE and TIES. MAGPRUNE first ranks the\nparameters in order of their magnitude and assigns higher dropout probabilities\n(p) to parameters with lower ranks corresponding to lower magnitudes. To\napproximate the original embeddings, MAGPRUNE employs a rescaling operation on\nthe parameters that survive the random dropping by 1/(1 - p). On three\ndifferent expert models considered for merging (LM, Math, Code) and\ncorresponding benchmark datasets (AlpacaEval, GSM8K, MBPP), DELLA shows an\naverage improvement of 2.4 points over baseline methods employing delta\nparameter pruning (an improvement of 3.6 points over TIES, 1.2 points over\nDARE), and 11.1 points over the no-pruning baseline (TA). We release the source\ncode at: https://github.com/declare-lab/della.", "paper_summary_zh": "隨著特定領域模型的激增，模型合併已成為一組技術，它將多個模型的功能結合到一個模型中，而無需額外訓練成本即可執行多任務。在本文中，我們提出了一種新的模型合併技術，即通過具有幅度的採樣進行刪除和縮放 (DELLA-Merging)，它採用了一種新穎的剪枝技術 MAGPRUNE，與 DARE 和 TIES 相比，它顯示出顯著的優勢。MAGPRUNE 首先按幅度對參數進行排序，並將較高的中斷機率 (p) 分配給幅度較低、對應於較低幅度的參數。為了近似原始嵌入，MAGPRUNE 對通過 1/(1 - p) 隨機刪除而存活的參數採用縮放操作。對於合併考慮的三個不同的專家模型 (LM、Math、Code) 和對應的基準資料集 (AlpacaEval、GSM8K、MBPP)，DELLA 顯示比採用 delta 參數剪枝的基本方法平均提高 2.4 分（比 TIES 提高 3.6 分，比 DARE 提高 1.2 分），並且比不剪枝的基本線 (TA) 高 11.1 分。我們在以下位置釋出原始碼：https://github.com/declare-lab/della。", "author": "Pala Tej Deep et.al.", "authors": "Pala Tej Deep, Rishabh Bhardwaj, Soujanya Poria", "id": "2406.11617v1", "paper_url": "http://arxiv.org/abs/2406.11617v1", "repo": "https://github.com/declare-lab/della"}}