{"2405.20279": {"publish_time": "2024-05-30", "title": "CV-VAE: A Compatible Video VAE for Latent Generative Video Models", "paper_summary": "Spatio-temporal compression of videos, utilizing networks such as Variational\nAutoencoders (VAE), plays a crucial role in OpenAI's SORA and numerous other\nvideo generative models. For instance, many LLM-like video models learn the\ndistribution of discrete tokens derived from 3D VAEs within the VQVAE\nframework, while most diffusion-based video models capture the distribution of\ncontinuous latent extracted by 2D VAEs without quantization. The temporal\ncompression is simply realized by uniform frame sampling which results in\nunsmooth motion between consecutive frames. Currently, there lacks of a\ncommonly used continuous video (3D) VAE for latent diffusion-based video models\nin the research community. Moreover, since current diffusion-based approaches\nare often implemented using pre-trained text-to-image (T2I) models, directly\ntraining a video VAE without considering the compatibility with existing T2I\nmodels will result in a latent space gap between them, which will take huge\ncomputational resources for training to bridge the gap even with the T2I models\nas initialization. To address this issue, we propose a method for training a\nvideo VAE of latent video models, namely CV-VAE, whose latent space is\ncompatible with that of a given image VAE, e.g., image VAE of Stable Diffusion\n(SD). The compatibility is achieved by the proposed novel latent space\nregularization, which involves formulating a regularization loss using the\nimage VAE. Benefiting from the latent space compatibility, video models can be\ntrained seamlessly from pre-trained T2I or video models in a truly\nspatio-temporally compressed latent space, rather than simply sampling video\nframes at equal intervals. With our CV-VAE, existing video models can generate\nfour times more frames with minimal finetuning. Extensive experiments are\nconducted to demonstrate the effectiveness of the proposed video VAE.", "paper_summary_zh": "時空影片壓縮，利用變異自編碼器 (VAE) 等網路，在 OpenAI 的 SORA 和許多其他影片生成模型中扮演關鍵角色。例如，許多類似 LLM 的影片模型會在 VQVAE 架構中學習源自 3D VAE 的離散代碼的分布，而大多數基於擴散的影片模型會擷取未經量化的 2D VAE 萃取的連續潛在分布。時序壓縮僅透過均勻的影格取樣實現，這會導致連續影格之間的動作不順暢。目前，研究社群中缺乏一個普遍使用的連續影片 (3D) VAE，可供潛在擴散式影片模型使用。此外，由於目前的基於擴散的方法通常使用預先訓練好的文字轉影像 (T2I) 模型實作，直接訓練影片 VAE 而未考量與現有 T2I 模型的相容性，將導致它們之間的潛在空間差距，即使使用 T2I 模型作為初始化，填補差距仍需耗費龐大的運算資源進行訓練。為了解決這個問題，我們提出一個用於訓練潛在影片模型的影片 VAE 的方法，即 CV-VAE，其潛在空間與給定的影像 VAE 相容，例如 Stable Diffusion (SD) 的影像 VAE。相容性是透過提出的新穎潛在空間正則化實現的，其中涉及使用影像 VAE 制定正則化損失。受益於潛在空間相容性，影片模型可以從預先訓練好的 T2I 或影片模型在真正的時空壓縮潛在空間中無縫訓練，而不用僅以相等的間隔取樣影片影格。透過我們的 CV-VAE，現有的影片模型可以產生多四倍的影格，微調幅度極小。我們進行了廣泛的實驗，以證明所提出的影片 VAE 的有效性。", "author": "Sijie Zhao et.al.", "authors": "Sijie Zhao, Yong Zhang, Xiaodong Cun, Shaoshu Yang, Muyao Niu, Xiaoyu Li, Wenbo Hu, Ying Shan", "id": "2405.20279v1", "paper_url": "http://arxiv.org/abs/2405.20279v1", "repo": "https://github.com/ailab-cvc/cv-vae"}}