{"2411.08785": {"publish_time": "2024-11-13", "title": "Zero-shot Cross-lingual Transfer Learning with Multiple Source and Target Languages for Information Extraction: Language Selection and Adversarial Training", "paper_summary": "The majority of previous researches addressing multi-lingual IE are limited\nto zero-shot cross-lingual single-transfer (one-to-one) setting, with\nhigh-resource languages predominantly as source training data. As a result,\nthese works provide little understanding and benefit for the realistic goal of\ndeveloping a multi-lingual IE system that can generalize to as many languages\nas possible. Our study aims to fill this gap by providing a detailed analysis\non Cross-Lingual Multi-Transferability (many-to-many transfer learning), for\nthe recent IE corpora that cover a diverse set of languages. Specifically, we\nfirst determine the correlation between single-transfer performance and a wide\nrange of linguistic-based distances. From the obtained insights, a combined\nlanguage distance metric can be developed that is not only highly correlated\nbut also robust across different tasks and model scales. Next, we investigate\nthe more general zero-shot multi-lingual transfer settings where multiple\nlanguages are involved in the training and evaluation processes. Language\nclustering based on the newly defined distance can provide directions for\nachieving the optimal cost-performance trade-off in data (languages) selection\nproblem. Finally, a relational-transfer setting is proposed to further\nincorporate multi-lingual unlabeled data based on adversarial training using\nthe relation induced from the above linguistic distance.", "paper_summary_zh": "過去針對多語言資訊萃取（IE）的研究多半侷限於零次學習跨語言單一轉移（一對一）的設定，且以資源豐富的語言作為來源訓練資料。因此，這些研究對於開發一個能盡可能推廣至多種語言的多語言 IE 系統這個實際目標，幾乎沒有提供理解或幫助。我們的研究旨在透過提供對跨語言多重可轉移性（多對多轉移學習）的詳細分析，來填補這個缺口，以涵蓋各種語言的近期 IE 語料庫。具體來說，我們首先確定單一轉移效能與各種基於語言的距離之間的關聯性。從獲得的見解中，可以開發出一種綜合語言距離指標，不僅高度相關，而且在不同的任務和模型規模中也很穩健。接下來，我們研究更通用的零次學習多語言轉移設定，其中多種語言參與訓練和評估過程。根據新定義的距離進行語言群集，可以提供在資料（語言）選擇問題中達成最佳成本效益權衡的方向。最後，提出了一個關係轉移設定，以進一步根據對抗式訓練中從上述語言距離中推導出的關係，來納入多語言未標記資料。", "author": "Nghia Trung Ngo et.al.", "authors": "Nghia Trung Ngo, Thien Huu Nguyen", "id": "2411.08785v1", "paper_url": "http://arxiv.org/abs/2411.08785v1", "repo": "null"}}