{"2408.06327": {"publish_time": "2024-08-12", "title": "VisualAgentBench: Towards Large Multimodal Models as Visual Foundation Agents", "paper_summary": "Large Multimodal Models (LMMs) have ushered in a new era in artificial\nintelligence, merging capabilities in both language and vision to form highly\ncapable Visual Foundation Agents. These agents are postulated to excel across a\nmyriad of tasks, potentially approaching general artificial intelligence.\nHowever, existing benchmarks fail to sufficiently challenge or showcase the\nfull potential of LMMs in complex, real-world environments. To address this\ngap, we introduce VisualAgentBench (VAB), a comprehensive and pioneering\nbenchmark specifically designed to train and evaluate LMMs as visual foundation\nagents across diverse scenarios, including Embodied, Graphical User Interface,\nand Visual Design, with tasks formulated to probe the depth of LMMs'\nunderstanding and interaction capabilities. Through rigorous testing across\nnine proprietary LMM APIs and eight open models, we demonstrate the\nconsiderable yet still developing agent capabilities of these models.\nAdditionally, VAB constructs a trajectory training set constructed through\nhybrid methods including Program-based Solvers, LMM Agent Bootstrapping, and\nHuman Demonstrations, promoting substantial performance improvements in LMMs\nthrough behavior cloning. Our work not only aims to benchmark existing models\nbut also provides a solid foundation for future development into visual\nfoundation agents. Code, train \\& test data, and part of fine-tuned open LMMs\nare available at \\url{https://github.com/THUDM/VisualAgentBench}.", "paper_summary_zh": "大型多模態模型 (LMM) 開啟了人工智慧的新紀元，結合語言和視覺能力，形成功能強大的視覺基礎代理。這些代理被假設可以在無數任務中表現出色，潛在地接近一般人工智慧。然而，現有的基準未能充分挑戰或展示 LMM 在複雜的現實環境中的全部潛力。為了解決這個差距，我們引入了 VisualAgentBench (VAB)，一個全面且開創性的基準，專門設計用於訓練和評估 LMM 作為視覺基礎代理，涵蓋各種場景，包括具身、圖形使用者介面和視覺設計，任務旨在探討 LMM 的理解和互動能力的深度。透過對九個專有 LMM API 和八個開放模型進行嚴格測試，我們展示了這些模型相當大但仍在發展的代理能力。此外，VAB 構建了一個通過混合方法構建的軌跡訓練集，包括基於程式的求解器、LMM 代理自舉和人類示範，透過行為複製提升 LMM 的顯著效能。我們的研究不僅旨在評量現有模型，也為未來發展成視覺基礎代理奠定了穩固的基礎。程式碼、訓練和測試資料，以及部分微調的開放 LMM 可在 \\url{https://github.com/THUDM/VisualAgentBench} 取得。", "author": "Xiao Liu et.al.", "authors": "Xiao Liu, Tianjie Zhang, Yu Gu, Iat Long Iong, Yifan Xu, Xixuan Song, Shudan Zhang, Hanyu Lai, Xinyi Liu, Hanlin Zhao, Jiadai Sun, Xinyue Yang, Yu Yang, Zehan Qi, Shuntian Yao, Xueqiao Sun, Siyi Cheng, Qinkai Zheng, Hao Yu, Hanchen Zhang, Wenyi Hong, Ming Ding, Lihang Pan, Xiaotao Gu, Aohan Zeng, Zhengxiao Du, Chan Hee Song, Yu Su, Yuxiao Dong, Jie Tang", "id": "2408.06327v1", "paper_url": "http://arxiv.org/abs/2408.06327v1", "repo": "https://github.com/thudm/visualagentbench"}}