{"2412.09328": {"publish_time": "2024-12-12", "title": "Auto-Regressive Moving Diffusion Models for Time Series Forecasting", "paper_summary": "Time series forecasting (TSF) is essential in various domains, and recent\nadvancements in diffusion-based TSF models have shown considerable promise.\nHowever, these models typically adopt traditional diffusion patterns, treating\nTSF as a noise-based conditional generation task. This approach neglects the\ninherent continuous sequential nature of time series, leading to a fundamental\nmisalignment between diffusion mechanisms and the TSF objective, thereby\nseverely impairing performance. To bridge this misalignment, and inspired by\nthe classic Auto-Regressive Moving Average (ARMA) theory, which views time\nseries as continuous sequential progressions evolving from previous data\npoints, we propose a novel Auto-Regressive Moving Diffusion (ARMD) model to\nfirst achieve the continuous sequential diffusion-based TSF. Unlike previous\nmethods that start from white Gaussian noise, our model employs chain-based\ndiffusion with priors, accurately modeling the evolution of time series and\nleveraging intermediate state information to improve forecasting accuracy and\nstability. Specifically, our approach reinterprets the diffusion process by\nconsidering future series as the initial state and historical series as the\nfinal state, with intermediate series generated using a sliding-based technique\nduring the forward process. This design aligns the diffusion model's sampling\nprocedure with the forecasting objective, resulting in an unconditional,\ncontinuous sequential diffusion TSF model. Extensive experiments conducted on\nseven widely used datasets demonstrate that our model achieves state-of-the-art\nperformance, significantly outperforming existing diffusion-based TSF models.\nOur code is available on GitHub: https://github.com/daxin007/ARMD.", "paper_summary_zh": "時間序列預測 (TSF) 在各種領域中至關重要，而基於擴散的 TSF 模型最近的進展已展現出相當大的前景。\n然而，這些模型通常採用傳統的擴散模式，將 TSF 視為基於雜訊的條件生成任務。這種方法忽略了時間序列固有的連續序列性質，導致擴散機制與 TSF 目標之間的基本錯位，從而嚴重損害了效能。為了彌合這種錯位，並受到經典自迴歸移動平均線 (ARMA) 理論的啟發，該理論將時間序列視為從先前資料點演變而來的連續序列進程，我們提出了一種新穎的自迴歸移動擴散 (ARMD) 模型，以首先實現連續序列基於擴散的 TSF。與從白色高斯雜訊開始的先前方法不同，我們的模型採用具有先驗的基於鏈的擴散，準確地模擬時間序列的演變，並利用中間狀態資訊來提高預測準確性和穩定性。具體來說，我們的做法透過將未來序列視為初始狀態，將歷史序列視為最終狀態，並在前進過程中使用基於滑動的技術產生中間序列，重新詮釋擴散過程。此設計將擴散模型的取樣程序與預測目標對齊，產生無條件、連續序列擴散 TSF 模型。在七個廣泛使用的資料集上進行的廣泛實驗表明，我們的模型達到了最先進的效能，顯著優於現有的基於擴散的 TSF 模型。我們的程式碼可在 GitHub 上取得：https://github.com/daxin007/ARMD。", "author": "Jiaxin Gao et.al.", "authors": "Jiaxin Gao, Qinglong Cao, Yuntian Chen", "id": "2412.09328v1", "paper_url": "http://arxiv.org/abs/2412.09328v1", "repo": "https://github.com/daxin007/armd"}}