{"2501.07088": {"publish_time": "2025-01-13", "title": "MathReader : Text-to-Speech for Mathematical Documents", "paper_summary": "TTS (Text-to-Speech) document reader from Microsoft, Adobe, Apple, and OpenAI\nhave been serviced worldwide. They provide relatively good TTS results for\ngeneral plain text, but sometimes skip contents or provide unsatisfactory\nresults for mathematical expressions. This is because most modern academic\npapers are written in LaTeX, and when LaTeX formulas are compiled, they are\nrendered as distinctive text forms within the document. However, traditional\nTTS document readers output only the text as it is recognized, without\nconsidering the mathematical meaning of the formulas. To address this issue, we\npropose MathReader, which effectively integrates OCR, a fine-tuned T5 model,\nand TTS. MathReader demonstrated a lower Word Error Rate (WER) than existing\nTTS document readers, such as Microsoft Edge and Adobe Acrobat, when processing\ndocuments containing mathematical formulas. MathReader reduced the WER from\n0.510 to 0.281 compared to Microsoft Edge, and from 0.617 to 0.281 compared to\nAdobe Acrobat. This will significantly contribute to alleviating the\ninconvenience faced by users who want to listen to documents, especially those\nwho are visually impaired. The code is available at\nhttps://github.com/hyeonsieun/MathReader.", "paper_summary_zh": "微軟、Adobe、蘋果和 OpenAI 的 TTS（文字轉語音）文件朗讀器已在全球提供服務。對於一般的純文字，它們提供相對良好的 TTS 結果，但有時會跳過內容或對於數學表達式提供不令人滿意的結果。這是因為大多數現代學術論文都是用 LaTeX 編寫的，當編譯 LaTeX 公式時，它們會在文件內呈現為獨特的文字形式。然而，傳統的 TTS 文件朗讀器只會輸出它所識別的文字，而不會考慮公式的數學含義。為了解決這個問題，我們提出了 MathReader，它有效地整合了 OCR、微調的 T5 模型和 TTS。在處理包含數學公式的文件時，MathReader 展示出比現有的 TTS 文件朗讀器（例如 Microsoft Edge 和 Adobe Acrobat）更低的字元錯誤率 (WER)。與 Microsoft Edge 相比，MathReader 將 WER 從 0.510 降低到 0.281，與 Adobe Acrobat 相比，將 WER 從 0.617 降低到 0.281。這將顯著有助於減輕想要聆聽文件（尤其是視障人士）的用戶所面臨的不便。程式碼可在 https://github.com/hyeonsieun/MathReader 取得。", "author": "Sieun Hyeon et.al.", "authors": "Sieun Hyeon, Kyudan Jung, Nam-Joon Kim, Hyun Gon Ryu, Jaeyoung Do", "id": "2501.07088v1", "paper_url": "http://arxiv.org/abs/2501.07088v1", "repo": "https://github.com/hyeonsieun/mathreader"}}