{"2411.19689": {"publish_time": "2024-11-29", "title": "MIMDE: Exploring the Use of Synthetic vs Human Data for Evaluating Multi-Insight Multi-Document Extraction Tasks", "paper_summary": "Large language models (LLMs) have demonstrated remarkable capabilities in\ntext analysis tasks, yet their evaluation on complex, real-world applications\nremains challenging. We define a set of tasks, Multi-Insight Multi-Document\nExtraction (MIMDE) tasks, which involves extracting an optimal set of insights\nfrom a document corpus and mapping these insights back to their source\ndocuments. This task is fundamental to many practical applications, from\nanalyzing survey responses to processing medical records, where identifying and\ntracing key insights across documents is crucial. We develop an evaluation\nframework for MIMDE and introduce a novel set of complementary human and\nsynthetic datasets to examine the potential of synthetic data for LLM\nevaluation. After establishing optimal metrics for comparing extracted\ninsights, we benchmark 20 state-of-the-art LLMs on both datasets. Our analysis\nreveals a strong correlation (0.71) between the ability of LLMs to extracts\ninsights on our two datasets but synthetic data fails to capture the complexity\nof document-level analysis. These findings offer crucial guidance for the use\nof synthetic data in evaluating text analysis systems, highlighting both its\npotential and limitations.", "paper_summary_zh": "大型語言模型 (LLM) 在文本分析任務中展現出非凡的能力，然而，它們在複雜的現實世界應用中仍難以評估。我們定義了一組任務，多見解多文件萃取 (MIMDE) 任務，它涉及從文件語料庫中萃取一組最佳見解，並將這些見解映射回其原始文件。這項任務對於許多實際應用至關重要，從分析調查回應到處理醫療記錄，其中識別和追蹤文件中的關鍵見解至關重要。我們開發了一個 MIMDE 評估架構，並引入了一組新穎的互補人類和合成資料集，以檢視合成資料在 LLM 評估中的潛力。在建立用於比較萃取見解的最佳指標後，我們在兩個資料集上對 20 個最先進的 LLM 進行基準測試。我們的分析顯示，LLM 在我們的兩個資料集上萃取見解的能力之間存在強相關性 (0.71)，但合成資料無法捕捉文件層級分析的複雜性。這些發現為在評估文本分析系統時使用合成資料提供了至關重要的指導，突出了其潛力和局限性。", "author": "John Francis et.al.", "authors": "John Francis, Saba Esnaashari, Anton Poletaev, Sukankana Chakraborty, Youmna Hashem, Jonathan Bright", "id": "2411.19689v1", "paper_url": "http://arxiv.org/abs/2411.19689v1", "repo": "null"}}