{"2502.06864": {"publish_time": "2025-02-08", "title": "Knowledge Graph-Guided Retrieval Augmented Generation", "paper_summary": "Retrieval-augmented generation (RAG) has emerged as a promising technology\nfor addressing hallucination issues in the responses generated by large\nlanguage models (LLMs). Existing studies on RAG primarily focus on applying\nsemantic-based approaches to retrieve isolated relevant chunks, which ignore\ntheir intrinsic relationships. In this paper, we propose a novel Knowledge\nGraph-Guided Retrieval Augmented Generation (KG$^2$RAG) framework that utilizes\nknowledge graphs (KGs) to provide fact-level relationships between chunks,\nimproving the diversity and coherence of the retrieved results. Specifically,\nafter performing a semantic-based retrieval to provide seed chunks, KG$^2$RAG\nemploys a KG-guided chunk expansion process and a KG-based chunk organization\nprocess to deliver relevant and important knowledge in well-organized\nparagraphs. Extensive experiments conducted on the HotpotQA dataset and its\nvariants demonstrate the advantages of KG$^2$RAG compared to existing RAG-based\napproaches, in terms of both response quality and retrieval quality.", "paper_summary_zh": "檢索增強生成 (RAG) 已成為一項有前途的技術，用於解決大型語言模型 (LLM) 所產生回應中的幻覺問題。現有關於 RAG 的研究主要專注於應用基於語義的方法來檢索孤立相關的區塊，而忽略它們的內在關係。在本文中，我們提出了一個新穎的知識圖表引導檢索增強生成 (KG$^2$RAG) 框架，它利用知識圖表 (KG) 來提供區塊之間的事實層級關係，從而提高檢索結果的多樣性和一致性。具體來說，在執行基於語義的檢索以提供種子區塊後，KG$^2$RAG 採用 KG 引導的區塊擴充程序和基於 KG 的區塊組織程序，以在組織良好的段落中傳達相關且重要的知識。在 HotpotQA 資料集及其變體上進行的大量實驗證明了 KG$^2$RAG 在回應品質和檢索品質方面優於現有的基於 RAG 的方法。", "author": "Xiangrong Zhu et.al.", "authors": "Xiangrong Zhu, Yuexiang Xie, Yi Liu, Yaliang Li, Wei Hu", "id": "2502.06864v1", "paper_url": "http://arxiv.org/abs/2502.06864v1", "repo": "null"}}