{"2502.02017": {"publish_time": "2025-02-04", "title": "Multi-Domain Graph Foundation Models: Robust Knowledge Transfer via Topology Alignment", "paper_summary": "Recent advances in CV and NLP have inspired researchers to develop\ngeneral-purpose graph foundation models through pre-training across diverse\ndomains. However, a fundamental challenge arises from the substantial\ndifferences in graph topologies across domains. Additionally, real-world graphs\nare often sparse and prone to noisy connections and adversarial attacks. To\naddress these issues, we propose the Multi-Domain Graph Foundation Model\n(MDGFM), a unified framework that aligns and leverages cross-domain topological\ninformation to facilitate robust knowledge transfer. MDGFM bridges different\ndomains by adaptively balancing features and topology while refining original\ngraphs to eliminate noise and align topological structures. To further enhance\nknowledge transfer, we introduce an efficient prompt-tuning approach. By\naligning topologies, MDGFM not only improves multi-domain pre-training but also\nenables robust knowledge transfer to unseen domains. Theoretical analyses\nprovide guarantees of MDGFM's effectiveness and domain generalization\ncapabilities. Extensive experiments on both homophilic and heterophilic graph\ndatasets validate the robustness and efficacy of our method.", "paper_summary_zh": "近來在 CV 和 NLP 的進展，激勵研究人員透過在不同領域進行預訓練，開發通用圖形基礎模型。然而，一個基本挑戰來自於不同領域中圖形拓撲的顯著差異。此外，真實世界的圖形通常是稀疏的，且容易受到有噪音的連接和對抗性攻擊。為了解決這些問題，我們提出多領域圖形基礎模型 (MDGFM)，一個統一的架構，它對齊並運用跨領域的拓撲資訊，以促進穩健的知識傳輸。MDGFM 透過自適應地平衡特徵和拓撲，同時改善原始圖形以消除雜訊並對齊拓撲結構，來橋接不同的領域。為了進一步增強知識傳輸，我們引入一種有效的提示調整方法。透過對齊拓撲，MDGFM 不僅改善多領域預訓練，也讓穩健的知識傳輸到未見過的領域成為可能。理論分析提供了 MDGFM 的有效性和領域概化能力的保證。在同質和異質圖形資料集上的廣泛實驗驗證了我們方法的穩健性和效能。", "author": "Shuo Wang et.al.", "authors": "Shuo Wang, Bokui Wang, Zhixiang Shen, Boyan Deng, Zhao Kang", "id": "2502.02017v1", "paper_url": "http://arxiv.org/abs/2502.02017v1", "repo": "null"}}