{"2405.20222": {"publish_time": "2024-05-30", "title": "MOFA-Video: Controllable Image Animation via Generative Motion Field Adaptions in Frozen Image-to-Video Diffusion Model", "paper_summary": "We present MOFA-Video, an advanced controllable image animation method that\ngenerates video from the given image using various additional controllable\nsignals (such as human landmarks reference, manual trajectories, and another\neven provided video) or their combinations. This is different from previous\nmethods which only can work on a specific motion domain or show weak control\nabilities with diffusion prior. To achieve our goal, we design several\ndomain-aware motion field adapters (\\ie, MOFA-Adapters) to control the\ngenerated motions in the video generation pipeline. For MOFA-Adapters, we\nconsider the temporal motion consistency of the video and generate the dense\nmotion flow from the given sparse control conditions first, and then, the\nmulti-scale features of the given image are wrapped as a guided feature for\nstable video diffusion generation. We naively train two motion adapters for the\nmanual trajectories and the human landmarks individually since they both\ncontain sparse information about the control. After training, the MOFA-Adapters\nin different domains can also work together for more controllable video\ngeneration.", "paper_summary_zh": "我們提出 MOFA-Video，一種進階的可控影像動畫方法，它使用各種額外的可控訊號（例如人類地標參考、手動軌跡，以及另提供的一段影片）或其組合，從給定的影像產生影片。這與先前的方法不同，後者只能在特定動作領域中運作，或在擴散之前展現出較弱的控制能力。為了達成我們的目標，我們設計了幾個領域感知動作場適配器（即 MOFA-Adapters），以控制影片生成管線中產生的動作。對於 MOFA-Adapters，我們考慮影片的時間動作一致性，並首先從給定的稀疏控制條件產生密集動作流，然後，給定影像的多尺度特徵被包裝為引導特徵，用於穩定的影片擴散生成。我們天真地訓練了兩個動作適配器，分別用於手動軌跡和人體地標，因為它們都包含稀疏的控制資訊。訓練後，不同領域的 MOFA-Adapters 也可以協同工作，以產生更多可控的影片。", "author": "Muyao Niu et.al.", "authors": "Muyao Niu, Xiaodong Cun, Xintao Wang, Yong Zhang, Ying Shan, Yinqiang Zheng", "id": "2405.20222v1", "paper_url": "http://arxiv.org/abs/2405.20222v1", "repo": "null"}}