{"2405.18776": {"publish_time": "2024-05-29", "title": "LMO-DP: Optimizing the Randomization Mechanism for Differentially Private Fine-Tuning (Large) Language Models", "paper_summary": "Differentially Private Stochastic Gradient Descent (DP-SGD) and its variants\nhave been proposed to ensure rigorous privacy for fine-tuning large-scale\npre-trained language models. However, they rely heavily on the Gaussian\nmechanism, which may overly perturb the gradients and degrade the accuracy,\nespecially in stronger privacy regimes (e.g., the privacy budget $\\epsilon <\n3$). To address such limitations, we propose a novel Language Model-based\nOptimal Differential Privacy (LMO-DP) mechanism, which takes the first step to\nenable the tight composition of accurately fine-tuning (large) language models\nwith a sub-optimal DP mechanism, even in strong privacy regimes (e.g., $0.1\\leq\n\\epsilon<3$). Furthermore, we propose a novel offline optimal noise search\nmethod to efficiently derive the sub-optimal DP that significantly reduces the\nnoise magnitude. For instance, fine-tuning RoBERTa-large (with 300M parameters)\non the SST-2 dataset can achieve an accuracy of 92.20% (given $\\epsilon=0.3$,\n$\\delta=10^{-10}$) by drastically outperforming the Gaussian mechanism (e.g.,\n$\\sim 50\\%$ for small $\\epsilon$ and $\\delta$). We also draw similar findings\non the text generation tasks on GPT-2. Finally, to our best knowledge, LMO-DP\nis also the first solution to accurately fine-tune Llama-2 with strong\ndifferential privacy guarantees. The code will be released soon and available\nupon request.", "paper_summary_zh": "差異化私人隨機梯度下降 (DP-SGD) 及其變體已被提出，以確保對大型預訓練語言模型進行微調的嚴格隱私。然而，它們嚴重依賴於高斯機制，這可能會過度擾動梯度並降低準確性，特別是在更強的隱私制度中（例如，隱私預算 $\\epsilon < 3$）。為了解決這些限制，我們提出了一種新穎的基於語言模型的最佳差異隱私 (LMO-DP) 機制，它邁出了第一步，即使在強隱私制度（例如，$0.1\\leq \\epsilon<3$）下，也能夠對（大型）語言模型進行準確微調的嚴密組合。此外，我們提出了一種新穎的離線最佳雜訊搜尋方法，以有效地推導出顯著降低雜訊幅度的次最佳 DP。例如，在 SST-2 資料集上對 RoBERTa-large（具有 300M 參數）進行微調，可以達到 92.20% 的準確度（給定 $\\epsilon=0.3$，$\\delta=10^{-10}$），大幅優於高斯機制（例如，對於較小的 $\\epsilon$ 和 $\\delta$，約為 50%）。我們還在 GPT-2 上的文本生成任務中得出了類似的發現。最後，據我們所知，LMO-DP 也是第一個準確微調 Llama-2 的解決方案，並具有強大的差異隱私保證。該程式碼將很快發布，並可應要求提供。", "author": "Qin Yang et.al.", "authors": "Qin Yang, Meisam Mohammad, Han Wang, Ali Payani, Ashish Kundu, Kai Shu, Yan Yan, Yuan Hong", "id": "2405.18776v1", "paper_url": "http://arxiv.org/abs/2405.18776v1", "repo": "null"}}