{"2409.15933": {"publish_time": "2024-09-24", "title": "SLIMER-IT: Zero-Shot NER on Italian Language", "paper_summary": "Traditional approaches to Named Entity Recognition (NER) frame the task into\na BIO sequence labeling problem. Although these systems often excel in the\ndownstream task at hand, they require extensive annotated data and struggle to\ngeneralize to out-of-distribution input domains and unseen entity types. On the\ncontrary, Large Language Models (LLMs) have demonstrated strong zero-shot\ncapabilities. While several works address Zero-Shot NER in English, little has\nbeen done in other languages. In this paper, we define an evaluation framework\nfor Zero-Shot NER, applying it to the Italian language. Furthermore, we\nintroduce SLIMER-IT, the Italian version of SLIMER, an instruction-tuning\napproach for zero-shot NER leveraging prompts enriched with definition and\nguidelines. Comparisons with other state-of-the-art models, demonstrate the\nsuperiority of SLIMER-IT on never-seen-before entity tags.", "paper_summary_zh": "傳統命名實體識別 (NER) 方法將任務設定為 BIO 序列標籤問題。儘管這些系統通常在手邊的下游任務中表現出色，但它們需要大量的註解資料，並且難以推廣到分布外輸入網域和未見實體類型。相反地，大型語言模型 (LLM) 已展現強大的零次學習能力。儘管有幾項工作探討英文的零次學習 NER，但其他語言的研究卻很少。在本文中，我們定義了零次學習 NER 的評量架構，並將其應用於義大利語。此外，我們引入了 SLIMER-IT，它是 SLIMER 的義大利語版本，一種用於零次學習 NER 的指令調整方法，利用豐富了定義和準則的提示。與其他最先進模型的比較證明了 SLIMER-IT 在前所未見的實體標籤上的優越性。", "author": "Andrew Zamai et.al.", "authors": "Andrew Zamai, Leonardo Rigutini, Marco Maggini, Andrea Zugarini", "id": "2409.15933v1", "paper_url": "http://arxiv.org/abs/2409.15933v1", "repo": "https://github.com/andrewzamai/slimer_it"}}