{"2401.13324": {"publish_time": "2024-01-24", "title": "Information That Matters: Exploring Information Needs of People Affected by Algorithmic Decisions", "paper_summary": "Explanations of AI systems rarely address the information needs of people\naffected by algorithmic decision-making (ADM). This gap between conveyed\ninformation and information that matters to affected stakeholders can impede\nunderstanding and adherence to regulatory frameworks such as the AI Act. To\naddress this gap, we present the \"XAI Novice Question Bank\": A catalog of\naffected stakeholders' information needs in two ADM use cases (employment\nprediction and health monitoring), covering the categories data, system\ncontext, system usage, and system specifications. Information needs were\ngathered in an interview study where participants received explanations in\nresponse to their inquiries. Participants further reported their understanding\nand decision confidence, showing that while confidence tended to increase after\nreceiving explanations, participants also met understanding challenges, such as\nbeing unable to tell why their understanding felt incomplete. Explanations\nfurther influenced participants' perceptions of the systems' risks and\nbenefits, which they confirmed or changed depending on the use case. When risks\nwere perceived as high, participants expressed particular interest in\nexplanations about intention, such as why and to what end a system was put in\nplace. With this work, we aim to support the inclusion of affected stakeholders\ninto explainability by contributing an overview of information and challenges\nrelevant to them when deciding on the adoption of ADM systems. We close by\nsummarizing our findings in a list of six key implications that inform the\ndesign of future explanations for affected stakeholder audiences.", "paper_summary_zh": "", "author": "Timothée Schmude et.al.", "authors": "Timothée Schmude,Laura Koesten,Torsten Möller,Sebastian Tschiatschek", "id": "2401.13324v4", "paper_url": "http://arxiv.org/abs/2401.13324v4", "repo": "null"}}