{"2409.09785": {"publish_time": "2024-09-15", "title": "Large Language Model Based Generative Error Correction: A Challenge and Baselines for Speech Recognition, Speaker Tagging, and Emotion Recognition", "paper_summary": "Given recent advances in generative AI technology, a key question is how\nlarge language models (LLMs) can enhance acoustic modeling tasks using text\ndecoding results from a frozen, pretrained automatic speech recognition (ASR)\nmodel. To explore new capabilities in language modeling for speech processing,\nwe introduce the generative speech transcription error correction (GenSEC)\nchallenge. This challenge comprises three post-ASR language modeling tasks: (i)\npost-ASR transcription correction, (ii) speaker tagging, and (iii) emotion\nrecognition. These tasks aim to emulate future LLM-based agents handling\nvoice-based interfaces while remaining accessible to a broad audience by\nutilizing open pretrained language models or agent-based APIs. We also discuss\ninsights from baseline evaluations, as well as lessons learned for designing\nfuture evaluations.", "paper_summary_zh": "鉴于生成式 AI 技术的最新进展，一个关键问题是如何使用来自冻结的预训练自动语音识别 (ASR) 模型的文本解码结果来增强声学建模任务的大语言模型 (LLM)。为了探索语言建模在语音处理中的新功能，我们引入了生成式语音转录错误更正 (GenSEC) 挑战。此挑战包括三个 ASR 后语言建模任务：(i) ASR 后转录更正，(ii) 说话者标记，以及 (iii) 情绪识别。这些任务旨在模拟基于 LLM 的未来代理处理基于语音的界面，同时通过利用开放的预训练语言模型或基于代理的 API，让广泛的受众能够访问它们。我们还讨论了基准评估的见解，以及为设计未来的评估所吸取的教训。", "author": "Chao-Han Huck Yang et.al.", "authors": "Chao-Han Huck Yang, Taejin Park, Yuan Gong, Yuanchao Li, Zhehuai Chen, Yen-Ting Lin, Chen Chen, Yuchen Hu, Kunal Dhawan, Piotr Żelasko, Chao Zhang, Yun-Nung Chen, Yu Tsao, Jagadeesh Balam, Boris Ginsburg, Sabato Marco Siniscalchi, Eng Siong Chng, Peter Bell, Catherine Lai, Shinji Watanabe, Andreas Stolcke", "id": "2409.09785v2", "paper_url": "http://arxiv.org/abs/2409.09785v2", "repo": "null"}}