{"2405.10626": {"publish_time": "2024-05-17", "title": "Dynamic data sampler for cross-language transfer learning in large language models", "paper_summary": "Large Language Models (LLMs) have gained significant attention in the field\nof natural language processing (NLP) due to their wide range of applications.\nHowever, training LLMs for languages other than English poses significant\nchallenges, due to the difficulty in acquiring large-scale corpus and the\nrequisite computing resources. In this paper, we propose ChatFlow, a\ncross-language transfer-based LLM, to address these challenges and train large\nChinese language models in a cost-effective manner. We employ a mix of Chinese,\nEnglish, and parallel corpus to continuously train the LLaMA2 model, aiming to\nalign cross-language representations and facilitate the knowledge transfer\nspecifically to the Chinese language model. In addition, we use a dynamic data\nsampler to progressively transition the model from unsupervised pre-training to\nsupervised fine-tuning. Experimental results demonstrate that our approach\naccelerates model convergence and achieves superior performance. We evaluate\nChatFlow on popular Chinese and English benchmarks, the results indicate that\nit outperforms other Chinese models post-trained on LLaMA-2-7B.", "paper_summary_zh": "大型語言模型 (LLM) 因其廣泛的應用而在自然語言處理 (NLP) 領域備受關注。然而，訓練非英語語言的 LLM 具有重大挑戰，因為難以獲取大規模語料庫和必要的運算資源。在本文中，我們提出 ChatFlow，一個基於跨語言轉移的 LLM，以解決這些挑戰並以經濟有效的方式訓練大型中文語言模型。我們採用中文、英文和平行語料庫的組合來持續訓練 LLaMA2 模型，旨在對齊跨語言表示並促進知識轉移，特別是轉移到中文語言模型。此外，我們使用動態數據採樣器逐步將模型從無監督預訓練轉換為監督微調。實驗結果表明，我們的做法加速了模型收斂並實現了卓越的性能。我們在流行的中英文基準上評估 ChatFlow，結果表明，它優於在 LLaMA-2-7B 上進行後訓練的其他中文模型。", "author": "Yudong Li et.al.", "authors": "Yudong Li, Yuhao Feng, Wen Zhou, Zhe Zhao, Linlin Shen, Cheng Hou, Xianxu Hou", "id": "2405.10626v1", "paper_url": "http://arxiv.org/abs/2405.10626v1", "repo": "https://github.com/cvi-szu/linly"}}