{"2412.07282": {"publish_time": "2024-12-10", "title": "HARP: Hesitation-Aware Reframing in Transformer Inference Pass", "paper_summary": "This paper aims to improve the performance of large language models by\naddressing the variable computational demands in inference steps, where some\ntokens require more computational resources than others. We present HARP, a\nsimple modification to \"off-the-shelf\" Transformer forward pass. Drawing from\nhesitation and the framing effect in decision-making, HARP selectively applies\nadditional computation when the model encounters uncertainty during token\ngeneration. Our method mimics human cognitive processes by pausing at difficult\ndecision points and reframing inputs for a different perspective. Unlike other\napproaches, HARP is model-agnostic, training-free, and easy to implement. We\nthoroughly evaluate our method across various downstream tasks and model sizes,\ndemonstrating performance improvements up to +5.16%. Notably, HARP achieves\nthese gains while maintaining inference times twice faster than beam search.\nSimple and yet with significant gains, HARP offers a practical solution for\nenhancing the performance of Transformer-based language models with minimal\ncomputational impact.", "paper_summary_zh": "本文旨在透過解決推論步驟中的可變運算需求來提升大型語言模型的效能，其中某些代碼需要比其他代碼更多的運算資源。我們提出 HARP，對「現成」Transformer 前向傳遞進行簡單的修改。HARP 借鑑決策制定中的猶豫和框架效應，在模型於代碼產生期間遭遇不確定性時有選擇地套用額外的運算。我們的做法模擬人類的認知歷程，在困難的決策點暫停，並重新建構輸入以獲得不同的觀點。與其他方法不同，HARP 與模型無關、無需訓練，且易於實作。我們徹底評估了我們的方法在各種下游任務和模型大小中的表現，證明效能提升幅度高達 +5.16%。值得注意的是，HARP 在達成這些增益的同時，推論時間比波束搜尋快上兩倍。HARP 簡單卻能帶來顯著增益，提供了一個實用的解決方案，以最小的運算影響力提升基於 Transformer 的語言模型的效能。", "author": "Romain Storaï et.al.", "authors": "Romain Storaï, Seung-won Hwang", "id": "2412.07282v1", "paper_url": "http://arxiv.org/abs/2412.07282v1", "repo": "https://github.com/romsto/harp"}}