{"2406.12527": {"publish_time": "2024-06-18", "title": "FuseGen: PLM Fusion for Data-generation based Zero-shot Learning", "paper_summary": "Data generation-based zero-shot learning, although effective in training\nSmall Task-specific Models (STMs) via synthetic datasets generated by\nPre-trained Language Models (PLMs), is often limited by the low quality of such\nsynthetic datasets. Previous solutions have primarily focused on single PLM\nsettings, where synthetic datasets are typically restricted to specific\nsub-spaces and often deviate from real-world distributions, leading to severe\ndistribution bias. To mitigate such bias, we propose FuseGen, a novel data\ngeneration-based zero-shot learning framework that introduces a new criteria\nfor subset selection from synthetic datasets via utilizing multiple PLMs and\ntrained STMs. The chosen subset provides in-context feedback to each PLM,\nenhancing dataset quality through iterative data generation. Trained STMs are\nthen used for sample re-weighting as well, further improving data quality.\nExtensive experiments across diverse tasks demonstrate that FuseGen\nsubstantially outperforms existing methods, highly effective in boosting STM\nperformance in a PLM-agnostic way. Code is provided in\nhttps://github.com/LindaLydia/FuseGen.", "paper_summary_zh": "基於資料產生的零次學習雖然在訓練小型任務特定模型 (STM) 方面很有效，但透過預訓練語言模型 (PLM) 生成的合成資料集，卻經常受到資料集品質低落所限制。先前的解決方案主要專注於單一 PLM 設定，其中合成資料集通常侷限於特定子空間，而且經常偏離真實世界的分布，導致嚴重的分佈偏差。為了減輕這種偏差，我們提出 FuseGen，這是一個基於資料產生的零次學習框架，它引入了新的準則，透過使用多個 PLM 和訓練過的 STM 從合成資料集中進行子集選擇。所選取的子集會提供情境內的回饋給每個 PLM，透過反覆的資料產生來提升資料集品質。訓練過的 STM 隨後也會用於樣本重新加權，進一步提升資料品質。在各種任務中進行的廣泛實驗證明 FuseGen 大幅優於現有方法，在提升 STM 效能方面非常有效，而且不依賴 PLM。程式碼已提供於 https://github.com/LindaLydia/FuseGen。", "author": "Tianyuan Zou et.al.", "authors": "Tianyuan Zou, Yang Liu, Peng Li, Jianqing Zhang, Jingjing Liu, Ya-Qin Zhang", "id": "2406.12527v1", "paper_url": "http://arxiv.org/abs/2406.12527v1", "repo": "null"}}