{"2406.18839": {"publish_time": "2024-06-27", "title": "Disentangling Knowledge-based and Visual Reasoning by Question Decomposition in KB-VQA", "paper_summary": "We study the Knowledge-Based visual question-answering problem, for which\ngiven a question, the models need to ground it into the visual modality to find\nthe answer. Although many recent works use question-dependent captioners to\nverbalize the given image and use Large Language Models to solve the VQA\nproblem, the research results show they are not reasonably performing for\nmulti-hop questions. Our study shows that replacing a complex question with\nseveral simpler questions helps to extract more relevant information from the\nimage and provide a stronger comprehension of it. Moreover, we analyze the\ndecomposed questions to find out the modality of the information that is\nrequired to answer them and use a captioner for the visual questions and LLMs\nas a general knowledge source for the non-visual KB-based questions. Our\nresults demonstrate the positive impact of using simple questions before\nretrieving visual or non-visual information. We have provided results and\nanalysis on three well-known VQA datasets including OKVQA, A-OKVQA, and KRVQA,\nand achieved up to 2% improvement in accuracy.", "paper_summary_zh": "我們研究了基於知識的視覺問答問題，對於此問題，給定一個問題，模型需要將其基礎化為視覺模式以找出答案。儘管許多近期研究使用依賴問題的標題說明器將給定的影像口語化，並使用大型語言模型來解決 VQA 問題，但研究結果顯示它們對於多跳問題的執行並非合理。我們的研究顯示，將複雜問題替換為幾個較簡單的問題有助於從影像中萃取出更相關的資訊，並提供對其更強的理解。此外，我們分析分解的問題，找出回答它們所需的資訊模式，並使用標題說明器進行視覺問題，並將 LLM 作為非視覺 KB-based 問題的一般知識來源。我們的結果證明了在擷取視覺或非視覺資訊之前使用簡單問題的正面影響。我們在三個著名的 VQA 資料集，包括 OKVQA、A-OKVQA 和 KRVQA，上提供了結果和分析，並在準確度上獲得了高達 2% 的提升。", "author": "Elham J. Barezi et.al.", "authors": "Elham J. Barezi, Parisa Kordjamshidi", "id": "2406.18839v1", "paper_url": "http://arxiv.org/abs/2406.18839v1", "repo": "null"}}