{"2405.06604": {"publish_time": "2024-05-10", "title": "Explaining Text Similarity in Transformer Models", "paper_summary": "As Transformers have become state-of-the-art models for natural language\nprocessing (NLP) tasks, the need to understand and explain their predictions is\nincreasingly apparent. Especially in unsupervised applications, such as\ninformation retrieval tasks, similarity models built on top of foundation model\nrepresentations have been widely applied. However, their inner prediction\nmechanisms have mostly remained opaque. Recent advances in explainable AI have\nmade it possible to mitigate these limitations by leveraging improved\nexplanations for Transformers through layer-wise relevance propagation (LRP).\nUsing BiLRP, an extension developed for computing second-order explanations in\nbilinear similarity models, we investigate which feature interactions drive\nsimilarity in NLP models. We validate the resulting explanations and\ndemonstrate their utility in three corpus-level use cases, analyzing\ngrammatical interactions, multilingual semantics, and biomedical text\nretrieval. Our findings contribute to a deeper understanding of different\nsemantic similarity tasks and models, highlighting how novel explainable AI\nmethods enable in-depth analyses and corpus-level insights.", "paper_summary_zh": "隨著 Transformer 成為自然語言處理 (NLP) 任務的最新技術，了解和解釋其預測的需求日益明顯。特別是在無監督應用程式中，例如資訊檢索任務，建立在基礎模型表示上的相似性模型已被廣泛應用。然而，它們的內部預測機制大多仍然不透明。可解釋 AI 的最新進展使得透過分層相關性傳播 (LRP) 為 Transformer 提供更好的解釋，從而減輕這些限制。使用 BiLRP，一種為計算雙線性相似性模型中的二階解釋而開發的延伸，我們探討了哪些特徵互動驅動了 NLP 模型中的相似性。我們驗證了產生的解釋，並展示了它們在三個語料庫級別用例中的效用，分析語法互動、多語言語義和生物醫學文字檢索。我們的發現有助於更深入地了解不同的語義相似性任務和模型，強調了新穎的可解釋 AI 方法如何實現深入分析和語料庫級別見解。", "author": "Alexandros Vasileiou et.al.", "authors": "Alexandros Vasileiou, Oliver Eberle", "id": "2405.06604v1", "paper_url": "http://arxiv.org/abs/2405.06604v1", "repo": "null"}}