{"2410.11657": {"publish_time": "2024-10-15", "title": "Unveiling the Mystery of Visual Attributes of Concrete and Abstract Concepts: Variability, Nearest Neighbors, and Challenging Categories", "paper_summary": "The visual representation of a concept varies significantly depending on its\nmeaning and the context where it occurs; this poses multiple challenges both\nfor vision and multimodal models. Our study focuses on concreteness, a\nwell-researched lexical-semantic variable, using it as a case study to examine\nthe variability in visual representations. We rely on images associated with\napproximately 1,000 abstract and concrete concepts extracted from two different\ndatasets: Bing and YFCC. Our goals are: (i) evaluate whether visual diversity\nin the depiction of concepts can reliably distinguish between concrete and\nabstract concepts; (ii) analyze the variability of visual features across\nmultiple images of the same concept through a nearest neighbor analysis; and\n(iii) identify challenging factors contributing to this variability by\ncategorizing and annotating images. Our findings indicate that for classifying\nimages of abstract versus concrete concepts, a combination of basic visual\nfeatures such as color and texture is more effective than features extracted by\nmore complex models like Vision Transformer (ViT). However, ViTs show better\nperformances in the nearest neighbor analysis, emphasizing the need for a\ncareful selection of visual features when analyzing conceptual variables\nthrough modalities other than text.", "paper_summary_zh": "概念的視覺表示會根據其意義和發生的背景而有顯著差異；這對視覺和多模態模型來說都提出了多重挑戰。我們的研究重點在於具體性，這是一個研究完善的詞彙語義變數，我們使用它作為案例研究來檢視視覺表示中的變異性。我們依賴與從兩個不同的資料集：Bing 和 YFCC 中提取的大約 1,000 個抽象和具體概念相關的影像。我們的目標是：(i) 評估概念描繪中的視覺多樣性是否能可靠地區分具體和抽象概念；(ii) 透過最近鄰分析，分析同一概念多個影像中視覺特徵的變異性；以及 (iii) 透過對影像進行分類和註解，找出導致這種變異性的挑戰因素。我們的研究結果指出，對於對抽象概念與具體概念的影像進行分類，基本視覺特徵（例如顏色和紋理）的組合比由更複雜的模型（例如 Vision Transformer (ViT)）提取的特徵更有效。然而，ViT 在最近鄰分析中表現得更好，強調在透過文字以外的方式分析概念變數時，需要仔細選擇視覺特徵。", "author": "Tarun Tater et.al.", "authors": "Tarun Tater, Sabine Schulte im Walde, Diego Frassinelli", "id": "2410.11657v1", "paper_url": "http://arxiv.org/abs/2410.11657v1", "repo": "null"}}