{"2406.04643": {"publish_time": "2024-06-07", "title": "More Victories, Less Cooperation: Assessing Cicero's Diplomacy Play", "paper_summary": "The boardgame Diplomacy is a challenging setting for communicative and\ncooperative artificial intelligence. The most prominent communicative Diplomacy\nAI, Cicero, has excellent strategic abilities, exceeding human players.\nHowever, the best Diplomacy players master communication, not just tactics,\nwhich is why the game has received attention as an AI challenge. This work\nseeks to understand the degree to which Cicero succeeds at communication.\nFirst, we annotate in-game communication with abstract meaning representation\nto separate in-game tactics from general language. Second, we run two dozen\ngames with humans and Cicero, totaling over 200 human-player hours of\ncompetition. While AI can consistently outplay human players, AI-Human\ncommunication is still limited because of AI's difficulty with deception and\npersuasion. This shows that Cicero relies on strategy and has not yet reached\nthe full promise of communicative and cooperative AI.", "paper_summary_zh": "桌遊 Diplomacy 是溝通與合作人工智慧的挑戰性設定。最著名的溝通型 Diplomacy AI，Cicero，擁有絕佳的策略能力，超越人類玩家。然而，最好的 Diplomacy 玩家精通溝通，而非僅是戰術，這也是遊戲作為 AI 挑戰受到關注的原因。這項工作旨在了解 Cicero 在溝通方面成功的程度。首先，我們使用抽象意義表徵為遊戲內溝通加上註解，以將遊戲內戰術與一般語言區分開來。其次，我們與人類和 Cicero 進行了 20 多場遊戲，總計超過 200 小時的人類玩家競賽。儘管 AI 能夠持續勝過人類玩家，但由於 AI 難以進行欺騙和說服，因此 AI 與人類的溝通仍然受到限制。這顯示 Cicero 依賴於策略，尚未達到溝通與合作 AI 的全部承諾。", "author": "Wichayaporn Wongkamjan et.al.", "authors": "Wichayaporn Wongkamjan, Feng Gu, Yanze Wang, Ulf Hermjakob, Jonathan May, Brandon M. Stewart, Jonathan K. Kummerfeld, Denis Peskoff, Jordan Lee Boyd-Graber", "id": "2406.04643v1", "paper_url": "http://arxiv.org/abs/2406.04643v1", "repo": "null"}}