{"2407.04335": {"publish_time": "2024-07-05", "title": "Geometrically Inspired Kernel Machines for Collaborative Learning Beyond Gradient Descent", "paper_summary": "This paper develops a novel mathematical framework for collaborative learning\nby means of geometrically inspired kernel machines which includes statements on\nthe bounds of generalisation and approximation errors, and sample complexity.\nFor classification problems, this approach allows us to learn bounded geometric\nstructures around given data points and hence solve the global model learning\nproblem in an efficient way by exploiting convexity properties of the related\noptimisation problem in a Reproducing Kernel Hilbert Space (RKHS). In this way,\nwe can reduce classification problems to determining the closest bounded\ngeometric structure from a given data point. Further advantages that come with\nour solution is that our approach does not require clients to perform multiple\nepochs of local optimisation using stochastic gradient descent, nor require\nrounds of communication between client/server for optimising the global model.\nWe highlight that numerous experiments have shown that the proposed method is a\ncompetitive alternative to the state-of-the-art.", "paper_summary_zh": "本文開發了一種新的數學框架，用於透過幾何啟發的核機器進行協作學習，其中包含概化和近似誤差的界限以及範例複雜度的陳述。對於分類問題，此方法允許我們學習給定資料點周圍的受限幾何結構，並因此利用相關最佳化問題在再生核希爾伯特空間 (RKHS) 中的凸性屬性來以有效的方式解決全球模型學習問題。這樣一來，我們可以將分類問題簡化為從給定資料點中確定最接近的受限幾何結構。我們的解決方案具有的其他優點是，我們的方法不需要用戶使用隨機梯度下降法執行多個時期的局部最佳化，也不需要用戶與伺服器之間進行多輪通訊來最佳化全球模型。我們強調，大量實驗顯示，所提出的方法是現有技術的競爭替代方案。", "author": "Mohit Kumar et.al.", "authors": "Mohit Kumar, Alexander Valentinitsch, Magdalena Fuchs, Mathias Brucker, Juliana Bowles, Adnan Husakovic, Ali Abbas, Bernhard A. Moser", "id": "2407.04335v1", "paper_url": "http://arxiv.org/abs/2407.04335v1", "repo": "null"}}