{"2406.07222": {"publish_time": "2024-06-11", "title": "Improving Autoformalization using Type Checking", "paper_summary": "Large language models show promise for autoformalization, the task of\nautomatically translating natural language into formal languages. However,\ncurrent autoformalization methods remain limited. The last reported\nstate-of-the-art performance on the ProofNet formalization benchmark for the\nLean proof assistant, achieved using Codex for Lean 3, only showed successful\nformalization of 16.1% of informal statements. Similarly, our evaluation of\nGPT-4o for Lean 4 only produces successful translations 34.9% of the time. Our\nanalysis shows that the performance of these models is largely limited by their\ninability to generate formal statements that successfully type-check (i.e., are\nsyntactically correct and consistent with types) - with a whopping 86.6% of\nGPT-4o errors starting from a type-check failure. In this work, we propose a\nmethod to fix this issue through decoding with type-check filtering, where we\ninitially sample a diverse set of candidate formalizations for an informal\nstatement, then use the Lean proof assistant to filter out candidates that do\nnot type-check. Using GPT-4o as a base model, and combining our method with\nself-consistency, we obtain a +18.3% absolute increase in formalization\naccuracy, and achieve a new state-of-the-art of 53.2% on ProofNet with Lean 4.", "paper_summary_zh": "大型语言模型显示了自动形式化的前景，即自动将自然语言翻译成形式语言的任务。然而，当前的自动形式化方法仍然有限。在使用 Codex for Lean 3 针对 Lean 证明助手实现的 ProofNet 形式化基准上报告的最新性能，仅显示成功形式化了 16.1% 的非正式陈述。类似地，我们对 Lean 4 的 GPT-4o 的评估仅在 34.9% 的时间内产生了成功的翻译。我们的分析表明，这些模型的性能在很大程度上受到它们生成成功类型检查（即语法正确且与类型一致）的正式陈述的能力的限制——86.6% 的 GPT-4o 错误从类型检查失败开始。在这项工作中，我们提出了一种通过使用类型检查过滤进行解码来解决此问题的方法，其中我们最初为非正式陈述抽取一组不同的候选形式化，然后使用 Lean 证明助手来过滤掉未通过类型检查的候选项。使用 GPT-4o 作为基础模型，并将我们的方法与自洽性相结合，我们在形式化准确性上获得了 +18.3% 的绝对提升，并在 Lean 4 上的 ProofNet 上实现了 53.2% 的新技术水平。", "author": "Auguste Poiroux et.al.", "authors": "Auguste Poiroux, Gail Weiss, Viktor Kunčak, Antoine Bosselut", "id": "2406.07222v1", "paper_url": "http://arxiv.org/abs/2406.07222v1", "repo": "null"}}