{"2503.14492": {"publish_time": "2025-03-18", "title": "Cosmos-Transfer1: Conditional World Generation with Adaptive Multimodal Control", "paper_summary": "We introduce Cosmos-Transfer, a conditional world generation model that can\ngenerate world simulations based on multiple spatial control inputs of various\nmodalities such as segmentation, depth, and edge. In the design, the spatial\nconditional scheme is adaptive and customizable. It allows weighting different\nconditional inputs differently at different spatial locations. This enables\nhighly controllable world generation and finds use in various world-to-world\ntransfer use cases, including Sim2Real. We conduct extensive evaluations to\nanalyze the proposed model and demonstrate its applications for Physical AI,\nincluding robotics Sim2Real and autonomous vehicle data enrichment. We further\ndemonstrate an inference scaling strategy to achieve real-time world generation\nwith an NVIDIA GB200 NVL72 rack. To help accelerate research development in the\nfield, we open-source our models and code at\nhttps://github.com/nvidia-cosmos/cosmos-transfer1.", "paper_summary_zh": "我們推出 Cosmos-Transfer，這是一個條件式世界生成模型，可以根據分割、深度和邊緣等多種模態的多個空間控制輸入生成世界模擬。在設計中，空間條件方案是自適應且可自定義的。它允許在不同的空間位置對不同的條件輸入進行不同的加權。這實現了高度可控的世界生成，並可應用於各種世界到世界轉移的用例，包括 Sim2Real。我們進行了廣泛的評估來分析所提出的模型，並展示其在物理 AI 中的應用，包括機器人 Sim2Real 和自動駕駛汽車數據增強。我們進一步展示了一種推理擴展策略，以使用 NVIDIA GB200 NVL72 機架實現實時世界生成。為了幫助加速該領域的研究發展，我們在 https://github.com/nvidia-cosmos/cosmos-transfer1 開源了我們的模型和程式碼。\n", "author": "NVIDIA et.al.", "authors": "NVIDIA, :, Hassan Abu Alhaija, Jose Alvarez, Maciej Bala, Tiffany Cai, Tianshi Cao, Liz Cha, Joshua Chen, Mike Chen, Francesco Ferroni, Sanja Fidler, Dieter Fox, Yunhao Ge, Jinwei Gu, Ali Hassani, Michael Isaev, Pooya Jannaty, Shiyi Lan, Tobias Lasser, Huan Ling, Ming-Yu Liu, Xian Liu, Yifan Lu, Alice Luo, Qianli Ma, Hanzi Mao, Fabio Ramos, Xuanchi Ren, Tianchang Shen, Shitao Tang, Ting-Chun Wang, Jay Wu, Jiashu Xu, Stella Xu, Kevin Xie, Yuchong Ye, Xiaodong Yang, Xiaohui Zeng, Yu Zeng", "id": "2503.14492v1", "paper_url": "http://arxiv.org/abs/2503.14492v1", "repo": "null"}}