{"2405.18762": {"publish_time": "2024-05-29", "title": "Inpaint Biases: A Pathway to Accurate and Unbiased Image Generation", "paper_summary": "This paper examines the limitations of advanced text-to-image models in\naccurately rendering unconventional concepts which are scarcely represented or\nabsent in their training datasets. We identify how these limitations not only\nconfine the creative potential of these models but also pose risks of\nreinforcing stereotypes. To address these challenges, we introduce the Inpaint\nBiases framework, which employs user-defined masks and inpainting techniques to\nenhance the accuracy of image generation, particularly for novel or\ninaccurately rendered objects. Through experimental validation, we demonstrate\nhow this framework significantly improves the fidelity of generated images to\nthe user's intent, thereby expanding the models' creative capabilities and\nmitigating the risk of perpetuating biases. Our study contributes to the\nadvancement of text-to-image models as unbiased, versatile tools for creative\nexpression.", "paper_summary_zh": "本文探討進階文字轉圖像模型在準確呈現訓練資料集鮮少呈現或不存在的非常規概念時所面臨的限制。我們找出這些限制不僅侷限了這些模型的創意潛力，也可能強化刻板印象。為了應對這些挑戰，我們引入了 Inpaint Biases 架構，它採用使用者定義的遮罩和修復技術來提升影像生成的準確度，特別是對於新穎或呈現不準確的物件。透過實驗驗證，我們展示這個架構如何顯著提升產生的影像對使用者意圖的忠實度，進而擴展模型的創意能力，並降低延續偏見的風險。我們的研究有助於提升文字轉圖像模型成為無偏見、多功能的創意表達工具。", "author": "Jiyoon Myung et.al.", "authors": "Jiyoon Myung, Jihyeon Park", "id": "2405.18762v1", "paper_url": "http://arxiv.org/abs/2405.18762v1", "repo": "null"}}