{"2406.19237": {"publish_time": "2024-06-27", "title": "FlowVQA: Mapping Multimodal Logic in Visual Question Answering with Flowcharts", "paper_summary": "Existing benchmarks for visual question answering lack in visual grounding\nand complexity, particularly in evaluating spatial reasoning skills. We\nintroduce FlowVQA, a novel benchmark aimed at assessing the capabilities of\nvisual question-answering multimodal language models in reasoning with\nflowcharts as visual contexts. FlowVQA comprises 2,272 carefully generated and\nhuman-verified flowchart images from three distinct content sources, along with\n22,413 diverse question-answer pairs, to test a spectrum of reasoning tasks,\nincluding information localization, decision-making, and logical progression.\nWe conduct a thorough baseline evaluation on a suite of both open-source and\nproprietary multimodal language models using various strategies, followed by an\nanalysis of directional bias. The results underscore the benchmark's potential\nas a vital tool for advancing the field of multimodal modeling, providing a\nfocused and challenging environment for enhancing model performance in visual\nand logical reasoning tasks.", "paper_summary_zh": "現有的視覺問答基準缺乏視覺基礎和複雜性，特別是在評估空間推理技能方面。我們引入了 FlowVQA，這是一個新基準，旨在評估視覺問答多模態語言模型在使用流程圖作為視覺背景進行推理的能力。FlowVQA 包含 2,272 個來自三個不同內容來源的經過仔細生成並由人工驗證的流程圖影像，以及 22,413 個不同的問答對，用於測試一系列推理任務，包括資訊定位、決策制定和邏輯推進。我們對一系列開源和專有多模態語言模型進行了徹底的基準評估，使用各種策略，然後分析方向偏差。結果強調了基準作為推進多模態建模領域的重要工具的潛力，為在視覺和邏輯推理任務中增強模型效能提供了專注且具有挑戰性的環境。", "author": "Shubhankar Singh et.al.", "authors": "Shubhankar Singh, Purvi Chaurasia, Yerram Varun, Pranshu Pandya, Vatsal Gupta, Vivek Gupta, Dan Roth", "id": "2406.19237v1", "paper_url": "http://arxiv.org/abs/2406.19237v1", "repo": "null"}}