{"2412.03213": {"publish_time": "2024-12-04", "title": "ClusterKV: Manipulating LLM KV Cache in Semantic Space for Recallable Compression", "paper_summary": "Large Language Models (LLMs) have been widely deployed in a variety of\napplications, and the context length is rapidly increasing to handle tasks such\nas long-document QA and complex logical reasoning. However, long context poses\nsignificant challenges for inference efficiency, including high memory costs of\nkey-value (KV) cache and increased latency due to extensive memory accesses.\nRecent works have proposed compressing KV cache to approximate computation, but\nthese methods either evict tokens permanently, never recalling them for later\ninference, or recall previous tokens at the granularity of pages divided by\ntextual positions. Both approaches degrade the model accuracy and output\nquality. To achieve efficient and accurate recallable KV cache compression, we\nintroduce ClusterKV, which recalls tokens at the granularity of semantic\nclusters. We design and implement efficient algorithms and systems for\nclustering, selection, indexing and caching. Experiment results show that\nClusterKV attains negligible accuracy loss across various tasks with 32k\ncontext lengths, using only a 1k to 2k KV cache budget, and achieves up to a\n2$\\times$ speedup in latency and a 2.5$\\times$ improvement in decoding\nthroughput. Compared to SoTA recallable KV compression methods, ClusterKV\ndemonstrates higher model accuracy and output quality, while maintaining or\nexceeding inference efficiency.", "paper_summary_zh": "大型語言模型 (LLM) 已廣泛部署於各種應用程式中，且背景長度迅速增加，以處理長文件問答和複雜邏輯推理等任務。然而，長背景對推論效率構成重大挑戰，包括鍵值 (KV) 快取的高記憶體成本，以及由於大量記憶體存取而增加的延遲。最近的研究已提出壓縮 KV 快取以近似計算，但這些方法會永久驅逐權杖，永遠不會在後續推論中提取它們，或在由文字位置劃分的頁面粒度中提取先前的權杖。這兩種方法都會降低模型準確度和輸出品質。為了達成有效且準確的可提取 KV 快取壓縮，我們引入了 ClusterKV，它在語義叢集的粒度中提取權杖。我們設計並實作了用於叢集、選擇、索引和快取的有效演算法和系統。實驗結果顯示，ClusterKV 在各種任務中獲得極小的準確度損失，背景長度為 32k，僅使用 1k 到 2k 的 KV 快取預算，並在延遲中實現了高達 2 倍的加速，以及在解碼處理量中實現了 2.5 倍的提升。與 SoTA 可提取 KV 壓縮方法相比，ClusterKV 展示了更高的模型準確度和輸出品質，同時維持或超越推論效率。", "author": "Guangda Liu et.al.", "authors": "Guangda Liu, Chengwei Li, Jieru Zhao, Chenqi Zhang, Minyi Guo", "id": "2412.03213v1", "paper_url": "http://arxiv.org/abs/2412.03213v1", "repo": "null"}}