{"2501.14113": {"publish_time": "2025-01-23", "title": "RELexED: Retrieval-Enhanced Legal Summarization with Exemplar Diversity", "paper_summary": "This paper addresses the task of legal summarization, which involves\ndistilling complex legal documents into concise, coherent summaries. Current\napproaches often struggle with content theme deviation and inconsistent writing\nstyles due to their reliance solely on source documents. We propose RELexED, a\nretrieval-augmented framework that utilizes exemplar summaries along with the\nsource document to guide the model. RELexED employs a two-stage exemplar\nselection strategy, leveraging a determinantal point process to balance the\ntrade-off between similarity of exemplars to the query and diversity among\nexemplars, with scores computed via influence functions. Experimental results\non two legal summarization datasets demonstrate that RELexED significantly\noutperforms models that do not utilize exemplars and those that rely solely on\nsimilarity-based exemplar selection.", "paper_summary_zh": "本文探討法律摘要任務，這涉及將複雜的法律文件簡化為簡潔、連貫的摘要。目前的做法通常會因過度依賴原始文件而導致內容主題偏離和寫作風格不一致。我們提出 RELexED，一個檢索增強框架，它利用範例摘要和原始文件來指導模型。RELexED 使用兩階段範例選擇策略，利用行列式點過程來平衡範例與查詢的相似性與範例之間的多樣性，並透過影響函數計算分數。在兩個法律摘要資料集上的實驗結果表明，RELexED 明顯優於不使用範例的模型和僅依賴基於相似性的範例選擇的模型。", "author": "T. Y. S. S. Santosh et.al.", "authors": "T. Y. S. S. Santosh, Chen Jia, Patrick Goroncy, Matthias Grabmair", "id": "2501.14113v1", "paper_url": "http://arxiv.org/abs/2501.14113v1", "repo": "null"}}