{"2406.14351": {"publish_time": "2024-06-20", "title": "Automatic Labels are as Effective as Manual Labels in Biomedical Images Classification with Deep Learning", "paper_summary": "The increasing availability of biomedical data is helping to design more\nrobust deep learning (DL) algorithms to analyze biomedical samples. Currently,\none of the main limitations to train DL algorithms to perform a specific task\nis the need for medical experts to label data. Automatic methods to label data\nexist, however automatic labels can be noisy and it is not completely clear\nwhen automatic labels can be adopted to train DL models. This paper aims to\ninvestigate under which circumstances automatic labels can be adopted to train\na DL model on the classification of Whole Slide Images (WSI). The analysis\ninvolves multiple architectures, such as Convolutional Neural Networks (CNN)\nand Vision Transformer (ViT), and over 10000 WSIs, collected from three use\ncases: celiac disease, lung cancer and colon cancer, which one including\nrespectively binary, multiclass and multilabel data. The results allow\nidentifying 10% as the percentage of noisy labels that lead to train\ncompetitive models for the classification of WSIs. Therefore, an algorithm\ngenerating automatic labels needs to fit this criterion to be adopted. The\napplication of the Semantic Knowledge Extractor Tool (SKET) algorithm to\ngenerate automatic labels leads to performance comparable to the one obtained\nwith manual labels, since it generates a percentage of noisy labels between\n2-5%. Automatic labels are as effective as manual ones, reaching solid\nperformance comparable to the one obtained training models with manual labels.", "paper_summary_zh": "隨著生物醫學資料的日益普及，有助於設計更穩健的深度學習 (DL) 演算法來分析生物醫學樣本。目前，訓練 DL 演算法執行特定任務的主要限制之一在於醫學專家標記資料的需求。標記資料的自動化方法確實存在，然而自動化標籤可能會產生雜訊，而且尚不清楚何時可以採用自動化標籤來訓練 DL 模型。本文旨在探討在何種情況下可以採用自動化標籤來訓練 DL 模型對全切片影像 (WSI) 進行分類。分析涉及多種架構，例如卷積神經網路 (CNN) 和視覺Transformer (ViT)，以及超過 10000 個 WSI，這些 WSI 來自三種使用案例：乳糜瀉、肺癌和結腸癌，其中一個分別包括二元、多類和多標籤資料。結果可以將產生雜訊標籤的比例確定為 10%，這將導致訓練出具有競爭力的 WSI 分類模型。因此，產生自動化標籤的演算法需要符合此準則才能被採用。將語義知識萃取工具 (SKET) 演算法應用於產生自動化標籤，其效能可與使用人工標籤獲得的效能相媲美，因為它產生的雜訊標籤比例在 2-5% 之間。自動化標籤與人工標籤一樣有效，可達到與使用人工標籤訓練模型所獲得的效能相當的穩健效能。", "author": "Niccolò Marini et.al.", "authors": "Niccolò Marini, Stefano Marchesin, Lluis Borras Ferris, Simon Püttmann, Marek Wodzinski, Riccardo Fratti, Damian Podareanu, Alessandro Caputo, Svetla Boytcheva, Simona Vatrano, Filippo Fraggetta, Iris Nagtegaal, Gianmaria Silvello, Manfredo Atzori, Henning Müller", "id": "2406.14351v1", "paper_url": "http://arxiv.org/abs/2406.14351v1", "repo": "null"}}