{"2411.17459": {"publish_time": "2024-11-26", "title": "WF-VAE: Enhancing Video VAE by Wavelet-Driven Energy Flow for Latent Video Diffusion Model", "paper_summary": "Video Variational Autoencoder (VAE) encodes videos into a low-dimensional\nlatent space, becoming a key component of most Latent Video Diffusion Models\n(LVDMs) to reduce model training costs. However, as the resolution and duration\nof generated videos increase, the encoding cost of Video VAEs becomes a\nlimiting bottleneck in training LVDMs. Moreover, the block-wise inference\nmethod adopted by most LVDMs can lead to discontinuities of latent space when\nprocessing long-duration videos. The key to addressing the computational\nbottleneck lies in decomposing videos into distinct components and efficiently\nencoding the critical information. Wavelet transform can decompose videos into\nmultiple frequency-domain components and improve the efficiency significantly,\nwe thus propose Wavelet Flow VAE (WF-VAE), an autoencoder that leverages\nmulti-level wavelet transform to facilitate low-frequency energy flow into\nlatent representation. Furthermore, we introduce a method called Causal Cache,\nwhich maintains the integrity of latent space during block-wise inference.\nCompared to state-of-the-art video VAEs, WF-VAE demonstrates superior\nperformance in both PSNR and LPIPS metrics, achieving 2x higher throughput and\n4x lower memory consumption while maintaining competitive reconstruction\nquality. Our code and models are available at\nhttps://github.com/PKU-YuanGroup/WF-VAE.", "paper_summary_zh": "影片变异自动编码器 (VAE) 将影片编码成低维潜在空间，成为大多数潜在影片扩散模型 (LVDM) 的关键组件，以降低模型训练成本。然而，随着生成影片的分辨率和长度增加，影片 VAE 的编码成本成为训练 LVDM 的限制性瓶颈。此外，大多数 LVDM 采用的区块式推理方法在处理长时间影片时可能导致潜在空间的不连续性。解决计算瓶颈的关键在于将影片分解成不同的组件，并有效编码关键信息。小波变换可以将影片分解成多个频域组件，并显著提高效率，因此我们提出了小波流 VAE (WF-VAE)，这是一种利用多级小波变换促进低频能量流入潜在表示的自动编码器。此外，我们引入了一种称为因果缓存的方法，它在区块式推理期间保持潜在空间的完整性。与最先进的影片 VAE 相比，WF-VAE 在 PSNR 和 LPIPS 指标方面表现出优异的性能，在保持竞争性重建质量的同时，实现了 2 倍更高的吞吐量和 4 倍更低的内存消耗。我们的代码和模型可在 https://github.com/PKU-YuanGroup/WF-VAE 获得。", "author": "Zongjian Li et.al.", "authors": "Zongjian Li, Bin Lin, Yang Ye, Liuhan Chen, Xinhua Cheng, Shenghai Yuan, Li Yuan", "id": "2411.17459v1", "paper_url": "http://arxiv.org/abs/2411.17459v1", "repo": "https://github.com/pku-yuangroup/wf-vae"}}