{"2407.16148": {"publish_time": "2024-07-23", "title": "CHIME: LLM-Assisted Hierarchical Organization of Scientific Studies for Literature Review Support", "paper_summary": "Literature review requires researchers to synthesize a large amount of\ninformation and is increasingly challenging as the scientific literature\nexpands. In this work, we investigate the potential of LLMs for producing\nhierarchical organizations of scientific studies to assist researchers with\nliterature review. We define hierarchical organizations as tree structures\nwhere nodes refer to topical categories and every node is linked to the studies\nassigned to that category. Our naive LLM-based pipeline for hierarchy\ngeneration from a set of studies produces promising yet imperfect hierarchies,\nmotivating us to collect CHIME, an expert-curated dataset for this task focused\non biomedicine. Given the challenging and time-consuming nature of building\nhierarchies from scratch, we use a human-in-the-loop process in which experts\ncorrect errors (both links between categories and study assignment) in\nLLM-generated hierarchies. CHIME contains 2,174 LLM-generated hierarchies\ncovering 472 topics, and expert-corrected hierarchies for a subset of 100\ntopics. Expert corrections allow us to quantify LLM performance, and we find\nthat while they are quite good at generating and organizing categories, their\nassignment of studies to categories could be improved. We attempt to train a\ncorrector model with human feedback which improves study assignment by 12.6 F1\npoints. We release our dataset and models to encourage research on developing\nbetter assistive tools for literature review.", "paper_summary_zh": "文獻回顧需要研究人員綜合大量資訊，隨著科學文獻的擴展，這項任務也越來越具有挑戰性。在這項工作中，我們探討了 LLM 在產生科學研究的階層組織以協助研究人員進行文獻回顧的潛力。我們將階層組織定義為樹狀結構，其中節點指的是主題類別，而每個節點都連結到指派給該類別的研究。我們從一組研究中產生階層的單純 LLM 管線產生了有希望但並不完美的階層，這促使我們收集 CHIME，這是一個針對此任務的專家策展資料集，重點在生物醫學。鑑於從頭建立階層具有挑戰性且耗時，我們使用人員參與的流程，其中專家更正 LLM 產生的階層中的錯誤（類別之間的連結和研究指派）。CHIME 包含 2,174 個 LLM 產生的階層，涵蓋 472 個主題，以及 100 個主題子集的專家更正階層。專家更正讓我們能夠量化 LLM 的效能，我們發現雖然它們在產生和組織類別方面相當出色，但它們將研究指派到類別的方式可以改進。我們嘗試訓練一個具備人類回饋的校正模型，這將研究指派改進了 12.6 個 F1 點。我們釋出我們的資料集和模型，以鼓勵研究人員開發更好的文獻回顧輔助工具。", "author": "Chao-Chun Hsu et.al.", "authors": "Chao-Chun Hsu, Erin Bransom, Jenna Sparks, Bailey Kuehl, Chenhao Tan, David Wadden, Lucy Lu Wang, Aakanksha Naik", "id": "2407.16148v1", "paper_url": "http://arxiv.org/abs/2407.16148v1", "repo": "null"}}