{"2502.02562": {"publish_time": "2025-02-04", "title": "Learning the RoPEs: Better 2D and 3D Position Encodings with STRING", "paper_summary": "We introduce STRING: Separable Translationally Invariant Position Encodings.\nSTRING extends Rotary Position Encodings, a recently proposed and widely used\nalgorithm in large language models, via a unifying theoretical framework.\nImportantly, STRING still provides exact translation invariance, including\ntoken coordinates of arbitrary dimensionality, whilst maintaining a low\ncomputational footprint. These properties are especially important in robotics,\nwhere efficient 3D token representation is key. We integrate STRING into Vision\nTransformers with RGB(-D) inputs (color plus optional depth), showing\nsubstantial gains, e.g. in open-vocabulary object detection and for robotics\ncontrollers. We complement our experiments with a rigorous mathematical\nanalysis, proving the universality of our methods.", "paper_summary_zh": "我們介紹 STRING：可分離的平移不變位置編碼。\nSTRING 透過一個統一的理論框架，擴充了旋轉位置編碼，一種最近提出且廣泛用於大型語言模型的演算法。\n重要的是，STRING 仍然提供精確的平移不變性，包括任意維度的代幣座標，同時維持低計算量。這些特性在機器人技術中特別重要，其中有效的 3D 代幣表示是關鍵。我們將 STRING 整合到具有 RGB(-D) 輸入（顏色加上可選深度）的 Vision Transformers 中，顯示出顯著的增益，例如在開放詞彙物件偵測和機器人控制器中。我們以嚴謹的數學分析來補充我們的實驗，證明了我們方法的通用性。", "author": "Connor Schenck et.al.", "authors": "Connor Schenck, Isaac Reid, Mithun George Jacob, Alex Bewley, Joshua Ainslie, David Rendleman, Deepali Jain, Mohit Sharma, Avinava Dubey, Ayzaan Wahid, Sumeet Singh, Rene Wagner, Tianli Ding, Chuyuan Fu, Arunkumar Byravan, Jake Varley, Alexey Gritsenko, Matthias Minderer, Dmitry Kalashnikov, Jonathan Tompson, Vikas Sindhwani, Krzysztof Choromanski", "id": "2502.02562v1", "paper_url": "http://arxiv.org/abs/2502.02562v1", "repo": "null"}}