{"2411.11739": {"publish_time": "2024-11-18", "title": "QARM: Quantitative Alignment Multi-Modal Recommendation at Kuaishou", "paper_summary": "In recent years, with the significant evolution of multi-modal large models,\nmany recommender researchers realized the potential of multi-modal information\nfor user interest modeling. In industry, a wide-used modeling architecture is a\ncascading paradigm: (1) first pre-training a multi-modal model to provide\nomnipotent representations for downstream services; (2) The downstream\nrecommendation model takes the multi-modal representation as additional input\nto fit real user-item behaviours. Although such paradigm achieves remarkable\nimprovements, however, there still exist two problems that limit model\nperformance: (1) Representation Unmatching: The pre-trained multi-modal model\nis always supervised by the classic NLP/CV tasks, while the recommendation\nmodels are supervised by real user-item interaction. As a result, the two\nfundamentally different tasks' goals were relatively separate, and there was a\nlack of consistent objective on their representations; (2) Representation\nUnlearning: The generated multi-modal representations are always stored in\ncache store and serve as extra fixed input of recommendation model, thus could\nnot be updated by recommendation model gradient, further unfriendly for\ndownstream training. Inspired by the two difficulties challenges in downstream\ntasks usage, we introduce a quantitative multi-modal framework to customize the\nspecialized and trainable multi-modal information for different downstream\nmodels.", "paper_summary_zh": "近年來，隨著多模態大型模型的顯著演進，\n許多推薦研究者體認到多模態資訊在使用者興趣建模上的潛力。在產業中，一個廣為使用的建模架構為\n串接式範例：(1) 首先預訓練一個多模態模型，以提供下游服務的全能表示；(2) 下游推薦模型將多模態表示作為額外輸入，以符合真實使用者-項目行為。儘管此範例獲得顯著的進步，然而，仍存在兩個限制模型效能的問題：(1) 表示不匹配：預訓練的多模態模型總是受到傳統 NLP/CV 任務的監督，而推薦模型則受到真實使用者-項目互動的監督。因此，這兩個根本不同的任務目標相對獨立，並且它們的表示缺乏一致的目標；(2) 表示遺忘：產生的多模態表示總是儲存在快取儲存區中，並作為推薦模型的額外固定輸入，因此無法由推薦模型梯度更新，進一步不利於下游訓練。受到下游任務使用中的兩個困難挑戰啟發，我們引入一個量化的多模態框架，以自訂特定且可訓練的多模態資訊，供不同的下游模型使用。", "author": "Xinchen Luo et.al.", "authors": "Xinchen Luo, Jiangxia Cao, Tianyu Sun, Jinkai Yu, Rui Huang, Wei Yuan, Hezheng Lin, Yichen Zheng, Shiyao Wang, Qigen Hu, Changqing Qiu, Jiaqi Zhang, Xu Zhang, Zhiheng Yan, Jingming Zhang, Simin Zhang, Mingxing Wen, Zhaojie Liu, Kun Gai, Guorui Zhou", "id": "2411.11739v1", "paper_url": "http://arxiv.org/abs/2411.11739v1", "repo": "null"}}