{"2503.15924": {"publish_time": "2025-03-20", "title": "Towards Automatic Continual Learning: A Self-Adaptive Framework for Continual Instruction Tuning", "paper_summary": "Continual instruction tuning enables large language models (LLMs) to learn\nincrementally while retaining past knowledge, whereas existing methods\nprimarily focus on how to retain old knowledge rather than on selecting which\nnew knowledge to learn. In domain-specific contexts, maintaining data quality\nand managing system constraints remain key challenges. To address these issues,\nwe propose an automated continual instruction tuning framework that dynamically\nfilters incoming data, which identify and reduce redundant data across\nsuccessive updates. Our approach utilizes a small proxy model for efficient\nperplexity-based filtering, and updates the proxy to ensure that the filtering\ncriteria remain aligned with the evolving state of the deployed model. Compared\nto existing static data selection methods, our framework can effectively handle\nincrementally acquired data and shifting distributions. Additionally, it\naddresses practical deployment challenges by enabling seamless model updates,\nsupporting version rollback and incorporating automatic checkpoint evaluation.\nWe evaluated the system in real-world medical scenarios. It reduced\ncomputational costs by 66.7% and improved model performance, and achieved\nautonomous updates, thus demonstrating its effectiveness for automatic\ncontinual instruction tuning.", "paper_summary_zh": "<paragraph>持續教學調整讓大型語言模型 (LLM) 能夠在保留過去知識的同時逐步學習，而現有方法主要關注如何保留舊知識，而不是選擇學習哪些新知識。在特定領域的環境中，維持資料品質和管理系統限制仍然是主要挑戰。為了應對這些問題，我們提出了一個自動化的持續教學調整框架，它可以動態過濾輸入資料，識別並減少連續更新中的冗餘資料。我們的方法利用一個小型代理模型進行有效率的基於困惑度的過濾，並更新代理以確保過濾標準與已部署模型的演變狀態保持一致。與現有的靜態資料選擇方法相比，我們的框架可以有效地處理逐步獲取的資料和變化的分佈。此外，它還透過實現無縫模型更新、支援版本回滾和整合自動檢查點評估來解決實際部署挑戰。我們在真實世界的醫療場景中評估了該系統。它將計算成本降低了 66.7%，提高了模型效能，並實現了自主更新，從而證明了其在自動持續教學調整方面的有效性。</paragraph>\n", "author": "Peiyi Lin et.al.", "authors": "Peiyi Lin, Fukai Zhang, Kai Niu, Hao Fu", "id": "2503.15924v1", "paper_url": "http://arxiv.org/abs/2503.15924v1", "repo": "null"}}