{"2406.07971": {"publish_time": "2024-06-12", "title": "It Takes Two: On the Seamlessness between Reward and Policy Model in RLHF", "paper_summary": "Reinforcement Learning from Human Feedback (RLHF) involves training policy\nmodels (PMs) and reward models (RMs) to align language models with human\npreferences. Instead of focusing solely on PMs and RMs independently, we\npropose to examine their interactions during fine-tuning, introducing the\nconcept of seamlessness. Our study starts with observing the saturation\nphenomenon, where continual improvements in RM and PM do not translate into\nRLHF progress. Our analysis shows that RMs fail to assign proper scores to PM\nresponses, resulting in a 35% mismatch rate with human preferences,\nhighlighting a significant discrepancy between PM and RM. To measure\nseamlessness between PM and RM without human effort, we propose an automatic\nmetric, SEAM. SEAM quantifies the discrepancies between PM and RM judgments\ninduced by data samples. We validate the effectiveness of SEAM in data\nselection and model augmentation. Our experiments demonstrate that (1) using\nSEAM-filtered data for RL training improves RLHF performance by 4.5%, and (2)\nSEAM-guided model augmentation results in a 4% performance improvement over\nstandard augmentation methods.", "paper_summary_zh": "人類回饋強化學習 (RLHF) 涉及訓練策略模型 (PM) 和獎勵模型 (RM) 以將語言模型與人類偏好對齊。我們不只專注於 PM 和 RM，還建議在微調期間檢查它們的互動，並引入無縫性的概念。我們的研究從觀察飽和現象開始，其中 RM 和 PM 的持續改進並未轉化為 RLHF 進度。我們的分析顯示，RM 無法為 PM 回應分配適當的分數，導致與人類偏好有 35% 的不匹配率，突顯了 PM 和 RM 之間的顯著差異。為了在沒有人類參與的情況下衡量 PM 和 RM 之間的無縫性，我們提出了一個自動指標 SEAM。SEAM 量化了由資料範例引起的 PM 和 RM 判斷之間的差異。我們驗證了 SEAM 在資料選擇和模型擴充中的有效性。我們的實驗表明，(1) 使用 SEAM 過濾的資料進行 RL 訓練可將 RLHF 效能提升 4.5%，以及 (2) SEAM 引導的模型擴充比標準擴充方法帶來 4% 的效能提升。", "author": "Taiming Lu et.al.", "authors": "Taiming Lu, Lingfeng Shen, Xinyu Yang, Weiting Tan, Beidi Chen, Huaxiu Yao", "id": "2406.07971v2", "paper_url": "http://arxiv.org/abs/2406.07971v2", "repo": "https://github.com/taiminglu/seamless"}}