{"2411.12405": {"publish_time": "2024-11-19", "title": "Evaluating the Prompt Steerability of Large Language Models", "paper_summary": "Building pluralistic AI requires designing models that are able to be shaped\nto represent a wide range of value systems and cultures. Achieving this\nrequires first being able to evaluate the degree to which a given model is\ncapable of reflecting various personas. To this end, we propose a benchmark for\nevaluating the steerability of model personas as a function of prompting. Our\ndesign is based on a formal definition of prompt steerability, which analyzes\nthe degree to which a model's joint behavioral distribution can be shifted from\nits baseline behavior. By defining steerability indices and inspecting how\nthese indices change as a function of steering effort, we can estimate the\nsteerability of a model across various persona dimensions and directions. Our\nbenchmark reveals that the steerability of many current models is limited --\ndue to both a skew in their baseline behavior and an asymmetry in their\nsteerability across many persona dimensions. We release an implementation of\nour benchmark at https://github.com/IBM/prompt-steering.", "paper_summary_zh": "建立多元化 AI 需要設計能夠形塑的模型，以代表廣泛的價值系統和文化。要達成此目標，首先必須能夠評估特定模型反映各種角色的程度。為此，我們提出一個基準，用於評估模型角色的可操縱性，作為提示函數。我們的設計基於提示可操縱性的正式定義，該定義分析模型的聯合行為分布從其基準行為轉移的程度。透過定義可操縱性指標，並檢查這些指標如何隨著操縱力而改變，我們可以估計模型在各種角色面向和方向上的可操縱性。我們的基準顯示，許多當前模型的可操縱性受到限制——這歸因於其基準行為的偏差和其在許多角色面向上的可操縱性不對稱。我們在 https://github.com/IBM/prompt-steering 上發布了一個基準實作。", "author": "Erik Miehling et.al.", "authors": "Erik Miehling, Michael Desmond, Karthikeyan Natesan Ramamurthy, Elizabeth M. Daly, Pierre Dognin, Jesus Rios, Djallel Bouneffouf, Miao Liu", "id": "2411.12405v1", "paper_url": "http://arxiv.org/abs/2411.12405v1", "repo": "https://github.com/ibm/prompt-steering"}}