{"2501.07890": {"publish_time": "2025-01-14", "title": "GRAPHMOE: Amplifying Cognitive Depth of Mixture-of-Experts Network via Introducing Self-Rethinking Mechanism", "paper_summary": "Traditional Mixture-of-Experts (MoE) networks benefit from utilizing multiple\nsmaller expert models as opposed to a single large network. However, these\nexperts typically operate independently, leaving a question open about whether\ninterconnecting these models could enhance the performance of MoE networks. In\nresponse, we introduce GRAPHMOE, a novel method aimed at augmenting the\ncognitive depth of language models via a self-rethinking mechanism constructed\non Pseudo GraphMoE networks. GRAPHMOE employs a recurrent routing strategy to\nsimulate iterative thinking steps, thereby facilitating the flow of information\namong expert nodes. We implement the GRAPHMOE architecture using Low-Rank\nAdaptation techniques (LoRA) and conduct extensive experiments on various\nbenchmark datasets. The experimental results reveal that GRAPHMOE outperforms\nother LoRA based models, achieving state-of-the-art (SOTA) performance.\nAdditionally, this study explores a novel recurrent routing strategy that may\ninspire further advancements in enhancing the reasoning capabilities of\nlanguage models.", "paper_summary_zh": "傳統的混合專家 (MoE) 網路受益於使用多個較小的專家模型，而不是單一的大型網路。然而，這些專家通常獨立運作，留下一個問題，即互連這些模型是否可以增強 MoE 網路的效能。為了解決這個問題，我們引入了 GRAPHMOE，這是一種新穎的方法，旨在透過建構在偽圖形 MoE 網路上的自我反思機制來擴增語言模型的認知深度。GRAPHMOE 使用遞迴路由策略來模擬反覆的思考步驟，從而促進專家節點之間的資訊流動。我們使用低秩適應技術 (LoRA) 來實作 GRAPHMOE 架構，並在各種基準資料集上進行廣泛的實驗。實驗結果顯示 GRAPHMOE 優於其他基於 LoRA 的模型，達到了最先進 (SOTA) 的效能。此外，本研究探討了一種新穎的遞迴路由策略，這可能會激勵進一步提升語言模型推理能力的進展。", "author": "Chen Tang et.al.", "authors": "Chen Tang, Bo Lv, Zifan Zheng, Bohao Yang, Kun Zhao, Ning Liao, Xiaoxing Wang, Feiyu Xiong, Zhiyu Li, Nayu Liu, Jingchi Jiang", "id": "2501.07890v1", "paper_url": "http://arxiv.org/abs/2501.07890v1", "repo": "null"}}