{"2409.11190": {"publish_time": "2024-09-17", "title": "SuperCoder2.0: Technical Report on Exploring the feasibility of LLMs as Autonomous Programmer", "paper_summary": "We present SuperCoder2.0, an advanced autonomous system designed to enhance\nsoftware development through artificial intelligence. The system combines an\nAI-native development approach with intelligent agents to enable fully\nautonomous coding. Key focus areas include a retry mechanism with error output\ntraceback, comprehensive code rewriting and replacement using Abstract Syntax\nTree (ast) parsing to minimize linting issues, code embedding technique for\nretrieval-augmented generation, and a focus on localizing methods for\nproblem-solving rather than identifying specific line numbers. The methodology\nemploys a three-step hierarchical search space reduction approach for code base\nnavigation and bug localization:utilizing Retrieval Augmented Generation (RAG)\nand a Repository File Level Map to identify candidate files, (2) narrowing down\nto the most relevant files using a File Level Schematic Map, and (3) extracting\n'relevant locations' within these files. Code editing is performed through a\ntwo-part module comprising CodeGeneration and CodeEditing, which generates\nmultiple solutions at different temperature values and replaces entire methods\nor classes to maintain code integrity. A feedback loop executes\nrepository-level test cases to validate and refine solutions. Experiments\nconducted on the SWE-bench Lite dataset demonstrate SuperCoder2.0's\neffectiveness, achieving correct file localization in 84.33% of cases within\nthe top 5 candidates and successfully resolving 34% of test instances. This\nperformance places SuperCoder2.0 fourth globally on the SWE-bench leaderboard.\nThe system's ability to handle diverse repositories and problem types\nhighlights its potential as a versatile tool for autonomous software\ndevelopment. Future work will focus on refining the code editing process and\nexploring advanced embedding models for improved natural language to code\nmapping.", "paper_summary_zh": "<paragraph>我們提出 SuperCoder2.0，一個先進的自主系統，旨在透過人工智慧提升軟體開發。該系統結合了原生 AI 開發方法與智慧代理人，以實現完全自主編碼。主要的重點領域包括具有錯誤輸出追蹤的重試機制、使用抽象語法樹 (ast) 解析的全面程式碼改寫和替換，以最小化程式碼檢查問題、用於檢索擴充產生技術的程式碼嵌入技術，以及專注於定位方法以解決問題，而非識別特定行號。該方法採用三步驟階層式搜尋空間縮減方法，用於程式碼庫導覽和錯誤定位：利用檢索擴充產生 (RAG) 和儲存庫檔案層級對應，以識別候選檔案，(2) 使用檔案層級概觀對應縮小範圍至最相關的檔案，以及 (3) 從這些檔案中擷取「相關位置」。程式碼編輯透過包含程式碼產生和程式碼編輯的兩部分模組執行，該模組會在不同的溫度值產生多重解，並替換整個方法或類別以維護程式碼完整性。回饋迴路會執行儲存庫層級測試案例，以驗證並改善解。在 SWE-bench Lite 資料集上執行的實驗證明了 SuperCoder2.0 的效能，在 84.33% 的案例中，於前 5 名候選者中達成正確檔案定位，並成功解決 34% 的測試案例。此效能讓 SuperCoder2.0 在 SWE-bench 排行榜上排名全球第四。該系統處理不同儲存庫和問題類型的能力，突顯了其作為自主軟體開發通用工具的潛力。未來的研究將專注於改善程式碼編輯流程，並探索進階嵌入模型，以提升自然語言對程式碼的對應。</paragraph>", "author": "Anmol Gautam et.al.", "authors": "Anmol Gautam, Kishore Kumar, Adarsh Jha, Mukunda NS, Ishaan Bhola", "id": "2409.11190v1", "paper_url": "http://arxiv.org/abs/2409.11190v1", "repo": "null"}}