{"2502.12167": {"publish_time": "2025-02-13", "title": "TastepepAI, An artificial intelligence platform for taste peptide de novo design", "paper_summary": "Taste peptides have emerged as promising natural flavoring agents attributed\nto their unique organoleptic properties, high safety profile, and potential\nhealth benefits. However, the de novo identification of taste peptides derived\nfrom animal, plant, or microbial sources remains a time-consuming and\nresource-intensive process, significantly impeding their widespread application\nin the food industry. Here, we present TastePepAI, a comprehensive artificial\nintelligence framework for customized taste peptide design and safety\nassessment. As the key element of this framework, a loss-supervised adaptive\nvariational autoencoder (LA-VAE) is implemented to efficiently optimizes the\nlatent representation of sequences during training and facilitates the\ngeneration of target peptides with desired taste profiles. Notably, our model\nincorporates a novel taste-avoidance mechanism, allowing for selective flavor\nexclusion. Subsequently, our in-house developed toxicity prediction algorithm\n(SpepToxPred) is integrated in the framework to undergo rigorous safety\nevaluation of generated peptides. Using this integrated platform, we\nsuccessfully identified 73 peptides exhibiting sweet, salty, and umami,\nsignificantly expanding the current repertoire of taste peptides. This work\ndemonstrates the potential of TastePepAI in accelerating taste peptide\ndiscovery for food applications and provides a versatile framework adaptable to\nbroader peptide engineering challenges.", "paper_summary_zh": "味觉肽因其独特的感官特性、高安全性概况和潜在的健康益处而成为有前途的天然调味剂。然而，从动物、植物或微生物来源中从头鉴定味觉肽仍然是一个耗时且资源密集的过程，严重阻碍了它们在食品工业中的广泛应用。在此，我们提出了 TastePepAI，这是一个用于定制味觉肽设计和安全性评估的综合人工智能框架。作为该框架的关键元素，实现了损失监督自适应变分自动编码器 (LA-VAE)，以在训练期间有效优化序列的潜在表示，并促进生成具有所需味觉特征的目标肽。值得注意的是，我们的模型包含了一种新颖的味觉回避机制，允许选择性排除风味。随后，我们内部开发的毒性预测算法 (SpepToxPred) 被集成到框架中，以对生成的肽进行严格的安全评估。使用这个集成平台，我们成功地鉴定了 73 种表现出甜味、咸味和鲜味的肽，极大地扩展了当前的味觉肽库。这项工作展示了 TastePepAI 在加速味觉肽发现以用于食品应用方面的潜力，并提供了一个适用于更广泛的肽工程挑战的多功能框架。", "author": "Jianda Yue et.al.", "authors": "Jianda Yue, Tingting Li, Jian Ouyang, Jiawei Xu, Hua Tan, Zihui Chen, Changsheng Han, Huanyu Li, Songping Liang, Zhonghua Liu, Zhonghua Liu, Ying Wang", "id": "2502.12167v1", "paper_url": "http://arxiv.org/abs/2502.12167v1", "repo": "null"}}