{"2406.19097": {"publish_time": "2024-06-27", "title": "Fairness and Bias in Multimodal AI: A Survey", "paper_summary": "The importance of addressing fairness and bias in artificial intelligence\n(AI) systems cannot be over-emphasized. Mainstream media has been awashed with\nnews of incidents around stereotypes and bias in many of these systems in\nrecent years. In this survey, we fill a gap with regards to the minimal study\nof fairness and bias in Large Multimodal Models (LMMs) compared to Large\nLanguage Models (LLMs), providing 50 examples of datasets and models along with\nthe challenges affecting them; we identify a new category of quantifying bias\n(preuse), in addition to the two well-known ones in the literature: intrinsic\nand extrinsic; we critically discuss the various ways researchers are\naddressing these challenges. Our method involved two slightly different search\nqueries on Google Scholar, which revealed that 33,400 and 538,000 links are the\nresults for the terms \"Fairness and bias in Large Multimodal Models\" and\n\"Fairness and bias in Large Language Models\", respectively. We believe this\nwork contributes to filling this gap and providing insight to researchers and\nother stakeholders on ways to address the challenge of fairness and bias in\nmultimodal A!.", "paper_summary_zh": "在人工智能（AI）系统中解决公平性和偏差的重要性怎么强调都不为过。近年来，主流媒体充斥着许多此类系统中有关刻板印象和偏差的事件新闻。在此调查中，我们填补了与大型多模态模型（LMM）相比，在大型语言模型（LLM）中对公平性和偏差的研究最少这一差距，提供了 50 个数据集和模型的示例以及影响它们的挑战；除了文献中众所周知的内在和外在两种类别外，我们还确定了一种新的量化偏差的类别（预用）；我们批判性地讨论了研究人员解决这些挑战的各种方式。我们的方法涉及在 Google Scholar 上进行两次略有不同的搜索查询，结果显示“大型多模态模型中的公平性和偏差”和“大型语言模型中的公平性和偏差”这两个术语的搜索结果分别为 33,400 和 538,000 个链接。我们相信这项工作有助于填补这一空白，并为研究人员和其他利益相关者提供有关解决多模态人工智能中的公平性和偏差挑战的方法的见解。", "author": "Tosin Adewumi et.al.", "authors": "Tosin Adewumi, Lama Alkhaled, Namrata Gurung, Goya van Boven, Irene Pagliai", "id": "2406.19097v1", "paper_url": "http://arxiv.org/abs/2406.19097v1", "repo": "null"}}