{"2408.07192": {"publish_time": "2024-08-13", "title": "Solving Truly Massive Budgeted Monotonic POMDPs with Oracle-Guided Meta-Reinforcement Learning", "paper_summary": "Monotonic Partially Observable Markov Decision Processes (POMDPs), where the\nsystem state progressively decreases until a restorative action is performed,\ncan be used to model sequential repair problems effectively. This paper\nconsiders the problem of solving budget-constrained multi-component monotonic\nPOMDPs, where a finite budget limits the maximal number of restorative actions.\nFor a large number of components, solving such a POMDP using current methods is\ncomputationally intractable due to the exponential growth in the state space\nwith an increasing number of components. To address this challenge, we propose\na two-step approach. Since the individual components of a budget-constrained\nmulti-component monotonic POMDP are only connected via the shared budget, we\nfirst approximate the optimal budget allocation among these components using an\napproximation of each component POMDP's optimal value function which is\nobtained through a random forest model. Subsequently, we introduce an\noracle-guided meta-trained Proximal Policy Optimization (PPO) algorithm to\nsolve each of the independent budget-constrained single-component monotonic\nPOMDPs. The oracle policy is obtained by performing value iteration on the\ncorresponding monotonic Markov Decision Process (MDP). This two-step method\nprovides scalability in solving truly massive multi-component monotonic POMDPs.\nTo demonstrate the efficacy of our approach, we consider a real-world\nmaintenance scenario that involves inspection and repair of an administrative\nbuilding by a team of agents within a maintenance budget. Finally, we perform a\ncomputational complexity analysis for a varying number of components to show\nthe scalability of the proposed approach.", "paper_summary_zh": "單調部分可觀察馬可夫決策過程 (POMDP)，其中系統狀態逐漸降低，直到執行修復動作，可用於有效建模順序修復問題。本文考慮了解決預算受限的多元件單調 POMDP 的問題，其中有限的預算限制了修復動作的最大數量。對於大量的元件，使用當前方法求解這樣的 POMDP 在計算上是難以處理的，因為隨著元件數量的增加，狀態空間呈指數級增長。為了應對這一挑戰，我們提出了一個兩步法。由於預算受限的多元件單調 POMDP 的個別元件僅通過共享預算連接，我們首先使用每個元件 POMDP 的最優值函數的近似值來近似這些元件之間的最佳預算分配，該近似值是通過隨機森林模型獲得的。隨後，我們引入了一個由預言引導的元訓練近端策略優化 (PPO) 演算法，以求解每個獨立的預算受限單元件單調 POMDP。預言策略是通過對應的單調馬可夫決策過程 (MDP) 執行值迭代獲得的。這種兩步法在求解真正龐大的多元件單調 POMDP 時提供了可擴充性。為了證明我們方法的有效性，我們考慮了一個現實世界的維護場景，其中涉及一組代理人在維護預算內檢查和維修行政大樓。最後，我們對不同數量的元件執行計算複雜度分析，以展示所提出方法的可擴充性。", "author": "Manav Vora et.al.", "authors": "Manav Vora, Michael N Grussing, Melkior Ornik", "id": "2408.07192v1", "paper_url": "http://arxiv.org/abs/2408.07192v1", "repo": "null"}}