{"2409.08706": {"publish_time": "2024-09-13", "title": "L3Cube-IndicQuest: A Benchmark Questing Answering Dataset for Evaluating Knowledge of LLMs in Indic Context", "paper_summary": "Large Language Models (LLMs) have made significant progress in incorporating\nIndic languages within multilingual models. However, it is crucial to\nquantitatively assess whether these languages perform comparably to globally\ndominant ones, such as English. Currently, there is a lack of benchmark\ndatasets specifically designed to evaluate the regional knowledge of LLMs in\nvarious Indic languages. In this paper, we present the L3Cube-IndicQuest, a\ngold-standard question-answering benchmark dataset designed to evaluate how\nwell multilingual LLMs capture regional knowledge across various Indic\nlanguages. The dataset contains 200 question-answer pairs, each for English and\n19 Indic languages, covering five domains specific to the Indic region. We aim\nfor this dataset to serve as a benchmark, providing ground truth for evaluating\nthe performance of LLMs in understanding and representing knowledge relevant to\nthe Indian context. The IndicQuest can be used for both reference-based\nevaluation and LLM-as-a-judge evaluation. The dataset is shared publicly at\nhttps://github.com/l3cube-pune/indic-nlp .", "paper_summary_zh": "大型語言模型 (LLM) 在將印度語言納入多語言模型方面取得了重大進展。然而，量化評估這些語言是否表現得與全球主流語言（例如英語）相當至關重要。目前，缺乏專門設計用於評估 LLM 在各種印度語言中的區域知識的基準數據集。在本文中，我們提出了 L3Cube-IndicQuest，這是一個黃金標準問題解答基準數據集，旨在評估多語言 LLM 如何跨各種印度語言捕捉區域知識。該數據集包含 200 個問題解答對，每個都針對英語和 19 種印度語言，涵蓋印度地區特有的五個領域。我們希望此數據集可用作基準，為評估 LLM 在理解和表示與印度背景相關的知識方面的性能提供真實依據。IndicQuest 可用於基於參考的評估和 LLM 作為評審的評估。該數據集在 https://github.com/l3cube-pune/indic-nlp 公開共享。", "author": "Pritika Rohera et.al.", "authors": "Pritika Rohera, Chaitrali Ginimav, Akanksha Salunke, Gayatri Sawant, Raviraj Joshi", "id": "2409.08706v1", "paper_url": "http://arxiv.org/abs/2409.08706v1", "repo": "null"}}