{"2405.07640": {"publish_time": "2024-05-13", "title": "Hyperparameter Importance Analysis for Multi-Objective AutoML", "paper_summary": "Hyperparameter optimization plays a pivotal role in enhancing the predictive\nperformance and generalization capabilities of ML models. However, in many\napplications, we do not only care about predictive performance but also about\nobjectives such as inference time, memory, or energy consumption. In such MOO\nscenarios, determining the importance of hyperparameters poses a significant\nchallenge due to the complex interplay between the conflicting objectives. In\nthis paper, we propose the first method for assessing the importance of\nhyperparameters in the context of multi-objective hyperparameter optimization.\nOur approach leverages surrogate-based hyperparameter importance (HPI)\nmeasures, i.e. fANOVA and ablation paths, to provide insights into the impact\nof hyperparameters on the optimization objectives. Specifically, we compute the\na-priori scalarization of the objectives and determine the importance of the\nhyperparameters for different objective tradeoffs. Through extensive empirical\nevaluations on diverse benchmark datasets with three different objectives\npaired with accuracy, namely time, demographic parity, and energy consumption,\nwe demonstrate the effectiveness and robustness of our proposed method. Our\nfindings not only offer valuable guidance for hyperparameter tuning in MOO\ntasks but also contribute to advancing the understanding of HPI in complex\noptimization scenarios.", "paper_summary_zh": "超參數最佳化在提升機器學習模型的預測效能與泛化能力上扮演著關鍵的角色。然而，在許多應用中，我們不只在乎預測效能，也關心推論時間、記憶體或能量消耗等目標。在這樣的多目標最佳化情境中，由於衝突目標之間的複雜交互作用，決定超參數的重要性是一項重大的挑戰。在本文中，我們提出第一個方法來評估超參數在多目標超參數最佳化中的重要性。我們的做法利用基於代理的超參數重要性（HPI）量度，即 fANOVA 和消融路徑，以提供超參數對最佳化目標影響的見解。具體來說，我們計算目標的先驗標量化，並確定超參數對不同目標權衡的重要性。通過對具有三個不同目標（與準確度配對）的多元基準資料集進行廣泛的實證評估，即時間、人口統計同質性和能量消耗，我們證明了我們提出的方法的有效性和穩健性。我們的發現不僅為多目標最佳化任務中的超參數調整提供了有價值的指導，也有助於增進對複雜最佳化情境中 HPI 的理解。", "author": "Daphne Theodorakopoulos et.al.", "authors": "Daphne Theodorakopoulos, Frederic Stahl, Marius Lindauer", "id": "2405.07640v2", "paper_url": "http://arxiv.org/abs/2405.07640v2", "repo": "null"}}