{"2501.12979": {"publish_time": "2025-01-22", "title": "FlanEC: Exploring Flan-T5 for Post-ASR Error Correction", "paper_summary": "In this paper, we present an encoder-decoder model leveraging Flan-T5 for\npost-Automatic Speech Recognition (ASR) Generative Speech Error Correction\n(GenSEC), and we refer to it as FlanEC. We explore its application within the\nGenSEC framework to enhance ASR outputs by mapping n-best hypotheses into a\nsingle output sentence. By utilizing n-best lists from ASR models, we aim to\nimprove the linguistic correctness, accuracy, and grammaticality of final ASR\ntranscriptions. Specifically, we investigate whether scaling the training data\nand incorporating diverse datasets can lead to significant improvements in\npost-ASR error correction. We evaluate FlanEC using the HyPoradise dataset,\nproviding a comprehensive analysis of the model's effectiveness in this domain.\nFurthermore, we assess the proposed approach under different settings to\nevaluate model scalability and efficiency, offering valuable insights into the\npotential of instruction-tuned encoder-decoder models for this task.", "paper_summary_zh": "在本文中，我們提出了一個編碼器-解碼器模型，利用 Flan-T5 進行自動語音辨識 (ASR) 後的生成式語音錯誤校正 (GenSEC)，我們稱之為 FlanEC。我們在 GenSEC 框架內探索其應用，通過將 n 個最佳假設映射到一個單一的輸出句子來增強 ASR 輸出。通過利用 ASR 模型中的 n 個最佳列表，我們的目標是提高最終 ASR 轉錄的語言正確性、準確性和語法性。具體來說，我們研究了擴充訓練數據和納入多樣化數據集是否會對 ASR 後錯誤校正產生顯著的改進。我們使用 HyPoradise 數據集評估 FlanEC，對模型在這個領域的有效性進行了全面的分析。此外，我們在不同的設置下評估所提出的方法，以評估模型的可擴展性和效率，為這種任務的指令調整編碼器-解碼器模型的潛力提供了寶貴的見解。", "author": "Moreno La Quatra et.al.", "authors": "Moreno La Quatra, Valerio Mario Salerno, Yu Tsao, Sabato Marco Siniscalchi", "id": "2501.12979v1", "paper_url": "http://arxiv.org/abs/2501.12979v1", "repo": "https://github.com/morenolaquatra/flanec"}}