{"2407.18908": {"publish_time": "2024-07-26", "title": "Wolf: Captioning Everything with a World Summarization Framework", "paper_summary": "We propose Wolf, a WOrLd summarization Framework for accurate video\ncaptioning. Wolf is an automated captioning framework that adopts a\nmixture-of-experts approach, leveraging complementary strengths of Vision\nLanguage Models (VLMs). By utilizing both image and video models, our framework\ncaptures different levels of information and summarizes them efficiently. Our\napproach can be applied to enhance video understanding, auto-labeling, and\ncaptioning. To evaluate caption quality, we introduce CapScore, an LLM-based\nmetric to assess the similarity and quality of generated captions compared to\nthe ground truth captions. We further build four human-annotated datasets in\nthree domains: autonomous driving, general scenes, and robotics, to facilitate\ncomprehensive comparisons. We show that Wolf achieves superior captioning\nperformance compared to state-of-the-art approaches from the research community\n(VILA1.5, CogAgent) and commercial solutions (Gemini-Pro-1.5, GPT-4V). For\ninstance, in comparison with GPT-4V, Wolf improves CapScore both quality-wise\nby 55.6% and similarity-wise by 77.4% on challenging driving videos. Finally,\nwe establish a benchmark for video captioning and introduce a leaderboard,\naiming to accelerate advancements in video understanding, captioning, and data\nalignment. Leaderboard: https://wolfv0.github.io/leaderboard.html.", "paper_summary_zh": "<paragraph>我們提出 Wolf，一個用於準確影片字幕的 WOrLd 摘要架構。Wolf 是一個自動化的字幕架構，採用專家混合方法，利用視覺語言模型 (VLM) 的互補優勢。透過同時使用影像和影片模型，我們的架構擷取不同層級的資訊，並有效地將它們摘要出來。我們的做法可以應用於提升影片理解、自動標籤和字幕。為了評估字幕品質，我們引進 CapScore，一個基於 LLM 的指標，用於評估產生的字幕與真實字幕的相似度和品質。我們進一步在三個領域建立了四個由人標註的資料集：自動駕駛、一般場景和機器人技術，以利進行全面的比較。我們展示 Wolf 達到比研究社群的最新方法（VILA1.5、CogAgent）和商業解決方案（Gemini-Pro-1.5、GPT-4V）更優異的字幕表現。例如，與 GPT-4V 相比，Wolf 在具有挑戰性的駕駛影片中，CapScore 的品質提升了 55.6%，相似度提升了 77.4%。最後，我們為影片字幕建立了一個基準，並引進一個排行榜，旨在加速影片理解、字幕和資料比對的進展。排行榜：https://wolfv0.github.io/leaderboard.html。</paragraph>", "author": "Boyi Li et.al.", "authors": "Boyi Li, Ligeng Zhu, Ran Tian, Shuhan Tan, Yuxiao Chen, Yao Lu, Yin Cui, Sushant Veer, Max Ehrlich, Jonah Philion, Xinshuo Weng, Fuzhao Xue, Andrew Tao, Ming-Yu Liu, Sanja Fidler, Boris Ivanovic, Trevor Darrell, Jitendra Malik, Song Han, Marco Pavone", "id": "2407.18908v1", "paper_url": "http://arxiv.org/abs/2407.18908v1", "repo": "null"}}