{"2408.01880": {"publish_time": "2024-08-03", "title": "Walk Wisely on Graph: Knowledge Graph Reasoning with Dual Agents via Efficient Guidance-Exploration", "paper_summary": "Recent years, multi-hop reasoning has been widely studied for knowledge graph\n(KG) reasoning due to its efficacy and interpretability. However, previous\nmulti-hop reasoning approaches are subject to two primary shortcomings. First,\nagents struggle to learn effective and robust policies at the early phase due\nto sparse rewards. Second, these approaches often falter on specific datasets\nlike sparse knowledge graphs, where agents are required to traverse lengthy\nreasoning paths. To address these problems, we propose a multi-hop reasoning\nmodel with dual agents based on hierarchical reinforcement learning (HRL),\nwhich is named FULORA. FULORA tackles the above reasoning challenges by\neFficient GUidance-ExpLORAtion between dual agents. The high-level agent walks\non the simplified knowledge graph to provide stage-wise hints for the low-level\nagent walking on the original knowledge graph. In this framework, the low-level\nagent optimizes a value function that balances two objectives: (1) maximizing\nreturn, and (2) integrating efficient guidance from the high-level agent.\nExperiments conducted on three real-word knowledge graph datasets demonstrate\nthat FULORA outperforms RL-based baselines, especially in the case of\nlong-distance reasoning.", "paper_summary_zh": "近年來，由於多跳推理的功效和可解釋性，它已被廣泛地研究用於知識圖譜 (KG) 推理。然而，先前的多跳推理方法會受到兩個主要的缺點影響。首先，由於獎勵稀疏，代理在早期階段難以學習有效且穩健的策略。其次，這些方法經常在特定資料集上失敗，例如稀疏知識圖譜，其中需要代理遍歷冗長的推理路徑。為了解決這些問題，我們提出了一個基於階層式強化學習 (HRL) 的雙代理多跳推理模型，它被命名為 FULORA。FULORA 透過雙代理之間的 eFficient GUidance-ExpLORAtion 來解決上述推理挑戰。高階代理在簡化的知識圖譜上執行，為在原始知識圖譜上執行的低階代理提供階段性的提示。在此架構中，低階代理最佳化一個值函數，該函數平衡兩個目標：(1) 最大化回報，以及 (2) 整合來自高階代理的有效指導。在三個真實世界的知識圖譜資料集上進行的實驗證明，FULORA 優於基於 RL 的基線，特別是在長距離推理的情況下。", "author": "Zijian Wang et.al.", "authors": "Zijian Wang, Bin Wang, Haifeng Jing, Huayu Li, Hongbo Dou", "id": "2408.01880v1", "paper_url": "http://arxiv.org/abs/2408.01880v1", "repo": "null"}}