{"2412.18084": {"publish_time": "2024-12-24", "title": "Property Enhanced Instruction Tuning for Multi-task Molecule Generation with Large Language Models", "paper_summary": "Large language models (LLMs) are widely applied in various natural language\nprocessing tasks such as question answering and machine translation. However,\ndue to the lack of labeled data and the difficulty of manual annotation for\nbiochemical properties, the performance for molecule generation tasks is still\nlimited, especially for tasks involving multi-properties constraints. In this\nwork, we present a two-step framework PEIT (Property Enhanced Instruction\nTuning) to improve LLMs for molecular-related tasks. In the first step, we use\ntextual descriptions, SMILES, and biochemical properties as multimodal inputs\nto pre-train a model called PEIT-GEN, by aligning multi-modal representations\nto synthesize instruction data. In the second step, we fine-tune existing\nopen-source LLMs with the synthesized data, the resulting PEIT-LLM can handle\nmolecule captioning, text-based molecule generation, molecular property\nprediction, and our newly proposed multi-constraint molecule generation tasks.\nExperimental results show that our pre-trained PEIT-GEN outperforms MolT5 and\nBioT5 in molecule captioning, demonstrating modalities align well between\ntextual descriptions, structures, and biochemical properties. Furthermore,\nPEIT-LLM shows promising improvements in multi-task molecule generation,\nproving the scalability of the PEIT framework for various molecular tasks. We\nrelease the code, constructed instruction data, and model checkpoints in\nhttps://github.com/chenlong164/PEIT.", "paper_summary_zh": "大型語言模型 (LLM) 廣泛應用於各種自然語言處理任務，例如問答和機器翻譯。然而，由於缺乏標記數據和人工標註生化特性的難度，分子生成任務的性能仍然有限，特別是對於涉及多重屬性約束的任務。在這項工作中，我們提出了一個兩步框架 PEIT（屬性增強指令調整），以改進 LLM 以進行與分子相關的任務。在第一步中，我們使用文本描述、SMILES 和生化特性作為多模態輸入，通過對齊多模態表示來預訓練一個名為 PEIT-GEN 的模型，以合成指令數據。在第二步中，我們使用合成的數據對現有的開源 LLM 進行微調，生成的 PEIT-LLM 可以處理分子標題、基於文本的分子生成、分子屬性預測以及我們新提出的多約束分子生成任務。實驗結果表明，我們預先訓練的 PEIT-GEN 在分子標題中優於 MolT5 和 BioT5，證明了文本描述、結構和生化特性之間的模態很好地對齊。此外，PEIT-LLM 在多任務分子生成中顯示出有希望的改進，證明了 PEIT 框架對各種分子任務的可擴展性。我們在 https://github.com/chenlong164/PEIT 中發布了代碼、構建的指令數據和模型檢查點。", "author": "Xuan Lin et.al.", "authors": "Xuan Lin, Long Chen, Yile Wang, Xiangxiang Zeng, Philip S. Yu", "id": "2412.18084v1", "paper_url": "http://arxiv.org/abs/2412.18084v1", "repo": "https://github.com/chenlong164/peit"}}