{"2503.10624": {"publish_time": "2025-03-13", "title": "ETCH: Generalizing Body Fitting to Clothed Humans via Equivariant Tightness", "paper_summary": "Fitting a body to a 3D clothed human point cloud is a common yet challenging\ntask. Traditional optimization-based approaches use multi-stage pipelines that\nare sensitive to pose initialization, while recent learning-based methods often\nstruggle with generalization across diverse poses and garment types. We propose\nEquivariant Tightness Fitting for Clothed Humans, or ETCH, a novel pipeline\nthat estimates cloth-to-body surface mapping through locally approximate SE(3)\nequivariance, encoding tightness as displacement vectors from the cloth surface\nto the underlying body. Following this mapping, pose-invariant body features\nregress sparse body markers, simplifying clothed human fitting into an\ninner-body marker fitting task. Extensive experiments on CAPE and 4D-Dress show\nthat ETCH significantly outperforms state-of-the-art methods -- both\ntightness-agnostic and tightness-aware -- in body fitting accuracy on loose\nclothing (16.7% ~ 69.5%) and shape accuracy (average 49.9%). Our equivariant\ntightness design can even reduce directional errors by (67.2% ~ 89.8%) in\none-shot (or out-of-distribution) settings. Qualitative results demonstrate\nstrong generalization of ETCH, regardless of challenging poses, unseen shapes,\nloose clothing, and non-rigid dynamics. We will release the code and models\nsoon for research purposes at https://boqian-li.github.io/ETCH/.", "paper_summary_zh": "<paragraph>將身體擬合到 3D 穿衣人體點雲是一個常見但具有挑戰性的任務。傳統的基於優化的方法使用對姿勢初始化敏感的多階段流程，而最近基於學習的方法通常難以泛化到不同的姿勢和服裝類型。我們提出了用於穿衣人體的等變緊密度擬合，或稱 ETCH，這是一種新穎的流程，它通過局部近似 SE(3) 等變性來估計布料到身體表面的映射，將緊密度編碼為從布料表面到底層身體的位移向量。遵循此映射，姿勢不變的身體特徵回歸稀疏的身體標記，將穿衣人體擬合簡化為體內標記擬合任務。在 CAPE 和 4D-Dress 上進行的大量實驗表明，ETCH 在寬鬆服裝的身體擬合精度 (16.7% ~ 69.5%) 和形狀精度（平均 49.9%）方面顯著優於最先進的方法——無論是否考慮緊密度。我們的等變緊密度設計甚至可以在一次性（或分佈外）設置中減少方向誤差 (67.2% ~ 89.8%)。定性結果證明了 ETCH 的強泛化性，無論是具有挑戰性的姿勢、未見過的形狀、寬鬆的服裝還是非剛性動力學。我們將很快在 https://boqian-li.github.io/ETCH/ 上發布程式碼和模型，以供研究之用。</paragraph>\n", "author": "Boqian Li et.al.", "authors": "Boqian Li, Haiwen Feng, Zeyu Cai, Michael J. Black, Yuliang Xiu", "id": "2503.10624v1", "paper_url": "http://arxiv.org/abs/2503.10624v1", "repo": "https://github.com/boqian-li/ETCH"}}