{"2405.20189": {"publish_time": "2024-05-30", "title": "Nadine: An LLM-driven Intelligent Social Robot with Affective Capabilities and Human-like Memory", "paper_summary": "In this work, we describe our approach to developing an intelligent and\nrobust social robotic system for the Nadine social robot platform. We achieve\nthis by integrating Large Language Models (LLMs) and skilfully leveraging the\npowerful reasoning and instruction-following capabilities of these types of\nmodels to achieve advanced human-like affective and cognitive capabilities.\nThis approach is novel compared to the current state-of-the-art LLM-based\nagents which do not implement human-like long-term memory or sophisticated\nemotional appraisal. The naturalness of social robots, consisting of multiple\nmodules, highly depends on the performance and capabilities of each component\nof the system and the seamless integration of the components. We built a social\nrobot system that enables generating appropriate behaviours through multimodal\ninput processing, bringing episodic memories accordingly to the recognised\nuser, and simulating the emotional states of the robot induced by the\ninteraction with the human partner. In particular, we introduce an LLM-agent\nframe for social robots, SoR-ReAct, serving as a core component for the\ninteraction module in our system. This design has brought forth the advancement\nof social robots and aims to increase the quality of human-robot interaction.", "paper_summary_zh": "在這項工作中，我們描述了我們開發智慧且強健的社交機器人系統的方法，以用於 Nadine 社交機器人平台。我們透過整合大型語言模型 (LLM) 並巧妙地利用這些類型模型強大的推理和遵循指示的能力，來達成此目標，進而實現進階的人類情感和認知能力。與目前最先進、基於 LLM 的代理程式相比，這種方法是創新的，因為它沒有實作人類長期記憶或複雜的情緒評估。社交機器人的自然性包含多個模組，高度依賴於系統中每個元件的效能和功能，以及元件之間的無縫整合。我們建構了一個社交機器人系統，能夠透過多模式輸入處理來產生適當的行為，根據辨識出的使用者提供情境記憶，並模擬機器人因與人類夥伴互動而產生的情緒狀態。特別是，我們為社交機器人引進了一個 LLM 代理程式架構 SoR-ReAct，作為我們系統中互動模組的核心元件。此設計促成了社交機器人的進步，並旨在提升人機互動的品質。", "author": "Hangyeol Kang et.al.", "authors": "Hangyeol Kang, Maher Ben Moussa, Nadia Magnenat-Thalmann", "id": "2405.20189v1", "paper_url": "http://arxiv.org/abs/2405.20189v1", "repo": "null"}}