{"2405.08099": {"publish_time": "2024-05-13", "title": "KET-QA: A Dataset for Knowledge Enhanced Table Question Answering", "paper_summary": "Due to the concise and structured nature of tables, the knowledge contained\ntherein may be incomplete or missing, posing a significant challenge for table\nquestion answering (TableQA) and data analysis systems. Most existing datasets\neither fail to address the issue of external knowledge in TableQA or only\nutilize unstructured text as supplementary information for tables. In this\npaper, we propose to use a knowledge base (KB) as the external knowledge source\nfor TableQA and construct a dataset KET-QA with fine-grained gold evidence\nannotation. Each table in the dataset corresponds to a sub-graph of the entire\nKB, and every question requires the integration of information from both the\ntable and the sub-graph to be answered. To extract pertinent information from\nthe vast knowledge sub-graph and apply it to TableQA, we design a\nretriever-reasoner structured pipeline model. Experimental results demonstrate\nthat our model consistently achieves remarkable relative performance\nimprovements ranging from 1.9 to 6.5 times and absolute improvements of 11.66%\nto 44.64% on EM scores across three distinct settings (fine-tuning, zero-shot,\nand few-shot), in comparison with solely relying on table information in the\ntraditional TableQA manner. However, even the best model achieves a 60.23% EM\nscore, which still lags behind the human-level performance, highlighting the\nchallenging nature of KET-QA for the question-answering community. We also\nprovide a human evaluation of error cases to analyze further the aspects in\nwhich the model can be improved. Project page: https://ketqa.github.io/.", "paper_summary_zh": "<paragraph>由於表格簡潔且結構化的特性，其中包含的知識可能不完整或缺失，對表格問答 (TableQA) 和資料分析系統構成重大挑戰。大多數現有資料集無法解決 TableQA 中外部知識的問題，或者僅將非結構化文字用作表格的補充資訊。在本文中，我們建議使用知識庫 (KB) 作為 TableQA 的外部知識來源，並建構一個具有細粒度黃金證據註解的資料集 KET-QA。資料集中的每個表格都對應於整個 KB 的子圖，每個問題都需要整合來自表格和子圖的資訊才能回答。為了從龐大的知識子圖中提取相關資訊並將其應用於 TableQA，我們設計了一個檢索器推理結構管道模型。實驗結果表明，我們的模型在三個不同的設定（微調、零次學習和少次學習）中，與傳統 TableQA 方式僅依賴表格資訊相比，始終都能獲得顯著的相對效能提升，範圍從 1.9 倍到 6.5 倍，EM 得分絕對提升 11.66% 到 44.64%。然而，即使是最好的模型也只達到 60.23% 的 EM 得分，這仍然落後於人類的表現，突顯了 KET-QA 對問答社群的挑戰性。我們還提供了錯誤案例的人類評估，以進一步分析模型可以改進的方面。專案頁面：https://ketqa.github.io/。</paragraph>", "author": "Mengkang Hu et.al.", "authors": "Mengkang Hu, Haoyu Dong, Ping Luo, Shi Han, Dongmei Zhang", "id": "2405.08099v1", "paper_url": "http://arxiv.org/abs/2405.08099v1", "repo": "null"}}