{"2501.11953": {"publish_time": "2025-01-21", "title": "Proverbs Run in Pairs: Evaluating Proverb Translation Capability of Large Language Model", "paper_summary": "Despite achieving remarkable performance, machine translation (MT) research\nremains underexplored in terms of translating cultural elements in languages,\nsuch as idioms, proverbs, and colloquial expressions. This paper investigates\nthe capability of state-of-the-art neural machine translation (NMT) and large\nlanguage models (LLMs) in translating proverbs, which are deeply rooted in\ncultural contexts. We construct a translation dataset of standalone proverbs\nand proverbs in conversation for four language pairs. Our experiments show that\nthe studied models can achieve good translation between languages with similar\ncultural backgrounds, and LLMs generally outperform NMT models in proverb\ntranslation. Furthermore, we find that current automatic evaluation metrics\nsuch as BLEU, CHRF++ and COMET are inadequate for reliably assessing the\nquality of proverb translation, highlighting the need for more culturally aware\nevaluation metrics.", "paper_summary_zh": "儘管機器翻譯 (MT) 研究已取得顯著的成效，但在翻譯語言中的文化元素，例如成語、諺語和口語表達方面仍未充分探討。本文探討了最先進的神經機器翻譯 (NMT) 和大型語言模型 (LLM) 在翻譯諺語方面的能力，而諺語深深植根於文化背景中。我們建構了一個包含四種語言對的獨立諺語和對話中諺語的翻譯資料集。我們的實驗表明，所研究的模型可以在文化背景相似的語言之間實現良好的翻譯，而 LLM 通常在諺語翻譯中優於 NMT 模型。此外，我們發現目前的自動評估指標，例如 BLEU、CHRF++ 和 COMET，不足以可靠地評估諺語翻譯的品質，這突顯了對更具文化意識的評估指標的需求。", "author": "Minghan Wang et.al.", "authors": "Minghan Wang, Viet-Thanh Pham, Farhad Moghimifar, Thuy-Trang Vu", "id": "2501.11953v1", "paper_url": "http://arxiv.org/abs/2501.11953v1", "repo": "null"}}