{"2411.03806": {"publish_time": "2024-11-06", "title": "Understanding the Effects of Human-written Paraphrases in LLM-generated Text Detection", "paper_summary": "Natural Language Generation has been rapidly developing with the advent of\nlarge language models (LLMs). While their usage has sparked significant\nattention from the general public, it is important for readers to be aware when\na piece of text is LLM-generated. This has brought about the need for building\nmodels that enable automated LLM-generated text detection, with the aim of\nmitigating potential negative outcomes of such content. Existing LLM-generated\ndetectors show competitive performances in telling apart LLM-generated and\nhuman-written text, but this performance is likely to deteriorate when\nparaphrased texts are considered. In this study, we devise a new data\ncollection strategy to collect Human & LLM Paraphrase Collection (HLPC), a\nfirst-of-its-kind dataset that incorporates human-written texts and\nparaphrases, as well as LLM-generated texts and paraphrases. With the aim of\nunderstanding the effects of human-written paraphrases on the performance of\nstate-of-the-art LLM-generated text detectors OpenAI RoBERTa and watermark\ndetectors, we perform classification experiments that incorporate human-written\nparaphrases, watermarked and non-watermarked LLM-generated documents from GPT\nand OPT, and LLM-generated paraphrases from DIPPER and BART. The results show\nthat the inclusion of human-written paraphrases has a significant impact of\nLLM-generated detector performance, promoting TPR@1%FPR with a possible\ntrade-off of AUROC and accuracy.", "paper_summary_zh": "<paragraph>隨著大型語言模型 (LLM) 的出現，自然語言生成技術獲得了快速發展。儘管其使用引起了公眾的極大關注，但讀者在閱讀 LLM 生成的文本時，了解其來源非常重要。這使得建立模型以實現自動 LLM 生成的文本檢測變得十分必要，目的是減輕此類內容潛在的負面影響。現有的 LLM 生成的檢測器在區分 LLM 生成的文本和人類撰寫的文本方面表現出色，但當考慮到改寫的文本時，這種表現可能會下降。在本研究中，我們設計了一種新的數據收集策略，用於收集人類和 LLM 改寫語料庫 (HLPC)，這是一個首創的數據集，包含人類撰寫的文本和改寫，以及 LLM 生成的文本和改寫。為了了解人類撰寫的改寫對最先進的 LLM 生成的文本檢測器 OpenAI RoBERTa 和水印檢測器的效能的影響，我們進行了分類實驗，其中包含人類撰寫的改寫、帶水印和不帶水印的 GPT 和 OPT 生成的 LLM 文件，以及 DIPPER 和 BART 生成的 LLM 改寫。結果表明，包含人類撰寫的改寫對 LLM 生成的檢測器效能有顯著影響，以可能的 AUROC 和準確性的權衡來提升 TPR@1%FPR。</paragraph>", "author": "Hiu Ting Lau et.al.", "authors": "Hiu Ting Lau, Arkaitz Zubiaga", "id": "2411.03806v1", "paper_url": "http://arxiv.org/abs/2411.03806v1", "repo": "null"}}