{"2409.15804": {"publish_time": "2024-09-24", "title": "NER-Luxury: Named entity recognition for the fashion and luxury domain", "paper_summary": "In this study, we address multiple challenges of developing a named-entity\nrecognition model in English for the fashion and luxury industry, namely the\nentity disambiguation, French technical jargon in multiple sub-sectors,\nscarcity of the ESG methodology, and a disparate company structures of the\nsector with small and medium-sized luxury houses to large conglomerate\nleveraging economy of scale.\n  In this work, we introduce a taxonomy of 36+ entity types with a\nluxury-oriented annotation scheme, and create a dataset of more than 40K\nsentences respecting a clear hierarchical classification. We also present five\nsupervised fine-tuned models NER-Luxury for fashion, beauty, watches, jewelry,\nfragrances, cosmetics, and overall luxury, focusing equally on the aesthetic\nside and the quantitative side.\n  In an additional experiment, we compare in a quantitative empirical\nassessment of the NER performance of our models against the state-of-the-art\nopen-source large language models that show promising results and highlights\nthe benefits of incorporating a bespoke NER model in existing machine learning\npipelines.", "paper_summary_zh": "在本次研究中，我们解决了针对时尚和奢侈品行业以英语开发命名实体识别模型的多项挑战，即实体消歧、多个子行业的法语技术术语、ESG 方法论的稀缺性以及该行业中从小型和中型奢侈品公司到利用规模经济的大型集团的差异化公司结构。\n在这项工作中，我们引入了一个包含 36+ 种实体类型的分类法，并采用以奢侈品为导向的注释方案，创建了一个包含超过 40K 个句子的数据集，这些句子遵循清晰的分层分类。我们还展示了五个针对时尚、美容、手表、珠宝、香水、化妆品和整体奢侈品的经过监督的微调模型 NER-Luxury，这些模型同样注重美学方面和定量方面。\n在附加实验中，我们对模型的 NER 性能进行了定量经验评估，并将其与显示出有希望的结果的最新开源大型语言模型进行了比较，并突出了在现有机器学习管道中合并定制 NER 模型的好处。", "author": "Akim Mousterou et.al.", "authors": "Akim Mousterou", "id": "2409.15804v1", "paper_url": "http://arxiv.org/abs/2409.15804v1", "repo": "null"}}