{"2408.04363": {"publish_time": "2024-08-08", "title": "Simulating Articulatory Trajectories with Phonological Feature Interpolation", "paper_summary": "As a first step towards a complete computational model of speech learning\ninvolving perception-production loops, we investigate the forward mapping\nbetween pseudo-motor commands and articulatory trajectories. Two phonological\nfeature sets, based respectively on generative and articulatory phonology, are\nused to encode a phonetic target sequence. Different interpolation techniques\nare compared to generate smooth trajectories in these feature spaces, with a\npotential optimisation of the target value and timing to capture\nco-articulation effects. We report the Pearson correlation between a linear\nprojection of the generated trajectories and articulatory data derived from a\nmulti-speaker dataset of electromagnetic articulography (EMA) recordings. A\ncorrelation of 0.67 is obtained with an extended feature set based on\ngenerative phonology and a linear interpolation technique. We discuss the\nimplications of our results for our understanding of the dynamics of biological\nmotion.", "paper_summary_zh": "作為朝向涉及知覺-產生迴路的完整語音學習計算模型邁出的第一步，我們研究了偽動作命令和語音軌跡之間的前向映射。兩個音韻特徵集分別基於生成音韻學和語音音韻學，用於編碼音標目標序列。比較不同的插值技術以在這些特徵空間中產生平滑軌跡，並對目標值和時間進行潛在最佳化以捕捉共發音效應。我們報告了生成軌跡的線性投影與從電磁語音描記 (EMA) 記錄的多說話者數據集派生的語音數據之間的皮爾森相關性。使用基於生成音韻學和線性插值技術的擴展特徵集，獲得 0.67 的相關性。我們討論了我們的結果對我們理解生物運動動力學的影響。", "author": "Angelo Ortiz Tandazo et.al.", "authors": "Angelo Ortiz Tandazo, Thomas Schatz, Thomas Hueber, Emmanuel Dupoux", "id": "2408.04363v1", "paper_url": "http://arxiv.org/abs/2408.04363v1", "repo": "null"}}