{"2502.02173": {"publish_time": "2025-02-04", "title": "Mass-Editing Memory with Attention in Transformers: A cross-lingual exploration of knowledge", "paper_summary": "Recent research has explored methods for updating and modifying factual\nknowledge in large language models, often focusing on specific multi-layer\nperceptron blocks. This study expands on this work by examining the\neffectiveness of existing knowledge editing methods across languages and\ndelving into the role of attention mechanisms in this process. Drawing from the\ninsights gained, we propose Mass-Editing Memory with Attention in Transformers\n(MEMAT), a method that achieves significant improvements in all metrics while\nrequiring minimal parameter modifications. MEMAT delivers a remarkable 10%\nincrease in magnitude metrics, benefits languages not included in the training\ndata and also demonstrates a high degree of portability. Our code and data are\nat https://github.com/dtamayo-nlp/MEMAT.", "paper_summary_zh": "最近的研究探索了在大型语言模型中更新和修改事实知识的方法，通常专注于特定多层感知器块。本研究通过检查现有的知识编辑方法在不同语言中的有效性，并深入研究注意力机制在此过程中的作用，扩展了这项工作。从获得的见解中，我们提出了 Transformer 中带有注意力的 Mass-Editing Memory (MEMAT)，这是一种在所有指标上实现显著改进的方法，同时需要最小的参数修改。MEMAT 在幅度指标上实现了惊人的 10% 的增长，有利于未包含在训练数据中的语言，并且还展示了高度的可移植性。我们的代码和数据位于 https://github.com/dtamayo-nlp/MEMAT。", "author": "Daniel Tamayo et.al.", "authors": "Daniel Tamayo, Aitor Gonzalez-Agirre, Javier Hernando, Marta Villegas", "id": "2502.02173v1", "paper_url": "http://arxiv.org/abs/2502.02173v1", "repo": "null"}}