{"2406.03274": {"publish_time": "2024-06-05", "title": "Enhancing CTC-based speech recognition with diverse modeling units", "paper_summary": "In recent years, the evolution of end-to-end (E2E) automatic speech\nrecognition (ASR) models has been remarkable, largely due to advances in deep\nlearning architectures like transformer. On top of E2E systems, researchers\nhave achieved substantial accuracy improvement by rescoring E2E model's N-best\nhypotheses with a phoneme-based model. This raises an interesting question\nabout where the improvements come from other than the system combination\neffect. We examine the underlying mechanisms driving these gains and propose an\nefficient joint training approach, where E2E models are trained jointly with\ndiverse modeling units. This methodology does not only align the strengths of\nboth phoneme and grapheme-based models but also reveals that using these\ndiverse modeling units in a synergistic way can significantly enhance model\naccuracy. Our findings offer new insights into the optimal integration of\nheterogeneous modeling units in the development of more robust and accurate ASR\nsystems.", "paper_summary_zh": "近年來，端對端（E2E）自動語音辨識（ASR）模型的演進備受矚目，這在很大程度上要歸功於深度學習架構（例如 Transformer）的進步。在 E2E 系統之上，研究人員透過使用基於音素的模型重新評分 E2E 模型的 N 個最佳假設，進而大幅提升了準確度。這引發了一個有趣的問題，即除了系統組合效應之外，改進來自何處。我們探討了驅動這些增益的底層機制，並提出了一種高效的聯合訓練方法，其中 E2E 模型與多樣化的建模單元聯合訓練。這種方法不僅結合了基於音素和音素的模型的優點，還揭示了以協同方式使用這些多樣化的建模單元可以顯著提升模型準確度。我們的研究結果為在開發更強大、更準確的 ASR 系統時，如何最佳整合異質建模單元提供了新的見解。", "author": "Shiyi Han et.al.", "authors": "Shiyi Han, Zhihong Lei, Mingbin Xu, Xingyu Na, Zhen Huang", "id": "2406.03274v1", "paper_url": "http://arxiv.org/abs/2406.03274v1", "repo": "null"}}