{"2407.15441": {"publish_time": "2024-07-22", "title": "Developing a Reliable, General-Purpose Hallucination Detection and Mitigation Service: Insights and Lessons Learned", "paper_summary": "Hallucination, a phenomenon where large language models (LLMs) produce output\nthat is factually incorrect or unrelated to the input, is a major challenge for\nLLM applications that require accuracy and dependability. In this paper, we\nintroduce a reliable and high-speed production system aimed at detecting and\nrectifying the hallucination issue within LLMs. Our system encompasses named\nentity recognition (NER), natural language inference (NLI), span-based\ndetection (SBD), and an intricate decision tree-based process to reliably\ndetect a wide range of hallucinations in LLM responses. Furthermore, our team\nhas crafted a rewriting mechanism that maintains an optimal mix of precision,\nresponse time, and cost-effectiveness. We detail the core elements of our\nframework and underscore the paramount challenges tied to response time,\navailability, and performance metrics, which are crucial for real-world\ndeployment of these technologies. Our extensive evaluation, utilizing offline\ndata and live production traffic, confirms the efficacy of our proposed\nframework and service.", "paper_summary_zh": "幻覺，一種大型語言模型 (LLM) 產生輸出結果不符合事實或與輸入無關的現象，對於需要準確性和可靠性的 LLM 應用程式來說是一項重大挑戰。在本文中，我們將介紹一個可靠且高速的生產系統，旨在偵測和修正 LLM 中的幻覺問題。我們的系統包含命名實體辨識 (NER)、自然語言推論 (NLI)、基於區間的偵測 (SBD) 和一個複雜的決策樹為基礎的流程，以可靠地偵測 LLM 回應中的各種幻覺。此外，我們的團隊設計了一個改寫機制，以維持最佳的精準度、回應時間和成本效益組合。我們詳細說明了我們架構的核心元素，並強調與回應時間、可用性和效能指標相關的主要挑戰，這些指標對於這些技術的實際部署至關重要。我們廣泛的評估，利用離線資料和實時生產流量，證實了我們提出的架構和服務的效能。", "author": "Song Wang et.al.", "authors": "Song Wang, Xun Wang, Jie Mei, Yujia Xie, Sean Muarray, Zhang Li, Lingfeng Wu, Si-Qing Chen, Wayne Xiong", "id": "2407.15441v1", "paper_url": "http://arxiv.org/abs/2407.15441v1", "repo": "null"}}