{"2408.10532": {"publish_time": "2024-08-20", "title": "NutrifyAI: An AI-Powered System for Real-Time Food Detection, Nutritional Analysis, and Personalized Meal Recommendations", "paper_summary": "With diet and nutrition apps reaching 1.4 billion users in 2022 [1], it's no\nsurprise that health apps like MyFitnessPal, Noom, and Calorie Counter, are\nsurging in popularity. However, one major setback [2] of nearly all nutrition\napplications is that users must enter food data manually, which is\ntime-consuming and tedious. Thus, there has been an increasing demand for\napplications that can accurately identify food items, analyze their nutritional\ncontent, and offer dietary recommendations in real-time. This paper introduces\na comprehensive system that combines advanced computer vision techniques with\nnutrition analysis, implemented in a versatile mobile and web application. The\nsystem is divided into three key components: 1) food detection using the YOLOv8\nmodel, 2) nutrient analysis via the Edamam Nutrition Analysis API, and 3)\npersonalized meal recommendations using the Edamam Meal Planning and Recipe\nSearch APIs. Designed for both mobile and web platforms, the application\nensures fast processing times with an intuitive user interface, with features\nsuch as data visualizations using Chart.js, a login system, and personalized\nsettings for dietary preferences, allergies, and cuisine choices. Preliminary\nresults showcase the system's effectiveness, making it a valuable tool for\nusers to make informed dietary decisions.", "paper_summary_zh": "隨著飲食和營養應用程式在 2022 年達到 14 億使用者 [1]，MyFitnessPal、Noom 和 Calorie Counter 等健康應用程式大幅竄紅也就不足為奇了。然而，幾乎所有營養應用程式的一個主要缺點 [2] 是使用者必須手動輸入食物資料，這既耗時又乏味。因此，對於能夠準確辨識食物品項、分析其營養成分，並即時提供飲食建議的應用程式需求日益增加。本文介紹了一個全面的系統，結合了先進的電腦視覺技術與營養分析，並實作於一個多功能的手機和網路應用程式中。這個系統分為三個關鍵組成部分：1) 使用 YOLOv8 模型進行食物偵測，2) 透過 Edamam 營養分析 API 進行營養分析，以及 3) 使用 Edamam 餐點規劃和食譜搜尋 API 提供個人化餐點建議。此應用程式專為手機和網路平台設計，具備直覺的使用者介面，並提供快速處理時間，其功能包括使用 Chart.js 的資料視覺化、登入系統，以及針對飲食偏好、過敏原和料理選擇的個人化設定。初步結果證明了此系統的有效性，使其成為使用者做出明智飲食決策的寶貴工具。", "author": "Michelle Han et.al.", "authors": "Michelle Han, Junyao Chen", "id": "2408.10532v1", "paper_url": "http://arxiv.org/abs/2408.10532v1", "repo": "null"}}