{"2502.03418": {"publish_time": "2025-02-05", "title": "Think or Step-by-Step? UnZIPping the Black Box in Zero-Shot Prompts", "paper_summary": "Zero-shot prompting techniques have significantly improved the performance of\nLarge Language Models (LLMs). However, we lack a clear understanding of why\nzero-shot prompts are so effective. For example, in the prompt \"Let's think\nstep-by-step,\" is \"think\" or \"step-by-step\" more crucial to its success?\nExisting interpretability methods, such as gradient-based and attention-based\napproaches, are computationally intensive and restricted to open-source models.\nWe introduce the ZIP score (Zero-shot Importance of Perturbation score), a\nversatile metric applicable to both open and closed-source models, based on\nsystematic input word perturbations. Our experiments across four recent LLMs,\nseven widely-used prompts, and several tasks, reveal interesting patterns in\nword importance. For instance, while both 'step-by-step' and 'think' show high\nZIP scores, which one is more influential depends on the model and task. We\nvalidate our method using controlled experiments and compare our results with\nhuman judgments, finding that proprietary models align more closely with human\nintuition regarding word significance. These findings enhance our understanding\nof LLM behavior and contribute to developing more effective zero-shot prompts\nand improved model analysis.", "paper_summary_zh": "零次提示技術大幅提升了大型語言模型 (LLM) 的效能。然而，我們對於零次提示為何如此有效仍缺乏明確的理解。例如，在提示「讓我們一步一步思考」中，「思考」或「一步一步」哪個對其成功更為關鍵？現有的可解釋性方法（例如基於梯度和基於注意力的方法）計算密集，且僅限於開源模型。我們引入了 ZIP 分數（零次擾動重要性分數），這是一個通用的指標，適用於開源和閉源模型，基於系統性輸入詞彙擾動。我們針對四個最近的 LLM、七個廣泛使用的提示和多項任務進行的實驗，揭示了詞彙重要性的有趣模式。例如，雖然「一步一步」和「思考」都顯示出很高的 ZIP 分數，但哪一個更有影響力取決於模型和任務。我們使用受控實驗驗證了我們的模型，並將我們的結果與人類判斷進行比較，發現專有模型與人類對詞彙重要性的直覺更為一致。這些發現增進了我們對 LLM 行為的理解，並有助於開發更有效的零次提示和改進模型分析。", "author": "Nikta Gohari Sadr et.al.", "authors": "Nikta Gohari Sadr, Sangmitra Madhusudan, Ali Emami", "id": "2502.03418v1", "paper_url": "http://arxiv.org/abs/2502.03418v1", "repo": "null"}}