{"2408.02439": {"publish_time": "2024-08-05", "title": "Long Input Benchmark for Russian Analysis", "paper_summary": "Recent advancements in Natural Language Processing (NLP) have fostered the\ndevelopment of Large Language Models (LLMs) that can solve an immense variety\nof tasks. One of the key aspects of their application is their ability to work\nwith long text documents and to process long sequences of tokens. This has\ncreated a demand for proper evaluation of long-context understanding. To\naddress this need for the Russian language, we propose LIBRA (Long Input\nBenchmark for Russian Analysis), which comprises 21 adapted datasets to study\nthe LLM's abilities to understand long texts thoroughly. The tests are divided\ninto four complexity groups and allow the evaluation of models across various\ncontext lengths ranging from 4k up to 128k tokens. We provide the open-source\ndatasets, codebase, and public leaderboard for LIBRA to guide forthcoming\nresearch.", "paper_summary_zh": "自然語言處理 (NLP) 的最新進展促進了大型語言模型 (LLM) 的發展，它能解決各種各樣的任務。其應用的一個關鍵方面是它們處理長文本文件和處理長序列代幣的能力。這對長語境理解的適當評估產生了需求。為了滿足俄語的需求，我們提出了 LIBRA（俄語分析長輸入基準），它包含 21 個適用的數據集，用於研究 LLM 全面理解長文本的能力。測試分為四個複雜度組，並允許評估模型在從 4k 到 128k 代幣的各種語境長度。我們提供 LIBRA 的開源數據集、代碼庫和公開排行榜，以指導後續研究。", "author": "Igor Churin et.al.", "authors": "Igor Churin, Murat Apishev, Maria Tikhonova, Denis Shevelev, Aydar Bulatov, Yuri Kuratov, Sergej Averkiev, Alena Fenogenova", "id": "2408.02439v1", "paper_url": "http://arxiv.org/abs/2408.02439v1", "repo": "null"}}