{"2502.10038": {"publish_time": "2025-02-14", "title": "POI-Enhancer: An LLM-based Semantic Enhancement Framework for POI Representation Learning", "paper_summary": "POI representation learning plays a crucial role in handling tasks related to\nuser mobility data. Recent studies have shown that enriching POI\nrepresentations with multimodal information can significantly enhance their\ntask performance. Previously, the textual information incorporated into POI\nrepresentations typically involved only POI categories or check-in content,\nleading to relatively weak textual features in existing methods. In contrast,\nlarge language models (LLMs) trained on extensive text data have been found to\npossess rich textual knowledge. However leveraging such knowledge to enhance\nPOI representation learning presents two key challenges: first, how to extract\nPOI-related knowledge from LLMs effectively, and second, how to integrate the\nextracted information to enhance POI representations. To address these\nchallenges, we propose POI-Enhancer, a portable framework that leverages LLMs\nto improve POI representations produced by classic POI learning models. We\nfirst design three specialized prompts to extract semantic information from\nLLMs efficiently. Then, the Dual Feature Alignment module enhances the quality\nof the extracted information, while the Semantic Feature Fusion module\npreserves its integrity. The Cross Attention Fusion module then fully\nadaptively integrates such high-quality information into POI representations\nand Multi-View Contrastive Learning further injects human-understandable\nsemantic information into these representations. Extensive experiments on three\nreal-world datasets demonstrate the effectiveness of our framework, showing\nsignificant improvements across all baseline representations.", "paper_summary_zh": "POI 表示學習在處理與使用者行動資料相關的任務中扮演著至關重要的角色。最近的研究顯示，使用多模態資訊豐富 POI 表示可以大幅提升其任務效能。先前納入 POI 表示的文字資訊通常只包含 POI 類別或報到內容，導致現有方法中的文字特徵相對薄弱。相比之下，在大量文字資料上訓練的大型語言模型 (LLM) 被發現擁有豐富的文字知識。然而，要利用此類知識來加強 POI 表示學習，會面臨兩個主要挑戰：首先，如何有效從 LLM 中萃取與 POI 相關的知識；其次，如何整合萃取的資訊來加強 POI 表示。為了應對這些挑戰，我們提出 POI-Enhancer，這是一個可攜式架構，利用 LLM 來改善傳統 POI 學習模型產生的 POI 表示。我們首先設計三個專門提示，以有效率的方式從 LLM 中萃取語義資訊。接著，雙重特徵比對模組提升萃取資訊的品質，而語義特徵融合模組則保留其完整性。然後，交叉注意力融合模組將此類高品質資訊完全自適應地整合到 POI 表示中，而多視圖對比學習進一步將人類可理解的語義資訊注入這些表示中。在三個真實世界資料集上進行的廣泛實驗證明了我們架構的有效性，顯示在所有基準表示上都有顯著的進步。", "author": "Jiawei Cheng et.al.", "authors": "Jiawei Cheng, Jingyuan Wang, Yichuan Zhang, Jiahao Ji, Yuanshao Zhu, Zhibo Zhang, Xiangyu Zhao", "id": "2502.10038v1", "paper_url": "http://arxiv.org/abs/2502.10038v1", "repo": "null"}}