{"2408.15121": {"publish_time": "2024-08-27", "title": "Aligning XAI with EU Regulations for Smart Biomedical Devices: A Methodology for Compliance Analysis", "paper_summary": "Significant investment and development have gone into integrating Artificial\nIntelligence (AI) in medical and healthcare applications, leading to advanced\ncontrol systems in medical technology. However, the opacity of AI systems\nraises concerns about essential characteristics needed in such sensitive\napplications, like transparency and trustworthiness. Our study addresses these\nconcerns by investigating a process for selecting the most adequate Explainable\nAI (XAI) methods to comply with the explanation requirements of key EU\nregulations in the context of smart bioelectronics for medical devices. The\nadopted methodology starts with categorising smart devices by their control\nmechanisms (open-loop, closed-loop, and semi-closed-loop systems) and delving\ninto their technology. Then, we analyse these regulations to define their\nexplainability requirements for the various devices and related goals.\nSimultaneously, we classify XAI methods by their explanatory objectives. This\nallows for matching legal explainability requirements with XAI explanatory\ngoals and determining the suitable XAI algorithms for achieving them. Our\nfindings provide a nuanced understanding of which XAI algorithms align better\nwith EU regulations for different types of medical devices. We demonstrate this\nthrough practical case studies on different neural implants, from chronic\ndisease management to advanced prosthetics. This study fills a crucial gap in\naligning XAI applications in bioelectronics with stringent provisions of EU\nregulations. It provides a practical framework for developers and researchers,\nensuring their AI innovations advance healthcare technology and adhere to legal\nand ethical standards.", "paper_summary_zh": "人工智慧（AI）在醫療和保健應用中投入了大量的投資和開發，進而導致醫療技術中的先進控制系統。然而，AI 系統的不透明性引發了對此類敏感應用中所需基本特性的擔憂，例如透明度和可信度。我們的研究透過調查一個程序來解決這些問題，用於選擇最充分的可解釋 AI（XAI）方法，以符合歐盟法規在醫療器材的智慧型生物電子學中的說明要求。採用的方法從透過其控制機制（開迴路、閉迴路和半閉迴路系統）對智慧型裝置進行分類，並深入探討其技術開始。然後，我們分析這些法規以定義其對各種裝置和相關目標的可解釋性要求。同時，我們透過其說明目標對 XAI 方法進行分類。這允許將法律可解釋性要求與 XAI 說明目標相匹配，並確定適當的 XAI 演算法來達成它們。我們的研究結果提供了對哪些 XAI 演算法更符合歐盟法規以適用於不同類型的醫療器材的細緻理解。我們透過不同神經植入物的實際案例研究來證明這一點，從慢性疾病管理到先進的義肢。這項研究填補了將生物電子學中的 XAI 應用與歐盟法規的嚴格規定相符的重要空白。它為開發人員和研究人員提供了一個實用的架構，確保其 AI 創新能促進醫療技術並遵守法律和道德標準。", "author": "Francesco Sovrano et.al.", "authors": "Francesco Sovrano, Michael Lognoul, Giulia Vilone", "id": "2408.15121v1", "paper_url": "http://arxiv.org/abs/2408.15121v1", "repo": "null"}}