{"2406.07882": {"publish_time": "2024-06-12", "title": "Designing a Dashboard for Transparency and Control of Conversational AI", "paper_summary": "Conversational LLMs function as black box systems, leaving users guessing\nabout why they see the output they do. This lack of transparency is potentially\nproblematic, especially given concerns around bias and truthfulness. To address\nthis issue, we present an end-to-end prototype-connecting interpretability\ntechniques with user experience design-that seeks to make chatbots more\ntransparent. We begin by showing evidence that a prominent open-source LLM has\na \"user model\": examining the internal state of the system, we can extract data\nrelated to a user's age, gender, educational level, and socioeconomic status.\nNext, we describe the design of a dashboard that accompanies the chatbot\ninterface, displaying this user model in real time. The dashboard can also be\nused to control the user model and the system's behavior. Finally, we discuss a\nstudy in which users conversed with the instrumented system. Our results\nsuggest that users appreciate seeing internal states, which helped them expose\nbiased behavior and increased their sense of control. Participants also made\nvaluable suggestions that point to future directions for both design and\nmachine learning research. The project page and video demo of our TalkTuner\nsystem are available at https://bit.ly/talktuner-project-page", "paper_summary_zh": "對話式 LLM 的運作方式猶如黑盒子系統，讓使用者猜測他們為何會看到這樣的輸出。這種不透明的狀況潛藏問題，特別是在考量到偏誤和真實性相關疑慮時。為了解決這個問題，我們提出一個端對端的原型，將可解釋性技術與使用者體驗設計結合，試圖讓聊天機器人更透明。我們首先展示證據，證明一個著名的開源 LLM 有一個「使用者模型」：透過檢查系統的內部狀態，我們可以萃取與使用者的年齡、性別、教育程度和社會經濟地位相關的資料。接下來，我們說明一個與聊天機器人介面搭配的儀表板設計，即時顯示這個使用者模型。這個儀表板也可以用來控制使用者模型和系統的行為。最後，我們探討一項研究，其中使用者與裝配儀器的系統對話。我們的結果顯示，使用者樂見看到內部狀態，這有助於他們揭露有偏見的行為，並增加他們的控制感。參與者也提出寶貴的建議，指出設計和機器學習研究的未來方向。我們的 TalkTuner 系統專案頁面和影片示範可於 https://bit.ly/talktuner-project-page 取得", "author": "Yida Chen et.al.", "authors": "Yida Chen, Aoyu Wu, Trevor DePodesta, Catherine Yeh, Kenneth Li, Nicholas Castillo Marin, Oam Patel, Jan Riecke, Shivam Raval, Olivia Seow, Martin Wattenberg, Fernanda Viégas", "id": "2406.07882v1", "paper_url": "http://arxiv.org/abs/2406.07882v1", "repo": "https://github.com/yc015/talktuner-chatbot-llm-dashboard"}}