{"2410.08698": {"publish_time": "2024-10-11", "title": "SocialGaze: Improving the Integration of Human Social Norms in Large Language Models", "paper_summary": "While much research has explored enhancing the reasoning capabilities of\nlarge language models (LLMs) in the last few years, there is a gap in\nunderstanding the alignment of these models with social values and norms. We\nintroduce the task of judging social acceptance. Social acceptance requires\nmodels to judge and rationalize the acceptability of people's actions in social\nsituations. For example, is it socially acceptable for a neighbor to ask others\nin the community to keep their pets indoors at night? We find that LLMs'\nunderstanding of social acceptance is often misaligned with human consensus. To\nalleviate this, we introduce SocialGaze, a multi-step prompting framework, in\nwhich a language model verbalizes a social situation from multiple perspectives\nbefore forming a judgment. Our experiments demonstrate that the SocialGaze\napproach improves the alignment with human judgments by up to 11 F1 points with\nthe GPT-3.5 model. We also identify biases and correlations in LLMs in\nassigning blame that is related to features such as the gender (males are\nsignificantly more likely to be judged unfairly) and age (LLMs are more aligned\nwith humans for older narrators).", "paper_summary_zh": "在过去几年中，虽然许多研究探索了增强大型语言模型 (LLM) 的推理能力，但对于理解这些模型与社会价值观和规范的一致性存在差距。我们引入了判断社会接受度的任务。社会接受度要求模型判断和合理化人们在社会情境中的行为可接受性。例如，邻居要求社区其他人晚上将宠物关在室内是否在社会上可以接受？我们发现，LLM 对社会接受度的理解通常与人类共识不一致。为了缓解这种情况，我们引入了 SocialGaze，这是一个多步骤提示框架，其中语言模型在形成判断之前从多个角度对社会情境进行描述。我们的实验表明，SocialGaze 方法将与人类判断的一致性提高了高达 11 个 F1 点，采用 GPT-3.5 模型。我们还确定了 LLM 在分配与性别（男性明显更有可能受到不公平判断）和年龄（对于年长的叙述者，LLM 与人类更一致）等特征相关的偏见和相关性。", "author": "Anvesh Rao Vijjini et.al.", "authors": "Anvesh Rao Vijjini, Rakesh R. Menon, Jiayi Fu, Shashank Srivastava, Snigdha Chaturvedi", "id": "2410.08698v1", "paper_url": "http://arxiv.org/abs/2410.08698v1", "repo": "null"}}