{"2412.06272": {"publish_time": "2024-12-09", "title": "Methods for Legal Citation Prediction in the Age of LLMs: An Australian Law Case Study", "paper_summary": "In recent years, Large Language Models (LLMs) have shown great potential\nacross a wide range of legal tasks. Despite these advances, mitigating\nhallucination remains a significant challenge, with state-of-the-art LLMs still\nfrequently generating incorrect legal references. In this paper, we focus on\nthe problem of legal citation prediction within the Australian law context,\nwhere correctly identifying and citing relevant legislations or precedents is\ncritical. We compare several approaches: prompting general purpose and\nlaw-specialised LLMs, retrieval-only pipelines with both generic and\ndomain-specific embeddings, task-specific instruction-tuning of LLMs, and\nhybrid strategies that combine LLMs with retrieval augmentation, query\nexpansion, or voting ensembles. Our findings indicate that domain-specific\npre-training alone is insufficient for achieving satisfactory citation accuracy\neven after law-specialised pre-training. In contrast, instruction tuning on our\ntask-specific dataset dramatically boosts performance reaching the best results\nacross all settings. We also highlight that database granularity along with the\ntype of embeddings play a critical role in the performance of retrieval\nsystems. Among retrieval-based approaches, hybrid methods consistently\noutperform retrieval-only setups, and among these, ensemble voting delivers the\nbest result by combining the predictive quality of instruction-tuned LLMs with\nthe retrieval system.", "paper_summary_zh": "近年來，大型語言模型（LLM）在各種法律事務上展現出巨大的潛力。儘管有這些進展，減輕幻覺仍然是一項重大挑戰，最先進的 LLM 仍然經常產生不正確的法律參考。在本文中，我們專注於澳大利亞法律背景下的法律引用預測問題，其中正確識別和引用相關立法或先例至關重要。我們比較了幾種方法：提示通用和法律專業的 LLM、具有通用和特定領域嵌入的僅檢索管道、LLM 的特定任務指令調整，以及將 LLM 與檢索擴充、查詢擴充或投票集成相結合的混合策略。我們的研究結果表明，即使經過法律專業的預訓練，僅特定領域的預訓練不足以實現令人滿意的引用準確度。相比之下，針對我們特定任務數據集的指令調整顯著提升了效能，在所有設定中達到最佳結果。我們還強調，資料庫粒度以及嵌入類型在檢索系統的效能中扮演著至關重要的角色。在基於檢索的方法中，混合方法始終優於僅檢索的設定，其中，集成投票通過結合指令調整的 LLM 的預測品質和檢索系統，提供最佳結果。", "author": "Ehsan Shareghi et.al.", "authors": "Ehsan Shareghi, Jiuzhou Han, Paul Burgess", "id": "2412.06272v1", "paper_url": "http://arxiv.org/abs/2412.06272v1", "repo": "null"}}