{"2407.13427": {"publish_time": "2024-07-18", "title": "DeepClair: Utilizing Market Forecasts for Effective Portfolio Selection", "paper_summary": "Utilizing market forecasts is pivotal in optimizing portfolio selection\nstrategies. We introduce DeepClair, a novel framework for portfolio selection.\nDeepClair leverages a transformer-based time-series forecasting model to\npredict market trends, facilitating more informed and adaptable portfolio\ndecisions. To integrate the forecasting model into a deep reinforcement\nlearning-driven portfolio selection framework, we introduced a two-step\nstrategy: first, pre-training the time-series model on market data, followed by\nfine-tuning the portfolio selection architecture using this model.\nAdditionally, we investigated the optimization technique, Low-Rank Adaptation\n(LoRA), to enhance the pre-trained forecasting model for fine-tuning in\ninvestment scenarios. This work bridges market forecasting and portfolio\nselection, facilitating the advancement of investment strategies.", "paper_summary_zh": "利用市場預測對於最佳化投資組合選擇策略至關重要。我們介紹 DeepClair，一個用於投資組合選擇的新穎架構。DeepClair 採用基於Transformer的時間序列預測模型來預測市場趨勢，促進更明智且適應性更強的投資組合決策。為了將預測模型整合到深度強化學習驅動的投資組合選擇架構中，我們引入了一個兩步驟策略：首先，使用市場數據對時間序列模型進行預訓練，然後使用此模型微調投資組合選擇架構。此外，我們研究了優化技術，低秩適應（LoRA），以增強預訓練的預測模型，以便在投資情境中進行微調。這項工作橋接了市場預測和投資組合選擇，促进了投資策略的進步。", "author": "Donghee Choi et.al.", "authors": "Donghee Choi, Jinkyu Kim, Mogan Gim, Jinho Lee, Jaewoo Kang", "id": "2407.13427v1", "paper_url": "http://arxiv.org/abs/2407.13427v1", "repo": "null"}}