{"2407.07425": {"publish_time": "2024-07-10", "title": "Out-of-distribution generalisation in spoken language understanding", "paper_summary": "Test data is said to be out-of-distribution (OOD) when it unexpectedly\ndiffers from the training data, a common challenge in real-world use cases of\nmachine learning. Although OOD generalisation has gained interest in recent\nyears, few works have focused on OOD generalisation in spoken language\nunderstanding (SLU) tasks. To facilitate research on this topic, we introduce a\nmodified version of the popular SLU dataset SLURP, featuring data splits for\ntesting OOD generalisation in the SLU task. We call our modified dataset SLURP\nFor OOD generalisation, or SLURPFOOD. Utilising our OOD data splits, we find\nend-to-end SLU models to have limited capacity for generalisation. Furthermore,\nby employing model interpretability techniques, we shed light on the factors\ncontributing to the generalisation difficulties of the models. To improve the\ngeneralisation, we experiment with two techniques, which improve the results on\nsome, but not all the splits, emphasising the need for new techniques.", "paper_summary_zh": "測試資料被認為是 out-of-distribution (OOD)，當它不同於訓練資料時，這是機器學習在實際使用案例中常見的挑戰。儘管 OOD generalization 在近年來引起興趣，但很少有研究專注於口語理解 (SLU) 任務中的 OOD generalization。為了促進對此主題的研究，我們引入了廣受歡迎的 SLU 資料集 SLURP 的修改版本，其中包含用於測試 SLU 任務中 OOD generalization 的資料分割。我們將修改後的資料集稱為 SLURP for OOD generalization，或 SLURPFOOD。利用我們的 OOD 資料分割，我們發現端到端 SLU 模型的 generalization 能力有限。此外，透過採用模型可解釋性技術，我們闡明了導致模型 generalization 困難的因素。為了改善 generalization，我們嘗試了兩種技術，它們改善了一些分割的結果，但並非所有分割，強調了對新技術的需求。", "author": "Dejan Porjazovski et.al.", "authors": "Dejan Porjazovski, Anssi Moisio, Mikko Kurimo", "id": "2407.07425v1", "paper_url": "http://arxiv.org/abs/2407.07425v1", "repo": "null"}}