{"2501.08600": {"publish_time": "2025-01-15", "title": "AutoRestTest: A Tool for Automated REST API Testing Using LLMs and MARL", "paper_summary": "As REST APIs have become widespread in modern web services, comprehensive\ntesting of these APIs has become increasingly crucial. Due to the vast search\nspace consisting of operations, parameters, and parameter values along with\ntheir complex dependencies and constraints, current testing tools suffer from\nlow code coverage, leading to suboptimal fault detection. To address this\nlimitation, we present a novel tool, AutoRestTest, which integrates the\nSemantic Operation Dependency Graph (SODG) with Multi-Agent Reinforcement\nLearning (MARL) and large language models (LLMs) for effective REST API\ntesting. AutoRestTest determines operation-dependent parameters using the SODG\nand employs five specialized agents (operation, parameter, value, dependency,\nand header) to identify dependencies of operations and generate operation\nsequences, parameter combinations, and values. AutoRestTest provides a\ncommand-line interface and continuous telemetry on successful operation count,\nunique server errors detected, and time elapsed. Upon completion, AutoRestTest\ngenerates a detailed report highlighting errors detected and operations\nexercised. In this paper, we introduce our tool and present preliminary\nresults.", "paper_summary_zh": "隨著 REST API 在現代網路服務中廣泛使用，對這些 API 進行全面的測試變得越來越重要。由於廣大的搜尋空間包含操作、參數和參數值以及它們複雜的依賴關係和約束，目前的測試工具存在程式碼覆蓋率低的問題，導致故障偵測不佳。為了解決這個限制，我們提出一個新工具 AutoRestTest，它整合了語義操作依賴圖 (SODG) 與多智能體強化學習 (MARL) 和大型語言模型 (LLM)，以進行有效的 REST API 測試。AutoRestTest 使用 SODG 確定依賴於操作的參數，並使用五個專門的代理 (操作、參數、值、依賴關係和標頭) 來識別操作的依賴關係並產生操作序列、參數組合和值。AutoRestTest 提供命令列介面和持續遙測，包括成功操作次數、偵測到的唯一伺服器錯誤和經過時間。完成後，AutoRestTest 會產生一份詳細報告，重點說明偵測到的錯誤和執行的操作。在本文中，我們介紹我們的工具並提出初步結果。", "author": "Tyler Stennett et.al.", "authors": "Tyler Stennett, Myeongsoo Kim, Saurabh Sinha, Alessandro Orso", "id": "2501.08600v1", "paper_url": "http://arxiv.org/abs/2501.08600v1", "repo": "null"}}