{"2411.14743": {"publish_time": "2024-11-22", "title": "FOCUS: Knowledge-enhanced Adaptive Visual Compression for Few-shot Whole Slide Image Classification", "paper_summary": "Few-shot learning presents a critical solution for cancer diagnosis in\ncomputational pathology (CPath), addressing fundamental limitations in data\navailability, particularly the scarcity of expert annotations and patient\nprivacy constraints. A key challenge in this paradigm stems from the inherent\ndisparity between the limited training set of whole slide images (WSIs) and the\nenormous number of contained patches, where a significant portion of these\npatches lacks diagnostically relevant information, potentially diluting the\nmodel's ability to learn and focus on critical diagnostic features. While\nrecent works attempt to address this by incorporating additional knowledge,\nseveral crucial gaps hinder further progress: (1) despite the emergence of\npowerful pathology foundation models (FMs), their potential remains largely\nuntapped, with most approaches limiting their use to basic feature extraction;\n(2) current language guidance mechanisms attempt to align text prompts with\nvast numbers of WSI patches all at once, struggling to leverage rich\npathological semantic information. To this end, we introduce the\nknowledge-enhanced adaptive visual compression framework, dubbed FOCUS, which\nuniquely combines pathology FMs with language prior knowledge to enable a\nfocused analysis of diagnostically relevant regions by prioritizing\ndiscriminative WSI patches. Our approach implements a progressive three-stage\ncompression strategy: we first leverage FMs for global visual redundancy\nelimination, and integrate compressed features with language prompts for\nsemantic relevance assessment, then perform neighbor-aware visual token\nfiltering while preserving spatial coherence. Extensive experiments on\npathological datasets spanning breast, lung, and ovarian cancers demonstrate\nits superior performance in few-shot pathology diagnosis. Code will be made\navailable at https://github.com/dddavid4real/FOCUS.", "paper_summary_zh": "<paragraph>小樣本學習為計算病理學 (CPath) 中的癌症診斷提供了一個關鍵的解決方案，解決了數據可用性中的基本限制，特別是專家註解的稀缺性和患者隱私限制。這種範例中的主要挑戰源於全玻片影像 (WSI) 的有限訓練集與包含的龐大影像塊之間的固有差異，其中很大一部分影像塊缺乏診斷相關資訊，可能會稀釋模型學習和關注關鍵診斷特徵的能力。雖然最近的研究嘗試透過納入額外知識來解決這個問題，但有幾個關鍵的差距阻礙了進一步的進展：(1) 儘管強大的病理基礎模型 (FM) 出現，但它們的潛力在很大程度上仍未開發，大多數方法將它們的使用限制在基本特徵提取；(2) 目前的語言引導機制嘗試一次將文字提示與大量的 WSI 影像塊對齊，難以利用豐富的病理語義資訊。為此，我們引入了基於知識增強的自適應視覺壓縮框架，稱為 FOCUS，它獨特地將病理 FM 與語言先驗知識相結合，透過優先考慮區分性的 WSI 影像塊，對診斷相關區域進行重點分析。我們的做法實施了一個漸進的三階段壓縮策略：我們首先利用 FM 消除全局視覺冗餘，並將壓縮特徵與語言提示整合進行語義相關性評估，然後在保留空間一致性的同時執行鄰近感知視覺符號過濾。在涵蓋乳癌、肺癌和卵巢癌的病理資料集上進行的廣泛實驗證明了其在小樣本病理診斷中的優異效能。程式碼將在 https://github.com/dddavid4real/FOCUS 上提供。</paragraph>", "author": "Zhengrui Guo et.al.", "authors": "Zhengrui Guo, Conghao Xiong, Jiabo Ma, Qichen Sun, Lishuang Feng, Jinzhuo Wang, Hao Chen", "id": "2411.14743v1", "paper_url": "http://arxiv.org/abs/2411.14743v1", "repo": "https://github.com/dddavid4real/focus"}}