{"2410.06898": {"publish_time": "2024-10-09", "title": "Generative Model for Less-Resourced Language with 1 billion parameters", "paper_summary": "Large language models (LLMs) are a basic infrastructure for modern natural\nlanguage processing. Many commercial and open-source LLMs exist for English,\ne.g., ChatGPT, Llama, Falcon, and Mistral. As these models are trained on\nmostly English texts, their fluency and knowledge of low-resource languages and\nsocieties are superficial. We present the development of large generative\nlanguage models for a less-resourced language. GaMS 1B - Generative Model for\nSlovene with 1 billion parameters was created by continuing pretraining of the\nexisting English OPT model. We developed a new tokenizer adapted to Slovene,\nCroatian, and English languages and used embedding initialization methods FOCUS\nand WECHSEL to transfer the embeddings from the English OPT model. We evaluate\nour models on several classification datasets from the Slovene suite of\nbenchmarks and generative sentence simplification task SENTA. We only used a\nfew-shot in-context learning of our models, which are not yet\ninstruction-tuned. For classification tasks, in this mode, the generative\nmodels lag behind the existing Slovene BERT-type models fine-tuned for specific\ntasks. On a sentence simplification task, the GaMS models achieve comparable or\nbetter performance than the GPT-3.5-Turbo model.", "paper_summary_zh": "大型語言模型 (LLM) 是現代自然語言處理的基本基礎設施。有許多商業和開放原始碼的 LLM 適用於英語，例如 ChatGPT、Llama、Falcon 和 Mistral。由於這些模型大多訓練於英語文本，因此它們對低資源語言和社會的流暢度和知識都很膚淺。我們展示了針對資源較少的語言開發大型生成語言模型。GaMS 1B - 10 億個參數的斯洛維尼亞生成模型是透過持續預訓練現有的英語 OPT 模型而建立的。我們開發了一個適用於斯洛維尼亞語、克羅埃西亞語和英語的新分詞器，並使用嵌入初始化方法 FOCUS 和 WECHSEL 從英語 OPT 模型傳輸嵌入。我們在斯洛維尼亞基準套件中的幾個分類資料集和生成式句子簡化任務 SENTA 上評估我們的模型。我們僅使用我們模型的少量情境學習，這些模型尚未針對指令進行調整。對於分類任務，在此模式中，生成式模型落後於針對特定任務進行微調的現有斯洛維尼亞 BERT 類型模型。在句子簡化任務中，GaMS 模型達到了與 GPT-3.5-Turbo 模型相當或更好的效能。", "author": "Domen Vreš et.al.", "authors": "Domen Vreš, Martin Božič, Aljaž Potočnik, Tomaž Martinčič, Marko Robnik-Šikonja", "id": "2410.06898v1", "paper_url": "http://arxiv.org/abs/2410.06898v1", "repo": "null"}}