{"2407.16516": {"publish_time": "2024-07-23", "title": "Assessing In-context Learning and Fine-tuning for Topic Classification of German Web Data", "paper_summary": "Researchers in the political and social sciences often rely on classification\nmodels to analyze trends in information consumption by examining browsing\nhistories of millions of webpages. Automated scalable methods are necessary due\nto the impracticality of manual labeling. In this paper, we model the detection\nof topic-related content as a binary classification task and compare the\naccuracy of fine-tuned pre-trained encoder models against in-context learning\nstrategies. Using only a few hundred annotated data points per topic, we detect\ncontent related to three German policies in a database of scraped webpages. We\ncompare multilingual and monolingual models, as well as zero and few-shot\napproaches, and investigate the impact of negative sampling strategies and the\ncombination of URL & content-based features. Our results show that a small\nsample of annotated data is sufficient to train an effective classifier.\nFine-tuning encoder-based models yields better results than in-context\nlearning. Classifiers using both URL & content-based features perform best,\nwhile using URLs alone provides adequate results when content is unavailable.", "paper_summary_zh": "政治和社會科學的研究人員經常依賴分類模型來分析透過檢視數百萬個網頁的瀏覽記錄來了解資訊消費的趨勢。由於人工標記不切實際，因此需要自動化且可擴充的方法。在本文中，我們將主題相關內容的偵測建模為二元分類任務，並將微調過的預訓練編碼器模型的準確度與情境學習策略進行比較。我們只使用每主題數百個註解資料點，就能在一個抓取網頁的資料庫中偵測到與三個德國政策相關的內容。我們比較了多語言和單一語言模型，以及零次和少次學習方法，並探討了負面抽樣策略和 URL 與基於內容特徵的組合的影響。我們的結果顯示，少量的註解資料就足以訓練出一個有效的分類器。微調基於編碼器的模型會產生比情境學習更好的結果。同時使用 URL 和基於內容特徵的分類器表現最佳，而當內容不可用時，僅使用 URL 也可以提供足夠的結果。", "author": "Julian Schelb et.al.", "authors": "Julian Schelb, Roberto Ulloa, Andreas Spitz", "id": "2407.16516v1", "paper_url": "http://arxiv.org/abs/2407.16516v1", "repo": "null"}}