{"2410.19168": {"publish_time": "2024-10-24", "title": "MMAU: A Massive Multi-Task Audio Understanding and Reasoning Benchmark", "paper_summary": "The ability to comprehend audio--which includes speech, non-speech sounds,\nand music--is crucial for AI agents to interact effectively with the world. We\npresent MMAU, a novel benchmark designed to evaluate multimodal audio\nunderstanding models on tasks requiring expert-level knowledge and complex\nreasoning. MMAU comprises 10k carefully curated audio clips paired with\nhuman-annotated natural language questions and answers spanning speech,\nenvironmental sounds, and music. It includes information extraction and\nreasoning questions, requiring models to demonstrate 27 distinct skills across\nunique and challenging tasks. Unlike existing benchmarks, MMAU emphasizes\nadvanced perception and reasoning with domain-specific knowledge, challenging\nmodels to tackle tasks akin to those faced by experts. We assess 18 open-source\nand proprietary (Large) Audio-Language Models, demonstrating the significant\nchallenges posed by MMAU. Notably, even the most advanced Gemini Pro v1.5\nachieves only 52.97% accuracy, and the state-of-the-art open-source Qwen2-Audio\nachieves only 52.50%, highlighting considerable room for improvement. We\nbelieve MMAU will drive the audio and multimodal research community to develop\nmore advanced audio understanding models capable of solving complex audio\ntasks.", "paper_summary_zh": "理解音訊（包括語音、非語音聲音和音樂）的能力對於 AI 代理程式與世界有效互動至關重要。我們提出 MMAU，這是一個新穎的基準，旨在評估多模態音訊理解模型在需要專家級知識和複雜推理任務上的表現。MMAU 包含 10k 個經過仔細策劃的音訊片段，並搭配人工標註的自然語言問題和答案，涵蓋語音、環境音和音樂。它包括資訊萃取和推理問題，要求模型在獨特且具有挑戰性的任務中展現 27 項不同的技能。與現有的基準不同，MMAU 強調進階感知和具備特定領域知識的推理，挑戰模型處理類似專家所面對任務。我們評估了 18 個開源和專有（大型）音訊語言模型，證明了 MMAU 構成的重大挑戰。值得注意的是，即使是最先進的 Gemini Pro v1.5 也僅達到 52.97% 的準確度，而最先進的開源 Qwen2-Audio 也僅達到 52.50%，突顯出有很大的改進空間。我們相信 MMAU 將驅動音訊和多模態研究社群開發更先進的音訊理解模型，能夠解決複雜的音訊任務。", "author": "S Sakshi et.al.", "authors": "S Sakshi, Utkarsh Tyagi, Sonal Kumar, Ashish Seth, Ramaneswaran Selvakumar, Oriol Nieto, Ramani Duraiswami, Sreyan Ghosh, Dinesh Manocha", "id": "2410.19168v1", "paper_url": "http://arxiv.org/abs/2410.19168v1", "repo": "null"}}