{"2502.13412": {"publish_time": "2025-02-19", "title": "Explore-Construct-Filter: An Automated Framework for Rich and Reliable API Knowledge Graph Construction", "paper_summary": "The API Knowledge Graph (API KG) is a structured network that models API\nentities and their relations, providing essential semantic insights for tasks\nsuch as API recommendation, code generation, and API misuse detection. However,\nconstructing a knowledge-rich and reliable API KG presents several challenges.\nExisting schema-based methods rely heavily on manual annotations to design KG\nschemas, leading to excessive manual overhead. On the other hand, schema-free\nmethods, due to the lack of schema guidance, are prone to introducing noise,\nreducing the KG's reliability. To address these issues, we propose the\nExplore-Construct-Filter framework, an automated approach for API KG\nconstruction based on large language models (LLMs). This framework consists of\nthree key modules: 1) KG exploration: LLMs simulate the workflow of annotators\nto automatically design a schema with comprehensive type triples, minimizing\nhuman intervention; 2) KG construction: Guided by the schema, LLMs extract\ninstance triples to construct a rich yet unreliable API KG; 3) KG filtering:\nRemoving invalid type triples and suspicious instance triples to construct a\nrich and reliable API KG. Experimental results demonstrate that our method\nsurpasses the state-of-the-art method, achieving a 25.2% improvement in F1\nscore. Moreover, the Explore-Construct-Filter framework proves effective, with\nthe KG exploration module increasing KG richness by 133.6% and the KG filtering\nmodule improving reliability by 26.6%. Finally, cross-model experiments confirm\nthe generalizability of our framework.", "paper_summary_zh": "API 知識圖譜 (API KG) 是一個結構化網路，用於建模 API 實體及其關係，提供基本語義見解，以執行 API 建議、程式碼產生和 API 誤用偵測等任務。然而，建構一個知識豐富且可靠的 API KG 會產生若干挑戰。現有的基於架構的方法嚴重依賴手動註解來設計 KG 架構，導致過度的手動開銷。另一方面，由於缺乏架構指導，無架構的方法容易引入雜訊，降低 KG 的可靠性。為了解決這些問題，我們提出了探索建構過濾架構，這是一種基於大型語言模型 (LLM) 的自動化 API KG 建構方法。此架構包含三個關鍵模組：1) KG 探索：LLM 模擬註解者的工作流程，自動設計具有完整類型三元組的架構，將人為干預降至最低；2) KG 建構：在架構的指導下，LLM 提取實例三元組來建構豐富但不可靠的 API KG；3) KG 過濾：移除無效的類型三元組和可疑的實例三元組，以建構豐富且可靠的 API KG。實驗結果表明，我們的方法優於最先進的方法，在 F1 分數上提高了 25.2%。此外，探索建構過濾架構被證明是有效的，其中 KG 探索模組將 KG 豐富度提高了 133.6%，而 KG 過濾模組將可靠性提高了 26.6%。最後，跨模型實驗證實了我們架構的泛化性。", "author": "Yanbang Sun et.al.", "authors": "Yanbang Sun, Qing Huang, Xiaoxue Ren, Zhenchang Xing, Xiaohong Li, Junjie Wang", "id": "2502.13412v1", "paper_url": "http://arxiv.org/abs/2502.13412v1", "repo": "null"}}