{"2502.12064": {"publish_time": "2025-02-17", "title": "AI-generated Text Detection with a GLTR-based Approach", "paper_summary": "The rise of LLMs (Large Language Models) has contributed to the improved\nperformance and development of cutting-edge NLP applications. However, these\ncan also pose risks when used maliciously, such as spreading fake news, harmful\ncontent, impersonating individuals, or facilitating school plagiarism, among\nothers. This is because LLMs can generate high-quality texts, which are\nchallenging to differentiate from those written by humans. GLTR, which stands\nfor Giant Language Model Test Room and was developed jointly by the MIT-IBM\nWatson AI Lab and HarvardNLP, is a visual tool designed to help detect\nmachine-generated texts based on GPT-2, that highlights the words in text\ndepending on the probability that they were machine-generated. One limitation\nof GLTR is that the results it returns can sometimes be ambiguous and lead to\nconfusion. This study aims to explore various ways to improve GLTR's\neffectiveness for detecting AI-generated texts within the context of the\nIberLef-AuTexTification 2023 shared task, in both English and Spanish\nlanguages. Experiment results show that our GLTR-based GPT-2 model overcomes\nthe state-of-the-art models on the English dataset with a macro F1-score of\n80.19%, except for the first ranking model (80.91%). However, for the Spanish\ndataset, we obtained a macro F1-score of 66.20%, which differs by 4.57%\ncompared to the top-performing model.", "paper_summary_zh": "大型語言模型 (LLM) 的興起有助於改進尖端 NLP 應用程式的效能和開發。不過，這些應用程式若遭惡意使用，例如散布假新聞、有害內容、冒充個人或協助學校抄襲等，也可能造成風險。這是因為 LLM 可以產生高品質的文字，而這些文字難以與人類所寫的文字區分。GLTR（代表大型語言模型測試室）是由麻省理工學院-IBM Watson AI 實驗室和 HarvardNLP 共同開發的視覺工具，旨在協助偵測基於 GPT-2 的機器產生的文字，它會根據文字中每個字詞機器產生的機率來標示。GLTR 的一個限制在於，它回傳的結果有時可能模稜兩可，容易造成混淆。本研究旨在探討各種方法來改善 GLTR 在 IberLef-AuTexTification 2023 共享任務中偵測 AI 生成的文字的效能，任務中包含英文和西班牙文兩種語言。實驗結果顯示，我們的基於 GLTR 的 GPT-2 模型在英文資料集上以 80.19% 的巨觀 F1 分數超越了最先進的模型，僅次於第一名排名模型 (80.91%)。不過，在西班牙文資料集上，我們獲得的巨觀 F1 分數為 66.20%，與表現最佳的模型相比，相差 4.57%。", "author": "Lucía Yan Wu et.al.", "authors": "Lucía Yan Wu, Isabel Segura-Bedmar", "id": "2502.12064v1", "paper_url": "http://arxiv.org/abs/2502.12064v1", "repo": "null"}}