{"2405.17873": {"publish_time": "2024-05-28", "title": "MixDQ: Memory-Efficient Few-Step Text-to-Image Diffusion Models with Metric-Decoupled Mixed Precision Quantization", "paper_summary": "Diffusion models have achieved significant visual generation quality.\nHowever, their significant computational and memory costs pose challenge for\ntheir application on resource-constrained mobile devices or even desktop GPUs.\nRecent few-step diffusion models reduces the inference time by reducing the\ndenoising steps. However, their memory consumptions are still excessive. The\nPost Training Quantization (PTQ) replaces high bit-width FP representation with\nlow-bit integer values (INT4/8) , which is an effective and efficient technique\nto reduce the memory cost. However, when applying to few-step diffusion models,\nexisting quantization methods face challenges in preserving both the image\nquality and text alignment. To address this issue, we propose an\nmixed-precision quantization framework - MixDQ. Firstly, We design specialized\nBOS-aware quantization method for highly sensitive text embedding quantization.\nThen, we conduct metric-decoupled sensitivity analysis to measure the\nsensitivity of each layer. Finally, we develop an integer-programming-based\nmethod to conduct bit-width allocation. While existing quantization methods\nfall short at W8A8, MixDQ could achieve W8A8 without performance loss, and W4A8\nwith negligible visual degradation. Compared with FP16, we achieve 3-4x\nreduction in model size and memory cost, and 1.45x latency speedup.", "paper_summary_zh": "擴散模型已達到顯著的視覺生成品質。\n然而，它們顯著的運算和記憶體成本對其在資源受限的行動裝置或甚至桌上型 GPU 上的應用構成挑戰。\n最近的幾步擴散模型透過減少去噪步驟來縮短推論時間。\n然而，它們的記憶體消耗仍然過多。\n訓練後量化 (PTQ) 以低位元整數值 (INT4/8) 取代高位元寬度 FP 表示，這是一種有效且高效的技術，可降低記憶體成本。\n然而，在應用於幾步擴散模型時，現有的量化方法在保留影像品質和文字對齊方面面臨挑戰。\n為了解決這個問題，我們提出一個混合精度量化架構 - MixDQ。\n首先，我們設計了專門的 BOS 感知量化方法，用於高度敏感的文字嵌入量化。\n然後，我們進行指標解耦的敏感度分析，以測量每層的敏感度。\n最後，我們開發了一個基於整數規劃的方法來進行位元寬度分配。\n雖然現有的量化方法在 W8A8 上表現不佳，但 MixDQ 能夠在不損失效能的情況下實現 W8A8，並以極小的視覺劣化實現 W4A8。\n與 FP16 相比，我們將模型大小和記憶體成本降低了 3-4 倍，並將延遲速度提高了 1.45 倍。", "author": "Tianchen Zhao et.al.", "authors": "Tianchen Zhao, Xuefei Ning, Tongcheng Fang, Enshu Liu, Guyue Huang, Zinan Lin, Shengen Yan, Guohao Dai, Yu Wang", "id": "2405.17873v1", "paper_url": "http://arxiv.org/abs/2405.17873v1", "repo": "null"}}