{"2501.13622": {"publish_time": "2025-01-23", "title": "Coarse-to-Fine Process Reward Modeling for Enhanced Mathematical Reasoning", "paper_summary": "Process reward model (PRM) is critical for mathematical reasoning tasks to\nassign rewards for each intermediate steps. The PRM requires constructing\nprocess-wise supervision data for training, which rely on chain-of-thought\n(CoT) or tree-based methods to construct the reasoning steps, however, the\nindividual reasoning steps may be redundant or containing nuanced errors that\ndifficult to detect. We attribute these to the issue of the overlook of\ngranularity division during process data collection. In this paper, we propose\na coarse-to-fine framework to tackle this issue. Specifically, while gathering\nthe process supervision data, we collect the coarse reasoning steps by merging\nadjacent steps according to preset merging granularity, then we sequentially\nreduce the merging granularity to collect fine-grained reasoning steps. For\neach synthesized new step, we relabel according to the label of last step.\nDuring training, we also traverse the collected training corpus in a\ncoarse-to-fine manner. We conduct extensive experiments on popular mathematical\nreasoning datasets across diverse loss criterions, the proposed framework can\nconsistently boost the reasoning performance.", "paper_summary_zh": "處理獎勵模型 (PRM) 對數學推理任務至關重要，以分配每個中間步驟的獎勵。PRM 需要構建用於訓練的過程監督資料，這依賴於思想鏈 (CoT) 或基於樹的方法來構建推理步驟，然而，個別的推理步驟可能冗餘或包含難以檢測的細微錯誤。我們將這些歸因於過程資料收集過程中粒度劃分的忽視問題。在本文中，我們提出了一個從粗到細的框架來解決這個問題。具體來說，在收集過程監督資料時，我們通過根據預設合併粒度合併相鄰步驟來收集粗略的推理步驟，然後我們依次降低合併粒度以收集細粒度的推理步驟。對於每個合成的新步驟，我們根據最後一步的標籤重新標記。在訓練期間，我們也以從粗到細的方式遍歷收集的訓練語料庫。我們對各種流行的數學推理資料集進行了廣泛的實驗，跨越了不同的損失準則，所提出的框架可以持續提升推理性能。", "author": "Yulan Hu et.al.", "authors": "Yulan Hu, Sheng Ouyang, Yong Liu", "id": "2501.13622v1", "paper_url": "http://arxiv.org/abs/2501.13622v1", "repo": "null"}}