{"2405.18915": {"publish_time": "2024-05-29", "title": "Towards Faithful Chain-of-Thought: Large Language Models are Bridging Reasoners", "paper_summary": "Large language models (LLMs) suffer from serious unfaithful chain-of-thought\n(CoT) issues. Previous work attempts to measure and explain it but lacks\nin-depth analysis within CoTs and does not consider the interactions among all\nreasoning components jointly. In this paper, we first study the CoT\nfaithfulness issue at the granularity of CoT steps, identify two reasoning\nparadigms: centralized reasoning and distributed reasoning, and find their\nrelationship with faithfulness. Subsequently, we conduct a joint analysis of\nthe causal relevance among the context, CoT, and answer during reasoning. The\nresult proves that, when the LLM predicts answers, it can recall correct\ninformation missing in the CoT from the context, leading to unfaithfulness\nissues. Finally, we propose the inferential bridging method to mitigate this\nissue, in which we use the attribution method to recall information as hints\nfor CoT generation and filter out noisy CoTs based on their semantic\nconsistency and attribution scores. Extensive experiments demonstrate that our\napproach effectively alleviates the unfaithful CoT problem.", "paper_summary_zh": "大型語言模型 (LLM) 存在嚴重的推理鏈 (CoT) 不忠實問題。先前的研究嘗試測量和解釋它，但缺乏對 CoT 內部的深入分析，並且沒有共同考慮所有推理組成部分之間的互動。在本文中，我們首先研究 CoT 步驟粒度的 CoT 忠實度問題，識別出兩種推理範例：集中推理和分散推理，並找出它們與忠實度的關係。隨後，我們對推理過程中的背景、CoT 和答案之間的因果關聯進行聯合分析。結果證明，當 LLM 預測答案時，它可以從背景中召回 CoT 中遺漏的正確資訊，導致不忠實問題。最後，我們提出了推理橋接方法來減輕這個問題，我們在其中使用歸因方法將資訊作為 CoT 生成的提示進行召回，並根據它們的語義一致性和歸因分數過濾掉有雜訊的 CoT。大量的實驗證明，我們的做法有效地緩解了不忠實的 CoT 問題。", "author": "Jiachun Li et.al.", "authors": "Jiachun Li, Pengfei Cao, Yubo Chen, Kang Liu, Jun Zhao", "id": "2405.18915v1", "paper_url": "http://arxiv.org/abs/2405.18915v1", "repo": "null"}}