{"2408.10593": {"publish_time": "2024-08-20", "title": "An Efficient Sign Language Translation Using Spatial Configuration and Motion Dynamics with LLMs", "paper_summary": "Gloss-free Sign Language Translation (SLT) converts sign videos directly into\nspoken language sentences without relying on glosses. Recently, Large Language\nModels (LLMs) have shown remarkable translation performance in gloss-free\nmethods by harnessing their powerful natural language generation capabilities.\nHowever, these methods often rely on domain-specific fine-tuning of visual\nencoders to achieve optimal results. By contrast, this paper emphasizes the\nimportance of capturing the spatial configurations and motion dynamics inherent\nin sign language. With this in mind, we introduce Spatial and Motion-based Sign\nLanguage Translation (SpaMo), a novel LLM-based SLT framework. The core idea of\nSpaMo is simple yet effective. We first extract spatial and motion features\nusing off-the-shelf visual encoders and then input these features into an LLM\nwith a language prompt. Additionally, we employ a visual-text alignment process\nas a warm-up before the SLT supervision. Our experiments demonstrate that SpaMo\nachieves state-of-the-art performance on two popular datasets, PHOENIX14T and\nHow2Sign.", "paper_summary_zh": "無光澤手語翻譯 (SLT) 將手語影片直接轉換成口說語言句子，而無需依賴光澤。最近，大型語言模型 (LLM) 透過利用其強大的自然語言生成能力，在無光澤方法中展現了卓越的翻譯效能。然而，這些方法通常依賴於視覺編碼器的特定領域微調才能達成最佳結果。相比之下，本文強調捕捉手語中固有的空間配置和動作動態的重要性。基於此，我們引入了基於空間和動作的手語翻譯 (SpaMo)，這是一個新穎的基於 LLM 的 SLT 架構。SpaMo 的核心概念簡單卻有效。我們首先使用現成的視覺編碼器提取空間和動作特徵，然後將這些特徵輸入到具有語言提示的 LLM 中。此外，我們在 SLT 監督之前採用視覺文字對齊程序作為熱身。我們的實驗證明，SpaMo 在兩個熱門數據集 PHOENIX14T 和 How2Sign 上達到了最先進的效能。", "author": "Eui Jun Hwang et.al.", "authors": "Eui Jun Hwang, Sukmin Cho, Junmyeong Lee, Jong C. Park", "id": "2408.10593v1", "paper_url": "http://arxiv.org/abs/2408.10593v1", "repo": "null"}}