{"2410.18001": {"publish_time": "2024-10-23", "title": "Benchmarking Foundation Models on Exceptional Cases: Dataset Creation and Validation", "paper_summary": "Foundation models (FMs) have achieved significant success across various\ntasks, leading to research on benchmarks for reasoning abilities. However,\nthere is a lack of studies on FMs performance in exceptional scenarios, which\nwe define as out-of-distribution (OOD) reasoning tasks. This paper is the first\nto address these cases, developing a novel dataset for evaluation of FMs across\nmultiple modalities, including graphic novels, calligraphy, news articles, and\nlyrics. It includes tasks for instance classification, character recognition,\ntoken prediction, and text generation. The paper also proposes prompt\nengineering techniques like Chain-of-Thought (CoT) and CoT+Few-Shot to enhance\nperformance. Validation of FMs using various methods revealed improvements. The\ncode repository is accessible at:\nhttps://github.com/MLAI-Yonsei/ExceptionalBenchmark", "paper_summary_zh": "基礎模型 (FM) 已在各種任務中取得重大成功，進而促成對推理能力基準的研究。然而，缺乏針對 FM 在特殊情況下的效能研究，我們將其定義為分布外 (OOD) 推理任務。本文率先探討這些案例，開發出一種新穎的資料集，用於評估跨多模態的 FM，包括圖像小說、書法、新聞文章和歌詞。其中包含用於實例分類、字元辨識、符號預測和文字生成的任務。本文也提出提示工程技術，例如思考鏈 (CoT) 和 CoT+Few-Shot，以提升效能。使用各種方法驗證 FM，結果顯示有改善。程式碼儲存庫可於下列網址取得：\nhttps://github.com/MLAI-Yonsei/ExceptionalBenchmark", "author": "Suho Kang et.al.", "authors": "Suho Kang, Jungyang Park, Joonseo Ha, SoMin Kim, JinHyeong Kim, Subeen Park, Kyungwoo Song", "id": "2410.18001v1", "paper_url": "http://arxiv.org/abs/2410.18001v1", "repo": "https://github.com/mlai-yonsei/exceptionalbenchmark"}}