{"2409.02465": {"publish_time": "2024-09-04", "title": "DetectiveQA: Evaluating Long-Context Reasoning on Detective Novels", "paper_summary": "With the rapid advancement of Large Language Models (LLMs), long-context\ninformation understanding and processing have become a hot topic in academia\nand industry. However, benchmarks for evaluating the ability of LLMs to handle\nlong-context information do not seem to have kept pace with the development of\nLLMs. Despite the emergence of various long-context evaluation benchmarks, the\ntypes of capability assessed are still limited, without new capability\ndimensions. In this paper, we introduce DetectiveQA, a narrative reasoning\nbenchmark featured with an average context length of over 100K tokens.\nDetectiveQA focuses on evaluating the long-context reasoning ability of LLMs,\nwhich not only requires a full understanding of context but also requires\nextracting important evidences from the context and reasoning according to\nextracted evidences to answer the given questions. This is a new dimension of\ncapability evaluation, which is more in line with the current intelligence\nlevel of LLMs. We use detective novels as data sources, which naturally have\nvarious reasoning elements. Finally, we manually annotated 600 questions in\nChinese and then also provided an English edition of the context information\nand questions. We evaluate many long-context LLMs on DetectiveQA, including\ncommercial and open-sourced models, and the results indicate that existing\nlong-context LLMs still require significant advancements to effectively process\ntrue long-context dependency questions.", "paper_summary_zh": "隨著大型語言模型 (LLM) 快速發展，長語境資訊理解與處理已成為學界與產業的熱門議題。然而，用於評估 LLM 處理長語境資訊能力的基準似乎並未與 LLM 的發展同步。儘管出現了各種長語境評估基準，但評估的能力類型仍然有限，沒有新的能力面向。在本文中，我們介紹了 DetectiveQA，一個敘事推理基準，其特點是平均語境長度超過 100K 個詞元。DetectiveQA 專注於評估 LLM 的長語境推理能力，這不僅需要對語境有充分的理解，還需要從語境中提取重要的證據，並根據提取的證據進行推理以回答給定的問題。這是一個能力評估的新面向，更符合 LLM 目前的智慧水準。我們使用偵探小說作為數據來源，其中自然包含各種推理元素。最後，我們手動標註了 600 個中文問題，並提供了語境資訊和問題的英文版本。我們在 DetectiveQA 上評估了許多長語境 LLM，包括商業和開源模型，結果表明現有的長語境 LLM 仍需要顯著進展才能有效處理真正的長語境依賴性問題。", "author": "Zhe Xu et.al.", "authors": "Zhe Xu, Jiasheng Ye, Xiangyang Liu, Tianxiang Sun, Xiaoran Liu, Qipeng Guo, Linlin Li, Qun Liu, Xuanjing Huang, Xipeng Qiu", "id": "2409.02465v1", "paper_url": "http://arxiv.org/abs/2409.02465v1", "repo": "null"}}