{"2411.13534": {"publish_time": "2024-11-20", "title": "Predictive Insights into LGBTQ+ Minority Stress: A Transductive Exploration of Social Media Discourse", "paper_summary": "Individuals who identify as sexual and gender minorities, including lesbian,\ngay, bisexual, transgender, queer, and others (LGBTQ+) are more likely to\nexperience poorer health than their heterosexual and cisgender counterparts.\nOne primary source that drives these health disparities is minority stress\n(i.e., chronic and social stressors unique to LGBTQ+ communities' experiences\nadapting to the dominant culture). This stress is frequently expressed in\nLGBTQ+ users' posts on social media platforms. However, these expressions are\nnot just straightforward manifestations of minority stress. They involve\nlinguistic complexity (e.g., idiom or lexical diversity), rendering them\nchallenging for many traditional natural language processing methods to detect.\nIn this work, we designed a hybrid model using Graph Neural Networks (GNN) and\nBidirectional Encoder Representations from Transformers (BERT), a pre-trained\ndeep language model to improve the classification performance of minority\nstress detection. We experimented with our model on a benchmark social media\ndataset for minority stress detection (LGBTQ+ MiSSoM+). The dataset is\ncomprised of 5,789 human-annotated Reddit posts from LGBTQ+ subreddits. Our\napproach enables the extraction of hidden linguistic nuances through\npretraining on a vast amount of raw data, while also engaging in transductive\nlearning to jointly develop representations for both labeled training data and\nunlabeled test data. The RoBERTa-GCN model achieved an accuracy of 0.86 and an\nF1 score of 0.86, surpassing the performance of other baseline models in\npredicting LGBTQ+ minority stress. Improved prediction of minority stress\nexpressions on social media could lead to digital health interventions to\nimprove the wellbeing of LGBTQ+ people-a community with high rates of\nstress-sensitive health problems.", "paper_summary_zh": "<paragraph>認同自己是性與性別少數族群的人，包括女同性戀、男同性戀、雙性戀、跨性別、酷兒和其他 LGBTQ+ 族群，比異性戀和順性別者更容易有較差的健康狀況。造成這些健康差異的主要來源之一是少數族群壓力（即 LGBTQ+ 社群在適應主流文化時獨有的慢性與社會壓力）。這種壓力經常在 LGBTQ+ 使用者於社群媒體平台上的貼文中表達出來。然而，這些表達並不僅僅是少數族群壓力的直接表現。它們包含了語言複雜性（例如慣用語或詞彙多樣性），讓許多傳統的自然語言處理方法難以辨識。在這項研究中，我們設計了一個混合模型，使用圖神經網路 (GNN) 和來自 Transformer 的雙向編碼器表徵 (BERT)，這是一個經過預先訓練的深度語言模型，以提升少數族群壓力辨識的分類效能。我們在一個用於少數族群壓力辨識的基準社群媒體資料集 (LGBTQ+ MiSSoM+) 上對我們的模型進行實驗。該資料集包含了 5,789 篇由人類註解的 Reddit 貼文，來自於 LGBTQ+ 的 subreddit。我們的做法能夠透過在大量的原始資料上進行預訓練來萃取隱藏的語言差異，同時也參與轉導式學習，以共同開發標籤訓練資料和未標籤測試資料的表徵。RoBERTa-GCN 模型達到了 0.86 的準確率和 0.86 的 F1 分數，在預測 LGBTQ+ 少數族群壓力方面超越了其他基線模型的效能。在社群媒體上對少數族群壓力表達的預測改善，可以導致數位健康介入措施，以改善 LGBTQ+ 族群的福祉，而這個族群有很高的壓力敏感性健康問題發生率。</paragraph>", "author": "S. Chapagain et.al.", "authors": "S. Chapagain, Y. Zhao, T. K. Rohleen, S. M. Hamdi, S. F. Boubrahimi, R. E. Flinn, E. M. Lund, D. Klooster, J. R. Scheer, C. J. Cascalheira", "id": "2411.13534v1", "paper_url": "http://arxiv.org/abs/2411.13534v1", "repo": "null"}}