{"2407.02960": {"publish_time": "2024-07-03", "title": "ObfuscaTune: Obfuscated Offsite Fine-tuning and Inference of Proprietary LLMs on Private Datasets", "paper_summary": "This work addresses the timely yet underexplored problem of performing\ninference and finetuning of a proprietary LLM owned by a model provider entity\non the confidential/private data of another data owner entity, in a way that\nensures the confidentiality of both the model and the data. Hereby, the\nfinetuning is conducted offsite, i.e., on the computation infrastructure of a\nthird-party cloud provider. We tackle this problem by proposing ObfuscaTune, a\nnovel, efficient and fully utility-preserving approach that combines a simple\nyet effective obfuscation technique with an efficient usage of confidential\ncomputing (only 5% of the model parameters are placed on TEE). We empirically\ndemonstrate the effectiveness of ObfuscaTune by validating it on GPT-2 models\nwith different sizes on four NLP benchmark datasets. Finally, we compare to a\nna\\\"ive version of our approach to highlight the necessity of using random\nmatrices with low condition numbers in our approach to reduce errors induced by\nthe obfuscation.", "paper_summary_zh": "本研究解決了一個及時但未被充分探討的問題，即以一種確保模型和數據機密性的方式，在另一個數據所有者實體的機密/私人數據上執行模型提供者實體擁有的專有 LLM 的推理和微調。在此，微調是在場外進行的，即在第三方雲提供商的計算基礎設施上。我們通過提出 ObfuscaTune 來解決這個問題，這是一種新穎、高效且完全保留效用的方法，它結合了一種簡單但有效的混淆技術與機密計算的有效使用（只有 5% 的模型參數被放置在 TEE 上）。我們通過在四個 NLP 基準數據集上驗證不同大小的 GPT-2 模型，經驗性地證明了 ObfuscaTune 的有效性。最後，我們將其與我們方法的「天真」版本進行比較，以強調在我們的過程中使用條件數低的隨機矩陣以減少混淆引起的錯誤的必要性。", "author": "Ahmed Frikha et.al.", "authors": "Ahmed Frikha, Nassim Walha, Ricardo Mendes, Krishna Kanth Nakka, Xue Jiang, Xuebing Zhou", "id": "2407.02960v1", "paper_url": "http://arxiv.org/abs/2407.02960v1", "repo": "null"}}