{"2406.15267": {"publish_time": "2024-06-21", "title": "Evaluating Diversity in Automatic Poetry Generation", "paper_summary": "Natural Language Generation (NLG), and more generally generative AI, are\namong the currently most impactful research fields. Creative NLG, such as\nautomatic poetry generation, is a fascinating niche in this area. While most\nprevious research has focused on forms of the Turing test when evaluating\nautomatic poetry generation - can humans distinguish between automatic and\nhuman generated poetry - we evaluate the diversity of automatically generated\npoetry, by comparing distributions of generated poetry to distributions of\nhuman poetry along structural, lexical, semantic and stylistic dimensions,\nassessing different model types (word vs. character-level, general purpose LLMs\nvs. poetry-specific models), including the very recent LLaMA3, and types of\nfine-tuning (conditioned vs. unconditioned). We find that current automatic\npoetry systems are considerably underdiverse along multiple dimensions - they\noften do not rhyme sufficiently, are semantically too uniform and even do not\nmatch the length distribution of human poetry. Our experiments reveal, however,\nthat style-conditioning and character-level modeling clearly increases\ndiversity across virtually all dimensions we explore. Our identified\nlimitations may serve as the basis for more genuinely diverse future poetry\ngeneration models.", "paper_summary_zh": "自然語言生成 (NLG)，更廣泛地說是生成式 AI，是目前影響力最大的研究領域之一。創意 NLG，例如自動詩歌生成，是這個領域中一個迷人的利基市場。雖然大多數先前的研究在評估自動詩歌生成時都專注於圖靈測試的形式 - 人類可以區分自動生成和人類生成的詩歌嗎 - 我們透過將生成詩歌的分布與人類詩歌在結構、詞彙、語義和風格維度的分布進行比較來評估自動生成詩歌的多樣性，評估不同的模型類型（單字與字元層級、通用 LLM 與特定於詩歌的模型），包括最新的 LLaMA3，以及微調類型（條件式與非條件式）。我們發現目前的自動詩歌系統在多個維度上顯著不足 - 它們通常押韻不足、語義過於單調，甚至不符合人類詩歌的長度分佈。然而，我們的實驗表明，風格條件化和字元層級建模顯著增加了我們探索的幾乎所有維度上的多樣性。我們發現的限制可能作為更真實多樣化的未來詩歌生成模型的基礎。", "author": "Yanran Chen et.al.", "authors": "Yanran Chen, Hannes Gröner, Sina Zarrieß, Steffen Eger", "id": "2406.15267v1", "paper_url": "http://arxiv.org/abs/2406.15267v1", "repo": "null"}}