{"2408.14853": {"publish_time": "2024-08-27", "title": "Detecting AI Flaws: Target-Driven Attacks on Internal Faults in Language Models", "paper_summary": "Large Language Models (LLMs) have become a focal point in the rapidly\nevolving field of artificial intelligence. However, a critical concern is the\npresence of toxic content within the pre-training corpus of these models, which\ncan lead to the generation of inappropriate outputs. Investigating methods for\ndetecting internal faults in LLMs can help us understand their limitations and\nimprove their security. Existing methods primarily focus on jailbreaking\nattacks, which involve manually or automatically constructing adversarial\ncontent to prompt the target LLM to generate unexpected responses. These\nmethods rely heavily on prompt engineering, which is time-consuming and usually\nrequires specially designed questions. To address these challenges, this paper\nproposes a target-driven attack paradigm that focuses on directly eliciting the\ntarget response instead of optimizing the prompts. We introduce the use of\nanother LLM as the detector for toxic content, referred to as ToxDet. Given a\ntarget toxic response, ToxDet can generate a possible question and a\npreliminary answer to provoke the target model into producing desired toxic\nresponses with meanings equivalent to the provided one. ToxDet is trained by\ninteracting with the target LLM and receiving reward signals from it, utilizing\nreinforcement learning for the optimization process. While the primary focus of\nthe target models is on open-source LLMs, the fine-tuned ToxDet can also be\ntransferred to attack black-box models such as GPT-4o, achieving notable\nresults. Experimental results on AdvBench and HH-Harmless datasets demonstrate\nthe effectiveness of our methods in detecting the tendencies of target LLMs to\ngenerate harmful responses. This algorithm not only exposes vulnerabilities but\nalso provides a valuable resource for researchers to strengthen their models\nagainst such attacks.", "paper_summary_zh": "大型語言模型 (LLM) 已成為快速發展的人工智慧領域的焦點。然而，一個關鍵問題是這些模型的預訓練語料庫中存在有毒內容，這可能會導致產生不適當的輸出。探討用於偵測 LLM 內部故障的方法，有助於我們了解其限制並提升其安全性。現有方法主要專注於越獄攻擊，其中涉及手動或自動建構對抗性內容，以提示目標 LLM 產生意外的回應。這些方法高度依賴提示工程，這非常耗時，而且通常需要特別設計的問題。為了應對這些挑戰，本文提出了一種目標導向的攻擊範例，專注於直接引發目標回應，而不是最佳化提示。我們引入了使用另一個 LLM 作為有毒內容的偵測器，稱為 ToxDet。給定一個目標有毒回應，ToxDet 可以產生一個可能的問題和一個初步答案，以激發目標模型產生具有等同於所提供內容意義的所需有毒回應。ToxDet 是透過與目標 LLM 互動並從中接收獎勵訊號，利用強化學習進行最佳化過程來訓練的。雖然目標模型的主要焦點是開源 LLM，但微調後的 ToxDet 也可以轉移到攻擊黑盒模型，例如 GPT-4o，並獲得顯著的成果。在 AdvBench 和 HH-Harmless 資料集上的實驗結果證明了我們的方法在偵測目標 LLM 產生有害回應的傾向方面非常有效。此演算法不僅揭露了漏洞，還為研究人員提供了寶貴的資源，可讓他們強化其模型以抵禦此類攻擊。", "author": "Yuhao Du et.al.", "authors": "Yuhao Du, Zhuo Li, Pengyu Cheng, Xiang Wan, Anningzhe Gao", "id": "2408.14853v1", "paper_url": "http://arxiv.org/abs/2408.14853v1", "repo": "null"}}