{"2410.21728": {"publish_time": "2024-10-29", "title": "Let's Be Self-generated via Step by Step: A Curriculum Learning Approach to Automated Reasoning with Large Language Models", "paper_summary": "While Chain of Thought (CoT) prompting approaches have significantly\nconsolidated the reasoning capabilities of large language models (LLMs), they\nstill face limitations that require extensive human effort or have performance\nneeds to be improved. Existing endeavors have focused on bridging these gaps;\nhowever, these approaches either hinge on external data and cannot completely\neliminate manual effort, or they fall short in effectively directing LLMs to\ngenerate high-quality exemplary prompts. To address the said pitfalls, we\npropose a novel prompt approach for automatic reasoning named \\textbf{LBS3},\ninspired by curriculum learning which better reflects human learning habits.\nSpecifically, LBS3 initially steers LLMs to recall easy-to-hard proxy queries\nthat are pertinent to the target query. Following this, it invokes a\nprogressive strategy that utilizes exemplary prompts stemmed from easy-proxy\nqueries to direct LLMs in solving hard-proxy queries, enabling the high-quality\nof the proxy solutions. Finally, our extensive experiments in various\nreasoning-intensive tasks with varying open- and closed-source LLMs show that\nLBS3 achieves strongly competitive performance compared to the SOTA baselines.", "paper_summary_zh": "雖然思考鏈 (CoT) 提示方法大幅整合了大型語言模型 (LLM) 的推理能力，但它們仍然面臨需要大量人力或需要改進效能的限制。現有的努力專注於彌補這些差距；然而，這些方法依賴於外部資料，無法完全消除手動工作，或者無法有效引導 LLM 產生高品質的範例提示。為了解決這些缺點，我們提出了一種名為 \\textbf{LBS3} 的自動推理新提示方法，其靈感來自更能反映人類學習習慣的課程學習。具體來說，LBS3 最初引導 LLM 回憶與目標查詢相關的易到難代理查詢。在此之後，它會採用一種漸進策略，利用源自於簡單代理查詢的範例提示來引導 LLM 解決困難的代理查詢，從而提高代理解決方案的品質。最後，我們在各種推理密集型任務中對各種開源和閉源 LLM 進行的廣泛實驗表明，與 SOTA 基準相比，LBS3 獲得了極具競爭力的效能。", "author": "Kangyang Luo et.al.", "authors": "Kangyang Luo, Zichen Ding, Zhenmin Weng, Lingfeng Qiao, Meng Zhao, Xiang Li, Di Yin, Jinlong Shu", "id": "2410.21728v1", "paper_url": "http://arxiv.org/abs/2410.21728v1", "repo": "null"}}