{"2408.02666": {"publish_time": "2024-08-05", "title": "Self-Taught Evaluators", "paper_summary": "Model-based evaluation is at the heart of successful model development -- as\na reward model for training, and as a replacement for human evaluation. To\ntrain such evaluators, the standard approach is to collect a large amount of\nhuman preference judgments over model responses, which is costly and the data\nbecomes stale as models improve. In this work, we present an approach that aims\nto im-prove evaluators without human annotations, using synthetic training data\nonly. Starting from unlabeled instructions, our iterative self-improvement\nscheme generates contrasting model outputs and trains an LLM-as-a-Judge to\nproduce reasoning traces and final judgments, repeating this training at each\nnew iteration using the improved predictions. Without any labeled preference\ndata, our Self-Taught Evaluator can improve a strong LLM (Llama3-70B-Instruct)\nfrom 75.4 to 88.3 (88.7 with majority vote) on RewardBench. This outperforms\ncommonly used LLM judges such as GPT-4 and matches the performance of the\ntop-performing reward models trained with labeled examples.", "paper_summary_zh": "基於模型的評估是成功模型開發的核心，作為訓練的獎勵模型，以及作為人工評估的替代方案。為了訓練此類評估器，標準方法是收集大量人類偏好判斷，以對模型反應進行評估，這既昂貴，而且隨著模型的改進，數據也會變得陳舊。在這項工作中，我們提出了一種旨在在沒有人工註解的情況下改進評估器的方法，僅使用合成訓練數據。從未標記的說明開始，我們的迭代式自我改進方案會產生對比的模型輸出，並訓練 LLM-as-a-Judge 以產生推理追蹤和最終判斷，在每次新的迭代中使用改進的預測重複此訓練。在沒有任何標記的偏好數據的情況下，我們的自學評估器可以將強大的 LLM（Llama3-70B-Instruct）從 RewardBench 上的 75.4 提升到 88.3（多數投票為 88.7）。這優於常用的 LLM 評審，例如 GPT-4，並且與使用標記範例訓練的效能最佳的獎勵模型的效能相匹配。", "author": "Tianlu Wang et.al.", "authors": "Tianlu Wang, Ilia Kulikov, Olga Golovneva, Ping Yu, Weizhe Yuan, Jane Dwivedi-Yu, Richard Yuanzhe Pang, Maryam Fazel-Zarandi, Jason Weston, Xian Li", "id": "2408.02666v1", "paper_url": "http://arxiv.org/abs/2408.02666v1", "repo": "null"}}