{"2411.13687": {"publish_time": "2024-11-20", "title": "Hierarchical Text Classification (HTC) vs. eXtreme Multilabel Classification (XML): Two Sides of the Same Medal", "paper_summary": "Assigning a subset of labels from a fixed pool of labels to a given input\ntext is a text classification problem with many real-world applications, such\nas in recommender systems. Two separate research streams address this issue.\nHierarchical Text Classification (HTC) focuses on datasets with smaller label\npools of hundreds of entries, accompanied by a semantic label hierarchy. In\ncontrast, eXtreme Multi-Label Text Classification (XML) considers very large\nlabel pools with up to millions of entries, in which the labels are not\narranged in any particular manner. However, in XML, a common approach is to\nconstruct an artificial hierarchy without any semantic information before or\nduring the training process. Here, we investigate how state-of-the-art models\nfrom one domain perform when trained and tested on datasets from the other\ndomain. The HBGL and HGLCR models from the HTC domain are trained and tested on\nthe datasets Wiki10-31K, AmazonCat-13K, and Amazon-670K from the XML domain. On\nthe other side, the XML models CascadeXML and XR-Transformer are trained and\ntested on the datasets Web of Science, The New York Times Annotated Corpus, and\nRCV1-V2 from the HTC domain. HTC models, on the other hand, are not equipped to\nhandle the size of XML datasets and achieve poor transfer results. The code and\nnumerous files that are needed to reproduce our results can be obtained from\nhttps://github.com/FloHauss/XMC_HTC", "paper_summary_zh": "將固定標籤池中的標籤子集指定給特定輸入文字是文字分類問題，在許多實際應用中會遇到，例如推薦系統。兩個獨立的研究領域探討此議題。階層式文字分類 (HTC) 專注於標籤池較小的資料集，其中包含數百個項目，並附帶語意標籤階層。相反地，極端多標籤文字分類 (XML) 考量包含數百萬個項目的非常大的標籤池，其中標籤並未以任何特定方式排列。然而，在 XML 中，一種常見的方法是在訓練過程中或之前建構一個不含任何語意資訊的人工階層。在此，我們探討來自一個領域的最新模型在針對來自另一個領域的資料集進行訓練和測試時如何執行。HTC 領域的 HBGL 和 HGLCR 模型在 XML 領域的資料集 Wiki10-31K、AmazonCat-13K 和 Amazon-670K 上進行訓練和測試。另一方面，XML 模型 CascadeXML 和 XR-Transformer 在 HTC 領域的資料集 Web of Science、The New York Times Annotated Corpus 和 RCV1-V2 上進行訓練和測試。另一方面，HTC 模型並未具備處理 XML 資料集大小的能力，且轉移結果不佳。可以在 https://github.com/FloHauss/XMC_HTC 取得重現我們結果所需的程式碼和大量檔案。", "author": "Nerijus Bertalis et.al.", "authors": "Nerijus Bertalis, Paul Granse, Ferhat Gül, Florian Hauss, Leon Menkel, David Schüler, Tom Speier, Lukas Galke, Ansgar Scherp", "id": "2411.13687v1", "paper_url": "http://arxiv.org/abs/2411.13687v1", "repo": "https://github.com/flohauss/xmc_htc"}}