{"2406.18552": {"publish_time": "2024-05-23", "title": "Decoding Decision Reasoning: A Counterfactual-Powered Model for Knowledge Discovery", "paper_summary": "In medical imaging, particularly in early disease detection and prognosis\ntasks, discerning the rationale behind an AI model's predictions is crucial for\nevaluating the reliability of its decisions. Conventional explanation methods\nface challenges in identifying discernible decisive features in medical image\nclassifications, where discriminative features are subtle or not immediately\napparent. To bridge this gap, we propose an explainable model that is equipped\nwith both decision reasoning and feature identification capabilities. Our\napproach not only detects influential image patterns but also uncovers the\ndecisive features that drive the model's final predictions. By implementing our\nmethod, we can efficiently identify and visualise class-specific features\nleveraged by the data-driven model, providing insights into the decision-making\nprocesses of deep learning models. We validated our model in the demanding\nrealm of medical prognosis task, demonstrating its efficacy and potential in\nenhancing the reliability of AI in healthcare and in discovering new knowledge\nin diseases where prognostic understanding is limited.", "paper_summary_zh": "在醫學影像中，特別是在早期疾病檢測和預後任務中，辨別 AI 模型預測背後的原理對於評估其決策的可靠性至關重要。傳統的解釋方法在識別醫學影像分類中可識別的決定性特徵時面臨挑戰，其中區別性特徵很微妙或並不明顯。為了彌合這一差距，我們提出了一個可解釋的模型，該模型具備決策推理和特徵識別能力。我們的做法不僅檢測有影響力的影像模式，還揭示了推動模型最終預測的決定性特徵。通過實施我們的模型，我們可以有效識別和視覺化由數據驅動模型利用的類特定特徵，從而深入了解深度學習模型的決策過程。我們在要求嚴格的醫學預後任務領域驗證了我們的模型，展示了其在提高 AI 在醫療保健中的可靠性和發現預後理解受限疾病的新知識方面的功效和潛力。", "author": "Yingying Fang et.al.", "authors": "Yingying Fang, Zihao Jin, Xiaodan Xing, Simon Walsh, Guang Yang", "id": "2406.18552v1", "paper_url": "http://arxiv.org/abs/2406.18552v1", "repo": "null"}}