{"2405.05347": {"publish_time": "2024-05-08", "title": "Benchmarking Educational Program Repair", "paper_summary": "The emergence of large language models (LLMs) has sparked enormous interest\ndue to their potential application across a range of educational tasks. For\nexample, recent work in programming education has used LLMs to generate\nlearning resources, improve error messages, and provide feedback on code.\nHowever, one factor that limits progress within the field is that much of the\nresearch uses bespoke datasets and different evaluation metrics, making direct\ncomparisons between results unreliable. Thus, there is a pressing need for\nstandardization and benchmarks that facilitate the equitable comparison of\ncompeting approaches. One task where LLMs show great promise is program repair,\nwhich can be used to provide debugging support and next-step hints to students.\nIn this article, we propose a novel educational program repair benchmark. We\ncurate two high-quality publicly available programming datasets, present a\nunified evaluation procedure introducing a novel evaluation metric rouge@k for\napproximating the quality of repairs, and evaluate a set of five recent models\nto establish baseline performance.", "paper_summary_zh": "大型語言模型 (LLM) 的出現引起了極大的興趣，因為它們在各種教育任務中具有潛在的應用。例如，最近在程式設計教育中的工作已使用 LLM 來產生學習資源、改善錯誤訊息，並提供程式碼回饋。然而，限制該領域進展的一個因素是，許多研究使用客製化資料集和不同的評估指標，這使得結果之間的直接比較不可靠。因此，迫切需要標準化和基準，以促進競爭方法的公平比較。LLM 顯現出巨大潛力的其中一項任務是程式修復，可用於提供除錯支援和下一步提示給學生。在本文中，我們提出了一個新穎的教育程式修復基準。我們策劃了兩個高品質的公開程式設計資料集，提出了一個統一的評估程序，並引入了新的評估指標 Rouge@k 來近似修復品質，並評估了一組五個最近的模型以建立基準效能。", "author": "Charles Koutcheme et.al.", "authors": "Charles Koutcheme, Nicola Dainese, Sami Sarsa, Juho Leinonen, Arto Hellas, Paul Denny", "id": "2405.05347v1", "paper_url": "http://arxiv.org/abs/2405.05347v1", "repo": "https://github.com/koutchemecharles/gaied_nips23"}}