{"2405.11685": {"publish_time": "2024-05-19", "title": "ColorFoil: Investigating Color Blindness in Large Vision and Language Models", "paper_summary": "With the utilization of Transformer architecture, large Vision and Language\n(V&L) models have shown promising performance in even zero-shot settings.\nSeveral studies, however, indicate a lack of robustness of the models when\ndealing with complex linguistics and visual attributes. In this work, we\nintroduce a novel V&L benchmark - ColorFoil, by creating color-related foils to\nassess the models' perception ability to detect colors like red, white, green,\netc. We evaluate seven state-of-the-art V&L models including CLIP, ViLT,\nGroupViT, and BridgeTower, etc. in a zero-shot setting and present intriguing\nfindings from the V&L models. The experimental evaluation indicates that ViLT\nand BridgeTower demonstrate much better color perception capabilities compared\nto CLIP and its variants and GroupViT. Moreover, CLIP-based models and GroupViT\nstruggle to distinguish colors that are visually distinct to humans with normal\ncolor perception ability.", "paper_summary_zh": "透過 Transformer 架構的運用，大型視覺與語言 (V&L) 模型即使在零次學習的設定下，也展現出令人滿意的表現。然而，一些研究指出，當處理複雜的語言學和視覺屬性時，這些模型缺乏穩健性。在這項工作中，我們透過建立與顏色相關的誘餌，來評估模型偵測紅色、白色、綠色等顏色的感知能力，進而提出一個新穎的 V&L 基準測試 ColorFoil。我們在零次學習的設定下，評估了七個最先進的 V&L 模型，包括 CLIP、ViLT、GroupViT 和 BridgeTower 等，並提出 V&L 模型中引人入勝的發現。實驗評估指出，與 CLIP 及其變體和 GroupViT 相比，ViLT 和 BridgeTower 展現出更好的色彩感知能力。此外，基於 CLIP 的模型和 GroupViT 難以區分對具有正常色彩感知能力的人類而言在視覺上截然不同的顏色。", "author": "Ahnaf Mozib Samin et.al.", "authors": "Ahnaf Mozib Samin, M. Firoz Ahmed, Md. Mushtaq Shahriyar Rafee", "id": "2405.11685v1", "paper_url": "http://arxiv.org/abs/2405.11685v1", "repo": "null"}}