{"2409.05701": {"publish_time": "2024-09-09", "title": "pFedGPA: Diffusion-based Generative Parameter Aggregation for Personalized Federated Learning", "paper_summary": "Federated Learning (FL) offers a decentralized approach to model training,\nwhere data remains local and only model parameters are shared between the\nclients and the central server. Traditional methods, such as Federated\nAveraging (FedAvg), linearly aggregate these parameters which are usually\ntrained on heterogeneous data distributions, potentially overlooking the\ncomplex, high-dimensional nature of the parameter space. This can result in\ndegraded performance of the aggregated model. While personalized FL approaches\ncan mitigate the heterogeneous data issue to some extent, the limitation of\nlinear aggregation remains unresolved. To alleviate this issue, we investigate\nthe generative approach of diffusion model and propose a novel generative\nparameter aggregation framework for personalized FL, \\texttt{pFedGPA}. In this\nframework, we deploy a diffusion model on the server to integrate the diverse\nparameter distributions and propose a parameter inversion method to efficiently\ngenerate a set of personalized parameters for each client. This inversion\nmethod transforms the uploaded parameters into a latent code, which is then\naggregated through denoising sampling to produce the final personalized\nparameters. By encoding the dependence of a client's model parameters on the\nspecific data distribution using the high-capacity diffusion model,\n\\texttt{pFedGPA} can effectively decouple the complexity of the overall\ndistribution of all clients' model parameters from the complexity of each\nindividual client's parameter distribution. Our experimental results\nconsistently demonstrate the superior performance of the proposed method across\nmultiple datasets, surpassing baseline approaches.", "paper_summary_zh": "聯邦學習 (FL) 提供一種分散式模型訓練方法，其中資料保持在本地，只有模型參數在客戶端和中央伺服器之間共享。傳統方法，例如聯邦平均 (FedAvg)，會線性聚合這些參數，這些參數通常在異質資料分佈上訓練，可能會忽略參數空間複雜、高維度的特性。這可能會導致聚合模型的效能下降。雖然個人化 FL 方法可以在某種程度上減輕異質資料問題，但線性聚合的限制仍然沒有解決。為了緩解這個問題，我們研究了擴散模型的生成式方法，並為個人化 FL 提出了一個新穎的生成式參數聚合架構，\\texttt{pFedGPA}。在此架構中，我們在伺服器上部署一個擴散模型來整合不同的參數分佈，並提出一個參數反演方法，以有效地為每個客戶端產生一組個人化參數。此反演方法將上傳的參數轉換為潛在代碼，然後透過去噪抽樣進行聚合，以產生最終的個人化參數。透過使用高容量擴散模型編碼客戶端模型參數對特定資料分佈的依賴性，\\texttt{pFedGPA} 可以有效地將所有客戶端模型參數的整體分佈的複雜性與每個個別客戶端參數分佈的複雜性分開。我們的實驗結果一致地證明了所提出的方法在多個資料集上的優異效能，超越了基線方法。", "author": "Jiahao Lai et.al.", "authors": "Jiahao Lai, Jiaqi Li, Jian Xu, Yanru Wu, Boshi Tang, Siqi Chen, Yongfeng Huang, Wenbo Ding, Yang Li", "id": "2409.05701v1", "paper_url": "http://arxiv.org/abs/2409.05701v1", "repo": "null"}}