{"2410.17343": {"publish_time": "2024-10-22", "title": "EEG-DIF: Early Warning of Epileptic Seizures through Generative Diffusion Model-based Multi-channel EEG Signals Forecasting", "paper_summary": "Multi-channel EEG signals are commonly used for the diagnosis and assessment\nof diseases such as epilepsy. Currently, various EEG diagnostic algorithms\nbased on deep learning have been developed. However, most research efforts\nfocus solely on diagnosing and classifying current signal data but do not\nconsider the prediction of future trends for early warning. Additionally, since\nmulti-channel EEG can be essentially regarded as the spatio-temporal signal\ndata received by detectors at different locations in the brain, how to\nconstruct spatio-temporal information representations of EEG signals to\nfacilitate future trend prediction for multi-channel EEG becomes an important\nproblem. This study proposes a multi-signal prediction algorithm based on\ngenerative diffusion models (EEG-DIF), which transforms the multi-signal\nforecasting task into an image completion task, allowing for comprehensive\nrepresentation and learning of the spatio-temporal correlations and future\ndevelopmental patterns of multi-channel EEG signals. Here, we employ a publicly\navailable epilepsy EEG dataset to construct and validate the EEG-DIF. The\nresults demonstrate that our method can accurately predict future trends for\nmulti-channel EEG signals simultaneously. Furthermore, the early warning\naccuracy for epilepsy seizures based on the generated EEG data reaches 0.89. In\ngeneral, EEG-DIF provides a novel approach for characterizing multi-channel EEG\nsignals and an innovative early warning algorithm for epilepsy seizures, aiding\nin optimizing and enhancing the clinical diagnosis process. The code is\navailable at https://github.com/JZK00/EEG-DIF.", "paper_summary_zh": "多通道 EEG 信號通常用於診斷和評估癲癇等疾病。目前，已經開發了各種基於深度學習的 EEG 診斷演算法。然而，大多數研究工作僅專注於診斷和分類當前信號資料，但沒有考慮預測未來趨勢以進行早期預警。此外，由於多通道 EEG 本質上可以視為大腦不同位置的偵測器接收到的時空信號資料，因此如何建構 EEG 信號的時空資訊表徵以利於多通道 EEG 的未來趨勢預測成為一個重要的問題。本研究提出了一個基於生成擴散模型 (EEG-DIF) 的多信號預測演算法，它將多信號預測任務轉換為影像完成任務，允許對多通道 EEG 信號的時空關聯性和未來發展模式進行全面的表徵和學習。在此，我們採用一個公開的癲癇 EEG 資料集來建構和驗證 EEG-DIF。結果表明，我們的方法可以準確預測多通道 EEG 信號的未來趨勢。此外，基於生成的 EEG 資料的癲癇發作的早期預警準確率達到 0.89。總的來說，EEG-DIF 為多通道 EEG 信號表徵提供了一種新穎的方法，並為癲癇發作提供了一種創新的早期預警演算法，有助於優化和加強臨床診斷過程。程式碼可在 https://github.com/JZK00/EEG-DIF 取得。", "author": "Zekun Jiang et.al.", "authors": "Zekun Jiang, Wei Dai, Qu Wei, Ziyuan Qin, Kang Li, Le Zhang", "id": "2410.17343v1", "paper_url": "http://arxiv.org/abs/2410.17343v1", "repo": "https://github.com/jzk00/eeg-dif"}}