{"2502.13766": {"publish_time": "2025-02-19", "title": "GIMMICK -- Globally Inclusive Multimodal Multitask Cultural Knowledge Benchmarking", "paper_summary": "Large Vision-Language Models (LVLMs) have recently gained attention due to\ntheir distinctive performance and broad applicability. While it has been\npreviously shown that their efficacy in usage scenarios involving non-Western\ncontexts falls short, existing studies are limited in scope, covering just a\nnarrow range of cultures, focusing exclusively on a small number of cultural\naspects, or evaluating a limited selection of models on a single task only.\nTowards globally inclusive LVLM research, we introduce GIMMICK, an extensive\nmultimodal benchmark designed to assess a broad spectrum of cultural knowledge\nacross 144 countries representing six global macro-regions. GIMMICK comprises\nsix tasks built upon three new datasets that span 728 unique cultural events or\nfacets on which we evaluated 20 LVLMs and 11 LLMs, including five proprietary\nand 26 open-weight models of all sizes. We systematically examine (1) regional\ncultural biases, (2) the influence of model size, (3) input modalities, and (4)\nexternal cues. Our analyses reveal strong biases toward Western cultures across\nmodels and tasks and highlight strong correlations between model size and\nperformance, as well as the effectiveness of multimodal input and external\ngeographic cues. We further find that models have more knowledge of tangible\nthan intangible aspects (e.g., food vs. rituals) and that they excel in\nrecognizing broad cultural origins but struggle with a more nuanced\nunderstanding.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 最近因其獨特的效能和廣泛的適用性而備受矚目。雖然先前已顯示出它們在涉及非西方語境的使用情境中的功效不足，但現有研究的範圍有限，僅涵蓋少數文化，專注於少數文化面向，或僅針對單一任務評估有限的模型選項。為了促進全球包容性的 LVLM 研究，我們引入了 GIMMICK，這是一個廣泛的多模態基準，旨在評估橫跨六個全球巨型區域的 144 個國家的廣泛文化知識。GIMMICK 包含六項任務，建立在三個新的資料集上，涵蓋 728 個獨特的文化事件或面向，我們在這些面向評估了 20 個 LVLMs 和 11 個 LLM，包括五個專有模型和 26 個各種規模的開放權重模型。我們系統性地檢驗 (1) 區域文化偏見、(2) 模型規模的影響、(3) 輸入模式，以及 (4) 外部提示。我們的分析揭示了所有模型和任務中對西方文化的強烈偏見，並強調了模型規模和效能之間的強烈相關性，以及多模式輸入和外部地理提示的有效性。我們進一步發現，模型對有形面向（例如食物與儀式）的了解多於無形面向，而且它們擅長辨識廣泛的文化起源，但在更細緻的理解上則有困難。", "author": "Florian Schneider et.al.", "authors": "Florian Schneider, Carolin Holtermann, Chris Biemann, Anne Lauscher", "id": "2502.13766v1", "paper_url": "http://arxiv.org/abs/2502.13766v1", "repo": "null"}}