{"2407.11948": {"publish_time": "2024-07-16", "title": "Rethinking Transformer-based Multi-document Summarization: An Empirical Investigation", "paper_summary": "The utilization of Transformer-based models prospers the growth of\nmulti-document summarization (MDS). Given the huge impact and widespread\nadoption of Transformer-based models in various natural language processing\ntasks, investigating their performance and behaviors in the context of MDS\nbecomes crucial for advancing the field and enhancing the quality of summary.\nTo thoroughly examine the behaviours of Transformer-based MDS models, this\npaper presents five empirical studies on (1) measuring the impact of document\nboundary separators quantitatively; (2) exploring the effectiveness of\ndifferent mainstream Transformer structures; (3) examining the sensitivity of\nthe encoder and decoder; (4) discussing different training strategies; and (5)\ndiscovering the repetition in a summary generation. The experimental results on\nprevalent MDS datasets and eleven evaluation metrics show the influence of\ndocument boundary separators, the granularity of different level features and\ndifferent model training strategies. The results also reveal that the decoder\nexhibits greater sensitivity to noises compared to the encoder. This\nunderscores the important role played by the decoder, suggesting a potential\ndirection for future research in MDS. Furthermore, the experimental results\nindicate that the repetition problem in the generated summaries has\ncorrelations with the high uncertainty scores.", "paper_summary_zh": "<paragraph>基於 Transformer 的模型運用蓬勃發展了多文件摘要 (MDS) 的成長。由於基於 Transformer 的模型在各種自然語言處理任務中具有巨大的影響力和廣泛的採用，因此研究它們在 MDS 背景下的效能和行為對於推動該領域和提升摘要品質至關重要。為了徹底檢驗基於 Transformer 的 MDS 模型的行為，本文針對 (1) 定量測量文件邊界分隔符的影響；(2) 探討不同主流 Transformer 結構的有效性；(3) 檢驗編碼器和解碼器的敏感性；(4) 討論不同的訓練策略；以及 (5) 發現摘要生成中的重複性，提出了五項實證研究。在流行的 MDS 資料集和 11 項評估指標上的實驗結果顯示了文件邊界分隔符、不同層級特徵的粒度和不同模型訓練策略的影響。結果還揭示，與編碼器相比，解碼器對雜訊表現出更大的敏感性。這強調了解碼器所扮演的重要角色，為 MDS 未來的研究指出了潛在的方向。此外，實驗結果表明，生成的摘要中重複出現的問題與高不確定性分數有關。</paragraph>", "author": "Congbo Ma et.al.", "authors": "Congbo Ma, Wei Emma Zhang, Dileepa Pitawela, Haojie Zhuang, Yanfeng Shu", "id": "2407.11948v1", "paper_url": "http://arxiv.org/abs/2407.11948v1", "repo": "null"}}