{"2408.08396": {"publish_time": "2024-08-15", "title": "Level Up Your Tutorials: VLMs for Game Tutorials Quality Assessment", "paper_summary": "Designing effective game tutorials is crucial for a smooth learning curve for\nnew players, especially in games with many rules and complex core mechanics.\nEvaluating the effectiveness of these tutorials usually requires multiple\niterations with testers who have no prior knowledge of the game. Recent\nVision-Language Models (VLMs) have demonstrated significant capabilities in\nunderstanding and interpreting visual content. VLMs can analyze images, provide\ndetailed insights, and answer questions about their content. They can recognize\nobjects, actions, and contexts in visual data, making them valuable tools for\nvarious applications, including automated game testing. In this work, we\npropose an automated game-testing solution to evaluate the quality of game\ntutorials. Our approach leverages VLMs to analyze frames from video game\ntutorials, answer relevant questions to simulate human perception, and provide\nfeedback. This feedback is compared with expected results to identify confusing\nor problematic scenes and highlight potential errors for developers. In\naddition, we publish complete tutorial videos and annotated frames from\ndifferent game versions used in our tests. This solution reduces the need for\nextensive manual testing, especially by speeding up and simplifying the initial\ndevelopment stages of the tutorial to improve the final game experience.", "paper_summary_zh": "設計有效的遊戲教學課程對於新玩家的順利學習曲線至關重要，特別是在具有許多規則和複雜核心機制的遊戲中。評估這些教學課程的有效性通常需要與對遊戲沒有任何先備知識的測試人員進行多次迭代。最近的視覺語言模型 (VLM) 已展現出在理解和詮釋視覺內容方面的顯著能力。VLM 可以分析影像、提供詳細見解，並回答有關其內容的問題。它們可以辨識視覺資料中的物件、動作和背景，使其成為各種應用程式的寶貴工具，包括自動化遊戲測試。在這項工作中，我們提出一個自動化遊戲測試解決方案來評估遊戲教學課程的品質。我們的做法利用 VLM 來分析電子遊戲教學課程中的畫面、回答相關問題以模擬人類感知，並提供回饋。此回饋會與預期結果進行比較，以找出令人困惑或有問題的場景，並重點指出開發人員的潛在錯誤。此外，我們會發布在測試中使用的不同遊戲版本的完整教學課程影片和註解畫面。此解決方案減少了廣泛手動測試的需求，特別是透過加速和簡化教學課程的初始開發階段，以改善最終的遊戲體驗。", "author": "Daniele Rege Cambrin et.al.", "authors": "Daniele Rege Cambrin, Gabriele Scaffidi Militone, Luca Colomba, Giovanni Malnati, Daniele Apiletti, Paolo Garza", "id": "2408.08396v1", "paper_url": "http://arxiv.org/abs/2408.08396v1", "repo": "null"}}