{"2406.11497": {"publish_time": "2024-06-17", "title": "CrAM: Credibility-Aware Attention Modification in LLMs for Combating Misinformation in RAG", "paper_summary": "Retrieval-Augmented Generation (RAG) can alleviate hallucinations of Large\nLanguage Models (LLMs) by referencing external documents. However, the\nmisinformation in external documents may mislead LLMs' generation. To address\nthis issue, we explore the task of \"credibility-aware RAG\", in which LLMs\nautomatically adjust the influence of retrieved documents based on their\ncredibility scores to counteract misinformation. To this end, we introduce a\nplug-and-play method named $\\textbf{Cr}$edibility-aware $\\textbf{A}$ttention\n$\\textbf{M}$odification (CrAM). CrAM identifies influential attention heads in\nLLMs and adjusts their attention scores based on the credibility of the\ndocuments, thereby reducing the impact of low-credibility documents.\nExperiments on Natual Questions and TriviaQA using Llama2-13B, Llama3-8B, and\nQwen-7B show that CrAM improves the RAG performance of LLMs against\nmisinformation pollution by over 20%, even surpassing supervised fine-tuning\nmethods.", "paper_summary_zh": "檢索增強生成 (RAG) 能透過參照外部文件減輕大型語言模型 (LLM) 的幻覺。然而，外部文件中的錯誤資訊可能會誤導 LLM 的生成。為了解決這個問題，我們探討了「可信度感知 RAG」的任務，其中 LLM 會根據檢索文件的可信度評分自動調整檢索文件的影響力，以對抗錯誤資訊。為此，我們引入了稱為 $\\textbf{Cr}$edibility-aware $\\textbf{A}$ttention $\\textbf{M}$odification (CrAM) 的即插即用方法。CrAM 會找出 LLM 中有影響力的注意力頭部，並根據文件的可信度調整其注意力評分，從而降低低可信度文件的影響。在使用 Llama2-13B、Llama3-8B 和 Qwen-7B 進行的 Natual Questions 和 TriviaQA 實驗中，結果顯示 CrAM 將 LLM 在對抗錯誤資訊污染方面的 RAG 效能提升了 20% 以上，甚至超越了監督微調方法。", "author": "Boyi Deng et.al.", "authors": "Boyi Deng, Wenjie Wang, Fengbin Zhu, Qifan Wang, Fuli Feng", "id": "2406.11497v1", "paper_url": "http://arxiv.org/abs/2406.11497v1", "repo": "null"}}