{"2406.18847": {"publish_time": "2024-06-27", "title": "Learning Retrieval Augmentation for Personalized Dialogue Generation", "paper_summary": "Personalized dialogue generation, focusing on generating highly tailored\nresponses by leveraging persona profiles and dialogue context, has gained\nsignificant attention in conversational AI applications. However, persona\nprofiles, a prevalent setting in current personalized dialogue datasets,\ntypically composed of merely four to five sentences, may not offer\ncomprehensive descriptions of the persona about the agent, posing a challenge\nto generate truly personalized dialogues. To handle this problem, we propose\n$\\textbf{L}$earning Retrieval $\\textbf{A}$ugmentation for\n$\\textbf{P}$ersonalized $\\textbf{D}$ial$\\textbf{O}$gue $\\textbf{G}$eneration\n($\\textbf{LAPDOG}$), which studies the potential of leveraging external\nknowledge for persona dialogue generation. Specifically, the proposed LAPDOG\nmodel consists of a story retriever and a dialogue generator. The story\nretriever uses a given persona profile as queries to retrieve relevant\ninformation from the story document, which serves as a supplementary context to\naugment the persona profile. The dialogue generator utilizes both the dialogue\nhistory and the augmented persona profile to generate personalized responses.\nFor optimization, we adopt a joint training framework that collaboratively\nlearns the story retriever and dialogue generator, where the story retriever is\noptimized towards desired ultimate metrics (e.g., BLEU) to retrieve content for\nthe dialogue generator to generate personalized responses. Experiments\nconducted on the CONVAI2 dataset with ROCStory as a supplementary data source\nshow that the proposed LAPDOG method substantially outperforms the baselines,\nindicating the effectiveness of the proposed method. The LAPDOG model code is\npublicly available for further exploration.\nhttps://github.com/hqsiswiliam/LAPDOG", "paper_summary_zh": "<paragraph>個性化對話生成，專注於透過運用角色檔案和對話脈絡來產生高度客製化的回應，已在對話式 AI 應用程式中獲得顯著的關注。然而，角色檔案是目前個性化對話資料集中普遍的設定，通常僅由四到五個句子組成，可能無法提供關於代理人的角色之全面描述，對產生真正個性化的對話構成挑戰。為了處理這個問題，我們提出 $\\textbf{L}$earning Retrieval $\\textbf{A}$ugmentation for $\\textbf{P}$ersonalized $\\textbf{D}$ial$\\textbf{O}$gue $\\textbf{G}$eneration ($\\textbf{LAPDOG}$)，探討運用外部知識進行角色對話生成的潛力。具體來說，所提出的 LAPDOG 模型包含一個故事檢索器和一個對話產生器。故事檢索器使用給定的角色檔案作為查詢，從故事文件中檢索相關資訊，作為補充脈絡來擴充角色檔案。對話產生器利用對話歷程和擴充的角色檔案來產生個性化的回應。為了最佳化，我們採用一個聯合訓練架構，協同學習故事檢索器和對話產生器，其中故事檢索器針對所需的最終指標（例如 BLEU）進行最佳化，以檢索內容供對話產生器產生個性化的回應。在 CONVAI2 資料集上進行的實驗，以 ROCStory 作為補充資料來源，顯示所提出的 LAPDOG 方法大幅優於基線，表示所提出的方法有效。LAPDOG 模型程式碼已公開，可供進一步探索。\nhttps://github.com/hqsiswiliam/LAPDOG</paragraph>", "author": "Qiushi Huang et.al.", "authors": "Qiushi Huang, Shuai Fu, Xubo Liu, Wenwu Wang, Tom Ko, Yu Zhang, Lilian Tang", "id": "2406.18847v1", "paper_url": "http://arxiv.org/abs/2406.18847v1", "repo": "https://github.com/hqsiswiliam/lapdog"}}