{"2407.21531": {"publish_time": "2024-07-31", "title": "Can LLMs \"Reason\" in Music? An Evaluation of LLMs' Capability of Music Understanding and Generation", "paper_summary": "Symbolic Music, akin to language, can be encoded in discrete symbols. Recent\nresearch has extended the application of large language models (LLMs) such as\nGPT-4 and Llama2 to the symbolic music domain including understanding and\ngeneration. Yet scant research explores the details of how these LLMs perform\non advanced music understanding and conditioned generation, especially from the\nmulti-step reasoning perspective, which is a critical aspect in the\nconditioned, editable, and interactive human-computer co-creation process. This\nstudy conducts a thorough investigation of LLMs' capability and limitations in\nsymbolic music processing. We identify that current LLMs exhibit poor\nperformance in song-level multi-step music reasoning, and typically fail to\nleverage learned music knowledge when addressing complex musical tasks. An\nanalysis of LLMs' responses highlights distinctly their pros and cons. Our\nfindings suggest achieving advanced musical capability is not intrinsically\nobtained by LLMs, and future research should focus more on bridging the gap\nbetween music knowledge and reasoning, to improve the co-creation experience\nfor musicians.", "paper_summary_zh": "符號音樂類似於語言，可以用離散符號編碼。最近的研究將大型語言模型 (LLM)，例如 GPT-4 和 Llama2，的應用擴展到符號音樂領域，包括理解和生成。然而，很少有研究探討這些 LLM 如何執行進階音樂理解和條件生成，特別是從多步驟推理的角度來看，這是條件式、可編輯和互動式人機共同創作過程中的一個關鍵面向。本研究對 LLM 在符號音樂處理中的能力和限制進行了徹底的調查。我們發現，目前的 LLM 在歌曲層級的多步驟音樂推理中表現不佳，並且在處理複雜的音樂任務時通常無法利用所學的音樂知識。對 LLM 回應的分析突出了它們的優缺點。我們的研究結果表明，LLM 本質上並未獲得進階的音樂能力，未來的研究應更專注於彌合音樂知識和推理之間的差距，以改善音樂家的共同創作體驗。", "author": "Ziya Zhou et.al.", "authors": "Ziya Zhou, Yuhang Wu, Zhiyue Wu, Xinyue Zhang, Ruibin Yuan, Yinghao Ma, Lu Wang, Emmanouil Benetos, Wei Xue, Yike Guo", "id": "2407.21531v1", "paper_url": "http://arxiv.org/abs/2407.21531v1", "repo": "null"}}