{"2405.08151": {"publish_time": "2024-05-13", "title": "Benchmarking Retrieval-Augmented Large Language Models in Biomedical NLP: Application, Robustness, and Self-Awareness", "paper_summary": "Large language models (LLM) have demonstrated remarkable capabilities in\nvarious biomedical natural language processing (NLP) tasks, leveraging the\ndemonstration within the input context to adapt to new tasks. However, LLM is\nsensitive to the selection of demonstrations. To address the hallucination\nissue inherent in LLM, retrieval-augmented LLM (RAL) offers a solution by\nretrieving pertinent information from an established database. Nonetheless,\nexisting research work lacks rigorous evaluation of the impact of\nretrieval-augmented large language models on different biomedical NLP tasks.\nThis deficiency makes it challenging to ascertain the capabilities of RAL\nwithin the biomedical domain. Moreover, the outputs from RAL are affected by\nretrieving the unlabeled, counterfactual, or diverse knowledge that is not well\nstudied in the biomedical domain. However, such knowledge is common in the real\nworld. Finally, exploring the self-awareness ability is also crucial for the\nRAL system. So, in this paper, we systematically investigate the impact of RALs\non 5 different biomedical tasks (triple extraction, link prediction,\nclassification, question answering, and natural language inference). We analyze\nthe performance of RALs in four fundamental abilities, including unlabeled\nrobustness, counterfactual robustness, diverse robustness, and negative\nawareness. To this end, we proposed an evaluation framework to assess the RALs'\nperformance on different biomedical NLP tasks and establish four different\ntestbeds based on the aforementioned fundamental abilities. Then, we evaluate 3\nrepresentative LLMs with 3 different retrievers on 5 tasks over 9 datasets.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種生物醫學自然語言處理 (NLP) 任務中展現出非凡的能力，利用輸入內容中的示範來適應新任務。然而，LLM 對示範的選擇很敏感。為了解決 LLM 中固有的幻覺問題，檢索增強 LLM (RAL) 提供了一個解決方案，從既定的資料庫中檢索相關資訊。儘管如此，現有的研究工作缺乏對檢索增強大型語言模型對不同生物醫學 NLP 任務的影響進行嚴格評估。這種缺陷使得難以確定 RAL 在生物醫學領域中的能力。此外，RAL 的輸出受到檢索未標記、反事實或多樣化知識的影響，而這些知識在生物醫學領域中並未得到很好的研究。然而，這種知識在現實世界中很常見。最後，探索自我意識能力對於 RAL 系統來說也至關重要。因此，在本文中，我們系統地研究了 RAL 對 5 個不同生物醫學任務（三元組提取、連結預測、分類、問題回答和自然語言推理）的影響。我們分析了 RAL 在四項基本能力中的表現，包括未標記魯棒性、反事實魯棒性、多樣性魯棒性和負面意識。為此，我們提出了一個評估框架來評估 RAL 在不同生物醫學 NLP 任務上的表現，並根據上述基本能力建立了四個不同的測試平台。然後，我們在 9 個資料集上的 5 個任務中評估了 3 個不同的檢索器和 3 個代表性 LLM。", "author": "Mingchen Li et.al.", "authors": "Mingchen Li, Zaifu Zhan, Han Yang, Yongkang Xiao, Jiatan Huang, Rui Zhang", "id": "2405.08151v1", "paper_url": "http://arxiv.org/abs/2405.08151v1", "repo": "null"}}