{"2405.19793": {"publish_time": "2024-05-30", "title": "PDDLEGO: Iterative Planning in Textual Environments", "paper_summary": "Planning in textual environments have been shown to be a long-standing\nchallenge even for current models. A recent, promising line of work uses LLMs\nto generate a formal representation of the environment that can be solved by a\nsymbolic planner. However, existing methods rely on a fully-observed\nenvironment where all entity states are initially known, so a one-off\nrepresentation can be constructed, leading to a complete plan. In contrast, we\ntackle partially-observed environments where there is initially no sufficient\ninformation to plan for the end-goal. We propose PDDLEGO that iteratively\nconstruct a planning representation that can lead to a partial plan for a given\nsub-goal. By accomplishing the sub-goal, more information is acquired to\naugment the representation, eventually achieving the end-goal. We show that\nplans produced by few-shot PDDLEGO are 43% more efficient than generating plans\nend-to-end on the Coin Collector simulation, with strong performance (98%) on\nthe more complex Cooking World simulation where end-to-end LLMs fail to\ngenerate coherent plans (4%).", "paper_summary_zh": "即使對於當前模型而言，在文字環境中進行規劃已被證明是一項長期的挑戰。最近一條有前景的工作線路使用 LLM 來生成環境的形式化表示，符號規劃器可以解決該表示。然而，現有方法依賴於完全觀察到的環境，其中所有實體狀態最初都是已知的，因此可以構造一次性表示，從而導致一個完整的計畫。相比之下，我們解決部分觀察到的環境，其中最初沒有足夠的資訊來規劃最終目標。我們提出 PDDLEGO，它反覆建構一個規劃表示，該表示可以為給定的子目標產生部分計畫。通過完成子目標，可以獲取更多資訊來擴充表示，最終實現最終目標。我們表明，在 Coin Collector 模擬中，少次 PDDLEGO 產生的計畫比端到端生成計畫的效率高出 43%，在更複雜的 Cooking World 模擬中具有強勁的效能 (98%)，而端到端 LLM 無法產生連貫的計畫 (4%)。", "author": "Li Zhang et.al.", "authors": "Li Zhang, Peter Jansen, Tianyi Zhang, Peter Clark, Chris Callison-Burch, Niket Tandon", "id": "2405.19793v1", "paper_url": "http://arxiv.org/abs/2405.19793v1", "repo": "null"}}