{"2406.09755": {"publish_time": "2024-06-14", "title": "Mix Q-learning for Lane Changing: A Collaborative Decision-Making Method in Multi-Agent Deep Reinforcement Learning", "paper_summary": "Lane-changing decisions, which are crucial for autonomous vehicle path\nplanning, face practical challenges due to rule-based constraints and limited\ndata. Deep reinforcement learning has become a major research focus due to its\nadvantages in data acquisition and interpretability. However, current models\noften overlook collaboration, which affects not only impacts overall traffic\nefficiency but also hinders the vehicle's own normal driving in the long run.\nTo address the aforementioned issue, this paper proposes a method named Mix\nQ-learning for Lane Changing(MQLC) that integrates a hybrid value Q network,\ntaking into account both collective and individual benefits for the greater\ngood. At the collective level, our method coordinates the individual Q and\nglobal Q networks by utilizing global information. This enables agents to\neffectively balance their individual interests with the collective benefit. At\nthe individual level, we integrated a deep learning-based intent recognition\nmodule into our observation and enhanced the decision network. These changes\nprovide agents with richer decision information and more accurate feature\nextraction for improved lane-changing decisions. This strategy enables the\nmulti-agent system to learn and formulate optimal decision-making strategies\neffectively. Our MQLC model, through extensive experimental results,\nimpressively outperforms other state-of-the-art multi-agent decision-making\nmethods, achieving significantly safer and faster lane-changing decisions.", "paper_summary_zh": "車道變換決策對於自動駕駛路徑規劃至關重要，但因基於規則的限制和有限的資料而面臨實際挑戰。深度強化學習由於其在資料獲取和可解釋性的優勢，已成為主要的研究重點。然而，目前的模型常常忽略協作，這不僅影響整體交通效率，也阻礙了車輛本身長期正常的行駛。為了解決上述問題，本文提出了一個名為車道變換混合 Q 學習 (MQLC) 的方法，它整合了一個混合值 Q 網路，同時考慮集體和個人利益以達到更大的利益。在集體層面，我們的模型透過利用全局資訊來協調個別 Q 網路和全局 Q 網路。這使代理人能夠有效地平衡他們的個人利益和集體利益。在個別層面，我們將基於深度學習的意圖識別模組整合到我們的觀察中，並增強了決策網路。這些改變為代理人提供了更豐富的決策資訊，並進行更準確的特徵提取，以改善車道變換決策。此策略使多代理系統能夠有效地學習和制定最佳決策策略。我們的 MQLC 模型透過廣泛的實驗結果，令人印象深刻地優於其他最先進的多代理決策制定方法，實現了顯著更安全、更快速的車道變換決策。", "author": "Xiaojun Bi et.al.", "authors": "Xiaojun Bi, Mingjie He, Yiwen Sun", "id": "2406.09755v1", "paper_url": "http://arxiv.org/abs/2406.09755v1", "repo": "null"}}