{"2409.18548": {"publish_time": "2024-09-27", "title": "Research on Predicting Public Opinion Event Heat Levels Based on Large Language Models", "paper_summary": "In recent years, with the rapid development of large language models, serval\nmodels such as GPT-4o have demonstrated extraordinary capabilities, surpassing\nhuman performance in various language tasks. As a result, many researchers have\nbegun exploring their potential applications in the field of public opinion\nanalysis. This study proposes a novel large-language-models-based method for\npublic opinion event heat level prediction. First, we preprocessed and\nclassified 62,836 Chinese hot event data collected between July 2022 and\nDecember 2023. Then, based on each event's online dissemination heat index, we\nused the MiniBatchKMeans algorithm to automatically cluster the events and\ncategorize them into four heat levels (ranging from low heat to very high\nheat). Next, we randomly selected 250 events from each heat level, totalling\n1,000 events, to build the evaluation dataset. During the evaluation process,\nwe employed various large language models to assess their accuracy in\npredicting event heat levels in two scenarios: without reference cases and with\nsimilar case references. The results showed that GPT-4o and DeepseekV2\nperformed the best in the latter case, achieving prediction accuracies of 41.4%\nand 41.5%, respectively. Although the overall prediction accuracy remains\nrelatively low, it is worth noting that for low-heat (Level 1) events, the\nprediction accuracies of these two models reached 73.6% and 70.4%,\nrespectively. Additionally, the prediction accuracy showed a downward trend\nfrom Level 1 to Level 4, which correlates with the uneven distribution of data\nacross the heat levels in the actual dataset. This suggests that with the more\nrobust dataset, public opinion event heat level prediction based on large\nlanguage models will have significant research potential for the future.", "paper_summary_zh": "<paragraph>近年來，隨著大型語言模型的快速發展，GPT-4o 等模型在各項語言任務中展現出超越人類表現的驚人能力。因此，許多研究者開始探討其在輿情分析領域的應用潛力。本研究提出一個基於大型語言模型的輿情事件熱度預測新方法。首先，我們對 2022 年 7 月至 2023 年 12 月間蒐集到的 62,836 則中文熱門事件資料進行預處理與分類。接著，根據各事件網路傳播熱度指標，利用 MiniBatchKMeans 演算法自動將事件進行分群，並將其歸類為四個熱度等級（從低熱度到極高熱度）。接下來，我們從各熱度等級中隨機選取 250 則事件，共計 1,000 則事件，建立評估資料集。在評估過程中，我們採用各種大型語言模型，在兩種情境下評估其預測事件熱度等級的準確度：無參考案例與有類似案例參考。結果顯示，在後者的情境中，GPT-4o 與 DeepseekV2 的表現最佳，分別達到 41.4% 與 41.5% 的預測準確度。儘管整體預測準確度仍相對較低，但值得注意的是，對於低熱度（等級 1）的事件，這兩個模型的預測準確度分別達到 73.6% 與 70.4%。此外，預測準確度從等級 1 到等級 4 呈現遞減的趨勢，這與實際資料集中各熱度等級資料分佈不均有關。這表示，隨著資料集的更為完備，基於大型語言模型的輿情事件熱度預測將具有顯著的研究潛力。</paragraph>", "author": "Yi Ren et.al.", "authors": "Yi Ren, Tianyi Zhang, Weibin Li, DuoMu Zhou, Chenhao Qin, FangCheng Dong", "id": "2409.18548v1", "paper_url": "http://arxiv.org/abs/2409.18548v1", "repo": "null"}}