{"2406.10100": {"publish_time": "2024-06-14", "title": "SkySenseGPT: A Fine-Grained Instruction Tuning Dataset and Model for Remote Sensing Vision-Language Understanding", "paper_summary": "Remote Sensing Large Multi-Modal Models (RSLMMs) are developing rapidly and\nshowcase significant capabilities in remote sensing imagery (RSI)\ncomprehension. However, due to the limitations of existing datasets, RSLMMs\nhave shortcomings in understanding the rich semantic relations among objects in\ncomplex remote sensing scenes. To unlock RSLMMs' complex comprehension ability,\nwe propose a large-scale instruction tuning dataset FIT-RS, containing\n1,800,851 instruction samples. FIT-RS covers common interpretation tasks and\ninnovatively introduces several complex comprehension tasks of escalating\ndifficulty, ranging from relation reasoning to image-level scene graph\ngeneration. Based on FIT-RS, we build the FIT-RSFG benchmark. Furthermore, we\nestablish a new benchmark to evaluate the fine-grained relation comprehension\ncapabilities of LMMs, named FIT-RSRC. Based on combined instruction data, we\npropose SkySenseGPT, which achieves outstanding performance on both public\ndatasets and FIT-RSFG, surpassing existing RSLMMs. We hope the FIT-RS dataset\ncan enhance the relation comprehension capability of RSLMMs and provide a\nlarge-scale fine-grained data source for the remote sensing community. The\ndataset will be available at https://github.com/Luo-Z13/SkySenseGPT", "paper_summary_zh": "遙感大型多模態模型 (RSLMM) 發展迅速，並在遙感影像 (RSI) 理解方面展現出顯著的能力。然而，由於現有資料集的限制，RSLMM 在理解複雜遙感場景中物件之間豐富的語意關係方面存在不足。為了釋放 RSLMM 的複雜理解能力，我們提出了一個包含 1,800,851 個指令範例的大型指令調整資料集 FIT-RS。FIT-RS 涵蓋常見的解譯任務，並創新地引入了從關係推理到影像級場景圖生成等多個難度遞增的複雜理解任務。基於 FIT-RS，我們建立了 FIT-RSFG 基準。此外，我們建立了一個新的基準來評估 LMM 的細粒度關係理解能力，稱為 FIT-RSRC。基於結合的指令資料，我們提出了 SkySenseGPT，它在公共資料集和 FIT-RSFG 上都取得了傑出的表現，超越了現有的 RSLMM。我們希望 FIT-RS 資料集可以增強 RSLMM 的關係理解能力，並為遙感社群提供一個大規模的細粒度資料來源。該資料集將在 https://github.com/Luo-Z13/SkySenseGPT 上提供", "author": "Junwei Luo et.al.", "authors": "Junwei Luo, Zhen Pang, Yongjun Zhang, Tingzhu Wang, Linlin Wang, Bo Dang, Jiangwei Lao, Jian Wang, Jingdong Chen, Yihua Tan, Yansheng Li", "id": "2406.10100v1", "paper_url": "http://arxiv.org/abs/2406.10100v1", "repo": "https://github.com/luo-z13/skysensegpt"}}