{"2411.04468": {"publish_time": "2024-11-07", "title": "Magentic-One: A Generalist Multi-Agent System for Solving Complex Tasks", "paper_summary": "Modern AI agents, driven by advances in large foundation models, promise to\nenhance our productivity and transform our lives by augmenting our knowledge\nand capabilities. To achieve this vision, AI agents must effectively plan,\nperform multi-step reasoning and actions, respond to novel observations, and\nrecover from errors, to successfully complete complex tasks across a wide range\nof scenarios. In this work, we introduce Magentic-One, a high-performing\nopen-source agentic system for solving such tasks. Magentic-One uses a\nmulti-agent architecture where a lead agent, the Orchestrator, plans, tracks\nprogress, and re-plans to recover from errors. Throughout task execution, the\nOrchestrator directs other specialized agents to perform tasks as needed, such\nas operating a web browser, navigating local files, or writing and executing\nPython code. We show that Magentic-One achieves statistically competitive\nperformance to the state-of-the-art on three diverse and challenging agentic\nbenchmarks: GAIA, AssistantBench, and WebArena. Magentic-One achieves these\nresults without modification to core agent capabilities or to how they\ncollaborate, demonstrating progress towards generalist agentic systems.\nMoreover, Magentic-One's modular design allows agents to be added or removed\nfrom the team without additional prompt tuning or training, easing development\nand making it extensible to future scenarios. We provide an open-source\nimplementation of Magentic-One, and we include AutoGenBench, a standalone tool\nfor agentic evaluation. AutoGenBench provides built-in controls for repetition\nand isolation to run agentic benchmarks in a rigorous and contained manner --\nwhich is important when agents' actions have side-effects. Magentic-One,\nAutoGenBench and detailed empirical performance evaluations of Magentic-One,\nincluding ablations and error analysis are available at\nhttps://aka.ms/magentic-one", "paper_summary_zh": "<paragraph>由大型基础模型的进步推动的现代 AI 代理有望通过增强我们的知识和能力来提高我们的生产力并改变我们的生活。为了实现这一愿景，AI 代理必须有效地规划、执行多步骤推理和动作、响应新颖的观察结果以及从错误中恢复，以成功完成广泛场景中的复杂任务。在这项工作中，我们介绍了 Magentic-One，这是一个用于解决此类任务的高性能开源代理系统。Magentic-One 使用多代理架构，其中一个领导代理（Orchestrator）计划、跟踪进度并重新计划以从错误中恢复。在整个任务执行过程中，Orchestrator 指导其他专门代理根据需要执行任务，例如操作网络浏览器、导航本地文件或编写和执行 Python 代码。我们展示了 Magentic-One 在三个不同且具有挑战性的代理基准测试（GAIA、AssistantBench 和 WebArena）上实现了与最先进技术具有统计竞争力的性能。Magentic-One 在不修改核心代理功能或它们如何协作的情况下实现了这些结果，展示了朝着通才代理系统取得的进展。此外，Magentic-One 的模块化设计允许在不进行额外提示调整或培训的情况下向团队添加或删除代理，从而简化开发并使其可扩展到未来的场景。我们提供了 Magentic-One 的开源实现，并且我们包含了 AutoGenBench，这是一个用于代理评估的独立工具。AutoGenBench 提供了内置的重复和隔离控件，以严格且受控的方式运行代理基准测试——当代理的动作产生副作用时这一点非常重要。Magentic-One、AutoGenBench 和 Magentic-One 的详细经验性能评估（包括消融和错误分析）可在 https://aka.ms/magentic-one 获得</paragraph>", "author": "Adam Fourney et.al.", "authors": "Adam Fourney, Gagan Bansal, Hussein Mozannar, Cheng Tan, Eduardo Salinas, Erkang, Zhu, Friederike Niedtner, Grace Proebsting, Griffin Bassman, Jack Gerrits, Jacob Alber, Peter Chang, Ricky Loynd, Robert West, Victor Dibia, Ahmed Awadallah, Ece Kamar, Rafah Hosn, Saleema Amershi", "id": "2411.04468v1", "paper_url": "http://arxiv.org/abs/2411.04468v1", "repo": "null"}}