{"2501.08566": {"publish_time": "2025-01-15", "title": "Towards Lightweight and Stable Zero-shot TTS with Self-distilled Representation Disentanglement", "paper_summary": "Zero-shot Text-To-Speech (TTS) synthesis shows great promise for personalized\nvoice customization through voice cloning. However, current methods for\nachieving zero-shot TTS heavily rely on large model scales and extensive\ntraining datasets to ensure satisfactory performance and generalizability\nacross various speakers. This raises concerns regarding both deployment costs\nand data security. In this paper, we present a lightweight and stable zero-shot\nTTS system. We introduce a novel TTS architecture designed to effectively model\nlinguistic content and various speaker attributes from source speech and prompt\nspeech, respectively. Furthermore, we present a two-stage self-distillation\nframework that constructs parallel data pairs for effectively disentangling\nlinguistic content and speakers from the perspective of training data.\nExtensive experiments show that our system exhibits excellent performance and\nsuperior stability on the zero-shot TTS tasks. Moreover, it shows markedly\nsuperior computational efficiency, with RTFs of 0.13 and 0.012 on the CPU and\nGPU, respectively.", "paper_summary_zh": "零樣本文字轉語音 (TTS) 合成在透過語音複製技術進行個性化語音自訂方面展現出極佳的潛力。然而，目前達成零樣本 TTS 的方法極度依賴大型模型規模和廣泛的訓練資料集，以確保在各種說話者之間有令人滿意的效能和概括性。這引發了對部署成本和資料安全的疑慮。在本文中，我們提出一個輕量且穩定的零樣本 TTS 系統。我們推出一種創新的 TTS 架構，旨在有效地建構語言內容和各種說話者屬性，分別來自原始語音和提示語音。此外，我們提出一個兩階段的自蒸餾架構，用於建構平行資料對，以有效地從訓練資料的角度解開語言內容和說話者。廣泛的實驗顯示，我們的系統在零樣本 TTS 任務中展現出極佳的效能和優異的穩定性。此外，它展現出顯著優異的運算效率，在 CPU 和 GPU 上的 RTF 分別為 0.13 和 0.012。", "author": "Qianniu Chen et.al.", "authors": "Qianniu Chen, Xiaoyang Hao, Bowen Li, Yue Liu, Li Lu", "id": "2501.08566v1", "paper_url": "http://arxiv.org/abs/2501.08566v1", "repo": "null"}}