{"2410.04717": {"publish_time": "2024-10-07", "title": "$\\textbf{Only-IF}$:Revealing the Decisive Effect of Instruction Diversity on Generalization", "paper_summary": "Understanding and accurately following instructions is critical for large\nlanguage models (LLMs) to be effective across diverse tasks. In this work, we\nrigorously examine the key factors that enable models to generalize to unseen\ninstructions, providing insights to guide the collection of data for\ninstruction-tuning. Through controlled experiments, inspired by the\nTuring-complete Markov algorithm, we demonstrate that such generalization\n$\\textbf{only emerges}$ when training data is diversified enough across\nsemantic domains. Our findings also reveal that merely diversifying within\nlimited domains fails to ensure robust generalization. In contrast,\ncross-domain data diversification, even under constrained data budgets,\nsignificantly enhances a model's adaptability. We further extend our analysis\nto real-world scenarios, including fine-tuning of\n$\\textit{$\\textbf{specialist}$}$ and $\\textit{$\\textbf{generalist}$}$ models.\nIn both cases, we demonstrate that 1) better performance can be achieved by\nincreasing the diversity of an established dataset while keeping the data size\nconstant, and 2) when scaling up the data, diversifying the semantics of\ninstructions is more effective than simply increasing the quantity of similar\ndata. Our research provides important insights for dataset collation,\nparticularly when optimizing model performance by expanding training data for\nboth specialist and generalist scenarios. We show that careful consideration of\ndata diversification is key: training specialist models with data extending\nbeyond their core domain leads to significant performance improvements, while\ngeneralist models benefit from diverse data mixtures that enhance their overall\ninstruction-following capabilities across a wide range of applications. Our\nresults highlight the critical role of strategic diversification and offer\nclear guidelines for improving data quality.", "paper_summary_zh": "<paragraph>對於大型語言模型 (LLM) 來說，理解並準確遵循指令對於在各種任務中發揮作用至關重要。在這項工作中，我們嚴謹地探討了使模型能夠概括到未見過指令的主要因素，並提供見解以指導收集資料以進行指令微調。透過受圖靈完備馬可夫演算法啟發的受控實驗，我們證明了這種概括僅在訓練資料在語義領域中足夠多元化時才會出現。我們的研究結果還表明，僅在有限的領域內進行多樣化並不能確保穩健的概括。相反，即使在受限的資料預算下，跨領域資料多樣化也能顯著增強模型的適應性。我們進一步將分析擴展到真實世界的場景，包括微調專家和通才模型。在兩種情況下，我們都證明了 1) 透過增加既有資料集的多樣性，同時保持資料大小不變，可以獲得更好的效能，以及 2) 在擴充資料時，多樣化指令的語義比僅增加類似資料的數量更有效。我們的研究為資料集整理提供了重要的見解，特別是在透過擴充專家和通才場景的訓練資料來最佳化模型效能時。我們表明仔細考量資料多樣化是關鍵：使用擴充到其核心領域以外的資料來訓練專家模型，會帶來顯著的效能提升，而通才模型則受益於多樣化的資料組合，這些組合會增強其在廣泛應用中的整體指令遵循能力。我們的結果突出了策略性多樣化的關鍵作用，並提供了改善資料品質的明確準則。</paragraph>", "author": "Dylan Zhang et.al.", "authors": "Dylan Zhang, Justin Wang, Francois Charton", "id": "2410.04717v3", "paper_url": "http://arxiv.org/abs/2410.04717v3", "repo": "null"}}