{"2407.17695": {"publish_time": "2024-07-25", "title": "Enhancing Agent Learning through World Dynamics Modeling", "paper_summary": "While large language models (LLMs) have been increasingly deployed across\ntasks in language understanding and interactive decision-making, their\nimpressive performance is largely due to the comprehensive and in-depth domain\nknowledge embedded within them. However, the extent of this knowledge can vary\nacross different domains. Existing methods often assume that LLMs already\npossess such comprehensive and in-depth knowledge of their environment,\noverlooking potential gaps in their understanding of actual world dynamics. To\naddress this gap, we introduce Discover, Verify, and Evolve (DiVE), a framework\nthat discovers world dynamics from a small number of demonstrations, verifies\nthe correctness of these dynamics, and evolves new, advanced dynamics tailored\nto the current situation. Through extensive evaluations, we analyze the impact\nof each component on performance and compare the automatically generated\ndynamics from DiVE with human-annotated world dynamics. Our results demonstrate\nthat LLMs guided by DiVE can make better decisions, achieving rewards\ncomparable to human players in the Crafter environment.", "paper_summary_zh": "儘管大型語言模型 (LLM) 已在語言理解和互動決策制定等任務中得到越來越廣泛的部署，但它們令人印象深刻的表現很大程度上歸功於內嵌在其中的全面且深入的領域知識。然而，這種知識的程度在不同的領域中可能有所不同。現有方法通常假設 LLM 已具備對其環境的全面且深入的了解，忽視了它們對實際世界動態理解中的潛在差距。為了解決這個差距，我們引入了探索、驗證和演化 (DiVE)，這是一個框架，它從少數示範中探索世界動態，驗證這些動態的正確性，並演化出新的、先進的動態，這些動態專門針對當前情況。透過廣泛的評估，我們分析了每個組成部分對效能的影響，並將 DiVE 自動產生的動態與人工標註的世界動態進行比較。我們的結果表明，由 DiVE 指導的 LLM 可以做出更好的決策，在 Crafter 環境中獲得與人類玩家相當的獎勵。", "author": "Zhiyuan Sun et.al.", "authors": "Zhiyuan Sun, Haochen Shi, Marc-Alexandre Côté, Glen Berseth, Xingdi Yuan, Bang Liu", "id": "2407.17695v1", "paper_url": "http://arxiv.org/abs/2407.17695v1", "repo": "null"}}