{"2411.16646": {"publish_time": "2024-11-25", "title": "Self-Generated Critiques Boost Reward Modeling for Language Models", "paper_summary": "Reward modeling is crucial for aligning large language models (LLMs) with\nhuman preferences, especially in reinforcement learning from human feedback\n(RLHF). However, current reward models mainly produce scalar scores and\nstruggle to incorporate critiques in a natural language format. We hypothesize\nthat predicting both critiques and the scalar reward would improve reward\nmodeling ability. Motivated by this, we propose Critic-RM, a framework that\nimproves reward models using self-generated critiques without extra\nsupervision. Critic-RM employs a two-stage process: generating and filtering\nhigh-quality critiques, followed by joint fine-tuning on reward prediction and\ncritique generation. Experiments across benchmarks show that Critic-RM improves\nreward modeling accuracy by 3.7%-7.3% compared to standard reward models and\nLLM judges, demonstrating strong performance and data efficiency. Additional\nstudies further validate the effectiveness of generated critiques in rectifying\nflawed reasoning steps with 2.5%-3.2% gains in improving reasoning accuracy.", "paper_summary_zh": "獎勵建模對於將大型語言模型 (LLM) 與人類偏好保持一致至關重要，特別是在人類回饋的強化學習 (RLHF) 中。然而，目前的獎勵模型主要產生標量分數，並且難以以自然語言格式納入批評。我們假設預測批評和標量獎勵都會提高獎勵建模能力。基於此，我們提出了 Critic-RM，這是一個利用自我生成的批評來改進獎勵模型的框架，而無需額外的監督。Critic-RM 採用兩階段流程：生成和過濾高品質的批評，然後在獎勵預測和批評生成上進行聯合微調。基準測試的實驗表明，與標準獎勵模型和 LLM 評審相比，Critic-RM 將獎勵建模準確度提高了 3.7%-7.3%，展示了強大的性能和數據效率。進一步的研究進一步驗證了生成的批評在糾正有缺陷的推理步驟中的有效性，推理準確度提高了 2.5%-3.2%。", "author": "Yue Yu et.al.", "authors": "Yue Yu, Zhengxing Chen, Aston Zhang, Liang Tan, Chenguang Zhu, Richard Yuanzhe Pang, Yundi Qian, Xuewei Wang, Suchin Gururangan, Chao Zhang, Melanie Kambadur, Dhruv Mahajan, Rui Hou", "id": "2411.16646v1", "paper_url": "http://arxiv.org/abs/2411.16646v1", "repo": "null"}}