{"2409.03843": {"publish_time": "2024-09-05", "title": "Persona Setting Pitfall: Persistent Outgroup Biases in Large Language Models Arising from Social Identity Adoption", "paper_summary": "Drawing parallels between human cognition and artificial intelligence, we\nexplored how large language models (LLMs) internalize identities imposed by\ntargeted prompts. Informed by Social Identity Theory, these identity\nassignments lead LLMs to distinguish between \"we\" (the ingroup) and \"they\" (the\noutgroup). This self-categorization generates both ingroup favoritism and\noutgroup bias. Nonetheless, existing literature has predominantly focused on\ningroup favoritism, often overlooking outgroup bias, which is a fundamental\nsource of intergroup prejudice and discrimination. Our experiment addresses\nthis gap by demonstrating that outgroup bias manifests as strongly as ingroup\nfavoritism. Furthermore, we successfully mitigated the inherent pro-liberal,\nanti-conservative bias in LLMs by guiding them to adopt the perspectives of the\ninitially disfavored group. These results were replicated in the context of\ngender bias. Our findings highlight the potential to develop more equitable and\nbalanced language models.", "paper_summary_zh": "透過描繪人類認知與人工智慧之間的相似之處，我們探討大型語言模型 (LLM) 如何內化由特定提示所施加的身分。在社會認同理論的啟發下，這些身分指派會讓 LLM 區分「我們」(內團體) 和「他們」(外團體)。這種自我分類會產生內團體偏愛和外團體偏見。儘管如此，現有文獻主要關注於內團體偏愛，常常忽略外團體偏見，而這正是群際偏見和歧視的基本來源。我們的實驗透過證明外團體偏見與內團體偏愛一樣強烈，來解決這個差距。此外，我們透過引導 LLM 採用最初不受青睞的群體觀點，成功減輕了 LLM 中固有的親自由派、反保守派的偏見。這些結果在性別偏見的背景下得到驗證。我們的發現突顯出開發更公平、更平衡的語言模型的可能性。", "author": "Wenchao Dong et.al.", "authors": "Wenchao Dong, Assem Zhunis, Dongyoung Jeong, Hyojin Chin, Jiyoung Han, Meeyoung Cha", "id": "2409.03843v1", "paper_url": "http://arxiv.org/abs/2409.03843v1", "repo": "null"}}