{"2405.18272": {"publish_time": "2024-05-28", "title": "Metaheuristics and Large Language Models Join Forces: Towards an Integrated Optimization Approach", "paper_summary": "Since the rise of Large Language Models (LLMs) a couple of years ago,\nresearchers in metaheuristics (MHs) have wondered how to use their power in a\nbeneficial way within their algorithms. This paper introduces a novel approach\nthat leverages LLMs as pattern recognition tools to improve MHs. The resulting\nhybrid method, tested in the context of a social network-based combinatorial\noptimization problem, outperforms existing state-of-the-art approaches that\ncombine machine learning with MHs regarding the obtained solution quality. By\ncarefully designing prompts, we demonstrate that the output obtained from LLMs\ncan be used as problem knowledge, leading to improved results. Lastly, we\nacknowledge LLMs' potential drawbacks and limitations and consider it essential\nto examine them to advance this type of research further.", "paper_summary_zh": "隨著大型語言模型（LLM）在幾年前興起，元啟發式（MH）的研究人員開始思考如何在其演算法中善用其力量。本文介紹一種新穎的方法，將 LLM 作為模式辨識工具來提升 MH。這種混合方法在基於社群網路的組合最佳化問題中進行測試，其效能優於現有的結合機器學習與 MH 的最先進方法，在取得的解的品質方面。透過仔細設計提示，我們證明從 LLM 取得的輸出可用作問題知識，進而改善結果。最後，我們承認 LLM 的潛在缺點和限制，並認為審查這些缺點和限制對於進一步推進這類研究至關重要。", "author": "Camilo Chacón Sartori et.al.", "authors": "Camilo Chacón Sartori, Christian Blum, Filippo Bistaffa, Guillem Rodríguez Corominas", "id": "2405.18272v1", "paper_url": "http://arxiv.org/abs/2405.18272v1", "repo": "https://github.com/camilochs/metaheuristics-llms"}}