{"2501.05606": {"publish_time": "2025-01-09", "title": "Harmonizing Metadata of Language Resources for Enhanced Querying and Accessibility", "paper_summary": "This paper addresses the harmonization of metadata from diverse repositories\nof language resources (LRs). Leveraging linked data and RDF techniques, we\nintegrate data from multiple sources into a unified model based on DCAT and\nMETA-SHARE OWL ontology. Our methodology supports text-based search, faceted\nbrowsing, and advanced SPARQL queries through Linghub, a newly developed\nportal. Real user queries from the Corpora Mailing List (CML) were evaluated to\nassess Linghub capability to satisfy actual user needs. Results indicate that\nwhile some limitations persist, many user requests can be successfully\naddressed. The study highlights significant metadata issues and advocates for\nadherence to open vocabularies and standards to enhance metadata harmonization.\nThis initial research underscores the importance of API-based access to LRs,\npromoting machine usability and data subset extraction for specific purposes,\npaving the way for more efficient and standardized LR utilization.", "paper_summary_zh": "本論文探討來自不同語言資源 (LRs) 儲存庫的元資料調和。我們利用連結資料和 RDF 技術，將來自多個來源的資料整合到一個統一的模型中，該模型基於 DCAT 和 META-SHARE OWL ontology。我們的 methodology 支援透過 Linghub（一個新開發的入口網站）進行基於文字的搜尋、分面瀏覽和進階 SPARQL 查詢。我們評估了來自 Corpora Mailing List (CML) 的真實使用者查詢，以評估 Linghub 滿足實際使用者需求的能力。結果顯示，雖然仍存在一些限制，但許多使用者要求都能獲得成功的處理。本研究突顯了重要的元資料問題，並倡導遵循開放詞彙和標準，以增強元資料調和。這項初步研究強調了基於 API 存取 LR 的重要性，促進機器可用性和資料子集萃取以達成特定目的，為更有效率和標準化的 LR 使用鋪路。", "author": "Zixuan Liang et.al.", "authors": "Zixuan Liang", "id": "2501.05606v1", "paper_url": "http://arxiv.org/abs/2501.05606v1", "repo": "null"}}