{"2408.03400": {"publish_time": "2024-08-06", "title": "Attacks and Defenses for Generative Diffusion Models: A Comprehensive Survey", "paper_summary": "Diffusion models (DMs) have achieved state-of-the-art performance on various\ngenerative tasks such as image synthesis, text-to-image, and text-guided\nimage-to-image generation. However, the more powerful the DMs, the more harmful\nthey potentially are. Recent studies have shown that DMs are prone to a wide\nrange of attacks, including adversarial attacks, membership inference, backdoor\ninjection, and various multi-modal threats. Since numerous pre-trained DMs are\npublished widely on the Internet, potential threats from these attacks are\nespecially detrimental to the society, making DM-related security a worth\ninvestigating topic. Therefore, in this paper, we conduct a comprehensive\nsurvey on the security aspect of DMs, focusing on various attack and defense\nmethods for DMs. First, we present crucial knowledge of DMs with five main\ntypes of DMs, including denoising diffusion probabilistic models, denoising\ndiffusion implicit models, noise conditioned score networks, stochastic\ndifferential equations, and multi-modal conditional DMs. We further survey a\nvariety of recent studies investigating different types of attacks that exploit\nthe vulnerabilities of DMs. Then, we thoroughly review potential\ncountermeasures to mitigate each of the presented threats. Finally, we discuss\nopen challenges of DM-related security and envision certain research directions\nfor this topic.", "paper_summary_zh": "擴散模型 (DM) 在各種生成任務上達到了最先進的性能，例如影像合成、文字轉影像和文字引導影像轉影像生成。然而，DM 越強大，潛在的危害就越大。最近的研究表明，DM 容易受到廣泛的攻擊，包括對抗性攻擊、成員推論、後門注入和各種多模式威脅。由於許多預先訓練的 DM 廣泛發布在網路上，這些攻擊的潛在威脅特別有害於社會，使得與 DM 相關的安全性成為一個值得探討的主題。因此，在本文中，我們對 DM 的安全性方面進行了全面的調查，重點關注 DM 的各種攻擊和防禦方法。首先，我們介紹了 DM 的關鍵知識，包括五種類型的 DM，包括去噪擴散機率模型、去噪擴散隱式模型、雜訊條件分數網路、隨機微分方程式和多模式條件 DM。我們進一步調查了各種最近的研究，探討了利用 DM 漏洞的不同類型的攻擊。然後，我們徹底檢視了減輕每種呈現威脅的潛在對策。最後，我們討論了與 DM 相關的安全性的公開挑戰，並預想這個主題的某些研究方向。", "author": "Vu Tuan Truong et.al.", "authors": "Vu Tuan Truong, Luan Ba Dang, Long Bao Le", "id": "2408.03400v1", "paper_url": "http://arxiv.org/abs/2408.03400v1", "repo": "null"}}