{"2405.15307": {"publish_time": "2024-05-24", "title": "Before Generation, Align it! A Novel and Effective Strategy for Mitigating Hallucinations in Text-to-SQL Generation", "paper_summary": "Large Language Models (LLMs) driven by In-Context Learning (ICL) have\nsignificantly improved the performance of text-to-SQL. Previous methods\ngenerally employ a two-stage reasoning framework, namely 1) schema linking and\n2) logical synthesis, making the framework not only effective but also\ninterpretable. Despite these advancements, the inherent bad nature of the\ngeneralization of LLMs often results in hallucinations, which limits the full\npotential of LLMs. In this work, we first identify and categorize the common\ntypes of hallucinations at each stage in text-to-SQL. We then introduce a novel\nstrategy, Task Alignment (TA), designed to mitigate hallucinations at each\nstage. TA encourages LLMs to take advantage of experiences from similar tasks\nrather than starting the tasks from scratch. This can help LLMs reduce the\nburden of generalization, thereby mitigating hallucinations effectively. We\nfurther propose TA-SQL, a text-to-SQL framework based on this strategy. The\nexperimental results and comprehensive analysis demonstrate the effectiveness\nand robustness of our framework. Specifically, it enhances the performance of\nthe GPT-4 baseline by 21.23% relatively on BIRD dev and it yields significant\nimprovements across six models and four mainstream, complex text-to-SQL\nbenchmarks.", "paper_summary_zh": "<paragraph>由情境學習 (ICL) 驅動的大型語言模型 (LLM) 已顯著改善文字轉 SQL 的效能。先前的做法通常採用兩階段推理架構，即 1) 架構連結和 2) 邏輯綜合，使架構不僅有效，而且可詮釋。儘管有這些進展，LLM 廣泛化固有的不良性質通常會導致幻覺，這限制了 LLM 的全部潛力。在這項工作中，我們首先識別並分類文字轉 SQL 各個階段常見的幻覺類型。然後，我們引入一種新策略，任務對齊 (TA)，旨在減輕每個階段的幻覺。TA 鼓勵 LLM 利用類似任務的經驗，而不是從頭開始執行任務。這有助於 LLM 減輕廣泛化的負擔，從而有效減輕幻覺。我們進一步提出基於此策略的文字轉 SQL 框架 TA-SQL。實驗結果和綜合分析證明了我們框架的有效性和穩健性。具體來說，它將 GPT-4 基準在 BIRD dev 上的效能提高了 21.23%，並且在六個模型和四個主流、複雜的文字轉 SQL 基準上產生了顯著的改善。</paragraph>", "author": "Ge Qu et.al.", "authors": "Ge Qu, Jinyang Li, Bowen Li, Bowen Qin, Nan Huo, Chenhao Ma, Reynold Cheng", "id": "2405.15307v1", "paper_url": "http://arxiv.org/abs/2405.15307v1", "repo": "null"}}