{"2407.13168": {"publish_time": "2024-07-18", "title": "SciCode: A Research Coding Benchmark Curated by Scientists", "paper_summary": "Since language models (LMs) now outperform average humans on many challenging\ntasks, it has become increasingly difficult to develop challenging,\nhigh-quality, and realistic evaluations. We address this issue by examining\nLMs' capabilities to generate code for solving real scientific research\nproblems. Incorporating input from scientists and AI researchers in 16 diverse\nnatural science sub-fields, including mathematics, physics, chemistry, biology,\nand materials science, we created a scientist-curated coding benchmark,\nSciCode. The problems in SciCode naturally factorize into multiple subproblems,\neach involving knowledge recall, reasoning, and code synthesis. In total,\nSciCode contains 338 subproblems decomposed from 80 challenging main problems.\nIt offers optional descriptions specifying useful scientific background\ninformation and scientist-annotated gold-standard solutions and test cases for\nevaluation. Claude3.5-Sonnet, the best-performing model among those tested, can\nsolve only 4.6% of the problems in the most realistic setting. We believe that\nSciCode demonstrates both contemporary LMs' progress towards becoming helpful\nscientific assistants and sheds light on the development and evaluation of\nscientific AI in the future.", "paper_summary_zh": "由於語言模型 (LM) 現在在許多具有挑戰性的任務上都優於一般人類，因此要開發具有挑戰性、高品質且實際的評量變得越來越困難。我們透過檢視 LM 產生程式碼以解決實際科學研究問題的能力來解決這個問題。我們納入 16 個不同的自然科學子領域（包括數學、物理、化學、生物和材料科學）的科學家和 AI 研究人員的意見，創建了一個由科學家策劃的程式碼基準 SciCode。SciCode 中的問題自然會分解成多個子問題，每個子問題都涉及知識回溯、推理和程式碼合成。總而言之，SciCode 包含從 80 個具有挑戰性的主要問題分解而來的 338 個子問題。它提供可選擇的說明，說明有用的科學背景資訊和科學家註解的黃金標準解決方案和測試案例以供評量。在測試的模型中表現最佳的 Claude3.5-Sonnet，只能在最實際的設定中解決 4.6% 的問題。我們相信 SciCode 證明了當代 LM 朝著成為有用的科學助理邁進的進展，並為未來科學 AI 的開發和評量帶來曙光。", "author": "Minyang Tian et.al.", "authors": "Minyang Tian, Luyu Gao, Shizhuo Dylan Zhang, Xinan Chen, Cunwei Fan, Xuefei Guo, Roland Haas, Pan Ji, Kittithat Krongchon, Yao Li, Shengyan Liu, Di Luo, Yutao Ma, Hao Tong, Kha Trinh, Chenyu Tian, Zihan Wang, Bohao Wu, Yanyu Xiong, Shengzhu Yin, Minhui Zhu, Kilian Lieret, Yanxin Lu, Genglin Liu, Yufeng Du, Tianhua Tao, Ofir Press, Jamie Callan, Eliu Huerta, Hao Peng", "id": "2407.13168v1", "paper_url": "http://arxiv.org/abs/2407.13168v1", "repo": "null"}}