{"2409.16235": {"publish_time": "2024-09-24", "title": "EuroLLM: Multilingual Language Models for Europe", "paper_summary": "The quality of open-weight LLMs has seen significant improvement, yet they\nremain predominantly focused on English. In this paper, we introduce the\nEuroLLM project, aimed at developing a suite of open-weight multilingual LLMs\ncapable of understanding and generating text in all official European Union\nlanguages, as well as several additional relevant languages. We outline the\nprogress made to date, detailing our data collection and filtering process, the\ndevelopment of scaling laws, the creation of our multilingual tokenizer, and\nthe data mix and modeling configurations. Additionally, we release our initial\nmodels: EuroLLM-1.7B and EuroLLM-1.7B-Instruct and report their performance on\nmultilingual general benchmarks and machine translation.", "paper_summary_zh": "開放權重 LLM 的品質已大幅提升，但它們仍主要針對英語。在本文中，我們介紹 EuroLLM 計畫，其目標是開發一套開放權重多語言 LLM，能夠理解並產生所有歐盟官方語言以及其他數種相關語言的文字。我們概述至今的進度，詳細說明我們的資料收集和篩選程序、縮放定律的發展、多語言分詞器的建立，以及資料組合和建模設定。此外，我們發布我們的初始模型：EuroLLM-1.7B 和 EuroLLM-1.7B-Instruct，並報告它們在多語言一般基準和機器翻譯上的表現。", "author": "Pedro Henrique Martins et.al.", "authors": "Pedro Henrique Martins, Patrick Fernandes, João Alves, Nuno M. Guerreiro, Ricardo Rei, Duarte M. Alves, José Pombal, Amin Farajian, Manuel Faysse, Mateusz Klimaszewski, Pierre Colombo, Barry Haddow, José G. C. de Souza, Alexandra Birch, André F. T. Martins", "id": "2409.16235v1", "paper_url": "http://arxiv.org/abs/2409.16235v1", "repo": "null"}}