{"2409.08805": {"publish_time": "2024-09-13", "title": "Exploring SSL Discrete Tokens for Multilingual ASR", "paper_summary": "With the advancement of Self-supervised Learning (SSL) in speech-related\ntasks, there has been growing interest in utilizing discrete tokens generated\nby SSL for automatic speech recognition (ASR), as they offer faster processing\ntechniques. However, previous studies primarily focused on multilingual ASR\nwith Fbank features or English ASR with discrete tokens, leaving a gap in\nadapting discrete tokens for multilingual ASR scenarios. This study presents a\ncomprehensive comparison of discrete tokens generated by various leading SSL\nmodels across multiple language domains. We aim to explore the performance and\nefficiency of speech discrete tokens across multiple language domains for both\nmonolingual and multilingual ASR scenarios. Experimental results demonstrate\nthat discrete tokens achieve comparable results against systems trained on\nFbank features in ASR tasks across seven language domains with an average word\nerror rate (WER) reduction of 0.31% and 1.76% absolute (2.80% and 15.70%\nrelative) on dev and test sets respectively, with particularly WER reduction of\n6.82% absolute (41.48% relative) on the Polish test set.", "paper_summary_zh": "隨著自監督學習 (SSL) 在語音相關任務中的進展，利用 SSL 產生的離散符號進行自動語音辨識 (ASR) 的興趣不斷增加，因為它們提供了更快的處理技術。然而，先前的研究主要集中在使用 Fbank 特徵的多語言 ASR 或使用離散符號的英文 ASR，在將離散符號適應到多語言 ASR 場景方面仍有差距。本研究對各種領先 SSL 模型在多個語言領域產生的離散符號進行了全面的比較。我們的目標是探討離散語音符號在多個語言領域中單語和多語 ASR 場景下的性能和效率。實驗結果表明，離散符號在七個語言領域的 ASR 任務中達到了與在 Fbank 特徵上訓練的系統相當的結果，在開發和測試集上分別將平均字元錯誤率 (WER) 降低了 0.31% 和 1.76% 絕對值（2.80% 和 15.70% 相對值），特別是在波蘭語測試集上將 WER 降低了 6.82% 絕對值（41.48% 相對值）。", "author": "Mingyu Cui et.al.", "authors": "Mingyu Cui, Daxin Tan, Yifan Yang, Dingdong Wang, Huimeng Wang, Xiao Chen, Xie Chen, Xunying Liu", "id": "2409.08805v1", "paper_url": "http://arxiv.org/abs/2409.08805v1", "repo": "null"}}