{"2406.02368": {"publish_time": "2024-06-04", "title": "Large Language Models Make Sample-Efficient Recommender Systems", "paper_summary": "Large language models (LLMs) have achieved remarkable progress in the field\nof natural language processing (NLP), demonstrating remarkable abilities in\nproducing text that resembles human language for various tasks. This opens up\nnew opportunities for employing them in recommender systems (RSs). In this\npaper, we specifically examine the sample efficiency of LLM-enhanced\nrecommender systems, which pertains to the model's capacity to attain superior\nperformance with a limited quantity of training data. Conventional\nrecommendation models (CRMs) often need a large amount of training data because\nof the sparsity of features and interactions. Hence, we propose and verify our\ncore viewpoint: Large Language Models Make Sample-Efficient Recommender\nSystems. We propose a simple yet effective framework (i.e., Laser) to validate\nthe viewpoint from two aspects: (1) LLMs themselves are sample-efficient\nrecommenders; and (2) LLMs, as feature generators and encoders, make CRMs more\nsample-efficient. Extensive experiments on two public datasets show that Laser\nrequires only a small fraction of training samples to match or even surpass\nCRMs that are trained on the entire training set, demonstrating superior sample\nefficiency.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言處理 (NLP) 領域取得了顯著進展，在為各種任務產生類似人類語言的文字方面展現了非凡的能力。這為將它們應用於推薦系統 (RS) 開闢了新的機會。在本文中，我們特別探討了 LLM 增強推薦系統的範例效率，這與模型在有限訓練資料量下獲得卓越效能的能力有關。傳統推薦模型 (CRM) 通常需要大量的訓練資料，因為特徵和互動的稀疏性。因此，我們提出並驗證了我們的核心觀點：大型語言模型讓範例高效的推薦系統成為可能。我們提出了一個簡單但有效的架構 (即 Laser)，從兩個方面驗證觀點：(1) LLM 本身就是範例高效的推薦系統；(2) LLM 作為特徵生成器和編碼器，讓 CRM 變得更範例高效。在兩個公開資料集上的廣泛實驗顯示，Laser 只需要一小部分訓練範例就能與在整個訓練集上訓練的 CRM 相匹配，甚至超越它們，展現出優越的範例效率。", "author": "Jianghao Lin et.al.", "authors": "Jianghao Lin, Xinyi Dai, Rong Shan, Bo Chen, Ruiming Tang, Yong Yu, Weinan Zhang", "id": "2406.02368v1", "paper_url": "http://arxiv.org/abs/2406.02368v1", "repo": "null"}}