{"2405.04311": {"publish_time": "2024-05-07", "title": "Cross-IQA: Unsupervised Learning for Image Quality Assessment", "paper_summary": "Automatic perception of image quality is a challenging problem that impacts\nbillions of Internet and social media users daily. To advance research in this\nfield, we propose a no-reference image quality assessment (NR-IQA) method\ntermed Cross-IQA based on vision transformer(ViT) model. The proposed Cross-IQA\nmethod can learn image quality features from unlabeled image data. We construct\nthe pretext task of synthesized image reconstruction to unsupervised extract\nthe image quality information based ViT block. The pretrained encoder of\nCross-IQA is used to fine-tune a linear regression model for score prediction.\nExperimental results show that Cross-IQA can achieve state-of-the-art\nperformance in assessing the low-frequency degradation information (e.g., color\nchange, blurring, etc.) of images compared with the classical full-reference\nIQA and NR-IQA under the same datasets.", "paper_summary_zh": "影像品質的自動感知是一項具有挑戰性的問題，它每天都會影響數十億的網際網路和社群媒體使用者。為了推進此領域的研究，我們提出了一種基於視覺轉換器 (ViT) 模型的無參考影像品質評估 (NR-IQA) 方法，稱為 Cross-IQA。所提出的 Cross-IQA 方法可以從未標籤的影像資料中學習影像品質特徵。我們建構了合成影像重建的預設任務，以非監督的方式根據 ViT 區塊萃取影像品質資訊。Cross-IQA 的預訓練編碼器用於微調線性回歸模型以進行分數預測。實驗結果顯示，與在相同資料集下的傳統全參考 IQA 和 NR-IQA 相比，Cross-IQA 可以達成評估影像低頻劣化資訊（例如，色彩變化、模糊等）的最新技術效能。", "author": "Zhen Zhang et.al.", "authors": "Zhen Zhang", "id": "2405.04311v1", "paper_url": "http://arxiv.org/abs/2405.04311v1", "repo": "null"}}