{"2502.13124": {"publish_time": "2025-02-18", "title": "NaturalReasoning: Reasoning in the Wild with 2.8M Challenging Questions", "paper_summary": "Scaling reasoning capabilities beyond traditional domains such as math and\ncoding is hindered by the lack of diverse and high-quality questions. To\novercome this limitation, we introduce a scalable approach for generating\ndiverse and challenging reasoning questions, accompanied by reference answers.\nWe present NaturalReasoning, a comprehensive dataset comprising 2.8 million\nquestions that span multiple domains, including STEM fields (e.g., Physics,\nComputer Science), Economics, Social Sciences, and more. We demonstrate the\nutility of the questions in NaturalReasoning through knowledge distillation\nexperiments which show that NaturalReasoning can effectively elicit and\ntransfer reasoning capabilities from a strong teacher model. Furthermore, we\ndemonstrate that NaturalReasoning is also effective for unsupervised\nself-training using external reward models or self-rewarding.", "paper_summary_zh": "透過超越傳統領域（例如數學和編碼）來擴充推理能力，受到缺乏多元且高品質問題的阻礙。為了克服這個限制，我們引入一個可擴充的方法，用於產生多元且具挑戰性的推理問題，並附上參考答案。我們提出 NaturalReasoning，這是一個包含 280 萬個問題的綜合資料集，涵蓋多個領域，包括 STEM 領域（例如物理、電腦科學）、經濟學、社會科學等等。我們透過知識蒸餾實驗，展示 NaturalReasoning 中問題的實用性，這些實驗顯示 NaturalReasoning 能有效地引發和轉移強大教師模型的推理能力。此外，我們展示 NaturalReasoning 也適用於使用外部獎勵模型或自我獎勵的無監督自我訓練。", "author": "Weizhe Yuan et.al.", "authors": "Weizhe Yuan, Jane Yu, Song Jiang, Karthik Padthe, Yang Li, Dong Wang, Ilia Kulikov, Kyunghyun Cho, Yuandong Tian, Jason E Weston, Xian Li", "id": "2502.13124v1", "paper_url": "http://arxiv.org/abs/2502.13124v1", "repo": "null"}}