{"2501.02621": {"publish_time": "2025-01-05", "title": "LLMs Help Alleviate the Cross-Subject Variability in Brain Signal and Language Alignment", "paper_summary": "Decoding human activity from EEG signals has long been a popular research\ntopic. While recent studies have increasingly shifted focus from single-subject\nto cross-subject analysis, few have explored the model's ability to perform\nzero-shot predictions on EEG signals from previously unseen subjects. This\nresearch aims to investigate whether deep learning methods can capture\nsubject-independent semantic information inherent in human EEG signals. Such\ninsights are crucial for Brain-Computer Interfaces (BCI) because, on one hand,\nthey demonstrate the model's robustness against subject-specific temporal\nbiases, and on the other, they significantly enhance the generalizability of\ndownstream tasks. We employ Large Language Models (LLMs) as denoising agents to\nextract subject-independent semantic features from noisy EEG signals.\nExperimental results, including ablation studies, highlight the pivotal role of\nLLMs in decoding subject-independent semantic information from noisy EEG data.\nWe hope our findings will contribute to advancing BCI research and assist both\nacademia and industry in applying EEG signals to a broader range of\napplications.", "paper_summary_zh": "人類活動的 EEG 訊號解碼一直是熱門的研究主題。雖然最近的研究已逐步將重點從單一受試者轉移到跨受試者分析，但鮮少探討模型在從先前未見受試者取得的 EEG 訊號中執行零次學習預測的能力。本研究旨在探討深度學習方法是否能擷取人類 EEG 訊號中固有的受試者無關語義資訊。此類見解對於腦電腦介面 (BCI) 至關重要，原因在於一方面，它們展現模型對於受試者特定時間偏誤的穩健性，另一方面，它們大幅提升下游任務的概括性。我們採用大型語言模型 (LLM) 作為去雜訊代理，從雜訊 EEG 訊號中萃取受試者無關語義特徵。包含消融研究在內的實驗結果突顯出 LLM 在從雜訊 EEG 資料中解碼受試者無關語義資訊的關鍵角色。我們希望我們的發現有助於推進 BCI 研究，並協助學術界和產業將 EEG 訊號應用於更廣泛的應用範圍。", "author": "Yifei Liu et.al.", "authors": "Yifei Liu, Hengwei Ye, Shuhang Li", "id": "2501.02621v1", "paper_url": "http://arxiv.org/abs/2501.02621v1", "repo": "null"}}