{"2411.02572": {"publish_time": "2024-11-04", "title": "ViTally Consistent: Scaling Biological Representation Learning for Cell Microscopy", "paper_summary": "Large-scale cell microscopy screens are used in drug discovery and molecular\nbiology research to study the effects of millions of chemical and genetic\nperturbations on cells. To use these images in downstream analysis, we need\nmodels that can map each image into a feature space that represents diverse\nbiological phenotypes consistently, in the sense that perturbations with\nsimilar biological effects have similar representations. In this work, we\npresent the largest foundation model for cell microscopy data to date, a new\n1.9 billion-parameter ViT-G/8 MAE trained on over 8 billion microscopy image\ncrops. Compared to a previous published ViT-L/8 MAE, our new model achieves a\n60% improvement in linear separability of genetic perturbations and obtains the\nbest overall performance on whole-genome biological relationship recall and\nreplicate consistency benchmarks. Beyond scaling, we developed two key methods\nthat improve performance: (1) training on a curated and diverse dataset; and,\n(2) using biologically motivated linear probing tasks to search across each\ntransformer block for the best candidate representation of whole-genome\nscreens. We find that many self-supervised vision transformers, pretrained on\neither natural or microscopy images, yield significantly more biologically\nmeaningful representations of microscopy images in their intermediate blocks\nthan in their typically used final blocks. More broadly, our approach and\nresults provide insights toward a general strategy for successfully building\nfoundation models for large-scale biological data.", "paper_summary_zh": "大規模細胞顯微鏡篩選用於藥物發現和分子生物學研究，用於研究數百萬種化學和遺傳擾動對細胞的影響。為了在後續分析中使用這些影像，我們需要可以將每個影像對應到一個特徵空間的模型，該特徵空間以一致的方式代表不同的生物表型，意思是有類似生物效應的擾動具有相似的表示。在這項工作中，我們提出了迄今為止最大的細胞顯微鏡數據基礎模型，一個新的 19 億參數的 ViT-G/8 MAE，訓練於超過 80 億個顯微鏡影像裁切上。與先前發布的 ViT-L/8 MAE 相比，我們的模型在遺傳擾動的線性可分離性方面提升了 60%，並在全基因組生物關係召回和重複一致性基準上獲得了最佳的整體表現。除了擴展之外，我們還開發了兩種關鍵方法來提升效能：(1) 訓練於一個經過整理且多樣化的資料集；以及 (2) 使用生物動機線性探測任務，在每個Transformer區塊中搜尋全基因組篩選的最佳候選表示。我們發現許多自監督視覺Transformer，無論預訓練於自然影像或顯微鏡影像，在其中間區塊中產生比其通常使用的最終區塊中更有意義的生物學顯微鏡影像表示。更廣泛地說，我們的做法和結果為成功建立大規模生物數據的基礎模型提供了一般策略的見解。", "author": "Kian Kenyon-Dean et.al.", "authors": "Kian Kenyon-Dean, Zitong Jerry Wang, John Urbanik, Konstantin Donhauser, Jason Hartford, Saber Saberian, Nil Sahin, Ihab Bendidi, Safiye Celik, Marta Fay, Juan Sebastian Rodriguez Vera, Imran S Haque, Oren Kraus", "id": "2411.02572v1", "paper_url": "http://arxiv.org/abs/2411.02572v1", "repo": "null"}}