{"2406.18326": {"publish_time": "2024-06-26", "title": "PaCoST: Paired Confidence Significance Testing for Benchmark Contamination Detection in Large Language Models", "paper_summary": "Large language models (LLMs) are known to be trained on vast amounts of data,\nwhich may unintentionally or intentionally include data from commonly used\nbenchmarks. This inclusion can lead to cheatingly high scores on model\nleaderboards, yet result in disappointing performance in real-world\napplications. To address this benchmark contamination problem, we first propose\na set of requirements that practical contamination detection methods should\nfollow. Following these proposed requirements, we introduce PaCoST, a Paired\nConfidence Significance Testing to effectively detect benchmark contamination\nin LLMs. Our method constructs a counterpart for each piece of data with the\nsame distribution, and performs statistical analysis of the corresponding\nconfidence to test whether the model is significantly more confident under the\noriginal benchmark. We validate the effectiveness of PaCoST and apply it on\npopular open-source models and benchmarks. We find that almost all models and\nbenchmarks we tested are suspected contaminated more or less. We finally call\nfor new LLM evaluation methods.", "paper_summary_zh": "大型語言模型 (LLM) 被認為是經過大量數據訓練，\n其中可能無意或有意地包含來自常用\n基準的數據。這種包含可能會導致模型\n排行榜上的作弊高分，但在現實世界中卻表現令人失望\n應用。為了解決這個基準污染問題，我們首先提出\n一系列實用的污染檢測方法應遵循的要求。遵循這些建議的要求，我們介紹 PaCoST，一種配對\n置信度顯著性測試，可有效檢測 LLM 中的基準污染\n在 LLM 中。我們的模型為每個數據構建一個具有相同分佈的對應物，並執行統計分析\n對應的置信度以測試模型在\n原始基準。我們驗證了 PaCoST 的有效性並將其應用於\n流行的開源模型和基準。我們發現我們測試的幾乎所有模型和\n基準都被懷疑或多或少受到污染。我們最終呼籲新的 LLM 評估方法。", "author": "Huixuan Zhang et.al.", "authors": "Huixuan Zhang, Yun Lin, Xiaojun Wan", "id": "2406.18326v1", "paper_url": "http://arxiv.org/abs/2406.18326v1", "repo": "null"}}