{"2408.03745": {"publish_time": "2024-08-07", "title": "Intuitionistic Fuzzy Cognitive Maps for Interpretable Image Classification", "paper_summary": "The interpretability of machine learning models is critical, as users may be\nreluctant to rely on their inferences. Intuitionistic FCMs (iFCMs) have been\nproposed as an extension of FCMs offering a natural mechanism to assess the\nquality of their output through the estimation of hesitancy, a concept\nresembling to human hesitation in decision making. To address the challenge of\ninterpretable image classification, this paper introduces a novel framework,\nnamed Interpretable Intuitionistic FCM (I2FCM) which is domain-independent,\nsimple to implement, and can be applied on Convolutional Neural Network (CNN)\nmodels, rendering them interpretable. To the best of our knowledge this is the\nfirst time iFCMs are applied for image classification. Further novel\ncontributions include: a feature extraction process focusing on the most\ninformative image regions; a learning algorithm for data-driven determination\nof the intuitionistic fuzzy interconnections of the iFCM; an inherently\ninterpretable classification approach based on image contents. In the context\nof image classification, hesitancy is considered as a degree of inconfidence\nwith which an image is categorized to a class. The constructed iFCM model\ndistinguishes the most representative image semantics and analyses them\nutilizing cause-and-effect relations. The effectiveness of the introduced\nframework is evaluated on publicly available datasets, and the experimental\nresults confirm that it can provide enhanced classification performance, while\nproviding interpretable inferences.", "paper_summary_zh": "機器學習模型的可解釋性至關重要，因為使用者可能不願意依賴其推論。直覺主義模糊聚類（iFCM）已被提出作為 FCM 的延伸，提供一種自然機制，通過估計猶豫程度來評估其輸出的品質，猶豫程度是一個類似於人類在決策中猶豫的概念。為了應對可解釋影像分類的挑戰，本文介紹了一個新穎的框架，稱為可解釋直覺主義模糊聚類（I2FCM），它與領域無關，易於實作，並且可以應用於卷積神經網路（CNN）模型，使其可解釋。據我們所知，這是 iFCM 首次應用於影像分類。進一步的新穎貢獻包括：專注於最有意義影像區域的特徵萃取過程；用於資料驅動的 iFCM 直覺模糊互連確定的學習演算法；一種基於影像內容的內在可解釋分類方法。在影像分類的背景下，猶豫程度被視為將影像分類到類別的不確定程度。建構的 iFCM 模型區分最具代表性的影像語義，並利用因果關係對其進行分析。所提出的框架的有效性在公開可用的資料集上得到評估，實驗結果證實它可以提供增強的分類效能，同時提供可解釋的推論。", "author": "Georgia Sovatzidi et.al.", "authors": "Georgia Sovatzidi, Michael D. Vasilakakis, Dimitris K. Iakovidis", "id": "2408.03745v1", "paper_url": "http://arxiv.org/abs/2408.03745v1", "repo": "null"}}