{"2501.14346": {"publish_time": "2025-01-24", "title": "HorNets: Learning from Discrete and Continuous Signals with Routing Neural Networks", "paper_summary": "Construction of neural network architectures suitable for learning from both\ncontinuous and discrete tabular data is a challenging research endeavor.\nContemporary high-dimensional tabular data sets are often characterized by a\nrelatively small instance count, requiring data-efficient learning. We propose\nHorNets (Horn Networks), a neural network architecture with state-of-the-art\nperformance on synthetic and real-life data sets from scarce-data tabular\ndomains. HorNets are based on a clipped polynomial-like activation function,\nextended by a custom discrete-continuous routing mechanism that decides which\npart of the neural network to optimize based on the input's cardinality. By\nexplicitly modeling parts of the feature combination space or combining whole\nspace in a linear attention-like manner, HorNets dynamically decide which mode\nof operation is the most suitable for a given piece of data with no explicit\nsupervision. This architecture is one of the few approaches that reliably\nretrieves logical clauses (including noisy XNOR) and achieves state-of-the-art\nclassification performance on 14 real-life biomedical high-dimensional data\nsets. HorNets are made freely available under a permissive license alongside a\nsynthetic generator of categorical benchmarks.", "paper_summary_zh": "構建適合從連續和離散表格資料學習的神經網路架構是一項具有挑戰性的研究工作。\n當代高維度表格資料集通常的特徵是實例數量相對較少，需要資料有效學習。我們提出 HorNets（霍恩網路），一種在稀疏資料表格領域的合成和真實資料集上具有最先進效能的神經網路架構。HorNets 基於一個裁剪的多項式類激活函數，並由一個自訂離散連續路由機制擴充，該機制根據輸入的基數來決定要優化神經網路的哪一部分。透過明確建模特徵組合空間的一部分或以線性注意力類的方式組合整個空間，HorNets 動態決定哪種運作模式最適合給定的資料部分，而不需要明確監督。這種架構是少數可靠擷取邏輯子句（包括雜訊 XNOR）的方法之一，並在 14 個真實生物醫學高維度資料集上達成最先進的分類效能。HorNets 在寬鬆許可證下免費提供，並附有一個類別基準的合成產生器。", "author": "Boshko koloski et.al.", "authors": "Boshko koloski, Nada Lavrač, Blaž Škrlj", "id": "2501.14346v1", "paper_url": "http://arxiv.org/abs/2501.14346v1", "repo": "https://github.com/bkolosk1/hornets"}}