{"2405.17927": {"publish_time": "2024-05-28", "title": "The Evolution of Multimodal Model Architectures", "paper_summary": "This work uniquely identifies and characterizes four prevalent multimodal\nmodel architectural patterns in the contemporary multimodal landscape.\nSystematically categorizing models by architecture type facilitates monitoring\nof developments in the multimodal domain. Distinct from recent survey papers\nthat present general information on multimodal architectures, this research\nconducts a comprehensive exploration of architectural details and identifies\nfour specific architectural types. The types are distinguished by their\nrespective methodologies for integrating multimodal inputs into the deep neural\nnetwork model. The first two types (Type A and B) deeply fuses multimodal\ninputs within the internal layers of the model, whereas the following two types\n(Type C and D) facilitate early fusion at the input stage. Type-A employs\nstandard cross-attention, whereas Type-B utilizes custom-designed layers for\nmodality fusion within the internal layers. On the other hand, Type-C utilizes\nmodality-specific encoders, while Type-D leverages tokenizers to process the\nmodalities at the model's input stage. The identified architecture types aid\nthe monitoring of any-to-any multimodal model development. Notably, Type-C and\nType-D are currently favored in the construction of any-to-any multimodal\nmodels. Type-C, distinguished by its non-tokenizing multimodal model\narchitecture, is emerging as a viable alternative to Type-D, which utilizes\ninput-tokenizing techniques. To assist in model selection, this work highlights\nthe advantages and disadvantages of each architecture type based on data and\ncompute requirements, architecture complexity, scalability, simplification of\nadding modalities, training objectives, and any-to-any multimodal generation\ncapability.", "paper_summary_zh": "<paragraph>這項研究獨特地識別並描述了當代多模態領域中四種流行的多模態模型架構模式。\n系統性地按架構類型對模型進行分類，有助於監控多模態領域的發展。\n與最近發表的提供多模態架構一般資訊的綜述論文不同，這項研究對架構細節進行了全面探討，並識別出四種類型的特定架構。\n這些類型由其將多模態輸入整合到深度神經網路模型中的各自方法區分。\n前兩種類型（類型 A 和 B）在模型的內部層深度融合多模態輸入，而後兩種類型（類型 C 和 D）則在輸入階段促進早期融合。\n類型 A 採用標準的交叉注意力，而類型 B 則利用自訂設計的層在內部層進行模態融合。\n另一方面，類型 C 利用特定於模態的編碼器，而類型 D 則利用分詞器在模型的輸入階段處理模態。\n已識別的架構類型有助於監控任何到任何多模態模型的開發。\n值得注意的是，類型 C 和類型 D 目前在任何到任何多模態模型的建構中受到青睞。\n類型 C 以其非分詞多模態模型架構為特點，正成為利用輸入分詞技術的類型 D 的可行替代方案。\n為了協助模型選擇，這項研究根據資料和運算需求、架構複雜性、可擴充性、簡化模態新增、訓練目標和任何到任何多模態生成能力，重點說明了每種類型架構的優缺點。</paragraph>", "author": "Shakti N. Wadekar et.al.", "authors": "Shakti N. Wadekar, Abhishek Chaurasia, Aman Chadha, Eugenio Culurciello", "id": "2405.17927v1", "paper_url": "http://arxiv.org/abs/2405.17927v1", "repo": "null"}}