{"2412.03338": {"publish_time": "2024-12-04", "title": "AI-Driven Day-to-Day Route Choice", "paper_summary": "Understanding travelers' route choices can help policymakers devise optimal\noperational and planning strategies for both normal and abnormal circumstances.\nHowever, existing choice modeling methods often rely on predefined assumptions\nand struggle to capture the dynamic and adaptive nature of travel behavior.\nRecently, Large Language Models (LLMs) have emerged as a promising alternative,\ndemonstrating remarkable ability to replicate human-like behaviors across\nvarious fields. Despite this potential, their capacity to accurately simulate\nhuman route choice behavior in transportation contexts remains doubtful. To\nsatisfy this curiosity, this paper investigates the potential of LLMs for route\nchoice modeling by introducing an LLM-empowered agent, \"LLMTraveler.\" This\nagent integrates an LLM as its core, equipped with a memory system that learns\nfrom past experiences and makes decisions by balancing retrieved data and\npersonality traits. The study systematically evaluates the LLMTraveler's\nability to replicate human-like decision-making through two stages: (1)\nanalyzing its route-switching behavior in single origin-destination (OD) pair\ncongestion game scenarios, where it demonstrates patterns align with laboratory\ndata but are not fully explained by traditional models, and (2) testing its\ncapacity to model day-to-day (DTD) adaptive learning behaviors on the Ortuzar\nand Willumsen (OW) network, producing results comparable to Multinomial Logit\n(MNL) and Reinforcement Learning (RL) models. These experiments demonstrate\nthat the framework can partially replicate human-like decision-making in route\nchoice while providing natural language explanations for its decisions. This\ncapability offers valuable insights for transportation policymaking, such as\nsimulating traveler responses to new policies or changes in the network.", "paper_summary_zh": "<paragraph>了解旅客的路線選擇有助於政策制定者為正常和異常情況制定最佳營運和規劃策略。然而，現有的選擇模型方法通常依賴於預定義的假設，並且難以捕捉旅遊行為的動態和適應性。最近，大型語言模型 (LLM) 已成為一種有希望的替代方案，展示了在各種領域複製類人行為的非凡能力。儘管有這種潛力，它們在運輸環境中準確模擬人類路線選擇行為的能力仍然令人懷疑。為了滿足這種好奇心，本文通過引入 LLM 賦能的代理「LLMTraveler」來探討 LLM 在路線選擇建模中的潛力。此代理整合 LLM 作為其核心，配備一個記憶系統，從過去的經驗中學習，並通過平衡檢索的數據和人格特質來做出決策。該研究系統地評估了 LLMTraveler 通過兩個階段複製類人決策的能力：(1) 分析其在單一起點-目的地 (OD) 對擁塞博弈場景中的路線切換行為，它展示的模式與實驗室數據一致，但無法完全由傳統模型解釋，以及 (2) 測試其在 Ortuzar 和 Willumsen (OW) 網路上對日復一日 (DTD) 適應性學習行為進行建模的能力，產生的結果與多項式 Logit (MNL) 和強化學習 (RL) 模型相當。這些實驗表明，該框架可以部分複製類人路線選擇中的決策，同時為其決策提供自然語言解釋。這種能力為交通政策制定提供了有價值的見解，例如模擬旅客對新政策或網路變化的反應。</paragraph>", "author": "Leizhen Wang et.al.", "authors": "Leizhen Wang, Peibo Duan, Zhengbing He, Cheng Lyu, Xin Chen, Nan Zheng, Li Yao, Zhenliang Ma", "id": "2412.03338v1", "paper_url": "http://arxiv.org/abs/2412.03338v1", "repo": "null"}}