{"2504.11190": {"publish_time": "2025-04-15", "title": "Enhancing multimodal analogical reasoning with Logic Augmented Generation", "paper_summary": "Recent advances in Large Language Models have demonstrated their capabilities\nacross a variety of tasks. However, automatically extracting implicit knowledge\nfrom natural language remains a significant challenge, as machines lack active\nexperience with the physical world. Given this scenario, semantic knowledge\ngraphs can serve as conceptual spaces that guide the automated text generation\nreasoning process to achieve more efficient and explainable results. In this\npaper, we apply a logic-augmented generation (LAG) framework that leverages the\nexplicit representation of a text through a semantic knowledge graph and\napplies it in combination with prompt heuristics to elicit implicit analogical\nconnections. This method generates extended knowledge graph triples\nrepresenting implicit meaning, enabling systems to reason on unlabeled\nmultimodal data regardless of the domain. We validate our work through three\nmetaphor detection and understanding tasks across four datasets, as they\nrequire deep analogical reasoning capabilities. The results show that this\nintegrated approach surpasses current baselines, performs better than humans in\nunderstanding visual metaphors, and enables more explainable reasoning\nprocesses, though still has inherent limitations in metaphor understanding,\nespecially for domain-specific metaphors. Furthermore, we propose a thorough\nerror analysis, discussing issues with metaphorical annotations and current\nevaluation methods.", "paper_summary_zh": "<paragraph>大型語言模型的最新進展展現了它們在各種任務中的能力。然而，自動從自然語言中提取隱性知識仍然是一項重大挑戰，因為機器缺乏對物理世界的主動經驗。在這種情況下，語義知識圖譜可以作為概念空間，引導自動文本生成的推理過程，以獲得更高效且可解釋的結果。在本文中，我們應用了一個邏輯增強生成 (LAG) 框架，該框架利用語義知識圖譜對文本的顯式表示，並將其與提示啟發式方法相結合，以引出隱性的類比聯繫。這種方法生成表示隱性含義的擴展知識圖譜三元組，使系統能夠對未標記的多模態數據進行推理，而無需考慮領域。我們通過跨四個數據集的三個隱喻檢測和理解任務來驗證我們的工作，因為它們需要深層次的類比推理能力。結果表明，這種集成方法超越了目前的基準，在理解視覺隱喻方面比人類表現更好，並且能夠實現更具可解釋性的推理過程，儘管在隱喻理解方面仍然存在固有的局限性，尤其是對於特定領域的隱喻。此外，我們提出了全面的錯誤分析，討論了隱喻註釋和當前評估方法的問題。</paragraph>\n", "author": "Anna Sofia Lippolis et.al.", "authors": "Anna Sofia Lippolis, Andrea Giovanni Nuzzolese, Aldo Gangemi", "id": "2504.11190v1", "paper_url": "http://arxiv.org/abs/2504.11190v1", "repo": "null"}}