{"2405.05792": {"publish_time": "2024-05-09", "title": "RoboHop: Segment-based Topological Map Representation for Open-World Visual Navigation", "paper_summary": "Mapping is crucial for spatial reasoning, planning and robot navigation.\nExisting approaches range from metric, which require precise geometry-based\noptimization, to purely topological, where image-as-node based graphs lack\nexplicit object-level reasoning and interconnectivity. In this paper, we\npropose a novel topological representation of an environment based on \"image\nsegments\", which are semantically meaningful and open-vocabulary queryable,\nconferring several advantages over previous works based on pixel-level\nfeatures. Unlike 3D scene graphs, we create a purely topological graph with\nsegments as nodes, where edges are formed by a) associating segment-level\ndescriptors between pairs of consecutive images and b) connecting neighboring\nsegments within an image using their pixel centroids. This unveils a\n\"continuous sense of a place\", defined by inter-image persistence of segments\nalong with their intra-image neighbours. It further enables us to represent and\nupdate segment-level descriptors through neighborhood aggregation using graph\nconvolution layers, which improves robot localization based on segment-level\nretrieval. Using real-world data, we show how our proposed map representation\ncan be used to i) generate navigation plans in the form of \"hops over segments\"\nand ii) search for target objects using natural language queries describing\nspatial relations of objects. Furthermore, we quantitatively analyze data\nassociation at the segment level, which underpins inter-image connectivity\nduring mapping and segment-level localization when revisiting the same place.\nFinally, we show preliminary trials on segment-level `hopping' based zero-shot\nreal-world navigation. Project page with supplementary details:\noravus.github.io/RoboHop/", "paper_summary_zh": "<paragraph>繪製地圖對於空間推理、規劃和機器人導航至關重要。\n現有方法從度量（需要精確的基於幾何的最佳化）到純拓撲（其中以影像為節點的圖形缺乏明確的物件層級推理和互連性）不等。在本文中，我們提出一個基於「影像區段」的新穎拓撲表示，這些區段在語意上是有意義的，並且可以進行開放式詞彙查詢，與基於像素層級特徵的先前工作相比，具有多項優點。與 3D 場景圖形不同，我們使用區段作為節點建立一個純拓撲圖形，其中邊緣是由 a) 將區段層級描述符與連續兩張影像之間的配對關聯起來，以及 b) 使用其像素質心連接影像中的鄰近區段所形成的。這揭示了一個「連續的地方感」，它是由區段在影像之間的持續性及其在影像內的鄰近元素所定義的。它進一步使我們能夠使用圖形卷積層透過鄰域聚合來表示和更新區段層級描述符，這改進了基於區段層級擷取的機器人定位。使用真實世界資料，我們展示了我們提出的地圖表示如何用於 i) 以「區段跳躍」的形式產生導航計畫，以及 ii) 使用描述物件空間關係的自然語言查詢來搜尋目標物件。此外，我們定量分析了區段層級的資料關聯性，這在繪製地圖期間支撐了影像之間的連接性，以及在再次造訪同一個地方時的區段層級定位。最後，我們展示了基於區段層級「跳躍」的零次學習真實世界導航的初步試驗。包含補充詳細資訊的專案頁面：\noravus.github.io/RoboHop/</paragraph>", "author": "Sourav Garg et.al.", "authors": "Sourav Garg, Krishan Rana, Mehdi Hosseinzadeh, Lachlan Mares, Niko Sünderhauf, Feras Dayoub, Ian Reid", "id": "2405.05792v1", "paper_url": "http://arxiv.org/abs/2405.05792v1", "repo": "null"}}