{"2405.17130": {"publish_time": "2024-05-27", "title": "Exploiting the Layered Intrinsic Dimensionality of Deep Models for Practical Adversarial Training", "paper_summary": "Despite being a heavily researched topic, Adversarial Training (AT) is\nrarely, if ever, deployed in practical AI systems for two primary reasons: (i)\nthe gained robustness is frequently accompanied by a drop in generalization and\n(ii) generating adversarial examples (AEs) is computationally prohibitively\nexpensive. To address these limitations, we propose SMAAT, a new AT algorithm\nthat leverages the manifold conjecture, stating that off-manifold AEs lead to\nbetter robustness while on-manifold AEs result in better generalization.\nSpecifically, SMAAT aims at generating a higher proportion of off-manifold AEs\nby perturbing the intermediate deepnet layer with the lowest intrinsic\ndimension. This systematically results in better scalability compared to\nclassical AT as it reduces the PGD chains length required for generating the\nAEs. Additionally, our study provides, to the best of our knowledge, the first\nexplanation for the difference in the generalization and robustness trends\nbetween vision and language models, ie., AT results in a drop in generalization\nin vision models whereas, in encoder-based language models, generalization\neither improves or remains unchanged. We show that vision transformers and\ndecoder-based models tend to have low intrinsic dimensionality in the earlier\nlayers of the network (more off-manifold AEs), while encoder-based models have\nlow intrinsic dimensionality in the later layers. We demonstrate the efficacy\nof SMAAT; on several tasks, including robustifying (i) sentiment classifiers,\n(ii) safety filters in decoder-based models, and (iii) retrievers in RAG\nsetups. SMAAT requires only 25-33% of the GPU time compared to standard AT,\nwhile significantly improving robustness across all applications and\nmaintaining comparable generalization.", "paper_summary_zh": "儘管對抗訓練 (AT) 是個被廣泛研究的主題，但實際上很少（甚至從未）被部署在實務 AI 系統中，主要原因有兩個：(i) 獲得的穩健性經常伴隨著概括性的下降，以及 (ii) 生成對抗範例 (AE) 在計算上過於昂貴。為了解決這些限制，我們提出了 SMAAT，這是一種新的 AT 演算法，它利用流形猜想，指出流形外的 AE 可帶來更好的穩健性，而流形上的 AE 則可帶來更好的概括性。具體來說，SMAAT 旨在透過擾動內在維度最低的中間深度網路層來產生更高比例的流形外 AE。與傳統 AT 相比，這系統性地產生了更好的可擴充性，因為它減少了產生 AE 所需的 PGD 鏈長。此外，我們的研究提供了關於視覺和語言模型之間的概括性和穩健性趨勢差異的第一個解釋，據我們所知，即 AT 導致視覺模型的概括性下降，而在基於編碼器的語言模型中，概括性則會改善或保持不變。我們表明，視覺變換器和基於解碼器的模型在網路的早期層中往往具有較低的內在維度（更多流形外 AE），而基於編碼器的模型在後來的層中具有較低的內在維度。我們展示了 SMAAT 的功效；在多項任務中，包括強化 (i) 情緒分類器、(ii) 基於解碼器的模型中的安全篩選器，以及 (iii) RAG 設定中的檢索器。與標準 AT 相比，SMAAT 只需要 25-33% 的 GPU 時間，同時顯著提高了所有應用程式的穩健性，並維持了相當的概括性。", "author": "Enes Altinisik et.al.", "authors": "Enes Altinisik, Safa Messaoud, Husrev Taha Sencar, Hassan Sajjad, Sanjay Chawla", "id": "2405.17130v1", "paper_url": "http://arxiv.org/abs/2405.17130v1", "repo": "null"}}