{"2408.00620": {"publish_time": "2024-08-01", "title": "Are Bigger Encoders Always Better in Vision Large Models?", "paper_summary": "In recent years, multimodal large language models (MLLMs) have shown strong\npotential in real-world applications. They are developing rapidly due to their\nremarkable ability to comprehend multimodal information and their inherent\npowerful cognitive and reasoning capabilities. Among MLLMs, vision language\nmodels (VLM) stand out for their ability to understand vision information.\nHowever, the scaling trend of VLMs under the current mainstream paradigm has\nnot been extensively studied. Whether we can achieve better performance by\ntraining even larger models is still unclear. To address this issue, we\nconducted experiments on the pretraining stage of MLLMs. We conduct our\nexperiment using different encoder sizes and large language model (LLM) sizes.\nOur findings indicate that merely increasing the size of encoders does not\nnecessarily enhance the performance of VLMs. Moreover, we analyzed the effects\nof LLM backbone parameter size and data quality on the pretraining outcomes.\nAdditionally, we explored the differences in scaling laws between LLMs and\nVLMs.", "paper_summary_zh": "近年來，多模態大型語言模型（MLLM）在實際應用中展現強大的潛力。由於其理解多模態資訊的非凡能力，以及其內在強大的認知和推理能力，它們正快速發展。在 MLLM 中，視覺語言模型（VLM）因其理解視覺資訊的能力而脫穎而出。然而，在目前的主流範例下，VLM 的擴充趨勢尚未廣泛研究。我們是否能透過訓練更大規模的模型來獲得更好的效能，仍不清楚。為了解決這個問題，我們對 MLLM 的預訓練階段進行了實驗。我們使用不同的編碼器大小和大型語言模型（LLM）大小來進行實驗。我們的研究結果表明，單純增加編碼器的規模並不會必然提升 VLM 的效能。此外，我們分析了 LLM 主幹參數大小和資料品質對預訓練結果的影響。此外，我們探討了 LLM 和 VLM 之間的擴充法則差異。", "author": "Bozhou Li et.al.", "authors": "Bozhou Li, Hao Liang, Zimo Meng, Wentao Zhang", "id": "2408.00620v1", "paper_url": "http://arxiv.org/abs/2408.00620v1", "repo": "null"}}