{"2412.09280": {"publish_time": "2024-12-12", "title": "Learning to Solve Domain-Specific Calculation Problems with Knowledge-Intensive Programs Generator", "paper_summary": "Domain Large Language Models (LLMs) are developed for domain-specific tasks\nbased on general LLMs. But it still requires professional knowledge to\nfacilitate the expertise for some domain-specific tasks. In this paper, we\ninvestigate into knowledge-intensive calculation problems. We find that the\nmath problems to be challenging for LLMs, when involving complex\ndomain-specific rules and knowledge documents, rather than simple formulations\nof terminologies. Therefore, we propose a pipeline to solve the domain-specific\ncalculation problems with Knowledge-Intensive Programs Generator more\neffectively, named as KIPG. It generates knowledge-intensive programs according\nto the domain-specific documents. For each query, key variables are extracted,\nthen outcomes which are dependent on domain knowledge are calculated with the\nprograms. By iterative preference alignment, the code generator learns to\nimprove the logic consistency with the domain knowledge. Taking legal domain as\nan example, we have conducted experiments to prove the effectiveness of our\npipeline, and extensive analysis on the modules. We also find that the code\ngenerator is also adaptable to other domains, without training on the new\nknowledge.", "paper_summary_zh": "領域大型語言模型 (LLM) 是根據一般 LLM 開發用於特定領域任務。但仍需專業知識，才能促進某些特定領域任務的專業知識。在本文中，我們探討知識密集型計算問題。我們發現，當涉及複雜的特定領域規則和知識文件（而非術語的簡單表述）時，數學問題對 LLM 而言具有挑戰性。因此，我們提出了一個管道，以更有效地使用知識密集型程式產生器解決特定領域的計算問題，稱為 KIPG。它根據特定領域的文件產生知識密集型程式。對於每個查詢，會萃取出關鍵變數，然後使用程式計算依賴於領域知識的結果。透過反覆偏好比對，程式產生器學會改善與領域知識的邏輯一致性。以法律領域為例，我們已進行實驗證明我們管道的有效性，並對模組進行廣泛分析。我們還發現，程式產生器也可以適應其他領域，而不需要對新知識進行訓練。", "author": "Chengyuan Liu et.al.", "authors": "Chengyuan Liu, Shihang Wang, Lizhi Qing, Jun Lin, Ji Zhang, Fei Wu, Kun Kuang", "id": "2412.09280v1", "paper_url": "http://arxiv.org/abs/2412.09280v1", "repo": "null"}}