{"2406.14826": {"publish_time": "2024-06-21", "title": "Self-supervised Brain Lesion Generation for Effective Data Augmentation of Medical Images", "paper_summary": "Accurate brain lesion delineation is important for planning neurosurgical\ntreatment. Automatic brain lesion segmentation methods based on convolutional\nneural networks have demonstrated remarkable performance. However, neural\nnetwork performance is constrained by the lack of large-scale well-annotated\ntraining datasets. In this manuscript, we propose a comprehensive framework to\nefficiently generate new, realistic samples for training a brain lesion\nsegmentation model. We first train a lesion generator, based on an adversarial\nautoencoder, in a self-supervised manner. Next, we utilize a novel image\ncomposition algorithm, Soft Poisson Blending, to seamlessly combine synthetic\nlesions and brain images to obtain training samples. Finally, to effectively\ntrain the brain lesion segmentation model with augmented images we introduce a\nnew prototype consistence regularization to align real and synthetic features.\nOur framework is validated by extensive experiments on two public brain lesion\nsegmentation datasets: ATLAS v2.0 and Shift MS. Our method outperforms existing\nbrain image data augmentation schemes. For instance, our method improves the\nDice from 50.36% to 60.23% compared to the U-Net with conventional data\naugmentation techniques for the ATLAS v2.0 dataset.", "paper_summary_zh": "準確的腦病灶描繪對於規劃神經外科治療很重要。基於卷積神經網路的自動腦病灶分割方法已展現出卓越的成效。然而，神經網路的效能受到缺乏大量標註良好的訓練資料集的限制。在此手稿中，我們提出一個全面的架構，以有效產生新的、逼真的樣本來訓練腦病灶分割模型。我們首先以自監督的方式訓練一個基於對抗自動編碼器的病灶生成器。接下來，我們利用一種新穎的影像合成演算法，Soft Poisson Blending，將合成病灶和腦影像無縫結合，以取得訓練樣本。最後，為了有效地使用擴充影像訓練腦病灶分割模型，我們引入一種新的原型一致正則化，以對齊真實和合成的特徵。我們的架構經過兩個公開的腦病灶分割資料集：ATLAS v2.0 和 Shift MS 的廣泛實驗驗證。我們的模型優於現有的腦影像資料擴充方法。例如，與採用傳統資料擴充技術的 ATLAS v2.0 資料集的 U-Net 相比，我們的模型將 Dice 從 50.36% 提升到 60.23%。", "author": "Jiayu Huo et.al.", "authors": "Jiayu Huo, Sebastien Ourselin, Rachel Sparks", "id": "2406.14826v1", "paper_url": "http://arxiv.org/abs/2406.14826v1", "repo": "null"}}