{"2502.03805": {"publish_time": "2025-02-06", "title": "Identify Critical KV Cache in LLM Inference from an Output Perturbation Perspective", "paper_summary": "Large language models have revolutionized natural language processing but\nface significant challenges of high storage and runtime costs, due to the\ntransformer architecture's reliance on self-attention, particularly the large\nKey-Value (KV) cache for long-sequence inference. Recent efforts to reduce KV\ncache size by pruning less critical entries based on attention weights remain\nempirical and lack formal grounding. This paper presents a formal study on\nidentifying critical KV cache entries by analyzing attention output\nperturbation. Our analysis reveals that, beyond attention weights, the value\nstates within KV entries and pretrained parameter matrices are also crucial.\nBased on this, we propose a perturbation-constrained selection algorithm that\noptimizes the worst-case output perturbation to identify critical entries.\nEvaluations on the Needle-in-a-Haystack test and Longbench benchmark show our\nalgorithm enhances state-of-the-art cache eviction methods. Further empirical\nanalysis confirms that our algorithm achieves lower output perturbations in\nover 92% attention heads in Llama model, thereby providing a significant\nimprovement over existing methods.", "paper_summary_zh": "大型語言模型已經徹底改變了自然語言處理，但由於Transformer架構依賴於自我注意，特別是長序列推論的大型鍵值 (KV) 快取，因此面臨著儲存和執行時間成本高的重大挑戰。最近透過根據注意力權重來修剪較不重要的條目以減少 KV 快取大小的努力仍然是經驗性的，並且缺乏正式的依據。本文提出了一項正式的研究，透過分析注意力輸出擾動來識別重要的 KV 快取條目。我們的分析顯示，除了注意力權重之外，KV 條目中的值狀態和預訓練參數矩陣也至關重要。基於此，我們提出了一種擾動約束選擇演算法，它最佳化最差情況的輸出擾動以識別重要的條目。在 Needle-in-a-Haystack 測試和 Longbench 基準上的評估顯示，我們的演算法增強了最先進的快取驅逐方法。進一步的經驗分析證實，我們的演算法在 Llama 模型中超過 92% 的注意力頭中達到了較低的輸出擾動，從而提供了對現有方法的顯著改進。", "author": "Yuan Feng et.al.", "authors": "Yuan Feng, Junlin Lv, Yukun Cao, Xike Xie, S Kevin Zhou", "id": "2502.03805v1", "paper_url": "http://arxiv.org/abs/2502.03805v1", "repo": "null"}}