{"2410.22997": {"publish_time": "2024-10-30", "title": "A Comparison of Prompt Engineering Techniques for Task Planning and Execution in Service Robotics", "paper_summary": "Recent advances in LLM have been instrumental in autonomous robot control and\nhuman-robot interaction by leveraging their vast general knowledge and\ncapabilities to understand and reason across a wide range of tasks and\nscenarios. Previous works have investigated various prompt engineering\ntechniques for improving the performance of \\glspl{LLM} to accomplish tasks,\nwhile others have proposed methods that utilize LLMs to plan and execute tasks\nbased on the available functionalities of a given robot platform. In this work,\nwe consider both lines of research by comparing prompt engineering techniques\nand combinations thereof within the application of high-level task planning and\nexecution in service robotics. We define a diverse set of tasks and a simple\nset of functionalities in simulation, and measure task completion accuracy and\nexecution time for several state-of-the-art models.", "paper_summary_zh": "近年來，LLM 的進展對於自主機器人控制和人機互動至關重要，利用其廣泛的常識和能力來理解和推理各種任務和場景。先前的研究調查了各種提示工程技術，以提高 LLM 的效能來完成任務，而其他人則提出了利用 LLM 來規劃和執行任務的方法，這些方法基於給定機器人平台的可用功能。在這項工作中，我們透過比較提示工程技術及其在服務機器人中高階任務規劃和執行的應用中的組合，來考量這兩條研究路線。我們在模擬中定義了一組多樣化的任務和一組簡單的功能，並測量了幾個最先進模型的任務完成準確度和執行時間。", "author": "Jonas Bode et.al.", "authors": "Jonas Bode, Bastian Pätzold, Raphael Memmesheimer, Sven Behnke", "id": "2410.22997v1", "paper_url": "http://arxiv.org/abs/2410.22997v1", "repo": "https://github.com/ais-bonn/prompt_engineering"}}