{"2407.02354": {"publish_time": "2024-07-02", "title": "Talking to Machines: do you read me?", "paper_summary": "In this dissertation I would like to guide the reader to the research on\ndialogue but more precisely the research I have conducted during my career\nsince my PhD thesis. Starting from modular architectures with machine\nlearning/deep learning and reinforcement learning to end-to-end deep neural\nnetworks. Besides my work as research associate, I also present the work I have\nsupervised in the last years.\n  I review briefly the state of the art and highlight the open research\nproblems on conversational agents. Afterwards, I present my contribution to\nTask-Oriented Dialogues (TOD), both as research associate and as the industrial\nsupervisor of CIFRE theses. I discuss conversational QA. Particularly, I\npresent the work of two PhD candidates Thibault Cordier and Sebastien Montella;\nas well as the work of the young researcher Quentin Brabant. Finally, I present\nthe scientific project, where I discuss about Large Language Models (LLMs) for\nTask-Oriented Dialogue and Multimodal Task-Oriented Dialogue.", "paper_summary_zh": "在本文中，我想引導讀者了解對話研究，更準確地說，是我自博士論文以來，在職業生涯中進行的研究。從具備機器學習/深度學習和強化學習的模組化架構，到端到端的深度神經網路開始。除了我的研究助理工作外，我也會介紹我在過去幾年監督的工作。\n我簡要回顧了對話代理的現狀，並重點說明了開放的研究問題。之後，我將介紹我在任務導向對話 (TOD) 中的貢獻，既作為研究助理，也作為 CIFRE 論文的產業指導。我討論了對話式問答。特別是，我介紹了兩位博士候選人 Thibault Cordier 和 Sebastien Montella 的工作；以及青年研究員 Quentin Brabant 的工作。最後，我介紹了科學計畫，其中我討論了任務導向對話和多模態任務導向對話的大型語言模型 (LLM)。", "author": "Lina M. Rojas-Barahona et.al.", "authors": "Lina M. Rojas-Barahona", "id": "2407.02354v1", "paper_url": "http://arxiv.org/abs/2407.02354v1", "repo": "null"}}