{"2411.07751": {"publish_time": "2024-11-12", "title": "SAV-SE: Scene-aware Audio-Visual Speech Enhancement with Selective State Space Model", "paper_summary": "Speech enhancement plays an essential role in various applications, and the\nintegration of visual information has been demonstrated to bring substantial\nadvantages. However, the majority of current research concentrates on the\nexamination of facial and lip movements, which can be compromised or entirely\ninaccessible in scenarios where occlusions occur or when the camera view is\ndistant. Whereas contextual visual cues from the surrounding environment have\nbeen overlooked: for example, when we see a dog bark, our brain has the innate\nability to discern and filter out the barking noise. To this end, in this\npaper, we introduce a novel task, i.e. SAV-SE. To our best knowledge, this is\nthe first proposal to use rich contextual information from synchronized video\nas auxiliary cues to indicate the type of noise, which eventually improves the\nspeech enhancement performance. Specifically, we propose the VC-S$^2$E method,\nwhich incorporates the Conformer and Mamba modules for their complementary\nstrengths. Extensive experiments are conducted on public MUSIC, AVSpeech and\nAudioSet datasets, where the results demonstrate the superiority of VC-S$^2$E\nover other competitive methods. We will make the source code publicly\navailable. Project demo page: https://AVSEPage.github.io/", "paper_summary_zh": "語音增強在各種應用中扮演著重要的角色，而視覺資訊的整合已被證明能帶來顯著的優勢。然而，目前大多數的研究都集中在對臉部和嘴唇動作的檢視上，這在發生遮擋或相機視角較遠時可能會受到影響或完全無法使用。而來自周圍環境的脈絡視覺線索則被忽略了：例如，當我們看到一隻狗吠叫時，我們的大腦具有辨別和濾除吠叫噪音的先天氣質。為此，在本文中，我們引入了一個新任務，即 SAV-SE。據我們所知，這是第一個提出使用來自同步視訊的豐富脈絡資訊作為輔助線索來指示噪音類型的提案，這最終改善了語音增強性能。具體來說，我們提出了 VC-S$^2$E 方法，它結合了 Conformer 和 Mamba 模組，以發揮其互補優勢。在公開的 MUSIC、AVSpeech 和 AudioSet 資料集上進行了大量的實驗，結果證明了 VC-S$^2$E 優於其他競爭方法。我們將公開原始碼。專案展示頁面：https://AVSEPage.github.io/", "author": "Xinyuan Qian et.al.", "authors": "Xinyuan Qian, Jiaran Gao, Yaodan Zhang, Qiquan Zhang, Hexin Liu, Leibny Paola Garcia, Haizhou Li", "id": "2411.07751v1", "paper_url": "http://arxiv.org/abs/2411.07751v1", "repo": "null"}}