{"2408.14277": {"publish_time": "2024-08-26", "title": "Epidemic Information Extraction for Event-Based Surveillance using Large Language Models", "paper_summary": "This paper presents a novel approach to epidemic surveillance, leveraging the\npower of Artificial Intelligence and Large Language Models (LLMs) for effective\ninterpretation of unstructured big data sources, like the popular ProMED and\nWHO Disease Outbreak News. We explore several LLMs, evaluating their\ncapabilities in extracting valuable epidemic information. We further enhance\nthe capabilities of the LLMs using in-context learning, and test the\nperformance of an ensemble model incorporating multiple open-source LLMs. The\nfindings indicate that LLMs can significantly enhance the accuracy and\ntimeliness of epidemic modelling and forecasting, offering a promising tool for\nmanaging future pandemic events.", "paper_summary_zh": "本文提出了一種流行病監控的新方法，利用人工智能和大型語言模型 (LLM) 的力量，有效解讀非結構化大數據源，例如流行的 ProMED 和 WHO 疾病爆發新聞。我們探討了多個 LLM，評估它們在提取有價值的流行病信息方面的能力。我們進一步使用情境學習增強 LLM 的能力，並測試了一個結合多個開源 LLM 的整體模型的性能。研究結果表明，LLM 可以顯著提高流行病建模和預測的準確性和及時性，為管理未來的流行病事件提供了一個有前途的工具。", "author": "Sergio Consoli et.al.", "authors": "Sergio Consoli, Peter Markov, Nikolaos I. Stilianakis, Lorenzo Bertolini, Antonio Puertas Gallardo, Mario Ceresa", "id": "2408.14277v1", "paper_url": "http://arxiv.org/abs/2408.14277v1", "repo": "null"}}