{"2411.14403": {"publish_time": "2024-11-21", "title": "Landing Trajectory Prediction for UAS Based on Generative Adversarial Network", "paper_summary": "Models for trajectory prediction are an essential component of many advanced\nair mobility studies. These models help aircraft detect conflict and plan\navoidance maneuvers, which is especially important in Unmanned Aircraft systems\n(UAS) landing management due to the congested airspace near vertiports. In this\npaper, we propose a landing trajectory prediction model for UAS based on\nGenerative Adversarial Network (GAN). The GAN is a prestigious neural network\nthat has been developed for many years. In previous research, GAN has achieved\nmany state-of-the-art results in many generation tasks. The GAN consists of one\nneural network generator and a neural network discriminator. Because of the\nlearning capacity of the neural networks, the generator is capable to\nunderstand the features of the sample trajectory. The generator takes the\nprevious trajectory as input and outputs some random status of a flight.\nAccording to the results of the experiences, the proposed model can output more\naccurate predictions than the baseline method(GMR) in various datasets. To\nevaluate the proposed model, we also create a real UAV landing dataset that\nincludes more than 2600 trajectories of drone control manually by real pilots.", "paper_summary_zh": "航跡預測模型是許多先進空中流動性研究中不可或缺的組成部分。這些模型有助於飛機偵測衝突並規劃避讓動作，這在無人機系統（UAS）著陸管理中尤其重要，這是因為垂直起降機場附近的空域壅塞。在本文中，我們提出一個基於生成對抗網路（GAN）的 UAS 著陸航跡預測模型。GAN 是一個久負盛名的神經網路，已經發展多年。在先前的研究中，GAN 在許多生成任務中取得許多最先進的成果。GAN 包含一個神經網路產生器和一個神經網路判別器。由於神經網路的學習能力，產生器能夠了解樣本航跡的特徵。產生器將先前的航跡作為輸入，並輸出飛行的某些隨機狀態。根據經驗結果，所提出的模型可以在各種資料集中輸出比基線方法（GMR）更準確的預測。為了評估所提出的模型，我們還建立了一個真實的無人機著陸資料集，其中包含超過 2600 條由真實飛行員手動控制的無人機航跡。", "author": "Jun Xiang et.al.", "authors": "Jun Xiang, Drake Essick, Luiz Gonzalez Bautista, Junfei Xie, Jun Chen", "id": "2411.14403v1", "paper_url": "http://arxiv.org/abs/2411.14403v1", "repo": "null"}}