{"2411.01423": {"publish_time": "2024-11-03", "title": "Conditional Latent Space Molecular Scaffold Optimization for Accelerated Molecular Design", "paper_summary": "The rapid discovery of new chemical compounds is essential for advancing\nglobal health and developing treatments. While generative models show promise\nin creating novel molecules, challenges remain in ensuring the real-world\napplicability of these molecules and finding such molecules efficiently. To\naddress this, we introduce Conditional Latent Space Molecular Scaffold\nOptimization (CLaSMO), which combines a Conditional Variational Autoencoder\n(CVAE) with Latent Space Bayesian Optimization (LSBO) to modify molecules\nstrategically while maintaining similarity to the original input. Our LSBO\nsetting improves the sample-efficiency of our optimization, and our\nmodification approach helps us to obtain molecules with higher chances of\nreal-world applicability. CLaSMO explores substructures of molecules in a\nsample-efficient manner by performing BO in the latent space of a CVAE\nconditioned on the atomic environment of the molecule to be optimized. Our\nexperiments demonstrate that CLaSMO efficiently enhances target properties with\nminimal substructure modifications, achieving state-of-the-art results with a\nsmaller model and dataset compared to existing methods. We also provide an\nopen-source web application that enables chemical experts to apply CLaSMO in a\nHuman-in-the-Loop setting.", "paper_summary_zh": "新化學化合物的快速發現對於促進全球健康和開發治療方法至關重要。儘管生成模型在創造新分子方面顯示出前景，但仍然存在挑戰，以確保這些分子的實際適用性並有效地找到這些分子。為了解決這個問題，我們引入了條件潛在空間分子支架最佳化 (CLaSMO)，它結合了條件變異自動編碼器 (CVAE) 與潛在空間貝氏最佳化 (LSBO)，以策略性地修改分子，同時保持與原始輸入的相似性。我們的 LSBO 設定改善了我們最佳化的樣本效率，我們的修改方法幫助我們獲得具有更高實際適用機會的分子。CLaSMO 以樣本有效的方式探索分子的子結構，方法是在 CVAE 的潛在空間中執行 BO，該空間以要最佳化的分子的原子環境為條件。我們的實驗表明，CLaSMO 以最小的子結構修改有效地增強了目標屬性，與現有方法相比，使用較小的模型和數據集實現了最先進的結果。我們還提供了一個開源網路應用程式，讓化學專家能夠在人機迴圈設定中應用 CLaSMO。", "author": "Onur Boyar et.al.", "authors": "Onur Boyar, Hiroyuki Hanada, Ichiro Takeuchi", "id": "2411.01423v1", "paper_url": "http://arxiv.org/abs/2411.01423v1", "repo": "null"}}