{"2405.11817": {"publish_time": "2024-05-20", "title": "Systematic Review on Healthcare Systems Engineering utilizing ChatGPT", "paper_summary": "This paper presents an analytical framework for conducting academic reviews\nin the field of Healthcare Systems Engineering, employing ChatGPT, a\nstate-of-the-art tool among recent language models. We utilized 9,809 abstract\nparagraphs from conference presentations to systematically review the field.\nThe framework comprises distinct analytical processes, each employing tailored\nprompts and the systematic use of the ChatGPT API. Through this framework, we\norganized the target field into 11 topic categories and conducted a\ncomprehensive analysis covering quantitative yearly trends and detailed\nsub-categories. This effort explores the potential for leveraging ChatGPT to\nalleviate the burden of academic reviews. Furthermore, it provides valuable\ninsights into the dynamic landscape of Healthcare Systems Engineering research.", "paper_summary_zh": "本文提出了一個分析框架，用於在醫療系統工程領域進行學術審查，採用了 ChatGPT，這是一個近期語言模型中最先進的工具。我們利用了 9,809 篇來自會議簡報的摘要段落，對該領域進行了系統性審查。該框架包含不同的分析流程，每個流程都採用了量身定制的提示和系統化地使用 ChatGPT API。通過這個框架，我們將目標領域組織成 11 個主題類別，並進行了涵蓋數量化年度趨勢和詳細子類別的全面分析。這項工作探索了利用 ChatGPT 減輕學術審查負擔的潛力。此外，它還提供了對醫療系統工程研究的動態格局的寶貴見解。", "author": "Jungwoo Kim et.al.", "authors": "Jungwoo Kim, Ji-Su Lee, Huijae Kim, Taesik Lee", "id": "2405.11817v1", "paper_url": "http://arxiv.org/abs/2405.11817v1", "repo": "null"}}