{"2501.12429": {"publish_time": "2025-01-21", "title": "Fuel Efficiency Analysis of the Public Transportation System Based on the Gaussian Mixture Model Clustering", "paper_summary": "Public transportation is a major source of greenhouse gas emissions,\nhighlighting the need to improve bus fuel efficiency. Clustering algorithms\nassist in analyzing fuel efficiency by grouping data into clusters, but\nirrelevant features may complicate the analysis and choosing the optimal number\nof clusters remains a challenging task. Therefore, this paper employs the\nGaussian mixture models to cluster the solo fuel-efficiency dataset. Moreover,\nan integration method that combines the Silhouette index, Calinski-Harabasz\nindex, and Davies-Bouldin index is developed to select the optimal cluster\nnumbers. A dataset with 4006 bus trips in North Jutland, Denmark is utilized as\nthe case study. Trips are first split into three groups, then one group is\ndivided further, resulting in four categories: extreme, normal, low, and\nextremely low fuel efficiency. A preliminary study using visualization analysis\nis conducted to investigate how driving behaviors and route conditions affect\nfuel efficiency. The results indicate that both individual driving habits and\nroute characteristics have a significant influence on fuel efficiency.", "paper_summary_zh": "公共運輸是溫室氣體排放的主要來源，突顯了改善公車燃油效率的必要性。分群演算法有助於透過將資料分組成群集來分析燃油效率，但無關特徵可能會使分析複雜化，而選擇最佳群集數量仍然是一項具有挑戰性的任務。因此，本文採用高斯混合模型來分群單一燃油效率資料集。此外，還開發了一種結合輪廓指數、Calinski-Harabasz 指數和 Davies-Bouldin 指數的整合方法來選擇最佳群集數量。丹麥北日德蘭半島 4006 次公車行程的資料集被用作案例研究。行程首先分成三組，然後進一步將一組分開，形成四個類別：極端、正常、低和極低燃油效率。使用視覺化分析進行初步研究，以調查駕駛行為和路線狀況如何影響燃油效率。結果表明，個人的駕駛習慣和路線特徵都對燃油效率有顯著影響。", "author": "Zhipeng Ma et.al.", "authors": "Zhipeng Ma, Bo Nørregaard Jørgensen, Zheng Ma", "id": "2501.12429v1", "paper_url": "http://arxiv.org/abs/2501.12429v1", "repo": "null"}}