{"2412.05200": {"publish_time": "2024-12-06", "title": "Are Frontier Large Language Models Suitable for Q&A in Science Centres?", "paper_summary": "This paper investigates the suitability of frontier Large Language Models\n(LLMs) for Q&A interactions in science centres, with the aim of boosting\nvisitor engagement while maintaining factual accuracy. Using a dataset of\nquestions collected from the National Space Centre in Leicester (UK), we\nevaluated responses generated by three leading models: OpenAI's GPT-4, Claude\n3.5 Sonnet, and Google Gemini 1.5. Each model was prompted for both standard\nand creative responses tailored to an 8-year-old audience, and these responses\nwere assessed by space science experts based on accuracy, engagement, clarity,\nnovelty, and deviation from expected answers. The results revealed a trade-off\nbetween creativity and accuracy, with Claude outperforming GPT and Gemini in\nboth maintaining clarity and engaging young audiences, even when asked to\ngenerate more creative responses. Nonetheless, experts observed that higher\nnovelty was generally associated with reduced factual reliability across all\nmodels. This study highlights the potential of LLMs in educational settings,\nemphasizing the need for careful prompt engineering to balance engagement with\nscientific rigor.", "paper_summary_zh": "這篇論文探討前沿大型語言模型 (LLM) 在科學中心問答互動中的適用性，目的是在維持事實準確性的同時提升訪客參與度。我們使用從英國萊斯特國家太空中心收集的提問資料集，評估了三個領先模型生成的回應：OpenAI 的 GPT-4、Claude 3.5 Sonnet 和 Google Gemini 1.5。每個模型都被提示針對 8 歲的受眾量身打造標準和有創意的回應，而這些回應則由太空科學專家根據準確性、參與度、清晰度、新穎性和與預期答案的偏差進行評估。結果顯示創造力與準確性之間存在權衡，Claude 在維持清晰度和吸引年輕受眾方面優於 GPT 和 Gemini，即使被要求產生更多有創意的回應。儘管如此，專家們觀察到，所有模型中較高的新穎性通常與較低的實際可靠性相關。這項研究強調了 LLM 在教育環境中的潛力，並強調需要仔細提示工程以平衡參與度和科學嚴謹性。", "author": "Jacob Watson et.al.", "authors": "Jacob Watson, Fabrício Góes, Marco Volpe, Talles Medeiros", "id": "2412.05200v1", "paper_url": "http://arxiv.org/abs/2412.05200v1", "repo": "null"}}