{"2407.12410": {"publish_time": "2024-07-17", "title": "Proximity-based Self-Federated Learning", "paper_summary": "In recent advancements in machine learning, federated learning allows a\nnetwork of distributed clients to collaboratively develop a global model\nwithout needing to share their local data. This technique aims to safeguard\nprivacy, countering the vulnerabilities of conventional centralized learning\nmethods. Traditional federated learning approaches often rely on a central\nserver to coordinate model training across clients, aiming to replicate the\nsame model uniformly across all nodes. However, these methods overlook the\nsignificance of geographical and local data variances in vast networks,\npotentially affecting model effectiveness and applicability. Moreover, relying\non a central server might become a bottleneck in large networks, such as the\nones promoted by edge computing. Our paper introduces a novel,\nfully-distributed federated learning strategy called proximity-based\nself-federated learning that enables the self-organised creation of multiple\nfederations of clients based on their geographic proximity and data\ndistribution without exchanging raw data. Indeed, unlike traditional\nalgorithms, our approach encourages clients to share and adjust their models\nwith neighbouring nodes based on geographic proximity and model accuracy. This\nmethod not only addresses the limitations posed by diverse data distributions\nbut also enhances the model's adaptability to different regional\ncharacteristics creating specialized models for each federation. We demonstrate\nthe efficacy of our approach through simulations on well-known datasets,\nshowcasing its effectiveness over the conventional centralized federated\nlearning framework.", "paper_summary_zh": "在機器學習的最新進展中，聯邦學習允許分散式用戶端網路共同開發一個全球模型，而無需分享其當地資料。此技術旨在保護隱私，對抗傳統集中式學習方法的漏洞。傳統的聯邦學習方法通常依賴於中央伺服器來協調用戶端的模型訓練，旨在在所有節點中均勻複製同一個模型。然而，這些方法忽略了廣大網路中地理和當地資料差異的重要性，可能會影響模型的有效性和適用性。此外，依賴於中央伺服器可能會成為大型網路中的瓶頸，例如邊緣運算所推廣的網路。我們的論文介紹了一種新穎的、完全分散的聯邦學習策略，稱為基於接近性的自我聯邦學習，它能根據用戶端的地理接近性和資料分佈，讓用戶端能自行組織建立多個聯邦，而無需交換原始資料。事實上，與傳統演算法不同，我們的做法鼓勵用戶端根據地理接近性和模型準確度，與鄰近節點分享和調整其模型。此方法不僅解決了不同資料分佈所造成的限制，而且還增強了模型對不同區域特性的適應性，為每個聯邦建立專業模型。我們透過在眾所周知的資料集上進行模擬，證明了我們方法的功效，展示了其相較於傳統集中式聯邦學習架構的有效性。", "author": "Davide Domini et.al.", "authors": "Davide Domini, Gianluca Aguzzi, Nicolas Farabegoli, Mirko Viroli, Lukas Esterle", "id": "2407.12410v1", "paper_url": "http://arxiv.org/abs/2407.12410v1", "repo": "null"}}