{"2411.18444": {"publish_time": "2024-11-27", "title": "Is my Meeting Summary Good? Estimating Quality with a Multi-LLM Evaluator", "paper_summary": "The quality of meeting summaries generated by natural language generation\n(NLG) systems is hard to measure automatically. Established metrics such as\nROUGE and BERTScore have a relatively low correlation with human judgments and\nfail to capture nuanced errors. Recent studies suggest using large language\nmodels (LLMs), which have the benefit of better context understanding and\nadaption of error definitions without training on a large number of human\npreference judgments. However, current LLM-based evaluators risk masking errors\nand can only serve as a weak proxy, leaving human evaluation the gold standard\ndespite being costly and hard to compare across studies. In this work, we\npresent MESA, an LLM-based framework employing a three-step assessment of\nindividual error types, multi-agent discussion for decision refinement, and\nfeedback-based self-training to refine error definition understanding and\nalignment with human judgment. We show that MESA's components enable thorough\nerror detection, consistent rating, and adaptability to custom error\nguidelines. Using GPT-4o as its backbone, MESA achieves mid to high\nPoint-Biserial correlation with human judgment in error detection and mid\nSpearman and Kendall correlation in reflecting error impact on summary quality,\non average 0.25 higher than previous methods. The framework's flexibility in\nadapting to custom error guidelines makes it suitable for various tasks with\nlimited human-labeled data.", "paper_summary_zh": "自然語言生成 (NLG) 系統產生的會議摘要品質難以自動衡量。ROUGE 和 BERTScore 等既有指標與人類判斷相關性較低，且無法捕捉細微錯誤。最近的研究建議使用大型語言模型 (LLM)，其優點是能更佳理解脈絡，並在未針對大量人類偏好判斷進行訓練的情況下調整錯誤定義。然而，現有的基於 LLM 的評估器有錯誤掩蔽的風險，且只能作為一種弱代理，儘管成本高且難以跨研究比較，但仍將人類評估視為黃金標準。在這項工作中，我們提出 MESA，一個基於 LLM 的架構，採用三步驟評估個別錯誤類型、多主體討論以改善決策，以及基於回饋的自訓練來改善錯誤定義理解，並與人類判斷保持一致。我們證明 MESA 的組成元件能徹底偵測錯誤、一致評分，並能適應自訂的錯誤準則。MESA 以 GPT-4o 為基礎，在錯誤偵測中達到中到高的點雙列相關係數，在反映錯誤對摘要品質的影響時，達到中等的斯皮爾曼和肯德爾相關係數，平均比先前的方法高 0.25。此架構能適應自訂的錯誤準則，使其適用於各種具有人類標記資料有限的任務。", "author": "Frederic Kirstein et.al.", "authors": "Frederic Kirstein, Terry Ruas, Bela Gipp", "id": "2411.18444v1", "paper_url": "http://arxiv.org/abs/2411.18444v1", "repo": "null"}}