{"2502.12134": {"publish_time": "2025-02-17", "title": "SoftCoT: Soft Chain-of-Thought for Efficient Reasoning with LLMs", "paper_summary": "Chain-of-Thought (CoT) reasoning enables Large Language Models (LLMs) to\nsolve complex reasoning tasks by generating intermediate reasoning steps.\nHowever, most existing approaches focus on hard token decoding, which\nconstrains reasoning within the discrete vocabulary space and may not always be\noptimal. While recent efforts explore continuous-space reasoning, they often\nsuffer from catastrophic forgetting, limiting their applicability to\nstate-of-the-art LLMs that already perform well in zero-shot settings with a\nproper instruction. To address this challenge, we propose a novel approach for\ncontinuous-space reasoning that does not require modifying the underlying LLM.\nSpecifically, we employ a lightweight assistant model to generate\ninstance-specific soft thought tokens speculatively as the initial chain of\nthoughts, which are then mapped into the LLM's representation space via a\nprojection module. Experimental results on five reasoning benchmarks\ndemonstrate that our method enhances LLM reasoning performance through\nsupervised, parameter-efficient fine-tuning.", "paper_summary_zh": "鏈式思考 (CoT) 推理讓大型語言模型 (LLM) 能夠透過產生中間推理步驟來解決複雜的推理任務。然而，現有的大多數方法都專注於硬標記解碼，這會將推理限制在離散的詞彙空間內，而且可能並非總是最佳。雖然最近的研究探索了連續空間推理，但它們經常會遭遇災難性遺忘，這限制了它們在零次學習設置中表現良好的最先進 LLM 的適用性，且需要適當的說明。為了應對這項挑戰，我們提出了一種創新的連續空間推理方法，不需要修改底層的 LLM。具體來說，我們採用一個輕量級的輔助模型來產生特定於實例的軟思考標記，作為思考的初始鏈，然後透過投影模組將它們映射到 LLM 的表示空間。在五個推理基準上的實驗結果表明，我們的模型透過監督式、參數高效的微調，增強了 LLM 的推理效能。", "author": "Yige Xu et.al.", "authors": "Yige Xu, Xu Guo, Zhiwei Zeng, Chunyan Miao", "id": "2502.12134v1", "paper_url": "http://arxiv.org/abs/2502.12134v1", "repo": "null"}}