{"2408.15373": {"publish_time": "2024-08-27", "title": "Handling Geometric Domain Shifts in Semantic Segmentation of Surgical RGB and Hyperspectral Images", "paper_summary": "Robust semantic segmentation of intraoperative image data holds promise for\nenabling automatic surgical scene understanding and autonomous robotic surgery.\nWhile model development and validation are primarily conducted on idealistic\nscenes, geometric domain shifts, such as occlusions of the situs, are common in\nreal-world open surgeries. To close this gap, we (1) present the first analysis\nof state-of-the-art (SOA) semantic segmentation models when faced with\ngeometric out-of-distribution (OOD) data, and (2) propose an augmentation\ntechnique called \"Organ Transplantation\", to enhance generalizability. Our\ncomprehensive validation on six different OOD datasets, comprising 600 RGB and\nhyperspectral imaging (HSI) cubes from 33 pigs, each annotated with 19 classes,\nreveals a large performance drop in SOA organ segmentation models on geometric\nOOD data. This performance decline is observed not only in conventional RGB\ndata (with a dice similarity coefficient (DSC) drop of 46 %) but also in HSI\ndata (with a DSC drop of 45 %), despite the richer spectral information\ncontent. The performance decline increases with the spatial granularity of the\ninput data. Our augmentation technique improves SOA model performance by up to\n67 % for RGB data and 90 % for HSI data, achieving performance at the level of\nin-distribution performance on real OOD test data. Given the simplicity and\neffectiveness of our augmentation method, it is a valuable tool for addressing\ngeometric domain shifts in surgical scene segmentation, regardless of the\nunderlying model. Our code and pre-trained models are publicly available at\nhttps://github.com/IMSY-DKFZ/htc.", "paper_summary_zh": "<paragraph>強健的腹腔內影像資料語義分割有望實現自動手術場景理解和自主機器人手術。\n雖然模型開發和驗證主要在理想場景中進行，但在現實世界中的開放式手術中，幾何領域轉移（例如部位閉塞）很常見。為了彌補這一差距，我們（1）提出了面對幾何分佈外（OOD）資料時最先進（SOA）語義分割模型的首次分析，以及（2）提出了一種名為「器官移植」的擴充技術，以增強泛化性。我們對六個不同的 OOD 資料集進行了全面驗證，其中包括來自 33 隻豬的 600 個 RGB 和高光譜成像 (HSI) 立方體，每個立方體都標註了 19 個類別，結果顯示 SOA 器官分割模型在幾何 OOD 資料上的性能大幅下降。這種性能下降不僅在傳統 RGB 資料中觀察到（骰子相似性系數 (DSC) 下降 46%），而且在 HSI 資料中也觀察到（DSC 下降 45%），儘管光譜資訊含量更豐富。性能下降隨著輸入資料的空間粒度而增加。我們的擴充技術將 SOA 模型的性能提高了 RGB 資料的 67% 和 HSI 資料的 90%，在真實 OOD 測試資料上實現了與分佈內性能相當的性能。鑑於我們的擴充方法的簡潔性和有效性，它是一個有價值的工具，可用於解決手術場景分割中的幾何領域轉移，而不管基礎模型如何。我們的程式碼和預訓練模型可在 https://github.com/IMSY-DKFZ/htc 公開獲得。</paragraph>", "author": "Silvia Seidlitz et.al.", "authors": "Silvia Seidlitz, Jan Sellner, Alexander Studier-Fischer, Alessandro Motta, Berkin Özdemir, Beat P. Müller-Stich, Felix Nickel, Lena Maier-Hein", "id": "2408.15373v1", "paper_url": "http://arxiv.org/abs/2408.15373v1", "repo": "https://github.com/imsy-dkfz/htc"}}