{"2406.00014": {"publish_time": "2024-05-22", "title": "KU-DMIS at EHRSQL 2024:Generating SQL query via question templatization in EHR", "paper_summary": "Transforming natural language questions into SQL queries is crucial for\nprecise data retrieval from electronic health record (EHR) databases. A\nsignificant challenge in this process is detecting and rejecting unanswerable\nquestions that request information beyond the database's scope or exceed the\nsystem's capabilities. In this paper, we introduce a novel text-to-SQL\nframework that robustly handles out-of-domain questions and verifies the\ngenerated queries with query execution.Our framework begins by standardizing\nthe structure of questions into a templated format. We use a powerful large\nlanguage model (LLM), fine-tuned GPT-3.5 with detailed prompts involving the\ntable schemas of the EHR database system. Our experimental results demonstrate\nthe effectiveness of our framework on the EHRSQL-2024 benchmark benchmark, a\nshared task in the ClinicalNLP workshop. Although a straightforward fine-tuning\nof GPT shows promising results on the development set, it struggled with the\nout-of-domain questions in the test set. With our framework, we improve our\nsystem's adaptability and achieve competitive performances in the official\nleaderboard of the EHRSQL-2024 challenge.", "paper_summary_zh": "將自然語言問題轉換為 SQL 查詢對於從電子健康記錄 (EHR) 資料庫中精確擷取資料至關重要。此過程中的一項重大挑戰是偵測和拒絕超出資料庫範圍或超過系統功能的要求資訊的無法回答問題。在本文中，我們介紹了一個新穎的文字轉 SQL 架構，它可以穩健地處理領域外問題，並透過查詢執行驗證產生的查詢。我們的架構首先將問題的結構標準化為範本格式。我們使用強大的大型語言模型 (LLM)，微調 GPT-3.5，並使用包含 EHR 資料庫系統表格結構的詳細提示。我們的實驗結果證明了我們的架構在 EHRSQL-2024 基準基準上的有效性，這是 ClinicalNLP 研討會中的一項共同任務。雖然 GPT 的直接微調在開發集合中顯示出有希望的結果，但它在測試集合中的領域外問題中遇到了困難。透過我們的架構，我們改進了系統的適應性，並在 EHRSQL-2024 挑戰的官方排行榜中取得了競爭力的表現。", "author": "Hajung Kim et.al.", "authors": "Hajung Kim, Chanhwi Kim, Hoonick Lee, Kyochul Jang, Jiwoo Lee, Kyungjae Lee, Gangwoo Kim, Jaewoo Kang", "id": "2406.00014v1", "paper_url": "http://arxiv.org/abs/2406.00014v1", "repo": "null"}}