{"2411.02622": {"publish_time": "2024-11-04", "title": "Pseudo-Probability Unlearning: Towards Efficient and Privacy-Preserving Machine Unlearning", "paper_summary": "Machine unlearning--enabling a trained model to forget specific data--is\ncrucial for addressing biased data and adhering to privacy regulations like the\nGeneral Data Protection Regulation (GDPR)'s \"right to be forgotten\". Recent\nworks have paid little attention to privacy concerns, leaving the data intended\nfor forgetting vulnerable to membership inference attacks. Moreover, they often\ncome with high computational overhead. In this work, we propose\nPseudo-Probability Unlearning (PPU), a novel method that enables models to\nforget data efficiently and in a privacy-preserving manner. Our method replaces\nthe final-layer output probabilities of the neural network with\npseudo-probabilities for the data to be forgotten. These pseudo-probabilities\nfollow either a uniform distribution or align with the model's overall\ndistribution, enhancing privacy and reducing risk of membership inference\nattacks. Our optimization strategy further refines the predictive probability\ndistributions and updates the model's weights accordingly, ensuring effective\nforgetting with minimal impact on the model's overall performance. Through\ncomprehensive experiments on multiple benchmarks, our method achieves over 20%\nimprovements in forgetting error compared to the state-of-the-art.\nAdditionally, our method enhances privacy by preventing the forgotten set from\nbeing inferred to around random guesses.", "paper_summary_zh": "機器遺忘——讓訓練好的模型忘記特定資料——對於解決有偏差的資料和遵守隱私法規（例如一般資料保護法規 (GDPR) 的「被遺忘權」）至關重要。最近的研究鮮少關注隱私問題，導致預計要遺忘的資料容易受到成員推論攻擊。此外，它們通常伴隨著高運算負擔。在這項研究中，我們提出偽機率遺忘 (PPU)，一種創新的方法，讓模型能夠有效且以保護隱私的方式遺忘資料。我們的做法是將神經網路的最終層輸出機率替換為要遺忘資料的偽機率。這些偽機率遵循均勻分佈或與模型的整體分佈一致，增強隱私並降低成員推論攻擊的風險。我們的最佳化策略進一步改善預測機率分佈，並相應地更新模型的權重，確保有效遺忘，同時將對模型整體效能的影響降至最低。透過在多個基準上進行全面實驗，我們的做法在遺忘錯誤方面比最先進技術進步了 20% 以上。此外，我們的做法透過防止推論出遺忘的集合而增強隱私，推論結果接近隨機猜測。", "author": "Zihao Zhao et.al.", "authors": "Zihao Zhao, Yijiang Li, Yuchen Yang, Wenqing Zhang, Nuno Vasconcelos, Yinzhi Cao", "id": "2411.02622v1", "paper_url": "http://arxiv.org/abs/2411.02622v1", "repo": "null"}}