{"2410.07717": {"publish_time": "2024-10-10", "title": "On the Generalization Properties of Deep Learning for Aircraft Fuel Flow Estimation Models", "paper_summary": "Accurately estimating aircraft fuel flow is essential for evaluating new\nprocedures, designing next-generation aircraft, and monitoring the\nenvironmental impact of current aviation practices. This paper investigates the\ngeneralization capabilities of deep learning models in predicting fuel\nconsumption, focusing particularly on their performance for aircraft types\nabsent from the training data. We propose a novel methodology that integrates\nneural network architectures with domain generalization techniques to enhance\nrobustness and reliability across a wide range of aircraft. A comprehensive\ndataset containing 101 different aircraft types, separated into training and\ngeneralization sets, with each aircraft type set containing 1,000 flights. We\nemployed the base of aircraft data (BADA) model for fuel flow estimates,\nintroduced a pseudo-distance metric to assess aircraft type similarity, and\nexplored various sampling strategies to optimize model performance in\ndata-sparse regions. Our results reveal that for previously unseen aircraft\ntypes, the introduction of noise into aircraft and engine parameters improved\nmodel generalization. The model is able to generalize with acceptable mean\nabsolute percentage error between 2\\% and 10\\% for aircraft close to existing\naircraft, while performance is below 1\\% error for known aircraft in the\ntraining set. This study highlights the potential of combining domain-specific\ninsights with advanced machine learning techniques to develop scalable,\naccurate, and generalizable fuel flow estimation models.", "paper_summary_zh": "準確估計飛機燃料流量對於評估新程序、設計新世代飛機以及監控現行航空實務的環境影響至關重要。本文探討深度學習模型在預測燃料消耗方面的泛化能力，特別關注它們在訓練資料中沒有的飛機類型的效能。我們提出一個創新的方法論，將神經網路架構與領域泛化技術整合，以增強各種飛機的穩健性和可靠性。一個包含 101 種不同飛機類型的綜合資料集，分為訓練集和泛化集，每個飛機類型集包含 1,000 個航班。我們採用飛機資料庫 (BADA) 模型來估計燃料流量，引進一個偽距離量度來評估飛機類型的相似性，並探索各種取樣策略，以最佳化資料稀疏區域的模型效能。我們的結果顯示，對於以前未見的飛機類型，在飛機和引擎參數中引入雜訊可以改善模型泛化。對於接近現有飛機的飛機，該模型能夠以 2% 到 10% 之間的可接受平均絕對百分比誤差進行泛化，而對於訓練集中已知的飛機，效能低於 1% 的誤差。這項研究強調了結合特定領域見解與進階機器學習技術以開發可擴充、準確且可泛化的燃料流量估計模型的潛力。", "author": "Gabriel Jarry et.al.", "authors": "Gabriel Jarry, Ramon Dalmau, Philippe Very, Junzi Sun", "id": "2410.07717v1", "paper_url": "http://arxiv.org/abs/2410.07717v1", "repo": "null"}}