{"2412.14501": {"publish_time": "2024-12-19", "title": "Do Large Language Models Defend Inferentialist Semantics?: On the Logical Expressivism and Anti-Representationalism of LLMs", "paper_summary": "The philosophy of language, which has historically been developed through an\nanthropocentric lens, is now being forced to move towards post-anthropocentrism\ndue to the advent of large language models (LLMs) like ChatGPT (OpenAI), Claude\n(Anthropic), which are considered to possess linguistic abilities comparable to\nthose of humans. Traditionally, LLMs have been explained through distributional\nsemantics as their foundational semantics. However, recent research is\nexploring alternative foundational semantics beyond distributional semantics.\nThis paper proposes Robert Brandom's inferentialist semantics as an suitable\nfoundational semantics for LLMs, specifically focusing on the issue of\nlinguistic representationalism within this post-anthropocentric trend. Here, we\nshow that the anti-representationalism and logical expressivism of inferential\nsemantics, as well as quasi-compositionality, are useful in interpreting the\ncharacteristics and behaviors of LLMs. Further, we propose a \\emph{consensus\ntheory of truths} for LLMs. This paper argues that the characteristics of LLMs\nchallenge mainstream assumptions in philosophy of language, such as semantic\nexternalism and compositionality. We believe the argument in this paper leads\nto a re-evaluation of anti\\hyphen{}representationalist views of language,\npotentially leading to new developments in the philosophy of language.", "paper_summary_zh": "語言哲學過去一直透過人類中心主義的觀點發展，但現在因為 ChatGPT（OpenAI）、Claude（Anthropic）等大型語言模型（LLM）的出現，而被迫朝向後人類中心主義發展，這些模型被認為具備與人類相當的語言能力。傳統上，LLM 是透過分佈式語意學作為其基礎語意學來解釋的。然而，最近的研究正在探索超越分佈式語意學的替代基礎語意學。本文提出 Robert Brandom 的推論主義語意學作為 LLM 的合適基礎語意學，特別關注後人類中心主義趨勢下的語言表徵主義問題。在此，我們展示了推論語意學的反表徵主義和邏輯表現主義，以及準組合性，有助於詮釋 LLM 的特徵和行為。此外，我們提出 LLM 的「共識真理理論」。本文論證 LLM 的特徵挑戰了語言哲學中的主流假設，例如語意外在主義和組合性。我們相信本文中的論點將導致重新評估語言的反表徵主義觀點，並可能為語言哲學帶來新的發展。", "author": "Yuzuki Arai et.al.", "authors": "Yuzuki Arai, Sho Tsugawa", "id": "2412.14501v1", "paper_url": "http://arxiv.org/abs/2412.14501v1", "repo": "null"}}