{"2405.16823": {"publish_time": "2024-05-27", "title": "Unified Editing of Panorama, 3D Scenes, and Videos Through Disentangled Self-Attention Injection", "paper_summary": "While text-to-image models have achieved impressive capabilities in image\ngeneration and editing, their application across various modalities often\nnecessitates training separate models. Inspired by existing method of single\nimage editing with self attention injection and video editing with shared\nattention, we propose a novel unified editing framework that combines the\nstrengths of both approaches by utilizing only a basic 2D image text-to-image\n(T2I) diffusion model. Specifically, we design a sampling method that\nfacilitates editing consecutive images while maintaining semantic consistency\nutilizing shared self-attention features during both reference and consecutive\nimage sampling processes. Experimental results confirm that our method enables\nediting across diverse modalities including 3D scenes, videos, and panorama\nimages.", "paper_summary_zh": "儘管文字轉圖片模型在圖片產生和編輯上已取得令人印象深刻的能力，但它們在各種模態中的應用通常需要訓練獨立的模型。受到現有方法的啟發，包括使用自我注意注入的單一圖片編輯和使用共享注意力的影片編輯，我們提出一個新穎的統一編輯架構，它結合了兩種方法的優點，僅利用基本的 2D 圖片文字轉圖片 (T2I) 擴散模型。具體來說，我們設計一種取樣方法，它在參考和連續圖片取樣過程中，利用共享的自我注意力特徵，促進編輯連續圖片，同時保持語義一致性。實驗結果證實，我們的方法能夠在包括 3D 場景、影片和全景圖片等多種模態中進行編輯。", "author": "Gihyun Kwon et.al.", "authors": "Gihyun Kwon, Jangho Park, Jong Chul Ye", "id": "2405.16823v1", "paper_url": "http://arxiv.org/abs/2405.16823v1", "repo": "null"}}