{"2409.08466": {"publish_time": "2024-09-13", "title": "Explaining Datasets in Words: Statistical Models with Natural Language Parameters", "paper_summary": "To make sense of massive data, we often fit simplified models and then\ninterpret the parameters; for example, we cluster the text embeddings and then\ninterpret the mean parameters of each cluster. However, these parameters are\noften high-dimensional and hard to interpret. To make model parameters directly\ninterpretable, we introduce a family of statistical models -- including\nclustering, time series, and classification models -- parameterized by natural\nlanguage predicates. For example, a cluster of text about COVID could be\nparameterized by the predicate \"discusses COVID\". To learn these statistical\nmodels effectively, we develop a model-agnostic algorithm that optimizes\ncontinuous relaxations of predicate parameters with gradient descent and\ndiscretizes them by prompting language models (LMs). Finally, we apply our\nframework to a wide range of problems: taxonomizing user chat dialogues,\ncharacterizing how they evolve across time, finding categories where one\nlanguage model is better than the other, clustering math problems based on\nsubareas, and explaining visual features in memorable images. Our framework is\nhighly versatile, applicable to both textual and visual domains, can be easily\nsteered to focus on specific properties (e.g. subareas), and explains\nsophisticated concepts that classical methods (e.g. n-gram analysis) struggle\nto produce.", "paper_summary_zh": "為了理解大量資料，我們經常建立簡化的模型，然後\n解釋參數；例如，我們將文本嵌入分群，然後\n解釋每個群集的平均參數。然而，這些參數\n通常是高維度的，難以解釋。為了讓模型參數直接\n可解釋，我們引入了一系列統計模型——包括\n分群、時間序列和分類模型——由自然\n語言謂詞參數化。例如，一個關於 COVID 的文本群集可以\n由謂詞「討論 COVID」參數化。為了有效地學習這些統計\n模型，我們開發了一個與模型無關的演算法，該演算法最佳化\n謂詞參數的連續放鬆，並使用梯度下降和\n提示語言模型 (LM) 對其進行離散化。最後，我們將我們\n的架構應用於廣泛的問題：分類使用者聊天對話，\n描述它們如何隨著時間演變，找出一個\n語言模型優於另一個語言模型的類別，根據\n子領域對數學問題進行分群，並解釋令人難忘的圖像中的視覺特徵。我們的架構非常靈活，適用於文本和視覺領域，可以輕鬆\n引導以關注特定屬性（例如子領域），並解釋\n傳統方法（例如 n-gram 分析）難以產生的複雜概念。", "author": "Ruiqi Zhong et.al.", "authors": "Ruiqi Zhong, Heng Wang, Dan Klein, Jacob Steinhardt", "id": "2409.08466v1", "paper_url": "http://arxiv.org/abs/2409.08466v1", "repo": "https://github.com/ruiqi-zhong/nlparam"}}