{"2407.20775": {"publish_time": "2024-07-30", "title": "Interpretable Pre-Trained Transformers for Heart Time-Series Data", "paper_summary": "Decoder-only transformers are the backbone of the popular generative\npre-trained transformer (GPT) series of large language models. In this work, we\napply the same framework to periodic heart time-series data to create two\npre-trained general purpose cardiac models, namely PPG-PT and ECG-PT. We\ndemonstrate that both such pre-trained models are fully interpretable. This is\nachieved firstly through aggregate attention maps which show that the model\nfocuses on similar points in previous cardiac cycles in order to make\npredictions and gradually broadens its attention in deeper layers. Next, tokens\nwith the same value, that occur at different distinct points in the ECG and PPG\ncycle, form separate clusters in high dimensional space based on their phase as\nthey propagate through the transformer blocks. Finally, we highlight that\nindividual attention heads respond to specific physiologically relevent\nfeatures, such as the dicrotic notch in PPG and the P-wave in ECG. It is also\ndemonstrated that these pre-trained models can be easily fine-tuned for tasks\nsuch as classification of atrial fibrillation. In this specific example, the\nfine-tuning took 11 minutes of computer time, and achieved a\nleave-one-subject-out AUCs of 0.99 and 0.93 for ECG and PPG respectively.\nImportantly, these fine-tuned models are also fully explainable, with attention\nshifting to regions in the context that are strongly indicative of atrial\nfibrillation.", "paper_summary_zh": "僅解碼器Transformer是大型語言模型的熱門生成預訓練Transformer (GPT) 系列的骨幹。在這項工作中，我們將相同的架構應用於週期性心臟時間序列數據，以建立兩個預訓練的一般用途心臟模型，即 PPG-PT 和 ECG-PT。我們證明這兩個預訓練模型都是完全可解釋的。首先，這是透過總計注意力圖實現的，該圖顯示模型關注於先前心臟週期中的相似點，以進行預測，並逐漸擴展其在更深層中的注意力。接下來，在 ECG 和 PPG 週期中不同特定點出現的具有相同值的符號，會根據它們在Transformer區塊中傳播時的相位，在高維空間中形成獨立的群集。最後，我們強調個別注意力頭部會對特定的生理相關特徵做出反應，例如 PPG 中的二尖凹口和 ECG 中的 P 波。它也證明了這些預訓練模型可以輕鬆地微調，以執行分類心房顫動等任務。在這個特定範例中，微調耗時 11 分鐘，並且分別為 ECG 和 PPG 達到了 0.99 和 0.93 的留一受試者法 AUC。重要的是，這些微調模型也完全可以解釋，注意力會轉移到脈絡中強烈指示心房顫動的區域。", "author": "Harry J. Davies et.al.", "authors": "Harry J. Davies, James Monsen, Danilo P. Mandic", "id": "2407.20775v1", "paper_url": "http://arxiv.org/abs/2407.20775v1", "repo": "null"}}