{"2411.13079": {"publish_time": "2024-11-20", "title": "Neural Internal Model Control: Learning a Robust Control Policy via Predictive Error Feedback", "paper_summary": "Accurate motion control in the face of disturbances within complex\nenvironments remains a major challenge in robotics. Classical model-based\napproaches often struggle with nonlinearities and unstructured disturbances,\nwhile RL-based methods can be fragile when encountering unseen scenarios. In\nthis paper, we propose a novel framework, Neural Internal Model Control, which\nintegrates model-based control with RL-based control to enhance robustness. Our\nframework streamlines the predictive model by applying Newton-Euler equations\nfor rigid-body dynamics, eliminating the need to capture complex\nhigh-dimensional nonlinearities. This internal model combines model-free RL\nalgorithms with predictive error feedback. Such a design enables a closed-loop\ncontrol structure to enhance the robustness and generalizability of the control\nsystem. We demonstrate the effectiveness of our framework on both quadrotors\nand quadrupedal robots, achieving superior performance compared to\nstate-of-the-art methods. Furthermore, real-world deployment on a quadrotor\nwith rope-suspended payloads highlights the framework's robustness in\nsim-to-real transfer. Our code is released at\nhttps://github.com/thu-uav/NeuralIMC.", "paper_summary_zh": "在複雜環境中，精準的運動控制面對干擾，仍是機器人技術的一大挑戰。基於古典模型的方法，經常難以應付非線性和非結構化干擾，而基於 RL 的方法，在遇到未見過的場景時，可能會很脆弱。在本文中，我們提出了一個新穎的框架，稱為神經內部模型控制，它整合了基於模型的控制和基於 RL 的控制，以增強穩健性。我們的框架通過應用牛頓-歐拉方程式來簡化預測模型，以獲得剛體動力學，消除了捕捉複雜高維非線性的需要。這個內部模型結合了無模型 RL 演算法和預測誤差回饋。這樣的設計，使閉迴路控制結構能夠增強控制系統的穩健性和泛化能力。我們在四旋翼和四足機器人上證明了我們框架的有效性，與最先進的方法相比，達到了更好的效能。此外，在帶有繩索懸掛載荷的四旋翼上進行的真實世界部署，突出了該框架在模擬到真實轉移中的穩健性。我們的程式碼已發佈在 https://github.com/thu-uav/NeuralIMC。", "author": "Feng Gao et.al.", "authors": "Feng Gao, Chao Yu, Yu Wang, Yi Wu", "id": "2411.13079v1", "paper_url": "http://arxiv.org/abs/2411.13079v1", "repo": "https://github.com/thu-uav/neuralimc"}}