{"2412.04692": {"publish_time": "2024-12-06", "title": "Smoothie: Label Free Language Model Routing", "paper_summary": "Large language models (LLMs) are increasingly used in applications where LLM\ninputs may span many different tasks. Recent work has found that the choice of\nLLM is consequential, and different LLMs may be good for different input\nsamples. Prior approaches have thus explored how engineers might select an LLM\nto use for each sample (i.e. routing). While existing routing methods mostly\nrequire training auxiliary models on human-annotated data, our work explores\nwhether it is possible to perform unsupervised routing. We propose Smoothie, a\nweak supervision-inspired routing approach that requires no labeled data. Given\na set of outputs from different LLMs, Smoothie constructs a latent variable\ngraphical model over embedding representations of observable LLM outputs and\nunknown \"true\" outputs. Using this graphical model, we estimate\nsample-dependent quality scores for each LLM, and route each sample to the LLM\nwith the highest corresponding score. We find that Smoothie's LLM\nquality-scores correlate with ground-truth model quality (correctly identifying\nthe optimal model on 9/14 tasks), and that Smoothie outperforms baselines for\nrouting by up to 10 points accuracy.", "paper_summary_zh": "大型語言模型 (LLM)  zunehmend in Anwendungen verwendet werden, bei denen LLM-Eingaben viele verschiedene Aufgaben umfassen können. Jüngste Arbeiten haben ergeben, dass die Wahl des LLM ausschlaggebend ist und verschiedene LLMs für verschiedene Eingabeproben geeignet sein können. Bisherige Ansätze haben daher untersucht, wie Ingenieure ein LLM auswählen können, das für jede Probe verwendet werden soll (d. h. Routing). Während bestehende Routing-Methoden meist erfordern, dass Hilfsmodelle für mit menschlichen Anmerkungen versehene Daten trainiert werden, untersucht unsere Arbeit, ob es möglich ist, unüberwachtes Routing durchzuführen. Wir schlagen Smoothie vor, einen von schwacher Überwachung inspirierten Routing-Ansatz, der keine beschrifteten Daten benötigt. Angesichts einer Reihe von Ausgaben verschiedener LLMs konstruiert Smoothie ein latentes variables grafisches Modell über eingebettete Repräsentationen von beobachtbaren LLM-Ausgaben und unbekannten „wahren“ Ausgaben. Mithilfe dieses grafischen Modells schätzen wir probenabhängige Qualitätswerte für jedes LLM und leiten jede Probe an das LLM mit der höchsten entsprechenden Punktzahl weiter. Wir stellen fest, dass die LLM-Qualitätswerte von Smoothie mit der Grundwahrheitsmodellqualität korrelieren (die das optimale Modell bei 9/14 Aufgaben korrekt identifiziert) und dass Smoothie Basiswerte für Routing um bis zu 10 Punkte Genauigkeit übertrifft.", "author": "Neel Guha et.al.", "authors": "Neel Guha, Mayee F. Chen, Trevor Chow, Ishan S. Khare, Christopher Ré", "id": "2412.04692v1", "paper_url": "http://arxiv.org/abs/2412.04692v1", "repo": "null"}}