{"2501.09604": {"publish_time": "2025-01-16", "title": "From Scarcity to Capability: Empowering Fake News Detection in Low-Resource Languages with LLMs", "paper_summary": "The rapid spread of fake news presents a significant global challenge,\nparticularly in low-resource languages like Bangla, which lack adequate\ndatasets and detection tools. Although manual fact-checking is accurate, it is\nexpensive and slow to prevent the dissemination of fake news. Addressing this\ngap, we introduce BanFakeNews-2.0, a robust dataset to enhance Bangla fake news\ndetection. This version includes 11,700 additional, meticulously curated fake\nnews articles validated from credible sources, creating a proportional dataset\nof 47,000 authentic and 13,000 fake news items across 13 categories. In\naddition, we created a manually curated independent test set of 460 fake and\n540 authentic news items for rigorous evaluation. We invest efforts in\ncollecting fake news from credible sources and manually verified while\npreserving the linguistic richness. We develop a benchmark system utilizing\ntransformer-based architectures, including fine-tuned Bidirectional Encoder\nRepresentations from Transformers variants (F1-87\\%) and Large Language Models\nwith Quantized Low-Rank Approximation (F1-89\\%), that significantly outperforms\ntraditional methods. BanFakeNews-2.0 offers a valuable resource to advance\nresearch and application in fake news detection for low-resourced languages. We\npublicly release our dataset and model on Github to foster research in this\ndirection.", "paper_summary_zh": "假新聞快速散播已成為全球性的重大挑戰，特別是在孟加拉語等資源貧乏的語言中，因為缺乏適當的資料集和偵測工具。儘管手動查證事實非常準確，但它昂貴且緩慢，無法有效防止假新聞散播。為了解決這個問題，我們推出了 BanFakeNews-2.0，一個強大的資料集，用於增強孟加拉語假新聞偵測。此版本包含 11,700 篇經過精心策劃的額外假新聞文章，並從可信來源驗證，建立了一個包含 13 個類別的 47,000 篇真實新聞和 13,000 篇假新聞的比例資料集。此外，我們還建立了一個手動策劃的獨立測試集，包含 460 篇假新聞和 540 篇真實新聞，用於嚴格評估。我們投入大量心力從可信來源收集假新聞，並在保留語言豐富性的同時進行手動驗證。我們開發了一個基準系統，利用基於Transformer的架構，包括微調的 Transformer 編碼器表示（F1-87%）和具有量化低秩近似的語言模型（F1-89%），其效能顯著優於傳統方法。BanFakeNews-2.0 為低資源語言的假新聞偵測研究和應用提供了寶貴的資源。我們在 Github 上公開發布我們的資料集和模型，以促進這方面的研究。", "author": "Hrithik Majumdar Shibu et.al.", "authors": "Hrithik Majumdar Shibu, Shrestha Datta, Md. Sumon Miah, Nasrullah Sami, Mahruba Sharmin Chowdhury, Md. Saiful Islam", "id": "2501.09604v1", "paper_url": "http://arxiv.org/abs/2501.09604v1", "repo": "https://github.com/shibu4064/indonlp"}}