{"2412.08473": {"publish_time": "2024-12-11", "title": "Multi-perspective Alignment for Increasing Naturalness in Neural Machine Translation", "paper_summary": "Neural machine translation (NMT) systems amplify lexical biases present in\ntheir training data, leading to artificially impoverished language in output\ntranslations. These language-level characteristics render automatic\ntranslations different from text originally written in a language and human\ntranslations, which hinders their usefulness in for example creating evaluation\ndatasets. Attempts to increase naturalness in NMT can fall short in terms of\ncontent preservation, where increased lexical diversity comes at the cost of\ntranslation accuracy. Inspired by the reinforcement learning from human\nfeedback framework, we introduce a novel method that rewards both naturalness\nand content preservation. We experiment with multiple perspectives to produce\nmore natural translations, aiming at reducing machine and human translationese.\nWe evaluate our method on English-to-Dutch literary translation, and find that\nour best model produces translations that are lexically richer and exhibit more\nproperties of human-written language, without loss in translation accuracy.", "paper_summary_zh": "神經機器翻譯 (NMT) 系統擴大了其訓練資料中存在的詞彙偏差，導致輸出翻譯中的語言人為地貧乏。這些語言層面的特徵使自動翻譯不同於原本用一種語言寫成的文字和人工翻譯，這阻礙了它們在例如建立評估資料集方面的用途。增加 NMT 中自然性的嘗試可能會在內容保存方面有所不足，其中增加詞彙多樣性是以犧牲翻譯準確性為代價的。受到人類回饋框架中的強化學習的啟發，我們引入了一種新的方法，它同時獎勵自然性和內容保存。我們嘗試了多種觀點來產生更自然的翻譯，旨在減少機器和人工翻譯腔。我們對英語到荷蘭語文學翻譯評估了我們的方法，發現我們最好的模型產生的翻譯在詞彙上更豐富，並表現出更多人類書面語言的特性，而不會降低翻譯準確性。", "author": "Huiyuan Lai et.al.", "authors": "Huiyuan Lai, Esther Ploeger, Rik van Noord, Antonio Toral", "id": "2412.08473v1", "paper_url": "http://arxiv.org/abs/2412.08473v1", "repo": "null"}}