{"2408.02479": {"publish_time": "2024-08-05", "title": "From LLMs to LLM-based Agents for Software Engineering: A Survey of Current, Challenges and Future", "paper_summary": "With the rise of large language models (LLMs), researchers are increasingly\nexploring their applications in var ious vertical domains, such as software\nengineering. LLMs have achieved remarkable success in areas including code\ngeneration and vulnerability detection. However, they also exhibit numerous\nlimitations and shortcomings. LLM-based agents, a novel tech nology with the\npotential for Artificial General Intelligence (AGI), combine LLMs as the core\nfor decision-making and action-taking, addressing some of the inherent\nlimitations of LLMs such as lack of autonomy and self-improvement. Despite\nnumerous studies and surveys exploring the possibility of using LLMs in\nsoftware engineering, it lacks a clear distinction between LLMs and LLM based\nagents. It is still in its early stage for a unified standard and benchmarking\nto qualify an LLM solution as an LLM-based agent in its domain. In this survey,\nwe broadly investigate the current practice and solutions for LLMs and\nLLM-based agents for software engineering. In particular we summarise six key\ntopics: requirement engineering, code generation, autonomous decision-making,\nsoftware design, test generation, and software maintenance. We review and\ndifferentiate the work of LLMs and LLM-based agents from these six topics,\nexamining their differences and similarities in tasks, benchmarks, and\nevaluation metrics. Finally, we discuss the models and benchmarks used,\nproviding a comprehensive analysis of their applications and effectiveness in\nsoftware engineering. We anticipate this work will shed some lights on pushing\nthe boundaries of LLM-based agents in software engineering for future research.", "paper_summary_zh": "<paragraph>隨著大型語言模型 (LLM) 的興起，研究人員正越來越探索它們在各種垂直領域的應用，例如軟體工程。LLM 在包括程式碼生成和漏洞偵測等領域取得了顯著的成功。然而，它們也表現出許多限制和缺點。基於 LLM 的代理是一種新穎的技術，具有具備人工通用智慧 (AGI) 的潛力，結合 LLM 作為決策制定和採取行動的核心，解決了 LLM 的一些固有限制，例如缺乏自主性和自我完善。儘管有許多研究和調查探索在軟體工程中使用 LLM 的可能性，但它缺乏 LLM 和基於 LLM 的代理之間的明確區別。對於統一標準和基準以使其域中的 LLM 解决方案有資格成為基於 LLM 的代理，它仍處於早期階段。在本次調查中，我們廣泛調查了 LLM 和基於 LLM 的軟體工程代理的當前實務和解決方案。特別是，我們總結了六個關鍵主題：需求工程、程式碼生成、自主決策制定、軟體設計、測試生成和軟體維護。我們回顧並區分了 LLM 和基於 LLM 的代理在這六個主題中的工作，檢視它們在任務、基準和評估指標上的差異和相似性。最後，我們討論了所使用的模型和基準，全面分析了它們在軟體工程中的應用和有效性。我們預期這項工作將為推動基於 LLM 的代理在軟體工程中的界限提供一些啟示，以利未來的研究。</paragraph>", "author": "Haolin Jin et.al.", "authors": "Haolin Jin, Linghan Huang, Haipeng Cai, Jun Yan, Bo Li, Huaming Chen", "id": "2408.02479v1", "paper_url": "http://arxiv.org/abs/2408.02479v1", "repo": "null"}}