{"2406.14780": {"publish_time": "2024-06-20", "title": "ACR: A Benchmark for Automatic Cohort Retrieval", "paper_summary": "Identifying patient cohorts is fundamental to numerous healthcare tasks,\nincluding clinical trial recruitment and retrospective studies. Current cohort\nretrieval methods in healthcare organizations rely on automated queries of\nstructured data combined with manual curation, which are time-consuming,\nlabor-intensive, and often yield low-quality results. Recent advancements in\nlarge language models (LLMs) and information retrieval (IR) offer promising\navenues to revolutionize these systems. Major challenges include managing\nextensive eligibility criteria and handling the longitudinal nature of\nunstructured Electronic Medical Records (EMRs) while ensuring that the solution\nremains cost-effective for real-world application. This paper introduces a new\ntask, Automatic Cohort Retrieval (ACR), and evaluates the performance of LLMs\nand commercial, domain-specific neuro-symbolic approaches. We provide a\nbenchmark task, a query dataset, an EMR dataset, and an evaluation framework.\nOur findings underscore the necessity for efficient, high-quality ACR systems\ncapable of longitudinal reasoning across extensive patient databases.", "paper_summary_zh": "識別患者群體是許多醫療保健任務的基礎，包括臨床試驗招募和回顧性研究。當前醫療保健組織中的群體檢索方法依賴於結構化數據的自動化查詢，並結合人工整理，這既耗時又費力，而且常常會產生低品質的結果。大型語言模型 (LLM) 和資訊檢索 (IR) 的最新進展為革新這些系統提供了有前景的途徑。主要的挑戰包括管理廣泛的資格標準，以及處理非結構化電子病歷 (EMR) 的縱向性質，同時確保解決方案在現實世界的應用中仍然具有成本效益。本文介紹了一項新任務，自動群體檢索 (ACR)，並評估了 LLM 和商業、特定領域的神經符號方法的效能。我們提供了一個基準任務、一個查詢資料集、一個 EMR 資料集和一個評估架構。我們的研究結果強調了對有效、高品質的 ACR 系統的必要性，這些系統能夠跨廣泛的患者資料庫進行縱向推理。", "author": "Dung Ngoc Thai et.al.", "authors": "Dung Ngoc Thai, Victor Ardulov, Jose Ulises Mena, Simran Tiwari, Gleb Erofeev, Ramy Eskander, Karim Tarabishy, Ravi B Parikh, Wael Salloum", "id": "2406.14780v1", "paper_url": "http://arxiv.org/abs/2406.14780v1", "repo": "null"}}