{"2501.05767": {"publish_time": "2025-01-10", "title": "Migician: Revealing the Magic of Free-Form Multi-Image Grounding in Multimodal Large Language Models", "paper_summary": "The recent advancement of Multimodal Large Language Models (MLLMs) has\nsignificantly improved their fine-grained perception of single images and\ngeneral comprehension across multiple images. However, existing MLLMs still\nface challenges in achieving precise grounding in complex multi-image\nscenarios. To address this, we first explore a Chain-of-Thought (CoT) framework\nthat integrates single-image grounding with multi-image comprehension. While\npartially effective, it remains unstable and struggles to capture abstract\nvisual information due to its non-end-to-end nature. Therefore, we introduce\nMigician, the first multi-image grounding model capable of performing free-form\nand accurate grounding across multiple images. To support this, we present the\nMGrounding-630k dataset, which comprises data for several multi-image grounding\ntasks derived from existing datasets, along with newly generated free-form\ngrounding instruction-following data. Furthermore, we propose MIG-Bench, a\ncomprehensive benchmark specifically designed for evaluating multi-image\ngrounding capabilities. Experimental results demonstrate that our model\nachieves significantly superior multi-image grounding capabilities,\noutperforming the best existing MLLMs by 21.61% and even surpassing much larger\n70B models. Our code, model, dataset, and benchmark are fully open-sourced.", "paper_summary_zh": "多模态大语言模型 (MLLM) 近期取得进展，显著改善了它们对单张图像的细粒度感知和跨多张图像的一般理解。然而，现有的 MLLM 在实现复杂多图像场景中的精确接地时仍面临挑战。为了解决这个问题，我们首先探索了一个思想链 (CoT) 框架，它将单图像接地与多图像理解相集成。尽管部分有效，但它仍然不稳定，并且由于其非端到端特性而难以捕捉抽象视觉信息。因此，我们引入了 Migician，这是第一个能够跨多张图像执行自由形式和准确接地的多图像接地模型。为了支持这一点，我们提出了 MGrounding-630k 数据集，其中包含了从现有数据集中派生的几个多图像接地任务的数据，以及新生成的自由形式接地指令遵循数据。此外，我们提出了 MIG-Bench，这是一个专门设计用于评估多图像接地能力的综合基准。实验结果表明，我们的模型实现了明显优越的多图像接地能力，比现有的最佳 MLLM 提高了 21.61%，甚至超过了更大的 70B 模型。我们的代码、模型、数据集和基准是完全开源的。", "author": "You Li et.al.", "authors": "You Li, Heyu Huang, Chi Chen, Kaiyu Huang, Chao Huang, Zonghao Guo, Zhiyuan Liu, Jinan Xu, Yuhua Li, Ruixuan Li, Maosong Sun", "id": "2501.05767v1", "paper_url": "http://arxiv.org/abs/2501.05767v1", "repo": "null"}}