{"2411.16645": {"publish_time": "2024-11-25", "title": "Recommender Systems for Good (RS4Good): Survey of Use Cases and a Call to Action for Research that Matters", "paper_summary": "In the area of recommender systems, the vast majority of research efforts is\nspent on developing increasingly sophisticated recommendation models, also\nusing increasingly more computational resources. Unfortunately, most of these\nresearch efforts target a very small set of application domains, mostly\ne-commerce and media recommendation. Furthermore, many of these models are\nnever evaluated with users, let alone put into practice. The scientific,\neconomic and societal value of much of these efforts by scholars therefore\nremains largely unclear. To achieve a stronger positive impact resulting from\nthese efforts, we posit that we as a research community should more often\naddress use cases where recommender systems contribute to societal good\n(RS4Good). In this opinion piece, we first discuss a number of examples where\nthe use of recommender systems for problems of societal concern has been\nsuccessfully explored in the literature. We then proceed by outlining a\nparadigmatic shift that is needed to conduct successful RS4Good research, where\nthe key ingredients are interdisciplinary collaborations and longitudinal\nevaluation approaches with humans in the loop.", "paper_summary_zh": "在推薦系統領域，絕大多數的研究工作都花在開發日益精密的推薦模型，同時也使用越來越多運算資源。不幸的是，這些研究工作大多針對非常小的一組應用領域，主要是電子商務和媒體推薦。此外，這些模型中的許多模型從未經過使用者評估，更不用說付諸實踐了。因此，學者們在這些工作上的科學、經濟和社會價值在很大程度上仍不清楚。為了讓這些工作產生更強大的正面影響，我們認為我們作為一個研究社群應該更常解決推薦系統對社會有益的用例（RS4Good）。在這篇意見文章中，我們首先討論了一些範例，其中在文獻中已成功探索了將推薦系統用於社會關注的問題。然後，我們接著概述進行成功的 RS4Good 研究所需的典範轉移，其中關鍵要素是跨領域合作和人類參與的縱向評估方法。", "author": "Dietmar Jannach et.al.", "authors": "Dietmar Jannach, Alan Said, Marko Tkalčič, Markus Zanker", "id": "2411.16645v1", "paper_url": "http://arxiv.org/abs/2411.16645v1", "repo": "null"}}