{"2501.05078": {"publish_time": "2025-01-09", "title": "Analyzing Memorization in Large Language Models through the Lens of Model Attribution", "paper_summary": "Large Language Models (LLMs) are prevalent in modern applications but often\nmemorize training data, leading to privacy breaches and copyright issues.\nExisting research has mainly focused on posthoc analyses, such as extracting\nmemorized content or developing memorization metrics, without exploring the\nunderlying architectural factors that contribute to memorization. In this work,\nwe investigate memorization from an architectural lens by analyzing how\nattention modules at different layers impact its memorization and\ngeneralization performance. Using attribution techniques, we systematically\nintervene in the LLM architecture by bypassing attention modules at specific\nblocks while keeping other components like layer normalization and MLP\ntransformations intact. We provide theorems analyzing our intervention\nmechanism from a mathematical view, bounding the difference in layer outputs\nwith and without our attributions. Our theoretical and empirical analyses\nreveal that attention modules in deeper transformer blocks are primarily\nresponsible for memorization, whereas earlier blocks are crucial for the models\ngeneralization and reasoning capabilities. We validate our findings through\ncomprehensive experiments on different LLM families (Pythia and GPTNeo) and\nfive benchmark datasets. Our insights offer a practical approach to mitigate\nmemorization in LLMs while preserving their performance, contributing to safer\nand more ethical deployment in real world applications.", "paper_summary_zh": "大型語言模型 (LLM) 在現代應用中很普遍，但經常記住訓練資料，導致隱私洩露和版權問題。現有研究主要集中在事後分析，例如提取記憶內容或開發記憶度量標準，而沒有探討導致記憶的底層架構因素。在這項工作中，我們透過分析不同層級的注意力模組如何影響其記憶和泛化效能，從架構角度探討記憶。使用歸因技術，我們系統性地介入 LLM 架構，方法是在特定區塊中繞過注意力模組，同時保持層正規化和 MLP 轉換等其他元件完整。我們提供定理從數學角度分析我們的介入機制，界定有和沒有我們的歸因時層輸出差異。我們的理論和實證分析顯示，較深層Transformer區塊中的注意力模組主要負責記憶，而較早期的區塊對於模型的泛化和推理能力至關重要。我們透過對不同 LLM 家族（Pythia 和 GPTNeo）和五個基準資料集進行全面的實驗驗證我們的發現。我們的見解提供了一種實用的方法來減輕 LLM 中的記憶，同時保留其效能，有助於在實際應用中更安全、更合乎道德地部署。", "author": "Tarun Ram Menta et.al.", "authors": "Tarun Ram Menta, Susmit Agrawal, Chirag Agarwal", "id": "2501.05078v1", "paper_url": "http://arxiv.org/abs/2501.05078v1", "repo": "null"}}