{"2412.07408": {"publish_time": "2024-12-10", "title": "Explainability of Deep Learning-Based Plant Disease Classifiers Through Automated Concept Identification", "paper_summary": "While deep learning has significantly advanced automatic plant disease\ndetection through image-based classification, improving model explainability\nremains crucial for reliable disease detection. In this study, we apply the\nAutomated Concept-based Explanation (ACE) method to plant disease\nclassification using the widely adopted InceptionV3 model and the PlantVillage\ndataset. ACE automatically identifies the visual concepts found in the image\ndata and provides insights about the critical features influencing the model\npredictions. This approach reveals both effective disease-related patterns and\nincidental biases, such as those from background or lighting that can\ncompromise model robustness. Through systematic experiments, ACE helped us to\nidentify relevant features and pinpoint areas for targeted model improvement.\nOur findings demonstrate the potential of ACE to improve the explainability of\nplant disease classification based on deep learning, which is essential for\nproducing transparent tools for plant disease management in agriculture.", "paper_summary_zh": "儘管深度學習已透過基於影像分類大幅提升自動化植物疾病偵測，但改善模型可解釋性對於可靠的疾病偵測仍至關重要。在此研究中，我們將自動化概念為基礎的解釋 (ACE) 方法應用於植物疾病分類，使用廣泛採用的 InceptionV3 模型與 PlantVillage 資料集。ACE 會自動辨識影像資料中發現的視覺概念，並提供關於影響模型預測的重要特徵的見解。此方法揭露了有效的疾病相關模式和偶然偏差，例如來自背景或光線的偏差，這些偏差可能會損害模型的穩健性。透過系統性的實驗，ACE 協助我們辨識相關特徵，並精確指出目標模型改善領域。我們的研究結果證明了 ACE 改善基於深度學習的植物疾病分類可解釋性的潛力，這對於在農業中產生用於植物疾病管理的透明工具至關重要。", "author": "Jihen Amara et.al.", "authors": "Jihen Amara, Birgitta König-Ries, Sheeba Samuel", "id": "2412.07408v1", "paper_url": "http://arxiv.org/abs/2412.07408v1", "repo": "null"}}