{"2412.08061": {"publish_time": "2024-12-11", "title": "Go-Oracle: Automated Test Oracle for Go Concurrency Bugs", "paper_summary": "The Go programming language has gained significant traction for developing\nsoftware, especially in various infrastructure systems. Nonetheless,\nconcurrency bugs have become a prevalent issue within Go, presenting a unique\nchallenge due to the language's dual concurrency mechanisms-communicating\nsequential processes and shared memory. Detecting concurrency bugs and\naccurately classifying program executions as pass or fail presents an immense\nchallenge, even for domain experts. We conducted a survey with expert\ndevelopers at Bytedance that confirmed this challenge. Our work seeks to\naddress the test oracle problem for Go programs, to automatically classify test\nexecutions as pass or fail. This problem has not been investigated in the\nliterature for Go programs owing to its distinctive programming model.\n  Our approach involves collecting both passing and failing execution traces\nfrom various subject Go programs. We capture a comprehensive array of execution\nevents using the native Go execution tracer. Subsequently, we preprocess and\nencode these traces before training a transformer-based neural network to\neffectively classify the traces as either passing or failing. The evaluation of\nour approach encompasses 8 subject programs sourced from the GoBench\nrepository. These subject programs are routinely used as benchmarks in an\nindustry setting. Encouragingly, our test oracle, Go-Oracle, demonstrates high\naccuracies even when operating with a limited dataset, showcasing the efficacy\nand potential of our methodology. Developers at Bytedance strongly agreed that\nthey would use the Go-Oracle tool over the current practice of manual\ninspections to classify tests for Go programs as pass or fail.", "paper_summary_zh": "Go 程式語言在開發軟體方面獲得顯著的進展，特別是在各種基礎架構系統中。儘管如此，並發錯誤已成為 Go 中普遍的問題，由於語言的雙重並發機制（傳遞順序處理和共享記憶體），這提出了獨特的挑戰。即使對於領域專家來說，偵測並發錯誤和準確地將程式執行分類為通過或失敗也構成了巨大的挑戰。我們在 ByteDance 進行了一項專家開發人員調查，證實了這項挑戰。我們的研究旨在解決 Go 程式的測試預言問題，以自動將測試執行分類為通過或失敗。由於其獨特的程式設計模型，這個問題尚未在 Go 程式的文獻中得到探討。我們的做法包括從各種主題 Go 程式收集通過和失敗的執行追蹤。我們使用原生 Go 執行追蹤器擷取全面的執行事件陣列。隨後，我們在訓練基於轉換器的類神經網路以有效地將追蹤分類為通過或失敗之前，對這些追蹤進行預處理和編碼。我們的方法評估包含來自 GoBench 儲存庫的 8 個主題程式。這些主題程式通常用作產業環境中的基準。令人鼓舞的是，即使在使用有限的資料集操作時，我們的測試預言 Go-Oracle 也表現出很高的準確性，展示了我們方法的有效性和潛力。ByteDance 的開發人員強烈同意，他們將使用 Go-Oracle 工具，而不是目前的測試手動檢查方式，將 Go 程式的測試分類為通過或失敗。", "author": "Foivos Tsimpourlas et.al.", "authors": "Foivos Tsimpourlas, Chao Peng, Carlos Rosuero, Ping Yang, Ajitha Rajan", "id": "2412.08061v1", "paper_url": "http://arxiv.org/abs/2412.08061v1", "repo": "null"}}