{"2208.14742": {"publish_time": "2022-08-31", "title": "Enhancing Early Lung Cancer Detection on Chest Radiographs with AI-assistance: A Multi-Reader Study", "paper_summary": "Objectives: The present study evaluated the impact of a commercially\navailable explainable AI algorithm in augmenting the ability of clinicians to\nidentify lung cancer on chest X-rays (CXR).\n  Design: This retrospective study evaluated the performance of 11 clinicians\nfor detecting lung cancer from chest radiographs, with and without assistance\nfrom a commercially available AI algorithm (red dot, Behold.ai) that predicts\nsuspected lung cancer from CXRs. Clinician performance was evaluated against\nclinically confirmed diagnoses.\n  Setting: The study analysed anonymised patient data from an NHS hospital; the\ndataset consisted of 400 chest radiographs from adult patients (18 years and\nabove) who had a CXR performed in 2020, with corresponding clinical text\nreports.\n  Participants: A panel of readers consisting of 11 clinicians (consultant\nradiologists, radiologist trainees and reporting radiographers) participated in\nthis study.\n  Main outcome measures: Overall accuracy, sensitivity, specificity and\nprecision for detecting lung cancer on CXRs by clinicians, with and without AI\ninput. Agreement rates between clinicians and performance standard deviation\nwere also evaluated, with and without AI input.\n  Results: The use of the AI algorithm by clinicians led to an improved overall\nperformance for lung tumour detection, achieving an overall increase of 17.4%\nof lung cancers being identified on CXRs which would have otherwise been\nmissed, an overall increase in detection of smaller tumours, a 24% and 13%\nincreased detection of stage 1 and stage 2 lung cancers respectively, and\nstandardisation of clinician performance.\n  Conclusions: This study showed great promise in the clinical utility of AI\nalgorithms in improving early lung cancer diagnosis and promoting health equity\nthrough overall improvement in reader performances, without impacting\ndownstream imaging resources.", "paper_summary_zh": "", "author": "Gaetan Dissez et.al.", "authors": "Gaetan Dissez,Nicole Tay,Tom Dyer,Matthew Tam,Richard Dittrich,David Doyne,James Hoare,Jackson J. Pat,Stephanie Patterson,Amanda Stockham,Qaiser Malik,Tom Naunton Morgan,Paul Williams,Liliana Garcia-Mondragon,Jordan Smith,George Pearse,Simon Rasalingham", "id": "2208.14742v1", "paper_url": "http://arxiv.org/abs/2208.14742v1", "repo": "null"}}