{"2208.14742": {"publish_time": "2022-08-31", "title": "Enhancing Early Lung Cancer Detection on Chest Radiographs with AI-assistance: A Multi-Reader Study", "paper_summary": "Objectives: The present study evaluated the impact of a commercially\navailable explainable AI algorithm in augmenting the ability of clinicians to\nidentify lung cancer on chest X-rays (CXR).\n  Design: This retrospective study evaluated the performance of 11 clinicians\nfor detecting lung cancer from chest radiographs, with and without assistance\nfrom a commercially available AI algorithm (red dot, Behold.ai) that predicts\nsuspected lung cancer from CXRs. Clinician performance was evaluated against\nclinically confirmed diagnoses.\n  Setting: The study analysed anonymised patient data from an NHS hospital; the\ndataset consisted of 400 chest radiographs from adult patients (18 years and\nabove) who had a CXR performed in 2020, with corresponding clinical text\nreports.\n  Participants: A panel of readers consisting of 11 clinicians (consultant\nradiologists, radiologist trainees and reporting radiographers) participated in\nthis study.\n  Main outcome measures: Overall accuracy, sensitivity, specificity and\nprecision for detecting lung cancer on CXRs by clinicians, with and without AI\ninput. Agreement rates between clinicians and performance standard deviation\nwere also evaluated, with and without AI input.\n  Results: The use of the AI algorithm by clinicians led to an improved overall\nperformance for lung tumour detection, achieving an overall increase of 17.4%\nof lung cancers being identified on CXRs which would have otherwise been\nmissed, an overall increase in detection of smaller tumours, a 24% and 13%\nincreased detection of stage 1 and stage 2 lung cancers respectively, and\nstandardisation of clinician performance.\n  Conclusions: This study showed great promise in the clinical utility of AI\nalgorithms in improving early lung cancer diagnosis and promoting health equity\nthrough overall improvement in reader performances, without impacting\ndownstream imaging resources.", "paper_summary_zh": "<paragraph>目標：本研究評估了市售可解釋的人工智慧演算法在提升臨床醫師透過胸部X光片（CXR）辨識肺癌的能力上的影響。\n設計：這項回顧性研究評估了11位臨床醫師在有和沒有市售人工智慧演算法（紅點，Behold.ai）協助下，從胸部X光片中偵測肺癌的表現，該演算法會預測CXR中的疑似肺癌。臨床醫師表現與臨床確診結果進行比對。\n背景：該研究分析了來自NHS醫院的匿名患者資料；該資料集包含400張成人患者（18歲及以上）的胸部X光片，這些患者於2020年進行了CXR檢查，並附有對應的臨床文字報告。\n參與者：由11位臨床醫師（顧問放射科醫師、放射科醫師受訓人員和報告放射技師）組成的讀者小組參與了本研究。\n主要結果指標：臨床醫師在有和沒有人工智慧輸入的情況下，偵測CXR上肺癌的整體準確度、敏感度、特異度和精確度。臨床醫師之間的同意率和績效標準差也在有和沒有人工智慧輸入的情況下進行評估。\n結果：臨床醫師使用人工智慧演算法，改善了肺部腫瘤偵測的整體表現，整體增加了17.4%的肺癌在CXR上被辨識出來，而這些肺癌原本會被遺漏，整體增加了較小腫瘤的偵測率，分別增加了24%和13%的第1期和第2期肺癌偵測率，並標準化了臨床醫師的表現。\n結論：本研究顯示人工智慧演算法在臨床應用上極具前景，可透過整體改善讀者表現來提升早期肺癌診斷並促進健康公平性，同時不影響下游影像資源。</paragraph>", "author": "Gaetan Dissez et.al.", "authors": "Gaetan Dissez, Nicole Tay, Tom Dyer, Matthew Tam, Richard Dittrich, David Doyne, James Hoare, Jackson J. Pat, Stephanie Patterson, Amanda Stockham, Qaiser Malik, Tom Naunton Morgan, Paul Williams, Liliana Garcia-Mondragon, Jordan Smith, George Pearse, Simon Rasalingham", "id": "2208.14742v1", "paper_url": "http://arxiv.org/abs/2208.14742v1", "repo": "null"}}