{"2405.13190": {"publish_time": "2024-05-21", "title": "Interpretable Spatio-Temporal Embedding for Brain Structural-Effective Network with Ordinary Differential Equation", "paper_summary": "The MRI-derived brain network serves as a pivotal instrument in elucidating\nboth the structural and functional aspects of the brain, encompassing the\nramifications of diseases and developmental processes. However, prevailing\nmethodologies, often focusing on synchronous BOLD signals from functional MRI\n(fMRI), may not capture directional influences among brain regions and rarely\ntackle temporal functional dynamics. In this study, we first construct the\nbrain-effective network via the dynamic causal model. Subsequently, we\nintroduce an interpretable graph learning framework termed Spatio-Temporal\nEmbedding ODE (STE-ODE). This framework incorporates specifically designed\ndirected node embedding layers, aiming at capturing the dynamic interplay\nbetween structural and effective networks via an ordinary differential equation\n(ODE) model, which characterizes spatial-temporal brain dynamics. Our framework\nis validated on several clinical phenotype prediction tasks using two\nindependent publicly available datasets (HCP and OASIS). The experimental\nresults clearly demonstrate the advantages of our model compared to several\nstate-of-the-art methods.", "paper_summary_zh": "以 MRI 衍生的腦網路作為樞紐工具，闡明大腦的結構和功能面向，包含疾病和發展過程的影響。然而，現行的研究方法通常專注於功能性 MRI (fMRI) 的同步 BOLD 訊號，可能無法捕捉腦區之間的方向性影響，也很少處理時間功能動態。在本研究中，我們首先透過動態因果模型建構腦部有效網路。接著，我們引入稱為時空嵌入 ODE (STE-ODE) 的可解釋圖形學習架構。此架構結合專門設計的有向節點嵌入層，旨在透過常微分方程 (ODE) 模型捕捉結構和有效網路之間的動態交互作用，描述時空腦部動態。我們的架構在兩個獨立公開資料集 (HCP 和 OASIS) 上經過多項臨床表型預測任務驗證。實驗結果清楚顯示，與多種最先進方法相比，我們的模型具有優勢。", "author": "Haoteng Tang et.al.", "authors": "Haoteng Tang, Guodong Liu, Siyuan Dai, Kai Ye, Kun Zhao, Wenlu Wang, Carl Yang, Lifang He, Alex Leow, Paul Thompson, Heng Huang, Liang Zhan", "id": "2405.13190v1", "paper_url": "http://arxiv.org/abs/2405.13190v1", "repo": "null"}}