{"2410.08643": {"publish_time": "2024-10-11", "title": "SOAK: Same/Other/All K-fold cross-validation for estimating similarity of patterns in data subsets", "paper_summary": "In many real-world applications of machine learning, we are interested to\nknow if it is possible to train on the data that we have gathered so far, and\nobtain accurate predictions on a new test data subset that is qualitatively\ndifferent in some respect (time period, geographic region, etc). Another\nquestion is whether data subsets are similar enough so that it is beneficial to\ncombine subsets during model training. We propose SOAK, Same/Other/All K-fold\ncross-validation, a new method which can be used to answer both questions. SOAK\nsystematically compares models which are trained on different subsets of data,\nand then used for prediction on a fixed test subset, to estimate the similarity\nof learnable/predictable patterns in data subsets. We show results of using\nSOAK on six new real data sets (with geographic/temporal subsets, to check if\npredictions are accurate on new subsets), 3 image pair data sets (subsets are\ndifferent image types, to check that we get smaller prediction error on similar\nimages), and 11 benchmark data sets with predefined train/test splits (to check\nsimilarity of predefined splits).", "paper_summary_zh": "在機器學習的許多實際應用中，我們有興趣知道是否可以在我們迄今收集的資料上進行訓練，並在質量上有所不同的新測試資料子集中獲得準確的預測（時間段、地理區域等）。另一個問題是資料子集是否足夠相似，以至於在模型訓練期間合併子集是有益的。我們提出 SOAK、相同/其他/所有 K 折交叉驗證，這是一種可用於回答這兩個問題的新方法。SOAK 系統地比較在不同資料子集上訓練的模型，然後用於對固定測試子集的預測，以估計資料子集中可學習/可預測模式的相似性。我們展示了在六個新的真實資料集（帶有地理/時間子集，以檢查預測是否在新子集上準確）、3 個影像對資料集（子集是不同的影像類型，以檢查我們在相似影像上獲得較小的預測誤差）和 11 個預先定義訓練/測試分割的基準資料集（以檢查預先定義分割的相似性）上使用 SOAK 的結果。", "author": "Toby Dylan Hocking et.al.", "authors": "Toby Dylan Hocking, Gabrielle Thibault, Cameron Scott Bodine, Paul Nelson Arellano, Alexander F Shenkin, Olivia Jasmine Lindly", "id": "2410.08643v1", "paper_url": "http://arxiv.org/abs/2410.08643v1", "repo": "null"}}