{"2501.09972": {"publish_time": "2025-01-17", "title": "GVMGen: A General Video-to-Music Generation Model with Hierarchical Attentions", "paper_summary": "Composing music for video is essential yet challenging, leading to a growing\ninterest in automating music generation for video applications. Existing\napproaches often struggle to achieve robust music-video correspondence and\ngenerative diversity, primarily due to inadequate feature alignment methods and\ninsufficient datasets. In this study, we present General Video-to-Music\nGeneration model (GVMGen), designed for generating high-related music to the\nvideo input. Our model employs hierarchical attentions to extract and align\nvideo features with music in both spatial and temporal dimensions, ensuring the\npreservation of pertinent features while minimizing redundancy. Remarkably, our\nmethod is versatile, capable of generating multi-style music from different\nvideo inputs, even in zero-shot scenarios. We also propose an evaluation model\nalong with two novel objective metrics for assessing video-music alignment.\nAdditionally, we have compiled a large-scale dataset comprising diverse types\nof video-music pairs. Experimental results demonstrate that GVMGen surpasses\nprevious models in terms of music-video correspondence, generative diversity,\nand application universality.", "paper_summary_zh": "為影片譜曲至關重要卻充滿挑戰，因此自動化影片應用程式音樂生成備受關注。現有做法在達成穩健的音樂影片對應和生成多樣性方面往往會遇到困難，主要是由於特徵對齊方法不足和資料集不足。在本研究中，我們提出通用影片轉音樂生成模型 (GVMGen)，旨在為影片輸入產生高度相關的音樂。我們的模型採用階層式注意力來萃取和對齊影片特徵與音樂在空間和時間維度，確保保留相關特徵並將冗餘降至最低。值得注意的是，我們的方法用途廣泛，能夠從不同的影片輸入中生成多種風格的音樂，即使在零次學習場景中也能做到。我們還提出一個評估模型，並提出兩個新的客觀指標來評估影片音樂對齊。此外，我們編制了一個包含各種影片音樂配對的大規模資料集。實驗結果表明，GVMGen 在音樂影片對應、生成多樣性和應用通用性方面都超越了先前的模型。", "author": "Heda Zuo et.al.", "authors": "Heda Zuo, Weitao You, Junxian Wu, Shihong Ren, Pei Chen, Mingxu Zhou, Yujia Lu, Lingyun Sun", "id": "2501.09972v1", "paper_url": "http://arxiv.org/abs/2501.09972v1", "repo": "null"}}