{"2410.12735": {"publish_time": "2024-10-16", "title": "CREAM: Consistency Regularized Self-Rewarding Language Models", "paper_summary": "Recent self-rewarding large language models (LLM) have successfully applied\nLLM-as-a-Judge to iteratively improve the alignment performance without the\nneed of human annotations for preference data. These methods commonly utilize\nthe same LLM to act as both the policy model (which generates responses) and\nthe reward model (which scores and ranks those responses). The ranked responses\nare then used as preference pairs to train the LLM via direct alignment\ntechnologies (e.g. DPO). However, it is noteworthy that throughout this\nprocess, there is no guarantee of accuracy in the rewarding and ranking, which\nis critical for ensuring accurate rewards and high-quality preference data.\nEmpirical results from relatively small LLMs (e.g., 7B parameters) also\nindicate that improvements from self-rewarding may diminish after several\niterations in certain situations, which we hypothesize is due to accumulated\nbias in the reward system. This bias can lead to unreliable preference data for\ntraining the LLM. To address this issue, we first formulate and analyze the\ngeneralized iterative preference fine-tuning framework for self-rewarding\nlanguage model. We then introduce the regularization to this generalized\nframework to mitigate the overconfident preference labeling in the\nself-rewarding process. Based on this theoretical insight, we propose a\nConsistency Regularized sElf-rewarding lAnguage Model (CREAM) that leverages\nthe rewarding consistency across different iterations to regularize the\nself-rewarding training, helping the model to learn from more reliable\npreference data. With this explicit regularization, our empirical results\ndemonstrate the superiority of CREAM in improving both reward consistency and\nalignment performance. The code is publicly available at\nhttps://github.com/Raibows/CREAM.", "paper_summary_zh": "<paragraph>最近的自獎勵大型語言模型 (LLM) 已成功應用 LLM 作為評判，以迭代方式改善對齊效能，而無需人類註解偏好資料。這些方法通常利用相同的 LLM 作為策略模型（產生回應）和獎勵模型（對這些回應進行評分和排名）。排名的回應然後用作偏好對，以透過直接對齊技術（例如 DPO）訓練 LLM。然而，值得注意的是，在整個過程中，沒有保證獎勵和排名的準確性，這對於確保準確的獎勵和高品質的偏好資料至關重要。來自相對較小的 LLM（例如，7B 參數）的經驗結果也表明，在某些情況下，經過多次迭代後，來自自獎勵的改進可能會減弱，我們假設這是由於獎勵系統中累積的偏差。這種偏差可能會導致不可靠的偏好資料，以訓練 LLM。為了解決這個問題，我們首先制定和分析了自獎勵語言模型的廣義迭代偏好微調架構。然後，我們將正則化引入這個廣義架構，以減輕自獎勵過程中過於自信的偏好標籤。基於這個理論見解，我們提出了一個一致性正則化自我獎勵語言模型 (CREAM)，它利用不同迭代之間的獎勵一致性來規範自我獎勵訓練，幫助模型從更可靠的偏好資料中學習。有了這個明確的正則化，我們的經驗結果證明了 CREAM 在改善獎勵一致性和對齊效能方面的優越性。程式碼已公開發布於 https://github.com/Raibows/CREAM。</paragraph>", "author": "Zhaoyang Wang et.al.", "authors": "Zhaoyang Wang, Weilei He, Zhiyuan Liang, Xuchao Zhang, Chetan Bansal, Ying Wei, Weitong Zhang, Huaxiu Yao", "id": "2410.12735v1", "paper_url": "http://arxiv.org/abs/2410.12735v1", "repo": "null"}}