{"2408.03936": {"publish_time": "2024-08-07", "title": "SLIM-RAFT: A Novel Fine-Tuning Approach to Improve Cross-Linguistic Performance for Mercosur Common Nomenclature", "paper_summary": "Natural language processing (NLP) has seen significant advancements with the\nadvent of large language models (LLMs). However, substantial improvements are\nstill needed for languages other than English, especially for specific domains\nlike the applications of Mercosur Common Nomenclature (NCM), a Brazilian\nHarmonized System (HS). To address this gap, this study uses TeenyTineLLaMA, a\nfoundational Portuguese LLM, as an LLM source to implement the NCM application\nprocessing. Additionally, a simplified Retrieval-Augmented Fine-Tuning (RAFT)\ntechnique, termed SLIM-RAFT, is proposed for task-specific fine-tuning of LLMs.\nThis approach retains the chain-of-thought (CoT) methodology for prompt\ndevelopment in a more concise and streamlined manner, utilizing brief and\nfocused documents for training. The proposed model demonstrates an efficient\nand cost-effective alternative for fine-tuning smaller LLMs, significantly\noutperforming TeenyTineLLaMA and ChatGPT-4 in the same task. Although the\nresearch focuses on NCM applications, the methodology can be easily adapted for\nHS applications worldwide.", "paper_summary_zh": "自然語言處理 (NLP) 隨著大型語言模型 (LLM) 的出現而獲得顯著進展。然而，對於英語以外的語言，特別是像巴西統一制度 (HS) 的南方共同市場共同法規 (NCM) 應用等特定領域，仍需要大幅改進。為了解決這個差距，本研究使用 TeenyTineLLaMA（一種基礎的葡萄牙語 LLM）作為 LLM 來源，來實作 NCM 應用處理。此外，提出了一種簡化的檢索增強微調 (RAFT) 技術，稱為 SLIM-RAFT，用於 LLM 的任務特定微調。這種方法保留了思考鏈 (CoT) 方法，用於以更簡潔和流暢的方式開發提示，並利用簡短且重點明確的文件進行訓練。所提出的模型展示了一個有效且經濟的替代方案，用於微調較小的 LLM，在相同的任務中顯著優於 TeenyTineLLaMA 和 ChatGPT-4。儘管研究重點在於 NCM 應用，但該方法可以很容易地適用於全球的 HS 應用。", "author": "Vinícius Di Oliveira et.al.", "authors": "Vinícius Di Oliveira, Yuri Façanha Bezerra, Li Weigang, Pedro Carvalho Brom, Victor Rafael R. Celestino", "id": "2408.03936v1", "paper_url": "http://arxiv.org/abs/2408.03936v1", "repo": "null"}}