{"2405.08380": {"publish_time": "2024-05-14", "title": "CIER: A Novel Experience Replay Approach with Causal Inference in Deep Reinforcement Learning", "paper_summary": "In the training process of Deep Reinforcement Learning (DRL), agents require\nrepetitive interactions with the environment. With an increase in training\nvolume and model complexity, it is still a challenging problem to enhance data\nutilization and explainability of DRL training. This paper addresses these\nchallenges by focusing on the temporal correlations within the time dimension\nof time series. We propose a novel approach to segment multivariate time series\ninto meaningful subsequences and represent the time series based on these\nsubsequences. Furthermore, the subsequences are employed for causal inference\nto identify fundamental causal factors that significantly impact training\noutcomes. We design a module to provide feedback on the causality during DRL\ntraining. Several experiments demonstrate the feasibility of our approach in\ncommon environments, confirming its ability to enhance the effectiveness of DRL\ntraining and impart a certain level of explainability to the training process.\nAdditionally, we extended our approach with priority experience replay\nalgorithm, and experimental results demonstrate the continued effectiveness of\nour approach.", "paper_summary_zh": "在深度強化學習 (DRL) 的訓練過程中，代理人需要與環境進行重複的互動。隨著訓練量和模型複雜性的增加，增強資料利用率和 DRL 訓練的可解釋性仍然是一個具有挑戰性的問題。本文透過專注於時間序列時間維度內的時間相關性來解決這些挑戰。我們提出了一種新穎的方法，將多變量時間序列分割成有意義的子序列，並根據這些子序列來表示時間序列。此外，這些子序列被用於因果推論，以識別顯著影響訓練結果的基本因果因素。我們設計了一個模組，在 DRL 訓練期間提供關於因果關係的回饋。多項實驗證明了我們的方法在一般環境中的可行性，證實了它增強 DRL 訓練效果並賦予訓練過程一定程度的可解釋性的能力。此外，我們使用優先經驗回放演算法擴展了我們的方法，而實驗結果證明了我們的方法的持續有效性。", "author": "Jingwen Wang et.al.", "authors": "Jingwen Wang, Dehui Du, Yida Li, Yiyang Li, Yikang Chen", "id": "2405.08380v1", "paper_url": "http://arxiv.org/abs/2405.08380v1", "repo": "null"}}