{"2407.05683": {"publish_time": "2024-07-08", "title": "RadiomicsFill-Mammo: Synthetic Mammogram Mass Manipulation with Radiomics Features", "paper_summary": "Motivated by the question, \"Can we generate tumors with desired attributes?''\nthis study leverages radiomics features to explore the feasibility of\ngenerating synthetic tumor images. Characterized by its low-dimensional yet\nbiologically meaningful markers, radiomics bridges the gap between complex\nmedical imaging data and actionable clinical insights. We present\nRadiomicsFill-Mammo, the first of the RadiomicsFill series, an innovative\ntechnique that generates realistic mammogram mass images mirroring specific\nradiomics attributes using masked images and opposite breast images, leveraging\na recent stable diffusion model. This approach also allows for the\nincorporation of essential clinical variables, such as BI-RADS and breast\ndensity, alongside radiomics features as conditions for mass generation.\nResults indicate that RadiomicsFill-Mammo effectively generates diverse and\nrealistic tumor images based on various radiomics conditions. Results also\ndemonstrate a significant improvement in mass detection capabilities,\nleveraging RadiomicsFill-Mammo as a strategy to generate simulated samples.\nFurthermore, RadiomicsFill-Mammo not only advances medical imaging research but\nalso opens new avenues for enhancing treatment planning and tumor simulation.\nOur code is available at https://github.com/nainye/RadiomicsFill.", "paper_summary_zh": "<paragraph>本研究以「我們能生成具有所需屬性的腫瘤嗎？」這個問題為動機，利用放射特徵來探討生成合成腫瘤影像的可行性。放射特徵以其低維度且具有生物意義的標記為特徵，彌補了複雜醫學影像資料與可操作臨床見解之間的差距。我們提出 RadiomicsFill-Mammo，RadiomicsFill 系列的第一個，這是一種創新的技術，利用遮罩影像和對側乳房影像，並利用最近的穩定擴散模型，生成反映特定放射特徵屬性的逼真乳房攝影腫塊影像。這種方法還允許將基本臨床變數，例如 BI-RADS 和乳房密度，與放射特徵一起作為生成腫塊的條件。結果表明，RadiomicsFill-Mammo 能有效地根據各種放射條件生成多樣化且逼真的腫瘤影像。結果還證明了腫塊檢測能力的顯著提升，利用 RadiomicsFill-Mammo 作為生成模擬樣本的策略。此外，RadiomicsFill-Mammo 不僅推動了醫學影像研究，還為增強治療規劃和腫瘤模擬開闢了新途徑。我們的程式碼可在 https://github.com/nainye/RadiomicsFill 取得。</paragraph>", "author": "Inye Na et.al.", "authors": "Inye Na, Jonghun Kim, Eun Sook Ko, Hyunjin Park", "id": "2407.05683v1", "paper_url": "http://arxiv.org/abs/2407.05683v1", "repo": "https://github.com/nainye/radiomicsfill"}}