{"2408.09043": {"publish_time": "2024-08-16", "title": "Improving VTE Identification through Language Models from Radiology Reports: A Comparative Study of Mamba, Phi-3 Mini, and BERT", "paper_summary": "Venous thromboembolism (VTE) is a critical cardiovascular condition,\nencompassing deep vein thrombosis (DVT) and pulmonary embolism (PE). Accurate\nand timely identification of VTE is essential for effective medical care. This\nstudy builds upon our previous work, which addressed VTE detection using deep\nlearning methods for DVT and a hybrid approach combining deep learning and\nrule-based classification for PE. Our earlier approaches, while effective, had\ntwo major limitations: they were complex and required expert involvement for\nfeature engineering of the rule set. To overcome these challenges, we utilize\nthe Mamba architecture-based classifier. This model achieves remarkable\nresults, with a 97\\% accuracy and F1 score on the DVT dataset and a 98\\%\naccuracy and F1 score on the PE dataset. In contrast to the previous hybrid\nmethod on PE identification, the Mamba classifier eliminates the need for\nhand-engineered rules, significantly reducing model complexity while\nmaintaining comparable performance. Additionally, we evaluated a lightweight\nLarge Language Model (LLM), Phi-3 Mini, in detecting VTE. While this model\ndelivers competitive results, outperforming the baseline BERT models, it proves\nto be computationally intensive due to its larger parameter set. Our evaluation\nshows that the Mamba-based model demonstrates superior performance and\nefficiency in VTE identification, offering an effective solution to the\nlimitations of previous approaches.", "paper_summary_zh": "靜脈血栓栓塞症 (VTE) 是一種危急的心血管疾病，包括深層靜脈血栓 (DVT) 和肺栓塞 (PE)。準確及時地識別 VTE 對於有效的醫療照護至關重要。本研究建立在我們先前的研究之上，該研究使用深度學習方法針對 DVT 進行 VTE 偵測，並結合深度學習和基於規則的分類，針對 PE 採用混合方法。我們較早的方法雖然有效，但有兩個主要的限制：它們很複雜，並且需要專家參與規則集的特徵工程。為了克服這些挑戰，我們利用了基於 Mamba 架構的分類器。此模型取得了顯著的成果，在 DVT 資料集上獲得了 97% 的準確率和 F1 分數，在 PE 資料集上獲得了 98% 的準確率和 F1 分數。與先前的 PE 識別混合方法相比，Mamba 分類器消除了對人工規則的需求，顯著降低了模型複雜度，同時保持了可比較的性能。此外，我們評估了一個輕量級的大語言模型 (LLM) Phi-3 Mini，用於檢測 VTE。雖然此模型提供了有競爭力的結果，優於基準 BERT 模型，但由於其較大的參數集，證明其在計算上很密集。我們的評估表明，基於 Mamba 的模型在 VTE 識別中展現了卓越的性能和效率，為先前方法的限制提供了有效的解決方案。", "author": "Jamie Deng et.al.", "authors": "Jamie Deng, Yusen Wu, Yelena Yesha, Phuong Nguyen", "id": "2408.09043v1", "paper_url": "http://arxiv.org/abs/2408.09043v1", "repo": "null"}}