{"2407.06699": {"publish_time": "2024-07-09", "title": "Consistent Document-Level Relation Extraction via Counterfactuals", "paper_summary": "Many datasets have been developed to train and evaluate document-level\nrelation extraction (RE) models. Most of these are constructed using real-world\ndata. It has been shown that RE models trained on real-world data suffer from\nfactual biases. To evaluate and address this issue, we present CovEReD, a\ncounterfactual data generation approach for document-level relation extraction\ndatasets using entity replacement. We first demonstrate that models trained on\nfactual data exhibit inconsistent behavior: while they accurately extract\ntriples from factual data, they fail to extract the same triples after\ncounterfactual modification. This inconsistency suggests that models trained on\nfactual data rely on spurious signals such as specific entities and external\nknowledge $\\unicode{x2013}$ rather than on the input context $\\unicode{x2013}$\nto extract triples. We show that by generating document-level counterfactual\ndata with CovEReD and training models on them, consistency is maintained with\nminimal impact on RE performance. We release our CovEReD pipeline as well as\nRe-DocRED-CF, a dataset of counterfactual RE documents, to assist in evaluating\nand addressing inconsistency in document-level RE.", "paper_summary_zh": "許多資料集已被開發用於訓練和評估文件層級關係萃取 (RE) 模型。其中大多數是使用真實世界資料建構的。已顯示訓練於真實世界資料的 RE 模型會受到事實偏誤的影響。為了評估和解決這個問題，我們提出 CovEReD，這是一種用於文件層級關係萃取資料集的對事實資料生成方法，使用實體替換。我們首先證明訓練於事實資料的模型表現出不一致的行為：雖然它們準確地從事實資料萃取三元組，但在對事實進行修改後，它們無法萃取相同的元組。這種不一致性表明訓練於事實資料的模型依賴於虛假訊號，例如特定實體和外部知識 $\\unicode{x2013}$ 而不是輸入內容 $\\unicode{x2013}$ 來萃取三元組。我們表明，透過使用 CovEReD 生成文件層級對事實資料，並在它們上訓練模型，可以維持一致性，且對 RE 效能的影響很小。我們發布我們的 CovEReD 管線，以及 Re-DocRED-CF，一個對事實 RE 文件的資料集，以協助評估和解決文件層級 RE 中的不一致性。", "author": "Ali Modarressi et.al.", "authors": "Ali Modarressi, Abdullatif Köksal, Hinrich Schütze", "id": "2407.06699v1", "paper_url": "http://arxiv.org/abs/2407.06699v1", "repo": "null"}}