{"2412.03075": {"publish_time": "2024-12-04", "title": "ASR-EC Benchmark: Evaluating Large Language Models on Chinese ASR Error Correction", "paper_summary": "Automatic speech Recognition (ASR) is a fundamental and important task in the\nfield of speech and natural language processing. It is an inherent building\nblock in many applications such as voice assistant, speech translation, etc.\nDespite the advancement of ASR technologies in recent years, it is still\ninevitable for modern ASR systems to have a substantial number of erroneous\nrecognition due to environmental noise, ambiguity, etc. Therefore, the error\ncorrection in ASR is crucial.\n  Motivated by this, this paper studies ASR error correction in the Chinese\nlanguage, which is one of the most popular languages and enjoys a large number\nof users in the world. We first create a benchmark dataset named \\emph{ASR-EC}\nthat contains a wide spectrum of ASR errors generated by industry-grade ASR\nsystems. To the best of our knowledge, it is the first Chinese ASR error\ncorrection benchmark. Then, inspired by the recent advances in \\emph{large\nlanguage models (LLMs)}, we investigate how to harness the power of LLMs to\ncorrect ASR errors. We apply LLMs to ASR error correction in three paradigms.\nThe first paradigm is prompting, which is further categorized as zero-shot,\nfew-shot, and multi-step. The second paradigm is finetuning, which finetunes\nLLMs with ASR error correction data. The third paradigm is multi-modal\naugmentation, which collectively utilizes the audio and ASR transcripts for\nerror correction. Extensive experiments reveal that prompting is not effective\nfor ASR error correction. Finetuning is effective only for a portion of LLMs.\nMulti-modal augmentation is the most effective method for error correction and\nachieves state-of-the-art performance.", "paper_summary_zh": "<paragraph>自動語音辨識 (ASR) 是語音與自然語言處理領域中的一項基本且重要的任務。它是許多應用程式中固有的組成部分，例如語音助理、語音翻譯等。儘管近年來 ASR 技術進步，但現代 ASR 系統仍難免會因環境噪音、歧義等因素產生大量錯誤辨識。因此，ASR 中的錯誤校正至關重要。\n受此啟發，本文研究了中文 ASR 錯誤校正，中文是最流行的語言之一，在全球擁有大量的使用者。我們首先建立了一個名為 \\emph{ASR-EC} 的基準資料集，其中包含由產業級 ASR 系統產生的各種 ASR 錯誤。據我們所知，這是第一個中文 ASR 錯誤校正基準。接著，受到 \\emph{大型語言模型 (LLM)} 近期進展的啟發，我們探討如何利用 LLM 的力量來校正 ASR 錯誤。我們將 LLM 應用於 ASR 錯誤校正的三種範例。第一個範例是提示，進一步分類為零次學習、少次學習和多步驟。第二個範例是微調，使用 ASR 錯誤校正資料微調 LLM。第三個範例是多模式擴充，共同利用音訊和 ASR 轉錄進行錯誤校正。大量的實驗顯示，提示對於 ASR 錯誤校正無效。微調僅對部分 LLM 有效。多模式擴充是錯誤校正最有效的方法，並達到了最先進的效能。</paragraph>", "author": "Victor Junqiu Wei et.al.", "authors": "Victor Junqiu Wei, Weicheng Wang, Di Jiang, Yuanfeng Song, Lu Wang", "id": "2412.03075v1", "paper_url": "http://arxiv.org/abs/2412.03075v1", "repo": "null"}}