{"2405.19041": {"publish_time": "2024-05-29", "title": "BLSP-KD: Bootstrapping Language-Speech Pre-training via Knowledge Distillation", "paper_summary": "Recent end-to-end approaches have shown promise in extending large language\nmodels (LLMs) to speech inputs, but face limitations in directly assessing and\noptimizing alignment quality and fail to achieve fine-grained alignment due to\nspeech-text length mismatch. We introduce BLSP-KD, a novel approach for\nBootstrapping Language-Speech Pretraining via Knowledge Distillation, which\naddresses these limitations through two key techniques. First, it optimizes\nspeech-text alignment by minimizing the divergence between the LLM's next-token\nprediction distributions for speech and text inputs using knowledge\ndistillation. Second, it employs a continuous-integrate-andfire strategy to\nsegment speech into tokens that correspond one-to-one with text tokens,\nenabling fine-grained alignment. We also introduce Partial LoRA (PLoRA), a new\nadaptation method supporting LLM finetuning for speech inputs under knowledge\ndistillation. Quantitative evaluation shows that BLSP-KD outperforms previous\nend-to-end baselines and cascaded systems with comparable scale of parameters,\nfacilitating general instruction-following capabilities for LLMs with speech\ninputs. This approach provides new possibilities for extending LLMs to spoken\nlanguage interactions.", "paper_summary_zh": "最近的端到端方法已显示出将大型语言模型 (LLM) 扩展到语音输入方面的前景，但在直接评估和优化对齐质量方面面临限制，并且由于语音文本长度不匹配而无法实现细粒度对齐。我们引入了 BLSP-KD，这是一种通过知识蒸馏引导语言语音预训练的新方法，它通过两种关键技术解决了这些限制。首先，它通过使用知识蒸馏最小化 LLM 的语音和文本输入的下一个标记预测分布之间的差异来优化语音文本对齐。其次，它采用连续集成和触发策略将语音细分为与文本标记一一对应的标记，从而实现细粒度对齐。我们还引入了部分 LoRA (PLoRA)，这是一种新的自适应方法，支持在知识蒸馏下对 LLM 微调语音输入。定量评估表明，BLSP-KD 优于具有可比参数规模的先前端到端基线和级联系统，从而促进了 LLM 具有语音输入的一般指令遵循能力。这种方法为将 LLM 扩展到口语交互提供了新的可能性。", "author": "Chen Wang et.al.", "authors": "Chen Wang, Minpeng Liao, Zhongqiang Huang, Jiajun Zhang", "id": "2405.19041v1", "paper_url": "http://arxiv.org/abs/2405.19041v1", "repo": "null"}}