{"2501.01246": {"publish_time": "2025-01-02", "title": "Large Language Model-Enhanced Symbolic Reasoning for Knowledge Base Completion", "paper_summary": "Integrating large language models (LLMs) with rule-based reasoning offers a\npowerful solution for improving the flexibility and reliability of Knowledge\nBase Completion (KBC). Traditional rule-based KBC methods offer verifiable\nreasoning yet lack flexibility, while LLMs provide strong semantic\nunderstanding yet suffer from hallucinations. With the aim of combining LLMs'\nunderstanding capability with the logical and rigor of rule-based approaches,\nwe propose a novel framework consisting of a Subgraph Extractor, an LLM\nProposer, and a Rule Reasoner. The Subgraph Extractor first samples subgraphs\nfrom the KB. Then, the LLM uses these subgraphs to propose diverse and\nmeaningful rules that are helpful for inferring missing facts. To effectively\navoid hallucination in LLMs' generations, these proposed rules are further\nrefined by a Rule Reasoner to pinpoint the most significant rules in the KB for\nKnowledge Base Completion. Our approach offers several key benefits: the\nutilization of LLMs to enhance the richness and diversity of the proposed rules\nand the integration with rule-based reasoning to improve reliability. Our\nmethod also demonstrates strong performance across diverse KB datasets,\nhighlighting the robustness and generalizability of the proposed framework.", "paper_summary_zh": "將大型語言模型 (LLM) 與基於規則的推理整合，提供了一個強大的解決方案，用於提升知識庫完成 (KBC) 的彈性和可靠性。傳統的基於規則的 KBC 方法提供可驗證的推理，但缺乏彈性，而 LLM 提供強大的語義理解，但會產生幻覺。為了結合 LLM 的理解能力與基於規則方法的邏輯和嚴謹性，我們提出了一個創新的架構，包含一個子圖萃取器、一個 LLM 建議器和一個規則推理器。子圖萃取器首先從 KB 中取樣子圖。然後，LLM 使用這些子圖提出多樣且有意義的規則，有助於推論出遺失的事實。為了有效避免 LLM 生成中的幻覺，這些提出的規則會進一步由規則推理器提煉，以找出 KB 中對知識庫完成最重要的規則。我們的做法提供了幾個關鍵的好處：利用 LLM 來加強所提出規則的豐富性和多樣性，以及與基於規則的推理整合以提升可靠性。我們的做法也展現出在各種 KB 資料集中的強勁效能，突顯了所提出架構的穩健性和概括性。", "author": "Qiyuan He et.al.", "authors": "Qiyuan He, Jianfei Yu, Wenya Wang", "id": "2501.01246v1", "paper_url": "http://arxiv.org/abs/2501.01246v1", "repo": "null"}}