{"2409.18297": {"publish_time": "2024-09-26", "title": "Flat'n'Fold: A Diverse Multi-Modal Dataset for Garment Perception and Manipulation", "paper_summary": "We present Flat'n'Fold, a novel large-scale dataset for garment manipulation\nthat addresses critical gaps in existing datasets. Comprising 1,212 human and\n887 robot demonstrations of flattening and folding 44 unique garments across 8\ncategories, Flat'n'Fold surpasses prior datasets in size, scope, and diversity.\nOur dataset uniquely captures the entire manipulation process from crumpled to\nfolded states, providing synchronized multi-view RGB-D images, point clouds,\nand action data, including hand or gripper positions and rotations. We quantify\nthe dataset's diversity and complexity compared to existing benchmarks and show\nthat our dataset features natural and diverse manipulations of real-world\ndemonstrations of human and robot demonstrations in terms of visual and action\ninformation. To showcase Flat'n'Fold's utility, we establish new benchmarks for\ngrasping point prediction and subtask decomposition. Our evaluation of\nstate-of-the-art models on these tasks reveals significant room for\nimprovement. This underscores Flat'n'Fold's potential to drive advances in\nrobotic perception and manipulation of deformable objects. Our dataset can be\ndownloaded at https://cvas-ug.github.io/flat-n-fold", "paper_summary_zh": "<paragraph>我們提出 Flat'n'Fold，這是一個用於服裝操作的新型大型數據集，它解決了現有數據集中的關鍵差距。Flat'n'Fold 包含 1,212 個真人示範和 887 個機器人示範，展示了 8 個類別中 44 件獨特服裝的攤平和摺疊過程，在規模、範圍和多樣性方面都超越了之前的數據集。我們的數據集獨特地捕捉了從皺巴巴到摺疊狀態的整個操作過程，提供了同步的多視圖 RGB-D 影像、點雲和動作數據，包括手部或夾具的位置和旋轉。我們量化了數據集的多樣性和複雜性，並與現有的基準進行比較，結果顯示我們的數據集在視覺和動作資訊方面具有自然且多樣化的真人和機器人示範操作。為了展示 Flat'n'Fold 的效用，我們為抓取點預測和子任務分解建立了新的基準。我們對這些任務中最先進模型的評估顯示出有顯著的改進空間。這突顯了 Flat'n'Fold 在推動可變形物體的機器人感知和操作方面取得進展的潛力。我們的數據集可以在 https://cvas-ug.github.io/flat-n-fold 下載</paragraph>", "author": "Lipeng Zhuang et.al.", "authors": "Lipeng Zhuang, Shiyu Fan, Yingdong Ru, Florent Audonnet, Paul Henderson, Gerardo Aragon-Camarasa", "id": "2409.18297v1", "paper_url": "http://arxiv.org/abs/2409.18297v1", "repo": "null"}}