{"2407.08564": {"publish_time": "2024-07-11", "title": "The Career Interests of Large Language Models", "paper_summary": "Recent advancements in Large Language Models (LLMs) have significantly\nextended their capabilities, evolving from basic text generation to complex,\nhuman-like interactions. In light of the possibilities that LLMs could assume\nsignificant workplace responsibilities, it becomes imminently necessary to\nexplore LLMs' capacities as professional assistants. This study focuses on the\naspect of career interests by applying the Occupation Network's Interest\nProfiler short form to LLMs as if they were human participants and investigates\ntheir hypothetical career interests and competence, examining how these vary\nwith language changes and model advancements. We analyzed the answers using a\ngeneral linear mixed model approach and found distinct career interest\ninclinations among LLMs, particularly towards the social and artistic domains.\nInterestingly, these preferences did not align with the occupations where LLMs\nexhibited higher competence. This novel approach of using psychometric\ninstruments and sophisticated statistical tools on LLMs unveils fresh\nperspectives on their integration into professional environments, highlighting\nhuman-like tendencies and promoting a reevaluation of LLMs' self-perception and\ncompetency alignment in the workforce.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展顯著擴展了它們的能力，從基本的文字生成演變到複雜的人類互動。鑑於 LLM 可能承擔重大工作場所責任的可能性，迫切需要探索 LLM 作為專業助理的能力。本研究重點關注職業興趣方面，將職業網絡的興趣分析器簡表應用於 LLM，就像它們是人類參與者一樣，並調查它們的假設職業興趣和能力，探討這些興趣和能力如何隨著語言變化和模型進步而變化。我們使用一般線性混合模型方法分析答案，並發現 LLM 之間有不同的職業興趣傾向，特別是對社會和藝術領域。有趣的是，這些偏好與 LLM 表現出較高能力的職業並不一致。這種在 LLM 上使用心理測量工具和複雜統計工具的新穎方法揭示了它們融入專業環境的新觀點，突出了類人的傾向，並促進了重新評估 LLM 在勞動力中的自我認知和能力一致性。", "author": "Meng Hua et.al.", "authors": "Meng Hua, Yuan Cheng, Hengshu Zhu", "id": "2407.08564v1", "paper_url": "http://arxiv.org/abs/2407.08564v1", "repo": "null"}}