{"2407.02351": {"publish_time": "2024-07-02", "title": "Generative Large Language Models in Automated Fact-Checking: A Survey", "paper_summary": "The dissemination of false information across online platforms poses a\nserious societal challenge, necessitating robust measures for information\nverification. While manual fact-checking efforts are still instrumental, the\ngrowing volume of false information requires automated methods. Large language\nmodels (LLMs) offer promising opportunities to assist fact-checkers, leveraging\nLLM's extensive knowledge and robust reasoning capabilities. In this survey\npaper, we investigate the utilization of generative LLMs in the realm of\nfact-checking, illustrating various approaches that have been employed and\ntechniques for prompting or fine-tuning LLMs. By providing an overview of\nexisting approaches, this survey aims to improve the understanding of utilizing\nLLMs in fact-checking and to facilitate further progress in LLMs' involvement\nin this process.", "paper_summary_zh": "在線上平台上散布虛假訊息會造成嚴重的社會問題，因此需要採取強而有力的措施來驗證資訊。雖然手動查核事實的工作仍至關重要，但虛假訊息的數量與日俱增，因此需要自動化的方法。大型語言模型 (LLM) 提供了協助查核人員的絕佳機會，它能運用 LLM 廣泛的知識和強大的推理能力。在這篇調查報告中，我們研究了在查核事實領域中使用生成式 LLM 的情況，說明了已採用的各種方法，以及提示或微調 LLM 的技術。透過提供現有方法的概觀，這項調查旨在增進對在查核事實中使用 LLM 的理解，並促進 LLM 在此過程中進一步參與。", "author": "Ivan Vykopal et.al.", "authors": "Ivan Vykopal, Matúš Pikuliak, Simon Ostermann, Marián Šimko", "id": "2407.02351v1", "paper_url": "http://arxiv.org/abs/2407.02351v1", "repo": "null"}}