{"2410.07103": {"publish_time": "2024-10-09", "title": "Unleashing Multi-Hop Reasoning Potential in Large Language Models through Repetition of Misordered Context", "paper_summary": "Multi-hop reasoning, which requires multi-step reasoning based on the\nsupporting documents within a given context, remains challenging for large\nlanguage models (LLMs). LLMs often struggle to filter out irrelevant documents\nwithin the context, and their performance is sensitive to the position of\nsupporting documents within that context. In this paper, we identify an\nadditional challenge: LLMs' performance is also sensitive to the order in which\nthe supporting documents are presented. We refer to this as the misordered\ncontext problem. To address this issue, we propose a simple yet effective\nmethod called context repetition (CoRe), which involves prompting the model by\nrepeatedly presenting the context to ensure the supporting documents are\npresented in the optimal order for the model. Using CoRe, we improve the F1\nscore by up to 30%p on multi-hop QA tasks and increase accuracy by up to 70%p\non a synthetic task. Additionally, CoRe helps mitigate the well-known\n\"lost-in-the-middle\" problem in LLMs and can be effectively combined with\nretrieval-based approaches utilizing Chain-of-Thought (CoT) reasoning.", "paper_summary_zh": "多跳推理需要根據給定脈絡中的支援文件進行多步驟推理，這對大型語言模型 (LLM) 來說仍然具有挑戰性。LLM 經常難以在脈絡中過濾掉無關的文件，而且它們的效能會受到支援文件在該脈絡中的位置影響。在本文中，我們找出另一個挑戰：LLM 的效能也會受到支援文件呈現順序的影響。我們將此稱為順序錯誤的脈絡問題。為了解決這個問題，我們提出一個簡單但有效的方法，稱為脈絡重複 (CoRe)，其中涉及透過重複呈現脈絡來提示模型，以確保支援文件以模型的最佳順序呈現。使用 CoRe，我們將多跳問答任務的 F1 分數提高了 30%，並在合成任務中將準確度提高了 70%。此外，CoRe 有助於減輕 LLM 中眾所周知的「迷失在中間」問題，並且可以有效地與利用思想鏈 (CoT) 推理的基於檢索的方法結合使用。", "author": "Sangwon Yu et.al.", "authors": "Sangwon Yu, Ik-hwan Kim, Jongyoon Song, Saehyung Lee, Junsung Park, Sungroh Yoon", "id": "2410.07103v1", "paper_url": "http://arxiv.org/abs/2410.07103v1", "repo": "null"}}