{"2411.12619": {"publish_time": "2024-11-19", "title": "Leveraging Virtual Reality and AI Tutoring for Language Learning: A Case Study of a Virtual Campus Environment with OpenAI GPT Integration with Unity 3D", "paper_summary": "This paper presents a new approach to multiple language learning, with Hindi\nthe language to be learnt in our case, by using the integration of virtual\nreality environments and AI enabled tutoring systems using OpenAIs GPT api\ncalls. We have developed a scenario which has a virtual campus environment\nusing Unity which focuses on a detailed representation of our universitys\nbuildings 11th floor, where most of the cultural and technological activities\ntake place. Within this virtual environment that we have created, we have an AI\ntutor powered by OpenAI's GPT model which was called using an api which moves\naround with the user. This provided language learning support in Hindi, as GPT\nis able to take care of language translation. Our approach mainly involves\nutilising speech to text, text to text conversion and text to speech\ncapabilities to facilitate real time interaction between users and the AI tutor\nin the presence of internet. This research demonstrates the use of combining VR\ntechnology with AI tutoring for immersive language learning experiences and\nprovides interaction.", "paper_summary_zh": "這篇論文提出多語言學習的新方法，以印地語為例，利用虛擬實境環境的整合和使用 OpenAI GPT API 呼叫的人工智慧輔導系統。我們開發了一個場景，其中使用 Unity 建立一個虛擬校園環境，重點在於詳細呈現我們大學 11 樓的建築，那裡舉辦了大部分的文化和技術活動。在我們建立的這個虛擬環境中，我們有一個由 OpenAI 的 GPT 模型提供動力的 AI 導師，它使用 API 呼叫，並與使用者一起移動。這提供了印地語的語言學習支援，因為 GPT 能夠處理語言翻譯。我們的方法主要包括利用語音轉文字、文字轉文字和文字轉語音的能力，以促進使用者和 AI 導師在網際網路環境中進行即時互動。這項研究展示了結合 VR 技術與 AI 輔導以提供沉浸式語言學習體驗和互動的用途。", "author": "Adithya TG et.al.", "authors": "Adithya TG, Abhinavaram N, Gowri Srinivasa", "id": "2411.12619v1", "paper_url": "http://arxiv.org/abs/2411.12619v1", "repo": "null"}}