{"2407.02477": {"publish_time": "2024-07-02", "title": "Understanding Alignment in Multimodal LLMs: A Comprehensive Study", "paper_summary": "Preference alignment has become a crucial component in enhancing the\nperformance of Large Language Models (LLMs), yet its impact in Multimodal Large\nLanguage Models (MLLMs) remains comparatively underexplored. Similar to\nlanguage models, MLLMs for image understanding tasks encounter challenges like\nhallucination. In MLLMs, hallucination can occur not only by stating incorrect\nfacts but also by producing responses that are inconsistent with the image\ncontent. A primary objective of alignment for MLLMs is to encourage these\nmodels to align responses more closely with image information. Recently,\nmultiple works have introduced preference datasets for MLLMs and examined\ndifferent alignment methods, including Direct Preference Optimization (DPO) and\nProximal Policy Optimization (PPO). However, due to variations in datasets,\nbase model types, and alignment methods, it remains unclear which specific\nelements contribute most significantly to the reported improvements in these\nworks. In this paper, we independently analyze each aspect of preference\nalignment in MLLMs. We start by categorizing the alignment algorithms into two\ngroups, offline (such as DPO), and online (such as online-DPO), and show that\ncombining offline and online methods can improve the performance of the model\nin certain scenarios. We review a variety of published multimodal preference\ndatasets and discuss how the details of their construction impact model\nperformance. Based on these insights, we introduce a novel way of creating\nmultimodal preference data called Bias-Driven Hallucination Sampling (BDHS)\nthat needs neither additional annotation nor external models, and show that it\ncan achieve competitive performance to previously published alignment work for\nmultimodal models across a range of benchmarks.", "paper_summary_zh": "偏好對齊已成為增強大型語言模型 (LLM) 效能的關鍵組成部分，但其在多模態大型語言模型 (MLLM) 中的影響力仍相對未被充分探討。與語言模型類似，用於影像理解任務的 MLLM 會遇到幻覺等挑戰。在 MLLM 中，幻覺不僅可能透過陳述不正確的事實產生，還可能透過產生與影像內容不一致的回應產生。MLLM 對齊的主要目標是鼓勵這些模型將回應與影像資訊更緊密地對齊。最近，多項研究引入了 MLLM 的偏好資料集，並檢視了不同的對齊方法，包括直接偏好最佳化 (DPO) 和近端策略最佳化 (PPO)。然而，由於資料集、基礎模型類型和對齊方法的差異，目前仍不清楚哪些特定元素對這些研究中報告的改進貢獻最大。在本文中，我們獨立分析了 MLLM 中偏好對齊的每個面向。我們首先將對齊演算法分類為兩組，離線（例如 DPO）和線上（例如線上 DPO），並展示結合離線和線上方法可以在某些情況下改善模型的效能。我們檢視了各種已發表的模態偏好資料集，並討論其建構的詳細資訊如何影響模型效能。基於這些見解，我們提出了一種創新的多模態偏好資料建立方式，稱為偏差驅動幻覺取樣 (BDHS)，它不需要額外的註解或外部模型，並展示它可以在各種基準上為多模態模型達成與先前發表的對齊研究競爭的效能。", "author": "Elmira Amirloo et.al.", "authors": "Elmira Amirloo, Jean-Philippe Fauconnier, Christoph Roesmann, Christian Kerl, Rinu Boney, Yusu Qian, Zirui Wang, Afshin Dehghan, Yinfei Yang, Zhe Gan, Peter Grasch", "id": "2407.02477v1", "paper_url": "http://arxiv.org/abs/2407.02477v1", "repo": "null"}}