{"2406.17537": {"publish_time": "2024-06-25", "title": "SincVAE: a New Approach to Improve Anomaly Detection on EEG Data Using SincNet and Variational Autoencoder", "paper_summary": "Over the past few decades, electroencephalography (EEG) monitoring has become\na pivotal tool for diagnosing neurological disorders, particularly for\ndetecting seizures. Epilepsy, one of the most prevalent neurological diseases\nworldwide, affects approximately the 1 \\% of the population. These patients\nface significant risks, underscoring the need for reliable, continuous seizure\nmonitoring in daily life. Most of the techniques discussed in the literature\nrely on supervised Machine Learning (ML) methods. However, the challenge of\naccurately labeling variations in epileptic EEG waveforms complicates the use\nof these approaches. Additionally, the rarity of ictal events introduces an\nhigh imbalancing within the data, which could lead to poor prediction\nperformance in supervised learning approaches. Instead, a semi-supervised\napproach allows to train the model only on data not containing seizures, thus\navoiding the issues related to the data imbalancing. This work proposes a\nsemi-supervised approach for detecting epileptic seizures from EEG data,\nutilizing a novel Deep Learning-based method called SincVAE. This proposal\nincorporates the learning of an ad-hoc array of bandpass filter as a first\nlayer of a Variational Autoencoder (VAE), potentially eliminating the\npreprocessing stage where informative band frequencies are identified and\nisolated. Results indicate that SincVAE improves seizure detection in EEG data\nand is capable of identifying early seizures during the preictal stage as well\nas monitoring patients throughout the postictal stage.", "paper_summary_zh": "在過去的幾十年中，腦電圖 (EEG) 監控已成為診斷神經疾病的重要工具，特別是對於檢測癲癇發作。癲癇是全球最普遍的神經疾病之一，影響著大約 1% 的人口。這些患者面臨著重大的風險，這凸顯了在日常生活中進行可靠、持續的癲癇發作監控的必要性。文獻中討論的大多數技術都依賴於監督式機器學習 (ML) 方法。然而，準確標記癲癇 EEG 波形變化的挑戰使得這些方法的使用變得複雜。此外，發作事件的罕見性導致數據中存在嚴重的失衡，這可能會導致監督式學習方法的預測效果不佳。相反，半監督式方法允許僅使用不包含癲癇發作的數據來訓練模型，從而避免與數據失衡相關的問題。這項工作提出了一種半監督式方法，用於從 EEG 數據中檢測癲癇發作，利用一種稱為 SincVAE 的新穎深度學習方法。此提案將學習一組特別設計的帶通濾波器作為變分自編碼器 (VAE) 的第一層，從而潛在地消除了識別和分離信息頻帶的預處理階段。結果表明，SincVAE 改善了 EEG 數據中的癲癇發作檢測，並且能夠在發作前階段識別早期癲癇發作，並在發作後階段監控患者。", "author": "Andrea Pollastro et.al.", "authors": "Andrea Pollastro, Francesco Isgrò, Roberto Prevete", "id": "2406.17537v1", "paper_url": "http://arxiv.org/abs/2406.17537v1", "repo": "null"}}