{"2502.13780": {"publish_time": "2025-02-19", "title": "Translation in the Hands of Many:Centering Lay Users in Machine Translation Interactions", "paper_summary": "Converging societal and technical factors have transformed language\ntechnologies into user-facing applications employed across languages. Machine\nTranslation (MT) has become a global tool, with cross-lingual services now also\nsupported by dialogue systems powered by multilingual Large Language Models\n(LLMs). This accessibility has expanded MT's reach to a vast base of lay users,\noften with little to no expertise in the languages or the technology itself.\nDespite this, the understanding of MT consumed by this diverse group of users\n-- their needs, experiences, and interactions with these systems -- remains\nlimited. This paper traces the shift in MT user profiles, focusing on\nnon-expert users and how their engagement with these systems may change with\nLLMs. We identify three key factors -- usability, trust, and literacy -- that\nshape these interactions and must be addressed to align MT with user needs. By\nexploring these dimensions, we offer insights to guide future MT with a\nuser-centered approach.", "paper_summary_zh": "社會和技術因素的匯聚，已將語言技術轉變為跨語言應用的使用者介面應用程式。機器翻譯 (MT) 已成為全球性工具，跨語言服務現也獲得由多語言大型語言模型 (LLM) 提供動力的對話系統支援。這種易用性已將 MT 的觸角延伸到廣大的非專業使用者，他們通常對語言或技術本身知之甚少，甚至一無所知。儘管如此，這群多元使用者對 MT 的理解——他們的需求、經驗，以及與這些系統的互動——仍然有限。本文追蹤 MT 使用者輪廓的轉變，著重於非專業使用者，以及他們與這些系統的互動如何隨著 LLM 而改變。我們找出三項關鍵因素——可用性、信任度和識字能力——這些因素形塑了這些互動，且必須加以處理，才能讓 MT 與使用者需求保持一致。透過探討這些面向，我們提供見解，以使用者為中心的方法引導未來的 MT。", "author": "Beatrice Savoldi et.al.", "authors": "Beatrice Savoldi, Alan Ramponi, Matteo Negri, Luisa Bentivogli", "id": "2502.13780v1", "paper_url": "http://arxiv.org/abs/2502.13780v1", "repo": "null"}}