{"2409.03597": {"publish_time": "2024-09-05", "title": "Multimodal Laryngoscopic Video Analysis for Assisted Diagnosis of Vocal Cord Paralysis", "paper_summary": "This paper presents the Multimodal Analyzing System for Laryngoscope (MASL),\na system that combines audio and video data to automatically extract key\nsegments and metrics from laryngeal videostroboscopic videos for clinical\nassessment. MASL integrates glottis detection with keyword spotting to analyze\npatient vocalizations and refine video highlights for better inspection of\nvocal cord movements. The system includes a strobing video extraction module\nthat identifies frames by analyzing hue, saturation, and value fluctuations.\nMASL also provides effective metrics for vocal cord paralysis detection,\nemploying a two-stage glottis segmentation process using U-Net followed by\ndiffusion-based refinement to reduce false positives. Instead of glottal area\nwaveforms, MASL estimates anterior glottic angle waveforms (AGAW) from glottis\nmasks, evaluating both left and right vocal cords to detect unilateral vocal\ncord paralysis (UVFP). By comparing AGAW variances, MASL distinguishes between\nleft and right paralysis. Ablation studies and experiments on public and\nreal-world datasets validate MASL's segmentation module and demonstrate its\nability to provide reliable metrics for UVFP diagnosis.", "paper_summary_zh": "本文提出了喉镜多模态分析系统 (MASL)，\n该系统结合音频和视频数据，自动从喉部视频频闪镜视频中提取关键\n片段和指标，用于临床评估。MASL 将声门检测与关键词识别相结合，以分析\n患者发声并细化视频重点，以便更好地检查声带运动。该系统包括一个频闪视频提取模块，\n该模块通过分析色相、饱和度和值波动来识别帧。\nMASL 还为声带麻痹检测提供了有效的指标，\n采用两阶段声门分割过程，使用 U-Net，然后进行基于扩散的细化以减少误报。MASL 不使用声门面积波形，而是从声门掩模中估计前声门角波形 (AGAW)，评估左右声带以检测单侧声带麻痹 (UVFP)。通过比较 AGAW 方差，MASL 区分左右麻痹。消融研究和对公共和真实世界数据集的实验验证了 MASL 的分割模块，并证明了其提供可靠的 UVFP 诊断指标的能力。", "author": "Yucong Zhang et.al.", "authors": "Yucong Zhang, Xin Zou, Jinshan Yang, Wenjun Chen, Faya Liang, Ming Li", "id": "2409.03597v1", "paper_url": "http://arxiv.org/abs/2409.03597v1", "repo": "null"}}