{"2502.14523": {"publish_time": "2025-02-20", "title": "Generative adversarial networks vs large language models: a comparative study on synthetic tabular data generation", "paper_summary": "We propose a new framework for zero-shot generation of synthetic tabular\ndata. Using the large language model (LLM) GPT-4o and plain-language prompting,\nwe demonstrate the ability to generate high-fidelity tabular data without\ntask-specific fine-tuning or access to real-world data (RWD) for pre-training.\nTo benchmark GPT-4o, we compared the fidelity and privacy of LLM-generated\nsynthetic data against data generated with the conditional tabular generative\nadversarial network (CTGAN), across three open-access datasets: Iris, Fish\nMeasurements, and Real Estate Valuation. Despite the zero-shot approach, GPT-4o\noutperformed CTGAN in preserving means, 95% confidence intervals, bivariate\ncorrelations, and data privacy of RWD, even at amplified sample sizes. Notably,\ncorrelations between parameters were consistently preserved with appropriate\ndirection and strength. However, refinement is necessary to better retain\ndistributional characteristics. These findings highlight the potential of LLMs\nin tabular data synthesis, offering an accessible alternative to generative\nadversarial networks and variational autoencoders.", "paper_summary_zh": "我們提出一個新的架構，用於合成表格資料的零次學習產生。利用大型語言模型 (LLM) GPT-4o 和自然語言提示，我們證明了在沒有特定任務微調或取得真實世界資料 (RWD) 進行預訓練的情況下，產生高保真表格資料的能力。為了對 GPT-4o 進行基準測試，我們比較了 LLM 生成的合成資料與使用條件表格生成對抗網路 (CTGAN) 生成的資料在保真度和隱私性方面的表現，比較對象是三個開放取用的資料集：鳶尾花、魚類測量和房地產估價。儘管採用零次學習方法，GPT-4o 在保留平均值、95% 信賴區間、二元關聯和 RWD 的資料隱私方面都優於 CTGAN，即使在擴增的樣本大小下也是如此。值得注意的是，參數之間的關聯始終保持適當的方向和強度。然而，需要進行改進以更好地保留分佈特徵。這些發現突顯了 LLM 在表格資料合成中的潛力，為生成對抗網路和變異自動編碼器提供了可行的替代方案。", "author": "Austin A. Barr et.al.", "authors": "Austin A. Barr, Robert Rozman, Eddie Guo", "id": "2502.14523v1", "paper_url": "http://arxiv.org/abs/2502.14523v1", "repo": "null"}}