{"2407.00105": {"publish_time": "2024-06-27", "title": "Multiple Kronecker RLS fusion-based link propagation for drug-side effect prediction", "paper_summary": "Drug-side effect prediction has become an essential area of research in the\nfield of pharmacology. As the use of medications continues to rise, so does the\nimportance of understanding and mitigating the potential risks associated with\nthem. At present, researchers have turned to data-driven methods to predict\ndrug-side effects. Drug-side effect prediction is a link prediction problem,\nand the related data can be described from various perspectives. To process\nthese kinds of data, a multi-view method, called Multiple Kronecker RLS\nfusion-based link propagation (MKronRLSF-LP), is proposed. MKronRLSF-LP extends\nthe Kron-RLS by finding the consensus partitions and multiple graph Laplacian\nconstraints in the multi-view setting. Both of these multi-view settings\ncontribute to a higher quality result. Extensive experiments have been\nconducted on drug-side effect datasets, and our empirical results provide\nevidence that our approach is effective and robust.", "paper_summary_zh": "藥物副作用預測已成為藥理學領域的研究重點。隨著藥物使用持續增加，了解和減輕與藥物相關的潛在風險也變得越來越重要。目前，研究人員已轉向資料驅動的方法來預測藥物副作用。藥物副作用預測是一個連結預測問題，其相關資料可以從不同的角度來描述。為了處理這些類型的資料，提出了一種稱為多重 Kronecker RLS 融合式連結傳播 (MKronRLSF-LP) 的多視角方法。MKronRLSF-LP 透過在多視角設定中找出共識分割和多重圖拉普拉斯約束，來延伸 Kron-RLS。這兩個多視角設定都有助於提升結果品質。我們已在藥物副作用資料集上進行廣泛的實驗，我們的實證結果證明了我們的方法有效且強健。", "author": "Yuqing Qian et.al.", "authors": "Yuqing Qian, Ziyu Zheng, Prayag Tiwari, Yijie Ding, Quan Zou", "id": "2407.00105v1", "paper_url": "http://arxiv.org/abs/2407.00105v1", "repo": "null"}}