{"2406.07229": {"publish_time": "2024-06-11", "title": "Improving Commonsense Bias Classification by Mitigating the Influence of Demographic Terms", "paper_summary": "Understanding commonsense knowledge is crucial in the field of Natural\nLanguage Processing (NLP). However, the presence of demographic terms in\ncommonsense knowledge poses a potential risk of compromising the performance of\nNLP models. This study aims to investigate and propose methods for enhancing\nthe performance and effectiveness of a commonsense polarization classifier by\nmitigating the influence of demographic terms. Three methods are introduced in\nthis paper: (1) hierarchical generalization of demographic terms (2)\nthreshold-based augmentation and (3) integration of hierarchical generalization\nand threshold-based augmentation methods (IHTA). The first method involves\nreplacing demographic terms with more general ones based on a term hierarchy\nontology, aiming to mitigate the influence of specific terms. To address the\nlimited bias-related information, the second method measures the polarization\nof demographic terms by comparing the changes in the model's predictions when\nthese terms are masked versus unmasked. This method augments commonsense\nsentences containing terms with high polarization values by replacing their\npredicates with synonyms generated by ChatGPT. The third method combines the\ntwo approaches, starting with threshold-based augmentation followed by\nhierarchical generalization. The experiments show that the first method\nincreases the accuracy over the baseline by 2.33%, and the second one by 0.96%\nover standard augmentation methods. The IHTA techniques yielded an 8.82% and\n9.96% higher accuracy than threshold-based and standard augmentation methods,\nrespectively.", "paper_summary_zh": "<paragraph>在自然語言處理 (NLP) 領域中，理解常識知識至關重要。然而，常識知識中人口統計術語的存在可能會對 NLP 模型的效能造成損害。本研究旨在探討並提出方法，以透過減輕人口統計術語的影響來增強常識極化分類器的效能和有效性。本文介紹了三種方法：(1) 人口統計術語的階層概括 (2) 基於閾值的擴充，以及 (3) 階層概括與基於閾值的擴充方法 (IHTA) 的整合。第一種方法涉及根據術語階層本體，以更通用的術語取代人口統計術語，旨在減輕特定術語的影響。為了解決有限的偏見相關資訊，第二種方法透過比較在這些術語被遮蔽與未遮蔽時模型預測的變化，來衡量人口統計術語的極化。此方法透過將其謂詞替換為由 ChatGPT 生成的同義詞，來擴充包含極化值高的術語的常識句子。第三種方法結合了兩種方法，從基於閾值的擴充開始，接著進行階層概括。實驗顯示，第一種方法將準確度提升了 2.33%，而第二種方法則比標準擴充方法提升了 0.96%。IHTA 技術的準確度分別比基於閾值的擴充方法和標準擴充方法高出 8.82% 和 9.96%。</paragraph>", "author": "JinKyu Lee et.al.", "authors": "JinKyu Lee, Jihie Kim", "id": "2406.07229v1", "paper_url": "http://arxiv.org/abs/2406.07229v1", "repo": "null"}}