{"2409.10504": {"publish_time": "2024-09-16", "title": "DILA: Dictionary Label Attention for Mechanistic Interpretability in High-dimensional Multi-label Medical Coding Prediction", "paper_summary": "Predicting high-dimensional or extreme multilabels, such as in medical\ncoding, requires both accuracy and interpretability. Existing works often rely\non local interpretability methods, failing to provide comprehensive\nexplanations of the overall mechanism behind each label prediction within a\nmultilabel set. We propose a mechanistic interpretability module called\nDIctionary Label Attention (\\method) that disentangles uninterpretable dense\nembeddings into a sparse embedding space, where each nonzero element (a\ndictionary feature) represents a globally learned medical concept. Through\nhuman evaluations, we show that our sparse embeddings are more human\nunderstandable than its dense counterparts by at least 50 percent. Our\nautomated dictionary feature identification pipeline, leveraging large language\nmodels (LLMs), uncovers thousands of learned medical concepts by examining and\nsummarizing the highest activating tokens for each dictionary feature. We\nrepresent the relationships between dictionary features and medical codes\nthrough a sparse interpretable matrix, enhancing the mechanistic and global\nunderstanding of the model's predictions while maintaining competitive\nperformance and scalability without extensive human annotation.", "paper_summary_zh": "在醫療編碼等領域中，預測高維度或極端的多標籤需要準確性和可解釋性。現有的工作通常依賴於局部可解釋性方法，無法對多標籤集中每個標籤預測背後的整體機制提供全面的解釋。我們提出了一個稱為字典標籤注意力的機械可解釋性模組（\\method），它將不可解釋的稠密嵌入解開成一個稀疏嵌入空間，其中每個非零元素（一個字典特徵）代表一個全局學習的醫療概念。透過人為評估，我們表明我們的稀疏嵌入比其稠密對應物更易於人類理解，至少提高了 50%。我們自動化的字典特徵識別管道利用大型語言模型 (LLM)，透過檢查和總結每個字典特徵的最高激活代碼，揭示了數千個學習到的醫療概念。我們透過一個稀疏的可解釋矩陣來表示字典特徵與醫療代碼之間的關係，增強了對模型預測的機械和全局理解，同時在沒有廣泛的人工註解的情況下，保持了競爭效能和可擴充性。", "author": "John Wu et.al.", "authors": "John Wu, David Wu, Jimeng Sun", "id": "2409.10504v1", "paper_url": "http://arxiv.org/abs/2409.10504v1", "repo": "null"}}