{"2412.07116": {"publish_time": "2024-12-10", "title": "A Review of Human Emotion Synthesis Based on Generative Technology", "paper_summary": "Human emotion synthesis is a crucial aspect of affective computing. It\ninvolves using computational methods to mimic and convey human emotions through\nvarious modalities, with the goal of enabling more natural and effective\nhuman-computer interactions. Recent advancements in generative models, such as\nAutoencoders, Generative Adversarial Networks, Diffusion Models, Large Language\nModels, and Sequence-to-Sequence Models, have significantly contributed to the\ndevelopment of this field. However, there is a notable lack of comprehensive\nreviews in this field. To address this problem, this paper aims to address this\ngap by providing a thorough and systematic overview of recent advancements in\nhuman emotion synthesis based on generative models. Specifically, this review\nwill first present the review methodology, the emotion models involved, the\nmathematical principles of generative models, and the datasets used. Then, the\nreview covers the application of different generative models to emotion\nsynthesis based on a variety of modalities, including facial images, speech,\nand text. It also examines mainstream evaluation metrics. Additionally, the\nreview presents some major findings and suggests future research directions,\nproviding a comprehensive understanding of the role of generative technology in\nthe nuanced domain of emotion synthesis.", "paper_summary_zh": "人類情緒合成是情感運算的重要面向。它涉及使用計算方法來模擬和傳達人類情緒，透過各種方式，目標是實現更自然且有效的人機互動。生成模型的最新進展，例如自動編碼器、生成對抗網路、擴散模型、大型語言模型和序列到序列模型，已對此領域的發展做出重大貢獻。然而，此領域明顯缺乏全面的回顧。為了解決此問題，本文旨在透過提供基於生成模型的人類情緒合成最新進展的全面且系統性概述，來解決此差距。具體來說，此回顧將首先說明回顧方法、所涉及的情緒模型、生成模型的數學原理和所使用的資料集。接著，回顧涵蓋了將不同的生成模型應用於基於各種方式的情緒合成，包括臉部影像、語音和文字。它也檢視了主流的評量指標。此外，回顧提出了若干主要發現，並建議未來的研究方向，提供對生成技術在細緻的情緒合成領域中角色的全面了解。", "author": "Fei Ma et.al.", "authors": "Fei Ma, Yukan Li, Yifan Xie, Ying He, Yi Zhang, Hongwei Ren, Zhou Liu, Wei Yao, Fuji Ren, Fei Richard Yu, Shiguang Ni", "id": "2412.07116v1", "paper_url": "http://arxiv.org/abs/2412.07116v1", "repo": "null"}}