{"2410.21695": {"publish_time": "2024-10-29", "title": "CFSafety: Comprehensive Fine-grained Safety Assessment for LLMs", "paper_summary": "As large language models (LLMs) rapidly evolve, they bring significant\nconveniences to our work and daily lives, but also introduce considerable\nsafety risks. These models can generate texts with social biases or unethical\ncontent, and under specific adversarial instructions, may even incite illegal\nactivities. Therefore, rigorous safety assessments of LLMs are crucial. In this\nwork, we introduce a safety assessment benchmark, CFSafety, which integrates 5\nclassic safety scenarios and 5 types of instruction attacks, totaling 10\ncategories of safety questions, to form a test set with 25k prompts. This test\nset was used to evaluate the natural language generation (NLG) capabilities of\nLLMs, employing a combination of simple moral judgment and a 1-5 safety rating\nscale for scoring. Using this benchmark, we tested eight popular LLMs,\nincluding the GPT series. The results indicate that while GPT-4 demonstrated\nsuperior safety performance, the safety effectiveness of LLMs, including this\nmodel, still requires improvement. The data and code associated with this study\nare available on GitHub.", "paper_summary_zh": "隨著大型語言模型 (LLM) 快速發展，它們為我們的工作和日常生活帶來極大的便利，但也引入了相當大的安全風險。這些模型可以產生具有社會偏見或不道德內容的文字，並且在特定對抗性指令下，甚至可能煽動非法活動。因此，對 LLM 進行嚴格的安全評估至關重要。在這項工作中，我們引入了一個安全評估基準 CFSafety，它整合了 5 個經典安全場景和 5 種類型的指令攻擊，總共 10 類安全問題，形成了一個包含 25k 提示的測試集。此測試集用於評估 LLM 的自然語言生成 (NLG) 能力，採用簡單的道德判斷和 1-5 安全評分量表進行評分。使用此基準，我們測試了八種流行的 LLM，包括 GPT 系列。結果表明，雖然 GPT-4 表現出卓越的安全性能，但包括此模型在內的 LLM 的安全有效性仍需要改進。與本研究相關的數據和程式碼可在 GitHub 上取得。", "author": "Zhihao Liu et.al.", "authors": "Zhihao Liu, Chenhui Hu", "id": "2410.21695v1", "paper_url": "http://arxiv.org/abs/2410.21695v1", "repo": "null"}}