{"2502.04302": {"publish_time": "2025-02-06", "title": "Strong Equivalence in Answer Set Programming with Constraints", "paper_summary": "We investigate the concept of strong equivalence within the extended\nframework of Answer Set Programming with constraints. Two groups of rules are\nconsidered strongly equivalent if, informally speaking, they have the same\nmeaning in any context. We demonstrate that, under certain assumptions, strong\nequivalence between rule sets in this extended setting can be precisely\ncharacterized by their equivalence in the logic of Here-and-There with\nconstraints. Furthermore, we present a translation from the language of several\nclingo-based answer set solvers that handle constraints into the language of\nHere-and-There with constraints. This translation enables us to leverage the\nlogic of Here-and-There to reason about strong equivalence within the context\nof these solvers. We also explore the computational complexity of determining\nstrong equivalence in this context.", "paper_summary_zh": "我們在帶有約束的擴充回答設定程式設計架構中調查強等價的概念。兩組規則被認為是強等價的，如果非正式地說，它們在任何情況下都有相同的含義。我們證明，在某些假設下，此擴充設定中規則集之間的強等價可以透過它們在帶有約束的此處和彼處邏輯中的等價性來精確描述。此外，我們提供了一個從處理約束的幾個基於 Clingo 的答案集求解器的語言到帶有約束的此處和彼處語言的翻譯。此翻譯使我們能夠利用此處和彼處的邏輯在這些求解器的背景下推論強等價。我們還探討了在此背景下確定強等價的計算複雜度。", "author": "Pedro Cabalar et.al.", "authors": "Pedro Cabalar, Jorge Fandinno, Torsten Schaub, Philipp Wanko", "id": "2502.04302v1", "paper_url": "http://arxiv.org/abs/2502.04302v1", "repo": "null"}}