{"2408.06199": {"publish_time": "2024-08-12", "title": "Dynamic Blocked Clause Elimination for Projected Model Counting", "paper_summary": "In this paper, we explore the application of blocked clause elimination for\nprojected model counting. This is the problem of determining the number of\nmodels ||\\exists X.{\\Sigma}|| of a propositional formula {\\Sigma} after\neliminating a given set X of variables existentially. Although blocked clause\nelimination is a well-known technique for SAT solving, its direct application\nto model counting is challenging as in general it changes the number of models.\nHowever, we demonstrate, by focusing on projected variables during the blocked\nclause search, that blocked clause elimination can be leveraged while\npreserving the correct model count. To take advantage of blocked clause\nelimination in an efficient way during model counting, a novel data structure\nand associated algorithms are introduced. Our proposed approach is implemented\nin the model counter d4. Our experiments demonstrate the computational benefits\nof our new method of blocked clause elimination for projected model counting.", "paper_summary_zh": "在本文中，我們探討了封鎖子句消除在預測模型計數中的應用。這是確定在存在地消除給定變數集 X 後，命題公式 {\\Sigma} 的模型數量 ||\\exists X.{\\Sigma}|| 的問題。儘管封鎖子句消除是 SAT 求解的眾所周知技術，但其直接應用於模型計數具有挑戰性，因為它通常會改變模型數量。然而，我們透過在封鎖子句搜尋期間專注於預測變數，證明封鎖子句消除可以在保留正確模型計數的同時被利用。為了在模型計數期間有效利用封鎖子句消除，引入了新穎的資料結構和相關演算法。我們提出的方法在模型計數器 d4 中實作。我們的實驗證明了我們新的封鎖子句消除方法在預測模型計數中帶來的計算優點。", "author": "Jean-Marie Lagniez et.al.", "authors": "Jean-Marie Lagniez, Pierre Marquis, Armin Biere", "id": "2408.06199v1", "paper_url": "http://arxiv.org/abs/2408.06199v1", "repo": "null"}}