{"2412.03283": {"publish_time": "2024-12-04", "title": "Black-Box Forgery Attacks on Semantic Watermarks for Diffusion Models", "paper_summary": "Integrating watermarking into the generation process of latent diffusion\nmodels (LDMs) simplifies detection and attribution of generated content.\nSemantic watermarks, such as Tree-Rings and Gaussian Shading, represent a novel\nclass of watermarking techniques that are easy to implement and highly robust\nagainst various perturbations. However, our work demonstrates a fundamental\nsecurity vulnerability of semantic watermarks. We show that attackers can\nleverage unrelated models, even with different latent spaces and architectures\n(UNet vs DiT), to perform powerful and realistic forgery attacks. Specifically,\nwe design two watermark forgery attacks. The first imprints a targeted\nwatermark into real images by manipulating the latent representation of an\narbitrary image in an unrelated LDM to get closer to the latent representation\nof a watermarked image. We also show that this technique can be used for\nwatermark removal. The second attack generates new images with the target\nwatermark by inverting a watermarked image and re-generating it with an\narbitrary prompt. Both attacks just need a single reference image with the\ntarget watermark. Overall, our findings question the applicability of semantic\nwatermarks by revealing that attackers can easily forge or remove these\nwatermarks under realistic conditions.", "paper_summary_zh": "將浮水印整合到潛在擴散模型 (LDM) 的生成過程中，簡化了生成內容的偵測和歸因。語義浮水印，例如樹狀環和高斯陰影，代表了一種新穎的浮水印技術，易於實作且對各種擾動具有高度的穩健性。然而，我們的研究展示了語義浮水印的基本安全性漏洞。我們展示攻擊者可以利用不相關的模型，即使它們具有不同的潛在空間和架構 (UNet 與 DiT)，來執行強大且逼真的偽造攻擊。具體來說，我們設計了兩種浮水印偽造攻擊。第一個通過在不相關的 LDM 中操縱任意影像的潛在表示，將目標浮水印印記到真實影像中，以更接近水印影像的潛在表示。我們也展示了此技術可被用於浮水印移除。第二個攻擊透過反轉水印影像並使用任意提示重新生成它，來生成具有目標浮水印的新影像。兩種攻擊都只需要一個具有目標浮水印的參考影像。總的來說，我們的發現質疑了語義浮水印的適用性，揭示了攻擊者可以在現實條件下輕鬆偽造或移除這些浮水印。", "author": "Andreas Müller et.al.", "authors": "Andreas Müller, Denis Lukovnikov, Jonas Thietke, Asja Fischer, Erwin Quiring", "id": "2412.03283v1", "paper_url": "http://arxiv.org/abs/2412.03283v1", "repo": "null"}}