{"2408.00357": {"publish_time": "2024-08-01", "title": "DeliLaw: A Chinese Legal Counselling System Based on a Large Language Model", "paper_summary": "Traditional legal retrieval systems designed to retrieve legal documents,\nstatutes, precedents, and other legal information are unable to give\nsatisfactory answers due to lack of semantic understanding of specific\nquestions. Large Language Models (LLMs) have achieved excellent results in a\nvariety of natural language processing tasks, which inspired us that we train a\nLLM in the legal domain to help legal retrieval. However, in the Chinese legal\ndomain, due to the complexity of legal questions and the rigour of legal\narticles, there is no legal large model with satisfactory practical application\nyet. In this paper, we present DeliLaw, a Chinese legal counselling system\nbased on a large language model. DeliLaw integrates a legal retrieval module\nand a case retrieval module to overcome the model hallucination. Users can\nconsult professional legal questions, search for legal articles and relevant\njudgement cases, etc. on the DeliLaw system in a dialogue mode. In addition,\nDeliLaw supports the use of English for counseling. we provide the address of\nthe system: https://data.delilegal.com/lawQuestion.", "paper_summary_zh": "傳統的法律檢索系統旨在檢索法律文件、法規、判例和其他法律資訊，由於缺乏對特定問題的語義理解，無法給出令人滿意的答案。大型語言模型 (LLM) 在各種自然語言處理任務中取得了優異的成果，這啟發我們在法律領域訓練一個 LLM 來幫助法律檢索。然而，在中文法律領域，由於法律問題的複雜性和法律條文的嚴謹性，目前還沒有令人滿意的實用應用法律大模型。在本文中，我們提出了 DeliLaw，一個基於大型語言模型的中文法律諮詢系統。DeliLaw 整合了一個法律檢索模組和一個案例檢索模組來克服模型幻覺。使用者可以在 DeliLaw 系統上以對話模式諮詢專業法律問題、搜尋法律條文和相關判決案例等。此外，DeliLaw 支援使用英文進行諮詢。我們提供系統網址：https://data.delilegal.com/lawQuestion。", "author": "Nan Xie et.al.", "authors": "Nan Xie, Yuelin Bai, Hengyuan Gao, Feiteng Fang, Qixuan Zhao, Zhijian Li, Ziqiang Xue, Liang Zhu, Shiwen Ni, Min Yang", "id": "2408.00357v1", "paper_url": "http://arxiv.org/abs/2408.00357v1", "repo": "null"}}