{"2407.18847": {"publish_time": "2024-07-26", "title": "Enhancing material property prediction with ensemble deep graph convolutional networks", "paper_summary": "Machine learning (ML) models have emerged as powerful tools for accelerating\nmaterials discovery and design by enabling accurate predictions of properties\nfrom compositional and structural data. These capabilities are vital for\ndeveloping advanced technologies across fields such as energy, electronics, and\nbiomedicine, potentially reducing the time and resources needed for new\nmaterial exploration and promoting rapid innovation cycles. Recent efforts have\nfocused on employing advanced ML algorithms, including deep learning - based\ngraph neural network, for property prediction. Additionally, ensemble models\nhave proven to enhance the generalizability and robustness of ML and DL.\nHowever, the use of such ensemble strategies in deep graph networks for\nmaterial property prediction remains underexplored. Our research provides an\nin-depth evaluation of ensemble strategies in deep learning - based graph\nneural network, specifically targeting material property prediction tasks. By\ntesting the Crystal Graph Convolutional Neural Network (CGCNN) and its\nmultitask version, MT-CGCNN, we demonstrated that ensemble techniques,\nespecially prediction averaging, substantially improve precision beyond\ntraditional metrics for key properties like formation energy per atom ($\\Delta\nE^{f}$), band gap ($E_{g}$) and density ($\\rho$) in 33,990 stable inorganic\nmaterials. These findings support the broader application of ensemble methods\nto enhance predictive accuracy in the field.", "paper_summary_zh": "機器學習 (ML) 模型已成為強大的工具，可透過啟用準確預測組成和結構資料中的屬性，來加速材料發現和設計。這些功能對於開發能源、電子和生物醫學等領域的先進技術至關重要，有可能減少新材料探索所需的時間和資源，並促進快速的創新週期。最近的努力集中於採用先進的 ML 演算法，包括基於深度學習的圖神經網路，進行屬性預測。此外，合奏模型已被證明可以增強 ML 和 DL 的概括性和穩健性。然而，在深度圖網路中使用此類合奏策略來進行材料屬性預測仍未得到充分探索。我們的研究對基於深度學習的圖神經網路中的合奏策略進行了深入評估，特別針對材料屬性預測任務。透過測試 Crystal Graph Convolutional Neural Network (CGCNN) 及其多任務版本 MT-CGCNN，我們證明了合奏技術，特別是預測平均值，大幅提升了傳統指標的精準度，例如 33,990 種穩定無機材料中的每個原子形成能 ($\\Delta E^{f}$)、能隙 ($E_{g}$) 和密度 ($\\rho$)。這些發現支持更廣泛地應用合奏方法，以提高該領域的預測準確度。", "author": "Chowdhury Mohammad Abid Rahman et.al.", "authors": "Chowdhury Mohammad Abid Rahman, Ghadendra Bhandari, Nasser M Nasrabadi, Aldo H. Romero, Prashnna K. Gyawali", "id": "2407.18847v1", "paper_url": "http://arxiv.org/abs/2407.18847v1", "repo": "null"}}