{"2410.08250": {"publish_time": "2024-10-10", "title": "Exploring ASR-Based Wav2Vec2 for Automated Speech Disorder Assessment: Insights and Analysis", "paper_summary": "With the rise of SSL and ASR technologies, the Wav2Vec2 ASR-based model has\nbeen fine-tuned for automated speech disorder quality assessment tasks,\nyielding impressive results and setting a new baseline for Head and Neck Cancer\nspeech contexts. This demonstrates that the ASR dimension from Wav2Vec2 closely\naligns with assessment dimensions. Despite its effectiveness, this system\nremains a black box with no clear interpretation of the connection between the\nmodel ASR dimension and clinical assessments. This paper presents the first\nanalysis of this baseline model for speech quality assessment, focusing on\nintelligibility and severity tasks. We conduct a layer-wise analysis to\nidentify key layers and compare different SSL and ASR Wav2Vec2 models based on\npre-trained data. Additionally, post-hoc XAI methods, including Canonical\nCorrelation Analysis (CCA) and visualization techniques, are used to track\nmodel evolution and visualize embeddings for enhanced interpretability.", "paper_summary_zh": "隨著 SSL 和 ASR 技術的興起，基於 Wav2Vec2 的 ASR 模型已針對自動化語言障礙品質評估任務進行微調，產生令人印象深刻的結果，並為頭頸癌語音環境設定新的基準。這證明了 Wav2Vec2 的 ASR 維度與評估維度緊密對齊。儘管這個系統很有效，但它仍然是一個黑盒子，無法清楚解釋模型 ASR 維度與臨床評估之間的關聯。本文提出了第一個針對語音品質評估的基準模型分析，重點放在清晰度和嚴重性任務上。我們進行逐層分析，以識別關鍵層，並根據預訓練數據比較不同的 SSL 和 ASR Wav2Vec2 模型。此外，事後 XAI 方法（包括典型相關分析 (CCA) 和視覺化技術）用於追蹤模型演化，並視覺化嵌入以增強可解釋性。", "author": "Tuan Nguyen et.al.", "authors": "Tuan Nguyen, Corinne Fredouille, Alain Ghio, Mathieu Balaguer, Virginie Woisard", "id": "2410.08250v1", "paper_url": "http://arxiv.org/abs/2410.08250v1", "repo": "null"}}