{"2412.04929": {"publish_time": "2024-12-06", "title": "Continuous Video Process: Modeling Videos as Continuous Multi-Dimensional Processes for Video Prediction", "paper_summary": "Diffusion models have made significant strides in image generation, mastering\ntasks such as unconditional image synthesis, text-image translation, and\nimage-to-image conversions. However, their capability falls short in the realm\nof video prediction, mainly because they treat videos as a collection of\nindependent images, relying on external constraints such as temporal attention\nmechanisms to enforce temporal coherence. In our paper, we introduce a novel\nmodel class, that treats video as a continuous multi-dimensional process rather\nthan a series of discrete frames. We also report a reduction of 75\\% sampling\nsteps required to sample a new frame thus making our framework more efficient\nduring the inference time. Through extensive experimentation, we establish\nstate-of-the-art performance in video prediction, validated on benchmark\ndatasets including KTH, BAIR, Human3.6M, and UCF101. Navigate to the project\npage https://www.cs.umd.edu/~gauravsh/cvp/supp/website.html for video results.}", "paper_summary_zh": "擴散模型在影像生成方面取得顯著進展，掌握無條件影像合成、文字影像翻譯和影像轉換等任務。然而，它們在影片預測領域的能力不足，主要是因為它們將影片視為獨立影像的集合，依賴於時間注意力機制等外部約束來強制時間相干性。在我們的論文中，我們引入了一個新穎的模型類別，將影片視為一個連續的多維過程，而不是一系列的離散幀。我們還報告了對採樣新幀所需採樣步驟的 75% 減少，從而使我們的框架在推理時間內更有效率。透過廣泛的實驗，我們建立了影片預測的最新技術，驗證了包括 KTH、BAIR、Human3.6M 和 UCF101 在內的基準資料集。前往專案頁面 https://www.cs.umd.edu/~gauravsh/cvp/supp/website.html 以取得影片結果。", "author": "Gaurav Shrivastava et.al.", "authors": "Gaurav Shrivastava, Abhinav Shrivastava", "id": "2412.04929v1", "paper_url": "http://arxiv.org/abs/2412.04929v1", "repo": "null"}}