{"2405.21046": {"publish_time": "2024-05-31", "title": "Exploratory Preference Optimization: Harnessing Implicit Q*-Approximation for Sample-Efficient RLHF", "paper_summary": "Reinforcement learning from human feedback (RLHF) has emerged as a central\ntool for language model alignment. We consider online exploration in RLHF,\nwhich exploits interactive access to human or AI feedback by deliberately\nencouraging the model to produce diverse, maximally informative responses. By\nallowing RLHF to confidently stray from the pre-trained model, online\nexploration offers the possibility of novel, potentially super-human\ncapabilities, but its full potential as a paradigm for language model training\nhas yet to be realized, owing to computational and statistical bottlenecks in\ndirectly adapting existing reinforcement learning techniques. We propose a new\nalgorithm for online exploration in RLHF, Exploratory Preference Optimization\n(XPO), which is simple and practical -- a one-line change to (online) Direct\nPreference Optimization (DPO; Rafailov et al., 2023) -- yet enjoys the\nstrongest known provable guarantees and promising empirical performance. XPO\naugments the DPO objective with a novel and principled exploration bonus,\nempowering the algorithm to explore outside the support of the initial model\nand human feedback data. In theory, we show that XPO is provably\nsample-efficient and converges to a near-optimal language model policy under\nnatural exploration conditions, irrespective of whether the initial model has\ngood coverage. Our analysis, which builds on the observation that DPO\nimplicitly performs a form of $Q^{\\star}$-approximation (or, Bellman error\nminimization), combines previously disparate techniques from language modeling\nand theoretical reinforcement learning in a serendipitous fashion through the\nperspective of KL-regularized Markov decision processes. Empirically, we find\nthat XPO is more sample-efficient than non-exploratory DPO variants in a\npreliminary evaluation.", "paper_summary_zh": "人類回饋強化學習 (RLHF) 已成為語言模型對齊的核心工具。我們考慮 RLHF 中的線上探索，它透過故意鼓勵模型產生多樣化、極具資訊性的回應，來善用與人類或 AI 回饋的互動存取。透過允許 RLHF 自信地偏離預先訓練的模型，線上探索提供了新穎、潛在超越人類的能力，但由於在直接調整現有強化學習技術時會遇到運算和統計瓶頸，因此它作為語言模型訓練典範的全部潛力尚未實現。我們提出了一種新的 RLHF 線上探索演算法，探索性偏好最佳化 (XPO)，它簡單且實用，只需對 (線上) 直接偏好最佳化 (DPO；Rafailov 等人，2023 年) 進行一行變更，但卻享有已知最強大的可證明保證和有前途的經驗效能。XPO 以新穎且有原則的探索獎勵來擴充 DPO 目標，賦予演算法在初始模型和人類回饋資料的支持外探索的能力。在理論上，我們證明 XPO 在自然探索條件下，無論初始模型是否有良好的涵蓋範圍，都可證明具有樣本效率，並收斂到接近最佳的語言模型政策。我們的分析建立在 DPO 隱含執行一種形式的 $Q^{\\star}$-近似（或 Bellman 誤差最小化）的觀察上，它透過 KL 正規化馬可夫決策過程的角度，以一種意外的方式結合了語言建模和理論強化學習中先前不同的技術。在經驗上，我們發現 XPO 在初步評估中比非探索性 DPO 變體更具樣本效率。", "author": "Tengyang Xie et.al.", "authors": "Tengyang Xie, Dylan J. Foster, Akshay Krishnamurthy, Corby Rosset, Ahmed Awadallah, Alexander Rakhlin", "id": "2405.21046v1", "paper_url": "http://arxiv.org/abs/2405.21046v1", "repo": "null"}}