{"2408.05357": {"publish_time": "2024-08-09", "title": "SHIELD: LLM-Driven Schema Induction for Predictive Analytics in EV Battery Supply Chain Disruptions", "paper_summary": "The electric vehicle (EV) battery supply chain's vulnerability to disruptions\nnecessitates advanced predictive analytics. We present SHIELD (Schema-based\nHierarchical Induction for EV supply chain Disruption), a system integrating\nLarge Language Models (LLMs) with domain expertise for EV battery supply chain\nrisk assessment. SHIELD combines: (1) LLM-driven schema learning to construct a\ncomprehensive knowledge library, (2) a disruption analysis system utilizing\nfine-tuned language models for event extraction, multi-dimensional similarity\nmatching for schema matching, and Graph Convolutional Networks (GCNs) with\nlogical constraints for prediction, and (3) an interactive interface for\nvisualizing results and incorporating expert feedback to enhance\ndecision-making. Evaluated on 12,070 paragraphs from 365 sources (2022-2023),\nSHIELD outperforms baseline GCNs and LLM+prompt methods (e.g., GPT-4o) in\ndisruption prediction. These results demonstrate SHIELD's effectiveness in\ncombining LLM capabilities with domain expertise for enhanced supply chain risk\nassessment.", "paper_summary_zh": "電動車 (EV) 電池供應鏈容易受到干擾，因此需要進階的預測分析。我們提出 SHIELD（基於架構的 EV 供應鏈中斷階層式歸納），這是一個整合大型語言模型 (LLM) 與 EV 電池供應鏈風險評估領域專業知識的系統。SHIELD 結合：(1) LLM 驅動的架構學習，用於建置一個全面的知識庫，(2) 一個中斷分析系統，利用微調語言模型進行事件萃取、多維度相似性比對用於架構比對，以及帶有邏輯約束的圖形卷積網路 (GCN) 用於預測，以及 (3) 一個互動介面，用於視覺化結果和納入專家回饋以增強決策制定。在來自 365 個來源的 12,070 段落（2022-2023 年）上進行評估，SHIELD 在中斷預測方面優於基準 GCN 和 LLM+提示方法（例如，GPT-4o）。這些結果證明了 SHIELD 在結合 LLM 功能與領域專業知識以增強供應鏈風險評估方面的有效性。", "author": "Zhi-Qi Cheng et.al.", "authors": "Zhi-Qi Cheng, Yifei Dong, Aike Shi, Wei Liu, Yuzhi Hu, Jason O'Connor, Alexander Hauptmann, Kate Whitefoot", "id": "2408.05357v1", "paper_url": "http://arxiv.org/abs/2408.05357v1", "repo": "null"}}