{"2409.11699": {"publish_time": "2024-09-18", "title": "FLARE: Fusing Language Models and Collaborative Architectures for Recommender Enhancement", "paper_summary": "Hybrid recommender systems, combining item IDs and textual descriptions,\noffer potential for improved accuracy. However, previous work has largely\nfocused on smaller datasets and model architectures. This paper introduces\nFlare (Fusing Language models and collaborative Architectures for Recommender\nEnhancement), a novel hybrid recommender that integrates a language model (mT5)\nwith a collaborative filtering model (Bert4Rec) using a Perceiver network. This\narchitecture allows Flare to effectively combine collaborative and content\ninformation for enhanced recommendations.\n  We conduct a two-stage evaluation, first assessing Flare's performance\nagainst established baselines on smaller datasets, where it demonstrates\ncompetitive accuracy. Subsequently, we evaluate Flare on a larger, more\nrealistic dataset with a significantly larger item vocabulary, introducing new\nbaselines for this setting. Finally, we showcase Flare's inherent ability to\nsupport critiquing, enabling users to provide feedback and refine\nrecommendations. We further leverage critiquing as an evaluation method to\nassess the model's language understanding and its transferability to the\nrecommendation task.", "paper_summary_zh": "混合推薦系統結合項目 ID 和文字描述，\n提供改進準確性的潛力。然而，先前的研究主要\n集中在較小的資料集和模型架構上。本文介紹\nFlare（融合語言模型和協作架構以增強推薦），一種新穎的混合推薦系統，它使用感知器網路將語言模型 (mT5) 與協作過濾模型 (Bert4Rec) 整合在一起。這個\n架構允許 Flare 有效地結合協作和內容\n資訊以增強推薦。\n我們進行了兩階段評估，首先評估 Flare 在較小的資料集上對已建立基準的效能，在這些資料集中，它展現了\n競爭力的準確性。隨後，我們在一個較大、更\n實際的資料集上評估 Flare，該資料集具有顯著更大的項目詞彙，為此設定引入了新的基準。最後，我們展示了 Flare 內建支援批評的能力，使用戶能夠提供回饋並改善\n推薦。我們進一步利用批評作為評估方法來\n評估模型的語言理解及其在推薦任務中的可傳輸性。", "author": "Liam Hebert et.al.", "authors": "Liam Hebert, Marialena Kyriakidi, Hubert Pham, Krishna Sayana, James Pine, Sukhdeep Sodhi, Ambarish Jash", "id": "2409.11699v1", "paper_url": "http://arxiv.org/abs/2409.11699v1", "repo": "null"}}