{"2411.12703": {"publish_time": "2024-11-19", "title": "Strengthening Fake News Detection: Leveraging SVM and Sophisticated Text Vectorization Techniques. Defying BERT?", "paper_summary": "The rapid spread of misinformation, particularly through online platforms,\nunderscores the urgent need for reliable detection systems. This study explores\nthe utilization of machine learning and natural language processing,\nspecifically Support Vector Machines (SVM) and BERT, to detect news that are\nfake. We employ three distinct text vectorization methods for SVM: Term\nFrequency Inverse Document Frequency (TF-IDF), Word2Vec, and Bag of Words (BoW)\nevaluating their effectiveness in distinguishing between genuine and fake news.\nAdditionally, we compare these methods against the transformer large language\nmodel, BERT. Our comprehensive approach includes detailed preprocessing steps,\nrigorous model implementation, and thorough evaluation to determine the most\neffective techniques. The results demonstrate that while BERT achieves superior\naccuracy with 99.98% and an F1-score of 0.9998, the SVM model with a linear\nkernel and BoW vectorization also performs exceptionally well, achieving 99.81%\naccuracy and an F1-score of 0.9980. These findings highlight that, despite\nBERT's superior performance, SVM models with BoW and TF-IDF vectorization\nmethods come remarkably close, offering highly competitive performance with the\nadvantage of lower computational requirements.", "paper_summary_zh": "隨著錯誤訊息快速散播，特別是透過線上平台，這凸顯了可靠偵測系統的迫切需求。本研究探討利用機器學習和自然語言處理，特別是支援向量機 (SVM) 和 BERT，來偵測假新聞。我們採用三種不同的文字向量化方法，用於 SVM：詞頻逆文件頻率 (TF-IDF)、Word2Vec 和詞袋 (BoW)，評估其在區分真實新聞和假新聞方面的有效性。此外，我們將這些方法與Transformer大型語言模型 BERT 進行比較。我們的綜合方法包括詳細的預處理步驟、嚴謹的模型實作和徹底的評估，以確定最有效的技術。結果表明，儘管 BERT 以 99.98% 的準確率和 0.9998 的 F1 分數取得了優異的準確度，但具有線性核心的 SVM 模型和 BoW 向量化也表現得非常好，準確率達到 99.81%，F1 分數為 0.9980。這些發現強調，儘管 BERT 具有優異的效能，但使用 BoW 和 TF-IDF 向量化方法的 SVM 模型表現得非常接近，在計算需求較低的情況下，提供了極具競爭力的效能。", "author": "Ahmed Akib Jawad Karim et.al.", "authors": "Ahmed Akib Jawad Karim, Kazi Hafiz Md Asad, Aznur Azam", "id": "2411.12703v1", "paper_url": "http://arxiv.org/abs/2411.12703v1", "repo": "null"}}