{"2407.21311": {"publish_time": "2024-07-31", "title": "EUDA: An Efficient Unsupervised Domain Adaptation via Self-Supervised Vision Transformer", "paper_summary": "Unsupervised domain adaptation (UDA) aims to mitigate the domain shift issue,\nwhere the distribution of training (source) data differs from that of testing\n(target) data. Many models have been developed to tackle this problem, and\nrecently vision transformers (ViTs) have shown promising results. However, the\ncomplexity and large number of trainable parameters of ViTs restrict their\ndeployment in practical applications. This underscores the need for an\nefficient model that not only reduces trainable parameters but also allows for\nadjustable complexity based on specific needs while delivering comparable\nperformance. To achieve this, in this paper we introduce an Efficient\nUnsupervised Domain Adaptation (EUDA) framework. EUDA employs the DINOv2, which\nis a self-supervised ViT, as a feature extractor followed by a simplified\nbottleneck of fully connected layers to refine features for enhanced domain\nadaptation. Additionally, EUDA employs the synergistic domain alignment loss\n(SDAL), which integrates cross-entropy (CE) and maximum mean discrepancy (MMD)\nlosses, to balance adaptation by minimizing classification errors in the source\ndomain while aligning the source and target domain distributions. The\nexperimental results indicate the effectiveness of EUDA in producing comparable\nresults as compared with other state-of-the-art methods in domain adaptation\nwith significantly fewer trainable parameters, between 42% to 99.7% fewer. This\nshowcases the ability to train the model in a resource-limited environment. The\ncode of the model is available at: https://github.com/A-Abedi/EUDA.", "paper_summary_zh": "無監督域適應 (UDA) 旨在減輕域偏移問題，其中訓練 (來源) 資料的分配與測試 (目標) 資料的分配不同。已開發許多模型來解決此問題，而最近的視覺轉換器 (ViT) 已顯示出有希望的結果。然而，ViT 的複雜性和大量的可訓練參數限制了它們在實際應用中的部署。這強調了對一種有效模型的需求，該模型不僅可以減少可訓練參數，還可以根據特定需求調整複雜性，同時提供可比較的效能。為了實現這一點，我們在本文中介紹了一個有效的無監督域適應 (EUDA) 框架。EUDA 使用 DINOv2，這是一個自監督的 ViT，作為一個特徵提取器，後面是一個簡化的全連接層瓶頸，以優化特徵以增強域適應。此外，EUDA 採用協同域對齊損失 (SDAL)，它整合了交叉熵 (CE) 和最大平均差異 (MMD) 損失，通過最小化來源域中的分類錯誤同時對齊來源和目標域分配來平衡適應。實驗結果表明，與其他最先進的域適應方法相比，EUDA 在產生可比較的結果方面是有效的，可訓練參數顯著減少，減少了 42% 到 99.7%。這展示了在資源受限的環境中訓練模型的能力。模型的程式碼可在 https://github.com/A-Abedi/EUDA 中取得。", "author": "Ali Abedi et.al.", "authors": "Ali Abedi, Q. M. Jonathan Wu, Ning Zhang, Farhad Pourpanah", "id": "2407.21311v1", "paper_url": "http://arxiv.org/abs/2407.21311v1", "repo": "null"}}