{"2407.20673": {"publish_time": "2024-07-30", "title": "Label-Guided Prompt for Multi-label Few-shot Aspect Category Detection", "paper_summary": "Multi-label few-shot aspect category detection aims at identifying multiple\naspect categories from sentences with a limited number of training instances.\nThe representation of sentences and categories is a key issue in this task.\nMost of current methods extract keywords for the sentence representations and\nthe category representations. Sentences often contain many category-independent\nwords, which leads to suboptimal performance of keyword-based methods. Instead\nof directly extracting keywords, we propose a label-guided prompt method to\nrepresent sentences and categories. To be specific, we design label-specific\nprompts to represent sentences by combining crucial contextual and semantic\ninformation. Further, the label is introduced into a prompt to obtain category\ndescriptions by utilizing a large language model. This kind of category\ndescriptions contain the characteristics of the aspect categories, guiding the\nconstruction of discriminative category prototypes. Experimental results on two\npublic datasets show that our method outperforms current state-of-the-art\nmethods with a 3.86% - 4.75% improvement in the Macro-F1 score.", "paper_summary_zh": "多標籤小樣本面向分類偵測旨在從具有有限訓練實例的句子中識別多個面向分類。\n句子和分類的表示是此任務中的關鍵問題。\n大多數當前方法為句子表示和分類表示提取關鍵字。\n句子通常包含許多與分類無關的詞彙，這導致基於關鍵字的方法的次優性能。\n我們沒有直接提取關鍵字，而是提出了一種標籤引導提示方法來表示句子和分類。\n具體來說，我們設計了標籤特定的提示，通過結合關鍵的上下文和語義信息來表示句子。\n此外，將標籤引入提示中以利用大型語言模型來獲取類別描述。\n這種類別描述包含面向類別的特徵，指導判別類別原型的構建。\n在兩個公共數據集上的實驗結果表明，我們的模型優於當前最先進的模型，在宏觀 F1 分數上改進了 3.86% - 4.75%。", "author": "ChaoFeng Guan et.al.", "authors": "ChaoFeng Guan, YaoHui Zhu, Yu Bai, LingYun Wang", "id": "2407.20673v1", "paper_url": "http://arxiv.org/abs/2407.20673v1", "repo": "null"}}