{"2412.08125": {"publish_time": "2024-12-11", "title": "Progressive Multi-granular Alignments for Grounded Reasoning in Large Vision-Language Models", "paper_summary": "Existing Large Vision-Language Models (LVLMs) excel at matching concepts\nacross multi-modal inputs but struggle with compositional concepts and\nhigh-level relationships between entities. This paper introduces Progressive\nmulti-granular Vision-Language alignments (PromViL), a novel framework to\nenhance LVLMs' ability in performing grounded compositional visual reasoning\ntasks. Our approach constructs a hierarchical structure of multi-modal\nalignments, ranging from simple to complex concepts. By progressively aligning\ntextual descriptions with corresponding visual regions, our model learns to\nleverage contextual information from lower levels to inform higher-level\nreasoning. To facilitate this learning process, we introduce a data generation\nprocess that creates a novel dataset derived from Visual Genome, providing a\nwide range of nested compositional vision-language pairs. Experimental results\ndemonstrate that our PromViL framework significantly outperforms baselines on\nvarious visual grounding and compositional question answering tasks.", "paper_summary_zh": "現有的大型視覺語言模型 (LVLMs) 擅長比對跨多模式輸入的概念，但在組合概念和實體之間的高層級關係上卻有困難。本文介紹漸進式多粒度視覺語言對齊 (PromViL)，這是一種新穎的架構，用於增強 LVLMs 在執行基礎組合視覺推理任務的能力。我們的做法建構了一個多模式對齊的分層結構，從簡單到複雜的概念。透過漸進式地將文字描述與對應的視覺區域對齊，我們的模型學習利用較低層級的脈絡資訊，來告知較高層級的推理。為了促進這個學習過程，我們引入了一個資料產生程序，這個程序會建立一個新穎的資料集，衍生自 Visual Genome，提供廣泛的嵌套組合視覺語言配對。實驗結果證明，我們的 PromViL 架構在各種視覺基礎和組合式問答任務上，都顯著優於基準。", "author": "Quang-Hung Le et.al.", "authors": "Quang-Hung Le, Long Hoang Dang, Ngan Le, Truyen Tran, Thao Minh Le", "id": "2412.08125v1", "paper_url": "http://arxiv.org/abs/2412.08125v1", "repo": "null"}}