{"2503.03215": {"publish_time": "2025-03-05", "title": "COSINT-Agent: A Knowledge-Driven Multimodal Agent for Chinese Open Source Intelligence", "paper_summary": "Open Source Intelligence (OSINT) requires the integration and reasoning of\ndiverse multimodal data, presenting significant challenges in deriving\nactionable insights. Traditional approaches, including multimodal large\nlanguage models (MLLMs), often struggle to infer complex contextual\nrelationships or deliver comprehensive intelligence from unstructured data\nsources. In this paper, we introduce COSINT-Agent, a knowledge-driven\nmultimodal agent tailored to address the challenges of OSINT in the Chinese\ndomain. COSINT-Agent seamlessly integrates the perceptual capabilities of\nfine-tuned MLLMs with the structured reasoning power of the Entity-Event-Scene\nKnowledge Graph (EES-KG). Central to COSINT-Agent is the innovative EES-Match\nframework, which bridges COSINT-MLLM and EES-KG, enabling systematic\nextraction, reasoning, and contextualization of multimodal insights. This\nintegration facilitates precise entity recognition, event interpretation, and\ncontext retrieval, effectively transforming raw multimodal data into actionable\nintelligence. Extensive experiments validate the superior performance of\nCOSINT-Agent across core OSINT tasks, including entity recognition, EES\ngeneration, and context matching. These results underscore its potential as a\nrobust and scalable solution for advancing automated multimodal reasoning and\nenhancing the effectiveness of OSINT methodologies.", "paper_summary_zh": "開源情報（OSINT）需要整合和推理多樣化的多模態數據，這在獲取可操作的情報方面提出了重大挑戰。傳統方法，包括多模態大型語言模型（MLLM），通常難以從非結構化數據源推斷複雜的上下文關係或提供全面的情報。在本文中，我們介紹了 COSINT-Agent，這是一個知識驅動的多模態代理，專為應對中文領域中 OSINT 的挑戰而設計。COSINT-Agent 將微調後的 MLLM 的感知能力與實體-事件-場景知識圖譜（EES-KG）的結構化推理能力無縫集成。COSINT-Agent 的核心是創新的 EES-Match框架，它橋接了 COSINT-MLLM 和 EES-KG，實現了多模態洞察的系統提取、推理和情境化。這種集成促進了精確的實體識別、事件解釋和上下文檢索，有效地將原始多模態數據轉化為可操作的情報。大量實驗驗證了 COSINT-Agent 在核心 OSINT 任務中的卓越性能，包括實體識別、EES生成和上下文匹配。這些結果突顯了其作為一種強大且可擴展的解決方案的潛力，可以推進自動化多模態推理並提高 OSINT 方法的有效性。\n", "author": "Wentao Li et.al.", "authors": "Wentao Li, Congcong Wang, Xiaoxiao Cui, Zhi Liu, Wei Guo, Lizhen Cui", "id": "2503.03215v1", "paper_url": "http://arxiv.org/abs/2503.03215v1", "repo": "null"}}