{"2406.13106": {"publish_time": "2024-06-18", "title": "Accelerating Complex Disease Treatment through Network Medicine and GenAI: A Case Study on Drug Repurposing for Breast Cancer", "paper_summary": "The objective of this research is to introduce a network specialized in\npredicting drugs that can be repurposed by investigating real-world evidence\nsources, such as clinical trials and biomedical literature. Specifically, it\naims to generate drug combination therapies for complex diseases (e.g., cancer,\nAlzheimer's). We present a multilayered network medicine approach, empowered by\na highly configured ChatGPT prompt engineering system, which is constructed on\nthe fly to extract drug mentions in clinical trials. Additionally, we introduce\na novel algorithm that connects real-world evidence with disease-specific\nsignaling pathways (e.g., KEGG database). This sheds light on the\nrepurposability of drugs if they are found to bind with one or more protein\nconstituents of a signaling pathway. To demonstrate, we instantiated the\nframework for breast cancer and found that, out of 46 breast cancer signaling\npathways, the framework identified 38 pathways that were covered by at least\ntwo drugs. This evidence signals the potential for combining those drugs.\nSpecifically, the most covered signaling pathway, ID hsa:2064, was covered by\n108 drugs, some of which can be combined. Conversely, the signaling pathway ID\nhsa:1499 was covered by only two drugs, indicating a significant gap for\nfurther research. Our network medicine framework, empowered by GenAI, shows\npromise in identifying drug combinations with a high degree of specificity,\nknowing the exact signaling pathways and proteins that serve as targets. It is\nnoteworthy that ChatGPT successfully accelerated the process of identifying\ndrug mentions in clinical trials, though further investigations are required to\ndetermine the relationships among the drug mentions.", "paper_summary_zh": "本研究的目的是介紹一個專門用於預測藥物用途的網路，透過調查真實世界證據來源，例如臨床試驗和生物醫學文獻。具體來說，它旨在為複雜疾病（例如癌症、阿茲海默症）產生藥物組合療法。我們提出了一個多層網路醫學方法，由一個高度配置的 ChatGPT 提示工程系統提供支援，該系統會動態建構，以萃取臨床試驗中的藥物提及。此外，我們引入了一種新的演算法，將真實世界證據與特定疾病的訊號傳遞路徑（例如 KEGG 資料庫）連結起來。如果發現藥物與訊號傳遞路徑的一個或多個蛋白質成分結合，這將有助於了解藥物的再利用性。為了示範，我們為乳癌建立了架構，發現出 46 條乳癌訊號傳遞路徑中，該架構辨識出 38 條路徑至少包含兩種藥物。此證據顯示了結合這些藥物的潛力。具體來說，涵蓋範圍最廣的訊號傳遞路徑 ID hsa:2064，涵蓋了 108 種藥物，其中一些可以結合。相反地，訊號傳遞路徑 ID hsa:1499 僅涵蓋兩種藥物，這表示有很大的研究空白。我們的網路醫學架構由 GenAI 提供支援，在辨識具有高度特異性的藥物組合方面顯示出前景，了解作為目標的精確訊號傳遞路徑和蛋白質。值得注意的是，ChatGPT 成功地加速了在臨床試驗中辨識藥物提及的過程，儘管需要進一步的調查來確定藥物提及之間的關係。", "author": "Ahmed Abdeen Hamed et.al.", "authors": "Ahmed Abdeen Hamed, Tamer E. Fandy", "id": "2406.13106v3", "paper_url": "http://arxiv.org/abs/2406.13106v3", "repo": "null"}}