{"2409.05585": {"publish_time": "2024-09-09", "title": "Latent 3D Brain MRI Counterfactual", "paper_summary": "The number of samples in structural brain MRI studies is often too small to\nproperly train deep learning models. Generative models show promise in\naddressing this issue by effectively learning the data distribution and\ngenerating high-fidelity MRI. However, they struggle to produce diverse,\nhigh-quality data outside the distribution defined by the training data. One\nway to address the issue is using causal models developed for 3D volume\ncounterfactuals. However, accurately modeling causality in high-dimensional\nspaces is a challenge so that these models generally generate 3D brain MRIS of\nlower quality. To address these challenges, we propose a two-stage method that\nconstructs a Structural Causal Model (SCM) within the latent space. In the\nfirst stage, we employ a VQ-VAE to learn a compact embedding of the MRI volume.\nSubsequently, we integrate our causal model into this latent space and execute\na three-step counterfactual procedure using a closed-form Generalized Linear\nModel (GLM). Our experiments conducted on real-world high-resolution MRI data\n(1mm) demonstrate that our method can generate high-quality 3D MRI\ncounterfactuals.", "paper_summary_zh": "結構性腦部 MRI 研究中的樣本數常常太小，無法適當地訓練深度學習模型。生成模型顯示出解決此問題的希望，方法是有效地學習資料分佈並產生高保真 MRI。然而，它們難以產生訓練資料所定義分佈之外的多樣化、高品質資料。解決此問題的方法之一是使用為 3D 體積反事實關係開發的因果模型。然而，在高維度空間中準確地建模因果關係是一項挑戰，因此這些模型通常會產生品質較低的 3D 腦部 MRI。為了解決這些挑戰，我們提出了一種兩階段方法，在潛在空間中建構結構因果模型 (SCM)。在第一階段，我們採用 VQ-VAE 來學習 MRI 體積的緊湊嵌入。隨後，我們將因果模型整合到這個潛在空間中，並使用閉合形式廣義線性模型 (GLM) 執行三步驟反事實程序。我們在真實世界的高解析度 MRI 資料 (1mm) 上進行的實驗證明，我們的方法可以產生高品質的 3D MRI 反事實關係。", "author": "Wei Peng et.al.", "authors": "Wei Peng, Tian Xia, Fabio De Sousa Ribeiro, Tomas Bosschieter, Ehsan Adeli, Qingyu Zhao, Ben Glocker, Kilian M. Pohl", "id": "2409.05585v1", "paper_url": "http://arxiv.org/abs/2409.05585v1", "repo": "null"}}