{"2412.20962": {"publish_time": "2024-12-30", "title": "Conservation-informed Graph Learning for Spatiotemporal Dynamics Prediction", "paper_summary": "Data-centric methods have shown great potential in understanding and\npredicting spatiotemporal dynamics, enabling better design and control of the\nobject system. However, pure deep learning models often lack interpretability,\nfail to obey intrinsic physics, and struggle to cope with the various domains.\nWhile geometry-based methods, e.g., graph neural networks (GNNs), have been\nproposed to further tackle these challenges, they still need to find the\nimplicit physical laws from large datasets and rely excessively on rich labeled\ndata. In this paper, we herein introduce the conservation-informed GNN (CiGNN),\nan end-to-end explainable learning framework, to learn spatiotemporal dynamics\nbased on limited training data. The network is designed to conform to the\ngeneral conservation law via symmetry, where conservative and non-conservative\ninformation passes over a multiscale space enhanced by a latent temporal\nmarching strategy. The efficacy of our model has been verified in various\nspatiotemporal systems based on synthetic and real-world datasets, showing\nsuperiority over baseline models. Results demonstrate that CiGNN exhibits\nremarkable accuracy and generalization ability, and is readily applicable to\nlearning for prediction of various spatiotemporal dynamics in a spatial domain\nwith complex geometry.", "paper_summary_zh": "<paragraph>資料為中心的各種方法在理解和預測時空動力學方面展現極佳的潛力，能更有效地設計與控制物件系統。然而，純粹的深度學習模型往往缺乏可解釋性，無法遵循內在物理定律，且難以應對各種領域。雖然幾何基礎方法（例如圖形神經網路 (GNN)）已被提出進一步應對這些挑戰，但它們仍需要從大型資料集中找出隱含的物理定律，並過度依賴豐富的標籤資料。在本文中，我們在此介紹了受守恆定律啟發的 GNN (CiGNN)，這是一個端到端的可解釋學習架構，用於根據有限的訓練資料學習時空動力學。該網路被設計為透過對稱性符合一般守恆定律，其中保守和非保守資訊會透過一個由潛在時間行進策略增強的多尺度空間傳遞。我們模型的效力已在各種基於合成和真實世界資料集的時空系統中得到驗證，顯示出優於基線模型的優越性。結果證明，CiGNN 展現出卓越的準確性和泛化能力，且易於應用於學習，以預測具有複雜幾何形狀的空間域中的各種時空動力學。</paragraph>", "author": "Yuan Mi et.al.", "authors": "Yuan Mi, Pu Ren, Hongteng Xu, Hongsheng Liu, Zidong Wang, Yike Guo, Ji-Rong Wen, Hao Sun, Yang Liu", "id": "2412.20962v1", "paper_url": "http://arxiv.org/abs/2412.20962v1", "repo": "null"}}