{"2411.13173": {"publish_time": "2024-11-20", "title": "Writing Style Matters: An Examination of Bias and Fairness in Information Retrieval Systems", "paper_summary": "The rapid advancement of Language Model technologies has opened new\nopportunities, but also introduced new challenges related to bias and fairness.\nThis paper explores the uncharted territory of potential biases in\nstate-of-the-art universal text embedding models towards specific document and\nquery writing styles within Information Retrieval (IR) systems. Our\ninvestigation reveals that different embedding models exhibit different\npreferences of document writing style, while more informal and emotive styles\nare less favored by most embedding models. In terms of query writing styles,\nmany embedding models tend to match the style of the query with the style of\nthe retrieved documents, but some show a consistent preference for specific\nstyles. Text embedding models fine-tuned on synthetic data generated by LLMs\ndisplay a consistent preference for certain style of generated data. These\nbiases in text embedding based IR systems can inadvertently silence or\nmarginalize certain communication styles, thereby posing a significant threat\nto fairness in information retrieval. Finally, we also compare the answer\nstyles of Retrieval Augmented Generation (RAG) systems based on different LLMs\nand find out that most text embedding models are biased towards LLM's answer\nstyles when used as evaluation metrics for answer correctness. This study sheds\nlight on the critical issue of writing style based bias in IR systems, offering\nvaluable insights for the development of more fair and robust models.", "paper_summary_zh": "語言模型技術的快速進步開創了新的機會，但也帶來了與偏見和公平性相關的新挑戰。本文探討了最先進的通用文字嵌入模型中潛在偏見的未知領域，這些偏見針對信息檢索 (IR) 系統中的特定文件和查詢撰寫風格。我們的調查顯示，不同的嵌入模型展現出不同的文件撰寫風格偏好，而大多數嵌入模型較不偏好較非正式和較感性的風格。在查詢撰寫風格方面，許多嵌入模型傾向於將查詢的風格與擷取文件的風格相匹配，但有些模型持續偏好特定風格。針對 LLM 生成的合成資料進行微調的文字嵌入模型持續偏好特定風格的生成資料。基於文字嵌入的 IR 系統中的這些偏見可能會無意間讓某些溝通風格變得沉默或邊緣化，從而對信息檢索中的公平性構成重大威脅。最後，我們還比較了基於不同 LLM 的檢索增強生成 (RAG) 系統的答案風格，並發現大多數文字嵌入模型在用作答案正確性的評估指標時會偏向 LLM 的答案風格。這項研究闡明了 IR 系統中基於寫作風格的偏見這個關鍵問題，為開發更公平、更強健的模型提供了寶貴的見解。", "author": "Hongliu Cao et.al.", "authors": "Hongliu Cao", "id": "2411.13173v1", "paper_url": "http://arxiv.org/abs/2411.13173v1", "repo": "null"}}