{"2501.13699": {"publish_time": "2025-01-23", "title": "DI-BENCH: Benchmarking Large Language Models on Dependency Inference with Testable Repositories at Scale", "paper_summary": "Large Language Models have advanced automated software development, however,\nit remains a challenge to correctly infer dependencies, namely, identifying the\ninternal components and external packages required for a repository to\nsuccessfully run. Existing studies highlight that dependency-related issues\ncause over 40\\% of observed runtime errors on the generated repository. To\naddress this, we introduce DI-BENCH, a large-scale benchmark and evaluation\nframework specifically designed to assess LLMs' capability on dependency\ninference. The benchmark features 581 repositories with testing environments\nacross Python, C#, Rust, and JavaScript. Extensive experiments with textual and\nexecution-based metrics reveal that the current best-performing model achieves\nonly a 42.9% execution pass rate, indicating significant room for improvement.\nDI-BENCH establishes a new viewpoint for evaluating LLM performance on\nrepositories, paving the way for more robust end-to-end software synthesis.", "paper_summary_zh": "大型語言模型已推動自動化軟體開發，然而，正確推斷依賴關係，也就是識別儲存庫成功執行所需的內部元件和外部套件，仍然是一項挑戰。現有研究強調與依賴關係相關的問題導致在生成的儲存庫中觀察到的執行時間錯誤超過 40%。為了解決此問題，我們引入了 DI-BENCH，一個專門設計來評估 LLM 在依賴關係推斷能力上的大型基準測試和評估架構。此基準測試包含 581 個儲存庫，測試環境涵蓋 Python、C#、Rust 和 JavaScript。使用文字和基於執行的指標進行的廣泛實驗顯示，目前效能最佳的模型僅達到 42.9% 的執行通過率，表示有顯著的改進空間。DI-BENCH 為評估 LLM 在儲存庫上的效能建立了一個新的觀點，為更強大的端到端軟體合成鋪路。", "author": "Linghao Zhang et.al.", "authors": "Linghao Zhang, Junhao Wang, Shilin He, Chaoyun Zhang, Yu Kang, Bowen Li, Jiaheng Wen, Chengxing Xie, Maoquan Wang, Yufan Huang, Elsie Nallipogu, Qingwei Lin, Yingnong Dang, Saravan Rajmohan, Dongmei Zhang, Qi Zhang", "id": "2501.13699v1", "paper_url": "http://arxiv.org/abs/2501.13699v1", "repo": "null"}}