{"2412.04205": {"publish_time": "2024-12-05", "title": "A Context-aware Framework for Translation-mediated Conversations", "paper_summary": "Effective communication is fundamental to any interaction, yet challenges\narise when participants do not share a common language. Automatic translation\nsystems offer a powerful solution to bridge language barriers in such\nscenarios, but they introduce errors that can lead to misunderstandings and\nconversation breakdown. A key issue is that current systems fail to incorporate\nthe rich contextual information necessary to resolve ambiguities and omitted\ndetails, resulting in literal, inappropriate, or misaligned translations. In\nthis work, we present a framework to improve large language model-based\ntranslation systems by incorporating contextual information in bilingual\nconversational settings. During training, we leverage context-augmented\nparallel data, which allows the model to generate translations sensitive to\nconversational history. During inference, we perform quality-aware decoding\nwith context-aware metrics to select the optimal translation from a pool of\ncandidates. We validate both components of our framework on two task-oriented\ndomains: customer chat and user-assistant interaction. Across both settings,\nour framework consistently results in better translations than state-of-the-art\nsystems like GPT-4o and TowerInstruct, as measured by multiple automatic\ntranslation quality metrics on several language pairs. We also show that the\nresulting model leverages context in an intended and interpretable way,\nimproving consistency between the conveyed message and the generated\ntranslations.", "paper_summary_zh": "有效的溝通對於任何互動都至關重要，然而，當參與者不共享共同語言時，挑戰就會出現。自動翻譯系統提供了一個強大的解決方案，可以在這種情況下消除語言障礙，但它們會引入錯誤，從而導致誤解和對話中斷。一個關鍵問題是當前系統未能納入解決歧義和省略細節所需的豐富上下文資訊，導致翻譯過於生硬、不恰當或不一致。在這項工作中，我們提出了一個框架，通過在雙語對話場景中納入上下文資訊來改進基於大型語言模型的翻譯系統。在訓練期間，我們利用上下文增強平行數據，這允許模型生成對話歷史敏感的翻譯。在推理過程中，我們使用上下文感知指標執行品質感知解碼，從候選池中選擇最佳翻譯。我們在兩個面向任務的領域（客戶聊天和使用者助理互動）驗證了我們框架的兩個組成部分。在兩種設定中，我們的框架始終產生比最先進的系統（如 GPT-4o 和 TowerInstruct）更好的翻譯，這是通過多種自動翻譯品質指標在多種語言對上測量的。我們還表明，生成的模型以預期和可解釋的方式利用上下文，改進了傳達訊息和生成翻譯之間的一致性。", "author": "José Pombal et.al.", "authors": "José Pombal, Sweta Agrawal, Patrick Fernandes, Emmanouil Zaranis, André F. T. Martins", "id": "2412.04205v1", "paper_url": "http://arxiv.org/abs/2412.04205v1", "repo": "null"}}