{"2411.02685": {"publish_time": "2024-11-04", "title": "Geometry of naturalistic object representations in recurrent neural network models of working memory", "paper_summary": "Working memory is a central cognitive ability crucial for intelligent\ndecision-making. Recent experimental and computational work studying working\nmemory has primarily used categorical (i.e., one-hot) inputs, rather than\necologically relevant, multidimensional naturalistic ones. Moreover, studies\nhave primarily investigated working memory during single or few cognitive\ntasks. As a result, an understanding of how naturalistic object information is\nmaintained in working memory in neural networks is still lacking. To bridge\nthis gap, we developed sensory-cognitive models, comprising a convolutional\nneural network (CNN) coupled with a recurrent neural network (RNN), and trained\nthem on nine distinct N-back tasks using naturalistic stimuli. By examining the\nRNN's latent space, we found that: (1) Multi-task RNNs represent both\ntask-relevant and irrelevant information simultaneously while performing tasks;\n(2) The latent subspaces used to maintain specific object properties in vanilla\nRNNs are largely shared across tasks, but highly task-specific in gated RNNs\nsuch as GRU and LSTM; (3) Surprisingly, RNNs embed objects in new\nrepresentational spaces in which individual object features are less\northogonalized relative to the perceptual space; (4) The transformation of\nworking memory encodings (i.e., embedding of visual inputs in the RNN latent\nspace) into memory was shared across stimuli, yet the transformations governing\nthe retention of a memory in the face of incoming distractor stimuli were\ndistinct across time. Our findings indicate that goal-driven RNNs employ\nchronological memory subspaces to track information over short time spans,\nenabling testable predictions with neural data.", "paper_summary_zh": "工作記憶是一種對於智能決策制定至關重要的核心認知能力。最近的研究工作記憶的實驗和計算工作主要使用分類（即一熱）輸入，而不是生態相關的多維自然輸入。此外，研究主要調查單一或少數認知任務期間的工作記憶。因此，對於神經網路中如何維持自然物體資訊的工作記憶，仍缺乏了解。為了彌補這個差距，我們開發了感官認知模型，包括卷積神經網路（CNN）與遞迴神經網路（RNN）相結合，並使用自然刺激在九個不同的 N-back 任務上對它們進行訓練。通過檢查 RNN 的潛在空間，我們發現：(1) 多任務 RNN 在執行任務時同時表示與任務相關和不相關的資訊；(2) 在香草 RNN 中用於維護特定物件屬性的潛在子空間在任務之間基本上是共享的，但在門控 RNN（例如 GRU 和 LSTM）中具有高度任務特異性；(3) 令人驚訝的是，RNN 將物件嵌入新的表示空間中，其中個別物件特徵相對於感知空間的正交化程度較低；(4) 工作記憶編碼（即視覺輸入在 RNN 潛在空間中的嵌入）轉換為記憶在所有刺激中都是共享的，但面對輸入的干擾刺激時，控制記憶保留的轉換在時間上是不同的。我們的研究結果表明，目標驅動的 RNN 使用時間順序記憶子空間來追蹤短時間範圍內的資訊，從而能夠使用神經數據進行可測試的預測。", "author": "Xiaoxuan Lei et.al.", "authors": "Xiaoxuan Lei, Takuya Ito, Pouya Bashivan", "id": "2411.02685v1", "paper_url": "http://arxiv.org/abs/2411.02685v1", "repo": "null"}}