{"2409.04081": {"publish_time": "2024-09-06", "title": "UI-JEPA: Towards Active Perception of User Intent through Onscreen User Activity", "paper_summary": "Generating user intent from a sequence of user interface (UI) actions is a\ncore challenge in comprehensive UI understanding. Recent advancements in\nmultimodal large language models (MLLMs) have led to substantial progress in\nthis area, but their demands for extensive model parameters, computing power,\nand high latency makes them impractical for scenarios requiring lightweight,\non-device solutions with low latency or heightened privacy. Additionally, the\nlack of high-quality datasets has hindered the development of such lightweight\nmodels. To address these challenges, we propose UI-JEPA, a novel framework that\nemploys masking strategies to learn abstract UI embeddings from unlabeled data\nthrough self-supervised learning, combined with an LLM decoder fine-tuned for\nuser intent prediction. We also introduce two new UI-grounded multimodal\ndatasets, \"Intent in the Wild\" (IIW) and \"Intent in the Tame\" (IIT), designed\nfor few-shot and zero-shot UI understanding tasks. IIW consists of 1.7K videos\nacross 219 intent categories, while IIT contains 914 videos across 10\ncategories. We establish the first baselines for these datasets, showing that\nrepresentations learned using a JEPA-style objective, combined with an LLM\ndecoder, can achieve user intent predictions that match the performance of\nstate-of-the-art large MLLMs, but with significantly reduced annotation and\ndeployment resources. Measured by intent similarity scores, UI-JEPA outperforms\nGPT-4 Turbo and Claude 3.5 Sonnet by 10.0% and 7.2% respectively, averaged\nacross two datasets. Notably, UI-JEPA accomplishes the performance with a 50.5x\nreduction in computational cost and a 6.6x improvement in latency in the IIW\ndataset. These results underscore the effectiveness of UI-JEPA, highlighting\nits potential for lightweight, high-performance UI understanding.", "paper_summary_zh": "<paragraph>從使用者介面 (UI) 動作序列中產生使用者意圖，是全面理解 UI 的核心挑戰。多模態大型語言模型 (MLLM) 的最新進展已促使此領域取得實質進展，但其對大量模型參數、運算能力和高延遲性的需求，使其不適用於需要輕量級、低延遲或高度隱私的裝置解決方案。此外，缺乏高品質資料集已阻礙此類輕量級模型的開發。為了應對這些挑戰，我們提出了 UI-JEPA，這是一個新穎的架構，採用遮罩策略，透過自監督學習從未標註的資料中學習抽象 UI 內嵌，並結合一個針對使用者意圖預測進行微調的 LLM 解碼器。我們還引入了兩個新的 UI 基礎多模態資料集，「Intent in the Wild」(IIW) 和「Intent in the Tame」(IIT)，專為少量樣本和零樣本 UI 理解任務而設計。IIW 包含 219 個意圖類別中的 1.7K 個影片，而 IIT 則包含 10 個類別中的 914 個影片。我們為這些資料集建立了第一個基準，表明使用 JEPA 風格目標學習的表徵，結合 LLM 解碼器，可以達成與最先進的大型 MLLM 相匹配的使用者意圖預測，但標註和部署資源卻大幅減少。以意圖相似性分數衡量，UI-JEPA 在兩個資料集的平均表現優於 GPT-4 Turbo 和 Claude 3.5 Sonnet，分別高出 10.0% 和 7.2%。值得注意的是，UI-JEPA 以 50.5 倍的運算成本降低和 6.6 倍的 IIW 資料集延遲性改善，達到了此效能。這些結果強調了 UI-JEPA 的有效性，突顯其在輕量級、高性能 UI 理解方面的潛力。</paragraph>", "author": "Yicheng Fu et.al.", "authors": "Yicheng Fu, Raviteja Anantha, Prabal Vashisht, Jianpeng Cheng, Etai Littwin", "id": "2409.04081v1", "paper_url": "http://arxiv.org/abs/2409.04081v1", "repo": "null"}}