{"2502.09863": {"publish_time": "2025-02-14", "title": "Solvable Dynamics of Self-Supervised Word Embeddings and the Emergence of Analogical Reasoning", "paper_summary": "The remarkable success of large language models relies on their ability to\nimplicitly learn structured latent representations from the pretraining corpus.\nAs a simpler surrogate for representation learning in language modeling, we\nstudy a class of solvable contrastive self-supervised algorithms which we term\nquadratic word embedding models. These models resemble the word2vec algorithm\nand perform similarly on downstream tasks. Our main contributions are\nanalytical solutions for both the training dynamics (under certain\nhyperparameter choices) and the final word embeddings, given in terms of only\nthe corpus statistics. Our solutions reveal that these models learn orthogonal\nlinear subspaces one at a time, each one incrementing the effective rank of the\nembeddings until model capacity is saturated. Training on WikiText, we find\nthat the top subspaces represent interpretable concepts. Finally, we use our\ndynamical theory to predict how and when models acquire the ability to complete\nanalogies.", "paper_summary_zh": "大型語言模型的顯著成功，在於它們從預訓練語料庫中隱含地學習結構化潛在表徵的能力。作為語言模型中表徵學習的較簡單替代方案，我們研究了一類可解的對比自我監督演算法，我們稱之為二次詞嵌入模型。這些模型類似於 word2vec 演算法，且在下游任務上的表現類似。我們的貢獻在於，僅根據語料庫統計資料，就訓練動態（在特定超參數選擇下）和最終詞嵌入提供了分析解。我們的解法揭示了這些模型一次學習一個正交線性子空間，每個子空間都會增加嵌入的有效秩，直到模型容量飽和。在 WikiText 上進行訓練，我們發現頂級子空間代表可解釋的概念。最後，我們使用我們的動態理論來預測模型如何以及何時獲得完成類比的能力。", "author": "Dhruva Karkada et.al.", "authors": "Dhruva Karkada, James B. Simon, Yasaman Bahri, Michael R. DeWeese", "id": "2502.09863v1", "paper_url": "http://arxiv.org/abs/2502.09863v1", "repo": "null"}}