{"2411.08171": {"publish_time": "2024-11-12", "title": "Comprehensive and Comparative Analysis between Transfer Learning and Custom Built VGG and CNN-SVM Models for Wildfire Detection", "paper_summary": "Contemporary Artificial Intelligence (AI) and Machine Learning (ML) research\nplaces a significant emphasis on transfer learning, showcasing its\ntransformative potential in enhancing model performance across diverse domains.\nThis paper examines the efficiency and effectiveness of transfer learning in\nthe context of wildfire detection. Three purpose-built models -- Visual\nGeometry Group (VGG)-7, VGG-10, and Convolutional Neural Network (CNN)-Support\nVector Machine(SVM) CNN-SVM -- are rigorously compared with three pretrained\nmodels -- VGG-16, VGG-19, and Residual Neural Network (ResNet) ResNet101. We\ntrained and evaluated these models using a dataset that captures the\ncomplexities of wildfires, incorporating variables such as varying lighting\nconditions, time of day, and diverse terrains. The objective is to discern how\ntransfer learning performs against models trained from scratch in addressing\nthe intricacies of the wildfire detection problem. By assessing the performance\nmetrics, including accuracy, precision, recall, and F1 score, a comprehensive\nunderstanding of the advantages and disadvantages of transfer learning in this\nspecific domain is obtained. This study contributes valuable insights to the\nongoing discourse, guiding future directions in AI and ML research. Keywords:\nWildfire prediction, deep learning, machine learning fire, detection", "paper_summary_zh": "現代人工智慧（AI）和機器學習（ML）研究\n非常重視遷移學習，展示其在提升不同領域模型效能的轉型潛力。\n本文探討遷移學習在野火偵測背景下的效率和效能。三個專門建構的模型——視覺\n幾何群組（VGG）-7、VGG-10 和卷積神經網路（CNN）-支援向量機（SVM）CNN-SVM——與三個預先訓練的\n模型——VGG-16、VGG-19 和殘差神經網路（ResNet）ResNet101 嚴格比較。我們\n使用捕捉野火複雜性的資料集訓練並評估這些模型，納入變數，例如不同的光照\n條件、時間和不同的地形。目標是辨別遷移學習如何針對從頭訓練的模型執行，以解決\n野火偵測問題的複雜性。透過評估效能指標，包括準確度、精確度、召回率和 F1 分數，獲得對遷移學習在此\n特定領域的優缺點的全面了解。本研究為持續的討論提供寶貴的見解，引導 AI 和 ML 研究的未來方向。關鍵字：\n野火預測、深度學習、機器學習火災、偵測", "author": "Aditya V. Jonnalagadda et.al.", "authors": "Aditya V. Jonnalagadda, Hashim A. Hashim, Andrew Harris", "id": "2411.08171v1", "paper_url": "http://arxiv.org/abs/2411.08171v1", "repo": "null"}}