{"2504.02417": {"publish_time": "2025-04-03", "title": "Leveraging Static Relationships for Intra-Type and Inter-Type Message Passing in Video Question Answering", "paper_summary": "Video Question Answering (VideoQA) is an important research direction in the\nfield of artificial intelligence, enabling machines to understand video content\nand perform reasoning and answering based on natural language questions.\nAlthough methods based on static relationship reasoning have made certain\nprogress, there are still deficiencies in the accuracy of static relationship\nrecognition and representation, and they have not fully utilized the static\nrelationship information in videos for in-depth reasoning and analysis.\nTherefore, this paper proposes a reasoning method for intra-type and inter-type\nmessage passing based on static relationships. This method constructs a dual\ngraph for intra-type message passing reasoning and builds a heterogeneous graph\nbased on static relationships for inter-type message passing reasoning. The\nintra-type message passing reasoning model captures the neighborhood\ninformation of targets and relationships related to the question in the dual\ngraph, updating the dual graph to obtain intra-type clues for answering the\nquestion. The inter-type message passing reasoning model captures the\nneighborhood information of targets and relationships from different categories\nrelated to the question in the heterogeneous graph, updating the heterogeneous\ngraph to obtain inter-type clues for answering the question. Finally, the\nanswers are inferred by combining the intra-type and inter-type clues based on\nstatic relationships. Experimental results on the ANetQA and Next-QA datasets\ndemonstrate the effectiveness of this method.", "paper_summary_zh": "<paragraph>視訊問答（VideoQA）是人工智慧領域的一個重要研究方向，它讓機器能夠理解視訊內容，並根據自然語言問題進行推理和回答。雖然基於靜態關係推理的方法已經取得了一定的進展，但在靜態關係的識別和表示的準確性上仍存在不足，且尚未充分利用視訊中的靜態關係資訊進行深入的推理和分析。因此，本文提出了一種基於靜態關係的類型內和類型間訊息傳遞推理方法。該方法構建了一個用於類型內訊息傳遞推理的雙圖，並基於靜態關係構建了一個用於類型間訊息傳遞推理的異質圖。類型內訊息傳遞推理模型捕獲雙圖中與問題相關的目標和關係的鄰域資訊，更新雙圖以獲得回答問題的類型內線索。類型間訊息傳遞推理模型捕獲異質圖中與問題相關的不同類別的目標和關係的鄰域資訊，更新異質圖以獲得回答問題的類型間線索。最後，通過結合基於靜態關係的類型內和類型間線索來推斷答案。在 ANetQA 和 Next-QA 數據集上的實驗結果證明了該方法的有效性。</paragraph>\n", "author": "Lili Liang et.al.", "authors": "Lili Liang, Guanglu Sun", "id": "2504.02417v1", "paper_url": "http://arxiv.org/abs/2504.02417v1", "repo": "null"}}