{"2407.16067": {"publish_time": "2024-07-22", "title": "LCA-on-the-Line: Benchmarking Out-of-Distribution Generalization with Class Taxonomies", "paper_summary": "We tackle the challenge of predicting models' Out-of-Distribution (OOD)\nperformance using in-distribution (ID) measurements without requiring OOD data.\nExisting evaluations with \"Effective Robustness\", which use ID accuracy as an\nindicator of OOD accuracy, encounter limitations when models are trained with\ndiverse supervision and distributions, such as class labels (Vision Models,\nVMs, on ImageNet) and textual descriptions (Visual-Language Models, VLMs, on\nLAION). VLMs often generalize better to OOD data than VMs despite having\nsimilar or lower ID performance. To improve the prediction of models' OOD\nperformance from ID measurements, we introduce the Lowest Common Ancestor\n(LCA)-on-the-Line framework. This approach revisits the established concept of\nLCA distance, which measures the hierarchical distance between labels and\npredictions within a predefined class hierarchy, such as WordNet. We assess 75\nmodels using ImageNet as the ID dataset and five significantly shifted OOD\nvariants, uncovering a strong linear correlation between ID LCA distance and\nOOD top-1 accuracy. Our method provides a compelling alternative for\nunderstanding why VLMs tend to generalize better. Additionally, we propose a\ntechnique to construct a taxonomic hierarchy on any dataset using K-means\nclustering, demonstrating that LCA distance is robust to the constructed\ntaxonomic hierarchy. Moreover, we demonstrate that aligning model predictions\nwith class taxonomies, through soft labels or prompt engineering, can enhance\nmodel generalization. Open source code in our Project Page:\nhttps://elvishelvis.github.io/papers/lca/.", "paper_summary_zh": "<paragraph>我們使用分佈內 (ID) 度量來解決預測模型的分布外 (OOD) 效能的挑戰，而不需要 OOD 資料。\n現有的「有效魯棒性」評估將 ID 精確度用作 OOD 精確度的指標，當模型使用不同的監督和分佈（例如類別標籤（視覺模型，VM，在 ImageNet 上）和文字描述（視覺語言模型，VLM，在 LAION 上））訓練時會遇到限制。儘管具有相似或較低的 ID 效能，但 VLM 通常比 VM 更能概括到 OOD 資料。為了從 ID 度量改進模型的 OOD 效能預測，我們引入了線性上的最低共同祖先 (LCA) 架構。此方法重新審視了已建立的 LCA 距離概念，該概念測量標籤和預測之間的層次距離，在預定義的類別層次結構中，例如 WordNet。我們使用 ImageNet 作為 ID 資料集和五個顯著轉移的 OOD 變體評估了 75 個模型，發現 ID LCA 距離和 OOD 前 1 精確度之間存在強烈的線性相關性。我們的模型提供了一個令人信服的替代方案，用於了解為什麼 VLM 傾向於更好地概括。此外，我們提出了一種使用 K 均值聚類在任何資料集上構建分類層次結構的技術，證明 LCA 距離對構建的分類層次結構具有魯棒性。此外，我們證明了通過軟標籤或提示工程將模型預測與類別分類保持一致，可以增強模型概括。開放原始碼在我們的專案頁面：\nhttps://elvishelvis.github.io/papers/lca/。</paragraph>", "author": "Jia Shi et.al.", "authors": "Jia Shi, Gautam Gare, Jinjin Tian, Siqi Chai, Zhiqiu Lin, Arun Vasudevan, Di Feng, Francesco Ferroni, Shu Kong", "id": "2407.16067v1", "paper_url": "http://arxiv.org/abs/2407.16067v1", "repo": "null"}}