{"2406.04145": {"publish_time": "2024-06-06", "title": "Every Answer Matters: Evaluating Commonsense with Probabilistic Measures", "paper_summary": "Large language models have demonstrated impressive performance on commonsense\ntasks; however, these tasks are often posed as multiple-choice questions,\nallowing models to exploit systematic biases. Commonsense is also inherently\nprobabilistic with multiple correct answers. The purpose of \"boiling water\"\ncould be making tea and cooking, but it also could be killing germs. Existing\ntasks do not capture the probabilistic nature of common sense. To this end, we\npresent commonsense frame completion (CFC), a new generative task that\nevaluates common sense via multiple open-ended generations. We also propose a\nmethod of probabilistic evaluation that strongly correlates with human\njudgments. Humans drastically outperform strong language model baselines on our\ndataset, indicating this approach is both a challenging and useful evaluation\nof machine common sense.", "paper_summary_zh": "大型語言模型在常識任務上表現出色；然而，這些任務通常被表述為多選題，允許模型利用系統性偏差。常識本質上也是機率性的，有多個正確答案。「煮沸水」的目的可能是泡茶和烹飪，但也可能是殺死細菌。現有的任務並未捕捉到常識的機率性。為此，我們提出常識框架完成 (CFC)，這是一種新的生成任務，透過多個開放式生成來評估常識。我們還提出了一種機率性評估方法，與人類的判斷密切相關。人類在我們的資料集上大幅優於強大的語言模型基準，這表示這種方法既具有挑戰性，又是對機器常識有用的評估。", "author": "Qi Cheng et.al.", "authors": "Qi Cheng, Michael Boratko, Pranay Kumar Yelugam, Tim O'Gorman, Nalini Singh, Andrew McCallum, Xiang Lorraine Li", "id": "2406.04145v1", "paper_url": "http://arxiv.org/abs/2406.04145v1", "repo": "null"}}