{"2408.14744": {"publish_time": "2024-08-27", "title": "RSTeller: Scaling Up Visual Language Modeling in Remote Sensing with Rich Linguistic Semantics from Openly Available Data and Large Language Models", "paper_summary": "Abundant, well-annotated multimodal data in remote sensing are pivotal for\naligning complex visual remote sensing (RS) scenes with human language,\nenabling the development of specialized vision language models across diverse\nRS interpretation tasks. However, annotating RS images with rich linguistic\nsemantics at scale demands expertise in RS and substantial human labor, making\nit costly and often impractical. In this study, we propose a workflow that\nleverages large language models (LLMs) to generate multimodal datasets with\nsemantically rich captions at scale from plain OpenStreetMap (OSM) data for\nimages sourced from the Google Earth Engine (GEE) platform. This approach\nfacilitates the generation of paired remote sensing data and can be readily\nscaled up using openly available data. Within this framework, we present\nRSTeller, a multimodal dataset comprising over 1 million RS images, each\naccompanied by multiple descriptive captions. Extensive experiments demonstrate\nthat RSTeller enhances the performance of multiple existing vision language\nmodels for RS scene understanding through continual pre-training. Our\nmethodology significantly reduces the manual effort and expertise needed for\nannotating remote sensing imagery while democratizing access to high-quality\nannotated data. This advancement fosters progress in visual language modeling\nand encourages broader participation in remote sensing research and\napplications. The RSTeller dataset is available at\nhttps://github.com/SlytherinGe/RSTeller.", "paper_summary_zh": "豐富且標註完善的遙測多模態資料對於將複雜的視覺遙測 (RS) 場景與人類語言對齊至關重要，讓跨不同 RS 解釋任務的專門視覺語言模型得以發展。然而，大規模使用豐富語言語義標註 RS 影像是需要 RS 專業知識和大量人力，這使得成本高昂且通常不切實際。在本研究中，我們提出一個工作流程，利用大型語言模型 (LLM) 從 Google Earth Engine (GEE) 平台取得的影像中，產生來自一般 OpenStreetMap (OSM) 資料的語義豐富標題，以大規模產生多模態資料集。此方法有助於產生配對的遙測資料，並且可以使用公開取得的資料輕鬆擴充。在這個架構中，我們提出 RSTeller，一個包含超過 100 萬張 RS 影像的多模態資料集，每張影像都附有多個描述性標題。廣泛的實驗證明 RSTeller 透過持續預訓練，增強了多個現有視覺語言模型在 RS 場景理解方面的效能。我們的技術大幅減少了標註遙測影像所需的手動工作和專業知識，同時讓高品質標註資料的取得更為民主化。這項進展促進了視覺語言建模，並鼓勵更廣泛地參與遙測研究和應用。RSTeller 資料集可在 https://github.com/SlytherinGe/RSTeller 取得。", "author": "Junyao Ge et.al.", "authors": "Junyao Ge, Yang Zheng, Kaitai Guo, Jimin Liang", "id": "2408.14744v1", "paper_url": "http://arxiv.org/abs/2408.14744v1", "repo": "https://github.com/slytheringe/rsteller"}}