{"2408.15501": {"publish_time": "2024-08-28", "title": "MODULI: Unlocking Preference Generalization via Diffusion Models for Offline Multi-Objective Reinforcement Learning", "paper_summary": "Multi-objective Reinforcement Learning (MORL) seeks to develop policies that\nsimultaneously optimize multiple conflicting objectives, but it requires\nextensive online interactions. Offline MORL provides a promising solution by\ntraining on pre-collected datasets to generalize to any preference upon\ndeployment. However, real-world offline datasets are often conservatively and\nnarrowly distributed, failing to comprehensively cover preferences, leading to\nthe emergence of out-of-distribution (OOD) preference areas. Existing offline\nMORL algorithms exhibit poor generalization to OOD preferences, resulting in\npolicies that do not align with preferences. Leveraging the excellent\nexpressive and generalization capabilities of diffusion models, we propose\nMODULI (Multi-objective Diffusion Planner with Sliding Guidance), which employs\na preference-conditioned diffusion model as a planner to generate trajectories\nthat align with various preferences and derive action for decision-making. To\nachieve accurate generation, MODULI introduces two return normalization methods\nunder diverse preferences for refining guidance. To further enhance\ngeneralization to OOD preferences, MODULI proposes a novel sliding guidance\nmechanism, which involves training an additional slider adapter to capture the\ndirection of preference changes. Incorporating the slider, it transitions from\nin-distribution (ID) preferences to generating OOD preferences, patching, and\nextending the incomplete Pareto front. Extensive experiments on the D4MORL\nbenchmark demonstrate that our algorithm outperforms state-of-the-art Offline\nMORL baselines, exhibiting excellent generalization to OOD preferences.", "paper_summary_zh": "多目標強化學習 (MORL) 旨在開發策略，同時最佳化多個衝突目標，但它需要廣泛的線上互動。離線 MORL 提供了一個有前途的解決方案，透過在預先收集的資料集上訓練，以便在部署時概括到任何偏好。然而，真實世界的離線資料集通常保守且分佈狹窄，無法全面涵蓋偏好，導致出現分佈外 (OOD) 偏好區域。現有的離線 MORL 演算法對 OOD 偏好表現出不佳的概括性，導致產生的策略與偏好不符。我們利用擴散模型出色的表達和概括能力，提出了 MODULI（具有滑動引導的多目標擴散規劃器），它採用偏好條件擴散模型作為規劃器，生成與各種偏好相符的軌跡，並推導出決策制定所需的動作。為了實現準確生成，MODULI 引入了兩種回報正規化方法，在不同的偏好下用於精煉引導。為了進一步增強對 OOD 偏好的概括性，MODULI 提出了一種新穎的滑動引導機制，其中涉及訓練一個額外的滑塊適配器來捕捉偏好變化的方向。結合滑塊，它從分佈內 (ID) 偏好過渡到生成 OOD 偏好、修補和擴充不完整的帕累托前緣。在 D4MORL 基準上的廣泛實驗表明，我們的演算法優於最先進的離線 MORL 基準，對 OOD 偏好表現出出色的概括性。", "author": "Yifu Yuan et.al.", "authors": "Yifu Yuan, Zhenrui Zheng, Zibin Dong, Jianye Hao", "id": "2408.15501v1", "paper_url": "http://arxiv.org/abs/2408.15501v1", "repo": "null"}}