{"2407.11802": {"publish_time": "2024-07-16", "title": "Invariant Consistency for Knowledge Distillation", "paper_summary": "Knowledge distillation (KD) involves transferring the knowledge from one\nneural network to another, often from a larger, well-trained model (teacher) to\na smaller, more efficient model (student). Traditional KD methods minimize the\nKullback-Leibler (KL) divergence between the probabilistic outputs of the\nteacher and student networks. However, this approach often overlooks crucial\nstructural knowledge embedded within the teacher's network. In this paper, we\nintroduce Invariant Consistency Distillation (ICD), a novel methodology\ndesigned to enhance KD by ensuring that the student model's representations are\nconsistent with those of the teacher. Our approach combines contrastive\nlearning with an explicit invariance penalty, capturing significantly more\ninformation from the teacher's representation of the data. Our results on\nCIFAR-100 demonstrate that ICD outperforms traditional KD techniques and\nsurpasses 13 state-of-the-art methods. In some cases, the student model even\nexceeds the teacher model in terms of accuracy. Furthermore, we successfully\ntransfer our method to other datasets, including Tiny ImageNet and STL-10. The\ncode will be made public soon.", "paper_summary_zh": "知識蒸餾 (KD) 涉及將知識從一個神經網路轉移到另一個神經網路，通常從一個較大、訓練良好的模型（教師）轉移到一個較小、更有效率的模型（學生）。傳統的 KD 方法將教師和學生網路的機率輸出之間的 Kullback-Leibler (KL) 差異最小化。然而，這種方法通常忽略了教師網路中嵌入的關鍵結構知識。在本文中，我們引入了不變一致性蒸餾 (ICD)，這是一種新穎的方法，旨在透過確保學生模型的表徵與教師的表徵一致來增強 KD。我們的做法結合了對比學習與明確的不變罰則，從教師對資料的表徵中擷取更多資訊。我們在 CIFAR-100 上的結果證明，ICD 優於傳統的 KD 技術，並超越了 13 種最先進的方法。在某些情況下，學生模型甚至在準確度方面超過了教師模型。此外，我們成功地將我們的模型轉移到其他資料集，包括 Tiny ImageNet 和 STL-10。程式碼將很快公開。", "author": "Nikolaos Giakoumoglou et.al.", "authors": "Nikolaos Giakoumoglou, Tania Stathaki", "id": "2407.11802v1", "paper_url": "http://arxiv.org/abs/2407.11802v1", "repo": "null"}}