{"2405.12514": {"publish_time": "2024-05-21", "title": "Future You: A Conversation with an AI-Generated Future Self Reduces Anxiety, Negative Emotions, and Increases Future Self-Continuity", "paper_summary": "We introduce \"Future You,\" an interactive, brief, single-session, digital\nchat intervention designed to improve future self-continuity--the degree of\nconnection an individual feels with a temporally distant future self--a\ncharacteristic that is positively related to mental health and wellbeing. Our\nsystem allows users to chat with a relatable yet AI-powered virtual version of\ntheir future selves that is tuned to their future goals and personal qualities.\nTo make the conversation realistic, the system generates a \"synthetic\nmemory\"--a unique backstory for each user--that creates a throughline between\nthe user's present age (between 18-30) and their life at age 60. The \"Future\nYou\" character also adopts the persona of an age-progressed image of the user's\npresent self. After a brief interaction with the \"Future You\" character, users\nreported decreased anxiety, and increased future self-continuity. This is the\nfirst study successfully demonstrating the use of personalized AI-generated\ncharacters to improve users' future self-continuity and wellbeing.", "paper_summary_zh": "我們推出「未來你」，一種互動式、簡短、單一會話的數位聊天介入，旨在提升未來的自我連續性，也就是個人與時間上遙遠的未來自我之間感受到的連結程度，這項特質與心理健康和幸福感呈正相關。我們的系統讓使用者可以與一個親切，但由 AI 驅動的虛擬未來自我版本聊天，這個版本根據使用者的未來目標和個人特質進行調整。為了讓對話更真實，系統會產生一個「合成記憶」，也就是每位使用者的獨特背景故事，在使用者目前的年齡（18-30 歲）和 60 歲的生活之間建立一條貫穿線。「未來你」角色也會採用使用者目前自我的年齡進展影像的人格。與「未來你」角色進行簡短互動後，使用者回報焦慮感降低，未來的自我連續性增加。這是第一個成功展示使用個人化 AI 生成的角色來提升使用者未來自我連續性和幸福感的案例研究。", "author": "Pat Pataranutaporn et.al.", "authors": "Pat Pataranutaporn, Kavin Winson, Peggy Yin, Auttasak Lapapirojn, Pichayoot Ouppaphan, Monchai Lertsutthiwong, Pattie Maes, Hal Hershfield", "id": "2405.12514v2", "paper_url": "http://arxiv.org/abs/2405.12514v2", "repo": "null"}}