{"2407.13300": {"publish_time": "2024-07-18", "title": "Robust ASR Error Correction with Conservative Data Filtering", "paper_summary": "Error correction (EC) based on large language models is an emerging\ntechnology to enhance the performance of automatic speech recognition (ASR)\nsystems. Generally, training data for EC are collected by automatically pairing\na large set of ASR hypotheses (as sources) and their gold references (as\ntargets). However, the quality of such pairs is not guaranteed, and we observed\nvarious types of noise which can make the EC models brittle, e.g. inducing\novercorrection in out-of-domain (OOD) settings. In this work, we propose two\nfundamental criteria that EC training data should satisfy: namely, EC targets\nshould (1) improve linguistic acceptability over sources and (2) be inferable\nfrom the available context (e.g. source phonemes). Through these criteria, we\nidentify low-quality EC pairs and train the models not to make any correction\nin such cases, the process we refer to as conservative data filtering. In our\nexperiments, we focus on Japanese ASR using a strong Conformer-CTC as the\nbaseline and finetune Japanese LLMs for EC. Through our evaluation on a suite\nof 21 internal benchmarks, we demonstrate that our approach can significantly\nreduce overcorrection and improve both the accuracy and quality of ASR results\nin the challenging OOD settings.", "paper_summary_zh": "基於大型語言模型的錯誤修正 (EC) 是一種新興技術，用於提升自動語音辨識 (ASR) 系統的效能。一般來說，EC 的訓練資料會透過自動配對大量的 ASR 假設（作為來源）和其黃金參考（作為目標）來收集。然而，這些配對的品質並非有保證，而且我們觀察到各種類型的雜訊，這些雜訊可能會讓 EC 模型變得脆弱，例如在領域外 (OOD) 設定中導致過度修正。在這項工作中，我們提出了 EC 訓練資料應該滿足的兩個基本準則：也就是說，EC 目標應該 (1) 改善來源的語言可接受度，以及 (2) 可以從可用脈絡（例如來源音素）推論出來。透過這些準則，我們找出低品質的 EC 配對，並訓練模型在這種情況下不進行任何修正，這個過程我們稱為保守資料過濾。在我們的實驗中，我們專注於使用強大的 Conformer-CTC 作為基準的日語 ASR，並微調日語 LLM 以進行 EC。透過我們對 21 個內部基準的評估，我們證明了我們的方法可以大幅減少過度修正，並改善 ASR 結果在具有挑戰性的 OOD 設定中的準確度和品質。", "author": "Takuma Udagawa et.al.", "authors": "Takuma Udagawa, Masayuki Suzuki, Masayasu Muraoka, Gakuto Kurata", "id": "2407.13300v1", "paper_url": "http://arxiv.org/abs/2407.13300v1", "repo": "null"}}