{"2412.06712": {"publish_time": "2024-12-09", "title": "How to Merge Your Multimodal Models Over Time?", "paper_summary": "Model merging combines multiple expert models - finetuned from a base\nfoundation model on diverse tasks and domains - into a single, more capable\nmodel. However, most existing model merging approaches assume that all experts\nare available simultaneously. In reality, new tasks and domains emerge\nprogressively over time, requiring strategies to integrate the knowledge of\nexpert models as they become available: a process we call temporal model\nmerging. The temporal dimension introduces unique challenges not addressed in\nprior work, raising new questions such as: when training for a new task, should\nthe expert model start from the merged past experts or from the original base\nmodel? Should we merge all models at each time step? Which merging techniques\nare best suited for temporal merging? Should different strategies be used to\ninitialize the training and deploy the model? To answer these questions, we\npropose a unified framework called TIME - Temporal Integration of Model\nExpertise - which defines temporal model merging across three axes: (1)\nInitialization Phase, (2) Deployment Phase, and (3) Merging Technique. Using\nTIME, we study temporal model merging across model sizes, compute budgets, and\nlearning horizons on the FoMo-in-Flux benchmark. Our comprehensive suite of\nexperiments across TIME allows us to uncover key insights for temporal model\nmerging, offering a better understanding of current challenges and best\npractices for effective temporal model merging.", "paper_summary_zh": "模型合併結合多個專家模型，這些模型從基礎模型微調而來，用於不同的任務和領域，進而形成單一、功能更強大的模型。然而，現有的大多數模型合併方法都假設所有專家模型都能同時使用。實際上，新的任務和領域會隨著時間推移而逐漸出現，這需要策略來整合專家模型的知識，因為這些知識會隨著時間推移而可用：我們將此過程稱為時間模型合併。時間維度引入了先前工作中未解決的獨特挑戰，提出了新的問題，例如：在為新任務訓練時，專家模型應從合併的過往專家開始，還是從原始基礎模型開始？我們是否應在每個時間步驟合併所有模型？哪些合併技術最適合時間合併？應使用不同的策略來初始化訓練並部署模型嗎？為了回答這些問題，我們提出一個統一的框架，稱為 TIME（模型專業知識的時間整合），它定義了跨三個軸的時間模型合併：(1) 初始化階段，(2) 部署階段，和 (3) 合併技術。使用 TIME，我們研究了跨模型大小、計算預算和 FoMo-in-Flux 基準上的學習範圍的時間模型合併。我們在 TIME 中進行的全面實驗套件讓我們得以發現時間模型合併的重要見解，進而更深入了解當前挑戰和有效時間模型合併的最佳實務。", "author": "Sebastian Dziadzio et.al.", "authors": "Sebastian Dziadzio, Vishaal Udandarao, Karsten Roth, Ameya Prabhu, Zeynep Akata, Samuel Albanie, Matthias Bethge", "id": "2412.06712v1", "paper_url": "http://arxiv.org/abs/2412.06712v1", "repo": "null"}}