{"2408.16241": {"publish_time": "2024-08-29", "title": "Making the Most of your Model: Methods for Finetuning and Applying Pretrained Transformers", "paper_summary": "This thesis provides methods and analysis of models which make progress on\nthis goal. The techniques outlined are task agnostic, and should provide\nbenefit when used with nearly any transformer LM. We introduce two new\nfinetuning methods which add new capabilities to the models they are used on.\nThe first adds a recurrence mechanism, which removes the fixed-window sized\nconstraint and improves the efficiency of a transformer decoder. The second\nallows masked language models (MLMs) to be used for initialization of both the\nencoder and decoder of a non-autoregressive sequence-to-sequence transformer,\nopening up generative applications of models which were previously only used\nfor natural language understanding tasks.\n  We also introduce two new techniques for improving the quality of predictions\nof any transformer decoder without additional finetuning. One, hidden state\noptimization, can be applied to any transformer decoder to improve the quality\nof predictions at inference time, especially for few-shot classification. The\nother, conditional beam search, allows practitioners to search for natural\nlanguage generation (NLG) model outputs with high likelihood while conditioning\non the event that the output is not degenerate (e.g. empty, repetitive, etc.).\n  Finally, we provide theoretical and empirical insights on the divergence of\nmodel-likelihood and output quality which has widely been observed in prior\nwork. These insights apply to any model which represents a distribution over\ntext, and apply to language models which are not transformers or even\nautoregressive. We argue that the NLP community has, to some extent,\nmisunderstood the implications of these findings, and encourage a point of view\nwhich has more nuance.", "paper_summary_zh": "<paragraph>本論文提供了方法並分析了在這個目標上取得進展的模型。所概述的技術與任務無關，且在與幾乎任何Transformer LM 搭配使用時，應可帶來好處。我們引入了兩種新的微調方法，可為其所使用的模型添加新功能。第一種方法添加了遞迴機制，消除了固定視窗大小的約束，並提升了Transformer解碼器的效率。第二種方法允許將遮蔽語言模型 (MLM) 用於非自迴歸序列對序列Transformer的編碼器和解碼器的初始化，開啟了先前僅用於自然語言理解任務的模型的生成應用。\n  我們還引入了兩種新技術，用於提升任何Transformer解碼器的預測品質，而無需額外的微調。一種是隱藏狀態最佳化，可應用於任何Transformer解碼器，以提升推論時間的預測品質，特別是對於小樣本分類。另一種是條件光束搜尋，允許實務工作者在輸出不簡約（例如，空、重複等）的事件條件下，搜尋具有高可能性的自然語言生成 (NLG) 模型輸出。\n  最後，我們提供了關於模型似然性與輸出品質差異的理論和經驗見解，這在先前的研究中已被廣泛觀察到。這些見解適用於任何表示文字分佈的模型，並適用於非Transformer，甚至是非自迴歸的語言模型。我們認為，NLP 社群在某種程度上誤解了這些發現的含意，並鼓勵採取觀點，讓觀點更具細微差別。</paragraph>", "author": "Davis Yoshida et.al.", "authors": "Davis Yoshida", "id": "2408.16241v1", "paper_url": "http://arxiv.org/abs/2408.16241v1", "repo": "null"}}