{"2410.06819": {"publish_time": "2024-10-09", "title": "Dynamic Neural Potential Field: Online Trajectory Optimization in Presence of Moving Obstacles", "paper_summary": "We address a task of local trajectory planning for the mobile robot in the\npresence of static and dynamic obstacles. Local trajectory is obtained as a\nnumerical solution of the Model Predictive Control (MPC) problem. Collision\navoidance may be provided by adding repulsive potential of the obstacles to the\ncost function of MPC. We develop an approach, where repulsive potential is\nestimated by the neural model. We propose and explore three possible strategies\nof handling dynamic obstacles. First, environment with dynamic obstacles is\nconsidered as a sequence of static environments. Second, the neural model\npredict a sequence of repulsive potential at once. Third, the neural model\npredict future repulsive potential step by step in autoregressive mode. We\nimplement these strategies and compare it with CIAO* and MPPI using BenchMR\nframework. First two strategies showed higher performance than CIAO* and MPPI\nwhile preserving safety constraints. The third strategy was a bit slower,\nhowever it still satisfy time limits. We deploy our approach on Husky UGV\nmobile platform, which move through the office corridors under proposed MPC\nlocal trajectory planner. The code and trained models are available at\n\\url{https://github.com/CognitiveAISystems/Dynamic-Neural-Potential-Field}.", "paper_summary_zh": "<paragraph>我们针对存在静态和动态障碍物的移动机器人的局部轨迹规划任务进行了解决。局部轨迹作为模型预测控制 (MPC) 问题的数值解获得。通过向 MPC 的成本函数添加障碍物的排斥势能，可以提供防撞功能。我们开发了一种方法，其中排斥势能由神经模型估计。我们提出并探讨了处理动态障碍物的三种可能的策略。首先，将具有动态障碍物环境视为一系列静态环境。其次，神经模型一次预测一系列排斥势能。第三，神经模型在自回归模式中逐步预测未来的排斥势能。我们实施了这些策略，并使用 BenchMR 框架将其与 CIAO* 和 MPPI 进行了比较。前两种策略在保持安全约束的同时，表现出比 CIAO* 和 MPPI 更高的性能。第三种策略有点慢，但仍然满足时间限制。我们在 Husky UGV 移动平台上部署了我们的方法，该平台在提出的 MPC 局部轨迹规划器的作用下在办公室走廊中移动。代码和训练模型可在 \\url{https://github.com/CognitiveAISystems/Dynamic-Neural-Potential-Field} 获得。</paragraph>", "author": "Aleksey Staroverov et.al.", "authors": "Aleksey Staroverov, Muhammad Alhaddad, Aditya Narendra, Konstantin Mironov, Aleksandr Panov", "id": "2410.06819v1", "paper_url": "http://arxiv.org/abs/2410.06819v1", "repo": "null"}}