{"2406.10227": {"publish_time": "2024-06-14", "title": "VideoGUI: A Benchmark for GUI Automation from Instructional Videos", "paper_summary": "Graphical User Interface (GUI) automation holds significant promise for\nenhancing human productivity by assisting with computer tasks. Existing task\nformulations primarily focus on simple tasks that can be specified by a single,\nlanguage-only instruction, such as \"Insert a new slide.\" In this work, we\nintroduce VideoGUI, a novel multi-modal benchmark designed to evaluate GUI\nassistants on visual-centric GUI tasks. Sourced from high-quality web\ninstructional videos, our benchmark focuses on tasks involving professional and\nnovel software (e.g., Adobe Photoshop or Stable Diffusion WebUI) and complex\nactivities (e.g., video editing). VideoGUI evaluates GUI assistants through a\nhierarchical process, allowing for identification of the specific levels at\nwhich they may fail: (i) high-level planning: reconstruct procedural subtasks\nfrom visual conditions without language descriptions; (ii) middle-level\nplanning: generate sequences of precise action narrations based on visual state\n(i.e., screenshot) and goals; (iii) atomic action execution: perform specific\nactions such as accurately clicking designated elements. For each level, we\ndesign evaluation metrics across individual dimensions to provide clear\nsignals, such as individual performance in clicking, dragging, typing, and\nscrolling for atomic action execution. Our evaluation on VideoGUI reveals that\neven the SoTA large multimodal model GPT4o performs poorly on visual-centric\nGUI tasks, especially for high-level planning.", "paper_summary_zh": "圖形使用者介面 (GUI) 自動化對於透過協助電腦工作任務來提升人類生產力而言，具有顯著的遠景。現有的任務表述主要專注於可以由單一、僅語言的指令指定的簡單任務，例如「插入新投影片」。在這項工作中，我們介紹 VideoGUI，一個新穎的多模態基準，旨在評估 GUI 助理在視覺為中心的 GUI 任務上的表現。我們的基準源自高品質的網路教學影片，專注於涉及專業且新穎軟體（例如 Adobe Photoshop 或 Stable Diffusion WebUI）和複雜活動（例如影片編輯）的任務。VideoGUI 透過分層流程評估 GUI 助理，讓系統得以識別其可能失敗的特定層級：(i) 高階規劃：在沒有語言描述的情況下，從視覺條件中重建程序子任務；(ii) 中階規劃：根據視覺狀態（即螢幕截圖）和目標產生精確動作敘述的序列；(iii) 原子動作執行：執行特定動作，例如準確點擊指定的元素。對於每個層級，我們在個別面向設計評估指標，以提供明確的訊號，例如在原子動作執行中點擊、拖曳、輸入和捲動的個別表現。我們在 VideoGUI 上的評估顯示，即使是 SoTA 大型多模態模型 GPT4o 在視覺為中心的 GUI 任務上表現不佳，特別是在高階規劃方面。", "author": "Kevin Qinghong Lin et.al.", "authors": "Kevin Qinghong Lin, Linjie Li, Difei Gao, Qinchen WU, Mingyi Yan, Zhengyuan Yang, Lijuan Wang, Mike Zheng Shou", "id": "2406.10227v1", "paper_url": "http://arxiv.org/abs/2406.10227v1", "repo": "null"}}