{"2410.08209": {"publish_time": "2024-10-10", "title": "Emerging Pixel Grounding in Large Multimodal Models Without Grounding Supervision", "paper_summary": "Current large multimodal models (LMMs) face challenges in grounding, which\nrequires the model to relate language components to visual entities. Contrary\nto the common practice that fine-tunes LMMs with additional grounding\nsupervision, we find that the grounding ability can in fact emerge in LMMs\ntrained without explicit grounding supervision. To reveal this emerging\ngrounding, we introduce an \"attend-and-segment\" method which leverages\nattention maps from standard LMMs to perform pixel-level segmentation.\nFurthermore, to enhance the grounding ability, we propose DIFFLMM, an LMM\nutilizing a diffusion-based visual encoder, as opposed to the standard CLIP\nvisual encoder, and trained with the same weak supervision. Without being\nconstrained by the biases and limited scale of grounding-specific supervision\ndata, our approach is more generalizable and scalable. We achieve competitive\nperformance on both grounding-specific and general visual question answering\nbenchmarks, compared with grounding LMMs and generalist LMMs, respectively.\nNotably, we achieve a 44.2 grounding mask recall on grounded conversation\ngeneration without any grounding supervision, outperforming the extensively\nsupervised model GLaMM. Project page: https://groundLMM.github.io.", "paper_summary_zh": "目前的大型多模態模型 (LMM) 面臨著基礎問題，這需要模型將語言組成部分與視覺實體關聯起來。與使用額外的基礎監督微調 LMM 的常見做法相反，我們發現基礎能力實際上可以在沒有明確基礎監督的情況下訓練的 LMM 中出現。為了揭示這種新興的基礎，我們引入了一個「關注並分割」方法，該方法利用標準 LMM 的注意力圖來執行像素級分割。此外，為了增強基礎能力，我們提出了 DIFFLMM，這是一種 LMM，它使用基於擴散的視覺編碼器，而不是標準 CLIP 視覺編碼器，並使用相同的弱監督進行訓練。在不受基礎特定監督數據的偏差和有限規模的約束下，我們的做法更具通用性和可擴展性。與基礎 LMM 和通才 LMM 相比，我們在基礎特定和一般視覺問題解答基準上實現了競爭力。值得注意的是，我們在沒有任何基礎監督的情況下，對基礎對話生成實現了 44.2 的基礎遮罩召回率，優於廣泛監督的模型 GLaMM。專案頁面：https://groundLMM.github.io。", "author": "Shengcao Cao et.al.", "authors": "Shengcao Cao, Liang-Yan Gui, Yu-Xiong Wang", "id": "2410.08209v1", "paper_url": "http://arxiv.org/abs/2410.08209v1", "repo": "null"}}