{"2412.15620": {"publish_time": "2024-12-20", "title": "Modeling Autonomous Shifts Between Focus State and Mind-Wandering Using a Predictive-Coding-Inspired Variational RNN Model", "paper_summary": "The current study investigates possible neural mechanisms underling\nautonomous shifts between focus state and mind-wandering by conducting model\nsimulation experiments. On this purpose, we modeled perception processes of\ncontinuous sensory sequences using our previous proposed variational RNN model\nwhich was developed based on the free energy principle. The current study\nextended this model by introducing an adaptation mechanism of a meta-level\nparameter, referred to as the meta-prior $\\mathbf{w}$, which regulates the\ncomplexity term in the free energy. Our simulation experiments demonstrated\nthat autonomous shifts between focused perception and mind-wandering take place\nwhen $\\mathbf{w}$ switches between low and high values associated with decrease\nand increase of the average reconstruction error over the past window. In\nparticular, high $\\mathbf{w}$ prioritized top-down predictions while low\n$\\mathbf{w}$ emphasized bottom-up sensations. This paper explores how our\nexperiment results align with existing studies and highlights their potential\nfor future research.", "paper_summary_zh": "本研究透過進行模型模擬實驗，探討在專注狀態和心智遊走之間的自主轉換背後可能的神經機制。基於此目的，我們使用先前提出的變異 RNN 模型模擬感知連續感官序列的過程，該模型是根據自由能原理開發的。本研究透過引入元層級參數的適應機制，將此模型加以延伸，此參數稱為元先驗 $\\mathbf{w}$，用於調節自由能中的複雜性項。我們的模擬實驗證明，當 $\\mathbf{w}$ 在與過去視窗中平均重建誤差的減少和增加相關的低值和高值之間切換時，會發生專注感知和心智遊走之間的自主轉換。特別是，高 $\\mathbf{w}$ 優先自上而下的預測，而低 $\\mathbf{w}$ 則強調自下而上的感覺。本文探討我們的實驗結果如何與現有研究一致，並強調其在未來研究中的潛力。", "author": "Henrique Oyama et.al.", "authors": "Henrique Oyama, Jun Tani", "id": "2412.15620v1", "paper_url": "http://arxiv.org/abs/2412.15620v1", "repo": "null"}}