{"2407.08991": {"publish_time": "2024-07-12", "title": "Optimization of DNN-based speaker verification model through efficient quantization technique", "paper_summary": "As Deep Neural Networks (DNNs) rapidly advance in various fields, including\nspeech verification, they typically involve high computational costs and\nsubstantial memory consumption, which can be challenging to manage on mobile\nsystems. Quantization of deep models offers a means to reduce both\ncomputational and memory expenses. Our research proposes an optimization\nframework for the quantization of the speaker verification model. By analyzing\nperformance changes and model size reductions in each layer of a pre-trained\nspeaker verification model, we have effectively minimized performance\ndegradation while significantly reducing the model size. Our quantization\nalgorithm is the first attempt to maintain the performance of the\nstate-of-the-art pre-trained speaker verification model, ECAPATDNN, while\nsignificantly compressing its model size. Overall, our quantization approach\nresulted in reducing the model size by half, with an increase in EER limited to\n0.07%.", "paper_summary_zh": "隨著深度神經網路 (DNN) 在各種領域快速發展，包括語音驗證，它們通常涉及高運算成本和大量的記憶體消耗，這在行動系統上可能難以管理。深度模型的量化提供了一種方法來減少運算和記憶體的開銷。我們的研究提出了一個用於量化說話者驗證模型的最佳化架構。透過分析預先訓練的說話者驗證模型中每一層的效能變更和模型大小的縮減，我們有效地將效能降低降到最低，同時大幅減少模型大小。我們的量化演算法是首次嘗試維持最先進的預先訓練說話者驗證模型 ECAPATDNN 的效能，同時大幅壓縮其模型大小。總體而言，我們的量化方法將模型大小減少了一半，而 EER 的增加僅限於 0.07%。", "author": "Yeona Hong et.al.", "authors": "Yeona Hong, Woo-Jin Chung, Hong-Goo Kang", "id": "2407.08991v1", "paper_url": "http://arxiv.org/abs/2407.08991v1", "repo": "null"}}