{"2412.11711": {"publish_time": "2024-12-16", "title": "MiMoTable: A Multi-scale Spreadsheet Benchmark with Meta Operations for Table Reasoning", "paper_summary": "Extensive research has been conducted to explore the capability of Large\nLanguage Models (LLMs) for table reasoning and has significantly improved the\nperformance on existing benchmarks. However, tables and user questions in\nreal-world applications are more complex and diverse, presenting an unignorable\ngap compared to the existing benchmarks. To fill the gap, we propose a\n\\textbf{M}ult\\textbf{i}-scale spreadsheet benchmark with \\textbf{M}eta\n\\textbf{o}perations for \\textbf{Table} reasoning, named as MiMoTable.\nSpecifically, MiMoTable incorporates two key features. First, the tables in\nMiMoTable are all spreadsheets used in real-world scenarios, which cover seven\ndomains and contain different types. Second, we define a new criterion with six\ncategories of meta operations for measuring the difficulty of each question in\nMiMoTable, simultaneously as a new perspective for measuring the difficulty of\nthe existing benchmarks. Experimental results show that Claude-3.5-Sonnet\nachieves the best performance with 77.4\\% accuracy, indicating that there is\nstill significant room to improve for LLMs on MiMoTable. Furthermore, we grade\nthe difficulty of existing benchmarks according to our new criteria.\nExperiments have shown that the performance of LLMs decreases as the difficulty\nof benchmarks increases, thereby proving the effectiveness of our proposed new\ncriterion.", "paper_summary_zh": "已進行廣泛的研究來探索大型語言模型 (LLM) 的表格推理能力，並顯著提升現有基準的效能。然而，實際應用中的表格和使用者問題更為複雜且多樣化，與現有基準相比存在無法忽視的差距。為了填補這個差距，我們提出了一個具有元運算的表格推理多尺度試算表基準，稱為 MiMoTable。具體來說，MiMoTable 融合了兩個關鍵特徵。首先，MiMoTable 中的表格都是實際場景中使用的試算表，涵蓋七個領域並包含不同類型。其次，我們定義了一個具有六種類別元運算的新準則，用於衡量 MiMoTable 中每個問題的難度，同時作為衡量現有基準難度的新觀點。實驗結果表明，Claude-3.5-Sonnet 以 77.4% 的準確率取得最佳效能，這表示 LLM 在 MiMoTable 上仍有顯著的進步空間。此外，我們根據新的準則對現有基準的難度進行評分。實驗表明，隨著基準難度的增加，LLM 的效能會下降，從而證明了我們提出的新準則的有效性。", "author": "Zheng Li et.al.", "authors": "Zheng Li, Yang Du, Mao Zheng, Mingyang Song", "id": "2412.11711v1", "paper_url": "http://arxiv.org/abs/2412.11711v1", "repo": "null"}}