{"2408.14830": {"publish_time": "2024-08-27", "title": "PolicyLR: A Logic Representation For Privacy Policies", "paper_summary": "Privacy policies are crucial in the online ecosystem, defining how services\nhandle user data and adhere to regulations such as GDPR and CCPA. However,\ntheir complexity and frequent updates often make them difficult for\nstakeholders to understand and analyze. Current automated analysis methods,\nwhich utilize natural language processing, have limitations. They typically\nfocus on individual tasks and fail to capture the full context of the policies.\nWe propose PolicyLR, a new paradigm that offers a comprehensive\nmachine-readable representation of privacy policies, serving as an all-in-one\nsolution for multiple downstream tasks. PolicyLR converts privacy policies into\na machine-readable format using valuations of atomic formulae, allowing for\nformal definitions of tasks like compliance and consistency. We have developed\na compiler that transforms unstructured policy text into this format using\noff-the-shelf Large Language Models (LLMs). This compiler breaks down the\ntransformation task into a two-stage translation and entailment procedure. This\nprocedure considers the full context of the privacy policy to infer a complex\nformula, where each formula consists of simpler atomic formulae. The advantage\nof this model is that PolicyLR is interpretable by design and grounded in\nsegments of the privacy policy. We evaluated the compiler using ToS;DR, a\ncommunity-annotated privacy policy entailment dataset. Utilizing open-source\nLLMs, our compiler achieves precision and recall values of 0.91 and 0.88,\nrespectively. Finally, we demonstrate the utility of PolicyLR in three privacy\ntasks: Policy Compliance, Inconsistency Detection, and Privacy Comparison\nShopping.", "paper_summary_zh": "<paragraph>隱私政策在線上生態系統中至關重要，定義服務如何處理使用者資料，並遵守 GDPR 和 CCPA 等法規。然而，其複雜性和頻繁更新通常讓利害關係人難以理解和分析。目前利用自然語言處理的自動化分析方法有其限制。它們通常專注於個別任務，無法掌握政策的完整脈絡。我們提出 PolicyLR，這是一個新的典範，提供隱私政策的全面機器可讀表示，作為多個下游任務的一體化解決方案。PolicyLR 使用原子公式的估值將隱私政策轉換為機器可讀格式，允許正式定義合規性和一致性等任務。我們開發了一個編譯器，使用現成的巨量語言模型 (LLM) 將非結構化的政策文字轉換為這種格式。此編譯器將轉換任務分解為兩階段翻譯和蘊含程序。此程序考慮隱私政策的完整脈絡，以推論一個複雜的公式，其中每個公式都包含更簡單的原子公式。此模型的優點在於 PolicyLR 在設計上是可解釋的，並奠基於隱私政策的部分。我們使用 ToS;DR 這個社群註解隱私政策蘊含資料集，評估了編譯器。利用開源 LLM，我們的編譯器分別達到 0.91 和 0.88 的準確度和召回率。最後，我們展示了 PolicyLR 在三個隱私任務中的效用：政策合規性、不一致性偵測和隱私比較購物。</paragraph>", "author": "Ashish Hooda et.al.", "authors": "Ashish Hooda, Rishabh Khandelwal, Prasad Chalasani, Kassem Fawaz, Somesh Jha", "id": "2408.14830v1", "paper_url": "http://arxiv.org/abs/2408.14830v1", "repo": "null"}}