{"2408.03618": {"publish_time": "2024-08-07", "title": "A Logical Fallacy-Informed Framework for Argument Generation", "paper_summary": "Despite the remarkable performance of Large Language Models (LLMs), they\nstill struggle with generating logically sound arguments, resulting in\npotential risks such as spreading misinformation. An important factor\ncontributing to LLMs' suboptimal performance in generating coherent arguments\nis their oversight of logical fallacies. To address this issue, we introduce\nFIPO, a fallacy-informed framework that leverages preference optimization\nmethods to steer LLMs toward logically sound arguments. FIPO includes a\nclassification loss, to capture the fine-grained information on fallacy\ncategories. Our results on argumentation datasets show that our method reduces\nthe fallacy errors by up to 17.5%. Furthermore, our human evaluation results\nindicate that the quality of the generated arguments by our method\nsignificantly outperforms the fine-tuned baselines, as well as prior preference\noptimization methods, such as DPO. These findings highlight the importance of\nensuring models are aware of logical fallacies for effective argument\ngeneration.", "paper_summary_zh": "儘管大型語言模型 (LLM) 擁有傑出的表現，它們在產生合乎邏輯的論述上仍有困難，導致潛在風險，例如散布錯誤訊息。造成 LLM 在產生連貫論述時表現不佳的一個重要因素，是它們忽略了邏輯謬誤。為了解決這個問題，我們引入了 FIPO，一個以謬誤為基礎的架構，它利用偏好最佳化方法將 LLM 引導至合乎邏輯的論述。FIPO 包含一個分類損失，以擷取關於謬誤類別的細微資訊。我們在論證資料集上的結果顯示，我們的模型將謬誤錯誤減少了 17.5%。此外，我們的人工評估結果指出，我們的模型產生的論述品質顯著優於微調基線，以及先前的偏好最佳化方法，例如 DPO。這些發現強調了確保模型了解邏輯謬誤對於有效產生論述的重要性。", "author": "Luca Mouchel et.al.", "authors": "Luca Mouchel, Debjit Paul, Shaobo Cui, Robert West, Antoine Bosselut, Boi Faltings", "id": "2408.03618v1", "paper_url": "http://arxiv.org/abs/2408.03618v1", "repo": "null"}}