{"2404.17607": {"publish_time": "2024-04-25", "title": "Utilizing Large Language Models to Identify Reddit Users Considering Vaping Cessation for Digital Interventions", "paper_summary": "The widespread adoption of social media platforms globally not only enhances\nusers' connectivity and communication but also emerges as a vital channel for\nthe dissemination of health-related information, thereby establishing social\nmedia data as an invaluable organic data resource for public health research.\nThe surge in popularity of vaping or e-cigarette use in the United States and\nother countries has caused an outbreak of e-cigarette and vaping use-associated\nlung injury (EVALI), leading to hospitalizations and fatalities in 2019,\nhighlighting the urgency to comprehend vaping behaviors and develop effective\nstrategies for cession. In this study, we extracted a sample dataset from one\nvaping sub-community on Reddit to analyze users' quit vaping intentions.\nLeveraging large language models including both the latest GPT-4 and\ntraditional BERT-based language models for sentence-level quit-vaping intention\nprediction tasks, this study compares the outcomes of these models against\nhuman annotations. Notably, when compared to human evaluators, GPT-4 model\ndemonstrates superior consistency in adhering to annotation guidelines and\nprocesses, showcasing advanced capabilities to detect nuanced user quit-vaping\nintentions that human evaluators might overlook. These preliminary findings\nemphasize the potential of GPT-4 in enhancing the accuracy and reliability of\nsocial media data analysis, especially in identifying subtle users' intentions\nthat may elude human detection.", "paper_summary_zh": "社群媒体平台在全球的广泛採用，不仅提升了使用者的连结性和沟通，更成为传播健康相关资讯的重要管道，进而使社群媒体资料成为公共卫生研究中一项珍贵的自然资料资源。在美国和其他国家，电子烟或称电子香烟使用率激增，导致 2019 年爆发电子烟和电子烟相关使用肺损伤 (EVALI)，造成住院和死亡，突显出理解电子烟行为并发展有效戒除策略的急迫性。在这项研究中，我们从 Reddit 上的一个电子烟次社群中萃取了一个样本数据集，以分析使用者戒除电子烟的意图。本研究利用大型语言模型，包括最新的 GPT-4 和传统的 BERT 为基础的语言模型，进行句子层级的戒烟意图预测任务，并将这些模型的结果与人类标注进行比较。值得注意的是，与人类评估者相比，GPT-4 模型在遵守标注准则和流程方面表现出优异的一致性，展示出检测人类评估者可能忽略的细微使用者戒烟意图的先进能力。这些初步发现强调了 GPT-4 在提升社群媒体资料分析准确性和可靠性方面的潜力，尤其是在识别可能逃过人类侦测的使用者细微意图方面。", "author": "Sai Krishna Revanth Vuruma et.al.", "authors": "Sai Krishna Revanth Vuruma, Dezhi Wu, Saborny Sen Gupta, Lucas Aust, Valerie Lookingbill, Caleb Henry, Yang Ren, Erin Kasson, Li-Shiun Chen, Patricia Cavazos-Rehg, Dian Hu, Ming Huang", "id": "2404.17607v1", "paper_url": "http://arxiv.org/abs/2404.17607v1", "repo": "null"}}