{"2404.17607": {"publish_time": "2024-04-25", "title": "Utilizing Large Language Models to Identify Reddit Users Considering Vaping Cessation for Digital Interventions", "paper_summary": "The widespread adoption of social media platforms globally not only enhances\nusers' connectivity and communication but also emerges as a vital channel for\nthe dissemination of health-related information, thereby establishing social\nmedia data as an invaluable organic data resource for public health research.\nThe surge in popularity of vaping or e-cigarette use in the United States and\nother countries has caused an outbreak of e-cigarette and vaping use-associated\nlung injury (EVALI), leading to hospitalizations and fatalities in 2019,\nhighlighting the urgency to comprehend vaping behaviors and develop effective\nstrategies for cession. In this study, we extracted a sample dataset from one\nvaping sub-community on Reddit to analyze users' quit vaping intentions.\nLeveraging large language models including both the latest GPT-4 and\ntraditional BERT-based language models for sentence-level quit-vaping intention\nprediction tasks, this study compares the outcomes of these models against\nhuman annotations. Notably, when compared to human evaluators, GPT-4 model\ndemonstrates superior consistency in adhering to annotation guidelines and\nprocesses, showcasing advanced capabilities to detect nuanced user quit-vaping\nintentions that human evaluators might overlook. These preliminary findings\nemphasize the potential of GPT-4 in enhancing the accuracy and reliability of\nsocial media data analysis, especially in identifying subtle users' intentions\nthat may elude human detection.", "paper_summary_zh": "", "author": "Sai Krishna Revanth Vuruma et.al.", "authors": "Sai Krishna Revanth Vuruma,Dezhi Wu,Saborny Sen Gupta,Lucas Aust,Valerie Lookingbill,Caleb Henry,Yang Ren,Erin Kasson,Li-Shiun Chen,Patricia Cavazos-Rehg,Dian Hu,Ming Huang", "id": "2404.17607v1", "paper_url": "http://arxiv.org/abs/2404.17607v1", "repo": "null"}}