{"2411.07965": {"publish_time": "2024-11-12", "title": "From General to Specific: Utilizing General Hallucination to Benchmark Specific Role-Playing Agents", "paper_summary": "The advanced role-playing capabilities of Large Language Models (LLMs) have\npaved the way for developing Role-Playing Agents (RPAs). However, existing\nbenchmarks in this domain, such as HPD and SocialBench face limitations like\npoor generalizability, implicit and inaccurate judgments, and the risk of model\nforgetting. To address the above issues, we propose an automatic, scalable, and\ngeneralizable paradigm. Specifically, we construct a benchmark, SHARP, by\nextracting relations from a general knowledge graph and leveraging the inherent\nhallucination properties of RPAs to simulate interactions across roles. We\nemploy ChatGPT for stance detection and define relationship hallucination along\nwith three related metrics based on stance transfer. Extensive experiments\nvalidate the effectiveness and stability of our paradigm. Our findings further\nexplore the factors influencing these metrics and discuss the trade-off between\nblind loyalty to relationships and adherence to facts in RPAs.", "paper_summary_zh": "大型語言模型 (LLM) 的進階角色扮演能力已為角色扮演代理 (RPA) 的開發鋪平道路。然而，此領域現有的基準，例如 HPD 和 SocialBench，面臨著概括性差、判斷隱含且不準確，以及模型遺忘的風險等限制。為了解決上述問題，我們提出了一個自動化、可擴充且可概括的範例。具體來說，我們通過從一般知識圖譜中提取關係，並利用 RPA 固有的幻覺特性來模擬跨角色互動，構建了一個基準 SHARP。我們採用 ChatGPT 進行立場檢測，並定義關係幻覺以及基於立場轉移的三個相關指標。廣泛的實驗驗證了我們範例的有效性和穩定性。我們的發現進一步探討了影響這些指標的因素，並討論了 RPA 中對關係的盲目忠誠度與對事實的堅持之間的權衡。", "author": "Chuyi Kong et.al.", "authors": "Chuyi Kong, Ziyang Luo, Hongzhan Lin, Zhiyuan Fan, Yaxin Fan, Yuxi Sun, Jing Ma", "id": "2411.07965v2", "paper_url": "http://arxiv.org/abs/2411.07965v2", "repo": "null"}}