{"2408.12815": {"publish_time": "2024-08-23", "title": "Staircase Cascaded Fusion of Lightweight Local Pattern Recognition and Long-Range Dependencies for Structural Crack Segmentation", "paper_summary": "Detecting cracks with pixel-level precision for key structures is a\nsignificant challenge, as existing methods struggle to effectively integrate\nlocal textures and pixel dependencies of cracks. Furthermore, these methods\noften possess numerous parameters and substantial computational requirements,\ncomplicating deployment on edge devices. In this paper, we propose a staircase\ncascaded fusion crack segmentation network (CrackSCF) that generates\nhigh-quality crack segmentation maps using minimal computational resources. We\nconstructed a staircase cascaded fusion module that effectively captures local\npatterns of cracks and long-range dependencies of pixels, and it can suppress\nbackground noise well. To reduce the computational resources required by the\nmodel, we introduced a lightweight convolution block, which replaces all\nconvolution operations in the network, significantly reducing the required\ncomputation and parameters without affecting the network's performance. To\nevaluate our method, we created a challenging benchmark dataset called TUT and\nconducted experiments on this dataset and five other public datasets. The\nexperimental results indicate that our method offers significant advantages\nover existing methods, especially in handling background noise interference and\ndetailed crack segmentation. The F1 and mIoU scores on the TUT dataset are\n0.8382 and 0.8473, respectively, achieving state-of-the-art (SOTA) performance\nwhile requiring the least computational resources. The code and dataset is\navailable at https://github.com/Karl1109/CrackSCF.", "paper_summary_zh": "使用像素級精度檢測關鍵結構的裂縫是一項重大挑戰，因為現有方法難以有效整合裂縫的局部紋理和像素依賴性。此外，這些方法通常擁有眾多參數和大量的計算需求，這使得在邊緣設備上進行部署變得複雜。在本文中，我們提出了一個階梯式級聯融合裂縫分割網路（CrackSCF），它使用最少的計算資源生成高品質的裂縫分割圖。我們構建了一個階梯式級聯融合模組，它有效地捕捉了裂縫的局部模式和像素的長程依賴性，並且可以很好地抑制背景噪聲。為了減少模型所需的計算資源，我們引入了一個輕量級卷積塊，它取代了網路中的所有卷積運算，顯著減少了所需的計算和參數，而不會影響網路的效能。為了評估我們的模型，我們創建了一個具有挑戰性的基準資料集，稱為 TUT，並在這個資料集和另外五個公開資料集上進行了實驗。實驗結果表明，我們的模型在處理背景噪聲干擾和詳細裂縫分割方面，比現有的方法具有顯著的優勢。在 TUT 資料集上的 F1 和 mIoU 分數分別為 0.8382 和 0.8473，在需要最少計算資源的情況下，達到了最先進（SOTA）的效能。程式碼和資料集可在 https://github.com/Karl1109/CrackSCF 取得。", "author": "Hui Liu et.al.", "authors": "Hui Liu, Chen Jia, Fan Shi, Xu Cheng, Mianzhao Wang, Shengyong Chen", "id": "2408.12815v1", "paper_url": "http://arxiv.org/abs/2408.12815v1", "repo": "https://github.com/karl1109/crackscf"}}