{"2405.12399": {"publish_time": "2024-05-20", "title": "Diffusion for World Modeling: Visual Details Matter in Atari", "paper_summary": "World models constitute a promising approach for training reinforcement\nlearning agents in a safe and sample-efficient manner. Recent world models\npredominantly operate on sequences of discrete latent variables to model\nenvironment dynamics. However, this compression into a compact discrete\nrepresentation may ignore visual details that are important for reinforcement\nlearning. Concurrently, diffusion models have become a dominant approach for\nimage generation, challenging well-established methods modeling discrete\nlatents. Motivated by this paradigm shift, we introduce DIAMOND (DIffusion As a\nModel Of eNvironment Dreams), a reinforcement learning agent trained in a\ndiffusion world model. We analyze the key design choices that are required to\nmake diffusion suitable for world modeling, and demonstrate how improved visual\ndetails can lead to improved agent performance. DIAMOND achieves a mean human\nnormalized score of 1.46 on the competitive Atari 100k benchmark; a new best\nfor agents trained entirely within a world model. To foster future research on\ndiffusion for world modeling, we release our code, agents and playable world\nmodels at https://github.com/eloialonso/diamond.", "paper_summary_zh": "世界模型構成了一種有前途的方法，可以用於以安全且樣本有效的方式訓練強化學習代理。最近的世界模型主要在離散潛在變數序列上運作，以模擬環境動態。然而，這種壓縮成一個緊湊的離散表示可能會忽略對強化學習很重要的視覺細節。同時，擴散模型已成為圖像生成的顯著方法，挑戰了對離散潛在變數進行建模的既定方法。受這種範式轉變的激勵，我們引入了 DIAMOND（DIffusion As a Model Of eNvironment Dreams），這是一種在擴散世界模型中訓練的強化學習代理。我們分析了使擴散適合世界建模所需的關鍵設計選擇，並展示了改進的視覺細節如何能提升代理效能。DIAMOND 在競爭激烈的 Atari 100k 基準測試中獲得了 1.46 的平均人類標準化分數；這是完全在世界模型內訓練的代理的新最佳分數。為了促進未來對世界建模擴散的研究，我們在 https://github.com/eloialonso/diamond 上發布了我們的程式碼、代理和可玩世界模型。", "author": "Eloi Alonso et.al.", "authors": "Eloi Alonso, Adam Jelley, Vincent Micheli, Anssi Kanervisto, Amos Storkey, Tim Pearce, François Fleuret", "id": "2405.12399v1", "paper_url": "http://arxiv.org/abs/2405.12399v1", "repo": "https://github.com/eloialonso/diamond"}}