{"2504.07956": {"publish_time": "2025-04-10", "title": "VCR-Bench: A Comprehensive Evaluation Framework for Video Chain-of-Thought Reasoning", "paper_summary": "The advancement of Chain-of-Thought (CoT) reasoning has significantly\nenhanced the capabilities of large language models (LLMs) and large\nvision-language models (LVLMs). However, a rigorous evaluation framework for\nvideo CoT reasoning remains absent. Current video benchmarks fail to adequately\nassess the reasoning process and expose whether failures stem from deficiencies\nin perception or reasoning capabilities. Therefore, we introduce VCR-Bench, a\nnovel benchmark designed to comprehensively evaluate LVLMs' Video\nChain-of-Thought Reasoning capabilities. VCR-Bench comprises 859 videos\nspanning a variety of video content and durations, along with 1,034\nhigh-quality question-answer pairs. Each pair is manually annotated with a\nstepwise CoT rationale, where every step is tagged to indicate its association\nwith the perception or reasoning capabilities. Furthermore, we design seven\ndistinct task dimensions and propose the CoT score to assess the entire CoT\nprocess based on the stepwise tagged CoT rationals. Extensive experiments on\nVCR-Bench highlight substantial limitations in current LVLMs. Even the\ntop-performing model, o1, only achieves a 62.8% CoT score and an 56.7%\naccuracy, while most models score below 40%. Experiments show most models score\nlower on perception than reasoning steps, revealing LVLMs' key bottleneck in\ntemporal-spatial information processing for complex video reasoning. A robust\npositive correlation between the CoT score and accuracy confirms the validity\nof our evaluation framework and underscores the critical role of CoT reasoning\nin solving complex video reasoning tasks. We hope VCR-Bench to serve as a\nstandardized evaluation framework and expose the actual drawbacks in complex\nvideo reasoning task.", "paper_summary_zh": "<paragraph>思維鏈 (Chain-of-Thought, CoT) 推理的進步顯著提升了大型語言模型 (LLM) 和大型視覺語言模型 (LVLMs) 的能力。然而，目前仍缺乏一個嚴謹的視頻 CoT 推理評估框架。現有的視頻基準測試未能充分評估推理過程，也未能揭示錯誤是源於感知能力的不足還是推理能力的缺陷。因此，我們引入了 VCR-Bench，這是一個旨在全面評估 LVLMs 視頻思維鏈推理能力的新基準測試。VCR-Bench 包含 859 個涵蓋各種視頻內容和時長的視頻，以及 1,034 個高質量的問答對。每一對都以逐步 CoT 推理進行人工標記，其中每個步驟都被標記以表明其與感知或推理能力的關聯。此外，我們設計了七個不同的任務維度，並提出了 CoT 分數，以根據逐步標記的 CoT 推理來評估整個 CoT 過程。在 VCR-Bench 上進行的大量實驗突顯了當前 LVLMs 的重大局限性。即使是表現最佳的模型 o1，也僅達到了 62.8% 的 CoT 分數和 56.7% 的準確率，而大多數模型的得分都低於 40%。實驗表明，大多數模型在感知步驟上的得分低於推理步驟，這揭示了 LVLMs 在處理複雜視頻推理的時空信息方面的關鍵瓶頸。CoT 分數和準確率之間的強正相關性證實了我們評估框架的有效性，並強調了 CoT 推理在解決複雜視頻推理任務中的關鍵作用。我們希望 VCR-Bench 能夠作為一個標準化的評估框架，並揭示複雜視頻推理任務中的實際缺陷。 </paragraph>\n", "author": "Yukun Qi et.al.", "authors": "Yukun Qi, Yiming Zhao, Yu Zeng, Xikun Bao, Wenxuan Huang, Lin Chen, Zehui Chen, Jie Zhao, Zhongang Qi, Feng Zhao", "id": "2504.07956v1", "paper_url": "http://arxiv.org/abs/2504.07956v1", "repo": "null"}}