{"2407.05778": {"publish_time": "2024-07-08", "title": "When is the consistent prediction likely to be a correct prediction?", "paper_summary": "Self-consistency (Wang et al., 2023) suggests that the most consistent answer\nobtained through large language models (LLMs) is more likely to be correct. In\nthis paper, we challenge this argument and propose a nuanced correction. Our\nobservations indicate that consistent answers derived through more computation\ni.e. longer reasoning texts, rather than simply the most consistent answer\nacross all outputs, are more likely to be correct. This is predominantly\nbecause we demonstrate that LLMs can autonomously produce chain-of-thought\n(CoT) style reasoning with no custom prompts merely while generating longer\nresponses, which lead to consistent predictions that are more accurate. In the\nzero-shot setting, by sampling Mixtral-8x7B model multiple times and\nconsidering longer responses, we achieve 86% of its self-consistency\nperformance obtained through zero-shot CoT prompting on the GSM8K and\nMultiArith datasets. Finally, we demonstrate that the probability of LLMs\ngenerating a longer response is quite low, highlighting the need for decoding\nstrategies conditioned on output length.", "paper_summary_zh": "自我一致性（Wang 等人，2023 年）表明，通过大型语言模型 (LLM) 获得的最一致的答案更有可能是正确的。在这篇论文中，我们对这一论点提出质疑，并提出了一种细致入微的修正。我们的观察表明，通过更多计算（即更长的推理文本）得出的、而不是所有输出中最一致的答案，更有可能是正确的。这主要是因为我们证明了 LLM 可以自主生成思维链 (CoT) 样式的推理，而无需在生成更长的响应时仅仅是自定义提示，这会导致更准确的一致预测。在零样本设置中，通过多次采样 Mixtral-8x7B 模型并考虑更长的响应，我们在 GSM8K 和 MultiArith 数据集上通过零样本 CoT 提示获得的自我一致性性能达到 86%。最后，我们证明了 LLM 生成更长响应的概率非常低，这突出了对以输出长度为条件的解码策略的需求。", "author": "Alex Nguyen et.al.", "authors": "Alex Nguyen, Dheeraj Mekala, Chengyu Dong, Jingbo Shang", "id": "2407.05778v1", "paper_url": "http://arxiv.org/abs/2407.05778v1", "repo": "null"}}