{"2503.07470": {"publish_time": "2025-03-10", "title": "Advancing Vietnamese Information Retrieval with Learning Objective and Benchmark", "paper_summary": "With the rapid development of natural language processing, many language\nmodels have been invented for multiple tasks. One important task is information\nretrieval (IR), which requires models to retrieve relevant documents. Despite\nits importance in many real-life applications, especially in retrieval\naugmented generation (RAG) systems, this task lacks Vietnamese benchmarks. This\nsituation causes difficulty in assessing and comparing many existing Vietnamese\nembedding language models on the task and slows down the advancement of\nVietnamese natural language processing (NLP) research. In this work, we aim to\nprovide the Vietnamese research community with a new benchmark for information\nretrieval, which mainly focuses on retrieval and reranking tasks. Furthermore,\nwe also present a new objective function based on the InfoNCE loss function,\nwhich is used to train our Vietnamese embedding model. Our function aims to be\nbetter than the origin in information retrieval tasks. Finally, we analyze the\neffect of temperature, a hyper-parameter in both objective functions, on the\nperformance of text embedding models.", "paper_summary_zh": "<paragraph>隨著自然語言處理的快速發展，許多語言模型已被發明用於多項任務。其中一項重要的任務是資訊檢索 (IR)，它要求模型檢索相關文件。儘管資訊檢索在許多實際應用中非常重要，尤其是在檢索增強生成 (RAG) 系統中，但這項任務缺乏越南語的基準測試。這種情況導致難以評估和比較許多現有的越南語嵌入語言模型在此任務上的表現，並減緩了越南語自然語言處理 (NLP) 研究的進展。在這項工作中，我們的目標是為越南研究社群提供一個新的資訊檢索基準測試，主要關注檢索和重新排序任務。此外，我們還提出了一個基於 InfoNCE 損失函數的新目標函數，用於訓練我們的越南語嵌入模型。我們的函數旨在比原始函數在資訊檢索任務中表現更好。最後，我們分析了溫度（兩個目標函數中的一個超參數）對文本嵌入模型性能的影響。</paragraph>\n", "author": "Phu-Vinh Nguyen et.al.", "authors": "Phu-Vinh Nguyen, Minh-Nam Tran, Long Nguyen, Dien Dinh", "id": "2503.07470v1", "paper_url": "http://arxiv.org/abs/2503.07470v1", "repo": "null"}}