{"2410.15268": {"publish_time": "2024-10-20", "title": "TAGExplainer: Narrating Graph Explanations for Text-Attributed Graph Learning Models", "paper_summary": "Representation learning of Text-Attributed Graphs (TAGs) has garnered\nsignificant attention due to its applications in various domains, including\nrecommendation systems and social networks. Despite advancements in TAG\nlearning methodologies, challenges remain in explainability due to the\nblack-box nature of existing TAG representation learning models. This paper\npresents TAGExplainer, the first method designed to generate natural language\nexplanations for TAG learning. TAGExplainer employs a generative language model\nthat maps input-output pairs to explanations reflecting the model's\ndecision-making process. To address the lack of annotated ground truth\nexplanations in real-world scenarios, we propose first generating pseudo-labels\nthat capture the model's decisions from saliency-based explanations, then the\npseudo-label generator is iteratively trained based on three training\nobjectives focusing on faithfulness and brevity via Expert Iteration, to\nimprove the quality of generated pseudo-labels. The high-quality pseudo-labels\nare finally utilized to train an end-to-end explanation generator model.\nExtensive experiments are conducted to demonstrate the effectiveness of\nTAGExplainer in producing faithful and concise natural language explanations.", "paper_summary_zh": "文本歸因圖 (TAG) 的表示學習因其在各種領域（包括推薦系統和社交網絡）中的應用而備受關注。儘管 TAG 學習方法取得了進展，但由於現有 TAG 表示學習模型的黑箱性質，可解釋性仍然面臨挑戰。本文提出了 TAGExplainer，這是一種旨在為 TAG 學習生成自然語言解釋的第一種方法。TAGExplainer 採用生成語言模型，將輸入輸出對應到反映模型決策過程的解釋。為了解決現實場景中缺乏註解地面真實解釋的問題，我們建議首先從基於顯著性的解釋中生成偽標籤來捕捉模型的決策，然後通過專家迭代基於三個訓練目標（側重於忠實度和簡潔性）反覆訓練偽標籤生成器，以提高生成偽標籤的品質。最後將高品質的偽標籤用於訓練端到端解釋生成器模型。進行了廣泛的實驗，以證明 TAGExplainer 在生成忠實且簡潔的自然語言解釋方面的有效性。", "author": "Bo Pan et.al.", "authors": "Bo Pan, Zhen Xiong, Guanchen Wu, Zheng Zhang, Yifei Zhang, Liang Zhao", "id": "2410.15268v1", "paper_url": "http://arxiv.org/abs/2410.15268v1", "repo": "null"}}