{"2405.14331": {"publish_time": "2024-05-23", "title": "LucidPPN: Unambiguous Prototypical Parts Network for User-centric Interpretable Computer Vision", "paper_summary": "Prototypical parts networks combine the power of deep learning with the\nexplainability of case-based reasoning to make accurate, interpretable\ndecisions. They follow the this looks like that reasoning, representing each\nprototypical part with patches from training images. However, a single image\npatch comprises multiple visual features, such as color, shape, and texture,\nmaking it difficult for users to identify which feature is important to the\nmodel.\n  To reduce this ambiguity, we introduce the Lucid Prototypical Parts Network\n(LucidPPN), a novel prototypical parts network that separates color prototypes\nfrom other visual features. Our method employs two reasoning branches: one for\nnon-color visual features, processing grayscale images, and another focusing\nsolely on color information. This separation allows us to clarify whether the\nmodel's decisions are based on color, shape, or texture. Additionally, LucidPPN\nidentifies prototypical parts corresponding to semantic parts of classified\nobjects, making comparisons between data classes more intuitive, e.g., when two\nbird species might differ primarily in belly color.\n  Our experiments demonstrate that the two branches are complementary and\ntogether achieve results comparable to baseline methods. More importantly,\nLucidPPN generates less ambiguous prototypical parts, enhancing user\nunderstanding.", "paper_summary_zh": "原型零件網路結合深度學習的力量與案例推理的可解釋性，做出準確且可詮釋的決策。它們遵循此看起來像那樣的推理，用訓練影像中的補丁表示每個原型零件。然而，單一影像補丁包含多種視覺特徵，例如顏色、形狀和紋理，使用戶難以辨別哪個特徵對模型很重要。\n為了減少這種歧義，我們引入了 Lucid 原型零件網路 (LucidPPN)，一種將顏色原型與其他視覺特徵分開的新型原型零件網路。我們的模型採用兩個推理分支：一個用於非色彩視覺特徵，處理灰階影像，另一個則專注於色彩資訊。這種分離讓我們能夠釐清模型的決策是基於顏色、形狀還是紋理。此外，LucidPPN 識別與分類物件的語義零件相應的原型零件，讓資料類別之間的比較更直觀，例如，當兩個鳥類物種可能主要在腹部顏色上有所不同時。\n我們的實驗證明這兩個分支是互補的，並且共同達成與基準方法相當的結果。更重要的是，LucidPPN 產生的原型零件較不模稜兩可，增強使用者的理解力。", "author": "Mateusz Pach et.al.", "authors": "Mateusz Pach, Dawid Rymarczyk, Koryna Lewandowska, Jacek Tabor, Bartosz Zieliński", "id": "2405.14331v1", "paper_url": "http://arxiv.org/abs/2405.14331v1", "repo": "null"}}