{"2407.05700": {"publish_time": "2024-07-08", "title": "InverseCoder: Unleashing the Power of Instruction-Tuned Code LLMs with Inverse-Instruct", "paper_summary": "Recent advancements in open-source code large language models (LLMs) have\ndemonstrated remarkable coding abilities by fine-tuning on the data generated\nfrom powerful closed-source LLMs such as GPT-3.5 and GPT-4 for instruction\ntuning. This paper explores how to further improve an instruction-tuned code\nLLM by generating data from itself rather than querying closed-source LLMs. Our\nkey observation is the misalignment between the translation of formal and\ninformal languages: translating formal language (i.e., code) to informal\nlanguage (i.e., natural language) is more straightforward than the reverse.\nBased on this observation, we propose INVERSE-INSTRUCT, which summarizes\ninstructions from code snippets instead of the reverse. Specifically, given an\ninstruction tuning corpus for code and the resulting instruction-tuned code\nLLM, we ask the code LLM to generate additional high-quality instructions for\nthe original corpus through code summarization and self-evaluation. Then, we\nfine-tune the base LLM on the combination of the original corpus and the\nself-generated one, which yields a stronger instruction-tuned LLM. We present a\nseries of code LLMs named InverseCoder, which surpasses the performance of the\noriginal code LLMs on a wide range of benchmarks, including Python text-to-code\ngeneration, multilingual coding, and data-science code generation.", "paper_summary_zh": "<paragraph>開放原始碼大型語言模型 (LLM) 的近期進展已透過對 GPT-3.5 和 GPT-4 等強大閉源 LLM 所產生資料進行微調，展現出卓越的編碼能力以進行指令微調。本文探討如何透過產生資料本身，而非查詢閉源 LLM，進一步改善指令微調的程式碼 LLM。我們的關鍵觀察是正式語言和非正式語言的翻譯之間出現錯位：將正式語言（即程式碼）翻譯成非正式語言（即自然語言）比反過來更為直接。根據此觀察，我們提出 INVERSE-INSTRUCT，它會摘要程式碼片段中的指令，而非反過來。具體來說，給定程式碼的指令微調語料庫以及產生的指令微調程式碼 LLM，我們要求程式碼 LLM 透過程式碼摘要和自我評估為原始語料庫產生額外的優質指令。然後，我們對基本 LLM 進行微調，結合原始語料庫和自我產生的語料庫，這會產生更強大的指令微調 LLM。我們提出了一系列名為 InverseCoder 的程式碼 LLM，其在廣泛的基準測試中超越了原始程式碼 LLM 的效能，包括 Python 文字轉程式碼產生、多語言編碼和資料科學程式碼產生。</paragraph>", "author": "Yutong Wu et.al.", "authors": "Yutong Wu, Di Huang, Wenxuan Shi, Wei Wang, Lingzhe Gao, Shihao Liu, Ziyuan Nan, Kaizhao Yuan, Rui Zhang, Xishan Zhang, Zidong Du, Qi Guo, Yewen Pu, Dawei Yin, Xing Hu, Yunji Chen", "id": "2407.05700v1", "paper_url": "http://arxiv.org/abs/2407.05700v1", "repo": "null"}}