{"2408.02275": {"publish_time": "2024-08-05", "title": "Geometric Algebra Meets Large Language Models: Instruction-Based Transformations of Separate Meshes in 3D, Interactive and Controllable Scenes", "paper_summary": "This paper introduces a novel integration of Large Language Models (LLMs)\nwith Conformal Geometric Algebra (CGA) to revolutionize controllable 3D scene\nediting, particularly for object repositioning tasks, which traditionally\nrequires intricate manual processes and specialized expertise. These\nconventional methods typically suffer from reliance on large training datasets\nor lack a formalized language for precise edits. Utilizing CGA as a robust\nformal language, our system, shenlong, precisely models spatial transformations\nnecessary for accurate object repositioning. Leveraging the zero-shot learning\ncapabilities of pre-trained LLMs, shenlong translates natural language\ninstructions into CGA operations which are then applied to the scene,\nfacilitating exact spatial transformations within 3D scenes without the need\nfor specialized pre-training. Implemented in a realistic simulation\nenvironment, shenlong ensures compatibility with existing graphics pipelines.\nTo accurately assess the impact of CGA, we benchmark against robust Euclidean\nSpace baselines, evaluating both latency and accuracy. Comparative performance\nevaluations indicate that shenlong significantly reduces LLM response times by\n16% and boosts success rates by 9.6% on average compared to the traditional\nmethods. Notably, shenlong achieves a 100% perfect success rate in common\npractical queries, a benchmark where other systems fall short. These\nadvancements underscore shenlong's potential to democratize 3D scene editing,\nenhancing accessibility and fostering innovation across sectors such as\neducation, digital entertainment, and virtual reality.", "paper_summary_zh": "本文介紹大語言模型 (LLM) 與共形幾何代數 (CGA) 的創新整合，以革新可控 3D 場景編輯，特別是物件重新定位任務，這種任務傳統上需要複雜的手動處理和專業知識。這些傳統方法通常仰賴大型訓練資料集，或缺乏精確編輯的正式語言。我們的系統 Shenlong 利用 CGA 作為強健的正式語言，精確建模物件重新定位所需的空間轉換。Shenlong 透過利用預先訓練 LLM 的零次學習能力，將自然語言指令轉換為 CGA 運算，然後將這些運算套用到場景中，在 3D 場景中促成精確的空間轉換，而無需專門的預先訓練。Shenlong 在逼真的模擬環境中實作，確保與現有圖形管線相容。為了準確評估 CGA 的影響，我們針對強健的歐幾里得空間基準進行基準測試，評估延遲和準確度。比較效能評估顯示，與傳統方法相比，Shenlong 將 LLM 回應時間顯著降低 16%，並將成功率平均提升 9.6%。值得注意的是，Shenlong 在常見的實用查詢中達到 100% 的完美成功率，這是其他系統無法達到的基準。這些進展突顯了 Shenlong 在民主化 3D 場景編輯方面的潛力，增強了可及性，並促進了教育、數位娛樂和虛擬實境等領域的創新。", "author": "Dimitris Angelis et.al.", "authors": "Dimitris Angelis, Prodromos Kolyvakis, Manos Kamarianakis, George Papagiannakis", "id": "2408.02275v1", "paper_url": "http://arxiv.org/abs/2408.02275v1", "repo": "null"}}