{"2409.07638": {"publish_time": "2024-09-11", "title": "Can We Count on LLMs? The Fixed-Effect Fallacy and Claims of GPT-4 Capabilities", "paper_summary": "In this paper we explore evaluation of LLM capabilities. We present\nmeasurements of GPT-4 performance on several deterministic tasks; each task\ninvolves a basic calculation and takes as input parameter some element drawn\nfrom a large well-defined population (e.g., count elements in a list, multiply\ntwo k-digit numbers, etc). We examine several conditions per-task and perform\nenough trials so that statistically significant differences can be detected.\nThis allows us to investigate the sensitivity of task-accuracy both to query\nphrasing and input parameter population. We find that seemingly trivial\nmodifications in the task-prompt or input population can yield differences far\nlarger than can be explained by sampling effects. For example, performance on a\nsimple list-counting task varies with query-phrasing and list-length, but also\nwith list composition (i.e., the thing-to-be-counted) and object frequency\n(e.g., success when an element accounts for $\\approx$ 50\\% of a list is\ndifferent from when it accounts for $\\approx$ 70\\% etc).\n  We conclude that efforts to quantify LLM capabilities easily succumb to the\nlanguage-as-fixed-effect fallacy, where experimental observations are\nimproperly generalized beyond what the data supports. A consequence appears to\nbe that intuitions that have been formed based on interactions with humans form\na very unreliable guide as to which input modifications should ``make no\ndifference'' to LLM performance.", "paper_summary_zh": "在本文中，我們探討了 LLM 能力的評估。我們提供了 GPT-4 在幾項確定性任務上的效能測量；每項任務都包含一個基本計算，並以從一個定義良好的大型族群中抽取的元素作為輸入參數（例如，計算清單中的元素、將兩個 k 位數字相乘等）。我們針對每個任務檢查幾個條件，並執行足夠的試驗，以便能偵測到具有統計意義的差異。這讓我們能夠探討任務準確度對查詢措辭和輸入參數族群的敏感度。我們發現，任務提示或輸入族群中看似微不足道的修改可能會產生遠大於抽樣效應所能解釋的差異。例如，簡單的清單計數任務的效能會隨著查詢措辭和清單長度而變化，但也會隨著清單組成（即要計數的事物）和物件頻率而變化（例如，當一個元素佔清單的 $\\approx$ 50% 時，成功率與其佔 $\\approx$ 70% 等等時不同）。\n我們得出結論，量化 LLM 能力的努力很容易屈服於語言固定效應謬誤，其中實驗觀察被不適當地概括到資料所支援的範圍之外。後果似乎是，基於與人類互動形成的直覺，對於哪些輸入修改應「對 LLM 效能沒有影響」來說，是一個非常不可靠的指南。", "author": "Thomas Ball et.al.", "authors": "Thomas Ball, Shuo Chen, Cormac Herley", "id": "2409.07638v1", "paper_url": "http://arxiv.org/abs/2409.07638v1", "repo": "null"}}