{"2412.12538": {"publish_time": "2024-12-17", "title": "A Scalable Approach to Benchmarking the In-Conversation Differential Diagnostic Accuracy of a Health AI", "paper_summary": "Diagnostic errors in healthcare persist as a critical challenge, with\nincreasing numbers of patients turning to online resources for health\ninformation. While AI-powered healthcare chatbots show promise, there exists no\nstandardized and scalable framework for evaluating their diagnostic\ncapabilities. This study introduces a scalable benchmarking methodology for\nassessing health AI systems and demonstrates its application through August, an\nAI-driven conversational chatbot. Our methodology employs 400 validated\nclinical vignettes across 14 medical specialties, using AI-powered patient\nactors to simulate realistic clinical interactions. In systematic testing,\nAugust achieved a top-one diagnostic accuracy of 81.8% (327/400 cases) and a\ntop-two accuracy of 85.0% (340/400 cases), significantly outperforming\ntraditional symptom checkers. The system demonstrated 95.8% accuracy in\nspecialist referrals and required 47% fewer questions compared to conventional\nsymptom checkers (mean 16 vs 29 questions), while maintaining empathetic\ndialogue throughout consultations. These findings demonstrate the potential of\nAI chatbots to enhance healthcare delivery, though implementation challenges\nremain regarding real-world validation and integration of objective clinical\ndata. This research provides a reproducible framework for evaluating healthcare\nAI systems, contributing to the responsible development and deployment of AI in\nclinical settings.", "paper_summary_zh": "醫療保健中的診斷錯誤持續成為一項重大挑戰，越來越多的患者求助於線上資源來取得健康資訊。儘管由人工智慧驅動的醫療保健聊天機器人展現出前景，但目前還沒有標準化且可擴充的架構來評估其診斷能力。本研究介紹了一種可擴充的基準測試方法，用於評估健康人工智慧系統，並透過由人工智慧驅動的對話式聊天機器人 August，展示其應用。我們的做法採用了 14 個醫療專科的 400 個已驗證臨床小故事，並使用由人工智慧驅動的患者角色模擬實際的臨床互動。在系統性測試中，August 達到了 81.8% 的前一項診斷準確度（327/400 個案例）和 85.0% 的前兩項準確度（340/400 個案例），顯著優於傳統的症狀檢查器。該系統在專科轉診方面表現出 95.8% 的準確度，並且與傳統症狀檢查器相比，所需的提問數量減少了 47%（平均 16 個問題，相較於 29 個問題），同時在諮詢過程中維持同理的對話。這些發現證明了人工智慧聊天機器人增強醫療保健服務的潛力，儘管在實際驗證和整合客觀臨床數據方面仍存在實作挑戰。本研究提供了一個可複製的架構，用於評估醫療保健人工智慧系統，有助於在臨床環境中負責任地開發和部署人工智慧。", "author": "Deep Bhatt et.al.", "authors": "Deep Bhatt, Surya Ayyagari, Anuruddh Mishra", "id": "2412.12538v1", "paper_url": "http://arxiv.org/abs/2412.12538v1", "repo": "null"}}