{"2407.06089": {"publish_time": "2024-07-08", "title": "Merge, Ensemble, and Cooperate! A Survey on Collaborative Strategies in the Era of Large Language Models", "paper_summary": "The remarkable success of Large Language Models (LLMs) has ushered natural\nlanguage processing (NLP) research into a new era. Despite their diverse\ncapabilities, LLMs trained on different corpora exhibit varying strengths and\nweaknesses, leading to challenges in maximizing their overall efficiency and\nversatility. To address these challenges, recent studies have explored\ncollaborative strategies for LLMs. This paper provides a comprehensive overview\nof this emerging research area, highlighting the motivation behind such\ncollaborations. Specifically, we categorize collaborative strategies into three\nprimary approaches: Merging, Ensemble, and Cooperation. Merging involves\nintegrating multiple LLMs in the parameter space. Ensemble combines the outputs\nof various LLMs. Cooperation} leverages different LLMs to allow full play to\ntheir diverse capabilities for specific tasks. We provide in-depth\nintroductions to these methods from different perspectives and discuss their\npotential applications. Additionally, we outline future research directions,\nhoping this work will catalyze further studies on LLM collaborations and paving\nthe way for advanced NLP applications.", "paper_summary_zh": "大型語言模型 (LLM) 的顯著成功已將自然語言處理 (NLP) 研究帶入一個新時代。儘管具備多樣化的功能，但針對不同語料庫訓練的 LLM 卻展現出不同的優勢和劣勢，導致在最大化其整體效率和多功能性方面面臨挑戰。為了應對這些挑戰，最近的研究探索了 LLM 的協作策略。本文對這個新興的研究領域提供了全面的概述，重點說明了此類協作背後的動機。具體來說，我們將協作策略分類為三種主要方法：合併、集成和合作。合併涉及在參數空間中整合多個 LLM。集成結合了各種 LLM 的輸出。合作} 利用不同的 LLM，讓它們能夠充分發揮其在特定任務中的多樣化功能。我們從不同的角度對這些方法進行了深入介紹，並討論了它們的潛在應用。此外，我們概述了未來的研究方向，希望這項工作能催化 LLM 協作的進一步研究，並為先進的 NLP 應用鋪平道路。", "author": "Jinliang Lu et.al.", "authors": "Jinliang Lu, Ziliang Pang, Min Xiao, Yaochen Zhu, Rui Xia, Jiajun Zhang", "id": "2407.06089v1", "paper_url": "http://arxiv.org/abs/2407.06089v1", "repo": "null"}}