{"2407.14295": {"publish_time": "2024-07-19", "title": "CoVoSwitch: Machine Translation of Synthetic Code-Switched Text Based on Intonation Units", "paper_summary": "Multilingual code-switching research is often hindered by the lack and\nlinguistically biased status of available datasets. To expand language\nrepresentation, we synthesize code-switching data by replacing intonation units\ndetected through PSST, a speech segmentation model fine-tuned from OpenAI's\nWhisper, using a speech-to-text translation dataset, CoVoST 2. With our\ndataset, CoVoSwitch, spanning 13 languages, we evaluate the code-switching\ntranslation performance of two multilingual translation models, M2M-100 418M\nand NLLB-200 600M. We reveal that the inclusion of code-switching units results\nin higher translation performance than monolingual settings and that models are\nbetter at code-switching translation into English than non-English. Further,\nlow-resource languages gain most from integration of code-switched units when\ntranslating into English but much less when translating into non-English.\nTranslations into low-resource languages also perform worse than even raw\ncode-switched inputs. We find that systems excel at copying English tokens but\nstruggle with non-English tokens, that the off-target problem in monolingual\nsettings is also relevant in code-switching settings, and that models\nhallucinate in code-switching translation by introducing words absent in both\nof the original source sentences. CoVoSwitch and code are available at\nhttps://github.com/sophiayk20/covoswitch.", "paper_summary_zh": "多語言代碼轉換研究常常受到可用資料集缺乏和語言偏見狀態的阻礙。為了擴展語言表示，我們通過替換通過 PSST（一種由 OpenAI 的 Whisper 微調的語音分段模型）檢測到的語調單位，使用語音轉文本翻譯資料集 CoVoST 2 來合成代碼轉換資料。使用我們的資料集 CoVoSwitch，跨越 13 種語言，我們評估了兩個多語言翻譯模型（M2M-100 418M 和 NLLB-200 600M）的代碼轉換翻譯性能。我們發現，包含代碼轉換單元比單語語言設置產生更高的翻譯性能，並且模型在將代碼轉換翻譯成英語方面比非英語更好。此外，在翻譯成英語時，低資源語言從代碼轉換單元的整合中獲益最多，但在翻譯成非英語時獲益則少得多。翻譯成低資源語言的表現也比原始代碼轉換輸入更差。我們發現，系統擅長複製英語令牌，但在非英語令牌方面卻有困難，單語語言設置中的離題問題在代碼轉換設置中也很明顯，並且模型在代碼轉換翻譯中會出現幻覺，引入了兩個原始源句中都沒有的詞彙。CoVoSwitch 和代碼可在 https://github.com/sophiayk20/covoswitch 中找到。", "author": "Yeeun Kang et.al.", "authors": "Yeeun Kang", "id": "2407.14295v1", "paper_url": "http://arxiv.org/abs/2407.14295v1", "repo": "https://github.com/sophiayk20/covoswitch"}}