{"2410.16204": {"publish_time": "2024-10-21", "title": "Systematic Review: Text Processing Algorithms in Machine Learning and Deep Learning for Mental Health Detection on Social Media", "paper_summary": "The global rise in depression necessitates innovative detection methods for\nearly intervention. Social media provides a unique opportunity to identify\ndepression through user-generated posts. This systematic review evaluates\nmachine learning (ML) models for depression detection on social media, focusing\non biases and methodological challenges throughout the ML lifecycle. A search\nof PubMed, IEEE Xplore, and Google Scholar identified 47 relevant studies\npublished after 2010. The Prediction model Risk Of Bias ASsessment Tool\n(PROBAST) was utilized to assess methodological quality and risk of bias.\nSignificant biases impacting model reliability and generalizability were found.\nThere is a predominant reliance on Twitter (63.8%) and English-language content\n(over 90%), with most studies focusing on users from the United States and\nEurope. Non-probability sampling methods (approximately 80%) limit\nrepresentativeness. Only 23% of studies explicitly addressed linguistic nuances\nlike negations, crucial for accurate sentiment analysis. Inconsistent\nhyperparameter tuning was observed, with only 27.7% properly tuning models.\nAbout 17% did not adequately partition data into training, validation, and test\nsets, risking overfitting. While 74.5% used appropriate evaluation metrics for\nimbalanced data, others relied on accuracy without addressing class imbalance,\npotentially skewing results. Reporting transparency varied, often lacking\ncritical methodological details. These findings highlight the need to diversify\ndata sources, standardize preprocessing protocols, ensure consistent model\ndevelopment practices, address class imbalance, and enhance reporting\ntransparency. By overcoming these challenges, future research can develop more\nrobust and generalizable ML models for depression detection on social media,\ncontributing to improved mental health outcomes globally.", "paper_summary_zh": "全球憂鬱症的上升趨勢需要創新的偵測方法，以便早期介入。社群媒體透過使用者產生的貼文，提供了一個獨特的機會來識別憂鬱症。這篇系統性回顧針對社群媒體上的憂鬱症偵測，評估機器學習 (ML) 模型，重點關注 ML 生命週期中的偏誤和方法論挑戰。在 PubMed、IEEE Xplore 和 Google Scholar 中搜尋，找出 2010 年後發表的 47 項相關研究。預測模型風險偏誤評估工具 (PROBAST) 被用於評估方法論品質和偏誤風險。發現顯著的偏誤會影響模型的可靠性和概括性。過度依賴 Twitter (63.8%) 和英文內容 (超過 90%)，而且大多數研究都專注於來自美國和歐洲的使用者。非機率抽樣方法 (約 80%) 限制了代表性。只有 23% 的研究明確說明了語言上的細微差別，例如否定，這對於準確的情緒分析至關重要。觀察到不一致的超參數調整，只有 27.7% 適當地調整模型。約 17% 沒有適當地將資料分割成訓練、驗證和測試集，有過度擬合的風險。雖然 74.5% 使用了適當的評估指標來處理不平衡的資料，但其他指標依賴於準確性，而沒有解決類別不平衡的問題，可能會扭曲結果。報告的透明度有所不同，通常缺乏重要的方法論細節。這些發現突顯了多樣化資料來源、標準化前處理協定、確保一致的模型開發實務、解決類別不平衡以及提高報告透明度的必要性。透過克服這些挑戰，未來的研究可以開發出更強大且更具概括性的 ML 模型，用於社群媒體上的憂鬱症偵測，進而改善全球的心理健康成果。", "author": "Yuchen Cao et.al.", "authors": "Yuchen Cao, Jianglai Dai, Zhongyan Wang, Yeyubei Zhang, Xiaorui Shen, Yunchong Liu, Yexin Tian", "id": "2410.16204v1", "paper_url": "http://arxiv.org/abs/2410.16204v1", "repo": "null"}}