{"2410.10542": {"publish_time": "2024-10-14", "title": "Rethinking Legal Judgement Prediction in a Realistic Scenario in the Era of Large Language Models", "paper_summary": "This study investigates judgment prediction in a realistic scenario within\nthe context of Indian judgments, utilizing a range of transformer-based models,\nincluding InLegalBERT, BERT, and XLNet, alongside LLMs such as Llama-2 and\nGPT-3.5 Turbo. In this realistic scenario, we simulate how judgments are\npredicted at the point when a case is presented for a decision in court, using\nonly the information available at that time, such as the facts of the case,\nstatutes, precedents, and arguments. This approach mimics real-world\nconditions, where decisions must be made without the benefit of hindsight,\nunlike retrospective analyses often found in previous studies. For transformer\nmodels, we experiment with hierarchical transformers and the summarization of\njudgment facts to optimize input for these models. Our experiments with LLMs\nreveal that GPT-3.5 Turbo excels in realistic scenarios, demonstrating robust\nperformance in judgment prediction. Furthermore, incorporating additional legal\ninformation, such as statutes and precedents, significantly improves the\noutcome of the prediction task. The LLMs also provide explanations for their\npredictions. To evaluate the quality of these predictions and explanations, we\nintroduce two human evaluation metrics: Clarity and Linking. Our findings from\nboth automatic and human evaluations indicate that, despite advancements in\nLLMs, they are yet to achieve expert-level performance in judgment prediction\nand explanation tasks.", "paper_summary_zh": "本研究在印度判決的背景下，利用一系列基於Transformer的模型（包括 InLegalBERT、BERT 和 XLNet）以及諸如 Llama-2 和 GPT-3.5 Turbo 等 LLM，探討了在現實場景中的判決預測。在這個現實場景中，我們模擬了在法庭上提出判決時如何預測判決，僅使用當時可用的資訊，例如案件的事實、法規、先例和論點。這種方法模擬了真實世界的條件，在這些條件下必須在沒有事後見之明的幫助下做出決定，這與先前研究中經常發現的回顧性分析不同。對於Transformer模型，我們嘗試了階層式Transformer和判決事實摘要，以優化這些模型的輸入。我們對 LLM 的實驗表明，GPT-3.5 Turbo 在現實場景中表現出色，在判決預測中表現出強大的性能。此外，納入其他法律資訊（例如法規和先例）顯著改善了預測任務的結果。LLM 也為其預測提供了解釋。為了評估這些預測和解釋的品質，我們引入了兩個人類評估指標：清晰度和連結性。我們從自動和人類評估中得出的結果表明，儘管 LLM 有所進步，但它們尚未在判決預測和解釋任務中達到專家級別的表現。", "author": "Shubham Kumar Nigam et.al.", "authors": "Shubham Kumar Nigam, Aniket Deroy, Subhankar Maity, Arnab Bhattacharya", "id": "2410.10542v1", "paper_url": "http://arxiv.org/abs/2410.10542v1", "repo": "null"}}