{"2405.20053": {"publish_time": "2024-05-30", "title": "Would I Lie To You? Inference Time Alignment of Language Models using Direct Preference Heads", "paper_summary": "Pre-trained Language Models (LMs) exhibit strong zero-shot and in-context\nlearning capabilities; however, their behaviors are often difficult to control.\nBy utilizing Reinforcement Learning from Human Feedback (RLHF), it is possible\nto fine-tune unsupervised LMs to follow instructions and produce outputs that\nreflect human preferences. Despite its benefits, RLHF has been shown to\npotentially harm a language model's reasoning capabilities and introduce\nartifacts such as hallucinations where the model may fabricate facts. To\naddress this issue we introduce Direct Preference Heads (DPH), a fine-tuning\nframework that enables LMs to learn human preference signals through an\nauxiliary reward head without directly affecting the output distribution of the\nlanguage modeling head. We perform a theoretical analysis of our objective\nfunction and find strong ties to Conservative Direct Preference Optimization\n(cDPO). Finally we evaluate our models on GLUE, RACE, and the GPT4All\nevaluation suite and demonstrate that our method produces models which achieve\nhigher scores than those fine-tuned with Supervised Fine-Tuning (SFT) or Direct\nPreference Optimization (DPO) alone.", "paper_summary_zh": "預先訓練的語言模型 (LM) 展現強大的零次學習和情境學習能力；然而，它們的行為通常難以控制。藉由利用人類回饋的強化學習 (RLHF)，可以微調無監督的 LM 以遵循指示並產生反映人類偏好的輸出。儘管有這些好處，但 RLHF 已被證明可能會損害語言模型的推理能力，並引入幻覺等人工製品，其中模型可能會捏造事實。為了解決這個問題，我們引入了直接偏好頭 (DPH)，這是一個微調框架，使 LM 能夠透過輔助獎勵頭學習人類偏好訊號，而不會直接影響語言建模頭的輸出分佈。我們對我們的目標函數進行理論分析，並發現與保守直接偏好最佳化 (cDPO) 有密切關聯。最後，我們在 GLUE、RACE 和 GPT4All 評估套件上評估我們的模型，並證明我們的模型產生了比僅使用監督微調 (SFT) 或直接偏好最佳化 (DPO) 微調的模型獲得更高分數。", "author": "Avelina Asada Hadji-Kyriacou et.al.", "authors": "Avelina Asada Hadji-Kyriacou, Ognjen Arandjelovic", "id": "2405.20053v1", "paper_url": "http://arxiv.org/abs/2405.20053v1", "repo": "null"}}