{"2501.10105": {"publish_time": "2025-01-17", "title": "Universal Actions for Enhanced Embodied Foundation Models", "paper_summary": "Training on diverse, internet-scale data is a key factor in the success of\nrecent large foundation models. Yet, using the same recipe for building\nembodied agents has faced noticeable difficulties. Despite the availability of\nmany crowd-sourced embodied datasets, their action spaces often exhibit\nsignificant heterogeneity due to distinct physical embodiment and control\ninterfaces for different robots, causing substantial challenges in developing\nembodied foundation models using cross-domain data. In this paper, we introduce\nUniAct, a new embodied foundation modeling framework operating in a tokenized\nUniversal Action Space. Our learned universal actions capture the generic\natomic behaviors across diverse robots by exploiting their shared structural\nfeatures, and enable enhanced cross-domain data utilization and\ncross-embodiment generalizations by eliminating the notorious heterogeneity.\nThe universal actions can be efficiently translated back to heterogeneous\nactionable commands by simply adding embodiment-specific details, from which\nfast adaptation to new robots becomes simple and straightforward. Our 0.5B\ninstantiation of UniAct outperforms 14X larger SOTA embodied foundation models\nin extensive evaluations on various real-world and simulation robots,\nshowcasing exceptional cross-embodiment control and adaptation capability,\nhighlighting the crucial benefit of adopting universal actions. Project page:\nhttps://github.com/2toinf/UniAct", "paper_summary_zh": "在規模龐大的網際網路資料上進行訓練是近期大型基礎模型成功的關鍵因素。然而，使用相同的食譜來建構具體化代理人卻面臨著顯著的困難。儘管有許多群眾外包的具體化資料集，但由於不同的機器人具有不同的物理具體化和控制介面，因此其動作空間通常會表現出顯著的異質性，這在使用跨領域資料開發具體化基礎模型時會造成重大的挑戰。在本文中，我們介紹 UniAct，一個新的具體化基礎建模框架，在標記化的通用動作空間中運作。我們學習到的通用動作透過利用它們共有的結構特徵來擷取不同機器人之間的通用原子行為，並透過消除臭名昭著的異質性來實現增強的跨領域資料利用和跨具體化概括。通用動作可以透過簡單地加入具體化特定的細節來有效地轉譯回異質化的可操作命令，從而使快速適應新的機器人變得簡單且直接。我們 0.5B 的 UniAct 實例化在各種真實世界和模擬機器人上的廣泛評估中優於 14X 倍更大的 SOTA 具體化基礎模型，展示了非凡的跨具體化控制和適應能力，突顯了採用通用動作的關鍵優勢。專案頁面：https://github.com/2toinf/UniAct", "author": "Jinliang Zheng et.al.", "authors": "Jinliang Zheng, Jianxiong Li, Dongxiu Liu, Yinan Zheng, Zhihao Wang, Zhonghong Ou, Yu Liu, Jingjing Liu, Ya-Qin Zhang, Xianyuan Zhan", "id": "2501.10105v1", "paper_url": "http://arxiv.org/abs/2501.10105v1", "repo": "https://github.com/2toinf/uniact"}}