{"2405.08304": {"publish_time": "2024-05-14", "title": "Computational Thought Experiments for a More Rigorous Philosophy and Science of the Mind", "paper_summary": "We offer philosophical motivations for a method we call Virtual World\nCognitive Science (VW CogSci), in which researchers use virtual embodied agents\nthat are embedded in virtual worlds to explore questions in the field of\nCognitive Science. We focus on questions about mental and linguistic\nrepresentation and the ways that such computational modeling can add rigor to\nphilosophical thought experiments, as well as the terminology used in the\nscientific study of such representations. We find that this method forces\nresearchers to take a god's-eye view when describing dynamical relationships\nbetween entities in minds and entities in an environment in a way that\neliminates the need for problematic talk of belief and concept types, such as\nthe belief that cats are silly, and the concept CAT, while preserving belief\nand concept tokens in individual cognizers' minds. We conclude with some\nfurther key advantages of VW CogSci for the scientific study of mental and\nlinguistic representation and for Cognitive Science more broadly.", "paper_summary_zh": "我們提供一種我們稱之為虛擬世界認知科學 (VW CogSci) 的方法的哲學動機，研究人員在其中使用嵌入在虛擬世界中的虛擬具身代理，以探索認知科學領域中的問題。我們專注於心智和語言表徵的問題，以及這種計算建模如何為哲學思想實驗增加嚴謹性，以及用於此類表徵的科學研究中的術語。我們發現這種方法迫使研究人員在描述心智中的實體與環境中的實體之間的動態關係時採取上帝視角，從而消除了對信念和概念類型（例如相信貓很傻和 CAT 概念）的有問題的討論的需要，同時保留了個別認知者心智中的信念和概念標記。我們最後總結了 VW CogSci 在心智和語言表徵的科學研究以及更廣泛的認知科學中的一些進一步關鍵優勢。", "author": "Iris Oved et.al.", "authors": "Iris Oved, Nikhil Krishnaswamy, James Pustejovsky, Joshua Hartshorne", "id": "2405.08304v2", "paper_url": "http://arxiv.org/abs/2405.08304v2", "repo": "null"}}