{"2503.18862": {"publish_time": "2025-03-24", "title": "Exploring the Integration of Key-Value Attention Into Pure and Hybrid Transformers for Semantic Segmentation", "paper_summary": "While CNNs were long considered state of the art for image processing, the\nintroduction of Transformer architectures has challenged this position. While\nachieving excellent results in image classification and segmentation,\nTransformers remain inherently reliant on large training datasets and remain\ncomputationally expensive. A newly introduced Transformer derivative named KV\nTransformer shows promising results in synthetic, NLP, and image classification\ntasks, while reducing complexity and memory usage. This is especially conducive\nto use cases where local inference is required, such as medical screening\napplications. We endeavoured to further evaluate the merit of KV Transformers\non semantic segmentation tasks, specifically in the domain of medical imaging.\nBy directly comparing traditional and KV variants of the same base\narchitectures, we provide further insight into the practical tradeoffs of\nreduced model complexity. We observe a notable reduction in parameter count and\nmultiply accumulate operations, while achieving similar performance from most\nof the KV variant models when directly compared to their QKV implementation.", "paper_summary_zh": "<paragraph>雖然 CNN 長期以來一直被認為是圖像處理的最新技術，但 Transformer 架構的引入挑戰了這一地位。雖然 Transformer 在圖像分類和分割方面取得了優異的成果，但它們仍然本質上依賴於大型訓練數據集，而且計算成本高昂。一種新推出的名為 KV Transformer 的 Transformer 衍生模型在合成、NLP 和圖像分類任務中展現出良好的結果，同時降低了複雜性和內存使用量。這尤其有利於需要本地推理的用例，例如醫療篩檢應用。我們努力進一步評估 KV Transformer 在語義分割任務上的優點，特別是在醫學影像領域。通過直接比較相同基礎架構的傳統變體和 KV 變體，我們可以進一步了解降低模型複雜性的實際取捨。我們觀察到參數數量和乘積累加運算顯著減少，而大多數 KV 變體模型在與其 QKV 實現直接比較時，達到了相似的性能。</paragraph>\n", "author": "DeShin Hwa et.al.", "authors": "DeShin Hwa, Tobias Holmes, Klaus Drechsler", "id": "2503.18862v1", "paper_url": "http://arxiv.org/abs/2503.18862v1", "repo": "null"}}