{"2410.19110": {"publish_time": "2024-10-24", "title": "Bio2Token: All-atom tokenization of any biomolecular structure with Mamba", "paper_summary": "Efficient encoding and representation of large 3D molecular structures with\nhigh fidelity is critical for biomolecular design applications. Despite this,\nmany representation learning approaches restrict themselves to modeling smaller\nsystems or use coarse-grained approximations of the systems, for example\nmodeling proteins at the resolution of amino acid residues rather than at the\nlevel of individual atoms. To address this, we develop quantized auto-encoders\nthat learn atom-level tokenizations of complete proteins, RNA and small\nmolecule structures with reconstruction accuracies below and around 1 Angstrom.\nWe demonstrate that the Mamba state space model architecture employed is\ncomparatively efficient, requiring a fraction of the training data, parameters\nand compute needed to reach competitive accuracies and can scale to systems\nwith almost 100,000 atoms. The learned structure tokens of bio2token may serve\nas the input for all-atom language models in the future.", "paper_summary_zh": "有效編碼和表示大型 3D 分子結構並具有高保真度，對於生物分子設計應用至關重要。儘管如此，許多表示學習方法都將自己限制在建模較小的系統或使用系統的粗略近似值，例如以胺基酸殘基解析度而非個別原子層級建模蛋白質。為了解決這個問題，我們開發了量化的自動編碼器，它可以學習完整蛋白質、RNA 和小分子結構的原子級標記化，其重建準確度低於或約為 1 埃。我們證明所採用的 Mamba 狀態空間模型架構具有比較高的效率，只需要訓練數據、參數和計算的一小部分即可達到具有競爭力的準確度，並且可以擴展到擁有將近 100,000 個原子的系統。bio2token 學習的結構標記未來可能會作為全原子語言模型的輸入。", "author": "Andrew Liu et.al.", "authors": "Andrew Liu, Axel Elaldi, Nathan Russell, Olivia Viessmann", "id": "2410.19110v1", "paper_url": "http://arxiv.org/abs/2410.19110v1", "repo": "null"}}