{"2409.18475": {"publish_time": "2024-09-27", "title": "Data Analysis in the Era of Generative AI", "paper_summary": "This paper explores the potential of AI-powered tools to reshape data\nanalysis, focusing on design considerations and challenges. We explore how the\nemergence of large language and multimodal models offers new opportunities to\nenhance various stages of data analysis workflow by translating high-level user\nintentions into executable code, charts, and insights. We then examine\nhuman-centered design principles that facilitate intuitive interactions, build\nuser trust, and streamline the AI-assisted analysis workflow across multiple\napps. Finally, we discuss the research challenges that impede the development\nof these AI-based systems such as enhancing model capabilities, evaluating and\nbenchmarking, and understanding end-user needs.", "paper_summary_zh": "本文探討 AI 驅動工具重塑資料分析的潛力，重點關注設計考量和挑戰。我們探討大型語言和多模態模型的出現，如何提供新的機會，透過將高階使用者意圖轉換為可執行程式碼、圖表和見解，來增強資料分析工作流程的各個階段。然後，我們檢視以人為中心的設計原則，這些原則促進直覺式互動、建立使用者信任，並簡化跨多個應用程式的 AI 輔助分析工作流程。最後，我們討論阻礙這些 AI 系統開發的研究挑戰，例如增強模型功能、評估和基準測試，以及了解最終使用者的需求。", "author": "Jeevana Priya Inala et.al.", "authors": "Jeevana Priya Inala, Chenglong Wang, Steven Drucker, Gonzalo Ramos, Victor Dibia, Nathalie Riche, Dave Brown, Dan Marshall, Jianfeng Gao", "id": "2409.18475v1", "paper_url": "http://arxiv.org/abs/2409.18475v1", "repo": "null"}}