{"2501.02497": {"publish_time": "2025-01-05", "title": "Test-time Computing: from System-1 Thinking to System-2 Thinking", "paper_summary": "The remarkable performance of the o1 model in complex reasoning demonstrates\nthat test-time computing scaling can further unlock the model's potential,\nenabling powerful System-2 thinking. However, there is still a lack of\ncomprehensive surveys for test-time computing scaling. We trace the concept of\ntest-time computing back to System-1 models. In System-1 models, test-time\ncomputing addresses distribution shifts and improves robustness and\ngeneralization through parameter updating, input modification, representation\nediting, and output calibration. In System-2 models, it enhances the model's\nreasoning ability to solve complex problems through repeated sampling,\nself-correction, and tree search. We organize this survey according to the\ntrend of System-1 to System-2 thinking, highlighting the key role of test-time\ncomputing in the transition from System-1 models to weak System-2 models, and\nthen to strong System-2 models. We also point out a few possible future\ndirections.", "paper_summary_zh": "o1 模型在复杂推理中的卓越表现表明，测试时计算扩展可以进一步释放模型的潜力，实现强大的系统 2 思维。然而，对于测试时计算扩展，目前仍缺乏全面的调查。我们追溯了测试时计算的概念，将其追溯到系统 1 模型。在系统 1 模型中，测试时计算解决了分布偏移，并通过参数更新、输入修改、表示编辑和输出校准来提高鲁棒性和泛化能力。在系统 2 模型中，它通过重复采样、自我纠正和树搜索增强了模型解决复杂问题的推理能力。我们将这项调查按系统 1 到系统 2 思维的趋势进行组织，强调了测试时计算在从系统 1 模型过渡到弱系统 2 模型，再到强系统 2 模型中所扮演的关键角色。我们还指出了几个可能的未来方向。", "author": "Yixin Ji et.al.", "authors": "Yixin Ji, Juntao Li, Hai Ye, Kaixin Wu, Jia Xu, Linjian Mo, Min Zhang", "id": "2501.02497v1", "paper_url": "http://arxiv.org/abs/2501.02497v1", "repo": "https://github.com/dereck0602/awesome_test_time_llms"}}