{"2406.19251": {"publish_time": "2024-06-27", "title": "AutoRAG-HP: Automatic Online Hyper-Parameter Tuning for Retrieval-Augmented Generation", "paper_summary": "Recent advancements in Large Language Models have transformed ML/AI\ndevelopment, necessitating a reevaluation of AutoML principles for the\nRetrieval-Augmented Generation (RAG) systems. To address the challenges of\nhyper-parameter optimization and online adaptation in RAG, we propose the\nAutoRAG-HP framework, which formulates the hyper-parameter tuning as an online\nmulti-armed bandit (MAB) problem and introduces a novel two-level Hierarchical\nMAB (Hier-MAB) method for efficient exploration of large search spaces. We\nconduct extensive experiments on tuning hyper-parameters, such as top-k\nretrieved documents, prompt compression ratio, and embedding methods, using the\nALCE-ASQA and Natural Questions datasets. Our evaluation from jointly\noptimization all three hyper-parameters demonstrate that MAB-based online\nlearning methods can achieve Recall@5 $\\approx 0.8$ for scenarios with\nprominent gradients in search space, using only $\\sim20\\%$ of the LLM API calls\nrequired by the Grid Search approach. Additionally, the proposed Hier-MAB\napproach outperforms other baselines in more challenging optimization\nscenarios. The code will be made available at https://aka.ms/autorag.", "paper_summary_zh": "大型語言模型的最新進展已轉變 ML/AI 的開發，這使得必須重新評估用於檢索增強生成 (RAG) 系統的 AutoML 原則。為了應對 RAG 中的超參數最佳化和線上調整挑戰，我們提出了 AutoRAG-HP 架構，它將超參數調整制定為一個線上多重選擇賭博機 (MAB) 問題，並引入了一種新穎的兩層階層式 MAB (Hier-MAB) 方法，用於有效地探索大型搜尋空間。我們對超參數調整進行了廣泛的實驗，例如前 k 名檢索的文件、提示壓縮率和嵌入方法，使用 ALCE-ASQA 和自然問題資料集。我們從聯合最佳化所有三個超參數的評估中證明，基於 MAB 的線上學習方法可以針對搜尋空間中具有顯著梯度的場景實現 Recall@5 $\\approx 0.8$，僅使用網格搜尋方法所需的 LLM API 呼叫的 $\\sim20\\%$。此外，提出的 Hier-MAB 方法在更具挑戰性的最佳化場景中優於其他基準。程式碼將於 https://aka.ms/autorag 上提供。", "author": "Jia Fu et.al.", "authors": "Jia Fu, Xiaoting Qin, Fangkai Yang, Lu Wang, Jue Zhang, Qingwei Lin, Yubo Chen, Dongmei Zhang, Saravan Rajmohan, Qi Zhang", "id": "2406.19251v1", "paper_url": "http://arxiv.org/abs/2406.19251v1", "repo": "null"}}