{"2405.20705": {"publish_time": "2024-05-31", "title": "ADESSE: Advice Explanations in Complex Repeated Decision-Making Environments", "paper_summary": "In the evolving landscape of human-centered AI, fostering a synergistic\nrelationship between humans and AI agents in decision-making processes stands\nas a paramount challenge. This work considers a problem setup where an\nintelligent agent comprising a neural network-based prediction component and a\ndeep reinforcement learning component provides advice to a human decision-maker\nin complex repeated decision-making environments. Whether the human\ndecision-maker would follow the agent's advice depends on their beliefs and\ntrust in the agent and on their understanding of the advice itself. To this\nend, we developed an approach named ADESSE to generate explanations about the\nadviser agent to improve human trust and decision-making. Computational\nexperiments on a range of environments with varying model sizes demonstrate the\napplicability and scalability of ADESSE. Furthermore, an interactive game-based\nuser study shows that participants were significantly more satisfied, achieved\na higher reward in the game, and took less time to select an action when\npresented with explanations generated by ADESSE. These findings illuminate the\ncritical role of tailored, human-centered explanations in AI-assisted\ndecision-making.", "paper_summary_zh": "在以人为中心的人工智慧不断演變的領域中，促進人類和人工智慧代理在決策過程中產生協同效應的關係，是一項至關重要的挑戰。本研究考慮了一個問題設定，其中一個由基於神經網路的預測組成和一個深度強化學習組成的智慧代理，在複雜的重複決策環境中向人類決策者提供建議。人類決策者是否會遵循代理的建議取決於他們對代理的信念和信任，以及他們對建議本身的理解。為此，我們開發了一種名為 ADESSE 的方法，以產生關於顧問代理的解釋，以提高人類的信任和決策能力。在具有不同模型大小的各種環境中進行的計算實驗證明了 ADESSE 的適用性和可擴充性。此外，一項基於互動遊戲的使用者研究表明，當參與者看到由 ADESSE 生成的解釋時，他們的滿意度顯著提高，在遊戲中獲得的獎勵更高，並且選擇動作所需的時間更短。這些發現闡明了量身定制、以人為中心的解釋在人工智慧輔助決策中的關鍵作用。", "author": "Sören Schleibaum et.al.", "authors": "Sören Schleibaum, Lu Feng, Sarit Kraus, Jörg P. Müller", "id": "2405.20705v1", "paper_url": "http://arxiv.org/abs/2405.20705v1", "repo": "null"}}