{"2407.20337": {"publish_time": "2024-07-29", "title": "Contrasting Deepfakes Diffusion via Contrastive Learning and Global-Local Similarities", "paper_summary": "Discerning between authentic content and that generated by advanced AI\nmethods has become increasingly challenging. While previous research primarily\naddresses the detection of fake faces, the identification of generated natural\nimages has only recently surfaced. This prompted the recent exploration of\nsolutions that employ foundation vision-and-language models, like CLIP.\nHowever, the CLIP embedding space is optimized for global image-to-text\nalignment and is not inherently designed for deepfake detection, neglecting the\npotential benefits of tailored training and local image features. In this\nstudy, we propose CoDE (Contrastive Deepfake Embeddings), a novel embedding\nspace specifically designed for deepfake detection. CoDE is trained via\ncontrastive learning by additionally enforcing global-local similarities. To\nsustain the training of our model, we generate a comprehensive dataset that\nfocuses on images generated by diffusion models and encompasses a collection of\n9.2 million images produced by using four different generators. Experimental\nresults demonstrate that CoDE achieves state-of-the-art accuracy on the newly\ncollected dataset, while also showing excellent generalization capabilities to\nunseen image generators. Our source code, trained models, and collected dataset\nare publicly available at: https://github.com/aimagelab/CoDE.", "paper_summary_zh": "區分真實內容和由進階人工智慧方法產生的內容已變得越來越具有挑戰性。雖然先前的研究主要針對假臉的偵測，但生成自然影像的辨識直到最近才浮現。這促使最近探討採用基礎視覺和語言模型（例如 CLIP）的解決方案。然而，CLIP 嵌入空間針對全球影像對文字比對進行最佳化，並非專門設計用於深度偽造偵測，忽略了客製化訓練和局部影像特徵的潛在好處。在本研究中，我們提出 CoDE（對比深度偽造嵌入），一種專門設計用於深度偽造偵測的新嵌入空間。CoDE 透過對比學習進行訓練，並額外強制執行全局局部相似性。為了持續訓練我們的模型，我們產生了一個綜合資料集，專注於由擴散模型產生的影像，並包含使用四種不同產生器產生的 920 萬張影像集合。實驗結果證明，CoDE 在新收集的資料集上達到了最先進的準確度，同時也對未見過的影像產生器展現出極佳的泛化能力。我們的原始碼、訓練過的模型和收集的資料集公開於：https://github.com/aimagelab/CoDE。", "author": "Lorenzo Baraldi et.al.", "authors": "Lorenzo Baraldi, Federico Cocchi, Marcella Cornia, Lorenzo Baraldi, Alessandro Nicolosi, Rita Cucchiara", "id": "2407.20337v1", "paper_url": "http://arxiv.org/abs/2407.20337v1", "repo": "https://github.com/aimagelab/code"}}