{"2405.16847": {"publish_time": "2024-05-27", "title": "TokenUnify: Scalable Autoregressive Visual Pre-training with Mixture Token Prediction", "paper_summary": "Autoregressive next-token prediction is a standard pretraining method for\nlarge-scale language models, but its application to vision tasks is hindered by\nthe non-sequential nature of image data, leading to cumulative errors. Most\nvision models employ masked autoencoder (MAE) based pretraining, which faces\nscalability issues. To address these challenges, we introduce\n\\textbf{TokenUnify}, a novel pretraining method that integrates random token\nprediction, next-token prediction, and next-all token prediction. We provide\ntheoretical evidence demonstrating that TokenUnify mitigates cumulative errors\nin visual autoregression. Cooperated with TokenUnify, we have assembled a\nlarge-scale electron microscopy (EM) image dataset with ultra-high resolution,\nideal for creating spatially correlated long sequences. This dataset includes\nover 120 million annotated voxels, making it the largest neuron segmentation\ndataset to date and providing a unified benchmark for experimental validation.\nLeveraging the Mamba network inherently suited for long-sequence modeling on\nthis dataset, TokenUnify not only reduces the computational complexity but also\nleads to a significant 45\\% improvement in segmentation performance on\ndownstream EM neuron segmentation tasks compared to existing methods.\nFurthermore, TokenUnify demonstrates superior scalability over MAE and\ntraditional autoregressive methods, effectively bridging the gap between\npretraining strategies for language and vision models. Code is available at\n\\url{https://github.com/ydchen0806/TokenUnify}.", "paper_summary_zh": "回歸自迴歸下一個符號預測是大規模語言模型的標準預訓練方法，但其在視覺任務中的應用受到影像資料非序列性質的阻礙，導致累積誤差。大多數視覺模型採用基於遮罩自動編碼器 (MAE) 的預訓練，這面臨可擴充性的問題。為了應對這些挑戰，我們引入了 TokenUnify，這是一種新的預訓練方法，整合了隨機符號預測、下一個符號預測和下一個所有符號預測。我們提供了理論證據，證明 TokenUnify 減輕了視覺自動迴歸中的累積誤差。配合 TokenUnify，我們組建了一個具有超高解析度的大規模電子顯微鏡 (EM) 影像資料集，非常適合建立空間相關長序列。此資料集包含超過 1.2 億個註解體素，使其成為迄今為止最大的神經元分割資料集，並提供了一個統一的基準，用於實驗驗證。利用本質上適合於此資料集上的長序列建模的 Mamba 網路，TokenUnify 不僅降低了運算複雜度，而且與現有方法相比，在下游 EM 神經元分割任務中，分割效能顯著提升了 45%。此外，TokenUnify 展示了優於 MAE 和傳統自動迴歸方法的可擴充性，有效地彌合了語言和視覺模型預訓練策略之間的差距。程式碼可在 https://github.com/ydchen0806/TokenUnify 取得。", "author": "Yinda Chen et.al.", "authors": "Yinda Chen, Haoyuan Shi, Xiaoyu Liu, Te Shi, Ruobing Zhang, Dong Liu, Zhiwei Xiong, Feng Wu", "id": "2405.16847v1", "paper_url": "http://arxiv.org/abs/2405.16847v1", "repo": "null"}}