{"2405.20285": {"publish_time": "2024-05-30", "title": "Who Writes the Review, Human or AI?", "paper_summary": "With the increasing use of Artificial Intelligence in Natural Language\nProcessing, concerns have been raised regarding the detection of AI-generated\ntext in various domains. This study aims to investigate this issue by proposing\na methodology to accurately distinguish AI-generated and human-written book\nreviews. Our approach utilizes transfer learning, enabling the model to\nidentify generated text across different topics while improving its ability to\ndetect variations in writing style and vocabulary. To evaluate the\neffectiveness of the proposed methodology, we developed a dataset consisting of\nreal book reviews and AI-generated reviews using the recently proposed Vicuna\nopen-source language model. The experimental results demonstrate that it is\nfeasible to detect the original source of text, achieving an accuracy rate of\n96.86%. Our efforts are oriented toward the exploration of the capabilities and\nlimitations of Large Language Models in the context of text identification.\nExpanding our knowledge in these aspects will be valuable for effectively\nnavigating similar models in the future and ensuring the integrity and\nauthenticity of human-generated content.", "paper_summary_zh": "隨著人工智慧在自然語言處理中的應用日益廣泛，在各種領域中偵測 AI 生成的文字也引發了關注。本研究旨在探討這個問題，提出一個方法論來準確區分 AI 生成的書評和人類撰寫的書評。我們的做法利用了遷移學習，讓模型能夠識別不同主題中產生的文字，同時提升它偵測寫作風格和詞彙變化的能力。為了評估所提出的方法論的有效性，我們開發了一個資料集，其中包含使用最近提出的 Vicuna 開源語言模型產生的真實書評和 AI 生成的書評。實驗結果顯示偵測文字的原始來源是可行的，達到了 96.86% 的準確率。我們的努力方向是探索大型語言模型在文字辨識脈絡中的能力和限制。擴展我們在這些方面的知識，對於在未來有效地使用類似的模型，並確保人類產生內容的完整性和真實性，將是有價值的。", "author": "Panagiotis C. Theocharopoulos et.al.", "authors": "Panagiotis C. Theocharopoulos, Spiros V. Georgakopoulos, Sotiris K. Tasoulis, Vassilis P. Plagianakos", "id": "2405.20285v1", "paper_url": "http://arxiv.org/abs/2405.20285v1", "repo": "null"}}