{"2412.01705": {"publish_time": "2024-11-24", "title": "Uncertainty-Aware Regularization for Image-to-Image Translation", "paper_summary": "The importance of quantifying uncertainty in deep networks has become\nparamount for reliable real-world applications. In this paper, we propose a\nmethod to improve uncertainty estimation in medical Image-to-Image (I2I)\ntranslation. Our model integrates aleatoric uncertainty and employs\nUncertainty-Aware Regularization (UAR) inspired by simple priors to refine\nuncertainty estimates and enhance reconstruction quality. We show that by\nleveraging simple priors on parameters, our approach captures more robust\nuncertainty maps, effectively refining them to indicate precisely where the\nnetwork encounters difficulties, while being less affected by noise. Our\nexperiments demonstrate that UAR not only improves translation performance, but\nalso provides better uncertainty estimations, particularly in the presence of\nnoise and artifacts. We validate our approach using two medical imaging\ndatasets, showcasing its effectiveness in maintaining high confidence in\nfamiliar regions while accurately identifying areas of uncertainty in\nnovel/ambiguous scenarios.", "paper_summary_zh": "量化深度網路中的不確定性對於可靠的真實世界應用程式來說至關重要。在本文中，我們提出了一種方法來改善醫學影像轉影像 (I2I) 翻譯中的不確定性估計。我們的模型整合了隨機不確定性，並採用受簡單先驗啟發的不確定性感知正規化 (UAR) 來改善不確定性估計並增強重建品質。我們證明，透過利用參數上的簡單先驗，我們的做法能捕捉到更穩健的不確定性圖，並有效地改善這些圖，以精確地指出網路遭遇困難的地方，同時較不受雜訊影響。我們的實驗證明，UAR 不僅改善了翻譯效能，還提供了更好的不確定性估計，特別是在有雜訊和人工製品的情況下。我們使用兩個醫學影像資料集驗證了我們的做法，展示了它在維持熟悉區域的高信心，同時準確識別新穎/模糊場景中的不確定性區域方面的效能。", "author": "Anuja Vats et.al.", "authors": "Anuja Vats, Ivar Farup, Marius Pedersen, Kiran Raja", "id": "2412.01705v1", "paper_url": "http://arxiv.org/abs/2412.01705v1", "repo": "null"}}