{"2409.05224": {"publish_time": "2024-09-08", "title": "Exploring Intrinsic Language-specific Subspaces in Fine-tuning Multilingual Neural Machine Translation", "paper_summary": "Multilingual neural machine translation models support fine-tuning hundreds\nof languages simultaneously. However, fine-tuning on full parameters solely is\ninefficient potentially leading to negative interactions among languages. In\nthis work, we demonstrate that the fine-tuning for a language occurs in its\nintrinsic language-specific subspace with a tiny fraction of entire parameters.\nThus, we propose language-specific LoRA to isolate intrinsic language-specific\nsubspaces. Furthermore, we propose architecture learning techniques and\nintroduce a gradual pruning schedule during fine-tuning to exhaustively explore\nthe optimal setting and the minimal intrinsic subspaces for each language,\nresulting in a lightweight yet effective fine-tuning procedure. The\nexperimental results on a 12-language subset and a 30-language subset of\nFLORES-101 show that our methods not only outperform full-parameter fine-tuning\nup to 2.25 spBLEU scores but also reduce trainable parameters to $0.4\\%$ for\nhigh and medium-resource languages and $1.6\\%$ for low-resource ones.", "paper_summary_zh": "多語言神經機器翻譯模型同時支援數百種語言的微調。然而，僅針對完整參數進行微調效率低下，可能會導致語言之間產生負面互動。在這項工作中，我們證明了語言的微調發生在其內在語言特定子空間中，只佔整體參數的一小部分。因此，我們提出語言特定的 LoRA 來隔離內在語言特定子空間。此外，我們提出架構學習技術，並在微調期間引入漸進式修剪排程，以徹底探索每個語言的最佳設定和最小內在子空間，從而產生輕量級且有效的微調程序。在 FLORES-101 的 12 語言子集和 30 語言子集上的實驗結果表明，我們的模型不僅優於全參數微調，spBLEU 分數高達 2.25，而且將可訓練參數減少到高資源和中資源語言的 0.4%，以及低資源語言的 1.6%。", "author": "Zhe Cao et.al.", "authors": "Zhe Cao, Zhi Qu, Hidetaka Kamigaito, Taro Watanabe", "id": "2409.05224v1", "paper_url": "http://arxiv.org/abs/2409.05224v1", "repo": "https://github.com/spike0924/lslo"}}