{"2503.17229": {"publish_time": "2025-03-21", "title": "FactSelfCheck: Fact-Level Black-Box Hallucination Detection for LLMs", "paper_summary": "Large Language Models (LLMs) frequently generate hallucinated content, posing\nsignificant challenges for applications where factuality is crucial. While\nexisting hallucination detection methods typically operate at the sentence\nlevel or passage level, we propose FactSelfCheck, a novel black-box\nsampling-based method that enables fine-grained fact-level detection. Our\napproach represents text as knowledge graphs consisting of facts in the form of\ntriples. Through analyzing factual consistency across multiple LLM responses,\nwe compute fine-grained hallucination scores without requiring external\nresources or training data. Our evaluation demonstrates that FactSelfCheck\nperforms competitively with leading sampling-based methods while providing more\ndetailed insights. Most notably, our fact-level approach significantly improves\nhallucination correction, achieving a 35% increase in factual content compared\nto the baseline, while sentence-level SelfCheckGPT yields only an 8%\nimprovement. The granular nature of our detection enables more precise\nidentification and correction of hallucinated content.", "paper_summary_zh": "大型語言模型 (LLM) 經常產生虛構的內容，這對事實性至關重要的應用程式構成了重大挑戰。雖然現有的幻覺檢測方法通常在句子級別或段落級別運作，但我們提出了 FactSelfCheck，這是一種新穎的基於黑盒抽樣的的方法，可以實現細粒度的事實級別檢測。我們的方法將文字表示為由三元組形式的事實組成的知識圖譜。透過分析多個 LLM 回應之間的事實一致性，我們計算細粒度的幻覺分數，而無需外部資源或訓練數據。我們的評估表明，FactSelfCheck的性能與領先的基於抽樣的方法相比具有競爭力，同時提供更詳細的見解。最值得注意的是，我們的事實級別方法顯著改善了幻覺校正，與基準相比，事實內容增加了 35%，而句子級別的 SelfCheckGPT 僅提高了 8%。我們檢測的粒度特性可以更精確地識別和糾正虛構的內容。\n", "author": "Albert Sawczyn et.al.", "authors": "Albert Sawczyn, Jakub Binkowski, Denis Janiak, Bogdan Gabrys, Tomasz Kajdanowicz", "id": "2503.17229v1", "paper_url": "http://arxiv.org/abs/2503.17229v1", "repo": "null"}}