{"2411.16927": {"publish_time": "2024-11-25", "title": "ASSERTIFY: Utilizing Large Language Models to Generate Assertions for Production Code", "paper_summary": "Production assertions are statements embedded in the code to help developers\nvalidate their assumptions about the code. They assist developers in debugging,\nprovide valuable documentation, and enhance code comprehension. Current\nresearch in this area primarily focuses on assertion generation for unit tests\nusing techniques, such as static analysis and deep learning. While these\ntechniques have shown promise, they fall short when it comes to generating\nproduction assertions, which serve a different purpose.\n  This preprint addresses the gap by introducing Assertify, an automated\nend-to-end tool that leverages Large Language Models (LLMs) and prompt\nengineering with few-shot learning to generate production assertions. By\ncreating context-rich prompts, the tool emulates the approach developers take\nwhen creating production assertions for their code. To evaluate our approach,\nwe compiled a dataset of 2,810 methods by scraping 22 mature Java repositories\nfrom GitHub. Our experiments demonstrate the effectiveness of few-shot learning\nby producing assertions with an average ROUGE-L score of 0.526, indicating\nreasonably high structural similarity with the assertions written by\ndevelopers. This research demonstrates the potential of LLMs in automating the\ngeneration of production assertions that resemble the original assertions.", "paper_summary_zh": "生產斷言是嵌入在程式碼中的陳述，用於協助開發人員驗證他們對程式碼的假設。它們協助開發人員進行除錯、提供有價值的文件，並增強程式碼理解。目前這方面的研究主要集中於使用靜態分析和深度學習等技術針對單元測試產生斷言。雖然這些技術已展現出前景，但在產生生產斷言時卻有所不足，因為生產斷言服務於不同的目的。\n  本預印本透過引入 Assertify 來解決這個差距，Assertify 是一個自動化端到端工具，它利用大型語言模型 (LLM) 和提示工程，並透過少量學習來產生生產斷言。透過建立豐富的提示，此工具模擬開發人員在為其程式碼建立生產斷言時採取的方法。為了評估我們的做法，我們透過從 GitHub 中擷取 22 個成熟的 Java 儲存庫，編譯了一個包含 2,810 個方法的資料集。我們的實驗證明了少量學習的有效性，它產生斷言的平均 ROUGE-L 分數為 0.526，表示與開發人員編寫的斷言具有相當高的結構相似性。這項研究展示了 LLM 在自動化產生類似原始斷言的生產斷言方面的潛力。", "author": "Mohammad Jalili Torkamani et.al.", "authors": "Mohammad Jalili Torkamani, Abhinav Sharma, Nikita Mehrotra, Rahul Purandare", "id": "2411.16927v1", "paper_url": "http://arxiv.org/abs/2411.16927v1", "repo": "null"}}