{"2409.11598": {"publish_time": "2024-09-17", "title": "Towards Fair RAG: On the Impact of Fair Ranking in Retrieval-Augmented Generation", "paper_summary": "Many language models now enhance their responses with retrieval capabilities,\nleading to the widespread adoption of retrieval-augmented generation (RAG)\nsystems. However, despite retrieval being a core component of RAG, much of the\nresearch in this area overlooks the extensive body of work on fair ranking,\nneglecting the importance of considering all stakeholders involved. This paper\npresents the first systematic evaluation of RAG systems integrated with fair\nrankings. We focus specifically on measuring the fair exposure of each relevant\nitem across the rankings utilized by RAG systems (i.e., item-side fairness),\naiming to promote equitable growth for relevant item providers. To gain a deep\nunderstanding of the relationship between item-fairness, ranking quality, and\ngeneration quality in the context of RAG, we analyze nine different RAG systems\nthat incorporate fair rankings across seven distinct datasets. Our findings\nindicate that RAG systems with fair rankings can maintain a high level of\ngeneration quality and, in many cases, even outperform traditional RAG systems,\ndespite the general trend of a tradeoff between ensuring fairness and\nmaintaining system-effectiveness. We believe our insights lay the groundwork\nfor responsible and equitable RAG systems and open new avenues for future\nresearch. We publicly release our codebase and dataset at\nhttps://github.com/kimdanny/Fair-RAG.", "paper_summary_zh": "許多語言模型現在都透過擷取功能來增強其回應，導致廣泛採用擷取增強生成 (RAG) 系統。然而，儘管擷取是 RAG 的核心組成部分，但這個領域的大部分研究都忽略了公平排名的大量研究成果，忽視了考量所有相關利害關係人的重要性。本文首次對整合公平排名的 RAG 系統進行系統性評估。我們特別關注衡量 RAG 系統所使用的排名中每個相關項目的公平曝光度（即項目端公平性），旨在促進相關項目提供者的公平成長。為了深入了解 RAG 背景下項目公平性、排名品質和生成品質之間的關係，我們分析了九個不同的 RAG 系統，這些系統在七個不同的資料集上納入了公平排名。我們的研究結果表明，具有公平排名的 RAG 系統可以維持高水準的生成品質，在許多情況下甚至優於傳統的 RAG 系統，儘管在確保公平性和維持系統效能之間存在權衡取捨的普遍趨勢。我們相信我們的見解為負責任且公平的 RAG 系統奠定了基礎，並為未來的研究打開了新的途徑。我們在 https://github.com/kimdanny/Fair-RAG 上公開發布我們的程式碼庫和資料集。", "author": "To Eun Kim et.al.", "authors": "To Eun Kim, Fernando Diaz", "id": "2409.11598v1", "paper_url": "http://arxiv.org/abs/2409.11598v1", "repo": "https://github.com/kimdanny/fair-rag"}}