{"2406.20030": {"publish_time": "2024-06-28", "title": "LEMoE: Advanced Mixture of Experts Adaptor for Lifelong Model Editing of Large Language Models", "paper_summary": "Large language models (LLMs) require continual knowledge updates to stay\nabreast of the ever-changing world facts, prompting the formulation of lifelong\nmodel editing task. While recent years have witnessed the development of\nvarious techniques for single and batch editing, these methods either fail to\napply or perform sub-optimally when faced with lifelong editing. In this paper,\nwe introduce LEMoE, an advanced Mixture of Experts (MoE) adaptor for lifelong\nmodel editing. We first analyze the factors influencing the effectiveness of\nconventional MoE adaptor in lifelong editing, including catastrophic\nforgetting, inconsistent routing and order sensitivity. Based on these\ninsights, we propose a tailored module insertion method to achieve lifelong\nediting, incorporating a novel KV anchor routing to enhance routing consistency\nbetween training and inference stage, along with a concise yet effective\nclustering-based editing order planning. Experimental results demonstrate the\neffectiveness of our method in lifelong editing, surpassing previous model\nediting techniques while maintaining outstanding performance in batch editing\ntask. Our code will be available.", "paper_summary_zh": "大型語言模型 (LLM) 需要持續更新知識，以掌握瞬息萬變的世界事實，促使制定終身模型編輯任務。儘管近年來見證了各種單次和批次編輯技術的發展，但這些方法在面對終身編輯時，要不無法應用，要不就是表現不佳。在本文中，我們介紹了 LEMoE，一種先進的專家混合 (MoE) 適配器，用於終身模型編輯。我們首先分析了影響傳統 MoE 適配器在終身編輯中有效性的因素，包括災難性遺忘、不一致的路由和順序敏感性。根據這些見解，我們提出了一種量身打造的模組插入方法來實現終身編輯，結合了一種新穎的 KV錨定路由，以增強訓練和推理階段之間的路由一致性，以及一種簡潔但有效的基於群集的編輯順序規劃。實驗結果證明了我們的方法在終身編輯中的有效性，超越了先前的模型編輯技術，同時在批次編輯任務中保持出色的效能。我們的程式碼將會提供。", "author": "Renzhi Wang et.al.", "authors": "Renzhi Wang, Piji Li", "id": "2406.20030v1", "paper_url": "http://arxiv.org/abs/2406.20030v1", "repo": "null"}}