{"2410.13987": {"publish_time": "2024-10-17", "title": "RiTeK: A Dataset for Large Language Models Complex Reasoning over Textual Knowledge Graphs", "paper_summary": "Answering complex real-world questions often requires accurate retrieval from\ntextual knowledge graphs (TKGs). The scarcity of annotated data, along with\nintricate topological structures, makes this task particularly challenging. As\nthe nature of relational path information could enhance the inference ability\nof Large Language Models (LLMs), efficiently retrieving more complex relational\npath information from TKGs presents another key challenge. To tackle these\nchallenges, we first develop a Dataset for LLMs Complex Reasoning over Textual\nKnowledge Graphs (RiTeK) with a broad topological structure coverage.We\nsynthesize realistic user queries that integrate diverse topological\nstructures, relational information, and complex textual descriptions. We\nconduct rigorous expert evaluation to validate the quality of our synthesized\nqueries. And then, we introduce an enhanced Monte Carlo Tree Search (MCTS)\nmethod, Relational MCTS, to automatically extract relational path information\nfrom textual graphs for specific queries. Our dataset mainly covers the medical\ndomain as the relation types and entity are complex and publicly available.\nExperimental results indicate that RiTeK poses significant challenges for\ncurrent retrieval and LLM systems, while the proposed Relational MCTS method\nenhances LLM inference ability and achieves state-of-the-art performance on\nRiTeK.", "paper_summary_zh": "回答複雜的現實世界問題通常需要從文本知識圖 (TKG) 中準確擷取。標註資料的稀少，加上複雜的拓撲結構，使得這項任務特別具有挑戰性。由於關係路徑資訊的性質可以增強大型語言模型 (LLM) 的推論能力，從 TKG 有效地擷取更複雜的關係路徑資訊提出了另一個關鍵挑戰。為了應對這些挑戰，我們首先開發了一個具有廣泛拓撲結構涵蓋範圍的文本知識圖 (RiTeK) 上的 LLM 複雜推理資料集。我們綜合了整合了多樣化拓撲結構、關係資訊和複雜文本描述的現實使用者查詢。我們進行嚴格的專家評估，以驗證我們綜合查詢的品質。然後，我們引入一種增強的蒙地卡羅樹搜尋 (MCTS) 方法，即關係 MCTS，以自動從文本圖中擷取特定查詢的關係路徑資訊。我們的資料集主要涵蓋醫療領域，因為關係類型和實體很複雜且公開可用。實驗結果表明，RiTeK 對目前的擷取和 LLM 系統提出了重大挑戰，而所提出的關係 MCTS 方法增強了 LLM 推論能力，並在 RiTeK 上達到了最先進的效能。", "author": "Jiatan Huang et.al.", "authors": "Jiatan Huang, Mingchen Li, Zonghai Yao, Zhichao Yang, Yongkang Xiao, Feiyun Ouyang, Xiaohan Li, Shuo Han, Hong Yu", "id": "2410.13987v1", "paper_url": "http://arxiv.org/abs/2410.13987v1", "repo": "null"}}