{"2410.12869": {"publish_time": "2024-10-14", "title": "Language Model Preference Evaluation with Multiple Weak Evaluators", "paper_summary": "Despite the remarkable success of Large Language Models (LLMs), evaluating\ntheir outputs' quality regarding preference remains a critical challenge.\nExisting works usually leverage a powerful LLM (e.g., GPT4) as the judge for\ncomparing LLMs' output pairwisely, yet such model-based evaluator is vulnerable\nto conflicting preference, i.e., output A is better than B, B than C, but C\nthan A, causing contradictory evaluation results. To improve model-based\npreference evaluation, we introduce GED (Preference Graph Ensemble and\nDenoise), a novel approach that leverages multiple model-based evaluators to\nconstruct preference graphs, and then ensemble and denoise these graphs for\nbetter, non-contradictory evaluation results. In particular, our method\nconsists of two primary stages: aggregating evaluations into a unified graph\nand applying a denoising process to eliminate cyclic inconsistencies, ensuring\na directed acyclic graph (DAG) structure. We provide theoretical guarantees for\nour framework, demonstrating its efficacy in recovering the ground truth\npreference structure. Extensive experiments across ten benchmark datasets show\nthat GED outperforms baseline methods in model ranking, response selection, and\nmodel alignment tasks. Notably, GED combines weaker evaluators like Llama3-8B,\nMistral-7B, and Qwen2-7B to surpass the performance of stronger evaluators like\nQwen2-72B, highlighting its ability to enhance evaluation reliability and\nimprove model performance.", "paper_summary_zh": "儘管大型語言模型（LLM）獲得了顯著的成功，但評估其產出的品質仍然是一項關鍵的挑戰。現有的作品通常利用強大的 LLM（例如 GPT4）作為評審，成對比較 LLM 的產出，然而這種基於模型的評估器容易受到衝突偏好的影響，即輸出 A 優於 B，B 優於 C，但 C 優於 A，導致矛盾的評估結果。為了改進基於模型的偏好評估，我們引入了 GED（偏好圖形集成和去噪），這是一種新穎的方法，它利用多個基於模型的評估器來構建偏好圖形，然後集成並對這些圖形進行去噪，以獲得更好、無矛盾的評估結果。特別是，我們的模型包含兩個主要階段：將評估聚合到一個統一的圖形中，並應用去噪程序以消除循環不一致性，確保有向無環圖 (DAG) 結構。我們為我們的框架提供了理論保證，證明了其在恢復真實偏好結構方面的效力。跨越十個基準資料集的廣泛實驗表明，GED 在模型排名、回應選擇和模型對齊任務中優於基線方法。值得注意的是，GED 結合了 Llama3-8B、Mistral-7B 和 Qwen2-7B 等較弱的評估器，以超越 Qwen2-72B 等較強評估器的性能，突顯了其增強評估可靠性和改善模型性能的能力。", "author": "Zhengyu Hu et.al.", "authors": "Zhengyu Hu, Jieyu Zhang, Zhihan Xiong, Alexander Ratner, Hui Xiong, Ranjay Krishna", "id": "2410.12869v1", "paper_url": "http://arxiv.org/abs/2410.12869v1", "repo": "null"}}