{"2502.06781": {"publish_time": "2025-02-10", "title": "Exploring the Limit of Outcome Reward for Learning Mathematical Reasoning", "paper_summary": "Reasoning abilities, especially those for solving complex math problems, are\ncrucial components of general intelligence. Recent advances by proprietary\ncompanies, such as o-series models of OpenAI, have made remarkable progress on\nreasoning tasks. However, the complete technical details remain unrevealed, and\nthe techniques that are believed certainly to be adopted are only reinforcement\nlearning (RL) and the long chain of thoughts. This paper proposes a new RL\nframework, termed OREAL, to pursue the performance limit that can be achieved\nthrough \\textbf{O}utcome \\textbf{RE}w\\textbf{A}rd-based reinforcement\n\\textbf{L}earning for mathematical reasoning tasks, where only binary outcome\nrewards are easily accessible. We theoretically prove that behavior cloning on\npositive trajectories from best-of-N (BoN) sampling is sufficient to learn the\nKL-regularized optimal policy in binary feedback environments. This formulation\nfurther implies that the rewards of negative samples should be reshaped to\nensure the gradient consistency between positive and negative samples. To\nalleviate the long-existing difficulties brought by sparse rewards in RL, which\nare even exacerbated by the partial correctness of the long chain of thought\nfor reasoning tasks, we further apply a token-level reward model to sample\nimportant tokens in reasoning trajectories for learning. With OREAL, for the\nfirst time, a 7B model can obtain 94.0 pass@1 accuracy on MATH-500 through RL,\nbeing on par with 32B models. OREAL-32B also surpasses previous 32B models\ntrained by distillation with 95.0 pass@1 accuracy on MATH-500. Our\ninvestigation also indicates the importance of initial policy models and\ntraining queries for RL. Code, models, and data will be released to benefit\nfuture research\\footnote{https://github.com/InternLM/OREAL}.", "paper_summary_zh": "<paragraph>推理能力，尤其是解決複雜數學問題的能力，是整體智力的關鍵組成部分。最近，OpenAI 的 o 系列模型等專有公司的進步，在推理任務上取得了顯著進展。然而，完整的技術細節仍未公開，而被認為肯定會採用的技術只有強化學習 (RL) 和長鏈思考。本文提出了一個新的 RL 框架，稱為 OREAL，以追求可通過面向結果獎勵的強化學習 (RL) 來實現數學推理任務的效能極限，其中只有二元結果獎勵容易獲得。我們從理論上證明，在最佳 N (BoN) 採樣中對正面軌跡進行行為複製，足以在二元回饋環境中學習 KL 正則化的最佳策略。這個公式進一步暗示，應重新調整負面範例的獎勵，以確保正面和負面範例之間的梯度一致性。為了減輕 RL 中稀疏獎勵帶來的長期存在的困難，而推理任務中長鏈思考的部分正確性更讓情況雪上加霜，我們進一步應用代幣級別的獎勵模型，以在推理軌跡中採樣重要的代幣進行學習。有了 OREAL，一個 7B 模型首次可以在 MATH-500 上通過 RL 獲得 94.0 的 pass@1 準確率，與 32B 模型不相上下。OREAL-32B 也超越了之前通過知識蒸餾訓練的 32B 模型，在 MATH-500 上獲得 95.0 的 pass@1 準確率。我們的調查還表明初始策略模型和 RL 的訓練查詢非常重要。程式碼、模型和資料將會釋出，以造福未來的研究\\footnote{https://github.com/InternLM/OREAL}。</paragraph>", "author": "Chengqi Lyu et.al.", "authors": "Chengqi Lyu, Songyang Gao, Yuzhe Gu, Wenwei Zhang, Jianfei Gao, Kuikun Liu, Ziyi Wang, Shuaibin Li, Qian Zhao, Haian Huang, Weihan Cao, Jiangning Liu, Hongwei Liu, Junnan Liu, Songyang Zhang, Dahua Lin, Kai Chen", "id": "2502.06781v1", "paper_url": "http://arxiv.org/abs/2502.06781v1", "repo": "null"}}