{"2503.05652": {"publish_time": "2025-03-07", "title": "BEHAVIOR Robot Suite: Streamlining Real-World Whole-Body Manipulation for Everyday Household Activities", "paper_summary": "Real-world household tasks present significant challenges for mobile\nmanipulation robots. An analysis of existing robotics benchmarks reveals that\nsuccessful task performance hinges on three key whole-body control\ncapabilities: bimanual coordination, stable and precise navigation, and\nextensive end-effector reachability. Achieving these capabilities requires\ncareful hardware design, but the resulting system complexity further\ncomplicates visuomotor policy learning. To address these challenges, we\nintroduce the BEHAVIOR Robot Suite (BRS), a comprehensive framework for\nwhole-body manipulation in diverse household tasks. Built on a bimanual,\nwheeled robot with a 4-DoF torso, BRS integrates a cost-effective whole-body\nteleoperation interface for data collection and a novel algorithm for learning\nwhole-body visuomotor policies. We evaluate BRS on five challenging household\ntasks that not only emphasize the three core capabilities but also introduce\nadditional complexities, such as long-range navigation, interaction with\narticulated and deformable objects, and manipulation in confined spaces. We\nbelieve that BRS's integrated robotic embodiment, data collection interface,\nand learning framework mark a significant step toward enabling real-world\nwhole-body manipulation for everyday household tasks. BRS is open-sourced at\nhttps://behavior-robot-suite.github.io/", "paper_summary_zh": "真實世界的家庭任務對移動操控機器人來說是一項重大挑戰。對現有機器人基準的分析表明，成功完成任務取決於三個關鍵的全方位控制能力：雙手協調、穩定精確的導航和廣泛的末端執行器可達性。實現這些能力需要仔細的硬體設計，但由此產生的系統複雜性會使視覺運動策略學習進一步複雜化。為了應對這些挑戰，我們推出了 BEHAVIOR Robot Suite (BRS)，這是一個用於處理各種家庭任務的全方位操作綜合框架。BRS 建立在一個具有 4 自由度軀幹的雙手輪式機器人上，它整合了一個經濟高效的全方位遙控操作介面以用於數據收集，以及一種用於學習全方位視覺運動策略的新穎演算法。我們在五項具有挑戰性的家庭任務中評估了 BRS，這些任務不僅強調了三大核心能力，還引入了額外的複雜性，例如遠距離導航、與鉸接和可變形物體的交互，以及在有限空間內的操作。我們相信，BRS 整合的機器人實體、數據收集介面和學習框架標誌著朝著實現日常家庭任務的真實世界全方位操作邁出了重要一步。BRS 已在 https://behavior-robot-suite.github.io/ 開源。\n", "author": "Yunfan Jiang et.al.", "authors": "Yunfan Jiang, Ruohan Zhang, Josiah Wong, Chen Wang, Yanjie Ze, Hang Yin, Cem Gokmen, Shuran Song, Jiajun Wu, Li Fei-Fei", "id": "2503.05652v1", "paper_url": "http://arxiv.org/abs/2503.05652v1", "repo": "null"}}