{"2501.17338": {"publish_time": "2025-01-28", "title": "Inferring from Logits: Exploring Best Practices for Decoding-Free Generative Candidate Selection", "paper_summary": "Generative Language Models rely on autoregressive decoding to produce the\noutput sequence token by token. Many tasks such as preference optimization,\nrequire the model to produce task-level output consisting of multiple tokens\ndirectly by selecting candidates from a pool as predictions. Determining a\ntask-level prediction from candidates using the ordinary token-level decoding\nmechanism is constrained by time-consuming decoding and interrupted gradients\nby discrete token selection. Existing works have been using decoding-free\ncandidate selection methods to obtain candidate probability from initial output\nlogits over vocabulary. Though these estimation methods are widely used, they\nare not systematically evaluated, especially on end tasks. We introduce an\nevaluation of a comprehensive collection of decoding-free candidate selection\napproaches on a comprehensive set of tasks, including five multiple-choice QA\ntasks with a small candidate pool and four clinical decision tasks with a\nmassive amount of candidates, some with 10k+ options. We evaluate the\nestimation methods paired with a wide spectrum of foundation LMs covering\ndifferent architectures, sizes and training paradigms. The results and insights\nfrom our analysis inform the future model design.", "paper_summary_zh": "生成語言模型依靠自迴歸解碼來逐個符號產生輸出序列。許多任務（如偏好最佳化）要求模型直接從候選池中選擇預測，產生由多個符號組成的任務級別輸出。使用一般的符號級別解碼機制從候選者中確定任務級別預測受到耗時的解碼和離散符號選擇中斷的梯度的約束。現有工作一直使用無解碼候選者選擇方法從初始輸出邏輯值中獲得候選者機率。儘管這些估計方法被廣泛使用，但它們並未經過系統評估，特別是在最終任務上。我們針對全面的任務集，包括五個具有小型候選者池的多選題問答任務和四個具有大量候選者的臨床決策任務（其中一些有 10k+ 選項），對全面的無解碼候選者選擇方法進行評估。我們評估與廣泛基礎語言模型配對的估計方法，這些模型涵蓋不同的架構、大小和訓練範例。我們分析的結果和見解為未來的模型設計提供了資訊。", "author": "Mingyu Derek Ma et.al.", "authors": "Mingyu Derek Ma, Yanna Ding, Zijie Huang, Jianxi Gao, Yizhou Sun, Wei Wang", "id": "2501.17338v1", "paper_url": "http://arxiv.org/abs/2501.17338v1", "repo": "null"}}