{"2406.18944": {"publish_time": "2024-06-27", "title": "Investigating and Defending Shortcut Learning in Personalized Diffusion Models", "paper_summary": "Personalized diffusion models have gained popularity for adapting pre-trained\ntext-to-image models to generate images of specific topics with only a few\nimages. However, recent studies find that these models are vulnerable to minor\nadversarial perturbation, and the fine-tuning performance is largely degraded\non corrupted datasets. Such characteristics are further exploited to craft\nprotective perturbation on sensitive images like portraits that prevent\nunauthorized generation. In response, diffusion-based purification methods have\nbeen proposed to remove these perturbations and retain generation performance.\nHowever, existing works lack detailed analysis of the fundamental shortcut\nlearning vulnerability of personalized diffusion models and also turn to\nover-purifying the images cause information loss. In this paper, we take a\ncloser look at the fine-tuning process of personalized diffusion models through\nthe lens of shortcut learning and propose a hypothesis that could explain the\nunderlying manipulation mechanisms of existing perturbation methods.\nSpecifically, we find that the perturbed images are greatly shifted from their\noriginal paired prompt in the CLIP-based latent space. As a result, training\nwith this mismatched image-prompt pair creates a construction that causes the\nmodels to dump their out-of-distribution noisy patterns to the identifier, thus\ncausing serious performance degradation. Based on this observation, we propose\na systematic approach to retain the training performance with purification that\nrealigns the latent image and its semantic meaning and also introduces\ncontrastive learning with a negative token to decouple the learning of wanted\nclean identity and the unwanted noisy pattern, that shows strong potential\ncapacity against further adaptive perturbation.", "paper_summary_zh": "<paragraph>個人化擴散模型因能以少數影像將預先訓練好的文字轉影像模型調整為產生特定主題的影像而廣受歡迎。然而，最近的研究發現這些模型容易受到輕微的對抗性擾動，並且微調效能會在損壞的資料集上大幅下降。這些特性進一步被利用來在敏感的影像（例如人像）上製作防護性擾動，以防止未經授權的產生。為了解決這個問題，已經提出基於擴散的淨化方法來移除這些擾動並保留產生效能。然而，現有的方法缺乏對個人化擴散模型的根本捷徑學習脆弱性的詳細分析，而且也會過度淨化影像而導致資訊遺失。在本文中，我們透過捷徑學習的觀點仔細檢視個人化擴散模型的微調過程，並提出一個假說，可以解釋現有擾動方法的潛在操縱機制。具體來說，我們發現擾動的影像在基於 CLIP 的潛在空間中大幅偏離其原始配對提示。因此，使用這個不匹配的影像提示對訓練資料進行訓練會產生一個結構，導致模型將其分佈外的雜訊模式傾倒到識別符號中，從而導致嚴重的效能下降。基於這個觀察，我們提出一個系統化的方法，以淨化來保留訓練效能，重新調整潛在影像及其語義意義，並引入具有負面標記的對比學習，以解耦所需的乾淨身分和不需要的雜訊模式的學習，這顯示出對進一步自適應擾動的強大潛在能力。</paragraph>", "author": "Yixin Liu et.al.", "authors": "Yixin Liu, Ruoxi Chen, Lichao Sun", "id": "2406.18944v1", "paper_url": "http://arxiv.org/abs/2406.18944v1", "repo": "null"}}