{"2407.21338": {"publish_time": "2024-07-31", "title": "Image-Based Deep Reinforcement Learning with Intrinsically Motivated Stimuli: On the Execution of Complex Robotic Tasks", "paper_summary": "Reinforcement Learning (RL) has been widely used to solve tasks where the\nenvironment consistently provides a dense reward value. However, in real-world\nscenarios, rewards can often be poorly defined or sparse. Auxiliary signals are\nindispensable for discovering efficient exploration strategies and aiding the\nlearning process. In this work, inspired by intrinsic motivation theory, we\npostulate that the intrinsic stimuli of novelty and surprise can assist in\nimproving exploration in complex, sparsely rewarded environments. We introduce\na novel sample-efficient method able to learn directly from pixels, an\nimage-based extension of TD3 with an autoencoder called \\textit{NaSA-TD3}. The\nexperiments demonstrate that NaSA-TD3 is easy to train and an efficient method\nfor tackling complex continuous-control robotic tasks, both in simulated\nenvironments and real-world settings. NaSA-TD3 outperforms existing\nstate-of-the-art RL image-based methods in terms of final performance without\nrequiring pre-trained models or human demonstrations.", "paper_summary_zh": "強化學習 (RL) 已廣泛用於解決環境持續提供密集獎勵值的任務。然而，在真實世界的場景中，獎勵通常可能定義不佳或稀疏。輔助訊號對於發現有效的探索策略和協助學習過程是不可或缺的。在這項工作中，受到內在動機理論的啟發，我們假設新奇和驚奇的內在刺激有助於改善在複雜、獎勵稀疏的環境中探索。我們介紹一種新穎的樣本有效率方法，能夠直接從像素學習，一種 TD3 的基於影像的延伸，帶有稱為 \\textit{NaSA-TD3} 的自動編碼器。實驗證明，NaSA-TD3 易於訓練，且是一種有效的方法，用於解決複雜的連續控制機器人任務，無論是在模擬環境或真實世界設定中。NaSA-TD3 在最終效能方面優於現有的最先進 RL 基於影像的方法，而不需要預先訓練的模型或人類示範。", "author": "David Valencia et.al.", "authors": "David Valencia, Henry Williams, Yuning Xing, Trevor Gee, Minas Liarokapis, Bruce A. MacDonald", "id": "2407.21338v1", "paper_url": "http://arxiv.org/abs/2407.21338v1", "repo": "null"}}