{"2412.02509": {"publish_time": "2024-12-03", "title": "FCL-ViT: Task-Aware Attention Tuning for Continual Learning", "paper_summary": "Continual Learning (CL) involves adapting the prior Deep Neural Network (DNN)\nknowledge to new tasks, without forgetting the old ones. However, modern CL\ntechniques focus on provisioning memory capabilities to existing DNN models\nrather than designing new ones that are able to adapt according to the task at\nhand. This paper presents the novel Feedback Continual Learning Vision\nTransformer (FCL-ViT) that uses a feedback mechanism to generate real-time\ndynamic attention features tailored to the current task. The FCL-ViT operates\nin two Phases. In phase 1, the generic image features are produced and\ndetermine where the Transformer should attend on the current image. In phase 2,\ntask-specific image features are generated that leverage dynamic attention. To\nthis end, Tunable self-Attention Blocks (TABs) and Task Specific Blocks (TSBs)\nare introduced that operate in both phases and are responsible for tuning the\nTABs attention, respectively. The FCL-ViT surpasses state-of-the-art\nperformance on Continual Learning compared to benchmark methods, while\nretaining a small number of trainable DNN parameters.", "paper_summary_zh": "持續學習 (CL) 涉及將先前的深度神經網路 (DNN) 知識適應到新任務，而不會忘記舊任務。然而，現代 CL 技術著重於為現有的 DNN 模型提供記憶能力，而不是設計能夠根據手邊任務進行調整的新模型。本文提出了一種新穎的回饋持續學習視覺Transformer (FCL-ViT)，它使用回饋機制來產生針對當前任務量身定制的即時動態注意特徵。FCL-ViT 分為兩個階段運作。在階段 1 中，產生通用影像特徵，並確定Transformer應注意當前影像的哪個部分。在階段 2 中，產生利用動態注意力的特定任務影像特徵。為此，引入了在兩個階段中運作的可調整自注意力區塊 (TAB) 和特定任務區塊 (TSB)，它們分別負責調整 TAB 注意力。與基準方法相比，FCL-ViT 在持續學習方面超越了最先進的效能，同時保留了少量的可訓練 DNN 參數。", "author": "Anestis Kaimakamidis et.al.", "authors": "Anestis Kaimakamidis, Ioannis Pitas", "id": "2412.02509v1", "paper_url": "http://arxiv.org/abs/2412.02509v1", "repo": "null"}}