{"2410.21582": {"publish_time": "2024-10-28", "title": "ImageNet-RIB Benchmark: Large Pre-Training Datasets Don't Guarantee Robustness after Fine-Tuning", "paper_summary": "Highly performant large-scale pre-trained models promise to also provide a\nvaluable foundation for learning specialized tasks, by fine-tuning the model to\nthe desired task. By starting from a good general-purpose model, the goal is to\nachieve both specialization in the target task and maintain robustness. To\nassess the robustness of models to out-of-distribution samples after\nfine-tuning on downstream datasets, we introduce a new robust fine-tuning\nbenchmark, ImageNet-RIB (Robustness Inheritance Benchmark). The benchmark\nconsists of a set of related but distinct specialized (downstream) tasks;\npre-trained models are fine-tuned on one task in the set and their robustness\nis assessed on the rest, iterating across all tasks for fine-tuning and\nassessment. We find that the continual learning methods, EWC and LwF maintain\nrobustness after fine-tuning though fine-tuning generally does reduce\nperformance on generalization to related downstream tasks across models. Not\nsurprisingly, models pre-trained on large and rich datasets exhibit higher\ninitial robustness across datasets and suffer more pronounced degradation\nduring fine-tuning. The distance between the pre-training and downstream\ndatasets, measured by optimal transport, predicts this performance degradation\non the pre-training dataset. However, counterintuitively, model robustness\nafter fine-tuning on related downstream tasks is the worst when the\npre-training dataset is the richest and the most diverse. This suggests that\nstarting with the strongest foundation model is not necessarily the best\napproach for performance on specialist tasks. The benchmark thus offers key\ninsights for developing more resilient fine-tuning strategies and building\nrobust machine learning models. https://jd730.github.io/projects/ImageNet-RIB", "paper_summary_zh": "性能極佳的大規模預先訓練模型承諾，透過微調模型以符合所需任務，也能提供一個有價值的基礎，以便學習專業任務。從一個好的通用模型開始，目標是同時在目標任務中實現專業化，並維持穩健性。為了評估模型在微調下游資料集後對分佈外樣本的穩健性，我們引入了新的穩健微調基準 ImageNet-RIB（穩健繼承基準）。基準包含一組相關但不同的專業（下游）任務；預先訓練的模型針對該組中的其中一項任務進行微調，而其穩健性則在其他任務中進行評估，並針對微調和評估的所有任務進行反覆運算。我們發現，持續學習方法 EWC 和 LwF 在微調後仍能維持穩健性，儘管微調通常會降低模型在相關下游任務中的泛化效能。毫不意外地，在大型豐富資料集上預先訓練的模型在不同資料集之間表現出較高的初始穩健性，而在微調期間遭受更明顯的效能下降。透過最佳傳輸測量的預先訓練和下游資料集之間的距離，可以預測預先訓練資料集上的效能下降。然而，反直覺的是，當預先訓練資料集最豐富且最多樣化時，模型在相關下游任務上的微調後穩健性最差。這表示從最強大的基礎模型開始，不一定是執行專業任務的最佳方法。因此，基準為開發更具韌性的微調策略和建構穩健機器學習模型提供了關鍵見解。https://jd730.github.io/projects/ImageNet-RIB", "author": "Jaedong Hwang et.al.", "authors": "Jaedong Hwang, Brian Cheung, Zhang-Wei Hong, Akhilan Boopathy, Pulkit Agrawal, Ila Fiete", "id": "2410.21582v1", "paper_url": "http://arxiv.org/abs/2410.21582v1", "repo": "null"}}