{"2410.24019": {"publish_time": "2024-10-31", "title": "Speech is More Than Words: Do Speech-to-Text Translation Systems Leverage Prosody?", "paper_summary": "The prosody of a spoken utterance, including features like stress, intonation\nand rhythm, can significantly affect the underlying semantics, and as a\nconsequence can also affect its textual translation. Nevertheless, prosody is\nrarely studied within the context of speech-to-text translation (S2TT) systems.\nIn particular, end-to-end (E2E) systems have been proposed as well-suited for\nprosody-aware translation because they have direct access to the speech signal\nwhen making translation decisions, but the understanding of whether this is\nsuccessful in practice is still limited. A main challenge is the difficulty of\nevaluating prosody awareness in translation. To address this challenge, we\nintroduce an evaluation methodology and a focused benchmark (named ContraProST)\naimed at capturing a wide range of prosodic phenomena. Our methodology uses\nlarge language models and controllable text-to-speech (TTS) to generate\ncontrastive examples. Through experiments in translating English speech into\nGerman, Spanish, and Japanese, we find that (a) S2TT models possess some\ninternal representation of prosody, but the prosody signal is often not strong\nenough to affect the translations, (b) E2E systems outperform cascades of\nspeech recognition and text translation systems, confirming their theoretical\nadvantage in this regard, and (c) certain cascaded systems also capture\nprosodic information in the translation, but only to a lesser extent that\ndepends on the particulars of the transcript's surface form.", "paper_summary_zh": "語音發話的韻律，包括重音、語調\n和節奏等特徵，會顯著影響基礎語義，並因此也影響其文字翻譯。儘管如此，在語音轉文字 (S2TT) 系統的脈絡中很少研究韻律。\n特別是，端對端 (E2E) 系統已被提議用於感知韻律的翻譯，因為它們在做出翻譯決策時可以直接存取語音訊號，但實務上是否成功了解仍然有限。一個主要的挑戰在於評估翻譯中韻律感知的難度。為了應對這個挑戰，我們引進一個評估方法和一個重點基準 (名為 ContraProST)，旨在捕捉廣泛的韻律現象。我們的評估方法使用大型語言模型和可控的文字轉語音 (TTS) 來產生對比範例。透過將英語語音翻譯成德語、西班牙語和日語的實驗，我們發現 (a) S2TT 模型具有一些韻律的內部表徵，但韻律訊號通常不夠強大，無法影響翻譯，(b) E2E 系統優於語音辨識和文字翻譯系統的串聯，證實了它們在這個方面的理論優勢，以及 (c) 某些串聯系統也捕捉翻譯中的韻律資訊，但程度較低，取決於轉錄表面形式的細節。", "author": "Ioannis Tsiamas et.al.", "authors": "Ioannis Tsiamas, Matthias Sperber, Andrew Finch, Sarthak Garg", "id": "2410.24019v1", "paper_url": "http://arxiv.org/abs/2410.24019v1", "repo": "null"}}