{"2405.20179": {"publish_time": "2024-05-30", "title": "Robo-Instruct: Simulator-Augmented Instruction Alignment For Finetuning CodeLLMs", "paper_summary": "Large language models (LLMs) have shown great promise at generating robot\nprograms from natural language given domain-specific robot application\nprogramming interfaces (APIs). However, the performance gap between proprietary\nLLMs and smaller open-weight LLMs remains wide. This raises a question: Can we\nfine-tune smaller open-weight LLMs for generating domain-specific robot\nprograms to close the performance gap with proprietary LLMs? While\nSelf-Instruct is a promising solution by generating a diverse set of training\ndata, it cannot verify the correctness of these programs. In contrast, a robot\nsimulator with a well-defined world can identify execution errors but limits\nthe diversity of programs that it can verify. In this work, we introduce\nRobo-Instruct, which brings the best of both worlds -- it promotes the\ndiversity of Self-Instruct while providing the correctness of simulator-based\nchecking. Robo-Instruct introduces RoboSim to synthesize a consistent world\nstate on the fly by inferring properties relevant to the program being checked,\nand simulating actions accordingly. Furthermore, the instructions and programs\ngenerated by Self-Instruct may be subtly inconsistent -- such as the program\nmissing a step implied by the instruction. Robo-Instruct further addresses this\nwith InstAlign, an instruction-program alignment procedure that revises the\ntask instruction to reflect the actual results of the generated program. Given\na few seed task descriptions and the robot APIs, Robo-Instruct is capable of\ngenerating a training dataset using only a small open-weight model. This\ndataset can then be used to fine-tune small open-weight language models,\nenabling them to match or even exceed the performance of several proprietary\nLLMs, such as GPT-3.5-Turbo and Gemini-Pro.", "paper_summary_zh": "大型語言模型 (LLM) 在透過特定於領域的機器人應用程式介面 (API) 從自然語言產生機器人程式方面展現極大的潛力。然而，專有 LLM 與較小的開放權重 LLM 之間的效能差距仍然很大。這引發了一個問題：我們可以微調較小的開放權重 LLM 以產生特定於領域的機器人程式，以縮小與專有 LLM 的效能差距嗎？雖然 Self-Instruct 透過產生多樣化的訓練資料集來提供一個有前途的解決方案，但它無法驗證這些程式的正確性。相反地，具有明確定義世界的機器人模擬器可以識別執行錯誤，但會限制它可以驗證的程式多樣性。在這項工作中，我們引入了 Robo-Instruct，它結合了兩全其美的優點——它促进了 Self-Instruct 的多樣性，同時提供了基於模擬器的檢查的正確性。Robo-Instruct 介紹了 RoboSim，它透過推論與正在檢查的程式相關的屬性，並據此模擬動作，來即時合成一致的世界狀態。此外，Self-Instruct 產生的指令和程式可能微妙地不一致——例如程式遺漏了指令暗示的步驟。Robo-Instruct 進一步透過 InstAlign 來解決這個問題，InstAlign 是一種指令程式對齊程序，它會修改任務指令以反映產生程式的實際結果。給定幾個種子任務描述和機器人 API，Robo-Instruct 能夠僅使用一個小的開放權重模型來產生訓練資料集。然後可以使用這個資料集來微調小的開放權重語言模型，使它們能夠匹配甚至超過幾個專有 LLM 的效能，例如 GPT-3.5-Turbo 和 Gemini-Pro。", "author": "Zichao Hu et.al.", "authors": "Zichao Hu, Junyi Jessy Li, Arjun Guha, Joydeep Biswas", "id": "2405.20179v1", "paper_url": "http://arxiv.org/abs/2405.20179v1", "repo": "null"}}