{"2411.11161": {"publish_time": "2024-11-17", "title": "MPLite: Multi-Aspect Pretraining for Mining Clinical Health Records", "paper_summary": "The adoption of digital systems in healthcare has resulted in the\naccumulation of vast electronic health records (EHRs), offering valuable data\nfor machine learning methods to predict patient health outcomes. However,\nsingle-visit records of patients are often neglected in the training process\ndue to the lack of annotations of next-visit information, thereby limiting the\npredictive and expressive power of machine learning models. In this paper, we\npresent a novel framework MPLite that utilizes Multi-aspect Pretraining with\nLab results through a light-weight neural network to enhance medical concept\nrepresentation and predict future health outcomes of individuals. By\nincorporating both structured medical data and additional information from lab\nresults, our approach fully leverages patient admission records. We design a\npretraining module that predicts medical codes based on lab results, ensuring\nrobust prediction by fusing multiple aspects of features. Our experimental\nevaluation using both MIMIC-III and MIMIC-IV datasets demonstrates improvements\nover existing models in diagnosis prediction and heart failure prediction\ntasks, achieving a higher weighted-F1 and recall with MPLite. This work reveals\nthe potential of integrating diverse aspects of data to advance predictive\nmodeling in healthcare.", "paper_summary_zh": "數位系統在醫療保健中的採用導致了大量電子健康記錄 (EHR) 的累積，這些記錄提供了有價值的資料，可供機器學習方法用來預測患者的健康結果。然而，由於缺乏下次就診資訊的註解，患者的單次就診記錄在訓練過程中常常被忽略，因此限制了機器學習模型的預測和表達能力。在本文中，我們提出了一個創新的框架 MPLite，它利用透過輕量級神經網路進行多面向預訓練與實驗室結果，來增強醫療概念的表徵並預測個人的未來健康結果。透過結合結構化的醫療資料和來自實驗室結果的額外資訊，我們的做法充分利用了患者的入院記錄。我們設計了一個預訓練模組，根據實驗室結果預測醫療代碼，確保透過融合特徵的各個面向來進行穩健的預測。我們使用 MIMIC-III 和 MIMIC-IV 資料集進行的實驗評估證明，在診斷預測和心臟衰竭預測任務中，我們的模型優於現有的模型，使用 MPLite 達到了更高的加權 F1 和召回率。這項工作揭示了整合資料中不同面向的潛力，以推進醫療保健中的預測建模。", "author": "Eric Yang et.al.", "authors": "Eric Yang, Pengfei Hu, Xiaoxue Han, Yue Ning", "id": "2411.11161v1", "paper_url": "http://arxiv.org/abs/2411.11161v1", "repo": "null"}}