{"2406.15294": {"publish_time": "2024-06-21", "title": "NLP-KG: A System for Exploratory Search of Scientific Literature in Natural Language Processing", "paper_summary": "Scientific literature searches are often exploratory, whereby users are not\nyet familiar with a particular field or concept but are interested in learning\nmore about it. However, existing systems for scientific literature search are\ntypically tailored to keyword-based lookup searches, limiting the possibilities\nfor exploration. We propose NLP-KG, a feature-rich system designed to support\nthe exploration of research literature in unfamiliar natural language\nprocessing (NLP) fields. In addition to a semantic search, NLP-KG allows users\nto easily find survey papers that provide a quick introduction to a field of\ninterest. Further, a Fields of Study hierarchy graph enables users to\nfamiliarize themselves with a field and its related areas. Finally, a chat\ninterface allows users to ask questions about unfamiliar concepts or specific\narticles in NLP and obtain answers grounded in knowledge retrieved from\nscientific publications. Our system provides users with comprehensive\nexploration possibilities, supporting them in investigating the relationships\nbetween different fields, understanding unfamiliar concepts in NLP, and finding\nrelevant research literature. Demo, video, and code are available at:\nhttps://github.com/NLP-Knowledge-Graph/NLP-KG-WebApp.", "paper_summary_zh": "科學文獻搜尋通常帶有探索性質，使用者可能尚未熟悉特定領域或概念，但有興趣進一步了解。然而，現有的科學文獻搜尋系統通常針對基於關鍵字的查詢搜尋進行調整，限制了探索的可能性。我們提出 NLP-KG，這是一個功能豐富的系統，旨在支援在不熟悉的自然語言處理 (NLP) 領域探索研究文獻。除了語義搜尋外，NLP-KG 使用者可以輕鬆找到提供特定領域快速入門的調查論文。此外，研究領域階層圖表使用戶能夠熟悉一個領域及其相關領域。最後，聊天介面使用戶可以詢問有關 NLP 中不熟悉概念或特定文章的問題，並取得植基於從科學出版品中擷取的知識的答案。我們的系統為使用者提供全面的探索可能性，支援他們調查不同領域之間的關係，了解 NLP 中不熟悉概念，並找到相關的研究文獻。示範、影片和程式碼可於下列網址取得：https://github.com/NLP-Knowledge-Graph/NLP-KG-WebApp。", "author": "Tim Schopf et.al.", "authors": "Tim Schopf, Florian Matthes", "id": "2406.15294v1", "paper_url": "http://arxiv.org/abs/2406.15294v1", "repo": "https://github.com/nlp-knowledge-graph/nlp-kg-webapp"}}