{"2410.03168": {"publish_time": "2024-10-04", "title": "Can Watermarked LLMs be Identified by Users via Crafted Prompts?", "paper_summary": "Text watermarking for Large Language Models (LLMs) has made significant\nprogress in detecting LLM outputs and preventing misuse. Current watermarking\ntechniques offer high detectability, minimal impact on text quality, and\nrobustness to text editing. However, current researches lack investigation into\nthe imperceptibility of watermarking techniques in LLM services. This is\ncrucial as LLM providers may not want to disclose the presence of watermarks in\nreal-world scenarios, as it could reduce user willingness to use the service\nand make watermarks more vulnerable to attacks. This work is the first to\ninvestigate the imperceptibility of watermarked LLMs. We design an\nidentification algorithm called Water-Probe that detects watermarks through\nwell-designed prompts to the LLM. Our key motivation is that current\nwatermarked LLMs expose consistent biases under the same watermark key,\nresulting in similar differences across prompts under different watermark keys.\nExperiments show that almost all mainstream watermarking algorithms are easily\nidentified with our well-designed prompts, while Water-Probe demonstrates a\nminimal false positive rate for non-watermarked LLMs. Finally, we propose that\nthe key to enhancing the imperceptibility of watermarked LLMs is to increase\nthe randomness of watermark key selection. Based on this, we introduce the\nWater-Bag strategy, which significantly improves watermark imperceptibility by\nmerging multiple watermark keys.", "paper_summary_zh": "大型語言模型 (LLM) 的文字浮水印在偵測 LLM 輸出和防止濫用方面取得顯著進展。目前的浮水印技術提供高偵測率、對文字品質的影響極小，且對於文字編輯具有穩健性。然而，目前的研究缺乏對 LLM 服務中浮水印技術的難以察覺性的調查。這一點至關重要，因為 LLM 供應商可能不願意在現實場景中公開浮水印的存在，因為這可能會降低使用者使用該服務的意願，並使浮水印更容易受到攻擊。這項研究首次探討了浮水印 LLM 的難以察覺性。我們設計了一種稱為 Water-Probe 的識別演算法，透過精心設計的提示來偵測 LLM 中的浮水印。我們的關鍵動機是，目前的浮水印 LLM 在相同的浮水印金鑰下會表現出一致的偏差，導致在不同的浮水印金鑰下的提示產生類似的差異。實驗顯示，幾乎所有主流的浮水印演算法都可以透過我們精心設計的提示輕鬆識別，而 Water-Probe 對於非浮水印 LLM 則表現出極低的誤報率。最後，我們提出增強浮水印 LLM 難以察覺性的關鍵在於增加浮水印金鑰選擇的隨機性。基於此，我們引入了 Water-Bag 策略，透過合併多個浮水印金鑰，大幅提升浮水印的難以察覺性。", "author": "Aiwei Liu et.al.", "authors": "Aiwei Liu, Sheng Guan, Yiming Liu, Leyi Pan, Yifei Zhang, Liancheng Fang, Lijie Wen, Philip S. Yu, Xuming Hu", "id": "2410.03168v1", "paper_url": "http://arxiv.org/abs/2410.03168v1", "repo": "null"}}