{"2501.01284": {"publish_time": "2025-01-02", "title": "NeutraSum: A Language Model can help a Balanced Media Diet by Neutralizing News Summaries", "paper_summary": "Media bias in news articles arises from the political polarisation of media\noutlets, which can reinforce societal stereotypes and beliefs. Reporting on the\nsame event often varies significantly between outlets, reflecting their\npolitical leanings through polarised language and focus. Although previous\nstudies have attempted to generate bias-free summaries from multiperspective\nnews articles, they have not effectively addressed the challenge of mitigating\ninherent media bias. To address this gap, we propose \\textbf{NeutraSum}, a\nnovel framework that integrates two neutrality losses to adjust the semantic\nspace of generated summaries, thus minimising media bias. These losses,\ndesigned to balance the semantic distances across polarised inputs and ensure\nalignment with expert-written summaries, guide the generation of neutral and\nfactually rich summaries. To evaluate media bias, we employ the political\ncompass test, which maps political leanings based on economic and social\ndimensions. Experimental results on the Allsides dataset demonstrate that\nNeutraSum not only improves summarisation performance but also achieves\nsignificant reductions in media bias, offering a promising approach for neutral\nnews summarisation.", "paper_summary_zh": "媒體偏見在新聞文章中源自媒體機構的政治兩極分化，這可能會強化社會刻板印象和信念。對於同一事件的報導通常在各個媒體機構間有顯著差異，反映出他們透過兩極化的語言和焦點來表達政治傾向。儘管先前的研究已嘗試從多觀點新聞文章中產生無偏見的摘要，但它們並未有效解決減輕固有媒體偏見的挑戰。為了解決這個差距，我們提出了 \\textbf{NeutraSum}，一個整合了兩個中立性損失以調整生成摘要的語義空間的新框架，從而最大程度地減少媒體偏見。這些損失旨在平衡兩極化輸入之間的語義距離，並確保與專家撰寫的摘要保持一致，指導生成中立且內容豐富的摘要。為了評估媒體偏見，我們採用了政治羅盤測試，該測試根據經濟和社會層面來描繪政治傾向。在 Allsides 資料集上的實驗結果表明，NeutraSum 不僅提高了摘要性能，還顯著減少了媒體偏見，為中立新聞摘要提供了一種有前景的方法。", "author": "Xi Luo et.al.", "authors": "Xi Luo, Junjie Liu, Sirong Wu, Yuhui Deng", "id": "2501.01284v1", "paper_url": "http://arxiv.org/abs/2501.01284v1", "repo": "null"}}