{"2408.00147": {"publish_time": "2024-07-31", "title": "Formal Ethical Obligations in Reinforcement Learning Agents: Verification and Policy Updates", "paper_summary": "When designing agents for operation in uncertain environments, designers need\ntools to automatically reason about what agents ought to do, how that conflicts\nwith what is actually happening, and how a policy might be modified to remove\nthe conflict. These obligations include ethical and social obligations,\npermissions and prohibitions, which constrain how the agent achieves its\nmission and executes its policy. We propose a new deontic logic, Expected Act\nUtilitarian deontic logic, for enabling this reasoning at design time: for\nspecifying and verifying the agent's strategic obligations, then modifying its\npolicy from a reference policy to meet those obligations. Unlike approaches\nthat work at the reward level, working at the logical level increases the\ntransparency of the trade-offs. We introduce two algorithms: one for\nmodel-checking whether an RL agent has the right strategic obligations, and one\nfor modifying a reference decision policy to make it meet obligations expressed\nin our logic. We illustrate our algorithms on DAC-MDPs which accurately\nabstract neural decision policies, and on toy gridworld environments.", "paper_summary_zh": "在為不確定環境中的運作設計代理時，設計師需要\n工具來自動推論代理應做什麼，這與實際發生的事如何衝突，以及如何修改策略以消除\n衝突。這些義務包括道德和社會義務、\n許可和禁止，它們限制了代理如何實現其\n任務並執行其政策。我們提出了一種新的義務邏輯，預期行為\n功利主義義務邏輯，用於在設計時啟用這種推理：用於\n指定和驗證代理的策略義務，然後修改其\n政策從參考政策來履行這些義務。與在獎勵層級運作的方法不同，在邏輯層級運作會增加\n權衡的透明度。我們引入了兩種演算法：一種用於\n模型檢查 RL 代理是否具有正確的策略義務，另一種用於\n修改參考決策政策以使其符合我們的邏輯中表達的義務。我們在準確\n抽象神經決策政策的 DAC-MDP 和玩具格狀世界環境中說明我們的演算法。", "author": "Colin Shea-Blymyer et.al.", "authors": "Colin Shea-Blymyer, Houssam Abbas", "id": "2408.00147v1", "paper_url": "http://arxiv.org/abs/2408.00147v1", "repo": "null"}}