{"2412.09990": {"publish_time": "2024-12-13", "title": "Small Language Model as Data Prospector for Large Language Model", "paper_summary": "The quality of instruction data directly affects the performance of\nfine-tuned Large Language Models (LLMs). Previously, \\cite{li2023one} proposed\n\\texttt{NUGGETS}, which identifies and selects high-quality quality data from a\nlarge dataset by identifying those individual instruction examples that can\nsignificantly improve the performance of different tasks after being learnt as\none-shot instances. In this work, we propose \\texttt{SuperNUGGETS}, an improved\nvariant of \\texttt{NUGGETS} optimised for efficiency and performance. Our\n\\texttt{SuperNUGGETS} uses a small language model (SLM) instead of a large\nlanguage model (LLM) to filter the data for outstanding one-shot instances and\nrefines the predefined set of tests. The experimental results show that the\nperformance of \\texttt{SuperNUGGETS} only decreases by 1-2% compared to\n\\texttt{NUGGETS}, but the efficiency can be increased by a factor of 58.\nCompared to the original \\texttt{NUGGETS}, our \\texttt{SuperNUGGETS} has a\nhigher utility value due to the significantly lower resource consumption.", "paper_summary_zh": "教學資料的品質直接影響微調後的巨量語言模型 (LLM) 的效能。先前，\\cite{li2023one} 提出 \\texttt{NUGGETS}，它會從大型資料集中識別並選取高品質資料，方法是找出那些個別教學範例，在學習為一次性實例後，能大幅提升不同任務的效能。在這項工作中，我們提出 \\texttt{SuperNUGGETS}，這是 \\texttt{NUGGETS} 的改良版本，針對效率和效能進行了最佳化。我們的 \\texttt{SuperNUGGETS} 使用小型語言模型 (SLM)，而非大型語言模型 (LLM)，來過濾資料以找出傑出的單次實例，並改善預先定義的測試集。實驗結果顯示，與 \\texttt{NUGGETS} 相比，\\texttt{SuperNUGGETS} 的效能僅下降 1-2%，但效率卻能提升 58 倍。與原始 \\texttt{NUGGETS} 相比，我們的 \\texttt{SuperNUGGETS} 具有更高的實用價值，因為資源消耗顯著降低。", "author": "Shiwen Ni et.al.", "authors": "Shiwen Ni, Haihong Wu, Di Yang, Qiang Qu, Hamid Alinejad-Rokny, Min Yang", "id": "2412.09990v1", "paper_url": "http://arxiv.org/abs/2412.09990v1", "repo": "null"}}