{"2411.02817": {"publish_time": "2024-11-05", "title": "Conditional Vendi Score: An Information-Theoretic Approach to Diversity Evaluation of Prompt-based Generative Models", "paper_summary": "Text-conditioned generation models are commonly evaluated based on the\nquality of the generated data and its alignment with the input text prompt. On\nthe other hand, several applications of prompt-based generative models require\nsufficient diversity in the generated data to ensure the models' capability of\ngenerating image and video samples possessing a variety of features. However,\nmost existing diversity metrics are designed for unconditional generative\nmodels, and thus cannot distinguish the diversity arising from variations in\ntext prompts and that contributed by the generative model itself. In this work,\nour goal is to quantify the prompt-induced and model-induced diversity in\nsamples generated by prompt-based models. We propose an information-theoretic\napproach for internal diversity quantification, where we decompose the\nkernel-based entropy $H(X)$ of the generated data $X$ into the sum of the\nconditional entropy $H(X|T)$, given text variable $T$, and the mutual\ninformation $I(X; T)$ between the text and data variables. We introduce the\n\\emph{Conditional-Vendi} score based on $H(X|T)$ to quantify the internal\ndiversity of the model and the \\emph{Information-Vendi} score based on $I(X;\nT)$ to measure the statistical relevance between the generated data and text\nprompts. We provide theoretical results to statistically interpret these scores\nand relate them to the unconditional Vendi score. We conduct several numerical\nexperiments to show the correlation between the Conditional-Vendi score and the\ninternal diversity of text-conditioned generative models. The codebase is\navailable at\n\\href{https://github.com/mjalali/conditional-vendi}{https://github.com/mjalali/conditional-vendi}.", "paper_summary_zh": "文本条件生成模型通常根据生成数据的质量及其与输入文本提示的一致性进行评估。另一方面，基于提示的生成模型的几种应用需要生成数据具有足够的多样性，以确保模型能够生成具有各种特征的图像和视频样本。然而，大多数现有的多样性度量都是为无条件生成模型设计的，因此无法区分由文本提示的变化引起的多样性和由生成模型本身产生的多样性。在这项工作中，我们的目标是量化基于提示的模型生成的样本中提示引起的和模型引起的多样性。我们提出了一种用于内部多样性量化的信息论方法，其中我们将生成数据 X 的基于核的熵 H(X) 分解为给定文本变量 T 的条件熵 H(X|T) 的总和和文本和数据变量之间的互信息 I(X; T)。我们引入了基于 H(X|T) 的\\emph{条件 Vendi} 分数来量化模型的内部多样性，并引入了基于 I(X; T) 的\\emph{信息 Vendi} 分数来衡量生成数据和文本提示之间的统计相关性。我们提供了理论结果来统计解释这些分数，并将它们与无条件 Vendi 分数联系起来。我们进行了多项数值实验来显示条件 Vendi 分数与文本条件生成模型的内部多样性之间的相关性。代码库可在\n\\href{https://github.com/mjalali/conditional-vendi}{https://github.com/mjalali/conditional-vendi} 获得。", "author": "Mohammad Jalali et.al.", "authors": "Mohammad Jalali, Azim Ospanov, Amin Gohari, Farzan Farnia", "id": "2411.02817v1", "paper_url": "http://arxiv.org/abs/2411.02817v1", "repo": "https://github.com/mjalali/conditional-vendi"}}