{"2411.16084": {"publish_time": "2024-11-25", "title": "Deciphering genomic codes using advanced NLP techniques: a scoping review", "paper_summary": "Objectives: The vast and complex nature of human genomic sequencing data\npresents challenges for effective analysis. This review aims to investigate the\napplication of Natural Language Processing (NLP) techniques, particularly Large\nLanguage Models (LLMs) and transformer architectures, in deciphering genomic\ncodes, focusing on tokenization, transformer models, and regulatory annotation\nprediction. The goal of this review is to assess data and model accessibility\nin the most recent literature, gaining a better understanding of the existing\ncapabilities and constraints of these tools in processing genomic sequencing\ndata.\n  Methods: Following Preferred Reporting Items for Systematic Reviews and\nMeta-Analyses (PRISMA) guidelines, our scoping review was conducted across\nPubMed, Medline, Scopus, Web of Science, Embase, and ACM Digital Library.\nStudies were included if they focused on NLP methodologies applied to genomic\nsequencing data analysis, without restrictions on publication date or article\ntype.\n  Results: A total of 26 studies published between 2021 and April 2024 were\nselected for review. The review highlights that tokenization and transformer\nmodels enhance the processing and understanding of genomic data, with\napplications in predicting regulatory annotations like transcription-factor\nbinding sites and chromatin accessibility.\n  Discussion: The application of NLP and LLMs to genomic sequencing data\ninterpretation is a promising field that can help streamline the processing of\nlarge-scale genomic data while also providing a better understanding of its\ncomplex structures. It has the potential to drive advancements in personalized\nmedicine by offering more efficient and scalable solutions for genomic\nanalysis. Further research is also needed to discuss and overcome current\nlimitations, enhancing model transparency and applicability.", "paper_summary_zh": "<paragraph>目標：人類基因組定序資料的廣泛且複雜的性質為有效分析帶來挑戰。本篇評論旨在探討自然語言處理 (NLP) 技術的應用，特別是大語言模型 (LLM) 和Transformer架構，在破譯基因組密碼中的應用，重點關注分詞、Transformer模型和調控註釋預測。本篇評論的目標是評估最新文獻中的資料和模型可及性，以更深入了解這些工具在處理基因組定序資料方面的現有能力和限制。\n方法：遵循系統性回顧和後設分析的首選報告項目 (PRISMA) 指南，我們的範圍回顧在 PubMed、Medline、Scopus、Web of Science、Embase 和 ACM 數位圖書館中進行。如果研究重點是應用於基因組定序資料分析的 NLP 方法，則納入研究，而不限制發表日期或文章類型。\n結果：共選出 2021 年至 2024 年 4 月間發表的 26 篇研究進行回顧。回顧強調，分詞和Transformer模型增強了基因組資料的處理和理解，並應用於預測轉錄因子結合位點和染色質可及性等調控註釋。\n討論：將 NLP 和 LLM 應用於基因組定序資料解讀是一個有前景的領域，有助於簡化大規模基因組資料的處理，同時也更深入了解其複雜結構。它有潛力透過提供更有效率且可擴充的基因組分析解決方案，推動個人化醫療的進步。進一步的研究也需要討論並克服目前的限制，以增強模型的透明度和適用性。</paragraph>", "author": "Shuyan Cheng et.al.", "authors": "Shuyan Cheng, Yishu Wei, Yiliang Zhou, Zihan Xu, Drew N Wright, Jinze Liu, Yifan Peng", "id": "2411.16084v1", "paper_url": "http://arxiv.org/abs/2411.16084v1", "repo": "null"}}