{"2501.04682": {"publish_time": "2025-01-08", "title": "Towards System 2 Reasoning in LLMs: Learning How to Think With Meta Chain-of-Though", "paper_summary": "We propose a novel framework, Meta Chain-of-Thought (Meta-CoT), which extends\ntraditional Chain-of-Thought (CoT) by explicitly modeling the underlying\nreasoning required to arrive at a particular CoT. We present empirical evidence\nfrom state-of-the-art models exhibiting behaviors consistent with in-context\nsearch, and explore methods for producing Meta-CoT via process supervision,\nsynthetic data generation, and search algorithms. Finally, we outline a\nconcrete pipeline for training a model to produce Meta-CoTs, incorporating\ninstruction tuning with linearized search traces and reinforcement learning\npost-training. Finally, we discuss open research questions, including scaling\nlaws, verifier roles, and the potential for discovering novel reasoning\nalgorithms. This work provides a theoretical and practical roadmap to enable\nMeta-CoT in LLMs, paving the way for more powerful and human-like reasoning in\nartificial intelligence.", "paper_summary_zh": "我們提出了一個新穎的框架，元思考鏈 (Meta-CoT)，它通過明確建模得出特定 CoT 所需的基本推理來擴展傳統的思考鏈 (CoT)。我們展示了來自最先進模型的經驗證據，這些模型表現出與情境中搜尋一致的行為，並探索了通過流程監督、合成資料生成和搜尋演算法來產生 Meta-CoT 的方法。最後，我們概述了一個具體的管道，用於訓練模型以產生 Meta-CoT，其中包含線性化搜尋軌跡和強化學習後訓練的指令調整。最後，我們討論了開放的研究問題，包括規模定律、驗證者角色，以及發現新推理演算法的潛力。這項工作提供了一個理論和實務路線圖，以在 LLM 中啟用 Meta-CoT，為人工智慧中更強大且更類似人類的推理鋪平道路。", "author": "Violet Xiang et.al.", "authors": "Violet Xiang, Charlie Snell, Kanishk Gandhi, Alon Albalak, Anikait Singh, Chase Blagden, Duy Phung, Rafael Rafailov, Nathan Lile, Dakota Mahan, Louis Castricato, Jan-Philipp Franken, Nick Haber, Chelsea Finn", "id": "2501.04682v1", "paper_url": "http://arxiv.org/abs/2501.04682v1", "repo": "null"}}