{"2410.12622": {"publish_time": "2024-10-16", "title": "From Measurement Instruments to Data: Leveraging Theory-Driven Synthetic Training Data for Classifying Social Constructs", "paper_summary": "Computational text classification is a challenging task, especially for\nmulti-dimensional social constructs. Recently, there has been increasing\ndiscussion that synthetic training data could enhance classification by\noffering examples of how these constructs are represented in texts. In this\npaper, we systematically examine the potential of theory-driven synthetic\ntraining data for improving the measurement of social constructs. In\nparticular, we explore how researchers can transfer established knowledge from\nmeasurement instruments in the social sciences, such as survey scales or\nannotation codebooks, into theory-driven generation of synthetic data. Using\ntwo studies on measuring sexism and political topics, we assess the added value\nof synthetic training data for fine-tuning text classification models. Although\nthe results of the sexism study were less promising, our findings demonstrate\nthat synthetic data can be highly effective in reducing the need for labeled\ndata in political topic classification. With only a minimal drop in\nperformance, synthetic data allows for substituting large amounts of labeled\ndata. Furthermore, theory-driven synthetic data performed markedly better than\ndata generated without conceptual information in mind.", "paper_summary_zh": "計算文本分類是一項具有挑戰性的任務，特別是對於多維度的社會結構。最近，越來越多的討論認為，合成訓練數據可以通過提供這些結構在文本中表示方式的示例來增強分類。在本文中，我們系統地探討了理論驅動合成訓練數據在改進社會結構測量方面的潛力。具體來說，我們探討了研究人員如何將社會科學中測量工具（例如調查量表或註釋手冊）中已確立的知識轉移到合成數據的理論驅動生成中。通過兩項關於衡量性別歧視和政治話題的研究，我們評估了合成訓練數據在微調文本分類模型方面的附加價值。儘管性別歧視研究的結果不太令人滿意，但我們的研究結果表明，合成數據在減少政治話題分類中對標籤數據的需求方面可以非常有效。合成數據僅會導致性能略有下降，就可以替代大量的標籤數據。此外，理論驅動的合成數據的表現明顯優於在構建時沒有考慮概念信息的數據。", "author": "Lukas Birkenmaier et.al.", "authors": "Lukas Birkenmaier, Matthias Roth, Indira Sen", "id": "2410.12622v2", "paper_url": "http://arxiv.org/abs/2410.12622v2", "repo": "null"}}