{"2406.02950": {"publish_time": "2024-06-05", "title": "4D ASR: Joint Beam Search Integrating CTC, Attention, Transducer, and Mask Predict Decoders", "paper_summary": "End-to-end automatic speech recognition (E2E-ASR) can be classified into\nseveral network architectures, such as connectionist temporal classification\n(CTC), recurrent neural network transducer (RNN-T), attention-based\nencoder-decoder, and mask-predict models. Each network architecture has\nadvantages and disadvantages, leading practitioners to switch between these\ndifferent models depending on application requirements. Instead of building\nseparate models, we propose a joint modeling scheme where four decoders (CTC,\nRNN-T, attention, and mask-predict) share the same encoder -- we refer to this\nas 4D modeling. The 4D model is trained using multitask learning, which will\nbring model regularization and maximize the model robustness thanks to their\ncomplementary properties. To efficiently train the 4D model, we introduce a\ntwo-stage training strategy that stabilizes multitask learning. In addition, we\npropose three novel one-pass beam search algorithms by combining three decoders\n(CTC, RNN-T, and attention) to further improve performance. These three beam\nsearch algorithms differ in which decoder is used as the primary decoder. We\ncarefully evaluate the performance and computational tradeoffs associated with\neach algorithm. Experimental results demonstrate that the jointly trained 4D\nmodel outperforms the E2E-ASR models trained with only one individual decoder.\nFurthermore, we demonstrate that the proposed one-pass beam search algorithm\noutperforms the previously proposed CTC/attention decoding.", "paper_summary_zh": "端到端自動語音辨識 (E2E-ASR) 可分類為數種網路架構，例如連接時間分類 (CTC)、遞迴神經網路轉換器 (RNN-T)、基於注意力的編碼器-解碼器和遮罩預測模型。每種網路架構都有優缺點，導致實務工作者根據應用程式需求在這些不同模型之間切換。我們提出一個聯合建模方案，其中四個解碼器 (CTC、RNN-T、注意力和遮罩預測) 共用同一個編碼器，而不是建構獨立的模型，我們稱之為 4D 建模。4D 模型使用多任務學習進行訓練，這將帶來模型正則化，並由於其互補特性而最大化模型的穩健性。為了有效訓練 4D 模型，我們引入了一個兩階段訓練策略，以穩定多任務學習。此外，我們透過結合三個解碼器 (CTC、RNN-T 和注意力) 來提出三種新穎的單次光束搜尋演算法，以進一步提升效能。這三種光束搜尋演算法的不同之處在於哪個解碼器被用作主要解碼器。我們仔細評估與每種演算法相關的效能和運算折衷。實驗結果證明，聯合訓練的 4D 模型優於僅使用一個個別解碼器訓練的 E2E-ASR 模型。此外，我們證明所提出的單次光束搜尋演算法優於先前提出的 CTC/注意力解碼。", "author": "Yui Sudo et.al.", "authors": "Yui Sudo, Muhammad Shakeel, Yosuke Fukumoto, Brian Yan, Jiatong Shi, Yifan Peng, Shinji Watanabe", "id": "2406.02950v1", "paper_url": "http://arxiv.org/abs/2406.02950v1", "repo": "null"}}