{"2504.20426": {"publish_time": "2025-04-29", "title": "RV-Syn: Rational and Verifiable Mathematical Reasoning Data Synthesis based on Structured Function Library", "paper_summary": "The advancement of reasoning capabilities in Large Language Models (LLMs)\nrequires substantial amounts of high-quality reasoning data, particularly in\nmathematics. Existing data synthesis methods, such as data augmentation from\nannotated training sets or direct question generation based on relevant\nknowledge points and documents, have expanded datasets but face challenges in\nmastering the inner logic of the problem during generation and ensuring the\nverifiability of the solutions. To address these issues, we propose RV-Syn, a\nnovel Rational and Verifiable mathematical Synthesis approach. RV-Syn\nconstructs a structured mathematical operation function library based on\ninitial seed problems and generates computational graphs as solutions by\ncombining Python-formatted functions from this library. These graphs are then\nback-translated into complex problems. Based on the constructed computation\ngraph, we achieve solution-guided logic-aware problem generation. Furthermore,\nthe executability of the computational graph ensures the verifiability of the\nsolving process. Experimental results show that RV-Syn surpasses existing\nsynthesis methods, including those involving human-generated problems,\nachieving greater efficient data scaling. This approach provides a scalable\nframework for generating high-quality reasoning datasets.", "paper_summary_zh": "大型語言模型 (LLM) 推理能力的提升需要大量的優質推理數據，尤其是在數學方面。現有的數據合成方法，例如從標註訓練集進行數據增強或基於相關知識點和文檔直接生成問題，雖然擴展了數據集，但在掌握生成過程中問題的內在邏輯和確保解決方案的可驗證性方面仍面臨挑戰。為了應對這些問題，我們提出了 RV-Syn，一種新穎的理性且可驗證的數學合成方法。RV-Syn基於初始種子問題構建了一個結構化的數學運算函數庫，並通過組合來自該函數庫的 Python 格式函數來生成計算圖作為解決方案。然後，這些圖被反向翻譯成複雜問題。基於構建的計算圖，我們實現了以解決方案為導向的邏輯感知問題生成。此外，計算圖的可執行性確保了解決過程的可驗證性。實驗結果表明，RV-Syn 超越了現有的合成方法，包括那些涉及人工生成問題的方法，實現了更高效的數據擴展。這種方法提供了一個可擴展的框架，用於生成高質量的推理數據集。\n", "author": "Jiapeng Wang et.al.", "authors": "Jiapeng Wang, Jinhao Jiang, Zhiqiang Zhang, Jun Zhou, Wayne Xin Zhao", "id": "2504.20426v1", "paper_url": "http://arxiv.org/abs/2504.20426v1", "repo": "null"}}