{"2408.09946": {"publish_time": "2024-08-19", "title": "Microscopic Analysis on LLM players via Social Deduction Game", "paper_summary": "Recent studies have begun developing autonomous game players for social\ndeduction games using large language models (LLMs). When building LLM players,\nfine-grained evaluations are crucial for addressing weaknesses in game-playing\nabilities. However, existing studies have often overlooked such assessments.\nSpecifically, we point out two issues with the evaluation methods employed.\nFirst, game-playing abilities have typically been assessed through game-level\noutcomes rather than specific event-level skills; Second, error analyses have\nlacked structured methodologies. To address these issues, we propose an\napproach utilizing a variant of the SpyFall game, named SpyGame. We conducted\nan experiment with four LLMs, analyzing their gameplay behavior in SpyGame both\nquantitatively and qualitatively. For the quantitative analysis, we introduced\neight metrics to resolve the first issue, revealing that these metrics are more\neffective than existing ones for evaluating the two critical skills: intent\nidentification and camouflage. In the qualitative analysis, we performed\nthematic analysis to resolve the second issue. This analysis identifies four\nmajor categories that affect gameplay of LLMs. Additionally, we demonstrate how\nthese categories complement and support the findings from the quantitative\nanalysis.", "paper_summary_zh": "最近的研究已經開始使用大型語言模型 (LLM) 為社交推理遊戲開發自動遊戲玩家。在建構 LLM 玩家時，細緻的評估對於解決遊戲玩法能力中的弱點至關重要。然而，現有的研究常常忽略了這種評估。具體來說，我們指出了評估方法中存在的兩個問題。首先，遊戲玩法能力通常透過遊戲層級的結果來評估，而不是具體的事件層級技能；其次，錯誤分析缺乏結構化的方法。為了解決這些問題，我們提出了一種利用 SpyFall 遊戲變體，名為 SpyGame 的方法。我們對四個 LLM 進行了一項實驗，定量和定性地分析了它們在 SpyGame 中的遊戲行為。對於定量分析，我們引入了八個指標來解決第一個問題，表明這些指標比現有的指標更有效地評估了兩個關鍵技能：意圖識別和偽裝。在定性分析中，我們進行了主題分析來解決第二個問題。此分析識別出影響 LLM 遊戲玩法的四個主要類別。此外，我們展示了這些類別如何補充和支持定量分析的結果。", "author": "Byungjun Kim et.al.", "authors": "Byungjun Kim, Dayeon Seo, Bugeun Kim", "id": "2408.09946v1", "paper_url": "http://arxiv.org/abs/2408.09946v1", "repo": "null"}}