{"2408.05667": {"publish_time": "2024-08-11", "title": "Utilizing Large Language Models to Optimize the Detection and Explainability of Phishing Websites", "paper_summary": "In this paper, we introduce PhishLang, an open-source, lightweight Large\nLanguage Model (LLM) specifically designed for phishing website detection\nthrough contextual analysis of the website. Unlike traditional heuristic or\nmachine learning models that rely on static features and struggle to adapt to\nnew threats and deep learning models that are computationally intensive, our\nmodel utilizes the advanced language processing capabilities of LLMs to learn\ngranular features that are characteristic of phishing attacks. Furthermore,\nPhishLang operates with minimal data preprocessing and offers performance\ncomparable to leading deep learning tools, while being significantly faster and\nless resource-intensive. Over a 3.5-month testing period, PhishLang\nsuccessfully identified approximately 26K phishing URLs, many of which were\nundetected by popular antiphishing blocklists, thus demonstrating its potential\nto aid current detection measures. We also evaluate PhishLang against several\nrealistic adversarial attacks and develop six patches that make it very robust\nagainst such threats. Furthermore, we integrate PhishLang with GPT-3.5 Turbo to\ncreate \\textit{explainable blocklisting} - warnings that provide users with\ncontextual information about different features that led to a website being\nmarked as phishing. Finally, we have open-sourced the PhishLang framework and\ndeveloped a Chromium-based browser extension and URL scanner website, which\nimplement explainable warnings for end-users.", "paper_summary_zh": "在本文中，我們介紹了 PhishLang，這是一個開源、輕量級的大型語言模型 (LLM)，專門設計用於通過網站的上下文分析來檢測網路釣魚網站。與依賴於靜態特徵且難以適應新威脅的傳統啟發式或機器學習模型，以及計算密集型深度學習模型不同，我們的模型利用了 LLM 的先進語言處理能力來學習網路釣魚攻擊特有的細微特徵。此外，PhishLang 以最少的資料預處理運作，並提供與領先的深度學習工具相當的效能，同時速度顯著加快且資源消耗更少。在 3.5 個月的測試期中，PhishLang 成功識別出大約 26K 個網路釣魚網址，其中許多網址未被熱門的反網路釣魚封鎖清單所偵測到，由此證明了其有助於現有偵測措施的潛力。我們還針對 PhishLang 評估了多種實際的對抗性攻擊，並開發了六個修補程式，使其對此類威脅非常強大。此外，我們將 PhishLang 與 GPT-3.5 Turbo 整合，以建立「可解釋的封鎖清單」——警告，向使用者提供有關導致網站被標記為網路釣魚的不同特徵的上下文資訊。最後，我們開源了 PhishLang 框架，並開發了一個基於 Chromium 的瀏覽器擴充功能和網址掃描器網站，為最終使用者實作可解釋的警告。", "author": "Sayak Saha Roy et.al.", "authors": "Sayak Saha Roy, Shirin Nilizadeh", "id": "2408.05667v1", "paper_url": "http://arxiv.org/abs/2408.05667v1", "repo": "null"}}