{"2412.09380": {"publish_time": "2024-12-12", "title": "Diffusion Model with Representation Alignment for Protein Inverse Folding", "paper_summary": "Protein inverse folding is a fundamental problem in bioinformatics, aiming to\nrecover the amino acid sequences from a given protein backbone structure.\nDespite the success of existing methods, they struggle to fully capture the\nintricate inter-residue relationships critical for accurate sequence\nprediction. We propose a novel method that leverages diffusion models with\nrepresentation alignment (DMRA), which enhances diffusion-based inverse folding\nby (1) proposing a shared center that aggregates contextual information from\nthe entire protein structure and selectively distributes it to each residue;\nand (2) aligning noisy hidden representations with clean semantic\nrepresentations during the denoising process. This is achieved by predefined\nsemantic representations for amino acid types and a representation alignment\nmethod that utilizes type embeddings as semantic feedback to normalize each\nresidue. In experiments, we conduct extensive evaluations on the CATH4.2\ndataset to demonstrate that DMRA outperforms leading methods, achieving\nstate-of-the-art performance and exhibiting strong generalization capabilities\non the TS50 and TS500 datasets.", "paper_summary_zh": "蛋白質逆向摺疊是生物資訊學中的基本問題，旨在從給定的蛋白質骨架結構中恢復胺基酸序列。儘管現有方法已經成功，但它們仍難以完全捕捉到對準確序列預測至關重要的複雜殘基間關係。我們提出了一種新方法，該方法利用具有表示對齊（DMRA）的擴散模型，通過（1）提出一個共享中心，從整個蛋白質結構中彙總上下文資訊並將其選擇性地分發到每個殘基；以及（2）在去噪過程中將雜訊隱藏表示與乾淨語義表示對齊來增強基於擴散的逆向摺疊。這是通過針對胺基酸類型預先定義的語義表示和一種將類型嵌入作為語義回饋以標準化每個殘基的表示對齊方法來實現的。在實驗中，我們對 CATH4.2 資料集進行了廣泛的評估，以證明 DMRA 優於領先的方法，在 TS50 和 TS500 資料集上實現了最先進的效能並展現出強大的泛化能力。", "author": "Chenglin Wang et.al.", "authors": "Chenglin Wang, Yucheng Zhou, Zijie Zhai, Jianbing Shen, Kai Zhang", "id": "2412.09380v1", "paper_url": "http://arxiv.org/abs/2412.09380v1", "repo": "null"}}