{"2408.08400": {"publish_time": "2024-08-15", "title": "Zero-Shot Learning and Key Points Are All You Need for Automated Fact-Checking", "paper_summary": "Automated fact-checking is an important task because determining the accurate\nstatus of a proposed claim within the vast amount of information available\nonline is a critical challenge. This challenge requires robust evaluation to\nprevent the spread of false information. Modern large language models (LLMs)\nhave demonstrated high capability in performing a diverse range of Natural\nLanguage Processing (NLP) tasks. By utilizing proper prompting strategies,\ntheir versatility due to their understanding of large context sizes and\nzero-shot learning ability enables them to simulate human problem-solving\nintuition and move towards being an alternative to humans for solving problems.\nIn this work, we introduce a straightforward framework based on Zero-Shot\nLearning and Key Points (ZSL-KeP) for automated fact-checking, which despite\nits simplicity, performed well on the AVeriTeC shared task dataset by robustly\nimproving the baseline and achieving 10th place.", "paper_summary_zh": "自動化事實查核是一項重要的任務，因為在網路上大量可得的資訊中判斷一個主張的準確狀態是一項重大的挑戰。這個挑戰需要強健的評估以防止錯誤資訊的散播。現代的大型語言模型 (LLM) 已展現出執行各種自然語言處理 (NLP) 任務的高能力。透過使用適當的提示策略，它們由於理解大型脈絡大小和零次學習能力的多功能性，使它們能模擬人類解決問題的直覺，並朝著成為人類解決問題的替代方案邁進。在這項工作中，我們介紹了一個基於零次學習和重點 (ZSL-KeP) 的直接架構，用於自動化事實查核，儘管它很簡單，但在 AVeriTeC 共享任務資料集上表現良好，透過強健地改善基準並獲得第 10 名。", "author": "Mohammad Ghiasvand Mohammadkhani et.al.", "authors": "Mohammad Ghiasvand Mohammadkhani, Ali Ghiasvand Mohammadkhani, Hamid Beigy", "id": "2408.08400v1", "paper_url": "http://arxiv.org/abs/2408.08400v1", "repo": "null"}}