{"2405.16538": {"publish_time": "2024-05-26", "title": "Gamified AI Approch for Early Detection of Dementia", "paper_summary": "This paper aims to develop a new deep learning-inspired gaming approach for\nearly detection of dementia. This research integrates a robust convolutional\nneural network (CNN)-based model for early dementia detection using health\nmetrics data as well as facial image data through a cognitive assessment-based\ngaming application. We have collected 1000 data samples of health metrics\ndataset from Apollo Diagnostic Center Kolkata that is labeled as either\ndemented or non-demented for the training of MOD-1D-CNN for the game level 1\nand another dataset of facial images containing 1800 facial data that are\nlabeled as either demented or non-demented is collected by our research team\nfor the training of MOD-2D-CNN model in-game level 2. In our work, the loss for\nthe proposed MOD-1D-CNN model is 0.2692 and the highest accuracy is 70.50% for\nidentifying the dementia traits using real-life health metrics data. Similarly,\nthe proposed MOD-2D-CNN model loss is 0.1755 and the highest accuracy is\nobtained here 95.72% for recognizing the dementia status using real-life\nface-based image data. Therefore, a rule-based weightage method is applied to\ncombine both the proposed methods to achieve the final decision. The MOD-1D-CNN\nand MOD-2D-CNN models are more lightweight and computationally efficient\nalternatives because they have a significantly lower number of parameters when\ncompared to the other state-of-the-art models. We have compared their\naccuracies and parameters with the other state-of-the-art deep learning models.", "paper_summary_zh": "本文旨在开发一种新的受深度学习启发的游戏方法，用于早期检测痴呆症。本研究整合了一个基于鲁棒卷积神经网络 (CNN) 的模型，用于通过认知评估游戏应用程序使用健康指标数据和面部图像数据进行早期痴呆症检测。我们从 Apollo Diagnostic Center Kolkata 收集了 1000 个健康指标数据集的数据样本，这些样本被标记为痴呆或非痴呆，用于训练游戏第 1 关的 MOD-1D-CNN，以及由我们研究团队收集的另一个包含 1800 个面部数据的的面部图像数据集，这些数据被标记为痴呆或非痴呆，用于训练游戏第 2 关的 MOD-2D-CNN 模型。在我们的工作中，提出的 MOD-1D-CNN 模型的损失为 0.2692，使用真实健康指标数据识别痴呆特征的最高准确率为 70.50%。类似地，提出的 MOD-2D-CNN 模型损失为 0.1755，使用真实基于面部的图像数据识别痴呆状态的最高准确率为 95.72%。因此，应用基于规则的加权方法来结合这两种提出的方法以实现最终决策。与其他最先进的模型相比，MOD-1D-CNN 和 MOD-2D-CNN 模型更轻量且计算效率更高，因为它们的参数数量明显更少。我们已将它们的准确性和参数与其他最先进的深度学习模型进行了比较。", "author": "Paramita Kundu Maji et.al.", "authors": "Paramita Kundu Maji, Soubhik Acharya, Priti Paul, Sanjay Chakraborty, Saikat Basu", "id": "2405.16538v1", "paper_url": "http://arxiv.org/abs/2405.16538v1", "repo": "null"}}