{"2410.04834": {"publish_time": "2024-10-07", "title": "As Simple as Fine-tuning: LLM Alignment via Bidirectional Negative Feedback Loss", "paper_summary": "Direct Preference Optimization (DPO) has emerged as a more computationally\nefficient alternative to Reinforcement Learning from Human Feedback (RLHF) with\nProximal Policy Optimization (PPO), eliminating the need for reward models and\nonline sampling. Despite these benefits, DPO and its variants remain sensitive\nto hyper-parameters and prone to instability, particularly on mathematical\ndatasets. We argue that these issues arise from the unidirectional\nlikelihood-derivative negative feedback inherent in the log-likelihood loss\nfunction. To address this, we propose a novel LLM alignment loss that\nestablishes a stable Bidirectional Negative Feedback (BNF) during optimization.\nOur proposed BNF loss eliminates the need for pairwise contrastive losses and\ndoes not require any extra tunable hyper-parameters or pairwise preference\ndata, streamlining the alignment pipeline to be as simple as supervised\nfine-tuning. We conduct extensive experiments across two challenging QA\nbenchmarks and four reasoning benchmarks. The experimental results show that\nBNF achieves comparable performance to the best methods on QA benchmarks, while\nits performance decrease on the four reasoning benchmarks is significantly\nlower compared to the best methods, thus striking a better balance between\nvalue alignment and reasoning ability. In addition, we further validate the\nperformance of BNF on non-pairwise datasets, and conduct in-depth analysis of\nlog-likelihood and logit shifts across different preference optimization\nmethods.", "paper_summary_zh": "直接偏好優化 (DPO) 已成為一種更具計算效率的替代方案，用於透過近端策略最佳化 (PPO) 從人類回饋中進行強化學習 (RLHF)，消除了對獎勵模型和線上抽樣的需要。儘管有這些好處，但 DPO 及其變體仍然對超參數敏感，且容易不穩定，特別是在數學資料集上。我們認為這些問題源於對數似然損失函數中固有的單向似然導數負回饋。為了解決這個問題，我們提出了一種新穎的 LLM 對齊損失，它在最佳化過程中建立了一個穩定的雙向負回饋 (BNF)。我們提出的 BNF 損失消除了對成對對比損失的需求，並且不需要任何額外的可調整超參數或成對偏好數據，簡化了對齊管道，使其與監督微調一樣簡單。我們在兩個具有挑戰性的問答基準和四個推理基準上進行了廣泛的實驗。實驗結果表明，BNF 在問答基準上達到了與最佳方法相當的效能，而在四個推理基準上的效能下降與最佳方法相比顯著降低，從而取得了價值對齊和推理能力之間更好的平衡。此外，我們進一步驗證了 BNF 在非成對資料集上的效能，並對不同偏好最佳化方法中的對數似然和 logit 轉移進行了深入分析。", "author": "Xin Mao et.al.", "authors": "Xin Mao, Feng-Lin Li, Huimin Xu, Wei Zhang, Wang Chen, Anh Tuan Luu", "id": "2410.04834v1", "paper_url": "http://arxiv.org/abs/2410.04834v1", "repo": "null"}}