{"2502.13127": {"publish_time": "2025-02-18", "title": "Facilitating Long Context Understanding via Supervised Chain-of-Thought Reasoning", "paper_summary": "Recent advances in Large Language Models (LLMs) have enabled them to process\nincreasingly longer sequences, ranging from 2K to 2M tokens and even beyond.\nHowever, simply extending the input sequence length does not necessarily lead\nto effective long-context understanding. In this study, we integrate\nChain-of-Thought (CoT) reasoning into LLMs in a supervised manner to facilitate\neffective long-context understanding. To achieve this, we introduce\nLongFinanceQA, a synthetic dataset in the financial domain designed to improve\nlong-context reasoning. Unlike existing long-context synthetic data,\nLongFinanceQA includes intermediate CoT reasoning before the final conclusion,\nwhich encourages LLMs to perform explicit reasoning, improving accuracy and\ninterpretability in long-context understanding. To generate synthetic CoT\nreasoning, we propose Property-driven Agentic Inference (PAI), an agentic\nframework that simulates human-like reasoning steps, including property\nextraction, retrieval, and summarization. We evaluate PAI's reasoning\ncapabilities by assessing GPT-4o-mini w/ PAI on the Loong benchmark,\noutperforming standard GPT-4o-mini by 20.0%. Furthermore, we fine-tune\nLLaMA-3.1-8B-Instruct on LongFinanceQA, achieving a 24.6% gain on Loong's\nfinancial subset.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展讓它們能夠處理越來越長的序列，範圍從 2K 到 2M 個符號，甚至更長。\n然而，僅僅延長輸入序列長度並不會必然導致有效的長語境理解。在本研究中，我們以監督的方式將思考鏈 (CoT) 推理整合到 LLM 中，以促進有效的長語境理解。為此，我們引入了 LongFinanceQA，這是一個在金融領域中的合成數據集，旨在改進長語境推理。與現有的長語境合成數據不同，LongFinanceQA 在最終結論之前包含了中間的 CoT 推理，這鼓勵 LLM 執行明確的推理，從而提高長語境理解的準確性和可解釋性。為了生成合成的 CoT 推理，我們提出了基於屬性的主體推理 (PAI)，這是一個模擬類人推理步驟的主體框架，包括屬性提取、檢索和總結。我們通過評估搭載 PAI 的 GPT-4o-mini 在 Loong 基準上的推理能力，使其比標準的 GPT-4o-mini 高出 20.0%，來評估 PAI 的推理能力。此外，我們對 LLaMA-3.1-8B-Instruct 進行了微調，在 Loong 的金融子集中實現了 24.6% 的增益。", "author": "Jingyang Lin et.al.", "authors": "Jingyang Lin, Andy Wong, Tian Xia, Shenghua He, Hui Wei, Mei Han, Jiebo Luo", "id": "2502.13127v1", "paper_url": "http://arxiv.org/abs/2502.13127v1", "repo": "null"}}