{"2406.19314": {"publish_time": "2024-06-27", "title": "LiveBench: A Challenging, Contamination-Free LLM Benchmark", "paper_summary": "Test set contamination, wherein test data from a benchmark ends up in a newer\nmodel's training set, is a well-documented obstacle for fair LLM evaluation and\ncan quickly render benchmarks obsolete. To mitigate this, many recent\nbenchmarks crowdsource new prompts and evaluations from human or LLM judges;\nhowever, these can introduce significant biases, and break down when scoring\nhard questions. In this work, we introduce a new benchmark for LLMs designed to\nbe immune to both test set contamination and the pitfalls of LLM judging and\nhuman crowdsourcing. We release LiveBench, the first benchmark that (1)\ncontains frequently-updated questions from recent information sources, (2)\nscores answers automatically according to objective ground-truth values, and\n(3) contains a wide variety of challenging tasks, spanning math, coding,\nreasoning, language, instruction following, and data analysis. To achieve this,\nLiveBench contains questions that are based on recently-released math\ncompetitions, arXiv papers, news articles, and datasets, and it contains\nharder, contamination-free versions of tasks from previous benchmarks such as\nBig-Bench Hard, AMPS, and IFEval. We evaluate many prominent closed-source\nmodels, as well as dozens of open-source models ranging from 0.5B to 110B in\nsize. LiveBench is difficult, with top models achieving below 65% accuracy. We\nrelease all questions, code, and model answers. Questions will be added and\nupdated on a monthly basis, and we will release new tasks and harder versions\nof tasks over time so that LiveBench can distinguish between the capabilities\nof LLMs as they improve in the future. We welcome community engagement and\ncollaboration for expanding the benchmark tasks and models.", "paper_summary_zh": "測試集污染，基準測試中的測試資料最終出現在較新的模型訓練集中，是公平 LLM 評估的眾所周知障礙，且能快速使基準測試過時。為了減輕這一點，許多最近的基準測試從人類或 LLM 評審中群眾外包新的提示和評估；然而，這些可能會引入顯著的偏見，且在評分困難的問題時會崩潰。在這項工作中，我們為 LLM 介紹了一個新的基準測試，旨在對測試集污染和 LLM 評審和人類群眾外包的陷阱免疫。我們發布 LiveBench，這是第一個 (1) 包含來自近期資訊來源的頻繁更新問題、(2) 根據客觀基本事實值自動評分答案，以及 (3) 包含各種具有挑戰性的任務，涵蓋數學、編碼、推理、語言、遵循指示和資料分析的基準測試。為了達成這一點，LiveBench 包含基於最近發布的數學競賽、arXiv 論文、新聞文章和資料集的問題，並且它包含來自先前基準測試（例如 Big-Bench Hard、AMPS 和 IFEval）的更難、無污染的任務版本。我們評估了許多著名的閉源模型，以及數十個大小從 0.5B 到 110B 的開源模型。LiveBench 很困難，頂尖模型的準確率低於 65%。我們發布所有問題、程式碼和模型答案。問題將按月新增和更新，我們將隨著時間推移發布新的任務和更困難的任務版本，以便 LiveBench 能區分 LLM 在未來改進時的各種功能。我們歡迎社群參與和合作，以擴展基準測試任務和模型。", "author": "Colin White et.al.", "authors": "Colin White, Samuel Dooley, Manley Roberts, Arka Pal, Ben Feuer, Siddhartha Jain, Ravid Shwartz-Ziv, Neel Jain, Khalid Saifullah, Siddartha Naidu, Chinmay Hegde, Yann LeCun, Tom Goldstein, Willie Neiswanger, Micah Goldblum", "id": "2406.19314v1", "paper_url": "http://arxiv.org/abs/2406.19314v1", "repo": "https://github.com/livebench/livebench"}}