{"2501.07186": {"publish_time": "2025-01-13", "title": "Generalizable Graph Neural Networks for Robust Power Grid Topology Control", "paper_summary": "The energy transition necessitates new congestion management methods. One\nsuch method is controlling the grid topology with machine learning (ML). This\napproach has gained popularity following the Learning to Run a Power Network\n(L2RPN) competitions. Graph neural networks (GNNs) are a class of ML models\nthat reflect graph structure in their computation, which makes them suitable\nfor power grid modeling. Various GNN approaches for topology control have thus\nbeen proposed. We propose the first GNN model for grid topology control that\nuses only GNN layers. Additionally, we identify the busbar information\nasymmetry problem that the popular homogeneous graph representation suffers\nfrom, and propose a heterogeneous graph representation to resolve it. We train\nboth homogeneous and heterogeneous GNNs and fully connected neural networks\n(FCNN) baselines on an imitation learning task. We evaluate the models\naccording to their classification accuracy and grid operation ability. We find\nthat the heterogeneous GNNs perform best on in-distribution networks, followed\nby the FCNNs, and lastly, the homogeneous GNNs. We also find that both GNN\ntypes generalize better to out-of-distribution networks than FCNNs.", "paper_summary_zh": "能源轉型需要新的壅塞管理方法。一種這樣的做法是使用機器學習 (ML) 控制電網拓撲。這種方法在學習運行電力網路 (L2RPN) 競賽後獲得普及。圖形神經網路 (GNN) 是一類 ML 模型，其在運算中反映圖形結構，這使得它們適用於電力網路建模。因此，已經提出各種用於拓撲控制的 GNN 方法。我們提出了第一個僅使用 GNN 層進行電網拓撲控制的 GNN 模型。此外，我們找出流行的同質圖形表示法所遭受的母線資訊不對稱問題，並提出異質圖形表示法來解決它。我們在模仿學習任務中訓練同質和異質 GNN 以及全連接神經網路 (FCNN) 基準。我們根據模型的分類準確度和電網操作能力對模型進行評估。我們發現，異質 GNN 在分佈內網路中表現最佳，其次是 FCNN，最後是同質 GNN。我們還發現，與 FCNN 相比，兩種 GNN 類型都能更好地推廣到分佈外網路。", "author": "Matthijs de Jong et.al.", "authors": "Matthijs de Jong, Jan Viebahn, Yuliya Shapovalova", "id": "2501.07186v1", "paper_url": "http://arxiv.org/abs/2501.07186v1", "repo": "null"}}