{"2410.05114": {"publish_time": "2024-10-07", "title": "Synthetic Generation of Dermatoscopic Images with GAN and Closed-Form Factorization", "paper_summary": "In the realm of dermatological diagnoses, where the analysis of dermatoscopic\nand microscopic skin lesion images is pivotal for the accurate and early\ndetection of various medical conditions, the costs associated with creating\ndiverse and high-quality annotated datasets have hampered the accuracy and\ngeneralizability of machine learning models. We propose an innovative\nunsupervised augmentation solution that harnesses Generative Adversarial\nNetwork (GAN) based models and associated techniques over their latent space to\ngenerate controlled semiautomatically-discovered semantic variations in\ndermatoscopic images. We created synthetic images to incorporate the semantic\nvariations and augmented the training data with these images. With this\napproach, we were able to increase the performance of machine learning models\nand set a new benchmark amongst non-ensemble based models in skin lesion\nclassification on the HAM10000 dataset; and used the observed analytics and\ngenerated models for detailed studies on model explainability, affirming the\neffectiveness of our solution.", "paper_summary_zh": "在皮膚科診斷領域，皮膚鏡檢查和顯微鏡皮膚病變影像的分析對於準確且早期偵測各種醫療狀況至關重要，但建立多樣化且高品質的標記資料集相關成本已阻礙機器學習模型的準確性和普遍性。我們提出創新的非監督式擴充解決方案，利用生成對抗網路 (GAN) 基礎模型及其在潛在空間上的相關技術，以在皮膚鏡影像中產生受控的半自動發現語義變化。我們建立合成影像以納入語義變化，並使用這些影像擴充訓練資料。透過此方法，我們得以提升機器學習模型的效能，並在 HAM10000 資料集的皮膚病變分類中設定非整體式模型的新基準；並使用觀察到的分析和建立的模型進行模型可解釋性的詳細研究，確認我們解決方案的有效性。", "author": "Rohan Reddy Mekala et.al.", "authors": "Rohan Reddy Mekala, Frederik Pahde, Simon Baur, Sneha Chandrashekar, Madeline Diep, Markus Wenzel, Eric L. Wisotzky, Galip Ümit Yolcu, Sebastian Lapuschkin, Jackie Ma, Peter Eisert, Mikael Lindvall, Adam Porter, Wojciech Samek", "id": "2410.05114v1", "paper_url": "http://arxiv.org/abs/2410.05114v1", "repo": "null"}}