{"2410.14180": {"publish_time": "2024-10-18", "title": "XForecast: Evaluating Natural Language Explanations for Time Series Forecasting", "paper_summary": "Time series forecasting aids decision-making, especially for stakeholders who\nrely on accurate predictions, making it very important to understand and\nexplain these models to ensure informed decisions. Traditional explainable AI\n(XAI) methods, which underline feature or temporal importance, often require\nexpert knowledge. In contrast, natural language explanations (NLEs) are more\naccessible to laypeople. However, evaluating forecast NLEs is difficult due to\nthe complex causal relationships in time series data. To address this, we\nintroduce two new performance metrics based on simulatability, assessing how\nwell a human surrogate can predict model forecasts using the explanations.\nExperiments show these metrics differentiate good from poor explanations and\nalign with human judgments. Utilizing these metrics, we further evaluate the\nability of state-of-the-art large language models (LLMs) to generate\nexplanations for time series data, finding that numerical reasoning, rather\nthan model size, is the main factor influencing explanation quality.", "paper_summary_zh": "時間序列預測有助於決策制定，特別是對於依賴準確預測的利害關係人，因此了解和解釋這些模型以確保明智的決策非常重要。強調特徵或時間重要性的傳統可解釋 AI (XAI) 方法通常需要專家知識。相比之下，自然語言解釋 (NLE) 更容易讓外行人理解。然而，由於時間序列資料中複雜的因果關係，評估預測 NLE 很困難。為了解決這個問題，我們引入了兩個基於可模擬性的新效能指標，評估人類代理人使用解釋預測模型預測的程度。實驗表明，這些指標可以區分好解釋和差解釋，並且與人類的判斷一致。利用這些指標，我們進一步評估了最先進的大語言模型 (LLM) 為時間序列資料生成解釋的能力，發現數字推理，而不是模型大小，是影響解釋品質的主要因素。", "author": "Taha Aksu et.al.", "authors": "Taha Aksu, Chenghao Liu, Amrita Saha, Sarah Tan, Caiming Xiong, Doyen Sahoo", "id": "2410.14180v1", "paper_url": "http://arxiv.org/abs/2410.14180v1", "repo": "null"}}