{"2405.17383": {"publish_time": "2024-05-27", "title": "Unlocking the Secrets of Linear Complexity Sequence Model from A Unified Perspective", "paper_summary": "We present the Linear Complexity Sequence Model (LCSM), a comprehensive\nsolution that unites various sequence modeling techniques with linear\ncomplexity, including linear attention, state space model, long convolution,\nand linear RNN, within a single framework. The goal is to enhance comprehension\nof these models by analyzing the impact of each component from a cohesive and\nstreamlined viewpoint. Specifically, we segment the modeling processes of these\nmodels into three distinct stages: Expand, Oscillation, and Shrink (EOS), with\neach model having its own specific settings. The Expand stage involves\nprojecting the input signal onto a high-dimensional memory state. This is\nfollowed by recursive operations performed on the memory state in the\nOscillation stage. Finally, the memory state is projected back to a\nlow-dimensional space in the Shrink stage. We perform comprehensive experiments\nto analyze the impact of different stage settings on language modeling and\nretrieval tasks. Our results show that data-driven methods are crucial for the\neffectiveness of the three stages in language modeling, whereas hand-crafted\nmethods yield better performance in retrieval tasks.", "paper_summary_zh": "我們提出線性複雜度序列模型 (LCSM)，這是一個全面的解決方案，它將各種序列建模技術與線性複雜度結合在一個單一架構中，包括線性注意力、狀態空間模型、長卷積和線性 RNN。目標是透過從一個有凝聚力和流暢的觀點分析每個組成的影響，來增強對這些模型的理解。具體來說，我們將這些模型的建模過程分為三個不同的階段：擴展、振盪和收縮 (EOS)，每個模型都有其特定的設定。擴展階段涉及將輸入訊號投射到高維記憶狀態。接下來在振盪階段對記憶狀態執行遞迴運算。最後，在收縮階段將記憶狀態投射回低維空間。我們執行全面的實驗，以分析不同階段設定對語言建模和擷取任務的影響。我們的結果表明，資料驅動的方法對於語言建模中三個階段的有效性至關重要，而手工方法在擷取任務中產生更好的效能。", "author": "Zhen Qin et.al.", "authors": "Zhen Qin, Xuyang Shen, Weigao Sun, Dong Li, Stan Birchfield, Richard Hartley, Yiran Zhong", "id": "2405.17383v1", "paper_url": "http://arxiv.org/abs/2405.17383v1", "repo": "null"}}