{"2406.02356": {"publish_time": "2024-06-04", "title": "Language Models Do Hard Arithmetic Tasks Easily and Hardly Do Easy Arithmetic Tasks", "paper_summary": "The ability (and inability) of large language models (LLMs) to perform\narithmetic tasks has been the subject of much theoretical and practical debate.\nWe show that LLMs are frequently able to correctly and confidently predict the\nfirst digit of n-digit by m-digit multiplication tasks without using chain of\nthought reasoning, despite these tasks require compounding operations to solve.\nSimultaneously, LLMs in practice often fail to correctly or confidently predict\nthe last digit of an n-digit by m-digit multiplication, a task equivalent to\n1-digit by 1-digit multiplication which can be easily learned or memorized. We\nshow that the latter task can be solved more robustly when the LLM is\nconditioned on all of the correct higher-order digits, which on average\nincreases the confidence of the correct last digit on 5-digit by 5-digit\nmultiplication tasks using Llama 2-13B by over 230% (0.13 to 0.43) and\nMistral-7B by 150% (0.22 to 0.55).", "paper_summary_zh": "大型語言模型（LLM）執行算術任務的能力（和無能）一直是許多理論和實務辯論的主題。我們證明，LLM 通常能夠正確且自信地預測 n 位數乘以 m 位數乘法任務的第一位數字，而無需使用思考鏈推理，儘管這些任務需要複合運算才能解決。同時，LLM 在實務上經常無法正確或自信地預測 n 位數乘以 m 位數乘法的最後一位數字，這項任務等於 1 位數乘以 1 位數的乘法，可以輕鬆學習或記憶。我們證明，當 LLM 以所有正確的高階數字為條件時，可以更穩健地解決後一項任務，這平均會提高使用 Llama 2-13B 的 5 位數乘以 5 位數乘法任務中正確最後一位數字的信心超過 230%（0.13 至 0.43），而 Mistral-7B 則提高 150%（0.22 至 0.55）。", "author": "Andrew Gambardella et.al.", "authors": "Andrew Gambardella, Yusuke Iwasawa, Yutaka Matsuo", "id": "2406.02356v1", "paper_url": "http://arxiv.org/abs/2406.02356v1", "repo": "null"}}