{"2502.13965": {"publish_time": "2025-02-19", "title": "Autellix: An Efficient Serving Engine for LLM Agents as General Programs", "paper_summary": "Large language model (LLM) applications are evolving beyond simple chatbots\ninto dynamic, general-purpose agentic programs, which scale LLM calls and\noutput tokens to help AI agents reason, explore, and solve complex tasks.\nHowever, existing LLM serving systems ignore dependencies between programs and\ncalls, missing significant opportunities for optimization. Our analysis reveals\nthat programs submitted to LLM serving engines experience long cumulative wait\ntimes, primarily due to head-of-line blocking at both the individual LLM\nrequest and the program. To address this, we introduce Autellix, an LLM serving\nsystem that treats programs as first-class citizens to minimize their\nend-to-end latencies. Autellix intercepts LLM calls submitted by programs,\nenriching schedulers with program-level context. We propose two scheduling\nalgorithms-for single-threaded and distributed programs-that preempt and\nprioritize LLM calls based on their programs' previously completed calls. Our\nevaluation demonstrates that across diverse LLMs and agentic workloads,\nAutellix improves throughput of programs by 4-15x at the same latency compared\nto state-of-the-art systems, such as vLLM.", "paper_summary_zh": "大型語言模型 (LLM) 應用正從簡單的聊天機器人演變成動態、通用的代理程式，它擴展了 LLM 的呼叫，並輸出代碼，以幫助 AI 代理推理、探索和解決複雜任務。\n然而，現有的 LLM 服務系統忽視了程式和呼叫之間的依賴關係，錯失了最佳化的重要機會。我們的分析顯示，提交給 LLM 服務引擎的程式會遇到長時間的累積等待時間，這主要是因為在個別 LLM 請求和程式中都會發生隊列頭端封鎖。為了解決這個問題，我們引入了 Autellix，這是一個 LLM 服務系統，它將程式視為一級公民，以最小化其端到端延遲。Autellix 會攔截程式提交的 LLM 呼叫，並使用程式層級的內容豐富排程器。我們提出了兩種排程演算法，分別適用於單執行緒和分散式程式，這些演算法會根據程式先前完成的呼叫，優先處理和預先處理 LLM 呼叫。我們的評估證明，與 vLLM 等最先進的系統相比，在相同的延遲下，Autellix 可將程式的處理量提升 4-15 倍，且適用於各種 LLM 和代理工作負載。", "author": "Michael Luo et.al.", "authors": "Michael Luo, Xiaoxiang Shi, Colin Cai, Tianjun Zhang, Justin Wong, Yichuan Wang, Chi Wang, Yanping Huang, Zhifeng Chen, Joseph E. Gonzalez, Ion Stoica", "id": "2502.13965v1", "paper_url": "http://arxiv.org/abs/2502.13965v1", "repo": "null"}}