{"2412.09014": {"publish_time": "2024-12-12", "title": "Improvement in Sign Language Translation Using Text CTC Alignment", "paper_summary": "Current sign language translation (SLT) approaches often rely on gloss-based\nsupervision with Connectionist Temporal Classification (CTC), limiting their\nability to handle non-monotonic alignments between sign language video and\nspoken text. In this work, we propose a novel method combining joint\nCTC/Attention and transfer learning. The joint CTC/Attention introduces\nhierarchical encoding and integrates CTC with the attention mechanism during\ndecoding, effectively managing both monotonic and non-monotonic alignments.\nMeanwhile, transfer learning helps bridge the modality gap between vision and\nlanguage in SLT. Experimental results on two widely adopted benchmarks,\nRWTH-PHOENIX-Weather 2014 T and CSL-Daily, show that our method achieves\nresults comparable to state-of-the-art and outperforms the pure-attention\nbaseline. Additionally, this work opens a new door for future research into\ngloss-free SLT using text-based CTC alignment.", "paper_summary_zh": "現有的手語翻譯 (SLT) 方法通常依賴於基於符號的監督與連接時間分類 (CTC)，這限制了它們處理手語影片與口語文字之間非單調對齊的能力。在這項工作中，我們提出了一種結合聯合 CTC/注意力與遷移學習的新方法。聯合 CTC/注意力引入了階層編碼，並在解碼過程中將 CTC 與注意力機制整合起來，有效地管理單調和非單調對齊。同時，遷移學習有助於彌補 SLT 中視覺與語言之間的模態差距。在兩個廣泛採用的基準 RWTH-PHOENIX-Weather 2014 T 和 CSL-Daily 上的實驗結果顯示，我們的這項方法達到了與現有技術相當的結果，並且優於純注意力基準。此外，這項工作為未來使用基於文字的 CTC 對齊進行無符號 SLT 研究開啟了一扇新門。", "author": "Sihan Tan et.al.", "authors": "Sihan Tan, Taro Miyazaki, Nabeela Khan, Kazuhiro Nakadai", "id": "2412.09014v2", "paper_url": "http://arxiv.org/abs/2412.09014v2", "repo": "https://github.com/Claire874/TextCTC-SLT"}}