{"2501.03805": {"publish_time": "2025-01-07", "title": "Detecting the Undetectable: Assessing the Efficacy of Current Spoof Detection Methods Against Seamless Speech Edits", "paper_summary": "Neural speech editing advancements have raised concerns about their misuse in\nspoofing attacks. Traditional partially edited speech corpora primarily focus\non cut-and-paste edits, which, while maintaining speaker consistency, often\nintroduce detectable discontinuities. Recent methods, like\nA\\textsuperscript{3}T and Voicebox, improve transitions by leveraging\ncontextual information. To foster spoofing detection research, we introduce the\nSpeech INfilling Edit (SINE) dataset, created with Voicebox. We detailed the\nprocess of re-implementing Voicebox training and dataset creation. Subjective\nevaluations confirm that speech edited using this novel technique is more\nchallenging to detect than conventional cut-and-paste methods. Despite human\ndifficulty, experimental results demonstrate that self-supervised-based\ndetectors can achieve remarkable performance in detection, localization, and\ngeneralization across different edit methods. The dataset and related models\nwill be made publicly available.", "paper_summary_zh": "神經語音編輯的進展引發了人們對其在欺騙攻擊中被濫用的擔憂。傳統的部分編輯語音語料庫主要集中在剪貼編輯上，儘管保持了說話者的一致性，但通常會引入可檢測的不連續性。最近的方法，如 A\\textsuperscript{3}T 和 Voicebox，通過利用上下文信息改進了過渡。為了促進欺騙檢測研究，我們引入了使用 Voicebox 創建的語音填充編輯 (SINE) 數據集。我們詳細介紹了重新實現 Voicebox 訓練和數據集創建的過程。主觀評估證實，使用這種新技術編輯的語音比傳統的剪貼方法更難檢測。儘管人類有困難，但實驗結果表明，基於自監督的檢測器可以在不同編輯方法的檢測、定位和泛化中實現顯著的性能。該數據集和相關模型將公開提供。", "author": "Sung-Feng Huang et.al.", "authors": "Sung-Feng Huang, Heng-Cheng Kuo, Zhehuai Chen, Xuesong Yang, Chao-Han Huck Yang, Yu Tsao, Yu-Chiang Frank Wang, Hung-yi Lee, Szu-Wei Fu", "id": "2501.03805v1", "paper_url": "http://arxiv.org/abs/2501.03805v1", "repo": "null"}}