{"2503.15481": {"publish_time": "2025-03-19", "title": "Learning to Play Piano in the Real World", "paper_summary": "Towards the grand challenge of achieving human-level manipulation in robots,\nplaying piano is a compelling testbed that requires strategic, precise, and\nflowing movements. Over the years, several works demonstrated hand-designed\ncontrollers on real world piano playing, while other works evaluated robot\nlearning approaches on simulated piano scenarios. In this paper, we develop the\nfirst piano playing robotic system that makes use of learning approaches while\nalso being deployed on a real world dexterous robot. Specifically, we make use\nof Sim2Real to train a policy in simulation using reinforcement learning before\ndeploying the learned policy on a real world dexterous robot. In our\nexperiments, we thoroughly evaluate the interplay between domain randomization\nand the accuracy of the dynamics model used in simulation. Moreover, we\nevaluate the robot's performance across multiple songs with varying complexity\nto study the generalization of our learned policy. By providing a\nproof-of-concept of learning to play piano in the real world, we want to\nencourage the community to adopt piano playing as a compelling benchmark\ntowards human-level manipulation. We open-source our code and show additional\nvideos at https://lasr.org/research/learning-to-play-piano .", "paper_summary_zh": "<paragraph>為了實現機器人達到人類級別操控的宏偉目標，彈鋼琴是一個引人注目的測試平台，它需要策略性、精確性和流暢性的動作。多年來，一些研究展示了在真實世界中彈鋼琴的手工設計控制器，而其他研究則在模擬鋼琴場景中評估了機器人學習方法。在本文中，我們開發了第一個利用學習方法的鋼琴演奏機器人系統，並將其部署在真實世界的靈巧機器人上。具體來說，我們利用 Sim2Real 在模擬中使用強化學習來訓練策略，然後將學習到的策略部署到真實世界的靈巧機器人上。在我們的實驗中，我們徹底評估了域隨機化與模擬中使用的動力學模型精度之間的相互作用。此外，我們評估了機器人在多首不同複雜程度的歌曲中的演奏表現，以研究我們學習到的策略的泛化能力。通過提供在現實世界中學習彈鋼琴的概念驗證，我們希望鼓勵社群採用彈鋼琴作為邁向人類級別操控的引人注目的基準。我們開源了我們的程式碼，並在 https://lasr.org/research/learning-to-play-piano 提供更多影片。 </paragraph>\n", "author": "Yves-Simon Zeulner et.al.", "authors": "Yves-Simon Zeulner, Sandeep Selvaraj, Roberto Calandra", "id": "2503.15481v1", "paper_url": "http://arxiv.org/abs/2503.15481v1", "repo": "null"}}