{"2407.10456": {"publish_time": "2024-07-15", "title": "Don't Throw Away Data: Better Sequence Knowledge Distillation", "paper_summary": "A critical component in knowledge distillation is the means of coupling the\nteacher and student. The predominant sequence knowledge distillation method\ninvolves supervised learning of the student against teacher-decoded outputs,\nand is exemplified by the current state of the art, which incorporates minimum\nBayes risk (MBR) decoding. In this paper we seek to integrate MBR more tightly\nin distillation training, specifically by using several high scoring MBR\ntranslations, rather than a single selected sequence, thus capturing a rich\ndiversity of teacher outputs. Our experiments on English to German and English\nto Japanese translation show consistent improvements over strong baseline\nmethods for both tasks and with varying model sizes. Additionally, we conduct a\ndetailed analysis focusing on data efficiency and capacity curse aspects to\nelucidate MBR-n and explore its further potential.", "paper_summary_zh": "知識萃取中一個重要的組成部分是連結教師和學生的方法。\n主要的序列知識萃取方法涉及學生針對教師解碼輸出進行監督學習，\n並以包含最小貝氏風險 (MBR) 解碼的現有技術為例。\n在本文中，我們尋求將 MBR 更緊密地整合到萃取訓練中，\n特別是透過使用多個高分 MBR 翻譯，而不是單一選定的序列，\n從而捕捉到教師輸出的豐富多樣性。\n我們針對英譯德和英譯日翻譯進行的實驗顯示，\n對於這兩個任務和各種模型大小，都比強大的基線方法有顯著的改進。\n此外，我們進行了詳細的分析，重點關注資料效率和容量瓶頸方面，\n以闡明 MBR-n 並探索其進一步的潛力。", "author": "Jun Wang et.al.", "authors": "Jun Wang, Eleftheria Briakou, Hamid Dadkhahi, Rishabh Agarwal, Colin Cherry, Trevor Cohn", "id": "2407.10456v1", "paper_url": "http://arxiv.org/abs/2407.10456v1", "repo": "null"}}