{"2406.09949": {"publish_time": "2024-06-14", "title": "Neural Concept Binder", "paper_summary": "The challenge in object-based visual reasoning lies in generating descriptive\nyet distinct concept representations. Moreover, doing this in an unsupervised\nfashion requires human users to understand a model's learned concepts and\npotentially revise false concepts. In addressing this challenge, we introduce\nthe Neural Concept Binder, a new framework for deriving discrete concept\nrepresentations resulting in what we term \"concept-slot encodings\". These\nencodings leverage both \"soft binding\" via object-centric block-slot encodings\nand \"hard binding\" via retrieval-based inference. The Neural Concept Binder\nfacilitates straightforward concept inspection and direct integration of\nexternal knowledge, such as human input or insights from other AI models like\nGPT-4. Additionally, we demonstrate that incorporating the hard binding\nmechanism does not compromise performance; instead, it enables seamless\nintegration into both neural and symbolic modules for intricate reasoning\ntasks, as evidenced by evaluations on our newly introduced CLEVR-Sudoku\ndataset.", "paper_summary_zh": "在基於物件的視覺推理中，挑戰在於產生具描述性且獨特的概念表徵。此外，以無監督的方式進行此操作需要人類使用者了解模型學習到的概念，並有可能修正錯誤的概念。在解決此挑戰時，我們引入了神經概念結合器，一個用於衍生離散概念表徵的新架構，產生我們稱之為「概念槽編碼」的結果。這些編碼透過物件為中心的區塊槽編碼利用「軟綁定」，並透過基於檢索的推論利用「硬綁定」。神經概念結合器促進直接的概念檢查和外部知識的直接整合，例如人類輸入或來自其他 AI 模型（例如 GPT-4）的見解。此外，我們證明了納入硬綁定機制並不會影響效能；相反地，它能將神經模組和符號模組無縫整合到複雜的推理任務中，正如我們新推出的 CLEVR-Sudoku 資料集上的評估所證明的那樣。", "author": "Wolfgang Stammer et.al.", "authors": "Wolfgang Stammer, Antonia Wüst, David Steinmann, Kristian Kersting", "id": "2406.09949v1", "paper_url": "http://arxiv.org/abs/2406.09949v1", "repo": "https://github.com/ml-research/neuralconceptbinder"}}