{"2412.12032": {"publish_time": "2024-12-16", "title": "FSFM: A Generalizable Face Security Foundation Model via Self-Supervised Facial Representation Learning", "paper_summary": "This work asks: with abundant, unlabeled real faces, how to learn a robust\nand transferable facial representation that boosts various face security tasks\nwith respect to generalization performance? We make the first attempt and\npropose a self-supervised pretraining framework to learn fundamental\nrepresentations of real face images, FSFM, that leverages the synergy between\nmasked image modeling (MIM) and instance discrimination (ID). We explore\nvarious facial masking strategies for MIM and present a simple yet powerful\nCRFR-P masking, which explicitly forces the model to capture meaningful\nintra-region consistency and challenging inter-region coherency. Furthermore,\nwe devise the ID network that naturally couples with MIM to establish\nunderlying local-to-global correspondence via tailored self-distillation. These\nthree learning objectives, namely 3C, empower encoding both local features and\nglobal semantics of real faces. After pretraining, a vanilla ViT serves as a\nuniversal vision foundation model for downstream face security tasks:\ncross-dataset deepfake detection, cross-domain face anti-spoofing, and unseen\ndiffusion facial forgery detection. Extensive experiments on 10 public datasets\ndemonstrate that our model transfers better than supervised pretraining, visual\nand facial self-supervised learning arts, and even outperforms task-specialized\nSOTA methods.", "paper_summary_zh": "本研究提出：面对大量未标记的真实人脸，如何学习稳健且可转移的人脸表征，以提升各种人脸安全任务的泛化性能？我们首次尝试并提出一个自监督预训练框架，以学习真实人脸图像的基本表征，即 FSFM，它利用了掩码图像建模 (MIM) 和实例辨别 (ID) 之间的协同作用。我们探索了各种用于 MIM 的人脸掩码策略，并提出了一种简单但强大的 CRFR-P 掩码，它明确迫使模型捕获有意义的区域内一致性和具有挑战性的区域间连贯性。此外，我们设计了 ID 网络，它自然地与 MIM 耦合，通过定制的自蒸馏建立了底层的局部到全局对应关系。这三个学习目标，即 3C，赋能对真实人脸的局部特征和全局语义进行编码。在预训练后，一个香草 ViT 充当下游人脸安全任务的通用视觉基础模型：跨数据集深度伪造检测、跨域人脸防欺骗和看不见的扩散人脸伪造检测。在 10 个公共数据集上的大量实验表明，与监督式预训练、视觉和人脸自监督学习艺术相比，我们的模型具有更好的迁移性，甚至优于专门针对任务的 SOTA 方法。", "author": "Gaojian Wang et.al.", "authors": "Gaojian Wang, Feng Lin, Tong Wu, Zhenguang Liu, Zhongjie Ba, Kui Ren", "id": "2412.12032v1", "paper_url": "http://arxiv.org/abs/2412.12032v1", "repo": "null"}}