{"2411.04298": {"publish_time": "2024-11-06", "title": "A Capabilities Approach to Studying Bias and Harm in Language Technologies", "paper_summary": "Mainstream Natural Language Processing (NLP) research has ignored the\nmajority of the world's languages. In moving from excluding the majority of the\nworld's languages to blindly adopting what we make for English, we first risk\nimporting the same harms we have at best mitigated and at least measured for\nEnglish. However, in evaluating and mitigating harms arising from adopting new\ntechnologies into such contexts, we often disregard (1) the actual community\nneeds of Language Technologies, and (2) biases and fairness issues within the\ncontext of the communities. In this extended abstract, we consider fairness,\nbias, and inclusion in Language Technologies through the lens of the\nCapabilities Approach. The Capabilities Approach centers on what people are\ncapable of achieving, given their intersectional social, political, and\neconomic contexts instead of what resources are (theoretically) available to\nthem. We detail the Capabilities Approach, its relationship to multilingual and\nmulticultural evaluation, and how the framework affords meaningful\ncollaboration with community members in defining and measuring the harms of\nLanguage Technologies.", "paper_summary_zh": "主流自然語言處理 (NLP) 研究忽略了世界上大部分語言。在從排除世界上大部分語言轉變為盲目採用我們為英語製作的內容時，我們首先冒著輸入我們在英語中至多減輕、至少衡量的相同危害的風險。然而，在評估和減輕因在這些環境中採用新技術而產生的危害時，我們常常忽視 (1) 語言技術的實際社區需求，以及 (2) 社區環境中的偏見和公平性問題。在此延伸摘要中，我們透過能力方法的觀點來考量語言技術中的公平性、偏見和包容性。能力方法著重於人們在交織的社會、政治和經濟背景下能夠達成什麼，而不是他們（理論上）可以獲得什麼資源。我們詳細說明能力方法、它與多語言和多文化評估的關係，以及該框架如何讓社區成員在定義和衡量語言技術的危害時進行有意義的協作。", "author": "Hellina Hailu Nigatu et.al.", "authors": "Hellina Hailu Nigatu, Zeerak Talat", "id": "2411.04298v1", "paper_url": "http://arxiv.org/abs/2411.04298v1", "repo": "null"}}