{"2412.11699": {"publish_time": "2024-12-16", "title": "CoinMath: Harnessing the Power of Coding Instruction for Math LLMs", "paper_summary": "Large Language Models (LLMs) have shown strong performance in solving\nmathematical problems, with code-based solutions proving particularly\neffective. However, the best practice to leverage coding instruction data to\nenhance mathematical reasoning remains underexplored. This study investigates\nthree key questions: (1) How do different coding styles of mathematical\ncode-based rationales impact LLMs' learning performance? (2) Can general-domain\ncoding instructions improve performance? (3) How does integrating textual\nrationales with code-based ones during training enhance mathematical reasoning\nabilities? Our findings reveal that code-based rationales with concise\ncomments, descriptive naming, and hardcoded solutions are beneficial, while\nimprovements from general-domain coding instructions and textual rationales are\nrelatively minor. Based on these insights, we propose CoinMath, a learning\nstrategy designed to enhance mathematical reasoning by diversifying the coding\nstyles of code-based rationales. CoinMath generates a variety of code-based\nrationales incorporating concise comments, descriptive naming conventions, and\nhardcoded solutions. Experimental results demonstrate that CoinMath\nsignificantly outperforms its baseline model, MAmmoTH, one of the SOTA math\nLLMs.", "paper_summary_zh": "大型語言模型 (LLM) 在解決數學問題方面表現出色，其中基於程式碼的解決方案特別有效。然而，利用編碼指令資料來增強數學推理的最佳實務仍有待探討。本研究探討了三個關鍵問題：(1) 數學程式碼式依據的不同編碼風格如何影響 LLM 的學習表現？(2) 一般領域的編碼指令是否可以提升表現？(3) 在訓練期間將文字依據與基於程式碼的依據整合在一起，如何增強數學推理能力？我們的發現顯示，具有簡潔註解、描述性命名和硬編碼解決方案的基於程式碼的依據是有益的，而一般領域編碼指令和文字依據的改進相對較小。根據這些見解，我們提出了 CoinMath，這是一種學習策略，旨在透過分散基於程式碼的依據的編碼風格來增強數學推理。CoinMath 產生各種基於程式碼的依據，包括簡潔的註解、描述性命名慣例和硬編碼解決方案。實驗結果表明，CoinMath 明顯優於其基準模型 MAmmoTH，這是 SOTA 數學 LLM 之一。", "author": "Chengwei Wei et.al.", "authors": "Chengwei Wei, Bin Wang, Jung-jae Kim, Guimei Liu, Nancy F. Chen", "id": "2412.11699v1", "paper_url": "http://arxiv.org/abs/2412.11699v1", "repo": "null"}}