{"2408.15996": {"publish_time": "2024-08-28", "title": "Spatio-Temporal Context Prompting for Zero-Shot Action Detection", "paper_summary": "Spatio-temporal action detection encompasses the tasks of localizing and\nclassifying individual actions within a video. Recent works aim to enhance this\nprocess by incorporating interaction modeling, which captures the relationship\nbetween people and their surrounding context. However, these approaches have\nprimarily focused on fully-supervised learning, and the current limitation lies\nin the lack of generalization capability to recognize unseen action categories.\nIn this paper, we aim to adapt the pretrained image-language models to detect\nunseen actions. To this end, we propose a method which can effectively leverage\nthe rich knowledge of visual-language models to perform Person-Context\nInteraction. Meanwhile, our Context Prompting module will utilize contextual\ninformation to prompt labels, thereby enhancing the generation of more\nrepresentative text features. Moreover, to address the challenge of recognizing\ndistinct actions by multiple people at the same timestamp, we design the\nInterest Token Spotting mechanism which employs pretrained visual knowledge to\nfind each person's interest context tokens, and then these tokens will be used\nfor prompting to generate text features tailored to each individual. To\nevaluate the ability to detect unseen actions, we propose a comprehensive\nbenchmark on J-HMDB, UCF101-24, and AVA datasets. The experiments show that our\nmethod achieves superior results compared to previous approaches and can be\nfurther extended to multi-action videos, bringing it closer to real-world\napplications. The code and data can be found in\nhttps://webber2933.github.io/ST-CLIP-project-page.", "paper_summary_zh": "時空動作偵測包含在影片中定位和分類個別動作的任務。最近的研究旨在透過納入互動建模來增強此流程，此建模捕捉人與其周遭環境之間的關係。然而，這些方法主要專注於完全監督式學習，而目前的限制在於缺乏辨識未見動作類別的概化能力。在本文中，我們旨在調整預先訓練的影像語言模型以偵測未見動作。為此，我們提出一個方法，可以有效利用視覺語言模型豐富的知識來執行人與環境互動。同時，我們的脈絡提示模組將利用脈絡資訊來提示標籤，從而增強更具代表性的文字特徵的產生。此外，為了應對在同一個時間戳記中辨識多個人不同動作的挑戰，我們設計了興趣標記偵測機制，該機制採用預先訓練的視覺知識來尋找每個人物的興趣脈絡標記，然後這些標記將用於提示以產生針對每個個人的客製化文字特徵。為了評估偵測未見動作的能力，我們在 J-HMDB、UCF101-24 和 AVA 資料集上提出了一個全面的基準。實驗顯示，與先前的做法相比，我們的做法獲得了優異的結果，並且可以進一步擴展到多動作影片，使其更接近真實世界的應用。程式碼和資料可以在 https://webber2933.github.io/ST-CLIP-project-page 中找到。", "author": "Wei-Jhe Huang et.al.", "authors": "Wei-Jhe Huang, Min-Hung Chen, Shang-Hong Lai", "id": "2408.15996v1", "paper_url": "http://arxiv.org/abs/2408.15996v1", "repo": "null"}}