{"2409.16909": {"publish_time": "2024-09-25", "title": "Enhancing Temporal Sensitivity and Reasoning for Time-Sensitive Question Answering", "paper_summary": "Time-Sensitive Question Answering (TSQA) demands the effective utilization of\nspecific temporal contexts, encompassing multiple time-evolving facts, to\naddress time-sensitive questions. This necessitates not only the parsing of\ntemporal information within questions but also the identification and\nunderstanding of time-evolving facts to generate accurate answers. However,\ncurrent large language models still have limited sensitivity to temporal\ninformation and their inadequate temporal reasoning capabilities.In this paper,\nwe propose a novel framework that enhances temporal awareness and reasoning\nthrough Temporal Information-Aware Embedding and Granular Contrastive\nReinforcement Learning. Experimental results on four TSQA datasets demonstrate\nthat our framework significantly outperforms existing LLMs in TSQA tasks,\nmarking a step forward in bridging the performance gap between machine and\nhuman temporal understanding and reasoning.", "paper_summary_zh": "時敏問題解答 (TSQA) 要求有效利用特定時間背景，包含多重時間演化事實，來回答時敏問題。這不僅需要解析問題中的時間資訊，也需要識別和理解時間演化事實，以產生準確的答案。然而，目前的巨量語言模型對於時間資訊的敏感度仍然有限，且其時間推理能力不足。在本文中，我們提出一個創新的框架，透過時間資訊感知嵌入和細粒對比強化學習來增強時間感知和推理。在四個 TSQA 資料集上的實驗結果顯示，我們的框架在 TSQA 任務中顯著優於現有的 LLM，標誌著在機器和人類時間理解與推理之間的效能差距中向前邁進一步。", "author": "Wanqi Yang et.al.", "authors": "Wanqi Yang, Yanda Li, Meng Fang, Ling Chen", "id": "2409.16909v1", "paper_url": "http://arxiv.org/abs/2409.16909v1", "repo": "null"}}