{"2406.04670": {"publish_time": "2024-06-07", "title": "MATTER: Memory-Augmented Transformer Using Heterogeneous Knowledge Sources", "paper_summary": "Leveraging external knowledge is crucial for achieving high performance in\nknowledge-intensive tasks, such as question answering. The retrieve-and-read\napproach is widely adopted for integrating external knowledge into a language\nmodel. However, this approach suffers from increased computational cost and\nlatency due to the long context length, which grows proportionally with the\nnumber of retrieved knowledge. Furthermore, existing retrieval-augmented models\ntypically retrieve information from a single type of knowledge source, limiting\ntheir scalability to diverse knowledge sources with varying structures. In this\nwork, we introduce an efficient memory-augmented transformer called MATTER,\ndesigned to retrieve relevant knowledge from multiple heterogeneous knowledge\nsources. Specifically, our model retrieves and reads from both unstructured\nsources (paragraphs) and semi-structured sources (QA pairs) in the form of\nfixed-length neural memories. We demonstrate that our model outperforms\nexisting efficient retrieval-augmented models on popular QA benchmarks in terms\nof both accuracy and speed. Furthermore, MATTER achieves competitive results\ncompared to conventional read-and-retrieve models while having 100x throughput\nduring inference.", "paper_summary_zh": "利用外部知識對於在知識密集型任務（例如問答）中取得高性能至關重要。擷取並讀取的方法廣泛用於將外部知識整合到語言模型中。然而，由於長篇的內容長度（會隨著擷取知識的數量成正比增加），這種方法會造成運算成本和延遲增加。此外，現有的擷取增強模型通常會從單一類型的知識來源擷取資訊，這會限制其擴充到具有不同結構的各種知識來源。在這項工作中，我們引進了一種稱為 MATTER 的高效記憶體增強Transformer，旨在從多個異質知識來源中擷取相關知識。具體來說，我們的模型會從非結構化來源（段落）和半結構化來源（問答配對）中擷取並讀取固定長度的神經記憶體。我們證明了我們的模型在準確度和速度方面都優於現有的高效擷取增強模型，且表現優於熱門的問答基準。此外，MATTER 與傳統的讀取和擷取模型相比，在推論期間具有 100 倍的處理量，同時達到了具有競爭力的結果。", "author": "Dongkyu Lee et.al.", "authors": "Dongkyu Lee, Chandana Satya Prakash, Jack FitzGerald, Jens Lehmann", "id": "2406.04670v1", "paper_url": "http://arxiv.org/abs/2406.04670v1", "repo": "null"}}