{"2501.06831": {"publish_time": "2025-01-12", "title": "Towards Counterfactual and Contrastive Explainability and Transparency of DCNN Image Classifiers", "paper_summary": "Explainability of deep convolutional neural networks (DCNNs) is an important\nresearch topic that tries to uncover the reasons behind a DCNN model's\ndecisions and improve their understanding and reliability in high-risk\nenvironments. In this regard, we propose a novel method for generating\ninterpretable counterfactual and contrastive explanations for DCNN models. The\nproposed method is model intrusive that probes the internal workings of a DCNN\ninstead of altering the input image to generate explanations. Given an input\nimage, we provide contrastive explanations by identifying the most important\nfilters in the DCNN representing features and concepts that separate the\nmodel's decision between classifying the image to the original inferred class\nor some other specified alter class. On the other hand, we provide\ncounterfactual explanations by specifying the minimal changes necessary in such\nfilters so that a contrastive output is obtained.\n  Using these identified filters and concepts, our method can provide\ncontrastive and counterfactual reasons behind a model's decisions and makes the\nmodel more transparent. One of the interesting applications of this method is\nmisclassification analysis, where we compare the identified concepts from a\nparticular input image and compare them with class-specific concepts to\nestablish the validity of the model's decisions. The proposed method is\ncompared with state-of-the-art and evaluated on the Caltech-UCSD Birds (CUB)\n2011 dataset to show the usefulness of the explanations provided.", "paper_summary_zh": "深度卷積神經網路 (DCNN) 的可解釋性是一個重要的研究主題，它試圖揭開 DCNN 模型決策背後的原因，並提高它們在高風險環境中的理解度和可靠性。在這方面，我們提出了一種新的方法，用於為 DCNN 模型生成可解釋的反事實和對比解釋。所提出的方法是模型侵入性的，它探測 DCNN 的內部運作，而不是改變輸入影像來生成解釋。給定一個輸入影像，我們通過識別 DCNN 中表示特徵和概念的最重要過濾器來提供對比解釋，這些特徵和概念區分了模型在將影像分類到原始推斷類別或其他一些指定替換類別之間的決策。另一方面，我們通過指定此類過濾器中必要的最小變更來提供反事實解釋，以便獲得對比輸出。使用這些識別的過濾器和概念，我們的方法可以提供模型決策背後對比和反事實的原因，並使模型更透明。此方法的其中一個有趣應用是錯誤分類分析，在其中我們比較從特定輸入影像識別的概念，並將它們與類別特定概念進行比較，以建立模型決策的有效性。將所提出的方法與最先進的方法進行比較，並在 Caltech-UCSD Birds (CUB) 2011 資料集上進行評估，以顯示所提供解釋的效用。", "author": "Syed Ali Tariq et.al.", "authors": "Syed Ali Tariq, Tehseen Zia, Mubeen Ghafoor", "id": "2501.06831v1", "paper_url": "http://arxiv.org/abs/2501.06831v1", "repo": "null"}}