{"2409.18764": {"publish_time": "2024-09-27", "title": "Charting the Future: Using Chart Question-Answering for Scalable Evaluation of LLM-Driven Data Visualizations", "paper_summary": "We propose a novel framework that leverages Visual Question Answering (VQA)\nmodels to automate the evaluation of LLM-generated data visualizations.\nTraditional evaluation methods often rely on human judgment, which is costly\nand unscalable, or focus solely on data accuracy, neglecting the effectiveness\nof visual communication. By employing VQA models, we assess data representation\nquality and the general communicative clarity of charts. Experiments were\nconducted using two leading VQA benchmark datasets, ChartQA and PlotQA, with\nvisualizations generated by OpenAI's GPT-3.5 Turbo and Meta's Llama 3.1\n70B-Instruct models. Our results indicate that LLM-generated charts do not\nmatch the accuracy of the original non-LLM-generated charts based on VQA\nperformance measures. Moreover, while our results demonstrate that few-shot\nprompting significantly boosts the accuracy of chart generation, considerable\nprogress remains to be made before LLMs can fully match the precision of\nhuman-generated graphs. This underscores the importance of our work, which\nexpedites the research process by enabling rapid iteration without the need for\nhuman annotation, thus accelerating advancements in this field.", "paper_summary_zh": "我們提出了一個新穎的框架，它利用視覺問答 (VQA) 模型來自動化 LLM 生成的資料視覺化的評估。傳統的評估方法通常依賴於人工判斷，這既昂貴又不具可擴展性，或者僅關注資料準確性，而忽略了視覺溝通的有效性。透過使用 VQA 模型，我們評估資料表示品質和圖表的整體溝通清晰度。實驗使用兩個領先的 VQA 基準資料集，ChartQA 和 PlotQA，以及由 OpenAI 的 GPT-3.5 Turbo 和 Meta 的 Llama 3.1 70B-Instruct 模型生成的視覺化。我們的結果表明，根據 VQA 效能指標，LLM 生成的圖表無法比得上原始非 LLM 生成的圖表準確性。此外，儘管我們的結果證明，少次提示顯著提升了圖表生成的準確性，但在 LLM 能完全比得上人工生成的圖表的精準度之前，仍有相當大的進步空間。這突顯了我們工作的價值，它透過無需人工標註來加快反覆運算，從而加速此領域的進展。", "author": "James Ford et.al.", "authors": "James Ford, Xingmeng Zhao, Dan Schumacher, Anthony Rios", "id": "2409.18764v1", "paper_url": "http://arxiv.org/abs/2409.18764v1", "repo": "null"}}