{"2410.23262": {"publish_time": "2024-10-30", "title": "EMMA: End-to-End Multimodal Model for Autonomous Driving", "paper_summary": "We introduce EMMA, an End-to-end Multimodal Model for Autonomous driving.\nBuilt on a multi-modal large language model foundation, EMMA directly maps raw\ncamera sensor data into various driving-specific outputs, including planner\ntrajectories, perception objects, and road graph elements. EMMA maximizes the\nutility of world knowledge from the pre-trained large language models, by\nrepresenting all non-sensor inputs (e.g. navigation instructions and ego\nvehicle status) and outputs (e.g. trajectories and 3D locations) as natural\nlanguage text. This approach allows EMMA to jointly process various driving\ntasks in a unified language space, and generate the outputs for each task using\ntask-specific prompts. Empirically, we demonstrate EMMA's effectiveness by\nachieving state-of-the-art performance in motion planning on nuScenes as well\nas competitive results on the Waymo Open Motion Dataset (WOMD). EMMA also\nyields competitive results for camera-primary 3D object detection on the Waymo\nOpen Dataset (WOD). We show that co-training EMMA with planner trajectories,\nobject detection, and road graph tasks yields improvements across all three\ndomains, highlighting EMMA's potential as a generalist model for autonomous\ndriving applications. However, EMMA also exhibits certain limitations: it can\nprocess only a small amount of image frames, does not incorporate accurate 3D\nsensing modalities like LiDAR or radar and is computationally expensive. We\nhope that our results will inspire further research to mitigate these issues\nand to further evolve the state of the art in autonomous driving model\narchitectures.", "paper_summary_zh": "<paragraph>我們介紹 EMMA，一種用於自動駕駛的端到端多模態模型。\n建立在多模態大型語言模型基礎上，EMMA 直接將原始\n相機感測器資料對應到各種特定於駕駛的輸出，包括規劃器\n軌跡、感知物件和道路圖形元素。EMMA 透過\n將所有非感測器輸入（例如導航指示和自我\n車輛狀態）和輸出（例如軌跡和 3D 位置）表示為自然\n語言文字，最大化預訓練大型語言模型的世界知識效用。這種方法讓 EMMA 能夠在統一的語言空間中共同處理各種駕駛\n任務，並使用特定於任務的提示產生每個任務的輸出。根據經驗，我們透過\n在 nuScenes 上實現運動規劃的最新效能，以及在 Waymo Open Motion Dataset (WOMD) 上獲得競爭力結果，來證明 EMMA 的有效性。EMMA 也\n在 Waymo Open Dataset (WOD) 上產生了相機優先 3D 物件偵測的競爭力結果。我們展示了使用規劃器軌跡、\n物件偵測和道路圖形任務共同訓練 EMMA，會在所有三個\n領域中產生改進，突顯了 EMMA 作為自動駕駛應用程式通用模型的潛力。然而，EMMA 也展現出某些限制：它只能\n處理少量影像幀，不整合準確的 3D 感測模式（例如 LiDAR 或雷達），而且計算成本高昂。我們\n希望我們的結果能激勵進一步的研究，以減輕這些問題，並進一步發展自動駕駛模型\n架構的最新技術。</paragraph>", "author": "Jyh-Jing Hwang et.al.", "authors": "Jyh-Jing Hwang, Runsheng Xu, Hubert Lin, Wei-Chih Hung, Jingwei Ji, Kristy Choi, Di Huang, Tong He, Paul Covington, Benjamin Sapp, James Guo, Dragomir Anguelov, Mingxing Tan", "id": "2410.23262v1", "paper_url": "http://arxiv.org/abs/2410.23262v1", "repo": "null"}}