{"2410.17961": {"publish_time": "2024-10-23", "title": "Closed-form merging of parameter-efficient modules for Federated Continual Learning", "paper_summary": "Model merging has emerged as a crucial technique in Deep Learning, enabling\nthe integration of multiple models into a unified system while preserving\nperformance and scalability. In this respect, the compositional properties of\nlow-rank adaptation techniques (e.g., LoRA) have proven beneficial, as simple\naveraging LoRA modules yields a single model that mostly integrates the\ncapabilities of all individual modules. Building on LoRA, we take a step\nfurther by imposing that the merged model matches the responses of all learned\nmodules. Solving this objective in closed form yields an indeterminate system\nwith A and B as unknown variables, indicating the existence of infinitely many\nclosed-form solutions. To address this challenge, we introduce LoRM, an\nalternating optimization strategy that trains one LoRA matrix at a time. This\nallows solving for each unknown variable individually, thus finding a unique\nsolution. We apply our proposed methodology to Federated Class-Incremental\nLearning (FCIL), ensuring alignment of model responses both between clients and\nacross tasks. Our method demonstrates state-of-the-art performance across a\nrange of FCIL scenarios.", "paper_summary_zh": "模型合併已成為深度學習中的一項關鍵技術，它能將多個模型整合到一個統一的系統中，同時保留效能和可擴充性。在此方面，低秩適應技術（例如 LoRA）的組合特性已被證明是有益的，因為簡單地平均 LoRA 模組會產生一個單一模型，該模型大多整合了所有個別模組的功能。在 LoRA 的基礎上，我們進一步採取措施，強制合併模型與所有學習模組的回應相符。以封閉形式解決此目標會產生一個不確定的系統，其中 A 和 B 是未知變數，這表示存在無限多個封閉形式解。為了應對這個挑戰，我們引入了 LoRM，這是一個交替最佳化策略，一次訓練一個 LoRA 矩陣。這允許個別求解每個未知變數，從而找到一個唯一的解。我們將我們提出的方法應用於聯合類別增量學習 (FCIL)，確保模型回應在客戶端和任務之間的一致性。我們的模型在各種 FCIL 場景中展現了最先進的效能。", "author": "Riccardo Salami et.al.", "authors": "Riccardo Salami, Pietro Buzzega, Matteo Mosconi, Jacopo Bonato, Luigi Sabetta, Simone Calderara", "id": "2410.17961v1", "paper_url": "http://arxiv.org/abs/2410.17961v1", "repo": "null"}}