{"2412.19755": {"publish_time": "2024-12-27", "title": "\"Did my figure do justice to the answer?\" : Towards Multimodal Short Answer Grading with Feedback (MMSAF)", "paper_summary": "Personalized feedback plays a vital role in a student's learning process.\nWhile existing systems are adept at providing feedback over MCQ-based\nevaluation, this work focuses more on subjective and open-ended questions,\nwhich is similar to the problem of Automatic Short Answer Grading (ASAG) with\nfeedback. Additionally, we introduce the Multimodal Short Answer grading with\nFeedback (MMSAF) problem over the traditional ASAG feedback problem to address\nthe scenario where the student answer and reference answer might contain\nimages. Moreover, we introduce the MMSAF dataset with 2197 data points along\nwith an automated framework for generating such data sets. Our evaluations on\nexisting LLMs over this dataset achieved an overall accuracy of 55\\% on Level\nof Correctness labels, 75\\% on Image Relevance labels and a score of 4.27 out\nof 5 in correctness level of LLM generated feedback as rated by experts. As per\nexperts, Pixtral achieved a rating of above 4 out of all metrics, indicating\nthat it is more aligned to human judgement, and that it is the best solution\nfor assisting students.", "paper_summary_zh": "個人化回饋在學生的學習過程中扮演著至關重要的角色。\n現有的系統擅長提供基於多選題的評量回饋，而本研究更專注於主觀且開放式的問題，這類似於帶有回饋的自動簡答評分 (ASAG) 問題。此外，我們在傳統的 ASAG 回饋問題中引入了多模態簡答評分與回饋 (MMSAF) 問題，以解決學生答案和參考答案可能包含圖片的情況。此外，我們引入了包含 2197 個資料點的 MMSAF 資料集，以及用於產生此類資料集的自動化架構。我們對此資料集上現有的 LLM 進行評估，在正確性標籤上達到了 55% 的整體準確度，在圖片相關性標籤上達到了 75%，而專家評估的 LLM 產生的回饋在正確性層級上獲得了 5 分中的 4.27 分。根據專家的說法，Pixtral 在所有指標上都獲得了 4 分以上的評分，這表示它更符合人類的判斷，並且是協助學生的最佳解決方案。", "author": "Pritam Sil et.al.", "authors": "Pritam Sil, Bhaskaran Raman, Pushpak Bhattacharyya", "id": "2412.19755v1", "paper_url": "http://arxiv.org/abs/2412.19755v1", "repo": "null"}}