{"2410.18906": {"publish_time": "2024-10-24", "title": "PRISM: A Methodology for Auditing Biases in Large Language Models", "paper_summary": "Auditing Large Language Models (LLMs) to discover their biases and\npreferences is an emerging challenge in creating Responsible Artificial\nIntelligence (AI). While various methods have been proposed to elicit the\npreferences of such models, countermeasures have been taken by LLM trainers,\nsuch that LLMs hide, obfuscate or point blank refuse to disclosure their\npositions on certain subjects. This paper presents PRISM, a flexible,\ninquiry-based methodology for auditing LLMs - that seeks to illicit such\npositions indirectly through task-based inquiry prompting rather than direct\ninquiry of said preferences. To demonstrate the utility of the methodology, we\napplied PRISM on the Political Compass Test, where we assessed the political\nleanings of twenty-one LLMs from seven providers. We show LLMs, by default,\nespouse positions that are economically left and socially liberal (consistent\nwith prior work). We also show the space of positions that these models are\nwilling to espouse - where some models are more constrained and less compliant\nthan others - while others are more neutral and objective. In sum, PRISM can\nmore reliably probe and audit LLMs to understand their preferences, biases and\nconstraints.", "paper_summary_zh": "審核大型語言模型 (LLM) 以找出其偏見和偏好，是創造負責任的人工智慧 (AI) 的新挑戰。雖然已提出各種方法來引出此類模型的偏好，但 LLM 訓練師已採取對策，讓 LLM 隱藏、混淆或直接拒絕披露其對某些主題的立場。本文提出 PRISM，一種靈活的、基於探詢的方法論，用於審核 LLM，它試圖透過基於任務的探詢提示間接引出此類立場，而不是直接探詢所述偏好。為了展示此方法論的效用，我們在政治羅盤測驗中應用 PRISM，我們評估了七家供應商的 21 個 LLM 的政治傾向。我們顯示 LLM 預設採用經濟左傾和社會自由的立場（與先前的研究一致）。我們還顯示了這些模型願意採用的立場空間，其中一些模型比其他模型更受約束且更不符合，而另一些模型則更中立和客觀。總之，PRISM 可以更可靠地探測和審核 LLM，以了解其偏好、偏見和約束。", "author": "Leif Azzopardi et.al.", "authors": "Leif Azzopardi, Yashar Moshfeghi", "id": "2410.18906v1", "paper_url": "http://arxiv.org/abs/2410.18906v1", "repo": "https://github.com/cis-phawm/prism"}}