{"2406.17642": {"publish_time": "2024-06-25", "title": "Banishing LLM Hallucinations Requires Rethinking Generalization", "paper_summary": "Despite their powerful chat, coding, and reasoning abilities, Large Language\nModels (LLMs) frequently hallucinate. Conventional wisdom suggests that\nhallucinations are a consequence of a balance between creativity and\nfactuality, which can be mitigated, but not eliminated, by grounding the LLM in\nexternal knowledge sources. Through extensive systematic experiments, we show\nthat these traditional approaches fail to explain why LLMs hallucinate in\npractice. Specifically, we show that LLMs augmented with a massive Mixture of\nMemory Experts (MoME) can easily memorize large datasets of random numbers. We\ncorroborate these experimental findings with a theoretical construction showing\nthat simple neural networks trained to predict the next token hallucinate when\nthe training loss is above a threshold as it usually does in practice when\ntraining on internet scale data. We interpret our findings by comparing against\ntraditional retrieval methods for mitigating hallucinations. We use our\nfindings to design a first generation model for removing hallucinations --\nLamini-1 -- that stores facts in a massive mixture of millions of memory\nexperts that are retrieved dynamically.", "paper_summary_zh": "儘管擁有強大的聊天、編碼和推理能力，大型語言模型 (LLM) 經常會出現幻覺。傳統智慧認為幻覺是創造力和事實性之間平衡的結果，這種平衡可以透過將 LLM 基於外部知識來源來減輕，但無法消除。透過廣泛的系統性實驗，我們證明這些傳統方法無法解釋為什麼 LLM 在實務中會出現幻覺。具體來說，我們證明了透過大量記憶專家混合 (MoME) 增強的 LLM 可以輕鬆記住大量隨機數字的資料集。我們用一個理論建構來證實這些實驗發現，證明訓練來預測下一個標記的簡單神經網路會在訓練損失高於閾值時出現幻覺，這通常會在訓練網路規模資料時發生。我們透過與傳統的擷取方法進行比較來詮釋我們的發現，以減輕幻覺。我們利用我們的發現設計了一個第一代模型來移除幻覺 -- Lamini-1 -- 它會將事實儲存在數百萬個記憶專家的龐大混合中，並會動態擷取這些事實。", "author": "Johnny Li et.al.", "authors": "Johnny Li, Saksham Consul, Eda Zhou, James Wong, Naila Farooqui, Yuxin Ye, Nithyashree Manohar, Zhuxiaona Wei, Tian Wu, Ben Echols, Sharon Zhou, Gregory Diamos", "id": "2406.17642v1", "paper_url": "http://arxiv.org/abs/2406.17642v1", "repo": "null"}}