{"2409.02549": {"publish_time": "2024-09-04", "title": "A Sequential Decision-Making Model for Perimeter Identification", "paper_summary": "Perimeter identification involves ascertaining the boundaries of a designated\narea or zone, requiring traffic flow monitoring, control, or optimization.\nVarious methodologies and technologies exist for accurately defining these\nperimeters; however, they often necessitate specialized equipment, precise\nmapping, or comprehensive data for effective problem delineation. In this\nstudy, we propose a sequential decision-making framework for perimeter search,\ndesigned to operate efficiently in real-time and require only publicly\naccessible information. We conceptualize the perimeter search as a game between\na playing agent and an artificial environment, where the agent's objective is\nto identify the optimal perimeter by sequentially improving the current\nperimeter. We detail the model for the game and discuss its adaptability in\ndetermining the definition of an optimal perimeter. Ultimately, we showcase the\nmodel's efficacy through a real-world scenario, highlighting the identification\nof corresponding optimal perimeters.", "paper_summary_zh": "周界辨識涉及確定指定區域或區域的邊界，需要交通流量監控、控制或最佳化。\n存在各種方法和技術來準確定義這些周界；然而，它們通常需要專業設備、精確對應或綜合資料才能有效描繪問題。在本研究中，我們提出了一個用於周界搜尋的循序決策制定架構，旨在實時高效運作，且僅需要公開可用的資訊。我們將周界搜尋概念化為一個玩家和人工環境之間的遊戲，其中玩家的目標是透過循序改善當前周界來識別最佳周界。我們詳細說明遊戲模型，並討論其在確定最佳周界定義方面的適應性。最後，我們透過真實世界的場景展示模型的效能，重點說明對應最佳周界的識別。", "author": "Ayal Taitler et.al.", "authors": "Ayal Taitler", "id": "2409.02549v1", "paper_url": "http://arxiv.org/abs/2409.02549v1", "repo": "null"}}