{"2405.11143": {"publish_time": "2024-05-20", "title": "OpenRLHF: An Easy-to-use, Scalable and High-performance RLHF Framework", "paper_summary": "As large language models (LLMs) continue to grow by scaling laws,\nreinforcement learning from human feedback (RLHF) has gained significant\nattention due to its outstanding performance. However, unlike pretraining or\nfine-tuning a single model, scaling reinforcement learning from human feedback\n(RLHF) for training large language models poses coordination challenges across\nfour models. We present OpenRLHF, an open-source framework enabling efficient\nRLHF scaling. Unlike existing RLHF frameworks that co-locate four models on the\nsame GPUs, OpenRLHF re-designs scheduling for the models beyond 70B parameters\nusing Ray, vLLM, and DeepSpeed, leveraging improved resource utilization and\ndiverse training approaches. Integrating seamlessly with Hugging Face, OpenRLHF\nprovides an out-of-the-box solution with optimized algorithms and launch\nscripts, which ensures user-friendliness. OpenRLHF implements RLHF, DPO,\nrejection sampling, and other alignment techniques. Empowering state-of-the-art\nLLM development, OpenRLHF's code is available at\nhttps://github.com/OpenLLMAI/OpenRLHF.", "paper_summary_zh": "隨著大型語言模型 (LLM) 繼續透過規模法則成長，\n從人類回饋中進行強化學習 (RLHF) 因為其傑出的表現而受到廣泛關注。\n然而，與預訓練或微調單一模型不同，針對大型語言模型訓練而從人類回饋中進行強化學習 (RLHF) 會在四個模型間造成協調上的挑戰。我們提出 OpenRLHF，一個開放原始碼架構，可實現高效能的 RLHF 擴充。與將四個模型共置於同一 GPU 上的現有 RLHF 架構不同，OpenRLHF 透過 Ray、vLLM 和 DeepSpeed 重新設計超過 70B 參數的模型排程，善用改善的資源利用率和多樣化的訓練方法。OpenRLHF 與 Hugging Face 無縫整合，提供開箱即用的解決方案，包含最佳化演算法和啟動指令碼，確保使用者友善。OpenRLHF 實作 RLHF、DPO、拒絕採樣和其他對齊技術。OpenRLHF 的程式碼賦能最先進的 LLM 開發，可於 https://github.com/OpenLLMAI/OpenRLHF 取得。", "author": "Jian Hu et.al.", "authors": "Jian Hu, Xibin Wu, Weixun Wang, Xianyu, Dehao Zhang, Yu Cao", "id": "2405.11143v1", "paper_url": "http://arxiv.org/abs/2405.11143v1", "repo": "https://github.com/OpenLLMAI/OpenRLHF"}}