{"2406.09994": {"publish_time": "2024-06-14", "title": "Precision Empowers, Excess Distracts: Visual Question Answering With Dynamically Infused Knowledge In Language Models", "paper_summary": "In the realm of multimodal tasks, Visual Question Answering (VQA) plays a\ncrucial role by addressing natural language questions grounded in visual\ncontent. Knowledge-Based Visual Question Answering (KBVQA) advances this\nconcept by adding external knowledge along with images to respond to questions.\nWe introduce an approach for KBVQA, augmenting the existing vision-language\ntransformer encoder-decoder (OFA) model. Our main contribution involves\nenhancing questions by incorporating relevant external knowledge extracted from\nknowledge graphs, using a dynamic triple extraction method. We supply a\nflexible number of triples from the knowledge graph as context, tailored to\nmeet the requirements for answering the question. Our model, enriched with\nknowledge, demonstrates an average improvement of 4.75\\% in Exact Match Score\nover the state-of-the-art on three different KBVQA datasets. Through\nexperiments and analysis, we demonstrate that furnishing variable triples for\neach question improves the reasoning capabilities of the language model in\ncontrast to supplying a fixed number of triples. This is illustrated even for\nrecent large language models. Additionally, we highlight the model's\ngeneralization capability by showcasing its SOTA-beating performance on a small\ndataset, achieved through straightforward fine-tuning.", "paper_summary_zh": "在多模态任务领域，视觉问答（VQA）通过解决基于视觉内容的自然语言问题，扮演着至关重要的角色。基于知识的视觉问答（KBVQA）通过添加外部知识以及图像来回答问题，从而推进了这一概念。我们引入了一种用于 KBVQA 的方法，增强了现有的视觉语言 transformer 编码器解码器 (OFA) 模型。我们的主要贡献涉及通过使用动态三元组提取方法，整合从知识图谱中提取的相关外部知识来增强问题。我们提供来自知识图谱的灵活数量的三元组作为上下文，以满足回答问题的要求。我们经过知识丰富的模型在三个不同的 KBVQA 数据集上，在精确匹配分数方面展示了比最先进水平平均提高 4.75%。通过实验和分析，我们证明为每个问题提供可变三元组提高了语言模型的推理能力，这与提供固定数量的三元组形成对比。即使对于最近的大型语言模型，这一点也得到了说明。此外，我们通过展示模型在小型数据集上的 SOTA 击败性能，突出了模型的泛化能力，这是通过直接微调实现的。", "author": "Manas Jhalani et.al.", "authors": "Manas Jhalani, Annervaz K M, Pushpak Bhattacharyya", "id": "2406.09994v1", "paper_url": "http://arxiv.org/abs/2406.09994v1", "repo": "null"}}