{"2408.05599": {"publish_time": "2024-08-10", "title": "Sequential Representation Learning via Static-Dynamic Conditional Disentanglement", "paper_summary": "This paper explores self-supervised disentangled representation learning\nwithin sequential data, focusing on separating time-independent and\ntime-varying factors in videos. We propose a new model that breaks the usual\nindependence assumption between those factors by explicitly accounting for the\ncausal relationship between the static/dynamic variables and that improves the\nmodel expressivity through additional Normalizing Flows. A formal definition of\nthe factors is proposed. This formalism leads to the derivation of sufficient\nconditions for the ground truth factors to be identifiable, and to the\nintroduction of a novel theoretically grounded disentanglement constraint that\ncan be directly and efficiently incorporated into our new framework. The\nexperiments show that the proposed approach outperforms previous complex\nstate-of-the-art techniques in scenarios where the dynamics of a scene are\ninfluenced by its content.", "paper_summary_zh": "本文探討了序列資料中的自我監督解糾纏表徵學習，專注於分離影片中的時間無關和時間變異因子。我們提出一個新的模型，透過明確考量靜態/動態變數之間的因果關係，打破了這些因子之間通常的獨立假設，並透過額外的正規化流改善模型表達能力。本文提出了這些因子的正式定義。這種形式主義導致推導出基本真相因子可識別的充分條件，並引入一個新的理論基礎解糾纏約束，可以直接有效地整合到我們的新架構中。實驗顯示，在場景動態受其內容影響的情況下，所提出的方法優於先前的複雜最先進技術。", "author": "Mathieu Cyrille Simon et.al.", "authors": "Mathieu Cyrille Simon, Pascal Frossard, Christophe De Vleeschouwer", "id": "2408.05599v1", "paper_url": "http://arxiv.org/abs/2408.05599v1", "repo": "null"}}