{"2405.06541": {"publish_time": "2024-05-10", "title": "ATSumm: Auxiliary information enhanced approach for abstractive disaster Tweet Summarization with sparse training data", "paper_summary": "The abundance of situational information on Twitter poses a challenge for\nusers to manually discern vital and relevant information during disasters. A\nconcise and human-interpretable overview of this information helps\ndecision-makers in implementing efficient and quick disaster response. Existing\nabstractive summarization approaches can be categorized as sentence-based or\nkey-phrase-based approaches. This paper focuses on sentence-based approach,\nwhich is typically implemented as a dual-phase procedure in literature. The\ninitial phase, known as the extractive phase, involves identifying the most\nrelevant tweets. The subsequent phase, referred to as the abstractive phase,\nentails generating a more human-interpretable summary. In this study, we adopt\nthe methodology from prior research for the extractive phase. For the\nabstractive phase of summarization, most existing approaches employ deep\nlearning-based frameworks, which can either be pre-trained or require training\nfrom scratch. However, to achieve the appropriate level of performance, it is\nimperative to have substantial training data for both methods, which is not\nreadily available. This work presents an Abstractive Tweet Summarizer (ATSumm)\nthat effectively addresses the issue of data sparsity by using auxiliary\ninformation. We introduced the Auxiliary Pointer Generator Network (AuxPGN)\nmodel, which utilizes a unique attention mechanism called Key-phrase attention.\nThis attention mechanism incorporates auxiliary information in the form of\nkey-phrases and their corresponding importance scores from the input tweets. We\nevaluate the proposed approach by comparing it with 10 state-of-the-art\napproaches across 13 disaster datasets. The evaluation results indicate that\nATSumm achieves superior performance compared to state-of-the-art approaches,\nwith improvement of 4-80% in ROUGE-N F1-score.", "paper_summary_zh": "<paragraph>Twitter 上豐富的情境資訊對使用者來說，在災害期間手動辨別重要且相關資訊是一項挑戰。簡潔且人類可解讀的資訊總覽有助於決策者執行有效且快速的災害應變。現有的抽象摘要方法可以分類為基於句子或基於關鍵字組的方法。本文專注於基於句子的方法，這通常在文獻中實作為雙階段程序。第一階段，稱為萃取階段，涉及識別最相關的推文。後續階段，稱為抽象階段，需要產生更具人類可解讀性的摘要。在本研究中，我們採用先前的研究方法進行萃取階段。對於摘要階段，大多數現有方法採用基於深度學習的架構，這些架構可以經過預先訓練或需要從頭開始訓練。然而，為了達到適當的效能水準，這兩種方法都需要大量的訓練資料，而這並不容易取得。這項工作提出了一個抽象推文摘要器 (ATSumm)，它透過使用輔助資訊有效地解決資料稀疏的問題。我們引入了輔助指標產生器網路 (AuxPGN) 模型，它利用一種稱為關鍵字組注意力的獨特注意力機制。這種注意力機制以關鍵字組的形式納入輔助資訊，以及來自輸入推文的對應重要性分數。我們透過將提出的方法與 13 個災害資料集中的 10 種最先進的方法進行比較來評估。評估結果表明，與最先進的方法相比，ATSumm 取得了卓越的效能，ROUGE-N F1 分數提高了 4-80%。</paragraph>", "author": "Piyush Kumar Garg et.al.", "authors": "Piyush Kumar Garg, Roshni Chakraborty, Sourav Kumar Dandapat", "id": "2405.06541v1", "paper_url": "http://arxiv.org/abs/2405.06541v1", "repo": "null"}}