{"2409.02291": {"publish_time": "2024-09-03", "title": "Initial Development and Evaluation of the Creative Artificial Intelligence through Recurring Developments and Determinations (CAIRDD) System", "paper_summary": "Computer system creativity is a key step on the pathway to artificial general\nintelligence (AGI). It is elusive, however, due to the fact that human\ncreativity is not fully understood and, thus, it is difficult to develop this\ncapability in software. Large language models (LLMs) provide a facsimile of\ncreativity and the appearance of sentience, while not actually being either\ncreative or sentient. While LLMs have created bona fide new content, in some\ncases - such as with harmful hallucinations - inadvertently, their deliberate\ncreativity is seen by some to not match that of humans. In response to this\nchallenge, this paper proposes a technique for enhancing LLM output creativity\nvia an iterative process of concept injection and refinement. Initial work on\nthe development of the Creative Artificial Intelligence through Recurring\nDevelopments and Determinations (CAIRDD) system is presented and the efficacy\nof key system components is evaluated.", "paper_summary_zh": "電腦系統的創造力是通往人工通用智慧 (AGI) 的關鍵一步。然而，由於人類的創造力尚未被完全理解，因此它難以捉摸，而且在軟體中開發這種能力也十分困難。大型語言模型 (LLM) 提供了創造力的複製品和知覺的表象，但實際上既不具創造力也不具知覺。雖然 LLM 在某些情況下（例如有害的幻覺）無意間創造了真正的全新內容，但有些人認為它們的刻意創造力無法與人類相提並論。為了應對這個挑戰，本文提出了一種透過概念注入和優化的反覆運算過程來增強 LLM 輸出創造力的技術。本文介紹了透過反覆開發和決策 (CAIRDD) 系統開發創造性人工智慧的初步工作，並評估了關鍵系統組件的效能。", "author": "Jeremy Straub et.al.", "authors": "Jeremy Straub, Zach Johnson", "id": "2409.02291v1", "paper_url": "http://arxiv.org/abs/2409.02291v1", "repo": "null"}}