{"2406.09076": {"publish_time": "2024-06-13", "title": "3M: Multi-modal Multi-task Multi-teacher Learning for Game Event Detection", "paper_summary": "Esports has rapidly emerged as a global phenomenon with an ever-expanding\naudience via platforms, like YouTube. Due to the inherent complexity nature of\nthe game, it is challenging for newcomers to comprehend what the event entails.\nThe chaotic nature of online chat, the fast-paced speech of the game\ncommentator, and the game-specific user interface further compound the\ndifficulty for users in comprehending the gameplay. To overcome these\nchallenges, it is crucial to integrate the Multi-Modal (MM) information from\nthe platform and understand the event. The paper introduces a new MM\nmulti-teacher-based game event detection framework, with the ultimate goal of\nconstructing a comprehensive framework that enhances the comprehension of the\nongoing game situation. While conventional MM models typically prioritise\naligning MM data through concurrent training towards a unified objective, our\nframework leverages multiple teachers trained independently on different tasks\nto accomplish the Game Event Detection. The experiment clearly shows the\neffectiveness of the proposed MM multi-teacher framework.", "paper_summary_zh": "電競已迅速成為一項全球現象，透過 YouTube 等平台不斷擴展其受眾。由於遊戲的複雜本質，對於新手來說，要理解事件的內容是一項挑戰。在線聊天的混亂性質、遊戲評論員的快速語速，以及特定於遊戲的使用者介面進一步加劇了使用者理解遊戲玩法的難度。為了克服這些挑戰，整合來自平台的多模態 (MM) 資訊並了解事件至關重要。本文介紹了一個新的 MM 多教師遊戲事件偵測架構，其最終目標是建構一個全面的架構，以增強對正在進行的遊戲情況的理解。雖然傳統的 MM 模型通常優先透過同時訓練統一目標來對齊 MM 資料，但我們的架構利用了在不同任務上獨立訓練的多個教師來完成遊戲事件偵測。實驗清楚顯示了所提出的 MM 多教師架構的有效性。", "author": "Thye Shan Ng et.al.", "authors": "Thye Shan Ng, Feiqi Cao, Soyeon Caren Han", "id": "2406.09076v1", "paper_url": "http://arxiv.org/abs/2406.09076v1", "repo": "null"}}