{"2409.03933": {"publish_time": "2024-09-05", "title": "A deep learning approach to wall-shear stress quantification: From numerical training to zero-shot experimental application", "paper_summary": "The accurate quantification of wall-shear stress dynamics is of substantial\nimportance for various applications in fundamental and applied research,\nspanning areas from human health to aircraft design and optimization. Despite\nsignificant progress in experimental measurement techniques and post-processing\nalgorithms, temporally resolved wall-shear stress dynamics with adequate\nspatial resolution and within a suitable spatial domain remain an elusive goal.\nTo address this gap, we introduce a deep learning architecture that ingests\nwall-parallel velocity fields from the logarithmic layer of turbulent\nwall-bounded flows and outputs the corresponding 2D wall-shear stress fields\nwith identical spatial resolution and domain size. From a physical perspective,\nour framework acts as a surrogate model encapsulating the various mechanisms\nthrough which highly energetic outer-layer flow structures influence the\ngoverning wall-shear stress dynamics. The network is trained in a supervised\nfashion on a unified dataset comprising direct numerical simulations of\nstatistically 1D turbulent channel and spatially developing turbulent boundary\nlayer flows at friction Reynolds numbers ranging from 390 to 1,500. We\ndemonstrate a zero-shot applicability to experimental velocity fields obtained\nfrom Particle-Image Velocimetry measurements and verify the physical accuracy\nof the wall-shear stress estimates with synchronized wall-shear stress\nmeasurements using the Micro-Pillar Shear-Stress Sensor for Reynolds numbers up\nto 2,000. In summary, the presented framework lays the groundwork for\nextracting inaccessible experimental wall-shear stress information from readily\navailable velocity measurements and thus, facilitates advancements in a variety\nof experimental applications.", "paper_summary_zh": "<paragraph>準確量化壁面剪應力動態對於基礎和應用研究中的各種應用具有實質性的重要性，涵蓋從人類健康到飛機設計和優化的領域。儘管在實驗測量技術和後處理演算法方面取得了顯著進展，但時間解析壁面剪應力動態仍具有足夠的空間解析度和在合適的空間域中仍然是一個難以捉摸的目標。為了解決這個差距，我們引入了一個深度學習架構，它從湍流壁面約束流的對數層中攝取壁面平行速度場，並輸出相應的 2D 壁面剪應力場，具有相同的空間解析度和域大小。從物理角度來看，我們的框架充當一個代理模型，概括了高能量外層流結構影響控制壁面剪應力動態的各種機制。該網路以監督方式在一個統一的數據集上進行訓練，該數據集包含統計 1D 湍流通道的直接數值模擬和空間發展的湍流邊界層流，摩擦雷諾數範圍從 390 到 1,500。我們展示了對從粒子影像測速測量中獲得的實驗速度場的零次應用，並使用微柱剪應力感測器對雷諾數最高 2,000 的同步壁面剪應力測量驗證了壁面剪應力估計的物理準確性。總之，所提出的框架為從容易獲得的速度測量中提取無法獲得的實驗壁面剪應力資訊奠定了基礎，從而促進了各種實驗應用中的進展。</paragraph>", "author": "Esther Lagemann et.al.", "authors": "Esther Lagemann, Julia Roeb, Steven L. Brunton, Christian Lagemann", "id": "2409.03933v1", "paper_url": "http://arxiv.org/abs/2409.03933v1", "repo": "null"}}