{"2412.15115": {"publish_time": "2024-12-19", "title": "Qwen2.5 Technical Report", "paper_summary": "In this report, we introduce Qwen2.5, a comprehensive series of large\nlanguage models (LLMs) designed to meet diverse needs. Compared to previous\niterations, Qwen 2.5 has been significantly improved during both the\npre-training and post-training stages. In terms of pre-training, we have scaled\nthe high-quality pre-training datasets from the previous 7 trillion tokens to\n18 trillion tokens. This provides a strong foundation for common sense, expert\nknowledge, and reasoning capabilities. In terms of post-training, we implement\nintricate supervised finetuning with over 1 million samples, as well as\nmultistage reinforcement learning. Post-training techniques enhance human\npreference, and notably improve long text generation, structural data analysis,\nand instruction following. To handle diverse and varied use cases effectively,\nwe present Qwen2.5 LLM series in rich sizes. Open-weight offerings include base\nand instruction-tuned models, with quantized versions available. In addition,\nfor hosted solutions, the proprietary models currently include two\nmixture-of-experts (MoE) variants: Qwen2.5-Turbo and Qwen2.5-Plus, both\navailable from Alibaba Cloud Model Studio. Qwen2.5 has demonstrated top-tier\nperformance on a wide range of benchmarks evaluating language understanding,\nreasoning, mathematics, coding, human preference alignment, etc. Specifically,\nthe open-weight flagship Qwen2.5-72B-Instruct outperforms a number of open and\nproprietary models and demonstrates competitive performance to the\nstate-of-the-art open-weight model, Llama-3-405B-Instruct, which is around 5\ntimes larger. Qwen2.5-Turbo and Qwen2.5-Plus offer superior cost-effectiveness\nwhile performing competitively against GPT-4o-mini and GPT-4o respectively.\nAdditionally, as the foundation, Qwen2.5 models have been instrumental in\ntraining specialized models such as Qwen2.5-Math, Qwen2.5-Coder, QwQ, and\nmultimodal models.", "paper_summary_zh": "<paragraph>在這份報告中，我們介紹了 Qwen2.5，這是一個全面的大語言模型 (LLM) 系列，旨在滿足不同的需求。與之前的迭代相比，Qwen 2.5 在預訓練和後訓練階段都得到了顯著改進。在預訓練方面，我們將高品質的預訓練數據集從之前的 7 兆個符號擴展到了 18 兆個符號。這為常識、專業知識和推理能力提供了堅實的基礎。在後訓練方面，我們實施了複雜的監督微調，樣本量超過 100 萬，以及多階段強化學習。後訓練技術增強了人類偏好，並顯著改進了長文本生成、結構化數據分析和指令遵循。為了有效地處理多樣化的用例，我們提供了豐富尺寸的 Qwen2.5 LLM 系列。開放權重產品包括基礎模型和指令調整模型，並提供量化版本。此外，對於託管解決方案，專有模型目前包括兩個混合專家 (MoE) 變體：Qwen2.5-Turbo 和 Qwen2.5-Plus，均可在阿里雲模型工作室獲得。Qwen2.5 在評估語言理解、推理、數學、編碼、人類偏好對齊等方面的一系列基準測試中展示了一流的性能。具體來說，開放權重旗艦 Qwen2.5-72B-Instruct 優於許多開放和專有模型，並展示了與最先進的開放權重模型 Llama-3-405B-Instruct 的競爭性能，後者大約大 5 倍。Qwen2.5-Turbo 和 Qwen2.5-Plus 分別提供優越的成本效益，同時與 GPT-4o-mini 和 GPT-4o 競爭。此外，作為基礎，Qwen2.5 模型在訓練 Qwen2.5-Math、Qwen2.5-Coder、QwQ 和多模態模型等專業模型方面發揮了重要作用。</paragraph>", "author": "Qwen et.al.", "authors": "Qwen, :, An Yang, Baosong Yang, Beichen Zhang, Binyuan Hui, Bo Zheng, Bowen Yu, Chengyuan Li, Dayiheng Liu, Fei Huang, Haoran Wei, Huan Lin, Jian Yang, Jianhong Tu, Jianwei Zhang, Jianxin Yang, Jiaxi Yang, Jingren Zhou, Junyang Lin, Kai Dang, Keming Lu, Keqin Bao, Kexin Yang, Le Yu, Mei Li, Mingfeng Xue, Pei Zhang, Qin Zhu, Rui Men, Runji Lin, Tianhao Li, Tingyu Xia, Xingzhang Ren, Xuancheng Ren, Yang Fan, Yang Su, Yichang Zhang, Yu Wan, Yuqiong Liu, Zeyu Cui, Zhenru Zhang, Zihan Qiu", "id": "2412.15115v1", "paper_url": "http://arxiv.org/abs/2412.15115v1", "repo": "null"}}