{"2410.21676": {"publish_time": "2024-10-29", "title": "How Does Critical Batch Size Scale in Pre-training?", "paper_summary": "Training large-scale models under given resources requires careful design of\nparallelism strategies. In particular, the efficiency notion of critical batch\nsize, concerning the compromise between time and compute, marks the threshold\nbeyond which greater data parallelism leads to diminishing returns. To\noperationalize it, we propose a measure of CBS and pre-train a series of\nauto-regressive language models, ranging from 85 million to 1.2 billion\nparameters, on the C4 dataset. Through extensive hyper-parameter sweeps and\ncareful control on factors such as batch size, momentum, and learning rate\nalong with its scheduling, we systematically investigate the impact of scale on\nCBS. Then we fit scaling laws with respect to model and data sizes to decouple\ntheir effects. Overall, our results demonstrate that CBS scales primarily with\ndata size rather than model size, a finding we justify theoretically through\nthe analysis of infinite-width limits of neural networks and\ninfinite-dimensional least squares regression. Of independent interest, we\nhighlight the importance of common hyper-parameter choices and strategies for\nstudying large-scale pre-training beyond fixed training durations.", "paper_summary_zh": "在既定資源下訓練大型模型需要仔細設計平行處理策略。特別是，關鍵批次大小的效率概念，涉及時間和運算之間的折衷，標誌著超越此臨界點後，更大的資料平行處理將導致報酬遞減。為了將其付諸實施，我們提出一個 CBS 量度，並預先訓練一系列自迴歸語言模型，範圍從 8500 萬到 12 億個參數，在 C4 資料集上。透過廣泛的超參數掃描和仔細控制批次大小、動量和學習率等因素以及其排程，我們系統性地研究規模對 CBS 的影響。然後，我們擬合關於模型和資料大小的縮放定律，以分離它們的影響。總體而言，我們的結果表明 CBS 主要隨著資料大小而不是模型大小而縮放，我們透過對神經網路的無限寬度限制和無限維最小二乘迴歸的分析，在理論上證明了這一發現。獨立的興趣是，我們強調了通用超參數選擇和策略的重要性，用於研究超越固定訓練持續時間的大規模預訓練。", "author": "Hanlin Zhang et.al.", "authors": "Hanlin Zhang, Depen Morwani, Nikhil Vyas, Jingfeng Wu, Difan Zou, Udaya Ghai, Dean Foster, Sham Kakade", "id": "2410.21676v1", "paper_url": "http://arxiv.org/abs/2410.21676v1", "repo": "null"}}