{"2405.07960": {"publish_time": "2024-05-13", "title": "AgentClinic: a multimodal agent benchmark to evaluate AI in simulated clinical environments", "paper_summary": "Diagnosing and managing a patient is a complex, sequential decision making\nprocess that requires physicians to obtain information -- such as which tests\nto perform -- and to act upon it. Recent advances in artificial intelligence\n(AI) and large language models (LLMs) promise to profoundly impact clinical\ncare. However, current evaluation schemes overrely on static medical\nquestion-answering benchmarks, falling short on interactive decision-making\nthat is required in real-life clinical work. Here, we present AgentClinic: a\nmultimodal benchmark to evaluate LLMs in their ability to operate as agents in\nsimulated clinical environments. In our benchmark, the doctor agent must\nuncover the patient's diagnosis through dialogue and active data collection. We\npresent two open benchmarks: a multimodal image and dialogue environment,\nAgentClinic-NEJM, and a dialogue-only environment, AgentClinic-MedQA. We embed\ncognitive and implicit biases both in patient and doctor agents to emulate\nrealistic interactions between biased agents. We find that introducing bias\nleads to large reductions in diagnostic accuracy of the doctor agents, as well\nas reduced compliance, confidence, and follow-up consultation willingness in\npatient agents. Evaluating a suite of state-of-the-art LLMs, we find that\nseveral models that excel in benchmarks like MedQA are performing poorly in\nAgentClinic-MedQA. We find that the LLM used in the patient agent is an\nimportant factor for performance in the AgentClinic benchmark. We show that\nboth having limited interactions as well as too many interaction reduces\ndiagnostic accuracy in doctor agents. The code and data for this work is\npublicly available at https://AgentClinic.github.io.", "paper_summary_zh": "診斷和管理病人是一個複雜、循序漸進的決策制定過程，需要醫生獲取資訊（例如要執行哪些測試）並採取行動。人工智慧 (AI) 和大型語言模型 (LLM) 的最新進展有望對臨床護理產生深遠影響。然而，目前的評估方案過於依賴靜態醫療問答基準，在現實生活中臨床工作中所需的互動決策制定方面有所不足。在此，我們提出 AgentClinic：一個多模態基準，用於評估 LLM 在模擬臨床環境中作為代理運作的能力。在我們的基準中，醫生代理必須透過對話和主動數據收集來找出病人的診斷。我們提出了兩個開放基準：一個多模態影像和對話環境 AgentClinic-NEJM，以及一個僅對話的環境 AgentClinic-MedQA。我們將認知和隱含偏見嵌入病人和醫生代理中，以模擬有偏見的代理之間的現實互動。我們發現，引入偏見會導致醫生代理的診斷準確性大幅下降，以及病人代理的順從性、信心和後續諮詢意願下降。在評估一系列最先進的 LLM 時，我們發現幾個在 MedQA 等基準中表現出色的模型在 AgentClinic-MedQA 中表現不佳。我們發現用於病人代理的 LLM 是 AgentClinic 基準中表現的關鍵因素。我們表明，互動次數受限和互動次數過多都會降低醫生代理的診斷準確性。這項工作的程式碼和數據已公開發布於 https://AgentClinic.github.io。", "author": "Samuel Schmidgall et.al.", "authors": "Samuel Schmidgall, Rojin Ziaei, Carl Harris, Eduardo Reis, Jeffrey Jopling, Michael Moor", "id": "2405.07960v1", "paper_url": "http://arxiv.org/abs/2405.07960v1", "repo": "null"}}