{"2409.18895": {"publish_time": "2024-09-27", "title": "Multi-Source Hard and Soft Information Fusion Approach for Accurate Cryptocurrency Price Movement Prediction", "paper_summary": "One of the most important challenges in the financial and cryptocurrency\nfield is accurately predicting cryptocurrency price trends. Leveraging\nartificial intelligence (AI) is beneficial in addressing this challenge.\nCryptocurrency markets, marked by substantial growth and volatility, attract\ninvestors and scholars keen on deciphering and forecasting cryptocurrency price\nmovements. The vast and diverse array of data available for such predictions\nincreases the complexity of the task. In our study, we introduce a novel\napproach termed hard and soft information fusion (HSIF) to enhance the accuracy\nof cryptocurrency price movement forecasts. The hard information component of\nour approach encompasses historical price records alongside technical\nindicators. Complementing this, the soft data component extracts from X\n(formerly Twitter), encompassing news headlines and tweets about the\ncryptocurrency. To use this data, we use the Bidirectional Encoder\nRepresentations from Transformers (BERT)-based sentiment analysis method,\nfinancial BERT (FinBERT), which performs best. Finally, our model feeds on the\ninformation set including processed hard and soft data. We employ the\nbidirectional long short-term memory (BiLSTM) model because processing\ninformation in both forward and backward directions can capture long-term\ndependencies in sequential information. Our empirical findings emphasize the\nsuperiority of the HSIF approach over models dependent on single-source data by\ntesting on Bitcoin-related data. By fusing hard and soft information on Bitcoin\ndataset, our model has about 96.8\\% accuracy in predicting price movement.\nIncorporating information enables our model to grasp the influence of social\nsentiment on price fluctuations, thereby supplementing the technical\nanalysis-based predictions derived from hard information.", "paper_summary_zh": "<paragraph>金融和加密货币領域最重要的挑戰之一是準確預測加密貨幣價格趨勢。利用人工智慧 (AI) 有助於應對這一挑戰。加密貨幣市場以大幅成長和波動為特徵，吸引了熱衷於解讀和預測加密貨幣價格走勢的投資者和學者。可用於此類預測的龐大且多樣化的數據陣列增加了任務的複雜性。在我們的研究中，我們介紹了一種稱為硬軟信息融合 (HSIF) 的新方法，以提高加密貨幣價格變動預測的準確性。我們的方法的硬信息組成部分包括歷史價格記錄和技術指標。作為補充，軟數據組成部分從 X（以前的 Twitter）中提取，包括新聞標題和有關加密貨幣的推文。為了使用這些數據，我們使用基於雙向編碼器轉換器 (BERT) 的情緒分析方法，即財務 BERT (FinBERT)，它表現最佳。最後，我們的模型以包含處理過的硬數據和軟數據的信息集為基礎。我們採用雙向長期短期記憶 (BiLSTM) 模型，因為在正向和反向處理信息可以捕捉序列信息中的長期依賴性。我們的實證結果強調了 HSIF 方法優於依賴單一來源數據的模型，方法是在與比特幣相關的數據上進行測試。通過融合比特幣數據集中的硬信息和軟信息，我們的模型在預測價格變動方面具有大約 96.8% 的準確性。納入信息使我們的模型能夠掌握社交情緒對價格波動的影響，從而補充從硬信息中得出的基於技術分析的預測。</paragraph>", "author": "Saeed Mohammadi Dashtaki et.al.", "authors": "Saeed Mohammadi Dashtaki, Mehdi Hosseini Chagahi, Behzad Moshiri, Md. Jalil Piran", "id": "2409.18895v1", "paper_url": "http://arxiv.org/abs/2409.18895v1", "repo": "null"}}