{"2411.13282": {"publish_time": "2024-11-20", "title": "Combining Autoregressive and Autoencoder Language Models for Text Classification", "paper_summary": "This paper presents CAALM-TC (Combining Autoregressive and Autoencoder\nLanguage Models for Text Classification), a novel method that enhances text\nclassification by integrating autoregressive and autoencoder language models.\nAutoregressive large language models such as Open AI's GPT, Meta's Llama or\nMicrosoft's Phi offer promising prospects for content analysis practitioners,\nbut they generally underperform supervised BERT based models for text\nclassification. CAALM leverages autoregressive models to generate contextual\ninformation based on input texts, which is then combined with the original text\nand fed into an autoencoder model for classification. This hybrid approach\ncapitalizes on the extensive contextual knowledge of autoregressive models and\nthe efficient classification capabilities of autoencoders. Experimental results\non four benchmark datasets demonstrate that CAALM consistently outperforms\nexisting methods, particularly in tasks with smaller datasets and more abstract\nclassification objectives. The findings indicate that CAALM offers a scalable\nand effective solution for automated content analysis in social science\nresearch that minimizes sample size requirements.", "paper_summary_zh": "本文提出了 CAALM-TC（結合自迴歸和自動編碼器語言模型進行文本分類），這是一種通過整合自迴歸和自動編碼器語言模型來增強文本分類的新方法。Open AI 的 GPT、Meta 的 Llama 或 Microsoft 的 Phi 等自迴歸大型語言模型為內容分析從業者提供了有希望的前景，但它們在基於文本分類的監督式 BERT 模型中表現普遍不佳。CAALM 利用自迴歸模型根據輸入文本生成上下文信息，然後將其與原始文本結合並輸入自動編碼器模型進行分類。這種混合方法利用了自迴歸模型廣泛的上下文知識和自動編碼器的有效分類能力。在四個基準數據集上的實驗結果表明，CAALM 始終優於現有方法，特別是在數據集較小且分類目標更抽象的任務中。研究結果表明，CAALM 為社會科學研究中的自動化內容分析提供了一個可擴展且有效的解決方案，最大程度地減少了樣本量要求。", "author": "João Gonçalves et.al.", "authors": "João Gonçalves", "id": "2411.13282v1", "paper_url": "http://arxiv.org/abs/2411.13282v1", "repo": "null"}}