{"2405.15766": {"publish_time": "2024-05-24", "title": "Enhancing Adverse Drug Event Detection with Multimodal Dataset: Corpus Creation and Model Development", "paper_summary": "The mining of adverse drug events (ADEs) is pivotal in pharmacovigilance,\nenhancing patient safety by identifying potential risks associated with\nmedications, facilitating early detection of adverse events, and guiding\nregulatory decision-making. Traditional ADE detection methods are reliable but\nslow, not easily adaptable to large-scale operations, and offer limited\ninformation. With the exponential increase in data sources like social media\ncontent, biomedical literature, and Electronic Medical Records (EMR),\nextracting relevant ADE-related information from these unstructured texts is\nimperative. Previous ADE mining studies have focused on text-based\nmethodologies, overlooking visual cues, limiting contextual comprehension, and\nhindering accurate interpretation. To address this gap, we present a MultiModal\nAdverse Drug Event (MMADE) detection dataset, merging ADE-related textual\ninformation with visual aids. Additionally, we introduce a framework that\nleverages the capabilities of LLMs and VLMs for ADE detection by generating\ndetailed descriptions of medical images depicting ADEs, aiding healthcare\nprofessionals in visually identifying adverse events. Using our MMADE dataset,\nwe showcase the significance of integrating visual cues from images to enhance\noverall performance. This approach holds promise for patient safety, ADE\nawareness, and healthcare accessibility, paving the way for further exploration\nin personalized healthcare.", "paper_summary_zh": "藥物警戒中，不適當藥物事件 (ADE) 的挖掘至關重要，\n透過識別與藥物相關的潛在風險、促進早期發現不良事件，並指導法規決策，來提升病患安全。傳統的 ADE 偵測方法可靠但緩慢，不易適應大規模作業，且提供有限的資訊。隨著社群媒體內容、生物醫學文獻和電子病歷 (EMR) 等資料來源呈指數級增加，從這些非結構化文字中萃取相關的 ADE 相關資訊勢在必行。先前的 ADE 挖掘研究著重於基於文字的方法，忽略了視覺線索，限制了脈絡理解，並阻礙了準確的詮釋。為了解決這個差距，我們提出了多模態不適當藥物事件 (MMADE) 偵測資料集，將 ADE 相關文字資訊與視覺輔助工具合併。此外，我們還導入了一個框架，該框架利用 LLM 和 VLM 的功能進行 ADE 偵測，透過產生描繪 ADE 的醫學影像的詳細說明，協助醫療專業人員視覺化識別不良事件。使用我們的 MMADE 資料集，我們展示了從影像中整合視覺線索以提升整體效能的重要性。這種方法有望提升病患安全、ADE 意識和醫療保健的可近性，為個人化醫療保健的進一步探索鋪路。", "author": "Pranab Sahoo et.al.", "authors": "Pranab Sahoo, Ayush Kumar Singh, Sriparna Saha, Aman Chadha, Samrat Mondal", "id": "2405.15766v1", "paper_url": "http://arxiv.org/abs/2405.15766v1", "repo": "https://github.com/singhayush27/mmade"}}