{"2502.15616": {"publish_time": "2025-02-21", "title": "Pastiche Novel Generation Creating: Fan Fiction You Love in Your Favorite Author's Style", "paper_summary": "Great novels create immersive worlds with rich character arcs,\nwell-structured plots, and nuanced writing styles. However, current novel\ngeneration methods often rely on brief, simplistic story outlines and generate\ndetails using plain, generic language. To bridge this gap, we introduce the\ntask of Pastiche Novel Generation, which requires the generated novels to\nimitate the distinctive features of the original work, including understanding\ncharacter profiles, predicting plausible plot developments, and writing\nconcrete details using vivid, expressive language. To achieve this, we propose\nWriterAgent, a novel generation system designed to master the core aspects of\nliterary pastiche. WriterAgent is trained through a curriculum learning\nparadigm, progressing from low-level stylistic mastery to high-level narrative\ncoherence. Its key tasks include language style learning, character modeling,\nplot planning, and stylish writing, ensuring comprehensive narrative control.\nTo support this, WriterAgent leverages the WriterLoRA framework, an extension\nof LoRA with hierarchical and cumulative task-specific modules, each\nspecializing in a different narrative aspect. We evaluate WriterAgent on\nmultilingual classics like Harry Potter and Dream of the Red Chamber,\ndemonstrating its superiority over baselines in capturing the target author's\nsettings, character dynamics, and writing style to produce coherent, faithful\nnarratives.", "paper_summary_zh": "偉大的小說創造出引人入勝的世界，擁有豐富的角色弧線、結構良好的情節和細緻入微的寫作風格。然而，當前的寫小說方法通常依賴於簡短、簡單的故事大綱，並使用平淡、通用的語言生成細節。為了彌合這一差距，我們引入了仿寫小說生成的任務，這要求生成的的小說模仿原作的獨特特徵，包括理解角色簡介、預測合理的劇情發展，以及使用生動、富有表現力的語言撰寫具體細節。為此，我們提出了 WriterAgent，這是一個小說生成系統，旨在掌握文學仿寫的核心方面。WriterAgent 是通過課程學習範例進行訓練的，從低階的文體掌握進展到高階的敘事連貫性。它的主要任務包括語言風格學習、角色建模、情節規劃和文體寫作，確保全面的敘事控制。為了支持這一點，WriterAgent 利用 WriterLoRA 框架，這是一個 LoRA 的擴展，具有分層和累積的任務特定模組，每個模組都專精於不同的敘事方面。我們在《哈利波特》和《紅樓夢》等多語言經典作品上評估了 WriterAgent，展示了它在捕捉目標作者的場景、角色動態和寫作風格以產生連貫、忠實的敘事方面的優越性。", "author": "Xueran Han et.al.", "authors": "Xueran Han, Yuhan Liu, Mingzhe Li, Wei Liu, Sen Hu, Rui Yan, Zhiqiang Xu, Xiuying Chen", "id": "2502.15616v1", "paper_url": "http://arxiv.org/abs/2502.15616v1", "repo": "null"}}