{"2411.09612": {"publish_time": "2024-11-14", "title": "The Moral Foundations Weibo Corpus", "paper_summary": "Moral sentiments expressed in natural language significantly influence both\nonline and offline environments, shaping behavioral styles and interaction\npatterns, including social media selfpresentation, cyberbullying, adherence to\nsocial norms, and ethical decision-making. To effectively measure moral\nsentiments in natural language processing texts, it is crucial to utilize\nlarge, annotated datasets that provide nuanced understanding for accurate\nanalysis and modeltraining. However, existing corpora, while valuable, often\nface linguistic limitations. To address this gap in the Chinese language\ndomain,we introduce the Moral Foundation Weibo Corpus. This corpus consists of\n25,671 Chinese comments on Weibo, encompassing six diverse topic areas. Each\ncomment is manually annotated by at least three systematically trained\nannotators based on ten moral categories derived from a grounded theory of\nmorality. To assess annotator reliability, we present the kappa testresults, a\ngold standard for measuring consistency. Additionally, we apply several the\nlatest large language models to supplement the manual annotations, conducting\nanalytical experiments to compare their performance and report baseline results\nfor moral sentiment classification.", "paper_summary_zh": "自然語言中表達的道德情緒顯著影響線上和線下環境，形塑行為風格和互動模式，包括社群媒體自我呈現、網路霸凌、遵守社會規範和道德決策制定。為有效衡量自然語言處理文字中的道德情緒，利用大型標註資料集對於提供細緻的理解以進行精確的分析和模型訓練至關重要。然而，現有的語料庫雖然有價值，但經常面臨語言限制。為了解決中文領域的這個差距，我們引入了道德基礎微博語料庫。此語料庫包含 25,671 則微博中文留言，涵蓋六個不同的主題領域。每則留言都由至少三位經過系統訓練的標註者根據源自道德基礎理論的十個道德類別進行手動標註。為了評估標註者可靠性，我們呈現 kappa 檢定結果，這是衡量一致性的黃金標準。此外，我們應用幾個最新的大型語言模型來補充手動標註，進行分析實驗以比較它們的效能，並報告道德情緒分類的基準結果。", "author": "Renjie Cao et.al.", "authors": "Renjie Cao, Miaoyan Hu, Jiahan Wei, Baha Ihnaini", "id": "2411.09612v1", "paper_url": "http://arxiv.org/abs/2411.09612v1", "repo": "null"}}