{"2407.20608": {"publish_time": "2024-07-30", "title": "Questionnaires for Everyone: Streamlining Cross-Cultural Questionnaire Adaptation with GPT-Based Translation Quality Evaluation", "paper_summary": "Adapting questionnaires to new languages is a resource-intensive process\noften requiring the hiring of multiple independent translators, which limits\nthe ability of researchers to conduct cross-cultural research and effectively\ncreates inequalities in research and society. This work presents a prototype\ntool that can expedite the questionnaire translation process. The tool\nincorporates forward-backward translation using DeepL alongside GPT-4-generated\ntranslation quality evaluations and improvement suggestions. We conducted two\nonline studies in which participants translated questionnaires from English to\neither German (Study 1; n=10) or Portuguese (Study 2; n=20) using our\nprototype. To evaluate the quality of the translations created using the tool,\nevaluation scores between conventionally translated and tool-supported versions\nwere compared. Our results indicate that integrating LLM-generated translation\nquality evaluations and suggestions for improvement can help users\nindependently attain results similar to those provided by conventional,\nnon-NLP-supported translation methods. This is the first step towards more\nequitable questionnaire-based research, powered by AI.", "paper_summary_zh": "將問卷改編為新語言需要大量資源，通常需要聘請多位獨立翻譯人員，這限制了研究人員進行跨文化研究的能力，並有效地在研究和社會中造成不平等。這項工作提出了一個原型工具，可以加快問卷翻譯過程。該工具結合了使用 DeepL 的正向反向翻譯以及 GPT-4 生成的翻譯品質評估和改進建議。我們進行了兩項線上研究，參與者使用我們的原型將問卷從英文翻譯成德文（研究 1；n=10）或葡萄牙文（研究 2；n=20）。為了評估使用該工具建立的翻譯品質，我們比較了傳統翻譯版本和工具支援版本的評分。我們的結果表明，整合 LLM 生成的翻譯品質評估和改進建議，可以幫助使用者獨立獲得與傳統、非 NLP 支援翻譯方法所提供的結果類似的結果。這是由 AI 支援的更公平問卷研究的第一步。", "author": "Otso Haavisto et.al.", "authors": "Otso Haavisto, Robin Welsch", "id": "2407.20608v1", "paper_url": "http://arxiv.org/abs/2407.20608v1", "repo": "null"}}