{"2405.12109": {"publish_time": "2024-05-20", "title": "Linguistic Structure from a Bottleneck on Sequential Information Processing", "paper_summary": "Human language is a unique form of communication in the natural world,\ndistinguished by its structured nature. Most fundamentally, it is systematic,\nmeaning that signals can be broken down into component parts that are\nindividually meaningful -- roughly, words -- which are combined in a regular\nway to form sentences. Furthermore, the way in which these parts are combined\nmaintains a kind of locality: words are usually concatenated together, and they\nform contiguous phrases, keeping related parts of sentences close to each\nother. We address the challenge of understanding how these basic properties of\nlanguage arise from broader principles of efficient communication under\ninformation processing constraints. Here we show that natural-language-like\nsystematicity arises from minimization of excess entropy, a measure of\nstatistical complexity that represents the minimum amount of information\nnecessary for predicting the future of a sequence based on its past. In\nsimulations, we show that codes that minimize excess entropy factorize their\nsource distributions into approximately independent components, and then\nexpress those components systematically and locally. Next, in a series of\nmassively cross-linguistic corpus studies, we show that human languages are\nstructured to have low excess entropy at the level of phonology, morphology,\nsyntax, and semantics. Our result suggests that human language performs a\nsequential generalization of Independent Components Analysis on the statistical\ndistribution over meanings that need to be expressed. It establishes a link\nbetween the statistical and algebraic structure of human language, and\nreinforces the idea that the structure of human language may have evolved to\nminimize cognitive load while maximizing communicative expressiveness.", "paper_summary_zh": "人類語言是自然界中一種獨特的溝通形式，\n以其結構化的性質為特色。最根本的是，它是系統性的，\n這表示符號可以分解成個別有意義的組成部分——大致上，\n就是單字——這些單字以規則的方式組合成句子。此外，這些部分組合的方式\n維持著一種局部性：單字通常會串聯在一起，並形成連續的片語，\n讓句子的相關部分緊密相連。我們探討了如何理解這些語言基本屬性\n在資訊處理限制下，如何從有效溝通的更廣泛原則中產生。在這裡，我們展示了\n類自然語言的系統性來自於過剩熵的最小化，一種統計複雜性的測量，\n它表示根據序列的過去預測其未來的必要資訊最小量。在\n模擬中，我們展示了最小化過剩熵的碼將其來源分佈分解成\n近似獨立的組成部分，然後以系統且局部的形式表達這些組成部分。接下來，\n在一系列的大規模跨語言語料庫研究中，我們展示了人類語言的結構\n在音韻、形態、句法和語義的層級上具有低過剩熵。我們的結果表明，\n人類語言對需要表達的意義的統計分佈執行獨立成分分析的順序概化。它建立了\n人類語言的統計和代數結構之間的連結，並強化了人類語言的結構可能演化為\n最小化認知負擔，同時最大化溝通表達力的想法。", "author": "Richard Futrell et.al.", "authors": "Richard Futrell, Michael Hahn", "id": "2405.12109v1", "paper_url": "http://arxiv.org/abs/2405.12109v1", "repo": "null"}}