{"2411.00577": {"publish_time": "2024-11-01", "title": "WLPlan: Relational Features for Symbolic Planning", "paper_summary": "Scalable learning for planning research generally involves juggling between\ndifferent programming languages for handling learning and planning modules\neffectively. Interpreted languages such as Python are commonly used for\nlearning routines due to their ease of use and the abundance of highly\nmaintained learning libraries they exhibit, while compiled languages such as\nC++ are used for planning routines due to their optimised resource usage.\nMotivated by the need for tools for developing scalable learning planners, we\nintroduce WLPlan, a C++ package with Python bindings which implements recent\npromising work for automatically generating relational features of planning\ntasks. Such features can be used for any downstream routine, such as learning\ndomain control knowledge or probing and understanding planning tasks. More\nspecifically, WLPlan provides functionality for (1) transforming planning tasks\ninto graphs, and (2) embedding planning graphs into feature vectors via graph\nkernels. The source code and instructions for the installation and usage of\nWLPlan are available at tinyurl.com/42kymswc", "paper_summary_zh": "可擴充的學習規劃研究通常需要在不同的程式語言之間切換，才能有效地處理學習和規劃模組。例如 Python 等直譯語言通常用於學習常式，因為它們易於使用，且有許多維護完善的學習函式庫；而例如 C++ 等編譯語言則用於規劃常式，因為它們能最佳化資源使用。由於需要開發可擴充學習規劃器的工具，我們引進了 WLPlan，這是一個具有 Python 繫結的 C++ 套件，實作了近期有前途的自動產生規劃任務關係特徵的工作。此類特徵可用於任何下游常式，例如學習領域控制知識或探測和理解規劃任務。更具體地說，WLPlan 提供了以下功能：(1) 將規劃任務轉換為圖形，以及 (2) 透過圖形核將規劃圖形嵌入特徵向量。WLPlan 的原始碼和安裝及使用說明可在 tinyurl.com/42kymswc 取得", "author": "Dillon Z. Chen et.al.", "authors": "Dillon Z. Chen", "id": "2411.00577v1", "paper_url": "http://arxiv.org/abs/2411.00577v1", "repo": "null"}}