{"2406.14122": {"publish_time": "2024-06-20", "title": "EduQate: Generating Adaptive Curricula through RMABs in Education Settings", "paper_summary": "There has been significant interest in the development of personalized and\nadaptive educational tools that cater to a student's individual learning\nprogress. A crucial aspect in developing such tools is in exploring how mastery\ncan be achieved across a diverse yet related range of content in an efficient\nmanner. While Reinforcement Learning and Multi-armed Bandits have shown promise\nin educational settings, existing works often assume the independence of\nlearning content, neglecting the prevalent interdependencies between such\ncontent. In response, we introduce Education Network Restless Multi-armed\nBandits (EdNetRMABs), utilizing a network to represent the relationships\nbetween interdependent arms. Subsequently, we propose EduQate, a method\nemploying interdependency-aware Q-learning to make informed decisions on arm\nselection at each time step. We establish the optimality guarantee of EduQate\nand demonstrate its efficacy compared to baseline policies, using students\nmodeled from both synthetic and real-world data.", "paper_summary_zh": "個人化和適應式教育工具的開發一直備受關注，這些工具能迎合學生的個別學習進度。開發此類工具的關鍵方面在於探索如何在廣泛且相關的內容中以有效的方式實現精熟。雖然強化學習和多重選擇法在教育環境中已展現出前景，但現有工作通常假設學習內容的獨立性，忽視了此類內容之間普遍存在的相互依賴性。為了解決此問題，我們引入了教育網路不穩定多重選擇法 (EdNetRMAB)，利用網路來表示相互依賴性手臂之間的關係。隨後，我們提出了 EduQate，這是一種使用具備相互依賴性感知的 Q 學習方法，在每個時間步驟對手臂選擇做出明智決策。我們建立了 EduQate 的最優性保證，並使用根據合成和真實世界資料建模的學生，證明了它與基準策略相比的功效。", "author": "Sidney Tio et.al.", "authors": "Sidney Tio, Dexun Li, Pradeep Varakantham", "id": "2406.14122v1", "paper_url": "http://arxiv.org/abs/2406.14122v1", "repo": "null"}}