{"2409.06883": {"publish_time": "2024-09-10", "title": "A Dataset for Evaluating LLM-based Evaluation Functions for Research Question Extraction Task", "paper_summary": "The progress in text summarization techniques has been remarkable. However\nthe task of accurately extracting and summarizing necessary information from\nhighly specialized documents such as research papers has not been sufficiently\ninvestigated. We are focusing on the task of extracting research questions (RQ)\nfrom research papers and construct a new dataset consisting of machine learning\npapers, RQ extracted from these papers by GPT-4, and human evaluations of the\nextracted RQ from multiple perspectives. Using this dataset, we systematically\ncompared recently proposed LLM-based evaluation functions for summarizations,\nand found that none of the functions showed sufficiently high correlations with\nhuman evaluations. We expect our dataset provides a foundation for further\nresearch on developing better evaluation functions tailored to the RQ\nextraction task, and contribute to enhance the performance of the task. The\ndataset is available at https://github.com/auto-res/PaperRQ-HumanAnno-Dataset.", "paper_summary_zh": "文本摘要技術的進展十分顯著。然而，從高度專業化的文件（例如研究論文）中準確提取和摘要必要資訊的任務尚未得到充分研究。我們專注於從研究論文中提取研究問題 (RQ) 的任務，並構建一個新的資料集，其中包含機器學習論文、GPT-4 從這些論文中提取的 RQ，以及從多個角度對提取的 RQ 進行的人工評估。使用此資料集，我們系統地比較了最近提出的用於摘要的基於 LLM 的評估函數，並發現沒有任何函數顯示出與人工評估有足夠高的相關性。我們預計我們的資料集將為進一步研究開發針對 RQ 提取任務量身打造的更好評估函數奠定基礎，並有助於提高任務的性能。該資料集可在 https://github.com/auto-res/PaperRQ-HumanAnno-Dataset 取得。", "author": "Yuya Fujisaki et.al.", "authors": "Yuya Fujisaki, Shiro Takagi, Hideki Asoh, Wataru Kumagai", "id": "2409.06883v1", "paper_url": "http://arxiv.org/abs/2409.06883v1", "repo": "null"}}