{"2406.05036": {"publish_time": "2024-06-07", "title": "TimeSieve: Extracting Temporal Dynamics through Information Bottlenecks", "paper_summary": "Time series forecasting has become an increasingly popular research area due\nto its critical applications in various real-world domains such as traffic\nmanagement, weather prediction, and financial analysis. Despite significant\nadvancements, existing models face notable challenges, including the necessity\nof manual hyperparameter tuning for different datasets, and difficulty in\neffectively distinguishing signal from redundant features in data characterized\nby strong seasonality. These issues hinder the generalization and practical\napplication of time series forecasting models. To solve this issues, we propose\nan innovative time series forecasting model TimeSieve designed to address these\nchallenges. Our approach employs wavelet transforms to preprocess time series\ndata, effectively capturing multi-scale features without the need for\nadditional parameters or manual hyperparameter tuning. Additionally, we\nintroduce the information bottleneck theory that filters out redundant features\nfrom both detail and approximation coefficients, retaining only the most\npredictive information. This combination reduces significantly improves the\nmodel's accuracy. Extensive experiments demonstrate that our model outperforms\nexisting state-of-the-art methods on 70\\% of the datasets, achieving higher\npredictive accuracy and better generalization across diverse datasets. Our\nresults validate the effectiveness of our approach in addressing the key\nchallenges in time series forecasting, paving the way for more reliable and\nefficient predictive models in practical applications. The code for our model\nis available at https://github.com/xll0328/TimeSieve.", "paper_summary_zh": "時序預測已成為一個越來越受歡迎的研究領域，因為它在各種現實世界的領域中具有關鍵應用，例如交通管理、天氣預測和財務分析。儘管有顯著進展，現有模型面臨著顯著的挑戰，包括為不同數據集進行手動超參數調整的必要性，以及難以有效區分具有強季節性的數據中的信號和冗餘特徵。這些問題阻礙了時序預測模型的概括化和實際應用。為了解決這些問題，我們提出了一種創新的時序預測模型 TimeSieve，旨在應對這些挑戰。我們的做法採用小波轉換來預處理時序數據，有效地捕捉多尺度特徵，而不需要額外的參數或手動超參數調整。此外，我們引入了信息瓶頸理論，它從細節和近似係數中濾出冗餘特徵，只保留最具預測性的信息。這種組合顯著提高了模型的準確率。大量的實驗表明，我們的模型在 70% 的數據集上優於現有的最先進方法，在不同的數據集上實現了更高的預測準確率和更好的概括化。我們的結果驗證了我們的方法在應對時序預測中的關鍵挑戰方面的有效性，為實際應用中更可靠和高效的預測模型鋪平了道路。我們模型的代碼可在 https://github.com/xll0328/TimeSieve 中獲得。", "author": "Ninghui Feng et.al.", "authors": "Ninghui Feng, Songning Lai, Fobao Zhou, Zhenxiao Yin, Hang Zhao", "id": "2406.05036v1", "paper_url": "http://arxiv.org/abs/2406.05036v1", "repo": "https://github.com/xll0328/timesieve"}}