{"2412.02549": {"publish_time": "2024-12-03", "title": "Patent-CR: A Dataset for Patent Claim Revision", "paper_summary": "This paper presents Patent-CR, the first dataset created for the patent claim\nrevision task in English. It includes both initial patent applications rejected\nby patent examiners and the final granted versions. Unlike normal text revision\ntasks that predominantly focus on enhancing sentence quality, such as grammar\ncorrection and coherence improvement, patent claim revision aims at ensuring\nthe claims meet stringent legal criteria. These criteria are beyond novelty and\ninventiveness, including clarity of scope, technical accuracy, language\nprecision, and legal robustness. We assess various large language models (LLMs)\nthrough professional human evaluation, including general LLMs with different\nsizes and architectures, text revision models, and domain-specific models. Our\nresults indicate that LLMs often bring ineffective edits that deviate from the\ntarget revisions. In addition, domain-specific models and the method of\nfine-tuning show promising results. Notably, GPT-4 outperforms other tested\nLLMs, but further revisions are still necessary to reach the examination\nstandard. Furthermore, we demonstrate the inconsistency between automated and\nhuman evaluation results, suggesting that GPT-4-based automated evaluation has\nthe highest correlation with human judgment. This dataset, along with our\npreliminary empirical research, offers invaluable insights for further\nexploration in patent claim revision.", "paper_summary_zh": "本文提出了 Patent-CR，这是第一个为英文专利申请修改任务创建的数据集。它包括专利审查员拒绝的初始专利申请和最终授予的版本。与主要关注于提高句子质量（例如语法纠正和连贯性改进）的普通文本修改任务不同，专利申请修改旨在确保申请符合严格的法律标准。这些标准超出了新颖性和创造性，包括范围的清晰度、技术准确性、语言精确性和法律稳健性。我们通过专业的人工评估来评估各种大型语言模型 (LLM)，包括具有不同大小和架构的通用 LLM、文本修改模型和特定领域的模型。我们的结果表明，LLM 经常带来无效的编辑，偏离目标修改。此外，特定领域的模型和微调方法显示出有希望的结果。值得注意的是，GPT-4 优于其他经过测试的 LLM，但仍需要进一步修改才能达到审查标准。此外，我们展示了自动评估和人工评估结果之间的不一致性，表明基于 GPT-4 的自动评估与人工判断的相关性最高。该数据集以及我们初步的实证研究为专利申请修改的进一步探索提供了宝贵的见解。", "author": "Lekang Jiang et.al.", "authors": "Lekang Jiang, Pascal A Scherz, Stephan Goetz", "id": "2412.02549v1", "paper_url": "http://arxiv.org/abs/2412.02549v1", "repo": "null"}}