{"2412.17486": {"publish_time": "2024-12-23", "title": "Is ChatGPT Massively Used by Students Nowadays? A Survey on the Use of Large Language Models such as ChatGPT in Educational Settings", "paper_summary": "The rapid adoption of Generative AI (GenAI) based on Large Language Models\n(LLMs) such as ChatGPT has recently and profoundly impacted education, offering\ntransformative opportunities while raising significant concerns. In this study\nwe present the results of a survey that investigates how 395 students aged 13\nto 25 years old in France and Italy integrate LLMs into their educational\nroutines.\n  Key findings include the widespread use of these tools across all age groups\nand disciplines, with older students and male students demonstrating higher\nusage frequencies, particularly in scientific contexts. The results also show\ngender disparities, raising concerns about an emerging AI literacy and\ntechnological gender gap. Additionally, while most students utilise LLMs\nconstructively, the lack of systematic proofreading and critical evaluation\namong younger users suggests potential risks to cognitive skills development,\nincluding critical thinking and foundational knowledge. The survey results\nunderscore the need for educational institutions to adapt their curricula to\nintegrate AI tools effectively, promoting ethical use, critical thinking, and\nawareness of AI limitations and environmental costs. This paper provides\nactionable recommendations for fostering equitable and effective cohabitation\nof LLMs and education while addressing emerging challenges.", "paper_summary_zh": "生成式 AI (GenAI) 的快速採納，其基礎是大語言模型 (LLM)，例如 ChatGPT，最近對教育產生了深遠的影響，提供了轉型機會，同時也引發了重大的疑慮。在這項研究中，我們呈現了一項調查結果，調查探討了 395 名 13 至 25 歲的法國和義大利學生如何將 LLM 整合到他們的教育常規中。\n主要發現包括所有年齡層和學科都廣泛使用這些工具，年紀較大的學生和男性學生表現出更高的使用頻率，特別是在科學背景下。結果也顯示出性別差異，引發了對新興的 AI 素養和技術性別差距的擔憂。此外，雖然大多數學生建設性地利用 LLM，但年輕使用者缺乏系統性的校對和批判性評估，這表明對認知技能發展的潛在風險，包括批判性思考和基礎知識。調查結果強調了教育機構必須調整其課程以有效整合 AI 工具、促進道德使用、批判性思考以及認識 AI 的限制和環境成本。本文提供了可行的建議，以促進 LLM 和教育的公平且有效的共存，同時應對新興的挑戰。", "author": "Jérémie Sublime et.al.", "authors": "Jérémie Sublime, Ilaria Renna", "id": "2412.17486v1", "paper_url": "http://arxiv.org/abs/2412.17486v1", "repo": "null"}}