{"2412.02399": {"publish_time": "2024-12-03", "title": "OMENN: One Matrix to Explain Neural Networks", "paper_summary": "Deep Learning (DL) models are often black boxes, making their decision-making\nprocesses difficult to interpret. This lack of transparency has driven\nadvancements in eXplainable Artificial Intelligence (XAI), a field dedicated to\nclarifying the reasoning behind DL model predictions. Among these,\nattribution-based methods such as LRP and GradCAM are widely used, though they\nrely on approximations that can be imprecise.\n  To address these limitations, we introduce One Matrix to Explain Neural\nNetworks (OMENN), a novel post-hoc method that represents a neural network as a\nsingle, interpretable matrix for each specific input. This matrix is\nconstructed through a series of linear transformations that represent the\nprocessing of the input by each successive layer in the neural network. As a\nresult, OMENN provides locally precise, attribution-based explanations of the\ninput across various modern models, including ViTs and CNNs. We present a\ntheoretical analysis of OMENN based on dynamic linearity property and validate\nits effectiveness with extensive tests on two XAI benchmarks, demonstrating\nthat OMENN is competitive with state-of-the-art methods.", "paper_summary_zh": "深度學習 (DL) 模型通常是黑盒子，這使得它們的決策制定過程難以解釋。這種透明度的缺乏推動了可解釋人工智慧 (XAI) 的進展，XAI 是致力於釐清 DL 模型預測背後推理的領域。其中，基於歸因的方法（例如 LRP 和 GradCAM）被廣泛使用，儘管它們依賴於可能不精確的近似。\n為了解決這些限制，我們引入了 One Matrix to Explain Neural Networks (OMENN)，這是一種新穎的後設法，它將神經網路表示為針對每個特定輸入的單一可解釋矩陣。此矩陣是透過一系列線性轉換建構的，這些轉換表示神經網路中每個後續層處理輸入的方式。因此，OMENN 提供了局部精確的、基於歸因的輸入解釋，適用於各種現代模型，包括 ViT 和 CNN。我們基於動態線性屬性對 OMENN 進行了理論分析，並透過在兩個 XAI 基準上進行廣泛測試驗證了其有效性，證明了 OMENN 具有與最先進方法相媲美的競爭力。", "author": "Adam Wróbel et.al.", "authors": "Adam Wróbel, Mikołaj Janusz, Bartosz Zieliński, Dawid Rymarczyk", "id": "2412.02399v1", "paper_url": "http://arxiv.org/abs/2412.02399v1", "repo": "null"}}