{"2407.20207": {"publish_time": "2024-07-29", "title": "QAEA-DR: A Unified Text Augmentation Framework for Dense Retrieval", "paper_summary": "In dense retrieval, embedding long texts into dense vectors can result in\ninformation loss, leading to inaccurate query-text matching. Additionally,\nlow-quality texts with excessive noise or sparse key information are unlikely\nto align well with relevant queries. Recent studies mainly focus on improving\nthe sentence embedding model or retrieval process. In this work, we introduce a\nnovel text augmentation framework for dense retrieval. This framework\ntransforms raw documents into information-dense text formats, which supplement\nthe original texts to effectively address the aforementioned issues without\nmodifying embedding or retrieval methodologies. Two text representations are\ngenerated via large language models (LLMs) zero-shot prompting: question-answer\npairs and element-driven events. We term this approach QAEA-DR: unifying\nquestion-answer generation and event extraction in a text augmentation\nframework for dense retrieval. To further enhance the quality of generated\ntexts, a scoring-based evaluation and regeneration mechanism is introduced in\nLLM prompting. Our QAEA-DR model has a positive impact on dense retrieval,\nsupported by both theoretical analysis and empirical experiments.", "paper_summary_zh": "在稠密檢索中，將長文本嵌入稠密向量中可能會導致資訊遺失，進而導致不準確的查詢文字配對。此外，品質低劣、雜訊過多或關鍵資訊稀疏的文字不太可能與相關查詢相符。最近的研究主要集中在改進句子嵌入模型或檢索流程。在這項工作中，我們引入了一個用於稠密檢索的新穎文字擴充架構。此架構將原始文件轉換為資訊密集的文字格式，補充原始文字以有效解決上述問題，而無需修改嵌入或檢索方法。透過大型語言模型 (LLM) 零次提示產生兩個文字表徵：問答對和元素驅動事件。我們將此方法稱為 QAEA-DR：統一問答產生和事件萃取，用於稠密檢索的文字擴充架構。為了進一步提升產生文字的品質，在 LLM 提示中引入了基於評分的評估和再生機制。我們的 QAEA-DR 模型對稠密檢索有正面的影響，理論分析和實證實驗都支持這一點。", "author": "Hongming Tan et.al.", "authors": "Hongming Tan, Shaoxiong Zhan, Hai Lin, Hai-Tao Zheng, Wai Kin, Chan", "id": "2407.20207v1", "paper_url": "http://arxiv.org/abs/2407.20207v1", "repo": "null"}}