{"2405.19631": {"publish_time": "2024-05-30", "title": "Leveraging Open-Source Large Language Models for encoding Social Determinants of Health using an Intelligent Router", "paper_summary": "Social Determinants of Health (SDOH) play a significant role in patient\nhealth outcomes. The Center of Disease Control (CDC) introduced a subset of\nICD-10 codes called Z-codes in an attempt to officially recognize and measure\nSDOH in the health care system. However, these codes are rarely annotated in a\npatient's Electronic Health Record (EHR), and instead, in many cases, need to\nbe inferred from clinical notes. Previous research has shown that large\nlanguage models (LLMs) show promise on extracting unstructured data from EHRs.\nHowever, with thousands of models to choose from with unique architectures and\ntraining sets, it's difficult to choose one model that performs the best on\ncoding tasks. Further, clinical notes contain trusted health information making\nthe use of closed-source language models from commercial vendors difficult, so\nthe identification of open source LLMs that can be run within health\norganizations and exhibits high performance on SDOH tasks is an urgent problem.\nHere, we introduce an intelligent routing system for SDOH coding that uses a\nlanguage model router to direct medical record data to open source LLMs that\ndemonstrate optimal performance on specific SDOH codes. The intelligent routing\nsystem exhibits state of the art performance of 97.4% accuracy averaged across\n5 codes, including homelessness and food insecurity, on par with closed models\nsuch as GPT-4o. In order to train the routing system and validate models, we\nalso introduce a synthetic data generation and validation paradigm to increase\nthe scale of training data without needing privacy protected medical records.\nTogether, we demonstrate an architecture for intelligent routing of inputs to\ntask-optimal language models to achieve high performance across a set of\nmedical coding sub-tasks.", "paper_summary_zh": "<paragraph>健康社會決定因素 (SDOH) 在患者健康結果中扮演著重要的角色。疾病控制中心 (CDC) 引入了一組稱為 Z 碼的 ICD-10 代碼，試圖在醫療保健系統中正式識別和衡量 SDOH。然而，這些代碼很少在患者的電子健康記錄 (EHR) 中註解，而且在許多情況下，需要從臨床筆記中推斷出來。先前的研究表明，大型語言模型 (LLM) 在從 EHR 中提取非結構化數據方面很有前景。然而，有數千個模型可供選擇，它們具有獨特的架構和訓練集，因此很難選擇一個在編碼任務上表現最佳的模型。此外，臨床筆記包含受信任的健康資訊，這使得難以使用商業供應商的閉源語言模型，因此，識別可以在醫療機構內運作且在 SDOH 任務上表現出高性能的開源 LLM 是個迫切的問題。在此，我們介紹了一個用於 SDOH 編碼的智慧路由系統，它使用語言模型路由器將病歷資料導向在特定 SDOH 代碼上表現出最佳性能的開源 LLM。智慧路由系統展現了最先進的性能，在 5 個代碼（包括無家可歸和糧食不安全）的平均準確度為 97.4%，與 GPT-4o 等閉合模型不相上下。為了訓練路由系統和驗證模型，我們還引入了一個合成資料生成和驗證範例，以增加訓練資料的規模，而無需受隱私保護的病歷。總之，我們展示了一個智慧路由架構，用於將輸入路由到任務最佳語言模型，以在醫療編碼子任務中實現高性能。</paragraph>", "author": "Akul Goel et.al.", "authors": "Akul Goel, Surya Narayanan Hari, Belinda Waltman, Matt Thomson", "id": "2405.19631v1", "paper_url": "http://arxiv.org/abs/2405.19631v1", "repo": "null"}}