{"2411.18099": {"publish_time": "2024-11-27", "title": "Fine-Tuning Small Embeddings for Elevated Performance", "paper_summary": "Contextual Embeddings have yielded state-of-the-art results in various\nnatural language processing tasks. However, these embeddings are constrained by\nmodels requiring large amounts of data and huge computing power. This is an\nissue for low-resource languages like Nepali as the amount of data available\nover the internet is not always sufficient for the models. This work has taken\nan incomplete BERT model with six attention heads pretrained on Nepali language\nand finetuned it on previously unseen data. The obtained results from intrinsic\nand extrinsic evaluations have been compared to the results drawn from the\noriginal model baseline and a complete BERT model pretrained on Nepali language\nas the oracle. The results demonstrate that even though the oracle is better on\naverage, finetuning the small embeddings drastically improves results compared\nto the original baseline.", "paper_summary_zh": "語境嵌入在各種自然語言處理任務中產生了最先進的結果。然而，這些嵌入受到需要大量數據和巨大運算能力的模型的限制。對於尼泊爾語等低資源語言來說，這是一個問題，因為網路上可用的數據量並不總是足以應付這些模型。這項工作採用了一個不完整的 BERT 模型，在尼泊爾語上預訓練了六個注意力頭，並在以前未見過的數據上對其進行微調。從內在和外在評估中獲得的結果已與從原始模型基準和在尼泊爾語上預訓練的完整 BERT 模型（作為神諭）中得出的結果進行了比較。結果表明，儘管神諭平均而言較好，但與原始基準相比，微調小嵌入會大幅改善結果。", "author": "Biraj Silwal et.al.", "authors": "Biraj Silwal", "id": "2411.18099v1", "paper_url": "http://arxiv.org/abs/2411.18099v1", "repo": "null"}}