{"2406.07231": {"publish_time": "2024-06-11", "title": "Decipherment-Aware Multilingual Learning in Jointly Trained Language Models", "paper_summary": "The principle that governs unsupervised multilingual learning (UCL) in\njointly trained language models (mBERT as a popular example) is still being\ndebated. Many find it surprising that one can achieve UCL with multiple\nmonolingual corpora. In this work, we anchor UCL in the context of language\ndecipherment and show that the joint training methodology is a decipherment\nprocess pivotal for UCL. In a controlled setting, we investigate the effect of\ndifferent decipherment settings on the multilingual learning performance and\nconsolidate the existing opinions on the contributing factors to\nmultilinguality. From an information-theoretic perspective we draw a limit to\nthe UCL performance and demonstrate the importance of token alignment in\nchallenging decipherment settings caused by differences in the data domain,\nlanguage order and tokenization granularity. Lastly, we apply lexical alignment\nto mBERT and investigate the contribution of aligning different lexicon groups\nto downstream performance.", "paper_summary_zh": "在聯合訓練的語言模型（例如 mBERT）中管理無監督多語言學習 (UCL) 的原則仍在爭論中。許多人驚訝地發現，人們可以用多個單語語料庫實現 UCL。在這項工作中，我們將 UCL 固定在語言破譯的背景中，並表明聯合訓練方法是 UCL 的關鍵破譯過程。在受控環境中，我們探討了不同的破譯設定對多語言學習效能的影響，並整合了現有意見，以了解多語言的促成因素。從資訊理論的角度來看，我們限制了 UCL 效能，並展示了在資料領域、語言順序和標記化粒度差異造成的具挑戰性破譯設定中，標記比對的重要性。最後，我們將詞彙比對應用於 mBERT，並探討了比對不同詞彙組對下游效能的貢獻。", "author": "Grandee Lee et.al.", "authors": "Grandee Lee", "id": "2406.07231v1", "paper_url": "http://arxiv.org/abs/2406.07231v1", "repo": "null"}}