{"2411.09431": {"publish_time": "2024-11-14", "title": "Everyone deserves their voice to be heard: Analyzing Predictive Gender Bias in ASR Models Applied to Dutch Speech Data", "paper_summary": "Recent research has shown that state-of-the-art (SotA) Automatic Speech\nRecognition (ASR) systems, such as Whisper, often exhibit predictive biases\nthat disproportionately affect various demographic groups. This study focuses\non identifying the performance disparities of Whisper models on Dutch speech\ndata from the Common Voice dataset and the Dutch National Public Broadcasting\norganisation. We analyzed the word error rate, character error rate and a\nBERT-based semantic similarity across gender groups. We used the moral\nframework of Weerts et al. (2022) to assess quality of service harms and\nfairness, and to provide a nuanced discussion on the implications of these\nbiases, particularly for automatic subtitling. Our findings reveal substantial\ndisparities in word error rate (WER) among gender groups across all model\nsizes, with bias identified through statistical testing.", "paper_summary_zh": "最近的研究表明，最先进 (SotA) 的自动语音识别 (ASR) 系统（例如 Whisper）通常表现出预测偏差，对不同的人口群体造成不成比例的影响。本研究重点关注 Whisper 模型在来自 Common Voice 数据集和荷兰国家公共广播组织的荷兰语语音数据上的性能差异。我们分析了性别组之间的词错误率、字符错误率和基于 BERT 的语义相似性。我们使用了 Weerts 等人的道德框架。(2022) 评估服务质量损害和公平性，并对这些偏差的影响（特别是对自动字幕）进行细致的讨论。我们的研究结果揭示了所有模型规模中性别组之间的词错误率 (WER) 存在显着差异，偏差通过统计测试识别。", "author": "Rik Raes et.al.", "authors": "Rik Raes, Saskia Lensink, Mykola Pechenizkiy", "id": "2411.09431v1", "paper_url": "http://arxiv.org/abs/2411.09431v1", "repo": "null"}}