{"2411.16622": {"publish_time": "2024-11-25", "title": "Imperceptible Adversarial Examples in the Physical World", "paper_summary": "Adversarial examples in the digital domain against deep learning-based\ncomputer vision models allow for perturbations that are imperceptible to human\neyes. However, producing similar adversarial examples in the physical world has\nbeen difficult due to the non-differentiable image distortion functions in\nvisual sensing systems. The existing algorithms for generating physically\nrealizable adversarial examples often loosen their definition of adversarial\nexamples by allowing unbounded perturbations, resulting in obvious or even\nstrange visual patterns. In this work, we make adversarial examples\nimperceptible in the physical world using a straight-through estimator (STE,\na.k.a. BPDA). We employ STE to overcome the non-differentiability -- applying\nexact, non-differentiable distortions in the forward pass of the\nbackpropagation step, and using the identity function in the backward pass. Our\ndifferentiable rendering extension to STE also enables imperceptible\nadversarial patches in the physical world. Using printout photos, and\nexperiments in the CARLA simulator, we show that STE enables fast generation of\n$\\ell_\\infty$ bounded adversarial examples despite the non-differentiable\ndistortions. To the best of our knowledge, this is the first work demonstrating\nimperceptible adversarial examples bounded by small $\\ell_\\infty$ norms in the\nphysical world that force zero classification accuracy in the global\nperturbation threat model and cause near-zero ($4.22\\%$) AP50 in object\ndetection in the patch perturbation threat model. We urge the community to\nre-evaluate the threat of adversarial examples in the physical world.", "paper_summary_zh": "<paragraph>針對基於深度學習的電腦視覺模型的數位領域對抗範例允許人眼無法察覺的擾動。然而，由於視覺感測系統中不可微分的影像失真函數，在物理世界中產生類似的對抗範例一直很困難。現有的演算法用於產生物理上可實現的對抗範例，通常透過允許無界的擾動來放寬對抗範例的定義，導致明顯甚至奇怪的視覺模式。在這項工作中，我們使用直通估計器 (STE，又稱 BPDA) 在物理世界中製作無法察覺的對抗範例。我們採用 STE 來克服不可微分性，在反向傳播步驟的前向傳遞中應用精確的不可微分失真，並在反向傳遞中使用恆等函數。我們對 STE 的可微分渲染延伸也讓物理世界中的對抗性貼片無法察覺。透過列印照片，以及在 CARLA 模擬器中的實驗，我們展示了 STE 能夠快速產生 $\\ell_\\infty$ 有界對抗範例，儘管有不可微分的失真。據我們所知，這是第一個在物理世界中展示由小 $\\ell_\\infty$ 規格限制的無法察覺對抗範例的工作，在全域擾動威脅模型中強制零分類準確度，並在貼片擾動威脅模型中導致接近零 ($4.22\\%$) 的 AP50 物件偵測。我們敦促社群重新評估物理世界中對抗範例的威脅。</paragraph>", "author": "Weilin Xu et.al.", "authors": "Weilin Xu, Sebastian Szyller, Cory Cornelius, Luis Murillo Rojas, Marius Arvinte, Alvaro Velasquez, Jason Martin, Nageen Himayat", "id": "2411.16622v1", "paper_url": "http://arxiv.org/abs/2411.16622v1", "repo": "null"}}