{"2406.19614": {"publish_time": "2024-06-28", "title": "A Survey on Data Quality Dimensions and Tools for Machine Learning", "paper_summary": "Machine learning (ML) technologies have become substantial in practically all\naspects of our society, and data quality (DQ) is critical for the performance,\nfairness, robustness, safety, and scalability of ML models. With the large and\ncomplex data in data-centric AI, traditional methods like exploratory data\nanalysis (EDA) and cross-validation (CV) face challenges, highlighting the\nimportance of mastering DQ tools. In this survey, we review 17 DQ evaluation\nand improvement tools in the last 5 years. By introducing the DQ dimensions,\nmetrics, and main functions embedded in these tools, we compare their strengths\nand limitations and propose a roadmap for developing open-source DQ tools for\nML. Based on the discussions on the challenges and emerging trends, we further\nhighlight the potential applications of large language models (LLMs) and\ngenerative AI in DQ evaluation and improvement for ML. We believe this\ncomprehensive survey can enhance understanding of DQ in ML and could drive\nprogress in data-centric AI. A complete list of the literature investigated in\nthis survey is available on GitHub at:\nhttps://github.com/haihua0913/awesome-dq4ml.", "paper_summary_zh": "機器學習 (ML) 技術已成為我們社會中幾乎所有方面的實質，而資料品質 (DQ) 對於 ML 模型的效能、公平性、穩健性、安全性與可擴充性至關重要。隨著資料導向 AI 中的資料龐大且複雜，傳統方法（如探索性資料分析 (EDA) 和交叉驗證 (CV)）面臨挑戰，突顯了精通 DQ 工具的重要性。在這項調查中，我們回顧了過去 5 年中的 17 項 DQ 評估和改善工具。透過介紹這些工具中嵌入的 DQ 維度、指標和主要功能，我們比較了它們的優缺點，並提出了開發適用於 ML 的開源 DQ 工具的路線圖。根據對挑戰和新興趨勢的討論，我們進一步強調了大型語言模型 (LLM) 和生成式 AI 在 ML 的 DQ 評估和改善中的潛在應用。我們相信這項全面的調查可以增進對 ML 中 DQ 的理解，並可能推動資料導向 AI 的進展。這項調查中調查的文獻完整清單可在 GitHub 上取得：\nhttps://github.com/haihua0913/awesome-dq4ml。", "author": "Yuhan Zhou et.al.", "authors": "Yuhan Zhou, Fengjiao Tu, Kewei Sha, Junhua Ding, Haihua Chen", "id": "2406.19614v1", "paper_url": "http://arxiv.org/abs/2406.19614v1", "repo": "null"}}