{"2411.19456": {"publish_time": "2024-11-29", "title": "Beyond Surface Structure: A Causal Assessment of LLMs' Comprehension Ability", "paper_summary": "Large language models (LLMs) have shown remarkable capability in natural\nlanguage tasks, yet debate persists on whether they truly comprehend deep\nstructure (i.e., core semantics) or merely rely on surface structure (e.g.,\npresentation format). Prior studies observe that LLMs' performance declines\nwhen intervening on surface structure, arguing their success relies on surface\nstructure recognition. However, surface structure sensitivity does not prevent\ndeep structure comprehension. Rigorously evaluating LLMs' capability requires\nanalyzing both, yet deep structure is often overlooked. To this end, we assess\nLLMs' comprehension ability using causal mediation analysis, aiming to fully\ndiscover the capability of using both deep and surface structures.\nSpecifically, we formulate the comprehension of deep structure as direct causal\neffect (DCE) and that of surface structure as indirect causal effect (ICE),\nrespectively. To address the non-estimability of original DCE and ICE --\nstemming from the infeasibility of isolating mutual influences of deep and\nsurface structures, we develop the corresponding quantifiable surrogates,\nincluding approximated DCE (ADCE) and approximated ICE (AICE). We further apply\nthe ADCE to evaluate a series of mainstream LLMs, showing that most of them\nexhibit deep structure comprehension ability, which grows along with the\nprediction accuracy. Comparing ADCE and AICE demonstrates closed-source LLMs\nrely more on deep structure, while open-source LLMs are more surface-sensitive,\nwhich decreases with model scale. Theoretically, ADCE is a bidirectional\nevaluation, which measures both the sufficiency and necessity of deep structure\nchanges in causing output variations, thus offering a more comprehensive\nassessment than accuracy, a common evaluation in LLMs. Our work provides new\ninsights into LLMs' deep structure comprehension and offers novel methods for\nLLMs evaluation.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言任務中展現了卓越的能力，但關於它們是否真正理解深層結構（即核心語義）或僅依賴表面結構（例如呈現格式）的爭論仍持續不斷。先前的研究觀察到，當干預表面結構時，LLM 的性能會下降，並認為它們的成功依賴於表面結構識別。然而，對表面結構的敏感性並不妨礙深層結構的理解。嚴格評估 LLM 的能力需要分析兩者，但深層結構常常被忽視。為此，我們使用因果中介分析評估 LLM 的理解能力，旨在充分發現使用深層結構和表面結構的能力。具體來說，我們將對深層結構的理解表述為直接因果效應 (DCE)，而對表面結構的理解表述為間接因果效應 (ICE)。為了解決原始 DCE 和 ICE 的不可估計性——源於無法分離深層結構和表面結構的相互影響，我們開發了相應的可量化替代，包括近似 DCE (ADCE) 和近似 ICE (AICE)。我們進一步應用 ADCE 來評估一系列主流 LLM，結果表明它們大多數都表現出深層結構理解能力，並且隨著預測準確度而增長。比較 ADCE 和 AICE 表明，閉源 LLM 更依賴於深層結構，而開源 LLM 對表面更敏感，並且隨著模型規模而降低。理論上，ADCE 是一種雙向評估，它測量了深層結構變化在引起輸出變化中既是充分條件又是必要條件的程度，從而提供了比 LLM 中常見的評估準確度更全面的評估。我們的研究為 LLM 的深層結構理解提供了新的見解，並為 LLM 評估提供了新的方法。", "author": "Yujin Han et.al.", "authors": "Yujin Han, Lei Xu, Sirui Chen, Difan Zou, Chaochao Lu", "id": "2411.19456v1", "paper_url": "http://arxiv.org/abs/2411.19456v1", "repo": "null"}}