{"2406.18451": {"publish_time": "2024-06-26", "title": "Detecting Brittle Decisions for Free: Leveraging Margin Consistency in Deep Robust Classifiers", "paper_summary": "Despite extensive research on adversarial training strategies to improve\nrobustness, the decisions of even the most robust deep learning models can\nstill be quite sensitive to imperceptible perturbations, creating serious risks\nwhen deploying them for high-stakes real-world applications. While detecting\nsuch cases may be critical, evaluating a model's vulnerability at a\nper-instance level using adversarial attacks is computationally too intensive\nand unsuitable for real-time deployment scenarios. The input space margin is\nthe exact score to detect non-robust samples and is intractable for deep neural\nnetworks. This paper introduces the concept of margin consistency -- a property\nthat links the input space margins and the logit margins in robust models --\nfor efficient detection of vulnerable samples. First, we establish that margin\nconsistency is a necessary and sufficient condition to use a model's logit\nmargin as a score for identifying non-robust samples. Next, through\ncomprehensive empirical analysis of various robustly trained models on CIFAR10\nand CIFAR100 datasets, we show that they indicate strong margin consistency\nwith a strong correlation between their input space margins and the logit\nmargins. Then, we show that we can effectively use the logit margin to\nconfidently detect brittle decisions with such models and accurately estimate\nrobust accuracy on an arbitrarily large test set by estimating the input\nmargins only on a small subset. Finally, we address cases where the model is\nnot sufficiently margin-consistent by learning a pseudo-margin from the feature\nrepresentation. Our findings highlight the potential of leveraging deep\nrepresentations to efficiently assess adversarial vulnerability in deployment\nscenarios.", "paper_summary_zh": "儘管對對抗訓練策略進行了廣泛的研究以提高穩健性，但即使是最穩健的深度學習模型的決策仍可能對難以察覺的擾動相當敏感，在將其部署到高風險的真實世界應用時會產生嚴重的風險。雖然檢測此類案例可能至關重要，但使用對抗攻擊在每個實例級別評估模型的漏洞在計算上過於密集，不適合於實時部署場景。輸入空間裕度是檢測非穩健樣本的確切分數，對於深度神經網路來說是難以處理的。本文引入了裕度一致性的概念——一種將輸入空間裕度和穩健模型中的 logit 裕度聯繫起來的屬性——用於有效檢測易受攻擊的樣本。首先，我們確定裕度一致性是使用模型的 logit 裕度作為識別非穩健樣本的分數的必要且充分條件。接下來，通過對 CIFAR10 和 CIFAR100 資料集上各種穩健訓練模型的全面實證分析，我們表明它們表明強烈的裕度一致性，其輸入空間裕度和 logit 裕度之間具有很強的相關性。然後，我們表明我們可以有效地使用 logit 裕度來自信地檢測具有此類模型的脆弱決策，並通過僅在一個小子集中估計輸入裕度來準確估計任意大的測試集上的穩健準確度。最後，我們通過從特徵表示中學習偽裕度來解決模型裕度一致性不足的情況。我們的研究結果突出了利用深度表示來有效評估部署場景中對抗漏洞的潛力。", "author": "Jonas Ngnawé et.al.", "authors": "Jonas Ngnawé, Sabyasachi Sahoo, Yann Pequignot, Frédéric Precioso, Christian Gagné", "id": "2406.18451v1", "paper_url": "http://arxiv.org/abs/2406.18451v1", "repo": "https://github.com/ngnawejonas/margin-consistency"}}