{"2501.03508": {"publish_time": "2025-01-07", "title": "A Sequential Optimal Learning Approach to Automated Prompt Engineering in Large Language Models", "paper_summary": "Designing effective prompts is essential to guiding large language models\n(LLMs) toward desired responses. Automated prompt engineering aims to reduce\nreliance on manual effort by streamlining the design, refinement, and\noptimization of natural language prompts. This paper proposes an optimal\nlearning framework for automated prompt engineering, designed to sequentially\nidentify effective prompt features while efficiently allocating a limited\nevaluation budget. We introduce a feature-based method to express prompts,\nwhich significantly broadens the search space. Bayesian regression is employed\nto utilize correlations among similar prompts, accelerating the learning\nprocess. To efficiently explore the large space of prompt features for a high\nquality prompt, we adopt the forward-looking Knowledge-Gradient (KG) policy for\nsequential optimal learning. The KG policy is computed efficiently by solving\nmixed-integer second-order cone optimization problems, making it scalable and\ncapable of accommodating prompts characterized only through constraints. We\ndemonstrate that our method significantly outperforms a set of benchmark\nstrategies assessed on instruction induction tasks. The results highlight the\nadvantages of using the KG policy for prompt learning given a limited\nevaluation budget. Our framework provides a solution to deploying automated\nprompt engineering in a wider range applications where prompt evaluation is\ncostly.", "paper_summary_zh": "設計有效的提示對於引導大型語言模型 (LLM) 朝向預期的回應至關重要。自動提示工程旨在透過簡化自然語言提示的設計、精煉和最佳化來減少對人工工作的依賴。本文提出了一個用於自動提示工程的最佳學習架構，旨在按順序識別有效的提示特徵，同時有效分配有限的評估預算。我們引入了一種基於特徵的方法來表達提示，這顯著地擴展了搜尋空間。貝氏迴歸用於利用相似提示之間的相關性，加速學習過程。為了有效地探索大量的高品質提示特徵空間，我們採用了前瞻性的知識梯度 (KG) 策略進行順序最佳學習。KG 策略透過解決混合整數二階錐優化問題來有效計算，使其具有可擴充性，並且能夠容納僅透過約束條件來表徵的提示。我們證明了我們的方法顯著優於評估指令誘導任務的一組基準策略。結果突顯了在有限的評估預算下使用 KG 策略進行提示學習的優點。我們的框架提供了一個解決方案，可以在提示評估成本較高的更廣泛應用中部署自動提示工程。", "author": "Shuyang Wang et.al.", "authors": "Shuyang Wang, Somayeh Moazeni, Diego Klabjan", "id": "2501.03508v1", "paper_url": "http://arxiv.org/abs/2501.03508v1", "repo": "null"}}