{"2406.03049": {"publish_time": "2024-06-05", "title": "StreamSpeech: Simultaneous Speech-to-Speech Translation with Multi-task Learning", "paper_summary": "Simultaneous speech-to-speech translation (Simul-S2ST, a.k.a streaming speech\ntranslation) outputs target speech while receiving streaming speech inputs,\nwhich is critical for real-time communication. Beyond accomplishing translation\nbetween speech, Simul-S2ST requires a policy to control the model to generate\ncorresponding target speech at the opportune moment within speech inputs,\nthereby posing a double challenge of translation and policy. In this paper, we\npropose StreamSpeech, a direct Simul-S2ST model that jointly learns translation\nand simultaneous policy in a unified framework of multi-task learning. Adhering\nto a multi-task learning approach, StreamSpeech can perform offline and\nsimultaneous speech recognition, speech translation and speech synthesis via an\n\"All-in-One\" seamless model. Experiments on CVSS benchmark demonstrate that\nStreamSpeech achieves state-of-the-art performance in both offline S2ST and\nSimul-S2ST tasks. Besides, StreamSpeech is able to present high-quality\nintermediate results (i.e., ASR or translation results) during simultaneous\ntranslation process, offering a more comprehensive real-time communication\nexperience.", "paper_summary_zh": "同時語音對語音翻譯（Simul-S2ST，也稱為串流語音翻譯）在接收串流語音輸入時輸出目標語音，這對於即時通訊至關重要。除了完成語音之間的翻譯外，Simul-S2ST 需要一個策略來控制模型在語音輸入中適時生成對應的目標語音，從而對翻譯和策略提出雙重挑戰。在本文中，我們提出了 StreamSpeech，這是一個直接的 Simul-S2ST 模型，它在多任務學習的統一框架中聯合學習翻譯和同時策略。遵循多任務學習方法，StreamSpeech 可以通過「一體化」無縫模型執行離線和同時語音識別、語音翻譯和語音合成。CVSS 基準上的實驗表明，StreamSpeech 在離線 S2ST 和 Simul-S2ST 任務中都取得了最先進的性能。此外，StreamSpeech 能夠在同時翻譯過程中呈現高品質的中間結果（即 ASR 或翻譯結果），提供更全面的即時通訊體驗。", "author": "Shaolei Zhang et.al.", "authors": "Shaolei Zhang, Qingkai Fang, Shoutao Guo, Zhengrui Ma, Min Zhang, Yang Feng", "id": "2406.03049v1", "paper_url": "http://arxiv.org/abs/2406.03049v1", "repo": "https://github.com/ictnlp/streamspeech"}}