{"2406.18907": {"publish_time": "2024-06-27", "title": "Historia Magistra Vitae: Dynamic Topic Modeling of Roman Literature using Neural Embeddings", "paper_summary": "Dynamic topic models have been proposed as a tool for historical analysis,\nbut traditional approaches have had limited usefulness, being difficult to\nconfigure, interpret, and evaluate. In this work, we experiment with a recent\napproach for dynamic topic modeling using BERT embeddings. We compare topic\nmodels built using traditional statistical models (LDA and NMF) and the\nBERT-based model, modeling topics over the entire surviving corpus of Roman\nliterature. We find that while quantitative metrics prefer statistical models,\nqualitative evaluation finds better insights from the neural model.\nFurthermore, the neural topic model is less sensitive to hyperparameter\nconfiguration and thus may make dynamic topic modeling more viable for\nhistorical researchers.", "paper_summary_zh": "動態主題模型已被提議作為歷史分析的工具，但傳統方法的用途有限，因為難以配置、詮釋和評估。在這項工作中，我們使用 BERT 內嵌字元向量對動態主題建模的最新方法進行實驗。我們比較使用傳統統計模型（LDA 和 NMF）和 BERT 為基礎的模型所建立的主題模型，對羅馬文學中所有現存語料庫的主題進行建模。我們發現，雖然量化指標較偏好統計模型，但定性評估發現神經模型有更好的見解。此外，神經主題模型對超參數配置不太敏感，因此可能使動態主題建模對歷史研究人員來說更可行。", "author": "Michael Ginn et.al.", "authors": "Michael Ginn, Mans Hulden", "id": "2406.18907v1", "paper_url": "http://arxiv.org/abs/2406.18907v1", "repo": "null"}}