{"2410.07820": {"publish_time": "2024-10-10", "title": "Mitigating Gender Bias in Code Large Language Models via Model Editing", "paper_summary": "In recent years, with the maturation of large language model (LLM) technology\nand the emergence of high-quality programming code datasets, researchers have\nbecome increasingly confident in addressing the challenges of program synthesis\nautomatically. However, since most of the training samples for LLMs are\nunscreened, it is inevitable that LLMs' performance may not align with\nreal-world scenarios, leading to the presence of social bias. To evaluate and\nquantify the gender bias in code LLMs, we propose a dataset named CodeGenBias\n(Gender Bias in the Code Generation) and an evaluation metric called FB-Score\n(Factual Bias Score) based on the actual gender distribution of correlative\nprofessions. With the help of CodeGenBias and FB-Score, we evaluate and analyze\nthe gender bias in eight mainstream Code LLMs. Previous work has demonstrated\nthat model editing methods that perform well in knowledge editing have the\npotential to mitigate social bias in LLMs. Therefore, we develop a model\nediting approach named MG-Editing (Multi-Granularity model Editing), which\nincludes the locating and editing phases. Our model editing method MG-Editing\ncan be applied at five different levels of model parameter granularity: full\nparameters level, layer level, module level, row level, and neuron level.\nExtensive experiments not only demonstrate that our MG-Editing can effectively\nmitigate the gender bias in code LLMs while maintaining their general code\ngeneration capabilities, but also showcase its excellent generalization. At the\nsame time, the experimental results show that, considering both the gender bias\nof the model and its general code generation capability, MG-Editing is most\neffective when applied at the row and neuron levels of granularity.", "paper_summary_zh": "<paragraph>近年来，随着大语言模型 (LLM) 技术的成熟\n以及高质量编程代码数据集的出现，研究人员对\n自动解决程序合成的挑战越来越有信心。然而，由于 LLM 的大多数训练样本是\n未经筛选的，因此 LLM 的性能不可避免地可能与\n现实世界场景不一致，从而导致社会偏见的存在。为了评估和\n量化代码 LLM 中的性别偏见，我们提出了一个名为 CodeGenBias 的数据集\n（代码生成中的性别偏见）和一个基于相关职业的实际性别分布的评估指标，称为 FB-Score\n（事实偏见分数）。在 CodeGenBias 和 FB-Score 的帮助下，我们评估和分析\n了八个主流代码 LLM 中的性别偏见。以前的工作已经证明\n在知识编辑中表现良好的模型编辑方法具有\n减轻 LLM 中社会偏见。因此，我们开发了一个名为 MG-Editing 的模型\n编辑方法（多粒度模型编辑），其中包括定位和编辑阶段。我们的模型编辑方法 MG-Editing\n可以在模型参数粒度的五个不同级别上应用：完整\n参数级别、层级别、模块级别、行级别和神经元级别。\n大量的实验不仅证明了我们的 MG-Editing 可以有效\n减轻代码 LLM 中的性别偏见，同时保持其通用代码\n生成能力，但也展示了其出色的泛化能力。同时，实验结果表明，考虑模型的性别偏见\n及其通用代码生成能力，MG-Editing 在行和神经元级别应用时最有效\n粒度。</paragraph>", "author": "Zhanyue Qin et.al.", "authors": "Zhanyue Qin, Haochuan Wang, Zecheng Wang, Deyuan Liu, Cunhang Fan, Zhao Lv, Zhiying Tu, Dianhui Chu, Dianbo Sui", "id": "2410.07820v1", "paper_url": "http://arxiv.org/abs/2410.07820v1", "repo": "null"}}