{"2412.19688": {"publish_time": "2024-12-27", "title": "A Review on the Integration of Artificial Intelligence and Medical Imaging in IVF Ovarian Stimulation", "paper_summary": "Artificial intelligence (AI) has emerged as a powerful tool to enhance\ndecision-making and optimize treatment protocols in in vitro fertilization\n(IVF). In particular, AI shows significant promise in supporting\ndecision-making during the ovarian stimulation phase of the IVF process. This\nreview evaluates studies focused on the applications of AI combined with\nmedical imaging in ovarian stimulation, examining methodologies, outcomes, and\ncurrent limitations. Our analysis of 13 studies on this topic reveals that,\nreveal that while AI algorithms demonstrated notable potential in predicting\noptimal hormonal dosages, trigger timing, and oocyte retrieval outcomes, the\nmedical imaging data utilized predominantly came from two-dimensional (2D)\nultrasound which mainly involved basic quantifications, such as follicle size\nand number, with limited use of direct feature extraction or advanced image\nanalysis techniques. This points to an underexplored opportunity where advanced\nimage analysis approaches, such as deep learning, and more diverse imaging\nmodalities, like three-dimensional (3D) ultrasound, could unlock deeper\ninsights. Additionally, the lack of explainable AI (XAI) in most studies raises\nconcerns about the transparency and traceability of AI-driven decisions - key\nfactors for clinical adoption and trust. Furthermore, many studies relied on\nsingle-center designs and small datasets, which limit the generalizability of\ntheir findings. This review highlights the need for integrating advanced\nimaging analysis techniques with explainable AI methodologies, as well as the\nimportance of leveraging multicenter collaborations and larger datasets.\nAddressing these gaps has the potential to enhance ovarian stimulation\nmanagement, paving the way for efficient, personalized, and data-driven\ntreatment pathways that improve IVF outcomes.", "paper_summary_zh": "人工智慧（AI）已成為增強體外受精（IVF）決策制定和優化治療方案的強大工具。特別是，AI 在支持 IVF 過程中卵巢刺激階段的決策制定方面顯示出顯著的前景。本綜述評估了專注於 AI 結合卵巢刺激中的醫學影像應用、檢驗方法、結果和當前限制的研究。我們對 13 項關於此主題的研究分析顯示，雖然 AI 演算法在預測最佳荷爾蒙劑量、觸發時機和卵子取出結果方面表現出顯著的潛力，但所利用的醫學影像數據主要來自於二次元（2D）超音波，而二次元超音波主要涉及基本量化，例如濾泡大小和數量，且有限使用直接特徵提取或進階影像分析技術。這指向一個尚未探索的機會，例如深度學習等進階影像分析方法，以及更多元的影像模式，例如三維（3D）超音波，可以解鎖更深入的見解。此外，大多數研究缺乏可解釋 AI（XAI），這引起了人們對 AI 驅動決策的透明度和可追溯性的擔憂，而透明度和可追溯性是臨床採用和信任的關鍵因素。此外，許多研究依賴於單中心設計和小型數據集，這限制了其發現的普遍性。本綜述強調了將進階影像分析技術與可解釋 AI 方法整合起來的必要性，以及利用多中心合作和大型數據集的重要性。解決這些差距有可能增強卵巢刺激管理，為有效、個人化和數據驅動的治療途徑鋪平道路，進而改善 IVF 結果。", "author": "Jana Zakall et.al.", "authors": "Jana Zakall, Birgit Pohn, Antonia Graf, Daniel Kovatchki, Arezoo Borji, Ragib Shahriar Islam, Hossam Haick, Heinz Strohmer, Sepideh Hatamikia", "id": "2412.19688v1", "paper_url": "http://arxiv.org/abs/2412.19688v1", "repo": "null"}}