{"2411.18369": {"publish_time": "2024-11-27", "title": "G3Flow: Generative 3D Semantic Flow for Pose-aware and Generalizable Object Manipulation", "paper_summary": "Recent advances in imitation learning for 3D robotic manipulation have shown\npromising results with diffusion-based policies. However, achieving human-level\ndexterity requires seamless integration of geometric precision and semantic\nunderstanding. We present G3Flow, a novel framework that constructs real-time\nsemantic flow, a dynamic, object-centric 3D semantic representation by\nleveraging foundation models. Our approach uniquely combines 3D generative\nmodels for digital twin creation, vision foundation models for semantic feature\nextraction, and robust pose tracking for continuous semantic flow updates. This\nintegration enables complete semantic understanding even under occlusions while\neliminating manual annotation requirements. By incorporating semantic flow into\ndiffusion policies, we demonstrate significant improvements in both\nterminal-constrained manipulation and cross-object generalization. Extensive\nexperiments across five simulation tasks show that G3Flow consistently\noutperforms existing approaches, achieving up to 68.3% and 50.1% average\nsuccess rates on terminal-constrained manipulation and cross-object\ngeneralization tasks respectively. Our results demonstrate the effectiveness of\nG3Flow in enhancing real-time dynamic semantic feature understanding for\nrobotic manipulation policies.", "paper_summary_zh": "最近在 3D 機器人操作的模仿學習中，基於擴散的政策已展現出有希望的成果。然而，要達到人類等級的靈巧度，需要無縫整合幾何精確度和語義理解。我們提出 G3Flow，一個創新的架構，它建構了即時的語義流，一個動態的、以物件為中心的 3D 語義表示，藉由利用基礎模型。我們的做法獨特地結合了用於數位雙胞胎建立的 3D 生成模型、用於語義特徵萃取的視覺基礎模型，以及用於連續語義流更新的強健姿勢追蹤。這種整合即使在遮擋下也能實現完整的語義理解，同時消除了手動註解的要求。透過將語義流納入擴散政策中，我們展示了在終端受限操作和跨物件概括化中都有顯著的進步。在五項模擬任務中的大量實驗顯示，G3Flow 持續優於現有的方法，在終端受限操作和跨物件概括化任務中分別達到高達 68.3% 和 50.1% 的平均成功率。我們的結果證明了 G3Flow 在增強機器人操作政策的即時動態語義特徵理解方面的有效性。", "author": "Tianxing Chen et.al.", "authors": "Tianxing Chen, Yao Mu, Zhixuan Liang, Zanxin Chen, Shijia Peng, Qiangyu Chen, Mingkun Xu, Ruizhen Hu, Hongyuan Zhang, Xuelong Li, Ping Luo", "id": "2411.18369v1", "paper_url": "http://arxiv.org/abs/2411.18369v1", "repo": "null"}}