{"2406.16797": {"publish_time": "2024-06-24", "title": "Lottery Ticket Adaptation: Mitigating Destructive Interference in LLMs", "paper_summary": "Existing methods for adapting large language models (LLMs) to new tasks are\nnot suited to multi-task adaptation because they modify all the model weights\n-- causing destructive interference between tasks. The resulting effects, such\nas catastrophic forgetting of earlier tasks, make it challenging to obtain good\nperformance on multiple tasks at the same time. To mitigate this, we propose\nLottery Ticket Adaptation (LoTA), a sparse adaptation method that identifies\nand optimizes only a sparse subnetwork of the model. We evaluate LoTA on a wide\nrange of challenging tasks such as instruction following, reasoning, math, and\nsummarization. LoTA obtains better performance than full fine-tuning and\nlow-rank adaptation (LoRA), and maintains good performance even after training\non other tasks -- thus, avoiding catastrophic forgetting. By extracting and\nfine-tuning over \\emph{lottery tickets} (or \\emph{sparse task vectors}), LoTA\nalso enables model merging over highly dissimilar tasks.", "paper_summary_zh": "現有的適應大型語言模型 (LLM) 到新任務的方法並不適合多任務適應，因為它們會修改所有模型權重，從而造成任務之間的破壞性干擾。由此產生的影響，例如早期任務的災難性遺忘，使得難以同時在多個任務上獲得良好的表現。為了緩解這一點，我們提出了樂透適應 (LoTA)，這是一種稀疏適應方法，可以識別和優化模型的稀疏子網路。我們在廣泛的具有挑戰性的任務上評估了 LoTA，例如指令遵循、推理、數學和摘要。LoTA 獲得了比完全微調和低秩適應 (LoRA) 更好的性能，並且即使在訓練其他任務後也能保持良好的性能，從而避免了災難性遺忘。通過提取和微調「樂透券」（或「稀疏任務向量」），LoTA 也可以在高度不同的任務上合併模型。", "author": "Ashwinee Panda et.al.", "authors": "Ashwinee Panda, Berivan Isik, Xiangyu Qi, Sanmi Koyejo, Tsachy Weissman, Prateek Mittal", "id": "2406.16797v1", "paper_url": "http://arxiv.org/abs/2406.16797v1", "repo": "https://github.com/kiddyboots216/lottery-ticket-adaptation"}}