{"2501.01346": {"publish_time": "2025-01-02", "title": "Large Vision-Language Model Alignment and Misalignment: A Survey Through the Lens of Explainability", "paper_summary": "Large Vision-Language Models (LVLMs) have demonstrated remarkable\ncapabilities in processing both visual and textual information. However, the\ncritical challenge of alignment between visual and linguistic representations\nis not fully understood. This survey presents a comprehensive examination of\nalignment and misalignment in LVLMs through an explainability lens. We first\nexamine the fundamentals of alignment, exploring its representational and\nbehavioral aspects, training methodologies, and theoretical foundations. We\nthen analyze misalignment phenomena across three semantic levels: object,\nattribute, and relational misalignment. Our investigation reveals that\nmisalignment emerges from challenges at multiple levels: the data level, the\nmodel level, and the inference level. We provide a comprehensive review of\nexisting mitigation strategies, categorizing them into parameter-frozen and\nparameter-tuning approaches. Finally, we outline promising future research\ndirections, emphasizing the need for standardized evaluation protocols and\nin-depth explainability studies.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 在處理視覺和文字資訊方面展現出非凡的能力。然而，視覺和語言表徵之間對齊的關鍵挑戰尚未完全了解。本調查透過可解釋性的觀點，對 LVLMs 中的對齊和失衡進行全面檢視。我們首先檢視對齊的基本原理，探討其表徵和行為面向、訓練方法和理論基礎。接著，我們在三個語義層面分析失衡現象：物件失衡、屬性失衡和關係失衡。我們的調查顯示，失衡源自於多個層面的挑戰：資料層面、模型層面和推論層面。我們提供現有緩解策略的全面回顧，將它們分類為參數凍結和參數調整方法。最後，我們概述有前景的未來研究方向，強調標準化評估協定和深入可解釋性研究的必要性。", "author": "Dong Shu et.al.", "authors": "Dong Shu, Haiyan Zhao, Jingyu Hu, Weiru Liu, Lu Cheng, Mengnan Du", "id": "2501.01346v1", "paper_url": "http://arxiv.org/abs/2501.01346v1", "repo": "null"}}