{"2407.12421": {"publish_time": "2024-07-17", "title": "SafePowerGraph: Safety-aware Evaluation of Graph Neural Networks for Transmission Power Grids", "paper_summary": "Power grids are critical infrastructures of paramount importance to modern\nsociety and their rapid evolution and interconnections has heightened the\ncomplexity of power systems (PS) operations. Traditional methods for grid\nanalysis struggle with the computational demands of large-scale RES and ES\nintegration, prompting the adoption of machine learning (ML) techniques,\nparticularly Graph Neural Networks (GNNs). GNNs have proven effective in\nsolving the alternating current (AC) Power Flow (PF) and Optimal Power Flow\n(OPF) problems, crucial for operational planning. However, existing benchmarks\nand datasets completely ignore safety and robustness requirements in their\nevaluation and never consider realistic safety-critical scenarios that most\nimpact the operations of the power grids. We present SafePowerGraph, the first\nsimulator-agnostic, safety-oriented framework and benchmark for GNNs in PS\noperations. SafePowerGraph integrates multiple PF and OPF simulators and\nassesses GNN performance under diverse scenarios, including energy price\nvariations and power line outages. Our extensive experiments underscore the\nimportance of self-supervised learning and graph attention architectures for\nGNN robustness. We provide at https://github.com/yamizi/SafePowerGraph our\nopen-source repository, a comprehensive leaderboard, a dataset and model zoo\nand expect our framework to standardize and advance research in the critical\nfield of GNN for power systems.", "paper_summary_zh": "電網是對現代社會至關重要的關鍵基礎設施，其快速演進和互連性增加了電力系統 (PS) 運作的複雜性。傳統的電網分析方法難以應付大規模再生能源 (RES) 和儲能系統 (ES) 整合的計算需求，促使採用機器學習 (ML) 技術，尤其是圖神經網路 (GNN)。GNN 已被證明可有效解決交流 (AC) 功率流 (PF) 和最佳功率流 (OPF) 問題，這些問題對於運作規劃至關重要。然而，現有的基準和資料集在評估中完全忽略了安全性和穩健性要求，而且從未考慮對電網運作影響最大的現實安全關鍵情境。我們提出 SafePowerGraph，這是第一個與模擬器無關、以安全性為導向的框架和 GNN 基準，用於 PS 運作。SafePowerGraph 整合多個 PF 和 OPF 模擬器，並在各種情境下評估 GNN 效能，包括能源價格變動和輸電線路中斷。我們廣泛的實驗強調了自監督學習和圖注意力架構對於 GNN 穩健性的重要性。我們在 https://github.com/yamizi/SafePowerGraph 提供我們的開放原始碼存放庫、一個全面的排行榜、一個資料集和模型動物園，並期待我們的框架標準化並推進電能系統 GNN 這個關鍵領域的研究。", "author": "Salah Ghamizi et.al.", "authors": "Salah Ghamizi, Aleksandar Bojchevski, Aoxiang Ma, Jun Cao", "id": "2407.12421v1", "paper_url": "http://arxiv.org/abs/2407.12421v1", "repo": "null"}}