{"2501.02598": {"publish_time": "2025-01-05", "title": "GIT-CXR: End-to-End Transformer for Chest X-Ray Report Generation", "paper_summary": "Medical imaging is crucial for diagnosing, monitoring, and treating medical\nconditions. The medical reports of radiology images are the primary medium\nthrough which medical professionals attest their findings, but their writing is\ntime consuming and requires specialized clinical expertise. The automated\ngeneration of radiography reports has thus the potential to improve and\nstandardize patient care and significantly reduce clinicians workload. Through\nour work, we have designed and evaluated an end-to-end transformer-based method\nto generate accurate and factually complete radiology reports for X-ray images.\nAdditionally, we are the first to introduce curriculum learning for end-to-end\ntransformers in medical imaging and demonstrate its impact in obtaining\nimproved performance. The experiments have been conducted using the\nMIMIC-CXR-JPG database, the largest available chest X-ray dataset. The results\nobtained are comparable with the current state-of-the-art on the natural\nlanguage generation (NLG) metrics BLEU and ROUGE-L, while setting new\nstate-of-the-art results on F1 examples-averaged, F1-macro and F1-micro metrics\nfor clinical accuracy and on the METEOR metric widely used for NLG.", "paper_summary_zh": "醫療影像對於診斷、監控和治療醫療狀況至關重要。放射影像的醫療報告是醫護人員證明其發現的主要媒介，但撰寫這些報告非常耗時，且需要專業的臨床專業知識。因此，自動產生放射科報告有可能改善和標準化患者照護，並大幅減少臨床醫師的工作量。透過我們的努力，我們設計並評估了一種端對端基於轉換器的技術，以產生準確且事實上完整的 X 光影像放射科報告。此外，我們率先在醫學影像中為端對端轉換器引入課程學習，並展示了其在獲得改善效能方面的影響。這些實驗已使用 MIMIC-CXR-JPG 資料庫進行，這是最大的可用胸部 X 光影像資料集。所獲得的結果可與自然語言產生 (NLG) 指標 BLEU 和 ROUGE-L 中的現有技術相媲美，同時在 F1 範例平均、F1 巨觀和 F1 微觀指標上設定新的技術水準，以評估臨床準確性，以及在廣泛用於 NLG 的 METEOR 指標上設定新的技術水準。", "author": "Iustin Sîrbu et.al.", "authors": "Iustin Sîrbu, Iulia-Renata Sîrbu, Jasmina Bogojeska, Traian Rebedea", "id": "2501.02598v1", "paper_url": "http://arxiv.org/abs/2501.02598v1", "repo": "null"}}