{"2406.15507": {"publish_time": "2024-06-19", "title": "Few-shot Knowledge Graph Relational Reasoning via Subgraph Adaptation", "paper_summary": "Few-shot Knowledge Graph (KG) Relational Reasoning aims to predict unseen\ntriplets (i.e., query triplets) for rare relations in KGs, given only several\ntriplets of these relations as references (i.e., support triplets). This task\nhas gained significant traction due to the widespread use of knowledge graphs\nin various natural language processing applications. Previous approaches have\nutilized meta-training methods and manually constructed meta-relation sets to\ntackle this task. Recent efforts have focused on edge-mask-based methods, which\nexploit the structure of the contextualized graphs of target triplets (i.e., a\nsubgraph containing relevant triplets in the KG). However, existing\nedge-mask-based methods have limitations in extracting insufficient information\nfrom KG and are highly influenced by spurious information in KG. To overcome\nthese challenges, we propose SAFER (Subgraph Adaptation for Few-shot Relational\nReasoning), a novel approach that effectively adapts the information in\ncontextualized graphs to various subgraphs generated from support and query\ntriplets to perform the prediction. Specifically, SAFER enables the extraction\nof more comprehensive information from support triplets while minimizing the\nimpact of spurious information when predicting query triplets. Experimental\nresults on three prevalent datasets demonstrate the superiority of our proposed\nframework SAFER.", "paper_summary_zh": "小样本知识图谱 (KG) 关系推理旨在预测 KG 中罕见关系的看不见三元组（即查询三元组），而仅给出几个三元组作为参考（即支持三元组）。由于知识图谱在各种自然语言处理应用程序中的广泛使用，这项任务获得了显著的关注。以前的方法利用元训练方法和手动构建的元关系集来解决此任务。最近的努力集中在基于边缘掩码的方法上，该方法利用目标三元组的上下文化图的结构（即包含 KG 中相关三元组的子图）。然而，现有的基于边缘掩码的方法在从 KG 中提取不足信息方面存在局限性，并且受 KG 中虚假信息的极大影响。为了克服这些挑战，我们提出了 SAFER（用于小样本关系推理的子图自适应），一种新颖的方法，它有效地将上下文化图中的信息适应从支持和查询三元组生成的不同子图以执行预测。具体来说，SAFER 能够从支持三元组中提取更全面的信息，同时在预测查询三元组时最大程度地减少虚假信息的影响。在三个流行数据集上的实验结果证明了我们提出的 SAFER 框架的优越性。", "author": "Haochen Liu et.al.", "authors": "Haochen Liu, Song Wang, Chen Chen, Jundong Li", "id": "2406.15507v1", "paper_url": "http://arxiv.org/abs/2406.15507v1", "repo": "null"}}