{"2407.06538": {"publish_time": "2024-07-09", "title": "Enhancing Low-Resource NMT with a Multilingual Encoder and Knowledge Distillation: A Case Study", "paper_summary": "Neural Machine Translation (NMT) remains a formidable challenge, especially\nwhen dealing with low-resource languages. Pre-trained sequence-to-sequence\n(seq2seq) multi-lingual models, such as mBART-50, have demonstrated impressive\nperformance in various low-resource NMT tasks. However, their pre-training has\nbeen confined to 50 languages, leaving out support for numerous low-resource\nlanguages, particularly those spoken in the Indian subcontinent. Expanding\nmBART-50's language support requires complex pre-training, risking performance\ndecline due to catastrophic forgetting. Considering these expanding challenges,\nthis paper explores a framework that leverages the benefits of a pre-trained\nlanguage model along with knowledge distillation in a seq2seq architecture to\nfacilitate translation for low-resource languages, including those not covered\nby mBART-50. The proposed framework employs a multilingual encoder-based\nseq2seq model as the foundational architecture and subsequently uses\ncomplementary knowledge distillation techniques to mitigate the impact of\nimbalanced training. Our framework is evaluated on three low-resource Indic\nlanguages in four Indic-to-Indic directions, yielding significant BLEU-4 and\nchrF improvements over baselines. Further, we conduct human evaluation to\nconfirm effectiveness of our approach. Our code is publicly available at\nhttps://github.com/raypretam/Two-step-low-res-NMT.", "paper_summary_zh": "神經機器翻譯 (NMT) 仍然是一項艱鉅的挑戰，特別是在處理低資源語言時。預訓練序列對序列 (seq2seq) 多語言模型（例如 mBART-50）已在各種低資源 NMT 任務中展現令人印象深刻的效能。然而，他們的預訓練僅限於 50 種語言，無法支援許多低資源語言，特別是印度次大陸所使用的語言。擴充 mBART-50 的語言支援需要複雜的預訓練，由於災難性遺忘，可能會導致效能下降。考量到這些擴充挑戰，本文探討一個架構，它利用預訓練語言模型的優點，以及 seq2seq 架構中的知識提煉，以促進低資源語言的翻譯，包括 mBART-50 未涵蓋的語言。建議的架構採用多語言編碼器為基礎的 seq2seq 模型作為基礎架構，然後使用補充知識提煉技術來減輕不平衡訓練的影響。我們的架構在四個印度語到印度語方向的三種低資源印度語言上進行評估，產生顯著的 BLEU-4 和 chrF 優化，超越基線。此外，我們進行人工評估，以確認我們方法的有效性。我們的程式碼可在 https://github.com/raypretam/Two-step-low-res-NMT 公開取得。", "author": "Aniruddha Roy et.al.", "authors": "Aniruddha Roy, Pretam Ray, Ayush Maheshwari, Sudeshna Sarkar, Pawan Goyal", "id": "2407.06538v1", "paper_url": "http://arxiv.org/abs/2407.06538v1", "repo": "null"}}