{"2409.08792": {"publish_time": "2024-09-13", "title": "Optimizing Ingredient Substitution Using Large Language Models to Enhance Phytochemical Content in Recipes", "paper_summary": "In the emerging field of computational gastronomy, aligning culinary\npractices with scientifically supported nutritional goals is increasingly\nimportant. This study explores how large language models (LLMs) can be applied\nto optimize ingredient substitutions in recipes, specifically to enhance the\nphytochemical content of meals. Phytochemicals are bioactive compounds found in\nplants, which, based on preclinical studies, may offer potential health\nbenefits. We fine-tuned models, including OpenAI's GPT-3.5, DaVinci, and Meta's\nTinyLlama, using an ingredient substitution dataset. These models were used to\npredict substitutions that enhance phytochemical content and create a\ncorresponding enriched recipe dataset. Our approach improved Hit@1 accuracy on\ningredient substitution tasks, from the baseline 34.53 plus-minus 0.10% to\n38.03 plus-minus 0.28% on the original GISMo dataset, and from 40.24 plus-minus\n0.36% to 54.46 plus-minus 0.29% on a refined version of the same dataset. These\nsubstitutions led to the creation of 1,951 phytochemically enriched ingredient\npairings and 1,639 unique recipes. While this approach demonstrates potential\nin optimizing ingredient substitutions, caution must be taken when drawing\nconclusions about health benefits, as the claims are based on preclinical\nevidence. Future work should include clinical validation and broader datasets\nto further evaluate the nutritional impact of these substitutions. This\nresearch represents a step forward in using AI to promote healthier eating\npractices, providing potential pathways for integrating computational methods\nwith nutritional science.", "paper_summary_zh": "<paragraph>在計算美食學的新興領域中，將烹飪實務與科學支持的營養目標相結合，變得越來越重要。本研究探討如何應用大型語言模型 (LLM) 來最佳化食譜中的食材替換，特別是為了提升餐點的植物化學物質含量。植物化學物質是存在於植物中的生物活性化合物，根據臨床前研究，可能提供潛在的健康益處。我們微調了模型，包括 OpenAI 的 GPT-3.5、DaVinci 和 Meta 的 TinyLlama，使用食材替換資料集。這些模型用於預測可提升植物化學物質含量並建立對應的豐富食譜資料集的替換。我們的做法改善了食材替換任務的 Hit@1 準確度，從原本的 GISMo 資料集的 34.53 正負 0.10% 到 38.03 正負 0.28%，以及從同一資料集的精緻版本中的 40.24 正負 0.36% 到 54.46 正負 0.29%。這些替換導致建立了 1,951 個植物化學物質豐富的食材配對和 1,639 個獨特的食譜。雖然這種做法證明了在最佳化食材替換方面具有潛力，但在得出關於健康益處的結論時必須謹慎，因為這些說法是基於臨床前證據。未來的研究應包括臨床驗證和更廣泛的資料集，以進一步評估這些替換的營養影響。這項研究代表了使用 AI 來促進更健康的飲食習慣向前邁進一步，為將計算方法與營養科學整合提供了潛在途徑。</paragraph>", "author": "Luis Rita et.al.", "authors": "Luis Rita, Josh Southern, Ivan Laponogov, Kyle Higgins, Kirill Veselkov", "id": "2409.08792v1", "paper_url": "http://arxiv.org/abs/2409.08792v1", "repo": "null"}}