{"2412.15821": {"publish_time": "2024-12-20", "title": "$π$-yalli: un nouveau corpus pour le nahuatl", "paper_summary": "The NAHU$^2$ project is a Franco-Mexican collaboration aimed at building the\n$\\pi$-YALLI corpus adapted to machine learning, which will subsequently be used\nto develop computer resources for the Nahuatl language. Nahuatl is a language\nwith few computational resources, even though it is a living language spoken by\naround 2 million people. We have decided to build $\\pi$-YALLI, a corpus that\nwill enable to carry out research on Nahuatl in order to develop Language\nModels (LM), whether dynamic or not, which will make it possible to in turn\nenable the development of Natural Language Processing (NLP) tools such as: a) a\ngrapheme unifier, b) a word segmenter, c) a POS grammatical analyser, d) a\ncontent-based Automatic Text Summarization; and possibly, e) a translator\ntranslator (probabilistic or learning-based).", "paper_summary_zh": "NAHU$^2$ 專案是一個法墨合作，旨在建立適用於機器學習的 $\\pi$-YALLI 語料庫，隨後將用於開發納瓦特爾語的電腦資源。納瓦特爾語是一種計算資源稀少的語言，儘管它是一種有約 200 萬人使用的現存語言。我們決定建立 $\\pi$-YALLI，這是一個語料庫，將能夠進行納瓦特爾語研究，以開發語言模型 (LM)，無論動態與否，這將進而能夠開發自然語言處理 (NLP) 工具，例如：a) 音素統一器，b) 字詞分詞器，c) POS 語法分析器，d) 基於內容的自動摘要；以及可能，e) 一個翻譯器（基於機率或學習）。", "author": "Juan-Manuel Torres-Moreno et.al.", "authors": "Juan-Manuel Torres-Moreno, Juan-José Guzmán-Landa, Graham Ranger, Martha Lorena Avendaño Garrido, Miguel Figueroa-Saavedra, Ligia Quintana-Torres, Carlos-Emiliano González-Gallardo, Elvys Linhares Pontes, Patricia Velázquez Morales, Luis-Gil Moreno Jiménez", "id": "2412.15821v1", "paper_url": "http://arxiv.org/abs/2412.15821v1", "repo": "null"}}