{"2408.12139": {"publish_time": "2024-08-22", "title": "DRExplainer: Quantifiable Interpretability in Drug Response Prediction with Directed Graph Convolutional Network", "paper_summary": "Predicting the response of a cancer cell line to a therapeutic drug is\npivotal for personalized medicine. Despite numerous deep learning methods that\nhave been developed for drug response prediction, integrating diverse\ninformation about biological entities and predicting the directional response\nremain major challenges. Here, we propose a novel interpretable predictive\nmodel, DRExplainer, which leverages a directed graph convolutional network to\nenhance the prediction in a directed bipartite network framework. DRExplainer\nconstructs a directed bipartite network integrating multi-omics profiles of\ncell lines, the chemical structure of drugs and known drug response to achieve\ndirected prediction. Then, DRExplainer identifies the most relevant subgraph to\neach prediction in this directed bipartite network by learning a mask,\nfacilitating critical medical decision-making. Additionally, we introduce a\nquantifiable method for model interpretability that leverages a ground truth\nbenchmark dataset curated from biological features. In computational\nexperiments, DRExplainer outperforms state-of-the-art predictive methods and\nanother graph-based explanation method under the same experimental setting.\nFinally, the case studies further validate the interpretability and the\neffectiveness of DRExplainer in predictive novel drug response. Our code is\navailable at: https://github.com/vshy-dream/DRExplainer.", "paper_summary_zh": "預測癌症細胞株對治療藥物的反應對於個人化醫療至關重要。儘管已經開發出許多用於藥物反應預測的深度學習方法，但整合生物實體的多樣信息和預測方向反應仍然是主要的挑戰。在這裡，我們提出了一個新穎的可解釋預測模型 DRExplainer，它利用有向圖卷積網路在有向二部網路框架中增強預測。DRExplainer 構建了一個有向二部網路，整合了細胞系的組學概況、藥物的化學結構和已知的藥物反應，以實現有向預測。然後，DRExplainer 通過學習遮罩識別此有向二部網路中與每個預測最相關的子圖，促進關鍵的醫療決策制定。此外，我們引入了一種量化模型可解釋性的方法，利用從生物特徵中策劃的地面實況基準資料集。在計算實驗中，DRExplainer 在相同的實驗設置下優於最先進的預測方法和另一種基於圖表的解釋方法。最後，案例研究進一步驗證了 DRExplainer 在預測新藥物反應中的可解釋性和有效性。我們的程式碼可在 https://github.com/vshy-dream/DRExplainer 取得。", "author": "Haoyuan Shi et.al.", "authors": "Haoyuan Shi, Tao Xu, Xiaodi Li, Qian Gao, Junfeng Xia, Zhenyu Yue", "id": "2408.12139v1", "paper_url": "http://arxiv.org/abs/2408.12139v1", "repo": "https://github.com/vshy-dream/drexplainer"}}