{"2501.11551": {"publish_time": "2025-01-20", "title": "PIKE-RAG: sPecIalized KnowledgE and Rationale Augmented Generation", "paper_summary": "Despite notable advancements in Retrieval-Augmented Generation (RAG) systems\nthat expand large language model (LLM) capabilities through external retrieval,\nthese systems often struggle to meet the complex and diverse needs of\nreal-world industrial applications. The reliance on retrieval alone proves\ninsufficient for extracting deep, domain-specific knowledge performing in\nlogical reasoning from specialized corpora. To address this, we introduce\nsPecIalized KnowledgE and Rationale Augmentation Generation (PIKE-RAG),\nfocusing on extracting, understanding, and applying specialized knowledge,\nwhile constructing coherent rationale to incrementally steer LLMs toward\naccurate responses. Recognizing the diverse challenges of industrial tasks, we\nintroduce a new paradigm that classifies tasks based on their complexity in\nknowledge extraction and application, allowing for a systematic evaluation of\nRAG systems' problem-solving capabilities. This strategic approach offers a\nroadmap for the phased development and enhancement of RAG systems, tailored to\nmeet the evolving demands of industrial applications. Furthermore, we propose\nknowledge atomizing and knowledge-aware task decomposition to effectively\nextract multifaceted knowledge from the data chunks and iteratively construct\nthe rationale based on original query and the accumulated knowledge,\nrespectively, showcasing exceptional performance across various benchmarks.", "paper_summary_zh": "儘管檢索增強生成（RAG）系統在擴展大型語言模型（LLM）能力方面取得顯著進展，但這些系統經常難以滿足現實世界產業應用的複雜且多樣化的需求。僅依賴檢索被證明不足以從專業語料庫中提取深入的、特定領域的知識，並進行邏輯推理。為了解決這個問題，我們引入了專業知識和原理增強生成（PIKE-RAG），專注於提取、理解和應用專業知識，同時建構連貫的原理以逐步引導 LLM 朝向準確的回應。認識到產業任務的多樣化挑戰，我們引入了一個新的範例，根據知識提取和應用中的複雜性對任務進行分類，從而可以系統地評估 RAG 系統的解決問題能力。這種策略性方法為 RAG 系統的分階段開發和增強提供了路線圖，專門用於滿足產業應用不斷變化的需求。此外，我們提出知識原子化和知識感知任務分解，以有效地從資料區塊中提取多方面的知識，並分別根據原始查詢和累積的知識反覆建構原理，展示了在各種基準測試中的出色效能。", "author": "Jinyu Wang et.al.", "authors": "Jinyu Wang, Jingjing Fu, Lei Song, Jiang Bian", "id": "2501.11551v1", "paper_url": "http://arxiv.org/abs/2501.11551v1", "repo": "null"}}