{"2305.13127": {"publish_time": "2023-05-18", "title": "What Symptoms and How Long? An Interpretable AI Approach for Depression Detection in Social Media", "paper_summary": "Depression is the most prevalent and serious mental illness, which induces\ngrave financial and societal ramifications. Depression detection is key for\nearly intervention to mitigate those consequences. Such a high-stake decision\ninherently necessitates interpretability. Although a few depression detection\nstudies attempt to explain the decision based on the importance score or\nattention weights, these explanations misalign with the clinical depression\ndiagnosis criterion that is based on depressive symptoms. To fill this gap, we\nfollow the computational design science paradigm to develop a novel Multi-Scale\nTemporal Prototype Network (MSTPNet). MSTPNet innovatively detects and\ninterprets depressive symptoms as well as how long they last. Extensive\nempirical analyses using a large-scale dataset show that MSTPNet outperforms\nstate-of-the-art depression detection methods with an F1-score of 0.851. This\nresult also reveals new symptoms that are unnoted in the survey approach, such\nas sharing admiration for a different life. We further conduct a user study to\ndemonstrate its superiority over the benchmarks in interpretability. This study\ncontributes to IS literature with a novel interpretable deep learning model for\ndepression detection in social media. In practice, our proposed method can be\nimplemented in social media platforms to provide personalized online resources\nfor detected depressed patients.", "paper_summary_zh": "憂鬱症是最普遍且嚴重的精神疾病，會造成嚴重的財務和社會後果。憂鬱症的偵測對於早期介入以減輕這些後果至關重要。如此重大的決定本質上需要可解釋性。儘管一些憂鬱症偵測研究嘗試根據重要性分數或注意力權重來解釋這個決定，但這些解釋與基於憂鬱症狀的臨床憂鬱症診斷標準不一致。為了填補這個缺口，我們遵循計算設計科學範例來開發一個新穎的多尺度時間原型網路 (MSTPNet)。MSTPNet 創新地偵測並解釋憂鬱症狀以及它們持續多久。使用大規模資料集進行的廣泛實證分析顯示，MSTPNet 以 0.851 的 F1 分數優於最先進的憂鬱症偵測方法。此結果還揭示了調查方法中未注意到的新症狀，例如分享對不同生活的欽佩。我們進一步進行使用者研究，以證明其在可解釋性方面優於基準。本研究以一個新穎的可解釋深度學習模型為憂鬱症偵測在社群媒體中的 IS 文獻做出貢獻。在實務上，我們提出的方法可以實作在社群媒體平台中，以提供個人化的線上資源給被偵測出憂鬱症的患者。", "author": "Junwei Kuang et.al.", "authors": "Junwei Kuang, Jiaheng Xie, Zhijun Yan", "id": "2305.13127v2", "paper_url": "http://arxiv.org/abs/2305.13127v2", "repo": "null"}}