{"2406.11780": {"publish_time": "2024-06-17", "title": "Split, Unlearn, Merge: Leveraging Data Attributes for More Effective Unlearning in LLMs", "paper_summary": "Large language models (LLMs) have shown to pose social and ethical risks such\nas generating toxic language or facilitating malicious use of hazardous\nknowledge. Machine unlearning is a promising approach to improve LLM safety by\ndirectly removing harmful behaviors and knowledge. In this paper, we propose\n\"SPlit, UNlearn, MerGE\" (SPUNGE), a framework that can be used with any\nunlearning method to amplify its effectiveness. SPUNGE leverages data\nattributes during unlearning by splitting unlearning data into subsets based on\nspecific attribute values, unlearning each subset separately, and merging the\nunlearned models. We empirically demonstrate that SPUNGE significantly improves\nthe performance of two recent unlearning methods on state-of-the-art LLMs while\nmaintaining their general capabilities on standard academic benchmarks.", "paper_summary_zh": "大型語言模型 (LLM) 已顯示會造成社會和道德風險，例如產生有毒語言或促進惡意使用危險知識。機器遺忘是一種有前途的方法，可透過直接移除有害行為和知識來改善 LLM 的安全性。在本文中，我們提出「SPlit, UNlearn, MerGE」（SPUNGE），一個可與任何遺忘方法一起使用以擴大其有效性的框架。SPUNGE 在遺忘過程中利用資料屬性，透過根據特定屬性值將遺忘資料分割成子集、個別遺忘每個子集，然後合併已遺忘的模型。我們透過實證證明，SPUNGE 在最先進的 LLM 上顯著改善了兩種最新遺忘方法的效能，同時在標準學術基準上維持其一般能力。", "author": "Swanand Ravindra Kadhe et.al.", "authors": "Swanand Ravindra Kadhe, Farhan Ahmed, Dennis Wei, Nathalie Baracaldo, Inkit Padhi", "id": "2406.11780v1", "paper_url": "http://arxiv.org/abs/2406.11780v1", "repo": "null"}}