{"2410.13783": {"publish_time": "2024-10-17", "title": "Quantity vs. Quality of Monolingual Source Data in Automatic Text Translation: Can It Be Too Little If It Is Too Good?", "paper_summary": "Monolingual data, being readily available in large quantities, has been used\nto upscale the scarcely available parallel data to train better models for\nautomatic translation. Self-learning, where a model is made to learn from its\noutput, is one approach to exploit such data. However, it has been shown that\ntoo much of this data can be detrimental to the performance of the model if the\navailable parallel data is comparatively extremely low. In this study, we\ninvestigate whether the monolingual data can also be too little and if this\nreduction, based on quality, has any effect on the performance of the\ntranslation model. Experiments have shown that on English-German low-resource\nNMT, it is often better to select only the most useful additional data, based\non quality or closeness to the domain of the test data, than utilizing all of\nthe available data.", "paper_summary_zh": "大量容易取得的單語資料，已被用於升級數量稀少的平行資料，以訓練出更好的自動翻譯模型。自學，其中一個模型會從其輸出結果中學習，是一種利用此類資料的方法。然而，已顯示出如果可用的平行資料相對極少，那麼過多的此類資料可能會對模型的效能造成損害。在本研究中，我們探討單語資料是否也可能太少，以及基於品質的這種減少是否對翻譯模型的效能有任何影響。實驗顯示，在英語-德語低資源 NMT 中，根據品質或與測試資料領域的接近程度，僅選取最有用的額外資料，通常比利用所有可用的資料來得更好。", "author": "Idris Abdulmumin et.al.", "authors": "Idris Abdulmumin, Bashir Shehu Galadanci, Garba Aliyu, Shamsuddeen Hassan Muhammad", "id": "2410.13783v1", "paper_url": "http://arxiv.org/abs/2410.13783v1", "repo": "null"}}