{"2406.09412": {"publish_time": "2024-06-13", "title": "Explore the Limits of Omni-modal Pretraining at Scale", "paper_summary": "We propose to build omni-modal intelligence, which is capable of\nunderstanding any modality and learning universal representations. In specific,\nwe propose a scalable pretraining paradigm, named Multimodal Context (MiCo),\nwhich can scale up the numbers of modalities and amount of data, together with\nthe model parameters, in the pretraining process. With MiCo, the pretrained\nmodels show significant emergent abilities in multimodal learning, which are\nevaluated on the following tasks: i) single-modality perception benchmarks of\n10 different modalities, ii) 25 cross-modality understanding tasks of\nretrieval, question-answering, captioning, and iii) 18 multimodal large\nlanguage model benchmarks. Our models establish 37 new records for\nstate-of-the-art performance. We hope that our research could contribute to the\ndevelopment of omni-modal intelligence. Code and Models are at\nhttps://github.com/invictus717/MiCo", "paper_summary_zh": "<paragraph>我們提議建立全模態智能，它能夠理解任何模態並學習通用表示。具體來說，我們提出了一個可擴展的預訓練範例，名為多模態上下文 (MiCo)，它可以在預訓練過程中擴展模態數量和數據量，以及模型參數。使用 MiCo，預訓練模型在多模態學習中展現出顯著的新興能力，這些能力在以下任務中得到評估：i) 10 種不同模態的單模態感知基準，ii) 25 個跨模態理解任務，包括檢索、問答、字幕，以及 iii) 18 個多模態大型語言模型基準。我們的模型為最先進的性能建立了 37 項新紀錄。我們希望我們的研究能為全模態智能的發展做出貢獻。程式碼和模型可在 https://github.com/invictus717/MiCo 找到</paragraph>", "author": "Yiyuan Zhang et.al.", "authors": "Yiyuan Zhang, Handong Li, Jing Liu, Xiangyu Yue", "id": "2406.09412v1", "paper_url": "http://arxiv.org/abs/2406.09412v1", "repo": "https://github.com/invictus717/MiCo"}}