{"2408.07344": {"publish_time": "2024-08-14", "title": "RTAT: A Robust Two-stage Association Tracker for Multi-Object Tracking", "paper_summary": "Data association is an essential part in the tracking-by-detection based\nMulti-Object Tracking (MOT). Most trackers focus on how to design a better data\nassociation strategy to improve the tracking performance. The rule-based\nhandcrafted association methods are simple and highly efficient but lack\ngeneralization capability to deal with complex scenes. While the learnt\nassociation methods can learn high-order contextual information to deal with\nvarious complex scenes, but they have the limitations of higher complexity and\ncost. To address these limitations, we propose a Robust Two-stage Association\nTracker, named RTAT. The first-stage association is performed between tracklets\nand detections to generate tracklets with high purity, and the second-stage\nassociation is performed between tracklets to form complete trajectories. For\nthe first-stage association, we use a simple data association strategy to\ngenerate tracklets with high purity by setting a low threshold for the matching\ncost in the assignment process. We conduct the tracklet association in the\nsecond-stage based on the framework of message-passing GNN. Our method models\nthe tracklet association as a series of edge classification problem in\nhierarchical graphs, which can recursively merge short tracklets into longer\nones. Our tracker RTAT ranks first on the test set of MOT17 and MOT20\nbenchmarks in most of the main MOT metrics: HOTA, IDF1, and AssA. We achieve\n67.2 HOTA, 84.7 IDF1, and 69.7 AssA on MOT17, and 66.2 HOTA, 82.5 IDF1, and\n68.1 AssA on MOT20.", "paper_summary_zh": "資料關聯是基於追蹤偵測的多目標追蹤 (MOT) 中不可或缺的一部分。大多數追蹤器專注於如何設計更好的資料關聯策略來提升追蹤效能。基於規則的手工關聯方法簡單且高效率，但缺乏處理複雜場景的概化能力。雖然學習關聯方法可以學習高階脈絡資訊來處理各種複雜場景，但它們有較高複雜度和成本的限制。為了解決這些限制，我們提出了一個名為 RTAT 的穩健兩階段關聯追蹤器。第一階段關聯在軌跡和偵測之間執行，以產生具有高純度的軌跡，第二階段關聯在軌跡之間執行，以形成完整的軌跡。對於第一階段關聯，我們使用一個簡單的資料關聯策略，透過在指派過程中設定匹配成本的低閾值來產生具有高純度的軌跡。我們在訊息傳遞 GNN 的架構中進行第二階段軌跡關聯。我們的模型將軌跡關聯建模為分層圖中的一系列邊緣分類問題，它可以遞迴地將短軌跡合併為較長的軌跡。我們的追蹤器 RTAT 在 MOT17 和 MOT20 基準測試的測試集中，在大部分 MOT 主要指標：HOTA、IDF1 和 AssA 中排名第一。我們在 MOT17 上達到 67.2 HOTA、84.7 IDF1 和 69.7 AssA，在 MOT20 上達到 66.2 HOTA、82.5 IDF1 和 68.1 AssA。", "author": "Song Guo et.al.", "authors": "Song Guo, Rujie Liu, Narishige Abe", "id": "2408.07344v1", "paper_url": "http://arxiv.org/abs/2408.07344v1", "repo": "null"}}