{"2410.11619": {"publish_time": "2024-10-15", "title": "MultiVENT 2.0: A Massive Multilingual Benchmark for Event-Centric Video Retrieval", "paper_summary": "Efficiently retrieving and synthesizing information from large-scale\nmultimodal collections has become a critical challenge. However, existing video\nretrieval datasets suffer from scope limitations, primarily focusing on\nmatching descriptive but vague queries with small collections of professionally\nedited, English-centric videos. To address this gap, we introduce\n$\\textbf{MultiVENT 2.0}$, a large-scale, multilingual event-centric video\nretrieval benchmark featuring a collection of more than 218,000 news videos and\n3,906 queries targeting specific world events. These queries specifically\ntarget information found in the visual content, audio, embedded text, and text\nmetadata of the videos, requiring systems leverage all these sources to succeed\nat the task. Preliminary results show that state-of-the-art vision-language\nmodels struggle significantly with this task, and while alternative approaches\nshow promise, they are still insufficient to adequately address this problem.\nThese findings underscore the need for more robust multimodal retrieval\nsystems, as effective video retrieval is a crucial step towards multimodal\ncontent understanding and generation tasks.", "paper_summary_zh": "有效地從大型多模態集合中擷取和綜合資訊已成為一項重大的挑戰。然而，現有的影片擷取資料集受限於範圍，主要著重於將描述性但模糊的查詢與少數經過專業編輯、以英語為中心的影片集合相匹配。為了解決此差距，我們引入了 $\\textbf{MultiVENT 2.0}$，這是一個大型、多語言的以事件為中心的影片擷取基準，其特點是收集了超過 218,000 個新聞影片和 3,906 個針對特定世界事件的查詢。這些查詢特別針對影片中的視覺內容、音訊、嵌入式文字和文字元資料中找到的資訊，要求系統利用所有這些來源才能成功執行此任務。初步結果顯示，最先進的視覺語言模型在執行此任務時會遇到很大的困難，而雖然其他方法顯示出潛力，但仍不足以充分解決此問題。這些發現強調了對更強大的多模態擷取系統的需求，因為有效的影片擷取是邁向多模態內容理解和生成任務的關鍵步驟。", "author": "Reno Kriz et.al.", "authors": "Reno Kriz, Kate Sanders, David Etter, Kenton Murray, Cameron Carpenter, Kelly Van Ochten, Hannah Recknor, Jimena Guallar-Blasco, Alexander Martin, Ronald Colaianni, Nolan King, Eugene Yang, Benjamin Van Durme", "id": "2410.11619v1", "paper_url": "http://arxiv.org/abs/2410.11619v1", "repo": "null"}}