{"2406.19760": {"publish_time": "2024-06-28", "title": "Learning Interpretable Legal Case Retrieval via Knowledge-Guided Case Reformulation", "paper_summary": "Legal case retrieval for sourcing similar cases is critical in upholding\njudicial fairness. Different from general web search, legal case retrieval\ninvolves processing lengthy, complex, and highly specialized legal documents.\nExisting methods in this domain often overlook the incorporation of legal\nexpert knowledge, which is crucial for accurately understanding and modeling\nlegal cases, leading to unsatisfactory retrieval performance. This paper\nintroduces KELLER, a legal knowledge-guided case reformulation approach based\non large language models (LLMs) for effective and interpretable legal case\nretrieval. By incorporating professional legal knowledge about crimes and law\narticles, we enable large language models to accurately reformulate the\noriginal legal case into concise sub-facts of crimes, which contain the\nessential information of the case. Extensive experiments on two legal case\nretrieval benchmarks demonstrate superior retrieval performance and robustness\non complex legal case queries of KELLER over existing methods.", "paper_summary_zh": "法律案例檢索對於尋找類似的案例至關重要，以維護司法公正。與一般網路檢索不同，法律案例檢索涉及處理冗長、複雜且高度專業的法律文件。此領域現有方法通常忽略納入法律專家知識，而這對於準確理解和建模法律案例至關重要，導致檢索績效不佳。本文介紹 KELLER，一種基於大型語言模型 (LLM) 的法律知識引導案例重述方法，用於有效且可解釋的法律案例檢索。透過納入有關犯罪和法律條文的專業法律知識，我們讓大型語言模型能夠準確地將原始法律案例重新表述為簡潔的犯罪子事實，其中包含案件的基本資訊。在兩個法律案例檢索基準上進行的廣泛實驗，證明了 KELLER 在複雜的法律案例查詢上，比現有方法具有優異的檢索效能和穩健性。", "author": "Chenlong Deng et.al.", "authors": "Chenlong Deng, Kelong Mao, Zhicheng Dou", "id": "2406.19760v1", "paper_url": "http://arxiv.org/abs/2406.19760v1", "repo": "null"}}