{"2405.11778": {"publish_time": "2024-05-20", "title": "Efficient Multi-agent Reinforcement Learning by Planning", "paper_summary": "Multi-agent reinforcement learning (MARL) algorithms have accomplished\nremarkable breakthroughs in solving large-scale decision-making tasks.\nNonetheless, most existing MARL algorithms are model-free, limiting sample\nefficiency and hindering their applicability in more challenging scenarios. In\ncontrast, model-based reinforcement learning (MBRL), particularly algorithms\nintegrating planning, such as MuZero, has demonstrated superhuman performance\nwith limited data in many tasks. Hence, we aim to boost the sample efficiency\nof MARL by adopting model-based approaches. However, incorporating planning and\nsearch methods into multi-agent systems poses significant challenges. The\nexpansive action space of multi-agent systems often necessitates leveraging the\nnearly-independent property of agents to accelerate learning. To tackle this\nissue, we propose the MAZero algorithm, which combines a centralized model with\nMonte Carlo Tree Search (MCTS) for policy search. We design a novel network\nstructure to facilitate distributed execution and parameter sharing. To enhance\nsearch efficiency in deterministic environments with sizable action spaces, we\nintroduce two novel techniques: Optimistic Search Lambda (OS($\\lambda$)) and\nAdvantage-Weighted Policy Optimization (AWPO). Extensive experiments on the\nSMAC benchmark demonstrate that MAZero outperforms model-free approaches in\nterms of sample efficiency and provides comparable or better performance than\nexisting model-based methods in terms of both sample and computational\nefficiency. Our code is available at https://github.com/liuqh16/MAZero.", "paper_summary_zh": "多智能體強化學習 (MARL) 演算法在解決大規模決策制定任務方面取得了顯著的突破。儘管如此，現有的 MARL 演算法大多是無模型的，限制了樣本效率，並阻礙了它們在更具挑戰性的場景中的應用。相比之下，基於模型的強化學習 (MBRL)，特別是整合規劃的演算法，例如 MuZero，已經在許多任務中以有限的數據展示出超人的表現。因此，我們旨在通過採用基於模型的方法來提高 MARL 的樣本效率。然而，將規劃和搜尋方法整合到多智能體系統中會帶來重大的挑戰。多智能體系統的廣泛動作空間通常需要利用智能體的近乎獨立屬性來加速學習。為了解決這個問題，我們提出了 MAZero 演算法，它結合了集中式模型與蒙地卡羅樹搜尋 (MCTS) 進行策略搜尋。我們設計了一種新穎的網路結構，以促進分散式執行和參數共享。為了提高具有相當大動作空間的確定性環境中的搜尋效率，我們引入了兩種新技術：樂觀搜尋 Lambda (OS($\\lambda$)) 和優勢加權策略最佳化 (AWPO)。在 SMAC 基準上的大量實驗表明，MAZero 在樣本效率方面優於無模型方法，並且在樣本和計算效率方面提供了與現有的基於模型的方法相當或更好的效能。我們的程式碼可在 https://github.com/liuqh16/MAZero 獲得。", "author": "Qihan Liu et.al.", "authors": "Qihan Liu, Jianing Ye, Xiaoteng Ma, Jun Yang, Bin Liang, Chongjie Zhang", "id": "2405.11778v1", "paper_url": "http://arxiv.org/abs/2405.11778v1", "repo": "https://github.com/liuqh16/mazero"}}