{"2408.00350": {"publish_time": "2024-08-01", "title": "A Simple Background Augmentation Method for Object Detection with Diffusion Model", "paper_summary": "In computer vision, it is well-known that a lack of data diversity will\nimpair model performance. In this study, we address the challenges of enhancing\nthe dataset diversity problem in order to benefit various downstream tasks such\nas object detection and instance segmentation. We propose a simple yet\neffective data augmentation approach by leveraging advancements in generative\nmodels, specifically text-to-image synthesis technologies like Stable\nDiffusion. Our method focuses on generating variations of labeled real images,\nutilizing generative object and background augmentation via inpainting to\naugment existing training data without the need for additional annotations. We\nfind that background augmentation, in particular, significantly improves the\nmodels' robustness and generalization capabilities. We also investigate how to\nadjust the prompt and mask to ensure the generated content comply with the\nexisting annotations. The efficacy of our augmentation techniques is validated\nthrough comprehensive evaluations of the COCO dataset and several other key\nobject detection benchmarks, demonstrating notable enhancements in model\nperformance across diverse scenarios. This approach offers a promising solution\nto the challenges of dataset enhancement, contributing to the development of\nmore accurate and robust computer vision models.", "paper_summary_zh": "在電腦視覺中，眾所周知資料的多樣性不足會影響模型的效能。在本研究中，我們探討了提升資料集多樣性問題的挑戰，以利於各種下游任務，例如物件偵測和實例分割。我們提出一個簡單但有效的資料擴充方法，利用生成模型的進展，特別是文字轉圖像合成技術，例如 Stable Diffusion。我們的做法專注於產生標記真實影像的變化，利用生成物件和背景擴充，透過修補來擴充現有的訓練資料，而無需額外的註解。我們發現背景擴充，特別是顯著地改善了模型的穩健性和泛化能力。我們還探討如何調整提示和遮罩，以確保產生的內容符合現有的註解。我們透過 COCO 資料集和幾個其他關鍵物件偵測基準的全面評估，驗證了我們的擴充技術的效能，展示了在各種場景中模型效能的顯著提升。這種方法為資料集增強的挑戰提供了有希望的解決方案，有助於開發更準確和穩健的電腦視覺模型。", "author": "Yuhang Li et.al.", "authors": "Yuhang Li, Xin Dong, Chen Chen, Weiming Zhuang, Lingjuan Lyu", "id": "2408.00350v1", "paper_url": "http://arxiv.org/abs/2408.00350v1", "repo": "null"}}