{"2406.07268": {"publish_time": "2024-06-11", "title": "Advancing Grounded Multimodal Named Entity Recognition via LLM-Based Reformulation and Box-Based Segmentation", "paper_summary": "Grounded Multimodal Named Entity Recognition (GMNER) task aims to identify\nnamed entities, entity types and their corresponding visual regions. GMNER task\nexhibits two challenging attributes: 1) The tenuous correlation between images\nand text on social media contributes to a notable proportion of named entities\nbeing ungroundable. 2) There exists a distinction between coarse-grained noun\nphrases used in similar tasks (e.g., phrase localization) and fine-grained\nnamed entities. In this paper, we propose RiVEG, a unified framework that\nreformulates GMNER into a joint MNER-VE-VG task by leveraging large language\nmodels (LLMs) as connecting bridges. This reformulation brings two benefits: 1)\nIt enables us to optimize the MNER module for optimal MNER performance and\neliminates the need to pre-extract region features using object detection\nmethods, thus naturally addressing the two major limitations of existing GMNER\nmethods. 2) The introduction of Entity Expansion Expression module and Visual\nEntailment (VE) module unifies Visual Grounding (VG) and Entity Grounding (EG).\nThis endows the proposed framework with unlimited data and model scalability.\nFurthermore, to address the potential ambiguity stemming from the\ncoarse-grained bounding box output in GMNER, we further construct the new\nSegmented Multimodal Named Entity Recognition (SMNER) task and corresponding\nTwitter-SMNER dataset aimed at generating fine-grained segmentation masks, and\nexperimentally demonstrate the feasibility and effectiveness of using box\nprompt-based Segment Anything Model (SAM) to empower any GMNER model with the\nability to accomplish the SMNER task. Extensive experiments demonstrate that\nRiVEG significantly outperforms SoTA methods on four datasets across the MNER,\nGMNER, and SMNER tasks.", "paper_summary_zh": "<paragraph>接地多模态命名实体识别 (GMNER) 任务旨在识别命名实体、实体类型及其对应的视觉区域。GMNER 任务展现出两个具有挑战性的属性：1) 图像和社交媒体文本之间的微弱关联导致相当一部分命名实体无法接地。2) 在类似任务（例如，短语定位）中使用的粗粒度名词短语与细粒度命名实体之间存在区别。在本文中，我们提出了 RiVEG，这是一个统一的框架，通过利用大型语言模型 (LLM) 作为连接桥梁，将 GMNER 重新表述为联合 MNER-VE-VG 任务。这种重新表述带来了两个好处：1) 它使我们能够针对最佳 MNER 性能优化 MNER 模块，并消除了使用对象检测方法预先提取区域特征的需要，从而自然地解决了现有 GMNER 方法的两个主要限制。2) 实体扩展表达式模块和视觉蕴涵 (VE) 模块的引入统一了视觉接地 (VG) 和实体接地 (EG)。这赋予了所提出的框架无限的数据和模型可扩展性。此外，为了解决源自 GMNER 中粗粒度边界框输出的潜在歧义，我们进一步构建了新的分段多模态命名实体识别 (SMNER) 任务和相应的 Twitter-SMNER 数据集，旨在生成细粒度分割掩码，并通过实验展示了使用基于框提示的 Segment Anything Model (SAM) 增强任何 GMNER 模型以完成 SMNER 任务的可行性和有效性。大量实验表明，RiVEG 在四个数据集上的 MNER、GMNER 和 SMNER 任务中明显优于 SoTA 方法。</paragraph>", "author": "Jinyuan Li et.al.", "authors": "Jinyuan Li, Ziyan Li, Han Li, Jianfei Yu, Rui Xia, Di Sun, Gang Pan", "id": "2406.07268v1", "paper_url": "http://arxiv.org/abs/2406.07268v1", "repo": "null"}}