{"2412.17595": {"publish_time": "2024-12-23", "title": "V$^2$-SfMLearner: Learning Monocular Depth and Ego-motion for Multimodal Wireless Capsule Endoscopy", "paper_summary": "Deep learning can predict depth maps and capsule ego-motion from capsule\nendoscopy videos, aiding in 3D scene reconstruction and lesion localization.\nHowever, the collisions of the capsule endoscopies within the gastrointestinal\ntract cause vibration perturbations in the training data. Existing solutions\nfocus solely on vision-based processing, neglecting other auxiliary signals\nlike vibrations that could reduce noise and improve performance. Therefore, we\npropose V$^2$-SfMLearner, a multimodal approach integrating vibration signals\ninto vision-based depth and capsule motion estimation for monocular capsule\nendoscopy. We construct a multimodal capsule endoscopy dataset containing\nvibration and visual signals, and our artificial intelligence solution develops\nan unsupervised method using vision-vibration signals, effectively eliminating\nvibration perturbations through multimodal learning. Specifically, we carefully\ndesign a vibration network branch and a Fourier fusion module, to detect and\nmitigate vibration noises. The fusion framework is compatible with popular\nvision-only algorithms. Extensive validation on the multimodal dataset\ndemonstrates superior performance and robustness against vision-only\nalgorithms. Without the need for large external equipment, our V$^2$-SfMLearner\nhas the potential for integration into clinical capsule robots, providing\nreal-time and dependable digestive examination tools. The findings show promise\nfor practical implementation in clinical settings, enhancing the diagnostic\ncapabilities of doctors.", "paper_summary_zh": "深度學習可以從膠囊內視鏡影片預測深度圖和膠囊自我運動，協助進行 3D 場景重建和病灶定位。\n然而，膠囊內視鏡在胃腸道內的碰撞會造成訓練資料中的振動擾動。現有的解決方案僅專注於基於視覺的處理，忽略了其他輔助訊號，例如可以降低雜訊和提升效能的振動。因此，我們提出 V$^2$-SfMLearner，這是一種多模態方法，將振動訊號整合到基於視覺的深度和膠囊運動估計中，用於單眼膠囊內視鏡。我們建構了一個包含振動和視覺訊號的多模態膠囊內視鏡資料集，而我們的人工智慧解決方案使用視覺振動訊號開發了一種非監督式方法，透過多模態學習有效消除振動擾動。具體來說，我們仔細設計了一個振動網路分支和一個傅立葉融合模組，以偵測和減輕振動雜訊。融合架構與常見的純視覺演算法相容。在多模態資料集上的廣泛驗證證明了與純視覺演算法相比，其具有優異的效能和穩健性。我們的 V$^2$-SfMLearner 無需大型外部設備，有潛力整合到臨床膠囊機器人中，提供即時且可靠的消化道檢查工具。研究結果顯示在臨床環境中實際執行的可能性，提升醫師的診斷能力。", "author": "Long Bai et.al.", "authors": "Long Bai, Beilei Cui, Liangyu Wang, Yanheng Li, Shilong Yao, Sishen Yuan, Yanan Wu, Yang Zhang, Max Q. -H. Meng, Zhen Li, Weiping Ding, Hongliang Ren", "id": "2412.17595v1", "paper_url": "http://arxiv.org/abs/2412.17595v1", "repo": "null"}}