{"2407.05910": {"publish_time": "2024-07-08", "title": "Enhancing Vision-Language Models with Scene Graphs for Traffic Accident Understanding", "paper_summary": "Recognizing a traffic accident is an essential part of any autonomous driving\nor road monitoring system. An accident can appear in a wide variety of forms,\nand understanding what type of accident is taking place may be useful to\nprevent it from reoccurring. The task of being able to classify a traffic scene\nas a specific type of accident is the focus of this work. We approach the\nproblem by likening a traffic scene to a graph, where objects such as cars can\nbe represented as nodes, and relative distances and directions between them as\nedges. This representation of an accident can be referred to as a scene graph,\nand is used as input for an accident classifier. Better results can be obtained\nwith a classifier that fuses the scene graph input with representations from\nvision and language. This work introduces a multi-stage, multimodal pipeline to\npre-process videos of traffic accidents, encode them as scene graphs, and align\nthis representation with vision and language modalities for accident\nclassification. When trained on 4 classes, our method achieves a balanced\naccuracy score of 57.77% on an (unbalanced) subset of the popular Detection of\nTraffic Anomaly (DoTA) benchmark, representing an increase of close to 5\npercentage points from the case where scene graph information is not taken into\naccount.", "paper_summary_zh": "辨識交通事故是任何自動駕駛或道路監控系統的必要部分。事故可能以各種形式出現，了解事故類型可能有助於防止再次發生。將交通事故場景分類為特定事故類型的任務是這項工作的重點。我們將交通事故場景比喻為圖形來解決問題，其中汽車等物體可以表示為節點，而它們之間的相對距離和方向則表示為邊緣。這種事故表示可以稱為場景圖，並用作事故分類器的輸入。使用將場景圖輸入與視覺和語言表示融合的分類器可以獲得更好的結果。這項工作引入了一個多階段、多模態管道，用於預處理交通事故影片、將其編碼為場景圖，以及將此表示與視覺和語言模式對齊以進行事故分類。當在 4 個類別上進行訓練時，我們的模型在熱門交通異常檢測 (DoTA) 基準的（不平衡）子集上實現了 57.77% 的平衡準確率，比不考慮場景圖資訊的情況提高了接近 5 個百分點。", "author": "Aaron Lohner et.al.", "authors": "Aaron Lohner, Francesco Compagno, Jonathan Francis, Alessandro Oltramari", "id": "2407.05910v1", "paper_url": "http://arxiv.org/abs/2407.05910v1", "repo": "null"}}