{"2405.07562": {"publish_time": "2024-05-13", "title": "GLiRA: Black-Box Membership Inference Attack via Knowledge Distillation", "paper_summary": "While Deep Neural Networks (DNNs) have demonstrated remarkable performance in\ntasks related to perception and control, there are still several unresolved\nconcerns regarding the privacy of their training data, particularly in the\ncontext of vulnerability to Membership Inference Attacks (MIAs). In this paper,\nwe explore a connection between the susceptibility to membership inference\nattacks and the vulnerability to distillation-based functionality stealing\nattacks. In particular, we propose {GLiRA}, a distillation-guided approach to\nmembership inference attack on the black-box neural network. We observe that\nthe knowledge distillation significantly improves the efficiency of likelihood\nratio of membership inference attack, especially in the black-box setting,\ni.e., when the architecture of the target model is unknown to the attacker. We\nevaluate the proposed method across multiple image classification datasets and\nmodels and demonstrate that likelihood ratio attacks when guided by the\nknowledge distillation, outperform the current state-of-the-art membership\ninference attacks in the black-box setting.", "paper_summary_zh": "儘管深度神經網路 (DNN) 已在與感知和控制相關的任務中展現出顯著的效能，但對於其訓練資料的隱私仍有幾個未解決的問題，特別是在容易受到成員推論攻擊 (MIA) 的情況下。在本文中，我們探討成員推論攻擊的敏感性與容易受到基於蒸餾的功能竊取攻擊的漏洞之間的關聯。特別是，我們提出 {GLiRA}，一種蒸餾引導的黑箱神經網路成員推論攻擊方法。我們觀察到，知識蒸餾顯著提升了成員推論攻擊的似然比效率，特別是在黑箱設定中，亦即攻擊者不知道目標模型的架構時。我們在多個影像分類資料集和模型中評估所提出的方法，並證明在黑箱設定中，由知識蒸餾引導的似然比攻擊優於目前最先進的成員推論攻擊。", "author": "Andrey V. Galichin et.al.", "authors": "Andrey V. Galichin, Mikhail Pautov, Alexey Zhavoronkin, Oleg Y. Rogov, Ivan Oseledets", "id": "2405.07562v1", "paper_url": "http://arxiv.org/abs/2405.07562v1", "repo": "null"}}