{"2412.04277": {"publish_time": "2024-12-05", "title": "Arabic Stable LM: Adapting Stable LM 2 1.6B to Arabic", "paper_summary": "Large Language Models (LLMs) have shown impressive results in multiple\ndomains of natural language processing (NLP) but are mainly focused on the\nEnglish language. Recently, more LLMs have incorporated a larger proportion of\nmultilingual text to represent low-resource languages. In Arabic NLP, several\nArabic-centric LLMs have shown remarkable results on multiple benchmarks in the\npast two years. However, most Arabic LLMs have more than 7 billion parameters,\nwhich increases their hardware requirements and inference latency, when\ncompared to smaller LLMs. This paper introduces Arabic Stable LM 1.6B in a base\nand chat version as a small but powerful Arabic-centric LLM. Our Arabic Stable\nLM 1.6B chat model achieves impressive results on several benchmarks beating\nmultiple models with up to 8x the parameters. In addition, we show the benefit\nof mixing in synthetic instruction tuning data by augmenting our fine-tuning\ndata with a large synthetic dialogue dataset.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言處理 (NLP) 的多個領域中展現令人印象深刻的成果，但主要著重於英語。最近，更多 LLM 融入了更大比例的多語言文字，以呈現低資源語言。在阿拉伯語 NLP 中，幾個以阿拉伯語為中心的 LLM 在過去兩年中，在多個基準測試中展現卓越的成果。然而，大多數阿拉伯語 LLM 擁有超過 70 億個參數，與較小的 LLM 相比，這會增加其硬體需求和推論延遲。本文介紹了基礎版和聊天版的阿拉伯語 Stable LM 1.6B，作為一個小巧但強大的以阿拉伯語為中心的 LLM。我們的阿拉伯語 Stable LM 1.6B 聊天模型在幾個基準測試中獲得令人印象深刻的成果，擊敗多個參數多達 8 倍的模型。此外，我們展示了混合合成指令調整資料的好處，方法是用大型合成對話資料集擴充我們的微調資料。", "author": "Zaid Alyafeai et.al.", "authors": "Zaid Alyafeai, Michael Pieler, Hannah Teufel, Jonathan Tow, Marco Bellagente, Duy Phung, Nikhil Pinnaparaju, Reshinth Adithyan, Paulo Rocha, Maksym Zhuravinskyi, Carlos Riquelme", "id": "2412.04277v1", "paper_url": "http://arxiv.org/abs/2412.04277v1", "repo": "null"}}