{"2406.17716": {"publish_time": "2024-06-25", "title": "ViANLI: Adversarial Natural Language Inference for Vietnamese", "paper_summary": "The development of Natural Language Processing (NLI) datasets and models has\nbeen inspired by innovations in annotation design. With the rapid development\nof machine learning models today, the performance of existing machine learning\nmodels has quickly reached state-of-the-art results on a variety of tasks\nrelated to natural language processing, including natural language inference\ntasks. By using a pre-trained model during the annotation process, it is\npossible to challenge current NLI models by having humans produce\npremise-hypothesis combinations that the machine model cannot correctly\npredict. To remain attractive and challenging in the research of natural\nlanguage inference for Vietnamese, in this paper, we introduce the adversarial\nNLI dataset to the NLP research community with the name ViANLI. This data set\ncontains more than 10K premise-hypothesis pairs and is built by a continuously\nadjusting process to obtain the most out of the patterns generated by the\nannotators. ViANLI dataset has brought many difficulties to many current SOTA\nmodels when the accuracy of the most powerful model on the test set only\nreached 48.4%. Additionally, the experimental results show that the models\ntrained on our dataset have significantly improved the results on other\nVietnamese NLI datasets.", "paper_summary_zh": "自然語言處理 (NLI) 資料集和模型的開發靈感來自於標註設計的創新。隨著當今機器學習模型的快速發展，現有的機器學習模型的效能已迅速在各種與自然語言處理相關的任務上達到最先進的成果，包括自然語言推論任務。透過在標註過程中使用預先訓練的模型，可以透過讓人們產生機器模型無法正確預測的前提假設組合來挑戰當前的 NLI 模型。為了在越南語自然語言推論的研究中保持吸引力和挑戰性，在本文中，我們向 NLP 研究社群介紹對抗式 NLI 資料集，並將其命名為 ViANLI。此資料集包含超過 10K 個前提假設對，並透過持續調整的流程建置，以充分利用標註員產生的模式。ViANLI 資料集為許多現有的 SOTA 模型帶來了許多困難，因為在測試集上最強大模型的準確度僅達到 48.4%。此外，實驗結果顯示，在我們的資料集上訓練的模型已顯著改善其他越南語 NLI 資料集的結果。", "author": "Tin Van Huynh et.al.", "authors": "Tin Van Huynh, Kiet Van Nguyen, Ngan Luu-Thuy Nguyen", "id": "2406.17716v1", "paper_url": "http://arxiv.org/abs/2406.17716v1", "repo": "null"}}