{"2502.17387": {"publish_time": "2025-02-24", "title": "Big-Math: A Large-Scale, High-Quality Math Dataset for Reinforcement Learning in Language Models", "paper_summary": "Increasing interest in reasoning models has led math to become a prominent\ntesting ground for algorithmic and methodological improvements. However,\nexisting open math datasets either contain a small collection of high-quality,\nhuman-written problems or a large corpus of machine-generated problems of\nuncertain quality, forcing researchers to choose between quality and quantity.\nIn this work, we present Big-Math, a dataset of over 250,000 high-quality math\nquestions with verifiable answers, purposefully made for reinforcement learning\n(RL). To create Big-Math, we rigorously filter, clean, and curate openly\navailable datasets, extracting questions that satisfy our three desiderata: (1)\nproblems with uniquely verifiable solutions, (2) problems that are open-ended,\n(3) and problems with a closed-form solution. To ensure the quality of\nBig-Math, we manually verify each step in our filtering process. Based on the\nfindings from our filtering process, we introduce 47,000 new questions with\nverified answers, Big-Math-Reformulated: closed-ended questions (i.e. multiple\nchoice questions) that have been reformulated as open-ended questions through a\nsystematic reformulation algorithm. Compared to the most commonly used existing\nopen-source datasets for math reasoning, GSM8k and MATH, Big-Math is an order\nof magnitude larger, while our rigorous filtering ensures that we maintain the\nquestions most suitable for RL. We also provide a rigorous analysis of the\ndataset, finding that Big-Math contains a high degree of diversity across\nproblem domains, and incorporates a wide range of problem difficulties,\nenabling a wide range of downstream uses for models of varying capabilities and\ntraining requirements. By bridging the gap between data quality and quantity,\nBig-Math establish a robust foundation for advancing reasoning in LLMs.", "paper_summary_zh": "<paragraph>由於對推理模型興趣日增，數學已成為演算法和方法改進的重要測試場域。然而，現有的開放數學資料集，要不包含少數由人編寫的高品質題目，要不就是大量機器產生的不確定品質題目，迫使研究人員在品質和數量之間做出選擇。在這項研究中，我們提出 Big-Math，一個包含超過 250,000 個高品質數學題目且答案可驗證的資料集，專門用於強化學習 (RL)。為了建立 Big-Math，我們嚴格篩選、清理和整理公開可用的資料集，萃取出滿足我們三個條件的題目：(1) 具有唯一可驗證解答的題目，(2) 開放式題目，(3) 具有閉合形式解答的題目。為了確保 Big-Math 的品質，我們手動驗證篩選過程中的每一步。根據我們篩選過程中的發現，我們引入了 47,000 個帶有驗證答案的新題目，Big-Math-Reformulated：閉合式題目（即多選題），已透過系統化變形演算法變形為開放式題目。與最常用的現有數學推理開源資料集 GSM8k 和 MATH 相比，Big-Math 的規模大上一個數量級，同時我們的嚴格篩選確保我們維持最適合 RL 的題目。我們也對資料集進行嚴格分析，發現 Big-Math 涵蓋高度多樣化的問題領域，並納入了廣泛的題目難度，讓具備不同能力和訓練需求的模型能廣泛應用於下游任務。透過彌合資料品質和數量之間的差距，Big-Math 為推進 LLM 中的推理建立了穩固的基礎。</paragraph>", "author": "Alon Albalak et.al.", "authors": "Alon Albalak, Duy Phung, Nathan Lile, Rafael Rafailov, Kanishk Gandhi, Louis Castricato, Anikait Singh, Chase Blagden, Violet Xiang, Dakota Mahan, Nick Haber", "id": "2502.17387v1", "paper_url": "http://arxiv.org/abs/2502.17387v1", "repo": "null"}}