{"2411.03729": {"publish_time": "2024-11-06", "title": "Relation Learning and Aggregate-attention for Multi-person Motion Prediction", "paper_summary": "Multi-person motion prediction is an emerging and intricate task with broad\nreal-world applications. Unlike single person motion prediction, it considers\nnot just the skeleton structures or human trajectories but also the\ninteractions between others. Previous methods use various networks to achieve\nimpressive predictions but often overlook that the joints relations within an\nindividual (intra-relation) and interactions among groups (inter-relation) are\ndistinct types of representations. These methods often lack explicit\nrepresentation of inter&intra-relations, and inevitably introduce undesired\ndependencies. To address this issue, we introduce a new collaborative framework\nfor multi-person motion prediction that explicitly modeling these relations:a\nGCN-based network for intra-relations and a novel reasoning network for\ninter-relations.Moreover, we propose a novel plug-and-play aggregation module\ncalled the Interaction Aggregation Module (IAM), which employs an\naggregate-attention mechanism to seamlessly integrate these relations.\nExperiments indicate that the module can also be applied to other dual-path\nmodels. Extensive experiments on the 3DPW, 3DPW-RC, CMU-Mocap, MuPoTS-3D, as\nwell as synthesized datasets Mix1 & Mix2 (9 to 15 persons), demonstrate that\nour method achieves state-of-the-art performance.", "paper_summary_zh": "多人動作預測是一項新興且複雜的任務，在現實世界中有廣泛的應用。它不同於單人動作預測，它不僅考慮骨架結構或人體軌跡，還考慮人與人之間的互動。先前的各種方法使用各種網路來實現令人印象深刻的預測，但常常忽視個人內部的關節關係（內部關係）和群組之間的互動（相互關係）是不同類型的表示。這些方法通常缺乏對內部和外部關係的明確表示，並不可避免地引入了不需要的依賴關係。為了解決這個問題，我們引入了一個新的協作框架，用於多人員動作預測，該框架明確地對這些關係建模：一個基於 GCN 的網路用於內部關係，一個新的推理網路用於相互關係。此外，我們提出了一個新穎的即插即用聚合模組，稱為互動聚合模組 (IAM)，它採用聚合注意力機制來無縫整合這些關係。實驗表明，該模組也可以應用於其他雙路徑模型。在 3DPW、3DPW-RC、CMU-Mocap、MuPoTS-3D 以及合成資料集 Mix1 和 Mix2（9 到 15 人）上進行的廣泛實驗表明，我們的模型達到了最先進的效能。", "author": "Kehua Qu et.al.", "authors": "Kehua Qu, Rui Ding, Jin Tang", "id": "2411.03729v1", "paper_url": "http://arxiv.org/abs/2411.03729v1", "repo": "null"}}