{"2411.17637": {"publish_time": "2024-11-26", "title": "On Limitations of LLM as Annotator for Low Resource Languages", "paper_summary": "Low-resource languages face significant challenges due to the lack of\nsufficient linguistic data, resources, and tools for tasks such as supervised\nlearning, annotation, and classification. This shortage hinders the development\nof accurate models and datasets, making it difficult to perform critical NLP\ntasks like sentiment analysis or hate speech detection. To bridge this gap,\nLarge Language Models (LLMs) present an opportunity for potential annotators,\ncapable of generating datasets and resources for these underrepresented\nlanguages. In this paper, we focus on Marathi, a low-resource language, and\nevaluate the performance of both closed-source and open-source LLMs as\nannotators. We assess models such as GPT-4o and Gemini 1.0 Pro, Gemma 2 (2B and\n9B), and Llama 3.1 (8B) on classification tasks including sentiment analysis,\nnews classification, and hate speech detection. Our findings reveal that while\nLLMs excel in annotation tasks for high-resource languages like English, they\nstill fall short when applied to Marathi. Even advanced closed models like\nGemini and GPT underperform in comparison to BERT-based baselines, highlighting\nthe limitations of LLMs as annotators for low-resource languages.", "paper_summary_zh": "低資源語言因缺乏足夠的語言資料、資源和工具，而面臨重大挑戰，這些任務包括監督式學習、註解和分類。這種短缺阻礙了準確模型和資料集的開發，使得難以執行關鍵的 NLP 任務，例如情緒分析或仇恨言論偵測。為了彌補這個差距，大型語言模型 (LLM) 為潛在註解者提供了機會，能夠為這些代表性不足的語言產生資料集和資源。在本文中，我們專注於低資源語言馬拉地語，並評估閉源和開源 LLM 作為註解者的效能。我們評估 GPT-4o 和 Gemini 1.0 Pro、Gemma 2（2B 和 9B）和 Llama 3.1（8B）等模型在分類任務上的表現，包括情緒分析、新聞分類和仇恨言論偵測。我們的研究結果顯示，雖然 LLM 在英語等高資源語言的註解任務中表現出色，但應用於馬拉地語時仍有不足。即使是 Gemini 和 GPT 等進階閉源模型，與基於 BERT 的基準相比，表現也較差，突顯了 LLM 作為低資源語言註解者的限制。", "author": "Suramya Jadhav et.al.", "authors": "Suramya Jadhav, Abhay Shanbhag, Amogh Thakurdesai, Ridhima Sinare, Raviraj Joshi", "id": "2411.17637v1", "paper_url": "http://arxiv.org/abs/2411.17637v1", "repo": "null"}}