{"2408.13909": {"publish_time": "2024-08-25", "title": "LowCLIP: Adapting the CLIP Model Architecture for Low-Resource Languages in Multimodal Image Retrieval Task", "paper_summary": "This research explores the development of multimodal vision-language models\nfor image retrieval in low-resource languages, specifically Azerbaijani.\nExisting vision-language models primarily support high-resource languages, and\nfine-tuning them remains computationally demanding. To address challenges in\nvision-language retrieval for low-resource languages, we integrated the CLIP\nmodel architecture and employed several techniques to balance computational\nefficiency with performance. These techniques include synthetic data generation\nthrough machine translation, image augmentation, and further training the\nattention mechanisms of transformer-based models with domain-specific data. We\nintegrated Multilingual BERT as a text encoder with image encoders like\nResNet50, EfficientNet0, Vision Transformer (ViT), and Tiny Swin Transformer.\nOur study found that models like EfficientNet0 and Tiny Swin Transformer\nperform best on the datasets they were trained on, such as COCO, Flickr30k, and\nFlickr8k. Augmentation techniques boosted EfficientNet0 MAP on Flickr30k from\n0.84 to 0.87 and ResNet50 MAP on MSCOCO from 0.70 to 0.80, contributing to a\nnew state of the art in vision-language retrieval. We share our configurations\nand results to support further research. Code and pre-trained models are\navailable at https://github.com/aliasgerovs/azclip.", "paper_summary_zh": "本研究探索了多模態視覺語言模型在低資源語言（特別是亞塞拜然語）中進行影像檢索的發展。現有的視覺語言模型主要支援高資源語言，且微調它們在運算上仍然要求很高。為了應對低資源語言視覺語言檢索的挑戰，我們整合了 CLIP 模型架構，並採用了幾種技術來平衡運算效率與效能。這些技術包括透過機器翻譯、影像擴充，以及使用特定領域資料進一步訓練基於轉換器的模型的注意力機制，來生成合成資料。我們將多語言 BERT 整合為文本編碼器，並搭配 ResNet50、EfficientNet0、視覺轉換器 (ViT) 和 Tiny Swin Transformer 等影像編碼器。我們的研究發現，EfficientNet0 和 Tiny Swin Transformer 等模型在其受訓的資料集（例如 COCO、Flickr30k 和 Flickr8k）上表現最佳。擴充技術將 Flickr30k 上的 EfficientNet0 MAP 從 0.84 提升到 0.87，並將 MSCOCO 上的 ResNet50 MAP 從 0.70 提升到 0.80，為視覺語言檢索樹立了新的技術標準。我們分享我們的設定和結果，以支持進一步的研究。程式碼和預先訓練的模型可於 https://github.com/aliasgerovs/azclip 取得。", "author": "Ali Asgarov et.al.", "authors": "Ali Asgarov, Samir Rustamov", "id": "2408.13909v1", "paper_url": "http://arxiv.org/abs/2408.13909v1", "repo": "https://github.com/aliasgerovs/azclip"}}