{"2405.09055": {"publish_time": "2024-05-15", "title": "A safety realignment framework via subspace-oriented model fusion for large language models", "paper_summary": "The current safeguard mechanisms for large language models (LLMs) are indeed\nsusceptible to jailbreak attacks, making them inherently fragile. Even the\nprocess of fine-tuning on apparently benign data for downstream tasks can\njeopardize safety. One potential solution is to conduct safety fine-tuning\nsubsequent to downstream fine-tuning. However, there's a risk of catastrophic\nforgetting during safety fine-tuning, where LLMs may regain safety measures but\nlose the task-specific knowledge acquired during downstream fine-tuning. In\nthis paper, we introduce a safety realignment framework through\nsubspace-oriented model fusion (SOMF), aiming to combine the safeguard\ncapabilities of initially aligned model and the current fine-tuned model into a\nrealigned model. Our approach begins by disentangling all task vectors from the\nweights of each fine-tuned model. We then identify safety-related regions\nwithin these vectors by subspace masking techniques. Finally, we explore the\nfusion of the initial safely aligned LLM with all task vectors based on the\nidentified safety subspace. We validate that our safety realignment framework\nsatisfies the safety requirements of a single fine-tuned model as well as\nmultiple models during their fusion. Our findings confirm that SOMF preserves\nsafety without notably compromising performance on downstream tasks, including\ninstruction following in Chinese, English, and Hindi, as well as\nproblem-solving capabilities in Code and Math.", "paper_summary_zh": "大型語言模型 (LLM) 目前用於防護機制的確容易受到越獄攻擊，使得它們本質上很脆弱。即使在看似良善的資料上進行微調以執行下游任務的程序也可能危及安全性。一個潛在的解決方案是在下游微調後進行安全微調。然而，在安全微調過程中存在災難性遺忘的風險，LLM 可能會重新獲得安全措施，但會失去在下游微調期間獲得的特定任務知識。在本文中，我們透過面向子空間的模型融合 (SOMF) 引入安全重新調整架構，旨在結合最初調整模型和目前微調模型的防護能力，形成重新調整模型。我們的做法首先從每個微調模型的權重中解開所有任務向量。然後，我們透過子空間遮罩技術識別這些向量中的安全相關區域。最後，我們根據識別出的安全子空間，探索最初安全調整的 LLM 與所有任務向量的融合。我們驗證我們的安全重新調整架構滿足單一微調模型以及在融合期間多個模型的安全需求。我們的研究結果證實，SOMF 可在不顯著損害下游任務效能的情況下維護安全性，包括中文、英文和印地文的指令遵循，以及程式碼和數學中的問題解決能力。", "author": "Xin Yi et.al.", "authors": "Xin Yi, Shunfan Zheng, Linlin Wang, Xiaoling Wang, Liang He", "id": "2405.09055v1", "paper_url": "http://arxiv.org/abs/2405.09055v1", "repo": "null"}}