{"2411.09251": {"publish_time": "2024-11-14", "title": "Cross Space and Time: A Spatio-Temporal Unitized Model for Traffic Flow Forecasting", "paper_summary": "Predicting spatio-temporal traffic flow presents significant challenges due\nto complex interactions between spatial and temporal factors. Existing\napproaches often address these dimensions in isolation, neglecting their\ncritical interdependencies. In this paper, we introduce the Spatio-Temporal\nUnitized Model (STUM), a unified framework designed to capture both spatial and\ntemporal dependencies while addressing spatio-temporal heterogeneity through\ntechniques such as distribution alignment and feature fusion. It also ensures\nboth predictive accuracy and computational efficiency. Central to STUM is the\nAdaptive Spatio-temporal Unitized Cell (ASTUC), which utilizes low-rank\nmatrices to seamlessly store, update, and interact with space, time, as well as\ntheir correlations. Our framework is also modular, allowing it to integrate\nwith various spatio-temporal graph neural networks through components such as\nbackbone models, feature extractors, residual fusion blocks, and predictive\nmodules to collectively enhance forecasting outcomes. Experimental results\nacross multiple real-world datasets demonstrate that STUM consistently improves\nprediction performance with minimal computational cost. These findings are\nfurther supported by hyperparameter optimization, pre-training analysis, and\nresult visualization. We provide our source code for reproducibility at\nhttps://anonymous.4open.science/r/STUM-E4F0.", "paper_summary_zh": "預測時空流量會因為時空因素之間的複雜交互作用而產生重大的挑戰。現有的方法通常孤立地處理這些面向，忽略它們之間的關鍵相互依賴性。在本文中，我們引入了時空單元模型 (STUM)，這是一個統一的架構，旨在捕捉時空依賴性，同時透過分配比對和特徵融合等技術來處理時空異質性。它也確保了預測準確性和運算效率。STUM 的核心是自適應時空單元格 (ASTUC)，它利用低秩矩陣來無縫地儲存、更新，並與空間、時間及其相關性進行互動。我們的架構也是模組化的，允許它透過主幹模型、特徵擷取器、殘差融合區塊和預測模組等組件，與各種時空圖形神經網路整合，以共同增強預測結果。跨多個真實世界資料集的實驗結果證明，STUM 以最小的運算成本持續改善預測效能。這些發現進一步獲得了超參數最佳化、預訓練分析和結果視覺化的支持。我們在 https://anonymous.4open.science/r/STUM-E4F0 提供我們的原始碼以供重現。", "author": "Weilin Ruan et.al.", "authors": "Weilin Ruan, Wenzhuo Wang, Siru Zhong, Wei Chen, Li Liu, Yuxuan Liang", "id": "2411.09251v1", "paper_url": "http://arxiv.org/abs/2411.09251v1", "repo": "null"}}