{"2406.17287": {"publish_time": "2024-06-25", "title": "Predicting the Big Five Personality Traits in Chinese Counselling Dialogues Using Large Language Models", "paper_summary": "Accurate assessment of personality traits is crucial for effective\npsycho-counseling, yet traditional methods like self-report questionnaires are\ntime-consuming and biased. This study exams whether Large Language Models\n(LLMs) can predict the Big Five personality traits directly from counseling\ndialogues and introduces an innovative framework to perform the task. Our\nframework applies role-play and questionnaire-based prompting to condition LLMs\non counseling sessions, simulating client responses to the Big Five Inventory.\nWe evaluated our framework on 853 real-world counseling sessions, finding a\nsignificant correlation between LLM-predicted and actual Big Five traits,\nproving the validity of framework. Moreover, ablation studies highlight the\nimportance of role-play simulations and task simplification via questionnaires\nin enhancing prediction accuracy. Meanwhile, our fine-tuned Llama3-8B model,\nutilizing Direct Preference Optimization with Supervised Fine-Tuning, achieves\na 130.95\\% improvement, surpassing the state-of-the-art Qwen1.5-110B by 36.94\\%\nin personality prediction validity. In conclusion, LLMs can predict personality\nbased on counseling dialogues. Our code and model are publicly available at\n\\url{https://github.com/kuri-leo/BigFive-LLM-Predictor}, providing a valuable\ntool for future research in computational psychometrics.", "paper_summary_zh": "準確評估人格特質對於有效的心理諮商至關重要，但傳統方法（例如自我報告問卷）既耗時又存在偏見。本研究探討大型語言模型 (LLM) 是否能直接從諮商對話中預測大五人格特質，並提出一個創新的架構來執行這項任務。我們的架構應用角色扮演和基於問卷的提示，在諮商會談中對 LLM 進行條件化，模擬客戶對大五人格量表的回應。我們對 853 個真實世界的諮商會談評估了我們的架構，發現 LLM 預測的大五特質與實際大五特質之間存在顯著相關性，證明了架構的有效性。此外，消融研究強調了角色扮演模擬和透過問卷簡化任務對於提高預測準確性的重要性。同時，我們微調後的 Llama3-8B 模型，利用帶有監督微調的直接偏好最佳化，在人格預測有效性上取得了 130.95% 的改進，比最先進的 Qwen1.5-110B 高出 36.94%。總之，LLM 可以根據諮商對話預測人格。我們的程式碼和模型已公開發布在 \\url{https://github.com/kuri-leo/BigFive-LLM-Predictor}，為計算心理測量學的未來研究提供了有價值的工具。", "author": "Yang Yan et.al.", "authors": "Yang Yan, Lizhi Ma, Anqi Li, Jingsong Ma, Zhenzhong Lan", "id": "2406.17287v1", "paper_url": "http://arxiv.org/abs/2406.17287v1", "repo": "https://github.com/kuri-leo/bigfive-llm-predictor"}}