{"2502.02013": {"publish_time": "2025-02-04", "title": "Layer by Layer: Uncovering Hidden Representations in Language Models", "paper_summary": "From extracting features to generating text, the outputs of large language\nmodels (LLMs) typically rely on their final layers, following the conventional\nwisdom that earlier layers capture only low-level cues. However, our analysis\nshows that intermediate layers can encode even richer representations, often\nimproving performance on a wide range of downstream tasks. To explain and\nquantify these hidden-layer properties, we propose a unified framework of\nrepresentation quality metrics based on information theory, geometry, and\ninvariance to input perturbations. Our framework highlights how each model\nlayer balances information compression and signal preservation, revealing why\nmid-depth embeddings can exceed the last layer's performance. Through extensive\nexperiments on 32 text-embedding tasks and comparisons across model\narchitectures (transformers, state-space models) and domains (language,\nvision), we demonstrate that intermediate layers consistently provide stronger\nfeatures. These findings challenge the standard focus on final-layer embeddings\nand open new directions for model analysis and optimization, including\nstrategic use of mid-layer representations for more robust and accurate AI\nsystems.", "paper_summary_zh": "從特徵萃取到文字生成，大型語言模型 (LLM) 的輸出通常仰賴其最後幾層，遵循早期層只捕捉低階線索的傳統智慧。然而，我們的分析顯示，中間層可以編碼更豐富的表徵，常在廣泛的下游任務中改善效能。為了解釋和量化這些隱藏層屬性，我們提出一個統一的表徵品質指標架構，基於資訊理論、幾何和輸入擾動不變性。我們的架構強調每個模型層如何平衡資訊壓縮和訊號保留，揭示為什麼中深度嵌入可以超越最後一層的效能。透過在 32 個文字嵌入任務和跨模型架構（Transformer、狀態空間模型）和領域（語言、視覺）的比較中進行廣泛的實驗，我們證明中間層始終提供更強大的特徵。這些發現挑戰了對最後一層嵌入的標準關注，並為模型分析和最佳化開啟了新方向，包括策略性使用中層表徵，以獲得更強健、更準確的 AI 系統。", "author": "Oscar Skean et.al.", "authors": "Oscar Skean, Md Rifat Arefin, Dan Zhao, Niket Patel, Jalal Naghiyev, Yann LeCun, Ravid Shwartz-Ziv", "id": "2502.02013v1", "paper_url": "http://arxiv.org/abs/2502.02013v1", "repo": "null"}}