{"2407.14507": {"publish_time": "2024-07-19", "title": "Internal Consistency and Self-Feedback in Large Language Models: A Survey", "paper_summary": "Large language models (LLMs) are expected to respond accurately but often\nexhibit deficient reasoning or generate hallucinatory content. To address\nthese, studies prefixed with ``Self-'' such as Self-Consistency, Self-Improve,\nand Self-Refine have been initiated. They share a commonality: involving LLMs\nevaluating and updating itself to mitigate the issues. Nonetheless, these\nefforts lack a unified perspective on summarization, as existing surveys\npredominantly focus on categorization without examining the motivations behind\nthese works.\n  In this paper, we summarize a theoretical framework, termed Internal\nConsistency, which offers unified explanations for phenomena such as the lack\nof reasoning and the presence of hallucinations. Internal Consistency assesses\nthe coherence among LLMs' latent layer, decoding layer, and response layer\nbased on sampling methodologies. Expanding upon the Internal Consistency\nframework, we introduce a streamlined yet effective theoretical framework\ncapable of mining Internal Consistency, named Self-Feedback. The Self-Feedback\nframework consists of two modules: Self-Evaluation and Self-Update. This\nframework has been employed in numerous studies.\n  We systematically classify these studies by tasks and lines of work;\nsummarize relevant evaluation methods and benchmarks; and delve into the\nconcern, ``Does Self-Feedback Really Work?'' We propose several critical\nviewpoints, including the ``Hourglass Evolution of Internal Consistency'',\n``Consistency Is (Almost) Correctness'' hypothesis, and ``The Paradox of Latent\nand Explicit Reasoning''. Furthermore, we outline promising directions for\nfuture research. We have open-sourced the experimental code, reference list,\nand statistical data, available at\n\\url{https://github.com/IAAR-Shanghai/ICSFSurvey}.", "paper_summary_zh": "大型語言模型 (LLM) 預期會做出準確的回應，但經常展現出推理不足或產生幻覺內容。為了解決這些問題，已經啟動了以「Self-」為前綴的研究，例如 Self-Consistency、Self-Improve 和 Self-Refine。它們有一個共同點：讓 LLM 自我評估和更新以減輕這些問題。儘管如此，這些努力缺乏對摘要的統一觀點，因為現有調查主要集中在分類上，而沒有探討這些作品背後的動機。\n在本文中，我們總結了一個稱為內部一致性的理論架構，它為推理不足和幻覺出現等現象提供了統一的解釋。內部一致性根據抽樣方法評估 LLM 的潛在層、解碼層和回應層之間的相干性。在內部一致性架構的基礎上，我們引入了一個簡化但有效的理論架構，能夠挖掘內部一致性，稱為自回饋。自回饋架構包含兩個模組：自我評估和自我更新。這個架構已經被應用於許多研究中。\n我們根據任務和工作領域系統地對這些研究進行分類；總結相關的評估方法和基準；並深入探討「自回饋真的有效嗎？」這個問題。我們提出了幾個批判觀點，包括「內部一致性的沙漏演化」、「一致性（幾乎）等於正確性」假說，以及「潛在和明確推理的悖論」。此外，我們概述了未來研究的有希望的方向。我們已經開源了實驗代碼、參考清單和統計數據，可在以下網址取得：\n\\url{https://github.com/IAAR-Shanghai/ICSFSurvey}。", "author": "Xun Liang et.al.", "authors": "Xun Liang, Shichao Song, Zifan Zheng, Hanyu Wang, Qingchen Yu, Xunkai Li, Rong-Hua Li, Feiyu Xiong, Zhiyu Li", "id": "2407.14507v1", "paper_url": "http://arxiv.org/abs/2407.14507v1", "repo": "https://github.com/iaar-shanghai/icsfsurvey"}}