{"2412.05152": {"publish_time": "2024-12-06", "title": "Navigating Shortcuts, Spurious Correlations, and Confounders: From Origins via Detection to Mitigation", "paper_summary": "Shortcuts, also described as Clever Hans behavior, spurious correlations, or\nconfounders, present a significant challenge in machine learning and AI,\ncritically affecting model generalization and robustness. Research in this\narea, however, remains fragmented across various terminologies, hindering the\nprogress of the field as a whole. Consequently, we introduce a unifying\ntaxonomy of shortcut learning by providing a formal definition of shortcuts and\nbridging the diverse terms used in the literature. In doing so, we further\nestablish important connections between shortcuts and related fields, including\nbias, causality, and security, where parallels exist but are rarely discussed.\nOur taxonomy organizes existing approaches for shortcut detection and\nmitigation, providing a comprehensive overview of the current state of the\nfield and revealing underexplored areas and open challenges. Moreover, we\ncompile and classify datasets tailored to study shortcut learning. Altogether,\nthis work provides a holistic perspective to deepen understanding and drive the\ndevelopment of more effective strategies for addressing shortcuts in machine\nlearning.", "paper_summary_zh": "捷徑，也稱為克萊佛漢斯行為、虛假相關或混淆因子，在機器學習和人工智慧中構成重大挑戰，嚴重影響模型的概化和健全性。然而，這方面的研究仍因各種術語而支離破碎，阻礙了整個領域的進展。因此，我們透過提供捷徑的正式定義，並連結文獻中使用的各種術語，來引入捷徑學習的統一分類法。在這樣做的過程中，我們進一步建立了捷徑與相關領域之間的重要關聯，包括偏差、因果關係和安全性，這些領域存在相似之處，但很少被討論。我們的分類法組織了現有的捷徑偵測和緩解方法，提供了該領域當前狀態的全面概述，並揭示了未充分探討的領域和未解決的挑戰。此外，我們編制並分類了專門用於研究捷徑學習的資料集。總之，這項工作提供了整體觀點，以加深理解，並推動制定更有效的策略來解決機器學習中的捷徑。", "author": "David Steinmann et.al.", "authors": "David Steinmann, Felix Divo, Maurice Kraus, Antonia Wüst, Lukas Struppek, Felix Friedrich, Kristian Kersting", "id": "2412.05152v1", "paper_url": "http://arxiv.org/abs/2412.05152v1", "repo": "null"}}