{"2408.15050": {"publish_time": "2024-08-27", "title": "Self-supervised Topic Taxonomy Discovery in the Box Embedding Space", "paper_summary": "Topic taxonomy discovery aims at uncovering topics of different abstraction\nlevels and constructing hierarchical relations between them. Unfortunately,\nmost of prior work can hardly model semantic scopes of words and topics by\nholding the Euclidean embedding space assumption. What's worse, they infer\nasymmetric hierarchical relations by symmetric distances between topic\nembeddings. As a result, existing methods suffer from problems of low-quality\ntopics at high abstraction levels and inaccurate hierarchical relations. To\nalleviate these problems, this paper develops a Box embedding-based Topic Model\n(BoxTM) that maps words and topics into the box embedding space, where the\nasymmetric metric is defined to properly infer hierarchical relations among\ntopics. Additionally, our BoxTM explicitly infers upper-level topics based on\ncorrelation between specific topics through recursive clustering on topic\nboxes. Finally, extensive experiments validate high-quality of the topic\ntaxonomy learned by BoxTM.", "paper_summary_zh": "主題分類發現旨在揭示不同抽象層級的主題，並建構它們之間的階層關係。不幸的是，大多數先前的研究難以透過維持歐幾里得嵌入空間假設來建模詞彙和主題的語義範圍。更糟糕的是，它們透過主題嵌入之間的對稱距離來推斷非對稱的階層關係。因此，現有方法存在高抽象層級低品質主題和不準確階層關係的問題。為了減輕這些問題，本文開發了一個基於方塊嵌入的主題模型（BoxTM），將詞彙和主題對應到方塊嵌入空間中，其中定義了非對稱量度以適當地推斷主題之間的階層關係。此外，我們的 BoxTM 透過主題方塊上的遞迴聚類，根據特定主題之間的關聯性明確推斷上層主題。最後，廣泛的實驗驗證了 BoxTM 所學習的主題分類的高品質。", "author": "Yuyin Lu et.al.", "authors": "Yuyin Lu, Hegang Chen, Pengbo Mao, Yanghui Rao, Haoran Xie, Fu Lee Wang, Qing Li", "id": "2408.15050v1", "paper_url": "http://arxiv.org/abs/2408.15050v1", "repo": "null"}}