{"2406.02079": {"publish_time": "2024-06-04", "title": "Assessing the Performance of Chinese Open Source Large Language Models in Information Extraction Tasks", "paper_summary": "Information Extraction (IE) plays a crucial role in Natural Language\nProcessing (NLP) by extracting structured information from unstructured text,\nthereby facilitating seamless integration with various real-world applications\nthat rely on structured data. Despite its significance, recent experiments\nfocusing on English IE tasks have shed light on the challenges faced by Large\nLanguage Models (LLMs) in achieving optimal performance, particularly in\nsub-tasks like Named Entity Recognition (NER). In this paper, we delve into a\ncomprehensive investigation of the performance of mainstream Chinese\nopen-source LLMs in tackling IE tasks, specifically under zero-shot conditions\nwhere the models are not fine-tuned for specific tasks. Additionally, we\npresent the outcomes of several few-shot experiments to further gauge the\ncapability of these models. Moreover, our study includes a comparative analysis\nbetween these open-source LLMs and ChatGPT, a widely recognized language model,\non IE performance. Through meticulous experimentation and analysis, we aim to\nprovide insights into the strengths, limitations, and potential enhancements of\nexisting Chinese open-source LLMs in the domain of Information Extraction\nwithin the context of NLP.", "paper_summary_zh": "資訊萃取 (IE) 在自然語言處理 (NLP) 中扮演著關鍵角色，它從非結構化文字中萃取出結構化的資訊，從而促進與依賴結構化資料的各種真實世界應用程式進行無縫整合。儘管其重要性，最近專注於英文 IE 任務的實驗揭示了大型語言模型 (LLM) 在達成最佳效能時所面臨的挑戰，特別是在命名實體辨識 (NER) 等子任務中。在本文中，我們深入探討主流中文開源 LLM 在處理 IE 任務時的效能，特別是在模型未針對特定任務進行微調的零次學習條件下。此外，我們提出了一些小樣本實驗的結果，以進一步評估這些模型的能力。此外，我們的研究包括這些開源 LLM 與廣受認可的語言模型 ChatGPT 在 IE 效能上的比較分析。透過細緻的實驗和分析，我們旨在提供見解，了解現有中文開源 LLM 在 NLP 脈絡中的資訊萃取領域中的優勢、限制和潛在的強化。", "author": "Yida Cai et.al.", "authors": "Yida Cai, Hao Sun, Hsiu-Yuan Huang, Yunfang Wu", "id": "2406.02079v1", "paper_url": "http://arxiv.org/abs/2406.02079v1", "repo": "null"}}