{"2405.17950": {"publish_time": "2024-05-28", "title": "Self-Guiding Exploration for Combinatorial Problems", "paper_summary": "Large Language Models (LLMs) have become pivotal in addressing reasoning\ntasks across diverse domains, including arithmetic, commonsense, and symbolic\nreasoning. They utilize prompting techniques such as Exploration-of-Thought,\nDecomposition, and Refinement to effectively navigate and solve intricate\ntasks. Despite these advancements, the application of LLMs to Combinatorial\nProblems (CPs), known for their NP-hardness and critical roles in logistics and\nresource management remains underexplored. To address this gap, we introduce a\nnovel prompting strategy: Self-Guiding Exploration (SGE), designed to enhance\nthe performance of solving CPs. SGE operates autonomously, generating multiple\nthought trajectories for each CP task. It then breaks these trajectories down\ninto actionable subtasks, executes them sequentially, and refines the results\nto ensure optimal outcomes. We present our research as the first to apply LLMs\nto a broad range of CPs and demonstrate that SGE outperforms existing prompting\nstrategies by over 27.84% in CP optimization performance. Additionally, SGE\nachieves a 2.46% higher accuracy over the best existing results in other\nreasoning tasks (arithmetic, commonsense, and symbolic).", "paper_summary_zh": "大型語言模型 (LLM) 已成為解決跨越不同領域的推理任務的關鍵，包括算術、常識和符號推理。他們利用探索思想、分解和改進等提示技術，有效地導航和解決複雜的任務。儘管有這些進展，但 LLM 在組合問題 (CP) 中的應用仍然未被充分探索，而 CP 以其 NP 難度和在物流和資源管理中的關鍵作用而聞名。為了解決這個差距，我們引入了一種新穎的提示策略：自我引導探索 (SGE)，旨在增強解決 CP 的性能。SGE 自主運作，為每個 CP 任務產生多個思考軌跡。然後它將這些軌跡分解為可操作的子任務，依序執行它們，並改進結果以確保最佳結果。我們的研究是第一個將 LLM 應用於廣泛的 CP 的研究，並證明 SGE 在 CP 最佳化性能方面比現有的提示策略高出 27.84%。此外，SGE 在其他推理任務（算術、常識和符號）中比現有最佳結果高出 2.46%。", "author": "Zangir Iklassov et.al.", "authors": "Zangir Iklassov, Yali Du, Farkhad Akimov, Martin Takac", "id": "2405.17950v1", "paper_url": "http://arxiv.org/abs/2405.17950v1", "repo": "https://github.com/zangir/llm-for-cp"}}