{"2501.04503": {"publish_time": "2025-01-08", "title": "Developing a Modular Compiler for a Subset of a C-like Language", "paper_summary": "The paper introduces the development of a modular compiler for a subset of a\nC-like language, which addresses the challenges in constructing a compiler for\nhigh-level languages. This modular approach will allow developers to modify a\nlanguage by adding or removing subsets as required, resulting in a minimal and\nmemory-efficient compiler. The development process is divided into small,\nincremental steps, where each step yields a fully functioning compiler for an\nexpanding subset of the language. The paper outlines the iterative\ndevelopmental phase of the compiler, emphasizing progressive enhancements in\ncapabilities and functionality. Adherence to industry best practices of modular\ndesign, code reusability, and documentation has enabled the resulting\ncompiler's functional efficiency, maintainability, and extensibility. The\ncompiler proved to be effective not only in managing the language structure but\nalso in developing optimized code, which demonstrates its practical usability.\nThis was also further assessed using the compiler on a tiny memory-deficient\nsingle-board computer, again showing the compiler's efficiency and suitability\nfor resource-constrained devices.", "paper_summary_zh": "本文介紹了一個模組化編譯器，它針對 C 類語言的子集進行編譯，並解決了建置高階語言編譯器時所面臨的挑戰。這種模組化方法將允許開發人員依據需求新增或移除子集來修改語言，進而產生精簡且記憶體使用效率高的編譯器。開發流程被劃分為多個小而漸進的步驟，每個步驟都會為語言的擴充子集產生一個功能完整的編譯器。本文概述了編譯器的反覆開發階段，並強調了功能和效能的逐步增強。遵循模組化設計、程式碼可重複使用和文件編寫的業界最佳實務，讓產出的編譯器具備了功能效率、可維護性和可擴充性。編譯器不僅在管理語言結構方面被證明有效，在開發最佳化程式碼方面也一樣，這證明了它的實用性。這也進一步使用編譯器在一個微小的記憶體不足的單板電腦上進行評估，再次顯示出編譯器的效率和對資源受限裝置的適用性。", "author": "Debasish Dutta et.al.", "authors": "Debasish Dutta, Neeharika Sonowal, Irani Hazarika", "id": "2501.04503v1", "paper_url": "http://arxiv.org/abs/2501.04503v1", "repo": "null"}}