{"2502.02883": {"publish_time": "2025-02-05", "title": "SensorChat: Answering Qualitative and Quantitative Questions during Long-Term Multimodal Sensor Interactions", "paper_summary": "Natural language interaction with sensing systems is crucial for enabling all\nusers to comprehend sensor data and its impact on their everyday lives.\nHowever, existing systems, which typically operate in a Question Answering (QA)\nmanner, are significantly limited in terms of the duration and complexity of\nsensor data they can handle. In this work, we introduce SensorChat, the first\nend-to-end QA system designed for long-term sensor monitoring with multimodal\nand high-dimensional data including time series. SensorChat effectively answers\nboth qualitative (requiring high-level reasoning) and quantitative (requiring\naccurate responses derived from sensor data) questions in real-world scenarios.\nTo achieve this, SensorChat uses an innovative three-stage pipeline that\nincludes question decomposition, sensor data query, and answer assembly. The\nfirst and third stages leverage Large Language Models (LLMs) for intuitive\nhuman interactions and to guide the sensor data query process. Unlike existing\nmultimodal LLMs, SensorChat incorporates an explicit query stage to precisely\nextract factual information from long-duration sensor data. We implement\nSensorChat and demonstrate its capability for real-time interactions on a cloud\nserver while also being able to run entirely on edge platforms after\nquantization. Comprehensive QA evaluations show that SensorChat achieves up to\n26% higher answer accuracy than state-of-the-art systems on quantitative\nquestions. Additionally, a user study with eight volunteers highlights\nSensorChat's effectiveness in handling qualitative and open-ended questions.", "paper_summary_zh": "自然語言與感測系統的互動對於讓所有使用者理解感測器資料及其對他們日常生活中的影響至關重要。然而，現有的系統通常以問答 (QA) 的方式運作，在感測器資料的持續時間和複雜性方面受到顯著限制。在這項工作中，我們引入了 SensorChat，這是第一個端到端的 QA 系統，專為長期感測監控而設計，具有多模式和高維度資料，包括時間序列。SensorChat 有效地回答了現實世界場景中的定性（需要高層次推理）和定量（需要從感測器資料中衍生的準確回應）問題。為了實現這一點，SensorChat 使用了一個創新的三階段管道，包括問題分解、感測器資料查詢和答案組裝。第一和第三階段利用大型語言模型 (LLM) 進行直觀的人類互動，並指導感測器資料查詢過程。與現有的多模式 LLM 不同，SensorChat 結合了一個明確的查詢階段，以從長時間的感測器資料中精確地提取事實資訊。我們實作了 SensorChat，並展示了它在雲端伺服器上進行即時互動的能力，同時在量化後也能完全在邊緣平台上執行。全面的 QA 評估顯示，SensorChat 在定量問題上的回答準確度比最先進的系統高出 26%。此外，一項針對八位志願者的使用者研究突出了 SensorChat 在處理定性和開放式問題方面的有效性。", "author": "Xiaofan Yu et.al.", "authors": "Xiaofan Yu, Lanxiang Hu, Benjamin Reichman, Dylan Chu, Rushil Chandrupatla, Xiyuan Zhang, Larry Heck, Tajana Rosing", "id": "2502.02883v1", "paper_url": "http://arxiv.org/abs/2502.02883v1", "repo": "null"}}