{"2412.02259": {"publish_time": "2024-12-03", "title": "VideoGen-of-Thought: A Collaborative Framework for Multi-Shot Video Generation", "paper_summary": "Current video generation models excel at generating short clips but still\nstruggle with creating multi-shot, movie-like videos. Existing models trained\non large-scale data on the back of rich computational resources are\nunsurprisingly inadequate for maintaining a logical storyline and visual\nconsistency across multiple shots of a cohesive script since they are often\ntrained with a single-shot objective. To this end, we propose\nVideoGen-of-Thought (VGoT), a collaborative and training-free architecture\ndesigned specifically for multi-shot video generation. VGoT is designed with\nthree goals in mind as follows. Multi-Shot Video Generation: We divide the\nvideo generation process into a structured, modular sequence, including (1)\nScript Generation, which translates a curt story into detailed prompts for each\nshot; (2) Keyframe Generation, responsible for creating visually consistent\nkeyframes faithful to character portrayals; and (3) Shot-Level Video\nGeneration, which transforms information from scripts and keyframes into shots;\n(4) Smoothing Mechanism that ensures a consistent multi-shot output. Reasonable\nNarrative Design: Inspired by cinematic scriptwriting, our prompt generation\napproach spans five key domains, ensuring logical consistency, character\ndevelopment, and narrative flow across the entire video. Cross-Shot\nConsistency: We ensure temporal and identity consistency by leveraging\nidentity-preserving (IP) embeddings across shots, which are automatically\ncreated from the narrative. Additionally, we incorporate a cross-shot smoothing\nmechanism, which integrates a reset boundary that effectively combines latent\nfeatures from adjacent shots, resulting in smooth transitions and maintaining\nvisual coherence throughout the video. Our experiments demonstrate that VGoT\nsurpasses existing video generation methods in producing high-quality,\ncoherent, multi-shot videos.", "paper_summary_zh": "<paragraph>當前的影片生成模型擅長生成短片段，但仍難以製作多鏡頭、電影般的影片。現有的模型在大量的資料訓練下，仰賴於豐富的運算資源，不足以維持邏輯故事線和視覺一致性貫穿於一個連貫劇本的多個鏡頭中，因為它們通常是使用單鏡頭目標訓練的。為此，我們提出 VideoGen-of-Thought (VGoT)，一種專門為多鏡頭影片生成設計的協作式且無需訓練的架構。VGoT 的設計考量了以下三個目標。多鏡頭影片生成：我們將影片生成過程劃分為一個結構化的模組化順序，包括：(1) 劇本生成，將簡短的故事轉換為每個鏡頭的詳細提示；(2) 關鍵影格生成，負責製作視覺一致且忠於角色描繪的關鍵影格；(3) 鏡頭級影片生成，將腳本和關鍵影格中的資訊轉換為鏡頭；(4) 平滑機制，確保一致的多鏡頭輸出。合理的敘事設計：我們的提示生成方法受到電影劇本寫作的啟發，涵蓋了五個關鍵領域，確保整個影片的邏輯一致性、角色發展和敘事流暢。跨鏡頭一致性：我們透過鏡頭間的恆等性保留 (IP) 嵌入來確保時間和身分一致性，這些嵌入會自動從敘事中建立。此外，我們納入一個跨鏡頭平滑機制，整合一個重置邊界，有效地結合相鄰鏡頭的潛在特徵，產生平滑的過渡並在整個影片中維持視覺一致性。我們的實驗證明，VGoT 在製作高品質、連貫、多鏡頭影片方面超越了現有的影片生成方法。</paragraph>", "author": "Mingzhe Zheng et.al.", "authors": "Mingzhe Zheng, Yongqi Xu, Haojian Huang, Xuran Ma, Yexin Liu, Wenjie Shu, Yatian Pang, Feilong Tang, Qifeng Chen, Harry Yang, Ser-Nam Lim", "id": "2412.02259v1", "paper_url": "http://arxiv.org/abs/2412.02259v1", "repo": "null"}}