{"2406.19493": {"publish_time": "2024-06-27", "title": "Development and Evaluation of a Retrieval-Augmented Generation Tool for Creating SAPPhIRE Models of Artificial Systems", "paper_summary": "Representing systems using the SAPPhIRE causality model is found useful in\nsupporting design-by-analogy. However, creating a SAPPhIRE model of artificial\nor biological systems is an effort-intensive process that requires human\nexperts to source technical knowledge from multiple technical documents\nregarding how the system works. This research investigates how to leverage\nLarge Language Models (LLMs) in creating structured descriptions of systems\nusing the SAPPhIRE model of causality. This paper, the second part of the\ntwo-part research, presents a new Retrieval-Augmented Generation (RAG) tool for\ngenerating information related to SAPPhIRE constructs of artificial systems and\nreports the results from a preliminary evaluation of the tool's success -\nfocusing on the factual accuracy and reliability of outcomes.", "paper_summary_zh": "使用 SAPPhIRE 因果模型表示系統在支援類比設計方面很有用。然而，建立人工或生物系統的 SAPPhIRE 模型是一個需要大量人力且需要人類專家從多份技術文件取得系統運作方式的技術知識的過程。本研究探討如何利用大型語言模型 (LLM) 在使用 SAPPhIRE 因果模型建立系統的結構化描述。本文是兩部分研究的第二部分，提出了一個新的檢索增強生成 (RAG) 工具，用於產生與人工系統的 SAPPhIRE 建構相關的資訊，並報告工具成功初步評估的結果，重點在於成果的事實準確性和可靠性。", "author": "Anubhab Majumder et.al.", "authors": "Anubhab Majumder, Kausik Bhattacharya, Amaresh Chakrabarti", "id": "2406.19493v1", "paper_url": "http://arxiv.org/abs/2406.19493v1", "repo": "null"}}