{"2502.15349": {"publish_time": "2025-02-21", "title": "AttentionEngine: A Versatile Framework for Efficient Attention Mechanisms on Diverse Hardware Platforms", "paper_summary": "Transformers and large language models (LLMs) have revolutionized machine\nlearning, with attention mechanisms at the core of their success. As the\nlandscape of attention variants expands, so too do the challenges of optimizing\ntheir performance, particularly across different hardware platforms. Current\noptimization strategies are often narrowly focused, requiring extensive manual\nintervention to accommodate changes in model configurations or hardware\nenvironments. In this paper, we introduce AttentionEngine, a comprehensive\nframework designed to streamline the optimization of attention mechanisms\nacross heterogeneous hardware backends. By decomposing attention computation\ninto modular operations with customizable components, AttentionEngine enables\nflexible adaptation to diverse algorithmic requirements. The framework further\nautomates kernel optimization through a combination of programmable templates\nand a robust cross-platform scheduling strategy. Empirical results reveal\nperformance gains of up to 10x on configurations beyond the reach of existing\nmethods. AttentionEngine offers a scalable, efficient foundation for developing\nand deploying attention mechanisms with minimal manual tuning. Our code has\nbeen open-sourced and is available at\nhttps://github.com/microsoft/AttentionEngine.", "paper_summary_zh": "Transformer和大語言模型 (LLM) 徹底革新了機器學習，而注意力機制是其成功的核心。隨著注意力變體的版圖擴展，優化其效能的挑戰也越來越多，特別是在不同的硬體平台上。目前的最佳化策略通常焦點狹隘，需要大量手動介入才能適應模型組態或硬體環境的變更。在本文中，我們介紹了 AttentionEngine，一個全面的架構，旨在簡化跨異質硬體後端的注意力機制的最佳化。透過將注意力運算分解為具有可自訂組件的模組化運算，AttentionEngine 能夠靈活地適應不同的演算法需求。這個架構進一步透過可程式化範本和強大的跨平台排程策略，自動化核心最佳化。經驗結果顯示，在現有方法無法達到的組態上，效能提升了 10 倍。AttentionEngine 提供了一個可擴充、高效的基礎，用於開發和部署注意力機制，且只需最少的調整。我們的程式碼已開放原始碼，可在 https://github.com/microsoft/AttentionEngine 取得。", "author": "Feiyang Chen et.al.", "authors": "Feiyang Chen, Yu Cheng, Lei Wang, Yuqing Xia, Ziming Miao, Lingxiao Ma, Fan Yang, Jilong Xue, Zhi Yang, Mao Yang, Haibo Chen", "id": "2502.15349v1", "paper_url": "http://arxiv.org/abs/2502.15349v1", "repo": "null"}}