{"2409.07127": {"publish_time": "2024-09-11", "title": "DCMAC: Demand-aware Customized Multi-Agent Communication via Upper Bound Training", "paper_summary": "Efficient communication can enhance the overall performance of collaborative\nmulti-agent reinforcement learning. A common approach is to share observations\nthrough full communication, leading to significant communication overhead.\nExisting work attempts to perceive the global state by conducting teammate\nmodel based on local information. However, they ignore that the uncertainty\ngenerated by prediction may lead to difficult training. To address this\nproblem, we propose a Demand-aware Customized Multi-Agent Communication (DCMAC)\nprotocol, which use an upper bound training to obtain the ideal policy. By\nutilizing the demand parsing module, agent can interpret the gain of sending\nlocal message on teammate, and generate customized messages via compute the\ncorrelation between demands and local observation using cross-attention\nmechanism. Moreover, our method can adapt to the communication resources of\nagents and accelerate the training progress by appropriating the ideal policy\nwhich is trained with joint observation. Experimental results reveal that DCMAC\nsignificantly outperforms the baseline algorithms in both unconstrained and\ncommunication constrained scenarios.", "paper_summary_zh": "高效的溝通可以提升協作多智能體強化學習的整體表現。一種常見的方法是透過完全溝通來分享觀察，導致顯著的溝通負擔。現有研究嘗試根據局部資訊進行隊友建模，以感知全局狀態。然而，它們忽略了預測產生的不確定性可能導致訓練困難。為了解決這個問題，我們提出一個需求感知自訂多智能體溝通 (DCMAC) 協定，它使用上限訓練來取得理想策略。透過使用需求解析模組，智能體可以解釋發送局部訊息給隊友的收益，並透過使用跨注意力機制計算需求和局部觀察之間的關聯性來產生自訂訊息。此外，我們的模型可以適應智能體的溝通資源，並透過挪用使用聯合觀察訓練的理想策略來加速訓練進度。實驗結果顯示，DCMAC 在不受限和受限的溝通場景中都顯著優於基準演算法。", "author": "Dongkun Huo et.al.", "authors": "Dongkun Huo, Huateng Zhang, Yixue Hao, Yuanlin Ye, Long Hu, Rui Wang, Min Chen", "id": "2409.07127v1", "paper_url": "http://arxiv.org/abs/2409.07127v1", "repo": "null"}}