{"2409.03662": {"publish_time": "2024-09-05", "title": "The representation landscape of few-shot learning and fine-tuning in large language models", "paper_summary": "In-context learning (ICL) and supervised fine-tuning (SFT) are two common\nstrategies for improving the performance of modern large language models (LLMs)\non specific tasks. Despite their different natures, these strategies often lead\nto comparable performance gains. However, little is known about whether they\ninduce similar representations inside LLMs. We approach this problem by\nanalyzing the probability landscape of their hidden representations in the two\ncases. More specifically, we compare how LLMs solve the same question-answering\ntask, finding that ICL and SFT create very different internal structures, in\nboth cases undergoing a sharp transition in the middle of the network. In the\nfirst half of the network, ICL shapes interpretable representations\nhierarchically organized according to their semantic content. In contrast, the\nprobability landscape obtained with SFT is fuzzier and semantically mixed. In\nthe second half of the model, the fine-tuned representations develop\nprobability modes that better encode the identity of answers, while the\nlandscape of ICL representations is characterized by less defined peaks. Our\napproach reveals the diverse computational strategies developed inside LLMs to\nsolve the same task across different conditions, allowing us to make a step\ntowards designing optimal methods to extract information from language models.", "paper_summary_zh": "語境學習 (ICL) 與監督微調 (SFT) 是兩種常見的策略，用於提升現代大型語言模型 (LLM) 在特定任務上的表現。儘管性質不同，這些策略通常會帶來相當的效能提升。然而，對於它們是否在 LLM 內部引發類似的表徵，我們所知甚少。我們透過分析這兩種情況下其隱藏表徵的機率分布來探討這個問題。更具體地說，我們比較 LLM 如何解決相同的問答任務，發現 ICL 和 SFT 會產生非常不同的內部結構，在兩種情況下都會在網路中段經歷劇烈的轉變。在網路的前半段，ICL 根據語義內容分層組織可解釋的表徵。相比之下，使用 SFT 獲得的機率分布較模糊且語義混雜。在模型的後半段，微調後的表徵會發展出機率模式，能更好地編碼答案的識別，而 ICL 表徵的分布特徵在於較不具定義的峰值。我們的做法揭示了 LLM 內部在不同條件下為了解決相同任務而開發的多樣化運算策略，讓我們能朝設計最佳方法從語言模型中萃取資訊邁進一步。", "author": "Diego Doimo et.al.", "authors": "Diego Doimo, Alessandro Serra, Alessio Ansuini, Alberto Cazzaniga", "id": "2409.03662v2", "paper_url": "http://arxiv.org/abs/2409.03662v2", "repo": "https://github.com/diegodoimo/geometry_icl_finetuning"}}