{"2409.02711": {"publish_time": "2024-09-04", "title": "Creating a Gen-AI based Track and Trace Assistant MVP (SuperTracy) for PostNL", "paper_summary": "The developments in the field of generative AI has brought a lot of\nopportunities for companies, for instance to improve efficiency in customer\nservice and automating tasks. PostNL, the biggest parcel and E-commerce\ncorporation of the Netherlands wants to use generative AI to enhance the\ncommunication around track and trace of parcels. During the internship a\nMinimal Viable Product (MVP) is created to showcase the value of using\ngenerative AI technologies, to enhance parcel tracking, analyzing the parcel's\njourney and being able to communicate about it in an easy to understand manner.\nThe primary goal was to develop an in-house LLM-based system, reducing\ndependency on external platforms and establishing the feasibility of a\ndedicated generative AI team within the company. This multi-agent LLM based\nsystem aimed to construct parcel journey stories and identify logistical\ndisruptions with heightened efficiency and accuracy. The research involved\ndeploying a sophisticated AI-driven communication system, employing\nRetrieval-Augmented Generation (RAG) for enhanced response precision, and\noptimizing large language models (LLMs) tailored to domain specific tasks.\n  The MVP successfully implemented a multi-agent open-source LLM system, called\nSuperTracy. SuperTracy is capable of autonomously managing a broad spectrum of\nuser inquiries and improving internal knowledge handling. Results and\nevaluation demonstrated technological innovation and feasibility, notably in\ncommunication about the track and trace of a parcel, which exceeded initial\nexpectations. These advancements highlight the potential of AI-driven solutions\nin logistics, suggesting many opportunities for further refinement and broader\nimplementation within PostNL operational framework.", "paper_summary_zh": "<paragraph>生成式 AI 領域的發展為企業帶來許多機會，例如提升客服效率和自動化任務。荷蘭最大的包裹和電子商務公司 PostNL 希望使用生成式 AI 來加強包裹追蹤的溝通。實習期間，建立一個可行性最低產品 (MVP) 以展示使用生成式 AI 技術的價值，以加強包裹追蹤、分析包裹旅程並能夠以易於理解的方式進行溝通。主要目標是開發一個內部 LLM 為基礎的系統，減少對外部平台的依賴，並建立公司內專門的生成式 AI 團隊的可行性。這個多代理的 LLM 為基礎的系統旨在建構包裹旅程故事並識別後勤中斷，且效率和準確性都更高。研究涉及部署一個由 AI 驅動的先進溝通系統，採用檢索增強生成 (RAG) 以增強回應的精準度，並針對特定領域任務最佳化大型語言模型 (LLM)。MVP 成功實施了一個多代理的開源 LLM 系統，稱為 SuperTracy。SuperTracy 能夠自主管理廣泛的使用者詢問，並改善內部知識處理。結果和評估證明了技術創新和可行性，特別是在包裹追蹤的溝通方面，超出了最初的預期。這些進展突顯了 AI 驅動解決方案在物流方面的潛力，這表示有許多機會可以進一步改善並在 PostNL 的營運架構中更廣泛地實施。</paragraph>", "author": "Mohammad Reshadati et.al.", "authors": "Mohammad Reshadati", "id": "2409.02711v1", "paper_url": "http://arxiv.org/abs/2409.02711v1", "repo": "null"}}