{"2405.10218": {"publish_time": "2024-05-16", "title": "ENADPool: The Edge-Node Attention-based Differentiable Pooling for Graph Neural Networks", "paper_summary": "Graph Neural Networks (GNNs) are powerful tools for graph classification. One\nimportant operation for GNNs is the downsampling or pooling that can learn\neffective embeddings from the node representations. In this paper, we propose a\nnew hierarchical pooling operation, namely the Edge-Node Attention-based\nDifferentiable Pooling (ENADPool), for GNNs to learn effective graph\nrepresentations. Unlike the classical hierarchical pooling operation that is\nbased on the unclear node assignment and simply computes the averaged feature\nover the nodes of each cluster, the proposed ENADPool not only employs a hard\nclustering strategy to assign each node into an unique cluster, but also\ncompress the node features as well as their edge connectivity strengths into\nthe resulting hierarchical structure based on the attention mechanism after\neach pooling step. As a result, the proposed ENADPool simultaneously identifies\nthe importance of different nodes within each separated cluster and edges\nbetween corresponding clusters, that significantly addresses the shortcomings\nof the uniform edge-node based structure information aggregation arising in the\nclassical hierarchical pooling operation. Moreover, to mitigate the\nover-smoothing problem arising in existing GNNs, we propose a Multi-distance\nGNN (MD-GNN) model associated with the proposed ENADPool operation, allowing\nthe nodes to actively and directly receive the feature information from\nneighbors at different random walk steps. Experiments demonstrate the\neffectiveness of the MD-GNN associated with the proposed ENADPool.", "paper_summary_zh": "圖形神經網路 (GNN) 是用於圖形分類的強大工具。GNN 的一個重要操作是降採樣或池化，它可以從節點表示中學習有效的嵌入。在本文中，我們提出了一個新的分層池化操作，即基於邊緣節點注意力的可微池化 (ENADPool)，供 GNN 學習有效的圖形表示。與基於不明確節點分配並僅計算每個群集節點的平均特徵的經典分層池化操作不同，所提出的 ENADPool 不僅採用硬群集策略將每個節點分配到一個唯一的群集，而且還將節點特徵及其邊緣連接強度壓縮到在每個池化步驟之後基於注意力機制的結果分層結構中。因此，所提出的 ENADPool 同時識別了每個分隔群集內不同節點的重要性以及對應群集之間的邊緣，這顯著地解決了經典分層池化操作中出現的基於均勻邊緣節點的結構信息聚合的缺點。此外，為了減輕現有 GNN 中出現的過度平滑問題，我們提出了一個與所提出的 ENADPool 操作相關的多距離 GNN (MD-GNN) 模型，允許節點主動直接接收來自不同隨機遊走步驟的鄰居的特徵信息。實驗證明了與所提出的 ENADPool 相關的 MD-GNN 的有效性。", "author": "Zhehan Zhao et.al.", "authors": "Zhehan Zhao, Lu Bai, Lixin Cui, Ming Li, Yue Wang, Lixiang Xu, Edwin R. Hancock", "id": "2405.10218v1", "paper_url": "http://arxiv.org/abs/2405.10218v1", "repo": "null"}}