{"2406.14230": {"publish_time": "2024-06-20", "title": "Raising the Bar: Investigating the Values of Large Language Models via Generative Evolving Testing", "paper_summary": "Warning: this paper contains model outputs exhibiting unethical information.\nLarge Language Models (LLMs) have achieved significant breakthroughs, but their\ngenerated unethical content poses potential risks. Measuring value alignment of\nLLMs becomes crucial for their regulation and responsible deployment. Numerous\ndatasets have been constructed to assess social bias, toxicity, and ethics in\nLLMs, but they suffer from evaluation chronoeffect, that is, as models rapidly\nevolve, existing data becomes leaked or undemanding, overestimating\never-developing LLMs. To tackle this problem, we propose GETA, a novel\ngenerative evolving testing approach that dynamically probes the underlying\nmoral baselines of LLMs. Distinct from previous adaptive testing methods that\nrely on static datasets with limited difficulty, GETA incorporates an\niteratively-updated item generator which infers each LLM's moral boundaries and\ngenerates difficulty-tailored testing items, accurately reflecting the true\nalignment extent. This process theoretically learns a joint distribution of\nitem and model response, with item difficulty and value conformity as latent\nvariables, where the generator co-evolves with the LLM, addressing\nchronoeffect. We evaluate various popular LLMs with diverse capabilities and\ndemonstrate that GETA can create difficulty-matching testing items and more\naccurately assess LLMs' values, better consistent with their performance on\nunseen OOD and i.i.d. items, laying the groundwork for future evaluation\nparadigms.", "paper_summary_zh": "警告：本文包含展示不道德資訊的模型輸出。\n大型語言模型 (LLM) 已取得重大突破，但它們產生的不道德內容構成潛在風險。衡量 LLM 的價值觀一致性對於其監管和負責任的部署至關重要。已經建構了大量資料集來評估 LLM 中的社會偏見、毒性和道德，但它們存在評估時間效應，也就是隨著模型快速演進，現有資料會洩露或變得不具挑戰性，高估持續發展的 LLM。為了解決這個問題，我們提出 GETA，一種新的生成式演化測試方法，動態探測 LLM 的基本道德基準。有別於依賴難度有限的靜態資料集的先前適應性測試方法，GETA 結合了一個反覆更新的項目產生器，它推論每個 LLM 的道德界限並產生量身打造的測試項目，準確反映真正的對齊程度。此過程理論上會學習項目和模型回應的聯合分佈，其中項目難度和價值符合性為潛在變數，產生器與 LLM 共同演化，解決時間效應。我們評估了各種具有不同功能的熱門 LLM，並證明 GETA 可以建立難度匹配的測試項目，更準確地評估 LLM 的價值觀，更符合它們在未見過 OOD 和 i.i.d. 項目上的表現，為未來的評估範例奠定基礎。", "author": "Han Jiang et.al.", "authors": "Han Jiang, Xiaoyuan Yi, Zhihua Wei, Shu Wang, Xing Xie", "id": "2406.14230v1", "paper_url": "http://arxiv.org/abs/2406.14230v1", "repo": "null"}}