{"2410.04704": {"publish_time": "2024-10-07", "title": "Modeling and Estimation of Vocal Tract and Glottal Source Parameters Using ARMAX-LF Model", "paper_summary": "Modeling and estimation of the vocal tract and glottal source parameters of\nvowels from raw speech can be typically done by using the Auto-Regressive with\neXogenous input (ARX) model and Liljencrants-Fant (LF) model with an\niteration-based estimation approach. However, the all-pole autoregressive model\nin the modeling of vocal tract filters cannot provide the locations of\nanti-formants (zeros), which increases the estimation errors in certain classes\nof speech sounds, such as nasal, fricative, and stop consonants. In this paper,\nwe propose the Auto-Regressive Moving Average eXogenous with LF (ARMAX-LF)\nmodel to extend the ARX-LF model to a wider variety of speech sounds, including\nvowels and nasalized consonants. The LF model represents the glottal source\nderivative as a parametrized time-domain model, and the ARMAX model represents\nthe vocal tract as a pole-zero filter with an additional exogenous LF\nexcitation as input. To estimate multiple parameters with fewer errors, we\nfirst utilize the powerful nonlinear fitting ability of deep neural networks\n(DNNs) to build a mapping from extracted glottal source derivatives or speech\nwaveforms to corresponding LF parameters. Then, glottal source and vocal tract\nparameters can be estimated with fewer estimation errors and without any\niterations as in the analysis-by-synthesis strategy. Experimental results with\nsynthesized speech using the linear source-filter model, synthesized speech\nusing the physical model, and real speech signals showed that the proposed\nARMAX-LF model with a DNN-based estimation method can estimate the parameters\nof both vowels and nasalized sounds with fewer errors and estimation time.", "paper_summary_zh": "<paragraph>從原始語音建模並估計聲道和聲門源參數通常可以透過使用具有外生輸入的自動迴歸 (ARX) 模型和基於反覆運算估計方法的 Liljencrants-Fant (LF) 模型來完成。然而，聲道濾波器建模中的全極自動迴歸模型無法提供反共振點 (零點) 的位置，這會增加某些類別的語音音素（例如鼻音、擦音和塞音）的估計誤差。在本文中，我們提出自動迴歸移動平均外生 LF (ARMAX-LF) 模型，將 ARX-LF 模型擴展到更多類別的語音音素，包括元音和鼻化輔音。LF 模型將聲門源導數表示為參數化的時域模型，而 ARMAX 模型將聲道表示為具有額外外生 LF 激勵作為輸入的極零濾波器。為了以較少的誤差估計多個參數，我們首先利用深度神經網路 (DNN) 強大的非線性擬合能力，從提取的聲門源導數或語音波形建立到對應 LF 參數的對應。然後，聲門源和聲道參數可以用較少的估計誤差和無需任何反覆運算（就像在分析合成策略中一樣）來估計。使用線性源濾波器合成的語音、使用物理模型合成的語音和真實語音訊號的實驗結果顯示，所提出的 ARMAX-LF 模型搭配基於 DNN 的估計方法，可以以較少的誤差和估計時間估計元音和鼻音的參數。</paragraph>", "author": "Kai Lia et.al.", "authors": "Kai Lia, Masato Akagia, Yongwei Lib, Masashi Unokia", "id": "2410.04704v1", "paper_url": "http://arxiv.org/abs/2410.04704v1", "repo": "null"}}