{"2405.14522": {"publish_time": "2024-05-23", "title": "Explaining Black-box Model Predictions via Two-level Nested Feature Attributions with Consistency Property", "paper_summary": "Techniques that explain the predictions of black-box machine learning models\nare crucial to make the models transparent, thereby increasing trust in AI\nsystems. The input features to the models often have a nested structure that\nconsists of high- and low-level features, and each high-level feature is\ndecomposed into multiple low-level features. For such inputs, both high-level\nfeature attributions (HiFAs) and low-level feature attributions (LoFAs) are\nimportant for better understanding the model's decision. In this paper, we\npropose a model-agnostic local explanation method that effectively exploits the\nnested structure of the input to estimate the two-level feature attributions\nsimultaneously. A key idea of the proposed method is to introduce the\nconsistency property that should exist between the HiFAs and LoFAs, thereby\nbridging the separate optimization problems for estimating them. Thanks to this\nconsistency property, the proposed method can produce HiFAs and LoFAs that are\nboth faithful to the black-box models and consistent with each other, using a\nsmaller number of queries to the models. In experiments on image classification\nin multiple instance learning and text classification using language models, we\ndemonstrate that the HiFAs and LoFAs estimated by the proposed method are\naccurate, faithful to the behaviors of the black-box models, and provide\nconsistent explanations.", "paper_summary_zh": "技術說明黑箱機器學習模型預測對於讓模型透明化至關重要，進而增加對 AI 系統的信任。模型的輸入特徵通常具有嵌套結構，由高階和低階特徵組成，每個高階特徵分解成多個低階特徵。對於此類輸入，高階特徵歸因 (HiFA) 和低階特徵歸因 (LoFA) 對於更深入了解模型的決策都很重要。在本文中，我們提出了一種與模型無關的局部解釋方法，它有效利用輸入的嵌套結構來同時估計兩級特徵歸因。所提出方法的一個關鍵概念是引入 HiFA 和 LoFA 之間應存在的相容性屬性，從而橋接估計它們的單獨最佳化問題。得益於這種相容性屬性，所提出的方法可以產生對黑箱模型忠實且彼此相容的 HiFA 和 LoFA，同時使用較少數量的查詢來查詢模型。在使用語言模型進行多實例學習和文本分類的影像分類實驗中，我們證明所提出的方法估計的 HiFA 和 LoFA 準確、忠實於黑箱模型的行為，並提供一致的解釋。", "author": "Yuya Yoshikawa et.al.", "authors": "Yuya Yoshikawa, Masanari Kimura, Ryotaro Shimizu, Yuki Saito", "id": "2405.14522v1", "paper_url": "http://arxiv.org/abs/2405.14522v1", "repo": "null"}}