{"2412.02083": {"publish_time": "2024-12-03", "title": "Implementing An Artificial Quantum Perceptron", "paper_summary": "A Perceptron is a fundamental building block of a neural network. The\nflexibility and scalability of perceptron make it ubiquitous in building\nintelligent systems. Studies have shown the efficacy of a single neuron in\nmaking intelligent decisions. Here, we examined and compared two perceptrons\nwith distinct mechanisms, and developed a quantum version of one of those\nperceptrons. As a part of this modeling, we implemented the quantum circuit for\nan artificial perception, generated a dataset, and simulated the training.\nThrough these experiments, we show that there is an exponential growth\nadvantage and test different qubit versions. Our findings show that this\nquantum model of an individual perceptron can be used as a pattern classifier.\nFor the second type of model, we provide an understanding to design and\nsimulate a spike-dependent quantum perceptron. Our code is available at\n\\url{https://github.com/ashutosh1919/quantum-perceptron}", "paper_summary_zh": "感知器是神经網路的基本組成部分。感知器的靈活性與可擴充性使其在建構智慧系統時無所不在。研究已顯示單一神經元在做出智慧決策時的效能。在此，我們檢視並比較了兩種具有不同機制的感知器，並開發了其中一種感知器的量子版本。作為此建模的一部分，我們實作了人工感知的量子電路，生成了資料集，並模擬了訓練。透過這些實驗，我們顯示出有指數成長的優勢，並測試了不同的量子位元版本。我們的研究結果顯示，這種個別感知器的量子模型可用作模式分類器。對於第二種類型的模型，我們提供了解，以設計和模擬尖峰依賴量子感知器。我們的程式碼可於\\url{https://github.com/ashutosh1919/quantum-perceptron}取得", "author": "Ashutosh Hathidara et.al.", "authors": "Ashutosh Hathidara, Lalit Pandey", "id": "2412.02083v1", "paper_url": "http://arxiv.org/abs/2412.02083v1", "repo": "null"}}