{"2405.07500": {"publish_time": "2024-05-13", "title": "PromptLink: Leveraging Large Language Models for Cross-Source Biomedical Concept Linking", "paper_summary": "Linking (aligning) biomedical concepts across diverse data sources enables\nvarious integrative analyses, but it is challenging due to the discrepancies in\nconcept naming conventions. Various strategies have been developed to overcome\nthis challenge, such as those based on string-matching rules, manually crafted\nthesauri, and machine learning models. However, these methods are constrained\nby limited prior biomedical knowledge and can hardly generalize beyond the\nlimited amounts of rules, thesauri, or training samples. Recently, large\nlanguage models (LLMs) have exhibited impressive results in diverse biomedical\nNLP tasks due to their unprecedentedly rich prior knowledge and strong\nzero-shot prediction abilities. However, LLMs suffer from issues including high\ncosts, limited context length, and unreliable predictions. In this research, we\npropose PromptLink, a novel biomedical concept linking framework that leverages\nLLMs. It first employs a biomedical-specialized pre-trained language model to\ngenerate candidate concepts that can fit in the LLM context windows. Then it\nutilizes an LLM to link concepts through two-stage prompts, where the\nfirst-stage prompt aims to elicit the biomedical prior knowledge from the LLM\nfor the concept linking task and the second-stage prompt enforces the LLM to\nreflect on its own predictions to further enhance their reliability. Empirical\nresults on the concept linking task between two EHR datasets and an external\nbiomedical KG demonstrate the effectiveness of PromptLink. Furthermore,\nPromptLink is a generic framework without reliance on additional prior\nknowledge, context, or training data, making it well-suited for concept linking\nacross various types of data sources. The source code is available at\nhttps://github.com/constantjxyz/PromptLink.", "paper_summary_zh": "<paragraph>連結（對齊）不同資料來源的生物醫學概念可以進行各種整合分析，但由於概念命名慣例存在差異，因此具有挑戰性。已經開發出各種策略來克服此挑戰，例如基於字串比對規則、人工建立的同義詞庫和機器學習模型的策略。然而，這些方法受到有限的先前生物醫學知識的約束，而且很難概括超出有限的規則、同義詞庫或訓練樣本。最近，大型語言模型 (LLM) 由於其前所未有的豐富先驗知識和強大的零次方預測能力，在不同的生物醫學 NLP 任務中表現出令人印象深刻的結果。然而，LLM 存在成本高、上下文長度受限和預測不可靠等問題。在這項研究中，我們提出 PromptLink，一個利用 LLM 的新生物醫學概念連結架構。它首先採用生物醫學專業的預訓練語言模型來產生候選概念，這些概念可以放入 LLM 上下文視窗中。然後，它利用 LLM 透過兩階段提示來連結概念，其中第一階段提示旨在從 LLM 引出概念連結任務的生物醫學先驗知識，而第二階段提示強制 LLM 反思自己的預測以進一步提高其可靠性。在兩個 EHR 資料集和一個外部生物醫學 KG 之間的概念連結任務上的經驗結果證明了 PromptLink 的有效性。此外，PromptLink 是一個通用架構，不依賴額外的先驗知識、上下文或訓練資料，使其非常適合連結各種類型資料來源的概念。原始程式碼可在 https://github.com/constantjxyz/PromptLink 取得。</paragraph>", "author": "Yuzhang Xie et.al.", "authors": "Yuzhang Xie, Jiaying Lu, Joyce Ho, Fadi Nahab, Xiao Hu, Carl Yang", "id": "2405.07500v1", "paper_url": "http://arxiv.org/abs/2405.07500v1", "repo": "https://github.com/constantjxyz/promptlink"}}