{"2412.08467": {"publish_time": "2024-12-11", "title": "Bootstrapping Language-Guided Navigation Learning with Self-Refining Data Flywheel", "paper_summary": "Creating high-quality data for training robust language-instructed agents is\na long-lasting challenge in embodied AI. In this paper, we introduce a\nSelf-Refining Data Flywheel (SRDF) that generates high-quality and large-scale\nnavigational instruction-trajectory pairs by iteratively refining the data pool\nthrough the collaboration between two models, the instruction generator and the\nnavigator, without any human-in-the-loop annotation. Specifically, SRDF starts\nwith using a base generator to create an initial data pool for training a base\nnavigator, followed by applying the trained navigator to filter the data pool.\nThis leads to higher-fidelity data to train a better generator, which can, in\nturn, produce higher-quality data for training the next-round navigator. Such a\nflywheel establishes a data self-refining process, yielding a continuously\nimproved and highly effective dataset for large-scale language-guided\nnavigation learning. Our experiments demonstrate that after several flywheel\nrounds, the navigator elevates the performance boundary from 70% to 78% SPL on\nthe classic R2R test set, surpassing human performance (76%) for the first\ntime. Meanwhile, this process results in a superior generator, evidenced by a\nSPICE increase from 23.5 to 26.2, better than all previous VLN instruction\ngeneration methods. Finally, we demonstrate the scalability of our method\nthrough increasing environment and instruction diversity, and the\ngeneralization ability of our pre-trained navigator across various downstream\nnavigation tasks, surpassing state-of-the-art methods by a large margin in all\ncases.", "paper_summary_zh": "<paragraph>為訓練強大的語言指導代理建立高品質資料是體現式人工智慧的長期挑戰。在這篇論文中，我們介紹一個自我精煉資料飛輪 (SRDF)，透過兩個模型（指令產生器和導航員）的合作，在資料庫中反覆精煉資料，產生高品質且大規模的導航指令軌跡配對，而無需任何人工迴圈註解。具體來說，SRDF 從使用基本產生器建立一個初始資料庫，用於訓練基本導航員，接著使用訓練好的導航員來過濾資料庫。這會產生更高保真度的資料，用於訓練更好的產生器，進而產生更高品質的資料，用於訓練下一輪導航員。這樣的飛輪建立了一個資料自我精煉流程，產生一個持續改善且高度有效的資料集，用於大規模語言引導導航學習。我們的實驗顯示，經過幾輪飛輪後，導航員將經典 R2R 測試集上的效能界線從 70% 提升到 78% SPL，首次超越人類效能 (76%)。同時，這個流程產生了一個優異的產生器，SPICE 從 23.5 增加到 26.2，優於所有先前的 VLN 指令產生方法。最後，我們透過增加環境和指令多樣性，以及預訓練導航員在各種下游導航任務中的泛化能力，證明了我們方法的可擴充性，在所有情況下都大幅超越現有技術。</paragraph>", "author": "Zun Wang et.al.", "authors": "Zun Wang, Jialu Li, Yicong Hong, Songze Li, Kunchang Li, Shoubin Yu, Yi Wang, Yu Qiao, Yali Wang, Mohit Bansal, Limin Wang", "id": "2412.08467v1", "paper_url": "http://arxiv.org/abs/2412.08467v1", "repo": "null"}}