{"2501.11623": {"publish_time": "2025-01-20", "title": "Early evidence of how LLMs outperform traditional systems on OCR/HTR tasks for historical records", "paper_summary": "We explore the ability of two LLMs -- GPT-4o and Claude Sonnet 3.5 -- to\ntranscribe historical handwritten documents in a tabular format and compare\ntheir performance to traditional OCR/HTR systems: EasyOCR, Keras, Pytesseract,\nand TrOCR. Considering the tabular form of the data, two types of experiments\nare executed: one where the images are split line by line and the other where\nthe entire scan is used as input. Based on CER and BLEU, we demonstrate that\nLLMs outperform the conventional OCR/HTR methods. Moreover, we also compare the\nevaluated CER and BLEU scores to human evaluations to better judge the outputs\nof whole-scan experiments and understand influential factors for CER and BLEU.\nCombining judgments from all the evaluation metrics, we conclude that two-shot\nGPT-4o for line-by-line images and two-shot Claude Sonnet 3.5 for whole-scan\nimages yield the transcriptions of the historical records most similar to the\nground truth.", "paper_summary_zh": "我們探討兩個 LLM -- GPT-4o 和 Claude Sonnet 3.5 -- 以表格格式轉錄歷史手寫文件的能\n力，並將其效能與傳統的 OCR/HTR 系統進行比較：EasyOCR、Keras、Pytesseract 和 TrOCR。考量到資料的表格形式，執行了兩種實驗：一種是將影像逐行分割，另一種是使用整個掃描作為輸入。根據 CER 和 BLEU，我們證明 LLM 的表現優於傳統的 OCR/HTR 方法。此外，我們還將評估的 CER 和 BLEU 分數與人工評分進行比較，以更好地判斷全掃描實驗的輸出，並了解影響 CER 和 BLEU 的因素。結合所有評分指標的判斷，我們得出結論，逐行影像的兩次 GPT-4o 和全掃描影像的兩次 Claude Sonnet 3.5 產生與真實情況最相似的歷史記錄轉錄。", "author": "Seorin Kim et.al.", "authors": "Seorin Kim, Julien Baudru, Wouter Ryckbosch, Hugues Bersini, Vincent Ginis", "id": "2501.11623v1", "paper_url": "http://arxiv.org/abs/2501.11623v1", "repo": "null"}}