{"2408.00914": {"publish_time": "2024-08-01", "title": "Granting GPT-4 License and Opportunity: Enhancing Accuracy and Confidence Estimation for Few-Shot Event Detection", "paper_summary": "Large Language Models (LLMs) such as GPT-4 have shown enough promise in the\nfew-shot learning context to suggest use in the generation of \"silver\" data and\nrefinement of new ontologies through iterative application and review. Such\nworkflows become more effective with reliable confidence estimation.\nUnfortunately, confidence estimation is a documented weakness of models such as\nGPT-4, and established methods to compensate require significant additional\ncomplexity and computation. The present effort explores methods for effective\nconfidence estimation with GPT-4 with few-shot learning for event detection in\nthe BETTER ontology as a vehicle. The key innovation is expanding the prompt\nand task presented to GPT-4 to provide License to speculate when unsure and\nOpportunity to quantify and explain its uncertainty (L&O). This approach\nimproves accuracy and provides usable confidence measures (0.759 AUC) with no\nadditional machinery.", "paper_summary_zh": "大型語言模型（LLM），例如 GPT-4，在小樣本學習情境中已展現足夠的潛力，建議用於產生「銀」數據，並透過反覆應用和檢視來改進新的本體論。此類工作流程會隨著可靠的信心估計而變得更有效。遺憾的是，信心估計是 GPT-4 等模型的已記錄弱點，而補償已建立方法需要大量額外的複雜性和運算。目前的努力探索了使用 GPT-4 進行有效信心估計的方法，以事件偵測為載具，在 BETTER 本體論中進行小樣本學習。關鍵創新是擴展提示和任務，提供給 GPT-4，以便在不確定時獲得推測許可，並有機會量化和解釋其不確定性（L&O）。此方法可提升準確度，並提供可用的信心測量（0.759 AUC），而無需額外機制。", "author": "Steven Fincke et.al.", "authors": "Steven Fincke, Adrien Bibal, Elizabeth Boschee", "id": "2408.00914v1", "paper_url": "http://arxiv.org/abs/2408.00914v1", "repo": "null"}}