{"2411.07013": {"publish_time": "2024-11-11", "title": "A neural-network based anomaly detection system and a safety protocol to protect vehicular network", "paper_summary": "This thesis addresses the use of Cooperative Intelligent Transport Systems\n(CITS) to improve road safety and efficiency by enabling vehicle-to-vehicle\ncommunication, highlighting the importance of secure and accurate data\nexchange. To ensure safety, the thesis proposes a Machine Learning-based\nMisbehavior Detection System (MDS) using Long Short-Term Memory (LSTM) networks\nto detect and mitigate incorrect or misleading messages within vehicular\nnetworks. Trained offline on the VeReMi dataset, the detection model is tested\nin real-time within a platooning scenario, demonstrating that it can prevent\nnearly all accidents caused by misbehavior by triggering a defense protocol\nthat dissolves the platoon if anomalies are detected. The results show that\nwhile the system can accurately detect general misbehavior, it struggles to\nlabel specific types due to varying traffic conditions, implying the difficulty\nof creating a universally adaptive protocol. However, the thesis suggests that\nwith more data and further refinement, this MDS could be implemented in\nreal-world CITS, enhancing driving safety by mitigating risks from misbehavior\nin cooperative driving networks.", "paper_summary_zh": "本論文探討使用協同智慧運輸系統 (CITS) 來改善道路安全和效率，方法是啟用車對車通訊，並強調安全且準確的資料交換的重要性。為了確保安全，本論文提出一個基於機器學習的不當行為偵測系統 (MDS)，使用長短期記憶 (LSTM) 網路來偵測和減輕車輛網路中的不正確或誤導訊息。偵測模型在 VeReMi 資料集上離線訓練，並在排隊場景中進行即時測試，證明它可以透過觸發防禦協定來防止幾乎所有由不當行為造成的意外，而當偵測到異常時，會解散排隊。結果顯示，雖然系統可以準確偵測一般的不當行為，但由於交通狀況不同，系統難以標記特定類型的不當行為，這表示建立一個普遍適應的協定有其難度。然而，本論文建議，透過更多資料和進一步的修正，這個 MDS 可以實作在真實世界的 CITS 中，透過減輕協同駕駛網路中不當行為的風險來提升行車安全。", "author": "Marco Franceschini et.al.", "authors": "Marco Franceschini", "id": "2411.07013v1", "paper_url": "http://arxiv.org/abs/2411.07013v1", "repo": "null"}}