{"2407.16613": {"publish_time": "2024-07-23", "title": "No-brainer: Morphological Computation driven Adaptive Behavior in Soft Robots", "paper_summary": "It is prevalent in contemporary AI and robotics to separately postulate a\nbrain modeled by neural networks and employ it to learn intelligent and\nadaptive behavior. While this method has worked very well for many types of\ntasks, it isn't the only type of intelligence that exists in nature. In this\nwork, we study the ways in which intelligent behavior can be created without a\nseparate and explicit brain for robot control, but rather solely as a result of\nthe computation occurring within the physical body of a robot. Specifically, we\nshow that adaptive and complex behavior can be created in voxel-based virtual\nsoft robots by using simple reactive materials that actively change the shape\nof the robot, and thus its behavior, under different environmental cues. We\ndemonstrate a proof of concept for the idea of closed-loop morphological\ncomputation, and show that in our implementation, it enables behavior mimicking\nlogic gates, enabling us to demonstrate how such behaviors may be combined to\nbuild up more complex collective behaviors.", "paper_summary_zh": "在當代的人工智慧與機器人領域中，普遍的做法是分別假設一個由神經網路建模的大腦，並使用它來學習智慧且適應性的行為。雖然這種方法在許多類型的任務中運作良好，但它並非自然界中存在的唯一智慧類型。在本研究中，我們探討了在沒有機器人控制的獨立且明確大腦的情況下，智慧行為可以如何被創造出來，而僅僅是機器人實體內部運算的結果。具體來說，我們展示了適應性和複雜的行為可以在基於體素的虛擬軟機器人中被創造出來，方法是使用簡單的反應材料，這些材料會積極改變機器人的形狀，並因此在不同的環境提示下改變其行為。我們展示了一個封閉迴路形態運算概念的驗證，並展示在我們的實作中，它能讓行為模擬邏輯閘，使我們能夠展示如何將這些行為組合起來，以建立更複雜的集體行為。", "author": "Alican Mertan et.al.", "authors": "Alican Mertan, Nick Cheney", "id": "2407.16613v1", "paper_url": "http://arxiv.org/abs/2407.16613v1", "repo": "null"}}