{"2411.04696": {"publish_time": "2024-11-07", "title": "The Multiple Dimensions of Spuriousness in Machine Learning", "paper_summary": "Learning correlations from data forms the foundation of today's machine\nlearning (ML) and artificial intelligence (AI) research. While such an approach\nenables the automatic discovery of patterned relationships within big data\ncorpora, it is susceptible to failure modes when unintended correlations are\ncaptured. This vulnerability has expanded interest in interrogating\nspuriousness, often critiqued as an impediment to model performance, fairness,\nand robustness. In this article, we trace deviations from the conventional\ndefinition of statistical spuriousness-which denotes a non-causal observation\narising from either coincidence or confounding variables-to articulate how ML\nresearchers make sense of spuriousness in practice. Drawing on a broad survey\nof ML literature, we conceptualize the \"multiple dimensions of spuriousness,\"\nencompassing: relevance (\"Models should only use correlations that are relevant\nto the task.\"), generalizability (\"Models should only use correlations that\ngeneralize to unseen data\"), human-likeness (\"Models should only use\ncorrelations that a human would use to perform the same task\"), and harmfulness\n(\"Models should only use correlations that are not harmful\"). These dimensions\ndemonstrate that ML spuriousness goes beyond the causal/non-causal dichotomy\nand that the disparate interpretative paths researchers choose could\nmeaningfully influence the trajectory of ML development. By underscoring how a\nfundamental problem in ML is contingently negotiated in research contexts, we\ncontribute to ongoing debates about responsible practices in AI development.", "paper_summary_zh": "從資料中學習關聯性，是當今機器學習 (ML) 和人工智慧 (AI) 研究的基礎。雖然這種方法能自動發現大數據語料庫中模式化的關係，但當擷取到非預期的關聯性時，它容易發生故障模式。這種脆弱性擴大了對審查虛假性的興趣，虛假性通常被批評為模型效能、公平性和穩健性的障礙。在本文中，我們追溯統計虛假性的傳統定義的偏差，該定義表示非因果觀察源自巧合或混淆變數，以闡明 ML 研究人員如何實際理解虛假性。根據 ML 文獻的廣泛調查，我們概念化了「虛假性的多重面向」，包括：相關性（「模型應僅使用與任務相關的關聯性。」）、可概化性（「模型應僅使用可概化到未見數據的關聯性。」）、類人化（「模型應僅使用人類會用來執行相同任務的關聯性。」）和有害性（「模型應僅使用無害的關聯性。」）。這些面向證明了 ML 虛假性超越了因果/非因果二分法，而且研究人員選擇的不同詮釋路徑可能會顯著影響 ML 發展的軌跡。透過強調 ML 中的基本問題如何在研究背景中被偶然協商，我們為 AI 開發中關於負責任實務的持續辯論做出貢獻。", "author": "Samuel J. Bell et.al.", "authors": "Samuel J. Bell, Skyler Wang", "id": "2411.04696v1", "paper_url": "http://arxiv.org/abs/2411.04696v1", "repo": "null"}}