{"2410.03665": {"publish_time": "2024-10-04", "title": "Estimating Body and Hand Motion in an Ego-sensed World", "paper_summary": "We present EgoAllo, a system for human motion estimation from a head-mounted\ndevice. Using only egocentric SLAM poses and images, EgoAllo guides sampling\nfrom a conditional diffusion model to estimate 3D body pose, height, and hand\nparameters that capture the wearer's actions in the allocentric coordinate\nframe of the scene. To achieve this, our key insight is in representation: we\npropose spatial and temporal invariance criteria for improving model\nperformance, from which we derive a head motion conditioning parameterization\nthat improves estimation by up to 18%. We also show how the bodies estimated by\nour system can improve the hands: the resulting kinematic and temporal\nconstraints result in over 40% lower hand estimation errors compared to noisy\nmonocular estimates. Project page: https://egoallo.github.io/", "paper_summary_zh": "我們提出 EgoAllo，一種從頭戴式裝置估計人體動作的系統。僅使用自我中心 SLAM 姿勢和影像，EgoAllo 引導從條件擴散模型中取樣，以估計 3D 身體姿勢、高度和手部參數，捕捉穿戴者在場景世界座標系中的動作。為達成此目的，我們的關鍵見解在於表示：我們提出空間和時間不變性準則以改善模型效能，由此我們衍生出頭部動作條件參數化，可將估計值改善多達 18%。我們也展示我們的系統估計的身體如何改善手部：與有雜訊的單眼估計值相比，產生的運動學和時間約束可將手部估計誤差降低超過 40%。專案頁面：https://egoallo.github.io/", "author": "Brent Yi et.al.", "authors": "Brent Yi, Vickie Ye, Maya Zheng, Lea Müller, Georgios Pavlakos, Yi Ma, Jitendra Malik, Angjoo Kanazawa", "id": "2410.03665v1", "paper_url": "http://arxiv.org/abs/2410.03665v1", "repo": "null"}}