{"2503.10265": {"publish_time": "2025-03-13", "title": "SurgRAW: Multi-Agent Workflow with Chain-of-Thought Reasoning for Surgical Intelligence", "paper_summary": "Integration of Vision-Language Models (VLMs) in surgical intelligence is\nhindered by hallucinations, domain knowledge gaps, and limited understanding of\ntask interdependencies within surgical scenes, undermining clinical\nreliability. While recent VLMs demonstrate strong general reasoning and\nthinking capabilities, they still lack the domain expertise and task-awareness\nrequired for precise surgical scene interpretation. Although Chain-of-Thought\n(CoT) can structure reasoning more effectively, current approaches rely on\nself-generated CoT steps, which often exacerbate inherent domain gaps and\nhallucinations. To overcome this, we present SurgRAW, a CoT-driven multi-agent\nframework that delivers transparent, interpretable insights for most tasks in\nrobotic-assisted surgery. By employing specialized CoT prompts across five\ntasks: instrument recognition, action recognition, action prediction, patient\ndata extraction, and outcome assessment, SurgRAW mitigates hallucinations\nthrough structured, domain-aware reasoning. Retrieval-Augmented Generation\n(RAG) is also integrated to external medical knowledge to bridge domain gaps\nand improve response reliability. Most importantly, a hierarchical agentic\nsystem ensures that CoT-embedded VLM agents collaborate effectively while\nunderstanding task interdependencies, with a panel discussion mechanism\npromotes logical consistency. To evaluate our method, we introduce\nSurgCoTBench, the first reasoning-based dataset with structured frame-level\nannotations. With comprehensive experiments, we demonstrate the effectiveness\nof proposed SurgRAW with 29.32% accuracy improvement over baseline VLMs on 12\nrobotic procedures, achieving the state-of-the-art performance and advancing\nexplainable, trustworthy, and autonomous surgical assistance.", "paper_summary_zh": "<paragraph>視覺語言模型 (VLM) 與手術智慧的整合受限於幻覺、領域知識缺口，以及對手術場景中任務相互依存關係的理解有限，從而損害了臨床可靠性。雖然最近的 VLM 展現了強大的通用推理和思維能力，但它們仍然缺乏精確解讀手術場景所需的領域專業知識和任務意識。儘管思維鏈 (CoT) 可以更有效地組織推理，但目前的方法依賴於自行生成的 CoT 步驟，這通常會加劇固有的領域差距和幻覺。為了克服這個問題，我們提出了 SurgRAW，一個 CoT 驅動的多代理框架，可為機器人輔助手術中的大多數任務提供透明、可解釋的見解。透過在五項任務中使用專門的 CoT 提示：器械識別、動作識別、動作預測、患者數據提取和結果評估，SurgRAW 透過結構化、領域感知的推理來減輕幻覺。同時整合了檢索增強生成 (RAG) 和外部醫學知識，以彌合領域差距並提高響應可靠性。最重要的是，一個分層的代理系統確保嵌入 CoT 的 VLM 代理在理解任務相互依存關係的同時有效協作，並透過小組討論機制促進邏輯一致性。為了評估我們的方法，我們引入了 SurgCoTBench，這是第一個具有結構化幀級註釋的基於推理的數據集。透過全面的實驗，我們證明了所提出的 SurgRAW 的有效性，在 12 個機器人手術中，準確率比基準 VLM 提高了 29.32%，達到了最先進的性能，並推動了可解釋、可信賴和自主的手術輔助。</paragraph>\n", "author": "Chang Han Low et.al.", "authors": "Chang Han Low, Ziyue Wang, Tianyi Zhang, Zhitao Zeng, Zhu Zhuo, Evangelos B. Mazomenos, Yueming Jin", "id": "2503.10265v1", "paper_url": "http://arxiv.org/abs/2503.10265v1", "repo": "null"}}