{"2412.06044": {"publish_time": "2024-12-08", "title": "Cloud Platforms for Developing Generative AI Solutions: A Scoping Review of Tools and Services", "paper_summary": "Generative AI is transforming enterprise application development by enabling\nmachines to create content, code, and designs. These models, however, demand\nsubstantial computational power and data management. Cloud computing addresses\nthese needs by offering infrastructure to train, deploy, and scale generative\nAI models. This review examines cloud services for generative AI, focusing on\nkey providers like Amazon Web Services (AWS), Microsoft Azure, Google Cloud,\nIBM Cloud, Oracle Cloud, and Alibaba Cloud. It compares their strengths,\nweaknesses, and impact on enterprise growth. We explore the role of\nhigh-performance computing (HPC), serverless architectures, edge computing, and\nstorage in supporting generative AI. We also highlight the significance of data\nmanagement, networking, and AI-specific tools in building and deploying these\nmodels. Additionally, the review addresses security concerns, including data\nprivacy, compliance, and AI model protection. It assesses the performance and\ncost efficiency of various cloud providers and presents case studies from\nhealthcare, finance, and entertainment. We conclude by discussing challenges\nand future directions, such as technical hurdles, vendor lock-in,\nsustainability, and regulatory issues. Put together, this work can serve as a\nguide for practitioners and researchers looking to adopt cloud-based generative\nAI solutions, serving as a valuable guide to navigating the intricacies of this\nevolving field.", "paper_summary_zh": "生成式 AI 透過讓機器建立內容、程式碼和設計而轉變了企業應用程式開發。然而，這些模型需要大量的運算能力和資料管理。雲端運算透過提供訓練、部署和擴充生成式 AI 模型的基礎架構來滿足這些需求。此評論探討了生成式 AI 的雲端服務，重點關注 Amazon Web Services (AWS)、Microsoft Azure、Google Cloud、IBM Cloud、Oracle Cloud 和 Alibaba Cloud 等主要供應商。它比較了他們的優勢、劣勢和對企業成長的影響。我們探討了高性能運算 (HPC)、無伺服器架構、邊緣運算和儲存在支援生成式 AI 中的角色。我們也強調了資料管理、網路和 AI 專用工具在建立和部署這些模型中的重要性。此外，此評論也探討了安全問題，包括資料隱私、合規性和 AI 模型保護。它評估了各種雲端供應商的效能和成本效益，並提供來自醫療保健、金融和娛樂產業的案例研究。我們最後討論了挑戰和未來方向，例如技術難題、供應商鎖定、永續性和法規問題。總之，這項工作可以作為一個指南，供實務工作者和研究人員在採用基於雲端的生成式 AI 解决方案時參考，並作為了解這個不斷演進的領域錯綜複雜之處的寶貴指南。", "author": "Dhavalkumar Patel et.al.", "authors": "Dhavalkumar Patel, Ganesh Raut, Satya Narayan Cheetirala, Girish N Nadkarni, Robert Freeman, Benjamin S. Glicksberg, Eyal Klang, Prem Timsina", "id": "2412.06044v1", "paper_url": "http://arxiv.org/abs/2412.06044v1", "repo": "null"}}