{"2411.02671": {"publish_time": "2024-11-04", "title": "Fair In-Context Learning via Latent Concept Variables", "paper_summary": "The emerging in-context learning (ICL) ability of large language models\n(LLMs) has prompted their use for predictive tasks in various domains with\ndifferent types of data facilitated by serialization methods. However, with\nincreasing applications in high-stakes domains, it has been shown that LLMs can\ninherit social bias and discrimination from their pre-training data. In this\nwork, we investigate this inherent bias in LLMs during in-context learning with\ntabular data. We focus on an optimal demonstration selection approach that\nutilizes latent concept variables for resource-efficient task adaptation. We\ndesign data augmentation strategies that reduce correlation between predictive\noutcomes and sensitive variables helping to promote fairness during latent\nconcept learning. We utilize the learned concept and select demonstrations from\na training dataset to obtain fair predictions during inference while\nmaintaining model utility. The latent concept variable is learned using a\nsmaller internal LLM and the selected demonstrations can be used for inference\nwith larger external LLMs. We empirically verify that the fair latent variable\napproach improves fairness results on tabular datasets compared to multiple\nheuristic demonstration selection methods.", "paper_summary_zh": "大型語言模型（LLM）新興的脈絡學習（ICL）能力促使它們在各種領域使用序列化方法促進不同類型資料的預測任務。然而，隨著在高風險領域的應用增加，已顯示 LLM 可以從其預訓練資料繼承社會偏見和歧視。在這項工作中，我們研究了 LLM 在脈絡學習期間使用表格資料的這種內在偏見。我們專注於一種最佳示範選擇方法，該方法利用潛在概念變數進行資源有效率的任務適應。我們設計了資料擴充策略，以減少預測結果與敏感變數之間的關聯性，有助於在潛在概念學習期間促進公平性。我們利用學習到的概念並從訓練資料集中選擇示範，以在推論期間獲得公平的預測，同時保持模型效用。潛在概念變數是使用較小的內部 LLM 學習的，並且所選的示範可以用於推論，並使用較大的外部 LLM。我們憑經驗驗證，與多種啟發式示範選擇方法相比，公平的潛在變數方法改善了表格資料集上的公平性結果。", "author": "Karuna Bhaila et.al.", "authors": "Karuna Bhaila, Minh-Hao Van, Kennedy Edemacu, Chen Zhao, Feng Chen, Xintao Wu", "id": "2411.02671v1", "paper_url": "http://arxiv.org/abs/2411.02671v1", "repo": "https://github.com/karuna-bhaila/fairicl"}}