{"2502.02109": {"publish_time": "2025-02-04", "title": "Causally-informed Deep Learning towards Explainable and Generalizable Outcomes Prediction in Critical Care", "paper_summary": "Recent advances in deep learning (DL) have prompted the development of\nhigh-performing early warning score (EWS) systems, predicting clinical\ndeteriorations such as acute kidney injury, acute myocardial infarction, or\ncirculatory failure. DL models have proven to be powerful tools for various\ntasks but come with the cost of lacking interpretability and limited\ngeneralizability, hindering their clinical applications. To develop a practical\nEWS system applicable to various outcomes, we propose causally-informed\nexplainable early prediction model, which leverages causal discovery to\nidentify the underlying causal relationships of prediction and thus owns two\nunique advantages: demonstrating the explicit interpretation of the prediction\nwhile exhibiting decent performance when applied to unfamiliar environments.\nBenefiting from these features, our approach achieves superior accuracy for 6\ndifferent critical deteriorations and achieves better generalizability across\ndifferent patient groups, compared to various baseline algorithms. Besides, we\nprovide explicit causal pathways to serve as references for assistant clinical\ndiagnosis and potential interventions. The proposed approach enhances the\npractical application of deep learning in various medical scenarios.", "paper_summary_zh": "深度學習 (DL) 的最新進展促使開發出高性能早期預警評分 (EWS) 系統，預測急性腎臟損傷、急性心肌梗塞或循環衰竭等臨床惡化。DL 模型已被證明是各種任務的強大工具，但代價是缺乏可解釋性和有限的概括性，阻礙了其臨床應用。為了開發適用於各種結果的實用 EWS 系統，我們提出了因果關係解釋性早期預測模型，它利用因果發現來識別預測的潛在因果關係，從而擁有兩個獨特的優點：展示預測的明確解釋，同時在應用於不熟悉的環境時表現出良好的性能。得益於這些特性，與各種基線演算法相比，我們的模型在 6 種不同的危重惡化中實現了更高的準確度，並在不同的患者群體中實現了更好的概括性。此外，我們提供了明確的因果途徑，作為輔助臨床診斷和潛在干預措施的參考。所提出的方法增強了深度學習在各種醫療場景中的實際應用。", "author": "Yuxiao Cheng et.al.", "authors": "Yuxiao Cheng, Xinxin Song, Ziqian Wang, Qin Zhong, Kunlun He, Jinli Suo", "id": "2502.02109v1", "paper_url": "http://arxiv.org/abs/2502.02109v1", "repo": "null"}}