{"2411.14871": {"publish_time": "2024-11-22", "title": "Prioritize Denoising Steps on Diffusion Model Preference Alignment via Explicit Denoised Distribution Estimation", "paper_summary": "Diffusion models have shown remarkable success in text-to-image generation,\nmaking alignment methods for these models increasingly important. A key\nchallenge is the sparsity of preference labels, which are typically available\nonly at the terminal of denoising trajectories. This raises the issue of how to\nassign credit across denoising steps based on these sparse labels. In this\npaper, we propose Denoised Distribution Estimation (DDE), a novel method for\ncredit assignment. Unlike previous approaches that rely on auxiliary models or\nhand-crafted schemes, DDE derives its strategy more explicitly. The proposed\nDDE directly estimates the terminal denoised distribution from the perspective\nof each step. It is equipped with two estimation strategies and capable of\nrepresenting the entire denoising trajectory with a single model inference.\nTheoretically and empirically, we show that DDE prioritizes optimizing the\nmiddle part of the denoising trajectory, resulting in a novel and effective\ncredit assignment scheme. Extensive experiments demonstrate that our approach\nachieves superior performance, both quantitatively and qualitatively.", "paper_summary_zh": "擴散模型在文字轉圖片生成方面展現了顯著的成功，使得這些模型的對齊方法日益重要。一個關鍵挑戰是偏好標籤的稀疏性，這些標籤通常只在去噪軌跡的終端處可用。這引發了一個問題，即如何根據這些稀疏標籤在去噪步驟中分配信用。在本文中，我們提出去噪分佈估計（DDE），這是一種用於信用分配的新方法。與依賴於輔助模型或手工製作方案的先前方法不同，DDE 更明確地推導出其策略。所提出的 DDE 直接從每個步驟的角度估計終端去噪分佈。它配備了兩種估計策略，並且能夠使用單一模型推論來表示整個去噪軌跡。在理論上和經驗上，我們表明 DDE 優先優化去噪軌跡的中間部分，從而產生一種新穎且有效的信用分配方案。大量的實驗表明，我們的做法在質量和數量上都取得了優異的表現。", "author": "Dingyuan Shi et.al.", "authors": "Dingyuan Shi, Yong Wang, Hangyu Li, Xiangxiang Chu", "id": "2411.14871v1", "paper_url": "http://arxiv.org/abs/2411.14871v1", "repo": "null"}}