{"2411.03409": {"publish_time": "2024-11-05", "title": "STEER: Flexible Robotic Manipulation via Dense Language Grounding", "paper_summary": "The complexity of the real world demands robotic systems that can\nintelligently adapt to unseen situations. We present STEER, a robot learning\nframework that bridges high-level, commonsense reasoning with precise, flexible\nlow-level control. Our approach translates complex situational awareness into\nactionable low-level behavior through training language-grounded policies with\ndense annotation. By structuring policy training around fundamental, modular\nmanipulation skills expressed in natural language, STEER exposes an expressive\ninterface for humans or Vision-Language Models (VLMs) to intelligently\norchestrate the robot's behavior by reasoning about the task and context. Our\nexperiments demonstrate the skills learned via STEER can be combined to\nsynthesize novel behaviors to adapt to new situations or perform completely new\ntasks without additional data collection or training.", "paper_summary_zh": "現實世界的複雜性要求機器人系統能智慧地適應前所未見的情況。我們提出 STEER，一個機器人學習架構，它將高層次的常識推理與精確、靈活的低層次控制結合起來。我們的做法透過訓練以語言為基礎的政策和密集註解，將複雜的情境感知轉化為可操作的低層次行為。透過將政策訓練建構在以自然語言表達的基本模組化操作技能上，STEER 揭露了一個表現力豐富的介面，供人類或視覺語言模型（VLM）透過推理任務和情境來智慧地協調機器人的行為。我們的實驗證明透過 STEER 學到的技能可以結合起來，以綜合新的行為，以適應新的情況或執行全新的任務，而無需額外的資料收集或訓練。", "author": "Laura Smith et.al.", "authors": "Laura Smith, Alex Irpan, Montserrat Gonzalez Arenas, Sean Kirmani, Dmitry Kalashnikov, Dhruv Shah, Ted Xiao", "id": "2411.03409v1", "paper_url": "http://arxiv.org/abs/2411.03409v1", "repo": "null"}}