{"2411.06852": {"publish_time": "2024-11-11", "title": "Evaluating Large Language Models on Financial Report Summarization: An Empirical Study", "paper_summary": "In recent years, Large Language Models (LLMs) have demonstrated remarkable\nversatility across various applications, including natural language\nunderstanding, domain-specific knowledge tasks, etc. However, applying LLMs to\ncomplex, high-stakes domains like finance requires rigorous evaluation to\nensure reliability, accuracy, and compliance with industry standards. To\naddress this need, we conduct a comprehensive and comparative study on three\nstate-of-the-art LLMs, GLM-4, Mistral-NeMo, and LLaMA3.1, focusing on their\neffectiveness in generating automated financial reports. Our primary motivation\nis to explore how these models can be harnessed within finance, a field\ndemanding precision, contextual relevance, and robustness against erroneous or\nmisleading information. By examining each model's capabilities, we aim to\nprovide an insightful assessment of their strengths and limitations. Our paper\noffers benchmarks for financial report analysis, encompassing proposed metrics\nsuch as ROUGE-1, BERT Score, and LLM Score. We introduce an innovative\nevaluation framework that integrates both quantitative metrics (e.g.,\nprecision, recall) and qualitative analyses (e.g., contextual fit, consistency)\nto provide a holistic view of each model's output quality. Additionally, we\nmake our financial dataset publicly available, inviting researchers and\npractitioners to leverage, scrutinize, and enhance our findings through broader\ncommunity engagement and collaborative improvement. Our dataset is available on\nhuggingface.", "paper_summary_zh": "<paragraph>近年來，大型語言模型 (LLM) 在各種應用中展現了非凡的多樣性，包括自然語言理解、特定領域的知識任務等。然而，將 LLM 應用於金融等複雜且高風險的領域需要嚴格的評估，以確保可靠性、準確性和符合產業標準。為了滿足這個需求，我們對三種最先進的 LLM 進行了全面且比較性的研究，包括 GLM-4、Mistral-NeMo 和 LLaMA3.1，重點在於它們生成自動化財務報表的效能。我們的首要動機是探索如何將這些模型應用於金融領域，這是一個需要精準性、脈絡相關性和對錯誤或誤導資訊具有穩健性的領域。透過檢視每個模型的能力，我們旨在對它們的優缺點提供深入的評估。我們的論文提供了財務報表分析的基準，包含提議的指標，例如 ROUGE-1、BERT 分數和 LLM 分數。我們引入了一個創新的評估架構，它整合了量化指標（例如，精準度、召回率）和定性分析（例如，脈絡貼合度、一致性），以提供每個模型輸出品質的全貌。此外，我們公開了我們的財務資料集，邀請研究人員和實務工作者透過更廣泛的社群參與和協作改進，來利用、審查和增強我們的發現。我們的資料集可在 huggingface 上取得。</paragraph>", "author": "Xinqi Yang et.al.", "authors": "Xinqi Yang, Scott Zang, Yong Ren, Dingjie Peng, Zheng Wen", "id": "2411.06852v1", "paper_url": "http://arxiv.org/abs/2411.06852v1", "repo": "null"}}