{"2408.04820": {"publish_time": "2024-08-09", "title": "Natural Language Outlines for Code: Literate Programming in the LLM Era", "paper_summary": "We propose using natural language outlines as a novel modality and\ninteraction surface for providing AI assistance to developers throughout the\nsoftware development process. An NL outline for a code function comprises\nmultiple statements written in concise prose, which partition the code and\nsummarize its main ideas in the style of literate programming. Crucially, we\nfind that modern LLMs can generate accurate and high-quality NL outlines in\npractice. Moreover, NL outlines enable a bidirectional sync between code and\nNL, allowing changes in one to be automatically reflected in the other. We\ndiscuss many use cases for NL outlines: they can accelerate understanding and\nnavigation of code and diffs, simplify code maintenance, augment code search,\nsteer code generation, and more. We then propose and compare multiple LLM\nprompting techniques for generating outlines and ask professional developers to\njudge outline quality. Finally, we present two case studies applying NL\noutlines toward code review and the difficult task of malware detection.", "paper_summary_zh": "我們建議使用自然語言大綱作為一種新穎的方式和互動介面，在整個軟體開發過程中為開發人員提供 AI 協助。程式碼函式的 NL 大綱包含多個以簡潔散文撰寫的陳述，將程式碼分割並以程式設計文件風格總結其主要概念。至關重要的是，我們發現現代 LLM 在實務上可以產生準確且高品質的 NL 大綱。此外，NL 大綱可以在程式碼和 NL 之間實現雙向同步，讓其中一方的變更可以自動反映在另一方。我們討論了 NL 大綱的許多使用案例：它們可以加速理解和瀏覽程式碼和差異，簡化程式碼維護，擴充程式碼搜尋，引導程式碼產生，等等。然後，我們提出並比較多種 LLM 提示技術以產生大綱，並請專業開發人員判斷大綱品質。最後，我們提出兩個案例研究，將 NL 大綱應用於程式碼檢閱和惡意軟體偵測的困難任務。", "author": "Kensen Shi et.al.", "authors": "Kensen Shi, Deniz Altınbüken, Saswat Anand, Mihai Christodorescu, Katja Grünwedel, Alexa Koenings, Sai Naidu, Anurag Pathak, Marc Rasi, Fredde Ribeiro, Brandon Ruffin, Siddhant Sanyam, Maxim Tabachnyk, Sara Toth, Roy Tu, Tobias Welp, Pengcheng Yin, Manzil Zaheer, Satish Chandra, Charles Sutton", "id": "2408.04820v1", "paper_url": "http://arxiv.org/abs/2408.04820v1", "repo": "null"}}