{"2409.15957": {"publish_time": "2024-09-24", "title": "ASD-Diffusion: Anomalous Sound Detection with Diffusion Models", "paper_summary": "Unsupervised Anomalous Sound Detection (ASD) aims to design a generalizable\nmethod that can be used to detect anomalies when only normal sounds are given.\nIn this paper, Anomalous Sound Detection based on Diffusion Models\n(ASD-Diffusion) is proposed for ASD in real-world factories. In our pipeline,\nthe anomalies in acoustic features are reconstructed from their noisy corrupted\nfeatures into their approximate normal pattern. Secondly, a post-processing\nanomalies filter algorithm is proposed to detect anomalies that exhibit\nsignificant deviation from the original input after reconstruction.\nFurthermore, denoising diffusion implicit model is introduced to accelerate the\ninference speed by a longer sampling interval of the denoising process. The\nproposed method is innovative in the application of diffusion models as a new\nscheme. Experimental results on the development set of DCASE 2023 challenge\ntask 2 outperform the baseline by 7.75%, demonstrating the effectiveness of the\nproposed method.", "paper_summary_zh": "無監督異常音訊偵測 (ASD) 的目標是設計一個可概括的方法，可用於在只有正常音訊的情況下偵測異常。在本文中，提出了基於擴散模型的異常音訊偵測 (ASD-Diffusion) 來進行真實世界工廠中的 ASD。在我們的管道中，會將音訊特徵中的異常從其雜訊破壞特徵重建成其近似的正常模式。其次，提出了一個後處理異常過濾器演算法，用於偵測在重建後與原始輸入有顯著偏差的異常。此外，引入了去噪擴散隱式模型，以透過去噪過程更長的取樣間隔來加速推論速度。所提出的方法在將擴散模型應用為新方案方面具有創新性。在 DCASE 2023 挑戰任務 2 的開發集上的實驗結果比基準高出 7.75%，證明了所提出方法的有效性。", "author": "Fengrun Zhang et.al.", "authors": "Fengrun Zhang, Xiang Xie, Kai Guo", "id": "2409.15957v1", "paper_url": "http://arxiv.org/abs/2409.15957v1", "repo": "null"}}