{"2411.12986": {"publish_time": "2024-11-20", "title": "Training Bilingual LMs with Data Constraints in the Targeted Language", "paper_summary": "Large language models are trained on massive scrapes of the web, as required\nby current scaling laws. Most progress is made for English, given its abundance\nof high-quality pretraining data. For most other languages, however, such high\nquality pretraining data is unavailable. In this work, we study how to boost\npretrained model performance in a data constrained target language by enlisting\ndata from an auxiliary language for which high quality data is available. We\nstudy this by quantifying the performance gap between training with data in a\ndata-rich auxiliary language compared with training in the target language,\nexploring the benefits of translation systems, studying the limitations of\nmodel scaling for data constrained languages, and proposing new methods for\nupsampling data from the auxiliary language. Our results show that stronger\nauxiliary datasets result in performance gains without modification to the\nmodel or training objective for close languages, and, in particular, that\nperformance gains due to the development of more information-rich English\npretraining datasets can extend to targeted language settings with limited\ndata.", "paper_summary_zh": "大型語言模型根據當前規模定律的要求，在網路的大規模擷取上進行訓練。由於有大量高品質的預訓練資料，因此英語方面進展最大。然而，對於大多數其他語言而言，這類高品質的預訓練資料並不可用。在這項工作中，我們研究如何透過徵用資料品質良好的輔助語言資料，來提升資料受限目標語言的預訓練模型效能。我們透過量化使用資料豐富的輔助語言訓練與在目標語言中訓練的效能差距、探討翻譯系統的優點、研究資料受限語言的模型擴充限制，以及提出從輔助語言中對資料進行上採樣的全新方法來研究這一點。我們的結果顯示，對於相近語言，更強大的輔助資料集會帶來效能提升，且無需修改模型或訓練目標；特別是，由於開發出更多資訊豐富的英語預訓練資料集，效能提升可以延伸至資料有限的目標語言設定。", "author": "Skyler Seto et.al.", "authors": "Skyler Seto, Maartje ter Hoeve, He Bai, Natalie Schluter, David Grangier", "id": "2411.12986v1", "paper_url": "http://arxiv.org/abs/2411.12986v1", "repo": "null"}}