{"2405.17402": {"publish_time": "2024-05-27", "title": "THREAD: Thinking Deeper with Recursive Spawning", "paper_summary": "Large language models (LLMs) have shown impressive capabilities across\ndiverse settings, but still struggle as the length and complexity of the\ncontext increases. To address this challenge, we propose Thinking Recursively\nand Dynamically (ThReaD). THREAD frames model generation as a thread of\nexecution that, based on the context, can run to completion or dynamically\nspawn new threads. By spawning, threads can offload work (e.g., thinking,\nretrieving information) to child threads, which only return tokens needed for\nthe parent thread to do its work. In effect, this enables the model to adapt,\nas needed, the amount of intermediate work used to produce tokens. We apply\nTHREAD in the settings of LLM task solving and question answering, where the\ndynamic threading allows the model to recursively decompose the given task or\nquestion into progressively simpler sub-problems that can be solved by separate\nchild threads. We test THREAD, implemented using a few-shot learning approach,\non diverse benchmarks for agent tasks and data-grounded question answering.\nTHREAD achieves state-of-the-art performance with GPT-4 and GPT-3.5 on these\nbenchmarks, including ALFWorld, TextCraft, and WebShop, along with two new\nbenchmarks, DataCommons QA and MIMIC-III ICU QA. In addition, THREAD\noutperforms existing frameworks by 10% to 50% absolute points with smaller\nmodels, including Llama-3-8b and CodeLlama-7b.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種環境中展現令人印象深刻的能力，但隨著內容長度和複雜性的增加，它們仍會面臨挑戰。為了應對這項挑戰，我們提出思考遞迴和動態 (ThReaD) 的概念。THREAD 將模型生成設定為一個執行緒，根據內容，它可以執行到完成或動態產生新的執行緒。透過產生，執行緒可以將工作 (例如思考、擷取資訊) 轉移到子執行緒，子執行緒只會傳回父執行緒執行工作所需的符號。實際上，這讓模型能夠在需要時調整用於產生符號的中間工作量。我們在 LLM 任務解決和問題回答的設定中套用 THREAD，動態執行緒讓模型能夠遞迴分解給定的任務或問題，成為更簡單的子問題，這些子問題可以由個別的子執行緒解決。我們使用少量學習方法實作 THREAD，並在代理人任務和資料基礎問題回答的各種基準上進行測試。THREAD 在這些基準上使用 GPT-4 和 GPT-3.5 達到最先進的效能，包括 ALFWorld、TextCraft 和 WebShop，以及兩個新的基準，DataCommons QA 和 MIMIC-III ICU QA。此外，THREAD 以較小的模型超越現有架構 10% 到 50% 的絕對點數，包括 Llama-3-8b 和 CodeLlama-7b。", "author": "Philip Schroeder et.al.", "authors": "Philip Schroeder, Nathaniel Morgan, Hongyin Luo, James Glass", "id": "2405.17402v1", "paper_url": "http://arxiv.org/abs/2405.17402v1", "repo": "null"}}