{"2406.08996": {"publish_time": "2024-06-13", "title": "Introducing Brain-like Concepts to Embodied Hand-crafted Dialog Management System", "paper_summary": "Along with the development of chatbot, language models and speech\ntechnologies, there is a growing possibility and interest of creating systems\nable to interface with humans seamlessly through natural language or directly\nvia speech. In this paper, we want to demonstrate that placing the research on\ndialog system in the broader context of embodied intelligence allows to\nintroduce concepts taken from neurobiology and neuropsychology to define\nbehavior architecture that reconcile hand-crafted design and artificial neural\nnetwork and open the gate to future new learning approaches like imitation or\nlearning by instruction. To do so, this paper presents a neural behavior engine\nthat allows creation of mixed initiative dialog and action generation based on\nhand-crafted models using a graphical language. A demonstration of the\nusability of such brain-like inspired architecture together with a graphical\ndialog model is described through a virtual receptionist application running on\na semi-public space.", "paper_summary_zh": "隨著聊天機器人的發展、語言模型和語音技術，創造出能夠透過自然語言或直接透過語音與人類無縫互動的系統，其可能性和興趣與日俱增。在本文中，我們想要證明將對話系統的研究置於具體智能的廣泛背景下，可以引入從神經生物學和神經心理學中擷取的概念來定義行為架構，調和手工設計和人工神經網路，並為未來的學習新方法（例如模仿或透過指示學習）開啟大門。為此，本文提出了一款神經行為引擎，它允許使用圖形語言建立混合主動式對話和基於手工模型的動作產生。透過一個在半公共空間中執行的虛擬接待員應用程式，描述了這種類腦啟發架構與圖形對話模型一起使用的可用性示範。", "author": "Frank Joublin et.al.", "authors": "Frank Joublin, Antonello Ceravola, Cristian Sandu", "id": "2406.08996v1", "paper_url": "http://arxiv.org/abs/2406.08996v1", "repo": "null"}}