{"2411.04034": {"publish_time": "2024-11-06", "title": "Non-Stationary Learning of Neural Networks with Automatic Soft Parameter Reset", "paper_summary": "Neural networks are traditionally trained under the assumption that data come\nfrom a stationary distribution. However, settings which violate this assumption\nare becoming more popular; examples include supervised learning under\ndistributional shifts, reinforcement learning, continual learning and\nnon-stationary contextual bandits. In this work we introduce a novel learning\napproach that automatically models and adapts to non-stationarity, via an\nOrnstein-Uhlenbeck process with an adaptive drift parameter. The adaptive drift\ntends to draw the parameters towards the initialisation distribution, so the\napproach can be understood as a form of soft parameter reset. We show\nempirically that our approach performs well in non-stationary supervised and\noff-policy reinforcement learning settings.", "paper_summary_zh": "神經網路傳統上是在假設資料來自固定分佈的條件下訓練的。然而，違反此假設的設定正變得越來越普遍；範例包括分佈轉移下的監督式學習、強化學習、持續學習和非固定情境強盜。在這項工作中，我們介紹了一種新穎的學習方法，它透過具有適應性漂移參數的 Ornstein-Uhlenbeck 過程，自動對非固定性進行建模和適應。適應性漂移傾向於將參數拉向初始化分佈，因此可以將此方法理解為一種軟參數重設形式。我們透過實證顯示，我們的做法在非固定監督式和非策略強化學習設定中表現良好。", "author": "Alexandre Galashov et.al.", "authors": "Alexandre Galashov, Michalis K. Titsias, András György, Clare Lyle, Razvan Pascanu, Yee Whye Teh, Maneesh Sahani", "id": "2411.04034v1", "paper_url": "http://arxiv.org/abs/2411.04034v1", "repo": "null"}}