{"2501.11270": {"publish_time": "2025-01-20", "title": "Spatiotemporal Air Quality Mapping in Urban Areas Using Sparse Sensor Data, Satellite Imagery, Meteorological Factors, and Spatial Features", "paper_summary": "Monitoring air pollution is crucial for protecting human health from exposure\nto harmful substances. Traditional methods of air quality monitoring, such as\nground-based sensors and satellite-based remote sensing, face limitations due\nto high deployment costs, sparse sensor coverage, and environmental\ninterferences. To address these challenges, this paper proposes a framework for\nhigh-resolution spatiotemporal Air Quality Index (AQI) mapping using sparse\nsensor data, satellite imagery, and various spatiotemporal factors. By\nleveraging Graph Neural Networks (GNNs), we estimate AQI values at unmonitored\nlocations based on both spatial and temporal dependencies. The framework\nincorporates a wide range of environmental features, including meteorological\ndata, road networks, points of interest (PoIs), population density, and urban\ngreen spaces, which enhance prediction accuracy. We illustrate the use of our\napproach through a case study in Lahore, Pakistan, where multi-resolution data\nis used to generate the air quality index map at a fine spatiotemporal scale.", "paper_summary_zh": "監控空氣污染對於保護人類健康免於接觸有害物質至關重要。傳統的空氣品質監測方法，例如地面感測器和衛星遙測，由於部署成本高、感測器覆蓋範圍稀疏以及環境干擾而面臨限制。為了應對這些挑戰，本文提出了一個使用稀疏感測器資料、衛星影像和各種時空因子來繪製高解析度時空空氣品質指數 (AQI) 的架構。透過利用圖形神經網路 (GNN)，我們根據空間和時間依賴性來估計未監控地點的 AQI 值。該架構結合了廣泛的環境特徵，包括氣象資料、道路網路、興趣點 (PoI)、人口密度和城市綠地，這些特徵增強了預測準確度。我們透過巴基斯坦拉合爾的一個案例研究來說明我們方法的使用，其中使用多解析度資料來生成精細時空尺度的空氣品質指數地圖。", "author": "Osama Ahmad et.al.", "authors": "Osama Ahmad, Zubair Khalid, Muhammad Tahir, Momin Uppal", "id": "2501.11270v1", "paper_url": "http://arxiv.org/abs/2501.11270v1", "repo": "null"}}