{"2412.10138": {"publish_time": "2024-12-13", "title": "ROUTE: Robust Multitask Tuning and Collaboration for Text-to-SQL", "paper_summary": "Despite the significant advancements in Text-to-SQL (Text2SQL) facilitated by\nlarge language models (LLMs), the latest state-of-the-art techniques are still\ntrapped in the in-context learning of closed-source LLMs (e.g., GPT-4), which\nlimits their applicability in open scenarios. To address this challenge, we\npropose a novel RObust mUltitask Tuning and collaboration mEthod (ROUTE) to\nimprove the comprehensive capabilities of open-source LLMs for Text2SQL,\nthereby providing a more practical solution. Our approach begins with\nmulti-task supervised fine-tuning (SFT) using various synthetic training data\nrelated to SQL generation. Unlike existing SFT-based Text2SQL methods, we\nintroduced several additional SFT tasks, including schema linking, noise\ncorrection, and continuation writing. Engaging in a variety of SQL generation\ntasks enhances the model's understanding of SQL syntax and improves its ability\nto generate high-quality SQL queries. Additionally, inspired by the\ncollaborative modes of LLM agents, we introduce a Multitask Collaboration\nPrompting (MCP) strategy. This strategy leverages collaboration across several\nSQL-related tasks to reduce hallucinations during SQL generation, thereby\nmaximizing the potential of enhancing Text2SQL performance through explicit\nmultitask capabilities. Extensive experiments and in-depth analyses have been\nperformed on eight open-source LLMs and five widely-used benchmarks. The\nresults demonstrate that our proposal outperforms the latest Text2SQL methods\nand yields leading performance.", "paper_summary_zh": "儘管大型語言模型 (LLM) 促進了文字轉 SQL (Text2SQL) 的重大進展，但最新的最先進技術仍受限於封閉原始碼 LLM (例如 GPT-4) 的情境學習中，這限制了它們在開放場景中的適用性。為了應對這一挑戰，我們提出了一種新穎的強健多任務調整和協作方法 (ROUTE)，以提高開放原始碼 LLM 對 Text2SQL 的綜合能力，從而提供更實用的解決方案。我們的做法從使用與 SQL 生成相關的各種合成訓練資料的多任務監督微調 (SFT) 開始。與現有的基於 SFT 的 Text2SQL 方法不同，我們引入了幾個額外的 SFT 任務，包括模式連結、雜訊校正和延續寫作。參與各種 SQL 生成任務增強了模型對 SQL 語法的理解，並提高了它生成高品質 SQL 查詢的能力。此外，在 LLM 代理的協作模式的啟發下，我們引入了多任務協作提示 (MCP) 策略。此策略利用跨多個與 SQL 相關任務的協作來減少 SQL 生成過程中的幻覺，從而通過明確的多任務能力最大限度地發揮增強 Text2SQL 效能的潛力。已經對八個開放原始碼 LLM 和五個廣泛使用的基準進行了廣泛的實驗和深入的分析。結果表明，我們的提案優於最新的 Text2SQL 方法，並產生了領先的效能。", "author": "Yang Qin et.al.", "authors": "Yang Qin, Chao Chen, Zhihang Fu, Ze Chen, Dezhong Peng, Peng Hu, Jieping Ye", "id": "2412.10138v1", "paper_url": "http://arxiv.org/abs/2412.10138v1", "repo": "https://github.com/alibaba/route"}}