{"2411.12921": {"publish_time": "2024-11-19", "title": "A Comparative Study of Text Retrieval Models on DaReCzech", "paper_summary": "This article presents a comprehensive evaluation of 7 off-the-shelf document\nretrieval models: Splade, Plaid, Plaid-X, SimCSE, Contriever, OpenAI ADA and\nGemma2 chosen to determine their performance on the Czech retrieval dataset\nDaReCzech. The primary objective of our experiments is to estimate the quality\nof modern retrieval approaches in the Czech language. Our analyses include\nretrieval quality, speed, and memory footprint. Secondly, we analyze whether it\nis better to use the model directly in Czech text, or to use machine\ntranslation into English, followed by retrieval in English. Our experiments\nidentify the most effective option for Czech information retrieval. The\nfindings revealed notable performance differences among the models, with\nGemma22 achieving the highest precision and recall, while Contriever performing\npoorly. Conclusively, SPLADE and PLAID models offered a balance of efficiency\nand performance.", "paper_summary_zh": "本文全面評估了 7 種現成的文件檢索模型：Splade、Plaid、Plaid-X、SimCSE、Contriever、OpenAI ADA 和 Gemma2，以確定它們在捷克檢索資料集 DaReCzech 上的效能。我們實驗的主要目標是評估捷克語中現代檢索方法的品質。我們的分析包括檢索品質、速度和記憶體使用量。其次，我們分析是直接在捷克語文中使用模型，還是先將其機器翻譯成英語，然後再用英語檢索會比較好。我們的實驗找出了捷克資訊檢索最有效的方法。結果顯示，各個模型之間的效能差異顯著，其中 Gemma22 達到了最高的精確度和召回率，而 Contriever 的表現則不佳。總之，SPADE 和 PLAID 模型在效率和效能之間取得了平衡。", "author": "Jakub Stetina et.al.", "authors": "Jakub Stetina, Martin Fajcik, Michal Stefanik, Michal Hradis", "id": "2411.12921v1", "paper_url": "http://arxiv.org/abs/2411.12921v1", "repo": "null"}}