{"2410.23603": {"publish_time": "2024-10-31", "title": "Using Multimodal Deep Neural Networks to Disentangle Language from Visual Aesthetics", "paper_summary": "When we experience a visual stimulus as beautiful, how much of that\nexperience derives from perceptual computations we cannot describe versus\nconceptual knowledge we can readily translate into natural language?\nDisentangling perception from language in visually-evoked affective and\naesthetic experiences through behavioral paradigms or neuroimaging is often\nempirically intractable. Here, we circumnavigate this challenge by using linear\ndecoding over the learned representations of unimodal vision, unimodal\nlanguage, and multimodal (language-aligned) deep neural network (DNN) models to\npredict human beauty ratings of naturalistic images. We show that unimodal\nvision models (e.g. SimCLR) account for the vast majority of explainable\nvariance in these ratings. Language-aligned vision models (e.g. SLIP) yield\nsmall gains relative to unimodal vision. Unimodal language models (e.g. GPT2)\nconditioned on visual embeddings to generate captions (via CLIPCap) yield no\nfurther gains. Caption embeddings alone yield less accurate predictions than\nimage and caption embeddings combined (concatenated). Taken together, these\nresults suggest that whatever words we may eventually find to describe our\nexperience of beauty, the ineffable computations of feedforward perception may\nprovide sufficient foundation for that experience.", "paper_summary_zh": "當我們體驗到視覺刺激時，其中有多少是源自於我們無法描述的知覺計算，相較於我們可以輕易翻譯成自然語言的概念知識？透過行為範例或神經影像學，要將視覺誘發的情感和美學體驗中的知覺與語言區分開來，通常在經驗上難以捉摸。在此，我們透過對單模態視覺、單模態語言和多模態（語言對齊）深度神經網路（DNN）模型的學習表徵進行線性解碼，來預測人類對自然影像的美感評分，從而規避了這個挑戰。我們表明，單模態視覺模型（例如 SimCLR）解釋了這些評分中絕大部分的可解釋變異。與單模態視覺相比，語言對齊的視覺模型（例如 SLIP）產生了較小的增益。以視覺嵌入為條件產生字幕的單模態語言模型（例如 GPT2）（透過 CLIPCap）沒有產生進一步的增益。單獨的字幕嵌入產生的預測準確度低於影像和字幕嵌入的組合（串接）。綜合起來，這些結果表明，無論我們最終找到什麼詞來描述我們的審美體驗，前饋感知的難以言喻的計算可能為這種體驗提供了充分的基礎。", "author": "Colin Conwell et.al.", "authors": "Colin Conwell, Christopher Hamblin, Chelsea Boccagno, David Mayo, Jesse Cummings, Leyla Isik, Andrei Barbu", "id": "2410.23603v1", "paper_url": "http://arxiv.org/abs/2410.23603v1", "repo": "null"}}