{"2405.05616": {"publish_time": "2024-05-09", "title": "G-SAP: Graph-based Structure-Aware Prompt Learning over Heterogeneous Knowledge for Commonsense Reasoning", "paper_summary": "Commonsense question answering has demonstrated considerable potential across\nvarious applications like assistants and social robots. Although fully\nfine-tuned pre-trained Language Models(LM) have achieved remarkable performance\nin commonsense reasoning, their tendency to excessively prioritize textual\ninformation hampers the precise transfer of structural knowledge and undermines\ninterpretability. Some studies have explored combining LMs with Knowledge\nGraphs(KGs) by coarsely fusing the two modalities to perform Graph Neural\nNetwork(GNN)-based reasoning that lacks a profound interaction between\nheterogeneous modalities. In this paper, we propose a novel Graph-based\nStructure-Aware Prompt Learning Model for commonsense reasoning, named G-SAP,\naiming to maintain a balance between heterogeneous knowledge and enhance the\ncross-modal interaction within the LM+GNNs model. In particular, an evidence\ngraph is constructed by integrating multiple knowledge sources, i.e.\nConceptNet, Wikipedia, and Cambridge Dictionary to boost the performance.\nAfterward, a structure-aware frozen PLM is employed to fully incorporate the\nstructured and textual information from the evidence graph, where the\ngeneration of prompts is driven by graph entities and relations. Finally, a\nheterogeneous message-passing reasoning module is used to facilitate deep\ninteraction of knowledge between the LM and graph-based networks. Empirical\nvalidation, conducted through extensive experiments on three benchmark\ndatasets, demonstrates the notable performance of the proposed model. The\nresults reveal a significant advancement over the existing models, especially,\nwith 6.12% improvement over the SoTA LM+GNNs model on the OpenbookQA dataset.", "paper_summary_zh": "常識問答在各種應用程式中展現了相當大的潛力，例如助理和社交機器人。儘管經過微調的預訓練語言模型 (LM) 在常識推理中取得了顯著的表現，但它們過度優先考慮文本資訊的傾向會阻礙結構知識的精確傳輸，並損害可解釋性。一些研究探索了將 LM 與知識圖譜 (KG) 結合起來，通過粗略地融合這兩種模式來執行基於圖神經網路 (GNN) 的推理，而這種推理缺乏異質模式之間的深入互動。在本文中，我們提出了一個新的基於圖的結構感知提示學習模型，用於常識推理，稱為 G-SAP，旨在維持異質知識之間的平衡，並增強 LM+GNN 模型內的跨模式互動。特別是，通過整合多個知識來源（即 ConceptNet、Wikipedia 和劍橋詞典）來構建一個證據圖，以提升效能。隨後，採用結構感知凍結 PLM 來充分整合來自證據圖的結構化和文本資訊，其中提示的產生是由圖實體和關係驅動的。最後，使用異質訊息傳遞推理模組來促進 LM 和基於圖的網路之間的深度互動。透過在三個基準資料集上進行廣泛的實驗進行的經驗驗證，證明了所提出的模型的顯著效能。結果顯示出比現有模型有顯著的進步，特別是在 OpenbookQA 資料集上比 SoTA LM+GNN 模型提升了 6.12%。", "author": "Ruiting Dai et.al.", "authors": "Ruiting Dai, Yuqiao Tan, Lisi Mo, Shuang Liang, Guohao Huo, Jiayi Luo, Yao Cheng", "id": "2405.05616v1", "paper_url": "http://arxiv.org/abs/2405.05616v1", "repo": "null"}}