{"2411.02657": {"publish_time": "2024-11-04", "title": "Zebra-Llama: A Context-Aware Large Language Model for Democratizing Rare Disease Knowledge", "paper_summary": "Rare diseases present unique challenges in healthcare, often suffering from\ndelayed diagnosis and fragmented information landscapes. The scarcity of\nreliable knowledge in these conditions poses a distinct challenge for Large\nLanguage Models (LLMs) in supporting clinical management and delivering precise\npatient information underscoring the need for focused training on these 'zebra'\ncases. We present Zebra-Llama, a specialized context-aware language model with\nhigh precision Retrieval Augmented Generation (RAG) capability, focusing on\nEhlers-Danlos Syndrome (EDS) as our case study. EDS, affecting 1 in 5,000\nindividuals, exemplifies the complexities of rare diseases with its diverse\nsymptoms, multiple subtypes, and evolving diagnostic criteria. By implementing\na novel context-aware fine-tuning methodology trained on questions derived from\nmedical literature, patient experiences, and clinical resources, along with\nexpertly curated responses, Zebra-Llama demonstrates unprecedented capabilities\nin handling EDS-related queries. On a test set of real-world questions\ncollected from EDS patients and clinicians, medical experts evaluated the\nresponses generated by both models, revealing Zebra-Llama's substantial\nimprovements over base model (Llama 3.1-8B-Instruct) in thoroughness (77.5% vs.\n70.1%), accuracy (83.0% vs. 78.8%), clarity (74.7% vs. 72.0%) and citation\nreliability (70.6% vs. 52.3%). Released as an open-source resource, Zebra-Llama\nnot only provides more accessible and reliable EDS information but also\nestablishes a framework for developing specialized AI solutions for other rare\nconditions. This work represents a crucial step towards democratizing\nexpert-level knowledge in rare disease management, potentially transforming how\nhealthcare providers and patients navigate the complex landscape of rare\ndiseases.", "paper_summary_zh": "<paragraph>罕見疾病對醫療保健提出了獨特的挑戰，通常會延誤診斷並造成資訊分散的問題。這些疾病缺乏可靠的知識，對大型語言模型 (LLM) 在支持臨床管理和提供精確的患者資訊方面構成了獨特的挑戰，這凸顯了針對這些「斑馬」病例進行重點訓練的必要性。我們提出 Zebra-Llama，這是一個專門的脈絡感知語言模型，具有高精確度的檢索擴充生成 (RAG) 能力，並以 Ehlers-Danlos 症候群 (EDS) 作為我們的案例研究。EDS 影響每 5,000 人中的 1 人，其症狀多樣、亞型眾多且診斷標準不斷演變，體現了罕見疾病的複雜性。透過實施一種新穎的脈絡感知微調方法，該方法在從醫學文獻、患者經驗和臨床資源中衍生的問題上進行訓練，並結合專家策劃的回應，Zebra-Llama 在處理與 EDS 相關的查詢方面展現了前所未有的能力。在從 EDS 患者和臨床醫生收集的真實問題測試集中，醫學專家評估了這兩種模型產生的回應，結果顯示 Zebra-Llama 在徹底性 (77.5% 對 70.1%)、準確性 (83.0% 對 78.8%)、清晰度 (74.7% 對 72.0%) 和引用可靠性 (70.6% 對 52.3%) 方面都比基礎模型 (Llama 3.1-8B-Instruct) 有顯著的進步。Zebra-Llama 以開放原始碼資源的形式釋出，不僅提供了更易於取得且可靠的 EDS 資訊，還建立了一個開發其他罕見疾病專用 AI 解決方案的架構。這項工作代表了在罕見疾病管理中實現專家級知識民主化的關鍵一步，有可能改變醫療保健提供者和患者在罕見疾病複雜領域中的應對方式。</paragraph>", "author": "Karthik Soman et.al.", "authors": "Karthik Soman, Andrew Langdon, Catalina Villouta, Chinmay Agrawal, Lashaw Salta, Braian Peetoom, Gianmarco Bellucci, Orion J Buske", "id": "2411.02657v1", "paper_url": "http://arxiv.org/abs/2411.02657v1", "repo": "https://github.com/karthiksoman/zebra-Llama"}}