{"2407.09191": {"publish_time": "2024-07-12", "title": "From Easy to Hard: Learning Curricular Shape-aware Features for Robust Panoptic Scene Graph Generation", "paper_summary": "Panoptic Scene Graph Generation (PSG) aims to generate a comprehensive\ngraph-structure representation based on panoptic segmentation masks. Despite\nremarkable progress in PSG, almost all existing methods neglect the importance\nof shape-aware features, which inherently focus on the contours and boundaries\nof objects. To bridge this gap, we propose a model-agnostic Curricular\nshApe-aware FEature (CAFE) learning strategy for PSG. Specifically, we\nincorporate shape-aware features (i.e., mask features and boundary features)\ninto PSG, moving beyond reliance solely on bbox features. Furthermore, drawing\ninspiration from human cognition, we propose to integrate shape-aware features\nin an easy-to-hard manner. To achieve this, we categorize the predicates into\nthree groups based on cognition learning difficulty and correspondingly divide\nthe training process into three stages. Each stage utilizes a specialized\nrelation classifier to distinguish specific groups of predicates. As the\nlearning difficulty of predicates increases, these classifiers are equipped\nwith features of ascending complexity. We also incorporate knowledge\ndistillation to retain knowledge acquired in earlier stages. Due to its\nmodel-agnostic nature, CAFE can be seamlessly incorporated into any PSG model.\nExtensive experiments and ablations on two PSG tasks under both robust and\nzero-shot PSG have attested to the superiority and robustness of our proposed\nCAFE, which outperforms existing state-of-the-art methods by a large margin.", "paper_summary_zh": "全景場景圖生成 (PSG) 旨在根據全景分割遮罩生成一個全面的圖形結構表示。儘管 PSG 取得了顯著進展，但幾乎所有現有方法都忽略了形狀感知特徵的重要性，而形狀感知特徵本質上專注於物體的輪廓和邊界。為了彌合這一差距，我們提出了一個模型不可知的課程形狀感知特徵 (CAFE) 學習策略，用於 PSG。具體來說，我們將形狀感知特徵（即遮罩特徵和邊界特徵）納入 PSG，不再僅依賴於邊界框特徵。此外，借鑒人類認知，我們建議以易到難的方式整合形狀感知特徵。為此，我們根據認知學習難度將謂詞分為三組，並相應地將訓練過程分為三個階段。每個階段都使用一個專門的關係分類器來區分特定組的謂詞。隨著謂詞學習難度的增加，這些分類器配備了複雜性遞增的特徵。我們還結合知識蒸餾來保留在早期階段獲取的知識。由於其模型不可知特性，CAFE 可以無縫地整合到任何 PSG 模型中。在穩健和零次 PSG 下的兩個 PSG 任務上進行的廣泛實驗和消融研究證明了我們提出的 CAFE 的優越性和穩健性，它以很大幅度優於現有的最先進方法。", "author": "Hanrong Shi et.al.", "authors": "Hanrong Shi, Lin Li, Jun Xiao, Yueting Zhuang, Long Chen", "id": "2407.09191v1", "paper_url": "http://arxiv.org/abs/2407.09191v1", "repo": "null"}}