{"2412.16118": {"publish_time": "2024-12-20", "title": "Convolutional Deep Operator Networks for Learning Nonlinear Focused Ultrasound Wave Propagation in Heterogeneous Spinal Cord Anatomy", "paper_summary": "Focused ultrasound (FUS) therapy is a promising tool for optimally targeted\ntreatment of spinal cord injuries (SCI), offering submillimeter precision to\nenhance blood flow at injury sites while minimizing impact on surrounding\ntissues. However, its efficacy is highly sensitive to the placement of the\nultrasound source, as the spinal cord's complex geometry and acoustic\nheterogeneity distort and attenuate the FUS signal. Current approaches rely on\ncomputer simulations to solve the governing wave propagation equations and\ncompute patient-specific pressure maps using ultrasound images of the spinal\ncord anatomy. While accurate, these high-fidelity simulations are\ncomputationally intensive, taking up to hours to complete parameter sweeps,\nwhich is impractical for real-time surgical decision-making. To address this\nbottleneck, we propose a convolutional deep operator network (DeepONet) to\nrapidly predict FUS pressure fields in patient spinal cords. Unlike\nconventional neural networks, DeepONets are well equipped to approximate the\nsolution operator of the parametric partial differential equations (PDEs) that\ngovern the behavior of FUS waves with varying initial and boundary conditions\n(i.e., new transducer locations or spinal cord geometries) without requiring\nextensive simulations. Trained on simulated pressure maps across diverse\npatient anatomies, this surrogate model achieves real-time predictions with\nonly a 2% loss on the test set, significantly accelerating the modeling of\nnonlinear physical systems in heterogeneous domains. By facilitating rapid\nparameter sweeps in surgical settings, this work provides a crucial step toward\nprecise and individualized solutions in neurosurgical treatments.", "paper_summary_zh": "聚焦超音波 (FUS) 治療是一種有望用於脊髓損傷 (SCI) 的最佳目標治療，它提供亞毫米精準度，可在損傷部位增強血流，同時將對周圍組織的影響降至最低。然而，其效能對超音波來源的放置高度敏感，因為脊髓的複雜幾何形狀和聲學異質性會扭曲和衰減 FUS 訊號。目前的做法依賴電腦模擬來解決控制波傳播方程式，並使用脊髓解剖結構的超音波影像計算特定於患者的壓力圖。儘管準確，但這些高保真模擬在運算上很密集，需要花費數小時才能完成參數掃描，這對於即時手術決策而言並不切實際。為了解決這個瓶頸，我們提出一個卷積深度算子網路 (DeepONet)，以便快速預測患者脊髓中的 FUS 壓力場。與傳統的神經網路不同，DeepONet 具備良好的設備，可近似控制參數偏微分方程式 (PDE) 的解算算子，這些方程式控制 FUS 波在不同的初始和邊界條件下的行為（即新的換能器位置或脊髓幾何形狀），而不需要廣泛的模擬。在模擬壓力圖上訓練各種患者解剖結構，此代理模型可實現即時預測，測試組的損失僅為 2%，大幅加速異質領域中非線性物理系統的建模。透過促進手術設定中的快速參數掃描，這項工作為神經外科治療中的精確且個別化的解決方案提供了關鍵的一步。", "author": "Avisha Kumar et.al.", "authors": "Avisha Kumar, Xuzhe Zhi, Zan Ahmad, Minglang Yin, Amir Manbachi", "id": "2412.16118v1", "paper_url": "http://arxiv.org/abs/2412.16118v1", "repo": "https://github.com/avishakumar21/nonlinear-fus-with-neural-operators"}}