{"2405.17258": {"publish_time": "2024-05-27", "title": "$\\textit{Trans-LoRA}$: towards data-free Transferable Parameter Efficient Finetuning", "paper_summary": "Low-rank adapters (LoRA) and their variants are popular parameter-efficient\nfine-tuning (PEFT) techniques that closely match full model fine-tune\nperformance while requiring only a small number of additional parameters. These\nadditional LoRA parameters are specific to the base model being adapted. When\nthe base model needs to be deprecated and replaced with a new one, all the\nassociated LoRA modules need to be re-trained. Such re-training requires access\nto the data used to train the LoRA for the original base model. This is\nespecially problematic for commercial cloud applications where the LoRA modules\nand the base models are hosted by service providers who may not be allowed to\nhost proprietary client task data. To address this challenge, we propose\n$\\textit{Trans-LoRA}$ -- a novel method for lossless, nearly data-free transfer\nof LoRAs across base models. Our approach relies on synthetic data to transfer\nLoRA modules. Using large language models, we design a synthetic data generator\nto approximate the data-generating process of the $\\textit{observed}$ task data\nsubset. Training on the resulting synthetic dataset transfers LoRA modules to\nnew models. We show the effectiveness of our approach using both LLama and\nGemma model families. Our approach achieves lossless (mostly improved) LoRA\ntransfer between models within and across different base model families, and\neven between different PEFT methods, on a wide variety of tasks.", "paper_summary_zh": "低秩適配器 (LoRA) 及其變體是熱門的參數有效微調 (PEFT) 技術，在僅需要少數額外參數的情況下，可緊密匹配完整模型微調效能。這些額外的 LoRA 參數專屬於要適用的基礎模型。當基礎模型需要棄用並替換為新的模型時，所有關聯的 LoRA 模組都需要重新訓練。此類重新訓練需要存取用於訓練原始基礎模型的 LoRA 的資料。這對於商業雲端應用程式來說特別有問題，因為 LoRA 模組和基礎模型是由服務供應商所主機，而服務供應商可能無法主機專有的客戶任務資料。為了應對此挑戰，我們提出 $\\textit{Trans-LoRA}$，這是一種創新的方法，可無損失且幾乎不使用資料來跨基礎模型傳輸 LoRA。我們的做法依賴於合成資料來傳輸 LoRA 模組。我們使用大型語言模型，設計一個合成資料產生器來近似 $\\textit{觀察到的}$ 任務資料子集的資料產生過程。在產生的合成資料集上進行訓練，將 LoRA 模組傳輸到新的模型。我們使用 LLama 和 Gemma 模型系列展示了我們做法的有效性。我們的做法在各種任務上，在不同基礎模型系列內部和之間，甚至在不同的 PEFT 方法之間，實現了無損失（大多數情況下都有改善）的 LoRA 傳輸。", "author": "Runqian Wang et.al.", "authors": "Runqian Wang, Soumya Ghosh, David Cox, Diego Antognini, Aude Oliva, Rogerio Feris, Leonid Karlinsky", "id": "2405.17258v1", "paper_url": "http://arxiv.org/abs/2405.17258v1", "repo": "null"}}