{"2408.07084": {"publish_time": "2024-08-08", "title": "Dynamic Hypergraph-Enhanced Prediction of Sequential Medical Visits", "paper_summary": "This study introduces a pioneering Dynamic Hypergraph Networks (DHCE) model\ndesigned to predict future medical diagnoses from electronic health records\nwith enhanced accuracy. The DHCE model innovates by identifying and\ndifferentiating acute and chronic diseases within a patient's visit history,\nconstructing dynamic hypergraphs that capture the complex, high-order\ninteractions between diseases. It surpasses traditional recurrent neural\nnetworks and graph neural networks by effectively integrating clinical event\ndata, reflected through medical language model-assisted encoding, into a robust\npatient representation. Through extensive experiments on two benchmark\ndatasets, MIMIC-III and MIMIC-IV, the DHCE model exhibits superior performance,\nsignificantly outpacing established baseline models in the precision of\nsequential diagnosis prediction.", "paper_summary_zh": "本研究介紹了一種創新的動態超圖網路 (DHCE) 模型，旨在從電子病歷中預測未來的醫療診斷，並提高準確度。DHCE 模型透過識別和區分患者就診記錄中的急性病和慢性病，建構動態超圖來捕捉疾病之間複雜的高階互動，進而進行創新。它超越了傳統的遞迴神經網路和圖神經網路，有效地將臨床事件資料整合到強健的患者表徵中，並透過醫療語言模型輔助編碼來反映。透過在兩個基準資料集 MIMIC-III 和 MIMIC-IV 上進行廣泛的實驗，DHCE 模型展現出優異的效能，在序貫診斷預測的精準度上顯著地超越既定的基準模型。", "author": "Wangying Yang et.al.", "authors": "Wangying Yang, Zhizhong Wu, Zitao Zheng, Bo Zhang, Shi Bo, Yuanfang Yang", "id": "2408.07084v1", "paper_url": "http://arxiv.org/abs/2408.07084v1", "repo": "null"}}