{"2406.10133": {"publish_time": "2024-06-14", "title": "Evaluation of Large Language Models: STEM education and Gender Stereotypes", "paper_summary": "Large Language Models (LLMs) have an increasing impact on our lives with use\ncases such as chatbots, study support, coding support, ideation, writing\nassistance, and more. Previous studies have revealed linguistic biases in\npronouns used to describe professions or adjectives used to describe men vs\nwomen. These issues have to some degree been addressed in updated LLM versions,\nat least to pass existing tests. However, biases may still be present in the\nmodels, and repeated use of gender stereotypical language may reinforce the\nunderlying assumptions and are therefore important to examine further. This\npaper investigates gender biases in LLMs in relation to educational choices\nthrough an open-ended, true to user-case experimental design and a quantitative\nanalysis. We investigate the biases in the context of four different cultures,\nlanguages, and educational systems (English/US/UK, Danish/DK, Catalan/ES, and\nHindi/IN) for ages ranging from 10 to 16 years, corresponding to important\neducational transition points in the different countries. We find that there\nare significant and large differences in the ratio of STEM to non-STEM\nsuggested education paths provided by chatGPT when using typical girl vs boy\nnames to prompt lists of suggested things to become. There are generally fewer\nSTEM suggestions in the Danish, Spanish, and Indian context compared to the\nEnglish. We also find subtle differences in the suggested professions, which we\ncategorise and report.", "paper_summary_zh": "大型語言模型 (LLM) 對我們的生活影響越來越大，其應用案例包括聊天機器人、學習支援、編碼支援、構思、寫作協助等。先前的研究揭露了用於描述職業的代名詞或用於描述男性與女性的形容詞中存在的語言偏見。這些問題在更新的 LLM 版本中已獲得一定程度的解決，至少可以通過現有的測試。然而，模型中可能仍然存在偏見，並且重複使用性別刻板語言可能會強化基本假設，因此有必要進一步檢視。本文透過開放式、真實的使用者案例實驗設計和量化分析，探討 LLM 在與教育選擇相關的性別偏見。我們在四種不同的文化、語言和教育系統（英語/美國/英國、丹麥語/丹麥、加泰羅尼亞語/西班牙和印地語/印度）中調查偏見，年齡範圍從 10 到 16 歲，這對不同國家的重要教育轉捩點來說相當重要。我們發現，當使用典型的女孩名字與男孩名字來提示建議事項清單時，chatGPT 所提供的 STEM 與非 STEM 建議教育路徑的比率存在顯著且巨大的差異。與英語相比，丹麥語、西班牙語和印度語脈絡中通常有較少的 STEM 建議。我們還發現建議職業中存在細微的差異，我們對這些差異進行了分類和報告。", "author": "Smilla Due et.al.", "authors": "Smilla Due, Sneha Das, Marianne Andersen, Berta Plandolit López, Sniff Andersen Nexø, Line Clemmensen", "id": "2406.10133v1", "paper_url": "http://arxiv.org/abs/2406.10133v1", "repo": "null"}}