{"2501.13014": {"publish_time": "2025-01-22", "title": "Paper Quality Assessment based on Individual Wisdom Metrics from Open Peer Review", "paper_summary": "This study proposes a data-driven framework for enhancing the accuracy and\nefficiency of scientific peer review through an open, bottom-up process that\nestimates reviewer quality. Traditional closed peer review systems, while\nessential for quality control, are often slow, costly, and subject to biases\nthat can impede scientific progress. Here, we introduce a method that evaluates\nindividual reviewer reliability by quantifying agreement with community\nconsensus scores and applying Bayesian weighting to refine paper quality\nassessments. We analyze open peer review data from two major scientific\nconferences, and demonstrate that reviewer-specific quality scores\nsignificantly improve the reliability of paper quality estimation. Perhaps\nsurprisingly, we find that reviewer quality scores are unrelated to authorship\nquality. Our model incorporates incentive structures to recognize high-quality\nreviewers and encourage broader coverage of submitted papers, thereby\nmitigating the common \"rich-get-richer\" pitfall of social media. These findings\nsuggest that open peer review, with mechanisms for estimating and incentivizing\nreviewer quality, offers a scalable and equitable alternative for scientific\npublishing, with potential to enhance the speed, fairness, and transparency of\nthe peer review process.", "paper_summary_zh": "本研究提出了一個資料驅動的架構，透過一個開放的由下而上的流程來提升科學同行評審的準確度和效率，此流程會評估審稿人的品質。傳統的封閉式同行評審系統對於品質控管來說固然重要，但通常很緩慢、成本高，且容易有偏見，可能會阻礙科學進展。在此，我們介紹一個方法，透過量化與社群共識分數的一致性，並套用貝氏加權來改善論文品質評量，以評估個別審稿人的可靠性。我們分析了兩場大型科學會議的開放式同行評審資料，並證明特定審稿人的品質分數大幅提升了論文品質評估的可靠性。或許令人驚訝的是，我們發現審稿人品質分數與作者品質無關。我們的模型納入了激勵機制，以表彰高品質審稿人，並鼓勵對提交論文進行更廣泛的涵蓋，從而減輕社群媒體常見的「富者愈富」陷阱。這些發現表明，開放式同行評審，具備評估和激勵審稿人品質的機制，為科學出版提供了一個可擴充且公平的替代方案，有潛力提升同行評審流程的速度、公平性和透明度。", "author": "Andrii Zahorodnii et.al.", "authors": "Andrii Zahorodnii, Jasper J. F. van den Bosch, Ian Charest, Christopher Summerfield, Ila R. Fiete", "id": "2501.13014v1", "paper_url": "http://arxiv.org/abs/2501.13014v1", "repo": "null"}}