{"2405.06800": {"publish_time": "2024-05-10", "title": "LLM-Generated Black-box Explanations Can Be Adversarially Helpful", "paper_summary": "Large Language Models (LLMs) are becoming vital tools that help us solve and\nunderstand complex problems by acting as digital assistants. LLMs can generate\nconvincing explanations, even when only given the inputs and outputs of these\nproblems, i.e., in a ``black-box'' approach. However, our research uncovers a\nhidden risk tied to this approach, which we call *adversarial helpfulness*.\nThis happens when an LLM's explanations make a wrong answer look right,\npotentially leading people to trust incorrect solutions. In this paper, we show\nthat this issue affects not just humans, but also LLM evaluators. Digging\ndeeper, we identify and examine key persuasive strategies employed by LLMs. Our\nfindings reveal that these models employ strategies such as reframing the\nquestions, expressing an elevated level of confidence, and cherry-picking\nevidence to paint misleading answers in a credible light. To examine if LLMs\nare able to navigate complex-structured knowledge when generating adversarially\nhelpful explanations, we create a special task based on navigating through\ngraphs. Some LLMs are not able to find alternative paths along simple graphs,\nindicating that their misleading explanations aren't produced by only logical\ndeductions using complex knowledge. These findings shed light on the\nlimitations of black-box explanation setting. We provide some advice on how to\nuse LLMs as explainers safely.", "paper_summary_zh": "大型語言模型 (LLM) 正成為重要的工具，幫助我們解決和理解複雜的問題，方法是充當數位助理。LLM 可以產生令人信服的解釋，即使只給予這些問題的輸入和輸出，亦即以「黑盒子」的方法。然而，我們的研究揭露了與此方法相關的隱藏風險，我們稱之為「對抗性的幫助」。當 LLM 的解釋讓錯誤的答案看起來正確時，就會發生這種情況，可能會導致人們相信不正確的解決方案。在本文中，我們展示了這個問題不僅影響人類，也影響 LLM 評估者。深入探討後，我們找出並檢視 LLM 使用的主要說服策略。我們的研究結果揭示了這些模型採用了重新定義問題、表達高度信心，以及挑選證據來以誤導性的方式描繪可信答案等策略。為了檢視 LLM 在產生對抗性的有幫助的解釋時是否能夠導航複雜結構化的知識，我們根據導航圖表建立了一個特殊任務。有些 LLM 無法在簡單的圖表中找到替代路徑，這表示他們具有誤導性的解釋並非僅透過使用複雜知識進行邏輯推論而產生。這些發現揭示了黑盒解釋設定的限制。我們提供了一些建議，說明如何安全地使用 LLM 作為解釋者。", "author": "Rohan Ajwani et.al.", "authors": "Rohan Ajwani, Shashidhar Reddy Javaji, Frank Rudzicz, Zining Zhu", "id": "2405.06800v1", "paper_url": "http://arxiv.org/abs/2405.06800v1", "repo": "null"}}