{"2409.10340": {"publish_time": "2024-09-16", "title": "Hyperedge Modeling in Hypergraph Neural Networks by using Densest Overlapping Subgraphs", "paper_summary": "Hypergraphs tackle the limitations of traditional graphs by introducing {\\em\nhyperedges}. While graph edges connect only two nodes, hyperedges connect an\narbitrary number of nodes along their edges. Also, the underlying\nmessage-passing mechanisms in Hypergraph Neural Networks (HGNNs) are in the\nform of vertex-hyperedge-vertex, which let HGNNs capture and utilize richer and\nmore complex structural information than traditional Graph Neural Networks\n(GNNs). More recently, the idea of overlapping subgraphs has emerged. These\nsubgraphs can capture more information about subgroups of vertices without\nlimiting one vertex belonging to just one group, allowing vertices to belong to\nmultiple groups or subgraphs. In addition, one of the most important problems\nin graph clustering is to find densest overlapping subgraphs (DOS). In this\npaper, we propose a solution to the DOS problem via Agglomerative Greedy\nEnumeration (DOSAGE) algorithm as a novel approach to enhance the process of\ngenerating the densest overlapping subgraphs and, hence, a robust construction\nof the hypergraphs. Experiments on standard benchmarks show that the DOSAGE\nalgorithm significantly outperforms the HGNNs and six other methods on the node\nclassification task.", "paper_summary_zh": "超圖透過引入{\\em超邊}來解決傳統圖表的限制。圖表的邊緣僅連接兩個節點，而超邊則沿著邊緣連接任意數量的節點。此外，超圖神經網路 (HGNN) 中的基礎訊息傳遞機制採用頂點-超邊-頂點的形式，這讓 HGNN 能夠擷取和利用比傳統圖神經網路 (GNN) 更豐富且更複雜的結構資訊。最近，重疊子圖的概念應運而生。這些子圖可以擷取更多關於頂點子群的資訊，而不會限制一個頂點只屬於一個群組，允許頂點屬於多個群組或子圖。此外，圖形聚類中最重要的問題之一是找到最密集的重疊子圖 (DOS)。在本文中，我們透過 Agglomerative Greedy Enumeration (DOSAGE) 演算法提出 DOS 問題的解決方案，作為一種增強生成最密集重疊子圖的程序的新方法，進而穩健地建構超圖。標準基準上的實驗顯示，DOSAGE 演算法在節點分類任務上顯著優於 HGNN 和其他六種方法。", "author": "Mehrad Soltani et.al.", "authors": "Mehrad Soltani, Luis Rueda", "id": "2409.10340v1", "paper_url": "http://arxiv.org/abs/2409.10340v1", "repo": "null"}}