{"2407.13193": {"publish_time": "2024-07-18", "title": "Retrieval-Augmented Generation for Natural Language Processing: A Survey", "paper_summary": "Large language models (LLMs) have demonstrated great success in various\nfields, benefiting from their huge amount of parameters that store knowledge.\nHowever, LLMs still suffer from several key issues, such as hallucination\nproblems, knowledge update issues, and lacking domain-specific expertise. The\nappearance of retrieval-augmented generation (RAG), which leverages an external\nknowledge database to augment LLMs, makes up those drawbacks of LLMs. This\npaper reviews all significant techniques of RAG, especially in the retriever\nand the retrieval fusions. Besides, tutorial codes are provided for\nimplementing the representative techniques in RAG. This paper further discusses\nthe RAG training, including RAG with/without datastore update. Then, we\nintroduce the application of RAG in representative natural language processing\ntasks and industrial scenarios. Finally, this paper discusses the future\ndirections and challenges of RAG for promoting its development.", "paper_summary_zh": "大型語言模型 (LLM) 在各個領域都展現出極佳的成果，受益於其儲存知識的龐大參數量。\n然而，LLM 仍有幾個關鍵問題，例如幻覺問題、知識更新問題，以及缺乏特定領域的專業知識。\n檢索增強生成 (RAG) 的出現，它利用外部知識庫來擴充 LLM，彌補了 LLM 的這些缺點。\n本文回顧了 RAG 的所有重要技術，特別是在檢索器和檢索融合中。\n此外，還提供了教學程式碼，用於在 RAG 中實作代表性技術。\n本文進一步討論了 RAG 訓練，包括有/無資料庫更新的 RAG。\n然後，我們介紹了 RAG 在代表性自然語言處理任務和產業場景中的應用。\n最後，本文討論了 RAG 未來發展的方向和挑戰，以促進其發展。", "author": "Shangyu Wu et.al.", "authors": "Shangyu Wu, Ying Xiong, Yufei Cui, Haolun Wu, Can Chen, Ye Yuan, Lianming Huang, Xue Liu, Tei-Wei Kuo, Nan Guan, Chun Jason Xue", "id": "2407.13193v2", "paper_url": "http://arxiv.org/abs/2407.13193v2", "repo": "null"}}