{"2502.03287": {"publish_time": "2025-02-05", "title": "STEM: Spatial-Temporal Mapping Tool For Spiking Neural Networks", "paper_summary": "Spiking Neural Networks (SNNs) are promising bio-inspired third-generation\nneural networks. Recent research has trained deep SNN models with accuracy on\npar with Artificial Neural Networks (ANNs). Although the event-driven and\nsparse nature of SNNs show potential for more energy efficient computation than\nANNs, SNN neurons have internal states which evolve over time. Keeping track of\nSNN states can significantly increase data movement and storage requirements,\npotentially losing its advantages with respect to ANNs. This paper investigates\nthe energy effects of having neuron states, and how it is influenced by the\nchosen mapping to realistic hardware architectures with advanced memory\nhierarchies. Therefore, we develop STEMS, a mapping design space exploration\ntool for SNNs. STEMS models SNN's stateful behavior and explores intra-layer\nand inter-layer mapping optimizations to minimize data movement, considering\nboth spatial and temporal SNN dimensions. Using STEMS, we show up to 12x\nreduction in off-chip data movement and 5x reduction in energy (on top of\nintra-layer optimizations), on two event-based vision SNN benchmarks. Finally,\nneuron states may not be needed for all SNN layers. By optimizing neuron states\nfor one of our benchmarks, we show 20x reduction in neuron states and 1.4x\nbetter performance without accuracy loss.", "paper_summary_zh": "尖峰神经網路 (SNN) 是有前途的生物啟發第三代神經網路。最近的研究已經訓練出具有與人工神經網路 (ANN) 相當精確度的深度 SNN 模型。儘管 SNN 的事件驅動和稀疏性質顯示出比 ANN 更節能運算的潛力，但 SNN 神經元具有會隨著時間演變的內部狀態。追蹤 SNN 狀態會顯著增加資料移動和儲存需求，可能會失去其相對於 ANN 的優勢。本文探討了神經元狀態的能量效應，以及它如何受到映射到具有先進記憶體層級結構的實際硬體架構的影響。因此，我們開發了 STEMS，這是一個 SNN 的映射設計空間探索工具。STEMS 對 SNN 的狀態行為建模，並探索層內和層間映射最佳化，以最小化資料移動，同時考慮空間和時間 SNN 維度。使用 STEMS，我們展示了在兩個基於事件的視覺 SNN 基準上，晶片外資料移動減少了 12 倍，能量減少了 5 倍（在層內最佳化之上）。最後，並非所有 SNN 層都需要神經元狀態。通過最佳化其中一個基準的神經元狀態，我們展示了神經元狀態減少了 20 倍，效能提升了 1.4 倍，而沒有準確度損失。", "author": "Sherif Eissa et.al.", "authors": "Sherif Eissa, Sander Stuijk, Floran De Putter, Andrea Nardi-Dei, Federico Corradi, Henk Corporaal", "id": "2502.03287v1", "paper_url": "http://arxiv.org/abs/2502.03287v1", "repo": "null"}}