{"2505.01390": {"publish_time": "2025-05-02", "title": "Multimodal Doctor-in-the-Loop: A Clinically-Guided Explainable Framework for Predicting Pathological Response in Non-Small Cell Lung Cancer", "paper_summary": "This study proposes a novel approach combining Multimodal Deep Learning with\nintrinsic eXplainable Artificial Intelligence techniques to predict\npathological response in non-small cell lung cancer patients undergoing\nneoadjuvant therapy. Due to the limitations of existing radiomics and unimodal\ndeep learning approaches, we introduce an intermediate fusion strategy that\nintegrates imaging and clinical data, enabling efficient interaction between\ndata modalities. The proposed Multimodal Doctor-in-the-Loop method further\nenhances clinical relevance by embedding clinicians' domain knowledge directly\ninto the training process, guiding the model's focus gradually from broader\nlung regions to specific lesions. Results demonstrate improved predictive\naccuracy and explainability, providing insights into optimal data integration\nstrategies for clinical applications.", "paper_summary_zh": "<paragraph>這項研究提出了一種新穎的方法，結合多模態深度學習與內在可解釋人工智慧技術，用於預測接受新輔助治療的非小細胞肺癌患者的病理反應。由於現有放射組學和單模態深度學習方法的局限性，我們引入了一種中間融合策略，整合影像和臨床數據，使數據模態之間能夠有效地交互作用。所提出的多模態「迴圈中醫生」方法，透過將臨床醫生的領域知識直接嵌入到訓練過程中，進一步增強了臨床相關性，引導模型的關注點從更廣泛的肺部區域逐漸轉移到特定病灶。結果顯示預測準確性和可解釋性有所提高，為臨床應用中的最佳數據整合策略提供了見解。</paragraph>\n", "author": "Alice Natalina Caragliano et.al.", "authors": "Alice Natalina Caragliano, Claudia Tacconi, Carlo Greco, Lorenzo Nibid, Edy Ippolito, Michele Fiore, Giuseppe Perrone, Sara Ramella, Paolo Soda, Valerio Guarrasi", "id": "2505.01390v1", "paper_url": "http://arxiv.org/abs/2505.01390v1", "repo": "null"}}