{"2409.08887": {"publish_time": "2024-09-13", "title": "Visual Language Tracking with Multi-modal Interaction: A Robust Benchmark", "paper_summary": "Visual Language Tracking (VLT) enhances tracking by mitigating the\nlimitations of relying solely on the visual modality, utilizing high-level\nsemantic information through language. This integration of the language enables\nmore advanced human-machine interaction. The essence of interaction is\ncognitive alignment, which typically requires multiple information exchanges,\nespecially in the sequential decision-making process of VLT. However, current\nVLT benchmarks do not account for multi-round interactions during tracking.\nThey provide only an initial text and bounding box (bbox) in the first frame,\nwith no further interaction as tracking progresses, deviating from the original\nmotivation of the VLT task. To address these limitations, we propose a novel\nand robust benchmark, VLT-MI (Visual Language Tracking with Multi-modal\nInteraction), which introduces multi-round interaction into the VLT task for\nthe first time. (1) We generate diverse, multi-granularity texts for\nmulti-round, multi-modal interaction based on existing mainstream VLT\nbenchmarks using DTLLM-VLT, leveraging the world knowledge of LLMs. (2) We\npropose a new VLT interaction paradigm that achieves multi-round interaction\nthrough text updates and object recovery. When multiple tracking failures\noccur, we provide the tracker with more aligned texts and corrected bboxes\nthrough interaction, thereby expanding the scope of VLT downstream tasks. (3)\nWe conduct comparative experiments on both traditional VLT benchmarks and\nVLT-MI, evaluating and analyzing the accuracy and robustness of trackers under\nthe interactive paradigm. This work offers new insights and paradigms for the\nVLT task, enabling a fine-grained evaluation of multi-modal trackers. We\nbelieve this approach can be extended to additional datasets in the future,\nsupporting broader evaluations and comparisons of video-language model\ncapabilities.", "paper_summary_zh": "視覺語言追蹤 (VLT) 透過語言利用高層級語義資訊，減輕僅依賴視覺模式的限制，進而增強追蹤。這種語言整合能促成更進階的人機互動。互動的本質在於認知對齊，這通常需要多重資訊交換，特別是在 VLT 的循序決策過程中。然而，目前的 VLT 基準並未考量追蹤期間的多輪互動。它們僅在第一個畫格中提供初始文字和邊界框 (bbox)，而隨著追蹤的進行並未進一步互動，這偏離了 VLT 任務的原始動機。為了解決這些限制，我們提出一個新穎且穩健的基準 VLT-MI（多模式互動視覺語言追蹤），這首次在 VLT 任務中引入多輪互動。（1）我們使用 DTLLM-VLT 根據現有的主流 VLT 基準，為多輪、多模式互動產生多樣化、多粒度的文字，並利用 LLM 的世界知識。（2）我們提出一個新的 VLT 互動範例，透過文字更新和物件復原來達成多輪互動。當發生多個追蹤失敗時，我們透過互動為追蹤器提供更一致的文字和修正的 bbox，從而擴展 VLT 下游任務的範圍。（3）我們在傳統 VLT 基準和 VLT-MI 上進行比較實驗，評估和分析在互動範例下追蹤器的準確性和穩健性。這項工作為 VLT 任務提供了新的見解和範例，能對多模式追蹤器進行細緻的評估。我們相信這種方法未來可以擴展到其他資料集，支援更廣泛的評估和影片語言模型功能的比較。", "author": "Xuchen Li et.al.", "authors": "Xuchen Li, Shiyu Hu, Xiaokun Feng, Dailing Zhang, Meiqi Wu, Jing Zhang, Kaiqi Huang", "id": "2409.08887v1", "paper_url": "http://arxiv.org/abs/2409.08887v1", "repo": "null"}}