{"2411.06611": {"publish_time": "2024-11-10", "title": "vTune: Verifiable Fine-Tuning for LLMs Through Backdooring", "paper_summary": "As fine-tuning large language models (LLMs) becomes increasingly prevalent,\nusers often rely on third-party services with limited visibility into their\nfine-tuning processes. This lack of transparency raises the question: \\emph{how\ndo consumers verify that fine-tuning services are performed correctly}? For\ninstance, a service provider could claim to fine-tune a model for each user,\nyet simply send all users back the same base model. To address this issue, we\npropose vTune, a simple method that uses a small number of \\textit{backdoor}\ndata points added to the training data to provide a statistical test for\nverifying that a provider fine-tuned a custom model on a particular user's\ndataset. Unlike existing works, vTune is able to scale to verification of\nfine-tuning on state-of-the-art LLMs, and can be used both with open-source and\nclosed-source models. We test our approach across several model families and\nsizes as well as across multiple instruction-tuning datasets, and find that the\nstatistical test is satisfied with p-values on the order of $\\sim 10^{-40}$,\nwith no negative impact on downstream task performance. Further, we explore\nseveral attacks that attempt to subvert vTune and demonstrate the method's\nrobustness to these attacks.", "paper_summary_zh": "随着对大型语言模型 (LLM) 的微调变得越来越普遍，\n用户通常依赖于第三方服务，而这些服务对其微调过程的可见性有限。这种缺乏透明度引发了一个问题：\\emph{消费者如何验证微调服务是否正确执行}？例如，服务提供商可以声称针对每个用户微调模型，但实际上只是向所有用户发送回相同的底层模型。为了解决这个问题，我们提出了 vTune，这是一种简单的方法，它使用添加到训练数据中的少量\\textit{后门}数据点，以提供一个统计测试，用于验证提供商是否针对特定用户的训练数据集微调了自定义模型。与现有工作不同，vTune 能够扩展到对最先进的 LLM 进行微调验证，并且可以与开源和闭源模型一起使用。我们在多个模型系列和规模以及多个指令微调数据集上测试了我们的方法，发现统计测试满足 p 值约为 $\\sim 10^{-40}$，对下游任务性能没有负面影响。此外，我们探索了几种试图破坏 vTune 的攻击，并证明了该方法对这些攻击的鲁棒性。", "author": "Eva Zhang et.al.", "authors": "Eva Zhang, Arka Pal, Akilesh Potti, Micah Goldblum", "id": "2411.06611v1", "paper_url": "http://arxiv.org/abs/2411.06611v1", "repo": "null"}}