{"2502.03257": {"publish_time": "2025-02-05", "title": "Efficient extraction of medication information from clinical notes: an evaluation in two languages", "paper_summary": "Objective: To evaluate the accuracy, computational cost and portability of a\nnew Natural Language Processing (NLP) method for extracting medication\ninformation from clinical narratives. Materials and Methods: We propose an\noriginal transformer-based architecture for the extraction of entities and\ntheir relations pertaining to patients' medication regimen. First, we used this\napproach to train and evaluate a model on French clinical notes, using a newly\nannotated corpus from H\\^opitaux Universitaires de Strasbourg. Second, the\nportability of the approach was assessed by conducting an evaluation on\nclinical documents in English from the 2018 n2c2 shared task. Information\nextraction accuracy and computational cost were assessed by comparison with an\navailable method using transformers. Results: The proposed architecture\nachieves on the task of relation extraction itself performance that are\ncompetitive with the state-of-the-art on both French and English (F-measures\n0.82 and 0.96 vs 0.81 and 0.95), but reduce the computational cost by 10.\nEnd-to-end (Named Entity recognition and Relation Extraction) F1 performance is\n0.69 and 0.82 for French and English corpus. Discussion: While an existing\nsystem developed for English notes was deployed in a French hospital setting\nwith reasonable effort, we found that an alternative architecture offered\nend-to-end drug information extraction with comparable extraction performance\nand lower computational impact for both French and English clinical text\nprocessing, respectively. Conclusion: The proposed architecture can be used to\nextract medication information from clinical text with high performance and low\ncomputational cost and consequently suits with usually limited hospital IT\nresources", "paper_summary_zh": "<paragraph>目標：評估一種新的自然語言處理 (NLP) 方法的準確度、計算成本和可移植性，以從臨床敘述中提取藥物資訊。材料和方法：我們提出一個基於變換器的原始架構，用於提取實體及其與患者用藥方案相關的關係。首先，我們使用此方法訓練並評估法語臨床筆記上的模型，使用來自史特拉斯堡大學醫院的新註釋語料庫。其次，通過對 2018 n2c2 共享任務中的英語臨床文件進行評估，評估了該方法的可移植性。透過與使用變換器的可用方法進行比較，評估資訊提取準確度和計算成本。結果：所提出的架構在關係提取任務本身的表現上，在法語和英語上都與最先進的技術競爭（F 值 0.82 和 0.96 對比 0.81 和 0.95），但將計算成本降低了 10。端到端（命名實體識別和關係提取）F1 效能對於法語和英語語料庫分別為 0.69 和 0.82。討論：儘管為英語筆記開發的現有系統已在法語醫院環境中部署，且付出了合理的努力，但我們發現一種替代架構提供了端到端的藥物資訊提取，且對於法語和英語臨床文本處理而言，具有可比較的提取效能和較低的計算影響。結論：所提出的架構可用於從臨床文本中提取藥物資訊，且效能高、計算成本低，因此適用於通常有限的醫院 IT 資源</paragraph>", "author": "Thibaut Fabacher et.al.", "authors": "Thibaut Fabacher, Erik-André Sauleau, Emmanuelle Arcay, Bineta Faye, Maxime Alter, Archia Chahard, Nathan Miraillet, Adrien Coulet, Aurélie Névéol", "id": "2502.03257v1", "paper_url": "http://arxiv.org/abs/2502.03257v1", "repo": "null"}}