{"2407.04212": {"publish_time": "2024-07-05", "title": "Smart Vision-Language Reasoners", "paper_summary": "In this article, we investigate vision-language models (VLM) as reasoners.\nThe ability to form abstractions underlies mathematical reasoning,\nproblem-solving, and other Math AI tasks. Several formalisms have been given to\nthese underlying abstractions and skills utilized by humans and intelligent\nsystems for reasoning. Furthermore, human reasoning is inherently multimodal,\nand as such, we focus our investigations on multimodal AI. In this article, we\nemploy the abstractions given in the SMART task (Simple Multimodal Algorithmic\nReasoning Task) introduced in \\cite{cherian2022deep} as meta-reasoning and\nproblem-solving skills along eight axes: math, counting, path, measure, logic,\nspatial, and pattern. We investigate the ability of vision-language models to\nreason along these axes and seek avenues of improvement. Including composite\nrepresentations with vision-language cross-attention enabled learning\nmultimodal representations adaptively from fused frozen pretrained backbones\nfor better visual grounding. Furthermore, proper hyperparameter and other\ntraining choices led to strong improvements (up to $48\\%$ gain in accuracy) on\nthe SMART task, further underscoring the power of deep multimodal learning. The\nsmartest VLM, which includes a novel QF multimodal layer, improves upon the\nbest previous baselines in every one of the eight fundamental reasoning skills.\nEnd-to-end code is available at https://github.com/smarter-vlm/smarter.", "paper_summary_zh": "<paragraph>在本文中，我們探討視覺語言模型 (VLM) 作為推理者。\n形成抽象化的能力是數學推理、問題解決和其他數學 AI 任務的基礎。\n已經給出了幾種形式主義來表示人類和智能系統用於推理的基本抽象化和技能。\n此外，人類推理本質上是多模態的，因此，我們將研究重點放在多模態 AI 上。\n在本文中，我們採用 SMART 任務（簡單多模態演算法推理任務）中給出的抽象化，\n它在 \\cite{cherian2022deep} 中被引入為元推理和問題解決技能，並沿著以下八個軸線進行：\n數學、計數、路徑、測量、邏輯、空間和模式。我們探討視覺語言模型沿著這些軸線推理的能力，\n並尋求改進途徑。包含具有視覺語言交叉注意力的複合表示，\n能夠自適應地從融合的凍結預訓練主幹學習多模態表示，以獲得更好的視覺基礎。\n此外，適當的超參數和其他訓練選擇導致 SMART 任務的顯著改進（準確度提升高達 $48\\%$），\n進一步強調了深度多模態學習的力量。最聰明的 VLM 包含一個新穎的 QF 多模態層，\n在八項基本推理技能的每一項中都改進了先前的最佳基準。\n端到端程式碼可在 https://github.com/smarter-vlm/smarter 中取得。</paragraph>", "author": "Denisa Roberts et.al.", "authors": "Denisa Roberts, Lucas Roberts", "id": "2407.04212v1", "paper_url": "http://arxiv.org/abs/2407.04212v1", "repo": "https://github.com/smarter-vlm/smarter"}}