{"2408.10060": {"publish_time": "2024-08-19", "title": "Facial Wrinkle Segmentation for Cosmetic Dermatology: Pretraining with Texture Map-Based Weak Supervision", "paper_summary": "Facial wrinkle detection plays a crucial role in cosmetic dermatology.\nPrecise manual segmentation of facial wrinkles is challenging and\ntime-consuming, with inherent subjectivity leading to inconsistent results\namong graders. To address this issue, we propose two solutions. First, we build\nand release the first public facial wrinkle dataset, `FFHQ-Wrinkle', an\nextension of the NVIDIA FFHQ dataset. This dataset includes 1,000 images with\nhuman labels and 50,000 images with automatically generated weak labels. This\ndataset can foster the research community to develop advanced wrinkle detection\nalgorithms. Second, we introduce a training strategy for U-Net-like\nencoder-decoder models to detect wrinkles across the face automatically. Our\nmethod employs a two-stage training strategy: texture map pretraining and\nfinetuning on human-labeled data. Initially, we pretrain models on a large\ndataset with weak labels (N=50k) or masked texture maps generated through\ncomputer vision techniques, without human intervention. Subsequently, we\nfinetune the models using human-labeled data (N=1k), which consists of manually\nlabeled wrinkle masks. During finetuning, the network inputs a combination of\nRGB and masked texture maps, comprising four channels. We effectively combine\nlabels from multiple annotators to minimize subjectivity in manual labeling.\nOur strategies demonstrate improved segmentation performance in facial wrinkle\nsegmentation both quantitatively and visually compared to existing pretraining\nmethods.", "paper_summary_zh": "人臉皺紋偵測在美容皮膚科扮演著至關重要的角色。\n精確手動分割人臉皺紋具有挑戰性且耗時，內在的主觀性導致評分員之間產生不一致的結果。為了解決這個問題，我們提出了兩個解決方案。首先，我們建立並發布了第一個公開人臉皺紋數據集，即「FFHQ-Wrinkle」，NVIDIA FFHQ 數據集的延伸。這個數據集包含 1,000 張具有真人標籤的圖像和 50,000 張具有自動生成弱標籤的圖像。這個數據集可以促進研究社群開發進階的皺紋偵測演算法。其次，我們針對 U-Net 型編碼器-解碼器模型引入了訓練策略，以自動偵測整張臉的皺紋。我們的技術採用了兩階段訓練策略：紋理貼圖預訓練和針對真人標籤資料進行微調。最初，我們在具有弱標籤（N=50k）的大型數據集或透過電腦視覺技術產生的遮罩紋理貼圖上預訓練模型，不進行人工干預。隨後，我們使用真人標籤資料（N=1k）對模型進行微調，這些資料包含手動標籤的皺紋遮罩。在微調過程中，網路輸入 RGB 和遮罩紋理貼圖的組合，包含四個通道。我們有效地結合了多個標記員的標籤，以最小化手動標籤中的主觀性。與現有的預訓練方法相比，我們的策略在人臉皺紋分割中展現了定量和視覺上改善的分割效能。", "author": "Junho Moon et.al.", "authors": "Junho Moon, Haejun Chung, Ikbeom Jang", "id": "2408.10060v1", "paper_url": "http://arxiv.org/abs/2408.10060v1", "repo": "null"}}