{"2501.12698": {"publish_time": "2025-01-22", "title": "Training Dialogue Systems by AI Feedback for Improving Overall Dialogue Impression", "paper_summary": "To improve user engagement during conversations with dialogue systems, we\nmust improve individual dialogue responses and dialogue impressions such as\nconsistency, personality, and empathy throughout the entire dialogue. While\nsuch dialogue systems have been developing rapidly with the help of large\nlanguage models (LLMs), reinforcement learning from AI feedback (RLAIF) has\nattracted attention to align LLM-based dialogue models for such dialogue\nimpressions. In RLAIF, a reward model based on another LLM is used to create a\ntraining signal for an LLM-based dialogue model using zero-shot/few-shot\nprompting techniques. However, evaluating an entire dialogue only by prompting\nLLMs is challenging. In this study, the supervised fine-tuning (SFT) of LLMs\nprepared reward models corresponding to 12 metrics related to the impression of\nthe entire dialogue for evaluating dialogue responses. We tuned our dialogue\nmodels using the reward model signals as feedback to improve the impression of\nthe system. The results of automatic and human evaluations showed that tuning\nthe dialogue model using our reward model corresponding to dialogue impression\nimproved the evaluation of individual metrics and the naturalness of the\ndialogue response.", "paper_summary_zh": "為了在對話系統對話期間提升使用者的參與度，我們必須改善個別對話回應以及對話印象，例如在整個對話中的一致性、個性與同理心。雖然此類對話系統在大型語言模型 (LLM) 的協助下快速發展，但來自 AI 回饋的強化學習 (RLAIF) 已引起注意，可調整基於 LLM 的對話模型以獲得此類對話印象。在 RLAIF 中，基於另一個 LLM 的獎勵模型用於使用零次/少次提示技術為基於 LLM 的對話模型建立訓練訊號。不過，僅透過提示 LLM 就評估整個對話具有挑戰性。在這項研究中，LLM 的監督微調 (SFT) 準備了與 12 項指標對應的獎勵模型，這些指標與評估對話回應的對話整體印象有關。我們使用獎勵模型訊號作為回饋微調我們的對話模型，以改善系統的印象。自動和人工評估結果顯示，使用與對話印象對應的獎勵模型微調對話模型，改善了個別指標的評估以及對話回應的自然性。", "author": "Kai Yoshida et.al.", "authors": "Kai Yoshida, Masahiro Mizukami, Seiya Kawano, Canasai Kruengkrai, Hiroaki Sugiyama, Koichiro Yoshino", "id": "2501.12698v1", "paper_url": "http://arxiv.org/abs/2501.12698v1", "repo": "null"}}