{"2502.15223": {"publish_time": "2025-02-21", "title": "A BERT Based Hybrid Recommendation System For Academic Collaboration", "paper_summary": "Universities serve as a hub for academic collaboration, promoting the\nexchange of diverse ideas and perspectives among students and faculty through\ninterdisciplinary dialogue. However, as universities expand in size,\nconventional networking approaches via student chapters, class groups, and\nfaculty committees become cumbersome. To address this challenge, an\nacademia-specific profile recommendation system is proposed to connect\nlike-minded stakeholders within any university community. This study evaluates\nthree techniques: Term Frequency-Inverse Document Frequency (TF-IDF),\nBidirectional Encoder Representations from Transformers (BERT), and a hybrid\napproach to generate effective recommendations. Due to the unlabelled nature of\nthe dataset, Affinity Propagation cluster-based relabelling is performed to\nunderstand the grouping of similar profiles. The hybrid model demonstrated\nsuperior performance, evidenced by its similarity score, Silhouette score,\nDavies-Bouldin index, and Normalized Discounted Cumulative Gain (NDCG),\nachieving an optimal balance between diversity and relevance in\nrecommendations. Furthermore, the optimal model has been implemented as a\nmobile application, which dynamically suggests relevant profiles based on\nusers' skills and collaboration interests, incorporating contextual\nunderstanding. The potential impact of this application is significant, as it\npromises to enhance networking opportunities within large academic institutions\nthrough the deployment of intelligent recommendation systems.", "paper_summary_zh": "大學作為學術合作的樞紐，透過跨領域的對話促進學生和教職員之間多元思想和觀點的交流。然而，隨著大學規模的擴張，透過學生分會、班級小組和教職員委員會進行傳統的網路建立方式變得繁瑣。為了應對這項挑戰，提出了一套專門針對學術界的個人資料推薦系統，以連結任何大學社群中志同道合的利害關係人。這項研究評估了三種技術：詞頻-逆向文件頻率 (TF-IDF)、來自 Transformer 的雙向編碼器表示法 (BERT) 和一種產生有效推薦的混合方法。由於資料集的無標籤性質，執行基於親和傳播群集的重新標籤，以了解相似個人資料的分組。混合模型展現出優異的效能，其相似度分數、輪廓分數、戴維斯-包爾丁指標和標準化貼現累積增益 (NDCG) 為證，在推薦中達成多元性與相關性之間的最佳平衡。此外，最佳模型已實作為行動應用程式，根據使用者的技能和合作興趣動態建議相關個人資料，並納入脈絡理解。這個應用的潛在影響重大，它承諾透過部署智慧推薦系統，提升大型學術機構內的網路建立機會。", "author": "Sangeetha N et.al.", "authors": "Sangeetha N, Harish Thangaraj, Varun Vashisht, Eshaan Joshi, Kanishka Verma, Diya Katariya", "id": "2502.15223v1", "paper_url": "http://arxiv.org/abs/2502.15223v1", "repo": "null"}}