{"2501.14431": {"publish_time": "2025-01-24", "title": "Domaino1s: Guiding LLM Reasoning for Explainable Answers in High-Stakes Domains", "paper_summary": "Large Language Models (LLMs) are widely applied to downstream domains.\nHowever, current LLMs for high-stakes domain tasks, such as financial\ninvestment and legal QA, typically generate brief answers without reasoning\nprocesses and explanations. This limits users' confidence in making decisions\nbased on their responses. While original CoT shows promise, it lacks\nself-correction mechanisms during reasoning. This work introduces Domain$o1$s,\nwhich enhances LLMs' reasoning capabilities on domain tasks through supervised\nfine-tuning and tree search. We construct CoT-stock-2k and CoT-legal-2k\ndatasets for fine-tuning models that activate domain-specific reasoning steps\nbased on their judgment. Additionally, we propose Selective Tree Exploration to\nspontaneously explore solution spaces and sample optimal reasoning paths to\nimprove performance. We also introduce PROOF-Score, a new metric for evaluating\ndomain models' explainability, complementing traditional accuracy metrics with\nricher assessment dimensions. Extensive experiments on stock investment\nrecommendation and legal reasoning QA tasks demonstrate Domaino1s's leading\nperformance and explainability. Our code is available at\nhttps://anonymous.4open.science/r/Domaino1s-006F/.", "paper_summary_zh": "大型語言模型 (LLM) 廣泛應用於下游領域。\n然而，目前用於高風險領域任務的 LLM，例如金融投資和法律 QA，通常會產生簡短的答案，而沒有推理過程和解釋。這限制了使用者根據其回應做出決策的信心。儘管原始的 CoT 顯示出前景，但它在推理過程中缺乏自我修正機制。這項工作介紹了 Domain$o1$s，它通過監督微調和樹狀搜尋增強了 LLM 在領域任務上的推理能力。我們構建了 CoT-stock-2k 和 CoT-legal-2k 資料集，用於微調模型，這些模型會根據判斷啟動特定領域的推理步驟。此外，我們提出了選擇性樹狀探索，以自發探索解空間並採樣最佳推理路徑以提高性能。我們還引入了 PROOF-Score，這是一個用於評估領域模型可解釋性的新指標，它使用更豐富的評估維度來補充傳統的準確性指標。在股票投資推薦和法律推理 QA 任務上的廣泛實驗證明了 Domaino1s 的領先性能和可解釋性。我們的程式碼可在 https://anonymous.4open.science/r/Domaino1s-006F/ 取得。", "author": "Xu Chu et.al.", "authors": "Xu Chu, Zhijie Tan, Hanlin Xue, Guanyu Wang, Tong Mo, Weiping Li", "id": "2501.14431v1", "paper_url": "http://arxiv.org/abs/2501.14431v1", "repo": "null"}}