{"2408.15116": {"publish_time": "2024-08-27", "title": "Evaluating Stability of Unreflective Alignment", "paper_summary": "Many theoretical obstacles to AI alignment are consequences of reflective\nstability - the problem of designing alignment mechanisms that the AI would not\ndisable if given the option. However, problems stemming from reflective\nstability are not obviously present in current LLMs, leading to disagreement\nover whether they will need to be solved to enable safe delegation of cognitive\nlabor. In this paper, we propose Counterfactual Priority Change (CPC)\ndestabilization as a mechanism by which reflective stability problems may arise\nin future LLMs. We describe two risk factors for CPC-destabilization: 1)\nCPC-based stepping back and 2) preference instability. We develop preliminary\nevaluations for each of these risk factors, and apply them to frontier LLMs.\nOur findings indicate that in current LLMs, increased scale and capability are\nassociated with increases in both CPC-based stepping back and preference\ninstability, suggesting that CPC-destabilization may cause reflective stability\nproblems in future LLMs.", "paper_summary_zh": "許多理論上 AI 對齊的障礙是反射穩定性的後果，即設計 AI 在有選項時不會停用的對齊機制的難題。然而，源自反射穩定性的問題在目前的 LLM 中並不明顯，導致對是否需要解決這些問題以實現認知勞動的安全委派產生分歧。在本文中，我們提出反事實優先變更 (CPC) 去穩定化，作為反射穩定性問題可能在未來 LLM 中產生的機制。我們描述了 CPC 去穩定的兩個風險因素：1) 基於 CPC 的後退和 2) 偏好不穩定。我們針對這些風險因素中的每一個開發初步評估，並將它們應用於前沿 LLM。我們的研究結果表明，在目前的 LLM 中，規模和能力的增加與基於 CPC 的後退和偏好不穩定的增加有關，這表明 CPC 去穩定化可能會在未來的 LLM 中導致反射穩定性問題。", "author": "James Lucassen et.al.", "authors": "James Lucassen, Mark Henry, Philippa Wright, Owen Yeung", "id": "2408.15116v1", "paper_url": "http://arxiv.org/abs/2408.15116v1", "repo": "null"}}