{"2408.06120": {"publish_time": "2024-08-12", "title": "How ChatGPT Changed the Media's Narratives on AI: A Semi-Automated Narrative Analysis Through Frame Semantics", "paper_summary": "The recent explosion of attention to AI is arguably one of the biggest in the\ntechnology's media coverage. To investigate the effects it has on the\ndiscourse, we perform a mixed-method frame semantics-based analysis on a\ndataset of more than 49,000 sentences collected from 5846 news articles that\nmention AI. The dataset covers the twelve-month period centred around the\nlaunch of OpenAI's chatbot ChatGPT and is collected from the most visited\nopen-access English-language news publishers. Our findings indicate that during\nthe half year succeeding the launch, media attention rose\ntenfold$\\unicode{x2014}$from already historically high levels. During this\nperiod, discourse has become increasingly centred around experts and political\nleaders, and AI has become more closely associated with dangers and risks. A\ndeeper review of the data also suggests a qualitative shift in the types of\nthreat AI is thought to represent, as well as the anthropomorphic qualities\nascribed to it.", "paper_summary_zh": "最近對 AI 的關注爆炸性增長，這無疑是科技媒體報導中最大的事件之一。為了探討它對話語的影響，我們對一個從 5846 篇提到 AI 的新聞文章中收集的超過 49,000 個句子的資料集，執行了一個基於混合方法框架語義的分析。該資料集涵蓋了圍繞 OpenAI 的聊天機器人 ChatGPT 推出前後的 12 個月期間，並且從最多人瀏覽的開放取用英文新聞出版商中收集。我們的研究結果表明，在推出後半年內，媒體關注度上升了十倍，從歷史高位進一步上升。在此期間，話語越來越集中在專家和政治領袖身上，而 AI 與危險和風險的關聯也越來越密切。對資料的更深入檢視也表明，人們認為 AI 所代表的威脅類型以及歸因於它的擬人化特質，都發生了質的轉變。", "author": "Igor Ryazanov et.al.", "authors": "Igor Ryazanov, Carl Öhman, Johanna Björklund", "id": "2408.06120v1", "paper_url": "http://arxiv.org/abs/2408.06120v1", "repo": "null"}}