{"2411.19589": {"publish_time": "2024-11-29", "title": "Can Large Language Models Reason about the Region Connection Calculus?", "paper_summary": "Qualitative Spatial Reasoning is a well explored area of Knowledge\nRepresentation and Reasoning and has multiple applications ranging from\nGeographical Information Systems to Robotics and Computer Vision. Recently,\nmany claims have been made for the reasoning capabilities of Large Language\nModels (LLMs). Here, we investigate the extent to which a set of representative\nLLMs can perform classical qualitative spatial reasoning tasks on the\nmereotopological Region Connection Calculus, RCC-8. We conduct three pairs of\nexperiments (reconstruction of composition tables, alignment to human\ncomposition preferences, conceptual neighbourhood reconstruction) using\nstate-of-the-art LLMs; in each pair one experiment uses eponymous relations and\none, anonymous relations (to test the extent to which the LLM relies on\nknowledge about the relation names obtained during training). All instances are\nrepeated 30 times to measure the stochasticity of the LLMs.", "paper_summary_zh": "定性的空間推理是知識表徵與推理中廣泛探索的領域，且有從地理資訊系統到機器人和電腦視覺等多種應用。最近，對於大型語言模型 (LLM) 的推理能力提出了許多主張。在此，我們探討一組具代表性的 LLM 在僅具備拓撲區域連接演算 (RCC-8) 的古典定性空間推理任務中所能執行的程度。我們使用最先進的 LLM 進行三組實驗（重構組合表、對齊人類組合偏好、概念鄰域重構）；在每組實驗中，一個實驗使用同名的關係，另一個使用匿名的關係（用於測試 LLM 在訓練期間獲得的關係名稱知識的依賴程度）。所有範例重複 30 次以測量 LLM 的隨機性。", "author": "Anthony G Cohn et.al.", "authors": "Anthony G Cohn, Robert E Blackwell", "id": "2411.19589v1", "paper_url": "http://arxiv.org/abs/2411.19589v1", "repo": "null"}}