{"2412.08604": {"publish_time": "2024-12-11", "title": "Preference Discerning with LLM-Enhanced Generative Retrieval", "paper_summary": "Sequential recommendation systems aim to provide personalized recommendations\nfor users based on their interaction history. To achieve this, they often\nincorporate auxiliary information, such as textual descriptions of items and\nauxiliary tasks, like predicting user preferences and intent. Despite numerous\nefforts to enhance these models, they still suffer from limited\npersonalization. To address this issue, we propose a new paradigm, which we\nterm preference discerning. In preference dscerning, we explicitly condition a\ngenerative sequential recommendation system on user preferences within its\ncontext. To this end, we generate user preferences using Large Language Models\n(LLMs) based on user reviews and item-specific data. To evaluate preference\ndiscerning capabilities of sequential recommendation systems, we introduce a\nnovel benchmark that provides a holistic evaluation across various scenarios,\nincluding preference steering and sentiment following. We assess current\nstate-of-the-art methods using our benchmark and show that they struggle to\naccurately discern user preferences. Therefore, we propose a new method named\nMender ($\\textbf{M}$ultimodal Prefer$\\textbf{en}$ce\n$\\textbf{d}$iscern$\\textbf{er}$), which improves upon existing methods and\nachieves state-of-the-art performance on our benchmark. Our results show that\nMender can be effectively guided by human preferences even though they have not\nbeen observed during training, paving the way toward more personalized\nsequential recommendation systems. We will open-source the code and benchmarks\nupon publication.", "paper_summary_zh": "序列推薦系統旨在根據使用者的互動記錄提供個人化推薦。為此，它們通常會納入輔助資訊，例如項目的文字描述和輔助任務，例如預測使用者偏好和意圖。儘管為增強這些模型付出了許多努力，但它們仍受到個人化有限的影響。為了解決這個問題，我們提出了一個新的範例，我們稱之為偏好辨識。在偏好辨識中，我們明確地將生成式序列推薦系統置於其內容中的使用者偏好之上。為此，我們根據使用者評論和特定於專案的資料，使用大型語言模型 (LLM) 來產生使用者偏好。為了評估序列推薦系統的偏好辨識能力，我們引入了一個新的基準，它提供了跨不同場景的整體評估，包括偏好導向和情緒追蹤。我們使用我們的基準評估了當前最先進的方法，並表明它們難以準確辨識使用者偏好。因此，我們提出了一種名為 Mender（**M**ultimodal Prefer**en**ce **d**iscern**er**）的新方法，它改進了現有方法，並在我們的基準上達到了最先進的效能。我們的結果表明，即使在訓練期間未觀察到人類偏好，Mender 也可以有效地受到人類偏好的指導，為更個人化的序列推薦系統鋪平了道路。我們將在發表後開放原始碼和基準。", "author": "Fabian Paischer et.al.", "authors": "Fabian Paischer, Liu Yang, Linfeng Liu, Shuai Shao, Kaveh Hassani, Jiacheng Li, Ricky Chen, Zhang Gabriel Li, Xialo Gao, Wei Shao, Xue Feng, Nima Noorshams, Sem Park, Bo Long, Hamid Eghbalzadeh", "id": "2412.08604v1", "paper_url": "http://arxiv.org/abs/2412.08604v1", "repo": "null"}}