{"2408.12150": {"publish_time": "2024-08-22", "title": "DeepHQ: Learned Hierarchical Quantizer for Progressive Deep Image Coding", "paper_summary": "Unlike fixed- or variable-rate image coding, progressive image coding (PIC)\naims to compress various qualities of images into a single bitstream,\nincreasing the versatility of bitstream utilization and providing high\ncompression efficiency compared to simulcast compression. Research on neural\nnetwork (NN)-based PIC is in its early stages, mainly focusing on applying\nvarying quantization step sizes to the transformed latent representations in a\nhierarchical manner. These approaches are designed to compress only the\nprogressively added information as the quality improves, considering that a\nwider quantization interval for lower-quality compression includes multiple\nnarrower sub-intervals for higher-quality compression. However, the existing\nmethods are based on handcrafted quantization hierarchies, resulting in\nsub-optimal compression efficiency. In this paper, we propose an NN-based\nprogressive coding method that firstly utilizes learned quantization step sizes\nvia learning for each quantization layer. We also incorporate selective\ncompression with which only the essential representation components are\ncompressed for each quantization layer. We demonstrate that our method achieves\nsignificantly higher coding efficiency than the existing approaches with\ndecreased decoding time and reduced model size.", "paper_summary_zh": "與固定或可變速率影像編碼不同，漸進式影像編碼 (PIC)\n旨在將各種品質的影像壓縮成單一比特串流，\n增加比特串流利用率的多功能性，並提供高\n壓縮效率，以與同播壓縮相比。基於神經網路 (NN) 的 PIC 研究仍處於早期階段，主要專注於\n以分層方式將不同的量化步驟大小應用於轉換後的潛在表示。這些方法旨在僅壓縮\n隨著品質提升而漸進式新增的資訊，考量到較低品質壓縮的較寬量化區間包含多個\n較高品質壓縮的較窄子區間。然而，現有方法基於手工製作的量化層級，導致\n次佳的壓縮效率。在本文中，我們提出一個基於 NN 的漸進式編碼方法，首先利用學習的量化步驟大小\n透過學習每個量化層。我們也納入選擇性壓縮，其中僅壓縮每個量化層的基本表示元件。我們證明我們的\n方法比現有方法達到顯著更高的編碼效率，並減少解碼時間和模型大小。", "author": "Jooyoung Lee et.al.", "authors": "Jooyoung Lee, Se Yoon Jeong, Munchurl Kim", "id": "2408.12150v1", "paper_url": "http://arxiv.org/abs/2408.12150v1", "repo": "null"}}