{"2411.08024": {"publish_time": "2024-11-12", "title": "Leonardo vindicated: Pythagorean trees for minimal reconstruction of the natural branching structures", "paper_summary": "Trees continue to fascinate with their natural beauty and as engineering\nmasterpieces optimal with respect to several independent criteria. Pythagorean\ntree is a well-known fractal design that realistically mimics the natural tree\nbranching structures. We study various types of Pythagorean-like fractal trees\nwith different shapes of the base, branching angles and relaxed scales in an\nattempt to identify and explain which variants are the closest match to the\nbranching structures commonly observed in the natural world. Pursuing\nsimultaneously the realism and minimalism of the fractal tree model, we have\ndeveloped a flexibly parameterised and fast algorithm to grow and visually\nexamine deep Pythagorean-inspired fractal trees with the capability to orderly\nover- or underestimate the Leonardo da Vinci's tree branching rule as well as\ncontrol various imbalances and branching angles. We tested the realism of the\ngenerated fractal tree images by means of the classification accuracy of\ndetecting natural tree with the transfer-trained deep Convolutional Neural\nNetworks (CNNs). Having empirically established the parameters of the fractal\ntrees that maximize the CNN's natural tree class classification accuracy we\nhave translated them back to the scales and angles of branches and came to the\ninteresting conclusions that support the da Vinci branching rule and golden\nratio based scaling for both the shape of the branch and imbalance between the\nchild branches, and claim the flexibly parameterized fractal trees can be used\nto generate artificial examples to train robust detectors of different species\nof trees.", "paper_summary_zh": "樹木持續以其自然美景和作為工程傑作著迷，在幾個獨立標準方面達到最佳化。畢氏樹是一種著名的分形設計，逼真地模擬自然樹木分枝結構。我們研究各種畢氏分形樹，它們具有不同形狀的基底、分枝角度和放鬆比例，試圖找出並解釋哪些變體最接近自然界中常見的分枝結構。同時追求分形樹模型的寫實主義和極簡主義，我們開發了一種靈活參數化且快速的演算法，用於生長和視覺檢查深度畢氏靈感分形樹，並有能力有條理地高估或低估李奧納多·達文西的樹木分枝規則，以及控制各種不平衡和分枝角度。我們透過轉移訓練深度卷積神經網路 (CNN) 偵測自然樹木的分類準確度，來測試所生成分形樹影像的寫實度。在經驗上建立最大化 CNN 自然樹類別分類準確度的分形樹參數後，我們已將它們轉換回分枝的比例和角度，並得出有趣的結論，支持達文西分枝規則和黃金比例，作為分枝形狀和子分枝之間不平衡的基礎，並宣稱靈活參數化的分形樹可用於產生人工範例，以訓練不同樹種的強健偵測器。", "author": "Dymitr Ruta et.al.", "authors": "Dymitr Ruta, Corrado Mio, Ernesto Damiani", "id": "2411.08024v1", "paper_url": "http://arxiv.org/abs/2411.08024v1", "repo": "null"}}