{"2501.12339": {"publish_time": "2025-01-21", "title": "Treefix: Enabling Execution with a Tree of Prefixes", "paper_summary": "The ability to execute code is a prerequisite for various dynamic program\nanalyses. Learning-guided execution has been proposed as an approach to enable\nthe execution of arbitrary code snippets by letting a neural model predict\nlikely values for any missing variables. Although state-of-the-art\nlearning-guided execution approaches, such as LExecutor, can enable the\nexecution of a relative high amount of code, they are limited to predicting a\nrestricted set of possible values and do not use any feedback from previous\nexecutions to execute even more code. This paper presents Treefix, a novel\nlearning-guided execution approach that leverages LLMs to iteratively create\ncode prefixes that enable the execution of a given code snippet. The approach\naddresses the problem in a multi-step fashion, where each step uses feedback\nabout the code snippet and its execution to instruct an LLM to improve a\npreviously generated prefix. This process iteratively creates a tree of\nprefixes, a subset of which is returned to the user as prefixes that maximize\nthe number of executed lines in the code snippet. In our experiments with two\ndatasets of Python code snippets, Treefix achieves 25% and 7% more coverage\nrelative to the current state of the art in learning-guided execution, covering\na total of 84% and 82% of all lines in the code snippets.", "paper_summary_zh": "執行程式碼的能力是各種動態程式分析的前提。學習導向執行已被提議為一種方法，讓神經模型預測任何遺失變數的可能值，從而能夠執行任意程式碼片段。儘管最先進的學習導向執行方法（例如 LExecutor）可以執行相對大量的程式碼，但它們僅限於預測一組可能的受限值，並且不使用先前執行的任何回饋來執行更多程式碼。本文提出 Treefix，這是一種新穎的學習導向執行方法，它利用 LLM 迭代建立程式碼前綴，以執行給定的程式碼片段。該方法以多步驟方式解決問題，其中每一步都使用關於程式碼片段及其執行的回饋，來指導 LLM 改進先前生成的字首。此過程反覆建立一個前綴樹，其中的一部分作為前綴回傳給使用者，以最大化程式碼片段中執行行的數量。在我們使用兩個 Python 程式碼片段資料集進行的實驗中，Treefix 在學習導向執行中取得了比目前最先進的技術高出 25% 和 7% 的覆蓋率，總共涵蓋了程式碼片段中所有行的 84% 和 82%。", "author": "Beatriz Souza et.al.", "authors": "Beatriz Souza, Michael Pradel", "id": "2501.12339v1", "paper_url": "http://arxiv.org/abs/2501.12339v1", "repo": "null"}}