{"2410.19291": {"publish_time": "2024-10-25", "title": "A Stock Price Prediction Approach Based on Time Series Decomposition and Multi-Scale CNN using OHLCT Images", "paper_summary": "Stock price fluctuations are influenced by a variety of factors, including\nmacroeconomic conditions, government policies, and market sentiment, which\ntogether make price movements complex and difficult to predict. Despite many\nstudies aimed at enhancing stock price prediction models, challenges such as\ndata noise, model overfitting, and lack of interpretability are still\nencountered. To address these issues and improve prediction accuracy, this\npaper proposes a novel method, named Sequence-based Multiscale Fusion\nRegression Convolutional Neural Network (SMSFR-CNN), for predicting stock price\nmovements in the China A-share market. By utilizing CNN to learn sequential\nfeatures and combining them with image features, we improve the accuracy of\nstock trend prediction on the A-share market stock dataset. This approach\nreduces the search space for image features, stabilizes, and accelerates the\ntraining process. Extensive comparative experiments on 4,454 A-share stocks\nshow that the proposed model achieves 61.15% for positive predictive value and\n63.37% for negative predictive value of the stock price trend over the next 5\ndays, resulting in a total profit of 165.09%.", "paper_summary_zh": "股票價格波動受多種因素影響，包括宏觀經濟環境、政府政策和市場情緒，這些因素共同導致價格走勢複雜且難以預測。儘管有許多研究旨在增強股票價格預測模型，但仍會遇到諸如數據雜訊、模型過擬合和缺乏可解釋性等挑戰。為了解決這些問題並提高預測準確性，本文提出了一種名為基於序列的多尺度融合回歸卷積神經網路 (SMSFR-CNN) 的新方法，用於預測中國 A 股市場的股票價格走勢。通過利用 CNN 學習序列特徵並將其與影像特徵相結合，我們提高了對 A 股市場股票數據集的股票趨勢預測準確性。這種方法縮小了影像特徵的搜索空間，並穩定並加速了訓練過程。對 4,454 隻 A 股進行的廣泛比較實驗表明，所提出的模型對未來 5 天的股票價格趨勢的陽性預測值達到 61.15%，負面預測值達到 63.37%，總利潤達到 165.09%。", "author": "Zhiyuan Pei et.al.", "authors": "Zhiyuan Pei, Jianqi Yan, Jin Yan, Bailing Yang, Ziyuan Li, Lin Zhang, Xin Liu, Yang Zhang", "id": "2410.19291v1", "paper_url": "http://arxiv.org/abs/2410.19291v1", "repo": "null"}}