{"2406.07888": {"publish_time": "2024-06-12", "title": "Classification Modeling with RNN-Based, Random Forest, and XGBoost for Imbalanced Data: A Case of Early Crash Detection in ASEAN-5 Stock Markets", "paper_summary": "This research aims to evaluate the performance of several Recurrent Neural\nNetwork (RNN) architectures including Simple RNN, Gated Recurrent Units (GRU),\nand Long Short-Term Memory (LSTM), compared to classic algorithms such as\nRandom Forest and XGBoost in building classification models for early crash\ndetection in ASEAN-5 stock markets. The study is examined using imbalanced\ndata, which is common due to the rarity of market crashes. The study analyzes\ndaily data from 2010 to 2023 across the major stock markets of the ASEAN-5\ncountries, including Indonesia, Malaysia, Singapore, Thailand, and Philippines.\nMarket crash is identified as the target variable when the major stock price\nindices fall below the Value at Risk (VaR) thresholds of 5%, 2.5% and 1%.\npredictors involving technical indicators of major local and global markets as\nwell as commodity markets. This study includes 213 predictors with their\nrespective lags (5, 10, 15, 22, 50, 200) and uses a time step of 7, expanding\nthe total number of predictors to 1491. The challenge of data imbalance is\naddressed with SMOTE-ENN. The results show that all RNN-Based architectures\noutperform Random Forest and XGBoost. Among the various RNN architectures,\nSimple RNN stands out as the most superior, mainly due to the data\ncharacteristics that are not overly complex and focus more on short-term\ninformation. This study enhances and extends the range of phenomena observed in\nprevious studies by incorporating variables like different geographical zones\nand time periods, as well as methodological adjustments.", "paper_summary_zh": "本研究旨在評估幾種遞迴神經網路 (RNN) 架構的效能，包括簡單 RNN、門控遞迴單元 (GRU) 和長短期記憶 (LSTM)，並與隨機森林和 XGBoost 等經典演算法進行比較，以建立分類模型，用於東協 5 國股市的早期崩盤偵測。本研究使用不平衡資料進行檢驗，這在市場崩盤的罕見情況下很常見。本研究分析了 2010 年至 2023 年期間東協 5 國（包括印尼、馬來西亞、新加坡、泰國和菲律賓）主要股市中的每日資料。當主要股價指數跌破 5%、2.5% 和 1% 的風險價值 (VaR) 閾值時，市場崩盤被認定為目標變數。預測因子涉及主要本地和全球市場以及商品市場的技術指標。本研究包含 213 個預測因子及其各自的滯後 (5、10、15、22、50、200)，並使用 7 的時間步長，將預測因子的總數擴充至 1491。資料不平衡的挑戰使用 SMOTE-ENN 來解決。結果顯示所有基於 RNN 的架構都優於隨機森林和 XGBoost。在各種 RNN 架構中，簡單 RNN 表現最為出色，這主要是因為資料特性並非過於複雜，且更注重短期資訊。本研究透過納入不同地理區域和時間段等變數，以及方法調整，擴展並延伸了先前研究中觀察到的現象範圍。", "author": "Deri Siswara et.al.", "authors": "Deri Siswara, Agus M. Soleh, Aji Hamim Wigena", "id": "2406.07888v1", "paper_url": "http://arxiv.org/abs/2406.07888v1", "repo": "null"}}