{"2410.16251": {"publish_time": "2024-10-21", "title": "Can Knowledge Editing Really Correct Hallucinations?", "paper_summary": "Large Language Models (LLMs) suffer from hallucinations, referring to the\nnon-factual information in generated content, despite their superior capacities\nacross tasks. Meanwhile, knowledge editing has been developed as a new popular\nparadigm to correct the erroneous factual knowledge encoded in LLMs with the\nadvantage of avoiding retraining from scratch. However, one common issue of\nexisting evaluation datasets for knowledge editing is that they do not ensure\nLLMs actually generate hallucinated answers to the evaluation questions before\nediting. When LLMs are evaluated on such datasets after being edited by\ndifferent techniques, it is hard to directly adopt the performance to assess\nthe effectiveness of different knowledge editing methods in correcting\nhallucinations. Thus, the fundamental question remains insufficiently\nvalidated: Can knowledge editing really correct hallucinations in LLMs? We\nproposed HalluEditBench to holistically benchmark knowledge editing methods in\ncorrecting real-world hallucinations. First, we rigorously construct a massive\nhallucination dataset with 9 domains, 26 topics and more than 6,000\nhallucinations. Then, we assess the performance of knowledge editing methods in\na holistic way on five dimensions including Efficacy, Generalization,\nPortability, Locality, and Robustness. Through HalluEditBench, we have provided\nnew insights into the potentials and limitations of different knowledge editing\nmethods in correcting hallucinations, which could inspire future improvements\nand facilitate the progress in the field of knowledge editing.", "paper_summary_zh": "大型語言模型 (LLM) 儘管在各項任務中表現優異，但仍存在產生的內容中出現非事實資訊的幻覺問題。與此同時，知識編輯已被開發為一種新的流行範例，用於修正 LLM 中編碼的錯誤事實知識，並具有避免從頭開始重新訓練的優點。然而，現有知識編輯評估資料集的一個常見問題是，它們並未確保 LLM 在編輯前實際對評估問題產生幻覺答案。當 LLM 在經過不同技術編輯後在這些資料集上進行評估時，很難直接採用效能來評估不同知識編輯方法在修正幻覺方面的有效性。因此，一個基本問題仍然驗證不足：知識編輯是否真的可以修正 LLM 中的幻覺？我們提出了 HalluEditBench，以全面評量知識編輯方法在修正真實世界幻覺方面的表現。首先，我們嚴謹地建構了一個包含 9 個領域、26 個主題和超過 6,000 個幻覺的龐大幻覺資料集。然後，我們在包括效能、概化、可攜性、局部性和健全性等五個面向全面評估知識編輯方法的表現。透過 HalluEditBench，我們提供了對不同知識編輯方法在修正幻覺方面的潛力和限制的新見解，這可以激勵未來的改進，並促進知識編輯領域的進展。", "author": "Baixiang Huang et.al.", "authors": "Baixiang Huang, Canyu Chen, Xiongxiao Xu, Ali Payani, Kai Shu", "id": "2410.16251v1", "paper_url": "http://arxiv.org/abs/2410.16251v1", "repo": "https://github.com/llm-editing/HalluEditBench"}}