{"2411.17697": {"publish_time": "2024-11-26", "title": "StableAnimator: High-Quality Identity-Preserving Human Image Animation", "paper_summary": "Current diffusion models for human image animation struggle to ensure\nidentity (ID) consistency. This paper presents StableAnimator, the first\nend-to-end ID-preserving video diffusion framework, which synthesizes\nhigh-quality videos without any post-processing, conditioned on a reference\nimage and a sequence of poses. Building upon a video diffusion model,\nStableAnimator contains carefully designed modules for both training and\ninference striving for identity consistency. In particular, StableAnimator\nbegins by computing image and face embeddings with off-the-shelf extractors,\nrespectively and face embeddings are further refined by interacting with image\nembeddings using a global content-aware Face Encoder. Then, StableAnimator\nintroduces a novel distribution-aware ID Adapter that prevents interference\ncaused by temporal layers while preserving ID via alignment. During inference,\nwe propose a novel Hamilton-Jacobi-Bellman (HJB) equation-based optimization to\nfurther enhance the face quality. We demonstrate that solving the HJB equation\ncan be integrated into the diffusion denoising process, and the resulting\nsolution constrains the denoising path and thus benefits ID preservation.\nExperiments on multiple benchmarks show the effectiveness of StableAnimator\nboth qualitatively and quantitatively.", "paper_summary_zh": "目前的人像動畫擴散模型難以確保身分 (ID) 的一致性。本文提出 StableAnimator，第一個端對端的 ID 保留影片擴散架構，可以在不進行任何後處理的情況下，根據參考影像和一連串姿勢合成高品質影片。在影片擴散模型的基礎上，StableAnimator 包含仔細設計的模組，用於訓練和推論，以追求身分一致性。特別是，StableAnimator 先使用現成的萃取器分別計算影像和臉部嵌入，而臉部嵌入會進一步透過與影像嵌入互動，使用全球內容感知臉部編碼器進行改善。接著，StableAnimator 提出一個新穎的分布感知 ID 適配器，可防止時間層造成的干擾，同時透過對齊保留 ID。在推論期間，我們提出一個新穎的 Hamilton-Jacobi-Bellman (HJB) 方程式最佳化，以進一步提升臉部品質。我們證明了解決 HJB 方程式可以整合到擴散去噪過程中，而產生的解會限制去噪路徑，進而有利於 ID 保留。在多個基準測試上的實驗顯示，StableAnimator 在質量和量化上都展現出其有效性。", "author": "Shuyuan Tu et.al.", "authors": "Shuyuan Tu, Zhen Xing, Xintong Han, Zhi-Qi Cheng, Qi Dai, Chong Luo, Zuxuan Wu", "id": "2411.17697v1", "paper_url": "http://arxiv.org/abs/2411.17697v1", "repo": "https://github.com/Francis-Rings/StableAnimator"}}