{"2501.19042": {"publish_time": "2025-01-31", "title": "Swarm-Gen: Fast Generation of Diverse Feasible Swarm Behaviors", "paper_summary": "Coordination behavior in robot swarms is inherently multi-modal in nature.\nThat is, there are numerous ways in which a swarm of robots can avoid\ninter-agent collisions and reach their respective goals. However, the problem\nof generating diverse and feasible swarm behaviors in a scalable manner remains\nlargely unaddressed. In this paper, we fill this gap by combining generative\nmodels with a safety-filter (SF). Specifically, we sample diverse trajectories\nfrom a learned generative model which is subsequently projected onto the\nfeasible set using the SF. We experiment with two choices for generative\nmodels, namely: Conditional Variational Autoencoder (CVAE) and Vector-Quantized\nVariational Autoencoder (VQ-VAE). We highlight the trade-offs these two models\nprovide in terms of computation time and trajectory diversity. We develop a\ncustom solver for our SF and equip it with a neural network that predicts\ncontext-specific initialization. Thecinitialization network is trained in a\nself-supervised manner, taking advantage of the differentiability of the SF\nsolver. We provide two sets of empirical results. First, we demonstrate that we\ncan generate a large set of multi-modal, feasible trajectories, simulating\ndiverse swarm behaviors, within a few tens of milliseconds. Second, we show\nthat our initialization network provides faster convergence of our SF solver\nvis-a-vis other alternative heuristics.", "paper_summary_zh": "機器人蜂群中的協調行為本質上是多模態的。\n也就是說，機器人蜂群有許多方法可以避免機器人之間的碰撞並到達各自的目標。然而，以可擴充的方式產生多樣化且可行的蜂群行為的問題在很大程度上仍未解決。在本文中，我們透過結合生成模型和安全過濾器 (SF) 來填補此空白。具體來說，我們從一個學習的生成模型中取樣多樣化的軌跡，然後使用 SF 將其投影到可行集合上。我們實驗了兩種生成模型的選擇，即條件變異自動編碼器 (CVAE) 和向量量化變異自動編碼器 (VQ-VAE)。我們強調了這兩個模型在計算時間和軌跡多樣性方面的權衡取捨。我們為我們的 SF 開發了一個自訂求解器，並配備了一個預測特定於情境初始化的神經網路。初始化網路以自監督的方式進行訓練，利用 SF 求解器的可微分性。我們提供了兩組經驗結果。首先，我們證明我們可以在幾十毫秒內生成大量多模態、可行的軌跡，模擬多樣化的蜂群行為。其次，我們證明我們的初始化網路提供比其他替代啟發式方法更快的 SF 求解器收斂性。", "author": "Simon Idoko et.al.", "authors": "Simon Idoko, B. Bhanu Teja, K. Madhava Krishna, Arun Kumar Singh", "id": "2501.19042v1", "paper_url": "http://arxiv.org/abs/2501.19042v1", "repo": "https://github.com/cisimon7/swarmgen"}}