{"2407.11594": {"publish_time": "2024-07-16", "title": "DiNO-Diffusion. Scaling Medical Diffusion via Self-Supervised Pre-Training", "paper_summary": "Diffusion models (DMs) have emerged as powerful foundation models for a\nvariety of tasks, with a large focus in synthetic image generation. However,\ntheir requirement of large annotated datasets for training limits their\napplicability in medical imaging, where datasets are typically smaller and\nsparsely annotated. We introduce DiNO-Diffusion, a self-supervised method for\ntraining latent diffusion models (LDMs) that conditions the generation process\non image embeddings extracted from DiNO. By eliminating the reliance on\nannotations, our training leverages over 868k unlabelled images from public\nchest X-Ray (CXR) datasets. Despite being self-supervised, DiNO-Diffusion shows\ncomprehensive manifold coverage, with FID scores as low as 4.7, and emerging\nproperties when evaluated in downstream tasks. It can be used to generate\nsemantically-diverse synthetic datasets even from small data pools,\ndemonstrating up to 20% AUC increase in classification performance when used\nfor data augmentation. Images were generated with different sampling strategies\nover the DiNO embedding manifold and using real images as a starting point.\nResults suggest, DiNO-Diffusion could facilitate the creation of large datasets\nfor flexible training of downstream AI models from limited amount of real data,\nwhile also holding potential for privacy preservation. Additionally,\nDiNO-Diffusion demonstrates zero-shot segmentation performance of up to 84.4%\nDice score when evaluating lung lobe segmentation. This evidences good CXR\nimage-anatomy alignment, akin to segmenting using textual descriptors on\nvanilla DMs. Finally, DiNO-Diffusion can be easily adapted to other medical\nimaging modalities or state-of-the-art diffusion models, opening the door for\nlarge-scale, multi-domain image generation pipelines for medical imaging.", "paper_summary_zh": "擴散模型 (DM) 已成為各種任務中強大的基礎模型，特別是合成影像生成。然而，它們在訓練中對大型標註資料集的要求限制了它們在醫療影像中的應用，而醫療影像的資料集通常較小且標註稀疏。我們引入了 DiNO-Diffusion，這是一種用於訓練條件生成過程的潛在擴散模型 (LDM) 的自監督方法，該過程基於從 DiNO 中提取的影像嵌入。透過消除對標註的依賴，我們的訓練利用了來自公共胸部 X 光 (CXR) 資料集的超過 868k 張未標註影像。儘管是自監督的，但 DiNO-Diffusion 顯示出全面的流形覆蓋，FID 分數低至 4.7，並且在評估下游任務時出現了新興的屬性。它可用於從小型資料庫生成語義多樣的合成資料集，在用於資料擴充時，分類效能提升幅度高達 20% AUC。影像是在 DiNO 嵌入流形上使用不同的取樣策略生成的，並使用真實影像作為起點。結果顯示，DiNO-Diffusion 可以促進從有限的真實資料中靈活訓練下游 AI 模型的大型資料集的建立，同時也具有隱私保護的潛力。此外，DiNO-Diffusion 在評估肺葉分割時展示了高達 84.4% 的 Dice 分數的零次學習分割效能。這證明了良好的 CXR 影像解剖對齊，類似於在香草 DM 上使用文字描述符進行分割。最後，DiNO-Diffusion 可以輕鬆適應其他醫療影像方式或最先進的擴散模型，為醫療影像的大規模、多領域影像生成管道開啟了大門。", "author": "Guillermo Jimenez-Perez et.al.", "authors": "Guillermo Jimenez-Perez, Pedro Osorio, Josef Cersovsky, Javier Montalt-Tordera, Jens Hooge, Steffen Vogler, Sadegh Mohammadi", "id": "2407.11594v1", "paper_url": "http://arxiv.org/abs/2407.11594v1", "repo": "null"}}