{"2411.10937": {"publish_time": "2024-11-17", "title": "Memory-Augmented Multimodal LLMs for Surgical VQA via Self-Contained Inquiry", "paper_summary": "Comprehensively understanding surgical scenes in Surgical Visual Question\nAnswering (Surgical VQA) requires reasoning over multiple objects. Previous\napproaches address this task using cross-modal fusion strategies to enhance\nreasoning ability. However, these methods often struggle with limited scene\nunderstanding and question comprehension, and some rely on external resources\n(e.g., pre-extracted object features), which can introduce errors and\ngeneralize poorly across diverse surgical environments. To address these\nchallenges, we propose SCAN, a simple yet effective memory-augmented framework\nthat leverages Multimodal LLMs to improve surgical context comprehension via\nSelf-Contained Inquiry. SCAN operates autonomously, generating two types of\nmemory for context augmentation: Direct Memory (DM), which provides multiple\ncandidates (or hints) to the final answer, and Indirect Memory (IM), which\nconsists of self-contained question-hint pairs to capture broader scene\ncontext. DM directly assists in answering the question, while IM enhances\nunderstanding of the surgical scene beyond the immediate query. Reasoning over\nthese object-aware memories enables the model to accurately interpret images\nand respond to questions. Extensive experiments on three publicly available\nSurgical VQA datasets demonstrate that SCAN achieves state-of-the-art\nperformance, offering improved accuracy and robustness across various surgical\nscenarios.", "paper_summary_zh": "全面理解外科視覺問題回答（外科 VQA）中的外科場景需要對多個物件進行推理。先前的\n方法使用跨模態融合策略來解決此任務，以增強推理能力。然而，這些方法通常難以應付受限的場景\n理解和問題理解，有些方法依賴於外部資源（例如，預先提取的物件特徵），這可能會引入錯誤，\n並且在不同的外科環境中泛化性差。為了解決這些挑戰，我們提出了 SCAN，一個簡單但有效的記憶增強框架\n，它利用多模態 LLM 來透過自我包含式詢問來改善外科背景理解。SCAN 自主運作，產生兩種記憶類型\n用於背景擴充：直接記憶（DM），它為最終答案提供多個候選（或提示），以及間接記憶（IM），它\n包含自我包含式的問題提示配對，以擷取更廣泛的場景背景。DM 直接協助回答問題，而 IM 增強\n對外科場景的理解，超越立即的查詢。對這些物件感知記憶進行推理，使模型能夠準確地解釋影像\n並回答問題。在三個公開可用的外科 VQA 資料集上進行的廣泛實驗證明，SCAN 達到了最先進的\n效能，在各種外科場景中提供更高的準確性和穩健性。", "author": "Wenjun Hou et.al.", "authors": "Wenjun Hou, Yi Cheng, Kaishuai Xu, Yan Hu, Wenjie Li, Jiang Liu", "id": "2411.10937v1", "paper_url": "http://arxiv.org/abs/2411.10937v1", "repo": "null"}}