{"2406.02169": {"publish_time": "2024-06-04", "title": "A multilingual dataset for offensive language and hate speech detection for hausa, yoruba and igbo languages", "paper_summary": "The proliferation of online offensive language necessitates the development\nof effective detection mechanisms, especially in multilingual contexts. This\nstudy addresses the challenge by developing and introducing novel datasets for\noffensive language detection in three major Nigerian languages: Hausa, Yoruba,\nand Igbo. We collected data from Twitter and manually annotated it to create\ndatasets for each of the three languages, using native speakers. We used\npre-trained language models to evaluate their efficacy in detecting offensive\nlanguage in our datasets. The best-performing model achieved an accuracy of\n90\\%. To further support research in offensive language detection, we plan to\nmake the dataset and our models publicly available.", "paper_summary_zh": "由於網路攻擊性語言的擴散，特別是在多語言的語境中，有必要開發有效的偵測機制。本研究透過開發和導入三種奈及利亞主要語言（豪薩語、約魯巴語和伊博語）的攻擊性語言偵測新資料集來應對此挑戰。我們從 Twitter 收集資料並手動註解，使用母語人士為三種語言建立資料集。我們使用預先訓練的語言模型來評估它們在我們的資料集中偵測攻擊性語言的效能。表現最佳的模型達到了 90% 的準確度。為了進一步支援攻擊性語言偵測的研究，我們計畫公開發布資料集和我們的模型。", "author": "Saminu Mohammad Aliyu et.al.", "authors": "Saminu Mohammad Aliyu, Gregory Maksha Wajiga, Muhammad Murtala", "id": "2406.02169v1", "paper_url": "http://arxiv.org/abs/2406.02169v1", "repo": "null"}}