{"2405.15179": {"publish_time": "2024-05-24", "title": "VB-LoRA: Extreme Parameter Efficient Fine-Tuning with Vector Banks", "paper_summary": "As the adoption of large language models increases and the need for per-user\nor per-task model customization grows, the parameter-efficient fine-tuning\n(PEFT) methods, such as low-rank adaptation (LoRA) and its variants, incur\nsubstantial storage and transmission costs. To further reduce stored\nparameters, we introduce a \"divide-and-share\" paradigm that breaks the barriers\nof low-rank decomposition across matrix dimensions, modules and layers by\nsharing parameters globally via a \\textit{vector bank}. As an instantiation of\nthe paradigm to LoRA, our proposed VB-LoRA composites \\textit{all} the low-rank\nmatrices of LoRA from a shared \\textit{vector bank} with a differentiable\ntop-$k$ admixture module. VB-LoRA achieves extreme parameter efficiency while\nmaintaining comparable or better performance compared to state-of-the-art PEFT\nmethods. Extensive experiments demonstrate the effectiveness of VB-LoRA on\nnatural language understanding, natural language generation, and instruction\ntuning tasks. When fine-tuning the Llama2-13B model, VB-LoRA only uses 0.4\\% of\nLoRA's stored parameters yet attaining superior results. Our source code is\navailable at \\url{https://github.com/leo-yangli/VB-LoRA}.", "paper_summary_zh": "隨著大型語言模型的採用增加，以及對每個使用者或每個任務模型自訂化的需求增加，參數有效微調 (PEFT) 方法（例如低秩適應 (LoRA) 及其變體）會產生大量的儲存和傳輸成本。為了進一步減少儲存的參數，我們引入了「分割和共享」範例，它透過共享參數打破了跨矩陣維度、模組和層的低秩分解障礙，並透過\\textit{向量庫}在全球範圍內共享參數。作為 LoRA 範例的實例，我們提出的 VB-LoRA 複合了 LoRA 的\\textit{所有}低秩矩陣，這些矩陣來自於一個共享的\\textit{向量庫}，並有一個可微分的頂層-$k$混合模組。VB-LoRA 達到了極端的參數效率，同時與最先進的 PEFT 方法相比，維持了相當或更好的效能。廣泛的實驗證明了 VB-LoRA 在自然語言理解、自然語言生成和指令調整任務上的有效性。在微調 Llama2-13B 模型時，VB-LoRA 只使用了 LoRA 儲存參數的 0.4%，卻達到了更好的結果。我們的原始碼可以在 \\url{https://github.com/leo-yangli/VB-LoRA} 取得。", "author": "Yang Li et.al.", "authors": "Yang Li, Shaobo Han, Shihao Ji", "id": "2405.15179v1", "paper_url": "http://arxiv.org/abs/2405.15179v1", "repo": "null"}}