{"2407.02994": {"publish_time": "2024-07-03", "title": "MedPix 2.0: A Comprehensive Multimodal Biomedical Dataset for Advanced AI Applications", "paper_summary": "The increasing interest in developing Artificial Intelligence applications in\nthe medical domain, suffers from the lack of high-quality dataset, mainly due\nto privacy-related issues. Moreover, the recent rising of Multimodal Large\nLanguage Models (MLLM) leads to a need for multimodal medical datasets, where\nclinical reports and findings are attached to the corresponding CT or MR scans.\nThis paper illustrates the entire workflow for building the data set MedPix\n2.0. Starting from the well-known multimodal dataset\nMedPix\\textsuperscript{\\textregistered}, mainly used by physicians, nurses and\nhealthcare students for Continuing Medical Education purposes, a semi-automatic\npipeline was developed to extract visual and textual data followed by a manual\ncuring procedure where noisy samples were removed, thus creating a MongoDB\ndatabase. Along with the dataset, we developed a GUI aimed at navigating\nefficiently the MongoDB instance, and obtaining the raw data that can be easily\nused for training and/or fine-tuning MLLMs. To enforce this point, we also\npropose a CLIP-based model trained on MedPix 2.0 for scan classification tasks.", "paper_summary_zh": "隨著在醫療領域開發人工智慧應用程式的興趣日益增加，但由於隱私相關問題，導致缺乏高品質的資料集。此外，多模態大型語言模型 (MLLM) 的興起，需要建立多模態醫療資料集，其中臨床報告和發現會附加到對應的電腦斷層掃描或核磁共振掃描。本文說明建立資料集 MedPix 2.0 的完整工作流程。從廣為人知的由醫師、護理師和醫療保健學生主要用於持續醫療教育目的的多模態資料集 MedPix\\textsuperscript{\\textregistered} 開始，開發了一個半自動化管道來萃取視覺和文字資料，接著進行手動清理程序移除雜訊樣本，進而建立一個 MongoDB 資料庫。隨著資料集，我們開發了一個 GUI，旨在有效率地瀏覽 MongoDB 執行個體，並取得可用於訓練和/或微調 MLLM 的原始資料。為了強調這一點，我們也提出一個在 MedPix 2.0 上訓練的基於 CLIP 的模型，用於掃描分類任務。", "author": "Irene Siragusa et.al.", "authors": "Irene Siragusa, Salvatore Contino, Massimo La Ciura, Rosario Alicata, Roberto Pirrone", "id": "2407.02994v1", "paper_url": "http://arxiv.org/abs/2407.02994v1", "repo": "https://github.com/chilab1/medpix-2.0"}}