{"2406.16829": {"publish_time": "2024-06-24", "title": "Understanding and Mitigating Tokenization Bias in Language Models", "paper_summary": "State-of-the-art language models are autoregressive and operate on subword\nunits known as tokens. Specifically, one must encode the conditioning string\ninto a list of tokens before passing to the language models for next-token\nprediction. We show that, for encoding schemes such as maximum prefix matching,\ntokenization induces a sampling bias that cannot be mitigated with more\ntraining or data. To counter this universal problem, we propose a novel\nalgorithm to obtain unbiased estimates from a model that was trained on\ntokenized data. Our method does not require finetuning the model, and its\ncomplexity, defined as the number of model runs, scales linearly with the\nsequence length. As a consequence, we show that one can simulate token-free\nbehavior from a tokenized language model. We empirically verify the correctness\nof our method through a Markov-chain setup, where it accurately recovers the\ntransition probabilities, as opposed to the conventional method of directly\nprompting tokens into the language model.", "paper_summary_zh": "最先进的语言模型是自回归的，并且在称为标记的子词单位上运行。具体来说，在将条件字符串传递给语言模型进行下一个标记预测之前，必须将其编码为标记列表。我们表明，对于最大前缀匹配等编码方案，标记化会引起采样偏差，而无法通过更多训练或数据来缓解。为了解决这个普遍问题，我们提出了一种新算法，以从在标记化数据上训练的模型中获得无偏估计。我们的方法不需要微调模型，其复杂性（定义为模型运行次数）与序列长度线性缩放。因此，我们表明可以从标记化语言模型模拟无标记行为。我们通过马尔可夫链设置经验验证了我们方法的正确性，在该设置中，它准确地恢复了转移概率，而不是直接将标记提示到语言模型中的传统方法。", "author": "Buu Phan et.al.", "authors": "Buu Phan, Marton Havasi, Matthew Muckley, Karen Ullrich", "id": "2406.16829v1", "paper_url": "http://arxiv.org/abs/2406.16829v1", "repo": "null"}}