{"2406.03855": {"publish_time": "2024-06-06", "title": "Performance of large language models in numerical vs. semantic medical knowledge: Benchmarking on evidence-based Q&As", "paper_summary": "Clinical problem-solving requires processing of semantic medical knowledge\nsuch as illness scripts and numerical medical knowledge of diagnostic tests for\nevidence-based decision-making. As large language models (LLMs) show promising\nresults in many aspects of language-based clinical practice, their ability to\ngenerate non-language evidence-based answers to clinical questions is\ninherently limited by tokenization. Therefore, we evaluated LLMs' performance\non two question types: numeric (correlating findings) and semantic\n(differentiating entities) while examining differences within and between LLMs\nin medical aspects and comparing their performance to humans. To generate\nstraightforward multi-choice questions and answers (QAs) based on\nevidence-based medicine (EBM), we used a comprehensive medical knowledge graph\n(encompassed data from more than 50,00 peer-reviewed articles) and created the\n\"EBMQA\". EBMQA contains 105,000 QAs labeled with medical and non-medical topics\nand classified into numerical or semantic questions. We benchmarked this\ndataset using more than 24,500 QAs on two state-of-the-art LLMs: Chat-GPT4 and\nClaude3-Opus. We evaluated the LLMs accuracy on semantic and numerical question\ntypes and according to sub-labeled topics. For validation, six medical experts\nwere tested on 100 numerical EBMQA questions. We found that both LLMs excelled\nmore in semantic than numerical QAs, with Claude3 surpassing GPT4 in numerical\nQAs. However, both LLMs showed inter and intra gaps in different medical\naspects and remained inferior to humans. Thus, their medical advice should be\naddressed carefully.", "paper_summary_zh": "<paragraph>臨床問題解決需要處理語義醫學知識\n例如疾病腳本和基於證據的決策制定之診斷測試的數值醫學知識。由於大型語言模型 (LLM) 在語言基礎臨床實務的許多方面展現出令人滿意的成果，它們產生非語言、基於證據的臨床問題解答的能力本質上受到標記化的限制。因此，我們評估了 LLM 在兩種問題類型上的表現：數值（相關發現）和語義（區分實體），同時檢視 LLM 在醫學方面的差異，並將其表現與人類進行比較。為了根據循證醫學 (EBM) 產生直接的多重選擇題和解答 (QA)，我們使用了一個全面的醫學知識圖譜（包含來自 50,000 多篇同行評審文章的資料），並建立了「EBMQA」。EBMQA 包含 105,000 個 QA，標記有醫學和非醫學主題，並分類為數值或語義問題。我們使用超過 24,500 個 QA 在兩個最先進的 LLM 上對此資料集進行基準測試：Chat-GPT4 和 Claude3-Opus。我們根據語義和數值問題類型以及次標記主題評估了 LLM 的準確性。為了驗證，六位醫學專家接受了 100 個數值 EBMQA 問題的測試。我們發現，這兩個 LLM 在語義 QA 中的表現都比在數值 QA 中的表現出色，而 Claude3 在數值 QA 中的表現優於 GPT4。然而，這兩個 LLM 在不同的醫學方面都顯示出內部和外部的差距，並且仍然遜於人類。因此，應謹慎對待他們的醫療建議。</paragraph>", "author": "Eden Avnat et.al.", "authors": "Eden Avnat, Michal Levy, Daniel Herstain, Elia Yanko, Daniel Ben Joya, Michal Tzuchman Katz, Dafna Eshel, Sahar Laros, Yael Dagan, Shahar Barami, Joseph Mermelstein, Shahar Ovadia, Noam Shomron, Varda Shalev, Raja-Elie E. Abdulnour", "id": "2406.03855v2", "paper_url": "http://arxiv.org/abs/2406.03855v2", "repo": "null"}}