{"2412.02301": {"publish_time": "2024-12-03", "title": "Large Multimodal Agents for Accurate Phishing Detection with Enhanced Token Optimization and Cost Reduction", "paper_summary": "With the rise of sophisticated phishing attacks, there is a growing need for\neffective and economical detection solutions. This paper explores the use of\nlarge multimodal agents, specifically Gemini 1.5 Flash and GPT-4o mini, to\nanalyze both URLs and webpage screenshots via APIs, thus avoiding the\ncomplexities of training and maintaining AI systems. Our findings indicate that\nintegrating these two data types substantially enhances detection performance\nover using either type alone. However, API usage incurs costs per query that\ndepend on the number of input and output tokens. To address this, we propose a\ntwo-tiered agentic approach: initially, one agent assesses the URL, and if\ninconclusive, a second agent evaluates both the URL and the screenshot. This\nmethod not only maintains robust detection performance but also significantly\nreduces API costs by minimizing unnecessary multi-input queries. Cost analysis\nshows that with the agentic approach, GPT-4o mini can process about 4.2 times\nas many websites per $100 compared to the multimodal approach (107,440 vs.\n25,626), and Gemini 1.5 Flash can process about 2.6 times more websites\n(2,232,142 vs. 862,068). These findings underscore the significant economic\nbenefits of the agentic approach over the multimodal method, providing a viable\nsolution for organizations aiming to leverage advanced AI for phishing\ndetection while controlling expenses.", "paper_summary_zh": "隨著網路釣魚攻擊手法日益精進，對於有效且經濟的偵測解決方案的需求也與日俱增。本論文探討使用大型多模態代理，特別是 Gemini 1.5 Flash 和 GPT-4o mini，透過 API 分析網址和網頁截圖，從而避免訓練和維護 AI 系統的複雜性。我們的研究結果顯示，整合這兩種資料類型可大幅提升偵測效能，優於僅使用單一類型。然而，API 使用會產生每次查詢的成本，取決於輸入和輸出符號的數量。為了解決這個問題，我們提出一個兩層代理方法：最初，一個代理評估網址，如果結果不確定，第二個代理會評估網址和截圖。此方法不僅維持穩健的偵測效能，也透過將不必要的輸入多重查詢降至最低，大幅降低 API 成本。成本分析顯示，使用代理方法，GPT-4o mini 每 100 美元可處理約 4.2 倍的網站，相較於多模態方法（107,440 對 25,626）；而 Gemini 1.5 Flash 可處理約 2.6 倍的網站（2,232,142 對 862,068）。這些發現凸顯了代理方法相較於多模態方法的顯著經濟效益，為組織提供了一個可行的解決方案，讓他們能夠在控制支出的同時，利用先進的 AI 進行網路釣魚偵測。", "author": "Fouad Trad et.al.", "authors": "Fouad Trad, Ali Chehab", "id": "2412.02301v1", "paper_url": "http://arxiv.org/abs/2412.02301v1", "repo": "null"}}