{"2410.14273": {"publish_time": "2024-10-18", "title": "REEF: Representation Encoding Fingerprints for Large Language Models", "paper_summary": "Protecting the intellectual property of open-source Large Language Models\n(LLMs) is very important, because training LLMs costs extensive computational\nresources and data. Therefore, model owners and third parties need to identify\nwhether a suspect model is a subsequent development of the victim model. To\nthis end, we propose a training-free REEF to identify the relationship between\nthe suspect and victim models from the perspective of LLMs' feature\nrepresentations. Specifically, REEF computes and compares the centered kernel\nalignment similarity between the representations of a suspect model and a\nvictim model on the same samples. This training-free REEF does not impair the\nmodel's general capabilities and is robust to sequential fine-tuning, pruning,\nmodel merging, and permutations. In this way, REEF provides a simple and\neffective way for third parties and models' owners to protect LLMs'\nintellectual property together. The code is available at\nhttps://github.com/tmylla/REEF.", "paper_summary_zh": "保護開源大型語言模型 (LLM) 的智慧財產權非常重要，因為訓練 LLM 需要大量的運算資源和資料。因此，模型所有者和第三方需要辨識可疑模型是否是受害模型的後續開發。為此，我們提出一個無需訓練的 REEF，從 LLM 特徵表示的角度來辨識可疑模型和受害模型之間的關係。具體來說，REEF 計算並比較可疑模型和受害模型在相同樣本上的中心化核對齊相似性。這個無需訓練的 REEF 沒有損害模型的一般功能，並且對於循序漸進的微調、剪枝、模型合併和排列組合具有穩健性。這樣，REEF 為第三方和模型所有者提供了一種簡單且有效的方法，可以共同保護 LLM 的智慧財產權。程式碼可於 https://github.com/tmylla/REEF 取得。", "author": "Jie Zhang et.al.", "authors": "Jie Zhang, Dongrui Liu, Chen Qian, Linfeng Zhang, Yong Liu, Yu Qiao, Jing Shao", "id": "2410.14273v1", "paper_url": "http://arxiv.org/abs/2410.14273v1", "repo": "https://github.com/tmylla/reef"}}