{"2405.18553": {"publish_time": "2024-05-28", "title": "The FAIIR Tool: A Conversational AI Agent Assistant for Youth Mental Health Service Provision", "paper_summary": "World's healthcare systems and mental health agencies face both a growing\ndemand for youth mental health services, alongside a simultaneous challenge of\nlimited resources. Given these constraints, this work presents our experience\nin the creation and evaluation of the FAIIR (Frontline Assistant: Issue\nIdentification and Recommendation) tool, an ensemble of domain-adapted and\nfine-tuned transformer models, leveraging natural language processing to\nidentify issues that youth may be experiencing. We explore the technical\ndevelopment, performance, and validation processes leveraged for the FAIIR tool\nin application to situations of frontline crisis response via Kids Help Phone.\nFrontline Crisis Responders assign an issue tag from a defined list following\neach conversation. Assisting with the identification of issues of relevance\nhelps reduce the burden on CRs, ensuring that appropriate resources can be\nprovided and that active rescues and mandatory reporting can take place in\ncritical situations requiring immediate de-escalation.", "paper_summary_zh": "全球的醫療保健系統與心理健康機構面臨著對青少年心理健康服務需求增加的問題，同時也面臨著資源有限的挑戰。在這些限制下，本研究呈現我們在建立與評估 FAIIR（前線助理：問題識別與建議）工具的經驗，它結合了領域適應與微調的轉換器模型，利用自然語言處理來識別青少年可能遭遇的問題。我們探討了 FAIIR 工具在 Kids Help Phone 的前線危機應對情況中所應用的技術開發、效能與驗證程序。前線危機應變人員在每次對話後會從既定的清單中指定一個問題標籤。協助識別相關問題有助於減輕危機應變人員的負擔，確保在緊急情況下可以提供適當的資源，並進行必要的救援與強制通報。", "author": "Stephen Obadinma et.al.", "authors": "Stephen Obadinma, Alia Lachana, Maia Norman, Jocelyn Rankin, Joanna Yu, Xiaodan Zhu, Darren Mastropaolo, Deval Pandya, Roxana Sultan, Elham Dolatabadi", "id": "2405.18553v1", "paper_url": "http://arxiv.org/abs/2405.18553v1", "repo": "null"}}