{"2407.09252": {"publish_time": "2024-07-12", "title": "Context Embeddings for Efficient Answer Generation in RAG", "paper_summary": "Retrieval-Augmented Generation (RAG) allows overcoming the limited knowledge\nof LLMs by extending the input with external information. As a consequence, the\ncontextual inputs to the model become much longer which slows down decoding\ntime directly translating to the time a user has to wait for an answer. We\naddress this challenge by presenting COCOM, an effective context compression\nmethod, reducing long contexts to only a handful of Context Embeddings speeding\nup the generation time by a large margin. Our method allows for different\ncompression rates trading off decoding time for answer quality. Compared to\nearlier methods, COCOM allows for handling multiple contexts more effectively,\nsignificantly reducing decoding time for long inputs. Our method demonstrates a\nspeed-up of up to 5.69 $\\times$ while achieving higher performance compared to\nexisting efficient context compression methods.", "paper_summary_zh": "檢索增強生成 (RAG) 可透過外部資訊擴充輸入，克服 LLM 知識有限的問題。因此，模型的脈絡輸入變得更長，這會直接減慢解碼時間，轉換成使用者必須等待答案的時間。我們透過提出 COCOM 來解決這個挑戰，這是一個有效的脈絡壓縮方法，可將長脈絡縮減為僅少數脈絡嵌入，大幅縮短生成時間。我們的這個方法允許使用不同的壓縮率，在解碼時間和答案品質之間取得平衡。與較早的方法相比，COCOM 能更有效地處理多個脈絡，大幅縮短長輸入的解碼時間。我們的這個方法展示出最高達 5.69 倍的加速，同時與現有的有效脈絡壓縮方法相比，還能獲得更高的效能。", "author": "David Rau et.al.", "authors": "David Rau, Shuai Wang, Hervé Déjean, Stéphane Clinchant", "id": "2407.09252v1", "paper_url": "http://arxiv.org/abs/2407.09252v1", "repo": "null"}}