{"2502.12001": {"publish_time": "2025-02-17", "title": "Merging Language and Domain Specific Models: The Impact on Technical Vocabulary Acquisition", "paper_summary": "This paper investigates the integration of technical vocabulary in merged\nlanguage models. We explore the knowledge transfer mechanisms involved when\ncombining a general-purpose language-specific model with a domain-specific\nmodel, focusing on the resulting model's comprehension of technical jargon. Our\nexperiments analyze the impact of this merging process on the target model's\nproficiency in handling specialized terminology. We present a quantitative\nevaluation of the performance of the merged model, comparing it with that of\nthe individual constituent models. The findings offer insights into the\neffectiveness of different model merging methods for enhancing domain-specific\nknowledge and highlight potential challenges and future directions in\nleveraging these methods for cross-lingual knowledge transfer in Natural\nLanguage Processing.", "paper_summary_zh": "本文探討了技術詞彙在合併語言模型中的整合。我們探討了結合一般用途語言特定模型與特定領域模型時所涉及的知識轉移機制，重點在於所產生模型對技術術語的理解。我們的實驗分析了此合併程序對目標模型處理專業術語能力的影響。我們提出了合併模型效能的量化評估，並將其與個別組成模型的效能進行比較。這些發現提供了見解，說明了不同模型合併方法在增強特定領域知識方面的效能，並強調了利用這些方法進行自然語言處理中跨語言知識轉移的潛在挑戰和未來方向。", "author": "Thibault Rousset et.al.", "authors": "Thibault Rousset, Taisei Kakibuchi, Yusuke Sasaki, Yoshihide Nomura", "id": "2502.12001v1", "paper_url": "http://arxiv.org/abs/2502.12001v1", "repo": "null"}}