{"2406.14459": {"publish_time": "2024-06-20", "title": "Healing Powers of BERT: How Task-Specific Fine-Tuning Recovers Corrupted Language Models", "paper_summary": "Language models like BERT excel at sentence classification tasks due to\nextensive pre-training on general data, but their robustness to parameter\ncorruption is unexplored. To understand this better, we look at what happens if\na language model is \"broken\", in the sense that some of its parameters are\ncorrupted and then recovered by fine-tuning. Strategically corrupting BERT\nvariants at different levels, we find corrupted models struggle to fully\nrecover their original performance, with higher corruption causing more severe\ndegradation. Notably, bottom-layer corruption affecting fundamental linguistic\nfeatures is more detrimental than top-layer corruption. Our insights contribute\nto understanding language model robustness and adaptability under adverse\nconditions, informing strategies for developing resilient NLP systems against\nparameter perturbations.", "paper_summary_zh": "語言模型，例如 BERT，在句子分類任務中表現出色，因為在一般資料上進行了廣泛的預先訓練，但它們對參數損毀的穩健性尚未探索。為了更好地理解這一點，我們觀察如果語言模型「損毀」，即某些參數損毀，然後透過微調恢復，會發生什麼事。在不同層級策略性地損毀 BERT 變體，我們發現損毀的模型難以完全恢復其原始效能，損毀程度越高，效能下降越嚴重。值得注意的是，影響基本語言特徵的底層損毀比頂層損毀更具破壞性。我們的見解有助於了解語言模型在不利條件下的穩健性和適應性，並為開發能抵禦參數擾動的具韌性 NLP 系統提供策略。", "author": "Shijie Han et.al.", "authors": "Shijie Han, Zhenyu Zhang, Andrei Arsene Simion", "id": "2406.14459v1", "paper_url": "http://arxiv.org/abs/2406.14459v1", "repo": "null"}}