{"2411.05349": {"publish_time": "2024-11-08", "title": "Enhancing Cluster Resilience: LLM-agent Based Autonomous Intelligent Cluster Diagnosis System and Evaluation Framework", "paper_summary": "Recent advancements in Large Language Models (LLMs) and related technologies\nsuch as Retrieval-Augmented Generation (RAG) and Diagram of Thought (DoT) have\nenabled the creation of autonomous intelligent systems capable of performing\ncluster diagnostics and troubleshooting. By integrating these technologies with\nself-play methodologies, we have developed an LLM-agent system designed to\nautonomously diagnose and resolve issues within AI clusters. Our innovations\ninclude a knowledge base tailored for cluster diagnostics, enhanced LLM\nalgorithms, practical deployment strategies for agents, and a benchmark\nspecifically designed for evaluating LLM capabilities in this domain. Through\nextensive experimentation across multiple dimensions, we have demonstrated the\nsuperiority of our system in addressing the challenges faced in cluster\ndiagnostics, particularly in detecting and rectifying performance issues more\nefficiently and accurately than traditional methods.", "paper_summary_zh": "大型語言模型 (LLM) 和相關技術的最新進展，例如檢索增強生成 (RAG) 和思想圖 (DoT)，已經能夠建立自主智慧系統，執行群集診斷和故障排除。透過將這些技術與自對弈方法整合，我們開發出 LLM 代理系統，旨在自主診斷和解決 AI 群集中的問題。我們的創新包括針對群集診斷量身打造的知識庫、增強的 LLM 演算法、代理實用的部署策略，以及專門用於評估 LLM 在此領域能力的基準。透過多個面向的廣泛實驗，我們展示了我們的系統在解決群集診斷中所面臨挑戰方面的優越性，特別是在比傳統方法更有效率和準確地偵測和修正效能問題方面。", "author": "Honghao Shi et.al.", "authors": "Honghao Shi, Longkai Cheng, Wenli Wu, Yuhang Wang, Xuan Liu, Shaokai Nie, Weixv Wang, Xuebin Min, Chunlei Men, Yonghua Lin", "id": "2411.05349v1", "paper_url": "http://arxiv.org/abs/2411.05349v1", "repo": "null"}}