{"2501.05396": {"publish_time": "2025-01-09", "title": "FairCode: Evaluating Social Bias of LLMs in Code Generation", "paper_summary": "Large language models (LLMs) have demonstrated significant capability in code\ngeneration, drawing increasing attention to the evaluation of the quality and\nsafety of their outputs. However, research on bias in code generation remains\nlimited. Existing studies typically assess bias by applying malicious prompts\nor reapply tasks and dataset for discriminative models. Given that LLMs are\noften aligned with human values and that prior datasets are not fully optimized\nfor code-related tasks, there is a pressing need for benchmarks specifically\ndesigned for evaluating code models. In this study, we introduce FairCode, a\nnovel benchmark for evaluating bias in code generation. FairCode comprises two\ntasks: function implementation and test case generation, each evaluating social\nbias through diverse scenarios. Additionally, we propose a new metric,\nFairScore, to assess model performance on this benchmark. We conduct\nexperiments on widely used LLMs and provide a comprehensive analysis of the\nresults. The findings reveal that all tested LLMs exhibit bias. The code is\navailable at https://github.com/YongkDu/FairCode.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出生成程式碼的顯著能力，並越來越關注其輸出的品質和安全性評估。然而，關於程式碼生成偏差的研究仍然有限。現有研究通常透過套用惡意提示或重新套用任務和資料集來評估偏差，以進行區辨模型。鑑於 LLM 通常與人類價值觀一致，且先前的資料集並未針對程式碼相關任務進行完全最佳化，因此迫切需要專門用於評估程式碼模型的基準。在此研究中，我們介紹了 FairCode，這是一個用於評估程式碼生成偏差的新基準。FairCode 包含兩個任務：函式實作和測試案例生成，每個任務都透過不同的場景評估社會偏差。此外，我們提出了一個新的指標 FairScore，用於評估模型在此基準上的效能。我們對廣泛使用的 LLM 進行實驗，並對結果進行全面分析。研究結果顯示，所有受測的 LLM 都表現出偏差。程式碼可在 https://github.com/YongkDu/FairCode 取得。", "author": "Yongkang Du et.al.", "authors": "Yongkang Du, Jen-tse Huang, Jieyu Zhao, Lu Lin", "id": "2501.05396v1", "paper_url": "http://arxiv.org/abs/2501.05396v1", "repo": "null"}}