{"2412.19610": {"publish_time": "2024-12-27", "title": "Machine Generated Product Advertisements: Benchmarking LLMs Against Human Performance", "paper_summary": "This study compares the performance of AI-generated and human-written product\ndescriptions using a multifaceted evaluation model. We analyze descriptions for\n100 products generated by four AI models (Gemma 2B, LLAMA, GPT2, and ChatGPT 4)\nwith and without sample descriptions, against human-written descriptions. Our\nevaluation metrics include sentiment, readability, persuasiveness, Search\nEngine Optimization(SEO), clarity, emotional appeal, and call-to-action\neffectiveness. The results indicate that ChatGPT 4 performs the best. In\ncontrast, other models demonstrate significant shortcomings, producing\nincoherent and illogical output that lacks logical structure and contextual\nrelevance. These models struggle to maintain focus on the product being\ndescribed, resulting in disjointed sentences that do not convey meaningful\ninformation. This research provides insights into the current capabilities and\nlimitations of AI in the creation of content for e-Commerce.", "paper_summary_zh": "本研究使用多面向評估模型來比較 AI 生成的和人類撰寫的產品描述的表現。我們分析了四個 AI 模型（Gemma 2B、LLAMA、GPT2 和 ChatGPT 4）在有和沒有範例描述的情況下為 100 個產品產生的描述，並將其與人類撰寫的描述進行對比。我們的評估指標包括情緒、可讀性、說服力、搜尋引擎最佳化 (SEO)、清晰度、情感吸引力和行動呼籲的有效性。結果顯示 ChatGPT 4 的表現最佳。相比之下，其他模型表現出顯著的缺點，產生的輸出不連貫且不合邏輯，缺乏邏輯結構和上下文關聯性。這些模型難以保持對所描述產品的關注，導致斷斷續續的句子，無法傳達有意義的資訊。本研究提供了對 AI 在電子商務內容創作方面的當前能力和限制的見解。", "author": "Sanjukta Ghosh et.al.", "authors": "Sanjukta Ghosh", "id": "2412.19610v1", "paper_url": "http://arxiv.org/abs/2412.19610v1", "repo": "null"}}