{"2502.02533": {"publish_time": "2025-02-04", "title": "Multi-Agent Design: Optimizing Agents with Better Prompts and Topologies", "paper_summary": "Large language models, employed as multiple agents that interact and\ncollaborate with each other, have excelled at solving complex tasks. The agents\nare programmed with prompts that declare their functionality, along with the\ntopologies that orchestrate interactions across agents. Designing prompts and\ntopologies for multi-agent systems (MAS) is inherently complex. To automate the\nentire design process, we first conduct an in-depth analysis of the design\nspace aiming to understand the factors behind building effective MAS. We reveal\nthat prompts together with topologies play critical roles in enabling more\neffective MAS design. Based on the insights, we propose Multi-Agent System\nSearch (MASS), a MAS optimization framework that efficiently exploits the\ncomplex MAS design space by interleaving its optimization stages, from local to\nglobal, from prompts to topologies, over three stages: 1) block-level (local)\nprompt optimization; 2) workflow topology optimization; 3) workflow-level\n(global) prompt optimization, where each stage is conditioned on the\niteratively optimized prompts/topologies from former stages. We show that\nMASS-optimized multi-agent systems outperform a spectrum of existing\nalternatives by a substantial margin. Based on the MASS-found systems, we\nfinally propose design principles behind building effective multi-agent\nsystems.", "paper_summary_zh": "大型語言模型作為多個互動和協作的代理，在解決複雜任務方面表現出色。這些代理程式會根據提示進行編寫，宣告其功能，以及協調代理之間互動的拓撲結構。為多代理系統 (MAS) 設計提示和拓撲結構本質上很複雜。為了自動化整個設計過程，我們首先對設計空間進行深入分析，旨在了解建構有效 MAS 背後的因素。我們揭示了提示與拓撲結構在促成更有效的 MAS 設計中扮演著至關重要的角色。根據這些見解，我們提出了多代理系統搜尋 (MASS)，這是一個 MAS 最佳化架構，透過交錯其最佳化階段，從局部到整體，從提示到拓撲結構，在三個階段中有效利用複雜的 MAS 設計空間：1) 區塊層級 (局部) 提示最佳化；2) 工作流程拓撲最佳化；3) 工作流程層級 (整體) 提示最佳化，其中每個階段都根據前一階段反覆最佳化的提示/拓撲結構進行調整。我們證明了 MASS 最佳化多代理系統在很大程度上優於現有各種替代方案。最後，根據 MASS 發現的系統，我們提出了建構有效多代理系統背後的設計原則。", "author": "Han Zhou et.al.", "authors": "Han Zhou, Xingchen Wan, Ruoxi Sun, Hamid Palangi, Shariq Iqbal, Ivan Vulić, Anna Korhonen, Sercan Ö. Arık", "id": "2502.02533v1", "paper_url": "http://arxiv.org/abs/2502.02533v1", "repo": "null"}}