{"2504.02148": {"publish_time": "2025-04-02", "title": "OmniCellTOSG: The First Cell Text-Omic Signaling Graphs Dataset for Joint LLM and GNN Modeling", "paper_summary": "Complex cell signaling systems -- governed by varying protein abundances and\ninteractions -- generate diverse cell types across organs. These systems evolve\nunder influences such as age, sex, diet, environmental exposures, and diseases,\nmaking them challenging to decode given the involvement of tens of thousands of\ngenes and proteins. Recently, hundreds of millions of single-cell omics data\nhave provided a robust foundation for understanding these signaling networks\nwithin various cell subpopulations and conditions. Inspired by the success of\nlarge foundation models (for example, large language models and large vision\nmodels) pre-trained on massive datasets, we introduce OmniCellTOSG, the first\ndataset of cell text-omic signaling graphs (TOSGs). Each TOSG represents the\nsignaling network of an individual or meta-cell and is labeled with information\nsuch as organ, disease, sex, age, and cell subtype. OmniCellTOSG offers two key\ncontributions. First, it introduces a novel graph model that integrates\nhuman-readable annotations -- such as biological functions, cellular locations,\nsignaling pathways, related diseases, and drugs -- with quantitative gene and\nprotein abundance data, enabling graph reasoning to decode cell signaling. This\napproach calls for new joint models combining large language models and graph\nneural networks. Second, the dataset is built from single-cell RNA sequencing\ndata of approximately 120 million cells from diverse tissues and conditions\n(healthy and diseased) and is fully compatible with PyTorch. This facilitates\nthe development of innovative cell signaling models that could transform\nresearch in life sciences, healthcare, and precision medicine. The OmniCellTOSG\ndataset is continuously expanding and will be updated regularly. The dataset\nand code are available at https://github.com/FuhaiLiAiLab/OmniCellTOSG.", "paper_summary_zh": "<paragraph>複雜的細胞訊號系統——由不同的蛋白質豐度和交互作用所控制——在各個器官中產生不同的細胞類型。這些系統會隨著年齡、性別、飲食、環境暴露和疾病等因素的影響而演變，由於涉及到數以萬計的基因和蛋白質，因此解碼這些系統具有挑戰性。近年來，數億個單細胞組學數據為理解各種細胞亞群和條件下的這些訊號網絡提供了堅實的基礎。受大型基礎模型（例如，大型語言模型和大型視覺模型）在海量數據集上進行預訓練的成功的啟發，我們推出了 OmniCellTOSG，這是第一個細胞文本組學訊號圖 (TOSG) 數據集。每個 TOSG 代表單個或元細胞的訊號網絡，並標記有器官、疾病、性別、年齡和細胞亞型等信息。OmniCellTOSG 提供兩個主要貢獻。首先，它引入了一種新穎的圖模型，它將人類可讀的註釋（例如生物學功能、細胞位置、訊號通路、相關疾病和藥物）與定量基因和蛋白質豐度數據相結合，從而實現圖推理來解碼細胞訊號。這種方法需要結合大型語言模型和圖神經網絡的新聯合模型。其次，該數據集是根據來自不同組織和條件（健康和患病）的大約 1.2 億個細胞的單細胞 RNA 測序數據構建的，並且與 PyTorch 完全兼容。這促進了創新細胞訊號模型的開發，這些模型可以改變生命科學、醫療保健和精準醫學的研究。OmniCellTOSG 數據集正在不斷擴展，並將定期更新。數據集和代碼可在 https://github.com/FuhaiLiAiLab/OmniCellTOSG 獲取。</paragraph>\n", "author": "Heming Zhang et.al.", "authors": "Heming Zhang, Tim Xu, Dekang Cao, Shunning Liang, Lars Schimmelpfennig, Levi Kaster, Di Huang, Carlos Cruchaga, Guangfu Li, Michael Province, Yixin Chen, Philip Payne, Fuhai Li", "id": "2504.02148v1", "paper_url": "http://arxiv.org/abs/2504.02148v1", "repo": "null"}}