{"2406.14115": {"publish_time": "2024-06-20", "title": "Take the essence and discard the dross: A Rethinking on Data Selection for Fine-Tuning Large Language Models", "paper_summary": "Data selection for fine-tuning Large Language Models (LLMs) aims to select a\nhigh-quality subset from a given candidate dataset to train a Pending Fine-tune\nModel (PFM) into a Selective-Enhanced Model (SEM). It can improve the model\nperformance and accelerate the training process. Although a few surveys have\ninvestigated related works of data selection, there is a lack of comprehensive\ncomparison between existing methods due to their various experimental settings.\nTo address this issue, we first propose a three-stage scheme for data selection\nand comprehensively review existing works according to this scheme. Then, we\ndesign a unified comparing method with ratio-based efficiency indicators and\nranking-based feasibility indicators to overcome the difficulty of comparing\nvarious models with diverse experimental settings. After an in-depth\ncomparative analysis, we find that the more targeted method with data-specific\nand model-specific quality labels has higher efficiency, but the introduction\nof additional noise information should be avoided when designing selection\nalgorithms. Finally, we summarize the trends in data selection and highlight\nthe short-term and long-term challenges to guide future research.", "paper_summary_zh": "大型語言模型 (LLM) 的微調資料選取旨在從給定的候選資料集中選取高品質的子集，以將待微調模型 (PFM) 訓練成選擇性增強模型 (SEM)。它可以提升模型效能並加速訓練過程。儘管少數調查研究了與資料選取相關的工作，但由於現有方法的實驗設定不同，因此缺乏全面的比較。為了解決這個問題，我們首先提出了一個三階段資料選取方案，並根據此方案全面檢視現有工作。接著，我們設計了一個統一的比較方法，採用基於比率的效率指標和基於排名的可行性指標，以克服比較具有不同實驗設定的各種模型的難度。在深入的比較分析後，我們發現具有資料特定和模型特定品質標籤的目標方法效率較高，但在設計選取演算法時應避免引入額外的雜訊資訊。最後，我們總結了資料選取的趨勢，並強調了短期和長期挑戰，以引導未來的研究。", "author": "Ziche Liu et.al.", "authors": "Ziche Liu, Rui Ke, Feng Jiang, Haizhou Li", "id": "2406.14115v1", "paper_url": "http://arxiv.org/abs/2406.14115v1", "repo": "null"}}