{"2407.18597": {"publish_time": "2024-07-26", "title": "Reinforcement Learning for Sustainable Energy: A Survey", "paper_summary": "The transition to sustainable energy is a key challenge of our time,\nrequiring modifications in the entire pipeline of energy production, storage,\ntransmission, and consumption. At every stage, new sequential decision-making\nchallenges emerge, ranging from the operation of wind farms to the management\nof electrical grids or the scheduling of electric vehicle charging stations.\nAll such problems are well suited for reinforcement learning, the branch of\nmachine learning that learns behavior from data. Therefore, numerous studies\nhave explored the use of reinforcement learning for sustainable energy. This\npaper surveys this literature with the intention of bridging both the\nunderlying research communities: energy and machine learning. After a brief\nintroduction of both fields, we systematically list relevant sustainability\nchallenges, how they can be modeled as a reinforcement learning problem, and\nwhat solution approaches currently exist in the literature. Afterwards, we zoom\nout and identify overarching reinforcement learning themes that appear\nthroughout sustainability, such as multi-agent, offline, and safe reinforcement\nlearning. Lastly, we also cover standardization of environments, which will be\ncrucial for connecting both research fields, and highlight potential directions\nfor future work. In summary, this survey provides an extensive overview of\nreinforcement learning methods for sustainable energy, which may play a vital\nrole in the energy transition.", "paper_summary_zh": "<paragraph>轉向永續能源是我們時代的一項關鍵挑戰，\n需要修改能源生產、儲存、傳輸和消耗的整個管線。在每個階段，都會出現新的順序決策挑戰，從風力發電場的運作到電網管理或電動車充電站的排程。\n所有這些問題都非常適合強化學習，這是機器學習的一個分支，從資料中學習行為。因此，許多研究已經探討了將強化學習應用於永續能源。這篇論文調查了這份文獻，目的是橋接能源和機器學習這兩個基礎研究社群。在簡要介紹這兩個領域後，我們系統性地列出相關永續性挑戰、它們如何建模為強化學習問題，以及目前文獻中存在哪些解決方案。之後，我們縮小範圍並找出貫穿永續性的整體強化學習主題，例如多重代理、離線和安全的強化學習。最後，我們也涵蓋環境標準化，這對於連結兩個研究領域至關重要，並重點說明未來工作的潛在方向。總之，這項調查提供了強化學習方法在永續能源方面的廣泛概述，這可能在能源轉型中扮演至關重要的角色。</paragraph>", "author": "Koen Ponse et.al.", "authors": "Koen Ponse, Felix Kleuker, Márton Fejér, Álvaro Serra-Gómez, Aske Plaat, Thomas Moerland", "id": "2407.18597v1", "paper_url": "http://arxiv.org/abs/2407.18597v1", "repo": "null"}}