{"2408.08707": {"publish_time": "2024-08-16", "title": "Beam Prediction based on Large Language Models", "paper_summary": "Millimeter-wave (mmWave) communication is promising for next-generation\nwireless networks but suffers from significant path loss, requiring extensive\nantenna arrays and frequent beam training. Traditional deep learning models,\nsuch as long short-term memory (LSTM), enhance beam tracking accuracy however\nare limited by poor robustness and generalization. In this letter, we use large\nlanguage models (LLMs) to improve the robustness of beam prediction. By\nconverting time series data into text-based representations and employing the\nPrompt-as-Prefix (PaP) technique for contextual enrichment, our approach\nunleashes the strength of LLMs for time series forecasting. Simulation results\ndemonstrate that our LLM-based method offers superior robustness and\ngeneralization compared to LSTM-based models, showcasing the potential of LLMs\nin wireless communications.", "paper_summary_zh": "毫米波 (mmWave) 通訊對於下一代無線網路來說前景看好，但會遭受顯著的途徑損失，需要廣泛的天線陣列和頻繁的波束訓練。傳統深度學習模型，例如長短期記憶 (LSTM)，增強了波束追蹤準確度，但卻受到低健壯性和一般化的限制。在本文中，我們使用大型語言模型 (LLM) 來改善波束預測的健壯性。透過將時間序列資料轉換成基於文字的表示，並採用 Prompt-as-Prefix (PaP) 技術進行脈絡豐富化，我們的做法發揮了 LLM 在時間序列預測方面的優勢。模擬結果證明，與基於 LSTM 的模型相比，我們基於 LLM 的方法提供了優異的健壯性和一般化，展示了 LLM 在無線通訊中的潛力。", "author": "Yucheng Sheng et.al.", "authors": "Yucheng Sheng, Kai Huang, Le Liang, Peng Liu, Shi Jin, Geoffrey Ye Li", "id": "2408.08707v1", "paper_url": "http://arxiv.org/abs/2408.08707v1", "repo": "null"}}