{"2407.08108": {"publish_time": "2024-07-11", "title": "CADC: Encoding User-Item Interactions for Compressing Recommendation Model Training Data", "paper_summary": "Deep learning recommendation models (DLRMs) are at the heart of the current\ne-commerce industry. However, the amount of training data used to train these\nlarge models is growing exponentially, leading to substantial training hurdles.\nThe training dataset contains two primary types of information: content-based\ninformation (features of users and items) and collaborative information\n(interactions between users and items). One approach to reduce the training\ndataset is to remove user-item interactions. But that significantly diminishes\ncollaborative information, which is crucial for maintaining accuracy due to its\ninclusion of interaction histories. This loss profoundly impacts DLRM\nperformance.\n  This paper makes an important observation that if one can capture the\nuser-item interaction history to enrich the user and item embeddings, then the\ninteraction history can be compressed without losing model accuracy. Thus, this\nwork, Collaborative Aware Data Compression (CADC), takes a two-step approach to\ntraining dataset compression. In the first step, we use matrix factorization of\nthe user-item interaction matrix to create a novel embedding representation for\nboth the users and items. Once the user and item embeddings are enriched by the\ninteraction history information the approach then applies uniform random\nsampling of the training dataset to drastically reduce the training dataset\nsize while minimizing model accuracy drop. The source code of CADC is available\nat\n\\href{https://anonymous.4open.science/r/DSS-RM-8C1D/README.md}{https://anonymous.4open.science/r/DSS-RM-8C1D/README.md}.", "paper_summary_zh": "深度學習推薦模型 (DLRM) 是當前電子商務產業的核心。然而，用於訓練這些大型模型的訓練資料量呈指數級增長，導致訓練面臨重大障礙。訓練資料集包含兩種類型的主要資訊：基於內容的資訊（使用者和商品的特徵）與協作資訊（使用者與商品之間的互動）。一種減少訓練資料集的方法是移除使用者與商品的互動。但是，這會大幅減少協作資訊，而協作資訊對於維持準確性至關重要，因為它包含互動記錄。這種損失會嚴重影響 DLRM 的效能。\n本文提出一個重要的觀察，如果能擷取使用者與商品的互動記錄來豐富使用者和商品的嵌入，那麼互動記錄就可以在不降低模型準確性的情況下進行壓縮。因此，這項協作感知資料壓縮 (CADC) 工作採取兩步驟的方式來進行訓練資料集壓縮。在第一步中，我們使用使用者與商品互動矩陣的矩陣分解，為使用者和商品建立一個新穎的嵌入表示。一旦使用者和商品的嵌入通過互動記錄資訊得到豐富，此方法就會對訓練資料集套用均勻隨機抽樣，以大幅減少訓練資料集大小，同時將模型準確度下降降到最低。CADC 的原始程式碼可在\n\\href{https://anonymous.4open.science/r/DSS-RM-8C1D/README.md}{https://anonymous.4open.science/r/DSS-RM-8C1D/README.md} 取得。", "author": "Hossein Entezari Zarch et.al.", "authors": "Hossein Entezari Zarch, Abdulla Alshabanah, Chaoyi Jiang, Murali Annavaram", "id": "2407.08108v1", "paper_url": "http://arxiv.org/abs/2407.08108v1", "repo": "null"}}