{"2501.19278": {"publish_time": "2025-01-31", "title": "Pheromone-based Learning of Optimal Reasoning Paths", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable reasoning\ncapabilities through chain-of-thought prompting, yet discovering effective\nreasoning methods for complex problems remains challenging due to the vast\nspace of possible intermediate steps. We introduce Ant Colony\nOptimization-guided Tree of Thought (ACO-ToT), a novel algorithm that combines\nACO with LLMs to discover optimal reasoning paths for complex problems\nefficiently. Drawing inspiration from Hebbian learning in neurological systems,\nour method employs a collection of distinctly fine-tuned LLM \"ants\" to traverse\nand lay pheromone trails through a centralized tree of thought, with each ant's\nmovement governed by a weighted combination of existing pheromone trails and\nits own specialized expertise. The algorithm evaluates complete reasoning paths\nusing a mixture-of-experts-based scoring function, with pheromones reinforcing\nproductive reasoning paths across iterations. Experiments on three challenging\nreasoning tasks (GSM8K, ARC-Challenge, and MATH) demonstrate that ACO-ToT\nperforms significantly better than existing chain-of-thought optimization\napproaches, suggesting that incorporating biologically inspired collective\nsearch mechanisms into LLM inference can substantially enhance reasoning\ncapabilities.", "paper_summary_zh": "大型語言模型 (LLM) 已透過思考鏈提示展現出非凡的推理能力，但由於可能的步驟空間龐大，因此找出複雜問題的有效推理方法仍然具有挑戰性。我們引入了螞蟻群最佳化引導的思考樹 (ACO-ToT)，這是一種新穎的演算法，它將 ACO 與 LLM 結合，以有效找出複雜問題的最佳推理路徑。我們的演算法從神經系統中的赫布學習中汲取靈感，採用一組經過微調的 LLM「螞蟻」來穿越並在集中式思考樹中留下費洛蒙軌跡，每個螞蟻的移動都受到既有費洛蒙軌跡和其自身專業知識的加權組合所控制。該演算法使用基於專家混合的評分函數來評估完整的推理路徑，費洛蒙會在反覆運算中強化有成效的推理路徑。在三項具有挑戰性的推理任務（GSM8K、ARC-Challenge 和 MATH）上的實驗證明，ACO-ToT 的表現明顯優於現有的思考鏈最佳化方法，這表明將受生物啟發的集體搜尋機制納入 LLM 推論可以大幅提升推理能力。", "author": "Anirudh Chari et.al.", "authors": "Anirudh Chari, Aditya Tiwari, Richard Lian, Suraj Reddy, Brian Zhou", "id": "2501.19278v1", "paper_url": "http://arxiv.org/abs/2501.19278v1", "repo": "null"}}