{"2410.01350": {"publish_time": "2024-10-02", "title": "Takin-VC: Zero-shot Voice Conversion via Jointly Hybrid Content and Memory-Augmented Context-Aware Timbre Modeling", "paper_summary": "Zero-shot voice conversion (VC) aims to transform the source speaker timbre\ninto an arbitrary unseen one without altering the original speech content.While\nrecent advancements in zero-shot VC methods have shown remarkable progress,\nthere still remains considerable potential for improvement in terms of\nimproving speaker similarity and speech naturalness.In this paper, we propose\nTakin-VC, a novel zero-shot VC framework based on jointly hybrid content and\nmemory-augmented context-aware timbre modeling to tackle this challenge.\nSpecifically, an effective hybrid content encoder, guided by neural codec\ntraining, that leverages quantized features from pre-trained WavLM and\nHybridFormer is first presented to extract the linguistic content of the source\nspeech. Subsequently, we introduce an advanced cross-attention-based\ncontext-aware timbre modeling approach that learns the fine-grained,\nsemantically associated target timbre features. To further enhance both speaker\nsimilarity and real-time performance, we utilize a conditional flow matching\nmodel to reconstruct the Mel-spectrogram of the source speech. Additionally, we\nadvocate an efficient memory-augmented module designed to generate high-quality\nconditional target inputs for the flow matching process, thereby improving the\noverall performance of the proposed system. Experimental results demonstrate\nthat the proposed Takin-VC method surpasses state-of-the-art zero-shot VC\nsystems, delivering superior performance in terms of both speech naturalness\nand speaker similarity.", "paper_summary_zh": "零範例語音轉換 (VC) 旨在將來源說話者的音色轉換為任意一個未見過的音色，同時不改變原始的語音內容。雖然近期在零範例 VC 方法的進展已展現出顯著的進步，但在提升說話者相似度和語音自然度方面仍有很大的改善空間。在本文中，我們提出 Takin-VC，一個基於混合內容和強化記憶的脈絡感知音色建模的全新零範例 VC 架構，以應對此挑戰。具體來說，一個由神經編解碼器訓練引導的有效混合內容編碼器，利用來自預先訓練的 WavLM 和 HybridFormer 的量化特徵，首先被提出用於提取來源語音的語言內容。隨後，我們引入一個進階的基於交叉注意力的脈絡感知音色建模方法，用於學習細緻的、語義關聯的目標音色特徵。為了進一步增強說話者的相似度和即時效能，我們利用一個條件流匹配模型來重建來源語音的梅爾頻譜圖。此外，我們提倡一個高效的強化記憶模組，旨在為流匹配處理產生高品質的條件目標輸入，從而提升所提出系統的整體效能。實驗結果證明，所提出的 Takin-VC 方法超越了最先進的零範例 VC 系統，在語音自然度和說話者相似度方面都提供了卓越的效能。", "author": "Yuguang Yang et.al.", "authors": "Yuguang Yang, Yu Pan, Jixun Yao, Xiang Zhang, Jianhao Ye, Hongbin Zhou, Lei Xie, Lei Ma, Jianjun Zhao", "id": "2410.01350v1", "paper_url": "http://arxiv.org/abs/2410.01350v1", "repo": "null"}}