{"2411.03675": {"publish_time": "2024-11-06", "title": "QUILL: Quotation Generation Enhancement of Large Language Models", "paper_summary": "While Large language models (LLMs) have become excellent writing assistants,\nthey still struggle with quotation generation. This is because they either\nhallucinate when providing factual quotations or fail to provide quotes that\nexceed human expectations. To bridge the gap, we systematically study how to\nevaluate and improve LLMs' performance in quotation generation tasks. We first\nestablish a holistic and automatic evaluation system for quotation generation\ntask, which consists of five criteria each with corresponding automatic metric.\nTo improve the LLMs' quotation generation abilities, we construct a bilingual\nknowledge base that is broad in scope and rich in dimensions, containing up to\n32,022 quotes. Moreover, guided by our critiria, we further design a\nquotation-specific metric to rerank the retrieved quotations from the knowledge\nbase. Extensive experiments show that our metrics strongly correlate with human\npreferences. Existing LLMs struggle to generate desired quotes, but our\nquotation knowledge base and reranking metric help narrow this gap. Our dataset\nand code are publicly available at https://github.com/GraceXiaoo/QUILL.", "paper_summary_zh": "儘管大型語言模型 (LLM) 已成為優秀的寫作助理，\n它們在引文產生方面仍有困難。這是因為它們在提供事實引文時會出現幻覺，或無法提供超出人類預期的引文。為了彌補差距，我們系統性地研究如何評估和改善 LLM 在引文產生任務中的表現。我們首先為引文產生任務建立一個整體且自動化的評估系統，其中包含五個標準，每個標準都有相應的自動化指標。為了提升 LLM 的引文產生能力，我們構建了一個範圍廣泛且維度豐富的雙語知識庫，其中包含多達 32,022 個引文。此外，在我們標準的指導下，我們進一步設計了一個特定於引文的指標，以重新排列從知識庫中擷取的引文。大量的實驗表明，我們的指標與人類偏好有很強的相關性。現有的 LLM 難以產生所需的引文，但我們的引文知識庫和重新排列指標有助於縮小差距。我們的數據集和程式碼已公開發布於 https://github.com/GraceXiaoo/QUILL。", "author": "Jin Xiao et.al.", "authors": "Jin Xiao, Bowei Zhang, Qianyu He, Jiaqing Liang, Feng Wei, Jinglei Chen, Zujie Liang, Deqing Yang, Yanghua Xiao", "id": "2411.03675v1", "paper_url": "http://arxiv.org/abs/2411.03675v1", "repo": "https://github.com/gracexiaoo/quill"}}