{"2409.05242": {"publish_time": "2024-09-08", "title": "FedFT: Improving Communication Performance for Federated Learning with Frequency Space Transformation", "paper_summary": "Communication efficiency is a widely recognised research problem in Federated\nLearning (FL), with recent work focused on developing techniques for efficient\ncompression, distribution and aggregation of model parameters between clients\nand the server. Particularly within distributed systems, it is important to\nbalance the need for computational cost and communication efficiency. However,\nexisting methods are often constrained to specific applications and are less\ngeneralisable. In this paper, we introduce FedFT (federated frequency-space\ntransformation), a simple yet effective methodology for communicating model\nparameters in a FL setting. FedFT uses Discrete Cosine Transform (DCT) to\nrepresent model parameters in frequency space, enabling efficient compression\nand reducing communication overhead. FedFT is compatible with various existing\nFL methodologies and neural architectures, and its linear property eliminates\nthe need for multiple transformations during federated aggregation. This\nmethodology is vital for distributed solutions, tackling essential challenges\nlike data privacy, interoperability, and energy efficiency inherent to these\nenvironments. We demonstrate the generalisability of the FedFT methodology on\nfour datasets using comparative studies with three state-of-the-art FL\nbaselines (FedAvg, FedProx, FedSim). Our results demonstrate that using FedFT\nto represent the differences in model parameters between communication rounds\nin frequency space results in a more compact representation compared to\nrepresenting the entire model in frequency space. This leads to a reduction in\ncommunication overhead, while keeping accuracy levels comparable and in some\ncases even improving it. Our results suggest that this reduction can range from\n5% to 30% per client, depending on dataset.", "paper_summary_zh": "<paragraph>在联邦学习 (FL) 中，通信效率是一个广受认可的研究问题，最近的工作重点是开发用于在客户端和服务器之间高效压缩、分发和聚合模型参数的技术。特别是在分布式系统中，平衡计算成本和通信效率的需求非常重要。然而，现有方法通常受限于特定应用程序，并且通用性较差。在本文中，我们介绍了 FedFT（联邦频域空间变换），这是一种简单而有效的方法，用于在 FL 设置中通信模型参数。FedFT 使用离散余弦变换 (DCT) 在频域中表示模型参数，从而实现高效压缩并减少通信开销。FedFT 与各种现有的 FL 方法和神经架构兼容，其线性特性消除了在联邦聚合期间进行多次变换的需要。这种方法对于分布式解决方案至关重要，它解决了这些环境中固有的数据隐私、互操作性和能源效率等基本挑战。我们使用与三种最先进的 FL 基线（FedAvg、FedProx、FedSim）的比较研究，在四个数据集上展示了 FedFT 方法的通用性。我们的结果表明，使用 FedFT 在频域中表示通信轮次之间模型参数的差异，与在频域中表示整个模型相比，产生了更紧凑的表示。这减少了通信开销，同时保持了可比的准确性水平，在某些情况下甚至提高了准确性。我们的结果表明，这种减少幅度可以从每个客户端的 5% 到 30% 不等，具体取决于数据集。</paragraph>", "author": "Chamath Palihawadana et.al.", "authors": "Chamath Palihawadana, Nirmalie Wiratunga, Anjana Wijekoon, Harsha Kalutarage", "id": "2409.05242v1", "paper_url": "http://arxiv.org/abs/2409.05242v1", "repo": "null"}}