{"2410.05725": {"publish_time": "2024-10-08", "title": "KnowledgeSG: Privacy-Preserving Synthetic Text Generation with Knowledge Distillation from Server", "paper_summary": "The success of large language models (LLMs) facilitate many parties to\nfine-tune LLMs on their own private data. However, this practice raises privacy\nconcerns due to the memorization of LLMs. Existing solutions, such as utilizing\nsynthetic data for substitution, struggle to simultaneously improve performance\nand preserve privacy. They either rely on a local model for generation,\nresulting in a performance decline, or take advantage of APIs, directly\nexposing the data to API servers. To address this issue, we propose\n\\textit{KnowledgeSG}, a novel client-server framework which enhances synthetic\ndata quality and improves model performance while ensuring privacy. We achieve\nthis by learning local knowledge from the private data with differential\nprivacy (DP) and distilling professional knowledge from the server.\nAdditionally, inspired by federated learning, we transmit models rather than\ndata between the client and server to prevent privacy leakage. Extensive\nexperiments in medical and financial domains demonstrate the effectiveness of\nKnowledgeSG. Our code is now publicly available at\nhttps://github.com/wwh0411/KnowledgeSG.", "paper_summary_zh": "大型語言模型 (LLM) 的成功促使許多人微調自己的私人資料上的 LLM。然而，此做法會因為 LLM 的記憶功能而引發隱私疑慮。現有的解決方案，例如利用合成資料進行替換，在同時提升效能和保護隱私方面仍有困難。它們仰賴在地模型進行產生，導致效能下降，或利用 API，直接將資料公開給 API 伺服器。為了解決這個問題，我們提出「知識 SG」，一種新穎的客戶端伺服器架構，它能提升合成資料品質，並在確保隱私的同時提升模型效能。我們透過使用差分隱私 (DP) 從私人資料中學習在地知識，並從伺服器中萃取專業知識，達成此目標。此外，受聯邦學習的啟發，我們傳輸模型而非資料在客戶端和伺服器之間，以防止隱私外洩。在醫療和金融領域的廣泛實驗證明了知識 SG 的有效性。我們的程式碼現在已公開於 https://github.com/wwh0411/KnowledgeSG。", "author": "Wenhao Wang et.al.", "authors": "Wenhao Wang, Xiaoyu Liang, Rui Ye, Jingyi Chai, Siheng Chen, Yanfeng Wang", "id": "2410.05725v1", "paper_url": "http://arxiv.org/abs/2410.05725v1", "repo": "null"}}