{"2405.19213": {"publish_time": "2024-05-29", "title": "HawkVision: Low-Latency Modeless Edge AI Serving", "paper_summary": "The trend of modeless ML inference is increasingly growing in popularity as\nit hides the complexity of model inference from users and caters to diverse\nuser and application accuracy requirements. Previous work mostly focuses on\nmodeless inference in data centers. To provide low-latency inference, in this\npaper, we promote modeless inference at the edge. The edge environment\nintroduces additional challenges related to low power consumption, limited\ndevice memory, and volatile network environments.\n  To address these challenges, we propose HawkVision, which provides\nlow-latency modeless serving of vision DNNs. HawkVision leverages a two-layer\nedge-DC architecture that employs confidence scaling to reduce the number of\nmodel options while meeting diverse accuracy requirements. It also supports\nlossy inference under volatile network environments. Our experimental results\nshow that HawkVision outperforms current serving systems by up to 1.6X in P99\nlatency for providing modeless service. Our FPGA prototype demonstrates similar\nperformance at certain accuracy levels with up to a 3.34X reduction in power\nconsumption.", "paper_summary_zh": "無模式 ML 推論趨勢越來越受到歡迎，因為它隱藏了模型推論的複雜性，且能滿足不同的使用者和應用程式準確度需求。先前的研究大多著重於資料中心的無模式推論。為了提供低延遲推論，我們在這篇論文中推廣邊緣的無模式推論。邊緣環境引入了其他挑戰，例如低功耗、有限的裝置記憶體和不穩定的網路環境。\n為了應對這些挑戰，我們提出 HawkVision，它提供低延遲的視覺 DNN 無模式服務。HawkVision 採用雙層邊緣-DC 架構，運用信心縮放來減少模型選項數量，同時滿足不同的準確度需求。它還支援不穩定網路環境下的有損推論。我們的實驗結果顯示，HawkVision 在提供無模式服務時，P99 延遲比目前的服務系統快 1.6 倍。我們的 FPGA 原型在某些準確度等級下展現類似的效能，同時將功耗降低多達 3.34 倍。", "author": "ChonLam Lao et.al.", "authors": "ChonLam Lao, Jiaqi Gao, Ganesh Ananthanarayanan, Aditya Akella, Minlan Yu", "id": "2405.19213v1", "paper_url": "http://arxiv.org/abs/2405.19213v1", "repo": "null"}}