{"2412.09715": {"publish_time": "2024-12-12", "title": "Human vs. AI: A Novel Benchmark and a Comparative Study on the Detection of Generated Images and the Impact of Prompts", "paper_summary": "With the advent of publicly available AI-based text-to-image systems, the\nprocess of creating photorealistic but fully synthetic images has been largely\ndemocratized. This can pose a threat to the public through a simplified spread\nof disinformation. Machine detectors and human media expertise can help to\ndifferentiate between AI-generated (fake) and real images and counteract this\ndanger. Although AI generation models are highly prompt-dependent, the impact\nof the prompt on the fake detection performance has rarely been investigated\nyet. This work therefore examines the influence of the prompt's level of detail\non the detectability of fake images, both with an AI detector and in a user\nstudy. For this purpose, we create a novel dataset, COCOXGEN, which consists of\nreal photos from the COCO dataset as well as images generated with SDXL and\nFooocus using prompts of two standardized lengths. Our user study with 200\nparticipants shows that images generated with longer, more detailed prompts are\ndetected significantly more easily than those generated with short prompts.\nSimilarly, an AI-based detection model achieves better performance on images\ngenerated with longer prompts. However, humans and AI models seem to pay\nattention to different details, as we show in a heat map analysis.", "paper_summary_zh": "隨著公開的人工智慧基於文字轉換圖像系統的出現，創造寫實但完全合成的圖像的過程在很大程度上已經民主化。這可能會透過簡化錯誤訊息的散布對公眾構成威脅。機器偵測器和人類媒體專業知識有助於區分人工智慧產生的（假的）和真實的圖像，並對抗這種危險。儘管人工智慧生成模型高度依賴提示，但提示對假偵測效能的影響卻很少受到調查。因此，這項工作探討了提示的詳細程度對假圖像的可偵測性的影響，同時使用人工智慧偵測器和使用者研究。為此，我們創建了一個新的資料集 COCOXGEN，其中包含來自 COCO 資料集的真實照片，以及使用兩種標準化長度的提示產生的 SDXL 和 Fooocus 影像。我們對 200 名參與者進行的使用者研究顯示，使用較長、更詳細的提示產生的圖像比使用簡短提示產生的圖像更容易被偵測到。同樣地，基於人工智慧的偵測模型在使用較長提示產生的圖像上獲得了更好的效能。然而，正如我們在熱點圖分析中所示，人類和人工智慧模型似乎關注不同的細節。", "author": "Philipp Moeßner et.al.", "authors": "Philipp Moeßner, Heike Adel", "id": "2412.09715v1", "paper_url": "http://arxiv.org/abs/2412.09715v1", "repo": "https://github.com/heikeadel/cocoxgen"}}