{"2412.13860": {"publish_time": "2024-12-18", "title": "Domain-adaptative Continual Learning for Low-resource Tasks: Evaluation on Nepali", "paper_summary": "Continual learning has emerged as an important research direction due to the\ninfeasibility of retraining large language models (LLMs) from scratch in the\nevent of new data availability. Of great interest is the domain-adaptive\npre-training (DAPT) paradigm, which focuses on continually training a\npre-trained language model to adapt it to a domain it was not originally\ntrained on. In this work, we evaluate the feasibility of DAPT in a low-resource\nsetting, namely the Nepali language. We use synthetic data to continue training\nLlama 3 8B to adapt it to the Nepali language in a 4-bit QLoRA setting. We\nevaluate the adapted model on its performance, forgetting, and knowledge\nacquisition. We compare the base model and the final model on their Nepali\ngeneration abilities, their performance on popular benchmarks, and run\ncase-studies to probe their linguistic knowledge in Nepali. We see some\nunsurprising forgetting in the final model, but also surprisingly find that\nincreasing the number of shots during evaluation yields better percent\nincreases in the final model (as high as 19.29% increase) compared to the base\nmodel (4.98%), suggesting latent retention. We also explore layer-head\nself-attention heatmaps to establish dependency resolution abilities of the\nfinal model in Nepali.", "paper_summary_zh": "持續學習已成為一項重要的研究方向，因為在有新資料可用時，從頭重新訓練大型語言模型 (LLM) 不可行。極具興趣的是領域適應預訓練 (DAPT) 典範，它專注於持續訓練預訓練語言模型，以適應它最初未受過訓練的領域。在這項工作中，我們評估了 DAPT 在低資源設定（即尼泊爾語）中的可行性。我們使用合成資料繼續訓練 Llama 3 8B，以 4 位元 QLoRA 設定將其適應尼泊爾語。我們評估適應模型的效能、遺忘和知識習得。我們比較基礎模型和最終模型的尼泊爾語生成能力、它們在熱門基準測試中的效能，並執行個案研究以探討它們在尼泊爾語中的語言知識。我們在最終模型中看到一些不足為奇的遺忘，但令人驚訝地發現，在評估期間增加次數會產生更好的最終模型百分比增加（高達 19.29% 的增加），與基礎模型（4.98%）相比，這表明潛在保留。我們還探索層級頭部自注意力熱圖，以建立最終模型在尼泊爾語中的依存關係解析能力。", "author": "Sharad Duwal et.al.", "authors": "Sharad Duwal, Suraj Prasai, Suresh Manandhar", "id": "2412.13860v1", "paper_url": "http://arxiv.org/abs/2412.13860v1", "repo": "null"}}