{"2407.08608": {"publish_time": "2024-07-11", "title": "FlashAttention-3: Fast and Accurate Attention with Asynchrony and Low-precision", "paper_summary": "Attention, as a core layer of the ubiquitous Transformer architecture, is the\nbottleneck for large language models and long-context applications.\nFlashAttention elaborated an approach to speed up attention on GPUs through\nminimizing memory reads/writes. However, it has yet to take advantage of new\ncapabilities present in recent hardware, with FlashAttention-2 achieving only\n35% utilization on the H100 GPU. We develop three main techniques to speed up\nattention on Hopper GPUs: exploiting asynchrony of the Tensor Cores and TMA to\n(1) overlap overall computation and data movement via warp-specialization and\n(2) interleave block-wise matmul and softmax operations, and (3) block\nquantization and incoherent processing that leverages hardware support for FP8\nlow-precision. We demonstrate that our method, FlashAttention-3, achieves\nspeedup on H100 GPUs by 1.5-2.0$\\times$ with FP16 reaching up to 740 TFLOPs/s\n(75% utilization), and with FP8 reaching close to 1.2 PFLOPs/s. We validate\nthat FP8 FlashAttention-3 achieves 2.6$\\times$ lower numerical error than a\nbaseline FP8 attention.", "paper_summary_zh": "注意力，作為無處不在的 Transformer 架構的核心層，是大型語言模型和長語境應用程式的瓶頸。\nFlashAttention 透過最小化記憶體讀取/寫入，闡述了一種在 GPU 上加速注意力的方法。然而，它尚未利用最新硬體中存在的新功能，而 FlashAttention-2 在 H100 GPU 上僅達到 35% 的利用率。我們開發了三種主要技術來加速 Hopper GPU 上的注意力：利用張量核心的異步性和 TMA 來 (1) 透過扭曲專門化重疊整體運算和資料移動，以及 (2) 交錯區塊矩陣乘法和 softmax 運算，以及 (3) 利用硬體對 FP8 低精度的支援來進行區塊量化和非相干處理。我們證明我們的 FlashAttention-3 方法，在 H100 GPU 上透過 FP16 達到 1.5-2.0 倍的加速，最高可達 740 TFLOP/s（75% 利用率），而透過 FP8 接近 1.2 PFLOP/s。我們驗證 FP8 FlashAttention-3 比基線 FP8 注意力獲得低 2.6 倍的數值誤差。", "author": "Jay Shah et.al.", "authors": "Jay Shah, Ganesh Bikshandi, Ying Zhang, Vijay Thakkar, Pradeep Ramani, Tri Dao", "id": "2407.08608v1", "paper_url": "http://arxiv.org/abs/2407.08608v1", "repo": "null"}}