{"2501.17612": {"publish_time": "2025-01-29", "title": "VoicePrompter: Robust Zero-Shot Voice Conversion with Voice Prompt and Conditional Flow Matching", "paper_summary": "Despite remarkable advancements in recent voice conversion (VC) systems,\nenhancing speaker similarity in zero-shot scenarios remains challenging. This\nchallenge arises from the difficulty of generalizing and adapting speaker\ncharacteristics in speech within zero-shot environments, which is further\ncomplicated by mismatch between the training and inference processes. To\naddress these challenges, we propose VoicePrompter, a robust zero-shot VC model\nthat leverages in-context learning with voice prompts. VoicePrompter is\ncomposed of (1) a factorization method that disentangles speech components and\n(2) a DiT-based conditional flow matching (CFM) decoder that conditions on\nthese factorized features and voice prompts. Additionally, (3) latent mixup is\nused to enhance in-context learning by combining various speaker features. This\napproach improves speaker similarity and naturalness in zero-shot VC by\napplying mixup to latent representations. Experimental results demonstrate that\nVoicePrompter outperforms existing zero-shot VC systems in terms of speaker\nsimilarity, speech intelligibility, and audio quality. Our demo is available at\n\\url{https://hayeong0.github.io/VoicePrompter-demo/}.", "paper_summary_zh": "儘管最近的語音轉換 (VC) 系統有顯著的進展，但在零次學習場景中增強說話者相似性仍然具有挑戰性。這個挑戰來自於在零次學習環境中概化和適應語音中說話者特徵的難度，而訓練和推論過程之間的不匹配進一步複雜化了這個挑戰。為了應對這些挑戰，我們提出了 VoicePrompter，這是一個強大的零次學習 VC 模型，它利用語音提示進行情境學習。VoicePrompter 由 (1) 一個分解語音組成的分解方法和 (2) 一個基於 DiT 的條件流匹配 (CFM) 解碼器組成，它以這些分解的特徵和語音提示為條件。此外，(3) 潛在混淆用於透過結合各種說話者特徵來增強情境學習。這種方法透過將混淆應用於潛在表徵來改善零次學習 VC 中的說話者相似性和自然性。實驗結果表明，VoicePrompter 在說話者相似性、語音清晰度和音訊品質方面優於現有的零次學習 VC 系統。我們的示範可以在 \\url{https://hayeong0.github.io/VoicePrompter-demo/} 中取得。", "author": "Ha-Yeong Choi et.al.", "authors": "Ha-Yeong Choi, Jaehan Park", "id": "2501.17612v1", "paper_url": "http://arxiv.org/abs/2501.17612v1", "repo": "null"}}