{"2410.10745": {"publish_time": "2024-10-14", "title": "FlexGen: Flexible Multi-View Generation from Text and Image Inputs", "paper_summary": "In this work, we introduce FlexGen, a flexible framework designed to generate\ncontrollable and consistent multi-view images, conditioned on a single-view\nimage, or a text prompt, or both. FlexGen tackles the challenges of\ncontrollable multi-view synthesis through additional conditioning on 3D-aware\ntext annotations. We utilize the strong reasoning capabilities of GPT-4V to\ngenerate 3D-aware text annotations. By analyzing four orthogonal views of an\nobject arranged as tiled multi-view images, GPT-4V can produce text annotations\nthat include 3D-aware information with spatial relationship. By integrating the\ncontrol signal with proposed adaptive dual-control module, our model can\ngenerate multi-view images that correspond to the specified text. FlexGen\nsupports multiple controllable capabilities, allowing users to modify text\nprompts to generate reasonable and corresponding unseen parts. Additionally,\nusers can influence attributes such as appearance and material properties,\nincluding metallic and roughness. Extensive experiments demonstrate that our\napproach offers enhanced multiple controllability, marking a significant\nadvancement over existing multi-view diffusion models. This work has\nsubstantial implications for fields requiring rapid and flexible 3D content\ncreation, including game development, animation, and virtual reality. Project\npage: https://xxu068.github.io/flexgen.github.io/.", "paper_summary_zh": "在這項工作中，我們介紹了 FlexGen，一個設計用於生成可控且一致的多視圖影像的彈性框架，以單視圖影像、文字提示或兩者為條件。FlexGen 透過對 3D 感知的文字註解進行額外條件設定，來解決可控多視圖合成的挑戰。我們利用 GPT-4V 強大的推理能力來生成 3D 感知的文字註解。透過分析一個物件的四個正交視圖，這些視圖被排列成平鋪的多視圖影像，GPT-4V 可以產生包含 3D 感知資訊和空間關係的文字註解。透過將控制訊號與所提出的自適應雙控制模組整合，我們的模型可以生成對應於指定文字的多視圖影像。FlexGen 支援多種可控功能，使用戶能夠修改文字提示來生成合理且對應的未見部分。此外，使用者可以影響屬性，例如外觀和材質特性，包括金屬和粗糙度。廣泛的實驗證明了我們的方法提供了增強的多重可控性，標誌著對現有多視圖擴散模型的重大進步。這項工作對需要快速且靈活的 3D 內容創作的領域具有重大意義，包括遊戲開發、動畫和虛擬實境。專案頁面：https://xxu068.github.io/flexgen.github.io/。", "author": "Xinli Xu et.al.", "authors": "Xinli Xu, Wenhang Ge, Jiantao Lin, Jiawei Feng, Lie Xu, HanFeng Zhao, Shunsi Zhang, Ying-Cong Chen", "id": "2410.10745v1", "paper_url": "http://arxiv.org/abs/2410.10745v1", "repo": "null"}}