{"2406.18880": {"publish_time": "2024-06-27", "title": "SSP: Self-Supervised Prompting for Cross-Lingual Transfer to Low-Resource Languages using Large Language Models", "paper_summary": "Recently, very large language models (LLMs) have shown exceptional\nperformance on several English NLP tasks with just in-context learning (ICL),\nbut their utility in other languages is still underexplored. We investigate\ntheir effectiveness for NLP tasks in low-resource languages (LRLs), especially\nin the setting of zero-labelled cross-lingual transfer (0-CLT), where no\nlabelled training data for the target language is available -- however training\ndata from one or more related medium-resource languages (MRLs) is utilized,\nalongside the available unlabeled test data for a target language. We introduce\nSelf-Supervised Prompting (SSP), a novel ICL approach tailored for the 0-CLT\nsetting.\n  SSP is based on the key observation that LLMs output more accurate labels if\nin-context exemplars are from the target language (even if their labels are\nslightly noisy). To operationalize this, since target language training data is\nnot available in 0-CLT, SSP operates in two stages. In Stage I, using source\nMRL training data, target language's test data is noisily labeled. In Stage II,\nthese noisy test data points are used as exemplars in ICL for further improved\nlabelling. Additionally, our implementation of SSP uses a novel Integer Linear\nProgramming (ILP)-based exemplar selection that balances similarity, prediction\nconfidence (when available) and label coverage. Experiments on three tasks and\neleven LRLs (from three regions) demonstrate that SSP strongly outperforms\nexisting SOTA fine-tuned and prompting-based baselines in 0-CLT setup.", "paper_summary_zh": "最近，大型语言模型 (LLM) 在仅使用语境学习 (ICL) 的情况下，在多项英文自然语言处理任务上表现出色，但它们在其他语言中的效用仍未得到充分探索。我们调查了它们在低资源语言 (LRL) 中执行自然语言处理任务的有效性，尤其是在零标记跨语言迁移 (0-CLT) 的设置中，其中没有目标语言的标记训练数据可用——但来自一个或多个相关的中等资源语言 (MRL) 的训练数据被利用，以及目标语言的可用未标记测试数据。我们引入了自监督提示 (SSP)，这是一种针对 0-CLT 设置量身定制的新型 ICL 方法。\nSSP 基于一个关键观察，即如果语境示例来自目标语言（即使它们的标签有点嘈杂），LLM 输出的标签会更准确。为了实现这一点，由于在 0-CLT 中没有目标语言训练数据，SSP 分两个阶段操作。在第一阶段，使用源 MRL 训练数据，对目标语言的测试数据进行噪声标记。在第二阶段，这些嘈杂的测试数据点被用作 ICL 中的示例，以进一步改进标记。此外，我们对 SSP 的实现使用了一种新颖的基于整数线性规划 (ILP) 的示例选择，它平衡了相似性、预测置信度（如果可用）和标签覆盖率。对三个任务和十一个 LRL（来自三个区域）的实验表明，SSP 在 0-CLT 设置中明显优于现有的 SOTA 微调和基于提示的基准。", "author": "Vipul Rathore et.al.", "authors": "Vipul Rathore, Aniruddha Deb, Ankish Chandresh, Parag Singla, Mausam", "id": "2406.18880v1", "paper_url": "http://arxiv.org/abs/2406.18880v1", "repo": "https://github.com/dair-iitd/SSP"}}