{"2410.15403": {"publish_time": "2024-10-20", "title": "MMCS: A Multimodal Medical Diagnosis System Integrating Image Analysis and Knowledge-based Departmental Consultation", "paper_summary": "We present MMCS, a system capable of recognizing medical images and patient\nfacial details, and providing professional medical diagnoses. The system\nconsists of two core components: The first component is the analysis of medical\nimages and videos. We trained a specialized multimodal medical model capable of\ninterpreting medical images and accurately analyzing patients' facial emotions\nand facial paralysis conditions. The model achieved an accuracy of 72.59% on\nthe FER2013 facial emotion recognition dataset, with a 91.1% accuracy in\nrecognizing the happy emotion. In facial paralysis recognition, the model\nreached an accuracy of 92%, which is 30% higher than that of GPT-4o. Based on\nthis model, we developed a parser for analyzing facial movement videos of\npatients with facial paralysis, achieving precise grading of the paralysis\nseverity. In tests on 30 videos of facial paralysis patients, the system\ndemonstrated a grading accuracy of 83.3%.The second component is the generation\nof professional medical responses. We employed a large language model,\nintegrated with a medical knowledge base, to generate professional diagnoses\nbased on the analysis of medical images or videos. The core innovation lies in\nour development of a department-specific knowledge base routing management\nmechanism, in which the large language model categorizes data by medical\ndepartments and, during the retrieval process, determines the appropriate\nknowledge base to query. This significantly improves retrieval accuracy in the\nRAG (retrieval-augmented generation) process. This mechanism led to an average\nincrease of 4 percentage points in accuracy for various large language models\non the MedQA dataset.Our code is open-sourced and available at:\nhttps://github.com/renllll/MMCS.", "paper_summary_zh": "<paragraph>我們提出 MMCS，這是一個能夠辨識醫療影像和病患\n面部細節，並提供專業醫療診斷的系統。這個系統\n包含兩個核心組成：第一個組成是醫療影像和影片的分析。我們訓練了一個專門的多模態醫療模型，能夠\n解讀醫療影像並精準分析病患的面部情緒和顏面麻痺狀況。這個模型在 FER2013 面部情緒辨識資料集上達到了 72.59% 的準確度，在辨識快樂情緒時有 91.1% 的準確度。在顏面麻痺辨識中，這個模型達到了 92% 的準確度，比 GPT-4o 高出 30%。基於\n這個模型，我們開發了一個用於分析顏面麻痺病患面部動作影片的剖析器，達到了對麻痺嚴重程度的精確分級。在對 30 部顏面麻痺病患影片的測試中，這個系統\n展現了 83.3% 的分級準確度。第二個組成是專業醫療回應的產生。我們採用了一個大型語言模型，整合了一個醫療知識庫，以產生基於醫療影像或影片分析的專業診斷。核心的創新在於\n我們開發了一個部門特定知識庫路由管理機制，其中大型語言模型依據醫療部門分類資料，並在檢索過程中，決定要查詢的適當知識庫。這顯著地提升了 RAG（檢索增強產生）過程中的檢索準確度。這個機制導致了 MedQA 資料集上各種大型語言模型的準確度平均提升了 4 個百分點。我們的程式碼是開源的，可以在這裡取得：\nhttps://github.com/renllll/MMCS。</paragraph>", "author": "Yi Ren et.al.", "authors": "Yi Ren, HanZhi Zhang, Weibin Li, Diandong Liu, Tianyi Zhang, Jie He", "id": "2410.15403v1", "paper_url": "http://arxiv.org/abs/2410.15403v1", "repo": "null"}}