{"2502.15672": {"publish_time": "2025-02-21", "title": "VaViM and VaVAM: Autonomous Driving through Video Generative Modeling", "paper_summary": "We explore the potential of large-scale generative video models for\nautonomous driving, introducing an open-source auto-regressive video model\n(VaViM) and its companion video-action model (VaVAM) to investigate how video\npre-training transfers to real-world driving. VaViM is a simple auto-regressive\nvideo model that predicts frames using spatio-temporal token sequences. We show\nthat it captures the semantics and dynamics of driving scenes. VaVAM, the\nvideo-action model, leverages the learned representations of VaViM to generate\ndriving trajectories through imitation learning. Together, the models form a\ncomplete perception-to-action pipeline. We evaluate our models in open- and\nclosed-loop driving scenarios, revealing that video-based pre-training holds\npromise for autonomous driving. Key insights include the semantic richness of\nthe learned representations, the benefits of scaling for video synthesis, and\nthe complex relationship between model size, data, and safety metrics in\nclosed-loop evaluations. We release code and model weights at\nhttps://github.com/valeoai/VideoActionModel", "paper_summary_zh": "我們探討了大型生成影片模型在自動駕駛方面的潛力，引入了開源自迴歸影片模型 (VaViM) 及其配套影片動作模型 (VaVAM)，以探討影片預訓練如何轉移到實際駕駛。VaViM 是一個簡單的自迴歸影片模型，它使用時空標記序列預測幀。我們展示了它捕捉了駕駛場景的語義和動態。影片動作模型 VaVAM 利用 VaViM 的學習表示，透過模仿學習產生駕駛軌跡。這些模型共同形成了完整的感知到動作的管道。我們在開放和閉環駕駛場景中評估模型，結果顯示基於影片的預訓練對自動駕駛很有前景。關鍵見解包括學習表示的語義豐富性、影片合成擴充的好處，以及在閉環評估中模型大小、資料和安全指標之間的複雜關係。我們在 https://github.com/valeoai/VideoActionModel 上釋出程式碼和模型權重", "author": "Florent Bartoccioni et.al.", "authors": "Florent Bartoccioni, Elias Ramzi, Victor Besnier, Shashanka Venkataramanan, Tuan-Hung Vu, Yihong Xu, Loick Chambon, Spyros Gidaris, Serkan Odabas, David Hurych, Renaud Marlet, Alexandre Boulch, Mickael Chen, Éloi Zablocki, Andrei Bursuc, Eduardo Valle, Matthieu Cord", "id": "2502.15672v1", "paper_url": "http://arxiv.org/abs/2502.15672v1", "repo": "https://github.com/valeoai/VideoActionModel"}}