{"2407.09388": {"publish_time": "2024-07-12", "title": "GAVEL: Generating Games Via Evolution and Language Models", "paper_summary": "Automatically generating novel and interesting games is a complex task.\nChallenges include representing game rules in a computationally workable form,\nsearching through the large space of potential games under most such\nrepresentations, and accurately evaluating the originality and quality of\npreviously unseen games. Prior work in automated game generation has largely\nfocused on relatively restricted rule representations and relied on\ndomain-specific heuristics. In this work, we explore the generation of novel\ngames in the comparatively expansive Ludii game description language, which\nencodes the rules of over 1000 board games in a variety of styles and modes of\nplay. We draw inspiration from recent advances in large language models and\nevolutionary computation in order to train a model that intelligently mutates\nand recombines games and mechanics expressed as code. We demonstrate both\nquantitatively and qualitatively that our approach is capable of generating new\nand interesting games, including in regions of the potential rules space not\ncovered by existing games in the Ludii dataset. A sample of the generated games\nare available to play online through the Ludii portal.", "paper_summary_zh": "自動產生新穎有趣的遊戲是一項複雜的任務。\n挑戰包括以計算可行的形式表示遊戲規則，\n在大多數此類表示下搜尋潛在遊戲的廣闊空間，以及準確評估前所未見遊戲的原創性和品質。\n自動化遊戲生成中的先前工作在很大程度上集中在相對受限的規則表示上，並依賴於特定領域的啟發法。\n在這項工作中，我們探索了在比較廣泛的 Ludii 遊戲描述語言中生成新穎遊戲，\n它以各種風格和遊戲模式編碼了 1000 多個棋盤遊戲的規則。\n我們從大型語言模型和演化計算的最新進展中汲取靈感，以訓練一個模型，\n它可以智能地變異和重組表示為代碼的遊戲和機制。\n我們定量和定性地證明了我們的做法能夠產生新的有趣遊戲，包括 Ludii 資料集中現有遊戲未涵蓋的潛在規則空間區域。\n一些已生成的遊戲範例可透過 Ludii 入口網站線上遊玩。", "author": "Graham Todd et.al.", "authors": "Graham Todd, Alexander Padula, Matthew Stephenson, Éric Piette, Dennis J. N. J. Soemers, Julian Togelius", "id": "2407.09388v1", "paper_url": "http://arxiv.org/abs/2407.09388v1", "repo": "null"}}