{"2408.12035": {"publish_time": "2024-08-21", "title": "Let Community Rules Be Reflected in Online Content Moderation", "paper_summary": "Content moderation is a widely used strategy to prevent the dissemination of\nirregular information on social media platforms. Despite extensive research on\ndeveloping automated models to support decision-making in content moderation,\nthere remains a notable scarcity of studies that integrate the rules of online\ncommunities into content moderation. This study addresses this gap by proposing\na community rule-based content moderation framework that directly integrates\ncommunity rules into the moderation of user-generated content. Our experiment\nresults with datasets collected from two domains demonstrate the superior\nperformance of models based on the framework to baseline models across all\nevaluation metrics. In particular, incorporating community rules substantially\nenhances model performance in content moderation. The findings of this research\nhave significant research and practical implications for improving the\neffectiveness and generalizability of content moderation models in online\ncommunities.", "paper_summary_zh": "內容審查是一種廣泛使用的策略，用於防止在社群媒體平台上散布不正確的資訊。儘管在開發自動化模型以支援內容審查中的決策制定方面進行了廣泛的研究，但整合線上社群規則進入內容審查的研究仍然相當稀少。本研究透過提出一個以社群規則為基礎的內容審查架構來解決這個差距，該架構將社群規則直接整合到使用者產製內容的審查中。我們從兩個領域收集的資料集進行的實驗結果，證明基於架構的模型在所有評估指標上都優於基線模型。特別是，納入社群規則大幅提升了內容審查中的模型效能。本研究的發現對於提升線上社群中內容審查模型的效能和可概化性具有重要的研究和實務意涵。", "author": "Wangjiaxuan Xin et.al.", "authors": "Wangjiaxuan Xin, Kanlun Wang, Zhe Fu, Lina Zhou", "id": "2408.12035v1", "paper_url": "http://arxiv.org/abs/2408.12035v1", "repo": "null"}}