{"2411.02309": {"publish_time": "2024-11-04", "title": "Grid-Based Projection of Spatial Data into Knowledge Graphs", "paper_summary": "The Spatial Knowledge Graphs (SKG) are experiencing growing adoption as a\nmeans to model real-world entities, proving especially invaluable in domains\nlike crisis management and urban planning. Considering that RDF specifications\noffer limited support for effectively managing spatial information, it's common\npractice to include text-based serializations of geometrical features, such as\npolygons and lines, as string literals in knowledge graphs. Consequently,\nSpatial Knowledge Graphs (SKGs) often rely on geo-enabled RDF Stores capable of\nparsing, interpreting, and indexing such serializations. In this paper, we\nleverage grid cells as the foundational element of SKGs and demonstrate how\nefficiently the spatial characteristics of real-world entities and their\nattributes can be encoded within knowledge graphs. Furthermore, we introduce a\nnovel methodology for representing street networks in knowledge graphs,\ndiverging from the conventional practice of individually capturing each street\nsegment. Instead, our approach is based on tessellating the street network\nusing grid cells and creating a simplified representation that could be\nutilized for various routing and navigation tasks, solely relying on RDF\nspecifications.", "paper_summary_zh": "空間知識圖表 (SKG) 作為建模真實世界實體的一種方式，正經歷著越來越廣泛的採用，並在危機管理和城市規劃等領域中證明了其特別的價值。考慮到 RDF 規範在有效管理空間資訊方面的支援有限，因此常見的做法是將幾何特徵（例如多邊形和線條）的基於文字的序列化，作為字串文字包含在知識圖表中。因此，空間知識圖表 (SKG) 通常依賴於能夠解析、詮釋和索引此類序列化的地理啟用 RDF 儲存。在本文中，我們利用網格單元作為 SKG 的基礎元素，並展示了如何有效地將真實世界實體及其屬性的空間特性編碼到知識圖表中。此外，我們還介紹了一種在知識圖表中表示街道網路的新方法，它不同於逐個擷取每個街道區段的傳統做法。相反，我們的做法是基於使用網格單元對街道網路進行鑲嵌，並建立一個簡化的表示，該表示可僅依賴 RDF 規範用於各種路由和導航任務。", "author": "Amin Anjomshoaa et.al.", "authors": "Amin Anjomshoaa, Hannah Schuster, Axel Polleres", "id": "2411.02309v1", "paper_url": "http://arxiv.org/abs/2411.02309v1", "repo": "null"}}