{"2412.15035": {"publish_time": "2024-12-19", "title": "LLMs Lost in Translation: M-ALERT uncovers Cross-Linguistic Safety Gaps", "paper_summary": "Building safe Large Language Models (LLMs) across multiple languages is\nessential in ensuring both safe access and linguistic diversity. To this end,\nwe introduce M-ALERT, a multilingual benchmark that evaluates the safety of\nLLMs in five languages: English, French, German, Italian, and Spanish. M-ALERT\nincludes 15k high-quality prompts per language, totaling 75k, following the\ndetailed ALERT taxonomy. Our extensive experiments on 10 state-of-the-art LLMs\nhighlight the importance of language-specific safety analysis, revealing that\nmodels often exhibit significant inconsistencies in safety across languages and\ncategories. For instance, Llama3.2 shows high unsafety in the category\ncrime_tax for Italian but remains safe in other languages. Similar differences\ncan be observed across all models. In contrast, certain categories, such as\nsubstance_cannabis and crime_propaganda, consistently trigger unsafe responses\nacross models and languages. These findings underscore the need for robust\nmultilingual safety practices in LLMs to ensure safe and responsible usage\nacross diverse user communities.", "paper_summary_zh": "建立跨多種語言的安全大型語言模型 (LLM) 對於確保安全存取和語言多樣性至關重要。為此，我們引入了 M-ALERT，這是一個多語言基準，用於評估五種語言（英語、法語、德語、義大利語和西班牙語）中 LLM 的安全性。M-ALERT 包含每種語言 15k 個高品質提示，總計 75k，遵循詳細的 ALERT 分類法。我們對 10 個最先進的 LLM 進行的廣泛實驗突顯了特定語言安全分析的重要性，揭示了模型在不同語言和類別中的安全性往往存在顯著不一致。例如，Llama3.2 在義大利語的 crime_tax 類別中表現出高度不安全性，但在其他語言中仍然安全。在所有模型中都可以觀察到類似的差異。相比之下，某些類別（例如 substance_cannabis 和 crime_propaganda）會持續觸發不同模型和語言的不安全回應。這些發現強調了在 LLM 中採用強健的多語言安全實務，以確保在不同的使用者社群中安全且負責任地使用。", "author": "Felix Friedrich et.al.", "authors": "Felix Friedrich, Simone Tedeschi, Patrick Schramowski, Manuel Brack, Roberto Navigli, Huu Nguyen, Bo Li, Kristian Kersting", "id": "2412.15035v1", "paper_url": "http://arxiv.org/abs/2412.15035v1", "repo": "null"}}