{"2408.05977": {"publish_time": "2024-08-12", "title": "The Language of Trauma: Modeling Traumatic Event Descriptions Across Domains with Explainable AI", "paper_summary": "Psychological trauma can manifest following various distressing events and is\ncaptured in diverse online contexts. However, studies traditionally focus on a\nsingle aspect of trauma, often neglecting the transferability of findings\nacross different scenarios. We address this gap by training language models\nwith progressing complexity on trauma-related datasets, including\ngenocide-related court data, a Reddit dataset on post-traumatic stress disorder\n(PTSD), counseling conversations, and Incel forum posts. Our results show that\nthe fine-tuned RoBERTa model excels in predicting traumatic events across\ndomains, slightly outperforming large language models like GPT-4. Additionally,\nSLALOM-feature scores and conceptual explanations effectively differentiate and\ncluster trauma-related language, highlighting different trauma aspects and\nidentifying sexual abuse and experiences related to death as a common traumatic\nevent across all datasets. This transferability is crucial as it allows for the\ndevelopment of tools to enhance trauma detection and intervention in diverse\npopulations and settings.", "paper_summary_zh": "心理創傷可能在各種令人痛苦的事件後顯現，並在不同的網路情境中被捕捉到。然而，研究傳統上只專注於創傷的單一面向，常常忽略發現跨不同情境的可轉移性。我們透過在創傷相關的資料集上訓練進階複雜度的語言模型來解決這個差距，包括與種族滅絕相關的法院資料、關於創傷後壓力症候群 (PTSD) 的 Reddit 資料集、諮商對話以及 Incel 論壇文章。我們的結果顯示，微調後的 RoBERTa 模型在預測跨領域的創傷事件方面表現出色，略勝過 GPT-4 等大型語言模型。此外，SLALOM 特徵評分和概念解釋有效區分和群集創傷相關的語言，突顯不同的創傷面向，並將性虐待和與死亡相關的經驗識別為所有資料集中常見的創傷事件。這種可轉移性至關重要，因為它允許開發工具來增強創傷偵測和介入，適用於不同的族群和環境。", "author": "Miriam Schirmer et.al.", "authors": "Miriam Schirmer, Tobias Leemann, Gjergji Kasneci, Jürgen Pfeffer, David Jurgens", "id": "2408.05977v1", "paper_url": "http://arxiv.org/abs/2408.05977v1", "repo": "null"}}