{"2406.09790": {"publish_time": "2024-06-14", "title": "Pcc-tuning: Breaking the Contrastive Learning Ceiling in Semantic Textual Similarity", "paper_summary": "Semantic Textual Similarity (STS) constitutes a critical research direction\nin computational linguistics and serves as a key indicator of the encoding\ncapabilities of embedding models. Driven by advances in pre-trained language\nmodels and contrastive learning techniques, leading sentence representation\nmethods can already achieved average Spearman's correlation scores of\napproximately 86 across seven STS benchmarks in SentEval. However, further\nimprovements have become increasingly marginal, with no existing method\nattaining an average score higher than 87 on these tasks. This paper conducts\nan in-depth analysis of this phenomenon and concludes that the upper limit for\nSpearman's correlation scores using contrastive learning is 87.5. To transcend\nthis ceiling, we propose an innovative approach termed Pcc-tuning, which\nemploys Pearson's correlation coefficient as a loss function to refine model\nperformance beyond contrastive learning. Experimental results demonstrate that\nPcc-tuning markedly surpasses previous state-of-the-art strategies, raising the\nSpearman's correlation score to above 90.", "paper_summary_zh": "語義文本相似度 (STS) 構成計算語言學中一項重要的研究方向，同時也作為嵌入模型編碼能力的一個關鍵指標。在預先訓練語言模型和對比學習技術的推動下，領先的句子表示方法已經可以在 SentEval 中的七個 STS 基準測試中達到平均 Spearman 相關分數約 86 分。然而，進一步的改進變得越來越邊緣化，目前沒有任何現有方法在這些任務中達到平均分數高於 87 分。本文對此現象進行了深入分析，並得出結論，使用對比學習的 Spearman 相關分數的上限為 87.5。為了超越這個上限，我們提出了一種稱為 Pcc-tuning 的創新方法，它採用 Pearson 相關係數作為損失函數，以優化模型在對比學習之外的效能。實驗結果表明，Pcc-tuning 明顯優於先前的最先進策略，將 Spearman 相關分數提高到 90 分以上。", "author": "Bowen Zhang et.al.", "authors": "Bowen Zhang, Chunping Li", "id": "2406.09790v1", "paper_url": "http://arxiv.org/abs/2406.09790v1", "repo": "null"}}