{"2408.05859": {"publish_time": "2024-08-11", "title": "The Cognitive Revolution in Interpretability: From Explaining Behavior to Interpreting Representations and Algorithms", "paper_summary": "Artificial neural networks have long been understood as \"black boxes\": though\nwe know their computation graphs and learned parameters, the knowledge encoded\nby these weights and functions they perform are not inherently interpretable.\nAs such, from the early days of deep learning, there have been efforts to\nexplain these models' behavior and understand them internally; and recently,\nmechanistic interpretability (MI) has emerged as a distinct research area\nstudying the features and implicit algorithms learned by foundation models such\nas large language models. In this work, we aim to ground MI in the context of\ncognitive science, which has long struggled with analogous questions in\nstudying and explaining the behavior of \"black box\" intelligent systems like\nthe human brain. We leverage several important ideas and developments in the\nhistory of cognitive science to disentangle divergent objectives in MI and\nindicate a clear path forward. First, we argue that current methods are ripe to\nfacilitate a transition in deep learning interpretation echoing the \"cognitive\nrevolution\" in 20th-century psychology that shifted the study of human\npsychology from pure behaviorism toward mental representations and processing.\nSecond, we propose a taxonomy mirroring key parallels in computational\nneuroscience to describe two broad categories of MI research, semantic\ninterpretation (what latent representations are learned and used) and\nalgorithmic interpretation (what operations are performed over representations)\nto elucidate their divergent goals and objects of study. Finally, we elaborate\nthe parallels and distinctions between various approaches in both categories,\nanalyze the respective strengths and weaknesses of representative works,\nclarify underlying assumptions, outline key challenges, and discuss the\npossibility of unifying these modes of interpretation under a common framework.", "paper_summary_zh": "人工神經網路長期以來都被視為「黑盒子」：儘管我們知道它們的運算圖表和學習參數，但這些權重和它們執行的函數所編碼的知識並非天生就可解釋。因此，從深度學習的早期開始，就有許多人致力於解釋這些模型的行為並在內部理解它們；最近，機制可解釋性 (MI) 已成為一個獨特的的研究領域，探討基礎模型（例如大型語言模型）學習到的特徵和隱式演算法。在這項工作中，我們旨在將 MI 基於認知科學的背景，認知科學長期以來一直在研究和解釋「黑盒子」智能系統（例如人腦）的行為時，努力解決類似的問題。我們利用認知科學史上幾個重要的想法和發展，來解開 MI 中不同的目標，並指出明確的前進道路。首先，我們認為當前的各種方法已準備好促進深度學習解釋的轉變，這呼應了 20 世紀心理學中的「認知革命」，將人類心理學的研究從純粹的行為主義轉向心智表徵和處理。其次，我們提出一個分類法，反映計算神經科學中的關鍵相似之處，以描述 MI 研究的兩個廣泛類別，語義解釋（學習和使用的潛在表徵是什麼）和演算法解釋（在表徵上執行的運算是什麼），以闡明它們不同的目標和研究對象。最後，我們闡述了這兩個類別中各種方法之間的相似之處和區別，分析代表性作品的優缺點，釐清基本假設，概述關鍵挑戰，並討論在一個共同架構下統一這些解釋模式的可能性。", "author": "Adam Davies et.al.", "authors": "Adam Davies, Ashkan Khakzar", "id": "2408.05859v1", "paper_url": "http://arxiv.org/abs/2408.05859v1", "repo": "null"}}