{"2410.07809": {"publish_time": "2024-10-10", "title": "Linguistically-Informed Multilingual Instruction Tuning: Is There an Optimal Set of Languages to Tune?", "paper_summary": "Multilingual language models often perform unevenly across different\nlanguages due to limited generalization capabilities for some languages. This\nissue is significant because of the growing interest in making universal\nlanguage models that work well for all languages. Instruction tuning with\nmultilingual instruction-response pairs has been used to improve model\nperformance across various languages. However, this approach is challenged by\nhigh computational costs, a lack of quality tuning data for all languages, and\nthe \"curse of multilinguality\" -- the performance drop per language after\nadding many languages. Recent studies have found that working with datasets\nwith few languages and a smaller number of instances can be beneficial. Yet,\nthere exists no systematic investigation into how choosing different languages\naffects multilingual instruction tuning. Our study proposes a method to select\nlanguages for instruction tuning in a linguistically informed way, aiming to\nboost model performance across languages and tasks. We use a simple algorithm\nto choose diverse languages and test their effectiveness on various benchmarks\nand open-ended questions. Our results show that this careful selection\ngenerally leads to better outcomes than choosing languages at random. We\nsuggest a new and simple way of enhancing multilingual models by selecting\ndiverse languages based on linguistic features that could help develop better\nmultilingual systems and guide dataset creation efforts. All resources,\nincluding the code for language selection and multilingual instruction tuning,\nare made available in our official repository at\nhttps://github.com/GGLAB-KU/ling-informed-mit enabling reproducibility and\nfurther research in this area.", "paper_summary_zh": "多語言語言模型通常在不同語言之間表現不均，這是因為某些語言的概括能力有限。這個問題很重要，因為人們越來越有興趣建立對所有語言都有效的通用語言模型。透過多語言指令反應配對進行指令調整，已用於改善各種語言的模型效能。然而，這個方法受到高運算成本、缺乏所有語言的品質調整資料，以及「多語言的詛咒」的挑戰，也就是在加入許多語言後，每個語言的效能都會下降。最近的研究發現，使用語言較少且實例數量較小的資料集會很有幫助。然而，目前尚未系統性地探討選擇不同語言如何影響多語言指令調整。我們的研究提出了一種方法來以語言學為基礎的方式選擇指令調整的語言，目的是提升跨語言和任務的模型效能。我們使用一個簡單的演算法來選擇不同的語言，並在各種基準和開放式問題上測試其有效性。我們的結果顯示，這種仔細的選擇通常會比隨機選擇語言帶來更好的成果。我們建議一種新且簡單的方法，透過根據語言特徵選擇不同的語言來增強多語言模型，這有助於開發更好的多語言系統，並引導資料集建立工作。所有資源，包括語言選擇和多語言指令調整的程式碼，都可以在我們的官方存放庫中取得：https://github.com/GGLAB-KU/ling-informed-mit，以利於再現性，並進一步研究這個領域。", "author": "Gürkan Soykan et.al.", "authors": "Gürkan Soykan, Gözde Gül Şahin", "id": "2410.07809v1", "paper_url": "http://arxiv.org/abs/2410.07809v1", "repo": "https://github.com/gglab-ku/ling-informed-mit"}}