{"2407.20060": {"publish_time": "2024-07-29", "title": "RelBench: A Benchmark for Deep Learning on Relational Databases", "paper_summary": "We present RelBench, a public benchmark for solving predictive tasks over\nrelational databases with graph neural networks. RelBench provides databases\nand tasks spanning diverse domains and scales, and is intended to be a\nfoundational infrastructure for future research. We use RelBench to conduct the\nfirst comprehensive study of Relational Deep Learning (RDL) (Fey et al., 2024),\nwhich combines graph neural network predictive models with (deep) tabular\nmodels that extract initial entity-level representations from raw tables.\nEnd-to-end learned RDL models fully exploit the predictive signal encoded in\nprimary-foreign key links, marking a significant shift away from the dominant\nparadigm of manual feature engineering combined with tabular models. To\nthoroughly evaluate RDL against this prior gold-standard, we conduct an\nin-depth user study where an experienced data scientist manually engineers\nfeatures for each task. In this study, RDL learns better models whilst reducing\nhuman work needed by more than an order of magnitude. This demonstrates the\npower of deep learning for solving predictive tasks over relational databases,\nopening up many new research opportunities enabled by RelBench.", "paper_summary_zh": "我們提出 RelBench，一個用於解決關係資料庫中預測任務的公共基準，使用圖神經網路。RelBench 提供跨越不同領域和規模的資料庫和任務，並旨在成為未來研究的基本基礎設施。我們使用 RelBench 進行關係深度學習 (RDL) 的首次全面研究 (Fey et al., 2024)，它結合圖神經網路預測模型與（深度）表格模型，從原始表格中提取初始實體級別表示。端到端學習的 RDL 模型充分利用了主外鍵連結中編碼的預測信號，標誌著從結合表格模型的手動特徵工程的主流範例中顯著轉變。為了徹底評估 RDL 與此先前的黃金標準，我們進行了一項深入的使用者研究，其中一位經驗豐富的資料科學家手動為每個任務設計特徵。在這項研究中，RDL 學習更好的模型，同時將所需的人力減少了一個數量級以上。這展示了深度學習在解決關係資料庫預測任務中的強大功能，開啟了 RelBench 啟用的許多新的研究機會。", "author": "Joshua Robinson et.al.", "authors": "Joshua Robinson, Rishabh Ranjan, Weihua Hu, Kexin Huang, Jiaqi Han, Alejandro Dobles, Matthias Fey, Jan E. Lenssen, Yiwen Yuan, Zecheng Zhang, Xinwei He, Jure Leskovec", "id": "2407.20060v1", "paper_url": "http://arxiv.org/abs/2407.20060v1", "repo": "https://github.com/snap-stanford/relbench"}}