{"2404.04251": {"publish_time": "2024-04-05", "title": "Who Evaluates the Evaluations? Objectively Scoring Text-to-Image Prompt Coherence Metrics with T2IScoreScore (TS2)", "paper_summary": "With advances in the quality of text-to-image (T2I) models has come interest\nin benchmarking their prompt faithfulness-the semantic coherence of generated\nimages to the prompts they were conditioned on. A variety of T2I faithfulness\nmetrics have been proposed, leveraging advances in cross-modal embeddings and\nvision-language models (VLMs). However, these metrics are not rigorously\ncompared and benchmarked, instead presented against few weak baselines by\ncorrelation to human Likert scores over a set of easy-to-discriminate images.\n  We introduce T2IScoreScore (TS2), a curated set of semantic error graphs\ncontaining a prompt and a set increasingly erroneous images. These allow us to\nrigorously judge whether a given prompt faithfulness metric can correctly order\nimages with respect to their objective error count and significantly\ndiscriminate between different error nodes, using meta-metric scores derived\nfrom established statistical tests. Surprisingly, we find that the\nstate-of-the-art VLM-based metrics (e.g., TIFA, DSG, LLMScore, VIEScore) we\ntested fail to significantly outperform simple feature-based metrics like\nCLIPScore, particularly on a hard subset of naturally-occurring T2I model\nerrors. TS2 will enable the development of better T2I prompt faithfulness\nmetrics through more rigorous comparison of their conformity to expected\norderings and separations under objective criteria.", "paper_summary_zh": "隨著文字轉影像 (T2I) 模型品質的進步，人們開始對基準測試其提示忠實度感興趣，也就是產生的影像與其所根據的提示在語意上的連貫性。已經提出了各種 T2I 忠實度指標，利用跨模態嵌入和視覺語言模型 (VLM) 的進展。然而，這些指標並未經過嚴謹的比較和基準測試，而是透過與人類李克特量表分數在容易區分的影像集上的關聯性，與少數薄弱的基準線進行比較。我們引入了 T2IScoreScore (TS2)，這是一個經過整理的語意錯誤圖表集，其中包含一個提示和一組越來越錯誤的影像。這些圖表讓我們能夠嚴格判斷給定的提示忠實度指標是否能正確地根據客觀錯誤計數對影像進行排序，並使用源自既定統計檢定的元指標分數，在不同的錯誤節點之間進行顯著區分。令人驚訝的是，我們發現我們測試的基於 VLM 的最先進指標（例如 TIFA、DSG、LLMScore、VIEScore）無法顯著優於基於簡單特徵的指標，例如 CLIPScore，特別是在自然發生的 T2I 模型錯誤的困難子集中。TS2 將能夠透過更嚴格地比較其在客觀標準下符合預期的排序和分離，來開發出更好的 T2I 提示忠實度指標。", "author": "Michael Saxon et.al.", "authors": "Michael Saxon, Fatima Jahara, Mahsa Khoshnoodi, Yujie Lu, Aditya Sharma, William Yang Wang", "id": "2404.04251v1", "paper_url": "http://arxiv.org/abs/2404.04251v1", "repo": "https://github.com/michaelsaxon/T2IScoreScore"}}