{"2412.04782": {"publish_time": "2024-12-06", "title": "A Survey of Sustainability in Large Language Models: Applications, Economics, and Challenges", "paper_summary": "Large Language Models (LLMs) have transformed numerous domains by providing\nadvanced capabilities in natural language understanding, generation, and\nreasoning. Despite their groundbreaking applications across industries such as\nresearch, healthcare, and creative media, their rapid adoption raises critical\nconcerns regarding sustainability. This survey paper comprehensively examines\nthe environmental, economic, and computational challenges associated with LLMs,\nfocusing on energy consumption, carbon emissions, and resource utilization in\ndata centers. By synthesizing insights from existing literature, this work\nexplores strategies such as resource-efficient training, sustainable deployment\npractices, and lifecycle assessments to mitigate the environmental impacts of\nLLMs. Key areas of emphasis include energy optimization, renewable energy\nintegration, and balancing performance with sustainability. The findings aim to\nguide researchers, practitioners, and policymakers in developing actionable\nstrategies for sustainable AI systems, fostering a responsible and\nenvironmentally conscious future for artificial intelligence.", "paper_summary_zh": "大型語言模型 (LLM) 已透過提供自然語言理解、生成和推理的高階能力，轉變了許多領域。儘管它們在研究、醫療保健和創意媒體等產業中具有突破性的應用，但其快速採用也引發了有關永續性的重大疑慮。這篇調查報告全面探討了與 LLM 相關的環境、經濟和運算挑戰，重點關注資料中心的能源消耗、碳排放和資源利用。透過綜合現有文獻的見解，這項工作探討了資源有效訓練、永續部署實務和生命週期評估等策略，以減輕 LLM 對環境的影響。重點關注領域包括能源最佳化、再生能源整合，以及平衡效能與永續性。研究結果旨在引導研究人員、從業人員和政策制定者制定永續 AI 系統的可行策略，為人工智慧培養負責任且注重環境的未來。", "author": "Aditi Singh et.al.", "authors": "Aditi Singh, Nirmal Prakashbhai Patel, Abul Ehtesham, Saket Kumar, Tala Talaei Khoei", "id": "2412.04782v1", "paper_url": "http://arxiv.org/abs/2412.04782v1", "repo": "null"}}