{"2501.10075": {"publish_time": "2025-01-17", "title": "Robust Change Captioning in Remote Sensing: SECOND-CC Dataset and MModalCC Framework", "paper_summary": "Remote sensing change captioning (RSICC) aims to describe changes between\nbitemporal images in natural language. Existing methods often fail under\nchallenges like illumination differences, viewpoint changes, blur effects,\nleading to inaccuracies, especially in no-change regions. Moreover, the images\nacquired at different spatial resolutions and have registration errors tend to\naffect the captions. To address these issues, we introduce SECOND-CC, a novel\nRSICC dataset featuring high-resolution RGB image pairs, semantic segmentation\nmaps, and diverse real-world scenarios. SECOND-CC which contains 6,041 pairs of\nbitemporal RS images and 30,205 sentences describing the differences between\nimages. Additionally, we propose MModalCC, a multimodal framework that\nintegrates semantic and visual data using advanced attention mechanisms,\nincluding Cross-Modal Cross Attention (CMCA) and Multimodal Gated Cross\nAttention (MGCA). Detailed ablation studies and attention visualizations\nfurther demonstrate its effectiveness and ability to address RSICC challenges.\nComprehensive experiments show that MModalCC outperforms state-of-the-art RSICC\nmethods, including RSICCformer, Chg2Cap, and PSNet with +4.6% improvement on\nBLEU4 score and +9.6% improvement on CIDEr score. We will make our dataset and\ncodebase publicly available to facilitate future research at\nhttps://github.com/ChangeCapsInRS/SecondCC", "paper_summary_zh": "遙感變動標題（RSICC）旨在以自然語言描述雙時序影像間的變動。現有方法經常在光照差異、視角變動、模糊效果等挑戰下失效，導致不準確，特別是在無變動區域。此外，以不同空間解析度取得的影像和註冊錯誤往往會影響標題。為了解決這些問題，我們引入了 SECOND-CC，這是一個新穎的 RSICC 資料集，具備高解析度 RGB 影像對、語意分割地圖和多元的真實世界場景。SECOND-CC 包含 6,041 對雙時序 RS 影像和 30,205 個描述影像差異的句子。此外，我們提出了 MModalCC，這是一個多模態架構，使用進階注意機制整合語意和視覺資料，包括跨模態交叉注意（CMCA）和多模態閘控交叉注意（MGCA）。詳細的消融研究和注意視覺化進一步證明了其有效性和解決 RSICC 挑戰的能力。綜合實驗顯示，MModalCC 優於現有 RSICC 方法，包括 RSICCformer、Chg2Cap 和 PSNet，在 BLEU4 評分上提升了 +4.6%，在 CIDEr 評分上提升了 +9.6%。我們將公開我們的資料集和程式碼庫，以利於後續研究，網址為 https://github.com/ChangeCapsInRS/SecondCC", "author": "Ali Can Karaca et.al.", "authors": "Ali Can Karaca, M. Enes Ozelbas, Saadettin Berber, Orkhan Karimli, Turabi Yildirim, M. Fatih Amasyali", "id": "2501.10075v1", "paper_url": "http://arxiv.org/abs/2501.10075v1", "repo": "null"}}