{"2209.15398": {"publish_time": "2022-09-30", "title": "Evaluation of importance estimators in deep learning classifiers for Computed Tomography", "paper_summary": "Deep learning has shown superb performance in detecting objects and\nclassifying images, ensuring a great promise for analyzing medical imaging.\nTranslating the success of deep learning to medical imaging, in which doctors\nneed to understand the underlying process, requires the capability to interpret\nand explain the prediction of neural networks. Interpretability of deep neural\nnetworks often relies on estimating the importance of input features (e.g.,\npixels) with respect to the outcome (e.g., class probability). However, a\nnumber of importance estimators (also known as saliency maps) have been\ndeveloped and it is unclear which ones are more relevant for medical imaging\napplications. In the present work, we investigated the performance of several\nimportance estimators in explaining the classification of computed tomography\n(CT) images by a convolutional deep network, using three distinct evaluation\nmetrics. First, the model-centric fidelity measures a decrease in the model\naccuracy when certain inputs are perturbed. Second, concordance between\nimportance scores and the expert-defined segmentation masks is measured on a\npixel level by a receiver operating characteristic (ROC) curves. Third, we\nmeasure a region-wise overlap between a XRAI-based map and the segmentation\nmask by Dice Similarity Coefficients (DSC). Overall, two versions of SmoothGrad\ntopped the fidelity and ROC rankings, whereas both Integrated Gradients and\nSmoothGrad excelled in DSC evaluation. Interestingly, there was a critical\ndiscrepancy between model-centric (fidelity) and human-centric (ROC and DSC)\nevaluation. Expert expectation and intuition embedded in segmentation maps does\nnot necessarily align with how the model arrived at its prediction.\nUnderstanding this difference in interpretability would help harnessing the\npower of deep learning in medicine.", "paper_summary_zh": "", "author": "Lennart Brocki et.al.", "authors": "Lennart Brocki,Wistan Marchadour,Jonas Maison,Bogdan Badic,Panagiotis Papadimitroulas,Mathieu Hatt,Franck Vermet,Neo Christopher Chung", "id": "2209.15398v1", "paper_url": "http://arxiv.org/abs/2209.15398v1", "repo": "null"}}