{"2410.08105": {"publish_time": "2024-10-10", "title": "What Makes Large Language Models Reason in (Multi-Turn) Code Generation?", "paper_summary": "Prompting techniques such as chain-of-thought have established themselves as\na popular vehicle for improving the outputs of large language models (LLMs).\nFor code generation, however, their exact mechanics and efficacy are\nunder-explored. We thus investigate the effects of a wide range of prompting\nstrategies with a focus on automatic re-prompting over multiple turns and\ncomputational requirements. After systematically decomposing reasoning,\ninstruction, and execution feedback prompts, we conduct an extensive grid\nsearch on the competitive programming benchmarks CodeContests and TACO for\nmultiple LLM families and sizes (Llama 3.0 and 3.1, 8B, 70B, 405B, and GPT-4o).\nOur study reveals strategies that consistently improve performance across all\nmodels with small and large sampling budgets. We then show how finetuning with\nsuch an optimal configuration allows models to internalize the induced\nreasoning process and obtain improvements in performance and scalability for\nmulti-turn code generation.", "paper_summary_zh": "提示技術，例如思想鏈，已確立為改善大型語言模型 (LLM) 輸出的熱門載體。\n然而，對於程式碼產生，它們確切的機制和效力尚未得到充分探討。因此，我們研究了各種提示策略的影響，重點關注多輪自動重新提示和運算需求。在系統分解推理、指令和執行回饋提示後，我們對競爭性程式設計基準 CodeContests 和 TACO 進行了廣泛的網格搜尋，以涵蓋多個 LLM 家族和規模（Llama 3.0 和 3.1、8B、70B、405B 和 GPT-4o）。\n我們的研究揭示了在所有模型中持續改善效能的策略，這些模型具有小和大抽樣預算。然後，我們展示了如何使用此類最佳配置進行微調，使模型能夠內化誘導推理過程，並獲得多輪程式碼產生的效能和可擴充性改善。", "author": "Kunhao Zheng et.al.", "authors": "Kunhao Zheng, Juliette Decugis, Jonas Gehring, Taco Cohen, Benjamin Negrevergne, Gabriel Synnaeve", "id": "2410.08105v1", "paper_url": "http://arxiv.org/abs/2410.08105v1", "repo": "null"}}