{"2501.02688": {"publish_time": "2025-01-05", "title": "Decoding specialised feature neurons in LLMs with the final projection layer", "paper_summary": "Large Language Models (LLMs) typically have billions of parameters and are\nthus often difficult to interpret in their operation. Such black-box models can\npose a significant risk to safety when trusted to make important decisions. The\nlack of interpretability of LLMs is more related to their sheer size, rather\nthan the complexity of their individual components. The TARS method for\nknowledge removal (Davies et al 2024) provides strong evidence for the\nhypothesis that that linear layer weights which act directly on the residual\nstream may have high correlation with different concepts encoded in the\nresidual stream. Building upon this, we attempt to decode neuron weights\ndirectly into token probabilities through the final projection layer of the\nmodel (the LM-head). Firstly, we show that with Llama 3.1 8B we can utilise the\nLM-head to decode specialised feature neurons that respond strongly to certain\nconcepts, with examples such as \"dog\" and \"California\". This is then confirmed\nby demonstrating that these neurons can be clamped to affect the probability of\nthe concept in the output. This extends to the fine-tuned assistant Llama 3.1\n8B instruct model, where we find that over 75% of neurons in the up-projection\nlayers have the same top associated token compared to the pretrained model.\nFinally, we demonstrate that clamping the \"dog\" neuron leads the instruct model\nto always discuss dogs when asked about its favourite animal. Through our\nmethod, it is possible to map the entirety of Llama 3.1 8B's up-projection\nneurons in less than 15 minutes with no parallelization.", "paper_summary_zh": "大型語言模型 (LLM) 通常有數十億個參數，因此通常難以解釋其運作方式。當信任這些黑盒模型做出重要決策時，這些模型可能會對安全性構成重大風險。LLM 的難以解釋性與其龐大規模有關，而非其個別組成的複雜性。TARS 知識移除方法 (Davies 等人 2024) 為以下假設提供了強有力的證據：直接作用於殘差串流的線性層權重可能與殘差串流中編碼的不同概念高度相關。在此基礎上，我們嘗試通過模型的最終投影層（LM 頭部）將神經元權重直接解碼為代幣機率。首先，我們展示了使用 Llama 3.1 8B，我們可以使用 LM 頭部解碼對某些概念有強烈反應的專業特徵神經元，例如「狗」和「加州」。這隨後通過證明這些神經元可以被箝制以影響輸出中概念的機率而得到證實。這延伸到微調後的助理 Llama 3.1 8B 指令模型，我們發現上投影層中超過 75% 的神經元與預訓練模型相比具有相同的頂級關聯代幣。最後，我們證明箝制「狗」神經元會導致指令模型在被問及最喜歡的動物時總是討論狗。透過我們的方法，可以在不到 15 分鐘內將 Llama 3.1 8B 的上投影神經元整體對應，且無並行化。", "author": "Harry J Davies et.al.", "authors": "Harry J Davies", "id": "2501.02688v1", "paper_url": "http://arxiv.org/abs/2501.02688v1", "repo": "null"}}