{"2501.13302": {"publish_time": "2025-01-23", "title": "Watching the AI Watchdogs: A Fairness and Robustness Analysis of AI Safety Moderation Classifiers", "paper_summary": "AI Safety Moderation (ASM) classifiers are designed to moderate content on\nsocial media platforms and to serve as guardrails that prevent Large Language\nModels (LLMs) from being fine-tuned on unsafe inputs. Owing to their potential\nfor disparate impact, it is crucial to ensure that these classifiers: (1) do\nnot unfairly classify content belonging to users from minority groups as unsafe\ncompared to those from majority groups and (2) that their behavior remains\nrobust and consistent across similar inputs. In this work, we thus examine the\nfairness and robustness of four widely-used, closed-source ASM classifiers:\nOpenAI Moderation API, Perspective API, Google Cloud Natural Language (GCNL)\nAPI, and Clarifai API. We assess fairness using metrics such as demographic\nparity and conditional statistical parity, comparing their performance against\nASM models and a fair-only baseline. Additionally, we analyze robustness by\ntesting the classifiers' sensitivity to small and natural input perturbations.\nOur findings reveal potential fairness and robustness gaps, highlighting the\nneed to mitigate these issues in future versions of these models.", "paper_summary_zh": "AI 安全審核 (ASM) 分類器旨在審核社群媒體平台上的內容，並作為護欄，防止大型語言模型 (LLM) 在不安全的輸入上進行微調。由於它們具有產生不同影響的潛力，因此確保這些分類器至關重要：(1) 與多數群體相比，不會不公平地將少數群體使用者的內容分類為不安全，(2) 它們的行為在類似的輸入中保持穩健且一致。因此，在這項工作中，我們檢查了四個廣泛使用的閉源 ASM 分類器的公平性和穩健性：OpenAI Moderation API、Perspective API、Google Cloud Natural Language (GCNL) API 和 Clarifai API。我們使用人口統計同質性和條件統計同質性等指標評估公平性，並將其效能與 ASM 模型和僅公平的基準進行比較。此外，我們通過測試分類器對小型且自然的輸入擾動的敏感性來分析穩健性。我們的研究結果揭示了潛在的公平性和穩健性差距，突顯了在這些模型的未來版本中減輕這些問題的必要性。", "author": "Akshit Achara et.al.", "authors": "Akshit Achara, Anshuman Chhabra", "id": "2501.13302v1", "paper_url": "http://arxiv.org/abs/2501.13302v1", "repo": "null"}}