{"2412.20309": {"publish_time": "2024-12-29", "title": "Understanding the Impact of Confidence in Retrieval Augmented Generation: A Case Study in the Medical Domain", "paper_summary": "Retrieval Augmented Generation (RAG) complements the knowledge of Large\nLanguage Models (LLMs) by leveraging external information to enhance response\naccuracy for queries. This approach is widely applied in several fields by\ntaking its advantage of injecting the most up-to-date information, and\nresearchers are focusing on understanding and improving this aspect to unlock\nthe full potential of RAG in such high-stakes applications. However, despite\nthe potential of RAG to address these needs, the mechanisms behind the\nconfidence levels of its outputs remain underexplored, although the confidence\nof information is very critical in some domains, such as finance, healthcare,\nand medicine. Our study focuses the impact of RAG on confidence within the\nmedical domain under various configurations and models. We evaluate confidence\nby treating the model's predicted probability as its output and calculating\nExpected Calibration Error (ECE) and Adaptive Calibration Error (ACE) scores\nbased on the probabilities and accuracy. In addition, we analyze whether the\norder of retrieved documents within prompts calibrates the confidence. Our\nfindings reveal large variation in confidence and accuracy depending on the\nmodel, settings, and the format of input prompts. These results underscore the\nnecessity of optimizing configurations based on the specific model and\nconditions.", "paper_summary_zh": "檢索增強生成 (RAG) 透過利用外部資訊來提升回應精準度，以補充大型語言模型 (LLM) 的知識。此方法廣泛應用於多個領域，透過注入最新資訊來發揮優勢，而研究人員正專注於了解並改善此面向，以發揮 RAG 在此類高風險應用中的全部潛力。然而，儘管 RAG 有潛力滿足這些需求，但其輸出信心等級背後的機制仍未充分探討，儘管在某些領域（例如金融、醫療保健和醫學）中，資訊的信心至關重要。我們的研究著重於在各種組態和模型下，RAG 對醫療領域信心的影響。我們透過將模型預測的機率視為其輸出，並根據機率和準確度計算預期校準誤差 (ECE) 和適應性校準誤差 (ACE) 分數，來評估信心。此外，我們分析提示中檢索文件順序是否校準信心。我們的研究結果顯示，信心和準確度會因模型、設定和輸入提示格式而有很大的差異。這些結果強調了根據特定模型和條件最佳化組態的必要性。", "author": "Shintaro Ozaki et.al.", "authors": "Shintaro Ozaki, Yuta Kato, Siyuan Feng, Masayo Tomita, Kazuki Hayashi, Ryoma Obara, Masafumi Oyamada, Katsuhiko Hayashi, Hidetaka Kamigaito, Taro Watanabe", "id": "2412.20309v1", "paper_url": "http://arxiv.org/abs/2412.20309v1", "repo": "null"}}