{"2406.14894": {"publish_time": "2024-06-21", "title": "Talking the Talk Does Not Entail Walking the Walk: On the Limits of Large Language Models in Lexical Entailment Recognition", "paper_summary": "Verbs form the backbone of language, providing the structure and meaning to\nsentences. Yet, their intricate semantic nuances pose a longstanding challenge.\nUnderstanding verb relations through the concept of lexical entailment is\ncrucial for comprehending sentence meanings and grasping verb dynamics. This\nwork investigates the capabilities of eight Large Language Models in\nrecognizing lexical entailment relations among verbs through differently\ndevised prompting strategies and zero-/few-shot settings over verb pairs from\ntwo lexical databases, namely WordNet and HyperLex. Our findings unveil that\nthe models can tackle the lexical entailment recognition task with moderately\ngood performance, although at varying degree of effectiveness and under\ndifferent conditions. Also, utilizing few-shot prompting can enhance the\nmodels' performance. However, perfectly solving the task arises as an unmet\nchallenge for all examined LLMs, which raises an emergence for further research\ndevelopments on this topic.", "paper_summary_zh": "動詞構成語言的骨幹，提供句子結構和意義。然而，它們複雜的語義細微差別長期以來一直是一個挑戰。透過詞彙蘊涵的概念來理解動詞關係對於理解句子意義和掌握動態非常重要。本研究探討了八個大型語言模型在透過不同的提示策略和來自 WordNet 和 HyperLex 這兩個詞彙資料庫的動詞對的零次／少次學習設定中辨識動詞之間的詞彙蘊涵關係的能力。我們的研究結果揭示，這些模型可以處理詞彙蘊涵辨識任務，並有適度的良好表現，儘管在不同的條件下有效性程度不同。此外，利用少次學習提示可以增強模型的表現。然而，完美地解決這個任務對於所有受檢的 LLM 來說都是一個尚未達成的挑戰，這引發了進一步研究發展這個主題的必要性。", "author": "Candida M. Greco et.al.", "authors": "Candida M. Greco, Lucio La Cava, Andrea Tagarelli", "id": "2406.14894v1", "paper_url": "http://arxiv.org/abs/2406.14894v1", "repo": "null"}}