{"2410.02755": {"publish_time": "2024-10-03", "title": "SIEVE: General Purpose Data Filtering System Matching GPT-4o Accuracy at 1% the Cost", "paper_summary": "Creating specialized large language models requires vast amounts of clean,\nspecial purpose data for training and fine-tuning. With only a handful of\nexisting large-scale, domain-specific datasets, creation of new datasets is\nrequired in most applications. This requires the development of new\napplication-specific filtering of web-scale data. Filtering with a\nhigh-performance, general-purpose LLM such as GPT-4o can be highly effective,\nbut this is extremely expensive at web-scale. This paper proposes SIEVE, a\nlightweight alternative that matches GPT-4o accuracy at a fraction of the cost.\nSIEVE can perform up to 500 filtering operations for the cost of one GPT-4o\nfiltering call. The key to SIEVE is a seamless integration of GPT-4o and\nlightweight T5 models, using active learning to fine-tune T5 in the background\nwith a small number of calls to GPT-4o. Once trained, it performs as well as\nGPT-4o at a tiny fraction of the cost. We experimentally validate SIEVE on the\nOpenWebText dataset, using five highly customized filter tasks targeting high\nquality and domain-specific content. Our results demonstrate the effectiveness\nand efficiency of our method in curating large, high-quality datasets for\nlanguage model training at a substantially lower cost (1%) than existing\ntechniques. To further validate SIEVE, experiments show that SIEVE and GPT-4o\nachieve similar accuracy, with human evaluators preferring SIEVE's filtering\nresults to those of GPT-4o.", "paper_summary_zh": "<paragraph>建立專門的大語言模型需要大量乾淨且具有特定用途的資料，以進行訓練和微調。由於現有的大規模特定領域資料集只有少數幾個，因此在大部分應用程式中都必須建立新的資料集。這需要開發新的特定應用程式過濾網路規模資料的方式。使用高性能、通用 LLM（例如 GPT-4o）進行過濾可能會非常有效，但這在網路規模下極為昂貴。本文提出 SIEVE，這是一種輕量級的替代方案，其準確度與 GPT-4o 相同，但成本僅為其一小部分。SIEVE 可以執行多達 500 次過濾操作，其成本只相當於一次 GPT-4o 過濾呼叫。SIEVE 的關鍵是無縫整合 GPT-4o 和輕量級 T5 模型，使用主動學習在背景中微調 T5，並呼叫 GPT-4o 的次數很少。一旦完成訓練，其執行效能與 GPT-4o 一樣好，但成本卻只有後者的極小一部分。我們在 OpenWebText 資料集上對 SIEVE 進行實驗驗證，使用五項高度自訂的過濾任務，目標是高品質且特定於領域的內容。我們的結果證明了我們的方法在策展大型、高品質資料集以進行語言模型訓練的有效性和效率，其成本遠低於現有技術（1%）。為了進一步驗證 SIEVE，實驗顯示 SIEVE 和 GPT-4o 達到了類似的準確度，而人類評估者更偏好 SIEVE 的過濾結果，而非 GPT-4o 的過濾結果。</paragraph>", "author": "Jifan Zhang et.al.", "authors": "Jifan Zhang, Robert Nowak", "id": "2410.02755v1", "paper_url": "http://arxiv.org/abs/2410.02755v1", "repo": "null"}}