{"2410.15126": {"publish_time": "2024-10-19", "title": "MELT: Materials-aware Continued Pre-training for Language Model Adaptation to Materials Science", "paper_summary": "We introduce a novel continued pre-training method, MELT (MatEriaLs-aware\ncontinued pre-Training), specifically designed to efficiently adapt the\npre-trained language models (PLMs) for materials science. Unlike previous\nadaptation strategies that solely focus on constructing domain-specific corpus,\nMELT comprehensively considers both the corpus and the training strategy, given\nthat materials science corpus has distinct characteristics from other domains.\nTo this end, we first construct a comprehensive materials knowledge base from\nthe scientific corpus by building semantic graphs. Leveraging this extracted\nknowledge, we integrate a curriculum into the adaptation process that begins\nwith familiar and generalized concepts and progressively moves toward more\nspecialized terms. We conduct extensive experiments across diverse benchmarks\nto verify the effectiveness and generality of MELT. A comprehensive evaluation\nconvincingly supports the strength of MELT, demonstrating superior performance\ncompared to existing continued pre-training methods. The in-depth analysis also\nshows that MELT enables PLMs to effectively represent materials entities\ncompared to the existing adaptation methods, thereby highlighting its broad\napplicability across a wide spectrum of materials science.", "paper_summary_zh": "我們介紹了一種新穎的持續預訓練方法，MELT（MatEriaLs-aware持續預訓練），專門設計用於有效地調整材料科學的預訓練語言模型 (PLM)。與先前僅專注於建構特定領域語料庫的調整策略不同，MELT 全面考慮語料庫和訓練策略，因為材料科學語料庫具有不同於其他領域的特徵。為此，我們首先通過建立語義圖從科學語料庫構建一個全面的材料知識庫。利用提取的知識，我們將課程整合到調整過程中，從熟悉且通用的概念開始，逐漸轉向更專業的術語。我們在不同的基準上進行了廣泛的實驗，以驗證 MELT 的有效性和普遍性。全面的評估令人信服地支持了 MELT 的優點，與現有的持續預訓練方法相比，表現出優異的性能。深入分析還表明，與現有的調整方法相比，MELT 能讓 PLM 有效地表示材料實體，從而突顯其在廣泛的材料科學領域中的廣泛適用性。", "author": "Junho Kim et.al.", "authors": "Junho Kim, Yeachan Kim, Jun-Hyung Park, Yerim Oh, Suho Kim, SangKeun Lee", "id": "2410.15126v1", "paper_url": "http://arxiv.org/abs/2410.15126v1", "repo": "null"}}