{"2410.06651": {"publish_time": "2024-10-09", "title": "Toward Physics-guided Time Series Embedding", "paper_summary": "In various scientific and engineering fields, the primary research areas have\nrevolved around physics-based dynamical systems modeling and data-driven time\nseries analysis. According to the embedding theory, dynamical systems and time\nseries can be mutually transformed using observation functions and physical\nreconstruction techniques. Based on this, we propose Embedding Duality Theory,\nwhere the parameterized embedding layer essentially provides a linear\nestimation of the non-linear time series dynamics. This theory enables us to\nbypass the parameterized embedding layer and directly employ physical\nreconstruction techniques to acquire a data embedding representation. Utilizing\nphysical priors results in a 10X reduction in parameters, a 3X increase in\nspeed, and maximum performance boosts of 18% in expert, 22% in few-shot, and\n53\\% in zero-shot tasks without any hyper-parameter tuning. All methods are\nencapsulated as a plug-and-play module", "paper_summary_zh": "在各種科學和工程領域中，主要的研發領域圍繞著基於物理的動態系統建模和資料驅動的時間序列分析。根據嵌入理論，動態系統和時間序列可以使用觀測函數和物理重建技術相互轉換。基於此，我們提出了嵌入對偶理論，其中參數化嵌入層本質上提供了非線性時間序列動態的線性估計。此理論使我們能夠繞過參數化嵌入層，並直接採用物理重建技術來獲取資料嵌入表示。利用物理先驗可將參數減少 10 倍，速度提高 3 倍，且在專家任務中效能提升最高 18%，在少樣本任務中提升 22%，在零樣本任務中提升 53%，且無需任何超參數調整。所有方法都封裝為即插即用的模組", "author": "Jiaxi Hu et.al.", "authors": "Jiaxi Hu, Bowen Zhang, Qingsong Wen, Fugee Tsung, Yuxuan Liang", "id": "2410.06651v1", "paper_url": "http://arxiv.org/abs/2410.06651v1", "repo": "null"}}