{"2502.03957": {"publish_time": "2025-02-06", "title": "Improving the Perturbation-Based Explanation of Deepfake Detectors Through the Use of Adversarially-Generated Samples", "paper_summary": "In this paper, we introduce the idea of using adversarially-generated samples\nof the input images that were classified as deepfakes by a detector, to form\nperturbation masks for inferring the importance of different input features and\nproduce visual explanations. We generate these samples based on Natural\nEvolution Strategies, aiming to flip the original deepfake detector's decision\nand classify these samples as real. We apply this idea to four\nperturbation-based explanation methods (LIME, SHAP, SOBOL and RISE) and\nevaluate the performance of the resulting modified methods using a SOTA\ndeepfake detection model, a benchmarking dataset (FaceForensics++) and a\ncorresponding explanation evaluation framework. Our quantitative assessments\ndocument the mostly positive contribution of the proposed perturbation approach\nin the performance of explanation methods. Our qualitative analysis shows the\ncapacity of the modified explanation methods to demarcate the manipulated image\nregions more accurately, and thus to provide more useful explanations.", "paper_summary_zh": "在本文中，我們提出了一個想法，使用對抗生成樣本，這些樣本是通過一個檢測器將輸入圖像分類為深度偽造而形成的，以形成擾動遮罩，用於推斷不同輸入特徵的重要性並產生視覺解釋。我們基於自然演化策略生成這些樣本，旨在改變原始深度偽造檢測器的決策，並將這些樣本分類為真實的。我們將這個想法應用於四種基於擾動的解釋方法（LIME、SHAP、SOBOL 和 RISE），並使用 SOTA 深度偽造檢測模型、基準數據集（FaceForensics++）和相應的解釋評估框架評估所產生的修改方法的性能。我們的定量評估記錄了所提出的擾動方法在解釋方法的性能中大多數的積極貢獻。我們的定性分析顯示了修改後的解釋方法更準確地劃定被操縱的圖像區域的能力，從而提供更有用的解釋。", "author": "Konstantinos Tsigos et.al.", "authors": "Konstantinos Tsigos, Evlampios Apostolidis, Vasileios Mezaris", "id": "2502.03957v1", "paper_url": "http://arxiv.org/abs/2502.03957v1", "repo": "null"}}