{"2501.07482": {"publish_time": "2025-01-13", "title": "TiEBe: A Benchmark for Assessing the Current Knowledge of Large Language Models", "paper_summary": "In a rapidly evolving knowledge landscape and the increasing adoption of\nlarge language models, a need has emerged to keep these models continuously\nupdated with current events. While existing benchmarks evaluate general factual\nrecall, they often overlook two critical aspects: the ability of models to\nintegrate evolving knowledge through continual learning and the significant\nregional disparities in their performance. To address these gaps, we introduce\nthe Timely Events Benchmark (TiEBe), a dataset containing over 11,000\nquestion-answer pairs focused on globally and regionally significant events.\nTiEBe leverages structured retrospective data from Wikipedia, enabling\ncontinuous updates to assess LLMs' knowledge of evolving global affairs and\ntheir understanding of events across different regions. Our benchmark\ndemonstrates that LLMs exhibit substantial geographic disparities in factual\nrecall, emphasizing the need for more balanced global knowledge representation.\nFurthermore, TiEBe serves as a tool for evaluating continual learning\nstrategies, providing insights into models' ability to acquire new information\nwithout forgetting past knowledge.", "paper_summary_zh": "在快速演變的知識領域和大型語言模型的採用日益增加的情況下，出現了持續使用當前事件更新這些模型的需求。現有的基準評估一般的事實回憶，但它們往往忽視兩個關鍵方面：模型通過持續學習整合不斷演變的知識的能力以及它們在效能上的顯著區域差異。為了解決這些差距，我們引入了及時事件基準 (TiEBe)，這是一個包含超過 11,000 個問題答案對的資料集，重點關注全球和區域重要事件。TiEBe 採用來自維基百科的結構化回顧性資料，能夠持續更新以評估 LLM 對不斷演變的全球事務的了解以及它們對不同區域事件的理解。我們的基準證明，LLM 在事實回憶中表現出顯著的地理差異，強調了對更平衡的全球知識表示的需求。此外，TiEBe 可作為評估持續學習策略的工具，提供對模型在不忘記過去知識的情況下獲取新資訊的能力的見解。", "author": "Thales Sales Almeida et.al.", "authors": "Thales Sales Almeida, Giovana Kerche Bonás, João Guilherme Alves Santos, Hugo Abonizio, Rodrigo Nogueira", "id": "2501.07482v1", "paper_url": "http://arxiv.org/abs/2501.07482v1", "repo": "null"}}