{"2412.17522": {"publish_time": "2024-12-23", "title": "DiffusionAttacker: Diffusion-Driven Prompt Manipulation for LLM Jailbreak", "paper_summary": "Large Language Models (LLMs) are susceptible to generating harmful content\nwhen prompted with carefully crafted inputs, a vulnerability known as LLM\njailbreaking. As LLMs become more powerful, studying jailbreak methods is\ncritical to enhancing security and aligning models with human values.\nTraditionally, jailbreak techniques have relied on suffix addition or prompt\ntemplates, but these methods suffer from limited attack diversity. This paper\nintroduces DiffusionAttacker, an end-to-end generative approach for jailbreak\nrewriting inspired by diffusion models. Our method employs a\nsequence-to-sequence (seq2seq) text diffusion model as a generator,\nconditioning on the original prompt and guiding the denoising process with a\nnovel attack loss. Unlike previous approaches that use autoregressive LLMs to\ngenerate jailbreak prompts, which limit the modification of already generated\ntokens and restrict the rewriting space, DiffusionAttacker utilizes a seq2seq\ndiffusion model, allowing more flexible token modifications. This approach\npreserves the semantic content of the original prompt while producing harmful\ncontent. Additionally, we leverage the Gumbel-Softmax technique to make the\nsampling process from the diffusion model's output distribution differentiable,\neliminating the need for iterative token search. Extensive experiments on\nAdvbench and Harmbench demonstrate that DiffusionAttacker outperforms previous\nmethods across various evaluation metrics, including attack success rate (ASR),\nfluency, and diversity.", "paper_summary_zh": "大型語言模型 (LLM) 在收到精心設計的輸入時容易產生有害內容，此漏洞稱為 LLM 越獄。隨著 LLM 變得更強大，研究越獄方法對於增強安全性並使模型與人類價值觀保持一致至關重要。傳統上，越獄技術依賴於後綴添加或提示範本，但這些方法的攻擊多樣性有限。本文介紹了 DiffusionAttacker，一種靈感來自擴散模型的端到端生成式越獄重寫方法。我們的技術採用序列到序列 (seq2seq) 文本擴散模型作為生成器，以原始提示為條件，並使用新穎的攻擊損失來引導去噪過程。與使用自迴歸 LLM 來產生越獄提示的不同，這會限制已經產生的標記的修改並限制重寫空間，DiffusionAttacker 使用 seq2seq 擴散模型，允許更靈活的標記修改。這種方法保留了原始提示的語義內容，同時產生有害內容。此外，我們利用 Gumbel-Softmax 技術使從擴散模型輸出分佈中採樣的過程可微分，從而消除了對反覆標記搜索的需求。在 Advbench 和 Harmbench 上進行的廣泛實驗表明，DiffusionAttacker 在各種評估指標（包括攻擊成功率 (ASR)、流暢度和多樣性）上優於以前的方法。", "author": "Hao Wang et.al.", "authors": "Hao Wang, Hao Li, Junda Zhu, Xinyuan Wang, Chengwei Pan, MinLie Huang, Lei Sha", "id": "2412.17522v1", "paper_url": "http://arxiv.org/abs/2412.17522v1", "repo": "null"}}