{"2411.15008": {"publish_time": "2024-11-22", "title": "Evolutionary Automata and Deep Evolutionary Computation", "paper_summary": "Evolution by natural selection, which is one of the most compelling themes of\nmodern science, brought forth evolutionary algorithms and evolutionary\ncomputation, applying mechanisms of evolution in nature to various problems\nsolved by computers. In this paper we concentrate on evolutionary automata that\nconstitute an analogous model of evolutionary computation compared to\nwell-known evolutionary algorithms. Evolutionary automata provide a more\ncomplete dual model of evolutionary computation, similar like abstract automata\n(e.g., Turing machines) form a more formal and precise model compared to\nrecursive algorithms and their subset - evolutionary algorithms. An\nevolutionary automaton is an automaton that evolves performing evolutionary\ncomputation perhaps using an infinite number of generations. This model allows\nfor a direct modeling evolution of evolution, and leads to tremendous\nexpressiveness of evolutionary automata and evolutionary computation. This also\ngives the hint to the power of natural evolution that is self-evolving by\ninteractive feedback with the environment.", "paper_summary_zh": "自然選擇的演化，這是現代科學最引人入勝的主題之一，催生了演化演算法和演化運算，將自然中的演化機制應用於電腦解決的各種問題。在本文中，我們專注於演化自動機，與眾所周知的演化演算法相比，它構成了一個類似的演化運算模型。演化自動機提供了一個更完整的演化運算雙重模型，類似於抽象自動機（例如，圖靈機）與遞迴演算法及其子集（演化演算法）相比，形成了更正式且精確的模型。演化自動機是一種自動機，它演化執行演化運算，可能使用無限代數。此模型允許直接建模演化的演化，並導致演化自動機和演化運算的巨大表現力。這也暗示了自然演化的力量，它通過與環境的互動回饋而自我演化。", "author": "Eugene Eberbach et.al.", "authors": "Eugene Eberbach", "id": "2411.15008v1", "paper_url": "http://arxiv.org/abs/2411.15008v1", "repo": "null"}}