{"2409.07045": {"publish_time": "2024-09-11", "title": "Beyond IID: Optimizing Instruction Learning from the Perspective of Instruction Interaction and Dependency", "paper_summary": "With the availability of various instruction datasets, a pivotal challenge is\nhow to effectively select and integrate these instructions to fine-tune large\nlanguage models (LLMs). Previous research mainly focuses on selecting\nindividual high-quality instructions. However, these works overlooked the joint\ninteractions and dependencies between different categories of instructions,\nleading to suboptimal selection strategies. Moreover, the nature of these\ninteraction patterns remains largely unexplored, let alone optimize the\ninstruction set with regard to them. To fill these gaps, in this paper, we: (1)\nsystemically investigate interaction and dependency patterns between different\ncategories of instructions, (2) manage to optimize the instruction set\nconcerning the interaction patterns using a linear programming-based method,\nand optimize the learning schema of SFT using an instruction dependency\ntaxonomy guided curriculum learning. Experimental results across different LLMs\ndemonstrate improved performance over strong baselines on widely adopted\nbenchmarks.", "paper_summary_zh": "隨著各種指令資料集的出現，一個關鍵的挑戰在於如何有效地選擇和整合這些指令，以微調大型語言模型 (LLM)。先前的研究主要集中在選擇個別的高品質指令。然而，這些研究忽略了不同類別指令之間的聯合互動和依賴性，導致次佳的選擇策略。此外，這些互動模式的本質在很大程度上仍未被探索，更不用說根據它們來優化指令集。為了填補這些空白，在本文中，我們：(1) 系統性地研究不同類別指令之間的互動和依賴性模式，(2) 使用基於線性規劃的方法管理優化指令集，並使用指令依賴性分類指導課程學習來優化 SFT 的學習架構。跨不同 LLM 的實驗結果證明，在廣泛採用的基準上，相較於強大的基準線，我們的表現有所提升。", "author": "Hanyu Zhao et.al.", "authors": "Hanyu Zhao, Li Du, Yiming Ju, Chengwei Wu, Tengfei Pan", "id": "2409.07045v1", "paper_url": "http://arxiv.org/abs/2409.07045v1", "repo": "null"}}