{"2410.22766": {"publish_time": "2024-10-30", "title": "Self-Driving Car Racing: Application of Deep Reinforcement Learning", "paper_summary": "This paper explores the application of deep reinforcement learning (RL)\ntechniques in the domain of autonomous self-driving car racing. Motivated by\nthe rise of AI-driven mobility and autonomous racing events, the project aims\nto develop an AI agent that efficiently drives a simulated car in the OpenAI\nGymnasium CarRacing environment. We investigate various RL algorithms,\nincluding Deep Q-Network (DQN), Proximal Policy Optimization (PPO), and novel\nadaptations that incorporate transfer learning and recurrent neural networks\n(RNNs) for enhanced performance. The project demonstrates that while DQN\nprovides a strong baseline for policy learning, integrating ResNet and LSTM\nmodels significantly improves the agent's ability to capture complex spatial\nand temporal dynamics. PPO, particularly in continuous action spaces, shows\npromising results for fine control, although challenges such as policy collapse\nremain. We compare the performance of these approaches and outline future\nresearch directions focused on improving computational efficiency and\naddressing model stability. Our findings contribute to the ongoing development\nof AI systems in autonomous driving and related control tasks.", "paper_summary_zh": "本文探討深度強化學習 (RL) 技術在自動自駕車競賽領域的應用。受 AI 驅動的行動性和自動駕駛賽事的興起所激勵，本專案旨在開發一個 AI 代理，以便在 OpenAI Gymnasium CarRacing 環境中有效地駕駛模擬汽車。我們研究了各種 RL 演算法，包括深度 Q 網路 (DQN)、近端策略最佳化 (PPO)，以及結合轉移學習和遞迴神經網路 (RNN) 以增強效能的新穎改編。本專案證明，雖然 DQN 為策略學習提供了強大的基準，但整合 ResNet 和 LSTM 模型可顯著提升代理捕捉複雜空間和時間動態的能力。PPO，特別是在連續動作空間中，顯示出對於精細控制很有希望的結果，儘管策略崩潰等挑戰依然存在。我們比較了這些方法的效能，並概述了專注於改善運算效率和解決模型穩定性的未來研究方向。我們的研究結果有助於自動駕駛和相關控制任務中 AI 系統的持續發展。", "author": "Florentiana Yuwono et.al.", "authors": "Florentiana Yuwono, Gan Pang Yen, Jason Christopher", "id": "2410.22766v1", "paper_url": "http://arxiv.org/abs/2410.22766v1", "repo": "null"}}