{"2412.03844": {"publish_time": "2024-12-05", "title": "HybridGS: Decoupling Transients and Statics with 2D and 3D Gaussian Splatting", "paper_summary": "Generating high-quality novel view renderings of 3D Gaussian Splatting (3DGS)\nin scenes featuring transient objects is challenging. We propose a novel hybrid\nrepresentation, termed as HybridGS, using 2D Gaussians for transient objects\nper image and maintaining traditional 3D Gaussians for the whole static scenes.\nNote that, the 3DGS itself is better suited for modeling static scenes that\nassume multi-view consistency, but the transient objects appear occasionally\nand do not adhere to the assumption, thus we model them as planar objects from\na single view, represented with 2D Gaussians. Our novel representation\ndecomposes the scene from the perspective of fundamental viewpoint consistency,\nmaking it more reasonable. Additionally, we present a novel multi-view\nregulated supervision method for 3DGS that leverages information from\nco-visible regions, further enhancing the distinctions between the transients\nand statics. Then, we propose a straightforward yet effective multi-stage\ntraining strategy to ensure robust training and high-quality view synthesis\nacross various settings. Experiments on benchmark datasets show our\nstate-of-the-art performance of novel view synthesis in both indoor and outdoor\nscenes, even in the presence of distracting elements.", "paper_summary_zh": "在包含瞬態物體的場景中產生高品質的新視圖渲染 3D 高斯潑濺 (3DGS) 具有挑戰性。我們提出一個新穎的混合表示，稱為 HybridGS，使用 2D 高斯函數表示每個影像中的瞬態物體，並維持傳統的 3D 高斯函數表示整個靜態場景。請注意，3DGS 本身更適合於假設多視圖一致性的靜態場景建模，但瞬態物體偶爾出現且不符合此假設，因此我們將它們建模為來自單一視圖的平面物體，並使用 2D 高斯函數表示。我們的新穎表示從基本視點一致性的角度分解場景，使其更合理。此外，我們提出一個新穎的多視圖調節監督方法，用於 3DGS，該方法利用來自共視區域的資訊，進一步增強瞬態和靜態之間的區別。然後，我們提出一個簡單但有效的多分段訓練策略，以確保穩健的訓練和在各種設定中進行高品質的視圖合成。基準資料集上的實驗顯示，我們在室內和室外場景中進行新視圖合成的最先進效能，即使在存在干擾元素的情況下也是如此。", "author": "Jingyu Lin et.al.", "authors": "Jingyu Lin, Jiaqi Gu, Lubin Fan, Bojian Wu, Yujing Lou, Renjie Chen, Ligang Liu, Jieping Ye", "id": "2412.03844v1", "paper_url": "http://arxiv.org/abs/2412.03844v1", "repo": "null"}}