{"2501.18565": {"publish_time": "2025-01-30", "title": "BounTCHA: A CAPTCHA Utilizing Boundary Identification in AI-extended Videos", "paper_summary": "In recent years, the rapid development of artificial intelligence (AI)\nespecially multi-modal Large Language Models (MLLMs), has enabled it to\nunderstand text, images, videos, and other multimedia data, allowing AI systems\nto execute various tasks based on human-provided prompts. However, AI-powered\nbots have increasingly been able to bypass most existing CAPTCHA systems,\nposing significant security threats to web applications. This makes the design\nof new CAPTCHA mechanisms an urgent priority. We observe that humans are highly\nsensitive to shifts and abrupt changes in videos, while current AI systems\nstill struggle to comprehend and respond to such situations effectively. Based\non this observation, we design and implement BounTCHA, a CAPTCHA mechanism that\nleverages human perception of boundaries in video transitions and disruptions.\nBy utilizing AI's capability to expand original videos with prompts, we\nintroduce unexpected twists and changes to create a pipeline for generating\nshort videos for CAPTCHA purposes. We develop a prototype and conduct\nexperiments to collect data on humans' time biases in boundary identification.\nThis data serves as a basis for distinguishing between human users and bots.\nAdditionally, we perform a detailed security analysis of BounTCHA,\ndemonstrating its resilience against various types of attacks. We hope that\nBounTCHA will act as a robust defense, safeguarding millions of web\napplications in the AI-driven era.", "paper_summary_zh": "近年來，人工智慧（AI）的快速發展，特別是多模態大型語言模型（MLLM），已能理解文字、圖像、影片和其他多媒體資料，讓 AI 系統能根據人類提供的提示執行各種任務。然而，由 AI 驅動的機器人越來越能繞過現有的 CAPTCHA 系統，對網路應用程式造成重大的安全威脅。這使得設計新的 CAPTCHA 機制成為當務之急。我們觀察到人類對影片中的變化和突然的改變非常敏感，而目前的 AI 系統仍然難以理解並有效應對這種情況。基於此觀察，我們設計並實作了 BounTCHA，這是一種 CAPTCHA 機制，它利用人類對影片轉場和中斷中邊界的感知。透過利用 AI 將原始影片擴充到提示的能力，我們引入了意想不到的曲折和變化，以建立一個產生短影片的管道，用於 CAPTCHA 目的。我們開發了一個原型並進行實驗，以收集人類在邊界辨識中時間偏誤的資料。這些資料作為區分人類使用者和機器人的基礎。此外，我們對 BounTCHA 進行了詳細的安全分析，證明了它對各種攻擊類型的韌性。我們希望 BounTCHA 能作為一個強大的防禦措施，在 AI 驅動的時代保護數百萬個網路應用程式。", "author": "Lehao Lin et.al.", "authors": "Lehao Lin, Ke Wang, Maha Abdallah, Wei Cai", "id": "2501.18565v1", "paper_url": "http://arxiv.org/abs/2501.18565v1", "repo": "null"}}