{"2411.07536": {"publish_time": "2024-11-12", "title": "Model Stealing for Any Low-Rank Language Model", "paper_summary": "Model stealing, where a learner tries to recover an unknown model via\ncarefully chosen queries, is a critical problem in machine learning, as it\nthreatens the security of proprietary models and the privacy of data they are\ntrained on. In recent years, there has been particular interest in stealing\nlarge language models (LLMs). In this paper, we aim to build a theoretical\nunderstanding of stealing language models by studying a simple and\nmathematically tractable setting. We study model stealing for Hidden Markov\nModels (HMMs), and more generally low-rank language models.\n  We assume that the learner works in the conditional query model, introduced\nby Kakade, Krishnamurthy, Mahajan and Zhang. Our main result is an efficient\nalgorithm in the conditional query model, for learning any low-rank\ndistribution. In other words, our algorithm succeeds at stealing any language\nmodel whose output distribution is low-rank. This improves upon the previous\nresult by Kakade, Krishnamurthy, Mahajan and Zhang, which also requires the\nunknown distribution to have high \"fidelity\", a property that holds only in\nrestricted cases. There are two key insights behind our algorithm: First, we\nrepresent the conditional distributions at each timestep by constructing\nbarycentric spanners among a collection of vectors of exponentially large\ndimension. Second, for sampling from our representation, we iteratively solve a\nsequence of convex optimization problems that involve projection in relative\nentropy to prevent compounding of errors over the length of the sequence. This\nis an interesting example where, at least theoretically, allowing a machine\nlearning model to solve more complex problems at inference time can lead to\ndrastic improvements in its performance.", "paper_summary_zh": "模型竊取，其中學習者嘗試通過仔細選擇的查詢來恢復未知模型，是機器學習中的關鍵問題，因為它威脅到專有模型的安全性以及訓練它們的數據的隱私。近年來，人們對竊取大型語言模型 (LLM) 特別感興趣。在本文中，我們旨在通過研究一個簡單且在數學上易於處理的設置來建立對竊取語言模型的理論理解。我們研究隱藏馬爾可夫模型 (HMM) 的模型竊取，更普遍地研究低秩語言模型。我們假設學習者在條件查詢模型中工作，由 Kakade、Krishnamurthy、Mahajan 和 Zhang 提出。我們的成果是在條件查詢模型中一種用於學習任何低秩分佈的有效演算法。換句話說，我們的演算法成功竊取任何輸出分佈為低秩的語言模型。這改進了 Kakade、Krishnamurthy、Mahajan 和 Zhang 先前的成果，該成果還要求未知分佈具有很高的「保真度」，這是一個僅在受限情況下成立的屬性。我們的演算法背後有兩個關鍵見解：首先，我們通過在大量維度向量集合中建構重心張弦器來表示每個時間步長的條件分佈。其次，為了從我們的表示中進行抽樣，我們反覆求解一系列凸優化問題，其中涉及相對熵中的投影，以防止錯誤在序列長度上累積。這是一個有趣的例子，至少在理論上，允許機器學習模型在推理時解決更複雜的問題可以大幅提升其效能。", "author": "Allen Liu et.al.", "authors": "Allen Liu, Ankur Moitra", "id": "2411.07536v1", "paper_url": "http://arxiv.org/abs/2411.07536v1", "repo": "null"}}