{"2410.12607": {"publish_time": "2024-10-16", "title": "Low-Rank Adversarial PGD Attack", "paper_summary": "Adversarial attacks on deep neural network models have seen rapid development\nand are extensively used to study the stability of these networks. Among\nvarious adversarial strategies, Projected Gradient Descent (PGD) is a widely\nadopted method in computer vision due to its effectiveness and quick\nimplementation, making it suitable for adversarial training. In this work, we\nobserve that in many cases, the perturbations computed using PGD predominantly\naffect only a portion of the singular value spectrum of the original image,\nsuggesting that these perturbations are approximately low-rank. Motivated by\nthis observation, we propose a variation of PGD that efficiently computes a\nlow-rank attack. We extensively validate our method on a range of standard\nmodels as well as robust models that have undergone adversarial training. Our\nanalysis indicates that the proposed low-rank PGD can be effectively used in\nadversarial training due to its straightforward and fast implementation coupled\nwith competitive performance. Notably, we find that low-rank PGD often performs\ncomparably to, and sometimes even outperforms, the traditional full-rank PGD\nattack, while using significantly less memory.", "paper_summary_zh": "對深度神經網路模型的對抗攻擊已經快速發展，並廣泛用於研究這些網路的穩定性。在各種對抗策略中，投影梯度下降 (PGD) 是一種在電腦視覺中廣泛採用的方法，因為它的有效性和快速實作，使其適合於對抗訓練。在這項工作中，我們觀察到在許多情況下，使用 PGD 計算的擾動主要只影響原始影像的奇異值頻譜的一部分，這表示這些擾動大約是低秩的。受到這個觀察的啟發，我們提出 PGD 的一種變體，可以有效地計算低秩攻擊。我們廣泛驗證了我們的方法，包括一系列標準模型以及經過對抗訓練的強健模型。我們的分析表明，所提出的低秩 PGD 可以有效地用於對抗訓練，因為它的實作簡單快速，並且效能具有競爭力。值得注意的是，我們發現低秩 PGD 通常表現得與傳統全秩 PGD 攻擊相當，甚至有時表現得更好，同時使用的記憶體卻少得多。", "author": "Dayana Savostianova et.al.", "authors": "Dayana Savostianova, Emanuele Zangrando, Francesco Tudisco", "id": "2410.12607v1", "paper_url": "http://arxiv.org/abs/2410.12607v1", "repo": "null"}}