{"2410.08876": {"publish_time": "2024-10-11", "title": "RoRA-VLM: Robust Retrieval-Augmented Vision Language Models", "paper_summary": "Current vision-language models (VLMs) still exhibit inferior performance on\nknowledge-intensive tasks, primarily due to the challenge of accurately\nencoding all the associations between visual objects and scenes to their\ncorresponding entities and background knowledge. While retrieval augmentation\nmethods offer an efficient way to integrate external knowledge, extending them\nto vision-language domain presents unique challenges in (1) precisely\nretrieving relevant information from external sources due to the inherent\ndiscrepancy within the multimodal queries, and (2) being resilient to the\nirrelevant, extraneous and noisy information contained in the retrieved\nmultimodal knowledge snippets. In this work, we introduce RORA-VLM, a novel and\nrobust retrieval augmentation framework specifically tailored for VLMs, with\ntwo key innovations: (1) a 2-stage retrieval process with image-anchored\ntextual-query expansion to synergistically combine the visual and textual\ninformation in the query and retrieve the most relevant multimodal knowledge\nsnippets; and (2) a robust retrieval augmentation method that strengthens the\nresilience of VLMs against irrelevant information in the retrieved multimodal\nknowledge by injecting adversarial noises into the retrieval-augmented training\nprocess, and filters out extraneous visual information, such as unrelated\nentities presented in images, via a query-oriented visual token refinement\nstrategy. We conduct extensive experiments to validate the effectiveness and\nrobustness of our proposed methods on three widely adopted benchmark datasets.\nOur results demonstrate that with a minimal amount of training instance,\nRORA-VLM enables the base model to achieve significant performance improvement\nand constantly outperform state-of-the-art retrieval-augmented VLMs on all\nbenchmarks while also exhibiting a novel zero-shot domain transfer capability.", "paper_summary_zh": "<paragraph>目前的視覺語言模型 (VLM) 在知識密集型任務中仍表現出較差的效能，這主要是因為準確編碼視覺物件和場景與其對應實體和背景知識之間的所有關聯的挑戰。雖然檢索擴充方法提供了一種整合外部知識的有效方式，但將它們擴展到視覺語言領域會帶來獨特的挑戰，包括：(1) 由於多模態查詢中固有的差異，從外部來源準確檢索相關資訊，以及 (2) 對檢索到的多模態知識片段中包含的不相關、無關和有雜訊的資訊具有彈性。在這項工作中，我們引入了 RORA-VLM，這是一個專門為 VLM 量身打造的新穎且強大的檢索擴充架構，具有兩項關鍵創新：(1) 一個 2 階段檢索程序，具有影像錨定的文字查詢擴充，可以協同結合查詢中的視覺和文字資訊，並檢索最相關的多模態知識片段；以及 (2) 一個強大的檢索擴充方法，透過在檢索擴充訓練過程中注入對抗性雜訊，強化 VLM 對檢索到的多模態知識中不相關資訊的彈性，並透過以查詢為導向的視覺標記精煉策略，過濾掉無關的視覺資訊，例如影像中呈現的不相關實體。我們進行了廣泛的實驗，以驗證我們所提出的方法在三個廣泛採用的基準資料集上的有效性和強健性。我們的結果證明，透過最少量的訓練實例，RORA-VLM 能讓基礎模型獲得顯著的效能提升，並在所有基準上持續優於最先進的檢索擴充 VLM，同時也展現出新穎的零次學習領域轉移能力。</paragraph>", "author": "Jingyuan Qi et.al.", "authors": "Jingyuan Qi, Zhiyang Xu, Rulin Shao, Yang Chen, Jing Di, Yu Cheng, Qifan Wang, Lifu Huang", "id": "2410.08876v1", "paper_url": "http://arxiv.org/abs/2410.08876v1", "repo": "null"}}