{"2406.10144": {"publish_time": "2024-06-14", "title": "Improving rule mining via embedding-based link prediction", "paper_summary": "Rule mining on knowledge graphs allows for explainable link prediction.\nContrarily, embedding-based methods for link prediction are well known for\ntheir generalization capabilities, but their predictions are not interpretable.\nSeveral approaches combining the two families have been proposed in recent\nyears. The majority of the resulting hybrid approaches are usually trained\nwithin a unified learning framework, which often leads to convergence issues\ndue to the complexity of the learning task. In this work, we propose a new way\nto combine the two families of approaches. Specifically, we enrich a given\nknowledge graph by means of its pre-trained entity and relation embeddings\nbefore applying rule mining systems on the enriched knowledge graph. To\nvalidate our approach, we conduct extensive experiments on seven benchmark\ndatasets. An analysis of the results generated by our approach suggests that we\ndiscover new valuable rules on the enriched graphs. We provide an open source\nimplementation of our approach as well as pretrained models and datasets at\nhttps://github.com/Jean-KOUAGOU/EnhancedRuleLearning", "paper_summary_zh": "知識圖譜上的規則挖掘允許可解釋的連結預測。\n相反地，基於嵌入的連結預測方法以其概化能力而聞名，但其預測不可解釋。\n近年來已經提出了結合這兩個系列的幾種方法。大多數產生的混合方法通常在統一的學習框架內進行訓練，這由於學習任務的複雜性，通常會導致收斂問題。在這項工作中，我們提出了一種結合這兩個系列方法的新方法。具體來說，我們通過其預先訓練的實體和關係嵌入來豐富給定的知識圖譜，然後在豐富的知識圖譜上應用規則挖掘系統。為了驗證我們的做法，我們對七個基準資料集進行了廣泛的實驗。對我們的方法產生的結果的分析表明，我們在豐富的圖譜上發現了有價值的新規則。我們提供了我們方法的開源實現，以及預訓練模型和資料集，網址為 https://github.com/Jean-KOUAGOU/EnhancedRuleLearning", "author": "N'Dah Jean Kouagou et.al.", "authors": "N'Dah Jean Kouagou, Arif Yilmaz, Michel Dumontier, Axel-Cyrille Ngonga Ngomo", "id": "2406.10144v1", "paper_url": "http://arxiv.org/abs/2406.10144v1", "repo": "https://github.com/jean-kouagou/enhancedrulelearning"}}