{"2411.03665": {"publish_time": "2024-11-06", "title": "Evaluating Moral Beliefs across LLMs through a Pluralistic Framework", "paper_summary": "Proper moral beliefs are fundamental for language models, yet assessing these\nbeliefs poses a significant challenge. This study introduces a novel\nthree-module framework to evaluate the moral beliefs of four prominent large\nlanguage models. Initially, we constructed a dataset containing 472 moral\nchoice scenarios in Chinese, derived from moral words. The decision-making\nprocess of the models in these scenarios reveals their moral principle\npreferences. By ranking these moral choices, we discern the varying moral\nbeliefs held by different language models. Additionally, through moral debates,\nwe investigate the firmness of these models to their moral choices. Our\nfindings indicate that English language models, namely ChatGPT and Gemini,\nclosely mirror moral decisions of the sample of Chinese university students,\ndemonstrating strong adherence to their choices and a preference for\nindividualistic moral beliefs. In contrast, Chinese models such as Ernie and\nChatGLM lean towards collectivist moral beliefs, exhibiting ambiguity in their\nmoral choices and debates. This study also uncovers gender bias embedded within\nthe moral beliefs of all examined language models. Our methodology offers an\ninnovative means to assess moral beliefs in both artificial and human\nintelligence, facilitating a comparison of moral values across different\ncultures.", "paper_summary_zh": "適當的道德信念對於語言模型至關重要，然而評估這些信念卻是一項重大挑戰。本研究引入了一個新穎的三模組架構來評估四個傑出的大型語言模型的道德信念。最初，我們構建了一個包含 472 個道德選擇情境的中文資料集，這些情境源自道德詞彙。模型在這些情境中的決策過程揭示了它們的道德原則偏好。透過對這些道德選擇進行排名，我們辨別了不同語言模型所持有的不同道德信念。此外，透過道德辯論，我們探討了這些模型對其道德選擇的堅定程度。我們的研究結果表明，英語語言模型，即 ChatGPT 和 Gemini，與中國大學生樣本的道德決策非常相似，表明它們堅定地堅持自己的選擇，並且偏好個人主義道德信念。相比之下，Ernie 和 ChatGLM 等中文模型則傾向於集體主義道德信念，在他們的道德選擇和辯論中表現出模稜兩可的態度。本研究還揭示了所有受檢語言模型的道德信念中存在的性別偏見。我們的研究方法提供了一個創新的方式來評估人工和人類智慧中的道德信念，從而促進不同文化之間道德價值觀的比較。", "author": "Xuelin Liu et.al.", "authors": "Xuelin Liu, Yanfei Zhu, Shucheng Zhu, Pengyuan Liu, Ying Liu, Dong Yu", "id": "2411.03665v1", "paper_url": "http://arxiv.org/abs/2411.03665v1", "repo": "https://github.com/mumu-lily/moral-beliefs"}}