{"2501.05408": {"publish_time": "2025-01-09", "title": "TimeRL: Efficient Deep Reinforcement Learning with Polyhedral Dependence Graphs", "paper_summary": "Modern deep learning (DL) workloads increasingly use complex deep\nreinforcement learning (DRL) algorithms that generate training data within the\nlearning loop. This results in programs with several nested loops and dynamic\ndata dependencies between tensors. While DL systems with eager execution\nsupport such dynamism, they lack the optimizations and smart scheduling of\ngraph-based execution. Graph-based execution, however, cannot express dynamic\ntensor shapes, instead requiring the use of multiple static subgraphs. Either\nexecution model for DRL thus leads to redundant computation, reduced\nparallelism, and less efficient memory management.\n  We describe TimeRL, a system for executing dynamic DRL programs that combines\nthe dynamism of eager execution with the whole-program optimizations and\nscheduling of graph-based execution. TimeRL achieves this by introducing the\ndeclarative programming model of recurrent tensors, which allows users to\ndefine dynamic dependencies as intuitive recurrence equations. TimeRL\ntranslates recurrent tensors into a polyhedral dependence graph (PDG) with\ndynamic dependencies as symbolic expressions. Through simple PDG\ntransformations, TimeRL applies whole-program optimizations, such as automatic\nvectorization, incrementalization, and operator fusion. The PDG also allows for\nthe computation of an efficient program-wide execution schedule, which decides\non buffer deallocations, buffer donations, and GPU/CPU memory swapping. We show\nthat TimeRL executes current DRL algorithms up to 47$\\times$ faster than\nexisting DRL systems, while using 16$\\times$ less GPU peak memory.", "paper_summary_zh": "現代深度學習 (DL) 工作負載日益使用複雜的深度強化學習 (DRL) 演算法，在學習迴圈中產生訓練資料。這會產生具有多個巢狀迴圈和張量之間動態資料相依性的程式。雖然具有熱切執行功能的 DL 系統支援這種動態性，但它們缺乏圖形化執行最佳化和智慧化排程。然而，圖形化執行無法表達動態張量形狀，反而需要使用多個靜態子圖形。因此，DRL 的任一執行模型都會導致重複運算、降低並行度和記憶體管理效率不彰。\n我們描述 TimeRL，這是一個用於執行動態 DRL 程式的系統，它結合了熱切執行的動態性與圖形化執行的全程式最佳化和排程。TimeRL 透過引入遞迴張量的宣告式程式設計模型來達成此一目標，使用戶能夠將動態相依性定義為直覺的遞迴方程式。TimeRL 將遞迴張量轉換為具有動態相依性（作為符號表達式）的多面體相依圖形 (PDG)。透過簡單的 PDG 轉換，TimeRL 套用全程式最佳化，例如自動向量化、遞增化和運算子融合。PDG 也允許計算出有效的全程式執行排程，決定緩衝區取消配置、緩衝區捐贈和 GPU/CPU 記憶體交換。我們顯示 TimeRL 執行目前的 DRL 演算法速度比現有的 DRL 系統快達 47 倍，同時使用少 16 倍的 GPU 峰值記憶體。", "author": "Pedro F. Silvestre et.al.", "authors": "Pedro F. Silvestre, Peter Pietzuch", "id": "2501.05408v1", "paper_url": "http://arxiv.org/abs/2501.05408v1", "repo": "null"}}