{"2406.18067": {"publish_time": "2024-06-26", "title": "Exploring Energy-Based Models for Out-of-Distribution Detection in Dialect Identification", "paper_summary": "The diverse nature of dialects presents challenges for models trained on\nspecific linguistic patterns, rendering them susceptible to errors when\nconfronted with unseen or out-of-distribution (OOD) data. This study introduces\na novel margin-enhanced joint energy model (MEJEM) tailored specifically for\nOOD detection in dialects. By integrating a generative model and the energy\nmargin loss, our approach aims to enhance the robustness of dialect\nidentification systems. Furthermore, we explore two OOD scores for OOD dialect\ndetection, and our findings conclusively demonstrate that the energy score\noutperforms the softmax score. Leveraging Sharpness-Aware Minimization to\noptimize the training process of the joint model, we enhance model\ngeneralization by minimizing both loss and sharpness. Experiments conducted on\ndialect identification tasks validate the efficacy of Energy-Based Models and\nprovide valuable insights into their performance.", "paper_summary_zh": "方言的多樣性對訓練特定語言模式的模型構成挑戰，使它們在面對未見或分佈外 (OOD) 資料時容易出現錯誤。本研究介紹了一種新的邊界增強聯合能量模型 (MEJEM)，專門針對方言中的 OOD 偵測而設計。透過整合生成模型和能量邊界損失，我們的做法旨在增強方言辨識系統的穩健性。此外，我們探討了兩個用於 OOD 方言偵測的 OOD 分數，我們的研究結果明確證明能量分數優於 softmax 分數。利用銳利度感知最小化來最佳化聯合模型的訓練過程，我們透過最小化損失和銳利度來增強模型的泛化能力。在方言辨識任務上進行的實驗驗證了基於能量的模型的效能，並提供了對其效能的寶貴見解。", "author": "Yaqian Hao et.al.", "authors": "Yaqian Hao, Chenguang Hu, Yingying Gao, Shilei Zhang, Junlan Feng", "id": "2406.18067v1", "paper_url": "http://arxiv.org/abs/2406.18067v1", "repo": "null"}}