{"2501.03475": {"publish_time": "2025-01-07", "title": "Reading with Intent -- Neutralizing Intent", "paper_summary": "Queries to large language models (LLMs) can be divided into two parts: the\ninstruction/question and the accompanying context. The context for\nretrieval-augmented generation (RAG) systems in most benchmarks comes from\nWikipedia or Wikipedia-like texts which are written in a neutral and factual\ntone. However, when RAG systems retrieve internet-based content, they encounter\ntext with diverse tones and linguistic styles, introducing challenges for\ndownstream tasks. The Reading with Intent task addresses this issue by\nevaluating how varying tones in context passages affect model performance.\nBuilding on prior work that focused on sarcasm, we extend this paradigm by\nconstructing a dataset where context passages are transformed to $11$ distinct\nemotions using a better synthetic data generation approach. Using this dataset,\nwe train an emotion translation model to systematically adapt passages to\nspecified emotional tones. The human evaluation shows that the LLM fine-tuned\nto become the emotion-translator benefited from the synthetically generated\ndata. Finally, the emotion-translator is used in the Reading with Intent task\nto transform the passages to a neutral tone. By neutralizing the passages, it\nmitigates the challenges posed by sarcastic passages and improves overall\nresults on this task by about $3\\%$.", "paper_summary_zh": "大型語言模型 (LLM) 的查詢可以分為兩部分：指令/問題和附帶的內容。在大多數基準測試中，用於檢索增強生成 (RAG) 系統的內容來自維基百科或類似維基百科的文本，這些文本以中立且客觀的語氣撰寫。然而，當 RAG 系統檢索基於網路的內容時，它們會遇到語氣和語言風格多樣的文字，對下游任務造成挑戰。閱讀意圖任務透過評估語境段落中的不同語氣如何影響模型效能來解決這個問題。在專注於諷刺的先前工作基礎上，我們透過建構一個資料集來延伸這個範例，其中語境段落使用更好的合成資料生成方法轉換為 11 種不同的情緒。使用這個資料集，我們訓練一個情緒翻譯模型來系統性地調整段落以符合指定的情緒語氣。人類評估顯示，經過微調以成為情緒翻譯器的 LLM 受益於合成產生的資料。最後，情緒翻譯器用於閱讀意圖任務，將段落轉換為中立語氣。透過中和段落，它減輕了諷刺段落帶來的挑戰，並將此任務的整體結果提升了約 3%。", "author": "Benjamin Reichman et.al.", "authors": "Benjamin Reichman, Adar Avsian, Larry Heck", "id": "2501.03475v1", "paper_url": "http://arxiv.org/abs/2501.03475v1", "repo": "null"}}