{"2406.11794": {"publish_time": "2024-06-17", "title": "DataComp-LM: In search of the next generation of training sets for language models", "paper_summary": "We introduce DataComp for Language Models (DCLM), a testbed for controlled\ndataset experiments with the goal of improving language models. As part of\nDCLM, we provide a standardized corpus of 240T tokens extracted from Common\nCrawl, effective pretraining recipes based on the OpenLM framework, and a broad\nsuite of 53 downstream evaluations. Participants in the DCLM benchmark can\nexperiment with data curation strategies such as deduplication, filtering, and\ndata mixing at model scales ranging from 412M to 7B parameters. As a baseline\nfor DCLM, we conduct extensive experiments and find that model-based filtering\nis key to assembling a high-quality training set. The resulting dataset,\nDCLM-Baseline enables training a 7B parameter language model from scratch to\n64% 5-shot accuracy on MMLU with 2.6T training tokens. Compared to MAP-Neo, the\nprevious state-of-the-art in open-data language models, DCLM-Baseline\nrepresents a 6.6 percentage point improvement on MMLU while being trained with\n40% less compute. Our baseline model is also comparable to Mistral-7B-v0.3 and\nLlama 3 8B on MMLU (63% & 66%), and performs similarly on an average of 53\nnatural language understanding tasks while being trained with 6.6x less compute\nthan Llama 3 8B. Our results highlight the importance of dataset design for\ntraining language models and offer a starting point for further research on\ndata curation.", "paper_summary_zh": "<paragraph>我們為語言模型 (DCLM) 引入 DataComp，一個用於控制資料集實驗的測試平台，目標是改進語言模型。作為 DCLM 的一部分，我們提供一個標準語料庫，包含從 Common Crawl 中提取的 240T 個符號，基於 OpenLM 框架的有效預訓練配方，以及廣泛的 53 個下游評估。DCLM 基準測試的參與者可以嘗試資料策展策略，例如去重、過濾和資料混合，模型規模從 412M 到 7B 個參數。作為 DCLM 的基準，我們進行了廣泛的實驗，發現基於模型的過濾是組裝高品質訓練集的關鍵。由此產生的資料集 DCLM-Baseline 能夠從頭開始訓練一個 7B 參數語言模型，在 MMLU 上以 2.6T 個訓練符號達到 64% 的 5 次準確度。與 MAP-Neo 相比，DCLM-Baseline 是開放資料語言模型中先前的最新技術，在 MMLU 上提高了 6.6 個百分點，同時訓練時運算量減少了 40%。我們的基準模型也與 MMLU 上的 Mistral-7B-v0.3 和 Llama 3 8B 相當（63% 和 66%），並且在平均 53 個自然語言理解任務上的表現類似，同時訓練時運算量比 Llama 3 8B 少 6.6 倍。我們的結果強調了資料集設計對訓練語言模型的重要性，並為資料策展的進一步研究提供了一個起點。</paragraph>", "author": "Jeffrey Li et.al.", "authors": "Jeffrey Li, Alex Fang, Georgios Smyrnis, Maor Ivgi, Matt Jordan, Samir Gadre, Hritik Bansal, Etash Guha, Sedrick Keh, Kushal Arora, Saurabh Garg, Rui Xin, Niklas Muenninghoff, Reinhard Heckel, Jean Mercat, Mayee Chen, Suchin Gururangan, Mitchell Wortsman, Alon Albalak, Yonatan Bitton, Marianna Nezhurina, Amro Abbas, Cheng-Yu Hsieh, Dhruba Ghosh, Josh Gardner, Maciej Kilian, Hanlin Zhang, Rulin Shao, Sarah Pratt, Sunny Sanyal, Gabriel Ilharco, Giannis Daras, Kalyani Marathe, Aaron Gokaslan, Jieyu Zhang, Khyathi Chandu, Thao Nguyen, Igor Vasiljevic, Sham Kakade, Shuran Song, Sujay Sanghavi, Fartash Faghri, Sewoong Oh, Luke Zettlemoyer, Kyle Lo, Alaaeldin El-Nouby, Hadi Pouransari, Alexander Toshev, Stephanie Wang, Dirk Groeneveld, Luca Soldani, Pang Wei Koh, Jenia Jitsev, Thomas Kollar, Alexandros G. Dimakis, Yair Carmon, Achal Dave, Ludwig Schmidt, Vaishaal Shankar", "id": "2406.11794v1", "paper_url": "http://arxiv.org/abs/2406.11794v1", "repo": "null"}}