{"2407.12423": {"publish_time": "2024-07-17", "title": "StuGPTViz: A Visual Analytics Approach to Understand Student-ChatGPT Interactions", "paper_summary": "The integration of Large Language Models (LLMs), especially ChatGPT, into\neducation is poised to revolutionize students' learning experiences by\nintroducing innovative conversational learning methodologies. To empower\nstudents to fully leverage the capabilities of ChatGPT in educational\nscenarios, understanding students' interaction patterns with ChatGPT is crucial\nfor instructors. However, this endeavor is challenging due to the absence of\ndatasets focused on student-ChatGPT conversations and the complexities in\nidentifying and analyzing the evolutional interaction patterns within\nconversations. To address these challenges, we collected conversational data\nfrom 48 students interacting with ChatGPT in a master's level data\nvisualization course over one semester. We then developed a coding scheme,\ngrounded in the literature on cognitive levels and thematic analysis, to\ncategorize students' interaction patterns with ChatGPT. Furthermore, we present\na visual analytics system, StuGPTViz, that tracks and compares temporal\npatterns in student prompts and the quality of ChatGPT's responses at multiple\nscales, revealing significant pedagogical insights for instructors. We\nvalidated the system's effectiveness through expert interviews with six data\nvisualization instructors and three case studies. The results confirmed\nStuGPTViz's capacity to enhance educators' insights into the pedagogical value\nof ChatGPT. We also discussed the potential research opportunities of applying\nvisual analytics in education and developing AI-driven personalized learning\nsolutions.", "paper_summary_zh": "大型語言模型（LLM），特別是 ChatGPT，整合到教育中，準備透過導入創新的對話式學習方法來革新學生的學習體驗。為了讓學生在教育場景中充分利用 ChatGPT 的功能，對於教師而言，了解學生與 ChatGPT 的互動模式至關重要。然而，由於缺乏專注於學生與 ChatGPT 對話的資料集，以及辨識和分析對話中演化互動模式的複雜性，因此這項工作充滿挑戰。為了應對這些挑戰，我們從 48 位學生在一個學期的碩士級資料視覺化課程中與 ChatGPT 互動中收集對話資料。接著，我們根據認知層次和主題分析的文獻，開發了一個編碼架構，以分類學生與 ChatGPT 的互動模式。此外，我們提出一個視覺分析系統 StuGPTViz，用於追蹤和比較學生提示中的時間模式和 ChatGPT 回應在多個層面的品質，揭示了對教師而言重要的教學見解。我們透過與六位資料視覺化教師的專家訪談和三個案例研究驗證了該系統的有效性。結果證實了 StuGPTViz 能夠提升教育者對 ChatGPT 教學價值的見解。我們也討論了在教育中應用視覺分析和開發由 AI 驅動的個人化學習解決方案的潛在研究機會。", "author": "Zixin Chen et.al.", "authors": "Zixin Chen, Jiachen Wang, Meng Xia, Kento Shigyo, Dingdong Liu, Rong Zhang, Huamin Qu", "id": "2407.12423v1", "paper_url": "http://arxiv.org/abs/2407.12423v1", "repo": "null"}}