{"2406.16810": {"publish_time": "2024-06-24", "title": "PISTOL: Dataset Compilation Pipeline for Structural Unlearning of LLMs", "paper_summary": "Recently, machine unlearning, which seeks to erase specific data stored in\nthe pre-trained or fine-tuned models, has emerged as a crucial protective\nmeasure for LLMs. However, unlearning approaches for LLMs that have been\nconsidered thus far have focused on the removal of independent data points and\nhave not taken into account that the stored facts are logically connected to\none another and form an implicit knowledge graph. To facilitate the development\nof structural unlearning methods, which are essential for the practical\napplication of unlearning, we propose PISTOL, a pipeline for compiling\nmulti-scenario datasets for benchmarking structural LLM unlearning.\nAdditionally, leveraging sample datasets synthesized using PISTOL, we conducted\nbenchmarks with four distinct unlearning methods on both Llama2-7B and\nMistral-7B models. This analysis helps to illustrate the prevailing challenges\nin effectively and robustly removing highly inter-connected data, batched data,\nor data skewed towards a specific domain. It also highlights the choice of\npre-trained model can impact unlearning performance. This work not only\nadvances our understandings on the limitation of current LLMs unlearning\nmethods and proposes future research directions, but also provides a replicable\nframework for ongoing exploration and validation in the field.", "paper_summary_zh": "最近，机器去学习（unlearning）已成为大型语言模型 (LLM) 的一项关键保护措施，它旨在消除预先训练或微调模型中存储的特定数据。然而，迄今为止考虑的 LLM 去学习方法都专注于删除独立数据点，并未考虑到存储的事实彼此之间在逻辑上是相连的，并形成了一个隐式知识图。为了促进结构化去学习方法的发展（这对于去学习的实际应用至关重要），我们提出了 PISTOL，这是一个用于编译多场景数据集以对结构化 LLM 去学习进行基准测试的管道。此外，利用使用 PISTOL 合成的样本数据集，我们对 Llama2-7B 和 Mistral-7B 模型进行了四种不同的去学习方法的基准测试。此分析有助于说明在有效且稳健地删除高度互连的数据、批处理数据或偏向特定领域的的数据方面存在的普遍挑战。它还强调了预训练模型的选择会影响去学习性能。这项工作不仅促进了我们对当前 LLM 去学习方法的局限性的理解，并提出了未来的研究方向，还为该领域的持续探索和验证提供了一个可复制的框架。", "author": "Xinchi Qiu et.al.", "authors": "Xinchi Qiu, William F. Shen, Yihong Chen, Nicola Cancedda, Pontus Stenetorp, Nicholas D. Lane", "id": "2406.16810v1", "paper_url": "http://arxiv.org/abs/2406.16810v1", "repo": "null"}}