{"2407.16216": {"publish_time": "2024-07-23", "title": "A Comprehensive Survey of LLM Alignment Techniques: RLHF, RLAIF, PPO, DPO and More", "paper_summary": "With advancements in self-supervised learning, the availability of trillions\ntokens in a pre-training corpus, instruction fine-tuning, and the development\nof large Transformers with billions of parameters, large language models (LLMs)\nare now capable of generating factual and coherent responses to human queries.\nHowever, the mixed quality of training data can lead to the generation of\nundesired responses, presenting a significant challenge. Over the past two\nyears, various methods have been proposed from different perspectives to\nenhance LLMs, particularly in aligning them with human expectation. Despite\nthese efforts, there has not been a comprehensive survey paper that categorizes\nand details these approaches. In this work, we aim to address this gap by\ncategorizing these papers into distinct topics and providing detailed\nexplanations of each alignment method, thereby helping readers gain a thorough\nunderstanding of the current state of the field.", "paper_summary_zh": "隨著自監督式學習的進展、數兆個標記在預訓練語料庫中的可用性、指令微調以及開發具有數十億個參數的大型 Transformer，大型語言模型 (LLM) 現在能夠對人類查詢產生事實且連貫的回應。\n然而，訓練資料品質參差不齊可能會導致產生不想要的回應，這是一個重大的挑戰。在過去兩年，從不同的觀點提出了各種方法來增強 LLM，特別是在將它們與人類期望保持一致方面。儘管做出了這些努力，但還沒有全面性的調查報告對這些方法進行分類和詳細說明。在這項工作中，我們旨在透過將這些論文分類為不同的主題並提供每種對齊方法的詳細說明來解決這個差距，從而幫助讀者深入了解該領域的現狀。", "author": "Zhichao Wang et.al.", "authors": "Zhichao Wang, Bin Bi, Shiva Kumar Pentyala, Kiran Ramnath, Sougata Chaudhuri, Shubham Mehrotra, Zixu, Zhu, Xiang-Bo Mao, Sitaram Asur, Na, Cheng", "id": "2407.16216v1", "paper_url": "http://arxiv.org/abs/2407.16216v1", "repo": "null"}}