{"2412.17029": {"publish_time": "2024-12-22", "title": "GraphAgent: Agentic Graph Language Assistant", "paper_summary": "Real-world data is represented in both structured (e.g., graph connections)\nand unstructured (e.g., textual, visual information) formats, encompassing\ncomplex relationships that include explicit links (such as social connections\nand user behaviors) and implicit interdependencies among semantic entities,\noften illustrated through knowledge graphs. In this work, we propose\nGraphAgent, an automated agent pipeline that addresses both explicit graph\ndependencies and implicit graph-enhanced semantic inter-dependencies, aligning\nwith practical data scenarios for predictive tasks (e.g., node classification)\nand generative tasks (e.g., text generation). GraphAgent comprises three key\ncomponents: (i) a Graph Generator Agent that builds knowledge graphs to reflect\ncomplex semantic dependencies; (ii) a Task Planning Agent that interprets\ndiverse user queries and formulates corresponding tasks through agentic\nself-planning; and (iii) a Task Execution Agent that efficiently executes\nplanned tasks while automating tool matching and invocation in response to user\nqueries. These agents collaborate seamlessly, integrating language models with\ngraph language models to uncover intricate relational information and data\nsemantic dependencies. Through extensive experiments on various graph-related\npredictive and text generative tasks on diverse datasets, we demonstrate the\neffectiveness of our GraphAgent across various settings. We have made our\nproposed GraphAgent open-source at: https://github.com/HKUDS/GraphAgent.", "paper_summary_zh": "真實世界的資料以結構化（例如圖形連接）和非結構化（例如文字、視覺資訊）格式呈現，包含複雜的關係，包括明確的連結（例如社交連結和使用者行為）和語意實體之間的隱含相互依賴，通常透過知識圖表來說明。在這項工作中，我們提出 GraphAgent，一個自動化代理程式管道，它處理明確的圖形依賴關係和隱含的圖形增強語意相互依賴關係，與預測任務（例如節點分類）和生成任務（例如文字生成）的實際資料情境保持一致。GraphAgent 包含三個關鍵組成部分：(i) 一個圖形產生器代理程式，用來建構知識圖表以反映複雜的語意依賴關係；(ii) 一個任務規劃代理程式，用來詮釋不同的使用者查詢，並透過代理自規劃制定相應的任務；以及 (iii) 一個任務執行代理程式，用來在回應使用者查詢時，有效率地執行已規劃的任務，同時自動化工具配對和呼叫。這些代理程式無縫地協作，將語言模型與圖形語言模型整合在一起，以揭露複雜的關係資訊和資料語意依賴關係。透過在不同資料集上進行各種與圖形相關的預測和文字生成任務的廣泛實驗，我們證明了 GraphAgent 在各種設定中的有效性。我們已將我們提出的 GraphAgent 開源：https://github.com/HKUDS/GraphAgent。", "author": "Yuhao Yang et.al.", "authors": "Yuhao Yang, Jiabin Tang, Lianghao Xia, Xingchen Zou, Yuxuan Liang, Chao Huang", "id": "2412.17029v1", "paper_url": "http://arxiv.org/abs/2412.17029v1", "repo": "null"}}