{"2408.14909": {"publish_time": "2024-08-27", "title": "SpikingSSMs: Learning Long Sequences with Sparse and Parallel Spiking State Space Models", "paper_summary": "Known as low energy consumption networks, spiking neural networks (SNNs) have\ngained a lot of attention within the past decades. While SNNs are increasing\ncompetitive with artificial neural networks (ANNs) for vision tasks, they are\nrarely used for long sequence tasks, despite their intrinsic temporal dynamics.\nIn this work, we develop spiking state space models (SpikingSSMs) for long\nsequence learning by leveraging on the sequence learning abilities of state\nspace models (SSMs). Inspired by dendritic neuron structure, we hierarchically\nintegrate neuronal dynamics with the original SSM block, meanwhile realizing\nsparse synaptic computation. Furthermore, to solve the conflict of event-driven\nneuronal dynamics with parallel computing, we propose a light-weight surrogate\ndynamic network which accurately predicts the after-reset membrane potential\nand compatible to learnable thresholds, enabling orders of acceleration in\ntraining speed compared with conventional iterative methods. On the long range\narena benchmark task, SpikingSSM achieves competitive performance to\nstate-of-the-art SSMs meanwhile realizing on average 90\\% of network sparsity.\nOn language modeling, our network significantly surpasses existing spiking\nlarge language models (spikingLLMs) on the WikiText-103 dataset with only a\nthird of the model size, demonstrating its potential as backbone architecture\nfor low computation cost LLMs.", "paper_summary_zh": "<paragraph>尖峰神經網路（SNN）以低能耗網路聞名，在過去的幾十年中備受關注。雖然 SNN 在視覺任務方面與人工神經網路（ANN）競爭力越來越高，但儘管它們具有內在的時間動態，卻很少用於長序列任務。在這項工作中，我們透過利用狀態空間模型（SSM）的序列學習能力，開發了尖峰狀態空間模型（SpikingSSM）用於長序列學習。受樹突神經元結構啟發，我們將神經元動態與原始 SSM 區塊分層整合，同時實現稀疏突觸計算。此外，為了解決事件驅動的神經元動態與並行計算的衝突，我們提出了一個輕量級的代理動態網路，它可以準確預測重置後膜電位，並與可學習閾值相容，與傳統的迭代方法相比，能夠將訓練速度提升好幾個數量級。在長程競技場基準任務中，SpikingSSM 達到了與最先進的 SSM 相當的效能，同時平均實現了 90% 的網路稀疏性。在語言建模中，我們的網路在 WikiText-103 資料集上顯著超越了現有的尖峰大型語言模型（spikingLLM），而模型大小只有三分之一，證明了其作為低運算成本 LLM 的主幹架構的潛力。</paragraph>", "author": "Shuaijie Shen et.al.", "authors": "Shuaijie Shen, Chao Wang, Renzhuo Huang, Yan Zhong, Qinghai Guo, Zhichao Lu, Jianguo Zhang, Luziwei Leng", "id": "2408.14909v1", "paper_url": "http://arxiv.org/abs/2408.14909v1", "repo": "null"}}