{"2406.17513": {"publish_time": "2024-06-25", "title": "Benchmarking Mental State Representations in Language Models", "paper_summary": "While numerous works have assessed the generative performance of language\nmodels (LMs) on tasks requiring Theory of Mind reasoning, research into the\nmodels' internal representation of mental states remains limited. Recent work\nhas used probing to demonstrate that LMs can represent beliefs of themselves\nand others. However, these claims are accompanied by limited evaluation, making\nit difficult to assess how mental state representations are affected by model\ndesign and training choices. We report an extensive benchmark with various LM\ntypes with different model sizes, fine-tuning approaches, and prompt designs to\nstudy the robustness of mental state representations and memorisation issues\nwithin the probes. Our results show that the quality of models' internal\nrepresentations of the beliefs of others increases with model size and, more\ncrucially, with fine-tuning. We are the first to study how prompt variations\nimpact probing performance on theory of mind tasks. We demonstrate that models'\nrepresentations are sensitive to prompt variations, even when such variations\nshould be beneficial. Finally, we complement previous activation editing\nexperiments on Theory of Mind tasks and show that it is possible to improve\nmodels' reasoning performance by steering their activations without the need to\ntrain any probe.", "paper_summary_zh": "儘管許多作品已經評估了語言模型 (LM) 在需要心智理論推理的任務上的生成效能，但對於心智狀態模型的內部表徵的研究仍然有限。最近的研究已使用探測來證明 LM 可以表徵自己和別人的信念。然而，這些說法伴隨著有限的評估，這使得難以評估心智狀態表徵如何受到模型設計和訓練選擇的影響。我們報告了一個廣泛的基準，其中包含具有不同模型大小、微調方法和提示設計的各種 LM 類型，以研究探測中的心智狀態表徵和記憶問題的穩健性。我們的結果表明，模型對他人信念的內部表徵的品質會隨著模型大小的增加而增加，更重要的是，隨著微調而增加。我們是第一個研究提示變異如何影響心智理論任務探測效能的人。我們證明了模型的表徵對提示變異很敏感，即使這些變異應該是好的。最後，我們補充了之前在心智理論任務上進行的激活編輯實驗，並表明可以透過引導模型的激活來改善模型的推理效能，而無需訓練任何探測。", "author": "Matteo Bortoletto et.al.", "authors": "Matteo Bortoletto, Constantin Ruhdorfer, Lei Shi, Andreas Bulling", "id": "2406.17513v1", "paper_url": "http://arxiv.org/abs/2406.17513v1", "repo": "null"}}