{"2405.18035": {"publish_time": "2024-05-28", "title": "Instruction Tuning with Retrieval-based Examples Ranking for Aspect-based Sentiment Analysis", "paper_summary": "Aspect-based sentiment analysis (ABSA) identifies sentiment information\nrelated to specific aspects and provides deeper market insights to businesses\nand organizations. With the emergence of large language models (LMs), recent\nstudies have proposed using fixed examples for instruction tuning to\nreformulate ABSA as a generation task. However, the performance is sensitive to\nthe selection of in-context examples; several retrieval methods are based on\nsurface similarity and are independent of the LM generative objective. This\nstudy proposes an instruction learning method with retrieval-based example\nranking for ABSA tasks. For each target sample, an LM was applied as a scorer\nto estimate the likelihood of the output given the input and a candidate\nexample as the prompt, and training examples were labeled as positive or\nnegative by ranking the scores. An alternating training schema is proposed to\ntrain both the retriever and LM. Instructional prompts can be constructed using\nhigh-quality examples. The LM is used for both scoring and inference, improving\nthe generation efficiency without incurring additional computational costs or\ntraining difficulties. Extensive experiments on three ABSA subtasks verified\nthe effectiveness of the proposed method, demonstrating its superiority over\nvarious strong baseline models. Code and data are released at\nhttps://anonymous.4open.science/r/IT-RER-ABSA-181F.", "paper_summary_zh": "基於面向方面的觀點分析（ABSA）識別與特定面向相關的情緒資訊，並為企業和組織提供更深入的市場洞察。隨著大型語言模型（LM）的出現，最近的研究提出使用固定範例進行指令微調，以將 ABSA 重新表述為生成任務。然而，效能會受到語境範例選擇的影響；多種檢索方法基於表面相似性，且與 LM 生成目標無關。本研究提出了一種具有基於檢索的範例排序的指令學習方法，用於 ABSA 任務。對於每個目標樣本，將 LM 作為評分器應用，以估計在輸入和候選範例作為提示的情況下輸出的可能性，並通過對分數進行排序將訓練範例標記為正面或負面。提出了一個交替訓練架構來訓練檢索器和 LM。可以使用高品質範例構建指令提示。LM 用於評分和推論，從而提高生成效率，而不會產生額外的計算成本或訓練難度。在三個 ABSA 子任務上的廣泛實驗驗證了所提出方法的有效性，證明了其優於各種強大的基線模型。程式碼和資料發布於 https://anonymous.4open.science/r/IT-RER-ABSA-181F。", "author": "Guangmin Zheng et.al.", "authors": "Guangmin Zheng, Jin Wang, Liang-Chih Yu, Xuejie Zhang", "id": "2405.18035v1", "paper_url": "http://arxiv.org/abs/2405.18035v1", "repo": "null"}}