{"2405.18035": {"publish_time": "2024-05-28", "title": "Instruction Tuning with Retrieval-based Examples Ranking for Aspect-based Sentiment Analysis", "paper_summary": "Aspect-based sentiment analysis (ABSA) identifies sentiment information\nrelated to specific aspects and provides deeper market insights to businesses\nand organizations. With the emergence of large language models (LMs), recent\nstudies have proposed using fixed examples for instruction tuning to\nreformulate ABSA as a generation task. However, the performance is sensitive to\nthe selection of in-context examples; several retrieval methods are based on\nsurface similarity and are independent of the LM generative objective. This\nstudy proposes an instruction learning method with retrieval-based example\nranking for ABSA tasks. For each target sample, an LM was applied as a scorer\nto estimate the likelihood of the output given the input and a candidate\nexample as the prompt, and training examples were labeled as positive or\nnegative by ranking the scores. An alternating training schema is proposed to\ntrain both the retriever and LM. Instructional prompts can be constructed using\nhigh-quality examples. The LM is used for both scoring and inference, improving\nthe generation efficiency without incurring additional computational costs or\ntraining difficulties. Extensive experiments on three ABSA subtasks verified\nthe effectiveness of the proposed method, demonstrating its superiority over\nvarious strong baseline models. Code and data are released at\nhttps://github.com/zgMin/IT-RER-ABSA.", "paper_summary_zh": "面向方面的观点分析 (ABSA) 可识别与特定方面相关的观点信息，并为企业和组织提供更深入的市场洞察。随着大型语言模型 (LM) 的出现，最近的研究提出了使用固定示例进行指令微调，以将 ABSA 重新表述为生成任务。然而，性能对上下文示例的选择很敏感；几种检索方法基于表面相似性，并且独立于 LM 生成目标。本研究提出了一种用于 ABSA 任务的基于检索的示例排序的指令学习方法。对于每个目标样本，将 LM 应用为评分器，以估计给定输入和候选示例作为提示时输出的可能性，并将训练示例根据分数排序标记为正面或负面。提出了一种交替训练模式来训练检索器和 LM。可以使用高质量示例构建指令提示。LM 用于评分和推理，提高了生成效率，而不会产生额外的计算成本或训练难度。在三个 ABSA 子任务上进行的广泛实验验证了所提出方法的有效性，证明了其优于各种强大的基线模型。代码和数据已在 https://github.com/zgMin/IT-RER-ABSA 发布。", "author": "Guangmin Zheng et.al.", "authors": "Guangmin Zheng, Jin Wang, Liang-Chih Yu, Xuejie Zhang", "id": "2405.18035v2", "paper_url": "http://arxiv.org/abs/2405.18035v2", "repo": "https://github.com/zgmin/it-rer-absa"}}