{"2408.06731": {"publish_time": "2024-08-13", "title": "Large language models can consistently generate high-quality content for election disinformation operations", "paper_summary": "Advances in large language models have raised concerns about their potential\nuse in generating compelling election disinformation at scale. This study\npresents a two-part investigation into the capabilities of LLMs to automate\nstages of an election disinformation operation. First, we introduce DisElect, a\nnovel evaluation dataset designed to measure LLM compliance with instructions\nto generate content for an election disinformation operation in localised UK\ncontext, containing 2,200 malicious prompts and 50 benign prompts. Using\nDisElect, we test 13 LLMs and find that most models broadly comply with these\nrequests; we also find that the few models which refuse malicious prompts also\nrefuse benign election-related prompts, and are more likely to refuse to\ngenerate content from a right-wing perspective. Secondly, we conduct a series\nof experiments (N=2,340) to assess the \"humanness\" of LLMs: the extent to which\ndisinformation operation content generated by an LLM is able to pass as\nhuman-written. Our experiments suggest that almost all LLMs tested released\nsince 2022 produce election disinformation operation content indiscernible by\nhuman evaluators over 50% of the time. Notably, we observe that multiple models\nachieve above-human levels of humanness. Taken together, these findings suggest\nthat current LLMs can be used to generate high-quality content for election\ndisinformation operations, even in hyperlocalised scenarios, at far lower costs\nthan traditional methods, and offer researchers and policymakers an empirical\nbenchmark for the measurement and evaluation of these capabilities in current\nand future models.", "paper_summary_zh": "大型語言模型的進步引發了人們對其可能大規模產生引人注目的選舉錯誤訊息的擔憂。本研究對大型語言模型自動化選舉錯誤訊息操作階段的能力進行了兩部分調查。首先，我們介紹 DisElect，這是一個新穎的評估資料集，旨在衡量大型語言模型在英國本土語境中遵循指示為選舉錯誤訊息操作生成內容的能力，其中包含 2,200 個惡意提示和 50 個良性提示。使用 DisElect，我們測試了 13 個大型語言模型，發現大多數模型廣泛遵循這些請求；我們還發現，少數拒絕惡意提示的模型也拒絕良性的選舉相關提示，並且更有可能拒絕從右翼角度生成內容。其次，我們進行了一系列實驗 (N=2,340) 來評估大型語言模型的「人味」：大型語言模型產生的錯誤訊息操作內容能夠冒充人類編寫的程度。我們的實驗表明，自 2022 年以來測試的幾乎所有大型語言模型都產生了超過 50% 的時間讓人類評估者無法辨別的選舉錯誤訊息操作內容。值得注意的是，我們觀察到多個模型達到了高於人類的人味水平。綜上所述，這些發現表明，即使在高度本地化的場景中，當前的大型語言模型也可被用於為選舉錯誤訊息操作生成高品質的內容，成本遠低於傳統方法，並為研究人員和政策制定者提供了一個用於衡量和評估當前和未來模型中這些能力的經驗基準。", "author": "Angus R. Williams et.al.", "authors": "Angus R. Williams, Liam Burke-Moore, Ryan Sze-Yin Chan, Florence E. Enock, Federico Nanni, Tvesha Sippy, Yi-Ling Chung, Evelina Gabasova, Kobi Hackenburg, Jonathan Bright", "id": "2408.06731v1", "paper_url": "http://arxiv.org/abs/2408.06731v1", "repo": "https://github.com/alan-turing-institute/election-ai-safety"}}