{"2406.06464": {"publish_time": "2024-06-10", "title": "Transforming Wearable Data into Health Insights using Large Language Model Agents", "paper_summary": "Despite the proliferation of wearable health trackers and the importance of\nsleep and exercise to health, deriving actionable personalized insights from\nwearable data remains a challenge because doing so requires non-trivial\nopen-ended analysis of these data. The recent rise of large language model\n(LLM) agents, which can use tools to reason about and interact with the world,\npresents a promising opportunity to enable such personalized analysis at scale.\nYet, the application of LLM agents in analyzing personal health is still\nlargely untapped. In this paper, we introduce the Personal Health Insights\nAgent (PHIA), an agent system that leverages state-of-the-art code generation\nand information retrieval tools to analyze and interpret behavioral health data\nfrom wearables. We curate two benchmark question-answering datasets of over\n4000 health insights questions. Based on 650 hours of human and expert\nevaluation we find that PHIA can accurately address over 84% of factual\nnumerical questions and more than 83% of crowd-sourced open-ended questions.\nThis work has implications for advancing behavioral health across the\npopulation, potentially enabling individuals to interpret their own wearable\ndata, and paving the way for a new era of accessible, personalized wellness\nregimens that are informed by data-driven insights.", "paper_summary_zh": "儘管穿戴式健康追蹤器大量普及，且睡眠和運動對健康至關重要，但從穿戴式資料中衍生出可操作的個人化見解仍然是一項挑戰，因為這樣做需要對這些資料進行非平凡的開放式分析。大型語言模型 (LLM) 代理程式近來崛起，它可以使用工具對世界進行推理和互動，提供了大規模啟用此類個人化分析的絕佳機會。然而，LLM 代理程式在分析個人健康方面的應用仍未得到充分開發。在本文中，我們介紹了個人健康見解代理程式 (PHIA)，這是一個代理系統，它利用最先進的程式碼生成和資訊檢索工具來分析和詮釋來自穿戴式裝置的行為健康資料。我們整理了兩個基准問答資料集，其中包含超過 4000 個健康見解問題。根據 650 小時的人類和專家評估，我們發現 PHIA 能夠準確回答超過 84% 的事實性數字問題和超過 83% 的群眾外包開放式問題。這項工作對促進全體人口的行為健康具有影響，潛在地使個人能夠詮釋自己的穿戴式資料，並為一個由資料驅動的見解所告知的可存取、個人化健康養生法的新時代鋪路。", "author": "Mike A. Merrill et.al.", "authors": "Mike A. Merrill, Akshay Paruchuri, Naghmeh Rezaei, Geza Kovacs, Javier Perez, Yun Liu, Erik Schenck, Nova Hammerquist, Jake Sunshine, Shyam Tailor, Kumar Ayush, Hao-Wei Su, Qian He, Cory Y. McLean, Mark Malhotra, Shwetak Patel, Jiening Zhan, Tim Althoff, Daniel McDuff, Xin Liu", "id": "2406.06464v2", "paper_url": "http://arxiv.org/abs/2406.06464v2", "repo": "null"}}