{"2406.11612": {"publish_time": "2024-06-17", "title": "Long Code Arena: a Set of Benchmarks for Long-Context Code Models", "paper_summary": "Nowadays, the fields of code and natural language processing are evolving\nrapidly. In particular, models become better at processing long context windows\n- supported context sizes have increased by orders of magnitude over the last\nfew years. However, there is a shortage of benchmarks for code processing that\ngo beyond a single file of context, while the most popular ones are limited to\na single method. With this work, we aim to close this gap by introducing Long\nCode Arena, a suite of six benchmarks for code processing tasks that require\nproject-wide context. These tasks cover different aspects of code processing:\nlibrary-based code generation, CI builds repair, project-level code completion,\ncommit message generation, bug localization, and module summarization. For each\ntask, we provide a manually verified dataset for testing, an evaluation suite,\nand open-source baseline solutions based on popular LLMs to showcase the usage\nof the dataset and to simplify adoption by other researchers. We publish the\nbenchmark page on HuggingFace Spaces with the leaderboard, links to HuggingFace\nHub for all the datasets, and link to the GitHub repository with baselines:\nhttps://huggingface.co/spaces/JetBrains-Research/long-code-arena.", "paper_summary_zh": "如今，代码和自然语言处理领域正在快速发展。尤其是，模型在处理长上下文窗口方面变得更好，在过去几年中，支持的上下文大小已经增加了几个数量级。然而，对于超出单个上下文文件的代码处理基准却很匮乏，而最流行的基准仅限于单个方法。通过这项工作，我们旨在通过引入 Long Code Arena 来弥补这一差距，这是一套针对需要项目范围上下文的代码处理任务的六个基准。这些任务涵盖了代码处理的不同方面：基于库的代码生成、CI 构建修复、项目级代码完成、提交消息生成、错误定位和模块摘要。对于每个任务，我们提供一个手动验证的数据集用于测试、一个评估套件和基于流行 LLM 的开源基线解决方案，以展示数据集的使用并简化其他研究人员的采用。我们在 HuggingFace Spaces 上发布基准页面，其中包含排行榜、指向所有数据集的 HuggingFace Hub 的链接，以及指向带有基线的 GitHub 存储库的链接：https://huggingface.co/spaces/JetBrains-Research/long-code-arena。", "author": "Egor Bogomolov et.al.", "authors": "Egor Bogomolov, Aleksandra Eliseeva, Timur Galimzyanov, Evgeniy Glukhov, Anton Shapkin, Maria Tigina, Yaroslav Golubev, Alexander Kovrigin, Arie van Deursen, Maliheh Izadi, Timofey Bryksin", "id": "2406.11612v1", "paper_url": "http://arxiv.org/abs/2406.11612v1", "repo": "null"}}