{"2405.12059": {"publish_time": "2024-05-20", "title": "STYLE: Improving Domain Transferability of Asking Clarification Questions in Large Language Model Powered Conversational Agents", "paper_summary": "Equipping a conversational search engine with strategies regarding when to\nask clarification questions is becoming increasingly important across various\ndomains. Attributing to the context understanding capability of LLMs and their\naccess to domain-specific sources of knowledge, LLM-based clarification\nstrategies feature rapid transfer to various domains in a post-hoc manner.\nHowever, they still struggle to deliver promising performance on unseen\ndomains, struggling to achieve effective domain transferability. We take the\nfirst step to investigate this issue and existing methods tend to produce\none-size-fits-all strategies across diverse domains, limiting their search\neffectiveness. In response, we introduce a novel method, called Style, to\nachieve effective domain transferability. Our experimental results indicate\nthat Style bears strong domain transferability, resulting in an average search\nperformance improvement of ~10% on four unseen domains.", "paper_summary_zh": "隨著對話式搜尋引擎在各種領域中日益重要，因此需要為其配備有關何時提出澄清問題的策略。基於 LLM 對脈絡理解的能力及其存取特定領域知識來源的能力，基於 LLM 的澄清策略在事後方式中具備快速轉移至各種領域的功能。然而，它們仍然難以在未見過的領域中提供有前途的效能，難以達成有效的領域可轉移性。我們採取第一步來探討這個問題，現有方法傾向於在各種領域中產生一體適用的策略，限制其搜尋效果。為了解決這個問題，我們引進一種稱為 Style 的新方法，以達成有效的領域可轉移性。我們的實驗結果顯示，Style 具有強大的領域可轉移性，導致在四個未見過的領域中平均搜尋效能提升約 10%。", "author": "Yue Chen et.al.", "authors": "Yue Chen, Chen Huang, Yang Deng, Wenqiang Lei, Dingnan Jin, Jia Liu, Tat-Seng Chua", "id": "2405.12059v1", "paper_url": "http://arxiv.org/abs/2405.12059v1", "repo": "null"}}