{"2408.07544": {"publish_time": "2024-08-14", "title": "Planning with OWL-DL Ontologies (Extended Version)", "paper_summary": "We introduce ontology-mediated planning, in which planning problems are\ncombined with an ontology. Our formalism differs from existing ones in that we\nfocus on a strong separation of the formalisms for describing planning problems\nand ontologies, which are only losely coupled by an interface. Moreover, we\npresent a black-box algorithm that supports the full expressive power of OWL\nDL. This goes beyond what existing approaches combining automated planning with\nontologies can do, which only support limited description logics such as\nDL-Lite and description logics that are Horn. Our main algorithm relies on\nrewritings of the ontology-mediated planning specifications into PDDL, so that\nexisting planning systems can be used to solve them. The algorithm relies on\njustifications, which allows for a generic approach that is independent of the\nexpressivity of the ontology language. However, dedicated optimizations for\ncomputing justifications need to be implemented to enable an efficient\nrewriting procedure. We evaluated our implementation on benchmark sets from\nseveral domains. The evaluation shows that our procedure works in practice and\nthat tailoring the reasoning procedure has significant impact on the\nperformance.", "paper_summary_zh": "<paragraph>我們引入了基於本體的規劃，其中規劃問題與本體相結合。我們的形式主義不同於現有的形式主義，因為我們專注於描述規劃問題和本體的形式主義的強分離，它們僅通過介面鬆散耦合。此外，我們提出了一個黑盒演算法，它支援 OWL DL 的完整表達能力。這超出了將自動規劃與本體相結合的現有方法所能做到的，它僅支援有限的描述邏輯，例如 DL-Lite 和 Horn 描述邏輯。我們的演算法主要依賴於將基於本體的規劃規範重寫為 PDDL，以便現有的規劃系統可以用於解決它們。該演算法依賴於證明，這允許一種通用的方法，該方法獨立於本體語言的表達能力。但是，需要實作專門的最佳化來計算證明，以實現有效的重寫程序。我們在來自多個領域的基準集上評估了我們的實作。評估表明，我們的程序在實務上可行，而且調整推理程序對效能有顯著影響。</paragraph>", "author": "Tobias John et.al.", "authors": "Tobias John, Patrick Koopmann", "id": "2408.07544v1", "paper_url": "http://arxiv.org/abs/2408.07544v1", "repo": "null"}}