{"2410.14155": {"publish_time": "2024-10-18", "title": "Towards Faithful Natural Language Explanations: A Study Using Activation Patching in Large Language Models", "paper_summary": "Large Language Models (LLMs) are capable of generating persuasive Natural\nLanguage Explanations (NLEs) to justify their answers. However, the\nfaithfulness of these explanations should not be readily trusted at face value.\nRecent studies have proposed various methods to measure the faithfulness of\nNLEs, typically by inserting perturbations at the explanation or feature level.\nWe argue that these approaches are neither comprehensive nor correctly designed\naccording to the established definition of faithfulness. Moreover, we highlight\nthe risks of grounding faithfulness findings on out-of-distribution samples. In\nthis work, we leverage a causal mediation technique called activation patching,\nto measure the faithfulness of an explanation towards supporting the explained\nanswer. Our proposed metric, Causal Faithfulness quantifies the consistency of\ncausal attributions between explanations and the corresponding model outputs as\nthe indicator of faithfulness. We experimented across models varying from 2B to\n27B parameters and found that models that underwent alignment tuning tend to\nproduce more faithful and plausible explanations. We find that Causal\nFaithfulness is a promising improvement over existing faithfulness tests by\ntaking into account the model's internal computations and avoiding out of\ndistribution concerns that could otherwise undermine the validity of\nfaithfulness assessments. We release the code in\n\\url{https://github.com/wj210/Causal-Faithfulness}", "paper_summary_zh": "大型語言模型 (LLM) 能夠產生有說服力的自然語言解釋 (NLE) 來證明其答案。然而，這些解釋的忠實度不應輕易地被視為表面價值。最近的研究提出了各種方法來衡量 NLE 的忠實度，通常是透過在解釋或特徵層級插入擾動。我們認為這些方法既不全面，也不符合忠實度的既定定義而正確設計。此外，我們強調將忠實度發現建立在分布外樣本上的風險。在這項工作中，我們利用因果中介技術（稱為激活修補），來衡量解釋對支持所解釋答案的忠實度。我們提出的指標「因果忠實度」量化了解釋與對應模型輸出之間因果歸因的一致性，作為忠實度的指標。我們在參數從 2B 到 27B 變化不同的模型中進行了實驗，發現經過比對調整的模型往往會產生更忠實且合理的解釋。我們發現，因果忠實度透過考量模型的內部運算並避免可能會損害忠實度評估的有效性的分布外問題，對現有的忠實度測試來說是一個有希望的改進。我們在\\url{https://github.com/wj210/Causal-Faithfulness}中釋出程式碼", "author": "Wei Jie Yeo et.al.", "authors": "Wei Jie Yeo, Ranjan Satapthy, Erik Cambria", "id": "2410.14155v1", "paper_url": "http://arxiv.org/abs/2410.14155v1", "repo": "https://github.com/wj210/causal-faithfulness"}}