{"2411.15998": {"publish_time": "2024-11-24", "title": "PIANIST: Learning Partially Observable World Models with LLMs for Multi-Agent Decision Making", "paper_summary": "Effective extraction of the world knowledge in LLMs for complex\ndecision-making tasks remains a challenge. We propose a framework PIANIST for\ndecomposing the world model into seven intuitive components conducive to\nzero-shot LLM generation. Given only the natural language description of the\ngame and how input observations are formatted, our method can generate a\nworking world model for fast and efficient MCTS simulation. We show that our\nmethod works well on two different games that challenge the planning and\ndecision making skills of the agent for both language and non-language based\naction taking, without any training on domain-specific training data or\nexplicitly defined world model.", "paper_summary_zh": "對於複雜的決策任務，在 LLM 中有效提取世界知識仍然是一個挑戰。我們提出一個架構 PIANIST，將世界模型分解為七個直觀的組成部分，有利於零次學習 LLM 生成。僅給定遊戲的自然語言描述和輸入觀測值的格式化方式，我們的模型就能產生一個運作的世界模型，用於快速且有效率的 MCTS 模擬。我們展示了我們的模型在兩種不同的遊戲中運作良好，這些遊戲挑戰了代理人在語言和非語言動作採取方面的規劃和決策制定技能，而無需針對特定領域的訓練資料或明確定義的世界模型進行任何訓練。", "author": "Jonathan Light et.al.", "authors": "Jonathan Light, Sixue Xing, Yuanzhe Liu, Weiqin Chen, Min Cai, Xiusi Chen, Guanzhi Wang, Wei Cheng, Yisong Yue, Ziniu Hu", "id": "2411.15998v1", "paper_url": "http://arxiv.org/abs/2411.15998v1", "repo": "null"}}