{"2412.03160": {"publish_time": "2024-12-04", "title": "Byte BPE Tokenization as an Inverse string Homomorphism", "paper_summary": "Tokenization is an important preprocessing step in the training and inference\nof large language models (LLMs). While there has been extensive research on the\nexpressive power of the neural achitectures used in LLMs, the impact of\ntokenization has not been well understood. In this work, we demonstrate that\ntokenization, irrespective of the algorithm used, acts as an inverse\nhomomorphism between strings and tokens. This suggests that the character space\nof the source language and the token space of the tokenized language are\nhomomorphic, preserving the structural properties of the source language.\nAdditionally, we explore the concept of proper tokenization, which refers to an\nunambiguous tokenization returned from the tokenizer. Our analysis reveals that\nthe expressiveness of neural architectures in recognizing context-free\nlanguages is not affected by tokenization.", "paper_summary_zh": "分詞是訓練和推論大型語言模型 (LLM) 中一個重要的預處理步驟。雖然對於 LLM 中使用的神經架構的表現力已有廣泛的研究，但分詞的影響尚未被充分理解。在這項工作中，我們證明了分詞，無論使用何種演算法，都充當字串和符號之間的反同態。這表明原始語言的字元空間和分詞語言的符號空間是同態的，保留了原始語言的結構特性。此外，我們探討了適當分詞的概念，這指的是從分詞器返回的明確分詞。我們的分析表明，神經架構在識別上下文無關語言中的表現力不受分詞的影響。", "author": "Saibo Geng et.al.", "authors": "Saibo Geng, Sankalp Gambhir, Chris Wendler, Robert West", "id": "2412.03160v1", "paper_url": "http://arxiv.org/abs/2412.03160v1", "repo": "null"}}