{"2405.10702": {"publish_time": "2024-05-17", "title": "Empowering Prior to Court Legal Analysis: A Transparent and Accessible Dataset for Defensive Statement Classification and Interpretation", "paper_summary": "The classification of statements provided by individuals during police\ninterviews is a complex and significant task within the domain of natural\nlanguage processing (NLP) and legal informatics. The lack of extensive\ndomain-specific datasets raises challenges to the advancement of NLP methods in\nthe field. This paper aims to address some of the present challenges by\nintroducing a novel dataset tailored for classification of statements made\nduring police interviews, prior to court proceedings. Utilising the curated\ndataset for training and evaluation, we introduce a fine-tuned DistilBERT model\nthat achieves state-of-the-art performance in distinguishing truthful from\ndeceptive statements. To enhance interpretability, we employ explainable\nartificial intelligence (XAI) methods to offer explainability through saliency\nmaps, that interpret the model's decision-making process. Lastly, we present an\nXAI interface that empowers both legal professionals and non-specialists to\ninteract with and benefit from our system. Our model achieves an accuracy of\n86%, and is shown to outperform a custom transformer architecture in a\ncomparative study. This holistic approach advances the accessibility,\ntransparency, and effectiveness of statement analysis, with promising\nimplications for both legal practice and research.", "paper_summary_zh": "在警察訪談中，由個人所提供的陳述分類，是自然語言處理（NLP）和法律資訊學領域中一項複雜且重要的任務。缺乏廣泛的特定領域資料集，對 NLP 方法在該領域的進步提出了挑戰。本文旨在透過引入一個新穎的資料集來解決一些當前挑戰，該資料集專門用於對警察訪談中所作的陳述進行分類，並在法庭程序之前進行分類。利用策展的資料集進行訓練和評估，我們引入了一個經過微調的 DistilBERT 模型，該模型在區分真實陳述和虛假陳述方面取得了最先進的效能。為了增強可解釋性，我們採用可解釋的人工智慧（XAI）方法，透過顯著性圖提供可解釋性，以詮釋模型的決策制定過程。最後，我們提出了一個 XAI 介面，讓法律專業人士和非專業人士都能與我們的系統互動並從中受益。我們的模型達到了 86% 的準確度，並且在比較研究中被證明優於自訂的轉換器架構。這種整體方法提升了陳述分析的可及性、透明度和有效性，對法律實務和研究都有著有希望的影響。", "author": "Yannis Spyridis et.al.", "authors": "Yannis Spyridis, Jean-Paul, Haneen Deeb, Vasileios Argyriou", "id": "2405.10702v1", "paper_url": "http://arxiv.org/abs/2405.10702v1", "repo": "null"}}