{"2407.05817": {"publish_time": "2024-07-08", "title": "Cyber Physical Games", "paper_summary": "We describe a formulation of multi-agents operating within a Cyber-Physical\nSystem, resulting in collaborative or adversarial games. We show that the\nnon-determinism inherent in the communication medium between agents and the\nunderlying physical environment gives rise to environment evolution that is a\nprobabilistic function of agents' strategies. We name these emergent properties\nCyber Physical Games and study its properties. We present an algorithmic model\nthat determines the most likely system evolution, approximating Cyber Physical\nGames through Probabilistic Finite State Automata, and evaluate it on\ncollaborative and adversarial versions of the Iterated Boolean Game, comparing\ntheoretical results with simulated ones. Results support the validity of the\nproposed model, and suggest several required research directions to continue\nevolving our understanding of Cyber Physical System, as well as how to best\ndesign agents that must operate within such environments.", "paper_summary_zh": "我們描述多重代理在網路物理系統中運作的公式，導致合作或對抗遊戲。我們顯示代理之間的通訊媒體和基礎物理環境中固有的非決定論導致環境演化，而這正是代理策略的機率函數。我們將這些新興特性命名為網路物理遊戲，並研究其特性。我們提出一個演算法模型，用以決定最可能的系統演化，透過機率有限狀態自動機近似網路物理遊戲，並在重複布林遊戲的合作和對抗版本中評估它，比較理論結果和模擬結果。結果支持所提出的模型的有效性，並提出幾個必要的研發方向，以繼續演進我們對網路物理系統的理解，以及如何最佳設計必須在這種環境中運作的代理。", "author": "Warisa Sritriratanarak et.al.", "authors": "Warisa Sritriratanarak, Paulo Garcia", "id": "2407.05817v1", "paper_url": "http://arxiv.org/abs/2407.05817v1", "repo": "null"}}