{"2405.06703": {"publish_time": "2024-05-08", "title": "Interpretable Cross-Examination Technique (ICE-T): Using highly informative features to boost LLM performance", "paper_summary": "In this paper, we introduce the Interpretable Cross-Examination Technique\n(ICE-T), a novel approach that leverages structured multi-prompt techniques\nwith Large Language Models (LLMs) to improve classification performance over\nzero-shot and few-shot methods. In domains where interpretability is crucial,\nsuch as medicine and law, standard models often fall short due to their\n\"black-box\" nature. ICE-T addresses these limitations by using a series of\ngenerated prompts that allow an LLM to approach the problem from multiple\ndirections. The responses from the LLM are then converted into numerical\nfeature vectors and processed by a traditional classifier. This method not only\nmaintains high interpretability but also allows for smaller, less capable\nmodels to achieve or exceed the performance of larger, more advanced models\nunder zero-shot conditions. We demonstrate the effectiveness of ICE-T across a\ndiverse set of data sources, including medical records and legal documents,\nconsistently surpassing the zero-shot baseline in terms of classification\nmetrics such as F1 scores. Our results indicate that ICE-T can be used for\nimproving both the performance and transparency of AI applications in complex\ndecision-making environments.", "paper_summary_zh": "<paragraph>在本文中，我們介紹了解釋性交互式審查技術 (ICE-T)，這是一種新方法，它利用具有大型語言模型 (LLM) 的結構化多提示技術來提升零次學習和少次學習方法的分類效能。在可解釋性至關重要的領域，例如醫學和法律，標準模型通常因其「黑箱」性質而不足。ICE-T 透過使用一系列生成的提示來解決這些限制，這些提示允許 LLM 從多個方向來探討問題。然後將 LLM 的回應轉換為數值特徵向量，並由傳統分類器處理。這種方法不僅保持了高度的可解釋性，還允許較小、功能較弱的模型在零次學習條件下達到或超過較大、更先進模型的效能。我們在各種資料來源（包括醫療記錄和法律文件）中展示了 ICE-T 的有效性，在分類指標（例如 F1 分數）方面始終優於零次學習基準。我們的結果表明，ICE-T 可用於提升複雜決策環境中 AI 應用程式的效能和透明度。</paragraph>", "author": "Goran Muric et.al.", "authors": "Goran Muric, Ben Delay, Steven Minton", "id": "2405.06703v1", "paper_url": "http://arxiv.org/abs/2405.06703v1", "repo": "null"}}