{"2408.05404": {"publish_time": "2024-08-10", "title": "LaiDA: Linguistics-aware In-context Learning with Data Augmentation for Metaphor Components Identification", "paper_summary": "Metaphor Components Identification (MCI) contributes to enhancing machine\nunderstanding of metaphors, thereby advancing downstream natural language\nprocessing tasks. However, the complexity, diversity, and dependency on context\nand background knowledge pose significant challenges for MCI. Large language\nmodels (LLMs) offer new avenues for accurate comprehension of complex natural\nlanguage texts due to their strong semantic analysis and extensive commonsense\nknowledge. In this research, a new LLM-based framework is proposed, named\nLinguistics-aware In-context Learning with Data Augmentation (LaiDA).\nSpecifically, ChatGPT and supervised fine-tuning are utilized to tailor a\nhigh-quality dataset. LaiDA incorporates a simile dataset for pre-training. A\ngraph attention network encoder generates linguistically rich feature\nrepresentations to retrieve similar examples. Subsequently, LLM is fine-tuned\nwith prompts that integrate linguistically similar examples. LaiDA ranked 2nd\nin Subtask 2 of NLPCC2024 Shared Task 9, demonstrating its effectiveness. Code\nand data are available at https://github.com/WXLJZ/LaiDA.", "paper_summary_zh": "隱喻組成辨識 (MCI) 有助於提升機器對隱喻的理解，進而推動下游的自然語言處理任務。不過，複雜性、多樣性，以及對脈絡和背景知識的依賴性，對 MCI 而言是重大的挑戰。大型語言模型 (LLM) 由於其強大的語意分析和廣泛的常識知識，為準確理解複雜的自然語言文本提供了新途徑。本研究提出了一個新的基於 LLM 的架構，稱為具備資料擴充功能的語言感知情境學習 (LaiDA)。具體來說，ChatGPT 和監督微調用於調整一個高品質的資料集。LaiDA 結合了一個比喻資料集進行預訓練。一個圖形注意力網路編碼器產生語言豐富的特徵表示，以擷取類似的範例。隨後，LLM 使用整合了語言相似範例的提示進行微調。LaiDA 在 NLPCC2024 共享任務 9 的子任務 2 中排名第 2，證明了其有效性。程式碼和資料可在 https://github.com/WXLJZ/LaiDA 取得。", "author": "Hongde Liu et.al.", "authors": "Hongde Liu, Chenyuan He, Feiyang Meng, Changyong Niu, Yuxiang Jia", "id": "2408.05404v1", "paper_url": "http://arxiv.org/abs/2408.05404v1", "repo": "null"}}