{"2412.02942": {"publish_time": "2024-12-04", "title": "STDCformer: A Transformer-Based Model with a Spatial-Temporal Causal De-Confounding Strategy for Crowd Flow Prediction", "paper_summary": "Existing works typically treat spatial-temporal prediction as the task of\nlearning a function $F$ to transform historical observations to future\nobservations. We further decompose this cross-time transformation into three\nprocesses: (1) Encoding ($E$): learning the intrinsic representation of\nobservations, (2) Cross-Time Mapping ($M$): transforming past representations\ninto future representations, and (3) Decoding ($D$): reconstructing future\nobservations from the future representations. From this perspective,\nspatial-temporal prediction can be viewed as learning $F = E \\cdot M \\cdot D$,\nwhich includes learning the space transformations $\\left\\{{E},{D}\\right\\}$\nbetween the observation space and the hidden representation space, as well as\nthe spatial-temporal mapping $M$ from future states to past states within the\nrepresentation space. This leads to two key questions: \\textbf{Q1: What kind of\nrepresentation space allows for mapping the past to the future? Q2: How to\nachieve map the past to the future within the representation space?} To address\nQ1, we propose a Spatial-Temporal Backdoor Adjustment strategy, which learns a\nSpatial-Temporal De-Confounded (STDC) representation space and estimates the\nde-confounding causal effect of historical data on future data. This causal\nrelationship we captured serves as the foundation for subsequent\nspatial-temporal mapping. To address Q2, we design a Spatial-Temporal Embedding\n(STE) that fuses the information of temporal and spatial confounders, capturing\nthe intrinsic spatial-temporal characteristics of the representations.\nAdditionally, we introduce a Cross-Time Attention mechanism, which queries the\nattention between the future and the past to guide spatial-temporal mapping.", "paper_summary_zh": "<paragraph>現有的作品通常將時空預測視為學習函數 $F$ 的任務，以將歷史觀測值轉換為未來觀測值。我們進一步將這種跨時間轉換分解為三個過程：(1) 編碼 ($E$)：學習觀測值的內在表示，(2) 跨時間映射 ($M$)：將過去的表示轉換為未來的表示，以及 (3) 解碼 ($D$)：從未來的表示重建未來的觀測值。從這個角度來看，時空預測可以視為學習 $F = E \\cdot M \\cdot D$，其中包括學習觀測空間和隱藏表示空間之間的空間轉換 $\\left\\{{E},{D}\\right\\}$，以及表示空間內從未來狀態到過去狀態的時空映射 $M$。這導致了兩個關鍵問題：\\textbf{Q1：哪種類型的表示空間允許將過去映射到未來？Q2：如何在表示空間內將過去映射到未來？} 為了回答 Q1，我們提出了時空後門調整策略，該策略學習時空去混淆 (STDC) 表示空間，並估計歷史數據對未來數據的去混淆因果效應。我們捕捉到的這種因果關係作為後續時空映射的基礎。為了回答 Q2，我們設計了一個時空嵌入 (STE)，它融合了時間和空間混淆因素的信息，捕捉了表示的內在時空特徵。此外，我們引入了一個跨時間注意力機制，它查詢未來和過去之間的注意力以指導時空映射。</paragraph>", "author": "Silu He et.al.", "authors": "Silu He, Peng Shen, Pingzhen Xu, Qinyao Luo, Haifeng Li", "id": "2412.02942v1", "paper_url": "http://arxiv.org/abs/2412.02942v1", "repo": "null"}}