{"2406.19470": {"publish_time": "2024-06-27", "title": "Changing Answer Order Can Decrease MMLU Accuracy", "paper_summary": "As large language models (LLMs) have grown in prevalence, particular\nbenchmarks have become essential for the evaluation of these models and for\nunderstanding model capabilities. Most commonly, we use test accuracy averaged\nacross multiple subtasks in order to rank models on leaderboards, to determine\nwhich model is best for our purposes. In this paper, we investigate the\nrobustness of the accuracy measurement on a widely used multiple choice\nquestion answering dataset, MMLU. When shuffling the answer label contents, we\nfind that all explored models decrease in accuracy on MMLU, but not every model\nis equally sensitive. These findings suggest a possible adjustment to the\nstandard practice of leaderboard testing, where we additionally consider the\npercentage of examples each model answers correctly by random chance.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的普及，特定基準已成為評估這些模型和了解模型功能的必要條件。最常見的做法是，我們使用在多個子任務中平均的測試準確度，以便在排行榜上對模型進行排名，以確定哪個模型最適合我們的目的。在本文中，我們探討了廣泛使用的多項選擇問答資料集 MMLU 上的準確度測量的穩健性。在洗牌答案標籤內容時，我們發現所有探索的模型在 MMLU 上的準確度都會下降，但並非每個模型都同樣敏感。這些發現表明，我們可以對排行榜測試的標準做法進行可能的調整，其中我們另外考慮每個模型通過隨機機會正確回答的範例百分比。", "author": "Vipul Gupta et.al.", "authors": "Vipul Gupta, David Pantoja, Candace Ross, Adina Williams, Megan Ung", "id": "2406.19470v1", "paper_url": "http://arxiv.org/abs/2406.19470v1", "repo": "null"}}