{"2407.12749": {"publish_time": "2024-07-17", "title": "HDLCopilot: Hardware Design Library Querying with Natural Language", "paper_summary": "Hardware design engineers routinely work with multiple Process Design Kits\n(PDKs) from various fabrication labs, each containing several standard cell\nlibraries, optimized for specific metric such as speed, power, or density.\nThese libraries include multiple views such as liberty files for timing\ninformation, LEF files for abstract layout details, and technology LEF for\nprocess design rules. Navigating this complex landscape to retrieve specific\ninformation about gates or design rules is often time-consuming and\nerror-prone. To address this, we present HDLCopilot, an LLM-powered PDK query\nsystem that allows engineers to streamline interactions with PDKs in natural\nlanguage format, making information retrieval accurate and more efficient.\nHDLCopilot achieves an accuracy of 94.23\\% on an evaluation set comprised of\ndiverse and complex natural language queries. HDLCopilot positions itself as a\npowerful assistant in the hardware design process, enhancing productivity and\nreducing potential human errors.", "paper_summary_zh": "硬體設計工程師會定期使用來自各種製造實驗室的數個處理設計套件 (PDK)，每個套件包含多個標準單元庫，針對特定指標（例如速度、功率或密度）進行最佳化。這些庫包含多種檢視，例如時序資訊的 Liberty 檔案、抽象配置詳細資料的 LEF 檔案，以及處理設計規則的技術 LEF。在這個複雜的環境中導覽以擷取閘極或設計規則的特定資訊，通常會耗時且容易出錯。為了解決這個問題，我們提出 HDLCopilot，這是一個由 LLM 驅動的 PDK 查詢系統，讓工程師能夠以自然語言格式簡化與 PDK 的互動，讓資訊擷取更準確且更有效率。HDLCopilot 在包含各種複雜自然語言查詢的評估集中，達到了 94.23% 的準確率。HDLCopilot 將自己定位為硬體設計流程中的強大助手，可提升生產力並減少潛在的人為錯誤。", "author": "Manar Abdelatty et.al.", "authors": "Manar Abdelatty, Sherief Reda", "id": "2407.12749v1", "paper_url": "http://arxiv.org/abs/2407.12749v1", "repo": "null"}}