{"2409.18472": {"publish_time": "2024-09-27", "title": "URIEL+: Enhancing Linguistic Inclusion and Usability in a Typological and Multilingual Knowledge Base", "paper_summary": "URIEL is a knowledge base offering geographical, phylogenetic, and\ntypological vector representations for 7970 languages. It includes distance\nmeasures between these vectors for 4005 languages, which are accessible via the\nlang2vec tool. Despite being frequently cited, URIEL is limited in terms of\nlinguistic inclusion and overall usability. To tackle these challenges, we\nintroduce URIEL+, an enhanced version of URIEL and lang2vec addressing these\nlimitations. In addition to expanding typological feature coverage for 2898\nlanguages, URIEL+ improves user experience with robust, customizable distance\ncalculations to better suit the needs of the users. These upgrades also offer\ncompetitive performance on downstream tasks and provide distances that better\nalign with linguistic distance studies.", "paper_summary_zh": "URIEL 是一個提供 7970 種語言的地理、系統發生和類型學向量表示的知識庫。它包含 4005 種語言之間的距離測量，可透過 lang2vec 工具存取。儘管經常被引用，但 URIEL 在語言包容性和整體可用性方面受到限制。為了應對這些挑戰，我們引入了 URIEL+，這是 URIEL 和 lang2vec 的增強版本，可解決這些限制。除了擴展 2898 種語言的類型學特徵涵蓋範圍外，URIEL+ 還透過強大、可自訂的距離計算來改善使用者體驗，以更好地滿足使用者的需求。這些升級在下游任務上也提供具競爭力的效能，並提供更符合語言距離研究的距離。", "author": "Aditya Khan et.al.", "authors": "Aditya Khan, Mason Shipton, David Anugraha, Kaiyao Duan, Phuong H. Hoang, Eric Khiu, A. Seza Doğruöz, En-Shiun Annie Lee", "id": "2409.18472v1", "paper_url": "http://arxiv.org/abs/2409.18472v1", "repo": "null"}}