{"2409.16022": {"publish_time": "2024-09-24", "title": "AI Can Be Cognitively Biased: An Exploratory Study on Threshold Priming in LLM-Based Batch Relevance Assessment", "paper_summary": "Cognitive biases are systematic deviations in thinking that lead to\nirrational judgments and problematic decision-making, extensively studied\nacross various fields. Recently, large language models (LLMs) have shown\nadvanced understanding capabilities but may inherit human biases from their\ntraining data. While social biases in LLMs have been well-studied, cognitive\nbiases have received less attention, with existing research focusing on\nspecific scenarios. The broader impact of cognitive biases on LLMs in various\ndecision-making contexts remains underexplored. We investigated whether LLMs\nare influenced by the threshold priming effect in relevance judgments, a core\ntask and widely-discussed research topic in the Information Retrieval (IR)\ncoummunity. The priming effect occurs when exposure to certain stimuli\nunconsciously affects subsequent behavior and decisions. Our experiment\nemployed 10 topics from the TREC 2019 Deep Learning passage track collection,\nand tested AI judgments under different document relevance scores, batch\nlengths, and LLM models, including GPT-3.5, GPT-4, LLaMa2-13B and LLaMa2-70B.\nResults showed that LLMs tend to give lower scores to later documents if\nearlier ones have high relevance, and vice versa, regardless of the combination\nand model used. Our finding demonstrates that LLM%u2019s judgments, similar to\nhuman judgments, are also influenced by threshold priming biases, and suggests\nthat researchers and system engineers should take into account potential\nhuman-like cognitive biases in designing, evaluating, and auditing LLMs in IR\ntasks and beyond.", "paper_summary_zh": "<paragraph>認知偏差是思考中系統性的偏差，會導致不理性的判斷和有問題的決策制定，在各種領域中廣泛研究。最近，大型語言模型 (LLM) 已展現出進階的理解能力，但可能會從其訓練資料繼承人類的偏見。雖然 LLM 中的社會偏見已被廣泛研究，但認知偏見較少受到關注，現有的研究著重於特定情境。認知偏見對 LLM 在各種決策制定情境中的更廣泛影響仍未充分探討。我們調查了 LLM 是否受到相關判斷中的閾值啟動效應的影響，這是資訊檢索 (IR) 社群中一項核心任務和廣泛討論的研究主題。當接觸到某些刺激時，啟動效應會發生，無意識地影響後續行為和決策。我們的實驗採用了 TREC 2019 深度學習段落軌道收集中的 10 個主題，並在不同的文件相關性評分、批次長度和 LLM 模型（包括 GPT-3.5、GPT-4、LLaMa2-13B 和 LLaMa2-70B）下測試 AI 判斷。結果顯示，如果較早的文件具有高相關性，LLM 傾向於給予較後的文件較低分數，反之亦然，無論使用哪種組合和模型。我們的發現證明，與人類判斷類似，LLM 的判斷也受到閾值啟動偏差的影響，並表明研究人員和系統工程師在設計、評估和稽核 IR 任務及其他任務中的 LLM 時，應考慮潛在的人類認知偏差。</paragraph>", "author": "Nuo Chen et.al.", "authors": "Nuo Chen, Jiqun Liu, Xiaoyu Dong, Qijiong Liu, Tetsuya Sakai, Xiao-Ming Wu", "id": "2409.16022v1", "paper_url": "http://arxiv.org/abs/2409.16022v1", "repo": "null"}}