{"2411.14811": {"publish_time": "2024-11-22", "title": "Fine-Grained Alignment in Vision-and-Language Navigation through Bayesian Optimization", "paper_summary": "This paper addresses the challenge of fine-grained alignment in\nVision-and-Language Navigation (VLN) tasks, where robots navigate realistic 3D\nenvironments based on natural language instructions. Current approaches use\ncontrastive learning to align language with visual trajectory sequences.\nNevertheless, they encounter difficulties with fine-grained vision negatives.\nTo enhance cross-modal embeddings, we introduce a novel Bayesian\nOptimization-based adversarial optimization framework for creating fine-grained\ncontrastive vision samples. To validate the proposed methodology, we conduct a\nseries of experiments to assess the effectiveness of the enriched embeddings on\nfine-grained vision negatives. We conduct experiments on two common VLN\nbenchmarks R2R and REVERIE, experiments on the them demonstrate that these\nembeddings benefit navigation, and can lead to a promising performance\nenhancement. Our source code and trained models are available at:\nhttps://anonymous.4open.science/r/FGVLN.", "paper_summary_zh": "本文探讨了视觉和语言导航 (VLN) 任务中精细粒度对齐的挑战，在该任务中，机器人根据自然语言指令在逼真的 3D 环境中导航。当前的方法使用对比学习将语言与视觉轨迹序列对齐。然而，它们遇到了精细粒度视觉否定的困难。为了增强跨模态嵌入，我们引入了一个新颖的基于贝叶斯优化的对抗优化框架，用于创建精细粒度的对比视觉样本。为了验证所提出的方法，我们进行了一系列实验来评估丰富嵌入在精细粒度视觉否定上的有效性。我们在两个常见的 VLN 基准 R2R 和 REVERIE 上进行实验，在它们上的实验表明这些嵌入有利于导航，并且可以带来有希望的性能提升。我们的源代码和训练好的模型可在以下位置获得：\nhttps://anonymous.4open.science/r/FGVLN。", "author": "Yuhang Song et.al.", "authors": "Yuhang Song, Mario Gianni, Chenguang Yang, Kunyang Lin, Te-Chuan Chiu, Anh Nguyen, Chun-Yi Lee", "id": "2411.14811v1", "paper_url": "http://arxiv.org/abs/2411.14811v1", "repo": "null"}}