{"2501.09394": {"publish_time": "2025-01-16", "title": "Quantum-Enhanced Transformers for Robust Acoustic Scene Classification in IoT Environments", "paper_summary": "The proliferation of Internet of Things (IoT) devices equipped with acoustic\nsensors necessitates robust acoustic scene classification (ASC) capabilities,\neven in noisy and data-limited environments. Traditional machine learning\nmethods often struggle to generalize effectively under such conditions. To\naddress this, we introduce Q-ASC, a novel Quantum-Inspired Acoustic Scene\nClassifier that leverages the power of quantum-inspired transformers. By\nintegrating quantum concepts like superposition and entanglement, Q-ASC\nachieves superior feature learning and enhanced noise resilience compared to\nclassical models. Furthermore, we introduce a Quantum Variational Autoencoder\n(QVAE) based data augmentation technique to mitigate the challenge of limited\nlabeled data in IoT deployments. Extensive evaluations on the Tampere\nUniversity of Technology (TUT) Acoustic Scenes 2016 benchmark dataset\ndemonstrate that Q-ASC achieves remarkable accuracy between 68.3% and 88.5%\nunder challenging conditions, outperforming state-of-the-art methods by over 5%\nin the best case. This research paves the way for deploying intelligent\nacoustic sensing in IoT networks, with potential applications in smart homes,\nindustrial monitoring, and environmental surveillance, even in adverse acoustic\nenvironments.", "paper_summary_zh": "物联网 (IoT) 设备的激增配备了声学传感器，需要强大的声学场景分类 (ASC) 功能，即使在嘈杂和数据有限的环境中也是如此。传统的机器学习方法在这些条件下通常难以有效地泛化。为了解决这个问题，我们引入了 Q-ASC，这是一种新颖的量子启发声学场景分类器，它利用了量子启发变换器的能力。通过整合叠加和纠缠等量子概念，与经典模型相比，Q-ASC 实现了卓越的特征学习和增强的抗噪能力。此外，我们引入了一种基于量子变分自动编码器 (QVAE) 的数据增强技术，以减轻物联网部署中标记数据有限的挑战。对坦佩雷理工大学 (TUT) 声学场景 2016 基准数据集的广泛评估表明，Q-ASC 在具有挑战性的条件下实现了 68.3% 到 88.5% 的显着准确性，在最佳情况下比最先进的方法高出 5% 以上。这项研究为在物联网网络中部署智能声学传感铺平了道路，即使在不利的声学环境中，在智能家居、工业监控和环境监测中也具有潜在应用。", "author": "Minh K. Quan et.al.", "authors": "Minh K. Quan, Mayuri Wijayasundara, Sujeeva Setunge, Pubudu N. Pathirana", "id": "2501.09394v1", "paper_url": "http://arxiv.org/abs/2501.09394v1", "repo": "null"}}