{"2405.14664": {"publish_time": "2024-05-23", "title": "Fisher Flow Matching for Generative Modeling over Discrete Data", "paper_summary": "Generative modeling over discrete data has recently seen numerous success\nstories, with applications spanning language modeling, biological sequence\ndesign, and graph-structured molecular data. The predominant generative\nmodeling paradigm for discrete data is still autoregressive, with more recent\nalternatives based on diffusion or flow-matching falling short of their\nimpressive performance in continuous data settings, such as image or video\ngeneration. In this work, we introduce Fisher-Flow, a novel flow-matching model\nfor discrete data. Fisher-Flow takes a manifestly geometric perspective by\nconsidering categorical distributions over discrete data as points residing on\na statistical manifold equipped with its natural Riemannian metric: the\n$\\textit{Fisher-Rao metric}$. As a result, we demonstrate discrete data itself\ncan be continuously reparameterised to points on the positive orthant of the\n$d$-hypersphere $\\mathbb{S}^d_+$, which allows us to define flows that map any\nsource distribution to target in a principled manner by transporting mass along\n(closed-form) geodesics of $\\mathbb{S}^d_+$. Furthermore, the learned flows in\nFisher-Flow can be further bootstrapped by leveraging Riemannian optimal\ntransport leading to improved training dynamics. We prove that the gradient\nflow induced by Fisher-Flow is optimal in reducing the forward KL divergence.\n  We evaluate Fisher-Flow on an array of synthetic and diverse real-world\nbenchmarks, including designing DNA Promoter, and DNA Enhancer sequences.\nEmpirically, we find that Fisher-Flow improves over prior diffusion and\nflow-matching models on these benchmarks.", "paper_summary_zh": "<paragraph>離散資料的生成式模型最近獲得許多成功案例，應用範圍涵蓋語言模型、生物序列設計和圖形結構分子資料。離散資料的主要生成式模型範例仍然是自迴歸，而最近基於擴散或流匹配的替代方案無法達到在連續資料設定（例如影像或影片生成）中的驚人效能。在這項工作中，我們介紹 Fisher-Flow，這是一種針對離散資料的新穎流匹配模型。Fisher-Flow 採用明顯的幾何觀點，將離散資料上的類別分佈視為駐留在具有其自然黎曼度規的統計流形的點：$\\textit{Fisher-Rao 度量}$. 因此，我們證明離散資料本身可以連續重新參數化為 $d$-超球面 $\\mathbb{S}^d_+$ 的正軸向上的點，這讓我們可以定義流，以有原則的方式將任何源分佈映射到目標，方法是沿著 $\\mathbb{S}^d_+$ 的（閉合形式）測地線傳輸質量。此外，Fisher-Flow 中學習到的流可以進一步透過利用黎曼最佳傳輸進行引導，從而改善訓練動態。我們證明 Fisher-Flow 誘導的梯度流在減少前向 KL 散度方面是最理想的。我們在各種合成和多元的真實世界基準上評估 Fisher-Flow，包括設計 DNA 啟動子，以及 DNA 增強子序列。根據經驗，我們發現 Fisher-Flow 在這些基準上改進了先前的擴散和流匹配模型。</paragraph>", "author": "Oscar Davis et.al.", "authors": "Oscar Davis, Samuel Kessler, Mircea Petrache, İsmail İlkan Ceylan, Michael Bronstein, Avishek Joey Bose", "id": "2405.14664v3", "paper_url": "http://arxiv.org/abs/2405.14664v3", "repo": "null"}}