{"2504.06306": {"publish_time": "2025-04-07", "title": "Predicting Survivability of Cancer Patients with Metastatic Patterns Using Explainable AI", "paper_summary": "Cancer remains a leading global health challenge and a major cause of\nmortality. This study leverages machine learning (ML) to predict the\nsurvivability of cancer patients with metastatic patterns using the\ncomprehensive MSK-MET dataset, which includes genomic and clinical data from\n25,775 patients across 27 cancer types. We evaluated five ML models-XGBoost,\nNa\\\"ive Bayes, Decision Tree, Logistic Regression, and Random Fores using\nhyperparameter tuning and grid search. XGBoost emerged as the best performer\nwith an area under the curve (AUC) of 0.82. To enhance model interpretability,\nSHapley Additive exPlanations (SHAP) were applied, revealing key predictors\nsuch as metastatic site count, tumor mutation burden, fraction of genome\naltered, and organ-specific metastases. Further survival analysis using\nKaplan-Meier curves, Cox Proportional Hazards models, and XGBoost Survival\nAnalysis identified significant predictors of patient outcomes, offering\nactionable insights for clinicians. These findings could aid in personalized\nprognosis and treatment planning, ultimately improving patient care.", "paper_summary_zh": "<paragraph>癌症仍然是全球主要的健康挑戰和主要的死亡原因。這項研究利用機器學習 (ML) 來預測癌症轉移模式患者的存活率，使用的是全面的 MSK-MET 數據集，其中包含來自 27 種癌症類型的 25,775 名患者的基因組和臨床數據。我們使用超參數調整和網格搜索評估了五種機器學習模型：XGBoost、樸素貝葉斯、決策樹、邏輯迴歸和隨機森林。XGBoost 表現最佳，曲線下面積 (AUC) 為 0.82。為了增強模型的可解釋性，應用了 SHapley 加性解釋 (SHAP)，揭示了關鍵預測因子，例如轉移部位數量、腫瘤突變負荷、基因組改變的比例和器官特異性轉移。使用 Kaplan-Meier 曲線、Cox 比例風險模型和 XGBoost 生存分析進行的進一步生存分析確定了患者結果的重要預測因子，為臨床醫生提供了可操作的見解。這些發現可以幫助個性化預後和治療計劃，最終改善患者護理。</paragraph>\n", "author": "Polycarp Nalela et.al.", "authors": "Polycarp Nalela, Deepthi Rao, Praveen Rao", "id": "2504.06306v1", "paper_url": "http://arxiv.org/abs/2504.06306v1", "repo": "null"}}