{"2411.17073": {"publish_time": "2024-11-26", "title": "Path-RAG: Knowledge-Guided Key Region Retrieval for Open-ended Pathology Visual Question Answering", "paper_summary": "Accurate diagnosis and prognosis assisted by pathology images are essential\nfor cancer treatment selection and planning. Despite the recent trend of\nadopting deep-learning approaches for analyzing complex pathology images, they\nfall short as they often overlook the domain-expert understanding of tissue\nstructure and cell composition. In this work, we focus on a challenging\nOpen-ended Pathology VQA (PathVQA-Open) task and propose a novel framework\nnamed Path-RAG, which leverages HistoCartography to retrieve relevant domain\nknowledge from pathology images and significantly improves performance on\nPathVQA-Open. Admitting the complexity of pathology image analysis, Path-RAG\nadopts a human-centered AI approach by retrieving domain knowledge using\nHistoCartography to select the relevant patches from pathology images. Our\nexperiments suggest that domain guidance can significantly boost the accuracy\nof LLaVA-Med from 38% to 47%, with a notable gain of 28% for H&E-stained\npathology images in the PathVQA-Open dataset. For longer-form question and\nanswer pairs, our model consistently achieves significant improvements of 32.5%\nin ARCH-Open PubMed and 30.6% in ARCH-Open Books on H\\&E images. Our code and\ndataset is available here (https://github.com/embedded-robotics/path-rag).", "paper_summary_zh": "準確的診斷和預後有助於病理圖像的癌症治療選擇和規劃。儘管最近採用深度學習方法分析複雜的病理圖像的趨勢，但它們往往忽視了組織結構和細胞組成的領域專家理解。在這項工作中，我們專注於一個具有挑戰性的開放式病理 VQA（PathVQA-Open）任務，並提出了一個名為 Path-RAG 的新框架，它利用組織細胞繪圖法從病理圖像中檢索相關的領域知識，並顯著提高了 PathVQA-Open 的性能。承認病理圖像分析的複雜性，Path-RAG 採用以人為中心的 AI 方法，通過使用組織細胞繪圖法檢索領域知識，從病理圖像中選擇相關的貼片。我們的實驗表明，領域指導可以將 LLaVA-Med 的準確度從 38% 大幅提升至 47%，在 PathVQA-Open 數據集中，H&E 染色的病理圖像獲得了 28% 的顯著增益。對於較長的問答對，我們的模型在 ARCH-Open PubMed 中持續獲得 32.5% 的顯著改進，在 H&E 圖像上的 ARCH-Open Books 中獲得 30.6% 的改進。我們的代碼和數據集可在此處獲得（https://github.com/embedded-robotics/path-rag）。", "author": "Awais Naeem et.al.", "authors": "Awais Naeem, Tianhao Li, Huang-Ru Liao, Jiawei Xu, Aby M. Mathew, Zehao Zhu, Zhen Tan, Ajay Kumar Jaiswal, Raffi A. Salibian, Ziniu Hu, Tianlong Chen, Ying Ding", "id": "2411.17073v1", "paper_url": "http://arxiv.org/abs/2411.17073v1", "repo": "https://github.com/embedded-robotics/path-rag"}}