{"2408.14866": {"publish_time": "2024-08-27", "title": "Advancing Adversarial Suffix Transfer Learning on Aligned Large Language Models", "paper_summary": "Language Language Models (LLMs) face safety concerns due to potential misuse\nby malicious users. Recent red-teaming efforts have identified adversarial\nsuffixes capable of jailbreaking LLMs using the gradient-based search algorithm\nGreedy Coordinate Gradient (GCG). However, GCG struggles with computational\ninefficiency, limiting further investigations regarding suffix transferability\nand scalability across models and data. In this work, we bridge the connection\nbetween search efficiency and suffix transferability. We propose a two-stage\ntransfer learning framework, DeGCG, which decouples the search process into\nbehavior-agnostic pre-searching and behavior-relevant post-searching.\nSpecifically, we employ direct first target token optimization in pre-searching\nto facilitate the search process. We apply our approach to cross-model,\ncross-data, and self-transfer scenarios. Furthermore, we introduce an\ninterleaved variant of our approach, i-DeGCG, which iteratively leverages\nself-transferability to accelerate the search process. Experiments on HarmBench\ndemonstrate the efficiency of our approach across various models and domains.\nNotably, our i-DeGCG outperforms the baseline on Llama2-chat-7b with ASRs of\n$43.9$ ($+22.2$) and $39.0$ ($+19.5$) on valid and test sets, respectively.\nFurther analysis on cross-model transfer indicates the pivotal role of first\ntarget token optimization in leveraging suffix transferability for efficient\nsearching.", "paper_summary_zh": "語言語言模型 (LLM) 因惡意使用者可能濫用而面臨安全問題。最近的紅隊行動已找出對抗性字尾，可使用基於梯度的搜尋演算法貪婪座標梯度 (GCG) 破解 LLM。然而，GCG 飽受運算效率不彰所苦，限制進一步調查字尾的可移植性和跨模型及資料的可擴充性。在這項研究中，我們搭起搜尋效率和字尾可移植性之間的橋樑。我們提出一個兩階段轉移學習架構 DeGCG，它將搜尋程序解耦成與行為無關的前置搜尋和與行為相關的後置搜尋。具體來說，我們在預先搜尋中採用直接的第一個目標符號最佳化，以利搜尋程序。我們將我們的做法應用於跨模型、跨資料和自我轉移場景。此外，我們還引入了我們做法的交錯變體 i-DeGCG，它反覆利用自我可轉移性來加速搜尋程序。在 HarmBench 上的實驗證明了我們的方法在各種模型和領域中的效率。值得注意的是，我們的 i-DeGCG 在 Llama2-chat-7b 上優於基準，在驗證和測試集上的 ASR 分別為 43.9 (+22.2) 和 39.0 (+19.5)。跨模型轉移的進一步分析表明，第一個目標符號最佳化在利用字尾可移植性以進行有效搜尋中扮演關鍵角色。", "author": "Hongfu Liu et.al.", "authors": "Hongfu Liu, Yuxi Xie, Ye Wang, Michael Shieh", "id": "2408.14866v1", "paper_url": "http://arxiv.org/abs/2408.14866v1", "repo": "null"}}