{"2407.13887": {"publish_time": "2024-07-18", "title": "Learning Goal-Conditioned Representations for Language Reward Models", "paper_summary": "Techniques that learn improved representations via offline data or\nself-supervised objectives have shown impressive results in traditional\nreinforcement learning (RL). Nevertheless, it is unclear how improved\nrepresentation learning can benefit reinforcement learning from human feedback\n(RLHF) on language models (LMs). In this work, we propose training reward\nmodels (RMs) in a contrastive, $\\textit{goal-conditioned}$ fashion by\nincreasing the representation similarity of future states along sampled\npreferred trajectories and decreasing the similarity along randomly sampled\ndispreferred trajectories. This objective significantly improves RM performance\nby up to 0.09 AUROC across challenging benchmarks, such as MATH and GSM8k.\nThese findings extend to general alignment as well -- on the Helpful-Harmless\ndataset, we observe $2.3\\%$ increase in accuracy. Beyond improving reward model\nperformance, we show this way of training RM representations enables improved\n$\\textit{steerability}$ because it allows us to evaluate the likelihood of an\naction achieving a particular goal-state (e.g., whether a solution is correct\nor helpful). Leveraging this insight, we find that we can filter up to $55\\%$\nof generated tokens during majority voting by discarding trajectories likely to\nend up in an \"incorrect\" state, which leads to significant cost savings. We\nadditionally find that these representations can perform fine-grained control\nby conditioning on desired future goal-states. For example, we show that\nsteering a Llama 3 model towards helpful generations with our approach improves\nhelpfulness by $9.6\\%$ over a supervised-fine-tuning trained baseline.\nSimilarly, steering the model towards complex generations improves complexity\nby $21.6\\%$ over the baseline. Overall, we find that training RMs in this\ncontrastive, goal-conditioned fashion significantly improves performance and\nenables model steerability.", "paper_summary_zh": "<paragraph>透過離線資料或自我監督目標學習到改良表徵的技術，在傳統的強化學習 (RL) 中已展現出令人印象深刻的成果。儘管如此，目前尚不清楚改良的表徵學習如何能從語言模型 (LM) 上的人類回饋 (RLHF) 中受益。在這項工作中，我們建議以對比、$\\textit{目標制約}$的方式訓練獎勵模型 (RM)，方法是增加沿著取樣偏好軌跡的未來狀態的表徵相似性，並減少沿著隨機取樣非偏好軌跡的相似性。此目標顯著改善 RM 效能，在 MATH 和 GSM8k 等具挑戰性的基準測試中提升了高達 0.09 AUROC。這些發現也延伸到一般對齊——在 Helpful-Harmless 資料集上，我們觀察到準確度增加了 $2.3\\%$。除了改善獎勵模型效能之外，我們展示了這種訓練 RM 表徵的方式能改善$\\textit{可控性}$，因為它讓我們能夠評估動作達成特定目標狀態的可能性（例如，某個解是否正確或有幫助）。利用此洞見，我們發現我們可以在多數投票期間過濾掉高達 $55\\%$ 的已產生權杖，方法是捨棄可能會結束在「不正確」狀態的軌跡，這能大幅節省成本。我們另外發現，這些表徵可以透過制約在理想的未來目標狀態上來執行細微控制。例如，我們展示了使用我們的做法將 Llama 3 模型導向有幫助的生成，能比經過監督微調訓練的基準線改善 $9.6\\%$ 的有幫助性。類似地，將模型導向複雜的生成能比基準線改善 $21.6\\%$ 的複雜性。整體而言，我們發現以這種對比、目標制約的方式訓練 RM 能顯著改善效能，並讓模型具備可控性。</paragraph>", "author": "Vaskar Nath et.al.", "authors": "Vaskar Nath, Dylan Slack, Jeff Da, Yuntao Ma, Hugh Zhang, Spencer Whitehead, Sean Hendryx", "id": "2407.13887v1", "paper_url": "http://arxiv.org/abs/2407.13887v1", "repo": "https://github.com/vaskarnathscale/goal-conditioned-rm"}}