{"2407.07880": {"publish_time": "2024-07-10", "title": "Towards Robust Alignment of Language Models: Distributionally Robustifying Direct Preference Optimization", "paper_summary": "This study addresses the challenge of noise in training datasets for Direct\nPreference Optimization (DPO), a method for aligning Large Language Models\n(LLMs) with human preferences. We categorize noise into pointwise noise, which\nincludes low-quality data points, and pairwise noise, which encompasses\nerroneous data pair associations that affect preference rankings. Utilizing\nDistributionally Robust Optimization (DRO), we enhance DPO's resilience to\nthese types of noise. Our theoretical insights reveal that DPO inherently\nembeds DRO principles, conferring robustness to pointwise noise, with the\nregularization coefficient $\\beta$ playing a critical role in its noise\nresistance. Extending this framework, we introduce Distributionally\nRobustifying DPO (Dr. DPO), which integrates pairwise robustness by optimizing\nagainst worst-case pairwise scenarios. The novel hyperparameter $\\beta'$ in Dr.\nDPO allows for fine-tuned control over data pair reliability, providing a\nstrategic balance between exploration and exploitation in noisy training\nenvironments. Empirical evaluations demonstrate that Dr. DPO substantially\nimproves the quality of generated text and response accuracy in preference\ndatasets, showcasing enhanced performance in both noisy and noise-free\nsettings. The code is available at https://github.com/junkangwu/Dr_DPO.", "paper_summary_zh": "本研究探讨了直接偏好优化 (DPO) 训练数据集中的噪声挑战，DPO 是一种将大型语言模型 (LLM) 与人类偏好相匹配的方法。我们将噪声分为逐点噪声，其中包括低质量数据点，以及成对噪声，其中包括影响偏好排名的错误数据对关联。利用分布鲁棒优化 (DRO)，我们增强了 DPO 对这些类型噪声的弹性。我们的理论见解表明，DPO 本质上嵌入了 DRO 原则，赋予了对逐点噪声的鲁棒性，其中正则化系数 $\\beta$ 在其抗噪声中起着至关重要的作用。扩展此框架，我们引入了分布鲁棒化 DPO (Dr. DPO)，它通过针对最坏情况成对场景进行优化来集成成对鲁棒性。Dr. DPO 中的新型超参数 $\\beta'$ 允许对数据对可靠性进行微调控制，在嘈杂的训练环境中提供探索和利用之间的战略平衡。经验评估表明，Dr. DPO 在首选数据集中的生成文本质量和响应准确性方面有了实质性的提高，在有噪声和无噪声设置中都展示了增强的性能。代码可在 https://github.com/junkangwu/Dr_DPO 获得。", "author": "Junkang Wu et.al.", "authors": "Junkang Wu, Yuexiang Xie, Zhengyi Yang, Jiancan Wu, Jiawei Chen, Jinyang Gao, Bolin Ding, Xiang Wang, Xiangnan He", "id": "2407.07880v1", "paper_url": "http://arxiv.org/abs/2407.07880v1", "repo": "https://github.com/junkangwu/dr_dpo"}}