{"2410.10594": {"publish_time": "2024-10-14", "title": "VisRAG: Vision-based Retrieval-augmented Generation on Multi-modality Documents", "paper_summary": "Retrieval-augmented generation (RAG) is an effective technique that enables\nlarge language models (LLMs) to utilize external knowledge sources for\ngeneration. However, current RAG systems are solely based on text, rendering it\nimpossible to utilize vision information like layout and images that play\ncrucial roles in real-world multi-modality documents. In this paper, we\nintroduce VisRAG, which tackles this issue by establishing a vision-language\nmodel (VLM)-based RAG pipeline. In this pipeline, instead of first parsing the\ndocument to obtain text, the document is directly embedded using a VLM as an\nimage and then retrieved to enhance the generation of a VLM. Compared to\ntraditional text-based RAG, VisRAG maximizes the retention and utilization of\nthe data information in the original documents, eliminating the information\nloss introduced during the parsing process. We collect both open-source and\nsynthetic data to train the retriever in VisRAG and explore a variety of\ngeneration methods. Experiments demonstrate that VisRAG outperforms traditional\nRAG in both the retrieval and generation stages, achieving a 25--39\\%\nend-to-end performance gain over traditional text-based RAG pipeline. Further\nanalysis reveals that VisRAG is effective in utilizing training data and\ndemonstrates strong generalization capability, positioning it as a promising\nsolution for RAG on multi-modality documents. Our code and data are available\nat https://github.com/openbmb/visrag .", "paper_summary_zh": "檢索增強生成 (RAG) 是一種有效技術，可讓大型語言模型 (LLM) 利用外部知識來源進行生成。然而，目前的 RAG 系統僅基於文字，無法利用現實世界多模態文件中的版面和圖像等視覺資訊，而這些資訊扮演著至關重要的角色。在本文中，我們介紹了 VisRAG，它透過建立一個基於視覺語言模型 (VLM) 的 RAG 管線來解決這個問題。在這個管線中，並非先解析文件以取得文字，而是直接使用 VLM 將文件嵌入為圖像，然後檢索以增強 VLM 的生成。與傳統的基於文字的 RAG 相比，VisRAG 最大化保留和利用原始文件中的資料資訊，消除了解析過程中產生的資訊遺失。我們收集了開源資料和合成資料來訓練 VisRAG 中的檢索器，並探索了各種生成方法。實驗證明，VisRAG 在檢索和生成階段都優於傳統的 RAG，在傳統的基於文字的 RAG 管線中，端到端效能提升了 25--39%。進一步的分析顯示，VisRAG 能有效利用訓練資料，並展現出強大的泛化能力，使其成為多模態文件中 RAG 的一個有前途的解決方案。我們的程式碼和資料可在 https://github.com/openbmb/visrag 取得。", "author": "Shi Yu et.al.", "authors": "Shi Yu, Chaoyue Tang, Bokai Xu, Junbo Cui, Junhao Ran, Yukun Yan, Zhenghao Liu, Shuo Wang, Xu Han, Zhiyuan Liu, Maosong Sun", "id": "2410.10594v1", "paper_url": "http://arxiv.org/abs/2410.10594v1", "repo": "null"}}