{"2411.04692": {"publish_time": "2024-11-07", "title": "Personalized Federated Learning for Cross-view Geo-localization", "paper_summary": "In this paper we propose a methodology combining Federated Learning (FL) with\nCross-view Image Geo-localization (CVGL) techniques. We address the challenges\nof data privacy and heterogeneity in autonomous vehicle environments by\nproposing a personalized Federated Learning scenario that allows selective\nsharing of model parameters. Our method implements a coarse-to-fine approach,\nwhere clients share only the coarse feature extractors while keeping\nfine-grained features specific to local environments. We evaluate our approach\nagainst traditional centralized and single-client training schemes using the\nKITTI dataset combined with satellite imagery. Results demonstrate that our\nfederated CVGL method achieves performance close to centralized training while\nmaintaining data privacy. The proposed partial model sharing strategy shows\ncomparable or slightly better performance than classical FL, offering\nsignificant reduced communication overhead without sacrificing accuracy. Our\nwork contributes to more robust and privacy-preserving localization systems for\nautonomous vehicles operating in diverse environments", "paper_summary_zh": "在本文中，我們提出了一種結合聯邦學習 (FL) 與跨視圖影像地理定位 (CVGL) 技術的方法。我們透過提出允許選擇性分享模型參數的個人化聯邦學習場景，來解決自駕車環境中的資料隱私和異質性挑戰。我們的模型實作一種由粗到細的方法，客戶端僅分享粗略的特徵萃取器，同時保留特定於當地環境的細粒度特徵。我們使用結合了衛星影像的 KITTI 資料集，針對傳統的集中式和單一客戶端訓練架構評估我們的模型。結果證明，我們的聯邦 CVGL 方法達到了接近集中式訓練的效能，同時維護資料隱私。所提出的部分模型分享策略展現出與傳統 FL 相當或略佳的效能，在不犧牲準確度的條件下，大幅減少通訊開銷。我們的研究有助於建立在各種環境中運作的自駕車的更強大且注重隱私的定位系統", "author": "Christos Anagnostopoulos et.al.", "authors": "Christos Anagnostopoulos, Alexandros Gkillas, Nikos Piperigkos, Aris S. Lalos", "id": "2411.04692v1", "paper_url": "http://arxiv.org/abs/2411.04692v1", "repo": "null"}}