{"2412.16423": {"publish_time": "2024-12-21", "title": "Technical Report: Small Language Model for Japanese Clinical and Medicine", "paper_summary": "This report presents a small language model (SLM) for Japanese clinical and\nmedicine, named NCVC-slm-1. This 1B parameters model was trained using Japanese\ntext classified to be of high-quality. Moreover, NCVC-slm-1 was augmented with\nrespect to clinical and medicine content that includes the variety of diseases,\ndrugs, and examinations. Using a carefully designed pre-processing, a\nspecialized morphological analyzer and tokenizer, this small and light-weight\nmodel performed not only to generate text but also indicated the feasibility of\nunderstanding clinical and medicine text. In comparison to other large language\nmodels, a fine-tuning NCVC-slm-1 demonstrated the highest scores on 6 tasks of\ntotal 8 on JMED-LLM. According to this result, SLM indicated the feasibility of\nperforming several downstream tasks in the field of clinical and medicine.\nHopefully, NCVC-slm-1 will be contributed to develop and accelerate the field\nof clinical and medicine for a bright future.", "paper_summary_zh": "本報告提出一個針對日文臨床和醫學的小型語言模型 (SLM)，名為 NCVC-slm-1。這個 1B 參數模型是使用被分類為高品質的日文文本訓練的。此外，NCVC-slm-1 還針對臨床和醫學內容進行擴充，其中包含各種疾病、藥物和檢查。使用精心設計的預處理、專業形態分析器和分詞器，這個小而輕的模型不僅可以生成文字，還表示了理解臨床和醫學文本的可行性。與其他大型語言模型相比，微調後的 NCVC-slm-1 在 JMED-LLM 的 8 個任務中有 6 個任務上表現出最高的得分。根據這個結果，SLM 表示了執行臨床和醫學領域中多項下游任務的可行性。希望 NCVC-slm-1 能為臨床和醫學領域的發展和加速做出貢獻，邁向光明的未來。", "author": "Shogo Watanabe et.al.", "authors": "Shogo Watanabe", "id": "2412.16423v1", "paper_url": "http://arxiv.org/abs/2412.16423v1", "repo": "null"}}