{"2411.09590": {"publish_time": "2024-11-14", "title": "Adopting RAG for LLM-Aided Future Vehicle Design", "paper_summary": "In this paper, we explore the integration of Large Language Models (LLMs)\nwith Retrieval-Augmented Generation (RAG) to enhance automated design and\nsoftware development in the automotive industry. We present two case studies: a\nstandardization compliance chatbot and a design copilot, both utilizing RAG to\nprovide accurate, context-aware responses. We evaluate four LLMs-GPT-4o,\nLLAMA3, Mistral, and Mixtral- comparing their answering accuracy and execution\ntime. Our results demonstrate that while GPT-4 offers superior performance,\nLLAMA3 and Mistral also show promising capabilities for local deployment,\naddressing data privacy concerns in automotive applications. This study\nhighlights the potential of RAG-augmented LLMs in improving design workflows\nand compliance in automotive engineering.", "paper_summary_zh": "在本文中，我們探討將大型語言模型 (LLM) 與檢索增強生成 (RAG) 整合，以增強汽車產業中的自動化設計和軟體開發。我們提出兩個案例研究：一個標準化合規聊天機器人和一個設計副駕駛，兩者都利用 RAG 來提供準確且符合脈絡的回應。我們評估了四個 LLM-GPT-4o、LLAMA3、Mistral 和 Mixtral，比較它們的回答準確度和執行時間。我們的結果表明，儘管 GPT-4 提供了卓越的效能，但 LLAMA3 和 Mistral 也顯示出有望用於本地部署的能力，解決了汽車應用中的資料隱私問題。這項研究強調了 RAG 增強的 LLM 在改善汽車工程中的設計工作流程和合規性的潛力。", "author": "Vahid Zolfaghari et.al.", "authors": "Vahid Zolfaghari, Nenad Petrovic, Fengjunjie Pan, Krzysztof Lebioda, Alois Knoll", "id": "2411.09590v1", "paper_url": "http://arxiv.org/abs/2411.09590v1", "repo": "null"}}