{"2502.13845": {"publish_time": "2025-02-19", "title": "Enhancing LLM-Based Recommendations Through Personalized Reasoning", "paper_summary": "Current recommendation systems powered by large language models (LLMs) often\nunderutilize their reasoning capabilities due to a lack of explicit logical\nstructuring. To address this limitation, we introduce CoT-Rec, a framework that\nintegrates Chain-of-Thought (CoT) reasoning into LLM-driven recommendations by\nincorporating two crucial processes: user preference analysis and item\nperception evaluation. CoT-Rec operates in two key phases: (1) personalized\ndata extraction, where user preferences and item perceptions are identified,\nand (2) personalized data application, where this information is leveraged to\nrefine recommendations. Our experimental analysis demonstrates that CoT-Rec\nimproves recommendation accuracy by making better use of LLMs' reasoning\npotential. The implementation is publicly available at\nhttps://anonymous.4open.science/r/CoT-Rec.", "paper_summary_zh": "目前由大型語言模型 (LLM) 驅動的推薦系統通常由於缺乏明確的邏輯結構而無法充分利用其推理能力。為了解決此限制，我們引入了 CoT-Rec，一個將思考鏈 (CoT) 推理整合到 LLM 驅動的推薦中的框架，方法是納入兩個關鍵流程：使用者偏好分析和項目感知評估。CoT-Rec 在兩個關鍵階段中運作：(1) 個人化數據萃取，其中識別使用者偏好和項目感知，以及 (2) 個人化數據應用，其中利用這些資訊來優化推薦。我們的實驗分析證明，CoT-Rec 透過更有效地利用 LLM 的推理潛力來提升推薦準確度。實作已公開於 https://anonymous.4open.science/r/CoT-Rec。", "author": "Jiahao Liu et.al.", "authors": "Jiahao Liu, Xueshuo Yan, Dongsheng Li, Guangping Zhang, Hansu Gu, Peng Zhang, Tun Lu, Li Shang, Ning Gu", "id": "2502.13845v1", "paper_url": "http://arxiv.org/abs/2502.13845v1", "repo": "null"}}