{"2406.01256": {"publish_time": "2024-06-03", "title": "Augmented Commonsense Knowledge for Remote Object Grounding", "paper_summary": "The vision-and-language navigation (VLN) task necessitates an agent to\nperceive the surroundings, follow natural language instructions, and act in\nphoto-realistic unseen environments. Most of the existing methods employ the\nentire image or object features to represent navigable viewpoints. However,\nthese representations are insufficient for proper action prediction, especially\nfor the REVERIE task, which uses concise high-level instructions, such as\n''Bring me the blue cushion in the master bedroom''. To address enhancing\nrepresentation, we propose an augmented commonsense knowledge model (ACK) to\nleverage commonsense information as a spatio-temporal knowledge graph for\nimproving agent navigation. Specifically, the proposed approach involves\nconstructing a knowledge base by retrieving commonsense information from\nConceptNet, followed by a refinement module to remove noisy and irrelevant\nknowledge. We further present ACK which consists of knowledge graph-aware\ncross-modal and concept aggregation modules to enhance visual representation\nand visual-textual data alignment by integrating visible objects, commonsense\nknowledge, and concept history, which includes object and knowledge temporal\ninformation. Moreover, we add a new pipeline for the commonsense-based\ndecision-making process which leads to more accurate local action prediction.\nExperimental results demonstrate our proposed model noticeably outperforms the\nbaseline and archives the state-of-the-art on the REVERIE benchmark.", "paper_summary_zh": "視覺與語言導航 (VLN) 任務需要代理感知環境、遵循自然語言指令，並在寫實的未見環境中採取行動。現有方法大多使用整個影像或物件特徵來表示可導航視點。然而，這些表示對於適當的動作預測來說是不夠的，特別是對於使用簡潔的高階指令的 REVERIE 任務，例如「幫我拿主臥室的藍色靠墊」。為了增強表示，我們提出一個擴增常識知識模型 (ACK)，以利用常識資訊作為時空知識圖譜，用於改善代理導航。具體來說，所提出的方法包括透過從 ConceptNet 擷取常識資訊來建構一個知識庫，接著使用一個精煉模組來移除有雜訊和不相關的知識。我們進一步提出 ACK，它包含了知識圖譜感知的跨模態和概念聚合模組，以透過整合可見物件、常識知識和概念歷程（包括物件和知識的時間資訊）來增強視覺表示和視覺文字資料對齊。此外，我們為基於常識的決策制定程序新增一個新管線，這會導致更準確的局部動作預測。實驗結果證明我們提出的模型顯著優於基線，並在 REVERIE 基準上達到最先進的狀態。", "author": "Bahram Mohammadi et.al.", "authors": "Bahram Mohammadi, Yicong Hong, Yuankai Qi, Qi Wu, Shirui Pan, Javen Qinfeng Shi", "id": "2406.01256v1", "paper_url": "http://arxiv.org/abs/2406.01256v1", "repo": "null"}}