{"2502.14759": {"publish_time": "2025-02-20", "title": "On the Influence of Context Size and Model Choice in Retrieval-Augmented Generation Systems", "paper_summary": "Retrieval-augmented generation (RAG) has emerged as an approach to augment\nlarge language models (LLMs) by reducing their reliance on static knowledge and\nimproving answer factuality. RAG retrieves relevant context snippets and\ngenerates an answer based on them. Despite its increasing industrial adoption,\nsystematic exploration of RAG components is lacking, particularly regarding the\nideal size of provided context, and the choice of base LLM and retrieval\nmethod. To help guide development of robust RAG systems, we evaluate various\ncontext sizes, BM25 and semantic search as retrievers, and eight base LLMs.\nMoving away from the usual RAG evaluation with short answers, we explore the\nmore challenging long-form question answering in two domains, where a good\nanswer has to utilize the entire context. Our findings indicate that final QA\nperformance improves steadily with up to 15 snippets but stagnates or declines\nbeyond that. Finally, we show that different general-purpose LLMs excel in the\nbiomedical domain than the encyclopedic one, and that open-domain evidence\nretrieval in large corpora is challenging.", "paper_summary_zh": "檢索增強生成 (RAG) 已成為一種方法，可透過減少大型語言模型 (LLM) 對靜態知識的依賴，並改善答案的真實性，來增強大型語言模型 (LLM)。RAG 會擷取相關的內容片段，並根據這些片段產生答案。儘管其產業採用率不斷提高，但缺乏對 RAG 組成的系統性探討，特別是在提供的內容的理想大小，以及基礎 LLM 和檢索方法的選擇方面。為了協助引導穩健 RAG 系統的開發，我們評估了各種內容大小、BM25 和語意搜尋作為檢索器，以及八個基礎 LLM。我們不再使用簡短答案進行常見的 RAG 評估，而是探討在兩個領域中更具挑戰性的長篇問答，其中一個好的答案必須利用整個內容。我們的研究結果指出，最終的問答效能會隨著多達 15 個片段而穩定提升，但在超過這個數量後就會停滯或下降。最後，我們表明不同的通用 LLM 在生物醫學領域比百科全書領域更為出色，而且在大型語料庫中進行開放領域證據檢索具有挑戰性。", "author": "Juraj Vladika et.al.", "authors": "Juraj Vladika, Florian Matthes", "id": "2502.14759v1", "paper_url": "http://arxiv.org/abs/2502.14759v1", "repo": "null"}}