{"2412.13589": {"publish_time": "2024-12-18", "title": "SemiDFL: A Semi-Supervised Paradigm for Decentralized Federated Learning", "paper_summary": "Decentralized federated learning (DFL) realizes cooperative model training\namong connected clients without relying on a central server, thereby mitigating\ncommunication bottlenecks and eliminating the single-point failure issue\npresent in centralized federated learning (CFL). Most existing work on DFL\nfocuses on supervised learning, assuming each client possesses sufficient\nlabeled data for local training. However, in real-world applications, much of\nthe data is unlabeled. We address this by considering a challenging yet\npractical semisupervised learning (SSL) scenario in DFL, where clients may have\nvarying data sources: some with few labeled samples, some with purely unlabeled\ndata, and others with both. In this work, we propose SemiDFL, the first\nsemi-supervised DFL method that enhances DFL performance in SSL scenarios by\nestablishing a consensus in both data and model spaces. Specifically, we\nutilize neighborhood information to improve the quality of pseudo-labeling,\nwhich is crucial for effectively leveraging unlabeled data. We then design a\nconsensusbased diffusion model to generate synthesized data, which is used in\ncombination with pseudo-labeled data to create mixed datasets. Additionally, we\ndevelop an adaptive aggregation method that leverages the model accuracy of\nsynthesized data to further enhance SemiDFL performance. Through extensive\nexperimentation, we demonstrate the remarkable performance superiority of the\nproposed DFL-Semi method over existing CFL and DFL schemes in both IID and\nnon-IID SSL scenarios.", "paper_summary_zh": "分散式聯合學習 (DFL) 讓連線的用戶端在不依賴中央伺服器的情況下實現協作模型訓練，進而減輕通訊瓶頸並消除集中式聯合學習 (CFL) 中存在的單點故障問題。現有關於 DFL 的研究大多著重於監督式學習，假設每個用戶端都擁有足夠的標籤資料，可進行本地訓練。然而，在實際應用中，大部分資料都是未標籤的。我們透過考量 DFL 中具有挑戰性但實用的半監督式學習 (SSL) 情境來解決這個問題，在該情境中，用戶端可能擁有不同的資料來源：有些標籤範例很少，有些只有純未標籤資料，而有些則兩者都有。在這項研究中，我們提出 SemiDFL，這是第一個半監督式 DFL 方法，透過在資料和模型空間中建立共識來增強 DFL 在 SSL 情境中的效能。具體來說，我們利用鄰域資訊來提升偽標籤的品質，這對於有效利用未標籤資料至關重要。然後，我們設計一個基於共識的擴散模型來產生合成資料，並與偽標籤資料結合使用，以建立混合資料集。此外，我們開發了一種自適應聚合方法，利用合成資料的模型準確度進一步提升 SemiDFL 的效能。透過廣泛的實驗，我們證明了所提出的 DFL-Semi 方法在 IID 和非 IID SSL 情境中均優於現有的 CFL 和 DFL 方案，效能極為優異。", "author": "Xinyang Liu et.al.", "authors": "Xinyang Liu, Pengchao Han, Xuan Li, Bo Liu", "id": "2412.13589v1", "paper_url": "http://arxiv.org/abs/2412.13589v1", "repo": "https://github.com/ez4lionky/SemiDFL"}}