{"2407.07778": {"publish_time": "2024-07-10", "title": "WorldAPIs: The World Is Worth How Many APIs? A Thought Experiment", "paper_summary": "AI systems make decisions in physical environments through primitive actions\nor affordances that are accessed via API calls. While deploying AI agents in\nthe real world involves numerous high-level actions, existing embodied\nsimulators offer a limited set of domain-salient APIs. This naturally brings up\nthe questions: how many primitive actions (APIs) are needed for a versatile\nembodied agent, and what should they look like? We explore this via a thought\nexperiment: assuming that wikiHow tutorials cover a wide variety of\nhuman-written tasks, what is the space of APIs needed to cover these\ninstructions? We propose a framework to iteratively induce new APIs by\ngrounding wikiHow instruction to situated agent policies. Inspired by recent\nsuccesses in large language models (LLMs) for embodied planning, we propose a\nfew-shot prompting to steer GPT-4 to generate Pythonic programs as agent\npolicies and bootstrap a universe of APIs by 1) reusing a seed set of APIs; and\nthen 2) fabricate new API calls when necessary. The focus of this thought\nexperiment is on defining these APIs rather than their executability. We apply\nthe proposed pipeline on instructions from wikiHow tutorials. On a small\nfraction (0.5%) of tutorials, we induce an action space of 300+ APIs necessary\nfor capturing the rich variety of tasks in the physical world. A detailed\nautomatic and human analysis of the induction output reveals that the proposed\npipeline enables effective reuse and creation of APIs. Moreover, a manual\nreview revealed that existing simulators support only a small subset of the\ninduced APIs (9 of the top 50 frequent APIs), motivating the development of\naction-rich embodied environments.", "paper_summary_zh": "人工智能系統透過基本動作或可透過 API 呼叫存取的便利功能在實際環境中做出決策。雖然在現實世界中部署 AI 代理會涉及許多高階動作，但現有的具體模擬器僅提供有限的領域顯著 API。這自然會引發疑問：一個多功能的具體代理需要多少基本動作 (API)，它們應該是什麼樣子？我們透過一個思想實驗來探討這一點：假設 wikiHow 教學涵蓋了各種各樣的人類書寫任務，那麼涵蓋這些說明所需的 API 空間是什麼？我們提出一個架構，透過將 wikiHow 說明與具體代理政策相結合，反覆誘導出新的 API。受到大型語言模型 (LLM) 在具體規劃中近期成功的啟發，我們提出一個少次提示，引導 GPT-4 生成 Pythonic 程式作為代理政策，並透過 1) 重複使用一組種子 API，然後 2) 在必要時捏造新的 API 呼叫來引導大量的 API。這個思想實驗的重點在於定義這些 API，而不是它們的可執行性。我們將提議的管道應用於 wikiHow 教學的說明。在教學的一小部分 (0.5%) 中，我們誘導出一個包含 300 多個 API 的動作空間，這些 API 對於捕捉現實世界中豐富多樣的任務是必要的。對誘導輸出的詳細自動和人工分析顯示，提議的管道可以有效地重複使用和建立 API。此外，手動檢閱顯示現有的模擬器僅支援誘導 API 的一小部分 (前 50 個頻繁 API 中的 9 個)，這促使開發動作豐富的具體環境。", "author": "Jiefu Ou et.al.", "authors": "Jiefu Ou, Arda Uzunoglu, Benjamin Van Durme, Daniel Khashabi", "id": "2407.07778v1", "paper_url": "http://arxiv.org/abs/2407.07778v1", "repo": "null"}}