{"2502.02384": {"publish_time": "2025-02-04", "title": "STAIR: Improving Safety Alignment with Introspective Reasoning", "paper_summary": "Ensuring the safety and harmlessness of Large Language Models (LLMs) has\nbecome equally critical as their performance in applications. However, existing\nsafety alignment methods typically suffer from safety-performance trade-offs\nand the susceptibility to jailbreak attacks, primarily due to their reliance on\ndirect refusals for malicious queries. In this paper, we propose STAIR, a novel\nframework that integrates SafeTy Alignment with Itrospective Reasoning. We\nenable LLMs to identify safety risks through step-by-step analysis by\nself-improving chain-of-thought (CoT) reasoning with safety awareness. STAIR\nfirst equips the model with a structured reasoning capability and then advances\nsafety alignment via iterative preference optimization on step-level reasoning\ndata generated using our newly proposed Safety-Informed Monte Carlo Tree Search\n(SI-MCTS). We further train a process reward model on this data to guide\ntest-time searches for improved responses. Extensive experiments show that\nSTAIR effectively mitigates harmful outputs while better preserving\nhelpfulness, compared to instinctive alignment strategies. With test-time\nscaling, STAIR achieves a safety performance comparable to Claude-3.5 against\npopular jailbreak attacks. Relevant resources in this work are available at\nhttps://github.com/thu-ml/STAIR.", "paper_summary_zh": "確保大型語言模型 (LLM) 的安全性和無害性已變得與其在應用中的性能一樣重要。然而，現有的安全對齊方法通常會受到安全性能權衡和易受越獄攻擊的影響，這主要是因為它們依賴於對惡意查詢的直接拒絕。在本文中，我們提出了 STAIR，一個將安全對齊與內省推理相結合的新框架。我們通過自我改進的思想鏈 (CoT) 推理和安全意識，使 LLM 能夠通過逐步分析來識別安全風險。STAIR 首先為模型配備結構化推理能力，然後通過使用我們新提出的安全信息蒙特卡羅樹搜索 (SI-MCTS) 生成的步驟級推理數據，對步驟級推理進行迭代偏好優化，從而推進安全對齊。我們進一步訓練此數據上的過程獎勵模型，以指導測試時間搜索，以改進響應。大量的實驗表明，與本能對齊策略相比，STAIR 有效地減輕了有害輸出，同時更好地保留了有用性。通過測試時間擴展，STAIR 在面對流行的越獄攻擊時，實現了與 Claude-3.5 相當的安全性能。這項工作中的相關資源可在 https://github.com/thu-ml/STAIR 獲得。", "author": "Yichi Zhang et.al.", "authors": "Yichi Zhang, Siyuan Zhang, Yao Huang, Zeyu Xia, Zhengwei Fang, Xiao Yang, Ranjie Duan, Dong Yan, Yinpeng Dong, Jun Zhu", "id": "2502.02384v1", "paper_url": "http://arxiv.org/abs/2502.02384v1", "repo": "null"}}