{"2406.03790": {"publish_time": "2024-06-06", "title": "End-to-End Trainable Soft Retriever for Low-resource Relation Extraction", "paper_summary": "This study addresses a crucial challenge in instance-based relation\nextraction using text generation models: end-to-end training in target relation\nextraction task is not applicable to retrievers due to the non-differentiable\nnature of instance selection. We propose a novel End-to-end TRAinable Soft\nK-nearest neighbor retriever (ETRASK) by the neural prompting method that\nutilizes a soft, differentiable selection of the $k$ nearest instances. This\napproach enables the end-to-end training of retrievers in target tasks. On the\nTACRED benchmark dataset with a low-resource setting where the training data\nwas reduced to 10\\%, our method achieved a state-of-the-art F1 score of 71.5\\%.\nMoreover, ETRASK consistently improved the baseline model by adding instances\nfor all settings. These results highlight the efficacy of our approach in\nenhancing relation extraction performance, especially in resource-constrained\nenvironments. Our findings offer a promising direction for future research with\nextraction and the broader application of text generation in natural language\nprocessing.", "paper_summary_zh": "本研究探討了基於實例的關係抽取中使用文本生成模型時的一個關鍵挑戰：目標關係抽取任務中的端到端訓練由於實例選擇的不可微分性質而不適用於檢索器。我們提出了一種新的端到端可訓練軟 K 最近鄰檢索器 (ETRASK)，採用神經提示方法，利用軟的、可微分的 $k$ 個最近實例選擇。這種方法能夠在目標任務中對檢索器進行端到端訓練。在訓練資料減少到 10% 的低資源設置的 TACRED 基準資料集上，我們的模型達到了 71.5% 的最先進 F1 分數。此外，ETRASK 通過為所有設置添加實例，始終如一地改進了基準模型。這些結果突出了我們的模型在增強關係抽取性能方面的效能，特別是在資源受限的環境中。我們的發現為未來的研究提供了有希望的方向，包括抽取和文本生成在自然語言處理中的更廣泛應用。", "author": "Kohei Makino et.al.", "authors": "Kohei Makino, Makoto Miwa, Yutaka Sasaki", "id": "2406.03790v1", "paper_url": "http://arxiv.org/abs/2406.03790v1", "repo": "null"}}