{"2411.04539": {"publish_time": "2024-11-07", "title": "Best Practices for Distilling Large Language Models into BERT for Web Search Ranking", "paper_summary": "Recent studies have highlighted the significant potential of Large Language\nModels (LLMs) as zero-shot relevance rankers. These methods predominantly\nutilize prompt learning to assess the relevance between queries and documents\nby generating a ranked list of potential documents. Despite their promise, the\nsubstantial costs associated with LLMs pose a significant challenge for their\ndirect implementation in commercial search systems. To overcome this barrier\nand fully exploit the capabilities of LLMs for text ranking, we explore\ntechniques to transfer the ranking expertise of LLMs to a more compact model\nsimilar to BERT, using a ranking loss to enable the deployment of less\nresource-intensive models. Specifically, we enhance the training of LLMs\nthrough Continued Pre-Training, taking the query as input and the clicked title\nand summary as output. We then proceed with supervised fine-tuning of the LLM\nusing a rank loss, assigning the final token as a representative of the entire\nsentence. Given the inherent characteristics of autoregressive language models,\nonly the final token </s> can encapsulate all preceding tokens. Additionally,\nwe introduce a hybrid point-wise and margin MSE loss to transfer the ranking\nknowledge from LLMs to smaller models like BERT. This method creates a viable\nsolution for environments with strict resource constraints. Both offline and\nonline evaluations have confirmed the efficacy of our approach, and our model\nhas been successfully integrated into a commercial web search engine as of\nFebruary 2024.", "paper_summary_zh": "最近的研究強調了大型語言模型 (LLM) 作為零次學習相關性排序器的顯著潛力。這些方法主要利用提示學習，透過產生潛在文件的有序清單，來評估查詢與文件之間的相關性。儘管它們很有前途，但與 LLM 相關的龐大成本對它們在商業搜尋系統中的直接實作構成重大挑戰。為了克服此障礙並充分利用 LLM 的文字排序功能，我們探索了將 LLM 的排序專業知識轉移到更精簡的模型（類似於 BERT）的技術，使用排序損失來實現資源密集度較低的模型的部署。具體來說，我們透過持續預訓練來增強 LLM 的訓練，將查詢作為輸入，並將點擊的標題和摘要作為輸出。然後，我們使用排序損失對 LLM 進行監督式微調，將最終代幣指定為整個句子的代表。由於自迴歸語言模型的固有特性，只有最終代幣 </s> 才能囊括所有前一個代幣。此外，我們引入了混合點式和邊際 MSE 損失，將 LLM 的排序知識轉移到較小的模型（如 BERT）中。此方法為資源限制嚴格的環境創造了可行的解決方案。離線和線上評估都證實了我們方法的有效性，而我們的模型已於 2024 年 2 月成功整合到商業網路搜尋引擎中。", "author": "Dezhi Ye et.al.", "authors": "Dezhi Ye, Junwei Hu, Jiabin Fan, Bowen Tian, Jie Liu, Haijin Liang, Jin Ma", "id": "2411.04539v1", "paper_url": "http://arxiv.org/abs/2411.04539v1", "repo": "null"}}