{"2410.19310": {"publish_time": "2024-10-25", "title": "Flow Generator Matching", "paper_summary": "In the realm of Artificial Intelligence Generated Content (AIGC),\nflow-matching models have emerged as a powerhouse, achieving success due to\ntheir robust theoretical underpinnings and solid ability for large-scale\ngenerative modeling. These models have demonstrated state-of-the-art\nperformance, but their brilliance comes at a cost. The process of sampling from\nthese models is notoriously demanding on computational resources, as it\nnecessitates the use of multi-step numerical ordinary differential equations\n(ODEs). Against this backdrop, this paper presents a novel solution with\ntheoretical guarantees in the form of Flow Generator Matching (FGM), an\ninnovative approach designed to accelerate the sampling of flow-matching models\ninto a one-step generation, while maintaining the original performance. On the\nCIFAR10 unconditional generation benchmark, our one-step FGM model achieves a\nnew record Fr\\'echet Inception Distance (FID) score of 3.08 among few-step\nflow-matching-based models, outperforming original 50-step flow-matching\nmodels. Furthermore, we use the FGM to distill the Stable Diffusion 3, a\nleading text-to-image flow-matching model based on the MM-DiT architecture. The\nresulting MM-DiT-FGM one-step text-to-image model demonstrates outstanding\nindustry-level performance. When evaluated on the GenEval benchmark, MM-DiT-FGM\nhas delivered remarkable generating qualities, rivaling other multi-step models\nin light of the efficiency of a single generation step.", "paper_summary_zh": "在人工智能生成内容 (AIGC) 领域，\n流匹配模型已成为一股强大力量，由于其稳健的理论基础和强大的大规模生成建模能力而取得成功。这些模型已展示出最先进的性能，但其卓越性也付出了代价。从这些模型中进行采样的过程对计算资源要求极高，因为它需要使用多步数值常微分方程 (ODE)。在此背景下，本文提出了一种具有理论保证的新颖解决方案，即流生成器匹配 (FGM)，这是一种旨在将流匹配模型的采样加速到一步生成，同时保持原始性能的创新方法。在 CIFAR10 无条件生成基准上，我们的单步 FGM 模型在基于流匹配的少数步模型中实现了 3.08 的新记录 Fr\\'echet Inception Distance (FID) 分数，优于原始的 50 步流匹配模型。此外，我们使用 FGM 提炼了 Stable Diffusion 3，这是一种基于 MM-DiT 架构的领先文本到图像流匹配模型。由此产生的 MM-DiT-FGM 单步文本到图像模型展示了出色的行业级性能。在 GenEval 基准上进行评估时，MM-DiT-FGM 提供了卓越的生成质量，在单次生成步骤的效率方面与其他多步模型相媲美。", "author": "Zemin Huang et.al.", "authors": "Zemin Huang, Zhengyang Geng, Weijian Luo, Guo-jun Qi", "id": "2410.19310v1", "paper_url": "http://arxiv.org/abs/2410.19310v1", "repo": "null"}}