{"2407.02005": {"publish_time": "2024-07-02", "title": "An End-to-End Speech Summarization Using Large Language Model", "paper_summary": "Abstractive Speech Summarization (SSum) aims to generate human-like text\nsummaries from spoken content. It encounters difficulties in handling long\nspeech input and capturing the intricate cross-modal mapping between long\nspeech inputs and short text summaries. Research on large language models\n(LLMs) and multimodal information fusion has provided new insights for\naddressing these challenges. In this paper, we propose an end-to-end SSum model\nthat utilizes Q-Former as a connector for the audio-text modality and employs\nLLMs to generate text summaries directly from speech features. We adopt a\nmulti-stage training approach that includes LLM based ASR and Text\nSummarization (TSum) tasks as auxiliary tasks. ASR tasks are used to align\nfeature spaces and enhance the LLM's ability to handle longer speech. Then, we\nutilize a curriculum learning strategy to facilitate the model's transition\nfrom TSum to SSum. Finally, our model achieves competitive performance on the\nHow-2 dataset.", "paper_summary_zh": "摘要式語音摘要 (SSum) 的目標是從口說內容產生類似人類的文字摘要。它在處理長語音輸入和擷取長語音輸入與短文字摘要之間複雜的跨模態對應時會遇到困難。關於大型語言模型 (LLM) 和多模態資訊融合的研究為了解決這些挑戰提供了新的見解。在本文中，我們提出了一個端到端的 SSum 模型，它利用 Q-Former 作為音訊文字模態的連接器，並使用 LLM 直接從語音特徵產生文字摘要。我們採用多階段訓練方法，其中包括基於 LLM 的 ASR 和文字摘要 (TSum) 任務作為輔助任務。ASR 任務用於對齊特徵空間並增強 LLM 處理較長語音的能力。然後，我們利用課程學習策略來促進模型從 TSum 過渡到 SSum。最後，我們的模型在 How-2 資料集上取得了有競爭力的表現。", "author": "Hengchao Shang et.al.", "authors": "Hengchao Shang, Zongyao Li, Jiaxin Guo, Shaojun Li, Zhiqiang Rao, Yuanchang Luo, Daimeng Wei, Hao Yang", "id": "2407.02005v1", "paper_url": "http://arxiv.org/abs/2407.02005v1", "repo": "null"}}