{"2406.18922": {"publish_time": "2024-06-27", "title": "Time Matters: Scaling Laws for Any Budget", "paper_summary": "A primary cost driver for training large models is wall-clock training time.\nWe show that popular time estimates based on FLOPs are poor estimates, and\nconstruct a more accurate proxy based on memory copies. We show that with some\nsimple accounting, we can estimate the training speed of a transformer model\nfrom its hyperparameters. Combined with a scaling law curve like Chinchilla,\nthis lets us estimate the final loss of the model. We fit our estimate to real\ndata with a linear regression, and apply the result to rewrite Chinchilla in\nterms of a model's estimated training time as opposed to the amount of training\ndata. This gives an expression for the loss in terms of the model's\nhyperparameters alone. We show that this expression is accurate across a wide\nrange of model hyperparameter values, enabling us to analytically make\narchitectural decisions and train models more efficiently.", "paper_summary_zh": "大型模型訓練的主要成本驅動因素是實際訓練時間。\n我們顯示基於 FLOP 的熱門時間估計值是較差的估計值，\n並根據記憶體複製建構更準確的代理。我們顯示，透過一些\n簡單的計算，我們可以從其超參數估計Transformer模型的訓練速度。結合類似 Chinchilla 的比例定律曲線，\n這讓我們可以估計模型的最終損失。我們使用線性回歸將我們的估計值套用到真實\n資料，並將結果套用在 Chinchilla 中，以模型的預估訓練時間重寫，而不是訓練\n資料量。這給出了僅根據模型超參數的損失表達式。我們顯示此表達式在廣泛\n的模型超參數值範圍內是準確的，使我們能夠分析性地做出\n架構決策並更有效率地訓練模型。", "author": "Itay Inbar et.al.", "authors": "Itay Inbar, Luke Sernau", "id": "2406.18922v1", "paper_url": "http://arxiv.org/abs/2406.18922v1", "repo": "null"}}