{"2412.13061": {"publish_time": "2024-12-17", "title": "VidTok: A Versatile and Open-Source Video Tokenizer", "paper_summary": "Encoding video content into compact latent tokens has become a fundamental\nstep in video generation and understanding, driven by the need to address the\ninherent redundancy in pixel-level representations. Consequently, there is a\ngrowing demand for high-performance, open-source video tokenizers as\nvideo-centric research gains prominence. We introduce VidTok, a versatile video\ntokenizer that delivers state-of-the-art performance in both continuous and\ndiscrete tokenizations. VidTok incorporates several key advancements over\nexisting approaches: 1) model architecture such as convolutional layers and\nup/downsampling modules; 2) to address the training instability and codebook\ncollapse commonly associated with conventional Vector Quantization (VQ), we\nintegrate Finite Scalar Quantization (FSQ) into discrete video tokenization; 3)\nimproved training strategies, including a two-stage training process and the\nuse of reduced frame rates. By integrating these advancements, VidTok achieves\nsubstantial improvements over existing methods, demonstrating superior\nperformance across multiple metrics, including PSNR, SSIM, LPIPS, and FVD,\nunder standardized evaluation settings.", "paper_summary_zh": "將影片內容編碼成緊湊的潛在符號已成為影片生成和理解的基本步驟，其驅動力是為了處理畫素級別表示中固有的冗餘。因此，隨著以影片為中心的研究所獲得顯著地位，對於高性能的開放原始碼影片代幣產生器的需求也與日俱增。我們介紹了 VidTok，這是一個多功能的影片代幣產生器，在連續和離散代幣化中都能提供最先進的效能。VidTok 整合了多項關鍵進展，超越了現有的方法：1) 模型架構，例如卷積層和上/下採樣模組；2) 為了處理與傳統向量量化 (VQ) 通常相關的訓練不穩定性和代碼簿崩潰，我們將有限純量量化 (FSQ) 整合到離散影片代幣化中；3) 改良的訓練策略，包括兩階段訓練流程和使用降低的幀率。透過整合這些進展，VidTok 在現有方法上獲得了顯著的改進，在標準化評估設定下，展示了多項指標的卓越效能，包括 PSNR、SSIM、LPIPS 和 FVD。", "author": "Anni Tang et.al.", "authors": "Anni Tang, Tianyu He, Junliang Guo, Xinle Cheng, Li Song, Jiang Bian", "id": "2412.13061v1", "paper_url": "http://arxiv.org/abs/2412.13061v1", "repo": "https://github.com/microsoft/vidtok"}}