{"2411.08516": {"publish_time": "2024-11-13", "title": "Tree-of-Table: Unleashing the Power of LLMs for Enhanced Large-Scale Table Understanding", "paper_summary": "The ubiquity and value of tables as semi-structured data across various\ndomains necessitate advanced methods for understanding their complexity and\nvast amounts of information. Despite the impressive capabilities of large\nlanguage models (LLMs) in advancing the natural language understanding\nfrontier, their application to large-scale tabular data presents significant\nchallenges, specifically regarding table size and complex intricate\nrelationships. Existing works have shown promise with small-scale tables but\noften flounder when tasked with the complex reasoning required by larger,\ninterconnected tables found in real-world scenarios. To address this gap, we\nintroduce \"Tree-of-Table\", a novel approach designed to enhance LLMs' reasoning\ncapabilities over large and complex tables. Our method employs Table\nCondensation and Decomposition to distill and reorganize relevant data into a\nmanageable format, followed by the construction of a hierarchical Table-Tree\nthat facilitates tree-structured reasoning. Through a meticulous Table-Tree\nExecution process, we systematically unravel the tree-structured reasoning\nchain to derive the solutions. Experiments across diverse datasets, including\nWikiTQ, TableFact, FeTaQA, and BIRD, demonstrate that Tree-of-Table sets a new\nbenchmark with superior performance, showcasing remarkable efficiency and\ngeneralization capabilities in large-scale table reasoning.", "paper_summary_zh": "由於表格在各種領域中作為半結構化資料的普遍性和價值，因此需要進階的方法來了解其複雜性和大量的資訊。儘管大型語言模型 (LLM) 在推進自然語言理解領域方面具有令人印象深刻的能力，但它們在應用於大規模表格資料時會出現重大挑戰，特別是在表格大小和複雜的錯綜關係方面。現有研究已在小規模表格上展現出前景，但當面對現實世界場景中較大型、相互連結的表格所需的複雜推理時，通常會陷入困境。為了解決這個差距，我們引入了「表格樹」，這是一種新穎的方法，旨在增強 LLM 對大型且複雜表格的推理能力。我們的模型採用表格濃縮和分解，將相關資料提煉並重新組織成易於管理的格式，接著建構一個層級式的表格樹，以利進行樹狀結構推理。透過一絲不苟的表格樹執行程序，我們系統性地解開樹狀結構推理鏈，以推導出解決方案。在各種資料集上的實驗，包括 WikiTQ、TableFact、FeTaQA 和 BIRD，證明表格樹樹立了一個新的基準，具有優異的效能，在大型表格推理中展現出卓越的效率和泛化能力。", "author": "Deyi Ji et.al.", "authors": "Deyi Ji, Lanyun Zhu, Siqi Gao, Peng Xu, Hongtao Lu, Jieping Ye, Feng Zhao", "id": "2411.08516v1", "paper_url": "http://arxiv.org/abs/2411.08516v1", "repo": "null"}}