{"2501.12372": {"publish_time": "2025-01-21", "title": "Is Long Context All You Need? Leveraging LLM's Extended Context for NL2SQL", "paper_summary": "Large Language Models (LLMs) have demonstrated impressive capabilities across\na range of natural language processing tasks. In particular, improvements in\nreasoning abilities and the expansion of context windows have opened new\navenues for leveraging these powerful models. NL2SQL is challenging in that the\nnatural language question is inherently ambiguous, while the SQL generation\nrequires a precise understanding of complex data schema and semantics. One\napproach to this semantic ambiguous problem is to provide more and sufficient\ncontextual information.\n  In this work, we explore the performance and the latency trade-offs of the\nextended context window (a.k.a., long context) offered by Google's\nstate-of-the-art LLM (\\textit{gemini-1.5-pro}). We study the impact of various\ncontextual information, including column example values, question and SQL query\npairs, user-provided hints, SQL documentation, and schema. To the best of our\nknowledge, this is the first work to study how the extended context window and\nextra contextual information can help NL2SQL generation with respect to both\naccuracy and latency cost. We show that long context LLMs are robust and do not\nget lost in the extended contextual information. Additionally, our long-context\nNL2SQL pipeline based on Google's \\textit{gemini-pro-1.5} achieve a strong\nperformance with 67.41\\% on BIRD benchmark (dev) without finetuning and\nexpensive self-consistency based techniques.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種自然語言處理任務中展示出令人印象深刻的能力。特別是，推理能力的提升和上下文視窗的擴展為利用這些強大的模型開闢了新途徑。NL2SQL 具有挑戰性，因為自然語言問題本質上是模稜兩可的，而 SQL 生成需要精確理解複雜的數據模式和語義。解決這個語義模糊問題的一種方法是提供更多且充分的上下文資訊。\n在這項工作中，我們探討了 Google 最先進的 LLM (\\textit{gemini-1.5-pro}) 提供的擴展上下文視窗（又稱長上下文）的效能和延遲權衡。我們研究了各種上下文資訊的影響，包括欄位範例值、問題和 SQL 查詢配對、使用者提供的提示、SQL 文件和模式。據我們所知，這是第一個研究擴展上下文視窗和額外上下文資訊如何能在準確性和延遲成本方面協助 NL2SQL 生成的研究。我們展示了長上下文 LLM 是強健的，不會迷失在擴展的上下文資訊中。此外，我們基於 Google 的 \\textit{gemini-pro-1.5} 的長上下文 NL2SQL 管線在 BIRD 基準測試 (dev) 上達到了 67.41% 的強勁效能，而無需微調和昂貴的基於自我一致性的技術。", "author": "Yeounoh Chung et.al.", "authors": "Yeounoh Chung, Gaurav T. Kakkar, Yu Gan, Brenton Milne, Fatma Ozcan", "id": "2501.12372v1", "paper_url": "http://arxiv.org/abs/2501.12372v1", "repo": "null"}}