{"2408.10074": {"publish_time": "2024-08-19", "title": "Synthesis of Reward Machines for Multi-Agent Equilibrium Design (Full Version)", "paper_summary": "Mechanism design is a well-established game-theoretic paradigm for designing\ngames to achieve desired outcomes. This paper addresses a closely related but\ndistinct concept, equilibrium design. Unlike mechanism design, the designer's\nauthority in equilibrium design is more constrained; she can only modify the\nincentive structures in a given game to achieve certain outcomes without the\nability to create the game from scratch. We study the problem of equilibrium\ndesign using dynamic incentive structures, known as reward machines. We use\nweighted concurrent game structures for the game model, with goals (for the\nplayers and the designer) defined as mean-payoff objectives. We show how reward\nmachines can be used to represent dynamic incentives that allocate rewards in a\nmanner that optimises the designer's goal. We also introduce the main decision\nproblem within our framework, the payoff improvement problem. This problem\nessentially asks whether there exists a dynamic incentive (represented by some\nreward machine) that can improve the designer's payoff by more than a given\nthreshold value. We present two variants of the problem: strong and weak. We\ndemonstrate that both can be solved in polynomial time using a Turing machine\nequipped with an NP oracle. Furthermore, we also establish that these variants\nare either NP-hard or coNP-hard. Finally, we show how to synthesise the\ncorresponding reward machine if it exists.", "paper_summary_zh": "機制設計是一種完善的博弈論範例，用於設計遊戲以達成預期的結果。本文探討一個密切相關但不同的概念，均衡設計。與機制設計不同，設計者在均衡設計中的權限受到更多限制；她只能修改既有遊戲中的誘因結構以達成特定結果，而無法從頭開始建立遊戲。我們使用稱為獎勵機器的動態誘因結構來研究均衡設計問題。我們使用加權並行遊戲結構作為遊戲模型，目標（對於玩家和設計者）定義為平均收益目標。我們展示獎勵機器如何用於表示動態誘因，以最佳化設計者目標的方式分配獎勵。我們也在我們的架構中引入主要的決策問題，報酬改善問題。這個問題基本上在詢問是否存在一個動態誘因（由某個獎勵機器表示），可以將設計者的報酬改善超過給定的閾值。我們提出此問題的兩個變體：強式和弱式。我們證明這兩個變體都可以使用配備 NP oracle 的圖靈機在多項式時間內解決。此外，我們也確立這些變體不是 NP-hard 就是 coNP-hard。最後，我們展示如何合成對應的獎勵機器（如果存在）。", "author": "Muhammad Najib et.al.", "authors": "Muhammad Najib, Giuseppe Perelli", "id": "2408.10074v1", "paper_url": "http://arxiv.org/abs/2408.10074v1", "repo": "null"}}