{"2412.11750": {"publish_time": "2024-12-16", "title": "Common Ground, Diverse Roots: The Difficulty of Classifying Common Examples in Spanish Varieties", "paper_summary": "Variations in languages across geographic regions or cultures are crucial to\naddress to avoid biases in NLP systems designed for culturally sensitive tasks,\nsuch as hate speech detection or dialog with conversational agents. In\nlanguages such as Spanish, where varieties can significantly overlap, many\nexamples can be valid across them, which we refer to as common examples.\nIgnoring these examples may cause misclassifications, reducing model accuracy\nand fairness. Therefore, accounting for these common examples is essential to\nimprove the robustness and representativeness of NLP systems trained on such\ndata. In this work, we address this problem in the context of Spanish\nvarieties. We use training dynamics to automatically detect common examples or\nerrors in existing Spanish datasets. We demonstrate the efficacy of using\npredicted label confidence for our Datamaps\n\\cite{swayamdipta-etal-2020-dataset} implementation for the identification of\nhard-to-classify examples, especially common examples, enhancing model\nperformance in variety identification tasks. Additionally, we introduce a Cuban\nSpanish Variety Identification dataset with common examples annotations\ndeveloped to facilitate more accurate detection of Cuban and Caribbean Spanish\nvarieties. To our knowledge, this is the first dataset focused on identifying\nthe Cuban, or any other Caribbean, Spanish variety.", "paper_summary_zh": "語言在不同地理區域或文化中的差異，對於避免在設計用於文化敏感任務（例如仇恨言論偵測或與對話代理的對話）的 NLP 系統中出現偏差至關重要。在西班牙語等語言中，變體可能顯著重疊，許多範例在它們之間可能是有效的，我們稱之為常見範例。忽略這些範例可能會導致錯誤分類，降低模型準確性和公平性。因此，考量這些常見範例對於改善在這些資料上訓練的 NLP 系統的健壯性和代表性至關重要。在這項工作中，我們在西班牙語變體的背景下探討這個問題。我們使用訓練動態來自動偵測西班牙語現有資料集中的常見範例或錯誤。我們展示了使用預測標籤信心對於我們的 Datamaps\\cite{swayamdipta-etal-2020-dataset} 實作來識別難以分類的範例（特別是常見範例）的效能，增強了模型在變體識別任務中的表現。此外，我們引進了一個古巴西班牙語變體識別資料集，其中包含常見範例註解，用於促進更準確地偵測古巴和加勒比西班牙語變體。據我們所知，這是第一個專注於識別古巴或任何其他加勒比西班牙語變體的資料集。", "author": "Javier A. Lopetegui et.al.", "authors": "Javier A. Lopetegui, Arij Riabi, Djamé Seddah", "id": "2412.11750v1", "paper_url": "http://arxiv.org/abs/2412.11750v1", "repo": "null"}}