{"2408.10771": {"publish_time": "2024-08-20", "title": "SSL-TTS: Leveraging Self-Supervised Embeddings and kNN Retrieval for Zero-Shot Multi-speaker TTS", "paper_summary": "While recent zero-shot multispeaker text-to-speech (TTS) models achieve\nimpressive results, they typically rely on extensive transcribed speech\ndatasets from numerous speakers and intricate training pipelines. Meanwhile,\nself-supervised learning (SSL) speech features have emerged as effective\nintermediate representations for TTS. It was also observed that SSL features\nfrom different speakers that are linearly close share phonetic information\nwhile maintaining individual speaker identity, which enables straight-forward\nand robust voice cloning. In this study, we introduce SSL-TTS, a lightweight\nand efficient zero-shot TTS framework trained on transcribed speech from a\nsingle speaker. SSL-TTS leverages SSL features and retrieval methods for simple\nand robust zero-shot multi-speaker synthesis. Objective and subjective\nevaluations show that our approach achieves performance comparable to\nstate-of-the-art models that require significantly larger training datasets.\nThe low training data requirements mean that SSL-TTS is well suited for the\ndevelopment of multi-speaker TTS systems for low-resource domains and\nlanguages. We also introduce an interpolation parameter which enables fine\ncontrol over the output speech by blending voices. Demo samples are available\nat https://idiap.github.io/ssl-tts", "paper_summary_zh": "<paragraph>儘管最近的零鏡頭多說話者文字轉語音 (TTS) 模型獲得令人印象深刻的結果，但它們通常依賴於來自眾多說話者的廣泛轉錄語音資料集和複雜的訓練管道。與此同時，自我監督式學習 (SSL) 語音功能已成為 TTS 的有效中間表示。還觀察到，線性接近的不同說話者的 SSL 特徵在保持個別說話者身分的情況下共享語音資訊，這使得直接且穩健的語音複製成為可能。在本研究中，我們介紹了 SSL-TTS，這是一個輕量級且高效的零鏡頭 TTS 框架，訓練於來自單一說話者的轉錄語音。SSL-TTS 利用 SSL 特徵和檢索方法，進行簡單且穩健的零鏡頭多說話者合成。客觀和主觀評估表明，我們的做法實現了與最先進的模型相當的效能，而這些模型需要顯著更大的訓練資料集。低訓練資料需求意味著 SSL-TTS 非常適合在低資源網域和語言中開發多說話者 TTS 系統。我們還引入了一個插值參數，它能透過混合語音，對輸出語音進行精細控制。示範範例可在 https://idiap.github.io/ssl-tts 取得</paragraph>", "author": "Karl El Hajal et.al.", "authors": "Karl El Hajal, Ajinkya Kulkarni, Enno Hermann, Mathew Magimai. -Doss", "id": "2408.10771v1", "paper_url": "http://arxiv.org/abs/2408.10771v1", "repo": "null"}}