{"2411.06839": {"publish_time": "2024-11-11", "title": "LLM-Neo: Parameter Efficient Knowledge Distillation for Large Language Models", "paper_summary": "In this paper, we propose a novel LLM-Neo framework that efficiently\ntransfers knowledge from a large language model (LLM) teacher to a compact\nstudent. Initially, we revisit the knowledge distillation (KD) and low-rank\nadaption (LoRA), and argue that they share the same paradigm. Inspired by this\nobservation, we explore the strategy that combines LoRA and KD to enhance the\nefficiency of knowledge transfer. We first summarize some guidelines for this\ndesign and further develop the LLM-Neo. Experimental results on compressing\nLlama 2 and Llama 3 show that LLM-Neo outperforms various baselines. Further\nanalysis demonstrates the robustness of the proposed LLM-Neo on variants of\nLoRA. The trained models have been available at\n\\href{https://huggingface.co/collections/yang31210999/llm-neo-66e3c882f5579b829ff57eba}{this\nrepository}.", "paper_summary_zh": "在本文中，我們提出一個新穎的 LLM-Neo 框架，可有效地將知識從大型語言模型 (LLM) 教師傳輸到一個精簡的學生。最初，我們重新探討知識蒸餾 (KD) 和低秩適應 (LoRA)，並論證它們共享相同的範例。受此觀察啟發，我們探討了結合 LoRA 和 KD 以增強知識傳輸效率的策略。我們首先總結了一些關於此設計的指導方針，並進一步開發 LLM-Neo。對 Llama 2 和 Llama 3 進行壓縮的實驗結果表明，LLM-Neo 優於各種基線。進一步的分析證明了所提出的 LLM-Neo 在 LoRA 變體上的穩健性。訓練過的模型已在\n\\href{https://huggingface.co/collections/yang31210999/llm-neo-66e3c882f5579b829ff57eba}{此儲存庫}中提供。", "author": "Runming Yang et.al.", "authors": "Runming Yang, Taiqiang Wu, Jiahao Wang, Pengfei Hu, Ngai Wong, Yujiu Yang", "id": "2411.06839v1", "paper_url": "http://arxiv.org/abs/2411.06839v1", "repo": "null"}}