{"2410.22330": {"publish_time": "2024-10-29", "title": "Task Vectors are Cross-Modal", "paper_summary": "We investigate the internal representations of vision-and-language models\n(VLMs) and how they encode task representations. We consider tasks specified\nthrough examples or instructions, using either text or image inputs.\nSurprisingly, we find that conceptually similar tasks are mapped to similar\ntask vector representations, regardless of how they are specified. Our findings\nsuggest that to output answers, tokens in VLMs undergo three distinct phases:\ninput, task, and answer, a process which is consistent across different\nmodalities and specifications. The task vectors we identify in VLMs are general\nenough to be derived in one modality (e.g., text) and transferred to another\n(e.g., image). Additionally, we find that ensembling exemplar and instruction\nbased task vectors produce better task representations. Taken together, these\ninsights shed light on the underlying mechanisms of VLMs, particularly their\nability to represent tasks in a shared manner across different modalities and\ntask specifications. Project page:\nhttps://task-vectors-are-cross-modal.github.io.", "paper_summary_zh": "我們探討視覺語言模型 (VLM) 的內部表示，以及它們如何編碼任務表示。我們考慮通過範例或說明指定的任務，使用文字或影像輸入。令人驚訝的是，我們發現概念上相似的任務會被映射到相似的任務向量表示，而不管它們是如何指定的。我們的發現表明，為了輸出答案，VLM 中的符號會經歷三個不同的階段：輸入、任務和答案，這個過程在不同的模式和規範中是一致的。我們在 VLM 中識別的任務向量夠通用，可以在一個模式（例如文字）中衍生，並傳輸到另一個模式（例如影像）。此外，我們發現範例和說明的集合任務向量產生更好的任務表示。綜觀而言，這些見解闡明了 VLM 的底層機制，特別是它們以共享方式表示不同模式和任務規範中任務的能力。專案頁面：\nhttps://task-vectors-are-cross-modal.github.io。", "author": "Grace Luo et.al.", "authors": "Grace Luo, Trevor Darrell, Amir Bar", "id": "2410.22330v1", "paper_url": "http://arxiv.org/abs/2410.22330v1", "repo": "null"}}