{"2502.04038": {"publish_time": "2025-02-06", "title": "Simulating the Emergence of Differential Case Marking with Communicating Neural-Network Agents", "paper_summary": "Differential Case Marking (DCM) refers to the phenomenon where grammatical\ncase marking is applied selectively based on semantic, pragmatic, or other\nfactors. The emergence of DCM has been studied in artificial language learning\nexperiments with human participants, which were specifically aimed at\ndisentangling the effects of learning from those of communication (Smith &\nCulbertson, 2020). Multi-agent reinforcement learning frameworks based on\nneural networks have gained significant interest to simulate the emergence of\nhuman-like linguistic phenomena. In this study, we employ such a framework in\nwhich agents first acquire an artificial language before engaging in\ncommunicative interactions, enabling direct comparisons to human result. Using\na very generic communication optimization algorithm and neural-network learners\nthat have no prior experience with language or semantic preferences, our\nresults demonstrate that learning alone does not lead to DCM, but when agents\ncommunicate, differential use of markers arises. This supports Smith and\nCulbertson (2020)'s findings that highlight the critical role of communication\nin shaping DCM and showcases the potential of neural-agent models to complement\nexperimental research on language evolution.", "paper_summary_zh": "差異化格位標記 (DCM) 指語法格位標記基於語義、語用或其他因素有選擇性地應用的現象。DCM 的出現已在針對人類參與者的人工語言學習實驗中獲得研究，這些實驗特別旨在區分學習與溝通的影響（Smith & Culbertson，2020）。基於神經網路的多主體強化學習架構已獲得顯著興趣，用於模擬類似人類的語言現象的出現。在本研究中，我們採用這樣的架構，其中主體在參與溝通互動之前先習得一種人工語言，從而能直接與人類結果進行比較。利用非常通用的溝通最佳化演算法和沒有語言或語義偏好先驗經驗的神經網路學習者，我們的結果證明，學習本身並不會導致 DCM，但當主體進行溝通時，就會出現標記的不同用法。這支持 Smith 和 Culbertson (2020) 的發現，強調了溝通在塑造 DCM 中的關鍵作用，並展示了神經主體模型在補充語言演化實驗研究方面的潛力。", "author": "Yuchen Lian et.al.", "authors": "Yuchen Lian, Arianna Bisazza, Tessa Verhoef", "id": "2502.04038v1", "paper_url": "http://arxiv.org/abs/2502.04038v1", "repo": "null"}}