{"2412.18355": {"publish_time": "2024-12-24", "title": "Addressing Spatial-Temporal Data Heterogeneity in Federated Continual Learning via Tail Anchor", "paper_summary": "Federated continual learning (FCL) allows each client to continually update\nits knowledge from task streams, enhancing the applicability of federated\nlearning in real-world scenarios. However, FCL needs to address not only\nspatial data heterogeneity between clients but also temporal data heterogeneity\nbetween tasks. In this paper, empirical experiments demonstrate that such\ninput-level heterogeneity significantly affects the model's internal parameters\nand outputs, leading to severe spatial-temporal catastrophic forgetting of\nlocal and previous knowledge. To this end, we propose Federated Tail Anchor\n(FedTA) to mix trainable Tail Anchor with the frozen output features to adjust\ntheir position in the feature space, thereby overcoming parameter-forgetting\nand output-forgetting. Moreover, three novel components are also included in\nFedTA: Input Enhancement for improving the performance of pre-trained models on\ndownstream tasks; Selective Input Knowledge Fusion for fusion of heterogeneous\nlocal knowledge on the server side; and Best Global Prototype Selection for\nfinding the best anchor point for each class in the feature space. Extensive\nexperiments demonstrate that FedTA not only outperforms existing FCL methods\nbut also effectively preserves the relative positions of features, remaining\nunaffected by spatial and temporal changes.", "paper_summary_zh": "联邦持续学习 (FCL) 允许每个客户端持续从任务流更新其知识，从而增强联邦学习在真实世界场景中的适用性。然而，FCL 不仅需要解决客户端之间的空间数据异质性，还需要解决任务之间的时序数据异质性。本文中的实证实验表明，这种输入级异质性会显著影响模型的内部参数和输出，导致局部和先前知识的严重时空灾难性遗忘。为此，我们提出了联邦尾锚 (FedTA)，将可训练尾锚与冻结的输出特征混合，以调整它们在特征空间中的位置，从而克服参数遗忘和输出遗忘。此外，FedTA 中还包含三个新颖组件：用于提高预训练模型在下游任务上的性能的输入增强；用于在服务器端融合异构局部知识的选择性输入知识融合；以及用于在特征空间中为每个类别找到最佳锚点的最佳全局原型选择。大量的实验表明，FedTA 不仅优于现有的 FCL 方法，而且有效地保留了特征的相对位置，不受空间和时间变化的影响。", "author": "Hao Yu et.al.", "authors": "Hao Yu, Xin Yang, Le Zhang, Hanlin Gu, Tianrui Li, Lixin Fan, Qiang Yang", "id": "2412.18355v1", "paper_url": "http://arxiv.org/abs/2412.18355v1", "repo": "null"}}