{"2410.22891": {"publish_time": "2024-10-30", "title": "VPO: Leveraging the Number of Votes in Preference Optimization", "paper_summary": "Direct Preference Optimization (DPO) trains a language model using human\npreference data, bypassing the explicit reward modeling phase of Reinforcement\nLearning from Human Feedback (RLHF). By iterating over sentence pairs in a\npreference dataset, DPO enhances generation quality by increasing the\nlikelihood of producing preferred sentences over less favored ones. Preference\ndatasets are typically created by selecting preferred sentences through a\nvoting process involving multiple individuals, as opinions can vary due to the\nsubjective nature of human preferences. While the number of votes offers\ninsight into whether a sentence pair is clearly preferable or controversial,\ncurrent methods do not fully leverage this information. In this paper, we\nintroduce a technique that leverages user voting data to better align with\ndiverse subjective preferences. We employ the Bayesian Minimum Mean Square\nError (Bayesian MMSE) estimator to model the probability that one generation is\npreferable to another. Using this estimated probability as a target, we develop\nthe Vote-based Preference Optimization (VPO) framework, which incorporates the\nnumber of votes on both sides to distinguish between controversial and obvious\ngeneration pairs. We show that previous algorithms, such as DPO and Identity\nPreference Optimization (IPO), can be extended using the proposed framework,\ntermed VDPO and VIPO. Our experiments demonstrate that these proposed\nalgorithms outperform various existing methods, including their base\nalgorithms.", "paper_summary_zh": "直接偏好最佳化（DPO）使用人類偏好資料訓練語言模型，繞過人類回饋強化學習（RLHF）的明確獎勵建模階段。透過在偏好資料集中的句子對中反覆運算，DPO 透過增加產生偏好句子的機率，進而提升產生品質，勝過不那麼受歡迎的句子。偏好資料集通常透過投票程序建立，並由多位個人參與，因為意見可能會因人類偏好的主觀性質而有所不同。儘管投票數提供了見解，說明句子對是否明顯較佳或有爭議，但目前的技術並未充分利用這些資訊。在本文中，我們引進一項技術，利用使用者投票資料，以更好地與不同的主觀偏好保持一致。我們採用貝氏最小均方誤差（貝氏 MMSE）估計器，來建模一個產生結果比另一個產生結果更佳的機率。使用這個估計機率作為目標，我們開發了基於投票的偏好最佳化（VPO）架構，其中納入兩方的投票數，以區分有爭議和顯而易見的產生對。我們展示了先前的演算法，例如 DPO 和身分偏好最佳化（IPO），可以使用所提出的架構進行延伸，稱為 VDPO 和 VIPO。我們的實驗證明，這些提出的演算法優於各種現有方法，包括其基本演算法。", "author": "Jae Hyeon Cho et.al.", "authors": "Jae Hyeon Cho, Minkyung Park, Byung-Jun Lee", "id": "2410.22891v1", "paper_url": "http://arxiv.org/abs/2410.22891v1", "repo": "https://github.com/ku-dmlab/vpo"}}