{"2501.07542": {"publish_time": "2025-01-13", "title": "Imagine while Reasoning in Space: Multimodal Visualization-of-Thought", "paper_summary": "Chain-of-Thought (CoT) prompting has proven highly effective for enhancing\ncomplex reasoning in Large Language Models (LLMs) and Multimodal Large Language\nModels (MLLMs). Yet, it struggles in complex spatial reasoning tasks.\nNonetheless, human cognition extends beyond language alone, enabling the\nremarkable capability to think in both words and images. Inspired by this\nmechanism, we propose a new reasoning paradigm, Multimodal\nVisualization-of-Thought (MVoT). It enables visual thinking in MLLMs by\ngenerating image visualizations of their reasoning traces. To ensure\nhigh-quality visualization, we introduce token discrepancy loss into\nautoregressive MLLMs. This innovation significantly improves both visual\ncoherence and fidelity. We validate this approach through several dynamic\nspatial reasoning tasks. Experimental results reveal that MVoT demonstrates\ncompetitive performance across tasks. Moreover, it exhibits robust and reliable\nimprovements in the most challenging scenarios where CoT fails. Ultimately,\nMVoT establishes new possibilities for complex reasoning tasks where visual\nthinking can effectively complement verbal reasoning.", "paper_summary_zh": "鏈式思考 (CoT) 提示已被證實對於增強大型語言模型 (LLM) 和多模態大型語言模型 (MLLM) 中的複雜推理非常有效。然而，它在複雜的空間推理任務中卻很吃力。儘管如此，人類的認知不僅限於語言，還能以言語和影像思考。受到此機制的啟發，我們提出了一種新的推理範例，即多模態思想視覺化 (MVoT)。它能讓 MLLM 產生推理軌跡的影像視覺化，從而實現視覺思考。為了確保高品質的視覺化，我們將標記差異損失引入自迴歸 MLLM。這項創新顯著提升了視覺一致性和保真度。我們透過多項動態空間推理任務驗證了此方法。實驗結果顯示，MVoT 在各種任務中展現出具有競爭力的效能。此外，在 CoT 失效的最具挑戰性場景中，它展現出強健且可靠的進步。最終，MVoT 為視覺思考能有效補充語言推理的複雜推理任務建立了新的可能性。", "author": "Chengzu Li et.al.", "authors": "Chengzu Li, Wenshan Wu, Huanyu Zhang, Yan Xia, Shaoguang Mao, Li Dong, Ivan Vulić, Furu Wei", "id": "2501.07542v1", "paper_url": "http://arxiv.org/abs/2501.07542v1", "repo": "null"}}