{"2412.10139": {"publish_time": "2024-12-13", "title": "TACOMORE: Leveraging the Potential of LLMs in Corpus-based Discourse Analysis with Prompt Engineering", "paper_summary": "The capacity of LLMs to carry out automated qualitative analysis has been\nquestioned by corpus linguists, and it has been argued that corpus-based\ndiscourse analysis incorporating LLMs is hindered by issues of unsatisfying\nperformance, hallucination, and irreproducibility. Our proposed method,\nTACOMORE, aims to address these concerns by serving as an effective prompting\nframework in this domain. The framework consists of four principles, i.e.,\nTask, Context, Model and Reproducibility, and specifies five fundamental\nelements of a good prompt, i.e., Role Description, Task Definition, Task\nProcedures, Contextual Information and Output Format. We conduct experiments on\nthree LLMs, i.e., GPT-4o, Gemini-1.5-Pro and Gemini-1.5.Flash, and find that\nTACOMORE helps improve LLM performance in three representative discourse\nanalysis tasks, i.e., the analysis of keywords, collocates and concordances,\nbased on an open corpus of COVID-19 research articles. Our findings show the\nefficacy of the proposed prompting framework TACOMORE in corpus-based discourse\nanalysis in terms of Accuracy, Ethicality, Reasoning, and Reproducibility, and\nprovide novel insights into the application and evaluation of LLMs in automated\nqualitative studies.", "paper_summary_zh": "大型語言模型執行自動化定性分析的能力已受到語料庫語言學家的質疑，有人認為，結合大型語言模型的語料庫為基礎的語篇分析受到不令人滿意的表現、幻覺和不可複製性等問題的阻礙。我們提出的方法 TACOMORE 旨在透過作為此領域中有效的提示架構來解決這些問題。此架構包含四項原則，即任務、脈絡、模型和可複製性，並指定良好提示的五個基本元素，即角色描述、任務定義、任務程序、脈絡資訊和輸出格式。我們對三個大型語言模型執行實驗，即 GPT-4o、Gemini-1.5-Pro 和 Gemini-1.5.Flash，發現 TACOMORE 有助於提升大型語言模型在三項代表性語篇分析任務中的表現，即關鍵字、搭配詞和共現分析，這些任務基於 COVID-19 研究文章的開放語料庫。我們的研究結果顯示，提出的提示架構 TACOMORE 在語料庫為基礎的語篇分析中，在準確性、倫理性、推理和可複製性方面具有效能，並提供大型語言模型在自動化定性研究中應用和評估的新見解。", "author": "Bingru Li et.al.", "authors": "Bingru Li, Han Wang", "id": "2412.10139v1", "paper_url": "http://arxiv.org/abs/2412.10139v1", "repo": "null"}}