{"2408.03325": {"publish_time": "2024-08-06", "title": "CoverBench: A Challenging Benchmark for Complex Claim Verification", "paper_summary": "There is a growing line of research on verifying the correctness of language\nmodels' outputs. At the same time, LMs are being used to tackle complex queries\nthat require reasoning. We introduce CoverBench, a challenging benchmark\nfocused on verifying LM outputs in complex reasoning settings. Datasets that\ncan be used for this purpose are often designed for other complex reasoning\ntasks (e.g., QA) targeting specific use-cases (e.g., financial tables),\nrequiring transformations, negative sampling and selection of hard examples to\ncollect such a benchmark. CoverBench provides a diversified evaluation for\ncomplex claim verification in a variety of domains, types of reasoning,\nrelatively long inputs, and a variety of standardizations, such as multiple\nrepresentations for tables where available, and a consistent schema. We\nmanually vet the data for quality to ensure low levels of label noise. Finally,\nwe report a variety of competitive baseline results to show CoverBench is\nchallenging and has very significant headroom. The data is available at\nhttps://huggingface.co/datasets/google/coverbench .", "paper_summary_zh": "對於驗證語言模型輸出的正確性，有越來越多的研究。同時，LM 被用於解決需要推理的複雜查詢。我們介紹 CoverBench，這是一個具有挑戰性的基準，專注於驗證複雜推理設定中的 LM 輸出。可用於此目的的資料集通常是為其他複雜推理任務（例如，QA）而設計的，這些任務針對特定用例（例如，財務表格），需要轉換、負面抽樣和選擇困難範例來收集此類基準。CoverBench 提供了對各種領域、推理類型、相對較長的輸入以及各種標準化的多元評估，例如表格的各種表示（如果可用）和一致的架構。我們手動審查資料的品質，以確保低程度的標籤雜訊。最後，我們報告了各種競爭性的基準結果，以顯示 CoverBench 具有挑戰性且有非常顯著的進步空間。資料可在 https://huggingface.co/datasets/google/coverbench 取得。", "author": "Alon Jacovi et.al.", "authors": "Alon Jacovi, Moran Ambar, Eyal Ben-David, Uri Shaham, Amir Feder, Mor Geva, Dror Marcus, Avi Caciularu", "id": "2408.03325v1", "paper_url": "http://arxiv.org/abs/2408.03325v1", "repo": "null"}}