{"2409.11032": {"publish_time": "2024-09-17", "title": "Hierarchical Narrative Analysis: Unraveling Perceptions of Generative AI", "paper_summary": "Written texts reflect an author's perspective, making the thorough analysis\nof literature a key research method in fields such as the humanities and social\nsciences. However, conventional text mining techniques like sentiment analysis\nand topic modeling are limited in their ability to capture the hierarchical\nnarrative structures that reveal deeper argumentative patterns. To address this\ngap, we propose a method that leverages large language models (LLMs) to extract\nand organize these structures into a hierarchical framework. We validate this\napproach by analyzing public opinions on generative AI collected by Japan's\nAgency for Cultural Affairs, comparing the narratives of supporters and\ncritics. Our analysis provides clearer visualization of the factors influencing\ndivergent opinions on generative AI, offering deeper insights into the\nstructures of agreement and disagreement.", "paper_summary_zh": "書面文本反映作者的觀點，因此徹底分析文學成為人文學科和社會科學等領域的一種關鍵研究方法。然而，傳統的文本探勘技術（例如情緒分析和主題建模）在捕捉揭示更深層論證模式的分層敘事結構方面能力有限。為了解決這個差距，我們提出了一種方法，利用大型語言模型 (LLM) 將這些結構提取並組織成一個分層框架。我們通過分析日本文化廳收集的關於生成式 AI 的公眾意見來驗證這種方法，比較支持者和批評者的敘述。我們的分析提供了更清晰的視覺化，說明了影響對生成式 AI 不同意見的因素，對同意和不同意的結構提供了更深入的見解。", "author": "Riona Matsuoka et.al.", "authors": "Riona Matsuoka, Hiroki Matsumoto, Takahiro Yoshida, Tomohiro Watanabe, Ryoma Kondo, Ryohei Hisano", "id": "2409.11032v1", "paper_url": "http://arxiv.org/abs/2409.11032v1", "repo": "null"}}