{"2405.11640": {"publish_time": "2024-05-19", "title": "Inquire, Interact, and Integrate: A Proactive Agent Collaborative Framework for Zero-Shot Multimodal Medical Reasoning", "paper_summary": "The adoption of large language models (LLMs) in healthcare has attracted\nsignificant research interest. However, their performance in healthcare remains\nunder-investigated and potentially limited, due to i) they lack rich\ndomain-specific knowledge and medical reasoning skills; and ii) most\nstate-of-the-art LLMs are unimodal, text-only models that cannot directly\nprocess multimodal inputs. To this end, we propose a multimodal medical\ncollaborative reasoning framework \\textbf{MultiMedRes}, which incorporates a\nlearner agent to proactively gain essential information from domain-specific\nexpert models, to solve medical multimodal reasoning problems. Our method\nincludes three steps: i) \\textbf{Inquire}: The learner agent first decomposes\ngiven complex medical reasoning problems into multiple domain-specific\nsub-problems; ii) \\textbf{Interact}: The agent then interacts with\ndomain-specific expert models by repeating the ``ask-answer'' process to\nprogressively obtain different domain-specific knowledge; iii)\n\\textbf{Integrate}: The agent finally integrates all the acquired\ndomain-specific knowledge to accurately address the medical reasoning problem.\nWe validate the effectiveness of our method on the task of difference visual\nquestion answering for X-ray images. The experiments demonstrate that our\nzero-shot prediction achieves state-of-the-art performance, and even\noutperforms the fully supervised methods. Besides, our approach can be\nincorporated into various LLMs and multimodal LLMs to significantly boost their\nperformance.", "paper_summary_zh": "大型語言模型（LLM）在醫療保健領域的採用引起了\n顯著的研究興趣。然而，由於 i) 它們缺乏豐富的特定領域知識和醫療推理技能；以及 ii) 大多數\n最先進的 LLM 是單模態、純文字模型，無法直接\n處理多模態輸入，因此它們在醫療保健中的表現仍未得到充分研究，且潛在受限。為此，我們提出了一個多模態醫療\n協作推理框架\\textbf{MultiMedRes}，它包含一個學習代理，可主動從特定領域的\n專家模型中獲取基本資訊，以解決醫療多模態推理問題。我們的\n方法包括三個步驟：i) \\textbf{詢問}：學習代理首先將\n給定的複雜醫療推理問題分解為多個特定領域的\n子問題；ii) \\textbf{互動}：然後，代理透過重複``詢問-回答''程序與\n特定領域的專家模型互動，以逐步獲取不同的特定領域知識；iii)\n\\textbf{整合}：最後，代理整合所有獲得的\n特定領域知識，以準確解決醫療推理問題。\n我們在 X 光影像的差異視覺問題解答任務上驗證了我們方法的有效性。實驗表明，我們的\n零次學習預測達到了最先進的性能，甚至\n優於完全監督的方法。此外，我們的\n方法可以整合到各種 LLM 和多模態 LLM 中，以顯著提升其\n性能。", "author": "Zishan Gu et.al.", "authors": "Zishan Gu, Fenglin Liu, Changchang Yin, Ping Zhang", "id": "2405.11640v1", "paper_url": "http://arxiv.org/abs/2405.11640v1", "repo": "null"}}