{"2412.12859": {"publish_time": "2024-12-17", "title": "Bayesian Persuasion with Externalities: Exploiting Agent Types", "paper_summary": "We study a Bayesian persuasion problem with externalities. In this model, a\nprincipal sends signals to inform multiple agents about the state of the world.\nSimultaneously, due to the existence of externalities in the agents' utilities,\nthe principal also acts as a correlation device to correlate the agents'\nactions. We consider the setting where the agents are categorized into a small\nnumber of types. Agents of the same type share identical utility functions and\nare treated equitably in the utility functions of both other agents and the\nprincipal. We study the problem of computing optimal signaling strategies for\nthe principal, under three different types of signaling channels: public,\nprivate, and semi-private. Our results include revelation-principle-style\ncharacterizations of optimal signaling strategies, linear programming\nformulations, and analysis of in/tractability of the optimization problems. It\nis demonstrated that when the maximum number of deviating agents is bounded by\na constant, our LP-based formulations compute optimal signaling strategies in\npolynomial time. Otherwise, the problems are NP-hard.", "paper_summary_zh": "我們研究一個具有外部性的貝氏說服問題。在這個模型中，一個委託人發送訊號，以告知多個代理人關於世界狀態的資訊。同時，由於代理人效用中存在外部性，委託人也作為一個相關性裝置，以關聯代理人的行動。我們考慮代理人被分類為少數類型的設定。相同類型的代理人共享相同的效用函數，並且在其他代理人和委託人的效用函數中受到公平對待。我們研究在三種類型的信號傳遞管道下，為委託人計算最佳信號傳遞策略的問題：公開、私人和半私人。我們的結果包括最佳信號傳遞策略的啟示原則樣式表徵、線性規劃公式，以及最佳化問題的內部/可追溯性分析。證明當最大偏差代理人數量受常數約束時，我們基於 LP 的公式會在多項式時間內計算最佳信號傳遞策略。否則，這些問題是 NP 難的。", "author": "Jonathan Shaki et.al.", "authors": "Jonathan Shaki, Jiarui Gan, Sarit Kraus", "id": "2412.12859v1", "paper_url": "http://arxiv.org/abs/2412.12859v1", "repo": "null"}}