{"2411.19668": {"publish_time": "2024-11-29", "title": "ChineseWebText 2.0: Large-Scale High-quality Chinese Web Text with Multi-dimensional and fine-grained information", "paper_summary": "During the development of large language models (LLMs), pre-training data\nplay a critical role in shaping LLMs' capabilities. In recent years several\nlarge-scale and high-quality pre-training datasets have been released to\naccelerate the research of LLMs, including ChineseWebText1.0, C4, Pile,\nWanJuan, MAPCC and others. However, as LLMs continue to evolve, focus has\nincreasingly shifted to domain-specific capabilities and safety concerns,\nmaking those previous coarse-grained texts insufficient for meeting training\nrequirements. Furthermore, fine-grained information, such as quality, domain\nand toxicity, is becoming increasingly important in building powerful and\nreliable LLMs for various scenarios. To address these challenges, in this paper\nwe propose a new tool-chain called MDFG-tool for constructing large-scale and\nhigh-quality Chinese datasets with multi-dimensional and fine-grained\ninformation. First, we employ manually crafted rules to discard explicit noisy\ntexts from raw contents. Second, the quality evaluation model, domain\nclassifier, and toxicity evaluation model are well-designed to assess the\nremaining cleaned data respectively. Finally, we integrate these three types of\nfine-grained information for each text. With this approach, we release the\nlargest, high-quality and fine-grained Chinese text ChineseWebText2.0, which\nconsists of 3.8TB and each text is associated with a quality score, domain\nlabels, a toxicity label and a toxicity score, facilitating the LLM researchers\nto select data based on various types of fine-grained information. The data,\ncodes and the tool-chain are available on this website\nhttps://github.com/CASIA-LM/ChineseWebText-2.0", "paper_summary_zh": "<paragraph>在大语言模型（LLM）开发中，预训练数据在塑造 LLM 能力方面起着至关重要的作用。近年来，已经发布了几个大规模且高质量的预训练数据集，以加速 LLM 的研究，包括 ChineseWebText1.0、C4、Pile、WanJuan、MAPCC 等。然而，随着 LLM 的不断发展，重点已逐渐转向特定领域的语言能力和安全性问题，这使得以前那些粒度较粗的文本不足以满足训练要求。此外，精细的信息（如质量、领域和毒性）在为各种场景构建强大且可靠的 LLM 中变得越来越重要。为了应对这些挑战，在本文中，我们提出了一种名为 MDFG-tool 的新工具链，用于构建具有多维和细粒度信息的大规模和高质量的中文数据集。首先，我们采用人工制作的规则从原始内容中丢弃明显的噪声文本。其次，质量评估模型、领域分类器和毒性评估模型经过精心设计，分别评估剩余的已清理数据。最后，我们将这三种类型的细粒度信息集成到每段文本中。通过这种方法，我们发布了最大、高质量和细粒度的中文文本 ChineseWebText2.0，它包含 3.8TB，并且每段文本都与质量分数、领域标签、毒性标签和毒性分数相关联，从而方便 LLM 研究人员根据各种类型的细粒度信息选择数据。数据、代码和工具链可在以下网站上获得 https://github.com/CASIA-LM/ChineseWebText-2.0</paragraph>", "author": "Wanyue Zhang et.al.", "authors": "Wanyue Zhang, Ziyong Li, Wen Yang, Chunlin Leng, Yinan Bai, Qianlong Du, Chengqing Zong, Jiajun Zhang", "id": "2411.19668v1", "paper_url": "http://arxiv.org/abs/2411.19668v1", "repo": "https://github.com/casia-lm/chinesewebtext-2.0"}}