{"2406.06777": {"publish_time": "2024-06-10", "title": "MolX: Enhancing Large Language Models for Molecular Learning with A Multi-Modal Extension", "paper_summary": "Recently, Large Language Models (LLMs) with their strong task-handling\ncapabilities have shown remarkable advancements across a spectrum of fields,\nmoving beyond natural language understanding. However, their proficiency within\nthe chemistry domain remains restricted, especially in solving professional\nmolecule-related tasks. This challenge is attributed to their inherent\nlimitations in comprehending molecules using only common textual\nrepresentations, i.e., SMILES strings. In this study, we seek to enhance the\nability of LLMs to comprehend molecules by designing and equipping them with a\nmulti-modal external module, namely MolX. In particular, instead of directly\nusing a SMILES string to represent a molecule, we utilize specific encoders to\nextract fine-grained features from both SMILES string and 2D molecular graph\nrepresentations for feeding into an LLM. Moreover, a human-defined molecular\nfingerprint is incorporated to leverage its embedded domain knowledge. Then, to\nestablish an alignment between MolX and the LLM's textual input space, the\nwhole model in which the LLM is frozen, is pre-trained with a versatile\nstrategy including a diverse set of tasks. Extensive experimental evaluations\ndemonstrate that our proposed method only introduces a small number of\ntrainable parameters while outperforming baselines on various downstream\nmolecule-related tasks ranging from molecule-to-text translation to\nretrosynthesis, with and without fine-tuning the LLM.", "paper_summary_zh": "最近，具有强大任务处理能力的大型语言模型 (LLM) 已在各个领域展现出显著的进步，超越了自然语言理解。然而，它们在化学领域的熟练度仍然受到限制，尤其是在解决与专业分子相关的任务时。这一挑战归因于它们在仅使用常见文本表示（即 SMILES 字符串）理解分子方面的固有局限性。在本研究中，我们寻求通过设计和为 LLM 配备多模态外部模块 MolX 来增强其理解分子的能力。具体而言，我们利用特定编码器从 SMILES 字符串和 2D 分子图表示中提取细粒度特征，用于输入 LLM，而不是直接使用 SMILES 字符串来表示分子。此外，还纳入了人类定义的分子指纹，以利用其嵌入的领域知识。然后，为了在 MolX 和 LLM 的文本输入空间之间建立对齐，在 LLM 被冻结的整个模型中，使用包括各种任务在内的一种通用策略进行了预训练。广泛的实验评估表明，我们提出的方法仅引入了少量可训练参数，同时在各种下游分子相关任务上优于基线，这些任务包括从分子到文本的翻译到逆合成，无论是否对 LLM 进行微调。", "author": "Khiem Le et.al.", "authors": "Khiem Le, Zhichun Guo, Kaiwen Dong, Xiaobao Huang, Bozhao Nan, Roshni Iyer, Xiangliang Zhang, Olaf Wiest, Wei Wang, Nitesh V. Chawla", "id": "2406.06777v1", "paper_url": "http://arxiv.org/abs/2406.06777v1", "repo": "null"}}