{"2408.12125": {"publish_time": "2024-08-22", "title": "AutoTest: Evolutionary Code Solution Selection with Test Cases", "paper_summary": "With the development of code generation techniques, selecting the correct\ncode solution from multiple candidate solutions has become a crucial task. This\nstudy proposes AutoTest, a novel technique that combines automated test case\ngeneration with code solution execution to optimize the selection process using\nan evolutionary genetic algorithm. Firstly, AutoTest utilizes large pre-trained\nlanguage models such as codegen-16B, code-davinci-002, and incoder-6B to\nprovide code solutions and their corresponding test cases. Then, by executing\nthe code solutions and evaluating their performance on the test cases, a\nconsensus set is formed. Fine-grained ranking is achieved through the\nselection, mutation, and crossover mechanisms based on the evolutionary genetic\nalgorithm, with the adjustment of alpha and beta parameters. Finally, the best\ncode solution is chosen. AutoTest demonstrates significant performance\nimprovements on the HumanEval benchmark test. The HumanEval dataset consists of\n164 programming problems, and AutoTest achieves approximately a 10% improvement\nover the baseline method in terms of pass@1 score.", "paper_summary_zh": "<paragraph>隨著程式碼產生技術的發展，從多個候選方案中選出正確的程式碼解決方案已成為一項至關重要的任務。本研究提出 AutoTest，一種將自動測試案例產生與程式碼解決方案執行相結合的新穎技術，以使用演化遺傳演算法最佳化選擇過程。首先，AutoTest 利用大型預先訓練的語言模型，例如 codegen-16B、code-davinci-002 和 incoder-6B，提供程式碼解決方案及其對應的測試案例。然後，透過執行程式碼解決方案並評估它們在測試案例上的效能，形成共識集合。透過基於演化遺傳演算法的選擇、變異和交叉機制，實現精細分級排名，並調整 alpha 和 beta 參數。最後，選擇最佳程式碼解決方案。AutoTest 在 HumanEval 基準測試中展示了顯著的效能提升。HumanEval 資料集包含 164 個程式設計問題，而 AutoTest 在 pass@1 分數方面比基線方法提升了大約 10%。</paragraph>", "author": "Zhihua Duan et.al.", "authors": "Zhihua Duan, Jialin Wang", "id": "2408.12125v1", "paper_url": "http://arxiv.org/abs/2408.12125v1", "repo": "null"}}