{"2407.02243": {"publish_time": "2024-07-02", "title": "Robust Zero-Shot Text-to-Speech Synthesis with Reverse Inference Optimization", "paper_summary": "In this paper, we propose reverse inference optimization (RIO), a simple and\neffective method designed to enhance the robustness of\nautoregressive-model-based zero-shot text-to-speech (TTS) systems using\nreinforcement learning from human feedback (RLHF). To assess the quality of\nspeech produced by the TTS system without human annotations, RIO introduces a\nnovel concept termed as reverse inference based on the Bayesian principle,\nwhich suggests that a high-quality generated speech should be able to be used\nas a prompt for subsequent generation using the same TTS model. By leveraging\nreverse inference as the standard to select exemplars used in RLHF from the\nspeech samples generated by the TTS system itself, RIO steers the subsequent\noptimization towards a direction of enhancing the TTS robustness. The RIO\nframework, comprising sampling, automatic annotating, and learning, obviates\nthe need for a reward model or pairwise preference data, and significantly\nimproves the stability of zero-shot TTS performance by reducing the\ndiscrepancies between training and inference conditions. Our experimental\nresults verify that RIO can effectively improve both subjective and objective\nmetrics, including mean opinion scores, word error rates, and speaker\nsimilarity. Remarkably, RIO can also diminish the incidence of bad outputs to\nnearly zero percent, rivalling the robustness when using ground-truth speech as\nthe prompt.", "paper_summary_zh": "在本文中，我們提出反向推論最佳化 (RIO)，這是一個簡單且有效的方法，旨在透過人類回饋 (RLHF) 的強化學習，來增強基於自迴歸模型的零次學習文字轉語音 (TTS) 系統的穩健性。為了評估 TTS 系統產生的語音品質，RIO 引入一個稱為反向推論的新概念，它基於貝氏原理，表明一個高品質的生成語音應該可以用作後續使用相同 TTS 模型生成的提示。透過利用反向推論作為標準，從 TTS 系統本身生成的語音樣本中選擇 RLHF 中使用的範例，RIO 將後續最佳化引導至增強 TTS 穩健性的方向。RIO 架構包含取樣、自動註解和學習，消除了對獎勵模型或成對偏好資料的需求，並透過減少訓練和推論條件之間的差異，顯著改善了零次學習 TTS 的穩定性。我們的實驗結果驗證了 RIO 可以有效改善主觀和客觀指標，包括平均意見分數、字元錯誤率和說話者相似性。值得注意的是，RIO 也可以將不良輸出的發生率減少到接近 0%，與使用真實語音作為提示時的穩健性相媲美。", "author": "Yuchen Hu et.al.", "authors": "Yuchen Hu, Chen Chen, Siyin Wang, Eng Siong Chng, Chao Zhang", "id": "2407.02243v1", "paper_url": "http://arxiv.org/abs/2407.02243v1", "repo": "null"}}