{"2411.02355": {"publish_time": "2024-11-04", "title": "\"Give Me BF16 or Give Me Death\"? Accuracy-Performance Trade-Offs in LLM Quantization", "paper_summary": "Despite the popularity of large language model (LLM) quantization for\ninference acceleration, significant uncertainty remains regarding the\naccuracy-performance trade-offs associated with various quantization formats.\nWe present a comprehensive empirical study of quantized accuracy, evaluating\npopular quantization formats (FP8, INT8, INT4) across academic benchmarks and\nreal-world tasks, on the entire Llama-3.1 model family. Additionally, our study\nexamines the difference in text generated by quantized models versus their\nuncompressed counterparts. Beyond benchmarks, we also present a couple of\nquantization improvements which allowed us to obtain state-of-the-art accuracy\nrecovery results. Our investigation, encompassing over 500,000 individual\nevaluations, yields several key findings: (1) FP8 weight and activation\nquantization (W8A8-FP) is lossless across all model scales, (2) INT8 weight and\nactivation quantization (W8A8-INT), when properly tuned, incurs surprisingly\nlow 1-3% accuracy degradation, and (3) INT4 weight-only quantization\n(W4A16-INT) is competitive with 8-bit integer weight and activation\nquantization. To address the question of the \"best\" format for a given\ndeployment environment, we conduct inference performance analysis using the\npopular open-source vLLM framework on various GPU architectures. We find that\nW4A16 offers the best cost-efficiency for synchronous deployments, and for\nasynchronous deployment on mid-tier GPUs. At the same time, W8A8 formats excel\nin asynchronous \"continuous batching\" deployment of mid- and large-size models\non high-end GPUs. Our results provide a set of practical guidelines for\ndeploying quantized LLMs across scales and performance requirements.", "paper_summary_zh": "儘管大型語言模型 (LLM) 量化在推論加速方面的普及，但對於各種量化格式相關的準確性效能權衡仍存在著相當大的不確定性。\n我們針對量化準確性提出了一項全面的實證研究，在整個 Llama-3.1 模型系列中，針對學術基準和真實世界任務評估熱門的量化格式 (FP8、INT8、INT4)。此外，我們的研究探討了量化模型產生的文字與其未壓縮對應文字之間的差異。除了基準之外，我們還提出了一些量化改進，讓我們得以獲得最先進的準確性復原結果。我們的調查涵蓋超過 500,000 個個別評估，產生了幾個關鍵發現：(1) FP8 權重和啟用量化 (W8A8-FP) 在所有模型規模中都是無損的，(2) INT8 權重和啟用量化 (W8A8-INT) 在經過適當調整後，令人驚訝地僅造成 1-3% 的準確度下降，以及 (3) INT4 僅權重量化 (W4A16-INT) 與 8 位元整數權重和啟用量化具有競爭力。為了解決給定部署環境的「最佳」格式問題，我們使用各種 GPU 架構上的熱門開源 vLLM 框架進行推論效能分析。我們發現 W4A16 為同步部署和中階 GPU 上的非同步部署提供了最佳的成本效益。同時，W8A8 格式在中大型模型於高階 GPU 上的非同步「連續批次處理」部署中表現出色。我們的結果提供了一組實用的準則，可用於在各種規模和效能需求中部署量化的 LLM。", "author": "Eldar Kurtic et.al.", "authors": "Eldar Kurtic, Alexandre Marques, Shubhra Pandit, Mark Kurtz, Dan Alistarh", "id": "2411.02355v1", "paper_url": "http://arxiv.org/abs/2411.02355v1", "repo": "null"}}