{"2408.13934": {"publish_time": "2024-08-25", "title": "Learning to Move Like Professional Counter-Strike Players", "paper_summary": "In multiplayer, first-person shooter games like Counter-Strike: Global\nOffensive (CS:GO), coordinated movement is a critical component of high-level\nstrategic play. However, the complexity of team coordination and the variety of\nconditions present in popular game maps make it impractical to author\nhand-crafted movement policies for every scenario. We show that it is possible\nto take a data-driven approach to creating human-like movement controllers for\nCS:GO. We curate a team movement dataset comprising 123 hours of professional\ngame play traces, and use this dataset to train a transformer-based movement\nmodel that generates human-like team movement for all players in a \"Retakes\"\nround of the game. Importantly, the movement prediction model is efficient.\nPerforming inference for all players takes less than 0.5 ms per game step\n(amortized cost) on a single CPU core, making it plausible for use in\ncommercial games today. Human evaluators assess that our model behaves more\nlike humans than both commercially-available bots and procedural movement\ncontrollers scripted by experts (16% to 59% higher by TrueSkill rating of\n\"human-like\"). Using experiments involving in-game bot vs. bot self-play, we\ndemonstrate that our model performs simple forms of teamwork, makes fewer\ncommon movement mistakes, and yields movement distributions, player lifetimes,\nand kill locations similar to those observed in professional CS:GO match play.", "paper_summary_zh": "在多人第一人稱射擊遊戲中，例如《反恐精英：全球攻勢》(CS:GO)，協調移動是高階策略性遊戲中的關鍵組成部分。然而，團隊協調的複雜性和熱門遊戲地圖中出現的各種條件，使得為每個場景撰寫手工製作的移動策略變得不切實際。我們展示了採用資料驅動的方法來為 CS:GO 建立類似人類的移動控制器是可行的。我們策劃了一個團隊移動資料集，其中包含 123 小時的專業遊戲播放軌跡，並使用這個資料集來訓練一個基於Transformer的移動模型，該模型會為遊戲的「Retakes」回合中所有玩家產生類似人類的團隊移動。重要的是，移動預測模型是有效的。在單個 CPU 核心上，對所有玩家執行推理每場遊戲步驟不到 0.5 毫秒（攤銷成本），這使得它有可能用於當今的商業遊戲中。人類評估員評估我們的模型比市售機器人和專家編寫的程序移動控制器更像人類（根據「類似人類」的 TrueSkill 評分高出 16% 至 59%）。透過涉及遊戲內機器人對戰機器人自玩的實驗，我們證明我們的模型執行簡單形式的團隊合作，減少常見的移動錯誤，並產生與職業 CS:GO 比賽中觀察到的相似的移動分佈、玩家生命週期和擊殺位置。", "author": "David Durst et.al.", "authors": "David Durst, Feng Xie, Vishnu Sarukkai, Brennan Shacklett, Iuri Frosio, Chen Tessler, Joohwan Kim, Carly Taylor, Gilbert Bernstein, Sanjiban Choudhury, Pat Hanrahan, Kayvon Fatahalian", "id": "2408.13934v1", "paper_url": "http://arxiv.org/abs/2408.13934v1", "repo": "null"}}