{"2411.06672": {"publish_time": "2024-11-11", "title": "What Should Baby Models Read? Exploring Sample-Efficient Data Composition on Model Performance", "paper_summary": "We explore the impact of pre-training data composition on the performance of\nsmall language models in a sample-efficient setting. Using datasets limited to\n10 million words, we evaluate several dataset sources, including child-directed\nspeech (CHILDES), classic books (Gutenberg), synthetic data (TinyStories), and\na mix of these (Mix) across different model sizes ranging from 18 million to\n705 million parameters. Our experiments show that smaller models (e.g.,\nGPT2-97M, GPT2-705M, Llama-360M) perform better when trained on more complex\nand rich datasets like Gutenberg. Models trained on the CHILDES and TinyStories\ndatasets underperformed across all model sizes. These findings suggest that the\noptimal dataset for sample efficient training depends on the model size, and\nthat neither child-directed speech nor simplified stories are optimal for\nlanguage models of all sizes. We highlight the importance of considering both\ndataset composition and model capacity for effective sample efficient language\nmodel training.", "paper_summary_zh": "我們探討預訓練資料組成對小型語言模型在樣本效率設定下的效能影響。使用限制在 1 千萬個單字的資料集，我們評估了幾個資料集來源，包括兒童導向語言 (CHILDES)、經典書籍 (Gutenberg)、合成資料 (TinyStories) 以及這些資料的混合 (Mix)，涵蓋從 1800 萬到 7.05 億個參數的不同模型大小。我們的實驗顯示，較小的模型 (例如 GPT2-97M、GPT2-705M、Llama-360M) 在針對更複雜且豐富的資料集（例如 Gutenberg）進行訓練時表現較佳。在 CHILDES 和 TinyStories 資料集上訓練的模型在所有模型大小中表現不佳。這些發現表明，樣本效率訓練的最佳資料集取決於模型大小，並且兒童導向語言或簡化故事都不是所有大小語言模型的最佳選擇。我們強調考慮資料集組成和模型容量對於有效的樣本效率語言模型訓練的重要性。", "author": "Hong Meng Yam et.al.", "authors": "Hong Meng Yam, Nathan J Paek", "id": "2411.06672v1", "paper_url": "http://arxiv.org/abs/2411.06672v1", "repo": "null"}}