{"2501.01649": {"publish_time": "2025-01-03", "title": "AVATAR: Adversarial Autoencoders with Autoregressive Refinement for Time Series Generation", "paper_summary": "Data augmentation can significantly enhance the performance of machine\nlearning tasks by addressing data scarcity and improving generalization.\nHowever, generating time series data presents unique challenges. A model must\nnot only learn a probability distribution that reflects the real data\ndistribution but also capture the conditional distribution at each time step to\npreserve the inherent temporal dependencies. To address these challenges, we\nintroduce AVATAR, a framework that combines Adversarial Autoencoders (AAE) with\nAutoregressive Learning to achieve both objectives. Specifically, our technique\nintegrates the autoencoder with a supervisor and introduces a novel supervised\nloss to assist the decoder in learning the temporal dynamics of time series\ndata. Additionally, we propose another innovative loss function, termed\ndistribution loss, to guide the encoder in more efficiently aligning the\naggregated posterior of the autoencoder's latent representation with a prior\nGaussian distribution. Furthermore, our framework employs a joint training\nmechanism to simultaneously train all networks using a combined loss, thereby\nfulfilling the dual objectives of time series generation. We evaluate our\ntechnique across a variety of time series datasets with diverse\ncharacteristics. Our experiments demonstrate significant improvements in both\nthe quality and practical utility of the generated data, as assessed by various\nqualitative and quantitative metrics.", "paper_summary_zh": "資料增強可藉由解決資料稀少和改善概化來顯著提升機器學習任務的效能。\n然而，產生時間序列資料會產生獨特的挑戰。模型不僅必須學習反映真實資料分佈的機率分佈，還必須擷取每個時間步驟的條件式分佈，以保留內在時間依賴性。為了應對這些挑戰，我們引進 AVATAR，一個結合對抗式自動編碼器 (AAE) 和自迴歸學習的架構，以達成這兩個目標。具體來說，我們的技術將自動編碼器與監督器整合，並引入一種新穎的監督損失，以協助解碼器學習時間序列資料的時間動態。此外，我們提出另一種創新的損失函數，稱為分佈損失，以引導編碼器更有效率地將自動編碼器潛在表徵的彙總後驗與先驗高斯分佈對齊。此外，我們的架構採用聯合訓練機制，以使用組合損失同時訓練所有網路，從而達成時間序列產生的雙重目標。我們在各種具有不同特徵的時間序列資料集上評估我們的技術。我們的實驗證明，在各種定性和定量指標的評估下，產生的資料品質和實用性都有顯著的提升。", "author": "MohammadReza EskandariNasab et.al.", "authors": "MohammadReza EskandariNasab, Shah Muhammad Hamdi, Soukaina Filali Boubrahimi", "id": "2501.01649v1", "paper_url": "http://arxiv.org/abs/2501.01649v1", "repo": "null"}}