{"2412.15703": {"publish_time": "2024-12-20", "title": "MacLight: Multi-scene Aggregation Convolutional Learning for Traffic Signal Control", "paper_summary": "Reinforcement learning methods have proposed promising traffic signal control\npolicy that can be trained on large road networks. Current SOTA methods model\nroad networks as topological graph structures, incorporate graph attention into\ndeep Q-learning, and merge local and global embeddings to improve policy.\nHowever, graph-based methods are difficult to parallelize, resulting in huge\ntime overhead. Moreover, none of the current peer studies have deployed dynamic\ntraffic systems for experiments, which is far from the actual situation.\n  In this context, we propose Multi-Scene Aggregation Convolutional Learning\nfor traffic signal control (MacLight), which offers faster training speeds and\nmore stable performance. Our approach consists of two main components. The\nfirst is the global representation, where we utilize variational autoencoders\nto compactly compress and extract the global representation. The second\ncomponent employs the proximal policy optimization algorithm as the backbone,\nallowing value evaluation to consider both local features and global embedding\nrepresentations. This backbone model significantly reduces time overhead and\nensures stability in policy updates. We validated our method across multiple\ntraffic scenarios under both static and dynamic traffic systems. Experimental\nresults demonstrate that, compared to general and domian SOTA methods, our\napproach achieves superior stability, optimized convergence levels and the\nhighest time efficiency. The code is under\nhttps://github.com/Aegis1863/MacLight.", "paper_summary_zh": "強化學習方法已提出有望的交通號誌控制策略，可以在大型道路網路中進行訓練。當前 SOTA 方法將道路網路建模為拓撲圖結構，將圖注意力納入深度 Q 學習，並合併局部和全局嵌入以改善策略。然而，基於圖形的方法難以並行化，導致巨大的時間開銷。此外，目前沒有任何同行研究為實驗部署動態交通系統，這遠離實際情況。\n在此背景下，我們提出用於交通號誌控制的多場景聚合卷積學習 (MacLight)，它提供了更快的訓練速度和更穩定的效能。我們的做法包含兩個主要組成部分。第一個是全局表示，我們在其中利用變分自動編碼器來壓縮和提取全局表示。第二個組件採用近端策略優化演算法作為主幹，允許價值評估同時考慮局部特徵和全局嵌入表示。此主幹模型顯著減少時間開銷，並確保策略更新的穩定性。我們在靜態和動態交通系統下跨多個交通場景驗證了我們的方法。實驗結果表明，與一般和領域 SOTA 方法相比，我們的做法實現了卓越的穩定性、最佳的收斂水準和最高的時間效率。程式碼在 https://github.com/Aegis1863/MacLight。", "author": "Sunbowen Lee et.al.", "authors": "Sunbowen Lee, Hongqin Lyu, Yicheng Gong, Yingying Sun, Chao Deng", "id": "2412.15703v1", "paper_url": "http://arxiv.org/abs/2412.15703v1", "repo": "https://github.com/Aegis1863/MacLight"}}