{"2410.07173": {"publish_time": "2024-10-09", "title": "Do better language models have crisper vision?", "paper_summary": "How well do text-only Large Language Models (LLMs) grasp the visual world? As\nLLMs are increasingly used in computer vision, addressing this question becomes\nboth fundamental and pertinent. However, existing studies have primarily\nfocused on limited scenarios, such as their ability to generate visual content\nor cluster multimodal data. To this end, we propose the Visual Text\nRepresentation Benchmark (ViTeRB) to isolate key properties that make language\nmodels well-aligned with the visual world. With this, we identify large-scale\ndecoder-based LLMs as ideal candidates for representing text in vision-centric\ncontexts, counter to the current practice of utilizing text encoders. Building\non these findings, we propose ShareLock, an ultra-lightweight CLIP-like model.\nBy leveraging precomputable frozen features from strong vision and language\nmodels, ShareLock achieves an impressive 51% accuracy on ImageNet despite\nutilizing just 563k image-caption pairs. Moreover, training requires only 1 GPU\nhour (or 10 hours including the precomputation of features) - orders of\nmagnitude less than prior methods. Code will be released.", "paper_summary_zh": "純文字大型語言模型 (LLM) 對視覺世界的掌握程度如何？由於 LLM 在電腦視覺領域的應用日益廣泛，探討這個問題既基本又切合時宜。然而，現有研究主要集中在有限的場景中，例如它們生成視覺內容或聚類多模態數據的能力。為此，我們提出了視覺文本表示基準 (ViTeRB)，以分離出讓語言模型與視覺世界緊密貼合的主要特性。藉此，我們將大型基於解碼器的 LLM 確定為在以視覺為中心的上下文中表示文本的理想候選者，這與當前使用文本編碼器的做法相反。根據這些發現，我們提出了 ShareLock，一個超輕量級的 CLIP 類似模型。通過利用來自強大視覺和語言模型的預先可計算凍結特徵，ShareLock 在 ImageNet 上達到了令人印象深刻的 51% 準確率，儘管僅使用了 563k 圖像標題對。此外，訓練僅需要 1 個 GPU 小時（或包括特徵預計算在內的 10 小時）——比以前的方法少幾個數量級。程式碼將會發布。", "author": "Jona Ruthardt et.al.", "authors": "Jona Ruthardt, Gertjan J. Burghouts, Serge Belongie, Yuki M. Asano", "id": "2410.07173v1", "paper_url": "http://arxiv.org/abs/2410.07173v1", "repo": "null"}}