{"2408.08869": {"publish_time": "2024-08-16", "title": "PEDAL: Enhancing Greedy Decoding with Large Language Models using Diverse Exemplars", "paper_summary": "Self-ensembling techniques with diverse reasoning paths such as\nSelf-Consistency have demonstrated remarkable gains in accuracy for Large\nLanguage Models (LLMs). However, such techniques depend on the availability of\nan accurate answer extraction process to aggregate across multiple outputs.\nMoreover, they acquire higher inference cost, in comparison to Greedy Decoding,\ndue to generation of relatively higher number of output tokens. Research has\nshown that the free form text outputs from Self-Consistency can be aggregated\nreliably using LLMs to produce the final output. Additionally, recent\nadvancements in LLM inference have demonstrated that usage of diverse exemplars\nin prompts have the ability to induce diversity in the LLM outputs. Such proven\ntechniques can be easily extended to self-ensembling based approaches to\nachieve enhanced results in text generation. In this paper, we introduce PEDAL\n(Prompts based on Exemplar Diversity Aggregated using LLMs), a hybrid\nself-ensembling approach, that combines the strengths of diverse exemplar based\nprompts and LLM based aggregation to achieve improvement in overall\nperformance. On the publicly available SVAMP and ARC datasets, our experiments\nreveal that PEDAL can achieve better accuracy than Greedy Decoding based\nstrategies with lower inference cost compared to Self Consistency based\napproaches.", "paper_summary_zh": "利用不同推理路徑（例如自一致性）的自組裝技術已證明大型語言模型 (LLM) 的準確性有顯著的提升。然而，此類技術依賴於準確的答案萃取程序，才能彙總多個輸出。此外，與貪婪解碼相比，它們會產生較高數量的輸出標記，因此會產生較高的推論成本。研究顯示，可以使用 LLM 可靠地彙總來自自一致性的自由形式文字輸出，以產生最終輸出。此外，LLM 推論的最新進展已證明，在提示中使用不同的範例能夠誘導 LLM 輸出的多樣性。此類已驗證的技術可以輕鬆地擴展到基於自組裝的方法，以在文本生成中獲得增強的結果。在本文中，我們介紹了 PEDAL（基於範例多樣性，並使用 LLM 彙總的提示），這是一種混合式自組裝方法，它結合了基於不同範例的提示和基於 LLM 的彙總的優點，以提高整體效能。在公開提供的 SVAMP 和 ARC 資料集上，我們的實驗表明，與基於自一致性的方法相比，PEDAL 可以比基於貪婪解碼的策略獲得更好的準確性，同時具有較低的推論成本。", "author": "Sumanth Prabhu et.al.", "authors": "Sumanth Prabhu", "id": "2408.08869v1", "paper_url": "http://arxiv.org/abs/2408.08869v1", "repo": "null"}}