{"2405.10739": {"publish_time": "2024-05-17", "title": "Efficient Multimodal Large Language Models: A Survey", "paper_summary": "In the past year, Multimodal Large Language Models (MLLMs) have demonstrated\nremarkable performance in tasks such as visual question answering, visual\nunderstanding and reasoning. However, the extensive model size and high\ntraining and inference costs have hindered the widespread application of MLLMs\nin academia and industry. Thus, studying efficient and lightweight MLLMs has\nenormous potential, especially in edge computing scenarios. In this survey, we\nprovide a comprehensive and systematic review of the current state of efficient\nMLLMs. Specifically, we summarize the timeline of representative efficient\nMLLMs, research state of efficient structures and strategies, and the\napplications. Finally, we discuss the limitations of current efficient MLLM\nresearch and promising future directions. Please refer to our GitHub repository\nfor more details:\nhttps://github.com/lijiannuist/Efficient-Multimodal-LLMs-Survey.", "paper_summary_zh": "在過去一年中，多模態大型語言模型 (MLLM) 在視覺問題解答、視覺理解和推理等任務中展現了卓越的表現。然而，龐大的模型規模和高昂的訓練和推論成本阻礙了 MLLM 在學術界和產業中的廣泛應用。因此，研究高效且輕量的 MLLM 具有巨大的潛力，特別是在邊緣運算場景中。在這項調查中，我們全面且系統地回顧了當前高效 MLLM 的現狀。具體而言，我們總結了代表性高效 MLLM 的時間表、高效結構和策略的研究現狀，以及應用。最後，我們討論了當前高效 MLLM 研究的局限性以及未來有前景的方向。有關更多詳細資訊，請參閱我們的 GitHub 儲存庫：\nhttps://github.com/lijiannuist/Efficient-Multimodal-LLMs-Survey。", "author": "Yizhang Jin et.al.", "authors": "Yizhang Jin, Jian Li, Yexin Liu, Tianjun Gu, Kai Wu, Zhengkai Jiang, Muyang He, Bo Zhao, Xin Tan, Zhenye Gan, Yabiao Wang, Chengjie Wang, Lizhuang Ma", "id": "2405.10739v1", "paper_url": "http://arxiv.org/abs/2405.10739v1", "repo": "https://github.com/lijiannuist/efficient-multimodal-llms-survey"}}