{"2502.05252": {"publish_time": "2025-02-07", "title": "GSM-Infinite: How Do Your LLMs Behave over Infinitely Increasing Context Length and Reasoning Complexity?", "paper_summary": "Long-context large language models (LLMs) have recently shown strong\nperformance in information retrieval and long-document QA. However, to tackle\nthe most challenging intellectual problems, LLMs must reason effectively in\nlong and complex contexts (e.g., frontier mathematical research). Studying how\nLLMs handle increasing reasoning complexity and context length is essential,\nyet existing benchmarks lack a solid basis for quantitative evaluation.\nInspired by the abstraction of GSM-8K problems as computational graphs, and the\nability to introduce noise by adding unnecessary nodes and edges, we develop a\ngrade school math problem generator capable of producing arithmetic problems\nwith infinite difficulty and context length under fine-grained control. Using\nour newly synthesized GSM-Infinite benchmark, we comprehensively evaluate\nexisting LLMs. We find a consistent sigmoid decline in reasoning performance as\ncomplexity increases, along with a systematic inference scaling trend:\nexponentially increasing inference computation yields only linear performance\ngains. These findings underscore the fundamental limitations of current\nlong-context LLMs and the key challenges in scaling reasoning capabilities. Our\nGSM-Infinite benchmark provides a scalable and controllable testbed for\nsystematically studying and advancing LLM reasoning in long and complex\ncontexts.", "paper_summary_zh": "長文本大型語言模型 (LLM) 最近在資訊檢索和長文件問答中展示了強大的效能。然而，若要解決最具挑戰性的智力問題，LLM 必須在長且複雜的脈絡中有效推理（例如，前沿數學研究）。研究 LLM 如何處理增加的推理複雜性和脈絡長度至關重要，但現有的基準缺乏定量評估的穩固基礎。受到 GSM-8K 問題抽象化為計算圖形的啟發，以及透過加入不必要的節點和邊緣來引入雜訊的能力，我們開發了一個小學數學問題產生器，能夠在細緻的控制下產生具有無限難度和脈絡長度的算術問題。使用我們新合成的 GSM-Infinite 基準，我們全面評估現有的 LLM。我們發現推理效能會隨著複雜性的增加而持續呈 S 形下降，並伴隨著系統性的推論縮放趨勢：指數增加的推論計算僅產生線性的效能增益。這些發現強調了當前長脈絡 LLM 的基本限制，以及擴展推理能力的主要挑戰。我們的 GSM-Infinite 基準提供了一個可擴充且可控的測試平台，用於系統性地研究和提升 LLM 在長且複雜脈絡中的推理能力。", "author": "Yang Zhou et.al.", "authors": "Yang Zhou, Hongyi Liu, Zhuoming Chen, Yuandong Tian, Beidi Chen", "id": "2502.05252v1", "paper_url": "http://arxiv.org/abs/2502.05252v1", "repo": "null"}}