{"2501.17270": {"publish_time": "2025-01-28", "title": "Comprehensive Evaluation for a Large Scale Knowledge Graph Question Answering Service", "paper_summary": "Question answering systems for knowledge graph (KGQA), answer factoid\nquestions based on the data in the knowledge graph. KGQA systems are complex\nbecause the system has to understand the relations and entities in the\nknowledge-seeking natural language queries and map them to structured queries\nagainst the KG to answer them. In this paper, we introduce Chronos, a\ncomprehensive evaluation framework for KGQA at industry scale. It is designed\nto evaluate such a multi-component system comprehensively, focusing on (1)\nend-to-end and component-level metrics, (2) scalable to diverse datasets and\n(3) a scalable approach to measure the performance of the system prior to\nrelease. In this paper, we discuss the unique challenges associated with\nevaluating KGQA systems at industry scale, review the design of Chronos, and\nhow it addresses these challenges. We will demonstrate how it provides a base\nfor data-driven decisions and discuss the challenges of using it to measure and\nimprove a real-world KGQA system.", "paper_summary_zh": "知識圖譜問答系統 (KGQA) 根據知識圖譜中的資料回答事實問題。KGQA 系統很複雜，因為系統必須理解知識尋求自然語言查詢中的關係和實體，並將它們對映到針對知識圖譜的結構化查詢，才能回答這些查詢。在本文中，我們介紹了 Chronos，這是一個用於產業規模 KGQA 的全面評估框架。它旨在全面評估這種多組件系統，重點關注：(1) 端對端和組件層級指標，(2) 可擴充至各種資料集，以及 (3) 可擴充的方法，用於在釋出前衡量系統的效能。在本文中，我們討論了與產業規模 KGQA 系統評估相關的獨特挑戰，檢視 Chronos 的設計，以及它如何應對這些挑戰。我們將展示它如何提供資料驅動決策的基礎，並討論使用它來衡量和改善真實世界 KGQA 系統的挑戰。", "author": "Saloni Potdar et.al.", "authors": "Saloni Potdar, Daniel Lee, Omar Attia, Varun Embar, De Meng, Ramesh Balaji, Chloe Seivwright, Eric Choi, Mina H. Farid, Yiwen Sun, Yunyao Li", "id": "2501.17270v1", "paper_url": "http://arxiv.org/abs/2501.17270v1", "repo": "null"}}