{"2411.02631": {"publish_time": "2024-11-04", "title": "Extracting Unlearned Information from LLMs with Activation Steering", "paper_summary": "An unintended consequence of the vast pretraining of Large Language Models\n(LLMs) is the verbatim memorization of fragments of their training data, which\nmay contain sensitive or copyrighted information. In recent years, unlearning\nhas emerged as a solution to effectively remove sensitive knowledge from models\nafter training. Yet, recent work has shown that supposedly deleted information\ncan still be extracted by malicious actors through various attacks. Still,\ncurrent attacks retrieve sets of possible candidate generations and are unable\nto pinpoint the output that contains the actual target information. We propose\nactivation steering as a method for exact information retrieval from unlearned\nLLMs. We introduce a novel approach to generating steering vectors, named\nAnonymized Activation Steering. Additionally, we develop a simple word\nfrequency method to pinpoint the correct answer among a set of candidates when\nretrieving unlearned information. Our evaluation across multiple unlearning\ntechniques and datasets demonstrates that activation steering successfully\nrecovers general knowledge (e.g., widely known fictional characters) while\nrevealing limitations in retrieving specific information (e.g., details about\nnon-public individuals). Overall, our results demonstrate that exact\ninformation retrieval from unlearned models is possible, highlighting a severe\nvulnerability of current unlearning techniques.", "paper_summary_zh": "大型語言模型 (LLM) 大規模預訓練的意外後果是逐字記憶訓練資料的片段，其中可能包含敏感或受版權保護的資訊。近年來，遺忘已成為在訓練後有效從模型中移除敏感知識的解決方案。然而，最近的研究表明，惡意行為者仍可透過各種攻擊提取據稱已刪除的資訊。儘管如此，目前的攻擊會擷取可能的候選產生集合，而且無法精確指出包含實際目標資訊的輸出。我們提出啟動導引作為從未學習的 LLM 中精確擷取資訊的方法。我們引入一種產生導引向量的創新方法，稱為匿名化啟動導引。此外，我們開發一種簡單的詞頻方法，以便在擷取未學習的資訊時從候選集合中精確指出正確答案。我們在多種遺忘技術和資料集上的評估顯示，啟動導引成功恢復一般知識（例如，廣為人知的虛構角色），同時揭示在擷取特定資訊（例如，非公眾人物的詳細資訊）方面的限制。總體而言，我們的結果表明從未學習的模型中精確擷取資訊是可行的，突顯了當前遺忘技術的嚴重漏洞。", "author": "Atakan Seyitoğlu et.al.", "authors": "Atakan Seyitoğlu, Aleksei Kuvshinov, Leo Schwinn, Stephan Günnemann", "id": "2411.02631v1", "paper_url": "http://arxiv.org/abs/2411.02631v1", "repo": "null"}}