{"2405.10808": {"publish_time": "2024-05-17", "title": "ActiveLLM: Large Language Model-based Active Learning for Textual Few-Shot Scenarios", "paper_summary": "Active learning is designed to minimize annotation efforts by prioritizing\ninstances that most enhance learning. However, many active learning strategies\nstruggle with a 'cold start' problem, needing substantial initial data to be\neffective. This limitation often reduces their utility for pre-trained models,\nwhich already perform well in few-shot scenarios. To address this, we introduce\nActiveLLM, a novel active learning approach that leverages large language\nmodels such as GPT-4, Llama 3, and Mistral Large for selecting instances. We\ndemonstrate that ActiveLLM significantly enhances the classification\nperformance of BERT classifiers in few-shot scenarios, outperforming both\ntraditional active learning methods and the few-shot learning method SetFit.\nAdditionally, ActiveLLM can be extended to non-few-shot scenarios, allowing for\niterative selections. In this way, ActiveLLM can even help other active\nlearning strategies to overcome their cold start problem. Our results suggest\nthat ActiveLLM offers a promising solution for improving model performance\nacross various learning setups.", "paper_summary_zh": "主动学习旨在通过优先考虑最能促进学习的实例来最大程度地减少标注工作。然而，许多主动学习策略都面临着“冷启动”问题，需要大量初始数据才能有效。此限制通常会降低其对预训练模型的效用，而预训练模型在小样本场景中已经表现良好。为了解决这个问题，我们引入了 ActiveLLM，这是一种新颖的主动学习方法，它利用大型语言模型（例如 GPT-4、Llama 3 和 Mistral Large）来选择实例。我们证明 ActiveLLM 在小样本场景中显著增强了 BERT 分类器的分类性能，优于传统主动学习方法和少量样本学习方法 SetFit。此外，ActiveLLM 可以扩展到非小样本场景，允许进行迭代选择。通过这种方式，ActiveLLM 甚至可以帮助其他主动学习策略克服其冷启动问题。我们的结果表明，ActiveLLM 为改善各种学习设置中的模型性能提供了一种有希望的解决方案。", "author": "Markus Bayer et.al.", "authors": "Markus Bayer, Christian Reuter", "id": "2405.10808v1", "paper_url": "http://arxiv.org/abs/2405.10808v1", "repo": "null"}}