{"2412.15256": {"publish_time": "2024-12-16", "title": "Structured Extraction of Real World Medical Knowledge using LLMs for Summarization and Search", "paper_summary": "Creation and curation of knowledge graphs can accelerate disease discovery\nand analysis in real-world data. While disease ontologies aid in biological\ndata annotation, codified categories (SNOMED-CT, ICD10, CPT) may not capture\npatient condition nuances or rare diseases. Multiple disease definitions across\ndata sources complicate ontology mapping and disease clustering. We propose\ncreating patient knowledge graphs using large language model extraction\ntechniques, allowing data extraction via natural language rather than rigid\nontological hierarchies. Our method maps to existing ontologies (MeSH,\nSNOMED-CT, RxNORM, HPO) to ground extracted entities.\n  Using a large ambulatory care EHR database with 33.6M patients, we\ndemonstrate our method through the patient search for Dravet syndrome, which\nreceived ICD10 recognition in October 2020. We describe our construction of\npatient-specific knowledge graphs and symptom-based patient searches. Using\nconfirmed Dravet syndrome ICD10 codes as ground truth, we employ LLM-based\nentity extraction to characterize patients in grounded ontologies. We then\napply this method to identify Beta-propeller protein-associated\nneurodegeneration (BPAN) patients, demonstrating real-world discovery where no\nground truth exists.", "paper_summary_zh": "知識圖譜的建立和策展可以加速疾病發現和分析真實世界中的資料。雖然疾病本體論有助於生物資料註釋，但編碼類別（SNOMED-CT、ICD10、CPT）可能無法捕捉患者狀況的細微差別或罕見疾病。跨資料來源的多重疾病定義使本體論對應和疾病群集複雜化。我們建議使用大型語言模型萃取技術建立患者知識圖譜，允許透過自然語言而不是僵化的本體論階層萃取資料。我們的模型對應到現有本體論（MeSH、SNOMED-CT、RxNORM、HPO）以建立萃取實體的基礎。使用一個擁有 3360 萬名患者的大型門診電子病歷資料庫，我們透過患者搜尋 Dravet 症候群來展示我們的模型，該症候群於 2020 年 10 月獲得 ICD10 認可。我們描述我們如何建構患者特定的知識圖譜和基於症狀的患者搜尋。使用已確認的 Dravet 症候群 ICD10 代碼作為基準，我們使用基於 LLM 的實體萃取來描述紮根於本體論中的患者。然後我們應用此模型來識別貝塔螺旋槳蛋白相關的神經退化（BPAN）患者，展示了在不存在基準的情況下進行真實世界發現。", "author": "Edward Kim et.al.", "authors": "Edward Kim, Manil Shrestha, Richard Foty, Tom DeLay, Vicki Seyfert-Margolis", "id": "2412.15256v1", "paper_url": "http://arxiv.org/abs/2412.15256v1", "repo": "null"}}