{"2411.17645": {"publish_time": "2024-11-26", "title": "Explainable AI for Classifying UTI Risk Groups Using a Real-World Linked EHR and Pathology Lab Dataset", "paper_summary": "The use of machine learning and AI on electronic health records (EHRs) holds\nsubstantial potential for clinical insight. However, this approach faces\nsignificant challenges due to data heterogeneity, sparsity, temporal\nmisalignment, and limited labeled outcomes. In this context, we leverage a\nlinked EHR dataset of approximately one million de-identified individuals from\nBristol, North Somerset, and South Gloucestershire, UK, to characterize urinary\ntract infections (UTIs) and develop predictive models focused on data quality,\nfairness and transparency. A comprehensive data pre-processing and curation\npipeline transforms the raw EHR data into a structured format suitable for AI\nmodeling. Given the limited availability and biases of ground truth UTI\noutcomes, we introduce a UTI risk estimation framework informed by clinical\nexpertise to estimate UTI risk across individual patient timelines. Using this\nframework, we built pairwise XGBoost models to differentiate UTI risk\ncategories with explainable AI techniques to identify key predictors while\nensuring interpretability. Our findings reveal differences in clinical and\ndemographic factors across risk groups, offering insights into UTI risk\nstratification and progression. This study demonstrates the added value of\nAI-driven insights into UTI clinical decision-making while prioritizing\ninterpretability, transparency, and fairness, underscoring the importance of\nsound data practices in advancing health outcomes.", "paper_summary_zh": "機器學習和人工智慧在電子健康紀錄 (EHR) 上的應用具有\n臨床見解的巨大潛力。然而，這種方法由於資料異質性、稀疏性、時間錯位和標記結果有限，因此面臨重大挑戰。在此背景下，我們利用來自英國布里斯托、北薩默塞特郡和南格洛斯特郡的大約一百萬名去識別化個人的連結式 EHR 資料集，以描述泌尿道感染 (UTI) 並開發專注於資料品質、公平性和透明度的預測模型。全面的資料前處理和整理管道將原始 EHR 資料轉換為適合 AI 建模的結構化格式。鑑於實際 UTI 結果的可用性有限和偏見，我們引入了一個由臨床專業知識提供資訊的 UTI 風險評估架構，以估計個人患者時間線上的 UTI 風險。使用此架構，我們建立了成對的 XGBoost 模型，以區分 UTI 風險類別，並使用可解釋的 AI 技術來識別關鍵預測因子，同時確保可解釋性。我們的研究結果揭示了不同風險群組的臨床和人口統計因素的差異，提供了對 UTI 風險分層和進展的見解。本研究展示了 AI 驅動的見解在 UTI 臨床決策中的附加價值，同時優先考慮可解釋性、透明度和公平性，強調了健全資料實務在促進健康結果中的重要性。", "author": "Yujie Dai et.al.", "authors": "Yujie Dai, Brian Sullivan, Axel Montout, Amy Dillon, Chris Waller, Peter Acs, Rachel Denholm, Philip Williams, Alastair D Hay, Raul Santos-Rodriguez, Andrew Dowsey", "id": "2411.17645v1", "paper_url": "http://arxiv.org/abs/2411.17645v1", "repo": "null"}}