{"2412.16050": {"publish_time": "2024-12-20", "title": "Label-Efficient Data Augmentation with Video Diffusion Models for Guidewire Segmentation in Cardiac Fluoroscopy", "paper_summary": "The accurate segmentation of guidewires in interventional cardiac fluoroscopy\nvideos is crucial for computer-aided navigation tasks. Although deep learning\nmethods have demonstrated high accuracy and robustness in wire segmentation,\nthey require substantial annotated datasets for generalizability, underscoring\nthe need for extensive labeled data to enhance model performance. To address\nthis challenge, we propose the Segmentation-guided Frame-consistency Video\nDiffusion Model (SF-VD) to generate large collections of labeled fluoroscopy\nvideos, augmenting the training data for wire segmentation networks. SF-VD\nleverages videos with limited annotations by independently modeling scene\ndistribution and motion distribution. It first samples the scene distribution\nby generating 2D fluoroscopy images with wires positioned according to a\nspecified input mask, and then samples the motion distribution by progressively\ngenerating subsequent frames, ensuring frame-to-frame coherence through a\nframe-consistency strategy. A segmentation-guided mechanism further refines the\nprocess by adjusting wire contrast, ensuring a diverse range of visibility in\nthe synthesized image. Evaluation on a fluoroscopy dataset confirms the\nsuperior quality of the generated videos and shows significant improvements in\nguidewire segmentation.", "paper_summary_zh": "介入式心脏透視影片中導引線的精確分割對於電腦輔助導航任務至關重要。儘管深度學習方法在導線分割中展現出高準確度和強健性，但它們需要大量的標註資料集才能進行概化，強調了需要廣泛的標籤資料來提升模型效能。為了應對這個挑戰，我們提出分割引導的影格一致性影片擴散模型 (SF-VD) 來產生大量的標註透視影片，擴充導線分割網路的訓練資料。SF-VD 利用有限標註的影片，透過獨立建模場景分佈和動作分佈。它首先透過根據指定的輸入遮罩產生帶有導線的 2D 透視影像來取樣場景分佈，然後透過逐步產生後續影格來取樣動作分佈，確保影格間的一致性，並透過影格一致性策略來達成。分割引導的機制進一步透過調整導線對比來改善流程，確保合成影像中能有不同的可視範圍。在透視資料集上的評估證實了所產生影片的優異品質，並顯示出導線分割的顯著改善。", "author": "Shaoyan Pan et.al.", "authors": "Shaoyan Pan, Yikang Liu, Lin Zhao, Eric Z. Chen, Xiao Chen, Terrence Chen, Shanhui Sun", "id": "2412.16050v1", "paper_url": "http://arxiv.org/abs/2412.16050v1", "repo": "null"}}