{"2411.10950": {"publish_time": "2024-11-17", "title": "Understanding Multimodal LLMs: the Mechanistic Interpretability of Llava in Visual Question Answering", "paper_summary": "Understanding the mechanisms behind Large Language Models (LLMs) is crucial\nfor designing improved models and strategies. While recent studies have yielded\nvaluable insights into the mechanisms of textual LLMs, the mechanisms of\nMulti-modal Large Language Models (MLLMs) remain underexplored. In this paper,\nwe apply mechanistic interpretability methods to analyze the visual question\nanswering (VQA) mechanisms in the first MLLM, Llava. We compare the mechanisms\nbetween VQA and textual QA (TQA) in color answering tasks and find that: a) VQA\nexhibits a mechanism similar to the in-context learning mechanism observed in\nTQA; b) the visual features exhibit significant interpretability when\nprojecting the visual embeddings into the embedding space; and c) Llava\nenhances the existing capabilities of the corresponding textual LLM Vicuna\nduring visual instruction tuning. Based on these findings, we develop an\ninterpretability tool to help users and researchers identify important visual\nlocations for final predictions, aiding in the understanding of visual\nhallucination. Our method demonstrates faster and more effective results\ncompared to existing interpretability approaches. Code:\n\\url{https://github.com/zepingyu0512/llava-mechanism}", "paper_summary_zh": "了解大型語言模型 (LLM) 背後的機制對於設計改進的模型和策略至關重要。雖然最近的研究對文本 LLM 的機制產生了有價值的見解，但多模態大型語言模型 (MLLM) 的機制仍未得到充分探索。在本文中，我們應用機制可解釋性方法來分析第一個 MLLM Llava 中的視覺問答 (VQA) 機制。我們比較了 VQA 和文本 QA (TQA) 在顏色回答任務中的機制，發現：a) VQA 表現出與在 TQA 中觀察到的情境學習機制類似的機制；b) 在將視覺嵌入投影到嵌入空間時，視覺特徵表現出顯著的可解釋性；c) Llava 在視覺指令調整期間增強了相應文本 LLM Vicuna 的現有能力。根據這些發現，我們開發了一個可解釋性工具，以幫助用戶和研究人員識別最終預測的重要視覺位置，從而有助於理解視覺幻覺。與現有的可解釋性方法相比，我們的模型展示了更快速、更有效率的結果。代碼：\\url{https://github.com/zepingyu0512/llava-mechanism}", "author": "Zeping Yu et.al.", "authors": "Zeping Yu, Sophia Ananiadou", "id": "2411.10950v1", "paper_url": "http://arxiv.org/abs/2411.10950v1", "repo": "https://github.com/zepingyu0512/llava-mechanism"}}