{"2409.07684": {"publish_time": "2024-09-12", "title": "Modeling Information Narrative Detection and Evolution on Telegram during the Russia-Ukraine War", "paper_summary": "Following the Russian Federation's full-scale invasion of Ukraine in February\n2022, a multitude of information narratives emerged within both pro-Russian and\npro-Ukrainian communities online. As the conflict progresses, so too do the\ninformation narratives, constantly adapting and influencing local and global\ncommunity perceptions and attitudes. This dynamic nature of the evolving\ninformation environment (IE) underscores a critical need to fully discern how\nnarratives evolve and affect online communities. Existing research, however,\noften fails to capture information narrative evolution, overlooking both the\nfluid nature of narratives and the internal mechanisms that drive their\nevolution. Recognizing this, we introduce a novel approach designed to both\nmodel narrative evolution and uncover the underlying mechanisms driving them.\nIn this work we perform a comparative discourse analysis across communities on\nTelegram covering the initial three months following the invasion. First, we\nuncover substantial disparities in narratives and perceptions between\npro-Russian and pro-Ukrainian communities. Then, we probe deeper into prevalent\nnarratives of each group, identifying key themes and examining the underlying\nmechanisms fueling their evolution. Finally, we explore influences and factors\nthat may shape the development and spread of narratives.", "paper_summary_zh": "在 2022 年 2 月俄罗斯联邦全面入侵乌克兰之后，亲俄罗斯和亲乌克兰的网络社群中出现了许多信息叙事。随着冲突的进展，信息叙事也在不断适应和影响着当地和全球社群的认知和态度。这种不断演变的信息环境 (IE) 的动态特性强调了充分了解叙事如何演变并影响网络社群的迫切需要。然而，现有的研究通常无法捕捉到信息叙事的演变，既忽略了叙事的流动性，也忽略了推动其演变的内在机制。认识到这一点，我们引入了一种新颖的方法，旨在对叙事演变进行建模，并揭示推动其演变的潜在机制。在这项工作中，我们对 Telegram 上的社群进行了比较性话语分析，涵盖了入侵后的最初三个月。首先，我们揭示了亲俄罗斯和亲乌克兰社群之间在叙事和认知上的巨大差异。然后，我们深入探究每组流行的叙事，找出关键主题并检验推动其演变的潜在机制。最后，我们探讨可能影响叙事发展和传播的影响因素。", "author": "Patrick Gerard et.al.", "authors": "Patrick Gerard, Svitlana Volkova, Louis Penafiel, Kristina Lerman, Tim Weninger", "id": "2409.07684v1", "paper_url": "http://arxiv.org/abs/2409.07684v1", "repo": "null"}}