{"2410.08893": {"publish_time": "2024-10-11", "title": "Drama: Mamba-Enabled Model-Based Reinforcement Learning Is Sample and Parameter Efficient", "paper_summary": "Model-based reinforcement learning (RL) offers a solution to the data\ninefficiency that plagues most model-free RL algorithms. However, learning a\nrobust world model often demands complex and deep architectures, which are\nexpensive to compute and train. Within the world model, dynamics models are\nparticularly crucial for accurate predictions, and various dynamics-model\narchitectures have been explored, each with its own set of challenges.\nCurrently, recurrent neural network (RNN) based world models face issues such\nas vanishing gradients and difficulty in capturing long-term dependencies\neffectively. In contrast, use of transformers suffers from the well-known\nissues of self-attention mechanisms, where both memory and computational\ncomplexity scale as $O(n^2)$, with $n$ representing the sequence length.\n  To address these challenges we propose a state space model (SSM) based world\nmodel, specifically based on Mamba, that achieves $O(n)$ memory and\ncomputational complexity while effectively capturing long-term dependencies and\nfacilitating the use of longer training sequences efficiently. We also\nintroduce a novel sampling method to mitigate the suboptimality caused by an\nincorrect world model in the early stages of training, combining it with the\naforementioned technique to achieve a normalised score comparable to other\nstate-of-the-art model-based RL algorithms using only a 7 million trainable\nparameter world model. This model is accessible and can be trained on an\noff-the-shelf laptop. Our code is available at\nhttps://github.com/realwenlongwang/drama.git.", "paper_summary_zh": "<paragraph>基於模型的強化學習 (RL) 提供了解決資料低效率問題的方案，而資料低效率問題困擾著大多數無模型的 RL 演算法。然而，學習穩健的世界模型通常需要複雜且深入的架構，而且計算和訓練的成本很高。在世界模型中，動態模型對於準確預測特別重要，並且已經探索了各種動態模型架構，每個架構都有自己的一組挑戰。目前，基於遞迴神經網路 (RNN) 的世界模型面臨諸如梯度消失和難以有效捕捉長期依賴關係等問題。相比之下，使用Transformer會遇到眾所周知的自注意力機制的問題，其中記憶體和計算複雜度與 $O(n^2)$ 成正比，其中 $n$ 代表序列長度。\n為了應對這些挑戰，我們提出了一個基於狀態空間模型 (SSM) 的世界模型，特別是基於 Mamba，它實現了 $O(n)$ 記憶體和計算複雜度，同時有效地捕捉長期依賴關係並促進有效地使用更長的訓練序列。我們還引入了一種新的抽樣方法，以減輕訓練早期由於世界模型不正確而造成的次最佳性，並將其與上述技術相結合，以實現與其他最先進的基於模型的 RL 演算法相當的標準化分數，而僅使用 700 萬個可訓練參數的世界模型。此模型易於使用，可以在現成的筆記型電腦上訓練。我們的程式碼可在 https://github.com/realwenlongwang/drama.git 取得。</paragraph>", "author": "Wenlong Wang et.al.", "authors": "Wenlong Wang, Ivana Dusparic, Yucheng Shi, Ke Zhang, Vinny Cahill", "id": "2410.08893v1", "paper_url": "http://arxiv.org/abs/2410.08893v1", "repo": "https://github.com/realwenlongwang/drama"}}