{"2410.19318": {"publish_time": "2024-10-25", "title": "Two are better than one: Context window extension with multi-grained self-injection", "paper_summary": "The limited context window of contemporary large language models (LLMs)\nremains a huge barrier to their broader application across various domains.\nWhile continual pre-training on long-context data is a straightforward and\neffective solution, it incurs substantial costs in terms of data acquisition\nand computational resources. To alleviate this issue, we propose SharedLLM, a\nnovel approach grounded in the design philosophy of multi-grained context\ncompression and query-aware information retrieval. SharedLLM is composed of two\nshort-context LLMs such as LLaMA-2, termed upper model and lower model. The\nlower model functions as a compressor while the upper model acts as a decoder.\nThe upper model receives compressed, multi-grained context information from the\nlower model and performs context-aware modeling on the running text.\nInformation transfer between the compressor and decoder occurs only at the\nlowest layers to refrain from long forward paths in the lower model and\nredundant cross-attention modules in the upper model. Based on this\narchitecture, we introduce a specialized tree-style data structure to\nefficiently encode, store and retrieve multi-grained contextual information for\ntext chunks. This structure, combined with a search algorithm, enables rapid\nencoding and retrieval of relevant information from various levels of the tree\nbased on the input query. This entire process, wherein the sender and receiver\nare derived from the same LLM layer, is referred to as self-injection.", "paper_summary_zh": "當代大型語言模型 (LLM) 受限的上下文視窗，仍然是其在各種領域廣泛應用的巨大障礙。雖然持續在長文本資料上進行預訓練是一個直接且有效的方法，但它在資料取得和運算資源方面會產生大量的成本。為了緩解這個問題，我們提出 SharedLLM，一個建基於多粒度上下文壓縮和查詢感知資訊檢索的設計理念的新方法。SharedLLM 由兩個短文本 LLM 組成，例如 LLaMA-2，稱為上層模型和下層模型。下層模型作為壓縮器，而上層模型作為解碼器。上層模型從下層模型接收壓縮的多粒度上下文資訊，並對執行中的文字進行上下文感知建模。壓縮器和解碼器之間的資訊傳遞只發生在最底層，以避免下層模型中過長的正向路徑和上層模型中冗餘的交叉注意模組。基於這個架構，我們引入一個專門的樹狀資料結構，以有效編碼、儲存和檢索文字區塊的多粒度上下文資訊。這個結構與搜尋演算法相結合，可以根據輸入查詢快速編碼和檢索樹中不同層級的相關資訊。這個整個過程，其中發送者和接收者來自同一個 LLM 層，稱為自注入。", "author": "Wei Han et.al.", "authors": "Wei Han, Pan Zhou, Soujanya Poria, Shuicheng Yan", "id": "2410.19318v1", "paper_url": "http://arxiv.org/abs/2410.19318v1", "repo": "https://github.com/clement25/sharedllm"}}