{"2408.10923": {"publish_time": "2024-08-20", "title": "LBC: Language-Based-Classifier for Out-Of-Variable Generalization", "paper_summary": "Large Language Models (LLMs) have great success in natural language\nprocessing tasks such as response generation. However, their use in tabular\ndata has been limited due to their inferior performance compared to traditional\nmachine learning models (TMLs) such as XGBoost. We find that the pre-trained\nknowledge of LLMs enables them to interpret new variables that appear in a test\nwithout additional training, a capability central to the concept of\nOut-of-Variable (OOV). From the findings, we propose a\nLanguage-Based-Classifier (LBC), a classifier that maximizes the benefits of\nLLMs to outperform TMLs on OOV tasks. LBC employs three key methodological\nstrategies: 1) Categorical changes to adjust data to better fit the model's\nunderstanding, 2) Advanced order and indicator to enhance data representation\nto the model, and 3) Using verbalizer to map logit scores to classes during\ninference to generate model predictions. These strategies, combined with the\npre-trained knowledge of LBC, emphasize the model's ability to effectively\nhandle OOV tasks. We empirically and theoretically validate the superiority of\nLBC. LBC is the first study to apply an LLM-based model to OOV tasks. The\nsource code is at\nhttps://github.com/ASDASDanonymous/Language-Based-Classifier-forOOVtasks.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言處理任務中取得了巨大的成功，例如回應生成。然而，由於與傳統機器學習模型 (TML)（如 XGBoost）相比性能較差，它們在表格數據中的使用受到限制。我們發現，LLM 的預訓練知識使它們能夠解釋在測試中出現的新變數，而無需額外訓練，這項功能是 Out-of-Variable (OOV) 概念的核心。根據這些發現，我們提出了一個基於語言的分類器 (LBC)，這是一個分類器，最大化了 LLM 的優點，在 OOV 任務中優於 TML。LBC 採用了三項關鍵的方法策略：1) 對數據進行分類更改，以更好地符合模型的理解，2) 高級順序和指標來增強數據在模型中的表示，以及 3) 在推理過程中使用 verbalizer 將 logit 分數映射到類別以生成模型預測。這些策略與 LBC 的預訓練知識相結合，強調了模型有效處理 OOV 任務的能力。我們通過實證和理論驗證了 LBC 的優越性。LBC 是第一個將基於 LLM 的模型應用於 OOV 任務的研究。源代碼位於 https://github.com/ASDASDanonymous/Language-Based-Classifier-forOOVtasks。", "author": "Kangjun Noh et.al.", "authors": "Kangjun Noh, Baekryun Seong, Hoyoon Byun, Youngjun Choi, Sungjin Song, Kyungwoo Song", "id": "2408.10923v2", "paper_url": "http://arxiv.org/abs/2408.10923v2", "repo": "null"}}