{"2501.08648": {"publish_time": "2025-01-15", "title": "MAGNET: Augmenting Generative Decoders with Representation Learning and Infilling Capabilities", "paper_summary": "While originally designed for unidirectional generative modeling,\ndecoder-only large language models (LLMs) are increasingly being adapted for\nbidirectional modeling. However, unidirectional and bidirectional models are\ntypically trained separately with distinct objectives (generation and\nrepresentation learning, respectively). This separation overlooks the\nopportunity for developing a more versatile language model and for these\nobjectives to complement each other. In this work, we introduce MAGNET, an\nadaptation of decoder-only LLMs that enhances their ability to generate robust\nrepresentations and infill missing text spans, while preserving their knowledge\nand text generation capabilities. MAGNET employs three self-supervised training\nobjectives and introduces an attention mechanism that combines bidirectional\nand causal attention, enabling unified training across all objectives. Our\nresults demonstrate that LLMs adapted with MAGNET (1) surpass strong text\nencoders on token-level and sentence-level representation learning tasks, (2)\ngenerate contextually appropriate text infills by leveraging future context,\n(3) retain the ability for open-ended text generation without exhibiting\nrepetition problem, and (4) preserve the knowledge gained by the LLM during\npretraining.", "paper_summary_zh": "儘管最初是為單向生成式建模而設計，\n僅解碼器的大語言模型 (LLM) 卻日益被改編為\n雙向建模。然而，單向和雙向模型\n通常會以不同的目標（分別為產生和\n表示學習）分開訓練。這種分離忽視了\n開發更通用語言模型的機會，以及這些\n目標相互補充的機會。在這項工作中，我們引入了 MAGNET，一種僅解碼器 LLM 的改編，它增強了它們生成穩健\n表示和填補缺失文字區段的能力，同時保留它們的知識\n和文字生成能力。MAGNET 採用三個自我監督訓練\n目標，並引入一種結合雙向\n和因果注意力的注意力機制，讓所有目標都能進行統一訓練。我們的\n結果證明使用 MAGNET 改編的 LLM (1) 在標記層級和句子層級表示學習任務中超越強大的文字\n編碼器，(2)\n利用未來內容產生適當的文字填補，\n(3) 保留進行開放式文字生成的能力，而不會出現\n重複的問題，以及 (4) 保留 LLM 在\n預訓練期間獲得的知識。", "author": "Savya Khosla et.al.", "authors": "Savya Khosla, Kushal Kafle, Simon Jenni, Handong Zhao, John Collomosse, Jing Shi", "id": "2501.08648v1", "paper_url": "http://arxiv.org/abs/2501.08648v1", "repo": "null"}}