{"2409.02474": {"publish_time": "2024-09-04", "title": "A Comparative Study on Large Language Models for Log Parsing", "paper_summary": "Background: Log messages provide valuable information about the status of\nsoftware systems. This information is provided in an unstructured fashion and\nautomated approaches are applied to extract relevant parameters. To ease this\nprocess, log parsing can be applied, which transforms log messages into\nstructured log templates. Recent advances in language models have led to\nseveral studies that apply ChatGPT to the task of log parsing with promising\nresults. However, the performance of other state-of-the-art large language\nmodels (LLMs) on the log parsing task remains unclear.\n  Aims: In this study, we investigate the current capability of\nstate-of-the-art LLMs to perform log parsing.\n  Method: We select six recent LLMs, including both paid proprietary (GPT-3.5,\nClaude 2.1) and four free-to-use open models, and compare their performance on\nsystem logs obtained from a selection of mature open-source projects. We design\ntwo different prompting approaches and apply the LLMs on 1, 354 log templates\nacross 16 different projects. We evaluate their effectiveness, in the number of\ncorrectly identified templates, and the syntactic similarity between the\ngenerated templates and the ground truth.\n  Results: We found that free-to-use models are able to compete with paid\nmodels, with CodeLlama extracting 10% more log templates correctly than\nGPT-3.5. Moreover, we provide qualitative insights into the usability of\nlanguage models (e.g., how easy it is to use their responses).\n  Conclusions: Our results reveal that some of the smaller, free-to-use LLMs\ncan considerably assist log parsing compared to their paid proprietary\ncompetitors, especially code-specialized models.", "paper_summary_zh": "<paragraph>背景：記錄訊息提供有關軟體系統狀態的寶貴資訊。此資訊以非結構化方式提供，並套用自動化方法來擷取相關參數。為了簡化此流程，可以套用記錄剖析，將記錄訊息轉換成結構化的記錄範本。語言模型的最新進展已導致多項研究，將 ChatGPT 套用於記錄剖析任務，並獲得有希望的結果。然而，其他最先進的大型語言模型 (LLM) 在記錄剖析任務上的效能仍不清楚。\n目標：在本研究中，我們探討最先進 LLM 執行記錄剖析的當前能力。\n方法：我們選出六個最新的 LLM，包括付費專有（GPT-3.5、Claude 2.1）和四個免費開放模型，並比較它們在從一系列成熟的開源專案取得的系統記錄上的效能。我們設計兩種不同的提示方法，並將 LLM 套用於 16 個不同專案的 1,354 個記錄範本。我們評估其有效性，包括正確辨識的範本數量，以及產生的範本與真實結果之間的語法相似性。\n結果：我們發現免費模型能夠與付費模型競爭，CodeLlama 正確擷取的記錄範本比 GPT-3.5 多 10%。此外，我們提供語言模型可用性的品質見解（例如，多容易使用其回應）。\n結論：我們的結果顯示，一些較小的免費 LLM 與付費專有競爭者相比，可以大幅協助記錄剖析，特別是專門用於程式碼的模型。</paragraph>", "author": "Merve Astekin et.al.", "authors": "Merve Astekin, Max Hort, Leon Moonen", "id": "2409.02474v1", "paper_url": "http://arxiv.org/abs/2409.02474v1", "repo": "null"}}