{"2411.18077": {"publish_time": "2024-11-27", "title": "Pushing the Limits of LLM Inference via 2-Bit Layer-Discriminative KV Cache", "paper_summary": "How to efficiently serve LLMs in practice has become exceptionally\nchallenging due to their prohibitive memory and computation requirements. In\nthis study, we investigate optimizing the KV cache, whose memory footprint\nposes a critical bottleneck in LLM inference, especially when dealing with long\ncontext tasks. To tackle the challenge, we introduce MiniKV, a KV cache\noptimization method that simultaneously preserves long context task accuracy\nwhile significantly reducing KV cache size via a novel 2-bit\nlayer-discriminative KV cache. More importantly, we develop specialized CUDA\nkernels to make MiniKV compatible with FlashAttention. Experiments on a wide\nrange of long context tasks show that MiniKV effectively achieves 86% KV cache\ncompression ratio while recovering over 98.5% of accuracy, outperforming\nstate-of-the-art methods while achieving excellent measured system performance\nimprovements.", "paper_summary_zh": "在實務中如何有效地提供 LLM 服務已變得極具挑戰性，因為它們具有高昂的記憶體和運算需求。在本研究中，我們探討最佳化 KV 快取，其記憶體使用量在 LLM 推論中構成一個關鍵瓶頸，特別是在處理長脈絡任務時。為了應對這項挑戰，我們引入了 MiniKV，一種 KV 快取最佳化方法，它同時保留了長脈絡任務的準確性，並透過一種新穎的 2 位元層辨別式 KV 快取大幅減少 KV 快取大小。更重要的是，我們開發了專門的 CUDA 核心，使 MiniKV 與 FlashAttention 相容。在各種長脈絡任務上進行的實驗顯示，MiniKV 有效地達到了 86% 的 KV 快取壓縮比，同時恢復了超過 98.5% 的準確性，優於最先進的方法，同時實現了出色的測量系統效能改善。", "author": "Akshat Sharma et.al.", "authors": "Akshat Sharma, Hangliang Ding, Jianping Li, Neel Dani, Minjia Zhang", "id": "2411.18077v1", "paper_url": "http://arxiv.org/abs/2411.18077v1", "repo": "null"}}