{"2408.06022": {"publish_time": "2024-08-12", "title": "Controlling Surprisal in Music Generation via Information Content Curve Matching", "paper_summary": "In recent years, the quality and public interest in music generation systems\nhave grown, encouraging research into various ways to control these systems. We\npropose a novel method for controlling surprisal in music generation using\nsequence models. To achieve this goal, we define a metric called Instantaneous\nInformation Content (IIC). The IIC serves as a proxy function for the perceived\nmusical surprisal (as estimated from a probabilistic model) and can be\ncalculated at any point within a music piece. This enables the comparison of\nsurprisal across different musical content even if the musical events occur in\nirregular time intervals. We use beam search to generate musical material whose\nIIC curve closely approximates a given target IIC. We experimentally show that\nthe IIC correlates with harmonic and rhythmic complexity and note density. The\ncorrelation decreases with the length of the musical context used for\nestimating the IIC. Finally, we conduct a qualitative user study to test if\nhuman listeners can identify the IIC curves that have been used as targets when\ngenerating the respective musical material. We provide code for creating IIC\ninterpolations and IIC visualizations on https://github.com/muthissar/iic.", "paper_summary_zh": "近年来，人们对音乐生成系统的品质和公众兴趣与日俱增，这鼓励了人们对控制这些系统各种方式的研究。我们提出一种使用序列模型控制音乐生成中惊奇度的新方法。为了实现这一目标，我们定义了一个称为瞬时信息内容（IIC）的指标。IIC 作为感知到的音乐惊奇度（根据概率模型估计）的代理函数，可以在音乐作品中的任何点计算。即使音乐事件发生在不规则的时间间隔内，这也使得能够比较不同音乐内容中的惊奇度。我们使用波束搜索来生成音乐素材，其 IIC 曲线与给定的目标 IIC 非常接近。我们通过实验表明，IIC 与和声和节奏复杂度以及音符密度相关。相关性随着用于估计 IIC 的音乐背景长度而降低。最后，我们进行了一项定性的用户研究，以测试人类听众是否能够识别在生成各自音乐素材时用作目标的 IIC 曲线。我们提供了在 https://github.com/muthissar/iic 上创建 IIC 插值和 IIC 可视化的代码。", "author": "Mathias Rose Bjare et.al.", "authors": "Mathias Rose Bjare, Stefan Lattner, Gerhard Widmer", "id": "2408.06022v1", "paper_url": "http://arxiv.org/abs/2408.06022v1", "repo": "https://github.com/muthissar/iic"}}