{"2407.11550": {"publish_time": "2024-07-16", "title": "Optimizing KV Cache Eviction in LLMs: Adaptive Allocation for Enhanced Budget Utilization", "paper_summary": "Large Language Models have excelled in various fields but encounter\nefficiency limitations due to the extensive KV cache required for long\nsequences inference. Many efforts try to evict non-critical cache elements\nduring runtime, thereby reducing cache size within a given memory budget while\npreserving generation quality. Our reexamination of their underlying principles\ndiscerns that prevailing strategies essentially aim to minimize an upper bound\nof eviction loss within a specific budget allocation. However, we observe that\nthe current practice of uniformly allocating budgets across different attention\nheads during the eviction procedure tends to degrade the quality of generation\nposten-eviction. In light of these findings, we propose a simple yet effective\nadaptive allocation algorithm that not only theoretically ensures its loss\nupper bound does not exceed that of previous uniform allocation methods, but\nalso effectively aligns with the characteristics of the self-attention\nmechanism, thus practically reducing the upper bound. Further, integrating this\nalgorithm with two of the most advanced methods yields Ada-SnapKV and\nAda-Pyramid. Extensive experimental validation across 16 datasets and the\nNeedle-in-a-Haystack test confirm that Ada-SnapKV and Ada-Pyramid achieve\nfurther enhancements, establishing new benchmarks in state-of-the-art\nperformance.", "paper_summary_zh": "大型語言模型在各種領域表現出色，但由於長序列推論需要大量的 KV 快取，因此會遇到效率限制。許多方法嘗試在執行期間驅逐非關鍵快取元素，從而在給定的記憶體預算中減少快取大小，同時保持生成品質。我們重新審視其基本原則，發現普遍的策略基本上旨在最小化特定預算分配中的驅逐損失的上限。然而，我們觀察到在驅逐過程中將預算均勻分配給不同注意力層的現行做法往往會降低驅逐後的生成品質。根據這些發現，我們提出一個簡單但有效的自適應分配演算法，它不僅在理論上確保其損失上限不超過先前的均勻分配方法，而且有效地符合自注意力機制的特性，從而實際上降低了上限。此外，將此演算法與兩種最先進的方法整合，產生 Ada-SnapKV 和 Ada-Pyramid。在 16 個資料集和 Needle-in-a-Haystack 測試中的廣泛實驗驗證證實，Ada-SnapKV 和 Ada-Pyramid 進一步提升，在最先進的效能中建立新的基準。", "author": "Yuan Feng et.al.", "authors": "Yuan Feng, Junlin Lv, Yukun Cao, Xike Xie, S. Kevin Zhou", "id": "2407.11550v1", "paper_url": "http://arxiv.org/abs/2407.11550v1", "repo": "null"}}