{"2411.12877": {"publish_time": "2024-11-19", "title": "The Illusion of Empathy: How AI Chatbots Shape Conversation Perception", "paper_summary": "As AI chatbots become more human-like by incorporating empathy, understanding\nuser-centered perceptions of chatbot empathy and its impact on conversation\nquality remains essential yet under-explored. This study examines how chatbot\nidentity and perceived empathy influence users' overall conversation\nexperience. Analyzing 155 conversations from two datasets, we found that while\nGPT-based chatbots were rated significantly higher in conversational quality,\nthey were consistently perceived as less empathetic than human conversational\npartners. Empathy ratings from GPT-4o annotations aligned with users' ratings,\nreinforcing the perception of lower empathy in chatbots. In contrast, 3 out of\n5 empathy models trained on human-human conversations detected no significant\ndifferences in empathy language between chatbots and humans. Our findings\nunderscore the critical role of perceived empathy in shaping conversation\nquality, revealing that achieving high-quality human-AI interactions requires\nmore than simply embedding empathetic language; it necessitates addressing the\nnuanced ways users interpret and experience empathy in conversations with\nchatbots.", "paper_summary_zh": "隨著 AI 聊天機器人透過融入同理心變得越來越像人類，理解以使用者為中心對聊天機器人同理心的認知，以及其對對話品質的影響仍然是重要的，卻鮮少被探討。本研究探討聊天機器人身分和感知同理心如何影響使用者的整體對話體驗。我們分析來自兩個資料集的 155 場對話，發現儘管基於 GPT 的聊天機器人對話品質評分顯著較高，但他們始終被認為比人類對話夥伴同理心較低。GPT-4o 標註的同理心評分與使用者的評分一致，強化了聊天機器人同理心較低的認知。相比之下，5 個在人際對話中訓練的同理心模型中有 3 個並未偵測到聊天機器人和人類之間同理心語言的顯著差異。我們的發現強調了感知同理心在塑造對話品質中扮演關鍵角色，揭示出實現高品質的人工智慧互動不只是植入同理心語言而已；它需要解決使用者在與聊天機器人的對話中詮釋和體驗同理心的細微方式。", "author": "Tingting Liu et.al.", "authors": "Tingting Liu, Salvatore Giorgi, Ankit Aich, Allison Lahnala, Brenda Curtis, Lyle Ungar, João Sedoc", "id": "2411.12877v1", "paper_url": "http://arxiv.org/abs/2411.12877v1", "repo": "null"}}