{"2412.13705": {"publish_time": "2024-12-18", "title": "Mitigating Adversarial Attacks in LLMs through Defensive Suffix Generation", "paper_summary": "Large language models (LLMs) have exhibited outstanding performance in\nnatural language processing tasks. However, these models remain susceptible to\nadversarial attacks in which slight input perturbations can lead to harmful or\nmisleading outputs. A gradient-based defensive suffix generation algorithm is\ndesigned to bolster the robustness of LLMs. By appending carefully optimized\ndefensive suffixes to input prompts, the algorithm mitigates adversarial\ninfluences while preserving the models' utility. To enhance adversarial\nunderstanding, a novel total loss function ($L_{\\text{total}}$) combining\ndefensive loss ($L_{\\text{def}}$) and adversarial loss ($L_{\\text{adv}}$)\ngenerates defensive suffixes more effectively. Experimental evaluations\nconducted on open-source LLMs such as Gemma-7B, mistral-7B, Llama2-7B, and\nLlama2-13B show that the proposed method reduces attack success rates (ASR) by\nan average of 11\\% compared to models without defensive suffixes. Additionally,\nthe perplexity score of Gemma-7B decreased from 6.57 to 3.93 when applying the\ndefensive suffix generated by openELM-270M. Furthermore, TruthfulQA evaluations\ndemonstrate consistent improvements with Truthfulness scores increasing by up\nto 10\\% across tested configurations. This approach significantly enhances the\nsecurity of LLMs in critical applications without requiring extensive\nretraining.", "paper_summary_zh": "大型語言模型 (LLM) 已在自然語言處理任務中展現出色的表現。然而，這些模型仍容易受到對抗性攻擊，其中輕微的輸入擾動可能導致有害或誤導的輸出。基於梯度的防禦性後綴生成演算法旨在加強 LLM 的穩健性。透過附加經過仔細最佳化的防禦性後綴至輸入提示，此演算法可減輕對抗性影響，同時保留模型的效用。為了增強對抗性理解，一個新穎的總損失函數 ($L_{\\text{total}}$) 結合了防禦性損失 ($L_{\\text{def}}$) 和對抗性損失 ($L_{\\text{adv}}$)，更有效地產生防禦性後綴。在 Gemma-7B、mistral-7B、Llama2-7B 和 Llama2-13B 等開源 LLM 上進行的實驗評估顯示，與沒有防禦性後綴的模型相比，所提出的方法將攻擊成功率 (ASR) 平均降低了 11%。此外，在應用 openELM-270M 生成的防禦性後綴時，Gemma-7B 的困惑度分數從 6.57 降低到 3.93。此外，TruthfulQA 評估顯示，在測試的配置中，真實性分數提高了 10%，證明了一致的改進。此方法顯著增強了 LLM 在關鍵應用中的安全性，而無需進行廣泛的再訓練。", "author": "Minkyoung Kim et.al.", "authors": "Minkyoung Kim, Yunha Kim, Hyeram Seo, Heejung Choi, Jiye Han, Gaeun Kee, Soyoung Ko, HyoJe Jung, Byeolhee Kim, Young-Hak Kim, Sanghyun Park, Tae Joon Jun", "id": "2412.13705v1", "paper_url": "http://arxiv.org/abs/2412.13705v1", "repo": "null"}}