{"2407.07668": {"publish_time": "2024-07-10", "title": "How to Leverage Predictive Uncertainty Estimates for Reducing Catastrophic Forgetting in Online Continual Learning", "paper_summary": "Many real-world applications require machine-learning models to be able to\ndeal with non-stationary data distributions and thus learn autonomously over an\nextended period of time, often in an online setting. One of the main challenges\nin this scenario is the so-called catastrophic forgetting (CF) for which the\nlearning model tends to focus on the most recent tasks while experiencing\npredictive degradation on older ones. In the online setting, the most effective\nsolutions employ a fixed-size memory buffer to store old samples used for\nreplay when training on new tasks. Many approaches have been presented to\ntackle this problem. However, it is not clear how predictive uncertainty\ninformation for memory management can be leveraged in the most effective manner\nand conflicting strategies are proposed to populate the memory. Are the\neasiest-to-forget or the easiest-to-remember samples more effective in\ncombating CF? Starting from the intuition that predictive uncertainty provides\nan idea of the samples' location in the decision space, this work presents an\nin-depth analysis of different uncertainty estimates and strategies for\npopulating the memory. The investigation provides a better understanding of the\ncharacteristics data points should have for alleviating CF. Then, we propose an\nalternative method for estimating predictive uncertainty via the generalised\nvariance induced by the negative log-likelihood. Finally, we demonstrate that\nthe use of predictive uncertainty measures helps in reducing CF in different\nsettings.", "paper_summary_zh": "許多實際應用都需要機器學習模型能夠處理非平穩資料分佈，並在一段長時間內自主學習，通常是在線上設定中。在這種情況下，主要的挑戰之一是所謂的災難性遺忘 (CF)，學習模型傾向於專注於最新的任務，同時在舊任務上遇到預測性退化。在線上設定中，最有效的解決方案採用固定大小的記憶體緩衝區來儲存用於在訓練新任務時重播的舊範例。已經提出了許多方法來解決這個問題。然而，目前尚不清楚如何以最有效的方式利用預測不確定性資訊進行記憶體管理，並且提出了相互衝突的策略來填充記憶體。最容易遺忘或最容易記住的範例在對抗 CF 中哪個更有效？從預測不確定性提供決策空間中範例位置的想法這個直覺出發，這項工作提出了一個對不同不確定性估計和策略的深入分析，以填充記憶體。這項調查提供了對資料點應具有的特徵以減輕 CF 的更深入了解。然後，我們提出了一種透過負對數似然引發的廣義變異來估計預測不確定性的替代方法。最後，我們證明了使用預測不確定性測量有助於在不同的設定中減少 CF。", "author": "Giuseppe Serra et.al.", "authors": "Giuseppe Serra, Ben Werner, Florian Buettner", "id": "2407.07668v1", "paper_url": "http://arxiv.org/abs/2407.07668v1", "repo": "null"}}