{"2411.14698": {"publish_time": "2024-11-22", "title": "Improving Mathematical Reasoning Capabilities of Small Language Models via Feedback-Driven Distillation", "paper_summary": "Large Language Models (LLMs) demonstrate exceptional reasoning capabilities,\noften achieving state-of-the-art performance in various tasks. However, their\nsubstantial computational and memory demands, due to billions of parameters,\nhinder deployment in resource-constrained environments. A promising solution is\nknowledge distillation, where LLMs transfer reasoning capabilities to Small\nLanguage Models (SLMs, $\\le$ 1B parameters), enabling wider deployment on\nlow-resource devices. Existing methods primarily focus on generating\nhigh-quality reasoning rationales for distillation datasets but often neglect\nthe critical role of data quantity and quality. To address these challenges, we\npropose a Feedback-Driven Distillation (FDD) framework to enhance SLMs'\nmathematical reasoning capabilities. In the initialization stage, a\ndistillation dataset is constructed by prompting LLMs to pair mathematical\nproblems with corresponding reasoning rationales. We classify problems into\neasy and hard categories based on SLM performance. For easy problems, LLMs\ngenerate more complex variations, while for hard problems, new questions of\nsimilar complexity are synthesized. In addition, we propose a multi-round\ndistillation paradigm to iteratively enrich the distillation datasets, thereby\nprogressively improving the mathematical reasoning abilities of SLMs.\nExperimental results demonstrate that our method can make SLMs achieve SOTA\nmathematical reasoning performance.", "paper_summary_zh": "大型語言模型 (LLM) 展現出色的推理能力，在各項任務中經常達到最先進的表現。然而，由於數十億個參數，它們龐大的運算和記憶體需求阻礙了在資源受限環境中的部署。一個有前途的解決方案是知識蒸餾，其中 LLM 將推理能力轉移到小型語言模型 (SLM，$\\le$ 1B 參數)，從而能夠在低資源裝置上更廣泛地部署。現有方法主要專注於為蒸餾資料集產生高品質的推理依據，但常常忽略資料數量和品質的關鍵作用。為了應對這些挑戰，我們提出了一個回饋驅動蒸餾 (FDD) 架構，以增強 SLM 的數學推理能力。在初始化階段，通過提示 LLM 將數學問題與對應的推理依據配對來建構一個蒸餾資料集。我們根據 SLM 的表現將問題分類為容易和困難的類別。對於容易的問題，LLM 會產生更複雜的變化，而對於困難的問題，則會合成類似複雜度的新問題。此外，我們提出了一個多輪蒸餾範例，以反覆豐富蒸餾資料集，從而逐步提升 SLM 的數學推理能力。實驗結果證明，我們的模型可以讓 SLM 達到數學推理表現的 SOTA 水準。", "author": "Xunyu Zhu et.al.", "authors": "Xunyu Zhu, Jian Li, Can Ma, Weiping Wang", "id": "2411.14698v1", "paper_url": "http://arxiv.org/abs/2411.14698v1", "repo": "null"}}