{"2409.08276": {"publish_time": "2024-09-12", "title": "AnySkin: Plug-and-play Skin Sensing for Robotic Touch", "paper_summary": "While tactile sensing is widely accepted as an important and useful sensing\nmodality, its use pales in comparison to other sensory modalities like vision\nand proprioception. AnySkin addresses the critical challenges that impede the\nuse of tactile sensing -- versatility, replaceability, and data reusability.\nBuilding on the simplistic design of ReSkin, and decoupling the sensing\nelectronics from the sensing interface, AnySkin simplifies integration making\nit as straightforward as putting on a phone case and connecting a charger.\nFurthermore, AnySkin is the first uncalibrated tactile-sensor with\ncross-instance generalizability of learned manipulation policies. To summarize,\nthis work makes three key contributions: first, we introduce a streamlined\nfabrication process and a design tool for creating an adhesive-free, durable\nand easily replaceable magnetic tactile sensor; second, we characterize slip\ndetection and policy learning with the AnySkin sensor; and third, we\ndemonstrate zero-shot generalization of models trained on one instance of\nAnySkin to new instances, and compare it with popular existing tactile\nsolutions like DIGIT and ReSkin.https://any-skin.github.io/", "paper_summary_zh": "儘管觸覺感測被廣泛接受為一種重要且有用的感測方式，但與視覺和本體感覺等其他感官方式相比，它的使用顯得相形見絀。AnySkin 解決了阻礙觸覺感測使用的關鍵挑戰，包括多功能性、可替換性和資料可重用性。AnySkin 建立在 ReSkin 的簡化設計之上，並將感測電子元件與感測介面分開，簡化了整合，使其像戴上手機殼並連接充電器一樣簡單。此外，AnySkin 是第一個未校準的觸覺感測器，具有跨例學習操作策略的概括性。總之，這項工作做出了三項關鍵貢獻：首先，我們引入了一個簡化的製造流程和一個設計工具，用於建立無黏著劑、耐用且易於更換的磁性觸覺感測器；其次，我們利用 AnySkin 感測器來表徵滑動偵測和策略學習；第三，我們展示了在一個 AnySkin 實例上訓練的模型對新實例的零次學習概括性，並將其與 DIGIT 和 ReSkin 等現有的熱門觸覺解決方案進行了比較。https://any-skin.github.io/", "author": "Raunaq Bhirangi et.al.", "authors": "Raunaq Bhirangi, Venkatesh Pattabiraman, Enes Erciyes, Yifeng Cao, Tess Hellebrekers, Lerrel Pinto", "id": "2409.08276v1", "paper_url": "http://arxiv.org/abs/2409.08276v1", "repo": "null"}}