{"2407.07810": {"publish_time": "2024-07-10", "title": "Transformer Alignment in Large Language Models", "paper_summary": "Large Language Models (LLMs) have made significant strides in natural\nlanguage processing, and a precise understanding of the internal mechanisms\ndriving their success is essential. We regard LLMs as transforming embeddings\nvia a discrete, coupled, nonlinear, dynamical system in high dimensions. This\nperspective motivates tracing the trajectories of individual tokens as they\npass through transformer blocks, and linearizing the system along these\ntrajectories through their Jacobian matrices. In our analysis of 38 openly\navailable LLMs, we uncover the alignment of top left and right singular vectors\nof Residual Jacobians, as well as the emergence of linearity and layer-wise\nexponential growth. Notably, we discover that increased alignment\n$\\textit{positively correlates}$ with model performance. Metrics evaluated\npost-training show significant improvement in comparison to measurements made\nwith randomly initialized weights, highlighting the significant effects of\ntraining in transformers. These findings reveal a remarkable level of\nregularity that has previously been overlooked, reinforcing the dynamical\ninterpretation and paving the way for deeper understanding and optimization of\nLLM architectures.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言處理方面取得了重大進展，而準確理解推動其成功的內部機制至關重要。我們將 LLM 視為通過高維度的離散、耦合、非線性動態系統轉換嵌入。這種觀點激勵我們追蹤個別符號在通過變換器區塊時的軌跡，並通過其雅可比矩陣沿這些軌跡對系統進行線性化。在我們對 38 個公開可用的 LLM 的分析中，我們發現了殘差雅可比矩陣的左奇異向量和右奇異向量的對齊，以及線性和逐層指數增長的出現。值得注意的是，我們發現增加對齊度會與模型性能呈正相關。與使用隨機初始化權重進行的測量相比，訓練後評估的指標顯示出顯著改進，突出了Transformer訓練的顯著影響。這些發現揭示了一個以前被忽視的顯著規律性，加強了動態解釋，並為 LLM 架構的更深入理解和優化鋪平了道路。", "author": "Murdock Aubry et.al.", "authors": "Murdock Aubry, Haoming Meng, Anton Sugolov, Vardan Papyan", "id": "2407.07810v1", "paper_url": "http://arxiv.org/abs/2407.07810v1", "repo": "null"}}