{"2503.24145": {"publish_time": "2025-03-31", "title": "Resonance: Drawing from Memories to Imagine Positive Futures through AI-Augmented Journaling", "paper_summary": "People inherently use experiences of their past while imagining their future,\na capability that plays a crucial role in mental health. Resonance is an\nAI-powered journaling tool designed to augment this ability by offering\nAI-generated, action-oriented suggestions for future activities based on the\nuser's own past memories. Suggestions are offered when a new memory is logged\nand are followed by a prompt for the user to imagine carrying out the\nsuggestion. In a two-week randomized controlled study (N=55), we found that\nusing Resonance significantly improved mental health outcomes, reducing the\nusers' PHQ8 scores, a measure of current depression, and increasing their daily\npositive affect, particularly when they would likely act on the suggestion.\nNotably, the effectiveness of the suggestions was higher when they were\npersonal, novel, and referenced the user's logged memories. Finally, through\nopen-ended feedback, we discuss the factors that encouraged or hindered the use\nof the tool.", "paper_summary_zh": "人們天生就會利用過去的經驗來想像他們的未來，這種能力在心理健康中扮演著至關重要的角色。Resonance 是一款AI 驅動的日記工具，旨在透過根據使用者自身的過往記憶提供 AI 生成的、以行動為導向的未來活動建議來增強這種能力。當記錄新的記憶時，系統會提供建議，並提示使用者想像執行該建議。在一項為期兩週的隨機對照研究 (N=55) 中，我們發現使用 Resonance 能顯著改善心理健康狀況，降低使用者的 PHQ8 分數（一種衡量當前抑鬱程度的指標），並增加他們的每日正面情緒，尤其是在他們可能按照建議採取行動時。值得注意的是，當建議具有個人化、新穎性，並且參考了使用者記錄的記憶時，其效果會更好。最後，透過開放式回饋，我們討論了促進或阻礙該工具使用的因素。\n", "author": "Wazeer Zulfikar et.al.", "authors": "Wazeer Zulfikar, Treyden Chiaravalloti, Jocelyn Shen, Rosalind Picard, Pattie Maes", "id": "2503.24145v1", "paper_url": "http://arxiv.org/abs/2503.24145v1", "repo": "null"}}