{"2412.15129": {"publish_time": "2024-12-19", "title": "Jet: A Modern Transformer-Based Normalizing Flow", "paper_summary": "In the past, normalizing generative flows have emerged as a promising class\nof generative models for natural images. This type of model has many modeling\nadvantages: the ability to efficiently compute log-likelihood of the input\ndata, fast generation and simple overall structure. Normalizing flows remained\na topic of active research but later fell out of favor, as visual quality of\nthe samples was not competitive with other model classes, such as GANs,\nVQ-VAE-based approaches or diffusion models. In this paper we revisit the\ndesign of the coupling-based normalizing flow models by carefully ablating\nprior design choices and using computational blocks based on the Vision\nTransformer architecture, not convolutional neural networks. As a result, we\nachieve state-of-the-art quantitative and qualitative performance with a much\nsimpler architecture. While the overall visual quality is still behind the\ncurrent state-of-the-art models, we argue that strong normalizing flow models\ncan help advancing research frontier by serving as building components of more\npowerful generative models.", "paper_summary_zh": "在過去，正規化生成流已成為自然圖像生成模型中一個很有前景的類別。這種類型的模型有許多建模優勢：有效計算輸入資料的對數似然、快速生成和簡單的整體結構。正規化流仍然是積極研究的主題，但後來不受青睞，因為樣本的視覺品質無法與其他模型類別競爭，例如 GAN、基於 VQ-VAE 的方法或擴散模型。在本文中，我們重新檢視基於耦合的正規化流模型的設計，透過仔細消融先前的設計選擇，並使用基於 Vision Transformer 架構（而非卷積神經網路）的計算區塊。因此，我們以更簡單的架構實現了最先進的量化和質化效能。雖然整體視覺品質仍落後於目前的最新模型，但我們認為強大的正規化流模型可以透過作為更強大生成模型的建構元件，來幫助推進研究前沿。", "author": "Alexander Kolesnikov et.al.", "authors": "Alexander Kolesnikov, André Susano Pinto, Michael Tschannen", "id": "2412.15129v1", "paper_url": "http://arxiv.org/abs/2412.15129v1", "repo": "null"}}