{"2409.13191": {"publish_time": "2024-09-20", "title": "An adapted large language model facilitates multiple medical tasks in diabetes care", "paper_summary": "Diabetes is a chronic disease that poses a significant global health burden,\nand optimizing diabetes management requires multi-stakeholder collaboration.\nLarge language models (LLMs) have shown promise in various healthcare\nscenarios, but their effectiveness across a diverse range of diabetes tasks\nremains unproven. In this study, we introduced a framework to train and\nvalidate diabetes-specific LLMs. We first developed a comprehensive data\nprocessing pipeline that includes data collection, filtering, augmentation and\nrefinement. This approach contributes to creating a high-quality,\ndiabetes-specific dataset, and several evaluation benchmarks entirely from\nscratch. Utilizing the collected training dataset, we fine-tuned a\ndiabetes-specific LLM family that demonstrated state-of-the-art proficiency in\nunderstanding and processing various diabetes tasks compared to other LLMs.\nFurthermore, clinical studies showed the potential applications of our models\nin diabetes care, including providing personalized healthcare, assisting\nmedical education, and streamlining clinical tasks. In conclusion, our study\nintroduced a framework to develop and evaluate a diabetes-specific LLM family,\nand highlighted its potential to enhance clinical practice and provide\npersonalized, data-driven support for diabetes support when facing different\nend users. The code is provided via GitHub at\nhttps://github.com/waltonfuture/Diabetica.", "paper_summary_zh": "糖尿病是一種慢性疾病，對全球健康造成重大負擔，而優化糖尿病管理需要多方利益相關者的合作。大型語言模型 (LLM) 已在各種醫療保健場景中展現出潛力，但它們在各種糖尿病任務中的有效性仍未得到證實。在這個研究中，我們引入了一個訓練和驗證糖尿病特定 LLM 的框架。我們首先開發了一個全面的數據處理管道，其中包括數據收集、過濾、擴充和優化。這種方法有助於創建一個高品質、特定於糖尿病的數據集，以及從頭開始的幾個評估基準。利用收集的訓練數據集，我們微調了一個特定於糖尿病的 LLM 家族，與其他 LLM 相比，在理解和處理各種糖尿病任務方面展示了最先進的熟練度。此外，臨床研究表明我們的模型在糖尿病護理中具有潛在應用，包括提供個性化醫療保健、協助醫學教育和簡化臨床任務。總之，我們的研究引入了一個開發和評估特定於糖尿病的 LLM 家族的框架，並強調了其增強臨床實務和在面對不同最終用戶時提供個性化、數據驅動的糖尿病支持的潛力。該程式碼透過 GitHub 提供，網址為 https://github.com/waltonfuture/Diabetica。", "author": "Lai Wei et.al.", "authors": "Lai Wei, Zhen Ying, Muyang He, Yutong Chen, Qian Yang, Yanzhe Hong, Jiaping Lu, Xiaoying Li, Weiran Huang, Ying Chen", "id": "2409.13191v1", "paper_url": "http://arxiv.org/abs/2409.13191v1", "repo": "https://github.com/waltonfuture/Diabetica"}}