{"2502.03954": {"publish_time": "2025-02-06", "title": "MAQInstruct: Instruction-based Unified Event Relation Extraction", "paper_summary": "Extracting event relations that deviate from known schemas has proven\nchallenging for previous methods based on multi-class classification, MASK\nprediction, or prototype matching. Recent advancements in large language models\nhave shown impressive performance through instruction tuning. Nevertheless, in\nthe task of event relation extraction, instruction-based methods face several\nchallenges: there are a vast number of inference samples, and the relations\nbetween events are non-sequential. To tackle these challenges, we present an\nimproved instruction-based event relation extraction framework named\nMAQInstruct. Firstly, we transform the task from extracting event relations\nusing given event-event instructions to selecting events using given\nevent-relation instructions, which reduces the number of samples required for\ninference. Then, by incorporating a bipartite matching loss, we reduce the\ndependency of the instruction-based method on the generation sequence. Our\nexperimental results demonstrate that MAQInstruct significantly improves the\nperformance of event relation extraction across multiple LLMs.", "paper_summary_zh": "提取偏離已知模式的事件關係，已證明對基於多類分類、MASK 預測或原型匹配的先前方法構成挑戰。大型語言模型的最新進展已透過指令調整展現出令人印象深刻的效能。不過，在事件關係萃取任務中，基於指令的方法面臨多項挑戰：有大量的推論範例，而且事件之間的關係是非順序的。為了應對這些挑戰，我們提出一個名為 MAQInstruct 的改良式基於指令的事件關係萃取架構。首先，我們將任務從使用既定的事件-事件指令萃取事件關係，轉換為使用既定的事件-關係指令選取事件，這減少了推論所需的範例數量。接著，透過納入雙分匹配損失，我們降低基於指令的方法對於生成順序的依賴性。我們的實驗結果證明，MAQInstruct 大幅改善了多個 LLM 的事件關係萃取效能。", "author": "Jun Xu et.al.", "authors": "Jun Xu, Mengshu Sun, Zhiqiang Zhang, Jun Zhou", "id": "2502.03954v1", "paper_url": "http://arxiv.org/abs/2502.03954v1", "repo": "null"}}