{"2407.08105": {"publish_time": "2024-07-11", "title": "Federated Learning and AI Regulation in the European Union: Who is Responsible? -- An Interdisciplinary Analysis", "paper_summary": "The European Union Artificial Intelligence Act mandates clear stakeholder\nresponsibilities in developing and deploying machine learning applications to\navoid substantial fines, prioritizing private and secure data processing with\ndata remaining at its origin. Federated Learning (FL) enables the training of\ngenerative AI Models across data siloes, sharing only model parameters while\nimproving data security. Since FL is a cooperative learning paradigm, clients\nand servers naturally share legal responsibility in the FL pipeline. Our work\ncontributes to clarifying the roles of both parties, explains strategies for\nshifting responsibilities to the server operator, and points out open technical\nchallenges that we must solve to improve FL's practical applicability under the\nEU AI Act.", "paper_summary_zh": "歐盟人工智慧法規要求在開發和部署機器學習應用程式時明確利害關係人的責任，以避免巨額罰款，並優先考量私密且安全的資料處理，同時讓資料保留在原始位置。聯邦學習 (FL) 能讓生成式 AI 模型跨資料孤島進行訓練，只分享模型參數，同時提升資料安全性。由於 FL 是一種合作學習模式，客戶端和伺服器在 FL 管道中自然會共同承擔法律責任。我們的研究有助於釐清雙方的角色，說明將責任轉移給伺服器操作員的策略，並指出我們必須解決的開放式技術挑戰，才能改善 FL 在歐盟 AI 法規下的實際適用性。", "author": "Herbert Woisetschläger et.al.", "authors": "Herbert Woisetschläger, Simon Mertel, Christoph Krönke, Ruben Mayer, Hans-Arno Jacobsen", "id": "2407.08105v2", "paper_url": "http://arxiv.org/abs/2407.08105v2", "repo": "null"}}