{"2409.04360": {"publish_time": "2024-09-06", "title": "Connectivity-Inspired Network for Context-Aware Recognition", "paper_summary": "The aim of this paper is threefold. We inform the AI practitioner about the\nhuman visual system with an extensive literature review; we propose a novel\nbiologically motivated neural network for image classification; and, finally,\nwe present a new plug-and-play module to model context awareness. We focus on\nthe effect of incorporating circuit motifs found in biological brains to\naddress visual recognition. Our convolutional architecture is inspired by the\nconnectivity of human cortical and subcortical streams, and we implement\nbottom-up and top-down modulations that mimic the extensive afferent and\nefferent connections between visual and cognitive areas. Our Contextual\nAttention Block is simple and effective and can be integrated with any\nfeed-forward neural network. It infers weights that multiply the feature maps\naccording to their causal influence on the scene, modeling the co-occurrence of\ndifferent objects in the image. We place our module at different bottlenecks to\ninfuse a hierarchical context awareness into the model. We validated our\nproposals through image classification experiments on benchmark data and found\na consistent improvement in performance and the robustness of the produced\nexplanations via class activation. Our code is available at\nhttps://github.com/gianlucarloni/CoCoReco.", "paper_summary_zh": "這篇論文的目標有三。我們透過廣泛的文獻回顧，讓 AI 從業者了解人類視覺系統；我們提出一個新的受生物啟發的神經網路進行影像分類；最後，我們提出一個新的即插即用模組，用於模擬情境感知。我們專注於加入在生物大腦中發現的電路基序，以解決視覺辨識問題。我們的卷積架構受到人類皮質和皮質下迴路的連接啟發，我們實作了自下而上和自上而下的調變，模擬視覺和認知區域之間廣泛的傳入和傳出連接。我們的脈絡注意力區塊簡單有效，可以與任何前饋神經網路整合。它推論出權重，根據特徵圖對場景的因果影響來乘以這些特徵圖，模擬影像中不同物件的共現。我們將模組放在不同的瓶頸，將階層式情境感知注入模型中。我們透過基準資料上的影像分類實驗驗證了我們的提案，發現透過類別活化，效能和產生的解釋的穩健性都有顯著的改善。我們的程式碼可在 https://github.com/gianlucarloni/CoCoReco 取得。", "author": "Gianluca Carloni et.al.", "authors": "Gianluca Carloni, Sara Colantonio", "id": "2409.04360v1", "paper_url": "http://arxiv.org/abs/2409.04360v1", "repo": "null"}}