{"2409.17525": {"publish_time": "2024-09-26", "title": "When A Man Says He Is Pregnant: ERP Evidence for A Rational Account of Speaker-contextualized Language Comprehension", "paper_summary": "Spoken language is often, if not always, understood in a context that\nincludes the identities of speakers. For instance, we can easily make sense of\nan utterance such as \"I'm going to have a manicure this weekend\" or \"The first\ntime I got pregnant I had a hard time\" when the utterance is spoken by a woman,\nbut it would be harder to understand when it is spoken by a man. Previous\nevent-related potential (ERP) studies have shown mixed results regarding the\nneurophysiological responses to such speaker-mismatched utterances, with some\nreporting an N400 effect and others a P600 effect. In an experiment involving\n64 participants, we showed that these different ERP effects reflect distinct\ncognitive processes employed to resolve the speaker-message mismatch. When\npossible, the message is integrated with the speaker context to arrive at an\ninterpretation, as in the case of violations of social stereotypes (e.g., men\ngetting a manicure), resulting in an N400 effect. However, when such\nintegration is impossible due to violations of biological knowledge (e.g., men\ngetting pregnant), listeners engage in an error correction process to revise\neither the perceived utterance or the speaker context, resulting in a P600\neffect. Additionally, we found that the social N400 effect decreased as a\nfunction of the listener's personality trait of openness, while the biological\nP600 effect remained robust. Our findings help to reconcile the empirical\ninconsistencies in the literature and provide a rational account of\nspeaker-contextualized language comprehension.", "paper_summary_zh": "口語通常（如果不是總是）在包含說話者身分的脈絡中被理解。例如，當一個女人說出「我這個週末要去做指甲」或「我第一次懷孕時很辛苦」時，我們可以輕易理解這句話的意思，但如果這句話是由一個男人說出的，理解起來就會比較困難。先前與事件相關的電位 (ERP) 研究顯示，對於這種說話者與訊息不符的語句，神經生理反應的結果好壞參半，有些研究報告了 N400 效應，而另一些則報告了 P600 效應。在一個包含 64 名參與者的實驗中，我們發現這些不同的 ERP 效應反映了不同的認知過程，用於解決說話者與訊息不符的問題。若有可能，訊息會與說話者的脈絡整合，以得出一個詮釋，就像違反社會刻板印象的情況（例如，男人去做指甲），導致 N400 效應。然而，當這種整合由於違反生物知識（例如，男人懷孕）而不可能時，聽眾會進行錯誤修正過程，以修改感知到的語句或說話者的脈絡，導致 P600 效應。此外，我們發現社會 N400 效應會隨著聽眾的人格特質開放性而降低，而生物 P600 效應則保持強勁。我們的發現有助於調和文獻中的經驗不一致性，並對說話者脈絡化的語言理解提供一個合理的說明。", "author": "Hanlin Wu et.al.", "authors": "Hanlin Wu, Zhenguang G. Cai", "id": "2409.17525v1", "paper_url": "http://arxiv.org/abs/2409.17525v1", "repo": "null"}}