{"2407.17339": {"publish_time": "2024-07-24", "title": "Preliminary study on artificial intelligence methods for cybersecurity threat detection in computer networks based on raw data packets", "paper_summary": "Most of the intrusion detection methods in computer networks are based on\ntraffic flow characteristics. However, this approach may not fully exploit the\npotential of deep learning algorithms to directly extract features and patterns\nfrom raw packets. Moreover, it impedes real-time monitoring due to the\nnecessity of waiting for the processing pipeline to complete and introduces\ndependencies on additional software components.\n  In this paper, we investigate deep learning methodologies capable of\ndetecting attacks in real-time directly from raw packet data within network\ntraffic. We propose a novel approach where packets are stacked into windows and\nseparately recognised, with a 2D image representation suitable for processing\nwith computer vision models. Our investigation utilizes the CIC IDS-2017\ndataset, which includes both benign traffic and prevalent real-world attacks,\nproviding a comprehensive foundation for our research.", "paper_summary_zh": "大多數電腦網路中的入侵偵測方法都基於流量特徵。然而，此方法可能無法充分利用深度學習演算法直接從原始封包中擷取特徵和模式的潛力。此外，由於必須等到處理管線完成，並引入對額外軟體元件的依賴性，因此會妨礙即時監控。\n在本文中，我們探討了能夠直接從網路流量中的原始封包資料即時偵測攻擊的深度學習方法。我們提出了一種新穎的方法，其中封包堆疊到視窗中並分別識別，並使用適合電腦視覺模型處理的 2D 影像表示。我們的研究利用 CIC IDS-2017 資料集，其中包含良性流量和普遍的真實世界攻擊，為我們的研究提供了全面的基礎。", "author": "Aleksander Ogonowski et.al.", "authors": "Aleksander Ogonowski, Michał Żebrowski, Arkadiusz Ćwiek, Tobiasz Jarosiewicz, Konrad Klimaszewski, Adam Padee, Piotr Wasiuk, Michał Wójcik", "id": "2407.17339v1", "paper_url": "http://arxiv.org/abs/2407.17339v1", "repo": "null"}}