{"2406.03287": {"publish_time": "2024-06-05", "title": "SpikeLM: Towards General Spike-Driven Language Modeling via Elastic Bi-Spiking Mechanisms", "paper_summary": "Towards energy-efficient artificial intelligence similar to the human brain,\nthe bio-inspired spiking neural networks (SNNs) have advantages of biological\nplausibility, event-driven sparsity, and binary activation. Recently,\nlarge-scale language models exhibit promising generalization capability, making\nit a valuable issue to explore more general spike-driven models. However, the\nbinary spikes in existing SNNs fail to encode adequate semantic information,\nplacing technological challenges for generalization. This work proposes the\nfirst fully spiking mechanism for general language tasks, including both\ndiscriminative and generative ones. Different from previous spikes with {0,1}\nlevels, we propose a more general spike formulation with bi-directional,\nelastic amplitude, and elastic frequency encoding, while still maintaining the\naddition nature of SNNs. In a single time step, the spike is enhanced by\ndirection and amplitude information; in spike frequency, a strategy to control\nspike firing rate is well designed. We plug this elastic bi-spiking mechanism\nin language modeling, named SpikeLM. It is the first time to handle general\nlanguage tasks with fully spike-driven models, which achieve much higher\naccuracy than previously possible. SpikeLM also greatly bridges the performance\ngap between SNNs and ANNs in language modeling. Our code is available at\nhttps://github.com/Xingrun-Xing/SpikeLM.", "paper_summary_zh": "朝向類似人腦的能源效率人工智慧，\n受生物啟發的脈衝神經網路 (SNN) 具有生物學可信度、事件驅動的稀疏性以及二進位元活化的優點。最近，\n大規模語言模型展現出令人滿意的概化能力，使其成為探索更多一般性脈衝驅動模型的寶貴議題。然而，\n現有 SNN 中的二進位元脈衝無法編碼足夠的語義資訊，對概化造成技術挑戰。這項工作提出針對一般語言任務的第一個完整脈衝機制，包括判別與生成任務。不同於先前具有 {0,1} 層級的脈衝，我們提出一個更通用的脈衝公式，具有雙向、彈性振幅和彈性頻率編碼，同時仍維持 SNN 的加法性質。在單一時間步驟中，脈衝會因方向和振幅資訊而增強；在脈衝頻率中，我們精心設計了一個控制脈衝發射速率的策略。我們將這個彈性雙脈衝機制插入語言模型中，稱為 SpikeLM。這是第一次使用完全脈衝驅動模型處理一般語言任務，其達到的準確度遠高於以往。SpikeLM 也大幅縮小了 SNN 和 ANN 在語言模型中的效能差距。我們的程式碼可以在 https://github.com/Xingrun-Xing/SpikeLM 取得。", "author": "Xingrun Xing et.al.", "authors": "Xingrun Xing, Zheng Zhang, Ziyi Ni, Shitao Xiao, Yiming Ju, Siqi Fan, Yequan Wang, Jiajun Zhang, Guoqi Li", "id": "2406.03287v1", "paper_url": "http://arxiv.org/abs/2406.03287v1", "repo": "https://github.com/xingrun-xing/spikelm"}}