{"2410.21627": {"publish_time": "2024-10-29", "title": "MCPDial: A Minecraft Persona-driven Dialogue Dataset", "paper_summary": "We propose a novel approach that uses large language models (LLMs) to\ngenerate persona-driven conversations between Players and Non-Player Characters\n(NPC) in games. Showcasing the application of our methodology, we introduce the\nMinecraft Persona-driven Dialogue dataset (MCPDial). Starting with a small seed\nof expert-written conversations, we employ our method to generate hundreds of\nadditional conversations. Each conversation in the dataset includes rich\ncharacter descriptions of the player and NPC. The conversations are long,\nallowing for in-depth and extensive interactions between the player and NPC.\nMCPDial extends beyond basic conversations by incorporating canonical function\ncalls (e.g. \"Call find a resource on iron ore\") between the utterances.\nFinally, we conduct a qualitative analysis of the dataset to assess its quality\nand characteristics.", "paper_summary_zh": "我們提出一個創新的方法，利用大型語言模型 (LLM) 來產生玩家與非玩家角色 (NPC) 之間以角色為導向的對話。為了展示我們方法的應用，我們引入了 Minecraft 以角色為導向的對話資料集 (MCPDial)。從一小部分由專家撰寫的對話開始，我們使用我們的方法生成了數百個額外的對話。資料集中的每個對話都包含玩家和 NPC 豐富的角色描述。這些對話很長，允許玩家和 NPC 之間進行深入且廣泛的互動。MCPDial 不僅限於基本對話，還結合了語句之間的正規函式呼叫（例如「呼叫尋找鐵礦資源」）。最後，我們對資料集進行定性分析，以評估其品質和特性。", "author": "Seyed Hossein Alavi et.al.", "authors": "Seyed Hossein Alavi, Sudha Rao, Ashutosh Adhikari, Gabriel A DesGarennes, Akanksha Malhotra, Chris Brockett, Mahmoud Adada, Raymond T. Ng, Vered Shwartz, Bill Dolan", "id": "2410.21627v1", "paper_url": "http://arxiv.org/abs/2410.21627v1", "repo": "https://github.com/salavi/MCPDial-A-Minecraft-Persona-driven-Dialogue-Dataset"}}