{"2406.00008": {"publish_time": "2024-05-16", "title": "KnowledgeHub: An end-to-end Tool for Assisted Scientific Discovery", "paper_summary": "This paper describes the KnowledgeHub tool, a scientific literature\nInformation Extraction (IE) and Question Answering (QA) pipeline. This is\nachieved by supporting the ingestion of PDF documents that are converted to\ntext and structured representations. An ontology can then be constructed where\na user defines the types of entities and relationships they want to capture. A\nbrowser-based annotation tool enables annotating the contents of the PDF\ndocuments according to the ontology. Named Entity Recognition (NER) and\nRelation Classification (RC) models can be trained on the resulting annotations\nand can be used to annotate the unannotated portion of the documents. A\nknowledge graph is constructed from these entity and relation triples which can\nbe queried to obtain insights from the data. Furthermore, we integrate a suite\nof Large Language Models (LLMs) that can be used for QA and summarisation that\nis grounded in the included documents via a retrieval component. KnowledgeHub\nis a unique tool that supports annotation, IE and QA, which gives the user full\ninsight into the knowledge discovery pipeline.", "paper_summary_zh": "本文說明 KnowledgeHub 工具，這是一個科學文獻資訊萃取 (IE) 和問答 (QA) 管線。這是透過支援將 PDF 文件轉換成文字和結構化表示法來達成。接著可以建構一個本体，使用者可以在其中定義他們想要擷取的實體和關係類型。一個基於瀏覽器的註解工具可以用來根據本体對 PDF 文件的內容進行註解。命名實體辨識 (NER) 和關係分類 (RC) 模型可以根據產生的註解進行訓練，並可用於對文件未註解的部分進行註解。從這些實體和關係三元組建構一個知識圖譜，可以查詢它以從資料中獲得洞察力。此外，我們整合了一組大型語言模型 (LLM)，可用於問答和摘要，這些模型透過擷取元件建立在包含的文件中。KnowledgeHub 是一個支援註解、IE 和 QA 的獨特工具，它讓使用者可以完全了解知識發現管線。", "author": "Shinnosuke Tanaka et.al.", "authors": "Shinnosuke Tanaka, James Barry, Vishnudev Kuruvanthodi, Movina Moses, Maxwell J. Giammona, Nathan Herr, Mohab Elkaref, Geeth De Mel", "id": "2406.00008v1", "paper_url": "http://arxiv.org/abs/2406.00008v1", "repo": "null"}}