{"2406.10221": {"publish_time": "2024-06-14", "title": "Short Film Dataset (SFD): A Benchmark for Story-Level Video Understanding", "paper_summary": "Recent advances in vision-language models have significantly propelled video\nunderstanding. Existing datasets and tasks, however, have notable limitations.\nMost datasets are confined to short videos with limited events and narrow\nnarratives. For example, datasets with instructional and egocentric videos\noften document the activities of one person in a single scene. Although some\nmovie datasets offer richer content, they are often limited to short-term\ntasks, lack publicly available videos and frequently encounter data leakage\ngiven the use of movie forums and other resources in LLM training. To address\nthe above limitations, we propose the Short Film Dataset (SFD) with 1,078\npublicly available amateur movies, a wide variety of genres and minimal data\nleakage issues. SFD offers long-term story-oriented video tasks in the form of\nmultiple-choice and open-ended question answering. Our extensive experiments\nemphasize the need for long-term reasoning to solve SFD tasks. Notably, we find\nstrong signals in movie transcripts leading to the on-par performance of people\nand LLMs. We also show significantly lower performance of current models\ncompared to people when using vision data alone.", "paper_summary_zh": "近期在視覺語言模型上的進展顯著推動了影片理解。然而，現有的資料集和任務有顯著的限制。大多數資料集僅限於事件有限且敘述狹隘的短影片。例如，包含教學和自我中心影片的資料集通常記錄單一場景中一個人的活動。儘管一些電影資料集提供了更豐富的內容，但它們通常僅限於短期任務，缺乏公開可用的影片，並且由於在 LLM 訓練中使用電影論壇和其他資源，因此經常會遇到資料外洩。為了解決上述限制，我們提出了短片資料集 (SFD)，其中包含 1,078 部公開可用的業餘電影、種類繁多且資料外洩問題最小。SFD 以多選題和開放式問答的形式提供長期的故事導向影片任務。我們廣泛的實驗強調了解決 SFD 任務需要長期推理。值得注意的是，我們在電影腳本中找到了強烈的訊號，這導致了人類和 LLM 的表現相當。我們還表明，與僅使用視覺資料相比，當前模型的表現明顯低於人類。", "author": "Ridouane Ghermi et.al.", "authors": "Ridouane Ghermi, Xi Wang, Vicky Kalogeiton, Ivan Laptev", "id": "2406.10221v1", "paper_url": "http://arxiv.org/abs/2406.10221v1", "repo": "null"}}