{"2502.05713": {"publish_time": "2025-02-08", "title": "4D VQ-GAN: Synthesising Medical Scans at Any Time Point for Personalised Disease Progression Modelling of Idiopathic Pulmonary Fibrosis", "paper_summary": "Understanding the progression trajectories of diseases is crucial for early\ndiagnosis and effective treatment planning. This is especially vital for\nlife-threatening conditions such as Idiopathic Pulmonary Fibrosis (IPF), a\nchronic, progressive lung disease with a prognosis comparable to many cancers.\nComputed tomography (CT) imaging has been established as a reliable diagnostic\ntool for IPF. Accurately predicting future CT scans of early-stage IPF patients\ncan aid in developing better treatment strategies, thereby improving survival\noutcomes. In this paper, we propose 4D Vector Quantised Generative Adversarial\nNetworks (4D-VQ-GAN), a model capable of generating realistic CT volumes of IPF\npatients at any time point. The model is trained using a two-stage approach. In\nthe first stage, a 3D-VQ-GAN is trained to reconstruct CT volumes. In the\nsecond stage, a Neural Ordinary Differential Equation (ODE) based temporal\nmodel is trained to capture the temporal dynamics of the quantised embeddings\ngenerated by the encoder in the first stage. We evaluate different\nconfigurations of our model for generating longitudinal CT scans and compare\nthe results against ground truth data, both quantitatively and qualitatively.\nFor validation, we conduct survival analysis using imaging biomarkers derived\nfrom generated CT scans and achieve a C-index comparable to that of biomarkers\nderived from the real CT scans. The survival analysis results demonstrate the\npotential clinical utility inherent to generated longitudinal CT scans, showing\nthat they can reliably predict survival outcomes.", "paper_summary_zh": "了解疾病的進程軌跡對於早期診斷和有效的治療計畫至關重要。這對於特發性肺纖維化 (IPF) 等威脅生命的疾病尤其重要，IPF 是一種慢性、進行性肺部疾病，其預後與許多癌症相當。電腦斷層掃描 (CT) 影像已被確立為 IPF 的可靠診斷工具。準確預測早期 IPF 患者的未來 CT 掃描有助於制定更好的治療策略，從而改善存活結果。在本文中，我們提出 4D 向量量化生成對抗網路 (4D-VQ-GAN)，這是一個模型，能夠在任何時間點生成 IPF 患者的逼真 CT 體積。該模型使用兩階段方法進行訓練。在第一階段，訓練 3D-VQ-GAN 以重建 CT 體積。在第二階段，訓練基於神經常微分方程 (ODE) 的時間模型，以捕捉第一階段編碼器生成的量化嵌入的時間動態。我們評估了我們的模型的不同配置，以生成縱向 CT 掃描，並在定量和定性方面將結果與真實數據進行比較。為了驗證，我們使用從生成的 CT 掃描中得出的影像生物標記進行存活分析，並獲得與從真實 CT 掃描中得出的生物標記相當的 C 指數。存活分析結果證明了生成縱向 CT 掃描固有的潛在臨床效用，表明它們可以可靠地預測存活結果。", "author": "An Zhao et.al.", "authors": "An Zhao, Moucheng Xu, Ahmed H. Shahin, Wim Wuyts, Mark G. Jones, Joseph Jacob, Daniel C. Alexander", "id": "2502.05713v1", "paper_url": "http://arxiv.org/abs/2502.05713v1", "repo": "null"}}