{"2406.02234": {"publish_time": "2024-06-04", "title": "On the Limitations of Fractal Dimension as a Measure of Generalization", "paper_summary": "Bounding and predicting the generalization gap of overparameterized neural\nnetworks remains a central open problem in theoretical machine learning. Neural\nnetwork optimization trajectories have been proposed to possess fractal\nstructure, leading to bounds and generalization measures based on notions of\nfractal dimension on these trajectories. Prominently, both the Hausdorff\ndimension and the persistent homology dimension have been proposed to correlate\nwith generalization gap, thus serving as a measure of generalization. This work\nperforms an extended evaluation of these topological generalization measures.\nWe demonstrate that fractal dimension fails to predict generalization of models\ntrained from poor initializations. We further identify that the $\\ell^2$ norm\nof the final parameter iterate, one of the simplest complexity measures in\nlearning theory, correlates more strongly with the generalization gap than\nthese notions of fractal dimension. Finally, our study reveals the intriguing\nmanifestation of model-wise double descent in persistent homology-based\ngeneralization measures. This work lays the ground for a deeper investigation\nof the causal relationships between fractal geometry, topological data\nanalysis, and neural network optimization.", "paper_summary_zh": "限制和预测过度参数化神经网络的泛化差距仍然是理论机器学习中的一个核心开放问题。神经网络优化轨迹已被提出具有分形结构，从而导致基于这些轨迹上的分形维数概念的界限和泛化度量。显着地，豪斯多夫维数和持久同调维数都被提议与泛化差距相关，因此作为泛化度量。这项工作对这些拓扑泛化度量进行了扩展评估。我们证明分形维数无法预测从较差的初始化训练的模型的泛化。我们进一步识别出最终参数迭代的 $\\ell^2$ 范数，这是学习理论中最简单的复杂度度量之一，与泛化差距的相关性比这些分形维数的概念更强。最后，我们的研究揭示了基于持久同调的泛化度量中模型级双重下降的有趣表现。这项工作为深入研究分形几何、拓扑数据分析和神经网络优化之间的因果关系奠定了基础。", "author": "Charlie Tan et.al.", "authors": "Charlie Tan, Inés García-Redondo, Qiquan Wang, Michael M. Bronstein, Anthea Monod", "id": "2406.02234v1", "paper_url": "http://arxiv.org/abs/2406.02234v1", "repo": "null"}}