{"2412.20635": {"publish_time": "2024-12-30", "title": "NetFlowGen: Leveraging Generative Pre-training for Network Traffic Dynamics", "paper_summary": "Understanding the traffic dynamics in networks is a core capability for\nautomated systems to monitor and analyze networking behaviors, reducing\nexpensive human efforts and economic risks through tasks such as traffic\nclassification, congestion prediction, and attack detection. However, it is\nstill challenging to accurately model network traffic with machine learning\napproaches in an efficient and broadly applicable manner. Task-specific models\ntrained from scratch are used for different networking applications, which\nlimits the efficiency of model development and generalization of model\ndeployment. Furthermore, while networking data is abundant, high-quality\ntask-specific labels are often insufficient for training individual models.\nLarge-scale self-supervised learning on unlabeled data provides a natural\npathway for tackling these challenges. We propose to pre-train a\ngeneral-purpose machine learning model to capture traffic dynamics with only\ntraffic data from NetFlow records, with the goal of fine-tuning for different\ndownstream tasks with small amount of labels. Our presented NetFlowGen\nframework goes beyond a proof-of-concept for network traffic pre-training and\naddresses specific challenges such as unifying network feature representations,\nlearning from large unlabeled traffic data volume, and testing on real\ndownstream tasks in DDoS attack detection. Experiments demonstrate promising\nresults of our pre-training framework on capturing traffic dynamics and\nadapting to different networking tasks.", "paper_summary_zh": "了解網路中的流量動態是自動化系統監控和分析網路行為的核心能力，透過流量分類、壅塞預測和攻擊偵測等任務，減少昂貴的人力成本和經濟風險。然而，以機器學習方法精準建模網路流量，在有效率且廣泛適用的情況下仍具有挑戰性。從頭訓練特定於任務的模型，用於不同的網路應用程式，這限制了模型開發和模型部署的概括性。此外，雖然網路資料豐富，但高品質的特定於任務的標籤通常不足以訓練個別的模型。大規模的無標籤資料自監督學習，提供了解決這些挑戰的自然途徑。我們提議預先訓練一個通用機器學習模型，僅使用 NetFlow 記錄中的流量資料來擷取流量動態，目標是微調不同下游任務，標籤量少。我們提出的 NetFlowGen 架構超越了網路流量預先訓練的概念驗證，並解決特定挑戰，例如統一網路特徵表徵、從大量的無標籤流量資料中學習，以及在 DDoS 攻擊偵測中測試真實的下游任務。實驗證明了我們的預先訓練架構在擷取流量動態和適應不同的網路任務方面，具有令人滿意的結果。", "author": "Jiawei Zhou et.al.", "authors": "Jiawei Zhou, Woojeong Kim, Zhiying Xu, Alexander M. Rush, Minlan Yu", "id": "2412.20635v1", "paper_url": "http://arxiv.org/abs/2412.20635v1", "repo": "null"}}