{"2501.04858": {"publish_time": "2025-01-08", "title": "Advancing Retrieval-Augmented Generation for Persian: Development of Language Models, Comprehensive Benchmarks, and Best Practices for Optimization", "paper_summary": "This paper examines the specific obstacles of constructing\nRetrieval-Augmented Generation(RAG) systems in low-resource languages, with a\nfocus on Persian's complicated morphology and versatile syntax. The research\naims to improve retrieval and generation accuracy by introducing\nPersian-specific models, namely MatinaRoberta(a masked language model) and\nMatinaSRoberta(a fine-tuned Sentence-BERT), along with a comprehensive\nbenchmarking framework. Three datasets-general knowledge(PQuad), scientifically\nspecialized texts, and organizational reports, were used to assess these models\nafter they were trained on a varied corpus of 73.11 billion Persian tokens. The\nmethodology involved extensive pretraining, fine-tuning with tailored loss\nfunctions, and systematic evaluations using both traditional metrics and the\nRetrieval-Augmented Generation Assessment framework. The results show that\nMatinaSRoberta outperformed previous embeddings, achieving superior contextual\nrelevance and retrieval accuracy across datasets. Temperature tweaking, chunk\nsize modifications, and document summary indexing were explored to enhance RAG\nsetups. Larger models like Llama-3.1 (70B) consistently demonstrated the\nhighest generation accuracy, while smaller models faced challenges with\ndomain-specific and formal contexts. The findings underscore the potential for\ndeveloping RAG systems in Persian through customized embeddings and\nretrieval-generation settings and highlight the enhancement of NLP applications\nsuch as search engines and legal document analysis in low-resource languages.", "paper_summary_zh": "本論文探討了在低資源語言中建構檢索增強生成 (RAG) 系統的特定障礙，重點在於波斯語複雜的形態和多功能的語法。本研究旨在透過引入波斯語特定模型，即 MatinaRoberta（一個遮罩語言模型）和 MatinaSRoberta（一個微調過的句子 BERT），以及一個全面的基準測試框架，來改善檢索和生成準確度。在對包含 731.1 億個波斯語詞彙的各種語料庫進行訓練後，使用三個資料集（一般知識 (PQuad)、科學專業文本和組織報告）來評估這些模型。該方法涉及廣泛的預訓練、使用客製化損失函數進行微調，以及使用傳統指標和檢索增強生成評估框架進行系統評估。結果顯示，MatinaSRoberta 優於先前的嵌入，在所有資料集上都達到了更高的上下文相關性和檢索準確度。探索了溫度調整、區塊大小修改和文件摘要索引以增強 RAG 設定。像 Llama-3.1 (70B) 這樣較大的模型始終展現出最高的生成準確度，而較小的模型則在特定領域和正式語境中面臨挑戰。研究結果強調了透過自訂嵌入和檢索生成設定來開發波斯語 RAG 系統的潛力，並突顯了在低資源語言中增強自然語言處理應用程式（例如搜尋引擎和法律文件分析）的重要性。", "author": "Sara Bourbour Hosseinbeigi et.al.", "authors": "Sara Bourbour Hosseinbeigi, Sina Asghari, Mohammad Ali Seif Kashani, Mohammad Hossein Shalchian, Mohammad Amin Abbasi", "id": "2501.04858v1", "paper_url": "http://arxiv.org/abs/2501.04858v1", "repo": "null"}}