{"2408.00523": {"publish_time": "2024-08-01", "title": "Jailbreaking Text-to-Image Models with LLM-Based Agents", "paper_summary": "Recent advancements have significantly improved automated task-solving\ncapabilities using autonomous agents powered by large language models (LLMs).\nHowever, most LLM-based agents focus on dialogue, programming, or specialized\ndomains, leaving gaps in addressing generative AI safety tasks. These gaps are\nprimarily due to the challenges posed by LLM hallucinations and the lack of\nclear guidelines. In this paper, we propose Atlas, an advanced LLM-based\nmulti-agent framework that integrates an efficient fuzzing workflow to target\ngenerative AI models, specifically focusing on jailbreak attacks against\ntext-to-image (T2I) models with safety filters. Atlas utilizes a\nvision-language model (VLM) to assess whether a prompt triggers the T2I model's\nsafety filter. It then iteratively collaborates with both LLM and VLM to\ngenerate an alternative prompt that bypasses the filter. Atlas also enhances\nthe reasoning abilities of LLMs in attack scenarios by leveraging multi-agent\ncommunication, in-context learning (ICL) memory mechanisms, and the\nchain-of-thought (COT) approach. Our evaluation demonstrates that Atlas\nsuccessfully jailbreaks several state-of-the-art T2I models in a black-box\nsetting, which are equipped with multi-modal safety filters. In addition, Atlas\noutperforms existing methods in both query efficiency and the quality of the\ngenerated images.", "paper_summary_zh": "<paragraph>最近的進展已經大幅改進了自動任務解決能力，使用大型語言模型（LLM）驅動的自主代理。然而，大多數基於 LLM 的代理專注於對話、程式設計或專業領域，在解決生成式 AI 安全任務方面留下了空白。這些空白主要是由於 LLM 幻覺帶來的挑戰和缺乏明確的指導方針。在本文中，我們提出 Atlas，一個基於 LLM 的先進多代理框架，它整合了一個高效的模糊測試工作流程來針對生成式 AI 模型，特別關注對具有安全過濾器的文字到圖像（T2I）模型的越獄攻擊。Atlas 利用視覺語言模型（VLM）來評估提示是否觸發了 T2I 模型的安全過濾器。然後，它與 LLM 和 VLM 進行反覆協作，以生成一個繞過過濾器的替代提示。Atlas 還通過利用多代理通信、情境學習（ICL）記憶機制和思維鏈（COT）方法，增強了 LLM 在攻擊場景中的推理能力。我們的評估表明，Atlas 在黑盒設置中成功越獄了幾個最先進的 T2I 模型，這些模型配備了多模式安全過濾器。此外，Atlas 在查詢效率和生成圖像的品質方面都優於現有方法。</paragraph>", "author": "Yingkai Dong et.al.", "authors": "Yingkai Dong, Zheng Li, Xiangtao Meng, Ning Yu, Shanqing Guo", "id": "2408.00523v1", "paper_url": "http://arxiv.org/abs/2408.00523v1", "repo": "null"}}