{"2405.12100": {"publish_time": "2024-05-20", "title": "DOP: Diagnostic-Oriented Prompting for Large Language Models in Mathematical Correction", "paper_summary": "Math world problems correction(MWPC) is a novel task dedicated to rectifying\nreasoning errors in the process of solving mathematical problems. In this\npaper, leveraging the advancements in large language models (LLMs), we address\ntwo key objectives:(1) Distinguishing between mathematical reasoning and error\ncorrection; (2) Exploring strategies to enhance the error correction\ncapabilities of LLMs in mathematics to solve MWPC task. We noticed that, in\nreal-time education,assisting students in recognizing their mistakes is more\ncrucial than simply providing correct answers. However, current research tends\nto prioritize obtaining accurate solutions to math problems rather than\ncorrecting potentially incorrect ones. Therefore, we modify the research\nparadigm, demonstrating that improving mathematical reasoning abilities does\nnot equate to mastery in error correction. Meanwhile, we propose a novel method\ncalled diagnostic-oriented promping(DOP) aimed at facilitating LLMs to excel in\nerror correction. In experiments, DOP has shown outstanding performance,\nhighlighting its significant impact. We argue that in mathematical education,\nthe demand for outstanding correctors surpasses that for proficient reasoners.\nCodes and data are available on\nhttps://github.com/ChenhaoEcnuCS/Reason-Correct.", "paper_summary_zh": "數學世界問題修正 (MWPC) 是一項新穎的任務，專門用於糾正解決數學問題過程中的推理錯誤。在本文中，利用大型語言模型 (LLM) 的進步，我們解決了兩個關鍵目標：(1) 區分數學推理和錯誤修正；(2) 探索增強 LLM 在數學中錯誤修正能力以解決 MWPC 任務的策略。我們注意到，在實時教育中，協助學生認識他們的錯誤比僅提供正確答案更為關鍵。然而，目前的研究所傾向於優先取得數學問題的準確解，而不是糾正潛在的錯誤解。因此，我們修改了研究範例，證明改進數學推理能力並不等於精通錯誤修正。同時，我們提出了一種稱為診斷導向提示 (DOP) 的新方法，旨在促進 LLM 在錯誤修正方面表現出色。在實驗中，DOP 已展現出傑出的效能，突顯其顯著影響。我們認為在數學教育中，對傑出修正者的需求超越了對熟練推理者的需求。程式碼和資料可在 https://github.com/ChenhaoEcnuCS/Reason-Correct 取得。", "author": "Hao Chen et.al.", "authors": "Hao Chen, Biaojie Zeng, Xin Lin, Liang He, Aimin Zhou", "id": "2405.12100v1", "paper_url": "http://arxiv.org/abs/2405.12100v1", "repo": "null"}}