{"2411.08521": {"publish_time": "2024-11-13", "title": "SAD-TIME: a Spatiotemporal-fused network for depression detection with Automated multi-scale Depth-wise and TIME-interval-related common feature extractor", "paper_summary": "Background and Objective: Depression is a severe mental disorder, and\naccurate diagnosis is pivotal to the cure and rehabilitation of people with\ndepression. However, the current questionnaire-based diagnostic methods could\nbring subjective biases and may be denied by subjects. In search of a more\nobjective means of diagnosis, researchers have begun to experiment with deep\nlearning-based methods for identifying depressive disorders in recent years.\nMethods: In this study, a novel Spatiotemporal-fused network with Automated\nmulti-scale Depth-wise and TIME-interval-related common feature extractor\n(SAD-TIME) is proposed. SAD-TIME incorporates an automated nodes' common\nfeatures extractor (CFE), a spatial sector (SpS), a modified temporal sector\n(TeS), and a domain adversarial learner (DAL). The CFE includes a multi-scale\ndepth-wise 1D-convolutional neural network and a time-interval embedding\ngenerator, where the unique information of each channel is preserved. The SpS\nfuses the functional connectivity with the distance-based connectivity\ncontaining spatial position of EEG electrodes. A multi-head-attention graph\nconvolutional network is also applied in the SpS to fuse the features from\ndifferent EEG channels. The TeS is based on long short-term memory and graph\ntransformer networks, where the temporal information of different time-windows\nis fused. Moreover, the DAL is used after the SpS to obtain the\ndomain-invariant feature. Results: Experimental results under tenfold\ncross-validation show that the proposed SAD-TIME method achieves 92.00% and\n94.00% depression classification accuracies on two datasets, respectively, in\ncross-subject mode. Conclusion: SAD-TIME is a robust depression detection\nmodel, where the automatedly-generated features, the SpS and the TeS assist the\nclassification performance with the fusion of the innate spatiotemporal\ninformation in the EEG signals.", "paper_summary_zh": "<paragraph>背景與目標：憂鬱症是一種嚴重的精神疾病，而準確的診斷對於憂鬱症患者的治療和復健至關重要。然而，目前基於問卷的診斷方法可能會帶來主觀偏誤，且可能遭到受試者否認。為了尋求更客觀的診斷方式，研究人員近年來開始嘗試使用基於深度學習的方法來識別憂鬱症。方法：本研究提出了一個結合自動化多尺度深度和時間間隔相關共用特徵萃取器的時空融合網路（SAD-TIME）。SAD-TIME 整合了一個自動化節點共用特徵萃取器（CFE）、一個空間區塊（SpS）、一個修改過的時間區塊（TeS）和一個領域對抗學習器（DAL）。CFE 包含一個多尺度深度 1D 捲積神經網路和一個時間間隔嵌入產生器，其中每個通道的獨特資訊都被保留下來。SpS 將功能連接與包含腦電圖電極空間位置的基於距離連接融合在一起。一個多頭注意力圖形卷積網路也應用於 SpS 中，以融合來自不同腦電圖通道的特徵。TeS 基於長期短期記憶和圖形Transformer網路，其中不同時間窗的時間資訊被融合在一起。此外，DAL 在 SpS 之後被用於獲取領域不變特徵。結果：在十倍交叉驗證下的實驗結果顯示，所提出的 SAD-TIME 方法在跨主體模式下分別在兩個資料集上達到了 92.00% 和 94.00% 的憂鬱症分類準確度。結論：SAD-TIME 是一個強大的憂鬱症檢測模型，其中自動產生的特徵、SpS 和 TeS 透過融合腦電圖訊號中固有的時空資訊來協助分類表現。</paragraph>", "author": "Han-Guang Wang et.al.", "authors": "Han-Guang Wang, Hui-Rang Hou, Li-Cheng Jin, Chen-Yang Xu, Zhong-Yi Zhang, Qing-Hao Meng", "id": "2411.08521v1", "paper_url": "http://arxiv.org/abs/2411.08521v1", "repo": "null"}}