{"2501.17330": {"publish_time": "2025-01-28", "title": "Attribution analysis of legal language as used by LLM", "paper_summary": "Three publicly-available LLM specifically designed for legal tasks have been\nimplemented and shown that classification accuracy can benefit from training\nover legal corpora, but why and how? Here we use two publicly-available legal\ndatasets, a simpler binary classification task of ``overruling'' texts, and a\nmore elaborate multiple choice task identifying ``holding'' judicial decisions.\nWe report on experiments contrasting the legal LLM and a generic BERT model for\ncomparison, against both datasets. We use integrated gradient attribution\ntechniques to impute ``causes'' of variation in the models' perfomance, and\ncharacterize them in terms of the tokenizations each use. We find that while\nall models can correctly classify some test examples from the casehold task,\nother examples can only be identified by only one, model, and attribution can\nbe used to highlight the reasons for this. We find that differential behavior\nof the models' tokenizers accounts for most of the difference and analyze these\ndifferences in terms of the legal language they process. Frequency analysis of\ntokens generated by dataset texts, combined with use of known ``stop word''\nlists, allow identification of tokens that are clear signifiers of legal\ntopics.", "paper_summary_zh": "有三個專門設計用於法律任務的公開 LLM 已實施，並顯示分類準確度可以受益於法律語料庫的訓練，但原因和方式為何？在這裡，我們使用兩個公開的法律資料集，一個較簡單的二元分類任務「推翻」文本，以及一個更精細的多選題任務，用於識別「持有」司法決定。我們報告了對比法律 LLM 和通用 BERT 模型的實驗，以針對這兩個資料集進行比較。我們使用整合梯度歸因技術來估算模型效能變化的「原因」，並根據每個模型使用的標記化來描述它們。我們發現，雖然所有模型都可以正確分類案例持有任務中的一些測試範例，但其他範例只能由一個模型識別，而歸因可用於強調這樣做的原因。我們發現，模型標記器的差異行為解釋了大部分差異，並根據它們處理的法律語言分析這些差異。資料集文本產生的標記的頻率分析，結合使用已知的「停止詞」清單，可以識別出法律主題的明確標記。", "author": "Richard K. Belew et.al.", "authors": "Richard K. Belew", "id": "2501.17330v1", "paper_url": "http://arxiv.org/abs/2501.17330v1", "repo": "null"}}