{"2410.18889": {"publish_time": "2024-10-24", "title": "Are LLMs Better than Reported? Detecting Label Errors and Mitigating Their Effect on Model Performance", "paper_summary": "NLP benchmarks rely on standardized datasets for training and evaluating\nmodels and are crucial for advancing the field. Traditionally, expert\nannotations ensure high-quality labels; however, the cost of expert annotation\ndoes not scale well with the growing demand for larger datasets required by\nmodern models. While crowd-sourcing provides a more scalable solution, it often\ncomes at the expense of annotation precision and consistency. Recent\nadvancements in large language models (LLMs) offer new opportunities to enhance\nthe annotation process, particularly for detecting label errors in existing\ndatasets. In this work, we consider the recent approach of LLM-as-a-judge,\nleveraging an ensemble of LLMs to flag potentially mislabeled examples. Through\na case study of four datasets from the TRUE benchmark, covering different tasks\nand domains, we empirically analyze the labeling quality of existing datasets,\nand compare expert, crowd-sourced, and our LLM-based annotations in terms of\nagreement, label quality, and efficiency, demonstrating the strengths and\nlimitations of each annotation method. Our findings reveal a substantial number\nof label errors, which, when corrected, induce a significant upward shift in\nreported model performance. This suggests that many of the LLMs so-called\nmistakes are due to label errors rather than genuine model failures.\nAdditionally, we discuss the implications of mislabeled data and propose\nmethods to mitigate them in training to improve model performance.", "paper_summary_zh": "NLP 基準依賴標準化資料集進行訓練和評估模型，對於推動領域進步至關重要。傳統上，專家註解可確保高品質標籤；然而，專家註解的成本無法隨著現代模型所需較大型資料集的成長需求而良好擴充。群眾外包雖然提供了較具擴充性的解決方案，但通常會犧牲註解精準度和一致性。大型語言模型 (LLM) 的最新進展提供了增強註解程序的新機會，特別是對於偵測現有資料集中標籤錯誤。在這項工作中，我們考慮了 LLM 作為評判的最新方法，利用 LLM 組合標記潛在標籤錯誤的範例。透過 TRUE 基準中四個資料集的案例研究，涵蓋不同的任務和領域，我們根據一致性、標籤品質和效率，實證分析現有資料集的標籤品質，並比較專家、群眾外包和我們基於 LLM 的註解，說明每種註解方法的優勢和限制。我們的發現揭露了大量標籤錯誤，在更正這些錯誤後，會導致報告的模型效能大幅向上提升。這表示許多所謂的 LLM 錯誤，其實是標籤錯誤，而非真正的模型失誤。此外，我們討論了標籤錯誤資料的影響，並提出減輕這些錯誤的方法，以在訓練中改善模型效能。", "author": "Omer Nahum et.al.", "authors": "Omer Nahum, Nitay Calderon, Orgad Keller, Idan Szpektor, Roi Reichart", "id": "2410.18889v1", "paper_url": "http://arxiv.org/abs/2410.18889v1", "repo": "null"}}