{"2412.19140": {"publish_time": "2024-12-26", "title": "SILC-EFSA: Self-aware In-context Learning Correction for Entity-level Financial Sentiment Analysis", "paper_summary": "In recent years, fine-grained sentiment analysis in finance has gained\nsignificant attention, but the scarcity of entity-level datasets remains a key\nchallenge. To address this, we have constructed the largest English and Chinese\nfinancial entity-level sentiment analysis datasets to date. Building on this\nfoundation, we propose a novel two-stage sentiment analysis approach called\nSelf-aware In-context Learning Correction (SILC). The first stage involves\nfine-tuning a base large language model to generate pseudo-labeled data\nspecific to our task. In the second stage, we train a correction model using a\nGNN-based example retriever, which is informed by the pseudo-labeled data. This\ntwo-stage strategy has allowed us to achieve state-of-the-art performance on\nthe newly constructed datasets, advancing the field of financial sentiment\nanalysis. In a case study, we demonstrate the enhanced practical utility of our\ndata and methods in monitoring the cryptocurrency market. Our datasets and code\nare available at https://github.com/NLP-Bin/SILC-EFSA.", "paper_summary_zh": "近年來，金融領域的細粒度情緒分析備受關注，但實體層級資料集的稀缺仍然是一個關鍵挑戰。為了解決這個問題，我們構建了迄今為止最大的英文和中文金融實體層級情緒分析資料集。在此基礎上，我們提出了一種新穎的兩階段情緒分析方法，稱為自知脈絡學習校正 (SILC)。第一階段涉及微調基礎大型語言模型，以產生特定於我們任務的偽標籤資料。在第二階段，我們使用 GNN 為基礎的範例檢索器訓練一個校正模型，該模型由偽標籤資料提供資訊。這種兩階段策略使我們能夠在新建的資料集上實現最先進的效能，推動金融情緒分析領域的發展。在一個案例研究中，我們展示了我們的資料和方法在監控加密貨幣市場方面的增強實用性。我們的資料集和程式碼可在 https://github.com/NLP-Bin/SILC-EFSA 上取得。", "author": "Senbin Zhu et.al.", "authors": "Senbin Zhu, Chenyuan He, Hongde Liu, Pengcheng Dong, Hanjie Zhao, Yuchen Yan, Yuxiang Jia, Hongying Zan, Min Peng", "id": "2412.19140v1", "paper_url": "http://arxiv.org/abs/2412.19140v1", "repo": "null"}}