{"2405.06258": {"publish_time": "2024-05-10", "title": "Automatic Generation of Model and Data Cards: A Step Towards Responsible AI", "paper_summary": "In an era of model and data proliferation in machine learning/AI especially\nmarked by the rapid advancement of open-sourced technologies, there arises a\ncritical need for standardized consistent documentation. Our work addresses the\ninformation incompleteness in current human-generated model and data cards. We\npropose an automated generation approach using Large Language Models (LLMs).\nOur key contributions include the establishment of CardBench, a comprehensive\ndataset aggregated from over 4.8k model cards and 1.4k data cards, coupled with\nthe development of the CardGen pipeline comprising a two-step retrieval\nprocess. Our approach exhibits enhanced completeness, objectivity, and\nfaithfulness in generated model and data cards, a significant step in\nresponsible AI documentation practices ensuring better accountability and\ntraceability.", "paper_summary_zh": "在機器學習/AI 中，模型和資料激增的時代，特別是標誌著開源技術的快速進步，出現了對標準化一致文件編寫的關鍵需求。我們的研究解決了當前人類產生的模型和資料卡中資訊不完整的問題。我們提出使用大型語言模型 (LLM) 的自動化生成方法。我們的關鍵貢獻包括建立 CardBench，一個從超過 4.8k 個模型卡和 1.4k 個資料卡彙總而成的綜合資料集，並結合 CardGen 管道的開發，其中包含兩步驟檢索程序。我們的做法在產生的模型和資料卡中展現出增強的完整性、客觀性和忠實度，這是負責任的 AI 文件編寫實務中的一個重要步驟，可確保更好的問責制和可追溯性。", "author": "Jiarui Liu et.al.", "authors": "Jiarui Liu, Wenkai Li, Zhijing Jin, Mona Diab", "id": "2405.06258v1", "paper_url": "http://arxiv.org/abs/2405.06258v1", "repo": "null"}}