{"2405.05478": {"publish_time": "2024-05-09", "title": "Using Machine Translation to Augment Multilingual Classification", "paper_summary": "An all-too-present bottleneck for text classification model development is\nthe need to annotate training data and this need is multiplied for multilingual\nclassifiers. Fortunately, contemporary machine translation models are both\neasily accessible and have dependable translation quality, making it possible\nto translate labeled training data from one language into another. Here, we\nexplore the effects of using machine translation to fine-tune a multilingual\nmodel for a classification task across multiple languages. We also investigate\nthe benefits of using a novel technique, originally proposed in the field of\nimage captioning, to account for potential negative effects of tuning models on\ntranslated data. We show that translated data are of sufficient quality to tune\nmultilingual classifiers and that this novel loss technique is able to offer\nsome improvement over models tuned without it.", "paper_summary_zh": "文本分類模型開發中一個經常出現的瓶頸是\n標註訓練資料的需求，而這個需求對於多語言\n分類器來說會成倍增加。幸運的是，現代機器翻譯模型既容易取得，\n翻譯品質又可靠，這使得將標籤訓練資料從一種語言翻譯成另一種語言成為可能。在這裡，我們\n探討使用機器翻譯微調多語言模型以進行跨多種語言的分類任務的效果。我們也研究\n使用一種新技術的好處，該技術最初在影像字幕領域中提出，用於考量在翻譯資料上微調模型的潛在負面影響。我們證明翻譯資料品質足夠好，可以微調\n多語言分類器，而且這個新損失技術能夠提供比未經微調的模型更好的效果。", "author": "Adam King et.al.", "authors": "Adam King", "id": "2405.05478v1", "paper_url": "http://arxiv.org/abs/2405.05478v1", "repo": "null"}}