{"2408.10647": {"publish_time": "2024-08-20", "title": "Privacy-preserving Universal Adversarial Defense for Black-box Models", "paper_summary": "Deep neural networks (DNNs) are increasingly used in critical applications\nsuch as identity authentication and autonomous driving, where robustness\nagainst adversarial attacks is crucial. These attacks can exploit minor\nperturbations to cause significant prediction errors, making it essential to\nenhance the resilience of DNNs. Traditional defense methods often rely on\naccess to detailed model information, which raises privacy concerns, as model\nowners may be reluctant to share such data. In contrast, existing black-box\ndefense methods fail to offer a universal defense against various types of\nadversarial attacks. To address these challenges, we introduce DUCD, a\nuniversal black-box defense method that does not require access to the target\nmodel's parameters or architecture. Our approach involves distilling the target\nmodel by querying it with data, creating a white-box surrogate while preserving\ndata privacy. We further enhance this surrogate model using a certified defense\nbased on randomized smoothing and optimized noise selection, enabling robust\ndefense against a broad range of adversarial attacks. Comparative evaluations\nbetween the certified defenses of the surrogate and target models demonstrate\nthe effectiveness of our approach. Experiments on multiple image classification\ndatasets show that DUCD not only outperforms existing black-box defenses but\nalso matches the accuracy of white-box defenses, all while enhancing data\nprivacy and reducing the success rate of membership inference attacks.", "paper_summary_zh": "深度神经網路 (DNN) 愈來愈常使用在身分驗證和自動駕駛等關鍵應用中，在這些應用中，對抗攻擊的穩健性至關重要。這些攻擊可以利用輕微的擾動來造成顯著的預測錯誤，因此加強 DNN 的復原力至關重要。傳統的防禦方法通常依賴於取得詳細的模型資訊，這會引發隱私問題，因為模型所有者可能不願意分享這些資料。相反地，現有的黑盒防禦方法無法對各種類型的對抗攻擊提供通用的防禦。為了應對這些挑戰，我們引入了 DUCD，這是一種通用的黑盒防禦方法，不需要取得目標模型的參數或架構。我們的作法涉及透過資料查詢來萃取目標模型，在保留資料隱私的同時建立白盒代理。我們進一步使用基於隨機平滑和最佳化雜訊選擇的認證防禦來增強這個代理模型，進而對廣泛的對抗攻擊提供穩健的防禦。代理模型和目標模型的認證防禦之間的比較評估證明了我們方法的有效性。在多個影像分類資料集上的實驗顯示，DUCD 不僅優於現有的黑盒防禦，而且也符合白盒防禦的準確度，同時增強資料隱私並降低成員身分推論攻擊的成功率。", "author": "Qiao Li et.al.", "authors": "Qiao Li, Cong Wu, Jing Chen, Zijun Zhang, Kun He, Ruiying Du, Xinxin Wang, Qingchuang Zhao, Yang Liu", "id": "2408.10647v1", "paper_url": "http://arxiv.org/abs/2408.10647v1", "repo": "null"}}