{"2501.17840": {"publish_time": "2025-01-29", "title": "Learning Beyond the Surface: How Far Can Continual Pre-Training with LoRA Enhance LLMs' Domain-Specific Insight Learning?", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable performance on\nvarious tasks, yet their ability to extract and internalize deeper insights\nfrom domain-specific datasets remains underexplored. In this study, we\ninvestigate how continual pre-training can enhance LLMs' capacity for insight\nlearning across three distinct forms: declarative, statistical, and\nprobabilistic insights. Focusing on two critical domains: medicine and finance,\nwe employ LoRA to train LLMs on two existing datasets. To evaluate each insight\ntype, we create benchmarks to measure how well continual pre-training helps\nmodels go beyond surface-level knowledge. We also assess the impact of document\nmodification on capturing insights. The results show that, while continual\npre-training on original documents has a marginal effect, modifying documents\nto retain only essential information significantly enhances the\ninsight-learning capabilities of LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種任務中展現出非凡的表現，但它們從特定領域的資料集中萃取和內化更深入見解的能力仍未被充分探討。在本研究中，我們探討持續預訓練如何增強 LLM 在三種不同形式的見解學習能力：宣告式、統計式和機率式見解。我們專注於兩個重要的領域：醫學和金融，並使用 LoRA 在兩個現有資料集上訓練 LLM。為了評估每種類型的見解，我們建立基準來衡量持續預訓練如何幫助模型超越表面層面的知識。我們也評估文件修改對擷取見解的影響。結果顯示，雖然在原始文件上進行持續預訓練的效果有限，但修改文件以僅保留必要資訊，可以顯著增強 LLM 的見解學習能力。", "author": "Pouya Pezeshkpour et.al.", "authors": "Pouya Pezeshkpour, Estevam Hruschka", "id": "2501.17840v1", "paper_url": "http://arxiv.org/abs/2501.17840v1", "repo": "https://github.com/megagonlabs/insight_miner"}}