{"2504.21800": {"publish_time": "2025-04-30", "title": "How Real Are Synthetic Therapy Conversations? Evaluating Fidelity in Prolonged Exposure Dialogues", "paper_summary": "The growing adoption of synthetic data in healthcare is driven by privacy\nconcerns, limited access to real-world data, and the high cost of annotation.\nThis work explores the use of synthetic Prolonged Exposure (PE) therapeutic\nconversations for Post-Traumatic Stress Disorder (PTSD) as a scalable\nalternative for training and evaluating clinical models. We systematically\ncompare real and synthetic dialogues using linguistic, structural, and\nprotocol-specific metrics, including turn-taking patterns and treatment\nfidelity. We also introduce and evaluate PE-specific metrics derived from\nlinguistic analysis and semantic modeling, offering a novel framework for\nassessing clinical fidelity beyond surface fluency. Our findings show that\nalthough synthetic data holds promise for mitigating data scarcity and\nprotecting patient privacy, it can struggle to capture the subtle dynamics of\ntherapeutic interactions. Synthetic therapy dialogues closely match structural\nfeatures of real-world conversations (e.g., speaker switch ratio: 0.98 vs.\n0.99); however, they may not adequately reflect key fidelity markers (e.g.,\ndistress monitoring). We highlight gaps in existing evaluation frameworks and\nadvocate for fidelity-aware metrics that go beyond surface fluency to uncover\nclinically significant failures. Our findings clarify where synthetic data can\neffectively complement real-world datasets -- and where critical limitations\nremain.", "paper_summary_zh": "<paragraph>由於隱私問題、現實世界數據的有限存取以及高昂的標註成本，醫療保健領域中合成數據的採用率不斷增長。這項工作探討了使用合成延長暴露療法 (PE) 治療創傷後壓力症候群 (PTSD) 的對話，作為訓練和評估臨床模型的可擴展替代方案。我們使用語言、結構和特定協議的指標，包括輪流模式和治療保真度，系統地比較了真實和合成對話。我們還引入並評估了源自語言分析和語義建模的 PE 特定指標，提供了一個新的框架來評估表面流利度之外的臨床保真度。我們的研究結果表明，儘管合成數據有望緩解數據稀缺性和保護患者隱私，但它難以捕捉治療互動中的微妙動態。合成治療對話與現實世界對話的結構特徵非常匹配（例如，說話者切換比率：0.98 vs. 0.99）；然而，它們可能無法充分反映關鍵的保真度標記（例如，痛苦監測）。我們強調了現有評估框架中的差距，並提倡使用超越表面流利度的保真度感知指標，以揭示臨床上顯著的缺陷。我們的研究結果闡明了合成數據可以在哪些方面有效地補充現實世界數據集，以及哪些方面仍然存在關鍵限制。</paragraph>\n", "author": "Suhas BN et.al.", "authors": "Suhas BN, Dominik Mattioli, Saeed Abdullah, Rosa I. Arriaga, Chris W. Wiese, Andrew M. Sherrill", "id": "2504.21800v2", "paper_url": "http://arxiv.org/abs/2504.21800v2", "repo": "null"}}