{"2502.15652": {"publish_time": "2025-02-21", "title": "Empowering LLMs with Logical Reasoning: A Comprehensive Survey", "paper_summary": "Large language models (LLMs) have achieved remarkable successes on various\nnatural language tasks. However, recent studies have found that there are still\nsignificant challenges to the logical reasoning abilities of LLMs. This paper\nsummarizes and categorizes the main challenges into two aspects: (1) Logical\nquestion answering, LLMs often fail to generate the correct answer within\ncomplex logical problem which requires sophisticated deductive, inductive or\nabductive reasoning given a collection of premises and constrains. (2) Logical\nconsistency, LLMs are prone to producing responses contradicting themselves\nacross different questions. For example, a state-of-the-art Macaw\nquestion-answering LLM answers Yes to both questions Is a magpie a bird? and\nDoes a bird have wings? but answers No to Does a magpie have wings?. To\nfacilitate this research direction, we comprehensively investigate the most\ncutting-edge methods and propose detailed taxonomies of these methods.\nSpecifically, to accurately answer complex logic questions, previous methods\ncan be categorized based on reliance on external solvers, prompts, pretraining,\nand fine-tuning. To avoid logical contradictions, we discuss concepts and\nsolutions of various logical consistencies, including implication, negation,\ntransitivity, factuality consistency, and their composites. In addition, we\nreview commonly used benchmark datasets and evaluation metrics, and discuss\npromising research directions, such as extensions to modal logic to account for\nuncertainty, and efficient algorithms satisfying multiple logical consistencies\nsimultaneously.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種自然語言任務中取得顯著成功。然而，最近的研究發現，LLM 的邏輯推理能力仍存在重大挑戰。本文將主要挑戰歸納並分類為兩個方面：(1) 邏輯問答，LLM 通常無法在需要複雜演繹、歸納或 Abductive 推理的複雜邏輯問題中產生正確答案，並給出一組前提和約束。(2) 邏輯一致性，LLM 容易產生在不同問題中自相矛盾的回應。例如，最先進的 Macaw 問答 LLM 對問題「喜鵲是鳥嗎？」和「鳥有翅膀嗎？」都回答「是」，但對「喜鵲有翅膀嗎？」卻回答「否」。為了促進這個研究方向，我們全面調查最前沿的方法，並提出這些方法的詳細分類。具體來說，為了準確回答複雜的邏輯問題，先前的可以根據對外部求解器、提示、預訓練和微調的依賴程度進行分類。為了避免邏輯矛盾，我們討論了各種邏輯一致性的概念和解決方案，包括蘊涵、否定、遞移性、事實一致性及其複合體。此外，我們回顧了常用的基準資料集和評估指標，並討論了有希望的研究方向，例如模態邏輯的擴展以考慮不確定性，以及同時滿足多個邏輯一致性的有效演算法。", "author": "Fengxiang Cheng et.al.", "authors": "Fengxiang Cheng, Haoxuan Li, Fenrong Liu, Robert van Rooij, Kun Zhang, Zhouchen Lin", "id": "2502.15652v1", "paper_url": "http://arxiv.org/abs/2502.15652v1", "repo": "null"}}