{"2407.06778": {"publish_time": "2024-07-09", "title": "A BERT-based Empirical Study of Privacy Policies' Compliance with GDPR", "paper_summary": "Since its implementation in May 2018, the General Data Protection Regulation\n(GDPR) has prompted businesses to revisit and revise their data handling\npractices to ensure compliance. The privacy policy, which serves as the primary\nmeans of informing users about their privacy rights and the data practices of\ncompanies, has been significantly updated by numerous businesses post-GDPR\nimplementation. However, many privacy policies remain packed with technical\njargon, lengthy explanations, and vague descriptions of data practices and user\nrights. This makes it a challenging task for users and regulatory authorities\nto manually verify the GDPR compliance of these privacy policies. In this\nstudy, we aim to address the challenge of compliance analysis between GDPR\n(Article 13) and privacy policies for 5G networks. We manually collected\nprivacy policies from almost 70 different 5G MNOs, and we utilized an automated\nBERT-based model for classification. We show that an encouraging 51$\\%$ of\ncompanies demonstrate a strong adherence to GDPR. In addition, we present the\nfirst study that provides current empirical evidence on the readability of\nprivacy policies for 5G network. we adopted readability analysis toolset that\nincorporates various established readability metrics. The findings empirically\nshow that the readability of the majority of current privacy policies remains a\nsignificant challenge. Hence, 5G providers need to invest considerable effort\ninto revising these documents to enhance both their utility and the overall\nuser experience.", "paper_summary_zh": "自 2018 年 5 月實施以來，一般資料保護規範 (GDPR) 已促使企業重新檢視並修改其資料處理實務，以確保合規性。在 GDPR 實施後，許多企業已大幅更新隱私權政策，此政策作為告知使用者其隱私權利和公司資料實務的主要方式。然而，許多隱私權政策仍充斥著技術術語、冗長的說明和對資料實務和使用者權利的模糊描述。這使得使用者和監管機關難以手動驗證這些隱私權政策的 GDPR 合規性。在本研究中，我們旨在解決 GDPR（第 13 條）和 5G 網路的隱私權政策之間的合規性分析挑戰。我們手動收集了來自近 70 家不同的 5G MNO 的隱私權政策，並利用基於 BERT 的自動化模型進行分類。我們證明，51% 的公司表現出強烈遵守 GDPR。此外，我們提出了第一個針對 5G 網路隱私權政策的可讀性提供當前實證證據的研究。我們採用了包含各種既定可讀性指標的可讀性分析工具組。研究結果實證顯示，當前大多數隱私權政策的可讀性仍然是一項重大挑戰。因此，5G 供應商需要投入相當大的精力來修改這些文件，以提高其效用和整體使用者體驗。", "author": "Lu Zhang et.al.", "authors": "Lu Zhang, Nabil Moukafih, Hamad Alamri, Gregory Epiphaniou, Carsten Maple", "id": "2407.06778v1", "paper_url": "http://arxiv.org/abs/2407.06778v1", "repo": "null"}}