{"2501.01305": {"publish_time": "2025-01-02", "title": "Large Language Models for Mental Health Diagnostic Assessments: Exploring The Potential of Large Language Models for Assisting with Mental Health Diagnostic Assessments -- The Depression and Anxiety Case", "paper_summary": "Large language models (LLMs) are increasingly attracting the attention of\nhealthcare professionals for their potential to assist in diagnostic\nassessments, which could alleviate the strain on the healthcare system caused\nby a high patient load and a shortage of providers. For LLMs to be effective in\nsupporting diagnostic assessments, it is essential that they closely replicate\nthe standard diagnostic procedures used by clinicians. In this paper, we\nspecifically examine the diagnostic assessment processes described in the\nPatient Health Questionnaire-9 (PHQ-9) for major depressive disorder (MDD) and\nthe Generalized Anxiety Disorder-7 (GAD-7) questionnaire for generalized\nanxiety disorder (GAD). We investigate various prompting and fine-tuning\ntechniques to guide both proprietary and open-source LLMs in adhering to these\nprocesses, and we evaluate the agreement between LLM-generated diagnostic\noutcomes and expert-validated ground truth. For fine-tuning, we utilize the\nMentalllama and Llama models, while for prompting, we experiment with\nproprietary models like GPT-3.5 and GPT-4o, as well as open-source models such\nas llama-3.1-8b and mixtral-8x7b.", "paper_summary_zh": "大型語言模型（LLM）越來越受到醫療保健專業人士的關注，因為它們有可能協助診斷評估，這可以減輕由高患者負擔和提供者短缺造成的醫療保健系統壓力。對於 LLM 在支持診斷評估方面能發揮作用，至關重要的是它們必須嚴格複製臨床醫生使用的標準診斷程序。在本文中，我們特別檢查了主要憂鬱症（MDD）的患者健康問卷-9（PHQ-9）和廣泛性焦慮症（GAD）的廣泛性焦慮症-7（GAD-7）問卷中描述的診斷評估程序。我們研究了各種提示和微調技術，以指導專有和開源 LLM 遵循這些程序，並且我們評估了 LLM 生成的診斷結果與專家驗證的地面真實性之間的一致性。對於微調，我們利用了 Mentalllama 和 Llama 模型，而對於提示，我們嘗試了專有模型，如 GPT-3.5 和 GPT-4o，以及開源模型，如 llama-3.1-8b 和 mixtral-8x7b。", "author": "Kaushik Roy et.al.", "authors": "Kaushik Roy, Harshul Surana, Darssan Eswaramoorthi, Yuxin Zi, Vedant Palit, Ritvik Garimella, Amit Sheth", "id": "2501.01305v1", "paper_url": "http://arxiv.org/abs/2501.01305v1", "repo": "null"}}