{"2405.01886": {"publish_time": "2024-05-03", "title": "Aloe: A Family of Fine-tuned Open Healthcare LLMs", "paper_summary": "As the capabilities of Large Language Models (LLMs) in healthcare and\nmedicine continue to advance, there is a growing need for competitive\nopen-source models that can safeguard public interest. With the increasing\navailability of highly competitive open base models, the impact of continued\npre-training is increasingly uncertain. In this work, we explore the role of\ninstruct tuning, model merging, alignment, red teaming and advanced inference\nschemes, as means to improve current open models. To that end, we introduce the\nAloe family, a set of open medical LLMs highly competitive within its scale\nrange. Aloe models are trained on the current best base models (Mistral, LLaMA\n3), using a new custom dataset which combines public data sources improved with\nsynthetic Chain of Thought (CoT). Aloe models undergo an alignment phase,\nbecoming one of the first few policy-aligned open healthcare LLM using Direct\nPreference Optimization, setting a new standard for ethical performance in\nhealthcare LLMs. Model evaluation expands to include various bias and toxicity\ndatasets, a dedicated red teaming effort, and a much-needed risk assessment for\nhealthcare LLMs. Finally, to explore the limits of current LLMs in inference,\nwe study several advanced prompt engineering strategies to boost performance\nacross benchmarks, yielding state-of-the-art results for open healthcare 7B\nLLMs, unprecedented at this scale.", "paper_summary_zh": "隨著大型語言模型 (LLM) 在醫療保健和醫學領域的能力持續進步，對於能保障公共利益的競爭性開源模型的需求也與日俱增。隨著極具競爭力的開放基礎模型越來越普及，持續預訓練的影響越來越不確定。在這項工作中，我們探討了指令微調、模型合併、校準、紅隊和先進推論架構在改善當前開放模型中的角色。為此，我們推出了 Aloe 系列，這是一組在規模範圍內極具競爭力的開放式醫療 LLM。Aloe 模型使用新的自訂資料集訓練於當前最佳基礎模型（Mistral、LLaMA 3），該資料集結合了使用合成思維鏈 (CoT) 改進的公開資料來源。Aloe 模型會經歷一個校準階段，成為使用直接偏好最佳化的第一批政策校準開放式醫療保健 LLM 之一，為醫療保健 LLM 的道德表現樹立了新的標準。模型評估擴展到包括各種偏見和毒性資料集、專門的紅隊工作，以及醫療保健 LLM 急需的風險評估。最後，為了探索當前 LLM 在推論中的極限，我們研究了幾種先進的提示工程策略，以提升基準測試的效能，產生開放式醫療保健 7B LLM 的最新結果，在這個規模中前所未見。", "author": "Ashwin Kumar Gururajan et.al.", "authors": "Ashwin Kumar Gururajan, Enrique Lopez-Cuena, Jordi Bayarri-Planas, Adrian Tormos, Daniel Hinjos, Pablo Bernabeu-Perez, Anna Arias-Duart, Pablo Agustin Martin-Torres, Lucia Urcelay-Ganzabal, Marta Gonzalez-Mallo, Sergio Alvarez-Napagao, Eduard Ayguadé-Parra, Ulises Cortés Dario Garcia-Gasulla", "id": "2405.01886v1", "paper_url": "http://arxiv.org/abs/2405.01886v1", "repo": "null"}}