{"2412.12639": {"publish_time": "2024-12-17", "title": "Falcon: Faster and Parallel Inference of Large Language Models through Enhanced Semi-Autoregressive Drafting and Custom-Designed Decoding Tree", "paper_summary": "Striking an optimal balance between minimal drafting latency and high\nspeculation accuracy to enhance the inference speed of Large Language Models\nremains a significant challenge in speculative decoding. In this paper, we\nintroduce Falcon, an innovative semi-autoregressive speculative decoding\nframework fashioned to augment both the drafter's parallelism and output\nquality. Falcon incorporates the Coupled Sequential Glancing Distillation\ntechnique, which fortifies inter-token dependencies within the same block,\nleading to increased speculation accuracy. We offer a comprehensive theoretical\nanalysis to illuminate the underlying mechanisms. Additionally, we introduce a\nCustom-Designed Decoding Tree, which permits the drafter to generate multiple\ntokens in a single forward pass and accommodates multiple forward passes as\nneeded, thereby boosting the number of drafted tokens and significantly\nimproving the overall acceptance rate. Comprehensive evaluations on benchmark\ndatasets such as MT-Bench, HumanEval, and GSM8K demonstrate Falcon's superior\nacceleration capabilities. The framework achieves a lossless speedup ratio\nranging from 2.91x to 3.51x when tested on the Vicuna and LLaMA2-Chat model\nseries. These results outstrip existing speculative decoding methods for LLMs,\nincluding Eagle, Medusa, Lookahead, SPS, and PLD, while maintaining a compact\ndrafter architecture equivalent to merely two Transformer layers.", "paper_summary_zh": "<paragraph>在推測性解碼中，在最小的起草延遲和高推測準確性之間取得最佳平衡以提高大語言模型的推論速度仍然是一項重大挑戰。在本文中，我們介紹了 Falcon，一個創新的半自迴歸推測性解碼框架，旨在同時增加起草者的並行性和輸出品質。Falcon 結合了耦合順序掃描蒸餾技術，該技術強化了同一個區塊內的令牌間依賴性，從而提高了推測準確性。我們提供了一份全面的理論分析來闡明其底層機制。此外，我們還引入了一個客製化設計的解碼樹，它允許起草者在單一的正向傳遞中生成多個令牌，並根據需要容納多個正向傳遞，從而增加了起草令牌的數量，並顯著提高了整體接受率。在 MT-Bench、HumanEval 和 GSM8K 等基準數據集上的全面評估證明了 Falcon 優越的加速能力。在 Vicuna 和 LLaMA2-Chat 模型系列上進行測試時，該框架實現了 2.91 倍到 3.51 倍的無損加速比。這些結果超越了現有的 LLM 推測性解碼方法，包括 Eagle、Medusa、Lookahead、SPS 和 PLD，同時保持了一個僅等於兩個 Transformer 層的緊湊起草架構。</paragraph>", "author": "Xiangxiang Gao et.al.", "authors": "Xiangxiang Gao, Weisheng Xie, Yiwei Xiang, Feng Ji", "id": "2412.12639v1", "paper_url": "http://arxiv.org/abs/2412.12639v1", "repo": "null"}}