{"2502.03654": {"publish_time": "2025-02-05", "title": "Gompertz Linear Units: Leveraging Asymmetry for Enhanced Learning Dynamics", "paper_summary": "Activation functions are fundamental elements of deep learning architectures\nas they significantly influence training dynamics. ReLU, while widely used, is\nprone to the dying neuron problem, which has been mitigated by variants such as\nLeakyReLU, PReLU, and ELU that better handle negative neuron outputs. Recently,\nself-gated activations like GELU and Swish have emerged as state-of-the-art\nalternatives, leveraging their smoothness to ensure stable gradient flow and\nprevent neuron inactivity. In this work, we introduce the Gompertz Linear Unit\n(GoLU), a novel self-gated activation function defined as $\\mathrm{GoLU}(x) = x\n\\, \\mathrm{Gompertz}(x)$, where $\\mathrm{Gompertz}(x) = e^{-e^{-x}}$. The GoLU\nactivation leverages the asymmetry in the Gompertz function to reduce variance\nin the latent space more effectively compared to GELU and Swish, while\npreserving robust gradient flow. Extensive experiments across diverse tasks,\nincluding Image Classification, Language Modeling, Semantic Segmentation,\nObject Detection, Instance Segmentation, and Diffusion, highlight GoLU's\nsuperior performance relative to state-of-the-art activation functions,\nestablishing GoLU as a robust alternative to existing activation functions.", "paper_summary_zh": "激活函數是深度學習架構的基本元素，因為它們會顯著影響訓練動態。ReLU 雖然廣泛使用，但容易發生神經元死亡問題，而 LeakyReLU、PReLU 和 ELU 等變體已減輕了此問題，它們能更好地處理負神經元輸出。最近，像 GELU 和 Swish 這樣的自門控激活函數已成為最先進的替代方案，利用它們的平滑性來確保穩定的梯度流動並防止神經元不活躍。在這項工作中，我們引入了 Gompertz 線性單元 (GoLU)，這是一種新穎的自門控激活函數，定義為 $\\mathrm{GoLU}(x) = x \\, \\mathrm{Gompertz}(x)$，其中 $\\mathrm{Gompertz}(x) = e^{-e^{-x}}$。GoLU 激活函數利用 Gompertz 函數中的不對稱性，與 GELU 和 Swish 相比，更有效地減少潛在空間中的變異，同時保留穩健的梯度流動。在各種任務中的廣泛實驗，包括影像分類、語言建模、語義分割、物件偵測、實例分割和擴散，突顯了 GoLU 相對於最先進的激活函數的優異效能，確立了 GoLU 作為現有激活函數的穩健替代方案。", "author": "Indrashis Das et.al.", "authors": "Indrashis Das, Mahmoud Safari, Steven Adriaensen, Frank Hutter", "id": "2502.03654v1", "paper_url": "http://arxiv.org/abs/2502.03654v1", "repo": "null"}}