{"2408.02288": {"publish_time": "2024-08-05", "title": "Spin glass model of in-context learning", "paper_summary": "Large language models show a surprising in-context learning ability -- being\nable to use a prompt to form a prediction for a query, yet without additional\ntraining, in stark contrast to old-fashioned supervised learning. Providing a\nmechanistic interpretation and linking the empirical phenomenon to physics are\nthus challenging and remain unsolved. We study a simple yet expressive\ntransformer with linear attention, and map this structure to a spin glass model\nwith real-valued spins, where the couplings and fields explain the intrinsic\ndisorder in data. The spin glass model explains how the weight parameters\ninteract with each other during pre-training, and most importantly why an\nunseen function can be predicted by providing only a prompt yet without\ntraining. Our theory reveals that for single instance learning, increasing the\ntask diversity leads to the emergence of the in-context learning, by allowing\nthe Boltzmann distribution to converge to a unique correct solution of weight\nparameters. Therefore the pre-trained transformer displays a prediction power\nin a novel prompt setting. The proposed spin glass model thus establishes a\nfoundation to understand the empirical success of large language models.", "paper_summary_zh": "大型語言模型展現出令人驚訝的脈絡學習能力——能夠使用提示為查詢形成預測，但無需額外訓練，這與傳統的監督式學習形成鮮明對比。因此，提供機械論解釋並將經驗現象與物理聯繫起來具有挑戰性，且仍未解決。我們研究了一個簡單但富有表現力的線性注意力Transformer，並將此結構映射到一個具有實值自旋的自旋玻璃模型，其中耦合和場解釋了數據中的內在無序。自旋玻璃模型解釋了權重參數在預訓練期間如何相互作用，最重要的是為什麼僅通過提供提示而無需訓練就可以預測一個未見函數。我們的理論揭示，對於單例學習，增加任務多樣性會導致脈絡學習的出現，通過允許玻爾茲曼分佈收斂於權重參數的唯一正確解。因此，預訓練的Transformer在新的提示設置中顯示出預測能力。因此，所提出的自旋玻璃模型為理解大型語言模型的經驗成功奠定了基礎。", "author": "Yuhao Li et.al.", "authors": "Yuhao Li, Ruoran Bai, Haiping Huang", "id": "2408.02288v1", "paper_url": "http://arxiv.org/abs/2408.02288v1", "repo": "null"}}