{"2407.13952": {"publish_time": "2024-07-19", "title": "Knowledge Distillation Approaches for Accurate and Efficient Recommender System", "paper_summary": "Despite its breakthrough in classification problems, Knowledge distillation\n(KD) to recommendation models and ranking problems has not been studied well in\nthe previous literature. This dissertation is devoted to developing knowledge\ndistillation methods for recommender systems to fully improve the performance\nof a compact model. We propose novel distillation methods designed for\nrecommender systems. The proposed methods are categorized according to their\nknowledge sources as follows: (1) Latent knowledge: we propose two methods that\ntransfer latent knowledge of user/item representation. They effectively\ntransfer knowledge of niche tastes with a balanced distillation strategy that\nprevents the KD process from being biased towards a small number of large\npreference groups. Also, we propose a new method that transfers user/item\nrelations in the representation space. The proposed method selectively\ntransfers essential relations considering the limited capacity of the compact\nmodel. (2) Ranking knowledge: we propose three methods that transfer ranking\nknowledge from the recommendation results. They formulate the KD process as a\nranking matching problem and transfer the knowledge via a listwise learning\nstrategy. Further, we present a new learning framework that compresses the\nranking knowledge of heterogeneous recommendation models. The proposed\nframework is developed to ease the computational burdens of model ensemble\nwhich is a dominant solution for many recommendation applications. We validate\nthe benefit of our proposed methods and frameworks through extensive\nexperiments. To summarize, this dissertation sheds light on knowledge\ndistillation approaches for a better accuracy-efficiency trade-off of the\nrecommendation models.", "paper_summary_zh": "儘管在分類問題上取得突破，但知識蒸餾 (KD) 在推薦模型和排名問題上的應用尚未在先前的文獻中得到充分探討。本論文致力於開發推薦系統的知識蒸餾方法，以全面提升精簡模型的效能。我們提出專為推薦系統設計的新穎蒸餾方法。所提出的方法根據其知識來源分類如下：(1) 潛在知識：我們提出兩種方法，用於傳輸使用者/專案表徵的潛在知識。它們透過平衡蒸餾策略有效傳輸利基品味的知識，防止 KD 程序偏向少數大型偏好群組。此外，我們提出一個新的方法，用於傳輸表徵空間中的使用者/專案關係。所提出的方法在考慮精簡模型的有限容量下，有選擇性地傳輸必要的關係。(2) 排名知識：我們提出三種方法，用於傳輸推薦結果中的排名知識。它們將 KD 程序制定為排名配對問題，並透過清單學習策略傳輸知識。此外，我們提出一個新的學習架構，用於壓縮異質推薦模型的排名知識。所提出的架構旨在減輕模型整合的運算負擔，而模型整合是許多推薦應用程式的主流解決方案。我們透過廣泛的實驗驗證了所提出的方法和架構的優點。總之，本論文闡明了知識蒸餾方法，以改善推薦模型的準確性與效率折衷。", "author": "SeongKu Kang et.al.", "authors": "SeongKu Kang", "id": "2407.13952v1", "paper_url": "http://arxiv.org/abs/2407.13952v1", "repo": "null"}}