{"2406.00036": {"publish_time": "2024-05-27", "title": "EMERGE: Integrating RAG for Improved Multimodal EHR Predictive Modeling", "paper_summary": "The integration of multimodal Electronic Health Records (EHR) data has\nnotably advanced clinical predictive capabilities. However, current models that\nutilize clinical notes and multivariate time-series EHR data often lack the\nnecessary medical context for precise clinical tasks. Previous methods using\nknowledge graphs (KGs) primarily focus on structured knowledge extraction. To\naddress this, we propose EMERGE, a Retrieval-Augmented Generation (RAG) driven\nframework aimed at enhancing multimodal EHR predictive modeling. Our approach\nextracts entities from both time-series data and clinical notes by prompting\nLarge Language Models (LLMs) and aligns them with professional PrimeKG to\nensure consistency. Beyond triplet relationships, we include entities'\ndefinitions and descriptions to provide richer semantics. The extracted\nknowledge is then used to generate task-relevant summaries of patients' health\nstatuses. These summaries are fused with other modalities utilizing an adaptive\nmultimodal fusion network with cross-attention. Extensive experiments on the\nMIMIC-III and MIMIC-IV datasets for in-hospital mortality and 30-day\nreadmission tasks demonstrate the superior performance of the EMERGE framework\ncompared to baseline models. Comprehensive ablation studies and analyses\nunderscore the efficacy of each designed module and the framework's robustness\nto data sparsity. EMERGE significantly enhances the use of multimodal EHR data\nin healthcare, bridging the gap with nuanced medical contexts crucial for\ninformed clinical predictions.", "paper_summary_zh": "多模態電子健康紀錄（EHR）資料的整合顯著地提升了臨床預測能力。然而，目前利用臨床筆記和多變數時間序列 EHR 資料的模型，通常缺乏精確臨床任務所需的醫療背景。先前使用知識圖譜 (KG) 的方法主要專注於結構化知識萃取。為了解決這個問題，我們提出 EMERGE，一個以檢索增強生成 (RAG) 為主的架構，旨在增強多模態 EHR 預測模型。我們的做法是透過提示大型語言模型 (LLM) 從時間序列資料和臨床筆記中萃取實體，並將它們與專業 PrimeKG 比對，以確保一致性。除了三元關係之外，我們還包含實體的定義和描述，以提供更豐富的語意。萃取的知識接著用於產生與任務相關的患者健康狀態摘要。這些摘要利用具有交叉注意力的自適應多模態融合網路與其他模態融合。在 MIMIC-III 和 MIMIC-IV 資料集上進行的廣泛實驗，針對院內死亡率和 30 天再入院任務，證明了 EMERGE 框架與基準模型相比具有優越的效能。全面的消融研究和分析強調了每個設計模組的功效，以及該框架對資料稀疏性的穩健性。EMERGE 大幅提升了多模態 EHR 資料在醫療保健中的使用，彌補了對明智臨床預測至關重要的細微醫療背景的差距。", "author": "Yinghao Zhu et.al.", "authors": "Yinghao Zhu, Changyu Ren, Zixiang Wang, Xiaochen Zheng, Shiyun Xie, Junlan Feng, Xi Zhu, Zhoujun Li, Liantao Ma, Chengwei Pan", "id": "2406.00036v1", "paper_url": "http://arxiv.org/abs/2406.00036v1", "repo": "null"}}