{"2409.03550": {"publish_time": "2024-09-05", "title": "DKDM: Data-Free Knowledge Distillation for Diffusion Models with Any Architecture", "paper_summary": "Diffusion models (DMs) have demonstrated exceptional generative capabilities\nacross various areas, while they are hindered by slow inference speeds and high\ncomputational demands during deployment. The most common way to accelerate DMs\ninvolves reducing the number of denoising steps during generation, achieved\nthrough faster sampling solvers or knowledge distillation (KD). In contrast to\nprior approaches, we propose a novel method that transfers the capability of\nlarge pretrained DMs to faster architectures. Specifically, we employ KD in a\ndistinct manner to compress DMs by distilling their generative ability into\nmore rapid variants. Furthermore, considering that the source data is either\nunaccessible or too enormous to store for current generative models, we\nintroduce a new paradigm for their distillation without source data, termed\nData-Free Knowledge Distillation for Diffusion Models (DKDM). Generally, our\nestablished DKDM framework comprises two main components: 1) a DKDM objective\nthat uses synthetic denoising data produced by pretrained DMs to optimize\nfaster DMs without source data, and 2) a dynamic iterative distillation method\nthat flexibly organizes the synthesis of denoising data, preventing it from\nslowing down the optimization process as the generation is slow. To our\nknowledge, this is the first attempt at using KD to distill DMs into any\narchitecture in a data-free manner. Importantly, our DKDM is orthogonal to most\nexisting acceleration methods, such as denoising step reduction, quantization\nand pruning. Experiments show that our DKDM is capable of deriving 2x faster\nDMs with performance remaining on par with the baseline. Notably, our DKDM\nenables pretrained DMs to function as \"datasets\" for training new DMs.", "paper_summary_zh": "擴散模型 (DM) 已在各種領域展現出卓越的生成能力，但它們在部署期間受到推理速度慢和高運算需求的阻礙。加速 DM 最常見的方法包括減少生成期間的去噪步驟數，透過更快速的取樣求解器或知識蒸餾 (KD) 來實現。與先前的做法不同，我們提出了一種新方法，將大型預訓練 DM 的能力轉移到更快的架構中。具體來說，我們以不同方式採用 KD，透過將其生成能力蒸餾到更快速的變體中來壓縮 DM。此外，考慮到原始資料對於當前生成模型來說無法存取或過於龐大，我們引入了在沒有原始資料的情況下進行蒸餾的新範例，稱為擴散模型的無資料知識蒸餾 (DKDM)。一般來說，我們建立的 DKDM 框架包含兩個主要組成部分：1) 一個 DKDM 目標，它使用預訓練 DM 產生的合成去噪資料，在沒有原始資料的情況下最佳化更快速的 DM，以及 2) 一個動態反覆蒸餾方法，它靈活地組織去噪資料的合成，防止它在生成速度慢時拖慢最佳化流程。據我們所知，這是第一次嘗試使用 KD 以無資料的方式將 DM 蒸餾到任何架構中。重要的是，我們的 DKDM 與大多數現有的加速方法正交，例如去噪步驟減少、量化和剪枝。實驗表明，我們的 DKDM 能夠衍生出速度快 2 倍的 DM，其效能仍與基線相當。值得注意的是，我們的 DKDM 使預訓練的 DM 能夠作為「資料集」，用於訓練新的 DM。", "author": "Qianlong Xiang et.al.", "authors": "Qianlong Xiang, Miao Zhang, Yuzhang Shang, Jianlong Wu, Yan Yan, Liqiang Nie", "id": "2409.03550v1", "paper_url": "http://arxiv.org/abs/2409.03550v1", "repo": "null"}}