{"2406.12403": {"publish_time": "2024-06-18", "title": "PDSS: A Privacy-Preserving Framework for Step-by-Step Distillation of Large Language Models", "paper_summary": "In the context of real-world applications, leveraging large language models\n(LLMs) for domain-specific tasks often faces two major challenges:\ndomain-specific knowledge privacy and constrained resources. To address these\nissues, we propose PDSS, a privacy-preserving framework for step-by-step\ndistillation of LLMs. PDSS works on a server-client architecture, wherein\nclient transmits perturbed prompts to the server's LLM for rationale\ngeneration. The generated rationales are then decoded by the client and used to\nenrich the training of task-specific small language model(SLM) within a\nmulti-task learning paradigm. PDSS introduces two privacy protection\nstrategies: the Exponential Mechanism Strategy and the Encoder-Decoder\nStrategy, balancing prompt privacy and rationale usability. Experiments\ndemonstrate the effectiveness of PDSS in various text generation tasks,\nenabling the training of task-specific SLM with enhanced performance while\nprioritizing data privacy protection.", "paper_summary_zh": "在現實世界應用的背景下，利用大型語言模型 (LLM) 執行特定領域任務時，通常會面臨兩項重大挑戰：特定領域的知識隱私和受限資源。為了解決這些問題，我們提出了 PDSS，一個用於 LLM 分步萃取的隱私保護架構。PDSS 採用伺服器 - 客戶端架構，其中客戶端將擾動提示傳送至伺服器的 LLM 以產生依據。然後，客戶端會解碼產生的依據，並用於豐富多任務學習範例中特定任務小型語言模型 (SLM) 的訓練。PDSS 導入了兩種隱私保護策略：指數機制策略和編碼器 - 解碼器策略，平衡提示隱私和依據可用性。實驗證明了 PDSS 在各種文字產生任務中的有效性，讓訓練特定任務的 SLM 能夠增強效能，同時優先考量資料隱私保護。", "author": "Tao Fan et.al.", "authors": "Tao Fan, Yan Kang, Weijing Chen, Hanlin Gu, Yuanfeng Song, Lixin Fan, Kai Chen, Qiang Yang", "id": "2406.12403v1", "paper_url": "http://arxiv.org/abs/2406.12403v1", "repo": "null"}}