{"2412.05256": {"publish_time": "2024-12-06", "title": "Extrapolated Urban View Synthesis Benchmark", "paper_summary": "Photorealistic simulators are essential for the training and evaluation of\nvision-centric autonomous vehicles (AVs). At their core is Novel View Synthesis\n(NVS), a crucial capability that generates diverse unseen viewpoints to\naccommodate the broad and continuous pose distribution of AVs. Recent advances\nin radiance fields, such as 3D Gaussian Splatting, achieve photorealistic\nrendering at real-time speeds and have been widely used in modeling large-scale\ndriving scenes. However, their performance is commonly evaluated using an\ninterpolated setup with highly correlated training and test views. In contrast,\nextrapolation, where test views largely deviate from training views, remains\nunderexplored, limiting progress in generalizable simulation technology. To\naddress this gap, we leverage publicly available AV datasets with multiple\ntraversals, multiple vehicles, and multiple cameras to build the first\nExtrapolated Urban View Synthesis (EUVS) benchmark. Meanwhile, we conduct\nquantitative and qualitative evaluations of state-of-the-art Gaussian Splatting\nmethods across different difficulty levels. Our results show that Gaussian\nSplatting is prone to overfitting to training views. Besides, incorporating\ndiffusion priors and improving geometry cannot fundamentally improve NVS under\nlarge view changes, highlighting the need for more robust approaches and\nlarge-scale training. We have released our data to help advance self-driving\nand urban robotics simulation technology.", "paper_summary_zh": "逼真的模擬器對於以視覺為中心的自動駕駛車輛 (AV) 的訓練和評估至關重要。其核心是新視角合成 (NVS)，這是一項關鍵功能，可產生多樣化的未見視角，以適應自動駕駛車輛廣泛且連續的姿態分佈。最近在輻射場的進展，例如 3D 高斯潑濺，實現了實時速度的光寫實渲染，並已廣泛用於建模大規模駕駛場景。然而，它們的性能通常使用內插設置進行評估，其中訓練和測試視角高度相關。相比之下，外推（測試視角與訓練視角有很大偏差）仍然未得到充分探索，這限制了可概括模擬技術的進步。為了解決這個差距，我們利用具有多重穿越、多重車輛和多重相機的公開自動駕駛車輛數據集來構建第一個外推城市視角合成 (EUVS) 基準。同時，我們對最先進的高斯潑濺方法在不同難度級別上進行了定量和定性評估。我們的結果表明，高斯潑濺容易過度擬合訓練視角。此外，結合擴散先驗和改進幾何形狀無法從根本上改善大視角變化下的 NVS，這突顯了對更強大的方法和大規模訓練的需求。我們已經發布了我們的數據，以幫助推進自動駕駛和城市機器人模擬技術。", "author": "Xiangyu Han et.al.", "authors": "Xiangyu Han, Zhen Jia, Boyi Li, Yan Wang, Boris Ivanovic, Yurong You, Lingjie Liu, Yue Wang, Marco Pavone, Chen Feng, Yiming Li", "id": "2412.05256v1", "paper_url": "http://arxiv.org/abs/2412.05256v1", "repo": "null"}}