{"2502.10273": {"publish_time": "2025-02-14", "title": "Probing Perceptual Constancy in Large Vision Language Models", "paper_summary": "Perceptual constancy is the ability to maintain stable perceptions of objects\ndespite changes in sensory input, such as variations in distance, angle, or\nlighting. This ability is crucial for recognizing visual information in a\ndynamic world, making it essential for Vision-Language Models (VLMs). However,\nwhether VLMs are currently and theoretically capable of mastering this ability\nremains underexplored. In this study, we evaluated 33 VLMs using 253\nexperiments across three domains: color, size, and shape constancy. The\nexperiments included single-image and video adaptations of classic cognitive\ntasks, along with novel tasks in in-the-wild conditions, to evaluate the\nmodels' recognition of object properties under varying conditions. We found\nsignificant variability in VLM performance, with models performance in shape\nconstancy clearly dissociated from that of color and size constancy.", "paper_summary_zh": "知覺恆常性是指在感官輸入發生變化（例如距離、角度或光線變化）時，維持對物體的穩定知覺的能力。這種能力對於在動態世界中識別視覺資訊至關重要，因此對視覺語言模型 (VLM) 至關重要。然而，VLM 目前和理論上是否有能力掌握這種能力仍未得到充分探討。在這項研究中，我們使用 253 項實驗評估了 33 個 VLM，涵蓋三個領域：顏色、大小和形狀恆常性。這些實驗包括經典認知任務的單一影像和影片改編，以及在野外條件下的新任務，以評估模型在不同條件下對物體屬性的識別能力。我們發現 VLM 效能有顯著差異，模型在形狀恆常性中的效能明顯不同於顏色和大小恆常性。", "author": "Haoran Sun et.al.", "authors": "Haoran Sun, Suyang Yu, Yijiang Li, Qingying Gao, Haiyun Lyu, Hokin Deng, Dezhi Luo", "id": "2502.10273v1", "paper_url": "http://arxiv.org/abs/2502.10273v1", "repo": "null"}}