{"2504.06196": {"publish_time": "2025-04-08", "title": "TxGemma: Efficient and Agentic LLMs for Therapeutics", "paper_summary": "Therapeutic development is a costly and high-risk endeavor that is often\nplagued by high failure rates. To address this, we introduce TxGemma, a suite\nof efficient, generalist large language models (LLMs) capable of therapeutic\nproperty prediction as well as interactive reasoning and explainability. Unlike\ntask-specific models, TxGemma synthesizes information from diverse sources,\nenabling broad application across the therapeutic development pipeline. The\nsuite includes 2B, 9B, and 27B parameter models, fine-tuned from Gemma-2 on a\ncomprehensive dataset of small molecules, proteins, nucleic acids, diseases,\nand cell lines. Across 66 therapeutic development tasks, TxGemma achieved\nsuperior or comparable performance to the state-of-the-art generalist model on\n64 (superior on 45), and against state-of-the-art specialist models on 50\n(superior on 26). Fine-tuning TxGemma models on therapeutic downstream tasks,\nsuch as clinical trial adverse event prediction, requires less training data\nthan fine-tuning base LLMs, making TxGemma suitable for data-limited\napplications. Beyond these predictive capabilities, TxGemma features\nconversational models that bridge the gap between general LLMs and specialized\nproperty predictors. These allow scientists to interact in natural language,\nprovide mechanistic reasoning for predictions based on molecular structure, and\nengage in scientific discussions. Building on this, we further introduce\nAgentic-Tx, a generalist therapeutic agentic system powered by Gemini 2.5 that\nreasons, acts, manages diverse workflows, and acquires external domain\nknowledge. Agentic-Tx surpasses prior leading models on the Humanity's Last\nExam benchmark (Chemistry & Biology) with 52.3% relative improvement over\no3-mini (high) and 26.7% over o3-mini (high) on GPQA (Chemistry) and excels\nwith improvements of 6.3% (ChemBench-Preference) and 2.4% (ChemBench-Mini) over\no3-mini (high).", "paper_summary_zh": "<paragraph>治療藥物開發是一項成本高昂且風險極大的工作，失敗率通常很高。為了應對這個問題，我們推出了 TxGemma，一套高效、通用的巨型語言模型 (LLM)，能夠預測治療特性，並具備互動推理和可解釋性。 與特定任務模型不同，TxGemma 能夠綜合來自不同來源的資訊，使其可在整個治療藥物開發流程中廣泛應用。該套件包含 2B、9B 和 27B 參數模型，這些模型是根據 Gemma-2 在包含小分子、蛋白質、核酸、疾病和細胞系的綜合數據集上進行微調的。在 66 項治療藥物開發任務中，TxGemma 在 64 項任務中取得了優於或與最先進的通用模型相當的性能（在 45 項任務中表現更佳），並且在 50 項任務中優於或與最先進的專業模型相當（在 26 項任務中表現更佳）。在治療性下游任務（例如臨床試驗不良事件預測）上微調 TxGemma 模型所需的訓練數據比微調基礎 LLM 少，這使得 TxGemma 適合數據有限的應用。除了這些預測能力之外，TxGemma 還具有對話模型，彌合了通用 LLM 和專業特性預測器之間的差距。這些模型允許科學家以自然語言進行互動，根據分子結構為預測提供機理解釋，並參與科學討論。在此基礎上，我們進一步推出了 Agentic-Tx，這是一個由 Gemini 2.5 支援的通用治療代理系統，可以推理、行動、管理各種工作流程，並獲取外部領域知識。Agentic-Tx 在 Humanity's Last Exam 基準測試（化學與生物學）中超越了先前領先的模型，相較於 o3-mini (high) 有 52.3% 的相對改進，在 GPQA（化學）上相較於 o3-mini (high) 有 26.7% 的改進，並且在 ChemBench-Preference 上比 o3-mini (high) 改進了 6.3%，在 ChemBench-Mini 上比 o3-mini (high) 改進了 2.4%。</paragraph>\n", "author": "Eric Wang et.al.", "authors": "Eric Wang, Samuel Schmidgall, Paul F. Jaeger, Fan Zhang, Rory Pilgrim, Yossi Matias, Joelle Barral, David Fleet, Shekoofeh Azizi", "id": "2504.06196v1", "paper_url": "http://arxiv.org/abs/2504.06196v1", "repo": "null"}}