{"2411.19804": {"publish_time": "2024-11-29", "title": "Advanced System Integration: Analyzing OpenAPI Chunking for Retrieval-Augmented Generation", "paper_summary": "Integrating multiple (sub-)systems is essential to create advanced\nInformation Systems (ISs). Difficulties mainly arise when integrating dynamic\nenvironments across the IS lifecycle. A traditional approach is a registry that\nprovides the API documentation of the systems' endpoints. Large Language Models\n(LLMs) have shown to be capable of automatically creating system integrations\n(e.g., as service composition) based on this documentation but require concise\ninput due to input token limitations, especially regarding comprehensive API\ndescriptions. Currently, it is unknown how best to preprocess these API\ndescriptions. Within this work, we (i) analyze the usage of Retrieval Augmented\nGeneration (RAG) for endpoint discovery and the chunking, i.e., preprocessing,\nof OpenAPIs to reduce the input token length while preserving the most relevant\ninformation. To further reduce the input token length for the composition\nprompt and improve endpoint retrieval, we propose (ii) a Discovery Agent that\nonly receives a summary of the most relevant endpoints and retrieves details on\ndemand. We evaluate RAG for endpoint discovery using the RestBench benchmark,\nfirst, for the different chunking possibilities and parameters measuring the\nendpoint retrieval recall, precision, and F1 score. Then, we assess the\nDiscovery Agent using the same test set. With our prototype, we demonstrate how\nto successfully employ RAG for endpoint discovery to reduce the token count.\nWhile revealing high values for recall, precision, and F1, further research is\nnecessary to retrieve all requisite endpoints. Our experiments show that for\npreprocessing, LLM-based and format-specific approaches outperform na\\\"ive\nchunking methods. Relying on an agent further enhances these results as the\nagent splits the tasks into multiple fine granular subtasks, improving the\noverall RAG performance in the token count, precision, and F1 score.", "paper_summary_zh": "整合多個（子）系統對於建立進階資訊系統（IS）至關重要。困難主要出現在整合 IS 生命週期中的動態環境時。傳統方法是登錄檔，它提供系統端點的 API 文件。大型語言模型（LLM）已證明有能力根據此文件自動建立系統整合（例如，作為服務組合），但由於輸入令牌限制，特別是關於全面的 API 描述，因此需要簡潔的輸入。目前，尚不知道如何最好地預處理這些 API 描述。在這項工作中，我們（i）分析了檢索增強生成（RAG）在端點發現中的用法，以及 OpenAPI 的分塊，即預處理，以減少輸入令牌長度，同時保留最相關的資訊。為了進一步減少組合提示的輸入令牌長度並改善端點檢索，我們提出（ii）一個發現代理，它只接收最相關端點的摘要，並根據需要檢索詳細資訊。我們使用 RestBench 基準評估 RAG 的端點發現，首先，對於不同的分塊可能性和參數測量端點檢索召回率、準確度和 F1 分數。然後，我們使用相同的測試集評估發現代理。透過我們的原型，我們展示了如何成功使用 RAG 進行端點發現以減少令牌計數。雖然顯示出召回率、準確度和 F1 的高值，但仍需要進一步的研究來檢索所有必要的端點。我們的實驗表明，對於預處理，基於 LLM 和特定格式的方法優於天真的分塊方法。依賴代理進一步增強了這些結果，因為代理將任務分為多個細緻的子任務，改善了令牌計數、準確度和 F1 分數中的整體 RAG 效能。", "author": "Robin D. Pesl et.al.", "authors": "Robin D. Pesl, Jerin G. Mathew, Massimo Mecella, Marco Aiello", "id": "2411.19804v1", "paper_url": "http://arxiv.org/abs/2411.19804v1", "repo": "null"}}