{"2406.19537": {"publish_time": "2024-06-27", "title": "Handling Ontology Gaps in Semantic Parsing", "paper_summary": "The majority of Neural Semantic Parsing (NSP) models are developed with the\nassumption that there are no concepts outside the ones such models can\nrepresent with their target symbols (closed-world assumption). This assumption\nleads to generate hallucinated outputs rather than admitting their lack of\nknowledge. Hallucinations can lead to wrong or potentially offensive responses\nto users. Hence, a mechanism to prevent this behavior is crucial to build\ntrusted NSP-based Question Answering agents. To that end, we propose the\nHallucination Simulation Framework (HSF), a general setting for stimulating and\nanalyzing NSP model hallucinations. The framework can be applied to any NSP\ntask with a closed-ontology. Using the proposed framework and KQA Pro as the\nbenchmark dataset, we assess state-of-the-art techniques for hallucination\ndetection. We then present a novel hallucination detection strategy that\nexploits the computational graph of the NSP model to detect the NSP\nhallucinations in the presence of ontology gaps, out-of-domain utterances, and\nto recognize NSP errors, improving the F1-Score respectively by ~21, ~24% and\n~1%. This is the first work in closed-ontology NSP that addresses the problem\nof recognizing ontology gaps. We release our code and checkpoints at\nhttps://github.com/amazon-science/handling-ontology-gaps-in-semantic-parsing.", "paper_summary_zh": "大多數的神經語意分析 (NSP) 模型都是基於這樣的假設：沒有任何概念在這些模型可以用其目標符號 (封閉世界假設) 表示的範圍之外。這個假設會產生虛構的輸出，而不是承認它們的知識不足。虛構可能會導致對使用者產生錯誤或潛在的冒犯性回應。因此，一種防止這種行為的機制對於建構值得信賴的基於 NSP 的問答代理程式至關重要。為此，我們提出了虛構模擬架構 (HSF)，一個用於刺激和分析 NSP 模型虛構的通用設定。此架構可以應用於任何具有封閉本體論的 NSP 任務。使用提議的架構和 KQA Pro 作為基準資料集，我們評估了最先進的虛構偵測技術。然後，我們提出了一種新穎的虛構偵測策略，利用 NSP 模型的計算圖表來偵測 NSP 虛構，在存在本體論差距、領域外語句的情況下，以及辨識 NSP 錯誤，分別將 F1 分數提升了約 21%、24% 和 1%。這是封閉本體論 NSP 中第一個解決辨識本體論差距問題的研究。我們在 https://github.com/amazon-science/handling-ontology-gaps-in-semantic-parsing 上發布我們的程式碼和檢查點。", "author": "Andrea Bacciu et.al.", "authors": "Andrea Bacciu, Marco Damonte, Marco Basaldella, Emilio Monti", "id": "2406.19537v1", "paper_url": "http://arxiv.org/abs/2406.19537v1", "repo": "https://github.com/amazon-science/handling-ontology-gaps-in-semantic-parsing"}}