{"2406.04639": {"publish_time": "2024-06-07", "title": "Cooperative Meta-Learning with Gradient Augmentation", "paper_summary": "Model agnostic meta-learning (MAML) is one of the most widely used\ngradient-based meta-learning, consisting of two optimization loops: an inner\nloop and outer loop. MAML learns the new task from meta-initialization\nparameters with an inner update and finds the meta-initialization parameters in\nthe outer loop. In general, the injection of noise into the gradient of the\nmodel for augmenting the gradient is one of the widely used regularization\nmethods. In this work, we propose a novel cooperative meta-learning framework\ndubbed CML which leverages gradient-level regularization with gradient\naugmentation. We inject learnable noise into the gradient of the model for the\nmodel generalization. The key idea of CML is introducing the co-learner which\nhas no inner update but the outer loop update to augment gradients for finding\nbetter meta-initialization parameters. Since the co-learner does not update in\nthe inner loop, it can be easily deleted after meta-training. Therefore, CML\ninfers with only meta-learner without additional cost and performance\ndegradation. We demonstrate that CML is easily applicable to gradient-based\nmeta-learning methods and CML leads to increased performance in few-shot\nregression, few-shot image classification and few-shot node classification\ntasks. Our codes are at https://github.com/JJongyn/CML.", "paper_summary_zh": "模型不可知元學習 (MAML) 是一種最廣泛使用的基於梯度的元學習，包含兩個優化迴圈：一個內部迴圈和一個外部迴圈。MAML 從元初始化參數中學習新任務，並使用內部更新，並在外部迴圈中找到元初始化參數。一般來說，將雜訊注入模型梯度以擴充梯度是廣泛使用的正則化方法之一。在這項工作中，我們提出了一個新穎的協作元學習框架，稱為 CML，它利用梯度層級正則化和梯度擴充。我們將可學習的雜訊注入模型梯度中，以進行模型泛化。CML 的關鍵思想是引入共同學習器，它沒有內部更新，但外部迴圈更新可以擴充梯度，以找到更好的元初始化參數。由於共同學習器不會在內部迴圈中更新，因此可以在元訓練後輕鬆刪除它。因此，CML 推斷僅使用元學習器，而沒有額外的成本和效能下降。我們證明 CML 容易應用於基於梯度的元學習方法，並且 CML 可以在少次數迴歸、少次數影像分類和少次數節點分類任務中提升效能。我們的程式碼在 https://github.com/JJongyn/CML。", "author": "Jongyun Shin et.al.", "authors": "Jongyun Shin, Seunjin Han, Jangho Kim", "id": "2406.04639v1", "paper_url": "http://arxiv.org/abs/2406.04639v1", "repo": "https://github.com/jjongyn/cml"}}