{"2410.14399": {"publish_time": "2024-10-18", "title": "SylloBio-NLI: Evaluating Large Language Models on Biomedical Syllogistic Reasoning", "paper_summary": "Syllogistic reasoning is crucial for Natural Language Inference (NLI). This\ncapability is particularly significant in specialized domains such as\nbiomedicine, where it can support automatic evidence interpretation and\nscientific discovery. This paper presents SylloBio-NLI, a novel framework that\nleverages external ontologies to systematically instantiate diverse syllogistic\narguments for biomedical NLI. We employ SylloBio-NLI to evaluate Large Language\nModels (LLMs) on identifying valid conclusions and extracting supporting\nevidence across 28 syllogistic schemes instantiated with human genome pathways.\nExtensive experiments reveal that biomedical syllogistic reasoning is\nparticularly challenging for zero-shot LLMs, which achieve an average accuracy\nbetween 70% on generalized modus ponens and 23% on disjunctive syllogism. At\nthe same time, we found that few-shot prompting can boost the performance of\ndifferent LLMs, including Gemma (+14%) and LLama-3 (+43%). However, a deeper\nanalysis shows that both techniques exhibit high sensitivity to superficial\nlexical variations, highlighting a dependency between reliability, models'\narchitecture, and pre-training regime. Overall, our results indicate that,\nwhile in-context examples have the potential to elicit syllogistic reasoning in\nLLMs, existing models are still far from achieving the robustness and\nconsistency required for safe biomedical NLI applications.", "paper_summary_zh": "三段論推理對於自然語言推論 (NLI) 至關重要。此能力在生物醫學等專業領域中特別重要，因為它可以支持自動證據解釋和科學發現。本文提出了 SylloBio-NLI，一個利用外部本体論系統化地為生物醫學 NLI 實例化不同三段論論證的新框架。我們使用 SylloBio-NLI 來評估大型語言模型 (LLM) 在識別有效結論和提取支持證據方面的能力，這些證據跨越了 28 個使用人類基因組路徑實例化的三段論架構。廣泛的實驗表明，生物醫學三段論推理對於零次學習 LLM 來說特別具有挑戰性，它們在廣義肯定式中達到 70% 的平均準確度，在析取三段論中達到 23% 的平均準確度。同時，我們發現少次學習提示可以提升不同 LLM 的性能，包括 Gemma (+14%) 和 LLama-3 (+43%)。然而，更深入的分析表明，這兩種技術都對表面的詞彙變化表現出高度敏感性，突出了可靠性、模型架構和預訓練機制之間的依賴性。總的來說，我們的結果表明，雖然上下文範例有潛力引發 LLM 中的三段論推理，但現有模型仍遠未達到安全生物醫學 NLI 應用所需的穩健性和一致性。", "author": "Magdalena Wysocka et.al.", "authors": "Magdalena Wysocka, Danilo S. Carvalho, Oskar Wysocki, Marco Valentino, Andre Freitas", "id": "2410.14399v1", "paper_url": "http://arxiv.org/abs/2410.14399v1", "repo": "null"}}