{"2405.15097": {"publish_time": "2024-05-23", "title": "Contrastive and Consistency Learning for Neural Noisy-Channel Model in Spoken Language Understanding", "paper_summary": "Recently, deep end-to-end learning has been studied for intent classification\nin Spoken Language Understanding (SLU). However, end-to-end models require a\nlarge amount of speech data with intent labels, and highly optimized models are\ngenerally sensitive to the inconsistency between the training and evaluation\nconditions. Therefore, a natural language understanding approach based on\nAutomatic Speech Recognition (ASR) remains attractive because it can utilize a\npre-trained general language model and adapt to the mismatch of the speech\ninput environment. Using this module-based approach, we improve a noisy-channel\nmodel to handle transcription inconsistencies caused by ASR errors. We propose\na two-stage method, Contrastive and Consistency Learning (CCL), that correlates\nerror patterns between clean and noisy ASR transcripts and emphasizes the\nconsistency of the latent features of the two transcripts. Experiments on four\nbenchmark datasets show that CCL outperforms existing methods and improves the\nASR robustness in various noisy environments. Code is available at\nhttps://github.com/syoung7388/CCL.", "paper_summary_zh": "最近，深度端到端學習已被研究用於口語理解 (SLU) 中的意圖分類。然而，端到端模型需要大量帶有意圖標籤的語音資料，而高度最佳化的模型通常對訓練和評估條件之間的不一致很敏感。因此，基於自動語音辨識 (ASR) 的自然語言理解方法仍然具有吸引力，因為它可以利用預先訓練的通用語言模型並適應語音輸入環境的不匹配。使用這種基於模組的方法，我們改進了一個雜訊通道模型，以處理由 ASR 錯誤引起的轉錄不一致。我們提出了一種兩階段方法，對比和一致性學習 (CCL)，它將乾淨和雜訊 ASR 轉錄之間的錯誤模式關聯起來，並強調兩個轉錄的潛在特徵的一致性。在四個基準資料集上的實驗表明，CCL 優於現有方法，並在各種雜訊環境中改善了 ASR 的穩健性。程式碼可在 https://github.com/syoung7388/CCL 取得。", "author": "Suyoung Kim et.al.", "authors": "Suyoung Kim, Jiyeon Hwang, Ho-Young Jung", "id": "2405.15097v1", "paper_url": "http://arxiv.org/abs/2405.15097v1", "repo": "null"}}