{"2406.12465": {"publish_time": "2024-06-18", "title": "RIGL: A Unified Reciprocal Approach for Tracing the Independent and Group Learning Processes", "paper_summary": "In the realm of education, both independent learning and group learning are\nesteemed as the most classic paradigms. The former allows learners to\nself-direct their studies, while the latter is typically characterized by\nteacher-directed scenarios. Recent studies in the field of intelligent\neducation have leveraged deep temporal models to trace the learning process,\ncapturing the dynamics of students' knowledge states, and have achieved\nremarkable performance. However, existing approaches have primarily focused on\nmodeling the independent learning process, with the group learning paradigm\nreceiving less attention. Moreover, the reciprocal effect between the two\nlearning processes, especially their combined potential to foster holistic\nstudent development, remains inadequately explored. To this end, in this paper,\nwe propose RIGL, a unified Reciprocal model to trace knowledge states at both\nthe individual and group levels, drawing from the Independent and Group\nLearning processes. Specifically, we first introduce a time frame-aware\nreciprocal embedding module to concurrently model both student and group\nresponse interactions across various time frames. Subsequently, we employ\nreciprocal enhanced learning modeling to fully exploit the comprehensive and\ncomplementary information between the two behaviors. Furthermore, we design a\nrelation-guided temporal attentive network, comprised of dynamic graph modeling\ncoupled with a temporal self-attention mechanism. It is used to delve into the\ndynamic influence of individual and group interactions throughout the learning\nprocesses. Conclusively, we introduce a bias-aware contrastive learning module\nto bolster the stability of the model's training. Extensive experiments on four\nreal-world educational datasets clearly demonstrate the effectiveness of the\nproposed RIGL model.", "paper_summary_zh": "<paragraph>在教育領域中，獨立學習和群體學習被尊崇為最經典的典範。前者允許學習者自我指導他們的學習，而後者通常以教師指導的場景為特徵。智能教育領域的最新研究利用深度時間模型追蹤學習歷程，捕捉學生知識狀態的動態，並取得顯著的表現。然而，現有的方法主要專注於對獨立學習歷程建模，而群體學習典範則較少受到關注。此外，兩種學習歷程之間的交互作用，特別是它們促進學生整體發展的綜合潛力，仍未得到充分的探討。為此，我們在本文中提出 RIGL，一個統一的交互模型，用於追蹤個人和群體層級的知識狀態，並從獨立和群體學習歷程中汲取靈感。具體來說，我們首先引入一個時間框架感知的交互嵌入模組，用於同時對不同時間框架內的學生和群體反應交互進行建模。隨後，我們採用交互增強學習建模，以充分利用兩種行為之間的全面且互補的資訊。此外，我們設計了一個關係導向的時間注意力網路，由動態圖形建模與時間自我注意力機制組成。它用於深入探討在整個學習歷程中個人和群體交互的動態影響。最後，我們引入一個偏誤感知對比學習模組，以加強模型訓練的穩定性。在四個真實世界的教育資料集上進行的廣泛實驗清楚地證明了所提出的 RIGL 模型的有效性。</paragraph>", "author": "Xiaoshan Yu et.al.", "authors": "Xiaoshan Yu, Chuan Qin, Dazhong Shen, Shangshang Yang, Haiping Ma, Hengshu Zhu, Xingyi Zhang", "id": "2406.12465v1", "paper_url": "http://arxiv.org/abs/2406.12465v1", "repo": "null"}}