{"2412.15948": {"publish_time": "2024-12-20", "title": "Trust Calibration in IDEs: Paving the Way for Widespread Adoption of AI Refactoring", "paper_summary": "In the software industry, the drive to add new features often overshadows the\nneed to improve existing code. Large Language Models (LLMs) offer a new\napproach to improving codebases at an unprecedented scale through AI-assisted\nrefactoring. However, LLMs come with inherent risks such as braking changes and\nthe introduction of security vulnerabilities. We advocate for encapsulating the\ninteraction with the models in IDEs and validating refactoring attempts using\ntrustworthy safeguards. However, equally important for the uptake of AI\nrefactoring is research on trust development. In this position paper, we\nposition our future work based on established models from research on human\nfactors in automation. We outline action research within CodeScene on\ndevelopment of 1) novel LLM safeguards and 2) user interaction that conveys an\nappropriate level of trust. The industry collaboration enables large-scale\nrepository analysis and A/B testing to continuously guide the design of our\nresearch interventions.", "paper_summary_zh": "在軟體產業中，新增功能的驅動力通常會蓋過改善現有程式碼的需求。大型語言模型 (LLM) 提供一種新的方法，透過 AI 輔助重構，以前所未有的規模改善程式碼庫。然而，LLM 伴隨著固有的風險，例如中斷變更和引入安全性漏洞。我們提倡將與模型的互動封裝在 IDE 中，並使用可信賴的防護措施驗證重構嘗試。然而，對於 AI 重構的採用而言，同樣重要的是對信任發展的研究。在這個立場文件中，我們根據自動化中人為因素研究中的既定模型，定位我們的未來工作。我們概述了 CodeScene 中的行動研究，關於 1) 新穎的 LLM 防護措施的開發和 2) 傳達適當信任層級的使用者互動。產業合作能進行大規模儲存庫分析和 A/B 測試，以持續引導我們研究介入的設計。", "author": "Markus Borg et.al.", "authors": "Markus Borg", "id": "2412.15948v1", "paper_url": "http://arxiv.org/abs/2412.15948v1", "repo": "null"}}