{"2409.12883": {"publish_time": "2024-09-19", "title": "Improving Prototypical Parts Abstraction for Case-Based Reasoning Explanations Designed for the Kidney Stone Type Recognition", "paper_summary": "The in-vivo identification of the kidney stone types during an ureteroscopy\nwould be a major medical advance in urology, as it could reduce the time of the\ntedious renal calculi extraction process, while diminishing infection risks.\nFurthermore, such an automated procedure would make possible to prescribe\nanti-recurrence treatments immediately. Nowadays, only few experienced\nurologists are able to recognize the kidney stone types in the images of the\nvideos displayed on a screen during the endoscopy. Thus, several deep learning\n(DL) models have recently been proposed to automatically recognize the kidney\nstone types using ureteroscopic images. However, these DL models are of black\nbox nature whicl limits their applicability in clinical settings. This\ncontribution proposes a case-based reasoning DL model which uses prototypical\nparts (PPs) and generates local and global descriptors. The PPs encode for each\nclass (i.e., kidney stone type) visual feature information (hue, saturation,\nintensity and textures) similar to that used by biologists. The PPs are\noptimally generated due a new loss function used during the model training.\nMoreover, the local and global descriptors of PPs allow to explain the\ndecisions (\"what\" information, \"where in the images\") in an understandable way\nfor biologists and urologists. The proposed DL model has been tested on a\ndatabase including images of the six most widespread kidney stone types. The\noverall average classification accuracy was 90.37. When comparing this results\nwith that of the eight other DL models of the kidney stone state-of-the-art, it\ncan be seen that the valuable gain in explanability was not reached at the\nexpense of accuracy which was even slightly increased with respect to that\n(88.2) of the best method of the literature. These promising and interpretable\nresults also encourage urologists to put their trust in AI-based solutions.", "paper_summary_zh": "尿路鏡檢查中腎結石類型的體內識別將是泌尿科的一項重大進展，因為它可以減少繁瑣的腎結石取出過程的時間，同時降低感染風險。此外，這種自動化程序將使立即開立抗復發治療成為可能。如今，只有少數經驗豐富的泌尿科醫生能夠在內視鏡檢查期間屏幕上顯示的視頻圖像中識別腎結石類型。因此，最近已提出多種深度學習 (DL) 模型，以使用輸尿管鏡圖像自動識別腎結石類型。然而，這些 DL 模型本質上是黑盒子，這限制了它們在臨床環境中的應用性。本文提出了一個基於案例推理的 DL 模型，它使用原型部分 (PP) 並生成局部和全局描述符。PP 為每種類型（即腎結石類型）編碼視覺特徵信息（色調、飽和度、強度和紋理），類似於生物學家使用的信息。由於在模型訓練期間使用的新損失函數，PP 得到了最佳生成。此外，PP 的局部和全局描述符允許以生物學家和泌尿科醫生可以理解的方式解釋決策（“什麼”信息，“圖像中的什麼位置”）。所提出的 DL 模型已在一個包含六種最廣泛的腎結石類型圖像的數據庫上進行了測試。總體平均分類準確率為 90.37。將此結果與腎結石最先進的八個其他 DL 模型的結果進行比較時，可以看出，可解釋性的寶貴增益並未以準確性為代價，甚至略有增加與文獻中最好的方法 (88.2) 相比。這些有希望且可解釋的結果也鼓勵泌尿科醫生相信基於人工智能的解決方案。", "author": "Daniel Flores-Araiza et.al.", "authors": "Daniel Flores-Araiza, Francisco Lopez-Tiro, Clément Larose, Salvador Hinojosa, Andres Mendez-Vazquez, Miguel Gonzalez-Mendoza, Gilberto Ochoa-Ruiz, Christian Daul", "id": "2409.12883v1", "paper_url": "http://arxiv.org/abs/2409.12883v1", "repo": "null"}}