{"2406.16626": {"publish_time": "2024-06-24", "title": "Hacking a surrogate model approach to XAI", "paper_summary": "In recent years, the number of new applications for highly complex AI systems\nhas risen significantly. Algorithmic decision-making systems (ADMs) are one of\nsuch applications, where an AI system replaces the decision-making process of a\nhuman expert. As one approach to ensure fairness and transparency of such\nsystems, explainable AI (XAI) has become more important. One variant to achieve\nexplainability are surrogate models, i.e., the idea to train a new simpler\nmachine learning model based on the input-output-relationship of a black box\nmodel. The simpler machine learning model could, for example, be a decision\ntree, which is thought to be intuitively understandable by humans. However,\nthere is not much insight into how well the surrogate model approximates the\nblack box.\n  Our main assumption is that a good surrogate model approach should be able to\nbring such a discriminating behavior to the attention of humans; prior to our\nresearch we assumed that a surrogate decision tree would identify such a\npattern on one of its first levels. However, in this article we show that even\nif the discriminated subgroup - while otherwise being the same in all\ncategories - does not get a single positive decision from the black box ADM\nsystem, the corresponding question of group membership can be pushed down onto\na level as low as wanted by the operator of the system.\n  We then generalize this finding to pinpoint the exact level of the tree on\nwhich the discriminating question is asked and show that in a more realistic\nscenario, where discrimination only occurs to some fraction of the\ndisadvantaged group, it is even more feasible to hide such discrimination.\n  Our approach can be generalized easily to other surrogate models.", "paper_summary_zh": "<paragraph>近年來，高度複雜 AI 系統的新應用數量大幅增加。演算法決策系統 (ADM) 就是其中一項應用，其中 AI 系統取代了人類專家的決策過程。作為確保此類系統公平性和透明度的方法之一，可解釋 AI (XAI) 變得更加重要。實現可解釋性的其中一種變體是代理模型，即基於黑盒模型的輸入輸出關係訓練一個新的更簡單機器學習模型的想法。例如，更簡單的機器學習模型可以是決策樹，而決策樹被認為是人類可以直觀理解的。然而，對於代理模型近似黑盒的程度並沒有太多見解。\n我們的基本假設是，一個好的代理模型方法應該能夠將這種區別行為引起人類的注意；在我們的研究之前，我們假設代理決策樹會在其第一個層級中識別出這種模式。然而，在本文中，我們表明，即使被區別的子群在所有類別中都是相同的，但從黑盒 ADM 系統中沒有得到任何正向決策，系統操作員可以將群組成員資格問題下放到想要的層級。\n然後，我們將此發現概括為精確定位詢問區別問題的樹的精確層級，並表明在更實際的情況中，其中歧視僅發生在弱勢群體的一部分，隱藏這種歧視甚至更可行。\n我們的做法可以很容易地概括到其他代理模型。</paragraph>", "author": "Alexander Wilhelm et.al.", "authors": "Alexander Wilhelm, Katharina A. Zweig", "id": "2406.16626v1", "paper_url": "http://arxiv.org/abs/2406.16626v1", "repo": "null"}}