{"2411.14263": {"publish_time": "2024-11-21", "title": "Generating Realistic Adversarial Examples for Business Processes using Variational Autoencoders", "paper_summary": "In predictive process monitoring, predictive models are vulnerable to\nadversarial attacks, where input perturbations can lead to incorrect\npredictions. Unlike in computer vision, where these perturbations are designed\nto be imperceptible to the human eye, the generation of adversarial examples in\npredictive process monitoring poses unique challenges. Minor changes to the\nactivity sequences can create improbable or even impossible scenarios to occur\ndue to underlying constraints such as regulatory rules or process constraints.\nTo address this, we focus on generating realistic adversarial examples tailored\nto the business process context, in contrast to the imperceptible, pixel-level\nchanges commonly seen in computer vision adversarial attacks. This paper\nintroduces two novel latent space attacks, which generate adversaries by adding\nnoise to the latent space representation of the input data, rather than\ndirectly modifying the input attributes. These latent space methods are\ndomain-agnostic and do not rely on process-specific knowledge, as we restrict\nthe generation of adversarial examples to the learned class-specific data\ndistributions by directly perturbing the latent space representation of the\nbusiness process executions. We evaluate these two latent space methods with\nsix other adversarial attacking methods on eleven real-life event logs and four\npredictive models. The first three attacking methods directly permute the\nactivities of the historically observed business process executions. The fourth\nmethod constrains the adversarial examples to lie within the same data\ndistribution as the original instances, by projecting the adversarial examples\nto the original data distribution.", "paper_summary_zh": "在预测过程监控中，预测模型容易受到对抗性攻击，输入扰动可能导致预测不正确。与计算机视觉中这些扰动被设计为对人眼不可察觉不同，在预测过程监控中生成对抗性示例提出了独特的挑战。由于法规规则或过程约束等基本约束，活动序列的微小变化可能会产生不可能甚至不可能发生的场景。为了解决这个问题，我们专注于生成针对业务流程上下文的现实对抗性示例，这与计算机视觉对抗性攻击中常见的不可察觉的像素级变化形成对比。本文介绍了两种新颖的潜在空间攻击，它们通过向输入数据的潜在空间表示添加噪声来生成对抗者，而不是直接修改输入属性。这些潜在空间方法与域无关，并且不依赖于特定于过程的知识，因为我们将对抗性示例的生成限制在学习的特定于类的分布数据上，通过直接扰动业务流程执行的潜在空间表示。我们使用六种其他对抗性攻击方法在十一个真实事件日志和四个预测模型上评估了这两种潜在空间方法。前三种攻击方法直接排列历史观察到的业务流程执行的活动。第四种方法通过将对抗性示例投影到原始数据分布，将对抗性示例限制在与原始实例相同的分布中。", "author": "Alexander Stevens et.al.", "authors": "Alexander Stevens, Jari Peeperkorn, Johannes De Smedt, Jochen De Weerdt", "id": "2411.14263v1", "paper_url": "http://arxiv.org/abs/2411.14263v1", "repo": "null"}}