{"2405.17104": {"publish_time": "2024-05-27", "title": "LLM-Optic: Unveiling the Capabilities of Large Language Models for Universal Visual Grounding", "paper_summary": "Visual grounding is an essential tool that links user-provided text queries\nwith query-specific regions within an image. Despite advancements in visual\ngrounding models, their ability to comprehend complex queries remains limited.\nTo overcome this limitation, we introduce LLM-Optic, an innovative method that\nutilizes Large Language Models (LLMs) as an optical lens to enhance existing\nvisual grounding models in comprehending complex text queries involving\nintricate text structures, multiple objects, or object spatial relationships,\nsituations that current models struggle with. LLM-Optic first employs an LLM as\na Text Grounder to interpret complex text queries and accurately identify\nobjects the user intends to locate. Then a pre-trained visual grounding model\nis used to generate candidate bounding boxes given the refined query by the\nText Grounder. After that, LLM-Optic annotates the candidate bounding boxes\nwith numerical marks to establish a connection between text and specific image\nregions, thereby linking two distinct modalities. Finally, it employs a Large\nMultimodal Model (LMM) as a Visual Grounder to select the marked candidate\nobjects that best correspond to the original text query. Through LLM-Optic, we\nhave achieved universal visual grounding, which allows for the detection of\narbitrary objects specified by arbitrary human language input. Importantly, our\nmethod achieves this enhancement without requiring additional training or\nfine-tuning. Extensive experiments across various challenging benchmarks\ndemonstrate that LLM-Optic achieves state-of-the-art zero-shot visual grounding\ncapabilities. Project Page: https://haoyu-zhao.github.io/LLM-Optic.github.io/.", "paper_summary_zh": "視覺基礎是一個重要的工具，它將使用者提供的文字查詢與影像中特定於查詢的區域連結起來。儘管視覺基礎模型有進展，它們理解複雜查詢的能力仍然有限。為了克服這個限制，我們引入了 LLM-Optic，這是一種創新的方法，它利用大型語言模型 (LLM) 作為一個光學透鏡，以增強現有的視覺基礎模型，理解涉及複雜文字結構、多個物件或物件空間關係的複雜文字查詢，這是目前模型難以處理的情況。LLM-Optic 首先使用 LLM 作為文字基礎，來詮釋複雜的文字查詢，並準確辨識使用者想要定位的物件。然後使用預先訓練的視覺基礎模型，根據文字基礎所精煉的查詢產生候選邊界框。在那之後，LLM-Optic 使用數字標記註解候選邊界框，以便在文字和特定影像區域之間建立關聯，從而連結兩個不同的模態。最後，它使用大型多模態模型 (LMM) 作為視覺基礎，來選擇標記的候選物件，這些物件最符合原始文字查詢。透過 LLM-Optic，我們達到了通用的視覺基礎，這允許偵測由任意人類語言輸入指定的任意物件。重要的是，我們的方法在不需要額外訓練或微調的情況下實現了這種增強。透過各種具有挑戰性的基準測試進行的廣泛實驗證明，LLM-Optic 達到了最先進的零次視覺基礎能力。專案頁面：https://haoyu-zhao.github.io/LLM-Optic.github.io/。", "author": "Haoyu Zhao et.al.", "authors": "Haoyu Zhao, Wenhang Ge, Ying-cong Chen", "id": "2405.17104v2", "paper_url": "http://arxiv.org/abs/2405.17104v2", "repo": "null"}}