{"2408.00521": {"publish_time": "2024-08-01", "title": "A new approach for encoding code and assisting code understanding", "paper_summary": "Some companies(e.g., Microsoft Research and Google DeepMind) have discovered\nsome of the limitations of GPTs autoregressive paradigm next-word prediction,\nmanifested in the model lack of planning, working memory, backtracking, and\nreasoning skills. GPTs rely on a local and greedy process of generating the\nnext word, without a global understanding of the task or the output.We have\nconfirmed the above limitations through specialized empirical studies of code\ncomprehension. Although GPT4 is good at producing fluent and coherent text, it\ncannot handle complex logic and generate new code that haven not been seen, and\nit relies too much on the formatting of the prompt to generate the correct\ncode.We propose a new paradigm for code understanding that goes beyond the\nnext-word prediction paradigm, inspired by the successful application of\ndiffusion techniques to image generation(Dalle2, Sora) and protein structure\ngeneration(AlphaFold3), which have no autoregressive constraints.Instead of\nencoding the code in a form that mimics natural language, we encode the code as\na heterogeneous image paradigm with a memory of global information that mimics\nboth images and protein structures.We then refer to Sora's CLIP upstream\ntext-to-image encoder model to design a text-to-code encoder model that can be\napplied to various downstream code understanding tasks.The model learns the\nglobal understanding of code under the new paradigm heterogeneous image,\nconnects the encoding space of text and code, and encodes the input of text\ninto the vector of code most similar to it.Using self-supervised comparative\nlearning on 456,360 text-code pairs, the model achieved a zero-shot prediction\nof new data. This work is the basis for future work on code generation using\ndiffusion techniques under a new paradigm to avoid autoregressive limitations.", "paper_summary_zh": "一些公司（例如 Microsoft Research 和 Google DeepMind）已經發現 GPT 自動迴歸範例中的一些限制，即下一個字詞預測，體現在模型缺乏規劃、工作記憶、回溯和推理技能。GPT 依賴於產生下一個字詞的局部和貪婪過程，而沒有對任務或輸出的全局理解。我們已經通過程式碼理解的專門經驗研究確認了上述限制。儘管 GPT4 擅長產生流暢且連貫的文字，但它無法處理複雜的邏輯和產生未曾見過的新程式碼，而且它過於依賴提示的格式來產生正確的程式碼。我們提出了超越下一個字詞預測範例的程式碼理解新範例，靈感來自擴散技術成功應用於影像產生（Dalle2、Sora）和蛋白質結構產生（AlphaFold3），它們沒有自動迴歸約束。我們沒有使用模仿自然語言的形式對程式碼進行編碼，而是將程式碼編碼為異質影像範例，其中包含模仿影像和蛋白質結構的全局資訊記憶體。然後，我們參考 Sora 的 CLIP 上游文字轉影像編碼器模型，設計一個文字轉程式碼編碼器模型，該模型可應用於各種下游程式碼理解任務。該模型在新的範例異質影像下學習程式碼的全局理解，連接文字和程式碼的編碼空間，並將文字輸入編碼成與其最相似的程式碼向量。使用 456,360 個文字程式碼對上的自我監督比較學習，該模型實現了新資料的零次學習預測。這項工作是使用擴散技術在新的範例下進行程式碼產生的未來工作的基礎，以避免自動迴歸限制。", "author": "Mengdan Fan et.al.", "authors": "Mengdan Fan, Wei Zhang, Haiyan Zhao, Zhi Jin", "id": "2408.00521v1", "paper_url": "http://arxiv.org/abs/2408.00521v1", "repo": "null"}}