{"2408.07642": {"publish_time": "2024-08-14", "title": "Boosting Unconstrained Face Recognition with Targeted Style Adversary", "paper_summary": "While deep face recognition models have demonstrated remarkable performance,\nthey often struggle on the inputs from domains beyond their training data.\nRecent attempts aim to expand the training set by relying on computationally\nexpensive and inherently challenging image-space augmentation of image\ngeneration modules. In an orthogonal direction, we present a simple yet\neffective method to expand the training data by interpolating between\ninstance-level feature statistics across labeled and unlabeled sets. Our\nmethod, dubbed Targeted Style Adversary (TSA), is motivated by two\nobservations: (i) the input domain is reflected in feature statistics, and (ii)\nface recognition model performance is influenced by style information. Shifting\ntowards an unlabeled style implicitly synthesizes challenging training\ninstances. We devise a recognizability metric to constraint our framework to\npreserve the inherent identity-related information of labeled instances. The\nefficacy of our method is demonstrated through evaluations on unconstrained\nbenchmarks, outperforming or being on par with its competitors while offering\nnearly a 70\\% improvement in training speed and 40\\% less memory consumption.", "paper_summary_zh": "儘管深度人臉辨識模型已展現出卓越的效能，\n但它們在訓練資料以外的領域輸入中往往會遇到困難。\n最近的嘗試旨在透過依賴於計算成本高且本質上具有挑戰性的影像空間擴充技術，來擴充訓練組，以擴充影像產生模組。在正交方向上，我們提出了一個簡單但有效的方法，透過插補標籤和未標籤組中的實例層級特徵統計資料，來擴充訓練資料。我們的這個方法稱為目標樣式對抗 (TSA)，其動機來自兩個觀察結果：(i) 輸入領域反映在特徵統計資料中，以及 (ii) 人臉辨識模型效能受到樣式資訊的影響。轉移到未標籤樣式會隱含地合成具有挑戰性的訓練實例。我們設計了一個可辨識度量數，以限制我們的架構，以保留標籤實例中與身分相關的固有資訊。我們的方法的效能透過在不受約束的基準上進行評估，證明了其效能，其效能優於或與競爭者不相上下，同時在訓練速度上提升了近 70%，記憶體消耗減少了 40%。", "author": "Mohammad Saeed Ebrahimi Saadabadi et.al.", "authors": "Mohammad Saeed Ebrahimi Saadabadi, Sahar Rahimi Malakshan, Seyed Rasoul Hosseini, Nasser M. Nasrabadi", "id": "2408.07642v1", "paper_url": "http://arxiv.org/abs/2408.07642v1", "repo": "null"}}