{"2406.07113": {"publish_time": "2024-06-11", "title": "Beyond Bare Queries: Open-Vocabulary Object Retrieval with 3D Scene Graph", "paper_summary": "Locating objects referred to in natural language poses a significant\nchallenge for autonomous agents. Existing CLIP-based open-vocabulary methods\nsuccessfully perform 3D object retrieval with simple (bare) queries but cannot\ncope with ambiguous descriptions that demand an understanding of object\nrelations. To tackle this problem, we propose a modular approach called BBQ\n(Beyond Bare Queries), which constructs 3D scene spatial graph representation\nwith metric edges and utilizes a large language model as a human-to-agent\ninterface through our deductive scene reasoning algorithm. BBQ employs robust\nDINO-powered associations to form 3D objects, an advanced raycasting algorithm\nto project them to 2D, and a vision-language model to describe them as graph\nnodes. On Replica and ScanNet datasets, we show that the designed method\naccurately constructs 3D object-centric maps. We have demonstrated that their\nquality takes a leading place for open-vocabulary 3D semantic segmentation\nagainst other zero-shot methods. Also, we show that leveraging spatial\nrelations is especially effective for scenes containing multiple entities of\nthe same semantic class. On Sr3D and Nr3D benchmarks, our deductive approach\ndemonstrates a significant improvement, enabling retrieving objects by complex\nqueries compared to other state-of-the-art methods. Considering our design\nsolutions, we achieved a processing speed approximately x3 times faster than\nthe closest analog. This promising performance enables our approach for usage\nin applied intelligent robotics projects. We make the code publicly available\nat linukc.github.io/bbq/.", "paper_summary_zh": "<paragraph>在自然語言中，定位被引用的物件對自主代理人來說是一項重大的挑戰。現有的基於 CLIP 的開放式詞彙方法可以成功執行 3D 物件擷取，使用簡潔（單純）的查詢，但無法應對需要理解物件關係的含糊描述。為了解決這個問題，我們提出了一種名為 BBQ（超越單純查詢）的模組化方法，它使用度量邊緣構建 3D 場景空間圖形表示，並透過我們的演繹場景推理演算法，將大型語言模型用作人與代理人之間的介面。BBQ 使用強大的 DINO 驅動關聯來形成 3D 物件，一種先進的光線投射演算法將它們投射到 2D，以及一個視覺語言模型將它們描述為圖形節點。在 Replica 和 ScanNet 資料集上，我們展示了設計的方法可以準確地建構 3D 物件為中心的對應。我們已經證明，它們的品質在針對其他零次學習方法的開放式詞彙 3D 語意分割中處於領先地位。此外，我們展示了利用空間關係對於包含多個相同語意類別實體的場景特別有效。在 Sr3D 和 Nr3D 基準測試中，我們的演繹方法展示了顯著的進步，與其他最先進的方法相比，能夠透過複雜的查詢來擷取物件。考慮到我們的設計解決方案，我們實現的處理速度比最接近的類比快了約 3 倍。這種有前途的效能使我們的做法能夠用於應用智慧機器人專案。我們在 linukc.github.io/bbq/ 上公開程式碼。</paragraph>", "author": "Sergey Linok et.al.", "authors": "Sergey Linok, Tatiana Zemskova, Svetlana Ladanova, Roman Titkov, Dmitry Yudin", "id": "2406.07113v1", "paper_url": "http://arxiv.org/abs/2406.07113v1", "repo": "null"}}