{"2412.10266": {"publish_time": "2024-12-13", "title": "Reasoner Outperforms: Generative Stance Detection with Rationalization for Social Media", "paper_summary": "Stance detection is crucial for fostering a human-centric Web by analyzing\nuser-generated content to identify biases and harmful narratives that undermine\ntrust. With the development of Large Language Models (LLMs), existing\napproaches treat stance detection as a classification problem, providing robust\nmethodologies for modeling complex group interactions and advancing\ncapabilities in natural language tasks. However, these methods often lack\ninterpretability, limiting their ability to offer transparent and\nunderstandable justifications for predictions. This study adopts a generative\napproach, where stance predictions include explicit, interpretable rationales,\nand integrates them into smaller language models through single-task and\nmultitask learning. We find that incorporating reasoning into stance detection\nenables the smaller model (FlanT5) to outperform GPT-3.5's zero-shot\nperformance, achieving an improvement of up to 9.57%. Moreover, our results\nshow that reasoning capabilities enhance multitask learning performance but may\nreduce effectiveness in single-task settings. Crucially, we demonstrate that\nfaithful rationales improve rationale distillation into SLMs, advancing efforts\nto build interpretable, trustworthy systems for addressing discrimination,\nfostering trust, and promoting equitable engagement on social media.", "paper_summary_zh": "立場偵測對於促進以人為本的網路至關重要，透過分析使用者產生的內容來辨識破壞信任的偏見和有害敘述。隨著大型語言模型 (LLM) 的發展，現有的方法將立場偵測視為分類問題，提供強健的方法來建模複雜的群體互動，並提升自然語言任務的能力。然而，這些方法通常缺乏可解釋性，限制了它們提供透明且可理解的預測依據的能力。本研究採用生成式方法，其中立場預測包括明確、可解釋的依據，並透過單一任務和多任務學習將它們整合到較小的語言模型中。我們發現將推理納入立場偵測能讓較小的模型 (FlanT5) 優於 GPT-3.5 的零次學習效能，提升幅度最高達 9.57%。此外，我們的結果顯示推理能力提升了多任務學習效能，但可能降低單一任務設定中的效能。至關重要的是，我們證明忠實的依據能改善將依據萃取到 SLM 中，促進建構可解釋、值得信賴的系統，以解決歧視、建立信任，並在社群媒體上推廣公平的參與。", "author": "Jiaqing Yuan et.al.", "authors": "Jiaqing Yuan, Ruijie Xi, Munindar P. Singh", "id": "2412.10266v1", "paper_url": "http://arxiv.org/abs/2412.10266v1", "repo": "null"}}