{"2405.12433": {"publish_time": "2024-05-21", "title": "LLM+Reasoning+Planning for supporting incomplete user queries in presence of APIs", "paper_summary": "Recent availability of Large Language Models (LLMs) has led to the\ndevelopment of numerous LLM-based approaches aimed at providing natural\nlanguage interfaces for various end-user tasks. These end-user tasks in turn\ncan typically be accomplished by orchestrating a given set of APIs. In\npractice, natural language task requests (user queries) are often incomplete,\ni.e., they may not contain all the information required by the APIs. While LLMs\nexcel at natural language processing (NLP) tasks, they frequently hallucinate\non missing information or struggle with orchestrating the APIs. The key idea\nbehind our proposed approach is to leverage logical reasoning and classical AI\nplanning along with an LLM for accurately answering user queries including\nidentification and gathering of any missing information in these queries. Our\napproach uses an LLM and ASP (Answer Set Programming) solver to translate a\nuser query to a representation in Planning Domain Definition Language (PDDL)\nvia an intermediate representation in ASP. We introduce a special API\n\"get_info_api\" for gathering missing information. We model all the APIs as PDDL\nactions in a way that supports dataflow between the APIs. Our approach then\nuses a classical AI planner to generate an orchestration of API calls\n(including calls to get_info_api) to answer the user query. Our evaluation\nresults show that our approach significantly outperforms a pure LLM based\napproach by achieving over 95\\% success rate in most cases on a dataset\ncontaining complete and incomplete single goal and multi-goal queries where the\nmulti-goal queries may or may not require dataflow among the APIs.", "paper_summary_zh": "<paragraph>最近大型语言模型 (LLM) 的可用性促成了许多基于 LLM 的方法的发展，这些方法旨在为各种最终用户任务提供自然语言界面。这些最终用户任务反过来通常可以通过编排给定的 API 集来完成。在实践中，自然语言任务请求（用户查询）通常是不完整的，即它们可能不包含 API 所需的所有信息。虽然 LLM 在自然语言处理 (NLP) 任务中表现出色，但它们经常对缺失的信息产生幻觉或难以编排 API。我们提出的方法背后的关键思想是利用逻辑推理和经典 AI 规划以及 LLM 来准确回答用户查询，包括识别和收集这些查询中任何缺失的信息。我们的方法使用 LLM 和 ASP（Answer Set Programming）求解器，通过 ASP 中的中间表示将用户查询转换为规划域定义语言 (PDDL) 中的表示。我们引入了一个特殊 API “get_info_api” 来收集缺失的信息。我们将所有 API 建模为 PDDL 动作，以支持 API 之间的数据流。然后，我们的方法使用经典 AI 规划器生成 API 调用编排（包括对 get_info_api 的调用）来回答用户查询。我们的评估结果表明，我们的方法明显优于基于纯 LLM 的方法，在包含完整和不完整单目标和多目标查询的数据集上，在大多数情况下实现了超过 95% 的成功率，其中多目标查询可能需要也可能不需要 API 之间的数据流。</paragraph>", "author": "Sudhir Agarwal et.al.", "authors": "Sudhir Agarwal, Anu Sreepathy, David H. Alonso, Prarit Lamba", "id": "2405.12433v1", "paper_url": "http://arxiv.org/abs/2405.12433v1", "repo": "null"}}