{"2407.12671": {"publish_time": "2024-07-17", "title": "GraphMuse: A Library for Symbolic Music Graph Processing", "paper_summary": "Graph Neural Networks (GNNs) have recently gained traction in symbolic music\ntasks, yet a lack of a unified framework impedes progress. Addressing this gap,\nwe present GraphMuse, a graph processing framework and library that facilitates\nefficient music graph processing and GNN training for symbolic music tasks.\nCentral to our contribution is a new neighbor sampling technique specifically\ntargeted toward meaningful behavior in musical scores. Additionally, GraphMuse\nintegrates hierarchical modeling elements that augment the expressivity and\ncapabilities of graph networks for musical tasks. Experiments with two specific\nmusical prediction tasks -- pitch spelling and cadence detection -- demonstrate\nsignificant performance improvement over previous methods. Our hope is that\nGraphMuse will lead to a boost in, and standardization of, symbolic music\nprocessing based on graph representations. The library is available at\nhttps://github.com/manoskary/graphmuse", "paper_summary_zh": "圖形神經網路 (GNN) 近期在符號音樂任務中獲得關注，但缺乏統一的框架阻礙了進展。為了解決這個差距，我們提出了 GraphMuse，一個圖形處理框架和程式庫，它促進了符號音樂任務的高效音樂圖形處理和 GNN 訓練。我們貢獻的核心是一個新的鄰居採樣技術，特別針對音樂樂譜中的有意義行為。此外，GraphMuse 整合了階層式建模元素，以增強圖形網路在音樂任務中的表現力和能力。使用兩個特定的音樂預測任務（音高拼寫和終止檢測）進行的實驗證明了與以前的方法相比，有顯著的效能提升。我們希望 GraphMuse 能夠提升並標準化基於圖形表示的符號音樂處理。這個程式庫可在 https://github.com/manoskary/graphmuse 取得", "author": "Emmanouil Karystinaios et.al.", "authors": "Emmanouil Karystinaios, Gerhard Widmer", "id": "2407.12671v1", "paper_url": "http://arxiv.org/abs/2407.12671v1", "repo": "https://github.com/manoskary/graphmuse"}}