{"2410.23000": {"publish_time": "2024-10-30", "title": "Long$^2$RAG: Evaluating Long-Context & Long-Form Retrieval-Augmented Generation with Key Point Recall", "paper_summary": "Retrieval-augmented generation (RAG) is a promising approach to address the\nlimitations of fixed knowledge in large language models (LLMs). However,\ncurrent benchmarks for evaluating RAG systems suffer from two key deficiencies:\n(1) they fail to adequately measure LLMs' capability in handling long-context\nretrieval due to a lack of datasets that reflect the characteristics of\nretrieved documents, and (2) they lack a comprehensive evaluation method for\nassessing LLMs' ability to generate long-form responses that effectively\nexploits retrieved information. To address these shortcomings, we introduce the\nLong$^2$RAG benchmark and the Key Point Recall (KPR) metric. Long$^2$RAG\ncomprises 280 questions spanning 10 domains and across 8 question categories,\neach associated with 5 retrieved documents with an average length of 2,444\nwords. KPR evaluates the extent to which LLMs incorporate key points extracted\nfrom the retrieved documents into their generated responses, providing a more\nnuanced assessment of their ability to exploit retrieved information.", "paper_summary_zh": "檢索增強生成 (RAG) 是一種有前途的方法，可用於解決大型語言模型 (LLM) 中固定知識的限制。然而，當前用於評估 RAG 系統的基準有兩個主要的缺點：(1) 由於缺乏反映檢索文件特徵的資料集，它們無法充分衡量 LLM 在處理長內容檢索中的能力，以及 (2) 它們缺乏全面的評估方法，用於評估 LLM 生成長篇回應的能力，這些回應有效地利用了檢索到的資訊。為了解決這些缺點，我們引入了 Long$^2$RAG 基準和關鍵點召回率 (KPR) 度量。Long$^2$RAG 包含 280 個問題，涵蓋 10 個領域和 8 個問題類別，每個問題都與 5 個檢索到的文件關聯，平均長度為 2,444 個字元。KPR 評估了 LLM 將從檢索到的文件提取的關鍵點納入其生成回應的程度，提供了對其利用檢索資訊能力更細緻的評估。", "author": "Zehan Qi et.al.", "authors": "Zehan Qi, Rongwu Xu, Zhijiang Guo, Cunxiang Wang, Hao Zhang, Wei Xu", "id": "2410.23000v2", "paper_url": "http://arxiv.org/abs/2410.23000v2", "repo": "null"}}