{"2501.02531": {"publish_time": "2025-01-05", "title": "Towards New Benchmark for AI Alignment & Sentiment Analysis in Socially Important Issues: A Comparative Study of Human and LLMs in the Context of AGI", "paper_summary": "With the expansion of neural networks, such as large language models,\nhumanity is exponentially heading towards superintelligence. As various AI\nsystems are increasingly integrated into the fabric of societies-through\nrecommending values, devising creative solutions, and making decisions-it\nbecomes critical to assess how these AI systems impact humans in the long run.\nThis research aims to contribute towards establishing a benchmark for\nevaluating the sentiment of various Large Language Models in socially importan\nissues. The methodology adopted was a Likert scale survey. Seven LLMs,\nincluding GPT-4 and Bard, were analyzed and compared against sentiment data\nfrom three independent human sample populations. Temporal variations in\nsentiment were also evaluated over three consecutive days. The results\nhighlighted a diversity in sentiment scores among LLMs, ranging from 3.32 to\n4.12 out of 5. GPT-4 recorded the most positive sentiment score towards AGI,\nwhereas Bard was leaning towards the neutral sentiment. The human samples,\ncontrastingly, showed a lower average sentiment of 2.97. The temporal\ncomparison revealed differences in sentiment evolution between LLMs in three\ndays, ranging from 1.03% to 8.21%. The study's analysis outlines the prospect\nof potential conflicts of interest and bias possibilities in LLMs' sentiment\nformation. Results indicate that LLMs, akin to human cognitive processes, could\npotentially develop unique sentiments and subtly influence societies'\nperceptions towards various opinions formed within the LLMs.", "paper_summary_zh": "隨著神經網路的擴展，例如大型語言模型，\n人類正以指數方式邁向超級智慧。由於各種 AI\n系統正越來越融入社會結構中，透過\n推薦價值觀、設計創造性的解決方案和做出決策，\n評估這些 AI 系統如何對人類產生長遠影響變得至關重要。\n本研究旨在為建立評估各種大型語言模型在社會重要\n議題中的情緒基準做出貢獻。採用的方法是李克特量表調查。七種 LLM，\n包括 GPT-4 和 Bard，經過分析並與來自三個獨立人類樣本族群的情緒數據進行比較。時間上的情緒變化\n也在連續三天內進行評估。結果\n突顯了 LLM 之間情緒分數的多樣性，範圍從 5 分中的 3.32 到\n4.12。GPT-4 對 AGI 記錄了最正面的情緒分數，\n而 Bard 則傾向於中立的情緒。相反地，人類樣本\n顯示出較低的情緒平均值，為 2.97。時間\n比較顯示出 LLM 在三天內情緒演化的差異，範圍從 1.03% 到 8.21%。這項研究的分析概述了 LLM 情緒\n形成中潛在利益衝突和偏見的可能性。結果表明，LLM 類似於人類認知過程，可以\n潛在地發展出獨特的情緒，並微妙地影響社會對 LLM 內形成的各種觀點的看法。", "author": "Ljubisa Bojic et.al.", "authors": "Ljubisa Bojic, Dylan Seychell, Milan Cabarkapa", "id": "2501.02531v1", "paper_url": "http://arxiv.org/abs/2501.02531v1", "repo": "null"}}