{"2502.13685": {"publish_time": "2025-02-19", "title": "MoM: Linear Sequence Modeling with Mixture-of-Memories", "paper_summary": "Linear sequence modeling methods, such as linear attention, state space\nmodeling, and linear RNNs, offer significant efficiency improvements by\nreducing the complexity of training and inference. However, these methods\ntypically compress the entire input sequence into a single fixed-size memory\nstate, which leads to suboptimal performance on recall-intensive downstream\ntasks. Drawing inspiration from neuroscience, particularly the brain's ability\nto maintain robust long-term memory while mitigating \"memory interference\", we\nintroduce a novel architecture called Mixture-of-Memories (MoM). MoM utilizes\nmultiple independent memory states, with a router network directing input\ntokens to specific memory states. This approach greatly enhances the overall\nmemory capacity while minimizing memory interference. As a result, MoM performs\nexceptionally well on recall-intensive tasks, surpassing existing linear\nsequence modeling techniques. Despite incorporating multiple memory states, the\ncomputation of each memory state remains linear in complexity, allowing MoM to\nretain the linear-complexity advantage during training, while\nconstant-complexity during inference. Our experimental results show that MoM\nsignificantly outperforms current linear sequence models on downstream language\ntasks, particularly recall-intensive tasks, and even achieves performance\ncomparable to Transformer models. The code is released at\nhttps://github.com/OpenSparseLLMs/MoM and is also released as a part of\nhttps://github.com/OpenSparseLLMs/Linear-MoE.", "paper_summary_zh": "線性序列建模方法，例如線性注意力、狀態空間建模和線性 RNN，透過降低訓練和推論的複雜性，提供了顯著的效率改進。然而，這些方法通常會將整個輸入序列壓縮成一個單一的固定大小記憶體狀態，這會導致召回密集的下游任務的次佳效能。從神經科學中汲取靈感，特別是大腦在減輕「記憶干擾」的同時維持穩健長期記憶的能力，我們引入了一種名為記憶混合 (MoM) 的新架構。MoM 利用多個獨立的記憶體狀態，並透過路由器網路將輸入代碼導向特定的記憶體狀態。這種方法在最大程度減少記憶體干擾的同時，大幅提升了整體記憶體容量。因此，MoM 在召回密集任務上的表現極佳，超越了現有的線性序列建模技術。儘管整合了多個記憶體狀態，但每個記憶體狀態的運算在複雜度上仍然是線性的，這讓 MoM 在訓練期間能保有線性複雜度的優勢，而在推論期間則維持恆定複雜度。我們的實驗結果顯示，MoM 在下游語言任務上明顯優於目前的線性序列模型，特別是召回密集任務，甚至達到了與 Transformer 模型相當的效能。程式碼已發布於 https://github.com/OpenSparseLLMs/MoM，並作為 https://github.com/OpenSparseLLMs/Linear-MoE 的一部分發布。", "author": "Jusen Du et.al.", "authors": "Jusen Du, Weigao Sun, Disen Lan, Jiaxi Hu, Yu Cheng", "id": "2502.13685v1", "paper_url": "http://arxiv.org/abs/2502.13685v1", "repo": "null"}}