{"2406.07275": {"publish_time": "2024-06-11", "title": "DCA-Bench: A Benchmark for Dataset Curation Agents", "paper_summary": "The quality of datasets plays an increasingly crucial role in the research\nand development of modern artificial intelligence (AI). Despite the\nproliferation of open dataset platforms nowadays, data quality issues, such as\ninsufficient documentation, inaccurate annotations, and ethical concerns,\nremain common in datasets widely used in AI. Furthermore, these issues are\noften subtle and difficult to be detected by rule-based scripts, requiring\nexpensive manual identification and verification by dataset users or\nmaintainers. With the increasing capability of large language models (LLMs), it\nis promising to streamline the curation of datasets with LLM agents. In this\nwork, as the initial step towards this goal, we propose a dataset curation\nagent benchmark, DCA-Bench, to measure LLM agents' capability of detecting\nhidden dataset quality issues. Specifically, we collect diverse real-world\ndataset quality issues from eight open dataset platforms as a testbed.\nAdditionally, to establish an automatic pipeline for evaluating the success of\nLLM agents, which requires a nuanced understanding of the agent outputs, we\nimplement a dedicated Evaluator using another LLM agent. We demonstrate that\nthe LLM-based Evaluator empirically aligns well with human evaluation, allowing\nreliable automatic evaluation on the proposed benchmark. We further conduct\nexperiments on several baseline LLM agents on the proposed benchmark and\ndemonstrate the complexity of the task, indicating that applying LLMs to\nreal-world dataset curation still requires further in-depth exploration and\ninnovation. Finally, the proposed benchmark can also serve as a testbed for\nmeasuring the capability of LLMs in problem discovery rather than just\nproblem-solving. The benchmark suite is available at\n\\url{https://github.com/TRAIS-Lab/dca-bench}.", "paper_summary_zh": "<paragraph>資料集的品質在現代人工智慧 (AI) 的研究與開發中扮演著越來越關鍵的角色。儘管現今開放式資料集平台激增，資料品質問題，例如文件不足、註解不準確和道德疑慮，在廣泛使用於 AI 的資料集中仍然很常見。此外，這些問題通常很微妙，且難以透過基於規則的指令碼偵測，需要資料集使用者或維護人員進行昂貴的手動識別和驗證。隨著大型語言模型 (LLM) 能力的提升，使用 LLM 代理簡化資料集策展工作令人期待。在這項工作中，作為朝向此目標邁出的第一步，我們提出一個資料集策展代理基準測試，DCA-Bench，用於衡量 LLM 代理偵測隱藏資料集品質問題的能力。具體來說，我們從八個開放式資料集平台收集了各種真實世界的資料集品質問題作為測試平台。此外，為了建立一個用於評估 LLM 代理成功的自動化流程，這需要對代理輸出有細緻的了解，我們使用另一個 LLM 代理實作了一個專用的評估器。我們證明，基於 LLM 的評估器在經驗上與人工評估非常吻合，允許在所提出的基準測試上進行可靠的自動評估。我們進一步在所提出的基準測試上對幾個基線 LLM 代理進行實驗，並證明了這項任務的複雜性，表明將 LLM 應用於真實世界的資料集策展仍需要進一步的深入探索和創新。最後，所提出的基準測試也可以作為衡量 LLM 在問題發現而非僅僅問題解決方面的能力的測試平台。基準測試套件可在 \\url{https://github.com/TRAIS-Lab/dca-bench} 取得。</paragraph>", "author": "Benhao Huang et.al.", "authors": "Benhao Huang, Yingzhuo Yu, Jin Huang, Xingjian Zhang, Jiaqi Ma", "id": "2406.07275v1", "paper_url": "http://arxiv.org/abs/2406.07275v1", "repo": "null"}}