{"2409.05677": {"publish_time": "2024-09-09", "title": "RegNLP in Action: Facilitating Compliance Through Automated Information Retrieval and Answer Generation", "paper_summary": "Regulatory documents, issued by governmental regulatory bodies, establish\nrules, guidelines, and standards that organizations must adhere to for legal\ncompliance. These documents, characterized by their length, complexity and\nfrequent updates, are challenging to interpret, requiring significant\nallocation of time and expertise on the part of organizations to ensure ongoing\ncompliance.Regulatory Natural Language Processing (RegNLP) is a\nmultidisciplinary subfield aimed at simplifying access to and interpretation of\nregulatory rules and obligations. We define an Automated Question-Passage\nGeneration task for RegNLP, create the ObliQA dataset containing 27,869\nquestions derived from the Abu Dhabi Global Markets (ADGM) financial regulation\ndocument collection, design a baseline Regulatory Information Retrieval and\nAnswer Generation system, and evaluate it with RePASs, a novel evaluation\nmetric that tests whether generated answers accurately capture all relevant\nobligations and avoid contradictions.", "paper_summary_zh": "由政府監管機構發布的法規文件，制定了組織必須遵守的法律規範、準則和標準。這些文件以其長度、複雜性和頻繁更新為特徵，難以解釋，需要組織投入大量時間和專業知識來確保持續合規。法規自然語言處理 (RegNLP) 是一個多學科子領域，旨在簡化對法規和義務的存取和解釋。我們為 RegNLP 定義了一項自動化問題段落生成任務，建立了包含 27,869 個問題的 ObliQA 資料集，這些問題來自阿布達比全球市場 (ADGM) 金融法規文件彙編，設計了一個基線法規資訊檢索和答案生成系統，並使用 RePASs 對其進行評估，RePASs 是一個新穎的評估指標，用於測試生成的答案是否準確地涵蓋所有相關義務並避免矛盾。", "author": "Tuba Gokhan et.al.", "authors": "Tuba Gokhan, Kexin Wang, Iryna Gurevych, Ted Briscoe", "id": "2409.05677v1", "paper_url": "http://arxiv.org/abs/2409.05677v1", "repo": "null"}}