{"2406.04712": {"publish_time": "2024-06-07", "title": "AICoderEval: Improving AI Domain Code Generation of Large Language Models", "paper_summary": "Automated code generation is a pivotal capability of large language models\n(LLMs). However, assessing this capability in real-world scenarios remains\nchallenging. Previous methods focus more on low-level code generation, such as\nmodel loading, instead of generating high-level codes catering for real-world\ntasks, such as image-to-text, text classification, in various domains.\nTherefore, we construct AICoderEval, a dataset focused on real-world tasks in\nvarious domains based on HuggingFace, PyTorch, and TensorFlow, along with\ncomprehensive metrics for evaluation and enhancing LLMs' task-specific code\ngeneration capability. AICoderEval contains test cases and complete programs\nfor automated evaluation of these tasks, covering domains such as natural\nlanguage processing, computer vision, and multimodal learning. To facilitate\nresearch in this area, we open-source the AICoderEval dataset at\n\\url{https://huggingface.co/datasets/vixuowis/AICoderEval}. After that, we\npropose CoderGen, an agent-based framework, to help LLMs generate codes related\nto real-world tasks on the constructed AICoderEval. Moreover, we train a more\npowerful task-specific code generation model, named AICoder, which is refined\non llama-3 based on AICoderEval. Our experiments demonstrate the effectiveness\nof CoderGen in improving LLMs' task-specific code generation capability (by\n12.00\\% on pass@1 for original model and 9.50\\% on pass@1 for ReAct Agent).\nAICoder also outperforms current code generation LLMs, indicating the great\nquality of the AICoderEval benchmark.", "paper_summary_zh": "<paragraph>自動程式碼產生是大語言模型 (LLM) 的關鍵能力。然而，在現實世界的場景中評估此能力仍然具有挑戰性。先前的做法更專注於低層級程式碼產生，例如模型載入，而不是產生適用於現實世界任務的高層級程式碼，例如影像轉文字、文字分類等，涵蓋各種領域。因此，我們建構了 AICoderEval，一個專注於各種領域的現實世界任務的資料集，基於 HuggingFace、PyTorch 和 TensorFlow，以及用於評估和增強 LLM 任務特定程式碼產生能力的綜合指標。AICoderEval 包含測試案例和完整程式，用於自動評估這些任務，涵蓋自然語言處理、電腦視覺和多模態學習等領域。為了促進這方面的研究，我們在 \\url{https://huggingface.co/datasets/vixuowis/AICoderEval} 開源了 AICoderEval 資料集。在那之後，我們提出了基於代理的架構 CoderGen，以幫助 LLM 在建構的 AICoderEval 上產生與現實世界任務相關的程式碼。此外，我們訓練了一個更強大的任務特定程式碼產生模型，稱為 AICoder，它根據 AICoderEval 在 llama-3 上進行了改進。我們的實驗證明了 CoderGen 在改進 LLM 的任務特定程式碼產生能力方面的有效性（對於原始模型，pass@1 提高了 12.00%，對於 ReAct Agent，pass@1 提高了 9.50%）。AICoder 也超越了目前的程式碼產生 LLM，這表示 AICoderEval 基準的品質極佳。</paragraph>", "author": "Yinghui Xia et.al.", "authors": "Yinghui Xia, Yuyan Chen, Tianyu Shi, Jun Wang, Jinsong Yang", "id": "2406.04712v1", "paper_url": "http://arxiv.org/abs/2406.04712v1", "repo": "null"}}