{"2410.14581": {"publish_time": "2024-10-18", "title": "Optimizing Attention with Mirror Descent: Generalized Max-Margin Token Selection", "paper_summary": "Attention mechanisms have revolutionized several domains of artificial\nintelligence, such as natural language processing and computer vision, by\nenabling models to selectively focus on relevant parts of the input data. While\nrecent work has characterized the optimization dynamics of gradient descent\n(GD) in attention-based models and the structural properties of its preferred\nsolutions, less is known about more general optimization algorithms such as\nmirror descent (MD). In this paper, we investigate the convergence properties\nand implicit biases of a family of MD algorithms tailored for softmax attention\nmechanisms, with the potential function chosen as the $p$-th power of the\n$\\ell_p$-norm. Specifically, we show that these algorithms converge in\ndirection to a generalized hard-margin SVM with an $\\ell_p$-norm objective when\napplied to a classification problem using a softmax attention model. Notably,\nour theoretical results reveal that the convergence rate is comparable to that\nof traditional GD in simpler models, despite the highly nonlinear and nonconvex\nnature of the present problem. Additionally, we delve into the joint\noptimization dynamics of the key-query matrix and the decoder, establishing\nconditions under which this complex joint optimization converges to their\nrespective hard-margin SVM solutions. Lastly, our numerical experiments on real\ndata demonstrate that MD algorithms improve generalization over standard GD and\nexcel in optimal token selection.", "paper_summary_zh": "注意力机制通过让模型有选择地关注输入数据中的相关部分，彻底改变了人工智能的几个领域，例如自然语言处理和计算机视觉。虽然最近的研究描述了基于注意力的模型中梯度下降 (GD) 的优化动态及其首选解决方案的结构属性，但对于镜像下降 (MD) 等更通用的优化算法了解较少。在本文中，我们研究了专为 softmax 注意力机制设计的 MD 算法系列的收敛属性和隐式偏差，其中潜在函数选择为 $\\ell_p$-范数的 $p$-次幂。具体来说，我们表明当这些算法应用于使用 softmax 注意力模型的分类问题时，它们在方向上收敛到具有 $\\ell_p$-范数目标的广义硬边距 SVM。值得注意的是，我们的理论结果表明，尽管当前问题的非线性和非凸性，收敛速度与更简单模型中的传统 GD 相当。此外，我们深入研究了键查询矩阵和解码器的联合优化动态，建立了复杂联合优化收敛到其各自的硬边距 SVM 解的条件。最后，我们在真实数据上的数值实验表明，MD 算法改进了对标准 GD 的泛化，并在最佳标记选择中表现出色。", "author": "Aaron Alvarado Kristanto Julistiono et.al.", "authors": "Aaron Alvarado Kristanto Julistiono, Davoud Ataee Tarzanagh, Navid Azizan", "id": "2410.14581v1", "paper_url": "http://arxiv.org/abs/2410.14581v1", "repo": "null"}}