{"2412.18603": {"publish_time": "2024-12-24", "title": "Long-Form Speech Generation with Spoken Language Models", "paper_summary": "We consider the generative modeling of speech over multiple minutes, a\nrequirement for long-form multimedia generation and audio-native voice\nassistants. However, current spoken language models struggle to generate\nplausible speech past tens of seconds, from high temporal resolution of speech\ntokens causing loss of coherence, to architectural issues with long-sequence\ntraining or extrapolation, to memory costs at inference time. With these\nconsiderations we propose SpeechSSM, the first speech language model to learn\nfrom and sample long-form spoken audio (e.g., 16 minutes of read or\nextemporaneous speech) in a single decoding session without text intermediates,\nbased on recent advances in linear-time sequence modeling. Furthermore, to\naddress growing challenges in spoken language evaluation, especially in this\nnew long-form setting, we propose: new embedding-based and LLM-judged metrics;\nquality measurements over length and time; and a new benchmark for long-form\nspeech processing and generation, LibriSpeech-Long. Speech samples and the\ndataset are released at\nhttps://google.github.io/tacotron/publications/speechssm/", "paper_summary_zh": "我們考慮多分鐘的語音生成模型，這是長篇多媒體生成和音訊原生語音助理的要求。然而，目前的口語語言模型難以生成超過數十秒的可信語音，從語音標記的高時間解析度導致一致性喪失，到長序列訓練或外推的架構問題，再到推理時間的記憶體成本。考量這些因素，我們提出 SpeechSSM，這是第一個從長篇口語音訊（例如，16 分鐘的朗讀或即興演講）學習並取樣的語音語言模型，在單一解碼會話中，沒有文字中間產物，基於線性時間序列建模的最新進展。此外，為了解決口語語言評估中日益嚴峻的挑戰，特別是在這個新的長篇設定中，我們提出：新的基於嵌入和 LLM 判斷的指標；長度和時間的品質測量；以及長篇語音處理和生成的新的基準，LibriSpeech-Long。語音範例和資料集已於 https://google.github.io/tacotron/publications/speechssm/ 發布。", "author": "Se Jin Park et.al.", "authors": "Se Jin Park, Julian Salazar, Aren Jansen, Keisuke Kinoshita, Yong Man Ro, RJ Skerry-Ryan", "id": "2412.18603v1", "paper_url": "http://arxiv.org/abs/2412.18603v1", "repo": "https://github.com/google-deepmind/librispeech-long"}}