{"2412.10849": {"publish_time": "2024-12-14", "title": "Superhuman performance of a large language model on the reasoning tasks of a physician", "paper_summary": "Performance of large language models (LLMs) on medical tasks has\ntraditionally been evaluated using multiple choice question benchmarks.\nHowever, such benchmarks are highly constrained, saturated with repeated\nimpressive performance by LLMs, and have an unclear relationship to performance\nin real clinical scenarios. Clinical reasoning, the process by which physicians\nemploy critical thinking to gather and synthesize clinical data to diagnose and\nmanage medical problems, remains an attractive benchmark for model performance.\nPrior LLMs have shown promise in outperforming clinicians in routine and\ncomplex diagnostic scenarios. We sought to evaluate OpenAI's o1-preview model,\na model developed to increase run-time via chain of thought processes prior to\ngenerating a response. We characterize the performance of o1-preview with five\nexperiments including differential diagnosis generation, display of diagnostic\nreasoning, triage differential diagnosis, probabilistic reasoning, and\nmanagement reasoning, adjudicated by physician experts with validated\npsychometrics. Our primary outcome was comparison of the o1-preview output to\nidentical prior experiments that have historical human controls and benchmarks\nof previous LLMs. Significant improvements were observed with differential\ndiagnosis generation and quality of diagnostic and management reasoning. No\nimprovements were observed with probabilistic reasoning or triage differential\ndiagnosis. This study highlights o1-preview's ability to perform strongly on\ntasks that require complex critical thinking such as diagnosis and management\nwhile its performance on probabilistic reasoning tasks was similar to past\nmodels. New robust benchmarks and scalable evaluation of LLM capabilities\ncompared to human physicians are needed along with trials evaluating AI in real\nclinical settings.", "paper_summary_zh": "大型語言模型 (LLM) 在醫療任務中的表現通常使用多選題基準進行評估。然而，此類基準受到高度限制，充斥著 LLM 重複且令人印象深刻的表現，且與實際臨床場景中的表現關係不明確。臨床推理，即醫師運用批判性思考收集和綜合臨床資料以診斷和管理醫療問題的過程，仍然是模型表現的誘人基準。先前的 LLM 已展現出在常規和複雜診斷場景中優於臨床醫師的潛力。我們試圖評估 OpenAI 的 o1-preview 模型，這是一個在產生回應之前透過思考過程鏈來增加執行時間的模型。我們透過五項實驗來描述 o1-preview 的表現，包括鑑別診斷產生、診斷推理顯示、分流鑑別診斷、機率推理和管理推理，並由經過驗證的心理測量學的醫師專家進行判定。我們的主要結果是將 o1-preview 輸出與具有歷史人類控制和先前 LLM 基準的相同先前實驗進行比較。在鑑別診斷產生和診斷和管理推理品質方面觀察到顯著的進步。在機率推理或分流鑑別診斷方面沒有觀察到進步。這項研究突顯了 o1-preview 在執行需要複雜批判性思考的任務（例如診斷和管理）方面的強大能力，而它在機率推理任務中的表現則與過去的模型類似。需要新的穩健基準和 LLM 能力的可擴充評估，與人類醫師進行比較，以及評估 AI 在實際臨床環境中的試驗。", "author": "Peter G. Brodeur et.al.", "authors": "Peter G. Brodeur, Thomas A. Buckley, Zahir Kanjee, Ethan Goh, Evelyn Bin Ling, Priyank Jain, Stephanie Cabral, Raja-Elie Abdulnour, Adrian Haimovich, Jason A. Freed, Andrew Olson, Daniel J. Morgan, Jason Hom, Robert Gallo, Eric Horvitz, Jonathan Chen, Arjun K. Manrai, Adam Rodman", "id": "2412.10849v1", "paper_url": "http://arxiv.org/abs/2412.10849v1", "repo": "null"}}