{"2412.18157": {"publish_time": "2024-12-24", "title": "Smooth-Foley: Creating Continuous Sound for Video-to-Audio Generation Under Semantic Guidance", "paper_summary": "The video-to-audio (V2A) generation task has drawn attention in the field of\nmultimedia due to the practicality in producing Foley sound. Semantic and\ntemporal conditions are fed to the generation model to indicate sound events\nand temporal occurrence. Recent studies on synthesizing immersive and\nsynchronized audio are faced with challenges on videos with moving visual\npresence. The temporal condition is not accurate enough while low-resolution\nsemantic condition exacerbates the problem. To tackle these challenges, we\npropose Smooth-Foley, a V2A generative model taking semantic guidance from the\ntextual label across the generation to enhance both semantic and temporal\nalignment in audio. Two adapters are trained to leverage pre-trained\ntext-to-audio generation models. A frame adapter integrates high-resolution\nframe-wise video features while a temporal adapter integrates temporal\nconditions obtained from similarities of visual frames and textual labels. The\nincorporation of semantic guidance from textual labels achieves precise\naudio-video alignment. We conduct extensive quantitative and qualitative\nexperiments. Results show that Smooth-Foley performs better than existing\nmodels on both continuous sound scenarios and general scenarios. With semantic\nguidance, the audio generated by Smooth-Foley exhibits higher quality and\nbetter adherence to physical laws.", "paper_summary_zh": "影片轉音訊 (V2A) 生成任務在多媒體領域中備受關注，因為在製作 Foley 音效方面實用。語意和時間條件會提供給生成模型，以表示音效事件和時間發生。最近關於合成沉浸式和同步音訊的研究面臨影片中移動視覺存在性的挑戰。時間條件不夠準確，而低解析度語意條件會加劇問題。為了應對這些挑戰，我們提出 Smooth-Foley，一個 V2A 生成模型，從生成過程中文字標籤中獲取語意指導，以增強音訊中的語意和時間對齊。訓練兩個適配器，以利用預先訓練的文字轉音訊生成模型。一個框架適配器整合高解析度逐幀影片特徵，而時間適配器整合從視覺幀和文字標籤相似性中獲得的時間條件。從文字標籤中加入語意指導可達成精準的音訊視訊對齊。我們進行廣泛的量化和定性實驗。結果顯示，Smooth-Foley 在連續音訊場景和一般場景中都比現有模型表現得更好。有了語意指導，Smooth-Foley 生成的音訊品質更高，且更符合物理定律。", "author": "Yaoyun Zhang et.al.", "authors": "Yaoyun Zhang, Xuenan Xu, Mengyue Wu", "id": "2412.18157v1", "paper_url": "http://arxiv.org/abs/2412.18157v1", "repo": "null"}}