{"2501.14649": {"publish_time": "2025-01-24", "title": "Investigating the (De)Composition Capabilities of Large Language Models in Natural-to-Formal Language Conversion", "paper_summary": "To achieve generalized and robust natural-to-formal language conversion\n(N2F), large language models (LLMs) need to have strong capabilities of\ndecomposition and composition in N2F when faced with an unfamiliar formal\nlanguage and be able to cope with compositional gaps and counter-intuitive\nsymbolic names. To investigate whether LLMs have this set of basic capabilities\nin N2F, we propose the DEDC framework. This framework semi-automatically\nperforms sample and task construction, allowing decoupled evaluation of the set\nof decomposition and composition capabilities of LLMs in N2F. Based on this\nframework, we evaluate and analyze the most advanced LLMs, and the main\nfindings include that: (1) the LLMs are deficient in both decomposition and\ncomposition; (2) the LLMs show a wide coverage of error types that can be\nattributed to deficiencies in natural language understanding and the learning\nand use of symbolic systems; (3) compositional gaps and counter-intuitive\nsymbolic names both affect the decomposition and composition of the LLMs. Our\nwork provides a new perspective for investigating the basic capabilities of\ndecomposition and composition of LLMs in N2F. The detailed analysis of\ndeficiencies and attributions can help subsequent improvements of LLMs.", "paper_summary_zh": "<paragraph>為了達成廣泛且穩健的自然語言轉換為形式語言（N2F），大型語言模型（LLM）需要在面對不熟悉的形式語言時擁有強大的 N2F 分解和組合能力，並能夠應對組合間隔和反直覺的符號名稱。為了探究 LLM 是否具備這組 N2F 基本能力，我們提出了 DEDC 架構。此架構半自動執行範例和任務建構，允許對 LLM 在 N2F 中的分解和組合能力組進行解耦評估。根據此架構，我們評估和分析最先進的 LLM，主要發現包括：(1) LLM 在分解和組合方面均有缺陷；(2) LLM 顯示出廣泛的錯誤類型，可歸因於自然語言理解以及符號系統的學習和使用方面的缺陷；(3) 組合間隔和反直覺的符號名稱都會影響 LLM 的分解和組合。我們的研究為探究 LLM 在 N2F 中的分解和組合基本能力提供了新的觀點。對缺陷和歸因的詳細分析有助於後續改進 LLM。</paragraph>", "author": "Ziyao Xu et.al.", "authors": "Ziyao Xu, Houfeng Wang", "id": "2501.14649v1", "paper_url": "http://arxiv.org/abs/2501.14649v1", "repo": "https://github.com/xzy-xzy/dedc"}}