{"2409.17958": {"publish_time": "2024-09-26", "title": "The Hard Positive Truth about Vision-Language Compositionality", "paper_summary": "Several benchmarks have concluded that our best vision-language models (e.g.,\nCLIP) are lacking in compositionality. Given an image, these benchmarks probe a\nmodel's ability to identify its associated caption amongst a set of\ncompositional distractors. In response, a surge of recent proposals show\nimprovements by finetuning CLIP with distractors as hard negatives. Our\ninvestigations reveal that these improvements have, in fact, been significantly\noverstated -- because existing benchmarks do not probe whether finetuned\nvision-language models remain invariant to hard positives. By curating an\nevaluation dataset with 112,382 hard negatives and hard positives, we uncover\nthat including hard positives decreases CLIP's performance by 12.9%, while\nhumans perform effortlessly at 99%. CLIP finetuned with hard negatives results\nin an even larger decrease, up to 38.7%. With this finding, we then produce a\n1,775,259 image-text training set with both hard negative and hard positive\ncaptions. By training with both, we see improvements on existing benchmarks\nwhile simultaneously improving performance on hard positives, indicating a more\nrobust improvement in compositionality. Our work suggests the need for future\nresearch to rigorously test and improve CLIP's understanding of semantic\nrelationships between related \"positive\" concepts.", "paper_summary_zh": "多項基準已得出結論，我們的最佳視覺語言模型 (例如 CLIP) 缺乏組成性。給定一張圖像，這些基準會探討模型在組成式干擾項中識別其關聯標題的能力。作為回應，最近的一系列提案顯示，通過使用干擾項作為硬負例對 CLIP 進行微調可以改善模型。我們的調查顯示，這些改進實際上已被大幅誇大——因為現有的基準並未探討經過微調的視覺語言模型是否對硬正例保持不變。通過策劃一個包含 112,382 個硬負例和硬正例的評估資料集，我們發現包含硬正例會使 CLIP 的效能降低 12.9%，而人類則毫不費力地達到了 99%。使用硬負例微調的 CLIP 導致效能下降幅度更大，最高達 38.7%。有了這個發現，我們接著製作了一個包含硬負例和硬正例標題的 1,775,259 張圖像文字訓練集。通過同時使用這兩個標題進行訓練，我們看到現有基準有所改善，同時也改善了對硬正例的效能，這表示組成性有了更顯著的改善。我們的研究表明，未來需要進行嚴謹的測試和改進，以了解 CLIP 對相關「正向」概念之間語義關係的理解。", "author": "Amita Kamath et.al.", "authors": "Amita Kamath, Cheng-Yu Hsieh, Kai-Wei Chang, Ranjay Krishna", "id": "2409.17958v1", "paper_url": "http://arxiv.org/abs/2409.17958v1", "repo": "null"}}