{"2504.01947": {"publish_time": "2025-04-02", "title": "Efficient Federated Learning Tiny Language Models for Mobile Network Feature Prediction", "paper_summary": "In telecommunications, Autonomous Networks (ANs) automatically adjust\nconfigurations based on specific requirements (e.g., bandwidth) and available\nresources. These networks rely on continuous monitoring and intelligent\nmechanisms for self-optimization, self-repair, and self-protection, nowadays\nenhanced by Neural Networks (NNs) to enable predictive modeling and pattern\nrecognition. Here, Federated Learning (FL) allows multiple AN cells - each\nequipped with NNs - to collaboratively train models while preserving data\nprivacy. However, FL requires frequent transmission of large neural data and\nthus an efficient, standardized compression strategy for reliable\ncommunication. To address this, we investigate NNCodec, a Fraunhofer\nimplementation of the ISO/IEC Neural Network Coding (NNC) standard, within a\nnovel FL framework that integrates tiny language models (TLMs) for various\nmobile network feature prediction (e.g., ping, SNR or band frequency). Our\nexperimental results on the Berlin V2X dataset demonstrate that NNCodec\nachieves transparent compression (i.e., negligible performance loss) while\nreducing communication overhead to below 1%, showing the effectiveness of\ncombining NNC with FL in collaboratively learned autonomous mobile networks.", "paper_summary_zh": "<paragraph>在電信領域中，自主網路 (AN) 會根據特定需求（例如頻寬）和可用資源自動調整配置。這些網路依賴持續監控和智能機制來進行自我優化、自我修復和自我保護，如今藉由神經網路 (NN) 的強化，實現預測建模和模式識別。在這裡，聯邦學習 (FL) 允許多個配備 NN 的 AN 基地台協作訓練模型，同時保護資料隱私。然而，FL 需要頻繁傳輸大量的神經網路資料，因此需要一種高效、標準化的壓縮策略來確保可靠的通訊。為了應對此問題，我們在一個整合了小型語言模型 (TLM) 的新型 FL 架構中研究了 NNCodec，這是 Fraunhofer 對 ISO/IEC 神經網路編碼 (NNC) 標準的實作，用於各種行動網路功能預測（例如 ping、SNR 或頻段頻率）。我們在 Berlin V2X 資料集上的實驗結果表明，NNCodec 實現了透明壓縮（即效能損失可忽略不計），同時將通訊開銷降低到 1% 以下，展現了將 NNC 與 FL 結合用於協作學習自主行動網路的有效性。</paragraph>\n", "author": "Daniel Becking et.al.", "authors": "Daniel Becking, Ingo Friese, Karsten Müller, Thomas Buchholz, Mandy Galkow-Schneider, Wojciech Samek, Detlev Marpe", "id": "2504.01947v1", "paper_url": "http://arxiv.org/abs/2504.01947v1", "repo": "null"}}