{"2411.08745": {"publish_time": "2024-11-13", "title": "Separating Tongue from Thought: Activation Patching Reveals Language-Agnostic Concept Representations in Transformers", "paper_summary": "A central question in multilingual language modeling is whether large\nlanguage models (LLMs) develop a universal concept representation, disentangled\nfrom specific languages. In this paper, we address this question by analyzing\nlatent representations (latents) during a word translation task in\ntransformer-based LLMs. We strategically extract latents from a source\ntranslation prompt and insert them into the forward pass on a target\ntranslation prompt. By doing so, we find that the output language is encoded in\nthe latent at an earlier layer than the concept to be translated. Building on\nthis insight, we conduct two key experiments. First, we demonstrate that we can\nchange the concept without changing the language and vice versa through\nactivation patching alone. Second, we show that patching with the mean over\nlatents across different languages does not impair and instead improves the\nmodels' performance in translating the concept. Our results provide evidence\nfor the existence of language-agnostic concept representations within the\ninvestigated models.", "paper_summary_zh": "多語言語言模型中的核心問題是大型語言模型 (LLM) 是否發展出一個通用的概念表徵，與特定語言脫鉤。在本文中，我們透過分析Transformer式 LLM 中字詞翻譯任務中的潛在表徵 (latents) 來探討這個問題。我們策略性地從原始翻譯提示中擷取潛在表徵，並將它們插入目標翻譯提示的正向傳遞中。透過這麼做，我們發現輸出語言在潛在表徵中編碼的層級比要翻譯的概念還早。基於這個見解，我們進行了兩個關鍵實驗。首先，我們證明我們可以單獨透過啟動程序修補來改變概念，而不用改變語言，反之亦然。其次，我們表明，使用不同語言的潛在表徵的平均值進行修補不會損害，反而會提升模型翻譯概念的效能。我們的結果提供了證據，證明在調查的模型中存在與語言無關的概念表徵。", "author": "Clément Dumas et.al.", "authors": "Clément Dumas, Chris Wendler, Veniamin Veselovsky, Giovanni Monea, Robert West", "id": "2411.08745v1", "paper_url": "http://arxiv.org/abs/2411.08745v1", "repo": "https://github.com/butanium/llm-lang-agnostic"}}