{"2412.04445": {"publish_time": "2024-12-05", "title": "Moto: Latent Motion Token as the Bridging Language for Robot Manipulation", "paper_summary": "Recent developments in Large Language Models pre-trained on extensive corpora\nhave shown significant success in various natural language processing tasks\nwith minimal fine-tuning. This success offers new promise for robotics, which\nhas long been constrained by the high cost of action-labeled data. We ask:\ngiven the abundant video data containing interaction-related knowledge\navailable as a rich \"corpus\", can a similar generative pre-training approach be\neffectively applied to enhance robot learning? The key challenge is to identify\nan effective representation for autoregressive pre-training that benefits robot\nmanipulation tasks. Inspired by the way humans learn new skills through\nobserving dynamic environments, we propose that effective robotic learning\nshould emphasize motion-related knowledge, which is closely tied to low-level\nactions and is hardware-agnostic, facilitating the transfer of learned motions\nto actual robot actions. To this end, we introduce Moto, which converts video\ncontent into latent Motion Token sequences by a Latent Motion Tokenizer,\nlearning a bridging \"language\" of motion from videos in an unsupervised manner.\nWe pre-train Moto-GPT through motion token autoregression, enabling it to\ncapture diverse visual motion knowledge. After pre-training, Moto-GPT\ndemonstrates the promising ability to produce semantically interpretable motion\ntokens, predict plausible motion trajectories, and assess trajectory\nrationality through output likelihood. To transfer learned motion priors to\nreal robot actions, we implement a co-fine-tuning strategy that seamlessly\nbridges latent motion token prediction and real robot control. Extensive\nexperiments show that the fine-tuned Moto-GPT exhibits superior robustness and\nefficiency on robot manipulation benchmarks, underscoring its effectiveness in\ntransferring knowledge from video data to downstream visual manipulation tasks.", "paper_summary_zh": "<paragraph>大型语言模型在大量语料库上进行预训练的最新进展\n在各种自然语言处理任务中表现出显著的成功，\n只需进行最少的微调。这一成功为机器人技术带来了新的希望，\n机器人技术长期以来一直受到动作标记数据的高成本的制约。我们问：\n鉴于包含交互相关知识的丰富视频数据\n可用作丰富的“语料库”，类似的生成式预训练方法可以\n有效地应用于增强机器人学习吗？关键的挑战是识别\n一个有效的表示，用于自回归预训练，该表示有利于机器人\n操作任务。受人类通过\n观察动态环境学习新技能的方式的启发，我们提出有效的机器人学习\n应该强调与运动相关的知识，这与低级\n动作密切相关，并且与硬件无关，从而促进学习动作的转移\n到实际的机器人动作。为此，我们引入了 Moto，它将视频\n内容通过潜在运动标记化器转换为潜在运动标记序列，\n以无监督的方式从视频中学习运动的桥接“语言”。\n我们通过运动标记自回归对 Moto-GPT 进行预训练，使其能够\n捕捉不同的视觉运动知识。预训练后，Moto-GPT\n展示了生成语义可解释运动标记、预测合理的运动轨迹，以及评估轨迹\n通过输出可能性进行合理性。为了将学习到的运动先验转移到\n真正的机器人动作，我们实施了协同微调策略，该策略无缝\n桥接潜在运动标记预测和真正的机器人控制。广泛的\n实验表明，微调后的 Moto-GPT 在机器人操作基准测试中表现出卓越的鲁棒性和\n效率，强调了其从视频数据到下游视觉操纵任务转移知识的有效性。</paragraph>", "author": "Yi Chen et.al.", "authors": "Yi Chen, Yuying Ge, Yizhuo Li, Yixiao Ge, Mingyu Ding, Ying Shan, Xihui Liu", "id": "2412.04445v1", "paper_url": "http://arxiv.org/abs/2412.04445v1", "repo": "null"}}