{"2409.16821": {"publish_time": "2024-09-25", "title": "XAI-guided Insulator Anomaly Detection for Imbalanced Datasets", "paper_summary": "Power grids serve as a vital component in numerous industries, seamlessly\ndelivering electrical energy to industrial processes and technologies, making\ntheir safe and reliable operation indispensable. However, powerlines can be\nhard to inspect due to difficult terrain or harsh climatic conditions.\nTherefore, unmanned aerial vehicles are increasingly deployed to inspect\npowerlines, resulting in a substantial stream of visual data which requires\nswift and accurate processing. Deep learning methods have become widely popular\nfor this task, proving to be a valuable asset in fault detection. In\nparticular, the detection of insulator defects is crucial for predicting\npowerline failures, since their malfunction can lead to transmission\ndisruptions. It is therefore of great interest to continuously maintain and\nrigorously inspect insulator components. In this work we propose a novel\npipeline to tackle this task. We utilize state-of-the-art object detection to\ndetect and subsequently classify individual insulator anomalies. Our approach\naddresses dataset challenges such as imbalance and motion-blurred images\nthrough a fine-tuning methodology which allows us to alter the classification\nfocus of the model by increasing the classification accuracy of anomalous\ninsulators. In addition, we employ explainable-AI tools for precise\nlocalization and explanation of anomalies. This proposed method contributes to\nthe field of anomaly detection, particularly vision-based industrial inspection\nand predictive maintenance. We significantly improve defect detection accuracy\nby up to 13%, while also offering a detailed analysis of model\nmis-classifications and localization quality, showcasing the potential of our\nmethod on real-world data.", "paper_summary_zh": "電力網路在許多產業中扮演著至關重要的角色，無縫地將電力傳輸到工業流程和技術，使其安全且可靠的運作不可或缺。然而，由於地形崎嶇或氣候條件惡劣，電力線路可能難以檢查。因此，無人機正越來越廣泛地用於檢查電力線路，產生大量的視覺資料，需要快速且準確的處理。深度學習方法已廣泛應用於此任務，證明是故障偵測中寶貴的資產。特別是，絕緣體缺陷的偵測對於預測電力線路故障至關重要，因為其故障可能導致傳輸中斷。因此，持續維護和嚴格檢查絕緣體元件非常重要。在這項工作中，我們提出了一個新的管道來解決這個任務。我們利用最先進的物件偵測來偵測並隨後分類個別絕緣體異常。我們的做法透過微調方法來解決資料集的挑戰，例如不平衡和動態模糊影像，這讓我們能夠透過提高異常絕緣體的分類準確度來改變模型的分類重點。此外，我們採用可解釋的 AI 工具來精確定位和解釋異常。此提議的方法有助於異常偵測領域，特別是基於視覺的工業檢查和預測性維護。我們顯著地將缺陷偵測準確度提高了 13%，同時也提供了模型錯誤分類和定位品質的詳細分析，展示了我們的方法在真實世界資料中的潛力。", "author": "Maximilian Andreas Hoefler et.al.", "authors": "Maximilian Andreas Hoefler, Karsten Mueller, Wojciech Samek", "id": "2409.16821v1", "paper_url": "http://arxiv.org/abs/2409.16821v1", "repo": "null"}}