{"2412.02193": {"publish_time": "2024-12-03", "title": "LayoutVLM: Differentiable Optimization of 3D Layout via Vision-Language Models", "paper_summary": "Open-universe 3D layout generation arranges unlabeled 3D assets conditioned\non language instruction. Large language models (LLMs) struggle with generating\nphysically plausible 3D scenes and adherence to input instructions,\nparticularly in cluttered scenes. We introduce LayoutVLM, a framework and scene\nlayout representation that exploits the semantic knowledge of Vision-Language\nModels (VLMs) and supports differentiable optimization to ensure physical\nplausibility. LayoutVLM employs VLMs to generate two mutually reinforcing\nrepresentations from visually marked images, and a self-consistent decoding\nprocess to improve VLMs spatial planning. Our experiments show that LayoutVLM\naddresses the limitations of existing LLM and constraint-based approaches,\nproducing physically plausible 3D layouts better aligned with the semantic\nintent of input language instructions. We also demonstrate that fine-tuning\nVLMs with the proposed scene layout representation extracted from existing\nscene datasets can improve performance.", "paper_summary_zh": "開放宇宙 3D 佈局生成會根據語言指令排列未標籤的 3D 資產。大型語言模型 (LLM) 努力產生物理上合理的 3D 場景，並遵守輸入指令，特別是在雜亂的場景中。我們引入了 LayoutVLM，這是一個框架和場景佈局表示，它利用了視覺語言模型 (VLM) 的語義知識，並支援可微分最佳化以確保物理合理性。LayoutVLM 使用 VLM 從視覺標記影像中產生兩個相互強化的表示，以及一個自我一致的解碼過程來改善 VLM 的空間規劃。我們的實驗表明，LayoutVLM 解决了現有 LLM 和基於約束的方法的限制，產生了與輸入語言指令的語義意圖更一致的物理上合理的 3D 佈局。我們還證明，使用從現有場景資料集提取的提議場景佈局表示微調 VLM 可以改善效能。", "author": "Fan-Yun Sun et.al.", "authors": "Fan-Yun Sun, Weiyu Liu, Siyi Gu, Dylan Lim, Goutam Bhat, Federico Tombari, Manling Li, Nick Haber, Jiajun Wu", "id": "2412.02193v1", "paper_url": "http://arxiv.org/abs/2412.02193v1", "repo": "null"}}