{"2501.11632": {"publish_time": "2025-01-20", "title": "Biomedical Knowledge Graph: A Survey of Domains, Tasks, and Real-World Applications", "paper_summary": "Biomedical knowledge graphs (BKGs) have emerged as powerful tools for\norganizing and leveraging the vast and complex data found across the biomedical\nfield. Yet, current reviews of BKGs often limit their scope to specific domains\nor methods, overlooking the broader landscape and the rapid technological\nprogress reshaping it. In this survey, we address this gap by offering a\nsystematic review of BKGs from three core perspectives: domains, tasks, and\napplications. We begin by examining how BKGs are constructed from diverse data\nsources, including molecular interactions, pharmacological datasets, and\nclinical records. Next, we discuss the essential tasks enabled by BKGs,\nfocusing on knowledge management, retrieval, reasoning, and interpretation.\nFinally, we highlight real-world applications in precision medicine, drug\ndiscovery, and scientific research, illustrating the translational impact of\nBKGs across multiple sectors. By synthesizing these perspectives into a unified\nframework, this survey not only clarifies the current state of BKG research but\nalso establishes a foundation for future exploration, enabling both innovative\nmethodological advances and practical implementations.", "paper_summary_zh": "生物醫學知識圖譜 (BKG) 已成為組織和利用生物醫學領域中發現的龐大且複雜資料的強大工具。然而，目前對 BKG 的回顧通常將其範圍限制在特定領域或方法上，忽視了更廣泛的領域和正在重塑它的快速技術進步。在本次調查中，我們通過從三個核心觀點：領域、任務和應用程式，提供 BKG 的系統性回顧來解決這個差距。我們首先探討如何從多樣化的資料來源構建 BKG，包括分子交互、藥理資料集和臨床記錄。接下來，我們討論 BKG 能執行的基本任務，重點關注知識管理、檢索、推理和詮釋。最後，我們重點介紹精準醫學、藥物發現和科學研究中的實際應用，說明 BKG 在多個部門的轉譯影響。透過將這些觀點綜合到一個統一的架構中，本調查不僅釐清了 BKG 研究的現狀，也為未來的探索奠定了基礎，實現了創新的方法論進展和實務實施。", "author": "Yuxing Lu et.al.", "authors": "Yuxing Lu, Sin Yee Goi, Xukai Zhao, Jinzhuo Wang", "id": "2501.11632v1", "paper_url": "http://arxiv.org/abs/2501.11632v1", "repo": "null"}}