{"2501.11632": {"publish_time": "2025-01-20", "title": "Biomedical Knowledge Graph: A Survey of Domains, Tasks, and Real-World Applications", "paper_summary": "Biomedical knowledge graphs (BKGs) have emerged as powerful tools for\norganizing and leveraging the vast and complex data found across the biomedical\nfield. Yet, current reviews of BKGs often limit their scope to specific domains\nor methods, overlooking the broader landscape and the rapid technological\nprogress reshaping it. In this survey, we address this gap by offering a\nsystematic review of BKGs from three core perspectives: domains, tasks, and\napplications. We begin by examining how BKGs are constructed from diverse data\nsources, including molecular interactions, pharmacological datasets, and\nclinical records. Next, we discuss the essential tasks enabled by BKGs,\nfocusing on knowledge management, retrieval, reasoning, and interpretation.\nFinally, we highlight real-world applications in precision medicine, drug\ndiscovery, and scientific research, illustrating the translational impact of\nBKGs across multiple sectors. By synthesizing these perspectives into a unified\nframework, this survey not only clarifies the current state of BKG research but\nalso establishes a foundation for future exploration, enabling both innovative\nmethodological advances and practical implementations.", "paper_summary_zh": "生物医学知识图谱（BKG）已成为组织和利用生物医学领域中发现的庞大且复杂数据的强大工具。然而，当前对 BKG 的审查通常将其范围限制在特定领域或方法，忽视了更广泛的格局和正在重塑它的快速技术进步。在这项调查中，我们通过从三个核心角度（领域、任务和应用）对 BKG 进行系统审查来解决这一差距。我们首先检查如何从包括分子相互作用、药理数据集和临床记录在内的各种数据源构建 BKG。接下来，我们讨论 BKG 启用的基本任务，重点关注知识管理、检索、推理和解释。最后，我们重点介绍了精准医疗、药物发现和科学研究中的实际应用，说明了 BKG 在多个领域的转化影响。通过将这些观点综合到一个统一的框架中，本调查不仅阐明了 BKG 研究的现状，还为未来的探索奠定了基础，既促进了创新方法的进步，也促进了实际实施。", "author": "Yuxing Lu et.al.", "authors": "Yuxing Lu, Sin Yee Goi, Xukai Zhao, Jinzhuo Wang", "id": "2501.11632v2", "paper_url": "http://arxiv.org/abs/2501.11632v2", "repo": "null"}}