{"2504.05214": {"publish_time": "2025-04-07", "title": "Post-Training Language Models for Continual Relation Extraction", "paper_summary": "Real-world data, such as news articles, social media posts, and chatbot\nconversations, is inherently dynamic and non-stationary, presenting significant\nchallenges for constructing real-time structured representations through\nknowledge graphs (KGs). Relation Extraction (RE), a fundamental component of KG\ncreation, often struggles to adapt to evolving data when traditional models\nrely on static, outdated datasets. Continual Relation Extraction (CRE) methods\ntackle this issue by incrementally learning new relations while preserving\npreviously acquired knowledge. This study investigates the application of\npre-trained language models (PLMs), specifically large language models (LLMs),\nto CRE, with a focus on leveraging memory replay to address catastrophic\nforgetting. We evaluate decoder-only models (eg, Mistral-7B and Llama2-7B) and\nencoder-decoder models (eg, Flan-T5 Base) on the TACRED and FewRel datasets.\nTask-incremental fine-tuning of LLMs demonstrates superior performance over\nearlier approaches using encoder-only models like BERT on TACRED, excelling in\nseen-task accuracy and overall performance (measured by whole and average\naccuracy), particularly with the Mistral and Flan-T5 models. Results on FewRel\nare similarly promising, achieving second place in whole and average accuracy\nmetrics. This work underscores critical factors in knowledge transfer, language\nmodel architecture, and KG completeness, advancing CRE with LLMs and memory\nreplay for dynamic, real-time relation extraction.", "paper_summary_zh": "<paragraph>現實世界中的數據，例如新聞文章、社群媒體貼文和聊天機器人對話，本質上是動態且非靜態的，這對透過知識圖譜 (KGs) 構建實時結構化表示形式提出了重大挑戰。關係抽取 (RE) 是 KG 創建的基本組成部分，當傳統模型依賴於靜態、過時的數據集時，關係抽取往往難以適應不斷變化的數據。持續關係抽取 (CRE) 方法透過增量學習新關係的同時保留先前獲得的知識來解決這個問題。本研究探討了預訓練語言模型 (PLMs)，特別是大語言模型 (LLMs)，在 CRE 中的應用，重點是利用記憶重播來解決災難性遺忘問題。我們在 TACRED 和 FewRel 數據集上評估了僅解碼器模型（例如 Mistral-7B 和 Llama2-7B）和編碼器-解碼器模型（例如 Flan-T5 Base）。在 TACRED 上，LLM 的任務增量微調展現出比先前使用像 BERT 之類的僅編碼器模型的方法更優越的性能，在已見任務準確性和整體性能（透過整體和平均準確性衡量）方面表現出色，尤其是在使用 Mistral 和 Flan-T5 模型時。在 FewRel 上的結果同樣令人振奮，在整體和平均準確性指標上均取得了第二名的佳績。這項工作強調了知識遷移、語言模型架構和 KG 完整性的關鍵因素，推動了使用 LLM 和記憶重播進行動態、實時關係抽取的 CRE 發展。 </paragraph>\n", "author": "Sefika Efeoglu et.al.", "authors": "Sefika Efeoglu, Adrian Paschke, Sonja Schimmler", "id": "2504.05214v1", "paper_url": "http://arxiv.org/abs/2504.05214v1", "repo": "null"}}