{"2504.16081": {"publish_time": "2025-04-22", "title": "Survey of Video Diffusion Models: Foundations, Implementations, and Applications", "paper_summary": "Recent advances in diffusion models have revolutionized video generation,\noffering superior temporal consistency and visual quality compared to\ntraditional generative adversarial networks-based approaches. While this\nemerging field shows tremendous promise in applications, it faces significant\nchallenges in motion consistency, computational efficiency, and ethical\nconsiderations. This survey provides a comprehensive review of diffusion-based\nvideo generation, examining its evolution, technical foundations, and practical\napplications. We present a systematic taxonomy of current methodologies,\nanalyze architectural innovations and optimization strategies, and investigate\napplications across low-level vision tasks such as denoising and\nsuper-resolution. Additionally, we explore the synergies between diffusionbased\nvideo generation and related domains, including video representation learning,\nquestion answering, and retrieval. Compared to the existing surveys (Lei et\nal., 2024a;b; Melnik et al., 2024; Cao et al., 2023; Xing et al., 2024c) which\nfocus on specific aspects of video generation, such as human video synthesis\n(Lei et al., 2024a) or long-form content generation (Lei et al., 2024b), our\nwork provides a broader, more updated, and more fine-grained perspective on\ndiffusion-based approaches with a special section for evaluation metrics,\nindustry solutions, and training engineering techniques in video generation.\nThis survey serves as a foundational resource for researchers and practitioners\nworking at the intersection of diffusion models and video generation, providing\ninsights into both the theoretical frameworks and practical implementations\nthat drive this rapidly evolving field. A structured list of related works\ninvolved in this survey is also available on\nhttps://github.com/Eyeline-Research/Survey-Video-Diffusion.", "paper_summary_zh": "<paragraph>近年來，擴散模型的進步徹底改變了影片生成領域，與傳統基於生成對抗網路的方法相比，它提供了更優異的時間一致性和視覺品質。雖然這個新興領域在應用方面展現出巨大的潛力，但它在運動一致性、計算效率和倫理考量方面仍面臨重大挑戰。本綜述全面回顧了基於擴散的影片生成技術，探討了它的發展歷程、技術基礎和實際應用。我們提出了當前方法的系統分類，分析了架構創新和優化策略，並研究了其在低階視覺任務（如去噪和超解析度）中的應用。此外，我們還探討了基於擴散的影片生成與相關領域的協同作用，包括影片表徵學習、問答和檢索。與現有的綜述 (Lei et al., 2024a;b; Melnik et al., 2024; Cao et al., 2023; Xing et al., 2024c) 主要關注影片生成的特定方面（例如，人物影片合成 (Lei et al., 2024a) 或長篇內容生成 (Lei et al., 2024b)）相比，我們的工作以更廣泛、更新和更細緻的視角探討基於擴散的方法，並特別針對影片生成中的評估指標、產業解決方案和訓練工程技術進行了闡述。本綜述可作為研究人員和從業人員在擴散模型和影片生成交叉領域工作的基礎資源，提供對推動這一快速發展領域的理論框架和實際應用的深入見解。本綜述中涉及的相關著作的結構化列表也可在 https://github.com/Eyeline-Research/Survey-Video-Diffusion 上找到。</paragraph>\n", "author": "Yimu Wang et.al.", "authors": "Yimu Wang, Xuye Liu, Wei Pang, Li Ma, Shuai Yuan, Paul Debevec, Ning Yu", "id": "2504.16081v1", "paper_url": "http://arxiv.org/abs/2504.16081v1", "repo": "null"}}