{"2502.03330": {"publish_time": "2025-02-05", "title": "Controllable GUI Exploration", "paper_summary": "During the early stages of interface design, designers need to produce\nmultiple sketches to explore a design space. Design tools often fail to support\nthis critical stage, because they insist on specifying more details than\nnecessary. Although recent advances in generative AI have raised hopes of\nsolving this issue, in practice they fail because expressing loose ideas in a\nprompt is impractical. In this paper, we propose a diffusion-based approach to\nthe low-effort generation of interface sketches. It breaks new ground by\nallowing flexible control of the generation process via three types of inputs:\nA) prompts, B) wireframes, and C) visual flows. The designer can provide any\ncombination of these as input at any level of detail, and will get a diverse\ngallery of low-fidelity solutions in response. The unique benefit is that large\ndesign spaces can be explored rapidly with very little effort in\ninput-specification. We present qualitative results for various combinations of\ninput specifications. Additionally, we demonstrate that our model aligns more\naccurately with these specifications than other models.", "paper_summary_zh": "在介面設計的早期階段，設計師需要製作多個草圖來探索設計空間。設計工具常常無法支援這個關鍵階段，因為它們堅持要比必要時指定更多細節。儘管生成式 AI 的最新進展已提高了解決此問題的希望，但實際上它們會失敗，因為在提示中表達鬆散的想法是不切實際的。在本文中，我們提出了一個基於擴散的方法來低成本生成介面草圖。它透過允許透過三種類型的輸入靈活控制生成過程來創新：A) 提示、B) 線框圖，以及 C) 視覺流程。設計師可以在任何詳細層級提供這些內容的任何組合作為輸入，並將獲得回應的低保真度解決方案的各種圖庫。獨特的好處是可以透過輸入規格中的極少成本快速探索大型設計空間。我們針對各種輸入規格組合呈現定性結果。此外，我們證明我們的模型比其他模型更準確地與這些規格對齊。", "author": "Aryan Garg et.al.", "authors": "Aryan Garg, Yue Jiang, Antti Oulasvirta", "id": "2502.03330v1", "paper_url": "http://arxiv.org/abs/2502.03330v1", "repo": "null"}}