{"2410.21494": {"publish_time": "2024-10-28", "title": "Towards Multi-dimensional Explanation Alignment for Medical Classification", "paper_summary": "The lack of interpretability in the field of medical image analysis has\nsignificant ethical and legal implications. Existing interpretable methods in\nthis domain encounter several challenges, including dependency on specific\nmodels, difficulties in understanding and visualization, as well as issues\nrelated to efficiency. To address these limitations, we propose a novel\nframework called Med-MICN (Medical Multi-dimensional Interpretable Concept\nNetwork). Med-MICN provides interpretability alignment for various angles,\nincluding neural symbolic reasoning, concept semantics, and saliency maps,\nwhich are superior to current interpretable methods. Its advantages include\nhigh prediction accuracy, interpretability across multiple dimensions, and\nautomation through an end-to-end concept labeling process that reduces the need\nfor extensive human training effort when working with new datasets. To\ndemonstrate the effectiveness and interpretability of Med-MICN, we apply it to\nfour benchmark datasets and compare it with baselines. The results clearly\ndemonstrate the superior performance and interpretability of our Med-MICN.", "paper_summary_zh": "醫療影像分析領域缺乏可解釋性，這帶來重大的倫理和法律影響。現有的可解釋方法在這個領域中會遭遇許多挑戰，包括依賴特定模型、難以理解和視覺化，以及與效率相關的問題。為了解決這些限制，我們提出一個新的架構，稱為 Med-MICN（醫療多維可解釋概念網路）。Med-MICN 提供各種角度的可解釋性比對，包括神經符號推理、概念語意和顯著性圖，這些都優於目前的可解釋方法。它的優點包括高預測準確度、多維度的可解釋性，以及透過端到端概念標記流程自動化，這減少了在使用新資料集時需要大量人工訓練的工作。為了證明 Med-MICN 的有效性和可解釋性，我們將其應用於四個基準資料集，並與基準線進行比較。結果清楚地證明了我們的 Med-MICN 具有優異的效能和可解釋性。", "author": "Lijie Hu et.al.", "authors": "Lijie Hu, Songning Lai, Wenshuo Chen, Hongru Xiao, Hongbin Lin, Lu Yu, Jingfeng Zhang, Di Wang", "id": "2410.21494v1", "paper_url": "http://arxiv.org/abs/2410.21494v1", "repo": "null"}}