{"2411.09820": {"publish_time": "2024-11-14", "title": "WelQrate: Defining the Gold Standard in Small Molecule Drug Discovery Benchmarking", "paper_summary": "While deep learning has revolutionized computer-aided drug discovery, the AI\ncommunity has predominantly focused on model innovation and placed less\nemphasis on establishing best benchmarking practices. We posit that without a\nsound model evaluation framework, the AI community's efforts cannot reach their\nfull potential, thereby slowing the progress and transfer of innovation into\nreal-world drug discovery. Thus, in this paper, we seek to establish a new gold\nstandard for small molecule drug discovery benchmarking, WelQrate.\nSpecifically, our contributions are threefold: WelQrate Dataset Collection - we\nintroduce a meticulously curated collection of 9 datasets spanning 5\ntherapeutic target classes. Our hierarchical curation pipelines, designed by\ndrug discovery experts, go beyond the primary high-throughput screen by\nleveraging additional confirmatory and counter screens along with rigorous\ndomain-driven preprocessing, such as Pan-Assay Interference Compounds (PAINS)\nfiltering, to ensure the high-quality data in the datasets; WelQrate Evaluation\nFramework - we propose a standardized model evaluation framework considering\nhigh-quality datasets, featurization, 3D conformation generation, evaluation\nmetrics, and data splits, which provides a reliable benchmarking for drug\ndiscovery experts conducting real-world virtual screening; Benchmarking - we\nevaluate model performance through various research questions using the\nWelQrate dataset collection, exploring the effects of different models, dataset\nquality, featurization methods, and data splitting strategies on the results.\nIn summary, we recommend adopting our proposed WelQrate as the gold standard in\nsmall molecule drug discovery benchmarking. The WelQrate dataset collection,\nalong with the curation codes, and experimental scripts are all publicly\navailable at WelQrate.org.", "paper_summary_zh": "<paragraph>深度學習雖然徹底改變了電腦輔助藥物發現，但 AI 社群主要專注於模型創新，較少重視建立最佳基準測試實務。我們假設，若沒有健全的模型評估架構，AI 社群的努力將無法發揮其全部潛力，進而減緩創新進程，並將創新轉移到現實世界的藥物發現中。因此，我們在本文中尋求為小分子藥物發現基準測試建立新的金標準 WelQrate。具體來說，我們的貢獻有三方面：WelQrate 資料集收集 - 我們引進一個精心策劃的 9 個資料集集合，涵蓋 5 個治療目標類別。我們的階層式策劃管道由藥物發現專家設計，透過利用其他確認和反向篩選以及嚴格的領域驅動預處理（例如 Pan-Assay Interference Compounds (PAINS) 過濾）超越主要的高通量篩選，以確保資料集中的資料品質；WelQrate 評估架構 - 我們提出一個標準化的模型評估架構，考量高品質資料集、特徵化、3D 構象產生、評估指標和資料分割，這為進行真實世界虛擬篩選的藥物發現專家提供可靠的基準測試；基準測試 - 我們透過使用 WelQrate 資料集收集來評估模型效能，探討不同模型、資料集品質、特徵化方法和資料分割策略對結果的影響。總之，我們建議採用我們提出的 WelQrate 作為小分子藥物發現基準測試的金標準。WelQrate 資料集收集，連同策劃程式碼和實驗腳本，都公開於 WelQrate.org。</paragraph>", "author": "Yunchao et.al.", "authors": "Yunchao, Liu, Ha Dong, Xin Wang, Rocco Moretti, Yu Wang, Zhaoqian Su, Jiawei Gu, Bobby Bodenheimer, Charles David Weaver, Jens Meiler, Tyler Derr", "id": "2411.09820v1", "paper_url": "http://arxiv.org/abs/2411.09820v1", "repo": "null"}}