{"2411.02625": {"publish_time": "2024-11-04", "title": "EmoSphere++: Emotion-Controllable Zero-Shot Text-to-Speech via Emotion-Adaptive Spherical Vector", "paper_summary": "Emotional text-to-speech (TTS) technology has achieved significant progress\nin recent years; however, challenges remain owing to the inherent complexity of\nemotions and limitations of the available emotional speech datasets and models.\nPrevious studies typically relied on limited emotional speech datasets or\nrequired extensive manual annotations, restricting their ability to generalize\nacross different speakers and emotional styles. In this paper, we present\nEmoSphere++, an emotion-controllable zero-shot TTS model that can control\nemotional style and intensity to resemble natural human speech. We introduce a\nnovel emotion-adaptive spherical vector that models emotional style and\nintensity without human annotation. Moreover, we propose a multi-level style\nencoder that can ensure effective generalization for both seen and unseen\nspeakers. We also introduce additional loss functions to enhance the emotion\ntransfer performance for zero-shot scenarios. We employ a conditional flow\nmatching-based decoder to achieve high-quality and expressive emotional TTS in\na few sampling steps. Experimental results demonstrate the effectiveness of the\nproposed framework.", "paper_summary_zh": "情感文字轉語音 (TTS) 技術在近年來取得顯著進展；然而，由於情感的複雜性和現有情感語音資料集和模型的限制，仍存在挑戰。先前的研究通常依賴於有限的情感語音資料集，或需要廣泛的手動註解，限制它們在不同說話者和情感風格中的概括能力。在本文中，我們提出了 EmoSphere++，一個可控情感的零次學習 TTS 模型，它可以控制情感風格和強度，以模擬自然的人類語音。我們引入了一個新穎的情感自適應球形向量，它在沒有人工註解的情況下對情感風格和強度進行建模。此外，我們提出了一個多級風格編碼器，它可以確保對已見和未見說話者的有效概括。我們還引入了額外的損失函數，以增強零次學習場景中的情感轉移性能。我們採用了一個基於條件流匹配的解碼器，以在幾個採樣步驟中實現高品質和富有表現力的情感 TTS。實驗結果證明了所提出框架的有效性。", "author": "Deok-Hyeon Cho et.al.", "authors": "Deok-Hyeon Cho, Hyung-Seok Oh, Seung-Bin Kim, Seong-Whan Lee", "id": "2411.02625v1", "paper_url": "http://arxiv.org/abs/2411.02625v1", "repo": "https://github.com/Choddeok/EmoSpherepp"}}