{"2408.14875": {"publish_time": "2024-08-27", "title": "Adversarial Attacks and Defenses in Multivariate Time-Series Forecasting for Smart and Connected Infrastructures", "paper_summary": "The emergence of deep learning models has revolutionized various industries\nover the last decade, leading to a surge in connected devices and\ninfrastructures. However, these models can be tricked into making incorrect\npredictions with high confidence, leading to disastrous failures and security\nconcerns. To this end, we explore the impact of adversarial attacks on\nmultivariate time-series forecasting and investigate methods to counter them.\nSpecifically, we employ untargeted white-box attacks, namely the Fast Gradient\nSign Method (FGSM) and the Basic Iterative Method (BIM), to poison the inputs\nto the training process, effectively misleading the model. We also illustrate\nthe subtle modifications to the inputs after the attack, which makes detecting\nthe attack using the naked eye quite difficult. Having demonstrated the\nfeasibility of these attacks, we develop robust models through adversarial\ntraining and model hardening. We are among the first to showcase the\ntransferability of these attacks and defenses by extrapolating our work from\nthe benchmark electricity data to a larger, 10-year real-world data used for\npredicting the time-to-failure of hard disks. Our experimental results confirm\nthat the attacks and defenses achieve the desired security thresholds, leading\nto a 72.41% and 94.81% decrease in RMSE for the electricity and hard disk\ndatasets respectively after implementing the adversarial defenses.", "paper_summary_zh": "深度學習模型的出現徹底改變了各個產業\n在過去十年中，導致連接設備和基礎設施激增。然而，這些模型可能會被誘騙做出不正確的預測，並具有高度的信心，從而導致災難性的失敗和安全問題。為此，我們探討了對抗性攻擊對多變數時間序列預測的影響，並研究了應對它們的方法。具體來說，我們採用無目標白盒攻擊，即快速梯度符號方法 (FGSM) 和基本迭代方法 (BIM)，以毒害訓練過程的輸入，有效地誤導模型。我們還說明了攻擊後對輸入的細微修改，這使得用肉眼檢測攻擊非常困難。在證明了這些攻擊的可行性後，我們通過對抗性訓練和模型硬化來開發強大的模型。我們是最早展示這些攻擊和防禦的可傳遞性的人之一，通過將我們的研究從基準電力數據推廣到用於預測硬碟故障時間的更大的 10 年現實世界數據中。我們的實驗結果證實，在實施對抗性防禦後，攻擊和防禦達到了所需的安全性閾值，分別導致電力和硬碟數據集的 RMSE 下降了 72.41% 和 94.81%。", "author": "Pooja Krishan et.al.", "authors": "Pooja Krishan, Rohan Mohapatra, Saptarshi Sengupta", "id": "2408.14875v1", "paper_url": "http://arxiv.org/abs/2408.14875v1", "repo": "null"}}