{"2411.19787": {"publish_time": "2024-11-29", "title": "CAREL: Instruction-guided reinforcement learning with cross-modal auxiliary objectives", "paper_summary": "Grounding the instruction in the environment is a key step in solving\nlanguage-guided goal-reaching reinforcement learning problems. In automated\nreinforcement learning, a key concern is to enhance the model's ability to\ngeneralize across various tasks and environments. In goal-reaching scenarios,\nthe agent must comprehend the different parts of the instructions within the\nenvironmental context in order to complete the overall task successfully. In\nthis work, we propose CAREL (Cross-modal Auxiliary REinforcement Learning) as a\nnew framework to solve this problem using auxiliary loss functions inspired by\nvideo-text retrieval literature and a novel method called instruction tracking,\nwhich automatically keeps track of progress in an environment. The results of\nour experiments suggest superior sample efficiency and systematic\ngeneralization for this framework in multi-modal reinforcement learning\nproblems. Our code base is available here.", "paper_summary_zh": "在環境中奠定指令是解決語言引導目標達成強化學習問題的關鍵步驟。在自動化強化學習中，一個關鍵問題是提升模型在各種任務和環境中泛化的能力。在目標達成場景中，代理程式必須在環境脈絡中理解指令的不同部分，才能成功完成整體任務。在這項工作中，我們提出 CAREL（跨模態輔助強化學習），作為一個新的架構，使用受影片文字檢索文獻啟發的輔助損失函數，以及一種稱為指令追蹤的新方法來解決這個問題，該方法會自動追蹤環境中的進度。我們的實驗結果顯示，此架構在多模態強化學習問題中具有優異的樣本效率和系統性泛化能力。我們的程式碼庫在此處提供。", "author": "Armin Saghafian et.al.", "authors": "Armin Saghafian, Amirmohammad Izadi, Negin Hashemi Dijujin, Mahdieh Soleymani Baghshah", "id": "2411.19787v1", "paper_url": "http://arxiv.org/abs/2411.19787v1", "repo": "null"}}