{"2412.04455": {"publish_time": "2024-12-05", "title": "Code-as-Monitor: Constraint-aware Visual Programming for Reactive and Proactive Robotic Failure Detection", "paper_summary": "Automatic detection and prevention of open-set failures are crucial in\nclosed-loop robotic systems. Recent studies often struggle to simultaneously\nidentify unexpected failures reactively after they occur and prevent\nforeseeable ones proactively. To this end, we propose Code-as-Monitor (CaM), a\nnovel paradigm leveraging the vision-language model (VLM) for both open-set\nreactive and proactive failure detection. The core of our method is to\nformulate both tasks as a unified set of spatio-temporal constraint\nsatisfaction problems and use VLM-generated code to evaluate them for real-time\nmonitoring. To enhance the accuracy and efficiency of monitoring, we further\nintroduce constraint elements that abstract constraint-related entities or\ntheir parts into compact geometric elements. This approach offers greater\ngenerality, simplifies tracking, and facilitates constraint-aware visual\nprogramming by leveraging these elements as visual prompts. Experiments show\nthat CaM achieves a 28.7% higher success rate and reduces execution time by\n31.8% under severe disturbances compared to baselines across three simulators\nand a real-world setting. Moreover, CaM can be integrated with open-loop\ncontrol policies to form closed-loop systems, enabling long-horizon tasks in\ncluttered scenes with dynamic environments.", "paper_summary_zh": "在閉迴路機器人系統中，自動偵測和預防開放式故障至關重要。最近的研究通常難以在故障發生後同時主動識別意外故障並預防可預見的故障。為此，我們提出 Code-as-Monitor (CaM)，一種新的範例，利用視覺語言模型 (VLM) 進行開放式反應式和主動式故障偵測。我們方法的核心是將這兩個任務制定為一組統一的時空約束滿足問題，並使用 VLM 生成的程式碼對它們進行評估以進行即時監控。為了提高監控的準確性和效率，我們進一步引入了約束元素，將與約束相關的實體或其部分抽象化為緊湊的幾何元素。這種方法提供了更大的通用性，簡化了追蹤，並透過將這些元素作為視覺提示，促进了約束感知視覺程式設計。實驗表明，與三個模擬器和一個真實世界設定中的基準相比，CaM 在嚴重干擾下實現了高出 28.7% 的成功率，並將執行時間減少了 31.8%。此外，CaM 可以與開迴路控制策略整合以形成閉迴路系統，從而在具有動態環境的混亂場景中執行長期任務。", "author": "Enshen Zhou et.al.", "authors": "Enshen Zhou, Qi Su, Cheng Chi, Zhizheng Zhang, Zhongyuan Wang, Tiejun Huang, Lu Sheng, He Wang", "id": "2412.04455v1", "paper_url": "http://arxiv.org/abs/2412.04455v1", "repo": "null"}}