{"2407.03308": {"publish_time": "2024-07-03", "title": "Accelerated Proton Resonance Frequency-based Magnetic Resonance Thermometry by Optimized Deep Learning Method", "paper_summary": "Proton resonance frequency (PRF) based MR thermometry is essential for\nfocused ultrasound (FUS) thermal ablation therapies. This work aims to enhance\ntemporal resolution in dynamic MR temperature map reconstruction using an\nimproved deep learning method. The training-optimized methods and five\nclassical neural networks were applied on the 2-fold and 4-fold under-sampling\nk-space data to reconstruct the temperature maps. The enhanced training modules\nincluded offline/online data augmentations, knowledge distillation, and the\namplitude-phase decoupling loss function. The heating experiments were\nperformed by a FUS transducer on phantom and ex vivo tissues, respectively.\nThese data were manually under-sampled to imitate acceleration procedures and\ntrained in our method to get the reconstruction model. The additional dozen or\nso testing datasets were separately obtained for evaluating the real-time\nperformance and temperature accuracy. Acceleration factors of 1.9 and 3.7 were\nfound for 2 times and 4 times k-space under-sampling strategies and the\nResUNet-based deep learning reconstruction performed exceptionally well. In\n2-fold acceleration scenario, the RMSE of temperature map patches provided the\nvalues of 0.888 degree centigrade and 1.145 degree centigrade on phantom and ex\nvivo testing datasets. The DICE value of temperature areas enclosed by 43\ndegree centigrade isotherm was 0.809, and the Bland-Altman analysis showed a\nbias of -0.253 degree centigrade with the apart of plus or minus 2.16 degree\ncentigrade. In 4 times under-sampling case, these evaluating values decreased\nby approximately 10%. This study demonstrates that deep learning-based\nreconstruction can significantly enhance the accuracy and efficiency of MR\nthermometry for clinical FUS thermal therapies.", "paper_summary_zh": "基於質子共振頻率 (PRF) 的 MR 溫度測量對於聚焦超音波 (FUS) 熱消融療法至關重要。這項研究旨在透過改善深度學習方法，提升動態 MR 溫度圖重建中的時間解析度。在 2 倍和 4 倍的 k-space 資料不足採樣中，將訓練最佳化方法和五個傳統神經網路應用於重建溫度圖。增強的訓練模組包括離線/線上資料擴充、知識萃取，以及振幅相位解耦損失函數。加熱實驗分別由 FUS 換能器在模擬人體和離體組織上執行。這些資料經過手動不足採樣以模擬加速程序，並在我們的模型中進行訓練以取得重建模型。額外的十幾個測試資料集則另外取得，用於評估即時效能和溫度準確度。在 2 倍和 4 倍 k-space 不足採樣策略中，發現加速因子為 1.9 和 3.7，而基於 ResUNet 的深度學習重建表現得非常好。在 2 倍加速情境中，溫度圖區塊的 RMSE 在模擬人體和離體測試資料集上提供 0.888 度攝氏和 1.145 度攝氏的值。溫度區域的 DICE 值，以 43 度攝氏等溫線包覆，為 0.809，而 Bland-Altman 分析顯示偏差為 -0.253 度攝氏，加上或減去 2.16 度攝氏。在 4 倍不足採樣案例中，這些評估值減少了大約 10%。這項研究證明，基於深度學習的重建可以大幅提升臨床 FUS 熱療中 MR 溫度測量的準確度和效率。", "author": "Sijie Xu et.al.", "authors": "Sijie Xu, Shenyan Zong, Chang-Sheng Mei, Guofeng Shen, Yueran Zhao, He Wang", "id": "2407.03308v1", "paper_url": "http://arxiv.org/abs/2407.03308v1", "repo": "null"}}