{"2409.15711": {"publish_time": "2024-09-24", "title": "Adversarial Federated Consensus Learning for Surface Defect Classification Under Data Heterogeneity in IIoT", "paper_summary": "The challenge of data scarcity hinders the application of deep learning in\nindustrial surface defect classification (SDC), as it's difficult to collect\nand centralize sufficient training data from various entities in Industrial\nInternet of Things (IIoT) due to privacy concerns. Federated learning (FL)\nprovides a solution by enabling collaborative global model training across\nclients while maintaining privacy. However, performance may suffer due to data\nheterogeneity--discrepancies in data distributions among clients. In this\npaper, we propose a novel personalized FL (PFL) approach, named Adversarial\nFederated Consensus Learning (AFedCL), for the challenge of data heterogeneity\nacross different clients in SDC. First, we develop a dynamic consensus\nconstruction strategy to mitigate the performance degradation caused by data\nheterogeneity. Through adversarial training, local models from different\nclients utilize the global model as a bridge to achieve distribution alignment,\nalleviating the problem of global knowledge forgetting. Complementing this\nstrategy, we propose a consensus-aware aggregation mechanism. It assigns\naggregation weights to different clients based on their efficacy in global\nknowledge learning, thereby enhancing the global model's generalization\ncapabilities. Finally, we design an adaptive feature fusion module to further\nenhance global knowledge utilization efficiency. Personalized fusion weights\nare gradually adjusted for each client to optimally balance global and local\nfeatures, tailored to their individual global knowledge learning efficacy.\nCompared with state-of-the-art FL methods like FedALA, the proposed AFedCL\nmethod achieves an accuracy increase of up to 5.67% on three SDC datasets.", "paper_summary_zh": "<paragraph>資料稀少的挑戰阻礙了深度學習在工業表面缺陷分類 (SDC) 中的應用，因為由於隱私問題，難以從工業物聯網 (IIoT) 中的各個實體收集和集中足夠的訓練資料。聯邦學習 (FL) 提供了一個解決方案，它讓客戶端能夠進行協作式全球模型訓練，同時維護隱私。然而，由於資料異質性，即客戶端之間資料分佈的差異，效能可能會受到影響。在本文中，我們提出了一種名為對抗聯邦共識學習 (AFedCL) 的新個性化 FL (PFL) 方法，用於解決 SDC 中不同客戶端之間資料異質性的挑戰。首先，我們開發了一種動態共識構建策略，以減輕資料異質性造成的效能下降。透過對抗訓練，來自不同客戶端的本地模型利用全球模型作為橋樑來實現分佈對齊，緩解了全球知識遺忘的問題。為了補充此策略，我們提出了一個共識感知聚合機制。它根據不同客戶端在全球知識學習中的效能為其分配聚合權重，從而增強全球模型的概化能力。最後，我們設計了一個自適應特徵融合模組，以進一步提高全球知識利用效率。針對每個客戶端逐漸調整個性化融合權重，以最佳平衡全球和本地特徵，並根據其個別的全球知識學習效能進行調整。與 FedALA 等最先進的 FL 方法相比，所提出的 AFedCL 方法在三個 SDC 資料集上實現了高達 5.67% 的準確度提升。</paragraph>", "author": "Jixuan Cui et.al.", "authors": "Jixuan Cui, Jun Li, Zhen Mei, Yiyang Ni, Wen Chen, Zengxiang Li", "id": "2409.15711v1", "paper_url": "http://arxiv.org/abs/2409.15711v1", "repo": "null"}}