{"2502.15572": {"publish_time": "2025-02-21", "title": "DReSD: Dense Retrieval for Speculative Decoding", "paper_summary": "Speculative decoding (SD) accelerates Large Language Model (LLM) generation\nby using an efficient draft model to propose the next few tokens, which are\nverified by the LLM in a single forward call, reducing latency while preserving\nits outputs. We focus on retrieval-based SD where the draft model retrieves the\nnext tokens from a non-parametric datastore. Sparse retrieval (REST), which\noperates on the surface form of strings, is currently the dominant paradigm due\nto its simplicity and scalability. However, its effectiveness is limited due to\nthe usage of short contexts and exact string matching. Instead, we introduce\nDense Retrieval for Speculative Decoding (DReSD), a novel framework that uses\napproximate nearest neighbour search with contextualised token embeddings to\nretrieve the most semantically relevant token sequences for SD. Extensive\nexperiments show that DReSD achieves (on average) 87% higher acceptance rates,\n65% longer accepted tokens and 19% faster generation speeds compared to sparse\nretrieval (REST).", "paper_summary_zh": "推測解碼 (SD) 透過使用一個有效率的草稿模型來建議下幾個符號，由 LLM 在單一前向呼叫中驗證，來加速大型語言模型 (LLM) 的產生，同時降低延遲並保留其輸出。我們專注於基於檢索的 SD，其中草稿模型從非參數化資料儲存中檢索下一個符號。稀疏檢索 (REST) 是目前的主流範例，因為它簡單且可擴充，並操作字串的表面形式。然而，由於使用短脈絡和精確字串比對，其有效性受到限制。相反地，我們引入了推測解碼的稠密檢索 (DReSD)，這是一個新穎的架構，使用情境化符號嵌入與近似最近鄰搜尋來檢索語意最相關的符號序列以進行 SD。廣泛的實驗顯示，與稀疏檢索 (REST) 相比，DReSD 達到了（平均）87% 較高的接受率、65% 較長的接受符號和 19% 較快的產生速度。", "author": "Milan Gritta et.al.", "authors": "Milan Gritta, Huiyin Xue, Gerasimos Lampouras", "id": "2502.15572v1", "paper_url": "http://arxiv.org/abs/2502.15572v1", "repo": "null"}}