{"2407.11833": {"publish_time": "2024-07-16", "title": "LoFTI: Localization and Factuality Transfer to Indian Locales", "paper_summary": "Large language models (LLMs) encode vast amounts of world knowledge acquired\nvia training on large web-scale datasets crawled from the internet. However,\nthese datasets typically exhibit a geographical bias towards English-speaking\nWestern countries. This results in LLMs producing biased or hallucinated\nresponses to queries that require answers localized to other geographical\nregions. In this work, we introduce a new benchmark named LoFTI (Localization\nand Factuality Transfer to Indian Locales) that can be used to evaluate an\nLLM's localization and factual text transfer capabilities. LoFTI consists of\nfactual statements about entities in source and target locations; the source\nlocations are spread across the globe and the target locations are all within\nIndia with varying degrees of hyperlocality (country, states, cities). The\nentities span a wide variety of categories. We use LoFTI to evaluate Mixtral,\nGPT-4 and two other Mixtral-based approaches well-suited to the task of\nlocalized factual transfer. We demonstrate that LoFTI is a high-quality\nevaluation benchmark and all the models, including GPT-4, produce skewed\nresults across varying levels of hyperlocality.", "paper_summary_zh": "大型語言模型 (LLM) 編碼了大量世界知識，這些知識是透過訓練大型網路規模資料集（從網際網路爬取）而獲得的。然而，這些資料集通常會對英語系西方國家表現出地理偏見。這導致 LLM 對需要將答案在地理區域本地化的查詢產生有偏見或虛構的回應。在這項工作中，我們引入了一個名為 LoFTI（本地化和事實傳輸到印度本地）的新基準，可用於評估 LLM 的本地化和事實文本傳輸能力。LoFTI 包含關於來源和目標位置實體的事實陳述；來源位置遍布全球，而目標位置均在印度境內，具有不同程度的超地方性（國家、州、城市）。實體涵蓋了廣泛的類別。我們使用 LoFTI 來評估 Mixtral、GPT-4 和其他兩種非常適合於本地化事實傳輸任務的基於 Mixtral 的方法。我們證明 LoFTI 是個高品質的評估基準，包括 GPT-4 在內的所有模型在不同層級的超地方性中都產生了偏斜的結果。", "author": "Sona Elza Simon et.al.", "authors": "Sona Elza Simon, Soumen Kumar Mondal, Abhishek Singhania, Sayambhu Sen, Preethi Jyothi", "id": "2407.11833v1", "paper_url": "http://arxiv.org/abs/2407.11833v1", "repo": "https://github.com/csalt-research/lofti"}}