{"2501.14653": {"publish_time": "2025-01-24", "title": "Federated Domain Generalization with Data-free On-server Gradient Matching", "paper_summary": "Domain Generalization (DG) aims to learn from multiple known source domains a\nmodel that can generalize well to unknown target domains. One of the key\napproaches in DG is training an encoder which generates domain-invariant\nrepresentations. However, this approach is not applicable in Federated Domain\nGeneralization (FDG), where data from various domains are distributed across\ndifferent clients. In this paper, we introduce a novel approach, dubbed\nFederated Learning via On-server Matching Gradient (FedOMG), which can\n\\emph{efficiently leverage domain information from distributed domains}.\nSpecifically, we utilize the local gradients as information about the\ndistributed models to find an invariant gradient direction across all domains\nthrough gradient inner product maximization. The advantages are two-fold: 1)\nFedOMG can aggregate the characteristics of distributed models on the\ncentralized server without incurring any additional communication cost, and 2)\nFedOMG is orthogonal to many existing FL/FDG methods, allowing for additional\nperformance improvements by being seamlessly integrated with them. Extensive\nexperimental evaluations on various settings to demonstrate the robustness of\nFedOMG compared to other FL/FDG baselines. Our method outperforms recent SOTA\nbaselines on four FL benchmark datasets (MNIST, EMNIST, CIFAR-10, and\nCIFAR-100), and three FDG benchmark datasets (PACS, VLCS, and OfficeHome).", "paper_summary_zh": "領域泛化（DG）旨在從多個已知的來源領域學習一個模型，該模型可以很好地泛化到未知的目標領域。DG 中的一個關鍵方法是訓練一個編碼器，它生成與領域不變的表示。然而，這種方法不適用於聯合領域泛化 (FDG)，其中來自不同領域的數據分佈在不同的客戶端上。在本文中，我們介紹了一種新方法，稱為通過伺服器上匹配梯度進行聯合學習 (FedOMG)，它可以\\emph{有效地利用來自分佈式領域的領域信息}。具體來說，我們利用局部梯度作為分佈式模型的信息，通過梯度內積最大化來找到所有領域中不變的梯度方向。優點有兩個：1) FedOMG 可以聚合中心化伺服器上分佈式模型的特徵，而不會產生任何額外的通信成本，以及 2) FedOMG 與許多現有的 FL/FDG 方法正交，允許通過與它們無縫集成來進一步提高性能。在各種設置上進行了廣泛的實驗評估，以證明 FedOMG 與其他 FL/FDG 基準相比的魯棒性。我們的模型在四個 FL 基準數據集（MNIST、EMNIST、CIFAR-10 和 CIFAR-100）和三個 FDG 基準數據集（PACS、VLCS 和 OfficeHome）上優於最近的 SOTA 基準。", "author": "Trong-Binh Nguyen et.al.", "authors": "Trong-Binh Nguyen, Minh-Duong Nguyen, Jinsun Park, Quoc-Viet Pham, Won Joo Hwang", "id": "2501.14653v1", "paper_url": "http://arxiv.org/abs/2501.14653v1", "repo": "null"}}