{"2406.16441": {"publish_time": "2024-06-24", "title": "UniCoder: Scaling Code Large Language Model via Universal Code", "paper_summary": "Intermediate reasoning or acting steps have successfully improved large\nlanguage models (LLMs) for handling various downstream natural language\nprocessing (NLP) tasks. When applying LLMs for code generation, recent works\nmainly focus on directing the models to articulate intermediate\nnatural-language reasoning steps, as in chain-of-thought (CoT) prompting, and\nthen output code with the natural language or other structured intermediate\nsteps. However, such output is not suitable for code translation or generation\ntasks since the standard CoT has different logical structures and forms of\nexpression with the code. In this work, we introduce the universal code\n(UniCode) as the intermediate representation. It is a description of algorithm\nsteps using a mix of conventions of programming languages, such as assignment\noperator, conditional operator, and loop. Hence, we collect an instruction\ndataset UniCoder-Instruct to train our model UniCoder on multi-task learning\nobjectives. UniCoder-Instruct comprises natural-language questions, code\nsolutions, and the corresponding universal code. The alignment between the\nintermediate universal code representation and the final code solution\nsignificantly improves the quality of the generated code. The experimental\nresults demonstrate that UniCoder with the universal code significantly\noutperforms the previous prompting methods by a large margin, showcasing the\neffectiveness of the structural clues in pseudo-code.", "paper_summary_zh": "中介推理或作用步驟已成功改進大型語言模型 (LLM)，以處理各種下游自然語言處理 (NLP) 任務。在將 LLM 應用於程式碼產生時，最近的作品主要著重於引導模型表達中介自然語言推理步驟，就像在思維鏈 (CoT) 提示中一樣，然後輸出程式碼與自然語言或其他結構化的中介步驟。然而，此類輸出不適合程式碼翻譯或產生任務，因為標準 CoT 具有不同的邏輯結構和表達形式與程式碼。在這項工作中，我們引入了通用程式碼 (UniCode) 作為中介表示。它是使用程式語言慣例的組合來描述演算法步驟，例如賦值運算子、條件運算子，以及迴圈。因此，我們收集了一個教學資料集 UniCoder-Instruct，以在多任務學習目標上訓練我們的模型 UniCoder。UniCoder-Instruct 包含自然語言問題、程式碼解決方案，以及對應的通用程式碼。中介通用程式碼表示與最終程式碼解決方案之間的對齊顯著改進了產生程式碼的品質。實驗結果證明，具有通用程式碼的 UniCoder 明顯優於先前的提示方法，展示了準程式碼中結構線索的有效性。", "author": "Tao Sun et.al.", "authors": "Tao Sun, Linzheng Chai, Jian Yang, Yuwei Yin, Hongcheng Guo, Jiaheng Liu, Bing Wang, Liqun Yang, Zhoujun Li", "id": "2406.16441v1", "paper_url": "http://arxiv.org/abs/2406.16441v1", "repo": "null"}}