{"2411.10486": {"publish_time": "2024-11-14", "title": "Artificial Intelligence for Infectious Disease Prediction and Prevention: A Comprehensive Review", "paper_summary": "Artificial Intelligence (AI) and infectious diseases prediction have recently\nexperienced a common development and advancement. Machine learning (ML)\napparition, along with deep learning (DL) emergence, extended many approaches\nagainst diseases apparition and their spread. And despite their outstanding\nresults in predicting infectious diseases, conflicts appeared regarding the\ntypes of data used and how they can be studied, analyzed, and exploited using\nvarious emerging methods. This has led to some ongoing discussions in the\nfield. This research aims not only to provide an overview of what has been\naccomplished, but also to highlight the difficulties related to the types of\ndata used, and the learning methods applied for each research objective. It\ncategorizes these contributions into three areas: predictions using Public\nHealth Data to prevent the spread of a transmissible disease within a region;\npredictions using Patients' Medical Data to detect whether a person is infected\nby a transmissible disease; and predictions using both Public and patient\nmedical data to estimate the extent of disease spread in a population. The\npaper also critically assesses the potential of AI and outlines its limitations\nin infectious disease management.", "paper_summary_zh": "人工智能 (AI) 和傳染病預測最近經歷了一段共同發展和進步。機器學習 (ML) 的出現，以及深度學習 (DL) 的興起，擴展了許多對抗疾病出現及其傳播的方法。儘管它們在預測傳染病方面取得了傑出的成果，但對於所使用數據的類型以及如何使用各種新興方法對其進行研究、分析和利用，出現了爭議。這導致了該領域的一些持續討論。本研究不僅旨在概述已取得的成果，還旨在強調與所使用數據類型相關的難點，以及針對每個研究目標應用的學習方法。它將這些貢獻歸類為三個領域：使用公共衛生數據來預防傳染病在一個地區內傳播的預測；使用患者醫療數據來檢測一個人是否感染了傳染病的預測；以及使用公共和患者醫療數據來估計疾病在人群中傳播程度的預測。本文還批判性地評估了人工智能的潛力，並概述了它在傳染病管理中的局限性。", "author": "Selestine Melchane et.al.", "authors": "Selestine Melchane, Youssef Elmir, Farid Kacimi, Larbi Boubchir", "id": "2411.10486v1", "paper_url": "http://arxiv.org/abs/2411.10486v1", "repo": "null"}}