{"2407.08240": {"publish_time": "2024-07-11", "title": "Leveraging LLMs to Predict Affective States via Smartphone Sensor Features", "paper_summary": "As mental health issues for young adults present a pressing public health\nconcern, daily digital mood monitoring for early detection has become an\nimportant prospect. An active research area, digital phenotyping, involves\ncollecting and analysing data from personal digital devices such as smartphones\n(usage and sensors) and wearables to infer behaviours and mental health. Whilst\nthis data is standardly analysed using statistical and machine learning\napproaches, the emergence of large language models (LLMs) offers a new approach\nto make sense of smartphone sensing data. Despite their effectiveness across\nvarious domains, LLMs remain relatively unexplored in digital mental health,\nparticularly in integrating mobile sensor data. Our study aims to bridge this\ngap by employing LLMs to predict affect outcomes based on smartphone sensing\ndata from university students. We demonstrate the efficacy of zero-shot and\nfew-shot embedding LLMs in inferring general wellbeing. Our findings reveal\nthat LLMs can make promising predictions of affect measures using solely\nsmartphone sensing data. This research sheds light on the potential of LLMs for\naffective state prediction, emphasizing the intricate link between smartphone\nbehavioral patterns and affective states. To our knowledge, this is the first\nwork to leverage LLMs for affective state prediction and digital phenotyping\ntasks.", "paper_summary_zh": "隨著年輕人的心理健康問題成為迫切的公共衛生問題，每日數位情緒監控已成為早期偵測的重要前景。數位表型化是一個積極的研究領域，涉及收集和分析來自個人數位裝置（例如智慧型手機（使用和感測器）和可穿戴裝置）的資料，以推論行為和心理健康。雖然這些資料通常使用統計和機器學習方法進行分析，但大型語言模型 (LLM) 的出現提供了一種新的方法來理解智慧型手機感測資料。儘管 LLM 在各種領域都非常有效，但其在數位心理健康領域仍相對未被探索，特別是在整合行動感測器資料方面。我們的研究旨在透過使用 LLM 來根據大學生的智慧型手機感測資料預測影響結果，以彌合這一差距。我們展示了零次學習和少次學習嵌入式 LLM 在推論一般幸福感方面的效能。我們的研究結果顯示，LLM 可以僅使用智慧型手機感測資料對影響測量進行有希望的預測。本研究揭示了 LLM 在情感狀態預測方面的潛力，強調了智慧型手機行為模式和情感狀態之間的複雜聯繫。據我們所知，這是第一個利用 LLM 進行情感狀態預測和數位表型化任務的研究。", "author": "Tianyi Zhang et.al.", "authors": "Tianyi Zhang, Songyan Teng, Hong Jia, Simon D'Alfonso", "id": "2407.08240v1", "paper_url": "http://arxiv.org/abs/2407.08240v1", "repo": "null"}}