{"2408.04029": {"publish_time": "2024-08-07", "title": "Human Speech Perception in Noise: Can Large Language Models Paraphrase to Improve It?", "paper_summary": "Large Language Models (LLMs) can generate text by transferring style\nattributes like formality resulting in formal or informal text. However,\ninstructing LLMs to generate text that when spoken, is more intelligible in an\nacoustically difficult environment, is an under-explored topic. We conduct the\nfirst study to evaluate LLMs on a novel task of generating acoustically\nintelligible paraphrases for better human speech perception in noise. Our\nexperiments in English demonstrated that with standard prompting, LLMs struggle\nto control the non-textual attribute, i.e., acoustic intelligibility, while\nefficiently capturing the desired textual attributes like semantic equivalence.\nTo remedy this issue, we propose a simple prompting approach,\nprompt-and-select, which generates paraphrases by decoupling the desired\ntextual and non-textual attributes in the text generation pipeline. Our\napproach resulted in a 40% relative improvement in human speech perception, by\nparaphrasing utterances that are highly distorted in a listening condition with\nbabble noise at a signal-to-noise ratio (SNR) -5 dB. This study reveals the\nlimitation of LLMs in capturing non-textual attributes, and our proposed method\nshowcases the potential of using LLMs for better human speech perception in\nnoise.", "paper_summary_zh": "大型語言模型（LLM）可以透過轉移形式屬性（例如正式性）來產生文字，產生正式或非正式的文字。然而，指示 LLM 產生在口說時在聲學困難的環境中更易懂的文字，是一個尚未充分探討的主題。我們進行了第一個研究，以評估 LLM 在一個新的任務上，即產生聲學上可理解的同義詞，以改善人類在噪音中的言語感知。我們的英語實驗證明，在標準提示下，LLM 難以控制非文字屬性，即聲學可理解性，同時有效地捕捉所需的文字屬性，例如語義等價性。為了解決這個問題，我們提出了一個簡單的提示方法，提示和選擇，它透過在文字產生管道中解耦所需的文字和非文字屬性來產生同義詞。我們的做法在人類言語感知方面產生了 40% 的相對改善，透過在信號雜訊比 (SNR) -5 dB 的喧鬧噪音中聽取條件下，對失真嚴重的語句進行同義詞替換。這項研究揭示了 LLM 在捕捉非文字屬性方面的限制，而我們提出的方法展示了使用 LLM 在噪音中改善人類言語感知的潛力。", "author": "Anupama Chingacham et.al.", "authors": "Anupama Chingacham, Miaoran Zhang, Vera Demberg, Dietrich Klakow", "id": "2408.04029v1", "paper_url": "http://arxiv.org/abs/2408.04029v1", "repo": "https://github.com/uds-lsv/llm_eval_pi-spin"}}