{"2411.03569": {"publish_time": "2024-11-06", "title": "Towards Personalized Federated Learning via Comprehensive Knowledge Distillation", "paper_summary": "Federated learning is a distributed machine learning paradigm designed to\nprotect data privacy. However, data heterogeneity across various clients\nresults in catastrophic forgetting, where the model rapidly forgets previous\nknowledge while acquiring new knowledge. To address this challenge,\npersonalized federated learning has emerged to customize a personalized model\nfor each client. However, the inherent limitation of this mechanism is its\nexcessive focus on personalization, potentially hindering the generalization of\nthose models. In this paper, we present a novel personalized federated learning\nmethod that uses global and historical models as teachers and the local model\nas the student to facilitate comprehensive knowledge distillation. The\nhistorical model represents the local model from the last round of client\ntraining, containing historical personalized knowledge, while the global model\nrepresents the aggregated model from the last round of server aggregation,\ncontaining global generalized knowledge. By applying knowledge distillation, we\neffectively transfer global generalized knowledge and historical personalized\nknowledge to the local model, thus mitigating catastrophic forgetting and\nenhancing the general performance of personalized models. Extensive\nexperimental results demonstrate the significant advantages of our method.", "paper_summary_zh": "聯邦學習是一種分散式機器學習範例，旨在保護資料隱私。然而，不同用戶端之間的資料異質性會導致災難性遺忘，模型在獲取新知識的同時會迅速遺忘先前的知識。為了應對這一挑戰，個性化聯邦學習應運而生，為每個用戶端自訂個性化模型。然而，這種機制的固有限制在於過度重視個性化，可能會阻礙這些模型的泛化。在本文中，我們提出了一種新穎的個性化聯邦學習方法，它使用全局模型和歷史模型作為教師，並將本地模型作為學生，以促進全面的知識蒸餾。歷史模型表示來自上次用戶端訓練的本地模型，包含歷史個性化知識，而全局模型表示來自上次伺服器聚合的聚合模型，包含全局概化知識。通過應用知識蒸餾，我們有效地將全局概化知識和歷史個性化知識傳遞到本地模型，從而減輕災難性遺忘並增強個性化模型的整體效能。廣泛的實驗結果證明了我們方法的顯著優勢。", "author": "Pengju Wang et.al.", "authors": "Pengju Wang, Bochao Liu, Weijia Guo, Yong Li, Shiming Ge", "id": "2411.03569v1", "paper_url": "http://arxiv.org/abs/2411.03569v1", "repo": "null"}}