{"2405.04171": {"publish_time": "2024-05-07", "title": "FedStale: leveraging stale client updates in federated learning", "paper_summary": "Federated learning algorithms, such as FedAvg, are negatively affected by\ndata heterogeneity and partial client participation. To mitigate the latter\nproblem, global variance reduction methods, like FedVARP, leverage stale model\nupdates for non-participating clients. These methods are effective under\nhomogeneous client participation. Yet, this paper shows that, when some clients\nparticipate much less than others, aggregating updates with different levels of\nstaleness can detrimentally affect the training process. Motivated by this\nobservation, we introduce FedStale, a novel algorithm that updates the global\nmodel in each round through a convex combination of \"fresh\" updates from\nparticipating clients and \"stale\" updates from non-participating ones. By\nadjusting the weight in the convex combination, FedStale interpolates between\nFedAvg, which only uses fresh updates, and FedVARP, which treats fresh and\nstale updates equally. Our analysis of FedStale convergence yields the\nfollowing novel findings: i) it integrates and extends previous FedAvg and\nFedVARP analyses to heterogeneous client participation; ii) it underscores how\nthe least participating client influences convergence error; iii) it provides\npractical guidelines to best exploit stale updates, showing that their\nusefulness diminishes as data heterogeneity decreases and participation\nheterogeneity increases. Extensive experiments featuring diverse levels of\nclient data and participation heterogeneity not only confirm these findings but\nalso show that FedStale outperforms both FedAvg and FedVARP in many settings.", "paper_summary_zh": "聯邦學習演算法（例如 FedAvg）會受到資料異質性與部分用戶參與的負面影響。為了減輕後者問題，全球變異數減少方法（例如 FedVARP）會利用過時模型更新來應付未參與用戶。這些方法在用戶參與度均勻的情況下有效。然而，本文顯示，當某些用戶參與度遠低於其他用戶時，彙總具有不同過時程度的更新可能會對訓練流程造成負面影響。基於此觀察，我們引進 FedStale，一種新演算法，它會透過參與用戶的「最新」更新與未參與用戶的「過時」更新的凸組合，在每一輪更新全球模型。透過調整凸組合中的權重，FedStale 會在僅使用最新更新的 FedAvg 與將最新和過時更新視為同等的 FedVARP 之間進行插補。我們對 FedStale 收斂性的分析產生以下新發現：i) 它整合並延伸先前的 FedAvg 和 FedVARP 分析到異質用戶參與；ii) 它強調參與度最低的用戶如何影響收斂誤差；iii) 它提供實務準則，以最佳利用過時更新，顯示它們的效用會隨著資料異質性降低和參與異質性增加而遞減。大量實驗具備不同程度的用戶資料和參與異質性，不僅證實這些發現，也顯示 FedStale 在許多設定中都優於 FedAvg 和 FedVARP。", "author": "Angelo Rodio et.al.", "authors": "Angelo Rodio, Giovanni Neglia", "id": "2405.04171v1", "paper_url": "http://arxiv.org/abs/2405.04171v1", "repo": "null"}}