{"2412.08156": {"publish_time": "2024-12-11", "title": "Antelope: Potent and Concealed Jailbreak Attack Strategy", "paper_summary": "Due to the remarkable generative potential of diffusion-based models,\nnumerous researches have investigated jailbreak attacks targeting these\nframeworks. A particularly concerning threat within image models is the\ngeneration of Not-Safe-for-Work (NSFW) content. Despite the implementation of\nsecurity filters, numerous efforts continue to explore ways to circumvent these\nsafeguards. Current attack methodologies primarily encompass adversarial prompt\nengineering or concept obfuscation, yet they frequently suffer from slow search\nefficiency, conspicuous attack characteristics and poor alignment with targets.\nTo overcome these challenges, we propose Antelope, a more robust and covert\njailbreak attack strategy designed to expose security vulnerabilities inherent\nin generative models. Specifically, Antelope leverages the confusion of\nsensitive concepts with similar ones, facilitates searches in the semantically\nadjacent space of these related concepts and aligns them with the target\nimagery, thereby generating sensitive images that are consistent with the\ntarget and capable of evading detection. Besides, we successfully exploit the\ntransferability of model-based attacks to penetrate online black-box services.\nExperimental evaluations demonstrate that Antelope outperforms existing\nbaselines across multiple defensive mechanisms, underscoring its efficacy and\nversatility.", "paper_summary_zh": "由於基於擴散模型的顯著生成潛力，許多研究探討了針對這些框架的越獄攻擊。圖像模型中一個特別令人擔憂的威脅是非工作安全 (NSFW) 內容的生成。儘管實施了安全過濾器，但仍有許多努力持續探索規避這些防護措施的方法。目前的攻擊方法主要包括對抗提示工程或概念混淆，但它們經常遭受搜索效率低、攻擊特徵明顯以及與目標對齊不良的問題。為了克服這些挑戰，我們提出了 Antelope，這是一種更強大且隱蔽的越獄攻擊策略，旨在揭露生成模型中固有的安全漏洞。具體來說，Antelope 利用敏感概念與相似概念的混淆，促進在這些相關概念的語義鄰近空間中進行搜索，並將它們與目標圖像對齊，從而生成與目標一致且能夠逃避檢測的敏感圖像。此外，我們成功利用基於模型的攻擊的可傳遞性來滲透在線黑盒子服務。實驗評估表明，Antelope 在多種防禦機制中優於現有的基準，突顯了其有效性和多功能性。", "author": "Xin Zhao et.al.", "authors": "Xin Zhao, Xiaojun Chen, Haoyu Gao", "id": "2412.08156v1", "paper_url": "http://arxiv.org/abs/2412.08156v1", "repo": "null"}}