{"2408.03388": {"publish_time": "2024-08-06", "title": "A Non-negative VAE:the Generalized Gamma Belief Network", "paper_summary": "The gamma belief network (GBN), often regarded as a deep topic model, has\ndemonstrated its potential for uncovering multi-layer interpretable latent\nrepresentations in text data. Its notable capability to acquire interpretable\nlatent factors is partially attributed to sparse and non-negative\ngamma-distributed latent variables. However, the existing GBN and its\nvariations are constrained by the linear generative model, thereby limiting\ntheir expressiveness and applicability. To address this limitation, we\nintroduce the generalized gamma belief network (Generalized GBN) in this paper,\nwhich extends the original linear generative model to a more expressive\nnon-linear generative model. Since the parameters of the Generalized GBN no\nlonger possess an analytic conditional posterior, we further propose an\nupward-downward Weibull inference network to approximate the posterior\ndistribution of the latent variables. The parameters of both the generative\nmodel and the inference network are jointly trained within the variational\ninference framework. Finally, we conduct comprehensive experiments on both\nexpressivity and disentangled representation learning tasks to evaluate the\nperformance of the Generalized GBN against state-of-the-art Gaussian\nvariational autoencoders serving as baselines.", "paper_summary_zh": "伽马信念網路 (GBN) 通常被視為深度主題模型，已展現出其在解構文本資料中多層可解釋潛在表徵的潛力。其獲取可解釋潛在因子的顯著能力部分歸因於稀疏且非負的伽馬分布潛在變數。然而，現有的 GBN 及其變異受到線性生成模型的約束，從而限制了其表現力和適用性。為了解決這個限制，我們在這篇論文中引入了廣義伽馬信念網路 (廣義 GBN)，它將原始線性生成模型擴展到更具表現力的非線性生成模型。由於廣義 GBN 的參數不再具有解析條件後驗，我們進一步提出了向上向下威布爾推論網路來近似潛在變數的後驗分佈。生成模型和推論網路的參數在變分推論架構內聯合訓練。最後，我們對表現力和解糾纏表徵學習任務進行了全面的實驗，以評估廣義 GBN 相對於作為基準的高斯變分自動編碼器的效能。", "author": "Zhibin Duan et.al.", "authors": "Zhibin Duan, Tiansheng Wen, Muyao Wang, Bo Chen, Mingyuan Zhou", "id": "2408.03388v1", "paper_url": "http://arxiv.org/abs/2408.03388v1", "repo": "null"}}