{"2409.11402": {"publish_time": "2024-09-17", "title": "NVLM: Open Frontier-Class Multimodal LLMs", "paper_summary": "We introduce NVLM 1.0, a family of frontier-class multimodal large language\nmodels (LLMs) that achieve state-of-the-art results on vision-language tasks,\nrivaling the leading proprietary models (e.g., GPT-4o) and open-access models\n(e.g., Llama 3-V 405B and InternVL 2). Remarkably, NVLM 1.0 shows improved\ntext-only performance over its LLM backbone after multimodal training. In terms\nof model design, we perform a comprehensive comparison between decoder-only\nmultimodal LLMs (e.g., LLaVA) and cross-attention-based models (e.g.,\nFlamingo). Based on the strengths and weaknesses of both approaches, we propose\na novel architecture that enhances both training efficiency and multimodal\nreasoning capabilities. Furthermore, we introduce a 1-D tile-tagging design for\ntile-based dynamic high-resolution images, which significantly boosts\nperformance on multimodal reasoning and OCR-related tasks. Regarding training\ndata, we meticulously curate and provide detailed information on our multimodal\npretraining and supervised fine-tuning datasets. Our findings indicate that\ndataset quality and task diversity are more important than scale, even during\nthe pretraining phase, across all architectures. Notably, we develop\nproduction-grade multimodality for the NVLM-1.0 models, enabling them to excel\nin vision-language tasks while maintaining and even improving text-only\nperformance compared to their LLM backbones. To achieve this, we craft and\nintegrate a high-quality text-only dataset into multimodal training, alongside\na substantial amount of multimodal math and reasoning data, leading to enhanced\nmath and coding capabilities across modalities. To advance research in the\nfield, we are releasing the model weights and will open-source the code for the\ncommunity: https://nvlm-project.github.io/.", "paper_summary_zh": "<paragraph>我們推出 NVLM 1.0，這是一個前沿級多模態大型語言模型 (LLM) 家族，在視覺語言任務上取得了最先進的成果，與領先的專有模型（例如 GPT-4o）和開放訪問模型（例如 Llama 3-V 405B 和 InternVL 2）相媲美。值得注意的是，NVLM 1.0 在多模態訓練後，其純文字表現優於其 LLM 主幹。在模型設計方面，我們對僅解碼器多模態 LLM（例如 LLaVA）和基於交叉注意力的模型（例如 Flamingo）進行了全面比較。根據兩種方法的優缺點，我們提出了一種新穎的架構，既能提高訓練效率，又能增強多模態推理能力。此外，我們為基於圖塊的動態高解析度影像引入了 1-D 磁磚標籤設計，這顯著提升了多模態推理和 OCR 相關任務的效能。關於訓練資料，我們精心策劃並提供了有關我們多模態預訓練和監督微調資料集的詳細資訊。我們的研究結果表明，資料集品質和任務多樣性比規模更重要，即使在預訓練階段，也適用於所有架構。值得注意的是，我們為 NVLM-1.0 模型開發了生產級多模態，讓它們能夠在視覺語言任務中表現出色，同時與其 LLM 主幹相比，維持甚至提升純文字表現。為了實現這一點，我們在多模態訓練中製作並整合了一個高品質的純文字資料集，以及大量的多模態數學和推理資料，從而增強了跨模態的數學和編碼能力。為了推動該領域的研究，我們將釋出模型權重，並將為社群開放原始碼：https://nvlm-project.github.io/。</paragraph>", "author": "Wenliang Dai et.al.", "authors": "Wenliang Dai, Nayeon Lee, Boxin Wang, Zhuoling Yang, Zihan Liu, Jon Barker, Tuomas Rintamaki, Mohammad Shoeybi, Bryan Catanzaro, Wei Ping", "id": "2409.11402v1", "paper_url": "http://arxiv.org/abs/2409.11402v1", "repo": "null"}}