{"2407.13358": {"publish_time": "2024-07-18", "title": "Capturing Style in Author and Document Representation", "paper_summary": "A wide range of Deep Natural Language Processing (NLP) models integrates\ncontinuous and low dimensional representations of words and documents.\nSurprisingly, very few models study representation learning for authors. These\nrepresentations can be used for many NLP tasks, such as author identification\nand classification, or in recommendation systems. A strong limitation of\nexisting works is that they do not explicitly capture writing style, making\nthem hardly applicable to literary data. We therefore propose a new\narchitecture based on Variational Information Bottleneck (VIB) that learns\nembeddings for both authors and documents with a stylistic constraint. Our\nmodel fine-tunes a pre-trained document encoder. We stimulate the detection of\nwriting style by adding predefined stylistic features making the representation\naxis interpretable with respect to writing style indicators. We evaluate our\nmethod on three datasets: a literary corpus extracted from the Gutenberg\nProject, the Blog Authorship Corpus and IMDb62, for which we show that it\nmatches or outperforms strong/recent baselines in authorship attribution while\ncapturing much more accurately the authors stylistic aspects.", "paper_summary_zh": "廣泛的深度自然語言處理 (NLP) 模型整合了單詞和文件的連續且低維表示。令人驚訝的是，很少有模型研究作者的表示學習。這些表示可用於許多 NLP 任務，例如作者識別和分類，或推薦系統。現有工作的重大限制在於它們沒有明確捕捉寫作風格，這使得它們難以應用於文學數據。因此，我們提出了一種基於變分信息瓶頸 (VIB) 的新架構，該架構學習具有風格約束的作者和文件的嵌入。我們的模型微調了預先訓練的文檔編碼器。我們通過添加預定義的風格特徵來激勵寫作風格的檢測，從而使表示軸相對於寫作風格指標具有可解釋性。我們在三個數據集上評估了我們的模型：從古騰堡項目中提取的文學語料庫、博客作者語料庫和 IMDb62，我們展示了它在作者歸屬中匹配或優於強/最近的基準，同時更準確地捕捉作者的風格方面。", "author": "Enzo Terreau et.al.", "authors": "Enzo Terreau, Antoine Gourru, Julien Velcin", "id": "2407.13358v1", "paper_url": "http://arxiv.org/abs/2407.13358v1", "repo": "null"}}