{"2406.04264": {"publish_time": "2024-06-06", "title": "MLVU: A Comprehensive Benchmark for Multi-Task Long Video Understanding", "paper_summary": "The evaluation of Long Video Understanding (LVU) performance poses an\nimportant but challenging research problem. Despite previous efforts, the\nexisting video understanding benchmarks are severely constrained by several\nissues, especially the insufficient lengths of videos, a lack of diversity in\nvideo types and evaluation tasks, and the inappropriateness for evaluating LVU\nperformances. To address the above problems, we propose a new benchmark, called\nMLVU (Multi-task Long Video Understanding Benchmark), for the comprehensive and\nin-depth evaluation of LVU. MLVU presents the following critical values: 1) The\nsubstantial and flexible extension of video lengths, which enables the\nbenchmark to evaluate LVU performance across a wide range of durations. 2) The\ninclusion of various video genres, e.g., movies, surveillance footage,\negocentric videos, cartoons, game videos, etc., which reflects the models' LVU\nperformances in different scenarios. 3) The development of diversified\nevaluation tasks, which enables a comprehensive examination of MLLMs' key\nabilities in long-video understanding. The empirical study with 20 latest MLLMs\nreveals significant room for improvement in today's technique, as all existing\nmethods struggle with most of the evaluation tasks and exhibit severe\nperformance degradation when handling longer videos. Additionally, it suggests\nthat factors such as context length, image-understanding quality, and the\nchoice of LLM backbone can play critical roles in future advancements. We\nanticipate that MLVU will advance the research of long video understanding by\nproviding a comprehensive and in-depth analysis of MLLMs.", "paper_summary_zh": "長影片理解 (LVU) 效能的評估提出一個重要但具挑戰性的研究問題。儘管先前已做出努力，現有的影片理解基準受到幾個問題的嚴重限制，特別是影片長度不足、影片類型和評估任務缺乏多樣性，以及不適合評估 LVU 效能。為了解決上述問題，我們提出一個新的基準，稱為 MLVU（多任務長影片理解基準），用於全面深入評估 LVU。MLVU 呈現以下幾個關鍵價值：1) 影片長度的實質且彈性延伸，使基準能夠評估各種時長的 LVU 效能。2) 納入各種影片類型，例如電影、監視錄影、自拍影片、卡通、遊戲影片等，反映模型在不同場景中的 LVU 效能。3) 開發多樣化的評估任務，全面檢視 MLLM 在長影片理解中的關鍵能力。針對 20 個最新 MLLM 進行的實證研究顯示，當今技術有顯著進步空間，因為所有現有方法在大部分評估任務中都面臨困難，且在處理較長影片時效能嚴重下降。此外，研究指出，例如脈絡長度、影像理解品質和 LLM 主幹的選擇等因素，在未來的進展中可能扮演關鍵角色。我們預期 MLVU 將透過提供 MLLM 的全面深入分析，推進長影片理解的研究。", "author": "Junjie Zhou et.al.", "authors": "Junjie Zhou, Yan Shu, Bo Zhao, Boya Wu, Shitao Xiao, Xi Yang, Yongping Xiong, Bo Zhang, Tiejun Huang, Zheng Liu", "id": "2406.04264v1", "paper_url": "http://arxiv.org/abs/2406.04264v1", "repo": "null"}}