{"2405.10700": {"publish_time": "2024-05-17", "title": "SynDy: Synthetic Dynamic Dataset Generation Framework for Misinformation Tasks", "paper_summary": "Diaspora communities are disproportionately impacted by off-the-radar\nmisinformation and often neglected by mainstream fact-checking efforts,\ncreating a critical need to scale-up efforts of nascent fact-checking\ninitiatives. In this paper we present SynDy, a framework for Synthetic Dynamic\nDataset Generation to leverage the capabilities of the largest frontier Large\nLanguage Models (LLMs) to train local, specialized language models. To the best\nof our knowledge, SynDy is the first paper utilizing LLMs to create\nfine-grained synthetic labels for tasks of direct relevance to misinformation\nmitigation, namely Claim Matching, Topical Clustering, and Claim Relationship\nClassification. SynDy utilizes LLMs and social media queries to automatically\ngenerate distantly-supervised, topically-focused datasets with synthetic labels\non these three tasks, providing essential tools to scale up human-led\nfact-checking at a fraction of the cost of human-annotated data. Training on\nSynDy's generated labels shows improvement over a standard baseline and is not\nsignificantly worse compared to training on human labels (which may be\ninfeasible to acquire). SynDy is being integrated into Meedan's chatbot\ntiplines that are used by over 50 organizations, serve over 230K users\nannually, and automatically distribute human-written fact-checks via messaging\napps such as WhatsApp. SynDy will also be integrated into our deployed\nCo-Insights toolkit, enabling low-resource organizations to launch tiplines for\ntheir communities. Finally, we envision SynDy enabling additional fact-checking\ntools such as matching new misinformation claims to high-quality explainers on\ncommon misinformation topics.", "paper_summary_zh": "離散社群受到雷達外錯誤資訊的不成比例影響，且通常被主流查核事實的努力所忽略，這造成了擴大新興查核事實計畫的關鍵需求。在本文中，我們提出 SynDy，一個用於合成動態資料集生成的架構，以利用最大的前沿大型語言模型 (LLM) 的能力來訓練在地的、專業的語言模型。就我們所知，SynDy 是第一個利用 LLM 來為與錯誤資訊緩解直接相關的任務建立細緻的合成標籤的論文，也就是宣稱比對、主題分類和宣稱關係分類。SynDy 利用 LLM 和社群媒體查詢，自動產生遠程監督、主題為焦點的資料集，以及這三個任務的合成標籤，提供必要的工具，以人類標註資料的成本，來擴大由人主導的查核事實。在 SynDy 生成的標籤上訓練，顯示出比標準基準線有進步，並且與在人類標籤上訓練相比，並未顯著惡化（這可能是難以取得的）。SynDy 正整合到 Meedan 的聊天機器人提示熱線中，由超過 50 個組織使用，每年服務超過 23 萬名使用者，並透過 WhatsApp 等訊息應用程式自動散佈由人撰寫的事實查核。SynDy 也將整合到我們已部署的共同見解工具組中，讓資源不足的組織能夠為他們的社群啟動提示熱線。最後，我們預想 SynDy 能夠啟用其他查核事實工具，例如將新的錯誤資訊宣稱與常見錯誤資訊主題的高品質說明相匹配。", "author": "Michael Shliselberg et.al.", "authors": "Michael Shliselberg, Ashkan Kazemi, Scott A. Hale, Shiri Dori-Hacohen", "id": "2405.10700v1", "paper_url": "http://arxiv.org/abs/2405.10700v1", "repo": "null"}}