{"2409.10297": {"publish_time": "2024-09-16", "title": "On Synthetic Texture Datasets: Challenges, Creation, and Curation", "paper_summary": "The influence of textures on machine learning models has been an ongoing\ninvestigation, specifically in texture bias/learning, interpretability, and\nrobustness. However, due to the lack of large and diverse texture data\navailable, the findings in these works have been limited, as more comprehensive\nevaluations have not been feasible. Image generative models are able to provide\ndata creation at scale, but utilizing these models for texture synthesis has\nbeen unexplored and poses additional challenges both in creating accurate\ntexture images and validating those images. In this work, we introduce an\nextensible methodology and corresponding new dataset for generating\nhigh-quality, diverse texture images capable of supporting a broad set of\ntexture-based tasks. Our pipeline consists of: (1) developing prompts from a\nrange of descriptors to serve as input to text-to-image models, (2) adopting\nand adapting Stable Diffusion pipelines to generate and filter the\ncorresponding images, and (3) further filtering down to the highest quality\nimages. Through this, we create the Prompted Textures Dataset (PTD), a dataset\nof 362,880 texture images that span 56 textures. During the process of\ngenerating images, we find that NSFW safety filters in image generation\npipelines are highly sensitive to texture (and flag up to 60\\% of our texture\nimages), uncovering a potential bias in these models and presenting unique\nchallenges when working with texture data. Through both standard metrics and a\nhuman evaluation, we find that our dataset is high quality and diverse.", "paper_summary_zh": "機器學習模型中紋理的影響一直是持續的調查，特別是在紋理偏差/學習、可解釋性和魯棒性方面。然而，由於缺乏大量且多樣化的紋理數據，這些作品中的發現受到限制，因為更全面的評估並不可行。圖像生成模型能夠大規模地提供數據創建，但將這些模型用於紋理合成尚未被探索，並且在創建準確的紋理圖像和驗證這些圖像方面提出了額外的挑戰。在這項工作中，我們引入了一個可擴展的方法和相應的新數據集，用於生成能夠支持廣泛的基於紋理任務的高品質、多樣化的紋理圖像。我們的管道包括：(1) 從一系列描述符中開發提示，作為文本到圖像模型的輸入，(2) 採用和改編 Stable Diffusion 管道來生成和過濾相應的圖像，(3) 進一步過濾到最高品質的圖像。通過這種方式，我們創建了提示紋理數據集 (PTD)，一個包含 362,880 個紋理圖像的數據集，跨越 56 個紋理。在生成圖像的過程中，我們發現圖像生成管道中的 NSFW 安全過濾器對紋理高度敏感（並標記出我們紋理圖像的 60%），揭示了這些模型中的潛在偏差，並在處理紋理數據時提出了獨特的挑戰。通過標準指標和人工評估，我們發現我們的數據集質量高且多樣化。", "author": "Blaine Hoak et.al.", "authors": "Blaine Hoak, Patrick McDaniel", "id": "2409.10297v1", "paper_url": "http://arxiv.org/abs/2409.10297v1", "repo": "null"}}