{"2408.06186": {"publish_time": "2024-08-12", "title": "Improving Structural Diversity of Blackbox LLMs via Chain-of-Specification Prompting", "paper_summary": "The capability to generate diverse text is a key challenge facing large\nlanguage models (LLMs). Thus far, diversity has been studied via metrics such\nas $n$-gram diversity or diversity of BERT embeddings. However, for these kinds\nof diversity, the user has little control over the dimensions along which\ndiversity is considered. For example, in the poetry domain, one might desire\ndiversity in terms of rhyme and meter, whereas in the code domain, one might\ndesire diversity in terms of the kinds of expressions used to solve a problem.\nWe propose a diversity metric called structural diversity, where the user\nprovides a mapping from generated text to features capturing the kinds of\ndiversity that they care about. In addition, we propose a novel strategy called\nchain-of-specification (CoS) prompting for improving diversity by first having\nthe LLM generate a specification encoding one instance of structural features,\nand then prompting the LLM to generate text that satisfies these features;\nnotably, our strategy works with blackbox LLMs. In our experiments, we show\nthat for structural diversity in the poetry and code domains, CoS significantly\nimproves diversity compared to several baselines.", "paper_summary_zh": "生成多樣化的文本的能力是大語言模型 (LLM) 面臨的一項關鍵挑戰。到目前為止，多樣性已透過諸如 $n$-gram 多樣性或 BERT 嵌入多樣性等指標進行研究。然而，對於這些種類的多樣性，使用者對於多樣性被考慮的維度幾乎沒有控制權。例如，在詩歌領域中，人們可能希望在押韻和格律方面具有多樣性，而在程式碼領域中，人們可能希望在用於解決問題的表達式種類方面具有多樣性。我們提出了一種稱為結構多樣性的多樣性指標，其中使用者提供從生成文本到特徵的對應，以擷取他們關心的多樣性種類。此外，我們提出了一種稱為規格鏈 (CoS) 提示的新策略，透過先讓 LLM 產生編碼結構特徵的一個實例的規格，然後提示 LLM 產生滿足這些特徵的文本，進而改善多樣性；值得注意的是，我們的策略適用於黑盒 LLM。在我們的實驗中，我們展示了對於詩歌和程式碼領域中的結構多樣性，與幾個基線相比，CoS 大幅改善了多樣性。", "author": "Halley Young et.al.", "authors": "Halley Young, Yimeng Zeng, Jacob Gardner, Osbert Bastani", "id": "2408.06186v1", "paper_url": "http://arxiv.org/abs/2408.06186v1", "repo": "null"}}