{"2502.11844": {"publish_time": "2025-02-17", "title": "BaxBench: Can LLMs Generate Correct and Secure Backends?", "paper_summary": "The automatic generation of programs has long been a fundamental challenge in\ncomputer science. Recent benchmarks have shown that large language models\n(LLMs) can effectively generate code at the function level, make code edits,\nand solve algorithmic coding tasks. However, to achieve full automation, LLMs\nshould be able to generate production-quality, self-contained application\nmodules. To evaluate the capabilities of LLMs in solving this challenge, we\nintroduce BaxBench, a novel evaluation benchmark consisting of 392 tasks for\nthe generation of backend applications. We focus on backends for three critical\nreasons: (i) they are practically relevant, building the core components of\nmost modern web and cloud software, (ii) they are difficult to get right,\nrequiring multiple functions and files to achieve the desired functionality,\nand (iii) they are security-critical, as they are exposed to untrusted\nthird-parties, making secure solutions that prevent deployment-time attacks an\nimperative. BaxBench validates the functionality of the generated applications\nwith comprehensive test cases, and assesses their security exposure by\nexecuting end-to-end exploits. Our experiments reveal key limitations of\ncurrent LLMs in both functionality and security: (i) even the best model,\nOpenAI o1, achieves a mere 60% on code correctness; (ii) on average, we could\nsuccessfully execute security exploits on more than half of the correct\nprograms generated by each LLM; and (iii) in less popular backend frameworks,\nmodels further struggle to generate correct and secure applications. Progress\non BaxBench signifies important steps towards autonomous and secure software\ndevelopment with LLMs.", "paper_summary_zh": "<paragraph>程式自動產生一直是電腦科學中的基本挑戰。最近的基準測試顯示，大型語言模型 (LLM) 能夠有效產生函數層級的程式碼、進行程式碼編輯，以及解決演算法編碼任務。然而，若要達成完全自動化，LLM 應能夠產生生產品質、獨立的應用程式模組。為了評估 LLM 在解決此挑戰的能力，我們引入了 BaxBench，這是一個包含 392 個後端應用程式產生任務的新評估基準。我們專注於後端有三個關鍵原因：(i) 它們在實務上有其相關性，建構了大多數現代網路和雲端軟體的核心元件；(ii) 它們難以正確執行，需要多個函數和檔案才能達成所需的運作功能；(iii) 它們與安全性息息相關，因為它們會暴露於不受信任的第三方，使得預防部署時攻擊的安全解決方案成為當務之急。BaxBench 使用全面的測試案例驗證產生應用程式的功能，並透過執行端對端漏洞利用來評估其安全性風險。我們的實驗揭露了目前 LLM 在功能和安全性上的主要限制：(i) 即使是最好的模型 OpenAI o1，在程式碼正確性上也僅達到 60%；(ii) 平均而言，我們能夠在每個 LLM 產生的正確程式中成功執行超過一半的安全漏洞利用；(iii) 在較不受歡迎的後端框架中，模型在產生正確且安全的應用程式上更加困難。在 BaxBench 上的進展代表著使用 LLM 朝向自主且安全的軟體開發邁出了重要的一步。</paragraph>", "author": "Mark Vero et.al.", "authors": "Mark Vero, Niels Mündler, Victor Chibotaru, Veselin Raychev, Maximilian Baader, Nikola Jovanović, Jingxuan He, Martin Vechev", "id": "2502.11844v1", "paper_url": "http://arxiv.org/abs/2502.11844v1", "repo": "null"}}