{"2406.07522": {"publish_time": "2024-06-11", "title": "Samba: Simple Hybrid State Space Models for Efficient Unlimited Context Language Modeling", "paper_summary": "Efficiently modeling sequences with infinite context length has been a\nlong-standing problem. Past works suffer from either the quadratic computation\ncomplexity or the limited extrapolation ability on length generalization. In\nthis work, we present Samba, a simple hybrid architecture that layer-wise\ncombines Mamba, a selective State Space Model (SSM), with Sliding Window\nAttention (SWA). Samba selectively compresses a given sequence into recurrent\nhidden states while still maintaining the ability to precisely recall memories\nwith the attention mechanism. We scale Samba up to 3.8B parameters with 3.2T\ntraining tokens and show that Samba substantially outperforms the\nstate-of-the-art models based on pure attention or SSMs on a wide range of\nbenchmarks. When trained on 4K length sequences, Samba can be efficiently\nextrapolated to 256K context length with perfect memory recall and show\nimproved token predictions up to 1M context length. As a linear-time sequence\nmodel, Samba enjoys a 3.73x higher throughput compared to Transformers with\ngrouped-query attention when processing user prompts of 128K length, and 3.64x\nspeedup when generating 64K tokens with unlimited streaming. A sample\nimplementation of Samba is publicly available in\nhttps://github.com/microsoft/Samba.", "paper_summary_zh": "有效地對具有無限上下文長度的序列進行建模一直是一個長期的問題。過去的工作要么計算複雜度為二次方，要么在長度泛化上外推能力有限。在這項工作中，我們提出了 Samba，這是一種簡單的混合架構，它逐層結合了選擇性狀態空間模型 (SSM) Mamba 與滑動窗口注意力 (SWA)。Samba 將給定的序列選擇性地壓縮到遞迴隱藏狀態中，同時仍保持使用注意力機制準確召回記憶的能力。我們將 Samba 擴展到 3.8B 參數，並使用 3.2T 訓練令牌，並表明 Samba 在基於純注意力或 SSM 的各種基準上都明顯優於最先進的模型。在 4K 長度序列上進行訓練時，Samba 可以有效地外推到 256K 上下文長度，並完美地召回記憶，並顯示出在長達 1M 上下文長度範圍內改進的令牌預測。作為一個線性時間序列模型，與具有分組查詢注意力的 Transformer 相比，Samba 在處理 128K 長度的用戶提示時享有高 3.73 倍的吞吐量，並且在使用無限串流生成 64K 令牌時，加速了 3.64 倍。Samba 的示例實作已公開發布在 https://github.com/microsoft/Samba。", "author": "Liliang Ren et.al.", "authors": "Liliang Ren, Yang Liu, Yadong Lu, Yelong Shen, Chen Liang, Weizhu Chen", "id": "2406.07522v1", "paper_url": "http://arxiv.org/abs/2406.07522v1", "repo": "null"}}