{"2410.23111": {"publish_time": "2024-10-30", "title": "Why Gradient Subspace? Identifying and Mitigating LoRA's Bottlenecks in Federated Fine-Tuning of Large Language Models", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities across\nvarious domains, particularly in task generalization for both text and vision\ndata. While fine-tuning these models can significantly enhance their\nperformance on specific downstream tasks, it often requires high-quality data\nthat cannot be shared due to privacy concerns. Federated Learning (FL) offers a\npromising solution for collaborative training without direct data sharing.\nHowever, many parameter-efficient fine-tuning strategies for LLMs in FL,\nparticularly those based on Low-Rank Adaptation (LoRA), face limitations. In\nthis paper, we critically analyze the convergence and performance guarantees of\npopular FL frameworks utilizing LoRA, highlighting its suboptimal nature due to\nconstrained subspace learning of low-rank matrices. This limitation hinders\neffective fine-tuning of LLMs in federated settings. Through rigorous\nanalytical and empirical evaluations, we demonstrate that direct weight\naveraging outperforms LoRA-based strategies, leading to superior performance\nfor fine-tuned models. Our comprehensive comparison exposes inefficiencies in\nLoRA approaches and underscores the advantages of direct weight aggregation. We\nextend our analysis to low-rank gradient-based optimizers, such as GaLore, used\nduring local training steps. Our findings show that GaLore is a more effective\nalternative, outperforming federated LoRA methods like FlexLoRA and FFA-LoRA\nacross both text and image modalities. While privacy remains paramount in FL\ndiscourse, our focus is on assessing performance outcomes of federated\nfine-tuned models and evaluating various FL frameworks from both theoretical\nand empirical perspectives. Our findings advocate reassessing the reliance on\nLoRA within FL contexts, paving the way for more efficient training\nmethodologies.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種領域展現出非凡的能力，特別是在文本和視覺資料的任務概括方面。雖然微調這些模型可以顯著提升其在特定下游任務中的效能，但這通常需要高品質的資料，而這些資料可能無法因隱私考量而共用。聯合學習 (FL) 提供了一個有前途的解決方案，可以進行協作訓練，而無需直接共用資料。然而，許多針對 LLM 在 FL 中的參數有效微調策略，特別是那些基於低秩適應 (LoRA) 的策略，都面臨限制。在本文中，我們批判性地分析了使用 LoRA 的熱門 FL 架構的收斂性和效能保證，並強調其次佳性質，原因在於低秩矩陣的受限子空間學習。此限制阻礙了在聯合設定中對 LLM 進行有效的微調。透過嚴謹的分析和經驗評估，我們證明直接權重平均優於基於 LoRA 的策略，從而提升微調模型的效能。我們的全面比較揭露了 LoRA 方法的低效率，並強調了直接權重聚合的優點。我們將分析延伸至低秩基於梯度的最佳化器，例如 GaLore，這些最佳化器用於局部訓練步驟。我們的發現顯示，GaLore 是一種更有效的替代方案，在文本和影像模式中都優於聯合 LoRA 方法，例如 FlexLoRA 和 FFA-LoRA。雖然隱私在 FL 論述中仍然至關重要，但我們的重點在於評估聯合微調模型的效能結果，並從理論和經驗的角度評估各種 FL 架構。我們的發現主張重新評估在 FL 背景中對 LoRA 的依賴，為更有效的訓練方法鋪路。", "author": "Navyansh Mahla et.al.", "authors": "Navyansh Mahla, Ganesh Ramakrishnan", "id": "2410.23111v2", "paper_url": "http://arxiv.org/abs/2410.23111v2", "repo": "null"}}