{"2412.15151": {"publish_time": "2024-12-19", "title": "Language Models as Continuous Self-Evolving Data Engineers", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities on\nvarious tasks, while the further evolvement is limited to the lack of\nhigh-quality training data. In addition, traditional training approaches rely\ntoo much on expert-labeled data, setting an upper limit on the performance of\nLLMs. To address this issue, we propose a novel paradigm that enables LLMs to\ntrain itself by autonomously generating, cleaning, reviewing, and annotating\ndata with preference information, named LANCE. Our approach demonstrates that\nLLMs can serve as continuous self-evolving data engineers, significantly\nreducing the time and cost of the post-training data construction process.\nThrough iterative fine-tuning on different variants of the Qwen2, we validate\nthe effectiveness of LANCE across various tasks, showing that it can\ncontinuously improve model performance and maintain high-quality data\ngeneration. Across eight benchmark dimensions, LANCE resulted in an average\nscore enhancement of 3.36 for Qwen2-7B and 2.70 for Qwen2-7B-Instruct. This\ntraining paradigm with autonomous data construction not only reduces the\nreliance on human experts or external models but also ensures that the data\naligns with human values and preferences, paving the way for the development of\nfuture superintelligent systems that can exceed human capabilities.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種任務中展現出卓越的能力，而進一步的演進則受到缺乏高品質訓練資料的限制。此外，傳統的訓練方法過度依賴專家標記的資料，為 LLM 的效能設定了上限。為了解決這個問題，我們提出了一個創新的範例，讓 LLM 能夠透過自主產生、清理、審閱和註解帶有偏好資訊的資料來訓練自己，稱為 LANCE。我們的做法證明了 LLM 可以作為持續自我演進的資料工程師，大幅減少訓練後資料建構程序的時間和成本。透過在 Qwen2 的不同變體上進行反覆微調，我們驗證了 LANCE 在各種任務中的有效性，顯示它可以持續改善模型效能並維持高品質的資料產生。在八個基準維度中，LANCE 讓 Qwen2-7B 的平均分數提升了 3.36，而 Qwen2-7B-Instruct 則提升了 2.70。這種具有自主資料建構的訓練範例不僅減少了對人類專家或外部模型的依賴，還能確保資料符合人類的價值觀和偏好，為開發未來能夠超越人類能力的超級智慧系統鋪路。", "author": "Peidong Wang et.al.", "authors": "Peidong Wang, Ming Wang, Zhiming Ma, Xiaocui Yang, Shi Feng, Daling Wang, Yifei Zhang", "id": "2412.15151v1", "paper_url": "http://arxiv.org/abs/2412.15151v1", "repo": "null"}}