{"2504.02807": {"publish_time": "2025-04-03", "title": "MegaMath: Pushing the Limits of Open Math Corpora", "paper_summary": "Mathematical reasoning is a cornerstone of human intelligence and a key\nbenchmark for advanced capabilities in large language models (LLMs). However,\nthe research community still lacks an open, large-scale, high-quality corpus\ntailored to the demands of math-centric LLM pre-training. We present MegaMath,\nan open dataset curated from diverse, math-focused sources through following\npractices: (1) Revisiting web data: We re-extracted mathematical documents from\nCommon Crawl with math-oriented HTML optimizations, fasttext-based filtering\nand deduplication, all for acquiring higher-quality data on the Internet. (2)\nRecalling Math-related code data: We identified high quality math-related code\nfrom large code training corpus, Stack-V2, further enhancing data diversity.\n(3) Exploring Synthetic data: We synthesized QA-style text, math-related code,\nand interleaved text-code blocks from web data or code data. By integrating\nthese strategies and validating their effectiveness through extensive\nablations, MegaMath delivers 371B tokens with the largest quantity and top\nquality among existing open math pre-training datasets.", "paper_summary_zh": "<paragraph>數學推理是人類智慧的基石，也是評估大型語言模型 (LLM) 高級能力的關鍵指標。然而，研究社群仍然缺乏一個開放、大規模、高質量的語料庫，以滿足以數學為中心的 LLM 預訓練的需求。我們提出了 MegaMath，一個透過以下實務做法，從各種以數學為中心的來源策劃的開放數據集：(1) 重新審視網路數據：我們使用面向數學的 HTML 優化、基於 fasttext 的過濾和去重複，從 Common Crawl 中重新提取數學文檔，所有這些都是為了在網路上獲取更高質量的數據。(2) 回顧與數學相關的程式碼數據：我們從大型程式碼訓練語料庫 Stack-V2 中識別出高質量的數學相關程式碼，進一步增強了數據的多樣性。(3) 探索合成數據：我們從網路數據或程式碼數據中合成了問答式文本、數學相關程式碼以及交錯的文本程式碼塊。透過整合這些策略，並透過大量的消融研究驗證其有效性，MegaMath 提供了 371B 個 token，在現有的開放數學預訓練數據集中數量最多，質量也最高。</paragraph>\n", "author": "Fan Zhou et.al.", "authors": "Fan Zhou, Zengzhi Wang, Nikhil Ranjan, Zhoujun Cheng, Liping Tang, Guowei He, Zhengzhong Liu, Eric P. Xing", "id": "2504.02807v1", "paper_url": "http://arxiv.org/abs/2504.02807v1", "repo": "null"}}