{"2410.21784": {"publish_time": "2024-10-29", "title": "MARCO: Multi-Agent Real-time Chat Orchestration", "paper_summary": "Large language model advancements have enabled the development of multi-agent\nframeworks to tackle complex, real-world problems such as to automate tasks\nthat require interactions with diverse tools, reasoning, and human\ncollaboration. We present MARCO, a Multi-Agent Real-time Chat Orchestration\nframework for automating tasks using LLMs. MARCO addresses key challenges in\nutilizing LLMs for complex, multi-step task execution. It incorporates robust\nguardrails to steer LLM behavior, validate outputs, and recover from errors\nthat stem from inconsistent output formatting, function and parameter\nhallucination, and lack of domain knowledge. Through extensive experiments we\ndemonstrate MARCO's superior performance with 94.48% and 92.74% accuracy on\ntask execution for Digital Restaurant Service Platform conversations and Retail\nconversations datasets respectively along with 44.91% improved latency and\n33.71% cost reduction. We also report effects of guardrails in performance gain\nalong with comparisons of various LLM models, both open-source and proprietary.\nThe modular and generic design of MARCO allows it to be adapted for automating\ntasks across domains and to execute complex usecases through multi-turn\ninteractions.", "paper_summary_zh": "大型語言模型的進展使得多代理架構的開發能夠解決複雜的現實世界問題，例如自動化需要與各種工具、推理和人類協作互動的任務。我們提出 MARCO，一個多代理即時聊天編排架構，用於使用 LLM 自動化任務。MARCO 解決了在複雜的多步驟任務執行中利用 LLM 的關鍵挑戰。它包含強大的護欄來引導 LLM 行為、驗證輸出並從由於輸出格式不一致、函數和參數幻覺以及缺乏領域知識而產生的錯誤中恢復。通過廣泛的實驗，我們證明了 MARCO 在數字餐廳服務平台對話和零售對話數據集上任務執行的準確率分別為 94.48% 和 92.74%，同時改進了 44.91% 的延遲並降低了 33.71% 的成本。我們還報告了護欄在性能提升中的影響，以及各種 LLM 模型（包括開源和專有模型）的比較。MARCO 的模組化和通用設計允許它適應跨領域的自動化任務，並通過多輪互動執行複雜的用例。", "author": "Anubhav Shrimal et.al.", "authors": "Anubhav Shrimal, Stanley Kanagaraj, Kriti Biswas, Swarnalatha Raghuraman, Anish Nediyanchath, Yi Zhang, Promod Yenigalla", "id": "2410.21784v1", "paper_url": "http://arxiv.org/abs/2410.21784v1", "repo": "null"}}