{"2409.10831": {"publish_time": "2024-09-17", "title": "PDMX: A Large-Scale Public Domain MusicXML Dataset for Symbolic Music Processing", "paper_summary": "The recent explosion of generative AI-Music systems has raised numerous\nconcerns over data copyright, licensing music from musicians, and the conflict\nbetween open-source AI and large prestige companies. Such issues highlight the\nneed for publicly available, copyright-free musical data, in which there is a\nlarge shortage, particularly for symbolic music data. To alleviate this issue,\nwe present PDMX: a large-scale open-source dataset of over 250K public domain\nMusicXML scores collected from the score-sharing forum MuseScore, making it the\nlargest available copyright-free symbolic music dataset to our knowledge. PDMX\nadditionally includes a wealth of both tag and user interaction metadata,\nallowing us to efficiently analyze the dataset and filter for high quality\nuser-generated scores. Given the additional metadata afforded by our data\ncollection process, we conduct multitrack music generation experiments\nevaluating how different representative subsets of PDMX lead to different\nbehaviors in downstream models, and how user-rating statistics can be used as\nan effective measure of data quality. Examples can be found at\nhttps://pnlong.github.io/PDMX.demo/.", "paper_summary_zh": "最近生成式 AI-Music 系统的爆炸性增长引起了许多关于数据版权、从音乐人处获得音乐许可以及开源 AI 与大型声望公司之间的冲突的担忧。此类问题凸显了对公开可用、无版权音乐数据的需求，而此类数据严重短缺，特别是符号音乐数据。为了缓解此问题，我们提出了 PDMX：一个从乐谱分享论坛 MuseScore 收集的超过 250K 公共领域 MusicXML 乐谱的大型开源数据集，使其成为我们所知最大的可用的无版权符号音乐数据集。此外，PDMX 还包含大量标签和用户交互元数据，使我们能够有效地分析数据集并筛选高质量的用户生成乐谱。鉴于我们的数据收集过程提供的附加元数据，我们进行了多轨音乐生成实验，评估 PDMX 的不同代表性子集如何导致下游模型中的不同行为，以及如何将用户评级统计数据用作数据质量的有效衡量标准。可以在 https://pnlong.github.io/PDMX.demo/ 中找到示例。", "author": "Phillip Long et.al.", "authors": "Phillip Long, Zachary Novack, Taylor Berg-Kirkpatrick, Julian McAuley", "id": "2409.10831v1", "paper_url": "http://arxiv.org/abs/2409.10831v1", "repo": "null"}}