{"2409.09173": {"publish_time": "2024-09-13", "title": "Phikon-v2, A large and public feature extractor for biomarker prediction", "paper_summary": "Gathering histopathology slides from over 100 publicly available cohorts, we\ncompile a diverse dataset of 460 million pathology tiles covering more than 30\ncancer sites. Using this dataset, we train a large self-supervised vision\ntransformer using DINOv2 and publicly release one iteration of this model for\nfurther experimentation, coined Phikon-v2. While trained on publicly available\nhistology slides, Phikon-v2 surpasses our previously released model (Phikon)\nand performs on par with other histopathology foundation models (FM) trained on\nproprietary data. Our benchmarks include eight slide-level tasks with results\nreported on external validation cohorts avoiding any data contamination between\npre-training and evaluation datasets. Our downstream training procedure follows\na simple yet robust ensembling strategy yielding a +1.75 AUC increase across\ntasks and models compared to one-shot retraining (p<0.001). We compare Phikon\n(ViT-B) and Phikon-v2 (ViT-L) against 14 different histology feature\nextractors, making our evaluation the most comprehensive to date. Our result\nsupport evidences that DINOv2 handles joint model and data scaling better than\niBOT. Also, we show that recent scaling efforts are overall beneficial to\ndownstream performance in the context of biomarker prediction with GigaPath and\nH-Optimus-0 (two ViT-g with 1.1B parameters each) standing out. However, the\nstatistical margins between the latest top-performing FMs remain mostly\nnon-significant; some even underperform on specific indications or tasks such\nas MSI prediction - deposed by a 13x smaller model developed internally. While\nlatest foundation models may exhibit limitations for clinical deployment, they\nnonetheless offer excellent grounds for the development of more specialized and\ncost-efficient histology encoders fueling AI-guided diagnostic tools.", "paper_summary_zh": "<paragraph>我們從 100 多個公開可用的群組中收集了組織病理學幻燈片，編制了一個包含 4.6 億個病理切片的不同資料集，涵蓋了 30 多個癌症部位。使用此資料集，我們使用 DINOv2 訓練了一個大型自監督視覺轉換器，並公開發布此模型的其中一個版本，以供進一步實驗，稱為 Phikon-v2。雖然在公開可用的組織切片上進行訓練，但 Phikon-v2 超越了我們先前發布的模型 (Phikon)，並且與在專有資料上訓練的其他組織病理學基礎模型 (FM) 效能相當。我們的基準包括八項幻燈片層級任務，其結果在外部驗證群組中報告，避免預訓練和評估資料集之間的任何資料污染。我們的下游訓練程序採用簡單但穩健的整體策略，與一次性重新訓練相比，任務和模型的 AUC 增加 +1.75（p<0.001）。我們將 Phikon (ViT-B) 和 Phikon-v2 (ViT-L) 與 14 種不同的組織病理學特徵萃取器進行比較，使我們的評估成為迄今為止最全面的評估。我們的結果支持證據表明，DINOv2 比 iBOT 更能處理聯合模型和資料縮放。此外，我們表明，在使用 GigaPath 和 H-Optimus-0（兩個具有 1.1B 參數的 ViT-g）進行生物標記預測的背景下，最近的縮放工作對下游效能整體有益。然而，最新效能最佳的 FM 之間的統計邊際大多仍然不顯著；有些甚至在特定適應症或任務（例如 MSI 預測）上表現不佳，被一個由內部開發的 13 倍較小模型所取代。雖然最新的基礎模型可能會對臨床部署造成限制，但它們仍然為開發更專業且更具成本效益的組織病理學編碼器提供了絕佳的基礎，以推動 AI 導向的診斷工具。</paragraph>", "author": "Alexandre Filiot et.al.", "authors": "Alexandre Filiot, Paul Jacob, Alice Mac Kain, Charlie Saillard", "id": "2409.09173v1", "paper_url": "http://arxiv.org/abs/2409.09173v1", "repo": "null"}}