{"2501.06827": {"publish_time": "2025-01-12", "title": "Leveraging Taxonomy and LLMs for Improved Multimodal Hierarchical Classification", "paper_summary": "Multi-level Hierarchical Classification (MLHC) tackles the challenge of\ncategorizing items within a complex, multi-layered class structure. However,\ntraditional MLHC classifiers often rely on a backbone model with independent\noutput layers, which tend to ignore the hierarchical relationships between\nclasses. This oversight can lead to inconsistent predictions that violate the\nunderlying taxonomy. Leveraging Large Language Models (LLMs), we propose a\nnovel taxonomy-embedded transitional LLM-agnostic framework for multimodality\nclassification. The cornerstone of this advancement is the ability of models to\nenforce consistency across hierarchical levels. Our evaluations on the MEP-3M\ndataset - a multi-modal e-commerce product dataset with various hierarchical\nlevels - demonstrated a significant performance improvement compared to\nconventional LLM structures.", "paper_summary_zh": "多層級階層分類 (MLHC) 應對了在複雜、多層級類別結構中對項目進行分類的挑戰。然而，傳統的 MLHC 分類器通常依賴於具有獨立輸出層的主幹模型，這往往會忽略類別之間的階層關係。這種疏忽可能導致不一致的預測，從而違反底層分類法。利用大型語言模型 (LLM)，我們提出了一個新穎的分類嵌入過渡式 LLM 不可知框架，用於多模態分類。這一進步的基石在於模型在階層級別間執行一致性的能力。我們對 MEP-3M 資料集（一個具有多種階層級別的多模態電子商務產品資料集）的評估表明，與傳統 LLM 結構相比，其性能有了顯著提升。", "author": "Shijing Chen et.al.", "authors": "Shijing Chen, Mohamed Reda Bouadjenek, Shoaib Jameel, Usman Naseem, Basem Suleiman, Flora D. Salim, Hakim Hacid, Imran Razzak", "id": "2501.06827v1", "paper_url": "http://arxiv.org/abs/2501.06827v1", "repo": "null"}}