{"2409.11500": {"publish_time": "2024-09-17", "title": "Multi-Document Grounded Multi-Turn Synthetic Dialog Generation", "paper_summary": "We introduce a technique for multi-document grounded multi-turn synthetic\ndialog generation that incorporates three main ideas. First, we control the\noverall dialog flow using taxonomy-driven user queries that are generated with\nChain-of-Thought (CoT) prompting. Second, we support the generation of\nmulti-document grounded dialogs by mimicking real-world use of retrievers to\nupdate the grounding documents after every user-turn in the dialog. Third, we\napply LLM-as-a-Judge to filter out queries with incorrect answers. Human\nevaluation of the synthetic dialog data suggests that the data is diverse,\ncoherent, and includes mostly correct answers. Both human and automatic\nevaluations of answerable queries indicate that models fine-tuned on synthetic\ndialogs consistently out-perform those fine-tuned on existing human generated\ntraining data across four publicly available multi-turn document grounded\nbenchmark test sets.", "paper_summary_zh": "我們提出了一種多文件接地式多輪合成對話生成技術，它包含三個主要想法。首先，我們使用鏈式思考 (CoT) 提示生成的分類驅動使用者查詢來控制整體對話流程。其次，我們支援多文件接地式對話的生成，方法是模擬檢索器的實際使用，以便在對話中每次使用者輪流發言後更新接地文件。第三，我們應用 LLM 作為判斷者來篩選出答案不正確的查詢。對合成對話數據的人工評估表明，這些數據多樣化、連貫，且包含大多數正確答案。可回答查詢的人工和自動評估表明，在合成對話中微調的模型在四個公開的多輪文件接地式基準測試集中，始終優於在現有人類生成的訓練數據中微調的模型。", "author": "Young-Suk Lee et.al.", "authors": "Young-Suk Lee, Chulaka Gunasekara, Danish Contractor, Ramón Fernandez Astudillo, Radu Florian", "id": "2409.11500v1", "paper_url": "http://arxiv.org/abs/2409.11500v1", "repo": "null"}}