{"2501.05952": {"publish_time": "2025-01-10", "title": "Scalable Vision Language Model Training via High Quality Data Curation", "paper_summary": "In this paper, we introduce SAIL-VL (ScAlable Vision Language Model TraIning\nvia High QuaLity Data Curation), an open-source vision language model (VLM) of\nstate-of-the-art (SOTA) performance with 2B parameters. We introduce three key\nimprovements that contribute to SAIL-VL's leading performance: (1) Scalable\nhigh-quality visual understanding data construction: We implement a visual\nunderstanding data construction pipeline, which enables hundred-million-scale\nhigh-quality recaption data annotation. Equipped with this pipeline, we curate\nSAIL-Caption, a large-scale caption dataset with large quantity and the highest\ndata quality compared with opensource caption datasets. (2) Scalable\nPretraining with High-Quality Visual Understanding Data: We scale SAIL-VL's\npretraining budget up to 131B tokens and show that even a 2B VLM benefits from\nscaled up training data sizes, exhibiting expected data size scaling laws in\nvisual understanding and instruction following performance. (3) Scalable SFT\nvia quantity and quality scaling: We introduce general guidance for instruction\ndata curation to scale up instruction data continuously, allowing us to\nconstruct a large SFT dataset with the highest quality. To further improve\nSAIL-VL's performance, we propose quality scaling, a multi-stage training\nrecipe with curriculum learning, to improve model performance scaling curves\nw.r.t. data sizes from logarithmic to be near-linear. SAIL-VL obtains the\nhighest average score in 19 commonly used benchmarks in our evaluation and\nachieves top1 performance among VLMs of comparable sizes on OpenCompass\n(https://rank.opencompass.org.cn/leaderboard-multimodal). We release our\nSAIL-VL-2B model at HuggingFace\n(https://huggingface.co/BytedanceDouyinContent/SAIL-VL-2B).", "paper_summary_zh": "<paragraph>在本文中，我們介紹了 SAIL-VL（通過高品質數據策展進行可擴展的視覺語言模型訓練），這是一個具有 2B 參數的最新技術 (SOTA) 性能的開源視覺語言模型 (VLM)。我們介紹了有助於 SAIL-VL 領先性能的三項關鍵改進：(1) 可擴展的高品質視覺理解數據構建：我們實作了一個視覺理解數據構建管道，可以進行億級規模的高品質重新標題數據註解。利用這個管道，我們策劃了 SAIL-Caption，這是一個與開源標題數據集相比，數量龐大且數據品質最高的大規模標題數據集。(2) 使用高品質視覺理解數據進行可擴展預訓練：我們將 SAIL-VL 的預訓練預算擴展到 131B 個符號，並顯示即使是 2B VLM 也能從擴展的訓練數據規模中受益，在視覺理解和指令遵循性能方面表現出預期的數據規模擴展定律。(3) 通過數量和品質擴展的可擴展 SFT：我們為指令數據策展引入了通用指導，以持續擴展指令數據，讓我們能夠構建一個品質最高的 SFT 數據集。為了進一步提升 SAIL-VL 的性能，我們提出了品質擴展，一種具有課程學習的多階段訓練配方，以改善模型性能擴展曲線，從對數到接近線性，相對於數據規模。SAIL-VL 在我們的評估中獲得了 19 個常用基準測試中的最高平均分，並在 OpenCompass（https://rank.opencompass.org.cn/leaderboard-multimodal）上取得了與同等規模的 VLM 相比的頂尖性能。我們在 HuggingFace（https://huggingface.co/BytedanceDouyinContent/SAIL-VL-2B）上發布了我們的 SAIL-VL-2B 模型。</paragraph>", "author": "Hongyuan Dong et.al.", "authors": "Hongyuan Dong, Zijian Kang, Weijie Yin, Xiao Liang, Chao Feng, Jiao Ran", "id": "2501.05952v1", "paper_url": "http://arxiv.org/abs/2501.05952v1", "repo": "null"}}