{"2407.12206": {"publish_time": "2024-07-16", "title": "A Language Modeling Approach to Diacritic-Free Hebrew TTS", "paper_summary": "We tackle the task of text-to-speech (TTS) in Hebrew. Traditional Hebrew\ncontains Diacritics, which dictate the way individuals should pronounce given\nwords, however, modern Hebrew rarely uses them. The lack of diacritics in\nmodern Hebrew results in readers expected to conclude the correct pronunciation\nand understand which phonemes to use based on the context. This imposes a\nfundamental challenge on TTS systems to accurately map between text-to-speech.\nIn this work, we propose to adopt a language modeling Diacritics-Free approach,\nfor the task of Hebrew TTS. The model operates on discrete speech\nrepresentations and is conditioned on a word-piece tokenizer. We optimize the\nproposed method using in-the-wild weakly supervised data and compare it to\nseveral diacritic-based TTS systems. Results suggest the proposed method is\nsuperior to the evaluated baselines considering both content preservation and\nnaturalness of the generated speech. Samples can be found under the following\nlink: pages.cs.huji.ac.il/adiyoss-lab/HebTTS/", "paper_summary_zh": "我們處理希伯來語的文字轉語音 (TTS) 任務。傳統希伯來語包含變音符號，用來指示個人應該如何發音給定的字詞，然而，現代希伯來語很少使用它們。現代希伯來語中缺少變音符號導致讀者必須根據上下文推論正確的發音並了解應使用的音素。這對 TTS 系統準確地對應文字轉語音提出了根本性的挑戰。在這項工作中，我們建議採用一種無變音符號的語言建模方法來執行希伯來語 TTS 的任務。該模型運作於離散的語音表示，並以字詞切換器為條件。我們使用自然界中的弱監督數據最佳化建議的方法，並將其與多個基於變音符號的 TTS 系統進行比較。結果表明，建議的方法在考慮所產生語音的內容保留和自然性方面都優於評估的基準。範例可以在以下連結中找到：pages.cs.huji.ac.il/adiyoss-lab/HebTTS/", "author": "Amit Roth et.al.", "authors": "Amit Roth, Arnon Turetzky, Yossi Adi", "id": "2407.12206v1", "paper_url": "http://arxiv.org/abs/2407.12206v1", "repo": "null"}}