{"2502.02797": {"publish_time": "2025-02-05", "title": "Upweighting Easy Samples in Fine-Tuning Mitigates Forgetting", "paper_summary": "Fine-tuning a pre-trained model on a downstream task often degrades its\noriginal capabilities, a phenomenon known as \"catastrophic forgetting\". This is\nespecially an issue when one does not have access to the data and recipe used\nto develop the pre-trained model. Under this constraint, most existing methods\nfor mitigating forgetting are inapplicable. To address this challenge, we\npropose a sample weighting scheme for the fine-tuning data solely based on the\npre-trained model's losses. Specifically, we upweight the easy samples on which\nthe pre-trained model's loss is low and vice versa to limit the drift from the\npre-trained model. Our approach is orthogonal and yet complementary to existing\nmethods; while such methods mostly operate on parameter or gradient space, we\nconcentrate on the sample space. We theoretically analyze the impact of\nfine-tuning with our method in a linear setting, showing that it stalls\nlearning in a certain subspace which inhibits overfitting to the target task.\nWe empirically demonstrate the efficacy of our method on both language and\nvision tasks. As an example, when fine-tuning Gemma 2 2B on MetaMathQA, our\nmethod results in only a $0.8\\%$ drop in accuracy on GSM8K (another math\ndataset) compared to standard fine-tuning, while preserving $5.4\\%$ more\naccuracy on the pre-training datasets. Our code is publicly available at\nhttps://github.com/sanyalsunny111/FLOW_finetuning .", "paper_summary_zh": "<paragraph>微調預訓練模型於下游任務時，通常會降低其原始功能，此現象稱為「災難性遺忘」。當無法取得用於開發預訓練模型的資料和配方時，這尤其會成為一個問題。在此限制下，大多數現有減輕遺忘的方法都無法適用。為了應對此挑戰，我們提出一個樣本加權方案，用於微調資料，僅基於預訓練模型的損失。具體來說，我們會對預訓練模型損失較低的容易樣本進行加權，反之亦然，以限制與預訓練模型的偏差。我們的做法與現有方法正交且互補；雖然這些方法大多在參數或梯度空間中運作，但我們專注於樣本空間。我們在線性設定中理論分析微調我們方法的影響，表明它會在某個子空間中停止學習，從而抑制對目標任務的過度擬合。我們在語言和視覺任務中實證展示了我們方法的功效。舉例來說，當在 MetaMathQA 上微調 Gemma 2 2B 時，與標準微調相比，我們的做法僅導致 GSM8K（另一個數學資料集）的準確度下降 $0.8\\%$，同時在預訓練資料集上保留了 $5.4\\%$ 的準確度。我們的程式碼已公開於 https://github.com/sanyalsunny111/FLOW_finetuning。</paragraph>", "author": "Sunny Sanyal et.al.", "authors": "Sunny Sanyal, Hayden Prairie, Rudrajit Das, Ali Kavis, Sujay Sanghavi", "id": "2502.02797v1", "paper_url": "http://arxiv.org/abs/2502.02797v1", "repo": "null"}}