{"2502.02040": {"publish_time": "2025-02-04", "title": "M2R2: Mixture of Multi-Rate Residuals for Efficient Transformer Inference", "paper_summary": "Residual transformations enhance the representational depth and expressive\npower of large language models (LLMs). However, applying static residual\ntransformations across all tokens in auto-regressive generation leads to a\nsuboptimal trade-off between inference efficiency and generation fidelity.\nExisting methods, including Early Exiting, Skip Decoding, and Mixture-of-Depth\naddress this by modulating the residual transformation based on token-level\ncomplexity. Nevertheless, these approaches predominantly consider the distance\ntraversed by tokens through the model layers, neglecting the underlying\nvelocity of residual evolution. We introduce Mixture of Multi-rate Residuals\n(M2R2), a framework that dynamically modulates residual velocity to improve\nearly alignment, enhancing inference efficiency. Evaluations on reasoning\noriented tasks such as Koala, Self-Instruct, WizardLM, and MT-Bench show M2R2\nsurpasses state-of-the-art distance-based strategies, balancing generation\nquality and speedup. In self-speculative decoding setup, M2R2 achieves up to\n2.8x speedups on MT-Bench, outperforming methods like 2-model speculative\ndecoding, Medusa, LookAhead Decoding, and DEED. In Mixture-of-Experts (MoE)\narchitectures, integrating early residual alignment with ahead-of-time expert\nloading into high-bandwidth memory (HBM) accelerates decoding, reduces\nexpert-switching bottlenecks, and achieves a 2.9x speedup, making it highly\neffective in resource-constrained environments.", "paper_summary_zh": "殘差轉換增強了大型語言模型 (LLM) 的表徵深度和表達能力。然而，在自迴歸生成中對所有符號應用靜態殘差轉換會導致推理效率和生成保真度之間的權衡不佳。現有方法，包括早期退出、跳過解碼和混合深度，通過根據符號層級複雜度調節殘差轉換來解決此問題。儘管如此，這些方法主要考慮符號通過模型層所跨越的距離，而忽略了殘差演化的基本速度。我們引入了多速率殘差混合 (M2R2)，這是一個動態調節殘差速度的框架，以改善早期對齊，增強推理效率。在面向推理的任務（例如 Koala、Self-Instruct、WizardLM 和 MT-Bench）上的評估表明，M2R2 超越了最先進的基於距離的策略，平衡了生成品質和加速。在自推測解碼設置中，M2R2 在 MT-Bench 上實現了高達 2.8 倍的加速，優於 2 模型推測解碼、Medusa、LookAhead 解碼和 DEED 等方法。在混合專家 (MoE) 架構中，將早期殘差對齊與預先專家載入到高頻寬記憶體 (HBM) 中整合，可加速解碼，減少專家切換瓶頸，並實現 2.9 倍的加速，使其在資源受限的環境中非常有效。", "author": "Nikhil Bhendawade et.al.", "authors": "Nikhil Bhendawade, Mahyar Najibi, Devang Naik, Irina Belousova", "id": "2502.02040v1", "paper_url": "http://arxiv.org/abs/2502.02040v1", "repo": "null"}}