{"2405.11865": {"publish_time": "2024-05-20", "title": "CoNLL#: Fine-grained Error Analysis and a Corrected Test Set for CoNLL-03 English", "paper_summary": "Modern named entity recognition systems have steadily improved performance in\nthe age of larger and more powerful neural models. However, over the past\nseveral years, the state-of-the-art has seemingly hit another plateau on the\nbenchmark CoNLL-03 English dataset. In this paper, we perform a deep dive into\nthe test outputs of the highest-performing NER models, conducting a\nfine-grained evaluation of their performance by introducing new document-level\nannotations on the test set. We go beyond F1 scores by categorizing errors in\norder to interpret the true state of the art for NER and guide future work. We\nreview previous attempts at correcting the various flaws of the test set and\nintroduce CoNLL#, a new corrected version of the test set that addresses its\nsystematic and most prevalent errors, allowing for low-noise, interpretable\nerror analysis.", "paper_summary_zh": "現代命名實體辨識系統在大型且更強大的神經模型時代，其效能穩步提升。然而，在過去幾年，最先進的技術似乎在基準 CoNLL-03 英語資料集上又遇到了另一個停滯期。在本文中，我們深入探討效能最高的 NER 模型的測試輸出，並透過在測試集上引入新的文件層級註解，對其效能進行細緻的評估。我們超越 F1 分數，透過分類錯誤來詮釋 NER 的最新真實狀態，並引導後續的工作。我們檢視先前修正測試集各種缺陷的嘗試，並提出 CoNLL#，這是測試集的一個新的修正版本，它解決了測試集的系統性和最普遍的錯誤，允許進行低雜訊且可詮釋的錯誤分析。", "author": "Andrew Rueda et.al.", "authors": "Andrew Rueda, Elena Álvarez Mellado, Constantine Lignos", "id": "2405.11865v1", "paper_url": "http://arxiv.org/abs/2405.11865v1", "repo": "null"}}