{"2405.15792": {"publish_time": "2024-05-04", "title": "IQLS: Framework for leveraging Metadata to enable Large Language Model based queries to complex, versatile Data", "paper_summary": "As the amount and complexity of data grows, retrieving it has become a more\ndifficult task that requires greater knowledge and resources. This is\nespecially true for the logistics industry, where new technologies for data\ncollection provide tremendous amounts of interconnected real-time data. The\nIntelligent Query and Learning System (IQLS) simplifies the process by allowing\nnatural language use to simplify data retrieval . It maps structured data into\na framework based on the available metadata and available data models. This\nframework creates an environment for an agent powered by a Large Language\nModel. The agent utilizes the hierarchical nature of the data to filter\niteratively by making multiple small context-aware decisions instead of\none-shot data retrieval. After the Data filtering, the IQLS enables the agent\nto fulfill tasks given by the user query through interfaces. These interfaces\nrange from multimodal transportation information retrieval to route planning\nunder multiple constraints. The latter lets the agent define a dynamic object,\nwhich is determined based on the query parameters. This object represents a\ndriver capable of navigating a road network. The road network is depicted as a\ngraph with attributes based on the data. Using a modified version of the\nDijkstra algorithm, the optimal route under the given constraints can be\ndetermined. Throughout the entire process, the user maintains the ability to\ninteract and guide the system. The IQLS is showcased in a case study on the\nCanadian logistics sector, allowing geospatial, visual, tabular and text data\nto be easily queried semantically in natural language.", "paper_summary_zh": "随着数据量和复杂性不断增加，检索数据已成为一项更困难的任务，需要更多的知识和资源。对于物流行业来说尤其如此，该行业用于数据收集的新技术提供了大量相互关联的实时数据。智能查询和学习系统 (IQLS) 通过允许使用自然语言来简化数据检索，从而简化了这一过程。它将结构化数据映射到基于可用元数据和可用数据模型的框架中。此框架为由大型语言模型提供支持的代理创建了一个环境。该代理利用数据的层次结构通过多次进行小的上下文感知决策而不是一次性数据检索来进行迭代过滤。在数据过滤之后，IQLS 使代理能够通过界面完成用户查询给定的任务。这些界面范围从多模式交通信息检索到在多重约束下的路线规划。后者让代理能够定义一个动态对象，该对象根据查询参数确定。此对象表示能够在道路网络中导航的驾驶员。道路网络被描述为具有基于数据的属性的图表。使用 Dijkstra 算法的修改版本，可以在给定约束下确定最佳路线。在整个过程中，用户始终能够与系统交互并指导系统。IQLS 在加拿大物流部门的案例研究中得到展示，允许在地理空间、视觉、表格和文本数据中使用自然语言轻松地进行语义查询。", "author": "Sami Azirar et.al.", "authors": "Sami Azirar, Hossam A. Gabbar, Chaouki Regoui", "id": "2405.15792v1", "paper_url": "http://arxiv.org/abs/2405.15792v1", "repo": "null"}}