{"2408.07461": {"publish_time": "2024-08-14", "title": "Problem Solving Through Human-AI Preference-Based Cooperation", "paper_summary": "While there is a widespread belief that artificial general intelligence (AGI)\n-- or even superhuman AI -- is imminent, complex problems in expert domains are\nfar from being solved. We argue that such problems require human-AI cooperation\nand that the current state of the art in generative AI is unable to play the\nrole of a reliable partner due to a multitude of shortcomings, including\ninability to keep track of a complex solution artifact (e.g., a software\nprogram), limited support for versatile human preference expression and lack of\nadapting to human preference in an interactive setting. To address these\nchallenges, we propose HAI-Co2, a novel human-AI co-construction framework. We\nformalize HAI-Co2 and discuss the difficult open research problems that it\nfaces. Finally, we present a case study of HAI-Co2 and demonstrate its efficacy\ncompared to monolithic generative AI models.", "paper_summary_zh": "儘管普遍相信人工通用智慧（AGI）\n-- 甚至是超人類 AI -- 即將到來，但專家領域中的複雜問題\n遠遠沒有解決。我們認為此類問題需要人類與 AI 合作，而\n生成式 AI 的現有技術狀態無法扮演\n可靠合作夥伴的角色，原因在於存在許多缺點，包括\n無法追蹤複雜的解決方案產出（例如軟體\n程式）、對多樣化人類偏好表達的支援有限，以及在互動設定中\n無法適應人類偏好。為了應對這些\n挑戰，我們提出 HAI-Co2，一個新穎的人類與 AI 共同建構架構。我們\n將 HAI-Co2 形式化，並討論其面臨的困難開放式研究問題。最後，我們\n提出 HAI-Co2 的案例研究，並展示其與單一生成式 AI 模型相比的效能。", "author": "Subhabrata Dutta et.al.", "authors": "Subhabrata Dutta, Timo Kaufmann, Goran Glavaš, Ivan Habernal, Kristian Kersting, Frauke Kreuter, Mira Mezini, Iryna Gurevych, Eyke Hüllermeier, Hinrich Schuetze", "id": "2408.07461v1", "paper_url": "http://arxiv.org/abs/2408.07461v1", "repo": "null"}}