{"2406.19770": {"publish_time": "2024-06-28", "title": "Self-Supervised Spatial-Temporal Normality Learning for Time Series Anomaly Detection", "paper_summary": "Time Series Anomaly Detection (TSAD) finds widespread applications across\nvarious domains such as financial markets, industrial production, and\nhealthcare. Its primary objective is to learn the normal patterns of time\nseries data, thereby identifying deviations in test samples. Most existing TSAD\nmethods focus on modeling data from the temporal dimension, while ignoring the\nsemantic information in the spatial dimension. To address this issue, we\nintroduce a novel approach, called Spatial-Temporal Normality learning (STEN).\nSTEN is composed of a sequence Order prediction-based Temporal Normality\nlearning (OTN) module that captures the temporal correlations within sequences,\nand a Distance prediction-based Spatial Normality learning (DSN) module that\nlearns the relative spatial relations between sequences in a feature space. By\nsynthesizing these two modules, STEN learns expressive spatial-temporal\nrepresentations for the normal patterns hidden in the time series data.\nExtensive experiments on five popular TSAD benchmarks show that STEN\nsubstantially outperforms state-of-the-art competing methods. Our code is\navailable at https://github.com/mala-lab/STEN.", "paper_summary_zh": "時間序列異常偵測 (TSAD) 在金融市場、工業生產和醫療保健等各種領域中廣泛應用。其主要目的是學習時間序列資料的正常模式，從而識別測試樣本中的偏差。現有的 TSAD 方法大多專注於對時間維度資料進行建模，而忽略了空間維度中的語義資訊。為了解決這個問題，我們提出了一種新的方法，稱為時空常態學習 (STEN)。STEN 由一個基於序列順序預測的時間常態學習 (OTN) 模組組成，它擷取序列中的時間相關性，以及一個基於距離預測的空間常態學習 (DSN) 模組，它學習特徵空間中序列之間的相對空間關係。通過綜合這兩個模組，STEN 學習時間序列資料中隱藏的正常模式的表現性時空表示。在五個流行的 TSAD 基準上進行的廣泛實驗表明，STEN 大幅優於最先進的競爭方法。我們的程式碼可在 https://github.com/mala-lab/STEN 取得。", "author": "Yutong Chen et.al.", "authors": "Yutong Chen, Hongzuo Xu, Guansong Pang, Hezhe Qiao, Yuan Zhou, Mingsheng Shang", "id": "2406.19770v1", "paper_url": "http://arxiv.org/abs/2406.19770v1", "repo": "null"}}