{"2406.02893": {"publish_time": "2024-06-05", "title": "Language Model Can Do Knowledge Tracing: Simple but Effective Method to Integrate Language Model and Knowledge Tracing Task", "paper_summary": "Knowledge Tracing (KT) is a critical task in online learning for modeling\nstudent knowledge over time. Despite the success of deep learning-based KT\nmodels, which rely on sequences of numbers as data, most existing approaches\nfail to leverage the rich semantic information in the text of questions and\nconcepts. This paper proposes Language model-based Knowledge Tracing (LKT), a\nnovel framework that integrates pre-trained language models (PLMs) with KT\nmethods. By leveraging the power of language models to capture semantic\nrepresentations, LKT effectively incorporates textual information and\nsignificantly outperforms previous KT models on large benchmark datasets.\nMoreover, we demonstrate that LKT can effectively address the cold-start\nproblem in KT by leveraging the semantic knowledge captured by PLMs.\nInterpretability of LKT is enhanced compared to traditional KT models due to\nits use of text-rich data. We conducted the local interpretable model-agnostic\nexplanation technique and analysis of attention scores to interpret the model\nperformance further. Our work highlights the potential of integrating PLMs with\nKT and paves the way for future research in KT domain.", "paper_summary_zh": "知識追蹤 (KT) 是線上學習中一項重要的任務，用於建模學生的知識。儘管基於深度學習的 KT 模型很成功，這些模型依賴於數字序列作為資料，但現有的大部分方法都無法利用問題和概念文字中的豐富語意資訊。本文提出基於語言模型的知識追蹤 (LKT)，一個將預先訓練好的語言模型 (PLM) 與 KT 方法整合起來的新穎架構。透過利用語言模型擷取語意表徵的能力，LKT 有效地納入了文字資訊，並且在大型基準資料集上明顯優於先前的 KT 模型。此外，我們證明 LKT 可以透過利用 PLM 擷取的語意知識，有效地解決 KT 中的冷啟動問題。由於 LKT 使用了豐富文字的資料，因此與傳統的 KT 模型相比，其可解釋性得到了增強。我們執行了局部可解釋模型不可知解釋技術和注意力分數分析，以進一步解釋模型效能。我們的研究重點在於整合 PLM 與 KT 的潛力，並為 KT 領域的未來研究鋪路。", "author": "Unggi Lee et.al.", "authors": "Unggi Lee, Jiyeong Bae, Dohee Kim, Sookbun Lee, Jaekwon Park, Taekyung Ahn, Gunho Lee, Damji Stratton, Hyeoncheol Kim", "id": "2406.02893v1", "paper_url": "http://arxiv.org/abs/2406.02893v1", "repo": "null"}}