{"2407.18145": {"publish_time": "2024-07-25", "title": "Taxonomy-Aware Continual Semantic Segmentation in Hyperbolic Spaces for Open-World Perception", "paper_summary": "Semantic segmentation models are typically trained on a fixed set of classes,\nlimiting their applicability in open-world scenarios. Class-incremental\nsemantic segmentation aims to update models with emerging new classes while\npreventing catastrophic forgetting of previously learned ones. However,\nexisting methods impose strict rigidity on old classes, reducing their\neffectiveness in learning new incremental classes. In this work, we propose\nTaxonomy-Oriented Poincar\\'e-regularized Incremental-Class Segmentation\n(TOPICS) that learns feature embeddings in hyperbolic space following explicit\ntaxonomy-tree structures. This supervision provides plasticity for old classes,\nupdating ancestors based on new classes while integrating new classes at\nfitting positions. Additionally, we maintain implicit class relational\nconstraints on the geometric basis of the Poincar\\'e ball. This ensures that\nthe latent space can continuously adapt to new constraints while maintaining a\nrobust structure to combat catastrophic forgetting. We also establish eight\nrealistic incremental learning protocols for autonomous driving scenarios,\nwhere novel classes can originate from known classes or the background.\nExtensive evaluations of TOPICS on the Cityscapes and Mapillary Vistas 2.0\nbenchmarks demonstrate that it achieves state-of-the-art performance. We make\nthe code and trained models publicly available at\nhttp://topics.cs.uni-freiburg.de.", "paper_summary_zh": "語意分割模型通常在固定的類別集合上訓練，\n限制了它們在開放世界場景中的適用性。類別遞增\n語意分割旨在使用新出現的類別更新模型，同時\n防止災難性地遺忘先前學習的類別。然而，\n現有方法對舊類別施加嚴格的剛性，降低了它們\n學習新遞增類別的有效性。在這項工作中，我們提出\n面向分類學的龐加萊正則化遞增類別分割 (TOPICS)，它在雙曲空間中學習特徵嵌入，遵循明確的\n分類樹結構。這種監督為舊類別提供可塑性，\n在適當的位置整合新類別的同時，基於新類別更新祖先。此外，我們在龐加萊球的幾何基礎上維持隱式類別關係約束。這確保了\n潛在空間可以持續適應新約束，同時維持穩固的結構以對抗災難性遺忘。我們還為自動駕駛場景建立了八個\n現實的遞增學習協定，其中新類別可以源自已知類別或背景。\n在 Cityscapes 和 Mapillary Vistas 2.0 上對 TOPICS 的廣泛評估\n基準證明它達到了最先進的效能。我們將\n程式碼和訓練好的模型公開於\nhttp://topics.cs.uni-freiburg.de。", "author": "Julia Hindel et.al.", "authors": "Julia Hindel, Daniele Cattaneo, Abhinav Valada", "id": "2407.18145v1", "paper_url": "http://arxiv.org/abs/2407.18145v1", "repo": "null"}}