{"2407.13431": {"publish_time": "2024-07-18", "title": "Improving Out-of-Distribution Generalization of Trajectory Prediction for Autonomous Driving via Polynomial Representations", "paper_summary": "Robustness against Out-of-Distribution (OoD) samples is a key performance\nindicator of a trajectory prediction model. However, the development and\nranking of state-of-the-art (SotA) models are driven by their In-Distribution\n(ID) performance on individual competition datasets. We present an OoD testing\nprotocol that homogenizes datasets and prediction tasks across two large-scale\nmotion datasets. We introduce a novel prediction algorithm based on polynomial\nrepresentations for agent trajectory and road geometry on both the input and\noutput sides of the model. With a much smaller model size, training effort, and\ninference time, we reach near SotA performance for ID testing and significantly\nimprove robustness in OoD testing. Within our OoD testing protocol, we further\nstudy two augmentation strategies of SotA models and their effects on model\ngeneralization. Highlighting the contrast between ID and OoD performance, we\nsuggest adding OoD testing to the evaluation criteria of trajectory prediction\nmodels.", "paper_summary_zh": "對抗分布外 (OoD) 範例的穩健性是軌跡預測模型的關鍵效能指標。然而，最先進 (SotA) 模型的開發和排名是由其在個別競賽資料集上的分布內 (ID) 效能所驅動的。我們提出一個 OoD 測試協定，用於將資料集和預測任務同質化，並涵蓋兩個大型運動資料集。我們引入一種新穎的預測演算法，其基礎是模型輸入和輸出兩側的代理軌跡和道路幾何的二次方程式表示法。透過大幅縮小模型大小、訓練工作量和推論時間，我們在 ID 測試中達到接近 SotA 的效能，並在 OoD 測試中大幅提升穩健性。在我們的 OoD 測試協定中，我們進一步研究 SotA 模型的兩種擴充策略及其對模型泛化的影響。我們強調 ID 和 OoD 效能之間的對比，建議將 OoD 測試新增到軌跡預測模型的評量準則中。", "author": "Yue Yao et.al.", "authors": "Yue Yao, Shengchao Yan, Daniel Goehring, Wolfram Burgard, Joerg Reichardt", "id": "2407.13431v1", "paper_url": "http://arxiv.org/abs/2407.13431v1", "repo": "null"}}