{"2405.20204": {"publish_time": "2024-05-30", "title": "Jina CLIP: Your CLIP Model Is Also Your Text Retriever", "paper_summary": "Contrastive Language-Image Pretraining (CLIP) is widely used to train models\nto align images and texts in a common embedding space by mapping them to\nfixed-sized vectors. These models are key to multimodal information retrieval\nand related tasks. However, CLIP models generally underperform in text-only\ntasks compared to specialized text models. This creates inefficiencies for\ninformation retrieval systems that keep separate embeddings and models for\ntext-only and multimodal tasks. We propose a novel, multi-task contrastive\ntraining method to address this issue, which we use to train the jina-clip-v1\nmodel to achieve the state-of-the-art performance on both text-image and\ntext-text retrieval tasks.", "paper_summary_zh": "對比語言圖像預訓練 (CLIP) 廣泛用於訓練模型，藉由將圖像和文字對應到固定大小的向量，將它們對齊在共同的嵌入空間中。這些模型是多模態資訊檢索和相關任務的關鍵。然而，與專門的文字模型相比，CLIP 模型在純文字任務中的表現通常較差。這會造成資訊檢索系統的低效率，因為它們為純文字和多模態任務保留了獨立的嵌入和模型。我們提出了一種新穎的多任務對比訓練方法來解決這個問題，我們使用它來訓練 jina-clip-v1 模型，以在文字圖像和文字文字檢索任務中達到最先進的效能。", "author": "Andreas Koukounas et.al.", "authors": "Andreas Koukounas, Georgios Mastrapas, Michael Günther, Bo Wang, Scott Martens, Isabelle Mohr, Saba Sturua, Mohammad Kalim Akram, Joan Fontanals Martínez, Saahil Ognawala, Susana Guzman, Maximilian Werk, Nan Wang, Han Xiao", "id": "2405.20204v1", "paper_url": "http://arxiv.org/abs/2405.20204v1", "repo": "null"}}