{"2407.06309": {"publish_time": "2024-07-08", "title": "Multimodal Chain-of-Thought Reasoning via ChatGPT to Protect Children from Age-Inappropriate Apps", "paper_summary": "Mobile applications (Apps) could expose children to inappropriate themes such\nas sexual content, violence, and drug use. Maturity rating offers a quick and\neffective method for potential users, particularly guardians, to assess the\nmaturity levels of apps. Determining accurate maturity ratings for mobile apps\nis essential to protect children's health in today's saturated digital\nmarketplace. Existing approaches to maturity rating are either inaccurate\n(e.g., self-reported rating by developers) or costly (e.g., manual\nexamination). In the literature, there are few text-mining-based approaches to\nmaturity rating. However, each app typically involves multiple modalities,\nnamely app description in the text, and screenshots in the image. In this\npaper, we present a framework for determining app maturity levels that utilize\nmultimodal large language models (MLLMs), specifically ChatGPT-4 Vision.\nPowered by Chain-of-Thought (CoT) reasoning, our framework systematically\nleverages ChatGPT-4 to process multimodal app data (i.e., textual descriptions\nand screenshots) and guide the MLLM model through a step-by-step reasoning\npathway from initial content analysis to final maturity rating determination.\nAs a result, through explicitly incorporating CoT reasoning, our framework\nenables ChatGPT to understand better and apply maturity policies to facilitate\nmaturity rating. Experimental results indicate that the proposed method\noutperforms all baseline models and other fusion strategies.", "paper_summary_zh": "行動應用程式 (App) 可能讓兒童接觸到不適當的主題，例如性內容、暴力和藥物使用。成熟度評分提供一種快速且有效的方法，讓潛在使用者，尤其是監護人，評估應用程式的成熟度等級。在當今飽和的數位市場中，為行動應用程式確定準確的成熟度評分對於保護兒童健康至關重要。現有的成熟度評分方法不是不準確（例如，開發人員自行報告的評分），就是成本高昂（例如，人工審查）。在文獻中，很少有基於文字探勘的方法來評估成熟度。然而，每個應用程式通常涉及多種模式，即文字中的應用程式說明和影像中的螢幕截圖。在本文中，我們提出一個框架，用於確定應用程式的成熟度等級，該框架利用多模態大型語言模型 (MLLM)，特別是 ChatGPT-4 Vision。我們的框架採用思維鏈 (CoT) 推理為基礎，系統性地利用 ChatGPT-4 處理多模態應用程式資料（即文字說明和螢幕截圖），並引導 MLLM 模型逐步進行推理路徑，從初始內容分析到最終成熟度評分確定。因此，透過明確納入 CoT 推理，我們的框架使 ChatGPT 能夠更深入地了解並應用成熟度政策來促進成熟度評分。實驗結果表明，所提出的方法優於所有基線模型和其他融合策略。", "author": "Chuanbo Hu et.al.", "authors": "Chuanbo Hu, Bin Liu, Minglei Yin, Yilu Zhou, Xin Li", "id": "2407.06309v1", "paper_url": "http://arxiv.org/abs/2407.06309v1", "repo": "null"}}