{"2410.21154": {"publish_time": "2024-10-28", "title": "Trajectory Flow Matching with Applications to Clinical Time Series Modeling", "paper_summary": "Modeling stochastic and irregularly sampled time series is a challenging\nproblem found in a wide range of applications, especially in medicine. Neural\nstochastic differential equations (Neural SDEs) are an attractive modeling\ntechnique for this problem, which parameterize the drift and diffusion terms of\nan SDE with neural networks. However, current algorithms for training Neural\nSDEs require backpropagation through the SDE dynamics, greatly limiting their\nscalability and stability. To address this, we propose Trajectory Flow Matching\n(TFM), which trains a Neural SDE in a simulation-free manner, bypassing\nbackpropagation through the dynamics. TFM leverages the flow matching technique\nfrom generative modeling to model time series. In this work we first establish\nnecessary conditions for TFM to learn time series data. Next, we present a\nreparameterization trick which improves training stability. Finally, we adapt\nTFM to the clinical time series setting, demonstrating improved performance on\nthree clinical time series datasets both in terms of absolute performance and\nuncertainty prediction.", "paper_summary_zh": "隨機且不規則取樣的時序建模是一個具有挑戰性的問題，在廣泛的應用中發現，特別是在醫學中。神經隨機微分方程 (Neural SDE) 是這個問題一個有吸引力的建模技術，它用神經網路參數化 SDE 的漂移和擴散項。然而，目前訓練神經 SDE 的演算法需要透過 SDE 動態進行反向傳播，極大地限制了它們的可擴充性和穩定性。為了解決這個問題，我們提出軌跡流匹配 (TFM)，它以無模擬的方式訓練一個神經 SDE，繞過動態的反向傳播。TFM 利用生成式建模中的流匹配技術來建模時序。在這項工作中，我們首先建立 TFM 學習時序資料的必要條件。接下來，我們提出一個重新參數化的技巧，它改進了訓練穩定性。最後，我們將 TFM 適應到臨床時序設定，證明了在絕對效能和不確定性預測方面，在三個臨床時序資料集上都有效能的提升。", "author": "Xi Zhang et.al.", "authors": "Xi Zhang, Yuan Pu, Yuki Kawamura, Andrew Loza, Yoshua Bengio, Dennis L. Shung, Alexander Tong", "id": "2410.21154v1", "paper_url": "http://arxiv.org/abs/2410.21154v1", "repo": "https://github.com/nzhangx/trajectoryflowmatching"}}