{"2410.02664": {"publish_time": "2024-10-03", "title": "Grounded Answers for Multi-agent Decision-making Problem through Generative World Model", "paper_summary": "Recent progress in generative models has stimulated significant innovations\nin many fields, such as image generation and chatbots. Despite their success,\nthese models often produce sketchy and misleading solutions for complex\nmulti-agent decision-making problems because they miss the trial-and-error\nexperience and reasoning as humans. To address this limitation, we explore a\nparadigm that integrates a language-guided simulator into the multi-agent\nreinforcement learning pipeline to enhance the generated answer. The simulator\nis a world model that separately learns dynamics and reward, where the dynamics\nmodel comprises an image tokenizer as well as a causal transformer to generate\ninteraction transitions autoregressively, and the reward model is a\nbidirectional transformer learned by maximizing the likelihood of trajectories\nin the expert demonstrations under language guidance. Given an image of the\ncurrent state and the task description, we use the world model to train the\njoint policy and produce the image sequence as the answer by running the\nconverged policy on the dynamics model. The empirical results demonstrate that\nthis framework can improve the answers for multi-agent decision-making problems\nby showing superior performance on the training and unseen tasks of the\nStarCraft Multi-Agent Challenge benchmark. In particular, it can generate\nconsistent interaction sequences and explainable reward functions at\ninteraction states, opening the path for training generative models of the\nfuture.", "paper_summary_zh": "生成模型的最新进展刺激了許多領域的重大創新，例如圖像生成和聊天機器人。儘管這些模型很成功，但它們通常會為複雜的多主體決策問題產生粗略且誤導的解決方案，因為它們錯過了人類的試錯經驗和推理。為了解決這個限制，我們探索了一種範例，將語言引導模擬器整合到多主體強化學習管道中，以增強產生的答案。模擬器是一個世界模型，分別學習動態和獎勵，其中動態模型包含一個影像標記器以及一個因果變換器，以自迴歸的方式產生交互轉換，而獎勵模型是一個雙向變換器，透過最大化專家示範中軌跡的可能性在語言指導下學習。給定當前狀態的影像和任務描述，我們使用世界模型來訓練聯合策略，並透過在動態模型上執行收斂策略來產生影像序列作為答案。實證結果表明，這個框架可以透過在 StarCraft 多主體挑戰基準的訓練和未見任務上展現優異的效能，來改善多主體決策問題的答案。特別是，它可以在互動狀態中產生一致的互動序列和可解釋的獎勵函數，為訓練未來的生成模型開啟道路。", "author": "Zeyang Liu et.al.", "authors": "Zeyang Liu, Xinrui Yang, Shiguang Sun, Long Qian, Lipeng Wan, Xingyu Chen, Xuguang Lan", "id": "2410.02664v1", "paper_url": "http://arxiv.org/abs/2410.02664v1", "repo": "null"}}