{"2210.08979": {"publish_time": "2022-09-30", "title": "An Interactive Interpretability System for Breast Cancer Screening with Deep Learning", "paper_summary": "Deep learning methods, in particular convolutional neural networks, have\nemerged as a powerful tool in medical image computing tasks. While these\ncomplex models provide excellent performance, their black-box nature may hinder\nreal-world adoption in high-stakes decision-making. In this paper, we propose\nan interactive system to take advantage of state-of-the-art interpretability\ntechniques to assist radiologists with breast cancer screening. Our system\nintegrates a deep learning model into the radiologists' workflow and provides\nnovel interactions to promote understanding of the model's decision-making\nprocess. Moreover, we demonstrate that our system can take advantage of user\ninteractions progressively to provide finer-grained explainability reports with\nlittle labeling overhead. Due to the generic nature of the adopted\ninterpretability technique, our system is domain-agnostic and can be used for\nmany different medical image computing tasks, presenting a novel perspective on\nhow we can leverage visual analytics to transform originally static\ninterpretability techniques to augment human decision making and promote the\nadoption of medical AI.", "paper_summary_zh": "深度學習方法，尤其是卷積神經網路，已成為醫學影像運算任務中強大的工具。儘管這些複雜的模型提供了優異的效能，但它們的黑箱本質可能會阻礙在高風險決策中採用於現實世界。在本文中，我們提出一個互動系統，以利用最先進的可解釋性技術，協助放射科醫師進行乳癌篩檢。我們的系統將深度學習模型整合到放射科醫師的工作流程中，並提供新穎的互動方式，以促進對模型決策過程的理解。此外，我們證明我們的系統可以逐步利用使用者互動，以提供更細緻的可解釋性報告，而標記開銷很小。由於所採用的可解釋性技術的通用性質，我們的系統與領域無關，可用於許多不同的醫學影像運算任務，提供了一個新穎的觀點，說明我們如何利用視覺分析將原本靜態的可解釋性技術轉變為擴增人類決策制定和促進採用醫療 AI。", "author": "Yuzhe Lu et.al.", "authors": "Yuzhe Lu, Adam Perer", "id": "2210.08979v1", "paper_url": "http://arxiv.org/abs/2210.08979v1", "repo": "null"}}