{"2410.10455": {"publish_time": "2024-10-14", "title": "Advancing Academic Knowledge Retrieval via LLM-enhanced Representation Similarity Fusion", "paper_summary": "In an era marked by robust technological growth and swift information\nrenewal, furnishing researchers and the populace with top-tier, avant-garde\nacademic insights spanning various domains has become an urgent necessity. The\nKDD Cup 2024 AQA Challenge is geared towards advancing retrieval models to\nidentify pertinent academic terminologies from suitable papers for scientific\ninquiries. This paper introduces the LLM-KnowSimFuser proposed by Robo Space,\nwhich wins the 2nd place in the competition. With inspirations drawed from the\nsuperior performance of LLMs on multiple tasks, after careful analysis of the\nprovided datasets, we firstly perform fine-tuning and inference using\nLLM-enhanced pre-trained retrieval models to introduce the tremendous language\nunderstanding and open-domain knowledge of LLMs into this task, followed by a\nweighted fusion based on the similarity matrix derived from the inference\nresults. Finally, experiments conducted on the competition datasets show the\nsuperiority of our proposal, which achieved a score of 0.20726 on the final\nleaderboard.", "paper_summary_zh": "在科技飛速發展、資訊更新快速的時代，為研究者和普羅大眾提供跨領域的頂尖前沿學術見解，已成為刻不容緩的必要。KDD Cup 2024 AQA 挑戰賽旨在推進檢索模型，從合適的論文中找出與科學探究相關的學術術語。本文介紹了由 Robo Space 提出的 LLM-KnowSimFuser，在競賽中獲得第二名。在仔細分析提供的資料集後，我們從 LLM 在多項任務中的優異表現中汲取靈感，首先使用 LLM 增強的預訓練檢索模型進行微調和推理，將 LLM 强大的語言理解和開放領域知識引入此任務中，接著根據推理結果衍生的相似矩陣進行加權融合。最後，在競賽資料集上進行的實驗顯示了我們提案的優越性，在最終排行榜上取得 0.20726 的分數。", "author": "Wei Dai et.al.", "authors": "Wei Dai, Peng Fu, Chunjing Gan", "id": "2410.10455v1", "paper_url": "http://arxiv.org/abs/2410.10455v1", "repo": "null"}}