{"2412.06681": {"publish_time": "2024-12-09", "title": "Toward LLM-Agent-Based Modeling of Transportation Systems: A Conceptual Framework", "paper_summary": "In transportation system demand modeling and simulation, agent-based models\nand microsimulations are current state-of-the-art approaches. However, existing\nagent-based models still have some limitations on behavioral realism and\nresource demand that limit their applicability. In this study, leveraging the\nemerging technology of large language models (LLMs) and LLM-based agents, we\npropose a general LLM-agent-based modeling framework for transportation\nsystems. We argue that LLM agents not only possess the essential capabilities\nto function as agents but also offer promising solutions to overcome some\nlimitations of existing agent-based models. Our conceptual framework design\nclosely replicates the decision-making and interaction processes and traits of\nhuman travelers within transportation networks, and we demonstrate that the\nproposed systems can meet critical behavioral criteria for decision-making and\nlearning behaviors using related studies and a demonstrative example of LLM\nagents' learning and adjustment in the bottleneck setting. Although further\nrefinement of the LLM-agent-based modeling framework is necessary, we believe\nthat this approach has the potential to improve transportation system modeling\nand simulation.", "paper_summary_zh": "在交通系統需求建模和模擬中，基於代理的模型和微觀模擬是當前最先進的方法。然而，現有的基於代理的模型在行為真實性和資源需求方面仍然存在一些限制，這限制了它們的適用性。在本研究中，我們利用大型語言模型 (LLM) 和基於 LLM 的代理的新興技術，提出了一個用於交通系統的通用 LLM 代理建模框架。我們認為 LLM 代理不僅具備作為代理運作的基本能力，而且還提供了有希望的解決方案來克服現有基於代理的模型的一些限制。我們的概念框架設計緊密複製了交通網路中人類旅行者的決策制定和互動過程和特徵，我們證明了所提出的系統可以使用相關研究和 LLM 代理在瓶頸設置中的學習和調整的示範性範例來滿足決策制定和學習行為的重要行為標準。儘管進一步完善基於 LLM 的代理建模框架是必要的，但我們相信這種方法有可能改善交通系統建模和模擬。", "author": "Tianming Liu et.al.", "authors": "Tianming Liu, Jirong Yang, Yafeng Yin", "id": "2412.06681v1", "paper_url": "http://arxiv.org/abs/2412.06681v1", "repo": "null"}}