{"2410.23668": {"publish_time": "2024-10-31", "title": "Kernel Looping: Eliminating Synchronization Boundaries for Peak Inference Performance", "paper_summary": "Token generation speed is critical to power the next wave of AI inference\napplications. GPUs significantly underperform during token generation due to\nsynchronization overheads at kernel boundaries, utilizing only 21% of their\npeak memory bandwidth. While recent dataflow architectures mitigate these\noverheads by enabling aggressive fusion of decoder layers into a single kernel,\nthey too leave performance on the table due to synchronization penalties at\nlayer boundaries.\n  This paper presents kernel looping, a specialized global optimization\ntechnique which exploits an optimization opportunity brought by combining the\nunique layer-level fusion possible in modern dataflow architectures with the\nrepeated layer structure found in language models. Kernel looping eliminates\nsynchronization costs between consecutive calls to the same kernel by\ntransforming these calls into a single call to a modified kernel containing a\npipelined outer loop. We evaluate kernel looping on the SambaNova SN40L\nReconfigurable Dataflow Unit (RDU), a commercial dataflow accelerator for AI.\nExperiments demonstrate that kernel looping speeds up the decode phase of a\nwide array of powerful open-source models by up to 2.2$\\times$ on SN40L. Kernel\nlooping allows scaling of decode performance over multiple SN40L sockets,\nachieving speedups of up to 2.5$\\times$. Finally, kernel looping enables SN40L\nto achieve over 90% of peak performance on 8 and 16 sockets and achieve a\nspeedup of up to 3.7$\\times$ over DGX H100. Kernel looping, as well as the\nmodels evaluated in this paper, are deployed in production in a commercial AI\ninference cloud.", "paper_summary_zh": "權杖產生速度對於推動下波 AI 推論應用至關重要。GPU 在權杖產生期間會因為核心邊界的同步開銷而大幅度表現不佳，僅使用其峰值記憶體頻寬的 21%。儘管最近的資料流程架構透過讓解碼器層積極融合成單一核心來減輕這些開銷，但它們也會因為層邊界的同步懲罰而讓效能停滯不前。\n本文提出核心迴圈，這是一種專門的全球最佳化技術，它利用現代資料流程架構中可能出現的獨特層級融合以及語言模型中發現的重複層級結構，來利用最佳化機會。核心迴圈透過將這些呼叫轉換成對包含管線化外層迴圈的修改核心之單一呼叫，消除了對同一個核心連續呼叫之間的同步成本。我們在 SambaNova SN40L 可重新配置資料流程單元 (RDU) 上評估核心迴圈，這是一種用於 AI 的商用資料流程加速器。實驗證明，核心迴圈在 SN40L 上將各種強大開放原始碼模型的解碼階段加速了 2.2 倍。核心迴圈允許在多個 SN40L 插槽上擴展解碼效能，加速速度最高可達 2.5 倍。最後，核心迴圈讓 SN40L 在 8 個和 16 個插槽上達到超過 90% 的峰值效能，並在 DGX H100 上加速最高達 3.7 倍。核心迴圈以及本文評估的模型都已部署在商用 AI 推論雲端的生產環境中。", "author": "David Koeplinger et.al.", "authors": "David Koeplinger, Darshan Gandhi, Pushkar Nandkar, Nathan Sheeley, Matheen Musaddiq, Leon Zhang, Reid Goodbar, Matthew Shaffer, Han Wang, Angela Wang, Mingran Wang, Raghu Prabhakar", "id": "2410.23668v1", "paper_url": "http://arxiv.org/abs/2410.23668v1", "repo": "null"}}