{"2409.04452": {"publish_time": "2024-08-26", "title": "Process Trace Querying using Knowledge Graphs and Notation3", "paper_summary": "In process mining, a log exploration step allows making sense of the event\ntraces; e.g., identifying event patterns and illogical traces, and gaining\ninsight into their variability. To support expressive log exploration, the\nevent log can be converted into a Knowledge Graph (KG), which can then be\nqueried using general-purpose languages. We explore the creation of semantic KG\nusing the Resource Description Framework (RDF) as a data model, combined with\nthe general-purpose Notation3 (N3) rule language for querying. We show how\ntypical trace querying constraints, inspired by the state of the art, can be\nimplemented in N3. We convert case- and object-centric event logs into a\ntrace-based semantic KG; OCEL2 logs are hereby \"flattened\" into traces based on\nobject paths through the KG. This solution offers (a) expressivity, as queries\ncan instantiate constraints in multiple ways and arbitrarily constrain\nattributes and relations (e.g., actors, resources); (b) flexibility, as OCEL2\nevent logs can be serialized as traces in arbitrary ways based on the KG; and\n(c) extensibility, as others can extend our library by leveraging the same\nimplementation patterns.", "paper_summary_zh": "在流程挖掘中，日志探索步骤可以理解事件轨迹；例如，识别事件模式和非逻辑轨迹，并深入了解其可变性。为了支持表达性日志探索，事件日志可以转换为知识图 (KG)，然后可以使用通用语言对其进行查询。我们探索使用资源描述框架 (RDF) 作为数据模型创建语义 KG，并结合通用 Notation3 (N3) 规则语言进行查询。我们展示了如何使用 N3 实现受现有技术启发的典型轨迹查询约束。我们将案例和对象中心事件日志转换为基于轨迹的语义 KG；OCEL2 日志在此被“扁平化”为基于通过 KG 的对象路径的轨迹。此解决方案提供 (a) 表达力，因为查询可以以多种方式实例化约束并任意约束属性和关系（例如，参与者、资源）；(b) 灵活，因为 OCEL2 事件日志可以基于 KG 以任意方式序列化为轨迹；以及 (c) 可扩展性，因为其他人可以通过利用相同的实现模式来扩展我们的库。", "author": "William Van Woensel et.al.", "authors": "William Van Woensel", "id": "2409.04452v1", "paper_url": "http://arxiv.org/abs/2409.04452v1", "repo": "null"}}