{"2406.07028": {"publish_time": "2024-06-11", "title": "Heterogeneous Learning Rate Scheduling for Neural Architecture Search on Long-Tailed Datasets", "paper_summary": "In this paper, we attempt to address the challenge of applying Neural\nArchitecture Search (NAS) algorithms, specifically the Differentiable\nArchitecture Search (DARTS), to long-tailed datasets where class distribution\nis highly imbalanced. We observe that traditional re-sampling and re-weighting\ntechniques, which are effective in standard classification tasks, lead to\nperformance degradation when combined with DARTS. To mitigate this, we propose\na novel adaptive learning rate scheduling strategy tailored for the\narchitecture parameters of DARTS when integrated with the Bilateral Branch\nNetwork (BBN) for handling imbalanced datasets. Our approach dynamically\nadjusts the learning rate of the architecture parameters based on the training\nepoch, preventing the disruption of well-trained representations in the later\nstages of training. Additionally, we explore the impact of branch mixing\nfactors on the algorithm's performance. Through extensive experiments on the\nCIFAR-10 dataset with an artificially induced long-tailed distribution, we\ndemonstrate that our method achieves comparable accuracy to using DARTS alone.\nAnd the experiment results suggest that re-sampling methods inherently harm the\nperformance of the DARTS algorithm. Our findings highlight the importance of\ncareful data augment when applying DNAS to imbalanced learning scenarios.", "paper_summary_zh": "<paragraph>在本文中，我们尝试解决将神经架构搜索 (NAS) 算法（特别是可微架构搜索 (DARTS)）应用于长尾数据集的挑战，其中类分布高度不平衡。我们观察到传统的重新采样和重新加权技术（在标准分类任务中有效）与 DARTS 结合使用时会导致性能下降。为了缓解这个问题，我们提出了一种新的自适应学习率调度策略，该策略针对 DARTS 的架构参数量身定制，并与双边分支网络 (BBN) 集成以处理不平衡数据集。我们的方法根据训练时期动态调整架构参数的学习率，防止在训练后期破坏训练良好的表示。此外，我们探讨了分支混合因子对算法性能的影响。通过在人工诱导的长尾分布的 CIFAR-10 数据集上进行广泛的实验，我们证明了我们的方法与单独使用 DARTS 实现了相当的准确性。实验结果表明，重新采样方法本质上会损害 DARTS 算法的性能。我们的研究结果突出了在将 DNAS 应用于不平衡学习场景时仔细进行数据扩充的重要性。</paragraph>", "author": "Chenxia Tang et.al.", "authors": "Chenxia Tang", "id": "2406.07028v1", "paper_url": "http://arxiv.org/abs/2406.07028v1", "repo": "null"}}