{"2412.14686": {"publish_time": "2024-12-19", "title": "Each Fake News is Fake in its Own Way: An Attribution Multi-Granularity Benchmark for Multimodal Fake News Detection", "paper_summary": "Social platforms, while facilitating access to information, have also become\nsaturated with a plethora of fake news, resulting in negative consequences.\nAutomatic multimodal fake news detection is a worthwhile pursuit. Existing\nmultimodal fake news datasets only provide binary labels of real or fake.\nHowever, real news is alike, while each fake news is fake in its own way. These\ndatasets fail to reflect the mixed nature of various types of multimodal fake\nnews. To bridge the gap, we construct an attributing multi-granularity\nmultimodal fake news detection dataset \\amg, revealing the inherent fake\npattern. Furthermore, we propose a multi-granularity clue alignment model \\our\nto achieve multimodal fake news detection and attribution. Experimental results\ndemonstrate that \\amg is a challenging dataset, and its attribution setting\nopens up new avenues for future research.", "paper_summary_zh": "社交平台在促進資訊取得的同時，也充斥著大量的假新聞，造成負面影響。自動多模態假新聞偵測是一項有價值的追求。現有的多模態假新聞資料集僅提供真實或假的二元標籤。然而，真實新聞是相似的，而每則假新聞都有其獨特的虛假方式。這些資料集無法反映各種類型多模態假新聞的混合性質。為了彌合差距，我們構建了一個歸因的多粒度多模態假新聞偵測資料集 \\amg，揭示了內在的假新聞模式。此外，我們提出了一個多粒度線索對齊模型 \\our，以實現多模態假新聞偵測和歸因。實驗結果表明，\\amg 是一個具有挑戰性的資料集，其歸因設定為未來的研究開闢了新的途徑。", "author": "Hao Guo et.al.", "authors": "Hao Guo, Zihan Ma, Zhi Zeng, Minnan Luo, Weixin Zeng, Jiuyang Tang, Xiang Zhao", "id": "2412.14686v1", "paper_url": "http://arxiv.org/abs/2412.14686v1", "repo": "null"}}