{"2502.09804": {"publish_time": "2025-02-13", "title": "Acute Lymphoblastic Leukemia Diagnosis Employing YOLOv11, YOLOv8, ResNet50, and Inception-ResNet-v2 Deep Learning Models", "paper_summary": "Thousands of individuals succumb annually to leukemia alone. As artificial\nintelligence-driven technologies continue to evolve and advance, the question\nof their applicability and reliability remains unresolved. This study aims to\nutilize image processing and deep learning methodologies to achieve\nstate-of-the-art results for the detection of Acute Lymphoblastic Leukemia\n(ALL) using data that best represents real-world scenarios. ALL is one of\nseveral types of blood cancer, and it is an aggressive form of leukemia. In\nthis investigation, we examine the most recent advancements in ALL detection,\nas well as the latest iteration of the YOLO series and its performance. We\naddress the question of whether white blood cells are malignant or benign.\nAdditionally, the proposed models can identify different ALL stages, including\nearly stages. Furthermore, these models can detect hematogones despite their\nfrequent misclassification as ALL. By utilizing advanced deep learning models,\nnamely, YOLOv8, YOLOv11, ResNet50 and Inception-ResNet-v2, the study achieves\naccuracy rates as high as 99.7%, demonstrating the effectiveness of these\nalgorithms across multiple datasets and various real-world situations.", "paper_summary_zh": "每年有數千人僅死於白血病。隨著人工智慧驅動技術持續演進和進步，其適用性和可靠性問題仍未解決。本研究旨在利用影像處理和深度學習方法，使用最能代表真實世界場景的資料，達成急性淋巴性白血病 (ALL) 檢測的最新結果。ALL 是數種血癌類型之一，也是一種侵襲性白血病。在此研究中，我們探討了 ALL 檢測的最新進展，以及 YOLO 系列的最新版本及其效能。我們探討白血球是惡性還是良性的問題。此外，所提出的模型可以識別不同的 ALL 階段，包括早期階段。更進一步的是，這些模型可以檢測到血球母細胞，儘管它們經常被錯誤分類為 ALL。本研究利用進階深度學習模型，即 YOLOv8、YOLOv11、ResNet50 和 Inception-ResNet-v2，達到了高達 99.7% 的準確率，證明了這些演算法在多個資料集和各種真實世界情況下的有效性。", "author": "Alaa Awad et.al.", "authors": "Alaa Awad, Salah A. Aly", "id": "2502.09804v1", "paper_url": "http://arxiv.org/abs/2502.09804v1", "repo": "null"}}