{"2502.15448": {"publish_time": "2025-02-21", "title": "MVIP -- A Dataset and Methods for Application Oriented Multi-View and Multi-Modal Industrial Part Recognition", "paper_summary": "We present MVIP, a novel dataset for multi-modal and multi-view\napplication-oriented industrial part recognition. Here we are the first to\ncombine a calibrated RGBD multi-view dataset with additional object context\nsuch as physical properties, natural language, and super-classes. The current\nportfolio of available datasets offers a wide range of representations to\ndesign and benchmark related methods. In contrast to existing classification\nchallenges, industrial recognition applications offer controlled multi-modal\nenvironments but at the same time have different problems than traditional\n2D/3D classification challenges. Frequently, industrial applications must deal\nwith a small amount or increased number of training data, visually similar\nparts, and varying object sizes, while requiring a robust near 100% top 5\naccuracy under cost and time constraints. Current methods tackle such\nchallenges individually, but direct adoption of these methods within industrial\napplications is complex and requires further research. Our main goal with MVIP\nis to study and push transferability of various state-of-the-art methods within\nrelated downstream tasks towards an efficient deployment of industrial\nclassifiers. Additionally, we intend to push with MVIP research regarding\nseveral modality fusion topics, (automated) synthetic data generation, and\ncomplex data sampling -- combined in a single application-oriented benchmark.", "paper_summary_zh": "我們提出 MVIP，這是一個用於多模態和多視圖應用導向產業零件識別的新穎資料集。在此，我們首次將校正過的 RGBD 多視圖資料集與其他物件背景結合，例如物理特性、自然語言和超類別。目前可用的資料集組合提供了各種表示法，用於設計和基準相關方法。與現有的分類挑戰不同，產業識別應用程式提供了受控的多模態環境，但同時也存在與傳統 2D/3D 分類挑戰不同的問題。產業應用程式通常必須處理數量少或增加的訓練資料、視覺上相似的零件和不同的物件大小，同時在成本和時間限制下需要穩健的接近 100% 的前 5 名準確度。目前的技術分別應對這些挑戰，但這些技術在產業應用程式中的直接採用很複雜，需要進一步研究。我們使用 MVIP 的主要目標是在相關下游任務中研究和推動各種最先進技術的可轉移性，以有效部署產業分類器。此外，我們打算使用 MVIP 推動有關多種模態融合主題、（自動化）合成資料產生和複雜資料取樣的研究所，並將其結合在單一的應用導向基準中。", "author": "Paul Koch et.al.", "authors": "Paul Koch, Marian Schlüter, Jörg Krüger", "id": "2502.15448v1", "paper_url": "http://arxiv.org/abs/2502.15448v1", "repo": "null"}}