{"2502.10177": {"publish_time": "2025-02-14", "title": "STMA: A Spatio-Temporal Memory Agent for Long-Horizon Embodied Task Planning", "paper_summary": "A key objective of embodied intelligence is enabling agents to perform\nlong-horizon tasks in dynamic environments while maintaining robust\ndecision-making and adaptability. To achieve this goal, we propose the\nSpatio-Temporal Memory Agent (STMA), a novel framework designed to enhance task\nplanning and execution by integrating spatio-temporal memory. STMA is built\nupon three critical components: (1) a spatio-temporal memory module that\ncaptures historical and environmental changes in real time, (2) a dynamic\nknowledge graph that facilitates adaptive spatial reasoning, and (3) a\nplanner-critic mechanism that iteratively refines task strategies. We evaluate\nSTMA in the TextWorld environment on 32 tasks, involving multi-step planning\nand exploration under varying levels of complexity. Experimental results\ndemonstrate that STMA achieves a 31.25% improvement in success rate and a 24.7%\nincrease in average score compared to the state-of-the-art model. The results\nhighlight the effectiveness of spatio-temporal memory in advancing the memory\ncapabilities of embodied agents.", "paper_summary_zh": "具身智能的主要目標是讓代理在動態環境中執行長遠任務，同時維持穩健的決策制定和適應力。為達成此目標，我們提出時空記憶代理 (STMA)，這是一個新穎的架構，旨在透過整合時空記憶來強化任務規劃和執行。STMA 建立在三個關鍵組成部分之上：(1) 捕捉歷史和環境即時變化的時空記憶模組，(2) 促進適應性空間推理的動態知識圖譜，以及 (3) 迭代精進任務策略的規劃者-評論家機制。我們在 TextWorld 環境中針對 32 項任務評估 STMA，這些任務涉及在不同複雜度等級下的多步驟規劃和探索。實驗結果表明，與最先進的模型相比，STMA 的成功率提升了 31.25%，平均分數增加了 24.7%。這些結果突顯了時空記憶在提升具身代理記憶能力方面的有效性。", "author": "Mingcong Lei et.al.", "authors": "Mingcong Lei, Yiming Zhao, Ge Wang, Zhixin Mai, Shuguang Cui, Yatong Han, Jinke Ren", "id": "2502.10177v1", "paper_url": "http://arxiv.org/abs/2502.10177v1", "repo": "null"}}