{"2501.01956": {"publish_time": "2025-01-03", "title": "Metadata Conditioning Accelerates Language Model Pre-training", "paper_summary": "The vast diversity of styles, domains, and quality levels present in language\nmodel pre-training corpora is essential in developing general model\ncapabilities, but efficiently learning and deploying the correct behaviors\nexemplified in each of these heterogeneous data sources is challenging. To\naddress this, we propose a new method, termed Metadata Conditioning then\nCooldown (MeCo), to incorporate additional learning cues during pre-training.\nMeCo first provides metadata (e.g., URLs like en.wikipedia.org) alongside the\ntext during training and later uses a cooldown phase with only the standard\ntext, thereby enabling the model to function normally even without metadata.\nMeCo significantly accelerates pre-training across different model scales (600M\nto 8B parameters) and training sources (C4, RefinedWeb, and DCLM). For\ninstance, a 1.6B language model trained with MeCo matches the downstream task\nperformance of standard pre-training while using 33% less data. Additionally,\nMeCo enables us to steer language models by conditioning the inference prompt\non either real or fabricated metadata that encodes the desired properties of\nthe output: for example, prepending wikipedia.org to reduce harmful generations\nor factquizmaster.com (fabricated) to improve common knowledge task\nperformance. We also demonstrate that MeCo is compatible with different types\nof metadata, such as model-generated topics. MeCo is remarkably simple, adds no\ncomputational overhead, and demonstrates promise in producing more capable and\nsteerable language models.", "paper_summary_zh": "語言模型預訓練語料庫中風格、領域和品質層級的多樣性對於開發一般模型能力至關重要，但有效率地學習並部署在這些異質性資料來源中呈現的正確行為是一項挑戰。為了解決這個問題，我們提出了一種新方法，稱為「後置冷卻的元資料條件化」（MeCo），以在預訓練期間納入額外的學習提示。MeCo 首先在訓練期間提供元資料（例如網址，如 en.wikipedia.org）和文字，然後在只有標準文字的冷卻階段使用，從而讓模型即使沒有元資料也能正常運作。MeCo 大幅加速了不同模型規模（600M 到 8B 參數）和訓練來源（C4、RefinedWeb 和 DCLM）的預訓練。例如，使用 MeCo 訓練的 1.6B 語言模型在使用少 33% 資料的情況下，與標準預訓練的下游任務效能相符。此外，MeCo 讓我們能夠透過對推論提示進行條件化，以編碼輸出所需屬性的真實或虛構元資料來引導語言模型：例如，在前面加上 wikipedia.org 以減少有害的生成，或加上 factquizmaster.com（虛構）以改善一般知識任務效能。我們也證明 MeCo 與不同類型的元資料相容，例如模型產生的主題。MeCo 非常簡單，不會增加運算負擔，並證明了在產生更有能力且可引導的語言模型方面很有前景。", "author": "Tianyu Gao et.al.", "authors": "Tianyu Gao, Alexander Wettig, Luxi He, Yihe Dong, Sadhika Malladi, Danqi Chen", "id": "2501.01956v1", "paper_url": "http://arxiv.org/abs/2501.01956v1", "repo": "null"}}