{"2407.18552": {"publish_time": "2024-07-26", "title": "Multimodal Emotion Recognition using Audio-Video Transformer Fusion with Cross Attention", "paper_summary": "Understanding emotions is a fundamental aspect of human communication.\nIntegrating audio and video signals offers a more comprehensive understanding\nof emotional states compared to traditional methods that rely on a single data\nsource, such as speech or facial expressions. Despite its potential, multimodal\nemotion recognition faces significant challenges, particularly in\nsynchronization, feature extraction, and fusion of diverse data sources. To\naddress these issues, this paper introduces a novel transformer-based model\nnamed Audio-Video Transformer Fusion with Cross Attention (AVT-CA). The AVT-CA\nmodel employs a transformer fusion approach to effectively capture and\nsynchronize interlinked features from both audio and video inputs, thereby\nresolving synchronization problems. Additionally, the Cross Attention mechanism\nwithin AVT-CA selectively extracts and emphasizes critical features while\ndiscarding irrelevant ones from both modalities, addressing feature extraction\nand fusion challenges. Extensive experimental analysis conducted on the\nCMU-MOSEI, RAVDESS and CREMA-D datasets demonstrates the efficacy of the\nproposed model. The results underscore the importance of AVT-CA in developing\nprecise and reliable multimodal emotion recognition systems for practical\napplications.", "paper_summary_zh": "理解情緒是人類溝通的基本面向。\n相較於依賴單一資料來源（例如語音或面部表情）的傳統方法，整合音訊和視訊訊號能提供對情緒狀態更全面的理解。儘管具有潛力，多模態情緒辨識仍面臨重大挑戰，特別是在同步化、特徵萃取和不同資料來源的融合方面。為了解決這些問題，本文介紹了一個名為音訊視訊轉換器融合帶交叉注意力的新穎轉換器模型（AVT-CA）。AVT-CA 模型採用轉換器融合方法，以有效擷取和同步來自音訊和視訊輸入的相互連結特徵，從而解決同步化問題。此外，AVT-CA 內部的交叉注意力機制會選擇性地萃取和強調關鍵特徵，同時捨棄來自兩種模態的不相關特徵，解決了特徵萃取和融合的挑戰。在 CMU-MOSEI、RAVDESS 和 CREMA-D 資料集上進行的廣泛實驗分析證明了所提出模型的效能。結果強調了 AVT-CA 在開發精確且可靠的多模態情緒辨識系統以供實際應用中的重要性。", "author": "Joe Dhanith P R et.al.", "authors": "Joe Dhanith P R, Shravan Venkatraman, Vigya Sharma, Santhosh Malarvannan", "id": "2407.18552v1", "paper_url": "http://arxiv.org/abs/2407.18552v1", "repo": "null"}}