{"2410.11457": {"publish_time": "2024-10-15", "title": "LR-SQL: A Supervised Fine-Tuning Method for Text2SQL Tasks under Low-Resource Scenarios", "paper_summary": "Large language models revolutionize Text2SQL through supervised fine-tuning,\nyet a crucial limitation is overlooked: the complexity of databases leads to an\nincreased context length, consequently resulting in higher GPU memory demands\nfor model fine-tuning. To address this issue, we propose LR-SQL. LR-SQL\ncomprises two supervised fine-tuning models: the schema\\_link model and the\nSQL\\_generation model, with the schema\\_link model serving as the focal point\nfor streamlining the overall process. During the fine-tuning of the\nschema\\_link model, LR-SQL breaks down the complete database into flexible\ncombinations of tables with adjustable quantities, enabling the model to learn\nthe relationships within the entire database from these dispersed slices.\nFurthermore, to enhance the model's ability to perceive the relationships among\nvarious discrete slices during inference, LR-SQL trains the model's\nChain-of-Thought capability for this task. Experimental results demonstrate\nthat LR-SQL can reduce the total GPU memory usage by 40\\% compared to existing\nfine-tuning methods, while only losing 2\\% of table prediction accuracy in\nschema\\_link task. For the overall Text2SQL task, the Execution Accuracy\ndecrease by 0.6\\%.Our project is now available on\nhttps://github.com/hongWin/LR-SQL", "paper_summary_zh": "大型語言模型透過監督微調革新 Text2SQL，\n但一個關鍵的限制被忽略了：資料庫的複雜性導致\n增加的內容長度，因此導致模型微調的 GPU 記憶體需求更高。\n為了解決這個問題，我們提出 LR-SQL。LR-SQL\n包含兩個監督微調模型：schema\\_link 模型和\nSQL\\_generation 模型，其中 schema\\_link 模型作為簡化\n整體程序的焦點。在 schema\\_link 模型的微調過程中，LR-SQL 將\n完整的資料庫分解成具有可調整數量的表格的彈性組合，使模型能夠從這些分散的切片中學習整個資料庫中的關係。\n此外，為了增強模型在推理過程中感知各種離散切片之間關係的能力，LR-SQL 訓練模型的\n思考鏈能力來執行這項任務。實驗結果表明\n與現有的微調方法相比，LR-SQL 可以將總 GPU 記憶體使用量減少 40%，同時在\nschema\\_link 任務中僅損失 2% 的表格預測精度。對於整體 Text2SQL 任務，執行準確度\n降低了 0.6%。我們的專案現在可以在\nhttps://github.com/hongWin/LR-SQL 上取得", "author": "Wen Wuzhenghong et.al.", "authors": "Wen Wuzhenghong, Zhang Yongpan, Pan Su, Sun Yuwei, Lu Pengwei, Ding Cheng", "id": "2410.11457v1", "paper_url": "http://arxiv.org/abs/2410.11457v1", "repo": "https://github.com/hongwin/lr-sql"}}