{"2406.12692": {"publish_time": "2024-06-18", "title": "MAGIC: Generating Self-Correction Guideline for In-Context Text-to-SQL", "paper_summary": "Self-correction in text-to-SQL is the process of prompting large language\nmodel (LLM) to revise its previously incorrectly generated SQL, and commonly\nrelies on manually crafted self-correction guidelines by human experts that are\nnot only labor-intensive to produce but also limited by the human ability in\nidentifying all potential error patterns in LLM responses. We introduce MAGIC,\na novel multi-agent method that automates the creation of the self-correction\nguideline. MAGIC uses three specialized agents: a manager, a correction, and a\nfeedback agent. These agents collaborate on the failures of an LLM-based method\non the training set to iteratively generate and refine a self-correction\nguideline tailored to LLM mistakes, mirroring human processes but without human\ninvolvement. Our extensive experiments show that MAGIC's guideline outperforms\nexpert human's created ones. We empirically find out that the guideline\nproduced by MAGIC enhance the interpretability of the corrections made,\nproviding insights in analyzing the reason behind the failures and successes of\nLLMs in self-correction. We make all agent interactions publicly available to\nthe research community, to foster further research in this area, offering a\nsynthetic dataset for future explorations into automatic self-correction\nguideline generation.", "paper_summary_zh": "文本轉 SQL 中的自我修正，是促使大型語言模型 (LLM) 修改其先前錯誤產生的 SQL 程序，且通常依賴人工專家手動製作的自我修正準則，不僅製作費時，也受限於人類辨識 LLM 回應中所有潛在錯誤模式的能力。我們引進 MAGIC，這是一種新穎的多重代理方法，能自動建立自我修正準則。MAGIC 使用三個專門代理：管理員、修正器和回饋代理。這些代理針對 LLM 基礎方法在訓練組中的失敗進行協作，反覆產生並改善針對 LLM 錯誤量身打造的自我修正準則，反映人類程序，但無需人類參與。我們廣泛的實驗顯示，MAGIC 的準則優於人工專家建立的準則。我們實證發現，MAGIC 產生的準則能提升修正的詮釋性，提供分析 LLM 在自我修正中失敗和成功的背後原因的見解。我們讓所有代理互動公開於研究社群，以促進此領域的進一步研究，提供一個合成資料集，供未來探索自動自我修正準則產生。", "author": "Arian Askari et.al.", "authors": "Arian Askari, Christian Poelitz, Xinye Tang", "id": "2406.12692v1", "paper_url": "http://arxiv.org/abs/2406.12692v1", "repo": "null"}}