{"2412.19087": {"publish_time": "2024-12-26", "title": "MoPD: Mixture-of-Prompts Distillation for Vision-Language Models", "paper_summary": "Soft prompt learning methods are effective for adapting vision-language\nmodels (VLMs) to downstream tasks. Nevertheless, empirical evidence reveals a\ntendency of existing methods that they overfit seen classes and exhibit\ndegraded performance on unseen classes. This limitation is due to the inherent\nbias in the training data towards the seen classes. To address this issue, we\npropose a novel soft prompt learning method, named Mixture-of-Prompts\nDistillation (MoPD), which can effectively transfer useful knowledge from hard\nprompts manually hand-crafted (a.k.a. teacher prompts) to the learnable soft\nprompt (a.k.a. student prompt), thereby enhancing the generalization ability of\nsoft prompts on unseen classes. Moreover, the proposed MoPD method utilizes a\ngating network that learns to select hard prompts used for prompt distillation.\nExtensive experiments demonstrate that the proposed MoPD method outperforms\nstate-of-the-art baselines especially on on unseen classes.", "paper_summary_zh": "軟提示學習方法對於將視覺語言模型 (VLM) 適應到下游任務是有效的。儘管如此，實證證據顯示現有方法的趨勢是過度擬合已見類別，並在未見類別上表現出下降的效能。此限制是訓練資料中對已見類別的固有偏差所致。為了解決此問題，我們提出了一種新穎的軟提示學習方法，稱為提示混合蒸餾 (MoPD)，它可以有效地將人工手動製作的硬提示（又稱教師提示）的有用知識轉移到可學習的軟提示（又稱學生提示），從而增強軟提示在未見類別上的泛化能力。此外，建議的 MoPD 方法利用閘控網路來學習選擇用於提示蒸餾的硬提示。廣泛的實驗證明，建議的 MoPD 方法優於最先進的基準，特別是在未見類別上。", "author": "Yang Chen et.al.", "authors": "Yang Chen, Shuai Fu, Yu Zhang", "id": "2412.19087v1", "paper_url": "http://arxiv.org/abs/2412.19087v1", "repo": "null"}}