{"2411.18235": {"publish_time": "2024-11-27", "title": "Certified Training with Branch-and-Bound: A Case Study on Lyapunov-stable Neural Control", "paper_summary": "We study the problem of learning Lyapunov-stable neural controllers which\nprovably satisfy the Lyapunov asymptotic stability condition within a\nregion-of-attraction. Compared to previous works which commonly used\ncounterexample guided training on this task, we develop a new and generally\nformulated certified training framework named CT-BaB, and we optimize for\ndifferentiable verified bounds, to produce verification-friendly models. In\norder to handle the relatively large region-of-interest, we propose a novel\nframework of training-time branch-and-bound to dynamically maintain a training\ndataset of subregions throughout training, such that the hardest subregions are\niteratively split into smaller ones whose verified bounds can be computed more\ntightly to ease the training. We demonstrate that our new training framework\ncan produce models which can be more efficiently verified at test time. On the\nlargest 2D quadrotor dynamical system, verification for our model is more than\n5X faster compared to the baseline, while our size of region-of-attraction is\n16X larger than the baseline.", "paper_summary_zh": "我們研究學習 Lyapunov 穩定神經控制器的問題，它可證明滿足吸引區域內 Lyapunov 漸近穩定條件。與先前通常使用反例引導訓練來執行此任務的作品相比，我們開發了一個新的且普遍制定的認證訓練架構，稱為 CT-BaB，並且我們針對可微分驗證邊界進行最佳化，以產生驗證友善的模型。為了處理相對較大的感興趣區域，我們提出了一個新穎的訓練時間分支定界架構，以在整個訓練過程中動態維護子區域的訓練資料集，這樣最困難的子區域會反覆分割成更小的子區域，其驗證邊界可以更嚴密地計算，以簡化訓練。我們證明了我們的新訓練架構可以產生在測試時可以更有效率驗證的模型。在最大的 2D 四旋翼動力系統上，與基線相比，我們模型的驗證速度快了 5 倍以上，而我們的吸引區域大小比基線大了 16 倍。", "author": "Zhouxing Shi et.al.", "authors": "Zhouxing Shi, Cho-Jui Hsieh, Huan Zhang", "id": "2411.18235v1", "paper_url": "http://arxiv.org/abs/2411.18235v1", "repo": "null"}}