{"2408.06318": {"publish_time": "2024-08-12", "title": "Can We Rely on LLM Agents to Draft Long-Horizon Plans? Let's Take TravelPlanner as an Example", "paper_summary": "Large language models (LLMs) have brought autonomous agents closer to\nartificial general intelligence (AGI) due to their promising generalization and\nemergent capabilities. There is, however, a lack of studies on how LLM-based\nagents behave, why they could potentially fail, and how to improve them,\nparticularly in demanding real-world planning tasks. In this paper, as an\neffort to fill the gap, we present our study using a realistic benchmark,\nTravelPlanner, where an agent must meet multiple constraints to generate\naccurate plans. We leverage this benchmark to address four key research\nquestions: (1) are LLM agents robust enough to lengthy and noisy contexts when\nit comes to reasoning and planning? (2) can few-shot prompting adversely impact\nthe performance of LLM agents in scenarios with long context? (3) can we rely\non refinement to improve plans, and (4) can fine-tuning LLMs with both positive\nand negative feedback lead to further improvement? Our comprehensive\nexperiments indicate that, firstly, LLMs often fail to attend to crucial parts\nof a long context, despite their ability to handle extensive reference\ninformation and few-shot examples; secondly, they still struggle with analyzing\nthe long plans and cannot provide accurate feedback for refinement; thirdly, we\npropose Feedback-Aware Fine-Tuning (FAFT), which leverages both positive and\nnegative feedback, resulting in substantial gains over Supervised Fine-Tuning\n(SFT). Our findings offer in-depth insights to the community on various aspects\nrelated to real-world planning applications.", "paper_summary_zh": "大型語言模型 (LLM) 由於其令人期待的概括和新興能力，讓自主代理更接近於人工通用智能 (AGI)。然而，對於 LLM 基礎代理的行為方式、潛在失敗原因以及如何改進它們的研究卻有所欠缺，尤其是在要求嚴格的真實世界規劃任務中。在本文中，我們提出使用現實基準 TravelPlanner 的研究，作為填補空白的努力，其中代理必須滿足多項約束才能產生準確的計畫。我們利用此基準來解決四個關鍵研究問題：(1) 在推理和規劃方面，LLM 代理是否足夠健全，足以應對冗長且嘈雜的背景？(2) 在具有長背景的場景中，少次提示是否會對 LLM 代理的效能產生負面影響？(3) 我們是否可以依賴精進來改善計畫？(4) 使用正面和負面回饋微調 LLM 是否能進一步改善？我們的綜合實驗表明，首先，儘管 LLM 能夠處理廣泛的參考資訊和少次範例，但它們經常無法關注長背景的關鍵部分；其次，它們仍然難以分析長計畫，無法提供準確的回饋以供精進；第三，我們提出回饋感知微調 (FAFT)，它利用正面和負面回饋，產生優於監督式微調 (SFT) 的實質收益。我們的發現為社群提供深入的見解，涵蓋與現實世界規劃應用相關的各個方面。", "author": "Yanan Chen et.al.", "authors": "Yanan Chen, Ali Pesaranghader, Tanmana Sadhu, Dong Hoon Yi", "id": "2408.06318v1", "paper_url": "http://arxiv.org/abs/2408.06318v1", "repo": "null"}}