{"2411.10163": {"publish_time": "2024-11-15", "title": "Compound-QA: A Benchmark for Evaluating LLMs on Compound Questions", "paper_summary": "Large language models (LLMs) demonstrate remarkable performance across\nvarious tasks, prompting researchers to develop diverse evaluation benchmarks.\nHowever, existing benchmarks typically measure the ability of LLMs to respond\nto individual questions, neglecting the complex interactions in real-world\napplications. In this paper, we introduce Compound Question Synthesis (CQ-Syn)\nto create the Compound-QA benchmark, focusing on compound questions with\nmultiple sub-questions. This benchmark is derived from existing QA datasets,\nannotated with proprietary LLMs and verified by humans for accuracy. It\nencompasses five categories: Factual-Statement, Cause-and-Effect,\nHypothetical-Analysis, Comparison-and-Selection, and Evaluation-and-Suggestion.\nIt evaluates the LLM capability in terms of three dimensions including\nunderstanding, reasoning, and knowledge. Our assessment of eight open-source\nLLMs using Compound-QA reveals distinct patterns in their responses to compound\nquestions, which are significantly poorer than those to non-compound questions.\nAdditionally, we investigate various methods to enhance LLMs performance on\ncompound questions. The results indicate that these approaches significantly\nimprove the models' comprehension and reasoning abilities on compound\nquestions.", "paper_summary_zh": "大型語言模型 (LLM) 在各種任務中展現出顯著的效能，促使研究人員開發多元的評量基準。不過，現有的基準通常測量 LLM 回應個別問題的能力，忽略了真實世界應用中的複雜互動。在本文中，我們介紹複合問題合成 (CQ-Syn) 來建立複合式問答基準，重點在於具有多個子問題的複合式問題。此基準來自現有的問答資料集，由專有的 LLM 加上註解，並由人類驗證其準確性。它包含五個類別：事實陳述、因果關係、假設分析、比較與選擇，以及評估與建議。它在理解、推理和知識等三個面向評估 LLM 的能力。我們使用複合式問答評估八個開源 LLM，揭露它們在回應複合式問題時的不同模式，顯著低於非複合式問題的模式。此外，我們探討各種方法來增強 LLM 在複合式問題上的效能。結果顯示，這些方法顯著改善模型在複合式問題上的理解和推理能力。", "author": "Yutao Hou et.al.", "authors": "Yutao Hou, Yajing Luo, Zhiwen Ruan, Hongru Wang, Weifeng Ge, Yun Chen, Guanhua Chen", "id": "2411.10163v1", "paper_url": "http://arxiv.org/abs/2411.10163v1", "repo": "null"}}