{"2412.15510": {"publish_time": "2024-12-20", "title": "ADEQA: A Question Answer based approach for joint ADE-Suspect Extraction using Sequence-To-Sequence Transformers", "paper_summary": "Early identification of Adverse Drug Events (ADE) is critical for taking\nprompt actions while introducing new drugs into the market. These ADEs\ninformation are available through various unstructured data sources like\nclinical study reports, patient health records, social media posts, etc.\nExtracting ADEs and the related suspect drugs using machine learning is a\nchallenging task due to the complex linguistic relations between drug ADE pairs\nin textual data and unavailability of large corpus of labelled datasets. This\npaper introduces ADEQA, a question-answer(QA) based approach using quasi\nsupervised labelled data and sequence-to-sequence transformers to extract ADEs,\ndrug suspects and the relationships between them. Unlike traditional QA models,\nnatural language generation (NLG) based models don't require extensive token\nlevel labelling and thereby reduces the adoption barrier significantly. On a\npublic ADE corpus, we were able to achieve state-of-the-art results with an F1\nscore of 94% on establishing the relationships between ADEs and the respective\nsuspects.", "paper_summary_zh": "早期辨識不良藥物事件 (ADE) 對於在將新藥品推向市場時採取迅速行動至關重要。這些 ADE 資訊可透過各種非結構化資料來源取得，例如臨床研究報告、病人健康紀錄、社群媒體貼文等。由於文字資料中藥物 ADE 配對之間的語言關係複雜，且缺乏大量的標籤資料集，因此使用機器學習萃取 ADE 及相關可疑藥物是一項艱鉅的任務。本文介紹 ADEQA，一種基於問答 (QA) 的方法，使用擬監督標籤資料和序列對序列轉換器來萃取 ADE、可疑藥物及其之間的關係。與傳統的 QA 模型不同，基於自然語言生成 (NLG) 的模型不需要廣泛的代幣級標籤，從而大幅降低採用門檻。在一個公開的 ADE 語料庫上，我們在建立 ADE 和各自可疑藥物之間的關係方面達到了最先進的結果，F1 分數為 94%。", "author": "Vinayak Arannil et.al.", "authors": "Vinayak Arannil, Tomal Deb, Atanu Roy", "id": "2412.15510v1", "paper_url": "http://arxiv.org/abs/2412.15510v1", "repo": "null"}}