{"2407.05714": {"publish_time": "2024-07-08", "title": "Implementing a hybrid approach in a knowledge engineering process to manage technical advice relating to feedback from the operation of complex sensitive equipment", "paper_summary": "How can technical advice on operating experience feedback be managed\nefficiently in an organization that has never used knowledge engineering\ntechniques and methods? This article explains how an industrial company in the\nnuclear and defense sectors adopted such an approach, adapted to its \"TA KM\"\norganizational context and falls within the ISO30401 framework, to build a\ncomplete system with a \"SARBACANES\" application to support its business\nprocesses and perpetuate its know-how and expertise in a knowledge base. Over\nand above the classic transfer of knowledge between experts and business\nspecialists, SARBACANES also reveals the ability of this type of engineering to\ndeliver multi-functional operation. Modeling was accelerated by the use of a\ntool adapted to this type of operation: the Ardans Knowledge Maker platform.", "paper_summary_zh": "如何有效管理從未使用知識工程技術和方法的組織中關於運營經驗回饋的技術建議？本文說明了核能和國防領域的產業公司如何採用這種方法，並適應其「TA KM」組織背景，並符合 ISO30401 架構，建立一個完整的系統，使用「SARBACANES」應用程式來支援其業務流程，並在知識庫中延續其知識和專業技術。除了專家和業務專家之間的經典知識傳遞之外，SARBACANES 還揭示了這種工程提供多功能運作的能力。透過使用適用於這種運作類型（Ardans Knowledge Maker 平台）的工具，加速了模型化。", "author": "Alain Claude Hervé Berger et.al.", "authors": "Alain Claude Hervé Berger, Sébastien Boblet, Thierry Cartié, Jean-Pierre Cotton, François Vexler", "id": "2407.05714v1", "paper_url": "http://arxiv.org/abs/2407.05714v1", "repo": "null"}}