{"2405.10625": {"publish_time": "2024-05-17", "title": "Specialising and Analysing Instruction-Tuned and Byte-Level Language Models for Organic Reaction Prediction", "paper_summary": "Transformer-based encoder-decoder models have demonstrated impressive results\nin chemical reaction prediction tasks. However, these models typically rely on\npretraining using tens of millions of unlabelled molecules, which can be\ntime-consuming and GPU-intensive. One of the central questions we aim to answer\nin this work is: Can FlanT5 and ByT5, the encode-decoder models pretrained\nsolely on language data, be effectively specialised for organic reaction\nprediction through task-specific fine-tuning? We conduct a systematic empirical\nstudy on several key issues of the process, including tokenisation, the impact\nof (SMILES-oriented) pretraining, fine-tuning sample efficiency, and decoding\nalgorithms at inference. Our key findings indicate that although being\npretrained only on language tasks, FlanT5 and ByT5 provide a solid foundation\nto fine-tune for reaction prediction, and thus become `chemistry domain\ncompatible' in the process. This suggests that GPU-intensive and expensive\npretraining on a large dataset of unlabelled molecules may be useful yet not\nessential to leverage the power of language models for chemistry. All our\nmodels achieve comparable Top-1 and Top-5 accuracy although some variation\nacross different models does exist. Notably, tokenisation and vocabulary\ntrimming slightly affect final performance but can speed up training and\ninference; The most efficient greedy decoding strategy is very competitive\nwhile only marginal gains can be achieved from more sophisticated decoding\nalgorithms. In summary, we evaluate FlanT5 and ByT5 across several dimensions\nand benchmark their impact on organic reaction prediction, which may guide more\neffective use of these state-of-the-art language models for chemistry-related\ntasks in the future.", "paper_summary_zh": "<paragraph>基於 Transformer 的編碼器-解碼器模型已在化學反應預測任務中展現令人印象深刻的成果。然而，這些模型通常依賴於使用數千萬個未標記分子的預訓練，這會耗時且耗費 GPU 資源。我們在這項工作中旨在回答的中心問題之一是：僅在語言資料上預訓練的編碼器-解碼器模型 FlanT5 和 ByT5，是否能透過特定任務的微調，有效地專門用於有機反應預測？我們對這個過程的幾個關鍵問題進行了系統性的實證研究，包括標記化、（面向 SMILES 的）預訓練、微調樣本效率和推理中的解碼演算法。我們的關鍵發現表明，儘管僅在語言任務上預訓練，FlanT5 和 ByT5 為反應預測的微調提供了穩固的基礎，因此在這個過程中變得「相容於化學領域」。這表明在大量的未標記分子資料集上進行耗費 GPU 資源且昂貴的預訓練可能很有用，但對於發揮語言模型在化學上的能力並非必要。儘管不同模型之間確實存在一些差異，但我們所有的模型都達到了相當的 Top-1 和 Top-5 準確率。值得注意的是，標記化和詞彙修剪會輕微影響最終效能，但可以加速訓練和推理；最有效率的貪婪解碼策略極具競爭力，而更精密的解碼演算法只能獲得邊際收益。總之，我們在幾個面向評估 FlanT5 和 ByT5，並評估它們對有機反應預測的影響，這可能有助於在未來更有效地使用這些最先進的語言模型來執行與化學相關的任務。</paragraph>", "author": "Jiayun Pang et.al.", "authors": "Jiayun Pang, Ivan Vulić", "id": "2405.10625v1", "paper_url": "http://arxiv.org/abs/2405.10625v1", "repo": "null"}}