{"2412.07220": {"publish_time": "2024-12-10", "title": "Comateformer: Combined Attention Transformer for Semantic Sentence Matching", "paper_summary": "The Transformer-based model have made significant strides in semantic\nmatching tasks by capturing connections between phrase pairs. However, to\nassess the relevance of sentence pairs, it is insufficient to just examine the\ngeneral similarity between the sentences. It is crucial to also consider the\ntiny subtleties that differentiate them from each other. Regrettably, attention\nsoftmax operations in transformers tend to miss these subtle differences. To\nthis end, in this work, we propose a novel semantic sentence matching model\nnamed Combined Attention Network based on Transformer model (Comateformer). In\nComateformer model, we design a novel transformer-based quasi-attention\nmechanism with compositional properties. Unlike traditional attention\nmechanisms that merely adjust the weights of input tokens, our proposed method\nlearns how to combine, subtract, or resize specific vectors when building a\nrepresentation. Moreover, our proposed approach builds on the intuition of\nsimilarity and dissimilarity (negative affinity) when calculating dual affinity\nscores. This allows for a more meaningful representation of relationships\nbetween sentences. To evaluate the performance of our proposed model, we\nconducted extensive experiments on ten public real-world datasets and\nrobustness testing. Experimental results show that our method achieves\nconsistent improvements.", "paper_summary_zh": "基於 Transformer 模型的 Transformer 模型在語義配對任務中取得了重大進展，方法是擷取詞組對之間的關聯。然而，要評估句子對的相關性，僅檢查句子之間的一般相似性是不夠的。考慮使它們彼此區別開來的細微差別也至關重要。遺憾的是，Transformer中的注意力 softmax 運算往往會遺漏這些細微的差異。為此，在這項工作中，我們提出了一個名為基於 Transformer 模型的組合注意力網路（Comateformer）的新型語義句子匹配模型。在 Comateformer 模型中，我們設計了一種新穎的基於 Transformer 的準注意力機制，具有組合特性。與僅調整輸入標記權重的傳統注意力機制不同，我們提出的方法學習如何在建立表示時組合、減去或調整特定向量的大小。此外，我們提出的方法建立在計算雙重親和分數時相似性和相異性（負親和性）的直覺上。這允許對句子之間的關係進行更有意義的表示。為了評估我們提出的模型的效能，我們對十個公共真實世界資料集和穩健性測試進行了廣泛的實驗。實驗結果表明，我們的方法取得了一致的進步。", "author": "Bo Li et.al.", "authors": "Bo Li, Di Liang, Zixin Zhang", "id": "2412.07220v1", "paper_url": "http://arxiv.org/abs/2412.07220v1", "repo": "null"}}