{"2502.04794": {"publish_time": "2025-02-07", "title": "MedMimic: Physician-Inspired Multimodal Fusion for Early Diagnosis of Fever of Unknown Origin", "paper_summary": "Fever of unknown origin FUO remains a diagnostic challenge. MedMimic is\nintroduced as a multimodal framework inspired by real-world diagnostic\nprocesses. It uses pretrained models such as DINOv2, Vision Transformer, and\nResNet-18 to convert high-dimensional 18F-FDG PET/CT imaging into\nlow-dimensional, semantically meaningful features. A learnable\nself-attention-based fusion network then integrates these imaging features with\nclinical data for classification. Using 416 FUO patient cases from Sichuan\nUniversity West China Hospital from 2017 to 2023, the multimodal fusion\nclassification network MFCN achieved macro-AUROC scores ranging from 0.8654 to\n0.9291 across seven tasks, outperforming conventional machine learning and\nsingle-modality deep learning methods. Ablation studies and five-fold\ncross-validation further validated its effectiveness. By combining the\nstrengths of pretrained large models and deep learning, MedMimic offers a\npromising solution for disease classification.", "paper_summary_zh": "發燒成因不明（FUO）仍是診斷上的挑戰。MedMimic 被引入作為一個多模態框架，靈感來自於真實世界的診斷過程。它使用預訓練模型，例如 DINOv2、Vision Transformer 和 ResNet-18，將高維 18F-FDG PET/CT 影像轉換為低維、語義有意義的特徵。一個可學習的基於自注意力機制的融合網路接著整合這些影像特徵與臨床資料以進行分類。使用 2017 年至 2023 年間四川大學華西醫院的 416 個 FUO 病患案例，多模態融合分類網路 MFCN 在七項任務中達成 0.8654 至 0.9291 的巨觀 AUROC 分數，優於傳統機器學習和單一模態深度學習方法。消融研究和五倍交叉驗證進一步驗證了其有效性。MedMimic 結合了預訓練大型模型和深度學習的優點，為疾病分類提供了一個有前景的解決方案。", "author": "Minrui Chen et.al.", "authors": "Minrui Chen, Yi Zhou, Huidong Jiang, Yuhan Zhu, Guanjie Zou, Minqi Chen, Rong Tian, Hiroto Saigo", "id": "2502.04794v2", "paper_url": "http://arxiv.org/abs/2502.04794v2", "repo": "null"}}