{"2502.15212": {"publish_time": "2025-02-21", "title": "Measuring AI agent autonomy: Towards a scalable approach with code inspection", "paper_summary": "AI agents are AI systems that can achieve complex goals autonomously.\nAssessing the level of agent autonomy is crucial for understanding both their\npotential benefits and risks. Current assessments of autonomy often focus on\nspecific risks and rely on run-time evaluations -- observations of agent\nactions during operation. We introduce a code-based assessment of autonomy that\neliminates the need to run an AI agent to perform specific tasks, thereby\nreducing the costs and risks associated with run-time evaluations. Using this\ncode-based framework, the orchestration code used to run an AI agent can be\nscored according to a taxonomy that assesses attributes of autonomy: impact and\noversight. We demonstrate this approach with the AutoGen framework and select\napplications.", "paper_summary_zh": "AI 代理是可自主達成複雜目標的 AI 系統。\n評估代理自主性等級對於了解其潛在利益和風險至關重要。當前的自主性評估通常關注特定風險，並依賴於執行時期評估，也就是在操作期間觀察代理動作。我們引入一種基於程式碼的自主性評估，消除了執行 AI 代理以執行特定任務的需要，從而降低了與執行時期評估相關的成本和風險。使用這個基於程式碼的架構，用於執行 AI 代理的編排程式碼可以根據評估自主性屬性的分類法進行評分：影響和監督。我們使用 AutoGen 架構和選定應用程式展示這種方法。", "author": "Peter Cihon et.al.", "authors": "Peter Cihon, Merlin Stein, Gagan Bansal, Sam Manning, Kevin Xu", "id": "2502.15212v1", "paper_url": "http://arxiv.org/abs/2502.15212v1", "repo": "null"}}