{"2412.19139": {"publish_time": "2024-12-26", "title": "PlanLLM: Video Procedure Planning with Refinable Large Language Models", "paper_summary": "Video procedure planning, i.e., planning a sequence of action steps given the\nvideo frames of start and goal states, is an essential ability for embodied AI.\nRecent works utilize Large Language Models (LLMs) to generate enriched action\nstep description texts to guide action step decoding. Although LLMs are\nintroduced, these methods decode the action steps into a closed-set of one-hot\nvectors, limiting the model's capability of generalizing to new steps or tasks.\nAdditionally, fixed action step descriptions based on world-level commonsense\nmay contain noise in specific instances of visual states. In this paper, we\npropose PlanLLM, a cross-modal joint learning framework with LLMs for video\nprocedure planning. We propose an LLM-Enhanced Planning module which fully uses\nthe generalization ability of LLMs to produce free-form planning output and to\nenhance action step decoding. We also propose Mutual Information Maximization\nmodule to connect world-level commonsense of step descriptions and\nsample-specific information of visual states, enabling LLMs to employ the\nreasoning ability to generate step sequences. With the assistance of LLMs, our\nmethod can both closed-set and open vocabulary procedure planning tasks. Our\nPlanLLM achieves superior performance on three benchmarks, demonstrating the\neffectiveness of our designs.", "paper_summary_zh": "影片程序規劃，即給定開始和目標狀態的影片畫格，規劃一系列動作步驟，是具象人工智慧的基本能力。最近的作品利用大型語言模型 (LLM) 來產生豐富的動作步驟描述文字，以引導動作步驟解碼。儘管引入了 LLM，這些方法會將動作步驟解碼成封閉集合的一熱向量，限制了模型對新步驟或任務進行概括的能力。此外，基於世界級常理的固定動作步驟描述可能包含特定視覺狀態實例中的雜訊。在本文中，我們提出 PlanLLM，一種具有 LLM 的跨模態聯合學習架構，用於影片程序規劃。我們提出一個 LLM 增強規劃模組，充分利用 LLM 的概括能力來產生自由形式的規劃輸出，並增強動作步驟解碼。我們還提出互資訊最大化模組，將步驟描述的世界級常理與視覺狀態的樣本特定資訊連接起來，使 LLM 能夠運用推理能力來產生步驟序列。在 LLM 的協助下，我們的模型可以同時執行封閉集合和開放詞彙程序規劃任務。我們的 PlanLLM 在三個基準上取得了優異的效能，證明了我們設計的有效性。", "author": "Dejie Yang et.al.", "authors": "Dejie Yang, Zijing Zhao, YangLiu", "id": "2412.19139v1", "paper_url": "http://arxiv.org/abs/2412.19139v1", "repo": "https://github.com/idejie/planllm"}}