{"2405.19266": {"publish_time": "2024-05-29", "title": "PediatricsGPT: Large Language Models as Chinese Medical Assistants for Pediatric Applications", "paper_summary": "Developing intelligent pediatric consultation systems offers promising\nprospects for improving diagnostic efficiency, especially in China, where\nhealthcare resources are scarce. Despite recent advances in Large Language\nModels (LLMs) for Chinese medicine, their performance is sub-optimal in\npediatric applications due to inadequate instruction data and vulnerable\ntraining procedures. To address the above issues, this paper builds PedCorpus,\na high-quality dataset of over 300,000 multi-task instructions from pediatric\ntextbooks, guidelines, and knowledge graph resources to fulfil diverse\ndiagnostic demands. Upon well-designed PedCorpus, we propose PediatricsGPT, the\nfirst Chinese pediatric LLM assistant built on a systematic and robust training\npipeline. In the continuous pre-training phase, we introduce a hybrid\ninstruction pre-training mechanism to mitigate the internal-injected knowledge\ninconsistency of LLMs for medical domain adaptation. Immediately, the\nfull-parameter Supervised Fine-Tuning (SFT) is utilized to incorporate the\ngeneral medical knowledge schema into the models. After that, we devise a\ndirect following preference optimization to enhance the generation of\npediatrician-like humanistic responses. In the parameter-efficient secondary\nSFT phase, a mixture of universal-specific experts strategy is presented to\nresolve the competency conflict between medical generalist and pediatric\nexpertise mastery. Extensive results based on the metrics, GPT-4, and doctor\nevaluations on distinct doctor downstream tasks show that PediatricsGPT\nconsistently outperforms previous Chinese medical LLMs. Our model and dataset\nwill be open-source for community development.", "paper_summary_zh": "<paragraph>開發智能兒科諮詢系統，能有效提升診斷效率，特別是在醫療資源相對缺乏的中國。儘管中文醫學的大語言模型（LLM）近來有長足進展，但由於訓練資料不足且訓練程序不完善，其在兒科應用中的表現並未達到最佳化。為了解決上述問題，本文建立了 PedCorpus，一個包含超過 30 萬條來自兒科教科書、指南和知識圖譜資源的多任務指令的高品質資料集，以滿足多樣化的診斷需求。在設計良好的 PedCorpus 上，我們提出了 PediatricsGPT，這是第一個建構在系統化且穩健的訓練流程上的中文兒科 LLM 助理。在持續的預訓練階段，我們引入了一個混合指令預訓練機制，以減輕 LLM 在醫學領域適應時內部注入知識的不一致性。緊接著，我們利用全參數監督微調（SFT）將一般的醫學知識架構納入模型中。隨後，我們設計了一個直接遵循偏好最佳化，以增強類兒科醫師的人文回應生成。在參數效率的次要 SFT 階段，我們提出了一個通用專家策略的混合，以解決全科醫師和兒科專家掌握能力之間的衝突。根據 GPT-4、醫生評估在不同醫生下游任務上的指標，廣泛的結果顯示 PediatricsGPT 持續優於先前的中文醫學 LLM。我們的模型和資料集將開放原始碼供社群開發。</paragraph>", "author": "Dingkang Yang et.al.", "authors": "Dingkang Yang, Jinjie Wei, Dongling Xiao, Shunli Wang, Tong Wu, Gang Li, Mingcheng Li, Shuaibing Wang, Jiawei Chen, Yue Jiang, Qingyao Xu, Ke Li, Peng Zhai, Lihua Zhang", "id": "2405.19266v2", "paper_url": "http://arxiv.org/abs/2405.19266v2", "repo": "null"}}