{"2408.03010": {"publish_time": "2024-08-06", "title": "Fact Finder -- Enhancing Domain Expertise of Large Language Models by Incorporating Knowledge Graphs", "paper_summary": "Recent advancements in Large Language Models (LLMs) have showcased their\nproficiency in answering natural language queries. However, their effectiveness\nis hindered by limited domain-specific knowledge, raising concerns about the\nreliability of their responses. We introduce a hybrid system that augments LLMs\nwith domain-specific knowledge graphs (KGs), thereby aiming to enhance factual\ncorrectness using a KG-based retrieval approach. We focus on a medical KG to\ndemonstrate our methodology, which includes (1) pre-processing, (2) Cypher\nquery generation, (3) Cypher query processing, (4) KG retrieval, and (5)\nLLM-enhanced response generation. We evaluate our system on a curated dataset\nof 69 samples, achieving a precision of 78\\% in retrieving correct KG nodes.\nOur findings indicate that the hybrid system surpasses a standalone LLM in\naccuracy and completeness, as verified by an LLM-as-a-Judge evaluation method.\nThis positions the system as a promising tool for applications that demand\nfactual correctness and completeness, such as target identification -- a\ncritical process in pinpointing biological entities for disease treatment or\ncrop enhancement. Moreover, its intuitive search interface and ability to\nprovide accurate responses within seconds make it well-suited for\ntime-sensitive, precision-focused research contexts. We publish the source code\ntogether with the dataset and the prompt templates used.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展展示了它們在回答自然語言查詢方面的能力。然而，它們的有效性受到特定領域知識有限的阻礙，這引起了對其回應可靠性的擔憂。我們引入了一個混合系統，該系統使用特定領域的知識圖譜 (KG) 來擴充 LLM，從而旨在使用基於 KG 的檢索方法來增強事實正確性。我們專注於一個醫學 KG 來演示我們的 methodology，其中包括 (1) 預處理，(2) Cypher 查詢生成，(3) Cypher 查詢處理，(4) KG 檢索，以及 (5) LLM 增強的回應生成。我們在一個由 69 個樣本組成的精選數據集上評估我們的系統，在檢索正確的 KG 節點時達到了 78% 的精度。我們的研究結果表明，混合系統在準確性和完整性方面都超過了單獨的 LLM，這通過 LLM 作為評審評估方法得到驗證。這將系統定位為對應用程式來說一個有前途的工具，這些應用程式需要事實正確性和完整性，例如目標識別——在疾病治療或作物改良中精確定位生物實體的關鍵過程。此外，其直觀的搜尋介面和在數秒內提供準確回應的能力使其非常適合時間敏感、注重精確度的研究情境。我們將原始碼與數據集和使用的提示範本一起發布。", "author": "Daniel Steinigen et.al.", "authors": "Daniel Steinigen, Roman Teucher, Timm Heine Ruland, Max Rudat, Nicolas Flores-Herr, Peter Fischer, Nikola Milosevic, Christopher Schymura, Angelo Ziletti", "id": "2408.03010v1", "paper_url": "http://arxiv.org/abs/2408.03010v1", "repo": "null"}}