{"2412.00478": {"publish_time": "2024-11-30", "title": "Node Importance Estimation Leveraging LLMs for Semantic Augmentation in Knowledge Graphs", "paper_summary": "Node Importance Estimation (NIE) is a task that quantifies the importance of\nnode in a graph. Recent research has investigated to exploit various\ninformation from Knowledge Graphs (KGs) to estimate node importance scores.\nHowever, the semantic information in KGs could be insufficient, missing, and\ninaccurate, which would limit the performance of existing NIE models. To\naddress these issues, we leverage Large Language Models (LLMs) for semantic\naugmentation thanks to the LLMs' extra knowledge and ability of integrating\nknowledge from both LLMs and KGs. To this end, we propose the LLMs Empowered\nNode Importance Estimation (LENIE) method to enhance the semantic information\nin KGs for better supporting NIE tasks. To our best knowledge, this is the\nfirst work incorporating LLMs into NIE. Specifically, LENIE employs a novel\nclustering-based triplet sampling strategy to extract diverse knowledge of a\nnode sampled from the given KG. After that, LENIE adopts the node-specific\nadaptive prompts to integrate the sampled triplets and the original node\ndescriptions, which are then fed into LLMs for generating richer and more\nprecise augmented node descriptions. These augmented descriptions finally\ninitialize node embeddings for boosting the downstream NIE model performance.\nExtensive experiments demonstrate LENIE's effectiveness in addressing semantic\ndeficiencies in KGs, enabling more informative semantic augmentation and\nenhancing existing NIE models to achieve the state-of-the-art performance. The\nsource code of LENIE is freely available at\n\\url{https://github.com/XinyuLin-FZ/LENIE}.", "paper_summary_zh": "節點重要性估計 (NIE) 是一項量化圖中節點重要性的任務。最近的研究已調查利用知識圖譜 (KG) 中的各種資訊來估計節點重要性分數。然而，KG 中的語義資訊可能不足、遺失且不準確，這將限制現有 NIE 模型的效能。為了解決這些問題，我們利用大型語言模型 (LLM) 進行語義增強，這要歸功於 LLM 的額外知識和整合 LLM 和 KG 中知識的能力。為此，我們提出 LLM 強化節點重要性估計 (LENIE) 方法，以增強 KG 中的語義資訊，以便更好地支援 NIE 任務。據我們所知，這是將 LLM 納入 NIE 的第一項工作。具體來說，LENIE 採用新穎的基於群集的三元組取樣策略，以萃取從給定 KG 取樣的節點的多元知識。在那之後，LENIE 採用特定於節點的自適應提示，以整合取樣的三元組和原始節點描述，然後將它們輸入 LLM 以產生更豐富且更精確的增強節點描述。這些增強的描述最終初始化節點嵌入，以提升下游 NIE 模型效能。廣泛的實驗證明了 LENIE 在解決 KG 中的語義缺陷方面的有效性，實現更多資訊性的語義增強，並增強現有的 NIE 模型以達成最先進的效能。LENIE 的原始程式碼可於\\url{https://github.com/XinyuLin-FZ/LENIE} 免費取得。", "author": "Xinyu Lin et.al.", "authors": "Xinyu Lin, Tianyu Zhang, Chengbin Hou, Jinbao Wang, Jianye Xue, Hairong Lv", "id": "2412.00478v1", "paper_url": "http://arxiv.org/abs/2412.00478v1", "repo": "https://github.com/xinyulin-fz/lenie"}}