{"2410.22597": {"publish_time": "2024-10-29", "title": "Are Large-Language Models Graph Algorithmic Reasoners?", "paper_summary": "We seek to address a core challenge facing current Large Language Models\n(LLMs). LLMs have demonstrated superior performance in many tasks, yet continue\nto struggle with reasoning problems on explicit graphs that require multiple\nsteps. To address this gap, we introduce a novel benchmark designed to evaluate\nLLM performance on classical algorithmic reasoning tasks on explicit graphs.\nOur benchmark encompasses five fundamental algorithms: Breadth-First Search\n(BFS) and Depth-First Search (DFS) for connectivity, Dijkstra's algorithm and\nFloyd-Warshall algorithm for all nodes shortest path, and Prim's Minimum\nSpanning Tree (MST-Prim's) algorithm. Through extensive experimentation, we\nassess the capabilities of state-of-the-art LLMs in executing these algorithms\nstep-by-step and systematically evaluate their performance at each stage. Our\nfindings highlight the persistent challenges LLMs face in this domain and\nunderscore the necessity for advanced prompting techniques and algorithmic\ninstruction to enhance their graph reasoning abilities. This work presents\nMAGMA, the first comprehensive benchmark focused on LLMs completing classical\ngraph algorithms, and provides a critical step toward understanding and\nimproving their structured problem-solving skills.", "paper_summary_zh": "我們試圖解決當前大型語言模型 (LLM) 面臨的核心挑戰。LLM 在許多任務中表現出優異的性能，但仍難以應對需要多個步驟的明確圖表中的推理問題。為了解決這個差距，我們引入了一個新的基準，用於評估 LLM 在明確圖表上的經典演算法推理任務上的性能。我們的基準包含五個基本演算法：廣度優先搜尋 (BFS) 和深度優先搜尋 (DFS) 以進行連通性、Dijkstra 演算法和 Floyd-Warshall 演算法以找出所有節點的最短路徑，以及 Prim 最小生成樹 (MST-Prim) 演算法。透過廣泛的實驗，我們評估了最先進的 LLM 在逐步執行這些演算法的能力，並系統性地評估它們在每個階段的性能。我們的研究結果突出了 LLM 在這個領域面臨的持續挑戰，並強調了使用進階提示技術和演算法指令來增強其圖形推理能力的必要性。這項工作提出了 MAGMA，這是第一個專注於 LLM 完成經典圖形演算法的綜合基準，並為了解和改進其結構化問題解決技能提供了關鍵的一步。", "author": "Alexander K Taylor et.al.", "authors": "Alexander K Taylor, Anthony Cuturrufo, Vishal Yathish, Mingyu Derek Ma, Wei Wang", "id": "2410.22597v1", "paper_url": "http://arxiv.org/abs/2410.22597v1", "repo": "null"}}