{"2409.19401": {"publish_time": "2024-09-28", "title": "Crafting Personalized Agents through Retrieval-Augmented Generation on Editable Memory Graphs", "paper_summary": "In the age of mobile internet, user data, often referred to as memories, is\ncontinuously generated on personal devices. Effectively managing and utilizing\nthis data to deliver services to users is a compelling research topic. In this\npaper, we introduce a novel task of crafting personalized agents powered by\nlarge language models (LLMs), which utilize a user's smartphone memories to\nenhance downstream applications with advanced LLM capabilities. To achieve this\ngoal, we introduce EMG-RAG, a solution that combines Retrieval-Augmented\nGeneration (RAG) techniques with an Editable Memory Graph (EMG). This approach\nis further optimized using Reinforcement Learning to address three distinct\nchallenges: data collection, editability, and selectability. Extensive\nexperiments on a real-world dataset validate the effectiveness of EMG-RAG,\nachieving an improvement of approximately 10% over the best existing approach.\nAdditionally, the personalized agents have been transferred into a real\nsmartphone AI assistant, which leads to enhanced usability.", "paper_summary_zh": "在行動網路時代，使用者資料（常稱為記憶）會持續在個人裝置上產生。有效管理並利用這些資料，為使用者提供服務，是一個引人入勝的研究主題。在本文中，我們介紹了一項創新的任務，即利用大型語言模型（LLM）打造個人化代理，利用使用者的智慧型手機記憶體，以進階 LLM 功能強化下游應用程式。為了達成這個目標，我們介紹了 EMG-RAG，一種結合檢索擴充生成（RAG）技術與可編輯記憶圖（EMG）的解決方案。這種方法進一步透過強化學習進行最佳化，以解決三個不同的挑戰：資料收集、可編輯性與可選擇性。在真實世界資料集上的廣泛實驗驗證了 EMG-RAG 的有效性，比現有最佳方法提升了約 10%。此外，個人化代理已轉移到真正的智慧型手機 AI 助理中，這提升了可用性。", "author": "Zheng Wang et.al.", "authors": "Zheng Wang, Zhongyang Li, Zeren Jiang, Dandan Tu, Wei Shi", "id": "2409.19401v1", "paper_url": "http://arxiv.org/abs/2409.19401v1", "repo": "null"}}