{"2406.07151": {"publish_time": "2024-06-11", "title": "EEG-ImageNet: An Electroencephalogram Dataset and Benchmarks with Image Visual Stimuli of Multi-Granularity Labels", "paper_summary": "Identifying and reconstructing what we see from brain activity gives us a\nspecial insight into investigating how the biological visual system represents\nthe world. While recent efforts have achieved high-performance image\nclassification and high-quality image reconstruction from brain signals\ncollected by Functional Magnetic Resonance Imaging (fMRI) or\nmagnetoencephalogram (MEG), the expensiveness and bulkiness of these devices\nmake relevant applications difficult to generalize to practical applications.\nOn the other hand, Electroencephalography (EEG), despite its advantages of ease\nof use, cost-efficiency, high temporal resolution, and non-invasive nature, has\nnot been fully explored in relevant studies due to the lack of comprehensive\ndatasets. To address this gap, we introduce EEG-ImageNet, a novel EEG dataset\ncomprising recordings from 16 subjects exposed to 4000 images selected from the\nImageNet dataset. EEG-ImageNet consists of 5 times EEG-image pairs larger than\nexisting similar EEG benchmarks. EEG-ImageNet is collected with image stimuli\nof multi-granularity labels, i.e., 40 images with coarse-grained labels and 40\nwith fine-grained labels. Based on it, we establish benchmarks for object\nclassification and image reconstruction. Experiments with several commonly used\nmodels show that the best models can achieve object classification with\naccuracy around 60% and image reconstruction with two-way identification around\n64%. These results demonstrate the dataset's potential to advance EEG-based\nvisual brain-computer interfaces, understand the visual perception of\nbiological systems, and provide potential applications in improving machine\nvisual models.", "paper_summary_zh": "<paragraph>透過辨識和重建我們從腦部活動所看到的，讓我們得以特別深入探究生物視覺系統如何呈現世界。雖然近期努力已從功能性磁振造影 (fMRI) 或腦磁圖 (MEG) 收集的腦部訊號中，達成高性能影像分類和高品質影像重建，但這些裝置的昂貴和笨重，使得相關應用難以推廣到實際應用。另一方面，腦波圖 (EEG) 雖然具有使用容易、成本效益高、時間解析度高和非侵入性等優點，但由於缺乏全面的資料集，尚未在相關研究中得到充分探討。為了解決這個差距，我們引入了 EEG-ImageNet，這是一個新穎的 EEG 資料集，包含來自 16 位受試者觀看從 ImageNet 資料集中挑選的 4000 張影像的記錄。EEG-ImageNet 包含比現有類似 EEG 基準大 5 倍的 EEG 影像對。EEG-ImageNet 是使用具有多粒度標籤的影像刺激收集的，即 40 張具有粗粒度標籤的影像和 40 張具有細粒度標籤的影像。基於此，我們建立了物件分類和影像重建的基準。使用幾個常用模型的實驗顯示，最佳模型可以在物件分類中達到約 60% 的準確度，在雙向辨識中達到約 64% 的影像重建。這些結果證明了該資料集在推動基於 EEG 的視覺腦電腦介面、了解生物系統的視覺感知，以及提供改善機器視覺模型的潛在應用方面的潛力。</paragraph>", "author": "Shuqi Zhu et.al.", "authors": "Shuqi Zhu, Ziyi Ye, Qingyao Ai, Yiqun Liu", "id": "2406.07151v1", "paper_url": "http://arxiv.org/abs/2406.07151v1", "repo": "https://github.com/promise-z5q2sq/eeg-imagenet-dataset"}}