{"2501.13397": {"publish_time": "2025-01-23", "title": "ExLM: Rethinking the Impact of $\\texttt{[MASK]}$ Tokens in Masked Language Models", "paper_summary": "Masked Language Models (MLMs) have achieved remarkable success in many\nself-supervised representation learning tasks. MLMs are trained by randomly\nreplacing some tokens in the input sentences with $\\texttt{[MASK]}$ tokens and\npredicting the original tokens based on the remaining context. This paper\nexplores the impact of $\\texttt{[MASK]}$ tokens on MLMs. Analytical studies\nshow that masking tokens can introduce the corrupted semantics problem, wherein\nthe corrupted context may convey multiple, ambiguous meanings. This problem is\nalso a key factor affecting the performance of MLMs on downstream tasks. Based\non these findings, we propose a novel enhanced-context MLM, ExLM. Our approach\nexpands $\\texttt{[MASK]}$ tokens in the input context and models the\ndependencies between these expanded states. This expansion increases context\ncapacity and enables the model to capture richer semantic information,\neffectively mitigating the corrupted semantics problem during pre-training.\nExperimental results demonstrate that ExLM achieves significant performance\nimprovements in both text modeling and SMILES modeling tasks. Further analysis\nconfirms that ExLM enhances semantic representations through context\nenhancement, and effectively reduces the multimodality problem commonly\nobserved in MLMs.", "paper_summary_zh": "蒙面語言模型（MLM）在許多自我監督表徵學習任務中取得顯著成功。MLM 的訓練方式是隨機用 [MASK] 標記取代輸入句子中的一些標記，並根據其餘的內容預測原始標記。本文探討了 [MASK] 標記對 MLM 的影響。分析研究顯示，遮蔽標記可能會引入語意損壞問題，其中損壞的內容可能會傳達多種含糊的意義。這個問題也是影響 MLM 在下游任務中表現的一個關鍵因素。根據這些發現，我們提出了一種新的增強內容 MLM，ExLM。我們的做法擴展了輸入內容中的 [MASK] 標記，並對這些擴展狀態之間的依賴關係進行建模。這種擴展增加了內容容量，並使模型能夠擷取更豐富的語義資訊，有效減輕預訓練期間的語意損壞問題。實驗結果證明，ExLM 在文本建模和 SMILES 建模任務中都取得了顯著的效能提升。進一步的分析證實，ExLM 透過內容增強來增強語義表徵，並有效減少了 MLM 中常見的多模態問題。", "author": "Kangjie Zheng et.al.", "authors": "Kangjie Zheng, Junwei Yang, Siyue Liang, Bin Feng, Zequn Liu, Wei Ju, Zhiping Xiao, Ming Zhang", "id": "2501.13397v1", "paper_url": "http://arxiv.org/abs/2501.13397v1", "repo": "null"}}