{"2405.17253": {"publish_time": "2024-05-27", "title": "Gaussian Embedding of Temporal Networks", "paper_summary": "Representing the nodes of continuous-time temporal graphs in a\nlow-dimensional latent space has wide-ranging applications, from prediction to\nvisualization. Yet, analyzing continuous-time relational data with timestamped\ninteractions introduces unique challenges due to its sparsity. Merely embedding\nnodes as trajectories in the latent space overlooks this sparsity, emphasizing\nthe need to quantify uncertainty around the latent positions. In this paper, we\npropose TGNE (\\textbf{T}emporal \\textbf{G}aussian \\textbf{N}etwork\n\\textbf{E}mbedding), an innovative method that bridges two distinct strands of\nliterature: the statistical analysis of networks via Latent Space Models\n(LSM)\\cite{Hoff2002} and temporal graph machine learning. TGNE embeds nodes as\npiece-wise linear trajectories of Gaussian distributions in the latent space,\ncapturing both structural information and uncertainty around the trajectories.\nWe evaluate TGNE's effectiveness in reconstructing the original graph and\nmodelling uncertainty. The results demonstrate that TGNE generates competitive\ntime-varying embedding locations compared to common baselines for\nreconstructing unobserved edge interactions based on observed edges.\nFurthermore, the uncertainty estimates align with the time-varying degree\ndistribution in the network, providing valuable insights into the temporal\ndynamics of the graph. To facilitate reproducibility, we provide an open-source\nimplementation of TGNE at \\url{https://github.com/aida-ugent/tgne}.", "paper_summary_zh": "表示連續時間時態圖形節點於低維潛在空間中具有廣泛的應用，從預測到可視化。然而，分析具有時間戳記交互作用的連續時間關係資料會因為其稀疏性而造成獨特的挑戰。僅將節點嵌入為潛在空間中的軌跡會忽略這種稀疏性，強調量化潛在位置周圍不確定性的必要性。在本文中，我們提出 TGNE（**T**emporal **G**aussian **N**etwork **E**mbedding），這是一種創新的方法，它架起了兩個不同的文獻流：通過潛在空間模型 (LSM) 進行的網路統計分析\\cite{Hoff2002}和時態圖形機器學習。TGNE 將節點嵌入為潛在空間中高斯分布的分段線性軌跡，擷取軌跡周圍的結構資訊和不確定性。我們評估 TGNE 在重建原始圖形和建模不確定性方面的有效性。結果表明，與根據觀察到的邊緣重建未觀察到的邊緣交互作用的常見基準線相比，TGNE 生成了具有競爭力的時變嵌入位置。此外，不確定性估計與網路中的時變度數分佈一致，提供了對圖形時態動態的寶貴見解。為了促進可複製性，我們在 \\url{https://github.com/aida-ugent/tgne} 提供 TGNE 的開源實作。", "author": "Raphaël Romero et.al.", "authors": "Raphaël Romero, Jefrey Lijffijt, Riccardo Rastelli, Marco Corneli, Tijl De Bie", "id": "2405.17253v1", "paper_url": "http://arxiv.org/abs/2405.17253v1", "repo": "https://github.com/aida-ugent/tgne"}}