{"2407.04293": {"publish_time": "2024-07-05", "title": "Systematic Evaluation of Online Speaker Diarization Systems Regarding their Latency", "paper_summary": "In this paper, different online speaker diarization systems are evaluated on\nthe same hardware with the same test data with regard to their latency. The\nlatency is the time span from audio input to the output of the corresponding\nspeaker label. As part of the evaluation, various model combinations within the\nDIART framework, a diarization system based on the online clustering algorithm\nUIS-RNN-SML, and the end-to-end online diarization system FS-EEND are compared.\nThe lowest latency is achieved for the DIART-pipeline with the embedding model\npyannote/embedding and the segmentation model pyannote/segmentation. The\nFS-EEND system shows a similarly good latency. In general there is currently no\npublished research that compares several online diarization systems in terms of\ntheir latency. This makes this work even more relevant.", "paper_summary_zh": "在本文中，在延遲方面，使用相同的硬體和相同的測試資料評估不同的線上說話者日記化系統。延遲是指從音訊輸入到對應說話者標籤輸出的時間範圍。作為評估的一部分，比較了線上聚類演算法 UIS-RNN-SML 為基礎的日記化系統 DIART 框架內的各種模型組合，以及端對端的線上日記化系統 FS-EEND。延遲最低的是採用嵌入模型 pyannote/embedding 和分段模型 pyannote/segmentation 的 DIART-pipeline。FS-EEND 系統展現出類似良好的延遲。一般來說，目前沒有已發表的針對延遲比較多個線上日記化系統的研究。這使得這項工作更具相關性。", "author": "Roman Aperdannier et.al.", "authors": "Roman Aperdannier, Sigurd Schacht, Alexander Piazza", "id": "2407.04293v1", "paper_url": "http://arxiv.org/abs/2407.04293v1", "repo": "null"}}