{"2412.11671": {"publish_time": "2024-12-16", "title": "BioBridge: Unified Bio-Embedding with Bridging Modality in Code-Switched EMR", "paper_summary": "Pediatric Emergency Department (PED) overcrowding presents a significant\nglobal challenge, prompting the need for efficient solutions. This paper\nintroduces the BioBridge framework, a novel approach that applies Natural\nLanguage Processing (NLP) to Electronic Medical Records (EMRs) in written\nfree-text form to enhance decision-making in PED. In non-English speaking\ncountries, such as South Korea, EMR data is often written in a Code-Switching\n(CS) format that mixes the native language with English, with most\ncode-switched English words having clinical significance. The BioBridge\nframework consists of two core modules: \"bridging modality in context\" and\n\"unified bio-embedding.\" The \"bridging modality in context\" module improves the\ncontextual understanding of bilingual and code-switched EMRs. In the \"unified\nbio-embedding\" module, the knowledge of the model trained in the medical domain\nis injected into the encoder-based model to bridge the gap between the medical\nand general domains. Experimental results demonstrate that the proposed\nBioBridge significantly performance traditional machine learning and\npre-trained encoder-based models on several metrics, including F1 score, area\nunder the receiver operating characteristic curve (AUROC), area under the\nprecision-recall curve (AUPRC), and Brier score. Specifically, BioBridge-XLM\nachieved enhancements of 0.85% in F1 score, 0.75% in AUROC, and 0.76% in AUPRC,\nalong with a notable 3.04% decrease in the Brier score, demonstrating marked\nimprovements in accuracy, reliability, and prediction calibration over the\nbaseline XLM model. The source code will be made publicly available.", "paper_summary_zh": "<paragraph>小兒急診部（PED）人滿為患是一個重大的全球性挑戰，促使我們需要找出有效率的解決方案。本文介紹 BioBridge 架構，這是一種創新的方法，將自然語言處理（NLP）應用於以自由文字形式撰寫的電子病歷（EMR），以增強在 PED 中的決策制定。在非英語系國家/地區（例如南韓），EMR 資料通常以代碼轉換（CS）格式撰寫，將母語與英語混合，而大多數代碼轉換的英語單字具有臨床意義。BioBridge 架構包含兩個核心模組：「語境中的橋接方式」和「統一生物嵌入」。「語境中的橋接方式」模組改善了雙語和代碼轉換 EMR 的語境理解。在「統一生物嵌入」模組中，將在醫療領域訓練的模型知識注入到基於編碼器的模型中，以彌合醫療和一般領域之間的差距。實驗結果證明，所提出的 BioBridge 在多項指標（包括 F1 分數、受試者操作特徵曲線下面積（AUROC）、精確度召回率曲線下面積（AUPRC）和布賴爾分數）上顯著優於傳統機器學習和預先訓練的基於編碼器的模型。具體來說，BioBridge-XLM 在 F1 分數上提升了 0.85%，在 AUROC 上提升了 0.75%，在 AUPRC 上提升了 0.76%，同時布賴爾分數顯著下降了 3.04%，證明在準確度、可靠性和預測校準方面，與基準 XLM 模型相比都有顯著的改善。原始碼將公開提供。</paragraph>", "author": "Jangyeong Jeon et.al.", "authors": "Jangyeong Jeon, Sangyeon Cho, Dongjoon Lee, Changhee Lee, Junyeong Kim", "id": "2412.11671v1", "paper_url": "http://arxiv.org/abs/2412.11671v1", "repo": "https://github.com/jjy961228/biobridge"}}