{"2409.06666": {"publish_time": "2024-09-10", "title": "LLaMA-Omni: Seamless Speech Interaction with Large Language Models", "paper_summary": "Models like GPT-4o enable real-time interaction with large language models\n(LLMs) through speech, significantly enhancing user experience compared to\ntraditional text-based interaction. However, there is still a lack of\nexploration on how to build speech interaction models based on open-source\nLLMs. To address this, we propose LLaMA-Omni, a novel model architecture\ndesigned for low-latency and high-quality speech interaction with LLMs.\nLLaMA-Omni integrates a pretrained speech encoder, a speech adaptor, an LLM,\nand a streaming speech decoder. It eliminates the need for speech\ntranscription, and can simultaneously generate text and speech responses\ndirectly from speech instructions with extremely low latency. We build our\nmodel based on the latest Llama-3.1-8B-Instruct model. To align the model with\nspeech interaction scenarios, we construct a dataset named InstructS2S-200K,\nwhich includes 200K speech instructions and corresponding speech responses.\nExperimental results show that compared to previous speech-language models,\nLLaMA-Omni provides better responses in both content and style, with a response\nlatency as low as 226ms. Additionally, training LLaMA-Omni takes less than 3\ndays on just 4 GPUs, paving the way for the efficient development of\nspeech-language models in the future.", "paper_summary_zh": "LLaMA-Omni 等模型能透過語音與大型語言模型 (LLM) 進行即時互動，與傳統的文字互動相比，大幅提升使用者體驗。然而，關於如何根據開放原始碼 LLM 建構語音互動模型，目前仍缺乏探討。為了解決這個問題，我們提出 LLaMA-Omni，一種新穎的模型架構，專為與 LLM 進行低延遲、高品質的語音互動而設計。LLaMA-Omni 整合了預訓練的語音編碼器、語音適配器、LLM 和串流語音解碼器。它消除了語音轉錄的需要，並能直接從語音指令產生文字和語音回應，且延遲極低。我們根據最新的 Llama-3.1-8B-Instruct 模型建立我們的模型。為了讓模型與語音互動情境相符，我們建構了一個名為 InstructS2S-200K 的資料集，其中包含 200K 個語音指令和對應的語音回應。實驗結果顯示，與先前的語音語言模型相比，LLaMA-Omni 在內容和風格上提供了更好的回應，回應延遲低至 226 毫秒。此外，訓練 LLaMA-Omni 只需要不到 3 天的時間，而且僅使用 4 個 GPU，為未來語音語言模型的有效開發鋪路。", "author": "Qingkai Fang et.al.", "authors": "Qingkai Fang, Shoutao Guo, Yan Zhou, Zhengrui Ma, Shaolei Zhang, Yang Feng", "id": "2409.06666v1", "paper_url": "http://arxiv.org/abs/2409.06666v1", "repo": "https://github.com/ictnlp/llama-omni"}}