{"2412.02291": {"publish_time": "2024-12-03", "title": "Conformal Symplectic Optimization for Stable Reinforcement Learning", "paper_summary": "Training deep reinforcement learning (RL) agents necessitates overcoming the\nhighly unstable nonconvex stochastic optimization inherent in the\ntrial-and-error mechanism. To tackle this challenge, we propose a\nphysics-inspired optimization algorithm called relativistic adaptive gradient\ndescent (RAD), which enhances long-term training stability. By conceptualizing\nneural network (NN) training as the evolution of a conformal Hamiltonian\nsystem, we present a universal framework for transferring long-term stability\nfrom conformal symplectic integrators to iterative NN updating rules, where the\nchoice of kinetic energy governs the dynamical properties of resulting\noptimization algorithms. By utilizing relativistic kinetic energy, RAD\nincorporates principles from special relativity and limits parameter updates\nbelow a finite speed, effectively mitigating abnormal gradient influences.\nAdditionally, RAD models NN optimization as the evolution of a multi-particle\nsystem where each trainable parameter acts as an independent particle with an\nindividual adaptive learning rate. We prove RAD's sublinear convergence under\ngeneral nonconvex settings, where smaller gradient variance and larger batch\nsizes contribute to tighter convergence. Notably, RAD degrades to the\nwell-known adaptive moment estimation (ADAM) algorithm when its speed\ncoefficient is chosen as one and symplectic factor as a small positive value.\nExperimental results show RAD outperforming nine baseline optimizers with five\nRL algorithms across twelve environments, including standard benchmarks and\nchallenging scenarios. Notably, RAD achieves up to a 155.1% performance\nimprovement over ADAM in Atari games, showcasing its efficacy in stabilizing\nand accelerating RL training.", "paper_summary_zh": "<paragraph>訓練深度強化學習 (RL) 代理需要克服試錯機制中高度不穩定的非凸隨機最佳化。為了應對這個挑戰，我們提出了一種受物理啟發的最佳化演算法，稱為相對論適應梯度下降 (RAD)，它增強了長期訓練的穩定性。透過將神經網路 (NN) 訓練概念化為共形哈密頓系統的演化，我們提出了一個通用框架，用於將共形辛積分器的長期穩定性轉移到反覆 NN 更新規則，其中動能的選擇支配了所產生最佳化演算法的動態特性。透過利用相對論動能，RAD 納入了狹義相對論的原理，並將參數更新限制在有限速度以下，有效地減輕異常梯度影響。此外，RAD 將 NN 最佳化建模為多粒子系統的演化，其中每個可訓練參數都作為一個獨立粒子，具有單獨的適應性學習率。我們證明了 RAD 在一般非凸設定下的次線性收斂，其中較小的梯度變異和較大的批次大小有助於更緊密的收斂。值得注意的是，當 RAD 的速度係數選擇為 1，辛因子選擇為一個小的正值時，RAD 會退化為眾所周知的適應性矩估計 (ADAM) 演算法。實驗結果表明，RAD 在十二個環境中使用五種 RL 演算法，優於九種基線最佳化器，包括標準基準和具挑戰性的場景。值得注意的是，RAD 在 Atari 遊戲中比 ADAM 提升了高達 155.1% 的效能，展示了其在穩定和加速 RL 訓練方面的效力。</paragraph>", "author": "Yao Lyu et.al.", "authors": "Yao Lyu, Xiangteng Zhang, Shengbo Eben Li, Jingliang Duan, Letian Tao, Qing Xu, Lei He, Keqiang Li", "id": "2412.02291v1", "paper_url": "http://arxiv.org/abs/2412.02291v1", "repo": "null"}}