{"2407.17117": {"publish_time": "2024-07-24", "title": "EverAdapt: Continuous Adaptation for Dynamic Machine Fault Diagnosis Environments", "paper_summary": "Unsupervised Domain Adaptation (UDA) has emerged as a key solution in\ndata-driven fault diagnosis, addressing domain shift where models underperform\nin changing environments. However, under the realm of continually changing\nenvironments, UDA tends to underperform on previously seen domains when\nadapting to new ones - a problem known as catastrophic forgetting. To address\nthis limitation, we introduce the EverAdapt framework, specifically designed\nfor continuous model adaptation in dynamic environments. Central to EverAdapt\nis a novel Continual Batch Normalization (CBN), which leverages source domain\nstatistics as a reference point to standardize feature representations across\ndomains. EverAdapt not only retains statistical information from previous\ndomains but also adapts effectively to new scenarios. Complementing CBN, we\ndesign a class-conditional domain alignment module for effective integration of\ntarget domains, and a Sample-efficient Replay strategy to reinforce memory\nretention. Experiments on real-world datasets demonstrate EverAdapt superiority\nin maintaining robust fault diagnosis in dynamic environments. Our code is\navailable: https://github.com/mohamedr002/EverAdapt", "paper_summary_zh": "無監督域適應 (UDA) 已成為資料驅動故障診斷的一項關鍵解決方案，用於解決模型在變動環境中表現不佳的域轉移。然而，在持續變動的環境領域中，UDA 傾向於在適應新域時對先前看過的域表現不佳，此問題稱為災難性遺忘。為了解決此限制，我們引入了 EverAdapt 框架，專門設計用於動態環境中的持續模型適應。EverAdapt 的核心是一個新穎的持續批次正規化 (CBN)，它利用來源域統計資料作為參考點，以標準化跨域特徵表示。EverAdapt 不僅保留先前域的統計資訊，還能有效適應新的場景。為了補充 CBN，我們設計了一個類條件域比對模組，用於有效整合目標域，以及一個樣本有效重播策略，以加強記憶保留。在真實世界資料集上的實驗證明了 EverAdapt 在動態環境中維持穩健故障診斷的優越性。我們的程式碼已公開：https://github.com/mohamedr002/EverAdapt", "author": "Edward et.al.", "authors": "Edward, Mohamed Ragab, Yuecong Xu, Min Wu, Yuecong Xu, Zhenghua Chen, Abdulla Alseiari, Xiaoli Li", "id": "2407.17117v1", "paper_url": "http://arxiv.org/abs/2407.17117v1", "repo": "null"}}