{"2411.18207": {"publish_time": "2024-11-27", "title": "From Open Vocabulary to Open World: Teaching Vision Language Models to Detect Novel Objects", "paper_summary": "Traditional object detection methods operate under the closed-set assumption,\nwhere models can only detect a fixed number of objects predefined in the\ntraining set. Recent works on open vocabulary object detection (OVD) enable the\ndetection of objects defined by an unbounded vocabulary, which reduces the cost\nof training models for specific tasks. However, OVD heavily relies on accurate\nprompts provided by an ''oracle'', which limits their use in critical\napplications such as driving scene perception. OVD models tend to misclassify\nnear-out-of-distribution (NOOD) objects that have similar semantics to known\nclasses, and ignore far-out-of-distribution (FOOD) objects. To address theses\nlimitations, we propose a framework that enables OVD models to operate in open\nworld settings, by identifying and incrementally learning novel objects. To\ndetect FOOD objects, we propose Open World Embedding Learning (OWEL) and\nintroduce the concept of Pseudo Unknown Embedding which infers the location of\nunknown classes in a continuous semantic space based on the information of\nknown classes. We also propose Multi-Scale Contrastive Anchor Learning (MSCAL),\nwhich enables the identification of misclassified unknown objects by promoting\nthe intra-class consistency of object embeddings at different scales. The\nproposed method achieves state-of-the-art performance in common open world\nobject detection and autonomous driving benchmarks.", "paper_summary_zh": "傳統的物件偵測方法在封閉集合假設下運作，其中模型只能偵測訓練集中預先定義的固定數量物件。近期關於開放詞彙物件偵測 (OVD) 的研究能偵測由不受限詞彙定義的物件，這減少了訓練特定任務模型的成本。然而，OVD 嚴重依賴由「神諭」提供的準確提示，這限制了它們在關鍵應用中的使用，例如駕駛場景感知。OVD 模型傾向於將近乎超出分佈 (NOOD) 的物件錯誤分類為與已知類別具有類似語意的物件，並忽略遠超出分佈 (FOOD) 的物件。為了解決這些限制，我們提出一個框架，讓 OVD 模型能夠在開放世界設定中運作，方法是識別並逐步學習新穎物件。為了偵測 FOOD 物件，我們提出開放世界嵌入式學習 (OWEL)，並引入偽未知嵌入的概念，該概念根據已知類別的資訊，推論出未知類別在連續語義空間中的位置。我們也提出多尺度對比錨學習 (MSCAL)，它能透過提升不同尺度物件嵌入的類內一致性，來識別錯誤分類的未知物件。所提出的方法在常見的開放世界物件偵測和自動駕駛基準中，達成最先進的效能。", "author": "Zizhao Li et.al.", "authors": "Zizhao Li, Zhengkang Xiang, Joseph West, Kourosh Khoshelham", "id": "2411.18207v1", "paper_url": "http://arxiv.org/abs/2411.18207v1", "repo": "https://github.com/343gltysprk/ovow"}}