{"2410.11786": {"publish_time": "2024-10-15", "title": "Selection-p: Self-Supervised Task-Agnostic Prompt Compression for Faithfulness and Transferability", "paper_summary": "Large Language Models (LLMs) have demonstrated impressive capabilities in a\nwide range of natural language processing tasks when leveraging in-context\nlearning. To mitigate the additional computational and financial costs\nassociated with in-context learning, several prompt compression methods have\nbeen proposed to compress the in-context learning prompts. Despite their\nsuccess, these methods face challenges with transferability due to\nmodel-specific compression, or rely on external training data, such as GPT-4.\nIn this paper, we investigate the ability of LLMs to develop a unified\ncompression method that discretizes uninformative tokens, utilizing a\nself-supervised pre-training technique. By introducing a small number of\nparameters during the continual pre-training, the proposed Selection-p produces\na probability for each input token, indicating whether to preserve or discard\nit. Experiments show Selection-p achieves state-of-the-art performance across\nnumerous classification tasks, achieving compression rates of up to 10 times\nwhile experiencing only a marginal 0.8% decrease in performance. Moreover, it\nexhibits superior transferability to different models compared to prior work.\nAdditionally, we further analyze how Selection-p helps maintain performance on\nin-context learning with long contexts.", "paper_summary_zh": "大型語言模型 (LLM) 在利用情境學習時，已在廣泛的自然語言處理任務中展現出令人印象深刻的能力。為了減輕與情境學習相關的額外計算和財務成本，已經提出了多種提示壓縮方法來壓縮情境學習提示。儘管這些方法很成功，但由於特定於模型的壓縮，它們在可轉移性方面面臨挑戰，或者依賴於外部訓練資料，例如 GPT-4。在本文中，我們探討了 LLM 開發統一壓縮方法的能力，該方法利用自我監督預訓練技術對非資訊性標記進行離散化。通過在持續預訓練期間引入少數參數，所提出的 Selection-p 為每個輸入標記產生一個機率，表示是否保留或捨棄它。實驗表明，Selection-p 在眾多分類任務中實現了最先進的效能，實現了高達 10 倍的壓縮率，同時效能僅下降了微不足道的 0.8%。此外，與先前的研究相比，它對不同模型表現出優越的可轉移性。此外，我們進一步分析了 Selection-p 如何幫助在具有長語境的語境學習中維持效能。", "author": "Tsz Ting Chung et.al.", "authors": "Tsz Ting Chung, Leyang Cui, Lemao Liu, Xinting Huang, Shuming Shi, Dit-Yan Yeung", "id": "2410.11786v1", "paper_url": "http://arxiv.org/abs/2410.11786v1", "repo": "null"}}