{"2406.16838": {"publish_time": "2024-06-24", "title": "From Decoding to Meta-Generation: Inference-time Algorithms for Large Language Models", "paper_summary": "One of the most striking findings in modern research on large language models\n(LLMs) is that scaling up compute during training leads to better results.\nHowever, less attention has been given to the benefits of scaling compute\nduring inference. This survey focuses on these inference-time approaches. We\nexplore three areas under a unified mathematical formalism: token-level\ngeneration algorithms, meta-generation algorithms, and efficient generation.\nToken-level generation algorithms, often called decoding algorithms, operate by\nsampling a single token at a time or constructing a token-level search space\nand then selecting an output. These methods typically assume access to a\nlanguage model's logits, next-token distributions, or probability scores.\nMeta-generation algorithms work on partial or full sequences, incorporating\ndomain knowledge, enabling backtracking, and integrating external information.\nEfficient generation methods aim to reduce token costs and improve the speed of\ngeneration. Our survey unifies perspectives from three research communities:\ntraditional natural language processing, modern LLMs, and machine learning\nsystems.", "paper_summary_zh": "在大型語言模型 (LLM) 的現代研究中，最引人注目的發現之一是，訓練期間擴大運算會帶來更好的結果。然而，在推理期間擴大運算的好處卻較少受到關注。本調查重點關注這些推理時間方法。我們在一個統一的數學形式主義下探討了三個領域：符號級別生成演算法、元生成演算法和高效生成。符號級別生成演算法（通常稱為解碼演算法）通過一次抽取一個符號或建構符號級別搜尋空間，然後選擇一個輸出進行操作。這些方法通常假設可以存取語言模型的 logit、下一個符號分佈或機率分數。元生成演算法處理部分或完整序列，整合領域知識，啟用回溯，並整合外部資訊。高效生成方法旨在降低符號成本並提高生成速度。我們的調查統一了來自三個研究社群的觀點：傳統自然語言處理、現代 LLM 和機器學習系統。", "author": "Sean Welleck et.al.", "authors": "Sean Welleck, Amanda Bertsch, Matthew Finlayson, Hailey Schoelkopf, Alex Xie, Graham Neubig, Ilia Kulikov, Zaid Harchaoui", "id": "2406.16838v1", "paper_url": "http://arxiv.org/abs/2406.16838v1", "repo": "null"}}