{"2408.08631": {"publish_time": "2024-08-16", "title": "Persona is a Double-edged Sword: Enhancing the Zero-shot Reasoning by Ensembling the Role-playing and Neutral Prompts", "paper_summary": "Recent studies demonstrate that prompting an appropriate role-playing persona\nto an LLM improves its reasoning capability. However, assigning a proper\npersona is difficult since an LLM's performance is extremely sensitive to\nassigned prompts; therefore, personas sometimes hinder LLMs and degrade their\nreasoning capabilities. In this paper, we propose a novel framework, Jekyll \\&\nHyde, which ensembles the results of role-playing and neutral prompts to\neradicate performance degradation via unilateral use of role-playing prompted\nLLM and enhance the robustness of an LLM's reasoning ability. Specifically,\nJekyll \\& Hyde collects two potential solutions from both role-playing and\nneutral prompts and selects a better solution after cross-checking via an LLM\nevaluator. However, LLM-based evaluators tend to be affected by the order of\nthose potential solutions within the prompt when selecting the proper solution;\nthus, we also propose a robust LLM evaluator to mitigate the position bias. The\nexperimental analysis demonstrates that role-playing prompts distract LLMs and\ndegrade their reasoning abilities in 4 out of 12 datasets, even when using\nGPT-4. In addition, we reveal that Jekyll \\& Hyde improves reasoning\ncapabilities by selecting better choices among the potential solutions on\ntwelve widely-used reasoning datasets. We further show that our proposed LLM\nevaluator outperforms other baselines, proving the LLMs' position bias is\nsuccessfully mitigated.", "paper_summary_zh": "最近的研究表明，提示 LLM 扮演适当的角色扮演角色可以提高其推理能力。然而，指定适当的角色很难，因为 LLM 的性能对指定的提示极其敏感；因此，角色有时会阻碍 LLM 并降低其推理能力。在本文中，我们提出了一个新框架 Jekyll 和 Hyde，它集合了角色扮演和中立提示的结果，通过单方面使用角色扮演提示的 LLM 来消除性能下降，并增强 LLM 推理能力的鲁棒性。具体而言，Jekyll 和 Hyde 从角色扮演和中立提示中收集两个潜在的解决方案，并在通过 LLM 评估器交叉检查后选择更好的解决方案。然而，基于 LLM 的评估器在选择适当的解决方案时往往会受到提示中这些潜在解决方案的顺序的影响；因此，我们还提出了一个鲁棒的 LLM 评估器来减轻位置偏差。实验分析表明，即使使用 GPT-4，角色扮演提示也会分散 LLM 的注意力，并在 12 个数据集中有 4 个数据集降低其推理能力。此外，我们揭示了 Jekyll 和 Hyde 通过在十二个广泛使用的推理数据集中从潜在解决方案中选择更好的选择来提高推理能力。我们进一步表明，我们提出的 LLM 评估器优于其他基线，证明 LLM 的位置偏差已成功减轻。", "author": "Junseok Kim et.al.", "authors": "Junseok Kim, Nakyeong Yang, Kyomin Jung", "id": "2408.08631v1", "paper_url": "http://arxiv.org/abs/2408.08631v1", "repo": "null"}}