{"2408.00483": {"publish_time": "2024-08-01", "title": "A Systematic Review on Long-Tailed Learning", "paper_summary": "Long-tailed data is a special type of multi-class imbalanced data with a very\nlarge amount of minority/tail classes that have a very significant combined\ninfluence. Long-tailed learning aims to build high-performance models on\ndatasets with long-tailed distributions, which can identify all the classes\nwith high accuracy, in particular the minority/tail classes. It is a\ncutting-edge research direction that has attracted a remarkable amount of\nresearch effort in the past few years. In this paper, we present a\ncomprehensive survey of latest advances in long-tailed visual learning. We\nfirst propose a new taxonomy for long-tailed learning, which consists of eight\ndifferent dimensions, including data balancing, neural architecture, feature\nenrichment, logits adjustment, loss function, bells and whistles, network\noptimization, and post hoc processing techniques. Based on our proposed\ntaxonomy, we present a systematic review of long-tailed learning methods,\ndiscussing their commonalities and alignable differences. We also analyze the\ndifferences between imbalance learning and long-tailed learning approaches.\nFinally, we discuss prospects and future directions in this field.", "paper_summary_zh": "長尾數據是一種特殊類型，具有大量少數/尾部類別的多類別不平衡數據，這些類別具有非常顯著的綜合影響。長尾學習旨在建立具有長尾分佈的數據集的高性能模型，該模型可以識別所有類別，特別是少數/尾部類別，具有很高的準確度。這是一個尖端的的研究方向，在過去幾年中吸引了大量的研究工作。在本文中，我們對長尾視覺學習的最新進展進行了全面的調查。我們首先提出了長尾學習的新分類法，其中包括八個不同的維度，包括數據平衡、神經架構、特徵豐富、對數調整、損失函數、花裡胡哨、網路最佳化和事後處理技術。根據我們提出的分類法，我們對長尾學習方法進行了系統的回顧，討論了它們的共性和可比性差異。我們還分析了不平衡學習和長尾學習方法之間的差異。最後，我們討論了該領域的前景和未來方向。", "author": "Chongsheng Zhang et.al.", "authors": "Chongsheng Zhang, George Almpanidis, Gaojuan Fan, Binquan Deng, Yanbo Zhang, Ji Liu, Aouaidjia Kamel, Paolo Soda, João Gama", "id": "2408.00483v1", "paper_url": "http://arxiv.org/abs/2408.00483v1", "repo": "null"}}