{"2409.05420": {"publish_time": "2024-09-09", "title": "AD-Net: Attention-based dilated convolutional residual network with guided decoder for robust skin lesion segmentation", "paper_summary": "In computer-aided diagnosis tools employed for skin cancer treatment and\nearly diagnosis, skin lesion segmentation is important. However, achieving\nprecise segmentation is challenging due to inherent variations in appearance,\ncontrast, texture, and blurry lesion boundaries. This research presents a\nrobust approach utilizing a dilated convolutional residual network, which\nincorporates an attention-based spatial feature enhancement block (ASFEB) and\nemploys a guided decoder strategy. In each dilated convolutional residual\nblock, dilated convolution is employed to broaden the receptive field with\nvarying dilation rates. To improve the spatial feature information of the\nencoder, we employed an attention-based spatial feature enhancement block in\nthe skip connections. The ASFEB in our proposed method combines feature maps\nobtained from average and maximum-pooling operations. These combined features\nare then weighted using the active outcome of global average pooling and\nconvolution operations. Additionally, we have incorporated a guided decoder\nstrategy, where each decoder block is optimized using an individual loss\nfunction to enhance the feature learning process in the proposed AD-Net. The\nproposed AD-Net presents a significant benefit by necessitating fewer model\nparameters compared to its peer methods. This reduction in parameters directly\nimpacts the number of labeled data required for training, facilitating faster\nconvergence during the training process. The effectiveness of the proposed\nAD-Net was evaluated using four public benchmark datasets. We conducted a\nWilcoxon signed-rank test to verify the efficiency of the AD-Net. The outcomes\nsuggest that our method surpasses other cutting-edge methods in performance,\neven without the implementation of data augmentation strategies.", "paper_summary_zh": "<paragraph>在用於皮膚癌治療和早期診斷的電腦輔助診斷工具中，皮膚病灶分割非常重要。然而，由於外觀、對比度、紋理和模糊的病灶邊界固有的變化，實現精確分割具有挑戰性。本研究提出了一種利用膨脹卷積殘差網路的穩健方法，該網路結合了一個基於注意力的空間特徵增強塊 (ASFEB) 並採用了一個引導式解碼器策略。在每個膨脹卷積殘差塊中，使用膨脹卷積來擴展感受野，並採用不同的膨脹率。為了改進編碼器的空間特徵資訊，我們在跳躍連接中採用了一個基於注意力的空間特徵增強塊。我們提出的方法中的 ASFEB 結合了從平均池化和最大池化操作中獲得的特徵映射。然後使用全局平均池化和卷積操作的積極結果對這些組合的特徵進行加權。此外，我們還納入了一個引導式解碼器策略，其中每個解碼器塊使用一個單獨的損失函數進行最佳化，以增強所提出的 AD-Net 中的特徵學習過程。與同類方法相比，所提出的 AD-Net 通過減少模型參數而呈現出顯著的優勢。參數的這種減少直接影響訓練所需的標記數據數量，從而促進訓練過程中的快速收斂。使用四個公共基準資料集評估了所提出的 AD-Net 的有效性。我們進行了 Wilcoxon 簽名秩檢驗以驗證 AD-Net 的效率。結果表明，即使沒有實施數據擴充策略，我們的模型在效能上也優於其他尖端模型。</paragraph>", "author": "Asim Naveed et.al.", "authors": "Asim Naveed, Syed S. Naqvi, Tariq M. Khan, Shahzaib Iqbal, M. Yaqoob Wani, Haroon Ahmed Khan", "id": "2409.05420v1", "paper_url": "http://arxiv.org/abs/2409.05420v1", "repo": "null"}}