{"2410.10398": {"publish_time": "2024-10-14", "title": "FairMindSim: Alignment of Behavior, Emotion, and Belief in Humans and LLM Agents Amid Ethical Dilemmas", "paper_summary": "AI alignment is a pivotal issue concerning AI control and safety. It should\nconsider not only value-neutral human preferences but also moral and ethical\nconsiderations. In this study, we introduced FairMindSim, which simulates the\nmoral dilemma through a series of unfair scenarios. We used LLM agents to\nsimulate human behavior, ensuring alignment across various stages. To explore\nthe various socioeconomic motivations, which we refer to as beliefs, that drive\nboth humans and LLM agents as bystanders to intervene in unjust situations\ninvolving others, and how these beliefs interact to influence individual\nbehavior, we incorporated knowledge from relevant sociological fields and\nproposed the Belief-Reward Alignment Behavior Evolution Model (BREM) based on\nthe recursive reward model (RRM). Our findings indicate that, behaviorally,\nGPT-4o exhibits a stronger sense of social justice, while humans display a\nricher range of emotions. Additionally, we discussed the potential impact of\nemotions on behavior. This study provides a theoretical foundation for\napplications in aligning LLMs with altruistic values.", "paper_summary_zh": "AI 對齊是關於 AI 控制和安全的一個核心議題。它不只應考量價值中立的人類偏好，也應考量道德和倫理考量。在本研究中，我們引入了 FairMindSim，它透過一系列不公平情境模擬道德兩難。我們使用 LLM 代理模擬人類行為，確保在各個階段的一致性。為了探索各種社會經濟動機（我們稱之為信念），這些動機驅使人類和 LLM 代理作為旁觀者介入涉及他人的不公正情況，以及這些信念如何互動以影響個人行為，我們納入了相關社會學領域的知識，並根據遞迴獎勵模型 (RRM) 提出信念獎勵對齊行為演化模型 (BREM)。我們的發現表明，在行為上，GPT-4o 表現出更強烈的社會正義感，而人類則表現出更豐富的情緒。此外，我們討論了情緒對行為的潛在影響。本研究為將 LLM 與利他價值觀對齊的應用提供了理論基礎。", "author": "Yu Lei et.al.", "authors": "Yu Lei, Hao Liu, Chengxing Xie, Songjia Liu, Zhiyu Yin, Canyu chen, Guohao Li, Philip Torr, Zhen Wu", "id": "2410.10398v1", "paper_url": "http://arxiv.org/abs/2410.10398v1", "repo": "null"}}