{"2412.17692": {"publish_time": "2024-12-23", "title": "FedTLU: Federated Learning with Targeted Layer Updates", "paper_summary": "Federated learning (FL) addresses privacy concerns in language modeling by\nenabling multiple clients to contribute to training language models. However,\nnon-IID (identically and independently distributed) data across clients often\nlimits FL's performance. This issue is especially challenging during model\nfine-tuning, as noise due to variations in clients' data distributions can harm\nmodel convergence near the optimum. This paper proposes a targeted layer update\nstrategy for fine-tuning in FL. Instead of randomly updating layers of the\nlanguage model, as often done in practice, we use a scoring mechanism to\nidentify and update the most critical layers, avoiding excessively noisy or\neven poisoned updates by freezing the parameters in other layers. We show in\nextensive experiments that our method improves convergence and performance in\nnon-IID settings, offering a more efficient approach to fine-tuning federated\nlanguage models.", "paper_summary_zh": "聯邦學習 (FL) 透過讓多個用戶參與訓練語言模型，來解決語言建模中的隱私問題。然而，用戶之間的非 IID（獨立同分布）資料通常會限制 FL 的效能。這個問題在模型微調期間特別具有挑戰性，因為用戶資料分佈的差異所造成的雜訊會損害模型在最佳值附近的收斂性。本文針對 FL 中的微調提出了一個目標層更新策略。我們使用評分機制來識別和更新最關鍵的層，而不是像實際操作中常見的那樣隨機更新語言模型的層，藉此避免過度雜訊或甚至透過凍結其他層中的參數來避免中毒更新。我們在廣泛的實驗中表明，我們的模型在非 IID 設定中改善了收斂性和效能，提供了一個更有效率的聯邦語言模型微調方法。", "author": "Jong-Ik Park et.al.", "authors": "Jong-Ik Park, Carlee Joe-Wong", "id": "2412.17692v1", "paper_url": "http://arxiv.org/abs/2412.17692v1", "repo": "null"}}