{"2501.06099": {"publish_time": "2025-01-10", "title": "Explaining Deep Learning-based Anomaly Detection in Energy Consumption Data by Focusing on Contextually Relevant Data", "paper_summary": "Detecting anomalies in energy consumption data is crucial for identifying\nenergy waste, equipment malfunction, and overall, for ensuring efficient energy\nmanagement. Machine learning, and specifically deep learning approaches, have\nbeen greatly successful in anomaly detection; however, they are black-box\napproaches that do not provide transparency or explanations. SHAP and its\nvariants have been proposed to explain these models, but they suffer from high\ncomputational complexity (SHAP) or instability and inconsistency (e.g., Kernel\nSHAP). To address these challenges, this paper proposes an explainability\napproach for anomalies in energy consumption data that focuses on\ncontext-relevant information. The proposed approach leverages existing\nexplainability techniques, focusing on SHAP variants, together with global\nfeature importance and weighted cosine similarity to select background dataset\nbased on the context of each anomaly point. By focusing on the context and most\nrelevant features, this approach mitigates the instability of explainability\nalgorithms. Experimental results across 10 different machine learning models,\nfive datasets, and five XAI techniques, demonstrate that our method reduces the\nvariability of explanations providing consistent explanations. Statistical\nanalyses confirm the robustness of our approach, showing an average reduction\nin variability of approximately 38% across multiple datasets.", "paper_summary_zh": "偵測能源消耗資料中的異常值對於找出能源浪費、設備故障至關重要，總體而言，這有助於確保能源管理的效率。機器學習，尤其是深度學習方法，在異常偵測方面已獲得極大的成功；然而，這些方法是黑箱方法，不提供透明度或解釋。SHAP 及其變體已被提出用於解釋這些模型，但它們存在高運算複雜度（SHAP）或不穩定和不一致（例如，Kernel SHAP）的問題。為了應對這些挑戰，本文提出了一種針對能源消耗資料異常值的解釋性方法，重點在於與背景相關的資訊。所提出的方法利用現有的解釋性技術，重點在於 SHAP 變體，並結合全域特徵重要性和加權餘弦相似性，以根據每個異常點的背景選擇背景資料集。透過關注背景和最相關的特徵，這種方法減輕了可解釋性演算法的不穩定性。針對 10 種不同的機器學習模型、5 個資料集和 5 種 XAI 技術的實驗結果證明，我們的模型降低了解釋的一致性，提供了穩定的解釋。統計分析確認了我們方法的穩健性，顯示出在多個資料集中，變異性平均降低約 38%。", "author": "Mohammad Noorchenarboo et.al.", "authors": "Mohammad Noorchenarboo, Katarina Grolinger", "id": "2501.06099v1", "paper_url": "http://arxiv.org/abs/2501.06099v1", "repo": "null"}}