{"2412.08985": {"publish_time": "2024-12-12", "title": "Assessing the Robustness of Retrieval-Augmented Generation Systems in K-12 Educational Question Answering with Knowledge Discrepancies", "paper_summary": "Retrieval-Augmented Generation (RAG) systems have demonstrated remarkable\npotential as question answering systems in the K-12 Education domain, where\nknowledge is typically queried within the restricted scope of authoritative\ntextbooks. However, the discrepancy between textbooks and the parametric\nknowledge in Large Language Models (LLMs) could undermine the effectiveness of\nRAG systems. To systematically investigate the robustness of RAG systems under\nsuch knowledge discrepancies, we present EduKDQA, a question answering dataset\nthat simulates knowledge discrepancies in real applications by applying\nhypothetical knowledge updates in answers and source documents. EduKDQA\nincludes 3,005 questions covering five subjects, under a comprehensive question\ntypology from the perspective of context utilization and knowledge integration.\nWe conducted extensive experiments on retrieval and question answering\nperformance. We find that most RAG systems suffer from a substantial\nperformance drop in question answering with knowledge discrepancies, while\nquestions that require integration of contextual knowledge and parametric\nknowledge pose a challenge to LLMs.", "paper_summary_zh": "檢索增強生成 (RAG) 系統已展現出驚人的潛力，可用作 K-12 教育領域的問題解答系統，其中知識通常在權威教科書的受限範圍內查詢。然而，教科書與大型語言模型 (LLM) 中的參數化知識之間的差異可能會損害 RAG 系統的效能。為了系統性地探討 RAG 系統在這種知識差異下的穩健性，我們提出了 EduKDQA，這是一個問題解答資料集，透過在答案和原始文件套用假設的知識更新，模擬實際應用中的知識差異。EduKDQA 包含 3,005 個問題，涵蓋五個科目，從情境利用和知識整合的角度來看，是一個全面的問題類型學。我們對檢索和問題解答效能進行了廣泛的實驗。我們發現，大多數 RAG 系統在有知識差異的問題解答中效能大幅下降，而需要整合情境知識和參數化知識的問題對 LLM 構成挑戰。", "author": "Tianshi Zheng et.al.", "authors": "Tianshi Zheng, Weihan Li, Jiaxin Bai, Weiqi Wang, Yangqiu Song", "id": "2412.08985v1", "paper_url": "http://arxiv.org/abs/2412.08985v1", "repo": "null"}}