{"2407.05441": {"publish_time": "2024-07-07", "title": "Language Models Encode Collaborative Signals in Recommendation", "paper_summary": "Recent studies empirically indicate that language models (LMs) encode rich\nworld knowledge beyond mere semantics, attracting significant attention across\nvarious fields. However, in the recommendation domain, it remains uncertain\nwhether LMs implicitly encode user preference information. Contrary to the\nprevailing understanding that LMs and traditional recommender models learn two\ndistinct representation spaces due to a huge gap in language and behavior\nmodeling objectives, this work rethinks such understanding and explores\nextracting a recommendation space directly from the language representation\nspace. Surprisingly, our findings demonstrate that item representations, when\nlinearly mapped from advanced LM representations, yield superior recommendation\nperformance. This outcome suggests the homomorphism between the language\nrepresentation space and an effective recommendation space, implying that\ncollaborative signals may indeed be encoded within advanced LMs. Motivated by\nthese findings, we propose a simple yet effective collaborative filtering (CF)\nmodel named AlphaRec, which utilizes language representations of item textual\nmetadata (e.g., titles) instead of traditional ID-based embeddings.\nSpecifically, AlphaRec is comprised of three main components: a multilayer\nperceptron (MLP), graph convolution, and contrastive learning (CL) loss\nfunction, making it extremely easy to implement and train. Our empirical\nresults show that AlphaRec outperforms leading ID-based CF models on multiple\ndatasets, marking the first instance of such a recommender with text embeddings\nachieving this level of performance. Moreover, AlphaRec introduces a new\nlanguage-representation-based CF paradigm with several desirable advantages:\nbeing easy to implement, lightweight, rapid convergence, superior zero-shot\nrecommendation abilities in new domains, and being aware of user intention.", "paper_summary_zh": "<paragraph>最近的研究實證表明，語言模型 (LM) 編碼豐富的世界知識，超越了單純的語義，吸引了各個領域的極大關注。然而，在推薦領域中，LM 是否隱含編碼使用者偏好資訊仍不確定。與普遍認知相反，LM 和傳統推薦模型由於語言和行為建模目標的巨大差距而學習兩個不同的表示空間，這項工作重新思考這種理解，並探索直接從語言表示空間中提取推薦空間。令人驚訝的是，我們的研究結果表明，當從先進的 LM 表示中線性映射時，項目表示會產生優異的推薦效能。此結果表明語言表示空間和有效的推薦空間之間存在同態性，這意味著協作訊號確實可能編碼在先進的 LM 中。受這些研究結果的啟發，我們提出了一個簡單但有效的協同過濾 (CF) 模型，名為 AlphaRec，它利用項目文字元資料（例如標題）的語言表示，而不是傳統基於 ID 的嵌入。具體來說，AlphaRec 由三個主要組成部分組成：多層感知器 (MLP)、圖形卷積和對比學習 (CL) 損失函數，使其極易於實作和訓練。我們的實證結果表明，AlphaRec 在多個資料集上優於領先的基於 ID 的 CF 模型，標誌著這種具有文字嵌入的推薦系統首次達到此效能水準。此外，AlphaRec 引入了一個新的基於語言表示的 CF 典範，具有多項理想的優點：易於實作、輕量級、快速收斂、在新的領域中具有優異的零次學習推薦能力，並且可以了解使用者的意圖。</paragraph>", "author": "Leheng Sheng et.al.", "authors": "Leheng Sheng, An Zhang, Yi Zhang, Yuxin Chen, Xiang Wang, Tat-Seng Chua", "id": "2407.05441v1", "paper_url": "http://arxiv.org/abs/2407.05441v1", "repo": "https://github.com/lehengthu/alpharec"}}