{"2501.03324": {"publish_time": "2025-01-06", "title": "Analyzing Bias in Swiss Federal Supreme Court Judgments Using Facebook's Holistic Bias Dataset: Implications for Language Model Training", "paper_summary": "Natural Language Processing (NLP) is vital for computers to process and\nrespond accurately to human language. However, biases in training data can\nintroduce unfairness, especially in predicting legal judgment. This study\nfocuses on analyzing biases within the Swiss Judgment Prediction Dataset\n(SJP-Dataset). Our aim is to ensure unbiased factual descriptions essential for\nfair decision making by NLP models in legal contexts. We analyze the dataset\nusing social bias descriptors from the Holistic Bias dataset and employ\nadvanced NLP techniques, including attention visualization, to explore the\nimpact of dispreferred descriptors on model predictions. The study identifies\nbiases and examines their influence on model behavior. Challenges include\ndataset imbalance and token limits affecting model performance.", "paper_summary_zh": "自然語言處理 (NLP) 對於電腦處理和準確回應人類語言至關重要。然而，訓練資料中的偏差可能會導致不公平，特別是在預測法律判決時。本研究專注於分析瑞士判決預測資料集 (SJP-Dataset) 中的偏差。我們的目標是確保無偏見的事實描述，這對於法律背景中 NLP 模型的公平決策至關重要。我們使用 Holistic Bias 資料集中的社會偏差描述符分析資料集，並採用先進的 NLP 技術，包括注意力視覺化，以探討不受歡迎的描述符對模型預測的影響。本研究識別偏差並檢視其對模型行為的影響。挑戰包括影響模型效能的資料集不平衡和標記限制。", "author": "Sabine Wehnert et.al.", "authors": "Sabine Wehnert, Muhammet Ertas, Ernesto William De Luca", "id": "2501.03324v1", "paper_url": "http://arxiv.org/abs/2501.03324v1", "repo": "null"}}