{"2502.14786": {"publish_time": "2025-02-20", "title": "SigLIP 2: Multilingual Vision-Language Encoders with Improved Semantic Understanding, Localization, and Dense Features", "paper_summary": "We introduce SigLIP 2, a family of new multilingual vision-language encoders\nthat build on the success of the original SigLIP. In this second iteration, we\nextend the original image-text training objective with several prior,\nindependently developed techniques into a unified recipe -- this includes\ncaptioning-based pretraining, self-supervised losses (self-distillation, masked\nprediction) and online data curation. With these changes, SigLIP 2 models\noutperform their SigLIP counterparts at all model scales in core capabilities,\nincluding zero-shot classification, image-text retrieval, and transfer\nperformance when extracting visual representations for Vision-Language Models\n(VLMs). Furthermore, the new training recipe leads to significant improvements\non localization and dense prediction tasks. We also train variants which\nsupport multiple resolutions and preserve the input's native aspect ratio.\nFinally, we train on a more diverse data-mixture that includes de-biasing\ntechniques, leading to much better multilingual understanding and improved\nfairness. To allow users to trade off inference cost with performance, we\nrelease model checkpoints at four sizes: ViT-B (86M), L (303M), So400m (400M),\nand g (1B).", "paper_summary_zh": "我們推出了 SigLIP 2，這是一個新的多語言視覺語言編碼器系列，它建立在 SigLIP 的成功基礎上。在這個第二個版本中，我們將原來的圖像文字訓練目標與幾個先前獨立開發的技術擴展到一個統一的配方中，其中包括基於標題的預訓練、自我監督損失（自我蒸餾、遮罩預測）和線上數據策展。有了這些改變，SigLIP 2 模型在所有模型規模上都超越了 SigLIP 的對應模型，包括零次分類、圖像文字檢索和在為視覺語言模型 (VLM) 提取視覺表示時傳輸效能。此外，新的訓練配方也大幅改善了定位和密集預測任務。我們還訓練了支援多種解析度和保留輸入原生長寬比的變體。最後，我們在一個更為多樣化的數據組合上進行訓練，其中包括去偏見技術，從而大幅提升多語言理解力並改善公平性。為了讓使用者權衡推理成本與效能，我們發布了四種大小的模型檢查點：ViT-B (86M)、L (303M)、So400m (400M) 和 g (1B)。", "author": "Michael Tschannen et.al.", "authors": "Michael Tschannen, Alexey Gritsenko, Xiao Wang, Muhammad Ferjad Naeem, Ibrahim Alabdulmohsin, Nikhil Parthasarathy, Talfan Evans, Lucas Beyer, Ye Xia, Basil Mustafa, Olivier Hénaff, Jeremiah Harmsen, Andreas Steiner, Xiaohua Zhai", "id": "2502.14786v1", "paper_url": "http://arxiv.org/abs/2502.14786v1", "repo": "null"}}