{"2501.10256": {"publish_time": "2025-01-17", "title": "Unsupervised Rhythm and Voice Conversion of Dysarthric to Healthy Speech for ASR", "paper_summary": "Automatic speech recognition (ASR) systems are well known to perform poorly\non dysarthric speech. Previous works have addressed this by speaking rate\nmodification to reduce the mismatch with typical speech. Unfortunately, these\napproaches rely on transcribed speech data to estimate speaking rates and\nphoneme durations, which might not be available for unseen speakers. Therefore,\nwe combine unsupervised rhythm and voice conversion methods based on\nself-supervised speech representations to map dysarthric to typical speech. We\nevaluate the outputs with a large ASR model pre-trained on healthy speech\nwithout further fine-tuning and find that the proposed rhythm conversion\nespecially improves performance for speakers of the Torgo corpus with more\nsevere cases of dysarthria. Code and audio samples are available at\nhttps://idiap.github.io/RnV .", "paper_summary_zh": "自動語音辨識 (ASR) 系統在處理構音障礙的語音時，表現普遍不佳。先前的研究透過調整說話速度來解決這個問題，藉此減少與典型語音的差異。遺憾的是，這些方法仰賴轉錄語音資料來估計說話速度和音素長度，而這些資料可能無法取得，特別是針對未曾見過的說話者。因此，我們結合基於自我監督語音表徵的非監督節奏和語音轉換方法，將構音障礙的語音轉換為典型語音。我們使用一個大型 ASR 模型評估輸出，該模型預先在健康語音上進行訓練，且未進一步微調，並發現建議的節奏轉換特別能提升 Torgo 語料庫中構音障礙較為嚴重的說話者的表現。程式碼和音訊範例可於 https://idiap.github.io/RnV 取得。", "author": "Karl El Hajal et.al.", "authors": "Karl El Hajal, Enno Hermann, Ajinkya Kulkarni, Mathew Magimai. -Doss", "id": "2501.10256v1", "paper_url": "http://arxiv.org/abs/2501.10256v1", "repo": "null"}}