{"2411.08979": {"publish_time": "2024-11-13", "title": "CoCoP: Enhancing Text Classification with LLM through Code Completion Prompt", "paper_summary": "Text classification is a fundamental task in natural language processing\n(NLP), and large language models (LLMs) have demonstrated their capability to\nperform this task across various domains. However, the performance of LLMs\nheavily depends on the quality of their input prompts. Recent studies have also\nshown that LLMs exhibit remarkable results in code-related tasks. To leverage\nthe capabilities of LLMs in text classification, we propose the Code Completion\nPrompt (CoCoP) method, which transforms the text classification problem into a\ncode completion task. CoCoP significantly improves text classification\nperformance across diverse datasets by utilizing LLMs' code-completion\ncapability. For instance, CoCoP enhances the accuracy of the SST2 dataset by\nmore than 20%. Moreover, when CoCoP integrated with LLMs specifically designed\nfor code-related tasks (code models), such as CodeLLaMA, this method\ndemonstrates better or comparable performance to few-shot learning techniques\nwhile using only one-tenth of the model size. The source code of our proposed\nmethod will be available to the public upon the acceptance of the paper.", "paper_summary_zh": "文本分類是自然語言處理 (NLP) 中的一項基本任務，而大型語言模型 (LLM) 已展現其在各種領域執行此任務的能力。然而，LLM 的效能高度依賴於其輸入提示的品質。最近的研究也顯示，LLM 在與程式碼相關的任務中展現出顯著的結果。為了在文本分類中利用 LLM 的能力，我們提出程式碼完成提示 (CoCoP) 方法，它將文本分類問題轉換為程式碼完成任務。CoCoP 透過利用 LLM 的程式碼完成能力，大幅提升各種資料集的文本分類效能。例如，CoCoP 將 SST2 資料集的準確度提升了 20% 以上。此外，當 CoCoP 與專為程式碼相關任務（程式碼模型）設計的 LLM（例如 CodeLLaMA）整合時，此方法展現出比少量學習技術更佳或相當的效能，同時僅使用十分之一的模型大小。我們提出的方法的原始碼將在論文被接受後提供給大眾。", "author": "Mohammad Mahdi Mohajeri et.al.", "authors": "Mohammad Mahdi Mohajeri, Mohammad Javad Dousti, Majid Nili Ahmadabadi", "id": "2411.08979v1", "paper_url": "http://arxiv.org/abs/2411.08979v1", "repo": "null"}}