{"2409.18433": {"publish_time": "2024-09-27", "title": "Easy2Hard-Bench: Standardized Difficulty Labels for Profiling LLM Performance and Generalization", "paper_summary": "While generalization over tasks from easy to hard is crucial to profile\nlanguage models (LLMs), the datasets with fine-grained difficulty annotations\nfor each problem across a broad range of complexity are still blank. Aiming to\naddress this limitation, we present Easy2Hard-Bench, a consistently formatted\ncollection of 6 benchmark datasets spanning various domains, such as\nmathematics and programming problems, chess puzzles, and reasoning questions.\nEach problem within these datasets is annotated with numerical difficulty\nscores. To systematically estimate problem difficulties, we collect abundant\nperformance data on attempts to each problem by humans in the real world or\nLLMs on the prominent leaderboard. Leveraging the rich performance data, we\napply well-established difficulty ranking systems, such as Item Response Theory\n(IRT) and Glicko-2 models, to uniformly assign numerical difficulty scores to\nproblems. Moreover, datasets in Easy2Hard-Bench distinguish themselves from\nprevious collections by a higher proportion of challenging problems. Through\nextensive experiments with six state-of-the-art LLMs, we provide a\ncomprehensive analysis of their performance and generalization capabilities\nacross varying levels of difficulty, with the aim of inspiring future research\nin LLM generalization. The datasets are available at\nhttps://huggingface.co/datasets/furonghuang-lab/Easy2Hard-Bench.", "paper_summary_zh": "<paragraph>儘管從簡單到困難的任務概化對於描述語言模型 (LLM) 至關重要，但對於廣泛複雜性範圍中每個問題的細緻難度註解，資料集仍然是空白的。為了解決這個限制，我們提出了 Easy2Hard-Bench，這是一個格式一致的 6 個基準資料集集合，涵蓋各種領域，例如數學和程式設計問題、西洋棋謎題和推理問題。這些資料集中的每個問題都註有數值的難度分數。為了系統性地估計問題難度，我們收集了大量人類在現實世界中嘗試每個問題或 LLM 在顯著排行榜上的表現資料。利用豐富的表現資料，我們應用完善的難度排名系統，例如項目反應理論 (IRT) 和 Glicko-2 模型，以統一分配數值難度分數給問題。此外，Easy2Hard-Bench 中的資料集與之前的集合不同，具有較高比例的具挑戰性問題。透過與六個最先進的 LLM 進行廣泛的實驗，我們提供了對其在不同難度等級下的表現和概化能力的全面分析，目的是激勵未來在 LLM 概化方面的研究。資料集可在 https://huggingface.co/datasets/furonghuang-lab/Easy2Hard-Bench 取得。</paragraph>", "author": "Mucong Ding et.al.", "authors": "Mucong Ding, Chenghao Deng, Jocelyn Choo, Zichu Wu, Aakriti Agrawal, Avi Schwarzschild, Tianyi Zhou, Tom Goldstein, John Langford, Anima Anandkumar, Furong Huang", "id": "2409.18433v1", "paper_url": "http://arxiv.org/abs/2409.18433v1", "repo": "null"}}