{"2410.19550": {"publish_time": "2024-10-25", "title": "DeMuVGN: Effective Software Defect Prediction Model by Learning Multi-view Software Dependency via Graph Neural Networks", "paper_summary": "Software defect prediction (SDP) aims to identify high-risk defect modules in\nsoftware development, optimizing resource allocation. While previous studies\nshow that dependency network metrics improve defect prediction, most methods\nfocus on code-based dependency graphs, overlooking developer factors. Current\nmetrics, based on handcrafted features like ego and global network metrics,\nfail to fully capture defect-related information. To address this, we propose\nDeMuVGN, a defect prediction model that learns multi-view software dependency\nvia graph neural networks. We introduce a Multi-view Software Dependency Graph\n(MSDG) that integrates data, call, and developer dependencies. DeMuVGN also\nleverages the Synthetic Minority Oversampling Technique (SMOTE) to address\nclass imbalance and enhance defect module identification. In a case study of\neight open-source projects across 20 versions, DeMuVGN demonstrates significant\nimprovements: i) models based on multi-view graphs improve F1 scores by 11.1%\nto 12.1% over single-view models; ii) DeMuVGN improves F1 scores by 17.4% to\n45.8% in within-project contexts and by 17.9% to 41.0% in cross-project\ncontexts. Additionally, DeMuVGN excels in software evolution, showing more\nimprovement in later-stage software versions. Its strong performance across\ndifferent projects highlights its generalizability. We recommend future\nresearch focus on multi-view dependency graphs for defect prediction in both\nmature and newly developed projects.", "paper_summary_zh": "<paragraph>軟體缺陷預測 (SDP) 旨在識別軟體開發中的高風險缺陷模組，最佳化資源配置。雖然先前的研究顯示相依網路指標改善了缺陷預測，但大多數方法都專注於基於程式碼的相依圖，忽略了開發人員因素。當前指標基於手工特徵（例如自我和全域網路指標），無法完全擷取與缺陷相關的資訊。為了解決這個問題，我們提出了 DeMuVGN，一個透過圖神經網路學習多視圖軟體相依性的缺陷預測模型。我們引入了整合資料、呼叫和開發人員相依性的多視圖軟體相依圖 (MSDG)。DeMuVGN 也利用合成少數過採樣技術 (SMOTE) 來解決類別不平衡，並增強缺陷模組識別。在八個跨 20 個版本的開源專案案例研究中，DeMuVGN 展示了顯著的改進：i) 基於多視圖圖形的模型將 F1 分數提高了 11.1% 至 12.1%，高於單一視圖模型；ii) DeMuVGN 將專案內情境的 F1 分數提高了 17.4% 至 45.8%，跨專案情境的 F1 分數提高了 17.9% 至 41.0%。此外，DeMuVGN 在軟體演化中表現出色，在後期的軟體版本中顯示出更大的改進。它在不同專案中的強勁效能突顯了它的泛化性。我們建議未來的研究專注於多視圖相依圖，以進行成熟和新開發專案的缺陷預測。</paragraph>", "author": "Yu Qiao et.al.", "authors": "Yu Qiao, Lina Gong, Yu Zhao, Yongwei Wang, Mingqiang Wei", "id": "2410.19550v1", "paper_url": "http://arxiv.org/abs/2410.19550v1", "repo": "null"}}