{"2306.04791": {"publish_time": "2023-06-07", "title": "XInsight: Revealing Model Insights for GNNs with Flow-based Explanations", "paper_summary": "Progress in graph neural networks has grown rapidly in recent years, with\nmany new developments in drug discovery, medical diagnosis, and recommender\nsystems. While this progress is significant, many networks are `black boxes'\nwith little understanding of the `what' exactly the network is learning. Many\nhigh-stakes applications, such as drug discovery, require human-intelligible\nexplanations from the models so that users can recognize errors and discover\nnew knowledge. Therefore, the development of explainable AI algorithms is\nessential for us to reap the benefits of AI.\n  We propose an explainability algorithm for GNNs called eXplainable Insight\n(XInsight) that generates a distribution of model explanations using GFlowNets.\nSince GFlowNets generate objects with probabilities proportional to a reward,\nXInsight can generate a diverse set of explanations, compared to previous\nmethods that only learn the maximum reward sample. We demonstrate XInsight by\ngenerating explanations for GNNs trained on two graph classification tasks:\nclassifying mutagenic compounds with the MUTAG dataset and classifying acyclic\ngraphs with a synthetic dataset that we have open-sourced. We show the utility\nof XInsight's explanations by analyzing the generated compounds using QSAR\nmodeling, and we find that XInsight generates compounds that cluster by\nlipophilicity, a known correlate of mutagenicity. Our results show that\nXInsight generates a distribution of explanations that uncovers the underlying\nrelationships demonstrated by the model. They also highlight the importance of\ngenerating a diverse set of explanations, as it enables us to discover hidden\nrelationships in the model and provides valuable guidance for further analysis.", "paper_summary_zh": "", "author": "Eli Laird et.al.", "authors": "Eli Laird,Ayesh Madushanka,Elfi Kraka,Corey Clark", "id": "2306.04791v1", "paper_url": "http://arxiv.org/abs/2306.04791v1", "repo": "null"}}