{"2411.12156": {"publish_time": "2024-11-19", "title": "HNCSE: Advancing Sentence Embeddings via Hybrid Contrastive Learning with Hard Negatives", "paper_summary": "Unsupervised sentence representation learning remains a critical challenge in\nmodern natural language processing (NLP) research. Recently, contrastive\nlearning techniques have achieved significant success in addressing this issue\nby effectively capturing textual semantics. Many such approaches prioritize the\noptimization using negative samples. In fields such as computer vision, hard\nnegative samples (samples that are close to the decision boundary and thus more\ndifficult to distinguish) have been shown to enhance representation learning.\nHowever, adapting hard negatives to contrastive sentence learning is complex\ndue to the intricate syntactic and semantic details of text. To address this\nproblem, we propose HNCSE, a novel contrastive learning framework that extends\nthe leading SimCSE approach. The hallmark of HNCSE is its innovative use of\nhard negative samples to enhance the learning of both positive and negative\nsamples, thereby achieving a deeper semantic understanding. Empirical tests on\nsemantic textual similarity and transfer task datasets validate the superiority\nof HNCSE.", "paper_summary_zh": "無監督句子表徵學習仍然是現代自然語言處理 (NLP) 研究中的一項關鍵挑戰。最近，對比學習技術通過有效擷取文本語意在解決此問題方面取得了顯著成功。許多此類方法優先使用負面範例進行最佳化。在電腦視覺等領域中，已證明困難的負面範例（接近決策邊界的範例，因此更難以區分）可以增強表徵學習。然而，由於文字的複雜句法和語義細節，將困難的負面範例調整為對比句子學習很複雜。為了解決這個問題，我們提出了 HNCSE，這是一種新的對比學習架構，它延伸了領先的 SimCSE 方法。HNCSE 的標誌是創新地使用困難的負面範例來增強對正面和負面範例的學習，從而實現更深入的語義理解。在語義文本相似性和轉移任務資料集上的實證測試驗證了 HNCSE 的優越性。", "author": "Wenxiao Liu et.al.", "authors": "Wenxiao Liu, Zihong Yang, Chaozhuo Li, Zijin Hong, Jianfeng Ma, Zhiquan Liu, Litian Zhang, Feiran Huang", "id": "2411.12156v1", "paper_url": "http://arxiv.org/abs/2411.12156v1", "repo": "null"}}