{"2411.11504": {"publish_time": "2024-11-18", "title": "Search, Verify and Feedback: Towards Next Generation Post-training Paradigm of Foundation Models via Verifier Engineering", "paper_summary": "The evolution of machine learning has increasingly prioritized the\ndevelopment of powerful models and more scalable supervision signals. However,\nthe emergence of foundation models presents significant challenges in providing\neffective supervision signals necessary for further enhancing their\ncapabilities. Consequently, there is an urgent need to explore novel\nsupervision signals and technical approaches. In this paper, we propose\nverifier engineering, a novel post-training paradigm specifically designed for\nthe era of foundation models. The core of verifier engineering involves\nleveraging a suite of automated verifiers to perform verification tasks and\ndeliver meaningful feedback to foundation models. We systematically categorize\nthe verifier engineering process into three essential stages: search, verify,\nand feedback, and provide a comprehensive review of state-of-the-art research\ndevelopments within each stage. We believe that verifier engineering\nconstitutes a fundamental pathway toward achieving Artificial General\nIntelligence.", "paper_summary_zh": "機器學習的演進越來越優先考慮開發強大的模型和更具可擴充性的監督信號。然而，基礎模型的出現對提供進一步增強其能力所需的有效監督信號提出了重大挑戰。因此，迫切需要探索創新的監督信號和技術方法。在本文中，我們提出了驗證器工程，這是一種專門為基礎模型時代設計的新穎後訓練範例。驗證器工程的核心涉及利用一組自動化驗證器來執行驗證任務，並向基礎模型提供有意義的回饋。我們將驗證器工程流程系統化地分類為三個基本階段：搜尋、驗證和回饋，並對每個階段中最先進的研究發展提供全面的回顧。我們相信驗證器工程構成了實現人工通用智慧的基本途徑。", "author": "Xinyan Guan et.al.", "authors": "Xinyan Guan, Yanjiang Liu, Xinyu Lu, Boxi Cao, Ben He, Xianpei Han, Le Sun, Jie Lou, Bowen Yu, Yaojie Lu, Hongyu Lin", "id": "2411.11504v1", "paper_url": "http://arxiv.org/abs/2411.11504v1", "repo": "null"}}