{"2405.03832": {"publish_time": "2024-05-06", "title": "Guylingo: The Republic of Guyana Creole Corpora", "paper_summary": "While major languages often enjoy substantial attention and resources, the\nlinguistic diversity across the globe encompasses a multitude of smaller,\nindigenous, and regional languages that lack the same level of computational\nsupport. One such region is the Caribbean. While commonly labeled as \"English\nspeaking\", the ex-British Caribbean region consists of a myriad of Creole\nlanguages thriving alongside English. In this paper, we present Guylingo: a\ncomprehensive corpus designed for advancing NLP research in the domain of\nCreolese (Guyanese English-lexicon Creole), the most widely spoken language in\nthe culturally rich nation of Guyana. We first outline our framework for\ngathering and digitizing this diverse corpus, inclusive of colloquial\nexpressions, idioms, and regional variations in a low-resource language. We\nthen demonstrate the challenges of training and evaluating NLP models for\nmachine translation in Creole. Lastly, we discuss the unique opportunities\npresented by recent NLP advancements for accelerating the formal adoption of\nCreole languages as official languages in the Caribbean.", "paper_summary_zh": "雖然主流語言通常備受關注且資源豐富，但全球的語言多元性涵蓋了許多規模較小、本土且區域性的語言，這些語言缺乏相同的計算支援。加勒比海地區就是這樣的一個區域。儘管通常被標記為「英語系」，但前英國加勒比海地區包含了許多與英語並存且蓬勃發展的克里奧爾語。在本文中，我們展示了 Guylingo：一個全面的語料庫，旨在推進克里奧爾語（蓋亞那英語詞彙克里奧爾語）領域的自然語言處理研究，這是文化豐富的蓋亞那國家中最廣泛使用的語言。我們首先概述了我們收集和數位化這個多元語料庫的架構，包括口語表達、慣用語和低資源語言中的區域變異。然後，我們展示了在克里奧爾語中訓練和評估機器翻譯的自然語言處理模型的挑戰。最後，我們討論了最近自然語言處理進展帶來的獨特機會，以加速在加勒比海地區正式採用克里奧爾語作為官方語言。", "author": "Christopher Clarke et.al.", "authors": "Christopher Clarke, Roland Daynauth, Charlene Wilkinson, Hubert Devonish, Jason Mars", "id": "2405.03832v1", "paper_url": "http://arxiv.org/abs/2405.03832v1", "repo": "null"}}