{"2502.15203": {"publish_time": "2025-02-21", "title": "FlipConcept: Tuning-Free Multi-Concept Personalization for Text-to-Image Generation", "paper_summary": "Recently, methods that integrate multiple personalized concepts into a single\nimage have garnered significant attention in the field of text-to-image (T2I)\ngeneration. However, existing methods experience performance degradation in\ncomplex scenes with multiple objects due to distortions in non-personalized\nregions. To address this issue, we propose FlipConcept, a novel approach that\nseamlessly integrates multiple personalized concepts into a single image\nwithout requiring additional tuning. We introduce guided appearance attention\nto accurately mimic the appearance of a personalized concept as intended.\nAdditionally, we introduce mask-guided noise mixing to protect non-personalized\nregions during editing. Lastly, we apply background dilution to minimize\nattribute leakage, which is the undesired blending of personalized concept\nattributes with other objects in the image. In our experiments, we demonstrate\nthat the proposed method, despite not requiring tuning, outperforms existing\nmodels in both single and multiple personalized concept inference.", "paper_summary_zh": "近年來，將多個客製化概念整合到單一影像中的方法在文字轉影像 (T2I) 生成領域備受關注。然而，現有方法在包含多個物件的複雜場景中會遭遇效能下降的問題，這是由於非客製化區域出現扭曲所致。為了解決這個問題，我們提出了 FlipConcept，這是一種創新的方法，可將多個客製化概念無縫整合到單一影像中，而無需額外調整。我們引入了引導式外觀注意力，以精確模擬客製化概念的外觀。此外，我們引入了遮罩引導雜訊混合，以在編輯過程中保護非客製化區域。最後，我們採用背景稀釋來最小化屬性外洩，這是客製化概念屬性與影像中其他物件不必要的混合。在我們的實驗中，我們證明了所提出的方法，儘管不需要調整，但在單一和多個客製化概念推論中都優於現有模型。", "author": "Young Beom Woo et.al.", "authors": "Young Beom Woo, Sun Eung Kim", "id": "2502.15203v1", "paper_url": "http://arxiv.org/abs/2502.15203v1", "repo": "null"}}