{"2407.19994": {"publish_time": "2024-07-29", "title": "A Study on the Implementation Method of an Agent-Based Advanced RAG System Using Graph", "paper_summary": "This study aims to improve knowledge-based question-answering (QA) systems by\novercoming the limitations of existing Retrieval-Augmented Generation (RAG)\nmodels and implementing an advanced RAG system based on Graph technology to\ndevelop high-quality generative AI services. While existing RAG models\ndemonstrate high accuracy and fluency by utilizing retrieved information, they\nmay suffer from accuracy degradation as they generate responses using\npre-loaded knowledge without reprocessing. Additionally, they cannot\nincorporate real-time data after the RAG configuration stage, leading to issues\nwith contextual understanding and biased information. To address these\nlimitations, this study implemented an enhanced RAG system utilizing Graph\ntechnology. This system is designed to efficiently search and utilize\ninformation. Specifically, it employs LangGraph to evaluate the reliability of\nretrieved information and synthesizes diverse data to generate more accurate\nand enhanced responses. Furthermore, the study provides a detailed explanation\nof the system's operation, key implementation steps, and examples through\nimplementation code and validation results, thereby enhancing the understanding\nof advanced RAG technology. This approach offers practical guidelines for\nimplementing advanced RAG systems in corporate services, making it a valuable\nresource for practical application.", "paper_summary_zh": "本研究旨在透過克服現有檢索增強生成 (RAG) 模型的限制，並實作基於圖形技術的進階 RAG 系統，來改善基於知識的問答 (QA) 系統，以開發高品質的生成式 AI 服務。現有的 RAG 模型雖然透過利用檢索到的資訊展現出高準確度和流暢度，但由於使用預載知識來產生回應而沒有重新處理，因此可能會導致準確度下降。此外，它們無法在 RAG 設定階段後納入即時資料，導致情境理解和資訊偏誤的問題。為了解決這些限制，本研究實作了一個利用圖形技術的增強型 RAG 系統。此系統旨在有效搜尋和利用資訊。具體來說，它採用 LangGraph 來評估檢索到的資訊的可信度，並綜合不同的資料來產生更準確且增強的回應。此外，本研究透過實作程式碼和驗證結果，詳細說明系統的操作、主要的實作步驟和範例，進而增進對進階 RAG 技術的理解。這種方法為在企業服務中實作進階 RAG 系統提供了實用的指南，使其成為實務應用的寶貴資源。", "author": "Cheonsu Jeong et.al.", "authors": "Cheonsu Jeong", "id": "2407.19994v1", "paper_url": "http://arxiv.org/abs/2407.19994v1", "repo": "null"}}