{"2408.12762": {"publish_time": "2024-08-22", "title": "Visual Verity in AI-Generated Imagery: Computational Metrics and Human-Centric Analysis", "paper_summary": "The rapid advancements in AI technologies have revolutionized the production\nof graphical content across various sectors, including entertainment,\nadvertising, and e-commerce. These developments have spurred the need for\nrobust evaluation methods to assess the quality and realism of AI-generated\nimages. To address this, we conducted three studies. First, we introduced and\nvalidated a questionnaire called Visual Verity, which measures photorealism,\nimage quality, and text-image alignment. Second, we applied this questionnaire\nto assess images from AI models (DALL-E2, DALL-E3, GLIDE, Stable Diffusion) and\ncamera-generated images, revealing that camera-generated images excelled in\nphotorealism and text-image alignment, while AI models led in image quality. We\nalso analyzed statistical properties, finding that camera-generated images\nscored lower in hue, saturation, and brightness. Third, we evaluated\ncomputational metrics' alignment with human judgments, identifying MS-SSIM and\nCLIP as the most consistent with human assessments. Additionally, we proposed\nthe Neural Feature Similarity Score (NFSS) for assessing image quality. Our\nfindings highlight the need for refining computational metrics to better\ncapture human visual perception, thereby enhancing AI-generated content\nevaluation.", "paper_summary_zh": "人工智能技術的快速進步，徹底改變了各個領域的圖形內容製作，包括娛樂、廣告和電子商務。這些發展促使需要穩健的評估方法來評估 AI 生成的圖像品質和真實性。為了解決這個問題，我們進行了三項研究。首先，我們介紹並驗證了一個名為 Visual Verity 的問卷，它測量了寫實性、圖像品質和文字與圖像的對齊方式。其次，我們使用這個問卷來評估來自 AI 模型（DALL-E2、DALL-E3、GLIDE、Stable Diffusion）和相機生成的圖像，結果顯示相機生成的圖像在寫實性和文字與圖像的對齊方面表現出色，而 AI 模型在圖像品質方面領先。我們還分析了統計特性，發現相機生成的圖像在色相、飽和度和亮度方面的得分較低。第三，我們評估了計算度量與人類判斷的一致性，發現 MS-SSIM 和 CLIP 與人類評估最一致。此外，我們提出了神經特徵相似度評分（NFSS）來評估圖像品質。我們的研究結果強調了改進計算度量以更好地捕捉人類視覺感知的必要性，從而增強 AI 生成的內容評估。", "author": "Memoona Aziz et.al.", "authors": "Memoona Aziz, Umair Rahman, Syed Ali Safi, Amir Zaib Abbasi", "id": "2408.12762v1", "paper_url": "http://arxiv.org/abs/2408.12762v1", "repo": "null"}}