{"2408.12805": {"publish_time": "2024-08-23", "title": "A Safe Self-evolution Algorithm for Autonomous Driving Based on Data-Driven Risk Quantification Model", "paper_summary": "Autonomous driving systems with self-evolution capabilities have the\npotential to independently evolve in complex and open environments, allowing to\nhandle more unknown scenarios. However, as a result of the safety-performance\ntrade-off mechanism of evolutionary algorithms, it is difficult to ensure safe\nexploration without sacrificing the improvement ability. This problem is\nespecially prominent in dynamic traffic scenarios. Therefore, this paper\nproposes a safe self-evolution algorithm for autonomous driving based on\ndata-driven risk quantification model. Specifically, a risk quantification\nmodel based on the attention mechanism is proposed by modeling the way humans\nperceive risks during driving, with the idea of achieving safety situation\nestimation of the surrounding environment through a data-driven approach. To\nprevent the impact of over-conservative safety guarding policies on the\nself-evolution capability of the algorithm, a safety-evolutionary\ndecision-control integration algorithm with adjustable safety limits is\nproposed, and the proposed risk quantization model is integrated into it.\nSimulation and real-vehicle experiments results illustrate the effectiveness of\nthe proposed method. The results show that the proposed algorithm can generate\nsafe and reasonable actions in a variety of complex scenarios and guarantee\nsafety without losing the evolutionary potential of learning-based autonomous\ndriving systems.", "paper_summary_zh": "具有自我演進能力的自動駕駛系統有潛力在複雜且開放的環境中獨立演進，從而能夠處理更多未知場景。然而，由於演算法演化安全效能權衡機制，難以在不犧牲改進能力下確保安全探索。此問題在動態交通場景中尤為突出。因此，本文提出基於數據驅動風險量化模型的自動駕駛安全自我演化演算法。具體而言，提出基於注意力機制的風險量化模型，模擬人類駕駛時感知風險的方式，以期通過數據驅動方式實現對周圍環境的安全態勢評估。為避免過於保守的安全防護策略對演算法自我演化能力的影響，提出具有可調安全邊界的安全演化決策控制整合演算法，並將所提出的風險量化模型整合其中。模擬與實車實驗結果說明了所提方法的有效性。結果表明，所提演算法能在多種複雜場景下產生安全合理的動作，且在不喪失學習型自動駕駛系統演化潛力的前提下保證安全性。", "author": "Shuo Yang et.al.", "authors": "Shuo Yang, Shizhen Li, Yanjun Huang, Hong Chen", "id": "2408.12805v1", "paper_url": "http://arxiv.org/abs/2408.12805v1", "repo": "null"}}