{"2407.20083": {"publish_time": "2024-07-29", "title": "An Energy-based Model for Word-level AutoCompletion in Computer-aided Translation", "paper_summary": "Word-level AutoCompletion(WLAC) is a rewarding yet challenging task in\nComputer-aided Translation. Existing work addresses this task through a\nclassification model based on a neural network that maps the hidden vector of\nthe input context into its corresponding label (i.e., the candidate target word\nis treated as a label). Since the context hidden vector itself does not take\nthe label into account and it is projected to the label through a linear\nclassifier, the model can not sufficiently leverage valuable information from\nthe source sentence as verified in our experiments, which eventually hinders\nits overall performance. To alleviate this issue, this work proposes an\nenergy-based model for WLAC, which enables the context hidden vector to capture\ncrucial information from the source sentence. Unfortunately, training and\ninference suffer from efficiency and effectiveness challenges, thereby we\nemploy three simple yet effective strategies to put our model into practice.\nExperiments on four standard benchmarks demonstrate that our reranking-based\napproach achieves substantial improvements (about 6.07%) over the previous\nstate-of-the-art model. Further analyses show that each strategy of our\napproach contributes to the final performance.", "paper_summary_zh": "字級自動完成 (WLAC) 是電腦輔助翻譯中既有回報又有挑戰性的任務。現有工作透過一個基於神經網路的分類模型來處理此任務，該模型將輸入內容的隱藏向量對應到其相應的標籤（亦即，候選目標字詞被視為一個標籤）。由於內容隱藏向量本身並未考量標籤，且它透過線性分類器投影到標籤，因此該模型無法充分利用原始句子的有價值資訊，正如我們在實驗中驗證的那樣，這最終會阻礙其整體效能。為了緩解此問題，本研究提出一個基於能量的 WLAC 模型，讓內容隱藏向量能夠擷取原始句子的關鍵資訊。不幸的是，訓練和推論會遭遇效率和效能的挑戰，因此我們採用三個簡單但有效的策略來實踐我們的模型。在四個標準基準上的實驗證明，我們的重新排序方法比先前的最先進模型獲得顯著的改進（約 6.07%）。進一步的分析顯示，我們方法的每個策略都有助於最終效能。", "author": "Cheng Yang et.al.", "authors": "Cheng Yang, Guoping Huang, Mo Yu, Zhirui Zhang, Siheng Li, Mingming Yang, Shuming Shi, Yujiu Yang, Lemao Liu", "id": "2407.20083v1", "paper_url": "http://arxiv.org/abs/2407.20083v1", "repo": "null"}}