{"2408.04057": {"publish_time": "2024-08-07", "title": "PowerPM: Foundation Model for Power Systems", "paper_summary": "The emergence of abundant electricity time series (ETS) data provides ample\nopportunities for various applications in the power systems, including\ndemand-side management, grid stability, and consumer behavior analysis. Deep\nlearning models have advanced ETS modeling by effectively capturing sequence\ndependence. Nevertheless, learning a generic representation of ETS data for\nvarious applications remains challenging due to the inherently complex\nhierarchical structure of ETS data. Moreover, ETS data exhibits intricate\ntemporal dependencies and is suscepti ble to the influence of exogenous\nvariables. Furthermore, different instances exhibit diverse electricity\nconsumption behavior. In this paper, we propose a foundation model PowerPM to\nmodel ETS data, providing a large-scale, off-the-shelf model for power systems.\nPowerPM consists of a temporal encoder and a hierarchical encoder. The temporal\nencoder captures both temporal dependencies in ETS data, considering exogenous\nvariables. The hierarchical encoder models the correlation between hierarchy.\nFurthermore, PowerPM leverages a novel self-supervised pretraining framework\nconsisting of masked ETS modeling and dual-view contrastive learning, which\nenable PowerPM to capture temporal dependency within ETS windows and aware the\ndiscrepancy across ETS windows, providing two different perspectives to learn\ngeneric representation. Our experiments involve five real world scenario\ndatasets, comprising private and public data. Through pre-training on massive\nETS data, PowerPM achieves SOTA performance on diverse downstream tasks within\nthe private dataset. Impressively, when transferred to the public datasets,\nPowerPM maintains its superiority, showcasing its remarkable generalization\nability across various tasks and domains. Moreover, ablation studies, few-shot\nexperiments provide additional evidence of the effectiveness of our model.", "paper_summary_zh": "豐富電力時間序列 (ETS) 資料的出現，為電力系統中的各種應用提供了充足的機會，包括需求側管理、電網穩定性和消費者行為分析。深度學習模型透過有效擷取序列依賴性，提升了 ETS 建模。儘管如此，由於 ETS 資料固有的複雜階層結構，學習通用 ETS 資料表示以供各種應用仍然具有挑戰性。此外，ETS 資料表現出複雜的時間依賴性，並且容易受到外生變數的影響。此外，不同的實例表現出不同的電力消耗行為。在本文中，我們提出了一個基礎模型 PowerPM 來建模 ETS 資料，為電力系統提供一個大規模的現成模型。PowerPM 包含一個時間編碼器和一個階層編碼器。時間編碼器擷取 ETS 資料中的時間依賴性，並考慮外生變數。階層編碼器對階層之間的相關性進行建模。此外，PowerPM 利用一個新穎的自監督預訓練架構，其中包含遮蔽 ETS 建模和雙視對比學習，這使 PowerPM 能夠擷取 ETS 視窗中的時間依賴性，並了解 ETS 視窗之間的差異，提供兩種不同的觀點來學習通用表示。我們的實驗涉及五個真實世界場景資料集，包含私人和公共資料。透過在大量 ETS 資料上進行預訓練，PowerPM 在私人資料集中實現了 SOTA 在各種下游任務上的效能。令人印象深刻的是，當轉移到公共資料集時，PowerPM 保持其優越性，展示其在各種任務和領域中的顯著泛化能力。此外，消融研究、小樣本實驗提供了我們模型有效性的額外證據。", "author": "Shihao Tu et.al.", "authors": "Shihao Tu, Yupeng Zhang, Jing Zhang, Yang Yang", "id": "2408.04057v1", "paper_url": "http://arxiv.org/abs/2408.04057v1", "repo": "null"}}