{"2406.09295": {"publish_time": "2024-06-13", "title": "AlignMMBench: Evaluating Chinese Multimodal Alignment in Large Vision-Language Models", "paper_summary": "Evaluating the alignment capabilities of large Vision-Language Models (VLMs)\nis essential for determining their effectiveness as helpful assistants.\nHowever, existing benchmarks primarily focus on basic abilities using nonverbal\nmethods, such as yes-no and multiple-choice questions. In this paper, we\naddress this gap by introducing AlignMMBench, a comprehensive alignment\nbenchmark specifically designed for emerging Chinese VLMs. This benchmark is\nmeticulously curated from real-world scenarios and Chinese Internet sources,\nencompassing thirteen specific tasks across three categories, and includes both\nsingle-turn and multi-turn dialogue scenarios. Incorporating a prompt rewrite\nstrategy, AlignMMBench encompasses 1,054 images and 4,978 question-answer\npairs. To facilitate the evaluation pipeline, we propose CritiqueVLM, a\nrule-calibrated evaluator that exceeds GPT-4's evaluation ability. Finally, we\nreport the performance of representative VLMs on AlignMMBench, offering\ninsights into the capabilities and limitations of different VLM architectures.\nAll evaluation codes and data are available on https://alignmmbench.github.io.", "paper_summary_zh": "評估大型視覺語言模型 (VLM) 的對齊能力對於確定其作為有用助理的有效性至關重要。\n然而，現有的基準主要集中於使用非語言方法的基本能力，例如是非題和多選題。\n在本文中，我們通過引入 AlignMMBench 來解決這一差距，AlignMMBench 是一個專門為新興中文 VLM 設計的綜合對齊基準。\n這個基準是從真實世界的場景和中文網路來源精心策劃的，涵蓋了三個類別中的 13 個具體任務，包括單輪和多輪對話場景。\nAlignMMBench 採用提示重寫策略，包含 1,054 張圖片和 4,978 個問答對。\n為了促進評估管道，我們提出了 CritiqueVLM，這是一個規則校準的評估器，其評估能力超過了 GPT-4。\n最後，我們報告了代表性 VLM 在 AlignMMBench 上的表現，提供了對不同 VLM 架構的能力和限制的見解。\n所有評估代碼和數據都可以在 https://alignmmbench.github.io/ 上找到。", "author": "Yuhang Wu et.al.", "authors": "Yuhang Wu, Wenmeng Yu, Yean Cheng, Yan Wang, Xiaohan Zhang, Jiazheng Xu, Ming Ding, Yuxiao Dong", "id": "2406.09295v1", "paper_url": "http://arxiv.org/abs/2406.09295v1", "repo": "null"}}