{"2412.19255": {"publish_time": "2024-12-26", "title": "Multi-matrix Factorization Attention", "paper_summary": "We propose novel attention architectures, Multi-matrix Factorization\nAttention (MFA) and MFA-Key-Reuse (MFA-KR). Existing variants for standard\nMulti-Head Attention (MHA), including SOTA methods like MLA, fail to maintain\nas strong performance under stringent Key-Value cache (KV cache) constraints.\nMFA enhances model capacity by efficiently scaling up both the number and\ndimension of attention heads through low-rank matrix factorization in the\nQuery-Key (QK) circuit. Extending MFA, MFA-KR further reduces memory\nrequirements by repurposing the key cache as value through value projection\nre-parameterization. MFA's design enables strong model capacity when working\nunder tight KV cache budget, while MFA-KR is suitable for even harsher KV cache\nlimits with minor performance trade-off. Notably, in our extensive and\nlarge-scale experiments, the proposed architecture outperforms MLA and performs\ncomparably to MHA, while reducing KV cache usage by up to 56% and 93.7%,\nrespectively.", "paper_summary_zh": "<paragraph>我們提出新穎的注意力架構，多矩陣分解注意力 (MFA) 和 MFA 鍵重複使用 (MFA-KR)。現有的標準多頭注意力 (MHA) 變體，包括 MLA 等 SOTA 方法，無法在嚴格的鍵值快取 (KV 快取) 限制下維持強勁的效能。MFA 透過在查詢鍵 (QK) 電路中進行低階矩陣分解，有效地擴充注意力頭的數量和維度，進而增強模型容量。擴充 MFA 後，MFA-KR 進一步透過價值投影重新參數化，將鍵快取重新用作值，進而降低記憶體需求。MFA 的設計在嚴格的 KV 快取預算下，能提供強勁的模型容量，而 MFA-KR 則適用於更嚴苛的 KV 快取限制，效能折衷較小。值得注意的是，在我們廣泛且大規模的實驗中，所提出的架構優於 MLA，且效能與 MHA 相當，同時分別將 KV 快取使用量減少了 56% 和 93.7%。</paragraph>", "author": "Jingcheng Hu et.al.", "authors": "Jingcheng Hu, Houyi Li, Yinmin Zhang, Zili Wang, Shuigeng Zhou, Xiangyu Zhang, Heung-Yeung Shum", "id": "2412.19255v1", "paper_url": "http://arxiv.org/abs/2412.19255v1", "repo": "null"}}