{"2405.08497": {"publish_time": "2024-05-14", "title": "Is Less More? Quality, Quantity and Context in Idiom Processing with Natural Language Models", "paper_summary": "Compositionality in language models presents a problem when processing\nidiomatic expressions, as their meaning often cannot be directly derived from\ntheir individual parts. Although fine-tuning and other optimization strategies\ncan be used to improve representations of idiomatic expressions, this depends\non the availability of relevant data. We present the Noun Compound Synonym\nSubstitution in Books - NCSSB - datasets, which are created by substitution of\nsynonyms of potentially idiomatic English noun compounds in public domain book\ntexts. We explore the trade-off between data quantity and quality when training\nmodels for idiomaticity detection, in conjunction with contextual information\nobtained locally (from the surrounding sentences) or externally (through\nlanguage resources). Performance on an idiomaticity detection task indicates\nthat dataset quality is a stronger factor for context-enriched models, but that\nquantity also plays a role in models without context inclusion strategies.", "paper_summary_zh": "語言模型中的組成性在處理慣用語時會產生一個問題，因為它們的意義通常無法直接從它們的個別部分推導出來。儘管微調和其他最佳化策略可用於改善慣用語的表示，這取決於相關資料的可用性。我們提出名詞複合同義詞替代書籍 - NCSSB - 資料集，它是通過在公共領域書籍文本中替換潛在慣用語的英文名詞複合詞的同義詞而建立的。我們探討了在訓練慣用性偵測模型時資料數量和品質之間的折衷，並結合從當地（來自周圍句子）或外部（透過語言資源）獲得的脈絡資訊。慣用性偵測任務的表現指出，資料集品質是脈絡豐富模型的較強影響因素，但數量也在沒有脈絡納入策略的模型中發揮作用。", "author": "Agne Knietaite et.al.", "authors": "Agne Knietaite, Adam Allsebrook, Anton Minkov, Adam Tomaszewski, Norbert Slinko, Richard Johnson, Thomas Pickard, Dylan Phelps, Aline Villavicencio", "id": "2405.08497v1", "paper_url": "http://arxiv.org/abs/2405.08497v1", "repo": "null"}}