{"2411.08010": {"publish_time": "2024-11-12", "title": "ExpressivityArena: Can LLMs Express Information Implicitly?", "paper_summary": "While Large Language Models (LLMs) have demonstrated remarkable performance\nin certain dimensions, their ability to express implicit language cues that\nhuman use for effective communication remains unclear. This paper presents\nExpressivityArena, a Python library for measuring the implicit communication\nabilities of LLMs. We provide a comprehensive framework to evaluate\nexpressivity of arbitrary LLMs and explore its practical implications. To this\nend, we refine the definition and measurements of ``expressivity,'' and use our\nframework in a set of small experiments. These experiments test LLMs in\ncreative and logical tasks such as poetry, coding, and emotion-based responses.\nThey are then evaluated by an automated grader, through ExpressivityArena,\nwhich we verify to be the most pragmatic for testing expressivity. Building on\nthese experiments, we deepen our understanding of the expressivity of LLMs by\nassessing their ability to remain expressive in conversations. Our findings\nindicate that LLMs are capable of generating and understanding expressive\ncontent, however, with some limitations. These insights will inform the future\ndevelopment and deployment of expressive LLMs. We provide the code for\nExpressivityArena alongside our paper.", "paper_summary_zh": "<paragraph>儘管大型語言模型 (LLM) 在某些面向展示出卓越的表現，它們表達人類用於有效溝通的隱含語言線索的能力仍不明確。本文提出 ExpressivityArena，一個用於測量 LLM 隱含溝通能力的 Python 函式庫。我們提供一個全面的架構來評估任意 LLM 的表達能力，並探討其實際影響。為此，我們改進了「表達能力」的定義和測量，並在一些小型實驗中使用我們的架構。這些實驗在詩歌、編碼和基於情緒的回應等創造性和邏輯任務中測試 LLM。然後，它們通過 ExpressivityArena 由自動評分器評估，我們驗證它是測試表達能力最實用的方法。在這些實驗的基礎上，我們通過評估 LLM 在對話中保持表達能力的能力，加深了我們對 LLM 表達能力的理解。我們的研究結果表明，LLM 能夠產生和理解富有表現力的內容，但有一些限制。這些見解將為未來表達式 LLM 的開發和部署提供資訊。我們在論文中提供了 ExpressivityArena 的程式碼。</paragraph>", "author": "Joshua Tint et.al.", "authors": "Joshua Tint, Som Sagar, Aditya Taparia, Kelly Raines, Bimsara Pathiraja, Caleb Liu, Ransalu Senanayake", "id": "2411.08010v1", "paper_url": "http://arxiv.org/abs/2411.08010v1", "repo": "null"}}