{"2406.08311": {"publish_time": "2024-06-12", "title": "Causality for Tabular Data Synthesis: A High-Order Structure Causal Benchmark Framework", "paper_summary": "Tabular synthesis models remain ineffective at capturing complex\ndependencies, and the quality of synthetic data is still insufficient for\ncomprehensive downstream tasks, such as prediction under distribution shifts,\nautomated decision-making, and cross-table understanding. A major challenge is\nthe lack of prior knowledge about underlying structures and high-order\nrelationships in tabular data. We argue that a systematic evaluation on\nhigh-order structural information for tabular data synthesis is the first step\ntowards solving the problem. In this paper, we introduce high-order structural\ncausal information as natural prior knowledge and provide a benchmark framework\nfor the evaluation of tabular synthesis models. The framework allows us to\ngenerate benchmark datasets with a flexible range of data generation processes\nand to train tabular synthesis models using these datasets for further\nevaluation. We propose multiple benchmark tasks, high-order metrics, and causal\ninference tasks as downstream tasks for evaluating the quality of synthetic\ndata generated by the trained models. Our experiments demonstrate to leverage\nthe benchmark framework for evaluating the model capability of capturing\nhigh-order structural causal information. Furthermore, our benchmarking results\nprovide an initial assessment of state-of-the-art tabular synthesis models.\nThey have clearly revealed significant gaps between ideal and actual\nperformance and how baseline methods differ. Our benchmark framework is\navailable at URL https://github.com/TURuibo/CauTabBench.", "paper_summary_zh": "表格合成模型在捕捉复杂依存关系方面仍然无效，并且合成数据的质量对于全面的下游任务来说仍然不够，例如分布转换下的预测、自动化决策和跨表理解。一个主要挑战是缺乏关于表格数据中底层结构和高阶关系的先验知识。我们认为，对表格数据合成的更高阶结构信息的系统评估是解决该问题的第一步。在本文中，我们引入了高阶结构因果信息作为自然先验知识，并为表格合成模型的评估提供了一个基准框架。该框架允许我们使用灵活的数据生成过程生成基准数据集，并使用这些数据集训练表格合成模型以进行进一步评估。我们提出了多个基准任务、高阶指标和因果推理任务作为下游任务，以评估训练模型生成的合成数据的质量。我们的实验表明，利用基准框架评估模型捕获高阶结构因果信息的能力。此外，我们的基准测试结果对最先进的表格合成模型进行了初步评估。它们清楚地揭示了理想性能和实际性能之间的显着差距，以及基线方法之间的差异。我们的基准框架可在 URL https://github.com/TURuibo/CauTabBench 获得。", "author": "Ruibo Tu et.al.", "authors": "Ruibo Tu, Zineb Senane, Lele Cao, Cheng Zhang, Hedvig Kjellström, Gustav Eje Henter", "id": "2406.08311v1", "paper_url": "http://arxiv.org/abs/2406.08311v1", "repo": "https://github.com/turuibo/cautabbench"}}