{"2411.04685": {"publish_time": "2024-11-07", "title": "Solving Generalized Grouping Problems in Cellular Manufacturing Systems Using a Network Flow Model", "paper_summary": "This paper focuses on the generalized grouping problem in the context of\ncellular manufacturing systems (CMS), where parts may have more than one\nprocess route. A process route lists the machines corresponding to each part of\nthe operation. Inspired by the extensive and widespread use of network flow\nalgorithms, this research formulates the process route family formation for\ngeneralized grouping as a unit capacity minimum cost network flow model. The\nobjective is to minimize dissimilarity (based on the machines required) among\nthe process routes within a family. The proposed model optimally solves the\nprocess route family formation problem without pre-specifying the number of\npart families to be formed. The process route of family formation is the first\nstage in a hierarchical procedure. For the second stage (machine cell\nformation), two procedures, a quadratic assignment programming (QAP)\nformulation and a heuristic procedure, are proposed. The QAP simultaneously\nassigns process route families and machines to a pre-specified number of cells\nin such a way that total machine utilization is maximized. The heuristic\nprocedure for machine cell formation is hierarchical in nature. Computational\nresults for some test problems show that the QAP and the heuristic procedure\nyield the same results.", "paper_summary_zh": "本文重點探討具有多個製程路徑的蜂巢式製造系統 (CMS) 中的廣義群組問題。製程路徑列出對應於作業各部分的機器。受到網路流演算法廣泛使用的啟發，本研究將廣義群組的製程路徑族形成制定為單位容量最小成本網路流模型。目標是將一個族內製程路徑之間的差異性（依據所需的機器）降到最低。所提出的模型可以最佳化解決製程路徑族形成問題，而無須預先指定要形成的零件族數量。製程路徑族形成是階層式程序的第一階段。對於第二階段（機器單元形成），本文提出兩種程序：二次指派規劃 (QAP) 公式和啟發式程序。QAP 同時將製程路徑族和機器指派到預先指定數量的單元中，以使總機器使用率最大化。機器單元形成的啟發式程序本質上是階層式的。一些測試問題的計算結果顯示，QAP 和啟發式程序會產生相同的結果。", "author": "Md. Kutub Uddin et.al.", "authors": "Md. Kutub Uddin, Md. Saiful Islam, Md Abrar Jahin, Md. Saiful Islam Seam, M. F. Mridha", "id": "2411.04685v1", "paper_url": "http://arxiv.org/abs/2411.04685v1", "repo": "null"}}