{"2501.02552": {"publish_time": "2025-01-05", "title": "Multi-LLM Collaborative Caption Generation in Scientific Documents", "paper_summary": "Scientific figure captioning is a complex task that requires generating\ncontextually appropriate descriptions of visual content. However, existing\nmethods often fall short by utilizing incomplete information, treating the task\nsolely as either an image-to-text or text summarization problem. This\nlimitation hinders the generation of high-quality captions that fully capture\nthe necessary details. Moreover, existing data sourced from arXiv papers\ncontain low-quality captions, posing significant challenges for training large\nlanguage models (LLMs). In this paper, we introduce a framework called\nMulti-LLM Collaborative Figure Caption Generation (MLBCAP) to address these\nchallenges by leveraging specialized LLMs for distinct sub-tasks. Our approach\nunfolds in three key modules: (Quality Assessment) We utilize multimodal LLMs\nto assess the quality of training data, enabling the filtration of low-quality\ncaptions. (Diverse Caption Generation) We then employ a strategy of\nfine-tuning/prompting multiple LLMs on the captioning task to generate\ncandidate captions. (Judgment) Lastly, we prompt a prominent LLM to select the\nhighest quality caption from the candidates, followed by refining any remaining\ninaccuracies. Human evaluations demonstrate that informative captions produced\nby our approach rank better than human-written captions, highlighting its\neffectiveness. Our code is available at https://github.com/teamreboott/MLBCAP", "paper_summary_zh": "科學圖形說明是一個複雜的任務，需要產生視覺內容的適當描述。然而，現有的方法通常會因為利用不完整的資訊，將任務僅當作影像轉文字或文字摘要的問題而失敗。這個限制阻礙了產生高品質的說明，無法完全捕捉必要的細節。此外，現有從 arXiv 論文中取得的資料包含低品質的說明，對訓練大型語言模型 (LLM) 造成重大的挑戰。在本文中，我們介紹一個稱為多 LLM 協作圖形說明產生 (MLBCAP) 的架構，透過利用特殊 LLM 處理不同的子任務來解決這些挑戰。我們的做法分為三個關鍵模組：(品質評估) 我們利用多模態 LLM 評估訓練資料的品質，能夠過濾低品質的說明。(多樣化說明產生) 接著我們使用微調/提示多個 LLM 執行說明任務的策略，產生候選說明。(判斷) 最後，我們提示一個著名的 LLM 從候選說明中選擇品質最高的說明，接著修正任何剩下的不準確之處。人類評估顯示，我們的做法產生的資訊性說明，排名優於人類撰寫的說明，突顯其有效性。我們的程式碼可在 https://github.com/teamreboott/MLBCAP 取得", "author": "Jaeyoung Kim et.al.", "authors": "Jaeyoung Kim, Jongho Lee, Hong-Jun Choi, Ting-Yao Hsu, Chieh-Yang Huang, Sungchul Kim, Ryan Rossi, Tong Yu, Clyde Lee Giles, Ting-Hao 'Kenneth' Huang, Sungchul Choi", "id": "2501.02552v1", "paper_url": "http://arxiv.org/abs/2501.02552v1", "repo": "null"}}