{"2407.16192": {"publish_time": "2024-07-23", "title": "How to Leverage Personal Textual Knowledge for Personalized Conversational Information Retrieval", "paper_summary": "Personalized conversational information retrieval (CIR) combines\nconversational and personalizable elements to satisfy various users' complex\ninformation needs through multi-turn interaction based on their backgrounds.\nThe key promise is that the personal textual knowledge base (PTKB) can improve\nthe CIR effectiveness because the retrieval results can be more related to the\nuser's background. However, PTKB is noisy: not every piece of knowledge in PTKB\nis relevant to the specific query at hand. In this paper, we explore and test\nseveral ways to select knowledge from PTKB and use it for query reformulation\nby using a large language model (LLM). The experimental results show the PTKB\nmight not always improve the search results when used alone, but LLM can help\ngenerate a more appropriate personalized query when high-quality guidance is\nprovided.", "paper_summary_zh": "個人化對話式資訊檢索 (CIR) 結合對話式和個人化元素，透過基於使用者背景的多輪互動來滿足各種使用者的複雜資訊需求。其關鍵承諾是個人化文字知識庫 (PTKB) 能提升 CIR 的效果，因為檢索結果可以更貼近使用者的背景。然而，PTKB 存在雜訊：PTKB 中的每一則知識並不都與手邊的特定查詢相關。在本文中，我們探討並測試多種從 PTKB 中選取知識並使用它來重新表述查詢的方法，方法是使用大型語言模型 (LLM)。實驗結果顯示，PTKB 獨自使用時可能無法總是提升搜尋結果，但當提供高品質的引導時，LLM 能協助產生更適當的個人化查詢。", "author": "Fengran Mo et.al.", "authors": "Fengran Mo, Longxiang Zhao, Kaiyu Huang, Yue Dong, Degen Huang, Jian-Yun Nie", "id": "2407.16192v1", "paper_url": "http://arxiv.org/abs/2407.16192v1", "repo": "null"}}