{"2502.11866": {"publish_time": "2025-02-17", "title": "Southern Newswire Corpus: A Large-Scale Dataset of Mid-Century Wire Articles Beyond the Front Page", "paper_summary": "I introduce a new large-scale dataset of historical wire articles from U.S.\nSouthern newspapers, spanning 1960-1975 and covering multiple wire services:\nThe Associated Press, United Press International, Newspaper Enterprise\nAssociation. Unlike prior work focusing on front-page content, this dataset\ncaptures articles across the entire newspaper, offering broader insight into\nmid-century Southern coverage. The dataset includes a version that has\nundergone an LLM-based text cleanup pipeline to reduce OCR noise, enhancing its\nsuitability for quantitative text analysis. Additionally, duplicate versions of\narticles are retained to enable analysis of editorial differences in language\nand framing across newspapers. Each article is tagged by wire service,\nfacilitating comparative studies of editorial patterns across agencies. This\nresource opens new avenues for research in computational social science,\ndigital humanities, and historical linguistics, providing a detailed\nperspective on how Southern newspapers relayed national and international news\nduring a transformative period in American history. The dataset will be made\navailable upon publication or request for research purposes.", "paper_summary_zh": "我介紹一個新的美國歷史電訊文章大型資料集，時間跨度為 1960-1975 年，涵蓋多個電訊服務：美聯社、美聯國際社、報業企業協會。與先前專注於頭版內容的研究不同，此資料集擷取了整份報紙的文章，提供更廣泛的見解，深入探討世紀中葉的南方報導。該資料集包含一個經過 LLM 文字清理管線處理的版本，以減少 OCR 雜訊，提升其適用於量化文字分析。此外，保留文章的重複版本，以利分析報紙間語言和架構的編輯差異。每篇文章都標記電訊服務，便於比較各家機構的編輯模式。此資源為計算社會科學、數位人文和歷史語言學的研究開啟了新的途徑，提供一個詳細的觀點，探討南方報紙在美國歷史的轉型時期如何傳遞國內和國際新聞。該資料集將在出版或研究目的請求後提供。", "author": "Michael McRae et.al.", "authors": "Michael McRae", "id": "2502.11866v1", "paper_url": "http://arxiv.org/abs/2502.11866v1", "repo": "null"}}