{"2409.02313": {"publish_time": "2024-09-03", "title": "On the Benefits of Memory for Modeling Time-Dependent PDEs", "paper_summary": "Data-driven techniques have emerged as a promising alternative to traditional\nnumerical methods for solving partial differential equations (PDEs). These\ntechniques frequently offer a better trade-off between computational cost and\naccuracy for many PDE families of interest. For time-dependent PDEs, existing\nmethodologies typically treat PDEs as Markovian systems, i.e., the evolution of\nthe system only depends on the ``current state'', and not the past states.\nHowever, distortion of the input signals -- e.g., due to discretization or\nlow-pass filtering -- can render the evolution of the distorted signals\nnon-Markovian. In this work, motivated by the Mori-Zwanzig theory of model\nreduction, we investigate the impact of architectures with memory for modeling\nPDEs: that is, when past states are explicitly used to predict the future. We\nintroduce Memory Neural Operator (MemNO), a network based on the recent SSM\narchitectures and Fourier Neural Operator (FNO). We empirically demonstrate on\na variety of PDE families of interest that when the input is given on a\nlow-resolution grid, MemNO significantly outperforms the baselines without\nmemory, achieving more than 6 times less error on unseen PDEs. Via a\ncombination of theory and experiments, we show that the effect of memory is\nparticularly significant when the solution of the PDE has high frequency\nFourier components (e.g., low-viscosity fluid dynamics), and it also increases\nrobustness to observation noise.", "paper_summary_zh": "<paragraph>資料驅動技術已成為解決偏微分方程式 (PDE) 的傳統數值方法的替代方案，且前景看好。對於許多 PDE 族，這些技術通常在運算成本和準確性之間提供更好的折衷方案。對於時間依賴的 PDE，現有的方法通常將 PDE 視為馬可夫系統，即系統的演化僅取決於「當前狀態」，而非過去的狀態。然而，輸入訊號的失真（例如，由於離散化或低通濾波）會導致失真訊號的演化成為非馬可夫。在這項工作中，受到 Mori-Zwanzig 模型簡化的理論啟發，我們探討了具有記憶的架構對 PDE 建模的影響：也就是說，當過去的狀態被明確用於預測未來時。我們引入了記憶神經算子 (MemNO)，一個基於近期 SSM 架構和傅立葉神經算子 (FNO) 的網路。我們在各種 PDE 族上實證展示，當輸入給定在低解析度網格上時，MemNO 明顯優於沒有記憶的基準，在未見的 PDE 上達到了 6 倍以上的誤差降低。透過理論和實驗的結合，我們表明了當 PDE 的解具有高頻率傅立葉分量（例如，低黏度流體力學）時，記憶的效應特別顯著，並且它也增加了對觀測雜訊的魯棒性。</paragraph>", "author": "Ricardo Buitrago Ruiz et.al.", "authors": "Ricardo Buitrago Ruiz, Tanya Marwah, Albert Gu, Andrej Risteski", "id": "2409.02313v1", "paper_url": "http://arxiv.org/abs/2409.02313v1", "repo": "null"}}