{"2410.23956": {"publish_time": "2024-10-31", "title": "Multilingual Pretraining Using a Large Corpus Machine-Translated from a Single Source Language", "paper_summary": "English, as a very high-resource language, enables the pretraining of\nhigh-quality large language models (LLMs). The same cannot be said for most\nother languages, as leading LLMs still underperform for non-English languages,\nlikely due to a gap in the quality and diversity of the available multilingual\npretraining corpora. In this work, we find that machine-translated text from a\nsingle high-quality source language can contribute significantly to the\npretraining of multilingual LLMs. We translate FineWeb-Edu, a high-quality\nEnglish web dataset, into French, German, and Spanish, resulting in a final\n300B-token dataset, which we call TransWeb-Edu, and pretrain a 1.3B-parameter\nmodel, CuatroLLM, from scratch on this dataset. Across five non-English\nreasoning tasks, we show that CuatroLLM matches or outperforms state-of-the-art\nmultilingual models trained using closed data, such as Llama3.2 and Gemma2,\ndespite using an order of magnitude less data, such as about 6% of the tokens\nused for Llama3.2's training. We further demonstrate that with additional\ndomain-specific pretraining, amounting to less than 1% of TransWeb-Edu,\nCuatroLLM surpasses the state of the art in multilingual reasoning. To promote\nreproducibility, we release our corpus, models, and training pipeline under\nopen licenses at hf.co/britllm/CuatroLLM.", "paper_summary_zh": "<paragraph>英語作為一種資源非常豐富的語言，能夠預訓練出高品質的大型語言模型 (LLM)。對於大多數其他語言而言，情況並非如此，因為領先的 LLM 對於非英語語言的表現仍然不佳，這可能是由於可用多語言預訓練語料庫的品質和多樣性存在差距。在這項工作中，我們發現來自單一高品質原始語言的機器翻譯文本，可以為多語言 LLM 的預訓練做出重大貢獻。我們將高品質英語網路資料集 FineWeb-Edu 翻譯成法語、德語和西班牙語，最終產生一個 300B-token 的資料集，我們稱之為 TransWeb-Edu，並從頭開始在這個資料集上預訓練一個 1.3B-參數模型 CuatroLLM。在五項非英語推理任務中，我們展示了 CuatroLLM 即使使用比 Llama3.2 少一個數量級的資料（例如 Llama3.2 訓練中使用的 token 數量的約 6%），也能與使用封閉資料訓練的最新多語言模型（例如 Llama3.2 和 Gemma2）相匹配或表現得更好。我們進一步證明，透過額外的特定領域預訓練（少於 TransWeb-Edu 的 1%），CuatroLLM 超越了多語言推理的最新技術。為了促進可複製性，我們在 hf.co/britllm/CuatroLLM 下開放授權釋出我們的語料庫、模型和訓練管道。</paragraph>", "author": "Jiayi Wang et.al.", "authors": "Jiayi Wang, Yao Lu, Maurice Weber, Max Ryabinin, Yihong Chen, Raphael Tang, Pontus Stenetorp", "id": "2410.23956v1", "paper_url": "http://arxiv.org/abs/2410.23956v1", "repo": "null"}}