{"2408.11448": {"publish_time": "2024-08-21", "title": "Lookism: The overlooked bias in computer vision", "paper_summary": "In recent years, there have been significant advancements in computer vision\nwhich have led to the widespread deployment of image recognition and generation\nsystems in socially relevant applications, from hiring to security screening.\nHowever, the prevalence of biases within these systems has raised significant\nethical and social concerns. The most extensively studied biases in this\ncontext are related to gender, race and age. Yet, other biases are equally\npervasive and harmful, such as lookism, i.e., the preferential treatment of\nindividuals based on their physical appearance. Lookism remains under-explored\nin computer vision but can have profound implications not only by perpetuating\nharmful societal stereotypes but also by undermining the fairness and\ninclusivity of AI technologies. Thus, this paper advocates for the systematic\nstudy of lookism as a critical bias in computer vision models. Through a\ncomprehensive review of existing literature, we identify three areas of\nintersection between lookism and computer vision. We illustrate them by means\nof examples and a user study. We call for an interdisciplinary approach to\naddress lookism, urging researchers, developers, and policymakers to prioritize\nthe development of equitable computer vision systems that respect and reflect\nthe diversity of human appearances.", "paper_summary_zh": "近年来，计算机视觉领域取得了重大进展，这导致了图像识别和生成系统在社会相关应用中的广泛部署，从招聘到安全筛查。然而，这些系统中存在的偏见盛行引发了重大的伦理和社会问题。在此背景下研究最广泛的偏见与性别、种族和年龄有关。然而，其他偏见同样普遍且有害，例如外貌主义，即根据个人的外貌给予优待。外貌主义在计算机视觉领域仍未得到充分探索，但不仅会通过延续有害的社会刻板印象，还会破坏人工智能技术的公平性和包容性，从而产生深远的影响。因此，本文主张系统地研究外貌主义作为计算机视觉模型中的关键偏见。通过对现有文献进行全面审查，我们确定了外貌主义与计算机视觉之间的三个交叉领域。我们通过示例和用户研究对它们进行了说明。我们呼吁采用跨学科方法来解决外貌主义问题，敦促研究人员、开发人员和政策制定者优先考虑开发公平的计算机视觉系统，尊重和反映人类外貌的多样性。", "author": "Aditya Gulati et.al.", "authors": "Aditya Gulati, Bruno Lepri, Nuria Oliver", "id": "2408.11448v1", "paper_url": "http://arxiv.org/abs/2408.11448v1", "repo": "null"}}