{"2405.17039": {"publish_time": "2024-05-27", "title": "BWArea Model: Learning World Model, Inverse Dynamics, and Policy for Controllable Language Generation", "paper_summary": "Large language models (LLMs) have catalyzed a paradigm shift in natural\nlanguage processing, yet their limited controllability poses a significant\nchallenge for downstream applications. We aim to address this by drawing\ninspiration from the neural mechanisms of the human brain, specifically Broca's\nand Wernicke's areas, which are crucial for language generation and\ncomprehension, respectively. In particular, Broca's area receives cognitive\ndecision signals from Wernicke's area, treating the language generation as an\nintricate decision-making process, which differs from the fully auto-regressive\nlanguage generation of existing LLMs. In a similar vein, our proposed system,\nthe BWArea model, conceptualizes language generation as a decision-making task.\nThis model has three components: a language world model, an inverse dynamics\nmodel, and a cognitive policy. Like Wernicke's area, the inverse dynamics model\nis designed to deduce the underlying cognitive intentions, or latent actions,\nbehind each token. The BWArea model is amenable to both pre-training and\nfine-tuning like existing LLMs. With 30B clean pre-training tokens, we have\ntrained a BWArea model, which achieves competitive performance with LLMs of\nequal size (1B parameters). Unlike fully auto-regressive LLMs, its pre-training\nperformance does not degenerate if dirty data unintentionally appears. This\nshows the advantage of a decomposed structure of BWArea model in reducing\nefforts in laborious data selection and labeling. Finally, we reveal that the\nBWArea model offers enhanced controllability via fine-tuning the cognitive\npolicy with downstream reward metrics, thereby facilitating alignment with\ngreater simplicity. On 9 out of 10 tasks from two suites, TextWorld and\nBigBench Hard, our method shows superior performance to auto-regressive LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 已催化自然語言處理的典範轉移，但其有限的可控性對下游應用程式構成重大挑戰。我們旨在透過汲取人類大腦的神經機制，特別是布洛卡區和韋尼克區的靈感來解決此問題，這些區域分別對語言生成和理解至關重要。特別是，布洛卡區從韋尼克區接收認知決策訊號，將語言生成視為一個複雜的決策制定過程，這不同於現有 LLM 的完全自迴歸語言生成。同樣地，我們提出的系統，即 BWArea 模型，將語言生成概念化為一個決策制定任務。此模型有三個組成部分：語言世界模型、逆動力模型和認知策略。與韋尼克區一樣，逆動力模型被設計為推論每個標記背後的潛在認知意圖或潛在動作。BWArea 模型適用於預訓練和微調，就像現有的 LLM 一樣。使用 30B 個乾淨的預訓練代幣，我們訓練了一個 BWArea 模型，其與大小相等 (1B 個參數) 的 LLM 達到了競爭性的效能。與完全自迴歸的 LLM 不同，如果意外出現髒數據，其預訓練效能不會退化。這顯示了 BWArea 模型分解結構在減少繁瑣數據選擇和標記工作方面的優勢。最後，我們揭示了 BWArea 模型透過使用下游獎勵指標微調認知策略來提供增強的可控性，從而促進與更大簡潔性的對齊。在兩個套件（TextWorld 和 BigBench Hard）的 10 個任務中有 9 個，我們的模型顯示出優於自迴歸 LLM 的效能。", "author": "Chengxing Jia et.al.", "authors": "Chengxing Jia, Pengyuan Wang, Ziniu Li, Yi-Chen Li, Zhilong Zhang, Nan Tang, Yang Yu", "id": "2405.17039v1", "paper_url": "http://arxiv.org/abs/2405.17039v1", "repo": "null"}}