{"2411.03519": {"publish_time": "2024-11-05", "title": "AI Metropolis: Scaling Large Language Model-based Multi-Agent Simulation with Out-of-order Execution", "paper_summary": "With more advanced natural language understanding and reasoning capabilities,\nlarge language model (LLM)-powered agents are increasingly developed in\nsimulated environments to perform complex tasks, interact with other agents,\nand exhibit emergent behaviors relevant to social science and gaming. However,\ncurrent multi-agent simulations frequently suffer from inefficiencies due to\nthe limited parallelism caused by false dependencies, resulting in performance\nbottlenecks. In this paper, we introduce AI Metropolis, a simulation engine\nthat improves the efficiency of LLM agent simulations by incorporating\nout-of-order execution scheduling. By dynamically tracking real dependencies\nbetween agents, AI Metropolis minimizes false dependencies, enhancing\nparallelism and enabling efficient hardware utilization. Our evaluations\ndemonstrate that AI Metropolis achieves speedups from 1.3x to 4.15x over\nstandard parallel simulation with global synchronization, approaching optimal\nperformance as the number of agents increases.", "paper_summary_zh": "隨著更進階的自然語言理解和推理能力，大型語言模型 (LLM) 驅動的代理人越來越常在模擬環境中開發，以執行複雜任務、與其他代理人互動，並表現出與社會科學和遊戲相關的新興行為。然而，目前的許多代理人模擬經常會因為虛假依賴關係造成的並行性受限而導致效率低下，進而產生效能瓶頸。在本文中，我們將介紹 AI Metropolis，這是一個模擬引擎，透過納入無序執行排程來提升 LLM 代理人模擬的效率。透過動態追蹤代理人之間的真實依賴關係，AI Metropolis 將虛假依賴關係降到最低，進而提升並行性並讓硬體得以有效利用。我們的評估結果顯示，AI Metropolis 在全球同步的標準平行模擬中，可達到 1.3 倍到 4.15 倍的加速，並隨著代理人數量增加而接近最佳效能。", "author": "Zhiqiang Xie et.al.", "authors": "Zhiqiang Xie, Hao Kang, Ying Sheng, Tushar Krishna, Kayvon Fatahalian, Christos Kozyrakis", "id": "2411.03519v1", "paper_url": "http://arxiv.org/abs/2411.03519v1", "repo": "null"}}