{"2412.06198": {"publish_time": "2024-12-09", "title": "SparseAccelerate: Efficient Long-Context Inference for Mid-Range GPUs", "paper_summary": "As Large Language Models (LLMs) scale to longer context windows, the\ncomputational cost of attention mechanisms, which traditionally grows\nquadratically with input length, presents a critical challenge for real-time\nand memory-constrained deployments. Existing sparse attention techniques have\nsought to reduce this complexity, but they often incur significant overhead or\ncompromise accuracy, making them less practical for large contexts on mid-range\nhardware. In this paper, we introduce SparseAccelerate, a dynamic sparse\nattention method that adapts its sparsity patterns based on input\ncharacteristics, effectively flattening the attention complexity curve. Our\napproach is effective for input lengths starting at 16K tokens and scales\nefficiently up to 128K tokens on dual NVIDIA A5000 GPUs (24GB each).\nExperimental results show that SparseAccelerate achieves up to a 1.04x\nreduction in Time-To-First-Token (TTFT) latency at 32K tokens, while also\nproviding substantial memory savings. These improvements yield practical gains\nfor memory-intensive applications and long-context tasks that were previously\ninfeasible with standard attention. Beyond latency reductions, SparseAccelerate\nfundamentally shifts the scaling trend, demonstrating the smallest TTFT growth\ngradient relative to context length among competing methods. Ongoing\nevaluations on diverse benchmarks confirm its scalability, positioning\nSparseAccelerate as a critical advancement toward efficient, real-time, and\nlarge-context LLM inference on accessible hardware.", "paper_summary_zh": "隨著大型語言模型 (LLM) 擴展到更長的內容視窗，傳統上隨著輸入長度呈二次方增長的注意力機制計算成本，對即時和記憶體受限的部署構成了一項重大挑戰。現有的稀疏注意力技術已尋求降低此複雜性，但它們通常會產生顯著的開銷或損害準確性，這使得它們對於中階硬體上的大型內容不太實用。在本文中，我們介紹了 SparseAccelerate，這是一種動態稀疏注意力方法，它根據輸入特徵調整其稀疏模式，有效地展平了注意力複雜性曲線。我們的做法對於從 16K 個代幣開始的輸入長度有效，並且可以在兩個 NVIDIA A5000 GPU（每個 24GB）上有效地擴展到 128K 個代幣。實驗結果表明，SparseAccelerate 在 32K 個代幣時將首次代幣時間 (TTFT) 延遲減少了 1.04 倍，同時也提供了大量的記憶體節省。這些改進為記憶體密集型應用程式和長內容任務帶來了實際收益，而這些任務以前使用標準注意力是不可行的。除了減少延遲之外，SparseAccelerate 從根本上改變了擴展趨勢，展示了相對於內容長度而言，在競爭方法中 TTFT 增長梯度最小。對各種基準的持續評估確認了其可擴展性，將 SparseAccelerate 定位為朝著在可存取硬體上進行高效、即時且大內容 LLM 推論的關鍵進展。", "author": "James Vo et.al.", "authors": "James Vo", "id": "2412.06198v1", "paper_url": "http://arxiv.org/abs/2412.06198v1", "repo": "null"}}