{"2502.15543": {"publish_time": "2025-02-21", "title": "PIP-KAG: Mitigating Knowledge Conflicts in Knowledge-Augmented Generation via Parametric Pruning", "paper_summary": "Knowledge-Augmented Generation (KAG) has shown great promise in updating the\ninternal memory of Large Language Models (LLMs) by integrating external\nknowledge. However, KAG inevitably faces knowledge conflicts when the internal\nmemory contradicts external information. Current approaches to mitigating these\nconflicts mainly focus on improving external knowledge utilization. However,\nthese methods have shown only limited effectiveness in mitigating the knowledge\nconflict problem, as internal knowledge continues to influence the generation\nprocess of LLMs. In this paper, we propose a ParametrIc Pruning-based\nKnowledge-Augmented Generation (PIP-KAG) approach, which prunes internal\nknowledge of LLMs and incorporates a plug-and-play adaptation module to help\nLLMs better leverage external sources. Additionally, we construct the\nCoConflictQA benchmark based on the hallucination of LLMs to better evaluate\ncontextual faithfulness during answering questions. Experimental results on\nCoConflictQA demonstrate that PIP-KAG significantly reduces knowledge conflicts\nand improves context fidelity. Notably, PIP-KAG reduces LLM's parameters by\n13%, enhancing parameter efficiency in LLMs within the KAG framework. All codes\nare available at https://github.com/OpenBMB/PIP-KAG.", "paper_summary_zh": "知識增強生成（KAG）已顯示出透過整合外部知識來更新大型語言模型（LLM）內部記憶體的巨大前景。然而，當內部記憶體與外部資訊產生矛盾時，KAG 必然會面臨知識衝突。目前減輕這些衝突的方法主要集中於改善外部知識利用率。然而，由於內部知識持續影響 LLM 的生成過程，這些方法在減輕知識衝突問題上僅展現出有限的效能。在本文中，我們提出一個基於參數化剪枝的知識增強生成（PIP-KAG）方法，它會剪枝 LLM 的內部知識，並整合一個即插即用的適應模組，以協助 LLM 更有效地利用外部來源。此外，我們根據 LLM 的幻覺建構 CoConflictQA 基準，以在回答問題時更好地評估脈絡忠實度。在 CoConflictQA 上的實驗結果證明，PIP-KAG 大幅減少了知識衝突，並提高了脈絡保真度。值得注意的是，PIP-KAG 將 LLM 的參數減少了 13%，提高了 KAG 框架內 LLM 的參數效率。所有程式碼都可以在 https://github.com/OpenBMB/PIP-KAG 獲得。", "author": "Pengcheng Huang et.al.", "authors": "Pengcheng Huang, Zhenghao Liu, Yukun Yan, Xiaoyuan Yi, Hao Chen, Zhiyuan Liu, Maosong Sun, Tong Xiao, Ge Yu, Chenyan Xiong", "id": "2502.15543v1", "paper_url": "http://arxiv.org/abs/2502.15543v1", "repo": "null"}}