{"2501.14308": {"publish_time": "2025-01-24", "title": "Learning Primitive Relations for Compositional Zero-Shot Learning", "paper_summary": "Compositional Zero-Shot Learning (CZSL) aims to identify unseen state-object\ncompositions by leveraging knowledge learned from seen compositions. Existing\napproaches often independently predict states and objects, overlooking their\nrelationships. In this paper, we propose a novel framework, learning primitive\nrelations (LPR), designed to probabilistically capture the relationships\nbetween states and objects. By employing the cross-attention mechanism, LPR\nconsiders the dependencies between states and objects, enabling the model to\ninfer the likelihood of unseen compositions. Experimental results demonstrate\nthat LPR outperforms state-of-the-art methods on all three CZSL benchmark\ndatasets in both closed-world and open-world settings. Through qualitative\nanalysis, we show that LPR leverages state-object relationships for unseen\ncomposition prediction.", "paper_summary_zh": "組合零樣本學習 (CZSL) 旨在透過運用從已見組合中學習到的知識來識別未見的狀態-物件組合。現有方法通常獨立預測狀態和物件，忽略它們之間的關係。在本文中，我們提出一個新穎的架構，學習原始關係 (LPR)，旨在以機率方式捕捉狀態和物件之間的關係。透過採用交叉注意力機制，LPR 考慮狀態和物件之間的依賴關係，使模型能夠推論未見組合的可能性。實驗結果證明，在封閉世界和開放世界設定中，LPR 在所有三個 CZSL 基準資料集上都優於最先進的方法。透過定性分析，我們展示 LPR 利用狀態-物件關係進行未見組合預測。", "author": "Insu Lee et.al.", "authors": "Insu Lee, Jiseob Kim, Kyuhong Shim, Byonghyo Shim", "id": "2501.14308v1", "paper_url": "http://arxiv.org/abs/2501.14308v1", "repo": "null"}}