{"2503.02878": {"publish_time": "2025-03-04", "title": "Language Models can Self-Improve at State-Value Estimation for Better Search", "paper_summary": "Collecting ground truth task completion rewards or human demonstrations for\nmulti-step reasoning tasks is often cost-prohibitive and time-consuming,\nespecially in interactive domains like web tasks. To address this bottleneck,\nwe present self-taught lookahead, a self-supervised method that leverages\nstate-transition dynamics to train a value model capable of effectively guiding\nlanguage model-controlled search. We find that moderately sized (8 billion\nparameters) open-weight value models improved with self-taught lookahead can\nmatch the performance of using a frontier LLM such as gpt-4o as the value\nmodel. Furthermore, we find that self-taught lookahead improves performance by\n20% while reducing costs 37x compared to previous LLM-based tree search,\nwithout relying on ground truth rewards.", "paper_summary_zh": "<paragraph>收集多步驟推理任務的真實任務完成獎勵或人類演示通常成本高昂且耗時，尤其是在網頁任務等互動領域。為了克服這個瓶頸，我們提出了自學式前瞻（self-taught lookahead），這是一種自我監督方法，它利用狀態轉移動態來訓練一個能夠有效引導語言模型控制搜索的價值模型。我們發現，經過自學式前瞻改進的中等規模（80 億參數）開放權重價值模型可以達到使用前沿大型語言模型（例如 gpt-4o）作為價值模型的性能。此外，我們發現，與先前基於大型語言模型的樹狀搜尋相比，自學式前瞻在將成本降低 37 倍的同時，還將性能提高了 20%，而且無需依賴真實獎勵。</paragraph>\n", "author": "Ethan Mendes et.al.", "authors": "Ethan Mendes, Alan Ritter", "id": "2503.02878v1", "paper_url": "http://arxiv.org/abs/2503.02878v1", "repo": "null"}}