{"2410.02644": {"publish_time": "2024-10-03", "title": "Agent Security Bench (ASB): Formalizing and Benchmarking Attacks and Defenses in LLM-based Agents", "paper_summary": "Although LLM-based agents, powered by Large Language Models (LLMs), can use\nexternal tools and memory mechanisms to solve complex real-world tasks, they\nmay also introduce critical security vulnerabilities. However, the existing\nliterature does not comprehensively evaluate attacks and defenses against\nLLM-based agents. To address this, we introduce Agent Security Bench (ASB), a\ncomprehensive framework designed to formalize, benchmark, and evaluate the\nattacks and defenses of LLM-based agents, including 10 scenarios (e.g.,\ne-commerce, autonomous driving, finance), 10 agents targeting the scenarios,\nover 400 tools, 23 different types of attack/defense methods, and 8 evaluation\nmetrics. Based on ASB, we benchmark 10 prompt injection attacks, a memory\npoisoning attack, a novel Plan-of-Thought backdoor attack, a mixed attack, and\n10 corresponding defenses across 13 LLM backbones with nearly 90,000 testing\ncases in total. Our benchmark results reveal critical vulnerabilities in\ndifferent stages of agent operation, including system prompt, user prompt\nhandling, tool usage, and memory retrieval, with the highest average attack\nsuccess rate of 84.30\\%, but limited effectiveness shown in current defenses,\nunveiling important works to be done in terms of agent security for the\ncommunity. Our code can be found at https://github.com/agiresearch/ASB.", "paper_summary_zh": "儘管由大型語言模型（LLM）驅動的 LLM 型代理可以使用外部工具和記憶體機制來解決複雜的真實世界任務，但它們也可能引入嚴重的安全性漏洞。然而，現有的文獻並未全面評估針對 LLM 型代理的攻擊和防禦。為了解決這個問題，我們引入了代理安全基準（ASB），這是一個全面的框架，旨在形式化、評比和評估 LLM 型代理的攻擊和防禦，包括 10 個場景（例如電子商務、自動駕駛、金融）、10 個針對這些場景的代理、超過 400 個工具、23 種不同類型的攻擊/防禦方法和 8 個評估指標。根據 ASB，我們評比了 10 個提示注入攻擊、一個記憶體中毒攻擊、一個新穎的思考計劃後門攻擊、一個混合攻擊和 10 個相應的防禦措施，涵蓋 13 個 LLM 主幹，總共將近 90,000 個測試案例。我們的基準結果揭露了代理操作的不同階段中的嚴重漏洞，包括系統提示、使用者提示處理、工具使用和記憶體擷取，其中最高平均攻擊成功率為 84.30%，但目前的防禦措施顯示效果有限，揭示了社區在代理安全方面有重要的工作要做。我們的程式碼可以在 https://github.com/agiresearch/ASB 找到。", "author": "Hanrong Zhang et.al.", "authors": "Hanrong Zhang, Jingyuan Huang, Kai Mei, Yifei Yao, Zhenting Wang, Chenlu Zhan, Hongwei Wang, Yongfeng Zhang", "id": "2410.02644v1", "paper_url": "http://arxiv.org/abs/2410.02644v1", "repo": "https://github.com/agiresearch/asb"}}