{"2405.04941": {"publish_time": "2024-05-08", "title": "Imprecise Probabilities Meet Partial Observability: Game Semantics for Robust POMDPs", "paper_summary": "Partially observable Markov decision processes (POMDPs) rely on the key\nassumption that probability distributions are precisely known. Robust POMDPs\n(RPOMDPs) alleviate this concern by defining imprecise probabilities, referred\nto as uncertainty sets. While robust MDPs have been studied extensively, work\non RPOMDPs is limited and primarily focuses on algorithmic solution methods. We\nexpand the theoretical understanding of RPOMDPs by showing that 1) different\nassumptions on the uncertainty sets affect optimal policies and values; 2)\nRPOMDPs have a partially observable stochastic game (POSG) semantic; and 3) the\nsame RPOMDP with different assumptions leads to semantically different POSGs\nand, thus, different policies and values. These novel semantics for RPOMDPS\ngive access to results for the widely studied POSG model; concretely, we show\nthe existence of a Nash equilibrium. Finally, we classify the existing RPOMDP\nliterature using our semantics, clarifying under which uncertainty assumptions\nthese existing works operate.", "paper_summary_zh": "部分可觀測馬可夫決策過程 (POMDP) 依賴於一個關鍵假設，即機率分佈是精確已知的。強健 POMDP (RPOMDP) 透過定義不精確的機率（稱為不確定性集合）來減輕這個問題。儘管強健 MDP 已被廣泛研究，但對 RPOMDP 的研究卻很有限，且主要集中於演算法解決方法。我們透過顯示以下內容來擴展對 RPOMDP 的理論理解：1) 不確定性集合的不同假設會影響最佳策略和價值；2) RPOMDP 具有部分可觀測隨機遊戲 (POSG) 語義；以及 3) 具有不同假設的相同 RPOMDP 會導致語義上不同的 POSG，因此會產生不同的策略和價值。這些 RPOMDP 的新語義可以取得廣泛研究的 POSG 模型的結果；具體來說，我們證明了納許均衡的存在性。最後，我們使用我們的語義對現有的 RPOMDP 文獻進行分類，釐清這些現有著作是在哪些不確定性假設下運作的。", "author": "Eline M. Bovy et.al.", "authors": "Eline M. Bovy, Marnix Suilen, Sebastian Junges, Nils Jansen", "id": "2405.04941v1", "paper_url": "http://arxiv.org/abs/2405.04941v1", "repo": "null"}}