{"2406.18895": {"publish_time": "2024-06-27", "title": "Can we teach language models to gloss endangered languages?", "paper_summary": "Interlinear glossed text (IGT) is a popular format in language documentation\nprojects, where each morpheme is labeled with a descriptive annotation.\nAutomating the creation of interlinear glossed text can be desirable to reduce\nannotator effort and maintain consistency across annotated corpora. Prior\nresearch has explored a number of statistical and neural methods for\nautomatically producing IGT.\n  As large language models (LLMs) have showed promising results across\nmultilingual tasks, even for rare, endangered languages, it is natural to\nwonder whether they can be utilized for the task of generating IGT. We explore\nwhether LLMs can be effective at the task of interlinear glossing with\nin-context learning, without any traditional training. We propose new\napproaches for selecting examples to provide in-context, observing that\ntargeted selection can significantly improve performance. We find that\nLLM-based methods beat standard transformer baselines, despite requiring no\ntraining at all. These approaches still underperform state-of-the-art\nsupervised systems for the task, but are highly practical for researchers\noutside of the NLP community, requiring minimal effort to use.", "paper_summary_zh": "跨語言任務中，大型語言模型 (LLM) 已展現出令人滿意的成果，即使是對於罕見或瀕危語言，因此自然會好奇它們是否能用於產生 IGT 的任務。我們探討 LLM 是否能有效執行跨行註釋任務，透過情境學習，而無需任何傳統訓練。我們提出新的方法，用於選擇範例以提供情境，並觀察到目標選擇能顯著提升效能。我們發現，儘管 LLM-based 方法不需要任何訓練，但仍勝過標準的 transformer 基準。這些方法在任務上的表現仍不如最先進的監督式系統，但對於 NLP 社群以外的研究人員來說非常實用，使用時所需的努力極少。", "author": "Michael Ginn et.al.", "authors": "Michael Ginn, Mans Hulden, Alexis Palmer", "id": "2406.18895v1", "paper_url": "http://arxiv.org/abs/2406.18895v1", "repo": "null"}}