{"2503.18968": {"publish_time": "2025-03-21", "title": "MedAgent-Pro: Towards Multi-modal Evidence-based Medical Diagnosis via Reasoning Agentic Workflow", "paper_summary": "Developing reliable AI systems to assist human clinicians in multi-modal\nmedical diagnosis has long been a key objective for researchers. Recently,\nMulti-modal Large Language Models (MLLMs) have gained significant attention and\nachieved success across various domains. With strong reasoning capabilities and\nthe ability to perform diverse tasks based on user instructions, they hold\ngreat potential for enhancing medical diagnosis. However, directly applying\nMLLMs to the medical domain still presents challenges. They lack detailed\nperception of visual inputs, limiting their ability to perform quantitative\nimage analysis, which is crucial for medical diagnostics. Additionally, MLLMs\noften exhibit hallucinations and inconsistencies in reasoning, whereas clinical\ndiagnoses must adhere strictly to established criteria. To address these\nchallenges, we propose MedAgent-Pro, an evidence-based reasoning agentic system\ndesigned to achieve reliable, explainable, and precise medical diagnoses. This\nis accomplished through a hierarchical workflow: at the task level,\nknowledge-based reasoning generate reliable diagnostic plans for specific\ndiseases following retrieved clinical criteria. While at the case level,\nmultiple tool agents process multi-modal inputs, analyze different indicators\naccording to the plan, and provide a final diagnosis based on both quantitative\nand qualitative evidence. Comprehensive experiments on both 2D and 3D medical\ndiagnosis tasks demonstrate the superiority and effectiveness of MedAgent-Pro,\nwhile case studies further highlight its reliability and interpretability. The\ncode is available at https://github.com/jinlab-imvr/MedAgent-Pro.", "paper_summary_zh": "開發可靠的AI系統來協助人類臨床醫生進行多模態醫學診斷，一直是研究人員的主要目標。近年來，多模態大型語言模型（MLLM）受到了廣泛關注，並在各個領域取得了成功。憑藉強大的推理能力和根據用戶指令執行各種任務的能力，它們在增強醫學診斷方面具有巨大潛力。然而，直接將MLLM應用於醫療領域仍然存在挑戰。它們缺乏對視覺輸入的詳細感知，限制了它們執行定量圖像分析的能力，而這對於醫療診斷至關重要。此外，MLLM經常表現出幻覺和推理不一致，而臨床診斷必須嚴格遵守既定標準。為了應對這些挑戰，我們提出了MedAgent-Pro，這是一個基於證據的推理代理系統，旨在實現可靠、可解釋和精確的醫學診斷。這是通過分層工作流程來實現的：在任務層面，基於知識的推理會根據檢索到的臨床標準，為特定疾病生成可靠的診斷計劃。而在案例層面，多個工具代理會處理多模態輸入，根據計劃分析不同的指標，並根據定量和定性證據提供最終診斷。在2D和3D醫學診斷任務上的綜合實驗證明了MedAgent-Pro的優越性和有效性，而案例研究進一步突出了其可靠性和可解釋性。程式碼可在 https://github.com/jinlab-imvr/MedAgent-Pro 獲得。\n", "author": "Ziyue Wang et.al.", "authors": "Ziyue Wang, Junde Wu, Chang Han Low, Yueming Jin", "id": "2503.18968v1", "paper_url": "http://arxiv.org/abs/2503.18968v1", "repo": "null"}}