{"2410.14375": {"publish_time": "2024-10-18", "title": "Fine-Tuning Pre-trained Language Models for Robust Causal Representation Learning", "paper_summary": "The fine-tuning of pre-trained language models (PLMs) has been shown to be\neffective across various domains. By using domain-specific supervised data, the\ngeneral-purpose representation derived from PLMs can be transformed into a\ndomain-specific representation. However, these methods often fail to generalize\nto out-of-domain (OOD) data due to their reliance on non-causal\nrepresentations, often described as spurious features. Existing methods either\nmake use of adjustments with strong assumptions about lack of hidden common\ncauses, or mitigate the effect of spurious features using multi-domain data. In\nthis work, we investigate how fine-tuned pre-trained language models aid\ngeneralizability from single-domain scenarios under mild assumptions, targeting\nmore general and practical real-world scenarios. We show that a robust\nrepresentation can be derived through a so-called causal front-door adjustment,\nbased on a decomposition assumption, using fine-tuned representations as a\nsource of data augmentation. Comprehensive experiments in both synthetic and\nreal-world settings demonstrate the superior generalizability of the proposed\nmethod compared to existing approaches. Our work thus sheds light on the domain\ngeneralization problem by introducing links between fine-tuning and causal\nmechanisms into representation learning.", "paper_summary_zh": "預訓練語言模型 (PLM) 的微調已被證明在各種領域中有效。透過使用特定於領域的監督資料，從 PLM 衍生的通用表示可以轉換為特定於領域的表示。然而，這些方法通常無法概括為非領域 (OOD) 資料，因為它們依賴於非因果表示，通常被描述為虛假特徵。現有方法會利用對隱藏共同原因缺乏的強假設進行調整，或使用多領域資料來減輕虛假特徵的影響。在這項工作中，我們探討微調預訓練語言模型如何幫助在溫和假設下從單一領域場景進行概括，針對更一般且實用的真實世界場景。我們展示了可以透過所謂的因果前門調整來衍生穩健的表示，這基於分解假設，使用微調表示作為資料擴充的來源。在合成和真實世界設定中的全面實驗證明了所提出的方法與現有方法相比具有優越的概括能力。因此，我們的研究透過在表示學習中引入微調和因果機制之間的連結，來闡明領域概括問題。", "author": "Jialin Yu et.al.", "authors": "Jialin Yu, Yuxiang Zhou, Yulan He, Nevin L. Zhang, Ricardo Silva", "id": "2410.14375v1", "paper_url": "http://arxiv.org/abs/2410.14375v1", "repo": "null"}}