{"2502.14494": {"publish_time": "2025-02-20", "title": "StructFlowBench: A Structured Flow Benchmark for Multi-turn Instruction Following", "paper_summary": "Multi-turn instruction following capability constitutes a core competency of\nlarge language models (LLMs) in real-world applications. Existing evaluation\nbenchmarks predominantly focus on fine-grained constraint satisfaction and\ndomain-specific capability assessment, yet overlook the crucial structural\ndependency between dialogue turns that distinguishes multi-turn from\nsingle-turn interactions. This structural dependency not only reflects user\nintent but also establishes a second dimension for instruction following\nevaluation beyond constraint satisfaction. To address this gap, we propose\nStructFlowBench, a multi-turn instruction following benchmark with structural\nflow modeling. The benchmark innovatively defines a structural flow framework\ncomprising six fundamental inter-turn relationships, which not only introduces\nnovel structural constraints for model evaluation but also serves as generation\nparameters for creating customized dialogue flows tailored to specific\nscenarios. Adopting established LLM-based automatic evaluation methodologies,\nwe conduct systematic evaluations of 13 leading open-source and closed-source\nLLMs. Experimental results reveal significant deficiencies in current models'\ncomprehension of multi-turn dialogue structures. The code is available at\n\\url{https://github.com/MLGroupJLU/StructFlowBench}.", "paper_summary_zh": "多輪指令遵循能力構成大型語言模型 (LLM) 在現實世界應用中的核心能力。現有的評估基準主要專注於細粒度的約束滿足和特定領域的能力評估，卻忽略了多輪與單輪互動之間區別的關鍵結構依賴性。這種結構依賴性不僅反映了使用者的意圖，也為指令遵循評估建立了超越約束滿足的第二個維度。為了解決這個差距，我們提出了 StructFlowBench，一個具有結構流建模的多輪指令遵循基準。該基準創新地定義了一個結構流框架，包含六個基本的回合間關係，這不僅引入了模型評估的新結構約束，還可用作生成參數，用於創建針對特定場景定制的對話流。採用已建立的基於 LLM 的自動評估方法，我們對 13 個領先的開源和閉源 LLM 進行了系統評估。實驗結果揭示了當前模型在理解多輪對話結構方面存在顯著缺陷。程式碼可在 \\url{https://github.com/MLGroupJLU/StructFlowBench} 取得。", "author": "Jinnan Li et.al.", "authors": "Jinnan Li, Jinzhe Li, Yue Wang, Yi Chang, Yuan Wu", "id": "2502.14494v1", "paper_url": "http://arxiv.org/abs/2502.14494v1", "repo": "null"}}