{"2407.20668": {"publish_time": "2024-07-30", "title": "Mimicking the Mavens: Agent-based Opinion Synthesis and Emotion Prediction for Social Media Influencers", "paper_summary": "Predicting influencers' views and public sentiment on social media is crucial\nfor anticipating societal trends and guiding strategic responses. This study\nintroduces a novel computational framework to predict opinion leaders'\nperspectives and the emotive reactions of the populace, addressing the inherent\nchallenges posed by the unstructured, context-sensitive, and heterogeneous\nnature of online communication. Our research introduces an innovative module\nthat starts with the automatic 5W1H (Where, Who, When, What, Why, and How)\nquestions formulation engine, tailored to emerging news stories and trending\ntopics. We then build a total of 60 anonymous opinion leader agents in six\ndomains and realize the views generation based on an enhanced large language\nmodel (LLM) coupled with retrieval-augmented generation (RAG). Subsequently, we\nsynthesize the potential views of opinion leaders and predicted the emotional\nresponses to different events. The efficacy of our automated 5W1H module is\ncorroborated by an average GPT-4 score of 8.83/10, indicative of high fidelity.\nThe influencer agents exhibit a consistent performance, achieving an average\nGPT-4 rating of 6.85/10 across evaluative metrics. Utilizing the\n'Russia-Ukraine War' as a case study, our methodology accurately foresees key\ninfluencers' perspectives and aligns emotional predictions with real-world\nsentiment trends in various domains.", "paper_summary_zh": "預測影響者觀點和社群媒體上的公眾情緒，對於預測社會趨勢和指導策略回應至關重要。本研究引入了創新的計算架構，用於預測意見領袖的觀點和民眾的情緒反應，並解決了線上溝通非結構化、與脈絡相關且異質的本質所帶來的固有挑戰。我們的研究引入了創新的模組，從自動化的 5W1H（何處、何人、何時、何事、為何和如何）問題表述引擎開始，針對新興新聞故事和熱門話題進行調整。然後，我們在六個領域建立了總共 60 個匿名意見領袖代理，並根據增強的大語言模型 (LLM) 加上檢索增強生成 (RAG) 來實現觀點生成。隨後，我們綜合了意見領袖的潛在觀點，並預測了對不同事件的情緒反應。我們自動化的 5W1H 模組的效能通過 GPT-4 的平均分數 8.83/10 得到證實，這表示高度保真。影響者代理表現一致，在評估指標中獲得 GPT-4 平均評分 6.85/10。以「俄烏戰爭」為案例研究，我們的研究方法準確預見了關鍵影響者的觀點，並將情緒預測與各個領域的真實世界情緒趨勢相結合。", "author": "Qinglan Wei et.al.", "authors": "Qinglan Wei, Ruiqi Xue, Yutian Wang, Hongjiang Xiao, Yuhao Wang, Xiaoyan Duan", "id": "2407.20668v1", "paper_url": "http://arxiv.org/abs/2407.20668v1", "repo": "null"}}