{"2412.08965": {"publish_time": "2024-12-12", "title": "AFFAKT: A Hierarchical Optimal Transport based Method for Affective Facial Knowledge Transfer in Video Deception Detection", "paper_summary": "The scarcity of high-quality large-scale labeled datasets poses a huge\nchallenge for employing deep learning models in video deception detection. To\naddress this issue, inspired by the psychological theory on the relation\nbetween deception and expressions, we propose a novel method called AFFAKT in\nthis paper, which enhances the classification performance by transferring\nuseful and correlated knowledge from a large facial expression dataset. Two key\nchallenges in knowledge transfer arise: 1) \\textit{how much} knowledge of\nfacial expression data should be transferred and 2) \\textit{how to} effectively\nleverage transferred knowledge for the deception classification model during\ninference. Specifically, the optimal relation mapping between facial expression\nclasses and deception samples is firstly quantified using proposed H-OTKT\nmodule and then transfers knowledge from the facial expression dataset to\ndeception samples. Moreover, a correlation prototype within another proposed\nmodule SRKB is well designed to retain the invariant correlations between\nfacial expression classes and deception classes through momentum updating.\nDuring inference, the transferred knowledge is fine-tuned with the correlation\nprototype using a sample-specific re-weighting strategy. Experimental results\non two deception detection datasets demonstrate the superior performance of our\nproposed method. The interpretability study reveals high associations between\ndeception and negative affections, which coincides with the theory in\npsychology.", "paper_summary_zh": "高品質大規模標籤資料集的稀少性對在影片欺騙偵測中採用深度學習模型構成了巨大的挑戰。為了解決這個問題，本文受到心理學理論中關於欺騙與表情之間關係的啟發，提出了一種名為 AFFAKT 的新方法，它透過從大型面部表情資料集中轉移有用且相關的知識來增強分類效能。知識轉移中有兩個關鍵的挑戰：1) 應轉移多少面部表情資料的知識，以及 2) 如何在推論期間有效地利用轉移的知識來進行欺騙分類模型。具體來說，首先使用所提出的 H-OTKT 模組量化面部表情類別與欺騙樣本之間的最佳關係對應，然後將知識從面部表情資料集轉移到欺騙樣本。此外，在另一個所提出的 SRKB 模組中，一個關聯原型經過精心設計，透過動量更新來保留面部表情類別與欺騙類別之間的恆定關聯。在推論期間，使用樣本特定的重新加權策略，針對關聯原型微調轉移的知識。在兩個欺騙偵測資料集上的實驗結果證明了我們所提出的方法具有優異的效能。可解釋性研究揭示了欺騙與負面情感之間的高度關聯，這與心理學理論相符。", "author": "Zihan Ji et.al.", "authors": "Zihan Ji, Xuetao Tian, Ye Liu", "id": "2412.08965v1", "paper_url": "http://arxiv.org/abs/2412.08965v1", "repo": "null"}}