{"2502.13834": {"publish_time": "2025-02-19", "title": "Proving Olympiad Inequalities by Synergizing LLMs and Symbolic Reasoning", "paper_summary": "Large language models (LLMs) can prove mathematical theorems formally by\ngenerating proof steps (\\textit{a.k.a.} tactics) within a proof system.\nHowever, the space of possible tactics is vast and complex, while the available\ntraining data for formal proofs is limited, posing a significant challenge to\nLLM-based tactic generation. To address this, we introduce a neuro-symbolic\ntactic generator that synergizes the mathematical intuition learned by LLMs\nwith domain-specific insights encoded by symbolic methods. The key aspect of\nthis integration is identifying which parts of mathematical reasoning are best\nsuited to LLMs and which to symbolic methods. While the high-level idea of\nneuro-symbolic integration is broadly applicable to various mathematical\nproblems, in this paper, we focus specifically on Olympiad inequalities\n(Figure~1). We analyze how humans solve these problems and distill the\ntechniques into two types of tactics: (1) scaling, handled by symbolic methods,\nand (2) rewriting, handled by LLMs. In addition, we combine symbolic tools with\nLLMs to prune and rank the proof goals for efficient proof search. We evaluate\nour framework on 161 challenging inequalities from multiple mathematics\ncompetitions, achieving state-of-the-art performance and significantly\noutperforming existing LLM and symbolic approaches without requiring additional\ntraining data.", "paper_summary_zh": "大型語言模型 (LLM) 能透過在證明系統中產生證明步驟（又稱策略）來正式證明數學定理。然而，可能的策略空間浩瀚且複雜，而形式化證明的可用訓練資料有限，對基於 LLM 的策略產生構成重大挑戰。為了解決這個問題，我們引入了神經符號策略產生器，它將 LLM 學到的數學直覺與符號方法編碼的特定領域見解結合起來。這種整合的關鍵面向在於找出數學推理的哪些部分最適合 LLM，哪些部分最適合符號方法。雖然神經符號整合的高階概念廣泛適用於各種數學問題，但在本文中，我們特別關注奧林匹亞不等式（圖 1）。我們分析人類如何解決這些問題，並將技術提煉成兩種策略類型：(1) 縮放，由符號方法處理，以及 (2) 重寫，由 LLM 處理。此外，我們將符號工具與 LLM 結合，以修剪和排列證明目標，以便有效進行證明搜尋。我們在多個數學競賽中針對 161 個具有挑戰性的不等式評估我們的架構，達到了最先進的效能，並且顯著優於現有的 LLM 和符號方法，而無需額外的訓練資料。", "author": "Zenan Li et.al.", "authors": "Zenan Li, Zhaoyu Li, Wen Tang, Xian Zhang, Yuan Yao, Xujie Si, Fan Yang, Kaiyu Yang, Xiaoxing Ma", "id": "2502.13834v1", "paper_url": "http://arxiv.org/abs/2502.13834v1", "repo": "null"}}