{"2502.09218": {"publish_time": "2025-02-13", "title": "Data2Concept2Text: An Explainable Multilingual Framework for Data Analysis Narration", "paper_summary": "This paper presents a complete explainable system that interprets a set of\ndata, abstracts the underlying features and describes them in a natural\nlanguage of choice. The system relies on two crucial stages: (i) identifying\nemerging properties from data and transforming them into abstract concepts, and\n(ii) converting these concepts into natural language. Despite the impressive\nnatural language generation capabilities demonstrated by Large Language Models,\ntheir statistical nature and the intricacy of their internal mechanism still\nforce us to employ these techniques as black boxes, forgoing trustworthiness.\nDeveloping an explainable pipeline for data interpretation would allow\nfacilitating its use in safety-critical environments like processing medical\ninformation and allowing non-experts and visually impaired people to access\nnarrated information. To this end, we believe that the fields of knowledge\nrepresentation and automated reasoning research could present a valid\nalternative. Expanding on prior research that tackled the first stage (i), we\nfocus on the second stage, named Concept2Text. Being explainable, data\ntranslation is easily modeled through logic-based rules, once again emphasizing\nthe role of declarative programming in achieving AI explainability. This paper\nexplores a Prolog/CLP-based rewriting system to interpret concepts-articulated\nin terms of classes and relations, plus common knowledge-derived from a generic\nontology, generating natural language text. Its main features include\nhierarchical tree rewritings, modular multilingual generation, support for\nequivalent variants across semantic, grammar, and lexical levels, and a\ntransparent rule-based system. We outline the architecture and demonstrate its\nflexibility through some examples capable of generating numerous diverse and\nequivalent rewritings based on the input concept.", "paper_summary_zh": "<paragraph>這篇論文提出了一個完整的可解釋系統，它可以解釋一組資料，抽象出基礎特徵，並以選擇的自然語言描述它們。系統依賴兩個關鍵階段：(i) 從資料中識別新興屬性，並將它們轉換為抽象概念，以及 (ii) 將這些概念轉換為自然語言。儘管大型語言模型展示了令人印象深刻的自然語言生成能力，但它們的統計性質和內部機制的複雜性仍然迫使我們將這些技術用作黑盒子，放棄可信度。開發一個可解釋的資料解釋管道將有助於促進在安全關鍵環境中使用它，例如處理醫療資訊，並允許非專家和視障人士存取敘述資訊。為此，我們相信知識表示和自動推理研究領域可以提出一個有效的替代方案。在擴展解決第一階段 (i) 的先前研究的基礎上，我們專注於第二階段，稱為 Concept2Text。由於具有可解釋性，資料翻譯很容易透過基於邏輯的規則建模，再次強調宣告式程式設計在實現 AI 可解釋性中的作用。本文探討了一個基於 Prolog/CLP 的重寫系統，以解釋概念，這些概念以類別和關係的形式表達，再加上從通用本体衍生的常識，產生自然語言文字。它的主要特點包括階層樹重寫、模組化多語言生成、支援語義、語法和詞彙層面的等效變體，以及一個透明的基於規則的系統。我們概述了架構，並透過一些範例展示了它的靈活性，這些範例能夠根據輸入概念生成許多不同的等效重寫。</paragraph>", "author": "Flavio Bertini et.al.", "authors": "Flavio Bertini, Alessandro Dal Palù, Federica Zaglio, Francesco Fabiano, Andrea Formisano", "id": "2502.09218v1", "paper_url": "http://arxiv.org/abs/2502.09218v1", "repo": "null"}}