{"2412.03563": {"publish_time": "2024-12-04", "title": "From Individual to Society: A Survey on Social Simulation Driven by Large Language Model-based Agents", "paper_summary": "Traditional sociological research often relies on human participation, which,\nthough effective, is expensive, challenging to scale, and with ethical\nconcerns. Recent advancements in large language models (LLMs) highlight their\npotential to simulate human behavior, enabling the replication of individual\nresponses and facilitating studies on many interdisciplinary studies. In this\npaper, we conduct a comprehensive survey of this field, illustrating the recent\nprogress in simulation driven by LLM-empowered agents. We categorize the\nsimulations into three types: (1) Individual Simulation, which mimics specific\nindividuals or demographic groups; (2) Scenario Simulation, where multiple\nagents collaborate to achieve goals within specific contexts; and (3) Society\nSimulation, which models interactions within agent societies to reflect the\ncomplexity and variety of real-world dynamics. These simulations follow a\nprogression, ranging from detailed individual modeling to large-scale societal\nphenomena. We provide a detailed discussion of each simulation type, including\nthe architecture or key components of the simulation, the classification of\nobjectives or scenarios and the evaluation method. Afterward, we summarize\ncommonly used datasets and benchmarks. Finally, we discuss the trends across\nthese three types of simulation. A repository for the related sources is at\n{\\url{https://github.com/FudanDISC/SocialAgent}}.", "paper_summary_zh": "傳統的社會學研究通常依賴於人類參與，儘管有效，但代價高昂、難以擴展，且有道德上的疑慮。大型語言模型 (LLM) 的最新進展突顯了它們模擬人類行為的潛力，能夠複製個別反應並促進許多跨領域研究的研究。在本文中，我們對這個領域進行全面調查，說明由 LLM 賦能的代理驅動的模擬的最新進展。我們將模擬分類為三種類型：(1) 個體模擬，模擬特定個人或人口群體；(2) 情境模擬，其中多個代理協作在特定情境中達成目標；(3) 社會模擬，模擬代理社會中的互動，以反映現實世界動態的複雜性和多樣性。這些模擬遵循一個進程，從詳細的個體建模到大型社會現象。我們對每種類型的模擬進行詳細討論，包括模擬的架構或關鍵組成部分、目標或情境的分類以及評估方法。之後，我們總結常用資料集和基準。最後，我們討論這三種類型模擬的趨勢。相關資源的存放庫位於 {\\url{https://github.com/FudanDISC/SocialAgent}}。", "author": "Xinyi Mou et.al.", "authors": "Xinyi Mou, Xuanwen Ding, Qi He, Liang Wang, Jingcong Liang, Xinnong Zhang, Libo Sun, Jiayu Lin, Jie Zhou, Xuanjing Huang, Zhongyu Wei", "id": "2412.03563v1", "paper_url": "http://arxiv.org/abs/2412.03563v1", "repo": "null"}}