{"2409.11631": {"publish_time": "2024-09-18", "title": "A Metric Hybrid Planning Approach to Solving Pandemic Planning Problems with Simple SIR Models", "paper_summary": "A pandemic is the spread of a disease across large regions, and can have\ndevastating costs to the society in terms of health, economic and social. As\nsuch, the study of effective pandemic mitigation strategies can yield\nsignificant positive impact on the society. A pandemic can be mathematically\ndescribed using a compartmental model, such as the Susceptible Infected Removed\n(SIR) model. In this paper, we extend the solution equations of the SIR model\nto a state transition model with lockdowns. We formalize a metric hybrid\nplanning problem based on this state transition model, and solve it using a\nmetric hybrid planner. We improve the runtime effectiveness of the metric\nhybrid planner with the addition of valid inequalities, and demonstrate the\nsuccess of our approach both theoretically and experimentally under various\nchallenging settings.", "paper_summary_zh": "流行病是指疾病在大範圍地區傳播，且可能對社會在健康、經濟和社會方面造成毀滅性的成本。因此，研究有效的流行病緩解策略可以對社會產生顯著的正面影響。流行病可以用區室模型來數學描述，例如易感者、感染者、移除者 (SIR) 模型。在本文中，我們將 SIR 模型的求解方程式擴展到帶封鎖的狀態轉換模型。我們根據此狀態轉換模型形式化了一個度量混合規劃問題，並使用度量混合規劃器來解決它。我們透過新增有效不等式來改善度量混合規劃器的執行時間效率，並在各種具有挑戰性的設定下理論上和實驗上證明了我們方法的成功。", "author": "Ari Gestetner et.al.", "authors": "Ari Gestetner, Buser Say", "id": "2409.11631v1", "paper_url": "http://arxiv.org/abs/2409.11631v1", "repo": "null"}}