{"2406.17328": {"publish_time": "2024-06-25", "title": "Dual-Space Knowledge Distillation for Large Language Models", "paper_summary": "Knowledge distillation (KD) is known as a promising solution to compress\nlarge language models (LLMs) via transferring their knowledge to smaller\nmodels. During this process, white-box KD methods usually minimize the distance\nbetween the output distributions of the two models so that more knowledge can\nbe transferred. However, in the current white-box KD framework, the output\ndistributions are from the respective output spaces of the two models, using\ntheir own prediction heads. We argue that the space discrepancy will lead to\nlow similarity between the teacher model and the student model on both\nrepresentation and distribution levels. Furthermore, this discrepancy also\nhinders the KD process between models with different vocabularies, which is\ncommon for current LLMs. To address these issues, we propose a dual-space\nknowledge distillation (DSKD) framework that unifies the output spaces of the\ntwo models for KD. On the basis of DSKD, we further develop a cross-model\nattention mechanism, which can automatically align the representations of the\ntwo models with different vocabularies. Thus, our framework is not only\ncompatible with various distance functions for KD (e.g., KL divergence) like\nthe current framework, but also supports KD between any two LLMs regardless of\ntheir vocabularies. Experiments on task-agnostic instruction-following\nbenchmarks show that DSKD significantly outperforms the current white-box KD\nframework with various distance functions, and also surpasses existing KD\nmethods for LLMs with different vocabularies.", "paper_summary_zh": "知识蒸馏 (KD) 是一种有前途的解决方案，可通过将大语言模型 (LLM) 的知识转移到较小的模型中来压缩大语言模型 (LLM)。在此过程中，白盒 KD 方法通常会最小化两个模型输出分布之间的距离，以便可以转移更多知识。然而，在当前的白盒 KD 框架中，输出分布来自两个模型各自的输出空间，并使用它们自己的预测头。我们认为，这种空间差异会导致教师模型和学生模型在表示和分布层面上相似度较低。此外，这种差异还阻碍了具有不同词汇表的模型之间的 KD 过程，这对于当前的 LLM 来说很常见。为了解决这些问题，我们提出了一个双空间知识蒸馏 (DSKD) 框架，该框架统一了两个模型的输出空间以进行 KD。在 DSKD 的基础上，我们进一步开发了一种跨模型注意机制，它可以自动对齐具有不同词汇表的两个模型的表示。因此，我们的框架不仅与 KD 的各种距离函数（例如 KL 散度）兼容（如当前框架），而且还支持在任何两个 LLM 之间进行 KD，而不管它们的词汇表如何。在与任务无关的指令遵循基准上的实验表明，DSKD 在各种距离函数下明显优于当前的白盒 KD 框架，并且还超越了现有的针对具有不同词汇表的 LLM 的 KD 方法。", "author": "Songming Zhang et.al.", "authors": "Songming Zhang, Xue Zhang, Zengkui Sun, Yufeng Chen, Jinan Xu", "id": "2406.17328v1", "paper_url": "http://arxiv.org/abs/2406.17328v1", "repo": "https://github.com/songmzhang/dskd"}}