{"2405.06624": {"publish_time": "2024-05-10", "title": "Towards Guaranteed Safe AI: A Framework for Ensuring Robust and Reliable AI Systems", "paper_summary": "Ensuring that AI systems reliably and robustly avoid harmful or dangerous\nbehaviours is a crucial challenge, especially for AI systems with a high degree\nof autonomy and general intelligence, or systems used in safety-critical\ncontexts. In this paper, we will introduce and define a family of approaches to\nAI safety, which we will refer to as guaranteed safe (GS) AI. The core feature\nof these approaches is that they aim to produce AI systems which are equipped\nwith high-assurance quantitative safety guarantees. This is achieved by the\ninterplay of three core components: a world model (which provides a\nmathematical description of how the AI system affects the outside world), a\nsafety specification (which is a mathematical description of what effects are\nacceptable), and a verifier (which provides an auditable proof certificate that\nthe AI satisfies the safety specification relative to the world model). We\noutline a number of approaches for creating each of these three core\ncomponents, describe the main technical challenges, and suggest a number of\npotential solutions to them. We also argue for the necessity of this approach\nto AI safety, and for the inadequacy of the main alternative approaches.", "paper_summary_zh": "確保 AI 系統可靠且穩健地避免有害或危險的行為是一項至關重要的挑戰，特別是對於高度自主和具備一般智慧的 AI 系統，或用於安全關鍵情境中的系統。在本文中，我們將介紹和定義一系列 AI 安全方法，我們將其稱為保證安全 (GS) AI。這些方法的核心特徵是它們旨在產生具備高保證定量安全保證的 AI 系統。這是透過三個核心組成的交互作用來實現的：世界模型（提供 AI 系統如何影響外部世界的數學描述）、安全規範（對可接受影響的數學描述）和驗證器（提供可稽核的證明證明，證明 AI 滿足相對於世界模型的安全規範）。我們概述了建立這三個核心組成中每一個的許多方法，描述了主要的技術挑戰，並提出了一些可能的解決方案。我們也主張這種方法對於 AI 安全的必要性，以及主要替代方法的不足。", "author": "David \"davidad\" Dalrymple et.al.", "authors": "David \"davidad\" Dalrymple, Joar Skalse, Yoshua Bengio, Stuart Russell, Max Tegmark, Sanjit Seshia, Steve Omohundro, Christian Szegedy, Ben Goldhaber, Nora Ammann, Alessandro Abate, Joe Halpern, Clark Barrett, Ding Zhao, Tan Zhi-Xuan, Jeannette Wing, Joshua Tenenbaum", "id": "2405.06624v1", "paper_url": "http://arxiv.org/abs/2405.06624v1", "repo": "null"}}