{"2406.09200": {"publish_time": "2024-06-13", "title": "Orthogonality and isotropy of speaker and phonetic information in self-supervised speech representations", "paper_summary": "Self-supervised speech representations can hugely benefit downstream speech\ntechnologies, yet the properties that make them useful are still poorly\nunderstood. Two candidate properties related to the geometry of the\nrepresentation space have been hypothesized to correlate well with downstream\ntasks: (1) the degree of orthogonality between the subspaces spanned by the\nspeaker centroids and phone centroids, and (2) the isotropy of the space, i.e.,\nthe degree to which all dimensions are effectively utilized. To study them, we\nintroduce a new measure, Cumulative Residual Variance (CRV), which can be used\nto assess both properties. Using linear classifiers for speaker and phone ID to\nprobe the representations of six different self-supervised models and two\nuntrained baselines, we ask whether either orthogonality or isotropy correlate\nwith linear probing accuracy. We find that both measures correlate with\nphonetic probing accuracy, though our results on isotropy are more nuanced.", "paper_summary_zh": "自监督语音表征可以极大地造福下游语音技术，但使其有用的特性仍然知之甚少。已经假设与表征空间几何形状相关的两个候选特性与下游任务密切相关：(1) 说话者质心和音素质心所跨越的子空间之间的正交程度，以及 (2) 空间的各向同性，即所有维度得到有效利用的程度。为了研究它们，我们引入了一个新测量值，即累积残差方差 (CRV)，它可用于评估这两个特性。使用线性分类器对说话者和音素 ID 对六个不同的自监督模型和两个未经训练的基准表征进行探测，我们询问正交性或各向同性是否与线性探测准确性相关。我们发现这两个测量值都与音素探测准确性相关，尽管我们对各向同性的结果更为细致。", "author": "Mukhtar Mohamed et.al.", "authors": "Mukhtar Mohamed, Oli Danyi Liu, Hao Tang, Sharon Goldwater", "id": "2406.09200v1", "paper_url": "http://arxiv.org/abs/2406.09200v1", "repo": "null"}}