{"2410.11723": {"publish_time": "2024-10-15", "title": "Generalizable Spacecraft Trajectory Generation via Multimodal Learning with Transformers", "paper_summary": "Effective trajectory generation is essential for reliable on-board spacecraft\nautonomy. Among other approaches, learning-based warm-starting represents an\nappealing paradigm for solving the trajectory generation problem, effectively\ncombining the benefits of optimization- and data-driven methods. Current\napproaches for learning-based trajectory generation often focus on fixed,\nsingle-scenario environments, where key scene characteristics, such as obstacle\npositions or final-time requirements, remain constant across problem instances.\nHowever, practical trajectory generation requires the scenario to be frequently\nreconfigured, making the single-scenario approach a potentially impractical\nsolution. To address this challenge, we present a novel trajectory generation\nframework that generalizes across diverse problem configurations, by leveraging\nhigh-capacity transformer neural networks capable of learning from multimodal\ndata sources. Specifically, our approach integrates transformer-based neural\nnetwork models into the trajectory optimization process, encoding both\nscene-level information (e.g., obstacle locations, initial and goal states) and\ntrajectory-level constraints (e.g., time bounds, fuel consumption targets) via\nmultimodal representations. The transformer network then generates near-optimal\ninitial guesses for non-convex optimization problems, significantly enhancing\nconvergence speed and performance. The framework is validated through extensive\nsimulations and real-world experiments on a free-flyer platform, achieving up\nto 30% cost improvement and 80% reduction in infeasible cases with respect to\ntraditional approaches, and demonstrating robust generalization across diverse\nscenario variations.", "paper_summary_zh": "<paragraph>有效的軌道生成對於可靠的機上太空船自主性至關重要。在其他方法中，基於學習的熱啟動代表了解決軌道生成問題的一個有吸引力的範例，有效地結合了最佳化和資料驅動方法的優點。目前基於學習的軌道生成方法通常側重於固定的單一場景環境，其中關鍵場景特徵（例如障礙物位置或最終時間要求）在問題實例中保持不變。然而，實際軌道生成需要頻繁地重新配置場景，使單一場景方法成為潛在的非實際解決方案。為了應對這一挑戰，我們提出了一個新的軌道生成框架，它通過利用能夠從多模態資料來源學習的高容量轉換器神經網路，在不同的問題配置中進行概括。具體來說，我們的方法將基於轉換器的神經網路模型整合到軌道最佳化過程中，通過多模態表示對場景級別資訊（例如障礙物位置、初始和目標狀態）和軌道級別約束（例如時間界限、燃料消耗目標）進行編碼。然後，轉換器網路為非凸最佳化問題生成近乎最佳的初始猜測，從而顯著提高收斂速度和效能。該框架通過在自由飛行器平台上進行廣泛的模擬和真實世界實驗得到驗證，與傳統方法相比，成本降低了 30%，不可行案例減少了 80%，並證明了在不同的場景變體中具有強大的概括性。</paragraph>", "author": "Davide Celestini et.al.", "authors": "Davide Celestini, Amirhossein Afsharrad, Daniele Gammelli, Tommaso Guffanti, Gioele Zardini, Sanjay Lall, Elisa Capello, Simone D'Amico, Marco Pavone", "id": "2410.11723v1", "paper_url": "http://arxiv.org/abs/2410.11723v1", "repo": "null"}}