{"2501.17310": {"publish_time": "2025-01-28", "title": "Probing LLM World Models: Enhancing Guesstimation with Wisdom of Crowds Decoding", "paper_summary": "Guesstimation, the task of making approximate quantity estimates, is a common\nreal-world challenge. However, it has been largely overlooked in large language\nmodels (LLMs) and vision language models (VLMs) research. We introduce a novel\nguesstimation dataset, MARBLES. This dataset requires one to estimate how many\nitems (e.g., marbles) can fit into containers (e.g., a one-cup measuring cup),\nboth with and without accompanying images. Inspired by the social science\nconcept of the ``{Wisdom of Crowds'' (WOC) - taking the median from estimates\nfrom a crowd), which has proven effective in guesstimation, we propose ``WOC\ndecoding'' strategy for LLM guesstimation. We show that LLMs/VLMs perform well\non guesstimation, suggesting that they possess some level of a \"world model\"\nnecessary for guesstimation. Moreover, similar to human performance, the WOC\ndecoding method improves LLM/VLM guesstimation accuracy. Furthermore, the\ninclusion of images in the multimodal condition enhances model performance.\nThese results highlight the value of WOC decoding strategy for LLMs/VLMs and\nposition guesstimation as a probe for evaluating LLMs/VLMs' world model.", "paper_summary_zh": "估計，即進行近似數量估計的任務，是一個常見的\n現實世界挑戰。然而，它在大型語言模型 (LLM) 和視覺語言模型 (VLM) 研究中很大程度上被忽視了。我們引入了一個新穎的估計數據集，MARBLES。此數據集要求人們估計有多少\n物品（例如，彈珠）可以放入容器（例如，一個量杯），無論是否附有圖片。受社會科學概念``{群眾的智慧'' (WOC) 的啟發 - 從人群的估計中取中位數），這已被證明在估計中很有效，我們提出了 LLM 估計的``WOC\n解碼''策略。我們表明 LLM/VLM 在估計方面表現良好，這表明它們具有一定的估計所需的「世界模型」。此外，與人類表現類似，WOC\n解碼方法提高了 LLM/VLM 的估計準確度。此外，在多模態條件中包含圖像可以增強模型性能。\n這些結果突出了 WOC 解碼策略對 LLM/VLM 的價值，並將估計定位為評估 LLM/VLM 世界模型的探針。", "author": "Yun-Shiuan Chuang et.al.", "authors": "Yun-Shiuan Chuang, Nikunj Harlalka, Sameer Narendran, Alexander Cheung, Sizhe Gao, Siddharth Suresh, Junjie Hu, Timothy T. Rogers", "id": "2501.17310v1", "paper_url": "http://arxiv.org/abs/2501.17310v1", "repo": "null"}}