{"2504.15785": {"publish_time": "2025-04-22", "title": "WALL-E 2.0: World Alignment by NeuroSymbolic Learning improves World Model-based LLM Agents", "paper_summary": "Can we build accurate world models out of large language models (LLMs)? How\ncan world models benefit LLM agents? The gap between the prior knowledge of\nLLMs and the specified environment's dynamics usually bottlenecks LLMs'\nperformance as world models. To bridge the gap, we propose a training-free\n\"world alignment\" that learns an environment's symbolic knowledge complementary\nto LLMs. The symbolic knowledge covers action rules, knowledge graphs, and\nscene graphs, which are extracted by LLMs from exploration trajectories and\nencoded into executable codes to regulate LLM agents' policies. We further\npropose an RL-free, model-based agent \"WALL-E 2.0\" through the model-predictive\ncontrol (MPC) framework. Unlike classical MPC requiring costly optimization on\nthe fly, we adopt an LLM agent as an efficient look-ahead optimizer of future\nsteps' actions by interacting with the neurosymbolic world model. While the LLM\nagent's strong heuristics make it an efficient planner in MPC, the quality of\nits planned actions is also secured by the accurate predictions of the aligned\nworld model. They together considerably improve learning efficiency in a new\nenvironment. On open-world challenges in Mars (Minecraft like) and ALFWorld\n(embodied indoor environments), WALL-E 2.0 significantly outperforms existing\nmethods, e.g., surpassing baselines in Mars by 16.1%-51.6% of success rate and\nby at least 61.7% in score. In ALFWorld, it achieves a new record 98% success\nrate after only 4 iterations.", "paper_summary_zh": "<paragraph>我們能否用大型語言模型 (LLM) 建構準確的世界模型？世界模型如何使 LLM 代理受益？LLM 的先驗知識與特定環境動態之間的差距通常會限制 LLM 作為世界模型的效能。為了彌合這一差距，我們提出了一種無需訓練的「世界對齊」方法，它學習與 LLM 互補的環境符號知識。這些符號知識涵蓋動作規則、知識圖譜和場景圖譜，它們是由 LLM 從探索軌跡中提取並編碼成可執行程式碼，以規範 LLM 代理的策略。我們進一步透過模型預測控制 (MPC) 框架，提出了一種無需強化學習、基於模型的代理「WALL-E 2.0」。與傳統 MPC 需要動態進行成本高昂的優化不同，我們採用 LLM 代理作為未來步驟動作的有效前瞻優化器，透過與神經符號世界模型互動來實現。雖然 LLM 代理的強大啟發式方法使其成為 MPC 中的高效規劃器，但其規劃動作的品質也受到對齊世界模型準確預測的保障。它們共同顯著提高了在新環境中的學習效率。在火星（類似 Minecraft）和 ALFWorld（具體化的室內環境）的開放世界挑戰中，WALL-E 2.0 的表現明顯優於現有方法，例如，在火星上的成功率比基準高出 16.1%-51.6%，得分至少高出 61.7%。在 ALFWorld 中，它僅經過 4 次迭代就達到了 98% 的成功率新紀錄。 </paragraph>\n", "author": "Siyu Zhou et.al.", "authors": "Siyu Zhou, Tianyi Zhou, Yijun Yang, Guodong Long, Deheng Ye, Jing Jiang, Chengqi Zhang", "id": "2504.15785v1", "paper_url": "http://arxiv.org/abs/2504.15785v1", "repo": "null"}}