{"2412.06136": {"publish_time": "2024-12-09", "title": "AIDE: Task-Specific Fine Tuning with Attribute Guided Multi-Hop Data Expansion", "paper_summary": "Fine-tuning large language models (LLMs) for specific tasks requires\nhigh-quality, diverse training data relevant to the task. Recent research has\nleveraged LLMs to synthesize training data, but existing approaches either\ndepend on large seed datasets or struggle to ensure both task relevance and\ndata diversity in the generated outputs. To address these challenges, we\npropose AIDE, a novel data synthesis framework that uses a multi-hop process to\nexpand 10 seed data points while ensuring diversity and task relevance. AIDE\nextracts the main topic and key knowledge attributes from the seed data to\nguide the synthesis process. In each subsequent hop, it extracts the topic and\nattributes from the newly generated data and continues guided synthesis. This\nprocess repeats for a total of K hops. To prevent irrelevant data generation as\nthe hop depth increases, AIDE incorporates a residual connection mechanism and\nuses self-reflection to improve data quality. Our empirical results demonstrate\nthat fine-tuning Mistral-7B, Llama-3.1-8B and Llama-3.2-3B with AIDE achieves\nmore than 10% accuracy improvements over the base models across 13 tasks from 5\ndifferent benchmarks, while outperforming the models fine-tuned with\nstate-of-the-art data synthesis methods like Evol-Instruct, DataTune and\nPrompt2Model.", "paper_summary_zh": "微調大型語言模型 (LLM) 以執行特定任務需要與任務相關的高品質、多樣化訓練資料。最近的研究已利用 LLM 來綜合訓練資料，但現有方法依賴於大型種子資料集，或難以確保生成輸出中的任務相關性和資料多樣性。為了應對這些挑戰，我們提出 AIDE，這是一個新穎的資料綜合架構，它使用多重跳躍程序來擴充 10 個種子資料點，同時確保多樣性和任務相關性。AIDE 從種子資料中提取主要主題和關鍵知識屬性，以指導綜合程序。在每個後續跳躍中，它從新生成的資料中提取主題和屬性，並繼續進行引導式綜合。這個程序總共重複 K 次跳躍。為了防止隨著跳躍深度增加而產生不相關的資料，AIDE 結合了殘差連接機制，並使用自我反思來改善資料品質。我們的實證結果表明，使用 AIDE 微調 Mistral-7B、Llama-3.1-8B 和 Llama-3.2-3B，在來自 5 個不同基準的 13 個任務中，其準確度提升幅度超過 10%，同時優於使用 Evol-Instruct、DataTune 和 Prompt2Model 等最先進資料綜合方法微調的模型。", "author": "Jiayu Li et.al.", "authors": "Jiayu Li, Xuan Zhu, Fang Liu, Yanjun Qi", "id": "2412.06136v1", "paper_url": "http://arxiv.org/abs/2412.06136v1", "repo": "null"}}