{"2410.07109": {"publish_time": "2024-10-09", "title": "I Want to Break Free! Anti-Social Behavior and Persuasion Ability of LLMs in Multi-Agent Settings with Social Hierarchy", "paper_summary": "As Large Language Model (LLM)-based agents become increasingly autonomous and\nwill more freely interact with each other, studying interactions between them\nbecomes crucial to anticipate emergent phenomena and potential risks. Drawing\ninspiration from the widely popular Stanford Prison Experiment, we contribute\nto this line of research by studying interaction patterns of LLM agents in a\ncontext characterized by strict social hierarchy. We do so by specifically\nstudying two types of phenomena: persuasion and anti-social behavior in\nsimulated scenarios involving a guard and a prisoner agent who seeks to achieve\na specific goal (i.e., obtaining additional yard time or escape from prison).\nLeveraging 200 experimental scenarios for a total of 2,000 machine-machine\nconversations across five different popular LLMs, we provide a set of\nnoteworthy findings. We first document how some models consistently fail in\ncarrying out a conversation in our multi-agent setup where power dynamics are\nat play. Then, for the models that were able to engage in successful\ninteractions, we empirically show how the goal that an agent is set to achieve\nimpacts primarily its persuasiveness, while having a negligible effect with\nrespect to the agent's anti-social behavior. Third, we highlight how agents'\npersonas, and particularly the guard's personality, drive both the likelihood\nof successful persuasion from the prisoner and the emergence of anti-social\nbehaviors. Fourth, we show that even without explicitly prompting for specific\npersonalities, anti-social behavior emerges by simply assigning agents' roles.\nThese results bear implications for the development of interactive LLM agents\nas well as the debate on their societal impact.", "paper_summary_zh": "隨著大型語言模型 (LLM) 為基礎的代理日益自主，且將更自由地彼此互動，研究它們之間的互動關係對於預測新興現象和潛在風險至關重要。從廣受歡迎的史丹佛監獄實驗中汲取靈感，我們透過研究 LLM 代理在以嚴格社會階層為特徵的環境中的互動模式，為這條研究路線做出貢獻。我們透過特別研究兩種現象類型來做到這一點：在模擬情境中涉及一名警衛和一名囚犯代理的說服和反社會行為，該囚犯代理試圖達成特定目標（例如獲得額外的庭院時間或逃離監獄）。我們利用 200 個實驗情境，總計 2,000 次橫跨五種不同熱門 LLM 的機器對機器對話，提供一組值得注意的發現。我們首先記錄一些模型在我們的多重代理設定中始終無法進行對話，其中包含權力動態。然後，對於能夠進行成功互動的模型，我們以經驗方式展示代理設定要達成的目標主要影響其說服力，同時對代理的反社會行為幾乎沒有影響。第三，我們強調代理的角色，尤其是警衛的人格，如何推動囚犯成功說服的可能性和反社會行為的出現。第四，我們展示即使沒有明確提示特定人格，反社會行為也會透過簡單地分配代理角色而出現。這些結果對互動式 LLM 代理的發展及其對社會影響的辯論具有影響。", "author": "Gian Maria Campedelli et.al.", "authors": "Gian Maria Campedelli, Nicolò Penzo, Massimo Stefan, Roberto Dessì, Marco Guerini, Bruno Lepri, Jacopo Staiano", "id": "2410.07109v1", "paper_url": "http://arxiv.org/abs/2410.07109v1", "repo": "null"}}