{"2410.19692": {"publish_time": "2024-10-25", "title": "AGENT-CQ: Automatic Generation and Evaluation of Clarifying Questions for Conversational Search with LLMs", "paper_summary": "Generating diverse and effective clarifying questions is crucial for\nimproving query understanding and retrieval performance in open-domain\nconversational search (CS) systems. We propose AGENT-CQ (Automatic GENeration,\nand evaluaTion of Clarifying Questions), an end-to-end LLM-based framework\naddressing the challenges of scalability and adaptability faced by existing\nmethods that rely on manual curation or template-based approaches. AGENT-CQ\nconsists of two stages: a generation stage employing LLM prompting strategies\nto generate clarifying questions, and an evaluation stage (CrowdLLM) that\nsimulates human crowdsourcing judgments using multiple LLM instances to assess\ngenerated questions and answers based on comprehensive quality metrics.\nExtensive experiments on the ClariQ dataset demonstrate CrowdLLM's\neffectiveness in evaluating question and answer quality. Human evaluation and\nCrowdLLM show that the AGENT-CQ - generation stage, consistently outperforms\nbaselines in various aspects of question and answer quality. In retrieval-based\nevaluation, LLM-generated questions significantly enhance retrieval\neffectiveness for both BM25 and cross-encoder models compared to\nhuman-generated questions.", "paper_summary_zh": "生成多樣且有效的澄清問題對於改善開放領域對話式搜尋 (CS) 系統中的查詢理解和檢索成效至關重要。我們提出 AGENT-CQ（自動生成和評估澄清問題），一種端到端的基於 LLM 的架構，解決現有方法所面臨的可擴充性和適應性挑戰，這些方法依賴於手動策劃或基於範本的方法。AGENT-CQ 包含兩個階段：一個生成階段，使用 LLM 提示策略來生成澄清問題，以及一個評估階段 (CrowdLLM)，使用多個 LLM 實例模擬人工眾包判斷，以根據全面的品質指標評估產生的問題和答案。在 ClariQ 資料集上進行的廣泛實驗證明了 CrowdLLM 在評估問題和答案品質方面的有效性。人工評估和 CrowdLLM 顯示，AGENT-CQ - 生成階段在問題和答案品質的各個方面始終優於基準。在基於檢索的評估中，與人工產生的問題相比，LLM 生成的問題顯著提升了 BM25 和交叉編碼模型的檢索成效。", "author": "Clemencia Siro et.al.", "authors": "Clemencia Siro, Yifei Yuan, Mohammad Aliannejadi, Maarten de Rijke", "id": "2410.19692v1", "paper_url": "http://arxiv.org/abs/2410.19692v1", "repo": "null"}}