{"2409.11041": {"publish_time": "2024-09-17", "title": "Towards No-Code Programming of Cobots: Experiments with Code Synthesis by Large Code Models for Conversational Programming", "paper_summary": "While there has been a lot of research recently on robots in household\nenvironments, at the present time, most robots in existence can be found on\nshop floors, and most interactions between humans and robots happen there.\n``Collaborative robots'' (cobots) designed to work alongside humans on assembly\nlines traditionally require expert programming, limiting ability to make\nchanges, or manual guidance, limiting expressivity of the resulting programs.\nTo address these limitations, we explore using Large Language Models (LLMs),\nand in particular, their abilities of doing in-context learning, for\nconversational code generation. As a first step, we define RATS, the\n``Repetitive Assembly Task'', a 2D building task designed to lay the foundation\nfor simulating industry assembly scenarios. In this task, a `programmer'\ninstructs a cobot, using natural language, on how a certain assembly is to be\nbuilt; that is, the programmer induces a program, through natural language. We\ncreate a dataset that pairs target structures with various example instructions\n(human-authored, template-based, and model-generated) and example code. With\nthis, we systematically evaluate the capabilities of state-of-the-art LLMs for\nsynthesising this kind of code, given in-context examples. Evaluating in a\nsimulated environment, we find that LLMs are capable of generating accurate\n`first order code' (instruction sequences), but have problems producing\n`higher-order code' (abstractions such as functions, or use of loops).", "paper_summary_zh": "<paragraph>雖然最近對於家庭環境中的機器人有許多研究，目前為止，大多數的機器人存在於商店樓層，而人類與機器人之間的大多數互動也發生在這些地方。傳統上設計用於與人類在組裝線上一起工作的「協作機器人」（cobots）需要專家程式設計，這會限制做出變更的能力，或限制手動引導，進而限制所產生程式碼的表達力。為了解決這些限制，我們探索使用大型語言模型（LLM），特別是它們在情境學習中的能力，用於對話式程式碼產生。作為第一步，我們定義 RATS，即「重複組裝任務」，這是一個 2D 建構任務，旨在奠定模擬產業組裝場景的基礎。在這個任務中，一個「程式設計師」使用自然語言指示一個 cobot 如何建構某個組裝；也就是說，程式設計師透過自然語言引導一個程式。我們建立一個將目標結構與各種範例指示（人工撰寫、基於範本，以及模型產生）和範例程式碼配對的資料集。透過這個資料集，我們系統性地評估最先進的 LLM 在給定情境範例的情況下，綜合這種程式碼的能力。在模擬環境中評估，我們發現 LLM 能夠產生準確的「一階程式碼」（指令序列），但難以產生「高階程式碼」（例如函式或迴圈使用的抽象概念）。</paragraph>", "author": "Kranti Chalamalasetti et.al.", "authors": "Kranti Chalamalasetti, Sherzod Hakimov, David Schlangen", "id": "2409.11041v1", "paper_url": "http://arxiv.org/abs/2409.11041v1", "repo": "null"}}