{"2412.07573": {"publish_time": "2024-12-10", "title": "SST framework for Document Matching", "paper_summary": "Long-form document matching aims to judge the relevance between two documents\nand has been applied to various scenarios. Most existing works utilize\nhierarchical or long context models to process documents, which achieve coarse\nunderstanding but may ignore details. Some researchers construct a document\nview with similar sentences about aligned document subtopics to focus on\ndetailed matching signals. However, a long document generally contains multiple\nsubtopics. The matching signals are heterogeneous from multiple topics.\nConsidering only the homologous aligned subtopics may not be representative\nenough and may cause biased modeling. In this paper, we introduce a new\nframework to model representative matching signals. First, we propose to\ncapture various matching signals through subtopics of document pairs. Next, We\nconstruct multiple document views based on subtopics to cover heterogeneous and\nvaluable details. However, existing spatial aggregation methods like attention,\nwhich integrate all these views simultaneously, are hard to integrate\nheterogeneous information. Instead, we propose temporal aggregation, which\neffectively integrates different views gradually as the training progresses.\nExperimental results show that our learning framework is effective on several\ndocument-matching tasks, including news duplication and legal case retrieval.", "paper_summary_zh": "長文件文件配對旨在判斷兩個文件之間的關聯性，並已應用於各種場景。現有的大多數作品利用階層式或長上下文模型來處理文件，這實現了粗略的理解，但可能會忽略細節。一些研究人員構建了一個包含有關對齊文件子主題的相似句子的文件檢視，以專注於詳細的匹配訊號。然而，長文件通常包含多個子主題。匹配訊號來自多個主題，是異質的。僅考慮同源對齊子主題可能不夠具代表性，並且可能導致偏頗的建模。在本文中，我們引入了一個新的框架來建模具有代表性的匹配訊號。首先，我們建議透過文件對的子主題擷取各種匹配訊號。接下來，我們基於子主題構建多個文件檢視，以涵蓋異質且有價值的細節。然而，現有的空間聚合方法（例如注意力），同時整合所有這些檢視，很難整合異質資訊。相反，我們提出時間聚合，隨著訓練的進行，它會逐漸有效地整合不同的檢視。實驗結果表明，我們的學習框架在多項文件匹配任務中是有效的，包括新聞重複和法律案例檢索。", "author": "Youchao Zhou et.al.", "authors": "Youchao Zhou, Heyan Huang, Zhijing Wu, Yuhang Liu, Xinglin Wang", "id": "2412.07573v1", "paper_url": "http://arxiv.org/abs/2412.07573v1", "repo": "null"}}