{"2407.07094": {"publish_time": "2024-07-09", "title": "AnyTaskTune: Advanced Domain-Specific Solutions through Task-Fine-Tuning", "paper_summary": "The pervasive deployment of Large Language Models-LLMs in various sectors\noften neglects the nuanced requirements of individuals and small organizations,\nwho benefit more from models precisely tailored to their specific business\ncontexts rather than those with broadly superior general capabilities. This\nwork introduces \\textbf{AnyTaskTune}, a novel fine-tuning methodology coined as\n\\textbf{Task-Fine-Tune}, specifically developed to elevate model performance on\na diverse array of domain-specific tasks. This method involves a meticulous\nprocess to identify and define targeted sub-tasks within a domain, followed by\nthe creation of specialized enhancement datasets for fine-tuning, thereby\noptimizing task-specific model performance. We conducted comprehensive\nfine-tuning experiments not only in the legal domain for tasks such as keyword\nextraction and sentence prediction but across over twenty different sub-tasks\nderived from the domains of finance, healthcare, law, psychology, consumer\nservices, and human resources. To substantiate our approach and facilitate\ncommunity engagement, we will open-source these bilingual task datasets. Our\nfindings demonstrate that models fine-tuned using the \\textbf{Task-Fine-Tune}\nmethodology not only achieve superior performance on these specific tasks but\nalso significantly outperform models with higher general capabilities in their\nrespective domains. Our work is publicly available at\n\\url{https://github.com/PandaVT/DataTager}.", "paper_summary_zh": "各種產業中普遍部署大型語言模型 (LLM) 時，常常忽略個人和小型組織的細微需求，而這些對象較能從精準調整到其特定商業脈絡的模型中獲益，而非具備廣泛卓越一般能力的模型。本研究介紹一種新穎的微調方法，稱為「任務微調」(Task-Fine-Tune)，專門開發用於提升模型在各種特定領域任務上的效能。此方法包含一個細緻的程序，用於識別和定義領域內的目標子任務，然後建立專門的強化資料集進行微調，進而最佳化特定任務的模型效能。我們不僅在法律領域進行全面的微調實驗，針對關鍵字萃取和句子預測等任務，還涵蓋從金融、醫療保健、法律、心理學、消費者服務和人力資源等領域衍生的二十多個不同子任務。為了證實我們的做法並促進社群參與，我們將開放這些雙語任務資料集的原始碼。我們的研究結果顯示，使用「任務微調」方法微調的模型不僅在這些特定任務上達到卓越效能，而且在各自領域中也明顯優於具備較高一般能力的模型。我們的研究成果已於 https://github.com/PandaVT/DataTager 公開。", "author": "Jiaxi Cui et.al.", "authors": "Jiaxi Cui, Wentao Zhang, Jing Tang, Xudong Tong, Zhenwei Zhang, Amie, Jing Wen, Rongsheng Wang, Pengfei Wu", "id": "2407.07094v1", "paper_url": "http://arxiv.org/abs/2407.07094v1", "repo": "https://github.com/pandavt/datatager"}}