{"2407.03321": {"publish_time": "2024-07-03", "title": "Planetarium: A Rigorous Benchmark for Translating Text to Structured Planning Languages", "paper_summary": "Many recent works have explored using language models for planning problems.\nOne line of research focuses on translating natural language descriptions of\nplanning tasks into structured planning languages, such as the planning domain\ndefinition language (PDDL). While this approach is promising, accurately\nmeasuring the quality of generated PDDL code continues to pose significant\nchallenges. First, generated PDDL code is typically evaluated using planning\nvalidators that check whether the problem can be solved with a planner. This\nmethod is insufficient because a language model might generate valid PDDL code\nthat does not align with the natural language description of the task. Second,\nexisting evaluation sets often have natural language descriptions of the\nplanning task that closely resemble the ground truth PDDL, reducing the\nchallenge of the task. To bridge this gap, we introduce \\benchmarkName, a\nbenchmark designed to evaluate language models' ability to generate PDDL code\nfrom natural language descriptions of planning tasks. We begin by creating a\nPDDL equivalence algorithm that rigorously evaluates the correctness of PDDL\ncode generated by language models by flexibly comparing it against a ground\ntruth PDDL. Then, we present a dataset of $132,037$ text-to-PDDL pairs across\n13 different tasks, with varying levels of difficulty. Finally, we evaluate\nseveral API-access and open-weight language models that reveal this task's\ncomplexity. For example, $87.6\\%$ of the PDDL problem descriptions generated by\nGPT-4o are syntactically parseable, $82.2\\%$ are valid, solve-able problems,\nbut only $35.1\\%$ are semantically correct, highlighting the need for a more\nrigorous benchmark for this problem.", "paper_summary_zh": "許多近期研究已探討使用語言模型解決規劃問題。\n其中一項研究重點在於將規劃任務的自然語言描述轉換為結構化規劃語言，例如規劃領域定義語言 (PDDL)。雖然此方法很有前景，但精確衡量所產生 PDDL 程式碼的品質仍是一項重大挑戰。首先，產生的 PDDL 程式碼通常使用規劃驗證器進行評估，檢查規劃器是否能解決問題。這種方法並不足夠，因為語言模型可能會產生有效的 PDDL 程式碼，但與任務的自然語言描述不符。其次，現有的評估集通常有規劃任務的自然語言描述，與真實 PDDL 非常相似，降低了任務的挑戰性。為了彌補這個差距，我們引入了 \\benchmarkName，這是一個基準，用於評估語言模型從規劃任務的自然語言描述產生 PDDL 程式碼的能力。我們首先建立一個 PDDL 等價演算法，透過靈活地將其與真實 PDDL 進行比較，嚴格評估語言模型產生的 PDDL 程式碼的正確性。接著，我們提供一個包含 13 個不同任務的 132,037 個文字轉 PDDL 配對的資料集，難度程度不一。最後，我們評估了幾個 API 存取和開放權重語言模型，揭示了此任務的複雜性。例如，GPT-4o 產生的 PDDL 問題描述中有 87.6% 在語法上可以解析，82.2% 是有效且可以解決的問題，但只有 35.1% 在語義上正確，突顯出需要一個更嚴格的基準來解決這個問題。", "author": "Max Zuo et.al.", "authors": "Max Zuo, Francisco Piedrahita Velez, Xiaochen Li, Michael L. Littman, Stephen H. Bach", "id": "2407.03321v1", "paper_url": "http://arxiv.org/abs/2407.03321v1", "repo": "https://github.com/batsresearch/planetarium"}}