{"2412.16925": {"publish_time": "2024-12-22", "title": "Quantifying Public Response to COVID-19 Events: Introducing the Community Sentiment and Engagement Index", "paper_summary": "This study introduces the Community Sentiment and Engagement Index (CSEI),\ndeveloped to capture nuanced public sentiment and engagement variations on\nsocial media, particularly in response to major events related to COVID-19.\nConstructed with diverse sentiment indicators, CSEI integrates features like\nengagement, daily post count, compound sentiment, fine-grain sentiments (fear,\nsurprise, joy, sadness, anger, disgust, and neutral), readability,\noffensiveness, and domain diversity. Each component is systematically weighted\nthrough a multi-step Principal Component Analysis (PCA)-based framework,\nprioritizing features according to their variance contributions across temporal\nsentiment shifts. This approach dynamically adjusts component importance,\nenabling CSEI to precisely capture high-sensitivity shifts in public sentiment.\nThe development of CSEI showed statistically significant correlations with its\nconstituent features, underscoring internal consistency and sensitivity to\nspecific sentiment dimensions. CSEI's responsiveness was validated using a\ndataset of 4,510,178 Reddit posts about COVID-19. The analysis focused on 15\nmajor events, including the WHO's declaration of COVID-19 as a pandemic, the\nfirst reported cases of COVID-19 across different countries, national\nlockdowns, vaccine developments, and crucial public health measures. Cumulative\nchanges in CSEI revealed prominent peaks and valleys aligned with these events,\nindicating significant patterns in public sentiment across different phases of\nthe pandemic. Pearson correlation analysis further confirmed a statistically\nsignificant relationship between CSEI daily fluctuations and these events (p =\n0.0428), highlighting the capacity of CSEI to infer and interpret shifts in\npublic sentiment and engagement in response to major events related to\nCOVID-19.", "paper_summary_zh": "本研究引入了社群情緒和參與指數 (CSEI)，其旨在捕捉社群媒體上細微的公眾情緒和參與變化，特別是針對與 COVID-19 相關的重大事件。CSEI 以多樣化的情緒指標建構，整合了參與度、每日發文數、複合情緒、細緻情緒（恐懼、驚訝、快樂、悲傷、憤怒、厭惡和中立）、可讀性、冒犯性和網域多樣性等特徵。每個組成部分都透過多步驟主成分分析 (PCA) 為基礎的架構進行系統性加權，根據特徵對時間情緒變化的貢獻度對特徵進行優先排序。此方法動態調整組成部分的重要性，使 CSEI 能夠精準捕捉公眾情緒中的高敏感度變化。CSEI 的發展顯示出與其組成特徵具有統計顯著相關性，強調了內部一致性和對特定情緒面向的敏感性。CSEI 的反應能力已使用包含 4,510,178 則關於 COVID-19 的 Reddit 貼文的資料集進行驗證。分析重點關注 15 個重大事件，包括 WHO 宣布 COVID-19 為一場大流行病、不同國家首次報告 COVID-19 病例、國家封鎖、疫苗開發和重要的公共衛生措施。CSEI 的累積變化顯示出與這些事件相符的顯著高峰和低谷，表明在疫情的不同階段中公眾情緒存在顯著模式。皮爾森相關分析進一步證實了 CSEI 每日的波動與這些事件之間存在統計顯著相關性 (p = 0.0428)，突顯出 CSEI 推論和詮釋公眾情緒變化以及對與 COVID-19 相關的重大事件參與度變化的能力。", "author": "Nirmalya Thakur et.al.", "authors": "Nirmalya Thakur, Kesha A. Patel, Audrey Poon, Shuqi Cui, Nazif Azizi, Rishika Shah, Riyan Shah", "id": "2412.16925v1", "paper_url": "http://arxiv.org/abs/2412.16925v1", "repo": "null"}}