{"2408.00588": {"publish_time": "2024-07-25", "title": "Closing the gap between open-source and commercial large language models for medical evidence summarization", "paper_summary": "Large language models (LLMs) hold great promise in summarizing medical\nevidence. Most recent studies focus on the application of proprietary LLMs.\nUsing proprietary LLMs introduces multiple risk factors, including a lack of\ntransparency and vendor dependency. While open-source LLMs allow better\ntransparency and customization, their performance falls short compared to\nproprietary ones. In this study, we investigated to what extent fine-tuning\nopen-source LLMs can further improve their performance in summarizing medical\nevidence. Utilizing a benchmark dataset, MedReview, consisting of 8,161 pairs\nof systematic reviews and summaries, we fine-tuned three broadly-used,\nopen-sourced LLMs, namely PRIMERA, LongT5, and Llama-2. Overall, the fine-tuned\nLLMs obtained an increase of 9.89 in ROUGE-L (95% confidence interval:\n8.94-10.81), 13.21 in METEOR score (95% confidence interval: 12.05-14.37), and\n15.82 in CHRF score (95% confidence interval: 13.89-16.44). The performance of\nfine-tuned LongT5 is close to GPT-3.5 with zero-shot settings. Furthermore,\nsmaller fine-tuned models sometimes even demonstrated superior performance\ncompared to larger zero-shot models. The above trends of improvement were also\nmanifested in both human and GPT4-simulated evaluations. Our results can be\napplied to guide model selection for tasks demanding particular domain\nknowledge, such as medical evidence summarization.", "paper_summary_zh": "大型语言模型 (LLM) 在总结医学证据方面具有很大的前景。最近的研究主要集中在专有 LLM 的应用上。使用专有 LLM 会引入多个风险因素，包括缺乏透明度和供应商依赖性。虽然开源 LLM 允许更好的透明度和定制，但它们的性能与专有 LLM 相比还有所不足。在这项研究中，我们调查了微调开源 LLM 在多大程度上可以进一步提高其在总结医学证据方面的性能。利用基准数据集 MedReview，其中包含 8,161 对系统评价和摘要，我们微调了三个广泛使用的开源 LLM，即 PRIMERA、LongT5 和 Llama-2。总体而言，经过微调的 LLM 在 ROUGE-L 中增加了 9.89（95% 置信区间：8.94-10.81），在 METEOR 分数中增加了 13.21（95% 置信区间：12.05-14.37），在 CHRF 分数中增加了 15.82（95% 置信区间：13.89-16.44）。经过微调的 LongT5 的性能接近于零镜头设置下的 GPT-3.5。此外，较小的微调模型有时甚至表现出优于较大的零镜头模型的性能。上述改进趋势也体现在人类和 GPT4 模拟评估中。我们的结果可用于指导模型选择，以完成需要特定领域知识的任务，例如医学证据总结。", "author": "Gongbo Zhang et.al.", "authors": "Gongbo Zhang, Qiao Jin, Yiliang Zhou, Song Wang, Betina R. Idnay, Yiming Luo, Elizabeth Park, Jordan G. Nestor, Matthew E. Spotnitz, Ali Soroush, Thomas Campion, Zhiyong Lu, Chunhua Weng, Yifan Peng", "id": "2408.00588v1", "paper_url": "http://arxiv.org/abs/2408.00588v1", "repo": "null"}}