{"2410.13785": {"publish_time": "2024-10-17", "title": "PopAlign: Diversifying Contrasting Patterns for a More Comprehensive Alignment", "paper_summary": "Alignment of large language models (LLMs) involves training models on\npreference-contrastive output pairs to adjust their responses according to\nhuman preferences. To obtain such contrastive pairs, traditional methods like\nRLHF and RLAIF rely on limited contrasting patterns, such as varying model\nvariants or decoding temperatures. This singularity leads to two issues: (1)\nalignment is not comprehensive; and thereby (2) models are susceptible to\njailbreaking attacks. To address these issues, we investigate how to construct\nmore comprehensive and diversified contrasting patterns to enhance preference\ndata (RQ1) and verify the impact of the diversification of contrasting patterns\non model alignment (RQ2). For RQ1, we propose PopAlign, a framework that\nintegrates diversified contrasting patterns across the prompt, model, and\npipeline levels, introducing six contrasting strategies that do not require\nadditional feedback labeling procedures. Regarding RQ2, we conduct thorough\nexperiments demonstrating that PopAlign significantly outperforms existing\nmethods, leading to more comprehensive alignment.", "paper_summary_zh": "大型語言模型 (LLM) 的對齊涉及在偏好對比輸出對上訓練模型，以根據人類偏好調整其反應。為了獲得這種對比對，RLHF 和 RLAIF 等傳統方法依賴於有限的對比模式，例如改變模型變體或解碼溫度。這種單一性導致兩個問題：(1) 對齊不全面；因此 (2) 模型容易受到越獄攻擊。為了解決這些問題，我們研究如何構造更全面且多樣化的對比模式，以增強偏好數據 (RQ1) 並驗證對比模式的多樣化對模型對齊的影響 (RQ2)。對於 RQ1，我們提出 PopAlign，一個整合了提示、模型和管道層級中多樣化對比模式的框架，引入了六種對比策略，不需要額外的回饋標籤程序。關於 RQ2，我們進行了徹底的實驗，證明 PopAlign 明顯優於現有方法，從而實現更全面的對齊。", "author": "Zekun Moore Wang et.al.", "authors": "Zekun Moore Wang, Shawn Wang, Kang Zhu, Jiaheng Liu, Ke Xu, Jie Fu, Wangchunshu Zhou, Wenhao Huang", "id": "2410.13785v1", "paper_url": "http://arxiv.org/abs/2410.13785v1", "repo": "null"}}