{"2504.07459": {"publish_time": "2025-04-10", "title": "Beyond LLMs: A Linguistic Approach to Causal Graph Generation from Narrative Texts", "paper_summary": "We propose a novel framework for generating causal graphs from narrative\ntexts, bridging high-level causality and detailed event-specific relationships.\nOur method first extracts concise, agent-centered vertices using large language\nmodel (LLM)-based summarization. We introduce an \"Expert Index,\" comprising\nseven linguistically informed features, integrated into a\nSituation-Task-Action-Consequence (STAC) classification model. This hybrid\nsystem, combining RoBERTa embeddings with the Expert Index, achieves superior\nprecision in causal link identification compared to pure LLM-based approaches.\nFinally, a structured five-iteration prompting process refines and constructs\nconnected causal graphs. Experiments on 100 narrative chapters and short\nstories demonstrate that our approach consistently outperforms GPT-4o and\nClaude 3.5 in causal graph quality, while maintaining readability. The\nopen-source tool provides an interpretable, efficient solution for capturing\nnuanced causal chains in narratives.", "paper_summary_zh": "我們提出了一個從敘事文本生成因果圖的新穎框架，橋接了高層次的因果關係和詳細的事件特定關係。我們的方法首先使用基於大型語言模型 (LLM) 的摘要提取簡潔的、以主體為中心的頂點。我們引入了一個「專家索引」，它包含七個基於語言學的特徵，並整合到一個情境-任務-行動-結果 (STAC) 分類模型中。這個混合系統結合了 RoBERTa 嵌入和專家索引，與純粹基於 LLM 的方法相比，在因果鏈識別方面達到了更高的精度。最後，一個結構化的五次迭代提示過程改進並構建了連接的因果圖。在 100 個敘事章節和短篇故事上的實驗表明，我們的方法在因果圖質量方面始終優於 GPT-4o 和 Claude 3.5，同時保持了可讀性。這個開源工具提供了一個可解釋的、高效的解決方案，用於捕捉敘事中細微的因果鏈。\n", "author": "Zehan Li et.al.", "authors": "Zehan Li, Ruhua Pan, Xinyu Pi", "id": "2504.07459v1", "paper_url": "http://arxiv.org/abs/2504.07459v1", "repo": "null"}}