{"2408.06018": {"publish_time": "2024-08-12", "title": "Uncertainty-Informed Volume Visualization using Implicit Neural Representation", "paper_summary": "The increasing adoption of Deep Neural Networks (DNNs) has led to their\napplication in many challenging scientific visualization tasks. While advanced\nDNNs offer impressive generalization capabilities, understanding factors such\nas model prediction quality, robustness, and uncertainty is crucial. These\ninsights can enable domain scientists to make informed decisions about their\ndata. However, DNNs inherently lack ability to estimate prediction uncertainty,\nnecessitating new research to construct robust uncertainty-aware visualization\ntechniques tailored for various visualization tasks. In this work, we propose\nuncertainty-aware implicit neural representations to model scalar field data\nsets effectively and comprehensively study the efficacy and benefits of\nestimated uncertainty information for volume visualization tasks. We evaluate\nthe effectiveness of two principled deep uncertainty estimation techniques: (1)\nDeep Ensemble and (2) Monte Carlo Dropout (MCDropout). These techniques enable\nuncertainty-informed volume visualization in scalar field data sets. Our\nextensive exploration across multiple data sets demonstrates that\nuncertainty-aware models produce informative volume visualization results.\nMoreover, integrating prediction uncertainty enhances the trustworthiness of\nour DNN model, making it suitable for robustly analyzing and visualizing\nreal-world scientific volumetric data sets.", "paper_summary_zh": "深度神经网络 (DNN) 的采用率不断提高，已将其应用于许多具有挑战性的科学可视化任务中。虽然先进的 DNN 提供了令人印象深刻的泛化能力，但了解模型预测质量、鲁棒性和不确定性等因素至关重要。这些见解使领域科学家能够对其数据做出明智的决策。然而，DNN 本质上缺乏估计预测不确定性的能力，因此需要新的研究来构建针对各种可视化任务量身定制的鲁棒不确定性感知可视化技术。在这项工作中，我们提出了不确定性感知隐式神经表征，以有效地对标量场数据集进行建模，并全面研究估计不确定性信息对体积可视化任务的功效和益处。我们评估了两种基于原理的深度不确定性估计技术的有效性：(1) 深度集成和 (2) 蒙特卡罗丢弃法 (MCDropout)。这些技术支持标量场数据集中的不确定性感知体积可视化。我们对多个数据集的广泛探索表明，不确定性感知模型产生了信息丰富的体积可视化结果。此外，整合预测不确定性增强了我们 DNN 模型的可信度，使其适用于对现实世界的科学体积数据集进行稳健分析和可视化。", "author": "Shanu Saklani et.al.", "authors": "Shanu Saklani, Chitwan Goel, Shrey Bansal, Zhe Wang, Soumya Dutta, Tushar M. Athawale, David Pugmire, Christopher R. Johnson", "id": "2408.06018v1", "paper_url": "http://arxiv.org/abs/2408.06018v1", "repo": "null"}}