{"2410.17758": {"publish_time": "2024-10-23", "title": "Escaping the Forest: Sparse Interpretable Neural Networks for Tabular Data", "paper_summary": "Tabular datasets are widely used in scientific disciplines such as biology.\nWhile these disciplines have already adopted AI methods to enhance their\nfindings and analysis, they mainly use tree-based methods due to their\ninterpretability. At the same time, artificial neural networks have been shown\nto offer superior flexibility and depth for rich and complex non-tabular\nproblems, but they are falling behind tree-based models for tabular data in\nterms of performance and interpretability. Although sparsity has been shown to\nimprove the interpretability and performance of ANN models for complex\nnon-tabular datasets, enforcing sparsity structurally and formatively for\ntabular data before training the model, remains an open question. To address\nthis question, we establish a method that infuses sparsity in neural networks\nby utilising attention mechanisms to capture the features' importance in\ntabular datasets. We show that our models, Sparse TABular NET or sTAB-Net with\nattention mechanisms, are more effective than tree-based models, reaching the\nstate-of-the-art on biological datasets. They further permit the extraction of\ninsights from these datasets and achieve better performance than post-hoc\nmethods like SHAP.", "paper_summary_zh": "表格数据集广泛用于生物学等科学学科。\n虽然这些学科已经采用人工智能方法来增强其\n发现和分析，但由于其可解释性，它们主要使用基于树的方法。同时，人工神经网络已被证明\n为丰富而复杂的非表格问题提供了卓越的灵活性和深度，但它们在性能和可解释性方面落后于表格数据的基于树的模型。虽然稀疏性已被证明可以提高复杂\n非表格数据集的 ANN 模型的可解释性和性能，但在训练模型之前强制执行表格数据的结构性和形成性稀疏性，仍然是一个悬而未决的问题。为了解决\n这个问题，我们建立了一种通过利用注意力机制来捕获表格数据集中特征重要性的方法，从而在神经网络中注入稀疏性。我们表明，我们的模型，具有\n注意力机制的稀疏表格网络或 sTAB-Net，比基于树的模型更有效，在生物数据集上达到最先进的水平。它们进一步允许从这些数据集中提取见解，并且比事后\n方法（如 SHAP）获得更好的性能。", "author": "Salvatore Raieli et.al.", "authors": "Salvatore Raieli, Abdulrahman Altahhan, Nathalie Jeanray, Stéphane Gerart, Sebastien Vachenc", "id": "2410.17758v1", "paper_url": "http://arxiv.org/abs/2410.17758v1", "repo": "null"}}