{"2405.12705": {"publish_time": "2024-05-21", "title": "Multimodal Adaptive Inference for Document Image Classification with Anytime Early Exiting", "paper_summary": "This work addresses the need for a balanced approach between performance and\nefficiency in scalable production environments for visually-rich document\nunderstanding (VDU) tasks. Currently, there is a reliance on large document\nfoundation models that offer advanced capabilities but come with a heavy\ncomputational burden. In this paper, we propose a multimodal early exit (EE)\nmodel design that incorporates various training strategies, exit layer types\nand placements. Our goal is to achieve a Pareto-optimal balance between\npredictive performance and efficiency for multimodal document image\nclassification. Through a comprehensive set of experiments, we compare our\napproach with traditional exit policies and showcase an improved\nperformance-efficiency trade-off. Our multimodal EE design preserves the\nmodel's predictive capabilities, enhancing both speed and latency. This is\nachieved through a reduction of over 20% in latency, while fully retaining the\nbaseline accuracy. This research represents the first exploration of multimodal\nEE design within the VDU community, highlighting as well the effectiveness of\ncalibration in improving confidence scores for exiting at different layers.\nOverall, our findings contribute to practical VDU applications by enhancing\nboth performance and efficiency.", "paper_summary_zh": "這項工作探討了在視覺豐富文件理解 (VDU) 任務的可擴充生產環境中，在效能和效率之間取得平衡方法的必要性。目前，我們依賴於大型文件基礎模型，這些模型提供進階功能，但伴隨著繁重的運算負擔。在本文中，我們提出多模態早期退出 (EE) 模型設計，它結合了各種訓練策略、退出層類型和配置。我們的目標是針對多模態文件影像分類，在預測效能和效率之間取得帕雷托最優平衡。透過一組全面的實驗，我們將我們的方法與傳統退出政策進行比較，並展示出改良的效能效率權衡。我們的多模態 EE 設計保留了模型的預測能力，同時提升了速度和延遲。這是透過減少超過 20% 的延遲來實現的，同時完全保留基準準確度。這項研究代表了 VDU 社群中首次探討多模態 EE 設計，同時強調了校正對於改進在不同層退出時的信心分數的有效性。總體而言，我們的發現透過提升效能和效率，為實際的 VDU 應用做出了貢獻。", "author": "Omar Hamed et.al.", "authors": "Omar Hamed, Souhail Bakkali, Marie-Francine Moens, Matthew Blaschko, Jordy Van Landeghem", "id": "2405.12705v1", "paper_url": "http://arxiv.org/abs/2405.12705v1", "repo": "null"}}