{"2405.05741": {"publish_time": "2024-05-09", "title": "Can large language models understand uncommon meanings of common words?", "paper_summary": "Large language models (LLMs) like ChatGPT have shown significant advancements\nacross diverse natural language understanding (NLU) tasks, including\nintelligent dialogue and autonomous agents. Yet, lacking widely acknowledged\ntesting mechanisms, answering `whether LLMs are stochastic parrots or genuinely\ncomprehend the world' remains unclear, fostering numerous studies and sparking\nheated debates. Prevailing research mainly focuses on surface-level NLU,\nneglecting fine-grained explorations. However, such explorations are crucial\nfor understanding their unique comprehension mechanisms, aligning with human\ncognition, and finally enhancing LLMs' general NLU capacities. To address this\ngap, our study delves into LLMs' nuanced semantic comprehension capabilities,\nparticularly regarding common words with uncommon meanings. The idea stems from\nfoundational principles of human communication within psychology, which\nunderscore accurate shared understandings of word semantics. Specifically, this\npaper presents the innovative construction of a Lexical Semantic Comprehension\n(LeSC) dataset with novel evaluation metrics, the first benchmark encompassing\nboth fine-grained and cross-lingual dimensions. Introducing models of both\nopen-source and closed-source, varied scales and architectures, our extensive\nempirical experiments demonstrate the inferior performance of existing models\nin this basic lexical-meaning understanding task. Notably, even the\nstate-of-the-art LLMs GPT-4 and GPT-3.5 lag behind 16-year-old humans by 3.9%\nand 22.3%, respectively. Additionally, multiple advanced prompting techniques\nand retrieval-augmented generation are also introduced to help alleviate this\ntrouble, yet limitations persist. By highlighting the above critical\nshortcomings, this research motivates further investigation and offers novel\ninsights for developing more intelligent LLMs.", "paper_summary_zh": "大型語言模型 (LLM)，例如 ChatGPT，在各種自然語言理解 (NLU) 任務中已展現出顯著的進展，包括智能對話和自主代理。然而，由於缺乏廣泛認可的測試機制，回答「LLM 是隨機鸚鵡還是真正理解世界」的問題仍然不明確，這也促成了許多研究和引發激烈的辯論。現行的研究主要關注於表面層的 NLU，忽略了細緻的探討。然而，此類探討對於理解其獨特的理解機制、與人類認知保持一致，並最終增強 LLM 的一般 NLU 能力至關重要。為了解決這個差距，我們的研究深入探討了 LLM 的細微語義理解能力，特別是關於具有不尋常含義的常見詞彙。這個想法源自心理學中人類溝通的基本原理，它強調準確共享對詞彙語義的理解。具體來說，本文提出了創新的詞彙語義理解 (LeSC) 資料集建構，並採用新穎的評估指標，這是第一個涵蓋細緻和跨語言維度的基準。透過引入開源和閉源、不同規模和架構的模型，我們的廣泛實證實驗證明了現有模型在這個基本的詞彙含義理解任務中的表現較差。值得注意的是，即使是現今最先進的 LLM GPT-4 和 GPT-3.5 也分別落後於 16 歲的人類 3.9% 和 22.3%。此外，也引入了多種進階提示技術和檢索增強生成，以幫助緩解這個問題，但限制仍然存在。透過強調上述關鍵缺點，本研究激勵了進一步的調查，並為開發更智能的 LLM 提供了新穎的見解。", "author": "Jinyang Wu et.al.", "authors": "Jinyang Wu, Feihu Che, Xinxin Zheng, Shuai Zhang, Ruihan Jin, Shuai Nie, Pengpeng Shao, Jianhua Tao", "id": "2405.05741v1", "paper_url": "http://arxiv.org/abs/2405.05741v1", "repo": "null"}}