{"2410.03595": {"publish_time": "2024-10-04", "title": "Understanding Reasoning in Chain-of-Thought from the Hopfieldian View", "paper_summary": "Large Language Models have demonstrated remarkable abilities across various\ntasks, with Chain-of-Thought (CoT) prompting emerging as a key technique to\nenhance reasoning capabilities. However, existing research primarily focuses on\nimproving performance, lacking a comprehensive framework to explain and\nunderstand the fundamental factors behind CoT's success. To bridge this gap, we\nintroduce a novel perspective grounded in the Hopfieldian view of cognition in\ncognitive neuroscience. We establish a connection between CoT reasoning and key\ncognitive elements such as stimuli, actions, neural populations, and\nrepresentation spaces. From our view, we can understand the reasoning process\nas the movement between these representation spaces. Building on this insight,\nwe develop a method for localizing reasoning errors in the response of CoTs.\nMoreover, we propose the Representation-of-Thought (RoT) framework, which\nleverages the robustness of low-dimensional representation spaces to enhance\nthe robustness of the reasoning process in CoTs. Experimental results\ndemonstrate that RoT improves the robustness and interpretability of CoT\nreasoning while offering fine-grained control over the reasoning process.", "paper_summary_zh": "大型語言模型已在各種任務中展現出非凡的能力，其中以思想鏈 (CoT) 提示作為增強推理能力的一項關鍵技術而備受矚目。然而，現有研究主要專注於提升效能，卻缺乏一個全面的架構來解釋和理解 CoT 成功背後的基本因素。為了填補這個鴻溝，我們引進一個新的觀點，它奠基於認知神經科學中霍普菲爾德認知觀點。我們建立了 CoT 推理與關鍵認知元素（例如刺激、動作、神經元族群和表徵空間）之間的聯繫。從我們的觀點來看，我們可以將推理過程理解為在這些表徵空間之間的移動。根據這個見解，我們開發了一種方法來定位 CoT 回應中的推理錯誤。此外，我們提出了思想表徵 (RoT) 架構，它利用低維表徵空間的穩健性來增強 CoT 中推理過程的穩健性。實驗結果表明，RoT 改善了 CoT 推理的穩健性和可解釋性，同時對推理過程提供了細緻的控制。", "author": "Lijie Hu et.al.", "authors": "Lijie Hu, Liang Liu, Shu Yang, Xin Chen, Zhen Tan, Muhammad Asif Ali, Mengdi Li, Di Wang", "id": "2410.03595v1", "paper_url": "http://arxiv.org/abs/2410.03595v1", "repo": "null"}}