{"2409.03708": {"publish_time": "2024-09-05", "title": "RAG based Question-Answering for Contextual Response Prediction System", "paper_summary": "Large Language Models (LLMs) have shown versatility in various Natural\nLanguage Processing (NLP) tasks, including their potential as effective\nquestion-answering systems. However, to provide precise and relevant\ninformation in response to specific customer queries in industry settings, LLMs\nrequire access to a comprehensive knowledge base to avoid hallucinations.\nRetrieval Augmented Generation (RAG) emerges as a promising technique to\naddress this challenge. Yet, developing an accurate question-answering\nframework for real-world applications using RAG entails several challenges: 1)\ndata availability issues, 2) evaluating the quality of generated content, and\n3) the costly nature of human evaluation. In this paper, we introduce an\nend-to-end framework that employs LLMs with RAG capabilities for industry use\ncases. Given a customer query, the proposed system retrieves relevant knowledge\ndocuments and leverages them, along with previous chat history, to generate\nresponse suggestions for customer service agents in the contact centers of a\nmajor retail company. Through comprehensive automated and human evaluations, we\nshow that this solution outperforms the current BERT-based algorithms in\naccuracy and relevance. Our findings suggest that RAG-based LLMs can be an\nexcellent support to human customer service representatives by lightening their\nworkload.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種自然語言處理 (NLP) 任務中展現其多功能性，包括其作為有效問答系統的潛力。然而，要在產業環境中針對特定客戶查詢提供精確且相關的資訊，LLM 需要存取全面的知識庫，以避免產生幻覺。檢索擴充生成 (RAG) 浮現為解決此挑戰的一項有前途的技術。然而，使用 RAG 為真實世界應用開發準確的問答架構會帶來多項挑戰：1) 資料可用性問題、2) 評估生成內容的品質，以及 3) 人工評估的昂貴性質。在本文中，我們介紹了一個端到端架構，它採用具備 RAG 功能的 LLM，以適用於產業用例。針對客戶查詢，所提出的系統會檢索相關的知識文件，並利用這些文件以及先前的聊天記錄，為大型零售公司的聯絡中心中的客戶服務代理產生回應建議。透過全面的自動化和人工評估，我們證明此解決方案在準確性和相關性方面優於目前的 BERT-based 演算法。我們的研究結果顯示，基於 RAG 的 LLM 可以透過減輕人類客服人員的工作負擔，成為其絕佳的支援。", "author": "Sriram Veturi et.al.", "authors": "Sriram Veturi, Saurabh Vaichal, Reshma Lal Jagadheesh, Nafis Irtiza Tripto, Nian Yan", "id": "2409.03708v2", "paper_url": "http://arxiv.org/abs/2409.03708v2", "repo": "null"}}