{"2409.04388": {"publish_time": "2024-09-06", "title": "Question-Answering Dense Video Events", "paper_summary": "Multimodal Large Language Models (MLLMs) have shown excellent performance in\nquestion-answering of single-event videos. In this paper, we present\nquestion-answering dense video events, a novel task that requires answering and\ngrounding the dense-event questions in long videos, thus challenging MLLMs to\nfaithfully comprehend and reason about multiple events occurring over extended\ntime periods. To facilitate the study, we construct DeVE-QA - a dataset\nfeaturing 78K questions about 26K events on 10.6K long videos. We then\nbenchmark and show that existing MLLMs excelling at single-event QA struggle to\nperform well in DeVE-QA. For improvement, we propose DeVi, a novel\ntraining-free MLLM approach that highlights a hierarchical captioning module, a\ntemporal event memory module, and a self-consistency checking module to\nrespectively detect, contextualize and memorize, and ground dense-events in\nlong videos for question answering. Extensive experiments show that DeVi is\nsuperior at answering dense-event questions and grounding relevant video\nmoments. Compared with existing MLLMs, it achieves a remarkable increase of 4.1\npercent and 3.7 percent for G(round)QA accuracy on DeVE-QA and NExT-GQA\nrespectively.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 在单事件视频的问答中表现出色。本文中，我们提出了问答密集视频事件，这是一个需要回答和依据长视频中的密集事件问题的新任务，从而挑战 MLLM 忠实地理解和推理在延长时间段内发生的多个事件。为了促进研究，我们构建了 DeVE-QA - 一个数据集，其中包含有关 10.6K 长视频中 26K 个事件的 78K 个问题。然后，我们对现有的 MLLM 进行了基准测试，并表明在单事件问答中表现出色的 MLLM 在 DeVE-QA 中难以表现良好。为了改进，我们提出了 DeVi，这是一种新颖的无训练 MLLM 方法，它突出显示了一个分层字幕模块、一个时间事件记忆模块和一个自一致性检查模块，分别用于检测、语境化和记忆，以及在长视频中依据密集事件进行问答。大量实验表明，DeVi 在回答密集事件问题和依据相关视频时刻方面表现出色。与现有的 MLLM 相比，它在 DeVE-QA 和 NExT-GQA 上的 G(round)QA 准确率分别显着提高了 4.1 个百分点和 3.7 个百分点。", "author": "Hangyu Qin et.al.", "authors": "Hangyu Qin, Junbin Xiao, Angela Yao", "id": "2409.04388v1", "paper_url": "http://arxiv.org/abs/2409.04388v1", "repo": "null"}}