{"2408.04519": {"publish_time": "2024-08-08", "title": "Articulatory Configurations across Genders and Periods in French Radio and TV archives", "paper_summary": "This paper studies changes in articulatory configurations across genders and\nperiods using an inversion from acoustic to articulatory parameters. From a\ndiachronic corpus based on French media archives spanning 60 years from 1955 to\n2015, automatic transcription and forced alignment allowed extracting the\ncentral frame of each vowel. More than one million frames were obtained from\nover a thousand speakers across gender and age categories. Their formants were\nused from these vocalic frames to fit the parameters of Maeda's articulatory\nmodel. Evaluations of the quality of these processes are provided. We focus\nhere on two parameters of Maeda's model linked to total vocal tract length: the\nrelative position of the larynx (higher for females) and the lips protrusion\n(more protruded for males). Implications for voice quality across genders are\ndiscussed. The effect across periods seems gender independent; thus, the\nassertion that females lowered their pitch with time is not supported.", "paper_summary_zh": "本文使用從聲學到語音參數的反演研究了跨性別和時期的語音配置變化。從一個基於法語媒體檔案的歷時語料庫，跨越 1955 年至 2015 年的 60 年，自動轉錄和強制對齊允許提取每個元音的中心幀。從跨性別和年齡類別的 1000 多名說話者中獲得了超過一百萬個幀。從這些元音幀中使用它們的共振峰來擬合 Maeda 語音模型的參數。提供了這些過程質量的評估。我們這裡重點關注與總聲道長度相關的 Maeda 模型的兩個參數：喉頭的相對位置（女性較高）和嘴唇突出（男性較突出）。討論了跨性別的聲音品質的影響。跨時期的影響似乎與性別無關；因此，女性隨著時間降低音高的說法得不到支持。", "author": "Benjamin Elie et.al.", "authors": "Benjamin Elie, David Doukhan, Rémi Uro, Lucas Ondel-Yang, Albert Rilliard, Simon Devauchelle", "id": "2408.04519v1", "paper_url": "http://arxiv.org/abs/2408.04519v1", "repo": "null"}}