{"2405.09597": {"publish_time": "2024-05-15", "title": "When AI Eats Itself: On the Caveats of Data Pollution in the Era of Generative AI", "paper_summary": "Generative artificial intelligence (AI) technologies and large models are\nproducing realistic outputs across various domains, such as images, text,\nspeech, and music. Creating these advanced generative models requires\nsignificant resources, particularly large and high-quality datasets. To\nminimize training expenses, many algorithm developers use data created by the\nmodels themselves as a cost-effective training solution. However, not all\nsynthetic data effectively improve model performance, necessitating a strategic\nbalance in the use of real versus synthetic data to optimize outcomes.\n  Currently, the previously well-controlled integration of real and synthetic\ndata is becoming uncontrollable. The widespread and unregulated dissemination\nof synthetic data online leads to the contamination of datasets traditionally\ncompiled through web scraping, now mixed with unlabeled synthetic data. This\ntrend portends a future where generative AI systems may increasingly rely\nblindly on consuming self-generated data, raising concerns about model\nperformance and ethical issues. What will happen if generative AI continuously\nconsumes itself without discernment? What measures can we take to mitigate the\npotential adverse effects?\n  There is a significant gap in the scientific literature regarding the impact\nof synthetic data use in generative AI, particularly in terms of the fusion of\nmultimodal information. To address this research gap, this review investigates\nthe consequences of integrating synthetic data blindly on training generative\nAI on both image and text modalities and explores strategies to mitigate these\neffects. The goal is to offer a comprehensive view of synthetic data's role,\nadvocating for a balanced approach to its use and exploring practices that\npromote the sustainable development of generative AI technologies in the era of\nlarge models.", "paper_summary_zh": "生成式人工智能 (AI) 技術和大模型正在各種領域產生逼真的輸出，例如圖像、文字、語音和音樂。建立這些先進的生成式模型需要大量的資源，尤其是龐大且高品質的資料集。為了將訓練費用降到最低，許多演算法開發人員使用模型本身建立的資料作為經濟實惠的訓練解決方案。然而，並非所有合成資料都能有效提升模型效能，這使得在使用真實資料和合成資料之間取得策略性平衡以最佳化結果變得非常必要。\n目前，先前控制良好的真實資料和合成資料整合正變得難以控制。合成資料在網路上廣泛且不受規範地散布，導致傳統上透過網路擷取編譯的資料集遭到污染，現在與未標記的合成資料混在一起。這個趨勢預示著一個未來，生成式 AI 系統可能會越來越依賴盲目消耗自我產生的資料，這引發了對模型效能和道德問題的擔憂。如果生成式 AI 持續不斷地不加辨別地消耗自己，會發生什麼事？我們可以採取哪些措施來減輕潛在的不利影響？\n在科學文獻中，關於合成資料在生成式 AI 中使用的影響存在顯著的差距，特別是在多模態資訊的融合方面。為了填補這個研究空白，本篇評論探討了盲目整合合成資料對訓練生成式 AI 在圖像和文字模態上的後果，並探討了減輕這些影響的策略。目標是提供合成資料角色的全面觀點，提倡對其使用採取平衡的方法，並探討在大型模型時代促進生成式 AI 技術永續發展的做法。", "author": "Xiaodan Xing et.al.", "authors": "Xiaodan Xing, Fadong Shi, Jiahao Huang, Yinzhe Wu, Yang Nan, Sheng Zhang, Yingying Fang, Mike Roberts, Carola-Bibiane Schönlieb, Javier Del Ser, Guang Yang", "id": "2405.09597v1", "paper_url": "http://arxiv.org/abs/2405.09597v1", "repo": "null"}}