{"2412.13949": {"publish_time": "2024-12-18", "title": "Cracking the Code of Hallucination in LVLMs with Vision-aware Head Divergence", "paper_summary": "Large vision-language models (LVLMs) have made substantial progress in\nintegrating large language models (LLMs) with visual inputs, enabling advanced\nmultimodal reasoning. Despite their success, a persistent challenge is\nhallucination-where generated text fails to accurately reflect visual\ncontent-undermining both accuracy and reliability. Existing methods focus on\nalignment training or decoding refinements but primarily address symptoms at\nthe generation stage without probing the underlying causes. In this work, we\ninvestigate the internal mechanisms driving hallucination in LVLMs, with an\nemphasis on the multi-head attention module. Specifically, we introduce\nVision-aware Head Divergence (VHD), a metric that quantifies the sensitivity of\nattention head outputs to visual context. Based on this, our findings reveal\nthe presence of vision-aware attention heads that are more attuned to visual\ninformation; however, the model's overreliance on its prior language patterns\nis closely related to hallucinations. Building on these insights, we propose\nVision-aware Head Reinforcement (VHR), a training-free approach to mitigate\nhallucination by enhancing the role of vision-aware attention heads. Extensive\nexperiments demonstrate that our method achieves superior performance compared\nto state-of-the-art approaches in mitigating hallucinations, while maintaining\nhigh efficiency with negligible additional time overhead.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 在將大型語言模型 (LLMs) 與視覺輸入整合方面取得了實質性進展，實現了先進的多模態推理。儘管它們取得了成功，但持續的挑戰在於幻覺，其中產生的文字無法準確反映視覺內容，從而損害了準確性和可靠性。現有方法專注於對齊訓練或解碼優化，但主要解決產生階段的症狀，而沒有探究根本原因。在這項工作中，我們研究了驅動 LVLMs 中幻覺的內部機制，重點關注多頭注意模組。具體來說，我們引入了視覺感知頭部差異 (VHD)，這是一個量化注意頭部輸出對視覺環境敏感性的指標。基於此，我們的研究結果揭示了存在視覺感知注意頭部，它們更適應視覺資訊；然而，模型過度依賴其先前的語言模式與幻覺密切相關。根據這些見解，我們提出了視覺感知頭部強化 (VHR)，這是一種無需訓練的方法，通過增強視覺感知注意頭部的作用來減輕幻覺。大量的實驗證明，與減輕幻覺的最新方法相比，我們的模型取得了卓越的效能，同時保持高效率，且幾乎沒有額外的時間開銷。", "author": "Jinghan He et.al.", "authors": "Jinghan He, Kuan Zhu, Haiyun Guo, Junfeng Fang, Zhenglin Hua, Yuheng Jia, Ming Tang, Tat-Seng Chua, Jinqiao Wang", "id": "2412.13949v1", "paper_url": "http://arxiv.org/abs/2412.13949v1", "repo": "null"}}