{"2411.18620": {"publish_time": "2024-11-27", "title": "Cross-modal Information Flow in Multimodal Large Language Models", "paper_summary": "The recent advancements in auto-regressive multimodal large language models\n(MLLMs) have demonstrated promising progress for vision-language tasks. While\nthere exists a variety of studies investigating the processing of linguistic\ninformation within large language models, little is currently known about the\ninner working mechanism of MLLMs and how linguistic and visual information\ninteract within these models. In this study, we aim to fill this gap by\nexamining the information flow between different modalities -- language and\nvision -- in MLLMs, focusing on visual question answering. Specifically, given\nan image-question pair as input, we investigate where in the model and how the\nvisual and linguistic information are combined to generate the final\nprediction. Conducting experiments with a series of models from the LLaVA\nseries, we find that there are two distinct stages in the process of\nintegration of the two modalities. In the lower layers, the model first\ntransfers the more general visual features of the whole image into the\nrepresentations of (linguistic) question tokens. In the middle layers, it once\nagain transfers visual information about specific objects relevant to the\nquestion to the respective token positions of the question. Finally, in the\nhigher layers, the resulting multimodal representation is propagated to the\nlast position of the input sequence for the final prediction. Overall, our\nfindings provide a new and comprehensive perspective on the spatial and\nfunctional aspects of image and language processing in the MLLMs, thereby\nfacilitating future research into multimodal information localization and\nediting.", "paper_summary_zh": "最近在自動回歸多模態大型語言模型 (MLLM) 方面的進展，已證明在視覺語言任務中具有前景。雖然有許多研究探討大型語言模型中語言資訊的處理方式，但目前鮮少人知道 MLLM 的內部運作機制，以及語言和視覺資訊如何在這些模型中互動。在這項研究中，我們旨在透過探討 MLLM 中不同模態（語言和視覺）之間的資訊流，來填補這項空白，並專注於視覺問題解答。具體來說，給定一對影像問題作為輸入，我們探討模型中的何處以及視覺和語言資訊如何結合以產生最終預測。透過使用 LLaVA 系列的一系列模型進行實驗，我們發現整合這兩個模態的過程中存在兩個不同的階段。在較低層，模型首先將整個影像的更一般視覺特徵轉移到（語言）問題標記的表徵中。在中間層，它再次將與問題相關的特定物件的視覺資訊轉移到問題的各個標記位置。最後，在較高層，將產生的多模態表徵傳播到輸入序列的最後一個位置，以進行最終預測。總體而言，我們的研究結果為 MLLM 中影像和語言處理的空間和功能面向提供了新的全面觀點，從而促進了未來對多模態資訊定位和編輯的研究。", "author": "Zhi Zhang et.al.", "authors": "Zhi Zhang, Srishti Yadav, Fengze Han, Ekaterina Shutova", "id": "2411.18620v1", "paper_url": "http://arxiv.org/abs/2411.18620v1", "repo": "null"}}