{"2411.13979": {"publish_time": "2024-11-21", "title": "FedRAV: Hierarchically Federated Region-Learning for Traffic Object Classification of Autonomous Vehicles", "paper_summary": "The emerging federated learning enables distributed autonomous vehicles to\ntrain equipped deep learning models collaboratively without exposing their raw\ndata, providing great potential for utilizing explosively growing autonomous\ndriving data. However, considering the complicated traffic environments and\ndriving scenarios, deploying federated learning for autonomous vehicles is\ninevitably challenged by non-independent and identically distributed (Non-IID)\ndata of vehicles, which may lead to failed convergence and low training\naccuracy. In this paper, we propose a novel hierarchically Federated\nRegion-learning framework of Autonomous Vehicles (FedRAV), a two-stage\nframework, which adaptively divides a large area containing vehicles into\nsub-regions based on the defined region-wise distance, and achieves\npersonalized vehicular models and regional models. This approach ensures that\nthe personalized vehicular model adopts the beneficial models while discarding\nthe unprofitable ones. We validate our FedRAV framework against existing\nfederated learning algorithms on three real-world autonomous driving datasets\nin various heterogeneous settings. The experiment results demonstrate that our\nframework outperforms those known algorithms, and improves the accuracy by at\nleast 3.69%. The source code of FedRAV is available at:\nhttps://github.com/yjzhai-cs/FedRAV.", "paper_summary_zh": "新興的聯邦學習使分散的自動駕駛車輛能夠在不公開其原始數據的情況下協作訓練配備的深度學習模型，為利用爆炸性增長的自動駕駛數據提供了巨大的潛力。然而，考慮到複雜的交通環境和駕駛場景，為自動駕駛車輛部署聯邦學習不可避免地會受到車輛的非獨立同分布 (Non-IID) 數據的挑戰，這可能導致收斂失敗和訓練精度低。在本文中，我們提出了一個新穎的分層聯邦區域學習自動駕駛車輛框架 (FedRAV)，這是一個兩階段框架，它根據定義的區域距離自適應地將包含車輛的大區域劃分為子區域，並實現個性化車輛模型和區域模型。此方法確保個性化車輛模型採用有益模型，同時捨棄無利可圖的模型。我們在各種異構設置下的三個真實世界自動駕駛數據集上驗證了我們的 FedRAV 框架與現有的聯邦學習演算法。實驗結果表明，我們的框架優於那些已知的演算法，並將準確度提高了至少 3.69%。FedRAV 的原始碼可在以下位置取得：\nhttps://github.com/yjzhai-cs/FedRAV。", "author": "Yijun Zhai et.al.", "authors": "Yijun Zhai, Pengzhan Zhou, Yuepeng He, Fang Qu, Zhida Qin, Xianlong Jiao, Guiyan Liu, Songtao Guo", "id": "2411.13979v1", "paper_url": "http://arxiv.org/abs/2411.13979v1", "repo": "https://github.com/yjzhai-cs/fedrav"}}