{"2502.02893": {"publish_time": "2025-02-05", "title": "Lowering the Barrier of Machine Learning: Achieving Zero Manual Labeling in Review Classification Using LLMs", "paper_summary": "With the internet's evolution, consumers increasingly rely on online reviews\nfor service or product choices, necessitating that businesses analyze extensive\ncustomer feedback to enhance their offerings. While machine learning-based\nsentiment classification shows promise in this realm, its technical complexity\noften bars small businesses and individuals from leveraging such advancements,\nwhich may end up making the competitive gap between small and large businesses\neven bigger in terms of improving customer satisfaction. This paper introduces\nan approach that integrates large language models (LLMs), specifically\nGenerative Pre-trained Transformer (GPT) and Bidirectional Encoder\nRepresentations from Transformers (BERT)-based models, making it accessible to\na wider audience. Our experiments across various datasets confirm that our\napproach retains high classification accuracy without the need for manual\nlabeling, expert knowledge in tuning and data annotation, or substantial\ncomputational power. By significantly lowering the barriers to applying\nsentiment classification techniques, our methodology enhances competitiveness\nand paves the way for making machine learning technology accessible to a\nbroader audience.", "paper_summary_zh": "隨著網路的發展，消費者越來越依賴線上評論來選擇服務或產品，這使得企業必須分析大量的客戶回饋以提升他們的產品。儘管基於機器學習的情緒分類在這個領域中展現出前景，其技術複雜性常常阻礙小企業和個人利用這些進展，這可能會讓小企業和大企業在提升客戶滿意度方面的競爭差距變得更大。本文介紹了一種整合大型語言模型（LLM）的方法，特別是生成式預訓練轉換器（GPT）和基於轉換器的雙向編碼器表示（BERT）模型，使其可以讓更廣泛的受眾使用。我們在各種資料集上的實驗證實，我們的做法在無需手動標記、調整和資料標註的專業知識或大量的運算能力下，仍能保持高度的分類準確性。透過大幅降低應用情緒分類技術的障礙，我們的做法提升了競爭力，並為讓更廣泛的受眾能夠使用機器學習技術鋪路。", "author": "Yejian Zhang et.al.", "authors": "Yejian Zhang, Shingo Takada", "id": "2502.02893v1", "paper_url": "http://arxiv.org/abs/2502.02893v1", "repo": "null"}}