{"2406.16641": {"publish_time": "2024-06-24", "title": "Vision-Language Consistency Guided Multi-modal Prompt Learning for Blind AI Generated Image Quality Assessment", "paper_summary": "Recently, textual prompt tuning has shown inspirational performance in\nadapting Contrastive Language-Image Pre-training (CLIP) models to natural image\nquality assessment. However, such uni-modal prompt learning method only tunes\nthe language branch of CLIP models. This is not enough for adapting CLIP models\nto AI generated image quality assessment (AGIQA) since AGIs visually differ\nfrom natural images. In addition, the consistency between AGIs and user input\ntext prompts, which correlates with the perceptual quality of AGIs, is not\ninvestigated to guide AGIQA. In this letter, we propose vision-language\nconsistency guided multi-modal prompt learning for blind AGIQA, dubbed\nCLIP-AGIQA. Specifically, we introduce learnable textual and visual prompts in\nlanguage and vision branches of CLIP models, respectively. Moreover, we design\na text-to-image alignment quality prediction task, whose learned\nvision-language consistency knowledge is used to guide the optimization of the\nabove multi-modal prompts. Experimental results on two public AGIQA datasets\ndemonstrate that the proposed method outperforms state-of-the-art quality\nassessment models. The source code is available at\nhttps://github.com/JunFu1995/CLIP-AGIQA.", "paper_summary_zh": "<paragraph>最近，文本提示调整在适应对比语言图像预训练 (CLIP) 模型到自然图像质量评估方面显示出鼓舞人心的表现。然而，这种单模态提示学习方法只调整了 CLIP 模型的语言分支。这不足以适应 CLIP 模型到 AI 生成的图像质量评估 (AGIQA)，因为 AGI 在视觉上不同于自然图像。此外，AGI 与用户输入文本提示之间的一致性（与 AGI 的感知质量相关）尚未被调查以指导 AGIQA。在这封信中，我们提出了视觉语言一致性指导的多模态提示学习用于盲 AGIQA，称为 CLIP-AGIQA。具体来说，我们在 CLIP 模型的语言和视觉分支中分别引入了可学习的文本和视觉提示。此外，我们设计了一个文本到图像对齐质量预测任务，其学习的视觉语言一致性知识用于指导上述多模态提示的优化。在两个公共 AGIQA 数据集上的实验结果表明，所提出的方法优于最先进的质量评估模型。源代码可在 https://github.com/JunFu1995/CLIP-AGIQA 获得。</paragraph>", "author": "Jun Fu et.al.", "authors": "Jun Fu, Wei Zhou, Qiuping Jiang, Hantao Liu, Guangtao Zhai", "id": "2406.16641v1", "paper_url": "http://arxiv.org/abs/2406.16641v1", "repo": "null"}}