{"2405.06634": {"publish_time": "2024-05-10", "title": "Multimodal LLMs Struggle with Basic Visual Network Analysis: a VNA Benchmark", "paper_summary": "We evaluate the zero-shot ability of GPT-4 and LLaVa to perform simple Visual\nNetwork Analysis (VNA) tasks on small-scale graphs. We evaluate the Vision\nLanguage Models (VLMs) on 5 tasks related to three foundational network science\nconcepts: identifying nodes of maximal degree on a rendered graph, identifying\nwhether signed triads are balanced or unbalanced, and counting components. The\ntasks are structured to be easy for a human who understands the underlying\ngraph theoretic concepts, and can all be solved by counting the appropriate\nelements in graphs. We find that while GPT-4 consistently outperforms LLaVa,\nboth models struggle with every visual network analysis task we propose. We\npublicly release the first benchmark for the evaluation of VLMs on foundational\nVNA tasks.", "paper_summary_zh": "我們評估 GPT-4 和 LLaVa 在小規模圖形上執行簡單的視覺網路分析 (VNA) 任務的零次學習能力。我們針對三個基礎網路科學概念的 5 個任務評估視覺語言模型 (VLM)：識別渲染圖形上最大程度的節點、識別帶正負號的三元組是平衡還是不平衡，以及計算組成部分。這些任務的結構對於理解基礎圖形理論概念的人類來說很容易，並且都可以透過計算圖形中的適當元素來解決。我們發現，儘管 GPT-4 持續優於 LLaVa，但這兩個模型在我們提出的每個視覺網路分析任務中都面臨困難。我們公開發布了第一個用於評估 VLM 在基礎 VNA 任務上的基準。", "author": "Evan M. Williams et.al.", "authors": "Evan M. Williams, Kathleen M. Carley", "id": "2405.06634v2", "paper_url": "http://arxiv.org/abs/2405.06634v2", "repo": "https://github.com/evanup/vna_benchmark"}}