{"2502.04263": {"publish_time": "2025-02-06", "title": "Cross the Gap: Exposing the Intra-modal Misalignment in CLIP via Modality Inversion", "paper_summary": "Pre-trained multi-modal Vision-Language Models like CLIP are widely used\noff-the-shelf for a variety of applications. In this paper, we show that the\ncommon practice of individually exploiting the text or image encoders of these\npowerful multi-modal models is highly suboptimal for intra-modal tasks like\nimage-to-image retrieval. We argue that this is inherently due to the\nCLIP-style inter-modal contrastive loss that does not enforce any intra-modal\nconstraints, leading to what we call intra-modal misalignment. To demonstrate\nthis, we leverage two optimization-based modality inversion techniques that map\nrepresentations from their input modality to the complementary one without any\nneed for auxiliary data or additional trained adapters. We empirically show\nthat, in the intra-modal tasks of image-to-image and text-to-text retrieval,\napproaching these tasks inter-modally significantly improves performance with\nrespect to intra-modal baselines on more than fifteen datasets. Additionally,\nwe demonstrate that approaching a native inter-modal task (e.g. zero-shot image\nclassification) intra-modally decreases performance, further validating our\nfindings. Finally, we show that incorporating an intra-modal term in the\npre-training objective or narrowing the modality gap between the text and image\nfeature embedding spaces helps reduce the intra-modal misalignment. The code is\npublicly available at: https://github.com/miccunifi/Cross-the-Gap.", "paper_summary_zh": "預訓練的多模態視覺語言模型，例如 CLIP，廣泛用於各種應用程式中。在本文中，我們展示了單獨利用這些強大多模態模型的文字或影像編碼器的常見做法，對於影像到影像擷取等模態內任務而言，是非常次佳的。我們認為這本質上是基於 CLIP 風格的模態間對比損失所致，它不會強制執行任何模態內約束，導致我們稱之為模態內錯位。為了證明這一點，我們利用了兩種基於最佳化的模態反轉技術，這些技術將表示從其輸入模態映射到互補模態，而無需任何輔助資料或額外訓練的適配器。我們憑經驗表明，在影像到影像和文字到文字擷取的模態內任務中，以模態間方式處理這些任務會顯著改善在超過 15 個資料集上的模態內基準的效能。此外，我們證明以模態內方式處理原生模態間任務（例如零次學習影像分類）會降低效能，這進一步驗證了我們的發現。最後，我們表明在預訓練目標中納入模態內術語或縮小文字和影像特徵嵌入空間之間的模態差距有助於減少模態內錯位。程式碼公開於：https://github.com/miccunifi/Cross-the-Gap。", "author": "Marco Mistretta et.al.", "authors": "Marco Mistretta, Alberto Baldrati, Lorenzo Agnolucci, Marco Bertini, Andrew D. Bagdanov", "id": "2502.04263v1", "paper_url": "http://arxiv.org/abs/2502.04263v1", "repo": "null"}}