{"2410.21275": {"publish_time": "2024-10-28", "title": "Enhancing Action Recognition by Leveraging the Hierarchical Structure of Actions and Textual Context", "paper_summary": "The sequential execution of actions and their hierarchical structure\nconsisting of different levels of abstraction, provide features that remain\nunexplored in the task of action recognition. In this study, we present a novel\napproach to improve action recognition by exploiting the hierarchical\norganization of actions and by incorporating contextualized textual\ninformation, including location and prior actions to reflect the sequential\ncontext. To achieve this goal, we introduce a novel transformer architecture\ntailored for action recognition that utilizes both visual and textual features.\nVisual features are obtained from RGB and optical flow data, while text\nembeddings represent contextual information. Furthermore, we define a joint\nloss function to simultaneously train the model for both coarse and\nfine-grained action recognition, thereby exploiting the hierarchical nature of\nactions. To demonstrate the effectiveness of our method, we extend the Toyota\nSmarthome Untrimmed (TSU) dataset to introduce action hierarchies, introducing\nthe Hierarchical TSU dataset. We also conduct an ablation study to assess the\nimpact of different methods for integrating contextual and hierarchical data on\naction recognition performance. Results show that the proposed approach\noutperforms pre-trained SOTA methods when trained with the same\nhyperparameters. Moreover, they also show a 17.12% improvement in top-1\naccuracy over the equivalent fine-grained RGB version when using ground-truth\ncontextual information, and a 5.33% improvement when contextual information is\nobtained from actual predictions.", "paper_summary_zh": "動作的順序執行及其階層結構由不同層級的抽象組成，提供在動作辨識任務中仍未探索的功能。在這項研究中，我們提出了一種新的方法，透過利用動作的階層組織，並結合情境化文字資訊（包括位置和先前動作）來反映順序脈絡，以改善動作辨識。為了達成此目標，我們引進一個新的Transformer架構，專門用於動作辨識，它同時利用視覺和文字特徵。視覺特徵從 RGB 和光流資料取得，而文字嵌入則代表情境資訊。此外，我們定義了一個聯合損失函數，以同時訓練模型進行粗略和細緻的動作辨識，從而利用動作的階層性質。為了證明我們方法的有效性，我們擴充了 Toyota Smarthome Untrimmed (TSU) 資料集，以引入動作階層，並引入了階層式 TSU 資料集。我們還進行了一項消融研究，以評估整合情境和階層資料對動作辨識效能的不同方法的影響。結果顯示，所提出的方法在使用相同的超參數進行訓練時，優於預先訓練的 SOTA 方法。此外，在使用真實情境資訊時，它們在頂級 1 準確度上也比等效的細緻 RGB 版本提高了 17.12%，而在從實際預測中取得情境資訊時，則提高了 5.33%。", "author": "Manuel Benavent-Lledo et.al.", "authors": "Manuel Benavent-Lledo, David Mulero-Pérez, David Ortiz-Perez, Jose Garcia-Rodriguez, Antonis Argyros", "id": "2410.21275v1", "paper_url": "http://arxiv.org/abs/2410.21275v1", "repo": "https://github.com/3dperceptionlab/hierarchicalactionrecognition"}}