{"2406.15214": {"publish_time": "2024-06-21", "title": "Unsupervised Extraction of Dialogue Policies from Conversations", "paper_summary": "Dialogue policies play a crucial role in developing task-oriented dialogue\nsystems, yet their development and maintenance are challenging and typically\nrequire substantial effort from experts in dialogue modeling. While in many\nsituations, large amounts of conversational data are available for the task at\nhand, people lack an effective solution able to extract dialogue policies from\nthis data. In this paper, we address this gap by first illustrating how Large\nLanguage Models (LLMs) can be instrumental in extracting dialogue policies from\ndatasets, through the conversion of conversations into a unified intermediate\nrepresentation consisting of canonical forms. We then propose a novel method\nfor generating dialogue policies utilizing a controllable and interpretable\ngraph-based methodology. By combining canonical forms across conversations into\na flow network, we find that running graph traversal algorithms helps in\nextracting dialogue flows. These flows are a better representation of the\nunderlying interactions than flows extracted by prompting LLMs. Our technique\nfocuses on giving conversation designers greater control, offering a\nproductivity tool to improve the process of developing dialogue policies.", "paper_summary_zh": "對話政策在開發任務導向對話系統中扮演著至關重要的角色，然而它們的開發和維護具有挑戰性，且通常需要對話建模專家的大量工作。雖然在許多情況下，大量對話資料可用於手邊的工作，但人們缺乏一種有效的解決方案，無法從這些資料中提取對話政策。在本文中，我們透過首先說明大型語言模型 (LLM) 如何透過將對話轉換成由規範形式組成的統一中間表示，從資料集中提取對話政策，來說明如何解決這個差距。然後，我們提出了一種利用可控且可解釋的基於圖形的方法來產生對話政策的新方法。透過將對話中的規範形式組合成流網路，我們發現執行圖形遍歷演算法有助於提取對話流。這些流比透過提示 LLM 提取的流更能代表底層互動。我們的技術專注於讓對話設計師擁有更大的控制權，提供一種生產力工具來改善開發對話政策的過程。", "author": "Makesh Narsimhan Sreedhar et.al.", "authors": "Makesh Narsimhan Sreedhar, Traian Rebedea, Christopher Parisien", "id": "2406.15214v1", "paper_url": "http://arxiv.org/abs/2406.15214v1", "repo": "null"}}