{"2406.09750": {"publish_time": "2024-06-14", "title": "ControlVAR: Exploring Controllable Visual Autoregressive Modeling", "paper_summary": "Conditional visual generation has witnessed remarkable progress with the\nadvent of diffusion models (DMs), especially in tasks like control-to-image\ngeneration. However, challenges such as expensive computational cost, high\ninference latency, and difficulties of integration with large language models\n(LLMs) have necessitated exploring alternatives to DMs. This paper introduces\nControlVAR, a novel framework that explores pixel-level controls in visual\nautoregressive (VAR) modeling for flexible and efficient conditional\ngeneration. In contrast to traditional conditional models that learn the\nconditional distribution, ControlVAR jointly models the distribution of image\nand pixel-level conditions during training and imposes conditional controls\nduring testing. To enhance the joint modeling, we adopt the next-scale AR\nprediction paradigm and unify control and image representations. A\nteacher-forcing guidance strategy is proposed to further facilitate\ncontrollable generation with joint modeling. Extensive experiments demonstrate\nthe superior efficacy and flexibility of ControlVAR across various conditional\ngeneration tasks against popular conditional DMs, \\eg, ControlNet and\nT2I-Adaptor.", "paper_summary_zh": "條件視覺生成在擴散模型 (DM) 的出現後，特別是在控制到影像生成等任務上，見證了顯著的進展。然而，昂貴的計算成本、高推理延遲以及與大型語言模型 (LLM) 整合的困難等挑戰，使得探索 DM 的替代方案變得必要。本文介紹 ControlVAR，一個新的框架，探索像素級別控制在視覺自迴歸 (VAR) 建模中，以實現靈活且高效的條件式生成。與學習條件式分布的傳統條件式模型相比，ControlVAR 在訓練期間聯合建模影像和像素級別條件的分布，並在測試期間施加條件式控制。為了增強聯合建模，我們採用了下一個尺度的 AR 預測範例，並統一控制和影像表示。提出了一個教師強制指導策略，以進一步促進聯合建模的可控生成。廣泛的實驗證明了 ControlVAR 在各種條件式生成任務中，相較於流行的條件式 DM，例如 ControlNet 和 T2I-Adaptor，具有優異的效能和靈活性。", "author": "Xiang Li et.al.", "authors": "Xiang Li, Kai Qiu, Hao Chen, Jason Kuen, Zhe Lin, Rita Singh, Bhiksha Raj", "id": "2406.09750v1", "paper_url": "http://arxiv.org/abs/2406.09750v1", "repo": "null"}}