{"2409.15766": {"publish_time": "2024-09-24", "title": "CHBench: A Chinese Dataset for Evaluating Health in Large Language Models", "paper_summary": "With the rapid development of large language models (LLMs), assessing their\nperformance on health-related inquiries has become increasingly essential. It\nis critical that these models provide accurate and trustworthy health\ninformation, as their application in real-world contexts--where misinformation\ncan have serious consequences for individuals seeking medical advice and\nsupport--depends on their reliability. In this work, we present CHBench, the\nfirst comprehensive Chinese Health-related Benchmark designed to evaluate LLMs'\ncapabilities in understanding physical and mental health across diverse\nscenarios. CHBench includes 6,493 entries related to mental health and 2,999\nentries focused on physical health, covering a broad spectrum of topics. This\ndataset serves as a foundation for evaluating Chinese LLMs' capacity to\ncomprehend and generate accurate health-related information. Our extensive\nevaluations of four popular Chinese LLMs demonstrate that there remains\nconsiderable room for improvement in their understanding of health-related\ninformation. The code is available at https://github.com/TracyGuo2001/CHBench.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的快速發展，評估其在與健康相關的查詢上的表現變得越來越重要。這些模型提供準確且可信賴的健康資訊至關重要，因為它們在現實世界的應用中——錯誤資訊可能會對尋求醫療建議和支援的個人造成嚴重後果——取決於它們的可靠性。在這項工作中，我們提出了 CHBench，這是第一個全面的中文健康相關基準，旨在評估 LLM 在各種場景中理解身心健康的的能力。CHBench 包含 6,493 個與心理健康相關的條目和 2,999 個關注身體健康的條目，涵蓋廣泛的主題。此資料集作為評估中文 LLM 理解和產生準確健康相關資訊的能力的基礎。我們對四個流行的中文 LLM 的廣泛評估表明，在理解與健康相關的資訊方面仍有很大的改進空間。程式碼可在 https://github.com/TracyGuo2001/CHBench 取得。", "author": "Chenlu Guo et.al.", "authors": "Chenlu Guo, Nuo Xu, Yi Chang, Yuan Wu", "id": "2409.15766v1", "paper_url": "http://arxiv.org/abs/2409.15766v1", "repo": "https://github.com/tracyguo2001/chbench"}}