{"2411.07917": {"publish_time": "2024-11-12", "title": "CryptoLLM: Unleashing the Power of Prompted LLMs for SmartQnA and Classification of Crypto Posts", "paper_summary": "The rapid growth of social media has resulted in an large volume of\nuser-generated content, particularly in niche domains such as cryptocurrency.\nThis task focuses on developing robust classification models to accurately\ncategorize cryptocurrency-related social media posts into predefined classes,\nincluding but not limited to objective, positive, negative, etc. Additionally,\nthe task requires participants to identify the most relevant answers from a set\nof posts in response to specific questions. By leveraging advanced LLMs, this\nresearch aims to enhance the understanding and filtering of cryptocurrency\ndiscourse, thereby facilitating more informed decision-making in this volatile\nsector. We have used a prompt-based technique to solve the classification task\nfor reddit posts and twitter posts. Also, we have used 64-shot technique along\nwith prompts on GPT-4-Turbo model to determine whether a answer is relevant to\na question or not.", "paper_summary_zh": "社群媒體的快速成長產生了大量的使用者產製內容，特別是在加密貨幣等利基領域。此任務專注於開發穩健的分類模型，以準確地將與加密貨幣相關的社群媒體貼文分類為預定義的類別，包括但不限於客觀、正面、負面等。此外，此任務要求參與者從一組貼文中找出最相關的答案，以回應特定問題。透過利用先進的 LLM，此研究旨在增強對加密貨幣討論的理解和過濾，進而促進在這個波動的領域中做出更明智的決策。我們使用基於提示的技術來解決 Reddit 貼文和 Twitter 貼文的分類任務。此外，我們使用 64-shot 技術以及 GPT-4-Turbo 模型上的提示來確定答案是否與問題相關。", "author": "Aniket Deroy et.al.", "authors": "Aniket Deroy, Subhankar Maity", "id": "2411.07917v1", "paper_url": "http://arxiv.org/abs/2411.07917v1", "repo": "null"}}