{"2411.03471": {"publish_time": "2024-11-05", "title": "MetRex: A Benchmark for Verilog Code Metric Reasoning Using LLMs", "paper_summary": "Large Language Models (LLMs) have been applied to various hardware design\ntasks, including Verilog code generation, EDA tool scripting, and RTL bug\nfixing. Despite this extensive exploration, LLMs are yet to be used for the\ntask of post-synthesis metric reasoning and estimation of HDL designs. In this\npaper, we assess the ability of LLMs to reason about post-synthesis metrics of\nVerilog designs. We introduce MetRex, a large-scale dataset comprising 25,868\nVerilog HDL designs and their corresponding post-synthesis metrics, namely\narea, delay, and static power. MetRex incorporates a Chain of Thought (CoT)\ntemplate to enhance LLMs' reasoning about these metrics. Extensive experiments\nshow that Supervised Fine-Tuning (SFT) boosts the LLM's reasoning capabilities\non average by 37.0\\%, 25.3\\%, and 25.7\\% on the area, delay, and static power,\nrespectively. While SFT improves performance on our benchmark, it remains far\nfrom achieving optimal results, especially on complex problems. Comparing to\nstate-of-the-art regression models, our approach delivers accurate\npost-synthesis predictions for 17.4\\% more designs (within a 5\\% error margin),\nin addition to offering a 1.7x speedup by eliminating the need for\npre-processing. This work lays the groundwork for advancing LLM-based Verilog\ncode metric reasoning.", "paper_summary_zh": "大型語言模型 (LLM) 已應用於各種硬體設計任務，包括 Verilog 程式碼產生、EDA 工具腳本編寫和 RTL 錯誤修正。儘管有如此廣泛的探索，但 LLM 尚未用於合成後指標推理和 HDL 設計估計的任務。在本文中，我們評估了 LLM 推理 Verilog 設計合成後指標的能力。我們引入了 MetRex，這是一個包含 25,868 個 Verilog HDL 設計及其對應合成後指標（面積、延遲和靜態功率）的大規模資料集。MetRex 結合了思考鏈 (CoT) 範本，以增強 LLM 對這些指標的推理。廣泛的實驗表明，有監督微調 (SFT) 平均提升了 LLM 的推理能力，分別在面積、延遲和靜態功率方面提升了 37.0%、25.3% 和 25.7%。雖然 SFT 改善了我們基準測試的效能，但距離達到最佳結果仍有很大差距，特別是在複雜的問題上。與最先進的迴歸模型相比，我們的做法提供了準確的合成後預測，適用於多 17.4% 的設計（誤差範圍在 5% 以內），此外還通過消除預處理的需要來提供 1.7 倍的速度提升。這項工作為推進基於 LLM 的 Verilog 程式碼指標推理奠定了基礎。", "author": "Manar Abdelatty et.al.", "authors": "Manar Abdelatty, Jingxiao Ma, Sherief Reda", "id": "2411.03471v1", "paper_url": "http://arxiv.org/abs/2411.03471v1", "repo": "null"}}