{"2405.19988": {"publish_time": "2024-05-30", "title": "Video-Language Critic: Transferable Reward Functions for Language-Conditioned Robotics", "paper_summary": "Natural language is often the easiest and most convenient modality for humans\nto specify tasks for robots. However, learning to ground language to behavior\ntypically requires impractical amounts of diverse, language-annotated\ndemonstrations collected on each target robot. In this work, we aim to separate\nthe problem of what to accomplish from how to accomplish it, as the former can\nbenefit from substantial amounts of external observation-only data, and only\nthe latter depends on a specific robot embodiment. To this end, we propose\nVideo-Language Critic, a reward model that can be trained on readily available\ncross-embodiment data using contrastive learning and a temporal ranking\nobjective, and use it to score behavior traces from a separate reinforcement\nlearning actor. When trained on Open X-Embodiment data, our reward model\nenables 2x more sample-efficient policy training on Meta-World tasks than a\nsparse reward only, despite a significant domain gap. Using in-domain data but\nin a challenging task generalization setting on Meta-World, we further\ndemonstrate more sample-efficient training than is possible with prior\nlanguage-conditioned reward models that are either trained with binary\nclassification, use static images, or do not leverage the temporal information\npresent in video data.", "paper_summary_zh": "自然語言通常是人類為機器人指定任務最容易、最方便的方式。然而，學習將語言轉化為行為通常需要大量的、多樣化的、在每個目標機器人上收集的語言註釋示範。在這項工作中，我們的目標是將如何完成任務的問題與如何完成任務的問題分開，因為前者可以從大量的外部觀察數據中受益，而後者僅依賴於具體機器人的具體實施。為此，我們提出了視頻語言批評家，這是一種獎勵模型，可以使用對比學習和時間排序目標對現成的跨具體實施數據進行訓練，並使用它來評分來自單獨強化學習參與者的行為軌跡。在 Open X-Embodiment 數據上進行訓練時，我們的獎勵模型使 Meta-World 任務上的策略訓練比僅使用稀疏獎勵的策略訓練效率提高了 2 倍，儘管存在顯著的領域差距。在 Meta-World 上使用領域內數據但在具有挑戰性的任務泛化設置中，我們進一步證明了比使用二元分類訓練的、使用靜態圖像的或不利用視頻數據中存在的時間信息的先前語言條件獎勵模型更有效的訓練。", "author": "Minttu Alakuijala et.al.", "authors": "Minttu Alakuijala, Reginald McLean, Isaac Woungang, Nariman Farsad, Samuel Kaski, Pekka Marttinen, Kai Yuan", "id": "2405.19988v1", "paper_url": "http://arxiv.org/abs/2405.19988v1", "repo": "null"}}