{"2408.11848": {"publish_time": "2024-08-13", "title": "MGH Radiology Llama: A Llama 3 70B Model for Radiology", "paper_summary": "In recent years, the field of radiology has increasingly harnessed the power\nof artificial intelligence (AI) to enhance diagnostic accuracy, streamline\nworkflows, and improve patient care. Large language models (LLMs) have emerged\nas particularly promising tools, offering significant potential in assisting\nradiologists with report generation, clinical decision support, and patient\ncommunication. This paper presents an advanced radiology-focused large language\nmodel: MGH Radiology Llama. It is developed using the Llama 3 70B model,\nbuilding upon previous domain-specific models like Radiology-GPT and\nRadiology-Llama2. Leveraging a unique and comprehensive dataset from\nMassachusetts General Hospital, comprising over 6.5 million de-identified\nmedical reports across various imaging modalities, the model demonstrates\nsignificant improvements in generating accurate and clinically relevant\nradiology impressions given the corresponding findings. Our evaluation,\nincorporating both traditional metrics and a GPT-4-based assessment, highlights\nthe enhanced performance of this work over general-purpose LLMs.", "paper_summary_zh": "近年来，放射学领域日益利用人工智能 (AI) 的强大功能来提高诊断准确性、简化工作流程和改善患者护理。大型语言模型 (LLM) 已成为特别有前途的工具，在协助放射科医生生成报告、提供临床决策支持和患者沟通方面具有巨大潜力。本文提出了一种先进的以放射学为重点的大型语言模型：MGH Radiology Llama。它是使用 Llama 3 70B 模型开发的，基于以前的特定领域模型，如 Radiology-GPT 和 Radiology-Llama2。利用来自麻省总医院的独特且全面的数据集，包括超过 650 万份来自各种影像方式的去识别化医疗报告，该模型在根据相应发现生成准确且临床上相关的放射学印象方面展示了显著的改进。我们的评估结合了传统指标和基于 GPT-4 的评估，突出了这项工作相较于通用 LLM 的增强性能。", "author": "Yucheng Shi et.al.", "authors": "Yucheng Shi, Peng Shu, Zhengliang Liu, Zihao Wu, Quanzheng Li, Xiang Li", "id": "2408.11848v1", "paper_url": "http://arxiv.org/abs/2408.11848v1", "repo": "null"}}