{"2410.20814": {"publish_time": "2024-10-28", "title": "NewTerm: Benchmarking Real-Time New Terms for Large Language Models with Annual Updates", "paper_summary": "Despite their remarkable abilities in various tasks, large language models\n(LLMs) still struggle with real-time information (e.g., new facts and terms)\ndue to the knowledge cutoff in their development process. However, existing\nbenchmarks focus on outdated content and limited fields, facing difficulties in\nreal-time updating and leaving new terms unexplored. To address this problem,\nwe propose an adaptive benchmark, NewTerm, for real-time evaluation of new\nterms. We design a highly automated construction method to ensure high-quality\nbenchmark construction with minimal human effort, allowing flexible updates for\nreal-time information. Empirical results on various LLMs demonstrate over 20%\nperformance reduction caused by new terms. Additionally, while updates to the\nknowledge cutoff of LLMs can cover some of the new terms, they are unable to\ngeneralize to more distant new terms. We also analyze which types of terms are\nmore challenging and why LLMs struggle with new terms, paving the way for\nfuture research. Finally, we construct NewTerm 2022 and 2023 to evaluate the\nnew terms updated each year and will continue updating annually. The benchmark\nand codes can be found at https://github.com/hexuandeng/NewTerm.", "paper_summary_zh": "儘管大型語言模型 (LLM) 在各種任務中展現出驚人的能力，但由於開發過程中知識的截止，它們在處理即時資訊（例如新的事實和術語）時仍有困難。然而，現有的基準側重於過時的內容和有限的領域，在即時更新方面面臨困難，且未探索新的術語。為了解決這個問題，我們提出了 NewTerm，這是一個用於即時評估新術語的自適應基準。我們設計了一種高度自動化的建構方法，以確保高品質的基準建構，同時將人力降至最低，並允許對即時資訊進行彈性更新。在各種 LLM 上的實證結果顯示，新術語導致效能降低超過 20%。此外，儘管更新 LLM 的知識截止可以涵蓋一些新術語，但它們無法概化到更遙遠的新術語。我們也分析了哪些類型的術語更具挑戰性，以及 LLM 為何難以處理新術語，為未來的研究鋪路。最後，我們建構了 NewTerm 2022 和 2023 來評估每年更新的新術語，並將持續每年更新。基準和程式碼可以在 https://github.com/hexuandeng/NewTerm 找到。", "author": "Hexuan Deng et.al.", "authors": "Hexuan Deng, Wenxiang Jiao, Xuebo Liu, Min Zhang, Zhaopeng Tu", "id": "2410.20814v1", "paper_url": "http://arxiv.org/abs/2410.20814v1", "repo": "https://github.com/hexuandeng/newterm"}}