{"2411.09366": {"publish_time": "2024-11-14", "title": "LTLf+ and PPLTL+: Extending LTLf and PPLTL to Infinite Traces", "paper_summary": "We introduce LTLf+ and PPLTL+, two logics to express properties of infinite\ntraces, that are based on the linear-time temporal logics LTLf and PPLTL on\nfinite traces. LTLf+/PPLTL+ use levels of Manna and Pnueli's LTL\nsafety-progress hierarchy, and thus have the same expressive power as LTL.\nHowever, they also retain a crucial characteristic of the reactive synthesis\nproblem for the base logics: the game arena for strategy extraction can be\nderived from deterministic finite automata (DFA). Consequently, these logics\ncircumvent the notorious difficulties associated with determinizing infinite\ntrace automata, typical of LTL reactive synthesis. We present DFA-based\nsynthesis techniques for LTLf+/PPLTL+, and show that synthesis is\n2EXPTIME-complete for LTLf+ (matching LTLf) and EXPTIME-complete for PPLTL+\n(matching PPLTL). Notably, while PPLTL+ retains the full expressive power of\nLTL, reactive synthesis is EXPTIME-complete instead of 2EXPTIME-complete. The\ntechniques are also adapted to optimally solve satisfiability, validity, and\nmodel-checking, to get EXPSPACE-complete for LTLf+ (extending a recent result\nfor the guarantee level using LTLf), and PSPACE-complete for PPLTL+.", "paper_summary_zh": "<paragraph>我們引入了 LTLf+ 和 PPLTL+，這兩個邏輯用於表達無限軌跡的屬性，它們基於有限軌跡上的線性時間時序邏輯 LTLf 和 PPLTL。LTLf+/PPLTL+ 使用 Manna 和 Pnueli 的 LTL 安全進度階層的層級，因此具有與 LTL 相同的表達能力。然而，它們也保留了基本邏輯的反應式合成問題的一個關鍵特徵：可以從確定性有限自動機 (DFA) 中推導出策略提取的遊戲場景。因此，這些邏輯規避了與確定無限軌跡自動機相關的臭名昭著的困難，這對於 LTL 反應式合成來說是典型的。我們提出了基於 DFA 的 LTLf+/PPLTL+ 合成技術，並證明了 LTLf+ 的合成是 2EXPTIME 完備的（匹配 LTLf），而 PPLTL+ 的合成是 EXPTIME 完備的（匹配 PPLTL）。值得注意的是，雖然 PPLTL+ 保留了 LTL 的全部表達能力，但反應式合成是 EXPTIME 完備的，而不是 2EXPTIME 完備的。這些技術也適用於最佳地解決可滿足性、有效性和模型檢查，以獲得 LTLf+ 的 EXPSPACE 完備（擴展了使用 LTLf 的保證層級的最新結果），以及 PPLTL+ 的 PSPACE 完備。</paragraph>", "author": "Benjamin Aminof et.al.", "authors": "Benjamin Aminof, Giuseppe De Giacomo, Sasha Rubin, Moshe Y. Vardi", "id": "2411.09366v1", "paper_url": "http://arxiv.org/abs/2411.09366v1", "repo": "null"}}