{"2410.15949": {"publish_time": "2024-10-21", "title": "Findings of the Third Shared Task on Multilingual Coreference Resolution", "paper_summary": "The paper presents an overview of the third edition of the shared task on\nmultilingual coreference resolution, held as part of the CRAC 2024 workshop.\nSimilarly to the previous two editions, the participants were challenged to\ndevelop systems capable of identifying mentions and clustering them based on\nidentity coreference.\n  This year's edition took another step towards real-world application by not\nproviding participants with gold slots for zero anaphora, increasing the task's\ncomplexity and realism. In addition, the shared task was expanded to include a\nmore diverse set of languages, with a particular focus on historical languages.\nThe training and evaluation data were drawn from version 1.2 of the\nmultilingual collection of harmonized coreference resources CorefUD,\nencompassing 21 datasets across 15 languages. 6 systems competed in this shared\ntask.", "paper_summary_zh": "本文概述了多语言共指消解共享任务的第三版，该任务作为 CRAC 2024 研讨会的一部分举行。\n与前两版类似，参与者面临的挑战是开发能够识别提及并根据身份共指对它们进行聚类的系统。\n今年的版本通过不为参与者提供零代词指代的金槽位，向现实世界应用迈出了又一步，从而增加了任务的复杂性和真实性。此外，共享任务已扩展到包括更多样化的语言集，特别关注历史语言。\n训练和评估数据取自多语言协调化共指资源 CorefUD 的 1.2 版，涵盖 15 种语言的 21 个数据集。6 个系统参加了此共享任务。", "author": "Michal Novák et.al.", "authors": "Michal Novák, Barbora Dohnalová, Miloslav Konopík, Anna Nedoluzhko, Martin Popel, Ondřej Pražák, Jakub Sido, Milan Straka, Zdeněk Žabokrtský, Daniel Zeman", "id": "2410.15949v1", "paper_url": "http://arxiv.org/abs/2410.15949v1", "repo": "null"}}