{"2409.17640": {"publish_time": "2024-09-26", "title": "T3: A Novel Zero-shot Transfer Learning Framework Iteratively Training on an Assistant Task for a Target Task", "paper_summary": "Long text summarization, gradually being essential for efficiently processing\nlarge volumes of information, stays challenging for Large Language Models\n(LLMs) such as GPT and LLaMA families because of the insufficient open-sourced\ntraining datasets and the high requirement of contextual details dealing. To\naddress the issue, we design a novel zero-shot transfer learning framework,\nabbreviated as T3, to iteratively training a baseline LLM on an assistant task\nfor the target task, where the former should own richer data resources and\nshare structural or semantic similarity with the latter. In practice, T3 is\napproached to deal with the long text summarization task by utilizing question\nanswering as the assistant task, and further validated its effectiveness on the\nBBC summary, NarraSum, FairytaleQA, and NLQuAD datasets, with up to nearly 14%\nimprovement in ROUGE, 35% improvement in BLEU, and 16% improvement in Factscore\ncompared to three baseline LLMs, demonstrating its potential for more\nassistant-target task combinations.", "paper_summary_zh": "長文摘要逐漸成為有效處理大量資訊的必要條件，對於 GPT 和 LLaMA 家族等大型語言模型 (LLM) 來說仍然是一項挑戰，因為開放原始碼訓練資料集不足，而且需要處理大量脈絡細節。為了解決這個問題，我們設計了一個新穎的零次方轉移學習架構，簡稱為 T3，用於在輔助任務上反覆訓練基準 LLM 以執行目標任務，其中前者應該擁有更豐富的資料資源，並且與後者共享結構或語義相似性。在實務上，T3 透過利用問題解答作為輔助任務來處理長文摘要任務，並進一步驗證其在 BBC summary、NarraSum、FairytaleQA 和 NLQuAD 資料集上的有效性，與三個基準 LLM 相比，ROUGE 提升了近 14%、BLEU 提升了 35%，Factscore 提升了 16%，顯示其在更多輔助目標任務組合中的潛力。", "author": "Xindi Tong et.al.", "authors": "Xindi Tong, Yujin Zhu, Shijian Fan, Liang Xu", "id": "2409.17640v1", "paper_url": "http://arxiv.org/abs/2409.17640v1", "repo": "null"}}