{"2412.05024": {"publish_time": "2024-12-06", "title": "Talking Like One of Us: Effects of Using Regional Language in a Humanoid Social Robot", "paper_summary": "Social robots are becoming more and more perceptible in public service\nsettings. For engaging people in a natural environment a smooth social\ninteraction as well as acceptance by the users are important issues for future\nsuccessful Human-Robot Interaction (HRI). The type of verbal communication has\na special significance here. In this paper we investigate the effects of spoken\nlanguage varieties of a non-standard/regional language compared to standard\nlanguage. More precisely we compare a human dialog with a humanoid social robot\nPepper where the robot on the one hand is answering in High German and on the\nother hand in Low German, a regional language that is understood and partly\nstill spoken in the northern parts of Germany. The content of what the robot\nsays remains the same in both variants. We are interested in the effects that\nthese two different ways of robot talk have on human interlocutors who are more\nor less familiar with Low German in terms of perceived warmth, competence and\npossible discomfort in conversation against a background of cultural identity.\nTo measure these factors we use the Robotic Social Attributes Scale (RoSAS) on\n17 participants with an age ranging from 19 to 61. Our results show that\nsignificantly higher warmth is perceived in the Low German version of the\nconversation.", "paper_summary_zh": "社交機器人在公共服務環境中變得越來越明顯。為了在自然環境中吸引人們，順暢的社交互動以及使用者的接受度對於未來成功的人機互動 (HRI) 來說是重要的議題。在此，口語溝通類型具有特別重要的意義。在本文中，我們探討了非標準/區域語言的口語語言變體與標準語言相比的影響。更精確地說，我們比較了人類與類人社交機器人 Pepper 的對話，機器人在其中一方面以標準德語回答，另一方面以低地德語回答，這是一種區域語言，在德國北部地區被理解，部分地區仍在使用。機器人所說內容在兩個變體中保持相同。我們感興趣的是，這兩種不同的機器人說話方式對人類對話者產生的影響，這些對話者或多或少熟悉低地德語，包括在文化認同背景下感知到的熱情、能力和可能的對話不適。為了衡量這些因素，我們對 17 名年齡介於 19 至 61 歲的參與者使用了機器人社交屬性量表 (RoSAS)。我們的結果表明，在低地德語版本的對話中，感知到的熱情明顯更高。", "author": "Thomas Sievers et.al.", "authors": "Thomas Sievers, Nele Russwinkel", "id": "2412.05024v1", "paper_url": "http://arxiv.org/abs/2412.05024v1", "repo": "null"}}