{"2406.19648": {"publish_time": "2024-06-28", "title": "Designing and Evaluating Multi-Chatbot Interface for Human-AI Communication: Preliminary Findings from a Persuasion Task", "paper_summary": "The dynamics of human-AI communication have been reshaped by language models\nsuch as ChatGPT. However, extant research has primarily focused on dyadic\ncommunication, leaving much to be explored regarding the dynamics of human-AI\ncommunication in group settings. The availability of multiple language model\nchatbots presents a unique opportunity for scholars to better understand the\ninteraction between humans and multiple chatbots. This study examines the\nimpact of multi-chatbot communication in a specific persuasion setting:\npromoting charitable donations. We developed an online environment that enables\nmulti-chatbot communication and conducted a pilot experiment utilizing two\nGPT-based chatbots, Save the Children and UNICEF chatbots, to promote\ncharitable donations. In this study, we present our development process of the\nmulti-chatbot interface and present preliminary findings from a pilot\nexperiment. Analysis of qualitative and quantitative feedback are presented,\nand limitations are addressed.", "paper_summary_zh": "語言模型，例如 ChatGPT，已重塑人機溝通的動態。然而，現有的研究主要集中在雙邊溝通上，在群組設定中人機溝通的動態方面仍有許多待探索之處。多個語言模型聊天機器人的出現，為學者們提供了一個絕佳的機會，可以更深入地了解人類與多個聊天機器人之間的互動。本研究探討了多聊天機器人溝通在特定說服環境中的影響：促進慈善捐款。我們開發了一個允許多聊天機器人溝通的線上環境，並進行了一個試驗實驗，利用兩個基於 GPT 的聊天機器人，即救助兒童會和聯合國兒童基金會的聊天機器人，來促進慈善捐款。在本研究中，我們展示了多聊天機器人介面的開發過程，並提出了試驗實驗的初步發現。我們提供了對質性和量化回饋的分析，並探討了限制。", "author": "Sion Yoon et.al.", "authors": "Sion Yoon, Tae Eun Kim, Yoo Jung Oh", "id": "2406.19648v1", "paper_url": "http://arxiv.org/abs/2406.19648v1", "repo": "null"}}