{"2405.14857": {"publish_time": "2024-05-23", "title": "Semantica: An Adaptable Image-Conditioned Diffusion Model", "paper_summary": "We investigate the task of adapting image generative models to different\ndatasets without finetuneing. To this end, we introduce Semantica, an\nimage-conditioned diffusion model capable of generating images based on the\nsemantics of a conditioning image. Semantica is trained exclusively on\nweb-scale image pairs, that is it receives a random image from a webpage as\nconditional input and models another random image from the same webpage. Our\nexperiments highlight the expressivity of pretrained image encoders and\nnecessity of semantic-based data filtering in achieving high-quality image\ngeneration. Once trained, it can adaptively generate new images from a dataset\nby simply using images from that dataset as input. We study the transfer\nproperties of Semantica on ImageNet, LSUN Churches, LSUN Bedroom and SUN397.", "paper_summary_zh": "我們研究了在不微調的情況下將影像生成模型調整至不同資料集的任務。為此，我們引入了 Semantica，一種基於影像條件的擴散模型，能夠根據條件影像的語義來生成影像。Semantica 專門在網路規模的影像對上受訓，也就是說它接收來自網頁的隨機影像作為條件輸入，並對來自同一個網頁的另一個隨機影像進行建模。我們的實驗突出了預訓練影像編碼器的表現力，以及在達成高品質影像生成中語義資料過濾的必要性。受訓完成後，它可以透過單純使用來自資料集的影像作為輸入，自適應地從資料集中產生新的影像。我們研究了 Semantica 在 ImageNet、LSUN Churches、LSUN Bedroom 和 SUN397 上的轉移特性。", "author": "Manoj Kumar et.al.", "authors": "Manoj Kumar, Neil Houlsby, Emiel Hoogeboom", "id": "2405.14857v1", "paper_url": "http://arxiv.org/abs/2405.14857v1", "repo": "null"}}