{"2405.05499": {"publish_time": "2024-05-09", "title": "Multi-Scale Dilated Convolution Network for Long-Term Time Series Forecasting", "paper_summary": "Accurate forecasting of long-term time series has important applications for\ndecision making and planning. However, it remains challenging to capture the\nlong-term dependencies in time series data. To better extract long-term\ndependencies, We propose Multi Scale Dilated Convolution Network (MSDCN), a\nmethod that utilizes a shallow dilated convolution architecture to capture the\nperiod and trend characteristics of long time series. We design different\nconvolution blocks with exponentially growing dilations and varying kernel\nsizes to sample time series data at different scales. Furthermore, we utilize\ntraditional autoregressive model to capture the linear relationships within the\ndata. To validate the effectiveness of the proposed approach, we conduct\nexperiments on eight challenging long-term time series forecasting benchmark\ndatasets. The experimental results show that our approach outperforms the prior\nstate-of-the-art approaches and shows significant inference speed improvements\ncompared to several strong baseline methods.", "paper_summary_zh": "準確預測長期時間序列對於決策制定和規劃具有重要的應用。然而，捕捉時間序列資料中的長期依賴關係仍然具有挑戰性。為了更好地提取長期依賴關係，我們提出多尺度膨脹卷積網路 (MSDCN)，一種利用淺層膨脹卷積架構來捕捉長期時間序列的週期和趨勢特徵的方法。我們設計了具有指數級增長的膨脹和不同核心的不同卷積塊，以不同尺度採樣時間序列資料。此外，我們利用傳統的自迴歸模型來捕捉資料中的線性關係。為了驗證所提出方法的有效性，我們對八個具有挑戰性的長期時間序列預測基準資料集進行了實驗。實驗結果表明，與之前的最先進方法相比，我們的模型表現更佳，並且與幾種強大的基準方法相比，推論速度有了顯著的提升。", "author": "Feifei Li et.al.", "authors": "Feifei Li, Suhan Guo, Feng Han, Jian Zhao, Furao Shen", "id": "2405.05499v1", "paper_url": "http://arxiv.org/abs/2405.05499v1", "repo": "null"}}