{"2406.01052": {"publish_time": "2024-06-03", "title": "MACT: Model-Agnostic Cross-Lingual Training for Discourse Representation Structure Parsing", "paper_summary": "Discourse Representation Structure (DRS) is an innovative semantic\nrepresentation designed to capture the meaning of texts with arbitrary lengths\nacross languages. The semantic representation parsing is essential for\nachieving natural language understanding through logical forms. Nevertheless,\nthe performance of DRS parsing models remains constrained when trained\nexclusively on monolingual data. To tackle this issue, we introduce a\ncross-lingual training strategy. The proposed method is model-agnostic yet\nhighly effective. It leverages cross-lingual training data and fully exploits\nthe alignments between languages encoded in pre-trained language models. The\nexperiments conducted on the standard benchmarks demonstrate that models\ntrained using the cross-lingual training method exhibit significant\nimprovements in DRS clause and graph parsing in English, German, Italian and\nDutch. Comparing our final models to previous works, we achieve\nstate-of-the-art results in the standard benchmarks. Furthermore, the detailed\nanalysis provides deep insights into the performance of the parsers, offering\ninspiration for future research in DRS parsing. We keep updating new results on\nbenchmarks to the appendix.", "paper_summary_zh": "語篇表示結構 (DRS) 是一種創新的語意表示，旨在擷取任意長度的跨語言文本含義。語意表示解析對於透過邏輯形式達成自然語言理解至關重要。然而，當僅使用單語系資料進行訓練時，DRS 解析模型的效能仍然受到限制。為了解決這個問題，我們引進了跨語言訓練策略。所提出的方法與模型無關，但非常有效。它利用跨語言訓練資料，並充分利用預先訓練語言模型中編碼的語言之間的對齊。在標準基準上進行的實驗證明，使用跨語言訓練方法訓練的模型在英文、德文、義大利文和荷蘭文的 DRS 子句和圖形解析中展現顯著的進步。將我們的最終模型與先前的研究進行比較，我們在標準基準中達到了最先進的結果。此外，詳細的分析提供了對解析器效能的深入見解，為 DRS 解析的未來研究提供了靈感。我們會持續將新的基準結果更新到附錄中。", "author": "Jiangming Liu et.al.", "authors": "Jiangming Liu", "id": "2406.01052v1", "paper_url": "http://arxiv.org/abs/2406.01052v1", "repo": "null"}}