{"2410.08949": {"publish_time": "2024-10-11", "title": "Transferable Belief Model on Quantum Circuits", "paper_summary": "The transferable belief model, as a semantic interpretation of\nDempster-Shafer theory, enables agents to perform reasoning and decision making\nin imprecise and incomplete environments. The model offers distinct semantics\nfor handling unreliable testimonies, allowing for a more reasonable and general\nprocess of belief transfer compared to the Bayesian approach. However, because\nboth the belief masses and the structure of focal sets must be considered when\nupdating belief functions-leading to extra computational complexity during\nreasoning-the transferable belief model has gradually lost favor among\nresearchers in recent developments. In this paper, we implement the\ntransferable belief model on quantum circuits and demonstrate that belief\nfunctions offer a more concise and effective alternative to Bayesian approaches\nwithin the quantum computing framework. Furthermore, leveraging the unique\ncharacteristics of quantum computing, we propose several novel belief transfer\napproaches. More broadly, this paper introduces a new perspective on basic\ninformation representation for quantum AI models, suggesting that belief\nfunctions are more suitable than Bayesian approach for handling uncertainty on\nquantum circuits.", "paper_summary_zh": "可轉移信念模型作為 Dempster-Shafer 理論的語義詮釋，使代理人能夠在不精確和不完整的環境中執行推理和決策制定。該模型提供用於處理不可靠證詞的明確語意，與貝氏方法相比，允許更合理和通用的信念轉移過程。然而，由於更新信念函數時必須考慮信念質量和焦點集的結構，這導致在推理過程中產生額外的計算複雜度，因此可轉移信念模型在最近的發展中逐漸失去研究人員的青睞。在本文中，我們在量子電路上實作可轉移信念模型，並證明信念函數在量子計算框架內提供比貝氏方法更簡潔和有效的替代方案。此外，利用量子計算的獨特特性，我們提出幾種新穎的信念轉移方法。更廣泛地說，本文為量子 AI 模型的基本資訊表示引入了新的觀點，表明信念函數比貝氏方法更適合處理量子電路上的不確定性。", "author": "Qianli Zhou et.al.", "authors": "Qianli Zhou, Hao Luo, Lipeng Pan, Yong Deng, Eloi Bosse", "id": "2410.08949v1", "paper_url": "http://arxiv.org/abs/2410.08949v1", "repo": "null"}}