{"2406.08374": {"publish_time": "2024-06-12", "title": "2.5D Multi-view Averaging Diffusion Model for 3D Medical Image Translation: Application to Low-count PET Reconstruction with CT-less Attenuation Correction", "paper_summary": "Positron Emission Tomography (PET) is an important clinical imaging tool but\ninevitably introduces radiation hazards to patients and healthcare providers.\nReducing the tracer injection dose and eliminating the CT acquisition for\nattenuation correction can reduce the overall radiation dose, but often results\nin PET with high noise and bias. Thus, it is desirable to develop 3D methods to\ntranslate the non-attenuation-corrected low-dose PET (NAC-LDPET) into\nattenuation-corrected standard-dose PET (AC-SDPET). Recently, diffusion models\nhave emerged as a new state-of-the-art deep learning method for image-to-image\ntranslation, better than traditional CNN-based methods. However, due to the\nhigh computation cost and memory burden, it is largely limited to 2D\napplications. To address these challenges, we developed a novel 2.5D Multi-view\nAveraging Diffusion Model (MADM) for 3D image-to-image translation with\napplication on NAC-LDPET to AC-SDPET translation. Specifically, MADM employs\nseparate diffusion models for axial, coronal, and sagittal views, whose outputs\nare averaged in each sampling step to ensure the 3D generation quality from\nmultiple views. To accelerate the 3D sampling process, we also proposed a\nstrategy to use the CNN-based 3D generation as a prior for the diffusion model.\nOur experimental results on human patient studies suggested that MADM can\ngenerate high-quality 3D translation images, outperforming previous CNN-based\nand Diffusion-based baseline methods.", "paper_summary_zh": "正子發射斷層掃描 (PET) 是一種重要的臨床影像工具，但不可避免地會對患者和醫療保健提供者造成輻射危害。降低示蹤劑注射劑量並消除電腦斷層掃描以進行衰減校正可以降低整體輻射劑量，但通常會導致 PET 產生高雜訊和偏差。因此，開發 3D 方法將非衰減校正低劑量 PET (NAC-LDPET) 轉換為衰減校正標準劑量 PET (AC-SDPET) 是很重要的。最近，擴散模型已成為一種新的最先進的深度學習方法，用於影像轉換影像，優於傳統的基於 CNN 的方法。然而，由於高運算成本和記憶體負擔，它在很大程度上僅限於 2D 應用程式。為了應對這些挑戰，我們開發了一種新穎的 2.5D 多視圖平均擴散模型 (MADM)，用於 3D 影像轉換影像，並應用於 NAC-LDPET 轉換為 AC-SDPET。具體來說，MADM 為軸向、冠狀和矢狀視圖採用了單獨的擴散模型，其輸出在每個採樣步驟中取平均值，以確保從多個視圖中進行 3D 生成品質。為了加速 3D 採樣過程，我們還提出了一種策略，將基於 CNN 的 3D 生成用作擴散模型的先驗。我們在人體患者研究中得到的實驗結果表明，MADM 可以生成高品質的 3D 轉換影像，優於先前的基於 CNN 和基於擴散的基線方法。", "author": "Tianqi Chen et.al.", "authors": "Tianqi Chen, Jun Hou, Yinchi Zhou, Huidong Xie, Xiongchao Chen, Qiong Liu, Xueqi Guo, Menghua Xia, James S. Duncan, Chi Liu, Bo Zhou", "id": "2406.08374v1", "paper_url": "http://arxiv.org/abs/2406.08374v1", "repo": "null"}}