{"2410.02719": {"publish_time": "2024-10-03", "title": "UncertaintyRAG: Span-Level Uncertainty Enhanced Long-Context Modeling for Retrieval-Augmented Generation", "paper_summary": "We present UncertaintyRAG, a novel approach for long-context\nRetrieval-Augmented Generation (RAG) that utilizes Signal-to-Noise Ratio\n(SNR)-based span uncertainty to estimate similarity between text chunks. This\nspan uncertainty enhances model calibration, improving robustness and\nmitigating semantic inconsistencies introduced by random chunking. Leveraging\nthis insight, we propose an efficient unsupervised learning technique to train\nthe retrieval model, alongside an effective data sampling and scaling strategy.\nUncertaintyRAG outperforms baselines by 2.03% on LLaMA-2-7B, achieving\nstate-of-the-art results while using only 4% of the training data compared to\nother advanced open-source retrieval models under distribution shift settings.\nOur method demonstrates strong calibration through span uncertainty, leading to\nimproved generalization and robustness in long-context RAG tasks. Additionally,\nUncertaintyRAG provides a lightweight retrieval model that can be integrated\ninto any large language model with varying context window lengths, without the\nneed for fine-tuning, showcasing the flexibility of our approach.", "paper_summary_zh": "我們提出 UncertaintyRAG，一種針對長語境檢索增強生成 (RAG) 的新穎方法，它利用基於訊號雜訊比 (SNR) 的區間不確定性來估計文字區塊之間的相似性。此區間不確定性增強了模型校準，進而提升了穩健性並減輕了隨機區塊化所造成的語義不一致性。利用此見解，我們提出了一種有效的無監督學習技術來訓練檢索模型，並搭配有效的資料抽樣和擴充策略。UncertaintyRAG 在 LLaMA-2-7B 上優於基準 2.03%，在分佈轉移設定下僅使用 4% 的訓練資料便達成最先進的結果，與其他進階的開源檢索模型相比。我們的模型透過區間不確定性展現出強大的校準，進而提升長語境 RAG 任務中的概化能力和穩健性。此外，UncertaintyRAG 提供了一個輕量級的檢索模型，可以整合到任何具有不同語境視窗長度的大語言模型中，而無需微調，展現了我們方法的靈活性。", "author": "Zixuan Li et.al.", "authors": "Zixuan Li, Jing Xiong, Fanghua Ye, Chuanyang Zheng, Xun Wu, Jianqiao Lu, Zhongwei Wan, Xiaodan Liang, Chengming Li, Zhenan Sun, Lingpeng Kong, Ngai Wong", "id": "2410.02719v1", "paper_url": "http://arxiv.org/abs/2410.02719v1", "repo": "null"}}