{"2504.07096": {"publish_time": "2025-04-09", "title": "OLMoTrace: Tracing Language Model Outputs Back to Trillions of Training Tokens", "paper_summary": "We present OLMoTrace, the first system that traces the outputs of language\nmodels back to their full, multi-trillion-token training data in real time.\nOLMoTrace finds and shows verbatim matches between segments of language model\noutput and documents in the training text corpora. Powered by an extended\nversion of infini-gram (Liu et al., 2024), our system returns tracing results\nwithin a few seconds. OLMoTrace can help users understand the behavior of\nlanguage models through the lens of their training data. We showcase how it can\nbe used to explore fact checking, hallucination, and the creativity of language\nmodels. OLMoTrace is publicly available and fully open-source.", "paper_summary_zh": "我們發表了 OLMoTrace，這是第一個可以將語言模型的輸出回溯到其完整、數兆個 token 訓練數據的實時系統。OLMoTrace 能夠在語言模型的輸出片段與訓練文本語料庫中的文檔之間找到並顯示逐字匹配的內容。我們的系統採用了 infini-gram (Liu et al., 2024) 的擴展版本，可以在幾秒鐘內返回追蹤結果。OLMoTrace 可以幫助用戶通過訓練數據的視角來理解語言模型的行為。我們展示了如何使用它來探索事實查核、幻覺和語言模型的創造力。OLMoTrace 已公開發布且完全開源。\n", "author": "Jiacheng Liu et.al.", "authors": "Jiacheng Liu, Taylor Blanton, Yanai Elazar, Sewon Min, YenSung Chen, Arnavi Chheda-Kothary, Huy Tran, Byron Bischoff, Eric Marsh, Michael Schmitz, Cassidy Trier, Aaron Sarnat, Jenna James, Jon Borchardt, Bailey Kuehl, Evie Cheng, Karen Farley, Sruthi Sreeram, Taira Anderson, David Albright, Carissa Schoenick, Luca Soldaini, Dirk Groeneveld, Rock Yuren Pang, Pang Wei Koh, Noah A. Smith, Sophie Lebrecht, Yejin Choi, Hannaneh Hajishirzi, Ali Farhadi, Jesse Dodge", "id": "2504.07096v1", "paper_url": "http://arxiv.org/abs/2504.07096v1", "repo": "null"}}