{"2501.18535": {"publish_time": "2025-01-30", "title": "A Hybrid Data-Driven Approach For Analyzing And Predicting Inpatient Length Of Stay In Health Centre", "paper_summary": "Patient length of stay (LoS) is a critical metric for evaluating the efficacy\nof hospital management. The primary objectives encompass to improve efficiency\nand reduce costs while enhancing patient outcomes and hospital capacity within\nthe patient journey. By seamlessly merging data-driven techniques with\nsimulation methodologies, the study proposes an all-encompassing framework for\nthe optimization of patient flow. Using a comprehensive dataset of 2.3 million\nde-identified patient records, we analyzed demographics, diagnoses, treatments,\nservices, costs, and charges with machine learning models (Decision Tree,\nLogistic Regression, Random Forest, Adaboost, LightGBM) and Python tools\n(Spark, AWS clusters, dimensionality reduction). Our model predicts patient\nlength of stay (LoS) upon admission using supervised learning algorithms. This\nhybrid approach enables the identification of key factors influencing LoS,\noffering a robust framework for hospitals to streamline patient flow and\nresource utilization. The research focuses on patient flow, corroborating the\nefficacy of the approach, illustrating decreased patient length of stay within\na real healthcare environment. The findings underscore the potential of hybrid\ndata-driven models in transforming hospital management practices. This\ninnovative methodology provides generally flexible decision-making, training,\nand patient flow enhancement; such a system could have huge implications for\nhealthcare administration and overall satisfaction with healthcare.", "paper_summary_zh": "住院時間 (LoS) 是評估醫院管理效能的重要指標。主要目標包括在病患歷程中提升效率、降低成本，同時改善病患預後和醫院容量。透過無縫整合資料驅動技術與模擬方法，本研究提出一個全面性的架構，用於優化病患流程。我們使用一個包含 230 萬筆去識別化病患紀錄的綜合資料集，並使用機器學習模型（決策樹、邏輯迴歸、隨機森林、Adaboost、LightGBM）和 Python 工具（Spark、AWS 集群、降維）分析人口統計、診斷、治療、服務、成本和費用。我們的模型使用監督式學習演算法預測病患在入院時的住院時間 (LoS)。此混合方法能找出影響 LoS 的關鍵因素，提供一個強健的架構，讓醫院能簡化病患流程和資源利用。本研究專注於病患流程，佐證此方法的效能，說明在真實的醫療保健環境中減少了病患住院時間。研究結果強調混合資料驅動模型在轉型醫院管理實務中的潛力。此創新方法提供靈活的決策制定、訓練和病患流程改善；這樣的系統可能對醫療保健管理和整體醫療保健滿意度產生重大影響。", "author": "Tasfia Noor Chowdhury et.al.", "authors": "Tasfia Noor Chowdhury, Sanjida Afrin Mou, Kazi Naimur Rahman", "id": "2501.18535v1", "paper_url": "http://arxiv.org/abs/2501.18535v1", "repo": "null"}}