{"2409.08530": {"publish_time": "2024-09-13", "title": "Integration of Mamba and Transformer -- MAT for Long-Short Range Time Series Forecasting with Application to Weather Dynamics", "paper_summary": "Long-short range time series forecasting is essential for predicting future\ntrends and patterns over extended periods. While deep learning models such as\nTransformers have made significant strides in advancing time series\nforecasting, they often encounter difficulties in capturing long-term\ndependencies and effectively managing sparse semantic features. The state-space\nmodel, Mamba, addresses these issues through its adept handling of selective\ninput and parallel computing, striking a balance between computational\nefficiency and prediction accuracy. This article examines the advantages and\ndisadvantages of both Mamba and Transformer models, and introduces a combined\napproach, MAT, which leverages the strengths of each model to capture unique\nlong-short range dependencies and inherent evolutionary patterns in\nmultivariate time series. Specifically, MAT harnesses the long-range dependency\ncapabilities of Mamba and the short-range characteristics of Transformers.\nExperimental results on benchmark weather datasets demonstrate that MAT\noutperforms existing comparable methods in terms of prediction accuracy,\nscalability, and memory efficiency.", "paper_summary_zh": "長短期時間序列預測對於預測未來趨勢和長期模式至關重要。雖然像 Transformers 這樣的深度學習模型在促進時間序列預測方面取得了顯著進展，但它們在捕捉長期依賴性和有效管理稀疏語義特徵方面常常遇到困難。狀態空間模型 Mamba 通過巧妙處理選擇性輸入和並行計算來解決這些問題，在計算效率和預測準確性之間取得平衡。本文探討了 Mamba 和 Transformer 模型的優缺點，並介紹了一種結合方法 MAT，該方法利用每種模型的優勢來捕捉多元時間序列中獨特的長短期依賴性和固有的演化模式。具體來說，MAT 利用了 Mamba 的長程依賴性能力和 Transformers 的短程特徵。基準天氣數據集上的實驗結果表明，MAT 在預測準確性、可擴展性和內存效率方面優於現有的可比方法。", "author": "Wenqing Zhang et.al.", "authors": "Wenqing Zhang, Junming Huang, Ruotong Wang, Changsong Wei, Wenqian Huang, Yuxin Qiao", "id": "2409.08530v1", "paper_url": "http://arxiv.org/abs/2409.08530v1", "repo": "null"}}