{"2408.12333": {"publish_time": "2024-08-22", "title": "Graph Retrieval Augmented Trustworthiness Reasoning", "paper_summary": "Trustworthiness reasoning is crucial in multiplayer games with incomplete\ninformation, enabling agents to identify potential allies and adversaries,\nthereby enhancing reasoning and decision-making processes. Traditional\napproaches relying on pre-trained models necessitate extensive domain-specific\ndata and considerable reward feedback, with their lack of real-time\nadaptability hindering their effectiveness in dynamic environments. In this\npaper, we introduce the Graph Retrieval Augmented Reasoning (GRATR) framework,\nleveraging the Retrieval-Augmented Generation (RAG) technique to bolster\ntrustworthiness reasoning in agents. GRATR constructs a dynamic trustworthiness\ngraph, updating it in real-time with evidential information, and retrieves\nrelevant trust data to augment the reasoning capabilities of Large Language\nModels (LLMs). We validate our approach through experiments on the multiplayer\ngame \"Werewolf,\" comparing GRATR against baseline LLM and LLM enhanced with\nNative RAG and Rerank RAG. Our results demonstrate that GRATR surpasses the\nbaseline methods by over 30\\% in winning rate, with superior reasoning\nperformance. Moreover, GRATR effectively mitigates LLM hallucinations, such as\nidentity and objective amnesia, and crucially, it renders the reasoning process\nmore transparent and traceable through the use of the trustworthiness graph.", "paper_summary_zh": "<paragraph>在信息不完整的多人遊戲中，可信度推理至關重要，讓代理人能夠識別潛在的盟友和敵人，從而增強推理和決策制定過程。依賴預先訓練模型的傳統方法需要大量的特定領域數據和大量的獎勵回饋，而它們缺乏實時適應性會阻礙它們在動態環境中的有效性。在本文中，我們介紹了圖形檢索增強推理 (GRATR) 框架，利用檢索增強生成 (RAG) 技術來加強代理人的可信度推理。GRATR 構建了一個動態可信度圖形，並使用證據信息實時更新它，並檢索相關的信任數據以增強大型語言模型 (LLM) 的推理能力。我們通過多人遊戲「狼人」的實驗驗證了我們的做法，將 GRATR 與基準 LLM 和使用 Native RAG 和 Rerank RAG 增強的 LLM 進行了比較。我們的結果表明，GRATR 在獲勝率上比基準方法高出 30%，具有卓越的推理性能。此外，GRATR 有效地減輕了 LLM 的幻覺，例如身份和目標健忘症，最重要的是，它通過使用可信度圖形使推理過程更透明且可追蹤。</paragraph>", "author": "Ying Zhu et.al.", "authors": "Ying Zhu, Shengchang Li, Ziqian Kong, Peilan Xu", "id": "2408.12333v2", "paper_url": "http://arxiv.org/abs/2408.12333v2", "repo": "https://github.com/EvoNexusX/Graph-Retrieval-Augmented-Trustworthiness-Reasoning"}}