{"2407.16526": {"publish_time": "2024-07-23", "title": "Imperfect Vision Encoders: Efficient and Robust Tuning for Vision-Language Models", "paper_summary": "Vision language models (VLMs) demonstrate impressive capabilities in visual\nquestion answering and image captioning, acting as a crucial link between\nvisual and language models. However, existing open-source VLMs heavily rely on\npretrained and frozen vision encoders (such as CLIP). Despite CLIP's robustness\nacross diverse domains, it still exhibits non-negligible image understanding\nerrors. These errors propagate to the VLM responses, resulting in sub-optimal\nperformance. In our work, we propose an efficient and robust method for\nupdating vision encoders within VLMs. Our approach selectively and locally\nupdates encoders, leading to substantial performance improvements on data where\nprevious mistakes occurred, while maintaining overall robustness. Furthermore,\nwe demonstrate the effectiveness of our method during continual few-shot\nupdates. Theoretical grounding, generality, and computational efficiency\ncharacterize our approach.", "paper_summary_zh": "視覺語言模型 (VLM) 在視覺問答和影像標題說明中展現令人印象深刻的能力，扮演視覺與語言模型之間的關鍵連結。然而，現有的開放原始碼 VLM 嚴重依賴預先訓練且凍結的視覺編碼器 (例如 CLIP)。儘管 CLIP 在各種領域中展現穩健性，但仍會出現不可忽略的影像理解錯誤。這些錯誤會傳播到 VLM 回應中，導致次佳效能。在我們的研究中，我們提出一個有效且穩健的方法，用於更新 VLM 中的視覺編碼器。我們的做法選擇性且局部地更新編碼器，讓先前發生錯誤的資料大幅提升效能，同時維持整體的穩健性。此外，我們在持續少次學習更新期間，展現我們方法的有效性。理論基礎、通用性和運算效率是我們方法的特徵。", "author": "Aristeidis Panos et.al.", "authors": "Aristeidis Panos, Rahaf Aljundi, Daniel Olmeda Reino, Richard E Turner", "id": "2407.16526v1", "paper_url": "http://arxiv.org/abs/2407.16526v1", "repo": "null"}}