{"2410.04936": {"publish_time": "2024-10-07", "title": "Training Interactive Agent in Large FPS Game Map with Rule-enhanced Reinforcement Learning", "paper_summary": "In the realm of competitive gaming, 3D first-person shooter (FPS) games have\ngained immense popularity, prompting the development of game AI systems to\nenhance gameplay. However, deploying game AI in practical scenarios still poses\nchallenges, particularly in large-scale and complex FPS games. In this paper,\nwe focus on the practical deployment of game AI in the online multiplayer\ncompetitive 3D FPS game called Arena Breakout, developed by Tencent Games. We\npropose a novel gaming AI system named Private Military Company Agent (PMCA),\nwhich is interactable within a large game map and engages in combat with\nplayers while utilizing tactical advantages provided by the surrounding\nterrain.\n  To address the challenges of navigation and combat in modern 3D FPS games, we\nintroduce a method that combines navigation mesh (Navmesh) and shooting-rule\nwith deep reinforcement learning (NSRL). The integration of Navmesh enhances\nthe agent's global navigation capabilities while shooting behavior is\ncontrolled using rule-based methods to ensure controllability. NSRL employs a\nDRL model to predict when to enable the navigation mesh, resulting in a diverse\nrange of behaviors for the game AI. Customized rewards for human-like behaviors\nare also employed to align PMCA's behavior with that of human players.", "paper_summary_zh": "在競爭激烈的遊戲領域中，3D 第一人稱射擊 (FPS) 遊戲獲得了極高的人氣，促使遊戲 AI 系統的開發以增強遊戲玩法。然而，在實際場景中部署遊戲 AI 仍然會帶來挑戰，尤其是在大型且複雜的 FPS 遊戲中。在本文中，我們專注於在 Tencent Games 開發的在線多人競爭 3D FPS 遊戲 Arena Breakout 中實際部署遊戲 AI。我們提出了一個名為私人軍事公司特工 (PMCA) 的新遊戲 AI 系統，它可以在大型遊戲地圖中進行互動，並在利用周圍地形提供的戰術優勢時與玩家進行戰鬥。\n為了應對現代 3D FPS 遊戲中的導航和戰鬥挑戰，我們引入了一種結合導航網格 (Navmesh) 和射擊規則與深度強化學習 (NSRL) 的方法。Navmesh 的整合增強了代理的全局導航能力，而射擊行為則使用基於規則的方法進行控制，以確保可控性。NSRL 使用 DRL 模型來預測何時啟用導航網格，從而為遊戲 AI 產生各種行為。還採用了針對類人行為的客製化獎勵，以使 PMCA 的行為與人類玩家的行為保持一致。", "author": "Chen Zhang et.al.", "authors": "Chen Zhang, Huan Hu, Yuan Zhou, Qiyang Cao, Ruochen Liu, Wenya Wei, Elvis S. Liu", "id": "2410.04936v1", "paper_url": "http://arxiv.org/abs/2410.04936v1", "repo": "null"}}