{"2410.08764": {"publish_time": "2024-10-11", "title": "Measuring the Groundedness of Legal Question-Answering Systems", "paper_summary": "In high-stakes domains like legal question-answering, the accuracy and\ntrustworthiness of generative AI systems are of paramount importance. This work\npresents a comprehensive benchmark of various methods to assess the\ngroundedness of AI-generated responses, aiming to significantly enhance their\nreliability. Our experiments include similarity-based metrics and natural\nlanguage inference models to evaluate whether responses are well-founded in the\ngiven contexts. We also explore different prompting strategies for large\nlanguage models to improve the detection of ungrounded responses. We validated\nthe effectiveness of these methods using a newly created grounding\nclassification corpus, designed specifically for legal queries and\ncorresponding responses from retrieval-augmented prompting, focusing on their\nalignment with source material. Our results indicate potential in groundedness\nclassification of generated responses, with the best method achieving a\nmacro-F1 score of 0.8. Additionally, we evaluated the methods in terms of their\nlatency to determine their suitability for real-world applications, as this\nstep typically follows the generation process. This capability is essential for\nprocesses that may trigger additional manual verification or automated response\nregeneration. In summary, this study demonstrates the potential of various\ndetection methods to improve the trustworthiness of generative AI in legal\nsettings.", "paper_summary_zh": "在法律問答等高風險領域中，生成式 AI 系統的準確性和可信度至關重要。本研究提出了一個全面的基準，用於評估各種方法以評估 AI 生成的回應的依據，旨在顯著提高其可信度。我們的實驗包括基於相似性的指標和自然語言推理模型，以評估回應是否在給定的背景下有充分依據。我們還探索了大型語言模型的不同提示策略，以改進對沒有依據的回應的檢測。我們使用一個新建立的依據分類語料庫驗證了這些方法的有效性，該語料庫專門為法律查詢和相應的檢索增強提示的回應而設計，重點關注它們與原始資料的一致性。我們的結果表明，生成的回應的依據分類具有潛力，最好的方法達到了 0.8 的宏觀 F1 分數。此外，我們根據方法的延遲時間評估了方法，以確定它們是否適合實際應用，因為此步驟通常遵循生成過程。此功能對於可能觸發額外手動驗證或自動回應重新生成的流程至關重要。總之，本研究展示了各種檢測方法在改善法律環境中生成式 AI 的可信度方面的潛力。", "author": "Dietrich Trautmann et.al.", "authors": "Dietrich Trautmann, Natalia Ostapuk, Quentin Grail, Adrian Alan Pol, Guglielmo Bonifazi, Shang Gao, Martin Gajek", "id": "2410.08764v1", "paper_url": "http://arxiv.org/abs/2410.08764v1", "repo": "null"}}