{"2411.12603": {"publish_time": "2024-11-19", "title": "STREAM: A Universal State-Space Model for Sparse Geometric Data", "paper_summary": "Handling sparse and unstructured geometric data, such as point clouds or\nevent-based vision, is a pressing challenge in the field of machine vision.\nRecently, sequence models such as Transformers and state-space models entered\nthe domain of geometric data. These methods require specialized preprocessing\nto create a sequential view of a set of points. Furthermore, prior works\ninvolving sequence models iterate geometric data with either uniform or learned\nstep sizes, implicitly relying on the model to infer the underlying geometric\nstructure. In this work, we propose to encode geometric structure explicitly\ninto the parameterization of a state-space model. State-space models are based\non linear dynamics governed by a one-dimensional variable such as time or a\nspatial coordinate. We exploit this dynamic variable to inject relative\ndifferences of coordinates into the step size of the state-space model. The\nresulting geometric operation computes interactions between all pairs of N\npoints in O(N) steps. Our model deploys the Mamba selective state-space model\nwith a modified CUDA kernel to efficiently map sparse geometric data to modern\nhardware. The resulting sequence model, which we call STREAM, achieves\ncompetitive results on a range of benchmarks from point-cloud classification to\nevent-based vision and audio classification. STREAM demonstrates a powerful\ninductive bias for sparse geometric data by improving the PointMamba baseline\nwhen trained from scratch on the ModelNet40 and ScanObjectNN point cloud\nanalysis datasets. It further achieves, for the first time, 100% test accuracy\non all 11 classes of the DVS128 Gestures dataset.", "paper_summary_zh": "<paragraph>處理稀疏且非結構化的幾何數據，例如點雲或事件驅動的視覺，是機器視覺領域中一項迫切的挑戰。\n最近，序列模型（例如Transformer和狀態空間模型）進入了幾何數據領域。這些方法需要專門的預處理，以建立一組點的序列視圖。此外，涉及序列模型的先前工作使用均勻或學習的步長迭代幾何數據，隱含地依賴模型來推斷底層幾何結構。在這項工作中，我們建議將幾何結構明確編碼到狀態空間模型的參數化中。狀態空間模型基於由一維變量（例如時間或空間坐標）支配的線性動力學。我們利用這個動態變量將坐標的相對差異注入狀態空間模型的步長。產生的幾何運算計算了 N 個點的所有對之間的交互作用，步驟為 O(N)。我們的模型部署了 Mamba 選擇性狀態空間模型，並使用修改後的 CUDA 核心將稀疏幾何數據有效地映射到現代硬體。我們稱之為 STREAM 的產生的序列模型，在從點雲分類到基於事件的視覺和音訊分類的一系列基準測試中取得了有競爭力的結果。STREAM 通過改進從 ModelNet40 和 ScanObjectNN 點雲分析數據集從頭開始訓練的 PointMamba 基線，展示了對稀疏幾何數據的強大歸納偏見。此外，它首次在 DVS128 手勢數據集的所有 11 個類別上實現了 100% 的測試準確率。</paragraph>", "author": "Mark Schöne et.al.", "authors": "Mark Schöne, Yash Bhisikar, Karan Bania, Khaleelulla Khan Nazeer, Christian Mayr, Anand Subramoney, David Kappel", "id": "2411.12603v1", "paper_url": "http://arxiv.org/abs/2411.12603v1", "repo": "null"}}