{"2407.16831": {"publish_time": "2024-07-23", "title": "Networks of Networks: Complexity Class Principles Applied to Compound AI Systems Design", "paper_summary": "As practitioners seek to surpass the current reliability and quality frontier\nof monolithic models, Compound AI Systems consisting of many language model\ninference calls are increasingly employed. In this work, we construct systems,\nwhich we call Networks of Networks (NoNs) organized around the distinction\nbetween generating a proposed answer and verifying its correctness, a\nfundamental concept in complexity theory that we show empirically extends to\nLanguage Models (LMs). We introduce a verifier-based judge NoN with K\ngenerators, an instantiation of \"best-of-K\" or \"judge-based\" compound AI\nsystems. Through experiments on synthetic tasks such as prime factorization,\nand core benchmarks such as the MMLU, we demonstrate notable performance gains.\nFor instance, in factoring products of two 3-digit primes, a simple NoN\nimproves accuracy from 3.7\\% to 36.6\\%. On MMLU, a verifier-based judge\nconstruction with only 3 generators boosts accuracy over individual GPT-4-Turbo\ncalls by 2.8\\%. Our analysis reveals that these gains are most pronounced in\ndomains where verification is notably easier than generation--a\ncharacterization which we believe subsumes many reasoning and procedural\nknowledge tasks, but doesn't often hold for factual and declarative\nknowledge-based settings. For mathematical and formal logic reasoning-based\nsubjects of MMLU, we observe a 5-8\\% or higher gain, whilst no gain on others\nsuch as geography and religion. We provide key takeaways for ML practitioners,\nincluding the importance of considering verification complexity, the impact of\nwitness format on verifiability, and a simple test to determine the potential\nbenefit of this NoN approach for a given problem distribution. This work aims\nto inform future research and practice in the design of compound AI systems.", "paper_summary_zh": "<paragraph>隨著從業人員尋求超越當前單一模型的可靠性和品質前沿，由許多語言模型推理呼叫組成的複合式 AI 系統正日益被採用。在這項工作中，我們建構了系統，我們稱之為網路之網（NoN），其組織方式圍繞著提出建議答案和驗證其正確性之間的區別，這是一個複雜性理論中的基本概念，我們以實證方式展示其延伸至語言模型（LM）。我們引入了具有 K 個產生器的驗證者為基礎的評審 NoN，這是「K 中最佳」或「基於評審」複合式 AI 系統的實例化。透過對合成任務（例如質因數分解）和核心基準（例如 MMLU）的實驗，我們展示了顯著的效能提升。例如，在分解兩個 3 位數質數的乘積時，一個簡單的 NoN 將準確度從 3.7% 提升至 36.6%。在 MMLU 上，一個僅有 3 個產生器的基於驗證者的評審建構，將準確度提升了 2.8%，超越了個別的 GPT-4-Turbo 呼叫。我們的分析顯示，這些提升在驗證顯著比產生容易的領域中最为明顯——我們相信此特性涵蓋了許多推理和程序知識任務，但對於基於事實和宣告式知識的設定並不常見。對於 MMLU 中基於數學和形式邏輯推理的主題，我們觀察到 5-8% 或更高的提升，而其他主題（例如地理和宗教）則沒有提升。我們為 ML 從業人員提供了關鍵的重點，包括考量驗證複雜性的重要性、見證格式對可驗證性的影響，以及一個簡單的測試，用於確定此 NoN 方法對給定問題分布的潛在效益。這項工作旨在為複合式 AI 系統設計中的未來研究和實務提供資訊。</paragraph>", "author": "Jared Quincy Davis et.al.", "authors": "Jared Quincy Davis, Boris Hanin, Lingjiao Chen, Peter Bailis, Ion Stoica, Matei Zaharia", "id": "2407.16831v1", "paper_url": "http://arxiv.org/abs/2407.16831v1", "repo": "null"}}