{"2412.08643": {"publish_time": "2024-12-11", "title": "GPD-1: Generative Pre-training for Driving", "paper_summary": "Modeling the evolutions of driving scenarios is important for the evaluation\nand decision-making of autonomous driving systems. Most existing methods focus\non one aspect of scene evolution such as map generation, motion prediction, and\ntrajectory planning. In this paper, we propose a unified Generative\nPre-training for Driving (GPD-1) model to accomplish all these tasks altogether\nwithout additional fine-tuning. We represent each scene with ego, agent, and\nmap tokens and formulate autonomous driving as a unified token generation\nproblem. We adopt the autoregressive transformer architecture and use a\nscene-level attention mask to enable intra-scene bi-directional interactions.\nFor the ego and agent tokens, we propose a hierarchical positional tokenizer to\neffectively encode both 2D positions and headings. For the map tokens, we train\na map vector-quantized autoencoder to efficiently compress ego-centric semantic\nmaps into discrete tokens. We pre-train our GPD-1 on the large-scale nuPlan\ndataset and conduct extensive experiments to evaluate its effectiveness. With\ndifferent prompts, our GPD-1 successfully generalizes to various tasks without\nfinetuning, including scene generation, traffic simulation, closed-loop\nsimulation, map prediction, and motion planning. Code:\nhttps://github.com/wzzheng/GPD.", "paper_summary_zh": "模擬駕駛場景的演進對於評估和決策自動駕駛系統非常重要。現有的方法大多專注於場景演進的一個面向，例如地圖生成、運動預測和軌跡規劃。在本文中，我們提出了一個統一的生成式駕駛預訓練 (GPD-1) 模型，可以同時完成所有這些任務，而無需額外的微調。我們使用自我、代理和地圖符號表示每個場景，並將自動駕駛表述為一個統一的符號生成問題。我們採用自迴歸Transformer架構，並使用場景級別的注意力遮罩來啟用場景內雙向交互。對於自我和代理符號，我們提出了一個分層位置標記器，以有效編碼 2D 位置和標題。對於地圖符號，我們訓練了一個地圖向量量化的自動編碼器，以有效地將以自我為中心的語義地圖壓縮成離散符號。我們在大型 nuPlan 資料集上預訓練我們的 GPD-1，並進行廣泛的實驗來評估其有效性。透過不同的提示，我們的 GPD-1 成功地推廣到各種任務，而無需微調，包括場景生成、交通模擬、閉環模擬、地圖預測和運動規劃。程式碼：\nhttps://github.com/wzzheng/GPD。", "author": "Zixun Xie et.al.", "authors": "Zixun Xie, Sicheng Zuo, Wenzhao Zheng, Yunpeng Zhang, Dalong Du, Jie Zhou, Jiwen Lu, Shanghang Zhang", "id": "2412.08643v1", "paper_url": "http://arxiv.org/abs/2412.08643v1", "repo": "https://github.com/wzzheng/gpd"}}