{"2502.04423": {"publish_time": "2025-02-06", "title": "Primary Care Diagnoses as a Reliable Predictor for Orthopedic Surgical Interventions", "paper_summary": "Referral workflow inefficiencies, including misaligned referrals and delays,\ncontribute to suboptimal patient outcomes and higher healthcare costs. In this\nstudy, we investigated the possibility of predicting procedural needs based on\nprimary care diagnostic entries, thereby improving referral accuracy,\nstreamlining workflows, and providing better care to patients. A de-identified\ndataset of 2,086 orthopedic referrals from the University of Texas Health at\nTyler was analyzed using machine learning models built on Base General\nEmbeddings (BGE) for semantic extraction. To ensure real-world applicability,\nnoise tolerance experiments were conducted, and oversampling techniques were\nemployed to mitigate class imbalance. The selected optimum and parsimonious\nembedding model demonstrated high predictive accuracy (ROC-AUC: 0.874, Matthews\nCorrelation Coefficient (MCC): 0.540), effectively distinguishing patients\nrequiring surgical intervention. Dimensionality reduction techniques confirmed\nthe model's ability to capture meaningful clinical relationships. A threshold\nsensitivity analysis identified an optimal decision threshold (0.30) to balance\nprecision and recall, maximizing referral efficiency. In the predictive\nmodeling analysis, the procedure rate increased from 11.27% to an optimal\n60.1%, representing a 433% improvement with significant implications for\noperational efficiency and healthcare revenue.\n  The results of our study demonstrate that referral optimization can enhance\nprimary and surgical care integration. Through this approach, precise and\ntimely predictions of procedural requirements can be made, thereby minimizing\ndelays, improving surgical planning, and reducing administrative burdens. In\naddition, the findings highlight the potential of clinical decision support as\na scalable solution for improving patient outcomes and the efficiency of the\nhealthcare system.", "paper_summary_zh": "轉診流程效率低落，包括轉診不當和延誤，\n導致次優的患者結果和更高的醫療保健成本。在這\n項研究中，我們探討了根據初級保健診斷條目預測程序需求的可能性，從而提高轉診準確性，\n簡化工作流程，並為患者提供更好的照護。一個去識別化\n德克薩斯大學健康中心的 2,086 個骨科轉診的資料集\n泰勒使用建立在基本通用\n語義提取的嵌入 (BGE) 上的機器學習模型進行分析。為了確保現實世界的適用性，\n進行了噪聲容忍度實驗，並採用了過採樣技術來減輕類別不平衡。所選的最佳和簡約\n嵌入模型展示了高預測準確度 (ROC-AUC：0.874，馬修斯\n相關系數 (MCC)：0.540)，有效區分需要手術干預的患者。降維\n技術證實了模型捕捉有意義的臨床關係的能力。閾值\n敏感性分析確定了一個最佳決策閾值 (0.30) 來平衡\n精確度和召回率，最大化轉診效率。在預測中\n建模分析中，程序率從 11.27% 增加到最佳的\n60.1%，代表 433% 的改進，對運營效率和醫療保健收入具有重大影響。\n我們研究的結果表明，轉診優化可以增強\n初級和外科護理整合。通過這種方法，可以對程序需求進行準確及時的預測，從而最大程度地減少\n延誤，改善手術計劃，並減輕行政負擔。此外，研究結果強調了臨床決策支持作為\n一個可擴展的解決方案的潛力，用於改善患者結果和醫療保健系統的效率。", "author": "Khushboo Verma et.al.", "authors": "Khushboo Verma, Alan Michels, Ergi Gumusaneli, Shilpa Chitnis, Smita Sinha Kumar, Christopher Thompson, Lena Esmail, Guruprasath Srinivasan, Chandini Panchada, Sushovan Guha, Satwant Kumar", "id": "2502.04423v1", "paper_url": "http://arxiv.org/abs/2502.04423v1", "repo": "null"}}