{"2408.10724": {"publish_time": "2024-08-20", "title": "Crafting Tomorrow's Headlines: Neural News Generation and Detection in English, Turkish, Hungarian, and Persian", "paper_summary": "In the era dominated by information overload and its facilitation with Large\nLanguage Models (LLMs), the prevalence of misinformation poses a significant\nthreat to public discourse and societal well-being. A critical concern at\npresent involves the identification of machine-generated news. In this work, we\ntake a significant step by introducing a benchmark dataset designed for neural\nnews detection in four languages: English, Turkish, Hungarian, and Persian. The\ndataset incorporates outputs from multiple multilingual generators (in both,\nzero-shot and fine-tuned setups) such as BloomZ, LLaMa-2, Mistral, Mixtral, and\nGPT-4. Next, we experiment with a variety of classifiers, ranging from those\nbased on linguistic features to advanced Transformer-based models and LLMs\nprompting. We present the detection results aiming to delve into the\ninterpretablity and robustness of machine-generated texts detectors across all\ntarget languages.", "paper_summary_zh": "在資訊爆炸的時代，加上大型語言模型 (LLM) 的推波助瀾，錯誤資訊的盛行對公共論述和社會福祉構成重大威脅。目前一項重要的關注點在於識別機器產生的新聞。在這項工作中，我們透過引進一個基準資料集，為四種語言（英語、土耳其語、匈牙利語和波斯語）的神經新聞偵測邁出重要一步。該資料集整合了多個多語言產生器的輸出（在零次學習和微調設定中），例如 BloomZ、LLaMa-2、Mistral、Mixtral 和 GPT-4。接著，我們嘗試各種分類器，從基於語言特徵的分類器到先進的基於 Transformer 的模型和 LLM 提示。我們呈現偵測結果，旨在深入探討機器產生的文字偵測器在所有目標語言中的可解釋性和穩健性。", "author": "Cem Üyük et.al.", "authors": "Cem Üyük, Danica Rovó, Shaghayegh Kolli, Rabia Varol, Georg Groh, Daryna Dementieva", "id": "2408.10724v1", "paper_url": "http://arxiv.org/abs/2408.10724v1", "repo": "null"}}