{"2406.15119": {"publish_time": "2024-06-21", "title": "Speech Emotion Recognition under Resource Constraints with Data Distillation", "paper_summary": "Speech emotion recognition (SER) plays a crucial role in human-computer\ninteraction. The emergence of edge devices in the Internet of Things (IoT)\npresents challenges in constructing intricate deep learning models due to\nconstraints in memory and computational resources. Moreover, emotional speech\ndata often contains private information, raising concerns about privacy leakage\nduring the deployment of SER models. To address these challenges, we propose a\ndata distillation framework to facilitate efficient development of SER models\nin IoT applications using a synthesised, smaller, and distilled dataset. Our\nexperiments demonstrate that the distilled dataset can be effectively utilised\nto train SER models with fixed initialisation, achieving performances\ncomparable to those developed using the original full emotional speech dataset.", "paper_summary_zh": "語音情緒辨識 (SER) 在人機互動中扮演著至關重要的角色。物聯網 (IoT) 中的邊緣裝置興起，由於記憶體和運算資源的限制，在建構複雜的深度學習模型時面臨挑戰。此外，情緒化語音資料通常包含個人隱私資訊，這在部署 SER 模型時引發了隱私外洩的疑慮。為了應對這些挑戰，我們提出一個資料萃取架構，以利於使用合成、較小且經過萃取的資料集，在 IoT 應用中有效地開發 SER 模型。我們的實驗證明，萃取的資料集可有效用於訓練具備固定初始化的 SER 模型，其效能可與使用原始完整情緒化語音資料集開發的模型相媲美。", "author": "Yi Chang et.al.", "authors": "Yi Chang, Zhao Ren, Zhonghao Zhao, Thanh Tam Nguyen, Kun Qian, Tanja Schultz, Björn W. Schuller", "id": "2406.15119v1", "paper_url": "http://arxiv.org/abs/2406.15119v1", "repo": "null"}}