{"2502.10077": {"publish_time": "2025-02-14", "title": "Towards Empowerment Gain through Causal Structure Learning in Model-Based RL", "paper_summary": "In Model-Based Reinforcement Learning (MBRL), incorporating causal structures\ninto dynamics models provides agents with a structured understanding of the\nenvironments, enabling efficient decision. Empowerment as an intrinsic\nmotivation enhances the ability of agents to actively control their\nenvironments by maximizing the mutual information between future states and\nactions. We posit that empowerment coupled with causal understanding can\nimprove controllability, while enhanced empowerment gain can further facilitate\ncausal reasoning in MBRL. To improve learning efficiency and controllability,\nwe propose a novel framework, Empowerment through Causal Learning (ECL), where\nan agent with the awareness of causal dynamics models achieves\nempowerment-driven exploration and optimizes its causal structure for task\nlearning. Specifically, ECL operates by first training a causal dynamics model\nof the environment based on collected data. We then maximize empowerment under\nthe causal structure for exploration, simultaneously using data gathered\nthrough exploration to update causal dynamics model to be more controllable\nthan dense dynamics model without causal structure. In downstream task\nlearning, an intrinsic curiosity reward is included to balance the causality,\nmitigating overfitting. Importantly, ECL is method-agnostic and is capable of\nintegrating various causal discovery methods. We evaluate ECL combined with 3\ncausal discovery methods across 6 environments including pixel-based tasks,\ndemonstrating its superior performance compared to other causal MBRL methods,\nin terms of causal discovery, sample efficiency, and asymptotic performance.", "paper_summary_zh": "<paragraph>在基於模型的強化學習 (MBRL) 中，將因果結構納入動態模型為代理提供對環境的結構化理解，從而實現高效決策。作為內在動機的賦權通過最大化未來狀態和動作之間的互信息來增強代理主動控制其環境的能力。我們假設賦權與因果理解相結合可以提高可控性，而增強的賦權增益可以進一步促進 MBRL 中的因果推理。為了提高學習效率和可控性，我們提出了一個新的框架，即通過因果學習（ECL）實現賦權，其中具有因果動態模型意識的代理實現了賦權驅動的探索並優化了其因果結構以進行任務學習。具體來說，ECL 通過首先基於收集的數據訓練環境的因果動態模型來運作。然後，我們在因果結構下最大化賦權以進行探索，同時使用通過探索收集的數據來更新因果動態模型，使其比沒有因果結構的密集動態模型更具可控性。在下游任務學習中，包含內在的好奇心獎勵以平衡因果關係，減輕過度擬合。重要的是，ECL 與方法無關，並且能夠整合各種因果發現方法。我們評估了 ECL 與 3 種因果發現方法在 6 個環境（包括基於像素的任務）中的結合，證明了其在因果發現、樣本效率和漸近性能方面優於其他因果 MBRL 方法的卓越性能。</paragraph>", "author": "Hongye Cao et.al.", "authors": "Hongye Cao, Fan Feng, Meng Fang, Shaokang Dong, Tianpei Yang, Jing Huo, Yang Gao", "id": "2502.10077v1", "paper_url": "http://arxiv.org/abs/2502.10077v1", "repo": "null"}}