{"2405.19763": {"publish_time": "2024-05-30", "title": "Enhancing Reinforcement Learning with Label-Sensitive Reward for Natural Language Understanding", "paper_summary": "Recent strides in large language models (LLMs) have yielded remarkable\nperformance, leveraging reinforcement learning from human feedback (RLHF) to\nsignificantly enhance generation and alignment capabilities. However, RLHF\nencounters numerous challenges, including the objective mismatch issue, leading\nto suboptimal performance in Natural Language Understanding (NLU) tasks. To\naddress this limitation, we propose a novel Reinforcement Learning framework\nenhanced with Label-sensitive Reward (RLLR) to amplify the performance of LLMs\nin NLU tasks. By incorporating label-sensitive pairs into reinforcement\nlearning, our method aims to adeptly capture nuanced label-sensitive semantic\nfeatures during RL, thereby enhancing natural language understanding.\nExperiments conducted on five diverse foundation models across eight tasks\nshowcase promising results. In comparison to Supervised Fine-tuning models\n(SFT), RLLR demonstrates an average performance improvement of 1.54%. Compared\nwith RLHF models, the improvement averages at 0.69%. These results reveal the\neffectiveness of our method for LLMs in NLU tasks. Code and data available at:\nhttps://github.com/MagiaSN/ACL2024_RLLR.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展產生了顯著的性能，利用人類反饋的強化學習 (RLHF) 來顯著增強生成和對齊能力。然而，RLHF 會遇到許多挑戰，包括目標不匹配問題，導致自然語言理解 (NLU) 任務的性能不佳。為了解決這個限制，我們提出了一個新的強化學習框架，增強了標籤敏感獎勵 (RLLR)，以增強 LLM 在 NLU 任務中的性能。通過將標籤敏感對整合到強化學習中，我們的目標是在 RL 期間巧妙地捕捉細微的標籤敏感語義特徵，從而增強自然語言理解。在八項任務中對五個不同的基礎模型進行的實驗展示了有希望的結果。與監督微調模型 (SFT) 相比，RLLR 展示了平均性能提升 1.54%。與 RLHF 模型相比，平均提升 0.69%。這些結果揭示了我們的方法對 LLM 在 NLU 任務中的有效性。代碼和數據可於以下網址獲得：https://github.com/MagiaSN/ACL2024_RLLR。", "author": "Kuo Liao et.al.", "authors": "Kuo Liao, Shuang Li, Meng Zhao, Liqun Liu, Mengge Xue, Zhenyu Hu, Honglin Han, Chengguo Yin", "id": "2405.19763v1", "paper_url": "http://arxiv.org/abs/2405.19763v1", "repo": "https://github.com/magiasn/acl2024_rllr"}}