{"2408.07272": {"publish_time": "2024-08-14", "title": "NL2OR: Solve Complex Operations Research Problems Using Natural Language Inputs", "paper_summary": "Operations research (OR) uses mathematical models to enhance decision-making,\nbut developing these models requires expert knowledge and can be\ntime-consuming. Automated mathematical programming (AMP) has emerged to\nsimplify this process, but existing systems have limitations. This paper\nintroduces a novel methodology that uses recent advances in Large Language\nModel (LLM) to create and edit OR solutions from non-expert user queries\nexpressed using Natural Language. This reduces the need for domain expertise\nand the time to formulate a problem. The paper presents an end-to-end pipeline,\nnamed NL2OR, that generates solutions to OR problems from natural language\ninput, and shares experimental results on several important OR problems.", "paper_summary_zh": "運籌學 (OR) 使用數學模型來增強決策制定，但開發這些模型需要專家知識，而且可能很耗時。自動化數學規劃 (AMP) 已應運而生，以簡化此流程，但現有系統有其限制。本文介紹一種新方法，它利用大型語言模型 (LLM) 的最新進展，使用自然語言表達的非專家使用者查詢來建立和編輯運籌學解法。這減少了對領域專業知識的需求，以及制定問題的時間。本文提出了端到端管道，稱為 NL2OR，它根據自然語言輸入產生運籌學問題的解法，並分享了幾個重要運籌學問題的實驗結果。", "author": "Junxuan Li et.al.", "authors": "Junxuan Li, Ryan Wickman, Sahil Bhatnagar, Raj Kumar Maity, Arko Mukherjee", "id": "2408.07272v1", "paper_url": "http://arxiv.org/abs/2408.07272v1", "repo": "null"}}