{"2501.15724": {"publish_time": "2025-01-27", "title": "A Survey on Computational Pathology Foundation Models: Datasets, Adaptation Strategies, and Evaluation Tasks", "paper_summary": "Computational pathology foundation models (CPathFMs) have emerged as a\npowerful approach for analyzing histopathological data, leveraging\nself-supervised learning to extract robust feature representations from\nunlabeled whole-slide images. These models, categorized into uni-modal and\nmulti-modal frameworks, have demonstrated promise in automating complex\npathology tasks such as segmentation, classification, and biomarker discovery.\nHowever, the development of CPathFMs presents significant challenges, such as\nlimited data accessibility, high variability across datasets, the necessity for\ndomain-specific adaptation, and the lack of standardized evaluation benchmarks.\nThis survey provides a comprehensive review of CPathFMs in computational\npathology, focusing on datasets, adaptation strategies, and evaluation tasks.\nWe analyze key techniques, such as contrastive learning and multi-modal\nintegration, and highlight existing gaps in current research. Finally, we\nexplore future directions from four perspectives for advancing CPathFMs. This\nsurvey serves as a valuable resource for researchers, clinicians, and AI\npractitioners, guiding the advancement of CPathFMs toward robust and clinically\napplicable AI-driven pathology solutions.", "paper_summary_zh": "計算病理基礎模型 (CPathFM) 已成為分析組織病理學數據的一種強大方法，利用自我監督學習從未標記的全幻燈片影像中提取穩健的特色表徵。這些模型分為單模態和多模態框架，已證明有望自動化複雜的病理任務，例如分割、分類和生物標記發現。然而，CPathFM 的開發提出了重大挑戰，例如數據可及性有限、數據集之間變異性高、需要特定領域的適應性，以及缺乏標準化的評估基準。這項調查對計算病理學中的 CPathFM 進行了全面的回顧，重點關注數據集、適應策略和評估任務。我們分析了對比學習和多模態整合等關鍵技術，並強調了當前研究中存在的差距。最後，我們從四個角度探討了推進 CPathFM 的未來方向。這項調查作為研究人員、臨床醫生和人工智能從業人員的寶貴資源，指導 CPathFM 朝著穩健且臨床上適用的 AI 驅動病理解決方案邁進。", "author": "Dong Li et.al.", "authors": "Dong Li, Guihong Wan, Xintao Wu, Xinyu Wu, Ajit J. Nirmal, Christine G. Lian, Peter K. Sorger, Yevgeniy R. Semenov, Chen Zhao", "id": "2501.15724v1", "paper_url": "http://arxiv.org/abs/2501.15724v1", "repo": "null"}}