{"2405.14660": {"publish_time": "2024-05-23", "title": "Implicit In-context Learning", "paper_summary": "In-context Learning (ICL) empowers large language models (LLMs) to adapt to\nunseen tasks during inference by prefixing a few demonstration examples prior\nto test queries. Despite its versatility, ICL incurs substantial computational\nand memory overheads compared to zero-shot learning and is susceptible to the\nselection and order of demonstration examples. In this work, we introduce\nImplicit In-context Learning (I2CL), an innovative paradigm that addresses the\nchallenges associated with traditional ICL by absorbing demonstration examples\nwithin the activation space. I2CL first generates a condensed vector\nrepresentation, namely a context vector, from the demonstration examples. It\nthen integrates the context vector during inference by injecting a linear\ncombination of the context vector and query activations into the model's\nresidual streams. Empirical evaluation on nine real-world tasks across three\nmodel architectures demonstrates that I2CL achieves few-shot performance with\nzero-shot cost and exhibits robustness against the variation of demonstration\nexamples. Furthermore, I2CL facilitates a novel representation of \"task-ids\",\nenhancing task similarity detection and enabling effective transfer learning.\nWe provide a comprehensive analysis of I2CL, offering deeper insights into its\nmechanisms and broader implications for ICL. The source code is available at:\nhttps://github.com/LzVv123456/I2CL.", "paper_summary_zh": "<paragraph>語境學習 (ICL) 讓大型語言模型 (LLM) 能夠在推論期間適應未見過任務，方法是在測試查詢之前加上幾個示範範例。儘管 ICL 具有多功能性，但與零次學習相比，它會產生大量的計算和記憶體開銷，並且容易受到示範範例的選擇和順序影響。在這項工作中，我們引入了隱式語境學習 (I2CL)，這是一種創新的範例，它透過在啟用空間中吸收示範範例來解決與傳統 ICL 相關的挑戰。I2CL 首先從示範範例產生一個濃縮的向量表示，即語境向量。然後，它透過將語境向量和查詢啟用項目的線性組合注入模型的殘差串流中，在推論期間整合語境向量。在三個模型架構上對九個真實世界任務進行的實證評估表明，I2CL 以零次成本實現了少量次學習效能，並且對示範範例的變化具有穩健性。此外，I2CL 促進了「任務識別碼」的新表示，增強了任務相似性偵測並實現有效的遷移學習。我們對 I2CL 進行了全面的分析，提供了對其機制和對 ICL 更廣泛影響的更深入見解。原始碼可在以下位置取得：https://github.com/LzVv123456/I2CL。</paragraph>", "author": "Zhuowei Li et.al.", "authors": "Zhuowei Li, Zihao Xu, Ligong Han, Yunhe Gao, Song Wen, Di Liu, Hao Wang, Dimitris N. Metaxas", "id": "2405.14660v1", "paper_url": "http://arxiv.org/abs/2405.14660v1", "repo": "null"}}