{"2410.02387": {"publish_time": "2024-10-03", "title": "BiSSL: Bilevel Optimization for Self-Supervised Pre-Training and Fine-Tuning", "paper_summary": "In this work, we present BiSSL, a first-of-its-kind training framework that\nintroduces bilevel optimization to enhance the alignment between the pretext\npre-training and downstream fine-tuning stages in self-supervised learning.\nBiSSL formulates the pretext and downstream task objectives as the lower- and\nupper-level objectives in a bilevel optimization problem and serves as an\nintermediate training stage within the self-supervised learning pipeline. By\nmore explicitly modeling the interdependence of these training stages, BiSSL\nfacilitates enhanced information sharing between them, ultimately leading to a\nbackbone parameter initialization that is better suited for the downstream\ntask. We propose a training algorithm that alternates between optimizing the\ntwo objectives defined in BiSSL. Using a ResNet-18 backbone pre-trained with\nSimCLR on the STL10 dataset, we demonstrate that our proposed framework\nconsistently achieves improved or competitive classification accuracies across\nvarious downstream image classification datasets compared to the conventional\nself-supervised learning pipeline. Qualitative analyses of the backbone\nfeatures further suggest that BiSSL enhances the alignment of downstream\nfeatures in the backbone prior to fine-tuning.", "paper_summary_zh": "在這項工作中，我們提出了 BiSSL，這是一個首創的訓練架構，它引入了雙層最佳化，以增強自我監督學習中預訓練和下游微調階段之間的對齊。BiSSL 將預訓練和下游任務目標公式化為雙層最佳化問題中的下層和上層目標，並作為自我監督學習流程中的中間訓練階段。通過更明確地建模這些訓練階段的相互依賴性，BiSSL 促進了它們之間增強的信息共享，最終導致更適合下游任務的主幹參數初始化。我們提出了一種訓練演算法，在 BiSSL 中定義的兩個目標之間交替最佳化。使用在 STL10 資料集上使用 SimCLR 預訓練的 ResNet-18 主幹，我們證明了我們提出的架構與傳統的自我監督學習流程相比，在各種下游影像分類資料集上持續獲得改善或具有競爭力的分類準確度。主幹特徵的定性分析進一步表明，BiSSL 增強了微調之前主幹中下游特徵的對齊。", "author": "Gustav Wagner Zakarias et.al.", "authors": "Gustav Wagner Zakarias, Lars Kai Hansen, Zheng-Hua Tan", "id": "2410.02387v1", "paper_url": "http://arxiv.org/abs/2410.02387v1", "repo": "null"}}