{"2407.05530": {"publish_time": "2024-07-08", "title": "This&That: Language-Gesture Controlled Video Generation for Robot Planning", "paper_summary": "We propose a robot learning method for communicating, planning, and executing\na wide range of tasks, dubbed This&That. We achieve robot planning for general\ntasks by leveraging the power of video generative models trained on\ninternet-scale data containing rich physical and semantic context. In this\nwork, we tackle three fundamental challenges in video-based planning: 1)\nunambiguous task communication with simple human instructions, 2) controllable\nvideo generation that respects user intents, and 3) translating visual planning\ninto robot actions. We propose language-gesture conditioning to generate\nvideos, which is both simpler and clearer than existing language-only methods,\nespecially in complex and uncertain environments. We then suggest a behavioral\ncloning design that seamlessly incorporates the video plans. This&That\ndemonstrates state-of-the-art effectiveness in addressing the above three\nchallenges, and justifies the use of video generation as an intermediate\nrepresentation for generalizable task planning and execution. Project website:\nhttps://cfeng16.github.io/this-and-that/.", "paper_summary_zh": "我們提出了一種機器人學習方法，用於溝通、規劃和執行廣泛的任務，稱為 This&That。我們透過利用在包含豐富物理和語義背景的網路規模資料上訓練的影片生成模型，來實現機器人對一般任務的規劃。在這項工作中，我們解決了影片規劃中的三個基本挑戰：1) 使用簡單的人類指令進行明確的任務溝通，2) 尊重使用者意圖的可控影片生成，以及 3) 將視覺規劃轉換為機器人動作。我們提出語言手勢條件來產生影片，這比現有的僅語言方法更簡單且更清晰，特別是在複雜和不確定的環境中。然後，我們建議採用行為複製設計，將影片計畫無縫整合。This&That 在解決上述三個挑戰方面展示了最先進的有效性，並證明了使用影片生成作為可概括任務規劃和執行的中間表示是合理的。專案網站：https://cfeng16.github.io/this-and-that/。", "author": "Boyang Wang et.al.", "authors": "Boyang Wang, Nikhil Sridhar, Chao Feng, Mark Van der Merwe, Adam Fishman, Nima Fazeli, Jeong Joon Park", "id": "2407.05530v1", "paper_url": "http://arxiv.org/abs/2407.05530v1", "repo": "null"}}