{"2406.09153": {"publish_time": "2024-06-13", "title": "LASER: Learning by Aligning Self-supervised Representations of Speech for Improving Content-related Tasks", "paper_summary": "Self-supervised learning (SSL)-based speech models are extensively used for\nfull-stack speech processing. However, it has been observed that improving\nSSL-based speech representations using unlabeled speech for content-related\ntasks is challenging and computationally expensive. Recent attempts have been\nmade to address this issue with cost-effective self-supervised fine-tuning\n(SSFT) approaches. Continuing in this direction, a cost-effective SSFT method\nnamed \"LASER: Learning by Aligning Self-supervised Representations\" is\npresented. LASER is based on the soft-DTW alignment loss with temporal\nregularisation term. Experiments are conducted with HuBERT and WavLM models and\nevaluated on the SUPERB benchmark for two content-related tasks: automatic\nspeech recognition (ASR) and phoneme recognition (PR). A relative improvement\nof 3.7% and 8.2% for HuBERT, and 4.1% and 11.7% for WavLM are observed, for the\nASR and PR tasks respectively, with only < 3 hours of fine-tuning on a single\nGPU.", "paper_summary_zh": "基於自我監督學習 (SSL) 的語音模型廣泛用於全端語音處理。然而，已觀察到使用與內容相關任務的未標記語音來改進基於 SSL 的語音表示具有挑戰性且在計算上很昂貴。最近已嘗試使用具有成本效益的自我監督微調 (SSFT) 方法來解決此問題。繼續朝這個方向，提出了一個名為「LASER：透過比對自我監督表示進行學習」的具有成本效益的 SSFT 方法。LASER 基於具有時間正則化項的軟 DTW 對齊損失。使用 HuBERT 和 WavLM 模型進行實驗，並針對兩個與內容相關的任務（自動語音辨識 (ASR) 和音素辨識 (PR)）在 SUPERB 基準上進行評估。對於 HuBERT，ASR 和 PR 任務分別觀察到 3.7% 和 8.2% 的相對改進，而 WavLM 則觀察到 4.1% 和 11.7%，而僅在單一 GPU 上進行不到 3 小時的微調。", "author": "Amit Meghanani et.al.", "authors": "Amit Meghanani, Thomas Hain", "id": "2406.09153v1", "paper_url": "http://arxiv.org/abs/2406.09153v1", "repo": "null"}}