{"2411.16613": {"publish_time": "2024-11-25", "title": "Recent Trends in Linear Text Segmentation: a Survey", "paper_summary": "Linear Text Segmentation is the task of automatically tagging text documents\nwith topic shifts, i.e. the places in the text where the topics change. A\nwell-established area of research in Natural Language Processing, drawing from\nwell-understood concepts in linguistic and computational linguistic research,\nthe field has recently seen a lot of interest as a result of the surge of text,\nvideo, and audio available on the web, which in turn require ways of\nsummarising and categorizing the mole of content for which linear text\nsegmentation is a fundamental step. In this survey, we provide an extensive\noverview of current advances in linear text segmentation, describing the state\nof the art in terms of resources and approaches for the task. Finally, we\nhighlight the limitations of available resources and of the task itself, while\nindicating ways forward based on the most recent literature and under-explored\nresearch directions.", "paper_summary_zh": "線性文本分段是自動標記文本文件\n主題轉換，即文本中主題變更的地方。自然語言處理中一個建立良好的研究領域，汲取\n語言學和計算語言學研究中理解良好的概念，該領域最近因網路上大量湧現的文字、\n影片和音訊而備受關注，而這些內容需要總結和分類，而線性文本分段正是基本步驟。在這項調查中，我們提供線性文本分段當前進展的廣泛概述，說明任務在資源和方法方面的最新進展。最後，我們強調可用資源和任務本身的限制，同時根據最新文獻和尚未探索的研究方向指出前進的方向。", "author": "Iacopo Ghinassi et.al.", "authors": "Iacopo Ghinassi, Lin Wang, Chris Newell, Matthew Purver", "id": "2411.16613v1", "paper_url": "http://arxiv.org/abs/2411.16613v1", "repo": "null"}}