{"2410.21802": {"publish_time": "2024-10-29", "title": "Text-Guided Attention is All You Need for Zero-Shot Robustness in Vision-Language Models", "paper_summary": "Due to the impressive zero-shot capabilities, pre-trained vision-language\nmodels (e.g. CLIP), have attracted widespread attention and adoption across\nvarious domains. Nonetheless, CLIP has been observed to be susceptible to\nadversarial examples. Through experimental analysis, we have observed a\nphenomenon wherein adversarial perturbations induce shifts in text-guided\nattention. Building upon this observation, we propose a simple yet effective\nstrategy: Text-Guided Attention for Zero-Shot Robustness (TGA-ZSR). This\nframework incorporates two components: the Attention Refinement module and the\nAttention-based Model Constraint module. Our goal is to maintain the\ngeneralization of the CLIP model and enhance its adversarial robustness: The\nAttention Refinement module aligns the text-guided attention obtained from the\ntarget model via adversarial examples with the text-guided attention acquired\nfrom the original model via clean examples. This alignment enhances the model's\nrobustness. Additionally, the Attention-based Model Constraint module acquires\ntext-guided attention from both the target and original models using clean\nexamples. Its objective is to maintain model performance on clean samples while\nenhancing overall robustness. The experiments validate that our method yields a\n9.58% enhancement in zero-shot robust accuracy over the current\nstate-of-the-art techniques across 16 datasets. Our code is available at\nhttps://github.com/zhyblue424/TGA-ZSR.", "paper_summary_zh": "由於令人印象深刻的零次學習能力，預訓練的視覺語言模型（例如 CLIP）已經吸引了各個領域的廣泛關注和採用。儘管如此，已經觀察到 CLIP 容易受到對抗範例的影響。透過實驗分析，我們觀察到一個現象，其中對抗擾動會導致文本引導注意力的轉移。基於此觀察，我們提出了一個簡單但有效的策略：零次學習穩健性的文本引導注意力（TGA-ZSR）。這個架構包含兩個組成部分：注意力精煉模組和基於注意力的模型約束模組。我們的目標是維持 CLIP 模型的泛化性並增強其對抗穩健性：注意力精煉模組會將透過對抗範例從目標模型獲得的文本引導注意力與透過乾淨範例從原始模型獲得的文本引導注意力對齊。此對齊增強了模型的穩健性。此外，基於注意力的模型約束模組會使用乾淨範例從目標模型和原始模型中獲取文本引導注意力。其目標是在增強整體穩健性的同時，維持模型在乾淨範例上的效能。實驗驗證了我們的方法在 16 個資料集上，比目前的最新技術提高了 9.58% 的零次學習穩健準確度。我們的程式碼可在 https://github.com/zhyblue424/TGA-ZSR 取得。", "author": "Lu Yu et.al.", "authors": "Lu Yu, Haiyang Zhang, Changsheng Xu", "id": "2410.21802v2", "paper_url": "http://arxiv.org/abs/2410.21802v2", "repo": "https://github.com/zhyblue424/tga-zsr"}}