{"2408.03339": {"publish_time": "2024-07-22", "title": "The Ontoverse: Democratising Access to Knowledge Graph-based Data Through a Cartographic Interface", "paper_summary": "As the number of scientific publications and preprints is growing\nexponentially, several attempts have been made to navigate this complex and\nincreasingly detailed landscape. These have almost exclusively taken\nunsupervised approaches that fail to incorporate domain knowledge and lack the\nstructural organisation required for intuitive interactive human exploration\nand discovery. Especially in highly interdisciplinary fields, a deep\nunderstanding of the connectedness of research works across topics is essential\nfor generating insights. We have developed a unique approach to data navigation\nthat leans on geographical visualisation and uses hierarchically structured\ndomain knowledge to enable end-users to explore knowledge spaces grounded in\ntheir desired domains of interest. This can take advantage of existing\nontologies, proprietary intelligence schemata, or be directly derived from the\nunderlying data through hierarchical topic modelling. Our approach uses natural\nlanguage processing techniques to extract named entities from the underlying\ndata and normalise them against relevant domain references and navigational\nstructures. The knowledge is integrated by first calculating similarities\nbetween entities based on their shared extracted feature space and then by\nalignment to the navigational structures. The result is a knowledge graph that\nallows for full text and semantic graph query and structured topic driven\nnavigation. This allows end-users to identify entities relevant to their needs\nand access extensive graph analytics. The user interface facilitates graphical\ninteraction with the underlying knowledge graph and mimics a cartographic map\nto maximise ease of use and widen adoption. We demonstrate an exemplar project\nusing our generalisable and scalable infrastructure for an academic biomedical\nliterature corpus that is grounded against hundreds of different named domain\nentities.", "paper_summary_zh": "<paragraph>隨著科學出版物和預印本數量呈指數增長，已經進行了多項嘗試來探索這個複雜且日益詳細的領域。這些嘗試幾乎完全採用了無法納入領域知識且缺乏直觀互動式人類探索和發現所需的結構性組織的無監督方法。特別是在高度跨學科的領域中，深入了解跨主題的研究工作的連通性對於產生見解至關重要。我們開發了一種獨特的方法來進行資料導航，該方法依賴於地理視覺化，並使用分層結構的領域知識，使用戶能夠探索建立在他們感興趣的目標領域中的知識空間。這可以利用現有的本体、專有智慧模式，或直接從基礎資料中透過分層主題建模衍生出來。我們的做法使用自然語言處理技術從基礎資料中提取命名實體，並根據相關的領域參考和導航結構對它們進行標準化。知識的整合首先透過根據共享的提取特徵空間計算實體之間的相似性，然後透過與導航結構的對齊來進行。結果是一個知識圖，允許進行全文和語義圖查詢以及結構化主題驅動導航。這使用戶能夠識別與其需求相關的實體，並存取廣泛的圖形分析。使用者介面促進了與基礎知識圖形的圖形互動，並模擬製圖地圖以最大限度地提高易用性和擴大採用率。我們展示了一個範例專案，使用我們針對數百個不同的命名領域實體建立的通用且可擴充的基礎架構，用於學術生物醫學文獻語料庫。</paragraph>", "author": "Johannes Zimmermann et.al.", "authors": "Johannes Zimmermann, Dariusz Wiktorek, Thomas Meusburger, Miquel Monge-Dalmau, Antonio Fabregat, Alexander Jarasch, Günter Schmidt, Jorge S. Reis-Filho, T. Ian Simpson", "id": "2408.03339v1", "paper_url": "http://arxiv.org/abs/2408.03339v1", "repo": "null"}}