{"2409.17115": {"publish_time": "2024-09-25", "title": "Programming Every Example: Lifting Pre-training Data Quality like Experts at Scale", "paper_summary": "Large language model pre-training has traditionally relied on human experts\nto craft heuristics for improving the corpora quality, resulting in numerous\nrules developed to date. However, these rules lack the flexibility to address\nthe unique characteristics of individual example effectively. Meanwhile,\napplying tailored rules to every example is impractical for human experts. In\nthis paper, we demonstrate that even small language models, with as few as 0.3B\nparameters, can exhibit substantial data refining capabilities comparable to\nthose of human experts. We introduce Programming Every Example (ProX), a novel\nframework that treats data refinement as a programming task, enabling models to\nrefine corpora by generating and executing fine-grained operations, such as\nstring normalization, for each individual example at scale. Experimental\nresults show that models pre-trained on ProX-curated data outperform either\noriginal data or data filtered by other selection methods by more than 2%\nacross various downstream benchmarks. Its effectiveness spans various model\nsizes and pre-training corpora, including C4, RedPajama-V2, and FineWeb.\nFurthermore, ProX exhibits significant potential in domain-specific continual\npre-training: without domain specific design, models trained on OpenWebMath\nrefined by ProX outperform human-crafted rule-based methods, improving average\naccuracy by 7.6% over Mistral-7B, with 14.6% for Llama-2-7B and 20.3% for\nCodeLlama-7B, all within 10B tokens to be comparable to models like Llemma-7B\ntrained on 200B tokens. Further analysis highlights that ProX significantly\nsaves training FLOPs, offering a promising path for efficient LLM\npre-training.We are open-sourcing ProX with >100B corpus, models, and sharing\nall training and implementation details for reproducible research and future\ninnovation. Code: https://github.com/GAIR-NLP/ProX", "paper_summary_zh": "大型語言模型預訓練傳統上依賴人類專家\n制定啟發式方法來改善語料庫品質，導致迄今已開發出許多規則。然而，這些規則缺乏靈活性，無法有效解決個別範例的獨特特性。同時，對每個範例應用量身打造的規則對人類專家來說並不實際。在本文中，我們證明即使是只有 0.3B 參數的小語言模型，也可以展現出與人類專家相當的實質性資料精煉能力。我們引入了「為每個範例編程」（ProX），這是一個新穎的架構，將資料精煉視為一項編程任務，使模型能夠透過為每個個別範例產生並執行細微的運算（例如字串正規化）來精煉語料庫。實驗結果顯示，使用 ProX 整理資料後預先訓練的模型，在各種下游基準中都比原始資料或由其他選擇方法篩選的資料高出 2% 以上。其效能涵蓋各種模型大小和預訓練語料庫，包括 C4、RedPajama-V2 和 FineWeb。此外，ProX 在特定領域的持續預訓練中展現出顯著的潛力：在沒有特定領域設計的情況下，使用 ProX 精煉的 OpenWebMath 訓練模型優於人類編寫的基於規則的方法，平均準確度比 Mistral-7B 提高 7.6%，比 Llama-2-7B 提高 14.6%，比 CodeLlama-7B 提高 20.3%，所有都在 10B 個代幣內，與訓練 200B 個代幣的 Llemma-7B 等模型相當。進一步的分析重點指出，ProX 大幅節省了訓練 FLOP，為高效 LLM 預訓練提供了一條有希望的路徑。我們開放原始碼 ProX，其中包含 >100B 語料庫、模型，並分享所有訓練和實作細節，以利於可重製的研究和未來的創新。程式碼：https://github.com/GAIR-NLP/ProX", "author": "Fan Zhou et.al.", "authors": "Fan Zhou, Zengzhi Wang, Qian Liu, Junlong Li, Pengfei Liu", "id": "2409.17115v1", "paper_url": "http://arxiv.org/abs/2409.17115v1", "repo": "https://github.com/gair-nlp/prox"}}