{"2411.06781": {"publish_time": "2024-11-11", "title": "MP-PINN: A Multi-Phase Physics-Informed Neural Network for Epidemic Forecasting", "paper_summary": "Forecasting temporal processes such as virus spreading in epidemics often\nrequires more than just observed time-series data, especially at the beginning\nof a wave when data is limited. Traditional methods employ mechanistic models\nlike the SIR family, which make strong assumptions about the underlying\nspreading process, often represented as a small set of compact differential\nequations. Data-driven methods such as deep neural networks make no such\nassumptions and can capture the generative process in more detail, but fail in\nlong-term forecasting due to data limitations. We propose a new hybrid method\ncalled MP-PINN (Multi-Phase Physics-Informed Neural Network) to overcome the\nlimitations of these two major approaches. MP-PINN instils the spreading\nmechanism into a neural network, enabling the mechanism to update in phases\nover time, reflecting the dynamics of the epidemics due to policy\ninterventions. Experiments on COVID-19 waves demonstrate that MP-PINN achieves\nsuperior performance over pure data-driven or model-driven approaches for both\nshort-term and long-term forecasting.", "paper_summary_zh": "預測時間過程，例如流行病中的病毒傳播，通常需要的不僅僅是觀察到的時間序列資料，尤其是在資料有限的波浪開始時。傳統方法採用機械模型，例如 SIR 家族，對基礎傳播過程做出強有力的假設，通常表示為一組緊湊的微分方程式。資料驅動的方法，例如深度神經網路，沒有這樣的假設，並且可以更詳細地捕捉生成過程，但由於資料限制，長期預測會失敗。我們提出了一種新的混合方法，稱為 MP-PINN（多階段物理資訊神經網路），以克服這兩種主要方法的限制。MP-PINN 將傳播機制灌輸到神經網路中，使機制能夠隨著時間推移而分階段更新，反映由於政策干預而產生的流行病動態。對 COVID-19 波浪的實驗表明，MP-PINN 在短期和長期預測方面都優於純資料驅動或模型驅動的方法。", "author": "Thang Nguyen et.al.", "authors": "Thang Nguyen, Dung Nguyen, Kha Pham, Truyen Tran", "id": "2411.06781v1", "paper_url": "http://arxiv.org/abs/2411.06781v1", "repo": "null"}}