{"2412.07387": {"publish_time": "2024-12-10", "title": "Enhanced MRI Representation via Cross-series Masking", "paper_summary": "Magnetic resonance imaging (MRI) is indispensable for diagnosing and planning\ntreatment in various medical conditions due to its ability to produce\nmulti-series images that reveal different tissue characteristics. However,\nintegrating these diverse series to form a coherent analysis presents\nsignificant challenges, such as differing spatial resolutions and contrast\npatterns meanwhile requiring extensive annotated data, which is scarce in\nclinical practice. Due to these issues, we introduce a novel Cross-Series\nMasking (CSM) Strategy for effectively learning MRI representation in a\nself-supervised manner. Specifically, CSM commences by randomly sampling a\nsubset of regions and series, which are then strategically masked. In the\ntraining process, the cross-series representation is learned by utilizing the\nunmasked data to reconstruct the masked portions. This process not only\nintegrates information across different series but also facilitates the ability\nto model both intra-series and inter-series correlations and complementarities.\nWith the learned representation, the downstream tasks like segmentation and\nclassification are also enhanced. Taking brain tissue segmentation, breast\ntumor benign/malignant classification, and prostate cancer diagnosis as\nexamples, our method achieves state-of-the-art performance on both public and\nin-house datasets.", "paper_summary_zh": "磁振造影 (MRI) 對於診斷和規劃各種醫療狀況的治療至關重要，因為它能夠產生揭示不同組織特徵的多系列影像。然而，整合這些不同的系列以形成連貫的分析會帶來重大的挑戰，例如不同的空間解析度和對比模式，同時需要大量的註解資料，但在臨床實務中卻很稀少。由於這些問題，我們引入了一種新穎的跨系列遮罩 (CSM) 策略，以便以自我監督的方式有效地學習 MRI 表徵。具體來說，CSM 從隨機抽樣區域和系列的子集開始，然後對其進行策略性遮罩。在訓練過程中，跨系列表徵是透過利用未遮罩的資料來重建遮罩部分而學習的。這個過程不僅整合了不同系列的資訊，還促進了對系列內和系列間關聯性和互補性的建模能力。透過學習到的表徵，下游任務（例如分割和分類）也會得到增強。以腦組織分割、乳房腫瘤良性/惡性分類和前列腺癌診斷為例，我們的模型在公開資料集和內部資料集上都達到了最先進的效能。", "author": "Churan Wang et.al.", "authors": "Churan Wang, Fei Gao, Lijun Yan, Siwen Wang, Yizhou Yu, Yizhou Wang", "id": "2412.07387v1", "paper_url": "http://arxiv.org/abs/2412.07387v1", "repo": "null"}}