{"2405.07700": {"publish_time": "2024-05-13", "title": "Age-Dependent Analysis and Stochastic Generation of Child-Directed Speech", "paper_summary": "Child-directed speech (CDS) is a particular type of speech that adults use\nwhen addressing young children. Its properties also change as a function of\nextralinguistic factors, such as age of the child being addressed. Access to\nlarge amounts of representative and varied CDS would be useful for child\nlanguage research, as this would enable controlled computational modeling\nexperiments of infant language acquisition with realistic input in terms of\nquality and quantity. In this study, we describe an approach to model\nage-dependent linguistic properties of CDS using a language model (LM) trained\non CDS transcripts and ages of the recipient children, as obtained from North\nAmerican English corpora of the CHILDES database. The created LM can then be\nused to stochastically generate synthetic CDS transcripts in an age-appropriate\nmanner, thereby scaling beyond the original datasets in size. We compare\ncharacteristics of the generated CDS against the real speech addressed at\nchildren of different ages, showing that the LM manages to capture\nage-dependent changes in CDS, except for a slight difference in the effective\nvocabulary size. As a side product, we also provide a systematic\ncharacterization of age-dependent linguistic properties of CDS in CHILDES,\nillustrating how all measured aspects of the CDS change with children's age.", "paper_summary_zh": "兒童導向語言（CDS）是成人用於對幼兒說話的一種特殊語言類型。它的屬性也隨著非語言因素而改變，例如被稱呼兒童的年齡。獲得大量具有代表性和多樣性的 CDS 將有助於兒童語言研究，因為這將使受控的計算機建模實驗能夠以質量和數量方面的實際輸入來獲取嬰兒語言。在本研究中，我們描述了一種使用語言模型 (LM) 對 CDS 的年齡依賴性語言屬性進行建模的方法，該語言模型在 CDS 轉錄本和收件兒童的年齡上進行了訓練，這些年齡來自 CHILDES 資料庫的北美英語語料庫。然後，創建的 LM 可用於以適合年齡的方式隨機生成合成 CDS 轉錄本，從而擴展到原始數據集的大小。我們將生成的 CDS 的特徵與針對不同年齡兒童的真實語言進行比較，表明 LM 設法捕捉到 CDS 中與年齡相關的變化，除了有效詞彙量略有不同。作為附帶產品，我們還提供了 CHILDES 中 CDS 與年齡相關的語言屬性的系統表徵，說明 CDS 的所有測量方面如何隨著兒童年齡而改變。", "author": "Okko Räsänen et.al.", "authors": "Okko Räsänen, Daniil Kocharov", "id": "2405.07700v1", "paper_url": "http://arxiv.org/abs/2405.07700v1", "repo": "null"}}