{"2502.13917": {"publish_time": "2025-02-19", "title": "TESS 2: A Large-Scale Generalist Diffusion Language Model", "paper_summary": "We introduce TESS 2, a general instruction-following diffusion language model\nthat outperforms contemporary instruction-tuned diffusion models, as well as\nmatches and sometimes exceeds strong autoregressive (AR) models. We train TESS\n2 by first adapting a strong AR model via continued pretraining with the usual\ncross-entropy as diffusion loss, and then performing further instruction\ntuning. We find that adaptation training as well as the choice of the base\nmodel is crucial for training good instruction-following diffusion models. We\nfurther propose reward guidance, a novel and modular inference-time guidance\nprocedure to align model outputs without needing to train the underlying model.\nFinally, we show that TESS 2 further improves with increased inference-time\ncompute, highlighting the utility of diffusion LMs in having fine-grained\ncontrollability over the amount of compute used at inference time. Code and\nmodels are available at https://github.com/hamishivi/tess-2.", "paper_summary_zh": "我們引入了 TESS 2，一個一般指令追蹤擴散語言模型，它優於當代指令調整擴散模型，以及匹配和有時超過強大的自迴歸 (AR) 模型。我們透過持續預訓練，使用一般交叉熵作為擴散損失，來適應強大的 AR 模型，然後執行進一步的指令調整，來訓練 TESS 2。我們發現適應訓練以及基礎模型的選擇對於訓練良好的指令追蹤擴散模型至關重要。我們進一步提出獎勵引導，這是一種新穎且模組化的推論時間引導程序，用於在不需要訓練基礎模型的情況下對齊模型輸出。最後，我們展示 TESS 2 隨著推論時間運算的增加而進一步改善，突顯了擴散 LM 在推論時間對使用運算量的精細可控性方面的效用。程式碼和模型可在 https://github.com/hamishivi/tess-2 取得。", "author": "Jaesung Tae et.al.", "authors": "Jaesung Tae, Hamish Ivison, Sachin Kumar, Arman Cohan", "id": "2502.13917v1", "paper_url": "http://arxiv.org/abs/2502.13917v1", "repo": "null"}}