{"2407.02109": {"publish_time": "2024-07-02", "title": "HRSAM: Efficiently Segment Anything in High-Resolution Images", "paper_summary": "The Segment Anything Model (SAM) has significantly advanced interactive\nsegmentation but struggles with high-resolution images crucial for\nhigh-precision segmentation. This is primarily due to the quadratic space\ncomplexity of SAM-implemented attention and the length extrapolation issue in\ncommon global attention. This study proposes HRSAM that integrates Flash\nAttention and incorporates Plain, Shifted and newly proposed Cycle-scan Window\n(PSCWin) attention to address these issues. The shifted window attention is\nredesigned with padding to maintain consistent window sizes, enabling effective\nlength extrapolation. The cycle-scan window attention adopts the recently\ndeveloped State Space Models (SSMs) to ensure global information exchange with\nminimal computational overhead. Such window-based attention allows HRSAM to\nperform effective attention computations on scaled input images while\nmaintaining low latency. Moreover, we further propose HRSAM++ that additionally\nemploys a multi-scale strategy to enhance HRSAM's performance. The experiments\non the high-precision segmentation datasets HQSeg44K and DAVIS show that\nhigh-resolution inputs enable the SAM-distilled HRSAM models to outperform the\nteacher model while maintaining lower latency. Compared to the SOTAs, HRSAM\nachieves a 1.56 improvement in interactive segmentation's NoC95 metric with\nonly 31% of the latency. HRSAM++ further enhances the performance, achieving a\n1.63 improvement in NoC95 with just 38% of the latency.", "paper_summary_zh": "分段任何模型 (SAM) 已大幅提升互動式分段，但對於高解析度影像仍有困擾，而高解析度影像對於高精準分段至關重要。這主要是由於 SAM 實作注意力的二次空間複雜度和一般全域注意力的長度外推問題。本研究提出 HRSAM，整合 Flash 注意力，並納入 Plain、Shifted 和新提出的循環掃描視窗 (PSCWin) 注意力來解決這些問題。已重新設計帶有內補的移位視窗注意力，以維持一致的視窗大小，進而能有效長度外推。循環掃描視窗注意力採用最近開發的狀態空間模型 (SSM)，以確保全域資訊交換，且運算負擔極小。此類視窗式注意力讓 HRSAM 能對縮放輸入影像執行有效注意力運算，同時維持低延遲。此外，我們進一步提出 HRSAM++，它另外採用多重縮放策略來提升 HRSAM 的效能。在高精準度分段資料集 HQSeg44K 和 DAVIS 上的實驗顯示，高解析度輸入讓 SAM 提煉的 HRSAM 模型能優於教師模型，同時維持較低延遲。與 SOTAs 相較，HRSAM 在互動式分段的 NoC95 指標上提升了 1.56，但延遲僅有 31%。HRSAM++ 進一步提升效能，在 NoC95 上提升了 1.63，但延遲僅有 38%。", "author": "You Huang et.al.", "authors": "You Huang, Wenbin Lai, Jiayi Ji, Liujuan Cao, Shengchuan Zhang, Rongrong Ji", "id": "2407.02109v1", "paper_url": "http://arxiv.org/abs/2407.02109v1", "repo": "null"}}