{"2406.18120": {"publish_time": "2024-06-26", "title": "ArzEn-LLM: Code-Switched Egyptian Arabic-English Translation and Speech Recognition Using LLMs", "paper_summary": "Motivated by the widespread increase in the phenomenon of code-switching\nbetween Egyptian Arabic and English in recent times, this paper explores the\nintricacies of machine translation (MT) and automatic speech recognition (ASR)\nsystems, focusing on translating code-switched Egyptian Arabic-English to\neither English or Egyptian Arabic. Our goal is to present the methodologies\nemployed in developing these systems, utilizing large language models such as\nLLama and Gemma. In the field of ASR, we explore the utilization of the Whisper\nmodel for code-switched Egyptian Arabic recognition, detailing our experimental\nprocedures including data preprocessing and training techniques. Through the\nimplementation of a consecutive speech-to-text translation system that\nintegrates ASR with MT, we aim to overcome challenges posed by limited\nresources and the unique characteristics of the Egyptian Arabic dialect.\nEvaluation against established metrics showcases promising results, with our\nmethodologies yielding a significant improvement of $56\\%$ in English\ntranslation over the state-of-the-art and $9.3\\%$ in Arabic translation. Since\ncode-switching is deeply inherent in spoken languages, it is crucial that ASR\nsystems can effectively handle this phenomenon. This capability is crucial for\nenabling seamless interaction in various domains, including business\nnegotiations, cultural exchanges, and academic discourse. Our models and code\nare available as open-source resources. Code:\n\\url{http://github.com/ahmedheakl/arazn-llm}}, Models:\n\\url{http://huggingface.co/collections/ahmedheakl/arazn-llm-662ceaf12777656607b9524e}.", "paper_summary_zh": "在埃及阿拉伯语和英语中代码切换现象最近广泛增加的推动下，本文探讨了机器翻译 (MT) 和自动语音识别 (ASR) 系统的复杂性，重点翻译代码切换的埃及阿拉伯语-英语到英语或埃及阿拉伯语。我们的目标是展示用于开发这些系统的，利用大型语言模型（例如 LLama 和 Gemma）的方法。在 ASR 领域，我们探索了 Whisper 模型在代码切换的埃及阿拉伯语识别中的利用，详细介绍了我们的实验程序，包括数据预处理和训练技术。通过实施将 ASR 与 MT 集成的连续语音到文本翻译系统，我们旨在克服有限资源和埃及阿拉伯语方言的独特特征带来的挑战。针对既定指标的评估展示了有希望的结果，我们的方法在英语翻译中比最先进的方法提高了 56%，在阿拉伯语翻译中提高了 9.3%。由于代码切换深深植根于口语中，因此 ASR 系统能够有效处理此现象至关重要。此功能对于在包括商务谈判、文化交流和学术讨论在内的各个领域实现无缝交互至关重要。我们的模型和代码可用作开源资源。代码：\\url{http://github.com/ahmedheakl/arazn-llm}，模型：\\url{http://huggingface.co/collections/ahmedheakl/arazn-llm-662ceaf12777656607b9524e}。", "author": "Ahmed Heakl et.al.", "authors": "Ahmed Heakl, Youssef Zaghloul, Mennatullah Ali, Rania Hossam, Walid Gomaa", "id": "2406.18120v1", "paper_url": "http://arxiv.org/abs/2406.18120v1", "repo": "https://github.com/ahmedheakl/arazn-llm"}}