{"2405.04136": {"publish_time": "2024-05-07", "title": "Enriched BERT Embeddings for Scholarly Publication Classification", "paper_summary": "With the rapid expansion of academic literature and the proliferation of\npreprints, researchers face growing challenges in manually organizing and\nlabeling large volumes of articles. The NSLP 2024 FoRC Shared Task I addresses\nthis challenge organized as a competition. The goal is to develop a classifier\ncapable of predicting one of 123 predefined classes from the Open Research\nKnowledge Graph (ORKG) taxonomy of research fields for a given article.This\npaper presents our results. Initially, we enrich the dataset (containing\nEnglish scholarly articles sourced from ORKG and arXiv), then leverage\ndifferent pre-trained language Models (PLMs), specifically BERT, and explore\ntheir efficacy in transfer learning for this downstream task. Our experiments\nencompass feature-based and fine-tuned transfer learning approaches using\ndiverse PLMs, optimized for scientific tasks, including SciBERT, SciNCL, and\nSPECTER2. We conduct hyperparameter tuning and investigate the impact of data\naugmentation from bibliographic databases such as OpenAlex, Semantic Scholar,\nand Crossref. Our results demonstrate that fine-tuning pre-trained models\nsubstantially enhances classification performance, with SPECTER2 emerging as\nthe most accurate model. Moreover, enriching the dataset with additional\nmetadata improves classification outcomes significantly, especially when\nintegrating information from S2AG, OpenAlex and Crossref. Our best-performing\napproach achieves a weighted F1-score of 0.7415. Overall, our study contributes\nto the advancement of reliable automated systems for scholarly publication\ncategorization, offering a potential solution to the laborious manual curation\nprocess, thereby facilitating researchers in efficiently locating relevant\nresources.", "paper_summary_zh": "<paragraph>隨著學術文獻的快速擴展和預印本的激增，研究人員在手動組織和標記大量文章時面臨著越來越大的挑戰。NSLP 2024 FoRC 共享任務一以競賽的形式解決了這一挑戰。目標是開發一個分類器，能夠從給定文章的研究領域的開放研究知識圖譜 (ORKG) 分類法中預測 123 個預定義類別之一。本文展示了我們的成果。最初，我們豐富了數據集（包含來自 ORKG 和 arXiv 的英文學術文章），然後利用不同的預訓練語言模型 (PLM)，特別是 BERT，並探索它們在用於此下游任務的遷移學習中的功效。我們的實驗包括使用針對科學任務進行優化的各種 PLM 的基於特徵和微調的遷移學習方法，包括 SciBERT、SciNCL 和 SPECTER2。我們進行超參數調整，並研究來自 OpenAlex、Semantic Scholar 和 Crossref 等書目數據庫的數據增強的影響。我們的結果表明，微調預訓練模型可以顯著提高分類性能，而 SPECTER2 成為最準確的模型。此外，使用額外的元數據豐富數據集可以顯著改善分類結果，特別是在整合來自 S2AG、OpenAlex 和 Crossref 的信息時。我們性能最好的方法實現了 0.7415 的加權 F1 分數。總的來說，我們的研究有助於推進用於學術出版物分類的可靠自動化系統，為繁瑣的手動策展過程提供了一個潛在的解決方案，從而幫助研究人員有效地找到相關資源。</paragraph>", "author": "Benjamin Wolff et.al.", "authors": "Benjamin Wolff, Eva Seidlmayer, Konrad U. Förstner", "id": "2405.04136v1", "paper_url": "http://arxiv.org/abs/2405.04136v1", "repo": "null"}}