{"2410.14879": {"publish_time": "2024-10-18", "title": "Vital Insight: Assisting Experts' Context-Driven Sensemaking of Multi-modal Personal Tracking Data Using Visualization and Human-In-The-Loop LLM Agents", "paper_summary": "Passive tracking methods, such as phone and wearable sensing, have become\ndominant in monitoring human behaviors in modern ubiquitous computing studies.\nWhile there have been significant advances in machine-learning approaches to\ntranslate periods of raw sensor data to model momentary behaviors, (e.g.,\nphysical activity recognition), there still remains a significant gap in the\ntranslation of these sensing streams into meaningful, high-level, context-aware\ninsights that are required for various applications (e.g., summarizing an\nindividual's daily routine). To bridge this gap, experts often need to employ a\ncontext-driven sensemaking process in real-world studies to derive insights.\nThis process often requires manual effort and can be challenging even for\nexperienced researchers due to the complexity of human behaviors.\n  We conducted three rounds of user studies with 21 experts to explore\nsolutions to address challenges with sensemaking. We follow a human-centered\ndesign process to identify needs and design, iterate, build, and evaluate Vital\nInsight (VI), a novel, LLM-assisted, prototype system to enable\nhuman-in-the-loop inference (sensemaking) and visualizations of multi-modal\npassive sensing data from smartphones and wearables. Using the prototype as a\ntechnology probe, we observe experts' interactions with it and develop an\nexpert sensemaking model that explains how experts move between direct data\nrepresentations and AI-supported inferences to explore, question, and validate\ninsights. Through this iterative process, we also synthesize and discuss a list\nof design implications for the design of future AI-augmented visualization\nsystems to better assist experts' sensemaking processes in multi-modal health\nsensing data.", "paper_summary_zh": "<paragraph>被動追蹤方法，例如手機和穿戴式感測，已成為現代普適計算研究中監測人類行為的主要方法。雖然機器學習方法在將原始感測器數據轉換為瞬間行為模型（例如，身體活動識別）方面取得了重大進展，但在將這些感測串流轉換為各種應用程式所需的 meaningful、高階、上下文感知的洞察（例如，總結個人的日常生活）方面仍然存在顯著差距。為了彌合這一差距，專家們通常需要在現實世界的研究中採用上下文驅動的意義建構過程來獲得洞察。這個過程通常需要人工操作，而且由於人類行為的複雜性，即使對於經驗豐富的研究人員來說也可能具有挑戰性。我們與 21 位專家進行了三輪用戶研究，以探索解決意義建構挑戰的方案。我們遵循以人為本的設計流程來識別需求，並設計、迭代、構建和評估 Vital Insight (VI)，這是一個新穎的、LLM 輔助的原型系統，用於實現人機迴圈推理（意義建構）以及智慧型手機和穿戴式裝置的多模式被動感測數據的可視化。使用該原型作為技術探針，我們觀察專家與其的互動，並開發了一個專家意義建構模型，該模型解釋了專家如何在直接數據表示和 AI 支援的推論之間移動，以探索、質疑和驗證洞察。透過這個迭代過程，我們還綜合並討論了一系列設計意涵，以用於設計未來的 AI 增強型可視化系統，從而更好地協助專家在多模式健康感測數據中的意義建構過程。</paragraph>\n", "author": "Jiachen Li et.al.", "authors": "Jiachen Li, Xiwen Li, Justin Steinberg, Akshat Choube, Bingsheng Yao, Xuhai Xu, Dakuo Wang, Elizabeth Mynatt, Varun Mishra", "id": "2410.14879v2", "paper_url": "http://arxiv.org/abs/2410.14879v2", "repo": "null"}}