{"2405.05758": {"publish_time": "2024-05-09", "title": "Exploring the Potential of Human-LLM Synergy in Advancing Qualitative Analysis: A Case Study on Mental-Illness Stigma", "paper_summary": "Qualitative analysis is a challenging, yet crucial aspect of advancing\nresearch in the field of Human-Computer Interaction (HCI). Recent studies show\nthat large language models (LLMs) can perform qualitative coding within\nexisting schemes, but their potential for collaborative human-LLM discovery and\nnew insight generation in qualitative analysis is still underexplored. To\nbridge this gap and advance qualitative analysis by harnessing the power of\nLLMs, we propose CHALET, a novel methodology that leverages the human-LLM\ncollaboration paradigm to facilitate conceptualization and empower qualitative\nresearch. The CHALET approach involves LLM-supported data collection,\nperforming both human and LLM deductive coding to identify disagreements, and\nperforming collaborative inductive coding on these disagreement cases to derive\nnew conceptual insights. We validated the effectiveness of CHALET through its\napplication to the attribution model of mental-illness stigma, uncovering\nimplicit stigmatization themes on cognitive, emotional and behavioral\ndimensions. We discuss the implications for future research, methodology, and\nthe transdisciplinary opportunities CHALET presents for the HCI community and\nbeyond.", "paper_summary_zh": "質性分析是推進人機互動 (HCI) 領域研究的挑戰性但至關重要的方面。最近的研究表明，大型語言模型 (LLM) 能在現有架構中執行質性編碼，但它們在質性分析中進行協作式人機發現和產生新見解的潛力仍未得到充分探索。為了彌合這一差距，並透過利用 LLM 的力量推進質性分析，我們提出了 CHALET，一種創新的方法論，它利用人機協作範例來促進概念化並賦能質性研究。CHALET 方法涉及 LLM 支持的資料收集，執行人類和 LLM 演繹編碼以找出分歧，並對這些分歧案例執行協作式歸納編碼以得出新的概念見解。我們透過將 CHALET 應用於心理疾病污名歸因模型，驗證了其有效性，揭示了認知、情緒和行為面向的隱性污名化主題。我們討論了 CHALET 為 HCI 社群及其他領域帶來的未來研究、方法論和跨學科機會的影響。", "author": "Han Meng et.al.", "authors": "Han Meng, Yitian Yang, Yunan Li, Jungup Lee, Yi-Chieh Lee", "id": "2405.05758v1", "paper_url": "http://arxiv.org/abs/2405.05758v1", "repo": "null"}}