{"2502.09944": {"publish_time": "2025-02-14", "title": "Self-Supervised Learning for Neural Topic Models with Variance-Invariance-Covariance Regularization", "paper_summary": "In our study, we propose a self-supervised neural topic model (NTM) that\ncombines the power of NTMs and regularized self-supervised learning methods to\nimprove performance. NTMs use neural networks to learn latent topics hidden\nbehind the words in documents, enabling greater flexibility and the ability to\nestimate more coherent topics compared to traditional topic models. On the\nother hand, some self-supervised learning methods use a joint embedding\narchitecture with two identical networks that produce similar representations\nfor two augmented versions of the same input. Regularizations are applied to\nthese representations to prevent collapse, which would otherwise result in the\nnetworks outputting constant or redundant representations for all inputs. Our\nmodel enhances topic quality by explicitly regularizing latent topic\nrepresentations of anchor and positive samples. We also introduced an\nadversarial data augmentation method to replace the heuristic sampling method.\nWe further developed several variation models including those on the basis of\nan NTM that incorporates contrastive learning with both positive and negative\nsamples. Experimental results on three datasets showed that our models\noutperformed baselines and state-of-the-art models both quantitatively and\nqualitatively.", "paper_summary_zh": "在我們的研究中，我們提出了一個自我監督的神經主題模型 (NTM)，它結合了 NTM 的功能和正規化的自我監督學習方法來提升效能。NTM 使用神經網路來學習隱藏在文件字詞背後的潛在主題，與傳統主題模型相比，它能提供更大的彈性和估計出更一致的主題。另一方面，一些自我監督學習方法使用一個聯合嵌入架構，其中兩個相同的網路為同一個輸入的兩個擴充版本產生類似的表示。正規化會套用在這些表示上，以防止崩潰，否則會導致網路為所有輸入輸出恆定的或重複的表示。我們的模型透過明確正規化錨定樣本和正樣本的潛在主題表示來提升主題品質。我們也引進了一個對抗式資料擴充方法來取代啟發式抽樣方法。我們進一步開發了幾個變異模型，包括在 NTM 基礎上結合對比學習與正負樣本的模型。在三個資料集上的實驗結果顯示，我們的模型在質和量上都優於基準和最先進的模型。", "author": "Weiran Xu et.al.", "authors": "Weiran Xu, Kengo Hirami, Koji Eguchi", "id": "2502.09944v1", "paper_url": "http://arxiv.org/abs/2502.09944v1", "repo": "null"}}