{"2407.04258": {"publish_time": "2024-07-05", "title": "Unsupervised Video Summarization via Reinforcement Learning and a Trained Evaluator", "paper_summary": "This paper presents a novel approach for unsupervised video summarization\nusing reinforcement learning. It aims to address the existing limitations of\ncurrent unsupervised methods, including unstable training of adversarial\ngenerator-discriminator architectures and reliance on hand-crafted reward\nfunctions for quality evaluation. The proposed method is based on the concept\nthat a concise and informative summary should result in a reconstructed video\nthat closely resembles the original. The summarizer model assigns an importance\nscore to each frame and generates a video summary. In the proposed scheme,\nreinforcement learning, coupled with a unique reward generation pipeline, is\nemployed to train the summarizer model. The reward generation pipeline trains\nthe summarizer to create summaries that lead to improved reconstructions. It\ncomprises a generator model capable of reconstructing masked frames from a\npartially masked video, along with a reward mechanism that compares the\nreconstructed video from the summary against the original. The video generator\nis trained in a self-supervised manner to reconstruct randomly masked frames,\nenhancing its ability to generate accurate summaries. This training pipeline\nresults in a summarizer model that better mimics human-generated video\nsummaries compared to methods relying on hand-crafted rewards. The training\nprocess consists of two stable and isolated training steps, unlike adversarial\narchitectures. Experimental results demonstrate promising performance, with\nF-scores of 62.3 and 54.5 on TVSum and SumMe datasets, respectively.\nAdditionally, the inference stage is 300 times faster than our previously\nreported state-of-the-art method.", "paper_summary_zh": "<paragraph>本文提出了一個使用強化學習進行無監督影片摘要的新方法。它旨在解決現有無監督方法的限制，包括對抗生成器 - 判別器架構的不穩定訓練和依賴人工獎勵函數進行品質評估。所提出的方法基於這樣一個概念：簡潔且內容豐富的摘要應產生與原始影片非常相似的重建影片。摘要模型為每個畫面指定一個重要性分數並生成影片摘要。在所提出的方案中，強化學習與獨特的獎勵產生管道相結合，用於訓練摘要模型。獎勵產生管道訓練摘要模型以建立摘要，從而改善重建。它包含一個生成器模型，能夠從部分遮罩的影片中重建遮罩畫面，以及一個獎勵機制，用於比較摘要的重建影片與原始影片。影片生成器以自監督的方式進行訓練，以重建隨機遮罩的畫面，增強其生成準確摘要的能力。與依賴人工獎勵的方法相比，此訓練管道產生了一個摘要模型，可以更好地模擬人為生成的影片摘要。與對抗架構不同，訓練過程包含兩個穩定且孤立的訓練步驟。實驗結果證明了有希望的效能，在 TVSum 和 SumMe 資料集上的 F 分數分別為 62.3 和 54.5。此外，推論階段比我們先前報導的最新方法快 300 倍。</paragraph>", "author": "Mehryar Abbasi et.al.", "authors": "Mehryar Abbasi, Hadi Hadizadeh, Parvaneh Saeedi", "id": "2407.04258v1", "paper_url": "http://arxiv.org/abs/2407.04258v1", "repo": "null"}}