{"2410.21086": {"publish_time": "2024-10-28", "title": "Efficient Mixture-of-Expert for Video-based Driver State and Physiological Multi-task Estimation in Conditional Autonomous Driving", "paper_summary": "Road safety remains a critical challenge worldwide, with approximately 1.35\nmillion fatalities annually attributed to traffic accidents, often due to human\nerrors. As we advance towards higher levels of vehicle automation, challenges\nstill exist, as driving with automation can cognitively over-demand drivers if\nthey engage in non-driving-related tasks (NDRTs), or lead to drowsiness if\ndriving was the sole task. This calls for the urgent need for an effective\nDriver Monitoring System (DMS) that can evaluate cognitive load and drowsiness\nin SAE Level-2/3 autonomous driving contexts. In this study, we propose a novel\nmulti-task DMS, termed VDMoE, which leverages RGB video input to monitor driver\nstates non-invasively. By utilizing key facial features to minimize\ncomputational load and integrating remote Photoplethysmography (rPPG) for\nphysiological insights, our approach enhances detection accuracy while\nmaintaining efficiency. Additionally, we optimize the Mixture-of-Experts (MoE)\nframework to accommodate multi-modal inputs and improve performance across\ndifferent tasks. A novel prior-inclusive regularization method is introduced to\nalign model outputs with statistical priors, thus accelerating convergence and\nmitigating overfitting risks. We validate our method with the creation of a new\ndataset (MCDD), which comprises RGB video and physiological indicators from 42\nparticipants, and two public datasets. Our findings demonstrate the\neffectiveness of VDMoE in monitoring driver states, contributing to safer\nautonomous driving systems. The code and data will be released.", "paper_summary_zh": "道路安全仍然是全球面临的一项严峻挑战，每年约有 135 万人死于交通事故，通常是由于人为失误造成的。随着我们向更高水平的车辆自动化迈进，挑战仍然存在，因为如果驾驶员从事与驾驶无关的任务 (NDRT)，则使用自动化驾驶可能会在认知上对驾驶员提出过高要求，或者如果驾驶是唯一任务，则会导致驾驶员昏昏欲睡。这要求迫切需要一个有效的驾驶员监测系统 (DMS)，该系统可以在 SAE 2/3 级自动驾驶环境中评估认知负荷和嗜睡。在这项研究中，我们提出了一种新颖的多任务 DMS，称为 VDMoE，它利用 RGB 视频输入来非侵入性地监测驾驶员状态。通过利用关键面部特征来最大限度地减少计算负载，并整合远程光电容积描记术 (rPPG) 以获取生理见解，我们的方法提高了检测准确性，同时保持了效率。此外，我们优化了专家混合 (MoE) 框架以适应多模式输入并提高不同任务的性能。引入了一种新颖的先验包容正则化方法，以将模型输出与统计先验对齐，从而加速收敛并减轻过拟合风险。我们通过创建一个新数据集 (MCDD) 来验证我们的方法，该数据集包含来自 42 名参与者的 RGB 视频和生理指标，以及两个公共数据集。我们的研究结果证明了 VDMoE 在监测驾驶员状态方面的有效性，有助于实现更安全的自动驾驶系统。代码和数据将被释放。", "author": "Jiyao Wang et.al.", "authors": "Jiyao Wang, Xiao Yang, Zhenyu Wang, Ximeng Wei, Ange Wang, Dengbo He, Kaishun Wu", "id": "2410.21086v1", "paper_url": "http://arxiv.org/abs/2410.21086v1", "repo": "null"}}