{"2502.01969": {"publish_time": "2025-02-04", "title": "Mitigating Object Hallucinations in Large Vision-Language Models via Attention Calibration", "paper_summary": "Large Vision-Language Models (LVLMs) exhibit impressive multimodal reasoning\ncapabilities but remain highly susceptible to object hallucination, where\nmodels generate responses that are not factually aligned with the visual\ncontent. Recent works attribute this issue to an inherent bias of LVLMs where\nvision token attention map has a fixed correlation with spatial position, and\npropose to mitigate this issue by reordering visual tokens. However, we find\nthat different LVLMs exhibit different correlations between attention and\nspatial position, which makes the existing solution difficult to generalize to\nother LVLMs. To address this issue, we first introduce a training-free\nsolution, Uniform Attention Calibration (UAC), that estimates the bias from\nsingle meaningless input image and applies a calibration matrix to rectify\nattention imbalances. To further alleviate the bias, we relax the assumption of\nsingle meaningless input in UAC and introduce a fine-tuning solution, Dynamic\nAttention Calibration (DAC), that enforces the consistent outputs wherever the\nobject locates in the image via a plug-and-plays module. Comprehensive\nexperiments across multiple benchmarks demonstrate that UAC and DAC\nsignificantly reduce object hallucination while improving general multimodal\nalignment. Our methods achieve state-of-the-art performance across diverse LVLM\narchitectures on various metrics.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 展現出令人印象深刻的多模態推理能力，但仍極易受到物件幻覺的影響，其中模型會產生與視覺內容在事實上不一致的回應。最近的研究將此問題歸因於 LVLMs 的內在偏差，其中視覺標記注意力圖與空間位置具有固定的關聯性，並提出透過重新排序視覺標記來減輕此問題。然而，我們發現不同的 LVLMs 在注意力和空間位置之間展現出不同的關聯性，這使得現有的解決方案難以概括到其他 LVLMs。為了解決此問題，我們首先引入了一個免訓練解決方案，即均勻注意力校準 (UAC)，它從單一的無意義輸入影像中估計偏差，並套用校準矩陣來修正注意力失衡。為了進一步減輕偏差，我們放寬了 UAC 中單一無意義輸入的假設，並引入了一個微調解決方案，即動態注意力校準 (DAC)，它透過一個即插即用的模組，在物件位於影像中的任何位置，強制執行一致的輸出。跨多個基準的全面實驗證明，UAC 和 DAC 在改善一般多模態對齊的同時，顯著減少了物件幻覺。我們的技術在各種指標上，於不同的 LVLM 架構中，達到了最先進的效能。", "author": "Younan Zhu et.al.", "authors": "Younan Zhu, Linwei Tao, Minjing Dong, Chang Xu", "id": "2502.01969v1", "paper_url": "http://arxiv.org/abs/2502.01969v1", "repo": "null"}}