{"2410.05191": {"publish_time": "2024-10-07", "title": "LADEV: A Language-Driven Testing and Evaluation Platform for Vision-Language-Action Models in Robotic Manipulation", "paper_summary": "Building on the advancements of Large Language Models (LLMs) and Vision\nLanguage Models (VLMs), recent research has introduced Vision-Language-Action\n(VLA) models as an integrated solution for robotic manipulation tasks. These\nmodels take camera images and natural language task instructions as input and\ndirectly generate control actions for robots to perform specified tasks,\ngreatly improving both decision-making capabilities and interaction with human\nusers. However, the data-driven nature of VLA models, combined with their lack\nof interpretability, makes the assurance of their effectiveness and robustness\na challenging task. This highlights the need for a reliable testing and\nevaluation platform. For this purpose, in this work, we propose LADEV, a\ncomprehensive and efficient platform specifically designed for evaluating VLA\nmodels. We first present a language-driven approach that automatically\ngenerates simulation environments from natural language inputs, mitigating the\nneed for manual adjustments and significantly improving testing efficiency.\nThen, to further assess the influence of language input on the VLA models, we\nimplement a paraphrase mechanism that produces diverse natural language task\ninstructions for testing. Finally, to expedite the evaluation process, we\nintroduce a batch-style method for conducting large-scale testing of VLA\nmodels. Using LADEV, we conducted experiments on several state-of-the-art VLA\nmodels, demonstrating its effectiveness as a tool for evaluating these models.\nOur results showed that LADEV not only enhances testing efficiency but also\nestablishes a solid baseline for evaluating VLA models, paving the way for the\ndevelopment of more intelligent and advanced robotic systems.", "paper_summary_zh": "<paragraph>建立在大语言模型 (LLM) 和视觉语言模型 (VLM) 的进步之上，最近的研究引入了视觉语言动作 (VLA) 模型，作为机器人操作任务的集成解决方案。这些模型以相机图像和自然语言任务指令作为输入，并直接为机器人生成控制动作以执行指定任务，极大地提高了决策能力和与人类用户的交互。然而，VLA 模型的数据驱动特性及其缺乏可解释性，使得确保其有效性和鲁棒性成为一项具有挑战性的任务。这凸显了对可靠的测试和评估平台的需求。为此，在这项工作中，我们提出了 LADEV，这是一个专门为评估 VLA 模型而设计的全面且高效的平台。我们首先提出了一种语言驱动的方案，该方案可以根据自然语言输入自动生成仿真环境，从而减轻手动调整的需要并显著提高测试效率。然后，为了进一步评估语言输入对 VLA 模型的影响，我们实现了一个同义词转换机制，该机制会产生不同的自然语言任务指令进行测试。最后，为了加快评估过程，我们引入了一种批量方法来进行 VLA 模型的大规模测试。使用 LADEV，我们对几个最先进的 VLA 模型进行了实验，证明了它作为评估这些模型的工具的有效性。我们的结果表明，LADEV 不仅提高了测试效率，而且还为评估 VLA 模型建立了一个坚实的基础，为开发更智能、更先进的机器人系统铺平了道路。</paragraph>", "author": "Zhijie Wang et.al.", "authors": "Zhijie Wang, Zhehua Zhou, Jiayang Song, Yuheng Huang, Zhan Shu, Lei Ma", "id": "2410.05191v1", "paper_url": "http://arxiv.org/abs/2410.05191v1", "repo": "null"}}