{"2405.07248": {"publish_time": "2024-05-12", "title": "Limited Ability of LLMs to Simulate Human Psychological Behaviours: a Psychometric Analysis", "paper_summary": "The humanlike responses of large language models (LLMs) have prompted social\nscientists to investigate whether LLMs can be used to simulate human\nparticipants in experiments, opinion polls and surveys. Of central interest in\nthis line of research has been mapping out the psychological profiles of LLMs\nby prompting them to respond to standardized questionnaires. The conflicting\nfindings of this research are unsurprising given that mapping out underlying,\nor latent, traits from LLMs' text responses to questionnaires is no easy task.\nTo address this, we use psychometrics, the science of psychological\nmeasurement. In this study, we prompt OpenAI's flagship models, GPT-3.5 and\nGPT-4, to assume different personas and respond to a range of standardized\nmeasures of personality constructs. We used two kinds of persona descriptions:\neither generic (four or five random person descriptions) or specific (mostly\ndemographics of actual humans from a large-scale human dataset). We found that\nthe responses from GPT-4, but not GPT-3.5, using generic persona descriptions\nshow promising, albeit not perfect, psychometric properties, similar to human\nnorms, but the data from both LLMs when using specific demographic profiles,\nshow poor psychometrics properties. We conclude that, currently, when LLMs are\nasked to simulate silicon personas, their responses are poor signals of\npotentially underlying latent traits. Thus, our work casts doubt on LLMs'\nability to simulate individual-level human behaviour across multiple-choice\nquestion answering tasks.", "paper_summary_zh": "大型語言模型 (LLM) 的類人反應促使社會科學家探討 LLM 是否可用於模擬人類參與者進行實驗、民意調查和問卷調查。這條研究路線的重點是透過提示 LLM 回應標準化問卷，來描繪 LLM 的心理特徵。這項研究的相互矛盾的發現不足為奇，因為從 LLM 對問卷的文字回應中描繪出潛在特質並非易事。為了解決這個問題，我們使用了心理測量學，這是心理測量的科學。在這項研究中，我們提示 OpenAI 的旗艦模型 GPT-3.5 和 GPT-4 扮演不同的角色，並回應一系列標準化的人格結構測量。我們使用了兩種角色描述：通用（四或五個隨機人物描述）或具體（主要是來自大規模人類資料集的實際人類人口統計資料）。我們發現，GPT-4 的回應（但 GPT-3.5 沒有）使用通用角色描述顯示出有希望的，儘管不完美的心理測量屬性，類似於人類常態，但當使用特定人口統計特徵時，來自這兩個 LLM 的資料顯示出不佳的心理測量屬性。我們得出的結論是，目前，當要求 LLM 模擬矽晶角色時，他們的回應對於潛在的潛在特質而言是微弱的訊號。因此，我們的研究對 LLM 模擬多選題回答任務中的個人層級人類行為的能力提出質疑。", "author": "Nikolay B Petrov et.al.", "authors": "Nikolay B Petrov, Gregory Serapio-García, Jason Rentfrow", "id": "2405.07248v1", "paper_url": "http://arxiv.org/abs/2405.07248v1", "repo": "null"}}