{"2411.17983": {"publish_time": "2024-11-27", "title": "Optimized Conformal Selection: Powerful Selective Inference After Conformity Score Optimization", "paper_summary": "Model selection/optimization in conformal inference is challenging, since it\nmay break the exchangeability between labeled and unlabeled data. We study this\nproblem in the context of conformal selection, which uses conformal p-values to\nselect ``interesting'' instances with large unobserved labels from a pool of\nunlabeled data, while controlling the FDR in finite sample. For validity,\nexisting solutions require the model choice to be independent of the data used\nto construct the p-values and calibrate the selection set. However, when\npresented with many model choices and limited labeled data, it is desirable to\n(i) select the best model in a data-driven manner, and (ii) mitigate power loss\ndue to sample splitting.\n  This paper presents OptCS, a general framework that allows valid statistical\ntesting (selection) after flexible data-driven model optimization. We introduce\ngeneral conditions under which OptCS constructs valid conformal p-values\ndespite substantial data reuse and handles complex p-value dependencies to\nmaintain finite-sample FDR control via a novel multiple testing procedure. We\ninstantiate this general recipe to propose three FDR-controlling procedures,\neach optimizing the models differently: (i) selecting the most powerful one\namong multiple pre-trained candidate models, (ii) using all data for model\nfitting without sample splitting, and (iii) combining full-sample model fitting\nand selection. We demonstrate the efficacy of our methods via simulation\nstudies and real applications in drug discovery and alignment of large language\nmodels in radiology report generation.", "paper_summary_zh": "模型選擇/最佳化在共形推論中具有挑戰性，因為它可能會打破標籤和未標籤資料之間的可交換性。我們在共形選擇的背景下研究這個問題，共形選擇使用共形 p 值從未標籤資料池中選擇具有較大未觀察標籤的「有趣」實例，同時控制有限樣本中的 FDR。為了有效性，現有的解決方案要求模型選擇獨立於用於建構 p 值和校準選擇集的資料。然而，當面對許多模型選擇和有限標籤資料時，需要 (i) 以資料驅動的方式選擇最佳模型，以及 (ii) 減輕因樣本分割造成的功率損失。本文提出了 OptCS，這是一個通用框架，允許在彈性的資料驅動模型最佳化後進行有效的統計測試（選擇）。我們引入了 OptCS 在大量資料重複使用的情況下建構有效共形 p 值的一般條件，並透過創新的多重測試程序處理複雜的 p 值依賴性，以維持有限樣本 FDR 控制。我們實例化這個通用方法，提出了三個控制 FDR 的程序，每個程序以不同的方式最佳化模型：(i) 從多個預先訓練的候選模型中選擇功能最強大的模型，(ii) 使用所有資料進行模型擬合，不進行樣本分割，以及 (iii) 結合全樣本模型擬合和選擇。我們透過模擬研究和在藥物發現和放射學報告生成中對齊大型語言模型的實際應用，證明了我們方法的有效性。", "author": "Tian Bai et.al.", "authors": "Tian Bai, Ying Jin", "id": "2411.17983v1", "paper_url": "http://arxiv.org/abs/2411.17983v1", "repo": "null"}}