{"2412.11664": {"publish_time": "2024-12-16", "title": "C3oT: Generating Shorter Chain-of-Thought without Compromising Effectiveness", "paper_summary": "Generating Chain-of-Thought (CoT) before deriving the answer can effectively\nimprove the reasoning capabilities of large language models (LLMs) and\nsignificantly improve the accuracy of the generated answer. However, in most\ncases, the length of the generated CoT is much longer than the desired final\nanswer, which results in additional decoding costs. Furthermore, existing\nresearch has discovered that shortening the reasoning steps in CoT, even while\npreserving the key information, diminishes LLMs' abilities. These phenomena\nmake it difficult to use LLMs and CoT in many real-world applications that only\nrequire the final answer and are sensitive to latency, such as search and\nrecommendation. To reduce the costs of model decoding and shorten the length of\nthe generated CoT, this paper presents $\\textbf{C}$onditioned\n$\\textbf{C}$ompressed $\\textbf{C}$hain-of-$\\textbf{T}$hought (C3oT), a CoT\ncompression framework that involves a compressor to compress an original longer\nCoT into a shorter CoT while maintaining key information and interpretability,\na conditioned training method to train LLMs with both longer CoT and shorter\nCoT simultaneously to learn the corresponding relationships between them, and a\nconditioned inference method to gain the reasoning ability learned from longer\nCoT by generating shorter CoT. We conduct experiments over four datasets from\narithmetic and commonsense scenarios, showing that the proposed method is\ncapable of compressing the length of generated CoT by up to more than 50%\nwithout compromising its effectiveness.", "paper_summary_zh": "<paragraph>在推導出答案之前生成思維鏈（CoT）可以有效地提升大型語言模型（LLM）的推理能力，並顯著提升生成答案的準確度。然而，在多數情況下，生成的 CoT 長度遠大於期望的最終答案，這會造成額外的解碼成本。此外，現有研究發現，縮短 CoT 中的推理步驟，即使保留關鍵資訊，也會降低 LLM 的能力。這些現象使得在許多僅需要最終答案且對延遲敏感的實際應用中，難以使用 LLM 和 CoT，例如搜尋和推薦。為了降低模型解碼的成本並縮短生成的 CoT 長度，本文提出了條件壓縮思維鏈（C3oT），這是一個 CoT 壓縮架構，包含一個壓縮器，用於將原始較長的 CoT 壓縮成較短的 CoT，同時保留關鍵資訊和可解釋性，一個條件訓練方法，用於同時訓練具有較長 CoT 和較短 CoT 的 LLM，以學習它們之間的對應關係，以及一個條件推論方法，用於透過生成較短的 CoT，獲得從較長的 CoT 學到的推理能力。我們針對四個來自算術和常識場景的資料集進行實驗，結果顯示所提出的方法能夠將生成的 CoT 長度壓縮超過 50%，同時不損及它的有效性。</paragraph>", "author": "Yu Kang et.al.", "authors": "Yu Kang, Xianghui Sun, Liangyu Chen, Wei Zou", "id": "2412.11664v1", "paper_url": "http://arxiv.org/abs/2412.11664v1", "repo": "null"}}