{"2411.15007": {"publish_time": "2024-11-22", "title": "FTA generation using GenAI with an Autonomy sensor Usecase", "paper_summary": "Functional safety forms an important aspect in the design of systems. Its\nemphasis on the automotive industry has evolved significantly over the years.\nTill date many methods have been developed to get appropriate FTA(Fault Tree\nanalysis) for various scenarios and features pertaining to Autonomous Driving.\nThis paper is an attempt to explore the scope of using Generative Artificial\nIntelligence(GenAI) in order to develop Fault Tree Analysis(FTA) with the use\ncase of malfunction for the Lidar sensor in mind. We explore various available\nopen source Large Language Models(LLM) models and then dive deep into one of\nthem to study its responses and provide our analysis. This paper successfully\nshows the possibility to train existing Large Language models through Prompt\nEngineering for fault tree analysis for any Autonomy usecase aided with\nPlantUML tool.", "paper_summary_zh": "功能安全在系統設計中形成了一個重要的面向。它對汽車產業的重視多年來已顯著演變。迄今為止，已經開發出許多方法來取得各種情境和與自動駕駛相關特性的適當 FTA（故障樹分析）。本文嘗試探討使用生成式人工智慧 (GenAI) 的範圍，以便開發故障樹分析 (FTA)，並以光達感測器的故障用例為考量。我們探討各種可用的開源大型語言模型 (LLM) 模型，然後深入探討其中一個模型以研究其回應並提供我們的分析。本文成功展示了透過提示工程訓練現有大型語言模型的可能性，以進行任何自主用例的故障樹分析，並輔以 PlantUML 工具。", "author": "Sneha Sudhir Shetiya et.al.", "authors": "Sneha Sudhir Shetiya, Divya Garikapati, Veeraja Sohoni", "id": "2411.15007v1", "paper_url": "http://arxiv.org/abs/2411.15007v1", "repo": "null"}}