{"2405.10852": {"publish_time": "2024-05-17", "title": "KernelSHAP-IQ: Weighted Least-Square Optimization for Shapley Interactions", "paper_summary": "The Shapley value (SV) is a prevalent approach of allocating credit to\nmachine learning (ML) entities to understand black box ML models. Enriching\nsuch interpretations with higher-order interactions is inevitable for complex\nsystems, where the Shapley Interaction Index (SII) is a direct axiomatic\nextension of the SV. While it is well-known that the SV yields an optimal\napproximation of any game via a weighted least square (WLS) objective, an\nextension of this result to SII has been a long-standing open problem, which\neven led to the proposal of an alternative index. In this work, we characterize\nhigher-order SII as a solution to a WLS problem, which constructs an optimal\napproximation via SII and $k$-Shapley values ($k$-SII). We prove this\nrepresentation for the SV and pairwise SII and give empirically validated\nconjectures for higher orders. As a result, we propose KernelSHAP-IQ, a direct\nextension of KernelSHAP for SII, and demonstrate state-of-the-art performance\nfor feature interactions.", "paper_summary_zh": "Shapley 值 (SV) 是一種普遍用於將信用分配給機器學習 (ML) 實體的方法，以了解黑盒 ML 模型。對於複雜系統，以高階互動豐富此類解釋是不可避免的，其中 Shapley 互動指數 (SII) 是 SV 的直接公理延伸。雖然眾所周知，SV 通過加權最小二乘 (WLS) 目標產生任何遊戲的最佳近似，但將此結果擴展到 SII 一直是一個長期存在的開放問題，甚至導致提出替代指數。在這項工作中，我們將高階 SII 描述為 WLS 問題的解，該問題通過 SII 和 $k$-Shapley 值 ($k$-SII) 構建最佳近似。我們證明了 SV 和成對 SII 的這個表示，並給出經驗驗證的高階猜想。因此，我們提出了 KernelSHAP-IQ，這是 KernelSHAP 的直接擴展，用於 SII，並展示了特徵互動的最新性能。", "author": "Fabian Fumagalli et.al.", "authors": "Fabian Fumagalli, Maximilian Muschalik, Patrick Kolpaczki, Eyke Hüllermeier, Barbara Hammer", "id": "2405.10852v1", "paper_url": "http://arxiv.org/abs/2405.10852v1", "repo": "null"}}