{"2411.16002": {"publish_time": "2024-11-24", "title": "Exploring Performance Contrasts in TableQA: Step-by-Step Reasoning Boosts Bigger Language Models, Limits Smaller Language Models", "paper_summary": "This paper proposes a detailed prompting flow, termed Table-Logic, to\ninvestigate the performance contrasts between bigger and smaller language\nmodels (LMs) utilizing step-by-step reasoning methods in the TableQA task. The\nmethod processes tasks by sequentially identifying critical columns and rows\ngiven question and table with its structure, determining necessary\naggregations, calculations, or comparisons, and finally inferring the results\nto generate a precise prediction. By deploying this method, we observe a 7.8%\naccuracy improvement in bigger LMs like Llama-3-70B compared to the vanilla on\nHybridQA, while smaller LMs like Llama-2-7B shows an 11% performance decline.\nWe empirically investigate the potential causes of performance contrasts by\nexploring the capabilities of bigger and smaller LMs from various dimensions in\nTableQA task. Our findings highlight the limitations of the step-by-step\nreasoning method in small models and provide potential insights for making\nimprovements.", "paper_summary_zh": "這篇論文提出了詳盡的提示流程，稱為 Table-Logic，以探討在 TableQA 任務中利用逐步推理方法的大型和小型語言模型 (LM) 之間的效能對比。此方法透過按順序識別關鍵欄位和列（給定問題和表格及其結構）、決定必要的彙總、計算或比較，最後推論結果以產生精確預測，來處理任務。透過部署此方法，我們觀察到 Llama-3-70B 等大型 LM 在 HybridQA 上的準確度提升了 7.8%，而 Llama-2-7B 等小型 LM 則顯示出效能下降 11%。我們透過探索大型和小型 LM 在 TableQA 任務中各方面的能力，實證調查效能對比的潛在原因。我們的發現突顯了小型模型中逐步推理方法的限制，並提供潛在見解以進行改進。", "author": "Haoyan Yang et.al.", "authors": "Haoyan Yang, Yixuan Wang, Keyue Tong, Hongjin Zhu, Yuanxin Zhang", "id": "2411.16002v1", "paper_url": "http://arxiv.org/abs/2411.16002v1", "repo": "null"}}