{"2412.06314": {"publish_time": "2024-12-09", "title": "CAD-Unet: A Capsule Network-Enhanced Unet Architecture for Accurate Segmentation of COVID-19 Lung Infections from CT Images", "paper_summary": "Since the outbreak of the COVID-19 pandemic in 2019, medical imaging has\nemerged as a primary modality for diagnosing COVID-19 pneumonia. In clinical\nsettings, the segmentation of lung infections from computed tomography images\nenables rapid and accurate quantification and diagnosis of COVID-19.\nSegmentation of COVID-19 infections in the lungs poses a formidable challenge,\nprimarily due to the indistinct boundaries and limited contrast presented by\nground glass opacity manifestations. Moreover, the confounding similarity\nbetween infiltrates, lung tissues, and lung walls further complicates this\nsegmentation task. To address these challenges, this paper introduces a novel\ndeep network architecture, called CAD-Unet, for segmenting COVID-19 lung\ninfections. In this architecture, capsule networks are incorporated into the\nexisting Unet framework. Capsule networks represent a novel network\narchitecture that differs from traditional convolutional neural networks. They\nutilize vectors for information transfer among capsules, facilitating the\nextraction of intricate lesion spatial information. Additionally, we design a\ncapsule encoder path and establish a coupling path between the unet encoder and\nthe capsule encoder. This design maximizes the complementary advantages of both\nnetwork structures while achieving efficient information fusion. \\noindent\nFinally, extensive experiments are conducted on four publicly available\ndatasets, encompassing binary segmentation tasks and multi-class segmentation\ntasks. The experimental results demonstrate the superior segmentation\nperformance of the proposed model. The code has been released at:\nhttps://github.com/AmanoTooko-jie/CAD-Unet.", "paper_summary_zh": "自 2019 年 COVID-19 大流行爆发以来，医学影像已成为诊断 COVID-19 肺炎的主要方式。在临床环境中，从计算机断层扫描图像中分割肺部感染，可以快速、准确地量化和诊断 COVID-19。分割肺部中的 COVID-19 感染是一个艰巨的挑战，这主要是由于毛玻璃样变现出的边界不清晰且对比度有限。此外，浸润、肺组织和肺壁之间的混淆相似性进一步复杂化了这项分割任务。为了应对这些挑战，本文介绍了一种新颖的深度网络架构，称为 CAD-Unet，用于分割 COVID-19 肺部感染。在此架构中，胶囊网络被纳入现有的 Unet 框架中。胶囊网络代表了一种新颖的网络架构，它不同于传统的卷积神经网络。它们利用向量在胶囊之间进行信息传输，促进了复杂病变空间信息的提取。此外，我们设计了一个胶囊编码器路径，并在 unet 编码器和胶囊编码器之间建立了一个耦合路径。这种设计最大限度地发挥了两种网络结构的互补优势，同时实现了高效的信息融合。\\noindent\n最后，在四个公开可用的数据集上进行了广泛的实验，包括二进制分割任务和多类分割任务。实验结果证明了所提出模型的卓越分割性能。该代码已发布在：\nhttps://github.com/AmanoTooko-jie/CAD-Unet。", "author": "Yijie Dang et.al.", "authors": "Yijie Dang, Weijun Ma, Xiaohu Luo", "id": "2412.06314v1", "paper_url": "http://arxiv.org/abs/2412.06314v1", "repo": "null"}}