{"2410.11772": {"publish_time": "2024-10-15", "title": "Layer-wise Importance Matters: Less Memory for Better Performance in Parameter-efficient Fine-tuning of Large Language Models", "paper_summary": "Parameter-Efficient Fine-Tuning (PEFT) methods have gained significant\npopularity for adapting pre-trained Large Language Models (LLMs) to downstream\ntasks, primarily due to their potential to significantly reduce memory and\ncomputational overheads. However, a common limitation in most PEFT approaches\nis their application of a uniform architectural design across all layers. This\nuniformity involves identical trainable modules and ignores the varying\nimportance of each layer, leading to sub-optimal fine-tuning results. To\novercome the above limitation and obtain better performance, we develop a novel\napproach, Importance-aware Sparse Tuning (IST), to fully utilize the inherent\nsparsity and select the most important subset of full layers with effective\nlayer-wise importance scoring. The proposed IST is a versatile and\nplug-and-play technique compatible with various PEFT methods that operate on a\nper-layer basis. By leveraging the estimated importance scores, IST dynamically\nupdates these selected layers in PEFT modules, leading to reduced memory\ndemands. We further provide theoretical proof of convergence and empirical\nevidence of superior performance to demonstrate the advantages of IST over\nuniform updating strategies. Extensive experiments on a range of LLMs, PEFTs,\nand downstream tasks substantiate the effectiveness of our proposed method,\nshowcasing IST's capacity to enhance existing layer-based PEFT methods. Our\ncode is available at https://github.com/Kaiseem/IST.", "paper_summary_zh": "參數高效微調 (PEFT) 方法因其將預先訓練的大型語言模型 (LLM) 適應至下游任務而獲得顯著的普及，這主要歸功於它們大幅減少記憶體和運算負擔的潛力。然而，大多數 PEFT 方法的常見限制是它們在所有層中套用統一的架構設計。這種統一性包含相同的可訓練模組，並忽略每個層不同的重要性，導致次佳的微調結果。為了克服上述限制並獲得更好的效能，我們開發了一種新穎的方法，即重視稀疏調整 (IST)，以充分利用內在的稀疏性，並透過有效的逐層重要性評分來選擇最重要的完整層子集。所提出的 IST 是一種通用且即插即用的技術，與各種基於逐層運作的 PEFT 方法相容。透過利用估計的重要性分數，IST 動態更新 PEFT 模組中這些選定的層，從而減少記憶體需求。我們進一步提供了收斂的理論證明和優異效能的實證證據，以證明 IST 優於統一更新策略的優點。針對各種 LLM、PEFT 和下游任務進行的廣泛實驗證實了我們所提出的方法的有效性，展示了 IST 增強現有基於層的 PEFT 方法的能力。我們的程式碼可在 https://github.com/Kaiseem/IST 取得。", "author": "Kai Yao et.al.", "authors": "Kai Yao, Penlei Gao, Lichun Li, Yuan Zhao, Xiaofeng Wang, Wei Wang, Jianke Zhu", "id": "2410.11772v1", "paper_url": "http://arxiv.org/abs/2410.11772v1", "repo": "https://github.com/kaiseem/ist"}}