{"2409.17583": {"publish_time": "2024-09-26", "title": "Let the Quantum Creep In: Designing Quantum Neural Network Models by Gradually Swapping Out Classical Components", "paper_summary": "Artificial Intelligence (AI), with its multiplier effect and wide\napplications in multiple areas, could potentially be an important application\nof quantum computing. Since modern AI systems are often built on neural\nnetworks, the design of quantum neural networks becomes a key challenge in\nintegrating quantum computing into AI. To provide a more fine-grained\ncharacterisation of the impact of quantum components on the performance of\nneural networks, we propose a framework where classical neural network layers\nare gradually replaced by quantum layers that have the same type of input and\noutput while keeping the flow of information between layers unchanged,\ndifferent from most current research in quantum neural network, which favours\nan end-to-end quantum model. We start with a simple three-layer classical\nneural network without any normalisation layers or activation functions, and\ngradually change the classical layers to the corresponding quantum versions. We\nconduct numerical experiments on image classification datasets such as the\nMNIST, FashionMNIST and CIFAR-10 datasets to demonstrate the change of\nperformance brought by the systematic introduction of quantum components.\nThrough this framework, our research sheds new light on the design of future\nquantum neural network models where it could be more favourable to search for\nmethods and frameworks that harness the advantages from both the classical and\nquantum worlds.", "paper_summary_zh": "人工智慧（AI）具有乘數效應，並在多個領域廣泛應用，潛在可能成為量子運算的重要應用。由於現代 AI 系統通常建立於神經網路，量子神經網路的設計成為整合量子運算至 AI 的關鍵挑戰。為了更細緻地描述量子元件對神經網路效能的影響，我們提出一個架構，其中古典神經網路層逐漸被量子層取代，而量子層具有相同類型的輸入和輸出，同時保持層間資訊流動不變，這有別於大多數現今偏好端到端量子模型的量子神經網路研究。我們從一個簡單的三層古典神經網路開始，不含任何正規化層或啟用函數，並逐漸將古典層改為對應的量子版本。我們對 MNIST、FashionMNIST 和 CIFAR-10 等影像分類資料集進行數值實驗，以展示系統導入量子元件所帶來的效能變化。透過這個架構，我們的研究為未來量子神經網路模型的設計開啟新視野，其中尋找結合古典世界和量子世界優勢的方法和架構可能更為有利。", "author": "Peiyong Wang et.al.", "authors": "Peiyong Wang, Casey. R. Myers, Lloyd C. L. Hollenberg, Udaya Parampalli", "id": "2409.17583v1", "paper_url": "http://arxiv.org/abs/2409.17583v1", "repo": "https://github.com/peiyong-addwater/let-the-quantum-creep-in"}}