{"2406.03869": {"publish_time": "2024-06-06", "title": "Recovering document annotations for sentence-level bitext", "paper_summary": "Data availability limits the scope of any given task. In machine translation,\nhistorical models were incapable of handling longer contexts, so the lack of\ndocument-level datasets was less noticeable. Now, despite the emergence of\nlong-sequence methods, we remain within a sentence-level paradigm and without\ndata to adequately approach context-aware machine translation. Most large-scale\ndatasets have been processed through a pipeline that discards document-level\nmetadata. In this work, we reconstruct document-level information for three\n(ParaCrawl, News Commentary, and Europarl) large datasets in German, French,\nSpanish, Italian, Polish, and Portuguese (paired with English). We then\nintroduce a document-level filtering technique as an alternative to traditional\nbitext filtering. We present this filtering with analysis to show that this\nmethod prefers context-consistent translations rather than those that may have\nbeen sentence-level machine translated. Last we train models on these longer\ncontexts and demonstrate improvement in document-level translation without\ndegradation of sentence-level translation. We release our dataset, ParaDocs,\nand resulting models as a resource to the community.", "paper_summary_zh": "<paragraph>資料可得性限制了任何特定任務的範圍。在機器翻譯中，歷史模型無法處理較長的語境，因此較不重視文件層級資料集的缺乏。現在，儘管出現了長序列方法，我們仍處於句子層級的範例中，且沒有足夠的資料來適當地進行考量語境的機器翻譯。大多數大型資料集已透過會捨棄文件層級元資料的管道進行處理。在這項工作中，我們針對德文、法文、西班牙文、義大利文、波蘭文和葡萄牙文（與英文配對）的三個大型資料集（ParaCrawl、新聞評論和歐議會）重建文件層級資訊。然後，我們引入文件層級篩選技術，作為傳統雙語文本篩選的替代方案。我們提出此篩選並進行分析，以顯示此方法偏好語境一致的翻譯，而不是可能已進行句子層級機器翻譯的翻譯。最後，我們針對這些較長的語境訓練模型，並證明文件層級翻譯有所進步，而句子層級翻譯並未下降。我們將我們的資料集 ParaDocs 和產生的模型釋出，作為社群的資源。</paragraph>", "author": "Rachel Wicks et.al.", "authors": "Rachel Wicks, Matt Post, Philipp Koehn", "id": "2406.03869v1", "paper_url": "http://arxiv.org/abs/2406.03869v1", "repo": "null"}}