{"2412.12948": {"publish_time": "2024-12-17", "title": "MOPO: Multi-Objective Prompt Optimization for Affective Text Generation", "paper_summary": "How emotions are expressed depends on the context and domain. On X (formerly\nTwitter), for instance, an author might simply use the hashtag #anger, while in\na news headline, emotions are typically written in a more polite, indirect\nmanner. To enable conditional text generation models to create emotionally\nconnotated texts that fit a domain, users need to have access to a parameter\nthat allows them to choose the appropriate way to express an emotion. To\nachieve this, we introduce MOPO, a Multi-Objective Prompt Optimization\nmethodology. MOPO optimizes prompts according to multiple objectives (which\ncorrespond here to the output probabilities assigned by emotion classifiers\ntrained for different domains). In contrast to single objective optimization,\nMOPO outputs a set of prompts, each with a different weighting of the multiple\nobjectives. Users can then choose the most appropriate prompt for their\ncontext. We evaluate MOPO using three objectives, determined by various\ndomain-specific emotion classifiers. MOPO improves performance by up to 15 pp\nacross all objectives with a minimal loss (1-2 pp) for any single objective\ncompared to single-objective optimization. These minor performance losses are\noffset by a broader generalization across multiple objectives - which is not\npossible with single-objective optimization. Additionally, MOPO reduces\ncomputational requirements by simultaneously optimizing for multiple\nobjectives, eliminating separate optimization procedures for each objective.", "paper_summary_zh": "情緒的表達方式取決於脈絡和領域。例如，在 X（前身為 Twitter）上，作者可能只會使用標籤 #憤怒，而在新聞標題中，情緒通常會用更禮貌、間接的方式寫成。為了讓條件式文字生成模型能夠建立符合某個領域的情緒內涵文字，使用者需要存取一個參數，讓他們能夠選擇適當的方式表達情緒。為了達成此目的，我們引入了 MOPO，一種多目標提示最佳化方法。MOPO 會根據多個目標最佳化提示（在此對應於為不同領域訓練的情緒分類器所分配的輸出機率）。與單一目標最佳化不同，MOPO 會輸出一個提示組，每個提示組對多個目標的加權不同。然後，使用者可以選擇最適合其脈絡的提示。我們使用三個目標來評估 MOPO，這些目標由各種特定領域的情緒分類器決定。MOPO 將所有目標的效能提升了 15 pp，與單一目標最佳化相比，任何單一目標的損失都很小（1-2 pp）。這些微小的效能損失會被跨多個目標更廣泛的概化所抵銷，而這在單一目標最佳化中是不可能的。此外，MOPO 透過同時最佳化多個目標來減少運算需求，消除了針對每個目標的個別最佳化程序。", "author": "Yarik Menchaca Resendiz et.al.", "authors": "Yarik Menchaca Resendiz, Roman Klinger", "id": "2412.12948v1", "paper_url": "http://arxiv.org/abs/2412.12948v1", "repo": "null"}}