{"2410.14368": {"publish_time": "2024-10-18", "title": "CoMAL: Collaborative Multi-Agent Large Language Models for Mixed-Autonomy Traffic", "paper_summary": "The integration of autonomous vehicles into urban traffic has great potential\nto improve efficiency by reducing congestion and optimizing traffic flow\nsystematically. In this paper, we introduce CoMAL (Collaborative Multi-Agent\nLLMs), a framework designed to address the mixed-autonomy traffic problem by\ncollaboration among autonomous vehicles to optimize traffic flow. CoMAL is\nbuilt upon large language models, operating in an interactive traffic\nsimulation environment. It utilizes a Perception Module to observe surrounding\nagents and a Memory Module to store strategies for each agent. The overall\nworkflow includes a Collaboration Module that encourages autonomous vehicles to\ndiscuss the effective strategy and allocate roles, a reasoning engine to\ndetermine optimal behaviors based on assigned roles, and an Execution Module\nthat controls vehicle actions using a hybrid approach combining rule-based\nmodels. Experimental results demonstrate that CoMAL achieves superior\nperformance on the Flow benchmark. Additionally, we evaluate the impact of\ndifferent language models and compare our framework with reinforcement learning\napproaches. It highlights the strong cooperative capability of LLM agents and\npresents a promising solution to the mixed-autonomy traffic challenge. The code\nis available at https://github.com/Hyan-Yao/CoMAL.", "paper_summary_zh": "自動駕駛車輛整合到都市交通中，有很大的潛力可以透過減少擁堵和系統性地最佳化交通流量來提升效率。在本文中，我們介紹 CoMAL（協作多重代理 LLM），一個旨在透過自動駕駛車輛之間的協作來最佳化交通流量，以解決混合自動化交通問題的架構。CoMAL 建立在大型語言模型之上，在互動式交通模擬環境中運作。它利用感知模組來觀察周圍的代理，並利用記憶模組來儲存每位代理的策略。整體工作流程包含一個協作模組，鼓勵自動駕駛車輛討論有效的策略並分配角色；一個推理引擎，根據分配的角色來決定最佳行為；以及一個執行模組，使用結合規則式模型的混合方法來控制車輛動作。實驗結果顯示，CoMAL 在 Flow 基準測試中取得優異的表現。此外，我們評估不同語言模型的影響，並將我們的架構與強化學習方法進行比較。它突顯了 LLM 代理強大的合作能力，並為混合自動化交通挑戰提供了有希望的解決方案。程式碼可在 https://github.com/Hyan-Yao/CoMAL 取得。", "author": "Huaiyuan Yao et.al.", "authors": "Huaiyuan Yao, Longchao Da, Vishnu Nandam, Justin Turnau, Zhiwei Liu, Linsey Pang, Hua Wei", "id": "2410.14368v1", "paper_url": "http://arxiv.org/abs/2410.14368v1", "repo": "https://github.com/hyan-yao/comal"}}