{"2405.02485": {"publish_time": "2024-05-03", "title": "A Survey of Few-Shot Learning for Biomedical Time Series", "paper_summary": "Advancements in wearable sensor technologies and the digitization of medical\nrecords have contributed to the unprecedented ubiquity of biomedical time\nseries data. Data-driven models have tremendous potential to assist clinical\ndiagnosis and improve patient care by improving long-term monitoring\ncapabilities, facilitating early disease detection and intervention, as well as\npromoting personalized healthcare delivery. However, accessing extensively\nlabeled datasets to train data-hungry deep learning models encounters many\nbarriers, such as long-tail distribution of rare diseases, cost of annotation,\nprivacy and security concerns, data-sharing regulations, and ethical\nconsiderations. An emerging approach to overcome the scarcity of labeled data\nis to augment AI methods with human-like capabilities to leverage past\nexperiences to learn new tasks with limited examples, called few-shot learning.\nThis survey provides a comprehensive review and comparison of few-shot learning\nmethods for biomedical time series applications. The clinical benefits and\nlimitations of such methods are discussed in relation to traditional\ndata-driven approaches. This paper aims to provide insights into the current\nlandscape of few-shot learning for biomedical time series and its implications\nfor future research and applications.", "paper_summary_zh": "<paragraph>可穿戴式感測器技術的進步和醫療記錄的數位化促成了生物醫學時間序列資料前所未有的普遍性。資料驅動的模型具有巨大的潛力，可協助臨床診斷並透過改善長期監控能力、促進早期疾病偵測和干預，以及推廣個人化醫療保健服務來改善患者照護。然而，取得標籤廣泛的資料集以訓練資料密集的深度學習模型會遇到許多障礙，例如罕見疾病的長尾分佈、註解成本、隱私和安全問題、資料共享法規和倫理考量。克服標籤資料稀缺性的新興方法是擴充 AI 方法，賦予其類似人類的能力，以利用過去的經驗，透過有限的範例來學習新任務，這稱為少量學習。這份調查提供了對生物醫學時間序列應用中少量學習方法的全面回顧和比較。此類方法的臨床效益和限制與傳統資料驅動方法相關。本文旨在深入探討生物醫學時間序列少量學習的當前概況及其對未來研究和應用之影響。</paragraph>", "author": "Chenqi Li et.al.", "authors": "Chenqi Li, Timothy Denison, Tingting Zhu", "id": "2405.02485v1", "paper_url": "http://arxiv.org/abs/2405.02485v1", "repo": "null"}}