{"2407.05599": {"publish_time": "2024-07-08", "title": "Generative Debunking of Climate Misinformation", "paper_summary": "Misinformation about climate change causes numerous negative impacts,\nnecessitating corrective responses. Psychological research has offered various\nstrategies for reducing the influence of climate misinformation, such as the\nfact-myth-fallacy-fact-structure. However, practically implementing corrective\ninterventions at scale represents a challenge. Automatic detection and\ncorrection of misinformation offers a solution to the misinformation problem.\nThis study documents the development of large language models that accept as\ninput a climate myth and produce a debunking that adheres to the\nfact-myth-fallacy-fact (``truth sandwich'') structure, by incorporating\ncontrarian claim classification and fallacy detection into an LLM prompting\nframework. We combine open (Mixtral, Palm2) and proprietary (GPT-4) LLMs with\nprompting strategies of varying complexity. Experiments reveal promising\nperformance of GPT-4 and Mixtral if combined with structured prompts. We\nidentify specific challenges of debunking generation and human evaluation, and\nmap out avenues for future work. We release a dataset of high-quality\ntruth-sandwich debunkings, source code and a demo of the debunking system.", "paper_summary_zh": "氣候變遷的錯誤資訊造成許多負面影響，需要採取矯正措施。心理學研究提供了各種策略來減少氣候錯誤資訊的影響，例如事實-迷思-謬誤-事實結構。然而，實際大規模實施矯正措施是一項挑戰。自動偵測和更正錯誤資訊為錯誤資訊問題提供了解決方案。本研究記錄了大型語言模型的開發，這些模型接受氣候迷思作為輸入，並產生符合事實-迷思-謬誤-事實（「真相三明治」）結構的揭穿，方法是將反向主張分類和謬誤偵測納入 LLM 提示架構中。我們將開放（Mixtral、Palm2）和專有（GPT-4）LLM 與複雜度不同的提示策略結合起來。實驗顯示，如果與結構化提示結合，GPT-4 和 Mixtral 的效能令人滿意。我們找出揭穿產生和人類評估的具體挑戰，並規劃出未來工作的途徑。我們發布了一個高品質真相三明治揭穿資料集、原始程式碼和揭穿系統的示範。", "author": "Francisco Zanartu et.al.", "authors": "Francisco Zanartu, Yulia Otmakhova, John Cook, Lea Frermann", "id": "2407.05599v1", "paper_url": "http://arxiv.org/abs/2407.05599v1", "repo": "null"}}