{"2411.06681": {"publish_time": "2024-11-11", "title": "WDMoE: Wireless Distributed Mixture of Experts for Large Language Models", "paper_summary": "Large Language Models (LLMs) have achieved significant success in various\nnatural language processing tasks, but the role of wireless networks in\nsupporting LLMs has not been thoroughly explored. In this paper, we propose a\nwireless distributed Mixture of Experts (WDMoE) architecture to enable\ncollaborative deployment of LLMs across edge servers at the base station (BS)\nand mobile devices in wireless networks. Specifically, we decompose the MoE\nlayer in LLMs by placing the gating network and the preceding neural network\nlayer at BS, while distributing the expert networks among the devices. This\ndeployment leverages the parallel inference capabilities of expert networks on\nmobile devices, effectively utilizing the limited computing and caching\nresources of these devices. Accordingly, we develop a performance metric for\nWDMoE-based LLMs, which accounts for both model capability and latency. To\nminimize the latency while maintaining accuracy, we jointly optimize expert\nselection and bandwidth allocation based on the performance metric. Moreover,\nwe build a hardware testbed using NVIDIA Jetson kits to validate the\neffectiveness of WDMoE. Both theoretical simulations and practical hardware\nexperiments demonstrate that the proposed method can significantly reduce the\nlatency without compromising LLM performance.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種自然語言處理任務中取得顯著成功，但無線網路在支援 LLM 中的角色尚未被徹底探討。在本文中，我們提出了一種無線分散式專家混合 (WDMoE) 架構，以在基地台 (BS) 的邊緣伺服器和無線網路中的行動裝置上實現 LLM 的協作部署。具體來說，我們透過將閘控網路和前置神經網路層置於 BS，同時將專家網路分佈在裝置中，來分解 LLM 中的 MoE 層。此部署利用了行動裝置上專家網路的並行推論能力，有效地利用了這些裝置有限的運算和快取資源。因此，我們開發了一個基於 WDMoE 的 LLM 效能指標，它同時考量了模型能力和延遲。為了在維持精準度的同時將延遲降至最低，我們根據效能指標共同最佳化專家選擇和頻寬配置。此外，我們使用 NVIDIA Jetson 套件建構硬體測試平台，以驗證 WDMoE 的效能。理論模擬和實際硬體實驗都證明，所提出的方法可以在不影響 LLM 效能的情況下，顯著降低延遲。", "author": "Nan Xue et.al.", "authors": "Nan Xue, Yaping Sun, Zhiyong Chen, Meixia Tao, Xiaodong Xu, Liang Qian, Shuguang Cui, Wenjun Zhang, Ping Zhang", "id": "2411.06681v1", "paper_url": "http://arxiv.org/abs/2411.06681v1", "repo": "null"}}