{"2406.11704": {"publish_time": "2024-06-17", "title": "Nemotron-4 340B Technical Report", "paper_summary": "We release the Nemotron-4 340B model family, including Nemotron-4-340B-Base,\nNemotron-4-340B-Instruct, and Nemotron-4-340B-Reward. Our models are open\naccess under the NVIDIA Open Model License Agreement, a permissive model\nlicense that allows distribution, modification, and use of the models and its\noutputs. These models perform competitively to open access models on a wide\nrange of evaluation benchmarks, and were sized to fit on a single DGX H100 with\n8 GPUs when deployed in FP8 precision. We believe that the community can\nbenefit from these models in various research studies and commercial\napplications, especially for generating synthetic data to train smaller\nlanguage models. Notably, over 98% of data used in our model alignment process\nis synthetically generated, showcasing the effectiveness of these models in\ngenerating synthetic data. To further support open research and facilitate\nmodel development, we are also open-sourcing the synthetic data generation\npipeline used in our model alignment process.", "paper_summary_zh": "我們發布 Nemotron-4 340B 模型系列，包括 Nemotron-4-340B-Base、\nNemotron-4-340B-Instruct 和 Nemotron-4-340B-Reward。我們的模型在 NVIDIA 開放模型授權協議下開放取用，這是一個寬鬆的模型授權，允許分發、修改和使用模型及其輸出。這些模型在廣泛的評估基準上執行與開放取用模型競爭，並且在部署 FP8 精度時大小適合單個配備 8 個 GPU 的 DGX H100。我們相信社群可以在各種研究和商業應用中受益於這些模型，特別是為了產生用於訓練較小語言模型的合成資料。值得注意的是，我們模型比對過程中使用的資料有超過 98% 是合成產生的，展示了這些模型在產生合成資料方面的效能。為了進一步支援開放研究和促進模型開發，我們也開放原始碼，在我們的模型比對過程中使用合成資料產生管道。", "author": "Nvidia et.al.", "authors": "Nvidia, :, Bo Adler, Niket Agarwal, Ashwath Aithal, Dong H. Anh, Pallab Bhattacharya, Annika Brundyn, Jared Casper, Bryan Catanzaro, Sharon Clay, Jonathan Cohen, Sirshak Das, Ayush Dattagupta, Olivier Delalleau, Leon Derczynski, Yi Dong, Daniel Egert, Ellie Evans, Aleksander Ficek, Denys Fridman, Shaona Ghosh, Boris Ginsburg, Igor Gitman, Tomasz Grzegorzek, Robert Hero, Jining Huang, Vibhu Jawa, Joseph Jennings, Aastha Jhunjhunwala, John Kamalu, Sadaf Khan, Oleksii Kuchaiev, Patrick LeGresley, Hui Li, Jiwei Liu, Zihan Liu, Eileen Long, Ameya Sunil Mahabaleshwarkar, Somshubra Majumdar, James Maki, Miguel Martinez, Maer Rodrigues de Melo, Ivan Moshkov, Deepak Narayanan, Sean Narenthiran, Jesus Navarro, Phong Nguyen, Osvald Nitski, Vahid Noroozi, Guruprasad Nutheti, Christopher Parisien, Jupinder Parmar, Mostofa Patwary, Krzysztof Pawelec, Wei Ping, Shrimai Prabhumoye, Rajarshi Roy, Trisha Saar, Vasanth Rao Naik Sabavat, Sanjeev Satheesh, Jane Polak Scowcroft, Jason Sewall, Pavel Shamis, Gerald Shen, Mohammad Shoeybi, Dave Sizer, Misha Smelyanskiy, Felipe Soares, Makesh Narsimhan Sreedhar, Dan Su, Sandeep Subramanian, Shengyang Sun, Shubham Toshniwal, Hao Wang, Zhilin Wang, Jiaxuan You, Jiaqi Zeng, Jimmy Zhang, Jing Zhang, Vivienne Zhang, Yian Zhang, Chen Zhu", "id": "2406.11704v1", "paper_url": "http://arxiv.org/abs/2406.11704v1", "repo": "null"}}