{"2410.06963": {"publish_time": "2024-10-09", "title": "ELMO: Enhanced Real-time LiDAR Motion Capture through Upsampling", "paper_summary": "This paper introduces ELMO, a real-time upsampling motion capture framework\ndesigned for a single LiDAR sensor. Modeled as a conditional autoregressive\ntransformer-based upsampling motion generator, ELMO achieves 60 fps motion\ncapture from a 20 fps LiDAR point cloud sequence. The key feature of ELMO is\nthe coupling of the self-attention mechanism with thoughtfully designed\nembedding modules for motion and point clouds, significantly elevating the\nmotion quality. To facilitate accurate motion capture, we develop a one-time\nskeleton calibration model capable of predicting user skeleton offsets from a\nsingle-frame point cloud. Additionally, we introduce a novel data augmentation\ntechnique utilizing a LiDAR simulator, which enhances global root tracking to\nimprove environmental understanding. To demonstrate the effectiveness of our\nmethod, we compare ELMO with state-of-the-art methods in both image-based and\npoint cloud-based motion capture. We further conduct an ablation study to\nvalidate our design principles. ELMO's fast inference time makes it well-suited\nfor real-time applications, exemplified in our demo video featuring live\nstreaming and interactive gaming scenarios. Furthermore, we contribute a\nhigh-quality LiDAR-mocap synchronized dataset comprising 20 different subjects\nperforming a range of motions, which can serve as a valuable resource for\nfuture research. The dataset and evaluation code are available at {\\blue\n\\url{https://movin3d.github.io/ELMO_SIGASIA2024/}}", "paper_summary_zh": "<paragraph>本文介紹 ELMO，一個專為單一 LiDAR 感測器設計的即時上採樣動作捕捉架構。ELMO 以條件自迴歸轉換器為基礎的上採樣動作生成器建模，從 20 fps LiDAR 點雲序列中實現 60 fps 動作捕捉。ELMO 的關鍵特點在於將自注意力機制與精心設計的動作和點雲嵌入模組結合，大幅提升動作品質。為了促進準確的動作捕捉，我們開發了一個一次性的骨架校正模型，能夠從單一幀點雲預測使用者骨架偏移。此外，我們還引入了一種利用 LiDAR 模擬器的新穎資料擴充技術，這項技術增強了整體根部追蹤，以改善環境理解。為了證明我們方法的有效性，我們在基於影像和基於點雲的動作捕捉中，將 ELMO 與最先進的方法進行比較。我們進一步進行消融研究，以驗證我們的設計原則。ELMO 的快速推論時間使其非常適合於即時應用，這在我們展示現場串流和互動遊戲場景的示範影片中得到證明。此外，我們貢獻了一個高品質的 LiDAR-mocap 同步資料集，其中包含 20 個不同的受試者執行一系列動作，這可以作為未來研究的寶貴資源。資料集和評估程式碼可在 {\\blue \\url{https://movin3d.github.io/ELMO_SIGASIA2024/}} 取得</paragraph>", "author": "Deok-Kyeong Jang et.al.", "authors": "Deok-Kyeong Jang, Dongseok Yang, Deok-Yun Jang, Byeoli Choi, Donghoon Shin, Sung-hee Lee", "id": "2410.06963v1", "paper_url": "http://arxiv.org/abs/2410.06963v1", "repo": "null"}}