{"2412.18216": {"publish_time": "2024-12-24", "title": "ICM-Assistant: Instruction-tuning Multimodal Large Language Models for Rule-based Explainable Image Content Moderation", "paper_summary": "Controversial contents largely inundate the Internet, infringing various\ncultural norms and child protection standards. Traditional Image Content\nModeration (ICM) models fall short in producing precise moderation decisions\nfor diverse standards, while recent multimodal large language models (MLLMs),\nwhen adopted to general rule-based ICM, often produce classification and\nexplanation results that are inconsistent with human moderators. Aiming at\nflexible, explainable, and accurate ICM, we design a novel rule-based dataset\ngeneration pipeline, decomposing concise human-defined rules and leveraging\nwell-designed multi-stage prompts to enrich short explicit image annotations.\nOur ICM-Instruct dataset includes detailed moderation explanation and\nmoderation Q-A pairs. Built upon it, we create our ICM-Assistant model in the\nframework of rule-based ICM, making it readily applicable in real practice. Our\nICM-Assistant model demonstrates exceptional performance and flexibility.\nSpecifically, it significantly outperforms existing approaches on various\nsources, improving both the moderation classification (36.8\\% on average) and\nmoderation explanation quality (26.6\\% on average) consistently over existing\nMLLMs. Code/Data is available at https://github.com/zhaoyuzhi/ICM-Assistant.", "paper_summary_zh": "有爭議的內容大量充斥在網路上，侵犯各種文化規範和兒童保護標準。傳統的影像內容審核 (ICM) 模型無法針對不同的標準提出精確的審核決定，而最近的多模態大型語言模型 (MLLM) 在採用一般基於規則的 ICM 時，通常會產生與人工審核員不一致的分類和說明結果。為了實現彈性、可解釋和精確的 ICM，我們設計了一個新穎的基於規則的資料集生成管道，分解簡潔的人類定義規則，並利用設計良好的多階段提示來豐富簡短的明確影像註解。我們的 ICM-Instruct 資料集包含詳細的審核說明和審核問答對。建立在它的基礎上，我們在基於規則的 ICM 的架構中建立了我們的 ICM-Assistant 模型，使其易於應用於實際操作中。我們的 ICM-Assistant 模型展示出卓越的效能和彈性。具體來說，它在各種來源上都顯著優於現有方法，持續改善審核分類（平均 36.8%）和審核說明品質（平均 26.6%），優於現有的 MLLM。程式碼/資料可在 https://github.com/zhaoyuzhi/ICM-Assistant 取得。", "author": "Mengyang Wu et.al.", "authors": "Mengyang Wu, Yuzhi Zhao, Jialun Cao, Mingjie Xu, Zhongming Jiang, Xuehui Wang, Qinbin Li, Guangneng Hu, Shengchao Qin, Chi-Wing Fu", "id": "2412.18216v1", "paper_url": "http://arxiv.org/abs/2412.18216v1", "repo": "https://github.com/zhaoyuzhi/icm-assistant"}}