{"2412.06016": {"publish_time": "2024-12-08", "title": "Track4Gen: Teaching Video Diffusion Models to Track Points Improves Video Generation", "paper_summary": "While recent foundational video generators produce visually rich output, they\nstill struggle with appearance drift, where objects gradually degrade or change\ninconsistently across frames, breaking visual coherence. We hypothesize that\nthis is because there is no explicit supervision in terms of spatial tracking\nat the feature level. We propose Track4Gen, a spatially aware video generator\nthat combines video diffusion loss with point tracking across frames, providing\nenhanced spatial supervision on the diffusion features. Track4Gen merges the\nvideo generation and point tracking tasks into a single network by making\nminimal changes to existing video generation architectures. Using Stable Video\nDiffusion as a backbone, Track4Gen demonstrates that it is possible to unify\nvideo generation and point tracking, which are typically handled as separate\ntasks. Our extensive evaluations show that Track4Gen effectively reduces\nappearance drift, resulting in temporally stable and visually coherent video\ngeneration. Project page: hyeonho99.github.io/Track4Gen", "paper_summary_zh": "儘管最近基礎影片產生器可產生視覺豐富的輸出，但它們仍受外觀漂移所苦，其中物件會逐漸劣化或在各個畫格中不一致地改變，破壞視覺一致性。我們假設這是因為在特徵層級沒有明確的空間追蹤監督。我們提出 Track4Gen，一種具有空間感知的影片產生器，它結合影片擴散損失與各個畫格的點追蹤，在擴散特徵上提供增強的空間監督。Track4Gen 將影片產生與點追蹤任務合併成單一網路，對現有的影片產生架構進行極小的變更。Track4Gen 使用 Stable Video Diffusion 作為主幹，證明了統一影片產生與點追蹤是可行的，而這兩個任務通常被視為獨立的任務。我們廣泛的評估顯示，Track4Gen 有效地減少外觀漂移，產生時間穩定且視覺一致的影片。專案頁面：hyeonho99.github.io/Track4Gen", "author": "Hyeonho Jeong et.al.", "authors": "Hyeonho Jeong, Chun-Hao Paul Huang, Jong Chul Ye, Niloy Mitra, Duygu Ceylan", "id": "2412.06016v1", "paper_url": "http://arxiv.org/abs/2412.06016v1", "repo": "null"}}