{"2412.04975": {"publish_time": "2024-12-06", "title": "PETapter: Leveraging PET-style classification heads for modular few-shot parameter-efficient fine-tuning", "paper_summary": "Few-shot learning and parameter-efficient fine-tuning (PEFT) are crucial to\novercome the challenges of data scarcity and ever growing language model sizes.\nThis applies in particular to specialized scientific domains, where researchers\nmight lack expertise and resources to fine-tune high-performing language models\nto nuanced tasks. We propose PETapter, a novel method that effectively combines\nPEFT methods with PET-style classification heads to boost few-shot learning\ncapabilities without the significant computational overhead typically\nassociated with full model training. We validate our approach on three\nestablished NLP benchmark datasets and one real-world dataset from\ncommunication research. We show that PETapter not only achieves comparable\nperformance to full few-shot fine-tuning using pattern-exploiting training\n(PET), but also provides greater reliability and higher parameter efficiency\nwhile enabling higher modularity and easy sharing of the trained modules, which\nenables more researchers to utilize high-performing NLP-methods in their\nresearch.", "paper_summary_zh": "小樣本學習和參數有效微調 (PEFT) 對於克服資料稀少和語言模型尺寸持續增長的挑戰至關重要。這特別適用於專業科學領域，研究人員可能缺乏專業知識和資源來微調高性能語言模型以執行細微任務。我們提出 PETapter，這是一種新方法，可有效地將 PEFT 方法與 PET 風格分類標頭相結合，以提升小樣本學習能力，而不會產生通常與完整模型訓練相關的顯著計算開銷。我們在三個既定的 NLP 基準資料集和一個來自溝通研究的真實世界資料集上驗證了我們的做法。我們表明，PETapter 不僅使用模式利用訓練 (PET) 達到了與完整小樣本微調相當的效能，而且還提供了更高的可靠性和更高的參數效率，同時實現了更高的模組化和訓練模組的輕鬆共享，這使更多研究人員能夠在研究中使用高性能 NLP 方法。", "author": "Jonas Rieger et.al.", "authors": "Jonas Rieger, Mattes Ruckdeschel, Gregor Wiedemann", "id": "2412.04975v1", "paper_url": "http://arxiv.org/abs/2412.04975v1", "repo": "null"}}