{"2406.19783": {"publish_time": "2024-06-28", "title": "NLPerturbator: Studying the Robustness of Code LLMs to Natural Language Variations", "paper_summary": "Large language models (LLMs) achieve promising results in code generation\nbased on a given natural language description. They have been integrated into\nopen-source projects and commercial products to facilitate daily coding\nactivities. The natural language description in the prompt is crucial for LLMs\nto comprehend users' requirements. Prior studies uncover that LLMs are\nsensitive to the changes in the prompts, including slight changes that look\ninconspicuous. However, the natural language descriptions often vary in\nreal-world scenarios (e.g., different formats, grammar, and wording). Prior\nstudies on the robustness of LLMs are often based on random perturbations and\nsuch perturbations may not actually happen. In this paper, we conduct a\ncomprehensive study to investigate how are code LLMs robust to variations of\nnatural language description in real-world scenarios. We summarize 18\ncategories of perturbations of natural language and 3 combinations of\nco-occurred categories based on our literature review and an online survey with\npractitioners. We propose an automated framework, NLPerturbator, which can\nperform perturbations of each category given a set of prompts. Through a series\nof experiments on code generation using six code LLMs, we find that the\nperturbed prompts can decrease the performance of code generation by a\nconsiderable margin (e.g., up to 21.2%, and 4.8% to 6.1% on average). Our study\nhighlights the importance of enhancing the robustness of LLMs to real-world\nvariations in the prompts, as well as the essentiality of attentively\nconstructing the prompts.", "paper_summary_zh": "大型語言模型 (LLM) 在基於給定的自然語言描述的程式碼生成中取得了令人滿意的成果。它們已被整合到開源專案和商業產品中，以促進日常編碼活動。提示中的自然語言描述對於 LLM 理解使用者的需求至關重要。先前的研究發現，LLM 對提示的變化很敏感，包括看起來不顯眼的細微變化。然而，自然語言描述在實際場景中通常有所不同（例如，不同的格式、語法和措辭）。先前關於 LLM 穩健性的研究通常基於隨機擾動，而這種擾動可能並未實際發生。在本文中，我們進行了一項全面的研究，以調查在實際場景中，程式碼 LLM 如何對自然語言描述的變化保持穩健性。我們根據文獻回顧和從業人員的線上調查，總結了 18 類自然語言擾動和 3 種共現類別的組合。我們提出了一個自動化框架 NLPerturbator，它可以在給定一組提示的情況下對每個類別進行擾動。透過對使用六個程式碼 LLM 進行程式碼生成的系列實驗，我們發現擾動的提示會在相當大的程度上下降程式碼生成的效能（例如，最多 21.2%，平均 4.8% 到 6.1%）。我們的研究強調了增強 LLM 對提示中實際變化的穩健性的重要性，以及仔細建構提示的必要性。", "author": "Junkai Chen et.al.", "authors": "Junkai Chen, Zhenhao Li, Xing Hu, Xin Xia", "id": "2406.19783v1", "paper_url": "http://arxiv.org/abs/2406.19783v1", "repo": "null"}}