{"2505.00661": {"publish_time": "2025-05-01", "title": "On the generalization of language models from in-context learning and finetuning: a controlled study", "paper_summary": "Large language models exhibit exciting capabilities, yet can show\nsurprisingly narrow generalization from finetuning -- from failing to\ngeneralize to simple reversals of relations they are trained on, to missing\nlogical deductions that can be made from trained information. These failures to\ngeneralize from fine-tuning can hinder practical application of these models.\nHowever, language models' in-context learning shows different inductive biases,\nand can generalize better in some of these cases. Here, we explore these\ndifferences in generalization between in-context- and fine-tuning-based\nlearning. To do so, we constructed several novel datasets to evaluate and\nimprove models' ability to generalize from finetuning data. The datasets are\nconstructed to isolate the knowledge in the dataset from that in pretraining,\nto create clean tests of generalization. We expose pretrained large models to\ncontrolled subsets of the information in these datasets -- either in context,\nor through fine-tuning -- and evaluate their performance on test sets that\nrequire various types of generalization. We find overall that in data-matched\nsettings, in-context learning can generalize more flexibly than fine-tuning\n(though we also find some qualifications of prior findings, such as cases when\nfine-tuning can generalize to reversals embedded in a larger structure of\nknowledge). We build on these findings to propose a method to enable improved\ngeneralization from fine-tuning: adding in-context inferences to finetuning\ndata. We show that this method improves generalization across various splits of\nour datasets and other benchmarks. Our results have implications for\nunderstanding the inductive biases of different modes of learning in language\nmodels, and practically improving their performance.", "paper_summary_zh": "<paragraph>大型語言模型展現出令人興奮的功能，但在微調後的泛化能力卻驚人地狹窄——從無法泛化到訓練關係的簡單反轉，到遺漏可以從訓練資訊中得出的邏輯推論。這些微調後泛化失敗的情況會阻礙這些模型的實際應用。然而，語言模型的上下文學習表現出不同的歸納偏差，並且在某些情況下可以更好地泛化。在這裡，我們探討了基於上下文學習和微調學習之間的泛化差異。為此，我們構建了幾個新的數據集來評估和改進模型從微調數據中泛化的能力。這些數據集的構建是為了將數據集中的知識與預訓練中的知識隔離開來，以創建泛化的乾淨測試。我們將預訓練的大型模型暴露於這些數據集中受控的資訊子集——無論是在上下文中還是在微調中——並評估它們在需要各種泛化類型的測試集上的性能。我們總體上發現在數據匹配的設置中，上下文學習比微調更能靈活地泛化（儘管我們也發現了一些先前發現的限定條件，例如在微調可以泛化到嵌入在更大知識結構中的反轉的情況）。我們基於這些發現提出了一種改進微調泛化的方法：將上下文推論添加到微調數據中。我們表明，這種方法可以改進我們數據集和其他基準的各種拆分的泛化。我們的結果對理解語言模型中不同學習模式的歸納偏差以及實際提高其性能具有重要意義。</paragraph>\n", "author": "Andrew K. Lampinen et.al.", "authors": "Andrew K. Lampinen, Arslan Chaudhry, Stephanie C. Y. Chan, Cody Wild, Diane Wan, Alex Ku, Jörg Bornschein, Razvan Pascanu, Murray Shanahan, James L. McClelland", "id": "2505.00661v1", "paper_url": "http://arxiv.org/abs/2505.00661v1", "repo": "null"}}