{"2406.02301": {"publish_time": "2024-06-04", "title": "mCoT: Multilingual Instruction Tuning for Reasoning Consistency in Language Models", "paper_summary": "Large language models (LLMs) with Chain-of-thought (CoT) have recently\nemerged as a powerful technique for eliciting reasoning to improve various\ndownstream tasks. As most research mainly focuses on English, with few\nexplorations in a multilingual context, the question of how reliable this\nreasoning capability is in different languages is still open. To address it\ndirectly, we study multilingual reasoning consistency across multiple\nlanguages, using popular open-source LLMs. First, we compile the first\nlarge-scale multilingual math reasoning dataset, mCoT-MATH, covering eleven\ndiverse languages. Then, we introduce multilingual CoT instruction tuning to\nboost reasoning capability across languages, thereby improving model\nconsistency. While existing LLMs show substantial variation across the\nlanguages we consider, and especially low performance for lesser resourced\nlanguages, our 7B parameter model mCoT achieves impressive consistency across\nlanguages, and superior or comparable performance to close- and open-source\nmodels even of much larger sizes.", "paper_summary_zh": "大型語言模型 (LLM) 搭配思考鏈 (CoT) 最近已成為引發推理以改善各種下游任務的強大技術。由於大多數研究主要集中在英語，且在多語言環境中探索較少，因此在不同語言中這種推理能力的可靠性問題仍未解決。為了直接解決此問題，我們使用流行的開放原始碼 LLM 研究多語言推理一致性。首先，我們編譯第一個大型多語言數學推理資料集 mCoT-MATH，涵蓋 11 種不同的語言。然後，我們引入多語言 CoT 指令調整，以提升跨語言的推理能力，進而改善模型一致性。雖然現有的 LLM 在我們考慮的語言中顯示出顯著的差異，並且資源較少的語言表現特別低落，但我們的 7B 參數模型 mCoT 在不同語言中達到了令人印象深刻的一致性，並且表現優於或等於甚至大得多的閉源和開放原始碼模型。", "author": "Huiyuan Lai et.al.", "authors": "Huiyuan Lai, Malvina Nissim", "id": "2406.02301v1", "paper_url": "http://arxiv.org/abs/2406.02301v1", "repo": "null"}}