{"2411.04564": {"publish_time": "2024-11-07", "title": "A Generalisation of Voter Model: Influential Nodes and Convergence Properties", "paper_summary": "Consider an undirected graph G, representing a social network, where each\nnode is blue or red, corresponding to positive or negative opinion on a topic.\nIn the voter model, in discrete time rounds, each node picks a neighbour\nuniformly at random and adopts its colour. Despite its significant popularity,\nthis model does not capture some fundamental real-world characteristics such as\nthe difference in the strengths of individuals connections, individuals with\nneutral opinion on a topic, and individuals who are reluctant to update their\nopinion. To address these issues, we introduce and study a generalisation of\nthe voter model. Motivating by campaigning strategies, we study the problem of\nselecting a set of seeds blue nodes to maximise the expected number of blue\nnodes after some rounds. We prove that the problem is NP- hard and provide a\npolynomial time approximation algorithm with the best possible approximation\nguarantee. Our experiments on real-world and synthetic graph data demonstrate\nthat the proposed algorithm outperforms other algorithms. We also investigate\nthe convergence properties of the model. We prove that the process could take\nan exponential number of rounds to converge. However, if we limit ourselves to\nstrongly connected graphs, the convergence time is polynomial and the period\n(the number of states in convergence) divides the length of all cycles in the\ngraph.", "paper_summary_zh": "<paragraph>考慮一個無向圖 G，表示一個社交網路，其中每個節點為藍色或紅色，對應於對一個主題的正面或負面意見。在投票者模型中，在離散時間回合中，每個節點隨機選擇一個鄰居並採用其顏色。儘管它相當受歡迎，但此模型並未捕捉到一些基本的現實世界特徵，例如個人連接強度、對主題持中立意見的個人以及不願意更新其意見的個人。為了解決這些問題，我們引入並研究了投票者模型的概括。藉由競選策略，我們研究了選擇一組藍色種子節點以最大化多輪後藍色節點的預期數量的問題。我們證明此問題是 NP 難的，並提供了一個具有最佳可能近似保證的多項式時間近似演算法。我們在真實世界和合成圖形資料上的實驗證明，所提出的演算法優於其他演算法。我們也研究了模型的收斂性質。我們證明此程序可能需要指數輪數才能收斂。然而，如果我們將自己限制在強連通圖形，則收斂時間是多項式的，且週期（收斂中的狀態數）除以圖形中所有週期的長度。</paragraph>", "author": "Abhiram Manohara et.al.", "authors": "Abhiram Manohara, Ahad N. Zehmakan", "id": "2411.04564v1", "paper_url": "http://arxiv.org/abs/2411.04564v1", "repo": "null"}}