{"2503.12317": {"publish_time": "2025-03-16", "title": "A Transformer-based survival model for prediction of all-cause mortality in heart failure patients: a multi-cohort study", "paper_summary": "We developed and validated TRisk, a Transformer-based AI model predicting\n36-month mortality in heart failure patients by analysing temporal patient\njourneys from UK electronic health records (EHR). Our study included 403,534\nheart failure patients (ages 40-90) from 1,418 English general practices, with\n1,063 practices for model derivation and 355 for external validation. TRisk was\ncompared against the MAGGIC-EHR model across various patient subgroups. With\nmedian follow-up of 9 months, TRisk achieved a concordance index of 0.845 (95%\nconfidence interval: [0.841, 0.849]), significantly outperforming MAGGIC-EHR's\n0.728 (0.723, 0.733) for predicting 36-month all-cause mortality. TRisk showed\nmore consistent performance across sex, age, and baseline characteristics,\nsuggesting less bias. We successfully adapted TRisk to US hospital data through\ntransfer learning, achieving a C-index of 0.802 (0.789, 0.816) with 21,767\npatients. Explainability analyses revealed TRisk captured established risk\nfactors while identifying underappreciated predictors like cancers and hepatic\nfailure that were important across both cohorts. Notably, cancers maintained\nstrong prognostic value even a decade after diagnosis. TRisk demonstrated\nwell-calibrated mortality prediction across both healthcare systems. Our\nfindings highlight the value of tracking longitudinal health profiles and\nrevealed risk factors not included in previous expert-driven models.", "paper_summary_zh": "<paragraph>我們開發並驗證了 TRisk，這是一個基於 Transformer 的 AI 模型，可以透過分析英國電子健康記錄 (EHR) 中患者的時序就醫歷程，來預測心臟衰竭患者 36 個月的死亡率。我們的研究納入了來自 1,418 家英國全科診所的 403,534 名心臟衰竭患者（年齡介於 40 至 90 歲），其中 1,063 家診所用於模型推導，355 家用於外部驗證。我們將 TRisk 與 MAGGIC-EHR 模型在不同的患者亞組中進行了比較。在中位數為 9 個月的追蹤期後，TRisk 的一致性指數達到 0.845（95% 信賴區間：[0.841, 0.849]），顯著優於 MAGGIC-EHR 在預測 36 個月全因死亡率的 0.728（0.723, 0.733）。TRisk 在性別、年齡和基線特徵方面表現更為一致，表明偏差更小。我們透過遷移學習成功地將 TRisk 應用於美國的醫院數據，在 21,767 名患者中達到 0.802（0.789, 0.816）的一致性指數。可解釋性分析顯示，TRisk 不僅涵蓋了已知的風險因素，還識別出了一些未被充分重視的預測指標，例如癌症和肝衰竭，這些指標在兩個群組中都很重要。值得注意的是，即使在確診十年後，癌症仍然具有很強的預後價值。TRisk 在兩個醫療保健系統中都展現了良好的校準死亡率預測。我們的研究結果凸顯了追蹤縱向健康狀況的價值，並揭示了先前專家驅動模型中未包含的風險因素。</paragraph>\n", "author": "Shishir Rao et.al.", "authors": "Shishir Rao, Nouman Ahmed, Gholamreza Salimi-Khorshidi, Christopher Yau, Huimin Su, Nathalie Conrad, Folkert W Asselbergs, Mark Woodward, Rod Jackson, John GF Cleland, Kazem Rahimi", "id": "2503.12317v1", "paper_url": "http://arxiv.org/abs/2503.12317v1", "repo": "null"}}