{"2408.10900": {"publish_time": "2024-08-20", "title": "Towards Efficient Formal Verification of Spiking Neural Network", "paper_summary": "Recently, AI research has primarily focused on large language models (LLMs),\nand increasing accuracy often involves scaling up and consuming more power. The\npower consumption of AI has become a significant societal issue; in this\ncontext, spiking neural networks (SNNs) offer a promising solution. SNNs\noperate event-driven, like the human brain, and compress information\ntemporally. These characteristics allow SNNs to significantly reduce power\nconsumption compared to perceptron-based artificial neural networks (ANNs),\nhighlighting them as a next-generation neural network technology. However,\nsocietal concerns regarding AI go beyond power consumption, with the\nreliability of AI models being a global issue. For instance, adversarial\nattacks on AI models are a well-studied problem in the context of traditional\nneural networks. Despite their importance, the stability and property\nverification of SNNs remains in the early stages of research. Most SNN\nverification methods are time-consuming and barely scalable, making practical\napplications challenging. In this paper, we introduce temporal encoding to\nachieve practical performance in verifying the adversarial robustness of SNNs.\nWe conduct a theoretical analysis of this approach and demonstrate its success\nin verifying SNNs at previously unmanageable scales. Our contribution advances\nSNN verification to a practical level, facilitating the safer application of\nSNNs.", "paper_summary_zh": "最近，人工智慧研究主要集中於大型語言模型 (LLM)，而提高準確度通常涉及擴大規模和消耗更多電力。人工智慧的電力消耗已成為一個重大的社會問題；在此背景下，尖峰神經網路 (SNN) 提供了一個有希望的解決方案。SNN 以事件驅動的方式運作，就像人腦一樣，並在時間上壓縮資訊。這些特性讓 SNN 能夠顯著降低電力消耗，與基於感知器的類神經網路 (ANN) 相比，突顯了它們作為下一代神經網路技術的地位。然而，社會對人工智慧的關注不只於電力消耗，人工智慧模型的可靠性是一個全球性的問題。例如，對人工智慧模型的對抗攻擊是傳統神經網路背景下一個研究得很透徹的問題。儘管它們很重要，但 SNN 的穩定性和屬性驗證仍處於研究的早期階段。大多數 SNN 驗證方法耗時且幾乎無法擴展，使得實際應用具有挑戰性。在本文中，我們引入了時間編碼，以在驗證 SNN 的對抗魯棒性方面取得實際效能。我們對這種方法進行了理論分析，並證明了它在以前無法管理的規模上驗證 SNN 的成功。我們的貢獻將 SNN 驗證提升到一個實用的層次，促進了 SNN 更安全的應用。", "author": "Baekryun Seong et.al.", "authors": "Baekryun Seong, Jieung Kim, Sang-Ki Ko", "id": "2408.10900v1", "paper_url": "http://arxiv.org/abs/2408.10900v1", "repo": "null"}}