{"2408.08150": {"publish_time": "2024-08-15", "title": "Winning Snake: Design Choices in Multi-Shot ASP", "paper_summary": "Answer set programming is a well-understood and established problem-solving\nand knowledge representation paradigm. It has become more prominent amongst a\nwider audience due to its multiple applications in science and industry. The\nconstant development of advanced programming and modeling techniques extends\nthe toolset for developers and users regularly. This paper demonstrates\ndifferent techniques to reuse logic program parts (multi-shot) by solving the\narcade game snake. This game is particularly interesting because a victory can\nbe assured by solving the underlying NP-hard problem of Hamiltonian Cycles. We\nwill demonstrate five hands-on implementations in clingo and compare their\nperformance in an empirical evaluation. In addition, our implementation\nutilizes clingraph to generate a simple yet informative image representation of\nthe game's progress.", "paper_summary_zh": "答案集程式設計是一種理解良好且已建立的問題解決和知識表徵範例。由於其在科學和工業中的多重應用，它已在更廣泛的受眾中變得更加突出。先進程式設計和建模技術的持續發展定期擴展開發人員和使用者的工具組。本文展示了透過解決街機遊戲貪食蛇來重複使用邏輯程式部分（多重射擊）的不同技術。這個遊戲特別有趣，因為透過解決哈密頓迴路的 NP 難問題，可以確保勝利。我們將展示五個 clingo 的動手實作，並在經驗評估中比較它們的效能。此外，我們的實作利用 clingraph 產生遊戲進度的簡單且有資訊性的影像表徵。", "author": "Elisa Böhl et.al.", "authors": "Elisa Böhl, Stefan Ellmauthaler, Sarah Alice Gaggl", "id": "2408.08150v1", "paper_url": "http://arxiv.org/abs/2408.08150v1", "repo": "null"}}