{"2411.04112": {"publish_time": "2024-11-06", "title": "Fed-EC: Bandwidth-Efficient Clustering-Based Federated Learning For Autonomous Visual Robot Navigation", "paper_summary": "Centralized learning requires data to be aggregated at a central server,\nwhich poses significant challenges in terms of data privacy and bandwidth\nconsumption. Federated learning presents a compelling alternative, however,\nvanilla federated learning methods deployed in robotics aim to learn a single\nglobal model across robots that works ideally for all. But in practice one\nmodel may not be well suited for robots deployed in various environments. This\npaper proposes Federated-EmbedCluster (Fed-EC), a clustering-based federated\nlearning framework that is deployed with vision based autonomous robot\nnavigation in diverse outdoor environments. The framework addresses the key\nfederated learning challenge of deteriorating model performance of a single\nglobal model due to the presence of non-IID data across real-world robots.\nExtensive real-world experiments validate that Fed-EC reduces the communication\nsize by 23x for each robot while matching the performance of centralized\nlearning for goal-oriented navigation and outperforms local learning. Fed-EC\ncan transfer previously learnt models to new robots that join the cluster.", "paper_summary_zh": "集中式學習需要將資料彙整至中央伺服器，這在資料隱私和頻寬消耗方面造成重大挑戰。然而，聯邦式學習提供了一個強有力的替代方案，不過，用於機器人的香草聯邦式學習方法旨在學習所有機器人都理想運作的單一全球模型。但在實務上，單一模型可能不適合部署在各種環境中的機器人。本文提出以群集為基礎的聯邦式學習架構 Federated-EmbedCluster (Fed-EC)，該架構與基於視覺的自主機器人導航一起部署在多樣化的戶外環境中。該架構解決了聯邦式學習的一項關鍵挑戰，即由於現實世界機器人中存在非 IID 資料，導致單一全球模型的模型效能下降。廣泛的真實世界實驗驗證了 Fed-EC 將每個機器人的通訊大小減少了 23 倍，同時符合目標導向導航的集中式學習效能，並優於局部學習。Fed-EC 可以將先前學習的模型轉移到加入群集的新機器人。", "author": "Shreya Gummadi et.al.", "authors": "Shreya Gummadi, Mateus V. Gasparino, Deepak Vasisht, Girish Chowdhary", "id": "2411.04112v1", "paper_url": "http://arxiv.org/abs/2411.04112v1", "repo": "null"}}