{"2502.03945": {"publish_time": "2025-02-06", "title": "Afrispeech-Dialog: A Benchmark Dataset for Spontaneous English Conversations in Healthcare and Beyond", "paper_summary": "Speech technologies are transforming interactions across various sectors,\nfrom healthcare to call centers and robots, yet their performance on\nAfrican-accented conversations remains underexplored. We introduce\nAfrispeech-Dialog, a benchmark dataset of 50 simulated medical and non-medical\nAfrican-accented English conversations, designed to evaluate automatic speech\nrecognition (ASR) and related technologies. We assess state-of-the-art (SOTA)\nspeaker diarization and ASR systems on long-form, accented speech, comparing\ntheir performance with native accents and discover a 10%+ performance\ndegradation. Additionally, we explore medical conversation summarization\ncapabilities of large language models (LLMs) to demonstrate the impact of ASR\nerrors on downstream medical summaries, providing insights into the challenges\nand opportunities for speech technologies in the Global South. Our work\nhighlights the need for more inclusive datasets to advance conversational AI in\nlow-resource settings.", "paper_summary_zh": "語音技術正在轉變各個領域的互動，\n從醫療保健到客服中心和機器人，但它們在\n非洲口音對話中的表現仍未得到充分探索。我們推出\nAfrispeech-Dialog，一個由 50 個模擬醫療和非醫療\n非洲口音英語對話組成的基準資料集，旨在評估自動語音\n辨識 (ASR) 和相關技術。我們評估最先進 (SOTA)\n在長篇、有口音的語音上進行說話人區分和 ASR 系統，比較\n它們與母語口音的表現，並發現有 10% 以上的表現\n下降。此外，我們探討大型語言模型 (LLM) 的醫療對話摘要\n功能，以展示 ASR 錯誤對下游醫療摘要的影響，並提供對挑戰的見解\n以及全球南方語音技術的機遇。我們的研究\n強調需要更多包容性的資料集來推動對話式 AI 在\n資源不足的環境中。", "author": "Mardhiyah Sanni et.al.", "authors": "Mardhiyah Sanni, Tassallah Abdullahi, Devendra D. Kayande, Emmanuel Ayodele, Naome A. Etori, Michael S. Mollel, Moshood Yekini, Chibuzor Okocha, Lukman E. Ismaila, Folafunmi Omofoye, Boluwatife A. Adewale, Tobi Olatunji", "id": "2502.03945v1", "paper_url": "http://arxiv.org/abs/2502.03945v1", "repo": "null"}}