{"2406.15473": {"publish_time": "2024-06-15", "title": "Intertwining CP and NLP: The Generation of Unreasonably Constrained Sentences", "paper_summary": "Constrained text generation remains a challenging task, particularly when\ndealing with hard constraints. Traditional Natural Language Processing (NLP)\napproaches prioritize generating meaningful and coherent output. Also, the\ncurrent state-of-the-art methods often lack the expressiveness and constraint\nsatisfaction capabilities to handle such tasks effectively. This paper presents\nthe Constraints First Framework to remedy this issue. This framework considers\na constrained text generation problem as a discrete combinatorial optimization\nproblem. It is solved by a constraint programming method that combines\nlinguistic properties (e.g., n-grams or language level) with other more\nclassical constraints (e.g., the number of characters, syllables, or words).\nEventually, a curation phase allows for selecting the best-generated sentences\naccording to perplexity using a large language model. The effectiveness of this\napproach is demonstrated by tackling a new more tediously constrained text\ngeneration problem: the iconic RADNER sentences problem. This problem aims to\ngenerate sentences respecting a set of quite strict rules defined by their use\nin vision and clinical research. Thanks to our CP-based approach, many new\nstrongly constrained sentences have been successfully generated in an automatic\nmanner. This highlights the potential of our approach to handle unreasonably\nconstrained text generation scenarios.", "paper_summary_zh": "受限文本生成仍然是一项具有挑战性的任务，尤其是在处理硬约束时。传统的自然语言处理 (NLP) 方法优先生成有意义且连贯的输出。此外，当前最先进的方法通常缺乏处理此类任务所需的表达能力和约束满足能力。本文提出了约束优先框架来解决此问题。此框架将受限文本生成问题视为离散组合优化问题。它通过约束编程方法解决，该方法将语言属性（例如 n-gram 或语言级别）与其他更经典的约束（例如字符、音节或单词的数量）结合起来。最终，一个整理阶段允许根据困惑度使用大型语言模型选择生成最好的句子。通过解决一个新的、更繁琐的受限文本生成问题：标志性的 RADNER 句子问题，证明了这种方法的有效性。此问题旨在生成符合一组非常严格规则的句子，这些规则由其在视觉和临床研究中的使用定义。得益于我们基于 CP 的方法，许多新的强约束句子已经成功地以自动化的方式生成。这突出了我们方法处理不合理的受限文本生成场景的潜力。", "author": "Alexandre Bonlarron et.al.", "authors": "Alexandre Bonlarron, Jean-Charles Régin", "id": "2406.15473v1", "paper_url": "http://arxiv.org/abs/2406.15473v1", "repo": "null"}}