{"2406.06559": {"publish_time": "2024-06-02", "title": "Harnessing Business and Media Insights with Large Language Models", "paper_summary": "This paper introduces Fortune Analytics Language Model (FALM). FALM empowers\nusers with direct access to comprehensive business analysis, including market\ntrends, company performance metrics, and expert insights. Unlike generic LLMs,\nFALM leverages a curated knowledge base built from professional journalism,\nenabling it to deliver precise and in-depth answers to intricate business\nquestions. Users can further leverage natural language queries to directly\nvisualize financial data, generating insightful charts and graphs to understand\ntrends across diverse business sectors clearly. FALM fosters user trust and\nensures output accuracy through three novel methods: 1) Time-aware reasoning\nguarantees accurate event registration and prioritizes recent updates. 2)\nThematic trend analysis explicitly examines topic evolution over time,\nproviding insights into emerging business landscapes. 3) Content referencing\nand task decomposition enhance answer fidelity and data visualization accuracy.\nWe conduct both automated and human evaluations, demonstrating FALM's\nsignificant performance improvements over baseline methods while prioritizing\nresponsible AI practices. These benchmarks establish FALM as a cutting-edge LLM\nin the business and media domains, with exceptional accuracy and\ntrustworthiness.", "paper_summary_zh": "本文介紹財富分析語言模型 (FALM)。FALM 賦予使用者直接存取全面的商業分析，包括市場趨勢、公司績效指標和專家見解。與一般 LLM 不同，FALM 透過從專業新聞編纂的知識庫，提供精準且深入的答案以應對複雜的商業問題。使用者可以進一步利用自然語言查詢直接視覺化財務資料，產生有見地的圖表和圖形，以清楚了解不同商業部門的趨勢。FALM 透過三種創新方法培養使用者信任並確保輸出準確性：1) 時間感知推理保證準確的事件註冊並優先處理最近的更新。2) 主題趨勢分析明確地檢查主題隨時間的演變，提供對新興商業環境的見解。3) 內容參考和任務分解增強答案保真度和資料視覺化準確性。我們進行自動化和人工評估，證明 FALM 在優先考慮負責任的 AI 實務的同時，在效能上大幅優於基準方法。這些基準將 FALM 定位為商業和媒體領域中尖端的 LLM，具有卓越的準確性和可信度。", "author": "Yujia Bao et.al.", "authors": "Yujia Bao, Ankit Parag Shah, Neeru Narang, Jonathan Rivers, Rajeev Maksey, Lan Guan, Louise N. Barrere, Shelley Evenson, Rahul Basole, Connie Miao, Ankit Mehta, Fabien Boulay, Su Min Park, Natalie E. Pearson, Eldhose Joy, Tiger He, Sumiran Thakur, Koustav Ghosal, Josh On, Phoebe Morrison, Tim Major, Eva Siqi Wang, Gina Escobar, Jiaheng Wei, Tharindu Cyril Weerasooriya, Queena Song, Daria Lashkevich, Clare Chen, Gyuhak Kim, Dengpan Yin, Don Hejna, Mo Nomeli, Wei Wei", "id": "2406.06559v1", "paper_url": "http://arxiv.org/abs/2406.06559v1", "repo": "null"}}