{"2410.12444": {"publish_time": "2024-10-16", "title": "Expanding Chatbot Knowledge in Customer Service: Context-Aware Similar Question Generation Using Large Language Models", "paper_summary": "Reliable responses of service chatbots are often achieved by employing\nretrieval-based methods that restrict answers to a knowledge base comprising\npredefined question-answer pairs (QA pairs). To accommodate potential\nvariations in how a customer's query may be expressed, it emerges as the\nfavored solution to augment these QA pairs with similar questions that are\npossibly diverse while remaining semantic consistency. This augmentation task\nis known as Similar Question Generation (SQG). Traditional methods that heavily\nrely on human efforts or rule-based techniques suffer from limited diversity or\nsignificant semantic deviation from the source question, only capable of\nproducing a finite number of useful questions.\n  To address these limitations, we propose an SQG approach based on Large\nLanguage Models (LLMs), capable of producing a substantial number of diverse\nquestions while maintaining semantic consistency to the source QA pair. This is\nachieved by leveraging LLMs' natural language understanding capability through\nfine-tuning with specially designed prompts. The experiments conducted on a\nreal customer-service dataset demonstrate that our method surpasses baseline\nmethods by a significant margin in terms of semantic diversity. Human\nevaluation further confirms that integrating the answer that reflects the\ncustomer's intention is crucial for increasing the number of generated\nquestions that meet business requirements.", "paper_summary_zh": "服務聊天機器人的可靠回應通常透過採用檢索式方法來達成，此方法將答案限制在包含預先定義的問題解答對（問答對）的知識庫中。為了適應客戶查詢可能表達的方式的潛在變異，擴充這些問答對以納入在語意一致性的前提下可能不同的類似問題，逐漸成為受到青睞的解決方案。此擴充任務稱為類似問題產生（SQG）。傳統方法過度依賴人力或基於規則的技術，會造成多樣性受限或與原始問題產生顯著的語意偏差，僅能產生有限數量的有用問題。\n為了解決這些限制，我們提出一個基於大型語言模型（LLM）的 SQG 方法，此方法能夠產生大量多樣化的問題，同時維持與原始問答對的語意一致性。這透過利用 LLM 的自然語言理解能力，並透過特別設計的提示進行微調來達成。在實際的客戶服務資料集上進行的實驗顯示，我們的模型在語意多樣性方面大幅超越基線模型。人工評估進一步證實，整合反映客戶意圖的答案對於增加符合業務需求的產生問題數量至關重要。", "author": "Mengze Hong et.al.", "authors": "Mengze Hong, Yuanfeng Song, Di Jiang, Lu Wang, Zichang Guo, Chen Jason Zhang", "id": "2410.12444v1", "paper_url": "http://arxiv.org/abs/2410.12444v1", "repo": "null"}}