{"2501.03988": {"publish_time": "2025-01-07", "title": "Semantically Cohesive Word Grouping in Indian Languages", "paper_summary": "Indian languages are inflectional and agglutinative and typically follow\nclause-free word order. The structure of sentences across most major Indian\nlanguages are similar when their dependency parse trees are considered. While\nsome differences in the parsing structure occur due to peculiarities of a\nlanguage or its preferred natural way of conveying meaning, several apparent\ndifferences are simply due to the granularity of representation of the smallest\nsemantic unit of processing in a sentence. The semantic unit is typically a\nword, typographically separated by whitespaces. A single whitespace-separated\nword in one language may correspond to a group of words in another. Hence,\ngrouping of words based on semantics helps unify the parsing structure of\nparallel sentences across languages and, in the process, morphology. In this\nwork, we propose word grouping as a major preprocessing step for any\ncomputational or linguistic processing of sentences for Indian languages. Among\nIndian languages, since Hindi is one of the least agglutinative, we expect it\nto benefit the most from word-grouping. Hence, in this paper, we focus on Hindi\nto study the effects of grouping. We perform quantitative assessment of our\nproposal with an intrinsic method that perturbs sentences by shuffling words as\nwell as an extrinsic evaluation that verifies the importance of word grouping\nfor the task of Machine Translation (MT) using decomposed prompting. We also\nqualitatively analyze certain aspects of the syntactic structure of sentences.\nOur experiments and analyses show that the proposed grouping technique brings\nuniformity in the syntactic structures, as well as aids underlying NLP tasks.", "paper_summary_zh": "<paragraph>印度語言是屈折的和黏著的，通常遵循無子句的詞序。當考慮其依存句法分析樹時，大多數主要印度語言的句子結構是相似的。雖然由於語言的特殊性或其傳達含義的自然方式而導致分析結構上存在一些差異，但幾個明顯的差異僅僅是句子中最小的語義處理單元的表示粒度。語義單元通常是一個詞，在排版上由空白分隔。一種語言中單獨的空白分隔詞可能對應於另一種語言中的一組詞。因此，基於語義對詞進行分組有助於統一跨語言的並行句子的分析結構，並在此過程中統一形態。在這項工作中，我們提出詞組作為印度語言的句子進行任何計算或語言處理的主要預處理步驟。在印度語言中，由於印地語是最不黏著的語言之一，我們預計它將從詞組中受益最多。因此，在本文中，我們專注於印地語來研究分組的影響。我們使用一種通過打亂詞彙來擾動句子的內在方法對我們的提案進行定量評估，以及一種驗證詞組對於使用分解提示的機器翻譯 (MT) 任務的重要性。我們還定性地分析了句子的句法結構的某些方面。我們的實驗和分析表明，所提出的分組技術為句法結構帶來了統一性，並有助於 NLP 的基礎任務。</paragraph>", "author": "N J Karthika et.al.", "authors": "N J Karthika, Adyasha Patra, Nagasai Saketh Naidu, Arnab Bhattacharya, Ganesh Ramakrishnan, Chaitali Dangarikar", "id": "2501.03988v1", "paper_url": "http://arxiv.org/abs/2501.03988v1", "repo": "null"}}