{"2412.17587": {"publish_time": "2024-12-23", "title": "Improved Cotton Leaf Disease Classification Using Parameter-Efficient Deep Learning Framework", "paper_summary": "Cotton crops, often called \"white gold,\" face significant production\nchallenges, primarily due to various leaf-affecting diseases. As a major global\nsource of fiber, timely and accurate disease identification is crucial to\nensure optimal yields and maintain crop health. While deep learning and machine\nlearning techniques have been explored to address this challenge, there remains\na gap in developing lightweight models with fewer parameters which could be\ncomputationally effective for agricultural practitioners. To address this, we\npropose an innovative deep learning framework integrating a subset of trainable\nlayers from MobileNet, transfer learning, data augmentation, a learning rate\ndecay schedule, model checkpoints, and early stopping mechanisms. Our model\ndemonstrates exceptional performance, accurately classifying seven cotton\ndisease types with an overall accuracy of 98.42% and class-wise precision\nranging from 96% to 100%. This results in significantly enhanced efficiency,\nsurpassing recent approaches in accuracy and model complexity. The existing\nmodels in the literature have yet to attain such high accuracy, even when\ntested on data sets with fewer disease types. The substantial performance\nimprovement, combined with the lightweight nature of the model, makes it\npractically suitable for real-world applications in smart farming. By offering\na high-performing and efficient solution, our framework can potentially address\nchallenges in cotton cultivation, contributing to sustainable agricultural\npractices.", "paper_summary_zh": "棉花作物常被称为「白色黄金」，但會面臨重大的生產挑戰，主要是因為各種影響葉子的疾病。作為全球主要的纖維來源，及時且準確地辨識疾病對於確保最佳產量和維持作物健康至關重要。儘管深度學習和機器學習技術已被探索用於解決此挑戰，但對於開發具有較少參數的輕量級模型仍存在差距，而這些模型對於農業從業者而言在運算上可能有效。為了解決此問題，我們提出一個創新的深度學習架構，整合了來自 MobileNet 的可訓練層子集、遷移學習、資料擴充、學習率衰減時間表、模型檢查點和早期停止機制。我們的模型展現了非凡的效能，準確地分類了七種棉花疾病類型，整體準確度為 98.42%，且類別準確度介於 96% 到 100% 之間。這導致顯著提升的效率，在準確度和模型複雜度上超越了最近的方法。文獻中的現有模型尚未達到如此高的準確度，即使在較少疾病類型的資料集上進行測試時也是如此。大幅提升的效能，加上模型的輕量級特性，使其在智慧農業的實際應用中具有實用性。透過提供高性能且高效的解決方案，我們的架構有可能解決棉花種植中的挑戰，進而促成永續的農業實務。", "author": "Aswini Kumar Patra et.al.", "authors": "Aswini Kumar Patra, Tejashwini Gajurel", "id": "2412.17587v1", "paper_url": "http://arxiv.org/abs/2412.17587v1", "repo": "null"}}