{"2411.01535": {"publish_time": "2024-11-03", "title": "Customized Subgraph Selection and Encoding for Drug-drug Interaction Prediction", "paper_summary": "Subgraph-based methods have proven to be effective and interpretable in\npredicting drug-drug interactions (DDIs), which are essential for medical\npractice and drug development. Subgraph selection and encoding are critical\nstages in these methods, yet customizing these components remains underexplored\ndue to the high cost of manual adjustments. In this study, inspired by the\nsuccess of neural architecture search (NAS), we propose a method to search for\ndata-specific components within subgraph-based frameworks. Specifically, we\nintroduce extensive subgraph selection and encoding spaces that account for the\ndiverse contexts of drug interactions in DDI prediction. To address the\nchallenge of large search spaces and high sampling costs, we design a\nrelaxation mechanism that uses an approximation strategy to efficiently explore\noptimal subgraph configurations. This approach allows for robust exploration of\nthe search space. Extensive experiments demonstrate the effectiveness and\nsuperiority of the proposed method, with the discovered subgraphs and encoding\nfunctions highlighting the model's adaptability.", "paper_summary_zh": "基於子圖的方法已被證明在預測藥物-藥物交互作用 (DDI) 中有效且易於解釋，這對於醫療實務和藥物開發至關重要。子圖選擇和編碼是這些方法中的關鍵階段，然而，由於手動調整的成本高昂，客製化這些元件仍未被充分探討。在本研究中，受到神經架構搜尋 (NAS) 成功啟發，我們提出一個方法來搜尋子圖架構中的資料特定元件。具體來說，我們引入了廣泛的子圖選擇和編碼空間，以說明 DDI 預測中藥物交互作用的不同背景。為了應對大型搜尋空間和高取樣成本的挑戰，我們設計了一個放鬆機制，使用近似策略來有效探索最佳子圖配置。這種方法允許對搜尋空間進行穩健的探索。廣泛的實驗證明了所提出方法的有效性和優越性，發現的子圖和編碼函數突顯了模型的適應性。", "author": "Haotong Du et.al.", "authors": "Haotong Du, Quanming Yao, Juzheng Zhang, Yang Liu, Zhen Wang", "id": "2411.01535v1", "paper_url": "http://arxiv.org/abs/2411.01535v1", "repo": "null"}}