{"2408.12781": {"publish_time": "2024-08-23", "title": "The Model Mastery Lifecycle: A Framework for Designing Human-AI Interaction", "paper_summary": "The utilization of AI in an increasing number of fields is the latest\niteration of a long process, where machines and systems have been replacing\nhumans, or changing the roles that they play, in various tasks. Although humans\nare often resistant to technological innovation, especially in workplaces,\nthere is a general trend towards increasing automation, and more recently, AI.\nAI is now capable of carrying out, or assisting with, many tasks that used to\nbe regarded as exclusively requiring human expertise. In this paper we consider\nthe case of tasks that could be performed either by human experts or by AI and\nlocate them on a continuum running from exclusively human task performance at\none end to AI autonomy on the other, with a variety of forms of human-AI\ninteraction between those extremes. Implementation of AI is constrained by the\ncontext of the systems and workflows that it will be embedded within. There is\nan urgent need for methods to determine how AI should be used in different\nsituations and to develop appropriate methods of human-AI interaction so that\nhumans and AI can work together effectively to perform tasks. In response to\nthe evolving landscape of AI progress and increasing mastery, we introduce an\nAI Mastery Lifecycle framework and discuss its implications for human-AI\ninteraction. The framework provides guidance on human-AI task allocation and\nhow human-AI interfaces need to adapt to improvements in AI task performance\nover time. Within the framework we identify a zone of uncertainty where the\nissues of human-AI task allocation and user interface design are likely to be\nmost challenging.", "paper_summary_zh": "隨著 AI 在越來越多領域的應用，這只是機器和系統取代人類或改變人類在各項任務中所扮演角色的漫長過程中最新的一次反覆。儘管人類通常會抗拒技術創新，特別是在工作場所，但自動化和最近的 AI 卻有越來越盛行的趨勢。AI 現在有能力執行或協助許多任務，這些任務過去被認為只能由人類專家來執行。在本文中，我們考慮了可以由人類專家或 AI 執行的任務，並將它們定位在一個連續體上，從一端的完全由人類執行任務到另一端的 AI 自主，在這些極端之間有各種形式的人機互動。AI 的實作受到它將被嵌入其中的系統和工作流程的背景限制。迫切需要方法來確定 AI 應如何在不同情況下使用，並開發適當的人機互動方法，以便人類和 AI 能夠有效地合作執行任務。為了回應 AI 進展和日益精熟的演變態勢，我們引入了 AI 精熟度生命週期架構，並討論了它對人機互動的影響。該架構提供了人機任務分配的指導方針，以及隨著時間推移 AI 任務執行能力的提升，人機介面需要如何適應。在該架構內，我們確定了一個不確定區域，其中人機任務分配和使用者介面設計的問題可能最具挑戰性。", "author": "Mark Chignell et.al.", "authors": "Mark Chignell, Mu-Huan Miles Chung, Jaturong Kongmanee, Khilan Jerath, Abhay Raman", "id": "2408.12781v1", "paper_url": "http://arxiv.org/abs/2408.12781v1", "repo": "null"}}