{"2407.06076": {"publish_time": "2024-07-08", "title": "Understanding Visual Feature Reliance through the Lens of Complexity", "paper_summary": "Recent studies suggest that deep learning models inductive bias towards\nfavoring simpler features may be one of the sources of shortcut learning. Yet,\nthere has been limited focus on understanding the complexity of the myriad\nfeatures that models learn. In this work, we introduce a new metric for\nquantifying feature complexity, based on $\\mathscr{V}$-information and\ncapturing whether a feature requires complex computational transformations to\nbe extracted. Using this $\\mathscr{V}$-information metric, we analyze the\ncomplexities of 10,000 features, represented as directions in the penultimate\nlayer, that were extracted from a standard ImageNet-trained vision model. Our\nstudy addresses four key questions: First, we ask what features look like as a\nfunction of complexity and find a spectrum of simple to complex features\npresent within the model. Second, we ask when features are learned during\ntraining. We find that simpler features dominate early in training, and more\ncomplex features emerge gradually. Third, we investigate where within the\nnetwork simple and complex features flow, and find that simpler features tend\nto bypass the visual hierarchy via residual connections. Fourth, we explore the\nconnection between features complexity and their importance in driving the\nnetworks decision. We find that complex features tend to be less important.\nSurprisingly, important features become accessible at earlier layers during\ntraining, like a sedimentation process, allowing the model to build upon these\nfoundational elements.", "paper_summary_zh": "<paragraph>最近的研究表明，深度学习模型归纳偏向于偏好较简单的特征，这可能是捷径学习的来源之一。然而，对于理解模型学习的无数特征的复杂性，关注度有限。在这项工作中，我们引入了一个新的指标来量化特征复杂性，该指标基于 $\\mathscr{V}$ 信息，并捕获特征是否需要复杂的计算转换才能被提取。使用这个 $\\mathscr{V}$ 信息指标，我们分析了 10,000 个特征的复杂性，这些特征表示为倒数第二层的方向，它们是从标准的 ImageNet 训练的视觉模型中提取的。我们的研究解决了四个关键问题：首先，我们询问特征看起来像复杂性的函数，并发现模型中存在从简单到复杂特征的范围。其次，我们询问在训练期间何时学习特征。我们发现较简单的特征在训练早期占主导地位，而更复杂的特征逐渐出现。第三，我们调查了简单和复杂特征在网络中的流动位置，并发现较简单的特征倾向于通过残差连接绕过视觉层次结构。第四，我们探索了特征复杂性与其在推动网络决策中的重要性之间的联系。我们发现复杂的特征往往不太重要。令人惊讶的是，重要的特征在训练期间会变得更容易在较早的层中获得，就像一个沉淀过程，允许模型建立在这些基础元素之上。</paragraph>", "author": "Thomas Fel et.al.", "authors": "Thomas Fel, Louis Bethune, Andrew Kyle Lampinen, Thomas Serre, Katherine Hermann", "id": "2407.06076v1", "paper_url": "http://arxiv.org/abs/2407.06076v1", "repo": "null"}}