{"2409.17922": {"publish_time": "2024-09-26", "title": "Navigation in a simplified Urban Flow through Deep Reinforcement Learning", "paper_summary": "The increasing number of unmanned aerial vehicles (UAVs) in urban\nenvironments requires a strategy to minimize their environmental impact, both\nin terms of energy efficiency and noise reduction. In order to reduce these\nconcerns, novel strategies for developing prediction models and optimization of\nflight planning, for instance through deep reinforcement learning (DRL), are\nneeded. Our goal is to develop DRL algorithms capable of enabling the\nautonomous navigation of UAVs in urban environments, taking into account the\npresence of buildings and other UAVs, optimizing the trajectories in order to\nreduce both energetic consumption and noise. This is achieved using fluid-flow\nsimulations which represent the environment in which UAVs navigate and training\nthe UAV as an agent interacting with an urban environment. In this work, we\nconsider a domain domain represented by a two-dimensional flow field with\nobstacles, ideally representing buildings, extracted from a three-dimensional\nhigh-fidelity numerical simulation. The presented methodology, using PPO+LSTM\ncells, was validated by reproducing a simple but fundamental problem in\nnavigation, namely the Zermelo's problem, which deals with a vessel navigating\nin a turbulent flow, travelling from a starting point to a target location,\noptimizing the trajectory. The current method shows a significant improvement\nwith respect to both a simple PPO and a TD3 algorithm, with a success rate (SR)\nof the PPO+LSTM trained policy of 98.7%, and a crash rate (CR) of 0.1%,\noutperforming both PPO (SR = 75.6%, CR=18.6%) and TD3 (SR=77.4% and CR=14.5%).\nThis is the first step towards DRL strategies which will guide UAVs in a\nthree-dimensional flow field using real-time signals, making the navigation\nefficient in terms of flight time and avoiding damages to the vehicle.", "paper_summary_zh": "隨著城市環境中無人機（UAV）數量的不斷增加，需要一種策略來最大程度地減少其環境影響，無論是在能源效率還是降噪方面。為了減少這些問題，需要採用新的策略來開發預測模型和優化飛行規劃，例如通過深度強化學習（DRL）。我們的目標是開發 DRL 演算法，使無人機能夠在城市環境中自主導航，同時考慮建築物和其他無人機的存在，優化軌跡以減少能量消耗和噪音。這是通過使用流體流動模擬來實現的，該模擬表示無人機導航的環境，並將無人機訓練為與城市環境交互的代理。在這項工作中，我們考慮了一個由具有障礙物的二維流場表示的域，這些障礙物理想地表示建築物，並從三維高保真數值模擬中提取。使用 PPO+LSTM 單元的所提出的方法通過重現導航中一個簡單但基本的難題得到了驗證，即 Zermelo 問題，該問題涉及在湍流中航行的船隻，從起點行駛到目標位置，優化軌跡。與簡單的 PPO 和 TD3 演算法相比，當前方法顯示出顯著的改進，PPO+LSTM 訓練策略的成功率 (SR) 為 98.7%，崩潰率 (CR) 為 0.1%，優於 PPO（SR = 75.6%，CR=18.6%）和 TD3（SR=77.4% 和 CR=14.5%）。這是朝著 DRL 策略邁出的第一步，該策略將使用實時訊號引導無人機在三維流場中，從而使導航在飛行時間方面變得高效，並避免對車輛造成損壞。", "author": "Federica Tonti et.al.", "authors": "Federica Tonti, Jean Rabault, Ricardo Vinuesa", "id": "2409.17922v1", "paper_url": "http://arxiv.org/abs/2409.17922v1", "repo": "null"}}