{"2410.05684": {"publish_time": "2024-10-08", "title": "Copiloting Diagnosis of Autism in Real Clinical Scenarios via LLMs", "paper_summary": "Autism spectrum disorder(ASD) is a pervasive developmental disorder that\nsignificantly impacts the daily functioning and social participation of\nindividuals. Despite the abundance of research focused on supporting the\nclinical diagnosis of ASD, there is still a lack of systematic and\ncomprehensive exploration in the field of methods based on Large Language\nModels (LLMs), particularly regarding the real-world clinical diagnostic\nscenarios based on Autism Diagnostic Observation Schedule, Second Edition\n(ADOS-2). Therefore, we have proposed a framework called ADOS-Copilot, which\nstrikes a balance between scoring and explanation and explored the factors that\ninfluence the performance of LLMs in this task. The experimental results\nindicate that our proposed framework is competitive with the diagnostic results\nof clinicians, with a minimum MAE of 0.4643, binary classification F1-score of\n81.79\\%, and ternary classification F1-score of 78.37\\%. Furthermore, we have\nsystematically elucidated the strengths and limitations of current LLMs in this\ntask from the perspectives of ADOS-2, LLMs' capabilities, language, and model\nscale aiming to inspire and guide the future application of LLMs in a broader\nfields of mental health disorders. We hope for more research to be transferred\ninto real clinical practice, opening a window of kindness to the world for\neccentric children.", "paper_summary_zh": "自閉症譜系障礙 (ASD) 是一種廣泛的發展障礙，\n會顯著影響個人的日常生活功能和社會參與。儘管有許多研究專注於支持 ASD 的臨床診斷，但基於大型語言模型 (LLM) 的方法領域中仍然缺乏系統且全面的探討，特別是基於自閉症診斷觀察量表第二版的真實世界臨床診斷情境 (ADOS-2)。因此，我們提出了一個稱為 ADOS-Copilot 的框架，它在評分和解釋之間取得平衡，並探討了影響 LLM 在此任務中表現的因素。實驗結果表明，我們提出的框架與臨床醫生的診斷結果具有競爭力，最小 MAE 為 0.4643，二元分類 F1 分數為 81.79%，三元分類 F1 分數為 78.37%。此外，我們從 ADOS-2、LLM 的能力、語言和模型規模的角度系統地闡明了當前 LLM 在此任務中的優點和局限性，旨在激勵和指導 LLM 在更廣泛的精神健康障礙領域中的未來應用。我們希望有更多的研究可以轉移到實際的臨床實踐中，為古怪的孩子們打開一扇通往世界的善意之窗。", "author": "Yi Jiang et.al.", "authors": "Yi Jiang, Qingyang Shen, Shuzhong Lai, Shunyu Qi, Qian Zheng, Lin Yao, Yueming Wang, Gang Pan", "id": "2410.05684v1", "paper_url": "http://arxiv.org/abs/2410.05684v1", "repo": "null"}}