{"2502.14546": {"publish_time": "2025-02-20", "title": "Position: Graph Learning Will Lose Relevance Due To Poor Benchmarks", "paper_summary": "While machine learning on graphs has demonstrated promise in drug design and\nmolecular property prediction, significant benchmarking challenges hinder its\nfurther progress and relevance. Current benchmarking practices often lack focus\non transformative, real-world applications, favoring narrow domains like\ntwo-dimensional molecular graphs over broader, impactful areas such as\ncombinatorial optimization, relational databases, or chip design. Additionally,\nmany benchmark datasets poorly represent the underlying data, leading to\ninadequate abstractions and misaligned use cases. Fragmented evaluations and an\nexcessive focus on accuracy further exacerbate these issues, incentivizing\noverfitting rather than fostering generalizable insights. These limitations\nhave prevented the development of truly useful graph foundation models. This\nposition paper calls for a paradigm shift toward more meaningful benchmarks,\nrigorous evaluation protocols, and stronger collaboration with domain experts\nto drive impactful and reliable advances in graph learning research, unlocking\nthe potential of graph learning.", "paper_summary_zh": "<paragraph>儘管圖形上的機器學習在藥物設計和分子屬性預測方面已展現潛力，但顯著的基準挑戰阻礙了其進一步進展和相關性。目前的基準實務往往缺乏對轉型性、真實世界應用的關注，偏好於狹窄的領域，例如二維分子圖形，而不是組合最佳化、關係資料庫或晶片設計等更廣泛、更有影響力的領域。此外，許多基準資料集無法充分表示基礎資料，導致抽象化不充分和使用案例錯位。支離破碎的評估和過度關注準確性進一步加劇了這些問題，激勵過度擬合，而不是培養可概括的見解。這些限制阻礙了真正有用的圖形基礎模型的開發。這篇立場文件呼籲將範例轉變為更有意義的基準、嚴格的評估協定，以及與領域專家的更強大合作，以推動圖形學習研究中具有影響力和可靠性的進展，釋放圖形學習的潛力。</paragraph>", "author": "Maya Bechler-Speicher et.al.", "authors": "Maya Bechler-Speicher, Ben Finkelshtein, Fabrizio Frasca, Luis Müller, Jan Tönshoff, Antoine Siraudin, Viktor Zaverkin, Michael M. Bronstein, Mathias Niepert, Bryan Perozzi, Mikhail Galkin, Christopher Morris", "id": "2502.14546v1", "paper_url": "http://arxiv.org/abs/2502.14546v1", "repo": "null"}}