{"2405.04937": {"publish_time": "2024-05-08", "title": "Developing trustworthy AI applications with foundation models", "paper_summary": "The trustworthiness of AI applications has been the subject of recent\nresearch and is also addressed in the EU's recently adopted AI Regulation. The\ncurrently emerging foundation models in the field of text, speech and image\nprocessing offer completely new possibilities for developing AI applications.\nThis whitepaper shows how the trustworthiness of an AI application developed\nwith foundation models can be evaluated and ensured. For this purpose, the\napplication-specific, risk-based approach for testing and ensuring the\ntrustworthiness of AI applications, as developed in the 'AI Assessment Catalog\n- Guideline for Trustworthy Artificial Intelligence' by Fraunhofer IAIS, is\ntransferred to the context of foundation models. Special consideration is given\nto the fact that specific risks of foundation models can have an impact on the\nAI application and must also be taken into account when checking\ntrustworthiness. Chapter 1 of the white paper explains the fundamental\nrelationship between foundation models and AI applications based on them in\nterms of trustworthiness. Chapter 2 provides an introduction to the technical\nconstruction of foundation models and Chapter 3 shows how AI applications can\nbe developed based on them. Chapter 4 provides an overview of the resulting\nrisks regarding trustworthiness. Chapter 5 shows which requirements for AI\napplications and foundation models are to be expected according to the draft of\nthe European Union's AI Regulation and Chapter 6 finally shows the system and\nprocedure for meeting trustworthiness requirements.", "paper_summary_zh": "人工智能應用程式的可信賴性一直是近期研究的主題，並在歐盟最近通過的人工智慧法規中有所闡述。目前在文字、語音和影像處理領域中新興的基礎模型為開發人工智能應用程式提供了全新的可能性。本白皮書說明了如何評估和確保使用基礎模型開發的人工智慧應用程式的可信賴性。為此，將 Fraunhofer IAIS 在「AI 評估目錄 - 可信賴人工智慧指南」中開發的特定於應用程式的、基於風險的測試和確保人工智慧應用程式可信賴性的方法轉移到基礎模型的背景中。特別考慮到基礎模型的特定風險可能會對人工智慧應用程式產生影響，在檢查可信賴性時也必須將其納入考量。白皮書的第 1 章說明了基礎模型與基於它們的人工智慧應用程式之間在可信賴性方面的基本關係。第 2 章介紹了基礎模型的技術結構，第 3 章說明了如何基於它們開發人工智慧應用程式。第 4 章提供了關於可信賴性的風險概觀。第 5 章說明了根據歐盟人工智慧法規草案，對人工智慧應用程式和基礎模型的預期要求，最後第 6 章說明了滿足可信賴性要求的系統和程序。", "author": "Michael Mock et.al.", "authors": "Michael Mock, Sebastian Schmidt, Felix Müller, Rebekka Görge, Anna Schmitz, Elena Haedecke, Angelika Voss, Dirk Hecker, Maximillian Poretschkin", "id": "2405.04937v1", "paper_url": "http://arxiv.org/abs/2405.04937v1", "repo": "null"}}