{"2410.18541": {"publish_time": "2024-10-24", "title": "On Explaining with Attention Matrices", "paper_summary": "This paper explores the much discussed, possible explanatory link between\nattention weights (AW) in transformer models and predicted output. Contrary to\nintuition and early research on attention, more recent prior research has\nprovided formal arguments and empirical evidence that AW are not explanatorily\nrelevant. We show that the formal arguments are incorrect. We introduce and\neffectively compute efficient attention, which isolates the effective\ncomponents of attention matrices in tasks and models in which AW play an\nexplanatory role. We show that efficient attention has a causal role (provides\nminimally necessary and sufficient conditions) for predicting model output in\nNLP tasks requiring contextual information, and we show, contrary to [7], that\nefficient attention matrices are probability distributions and are effectively\ncalculable. Thus, they should play an important part in the explanation of\nattention based model behavior. We offer empirical experiments in support of\nour method illustrating various properties of efficient attention with various\nmetrics on four datasets.", "paper_summary_zh": "本文探討了Transformer模型中注意力權重 (AW) 與預測輸出之間廣泛討論的可能解釋性連結。與直覺和早期注意力研究相反，最近較早的研究提供了正式論證和經驗證據，表明 AW 沒有解釋性相關性。我們表明正式論證是不正確的。我們引入並有效計算有效注意力，它會分離任務和模型中注意力矩陣的有效組成，在這些任務和模型中，AW 扮演了解釋性角色。我們表明有效注意力在預測需要上下文資訊的 NLP 任務中的模型輸出時有因果關係（提供最小必要且充分的條件），而且我們表明與 [7] 相反，有效注意力矩陣是機率分佈，且可以有效計算。因此，它們應在基於注意力的模型行為的解釋中扮演重要角色。我們提供經驗實驗以支持我們的各種指標在四個資料集上說明有效注意力的各種屬性的方法。", "author": "Omar Naim et.al.", "authors": "Omar Naim, Nicholas Asher", "id": "2410.18541v1", "paper_url": "http://arxiv.org/abs/2410.18541v1", "repo": "https://github.com/omyokun/on-explaining-with-attention-matrices"}}