{"2412.12693": {"publish_time": "2024-12-17", "title": "SPHERE: A Hierarchical Evaluation on Spatial Perception and Reasoning for Vision-Language Models", "paper_summary": "Current vision-language models may incorporate single-dimensional spatial\ncues, such as depth, object boundary, and basic spatial directions (e.g. left,\nright, front, back), yet often lack the multi-dimensional spatial reasoning\nnecessary for human-like understanding and real-world applications. To address\nthis gap, we develop SPHERE (Spatial Perception and Hierarchical Evaluation of\nREasoning), a hierarchical evaluation framework with a new human-annotated\ndataset to pinpoint model strengths and weaknesses, advancing from single-skill\ntasks to multi-skill tasks, and ultimately to complex reasoning tasks that\nrequire the integration of multiple spatial and visual cues with logical\nreasoning. Benchmark evaluation of state-of-the-art open-source models reveal\nsignificant shortcomings, especially in the abilities to understand distance\nand proximity, to reason from both allocentric and egocentric viewpoints, and\nto perform complex reasoning in a physical context. This work underscores the\nneed for more advanced approaches to spatial understanding and reasoning,\npaving the way for improvements in vision-language models and their alignment\nwith human-like spatial capabilities. The dataset will be open-sourced upon\npublication.", "paper_summary_zh": "目前的視覺語言模型可能結合單維度的空間線索，例如深度、物體邊界和基本的空間方向（例如左、右、前、後），但通常缺乏人類理解和實際應用所需的多維度空間推理。為了解決這個差距，我們開發了 SPHERE（空間感知和推理的分層評估），一個分層評估框架，包含一個新的由人類標註的資料集，用於精確定位模型的優點和缺點，從單技能任務進展到多技能任務，最終到需要整合多種空間和視覺線索與邏輯推理的複雜推理任務。對最先進的開源模型的基準評估揭示了顯著的缺點，特別是在理解距離和接近度、從以自我為中心和以世界為中心的觀點進行推理，以及在物理環境中執行複雜推理的能力方面。這項工作強調了對空間理解和推理需要更先進的方法，為視覺語言模型的改進以及它們與類人空間能力的對齊鋪平了道路。該資料集將在發布後開源。", "author": "Wenyu Zhang et.al.", "authors": "Wenyu Zhang, Wei En Ng, Lixin Ma, Yuwen Wang, Jungqi Zhao, Boyang Li, Lu Wang", "id": "2412.12693v1", "paper_url": "http://arxiv.org/abs/2412.12693v1", "repo": "null"}}