{"2411.07527": {"publish_time": "2024-11-12", "title": "Prompt-enhanced Network for Hateful Meme Classification", "paper_summary": "The dynamic expansion of social media has led to an inundation of hateful\nmemes on media platforms, accentuating the growing need for efficient\nidentification and removal. Acknowledging the constraints of conventional\nmultimodal hateful meme classification, which heavily depends on external\nknowledge and poses the risk of including irrelevant or redundant content, we\ndeveloped Pen -- a prompt-enhanced network framework based on the prompt\nlearning approach. Specifically, after constructing the sequence through the\nprompt method and encoding it with a language model, we performed region\ninformation global extraction on the encoded sequence for multi-view\nperception. By capturing global information about inference instances and\ndemonstrations, Pen facilitates category selection by fully leveraging sequence\ninformation. This approach significantly improves model classification\naccuracy. Additionally, to bolster the model's reasoning capabilities in the\nfeature space, we introduced prompt-aware contrastive learning into the\nframework to improve the quality of sample feature distributions. Through\nextensive ablation experiments on two public datasets, we evaluate the\neffectiveness of the Pen framework, concurrently comparing it with\nstate-of-the-art model baselines. Our research findings highlight that Pen\nsurpasses manual prompt methods, showcasing superior generalization and\nclassification accuracy in hateful meme classification tasks. Our code is\navailable at https://github.com/juszzi/Pen.", "paper_summary_zh": "<paragraph>社群媒體的動態擴張導致媒體平台上充斥著仇恨迷因，凸顯出對有效識別和移除的需求日益增長。承認傳統多模態仇恨迷因分類的限制，它過度依賴外部知識，並有包含不相關或重複內容的風險，我們開發了 Pen ——一種基於提示學習方法的提示增強網路架構。具體來說，在通過提示方法建構序列並使用語言模型對其編碼後，我們對編碼序列執行區域資訊全局提取，以進行多視角感知。透過擷取關於推理實例和示範的全局資訊，Pen 能夠充分利用序列資訊來促進類別選擇。此方法顯著提高了模型分類準確度。此外，為了加強模型在特徵空間中的推理能力，我們將提示感知對比學習引入框架，以提高樣本特徵分佈的品質。透過在兩個公開資料集上進行廣泛的消融實驗，我們評估了 Pen 框架的有效性，並同時將其與最先進的模型基準進行比較。我們的研究結果強調，Pen 超越了手動提示方法，在仇恨迷因分類任務中展現出優異的泛化能力和分類準確度。我們的程式碼可於 https://github.com/juszzi/Pen 取得。</paragraph>", "author": "Junxi Liu et.al.", "authors": "Junxi Liu, Yanyan Feng, Jiehai Chen, Yun Xue, Fenghuan Li", "id": "2411.07527v1", "paper_url": "http://arxiv.org/abs/2411.07527v1", "repo": "https://github.com/juszzi/pen"}}