{"2502.14260": {"publish_time": "2025-02-20", "title": "EyeBench: A Call for More Rigorous Evaluation of Retinal Image Enhancement", "paper_summary": "Over the past decade, generative models have achieved significant success in\nenhancement fundus images.However, the evaluation of these models still\npresents a considerable challenge. A comprehensive evaluation benchmark for\nfundus image enhancement is indispensable for three main reasons: 1) The\nexisting denoising metrics (e.g., PSNR, SSIM) are hardly to extend to\ndownstream real-world clinical research (e.g., Vessel morphology consistency).\n2) There is a lack of comprehensive evaluation for both paired and unpaired\nenhancement methods, along with the need for expert protocols to accurately\nassess clinical value. 3) An ideal evaluation system should provide insights to\ninform future developments of fundus image enhancement. To this end, we propose\na novel comprehensive benchmark, EyeBench, to provide insights that align\nenhancement models with clinical needs, offering a foundation for future work\nto improve the clinical relevance and applicability of generative models for\nfundus image enhancement. EyeBench has three appealing properties: 1)\nmulti-dimensional clinical alignment downstream evaluation: In addition to\nevaluating the enhancement task, we provide several clinically significant\ndownstream tasks for fundus images, including vessel segmentation, DR grading,\ndenoising generalization, and lesion segmentation. 2) Medical expert-guided\nevaluation design: We introduce a novel dataset that promote comprehensive and\nfair comparisons between paired and unpaired methods and includes a manual\nevaluation protocol by medical experts. 3) Valuable insights: Our benchmark\nstudy provides a comprehensive and rigorous evaluation of existing methods\nacross different downstream tasks, assisting medical experts in making informed\nchoices. Additionally, we offer further analysis of the challenges faced by\nexisting methods. The code is available at\n\\url{https://github.com/Retinal-Research/EyeBench}", "paper_summary_zh": "<paragraph>在過去的十年中，生成模型在增強眼底影像方面取得了顯著的成功。然而，這些模型的評估仍然是一個相當大的挑戰。一個全面的眼底影像增強評估基準對於三個主要原因是不可或缺的：1) 現有的去噪指標（例如 PSNR、SSIM）很難擴展到下游的真實世界臨床研究（例如血管形態一致性）。2) 缺乏對配對和非配對增強方法的全面評估，以及需要專家協議來準確評估臨床價值。3) 一個理想的評估系統應該提供見解，以告知眼底影像增強的未來發展。為此，我們提出了一個新的綜合基準 EyeBench，以提供見解，將增強模型與臨床需求相結合，為未來的研究奠定基礎，以提高生成模型在眼底影像增強方面的臨床相關性和適用性。EyeBench 有三個吸引人的特性：1) 多維臨床對齊下游評估：除了評估增強任務外，我們還為眼底影像提供了幾個臨床上重要的下游任務，包括血管分割、DR 分級、去噪泛化和病灶分割。2) 醫學專家指導的評估設計：我們引入了一個新的數據集，以促進對配對和非配對方法的全面和公平比較，並包括由醫學專家進行的手動評估協議。3) 有價值的見解：我們的基準研究提供了對現有方法在不同下游任務中的全面且嚴格的評估，協助醫學專家做出明智的選擇。此外，我們還進一步分析了現有方法面臨的挑戰。程式碼可在 \\url{https://github.com/Retinal-Research/EyeBench} 獲得</paragraph>", "author": "Wenhui Zhu et.al.", "authors": "Wenhui Zhu, Xuanzhao Dong, Xin Li, Yujian Xiong, Xiwen Chen, Peijie Qiu, Vamsi Krishna Vasa, Zhangsihao Yang, Yi Su, Oana Dumitrascu, Yalin Wang", "id": "2502.14260v1", "paper_url": "http://arxiv.org/abs/2502.14260v1", "repo": "null"}}