{"2410.06814": {"publish_time": "2024-10-09", "title": "Defending Membership Inference Attacks via Privacy-aware Sparsity Tuning", "paper_summary": "Over-parameterized models are typically vulnerable to membership inference\nattacks, which aim to determine whether a specific sample is included in the\ntraining of a given model. Previous Weight regularizations (e.g., L1\nregularization) typically impose uniform penalties on all parameters, leading\nto a suboptimal tradeoff between model utility and privacy. In this work, we\nfirst show that only a small fraction of parameters substantially impact the\nprivacy risk. In light of this, we propose Privacy-aware Sparsity Tuning\n(PAST), a simple fix to the L1 Regularization, by employing adaptive penalties\nto different parameters. Our key idea behind PAST is to promote sparsity in\nparameters that significantly contribute to privacy leakage. In particular, we\nconstruct the adaptive weight for each parameter based on its privacy\nsensitivity, i.e., the gradient of the loss gap with respect to the parameter.\nUsing PAST, the network shrinks the loss gap between members and non-members,\nleading to strong resistance to privacy attacks. Extensive experiments\ndemonstrate the superiority of PAST, achieving a state-of-the-art balance in\nthe privacy-utility trade-off.", "paper_summary_zh": "過度參數化的模型通常容易受到成員推論攻擊，其目的是確定特定範例是否包含在給定模型的訓練中。先前的權重正則化（例如 L1 正則化）通常對所有參數施加均勻的懲罰，導致模型實用性與隱私之間的權衡取捨不佳。在這項工作中，我們首先展示只有少部分參數會大幅影響隱私風險。有鑑於此，我們提出具有隱私意識的稀疏調整 (PAST)，一種透過對不同參數採用自適應懲罰來對 L1 正則化進行簡單修正的方法。PAST 背後的主要概念是促進對導致隱私外洩有重大影響的參數中的稀疏性。特別是，我們根據每個參數的隱私敏感度（即損失差距相對於參數的梯度）來建構自適應權重。使用 PAST，網路會縮小成員和非成員之間的損失差距，從而對隱私攻擊產生強大的抵抗力。廣泛的實驗證明了 PAST 的優越性，在隱私實用性權衡中取得了最先進的平衡。", "author": "Qiang Hu et.al.", "authors": "Qiang Hu, Hengxiang Zhang, Hongxin Wei", "id": "2410.06814v1", "paper_url": "http://arxiv.org/abs/2410.06814v1", "repo": "null"}}