{"2406.17245": {"publish_time": "2024-06-25", "title": "Unlocking Continual Learning Abilities in Language Models", "paper_summary": "Language models (LMs) exhibit impressive performance and generalization\ncapabilities. However, LMs struggle with the persistent challenge of\ncatastrophic forgetting, which undermines their long-term sustainability in\ncontinual learning (CL). Existing approaches usually address the issue by\nincorporating old task data or task-wise inductive bias into LMs. However, old\ndata and accurate task information are often unavailable or costly to collect,\nhindering the availability of current CL approaches for LMs. To address this\nlimitation, we introduce $\\textbf{MIGU}$ ($\\textbf{M}$agn$\\textbf{I}$tude-based\n$\\textbf{G}$radient $\\textbf{U}$pdating for continual learning), a\nrehearsal-free and task-label-free method that only updates the model\nparameters with large magnitudes of output in LMs' linear layers. MIGU is based\non our observation that the L1-normalized magnitude distribution of the output\nin LMs' linear layers is different when the LM models deal with different task\ndata. By imposing this simple constraint on the gradient update process, we can\nleverage the inherent behaviors of LMs, thereby unlocking their innate CL\nabilities. Our experiments demonstrate that MIGU is universally applicable to\nall three LM architectures (T5, RoBERTa, and Llama2), delivering\nstate-of-the-art or on-par performance across continual finetuning and\ncontinual pre-training settings on four CL benchmarks. For example, MIGU brings\na 15.2% average accuracy improvement over conventional parameter-efficient\nfinetuning baselines in a 15-task CL benchmark. MIGU can also seamlessly\nintegrate with all three existing CL types to further enhance performance. Code\nis available at \\href{https://github.com/wenyudu/MIGU}{this https URL}.", "paper_summary_zh": "<paragraph>語言模型 (LM) 展現出令人印象深刻的效能和概化能力。然而，LM 面臨持續的災難性遺忘挑戰，這會損害其在持續學習 (CL) 中的長期永續性。現有方法通常透過將舊任務資料或任務明智的歸納偏差納入 LM 來解決這個問題。然而，舊資料和準確的任務資訊通常無法取得或收集成本高昂，這阻礙了目前 LM 的 CL 方法的可用性。為了解決這個限制，我們引入了 $\\textbf{MIGU}$（$\\textbf{M}$agn$\\textbf{I}$tude-based $\\textbf{G}$radient $\\textbf{U}$pdating for continual learning），一種無需複習和任務標籤的方法，它只更新 LM 線性層中輸出幅度大的模型參數。MIGU 基於我們的觀察，即當 LM 模型處理不同的任務資料時，LM 線性層中輸出的 L1 標準化幅度分佈是不同的。透過對梯度更新過程施加這個簡單的約束，我們可以利用 LM 的固有行為，從而解鎖其天生的 CL 能力。我們的實驗證明，MIGU 普遍適用於所有三種 LM 架構（T5、RoBERTa 和 Llama2），在四個 CL 基準上提供最先進或同等的效能，包括持續微調和持續預訓練設定。例如，在 15 個任務的 CL 基準中，MIGU 比傳統的參數有效微調基準提高了 15.2% 的平均準確度。MIGU 也可以無縫整合所有三種類型的現有 CL，以進一步提升效能。程式碼可在 \\href{https://github.com/wenyudu/MIGU}{這個 https URL} 取得。</paragraph>", "author": "Wenyu Du et.al.", "authors": "Wenyu Du, Shuang Cheng, Tongxu Luo, Zihan Qiu, Zeyu Huang, Ka Chun Cheung, Reynold Cheng, Jie Fu", "id": "2406.17245v1", "paper_url": "http://arxiv.org/abs/2406.17245v1", "repo": "https://github.com/wenyudu/migu"}}