{"2409.16626": {"publish_time": "2024-09-25", "title": "Ascend HiFloat8 Format for Deep Learning", "paper_summary": "This preliminary white paper proposes a novel 8-bit floating-point data\nformat HiFloat8 (abbreviated as HiF8) for deep learning. HiF8 features tapered\nprecision. For normal value encoding, it provides 7 exponents with 3-bit\nmantissa, 8 exponents with 2-bit mantissa, and 16 exponents with 1-bit\nmantissa. For denormal or subnormal value encoding, it extends the dynamic\nrange by 7 extra powers of 2, from 31 to 38 binades (notice that FP16 covers 40\nbinades). Meanwhile, HiF8 encodes all the special values except that positive\nzero and negative zero are represented by only one bit-pattern. Thanks to the\nbetter balance between precision and dynamic range, HiF8 can be simultaneously\nused in both forward and backward passes of AI training. In this paper, we will\ndescribe the definition and rounding methods of HiF8, as well as the tentative\ntraining and inference solutions. To demonstrate the efficacy of HiF8 format,\nmassive simulation results on various neural networks, including traditional\nneural networks and large language models (LLMs), will also be presented.", "paper_summary_zh": "這份初步白皮書提出了一種新的 8 位浮點數據格式 HiFloat8 (簡稱 HiF8)，用於深度學習。HiF8 特色為漸變精度。對於一般數值編碼，它提供 7 個指數搭配 3 位尾數、8 個指數搭配 2 位尾數，以及 16 個指數搭配 1 位尾數。對於非正規或次正規數值編碼，它將動態範圍延伸 7 個額外的 2 的次方，從 31 到 38 個雙進位（請注意 FP16 涵蓋 40 個雙進位）。同時，HiF8 編碼所有特殊數值，但正零和負零僅以一個位元模式表示。由於精度和動態範圍之間取得了更好的平衡，因此 HiF8 可以同時用於 AI 訓練的前向和後向傳遞。在本文中，我們將描述 HiF8 的定義和捨入方法，以及暫定的訓練和推理解決方案。為了展示 HiF8 格式的效力，我們也會提供在各種神經網路上的大量模擬結果，包括傳統神經網路和大型語言模型 (LLM)。", "author": "Yuanyong Luo et.al.", "authors": "Yuanyong Luo, Zhongxing Zhang, Richard Wu, Hu Liu, Ying Jin, Kai Zheng, Minmin Wang, Zhanying He, Guipeng Hu, Luyao Chen, Tianchi Hu, Junsong Wang, Minqi Chen, Mikhaylov Dmitry, Korviakov Vladimir, Bobrin Maxim, Yuhao Hu, Guanfu Chen, Zeyi Huang", "id": "2409.16626v1", "paper_url": "http://arxiv.org/abs/2409.16626v1", "repo": "null"}}