{"2410.18057": {"publish_time": "2024-10-23", "title": "CLEAR: Character Unlearning in Textual and Visual Modalities", "paper_summary": "Machine Unlearning (MU) is critical for enhancing privacy and security in\ndeep learning models, particularly in large multimodal language models (MLLMs),\nby removing specific private or hazardous information. While MU has made\nsignificant progress in textual and visual modalities, multimodal unlearning\n(MMU) remains significantly underexplored, partially due to the absence of a\nsuitable open-source benchmark. To address this, we introduce CLEAR, a new\nbenchmark designed to evaluate MMU methods. CLEAR contains 200 fictitious\nindividuals and 3,700 images linked with corresponding question-answer pairs,\nenabling a thorough evaluation across modalities. We assess 10 MU methods,\nadapting them for MMU, and highlight new challenges specific to multimodal\nforgetting. We also demonstrate that simple $\\ell_1$ regularization on LoRA\nweights significantly mitigates catastrophic forgetting, preserving model\nperformance on retained data. The dataset is available at\nhttps://huggingface.co/datasets/therem/CLEAR", "paper_summary_zh": "機器去學習（MU）對於增強深度學習模型的隱私和安全性至關重要，特別是在大型多模態語言模型（MLLM）中，透過移除特定的私人或有害資訊。儘管 MU 在文字和視覺模式方面已取得顯著進展，但多模態去學習（MMU）仍顯著未被充分探討，部分原因是缺乏適當的開源基準。為了解決這個問題，我們引入了 CLEAR，一個新的基準，旨在評估 MMU 方法。CLEAR 包含 200 個虛構人物和 3,700 張與對應問題答案配對的圖片，可以在不同的模式中進行徹底的評估。我們評估了 10 種 MU 方法，並將它們調整為 MMU，並強調了多模態遺忘的特定新挑戰。我們還展示了 LoRA 權重上的簡單 $\\ell_1$ 正則化顯著減輕了災難性遺忘，保留了模型在保留資料上的效能。資料集可在 https://huggingface.co/datasets/therem/CLEAR 取得", "author": "Alexey Dontsov et.al.", "authors": "Alexey Dontsov, Dmitrii Korzh, Alexey Zhavoronkin, Boris Mikheev, Denis Bobkov, Aibek Alanov, Oleg Y. Rogov, Ivan Oseledets, Elena Tutubalina", "id": "2410.18057v1", "paper_url": "http://arxiv.org/abs/2410.18057v1", "repo": "null"}}