{"2407.06800": {"publish_time": "2024-07-09", "title": "Learn and Don't Forget: Adding a New Language to ASR Foundation Models", "paper_summary": "Foundation ASR models often support many languages, e.g. 100 languages in\nWhisper. However, there has been limited work on integrating an additional,\ntypically low-resource, language, while maintaining performance on the original\nlanguage set. Fine-tuning, while simple, may degrade the accuracy of the\noriginal set. We compare three approaches that exploit adaptation parameters:\nsoft language code tuning, train only the language code; soft prompt tuning,\ntrain prepended tokens; and LoRA where a small set of additional parameters are\noptimised. Elastic Weight Consolidation (EWC) offers an alternative compromise\nwith the potential to maintain performance in specific target languages.\nResults show that direct fine-tuning yields the best performance for the new\nlanguage but degrades existing language capabilities. EWC can address this\nissue for specific languages. If only adaptation parameters are used, the\nlanguage capabilities are maintained but at the cost of performance in the new\nlanguage.", "paper_summary_zh": "基礎 ASR 模型通常支援多種語言，例如 Whisper 中的 100 種語言。然而，在整合額外的、通常是低資源的語言時，同時維持原始語言組的效能方面，一直有工作限制。微調雖然簡單，但可能會降低原始組的準確度。我們比較了利用適應參數的三種方法：軟語言代碼微調、僅訓練語言代碼；軟提示微調、訓練前置符號；以及 LoRA，其中最佳化了一小組額外的參數。彈性權重整合 (EWC) 提供了一種替代折衷方案，有潛力維持特定目標語言的效能。結果顯示，直接微調會為新語言產生最佳效能，但會降低現有語言的能力。EWC 可以解決特定語言的這個問題。如果只使用適應參數，語言能力會被維持，但代價是新語言的效能。", "author": "Mengjie Qian et.al.", "authors": "Mengjie Qian, Siyuan Tang, Rao Ma, Kate M. Knill, Mark J. F. Gales", "id": "2407.06800v1", "paper_url": "http://arxiv.org/abs/2407.06800v1", "repo": "null"}}