{"2408.00818": {"publish_time": "2024-08-01", "title": "Y Social: an LLM-powered Social Media Digital Twin", "paper_summary": "In this paper we introduce Y, a new-generation digital twin designed to\nreplicate an online social media platform. Digital twins are virtual replicas\nof physical systems that allow for advanced analyses and experimentation. In\nthe case of social media, a digital twin such as Y provides a powerful tool for\nresearchers to simulate and understand complex online interactions. {\\tt Y}\nleverages state-of-the-art Large Language Models (LLMs) to replicate\nsophisticated agent behaviors, enabling accurate simulations of user\ninteractions, content dissemination, and network dynamics. By integrating these\naspects, Y offers valuable insights into user engagement, information spread,\nand the impact of platform policies. Moreover, the integration of LLMs allows Y\nto generate nuanced textual content and predict user responses, facilitating\nthe study of emergent phenomena in online environments.\n  To better characterize the proposed digital twin, in this paper we describe\nthe rationale behind its implementation, provide examples of the analyses that\ncan be performed on the data it enables to be generated, and discuss its\nrelevance for multidisciplinary research.", "paper_summary_zh": "<paragraph>在本文中，我們介紹了 Y，一種新一代的數位雙胞胎，旨在複製線上社群媒體平台。數位雙胞胎是實體系統的虛擬複製品，允許進行進階分析和實驗。在社群媒體的情況下，像 Y 這樣的數位雙胞胎為研究人員提供了強大的工具，可以模擬和了解複雜的線上互動。{\\tt Y} 採用最先進的大語言模型 (LLM) 來複製複雜的代理人行為，實現使用者互動、內容傳播和網路動態的精確模擬。透過整合這些面向，Y 提供了關於使用者參與度、資訊傳播和平台政策影響的寶貴見解。此外，整合 LLM 讓 Y 能夠產生細緻入微的文字內容並預測使用者的回應，促進對線上環境中新興現象的研究。為了更好地描述所提出的數位雙胞胎，在本文中，我們說明了其實作背後的原理，提供了可以在其所啟用的資料上執行的分析範例，並探討其對跨領域研究的相關性。</paragraph>", "author": "Giulio Rossetti et.al.", "authors": "Giulio Rossetti, Massimo Stella, Rémy Cazabet, Katherine Abramski, Erica Cau, Salvatore Citraro, Andrea Failla, Riccardo Improta, Virginia Morini, Valentina Pansanella", "id": "2408.00818v1", "paper_url": "http://arxiv.org/abs/2408.00818v1", "repo": "null"}}