{"2503.10452": {"publish_time": "2025-03-13", "title": "DynaCode: A Dynamic Complexity-Aware Code Benchmark for Evaluating Large Language Models in Code Generation", "paper_summary": "The rapid advancement of large language models (LLMs) has significantly\nimproved their performance in code generation tasks. However, existing code\nbenchmarks remain static, consisting of fixed datasets with predefined\nproblems. This makes them vulnerable to memorization during training, where\nLLMs recall specific test cases instead of generalizing to new problems,\nleading to data contamination and unreliable evaluation results. To address\nthese issues, we introduce DynaCode, a dynamic, complexity-aware benchmark that\novercomes the limitations of static datasets. DynaCode evaluates LLMs\nsystematically using a complexity-aware metric, incorporating both code\ncomplexity and call-graph structures. DynaCode achieves large-scale diversity,\ngenerating up to 189 million unique nested code problems across four distinct\nlevels of code complexity, referred to as units, and 16 types of call graphs.\nResults on 12 latest LLMs show an average performance drop of 16.8% to 45.7%\ncompared to MBPP+, a static code generation benchmark, with performance\nprogressively decreasing as complexity increases. This demonstrates DynaCode's\nability to effectively differentiate LLMs. Additionally, by leveraging call\ngraphs, we gain insights into LLM behavior, particularly their preference for\nhandling subfunction interactions within nested code.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 的快速發展顯著提升了它們在程式碼生成任務中的效能。然而，現有的程式碼基準測試仍然是靜態的，由具有預定義問題的固定資料集組成。這使得它們在訓練過程中容易被記憶，LLM 會回想起特定的測試案例，而不是泛化到新的問題，導致資料污染和不可靠的評估結果。為了應對這些問題，我們引入了 DynaCode，這是一個動態的、具有複雜度感知能力的基準測試，克服了靜態資料集的局限性。DynaCode 使用具有複雜度感知能力的指標系統地評估 LLM，結合了程式碼複雜度和呼叫圖結構。DynaCode 实现了大规模多样性，在四個不同的程式碼複雜度級別（稱為單元）和 16 種類型的呼叫圖中生成了多達 1.89 億個獨特的巢狀程式碼問題。在 12 個最新的 LLM 上的結果顯示，與靜態程式碼生成基準測試 MBPP+ 相比，平均效能下降了 16.8% 到 45.7%，且隨著複雜度的增加，效能逐漸下降。這證明了 DynaCode有效區分 LLM 的能力。此外，透過利用呼叫圖，我們可以深入了解 LLM 的行為，尤其是它們對處理巢狀程式碼中子函數交互的偏好。</paragraph>\n", "author": "Wenhao Hu et.al.", "authors": "Wenhao Hu, Jinhao Duan, Chunchen Wei, Li Zhang, Yue Zhang, Kaidi Xu", "id": "2503.10452v1", "paper_url": "http://arxiv.org/abs/2503.10452v1", "repo": "null"}}