{"2410.03642": {"publish_time": "2024-10-04", "title": "Aligning LLMs with Individual Preferences via Interaction", "paper_summary": "As large language models (LLMs) demonstrate increasingly advanced\ncapabilities, aligning their behaviors with human values and preferences\nbecomes crucial for their wide adoption. While previous research focuses on\ngeneral alignment to principles such as helpfulness, harmlessness, and honesty,\nthe need to account for individual and diverse preferences has been largely\noverlooked, potentially undermining customized human experiences. To address\nthis gap, we train LLMs that can ''interact to align'', essentially cultivating\nthe meta-skill of LLMs to implicitly infer the unspoken personalized\npreferences of the current user through multi-turn conversations, and then\ndynamically align their following behaviors and responses to these inferred\npreferences. Our approach involves establishing a diverse pool of 3,310\ndistinct user personas by initially creating seed examples, which are then\nexpanded through iterative self-generation and filtering. Guided by distinct\nuser personas, we leverage multi-LLM collaboration to develop a multi-turn\npreference dataset containing 3K+ multi-turn conversations in tree structures.\nFinally, we apply supervised fine-tuning and reinforcement learning to enhance\nLLMs using this dataset. For evaluation, we establish the ALOE (ALign With\nCustOmized PrEferences) benchmark, consisting of 100 carefully selected\nexamples and well-designed metrics to measure the customized alignment\nperformance during conversations. Experimental results demonstrate the\neffectiveness of our method in enabling dynamic, personalized alignment via\ninteraction.", "paper_summary_zh": "隨著大型語言模型 (LLM) 展現出越來越先進的能力，讓它們的行為與人類的價值觀和偏好保持一致，對於它們的廣泛採用至關重要。雖然先前的研究專注於對諸如樂於助人、無害和誠實等原則的一般性對齊，但對個人和不同偏好的需求在很大程度上被忽視了，這可能會破壞客製化的人類體驗。為了解決這個差距，我們訓練了能夠「互動對齊」的 LLM，本質上培養了 LLM 的元技能，透過多輪對話隱含推斷當前使用者的未說出口的個人化偏好，然後動態對齊其後續行為和回應，以符合這些推斷出的偏好。我們的做法包括建立一個由 3,310 個不同的使用者角色組成的多元化池，最初透過建立種子範例，然後透過反覆自我產生和過濾來擴展。在不同的使用者角色的指導下，我們利用多 LLM 協作來開發一個多輪偏好資料集，其中包含樹狀結構中的 3K 多個多輪對話。最後，我們應用監督微調和強化學習，使用此資料集來增強 LLM。為了評估，我們建立了 ALOE（與客製化偏好對齊）基準，其中包含 100 個經過仔細挑選的範例和精心設計的指標，用於衡量對話期間的客製化對齊效能。實驗結果證明了我們的方法在透過互動實現動態、個人化對齊方面的有效性。", "author": "Shujin Wu et.al.", "authors": "Shujin Wu, May Fung, Cheng Qian, Jeonghwan Kim, Dilek Hakkani-Tur, Heng Ji", "id": "2410.03642v1", "paper_url": "http://arxiv.org/abs/2410.03642v1", "repo": "https://github.com/shujinwu-0814/aloe"}}