{"2412.17364": {"publish_time": "2024-12-23", "title": "Efficient fine-tuning methodology of text embedding models for information retrieval: contrastive learning penalty (clp)", "paper_summary": "Text embedding models play a crucial role in natural language processing,\nparticularly in information retrieval, and their importance is further\nhighlighted with the recent utilization of RAG (Retrieval- Augmented\nGeneration). This study presents an efficient fine-tuning methodology\nencompassing data selection, loss function, and model architecture to enhance\nthe information retrieval performance of pre-trained text embedding models. In\nparticular, this study proposes a novel Contrastive Learning Penalty function\nthat overcomes the limitations of existing Contrastive Learning. The proposed\nmethodology achieves significant performance improvements over existing methods\nin document retrieval tasks. This study is expected to contribute to improving\nthe performance of information retrieval systems through fine-tuning of text\nembedding models. The code for this study can be found at\nhttps://github.com/CreaLabs/Enhanced-BGE-M3-with-CLP-and-MoE, and the\nbest-performing model can be found at https://huggingface.co/CreaLabs.", "paper_summary_zh": "文本嵌入模型在自然語言處理中扮演著至關重要的角色，特別是在資訊檢索中，而其重要性隨著最近利用 RAG（檢索增強生成）而進一步凸顯。本研究提出了一種有效微調方法，包含資料選擇、損失函數和模型架構，以增強預訓練文本嵌入模型的資訊檢索效能。特別是，本研究提出了一個新穎的對比學習懲罰函數，克服了現有對比學習的限制。所提出的方法在文件檢索任務中，比現有方法獲得顯著的效能提升。預期本研究將有助於透過微調文本嵌入模型來提升資訊檢索系統的效能。本研究的程式碼可以在 https://github.com/CreaLabs/Enhanced-BGE-M3-with-CLP-and-MoE 中找到，而效能最佳的模型可以在 https://huggingface.co/CreaLabs 中找到。", "author": "Jeongsu Yu et.al.", "authors": "Jeongsu Yu", "id": "2412.17364v1", "paper_url": "http://arxiv.org/abs/2412.17364v1", "repo": "https://github.com/crealabs/enhanced-bge-m3-with-clp-and-moe"}}