{"2410.05269": {"publish_time": "2024-10-07", "title": "Data Advisor: Dynamic Data Curation for Safety Alignment of Large Language Models", "paper_summary": "Data is a crucial element in large language model (LLM) alignment. Recent\nstudies have explored using LLMs for efficient data collection. However,\nLLM-generated data often suffers from quality issues, with underrepresented or\nabsent aspects and low-quality datapoints. To address these problems, we\npropose Data Advisor, an enhanced LLM-based method for generating data that\ntakes into account the characteristics of the desired dataset. Starting from a\nset of pre-defined principles in hand, Data Advisor monitors the status of the\ngenerated data, identifies weaknesses in the current dataset, and advises the\nnext iteration of data generation accordingly. Data Advisor can be easily\nintegrated into existing data generation methods to enhance data quality and\ncoverage. Experiments on safety alignment of three representative LLMs (i.e.,\nMistral, Llama2, and Falcon) demonstrate the effectiveness of Data Advisor in\nenhancing model safety against various fine-grained safety issues without\nsacrificing model utility.", "paper_summary_zh": "資料是大型語言模型（LLM）調整中的關鍵元素。最近的研究已探討使用 LLM 來進行有效率的資料收集。然而，由 LLM 生成的資料常有品質問題，包括代表性不足或遺漏面向，以及品質低落資料點。為了解決這些問題，我們提出資料顧問，這是一種進階的基於 LLM 的方法，用於生成資料，並考量到所需資料集的特徵。從一組預先定義的手邊原則開始，資料顧問會監控已生成資料的狀態，識別目前資料集的弱點，並據此建議下一次資料生成的迭代。資料顧問可以輕易整合到現有的資料生成方法中，以提升資料品質和涵蓋範圍。針對三個具代表性的 LLM（例如 Mistral、Llama2 和 Falcon）的安全調整進行的實驗，證明了資料顧問在提升模型安全，以對抗各種細微的安全問題，同時不犧牲模型效用的有效性。", "author": "Fei Wang et.al.", "authors": "Fei Wang, Ninareh Mehrabi, Palash Goyal, Rahul Gupta, Kai-Wei Chang, Aram Galstyan", "id": "2410.05269v1", "paper_url": "http://arxiv.org/abs/2410.05269v1", "repo": "null"}}