{"2411.19913": {"publish_time": "2024-11-29", "title": "Quantifying the synthetic and real domain gap in aerial scene understanding", "paper_summary": "Quantifying the gap between synthetic and real-world imagery is essential for\nimproving both transformer-based models - that rely on large volumes of data -\nand datasets, especially in underexplored domains like aerial scene\nunderstanding where the potential impact is significant. This paper introduces\na novel methodology for scene complexity assessment using Multi-Model Consensus\nMetric (MMCM) and depth-based structural metrics, enabling a robust evaluation\nof perceptual and structural disparities between domains. Our experimental\nanalysis, utilizing real-world (Dronescapes) and synthetic (Skyscenes)\ndatasets, demonstrates that real-world scenes generally exhibit higher\nconsensus among state-of-the-art vision transformers, while synthetic scenes\nshow greater variability and challenge model adaptability. The results\nunderline the inherent complexities and domain gaps, emphasizing the need for\nenhanced simulation fidelity and model generalization. This work provides\ncritical insights into the interplay between domain characteristics and model\nperformance, offering a pathway for improved domain adaptation strategies in\naerial scene understanding.", "paper_summary_zh": "量化合成影像與真實世界影像之間的差距對於改進依賴大量資料的Transformer模型和資料集至關重要，特別是在潛在影響重大的未探索領域中，例如空中場景理解。本文介紹了一種使用多模型共識指標 (MMCM) 和基於深度的結構指標對場景複雜性進行評估的新方法，從而能夠對不同領域之間的感知和結構差異進行穩健評估。我們的實驗分析利用真實世界 (Dronescapes) 和合成 (Skyscenes) 資料集，證明真實世界的場景通常在最先進的視覺Transformer之間表現出更高的共識，而合成場景則表現出更大的變異性和挑戰模型適應性。結果強調了固有的複雜性和領域差距，強調了增強模擬保真度和模型泛化的必要性。這項工作提供了對領域特徵和模型效能之間相互作用的重要見解，為空中場景理解中改進的領域適應策略提供了途徑。", "author": "Alina Marcu et.al.", "authors": "Alina Marcu", "id": "2411.19913v1", "paper_url": "http://arxiv.org/abs/2411.19913v1", "repo": "null"}}