{"2405.14379": {"publish_time": "2024-05-23", "title": "Can Large Language Models Create New Knowledge for Spatial Reasoning Tasks?", "paper_summary": "The potential for Large Language Models (LLMs) to generate new information\noffers a potential step change for research and innovation. This is challenging\nto assert as it can be difficult to determine what an LLM has previously seen\nduring training, making \"newness\" difficult to substantiate. In this paper we\nobserve that LLMs are able to perform sophisticated reasoning on problems with\na spatial dimension, that they are unlikely to have previously directly\nencountered. While not perfect, this points to a significant level of\nunderstanding that state-of-the-art LLMs can now achieve, supporting the\nproposition that LLMs are able to yield significant emergent properties. In\nparticular, Claude 3 is found to perform well in this regard.", "paper_summary_zh": "大型語言模型 (LLM) 產生新資訊的潛力為研究和創新提供了潛在的階躍式變革。這一點很難斷言，因為難以確定 LLM 在訓練期間先前看過什麼，這使得「新穎性」難以證實。在本文中，我們觀察到 LLM 能夠對具有空間維度的問題執行複雜的推理，而這些問題不太可能在以前直接遇到過。雖然並不完美，但這表明了最先進的 LLM 現在可以達到的顯著理解水平，支持了 LLM 能夠產生顯著的新興特性的主張。特別是，發現 Claude 3 在這方面表現良好。", "author": "Thomas Greatrix et.al.", "authors": "Thomas Greatrix, Roger Whitaker, Liam Turner, Walter Colombo", "id": "2405.14379v1", "paper_url": "http://arxiv.org/abs/2405.14379v1", "repo": "null"}}