{"2405.18877": {"publish_time": "2024-05-29", "title": "Continuous Product Graph Neural Networks", "paper_summary": "Processing multidomain data defined on multiple graphs holds significant\npotential in various practical applications in computer science. However,\ncurrent methods are mostly limited to discrete graph filtering operations.\nTensorial partial differential equations on graphs (TPDEGs) provide a\nprincipled framework for modeling structured data across multiple interacting\ngraphs, addressing the limitations of the existing discrete methodologies. In\nthis paper, we introduce Continuous Product Graph Neural Networks (CITRUS) that\nemerge as a natural solution to the TPDEG. CITRUS leverages the separability of\ncontinuous heat kernels from Cartesian graph products to efficiently implement\ngraph spectral decomposition. We conduct thorough theoretical analyses of the\nstability and over-smoothing properties of CITRUS in response to\ndomain-specific graph perturbations and graph spectra effects on the\nperformance. We evaluate CITRUS on well-known traffic and weather\nspatiotemporal forecasting datasets, demonstrating superior performance over\nexisting approaches.", "paper_summary_zh": "處理定義在多個圖形上的多域數據在電腦科學的各種實際應用中具有顯著的潛力。然而，目前的技術大多限於離散圖形過濾運算。圖形上的張量偏微分方程式 (TPDEG) 提供了一個原則性的架構，用於對多個相互作用圖形中的結構化數據進行建模，從而解決現有離散方法的限制。在本文中，我們介紹了連續乘積圖形神經網路 (CITRUS)，它作為 TPDEG 的自然解決方案而出現。CITRUS 利用笛卡兒圖形乘積中連續熱核的可分離性來有效實作圖形譜分解。我們對 CITRUS 的穩定性和過平滑特性進行了徹底的理論分析，以響應特定於領域的圖形擾動和圖形譜對效能的影響。我們在眾所周知的交通和天氣時空預測資料集上評估 CITRUS，證明其效能優於現有方法。", "author": "Aref Einizade et.al.", "authors": "Aref Einizade, Fragkiskos D. Malliaros, Jhony H. Giraldo", "id": "2405.18877v1", "paper_url": "http://arxiv.org/abs/2405.18877v1", "repo": "null"}}