{"2412.03941": {"publish_time": "2024-12-05", "title": "Enhancing and Accelerating Diffusion-Based Inverse Problem Solving through Measurements Optimization", "paper_summary": "Diffusion models have recently demonstrated notable success in solving\ninverse problems. However, current diffusion model-based solutions typically\nrequire a large number of function evaluations (NFEs) to generate high-quality\nimages conditioned on measurements, as they incorporate only limited\ninformation at each step. To accelerate the diffusion-based inverse\nproblem-solving process, we introduce \\textbf{M}easurements\n\\textbf{O}ptimization (MO), a more efficient plug-and-play module for\nintegrating measurement information at each step of the inverse problem-solving\nprocess. This method is comprehensively evaluated across eight diverse linear\nand nonlinear tasks on the FFHQ and ImageNet datasets. By using MO, we\nestablish state-of-the-art (SOTA) performance across multiple tasks, with key\nadvantages: (1) it operates with no more than 100 NFEs, with phase retrieval on\nImageNet being the sole exception; (2) it achieves SOTA or near-SOTA results\neven at low NFE counts; and (3) it can be seamlessly integrated into existing\ndiffusion model-based solutions for inverse problems, such as DPS\n\\cite{chung2022diffusion} and Red-diff \\cite{mardani2023variational}. For\nexample, DPS-MO attains a peak signal-to-noise ratio (PSNR) of 28.71 dB on the\nFFHQ 256 dataset for high dynamic range imaging, setting a new SOTA benchmark\nwith only 100 NFEs, whereas current methods require between 1000 and 4000 NFEs\nfor comparable performance.", "paper_summary_zh": "<paragraph>擴散模型最近在解決逆問題方面展現出顯著的成功。然而，當前基於擴散模型的解決方案通常需要大量的函數評估（NFE）才能生成符合測量條件的高品質影像，因為它們在每個步驟中僅納入有限的資訊。為了加速基於擴散的逆問題求解程序，我們引入了「測量最佳化」（MO），這是一個更有效率的即插即用模組，用於在逆問題求解程序的每個步驟中整合測量資訊。此方法在 FFHQ 和 ImageNet 資料集上的八項不同的線性和非線性任務中進行了全面的評估。透過使用 MO，我們在多項任務中建立了最先進（SOTA）的效能，具備以下主要優勢：(1) 它運作時不超過 100 個 NFE，ImageNet 上的相位擷取是唯一的例外；(2) 即使在 NFE 數量較低的情況下，它也能達成 SOTA 或接近 SOTA 的結果；(3) 它可以無縫整合到現有的基於擴散模型的逆問題解決方案中，例如 DPS \\cite{chung2022diffusion} 和 Red-diff \\cite{mardani2023variational}。例如，DPS-MO 在 FFHQ 256 資料集上對於高動態範圍影像達到了 28.71 dB 的峰值信噪比（PSNR），僅使用 100 個 NFE 就設定了新的 SOTA 基準，而當前的方法需要介於 1000 到 4000 個 NFE 才能達到相近的效能。</paragraph>", "author": "Tianyu Chen et.al.", "authors": "Tianyu Chen, Zhendong Wang, Mingyuan Zhou", "id": "2412.03941v1", "paper_url": "http://arxiv.org/abs/2412.03941v1", "repo": "null"}}