{"2412.18496": {"publish_time": "2024-12-24", "title": "Generating event descriptions under syntactic and semantic constraints", "paper_summary": "With the goal of supporting scalable lexical semantic annotation, analysis,\nand theorizing, we conduct a comprehensive evaluation of different methods for\ngenerating event descriptions under both syntactic constraints -- e.g. desired\nclause structure -- and semantic constraints -- e.g. desired verb sense. We\ncompare three different methods -- (i) manual generation by experts; (ii)\nsampling from a corpus annotated for syntactic and semantic information; and\n(iii) sampling from a language model (LM) conditioned on syntactic and semantic\ninformation -- along three dimensions of the generated event descriptions: (a)\nnaturalness, (b) typicality, and (c) distinctiveness. We find that all methods\nreliably produce natural, typical, and distinctive event descriptions, but that\nmanual generation continues to produce event descriptions that are more\nnatural, typical, and distinctive than the automated generation methods. We\nconclude that the automated methods we consider produce event descriptions of\nsufficient quality for use in downstream annotation and analysis insofar as the\nmethods used for this annotation and analysis are robust to a small amount of\ndegradation in the resulting event descriptions.", "paper_summary_zh": "为了支持可扩展的词汇语义注释、分析和理论化，我们对在语法限制（例如所需的从句结构）和语义限制（例如所需的动词意义）下生成事件描述的不同方法进行了全面评估。我们比较了三种不同的方法——（i）专家手动生成；（ii）从为句法和语义信息注释的语料库中抽样；（iii）从以句法和语义信息为条件的语言模型（LM）中抽样——沿着生成事件描述的三个维度：（a）自然性、（b）典型性，和（c）独特性。我们发现所有方法都能可靠地生成自然、典型和独特的事件描述，但手动生成持续生成比自动化生成方法更自然、更典型和更独特的事件描述。我们得出结论，我们考虑的自动化方法产生的事件描述质量足以用于下游注释和分析，只要用于此注释和分析的方法对生成的事件描述中少量的退化具有鲁棒性。", "author": "Angela Cao et.al.", "authors": "Angela Cao, Faye Holt, Jonas Chan, Stephanie Richter, Lelia Glass, Aaron Steven White", "id": "2412.18496v1", "paper_url": "http://arxiv.org/abs/2412.18496v1", "repo": "https://github.com/superMereo/generating-event-descriptions"}}