{"2412.17729": {"publish_time": "2024-12-23", "title": "Chumor 2.0: Towards Benchmarking Chinese Humor Understanding", "paper_summary": "Existing humor datasets and evaluations predominantly focus on English,\nleaving limited resources for culturally nuanced humor in non-English languages\nlike Chinese. To address this gap, we construct Chumor, the first Chinese humor\nexplanation dataset that exceeds the size of existing humor datasets. Chumor is\nsourced from Ruo Zhi Ba, a Chinese Reddit-like platform known for sharing\nintellectually challenging and culturally specific jokes. We test ten LLMs\nthrough direct and chain-of-thought prompting, revealing that Chumor poses\nsignificant challenges to existing LLMs, with their accuracy slightly above\nrandom and far below human. In addition, our analysis highlights that\nhuman-annotated humor explanations are significantly better than those\ngenerated by GPT-4o and ERNIE-4-turbo. We release Chumor at\nhttps://huggingface.co/datasets/dnaihao/Chumor, our project page is at\nhttps://dnaihao.github.io/Chumor-dataset/, our leaderboard is at\nhttps://huggingface.co/spaces/dnaihao/Chumor, and our codebase is at\nhttps://github.com/dnaihao/Chumor-dataset.", "paper_summary_zh": "現有的幽默數據集和評估主要集中在英語上，\n為非英語語言（如中文）中具有文化差異的幽默留下了有限的資源。為了解決這個差距，我們構建了 Chumor，這是第一個中文幽默\n解釋數據集，其規模超過了現有的幽默數據集。Chumor 來自 Ruo Zhi Ba，一個類似於 Reddit 的中文平台，以分享具有挑戰性的智力題和具有文化特色的笑話而聞名。我們通過直接和思想鏈提示測試了十個 LLM，結果表明 Chumor 對現有的 LLM 構成了重大挑戰，其準確性僅略高於隨機，遠低於人類。此外，我們的分析強調，\n人工註釋的幽默解釋顯著優於 GPT-4o 和 ERNIE-4-turbo 生成的解釋。我們在\nhttps://huggingface.co/datasets/dnaihao/Chumor 上發布了 Chumor，我們的項目頁面在\nhttps://dnaihao.github.io/Chumor-dataset/，我們的排行榜在\nhttps://huggingface.co/spaces/dnaihao/Chumor，我們的代碼庫在\nhttps://github.com/dnaihao/Chumor-dataset。", "author": "Ruiqi He et.al.", "authors": "Ruiqi He, Yushu He, Longju Bai, Jiarui Liu, Zhenjie Sun, Zenghao Tang, He Wang, Hanchen Xia, Rada Mihalcea, Naihao Deng", "id": "2412.17729v1", "paper_url": "http://arxiv.org/abs/2412.17729v1", "repo": "https://github.com/dnaihao/chumor-dataset"}}