{"2502.04797": {"publish_time": "2025-02-07", "title": "Self-Rationalization in the Wild: A Large Scale Out-of-Distribution Evaluation on NLI-related tasks", "paper_summary": "Free-text explanations are expressive and easy to understand, but many\ndatasets lack annotated explanation data, making it challenging to train models\nfor explainable predictions. To address this, we investigate how to use\nexisting explanation datasets for self-rationalization and evaluate models'\nout-of-distribution (OOD) performance. We fine-tune T5-Large and OLMo-7B models\nand assess the impact of fine-tuning data quality, the number of fine-tuning\nsamples, and few-shot selection methods. The models are evaluated on 19 diverse\nOOD datasets across three tasks: natural language inference (NLI),\nfact-checking, and hallucination detection in abstractive summarization. For\nthe generated explanation evaluation, we conduct a human study on 13 selected\nmodels and study its correlation with the Acceptability score (T5-11B) and\nthree other LLM-based reference-free metrics. Human evaluation shows that the\nAcceptability score correlates most strongly with human judgments,\ndemonstrating its effectiveness in evaluating free-text explanations. Our\nfindings reveal: 1) few annotated examples effectively adapt models for OOD\nexplanation generation; 2) compared to sample selection strategies, fine-tuning\ndata source has a larger impact on OOD performance; and 3) models with higher\nlabel prediction accuracy tend to produce better explanations, as reflected by\nhigher Acceptability scores.", "paper_summary_zh": "自由文本說明具有表達性和易於理解，但許多資料集缺乏註解說明資料，這使得訓練可解釋預測的模型具有挑戰性。為了解決這個問題，我們研究如何使用現有的說明資料集進行自我合理化並評估模型的分布外 (OOD) 效能。我們微調 T5-Large 和 OLMo-7B 模型，並評估微調資料品質、微調樣本數量和少次選取方法的影響。這些模型在 19 個不同的 OOD 資料集上進行評估，涵蓋三個任務：自然語言推論 (NLI)、事實查核和抽象摘要中的幻覺偵測。對於產生的說明評估，我們對 13 個選定的模型進行人體研究，並研究其與可接受性評分 (T5-11B) 和其他三個基於 LLM 的無參考指標的相關性。人體評估顯示，可接受性評分與人類判斷最為相關，證明其在評估自由文本說明方面的有效性。我們的研究結果顯示：1) 少量的註解範例可以有效地使模型適應 OOD 說明產生；2) 與樣本選取策略相比，微調資料來源對 OOD 效能有更大的影響；3) 標籤預測準確度較高的模型往往會產生更好的說明，這反映在較高的可接受性評分中。", "author": "Jing Yang et.al.", "authors": "Jing Yang, Max Glockner, Anderson Rocha, Iryna Gurevych", "id": "2502.04797v1", "paper_url": "http://arxiv.org/abs/2502.04797v1", "repo": "null"}}