{"2501.00320": {"publish_time": "2024-12-31", "title": "Autonomous Alignment with Human Value on Altruism through Considerate Self-imagination and Theory of Mind", "paper_summary": "With the widespread application of Artificial Intelligence (AI) in human\nsociety, enabling AI to autonomously align with human values has become a\npressing issue to ensure its sustainable development and benefit to humanity.\nOne of the most important aspects of aligning with human values is the\nnecessity for agents to autonomously make altruistic, safe, and ethical\ndecisions, considering and caring for human well-being. Current AI extremely\npursues absolute superiority in certain tasks, remaining indifferent to the\nsurrounding environment and other agents, which has led to numerous safety\nrisks. Altruistic behavior in human society originates from humans' capacity\nfor empathizing others, known as Theory of Mind (ToM), combined with predictive\nimaginative interactions before taking action to produce thoughtful and\naltruistic behaviors. Inspired by this, we are committed to endow agents with\nconsiderate self-imagination and ToM capabilities, driving them through\nimplicit intrinsic motivations to autonomously align with human altruistic\nvalues. By integrating ToM within the imaginative space, agents keep an eye on\nthe well-being of other agents in real time, proactively anticipate potential\nrisks to themselves and others, and make thoughtful altruistic decisions that\nbalance negative effects on the environment. The ancient Chinese story of Sima\nGuang Smashes the Vat illustrates the moral behavior of the young Sima Guang\nsmashed a vat to save a child who had accidentally fallen into it, which is an\nexcellent reference scenario for this paper. We design an experimental scenario\nsimilar to Sima Guang Smashes the Vat and its variants with different\ncomplexities, which reflects the trade-offs and comprehensive considerations\nbetween self-goals, altruistic rescue, and avoiding negative side effects.", "paper_summary_zh": "隨著人工智慧（AI）在人類社會中廣泛應用，使 AI 自主符合人類價值觀已成為確保其永續發展和造福人類的當務之急。與人類價值觀保持一致最重要的面向之一，就是代理人必須自主做出利他、安全且合乎道德的決策，考量並關懷人類福祉。目前的 AI 在某些任務中極力追求絕對優越性，對周遭環境和其它代理人漠不關心，這已導致許多安全風險。人類社會中的利他行為源自人類同理他人的能力，稱為心智理論（ToM），結合在採取行動前進行預測性想像互動，以產生周全且利他的行為。受此啟發，我們致力於賦予代理人周全的自我想像和 ToM 能力，驅使他們透過隱含的內在動機，自主符合人類利他價值觀。透過將 ToM 整合到想像空間中，代理人可以即時關注其他代理人的福祉，主動預測對自己和他人潛在的風險，並做出周全的利他決策，平衡對環境的負面影響。司馬光砸缸的古代中國故事，說明了少年司馬光為了救一個不小心掉進水缸的孩子而砸缸的道德行為，是本文一個很好的參考情境。我們設計了一個實驗情境，類似司馬光砸缸及其變體，具有不同的複雜性，反映出自我目標、利他救援和避免負面副作用之間的權衡和綜合考量。", "author": "Haibo Tong et.al.", "authors": "Haibo Tong, Enmeng Lum, Yinqian Sun, Zhengqiang Han, Chao Liu, Feifei Zhao, Yi Zeng", "id": "2501.00320v1", "paper_url": "http://arxiv.org/abs/2501.00320v1", "repo": "null"}}