{"2409.05994": {"publish_time": "2024-09-09", "title": "MessIRve: A Large-Scale Spanish Information Retrieval Dataset", "paper_summary": "Information retrieval (IR) is the task of finding relevant documents in\nresponse to a user query. Although Spanish is the second most spoken native\nlanguage, current IR benchmarks lack Spanish data, hindering the development of\ninformation access tools for Spanish speakers. We introduce MessIRve, a\nlarge-scale Spanish IR dataset with around 730 thousand queries from Google's\nautocomplete API and relevant documents sourced from Wikipedia. MessIRve's\nqueries reflect diverse Spanish-speaking regions, unlike other datasets that\nare translated from English or do not consider dialectal variations. The large\nsize of the dataset allows it to cover a wide variety of topics, unlike smaller\ndatasets. We provide a comprehensive description of the dataset, comparisons\nwith existing datasets, and baseline evaluations of prominent IR models. Our\ncontributions aim to advance Spanish IR research and improve information access\nfor Spanish speakers.", "paper_summary_zh": "資訊檢索 (IR) 是根據使用者查詢尋找相關文件的工作。儘管西班牙語是第二大母語，但目前的 IR 基準缺乏西班牙語資料，這阻礙了為西班牙語使用者開發資訊存取工具。我們引入了 MessIRve，一個大規模的西班牙語 IR 資料集，其中包含來自 Google 自動完成 API 的約 73 萬個查詢和來自維基百科的相关文件。與從英語翻譯或不考慮方言變異的其他資料集不同，MessIRve 的查詢反映了不同的西班牙語系地區。與較小的資料集不同，該資料集的大規模使它能夠涵蓋各種主題。我們提供了資料集的全面描述、與現有資料集的比較，以及對著名 IR 模型的基線評估。我們的貢獻旨在推進西班牙語 IR 研究，並改善西班牙語使用者的資訊存取。", "author": "Francisco Valentini et.al.", "authors": "Francisco Valentini, Viviana Cotik, Damián Furman, Ivan Bercovich, Edgar Altszyler, Juan Manuel Pérez", "id": "2409.05994v1", "paper_url": "http://arxiv.org/abs/2409.05994v1", "repo": "null"}}