{"2501.01509": {"publish_time": "2025-01-02", "title": "AI-Enabled Operations at Fermi Complex: Multivariate Time Series Prediction for Outage Prediction and Diagnosis", "paper_summary": "The Main Control Room of the Fermilab accelerator complex continuously\ngathers extensive time-series data from thousands of sensors monitoring the\nbeam. However, unplanned events such as trips or voltage fluctuations often\nresult in beam outages, causing operational downtime. This downtime not only\nconsumes operator effort in diagnosing and addressing the issue but also leads\nto unnecessary energy consumption by idle machines awaiting beam restoration.\nThe current threshold-based alarm system is reactive and faces challenges\nincluding frequent false alarms and inconsistent outage-cause labeling. To\naddress these limitations, we propose an AI-enabled framework that leverages\npredictive analytics and automated labeling. Using data from $2,703$ Linac\ndevices and $80$ operator-labeled outages, we evaluate state-of-the-art deep\nlearning architectures, including recurrent, attention-based, and linear\nmodels, for beam outage prediction. Additionally, we assess a Random\nForest-based labeling system for providing consistent, confidence-scored outage\nannotations. Our findings highlight the strengths and weaknesses of these\narchitectures for beam outage prediction and identify critical gaps that must\nbe addressed to fully harness AI for transitioning downtime handling from\nreactive to predictive, ultimately reducing downtime and improving\ndecision-making in accelerator management.", "paper_summary_zh": "費米實驗室加速器大樓的主控室持續\n從監控光束的數千個感測器中收集大量的時序資料。然而，\n例如跳電或電壓波動等意外事件通常\n會導致光束中斷，造成運作停機。這段停機時間不僅\n消耗操作員診斷和解決問題的精力，同時也會導致\n閒置機器在等待光束復原時不必要的能源消耗。\n目前的基於閾值的警報系統是被動的，且面臨挑戰\n包括頻繁的誤報和不一致的中斷原因標籤。為了\n解決這些限制，我們提出一個利用\n預測分析和自動標籤的人工智慧框架。使用來自 $2,703$ 個直線加速器\n裝置和 $80$ 個操作員標籤中斷的資料，我們評估最先進的深度\n學習架構，包括遞迴、基於注意力的，以及線性\n光束中斷預測模型。此外，我們評估一個基於隨機\n森林的標籤系統，以提供一致、有信心評分的停電\n註解。我們的發現強調了這些\n架構在光束中斷預測上的優缺點，並找出必須\n解決的關鍵差距，以充分利用人工智慧，將停機處理從\n被動轉變為預測，最終減少停機時間並改善\n加速器管理中的決策制定。", "author": "Milan Jain et.al.", "authors": "Milan Jain, Burcu O. Mutlu, Caleb Stam, Jan Strube, Brian A. Schupbach, Jason M. St. John, William A. Pellico", "id": "2501.01509v1", "paper_url": "http://arxiv.org/abs/2501.01509v1", "repo": "null"}}