{"2408.01959": {"publish_time": "2024-08-04", "title": "Dataset Scale and Societal Consistency Mediate Facial Impression Bias in Vision-Language AI", "paper_summary": "Multimodal AI models capable of associating images and text hold promise for\nnumerous domains, ranging from automated image captioning to accessibility\napplications for blind and low-vision users. However, uncertainty about bias\nhas in some cases limited their adoption and availability. In the present work,\nwe study 43 CLIP vision-language models to determine whether they learn\nhuman-like facial impression biases, and we find evidence that such biases are\nreflected across three distinct CLIP model families. We show for the first time\nthat the the degree to which a bias is shared across a society predicts the\ndegree to which it is reflected in a CLIP model. Human-like impressions of\nvisually unobservable attributes, like trustworthiness and sexuality, emerge\nonly in models trained on the largest dataset, indicating that a better fit to\nuncurated cultural data results in the reproduction of increasingly subtle\nsocial biases. Moreover, we use a hierarchical clustering approach to show that\ndataset size predicts the extent to which the underlying structure of facial\nimpression bias resembles that of facial impression bias in humans. Finally, we\nshow that Stable Diffusion models employing CLIP as a text encoder learn facial\nimpression biases, and that these biases intersect with racial biases in Stable\nDiffusion XL-Turbo. While pretrained CLIP models may prove useful for\nscientific studies of bias, they will also require significant dataset curation\nwhen intended for use as general-purpose models in a zero-shot setting.", "paper_summary_zh": "多模態 AI 模型能夠將圖像和文字聯想起來，對許多領域來說都很有前景，從自動化圖片標題到為失明和視力低下的使用者提供的輔助應用程式。然而，在某些情況下，對於偏差的不確定性限制了它們的採用和可用性。在目前的工作中，我們研究了 43 個 CLIP 視覺語言模型，以確定它們是否會學習類似人類的臉部印象偏差，並且我們發現證據表明此類偏差反映在三個不同的 CLIP 模型系列中。我們首次展示了一個社會中偏差被共享的程度預測了它在 CLIP 模型中被反映的程度。對視覺上不可觀察屬性的類人印象，例如可信度和性，僅出現在在最大的資料集上訓練的模型中，這表明與未整理的文化資料更好的擬合導致越來越微妙的社會偏差的再現。此外，我們使用階層式聚類方法來表明資料集大小預測了臉部印象偏差的底層結構與人類臉部印象偏差的底層結構相似的程度。最後，我們展示了採用 CLIP 作為文字編碼器的 Stable Diffusion 模型學習了臉部印象偏差，並且這些偏差與 Stable Diffusion XL-Turbo 中的種族偏差相交。雖然預訓練的 CLIP 模型可能被證明對偏差的科學研究很有用，但當它們打算在零次學習設定中用作通用模型時，它們也需要大量的資料集整理。", "author": "Robert Wolfe et.al.", "authors": "Robert Wolfe, Aayushi Dangol, Alexis Hiniker, Bill Howe", "id": "2408.01959v1", "paper_url": "http://arxiv.org/abs/2408.01959v1", "repo": "null"}}