{"2410.23753": {"publish_time": "2024-10-31", "title": "Enhancing Chess Reinforcement Learning with Graph Representation", "paper_summary": "Mastering games is a hard task, as games can be extremely complex, and still\nfundamentally different in structure from one another. While the AlphaZero\nalgorithm has demonstrated an impressive ability to learn the rules and\nstrategy of a large variety of games, ranging from Go and Chess, to Atari\ngames, its reliance on extensive computational resources and rigid\nConvolutional Neural Network (CNN) architecture limits its adaptability and\nscalability. A model trained to play on a $19\\times 19$ Go board cannot be used\nto play on a smaller $13\\times 13$ board, despite the similarity between the\ntwo Go variants. In this paper, we focus on Chess, and explore using a more\ngeneric Graph-based Representation of a game state, rather than a grid-based\none, to introduce a more general architecture based on Graph Neural Networks\n(GNN). We also expand the classical Graph Attention Network (GAT) layer to\nincorporate edge-features, to naturally provide a generic policy output format.\nOur experiments, performed on smaller networks than the initial AlphaZero\npaper, show that this new architecture outperforms previous architectures with\na similar number of parameters, being able to increase playing strength an\norder of magnitude faster. We also show that the model, when trained on a\nsmaller $5\\times 5$ variant of chess, is able to be quickly fine-tuned to play\non regular $8\\times 8$ chess, suggesting that this approach yields promising\ngeneralization abilities. Our code is available at\nhttps://github.com/akulen/AlphaGateau.", "paper_summary_zh": "<paragraph>掌握遊戲是一項艱難的任務，因為遊戲可能極其複雜，而且彼此在結構上仍然有根本性的不同。儘管 AlphaZero 演算法已展現出令人印象深刻的能力，可以學習各種遊戲的規則和策略，從圍棋和西洋棋到雅達利遊戲，但它依賴於廣泛的計算資源和嚴格的卷積神經網路 (CNN) 架構，這限制了它的適應性和可擴充性。訓練在 $19\\times 19$ 圍棋盤上進行遊戲的模型無法用於在較小的 $13\\times 13$ 棋盤上進行遊戲，儘管這兩種圍棋變體之間有相似之處。在本文中，我們專注於西洋棋，並探討使用更通用的基於圖形的遊戲狀態表示，而不是基於格子的表示，以引入基於圖形神經網路 (GNN) 的更通用架構。我們還擴充了傳統的圖形注意力網路 (GAT) 層以納入邊緣特徵，以自然地提供通用的策略輸出格式。我們在比最初的 AlphaZero 論文中更小的網路中進行的實驗表明，這種新架構優於具有類似參數數量的先前架構，能夠以更快的速度提高遊戲強度。我們還表明，當模型在較小的 $5\\times 5$ 西洋棋變體上進行訓練時，可以快速微調以在常規 $8\\times 8$ 西洋棋上進行遊戲，這表明這種方法產生了有希望的泛化能力。我們的程式碼可在 https://github.com/akulen/AlphaGateau 取得。</paragraph>", "author": "Tomas Rigaux et.al.", "authors": "Tomas Rigaux, Hisashi Kashima", "id": "2410.23753v1", "paper_url": "http://arxiv.org/abs/2410.23753v1", "repo": "https://github.com/akulen/alphagateau"}}