{"2405.17062": {"publish_time": "2024-05-27", "title": "Unifying Demonstration Selection and Compression for In-Context Learning", "paper_summary": "In-context learning (ICL) facilitates large language models (LLMs) exhibiting\nspectacular emergent capabilities in various scenarios. Unfortunately,\nintroducing demonstrations easily makes the prompt length explode, bringing a\nsignificant burden to hardware. In addition, random demonstrations usually\nachieve limited improvements in ICL, necessitating demonstration selection\namong accessible candidates. Previous studies introduce extra modules to\nperform demonstration compression or selection independently. In this paper, we\npropose an ICL framework UniICL, which Unifies demonstration selection and\ncompression, and final response generation via a single frozen LLM.\nSpecifically, UniICL first projects actual demonstrations and inference text\ninputs into short virtual tokens, respectively. Then, virtual tokens are\napplied to select suitable demonstrations by measuring semantic similarity\nwithin latent space among candidate demonstrations and inference input.\nFinally, inference text inputs together with selected virtual demonstrations\nare fed into the same frozen LLM for response generation. Notably, UniICL is a\nparameter-efficient framework that only contains 17M trainable parameters\noriginating from the projection layer. We conduct experiments and analysis over\nin- and out-domain datasets of both generative and understanding tasks,\nencompassing ICL scenarios with plentiful and limited demonstration candidates.\nResults show that UniICL effectively unifies $12 \\times$ compression,\ndemonstration selection, and response generation, efficiently scaling up the\nbaseline from 4-shot to 64-shot ICL in IMDb with 24 GB CUDA allocation", "paper_summary_zh": "語境學習 (ICL) 促進大型語言模型 (LLM) 在各種場景中展現出驚人的新興能力。不幸的是，引入示範很容易使提示長度暴增，給硬體帶來顯著負擔。此外，隨機示範通常只能在 ICL 中實現有限的改進，因此需要在可訪問的候選者中選擇示範。先前的研究引入了額外的模組來獨立執行示範壓縮或選擇。在本文中，我們提出了一個 ICL 框架 UniICL，它通過單一的凍結 LLM 統一了示範選擇和壓縮，以及最終回應產生。具體來說，UniICL 首先分別將實際示範和推論文字輸入投影到簡短的虛擬代幣中。然後，通過測量候選示範和推論輸入之間潛在空間中的語義相似性，將虛擬代幣應用於選擇合適的示範。最後，推論文字輸入與選定的虛擬示範一起被輸入到同一個凍結的 LLM 中以產生回應。值得注意的是，UniICL 是一個參數高效的框架，僅包含源自投影層的 17M 可訓練參數。我們對生成和理解任務的域內和域外資料集進行了實驗和分析，涵蓋了具有豐富和有限示範候選者的 ICL 場景。結果表明，UniICL 有效地統一了 $12 \\times$ 壓縮、示範選擇和回應產生，有效地將 IMDb 中的基準從 4-shot 擴展到 64-shot ICL，CUDA 分配為 24 GB", "author": "Jun Gao et.al.", "authors": "Jun Gao", "id": "2405.17062v1", "paper_url": "http://arxiv.org/abs/2405.17062v1", "repo": "null"}}