{"2411.12919": {"publish_time": "2024-11-19", "title": "Enhancing Deep Learning-Driven Multi-Coil MRI Reconstruction via Self-Supervised Denoising", "paper_summary": "We examine the effect of incorporating self-supervised denoising as a\npre-processing step for training deep learning (DL) based reconstruction\nmethods on data corrupted by Gaussian noise. K-space data employed for training\nare typically multi-coil and inherently noisy. Although DL-based reconstruction\nmethods trained on fully sampled data can enable high reconstruction quality,\nobtaining large, noise-free datasets is impractical. We leverage Generalized\nStein's Unbiased Risk Estimate (GSURE) for denoising. We evaluate two DL-based\nreconstruction methods: Diffusion Probabilistic Models (DPMs) and Model-Based\nDeep Learning (MoDL). We evaluate the impact of denoising on the performance of\nthese DL-based methods in solving accelerated multi-coil magnetic resonance\nimaging (MRI) reconstruction. The experiments were carried out on T2-weighted\nbrain and fat-suppressed proton-density knee scans. We observed that\nself-supervised denoising enhances the quality and efficiency of MRI\nreconstructions across various scenarios. Specifically, employing denoised\nimages rather than noisy counterparts when training DL networks results in\nlower normalized root mean squared error (NRMSE), higher structural similarity\nindex measure (SSIM) and peak signal-to-noise ratio (PSNR) across different SNR\nlevels, including 32dB, 22dB, and 12dB for T2-weighted brain data, and 24dB,\n14dB, and 4dB for fat-suppressed knee data. Overall, we showed that denoising\nis an essential pre-processing technique capable of improving the efficacy of\nDL-based MRI reconstruction methods under diverse conditions. By refining the\nquality of input data, denoising can enable the training of more effective DL\nnetworks, potentially bypassing the need for noise-free reference MRI scans.", "paper_summary_zh": "<paragraph>我們探討了將自監督去噪作為預處理步驟，用於訓練基於深度學習 (DL) 的重建方法，以針對受高斯雜訊損壞的資料進行重建。用於訓練的 k 空間資料通常是多線圈且本質上具有雜訊。儘管在完整採樣資料上訓練的基於 DL 的重建方法可以實現高重建品質，但取得大型無雜訊的資料集是不切實際的。我們利用廣義 Stein 無偏風險估計 (GSURE) 進行去噪。我們評估了兩種基於 DL 的重建方法：擴散機率模型 (DPM) 和基於模型的深度學習 (MoDL)。我們評估去噪對這些基於 DL 的方法在解決加速多線圈磁振造影 (MRI) 重建中的效能影響。這些實驗是在 T2 加權腦部和脂肪抑制質子密度膝部掃描上進行的。我們觀察到自監督去噪增強了 MRI 重建在各種場景中的品質和效率。具體來說，在訓練 DL 網路時採用去噪影像，而非雜訊對應影像，會導致較低的標準化均方根誤差 (NRMSE)、較高的結構相似性指標 (SSIM) 和峰值信號雜訊比 (PSNR)，涵蓋不同的 SNR 等級，包括 T2 加權腦部資料的 32dB、22dB 和 12dB，以及脂肪抑制膝部資料的 24dB、14dB 和 4dB。總體而言，我們展示了去噪是一種必要的預處理技術，能夠在各種條件下改善基於 DL 的 MRI 重建方法的效能。透過改善輸入資料的品質，去噪可以訓練出更有效的 DL 網路，潛在地繞過對無雜訊參考 MRI 掃描的需求。</paragraph>", "author": "Asad Aali et.al.", "authors": "Asad Aali, Marius Arvinte, Sidharth Kumar, Yamin I. Arefeen, Jonathan I. Tamir", "id": "2411.12919v1", "paper_url": "http://arxiv.org/abs/2411.12919v1", "repo": "https://github.com/utcsilab/gsure-diffusion-mri"}}