{"2408.01402": {"publish_time": "2024-08-02", "title": "Pre-trained Language Models Improve the Few-shot Prompt Ability of Decision Transformer", "paper_summary": "Decision Transformer (DT) has emerged as a promising class of algorithms in\noffline reinforcement learning (RL) tasks, leveraging pre-collected datasets\nand Transformer's capability to model long sequences. Recent works have\ndemonstrated that using parts of trajectories from training tasks as prompts in\nDT enhances its performance on unseen tasks, giving rise to Prompt-DT methods.\nHowever, collecting data from specific environments can be both costly and\nunsafe in many scenarios, leading to suboptimal performance and limited\nfew-shot prompt abilities due to the data-hungry nature of Transformer-based\nmodels. Additionally, the limited datasets used in pre-training make it\nchallenging for Prompt-DT type of methods to distinguish between various RL\ntasks through prompts alone. To address these challenges, we introduce the\nLanguage model-initialized Prompt Decision Transformer (LPDT), which leverages\npre-trained language models for meta-RL tasks and fine-tunes the model using\nLow-rank Adaptation (LoRA). We further incorporate prompt regularization to\neffectively differentiate between tasks based on prompt feature\nrepresentations. Our approach integrates pre-trained language model and RL\ntasks seamlessly. Extensive empirical studies demonstrate that initializing\nwith a pre-trained language model significantly enhances the performance of\nPrompt-DT on unseen tasks compared to baseline methods.", "paper_summary_zh": "決策Transformer (DT) 已成為離線強化學習 (RL) 任務中一種有前途的演算法類別，它利用預先收集的資料集和Transformer對長序列建模的能力。最近的研究表明，將訓練任務中部分軌跡用作 DT 中的提示，可以提升其在未見任務中的表現，由此產生了提示 DT 方法。然而，在許多場景中，從特定環境收集資料既昂貴又不安全，這導致了次優的表現和有限的少次提示能力，因為基於Transformer的模型具有資料密集的特性。此外，預訓練中使用的有限資料集使得提示 DT 類型的模型僅透過提示就難以區分各種 RL 任務。為了應對這些挑戰，我們引入了基於語言模型的提示決策Transformer (LPDT)，它利用預先訓練的語言模型進行元 RL 任務，並使用低秩適應 (LoRA) 微調模型。我們進一步整合提示正規化，以根據提示特徵表示有效區分任務。我們的做法無縫整合了預先訓練的語言模型和 RL 任務。廣泛的實證研究表明，與基線方法相比，使用預先訓練的語言模型進行初始化顯著提升了提示 DT 在未見任務中的表現。", "author": "Yu Yang et.al.", "authors": "Yu Yang, Pan Xu", "id": "2408.01402v1", "paper_url": "http://arxiv.org/abs/2408.01402v1", "repo": "null"}}