{"2411.07381": {"publish_time": "2024-11-11", "title": "BeeManc at the PLABA Track of TAC-2024: RoBERTa for task 1 and LLaMA3.1 and GPT-4o for task 2", "paper_summary": "This report is the system description of the BeeManc team for shared task\nPlain Language Adaptation of Biomedical Abstracts (PLABA) 2024. This report\ncontains two sections corresponding to the two sub-tasks in PLABA 2024. In task\none, we applied fine-tuned ReBERTa-Base models to identify and classify the\ndifficult terms, jargon and acronyms in the biomedical abstracts and reported\nthe F1 score. Due to time constraints, we didn't finish the replacement task.\nIn task two, we leveraged Llamma3.1-70B-Instruct and GPT-4o with the one-shot\nprompts to complete the abstract adaptation and reported the scores in BLEU,\nSARI, BERTScore, LENS, and SALSA. From the official Evaluation from PLABA-2024\non Task 1A and 1B, our \\textbf{much smaller fine-tuned RoBERTa-Base} model\nranked 3rd and 2nd respectively on the two sub-task, and the \\textbf{1st on\naveraged F1 scores across the two tasks} from 9 evaluated systems. Our share\nour fine-tuned models and related resources at\n\\url{https://github.com/HECTA-UoM/PLABA2024}", "paper_summary_zh": "這份報告是 BeeManc 團隊針對 2024 年生物醫學摘要的通用語言適應 (PLABA) 共享任務所做的系統描述。這份報告包含兩部分，分別對應於 PLABA 2024 的兩個子任務。在任務一中，我們應用微調後的 ReBERTa-Base 模型來識別和分類生物醫學摘要中的困難術語、術語和縮寫，並報告 F1 分數。由於時間限制，我們沒有完成替換任務。在任務二中，我們利用 Llamma3.1-70B-Instruct 和 GPT-4o 以及一次性提示來完成摘要適應，並報告了 BLEU、SARI、BERTScore、LENS 和 SALSA 中的分數。根據 PLABA-2024 在任務 1A 和 1B 中的官方評估，我們的\\textbf{微調後的 RoBERTa-Base 模型小得多}在兩個子任務中分別排名第 3 和第 2，並且在 9 個評估系統中\\textbf{在兩個任務中的平均 F1 分數中排名第 1}。我們在\\url{https://github.com/HECTA-UoM/PLABA2024}分享我們的微調模型和相關資源", "author": "Zhidong Ling et.al.", "authors": "Zhidong Ling, Zihao Li, Pablo Romeo, Lifeng Han, Goran Nenadic", "id": "2411.07381v1", "paper_url": "http://arxiv.org/abs/2411.07381v1", "repo": "null"}}