{"2411.02820": {"publish_time": "2024-11-05", "title": "DroidSpeak: Enhancing Cross-LLM Communication", "paper_summary": "In multi-agent systems utilizing Large Language Models (LLMs), communication\nbetween agents traditionally relies on natural language. This communication\noften includes the full context of the query so far, which can introduce\nsignificant prefill-phase latency, especially with long contexts.\n  We introduce DroidSpeak, a novel framework to target this cross-LLM\ncommunication by leveraging the reuse of intermediate data, such as input\nembeddings (E-cache) and key-value caches (KV-cache). We efficiently bypass the\nneed to reprocess entire contexts for fine-tuned versions of the same\nfoundational model. This approach allows faster context integration while\nmaintaining the quality of task performance. Experimental evaluations\ndemonstrate DroidSpeak's ability to significantly accelerate inter-agent\ncommunication, achieving up to a 2.78x speedup in prefill latency with\nnegligible loss in accuracy. Our findings underscore the potential to create\nmore efficient and scalable multi-agent systems.", "paper_summary_zh": "在利用大型語言模型 (LLM) 的多代理系統中，代理之間的溝通傳統上依賴於自然語言。這種溝通通常包括到目前為止查詢的完整內容，這可能會造成大量的預填充階段延遲，特別是在內容很長的情況下。\n我們介紹了 DroidSpeak，這是一個新穎的框架，旨在透過利用中間資料的重複使用（例如輸入嵌入 (E 快取) 和鍵值快取 (KV 快取)）來針對這種跨 LLM 溝通。我們有效地繞過了重新處理整個內容以用於相同基礎模型的微調版本的需求。這種方法允許更快速的內容整合，同時保持任務執行品質。實驗評估證明了 DroidSpeak 的能力，它可以顯著加速代理間溝通，在預填充延遲方面實現了高達 2.78 倍的加速，而準確度損失可以忽略不計。我們的發現強調了建立更有效率且可擴充的多代理系統的潛力。", "author": "Yuhan Liu et.al.", "authors": "Yuhan Liu, Esha Choukse, Shan Lu, Junchen Jiang, Madan Musuvathi", "id": "2411.02820v1", "paper_url": "http://arxiv.org/abs/2411.02820v1", "repo": "null"}}