{"2412.14847": {"publish_time": "2024-12-19", "title": "A Survey of RWKV", "paper_summary": "The Receptance Weighted Key Value (RWKV) model offers a novel alternative to\nthe Transformer architecture, merging the benefits of recurrent and\nattention-based systems. Unlike conventional Transformers, which depend heavily\non self-attention, RWKV adeptly captures long-range dependencies with minimal\ncomputational demands. By utilizing a recurrent framework, RWKV addresses some\ncomputational inefficiencies found in Transformers, particularly in tasks with\nlong sequences. RWKV has recently drawn considerable attention for its robust\nperformance across multiple domains. Despite its growing popularity, no\nsystematic review of the RWKV model exists. This paper seeks to fill this gap\nas the first comprehensive review of the RWKV architecture, its core\nprinciples, and its varied applications, such as natural language generation,\nnatural language understanding, and computer vision. We assess how RWKV\ncompares to traditional Transformer models, highlighting its capability to\nmanage long sequences efficiently and lower computational costs. Furthermore,\nwe explore the challenges RWKV encounters and propose potential directions for\nfuture research and advancement. We consistently maintain the related\nopen-source materials at: https://github.com/MLGroupJLU/RWKV-Survey.", "paper_summary_zh": "可接收加權關鍵值 (RWKV) 模型提供了一個新穎的替代方案來轉換架構，合併了遞迴和基於注意力的系統的優點。與高度依賴自我注意力的傳統轉換器不同，RWKV 能夠以最小的運算需求靈活地捕捉長距離依賴性。通過利用遞迴架構，RWKV 解決了在轉換器中發現的一些運算低效率，特別是在具有長序列的任務中。RWKV 最近因其在多個領域的強大效能而備受關注。儘管其受歡迎程度日益提高，但 RWKV 模型並未進行系統性回顧。本文旨在填補這一空白，作為 RWKV 架構、其核心原理及其各種應用（例如自然語言生成、自然語言理解和電腦視覺）的第一個全面回顧。我們評估 RWKV 如何與傳統轉換器模型進行比較，強調其有效管理長序列和降低運算成本的能力。此外，我們探討了 RWKV 遇見的挑戰，並提出了未來研究和進展的潛在方向。我們持續在以下位置維護相關的開源材料：https://github.com/MLGroupJLU/RWKV-Survey。", "author": "Zhiyuan Li et.al.", "authors": "Zhiyuan Li, Tingyu Xia, Yi Chang, Yuan Wu", "id": "2412.14847v1", "paper_url": "http://arxiv.org/abs/2412.14847v1", "repo": "null"}}