{"2405.19778": {"publish_time": "2024-05-30", "title": "Enhancing Consistency and Role-Specific Knowledge Capturing by Rebuilding Fictional Character's Persona", "paper_summary": "With the recent introduction of Assistants API, it is expected that\ndocument-based language models will be actively used in various domains,\nespecially Role-playing. However, a key challenge lies in utilizing\nprotagonist's persona: Assistants API often fails to achieve with its search\nbecause the information extraction part is different each time and it often\nomits important information such as protagonist's backstory or relationships.\nIt is hard to maintain a consistent persona simply by using the persona\ndocument as input to the Assistants API. To address the challenge of achieving\nstable persona consistency, we propose CharacterGPT, a novel persona\nreconstruction framework to alleviate the shortcomings of the Assistants API.\nOur method involves Character Persona Training (CPT), an effective persona\nrebuilding process that updates the character persona by extracting the\ncharacter's traits from given summary of the novel for each character as if the\nstory in a novel progresses. In our experiments, we ask each character to take\nthe Big Five Inventory personality test in various settings and analyze the\nresults. To assess whether it can think outside the box, we let each character\ngenerate short novels. Extensive experiments and human evaluation demonstrate\nthat CharacterGPT presents new possibilities for role-playing agent research.", "paper_summary_zh": "隨著助理 API 的近期推出，預計基於文件的語言模型將廣泛應用於各種領域，特別是角色扮演。然而，一個關鍵挑戰在於利用主角的人設：助理 API 經常無法透過搜尋達成，因為資訊擷取部分每次都不同，而且經常遺漏重要的資訊，例如主角的背景故事或人際關係。僅使用人設文件作為助理 API 的輸入，很難維持一致的人設。為了解決達成穩定人設一致性的挑戰，我們提出 CharacterGPT，一種新的人設重建架構，以緩解助理 API 的缺點。我們的做法包括角色人設訓練 (CPT)，這是一個有效的人設重建程序，透過為每個角色從給定的章節摘要中擷取角色特質，更新角色人設，就像小說中的故事進展一樣。在我們的實驗中，我們要求每個角色在各種設定中進行大五人格量表人格測驗，並分析結果。為了評估它是否能跳脫框架思考，我們讓每個角色產生短篇小說。廣泛的實驗和人工評估證明，CharacterGPT 為角色扮演代理研究提供了新的可能性。", "author": "Jeiyoon Park et.al.", "authors": "Jeiyoon Park, Chanjun Park, Heuiseok Lim", "id": "2405.19778v1", "paper_url": "http://arxiv.org/abs/2405.19778v1", "repo": "https://github.com/jeiyoon/charactergpt"}}