{"2501.07959": {"publish_time": "2025-01-14", "title": "Self-Instruct Few-Shot Jailbreaking: Decompose the Attack into Pattern and Behavior Learning", "paper_summary": "Recently, several works have been conducted on jailbreaking Large Language\nModels (LLMs) with few-shot malicious demos. In particular, Zheng et al. (2024)\nfocuses on improving the efficiency of Few-Shot Jailbreaking (FSJ) by injecting\nspecial tokens into the demos and employing demo-level random search.\nNevertheless, this method lacks generality since it specifies the\ninstruction-response structure. Moreover, the reason why inserting special\ntokens takes effect in inducing harmful behaviors is only empirically\ndiscussed. In this paper, we take a deeper insight into the mechanism of\nspecial token injection and propose Self-Instruct Few-Shot Jailbreaking\n(Self-Instruct-FSJ) facilitated with the demo-level greedy search. This\nframework decomposes the FSJ attack into pattern and behavior learning to\nexploit the model's vulnerabilities in a more generalized and efficient way. We\nconduct elaborate experiments to evaluate our method on common open-source\nmodels and compare it with baseline algorithms. Our code is available at\nhttps://github.com/iphosi/Self-Instruct-FSJ.", "paper_summary_zh": "<paragraph>最近，已经对使用少次恶意演示越狱大型语言模型 (LLM) 进行了多项研究。特别是，Zheng 等人 (2024) 专注于通过向演示中注入特殊标记并采用演示级随机搜索来提高少次越狱 (FSJ) 的效率。然而，这种方法缺乏通用性，因为它指定了指令响应结构。此外，为什么插入特殊标记会对诱发有害行为产生效果的原因仅凭经验进行了讨论。在本文中，我们深入了解了特殊标记注入的机制，并提出了在演示级贪婪搜索的帮助下进行自指令少次越狱 (Self-Instruct-FSJ)。此框架将 FSJ 攻击分解为模式和行为学习，以更通用、更有效的方式利用模型的漏洞。我们进行了精心设计的实验，以评估我们在常见开源模型上的方法，并将其与基线算法进行比较。我们的代码可在 https://github.com/iphosi/Self-Instruct-FSJ 获得。</paragraph>", "author": "Jiaqi Hua et.al.", "authors": "Jiaqi Hua, Wanxu Wei", "id": "2501.07959v1", "paper_url": "http://arxiv.org/abs/2501.07959v1", "repo": "https://github.com/iphosi/self-instruct-fsj"}}