{"2406.05746": {"publish_time": "2024-06-09", "title": "Methodology and Real-World Applications of Dynamic Uncertain Causality Graph for Clinical Diagnosis with Explainability and Invariance", "paper_summary": "AI-aided clinical diagnosis is desired in medical care. Existing deep\nlearning models lack explainability and mainly focus on image analysis. The\nrecently developed Dynamic Uncertain Causality Graph (DUCG) approach is\ncausality-driven, explainable, and invariant across different application\nscenarios, without problems of data collection, labeling, fitting, privacy,\nbias, generalization, high cost and high energy consumption. Through close\ncollaboration between clinical experts and DUCG technicians, 46 DUCG models\ncovering 54 chief complaints were constructed. Over 1,000 diseases can be\ndiagnosed without triage. Before being applied in real-world, the 46 DUCG\nmodels were retrospectively verified by third-party hospitals. The verified\ndiagnostic precisions were no less than 95%, in which the diagnostic precision\nfor every disease including uncommon ones was no less than 80%. After\nverifications, the 46 DUCG models were applied in the real-world in China. Over\none million real diagnosis cases have been performed, with only 17 incorrect\ndiagnoses identified. Due to DUCG's transparency, the mistakes causing the\nincorrect diagnoses were found and corrected. The diagnostic abilities of the\nclinicians who applied DUCG frequently were improved significantly. Following\nthe introduction to the earlier presented DUCG methodology, the recommendation\nalgorithm for potential medical checks is presented and the key idea of DUCG is\nextracted.", "paper_summary_zh": "<paragraph>醫療照護中需要 AI 輔助的臨床診斷。現有的深度學習模型缺乏可解釋性，並且主要專注於影像分析。最近開發的動態不確定因果關係圖 (DUCG) 方法是因果驅動的、可解釋的，並且在不同的應用場景中是不變的，沒有資料收集、標記、擬合、隱私、偏見、概化、高成本和高能耗的問題。通過臨床專家和 DUCG 技術人員之間的密切合作，構建了涵蓋 54 個主訴的 46 個 DUCG 模型。可以在沒有分流的情況下診斷出 1,000 多種疾病。在應用於實際世界之前，46 個 DUCG 模型已由第三方醫院回溯性驗證。驗證的診斷精度不低於 95%，其中包括罕見疾病在內的每種疾病的診斷精度不低於 80%。驗證後，46 個 DUCG 模型已在中國實際應用。已經執行了超過一百萬個真實診斷案例，僅發現 17 個不正確的診斷。由於 DUCG 的透明性，發現並糾正了導致不正確診斷的錯誤。頻繁應用 DUCG 的臨床醫生的診斷能力得到了顯著提高。在介紹了前面提出的 DUCG 方法論之後，提出了潛在健康檢查的推薦演算法，並提取了 DUCG 的關鍵思想。</paragraph>", "author": "Zhan Zhang et.al.", "authors": "Zhan Zhang, Qin Zhang, Yang Jiao, Lin Lu, Lin Ma, Aihua Liu, Xiao Liu, Juan Zhao, Yajun Xue, Bing Wei, Mingxia Zhang, Ru Gao, Hong Zhao, Jie Lu, Fan Li, Yang Zhang, Yiming Wang, Lei Zhang, Fengwei Tian, Jie Hu, Xin Gou", "id": "2406.05746v1", "paper_url": "http://arxiv.org/abs/2406.05746v1", "repo": "null"}}