{"2501.01242": {"publish_time": "2025-01-02", "title": "An Efficient Attention Mechanism for Sequential Recommendation Tasks: HydraRec", "paper_summary": "Transformer based models are increasingly being used in various domains\nincluding recommender systems (RS). Pretrained transformer models such as BERT\nhave shown good performance at language modelling. With the greater ability to\nmodel sequential tasks, variants of Encoder-only models (like BERT4Rec, SASRec\netc.) have found success in sequential RS problems. Computing dot-product\nattention in traditional transformer models has quadratic complexity in\nsequence length. This is a bigger problem with RS because unlike language\nmodels, new items are added to the catalogue every day. User buying history is\na dynamic sequence which depends on multiple factors. Recently, various linear\nattention models have tried to solve this problem by making the model linear in\nsequence length (token dimensions). Hydra attention is one such linear\ncomplexity model proposed for vision transformers which reduces the complexity\nof attention for both the number of tokens as well as model embedding\ndimensions. Building on the idea of Hydra attention, we introduce an efficient\nTransformer based Sequential RS (HydraRec) which significantly improves\ntheoretical complexity of computing attention for longer sequences and bigger\ndatasets while preserving the temporal context. Extensive experiments are\nconducted to evaluate other linear transformer-based RS models and compared\nwith HydraRec across various evaluation metrics. HydraRec outperforms other\nlinear attention-based models as well as dot-product based attention models\nwhen used with causal masking for sequential recommendation next item\nprediction tasks. For bi-directional models its performance is comparable to\nthe BERT4Rec model with an improvement in running time.", "paper_summary_zh": "<paragraph>基於 Transformer 的模型愈來愈多地用於各種領域，包括推薦系統 (RS)。預訓練的 Transformer 模型，例如 BERT，已在語言建模方面展現出良好的效能。隨著對序列任務建模能力的提升，僅編碼器模型的變體（例如 BERT4Rec、SASRec 等）已在序列 RS 問題中獲得成功。在傳統 Transformer 模型中計算點積注意力時，其序列長度具有二次複雜度。這對於 RS 來說是一個更大的問題，因為與語言模型不同，每天都會有新的項目新增到目錄中。使用者的購買記錄是一個動態序列，取決於多重因素。最近，各種線性注意力模型已嘗試通過使模型在序列長度（標記維度）中線性化來解決此問題。Hydra 注意力是一種針對視覺 Transformer 提出、具有此類線性複雜度的模型，它降低了對標記數量和模型嵌入維度的注意力的複雜度。基於 Hydra 注意力的概念，我們引入了一個高效的基於 Transformer 的序列 RS（HydraRec），它顯著改善了計算較長序列和較大資料集注意力的理論複雜度，同時保留了時間脈絡。我們進行了廣泛的實驗，以評估其他基於線性 Transformer 的 RS 模型，並在各種評估指標中將其與 HydraRec 進行了比較。在用於序列推薦下一個項目預測任務的因果遮罩時，HydraRec 優於其他基於線性注意力的模型以及基於點積的注意力模型。對於雙向模型，其效能可與 BERT4Rec 模型相媲美，同時縮短了執行時間。</paragraph>", "author": "Uzma Mushtaque et.al.", "authors": "Uzma Mushtaque", "id": "2501.01242v1", "paper_url": "http://arxiv.org/abs/2501.01242v1", "repo": "null"}}