{"2410.18749": {"publish_time": "2024-10-24", "title": "Does Differential Privacy Impact Bias in Pretrained NLP Models?", "paper_summary": "Differential privacy (DP) is applied when fine-tuning pre-trained large\nlanguage models (LLMs) to limit leakage of training examples. While most DP\nresearch has focused on improving a model's privacy-utility tradeoff, some find\nthat DP can be unfair to or biased against underrepresented groups. In this\nwork, we show the impact of DP on bias in LLMs through empirical analysis.\nDifferentially private training can increase the model bias against protected\ngroups w.r.t AUC-based bias metrics. DP makes it more difficult for the model\nto differentiate between the positive and negative examples from the protected\ngroups and other groups in the rest of the population. Our results also show\nthat the impact of DP on bias is not only affected by the privacy protection\nlevel but also the underlying distribution of the dataset.", "paper_summary_zh": "差分隱私 (DP) 用於微調預訓練的大語言模型 (LLM)，以限制訓練範例的洩漏。雖然大多數 DP 研究都集中在改善模型的隱私效用權衡，但有些人發現 DP 可能對代表性不足的群體不公平或有偏見。在這項工作中，我們透過實證分析展示 DP 對 LLM 中偏見的影響。差異化隱私訓練可以增加模型對受保護群體的偏見，相對於基於 AUC 的偏見指標。DP 使模型更難區分受保護群體和其他群體在其他族群中的正面和負面範例。我們的結果也顯示，DP 對偏見的影響不僅受隱私保護層級影響，也受資料集的基礎分佈影響。", "author": "Md. Khairul Islam et.al.", "authors": "Md. Khairul Islam, Andrew Wang, Tianhao Wang, Yangfeng Ji, Judy Fox, Jieyu Zhao", "id": "2410.18749v1", "paper_url": "http://arxiv.org/abs/2410.18749v1", "repo": "https://github.com/khairulislam/dp-on-nlp-bias"}}