{"2410.02742": {"publish_time": "2024-10-03", "title": "Grounding Large Language Models In Embodied Environment With Imperfect World Models", "paper_summary": "Despite a widespread success in various applications, large language models\n(LLMs) often stumble when tackling basic physical reasoning or executing\nrobotics tasks, due to a lack of direct experience with the physical nuances of\nthe real world. To address these issues, we propose a Grounding Large language\nmodel with Imperfect world MOdel (GLIMO), which utilizes proxy world models\nsuch as simulators to collect and synthesize trining data. GLIMO incorporates\nan LLM agent-based data generator to automatically create high-quality and\ndiverse instruction datasets. The generator includes an iterative self-refining\nmodule for temporally consistent experience sampling, a diverse set of\nquestion-answering instruction seeds, and a retrieval-augmented generation\nmodule for reflecting on prior experiences. Comprehensive experiments show that\nour approach improve the performance of strong open-source LLMs like LLaMA-3\nwith a performance boost of 2.04 $\\times$, 1.54 $\\times$, and 1.82 $\\times$\nacross three different benchmarks, respectively. The performance is able to\ncompete with or surpass their larger counterparts such as GPT-4.", "paper_summary_zh": "儘管大型語言模型 (LLM) 在各種應用中獲得廣泛成功，但由於缺乏對現實世界物理細微差別的直接經驗，它們在處理基本物理推理或執行機器人任務時經常會遇到困難。為了解決這些問題，我們提出了一個具有不完美世界模型 (GLIMO) 的基礎大型語言模型，它利用代理世界模型（例如模擬器）來收集和綜合訓練資料。GLIMO 結合了一個基於 LLM 代理的資料生成器，以自動建立高品質且多樣化的指令資料集。該生成器包含一個反覆自我精煉模組，用於時間一致的經驗取樣、一套多樣化的問答指令種子，以及一個檢索增強生成模組，用於反思先前的經驗。全面的實驗表明，我們的做法改善了強大的開源 LLM（例如 LLaMA-3）的效能，分別在三個不同的基準中提升了 2.04 倍、1.54 倍和 1.82 倍。該效能能夠與 GPT-4 等規模更大的同類產品競爭或超越它們。", "author": "Haolan Liu et.al.", "authors": "Haolan Liu, Jishen Zhao", "id": "2410.02742v1", "paper_url": "http://arxiv.org/abs/2410.02742v1", "repo": "null"}}