{"2408.07989": {"publish_time": "2024-08-15", "title": "IIU: Independent Inference Units for Knowledge-based Visual Question Answering", "paper_summary": "Knowledge-based visual question answering requires external knowledge beyond\nvisible content to answer the question correctly. One limitation of existing\nmethods is that they focus more on modeling the inter-modal and intra-modal\ncorrelations, which entangles complex multimodal clues by implicit embeddings\nand lacks interpretability and generalization ability. The key challenge to\nsolve the above problem is to separate the information and process it\nseparately at the functional level. By reusing each processing unit, the\ngeneralization ability of the model to deal with different data can be\nincreased. In this paper, we propose Independent Inference Units (IIU) for\nfine-grained multi-modal reasoning to decompose intra-modal information by the\nfunctionally independent units. Specifically, IIU processes each\nsemantic-specific intra-modal clue by an independent inference unit, which also\ncollects complementary information by communication from different units. To\nfurther reduce the impact of redundant information, we propose a memory update\nmodule to maintain semantic-relevant memory along with the reasoning process\ngradually. In comparison with existing non-pretrained multi-modal reasoning\nmodels on standard datasets, our model achieves a new state-of-the-art,\nenhancing performance by 3%, and surpassing basic pretrained multi-modal\nmodels. The experimental results show that our IIU model is effective in\ndisentangling intra-modal clues as well as reasoning units to provide\nexplainable reasoning evidence. Our code is available at\nhttps://github.com/Lilidamowang/IIU.", "paper_summary_zh": "<paragraph>基於知識的視覺問題回答需要外部知識，而這些知識超出了可見內容，才能正確回答問題。現有方法的一個限制在於，它們更專注於建模跨模態和模態內相關性，這通過隱式嵌入將複雜的多模態線索糾纏在一起，並且缺乏可解釋性和泛化能力。解決上述問題的關鍵挑戰是分離資訊，並在功能層級上分別處理它。透過重複使用每個處理單元，可以提高模型處理不同資料的泛化能力。在本文中，我們提出了獨立推理單元 (IIU)，用於細粒度的多模態推理，以透過功能獨立的單元分解模態內資訊。具體來說，IIU 透過獨立推理單元處理每個語義特定的模態內線索，該單元還會從不同單元收集互補資訊。為了進一步降低冗餘資訊的影響，我們提出了一個記憶體更新模組，以隨著推理過程逐漸維護語義相關記憶體。與標準資料集上的現有非預訓練多模態推理模型相比，我們的模型達到了新的最佳狀態，將效能提升了 3%，並超越了基本的預訓練多模態模型。實驗結果表明，我們的 IIU 模型在解開模態內線索以及推理單元方面是有效的，以提供可解釋的推理證據。我們的程式碼可在 https://github.com/Lilidamowang/IIU 取得。</paragraph>", "author": "Yili Li et.al.", "authors": "Yili Li, Jing Yu, Keke Gai, Gang Xiong", "id": "2408.07989v1", "paper_url": "http://arxiv.org/abs/2408.07989v1", "repo": "https://github.com/lilidamowang/iiu"}}