{"2405.12807": {"publish_time": "2024-05-21", "title": "FAdam: Adam is a natural gradient optimizer using diagonal empirical Fisher information", "paper_summary": "This paper establishes a mathematical foundation for the Adam optimizer,\nelucidating its connection to natural gradient descent through Riemannian and\ninformation geometry. We rigorously analyze the diagonal empirical Fisher\ninformation matrix (FIM) in Adam, clarifying all detailed approximations and\nadvocating for the use of log probability functions as loss, which should be\nbased on discrete distributions, due to the limitations of empirical FIM. Our\nanalysis uncovers flaws in the original Adam algorithm, leading to proposed\ncorrections such as enhanced momentum calculations, adjusted bias corrections,\nand gradient clipping. We refine the weight decay term based on our theoretical\nframework. Our modified algorithm, Fisher Adam (FAdam), demonstrates superior\nperformance across diverse domains including LLM, ASR, and VQ-VAE, achieving\nstate-of-the-art results in ASR.", "paper_summary_zh": "這篇論文為 Adam 最佳化器建立了一個數學基礎，\n闡明了它與透過黎曼和資訊幾何的自然梯度下降的關聯。我們嚴謹地分析了 Adam 中的對角經驗 Fisher 資訊矩陣 (FIM)，釐清所有詳細的近似，並提倡使用對數機率函數作為損失，這應基於離散分佈，因為經驗 FIM 有其限制。我們的分析揭露了原始 Adam 演算法的缺陷，導致建議進行修正，例如增強動量計算、調整偏差修正和梯度裁剪。我們根據我們的理論架構改善了權重衰減項。我們改良的演算法 Fisher Adam (FAdam) 在 LLM、ASR 和 VQ-VAE 等不同領域展示了卓越的效能，在 ASR 中取得了最先進的結果。", "author": "Dongseong Hwang et.al.", "authors": "Dongseong Hwang", "id": "2405.12807v1", "paper_url": "http://arxiv.org/abs/2405.12807v1", "repo": "null"}}