{"2409.15687": {"publish_time": "2024-09-24", "title": "A Comprehensive Evaluation of Large Language Models on Mental Illnesses", "paper_summary": "Large language models have shown promise in various domains, including\nhealthcare. In this study, we conduct a comprehensive evaluation of LLMs in the\ncontext of mental health tasks using social media data. We explore the\nzero-shot (ZS) and few-shot (FS) capabilities of various LLMs, including GPT-4,\nLlama 3, Gemini, and others, on tasks such as binary disorder detection,\ndisorder severity evaluation, and psychiatric knowledge assessment. Our\nevaluation involved 33 models testing 9 main prompt templates across the tasks.\nKey findings revealed that models like GPT-4 and Llama 3 exhibited superior\nperformance in binary disorder detection, with accuracies reaching up to 85% on\ncertain datasets. Moreover, prompt engineering played a crucial role in\nenhancing model performance. Notably, the Mixtral 8x22b model showed an\nimprovement of over 20%, while Gemma 7b experienced a similar boost in\nperformance. In the task of disorder severity evaluation, we observed that FS\nlearning significantly improved the model's accuracy, highlighting the\nimportance of contextual examples in complex assessments. Notably, the\nPhi-3-mini model exhibited a substantial increase in performance, with balanced\naccuracy improving by over 6.80% and mean average error dropping by nearly 1.3\nwhen moving from ZS to FS learning. In the psychiatric knowledge task, recent\nmodels generally outperformed older, larger counterparts, with the Llama 3.1\n405b achieving an accuracy of 91.2%. Despite promising results, our analysis\nidentified several challenges, including variability in performance across\ndatasets and the need for careful prompt engineering. Furthermore, the ethical\nguards imposed by many LLM providers hamper the ability to accurately evaluate\ntheir performance, due to tendency to not respond to potentially sensitive\nqueries.", "paper_summary_zh": "大型語言模型已在醫療保健等各個領域展現潛力。在本研究中，我們使用社群媒體資料對 LLM 在心理健康任務中的表現進行全面評估。我們探討各種 LLM，包括 GPT-4、Llama 3、Gemini 等，在二元障礙偵測、障礙嚴重性評估和精神疾病知識評估等任務上的零次學習 (ZS) 和少次學習 (FS) 能力。我們的評估涉及 33 個模型，在各項任務中測試 9 個主要提示範本。主要發現顯示，GPT-4 和 Llama 3 等模型在二元障礙偵測中表現出優異的效能，在特定資料集上的準確率高達 85%。此外，提示工程在提升模型效能方面扮演至關重要的角色。值得注意的是，Mixtral 8x22b 模型的進步幅度超過 20%，而 Gemma 7b 的效能也獲得類似的提升。在障礙嚴重性評估任務中，我們觀察到 FS 學習顯著提升模型的準確度，突顯出背景範例在複雜評估中的重要性。值得注意的是，Phi-3-mini 模型的效能大幅提升，從 ZS 學習轉換到 FS 學習後，平衡準確度提升超過 6.80%，平均平均誤差降低近 1.3。在精神疾病知識任務中，較新的模型通常優於較舊、較大的模型，其中 Llama 3.1 405b 達到 91.2% 的準確度。儘管有令人振奮的結果，我們的分析發現了幾個挑戰，包括跨資料集的效能變異性，以及仔細提示工程的需求。此外，許多 LLM 提供者施加的道德守則阻礙了準確評估其效能的能力，因為它們傾向於不回應潛在的敏感查詢。", "author": "Abdelrahman Hanafi et.al.", "authors": "Abdelrahman Hanafi, Mohammed Saad, Noureldin Zahran, Radwa J. Hanafy, Mohammed E. Fouda", "id": "2409.15687v1", "paper_url": "http://arxiv.org/abs/2409.15687v1", "repo": "null"}}