{"2302.00785": {"publish_time": "2023-02-01", "title": "SkinCon: A skin disease dataset densely annotated by domain experts for fine-grained model debugging and analysis", "paper_summary": "For the deployment of artificial intelligence (AI) in high-risk settings,\nsuch as healthcare, methods that provide interpretability/explainability or\nallow fine-grained error analysis are critical. Many recent methods for\ninterpretability/explainability and fine-grained error analysis use concepts,\nwhich are meta-labels that are semantically meaningful to humans. However,\nthere are only a few datasets that include concept-level meta-labels and most\nof these meta-labels are relevant for natural images that do not require domain\nexpertise. Densely annotated datasets in medicine focused on meta-labels that\nare relevant to a single disease such as melanoma. In dermatology, skin disease\nis described using an established clinical lexicon that allows clinicians to\ndescribe physical exam findings to one another. To provide a medical dataset\ndensely annotated by domain experts with annotations useful across multiple\ndisease processes, we developed SkinCon: a skin disease dataset densely\nannotated by dermatologists. SkinCon includes 3230 images from the Fitzpatrick\n17k dataset densely annotated with 48 clinical concepts, 22 of which have at\nleast 50 images representing the concept. The concepts used were chosen by two\ndermatologists considering the clinical descriptor terms used to describe skin\nlesions. Examples include \"plaque\", \"scale\", and \"erosion\". The same concepts\nwere also used to label 656 skin disease images from the Diverse Dermatology\nImages dataset, providing an additional external dataset with diverse skin tone\nrepresentations. We review the potential applications for the SkinCon dataset,\nsuch as probing models, concept-based explanations, and concept bottlenecks.\nFurthermore, we use SkinCon to demonstrate two of these use cases: debugging\nmistakes of an existing dermatology AI model with concepts and developing\ninterpretable models with post-hoc concept bottleneck models.", "paper_summary_zh": "", "author": "Roxana Daneshjou et.al.", "authors": "Roxana Daneshjou,Mert Yuksekgonul,Zhuo Ran Cai,Roberto Novoa,James Zou", "id": "2302.00785v1", "paper_url": "http://arxiv.org/abs/2302.00785v1", "repo": "null"}}