{"2302.00785": {"publish_time": "2023-02-01", "title": "SkinCon: A skin disease dataset densely annotated by domain experts for fine-grained model debugging and analysis", "paper_summary": "For the deployment of artificial intelligence (AI) in high-risk settings,\nsuch as healthcare, methods that provide interpretability/explainability or\nallow fine-grained error analysis are critical. Many recent methods for\ninterpretability/explainability and fine-grained error analysis use concepts,\nwhich are meta-labels that are semantically meaningful to humans. However,\nthere are only a few datasets that include concept-level meta-labels and most\nof these meta-labels are relevant for natural images that do not require domain\nexpertise. Densely annotated datasets in medicine focused on meta-labels that\nare relevant to a single disease such as melanoma. In dermatology, skin disease\nis described using an established clinical lexicon that allows clinicians to\ndescribe physical exam findings to one another. To provide a medical dataset\ndensely annotated by domain experts with annotations useful across multiple\ndisease processes, we developed SkinCon: a skin disease dataset densely\nannotated by dermatologists. SkinCon includes 3230 images from the Fitzpatrick\n17k dataset densely annotated with 48 clinical concepts, 22 of which have at\nleast 50 images representing the concept. The concepts used were chosen by two\ndermatologists considering the clinical descriptor terms used to describe skin\nlesions. Examples include \"plaque\", \"scale\", and \"erosion\". The same concepts\nwere also used to label 656 skin disease images from the Diverse Dermatology\nImages dataset, providing an additional external dataset with diverse skin tone\nrepresentations. We review the potential applications for the SkinCon dataset,\nsuch as probing models, concept-based explanations, and concept bottlenecks.\nFurthermore, we use SkinCon to demonstrate two of these use cases: debugging\nmistakes of an existing dermatology AI model with concepts and developing\ninterpretable models with post-hoc concept bottleneck models.", "paper_summary_zh": "<paragraph>在高風險環境中部署人工智慧 (AI)（例如醫療保健），提供可解釋性/可說明性的方法或允許精細錯誤分析非常重要。許多近期用於可解釋性/可說明性和精細錯誤分析的方法都使用概念，這些概念是對人類具有語義意義的元標籤。然而，只有少數資料集包含概念層級的元標籤，而且這些元標籤大多與不需要領域專業知識的自然影像相關。專注於單一疾病（例如黑色素瘤）的元標籤的醫學密集標記資料集。在皮膚科中，皮膚疾病的描述使用既定的臨床詞彙，讓臨床醫生可以彼此描述身體檢查結果。為了提供由領域專家密集標記的醫學資料集，其中包含可跨多種疾病過程使用的標記，我們開發了 SkinCon：由皮膚科醫師密集標記的皮膚疾病資料集。SkinCon 包含來自 Fitzpatrick 17k 資料集的 3230 張影像，密集標記了 48 個臨床概念，其中 22 個概念至少有 50 張影像代表該概念。所使用的概念是由兩位皮膚科醫師在考量用於描述皮膚病變的臨床描述詞彙後選出的。範例包括「斑塊」、「鱗屑」和「糜爛」。相同的概念也用於標記來自 Diverse Dermatology Images 資料集的 656 張皮膚疾病影像，提供具有多樣膚色表示的額外外部資料集。我們檢視 SkinCon 資料集的潛在應用，例如探測模型、基於概念的說明和概念瓶頸。此外，我們使用 SkinCon 來展示這兩個使用案例：使用概念除錯現有皮膚科 AI 模型的錯誤，以及使用事後概念瓶頸模型開發可解釋的模型。</paragraph>", "author": "Roxana Daneshjou et.al.", "authors": "Roxana Daneshjou, Mert Yuksekgonul, Zhuo Ran Cai, Roberto Novoa, James Zou", "id": "2302.00785v1", "paper_url": "http://arxiv.org/abs/2302.00785v1", "repo": "null"}}