{"2408.02272": {"publish_time": "2024-08-05", "title": "COM Kitchens: An Unedited Overhead-view Video Dataset as a Vision-Language Benchmark", "paper_summary": "Procedural video understanding is gaining attention in the vision and\nlanguage community. Deep learning-based video analysis requires extensive data.\nConsequently, existing works often use web videos as training resources, making\nit challenging to query instructional contents from raw video observations. To\naddress this issue, we propose a new dataset, COM Kitchens. The dataset\nconsists of unedited overhead-view videos captured by smartphones, in which\nparticipants performed food preparation based on given recipes. Fixed-viewpoint\nvideo datasets often lack environmental diversity due to high camera setup\ncosts. We used modern wide-angle smartphone lenses to cover cooking counters\nfrom sink to cooktop in an overhead view, capturing activity without in-person\nassistance. With this setup, we collected a diverse dataset by distributing\nsmartphones to participants. With this dataset, we propose the novel\nvideo-to-text retrieval task Online Recipe Retrieval (OnRR) and new video\ncaptioning domain Dense Video Captioning on unedited Overhead-View videos\n(DVC-OV). Our experiments verified the capabilities and limitations of current\nweb-video-based SOTA methods in handling these tasks.", "paper_summary_zh": "程序视频理解在视觉和语言社区中备受关注。基于深度学习的视频分析需要大量数据。因此，现有工作通常使用网络视频作为训练资源，这使得从原始视频观察中查询教学内容具有挑战性。为了解决这个问题，我们提出了一个新的数据集，COM Kitchens。该数据集由智能手机拍摄的未经编辑的俯视图视频组成，其中参与者根据给定的食谱进行食物准备。固定视点视频数据集由于摄像机设置成本高，通常缺乏环境多样性。我们使用现代广角智能手机镜头从水槽到炉灶以俯视图覆盖烹饪台，在没有人员协助的情况下捕捉活动。通过这种设置，我们通过向参与者分发智能手机收集了一个多样化的数据集。使用此数据集，我们提出了新颖的视频到文本检索任务在线食谱检索（OnRR）和新的视频字幕域未编辑俯视图视频上的密集视频字幕（DVC-OV）。我们的实验验证了当前基于网络视频的 SOTA 方法在处理这些任务时的能力和局限性。", "author": "Koki Maeda et.al.", "authors": "Koki Maeda, Tosho Hirasawa, Atsushi Hashimoto, Jun Harashima, Leszek Rybicki, Yusuke Fukasawa, Yoshitaka Ushiku", "id": "2408.02272v1", "paper_url": "http://arxiv.org/abs/2408.02272v1", "repo": "null"}}