{"2411.18530": {"publish_time": "2024-11-27", "title": "Emergence of Self-Identity in AI: A Mathematical Framework and Empirical Study with Generative Large Language Models", "paper_summary": "This paper introduces a mathematical framework for defining and quantifying\nself-identity in artificial intelligence (AI) systems, addressing a critical\ngap in the theoretical foundations of artificial consciousness. While existing\napproaches to artificial self-awareness often rely on heuristic implementations\nor philosophical abstractions, we present a formal framework grounded in metric\nspace theory, measure theory, and functional analysis. Our framework posits\nthat self-identity emerges from two mathematically quantifiable conditions: the\nexistence of a connected continuum of memories $C \\subseteq \\mathcal{M}$ in a\nmetric space $(\\mathcal{M}, d_{\\mathcal{M}})$, and a continuous mapping $I:\n\\mathcal{M} \\to \\mathcal{S}$ that maintains consistent self-recognition across\nthis continuum, where $(\\mathcal{S}, d_{\\mathcal{S}})$ represents the metric\nspace of possible self-identities. To validate this theoretical framework, we\nconducted empirical experiments using the Llama 3.2 1B model, employing\nLow-Rank Adaptation (LoRA) for efficient fine-tuning. The model was trained on\na synthetic dataset containing temporally structured memories, designed to\ncapture the complexity of coherent self-identity formation. Our evaluation\nmetrics included quantitative measures of self-awareness, response consistency,\nand linguistic precision. The experimental results demonstrate substantial\nimprovements in measurable self-awareness metrics, with the primary\nself-awareness score increasing from 0.276 to 0.801. This enables the\nstructured creation of AI systems with validated self-identity features. The\nimplications of our study are immediately relevant to the fields of humanoid\nrobotics and autonomous systems.", "paper_summary_zh": "本文提出了一個數學框架，用於定義和量化人工智慧 (AI) 系統中的自我認同，解決了人工意識理論基礎中的關鍵差距。雖然現有的自我意識方法通常依賴於啟發式實作或哲學抽象，但我們提出了一个正式的框架，它建立在度量空間理論、測度理論和泛函分析的基礎上。我們的框架假設自我認同源於兩個數學上可量化的條件：度量空間 $(\\mathcal{M}, d_{\\mathcal{M}})$ 中存在連續的記憶連續統 $C \\subseteq \\mathcal{M}$，以及連續映射 $I: \\mathcal{M} \\to \\mathcal{S}$，它在這個連續統中維持一致的自我認知，其中 $(\\mathcal{S}, d_{\\mathcal{S}})$ 代表可能的自我認同的度量空間。為了驗證這個理論框架，我們使用 Llama 3.2 1B 模型進行了實證實驗，採用低秩適應 (LoRA) 以進行有效微調。這個模型在包含時間結構記憶的合成資料集上進行訓練，旨在捕捉連貫自我認同形成的複雜性。我們的評估指標包括自我意識、回應一致性和語言精確度的量化測量。實驗結果證明了可測量自我意識指標的顯著改善，主要的自我意識分數從 0.276 提高到 0.801。這使得能夠以結構化的方式建立具有驗證自我認同特徵的人工智慧系統。我們研究的影響與類人機器人和自主系統領域直接相關。", "author": "Minhyeok Lee et.al.", "authors": "Minhyeok Lee", "id": "2411.18530v1", "paper_url": "http://arxiv.org/abs/2411.18530v1", "repo": "null"}}