{"2410.19290": {"publish_time": "2024-10-25", "title": "Fictitious Synthetic Data Can Improve LLM Factuality via Prerequisite Learning", "paper_summary": "Recent studies have identified one aggravating factor of LLM hallucinations\nas the knowledge inconsistency between pre-training and fine-tuning, where\nunfamiliar fine-tuning data mislead the LLM to fabricate plausible but wrong\noutputs. In this paper, we propose a novel fine-tuning strategy called\nPrereq-Tune to address this knowledge inconsistency and reduce hallucinations.\nFundamentally, Prereq-Tune disentangles the learning of skills and knowledge,\nso the model learns only the task skills without being impacted by the\nknowledge inconsistency. To achieve this, Prereq-Tune introduces an additional\nprerequisite learning stage to learn the necessary knowledge for SFT, allowing\nsubsequent SFT to focus only on task skills. Prereq-Tune can also be combined\nwith fictitious synthetic data to enhance the grounding of LLM outputs to their\ninternal knowledge. Experiments show that Prereq-Tune outperforms existing\nbaselines in improving LLM's factuality across short QA and long-form\ngeneration tasks. It also opens new possibilities for knowledge-controlled\ngeneration in LLMs. Our code is available at\nhttps://github.com/UCSB-NLP-Chang/Prereq_tune.git.", "paper_summary_zh": "最近的研究已找出 LLM 幻觉的一个加重因素，即预训练与微调之间的知识不一致，其中不熟悉的微调数据会误导 LLM 捏造似是而非但错误的输出。本文中，我们提出一种名为 Prereq-Tune 的新微调策略来解决此知识不一致并减少幻觉。从根本上，Prereq-Tune 解开技能和知识的学习，因此模型仅学习任务技能，而不会受到知识不一致的影响。为实现此目的，Prereq-Tune 引入一个额外的先决条件学习阶段来学习 SFT 所需的知识，从而允许后续 SFT 仅专注于任务技能。Prereq-Tune 还可以与虚构的合成数据结合使用，以增强 LLM 输出与其内部知识的基础。实验表明，Prereq-Tune 在改善 LLM 在短问答和长篇生成任务中的事实性方面优于现有的基准。它还为 LLM 中的知识控制生成开辟了新的可能性。我们的代码可在 https://github.com/UCSB-NLP-Chang/Prereq_tune.git 获得。", "author": "Yujian Liu et.al.", "authors": "Yujian Liu, Shiyu Chang, Tommi Jaakkola, Yang Zhang", "id": "2410.19290v1", "paper_url": "http://arxiv.org/abs/2410.19290v1", "repo": "https://github.com/ucsb-nlp-chang/prereq_tune"}}