{"2503.15470": {"publish_time": "2025-03-19", "title": "EgoDTM: Towards 3D-Aware Egocentric Video-Language Pretraining", "paper_summary": "Egocentric video-language pretraining has significantly advanced video\nrepresentation learning. Humans perceive and interact with a fully 3D world,\ndeveloping spatial awareness that extends beyond text-based understanding.\nHowever, most previous works learn from 1D text or 2D visual cues, such as\nbounding boxes, which inherently lack 3D understanding. To bridge this gap, we\nintroduce EgoDTM, an Egocentric Depth- and Text-aware Model, jointly trained\nthrough large-scale 3D-aware video pretraining and video-text contrastive\nlearning. EgoDTM incorporates a lightweight 3D-aware decoder to efficiently\nlearn 3D-awareness from pseudo depth maps generated by depth estimation models.\nTo further facilitate 3D-aware video pretraining, we enrich the original brief\ncaptions with hand-object visual cues by organically combining several\nfoundation models. Extensive experiments demonstrate EgoDTM's superior\nperformance across diverse downstream tasks, highlighting its superior 3D-aware\nvisual understanding. Our code will be released at\nhttps://github.com/xuboshen/EgoDTM.", "paper_summary_zh": "<paragraph>以自我為中心的視訊-語言預訓練顯著提升了視訊表徵學習。人類感知並與一個完整的 3D 世界互動，發展出超越基於文字理解的空間意識。然而，大多數先前的工作都是從 1D 文字或 2D 視覺線索（例如邊界框）中學習，這些線索本身缺乏 3D 理解。為了彌合這一差距，我們引入了 EgoDTM，一個以自我為中心、深度和文字感知的模型，它通過大規模 3D 感知視訊預訓練和視訊-文字對比學習進行聯合訓練。EgoDTM 整合了一個輕量級的 3D 感知解碼器，可以有效地從深度估計模型生成的偽深度圖中學習 3D 感知能力。為了進一步促進 3D 感知視訊預訓練，我們通過有機地結合幾個基礎模型，用手-物體視覺線索豐富了原始的簡短標題。大量實驗證明了 EgoDTM 在各種下游任務中的卓越性能，突出了其卓越的 3D 感知視覺理解能力。我們的程式碼將發佈在 https://github.com/xuboshen/EgoDTM。</paragraph>\n", "author": "Boshen Xu et.al.", "authors": "Boshen Xu, Yuting Mei, Xinbi Liu, Sipeng Zheng, Qin Jin", "id": "2503.15470v1", "paper_url": "http://arxiv.org/abs/2503.15470v1", "repo": "null"}}