{"2410.03396": {"publish_time": "2024-10-04", "title": "GraphCroc: Cross-Correlation Autoencoder for Graph Structural Reconstruction", "paper_summary": "Graph-structured data is integral to many applications, prompting the\ndevelopment of various graph representation methods. Graph autoencoders (GAEs),\nin particular, reconstruct graph structures from node embeddings. Current GAE\nmodels primarily utilize self-correlation to represent graph structures and\nfocus on node-level tasks, often overlooking multi-graph scenarios. Our\ntheoretical analysis indicates that self-correlation generally falls short in\naccurately representing specific graph features such as islands, symmetrical\nstructures, and directional edges, particularly in smaller or multiple graph\ncontexts. To address these limitations, we introduce a cross-correlation\nmechanism that significantly enhances the GAE representational capabilities.\nAdditionally, we propose GraphCroc, a new GAE that supports flexible encoder\narchitectures tailored for various downstream tasks and ensures robust\nstructural reconstruction, through a mirrored encoding-decoding process. This\nmodel also tackles the challenge of representation bias during optimization by\nimplementing a loss-balancing strategy. Both theoretical analysis and numerical\nevaluations demonstrate that our methodology significantly outperforms existing\nself-correlation-based GAEs in graph structure reconstruction.", "paper_summary_zh": "圖形結構化資料是許多應用程式中不可或缺的一部分，促使各種圖形表示方法的發展。特別是圖形自動編碼器 (GAE) 從節點嵌入中重建圖形結構。目前的 GAE 模型主要利用自我相關性來表示圖形結構，並專注於節點層級的任務，經常忽略多圖形場景。我們的理論分析表明，自我相關性通常無法準確表示特定的圖形特徵，例如孤立點、對稱結構和有向邊緣，特別是在較小或多個圖形環境中。為了解決這些限制，我們引入了一個交叉相關機制，可以顯著增強 GAE 的表示能力。此外，我們提出了 GraphCroc，這是一個新的 GAE，它支援針對各種下游任務量身打造的彈性編碼器架構，並透過鏡像編碼解碼過程確保穩健的結構重建。此模型也透過實作損失平衡策略來解決最佳化過程中表示偏差的挑戰。理論分析和數值評估都證明，我們的技術在圖形結構重建方面顯著優於現有的基於自我相關性的 GAE。", "author": "Shijin Duan et.al.", "authors": "Shijin Duan, Ruyi Ding, Jiaxing He, Aidong Adam Ding, Yunsi Fei, Xiaolin Xu", "id": "2410.03396v1", "paper_url": "http://arxiv.org/abs/2410.03396v1", "repo": "https://github.com/sjduan/graphcroc"}}