{"2412.15501": {"publish_time": "2024-12-20", "title": "Humanlike Cognitive Patterns as Emergent Phenomena in Large Language Models", "paper_summary": "Research on emergent patterns in Large Language Models (LLMs) has gained\nsignificant traction in both psychology and artificial intelligence, motivating\nthe need for a comprehensive review that offers a synthesis of this complex\nlandscape. In this article, we systematically review LLMs' capabilities across\nthree important cognitive domains: decision-making biases, reasoning, and\ncreativity. We use empirical studies drawing on established psychological tests\nand compare LLMs' performance to human benchmarks. On decision-making, our\nsynthesis reveals that while LLMs demonstrate several human-like biases, some\nbiases observed in humans are absent, indicating cognitive patterns that only\npartially align with human decision-making. On reasoning, advanced LLMs like\nGPT-4 exhibit deliberative reasoning akin to human System-2 thinking, while\nsmaller models fall short of human-level performance. A distinct dichotomy\nemerges in creativity: while LLMs excel in language-based creative tasks, such\nas storytelling, they struggle with divergent thinking tasks that require\nreal-world context. Nonetheless, studies suggest that LLMs hold considerable\npotential as collaborators, augmenting creativity in human-machine\nproblem-solving settings. Discussing key limitations, we also offer guidance\nfor future research in areas such as memory, attention, and open-source model\ndevelopment.", "paper_summary_zh": "大型語言模型 (LLM) 中出現模式的研究在心理學和人工智慧領域都獲得了顯著的關注，促使需要進行全面回顧，以綜合這個複雜的領域。在本文中，我們系統性地回顧了 LLM 在三個重要的認知領域中的能力：決策偏誤、推理和創造力。我們使用依據既定的心理測驗進行的實證研究，並將 LLM 的表現與人類基準進行比較。在決策制定方面，我們的綜合分析顯示，儘管 LLM 表現出幾種類似人類的偏誤，但在人類中觀察到的某些偏誤卻不存在，這表明認知模式僅部分與人類決策制定相符。在推理方面，GPT-4 等先進的 LLM 表現出類似人類系統 2 思考的審議推理，而較小的模型則未達到人類水準的表現。在創造力方面出現了明顯的二分法：雖然 LLM 在基於語言的創造性任務中表現出色，例如講故事，但它們在需要現實世界脈絡的發散性思考任務中卻表現不佳。儘管如此，研究表明 LLM 具有相當大的潛力作為協作者，在人機問題解決環境中增強創造力。在討論關鍵限制時，我們還為記憶、注意力和開源模型開發等領域的未來研究提供指導。", "author": "Zhisheng Tang et.al.", "authors": "Zhisheng Tang, Mayank Kejriwal", "id": "2412.15501v1", "paper_url": "http://arxiv.org/abs/2412.15501v1", "repo": "null"}}