{"2410.20916": {"publish_time": "2024-10-28", "title": "NeuGPT: Unified multi-modal Neural GPT", "paper_summary": "This paper introduces NeuGPT, a groundbreaking multi-modal language\ngeneration model designed to harmonize the fragmented landscape of neural\nrecording research. Traditionally, studies in the field have been\ncompartmentalized by signal type, with EEG, MEG, ECoG, SEEG, fMRI, and fNIRS\ndata being analyzed in isolation. Recognizing the untapped potential for\ncross-pollination and the adaptability of neural signals across varying\nexperimental conditions, we set out to develop a unified model capable of\ninterfacing with multiple modalities. Drawing inspiration from the success of\npre-trained large models in NLP, computer vision, and speech processing, NeuGPT\nis architected to process a diverse array of neural recordings and interact\nwith speech and text data. Our model mainly focus on brain-to-text decoding,\nimproving SOTA from 6.94 to 12.92 on BLEU-1 and 6.93 to 13.06 on ROUGE-1F. It\ncan also simulate brain signals, thereby serving as a novel neural interface.\nCode is available at\n\\href{https://github.com/NeuSpeech/NeuGPT}{NeuSpeech/NeuGPT\n(https://github.com/NeuSpeech/NeuGPT) .}", "paper_summary_zh": "本文介紹了 NeuGPT，這是一個劃時代的多模態語言生成模型，旨在調和神經記錄研究中支離破碎的現況。傳統上，該領域的研究一直由訊號類型區隔開來，EEG、MEG、ECoG、SEEG、fMRI 和 fNIRS 資料會被孤立地分析。我們認知到跨領域傳粉的潛力以及神經訊號在不同實驗條件下的適應性，因此著手開發一個統一的模型，能夠與多種模式介接。從 NLP、電腦視覺和語音處理中預先訓練大型模型的成功中汲取靈感，NeuGPT 被設計用於處理各種神經記錄，並與語音和文字資料互動。我們的模型主要專注於腦對文字的解碼，將 BLEU-1 的 SOTA 從 6.94 提升到 12.92，將 ROUGE-1F 從 6.93 提升到 13.06。它還可以模擬腦訊號，從而作為一個新穎的神經介面。程式碼可在\n\\href{https://github.com/NeuSpeech/NeuGPT}{NeuSpeech/NeuGPT\n(https://github.com/NeuSpeech/NeuGPT) .} 取得。", "author": "Yiqian Yang et.al.", "authors": "Yiqian Yang, Yiqun Duan, Hyejeong Jo, Qiang Zhang, Renjing Xu, Oiwi Parker Jones, Xuming Hu, Chin-teng Lin, Hui Xiong", "id": "2410.20916v1", "paper_url": "http://arxiv.org/abs/2410.20916v1", "repo": "null"}}