{"2412.02302": {"publish_time": "2024-12-03", "title": "Enhanced Photovoltaic Power Forecasting: An iTransformer and LSTM-Based Model Integrating Temporal and Covariate Interactions", "paper_summary": "Accurate photovoltaic (PV) power forecasting is critical for integrating\nrenewable energy sources into the grid, optimizing real-time energy management,\nand ensuring energy reliability amidst increasing demand. However, existing\nmodels often struggle with effectively capturing the complex relationships\nbetween target variables and covariates, as well as the interactions between\ntemporal dynamics and multivariate data, leading to suboptimal forecasting\naccuracy. To address these challenges, we propose a novel model architecture\nthat leverages the iTransformer for feature extraction from target variables\nand employs long short-term memory (LSTM) to extract features from covariates.\nA cross-attention mechanism is integrated to fuse the outputs of both models,\nfollowed by a Kolmogorov-Arnold network (KAN) mapping for enhanced\nrepresentation. The effectiveness of the proposed model is validated using\npublicly available datasets from Australia, with experiments conducted across\nfour seasons. Results demonstrate that the proposed model effectively capture\nseasonal variations in PV power generation and improve forecasting accuracy.", "paper_summary_zh": "精準的光電 (PV) 電力預測對於將再生能源整合到電網、最佳化即時能源管理，以及在需求增加的情況下確保能源可靠性至關重要。然而，現有的模型通常難以有效捕捉目標變數和協變數之間的複雜關係，以及時間動態和多變量資料之間的交互作用，導致次佳的預測準確度。為了應對這些挑戰，我們提出了一種新穎的模型架構，該架構利用 iTransformer 從目標變數中提取特徵，並採用長短期記憶 (LSTM) 從協變數中提取特徵。整合了一個交叉注意機制來融合兩個模型的輸出，然後進行 Kolmogorov-Arnold 網路 (KAN) 對應以增強表示。所提出的模型的有效性使用來自澳洲的公開可用資料集進行驗證，並在四季進行實驗。結果表明，所提出的模型有效地捕捉了光電電力產生的季節變化，並提高了預測準確度。", "author": "Guang Wu et.al.", "authors": "Guang Wu, Yun Wang, Qian Zhou, Ziyang Zhang", "id": "2412.02302v1", "paper_url": "http://arxiv.org/abs/2412.02302v1", "repo": "null"}}