{"2408.10919": {"publish_time": "2024-08-20", "title": "CrossFi: A Cross Domain Wi-Fi Sensing Framework Based on Siamese Network", "paper_summary": "In recent years, Wi-Fi sensing has garnered significant attention due to its\nnumerous benefits, such as privacy protection, low cost, and penetration\nability. Extensive research has been conducted in this field, focusing on areas\nsuch as gesture recognition, people identification, and fall detection.\nHowever, many data-driven methods encounter challenges related to domain shift,\nwhere the model fails to perform well in environments different from the\ntraining data. One major factor contributing to this issue is the limited\navailability of Wi-Fi sensing datasets, which makes models learn excessive\nirrelevant information and over-fit to the training set. Unfortunately,\ncollecting large-scale Wi-Fi sensing datasets across diverse scenarios is a\nchallenging task. To address this problem, we propose CrossFi, a siamese\nnetwork-based approach that excels in both in-domain scenario and cross-domain\nscenario, including few-shot, zero-shot scenarios, and even works in few-shot\nnew-class scenario where testing set contains new categories. The core\ncomponent of CrossFi is a sample-similarity calculation network called CSi-Net,\nwhich improves the structure of the siamese network by using an attention\nmechanism to capture similarity information, instead of simply calculating the\ndistance or cosine similarity. Based on it, we develop an extra Weight-Net that\ncan generate a template for each class, so that our CrossFi can work in\ndifferent scenarios. Experimental results demonstrate that our CrossFi achieves\nstate-of-the-art performance across various scenarios. In gesture recognition\ntask, our CrossFi achieves an accuracy of 98.17% in in-domain scenario, 91.72%\nin one-shot cross-domain scenario, 64.81% in zero-shot cross-domain scenario,\nand 84.75% in one-shot new-class scenario. To facilitate future research, we\nwill release the code for our model upon publication.", "paper_summary_zh": "近年來，Wi-Fi 感測因其眾多好處，例如隱私保護、低成本和穿透能力，而備受關注。這個領域已經進行了廣泛的研究，重點關注手勢辨識、人員識別和跌倒偵測等領域。然而，許多資料驅動方法會遇到與領域轉移相關的挑戰，其中模型無法在與訓練資料不同的環境中執行良好。導致此問題的一個主要因素是 Wi-Fi 感測資料集的可用性有限，這使得模型學習過多的無關資訊，並過度擬合訓練集。不幸的是，在不同的場景中收集大規模的 Wi-Fi 感測資料集是一項具有挑戰性的任務。為了解決這個問題，我們提出了 CrossFi，一種基於連體網路的方法，在領域內場景和跨領域場景中都表現出色，包括少樣本、零樣本場景，甚至在少樣本新類別場景中也能執行，其中測試集包含新的類別。CrossFi 的核心組成部分是一個稱為 CSi-Net 的樣本相似性計算網路，它透過使用注意力機制來擷取相似性資訊，而不是僅計算距離或餘弦相似性，從而改善了連體網路的結構。基於此，我們開發了一個額外的 Weight-Net，它可以為每個類別產生一個範本，以便我們的 CrossFi 能在不同的場景中執行。實驗結果表明，我們的 CrossFi 在各種場景中都達到了最先進的效能。在手勢辨識任務中，我們的 CrossFi 在領域內場景中達到了 98.17% 的準確度，在一次性跨領域場景中達到了 91.72%，在零次性跨領域場景中達到了 64.81%，在一次性新類別場景中達到了 84.75%。為了促進未來的研究，我們將在發表後釋出我們模型的程式碼。", "author": "Zijian Zhao et.al.", "authors": "Zijian Zhao, Tingwei Chen, Zhijie Cai, Hang Li, Xiaoyang Li, Qimei Chen, Guangxu Zhu", "id": "2408.10919v1", "paper_url": "http://arxiv.org/abs/2408.10919v1", "repo": "null"}}