{"2302.03033": {"publish_time": "2023-01-18", "title": "Exemplars and Counterexemplars Explanations for Image Classifiers, Targeting Skin Lesion Labeling", "paper_summary": "Explainable AI consists in developing mechanisms allowing for an interaction\nbetween decision systems and humans by making the decisions of the formers\nunderstandable. This is particularly important in sensitive contexts like in\nthe medical domain. We propose a use case study, for skin lesion diagnosis,\nillustrating how it is possible to provide the practitioner with explanations\non the decisions of a state of the art deep neural network classifier trained\nto characterize skin lesions from examples. Our framework consists of a trained\nclassifier onto which an explanation module operates. The latter is able to\noffer the practitioner exemplars and counterexemplars for the classification\ndiagnosis thus allowing the physician to interact with the automatic diagnosis\nsystem. The exemplars are generated via an adversarial autoencoder. We\nillustrate the behavior of the system on representative examples.", "paper_summary_zh": "可解釋 AI 是在開發機制，讓決策系統與人類之間能互動，並讓前者的決策變得可以理解。這在敏感的脈絡中特別重要，例如在醫療領域。我們提出一個使用案例研究，用於皮膚病變診斷，說明如何讓執業醫師了解最先進的深度神經網路分類器在決策上的解釋，該分類器經過訓練，可以從範例中描述皮膚病變。我們的架構包含一個訓練過的分類器，解釋模組會在該分類器上運作。後者能夠為分類診斷提供執業醫師範例和反例，因此讓醫師可以與自動診斷系統互動。範例是透過對抗式自動編碼器產生的。我們說明系統在代表性範例上的行為。", "author": "Carlo Metta et.al.", "authors": "Carlo Metta, Riccardo Guidotti, Yuan Yin, Patrick Gallinari, Salvatore Rinzivillo", "id": "2302.03033v1", "paper_url": "http://arxiv.org/abs/2302.03033v1", "repo": "null"}}