{"2412.20977": {"publish_time": "2024-12-30", "title": "UnrealZoo: Enriching Photo-realistic Virtual Worlds for Embodied AI", "paper_summary": "We introduce UnrealZoo, a rich collection of photo-realistic 3D virtual\nworlds built on Unreal Engine, designed to reflect the complexity and\nvariability of the open worlds. Additionally, we offer a variety of playable\nentities for embodied AI agents. Based on UnrealCV, we provide a suite of\neasy-to-use Python APIs and tools for various potential applications, such as\ndata collection, environment augmentation, distributed training, and\nbenchmarking. We optimize the rendering and communication efficiency of\nUnrealCV to support advanced applications, such as multi-agent interaction. Our\nexperiments benchmark agents in various complex scenes, focusing on visual\nnavigation and tracking, which are fundamental capabilities for embodied visual\nintelligence. The results yield valuable insights into the advantages of\ndiverse training environments for reinforcement learning (RL) agents and the\nchallenges faced by current embodied vision agents, including those based on RL\nand large vision-language models (VLMs), in open worlds. These challenges\ninvolve latency in closed-loop control in dynamic scenes and reasoning about 3D\nspatial structures in unstructured terrain.", "paper_summary_zh": "我們介紹 UnrealZoo，這是建立在 Unreal Engine 上的一系列豐富的寫實 3D 虛擬世界，旨在反映開放世界的複雜性和可變性。此外，我們還提供各種可玩實體，供具身 AI 代理使用。基於 UnrealCV，我們提供一系列易於使用的 Python API 和工具，適用於各種潛在應用，例如數據收集、環境擴充、分散式訓練和基準測試。我們最佳化 UnrealCV 的渲染和通訊效率，以支援進階應用，例如多重代理互動。我們的實驗在各種複雜場景中對代理進行基準測試，專注於視覺導航和追蹤，這是具身視覺智慧的基本能力。結果對強化學習 (RL) 代理的不同訓練環境的優勢以及當前具身視覺代理（包括基於 RL 和大型視覺語言模型 (VLM) 的代理）在開放世界中所面臨的挑戰，產生了有價值的見解。這些挑戰涉及動態場景中閉環控制的延遲，以及對非結構化地形中 3D 空間結構的推理。", "author": "Fangwei Zhong et.al.", "authors": "Fangwei Zhong, Kui Wu, Churan Wang, Hao Chen, Hai Ci, Zhoujun Li, Yizhou Wang", "id": "2412.20977v1", "paper_url": "http://arxiv.org/abs/2412.20977v1", "repo": "null"}}