{"2409.05863": {"publish_time": "2024-09-09", "title": "Promptable Closed-loop Traffic Simulation", "paper_summary": "Simulation stands as a cornerstone for safe and efficient autonomous driving\ndevelopment. At its core a simulation system ought to produce realistic,\nreactive, and controllable traffic patterns. In this paper, we propose ProSim,\na multimodal promptable closed-loop traffic simulation framework. ProSim allows\nthe user to give a complex set of numerical, categorical or textual prompts to\ninstruct each agent's behavior and intention. ProSim then rolls out a traffic\nscenario in a closed-loop manner, modeling each agent's interaction with other\ntraffic participants. Our experiments show that ProSim achieves high prompt\ncontrollability given different user prompts, while reaching competitive\nperformance on the Waymo Sim Agents Challenge when no prompt is given. To\nsupport research on promptable traffic simulation, we create\nProSim-Instruct-520k, a multimodal prompt-scenario paired driving dataset with\nover 10M text prompts for over 520k real-world driving scenarios. We will\nrelease code of ProSim as well as data and labeling tools of\nProSim-Instruct-520k at https://ariostgx.github.io/ProSim.", "paper_summary_zh": "模擬作為安全且有效率的自動駕駛開發的基石。模擬系統的核心在於產生逼真、具反應性且可控制的交通模式。在本文中，我們提出 ProSim，一個多模態可提示閉環交通模擬架構。ProSim 允許使用者提供一組複雜的數值、類別或文字提示，以指示每個代理的行為和意圖。然後，ProSim 以閉環方式推出交通場景，模擬每個代理與其他交通參與者的互動。我們的實驗顯示，在沒有提示的情況下，ProSim 在不同的使用者提示下實現了很高的提示可控性，同時在 Waymo Sim Agents Challenge 中達到了競爭力的表現。為了支持可提示交通模擬的研究，我們建立了 ProSim-Instruct-520k，一個多模態提示場景配對的駕駛資料集，其中包含超過 10M 個文字提示，適用於超過 520k 個真實世界的駕駛場景。我們將在 https://ariostgx.github.io/ProSim 上釋出 ProSim 的程式碼以及 ProSim-Instruct-520k 的資料和標籤工具。", "author": "Shuhan Tan et.al.", "authors": "Shuhan Tan, Boris Ivanovic, Yuxiao Chen, Boyi Li, Xinshuo Weng, Yulong Cao, Philipp Krähenbühl, Marco Pavone", "id": "2409.05863v1", "paper_url": "http://arxiv.org/abs/2409.05863v1", "repo": "null"}}