{"2407.13442": {"publish_time": "2024-07-18", "title": "BEAF: Observing BEfore-AFter Changes to Evaluate Hallucination in Vision-language Models", "paper_summary": "Vision language models (VLMs) perceive the world through a combination of a\nvisual encoder and a large language model (LLM). The visual encoder,\npre-trained on large-scale vision-text datasets, provides zero-shot\ngeneralization to visual data, and the LLM endows its high reasoning ability to\nVLMs. It leads VLMs to achieve high performance on wide benchmarks without\nfine-tuning, exhibiting zero or few-shot capability. However, recent studies\nshow that VLMs are vulnerable to hallucination. This undesirable behavior\ndegrades reliability and credibility, thereby making users unable to fully\ntrust the output from VLMs. To enhance trustworthiness and better tackle the\nhallucination of VLMs, we curate a new evaluation dataset, called the\nBEfore-AFter hallucination dataset (BEAF), and introduce new metrics: True\nUnderstanding (TU), IGnorance (IG), StuBbornness (SB), and InDecision (ID).\nUnlike prior works that focus only on constructing questions and answers, the\nkey idea of our benchmark is to manipulate visual scene information by image\nediting models and to design the metrics based on scene changes. This allows us\nto clearly assess whether VLMs correctly understand a given scene by observing\nthe ability to perceive changes. We also visualize image-wise object\nrelationship by virtue of our two-axis view: vision and text. Upon evaluating\nVLMs with our dataset, we observed that our metrics reveal different aspects of\nVLM hallucination that have not been reported before. Project page:\n\\url{https://beafbench.github.io/}", "paper_summary_zh": "<paragraph>視覺語言模型 (VLM) 透過視覺編碼器與大型語言模型 (LLM) 的組合來感知世界。視覺編碼器在大型視覺文字資料集上進行預訓練，提供零次學習泛化到視覺資料，而 LLM 則賦予 VLM 高推理能力。這使得 VLM 在廣泛基準上實現高性能，無需微調，展現零次或少量學習能力。然而，最近的研究顯示 VLM 容易出現幻覺。這種不良行為會降低可靠性和可信度，因此讓使用者無法完全信任 VLM 的輸出。為了提升可信度並更好地解決 VLM 的幻覺問題，我們策劃了一個新的評估資料集，稱為 BEfore-AFter 幻覺資料集 (BEAF)，並引入了新的指標：真實理解 (TU)、無知 (IG)、頑固 (SB) 和猶豫不決 (ID)。與先前僅專注於建構問題和答案的研究不同，我們的基準測試關鍵在於透過影像編輯模型來操縱視覺場景資訊，並根據場景變化來設計指標。這讓我們可以透過觀察感知變化的能力，清楚評估 VLM 是否正確理解給定的場景。我們也透過我們的雙軸視圖：視覺和文字，將影像中的物件關係視覺化。在使用我們的資料集評估 VLM 時，我們觀察到我們的指標揭露了 VLM 幻覺的不同面向，這些面向在過去未曾被報導過。專案頁面：\\url{https://beafbench.github.io/}</paragraph>", "author": "Moon Ye-Bin et.al.", "authors": "Moon Ye-Bin, Nam Hyeon-Woo, Wonseok Choi, Tae-Hyun Oh", "id": "2407.13442v1", "paper_url": "http://arxiv.org/abs/2407.13442v1", "repo": "null"}}