{"2409.15338": {"publish_time": "2024-09-09", "title": "Explainable AI: Definition and attributes of a good explanation for health AI", "paper_summary": "Proposals of artificial intelligence (AI) solutions based on increasingly\ncomplex and accurate predictive models are becoming ubiquitous across many\ndisciplines. As the complexity of these models grows, transparency and users'\nunderstanding often diminish. This suggests that accurate prediction alone is\ninsufficient for making an AI-based solution truly useful. In the development\nof healthcare systems, this introduces new issues related to accountability and\nsafety. Understanding how and why an AI system makes a recommendation may\nrequire complex explanations of its inner workings and reasoning processes.\nAlthough research on explainable AI (XAI) has significantly increased in recent\nyears and there is high demand for XAI in medicine, defining what constitutes a\ngood explanation remains ad hoc, and providing adequate explanations continues\nto be challenging. To fully realize the potential of AI, it is critical to\naddress two fundamental questions about explanations for safety-critical AI\napplications, such as health-AI: (1) What is an explanation in health-AI? and\n(2) What are the attributes of a good explanation in health-AI? In this study,\nwe examined published literature and gathered expert opinions through a\ntwo-round Delphi study. The research outputs include (1) a definition of what\nconstitutes an explanation in health-AI and (2) a comprehensive list of\nattributes that characterize a good explanation in health-AI.", "paper_summary_zh": "隨著越來越複雜且準確的預測模型，基於人工智慧 (AI) 解決方案的提案在許多領域中變得無處不在。隨著這些模型複雜性的增加，透明度和使用者的理解力往往會降低。這表示僅有準確的預測並不足以讓 AI 解決方案真正有用。在醫療保健系統的開發中，這引入了與問責制和安全性相關的新問題。瞭解 AI 系統如何以及為何提出建議可能需要對其內部運作和推理過程進行複雜的說明。儘管近年來對可解釋 AI (XAI) 的研究已大幅增加，且醫學領域對 XAI 有很高的需求，但定義什麼構成一個好的解釋仍是臨時性的，而提供適當的解釋仍然具有挑戰性。為了充分發揮 AI 的潛力，對於安全關鍵型 AI 應用（例如健康 AI）的解釋，探討兩個基本問題至關重要：(1) 什麼是健康 AI 中的解釋？以及 (2) 健康 AI 中一個好的解釋有哪些屬性？在本研究中，我們檢視了已發表的文獻，並透過兩輪德爾菲研究收集了專家意見。研究成果包括：(1) 健康 AI 中什麼構成解釋的定義，以及 (2) 健康 AI 中一個好解釋的屬性清單。", "author": "Evangelia Kyrimi et.al.", "authors": "Evangelia Kyrimi, Scott McLachlan, Jared M Wohlgemut, Zane B Perkins, David A. Lagnado, William Marsh, the ExAIDSS Expert Group", "id": "2409.15338v1", "paper_url": "http://arxiv.org/abs/2409.15338v1", "repo": "null"}}