{"2501.00830": {"publish_time": "2025-01-01", "title": "LLM+AL: Bridging Large Language Models and Action Languages for Complex Reasoning about Actions", "paper_summary": "Large Language Models (LLMs) have made significant strides in various\nintelligent tasks but still struggle with complex action reasoning tasks that\nrequire systematic search. To address this limitation, we propose a method that\nbridges the natural language understanding capabilities of LLMs with the\nsymbolic reasoning strengths of action languages. Our approach, termed\n\"LLM+AL,\" leverages the LLM's strengths in semantic parsing and commonsense\nknowledge generation alongside the action language's proficiency in automated\nreasoning based on encoded knowledge. We compare LLM+AL against\nstate-of-the-art LLMs, including ChatGPT-4, Claude 3 Opus, Gemini Ultra 1.0,\nand o1-preview, using benchmarks for complex reasoning about actions. Our\nfindings indicate that, although all methods exhibit errors, LLM+AL, with\nrelatively minimal human corrections, consistently leads to correct answers,\nwhereas standalone LLMs fail to improve even with human feedback. LLM+AL also\ncontributes to automated generation of action languages.", "paper_summary_zh": "大型語言模型 (LLM) 在各種智能任務上取得顯著進展，但仍難以應付需要系統性搜尋的複雜動作推理任務。為了解決這個限制，我們提出了一種方法，將 LLM 的自然語言理解能力與動作語言的符號推理優勢結合起來。我們的做法稱為「LLM+AL」，它利用 LLM 在語義解析和常識知識生成方面的優勢，以及動作語言在基於編碼知識的自動推理方面的能力。我們使用複雜動作推理基準，將 LLM+AL 與最先進的 LLM（包括 ChatGPT-4、Claude 3 Opus、Gemini Ultra 1.0 和 o1-preview）進行比較。我們的研究結果表明，儘管所有方法都會出現錯誤，但 LLM+AL 在相對最少的修正下，始終能得出正確答案，而獨立的 LLM 即使在有人類回饋的情況下也無法改善。LLM+AL 也能協助自動生成動作語言。", "author": "Adam Ishay et.al.", "authors": "Adam Ishay, Joohyung Lee", "id": "2501.00830v1", "paper_url": "http://arxiv.org/abs/2501.00830v1", "repo": "null"}}