{"2405.11464": {"publish_time": "2024-05-19", "title": "Efficient Prompt Tuning by Multi-Space Projection and Prompt Fusion", "paper_summary": "Prompt tuning is a promising method to fine-tune a pre-trained language model\nwithout retraining its large-scale parameters. Instead, it attaches a soft\nprompt to the input text, whereby downstream tasks can be well adapted by\nmerely learning the embeddings of prompt tokens. Nevertheless, existing methods\nstill suffer from two challenges: (i) they are hard to balance accuracy and\nefficiency. A longer (shorter) soft prompt generally leads to a better (worse)\naccuracy but at the cost of more (less) training time. (ii) The performance may\nnot be consistent when adapting to different downstream tasks. We attribute it\nto the same embedding space but responsible for different requirements of\ndownstream tasks. To address these issues, we propose an Efficient Prompt\nTuning method (EPT) by multi-space projection and prompt fusion. Specifically,\nit decomposes a given soft prompt into a shorter prompt and two low-rank\nmatrices, whereby the number of parameters is greatly reduced as well as the\ntraining time. The accuracy is also enhanced by leveraging low-rank matrices\nand the short prompt as additional knowledge sources to enrich the semantics of\nthe original short prompt. In addition, we project the soft prompt into\nmultiple subspaces to improve the performance consistency, and then adaptively\nlearn the combination weights of different spaces through a gating network.\nExperimental experiments on 13 natural language processing downstream tasks\nshow that our method significantly and consistently outperforms 11 comparison\nmethods with the relative percentage of improvements up to 28.8%, and training\ntime decreased by 14%.", "paper_summary_zh": "提示微调是一种很有前途的方法，可以微调预训练语言模型，而无需重新训练其大规模参数。相反，它将一个软提示附加到输入文本，从而可以通过仅仅学习提示标记的嵌入来很好地适应下游任务。然而，现有方法仍然面临两大挑战：(i) 难以平衡准确性和效率。较长（较短）的软提示通常会导致较好（较差）的准确性，但代价是训练时间更多（更少）。(ii) 在适应不同的下游任务时，性能可能不一致。我们将其归因于相同的嵌入空间，但负责不同的下游任务需求。为了解决这些问题，我们通过多空间投影和提示融合提出了一种高效提示微调方法 (EPT)。具体来说，它将给定的软提示分解为一个较短的提示和两个低秩矩阵，从而大大减少了参数的数量以及训练时间。通过利用低秩矩阵和短提示作为附加知识源来丰富原始短提示的语义，还可以提高准确性。此外，我们将软提示投影到多个子空间以提高性能一致性，然后通过门控网络自适应地学习不同空间的组合权重。在 13 个自然语言处理下游任务上的实验表明，我们的方法明显且持续地优于 11 种比较方法，相对改进百分比高达 28.8%，训练时间减少了 14%。", "author": "Pengxiang Lan et.al.", "authors": "Pengxiang Lan, Enneng Yang, Yuting Liu, Guibing Guo, Linying Jiang, Jianzhe Zhao, Xingwei Wang", "id": "2405.11464v1", "paper_url": "http://arxiv.org/abs/2405.11464v1", "repo": "null"}}