{"2410.21035": {"publish_time": "2024-10-28", "title": "Beyond Autoregression: Fast LLMs via Self-Distillation Through Time", "paper_summary": "Autoregressive (AR) Large Language Models (LLMs) have demonstrated\nsignificant success across numerous tasks. However, the AR modeling paradigm\npresents certain limitations; for instance, contemporary autoregressive LLMs\nare trained to generate one token at a time, which can result in noticeable\nlatency. Recent advances have indicated that search and repeated sampling can\nenhance performance in various applications, such as theorem proving, code\ngeneration, and alignment, by utilizing greater computational resources during\ninference. In this study, we demonstrate that diffusion language models are\ncapable of generating at least 32 tokens simultaneously, while exceeding the\nperformance of AR models in text quality and on the LAMBADA natural language\nunderstanding benchmark. This outcome is achieved through a novel distillation\nmethod for discrete diffusion models, which reduces the number of inference\nsteps by a factor of 32-64. Practically, our models, even without caching, can\ngenerate tokens at a rate that is up to 8 times faster than AR models employing\nKV caching, and we anticipate further improvements with the inclusion of\ncaching. Moreover, we demonstrate the efficacy of our approach for diffusion\nlanguage models with up to 860M parameters.", "paper_summary_zh": "自回归 (AR) 大型语言模型 (LLM) 已证明在众多任务中取得了显著成功。然而，AR 建模范式存在一定的局限性；例如，当代自回归 LLM 被训练一次生成一个标记，这会导致明显的延迟。最近的进展表明，搜索和重复采样可以通过在推理过程中利用更大的计算资源来提高各种应用程序（例如定理证明、代码生成和对齐）中的性能。在这项研究中，我们证明了扩散语言模型能够同时生成至少 32 个标记，同时在文本质量和 LAMBADA 自然语言理解基准上超过了 AR 模型的性能。这一成果是通过一种新颖的离散扩散模型蒸馏方法实现的，该方法将推理步骤的数量减少了 32-64 倍。实际上，即使不使用缓存，我们的模型也可以以比采用 KV 缓存的 AR 模型快 8 倍的速度生成标记，并且我们预计随着缓存的加入，性能将进一步提升。此外，我们展示了我们的方法对具有高达 8.6 亿个参数的扩散语言模型的有效性。", "author": "Justin Deschenaux et.al.", "authors": "Justin Deschenaux, Caglar Gulcehre", "id": "2410.21035v1", "paper_url": "http://arxiv.org/abs/2410.21035v1", "repo": "null"}}