{"2410.23726": {"publish_time": "2024-10-31", "title": "Towards Reliable Alignment: Uncertainty-aware RLHF", "paper_summary": "Recent advances in aligning Large Language Models with human preferences have\nbenefited from larger reward models and better preference data. However, most\nof these methodologies rely on the accuracy of the reward model. The reward\nmodels used in Reinforcement Learning with Human Feedback (RLHF) are typically\nlearned from small datasets using stochastic optimization algorithms, making\nthem prone to high variability. We illustrate the inconsistencies between\nreward models empirically on numerous open-source datasets.\n  We theoretically show that the fluctuation of the reward models can be\ndetrimental to the alignment problem because the derived policies are more\noverfitted to the reward model and, hence, are riskier if the reward model\nitself is uncertain. We use concentration of measure to motivate an\nuncertainty-aware, conservative algorithm for policy optimization. We show that\nsuch policies are more risk-averse in the sense that they are more cautious of\nuncertain rewards. We theoretically prove that our proposed methodology has\nless risk than the vanilla method.\n  We corroborate our theoretical results with experiments based on designing an\nensemble of reward models. We use this ensemble of reward models to align a\nlanguage model using our methodology and observe that our empirical findings\nmatch our theoretical predictions.", "paper_summary_zh": "近來，將大型語言模型與人類偏好相結合的進展受益於更大的獎勵模型和更好的偏好數據。然而，這些方法大多依賴於獎勵模型的準確性。在人類回饋強化學習 (RLHF) 中使用的獎勵模型通常是使用隨機優化演算法從小型資料集學習而得，這使得它們容易產生高度變異性。我們在許多開源資料集上根據經驗說明了獎勵模型之間的不一致性。\n我們在理論上表明，獎勵模型的波動可能對校準問題有害，因為衍生的政策更過度擬合獎勵模型，因此，如果獎勵模型本身不確定，則風險更高。我們使用測度集中來激勵一種具有不確定性感知的保守政策優化演算法。我們表明，此類政策在風險規避方面更為有效，因為它們對不確定的獎勵更為謹慎。我們在理論上證明，我們提出的方法比香草方法風險更低。\n我們使用基於設計獎勵模型的集合的實驗來證實我們的理論結果。我們使用這個獎勵模型的集合來使用我們的方法校準語言模型，並觀察到我們的經驗發現與我們的理論預測相符。", "author": "Debangshu Banerjee et.al.", "authors": "Debangshu Banerjee, Aditya Gopalan", "id": "2410.23726v1", "paper_url": "http://arxiv.org/abs/2410.23726v1", "repo": "null"}}