{"2503.01814": {"publish_time": "2025-03-03", "title": "LLMInit: A Free Lunch from Large Language Models for Selective Initialization of Recommendation", "paper_summary": "Collaborative filtering models, particularly graph-based approaches, have\ndemonstrated strong performance in capturing user-item interactions for\nrecommendation systems. However, they continue to struggle in cold-start and\ndata-sparse scenarios. The emergence of large language models (LLMs) like GPT\nand LLaMA presents new possibilities for enhancing recommendation performance,\nespecially in cold-start settings. Despite their promise, LLMs pose challenges\nrelated to scalability and efficiency due to their high computational demands\nand limited ability to model complex user-item relationships effectively. In\nthis work, we introduce a novel perspective on leveraging LLMs for CF model\ninitialization. Through experiments, we uncover an embedding collapse issue\nwhen scaling CF models to larger embedding dimensions. To effectively harness\nlarge-scale LLM embeddings, we propose innovative selective initialization\nstrategies utilizing random, uniform, and variance-based index sampling. Our\ncomprehensive evaluation on multiple real-world datasets demonstrates\nsignificant performance gains across various CF models while maintaining a\nlower computational cost compared to existing LLM-based recommendation\napproaches.", "paper_summary_zh": "<paragraph>協同過濾模型，尤其是基於圖形的方法，在捕捉推薦系統中使用者與商品的互動方面展現了強大的效能。然而，它們在冷啟動和數據稀疏的情況下仍然表現不佳。像 GPT 和 LLaMA 這樣的大型語言模型 (LLM) 的出現，為提升推薦效能，尤其是在冷啟動環境中，提供了新的可能性。儘管前景看好，但由於 LLM 高昂的計算需求和有效建模複雜使用者與商品關係的能力有限，它們在可擴展性和效率方面仍面臨挑戰。在這項工作中，我們引入了一個利用 LLM 進行 CF 模型初始化的新穎視角。透過實驗，我們發現了將 CF 模型縮放到更大的嵌入維度時出現的嵌入崩潰問題。為了有效利用大規模 LLM 嵌入，我們提出了創新的選擇性初始化策略，利用隨機、均勻和基於方差的索引採樣。我們在多個真實世界數據集上的綜合評估表明，與現有的基於 LLM 的推薦方法相比，各種 CF 模型的效能都得到了顯著提升，同時保持了較低的計算成本。</paragraph>\n", "author": "Weizhi Zhang et.al.", "authors": "Weizhi Zhang, Liangwei Yang, Wooseong Yang, Henry Peng Zou, Yuqing Liu, Ke Xu, Sourav Medya, Philip S. Yu", "id": "2503.01814v1", "paper_url": "http://arxiv.org/abs/2503.01814v1", "repo": "null"}}