{"2412.03074": {"publish_time": "2024-12-04", "title": "Analytic Study of Text-Free Speech Synthesis for Raw Audio using a Self-Supervised Learning Model", "paper_summary": "We examine the text-free speech representations of raw audio obtained from a\nself-supervised learning (SSL) model by analyzing the synthesized speech using\nthe SSL representations instead of conventional text representations. Since raw\naudio does not have paired speech representations as transcribed texts do,\nobtaining speech representations from unpaired speech is crucial for augmenting\navailable datasets for speech synthesis. Specifically, the proposed speech\nsynthesis is conducted using discrete symbol representations from the SSL model\nin comparison with text representations, and analytical examinations of the\nsynthesized speech have been carried out. The results empirically show that\nusing text representations is advantageous for preserving semantic information,\nwhile using discrete symbol representations is superior for preserving acoustic\ncontent, including prosodic and intonational information.", "paper_summary_zh": "我們透過分析合成語音，使用 SSL 表示法而非傳統文字表示法，來檢視從自監督式學習 (SSL) 模型取得的無文字語音表示法。由於原始音訊沒有像轉錄文字那樣的配對語音表示法，因此從未配對的語音中取得語音表示法對於擴充語音合成的可用資料集至關重要。具體來說，建議的語音合成是使用來自 SSL 模型的離散符號表示法，並與文字表示法進行比較，並對合成語音進行分析檢視。結果經驗性地顯示，使用文字表示法有利於保留語意資訊，而使用離散符號表示法則優於保留音響內容，包括韻律和語調資訊。", "author": "Joonyong Park et.al.", "authors": "Joonyong Park, Daisuke Saito, Nobuaki Minematsu", "id": "2412.03074v1", "paper_url": "http://arxiv.org/abs/2412.03074v1", "repo": "null"}}