{"2502.15348": {"publish_time": "2025-02-21", "title": "Constructing a Norm for Children's Scientific Drawing: Distribution Features Based on Semantic Similarity of Large Language Models", "paper_summary": "The use of children's drawings to examining their conceptual understanding\nhas been proven to be an effective method, but there are two major problems\nwith previous research: 1. The content of the drawings heavily relies on the\ntask, and the ecological validity of the conclusions is low; 2. The\ninterpretation of drawings relies too much on the subjective feelings of the\nresearchers. To address this issue, this study uses the Large Language Model\n(LLM) to identify 1420 children's scientific drawings (covering 9 scientific\nthemes/concepts), and uses the word2vec algorithm to calculate their semantic\nsimilarity. The study explores whether there are consistent drawing\nrepresentations for children on the same theme, and attempts to establish a\nnorm for children's scientific drawings, providing a baseline reference for\nfollow-up children's drawing research. The results show that the representation\nof most drawings has consistency, manifested as most semantic similarity\ngreater than 0.8. At the same time, it was found that the consistency of the\nrepresentation is independent of the accuracy (of LLM's recognition),\nindicating the existence of consistency bias. In the subsequent exploration of\ninfluencing factors, we used Kendall rank correlation coefficient to\ninvestigate the effects of Sample Size, Abstract Degree, and Focus Points on\ndrawings, and used word frequency statistics to explore whether children\nrepresented abstract themes/concepts by reproducing what was taught in class.", "paper_summary_zh": "<paragraph>使用兒童繪畫來檢視其概念理解已被證實是一種有效的方法，但先前的研究有兩個主要問題：1. 繪畫的內容過於依賴於任務，而結論的生態效度低；2. 對繪畫的詮釋過於依賴研究者的主觀感受。為了解決這個問題，本研究使用大型語言模型 (LLM) 來識別 1420 幅兒童科學繪畫（涵蓋 9 個科學主題/概念），並使用 word2vec 演算法計算它們的語義相似性。本研究探討是否兒童在同一主題上有具有一致性的繪畫表徵，並試圖為兒童科學繪畫建立一個規範，為後續兒童繪畫研究提供一個基準參考。結果表明，大多數繪畫的表徵具有相容性，表現為大多數語義相似度大於 0.8。同時發現，表徵的一致性與準確性（LLM 的識別）無關，表明存在一致性偏差。在後續的影響因素探討中，我們使用 Kendall 等級相關係數來探討樣本量、抽象程度和焦點點對繪畫的影響，並使用詞頻統計來探討兒童是否通過重現課堂上所教的內容來表徵抽象的主題/概念。</paragraph>", "author": "Yi Zhang et.al.", "authors": "Yi Zhang, Fan Wei, Jingyi Li, Yan Wang, Yanyan Yu, Jianli Chen, Zipo Cai, Xinyu Liu, Wei Wang, Peng Wang, Zhong Wang", "id": "2502.15348v1", "paper_url": "http://arxiv.org/abs/2502.15348v1", "repo": "null"}}