{"2406.02040": {"publish_time": "2024-06-04", "title": "DFA-GNN: Forward Learning of Graph Neural Networks by Direct Feedback Alignment", "paper_summary": "Graph neural networks are recognized for their strong performance across\nvarious applications, with the backpropagation algorithm playing a central role\nin the development of most GNN models. However, despite its effectiveness, BP\nhas limitations that challenge its biological plausibility and affect the\nefficiency, scalability and parallelism of training neural networks for\ngraph-based tasks. While several non-BP training algorithms, such as the direct\nfeedback alignment, have been successfully applied to fully-connected and\nconvolutional network components for handling Euclidean data, directly adapting\nthese non-BP frameworks to manage non-Euclidean graph data in GNN models\npresents significant challenges. These challenges primarily arise from the\nviolation of the i.i.d. assumption in graph data and the difficulty in\naccessing prediction errors for all samples (nodes) within the graph. To\novercome these obstacles, in this paper we propose DFA-GNN, a novel forward\nlearning framework tailored for GNNs with a case study of semi-supervised\nlearning. The proposed method breaks the limitations of BP by using a dedicated\nforward training mechanism. Specifically, DFA-GNN extends the principles of DFA\nto adapt to graph data and unique architecture of GNNs, which incorporates the\ninformation of graph topology into the feedback links to accommodate the\nnon-Euclidean characteristics of graph data. Additionally, for semi-supervised\ngraph learning tasks, we developed a pseudo error generator that spreads\nresidual errors from training data to create a pseudo error for each unlabeled\nnode. These pseudo errors are then utilized to train GNNs using DFA. Extensive\nexperiments on 10 public benchmarks reveal that our learning framework\noutperforms not only previous non-BP methods but also the standard BP methods,\nand it exhibits excellent robustness against various types of noise and\nattacks.", "paper_summary_zh": "圖神經網路因其在各種應用中的強勁表現而受到認可，其中反向傳播演算法在大部分 GNN 模型的開發中扮演著核心角色。然而，儘管其有效性，BP 仍有其限制，這挑戰了其生物學合理性，並影響了訓練神經網路以執行基於圖形的任務的效率、可擴充性和並行性。儘管幾種非 BP 訓練演算法，例如直接回饋對齊，已成功應用於處理歐幾里得資料的全連接和卷積網路元件，但將這些非 BP 框架直接調整為在 GNN 模型中管理非歐幾里得圖形資料會帶來重大的挑戰。這些挑戰主要是源於違反圖形資料中的 i.i.d. 假設，以及難以存取圖形中所有樣本（節點）的預測誤差。為了克服這些障礙，我們在本文中提出了 DFA-GNN，這是一個針對 GNN 量身打造的新穎前向學習框架，並以半監督式學習的案例研究為例。所提出的方法透過使用專用的前向訓練機制來突破 BP 的限制。具體來說，DFA-GNN 將 DFA 的原理延伸到圖形資料和 GNN 的獨特架構，將圖形拓撲的資訊納入回饋連結中，以適應圖形資料的非歐幾里得特性。此外，對於半監督式圖形學習任務，我們開發了一個偽誤差產生器，將訓練資料的殘差誤差散佈到各個未標記節點，為每個節點建立一個偽誤差。然後利用這些偽誤差使用 DFA 訓練 GNN。在 10 個公開基準上的廣泛實驗顯示，我們的學習框架不僅優於先前的非 BP 方法，也優於標準的 BP 方法，並且對各種雜訊和攻擊類型表現出極佳的穩健性。", "author": "Gongpei Zhao et.al.", "authors": "Gongpei Zhao, Tao Wang, Congyan Lang, Yi Jin, Yidong Li, Haibin Ling", "id": "2406.02040v1", "paper_url": "http://arxiv.org/abs/2406.02040v1", "repo": "null"}}