{"2410.03663": {"publish_time": "2024-10-04", "title": "Enhance Reasoning by Learning from Mistakes: Peer-Review Knowledge Distillation from Multiple Large Language Models", "paper_summary": "Large language models (LLMs) have exhibited complex reasoning abilities by\ngenerating question rationales and demonstrated exceptional performance in\nnatural language processing (NLP) tasks. However, these reasoning capabilities\ngenerally emerge in models with tens of billions of parameters, creating\nsignificant computational challenges for real-world deployment. Recent research\nhas concentrated on improving open-source smaller models through knowledge\ndistillation (KD) from commercial LLMs. Nevertheless, most of these studies\nrely solely on the responses from one single LLM as the gold rationale for\ntraining. In this paper, we introduce a novel Mistake-Aware Peer-Review\nDistillation (MAPD) approach: 1) Instead of merely obtaining gold rationales\nfrom teachers, our method asks teachers to identify and explain the student's\nmistakes, providing customized instruction learning data. 2) We design a\nsimulated peer-review process between teacher LLMs, which selects only the\ngenerated rationales above the acceptance threshold. This reduces the chance of\nteachers guessing correctly with flawed rationale, improving instructional data\nquality. Comprehensive experiments and analysis on mathematical, commonsense,\nand logical reasoning tasks demonstrate the effectiveness of our method.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出複雜的推理能力，可產生問題依據，並在自然語言處理 (NLP) 任務中展現出色的效能。然而，這些推理能力通常出現在數十億個參數的模型中，為實際部署創造了重大的運算挑戰。最近的研究集中於透過商業 LLM 的知識提煉 (KD) 來改善開源的小型模型。儘管如此，這些研究大多僅依賴單一 LLM 的回應作為訓練的黃金依據。在本文中，我們介紹了一種新穎的錯誤感知同儕審查提煉 (MAPD) 方法：1) 我們的模型並非僅從教師那裡取得黃金依據，而是要求教師找出並說明學生的錯誤，提供客製化的教學學習資料。2) 我們設計了一個在教師 LLM 之間模擬的同儕審查流程，僅選擇高於接受門檻的產生依據。這降低了教師以有缺陷的依據正確猜測的機率，並改善了教學資料的品質。在數學、常識和邏輯推理任務上的全面實驗和分析證明了我們方法的有效性。", "author": "Zhuochun Li et.al.", "authors": "Zhuochun Li, Yuelyu Ji, Rui Meng, Daqing He", "id": "2410.03663v1", "paper_url": "http://arxiv.org/abs/2410.03663v1", "repo": "null"}}