{"2409.06957": {"publish_time": "2024-09-11", "title": "Policy Filtration in RLHF to Fine-Tune LLM for Code Generation", "paper_summary": "Reinforcement learning from human feedback (RLHF) is one of the key\ntechniques that helps large language models (LLMs) to follow instructions and\nprovide helpful and harmless responses. While direct policy optimization\nmethods exist, state-of-the-art LLMs adopt RL-based methods (usually PPO) in\nRLHF to train the policy to generate good responses guided by a reward model\nlearned from preference data. The main challenge of these methods is the\ninaccuracy of the intermediate reward model, especially in code generation\ntasks that require long and complex reasoning to score a response. We find that\nthe reliability of the reward model varies across responses assigned with\ndifferent rewards. This motivates us to filter the samples whose rewards may be\nunreliable to improve signal-to-noise ratio during policy learning, resulting\nin Policy Filtration for Proximal Policy Optimization (PF-PPO). To choose a\nproper policy filtration strategy for a given reward model, the coefficient of\ndetermination ($R^2$) between rewards and actual scores on filtered samples\nserves as a good metrics and helps us find several promising strategies. We\nprovide extensive experiments to validate the effectiveness of PF-PPO in code\ngeneration tasks, and find that some variants of PF-PPO are highly effective\nand achieve new state-of-the-art performance across 7-billion-parameter models\non HumanEval, MBPP, and a new and more challenging LeetCode Contest benchmark.", "paper_summary_zh": "人類回饋中的強化學習 (RLHF) 是幫助大型語言模型 (LLM) 遵循指示並提供有益且無害回應的主要技術之一。雖然存在直接策略最佳化方法，但最先進的 LLM 在 RLHF 中採用基於 RL 的方法（通常為 PPO），以訓練策略根據從偏好數據中學習到的獎勵模型來產生良好的回應。這些方法的主要挑戰是中間獎勵模型的不準確性，特別是在需要長時間且複雜的推理才能為回應評分的程式碼生成任務中。我們發現獎勵模型的可靠性因分配不同獎勵的回應而異。這促使我們過濾掉獎勵可能不可靠的樣本，以提高策略學習期間的信噪比，從而產生用於近端策略最佳化的策略過濾 (PF-PPO)。為了針對給定的獎勵模型選擇適當的策略過濾策略，過濾樣本上獎勵與實際分數之間的決定係數 ($R^2$) 可作為良好的指標，並幫助我們找到幾種有前途的策略。我們提供了大量的實驗來驗證 PF-PPO 在程式碼生成任務中的有效性，並發現 PF-PPO 的一些變體非常有效，並且在 HumanEval、MBPP 和一個新的、更具挑戰性的 LeetCode 競賽基準測試中，在 70 億個參數模型上實現了新的最先進效能。", "author": "Wei Shen et.al.", "authors": "Wei Shen, Chuheng Zhang", "id": "2409.06957v1", "paper_url": "http://arxiv.org/abs/2409.06957v1", "repo": "https://github.com/swtheing/pf-ppo-rlhf"}}