{"2407.07726": {"publish_time": "2024-07-10", "title": "PaliGemma: A versatile 3B VLM for transfer", "paper_summary": "PaliGemma is an open Vision-Language Model (VLM) that is based on the\nSigLIP-So400m vision encoder and the Gemma-2B language model. It is trained to\nbe a versatile and broadly knowledgeable base model that is effective to\ntransfer. It achieves strong performance on a wide variety of open-world tasks.\nWe evaluate PaliGemma on almost 40 diverse tasks including standard VLM\nbenchmarks, but also more specialized tasks such as remote-sensing and\nsegmentation.", "paper_summary_zh": "PaliGemma 是一種開放的視覺語言模型 (VLM)，它基於 SigLIP-So400m 視覺編碼器和 Gemma-2B 語言模型。它的訓練目標是成為一個通用且知識淵博的基本模型，能夠有效轉移。它在廣泛的開放世界任務中都取得了強勁的表現。我們在近 40 項不同的任務中評估 PaliGemma，包括標準 VLM 基準，以及更專業的任務，例如遙感和分割。", "author": "Lucas Beyer et.al.", "authors": "Lucas Beyer, Andreas Steiner, André Susano Pinto, Alexander Kolesnikov, Xiao Wang, Daniel Salz, Maxim Neumann, Ibrahim Alabdulmohsin, Michael Tschannen, Emanuele Bugliarello, Thomas Unterthiner, Daniel Keysers, Skanda Koppula, Fangyu Liu, Adam Grycner, Alexey Gritsenko, Neil Houlsby, Manoj Kumar, Keran Rong, Julian Eisenschlos, Rishabh Kabra, Matthias Bauer, Matko Bošnjak, Xi Chen, Matthias Minderer, Paul Voigtlaender, Ioana Bica, Ivana Balazevic, Joan Puigcerver, Pinelopi Papalampidi, Olivier Henaff, Xi Xiong, Radu Soricut, Jeremiah Harmsen, Xiaohua Zhai", "id": "2407.07726v1", "paper_url": "http://arxiv.org/abs/2407.07726v1", "repo": "null"}}