{"2406.02927": {"publish_time": "2024-06-05", "title": "Multivariate Physics-Informed Convolutional Autoencoder for Anomaly Detection in Power Distribution Systems with High Penetration of DERs", "paper_summary": "Despite the relentless progress of deep learning models in analyzing the\nsystem conditions under cyber-physical events, their abilities are limited in\nthe power system domain due to data availability issues, cost of data\nacquisition, and lack of interpretation and extrapolation for the data beyond\nthe training windows. In addition, the integration of distributed energy\nresources (DERs) such as wind and solar generations increases the complexities\nand nonlinear nature of power systems. Therefore, an interpretable and reliable\nmethodology is of utmost need to increase the confidence of power system\noperators and their situational awareness for making reliable decisions. This\nhas led to the development of physics-informed neural network (PINN) models as\nmore interpretable, trustworthy, and robust models where the underlying\nprincipled laws are integrated into the training process of neural network\nmodels to achieve improved performance. This paper proposes a multivariate\nphysics-informed convolutional autoencoder (PIConvAE) model to detect cyber\nanomalies in power distribution systems with unbalanced configurations and high\npenetration of DERs. The physical laws are integrated through a customized loss\nfunction that embeds the underlying Kirchhoff's circuit laws into the training\nprocess of the autoencoder. The performance of the multivariate PIConvAE model\nis evaluated on two unbalanced power distribution grids, IEEE 123-bus system\nand a real-world feeder in Riverside, CA. The results show the exceptional\nperformance of the proposed method in detecting various cyber anomalies in both\nsystems. In addition, the model's effectiveness is evaluated in data scarcity\nscenarios with different training data ratios. Finally, the model's performance\nis compared with existing machine learning models where the PIConvAE model\nsurpasses other models with considerably higher detection metrics.", "paper_summary_zh": "儘管深度學習模型在分析網路實體事件下的系統條件方面不斷進步，但由於資料取得問題、資料取得成本、以及訓練視窗外資料的詮釋和外推不足，其能力在電力系統領域受到限制。此外，風能和太陽能發電等分散式能源 (DER) 的整合增加了電力系統的複雜性和非線性性質。因此，迫切需要一種可解釋且可靠的方法來提升電力系統操作員的信心，並提高其情境意識以做出可靠的決策。這導致物理訊息神經網路 (PINN) 模型的發展，作為更具可解釋性、可信度和穩健性的模型，其中基本定律原則被整合到神經網路模型的訓練過程中以提升效能。本文提出一個多變量物理訊息卷積自動編碼器 (PIConvAE) 模型，以偵測具有不平衡組態和高 DER 滲透率的配電系統中的網路異常。物理定律透過一個自訂損失函數整合，將基礎的基爾霍夫電路定律嵌入自動編碼器的訓練過程中。多變量 PIConvAE 模型的效能評估於兩個不平衡配電電網，IEEE 123-bus 系統和加州河濱市的一個實際饋線。結果顯示所提出的方法在偵測兩個系統中的各種網路異常方面具有傑出的效能。此外，該模型的有效性在具有不同訓練資料比率的資料稀少情況下得到評估。最後，將該模型的效能與現有的機器學習模型進行比較，其中 PIConvAE 模型超越其他模型，具有顯著更高的偵測指標。", "author": "Mehdi Jabbari Zideh et.al.", "authors": "Mehdi Jabbari Zideh, Sarika Khushalani Solanki", "id": "2406.02927v1", "paper_url": "http://arxiv.org/abs/2406.02927v1", "repo": "null"}}