{"2503.10622": {"publish_time": "2025-03-13", "title": "Transformers without Normalization", "paper_summary": "Normalization layers are ubiquitous in modern neural networks and have long\nbeen considered essential. This work demonstrates that Transformers without\nnormalization can achieve the same or better performance using a remarkably\nsimple technique. We introduce Dynamic Tanh (DyT), an element-wise operation\n$DyT($x$) = \\tanh(\\alpha $x$)$, as a drop-in replacement for normalization\nlayers in Transformers. DyT is inspired by the observation that layer\nnormalization in Transformers often produces tanh-like, $S$-shaped input-output\nmappings. By incorporating DyT, Transformers without normalization can match or\nexceed the performance of their normalized counterparts, mostly without\nhyperparameter tuning. We validate the effectiveness of Transformers with DyT\nacross diverse settings, ranging from recognition to generation, supervised to\nself-supervised learning, and computer vision to language models. These\nfindings challenge the conventional understanding that normalization layers are\nindispensable in modern neural networks, and offer new insights into their role\nin deep networks.", "paper_summary_zh": "<paragraph>正規化層在現代神經網路中無處不在，長期以來一直被認為是不可或缺的。這項工作證明了沒有正規化的 Transformer 可以使用一種非常簡單的技術達到相同或更好的效能。我們引入了動態 Tanh (DyT)，一種元素操作$DyT($x$) = \\tanh(\\alpha $x$)，作為 Transformer 中正規化層的替代品。DyT 的靈感來自於 Transformer 中的層正規化通常會產生類似 tanh 的 S 形輸入輸出映射的觀察。通過結合 DyT，沒有正規化的 Transformer 可以達到或超過其正規化模型的效能，而且大多數情況下無需調整超參數。我們驗證了在各種設定下使用 DyT 的 Transformer 的有效性，範圍從識別到生成、監督式學習到自監督式學習，以及電腦視覺到語言模型。這些發現挑戰了正規化層在現代神經網路中不可或缺的傳統理解，並為它們在深度網路中的作用提供了新的見解。</paragraph>\n", "author": "Jiachen Zhu et.al.", "authors": "Jiachen Zhu, Xinlei Chen, Kaiming He, Yann LeCun, Zhuang Liu", "id": "2503.10622v1", "paper_url": "http://arxiv.org/abs/2503.10622v1", "repo": "null"}}