{"2407.02397": {"publish_time": "2024-07-02", "title": "Learning to Refine with Fine-Grained Natural Language Feedback", "paper_summary": "Recent work has explored the capability of large language models (LLMs) to\nidentify and correct errors in LLM-generated responses. These refinement\napproaches frequently evaluate what sizes of models are able to do refinement\nfor what problems, but less attention is paid to what effective feedback for\nrefinement looks like. In this work, we propose looking at refinement with\nfeedback as a composition of three distinct LLM competencies: (1)\nidentification of bad generations; (2) fine-grained natural language feedback\ngeneration; (3) refining with fine-grained feedback. The first step can be\nimplemented with a high-performing discriminative model and steps 2 and 3 can\nbe implemented either via prompted or fine-tuned LLMs. A key property of this\napproach is that the step 2 critique model can give fine-grained feedback about\nerrors, made possible by offloading the discrimination to a separate model in\nstep 1. We show that models of different capabilities benefit from refining\nwith this approach on the task of improving factual consistency of document\ngrounded summaries. Overall, our proposed method consistently outperforms\nexisting end-to-end refinement approaches and current trained models not\nfine-tuned for factuality critiquing.", "paper_summary_zh": "最近的研究探讨了大型语言模型 (LLM) 识别和更正 LLM 生成的响应中错误的能力。这些优化方法经常评估什么规模的模型能够对什么问题进行优化，但较少关注有效的优化反馈是什么样的。在这项工作中，我们建议将优化与反馈视为三个不同的 LLM 能力的组合：(1) 识别不良生成；(2) 细粒度的自然语言反馈生成；(3) 使用细粒度反馈进行优化。第一步可以通过高性能判别模型来实现，步骤 2 和 3 可以通过提示或微调 LLM 来实现。这种方法的一个关键特性是第 2 步的批判模型可以提供关于错误的细粒度反馈，这可以通过在第 1 步将判别卸载到一个单独的模型来实现。我们表明，不同能力的模型受益于使用这种方法来优化改进文档基础摘要的事实一致性的任务。总体而言，我们提出的方法始终优于现有的端到端优化方法和当前未针对事实性批判进行微调的训练模型。", "author": "Manya Wadhwa et.al.", "authors": "Manya Wadhwa, Xinyu Zhao, Junyi Jessy Li, Greg Durrett", "id": "2407.02397v1", "paper_url": "http://arxiv.org/abs/2407.02397v1", "repo": "https://github.com/manyawadhwa/dcr"}}