{"2501.03200": {"publish_time": "2025-01-06", "title": "The FACTS Grounding Leaderboard: Benchmarking LLMs' Ability to Ground Responses to Long-Form Input", "paper_summary": "We introduce FACTS Grounding, an online leaderboard and associated benchmark\nthat evaluates language models' ability to generate text that is factually\naccurate with respect to given context in the user prompt. In our benchmark,\neach prompt includes a user request and a full document, with a maximum length\nof 32k tokens, requiring long-form responses. The long-form responses are\nrequired to be fully grounded in the provided context document while fulfilling\nthe user request. Models are evaluated using automated judge models in two\nphases: (1) responses are disqualified if they do not fulfill the user request;\n(2) they are judged as accurate if the response is fully grounded in the\nprovided document. The automated judge models were comprehensively evaluated\nagainst a held-out test-set to pick the best prompt template, and the final\nfactuality score is an aggregate of multiple judge models to mitigate\nevaluation bias. The FACTS Grounding leaderboard will be actively maintained\nover time, and contains both public and private splits to allow for external\nparticipation while guarding the integrity of the leaderboard. It can be found\nat https://www.kaggle.com/facts-leaderboard.", "paper_summary_zh": "我們引入了 FACTS Grounding，這是一個線上排行榜和相關基準，用於評估語言模型根據使用者提示中提供的背景，產生事實上準確的文本的能力。在我們的基準中，每個提示都包含一個使用者請求和一個完整文件，最大長度為 32k 個符號，需要長篇回應。長篇回應必須完全建立在提供的背景文件中，同時滿足使用者的請求。模型使用自動評分模型在兩個階段進行評估：(1) 如果回應不滿足使用者的請求，則取消資格；(2) 如果回應完全建立在提供的文件中，則判斷為準確。自動評分模型根據保留的測試集進行全面評估，以選擇最佳提示範本，最終的事實分數是多個評分模型的總和，以減輕評估偏差。FACTS Grounding 排行榜將隨著時間積極維護，並包含公開和私人拆分，以允許外部參與，同時保護排行榜的完整性。它可以在 https://www.kaggle.com/facts-leaderboard 找到。", "author": "Alon Jacovi et.al.", "authors": "Alon Jacovi, Andrew Wang, Chris Alberti, Connie Tao, Jon Lipovetz, Kate Olszewska, Lukas Haas, Michelle Liu, Nate Keating, Adam Bloniarz, Carl Saroufim, Corey Fry, Dror Marcus, Doron Kukliansky, Gaurav Singh Tomar, James Swirhun, Jinwei Xing, Lily Wang, Madhu Gurumurthy, Michael Aaron, Moran Ambar, Rachana Fellinger, Rui Wang, Zizhao Zhang, Sasha Goldshtein, Dipanjan Das", "id": "2501.03200v1", "paper_url": "http://arxiv.org/abs/2501.03200v1", "repo": "null"}}