{"2408.10053": {"publish_time": "2024-08-19", "title": "Privacy Checklist: Privacy Violation Detection Grounding on Contextual Integrity Theory", "paper_summary": "Privacy research has attracted wide attention as individuals worry that their\nprivate data can be easily leaked during interactions with smart devices,\nsocial platforms, and AI applications. Computer science researchers, on the\nother hand, commonly study privacy issues through privacy attacks and defenses\non segmented fields. Privacy research is conducted on various sub-fields,\nincluding Computer Vision (CV), Natural Language Processing (NLP), and Computer\nNetworks. Within each field, privacy has its own formulation. Though pioneering\nworks on attacks and defenses reveal sensitive privacy issues, they are\nnarrowly trapped and cannot fully cover people's actual privacy concerns.\nConsequently, the research on general and human-centric privacy research\nremains rather unexplored. In this paper, we formulate the privacy issue as a\nreasoning problem rather than simple pattern matching. We ground on the\nContextual Integrity (CI) theory which posits that people's perceptions of\nprivacy are highly correlated with the corresponding social context. Based on\nsuch an assumption, we develop the first comprehensive checklist that covers\nsocial identities, private attributes, and existing privacy regulations. Unlike\nprior works on CI that either cover limited expert annotated norms or model\nincomplete social context, our proposed privacy checklist uses the whole Health\nInsurance Portability and Accountability Act of 1996 (HIPAA) as an example, to\nshow that we can resort to large language models (LLMs) to completely cover the\nHIPAA's regulations. Additionally, our checklist also gathers expert\nannotations across multiple ontologies to determine private information\nincluding but not limited to personally identifiable information (PII). We use\nour preliminary results on the HIPAA to shed light on future context-centric\nprivacy research to cover more privacy regulations, social norms and standards.", "paper_summary_zh": "隱私研究備受關注，因為個人擔心在與智慧裝置、社群平台和 AI 應用程式互動時，他們的私人資料可能會輕易外洩。另一方面，電腦科學研究人員通常透過分段領域的隱私攻擊和防禦來研究隱私問題。隱私研究涵蓋各種子領域，包括電腦視覺 (CV)、自然語言處理 (NLP) 和電腦網路。在每個領域中，隱私都有其自身的表述。儘管關於攻擊和防禦的開創性研究揭示了敏感的隱私問題，但它們卻受到嚴格限制，無法完全涵蓋人們的實際隱私問題。因此，關於一般且以人為中心的隱私研究仍未被充分探討。在本文中，我們將隱私問題表述為一個推理問題，而不是簡單的模式配對。我們以情境完整性 (CI) 理論為基礎，該理論假設人們對隱私的看法與對應的社會背景高度相關。基於這樣的假設，我們制定了第一份全面的清單，涵蓋社會身分、私人屬性和現有隱私法規。與先前僅涵蓋有限的專家註解規範或模擬不完整社會背景的 CI 研究不同，我們提出的隱私清單使用 1996 年健保可攜性和責任法案 (HIPAA) 作為範例，以表明我們可以採用大型語言模型 (LLM) 來完全涵蓋 HIPAA 的法規。此外，我們的清單還收集了跨多個本体的多位專家註解，以確定私人資訊，包括但不限於個人可辨識資訊 (PII)。我們使用我們在 HIPAA 上的初步結果，為未來的以情境為中心的隱私研究提供啟示，以涵蓋更多的隱私法規、社會規範和標準。", "author": "Haoran Li et.al.", "authors": "Haoran Li, Wei Fan, Yulin Chen, Jiayang Cheng, Tianshu Chu, Xuebing Zhou, Peizhao Hu, Yangqiu Song", "id": "2408.10053v1", "paper_url": "http://arxiv.org/abs/2408.10053v1", "repo": "null"}}