{"2412.07743": {"publish_time": "2024-12-10", "title": "Zero-Shot ATC Coding with Large Language Models for Clinical Assessments", "paper_summary": "Manual assignment of Anatomical Therapeutic Chemical (ATC) codes to\nprescription records is a significant bottleneck in healthcare research and\noperations at Ontario Health and InterRAI Canada, requiring extensive expert\ntime and effort. To automate this process while maintaining data privacy, we\ndevelop a practical approach using locally deployable large language models\n(LLMs). Inspired by recent advances in automatic International Classification\nof Diseases (ICD) coding, our method frames ATC coding as a hierarchical\ninformation extraction task, guiding LLMs through the ATC ontology level by\nlevel. We evaluate our approach using GPT-4o as an accuracy ceiling and focus\ndevelopment on open-source Llama models suitable for privacy-sensitive\ndeployment. Testing across Health Canada drug product data, the RABBITS\nbenchmark, and real clinical notes from Ontario Health, our method achieves 78%\nexact match accuracy with GPT-4o and 60% with Llama 3.1 70B. We investigate\nknowledge grounding through drug definitions, finding modest improvements in\naccuracy. Further, we show that fine-tuned Llama 3.1 8B matches zero-shot Llama\n3.1 70B accuracy, suggesting that effective ATC coding is feasible with smaller\nmodels. Our results demonstrate the feasibility of automatic ATC coding in\nprivacy-sensitive healthcare environments, providing a foundation for future\ndeployments.", "paper_summary_zh": "手動分配解剖學治療化學（ATC）代碼至處方紀錄是安大略省衛生廳和 InterRAI 加拿大在醫療保健研究和作業中的一大瓶頸，需要大量的專家時間和精力。為了在維護資料隱私的同時自動化此流程，我們開發了一種使用可本地部署的大型語言模型（LLM）的實用方法。受到國際疾病分類（ICD）自動編碼的最新進展啟發，我們的編碼方法將 ATC 編碼設定為一項層級式資訊萃取任務，引導 LLM 逐層通過 ATC ontology。我們使用 GPT-4o 作為準確度上限，評估我們的做法並專注於開發適用於隱私敏感部署的開源 Llama 模型。在加拿大衛生部藥物產品資料、RABBITS 基準和安大略省衛生廳的真實臨床筆記中進行測試，我們的編碼方法使用 GPT-4o 達到 78% 的完全匹配準確度，使用 Llama 3.1 70B 達到 60%。我們透過藥物定義調查知識基礎，發現準確度有小幅提升。此外，我們展示微調後的 Llama 3.1 8B 匹配零次學習的 Llama 3.1 70B 準確度，這表示使用較小的模型也能有效進行 ATC 編碼。我們的結果證明了在注重隱私的醫療保健環境中自動進行 ATC 編碼的可行性，為未來的部署奠定基礎。", "author": "Zijian Chen et.al.", "authors": "Zijian Chen, John-Michael Gamble, Micaela Jantzi, John P. Hirdes, Jimmy Lin", "id": "2412.07743v1", "paper_url": "http://arxiv.org/abs/2412.07743v1", "repo": "null"}}