{"2406.14991": {"publish_time": "2024-06-21", "title": "SpreadsheetBench: Towards Challenging Real World Spreadsheet Manipulation", "paper_summary": "We introduce SpreadsheetBench, a challenging spreadsheet manipulation\nbenchmark exclusively derived from real-world scenarios, designed to immerse\ncurrent large language models (LLMs) in the actual workflow of spreadsheet\nusers. Unlike existing benchmarks that rely on synthesized queries and\nsimplified spreadsheet files, SpreadsheetBench is built from 912 real questions\ngathered from online Excel forums, which reflect the intricate needs of users.\nThe associated spreadsheets from the forums contain a variety of tabular data\nsuch as multiple tables, non-standard relational tables, and abundant\nnon-textual elements. Furthermore, we propose a more reliable evaluation metric\nakin to online judge platforms, where multiple spreadsheet files are created as\ntest cases for each instruction, ensuring the evaluation of robust solutions\ncapable of handling spreadsheets with varying values. Our comprehensive\nevaluation of various LLMs under both single-round and multi-round inference\nsettings reveals a substantial gap between the state-of-the-art (SOTA) models\nand human performance, highlighting the benchmark's difficulty.", "paper_summary_zh": "我們介紹 SpreadsheetBench，這是一個具有挑戰性的試算表操作基準測試，專門從真實世界的場景中衍生而來，旨在讓當前的巨量語言模型 (LLM) 沉浸在試算表使用者的實際工作流程中。與依賴於合成查詢和簡化試算表檔案的現有基準測試不同，SpreadsheetBench 是從線上 Excel 論壇中收集的 912 個真實問題所建構而成，這些問題反映了使用者的複雜需求。論壇中的相關試算表包含各種表格資料，例如多個表格、非標準關聯表格和豐富的非文字元素。此外，我們提出了一個更可靠的評估指標，類似於線上評審平台，其中多個試算表檔案被建立為每個指令的測試案例，確保評估健全的解決方案，能夠處理具有不同值的試算表。我們對各種 LLM 在單回合和多回合推理設定下的全面評估，揭示了最先進 (SOTA) 模型與人類效能之間的顯著差距，突顯了基準測試的難度。", "author": "Zeyao Ma et.al.", "authors": "Zeyao Ma, Bohan Zhang, Jing Zhang, Jifan Yu, Xiaokang Zhang, Xiaohan Zhang, Sijia Luo, Xi Wang, Jie Tang", "id": "2406.14991v1", "paper_url": "http://arxiv.org/abs/2406.14991v1", "repo": "null"}}