{"2405.09863": {"publish_time": "2024-05-16", "title": "Box-Free Model Watermarks Are Prone to Black-Box Removal Attacks", "paper_summary": "Box-free model watermarking is an emerging technique to safeguard the\nintellectual property of deep learning models, particularly those for low-level\nimage processing tasks. Existing works have verified and improved its\neffectiveness in several aspects. However, in this paper, we reveal that\nbox-free model watermarking is prone to removal attacks, even under the\nreal-world threat model such that the protected model and the watermark\nextractor are in black boxes. Under this setting, we carry out three studies.\n1) We develop an extractor-gradient-guided (EGG) remover and show its\neffectiveness when the extractor uses ReLU activation only. 2) More generally,\nfor an unknown extractor, we leverage adversarial attacks and design the EGG\nremover based on the estimated gradients. 3) Under the most stringent condition\nthat the extractor is inaccessible, we design a transferable remover based on a\nset of private proxy models. In all cases, the proposed removers can\nsuccessfully remove embedded watermarks while preserving the quality of the\nprocessed images, and we also demonstrate that the EGG remover can even replace\nthe watermarks. Extensive experimental results verify the effectiveness and\ngeneralizability of the proposed attacks, revealing the vulnerabilities of the\nexisting box-free methods and calling for further research.", "paper_summary_zh": "無框模型浮水印是一種新興技術，用於保護深度學習模型的智慧財產權，特別是那些用於低階影像處理任務的模型。現有作品已經驗證並改進了它的有效性。然而，在本文中，我們揭示了無框模型浮水印容易受到移除攻擊，即使在受保護模型和浮水印提取器在黑盒子中的真實世界威脅模型下也是如此。在此設置下，我們進行了三項研究。1) 我們開發了一個提取器梯度引導 (EGG) 移除器，並展示了它在提取器僅使用 ReLU 激活時的有效性。2) 更一般地說，對於一個未知的提取器，我們利用對抗攻擊並根據估計的梯度設計 EGG 移除器。3) 在提取器無法訪問的最嚴格條件下，我們設計了一個基於一組私有代理模型的可轉移移除器。在所有情況下，所提出的移除器都可以成功移除嵌入的浮水印，同時保持處理影像的品質，我們還展示了 EGG 移除器甚至可以替換浮水印。廣泛的實驗結果驗證了所提出的攻擊的有效性和泛化性，揭示了現有無框方法的漏洞，並呼籲進一步研究。", "author": "Haonan An et.al.", "authors": "Haonan An, Guang Hua, Zhiping Lin, Yuguang Fang", "id": "2405.09863v1", "paper_url": "http://arxiv.org/abs/2405.09863v1", "repo": "null"}}