{"2406.19954": {"publish_time": "2024-06-28", "title": "BESTOW: Efficient and Streamable Speech Language Model with the Best of Two Worlds in GPT and T5", "paper_summary": "Incorporating speech understanding capabilities into pretrained\nlarge-language models has become a vital research direction (SpeechLLM). The\nprevious architectures can be categorized as: i) GPT-style, prepend speech\nprompts to the text prompts as a sequence of LLM inputs like a decoder-only\nmodel; ii) T5-style, introduce speech cross-attention to each layer of the\npretrained LLMs. We propose BESTOW architecture to bring the BESt features from\nTwO Worlds into a single model that is highly efficient and has strong\nmultitask capabilities. Moreover, there is no clear streaming solution for\neither style, especially considering the solution should generalize to speech\nmultitask. We reformulate streamable SpeechLLM as a read-write policy problem\nand unifies the offline and streaming research with BESTOW architecture. Hence\nwe demonstrate the first open-source SpeechLLM solution that enables Streaming\nand Multitask at scale (beyond ASR) at the same time. This streamable solution\nachieves very strong performance on a wide range of speech tasks (ASR, AST,\nSQA, unseen DynamicSuperb). It is end-to-end optimizable, with lower\ntraining/inference cost, and demonstrates LLM knowledge transferability to\nspeech.", "paper_summary_zh": "將語音理解能力整合到預訓練的大語言模型中已成為一個重要的研究方向 (SpeechLLM)。先前的架構可以分類為：i) GPT 風格，將語音提示作為 LLM 輸入的序列，附加到文字提示之前，就像僅解碼器模型；ii) T5 風格，在預訓練 LLM 的每一層中引入語音交叉注意力。我們提出 BESTOW 架構，將兩個世界的最佳功能帶入一個單一模型中，該模型高效且具有強大的多任務能力。此外，對於這兩種風格都沒有明確的串流解決方案，特別是考慮到該解決方案應概括為語音多任務。我們將可串流 SpeechLLM 重新表述為讀寫策略問題，並使用 BESTOW 架構統一離線和串流研究。因此，我們展示了第一個開放原始碼 SpeechLLM 解決方案，它能同時大規模啟用串流和多任務（超越 ASR）。此可串流解決方案在廣泛的語音任務（ASR、AST、SQA、未見過的 DynamicSuperb）上實現了非常強大的效能。它是端到端可最佳化的，具有較低的訓練/推論成本，並展示了 LLM 知識可轉移到語音。", "author": "Zhehuai Chen et.al.", "authors": "Zhehuai Chen, He Huang, Oleksii Hrinchuk, Krishna C. Puvvada, Nithin Rao Koluguri, Piotr Żelasko, Jagadeesh Balam, Boris Ginsburg", "id": "2406.19954v1", "paper_url": "http://arxiv.org/abs/2406.19954v1", "repo": "null"}}