{"2409.13440": {"publish_time": "2024-09-20", "title": "Differentially Private Multimodal Laplacian Dropout (DP-MLD) for EEG Representative Learning", "paper_summary": "Recently, multimodal electroencephalogram (EEG) learning has shown great\npromise in disease detection. At the same time, ensuring privacy in clinical\nstudies has become increasingly crucial due to legal and ethical concerns. One\nwidely adopted scheme for privacy protection is differential privacy (DP)\nbecause of its clear interpretation and ease of implementation. Although\nnumerous methods have been proposed under DP, it has not been extensively\nstudied for multimodal EEG data due to the complexities of models and signal\ndata considered there. In this paper, we propose a novel Differentially Private\nMultimodal Laplacian Dropout (DP-MLD) scheme for multimodal EEG learning. Our\napproach proposes a novel multimodal representative learning model that\nprocesses EEG data by language models as text and other modal data by vision\ntransformers as images, incorporating well-designed cross-attention mechanisms\nto effectively extract and integrate cross-modal features. To achieve DP, we\ndesign a novel adaptive feature-level Laplacian dropout scheme, where\nrandomness allocation and performance are dynamically optimized within given\nprivacy budgets. In the experiment on an open-source multimodal dataset of\nFreezing of Gait (FoG) in Parkinson's Disease (PD), our proposed method\ndemonstrates an approximate 4\\% improvement in classification accuracy, and\nachieves state-of-the-art performance in multimodal EEG learning under DP.", "paper_summary_zh": "<paragraph>最近，多模态脑电图 (EEG) 学习在疾病检测方面显示出了巨大的前景。与此同时，由于法律和道德方面的考虑，在临床研究中确保隐私变得越来越重要。差分隐私 (DP) 是一种被广泛采用的隐私保护方案，因为它具有清晰的解释和易于实现的特点。尽管在 DP 下已经提出了许多方法，但由于所考虑的模型和信号数据的复杂性，尚未对其在多模态 EEG 数据中进行广泛的研究。在本文中，我们提出了一种新颖的差分隐私多模态拉普拉斯 Dropout（DP-MLD）方案，用于多模态 EEG 学习。我们的方法提出了一种新颖的多模态表示学习模型，该模型通过语言模型将 EEG 数据处理为文本，并将其他模态数据通过视觉转换器处理为图像，并结合精心设计的交叉注意力机制来有效提取和整合跨模态特征。为了实现 DP，我们设计了一种新颖的自适应特征级拉普拉斯 Dropout 方案，其中在给定的隐私预算内动态优化随机性分配和性能。在帕金森病 (PD) 中步态冻结 (FoG) 的开源多模态数据集上的实验中，我们提出的方法在分类准确性方面显示出约 4% 的提升，并在 DP 下的多模态 EEG 学习中实现了最先进的性能。</paragraph>", "author": "Xiaowen Fu et.al.", "authors": "Xiaowen Fu, Bingxin Wang, Xinzhou Guo, Guoqing Liu, Yang Xiang", "id": "2409.13440v1", "paper_url": "http://arxiv.org/abs/2409.13440v1", "repo": "null"}}