{"2412.06709": {"publish_time": "2024-12-09", "title": "Parkinson's Disease Diagnosis Through Deep Learning: A Novel LSTM-Based Approach for Freezing of Gait Detection", "paper_summary": "Deep learning holds tremendous potential in healthcare for uncovering hidden\npatterns within extensive clinical datasets, aiding in the diagnosis of various\ndiseases. Parkinson's disease (PD) is a neurodegenerative condition\ncharacterized by the deterioration of brain function. In the initial stages of\nPD, automatic diagnosis poses a challenge due to the similarity in behavior\nbetween individuals with PD and those who are healthy. Our objective is to\npropose an effective model that can aid in the early detection of Parkinson's\ndisease. We employed the VGRF gait signal dataset sourced from Physionet for\ndistinguishing between healthy individuals and those diagnosed with Parkinson's\ndisease. This paper introduces a novel deep learning architecture based on the\nLSTM network for automatically detecting freezing of gait episodes in\nParkinson's disease patients. In contrast to conventional machine learning\nalgorithms, this method eliminates manual feature engineering and proficiently\ncaptures prolonged temporal dependencies in gait patterns, thereby improving\nthe diagnosis of Parkinson's disease. The LSTM network resolves the issue of\nvanishing gradients by employing memory blocks in place of self-connected\nhidden units, allowing for optimal information assimilation. To prevent\noverfitting, dropout and L2 regularization techniques have been employed.\nAdditionally, the stochastic gradient-based optimizer Adam is used for the\noptimization process. The results indicate that our proposed approach surpasses\ncurrent state-of-the-art models in FOG episode detection, achieving an accuracy\nof 97.71%, sensitivity of 99%, precision of 98%, and specificity of 96%. This\ndemonstrates its potential as a superior classification method for Parkinson's\ndisease detection.", "paper_summary_zh": "深度學習在醫療保健領域擁有巨大的潛力，可用於發掘廣泛臨床資料集中的隱藏模式，協助診斷各種疾病。帕金森氏症 (PD) 是一種神經退化性疾病，其特徵是大腦功能惡化。在 PD 的初期階段，由於 PD 患者與健康者的行為相似，因此自動診斷具有挑戰性。我們的目標是提出一個有效的模型，可以幫助早期檢測帕金森氏症。我們採用了來自 Physionet 的 VGRF 步態信號資料集，用於區分健康個體和被診斷出患有帕金森氏症的個體。本文介紹了一種基於 LSTM 網路的深度學習新架構，用於自動檢測帕金森氏症患者的步態凍結發作。與傳統機器學習演算法相比，此方法消除了手動特徵工程，並熟練地捕捉步態模式中的長時間依賴性，從而改進了帕金森氏症的診斷。LSTM 網路通過使用記憶區塊代替自連接隱藏單元來解決梯度消失問題，從而實現最佳資訊同化。為了防止過度擬合，已採用中斷和 L2 正則化技術。此外，隨機梯度優化器 Adam 用於優化過程。結果表明，我們提出的方法在 FOG 發作檢測方面超越了當前最先進的模型，達到了 97.71% 的準確率、99% 的靈敏度、98% 的精確度和 96% 的特異性。這證明了其作為帕金森氏症檢測的優越分類方法的潛力。", "author": "Aqib Nazir Mir et.al.", "authors": "Aqib Nazir Mir, Iqra Nissar, Mumtaz Ahmed, Sarfaraz Masood, Danish Raza Rizvi", "id": "2412.06709v1", "paper_url": "http://arxiv.org/abs/2412.06709v1", "repo": "null"}}