{"2412.19509": {"publish_time": "2024-12-27", "title": "MBQ: Modality-Balanced Quantization for Large Vision-Language Models", "paper_summary": "Vision-Language Models (VLMs) have enabled a variety of real-world\napplications. The large parameter size of VLMs brings large memory and\ncomputation overhead which poses significant challenges for deployment.\nPost-Training Quantization (PTQ) is an effective technique to reduce the memory\nand computation overhead. Existing PTQ methods mainly focus on large language\nmodels (LLMs), without considering the differences across other modalities. In\nthis paper, we discover that there is a significant difference in sensitivity\nbetween language and vision tokens in large VLMs. Therefore, treating tokens\nfrom different modalities equally, as in existing PTQ methods, may\nover-emphasize the insensitive modalities, leading to significant accuracy\nloss. To deal with the above issue, we propose a simple yet effective method,\nModality-Balanced Quantization (MBQ), for large VLMs. Specifically, MBQ\nincorporates the different sensitivities across modalities during the\ncalibration process to minimize the reconstruction loss for better quantization\nparameters. Extensive experiments show that MBQ can significantly improve task\naccuracy by up to 4.4% and 11.6% under W3 and W4A8 quantization for 7B to 70B\nVLMs, compared to SOTA baselines. Additionally, we implement a W3 GPU kernel\nthat fuses the dequantization and GEMV operators, achieving a 1.4x speedup on\nLLaVA-onevision-7B on the RTX 4090. The code is available at\nhttps://github.com/thu-nics/MBQ.", "paper_summary_zh": "視覺語言模型 (VLM) 已啟用各種真實世界應用程式。VLM 的大型參數大小帶來巨大的記憶體和運算負擔，對部署構成重大挑戰。訓練後量化 (PTQ) 是一種有效的技術，可減少記憶體和運算負擔。現有的 PTQ 方法主要關注大型語言模型 (LLM)，而不考慮其他模式的差異。在本文中，我們發現大型 VLM 中的語言和視覺代碼之間的敏感度存在顯著差異。因此，如現有 PTQ 方法一樣，平等對待不同模式的代碼可能會過度強調不敏感的模式，導致準確度大幅下降。為了處理上述問題，我們提出了一種簡單而有效的方法，即大型 VLM 的模式平衡量化 (MBQ)。具體來說，MBQ 在校準過程中納入跨模式的不同敏感度，以最小化重建損失，以獲得更好的量化參數。大量實驗表明，與 SOTA 基準相比，MBQ 可以顯著提高任務準確度，對於 7B 到 70B VLM，在 W3 和 W4A8 量化下分別提高了 4.4% 和 11.6%。此外，我們實作了一個 W3 GPU 核心，它融合了去量化和 GEMV 算子，在 RTX 4090 上對 LLaVA-onevision-7B 实现了 1.4 倍的加速。程式碼可在 https://github.com/thu-nics/MBQ 取得。", "author": "Shiyao Li et.al.", "authors": "Shiyao Li, Yingchun Hu, Xuefei Ning, Xihui Liu, Ke Hong, Xiaotao Jia, Xiuhong Li, Yaqi Yan, Pei Ran, Guohao Dai, Shengen Yan, Huazhong Yang, Yu Wang", "id": "2412.19509v1", "paper_url": "http://arxiv.org/abs/2412.19509v1", "repo": "https://github.com/thu-nics/mbq"}}