{"2411.06959": {"publish_time": "2024-11-11", "title": "ENAT: Rethinking Spatial-temporal Interactions in Token-based Image Synthesis", "paper_summary": "Recently, token-based generation have demonstrated their effectiveness in\nimage synthesis. As a representative example, non-autoregressive Transformers\n(NATs) can generate decent-quality images in a few steps. NATs perform\ngeneration in a progressive manner, where the latent tokens of a resulting\nimage are incrementally revealed. At each step, the unrevealed image regions\nare padded with mask tokens and inferred by NAT. In this paper, we delve into\nthe mechanisms behind the effectiveness of NATs and uncover two important\npatterns that naturally emerge from NATs: Spatially (within a step), although\nmask and visible tokens are processed uniformly by NATs, the interactions\nbetween them are highly asymmetric. In specific, mask tokens mainly gather\ninformation for decoding, while visible tokens tend to primarily provide\ninformation, and their deep representations can be built only upon themselves.\nTemporally (across steps), the interactions between adjacent generation steps\nmostly concentrate on updating the representations of a few critical tokens,\nwhile the computation for the majority of tokens is generally repetitive.\nDriven by these findings, we propose EfficientNAT (ENAT), a NAT model that\nexplicitly encourages these critical interactions inherent in NATs. At the\nspatial level, we disentangle the computations of visible and mask tokens by\nencoding visible tokens independently, while decoding mask tokens conditioned\non the fully encoded visible tokens. At the temporal level, we prioritize the\ncomputation of the critical tokens at each step, while maximally reusing\npreviously computed token representations to supplement necessary information.\nENAT improves the performance of NATs notably with significantly reduced\ncomputational cost. Experiments on ImageNet-256, ImageNet-512 and MS-COCO\nvalidate the effectiveness of ENAT. Code is available at\nhttps://github.com/LeapLabTHU/ENAT.", "paper_summary_zh": "<paragraph>最近，基于标记的生成已证明其在图像合成中的有效性。作为代表性示例，非自回归式 Transformer（NAT）可以在几个步骤中生成质量不错的图像。NAT 以渐进的方式执行生成，其中结果图像的潜在标记逐渐被揭示。在每一步中，未揭示的图像区域都用掩码标记填充并由 NAT 推断。在本文中，我们深入研究了 NAT 有效性背后的机制，并揭示了 NAT 自然出现的两个重要模式：空间上（在步骤内），尽管 NAT 对掩码和可见标记进行统一处理，但它们之间的交互高度不对称。具体来说，掩码标记主要收集用于解码的信息，而可见标记倾向于主要提供信息，并且它们的深度表示只能建立在它们自己之上。时间上（跨步骤），相邻生成步骤之间的交互主要集中在更新几个关键标记的表示上，而大多数标记的计算通常是重复的。受这些发现的启发，我们提出了 EfficientNAT（ENAT），这是一个 NAT 模型，它明确地鼓励了 NAT 中固有的这些关键交互。在空间层面上，我们通过独立编码可见标记来解开可见标记和掩码标记的计算，同时对完全编码的可见标记进行条件解码掩码标记。在时间层面上，我们优先考虑在每一步计算关键标记，同时最大程度地重用先前计算的标记表示以补充必要信息。ENAT 显着提高了 NAT 的性能，同时显着降低了计算成本。在 ImageNet-256、ImageNet-512 和 MS-COCO 上的实验验证了 ENAT 的有效性。代码可在 https://github.com/LeapLabTHU/ENAT 获得。</paragraph>", "author": "Zanlin Ni et.al.", "authors": "Zanlin Ni, Yulin Wang, Renping Zhou, Yizeng Han, Jiayi Guo, Zhiyuan Liu, Yuan Yao, Gao Huang", "id": "2411.06959v1", "paper_url": "http://arxiv.org/abs/2411.06959v1", "repo": "https://github.com/leaplabthu/enat"}}