{"2405.17110": {"publish_time": "2024-05-27", "title": "Superpixelwise Low-rank Approximation based Partial Label Learning for Hyperspectral Image Classification", "paper_summary": "Insufficient prior knowledge of a captured hyperspectral image (HSI) scene\nmay lead the experts or the automatic labeling systems to offer incorrect\nlabels or ambiguous labels (i.e., assigning each training sample to a group of\ncandidate labels, among which only one of them is valid; this is also known as\npartial label learning) during the labeling process. Accordingly, how to learn\nfrom such data with ambiguous labels is a problem of great practical\nimportance. In this paper, we propose a novel superpixelwise low-rank\napproximation (LRA)-based partial label learning method, namely SLAP, which is\nthe first to take into account partial label learning in HSI classification.\nSLAP is mainly composed of two phases: disambiguating the training labels and\nacquiring the predictive model. Specifically, in the first phase, we propose a\nsuperpixelwise LRA-based model, preparing the affinity graph for the subsequent\nlabel propagation process while extracting the discriminative representation to\nenhance the following classification task of the second phase. Then to\ndisambiguate the training labels, label propagation propagates the labeling\ninformation via the affinity graph of training pixels. In the second phase, we\ntake advantage of the resulting disambiguated training labels and the\ndiscriminative representations to enhance the classification performance. The\nextensive experiments validate the advantage of the proposed SLAP method over\nstate-of-the-art methods.", "paper_summary_zh": "<paragraph>對於擷取的高光譜影像 (HSI) 場景缺乏先備知識，可能會導致專家或自動標籤系統在標籤過程中提供不正確的標籤或模稜兩可的標籤（即，將每個訓練樣本分配給一組候選標籤，其中只有一個是有效的；這也稱為部分標籤學習）。因此，如何從具有模稜兩可標籤的此類資料中學習是一個非常重要的實際問題。在本文中，我們提出了一種新的超像素低秩近似 (LRA) 為基礎的部分標籤學習方法，稱為 SLAP，這是第一個在 HSI 分類中考慮部分標籤學習的方法。SLAP 主要包含兩個階段：消除訓練標籤的歧義和獲取預測模型。具體來說，在第一階段，我們提出了一個基於超像素 LRA 的模型，為後續標籤傳播過程準備親和圖，同時提取判別式表示以增強第二階段的後續分類任務。然後，為了消除訓練標籤的歧義，標籤傳播通過訓練像素的親和圖傳播標籤資訊。在第二階段，我們利用產生的消除歧義的訓練標籤和判別式表示來增強分類效能。廣泛的實驗驗證了所提出的 SLAP 方法優於最先進方法的優勢。</paragraph>", "author": "Shujun Yang et.al.", "authors": "Shujun Yang, Yu Zhang, Yao Ding, Danfeng Hong", "id": "2405.17110v1", "paper_url": "http://arxiv.org/abs/2405.17110v1", "repo": "null"}}