{"2405.18375": {"publish_time": "2024-05-28", "title": "Thai Winograd Schemas: A Benchmark for Thai Commonsense Reasoning", "paper_summary": "Commonsense reasoning is one of the important aspect of natural language\nunderstanding, with several benchmarks developed to evaluate it. However, only\na few of these benchmarks are available in languages other than English.\nDeveloping parallel benchmarks facilitates cross-lingual evaluation, enabling a\nbetter understanding of different languages. This research introduces a\ncollection of Winograd Schemas in Thai, a novel dataset designed to evaluate\ncommonsense reasoning capabilities in the context of the Thai language.\n  Through a methodology involving native speakers, professional translators,\nand thorough validation, the schemas aim to closely reflect Thai language\nnuances, idioms, and cultural references while maintaining ambiguity and\ncommonsense challenges. We evaluate the performance of popular large language\nmodels on this benchmark, revealing their strengths, limitations, and providing\ninsights into the current state-of-the-art. Results indicate that while models\nlike GPT-4 and Claude-3-Opus achieve high accuracy in English, their\nperformance significantly drops in Thai, highlighting the need for further\nadvancements in multilingual commonsense reasoning.", "paper_summary_zh": "常識推理是自然語言理解的重要面向之一，已有許多基準可用於評估它。然而，只有少數幾個基準可用於除英語以外的語言。開發平行基準有助於跨語言評估，讓不同語言能有更好的理解。本研究引入了泰語的 Winograd 模式集合，這是一個新穎的資料集，旨在評估泰語語境中的常識推理能力。透過包含母語人士、專業翻譯人員和徹底驗證的方法，這些模式旨在緊密反映泰語的細微差別、慣用語和文化參照，同時保持歧義性和常識挑戰。我們評估了熱門大型語言模型在此基準上的表現，揭示了它們的優點、限制，並提供了對當前最先進技術的見解。結果表明，雖然 GPT-4 和 Claude-3-Opus 等模型在英語中取得了很高的準確性，但它們在泰語中的表現卻大幅下降，這凸顯了多語言常識推理進一步發展的必要性。", "author": "Phakphum Artkaew et.al.", "authors": "Phakphum Artkaew", "id": "2405.18375v1", "paper_url": "http://arxiv.org/abs/2405.18375v1", "repo": "null"}}