{"2410.03576": {"publish_time": "2024-10-04", "title": "Table Question Answering for Low-resourced Indic Languages", "paper_summary": "TableQA is the task of answering questions over tables of structured\ninformation, returning individual cells or tables as output. TableQA research\nhas focused primarily on high-resource languages, leaving medium- and\nlow-resource languages with little progress due to scarcity of annotated data\nand neural models. We address this gap by introducing a fully automatic\nlarge-scale tableQA data generation process for low-resource languages with\nlimited budget. We incorporate our data generation method on two Indic\nlanguages, Bengali and Hindi, which have no tableQA datasets or models. TableQA\nmodels trained on our large-scale datasets outperform state-of-the-art LLMs. We\nfurther study the trained models on different aspects, including mathematical\nreasoning capabilities and zero-shot cross-lingual transfer. Our work is the\nfirst on low-resource tableQA focusing on scalable data generation and\nevaluation procedures. Our proposed data generation method can be applied to\nany low-resource language with a web presence. We release datasets, models, and\ncode (https://github.com/kolk/Low-Resource-TableQA-Indic-languages).", "paper_summary_zh": "TableQA 是一項任務，回答有關結構化資訊表格的問題，回傳個別儲存格或表格作為輸出。TableQA 研究主要集中在高資源語言，由於標註資料和神經模型的稀少，導致中低資源語言進展甚微。我們透過引入一個完全自動化的大規模 TableQA 資料產生程序來解決這個差距，適用於預算有限的低資源語言。我們將資料產生方法納入兩種印度語言，孟加拉語和印地語，這兩種語言沒有 TableQA 資料集或模型。在我們的大規模資料集上訓練的 TableQA 模型優於最先進的 LLM。我們進一步研究訓練模型的不同面向，包括數學推理能力和零次學習的跨語言轉移。我們的研究是第一個針對低資源 TableQA，專注於可擴充資料產生和評估程序的研究。我們提出的資料產生方法可以應用於任何有網路存在的低資源語言。我們發布了資料集、模型和程式碼 (https://github.com/kolk/Low-Resource-TableQA-Indic-languages)。", "author": "Vaishali Pal et.al.", "authors": "Vaishali Pal, Evangelos Kanoulas, Andrew Yates, Maarten de Rijke", "id": "2410.03576v1", "paper_url": "http://arxiv.org/abs/2410.03576v1", "repo": "https://github.com/kolk/low-resource-tableqa-indic-languages"}}