{"2404.18144": {"publish_time": "2024-04-28", "title": "Generative AI for Visualization: State of the Art and Future Directions", "paper_summary": "Generative AI (GenAI) has witnessed remarkable progress in recent years and\ndemonstrated impressive performance in various generation tasks in different\ndomains such as computer vision and computational design. Many researchers have\nattempted to integrate GenAI into visualization framework, leveraging the\nsuperior generative capacity for different operations. Concurrently, recent\nmajor breakthroughs in GenAI like diffusion model and large language model have\nalso drastically increase the potential of GenAI4VIS. From a technical\nperspective, this paper looks back on previous visualization studies leveraging\nGenAI and discusses the challenges and opportunities for future research.\nSpecifically, we cover the applications of different types of GenAI methods\nincluding sequence, tabular, spatial and graph generation techniques for\ndifferent tasks of visualization which we summarize into four major stages:\ndata enhancement, visual mapping generation, stylization and interaction. For\neach specific visualization sub-task, we illustrate the typical data and\nconcrete GenAI algorithms, aiming to provide in-depth understanding of the\nstate-of-the-art GenAI4VIS techniques and their limitations. Furthermore, based\non the survey, we discuss three major aspects of challenges and research\nopportunities including evaluation, dataset, and the gap between end-to-end\nGenAI and generative algorithms. By summarizing different generation\nalgorithms, their current applications and limitations, this paper endeavors to\nprovide useful insights for future GenAI4VIS research.", "paper_summary_zh": "生成式 AI (GenAI) 近年來見證了顯著的進展，並在不同的領域（例如電腦視覺和計算設計）中，展現了在各種生成任務上的驚人表現。許多研究人員已嘗試將 GenAI 整合到視覺化架構中，利用其優越的生成能力進行不同的操作。同時，GenAI 最近在擴散模型和大型語言模型等方面的重大突破，也大幅提升了 GenAI4VIS 的潛力。從技術的角度來看，本文回顧了利用 GenAI 的先前的視覺化研究，並探討了未來研究的挑戰和機會。具體來說，我們涵蓋了不同類型 GenAI 方法的應用，包括序列、表格、空間和圖形生成技術，用於不同的視覺化任務，我們將其總結為四個主要階段：資料增強、視覺對應生成、樣式化和互動。對於每個特定的視覺化子任務，我們說明了典型的資料和具體的 GenAI 演算法，旨在深入了解最先進的 GenAI4VIS 技術及其限制。此外，根據調查，我們探討了挑戰和研究機會的三個主要方面，包括評估、資料集，以及端到端 GenAI 和生成演算法之間的差距。透過總結不同的生成演算法、它們目前的應用和限制，本文致力於為未來的 GenAI4VIS 研究提供有用的見解。", "author": "Yilin Ye et.al.", "authors": "Yilin Ye, Jianing Hao, Yihan Hou, Zhan Wang, Shishi Xiao, Yuyu Luo, Wei Zeng", "id": "2404.18144v1", "paper_url": "http://arxiv.org/abs/2404.18144v1", "repo": "null"}}