{"2408.12259": {"publish_time": "2024-08-22", "title": "Can You Trust Your Metric? Automatic Concatenation-Based Tests for Metric Validity", "paper_summary": "Consider a scenario where a harmfulness detection metric is employed by a\nsystem to filter unsafe responses generated by a Large Language Model. When\nanalyzing individual harmful and unethical prompt-response pairs, the metric\ncorrectly classifies each pair as highly unsafe, assigning the highest score.\nHowever, when these same prompts and responses are concatenated, the metric's\ndecision flips, assigning the lowest possible score, thereby misclassifying the\ncontent as safe and allowing it to bypass the filter. In this study, we\ndiscovered that several harmfulness LLM-based metrics, including GPT-based,\nexhibit this decision-flipping phenomenon. Additionally, we found that even an\nadvanced metric like GPT-4o is highly sensitive to input order. Specifically,\nit tends to classify responses as safe if the safe content appears first,\nregardless of any harmful content that follows, and vice versa. This work\nintroduces automatic concatenation-based tests to assess the fundamental\nproperties a valid metric should satisfy. We applied these tests in a model\nsafety scenario to assess the reliability of harmfulness detection metrics,\nuncovering a number of inconsistencies.", "paper_summary_zh": "考慮到一個場景，其中一個系統使用有害性偵測指標來過濾大型語言模型產生的不安全回應。在分析個別有害且不道德的提示回應配對時，指標正確地將每個配對分類為高度不安全，並指定最高分數。然而，當這些相同的提示和回應被串接時，指標的決定會翻轉，指定最低分數，從而將內容錯誤分類為安全並允許其繞過過濾器。在這項研究中，我們發現了幾個基於 LLM 的有害性指標，包括基於 GPT 的指標，表現出這種決策翻轉現象。此外，我們發現即使像 GPT-4o 這樣的高級指標對輸入順序也非常敏感。具體來說，它傾向於將回應分類為安全，如果安全內容首先出現，無論後續是否有任何有害內容，反之亦然。這項工作引入了基於自動串接的測試，以評估有效指標應滿足的基本屬性。我們在模型安全場景中應用這些測試來評估有害性偵測指標的可靠性，發現許多不一致之處。", "author": "Ora Nova Fandina et.al.", "authors": "Ora Nova Fandina, Leshem Choshen, Eitan Farchi, George Kour, Yotam Perlitz, Orna Raz", "id": "2408.12259v1", "paper_url": "http://arxiv.org/abs/2408.12259v1", "repo": "null"}}