{"2412.21052": {"publish_time": "2024-12-30", "title": "Towards Effective Discrimination Testing for Generative AI", "paper_summary": "Generative AI (GenAI) models present new challenges in regulating against\ndiscriminatory behavior. In this paper, we argue that GenAI fairness research\nstill has not met these challenges; instead, a significant gap remains between\nexisting bias assessment methods and regulatory goals. This leads to\nineffective regulation that can allow deployment of reportedly fair, yet\nactually discriminatory, GenAI systems. Towards remedying this problem, we\nconnect the legal and technical literature around GenAI bias evaluation and\nidentify areas of misalignment. Through four case studies, we demonstrate how\nthis misalignment between fairness testing techniques and regulatory goals can\nresult in discriminatory outcomes in real-world deployments, especially in\nadaptive or complex environments. We offer practical recommendations for\nimproving discrimination testing to better align with regulatory goals and\nenhance the reliability of fairness assessments in future deployments.", "paper_summary_zh": "生成式 AI (GenAI) 模型在規範歧視行為方面提出了新的挑戰。在本文中，我們認為 GenAI 公平性研究仍未滿足這些挑戰；相反，現有的偏見評估方法與法規目標之間仍存在顯著差距。這導致無效的規範，允許部署據稱公平但實際上具有歧視性的 GenAI 系統。為了解決這個問題，我們將 GenAI 偏見評估相關的法律和技術文獻聯繫起來，並找出錯位領域。透過四個案例研究，我們展示了公平性測試技術與法規目標之間的錯位如何導致實際部署中的歧視性結果，特別是在適應性或複雜環境中。我們提供了改進歧視測試的實用建議，以更好地符合法規目標，並提高未來部署中公平性評估的可靠性。", "author": "Thomas P. Zollo et.al.", "authors": "Thomas P. Zollo, Nikita Rajaneesh, Richard Zemel, Talia B. Gillis, Emily Black", "id": "2412.21052v1", "paper_url": "http://arxiv.org/abs/2412.21052v1", "repo": "null"}}