{"2410.02394": {"publish_time": "2024-10-03", "title": "Online Multi-Label Classification under Noisy and Changing Label Distribution", "paper_summary": "Multi-label data stream usually contains noisy labels in the real-world\napplications, namely occuring in both relevant and irrelevant labels. However,\nexisting online multi-label classification methods are mostly limited in terms\nof label quality and fail to deal with the case of noisy labels. On the other\nhand, the ground-truth label distribution may vary with the time changing,\nwhich is hidden in the observed noisy label distribution and difficult to\ntrack, posing a major challenge for concept drift adaptation. Motivated by\nthis, we propose an online multi-label classification algorithm under Noisy and\nChanging Label Distribution (NCLD). The convex objective is designed to\nsimultaneously model the label scoring and the label ranking for high accuracy,\nwhose robustness to NCLD benefits from three novel works: 1) The local feature\ngraph is used to reconstruct the label scores jointly with the observed labels,\nand an unbiased ranking loss is derived and applied to learn reliable ranking\ninformation. 2) By detecting the difference between two adjacent chunks with\nthe unbiased label cardinality, we identify the change in the ground-truth\nlabel distribution and reset the ranking or all information learned from the\npast to match the new distribution. 3) Efficient and accurate updating is\nachieved based on the updating rule derived from the closed-form optimal model\nsolution. Finally, empirical experimental results validate the effectiveness of\nour method in classifying instances under NCLD.", "paper_summary_zh": "多標籤資料串流通常在真實世界的應用中包含雜訊標籤，也就是同時出現在相關和不相關的標籤中。然而，現有的線上多標籤分類方法在標籤品質方面大多受到限制，無法處理雜訊標籤的情況。另一方面，真實標籤分佈可能會隨著時間而改變，這隱藏在觀察到的雜訊標籤分佈中，難以追蹤，對概念漂移適應構成重大挑戰。有鑑於此，我們提出一個在雜訊和變動標籤分佈 (NCLD) 下的線上多標籤分類演算法。凸目標旨在同時建模標籤評分和標籤排名以獲得高準確度，其對 NCLD 的穩健性受益於三項新穎的工作：1) 局部特徵圖用於與觀察到的標籤一起重建標籤分數，並推導出無偏的排名損失並應用於學習可靠的排名資訊。2) 透過使用無偏標籤基數偵測兩個相鄰塊之間的差異，我們識別真實標籤分佈的變化，並重設從過去學習到的排名或所有資訊以符合新的分佈。3) 基於從閉合形式最佳模型解推導出的更新規則，實現高效且準確的更新。最後，實證實驗結果驗證了我們的方法在 NCLD 下對實例進行分類的有效性。", "author": "Yizhang Zou et.al.", "authors": "Yizhang Zou, Xuegang Hu, Peipei Li, Jun Hu, You Wu", "id": "2410.02394v1", "paper_url": "http://arxiv.org/abs/2410.02394v1", "repo": "null"}}