{"2412.19037": {"publish_time": "2024-12-26", "title": "CL-attack: Textual Backdoor Attacks via Cross-Lingual Triggers", "paper_summary": "Backdoor attacks significantly compromise the security of large language\nmodels by triggering them to output specific and controlled content. Currently,\ntriggers for textual backdoor attacks fall into two categories: fixed-token\ntriggers and sentence-pattern triggers. However, the former are typically easy\nto identify and filter, while the latter, such as syntax and style, do not\napply to all original samples and may lead to semantic shifts. In this paper,\ninspired by cross-lingual (CL) prompts of LLMs in real-world scenarios, we\npropose a higher-dimensional trigger method at the paragraph level, namely\nCL-attack. CL-attack injects the backdoor by using texts with specific\nstructures that incorporate multiple languages, thereby offering greater\nstealthiness and universality compared to existing backdoor attack techniques.\nExtensive experiments on different tasks and model architectures demonstrate\nthat CL-attack can achieve nearly 100% attack success rate with a low poisoning\nrate in both classification and generation tasks. We also empirically show that\nthe CL-attack is more robust against current major defense methods compared to\nbaseline backdoor attacks. Additionally, to mitigate CL-attack, we further\ndevelop a new defense called TranslateDefense, which can partially mitigate the\nimpact of CL-attack.", "paper_summary_zh": "後門攻擊會觸發大型語言模型輸出特定且受控的內容，因而大幅危害其安全性。目前，文字後門攻擊的觸發器分為兩類：固定代碼觸發器和句子模式觸發器。然而，前者通常容易辨識和過濾，而後者（例如句法和風格）並不適用於所有原始範例，且可能導致語義轉換。在本文中，我們受到現實世界中 LLM 的跨語言 (CL) 提示啟發，提出了一個更高維度的段落級別觸發方法，即 CL 攻擊。CL 攻擊透過使用包含多種語言的特定結構文字來注入後門，從而提供比現有後門攻擊技術更強的隱蔽性和普遍性。針對不同任務和模型架構進行的廣泛實驗證明，CL 攻擊在分類和生成任務中都能達到近 100% 的攻擊成功率，且中毒率低。我們也透過實證顯示，與基準後門攻擊相比，CL 攻擊對於目前主要的防禦方法具有更強健的抵抗力。此外，為了減輕 CL 攻擊，我們進一步開發了一種名為 TranslateDefense 的新防禦，可以部分減輕 CL 攻擊的影響。", "author": "Jingyi Zheng et.al.", "authors": "Jingyi Zheng, Tianyi Hu, Tianshuo Cong, Xinlei He", "id": "2412.19037v1", "paper_url": "http://arxiv.org/abs/2412.19037v1", "repo": "null"}}