{"2406.07867": {"publish_time": "2024-06-12", "title": "Let's Go Real Talk: Spoken Dialogue Model for Face-to-Face Conversation", "paper_summary": "In this paper, we introduce a novel Face-to-Face spoken dialogue model. It\nprocesses audio-visual speech from user input and generates audio-visual speech\nas the response, marking the initial step towards creating an avatar chatbot\nsystem without relying on intermediate text. To this end, we newly introduce\nMultiDialog, the first large-scale multimodal (i.e., audio and visual) spoken\ndialogue corpus containing 340 hours of approximately 9,000 dialogues, recorded\nbased on the open domain dialogue dataset, TopicalChat. The MultiDialog\ncontains parallel audio-visual recordings of conversation partners acting\naccording to the given script with emotion annotations, which we expect to open\nup research opportunities in multimodal synthesis. Our Face-to-Face spoken\ndialogue model incorporates a textually pretrained large language model and\nadapts it into the audio-visual spoken dialogue domain by incorporating\nspeech-text joint pretraining. Through extensive experiments, we validate the\neffectiveness of our model in facilitating a face-to-face conversation. Demo\nand data are available at https://multidialog.github.io and\nhttps://huggingface.co/datasets/IVLLab/MultiDialog, respectively.", "paper_summary_zh": "在本文中，我們介紹了一種新穎的面对面口語對話模型。它處理來自使用者輸入的視訊語音，並產生視訊語音作為回應，標誌著在不依賴中間文字的情況下建立頭像聊天機器人系統的初步步驟。為此，我們新引入了 MultiDialog，這是第一個包含約 9,000 個對話、340 小時的對話語料庫，並根據開放域對話資料集 TopicalChat 進行記錄的大規模多模態（即音訊和視覺）口語對話語料庫。MultiDialog 包含對話夥伴根據給定腳本表演的對話音訊視訊並行錄音，以及我們預期將開啟多模態合成研究機會的情緒註解。我們的面對面口語對話模型結合了文字預訓練的大語言模型，並透過結合語音文字聯合預訓練，將其適應到視訊語音對話領域。透過廣泛的實驗，我們驗證了我們的模型在促進面對面對話中的有效性。示範和資料分別可以在 https://multidialog.github.io 和 https://huggingface.co/datasets/IVLLab/MultiDialog 取得。", "author": "Se Jin Park et.al.", "authors": "Se Jin Park, Chae Won Kim, Hyeongseop Rha, Minsu Kim, Joanna Hong, Jeong Hun Yeo, Yong Man Ro", "id": "2406.07867v1", "paper_url": "http://arxiv.org/abs/2406.07867v1", "repo": "null"}}