{"2405.05066": {"publish_time": "2024-05-08", "title": "Designing Skill-Compatible AI: Methodologies and Frameworks in Chess", "paper_summary": "Powerful artificial intelligence systems are often used in settings where\nthey must interact with agents that are computationally much weaker, for\nexample when they work alongside humans or operate in complex environments\nwhere some tasks are handled by algorithms, heuristics, or other entities of\nvarying computational power. For AI agents to successfully interact in these\nsettings, however, achieving superhuman performance alone is not sufficient;\nthey also need to account for suboptimal actions or idiosyncratic style from\ntheir less-skilled counterparts. We propose a formal evaluation framework for\nassessing the compatibility of near-optimal AI with interaction partners who\nmay have much lower levels of skill; we use popular collaborative chess\nvariants as model systems to study and develop AI agents that can successfully\ninteract with lower-skill entities. Traditional chess engines designed to\noutput near-optimal moves prove to be inadequate partners when paired with\nengines of various lower skill levels in this domain, as they are not designed\nto consider the presence of other agents. We contribute three methodologies to\nexplicitly create skill-compatible AI agents in complex decision-making\nsettings, and two chess game frameworks designed to foster collaboration\nbetween powerful AI agents and less-skilled partners. On these frameworks, our\nagents outperform state-of-the-art chess AI (based on AlphaZero) despite being\nweaker in conventional chess, demonstrating that skill-compatibility is a\ntangible trait that is qualitatively and measurably distinct from raw\nperformance. Our evaluations further explore and clarify the mechanisms by\nwhich our agents achieve skill-compatibility.", "paper_summary_zh": "強大的 AI 系統經常在必須與運算能力較弱的代理互動的環境中使用，例如當它們與人類並肩工作或在由演算法、啟發法或其他不同運算能力實體處理某些任務的複雜環境中運作時。然而，對於 AI 代理要在這些環境中成功互動，僅僅達到超人類的表現是不夠的；它們還需要考慮技能較差的對應方的次佳行動或獨特風格。我們提出一個正式的評估架構，用於評估近乎最佳 AI 與技能水平可能低得多的互動夥伴的相容性；我們使用流行的合作西洋棋變體作為模型系統來研究和開發能夠與技能較低的實體成功互動的 AI 代理。傳統的西洋棋引擎旨在輸出近乎最佳的移動，證明在與此領域中各種較低技能等級的引擎配對時，它們並非稱職的夥伴，因為它們並非設計用於考量其他代理的存在。我們貢獻了三種方法論，用於在複雜的決策制定環境中明確建立技能相容的 AI 代理，以及兩個旨在促進強大 AI 代理與技能較差的夥伴之間協作的西洋棋遊戲架構。在這些架構上，我們的代理表現優於最先進的西洋棋 AI（基於 AlphaZero），儘管在傳統西洋棋中較弱，這證明了技能相容性是一個具體的特質，在質量和可衡量性上都與原始表現不同。我們的評估進一步探討並釐清了我們的代理實現技能相容性的機制。", "author": "Karim Hamade et.al.", "authors": "Karim Hamade, Reid McIlroy-Young, Siddhartha Sen, Jon Kleinberg, Ashton Anderson", "id": "2405.05066v1", "paper_url": "http://arxiv.org/abs/2405.05066v1", "repo": "null"}}