{"2409.16287": {"publish_time": "2024-09-24", "title": "Articulated Object Manipulation using Online Axis Estimation with SAM2-Based Tracking", "paper_summary": "Articulated object manipulation requires precise object interaction, where\nthe object's axis must be carefully considered. Previous research employed\ninteractive perception for manipulating articulated objects, but typically,\nopen-loop approaches often suffer from overlooking the interaction dynamics. To\naddress this limitation, we present a closed-loop pipeline integrating\ninteractive perception with online axis estimation from segmented 3D point\nclouds. Our method leverages any interactive perception technique as a\nfoundation for interactive perception, inducing slight object movement to\ngenerate point cloud frames of the evolving dynamic scene. These point clouds\nare then segmented using Segment Anything Model 2 (SAM2), after which the\nmoving part of the object is masked for accurate motion online axis estimation,\nguiding subsequent robotic actions. Our approach significantly enhances the\nprecision and efficiency of manipulation tasks involving articulated objects.\nExperiments in simulated environments demonstrate that our method outperforms\nbaseline approaches, especially in tasks that demand precise axis-based\ncontrol. Project Page:\nhttps://hytidel.github.io/video-tracking-for-axis-estimation/.", "paper_summary_zh": "铰接物体操作需要精确的物体交互，其中必须仔细考虑物体的轴。先前的研究利用交互式感知来操作铰接物体，但通常，开环方法经常会忽略交互动态。为了解决这一限制，我们提出了一个闭环管道，将交互式感知与分段 3D 点云的在线轴估计相结合。我们的方法利用任何交互式感知技术作为交互式感知的基础，诱导轻微的物体运动以生成不断变化的动态场景的点云帧。然后使用 Segment Anything Model 2 (SAM2) 对这些点云进行分段，之后对物体的移动部分进行掩码处理以进行精确的运动在线轴估计，指导后续的机器人动作。我们的方法显着提高了涉及铰接物体的操作任务的精度和效率。模拟环境中的实验表明，我们的方法优于基线方法，尤其是在需要基于精确轴的控制的任务中。项目页面：\nhttps://hytidel.github.io/video-tracking-for-axis-estimation/。", "author": "Xi Wang et.al.", "authors": "Xi Wang, Tianxing Chen, Qiaojun Yu, Tianling Xu, Zanxin Chen, Yiting Fu, Cewu Lu, Yao Mu, Ping Luo", "id": "2409.16287v1", "paper_url": "http://arxiv.org/abs/2409.16287v1", "repo": "null"}}