{"2406.14877": {"publish_time": "2024-06-21", "title": "Sports Intelligence: Assessing the Sports Understanding Capabilities of Language Models through Question Answering from Text to Video", "paper_summary": "Understanding sports is crucial for the advancement of Natural Language\nProcessing (NLP) due to its intricate and dynamic nature. Reasoning over\ncomplex sports scenarios has posed significant challenges to current NLP\ntechnologies which require advanced cognitive capabilities. Toward addressing\nthe limitations of existing benchmarks on sports understanding in the NLP\nfield, we extensively evaluated mainstream large language models for various\nsports tasks. Our evaluation spans from simple queries on basic rules and\nhistorical facts to complex, context-specific reasoning, leveraging strategies\nfrom zero-shot to few-shot learning, and chain-of-thought techniques. In\naddition to unimodal analysis, we further assessed the sports reasoning\ncapabilities of mainstream video language models to bridge the gap in\nmultimodal sports understanding benchmarking. Our findings highlighted the\ncritical challenges of sports understanding for NLP. We proposed a new\nbenchmark based on a comprehensive overview of existing sports datasets and\nprovided extensive error analysis which we hope can help identify future\nresearch priorities in this field.", "paper_summary_zh": "了解運動對於自然語言處理 (NLP) 的進步至關重要，因為運動具有複雜且動態的本質。對複雜運動情境的推理對目前的 NLP 技術構成重大挑戰，這些技術需要進階的認知能力。為了解決 NLP 領域中現有運動理解基準的限制，我們廣泛評估了各種運動任務的主流大型語言模型。我們的評估涵蓋從基本規則和歷史事實的簡單查詢到複雜的特定情境推理，利用從零次學習到少量學習的策略，以及思考鏈技術。除了單模態分析之外，我們進一步評估了主流視訊語言模型的運動推理能力，以彌補多模態運動理解基準的差距。我們的發現突出了運動理解對於 NLP 的關鍵挑戰。我們根據現有運動資料集的全面概觀提出了新的基準，並提供了廣泛的錯誤分析，我們希望這有助於找出此領域未來的研究重點。", "author": "Zhengbang Yang et.al.", "authors": "Zhengbang Yang, Haotian Xia, Jingxi Li, Zezhi Chen, Zhuangdi Zhu, Weining Shen", "id": "2406.14877v1", "paper_url": "http://arxiv.org/abs/2406.14877v1", "repo": "null"}}