{"2502.04030": {"publish_time": "2025-02-06", "title": "Fine, I'll Merge It Myself: A Multi-Fidelity Framework for Automated Model Merging", "paper_summary": "Reasoning capabilities represent a critical frontier for large language\nmodels (LLMs), but developing them requires extensive proprietary datasets and\ncomputational resources. One way to efficiently supplement capabilities with is\nby model merging, which offers a promising alternative by combining multiple\nmodels without retraining. However, current merging approaches rely on\nmanually-designed strategies for merging hyperparameters, limiting the\nexploration of potential model combinations and requiring significant human\neffort. We propose an Automated Model Merging Framework that enables\nfine-grained exploration of merging strategies while reducing costs through\nmulti-fidelity approximations. We support both single and multi-objective\noptimization and introduce two novel search spaces: layerwise fusion (LFS) and\ndepth-wise integration (DIS). Evaluating across a number of benchmarks, we find\nthat the search autonomously finds 1) Merges that further boost\nsingle-objective performance, even on tasks the model has already been\nfinetuned on, and 2) Merges that optimize multi-objective frontiers across\ntasks. Effective merges are found with limited compute, e.g. within less than\n500 search steps.", "paper_summary_zh": "推理能力代表大型語言模型 (LLM) 的關鍵前沿，但開發它們需要廣泛的專有數據集和計算資源。有效補充功能的一種方法是模型合併，它提供了一個有前途的替代方案，可以合併多個模型而無需重新訓練。然而，當前合併方法依賴於人工設計的超參數合併策略，限制了潛在模型組合的探索，並需要大量人力。我們提出了一個自動化模型合併框架，它能夠精細地探索合併策略，同時通過多保真近似降低成本。我們支援單一和多目標最佳化，並引入了兩個新穎的搜索空間：逐層融合 (LFS) 和深度整合 (DIS)。在多個基準上進行評估，我們發現搜索會自動找到 1) 進一步提升單一目標效能的合併，即使在模型已經進行微調的任務上，以及 2) 在任務中最佳化多目標前沿的合併。在有限的運算下，例如在不到 500 個搜索步驟內，就能找到有效的合併。", "author": "Guinan Su et.al.", "authors": "Guinan Su, Jonas Geiping", "id": "2502.04030v1", "paper_url": "http://arxiv.org/abs/2502.04030v1", "repo": "null"}}