{"2502.09854": {"publish_time": "2025-02-14", "title": "Efficient Multitask Learning in Small Language Models Through Upside-Down Reinforcement Learning", "paper_summary": "In this work, we demonstrate that small language models (SLMs), specifically\na 100M parameter GPT-2 model, can achieve competitive performance in multitask\nprompt generation tasks while requiring only a fraction of the computational\nresources needed by large language models (LLMs). Through a novel combination\nof upside-down reinforcement learning and synthetic data distillation from a\npowerful LLM, Llama-3, we train an SLM that achieves relevance scores within 5%\nof state-of-the-art models, including Llama-3, Qwen2, and Mistral, despite\nbeing up to 80 times smaller, making it highly suitable for\nresource-constrained and real-time applications. This study highlights the\npotential of SLMs as efficient multitask learners in multimodal settings,\nproviding a promising alternative to LLMs for scalable, low-latency\ndeployments.", "paper_summary_zh": "在這項工作中，我們證明了小語言模型（SLM），特別是 100M 參數的 GPT-2 模型，可以在多任務提示生成任務中實現具有競爭力的效能，同時只需要大型語言模型（LLM）所需計算資源的一小部分。透過新穎的顛倒式強化學習和來自強大 LLM Llama-3 的合成資料萃取的組合，我們訓練了一個 SLM，其相關性分數在 5% 以內，包括 Llama-3、Qwen2 和 Mistral，儘管它小了 80 倍，使其非常適合資源受限和即時應用程式。這項研究突出了 SLM 作為多模態設定中高效的多任務學習者的潛力，為可擴充、低延遲部署提供了有希望的 LLM 替代方案。", "author": "Yu-Chen Lin et.al.", "authors": "Yu-Chen Lin, Sanat Sharma, Hari Manikandan, Jayant Kumar, Tracy Holloway King, Jing Zheng", "id": "2502.09854v1", "paper_url": "http://arxiv.org/abs/2502.09854v1", "repo": "null"}}