{"2410.16207": {"publish_time": "2024-10-21", "title": "CoT-TL: Low-Resource Temporal Knowledge Representation of Planning Instructions Using Chain-of-Thought Reasoning", "paper_summary": "Autonomous agents often face the challenge of interpreting uncertain natural\nlanguage instructions for planning tasks. Representing these instructions as\nLinear Temporal Logic (LTL) enables planners to synthesize actionable plans. We\nintroduce CoT-TL, a data-efficient in-context learning framework for\ntranslating natural language specifications into LTL representations. CoT-TL\naddresses the limitations of large language models, which typically rely on\nextensive fine-tuning data, by extending chain-of-thought reasoning and\nsemantic roles to align with the requirements of formal logic creation. This\napproach enhances the transparency and rationale behind LTL generation,\nfostering user trust. CoT-TL achieves state-of-the-art accuracy across three\ndiverse datasets in low-data scenarios, outperforming existing methods without\nfine-tuning or intermediate translations. To improve reliability and minimize\nhallucinations, we incorporate model checking to validate the syntax of the\ngenerated LTL output. We further demonstrate CoT-TL's effectiveness through\nablation studies and evaluations on unseen LTL structures and formulas in a new\ndataset. Finally, we validate CoT-TL's practicality by integrating it into a\nQuadCopter for multi-step drone planning based on natural language\ninstructions.", "paper_summary_zh": "自主代理經常面臨解讀不確定的自然語言指令以規劃任務的挑戰。將這些指令表示為線性時序邏輯 (LTL) 能讓規劃者綜合可行的計畫。我們引入了 CoT-TL，這是一個資料效率高的情境學習框架，用於將自然語言規格轉換為 LTL 表示。CoT-TL 透過擴展思考鏈推理和語意角色來符合形式邏輯建立的要求，來解決大型語言模型的限制，而大型語言模型通常仰賴廣泛的微調資料。這種方法增強了 LTL 生成的透明度和依據，促進使用者信任。CoT-TL 在三個不同的資料集中，於低資料情境中達成最先進的準確度，在沒有微調或中間轉換的情況下，表現優於現有方法。為了提升可靠度並將幻覺降至最低，我們納入了模型檢查來驗證所產生 LTL 輸出的語法。我們進一步透過消融研究，以及對新資料集中前所未見的 LTL 結構和公式的評估，來證明 CoT-TL 的效能。最後，我們透過將 CoT-TL 整合到四旋翼飛行器中，根據自然語言指令進行多步驟無人機規劃，來驗證 CoT-TL 的實用性。", "author": "Kumar Manas et.al.", "authors": "Kumar Manas, Stefan Zwicklbauer, Adrian Paschke", "id": "2410.16207v1", "paper_url": "http://arxiv.org/abs/2410.16207v1", "repo": "null"}}