{"2405.10860": {"publish_time": "2024-05-17", "title": "ECR-Chain: Advancing Generative Language Models to Better Emotion-Cause Reasoners through Reasoning Chains", "paper_summary": "Understanding the process of emotion generation is crucial for analyzing the\ncauses behind emotions. Causal Emotion Entailment (CEE), an\nemotion-understanding task, aims to identify the causal utterances in a\nconversation that stimulate the emotions expressed in a target utterance.\nHowever, current works in CEE mainly focus on modeling semantic and emotional\ninteractions in conversations, neglecting the exploration of the\nemotion-generation process. This hinders the models from deeply understanding\nemotions, restricting their ability to produce explainable predictions. In this\nwork, inspired by the emotion generation process of\n\"stimulus-appraisal-emotion\" in the cognitive appraisal theory, we introduce a\nstep-by-step reasoning method, Emotion-Cause Reasoning Chain (ECR-Chain), to\ninfer the stimulus from the target emotional expressions in conversations.\nSpecifically, we first introduce the ECR-Chain to ChatGPT via few-shot\nprompting, which significantly improves its performance on the CEE task. We\nfurther propose an automated construction process to utilize ChatGPT in\nbuilding an ECR-Chain set, which can enhance the reasoning abilities of smaller\nmodels through supervised training and assist the Vicuna-7B model in achieving\nstate-of-the-art CEE performance. Moreover, our methods can enable these\ngenerative language models to effectively perform emotion-cause reasoning in an\nexplainable manner. Our code, data and more details are at\nhttps://github.com/hzp3517/ECR-Chain.", "paper_summary_zh": "<paragraph>了解情緒產生的過程對於分析情緒背後的原因至關重要。因果情緒蘊含 (CEE) 是一種情緒理解任務，旨在識別對話中引發目標話語中表達的情緒的因果話語。然而，目前 CEE 的工作主要集中於對話中語義和情緒交互的建模，而忽略了對情緒產生過程的探索。這阻礙了模型對情緒的深入理解，限制了它們產生可解釋預測的能力。在這項工作中，受認知評估理論中「刺激-評估-情緒」的情緒產生過程啟發，我們引入了一個循序漸進的推理方法，情緒原因推理鏈 (ECR-Chain)，從對話中的目標情緒表達中推斷出刺激。具體來說，我們首先通過少次提示將 ECR-Chain 引入 ChatGPT，這顯著提高了其在 CEE 任務上的表現。我們進一步提出了一個自動化構建過程，利用 ChatGPT 構建 ECR-Chain 集合，這可以通過監督訓練增強較小模型的推理能力，並幫助 Vicuna-7B 模型實現最先進的 CEE 性能。此外，我們的這些方法可以使這些生成語言模型以可解釋的方式有效地執行情緒原因推理。我們的程式碼、資料和更多詳細資訊請參閱 https://github.com/hzp3517/ECR-Chain。</paragraph>", "author": "Zhaopei Huang et.al.", "authors": "Zhaopei Huang, Jinming Zhao, Qin Jin", "id": "2405.10860v1", "paper_url": "http://arxiv.org/abs/2405.10860v1", "repo": "https://github.com/hzp3517/ecr-chain"}}