{"2502.09767": {"publish_time": "2025-02-13", "title": "Non-Markovian Discrete Diffusion with Causal Language Models", "paper_summary": "Discrete diffusion models have emerged as a flexible and controllable\nparadigm for structured sequence modeling, yet they still lag behind causal\nlanguage models in expressiveness. To bridge the gap between two paradigms, we\nintroduce CaDDi, a causal discrete diffusion model that unifies sequential and\ntemporal modeling within a non-Markovian diffusion framework. Unlike\nconventional diffusion models that operate step by step with no access to prior\nstates, CaDDi integrates the temporal trajectory, enabling more expressive and\ncontrollable generation. Our approach also treats causal language models as a\nspecial case, allowing seamless adoption of pretrained large language models\n(LLMs) for discrete diffusion without the need for architectural modifications.\nEmpirically, we demonstrate that CaDDi outperforms state-of-the-art discrete\ndiffusion models on both natural language and biological sequence tasks,\nnarrowing the gap between diffusion-based methods and large-scale\nautoregressive transformers.", "paper_summary_zh": "離散擴散模型已成為結構化序列建模中一種靈活且可控的範例，但它們在表現力方面仍落後於因果語言模型。為了彌合這兩種範例之間的差距，我們引入了 CaDDi，這是一個因果離散擴散模型，它在非馬可夫擴散框架內統一了序列和時間建模。與逐步驟運作且無法存取先前狀態的傳統擴散模型不同，CaDDi 整合了時間軌跡，從而實現更具表現力和可控性的生成。我們的做法還將因果語言模型視為一個特例，允許無縫採用預訓練的大語言模型 (LLM) 進行離散擴散，而無需進行架構修改。根據經驗，我們證明 CaDDi 在自然語言和生物序列任務上都優於最先進的離散擴散模型，縮小了基於擴散的方法與大規模自迴歸Transformer之間的差距。", "author": "Yangtian Zhang et.al.", "authors": "Yangtian Zhang, Sizhuang He, Daniel Levine, Lawrence Zhao, David Zhang, Syed A Rizvi, Emanuele Zappala, Rex Ying, David van Dijk", "id": "2502.09767v1", "paper_url": "http://arxiv.org/abs/2502.09767v1", "repo": "null"}}