{"2406.02867": {"publish_time": "2024-06-05", "title": "Oscillations enhance time-series prediction in reservoir computing with feedback", "paper_summary": "Reservoir computing, a machine learning framework used for modeling the\nbrain, can predict temporal data with little observations and minimal\ncomputational resources. However, it is difficult to accurately reproduce the\nlong-term target time series because the reservoir system becomes unstable.\nThis predictive capability is required for a wide variety of time-series\nprocessing, including predictions of motor timing and chaotic dynamical\nsystems. This study proposes oscillation-driven reservoir computing (ODRC) with\nfeedback, where oscillatory signals are fed into a reservoir network to\nstabilize the network activity and induce complex reservoir dynamics. The ODRC\ncan reproduce long-term target time series more accurately than conventional\nreservoir computing methods in a motor timing and chaotic time-series\nprediction tasks. Furthermore, it generates a time series similar to the target\nin the unexperienced period, that is, it can learn the abstract generative\nrules from limited observations. Given these significant improvements made by\nthe simple and computationally inexpensive implementation, the ODRC would serve\nas a practical model of various time series data. Moreover, we will discuss\nbiological implications of the ODRC, considering it as a model of neural\noscillations and their cerebellar processors.", "paper_summary_zh": "儲存器運算是一種用於建模大腦的機器學習架構，它可以用少量的觀察和最少的運算資源預測時間資料。然而，由於儲存器系統會變得不穩定，因此難以準確地複製長期目標時間序列。這種預測能力對於各種時間序列處理是必需的，包括運動時序和混亂動力系統的預測。本研究提出帶有回饋的振盪驅動儲存器運算 (ODRC)，其中將振盪訊號輸入到儲存器網路中以穩定網路活動並誘導複雜的儲存器動態。ODRC 能比傳統的儲存器運算方法更準確地複製長期目標時間序列，用於運動時序和混亂時間序列預測任務。此外，它會在未經驗的時期產生類似於目標的時間序列，也就是說，它可以從有限的觀察中學習抽象的生成規則。由於簡單且運算成本低廉的實作帶來了這些顯著的改進，因此 ODRC 將可作為各種時間序列資料的實用模型。此外，我們將討論 ODRC 的生物學意義，並將其視為神經振盪及其小腦處理器的模型。", "author": "Yuji Kawai et.al.", "authors": "Yuji Kawai, Takashi Morita, Jihoon Park, Minoru Asada", "id": "2406.02867v1", "paper_url": "http://arxiv.org/abs/2406.02867v1", "repo": "null"}}