{"2501.03863": {"publish_time": "2025-01-07", "title": "Improving Dialectal Slot and Intent Detection with Auxiliary Tasks: A Multi-Dialectal Bavarian Case Study", "paper_summary": "Reliable slot and intent detection (SID) is crucial in natural language\nunderstanding for applications like digital assistants. Encoder-only\ntransformer models fine-tuned on high-resource languages generally perform well\non SID. However, they struggle with dialectal data, where no standardized form\nexists and training data is scarce and costly to produce. We explore zero-shot\ntransfer learning for SID, focusing on multiple Bavarian dialects, for which we\nrelease a new dataset for the Munich dialect. We evaluate models trained on\nauxiliary tasks in Bavarian, and compare joint multi-task learning with\nintermediate-task training. We also compare three types of auxiliary tasks:\ntoken-level syntactic tasks, named entity recognition (NER), and language\nmodelling. We find that the included auxiliary tasks have a more positive\neffect on slot filling than intent classification (with NER having the most\npositive effect), and that intermediate-task training yields more consistent\nperformance gains. Our best-performing approach improves intent classification\nperformance on Bavarian dialects by 5.1 and slot filling F1 by 8.4 percentage\npoints.", "paper_summary_zh": "可靠的槽位和意图检测 (SID) 在自然语言理解中至关重要，例如数位助理应用程序。仅编码器转换器模型经过微调，在高资源语言上通常在 SID 上表现良好。然而，它们难以处理方言数据，其中不存在标准化形式，并且训练数据稀缺且制作成本高昂。我们探索了 SID 的零次学习迁移学习，重点关注多种巴伐利亚方言，为此我们发布了慕尼黑方言的新数据集。我们评估了在巴伐利亚辅助任务中训练的模型，并将联合多任务学习与中间任务训练进行比较。我们还比较了三种类型的辅助任务：标记级句法任务、命名实体识别 (NER) 和语言建模。我们发现包含的辅助任务对槽位填充的影响比意图分类更积极（NER 影响最积极），并且中间任务训练产生了更一致的性能提升。我们表现最好的方法将巴伐利亚方言的意图分类性能提高了 5.1，槽位填充 F1 提高了 8.4 个百分点。", "author": "Xaver Maria Krückl et.al.", "authors": "Xaver Maria Krückl, Verena Blaschke, Barbara Plank", "id": "2501.03863v1", "paper_url": "http://arxiv.org/abs/2501.03863v1", "repo": "https://github.com/mainlp/auxtasks-bavarian-sid"}}