{"2411.13997": {"publish_time": "2024-11-21", "title": "Mirror Target YOLO: An Improved YOLOv8 Method with Indirect Vision for Heritage Buildings Fire Detection", "paper_summary": "Fires can cause severe damage to heritage buildings, making timely fire\ndetection essential. Traditional dense cabling and drilling can harm these\nstructures, so reducing the number of cameras to minimize such impact is\nchallenging. Additionally, avoiding false alarms due to noise sensitivity and\npreserving the expertise of managers in fire-prone areas is crucial. To address\nthese needs, we propose a fire detection method based on indirect vision,\ncalled Mirror Target YOLO (MITA-YOLO). MITA-YOLO integrates indirect vision\ndeployment and an enhanced detection module. It uses mirror angles to achieve\nindirect views, solving issues with limited visibility in irregular spaces and\naligning each indirect view with the target monitoring area. The Target-Mask\nmodule is designed to automatically identify and isolate the indirect vision\nareas in each image, filtering out non-target areas. This enables the model to\ninherit managers' expertise in assessing fire-risk zones, improving focus and\nresistance to interference in fire detection.In our experiments, we created an\n800-image fire dataset with indirect vision. Results show that MITA-YOLO\nsignificantly reduces camera requirements while achieving superior detection\nperformance compared to other mainstream models.", "paper_summary_zh": "火災會對古蹟建築造成嚴重損害，因此及時偵測火災至關重要。傳統的密集佈線和鑽孔可能會損害這些結構，因此減少相機數量以將此類影響降至最低具有挑戰性。此外，避免因噪音敏感性而發出錯誤警報並保留火災多發地區管理人員的專業知識至關重要。為了滿足這些需求，我們提出了一種基於間接視覺的火災檢測方法，稱為 Mirror Target YOLO (MITA-YOLO)。MITA-YOLO 整合了間接視覺部署和增強的檢測模組。它使用鏡面角度來獲得間接視角，解決了不規則空間中能見度受限的問題，並將每個間接視角與目標監控區域對齊。Target-Mask 模組旨在自動識別和隔離每個影像中的間接視覺區域，濾除非目標區域。這使模型能夠繼承管理人員在評估火災風險區域方面的專業知識，提高焦點和抗干擾能力，以進行火災檢測。在我們的實驗中，我們創建了一個具有間接視覺的 800 張影像火災資料集。結果表明，與其他主流模型相比，MITA-YOLO 大幅減少了相機需求，同時實現了卓越的檢測效能。", "author": "Jian Liang et.al.", "authors": "Jian Liang, JunSheng Cheng", "id": "2411.13997v1", "paper_url": "http://arxiv.org/abs/2411.13997v1", "repo": "null"}}