{"2410.12537": {"publish_time": "2024-10-16", "title": "Is Complex Query Answering Really Complex?", "paper_summary": "Complex query answering (CQA) on knowledge graphs (KGs) is gaining momentum\nas a challenging reasoning task. In this paper, we show that the current\nbenchmarks for CQA are not really complex, and the way they are built distorts\nour perception of progress in this field. For example, we find that in these\nbenchmarks, most queries (up to 98% for some query types) can be reduced to\nsimpler problems, e.g., link prediction, where only one link needs to be\npredicted. The performance of state-of-the-art CQA models drops significantly\nwhen such models are evaluated on queries that cannot be reduced to easier\ntypes. Thus, we propose a set of more challenging benchmarks, composed of\nqueries that require models to reason over multiple hops and better reflect the\nconstruction of real-world KGs. In a systematic empirical investigation, the\nnew benchmarks show that current methods leave much to be desired from current\nCQA methods.", "paper_summary_zh": "複雜查詢回答（CQA）在知識圖譜（KG）上正逐漸成為一項具有挑戰性的推理任務。在本文中，我們將表明 CQA 的當前基準並非真正複雜，且其建構方式扭曲了我們對此領域進展的認知。例如，我們發現，在這些基準中，大多數查詢（對於某些查詢類型而言高達 98%）都可以簡化為更簡單的問題，例如連結預測，其中只需要預測一個連結。當此類模型在無法簡化為更簡單類型的查詢上進行評估時，最先進的 CQA 模型的效能會大幅下降。因此，我們提出了一組更具挑戰性的基準，其中包含需要模型透過多個跳躍進行推理並能更好地反映真實世界 KG 建構的查詢。在系統性的實證調查中，新的基準表明，目前的 CQA 方法與理想狀態仍有很大的差距。", "author": "Cosimo Gregucci et.al.", "authors": "Cosimo Gregucci, Bo Xiong, Daniel Hernandez, Lorenzo Loconte, Pasquale Minervini, Steffen Staab, Antonio Vergari", "id": "2410.12537v1", "paper_url": "http://arxiv.org/abs/2410.12537v1", "repo": "null"}}