{"2405.02475": {"publish_time": "2024-05-03", "title": "Generalizing Orthogonalization for Models with Non-linearities", "paper_summary": "The complexity of black-box algorithms can lead to various challenges,\nincluding the introduction of biases. These biases present immediate risks in\nthe algorithms' application. It was, for instance, shown that neural networks\ncan deduce racial information solely from a patient's X-ray scan, a task beyond\nthe capability of medical experts. If this fact is not known to the medical\nexpert, automatic decision-making based on this algorithm could lead to\nprescribing a treatment (purely) based on racial information. While current\nmethodologies allow for the \"orthogonalization\" or \"normalization\" of neural\nnetworks with respect to such information, existing approaches are grounded in\nlinear models. Our paper advances the discourse by introducing corrections for\nnon-linearities such as ReLU activations. Our approach also encompasses scalar\nand tensor-valued predictions, facilitating its integration into neural network\narchitectures. Through extensive experiments, we validate our method's\neffectiveness in safeguarding sensitive data in generalized linear models,\nnormalizing convolutional neural networks for metadata, and rectifying\npre-existing embeddings for undesired attributes.", "paper_summary_zh": "黑盒子演算法的複雜性可能會導致各種挑戰，包括引入偏見。這些偏見會在演算法的應用中帶來立即的風險。例如，研究顯示神經網路可以僅從病患的 X 光掃描中推斷出種族資訊，這項任務超出了醫療專家的能力。如果醫療專家不知道這個事實，基於此演算法的自動決策可能會導致根據種族資訊（純粹地）開立治療。雖然目前的技術允許對神經網路進行「正交化」或「正規化」以應對此類資訊，但現有方法是以線性模型為基礎。我們的論文透過引入對非線性（例如 ReLU 啟用）的修正來推進論述。我們的做法也包含標量和張量值預測，有助於將其整合到神經網路架構中。透過廣泛的實驗，我們驗證了我們的方法在廣義線性模型中保護敏感資料、正規化用於元資料的卷積神經網路，以及修正預先存在的嵌入以消除不需要的屬性的有效性。", "author": "David Rügamer et.al.", "authors": "David Rügamer, Chris Kolb, Tobias Weber, Lucas Kook, Thomas Nagler", "id": "2405.02475v1", "paper_url": "http://arxiv.org/abs/2405.02475v1", "repo": "null"}}