{"2501.19258": {"publish_time": "2025-01-31", "title": "VisualSpeech: Enhance Prosody with Visual Context in TTS", "paper_summary": "Text-to-Speech (TTS) synthesis faces the inherent challenge of producing\nmultiple speech outputs with varying prosody from a single text input. While\nprevious research has addressed this by predicting prosodic information from\nboth text and speech, additional contextual information, such as visual\nfeatures, remains underutilized. This paper investigates the potential of\nintegrating visual context to enhance prosody prediction. We propose a novel\nmodel, VisualSpeech, which incorporates both visual and textual information for\nimproved prosody generation. Empirical results demonstrate that visual features\nprovide valuable prosodic cues beyond the textual input, significantly\nenhancing the naturalness and accuracy of the synthesized speech. Audio samples\nare available at https://ariameetgit.github.io/VISUALSPEECH-SAMPLES/.", "paper_summary_zh": "文字轉語音（TTS）合成面臨著一個固有挑戰，即從單一文字輸入產生具有不同語調的多個語音輸出。雖然先前的研究已透過從文字和語音預測語調資訊來解決這個問題，但額外的脈絡資訊（例如視覺特徵）仍未得到充分利用。本文探討了整合視覺脈絡以增強語調預測的潛力。我們提出了一個創新的模型 VisualSpeech，它結合了視覺和文字資訊，以改善語調產生。實證結果表明，視覺特徵提供了超越文字輸入的寶貴語調線索，顯著提高了合成語音的自然性和準確性。音訊範例可在 https://ariameetgit.github.io/VISUALSPEECH-SAMPLES/ 取得。", "author": "Shumin Que et.al.", "authors": "Shumin Que, Anton Ragni", "id": "2501.19258v1", "paper_url": "http://arxiv.org/abs/2501.19258v1", "repo": "null"}}