{"2501.17643": {"publish_time": "2025-01-29", "title": "Tonguescape: Exploring Language Models Understanding of Vowel Articulation", "paper_summary": "Vowels are primarily characterized by tongue position. Humans have discovered\nthese features of vowel articulation through their own experience and explicit\nobjective observation such as using MRI. With this knowledge and our\nexperience, we can explain and understand the relationship between tongue\npositions and vowels, and this knowledge is helpful for language learners to\nlearn pronunciation. Since language models (LMs) are trained on a large amount\nof data that includes linguistic and medical fields, our preliminary studies\nindicate that an LM is able to explain the pronunciation mechanisms of vowels.\nHowever, it is unclear whether multi-modal LMs, such as vision LMs, align\ntextual information with visual information. One question arises: do LMs\nassociate real tongue positions with vowel articulation? In this study, we\ncreated video and image datasets from the existing real-time MRI dataset and\ninvestigated whether LMs can understand vowel articulation based on tongue\npositions using vision-based information. Our findings suggest that LMs exhibit\npotential for understanding vowels and tongue positions when reference examples\nare provided while they have difficulties without them. Our code for dataset\nbuilding is available on GitHub.", "paper_summary_zh": "元音主要由舌頭位置決定。人類透過自己的經驗和明確的客觀觀察（例如使用 MRI）發現了元音發音的這些特徵。有了這些知識和經驗，我們可以解釋和理解舌頭位置和元音之間的關係，而這些知識對語言學習者學習發音很有幫助。由於語言模型 (LM) 是在包含語言學和醫學領域的大量資料上訓練的，我們的初步研究表明，LM 能夠解釋元音的發音機制。然而，尚不清楚多模態 LM（例如視覺 LM）是否將文字資訊與視覺資訊對齊。一個問題產生了：LM 是否將真實的舌頭位置與元音發音聯繫起來？在這項研究中，我們從現有的即時 MRI 資料集中建立了影片和影像資料集，並探討 LM 是否能根據舌頭位置使用基於視覺的資訊來理解元音發音。我們的研究結果表明，當提供參考範例時，LM 具有理解元音和舌頭位置的潛力，而沒有參考範例時則有困難。我們用於建立資料集的程式碼可在 GitHub 上取得。", "author": "Haruki Sakajo et.al.", "authors": "Haruki Sakajo, Yusuke Sakai, Hidetaka Kamigaito, Taro Watanabe", "id": "2501.17643v1", "paper_url": "http://arxiv.org/abs/2501.17643v1", "repo": "null"}}