{"2406.07544": {"publish_time": "2024-06-11", "title": "Situational Awareness Matters in 3D Vision Language Reasoning", "paper_summary": "Being able to carry out complicated vision language reasoning tasks in 3D\nspace represents a significant milestone in developing household robots and\nhuman-centered embodied AI. In this work, we demonstrate that a critical and\ndistinct challenge in 3D vision language reasoning is situational awareness,\nwhich incorporates two key components: (1) The autonomous agent grounds its\nself-location based on a language prompt. (2) The agent answers open-ended\nquestions from the perspective of its calculated position. To address this\nchallenge, we introduce SIG3D, an end-to-end Situation-Grounded model for 3D\nvision language reasoning. We tokenize the 3D scene into sparse voxel\nrepresentation and propose a language-grounded situation estimator, followed by\na situated question answering module. Experiments on the SQA3D and ScanQA\ndatasets show that SIG3D outperforms state-of-the-art models in situation\nestimation and question answering by a large margin (e.g., an enhancement of\nover 30% on situation estimation accuracy). Subsequent analysis corroborates\nour architectural design choices, explores the distinct functions of visual and\ntextual tokens, and highlights the importance of situational awareness in the\ndomain of 3D question answering.", "paper_summary_zh": "能夠在 3D 空間中執行複雜的視覺語言推理任務，代表了家用機器人和以人為中心的具體 AI 發展中的重要里程碑。在這項工作中，我們證明了 3D 視覺語言推理中一項關鍵且獨特的挑戰在於情境感知，它包含兩個關鍵組成部分：(1) 自主代理根據語言提示確定其自我位置。(2) 代理從其計算出的位置的角度回答開放式問題。為了應對這一挑戰，我們引入了 SIG3D，這是一個端到端的 3D 視覺語言推理情境基礎模型。我們將 3D 場景標記化為稀疏體素表示，並提出一個語言基礎的情境估計器，隨後是一個情境問題回答模組。對 SQA3D 和 ScanQA 資料集的實驗表明，SIG3D 在情境估計和問題回答方面大幅優於最先進的模型（例如，情境估計準確度提高了 30% 以上）。後續分析證實了我們的架構設計選擇，探討了視覺和文字標記的不同功能，並強調了情境感知在 3D 問題回答領域中的重要性。", "author": "Yunze Man et.al.", "authors": "Yunze Man, Liang-Yan Gui, Yu-Xiong Wang", "id": "2406.07544v1", "paper_url": "http://arxiv.org/abs/2406.07544v1", "repo": "null"}}