{"2410.11761": {"publish_time": "2024-10-15", "title": "SlideChat: A Large Vision-Language Assistant for Whole-Slide Pathology Image Understanding", "paper_summary": "Despite the progress made by multimodal large language models (MLLMs) in\ncomputational pathology, they remain limited by a predominant focus on\npatch-level analysis, missing essential contextual information at the\nwhole-slide level. The lack of large-scale instruction datasets and the\ngigapixel scale of whole slide images (WSIs) pose significant developmental\nchallenges. In this paper, we present SlideChat, the first vision-language\nassistant capable of understanding gigapixel whole-slide images, exhibiting\nexcellent multimodal conversational capability and response complex instruction\nacross diverse pathology scenarios. To support its development, we created\nSlideInstruction, the largest instruction-following dataset for WSIs consisting\nof 4.2K WSI captions and 176K VQA pairs with multiple categories. Furthermore,\nwe propose SlideBench, a multimodal benchmark that incorporates captioning and\nVQA tasks to assess SlideChat's capabilities in varied clinical settings such\nas microscopy, diagnosis. Compared to both general and specialized MLLMs,\nSlideChat exhibits exceptional capabilities achieving state-of-the-art\nperformance on 18 of 22 tasks. For example, it achieved an overall accuracy of\n81.17% on SlideBench-VQA (TCGA), and 54.15% on SlideBench-VQA (BCNB). We will\nfully release SlideChat, SlideInstruction and SlideBench as open-source\nresources to facilitate research and development in computational pathology.", "paper_summary_zh": "儘管多模態大型語言模型 (MLLM) 在計算病理學上取得進展，但它們仍然受限於對區塊層級分析的過度關注，而錯失了全切片層級的必要脈絡資訊。缺乏大規模指示資料集和全切片影像 (WSI) 的吉像素級規模，構成了重大的開發挑戰。在本文中，我們提出 SlideChat，這是第一個能夠理解吉像素全切片影像的視覺語言助理，展現了出色的多模態對話能力，並在各種病理情況下回應複雜的指示。為了支援其開發，我們建立了 SlideInstruction，這是最大的 WSI 指示遵循資料集，包含 4.2K WSI 標題和 176K 個具有多種類別的 VQA 配對。此外，我們提出 SlideBench，這是一個多模態基準，結合了標題和 VQA 任務，以評估 SlideChat 在各種臨床設定（例如顯微鏡、診斷）中的能力。與一般和專門的 MLLM 相比，SlideChat 展現了卓越的能力，在 22 項任務中有 18 項達到了最先進的效能。例如，它在 SlideBench-VQA (TCGA) 上達到了 81.17% 的整體準確度，在 SlideBench-VQA (BCNB) 上達到了 54.15%。我們將全面釋出 SlideChat、SlideInstruction 和 SlideBench 作為開放原始碼資源，以促進計算病理學的研究和開發。", "author": "Ying Chen et.al.", "authors": "Ying Chen, Guoan Wang, Yuanfeng Ji, Yanjun Li, Jin Ye, Tianbin Li, Bin Zhang, Nana Pei, Rongshan Yu, Yu Qiao, Junjun He", "id": "2410.11761v2", "paper_url": "http://arxiv.org/abs/2410.11761v2", "repo": "null"}}