{"2406.02133": {"publish_time": "2024-06-04", "title": "SimulTron: On-Device Simultaneous Speech to Speech Translation", "paper_summary": "Simultaneous speech-to-speech translation (S2ST) holds the promise of\nbreaking down communication barriers and enabling fluid conversations across\nlanguages. However, achieving accurate, real-time translation through mobile\ndevices remains a major challenge. We introduce SimulTron, a novel S2ST\narchitecture designed to tackle this task. SimulTron is a lightweight direct\nS2ST model that uses the strengths of the Translatotron framework while\nincorporating key modifications for streaming operation, and an adjustable\nfixed delay. Our experiments show that SimulTron surpasses Translatotron 2 in\noffline evaluations. Furthermore, real-time evaluations reveal that SimulTron\nimproves upon the performance achieved by Translatotron 1. Additionally,\nSimulTron achieves superior BLEU scores and latency compared to previous\nreal-time S2ST method on the MuST-C dataset. Significantly, we have\nsuccessfully deployed SimulTron on a Pixel 7 Pro device, show its potential for\nsimultaneous S2ST on-device.", "paper_summary_zh": "同步語音轉語音翻譯 (S2ST) 承諾打破溝通障礙，並跨語言進行流暢對話。然而，透過行動裝置達成準確的即時翻譯仍是一項重大挑戰。我們介紹 SimulTron，一種新穎的 S2ST 架構，旨在解決此任務。SimulTron 是一款輕量級的直接 S2ST 模型，它使用 Translatotron 架構的優勢，同時結合串流操作和可調整的固定延遲的主要修改。我們的實驗顯示，SimulTron 在離線評估中超越 Translatotron 2。此外，即時評估顯示，SimulTron 改善了 Translatotron 1 達到的效能。此外，與 MuST-C 資料集上的先前即時 S2ST 方法相比，SimulTron 達到了更高的 BLEU 分數和延遲。值得注意的是，我們已成功在 Pixel 7 Pro 裝置上部署 SimulTron，顯示其在裝置上進行同步 S2ST 的潛力。", "author": "Alex Agranovich et.al.", "authors": "Alex Agranovich, Eliya Nachmani, Oleg Rybakov, Yifan Ding, Ye Jia, Nadav Bar, Heiga Zen, Michelle Tadmor Ramanovich", "id": "2406.02133v1", "paper_url": "http://arxiv.org/abs/2406.02133v1", "repo": "null"}}