{"2409.17066": {"publish_time": "2024-09-25", "title": "VPTQ: Extreme Low-bit Vector Post-Training Quantization for Large Language Models", "paper_summary": "Scaling model size significantly challenges the deployment and inference of\nLarge Language Models (LLMs). Due to the redundancy in LLM weights, recent\nresearch has focused on pushing weight-only quantization to extremely low-bit\n(even down to 2 bits). It reduces memory requirements, optimizes storage costs,\nand decreases memory bandwidth needs during inference. However, due to\nnumerical representation limitations, traditional scalar-based weight\nquantization struggles to achieve such extreme low-bit. Recent research on\nVector Quantization (VQ) for LLMs has demonstrated the potential for extremely\nlow-bit model quantization by compressing vectors into indices using lookup\ntables.\n  In this paper, we introduce Vector Post-Training Quantization (VPTQ) for\nextremely low-bit quantization of LLMs. We use Second-Order Optimization to\nformulate the LLM VQ problem and guide our quantization algorithm design by\nsolving the optimization. We further refine the weights using\nChannel-Independent Second-Order Optimization for a granular VQ. In addition,\nby decomposing the optimization problem, we propose a brief and effective\ncodebook initialization algorithm. We also extend VPTQ to support residual and\noutlier quantization, which enhances model accuracy and further compresses the\nmodel. Our experimental results show that VPTQ reduces model quantization\nperplexity by $0.01$-$0.34$ on LLaMA-2, $0.38$-$0.68$ on Mistral-7B,\n$4.41$-$7.34$ on LLaMA-3 over SOTA at 2-bit, with an average accuracy\nimprovement of $0.79$-$1.5\\%$ on LLaMA-2, $1\\%$ on Mistral-7B, $11$-$22\\%$ on\nLLaMA-3 on QA tasks on average. We only utilize $10.4$-$18.6\\%$ of the\nquantization algorithm execution time, resulting in a $1.6$-$1.8\\times$\nincrease in inference throughput compared to SOTA.", "paper_summary_zh": "<paragraph>大幅縮放模型大小會對大型語言模型 (LLM) 的部署和推論帶來嚴峻挑戰。由於 LLM 權重中的冗餘，最近的研究已專注於將僅權重量化推至極低位元（甚至低至 2 位元）。這減少了記憶體需求，最佳化儲存成本，並在推論期間降低記憶體頻寬需求。然而，由於數值表示限制，傳統的基於純量權重量化難以達到如此極低的位元。最近針對 LLM 的向量量化 (VQ) 研究已證明了極低位元模型量化的潛力，方法是使用查找表將向量壓縮成索引。\n本文中，我們介紹了極低位元 LLM 量化的向量後訓練量化 (VPTQ)。我們使用二階最佳化來制定 LLM VQ 問題，並透過求解最佳化來引導我們的量化演算法設計。我們進一步使用通道無關二階最佳化來改善權重，以進行細緻的 VQ。此外，透過分解最佳化問題，我們提出了一個簡短且有效的碼本初始化演算法。我們也擴充 VPTQ 以支援殘差和離群值量化，這能提升模型準確度並進一步壓縮模型。我們的實驗結果顯示，VPTQ 在 2 位元時，將 LLaMA-2 的模型量化困惑度降低了 $0.01$-$0.34$，Mistral-7B 降低了 $0.38$-$0.68$，LLaMA-3 降低了 $4.41$-$7.34$，優於 SOTA，平均準確度提升了 LLaMA-2 的 $0.79$-$1.5\\%$，Mistral-7B 的 $1\\%$，LLaMA-3 的 $11$-$22\\%$（平均而言）。我們僅利用了量化演算法執行時間的 $10.4$-$18.6\\%$，與 SOTA 相比，推論吞吐量增加了 $1.6$-$1.8\\times$。</paragraph>", "author": "Yifei Liu et.al.", "authors": "Yifei Liu, Jicheng Wen, Yang Wang, Shengyu Ye, Li Lyna Zhang, Ting Cao, Cheng Li, Mao Yang", "id": "2409.17066v1", "paper_url": "http://arxiv.org/abs/2409.17066v1", "repo": "https://github.com/microsoft/vptq"}}