{"2406.17378": {"publish_time": "2024-06-25", "title": "A Text is Worth Several Tokens: Text Embedding from LLMs Secretly Aligns Well with The Key Tokens", "paper_summary": "Text embeddings from large language models (LLMs) have achieved excellent\nresults in tasks such as information retrieval, semantic textual similarity,\netc. In this work, we show an interesting finding: when feeding a text into the\nembedding LLMs, the obtained text embedding will be able to be aligned with the\nkey tokens in the input text. We first fully analyze this phenomenon on eight\nembedding LLMs and show that this phenomenon is universal and is not affected\nby model architecture, training strategy, and embedding method. With a deeper\nanalysis, we then find that the main change in embedding space between the\nembedding LLMs and their original generative LLMs is in the first principal\ncomponent. By adjusting the first principal component, we can align text\nembedding with the key tokens. Finally, we give several examples to demonstrate\nthe vast application potential of this finding: (1) we propose a simple and\npractical sparse retrieval method based on the aligned tokens, which can\nachieve 80\\% of the dense retrieval effect of the same model while reducing the\ncomputation significantly; (2) we show that our findings provide a fresh\nperspective to help understand fuzzy concepts (e.g., semantic relatedness vs.\nsemantic similarity) and emerging technologies (e.g., instruction-following\nembedding) in this field.", "paper_summary_zh": "大型語言模型 (LLM) 的文字嵌入在資訊檢索、語義文字相似度等任務中獲得了極佳的結果。在本文中，我們展示了一個有趣的發現：當將文字輸入嵌入式 LLM 時，獲得的文字嵌入將能夠與輸入文字中的關鍵標記對齊。我們首先在八個嵌入式 LLM 上全面分析了此現象，並表明此現象是普遍的，不受模型架構、訓練策略和嵌入方法的影響。透過更深入的分析，我們發現嵌入式 LLM 與其原始生成式 LLM 之間嵌入空間的主要變化在於第一主成分。透過調整第一主成分，我們可以將文字嵌入與關鍵標記對齊。最後，我們舉了幾個例子來說明此發現的廣泛應用潛力：(1) 我們提出一個基於對齊標記的簡單且實用的稀疏檢索方法，它可以在顯著降低運算量的同時，達到相同模型 80% 的稠密檢索效果；(2) 我們展示我們的發現提供了一個新的觀點，有助於理解此領域中的模糊概念（例如，語義相關性與語義相似性）和新興技術（例如，遵循指令的嵌入）。", "author": "Zhijie Nie et.al.", "authors": "Zhijie Nie, Richong Zhang, Zhanyu Wu", "id": "2406.17378v1", "paper_url": "http://arxiv.org/abs/2406.17378v1", "repo": "null"}}