{"2406.10031": {"publish_time": "2024-06-14", "title": "Intepretative Deep Learning using Domain Adaptation for Fluorescence Spectroscopy", "paper_summary": "Fluorescence spectroscopy is a fundamental tool in life sciences and\nchemistry, widely used for applications such as environmental monitoring, food\nquality control, and biomedical diagnostics. However, analysis of spectroscopic\ndata with deep learning, in particular of fluorescence excitation-emission\nmatrices (EEMs), presents significant challenges due mainly to the typically\nsmall and sparse datasets available. Furthermore, the analysis of EEMs is\ndifficult due to their high dimensionality and overlapping spectral features.\nThis study proposes a new approach that exploits domain adaptation with\npretrained vision models, alongside a novel interpretability algorithm to\naddress these challenges. Thanks to specialised feature engineering of the\nneural networks described in this work, we are now able to provide deeper and\nmeaningful insights into the physico-chemical processes underlying the data.\nThe proposed approach is demonstrated through the analysis of the oxidation\nprocess in extra virgin olive oil (EVOO), showing its effectiveness in\npredicting quality indicators and identifying relevant spectral bands. This\nwork describes significantly innovative results in the use of deep learning for\nspectroscopy, transforming it from a black box into a tool for understanding\ncomplex biological and chemical processes.", "paper_summary_zh": "螢光光譜法是生命科學和化學中的一項基本工具，廣泛用於環境監測、食品品質控管和生物醫學診斷等應用中。然而，光譜資料的分析使用深度學習，特別是螢光激發發射矩陣 (EEM)，由於通常可取得的資料集小且稀疏，因此會產生重大挑戰。此外，由於 EEM 的高維度和重疊的光譜特徵，因此分析 EEM 十分困難。本研究提出了一種新的方法，利用預訓練視覺模型的領域適應，以及一種新穎的可解釋性演算法來解決這些挑戰。由於本研究中描述的神經網路的專業特徵工程，我們現在能夠提供更深入且有意義的見解，了解資料背後的物理化學過程。所提出的方法透過分析特級初榨橄欖油 (EVOO) 的氧化過程來證明，顯示其在預測品質指標和識別相關光譜波段方面的有效性。本研究描述了光譜學中使用深度學習的顯著創新成果，將其從黑盒子轉變為一種理解複雜生物和化學過程的工具。", "author": "Umberto Michelucci et.al.", "authors": "Umberto Michelucci, Francesca Venturini", "id": "2406.10031v1", "paper_url": "http://arxiv.org/abs/2406.10031v1", "repo": "null"}}