{"2406.09205": {"publish_time": "2024-06-13", "title": "ReadCtrl: Personalizing text generation with readability-controlled instruction learning", "paper_summary": "Content generation conditioning on users's readability is an important\napplication for personalization. In an era of large language models (LLMs),\nreadability-controlled text generation based on LLMs has become increasingly\nimportant. This paper introduces a novel methodology called\n\"Readability-Controlled Instruction Learning (ReadCtrl),\" which aims to\ninstruction-tune LLMs to tailor users' readability levels. Unlike the\ntraditional methods, which primarily focused on categorical readability\nadjustments typically classified as high, medium, and low or expert and\nlayperson levels with limited success, ReadCtrl introduces a dynamic framework\nthat enables LLMs to generate content at various (near continuous level)\ncomplexity levels, thereby enhancing their versatility across different\napplications. Our results show that the ReadCtrl-Mistral-7B models\nsignificantly outperformed strong baseline models such as GPT-4 and Claude-3,\nwith a win rate of 52.1%:35.7% against GPT-4 in human evaluations. Furthermore,\nRead-Ctrl has shown significant improvements in automatic evaluations, as\nevidenced by better readability metrics (e.g., FOG, FKGL) and generation\nquality metrics (e.g., BLEU, SARI, SummaC-Factuality, UniEval-Consistency and\nCoherence). These results underscore Read-Ctrl's effectiveness and tenacity in\nproducing high-quality, contextually appropriate outputs that closely align\nwith targeted readability levels, marking a significant advancement in\npersonalized content generation using LLMs.", "paper_summary_zh": "內容生成依賴於使用者的可讀性，對個人化來說是一個重要的應用。在大語言模型（LLM）的時代，基於 LLM 的可讀性控制文本生成變得越來越重要。本文介紹了一種名為「可讀性控制指令學習（ReadCtrl）」的新方法，旨在對 LLM 進行指令微調，以調整使用者的可讀性等級。與傳統方法不同，傳統方法主要關注分類的可讀性調整，通常分類為高、中、低或專家和非專業人士等級，且成功有限，ReadCtrl 導入了一個動態架構，使 LLM 能夠生成各種（近乎連續等級）複雜程度的內容，從而增強其在不同應用中的多功能性。我們的結果顯示，ReadCtrl-Mistral-7B 模型顯著優於 GPT-4 和 Claude-3 等強大的基準模型，在人類評估中以 52.1%:35.7% 擊敗 GPT-4。此外，Read-Ctrl 在自動評估中也顯示出顯著的改進，這從更好的可讀性指標（例如 FOG、FKGL）和生成品質指標（例如 BLEU、SARI、SummaC-Factuality、UniEval-Consistency 和 Coherence）中可以得到證明。這些結果強調了 Read-Ctrl 在產生高品質、符合脈絡的輸出方面的有效性和韌性，這些輸出與目標可讀性等級緊密對齊，標誌著使用 LLM 進行個人化內容生成方面的一項重大進展。", "author": "Hieu Tran et.al.", "authors": "Hieu Tran, Zonghai Yao, Lingxi Li, Hong Yu", "id": "2406.09205v1", "paper_url": "http://arxiv.org/abs/2406.09205v1", "repo": "null"}}