{"2407.16789": {"publish_time": "2024-07-23", "title": "What Matters in Range View 3D Object Detection", "paper_summary": "Lidar-based perception pipelines rely on 3D object detection models to\ninterpret complex scenes. While multiple representations for lidar exist, the\nrange-view is enticing since it losslessly encodes the entire lidar sensor\noutput. In this work, we achieve state-of-the-art amongst range-view 3D object\ndetection models without using multiple techniques proposed in past range-view\nliterature. We explore range-view 3D object detection across two modern\ndatasets with substantially different properties: Argoverse 2 and Waymo Open.\nOur investigation reveals key insights: (1) input feature dimensionality\nsignificantly influences the overall performance, (2) surprisingly, employing a\nclassification loss grounded in 3D spatial proximity works as well or better\ncompared to more elaborate IoU-based losses, and (3) addressing non-uniform\nlidar density via a straightforward range subsampling technique outperforms\nexisting multi-resolution, range-conditioned networks. Our experiments reveal\nthat techniques proposed in recent range-view literature are not needed to\nachieve state-of-the-art performance. Combining the above findings, we\nestablish a new state-of-the-art model for range-view 3D object detection --\nimproving AP by 2.2% on the Waymo Open dataset while maintaining a runtime of\n10 Hz. We establish the first range-view model on the Argoverse 2 dataset and\noutperform strong voxel-based baselines. All models are multi-class and\nopen-source. Code is available at\nhttps://github.com/benjaminrwilson/range-view-3d-detection.", "paper_summary_zh": "<paragraph>基於雷射雷達的感知管道依賴 3D 物件偵測模型來詮釋複雜場景。雖然雷射雷達有多種表示法，但距離視圖很誘人，因為它無損地編碼了整個雷射雷達感測器輸出。在這項工作中，我們在距離視圖 3D 物件偵測模型中達到了最先進的技術，而沒有使用過去距離視圖文獻中提出的多種技術。我們探索了兩個性質截然不同的現代數據集中的距離視圖 3D 物件偵測：Argoverse 2 和 Waymo Open。我們的調查揭示了關鍵見解：(1) 輸入特徵維度顯著影響整體效能，(2) 令人驚訝的是，採用基於 3D 空間鄰近性的分類損失與更精細的基於 IoU 的損失相比效果一樣好，甚至更好，以及 (3) 透過直接的範圍子抽樣技術解決非均勻雷射雷達密度，其效能優於現有的多解析度、範圍條件化網路。我們的實驗揭示，最近距離視圖文獻中提出的技術並不需要達到最先進的效能。結合上述發現，我們為距離視圖 3D 物件偵測建立了一個新的最先進模型，同時在 Waymo Open 數據集上將 AP 提升了 2.2%，同時維持 10 Hz 的執行時間。我們在 Argoverse 2 數據集上建立了第一個距離視圖模型，並且優於強大的基於體素的基準。所有模型都是多類別的，且為開源。程式碼可在 https://github.com/benjaminrwilson/range-view-3d-detection 取得。</paragraph>", "author": "Benjamin Wilson et.al.", "authors": "Benjamin Wilson, Nicholas Autio Mitchell, Jhony Kaesemodel Pontes, James Hays", "id": "2407.16789v1", "paper_url": "http://arxiv.org/abs/2407.16789v1", "repo": "https://github.com/benjaminrwilson/range-view-3d-detection"}}