{"2406.10292": {"publish_time": "2024-06-13", "title": "Automatically Labeling $200B Life-Saving Datasets: A Large Clinical Trial Outcome Benchmark", "paper_summary": "The global cost of drug discovery and development exceeds $200 billion\nannually. The main results of drug discovery and development are the outcomes\nof clinical trials, which directly influence the regulatory approval of new\ndrug candidates and ultimately affect patient outcomes. Despite their\nsignificance, large-scale, high-quality clinical trial outcome data are not\nreadily available to the public. Suppose a large clinical trial outcome dataset\nis provided; machine learning researchers can potentially develop accurate\nprediction models using past trials and outcome labels, which could help\nprioritize and optimize therapeutic programs, ultimately benefiting patients.\nThis paper introduces Clinical Trial Outcome (CTO) dataset, the largest trial\noutcome dataset with around 479K clinical trials, aggregating outcomes from\nmultiple sources of weakly supervised labels, minimizing the noise from\nindividual sources, and eliminating the need for human annotation. These\nsources include large language model (LLM) decisions on trial-related\ndocuments, news headline sentiments, stock prices of trial sponsors, trial\nlinkages across phases, and other signals such as patient dropout rates and\nadverse events. CTO's labels show unprecedented agreement with supervised\nclinical trial outcome labels from test split of the supervised TOP dataset,\nwith a 91 F1.", "paper_summary_zh": "全球藥物發現和開發的成本每年超過 2000 億美元。藥物發現和開發的主要成果是臨床試驗的結果，它直接影響新藥候選者的法規核准，並最終影響患者的結果。儘管它們很重要，但大型、高品質的臨床試驗結果數據並不容易讓公眾取得。假設提供了大型臨床試驗結果數據集；機器學習研究人員有可能使用過去的試驗和結果標籤開發準確的預測模型，這有助於優先考慮和最佳化治療計畫，最終使患者受益。本文介紹了臨床試驗結果 (CTO) 數據集，這是最大的試驗結果數據集，包含約 479K 個臨床試驗，彙總了來自多個來源的弱監督標籤的結果，最大限度地減少了來自個別來源的雜訊，並消除了人工註解的需要。這些來源包括大型語言模型 (LLM) 對試驗相關文件的決定、新聞標題情緒、試驗贊助商的股票價格、跨階段試驗連結，以及其他信號，例如患者輟學率和不良事件。CTO 的標籤顯示出與來自監督式 TOP 數據集測試分割的監督式臨床試驗結果標籤前所未有的吻合度，F1 為 91。", "author": "Chufan Gao et.al.", "authors": "Chufan Gao, Jathurshan Pradeepkumar, Trisha Das, Shivashankar Thati, Jimeng Sun", "id": "2406.10292v1", "paper_url": "http://arxiv.org/abs/2406.10292v1", "repo": "null"}}