{"2406.07289": {"publish_time": "2024-06-11", "title": "Can We Achieve High-quality Direct Speech-to-Speech Translation without Parallel Speech Data?", "paper_summary": "Recently proposed two-pass direct speech-to-speech translation (S2ST) models\ndecompose the task into speech-to-text translation (S2TT) and text-to-speech\n(TTS) within an end-to-end model, yielding promising results. However, the\ntraining of these models still relies on parallel speech data, which is\nextremely challenging to collect. In contrast, S2TT and TTS have accumulated a\nlarge amount of data and pretrained models, which have not been fully utilized\nin the development of S2ST models. Inspired by this, in this paper, we first\nintroduce a composite S2ST model named ComSpeech, which can seamlessly\nintegrate any pretrained S2TT and TTS models into a direct S2ST model.\nFurthermore, to eliminate the reliance on parallel speech data, we propose a\nnovel training method ComSpeech-ZS that solely utilizes S2TT and TTS data. It\naligns representations in the latent space through contrastive learning,\nenabling the speech synthesis capability learned from the TTS data to\ngeneralize to S2ST in a zero-shot manner. Experimental results on the CVSS\ndataset show that when the parallel speech data is available, ComSpeech\nsurpasses previous two-pass models like UnitY and Translatotron 2 in both\ntranslation quality and decoding speed. When there is no parallel speech data,\nComSpeech-ZS lags behind \\name by only 0.7 ASR-BLEU and outperforms the\ncascaded models.", "paper_summary_zh": "<paragraph>最近提出的兩階段直接語音轉語音翻譯 (S2ST) 模型\n將任務分解為語音轉文字翻譯 (S2TT) 和文字轉語音\n(TTS)，在端到端模型中產生令人滿意的結果。然而，這些模型的\n訓練依舊仰賴平行語音資料，而這類資料極難收集。相較之下，S2TT 和 TTS 已累積了\n大量的資料和預訓練模型，而這些資料和模型在 S2ST 模型的開發中尚未得到充分利用\n受到這點啟發，我們在本文中首先介紹一個名為 ComSpeech 的複合式 S2ST 模型，它可以將任何預訓練的 S2TT 和 TTS 模型無縫整合到直接的 S2ST 模型中。\n此外，為了不再依賴平行語音資料，我們提出了一種新穎的訓練方法 ComSpeech-ZS，它僅利用 S2TT 和 TTS 資料。它透過對比學習在潛在空間中比對表徵，\n讓從 TTS 資料中學習到的語音合成能力能夠以零次學習的方式推廣到 S2ST。在 CVSS\n資料集上的實驗結果顯示，當平行語音資料可用時，ComSpeech\n在翻譯品質和解碼速度上都超越了先前的兩階段模型，例如 UnitY 和 Translatotron 2。當沒有平行語音資料時，\nComSpeech-ZS 僅落後 \\name 0.7 ASR-BLEU，且表現優於串接模型。</paragraph>", "author": "Qingkai Fang et.al.", "authors": "Qingkai Fang, Shaolei Zhang, Zhengrui Ma, Min Zhang, Yang Feng", "id": "2406.07289v1", "paper_url": "http://arxiv.org/abs/2406.07289v1", "repo": "null"}}