{"2412.14613": {"publish_time": "2024-12-19", "title": "HarmonicEval: Multi-modal, Multi-task, Multi-criteria Automatic Evaluation Using a Vision Language Model", "paper_summary": "Vision-language models (VLMs) have shown impressive abilities in text and\nimage understanding. However, existing metrics for evaluating the text\ngenerated by VLMs focus exclusively on overall quality, leading to two\nlimitations: 1) it is challenging to identify which aspects of the text need\nimprovement from the overall score; 2) metrics may overlook specific evaluation\ncriteria when predicting an overall score. To address these limitations, we\npropose HarmonicEval, a reference-free evaluation metric that aggregates\ncriterion-wise scores to produce the overall score in a bottom-up manner.\nFurthermore, we construct the Multi-task Multi-criteria Human Evaluation (MMHE)\ndataset, which comprises 18,000 expert human judgments across four\nvision-language tasks. Our experiments demonstrate that HarmonicEval achieves\nhigher correlations with human judgments than conventional metrics while\nproviding numerical scores for each criterion.", "paper_summary_zh": "視覺語言模型 (VLM) 在文本和影像理解方面展現了令人印象深刻的能力。然而，現有的用於評估 VLM 所產生文本的指標只專注於整體品質，導致產生了兩個限制：1) 從整體分數中找出文本哪些方面需要改進是一項挑戰；2) 指標在預測整體分數時可能會忽略特定的評量標準。為了解決這些限制，我們提出了 HarmonicEval，這是一種無參考評量指標，它以自下而上的方式彙總準則明智的分數以產生整體分數。此外，我們建構了多任務多準則人類評量 (MMHE) 資料集，其中包含了四個視覺語言任務中 18,000 個專家人類判斷。我們的實驗證明，HarmonicEval 與人類判斷的相關性高於傳統指標，同時為每個準則提供數值分數。", "author": "Masanari Ohi et.al.", "authors": "Masanari Ohi, Masahiro Kaneko, Naoaki Okazaki, Nakamasa Inoue", "id": "2412.14613v1", "paper_url": "http://arxiv.org/abs/2412.14613v1", "repo": "null"}}