{"2505.01305": {"publish_time": "2025-05-02", "title": "Early Detection of Patient Deterioration from Real-Time Wearable Monitoring System", "paper_summary": "Early detection of patient deterioration is crucial for reducing mortality\nrates. Heart rate data has shown promise in assessing patient health, and\nwearable devices offer a cost-effective solution for real-time monitoring.\nHowever, extracting meaningful insights from diverse heart rate data and\nhandling missing values in wearable device data remain key challenges. To\naddress these challenges, we propose TARL, an innovative approach that models\nthe structural relationships of representative subsequences, known as\nshapelets, in heart rate time series. TARL creates a shapelet-transition\nknowledge graph to model shapelet dynamics in heart rate time series,\nindicating illness progression and potential future changes. We further\nintroduce a transition-aware knowledge embedding to reinforce relationships\namong shapelets and quantify the impact of missing values, enabling the\nformulation of comprehensive heart rate representations. These representations\ncapture explanatory structures and predict future heart rate trends, aiding\nearly illness detection. We collaborate with physicians and nurses to gather\nICU patient heart rate data from wearables and diagnostic metrics assessing\nillness severity for evaluating deterioration. Experiments on real-world ICU\ndata demonstrate that TARL achieves both high reliability and early detection.\nA case study further showcases TARL's explainable detection process,\nhighlighting its potential as an AI-driven tool to assist clinicians in\nrecognizing early signs of patient deterioration.", "paper_summary_zh": "<paragraph>早期發現病人惡化對於降低死亡率至關重要。心率數據在評估病人健康狀況方面已展現出其潛力，而穿戴式裝置則提供了一種具有成本效益的即時監測解決方案。然而，從不同的心率數據中提取有意義的見解，以及處理穿戴式裝置數據中缺失的值仍然是關鍵挑戰。為了應對這些挑戰，我們提出了 TARL，這是一種創新的方法，用於對心率時間序列中具有代表性的子序列（稱為 shapelet）的結構關係進行建模。TARL 建立了一個 shapelet 轉換知識圖譜來模擬心率時間序列中的 shapelet 動態，指示疾病進展和潛在的未來變化。我們進一步引入了轉換感知知識嵌入，以強化 shapelet 之間的關係並量化缺失值的影響，從而形成全面的心率表徵。這些表徵可以捕捉解釋性結構並預測未來的心率趨勢，有助於早期發現疾病。我們與醫生和護士合作，收集來自穿戴式裝置的 ICU 病人心率數據和評估疾病嚴重程度的診斷指標，以評估病情惡化。真實世界 ICU 數據的實驗表明，TARL 具有高可靠性和早期檢測能力。一個案例研究進一步展示了 TARL 可解釋的檢測過程，突出了其作為人工智慧驅動工具的潛力，可協助臨床醫生識別病人惡化的早期跡象。</paragraph>\n", "author": "Lo Pang-Yun Ting et.al.", "authors": "Lo Pang-Yun Ting, Hong-Pei Chen, An-Shan Liu, Chun-Yin Yeh, Po-Lin Chen, Kun-Ta Chuang", "id": "2505.01305v1", "paper_url": "http://arxiv.org/abs/2505.01305v1", "repo": "null"}}