{"2408.11619": {"publish_time": "2024-08-21", "title": "Data-driven Modeling of Combined Sewer Systems for Urban Sustainability: An Empirical Evaluation", "paper_summary": "Climate change poses complex challenges, with extreme weather events becoming\nincreasingly frequent and difficult to model. Examples include the dynamics of\nCombined Sewer Systems (CSS). Overburdened CSS during heavy rainfall will\noverflow untreated wastewater into surface water bodies. Classical approaches\nto modeling the impact of extreme rainfall events rely on physical simulations,\nwhich are particularly challenging to create for large urban infrastructures.\nDeep Learning (DL) models offer a cost-effective alternative for modeling the\ncomplex dynamics of sewer systems. In this study, we present a comprehensive\nempirical evaluation of several state-of-the-art DL time series models for\npredicting sewer system dynamics in a large urban infrastructure, utilizing\nthree years of measurement data. We especially investigate the potential of DL\nmodels to maintain predictive precision during network outages by comparing\nglobal models, which have access to all variables within the sewer system, and\nlocal models, which are limited to data from a restricted set of local sensors.\nOur findings demonstrate that DL models can accurately predict the dynamics of\nsewer system load, even under network outage conditions. These results suggest\nthat DL models can effectively aid in balancing the load redistribution in CSS,\nthereby enhancing the sustainability and resilience of urban infrastructures.", "paper_summary_zh": "氣候變遷帶來複雜的挑戰，極端天氣事件變得越來越頻繁且難以建模。舉例來說，下水道系統 (CSS) 的動態。強降雨時，負擔過重的 CSS 會使未經處理的廢水溢流到地表水體中。模擬極端降雨事件影響的傳統方法依賴於物理模擬，而這對於大型城市基礎設施來說特別難以建立。深度學習 (DL) 模型為模擬下水道系統的複雜動態提供了一個具有成本效益的替代方案。在本研究中，我們對幾個最先進的 DL 時間序列模型進行了全面的經驗評估，以預測大型城市基礎設施中的下水道系統動態，利用三年的測量數據。我們特別研究了 DL 模型在網路中斷期間維持預測精度的潛力，方法是比較全局模型（可以存取下水道系統中的所有變數）和局部模型（僅限於來自一組受限的局部感測器的資料）。我們的研究結果表明，DL 模型可以準確預測下水道系統負載的動態，即使在網路中斷的情況下也是如此。這些結果表明，DL 模型可以有效地幫助平衡 CSS 中的負載重新分配，從而增強城市基礎設施的可持續性和韌性。", "author": "Vipin Singh et.al.", "authors": "Vipin Singh, Tianheng Ling, Teodor Chiaburu, Felix Biessmann", "id": "2408.11619v1", "paper_url": "http://arxiv.org/abs/2408.11619v1", "repo": "null"}}