{"2410.10336": {"publish_time": "2024-10-14", "title": "CoMAT: Chain of Mathematically Annotated Thought Improves Mathematical Reasoning", "paper_summary": "Mathematical reasoning remains a significant challenge for large language\nmodels (LLMs), despite progress in prompting techniques such as\nChain-of-Thought (CoT). We present Chain of Mathematically Annotated Thought\n(CoMAT), which enhances reasoning through two stages: Symbolic Conversion\n(converting natural language queries into symbolic form) and Reasoning\nExecution (deriving answers from symbolic representations). CoMAT operates\nentirely with a single LLM and without external solvers. Across four LLMs,\nCoMAT outperforms traditional CoT on six out of seven benchmarks, achieving\ngains of 4.48% on MMLU-Redux (MATH) and 4.58% on GaoKao MCQ. In addition to\nimproved performance, CoMAT ensures faithfulness and verifiability, offering a\ntransparent reasoning process for complex mathematical tasks", "paper_summary_zh": "儘管在提示技術（例如思想鏈（CoT））方面取得進展，數學推理對於大型語言模型（LLM）而言仍然是一項重大的挑戰。我們提出數學標記思想鏈（CoMAT），它透過兩個階段增強推理：符號轉換（將自然語言查詢轉換成符號形式）和推理執行（從符號表示中推導出答案）。CoMAT 完全使用單一 LLM，且不使用外部求解器。在四個 LLM 中，CoMAT 在七個基準中的六個基準上優於傳統 CoT，在 MMLU-Redux（MATH）上獲得 4.48% 的增益，在高考選擇題上獲得 4.58% 的增益。除了效能提升之外，CoMAT 確保了忠實度和可驗證性，為複雜的數學任務提供了透明的推理過程", "author": "Joshua Ong Jun Leang et.al.", "authors": "Joshua Ong Jun Leang, Aryo Pradipta Gema, Shay B. Cohen", "id": "2410.10336v1", "paper_url": "http://arxiv.org/abs/2410.10336v1", "repo": "null"}}