{"2409.05368": {"publish_time": "2024-09-09", "title": "Application Specific Compression of Deep Learning Models", "paper_summary": "Large Deep Learning models are compressed and deployed for specific\napplications. However, current Deep Learning model compression methods do not\nutilize the information about the target application. As a result, the\ncompressed models are application agnostic. Our goal is to customize the model\ncompression process to create a compressed model that will perform better for\nthe target application. Our method, Application Specific Compression (ASC),\nidentifies and prunes components of the large Deep Learning model that are\nredundant specifically for the given target application. The intuition of our\nwork is to prune the parts of the network that do not contribute significantly\nto updating the data representation for the given application. We have\nexperimented with the BERT family of models for three applications: Extractive\nQA, Natural Language Inference, and Paraphrase Identification. We observe that\ncustomized compressed models created using ASC method perform better than\nexisting model compression methods and off-the-shelf compressed models.", "paper_summary_zh": "大型深度學習模型會被壓縮並部署於特定應用程式中。然而，目前的深度學習模型壓縮方法並未利用目標應用程式的資訊。因此，壓縮後的模型與應用程式無關。我們的目標是客製化模型壓縮流程，以建立一個壓縮後的模型，該模型的效能將針對目標應用程式而提升。我們的 Application Specific Compression (ASC) 方法會找出並移除大型深度學習模型中的組件，而這些組件對於給定的目標應用程式來說是多餘的。我們工作的直覺是移除對給定應用程式資料表徵更新沒有顯著貢獻的網路部分。我們針對三種應用程式測試了 BERT 系列模型：萃取式問答、自然語言推論和同義詞辨識。我們觀察到，使用 ASC 方法建立的客製化壓縮模型的效能優於現有的模型壓縮方法和現成的壓縮模型。", "author": "Rohit Raj Rai et.al.", "authors": "Rohit Raj Rai, Angana Borah, Amit Awekar", "id": "2409.05368v1", "paper_url": "http://arxiv.org/abs/2409.05368v1", "repo": "null"}}