{"2412.04141": {"publish_time": "2024-12-05", "title": "Reducing Tool Hallucination via Reliability Alignment", "paper_summary": "Large Language Models (LLMs) have extended their capabilities beyond language\ngeneration to interact with external systems through tool calling, offering\npowerful potential for real-world applications. However, the phenomenon of tool\nhallucinations, which occur when models improperly select or misuse tools,\npresents critical challenges that can lead to flawed task execution and\nincreased operational costs. This paper investigates the concept of reliable\ntool calling and highlights the necessity of addressing tool hallucinations. We\nsystematically categorize tool hallucinations into two main types: tool\nselection hallucination and tool usage hallucination. To mitigate these issues,\nwe propose a reliability-focused alignment framework that enhances the model's\nability to accurately assess tool relevance and usage. By proposing a suite of\nevaluation metrics and evaluating on StableToolBench, we further demonstrate\nthe effectiveness of our framework in mitigating tool hallucination and\nimproving the overall system reliability of LLM tool calling.", "paper_summary_zh": "大型語言模型 (LLM) 已將其功能從語言生成擴展到透過工具呼叫與外部系統互動，為真實世界的應用提供了強大的潛力。然而，工具幻覺的現象，即模型不適當地選擇或誤用工具時發生，會造成重大的挑戰，可能導致任務執行有缺陷和營運成本增加。本文探討可靠工具呼叫的概念，並強調解決工具幻覺的必要性。我們系統性地將工具幻覺分類為兩種主要類型：工具選擇幻覺和工具使用幻覺。為了減輕這些問題，我們提出一個以可靠性為中心的對齊架構，以增強模型準確評估工具相關性和使用情況的能力。透過提出評估指標組並在 StableToolBench 上進行評估，我們進一步證明了我們的架構在減輕工具幻覺和改善 LLM 工具呼叫的整體系統可靠性方面的有效性。", "author": "Hongshen Xu et.al.", "authors": "Hongshen Xu, Su Zhu, Zihan Wang, Hang Zheng, Da Ma, Ruisheng Cao, Shuai Fan, Lu Chen, Kai Yu", "id": "2412.04141v1", "paper_url": "http://arxiv.org/abs/2412.04141v1", "repo": "null"}}