{"2412.18196": {"publish_time": "2024-12-24", "title": "Robustness-aware Automatic Prompt Optimization", "paper_summary": "The performance of Large Language Models (LLMs) is based on the quality of\nthe prompts and the semantic and structural integrity information of the input\ndata. However, current prompt generation methods primarily focus on generating\nprompts for clean input data, often overlooking the impact of perturbed inputs\non prompt performance. To address this limitation, we propose BATprompt (By\nAdversarial Training prompt), a novel method for prompt generation designed to\nwithstand input perturbations (such as typos in the input). Inspired by\nadversarial training techniques, BATprompt demonstrates strong performance on a\nvariety of perturbed tasks through a two-step process: adversarial perturbation\nand iterative optimization on unperturbed input via LLM. Unlike conventional\nadversarial attack methods, BATprompt avoids reliance on real gradients or\nmodel parameters. Instead, it leverages the advanced reasoning, language\nunderstanding and self reflection capabilities of LLMs to simulate gradients,\nguiding the generation of adversarial perturbations and optimizing prompt\nperformance. In our experiments, we evaluate BATprompt on multiple datasets\nacross both language understanding and generation tasks. The results indicate\nthat BATprompt outperforms existing prompt generation methods, delivering\nsuperior robustness and performance under diverse perturbation scenarios.", "paper_summary_zh": "大型語言模型 (LLM) 的效能取決於提示的品質，以及輸入資料的語意和結構完整性資訊。然而，目前的提示產生方法主要專注於為乾淨的輸入資料產生提示，常常忽略擾動輸入對提示效能的影響。為了解決這個限制，我們提出 BATprompt（對抗訓練提示），這是一種新穎的提示產生方法，旨在承受輸入擾動（例如輸入中的錯字）。受到對抗訓練技術的啟發，BATprompt 透過一個兩步驟的過程在各種擾動任務上展現強大的效能：對抗擾動和透過 LLM 對未擾動輸入進行反覆最佳化。與傳統的對抗攻擊方法不同，BATprompt 避免依賴真實梯度或模型參數。相反地，它利用 LLM 的進階推理、語言理解和自我反省能力來模擬梯度，引導對抗擾動的產生並最佳化提示效能。在我們的實驗中，我們在跨語言理解和產生任務的多個資料集上評估 BATprompt。結果表明，BATprompt 優於現有的提示產生方法，在不同的擾動場景下提供卓越的穩健性和效能。", "author": "Zeru Shi et.al.", "authors": "Zeru Shi, Zhenting Wang, Yongye Su, Weidi Luo, Fan Yang, Yongfeng Zhang", "id": "2412.18196v1", "paper_url": "http://arxiv.org/abs/2412.18196v1", "repo": "https://github.com/vanpe20/BATprompt"}}