{"2408.14718": {"publish_time": "2024-08-27", "title": "Residual-based Adaptive Huber Loss (RAHL) -- Design of an improved Huber loss for CQI prediction in 5G networks", "paper_summary": "The Channel Quality Indicator (CQI) plays a pivotal role in 5G networks,\noptimizing infrastructure dynamically to ensure high Quality of Service (QoS).\nRecent research has focused on improving CQI estimation in 5G networks using\nmachine learning. In this field, the selection of the proper loss function is\ncritical for training an accurate model. Two commonly used loss functions are\nMean Squared Error (MSE) and Mean Absolute Error (MAE). Roughly speaking, MSE\nput more weight on outliers, MAE on the majority. Here, we argue that the Huber\nloss function is more suitable for CQI prediction, since it combines the\nbenefits of both MSE and MAE. To achieve this, the Huber loss transitions\nsmoothly between MSE and MAE, controlled by a user-defined hyperparameter\ncalled delta. However, finding the right balance between sensitivity to small\nerrors (MAE) and robustness to outliers (MSE) by manually choosing the optimal\ndelta is challenging. To address this issue, we propose a novel loss function,\nnamed Residual-based Adaptive Huber Loss (RAHL). In RAHL, a learnable residual\nis added to the delta, enabling the model to adapt based on the distribution of\nerrors in the data. Our approach effectively balances model robustness against\noutliers while preserving inlier data precision. The widely recognized Long\nShort-Term Memory (LSTM) model is employed in conjunction with RAHL, showcasing\nsignificantly improved results compared to the aforementioned loss functions.\nThe obtained results affirm the superiority of RAHL, offering a promising\navenue for enhanced CQI prediction in 5G networks.", "paper_summary_zh": "信道品質指標 (CQI) 在 5G 網路中扮演著舉足輕重的角色，動態地最佳化基礎建設以確保高品質的服務 (QoS)。最近的研究已專注於使用機器學習來改善 5G 網路中的 CQI 估計。在此領域中，適當損失函數的選擇對於訓練準確的模型至關重要。兩個常用的損失函數是均方誤差 (MSE) 和平均絕對誤差 (MAE)。粗略來說，MSE 較重視異常值，MAE 則重視多數值。在此，我們主張 Huber 損失函數更適合 CQI 預測，因為它結合了 MSE 和 MAE 的優點。為達成此目的，Huber 損失在 MSE 和 MAE 之間平滑轉換，並由稱為 delta 的使用者定義的超參數控制。然而，透過手動選擇最佳 delta 來找出對小誤差的敏感性 (MAE) 和對異常值的穩健性 (MSE) 之間的適當平衡是一項挑戰。為了解決此問題，我們提出了一種新的損失函數，稱為基於殘差的自適應 Huber 損失 (RAHL)。在 RAHL 中，一個可學習的殘差被加到 delta 中，使模型能夠根據資料中誤差的分布進行調整。我們的做法有效地平衡了模型對異常值的穩健性，同時保留了內點資料的精確度。廣受認可的長期短期記憶 (LSTM) 模型與 RAHL 結合使用，與前述損失函數相比，展示出顯著改善的結果。所獲得的結果肯定了 RAHL 的優越性，為增強 5G 網路中的 CQI 預測提供了有希望的途徑。", "author": "Mina Kaviani et.al.", "authors": "Mina Kaviani, Jurandy Almeida, Fabio L. Verdi", "id": "2408.14718v1", "paper_url": "http://arxiv.org/abs/2408.14718v1", "repo": "null"}}