{"2408.10807": {"publish_time": "2024-08-20", "title": "DisMix: Disentangling Mixtures of Musical Instruments for Source-level Pitch and Timbre Manipulation", "paper_summary": "Existing work on pitch and timbre disentanglement has been mostly focused on\nsingle-instrument music audio, excluding the cases where multiple instruments\nare presented. To fill the gap, we propose DisMix, a generative framework in\nwhich the pitch and timbre representations act as modular building blocks for\nconstructing the melody and instrument of a source, and the collection of which\nforms a set of per-instrument latent representations underlying the observed\nmixture. By manipulating the representations, our model samples mixtures with\nnovel combinations of pitch and timbre of the constituent instruments. We can\njointly learn the disentangled pitch-timbre representations and a latent\ndiffusion transformer that reconstructs the mixture conditioned on the set of\nsource-level representations. We evaluate the model using both a simple dataset\nof isolated chords and a realistic four-part chorales in the style of J.S.\nBach, identify the key components for the success of disentanglement, and\ndemonstrate the application of mixture transformation based on source-level\nattribute manipulation.", "paper_summary_zh": "現有關於音高和音色的分離工作，大多集中在單一樂器音樂音訊上，不包括呈現多種樂器的案例。為了填補這個空白，我們提出了 DisMix，一個生成框架，其中音高和音色表示作為模組化建構區塊，用於建構來源的旋律和樂器，而其集合則形成了一組潛在樂器表示，作為觀察到的混合物的基礎。透過操作表示，我們的模型會取樣具有構成樂器音高和音色新組合的混合物。我們可以共同學習分離的音高-音色表示和一個潛在擴散Transformer，該Transformer會根據一組來源層級表示重建混合物。我們使用一個簡單的孤立和弦資料集和 J.S. 巴赫風格的寫實四部合唱曲評估模型，找出分離成功的關鍵組成部分，並展示基於來源層級屬性操作的混合物轉換應用。", "author": "Yin-Jyun Luo et.al.", "authors": "Yin-Jyun Luo, Kin Wai Cheuk, Woosung Choi, Toshimitsu Uesaka, Keisuke Toyama, Koichi Saito, Chieh-Hsin Lai, Yuhta Takida, Wei-Hsiang Liao, Simon Dixon, Yuki Mitsufuji", "id": "2408.10807v1", "paper_url": "http://arxiv.org/abs/2408.10807v1", "repo": "null"}}