{"2501.10153": {"publish_time": "2025-01-17", "title": "Region-wise stacking ensembles for estimating brain-age using MRI", "paper_summary": "Predictive modeling using structural magnetic resonance imaging (MRI) data is\na prominent approach to study brain-aging. Machine learning algorithms and\nfeature extraction methods have been employed to improve predictions and\nexplore healthy and accelerated aging e.g. neurodegenerative and psychiatric\ndisorders. The high-dimensional MRI data pose challenges to building\ngeneralizable and interpretable models as well as for data privacy. Common\npractices are resampling or averaging voxels within predefined parcels, which\nreduces anatomical specificity and biological interpretability as voxels within\na region may differently relate to aging. Effectively, naive fusion by\naveraging can result in information loss and reduced accuracy. We present a\nconceptually novel two-level stacking ensemble (SE) approach. The first level\ncomprises regional models for predicting individuals' age based on voxel-wise\ninformation, fused by a second-level model yielding final predictions. Eight\ndata fusion scenarios were explored using as input Gray matter volume (GMV)\nestimates from four datasets covering the adult lifespan. Performance, measured\nusing mean absolute error (MAE), R2, correlation and prediction bias, showed\nthat SE outperformed the region-wise averages. The best performance was\nobtained when first-level regional predictions were obtained as out-of-sample\npredictions on the application site with second-level models trained on\nindependent and site-specific data (MAE=4.75 vs baseline regional mean GMV\nMAE=5.68). Performance improved as more datasets were used for training.\nFirst-level predictions showed improved and more robust aging signal providing\nnew biological insights and enhanced data privacy. Overall, the SE improves\naccuracy compared to the baseline while preserving or enhancing data privacy.", "paper_summary_zh": "利用結構性磁振造影 (MRI) 資料進行預測建模是研究大腦老化的一種重要方法。機器學習演算法和特徵萃取方法已被用於改善預測，並探討健康和加速老化，例如神經退化性和精神疾病。高維度 MRI 資料在建立可概化且可解釋的模型以及資料隱私方面構成挑戰。常見的做法是在預先定義的區塊中重新取樣或平均體素，這會降低解剖特異性和生物可解釋性，因為區域內的體素可能與老化有不同的關係。實際上，通過平均值進行樸素融合可能會導致資訊遺失和準確性降低。我們提出了一個概念上新穎的兩層堆疊集成 (SE) 方法。第一層包含區域模型，用於根據體素資訊預測個體年齡，並通過第二層模型進行融合，產生最終預測。使用來自涵蓋成年人壽命的四個資料集的灰質體積 (GMV) 估計值作為輸入，探討了八種資料融合場景。使用平均絕對誤差 (MAE)、R2、相關性和預測偏差測量的效能顯示，SE 優於區域平均值。當第一層區域預測作為應用站點上的異樣本預測獲得，而第二層模型在獨立和特定於站點的資料上進行訓練時，獲得了最佳效能 (MAE=4.75，而基線區域平均 GMV MAE=5.68)。隨著用於訓練的資料集增多，效能有所提高。第一層預測顯示出改善且更穩健的老化訊號，提供了新的生物學見解並增強了資料隱私。總體而言，SE 在保留或增強資料隱私的同時，與基線相比提高了準確性。", "author": "Georgios Antonopoulos et.al.", "authors": "Georgios Antonopoulos, Shammi More, Simon B. Eickhoff, Federico Raimondo, Kaustubh R. Patil", "id": "2501.10153v1", "paper_url": "http://arxiv.org/abs/2501.10153v1", "repo": "null"}}