{"2502.12055": {"publish_time": "2025-02-17", "title": "Designing Role Vectors to Improve LLM Inference Behaviour", "paper_summary": "The influence of personas on Large Language Models (LLMs) has been widely\nstudied, yet their direct impact on performance remains uncertain. This work\nexplores a novel approach to guiding LLM behaviour through role vectors, an\nalternative to persona-based prompting. We construct 29 role vectors derived\nfrom model activations and evaluate their impact on benchmark performance\nacross multiple domains. Our analysis investigates whether these vectors can\neffectively steer models toward domain-specific expertise. We measure two key\ninterventions: (i) activation addition, which reinforces role-specific\ndirections, and (ii) directional ablation, which removes them. Results on\nwell-established benchmarks indicate that role vectors do, in fact, influence\nmodel behaviour, improving task performance in relevant domains while\nmarginally affecting unrelated tasks. This, in turn, suggests that manipulating\ninternal model representations has a greater impact on outcomes than\npersona-based prompting.", "paper_summary_zh": "大型語言模型 (LLM) 中角色的影響已被廣泛研究，但它們對效能的直接影響仍然不確定。本研究探討了一種透過角色向量引導 LLM 行為的新方法，這是一種基於角色提示的替代方案。我們從模型激活中建構了 29 個角色向量，並評估它們對多個領域基準效能的影響。我們的分析探討了這些向量是否能有效地引導模型朝向特定領域的專業知識。我們衡量了兩個關鍵干預措施：(i) 激活新增，它加強了特定角色的方向，以及 (ii) 方向消融，它移除了這些方向。在既定基準上的結果表明，角色向量確實會影響模型行為，在相關領域中改善任務效能，同時對不相關任務的影響很小。這反過來表明，操縱內部模型表示對結果的影響比基於角色的提示更大。", "author": "Daniele Potertì et.al.", "authors": "Daniele Potertì, Andrea Seveso, Fabio Mercorio", "id": "2502.12055v1", "paper_url": "http://arxiv.org/abs/2502.12055v1", "repo": "null"}}