{"2408.08214": {"publish_time": "2024-08-15", "title": "Federated Fairness Analytics: Quantifying Fairness in Federated Learning", "paper_summary": "Federated Learning (FL) is a privacy-enhancing technology for distributed ML.\nBy training models locally and aggregating updates - a federation learns\ntogether, while bypassing centralised data collection. FL is increasingly\npopular in healthcare, finance and personal computing. However, it inherits\nfairness challenges from classical ML and introduces new ones, resulting from\ndifferences in data quality, client participation, communication constraints,\naggregation methods and underlying hardware. Fairness remains an unresolved\nissue in FL and the community has identified an absence of succinct definitions\nand metrics to quantify fairness; to address this, we propose Federated\nFairness Analytics - a methodology for measuring fairness. Our definition of\nfairness comprises four notions with novel, corresponding metrics. They are\nsymptomatically defined and leverage techniques originating from XAI,\ncooperative game-theory and networking engineering. We tested a range of\nexperimental settings, varying the FL approach, ML task and data settings. The\nresults show that statistical heterogeneity and client participation affect\nfairness and fairness conscious approaches such as Ditto and q-FedAvg\nmarginally improve fairness-performance trade-offs. Using our techniques, FL\npractitioners can uncover previously unobtainable insights into their system's\nfairness, at differing levels of granularity in order to address fairness\nchallenges in FL. We have open-sourced our work at:\nhttps://github.com/oscardilley/federated-fairness.", "paper_summary_zh": "<paragraph>聯邦學習 (FL) 是一種增強隱私的分布式機器學習技術。\n透過在本地訓練模型並彙總更新，聯盟可以共同學習，同時繞過集中式資料收集。FL 在醫療保健、金融和個人運算中越來越受歡迎。然而，它繼承了傳統機器學習的公平性挑戰，並引入了新的挑戰，這些挑戰源於資料品質、客戶端參與、通訊限制、彙總方法和基礎硬體的差異。公平性仍然是 FL 中一個尚未解決的問題，而社群已發現缺乏簡潔的定義和衡量公平性的指標；為了解決這個問題，我們提出聯邦公平性分析，一種用於衡量公平性的方法。我們對公平性的定義包含四個概念，並有新穎的對應指標。它們被症狀性地定義，並利用源自 XAI、合作博弈論和網路工程的技術。我們測試了一系列實驗設定，改變了 FL 方法、機器學習任務和資料設定。結果表明，統計異質性和客戶端參與會影響公平性，而重視公平性的方法，例如 Ditto 和 q-FedAvg，則會略微改善公平性與效能的權衡。透過使用我們的技術，FL 從業人員可以發掘以前無法獲得的對其系統公平性的見解，在不同的細化層級中，以解決 FL 中的公平性挑戰。我們已在以下位置開放原始碼：\nhttps://github.com/oscardilley/federated-fairness。</paragraph>", "author": "Oscar Dilley et.al.", "authors": "Oscar Dilley, Juan Marcelo Parra-Ullauri, Rasheed Hussain, Dimitra Simeonidou", "id": "2408.08214v1", "paper_url": "http://arxiv.org/abs/2408.08214v1", "repo": "https://github.com/oscardilley/federated-fairness"}}