{"2405.07778": {"publish_time": "2024-05-13", "title": "A Comprehensive Analysis of Static Word Embeddings for Turkish", "paper_summary": "Word embeddings are fixed-length, dense and distributed word representations\nthat are used in natural language processing (NLP) applications. There are\nbasically two types of word embedding models which are non-contextual (static)\nmodels and contextual models. The former method generates a single embedding\nfor a word regardless of its context, while the latter method produces distinct\nembeddings for a word based on the specific contexts in which it appears. There\nare plenty of works that compare contextual and non-contextual embedding models\nwithin their respective groups in different languages. However, the number of\nstudies that compare the models in these two groups with each other is very few\nand there is no such study in Turkish. This process necessitates converting\ncontextual embeddings into static embeddings. In this paper, we compare and\nevaluate the performance of several contextual and non-contextual models in\nboth intrinsic and extrinsic evaluation settings for Turkish. We make a\nfine-grained comparison by analyzing the syntactic and semantic capabilities of\nthe models separately. The results of the analyses provide insights about the\nsuitability of different embedding models in different types of NLP tasks. We\nalso build a Turkish word embedding repository comprising the embedding models\nused in this work, which may serve as a valuable resource for researchers and\npractitioners in the field of Turkish NLP. We make the word embeddings,\nscripts, and evaluation datasets publicly available.", "paper_summary_zh": "字詞嵌入是固定長度、密集且分散的字詞表示，用於自然語言處理 (NLP) 應用程式中。基本上有兩種字詞嵌入模型，分別是非語境 (靜態) 模型和語境模型。前一種方法為字詞產生單一嵌入，不論其語境為何，而後一種方法則根據字詞出現的特定語境為其產生不同的嵌入。有許多研究在不同語言中比較其各自群組中的語境和非語境嵌入模型。然而，比較這兩組中模型的研究數量非常少，而且沒有這類研究針對土耳其語。此程序需要將語境嵌入轉換成靜態嵌入。在本文中，我們比較並評估多種語境和非語境模型在土耳其語的內在和外在評估設定中的效能。我們透過個別分析模型的句法和語義能力，進行細微的比較。分析結果提供了見解，說明不同嵌入模型在不同類型的 NLP 任務中的適用性。我們還建置了一個土耳其語字詞嵌入儲存庫，包含此研究中使用的嵌入模型，這可能成為土耳其語 NLP 領域的研究人員和實務工作者的寶貴資源。我們公開提供字詞嵌入、指令碼和評估資料集。", "author": "Karahan Sarıtaş et.al.", "authors": "Karahan Sarıtaş, Cahid Arda Öz, Tunga Güngör", "id": "2405.07778v1", "paper_url": "http://arxiv.org/abs/2405.07778v1", "repo": "https://github.com/turkish-word-embeddings/word-embeddings-repository-for-turkish"}}