{"2405.04286": {"publish_time": "2024-05-07", "title": "Who Wrote This? The Key to Zero-Shot LLM-Generated Text Detection Is GECScore", "paper_summary": "The efficacy of an large language model (LLM) generated text detector depends\nsubstantially on the availability of sizable training data. White-box zero-shot\ndetectors, which require no such data, are nonetheless limited by the\naccessibility of the source model of the LLM-generated text. In this paper, we\npropose an simple but effective black-box zero-shot detection approach,\npredicated on the observation that human-written texts typically contain more\ngrammatical errors than LLM-generated texts. This approach entails computing\nthe Grammar Error Correction Score (GECScore) for the given text to distinguish\nbetween human-written and LLM-generated text. Extensive experimental results\nshow that our method outperforms current state-of-the-art (SOTA) zero-shot and\nsupervised methods, achieving an average AUROC of 98.7% and showing strong\nrobustness against paraphrase and adversarial perturbation attacks.", "paper_summary_zh": "大型語言模型 (LLM) 生成的文字偵測器的效能，在很大程度上取決於可取得大量訓練資料。白盒零次學習偵測器不需要此類資料，但仍受到 LLM 生成的文字原始模型的可取得性限制。在本文中，我們提出一個簡單但有效的黑盒零次學習偵測方法，其預設人類撰寫的文字通常包含比 LLM 生成的文字更多的語法錯誤。此方法需要計算給定文字的語法錯誤修正分數 (GECScore)，以區分人類撰寫的文字和 LLM 生成的文字。廣泛的實驗結果顯示，我們的模型優於目前最先進 (SOTA) 的零次學習和監督式方法，平均 AUROC 達到 98.7%，並在面對同義詞替換和對抗性擾動攻擊時展現出強大的穩健性。", "author": "Junchao Wu et.al.", "authors": "Junchao Wu, Runzhe Zhan, Derek F. Wong, Shu Yang, Xuebo Liu, Lidia S. Chao, Min Zhang", "id": "2405.04286v1", "paper_url": "http://arxiv.org/abs/2405.04286v1", "repo": "null"}}