{"2406.11651": {"publish_time": "2024-06-17", "title": "A Two-dimensional Zero-shot Dialogue State Tracking Evaluation Method using GPT-4", "paper_summary": "Dialogue state tracking (DST) is evaluated by exact matching methods, which\nrely on large amounts of labeled data and ignore semantic consistency, leading\nto over-evaluation. Currently, leveraging large language models (LLM) in\nevaluating natural language processing tasks has achieved promising results.\nHowever, using LLM for DST evaluation is still under explored. In this paper,\nwe propose a two-dimensional zero-shot evaluation method for DST using GPT-4,\nwhich divides the evaluation into two dimensions: accuracy and completeness.\nFurthermore, we also design two manual reasoning paths in prompting to further\nimprove the accuracy of evaluation. Experimental results show that our method\nachieves better performance compared to the baselines, and is consistent with\ntraditional exact matching based methods.", "paper_summary_zh": "對話狀態追蹤 (DST) 是由精確比對方法評估，它依賴大量的標籤資料，並忽略語意一致性，這導致評估過高。目前，利用大型語言模型 (LLM) 來評估自然語言處理任務已取得令人滿意的結果。然而，使用 LLM 進行 DST 評估仍處於探索階段。在本文中，我們提出了一個使用 GPT-4 的二維零次評估方法，將評估分為兩個面向：準確性和完整性。此外，我們還設計了兩個手動推理路徑，以進一步提高評估的準確性。實驗結果表明，與基線相比，我們的評估方法表現更好，並且與傳統的基於精確比對的方法一致。", "author": "Ming Gu et.al.", "authors": "Ming Gu, Yan Yang", "id": "2406.11651v1", "paper_url": "http://arxiv.org/abs/2406.11651v1", "repo": "null"}}