{"2408.10777": {"publish_time": "2024-08-20", "title": "Just a Hint: Point-Supervised Camouflaged Object Detection", "paper_summary": "Camouflaged Object Detection (COD) demands models to expeditiously and\naccurately distinguish objects which conceal themselves seamlessly in the\nenvironment. Owing to the subtle differences and ambiguous boundaries, COD is\nnot only a remarkably challenging task for models but also for human\nannotators, requiring huge efforts to provide pixel-wise annotations. To\nalleviate the heavy annotation burden, we propose to fulfill this task with the\nhelp of only one point supervision. Specifically, by swiftly clicking on each\nobject, we first adaptively expand the original point-based annotation to a\nreasonable hint area. Then, to avoid partial localization around discriminative\nparts, we propose an attention regulator to scatter model attention to the\nwhole object through partially masking labeled regions. Moreover, to solve the\nunstable feature representation of camouflaged objects under only point-based\nannotation, we perform unsupervised contrastive learning based on differently\naugmented image pairs (e.g. changing color or doing translation). On three\nmainstream COD benchmarks, experimental results show that our model outperforms\nseveral weakly-supervised methods by a large margin across various metrics.", "paper_summary_zh": "偽裝物體偵測 (COD) 要求模型快速且準確地辨別在環境中無縫隱藏自己的物體。由於細微的差異和模糊的邊界，COD 不僅對模型而言是一項極具挑戰性的任務，對人工標註者來說也是如此，需要付出巨大的努力來提供逐像素標註。為了減輕繁重的標註負擔，我們建議僅借助一個點監督來完成這項任務。具體來說，通過快速點擊每個物體，我們首先自適應地將基於點的原始標註擴展到合理的提示區域。然後，為了避免在區別性部分周圍進行部分定位，我們提出了一個注意力調節器，通過部分遮蓋標記區域將模型注意力分散到整個物體上。此外，為了解決僅基於點的標註下偽裝物體的不穩定特徵表示，我們根據不同的擴增影像對（例如改變顏色或進行平移）執行無監督對比學習。在三個主流 COD 基準上，實驗結果表明我們的模型在各種指標上都比多種弱監督方法高出很多。", "author": "Huafeng Chen et.al.", "authors": "Huafeng Chen, Dian Shao, Guangqian Guo, Shan Gao", "id": "2408.10777v1", "paper_url": "http://arxiv.org/abs/2408.10777v1", "repo": "null"}}