{"2407.11830": {"publish_time": "2024-07-16", "title": "Personalized Conversational Travel Assistant powered by Generative AI", "paper_summary": "The Tourism and Destination Management Organization (DMO) industry is rapidly\nevolving to adapt to new technologies and traveler expectations. Generative\nArtificial Intelligence (AI) offers an astonishing and innovative opportunity\nto enhance the tourism experience by providing personalized, interactive and\nengaging assistance. In this article, we propose a generative AI-based chatbot\nfor tourism assistance. The chatbot leverages AI ability to generate realistic\nand creative texts, adopting the friendly persona of the well-known Italian\nall-knowledgeable aunties, to provide tourists with personalized information,\ntailored and dynamic pre, during and post recommendations and trip plans and\npersonalized itineraries, using both text and voice commands, and supporting\ndifferent languages to satisfy Italian and foreign tourists expectations. This\nwork is under development in the Molise CTE research project, funded by the\nItalian Minister of the Economic Growth (MIMIT), with the aim to leverage the\nbest emerging technologies available, such as Cloud and AI to produce state of\nthe art solutions in the Smart City environment.", "paper_summary_zh": "旅遊和目的地管理組織 (DMO) 產業快速演進，以適應新科技和旅客期望。生成式人工智慧 (AI) 提供驚人的創新機會，透過提供個人化、互動且引人入勝的協助，來提升旅遊體驗。在本文中，我們提出一個用於旅遊協助的生成式 AI 聊天機器人。聊天機器人利用 AI 產生逼真且具創意的文字，採用著名的義大利萬事通阿姨的友善角色，使用文字和語音指令為旅客提供個人化資訊、量身打造且動態的旅遊建議和行程規劃，以及個人化行程，並支援多國語言以滿足義大利和外國旅客的期望。此項工作目前在由義大利經濟成長部 (MIMIT) 資助的 Molise CTE 研究計畫中進行，目標是利用雲端和 AI 等最佳新興科技，在智慧城市環境中產生最先進的解決方案。", "author": "Alexio Cassani et.al.", "authors": "Alexio Cassani, Michele Ruberl, Antonio Salis, Giacomo Giannese, Gianluca Boanelli", "id": "2407.11830v1", "paper_url": "http://arxiv.org/abs/2407.11830v1", "repo": "null"}}