{"2408.01394": {"publish_time": "2024-08-02", "title": "Improving Multilingual Neural Machine Translation by Utilizing Semantic and Linguistic Features", "paper_summary": "The many-to-many multilingual neural machine translation can be regarded as\nthe process of integrating semantic features from the source sentences and\nlinguistic features from the target sentences. To enhance zero-shot\ntranslation, models need to share knowledge across languages, which can be\nachieved through auxiliary tasks for learning a universal representation or\ncross-lingual mapping. To this end, we propose to exploit both semantic and\nlinguistic features between multiple languages to enhance multilingual\ntranslation. On the encoder side, we introduce a disentangling learning task\nthat aligns encoder representations by disentangling semantic and linguistic\nfeatures, thus facilitating knowledge transfer while preserving complete\ninformation. On the decoder side, we leverage a linguistic encoder to integrate\nlow-level linguistic features to assist in the target language generation.\nExperimental results on multilingual datasets demonstrate significant\nimprovement in zero-shot translation compared to the baseline system, while\nmaintaining performance in supervised translation. Further analysis validates\nthe effectiveness of our method in leveraging both semantic and linguistic\nfeatures. The code is available at https://github.com/ictnlp/SemLing-MNMT.", "paper_summary_zh": "多對多多語言神經機器翻譯可視為整合來源句子的語意特徵和目標句子的語言特徵的過程。為了增強零次學習翻譯，模型需要跨語言共享知識，這可透過輔助任務來學習通用表示或跨語言對應來達成。為此，我們提議利用多種語言之間的語意和語言特徵來增強多語言翻譯。在編碼器方面，我們引入了一個解開學習任務，透過解開語意和語言特徵來對齊編碼器表示，從而促進知識傳遞，同時保留完整資訊。在解碼器方面，我們利用語言編碼器整合低階語言特徵，以協助目標語言產生。多語言資料集上的實驗結果顯示，與基準系統相比，零次學習翻譯有顯著改善，同時在監督式翻譯中維持效能。進一步的分析驗證了我們的方法在利用語意和語言特徵方面的有效性。程式碼可於 https://github.com/ictnlp/SemLing-MNMT 取得。", "author": "Mengyu Bu et.al.", "authors": "Mengyu Bu, Shuhao Gu, Yang Feng", "id": "2408.01394v1", "paper_url": "http://arxiv.org/abs/2408.01394v1", "repo": "null"}}