{"2406.11698": {"publish_time": "2024-06-17", "title": "Meta Reasoning for Large Language Models", "paper_summary": "We introduce Meta-Reasoning Prompting (MRP), a novel and efficient system\nprompting method for large language models (LLMs) inspired by human\nmeta-reasoning. Traditional in-context learning-based reasoning techniques,\nsuch as Tree-of-Thoughts, show promise but lack consistent state-of-the-art\nperformance across diverse tasks due to their specialized nature. MRP addresses\nthis limitation by guiding LLMs to dynamically select and apply different\nreasoning methods based on the specific requirements of each task, optimizing\nboth performance and computational efficiency. With MRP, LLM reasoning operates\nin two phases. Initially, the LLM identifies the most appropriate reasoning\nmethod using task input cues and objective descriptions of available methods.\nSubsequently, it applies the chosen method to complete the task. This dynamic\nstrategy mirrors human meta-reasoning, allowing the model to excel in a wide\nrange of problem domains. We evaluate the effectiveness of MRP through\ncomprehensive benchmarks. The results demonstrate that MRP achieves or\napproaches state-of-the-art performance across diverse tasks. MRP represents a\nsignificant advancement in enabling LLMs to identify cognitive challenges\nacross problems and leverage benefits across different reasoning approaches,\nenhancing their ability to handle diverse and complex problem domains\nefficiently. Every LLM deserves a Meta-Reasoning Prompting to unlock its full\npotential and ensure adaptability in an ever-evolving landscape of challenges\nand applications.", "paper_summary_zh": "<paragraph>我們引入了元推理提示（MRP），這是一種新穎且有效率的系統提示方法，適用於大型語言模型（LLM），其靈感來自人類的元推理。傳統的基於情境學習的推理技術，例如思想樹，顯示出一定的潛力，但由於其專業性質，在不同的任務中缺乏一致的最新技術效能。MRP 透過引導 LLM 根據每個任務的特定需求動態選擇並應用不同的推理方法來解決這個限制，同時最佳化效能和運算效率。透過 MRP，LLM 推理分為兩個階段。最初，LLM 使用任務輸入提示和可用方法的客觀描述來識別最合適的推理方法。隨後，它應用所選方法來完成任務。這種動態策略反映了人類的元推理，讓模型能夠在廣泛的問題領域中表現出色。我們透過全面的基準測試來評估 MRP 的有效性。結果表明，MRP 在不同的任務中達到或接近最新技術效能。MRP 代表了讓 LLM 能夠識別不同問題的認知挑戰，並利用不同推理方法的優點的重大進展，進而增強它們有效處理不同且複雜問題領域的能力。每個 LLM 都應具備元推理提示，以發揮其全部潛力，並確保在不斷變化的挑戰和應用環境中適應。", "author": "Peizhong Gao et.al.", "authors": "Peizhong Gao, Ao Xie, Shaoguang Mao, Wenshan Wu, Yan Xia, Haipeng Mi, Furu Wei", "id": "2406.11698v1", "paper_url": "http://arxiv.org/abs/2406.11698v1", "repo": "null"}}