{"2408.15138": {"publish_time": "2024-08-27", "title": "How transformers learn structured data: insights from hierarchical filtering", "paper_summary": "We introduce a hierarchical filtering procedure for generative models of\nsequences on trees, enabling control over the range of positional correlations\nin the data. Leveraging this controlled setting, we provide evidence that\nvanilla encoder-only transformer architectures can implement the optimal Belief\nPropagation algorithm on both root classification and masked language modeling\ntasks. Correlations at larger distances corresponding to increasing layers of\nthe hierarchy are sequentially included as the network is trained. We analyze\nhow the transformer layers succeed by focusing on attention maps from models\ntrained with varying degrees of filtering. These attention maps show clear\nevidence for iterative hierarchical reconstruction of correlations, and we can\nrelate these observations to a plausible implementation of the exact inference\nalgorithm for the network sizes considered.", "paper_summary_zh": "我們引入了一個分層過濾程序，用於樹狀結構序列的生成模型，能夠控制資料中位置相關性的範圍。利用這個受控設定，我們提供了證據，表明僅編碼器的香草Transformer架構可以在根分類和遮罩語言建模任務中實作最佳的信念傳播演算法。隨著網路受訓，與層級中遞增層數對應的較大距離相關性會依序納入。我們分析Transformer層如何成功，重點關注使用不同程度過濾訓練的模型的注意力圖。這些注意力圖清楚地證明了相關性的迭代式分層重建，而且我們可以將這些觀察與所考慮的網路大小的精確推論演算法的合理實作相關聯。", "author": "Jerome Garnier-Brun et.al.", "authors": "Jerome Garnier-Brun, Marc Mézard, Emanuele Moscato, Luca Saglietti", "id": "2408.15138v1", "paper_url": "http://arxiv.org/abs/2408.15138v1", "repo": "null"}}