{"2406.12831": {"publish_time": "2024-06-18", "title": "VIA: A Spatiotemporal Video Adaptation Framework for Global and Local Video Editing", "paper_summary": "Video editing stands as a cornerstone of digital media, from entertainment\nand education to professional communication. However, previous methods often\noverlook the necessity of comprehensively understanding both global and local\ncontexts, leading to inaccurate and inconsistency edits in the spatiotemporal\ndimension, especially for long videos. In this paper, we introduce VIA, a\nunified spatiotemporal VIdeo Adaptation framework for global and local video\nediting, pushing the limits of consistently editing minute-long videos. First,\nto ensure local consistency within individual frames, the foundation of VIA is\na novel test-time editing adaptation method, which adapts a pre-trained image\nediting model for improving consistency between potential editing directions\nand the text instruction, and adapts masked latent variables for precise local\ncontrol. Furthermore, to maintain global consistency over the video sequence,\nwe introduce spatiotemporal adaptation that adapts consistent attention\nvariables in key frames and strategically applies them across the whole\nsequence to realize the editing effects. Extensive experiments demonstrate\nthat, compared to baseline methods, our VIA approach produces edits that are\nmore faithful to the source videos, more coherent in the spatiotemporal\ncontext, and more precise in local control. More importantly, we show that VIA\ncan achieve consistent long video editing in minutes, unlocking the potentials\nfor advanced video editing tasks over long video sequences.", "paper_summary_zh": "影片編輯是數位媒體的基石，從娛樂、教育到專業溝通皆是。然而，以往的方法常常忽略全面理解全球和在地脈絡的必要性，導致在時空維度上產生不準確且不一致的編輯，特別是對於長影片。在本文中，我們介紹 VIA，一個統一的時空影片改編架構，用於全球和在地影片編輯，突破連貫編輯長達數分鐘影片的限制。首先，為了確保個別畫格內的在地一致性，VIA 的基礎是一個新穎的測試時間編輯改編方法，它改編一個預先訓練好的影像編輯模型，用於改善潛在編輯方向與文字指令間的一致性，並改編遮罩潛在變數以進行精確的在地控制。此外，為了在影片序列上維持全球一致性，我們引入時空改編，它改編關鍵畫格中一致的注意變數，並策略性地將它們應用於整個序列，以實現編輯效果。廣泛的實驗證明，與基準方法相比，我們的 VIA 方法產生的編輯更忠於原始影片、在時空脈絡中更連貫、在在地控制上更精確。更重要的是，我們展示 VIA 能在數分鐘內達成一致的長影片編輯，為長影片序列的高階影片編輯任務解鎖潛力。", "author": "Jing Gu et.al.", "authors": "Jing Gu, Yuwei Fang, Ivan Skorokhodov, Peter Wonka, Xinya Du, Sergey Tulyakov, Xin Eric Wang", "id": "2406.12831v1", "paper_url": "http://arxiv.org/abs/2406.12831v1", "repo": "null"}}