{"2411.01703": {"publish_time": "2024-11-03", "title": "UniGuard: Towards Universal Safety Guardrails for Jailbreak Attacks on Multimodal Large Language Models", "paper_summary": "Multimodal large language models (MLLMs) have revolutionized vision-language\nunderstanding but are vulnerable to multimodal jailbreak attacks, where\nadversaries meticulously craft inputs to elicit harmful or inappropriate\nresponses. We propose UniGuard, a novel multimodal safety guardrail that\njointly considers the unimodal and cross-modal harmful signals. UniGuard is\ntrained such that the likelihood of generating harmful responses in a toxic\ncorpus is minimized, and can be seamlessly applied to any input prompt during\ninference with minimal computational costs. Extensive experiments demonstrate\nthe generalizability of UniGuard across multiple modalities and attack\nstrategies. It demonstrates impressive generalizability across multiple\nstate-of-the-art MLLMs, including LLaVA, Gemini Pro, GPT-4, MiniGPT-4, and\nInstructBLIP, thereby broadening the scope of our solution.", "paper_summary_zh": "多模態大型語言模型 (MLLM) 徹底改變了視覺語言理解，但容易受到多模態越獄攻擊，其中對手精心製作輸入以引發有害或不適當的回應。我們提出 UniGuard，這是一個新穎的多模態安全護欄，它共同考慮了單模態和跨模態的有害訊號。UniGuard 接受訓練，將在有毒語料庫中產生有害回應的可能性降至最低，並且可以在推理過程中無縫應用於任何輸入提示，同時將運算成本降至最低。廣泛的實驗證明了 UniGuard 在多種模態和攻擊策略中的泛化能力。它展示了在多個最先進的 MLLM 中令人印象深刻的泛化能力，包括 LLaVA、Gemini Pro、GPT-4、MiniGPT-4 和 InstructBLIP，從而擴大了我們解決方案的範圍。", "author": "Sejoon Oh et.al.", "authors": "Sejoon Oh, Yiqiao Jin, Megha Sharma, Donghyun Kim, Eric Ma, Gaurav Verma, Srijan Kumar", "id": "2411.01703v1", "paper_url": "http://arxiv.org/abs/2411.01703v1", "repo": "null"}}