{"2409.15368": {"publish_time": "2024-09-18", "title": "MedCodER: A Generative AI Assistant for Medical Coding", "paper_summary": "Medical coding is essential for standardizing clinical data and communication\nbut is often time-consuming and prone to errors. Traditional Natural Language\nProcessing (NLP) methods struggle with automating coding due to the large label\nspace, lengthy text inputs, and the absence of supporting evidence annotations\nthat justify code selection. Recent advancements in Generative Artificial\nIntelligence (AI) offer promising solutions to these challenges. In this work,\nwe introduce MedCodER, a Generative AI framework for automatic medical coding\nthat leverages extraction, retrieval, and re-ranking techniques as core\ncomponents. MedCodER achieves a micro-F1 score of 0.60 on International\nClassification of Diseases (ICD) code prediction, significantly outperforming\nstate-of-the-art methods. Additionally, we present a new dataset containing\nmedical records annotated with disease diagnoses, ICD codes, and supporting\nevidence texts (https://doi.org/10.5281/zenodo.13308316). Ablation tests\nconfirm that MedCodER's performance depends on the integration of each of its\naforementioned components, as performance declines when these components are\nevaluated in isolation.", "paper_summary_zh": "醫療編碼對於標準化臨床資料和溝通至關重要，但通常很耗時且容易出錯。傳統的自然語言處理 (NLP) 方法由於標籤空間大、文字輸入長且缺乏證明編碼選擇的佐證註解，因此難以自動化編碼。生成式人工智慧 (AI) 的最新進展為這些挑戰提供了有希望的解決方案。在這項工作中，我們介紹了 MedCodER，這是一個用於自動醫療編碼的生成式 AI 框架，它利用萃取、檢索和重新排序技術作為核心組成部分。MedCodER 在國際疾病分類 (ICD) 代碼預測上達到了 0.60 的微 F1 分數，顯著優於最先進的方法。此外，我們還提供了一個新的資料集，其中包含註有疾病診斷、ICD 代碼和佐證文字的新醫療記錄 (https://doi.org/10.5281/zenodo.13308316)。消融測試證實，MedCodER 的效能取決於其上述各組成部分的整合，因為當這些組成部分被孤立評估時，效能會下降。", "author": "Krishanu Das Baksi et.al.", "authors": "Krishanu Das Baksi, Elijah Soba, John J. Higgins, Ravi Saini, Jaden Wood, Jane Cook, Jack Scott, Nirmala Pudota, Tim Weninger, Edward Bowen, Sanmitra Bhattacharya", "id": "2409.15368v1", "paper_url": "http://arxiv.org/abs/2409.15368v1", "repo": "null"}}