{"2411.12184": {"publish_time": "2024-11-19", "title": "Testability of Instrumental Variables in Additive Nonlinear, Non-Constant Effects Models", "paper_summary": "We address the issue of the testability of instrumental variables derived\nfrom observational data. Most existing testable implications are centered on\nscenarios where the treatment is a discrete variable, e.g., instrumental\ninequality (Pearl, 1995), or where the effect is assumed to be constant, e.g.,\ninstrumental variables condition based on the principle of independent\nmechanisms (Burauel, 2023). However, treatments can often be continuous\nvariables, such as drug dosages or nutritional content levels, and non-constant\neffects may occur in many real-world scenarios. In this paper, we consider an\nadditive nonlinear, non-constant effects model with unmeasured confounders, in\nwhich treatments can be either discrete or continuous, and propose an\nAuxiliary-based Independence Test (AIT) condition to test whether a variable is\na valid instrument. We first show that if the candidate instrument is valid,\nthen the AIT condition holds. Moreover, we illustrate the implications of the\nAIT condition and demonstrate that, in certain conditions, AIT conditions are\nnecessary and sufficient to detect all invalid IVs. We also extend the AIT\ncondition to include covariates and introduce a practical testing algorithm.\nExperimental results on both synthetic and three different real-world datasets\nshow the effectiveness of our proposed condition.", "paper_summary_zh": "<paragraph>我們探討從觀測數據衍生的工具變數的可測試性問題。現有的可測試暗示大多集中在處理為離散變數的情況，例如工具變數不等式（Pearl，1995 年），或假設效果為常數的情況，例如基於獨立機制原理的工具變數條件（Burauel，2023 年）。然而，處理通常可以是連續變數，例如藥物劑量或營養成分水平，並且在許多實際情況中可能會發生非恆定效應。在本文中，我們考慮了一個具有未測量混雜項的加性非線性、非恆定效應模型，其中處理可以是離散的或連續的，並提出了一個基於輔助的獨立性檢驗 (AIT) 條件來檢驗一個變數是否是一個有效的工具。我們首先表明，如果候選工具有效，則 AIT 條件成立。此外，我們說明了 AIT 條件的含義，並證明在某些條件下，AIT 條件對於檢測所有無效 IV 是必要且充分的。我們還擴展了 AIT 條件以納入協變量，並介紹了一個實用的檢驗演算法。在合成和三個不同的真實世界資料集上的實驗結果顯示了我們提出的條件的有效性。</paragraph>", "author": "Xichen Guo et.al.", "authors": "Xichen Guo, Zheng Li, Biwei Huang, Yan Zeng, Zhi Geng, Feng Xie", "id": "2411.12184v1", "paper_url": "http://arxiv.org/abs/2411.12184v1", "repo": "null"}}