{"2411.06835": {"publish_time": "2024-11-11", "title": "HarmLevelBench: Evaluating Harm-Level Compliance and the Impact of Quantization on Model Alignment", "paper_summary": "With the introduction of the transformers architecture, LLMs have\nrevolutionized the NLP field with ever more powerful models. Nevertheless,\ntheir development came up with several challenges. The exponential growth in\ncomputational power and reasoning capabilities of language models has\nheightened concerns about their security. As models become more powerful,\nensuring their safety has become a crucial focus in research. This paper aims\nto address gaps in the current literature on jailbreaking techniques and the\nevaluation of LLM vulnerabilities. Our contributions include the creation of a\nnovel dataset designed to assess the harmfulness of model outputs across\nmultiple harm levels, as well as a focus on fine-grained harm-level analysis.\nUsing this framework, we provide a comprehensive benchmark of state-of-the-art\njailbreaking attacks, specifically targeting the Vicuna 13B v1.5 model.\nAdditionally, we examine how quantization techniques, such as AWQ and GPTQ,\ninfluence the alignment and robustness of models, revealing trade-offs between\nenhanced robustness with regards to transfer attacks and potential increases in\nvulnerability on direct ones. This study aims to demonstrate the influence of\nharmful input queries on the complexity of jailbreaking techniques, as well as\nto deepen our understanding of LLM vulnerabilities and improve methods for\nassessing model robustness when confronted with harmful content, particularly\nin the context of compression strategies.", "paper_summary_zh": "隨著Transformer架構的引入，LLM 已透過更強大的模型徹底改變 NLP 領域。儘管如此，它們的開發仍面臨許多挑戰。語言模型在計算能力和推理能力上的指數成長，已加劇人們對其安全性的疑慮。隨著模型變得更強大，確保其安全性已成為研究中的關鍵焦點。本文旨在解決當前有關越獄技術和 LLM 漏洞評估文獻中的差距。我們的貢獻包括建立一個新穎的資料集，旨在評估模型輸出在多個危害層級中的危害性，以及專注於細微的危害層級分析。使用此架構，我們提供了最先進越獄攻擊的全面基準，特別針對 Vicuna 13B v1.5 模型。此外，我們探討量化技術（例如 AWQ 和 GPTQ）如何影響模型的對齊和穩健性，揭示了在針對轉移攻擊的增強穩健性與直接攻擊的潛在漏洞增加之間的權衡。本研究旨在證明有害輸入查詢對越獄技術複雜性的影響，以及加深我們對 LLM 漏洞的理解，並改善在面對有害內容時評估模型穩健性的方法，特別是在壓縮策略的背景下。", "author": "Yannis Belkhiter et.al.", "authors": "Yannis Belkhiter, Giulio Zizzo, Sergio Maffeis", "id": "2411.06835v1", "paper_url": "http://arxiv.org/abs/2411.06835v1", "repo": "null"}}