{"2411.14797": {"publish_time": "2024-11-22", "title": "Continual SFT Matches Multimodal RLHF with Negative Supervision", "paper_summary": "Multimodal RLHF usually happens after supervised finetuning (SFT) stage to\ncontinually improve vision-language models' (VLMs) comprehension. Conventional\nwisdom holds its superiority over continual SFT during this preference\nalignment stage. In this paper, we observe that the inherent value of\nmultimodal RLHF lies in its negative supervision, the logit of the rejected\nresponses. We thus propose a novel negative supervised finetuning (nSFT)\napproach that fully excavates these information resided. Our nSFT disentangles\nthis negative supervision in RLHF paradigm, and continually aligns VLMs with a\nsimple SFT loss. This is more memory efficient than multimodal RLHF where 2\n(e.g., DPO) or 4 (e.g., PPO) large VLMs are strictly required. The\neffectiveness of nSFT is rigorously proved by comparing it with various\nmultimodal RLHF approaches, across different dataset sources, base VLMs and\nevaluation metrics. Besides, fruitful of ablations are provided to support our\nhypothesis. We hope this paper will stimulate further research to properly\nalign large vision language models.", "paper_summary_zh": "多模态 RLHF 通常在监督微调 (SFT) 阶段之后发生，以持续改进视觉语言模型 (VLM) 的理解力。传统智慧认为在这一偏好对齐阶段，它优于持续的 SFT。在本文中，我们观察到多模态 RLHF 的内在价值在于其负监督，即被拒绝的响应的对数几率。因此，我们提出了一种新颖的负监督微调 (nSFT) 方法，该方法充分挖掘了这些驻留的信息。我们的 nSFT 解开了 RLHF 范式中的负监督，并持续使用简单的 SFT 损失对齐 VLM。这比多模态 RLHF 更节省内存，在多模态 RLHF 中严格需要 2（例如，DPO）或 4（例如，PPO）个大型 VLM。通过在不同的数据集源、基本 VLM 和评估指标上将 nSFT 与各种多模态 RLHF 方法进行比较，严格证明了其有效性。此外，还提供了丰富的消融实验来支持我们的假设。我们希望本文将激发进一步的研究，以正确对齐大型视觉语言模型。", "author": "Ke Zhu et.al.", "authors": "Ke Zhu, Yu Wang, Yanpeng Sun, Qiang Chen, Jiangjiang Liu, Gang Zhang, Jingdong Wang", "id": "2411.14797v1", "paper_url": "http://arxiv.org/abs/2411.14797v1", "repo": "null"}}