{"2411.18575": {"publish_time": "2024-11-27", "title": "Functional relevance based on the continuous Shapley value", "paper_summary": "The presence of Artificial Intelligence (AI) in our society is increasing,\nwhich brings with it the need to understand the behaviour of AI mechanisms,\nincluding machine learning predictive algorithms fed with tabular data, text,\nor images, among other types of data. This work focuses on interpretability of\npredictive models based on functional data. Designing interpretability methods\nfor functional data models implies working with a set of features whose size is\ninfinite. In the context of scalar on function regression, we propose an\ninterpretability method based on the Shapley value for continuous games, a\nmathematical formulation that allows to fairly distribute a global payoff among\na continuous set players. The method is illustrated through a set of\nexperiments with simulated and real data sets. The open source Python package\nShapleyFDA is also presented.", "paper_summary_zh": "隨著人工智慧 (AI) 在我們社會中的存在感日益提升，\n這也帶來了理解 AI 機制行為的需求，\n包括以表格資料、文字或影像等各種資料類型的機器學習預測演算法。這項工作專注於基於函數資料的預測模型的可解釋性。設計函數資料模型的可解釋性方法意味著使用一組大小為無限大的特徵。在函數回歸的標量背景下，我們提出一個基於連續博弈的 Shapley 值的可解釋性方法，這是一個允許在連續的玩家集合中公平分配全球收益的數學公式。該方法透過一組模擬和真實資料集的實驗來說明。開源 Python 套件 ShapleyFDA 也已發布。", "author": "Pedro Delicado et.al.", "authors": "Pedro Delicado, Cristian Pachón-García", "id": "2411.18575v1", "paper_url": "http://arxiv.org/abs/2411.18575v1", "repo": "null"}}