{"2408.03164": {"publish_time": "2024-08-06", "title": "Dilated Convolution with Learnable Spacings makes visual models more aligned with humans: a Grad-CAM study", "paper_summary": "Dilated Convolution with Learnable Spacing (DCLS) is a recent advanced\nconvolution method that allows enlarging the receptive fields (RF) without\nincreasing the number of parameters, like the dilated convolution, yet without\nimposing a regular grid. DCLS has been shown to outperform the standard and\ndilated convolutions on several computer vision benchmarks. Here, we show that,\nin addition, DCLS increases the models' interpretability, defined as the\nalignment with human visual strategies. To quantify it, we use the Spearman\ncorrelation between the models' GradCAM heatmaps and the ClickMe dataset\nheatmaps, which reflect human visual attention. We took eight reference models\n- ResNet50, ConvNeXt (T, S and B), CAFormer, ConvFormer, and FastViT (sa 24 and\n36) - and drop-in replaced the standard convolution layers with DCLS ones. This\nimproved the interpretability score in seven of them. Moreover, we observed\nthat Grad-CAM generated random heatmaps for two models in our study: CAFormer\nand ConvFormer models, leading to low interpretability scores. We addressed\nthis issue by introducing Threshold-Grad-CAM, a modification built on top of\nGrad-CAM that enhanced interpretability across nearly all models. The code and\ncheckpoints to reproduce this study are available at:\nhttps://github.com/rabihchamas/DCLS-GradCAM-Eval.", "paper_summary_zh": "可學習間距擴展卷積 (DCLS) 是一種近期進階的卷積方法，允許擴展感受野 (RF)，而無須增加參數數量，就像擴展卷積一樣，但無須強制使用規則網格。已證實 DCLS 在多個電腦視覺基準上優於標準卷積和擴展卷積。在此，我們展示 DCLS 除了能提升模型的可詮釋性，定義為與人類視覺策略的一致性。為量化它，我們使用模型的 GradCAM 熱圖與 ClickMe 資料集熱圖之間的 Spearman 相關性，它反映了人類的視覺注意力。我們採用了八個參考模型 - ResNet50、ConvNeXt (T、S 和 B)、CAFormer、ConvFormer 和 FastViT (sa 24 和 36) - 並以 DCLS 取代標準卷積層。這提升了其中七個模型的可詮釋性分數。此外，我們觀察到 Grad-CAM 為我們研究中的兩個模型產生了隨機熱圖：CAFormer 和 ConvFormer 模型，導致可詮釋性分數低。我們透過引入 Threshold-Grad-CAM 來解決這個問題，這是一種建立在 Grad-CAM 之上的修改，可增強幾乎所有模型的可詮釋性。可於以下網址取得重現此研究的程式碼和檢查點：https://github.com/rabihchamas/DCLS-GradCAM-Eval。", "author": "Rabih Chamas et.al.", "authors": "Rabih Chamas, Ismail Khalfaoui-Hassani, Timothee Masquelier", "id": "2408.03164v1", "paper_url": "http://arxiv.org/abs/2408.03164v1", "repo": "null"}}