{"2410.13948": {"publish_time": "2024-10-17", "title": "The KnowWhereGraph Ontology", "paper_summary": "KnowWhereGraph is one of the largest fully publicly available geospatial\nknowledge graphs. It includes data from 30 layers on natural hazards (e.g.,\nhurricanes, wildfires), climate variables (e.g., air temperature,\nprecipitation), soil properties, crop and land-cover types, demographics, and\nhuman health, various place and region identifiers, among other themes. These\nhave been leveraged through the graph by a variety of applications to address\nchallenges in food security and agricultural supply chains; sustainability\nrelated to soil conservation practices and farm labor; and delivery of\nemergency humanitarian aid following a disaster. In this paper, we introduce\nthe ontology that acts as the schema for KnowWhereGraph. This broad overview\nprovides insight into the requirements and design specifications for the graph\nand its schema, including the development methodology (modular ontology\nmodeling) and the resources utilized to implement, materialize, and deploy\nKnowWhereGraph with its end-user interfaces and public query SPARQL endpoint.", "paper_summary_zh": "KnowWhereGraph 是最大的完全公開可用的地理空間知識圖譜之一。它包含來自 30 層的自然災害（例如颶風、野火）、氣候變量（例如氣溫、降水）、土壤特性、作物和土地覆蓋類型、人口統計和人類健康、各種地方和區域識別符等主題的數據。這些數據已通過圖表被各種應用程式利用，以應對糧食安全和農業供應鏈中的挑戰；與土壤保育措施和農場勞動力相關的可持續性；以及在災害發生後提供緊急人道主義援助。在本文中，我們介紹了作為 KnowWhereGraph 架構的本体。這個廣泛的概述提供了對圖表及其架構的要求和設計規範的見解，包括開發方法（模組化本体建模）和用於實作、具體化和部署 KnowWhereGraph 及其最終使用者介面和公開查詢 SPARQL 端點的資源。", "author": "Cogan Shimizu et.al.", "authors": "Cogan Shimizu, Shirly Stephe, Adrita Barua, Ling Cai, Antrea Christou, Kitty Currier, Abhilekha Dalal, Colby K. Fisher, Pascal Hitzler, Krzysztof Janowicz, Wenwen Li, Zilong Liu, Mohammad Saeid Mahdavinejad, Gengchen Mai, Dean Rehberger, Mark Schildhauer, Meilin Shi, Sanaz Saki Norouzi, Yuanyuan Tian, Sizhe Wang, Zhangyu Wang, Joseph Zalewski, Lu Zhou, Rui Zhu", "id": "2410.13948v1", "paper_url": "http://arxiv.org/abs/2410.13948v1", "repo": "null"}}