{"2409.17995": {"publish_time": "2024-09-26", "title": "Joint Localization and Planning using Diffusion", "paper_summary": "Diffusion models have been successfully applied to robotics problems such as\nmanipulation and vehicle path planning. In this work, we explore their\napplication to end-to-end navigation -- including both perception and planning\n-- by considering the problem of jointly performing global localization and\npath planning in known but arbitrary 2D environments. In particular, we\nintroduce a diffusion model which produces collision-free paths in a global\nreference frame given an egocentric LIDAR scan, an arbitrary map, and a desired\ngoal position. To this end, we implement diffusion in the space of paths in\nSE(2), and describe how to condition the denoising process on both obstacles\nand sensor observations. In our evaluation, we show that the proposed\nconditioning techniques enable generalization to realistic maps of considerably\ndifferent appearance than the training environment, demonstrate our model's\nability to accurately describe ambiguous solutions, and run extensive\nsimulation experiments showcasing our model's use as a real-time, end-to-end\nlocalization and planning stack.", "paper_summary_zh": "擴散模型已成功應用於機器人問題，例如操作和車輛路徑規劃。在這項工作中，我們探討其應用於端到端導航——包括感知和規劃——方法是考慮在已知但任意的 2D 環境中同時執行全局定位和路徑規劃的問題。特別是，我們引入了一個擴散模型，該模型根據自我中心的 LIDAR 掃描、任意地圖和所需的目標位置在全局參考系中產生無碰撞路徑。為此，我們在 SE(2) 路徑空間中實作擴散，並描述如何根據障礙物和感測器觀測對去噪過程進行條件設定。在我們的評估中，我們展示了所提出的條件設定技術能夠推廣到與訓練環境外觀截然不同的真實地圖，展示了我們的模型準確描述模糊解的能力，並執行廣泛的模擬實驗，展示了我們的模型作為實時、端到端定位和規劃堆疊的用途。", "author": "L. Lao Beyer et.al.", "authors": "L. Lao Beyer, S. Karaman", "id": "2409.17995v1", "paper_url": "http://arxiv.org/abs/2409.17995v1", "repo": "null"}}