{"2407.13078": {"publish_time": "2024-07-18", "title": "Enhancing Temporal Action Localization: Advanced S6 Modeling with Recurrent Mechanism", "paper_summary": "Temporal Action Localization (TAL) is a critical task in video analysis,\nidentifying precise start and end times of actions. Existing methods like CNNs,\nRNNs, GCNs, and Transformers have limitations in capturing long-range\ndependencies and temporal causality. To address these challenges, we propose a\nnovel TAL architecture leveraging the Selective State Space Model (S6). Our\napproach integrates the Feature Aggregated Bi-S6 block, Dual Bi-S6 structure,\nand a recurrent mechanism to enhance temporal and channel-wise dependency\nmodeling without increasing parameter complexity. Extensive experiments on\nbenchmark datasets demonstrate state-of-the-art results with mAP scores of\n74.2% on THUMOS-14, 42.9% on ActivityNet, 29.6% on FineAction, and 45.8% on\nHACS. Ablation studies validate our method's effectiveness, showing that the\nDual structure in the Stem module and the recurrent mechanism outperform\ntraditional approaches. Our findings demonstrate the potential of S6-based\nmodels in TAL tasks, paving the way for future research.", "paper_summary_zh": "時序動作定位 (TAL) 是影片分析中的一項重要任務，用於識別動作的精確開始和結束時間。現有的方法，例如 CNN、RNN、GCN 和 Transformer，在捕捉長距離依賴性和時序因果關係方面有其限制。為了應對這些挑戰，我們提出了一種利用選擇性狀態空間模型 (S6) 的新型 TAL 架構。我們的做法整合了特徵聚合雙向 S6 區塊、雙向 S6 結構和遞迴機制，以增強時序和通道依賴性建模，而不會增加參數複雜性。在基準資料集上進行的廣泛實驗證明了最先進的結果，在 THUMOS-14 上的 mAP 分數為 74.2%，在 ActivityNet 上為 42.9%，在 FineAction 上為 29.6%，在 HACS 上為 45.8%。消融研究驗證了我們方法的有效性，表明 Stem 模組中的雙重結構和遞迴機制優於傳統方法。我們的發現證明了基於 S6 的模型在 TAL 任務中的潛力，為未來的研究鋪平了道路。", "author": "Sangyoun Lee et.al.", "authors": "Sangyoun Lee, Juho Jung, Changdae Oh, Sunghee Yun", "id": "2407.13078v1", "paper_url": "http://arxiv.org/abs/2407.13078v1", "repo": "null"}}