{"2405.04307": {"publish_time": "2024-05-07", "title": "Improving Offline Reinforcement Learning with Inaccurate Simulators", "paper_summary": "Offline reinforcement learning (RL) provides a promising approach to avoid\ncostly online interaction with the real environment. However, the performance\nof offline RL highly depends on the quality of the datasets, which may cause\nextrapolation error in the learning process. In many robotic applications, an\ninaccurate simulator is often available. However, the data directly collected\nfrom the inaccurate simulator cannot be directly used in offline RL due to the\nwell-known exploration-exploitation dilemma and the dynamic gap between\ninaccurate simulation and the real environment. To address these issues, we\npropose a novel approach to combine the offline dataset and the inaccurate\nsimulation data in a better manner. Specifically, we pre-train a generative\nadversarial network (GAN) model to fit the state distribution of the offline\ndataset. Given this, we collect data from the inaccurate simulator starting\nfrom the distribution provided by the generator and reweight the simulated data\nusing the discriminator. Our experimental results in the D4RL benchmark and a\nreal-world manipulation task confirm that our method can benefit more from both\ninaccurate simulator and limited offline datasets to achieve better performance\nthan the state-of-the-art methods.", "paper_summary_zh": "離線強化學習 (RL) 提供一種有前途的方法來避免與真實環境進行代價高昂的線上互動。然而，離線 RL 的效能高度依賴於資料集的品質，這可能會在學習過程中導致外推誤差。在許多機器人應用中，通常可以使用不準確的模擬器。然而，由於眾所周知的探索開發兩難困境和不準確的模擬與真實環境之間的動態差距，無法直接在離線 RL 中使用從不準確的模擬器直接收集的資料。為了解決這些問題，我們提出了一種新方法，以更好的方式結合離線資料集和不準確的模擬資料。具體來說，我們預先訓練一個生成對抗網路 (GAN) 模型來擬合離線資料集的狀態分佈。有鑑於此，我們從產生器提供的分佈開始，從不準確的模擬器收集資料，並使用辨別器重新加權模擬資料。我們在 D4RL 基準和真實世界操作任務中的實驗結果證實，與最先進的方法相比，我們的模型可以從不準確的模擬器和有限的離線資料集中受益更多，以實現更好的效能。", "author": "Yiwen Hou et.al.", "authors": "Yiwen Hou, Haoyuan Sun, Jinming Ma, Feng Wu", "id": "2405.04307v1", "paper_url": "http://arxiv.org/abs/2405.04307v1", "repo": "null"}}