{"2504.18538": {"publish_time": "2025-04-25", "title": "Generalization Capability for Imitation Learning", "paper_summary": "Imitation learning holds the promise of equipping robots with versatile\nskills by learning from expert demonstrations. However, policies trained on\nfinite datasets often struggle to generalize beyond the training distribution.\nIn this work, we present a unified perspective on the generalization capability\nof imitation learning, grounded in both information theorey and data\ndistribution property. We first show that the generalization gap can be upper\nbounded by (i) the conditional information bottleneck on intermediate\nrepresentations and (ii) the mutual information between the model parameters\nand the training dataset. This characterization provides theoretical guidance\nfor designing effective training strategies in imitation learning, particularly\nin determining whether to freeze, fine-tune, or train large pretrained encoders\n(e.g., vision-language models or vision foundation models) from scratch to\nachieve better generalization. Furthermore, we demonstrate that high\nconditional entropy from input to output induces a flatter likelihood\nlandscape, thereby reducing the upper bound on the generalization gap. In\naddition, it shortens the stochastic gradient descent (SGD) escape time from\nsharp local minima, which may increase the likelihood of reaching global optima\nunder fixed optimization budgets. These insights explain why imitation learning\noften exhibits limited generalization and underscore the importance of not only\nscaling the diversity of input data but also enriching the variability of\noutput labels conditioned on the same input.", "paper_summary_zh": "<paragraph>模仿學習有望通過學習專家示範來讓機器人具備多種技能。然而，以有限數據集訓練的策略通常難以泛化到訓練分佈之外。在這項工作中，我們基於信息理論和數據分佈特性，提出了關於模仿學習泛化能力的統一觀點。我們首先證明，泛化差距可以由 (i) 中間表示上的條件信息瓶頸和 (ii) 模型參數與訓練數據集之間的互信息來設定上限。這種描述為設計有效的模仿學習訓練策略提供了理論指導，特別是在決定是否要凍結、微調或從頭開始訓練大型預訓練編碼器（例如，視覺語言模型或視覺基礎模型）以獲得更好的泛化能力方面。此外，我們證明了從輸入到輸出高條件熵會導致更平坦的似然景觀，從而降低泛化差距的上限。此外，它縮短了隨機梯度下降 (SGD) 從尖銳局部最小值逃逸的時間，這可能會增加在固定優化預算下達到全局最優值的可能性。這些見解解釋了為什麼模仿學習通常表現出有限的泛化能力，並強調了不僅要擴展輸入數據的多樣性，還要豐富相同輸入條件下輸出標籤的可變性的重要性。</paragraph>\n", "author": "Yixiao Wang et.al.", "authors": "Yixiao Wang", "id": "2504.18538v1", "paper_url": "http://arxiv.org/abs/2504.18538v1", "repo": "null"}}