{"2405.11891": {"publish_time": "2024-05-20", "title": "Unveiling and Manipulating Prompt Influence in Large Language Models", "paper_summary": "Prompts play a crucial role in guiding the responses of Large Language Models\n(LLMs). However, the intricate role of individual tokens in prompts, known as\ninput saliency, in shaping the responses remains largely underexplored.\nExisting saliency methods either misalign with LLM generation objectives or\nrely heavily on linearity assumptions, leading to potential inaccuracies. To\naddress this, we propose Token Distribution Dynamics (TDD), a\n\\textcolor{black}{simple yet effective} approach to unveil and manipulate the\nrole of prompts in generating LLM outputs. TDD leverages the robust\ninterpreting capabilities of the language model head (LM head) to assess input\nsaliency. It projects input tokens into the embedding space and then estimates\ntheir significance based on distribution dynamics over the vocabulary. We\nintroduce three TDD variants: forward, backward, and bidirectional, each\noffering unique insights into token relevance. Extensive experiments reveal\nthat the TDD surpasses state-of-the-art baselines with a big margin in\nelucidating the causal relationships between prompts and LLM outputs. Beyond\nmere interpretation, we apply TDD to two prompt manipulation tasks for\ncontrolled text generation: zero-shot toxic language suppression and sentiment\nsteering. Empirical results underscore TDD's proficiency in identifying both\ntoxic and sentimental cues in prompts, subsequently mitigating toxicity or\nmodulating sentiment in the generated content.", "paper_summary_zh": "提示在引导大型语言模型 (LLM) 的响应中扮演着至关重要的角色。然而，提示中各个标记的复杂作用，即输入显着性，在塑造响应方面仍然很大程度上未被探索。现有的显着性方法要么与 LLM 生成目标不一致，要么严重依赖线性假设，从而导致潜在的不准确性。为了解决这个问题，我们提出了标记分布动态 (TDD)，这是一种揭示和操纵提示在生成 LLM 输出中的作用的简单而有效的方法。TDD 利用语言模型头 (LM 头) 强大的解释能力来评估输入显着性。它将输入标记投影到嵌入空间，然后根据词汇表上的分布动态估计它们的显着性。我们引入了三种 TDD 变体：向前、向后和双向，每种变体都提供了对标记相关性的独特见解。广泛的实验表明，TDD 以很大的优势超越了最先进的基线，阐明了提示和 LLM 输出之间的因果关系。除了简单的解释之外，我们还将 TDD 应用于两个提示操作任务，用于受控文本生成：零样本有毒语言抑制和情感引导。经验结果强调了 TDD 在识别提示中的有毒和情感线索方面的能力，随后减轻了生成的文本中的毒性或调节了情感。", "author": "Zijian Feng et.al.", "authors": "Zijian Feng, Hanzhang Zhou, Zixiao Zhu, Junlang Qian, Kezhi Mao", "id": "2405.11891v1", "paper_url": "http://arxiv.org/abs/2405.11891v1", "repo": "https://github.com/zijian678/tdd"}}