{"2411.05348": {"publish_time": "2024-11-08", "title": "LLM-PySC2: Starcraft II learning environment for Large Language Models", "paper_summary": "This paper introduces a new environment LLM-PySC2 (the Large Language Model\nStarCraft II Learning Environment), a platform derived from DeepMind's\nStarCraft II Learning Environment that serves to develop Large Language Models\n(LLMs) based decision-making methodologies. This environment is the first to\noffer the complete StarCraft II action space, multi-modal observation\ninterfaces, and a structured game knowledge database, which are seamlessly\nconnected with various LLMs to facilitate the research of LLMs-based\ndecision-making. To further support multi-agent research, we developed an LLM\ncollaborative framework that supports multi-agent concurrent queries and\nmulti-agent communication. In our experiments, the LLM-PySC2 environment is\nadapted to be compatible with the StarCraft Multi-Agent Challenge (SMAC) task\ngroup and provided eight new scenarios focused on macro-decision abilities. We\nevaluated nine mainstream LLMs in the experiments, and results show that\nsufficient parameters are necessary for LLMs to make decisions, but improving\nreasoning ability does not directly lead to better decision-making outcomes.\nOur findings further indicate the importance of enabling large models to learn\nautonomously in the deployment environment through parameter training or\ntrain-free learning techniques. Ultimately, we expect that the LLM-PySC2\nenvironment can promote research on learning methods for LLMs, helping\nLLM-based methods better adapt to task scenarios.", "paper_summary_zh": "本文介紹了一個新環境 LLM-PySC2 (大型語言模型星海爭霸 II 學習環境)，一個源自 DeepMind 的星海爭霸 II 學習環境的平台，用於開發大型語言模型 (LLM) 為基礎的決策制定方法。此環境是第一個提供完整的星海爭霸 II 動作空間、多模式觀察介面和結構化遊戲知識資料庫的環境，這些環境與各種 LLM 無縫連接，以便於研究基於 LLM 的決策制定。為了進一步支援多重代理研究，我們開發了一個 LLM 協作架構，支援多重代理並發查詢和多重代理溝通。在我們的實驗中，LLM-PySC2 環境經過調整，與星海爭霸多重代理挑戰 (SMAC) 任務組相容，並提供了八個新的場景，專注於巨觀決策能力。我們在實驗中評估了九個主流 LLM，結果顯示，LLM 要做出決策需要足夠的參數，但改善推理能力並不會直接導致更好的決策制定結果。我們的發現進一步表明，讓大型模型能夠透過參數訓練或免訓練學習技術在部署環境中自主學習非常重要。最終，我們預期 LLM-PySC2 環境可以促進 LLM 學習方法的研究，協助基於 LLM 的方法更好地適應任務場景。", "author": "Zongyuan Li et.al.", "authors": "Zongyuan Li, Yanan Ni, Runnan Qi, Lumin Jiang, Chang Lu, Xiaojie Xu, Xiangbei Liu, Pengfei Li, Yunzheng Guo, Zhe Ma, Xian Guo, Kuihua Huang, Xuebo Zhang", "id": "2411.05348v1", "paper_url": "http://arxiv.org/abs/2411.05348v1", "repo": "null"}}