{"2406.14479": {"publish_time": "2024-06-20", "title": "On Layer-wise Representation Similarity: Application for Multi-Exit Models with a Single Classifier", "paper_summary": "Analyzing the similarity of internal representations within and across\ndifferent models has been an important technique for understanding the behavior\nof deep neural networks. Most existing methods for analyzing the similarity\nbetween representations of high dimensions, such as those based on Canonical\nCorrelation Analysis (CCA) and widely used Centered Kernel Alignment (CKA),\nrely on statistical properties of the representations for a set of data points.\nIn this paper, we focus on transformer models and study the similarity of\nrepresentations between the hidden layers of individual transformers. In this\ncontext, we show that a simple sample-wise cosine similarity metric is capable\nof capturing the similarity and aligns with the complicated CKA. Our\nexperimental results on common transformers reveal that representations across\nlayers are positively correlated, albeit the similarity decreases when layers\nare far apart. We then propose an aligned training approach to enhance the\nsimilarity between internal representations, with trained models that enjoy the\nfollowing properties: (1) the last-layer classifier can be directly applied\nright after any hidden layers, yielding intermediate layer accuracies much\nhigher than those under standard training, (2) the layer-wise accuracies\nmonotonically increase and reveal the minimal depth needed for the given task,\n(3) when served as multi-exit models, they achieve on-par performance with\nstandard multi-exit architectures which consist of additional classifiers\ndesigned for early exiting in shallow layers. To our knowledge, our work is the\nfirst to show that one common classifier is sufficient for multi-exit models.\nWe conduct experiments on both vision and NLP tasks to demonstrate the\nperformance of the proposed aligned training.", "paper_summary_zh": "<paragraph>分析不同模型內部表示的相似性一直是理解深度神經網路行為的重要技術。大多數現有的分析高維度表示相似性的方法，例如基於典範相關分析 (CCA) 和廣泛使用的中心核對齊 (CKA) 的方法，依賴於一組資料點表示的統計性質。在本文中，我們專注於Transformer模型，並研究個別Transformer隱藏層之間表示的相似性。在此背景下，我們展示了一個簡單的樣本級餘弦相似性指標能夠捕捉相似性並與複雜的 CKA 保持一致。我們在常見Transformer上的實驗結果表明，跨層表示呈正相關，儘管在層相距甚遠時相似性會降低。然後我們提出了一種對齊訓練方法來增強內部表示之間的相似性，訓練後的模型具有以下特性：(1) 最後一層分類器可以直接應用於任何隱藏層之後，產生比標準訓練下高的中間層準確度，(2) 層級準確度單調增加，並揭示給定任務所需的最小深度，(3) 當作為多出口模型時，它們實現了與標準多出口架構同等的效能，後者由額外的分類器組成，這些分類器設計用於在淺層中提前退出。據我們所知，我們的研究首次表明一個通用分類器對於多出口模型就足夠了。我們在視覺和 NLP 任務上進行了實驗，以展示所提出的對齊訓練的效能。</paragraph>", "author": "Jiachen Jiang et.al.", "authors": "Jiachen Jiang, Jinxin Zhou, Zhihui Zhu", "id": "2406.14479v1", "paper_url": "http://arxiv.org/abs/2406.14479v1", "repo": "null"}}