{"2408.02111": {"publish_time": "2024-08-04", "title": "Understanding Deep Learning via Notions of Rank", "paper_summary": "Despite the extreme popularity of deep learning in science and industry, its\nformal understanding is limited. This thesis puts forth notions of rank as key\nfor developing a theory of deep learning, focusing on the fundamental aspects\nof generalization and expressiveness. In particular, we establish that\ngradient-based training can induce an implicit regularization towards low rank\nfor several neural network architectures, and demonstrate empirically that this\nphenomenon may facilitate an explanation of generalization over natural data\n(e.g., audio, images, and text). Then, we characterize the ability of graph\nneural networks to model interactions via a notion of rank, which is commonly\nused for quantifying entanglement in quantum physics. A central tool underlying\nthese results is a connection between neural networks and tensor\nfactorizations. Practical implications of our theory for designing explicit\nregularization schemes and data preprocessing algorithms are presented.", "paper_summary_zh": "儘管深度學習在科學和產業中廣受歡迎，但其正式理解仍受限。本論文提出秩的概念，作為發展深度學習理論的關鍵，專注於泛化和表現力的基本面向。特別是，我們確立基於梯度的訓練可以對多個神經網路結構誘導出低秩的隱式正則化，並透過實證證明此現象有助於解釋自然資料（例如音訊、影像和文字）的泛化。接著，我們透過秩的概念描述圖形神經網路建模互動的能力，這通常用於量化量子物理中的糾纏。這些結果背後的一個核心工具是神經網路和張量分解之間的關聯。本理論在設計明確的正則化架構和資料前處理演算法上的實務意涵已獲得說明。", "author": "Noam Razin et.al.", "authors": "Noam Razin", "id": "2408.02111v1", "paper_url": "http://arxiv.org/abs/2408.02111v1", "repo": "null"}}