{"2407.16822": {"publish_time": "2024-07-23", "title": "AI-Enhanced 7-Point Checklist for Melanoma Detection Using Clinical Knowledge Graphs and Data-Driven Quantification", "paper_summary": "The 7-point checklist (7PCL) is widely used in dermoscopy to identify\nmalignant melanoma lesions needing urgent medical attention. It assigns point\nvalues to seven attributes: major attributes are worth two points each, and\nminor ones are worth one point each. A total score of three or higher prompts\nfurther evaluation, often including a biopsy. However, a significant limitation\nof current methods is the uniform weighting of attributes, which leads to\nimprecision and neglects their interconnections. Previous deep learning studies\nhave treated the prediction of each attribute with the same importance as\npredicting melanoma, which fails to recognize the clinical significance of the\nattributes for melanoma. To address these limitations, we introduce a novel\ndiagnostic method that integrates two innovative elements: a Clinical\nKnowledge-Based Topological Graph (CKTG) and a Gradient Diagnostic Strategy\nwith Data-Driven Weighting Standards (GD-DDW). The CKTG integrates 7PCL\nattributes with diagnostic information, revealing both internal and external\nassociations. By employing adaptive receptive domains and weighted edges, we\nestablish connections among melanoma's relevant features. Concurrently, GD-DDW\nemulates dermatologists' diagnostic processes, who first observe the visual\ncharacteristics associated with melanoma and then make predictions. Our model\nuses two imaging modalities for the same lesion, ensuring comprehensive feature\nacquisition. Our method shows outstanding performance in predicting malignant\nmelanoma and its features, achieving an average AUC value of 85%. This was\nvalidated on the EDRA dataset, the largest publicly available dataset for the\n7-point checklist algorithm. Specifically, the integrated weighting system can\nprovide clinicians with valuable data-driven benchmarks for their evaluations.", "paper_summary_zh": "7 點檢查表 (7PCL) 廣泛用於皮膚鏡檢查，以識別需要緊急醫療照護的惡性黑色素瘤病灶。它為七個屬性分配分數：主要屬性各值兩分，次要屬性各值一分。總分為三或以上表示需要進一步評估，通常包括活檢。然而，目前方法的一個重大限制是屬性的統一加權，導致不精確且忽略它們之間的相互關聯。先前的深度學習研究將每個屬性的預測視為與預測黑色素瘤同等重要，這未能認識到屬性對黑色素瘤的臨床意義。為了解決這些限制，我們引入一種新的診斷方法，結合了兩個創新元素：基於臨床知識的拓撲圖 (CKTG) 和具有數據驅動加權標準的梯度診斷策略 (GD-DDW)。CKTG 將 7PCL 屬性與診斷信息整合在一起，揭示了內部和外部關聯。通過採用自適應感受域和加權邊緣，我們建立了黑色素瘤相關特徵之間的聯繫。同時，GD-DDW 模仿皮膚科醫生的診斷過程，他們首先觀察與黑色素瘤相關的視覺特徵，然後做出預測。我們的模型對同一個病灶使用兩種成像方式，確保全面獲取特徵。我們的這種方法在預測惡性黑色素瘤及其特徵方面表現出色，平均 AUC 值達到 85%。這已在 EDRA 數據集上得到驗證，該數據集是 7 點檢查表算法最大的公開可用數據集。具體來說，集成的加權系統可以為臨床醫生提供有價值的數據驅動基準，供他們評估。", "author": "Yuheng Wang et.al.", "authors": "Yuheng Wang, Tianze Yu, Jiayue Cai, Sunil Kalia, Harvey Lui, Z. Jane Wang, Tim K. Lee", "id": "2407.16822v1", "paper_url": "http://arxiv.org/abs/2407.16822v1", "repo": "null"}}