{"2407.06930": {"publish_time": "2024-07-09", "title": "Integrating Ontology Design with the CRISP-DM in the context of Cyber-Physical Systems Maintenance", "paper_summary": "In the following contribution, a method is introduced that integrates domain\nexpert-centric ontology design with the Cross-Industry Standard Process for\nData Mining (CRISP-DM). This approach aims to efficiently build an\napplication-specific ontology tailored to the corrective maintenance of\nCyber-Physical Systems (CPS). The proposed method is divided into three phases.\nIn phase one, ontology requirements are systematically specified, defining the\nrelevant knowledge scope. Accordingly, CPS life cycle data is contextualized in\nphase two using domain-specific ontological artifacts. This formalized domain\nknowledge is then utilized in the CRISP-DM to efficiently extract new insights\nfrom the data. Finally, the newly developed data-driven model is employed to\npopulate and expand the ontology. Thus, information extracted from this model\nis semantically annotated and aligned with the existing ontology in phase\nthree. The applicability of this method has been evaluated in an anomaly\ndetection case study for a modular process plant.", "paper_summary_zh": "在以下貢獻中，引入了一種方法，將領域專家為中心的本体設計與資料探勘的跨產業標準程序 (CRISP-DM) 整合。此方法旨在有效建構一個特定於應用程式的本体，專門用於網路實體系統 (CPS) 的矯正維護。所提出的方法分為三個階段。在第一階段，本体需求經過系統性地指定，定義相關的知識範圍。相應地，CPS 生命週期資料在第二階段使用特定於領域的本体工件進行情境化。然後在 CRISP-DM 中利用這個形式化的領域知識，從資料中有效地萃取新的見解。最後，使用新開發的資料驅動模型來填充和擴展本体。因此，從此模型萃取的資訊在第三階段經過語義註解，並與現有的本体對齊。這種方法的適用性已在模組化程序工廠的異常偵測案例研究中獲得評估。", "author": "Milapji Singh Gill et.al.", "authors": "Milapji Singh Gill, Tom Westermann, Gernot Steindl, Felix Gehlhoff, Alexander Fay", "id": "2407.06930v1", "paper_url": "http://arxiv.org/abs/2407.06930v1", "repo": "null"}}