{"2412.17438": {"publish_time": "2024-12-23", "title": "Markov Process-Based Graph Convolutional Networks for Entity Classification in Knowledge Graphs", "paper_summary": "Despite the vast amount of information encoded in Knowledge Graphs (KGs),\ninformation about the class affiliation of entities remains often incomplete.\nGraph Convolutional Networks (GCNs) have been shown to be effective predictors\nof complete information about the class affiliation of entities in KGs.\nHowever, these models do not learn the class affiliation of entities in KGs\nincorporating the complexity of the task, which negatively affects the models\nprediction capabilities. To address this problem, we introduce a Markov\nprocess-based architecture into well-known GCN architectures. This end-to-end\nnetwork learns the prediction of class affiliation of entities in KGs within a\nMarkov process. The number of computational steps is learned during training\nusing a geometric distribution. At the same time, the loss function combines\ninsights from the field of evidential learning. The experiments show a\nperformance improvement over existing models in several studied architectures\nand datasets. Based on the chosen hyperparameters for the geometric\ndistribution, the expected number of computation steps can be adjusted to\nimprove efficiency and accuracy during training.", "paper_summary_zh": "儘管知識圖譜 (KGs) 中編碼了大量的資訊，\n關於實體類別關聯的資訊常常是不完整的。\n圖形卷積網路 (GCNs) 已被證明是有效預測 KGs 中實體類別關聯的完整資訊。\n然而，這些模型並未學習 KGs 中實體的類別關聯，\n結合任務的複雜性，這對模型的預測能力產生了負面影響。\n為了解決這個問題，我們將基於馬可夫過程的架構引入眾所周知的 GCN 架構中。\n這個端對端網路在馬可夫過程中學習預測 KGs 中實體的類別關聯。\n計算步驟的數量在訓練期間使用幾何分佈學習。\n同時，損失函數結合了證據學習領域的見解。\n實驗顯示，在幾個研究的架構和資料集中的效能優於現有模型。\n根據幾何分佈所選取的超參數，預期的計算步驟數量可以調整，\n以提高訓練期間的效率和準確度。", "author": "Johannes Mäkelburg et.al.", "authors": "Johannes Mäkelburg, Yiwen Peng, Mehwish Alam, Tobias Weller, Maribel Acosta", "id": "2412.17438v1", "paper_url": "http://arxiv.org/abs/2412.17438v1", "repo": "null"}}