{"2410.12577": {"publish_time": "2024-10-16", "title": "On the Utility of Domain Modeling Assistance with Large Language Models", "paper_summary": "Model-driven engineering (MDE) simplifies software development through\nabstraction, yet challenges such as time constraints, incomplete domain\nunderstanding, and adherence to syntactic constraints hinder the design\nprocess. This paper presents a study to evaluate the usefulness of a novel\napproach utilizing large language models (LLMs) and few-shot prompt learning to\nassist in domain modeling. The aim of this approach is to overcome the need for\nextensive training of AI-based completion models on scarce domain-specific\ndatasets and to offer versatile support for various modeling activities,\nproviding valuable recommendations to software modelers. To support this\napproach, we developed MAGDA, a user-friendly tool, through which we conduct a\nuser study and assess the real-world applicability of our approach in the\ncontext of domain modeling, offering valuable insights into its usability and\neffectiveness.", "paper_summary_zh": "模型驅動工程 (MDE) 透過抽象簡化軟體開發，但時間限制、不完整的領域理解和對語法約束的堅持等挑戰阻礙了設計流程。本文提出了一項研究，以評估一種新方法的實用性，該方法利用大型語言模型 (LLM) 和少次提示學習來協助領域建模。此方法的目標是克服在稀缺的特定領域資料集上對基於 AI 的完成模型進行廣泛訓練的需求，並為各種建模活動提供多功能支援，為軟體建模人員提供有價值的建議。為了支援此方法，我們開發了一個使用者友善的工具 MAGDA，透過該工具，我們進行使用者研究並評估我們的方法在領域建模中的實際適用性，提供對其可用性和有效性的寶貴見解。", "author": "Meriem Ben Chaaben et.al.", "authors": "Meriem Ben Chaaben, Lola Burgueño, Istvan David, Houari Sahraoui", "id": "2410.12577v1", "paper_url": "http://arxiv.org/abs/2410.12577v1", "repo": "null"}}