{"2406.03283": {"publish_time": "2024-06-05", "title": "Enhancing Repository-Level Code Generation with Integrated Contextual Information", "paper_summary": "Large language models (LLMs) have demonstrated remarkable capabilities in\ncode generation tasks. However, repository-level code generation presents\nunique challenges, particularly due to the need to utilize information spread\nacross multiple files within a repository. Existing retrieval-based approaches\nsometimes fall short as they are limited in obtaining a broader and deeper\nrepository context. In this paper, we present CatCoder, a novel code generation\nframework designed for statically typed programming languages. CatCoder\nenhances repository-level code generation by integrating relevant code and type\ncontext. Specifically, it leverages static analyzers to extract type\ndependencies and merges this information with retrieved code to create\ncomprehensive prompts for LLMs. To evaluate the effectiveness of CatCoder, we\nadapt and construct benchmarks that include 199 Java tasks and 90 Rust tasks.\nThe results show that CatCoder outperforms the RepoCoder baseline by up to\n17.35%, in terms of pass@k score. Furthermore, the generalizability of CatCoder\nis assessed using various LLMs, including both code-specialized models and\ngeneral-purpose models. Our findings indicate consistent performance\nimprovements across all models, which underlines the practicality of CatCoder.", "paper_summary_zh": "大型語言模型 (LLM) 已在程式碼產生任務中展現出驚人的能力。然而，儲存庫層級的程式碼產生會帶來獨特的挑戰，特別是因為需要利用散佈在儲存庫中多個檔案中的資訊。現有的基於檢索的方法有時會不足，因為它們在取得更廣泛和深入的儲存庫內容方面受到限制。在本文中，我們提出 CatCoder，一個專為靜態類型程式語言設計的新穎程式碼產生架構。CatCoder 透過整合相關程式碼和類型內容來增強儲存庫層級的程式碼產生。具體來說，它利用靜態分析器來提取類型依賴性，並將此資訊與檢索的程式碼合併，以建立 LLM 的全面提示。為了評估 CatCoder 的有效性，我們調整並建構包含 199 個 Java 任務和 90 個 Rust 任務的基準。結果顯示，CatCoder 在 pass@k 分數方面優於 RepoCoder 基準，最多可達 17.35%。此外，CatCoder 的泛化能力使用各種 LLM 來評估，包括程式碼專用模型和通用模型。我們的研究結果表明，所有模型的效能都有持續的提升，這突顯了 CatCoder 的實用性。", "author": "Zhiyuan Pan et.al.", "authors": "Zhiyuan Pan, Xing Hu, Xin Xia, Xiaohu Yang", "id": "2406.03283v1", "paper_url": "http://arxiv.org/abs/2406.03283v1", "repo": "null"}}