{"2501.01336": {"publish_time": "2025-01-02", "title": "Aligning Large Language Models for Faithful Integrity Against Opposing Argument", "paper_summary": "Large Language Models (LLMs) have demonstrated impressive capabilities in\ncomplex reasoning tasks. However, they can be easily misled by unfaithful\narguments during conversations, even when their original statements are\ncorrect. To this end, we investigate the problem of maintaining faithful\nintegrity in LLMs. This involves ensuring that LLMs adhere to their faithful\nstatements in the face of opposing arguments and are able to correct their\nincorrect statements when presented with faithful arguments. In this work, we\npropose a novel framework, named Alignment for Faithful Integrity with\nConfidence Estimation (AFICE), which aims to align the LLM responses with\nfaithful integrity. Specifically, AFICE first designs a Bilateral Confidence\nEstimation (BCE) approach for estimating the uncertainty of each response\ngenerated by the LLM given a specific context, which simultaneously estimate\nthe model's confidence to the question based on the internal states during\ndecoding as well as to the answer based on cumulative probability ratios. With\nthe BCE, we construct a conversational preference dataset composed of context,\noriginal statement, and argument, which is adopted for aligning the LLM for\nfaithful integrity using Direct Preference Optimization (DPO). Extensive\nexperimental results on a wide range of benchmarks demonstrate significant\nimprovements in the LLM's ability to maintain faithful responses when\nencountering opposing arguments, ensuring both the practical utility and\ntrustworthiness of LLMs in complex interactive settings. Code and data will be\nreleased via https://github.com/zhaoy777/AFICE.git", "paper_summary_zh": "大型語言模型 (LLM) 在複雜推理任務中展現出令人印象深刻的能力。然而，即使它們的原始陳述正確，它們也可能在對話中輕易被不忠實的論點誤導。為此，我們研究了在 LLM 中維持忠實性的問題。這包括確保 LLM 在面對反對論點時堅持其忠實陳述，並能夠在提出忠實論點時糾正其不正確的陳述。在這項工作中，我們提出了一個名為「具有信心估計的忠實整合對齊」(AFICE) 的新框架，旨在將 LLM 回應與忠實整合保持一致。具體來說，AFICE 首先設計了一個雙邊信心估計 (BCE) 方法，用於估計 LLM 在特定背景下產生的每個回應的不確定性，它同時估計模型在解碼過程中基於內部狀態對問題的信心，以及基於累積機率比對答案的信心。有了 BCE，我們構建了一個對話偏好資料集，其中包含背景、原始陳述和論點，它被用於使用直接偏好最佳化 (DPO) 來調整 LLM 以獲得忠實的整合。在廣泛基準上的大量實驗結果證明，在遇到反對論點時，LLM 維持忠實回應的能力有顯著的提升，確保了 LLM 在複雜互動設定中的實用性和可信度。程式碼和資料將透過 https://github.com/zhaoy777/AFICE.git 發布", "author": "Yong Zhao et.al.", "authors": "Yong Zhao, Yang Deng, See-Kiong Ng, Tat-Seng Chua", "id": "2501.01336v1", "paper_url": "http://arxiv.org/abs/2501.01336v1", "repo": "null"}}