{"2411.03966": {"publish_time": "2024-11-06", "title": "WorryWords: Norms of Anxiety Association for over 44k English Words", "paper_summary": "Anxiety, the anticipatory unease about a potential negative outcome, is a\ncommon and beneficial human emotion. However, there is still much that is not\nknown, such as how anxiety relates to our body and how it manifests in\nlanguage. This is especially pertinent given the increasing impact of\nanxiety-related disorders. In this work, we introduce WorryWords, the first\nlarge-scale repository of manually derived word--anxiety associations for over\n44,450 English words. We show that the anxiety associations are highly\nreliable. We use WorryWords to study the relationship between anxiety and other\nemotion constructs, as well as the rate at which children acquire anxiety words\nwith age. Finally, we show that using WorryWords alone, one can accurately\ntrack the change of anxiety in streams of text. The lexicon enables a wide\nvariety of anxiety-related research in psychology, NLP, public health, and\nsocial sciences. WorryWords (and its translations to over 100 languages) is\nfreely available. http://saifmohammad.com/worrywords.html", "paper_summary_zh": "焦慮，對潛在負面結果的預期不安，是一種常見且有益的人類情緒。然而，仍有許多未知，例如焦慮如何與我們的身體相關，以及它如何在語言中表現出來。這一點尤其重要，因為與焦慮相關的疾病影響越來越大。在這項工作中，我們介紹了 WorryWords，這是第一個大規模的人工派生詞彙——焦慮關聯儲存庫，包含超過 44,450 個英文單字。我們證明了焦慮關聯具有高度可靠性。我們使用 WorryWords 來研究焦慮與其他情緒建構之間的關係，以及兒童隨著年齡增長而習得焦慮詞彙的速度。最後，我們證明了僅使用 WorryWords，就可以準確追蹤文字串流中的焦慮變化。此詞彙表使心理學、自然語言處理、公共衛生和社會科學中各種與焦慮相關的研究成為可能。WorryWords（及其翻譯成 100 多種語言）是免費提供的。http://saifmohammad.com/worrywords.html", "author": "Saif M. Mohammad et.al.", "authors": "Saif M. Mohammad", "id": "2411.03966v1", "paper_url": "http://arxiv.org/abs/2411.03966v1", "repo": "null"}}