{"2407.16833": {"publish_time": "2024-07-23", "title": "Retrieval Augmented Generation or Long-Context LLMs? A Comprehensive Study and Hybrid Approach", "paper_summary": "Retrieval Augmented Generation (RAG) has been a powerful tool for Large\nLanguage Models (LLMs) to efficiently process overly lengthy contexts. However,\nrecent LLMs like Gemini-1.5 and GPT-4 show exceptional capabilities to\nunderstand long contexts directly. We conduct a comprehensive comparison\nbetween RAG and long-context (LC) LLMs, aiming to leverage the strengths of\nboth. We benchmark RAG and LC across various public datasets using three latest\nLLMs. Results reveal that when resourced sufficiently, LC consistently\noutperforms RAG in terms of average performance. However, RAG's significantly\nlower cost remains a distinct advantage. Based on this observation, we propose\nSelf-Route, a simple yet effective method that routes queries to RAG or LC\nbased on model self-reflection. Self-Route significantly reduces the\ncomputation cost while maintaining a comparable performance to LC. Our findings\nprovide a guideline for long-context applications of LLMs using RAG and LC.", "paper_summary_zh": "檢索增強生成（RAG）一直是大型語言模型（LLM）有效處理過於冗長的內容的強大工具。然而，最近的 LLM，例如 Gemini-1.5 和 GPT-4，表現出直接理解長內容的非凡能力。我們對 RAG 和長內容（LC）LLM 進行了全面的比較，旨在利用兩者的優勢。我們使用三個最新的 LLM 對各種公共數據集對 RAG 和 LC 進行了基準測試。結果表明，當資源充足時，LC 在平均性能方面始終優於 RAG。然而，RAG 明顯較低的成本仍然是一個顯著的優勢。基於這一觀察，我們提出了 Self-Route，這是一種簡單但有效的方法，它根據模型自我反射將查詢路由到 RAG 或 LC。Self-Route 大幅降低了運算成本，同時保持與 LC 相當的性能。我們的研究結果為使用 RAG 和 LC 的 LLM 的長內容應用提供了指導方針。", "author": "Zhuowan Li et.al.", "authors": "Zhuowan Li, Cheng Li, Mingyang Zhang, Qiaozhu Mei, Michael Bendersky", "id": "2407.16833v1", "paper_url": "http://arxiv.org/abs/2407.16833v1", "repo": "null"}}