{"2411.05196": {"publish_time": "2024-11-07", "title": "Explainable AI through a Democratic Lens: DhondtXAI for Proportional Feature Importance Using the D'Hondt Method", "paper_summary": "In democratic societies, electoral systems play a crucial role in translating\npublic preferences into political representation. Among these, the D'Hondt\nmethod is widely used to ensure proportional representation, balancing fair\nrepresentation with governmental stability. Recently, there has been a growing\ninterest in applying similar principles of proportional representation to\nenhance interpretability in machine learning, specifically in Explainable AI\n(XAI). This study investigates the integration of D'Hondt-based voting\nprinciples in the DhondtXAI method, which leverages resource allocation\nconcepts to interpret feature importance within AI models. Through a comparison\nof SHAP (Shapley Additive Explanations) and DhondtXAI, we evaluate their\neffectiveness in feature attribution within CatBoost and XGBoost models for\nbreast cancer and diabetes prediction, respectively. The DhondtXAI approach\nallows for alliance formation and thresholding to enhance interpretability,\nrepresenting feature importance as seats in a parliamentary view. Statistical\ncorrelation analyses between SHAP values and DhondtXAI allocations support the\nconsistency of interpretations, demonstrating DhondtXAI's potential as a\ncomplementary tool for understanding feature importance in AI models. The\nresults highlight that integrating electoral principles, such as proportional\nrepresentation and alliances, into AI explainability can improve user\nunderstanding, especially in high-stakes fields like healthcare.", "paper_summary_zh": "在民主社會中，選舉制度在將公眾偏好轉化為政治代表方面發揮著至關重要的作用。其中，D'Hondt 方法被廣泛用於確保比例代表制，在公平代表與政府穩定性之間取得平衡。最近，人們越來越有興趣將類似的比例代表原則應用於增強機器學習中的可解釋性，特別是在可解釋 AI (XAI) 中。本研究探討了將基於 D'Hondt 的投票原則整合到 DhondtXAI 方法中的方法，該方法利用資源分配概念來解釋 AI 模型中的特徵重要性。通過比較 SHAP（Shapley 加性解釋）和 DhondtXAI，我們評估了它們在 CatBoost 和 XGBoost 模型中分別對乳腺癌和糖尿病預測進行特徵歸因的有效性。DhondtXAI 方法允許聯盟形成和閾值化以增強可解釋性，將特徵重要性表示為議會觀點中的席位。SHAP 值和 DhondtXAI 分配之間的統計相關性分析支持解釋的一致性，證明了 DhondtXAI 作為理解 AI 模型中特徵重要性的補充工具的潛力。結果表明，將選舉原則（例如比例代表制和聯盟）整合到 AI 可解釋性中可以提高用戶的理解，特別是在醫療保健等高風險領域。", "author": "Turker Berk Donmez et.al.", "authors": "Turker Berk Donmez", "id": "2411.05196v1", "paper_url": "http://arxiv.org/abs/2411.05196v1", "repo": "null"}}