{"2504.07717": {"publish_time": "2025-04-10", "title": "PR-Attack: Coordinated Prompt-RAG Attacks on Retrieval-Augmented Generation in Large Language Models via Bilevel Optimization", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable performance across\na wide range of applications, e.g., medical question-answering, mathematical\nsciences, and code generation. However, they also exhibit inherent limitations,\nsuch as outdated knowledge and susceptibility to hallucinations.\nRetrieval-Augmented Generation (RAG) has emerged as a promising paradigm to\naddress these issues, but it also introduces new vulnerabilities. Recent\nefforts have focused on the security of RAG-based LLMs, yet existing attack\nmethods face three critical challenges: (1) their effectiveness declines\nsharply when only a limited number of poisoned texts can be injected into the\nknowledge database, (2) they lack sufficient stealth, as the attacks are often\ndetectable by anomaly detection systems, which compromises their effectiveness,\nand (3) they rely on heuristic approaches to generate poisoned texts, lacking\nformal optimization frameworks and theoretic guarantees, which limits their\neffectiveness and applicability. To address these issues, we propose\ncoordinated Prompt-RAG attack (PR-attack), a novel optimization-driven attack\nthat introduces a small number of poisoned texts into the knowledge database\nwhile embedding a backdoor trigger within the prompt. When activated, the\ntrigger causes the LLM to generate pre-designed responses to targeted queries,\nwhile maintaining normal behavior in other contexts. This ensures both high\neffectiveness and stealth. We formulate the attack generation process as a\nbilevel optimization problem leveraging a principled optimization framework to\ndevelop optimal poisoned texts and triggers. Extensive experiments across\ndiverse LLMs and datasets demonstrate the effectiveness of PR-Attack, achieving\na high attack success rate even with a limited number of poisoned texts and\nsignificantly improved stealth compared to existing methods.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 在各種應用中展現了卓越的性能，例如醫療問答、數學科學和程式碼生成。然而，它們也存在固有的局限性，例如知識過時和容易產生幻覺。檢索增強生成 (RAG) 已成為解決這些問題的一個很有前景的範例，但它也引入了新的漏洞。最近的研究工作集中在基於 RAG 的 LLM 的安全性上，但現有的攻擊方法面臨三個關鍵挑戰：(1) 當只能將有限數量的投毒文本注入知識庫時，它們的有效性會急劇下降；(2) 它們缺乏足夠的隱蔽性，因為攻擊通常可以被異常檢測系統檢測到，從而損害其有效性；(3) 它們依賴於啟發式方法來生成投毒文本，缺乏正式的優化框架和理論保證，這限制了它們的有效性和適用性。為了應對這些問題，我們提出了協調式提示-RAG 攻擊（PR 攻擊），這是一種新穎的優化驅動型攻擊，它將少量投毒文本引入知識庫，同時在提示中嵌入後門觸發器。觸發後，觸發器會導致 LLM 對目標查詢生成預先設計的響應，同時在其他情況下保持正常行為。這確保了高效性和隱蔽性。我們將攻擊生成過程制定為一個雙層優化問題，利用有原則的優化框架來開發最佳的投毒文本和觸發器。跨不同 LLM 和數據集的大量實驗證明了 PR 攻擊的有效性，即使在投毒文本數量有限的情況下也能實現很高的攻擊成功率，並且與現有方法相比，隱蔽性也顯著提高。</paragraph>\n", "author": "Yang Jiao et.al.", "authors": "Yang Jiao, Xiaodong Wang, Kai Yang", "id": "2504.07717v1", "paper_url": "http://arxiv.org/abs/2504.07717v1", "repo": "null"}}