{"2501.03035": {"publish_time": "2025-01-06", "title": "Quantization Meets Reasoning: Exploring LLM Low-Bit Quantization Degradation for Mathematical Reasoning", "paper_summary": "Large language models have achieved significant advancements in complex\nmathematical reasoning benchmarks, such as MATH. However, their substantial\ncomputational requirements present challenges for practical deployment. Model\nquantization has emerged as an effective strategy to reduce memory usage and\ncomputational costs by employing lower precision and bit-width representations.\nIn this study, we systematically evaluate the impact of quantization on\nmathematical reasoning tasks. We introduce a multidimensional evaluation\nframework that qualitatively assesses specific capability dimensions and\nconduct quantitative analyses on the step-by-step outputs of various\nquantization methods. Our results demonstrate that quantization differentially\naffects numerical computation and reasoning planning abilities, identifying key\nareas where quantized models experience performance degradation.", "paper_summary_zh": "大型語言模型在複雜數學推理基準中取得顯著進展，例如 MATH。然而，它們大量的運算需求對實際部署提出了挑戰。模型量化已成為一種有效的策略，透過採用較低精度和位寬表示來減少記憶體用量和運算成本。在本研究中，我們系統性地評估量化對數學推理任務的影響。我們引入了一個多維評估框架，定性評估特定的能力維度，並對各種量化方法的逐步輸出進行定量分析。我們的結果表明，量化對數值計算和推理規劃能力有不同的影響，找出量化模型效能下降的主要領域。", "author": "Zhen Li et.al.", "authors": "Zhen Li, Yupeng Su, Runming Yang, Zhongwei Xie, Ngai Wong, Hongxia Yang", "id": "2501.03035v1", "paper_url": "http://arxiv.org/abs/2501.03035v1", "repo": "null"}}