{"2410.22020": {"publish_time": "2024-10-29", "title": "Path-based summary explanations for graph recommenders -- extended version", "paper_summary": "Path-based explanations provide intrinsic insights into graph-based\nrecommendation models. However, most previous work has focused on explaining an\nindividual recommendation of an item to a user. In this paper, we propose\nsummary explanations, i.e., explanations that highlight why a user or a group\nof users receive a set of item recommendations and why an item, or a group of\nitems, is recommended to a set of users as an effective means to provide\ninsights into the collective behavior of the recommender. We also present a\nnovel method to summarize explanations using efficient graph algorithms,\nspecifically the Steiner Tree and the Prize-Collecting Steiner Tree. Our\napproach reduces the size and complexity of summary explanations while\npreserving essential information, making explanations more comprehensible for\nusers and more useful to model developers. Evaluations across multiple metrics\ndemonstrate that our summaries outperform baseline explanation methods in most\nscenarios, in a variety of quality aspects.", "paper_summary_zh": "基於路徑的解釋提供對基於圖形的推薦模型的內在見解。然而，大多數以前的工作都專注於向使用者解釋對某個項目的個別推薦。在本文中，我們提出摘要解釋，即解釋強調為何使用者或一組使用者收到一組項目推薦，以及為何將項目或一組項目推薦給一組使用者，作為提供對推薦者的集體行為的見解的有效方法。我們還提出了一種使用有效圖形演算法，特別是 Steiner 樹和獎勵收集 Steiner 樹，來總結解釋的新方法。我們的做法減少了摘要解釋的大小和複雜性，同時保留了基本資訊，使解釋對使用者來說更易於理解，對模型開發人員來說更有用。跨多個指標的評估表明，我們的摘要在各種品質方面，在大多數情況下都優於基線解釋方法。", "author": "Danae Pla Karidi et.al.", "authors": "Danae Pla Karidi, Evaggelia Pitoura", "id": "2410.22020v1", "paper_url": "http://arxiv.org/abs/2410.22020v1", "repo": "https://github.com/xsum-rec/xsum"}}