{"2411.12828": {"publish_time": "2024-11-19", "title": "Probing the Capacity of Language Model Agents to Operationalize Disparate Experiential Context Despite Distraction", "paper_summary": "Large language model (LLM) agents show promise in an increasing number of\ndomains. In many proposed applications, it is expected that the agent reasons\nover accumulated experience presented in an input prompt. We propose the OEDD\n(Operationalize Experience Despite Distraction) corpus, a\nhuman-annotator-validated body of scenarios with pre-scripted agent histories\nwhere the agent must make a decision based on disparate experiential\ninformation in the presence of a distractor. We evaluate three state-of-the-art\nLLMs (GPT-3.5 Turbo, GPT-4o, and Gemini 1.5 Pro) using a minimal\nchain-of-thought prompting strategy and observe that when (1) the input context\ncontains over 1,615 tokens of historical interactions, (2) a crucially\ndecision-informing premise is the rightful conclusion over two disparate\nenvironment premises, and (3) a trivial, but distracting red herring fact\nfollows, all LLMs perform worse than random choice at selecting the better of\ntwo actions. Our code and test corpus are publicly available at:\nhttps://github.com/sonnygeorge/OEDD .", "paper_summary_zh": "大型語言模型 (LLM) 代理在越來越多的領域中展現出潛力。在許多提議的應用中，預計代理會根據輸入提示中呈現的累積經驗進行推理。我們提出 OEDD（儘管有干擾也能操作經驗）語料庫，這是一個由人工註解員驗證的場景主體，其中包含預先編寫的代理歷史記錄，代理必須根據分散的體驗資訊在干擾因素存在的情況下做出決策。我們使用最小的思考鏈提示策略評估了三個最先進的 LLM（GPT-3.5 Turbo、GPT-4o 和 Gemini 1.5 Pro），並觀察到當（1）輸入內容包含超過 1,615 個歷次互動的符號，（2）一個至關重要的決策依據前提是對兩個不同的環境前提的正確結論，以及（3）一個微不足道但令人分心的錯誤線索事實緊隨其後，所有 LLM 在選擇兩個動作中較好的動作時表現都比隨機選擇差。我們的程式碼和測試語料庫可於以下網址公開取得：https://github.com/sonnygeorge/OEDD。", "author": "Sonny George et.al.", "authors": "Sonny George, Chris Sypherd, Dylan Cashman", "id": "2411.12828v1", "paper_url": "http://arxiv.org/abs/2411.12828v1", "repo": "https://github.com/sonnygeorge/oedd"}}