{"2409.16032": {"publish_time": "2024-09-24", "title": "Deep chroma compression of tone-mapped images", "paper_summary": "Acquisition of high dynamic range (HDR) images is thriving due to the\nincreasing use of smart devices and the demand for high-quality output.\nExtensive research has focused on developing methods for reducing the luminance\nrange in HDR images using conventional and deep learning-based tone mapping\noperators to enable accurate reproduction on conventional 8 and 10-bit digital\ndisplays. However, these methods often fail to account for pixels that may lie\noutside the target display's gamut, resulting in visible chromatic distortions\nor color clipping artifacts. Previous studies suggested that a gamut management\nstep ensures that all pixels remain within the target gamut. However, such\napproaches are computationally expensive and cannot be deployed on devices with\nlimited computational resources. We propose a generative adversarial network\nfor fast and reliable chroma compression of HDR tone-mapped images. We design a\nloss function that considers the hue property of generated images to improve\ncolor accuracy, and train the model on an extensive image dataset. Quantitative\nexperiments demonstrate that the proposed model outperforms state-of-the-art\nimage generation and enhancement networks in color accuracy, while a subjective\nstudy suggests that the generated images are on par or superior to those\nproduced by conventional chroma compression methods in terms of visual quality.\nAdditionally, the model achieves real-time performance, showing promising\nresults for deployment on devices with limited computational resources.", "paper_summary_zh": "由於智慧裝置使用率提升，且對高品質輸出有需求，因此高動態範圍 (HDR) 影像的取得正蓬勃發展中。廣泛的研究專注於開發使用傳統和基於深度學習的色調對應運算子，以縮減 HDR 影像中的亮度範圍的方法，以在傳統的 8 和 10 位元數位顯示器上進行精確的重現。然而，這些方法通常無法考量可能位於目標顯示器色域之外的像素，導致可見的色度失真或色彩裁剪的人工製品。先前的研究建議，色域管理步驟可確保所有像素都位於目標色域內。然而，此類方法在運算上成本高昂，且無法部署在運算資源有限的裝置上。我們提出了一個用於 HDR 色調對應影像快速且可靠的色度壓縮的生成對抗網路。我們設計了一個考量生成影像色相屬性的損失函數，以改善色彩準確度，並在廣泛的影像資料集上訓練模型。定量實驗證明，所提出的模型在色彩準確度方面優於現有的影像生成和增強網路，而主觀研究則表明，在視覺品質方面，生成的影像與傳統色度壓縮方法產生的影像不相上下，甚至更優。此外，該模型實現了即時效能，顯示出在運算資源有限的裝置上部署的 promising 結果。", "author": "Xenios Milidonis et.al.", "authors": "Xenios Milidonis, Francesco Banterle, Alessandro Artusi", "id": "2409.16032v1", "paper_url": "http://arxiv.org/abs/2409.16032v1", "repo": "https://github.com/DeepCamera/HDR-chroma-compression"}}