{"2410.23041": {"publish_time": "2024-10-30", "title": "Emotional RAG: Enhancing Role-Playing Agents through Emotional Retrieval", "paper_summary": "As LLMs exhibit a high degree of human-like capability, increasing attention\nhas been paid to role-playing research areas in which responses generated by\nLLMs are expected to mimic human replies. This has promoted the exploration of\nrole-playing agents in various applications, such as chatbots that can engage\nin natural conversations with users and virtual assistants that can provide\npersonalized support and guidance. The crucial factor in the role-playing task\nis the effective utilization of character memory, which stores characters'\nprofiles, experiences, and historical dialogues. Retrieval Augmented Generation\n(RAG) technology is used to access the related memory to enhance the response\ngeneration of role-playing agents. Most existing studies retrieve related\ninformation based on the semantic similarity of memory to maintain characters'\npersonalized traits, and few attempts have been made to incorporate the\nemotional factor in the retrieval argument generation (RAG) of LLMs. Inspired\nby the Mood-Dependent Memory theory, which indicates that people recall an\nevent better if they somehow reinstate during recall the original emotion they\nexperienced during learning, we propose a novel emotion-aware memory retrieval\nframework, termed Emotional RAG, which recalls the related memory with\nconsideration of emotional state in role-playing agents. Specifically, we\ndesign two kinds of retrieval strategies, i.e., combination strategy and\nsequential strategy, to incorporate both memory semantic and emotional states\nduring the retrieval process. Extensive experiments on three representative\nrole-playing datasets demonstrate that our Emotional RAG framework outperforms\nthe method without considering the emotional factor in maintaining the\npersonalities of role-playing agents. This provides evidence to further\nreinforce the Mood-Dependent Memory theory in psychology.", "paper_summary_zh": "隨著大型語言模型展現高度擬人的能力，人們越來越重視角色扮演的研究領域，其中大型語言模型產生的回應預期將模擬人類的回覆。這促使人們探索在各種應用程式中使用角色扮演代理，例如能夠與使用者進行自然對話的聊天機器人，以及能夠提供個人化支援和指導的虛擬助理。角色扮演任務中的關鍵因素是有效利用角色記憶，其中儲存了角色的個人資料、經驗和歷史對話。檢索增強生成 (RAG) 技術用於存取相關記憶，以增強角色扮演代理的回應產生。現有研究大多根據記憶的語義相似性來檢索相關資訊，以維持角色的個性化特質，很少嘗試在大型語言模型的檢索論證產生 (RAG) 中納入情緒因素。受到情緒依賴記憶理論的啟發（該理論指出，如果人們在回憶時以某種方式恢復學習時經歷的原始情緒，他們就能更好地回憶起某個事件），我們提出了一個新的情緒感知記憶檢索架構，稱為情緒 RAG，它在角色扮演代理中考慮情緒狀態來回憶相關記憶。具體來說，我們設計了兩種檢索策略，即組合策略和順序策略，以便在檢索過程中納入記憶語義和情緒狀態。在三個具代表性的角色扮演資料集上進行的廣泛實驗表明，我們的 Emotional RAG 架構在維持角色扮演代理個性方面優於不考慮情緒因素的方法。這提供了證據，進一步強化了心理學中的情緒依賴記憶理論。", "author": "Le Huang et.al.", "authors": "Le Huang, Hengzhi Lan, Zijun Sun, Chuan Shi, Ting Bai", "id": "2410.23041v1", "paper_url": "http://arxiv.org/abs/2410.23041v1", "repo": "null"}}