{"2410.03249": {"publish_time": "2024-10-04", "title": "How much can we forget about Data Contamination?", "paper_summary": "The leakage of benchmark data into the training data has emerged as a\nsignificant challenge for evaluating the capabilities of large language models\n(LLMs). In this work, we use experimental evidence and theoretical estimates to\nchallenge the common assumption that small-scale contamination renders\nbenchmark evaluations invalid. First, we experimentally quantify the magnitude\nof benchmark overfitting based on scaling along three dimensions: The number of\nmodel parameters (up to 1.6B), the number of times an example is seen (up to\n144), and the number of training tokens (up to 40B). We find that if model and\ndata follow the Chinchilla scaling laws, minor contamination indeed leads to\noverfitting. At the same time, even 144 times of contamination can be forgotten\nif the training data is scaled beyond five times Chinchilla, a regime\ncharacteristic of many modern LLMs. We then derive a simple theory of example\nforgetting via cumulative weight decay. It allows us to bound the number of\ngradient steps required to forget past data for any training run where we know\nthe hyperparameters of AdamW. This indicates that many LLMs, including Llama 3,\nhave forgotten the data seen at the beginning of training. Experimentally, we\ndemonstrate that forgetting occurs faster than what is predicted by our bounds.\nTaken together, our results suggest that moderate amounts of contamination can\nbe forgotten at the end of realistically scaled training runs.", "paper_summary_zh": "基準資料外洩到訓練資料中，已成為評估大型語言模型 (LLM) 能力的一項重大挑戰。在這項工作中，我們使用實驗證據和理論估計，來挑戰小規模污染會讓基準評估失效的普遍假設。首先，我們根據三個面向的規模化，實驗量化基準過度擬合的幅度：模型參數數量 (最高 1.6B)、範例被看見的次數 (最高 144) 和訓練權杖數量 (最高 40B)。我們發現，如果模型和資料遵循 Chinchilla 的規模化法則，輕微的污染確實會導致過度擬合。同時，如果訓練資料規模化超過 Chinchilla 的五倍，即使 144 倍的污染也能被遺忘，而這正是許多現代 LLM 的特徵。然後，我們透過累積權重衰減，推導出一個簡單的範例遺忘理論。這讓我們能夠限制忘記過去資料所需的梯度步驟數量，適用於我們已知 AdamW 超參數的任何訓練執行。這表示許多 LLM，包括 Llama 3，都已忘記在訓練開始時看到的資料。透過實驗，我們證明遺忘的速度比我們設定的界限預測得更快。綜合我們的結果，建議在實際規模的訓練執行結束時，可以遺忘適度的污染量。", "author": "Sebastian Bordt et.al.", "authors": "Sebastian Bordt, Suraj Srinivas, Valentyn Boreiko, Ulrike von Luxburg", "id": "2410.03249v1", "paper_url": "http://arxiv.org/abs/2410.03249v1", "repo": "null"}}