{"2412.04046": {"publish_time": "2024-12-05", "title": "Hostility Detection in UK Politics: A Dataset on Online Abuse Targeting MPs", "paper_summary": "Numerous politicians use social media platforms, particularly X, to engage\nwith their constituents. This interaction allows constituents to pose questions\nand offer feedback but also exposes politicians to a barrage of hostile\nresponses, especially given the anonymity afforded by social media. They are\ntypically targeted in relation to their governmental role, but the comments\nalso tend to attack their personal identity. This can discredit politicians and\nreduce public trust in the government. It can also incite anger and disrespect,\nleading to offline harm and violence. While numerous models exist for detecting\nhostility in general, they lack the specificity required for political\ncontexts. Furthermore, addressing hostility towards politicians demands\ntailored approaches due to the distinct language and issues inherent to each\ncountry (e.g., Brexit for the UK). To bridge this gap, we construct a dataset\nof 3,320 English tweets spanning a two-year period manually annotated for\nhostility towards UK MPs. Our dataset also captures the targeted identity\ncharacteristics (race, gender, religion, none) in hostile tweets. We perform\nlinguistic and topical analyses to delve into the unique content of the UK\npolitical data. Finally, we evaluate the performance of pre-trained language\nmodels and large language models on binary hostility detection and multi-class\ntargeted identity type classification tasks. Our study offers valuable data and\ninsights for future research on the prevalence and nature of politics-related\nhostility specific to the UK.", "paper_summary_zh": "許多政治人物使用社群媒體平台，特別是 X，與其選民互動。這種互動讓選民得以提出問題並提供回饋，但也讓政治人物暴露在大量敵意的回應中，特別是考量到社群媒體提供的匿名性。他們通常會因其政府角色而成為攻擊目標，但這些評論也傾向於攻擊他們的個人身分。這可能會讓政治人物失去信譽，並降低民眾對政府的信任。它也可能煽動憤怒和不尊重，導致線下傷害和暴力。雖然有許多模型存在可用於偵測一般性的敵意，但它們缺乏政治脈絡所需的特殊性。此外，針對政治人物的敵意需要量身打造的方法，因為每個國家都有其獨特的語言和問題（例如英國的脫歐）。為了彌補這個差距，我們建立了一個包含 3,320 則英文推文的資料集，涵蓋兩年的時間，並針對針對英國國會議員的敵意進行手動註解。我們的資料集也會擷取敵意推文中針對的身分特徵（種族、性別、宗教、無）。我們執行語言和主題分析，以深入探討英國政治資料的獨特內容。最後，我們評估預先訓練的語言模型和大型語言模型在二元敵意偵測和多類別目標身分類型分類任務上的表現。我們的研究為未來針對英國政治相關敵意的盛行和性質的研究提供了有價值的資料和見解。", "author": "Mugdha Pandya et.al.", "authors": "Mugdha Pandya, Mali Jin, Kalina Bontcheva, Diana Maynard", "id": "2412.04046v1", "paper_url": "http://arxiv.org/abs/2412.04046v1", "repo": "null"}}