{"2406.14867": {"publish_time": "2024-06-21", "title": "DistiLRR: Transferring Code Repair for Low-Resource Programming Languages", "paper_summary": "Large language models (LLMs) have shown remarkable performance on code\ngeneration tasks. A recent application of LLMs for code generation is iterative\ncode repair, where a model fixes an incorrect program by rationalizing about\nerrors and generating a new program. However, code repair is primarily studied\non high-resource languages like Python, and the framework's efficacy is\nunder-explored on low-resource languages. To apply code repair for low-resource\nlanguages, we propose Distilling Low-Resource Repairs (DistiLRR), an approach\nthat transfers the reasoning and code generation ability from a teacher model\nto a student model. Our results show that DistiLRR consistently outperforms\nbaselines on low-resource languages, but has similar performance on\nhigh-resource languages. To investigate this behavior, we perform a further\nanalysis and find that the correlation between rationale quality and code\ncorrectness is weaker than previously perceived. We hypothesize this weakness\nis magnified in low-resource settings where base models lack deep knowledge of\na programming language, leading to wavering benefits of code repair between\nhigh-resource and low-resource languages.", "paper_summary_zh": "大型語言模型 (LLM) 在程式碼產生任務上展現了非凡的效能。LLM 在程式碼產生上的最新應用是反覆程式碼修復，其中模型透過對錯誤進行合理化並產生新的程式碼來修復不正確的程式。然而，程式碼修復主要在 Python 等高資源語言上進行研究，而該架構在低資源語言上的效能則尚未充分探討。為了將程式碼修復應用於低資源語言，我們提出了蒸餾低資源修復 (DistiLRR)，這是一種將推理和程式碼產生能力從教師模型轉移到學生模型的方法。我們的結果顯示，DistiLRR 在低資源語言上始終優於基準，但在高資源語言上則有類似的效能。為了探討這種行為，我們進一步進行分析，發現依據品質和程式碼正確性之間的關聯性比先前認知的要弱。我們假設這種弱點在低資源設定中會被放大，其中基礎模型缺乏對程式語言的深入了解，導致程式碼修復在高資源和低資源語言之間的效益搖擺不定。", "author": "Kyle Wong et.al.", "authors": "Kyle Wong, Alfonso Amayuelas, Liangming Pan, William Yang Wang", "id": "2406.14867v1", "paper_url": "http://arxiv.org/abs/2406.14867v1", "repo": "https://github.com/kylewong288/distilrr"}}