{"2501.09354": {"publish_time": "2025-01-16", "title": "Style4Rec: Enhancing Transformer-based E-commerce Recommendation Systems with Style and Shopping Cart Information", "paper_summary": "Understanding users' product preferences is essential to the efficacy of a\nrecommendation system. Precision marketing leverages users' historical data to\ndiscern these preferences and recommends products that align with them.\nHowever, recent browsing and purchase records might better reflect current\npurchasing inclinations. Transformer-based recommendation systems have made\nstrides in sequential recommendation tasks, but they often fall short in\nutilizing product image style information and shopping cart data effectively.\nIn light of this, we propose Style4Rec, a transformer-based e-commerce\nrecommendation system that harnesses style and shopping cart information to\nenhance existing transformer-based sequential product recommendation systems.\nStyle4Rec represents a significant step forward in personalized e-commerce\nrecommendations, outperforming benchmarks across various evaluation metrics.\nStyle4Rec resulted in notable improvements: HR@5 increased from 0.681 to 0.735,\nNDCG@5 increased from 0.594 to 0.674, and MRR@5 increased from 0.559 to 0.654.\nWe tested our model using an e-commerce dataset from our partnering company and\nfound that it exceeded established transformer-based sequential recommendation\nbenchmarks across various evaluation metrics. Thus, Style4Rec presents a\nsignificant step forward in personalized e-commerce recommendation systems.", "paper_summary_zh": "了解用户的商品偏好对于推荐系统的成效至关重要。精准营销利用用户的历史数据来辨别这些偏好，并推荐符合这些偏好的商品。然而，最近的浏览和购买记录可能更好地反映当前的购买倾向。基于 Transformer 的推荐系统在顺序推荐任务中取得了长足的进步，但它们在有效利用商品图片样式信息和购物车数据方面往往做得不够。有鉴于此，我们提出了 Style4Rec，这是一种基于 Transformer 的电子商务推荐系统，它利用样式和购物车信息来增强现有的基于 Transformer 的顺序商品推荐系统。Style4Rec 代表了个性化电子商务推荐的重大一步，在各种评估指标中都优于基准。Style4Rec 带来了显著的改进：HR@5 从 0.681 增加到 0.735，NDCG@5 从 0.594 增加到 0.674，MRR@5 从 0.559 增加到 0.654。我们使用来自我们合作公司的电子商务数据集测试了我们的模型，发现它在各种评估指标中都超过了已建立的基于 Transformer 的顺序推荐基准。因此，Style4Rec 代表了个性化电子商务推荐系统向前迈出的重要一步。", "author": "Berke Ugurlu et.al.", "authors": "Berke Ugurlu, Ming-Yi Hong, Che Lin", "id": "2501.09354v1", "paper_url": "http://arxiv.org/abs/2501.09354v1", "repo": "null"}}