{"2406.02900": {"publish_time": "2024-06-05", "title": "Scaling Laws for Reward Model Overoptimization in Direct Alignment Algorithms", "paper_summary": "Reinforcement Learning from Human Feedback (RLHF) has been crucial to the\nrecent success of Large Language Models (LLMs), however, it is often a complex\nand brittle process. In the classical RLHF framework, a reward model is first\ntrained to represent human preferences, which is in turn used by an online\nreinforcement learning (RL) algorithm to optimize the LLM. A prominent issue\nwith such methods is \\emph{reward over-optimization} or \\emph{reward hacking},\nwhere performance as measured by the learned proxy reward model increases, but\ntrue quality plateaus or even deteriorates. Direct Alignment Algorithms (DDAs)\nlike Direct Preference Optimization have emerged as alternatives to the\nclassical RLHF pipeline by circumventing the reward modeling phase. However,\nalthough DAAs do not use a separate proxy reward model, they still commonly\ndeteriorate from over-optimization. While the so-called reward hacking\nphenomenon is not well-defined for DAAs, we still uncover similar trends: at\nhigher KL budgets, DAA algorithms exhibit similar degradation patterns to their\nclassic RLHF counterparts. In particular, we find that DAA methods deteriorate\nnot only across a wide range of KL budgets but also often before even a single\nepoch of the dataset is completed. Through extensive empirical experimentation,\nthis work formulates and formalizes the reward over-optimization or hacking\nproblem for DAAs and explores its consequences across objectives, training\nregimes, and model scales.", "paper_summary_zh": "強化學習從人類回饋（RLHF）已經成為大型語言模型（LLMs）最近成功的關鍵，然而，這通常是一個複雜且脆弱的過程。在經典的 RLHF 框架中，首先訓練一個獎勵模型來表示人類偏好，然後由在線強化學習（RL）演算法用於最佳化 LLM。此類方法的一個顯著問題是\\emph{獎勵過度最佳化}或\\emph{獎勵破解}，其中根據已學習的代理獎勵模型測量的效能會增加，但真正的品質會停滯甚至惡化。直接對齊演算法（DDA），例如直接偏好最佳化，已作為迴避獎勵建模階段的經典 RLHF 管線的替代方案出現。然而，儘管 DDA 不使用單獨的代理獎勵模型，但它們仍然普遍因過度最佳化而惡化。雖然所謂的獎勵破解現象對於 DDA 來說並未定義明確，但我們仍然發現類似的趨勢：在較高的 KL 預算下，DAA 演算法會表現出與其經典 RLHF 對應項類似的衰退模式。特別是，我們發現 DAA 方法不僅在廣泛的 KL 預算中惡化，而且通常甚至在資料集的單個世代完成之前就會惡化。透過廣泛的實證實驗，這項工作制定並形式化了 DDA 的獎勵過度最佳化或破解問題，並探討其對目標、訓練機制和模型規模的影響。", "author": "Rafael Rafailov et.al.", "authors": "Rafael Rafailov, Yaswanth Chittepu, Ryan Park, Harshit Sikchi, Joey Hejna, Bradley Knox, Chelsea Finn, Scott Niekum", "id": "2406.02900v1", "paper_url": "http://arxiv.org/abs/2406.02900v1", "repo": "null"}}