{"2410.01989": {"publish_time": "2024-10-02", "title": "UlcerGPT: A Multimodal Approach Leveraging Large Language and Vision Models for Diabetic Foot Ulcer Image Transcription", "paper_summary": "Diabetic foot ulcers (DFUs) are a leading cause of hospitalizations and lower\nlimb amputations, placing a substantial burden on patients and healthcare\nsystems. Early detection and accurate classification of DFUs are critical for\npreventing serious complications, yet many patients experience delays in\nreceiving care due to limited access to specialized services. Telehealth has\nemerged as a promising solution, improving access to care and reducing the need\nfor in-person visits. The integration of artificial intelligence and pattern\nrecognition into telemedicine has further enhanced DFU management by enabling\nautomatic detection, classification, and monitoring from images. Despite\nadvancements in artificial intelligence-driven approaches for DFU image\nanalysis, the application of large language models for DFU image transcription\nhas not yet been explored. To address this gap, we introduce UlcerGPT, a novel\nmultimodal approach leveraging large language and vision models for DFU image\ntranscription. This framework combines advanced vision and language models,\nsuch as Large Language and Vision Assistant and Chat Generative Pre-trained\nTransformer, to transcribe DFU images by jointly detecting, classifying, and\nlocalizing regions of interest. Through detailed experiments on a public\ndataset, evaluated by expert clinicians, UlcerGPT demonstrates promising\nresults in the accuracy and efficiency of DFU transcription, offering potential\nsupport for clinicians in delivering timely care via telemedicine.", "paper_summary_zh": "糖尿病足潰瘍 (DFU) 是導致住院和下肢截肢的主要原因，對患者和醫療保健系統造成沉重負擔。早期發現和準確分類 DFU 對於預防嚴重併發症至關重要，但許多患者因無法獲得專業服務而延誤就醫。遠距醫療已成為一個有前途的解決方案，改善了就醫管道並減少親自就診的需求。將人工智慧和模式識別整合到遠距醫療進一步增強了 DFU 管理，能從影像中自動偵測、分類和監控。儘管在人工智慧驅動的 DFU 影像分析方法方面有進展，但尚未探索將大型語言模型應用於 DFU 影像轉錄。為了解決這個差距，我們引入了 UlcerGPT，這是一種新穎的多模態方法，利用大型語言和視覺模型進行 DFU 影像轉錄。此架構結合了先進的視覺和語言模型，例如大型語言和視覺助理以及聊天生成式預訓練轉換器，透過共同偵測、分類和定位感興趣區域來轉錄 DFU 影像。透過在公開資料集上進行詳細實驗，並由專家臨床醫師評估，UlcerGPT 在 DFU 轉錄的準確性和效率方面展現了有前景的結果，為臨床醫師透過遠距醫療提供及時照護提供了潛在支援。", "author": "Reza Basiri et.al.", "authors": "Reza Basiri, Ali Abedi, Chau Nguyen, Milos R. Popovic, Shehroz S. Khan", "id": "2410.01989v1", "paper_url": "http://arxiv.org/abs/2410.01989v1", "repo": "null"}}