{"2405.17995": {"publish_time": "2024-05-28", "title": "DMT-JEPA: Discriminative Masked Targets for Joint-Embedding Predictive Architecture", "paper_summary": "The joint-embedding predictive architecture (JEPA) recently has shown\nimpressive results in extracting visual representations from unlabeled imagery\nunder a masking strategy. However, we reveal its disadvantages, notably its\ninsufficient understanding of local semantics. This deficiency originates from\nmasked modeling in the embedding space, resulting in a reduction of\ndiscriminative power and can even lead to the neglect of critical local\nsemantics. To bridge this gap, we introduce DMT-JEPA, a novel masked modeling\nobjective rooted in JEPA, specifically designed to generate discriminative\nlatent targets from neighboring information. Our key idea is simple: we\nconsider a set of semantically similar neighboring patches as a target of a\nmasked patch. To be specific, the proposed DMT-JEPA (a) computes feature\nsimilarities between each masked patch and its corresponding neighboring\npatches to select patches having semantically meaningful relations, and (b)\nemploys lightweight cross-attention heads to aggregate features of neighboring\npatches as the masked targets. Consequently, DMT-JEPA demonstrates strong\ndiscriminative power, offering benefits across a diverse spectrum of downstream\ntasks. Through extensive experiments, we demonstrate our effectiveness across\nvarious visual benchmarks, including ImageNet-1K image classification, ADE20K\nsemantic segmentation, and COCO object detection tasks. Code is available at:\n\\url{https://github.com/DMTJEPA/DMTJEPA}.", "paper_summary_zh": "聯合嵌入預測架構 (JEPA) 近期在遮罩策略下從未標註的影像中萃取視覺表徵方面展現令人印象深刻的成果。然而，我們揭露了它的缺點，特別是它對局部語意的理解不足。這個缺陷源自於嵌入空間中的遮罩模型，導致判別力的降低，甚至可能忽略關鍵的局部語意。為了彌補這個差距，我們引入了 DMT-JEPA，一種源自於 JEPA 的新型遮罩模型目標，專門設計用於從鄰近資訊中產生判別性的潛在目標。我們的關鍵想法很簡單：我們將一組語意相似的鄰近區塊視為遮罩區塊的目標。具體來說，所提出的 DMT-JEPA (a) 計算每個遮罩區塊與其對應鄰近區塊之間的特徵相似性，以選擇具有語意關聯的區塊，以及 (b) 使用輕量級交叉注意力頭部將鄰近區塊的特徵彙總為遮罩目標。因此，DMT-JEPA 展現強大的判別力，在各種下游任務中提供好處。透過廣泛的實驗，我們證明了我們在各種視覺基準上的有效性，包括 ImageNet-1K 影像分類、ADE20K 語意分割和 COCO 物件偵測任務。程式碼可在以下網址取得：\\url{https://github.com/DMTJEPA/DMTJEPA}。", "author": "Shentong Mo et.al.", "authors": "Shentong Mo, Sukmin Yun", "id": "2405.17995v1", "paper_url": "http://arxiv.org/abs/2405.17995v1", "repo": "null"}}