{"2502.11969": {"publish_time": "2025-02-17", "title": "Learning Generalizable Prompt for CLIP with Class Similarity Knowledge", "paper_summary": "In vision-language models (VLMs), prompt tuning has shown its effectiveness\nin adapting models to downstream tasks. However, learned prompts struggle to\ngeneralize to unseen classes, as they tend to overfit to the classes that are\ntargeted during prompt tuning. Examining failure cases, we observed that\nlearned prompts disrupt the semantics of unseen classes, generating text\nembeddings with incorrect semantic relationships among classes. To address\nthis, we propose Similarity Alignment Regularization (SAR), which regularizes\nlearnable prompts to preserve the semantic relationships among classes captured\nby hand-crafted prompts. Specifically, we first obtain novel classes related to\nbase classes using ChatGPT-4o and utilize them as potential unseen classes\nduring prompt tuning. Then, by targeting both base and novel classes, SAR\naligns the similarity relationships among text embeddings generated by\nlearnable prompts with the similarity relationships from hand-crafted prompts.\nExtensive experiments applying SAR to existing prompt tuning methods\ndemonstrate its effectiveness in improving generalization to unseen classes.", "paper_summary_zh": "在視覺語言模型 (VLM) 中，提示調整已展現其在調整模型至下游任務上的效能。然而，已學習的提示難以推廣至未見類別，因為它們傾向於過度擬合提示調整期間所鎖定的類別。在檢視失敗案例時，我們觀察到已學習的提示會擾亂未見類別的語義，產生具有類別間不正確語義關係的文字嵌入。為了解決此問題，我們提出相似度對齊正則化 (SAR)，它會對可學習提示進行正則化，以保留由手工提示捕捉到的類別間語義關係。具體來說，我們首先使用 ChatGPT-4o 取得與基本類別相關的新穎類別，並在提示調整期間將它們用作潛在的未見類別。然後，透過鎖定基本類別和新穎類別，SAR 會將可學習提示產生的文字嵌入之間的相似度關係與手工提示的相似度關係對齊。將 SAR 應用於現有提示調整方法的廣泛實驗證明了其在改善對未見類別的概括上的效能。", "author": "Sehun Jung et.al.", "authors": "Sehun Jung, Hyang-won Lee", "id": "2502.11969v1", "paper_url": "http://arxiv.org/abs/2502.11969v1", "repo": "null"}}