{"2502.00619": {"publish_time": "2025-02-02", "title": "Distribution-aware Fairness Learning in Medical Image Segmentation From A Control-Theoretic Perspective", "paper_summary": "Ensuring fairness in medical image segmentation is critical due to biases in\nimbalanced clinical data acquisition caused by demographic attributes (e.g.,\nage, sex, race) and clinical factors (e.g., disease severity). To address these\nchallenges, we introduce Distribution-aware Mixture of Experts (dMoE), inspired\nby optimal control theory. We provide a comprehensive analysis of its\nunderlying mechanisms and clarify dMoE's role in adapting to heterogeneous\ndistributions in medical image segmentation. Furthermore, we integrate dMoE\ninto multiple network architectures, demonstrating its broad applicability\nacross diverse medical image analysis tasks. By incorporating demographic and\nclinical factors, dMoE achieves state-of-the-art performance on two 2D\nbenchmark datasets and a 3D in-house dataset. Our results highlight the\neffectiveness of dMoE in mitigating biases from imbalanced distributions,\noffering a promising approach to bridging control theory and medical image\nsegmentation within fairness learning paradigms. The source code will be made\navailable.", "paper_summary_zh": "在医学影像分割中，由於人口屬性（例如年齡、性別、種族）和臨床因素（例如疾病嚴重程度）導致不平衡的臨床數據採集中存在偏差，因此確保公平性至關重要。為了應對這些挑戰，我們引入了受最優控制理論啟發的感知混合專家 (dMoE)。我們對其底層機制進行了全面分析，並釐清了 dMoE 在適應醫學影像分割中的異質分佈中的作用。此外，我們將 dMoE 整合到多個網路架構中，展示了其在各種醫學影像分析任務中的廣泛適用性。通過納入人口統計和臨床因素，dMoE 在兩個 2D 基準數據集和一個 3D 內部數據集上實現了最先進的性能。我們的結果突出了 dMoE 在減輕不平衡分佈的偏差方面的有效性，為在公平性學習範例中橋接控制理論和醫學影像分割提供了一個有前景的方法。原始碼將會公開。", "author": "Yujin Oh et.al.", "authors": "Yujin Oh, Pengfei Jin, Sangjoon Park, Sekeun Kim, Siyeop Yoon, Kyungsang Kim, Jin Sung Kim, Xiang Li, Quanzheng Li", "id": "2502.00619v1", "paper_url": "http://arxiv.org/abs/2502.00619v1", "repo": "null"}}