{"2406.02959": {"publish_time": "2024-06-05", "title": "Adversarial Moment-Matching Distillation of Large Language Models", "paper_summary": "Knowledge distillation (KD) has been shown to be highly effective in guiding\na student model with a larger teacher model and achieving practical benefits in\nimproving the computational and memory efficiency for large language models\n(LLMs). State-of-the-art KD methods for LLMs mostly rely on minimizing explicit\ndistribution distance between teacher and student probability predictions.\nInstead of optimizing these mandatory behaviour cloning objectives, we explore\nan imitation learning strategy for KD of LLMs. In particular, we minimize the\nimitation gap by matching the action-value moments of the teacher's behavior\nfrom both on- and off-policy perspectives. To achieve this action-value\nmoment-matching goal, we propose an adversarial training algorithm to jointly\nestimate the moment-matching distance and optimize the student policy to\nminimize it. Results from both task-agnostic instruction-following experiments\nand task-specific experiments demonstrate the effectiveness of our method and\nachieve new state-of-the-art performance.", "paper_summary_zh": "知識蒸餾 (KD) 已被證明在使用較大的教師模型指導學生模型時非常有效，並在改善大型語言模型 (LLM) 的計算和記憶體效率方面獲得實際效益。LLM 最先進的 KD 方法大多依賴於最小化教師和學生機率預測之間的明確分佈距離。我們探索了一種模仿學習策略，用於 LLM 的 KD，而不是最佳化這些強制行為複製目標。具體來說，我們透過比對教師行為的動作價值矩，從策略和非策略觀點來最小化模仿差距。為了達成此動作價值矩比對目標，我們提出了一種對抗訓練演算法，用於共同估計矩比對距離並最佳化學生策略以將其最小化。任務不可知指令遵循實驗和任務特定實驗的結果證明了我們方法的有效性，並達到了新的最先進效能。", "author": "Chen Jia et.al.", "authors": "Chen Jia", "id": "2406.02959v1", "paper_url": "http://arxiv.org/abs/2406.02959v1", "repo": "null"}}