{"2408.07676": {"publish_time": "2024-08-14", "title": "Enhanced Detection of Conversational Mental Manipulation Through Advanced Prompting Techniques", "paper_summary": "This study presents a comprehensive, long-term project to explore the\neffectiveness of various prompting techniques in detecting dialogical mental\nmanipulation. We implement Chain-of-Thought prompting with Zero-Shot and\nFew-Shot settings on a binary mental manipulation detection task, building upon\nexisting work conducted with Zero-Shot and Few- Shot prompting. Our primary\nobjective is to decipher why certain prompting techniques display superior\nperformance, so as to craft a novel framework tailored for detection of mental\nmanipulation. Preliminary findings suggest that advanced prompting techniques\nmay not be suitable for more complex models, if they are not trained through\nexample-based learning.", "paper_summary_zh": "本研究提出了一個全面、長期的專案，以探討各種提示技術在檢測對話式心理操縱中的有效性。我們在二元心理操縱檢測任務中實作了零次學習和少次學習設定下的思想鏈提示，並建立在使用零次學習和少次學習提示進行的既有工作之上。我們的首要目標是解碼為何某些提示技術表現出優異的效能，以便為檢測心理操縱量身打造一個新穎的架構。初步發現表明，如果進階提示技術未透過基於範例的學習進行訓練，則可能不適合更複雜的模型。", "author": "Ivory Yang et.al.", "authors": "Ivory Yang, Xiaobo Guo, Sean Xie, Soroush Vosoughi", "id": "2408.07676v1", "paper_url": "http://arxiv.org/abs/2408.07676v1", "repo": "null"}}