{"2405.20625": {"publish_time": "2024-05-31", "title": "Robust Planning with LLM-Modulo Framework: Case Study in Travel Planning", "paper_summary": "As the applicability of Large Language Models (LLMs) extends beyond\ntraditional text processing tasks, there is a burgeoning interest in their\npotential to excel in planning and reasoning assignments, realms traditionally\nreserved for System 2 cognitive competencies. Despite their perceived\nversatility, the research community is still unraveling effective strategies to\nharness these models in such complex domains. The recent discourse introduced\nby the paper on LLM Modulo marks a significant stride, proposing a conceptual\nframework that enhances the integration of LLMs into diverse planning and\nreasoning activities. This workshop paper delves into the practical application\nof this framework within the domain of travel planning, presenting a specific\ninstance of its implementation. We are using the Travel Planning benchmark by\nthe OSU NLP group, a benchmark for evaluating the performance of LLMs in\nproducing valid itineraries based on user queries presented in natural\nlanguage. While popular methods of enhancing the reasoning abilities of LLMs\nsuch as Chain of Thought, ReAct, and Reflexion achieve a meager 0%, 0.6%, and\n0% with GPT3.5-Turbo respectively, our operationalization of the LLM-Modulo\nframework for TravelPlanning domain provides a remarkable improvement,\nenhancing baseline performances by 4.6x for GPT4-Turbo and even more for older\nmodels like GPT3.5-Turbo from 0% to 5%. Furthermore, we highlight the other\nuseful roles of LLMs in the planning pipeline, as suggested in LLM-Modulo,\nwhich can be reliably operationalized such as extraction of useful critics and\nreformulator for critics.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的適用性超越傳統的文字處理任務，它們在規劃和推理任務中表現出色的潛力引起了極大的興趣，這些領域傳統上是 System 2 認知能力的專屬領域。儘管它們被認為具有多功能性，但研究社群仍在探討在如此複雜的領域中有效利用這些模型的策略。LLM Modulo 論文中最近提出的論述標誌著一個重要的進展，提出了增強 LLM 與各種規劃和推理活動整合的概念框架。這篇研討會論文深入探討了這個框架在旅遊規劃領域中的實際應用，並展示了一個具體的實作範例。我們使用了俄亥俄州立大學自然語言處理小組的旅遊規劃基準，這個基準用於評估 LLM 在根據以自然語言呈現的使用者查詢產生有效行程方面的表現。雖然增強 LLM 推理能力的流行方法，例如思維鏈、ReAct 和 Reflexion，分別使用 GPT3.5-Turbo 達到了微不足道的 0%、0.6% 和 0%，但我們將 LLM-Modulo 框架操作化到旅遊規劃領域，提供了顯著的改進，將 GPT4-Turbo 的基準表現提升了 4.6 倍，甚至將 GPT3.5-Turbo 等較舊模型從 0% 提升到 5%。此外，我們強調了 LLM 在規劃流程中其他有用的角色，正如 LLM-Modulo 所建議的，這些角色可以被可靠地操作化，例如提取有用的批評和批評的重新表述。", "author": "Atharva Gundawar et.al.", "authors": "Atharva Gundawar, Mudit Verma, Lin Guan, Karthik Valmeekam, Siddhant Bhambri, Subbarao Kambhampati", "id": "2405.20625v1", "paper_url": "http://arxiv.org/abs/2405.20625v1", "repo": "null"}}