{"2501.00199": {"publish_time": "2024-12-31", "title": "GPT-4 on Clinic Depression Assessment: An LLM-Based Pilot Study", "paper_summary": "Depression has impacted millions of people worldwide and has become one of\nthe most prevalent mental disorders. Early mental disorder detection can lead\nto cost savings for public health agencies and avoid the onset of other major\ncomorbidities. Additionally, the shortage of specialized personnel is a\ncritical issue because clinical depression diagnosis is highly dependent on\nexpert professionals and is time consuming.\n  In this study, we explore the use of GPT-4 for clinical depression assessment\nbased on transcript analysis. We examine the model's ability to classify\npatient interviews into binary categories: depressed and not depressed. A\ncomparative analysis is conducted considering prompt complexity (e.g., using\nboth simple and complex prompts) as well as varied temperature settings to\nassess the impact of prompt complexity and randomness on the model's\nperformance.\n  Results indicate that GPT-4 exhibits considerable variability in accuracy and\nF1-Score across configurations, with optimal performance observed at lower\ntemperature values (0.0-0.2) for complex prompts. However, beyond a certain\nthreshold (temperature >= 0.3), the relationship between randomness and\nperformance becomes unpredictable, diminishing the gains from prompt\ncomplexity.\n  These findings suggest that, while GPT-4 shows promise for clinical\nassessment, the configuration of the prompts and model parameters requires\ncareful calibration to ensure consistent results. This preliminary study\ncontributes to understanding the dynamics between prompt engineering and large\nlanguage models, offering insights for future development of AI-powered tools\nin clinical settings.", "paper_summary_zh": "憂鬱症影響全球數百萬人，已成為最普遍的精神疾病之一。提早偵測精神疾病，能為公共衛生機構節省成本，並避免其他主要共病的發生。此外，專業人員短缺是一個關鍵問題，因為臨床憂鬱症的診斷高度依賴於專業人員，且耗時費力。\n在這個研究中，我們探討使用 GPT-4 進行臨床憂鬱症評估，基礎是謄本分析。我們檢視模型將病人訪談分類為二元類別（憂鬱症和非憂鬱症）的能力。我們進行比較分析，考量提示複雜度（例如，同時使用簡單和複雜的提示），以及各種溫度設定，以評估提示複雜度和隨機性對模型效能的影響。\n結果顯示，GPT-4 在各組態中的準確度和 F1 分數變化很大，在複雜提示的較低溫度值（0.0-0.2）下觀察到最佳效能。然而，超過某個閾值（溫度 >= 0.3）後，隨機性和效能之間的關係變得難以預測，降低了提示複雜度帶來的收益。\n這些發現表明，雖然 GPT-4 在臨床評估方面顯示出前景，但提示和模型參數的組態需要仔細校準，以確保結果的一致性。這項初步研究有助於了解提示工程和大型語言模型之間的動態，為未來在臨床環境中開發 AI 驅動工具提供見解。", "author": "Giuliano Lorenzoni et.al.", "authors": "Giuliano Lorenzoni, Pedro Elkind Velmovitsky, Paulo Alencar, Donald Cowan", "id": "2501.00199v1", "paper_url": "http://arxiv.org/abs/2501.00199v1", "repo": "null"}}