{"2501.02778": {"publish_time": "2025-01-06", "title": "ICFNet: Integrated Cross-modal Fusion Network for Survival Prediction", "paper_summary": "Survival prediction is a crucial task in the medical field and is essential\nfor optimizing treatment options and resource allocation. However, current\nmethods often rely on limited data modalities, resulting in suboptimal\nperformance. In this paper, we propose an Integrated Cross-modal Fusion Network\n(ICFNet) that integrates histopathology whole slide images, genomic expression\nprofiles, patient demographics, and treatment protocols. Specifically, three\ntypes of encoders, a residual orthogonal decomposition module and a unification\nfusion module are employed to merge multi-modal features to enhance prediction\naccuracy. Additionally, a balanced negative log-likelihood loss function is\ndesigned to ensure fair training across different patients. Extensive\nexperiments demonstrate that our ICFNet outperforms state-of-the-art algorithms\non five public TCGA datasets, including BLCA, BRCA, GBMLGG, LUAD, and UCEC, and\nshows its potential to support clinical decision-making and advance precision\nmedicine. The codes are available at: https://github.com/binging512/ICFNet.", "paper_summary_zh": "存活預測是醫學領域的一項關鍵任務，對於優化治療選項和資源分配至關重要。然而，目前的技術通常仰賴有限的數據形式，導致次佳的表現。在本文中，我們提出一個整合式跨形式融合網路 (ICFNet)，它整合了組織病理學全幻燈片影像、基因體表現特徵、病患人口統計資料和治療協定。具體來說，使用三種類型的編碼器、一個殘差正交分解模組和一個統一融合模組，以合併多形式特徵，以增強預測準確度。此外，設計了一個平衡的負對數似然損失函數，以確保不同病患之間的公平訓練。廣泛的實驗證明，我們的 ICFNet 在五個公開的 TCGA 資料集上優於最先進的演算法，包括 BLCA、BRCA、GBMLGG、LUAD 和 UCEC，並展示其支援臨床決策和推動精準醫療的潛力。程式碼可在以下網址取得：https://github.com/binging512/ICFNet。", "author": "Binyu Zhang et.al.", "authors": "Binyu Zhang, Zhu Meng, Junhao Dong, Fei Su, Zhicheng Zhao", "id": "2501.02778v1", "paper_url": "http://arxiv.org/abs/2501.02778v1", "repo": "https://github.com/binging512/icfnet"}}