{"2411.04838": {"publish_time": "2024-11-07", "title": "Machine learning and optimization-based approaches to duality in statistical physics", "paper_summary": "The notion of duality -- that a given physical system can have two different\nmathematical descriptions -- is a key idea in modern theoretical physics.\nEstablishing a duality in lattice statistical mechanics models requires the\nconstruction of a dual Hamiltonian and a map from the original to the dual\nobservables. By using simple neural networks to parameterize these maps and\nintroducing a loss function that penalises the difference between correlation\nfunctions in original and dual models, we formulate the process of duality\ndiscovery as an optimization problem. We numerically solve this problem and\nshow that our framework can rediscover the celebrated Kramers-Wannier duality\nfor the 2d Ising model, reconstructing the known mapping of temperatures. We\nalso discuss an alternative approach which uses known features of the mapping\nof topological lines to reduce the problem to optimizing the couplings in a\ndual Hamiltonian, and explore next-to-nearest neighbour deformations of the 2d\nIsing duality. We discuss future directions and prospects for discovering new\ndualities within this framework.", "paper_summary_zh": "對偶性的概念——即一個給定的物理系統可以有兩個不同的數學描述——是現代理論物理學中的關鍵思想。在晶格統計力學模型中建立對偶性需要構建一個對偶哈密頓量和一個從原始可觀測量到對偶可觀測量的映射。通過使用簡單的神經網路對這些映射進行參數化，並引入一個損失函數來懲罰原始模型和對偶模型中相關函數之間的差異，我們將對偶性發現過程表述為一個優化問題。我們對這個問題進行數值求解，並表明我們的框架可以重新發現 2d Ising 模型的著名 Kramers-Wannier 對偶性，重建已知的溫度映射。我們還討論了另一種方法，該方法使用拓撲線映射的已知特徵將問題簡化為優化對偶哈密頓量中的耦合，並探索了 2d Ising 對偶性的次近鄰變形。我們討論了在這個框架內發現新對偶性的未來方向和前景。", "author": "Andrea E. V. Ferrari et.al.", "authors": "Andrea E. V. Ferrari, Prateek Gupta, Nabil Iqbal", "id": "2411.04838v1", "paper_url": "http://arxiv.org/abs/2411.04838v1", "repo": "null"}}