{"2412.02610": {"publish_time": "2024-12-03", "title": "AI-Driven Resource Allocation Framework for Microservices in Hybrid Cloud Platforms", "paper_summary": "The increasing demand for scalable, efficient resource management in hybrid\ncloud environments has led to the exploration of AI-driven approaches for\ndynamic resource allocation. This paper presents an AI-driven framework for\nresource allocation among microservices in hybrid cloud platforms. The\nframework employs reinforcement learning (RL)-based resource utilization\noptimization to reduce costs and improve performance. The framework integrates\nAI models with cloud management tools to respond to challenges of dynamic\nscaling and cost-efficient low-latency service delivery. The reinforcement\nlearning model continuously adjusts provisioned resources as required by the\nmicroservices and predicts the future consumption trends to minimize both\nunder- and over-provisioning of resources. Preliminary simulation results\nindicate that using AI in the provision of resources related to costs can\nreduce expenditure by up to 30-40% compared to manual provisioning and\nthreshold-based auto-scaling approaches. It is also estimated that the\nefficiency in resource utilization is expected to improve by 20%-30% with a\ncorresponding latency cut of 15%-20% during the peak demand periods. This study\ncompares the AI-driven approach with existing static and rule-based resource\nallocation methods, demonstrating the capability of this new model to\noutperform them in terms of flexibility and real-time interests. The results\nindicate that reinforcement learning can make optimization of hybrid cloud\nplatforms even better, offering a 25-35% improvement in cost efficiency and the\npower of scaling for microservice-based applications. The proposed framework is\na strong and scalable solution to managing cloud resources in dynamic and\nperformance-critical environments.", "paper_summary_zh": "<paragraph>混合云端環境中對於可擴充、有效率資源管理的日益需求，導致了對人工智慧驅動方法在動態資源分配上的探索。本文提出一個人工智慧驅動的架構，用於混合雲端平台中微服務的資源分配。此架構採用強化學習 (RL) 為基礎的資源使用率最佳化，以降低成本並提升效能。此架構整合人工智慧模型與雲端管理工具，以回應動態擴充和成本效益低延遲服務傳遞的挑戰。強化學習模型會持續調整微服務所需的配置資源，並預測未來的消耗趨勢，以將資源配置不足和過度配置的狀況減至最低。初步的模擬結果顯示，在資源配置中使用人工智慧可以將成本降低 30-40%，相比於手動配置和基於閾值的自動擴充方法。此外，估計資源使用率的效率預計將提升 20%-30%，在需求高峰期時相應減少 15%-20% 的延遲。本研究將人工智慧驅動的方法與現有的靜態和基於規則的資源分配方法進行比較，證明了此新模型在靈活性與即時利益方面的優異表現。結果顯示，強化學習可以進一步最佳化混合雲端平台，為基於微服務的應用程式提供 25-35% 的成本效益改善和擴充能力。所提出的架構是管理動態和效能至上的環境中雲端資源的強大且可擴充的解決方案。</paragraph>", "author": "Biman Barua et.al.", "authors": "Biman Barua, M. Shamim Kaiser", "id": "2412.02610v1", "paper_url": "http://arxiv.org/abs/2412.02610v1", "repo": "null"}}