{"2408.15775": {"publish_time": "2024-08-28", "title": "Easy, Interpretable, Effective: openSMILE for voice deepfake detection", "paper_summary": "In this paper, we demonstrate that attacks in the latest ASVspoof5 dataset --\na de facto standard in the field of voice authenticity and deepfake detection\n-- can be identified with surprising accuracy using a small subset of very\nsimplistic features. These are derived from the openSMILE library, and are\nscalar-valued, easy to compute, and human interpretable. For example, attack\nA10`s unvoiced segments have a mean length of 0.09 \\pm 0.02, while bona fide\ninstances have a mean length of 0.18 \\pm 0.07. Using this feature alone, a\nthreshold classifier achieves an Equal Error Rate (EER) of 10.3% for attack\nA10. Similarly, across all attacks, we achieve up to 0.8% EER, with an overall\nEER of 15.7 \\pm 6.0%. We explore the generalization capabilities of these\nfeatures and find that some of them transfer effectively between attacks,\nprimarily when the attacks originate from similar Text-to-Speech (TTS)\narchitectures. This finding may indicate that voice anti-spoofing is, in part,\na problem of identifying and remembering signatures or fingerprints of\nindividual TTS systems. This allows to better understand anti-spoofing models\nand their challenges in real-world application.", "paper_summary_zh": "<paragraph>在本文中，我們證明了在最新的 ASVspoof5 資料集中進行攻擊 --\n在語音真實性和深度偽造檢測領域中的事實標準\n-- 可以使用非常簡單功能的小子集識別出令人驚訝的準確度。這些功能來自 openSMILE 函式庫，它們是標量值、易於計算且人類可解釋的。例如，攻擊 A10 的無聲區段平均長度為 0.09 \\pm 0.02，而真實的實例平均長度為 0.18 \\pm 0.07。僅使用此功能，閾值分類器即可針對攻擊 A10 達到 10.3% 的相等錯誤率 (EER)。同樣，在所有攻擊中，我們達到了高達 0.8% 的 EER，整體 EER 為 15.7 \\pm 6.0%。我們探索了這些功能的泛化能力，發現其中一些功能在攻擊之間有效轉移，特別是在攻擊源自類似的文字轉語音 (TTS) 架構時。這一發現可能表明語音防欺騙在一定程度上是識別和記憶個別 TTS 系統的簽名或指紋的問題。這有助於更好地理解防欺騙模型及其在實際應用中的挑戰。</paragraph>", "author": "Octavian Pascu et.al.", "authors": "Octavian Pascu, Dan Oneata, Horia Cucu, Nicolas M. Müller", "id": "2408.15775v1", "paper_url": "http://arxiv.org/abs/2408.15775v1", "repo": "null"}}