{"2406.11477": {"publish_time": "2024-06-17", "title": "Vocabulary Expansion for Low-resource Cross-lingual Transfer", "paper_summary": "Large language models (LLMs) have shown remarkable capabilities in many\nlanguages beyond English. Yet, LLMs require more inference steps when\ngenerating non-English text due to their reliance on English-centric\ntokenizers, vocabulary, and pre-training data, resulting in higher usage costs\nto non-English speakers. Vocabulary expansion with target language tokens is a\nwidely used cross-lingual vocabulary adaptation approach to remedy this issue.\nDespite its effectiveness in inference speedup, the majority of previous work\nhas focused on high-resource settings assuming access to a substantial amount\nof target language data to effectively initialize the embeddings of the new\ntokens and adapt the LLM to the target language. However, vocabulary expansion\nfor LLMs in low-resource settings (i.e. languages and compute) has yet to be\nexplored. In this paper, we investigate sample-efficient adaptation strategies\nfrom different angles, including target vocabulary size and initialization\nmethods, and the amount of target data available for adaptation. Extensive\nexperiments across typologically diverse languages, tasks and models show that\nsimpler heuristic-based embedding initialization is more efficient and robust\nto changes in target vocabulary size and adaptation data in low-resource\nsettings, outperforming a popular random initialization and a more\nsophisticated state-of-the-art approach that relies on external data and model.", "paper_summary_zh": "大型語言模型 (LLM) 已在英語以外的許多語言中展現出卓越的能力。然而，由於依賴以英語為中心的標記化器、詞彙和預訓練資料，LLM 在產生非英語文本時需要更多的推論步驟，導致非英語使用者使用成本較高。使用目標語言標記擴充詞彙是一種廣泛使用的跨語言詞彙適應方法，用來解決此問題。儘管其在推論加速方面很有效，但大多數先前的研究都集中在假設可以存取大量目標語言資料的高資源設定，以有效初始化新標記的嵌入並將 LLM 適應到目標語言。然而，在低資源設定（例如語言和運算）中針對 LLM 擴充詞彙尚未被探討。在本文中，我們從不同的角度探討樣本有效適應策略，包括目標詞彙大小和初始化方法，以及可用於適應的目標資料量。跨型態多樣語言、任務和模型的廣泛實驗顯示，在低資源設定中，基於啟發式的嵌入初始化較為有效且強健，且能因應目標詞彙大小和適應資料的變化，優於流行的隨機初始化和依賴外部資料和模型的更精密的最新方法。", "author": "Atsuki Yamaguchi et.al.", "authors": "Atsuki Yamaguchi, Aline Villavicencio, Nikolaos Aletras", "id": "2406.11477v1", "paper_url": "http://arxiv.org/abs/2406.11477v1", "repo": "null"}}