{"2406.03181": {"publish_time": "2024-06-05", "title": "Missci: Reconstructing Fallacies in Misrepresented Science", "paper_summary": "Health-related misinformation on social networks can lead to poor\ndecision-making and real-world dangers. Such misinformation often misrepresents\nscientific publications and cites them as \"proof\" to gain perceived\ncredibility. To effectively counter such claims automatically, a system must\nexplain how the claim was falsely derived from the cited publication. Current\nmethods for automated fact-checking or fallacy detection neglect to assess the\n(mis)used evidence in relation to misinformation claims, which is required to\ndetect the mismatch between them. To address this gap, we introduce Missci, a\nnovel argumentation theoretical model for fallacious reasoning together with a\nnew dataset for real-world misinformation detection that misrepresents\nbiomedical publications. Unlike previous fallacy detection datasets, Missci (i)\nfocuses on implicit fallacies between the relevant content of the cited\npublication and the inaccurate claim, and (ii) requires models to verbalize the\nfallacious reasoning in addition to classifying it. We present Missci as a\ndataset to test the critical reasoning abilities of large language models\n(LLMs), that are required to reconstruct real-world fallacious arguments, in a\nzero-shot setting. We evaluate two representative LLMs and the impact of\ndifferent levels of detail about the fallacy classes provided to the LLM via\nprompts. Our experiments and human evaluation show promising results for GPT 4,\nwhile also demonstrating the difficulty of this task.", "paper_summary_zh": "社交網路上的健康相關錯誤資訊可能會導致錯誤的決策和現實世界的危險。這種錯誤資訊通常會曲解科學出版物，並將其引用為獲得感知可信度的「證明」。為了有效自動反駁此類說法，系統必須說明該說法是如何從引用的出版物中錯誤衍生的。目前用於自動事實查核或謬誤檢測的方法忽略了評估與錯誤資訊說法相關的（錯誤）使用的證據，這是檢測它們之間不匹配所必需的。為了解決這個差距，我們引入了 Missci，一個新的論證理論模型，用於謬誤推理，並提供了一個新的用於曲解生物醫學出版物的真實世界錯誤資訊檢測的資料集。與先前的謬誤檢測資料集不同，Missci (i) 專注於引用的出版物相關內容與不準確說法之間的隱含謬誤，以及 (ii) 要求模型除了對謬誤推理進行分類外，還要將其表達出來。我們將 Missci 呈現為一個資料集，用於測試大型語言模型 (LLM) 的批判性推理能力，這些模型需要在零次學習設置中重建真實世界的謬誤論證。我們評估了兩個具有代表性的 LLM 以及通過提示向 LLM 提供不同詳細程度的謬誤類別的影響。我們的實驗和人工評估顯示出 GPT 4 的有希望的結果，同時也證明了這項任務的難度。", "author": "Max Glockner et.al.", "authors": "Max Glockner, Yufang Hou, Preslav Nakov, Iryna Gurevych", "id": "2406.03181v1", "paper_url": "http://arxiv.org/abs/2406.03181v1", "repo": "null"}}