{"2503.20914": {"publish_time": "2025-03-26", "title": "D4R -- Exploring and Querying Relational Graphs Using Natural Language and Large Language Models -- the Case of Historical Documents", "paper_summary": "D4R is a digital platform designed to assist non-technical users,\nparticularly historians, in exploring textual documents through advanced\ngraphical tools for text analysis and knowledge extraction. By leveraging a\nlarge language model, D4R translates natural language questions into Cypher\nqueries, enabling the retrieval of data from a Neo4J database. A user-friendly\ngraphical interface allows for intuitive interaction, enabling users to\nnavigate and analyse complex relational data extracted from unstructured\ntextual documents. Originally designed to bridge the gap between AI\ntechnologies and historical research, D4R's capabilities extend to various\nother domains. A demonstration video and a live software demo are available.", "paper_summary_zh": "<paragraph>D4R 是一個為非技術用戶，特別是歷史學家，設計的數位平台，透過先進的圖形化文本分析和知識提取工具，協助他們探索文本資料。藉由運用大型語言模型，D4R 將自然語言問題轉換為 Cypher 查詢，從而能夠從 Neo4J 資料庫中檢索數據。一個使用者友善的圖形介面允許直觀的互動，讓使用者能夠瀏覽和分析從非結構化文本資料中提取的複雜關係數據。D4R 最初的設計目的是彌合 AI 技術與歷史研究之間的差距，但它的功能可以擴展到其他各種領域。示範影片和軟體現場演示均有提供。</paragraph>\n", "author": "Michel Boeglin et.al.", "authors": "Michel Boeglin, David Kahn, Josiane Mothe, Diego Ortiz, David Panzoli", "id": "2503.20914v1", "paper_url": "http://arxiv.org/abs/2503.20914v1", "repo": "null"}}