{"2408.00859": {"publish_time": "2024-08-01", "title": "LICM: Effective and Efficient Long Interest Chain Modeling for News Recommendation", "paper_summary": "Accurately recommending personalized candidate news articles to users has\nalways been the core challenge of news recommendation system. News\nrecommendations often require modeling of user interests to match candidate\nnews. Recent efforts have primarily focused on extract local subgraph\ninformation, the lack of a comprehensive global news graph extraction has\nhindered the ability to utilize global news information collaboratively among\nsimilar users. To overcome these limitations, we propose an effective and\nefficient Long Interest Chain Modeling for News Recommendation(LICM), which\ncombines neighbor interest with long-chain interest distilled from a global\nnews click graph based on the collaborative of similar users to enhance news\nrecommendation. For a global news graph based on the click history of all\nusers, long chain interest generated from it can better utilize the\nhigh-dimensional information within it, enhancing the effectiveness of\ncollaborative recommendations. We therefore design a comprehensive selection\nmechanism and interest encoder to obtain long-chain interest from the global\ngraph. Finally, we use a gated network to integrate long-chain information with\nneighbor information to achieve the final user representation. Experiment\nresults on real-world datasets validate the effectiveness and efficiency of our\nmodel to improve the performance of news recommendation.", "paper_summary_zh": "準確推薦個人化候選新聞文章給使用者一直都是新聞推薦系統的核心挑戰。新聞推薦通常需要對使用者興趣進行建模，以匹配候選新聞。最近的研究工作主要集中在提取局部子圖資訊上，缺乏全面的全局新聞圖表提取阻礙了在相似使用者之間協作利用全局新聞資訊的能力。為了克服這些限制，我們提出了一種有效且高效的新聞推薦長興趣鏈建模（LICM），它結合了鄰近興趣與從基於相似使用者協作的全局新聞點擊圖表中提取的長鏈興趣，以增強新聞推薦。對於一個基於所有使用者點擊記錄的全局新聞圖表，從中產生的長鏈興趣可以更好地利用其中的高維資訊，增強協作推薦的有效性。因此，我們設計了一個全面的選擇機制和興趣編碼器，從全局圖表中獲取長鏈興趣。最後，我們使用一個門控網路將長鏈資訊與鄰近資訊整合，以獲得最終的使用者表徵。在真實世界資料集上的實驗結果驗證了我們模型的有效性和效率，以改善新聞推薦的效能。", "author": "Zhen Yang et.al.", "authors": "Zhen Yang, Wenhui Wang, Tao Qi, Peng Zhang, Tianyun Zhang, Ru Zhang, Jianyi Liu, Yongfeng Huang", "id": "2408.00859v1", "paper_url": "http://arxiv.org/abs/2408.00859v1", "repo": "null"}}