{"2405.09508": {"publish_time": "2024-05-15", "title": "Modeling Bilingual Sentence Processing: Evaluating RNN and Transformer Architectures for Cross-Language Structural Priming", "paper_summary": "This study evaluates the performance of Recurrent Neural Network (RNN) and\nTransformer in replicating cross-language structural priming: a key indicator\nof abstract grammatical representations in human language processing. Focusing\non Chinese-English priming, which involves two typologically distinct\nlanguages, we examine how these models handle the robust phenomenon of\nstructural priming, where exposure to a particular sentence structure increases\nthe likelihood of selecting a similar structure subsequently. Additionally, we\nutilize large language models (LLM) to measure the cross-lingual structural\npriming effect. Our findings indicate that Transformer outperform RNN in\ngenerating primed sentence structures, challenging the conventional belief that\nhuman sentence processing primarily involves recurrent and immediate processing\nand suggesting a role for cue-based retrieval mechanisms. Overall, this work\ncontributes to our understanding of how computational models may reflect human\ncognitive processes in multilingual contexts.", "paper_summary_zh": "本研究評估遞迴神經網路 (RNN) 和 Transformer 在複製跨語言結構啟動中的表現：人類語言處理中抽象語法表徵的一個關鍵指標。專注於中英啟動，其中涉及兩種類型學上不同的語言，我們探討這些模型如何處理結構啟動的強大現象，其中接觸特定句子結構會增加隨後選擇類似結構的可能性。此外，我們利用大型語言模型 (LLM) 來衡量跨語言結構啟動效應。我們的研究結果表明，Transformer 在生成啟動句子的結構上優於 RNN，挑戰了人類句子處理主要涉及遞迴和立即處理的傳統觀念，並暗示了基於提示的檢索機制的角色。總體而言，這項工作有助於我們了解計算模型如何在多語言環境中反映人類認知過程。", "author": "Bushi Xiao et.al.", "authors": "Bushi Xiao, Chao Gao, Demi Zhang", "id": "2405.09508v1", "paper_url": "http://arxiv.org/abs/2405.09508v1", "repo": "null"}}