{"2412.18120": {"publish_time": "2024-12-24", "title": "Do Language Models Understand the Cognitive Tasks Given to Them? Investigations with the N-Back Paradigm", "paper_summary": "Cognitive tasks originally developed for humans are now increasingly used to\nstudy language models. While applying these tasks is often straightforward,\ninterpreting their results can be challenging. In particular, when a model\nunderperforms, it's often unclear whether this results from a limitation in the\ncognitive ability being tested or a failure to understand the task itself. A\nrecent study argued that GPT 3.5's declining performance on 2-back and 3-back\ntasks reflects a working memory capacity limit similar to humans. By analyzing\na range of open-source language models of varying performance levels on these\ntasks, we show that the poor performance instead reflects a limitation in task\ncomprehension and task set maintenance. In addition, we push the best\nperforming model to higher n values and experiment with alternative prompting\nstrategies, before analyzing model attentions. Our larger aim is to contribute\nto the ongoing conversation around refining methodologies for the cognitive\nevaluation of language models.", "paper_summary_zh": "原本為人類開發的認知任務，現在越來越常被用來研究語言模型。雖然應用這些任務通常很直接，但要解讀其結果可能具有挑戰性。特別是當模型表現不佳時，通常不清楚這是否源於所測試認知能力的限制，或未能理解任務本身。最近的一項研究認為，GPT 3.5 在 2-back 和 3-back 任務中的表現下降反映出與人類相似的作業記憶容量限制。透過分析在這些任務中表現水準不一的各種開源語言模型，我們發現表現不佳反而反映出任務理解和任務設定維護的限制。此外，我們將表現最佳的模型推升至更高的 n 值，並嘗試使用替代提示策略，然後再分析模型注意力。我們更大的目標是為圍繞語言模型認知評估方法論的精進進行中的對話做出貢獻。", "author": "Xiaoyang Hu et.al.", "authors": "Xiaoyang Hu, Richard L. Lewis", "id": "2412.18120v1", "paper_url": "http://arxiv.org/abs/2412.18120v1", "repo": "null"}}