{"2408.16126": {"publish_time": "2024-08-28", "title": "Improving Generalization of Speech Separation in Real-World Scenarios: Strategies in Simulation, Optimization, and Evaluation", "paper_summary": "Achieving robust speech separation for overlapping speakers in various\nacoustic environments with noise and reverberation remains an open challenge.\nAlthough existing datasets are available to train separators for specific\nscenarios, they do not effectively generalize across diverse real-world\nscenarios. In this paper, we present a novel data simulation pipeline that\nproduces diverse training data from a range of acoustic environments and\ncontent, and propose new training paradigms to improve quality of a general\nspeech separation model. Specifically, we first introduce AC-SIM, a data\nsimulation pipeline that incorporates broad variations in both content and\nacoustics. Then we integrate multiple training objectives into the permutation\ninvariant training (PIT) to enhance separation quality and generalization of\nthe trained model. Finally, we conduct comprehensive objective and human\nlistening experiments across separation architectures and benchmarks to\nvalidate our methods, demonstrating substantial improvement of generalization\non both non-homologous and real-world test sets.", "paper_summary_zh": "在各種有噪音和混響的聲學環境中，針對重疊說話者實現穩健的語音分離仍然是一個未解決的挑戰。儘管現有的數據集可供訓練特定場景的分離器，但它們無法有效地概括到不同的現實世界場景。在本文中，我們提出了一個新穎的數據模擬管道，它可以從一系列聲學環境和內容中產生多樣的訓練數據，並提出新的訓練範例來提高通用語音分離模型的質量。具體來說，我們首先介紹 AC-SIM，這是一個數據模擬管道，它包含了內容和聲學的廣泛變化。然後，我們將多個訓練目標整合到排列不變訓練 (PIT) 中，以增強訓練模型的分離質量和泛化能力。最後，我們對分離架構和基準進行了全面的客觀和人類聆聽實驗，以驗證我們的模型，證明了在非同源和現實世界測試集上泛化能力的顯著提高。", "author": "Ke Chen et.al.", "authors": "Ke Chen, Jiaqi Su, Taylor Berg-Kirkpatrick, Shlomo Dubnov, Zeyu Jin", "id": "2408.16126v1", "paper_url": "http://arxiv.org/abs/2408.16126v1", "repo": "null"}}