{"2408.08152": {"publish_time": "2024-08-15", "title": "DeepSeek-Prover-V1.5: Harnessing Proof Assistant Feedback for Reinforcement Learning and Monte-Carlo Tree Search", "paper_summary": "We introduce DeepSeek-Prover-V1.5, an open-source language model designed for\ntheorem proving in Lean 4, which enhances DeepSeek-Prover-V1 by optimizing both\ntraining and inference processes. Pre-trained on DeepSeekMath-Base with\nspecialization in formal mathematical languages, the model undergoes supervised\nfine-tuning using an enhanced formal theorem proving dataset derived from\nDeepSeek-Prover-V1. Further refinement is achieved through reinforcement\nlearning from proof assistant feedback (RLPAF). Beyond the single-pass\nwhole-proof generation approach of DeepSeek-Prover-V1, we propose RMaxTS, a\nvariant of Monte-Carlo tree search that employs an intrinsic-reward-driven\nexploration strategy to generate diverse proof paths. DeepSeek-Prover-V1.5\ndemonstrates significant improvements over DeepSeek-Prover-V1, achieving new\nstate-of-the-art results on the test set of the high school level miniF2F\nbenchmark ($63.5\\%$) and the undergraduate level ProofNet benchmark ($25.3\\%$).", "paper_summary_zh": "我們推出 DeepSeek-Prover-V1.5，這是一個開放原始碼語言模型，專為 Lean 4 中的定理證明而設計，透過最佳化訓練和推論流程來增強 DeepSeek-Prover-V1。預先訓練於 DeepSeekMath-Base 中，專精於形式化數學語言，該模型使用從 DeepSeek-Prover-V1 衍生的增強式形式化定理證明資料集進行監督式微調。透過證明輔助回饋（RLPAF）中的強化學習進一步精進。除了 DeepSeek-Prover-V1 的單次全證明產生方法外，我們提出 RMaxTS，一種蒙地卡羅樹搜尋的變體，採用內在回饋驅動的探索策略來產生多樣化的證明路徑。DeepSeek-Prover-V1.5 證明了相較於 DeepSeek-Prover-V1 有顯著的進步，在高中程度的 miniF2F 基準測試組中取得新的最先進成果（63.5%），以及大學程度的 ProofNet 基準測試組中（25.3%）。", "author": "Huajian Xin et.al.", "authors": "Huajian Xin, Z. Z. Ren, Junxiao Song, Zhihong Shao, Wanjia Zhao, Haocheng Wang, Bo Liu, Liyue Zhang, Xuan Lu, Qiushi Du, Wenjun Gao, Qihao Zhu, Dejian Yang, Zhibin Gou, Z. F. Wu, Fuli Luo, Chong Ruan", "id": "2408.08152v1", "paper_url": "http://arxiv.org/abs/2408.08152v1", "repo": "null"}}