{"2409.13825": {"publish_time": "2024-09-20", "title": "A Personalised 3D+t Mesh Generative Model for Unveiling Normal Heart Dynamics", "paper_summary": "Understanding the structure and motion of the heart is crucial for diagnosing\nand managing cardiovascular diseases, the leading cause of global death. There\nis wide variation in cardiac shape and motion patterns, that are influenced by\ndemographic, anthropometric and disease factors. Unravelling the normal\npatterns of shape and motion, as well as understanding how each individual\ndeviates from the norm, would facilitate accurate diagnosis and personalised\ntreatment strategies. To this end, we developed a novel conditional generative\nmodel, MeshHeart, to learn the distribution of cardiac shape and motion\npatterns. MeshHeart is capable of generating 3D+t cardiac mesh sequences,\ntaking into account clinical factors such as age, sex, weight and height. To\nmodel the high-dimensional and complex spatio-temporal mesh data, MeshHeart\nemploys a geometric encoder to represent cardiac meshes in a latent space,\nfollowed by a temporal Transformer to model the motion dynamics of latent\nrepresentations. Based on MeshHeart, we investigate the latent space of 3D+t\ncardiac mesh sequences and propose a novel distance metric termed latent delta,\nwhich quantifies the deviation of a real heart from its personalised normative\npattern in the latent space. In experiments using a large dataset of 38,309\nsubjects, MeshHeart demonstrates a high performance in cardiac mesh sequence\nreconstruction and generation. Features defined in the latent space are highly\ndiscriminative for cardiac disease classification, whereas the latent delta\nexhibits strong correlation with clinical phenotypes in phenome-wide\nassociation studies. The codes and models of this study will be released to\nbenefit further research on digital heart modelling.", "paper_summary_zh": "<paragraph>了解心脏的结构和运动对于诊断和管理心血管疾病至关重要，而心血管疾病是全球主要的死亡原因。心脏的形状和运动模式有很大的差异，这些差异受人口统计学、人体测量学和疾病因素的影响。解开形状和运动的正常模式，以及了解每个人如何偏离常态，将有助于准确诊断和个性化治疗策略。为此，我们开发了一种新颖的条件生成模型 MeshHeart，以学习心脏形状和运动模式的分布。MeshHeart 能够生成 3D+t 心脏网格序列，同时考虑年龄、性别、体重和身高等临床因素。为了对高维和复杂的时空网格数据建模，MeshHeart 采用几何编码器在潜在空间中表示心脏网格，然后采用时间转换器对潜在表示的运动动态进行建模。基于 MeshHeart，我们研究了 3D+t 心脏网格序列的潜在空间，并提出了一个新颖的距离度量，称为潜在增量，该度量量化了真实心脏在其潜在空间中与其个性化规范模式的偏差。在使用包含 38,309 名受试者的庞大数据集进行的实验中，MeshHeart 在心脏网格序列重建和生成方面表现出很高的性能。在潜在空间中定义的特征对于心脏疾病分类具有很高的判别力，而潜在增量在全表型关联研究中与临床表型表现出很强的相关性。本研究的代码和模型将发布，以造福对数字心脏建模的进一步研究。</paragraph>", "author": "Mengyun Qiao et.al.", "authors": "Mengyun Qiao, Kathryn A McGurk, Shuo Wang, Paul M. Matthews, Declan P O Regan, Wenjia Bai", "id": "2409.13825v1", "paper_url": "http://arxiv.org/abs/2409.13825v1", "repo": "null"}}