{"2407.16741": {"publish_time": "2024-07-23", "title": "OpenDevin: An Open Platform for AI Software Developers as Generalist Agents", "paper_summary": "Software is one of the most powerful tools that we humans have at our\ndisposal; it allows a skilled programmer to interact with the world in complex\nand profound ways. At the same time, thanks to improvements in large language\nmodels (LLMs), there has also been a rapid development in AI agents that\ninteract with and affect change in their surrounding environments. In this\npaper, we introduce OpenDevin, a platform for the development of powerful and\nflexible AI agents that interact with the world in similar ways to those of a\nhuman developer: by writing code, interacting with a command line, and browsing\nthe web. We describe how the platform allows for the implementation of new\nagents, safe interaction with sandboxed environments for code execution,\ncoordination between multiple agents, and incorporation of evaluation\nbenchmarks. Based on our currently incorporated benchmarks, we perform an\nevaluation of agents over 15 challenging tasks, including software engineering\n(e.g., SWE-Bench) and web browsing (e.g., WebArena), among others. Released\nunder the permissive MIT license, OpenDevin is a community project spanning\nacademia and industry with more than 1.3K contributions from over 160\ncontributors and will improve going forward.", "paper_summary_zh": "軟體是我們人類最具威力的工具之一；它允許熟練的程式設計師以複雜且深遠的方式與世界互動。同時，由於大型語言模型 (LLM) 的改進，也出現了與周圍環境互動並影響其變化的 AI 代理的快速發展。在本文中，我們介紹了 OpenDevin，一個用於開發強大且靈活的 AI 代理的平台，這些代理與世界互動的方式類似於人類開發人員：透過撰寫程式碼、與命令列互動以及瀏覽網路。我們描述了該平台如何允許實作新的代理、與沙盒環境安全互動以執行程式碼、協調多個代理，以及納入評估基準。根據我們目前納入的基準，我們對 15 項具有挑戰性的任務進行了代理評估，包括軟體工程（例如，SWE-Bench）和網路瀏覽（例如，WebArena）等。OpenDevin 在寬容的 MIT 授權下發布，是一個橫跨學術界和產業的社群專案，擁有來自 160 多位貢獻者的 1.3K 多筆貢獻，未來將持續改進。", "author": "Xingyao Wang et.al.", "authors": "Xingyao Wang, Boxuan Li, Yufan Song, Frank F. Xu, Xiangru Tang, Mingchen Zhuge, Jiayi Pan, Yueqi Song, Bowen Li, Jaskirat Singh, Hoang H. Tran, Fuqiang Li, Ren Ma, Mingzhang Zheng, Bill Qian, Yanjun Shao, Niklas Muennighoff, Yizhe Zhang, Binyuan Hui, Junyang Lin, Robert Brennan, Hao Peng, Heng Ji, Graham Neubig", "id": "2407.16741v1", "paper_url": "http://arxiv.org/abs/2407.16741v1", "repo": "https://github.com/opendevin/opendevin"}}