{"2410.19544": {"publish_time": "2024-10-25", "title": "PMM-Net: Single-stage Multi-agent Trajectory Prediction with Patching-based Embedding and Explicit Modal Modulation", "paper_summary": "Analyzing and forecasting trajectories of agents like pedestrians plays a\npivotal role for embodied intelligent applications. The inherent indeterminacy\nof human behavior and complex social interaction among a rich variety of agents\nmake this task more challenging than common time-series forecasting. In this\nletter, we aim to explore a distinct formulation for multi-agent trajectory\nprediction framework. Specifically, we proposed a patching-based temporal\nfeature extraction module and a graph-based social feature extraction module,\nenabling effective feature extraction and cross-scenario generalization.\nMoreover, we reassess the role of social interaction and present a novel method\nbased on explicit modality modulation to integrate temporal and social\nfeatures, thereby constructing an efficient single-stage inference pipeline.\nResults on public benchmark datasets demonstrate the superior performance of\nour model compared with the state-of-the-art methods. The code is available at:\ngithub.com/TIB-K330/pmm-net.", "paper_summary_zh": "分析和預測行人等代理軌跡對於具身智能應用扮演著至關重要的角色。人類行為的內在不確定性和豐富多樣的代理之間的複雜社會互動，使得這項任務比常見的時間序列預測更具挑戰性。在此信中，我們旨在探索一個用於多代理軌跡預測框架的不同表述。具體來說，我們提出了一個基於修補的時間特徵提取模組和一個基於圖形的社會特徵提取模組，實現有效的特徵提取和跨場景概化。此外，我們重新評估了社會互動的作用，並提出了一種基於顯式模態調製的新方法，以整合時間和社會特徵，從而構建一個高效的單階段推論管道。在公共基準資料集上的結果證明了我們的模型與最先進的方法相比具有優越的效能。程式碼可在以下位置取得：github.com/TIB-K330/pmm-net。", "author": "Huajian Liu et.al.", "authors": "Huajian Liu, Wei Dong, Kunpeng Fan, Chao Wang, Yongzhuo Gao", "id": "2410.19544v1", "paper_url": "http://arxiv.org/abs/2410.19544v1", "repo": "null"}}