{"2410.12543": {"publish_time": "2024-10-16", "title": "LLM-based Translation Inference with Iterative Bilingual Understanding", "paper_summary": "The remarkable understanding and generation capabilities of large language\nmodels (LLMs) have greatly improved translation performance. However, incorrect\nunderstanding of the sentence to be translated can degrade translation quality.\nTo address this issue, we proposed a novel Iterative Bilingual Understanding\nTranslation (IBUT) method based on the cross-lingual capabilities of LLMs and\nthe dual characteristics of translation tasks. The cross-lingual capability of\nLLMs enables the generation of contextual understanding for both the source and\ntarget languages separately. Furthermore, the dual characteristics allow IBUT\nto generate effective cross-lingual feedback, iteratively refining contextual\nunderstanding, thereby reducing errors and improving translation performance.\nExperimental results showed that the proposed IBUT outperforms several strong\ncomparison methods, especially being generalized to multiple domains (e.g.,\nnews, commonsense, and cultural translation benchmarks).", "paper_summary_zh": "大型語言模型 (LLM) 傑出的理解和生成能力大幅提升了翻譯效能。然而，對待翻譯句子的理解不正確會降低翻譯品質。為了解決這個問題，我們提出了一種創新的反覆雙語理解翻譯 (IBUT) 方法，它基於 LLM 的跨語言能力和翻譯任務的雙重特徵。LLM 的跨語言能力可以分別為來源語言和目標語言產生脈絡理解。此外，雙重特徵讓 IBUT 能夠產生有效的跨語言回饋，反覆精進脈絡理解，從而減少錯誤並提升翻譯效能。實驗結果顯示，提出的 IBUT 優於多種強大的對比方法，特別是廣泛運用於多個領域（例如新聞、常識和文化翻譯基準）。", "author": "Andong Chen et.al.", "authors": "Andong Chen, Kehai Chen, Yang Xiang, Xuefeng Bai, Muyun Yang, Tiejun Zhao, Min zhang", "id": "2410.12543v2", "paper_url": "http://arxiv.org/abs/2410.12543v2", "repo": "null"}}