{"2408.13889": {"publish_time": "2024-08-25", "title": "LLM with Relation Classifier for Document-Level Relation Extraction", "paper_summary": "Large language models (LLMs) create a new paradigm for natural language\nprocessing. Despite their advancement, LLM-based methods still lag behind\ntraditional approaches in document-level relation extraction (DocRE), a\ncritical task for understanding complex entity relations. This paper\ninvestigates the causes of this performance gap, identifying the dispersion of\nattention by LLMs due to entity pairs without relations as a primary factor. We\nthen introduce a novel classifier-LLM approach to DocRE. The proposed approach\nbegins with a classifier specifically designed to select entity pair candidates\nexhibiting potential relations and thereby feeds them to LLM for the final\nrelation extraction. This method ensures that during inference, the LLM's focus\nis directed primarily at entity pairs with relations. Experiments on DocRE\nbenchmarks reveal that our method significantly outperforms recent LLM-based\nDocRE models and achieves competitive performance with several leading\ntraditional DocRE models.", "paper_summary_zh": "大型語言模型 (LLM) 為自然語言處理創造了新的典範。儘管它們進步神速，但基於 LLM 的方法在文件層級關係萃取 (DocRE) 方面仍落後於傳統方法，而這項任務對於理解複雜實體關係至關重要。本文探討了這種效能差距的原因，並找出 LLM 由於沒有關係的實體對而分散注意力，是造成這種差距的主要因素。然後，我們介紹一種新的分類器-LLM 方法來進行 DocRE。所提出的方法首先使用一個分類器，該分類器專門用於選取表現出潛在關係的實體對候選項，並將它們提供給 LLM 以進行最終的關係萃取。此方法可確保在推理過程中，LLM 的焦點主要集中在具有關係的實體對上。在 DocRE 基準上的實驗顯示，我們的模型顯著優於最近基於 LLM 的 DocRE 模型，並與多個領先的傳統 DocRE 模型達成競爭性的效能。", "author": "Xingzuo Li et.al.", "authors": "Xingzuo Li, Kehai Chen, Yunfei Long, Min Zhang", "id": "2408.13889v1", "paper_url": "http://arxiv.org/abs/2408.13889v1", "repo": "null"}}