{"2407.09930": {"publish_time": "2024-07-13", "title": "Evaluating the Impact of Different Quantum Kernels on the Classification Performance of Support Vector Machine Algorithm: A Medical Dataset Application", "paper_summary": "The support vector machine algorithm with a quantum kernel estimator\n(QSVM-Kernel), as a leading example of a quantum machine learning technique,\nhas undergone significant advancements. Nevertheless, its integration with\nclassical data presents unique challenges. While quantum computers primarily\ninteract with data in quantum states, embedding classical data into quantum\nstates using feature mapping techniques is essential for leveraging quantum\nalgorithms Despite the recognized importance of feature mapping, its specific\nimpact on data classification outcomes remains largely unexplored. This study\naddresses this gap by comprehensively assessing the effects of various feature\nmapping methods on classification results, taking medical data analysis as a\ncase study. In this study, the QSVM-Kernel method was applied to classification\nproblems in two different and publicly available medical datasets, namely, the\nWisconsin Breast Cancer (original) and The Cancer Genome Atlas (TCGA) Glioma\ndatasets. In the QSVM-Kernel algorithm, quantum kernel matrices obtained from 9\ndifferent quantum feature maps were used. Thus, the effects of these quantum\nfeature maps on the classification results of the QSVM-Kernel algorithm were\nexamined in terms of both classifier performance and total execution time. As a\nresult, in the Wisconsin Breast Cancer (original) and TCGA Glioma datasets,\nwhen Rx and Ry rotational gates were used, respectively, as feature maps in the\nQSVM-Kernel algorithm, the best classification performances were achieved both\nin terms of classification performance and total execution time. The\ncontributions of this study are that (1) it highlights the significant impact\nof feature mapping techniques on medical data classification outcomes using the\nQSVM-Kernel algorithm, and (2) it also guides undertaking research for improved\nQSVM classification performance.", "paper_summary_zh": "<paragraph>作為量子機器學習技術的領先範例，具有量子核估計器的支持向量機演算法 (QSVM-Kernel) 已經歷重大的進展。儘管如此，它與經典資料的整合提出了獨特的挑戰。雖然量子電腦主要與量子狀態中的資料互動，但使用特徵對應技術將經典資料嵌入量子狀態對於利用量子演算法至關重要。儘管特徵對應的重要性獲得認可，但其對資料分類結果的具體影響仍未得到充分探討。本研究透過全面評估各種特徵對應方法對分類結果的影響來解決這個差距，並將醫學資料分析作為案例研究。在本研究中，QSVM-Kernel 方法被應用於兩個不同且公開可用的醫學資料集中的分類問題，即威斯康辛乳癌 (原始) 和癌症基因組圖譜 (TCGA) 神經膠質瘤資料集。在 QSVM-Kernel 演算法中，使用了從 9 個不同的量子特徵對應中獲得的量子核矩陣。因此，這些量子特徵對應對 QSVM-Kernel 演算法分類結果的影響在分類器效能和總執行時間方面都得到了檢驗。結果，在威斯康辛乳癌 (原始) 和 TCGA 神經膠質瘤資料集中，當 Rx 和 Ry 旋轉閘分別用作 QSVM-Kernel 演算法中的特徵對應時，在分類效能和總執行時間方面都達到了最佳的分類效能。本研究的貢獻在於：(1) 它強調了特徵對應技術對使用 QSVM-Kernel 演算法的醫學資料分類結果的重大影響，以及 (2) 它也指導進行研究以改善 QSVM 分類效能。</paragraph>", "author": "Emine Akpinar et.al.", "authors": "Emine Akpinar, Sardar M. N. Islam, Murat Oduncuoglu", "id": "2407.09930v2", "paper_url": "http://arxiv.org/abs/2407.09930v2", "repo": "null"}}