{"2501.17785": {"publish_time": "2025-01-29", "title": "Reasoning Over the Glyphs: Evaluation of LLM's Decipherment of Rare Scripts", "paper_summary": "We explore the capabilities of LVLMs and LLMs in deciphering rare scripts not\nencoded in Unicode. We introduce a novel approach to construct a multimodal\ndataset of linguistic puzzles involving such scripts, utilizing a tokenization\nmethod for language glyphs. Our methods include the Picture Method for LVLMs\nand the Description Method for LLMs, enabling these models to tackle these\nchallenges. We conduct experiments using prominent models, GPT-4o, Gemini, and\nClaude 3.5 Sonnet, on linguistic puzzles. Our findings reveal the strengths and\nlimitations of current AI methods in linguistic decipherment, highlighting the\nimpact of Unicode encoding on model performance and the challenges of modeling\nvisual language tokens through descriptions. Our study advances understanding\nof AI's potential in linguistic decipherment and underscores the need for\nfurther research.", "paper_summary_zh": "我們探討 LVLMs 和 LLM 解碼未編碼在 Unicode 中的罕見腳本的能力。我們引入一種創新的方法來建構一個涉及此類腳本的多模態語言謎題資料集，利用一種語言字形的標記化方法。我們的模型包含 LVLMs 的圖片方法和 LLM 的描述方法，使這些模型能夠應對這些挑戰。我們使用傑出的模型 GPT-4o、Gemini 和 Claude 3.5 Sonnet 對語言謎題進行實驗。我們的研究結果揭示了當前 AI 方法在語言解碼中的優點和限制，強調了 Unicode 編碼對模型效能的影響，以及透過描述對視覺語言標記建模的挑戰。我們的研究推動了對 AI 在語言解碼中的潛力的理解，並強調了進一步研究的必要性。", "author": "Yu-Fei Shih et.al.", "authors": "Yu-Fei Shih, Zheng-Lin Lin, Shu-Kai Hsieh", "id": "2501.17785v1", "paper_url": "http://arxiv.org/abs/2501.17785v1", "repo": "null"}}