{"2406.04941": {"publish_time": "2024-06-07", "title": "TCMD: A Traditional Chinese Medicine QA Dataset for Evaluating Large Language Models", "paper_summary": "The recently unprecedented advancements in Large Language Models (LLMs) have\npropelled the medical community by establishing advanced medical-domain models.\nHowever, due to the limited collection of medical datasets, there are only a\nfew comprehensive benchmarks available to gauge progress in this area. In this\npaper, we introduce a new medical question-answering (QA) dataset that contains\nmassive manual instruction for solving Traditional Chinese Medicine examination\ntasks, called TCMD. Specifically, our TCMD collects massive questions across\ndiverse domains with their annotated medical subjects and thus supports us in\ncomprehensively assessing the capability of LLMs in the TCM domain. Extensive\nevaluation of various general LLMs and medical-domain-specific LLMs is\nconducted. Moreover, we also analyze the robustness of current LLMs in solving\nTCM QA tasks by introducing randomness. The inconsistency of the experimental\nresults also reveals the shortcomings of current LLMs in solving QA tasks. We\nalso expect that our dataset can further facilitate the development of LLMs in\nthe TCM area.", "paper_summary_zh": "近期大型語言模型 (LLM) 前所未有的進展，已透過建立先進的醫療領域模型推進了醫療界。然而，由於醫療資料集的收集有限，因此只有少數綜合評量可供衡量此領域的進度。在本文中，我們介紹了一個新的醫療問答 (QA) 資料集，其中包含大量手動說明，以解決中醫考試任務，稱為 TCMD。具體來說，我們的 TCMD 收集了不同領域的大量問題，並附有其註解的醫療主題，因此支持我們全面評估 LLM 在中醫領域的能力。對各種一般 LLM 和特定於醫療領域的 LLM 進行了廣泛評估。此外，我們還通過引入隨機性來分析當前 LLM 在解決中醫 QA 任務中的穩健性。實驗結果的不一致性也揭示了當前 LLM 在解決 QA 任務中的缺點。我們也期待我們的資料集能進一步促進中醫領域 LLM 的發展。", "author": "Ping Yu et.al.", "authors": "Ping Yu, Kaitao Song, Fengchen He, Ming Chen, Jianfeng Lu", "id": "2406.04941v1", "paper_url": "http://arxiv.org/abs/2406.04941v1", "repo": "null"}}