{"2501.06981": {"publish_time": "2025-01-13", "title": "Data Enrichment Work and AI Labor in Latin America and the Caribbean", "paper_summary": "The global AI surge demands crowdworkers from diverse languages and cultures.\nThey are pivotal in labeling data for enabling global AI systems. Despite\nglobal significance, research has primarily focused on understanding the\nperspectives and experiences of US and India crowdworkers, leaving a notable\ngap. To bridge this, we conducted a survey with 100 crowdworkers across 16\nLatin American and Caribbean countries. We discovered that these workers\nexhibited pride and respect for their digital labor, with strong support and\nadmiration from their families. Notably, crowd work was also seen as a stepping\nstone to financial and professional independence. Surprisingly, despite wanting\nmore connection, these workers also felt isolated from peers and doubtful of\nothers' labor quality. They resisted collaboration and gender-based tools,\nvaluing gender-neutrality. Our work advances HCI understanding of Latin\nAmerican and Caribbean crowdwork, offering insights for digital resistance\ntools for the region.", "paper_summary_zh": "全球 AI 的激增需要来自不同語言和文化的群眾工作者。\n他們在標記數據以啟用全球 AI 系統方面發揮著關鍵作用。儘管\n具有全球意義，但研究主要集中於了解美國和印度群眾工作者的觀點和經驗，留下了顯著的\n差距。為了彌合這一差距，我們對 16 個拉丁美洲和加勒比國家的 100 名群眾工作者進行了一項調查。我們發現這些工人\n對他們的數位勞動表現出自豪和尊重，並得到家人的大力支持和讚賞。值得注意的是，群眾工作也被視為邁向財務和專業獨立的踏腳石。令人驚訝的是，儘管想要更多聯繫，但這些工人也感到與同儕隔離，並對他人的勞動品質感到懷疑。他們抵制協作和基於性別的工具，重視性別中立。我們的研究推動了 HCI 對拉丁美洲和加勒比海群眾工作的理解，為該地區的數位抵抗工具提供了見解。", "author": "Gianna Williams et.al.", "authors": "Gianna Williams, Maya De Los Santos, Alexandra To, Saiph Savage", "id": "2501.06981v1", "paper_url": "http://arxiv.org/abs/2501.06981v1", "repo": "null"}}