{"2412.12591": {"publish_time": "2024-12-17", "title": "LLMs are Also Effective Embedding Models: An In-depth Overview", "paper_summary": "Large language models (LLMs) have revolutionized natural language processing\nby achieving state-of-the-art performance across various tasks. Recently, their\neffectiveness as embedding models has gained attention, marking a paradigm\nshift from traditional encoder-only models like ELMo and BERT to decoder-only,\nlarge-scale LLMs such as GPT, LLaMA, and Mistral. This survey provides an\nin-depth overview of this transition, beginning with foundational techniques\nbefore the LLM era, followed by LLM-based embedding models through two main\nstrategies to derive embeddings from LLMs. 1) Direct prompting: We mainly\ndiscuss the prompt designs and the underlying rationale for deriving\ncompetitive embeddings. 2) Data-centric tuning: We cover extensive aspects that\naffect tuning an embedding model, including model architecture, training\nobjectives, data constructions, etc. Upon the above, we also cover advanced\nmethods, such as handling longer texts, and multilingual and cross-modal data.\nFurthermore, we discuss factors affecting choices of embedding models, such as\nperformance/efficiency comparisons, dense vs sparse embeddings, pooling\nstrategies, and scaling law. Lastly, the survey highlights the limitations and\nchallenges in adapting LLMs for embeddings, including cross-task embedding\nquality, trade-offs between efficiency and accuracy, low-resource,\nlong-context, data bias, robustness, etc. This survey serves as a valuable\nresource for researchers and practitioners by synthesizing current\nadvancements, highlighting key challenges, and offering a comprehensive\nframework for future work aimed at enhancing the effectiveness and efficiency\nof LLMs as embedding models.", "paper_summary_zh": "大型語言模型 (LLM) 透過在各種任務中達成最先進的效能，徹底革新了自然語言處理。最近，它們作為嵌入模型的效能備受矚目，標誌著從傳統的僅編碼器模型（例如 ELMo 和 BERT）轉變為僅解碼器、大規模的 LLM（例如 GPT、LLaMA 和 Mistral）。這項調查深入探討了這項轉變，從 LLM 時代之前的基礎技術開始，接著是透過從 LLM 衍生嵌入的兩種主要策略，探討基於 LLM 的嵌入模型。1) 直接提示：我們主要討論提示設計和衍生競爭力嵌入的基礎原理。2) 以資料為中心的調整：我們涵蓋影響調整嵌入模型的廣泛面向，包括模型架構、訓練目標、資料建構等。在上述基礎上，我們也涵蓋進階方法，例如處理較長的文字，以及多語言和跨模態資料。此外，我們討論影響嵌入模型選擇的因素，例如效能/效率比較、稠密與稀疏嵌入、匯集策略和規模定律。最後，這項調查重點說明了將 LLM 調整為嵌入的限制和挑戰，包括跨任務嵌入品質、效率和準確性之間的權衡、低資源、長語境、資料偏差、穩健性等。這項調查透過綜合目前的進展、強調關鍵挑戰，並提供一個全面的架構，以增強 LLM 作為嵌入模型的效能和效率，進而成為研究人員和實務工作者的寶貴資源。", "author": "Chongyang Tao et.al.", "authors": "Chongyang Tao, Tao Shen, Shen Gao, Junshuo Zhang, Zhen Li, Zhengwei Tao, Shuai Ma", "id": "2412.12591v1", "paper_url": "http://arxiv.org/abs/2412.12591v1", "repo": "null"}}