{"2407.07229": {"publish_time": "2024-07-09", "title": "Using Galaxy Evolution as Source of Physics-Based Ground Truth for Generative Models", "paper_summary": "Generative models producing images have enormous potential to advance\ndiscoveries across scientific fields and require metrics capable of quantifying\nthe high dimensional output. We propose that astrophysics data, such as galaxy\nimages, can test generative models with additional physics-motivated ground\ntruths in addition to human judgment. For example, galaxies in the Universe\nform and change over billions of years, following physical laws and\nrelationships that are both easy to characterize and difficult to encode in\ngenerative models. We build a conditional denoising diffusion probabilistic\nmodel (DDPM) and a conditional variational autoencoder (CVAE) and test their\nability to generate realistic galaxies conditioned on their redshifts (galaxy\nages). This is one of the first studies to probe these generative models using\nphysically motivated metrics. We find that both models produce comparable\nrealistic galaxies based on human evaluation, but our physics-based metrics are\nbetter able to discern the strengths and weaknesses of the generative models.\nOverall, the DDPM model performs better than the CVAE on the majority of the\nphysics-based metrics. Ultimately, if we can show that generative models can\nlearn the physics of galaxy evolution, they have the potential to unlock new\nastrophysical discoveries.", "paper_summary_zh": "生成影像的生成模型具有促進科學領域發現的巨大潛力，並且需要能夠量化高維度輸出的指標。我們提出，天文物理數據（例如星系影像）可以使用額外的物理激勵基準真值以及人為判斷來測試生成模型。舉例來說，宇宙中的星系在數十億年來形成並改變，遵循物理定律和關係，這些定律和關係既容易描述，又難以編碼在生成模型中。我們建構條件式去噪擴散機率模型 (DDPM) 和條件式變異自動編碼器 (CVAE)，並測試它們在以紅移（星系年齡）為條件下產生逼真星系的能力。這是第一批使用物理激勵指標探測這些生成模型的研究之一。我們發現，根據人為評估，這兩個模型都能產生可比較的逼真星系，但我們的基於物理的指標更能辨別生成模型的優缺點。總體而言，DDPM 模型在大部分基於物理的指標上表現優於 CVAE。最終，如果我們能證明生成模型可以學習星系演化的物理，它們就有可能解鎖新的天體物理發現。", "author": "Yun Qi Li et.al.", "authors": "Yun Qi Li, Tuan Do, Evan Jones, Bernie Boscoe, Kevin Alfaro, Zooey Nguyen", "id": "2407.07229v1", "paper_url": "http://arxiv.org/abs/2407.07229v1", "repo": "https://github.com/astrodatalab/li2024_public"}}