{"2501.07800": {"publish_time": "2025-01-14", "title": "BioPose: Biomechanically-accurate 3D Pose Estimation from Monocular Videos", "paper_summary": "Recent advancements in 3D human pose estimation from single-camera images and\nvideos have relied on parametric models, like SMPL. However, these models\noversimplify anatomical structures, limiting their accuracy in capturing true\njoint locations and movements, which reduces their applicability in\nbiomechanics, healthcare, and robotics. Biomechanically accurate pose\nestimation, on the other hand, typically requires costly marker-based motion\ncapture systems and optimization techniques in specialized labs. To bridge this\ngap, we propose BioPose, a novel learning-based framework for predicting\nbiomechanically accurate 3D human pose directly from monocular videos. BioPose\nincludes three key components: a Multi-Query Human Mesh Recovery model\n(MQ-HMR), a Neural Inverse Kinematics (NeurIK) model, and a 2D-informed pose\nrefinement technique. MQ-HMR leverages a multi-query deformable transformer to\nextract multi-scale fine-grained image features, enabling precise human mesh\nrecovery. NeurIK treats the mesh vertices as virtual markers, applying a\nspatial-temporal network to regress biomechanically accurate 3D poses under\nanatomical constraints. To further improve 3D pose estimations, a 2D-informed\nrefinement step optimizes the query tokens during inference by aligning the 3D\nstructure with 2D pose observations. Experiments on benchmark datasets\ndemonstrate that BioPose significantly outperforms state-of-the-art methods.\nProject website:\n\\url{https://m-usamasaleem.github.io/publication/BioPose/BioPose.html}.", "paper_summary_zh": "<paragraph>最近在單一相機影像和影片中進行 3D 人體姿勢估計的進展，仰賴於參數模型，例如 SMPL。然而，這些模型過度簡化解剖結構，限制其在捕捉真實關節位置和動作時的準確性，這降低了它們在生物力學、醫療保健和機器人技術中的適用性。另一方面，在生物力學上準確的姿勢估計通常需要昂貴的基於標記的動作捕捉系統和在專門實驗室中進行最佳化技術。為了彌補這個差距，我們提出了 BioPose，一個用於從單眼影片中直接預測生物力學上準確的 3D 人體姿勢的新型基於學習的框架。BioPose 包含三個關鍵組成部分：多重查詢人體網格復原模型 (MQ-HMR)、神經反向運動學 (NeurIK) 模型和 2D 資訊姿勢精緻化技術。MQ-HMR 採用多重查詢可變形轉換器來提取多尺度細粒度影像特徵，實現精確的人體網格復原。NeurIK 將網格頂點視為虛擬標記，應用時空網路在解剖約束下回歸生物力學上準確的 3D 姿勢。為了進一步改善 3D 姿勢估計，2D 資訊精緻化步驟會在推論期間最佳化查詢代碼，藉由將 3D 結構與 2D 姿勢觀察結果對齊。基準資料集上的實驗證明，BioPose 明顯優於最先進的方法。專案網站：\\url{https://m-usamasaleem.github.io/publication/BioPose/BioPose.html}。</paragraph>", "author": "Farnoosh Koleini et.al.", "authors": "Farnoosh Koleini, Muhammad Usama Saleem, Pu Wang, Hongfei Xue, Ahmed Helmy, Abbey Fenwick", "id": "2501.07800v1", "paper_url": "http://arxiv.org/abs/2501.07800v1", "repo": "null"}}