{"2501.00803": {"publish_time": "2025-01-01", "title": "Reasoning-Oriented and Analogy-Based Methods for Locating and Editing in Zero-Shot Event-Relational Reasoning", "paper_summary": "Zero-shot event-relational reasoning is an important task in natural language\nprocessing, and existing methods jointly learn a variety of event-relational\nprefixes and inference-form prefixes to achieve such tasks. However, training\nprefixes consumes large computational resources and lacks interpretability.\nAdditionally, learning various relational and inferential knowledge\ninefficiently exploits the connections between tasks. Therefore, we first\npropose a method for Reasoning-Oriented Locating and Editing (ROLE), which\nlocates and edits the key modules of the language model for reasoning about\nevent relations, enhancing interpretability and also resource-efficiently\noptimizing the reasoning ability. Subsequently, we propose a method for\nAnalogy-Based Locating and Editing (ABLE), which efficiently exploits the\nsimilarities and differences between tasks to optimize the zero-shot reasoning\ncapability. Experimental results show that ROLE improves interpretability and\nreasoning performance with reduced computational cost. ABLE achieves SOTA\nresults in zero-shot reasoning.", "paper_summary_zh": "零次發射事件關係推理是自然語言處理中的一項重要任務，現有方法聯合學習各種事件關係前綴和推理形式前綴來實現此類任務。然而，訓練前綴消耗大量的計算資源且缺乏可解釋性。此外，學習各種關係和推理知識無法有效利用任務之間的聯繫。因此，我們首先提出了一個面向推理的定位和編輯 (ROLE) 方法，它定位和編輯語言模型中用於推理事件關係的關鍵模組，增強可解釋性，同時以資源有效的方式優化推理能力。隨後，我們提出了一個基於類比的定位和編輯 (ABLE) 方法，它有效地利用任務之間的相似性和差異來優化零次發射推理能力。實驗結果表明，ROLE 以降低的計算成本提高了可解釋性和推理性能。ABLE 在零次發射推理中取得了 SOTA 結果。", "author": "Jingyao Tang et.al.", "authors": "Jingyao Tang, Lishuang Li, Liteng Mi, Haiming Wu, Hongbin Lu", "id": "2501.00803v1", "paper_url": "http://arxiv.org/abs/2501.00803v1", "repo": "null"}}