{"2405.10093": {"publish_time": "2024-05-16", "title": "LaT-PFN: A Joint Embedding Predictive Architecture for In-context Time-series Forecasting", "paper_summary": "We introduce LatentTimePFN (LaT-PFN), a foundational Time Series model with a\nstrong embedding space that enables zero-shot forecasting. To achieve this, we\nperform in-context learning in latent space utilizing a novel integration of\nthe Prior-data Fitted Networks (PFN) and Joint Embedding Predictive\nArchitecture (JEPA) frameworks. We leverage the JEPA framework to create a\nprediction-optimized latent representation of the underlying stochastic process\nthat generates time series and combines it with contextual learning, using a\nPFN. Furthermore, we improve on preceding works by utilizing related time\nseries as a context and introducing an abstract time axis. This drastically\nreduces training time and increases the versatility of the model by allowing\nany time granularity and forecast horizon. We show that this results in\nsuperior zero-shot predictions compared to established baselines. We also\ndemonstrate our latent space produces informative embeddings of both individual\ntime steps and fixed-length summaries of entire series. Finally, we observe the\nemergence of multi-step patch embeddings without explicit training, suggesting\nthe model actively learns discrete tokens that encode local structures in the\ndata, analogous to vision transformers.", "paper_summary_zh": "我們引入 LatentTimePFN (LaT-PFN)，一個具有強大嵌入空間的基本時間序列模型，支援零次預測。為達成此目的，我們在潛在空間中執行情境學習，利用先驗資料擬合網路 (PFN) 和聯合嵌入預測架構 (JEPA) 框架的創新整合。我們運用 JEPA 框架，建立產生時間序列的底層隨機過程的預測最佳化潛在表示，並使用 PFN 將其與情境學習結合。此外，我們透過利用相關時間序列作為情境，並引入抽象時間軸，來改進前人的研究。這大幅縮短訓練時間，並允許任何時間粒度和預測範圍，進而提升模型的多功能性。我們證明，相較於既定的基準，這會產生優異的零次預測。我們也證明我們的潛在空間產生個別時間步驟和整個序列的固定長度摘要的資訊性嵌入。最後，我們觀察到多步驟修補嵌入的出現，而無需明確訓練，這表示模型主動學習編碼資料中局部結構的離散符號，類似於視覺Transformer。", "author": "Stijn Verdenius et.al.", "authors": "Stijn Verdenius, Andrea Zerio, Roy L. M. Wang", "id": "2405.10093v1", "paper_url": "http://arxiv.org/abs/2405.10093v1", "repo": "null"}}