{"2504.13837": {"publish_time": "2025-04-18", "title": "Does Reinforcement Learning Really Incentivize Reasoning Capacity in LLMs Beyond the Base Model?", "paper_summary": "Reinforcement Learning with Verifiable Rewards (RLVR) has recently\ndemonstrated notable success in enhancing the reasoning capabilities of LLMs,\nparticularly in mathematics and programming tasks. It is widely believed that\nRLVR enables LLMs to continuously self-improve, thus acquiring novel reasoning\nabilities that exceed corresponding base models' capacity. In this study,\nhowever, we critically re-examines this assumption by measuring the\npass@\\textit{k} metric with large values of \\textit{k} to explore the reasoning\ncapability boundary of the models across a wide range of model families and\nbenchmarks. Surprisingly, the RL does \\emph{not}, in fact, elicit fundamentally\nnew reasoning patterns. While RL-trained models outperform their base models at\nsmaller values of $k$ (\\eg, $k$=1), base models can achieve a comparable or\neven higher pass@$k$ score compared to their RL counterparts at large $k$\nvalues. The reasoning paths generated by RL-trained models are already included\nin the base models' sampling distribution, suggesting that most reasoning\nabilities manifested in RL-trained models are already obtained by base models.\nFurther analysis shows that RL training boosts the performance by biasing the\nmodel's output distribution toward paths that are more likely to yield rewards,\ntherefore sampling correct responses more efficiently. But this also results in\na narrower reasoning capability boundary compared to base models. Similar\nresults are observed in visual reasoning tasks trained with RLVR. Moreover, we\nfind that distillation can genuinely introduce new knowledge into the model,\ndifferent from RLVR. These findings underscore a critical limitation of RLVR in\nadvancing LLM reasoning abilities which requires us to fundamentally rethink\nthe impact of RL training in reasoning LLMs and the need of a better paradigm.\nProject Page: https://limit-of-RLVR.github.io", "paper_summary_zh": "<paragraph>使用可驗證獎勵的強化學習 (RLVR) 近期在增強大型語言模型 (LLM) 的推理能力方面展現了顯著的成功，尤其是在數學和程式設計任務中。普遍認為，RLVR 使 LLM 能夠持續自我改進，從而獲得超越相應基礎模型能力的新推理能力。然而，在本研究中，我們透過測量具有較大 \\textit{k} 值的 pass@\\textit{k} 指標，以探索各種模型系列和基準測試中模型的推理能力邊界，批判性地重新審視了這一假設。令人驚訝的是，強化學習實際上\\emph{並未} 引發根本上的新推理模式。雖然經過強化學習訓練的模型在較小的 $k$ 值（例如 $k$=1）下表現優於其基礎模型，但在較大的 $k$ 值下，基礎模型可以達到與其強化學習對應模型相當甚至更高的 pass@$k$ 分數。強化學習訓練模型產生的推理路徑已包含在基礎模型的採樣分佈中，這表明強化學習訓練模型中體現的大多數推理能力已由基礎模型獲得。進一步的分析表明，強化學習訓練透過將模型的輸出分佈偏向更有可能產生獎勵的路徑來提高效能，從而更有效地採樣正確的響應。但這也導致與基礎模型相比，推理能力邊界更窄。在使用 RLVR 訓練的視覺推理任務中也觀察到了類似的結果。此外，我們發現蒸餾可以真正地將新知識引入模型中，這與 RLVR 不同。這些發現突顯了 RLVR 在提升 LLM 推理能力方面的一個關鍵限制，這需要我們從根本上重新思考強化學習訓練對推理 LLM 的影響以及對更好範式的需求。專案頁面：https://limit-of-RLVR.github.io</paragraph>\n", "author": "Yang Yue et.al.", "authors": "Yang Yue, Zhiqi Chen, Rui Lu, Andrew Zhao, Zhaokai Wang, Yang Yue, Shiji Song, Gao Huang", "id": "2504.13837v1", "paper_url": "http://arxiv.org/abs/2504.13837v1", "repo": "null"}}