{"2408.11457": {"publish_time": "2024-08-21", "title": "Expanding FLORES+ Benchmark for more Low-Resource Settings: Portuguese-Emakhuwa Machine Translation Evaluation", "paper_summary": "As part of the Open Language Data Initiative shared tasks, we have expanded\nthe FLORES+ evaluation set to include Emakhuwa, a low-resource language widely\nspoken in Mozambique. We translated the dev and devtest sets from Portuguese\ninto Emakhuwa, and we detail the translation process and quality assurance\nmeasures used. Our methodology involved various quality checks, including\npost-editing and adequacy assessments. The resulting datasets consist of\nmultiple reference sentences for each source. We present baseline results from\ntraining a Neural Machine Translation system and fine-tuning existing\nmultilingual translation models. Our findings suggest that spelling\ninconsistencies remain a challenge in Emakhuwa. Additionally, the baseline\nmodels underperformed on this evaluation set, underscoring the necessity for\nfurther research to enhance machine translation quality for Emakhuwa. The data\nis publicly available at https://huggingface.co/datasets/LIACC/Emakhuwa-FLORES.", "paper_summary_zh": "作為開放語言資料計畫共享任務的一部分，我們已擴展 FLORES+ 評估集，以納入在莫三比克廣泛使用的低資源語言 Emakhuwa。我們將 dev 和 devtest 集從葡萄牙語翻譯成 Emakhuwa，並詳細說明翻譯過程和使用的品質保證措施。我們的做法涉及各種品質檢查，包括後編輯和適足性評估。產生的資料集包含每個來源的多個參考句子。我們展示了訓練神經機器翻譯系統和微調現有之多語言翻譯模型的基準結果。我們的研究結果表明，拼寫不一致仍然是 Emakhuwa 的一項挑戰。此外，基準模型在此評估集中的表現不佳，強調進一步研究以提升 Emakhuwa 的機器翻譯品質的必要性。資料可於 https://huggingface.co/datasets/LIACC/Emakhuwa-FLORES 公開取得。", "author": "Felermino D. M. Antonio Ali et.al.", "authors": "Felermino D. M. Antonio Ali, Henrique Lopes Cardoso, Rui Sousa-Silva", "id": "2408.11457v1", "paper_url": "http://arxiv.org/abs/2408.11457v1", "repo": "null"}}