{"2412.12735": {"publish_time": "2024-12-17", "title": "GIRAFFE: Design Choices for Extending the Context Length of Visual Language Models", "paper_summary": "Visual Language Models (VLMs) demonstrate impressive capabilities in\nprocessing multimodal inputs, yet applications such as visual agents, which\nrequire handling multiple images and high-resolution videos, demand enhanced\nlong-range modeling. Moreover, existing open-source VLMs lack systematic\nexploration into extending their context length, and commercial models often\nprovide limited details. To tackle this, we aim to establish an effective\nsolution that enhances long context performance of VLMs while preserving their\ncapacities in short context scenarios. Towards this goal, we make the best\ndesign choice through extensive experiment settings from data curation to\ncontext window extending and utilizing: (1) we analyze data sources and length\ndistributions to construct ETVLM - a data recipe to balance the performance\nacross scenarios; (2) we examine existing position extending methods, identify\ntheir limitations and propose M-RoPE++ as an enhanced approach; we also choose\nto solely instruction-tune the backbone with mixed-source data; (3) we discuss\nhow to better utilize extended context windows and propose hybrid-resolution\ntraining. Built on the Qwen-VL series model, we propose Giraffe, which is\neffectively extended to 128K lengths. Evaluated on extensive long context VLM\nbenchmarks such as VideoMME and Viusal Haystacks, our Giraffe achieves\nstate-of-the-art performance among similarly sized open-source long VLMs and is\ncompetitive with commercial model GPT-4V. We will open-source the code, data,\nand models.", "paper_summary_zh": "視覺語言模型 (VLM) 在處理多模態輸入方面展現出令人印象深刻的能力，但需要處理多張影像和高解析度影片的視覺代理等應用程式需要增強遠距建模。此外，現有的開放原始碼 VLM 缺乏系統性探索以延伸其內容長度，而商業模式通常提供有限的細節。為了解決這個問題，我們旨在建立一個有效的解決方案，在保留 VLM 在短內容情境中的能力下，增強其在長內容情境中的表現。為了達成這個目標，我們透過廣泛的實驗設定，從資料整理到內容視窗延伸和利用，做出最佳設計選擇：(1) 我們分析資料來源和長度分佈，以建構 ETVLM - 一種資料配方，以平衡不同情境下的表現；(2) 我們檢視現有的位置延伸方法，找出其限制，並提出 M-RoPE++ 作為一種增強的方法；我們也選擇僅使用混合來源資料對主幹進行指令調整；(3) 我們討論如何更好地利用延伸的內容視窗，並提出混合解析度訓練。建構在 Qwen-VL 系列模型上，我們提出 Giraffe，它有效地延伸到 128K 的長度。在廣泛的長內容 VLM 基準上進行評估，例如 VideoMME 和 Viusal Haystacks，我們的 Giraffe 在相似大小的開放原始碼長 VLM 中取得最先進的表現，並且與商業模型 GPT-4V 競爭。我們將開放原始碼、資料和模型。", "author": "Mukai Li et.al.", "authors": "Mukai Li, Lei Li, Shansan Gong, Qi Liu", "id": "2412.12735v1", "paper_url": "http://arxiv.org/abs/2412.12735v1", "repo": "null"}}