{"2412.08885": {"publish_time": "2024-12-12", "title": "Residual Channel Boosts Contrastive Learning for Radio Frequency Fingerprint Identification", "paper_summary": "In order to address the issue of limited data samples for the deployment of\npre-trained models in unseen environments, this paper proposes a residual\nchannel-based data augmentation strategy for Radio Frequency Fingerprint\nIdentification (RFFI), coupled with a lightweight SimSiam contrastive learning\nframework. By applying least square (LS) and minimum mean square error (MMSE)\nchannel estimations followed by equalization, signals with different residual\nchannel effects are generated. These residual channels enable the model to\nlearn more effective representations. Then the pre-trained model is fine-tuned\nwith 1% samples in a novel environment for RFFI. Experimental results\ndemonstrate that our method significantly enhances both feature extraction\nability and generalization while requiring fewer samples and less time, making\nit suitable for practical wireless security applications.", "paper_summary_zh": "為了解決在未見環境中部署預訓練模型的數據樣本有限問題，本文提出了一種殘差通道數據擴充策略，用於射頻指紋辨識 (RFFI)，並結合輕量級的 SimSiam 對比學習架構。透過運用最小二乘 (LS) 和最小均方誤差 (MMSE) 通道估計，然後進行等化，產生具有不同殘差通道效應的訊號。這些殘差通道使模型能夠學習更有效的表示。然後，預訓練模型在 RFFI 的新環境中使用 1% 的樣本進行微調。實驗結果表明，我們的模型顯著提升了特徵提取能力和泛化能力，同時需要更少的樣本和時間，使其適用於實際的無線安全應用。", "author": "Rui Pan et.al.", "authors": "Rui Pan, Hui Chen, Guanxiong Shen, Hongyang Chen", "id": "2412.08885v1", "paper_url": "http://arxiv.org/abs/2412.08885v1", "repo": "null"}}