{"2407.02028": {"publish_time": "2024-07-02", "title": "Why does in-context learning fail sometimes? Evaluating in-context learning on open and closed questions", "paper_summary": "We measure the performance of in-context learning as a function of task\nnovelty and difficulty for open and closed questions. For that purpose, we\ncreated a novel benchmark consisting of hard scientific questions, each paired\nwith a context of various relevancy. We show that counter-intuitively, a\ncontext that is more aligned with the topic does not always help more than a\nless relevant context. This effect is especially visible for open questions and\nquestions of high difficulty or novelty. This result reveals a fundamental\ndifference between the treatment of close-form and open-form questions by\nlarge-language models and shows a need for a more robust evaluation of\nin-context learning on the variety of different types of questions. It also\nposes a new question of how to optimally select a context for large language\nmodels, especially in the context of Retrieval Augmented Generation (RAG)\nsystems. Our results suggest that the answer to this question can be highly\napplication-dependent and might be contingent on factors including the format\nof the question, the perceived difficulty level of the questions, and the\nnovelty or popularity of the information we seek.", "paper_summary_zh": "我們測量情境學習的表現，作為開放式和封閉式問題的任務新穎性和難度的函數。為此目的，我們建立了一個由困難的科學問題組成的全新基準，每個問題都與各種相關性的情境配對。我們展示出與主題更一致的情境並非總是有助於比相關性較低的情境更多。這種效應對於開放式問題和高難度或新穎性的問題特別明顯。此結果揭示了大型語言模型對封閉形式和開放形式問題的處理之間的根本區別，並顯示需要對各種不同類型的問題進行更強健的情境學習評估。它還提出了如何為大型語言模型最佳選擇情境的全新問題，特別是在檢索增強生成 (RAG) 系統的情境中。我們的結果表明，這個問題的答案可能高度依賴應用程式，並且可能取決於包括問題格式、問題的感知難度等級以及我們尋求的資訊的新穎性或流行性等因素。", "author": "Xiang Li et.al.", "authors": "Xiang Li, Haoran Tang, Siyu Chen, Ziwei Wang, Ryan Chen, Marcin Abram", "id": "2407.02028v1", "paper_url": "http://arxiv.org/abs/2407.02028v1", "repo": "null"}}