{"2412.14660": {"publish_time": "2024-12-19", "title": "Unveiling Uncertainty: A Deep Dive into Calibration and Performance of Multimodal Large Language Models", "paper_summary": "Multimodal large language models (MLLMs) combine visual and textual data for\ntasks such as image captioning and visual question answering. Proper\nuncertainty calibration is crucial, yet challenging, for reliable use in areas\nlike healthcare and autonomous driving. This paper investigates representative\nMLLMs, focusing on their calibration across various scenarios, including before\nand after visual fine-tuning, as well as before and after multimodal training\nof the base LLMs. We observed miscalibration in their performance, and at the\nsame time, no significant differences in calibration across these scenarios. We\nalso highlight how uncertainty differs between text and images and how their\nintegration affects overall uncertainty. To better understand MLLMs'\nmiscalibration and their ability to self-assess uncertainty, we construct the\nIDK (I don't know) dataset, which is key to evaluating how they handle\nunknowns. Our findings reveal that MLLMs tend to give answers rather than admit\nuncertainty, but this self-assessment improves with proper prompt adjustments.\nFinally, to calibrate MLLMs and enhance model reliability, we propose\ntechniques such as temperature scaling and iterative prompt optimization. Our\nresults provide insights into improving MLLMs for effective and responsible\ndeployment in multimodal applications. Code and IDK dataset:\n\\href{https://github.com/hfutml/Calibration-MLLM}{https://github.com/hfutml/Calibration-MLLM}.", "paper_summary_zh": "多模態大型語言模型 (MMLM) 結合視覺和文字資料，可執行影像標註和視覺問答等任務。適當的不確定性校準對於在醫療保健和自動駕駛等領域中可靠使用至關重要，但卻具有挑戰性。本文探討具代表性的 MMLM，重點關注它們在各種場景中的校準，包括視覺微調前後，以及基礎 LLM 的多模態訓練前後。我們觀察到它們的效能校準不佳，但同時在這些場景中沒有顯著的校準差異。我們也強調不確定性在文字和影像之間的差異，以及它們的整合如何影響整體的不確定性。為了更了解 MLLM 的校準不佳以及它們自我評估不確定性的能力，我們建構了 IDK（我不知道）資料集，這對於評估它們如何處理未知數至關重要。我們的研究結果顯示，MMLM 傾向於給出答案，而不是承認不確定性，但這種自我評估會隨著適當的提示調整而改善。最後，為了校準 MLLM 並增強模型的可靠性，我們提出溫度縮放和反覆提示最佳化等技術。我們的結果提供了深入見解，可改善 MLLM 在多模態應用中有效且負責任的部署。程式碼和 IDK 資料集：\\href{https://github.com/hfutml/Calibration-MLLM}{https://github.com/hfutml/Calibration-MLLM}。", "author": "Zijun Chen et.al.", "authors": "Zijun Chen, Wenbo Hu, Guande He, Zhijie Deng, Zheng Zhang, Richang Hong", "id": "2412.14660v1", "paper_url": "http://arxiv.org/abs/2412.14660v1", "repo": "https://github.com/hfutml/calibration-mllm"}}