{"2406.19997": {"publish_time": "2024-06-28", "title": "Wavelets Are All You Need for Autoregressive Image Generation", "paper_summary": "In this paper, we take a new approach to autoregressive image generation that\nis based on two main ingredients. The first is wavelet image coding, which\nallows to tokenize the visual details of an image from coarse to fine details\nby ordering the information starting with the most significant bits of the most\nsignificant wavelet coefficients. The second is a variant of a language\ntransformer whose architecture is re-designed and optimized for token sequences\nin this 'wavelet language'. The transformer learns the significant statistical\ncorrelations within a token sequence, which are the manifestations of\nwell-known correlations between the wavelet subbands at various resolutions. We\nshow experimental results with conditioning on the generation process.", "paper_summary_zh": "在本文中，我們採取了一種新的自迴歸影像生成方式，它基於兩個主要元素。第一個是影像小波編碼，它允許從粗略到精細的細節對影像的視覺細節進行標記化，方法是從最重要的波段係數的最重要位元開始對資訊進行排序。第二個是語言轉換器的變體，其架構經過重新設計和最佳化，適用於此「小波語言」中的標記序列。轉換器會學習標記序列中的顯著統計關聯性，這些關聯性是不同解析度的小波子頻帶之間眾所周知關聯性的表現形式。我們展示了對生成過程進行條件化的實驗結果。", "author": "Wael Mattar et.al.", "authors": "Wael Mattar, Idan Levy, Nir Sharon, Shai Dekel", "id": "2406.19997v1", "paper_url": "http://arxiv.org/abs/2406.19997v1", "repo": "null"}}