{"2405.16969": {"publish_time": "2024-05-27", "title": "The Multi-Range Theory of Translation Quality Measurement: MQM scoring models and Statistical Quality Control", "paper_summary": "The year 2024 marks the 10th anniversary of the Multidimensional Quality\nMetrics (MQM) framework for analytic translation quality evaluation. The MQM\nerror typology has been widely used by practitioners in the translation and\nlocalization industry and has served as the basis for many derivative projects.\nThe annual Conference on Machine Translation (WMT) shared tasks on both human\nand automatic translation quality evaluations used the MQM error typology.\n  The metric stands on two pillars: error typology and the scoring model. The\nscoring model calculates the quality score from annotation data, detailing how\nto convert error type and severity counts into numeric scores to determine if\nthe content meets specifications. Previously, only the raw scoring model had\nbeen published. This April, the MQM Council published the Linear Calibrated\nScoring Model, officially presented herein, along with the Non-Linear Scoring\nModel, which had not been published before.\n  This paper details the latest MQM developments and presents a universal\napproach to translation quality measurement across three sample size ranges. It\nalso explains why Statistical Quality Control should be used for very small\nsample sizes, starting from a single sentence.", "paper_summary_zh": "2024 年是多維度品質度量 (MQM) 框架用於分析翻譯品質評估的 10 週年。MQM 錯誤類型學已廣泛用於翻譯和在地化產業的從業人員，並作為許多衍生專案的基礎。機器翻譯年會 (WMT) 在人類和自動翻譯品質評估中所共用的任務，使用了 MQM 錯誤類型學。\n\n此度量標準建立在兩個支柱上：錯誤類型學和計分模型。計分模型從註解資料計算品質分數，詳細說明如何將錯誤類型和嚴重性計數轉換為數字分數，以確定內容是否符合規格。以前，只有原始計分模型已發布。今年 4 月，MQM 委員會發布了線性校準計分模型，並在本文中正式提出，以及先前未發布的非線性計分模型。\n\n本文詳細說明了最新的 MQM 發展，並提出了針對三個範例大小範圍的翻譯品質測量通用方法。它也說明了為什麼應將統計品質控制用於極小的範例大小，從單一句子開始。", "author": "Arle Lommel et.al.", "authors": "Arle Lommel, Serge Gladkoff, Alan Melby, Sue Ellen Wright, Ingemar Strandvik, Katerina Gasova, Angelika Vaasa, Andy Benzo, Romina Marazzato Sparano, Monica Faresi, Johani Innis, Lifeng Han, Goran Nenadic", "id": "2405.16969v1", "paper_url": "http://arxiv.org/abs/2405.16969v1", "repo": "null"}}