{"2411.02275": {"publish_time": "2024-11-04", "title": "Breaking the Reclustering Barrier in Centroid-based Deep Clustering", "paper_summary": "This work investigates an important phenomenon in centroid-based deep\nclustering (DC) algorithms: Performance quickly saturates after a period of\nrapid early gains. Practitioners commonly address early saturation with\nperiodic reclustering, which we demonstrate to be insufficient to address\nperformance plateaus. We call this phenomenon the \"reclustering barrier\" and\nempirically show when the reclustering barrier occurs, what its underlying\nmechanisms are, and how it is possible to Break the Reclustering Barrier with\nour algorithm BRB. BRB avoids early over-commitment to initial clusterings and\nenables continuous adaptation to reinitialized clustering targets while\nremaining conceptually simple. Applying our algorithm to widely-used\ncentroid-based DC algorithms, we show that (1) BRB consistently improves\nperformance across a wide range of clustering benchmarks, (2) BRB enables\ntraining from scratch, and (3) BRB performs competitively against\nstate-of-the-art DC algorithms when combined with a contrastive loss. We\nrelease our code and pre-trained models at\nhttps://github.com/Probabilistic-and-Interactive-ML/breaking-the-reclustering-barrier .", "paper_summary_zh": "這項工作探討了以質心為基礎的深度叢集 (DC) 演算法中一個重要的現象：在一段快速早期收益期之後，效能會迅速飽和。從業人員通常使用定期重新叢集來處理早期飽和，我們證明這不足以解決效能停滯。我們稱此現象為「重新叢集障礙」，並透過實證顯示重新叢集障礙何時發生、其背後的機制是什麼，以及如何透過我們的演算法 BRB 打破重新叢集障礙。BRB 避免過早過度承諾於初始叢集，並能在保持概念簡單的同時，持續適應重新初始化的叢集目標。將我們的演算法套用於廣泛使用的以質心為基礎的 DC 演算法，我們顯示 (1) BRB 在廣泛的叢集基準上持續改善效能，(2) BRB 能夠從頭開始訓練，以及 (3) BRB 與結合對比損失的最新 DC 演算法相比，具有競爭力。我們在 https://github.com/Probabilistic-and-Interactive-ML/breaking-the-reclustering-barrier 發布我們的程式碼和預先訓練的模型。", "author": "Lukas Miklautz et.al.", "authors": "Lukas Miklautz, Timo Klein, Kevin Sidak, Collin Leiber, Thomas Lang, Andrii Shkabrii, Sebastian Tschiatschek, Claudia Plant", "id": "2411.02275v1", "paper_url": "http://arxiv.org/abs/2411.02275v1", "repo": "https://github.com/probabilistic-and-interactive-ml/breaking-the-reclustering-barrier"}}