{"2501.04377": {"publish_time": "2025-01-08", "title": "On Computational Limits and Provably Efficient Criteria of Visual Autoregressive Models: A Fine-Grained Complexity Analysis", "paper_summary": "Recently, Visual Autoregressive ($\\mathsf{VAR}$) Models introduced a\ngroundbreaking advancement in the field of image generation, offering a\nscalable approach through a coarse-to-fine \"next-scale prediction\" paradigm.\nHowever, the state-of-the-art algorithm of $\\mathsf{VAR}$ models in [Tian,\nJiang, Yuan, Peng and Wang, NeurIPS 2024] takes $O(n^4)$ time, which is\ncomputationally inefficient. In this work, we analyze the computational limits\nand efficiency criteria of $\\mathsf{VAR}$ Models through a fine-grained\ncomplexity lens. Our key contribution is identifying the conditions under which\n$\\mathsf{VAR}$ computations can achieve sub-quadratic time complexity.\nSpecifically, we establish a critical threshold for the norm of input matrices\nused in $\\mathsf{VAR}$ attention mechanisms. Above this threshold, assuming the\nStrong Exponential Time Hypothesis ($\\mathsf{SETH}$) from fine-grained\ncomplexity theory, a sub-quartic time algorithm for $\\mathsf{VAR}$ models is\nimpossible. To substantiate our theoretical findings, we present efficient\nconstructions leveraging low-rank approximations that align with the derived\ncriteria. This work initiates the study of the computational efficiency of the\n$\\mathsf{VAR}$ model from a theoretical perspective. Our technique will shed\nlight on advancing scalable and efficient image generation in $\\mathsf{VAR}$\nframeworks.", "paper_summary_zh": "最近，视觉自回归 ($\\mathsf{VAR}$) 模型在图像生成领域引入了一项开创性的进步，通过粗到细的“下一尺度预测”范例提供了一种可扩展的方法。然而，$\\mathsf{VAR}$ 模型在 [Tian, Jiang, Yuan, Peng 和 Wang, NeurIPS 2024] 中的最先进算法需要 $O(n^4)$ 时间，这在计算上是低效的。在这项工作中，我们通过细粒度的复杂性透镜分析了 $\\mathsf{VAR}$ 模型的计算限制和效率标准。我们的关键贡献是确定 $\\mathsf{VAR}$ 计算可以在其中实现次二次时间复杂度的条件。具体来说，我们为 $\\mathsf{VAR}$ 注意力机制中使用的输入矩阵范数建立了一个临界阈值。在此阈值之上，假设来自细粒度复杂性理论的强指数时间假设 ($\\mathsf{SETH}$)，则 $\\mathsf{VAR}$ 模型的次四次时间算法是不可能的。为了证实我们的理论发现，我们提出了利用低秩近似的高效构造，这些近似与派生标准相一致。这项工作从理论角度开始研究 $\\mathsf{VAR}$ 模型的计算效率。我们的技术将阐明在 $\\mathsf{VAR}$ 框架中推进可扩展且高效的图像生成。", "author": "Yekun Ke et.al.", "authors": "Yekun Ke, Xiaoyu Li, Yingyu Liang, Zhizhou Sha, Zhenmei Shi, Zhao Song", "id": "2501.04377v1", "paper_url": "http://arxiv.org/abs/2501.04377v1", "repo": "null"}}