{"2501.16329": {"publish_time": "2025-01-27", "title": "sDREAMER: Self-distilled Mixture-of-Modality-Experts Transformer for Automatic Sleep Staging", "paper_summary": "Automatic sleep staging based on electroencephalography (EEG) and\nelectromyography (EMG) signals is an important aspect of sleep-related\nresearch. Current sleep staging methods suffer from two major drawbacks. First,\nthere are limited information interactions between modalities in the existing\nmethods. Second, current methods do not develop unified models that can handle\ndifferent sources of input. To address these issues, we propose a novel sleep\nstage scoring model sDREAMER, which emphasizes cross-modality interaction and\nper-channel performance. Specifically, we develop a mixture-of-modality-expert\n(MoME) model with three pathways for EEG, EMG, and mixed signals with partially\nshared weights. We further propose a self-distillation training scheme for\nfurther information interaction across modalities. Our model is trained with\nmulti-channel inputs and can make classifications on either single-channel or\nmulti-channel inputs. Experiments demonstrate that our model outperforms the\nexisting transformer-based sleep scoring methods for multi-channel inference.\nFor single-channel inference, our model also outperforms the transformer-based\nmodels trained with single-channel signals.", "paper_summary_zh": "基於腦電圖 (EEG) 和肌電圖 (EMG) 信號的自動睡眠分期是與睡眠相關研究中的重要面向。目前的睡眠分期方法有兩個主要的缺點。首先，現有方法中模態之間的資訊互動有限。其次，目前的方法沒有開發能夠處理不同輸入來源的統一模型。為了解決這些問題，我們提出了一種新的睡眠分期評分模型 sDREAMER，它強調跨模態互動和每個通道的效能。具體來說，我們開發了一個混合模態專家 (MoME) 模型，其中包含 EEG、EMG 和混合信號的三個路徑，部分權重共享。我們進一步提出了一個自蒸餾訓練方案，以進一步促進跨模態的資訊互動。我們的模型使用多通道輸入進行訓練，並且可以在單通道或多通道輸入上進行分類。實驗表明，我們的模型在多通道推論方面優於現有的基於Transformer的睡眠評分方法。對於單通道推論，我們的模型也優於使用單通道信號訓練的基於Transformer的模型。", "author": "Jingyuan Chen et.al.", "authors": "Jingyuan Chen, Yuan Yao, Mie Anderson, Natalie Hauglund, Celia Kjaerby, Verena Untiet, Maiken Nedergaard, Jiebo Luo", "id": "2501.16329v1", "paper_url": "http://arxiv.org/abs/2501.16329v1", "repo": "null"}}