{"2501.05605": {"publish_time": "2025-01-09", "title": "Advancing Personalized Learning Analysis via an Innovative Domain Knowledge Informed Attention-based Knowledge Tracing Method", "paper_summary": "Emerging Knowledge Tracing (KT) models, particularly deep learning and\nattention-based Knowledge Tracing, have shown great potential in realizing\npersonalized learning analysis via prediction of students' future performance\nbased on their past interactions. The existing methods mainly focus on\nimmediate past interactions or individual concepts without accounting for\ndependencies between knowledge concept, referred as knowledge concept routes,\nthat can be critical to advance the understanding the students' learning\noutcomes. To address this, in this paper, we propose an innovative\nattention-based method by effectively incorporating the domain knowledge of\nknowledge concept routes in the given curriculum. Additionally, we leverage\nXES3G5M dataset, a benchmark dataset with rich auxiliary information for\nknowledge concept routes, to evaluate and compare the performance of our\nproposed method to the seven State-of-the-art (SOTA) deep learning models.", "paper_summary_zh": "新興知識追蹤 (KT) 模型，特別是深度學習和基於注意力的知識追蹤，在透過預測學生的未來表現，根據他們的過去互動，實現個人化學習分析方面，已展現出巨大的潛力。現有方法主要關注於最近的過去互動或個別概念，而不考慮知識概念之間的依賴性，稱為知識概念路線，這對於進一步了解學生的學習成果至關重要。為了解決這個問題，在本文中，我們提出了一種創新的基於注意力的方法，通過有效地將給定課程中的知識概念路線的領域知識整合進來。此外，我們利用 XES3G5M 資料集，一個具有豐富輔助資訊的知識概念路線基準資料集，來評估和比較我們提出的方法與七種最先進 (SOTA) 深度學習模型的效能。", "author": "Shubham Kose et.al.", "authors": "Shubham Kose, Jin Wei-Kocsis", "id": "2501.05605v1", "paper_url": "http://arxiv.org/abs/2501.05605v1", "repo": "null"}}