{"2409.16045": {"publish_time": "2024-09-24", "title": "LTNtorch: PyTorch Implementation of Logic Tensor Networks", "paper_summary": "Logic Tensor Networks (LTN) is a Neuro-Symbolic framework that effectively\nincorporates deep learning and logical reasoning. In particular, LTN allows\ndefining a logical knowledge base and using it as the objective of a neural\nmodel. This makes learning by logical reasoning possible as the parameters of\nthe model are optimized by minimizing a loss function composed of a set of\nlogical formulas expressing facts about the learning task. The framework learns\nvia gradient-descent optimization. Fuzzy logic, a relaxation of classical logic\npermitting continuous truth values in the interval [0,1], makes this learning\npossible. Specifically, the training of an LTN consists of three steps.\nFirstly, (1) the training data is used to ground the formulas. Then, (2) the\nformulas are evaluated, and the loss function is computed. Lastly, (3) the\ngradients are back-propagated through the logical computational graph, and the\nweights of the neural model are changed so the knowledge base is maximally\nsatisfied. LTNtorch is the fully documented and tested PyTorch implementation\nof Logic Tensor Networks. This paper presents the formalization of LTN and how\nLTNtorch implements it. Moreover, it provides a basic binary classification\nexample.", "paper_summary_zh": "邏輯張量網路 (LTN) 是一個神經符號框架，有效地整合了深度學習和邏輯推理。特別是，LTN 允許定義邏輯知識庫，並將其用作神經模型的目標。這使得通過邏輯推理進行學習成為可能，因為模型的參數是通過最小化由一組表達學習任務事實的邏輯公式組成的損失函數來優化的。該框架通過梯度下降優化進行學習。模糊邏輯是經典邏輯的放寬，允許在 [0,1] 區間內連續真值，這使得這種學習成為可能。具體來說，LTN 的訓練包含三個步驟。首先，(1) 訓練數據用於建立公式。然後，(2) 評估公式，並計算損失函數。最後，(3) 梯度通過邏輯計算圖反向傳播，並且神經模型的權重被改變，因此知識庫得到最大滿足。LTNtorch 是 Logic Tensor Networks 經過充分文件化和測試的 PyTorch 實作。本文介紹了 LTN 的形式化，以及 LTNtorch 如何實作它。此外，它還提供了一個基本的二元分類範例。", "author": "Tommaso Carraro et.al.", "authors": "Tommaso Carraro, Luciano Serafini, Fabio Aiolli", "id": "2409.16045v1", "paper_url": "http://arxiv.org/abs/2409.16045v1", "repo": "https://github.com/tommasocarraro/ltntorch"}}