{"2406.02331": {"publish_time": "2024-06-04", "title": "Translation Deserves Better: Analyzing Translation Artifacts in Cross-lingual Visual Question Answering", "paper_summary": "Building a reliable visual question answering~(VQA) system across different\nlanguages is a challenging problem, primarily due to the lack of abundant\nsamples for training. To address this challenge, recent studies have employed\nmachine translation systems for the cross-lingual VQA task. This involves\ntranslating the evaluation samples into a source language (usually English) and\nusing monolingual models (i.e., translate-test). However, our analysis reveals\nthat translated texts contain unique characteristics distinct from\nhuman-written ones, referred to as translation artifacts. We find that these\nartifacts can significantly affect the models, confirmed by extensive\nexperiments across diverse models, languages, and translation processes. In\nlight of this, we present a simple data augmentation strategy that can\nalleviate the adverse impacts of translation artifacts.", "paper_summary_zh": "建立一個可靠的視覺問題解答 (VQA) 系統跨不同語言是一個具有挑戰性的問題，主要是由於缺乏大量的訓練範例。為了應對這個挑戰，最近的研究採用了機器翻譯系統進行跨語言 VQA 任務。這涉及將評估範例翻譯成原始語言（通常是英語）並使用單語模型（即翻譯測試）。然而，我們的分析表明，翻譯後的文本包含不同於人類寫作的獨特特徵，稱為翻譯人工製品。我們發現這些人工製品會對模型產生重大影響，這已通過各種模型、語言和翻譯過程的廣泛實驗得到證實。有鑑於此，我們提出了一個簡單的數據擴充策略，可以減輕翻譯人工製品的不利影響。", "author": "ChaeHun Park et.al.", "authors": "ChaeHun Park, Koanho Lee, Hyesu Lim, Jaeseok Kim, Junmo Park, Yu-Jung Heo, Du-Seong Chang, Jaegul Choo", "id": "2406.02331v1", "paper_url": "http://arxiv.org/abs/2406.02331v1", "repo": "null"}}