{"2502.10266": {"publish_time": "2025-02-14", "title": "Are Large Language Models the future crowd workers of Linguistics?", "paper_summary": "Data elicitation from human participants is one of the core data collection\nstrategies used in empirical linguistic research. The amount of participants in\nsuch studies may vary considerably, ranging from a handful to crowdsourcing\ndimensions. Even if they provide resourceful extensive data, both of these\nsettings come alongside many disadvantages, such as low control of\nparticipants' attention during task completion, precarious working conditions\nin crowdsourcing environments, and time-consuming experimental designs. For\nthese reasons, this research aims to answer the question of whether Large\nLanguage Models (LLMs) may overcome those obstacles if included in empirical\nlinguistic pipelines. Two reproduction case studies are conducted to gain\nclarity into this matter: Cruz (2023) and Lombard et al. (2021). The two forced\nelicitation tasks, originally designed for human participants, are reproduced\nin the proposed framework with the help of OpenAI's GPT-4o-mini model. Its\nperformance with our zero-shot prompting baseline shows the effectiveness and\nhigh versatility of LLMs, that tend to outperform human informants in\nlinguistic tasks. The findings of the second replication further highlight the\nneed to explore additional prompting techniques, such as Chain-of-Thought (CoT)\nprompting, which, in a second follow-up experiment, demonstrates higher\nalignment to human performance on both critical and filler items. Given the\nlimited scale of this study, it is worthwhile to further explore the\nperformance of LLMs in empirical Linguistics and in other future applications\nin the humanities.", "paper_summary_zh": "<paragraph>從人類參與者引出資料是實證語言研究中使用的核心資料收集策略之一。此類研究的參與者數量可能差異很大，從少數人到群眾外包的規模都有。即使他們提供了豐富且廣泛的資料，這兩種設定都伴隨著許多缺點，例如在完成任務期間對參與者注意力控制不佳、群眾外包環境中的工作條件不穩定，以及耗時的實驗設計。基於這些原因，本研究旨在回答一個問題，即如果將大型語言模型 (LLM) 納入實證語言管道，它們是否可以克服這些障礙。進行了兩個複製案例研究以釐清此事：Cruz (2023) 和 Lombard 等人 (2021)。最初為人類參與者設計的兩個強制引出任務，在建議的架構中使用 OpenAI 的 GPT-4o-mini 模型複製。它與我們的零次提示基準的效能展現了 LLM 的有效性和高度通用性，這往往在語言任務中優於人類線人。第二次複製的結果進一步強調了探索其他提示技術的必要性，例如思考鏈 (CoT) 提示，在第二次追蹤實驗中，它證明在關鍵項目和填空項目上與人類表現的一致性更高。鑑於本研究的規模有限，進一步探討 LLM 在實證語言學中的表現以及在人文學科中其他未來的應用是值得的。</paragraph>", "author": "Iris Ferrazzo et.al.", "authors": "Iris Ferrazzo", "id": "2502.10266v1", "paper_url": "http://arxiv.org/abs/2502.10266v1", "repo": "null"}}