{"2411.14768": {"publish_time": "2024-11-22", "title": "Grid and Road Expressions Are Complementary for Trajectory Representation Learning", "paper_summary": "Trajectory representation learning (TRL) maps trajectories to vectors that\ncan be used for many downstream tasks. Existing TRL methods use either grid\ntrajectories, capturing movement in free space, or road trajectories, capturing\nmovement in a road network, as input. We observe that the two types of\ntrajectories are complementary, providing either region and location\ninformation or providing road structure and movement regularity. Therefore, we\npropose a novel multimodal TRL method, dubbed GREEN, to jointly utilize Grid\nand Road trajectory Expressions for Effective representatioN learning. In\nparticular, we transform raw GPS trajectories into both grid and road\ntrajectories and tailor two encoders to capture their respective information.\nTo align the two encoders such that they complement each other, we adopt a\ncontrastive loss to encourage them to produce similar embeddings for the same\nraw trajectory and design a mask language model (MLM) loss to use grid\ntrajectories to help reconstruct masked road trajectories. To learn the final\ntrajectory representation, a dual-modal interactor is used to fuse the outputs\nof the two encoders via cross-attention. We compare GREEN with 7\nstate-of-the-art TRL methods for 3 downstream tasks, finding that GREEN\nconsistently outperforms all baselines and improves the accuracy of the\nbest-performing baseline by an average of 15.99\\%.", "paper_summary_zh": "軌跡表徵學習 (TRL) 將軌跡對應到向量，可供許多下游任務使用。現有的 TRL 方法使用網格軌跡（捕捉自由空間中的移動）或道路軌跡（捕捉道路網路中的移動）作為輸入。我們觀察到這兩種軌跡類型互補，提供區域和位置資訊或提供道路結構和移動規律。因此，我們提出了一種新穎的多模態 TRL 方法，稱為 GREEN，以聯合利用網格和道路軌跡表達式進行有效表徵學習。具體來說，我們將原始 GPS 軌跡轉換為網格和道路軌跡，並調整兩個編碼器以捕捉它們各自的資訊。為了對齊兩個編碼器以使其互相補充，我們採用對比損失來鼓勵它們為相同的原始軌跡產生類似的嵌入，並設計一個遮罩語言模型 (MLM) 損失來使用網格軌跡幫助重建遮罩道路軌跡。為了學習最終軌跡表徵，使用雙模態交互器透過交叉注意融合兩個編碼器的輸出。我們將 GREEN 與 7 種最先進的 TRL 方法進行比較，用於 3 個下游任務，發現 GREEN 一致地優於所有基準，並將效能最佳的基準的準確度平均提高了 15.99%。", "author": "Silin Zhou et.al.", "authors": "Silin Zhou, Shuo Shang, Lisi Chen, Peng Han, Christian S. Jensen", "id": "2411.14768v1", "paper_url": "http://arxiv.org/abs/2411.14768v1", "repo": "null"}}