{"2407.12331": {"publish_time": "2024-07-17", "title": "I2AM: Interpreting Image-to-Image Latent Diffusion Models via Attribution Maps", "paper_summary": "Large-scale diffusion models have made significant advancements in the field\nof image generation, especially through the use of cross-attention mechanisms\nthat guide image formation based on textual descriptions. While the analysis of\ntext-guided cross-attention in diffusion models has been extensively studied in\nrecent years, its application in image-to-image diffusion models remains\nunderexplored. This paper introduces the Image-to-Image Attribution Maps I2AM\nmethod, which aggregates patch-level cross-attention scores to enhance the\ninterpretability of latent diffusion models across time steps, heads, and\nattention layers. I2AM facilitates detailed image-to-image attribution\nanalysis, enabling observation of how diffusion models prioritize key features\nover time and head during the image generation process from reference images.\nThrough extensive experiments, we first visualize the attribution maps of both\ngenerated and reference images, verifying that critical information from the\nreference image is effectively incorporated into the generated image, and vice\nversa. To further assess our understanding, we introduce a new evaluation\nmetric tailored for reference-based image inpainting tasks. This metric,\nmeasuring the consistency between the attribution maps of generated and\nreference images, shows a strong correlation with established performance\nmetrics for inpainting tasks, validating the potential use of I2AM in future\nresearch endeavors.", "paper_summary_zh": "<paragraph>大型擴散模型在影像生成領域取得重大進展，特別是透過使用交叉注意力機制，根據文本描述來引導影像生成。雖然近年來對於擴散模型中文字引導的交叉注意力分析已廣泛研究，但其在影像到影像擴散模型中的應用仍未被充分探討。本文介紹了影像到影像歸因圖 I2AM 方法，它彙總了區塊層級的交叉注意力分數，以增強潛在擴散模型在時間步長、注意力層和頭部的可解釋性。I2AM 便於進行詳細的影像到影像歸因分析，能夠觀察擴散模型如何在影像生成過程中，隨著時間和頭部的推移優先處理關鍵特徵。透過廣泛的實驗，我們首先視覺化了生成影像和參考影像的歸因圖，驗證了參考影像中的關鍵資訊已有效地整合到生成的影像中，反之亦然。為了進一步評估我們的理解，我們引入了一個新的評估指標，專門針對基於參考的影像修復任務。此指標測量生成的影像和參考影像的歸因圖之間的一致性，顯示與修復任務的既定效能指標有很強的相關性，驗證了 I2AM 在未來研究工作中的潛在用途。</paragraph>", "author": "Junseo Park et.al.", "authors": "Junseo Park, Hyeryung Jang", "id": "2407.12331v1", "paper_url": "http://arxiv.org/abs/2407.12331v1", "repo": "null"}}