{"2405.14507": {"publish_time": "2024-05-23", "title": "Unchosen Experts Can Contribute Too: Unleashing MoE Models' Power by Self-Contrast", "paper_summary": "Mixture-of-Experts (MoE) has emerged as a prominent architecture for scaling\nmodel size while maintaining computational efficiency. In MoE, each token in\nthe input sequence activates a different subset of experts determined by a\nrouting mechanism. However, the unchosen experts in MoE models do not\ncontribute to the output, potentially leading to underutilization of the\nmodel's capacity. In this work, we first conduct exploratory studies to\ndemonstrate that increasing the number of activated experts does not\nnecessarily improve and can even degrade the output quality. Then, we show that\noutput distributions from an MoE model using different routing strategies\nsubstantially differ, indicating that different experts do not always act\nsynergistically. Motivated by these findings, we propose Self-Contrast\nMixture-of-Experts (SCMoE), a training-free strategy that utilizes unchosen\nexperts in a self-contrast manner during inference. In SCMoE, the next-token\nprobabilities are determined by contrasting the outputs from strong and weak\nactivation using the same MoE model. Our method is conceptually simple and\ncomputationally lightweight, as it incurs minimal latency compared to greedy\ndecoding. Experiments on several benchmarks (GSM8K, StrategyQA, MBPP and\nHumanEval) demonstrate that SCMoE can consistently enhance Mixtral 8x7B's\nreasoning capability across various domains. For example, it improves the\naccuracy on GSM8K from 61.79 to 66.94. Moreover, combining SCMoE with\nself-consistency yields additional gains, increasing major@20 accuracy from\n75.59 to 78.31.", "paper_summary_zh": "混合專家 (MoE) 已成為一種重要的架構，用於擴展模型大小，同時保持運算效率。在 MoE 中，輸入序列中的每個符號會啟動由路由機制決定的不同專家子集。然而，MoE 模型中未選擇的專家不會對輸出做出貢獻，這可能會導致模型容量利用不足。在這項工作中，我們首先進行探索性研究，以證明增加已啟動專家的數量不一定會改善，甚至可能降低輸出品質。然後，我們證明使用不同路由策略的 MoE 模型的輸出分佈有很大不同，這表明不同的專家並不總是協同作用。受到這些發現的啟發，我們提出了自對比混合專家 (SCMoE)，這是一種無需訓練的策略，它在推理過程中以自對比的方式利用未選擇的專家。在 SCMoE 中，下一個符號的機率是由使用相同 MoE 模型對比強弱激活的輸出決定的。我們的程式在概念上很簡單，且運算量很輕，因為與貪婪解碼相比，它產生的延遲最少。在幾個基準測試（GSM8K、StrategyQA、MBPP 和 HumanEval）上的實驗表明，SCMoE 可以持續增強 Mixtral 8x7B 在各種領域的推理能力。例如，它將 GSM8K 的準確度從 61.79 提高到 66.94。此外，將 SCMoE 與自一致性結合使用會產生額外的收益，將 major@20 準確度從 75.59 提高到 78.31。", "author": "Chufan Shi et.al.", "authors": "Chufan Shi, Cheng Yang, Xinyu Zhu, Jiahao Wang, Taiqiang Wu, Siheng Li, Deng Cai, Yujiu Yang, Yu Meng", "id": "2405.14507v1", "paper_url": "http://arxiv.org/abs/2405.14507v1", "repo": "null"}}