{"2412.08263": {"publish_time": "2024-12-11", "title": "Discrete Subgraph Sampling for Interpretable Graph based Visual Question Answering", "paper_summary": "Explainable artificial intelligence (XAI) aims to make machine learning\nmodels more transparent. While many approaches focus on generating explanations\npost-hoc, interpretable approaches, which generate the explanations\nintrinsically alongside the predictions, are relatively rare. In this work, we\nintegrate different discrete subset sampling methods into a graph-based visual\nquestion answering system to compare their effectiveness in generating\ninterpretable explanatory subgraphs intrinsically. We evaluate the methods on\nthe GQA dataset and show that the integrated methods effectively mitigate the\nperformance trade-off between interpretability and answer accuracy, while also\nachieving strong co-occurrences between answer and question tokens.\nFurthermore, we conduct a human evaluation to assess the interpretability of\nthe generated subgraphs using a comparative setting with the extended\nBradley-Terry model, showing that the answer and question token co-occurrence\nmetrics strongly correlate with human preferences. Our source code is publicly\navailable.", "paper_summary_zh": "可解釋人工智慧 (XAI) 旨在使機器學習模型更透明。儘管許多方法專注於事後產生解釋，但可解釋的方法（在預測的同時內建產生解釋）相對較少見。在此工作中，我們將不同的離散子集抽樣方法整合到基於圖形的視覺問答系統中，以比較它們在內建產生可解釋的解釋性子圖方面的有效性。我們在 GQA 資料集上評估這些方法，並表明整合的方法有效減輕了可解釋性與答案準確性之間的效能取捨，同時也實現了答案和問題標記之間的強共現。此外，我們進行人類評估以評估所產生子圖的可解釋性，並使用擴展的 Bradley-Terry 模型進行比較設定，結果表明答案和問題標記共現指標與人類偏好密切相關。我們的原始碼已公開。", "author": "Pascal Tilli et.al.", "authors": "Pascal Tilli, Ngoc Thang Vu", "id": "2412.08263v1", "paper_url": "http://arxiv.org/abs/2412.08263v1", "repo": "null"}}