{"2501.13967": {"publish_time": "2025-01-22", "title": "FedDAG: Federated Domain Adversarial Generation Towards Generalizable Medical Image Analysis", "paper_summary": "Federated domain generalization aims to train a global model from multiple\nsource domains and ensure its generalization ability to unseen target domains.\n{Due to the target domain being with unknown domain shifts, attempting to\napproximate these gaps by source domains may be the key to improving model\ngeneralization capability.} Existing works mainly focus on sharing and\nrecombining local domain-specific attributes to increase data diversity and\nsimulate potential domain shifts. {However, these methods may be insufficient\nsince only the local attribute recombination can be hard to touch the\nout-of-distribution of global data.} In this paper, we propose a\nsimple-yet-efficient framework named Federated Domain Adversarial Generation\n(FedDAG). {It aims to simulate the domain shift and improve the model\ngeneralization by adversarially generating novel domains different from local\nand global source domains.} Specifically, it generates novel-style images by\nmaximizing the instance-level feature discrepancy between original and\ngenerated images and trains a generalizable task model by minimizing their\nfeature discrepancy. {Further, we observed that FedDAG could cause different\nperformance improvements for local models. It may be due to inherent data\nisolation and heterogeneity among clients, exacerbating the imbalance in their\ngeneralization contributions to the global model.} {Ignoring this imbalance can\nlead the global model's generalization ability to be sub-optimal, further\nlimiting the novel domain generation procedure. } Thus, to mitigate this\nimbalance, FedDAG hierarchically aggregates local models at the within-client\nand across-client levels by using the sharpness concept to evaluate client\nmodel generalization contributions. {Extensive experiments across four medical\nbenchmarks demonstrate FedDAG's ability to enhance generalization in federated\nmedical scenarios.}", "paper_summary_zh": "<paragraph>聯邦領域泛化旨在從多個來源領域訓練一個全局模型，並確保其對未見目標領域的泛化能力。\n{由於目標領域存在未知的領域轉移，嘗試通過來源領域來近似這些差距可能是提高模型泛化能力的關鍵。} 現有工作主要集中在共享和重新組合局部領域特定屬性，以增加數據多樣性和模擬潛在的領域轉移。 {然而，這些方法可能不足，因為只有局部屬性重組難以觸及全局數據的分布外。} 在本文中，我們提出了一個簡單而高效的框架，名為聯邦領域對抗生成（FedDAG）。 {它旨在模擬領域轉移，並通過對抗生成不同於局部和全局來源領域的新穎領域來提高模型泛化。} 具體來說，它通過最大化原始圖像和生成圖像之間的實例級別特徵差異來生成新樣式的圖像，並通過最小化它們的特徵差異來訓練一個可泛化的任務模型。 {此外，我們觀察到 FedDAG 可以對局部模型造成不同的性能提升。這可能是由於客戶端之間固有的數據隔離和異質性，加劇了它們對全局模型泛化貢獻的不平衡。} {忽略這種不平衡會導致全局模型的泛化能力次優，進一步限制新穎領域生成過程。} 因此，為了減輕這種不平衡，FedDAG 使用清晰度概念來評估客戶端模型泛化貢獻，在客戶端內和客戶端之間分層聚合局部模型。 {在四個醫療基準上的廣泛實驗證明了 FedDAG 增強聯邦醫療場景中泛化的能力。}</paragraph>", "author": "Haoxuan Che et.al.", "authors": "Haoxuan Che, Yifei Wu, Haibo Jin, Yong Xia, Hao Chen", "id": "2501.13967v1", "paper_url": "http://arxiv.org/abs/2501.13967v1", "repo": "null"}}