{"2411.13537": {"publish_time": "2024-11-20", "title": "Metacognition for Unknown Situations and Environments (MUSE)", "paper_summary": "Metacognition--the awareness and regulation of one's cognitive processes--is\ncentral to human adaptability in unknown situations. In contrast, current\nautonomous agents often struggle in novel environments due to their limited\ncapacity for adaptation. We hypothesize that metacognition is a critical\nmissing ingredient in adaptive autonomous systems, equipping them with the\ncognitive flexibility needed to tackle unfamiliar challenges. Given the broad\nscope of metacognitive abilities, we focus on two key aspects: competence\nawareness and strategy selection for novel tasks. To this end, we propose the\nMetacognition for Unknown Situations and Environments (MUSE) framework, which\nintegrates metacognitive processes--specifically self-awareness and\nself-regulation--into autonomous agents. We present two initial implementations\nof MUSE: one based on world modeling and another leveraging large language\nmodels (LLMs), both instantiating the metacognitive cycle. Our system\ncontinuously learns to assess its competence on a given task and uses this\nself-awareness to guide iterative cycles of strategy selection. MUSE agents\nshow significant improvements in self-awareness and self-regulation, enabling\nthem to solve novel, out-of-distribution tasks more effectively compared to\nDreamer-v3-based reinforcement learning and purely prompt-based LLM agent\napproaches. This work highlights the promise of approaches inspired by\ncognitive and neural systems in enabling autonomous systems to adapt to new\nenvironments, overcoming the limitations of current methods that rely heavily\non extensive training data.", "paper_summary_zh": "元認知——對自身認知過程的覺察與調節——是人類在未知情境中適應能力的中心。相比之下，當前的自主代理經常在新的環境中掙扎，因為它們的適應能力有限。我們假設元認知是適應性自主系統中一個重要的遺失成分，它為它們提供了應對不熟悉挑戰所需的認知靈活性。鑑於元認知能力的廣泛範圍，我們專注於兩個關鍵方面：能力意識和新任務的策略選擇。為此，我們提出了未知情境和環境的元認知 (MUSE) 框架，它將元認知過程——特別是自我意識和自我調節——整合到自主代理中。我們提出了 MUSE 的兩個初始實現：一個基於世界建模，另一個利用大型語言模型 (LLM)，兩者都實例化了元認知迴圈。我們的系統持續學習評估其在給定任務上的能力，並利用這種自我意識來指導策略選擇的迭代迴圈。與基於 Dreamer-v3 的強化學習和純粹基於提示的 LLM 代理方法相比，MUSE 代理在自我意識和自我調節方面表現出顯著的改進，使它們能夠更有效地解決新穎的、分布外的任務。這項工作突出了受認知和神經系統啟發的方法在使自主系統適應新環境方面的前景，克服了當前方法的局限性，而當前方法過於依賴於大量的訓練資料。", "author": "Rodolfo Valiente et.al.", "authors": "Rodolfo Valiente, Praveen K. Pilly", "id": "2411.13537v1", "paper_url": "http://arxiv.org/abs/2411.13537v1", "repo": "null"}}