{"2405.07765": {"publish_time": "2024-05-13", "title": "TANQ: An open domain dataset of table answered questions", "paper_summary": "Language models, potentially augmented with tool usage such as retrieval are\nbecoming the go-to means of answering questions. Understanding and answering\nquestions in real-world settings often requires retrieving information from\ndifferent sources, processing and aggregating data to extract insights, and\npresenting complex findings in form of structured artifacts such as novel\ntables, charts, or infographics. In this paper, we introduce TANQ, the first\nopen domain question answering dataset where the answers require building\ntables from information across multiple sources. We release the full source\nattribution for every cell in the resulting table and benchmark\nstate-of-the-art language models in open, oracle, and closed book setups. Our\nbest-performing baseline, GPT4 reaches an overall F1 score of 29.1, lagging\nbehind human performance by 19.7 points. We analyse baselines' performance\nacross different dataset attributes such as different skills required for this\ntask, including multi-hop reasoning, math operations, and unit conversions. We\nfurther discuss common failures in model-generated answers, suggesting that\nTANQ is a complex task with many challenges ahead.", "paper_summary_zh": "語言模型，潛在的增強工具使用，例如檢索，正成為回答問題的途徑。在現實世界中理解和回答問題通常需要從不同來源檢索資訊、處理和彙整資料以萃取見解，並以結構化人工製品的形式呈現複雜的發現，例如新穎的表格、圖表或資訊圖表。在本文中，我們介紹 TANQ，這是第一個開放領域問題解答資料集，其中答案需要從多個來源的資訊建立表格。我們釋出結果表格中每個儲存格的完整來源歸屬，並在開放、神諭和閉卷設定中對最先進的語言模型進行基準測試。我們效能最好的基準，GPT4 達到 29.1 的 F1 總分，落後人類表現 19.7 分。我們分析基準在不同資料集屬性中的表現，例如此任務所需的各種技能，包括多重跳躍推理、數學運算和單位換算。我們進一步討論模型生成的答案中常見的失敗，表明 TANQ 是一個複雜的任務，未來還有許多挑戰。", "author": "Mubashara Akhtar et.al.", "authors": "Mubashara Akhtar, Chenxi Pang, Andreea Marzoca, Yasemin Altun, Julian Martin Eisenschlos", "id": "2405.07765v1", "paper_url": "http://arxiv.org/abs/2405.07765v1", "repo": "null"}}