{"2405.14597": {"publish_time": "2024-05-23", "title": "Integer Scale: A Free Lunch for Faster Fine-grained Quantization of LLMs", "paper_summary": "We introduce Integer Scale, a novel post-training quantization scheme for\nlarge language models that effectively resolves the inference bottleneck in\ncurrent fine-grained quantization approaches while maintaining similar\naccuracies. Integer Scale is a free lunch as it requires no extra calibration\nor fine-tuning which will otherwise incur additional costs. It can be used\nplug-and-play for most fine-grained quantization methods. Its integration\nresults in at most 1.85x end-to-end speed boost over the original counterpart\nwith comparable accuracy. Additionally, due to the orchestration of the\nproposed Integer Scale and fine-grained quantization, we resolved the\nquantization difficulty for Mixtral-8x7B and LLaMA-3 models with negligible\nperformance degradation, and it comes with an end-to-end speed boost of 2.13x,\nand 2.31x compared with their FP16 versions respectively.", "paper_summary_zh": "我們引入了整數量化，這是一種大型語言模型的創新訓練後量化方案，可有效解決當前細粒度量化方法中的推理瓶頸，同時保持類似的準確度。整數量化是一種免費的午餐，因為它不需要額外的校準或微調，否則會產生額外的成本。它可以用於大多數細粒度量化方法的即插即用。它的整合導致端到端速度提升至多 1.85 倍，與原始對應項相比，具有可比的準確度。此外，由於所提出的整數量化和細粒度量化的協調，我們以可忽略的性能下降解決了 Mixtral-8x7B 和 LLaMA-3 模型的量化難度，並且與它們的 FP16 版本相比，分別具有 2.13 倍和 2.31 倍的端到端速度提升。", "author": "Qingyuan Li et.al.", "authors": "Qingyuan Li, Ran Meng, Yiduo Li, Bo Zhang, Yifan Lu, Yerui Sun, Lin Ma, Yuchen Xie", "id": "2405.14597v1", "paper_url": "http://arxiv.org/abs/2405.14597v1", "repo": "null"}}