{"2501.18055": {"publish_time": "2025-01-29", "title": "Current Pathology Foundation Models are unrobust to Medical Center Differences", "paper_summary": "Pathology Foundation Models (FMs) hold great promise for healthcare. Before\nthey can be used in clinical practice, it is essential to ensure they are\nrobust to variations between medical centers. We measure whether pathology FMs\nfocus on biological features like tissue and cancer type, or on the well known\nconfounding medical center signatures introduced by staining procedure and\nother differences. We introduce the Robustness Index. This novel robustness\nmetric reflects to what degree biological features dominate confounding\nfeatures. Ten current publicly available pathology FMs are evaluated. We find\nthat all current pathology foundation models evaluated represent the medical\ncenter to a strong degree. Significant differences in the robustness index are\nobserved. Only one model so far has a robustness index greater than one,\nmeaning biological features dominate confounding features, but only slightly. A\nquantitative approach to measure the influence of medical center differences on\nFM-based prediction performance is described. We analyze the impact of\nunrobustness on classification performance of downstream models, and find that\ncancer-type classification errors are not random, but specifically attributable\nto same-center confounders: images of other classes from the same medical\ncenter. We visualize FM embedding spaces, and find these are more strongly\norganized by medical centers than by biological factors. As a consequence, the\nmedical center of origin is predicted more accurately than the tissue source\nand cancer type. The robustness index introduced here is provided with the aim\nof advancing progress towards clinical adoption of robust and reliable\npathology FMs.", "paper_summary_zh": "病理基礎模型 (FM) 對醫療保健而言極具潛力。在臨床實務中使用之前，必須確保它們能應對醫療中心之間的差異。我們衡量病理 FM 是否著重於組織和癌症類型等生物特徵，或著重於染色程序和其他差異所導致的眾所周知混淆醫療中心特徵。我們引進了穩健性指標。這項新穎的穩健性指標反映了生物特徵主導混淆特徵的程度。評估了十項目前公開提供的病理 FM。我們發現，所有目前評估的病理基礎模型在很大程度上代表了醫療中心。觀察到穩健性指標有顯著差異。到目前為止，只有一項模型的穩健性指標大於一，表示生物特徵主導混淆特徵，但僅略微主導。描述了衡量醫療中心差異對基於 FM 的預測效能影響的量化方法。我們分析了不穩健性對下游模型分類效能的影響，發現癌症類型分類錯誤並非隨機，而是特別歸因於同中心混淆因子：來自同一醫療中心的其他類別影像。我們視覺化 FM 嵌入空間，發現這些空間是由醫療中心而非生物因素更強有力地組織。因此，比組織來源和癌症類型更準確地預測了醫療中心的來源。在此引入穩健性指標，目的是推進朝著臨床採用穩健且可靠的病理 FM 的進展。", "author": "Edwin D. de Jong et.al.", "authors": "Edwin D. de Jong, Eric Marcus, Jonas Teuwen", "id": "2501.18055v2", "paper_url": "http://arxiv.org/abs/2501.18055v2", "repo": "null"}}