{"2411.05085": {"publish_time": "2024-11-07", "title": "PadChest-GR: A Bilingual Chest X-ray Dataset for Grounded Radiology Report Generation", "paper_summary": "Radiology report generation (RRG) aims to create free-text radiology reports\nfrom clinical imaging. Grounded radiology report generation (GRRG) extends RRG\nby including the localisation of individual findings on the image. Currently,\nthere are no manually annotated chest X-ray (CXR) datasets to train GRRG\nmodels. In this work, we present a dataset called PadChest-GR\n(Grounded-Reporting) derived from PadChest aimed at training GRRG models for\nCXR images. We curate a public bi-lingual dataset of 4,555 CXR studies with\ngrounded reports (3,099 abnormal and 1,456 normal), each containing complete\nlists of sentences describing individual present (positive) and absent\n(negative) findings in English and Spanish. In total, PadChest-GR contains\n7,037 positive and 3,422 negative finding sentences. Every positive finding\nsentence is associated with up to two independent sets of bounding boxes\nlabelled by different readers and has categorical labels for finding type,\nlocations, and progression. To the best of our knowledge, PadChest-GR is the\nfirst manually curated dataset designed to train GRRG models for understanding\nand interpreting radiological images and generated text. By including detailed\nlocalization and comprehensive annotations of all clinically relevant findings,\nit provides a valuable resource for developing and evaluating GRRG models from\nCXR images. PadChest-GR can be downloaded under request from\nhttps://bimcv.cipf.es/bimcv-projects/padchest-gr/", "paper_summary_zh": "<paragraph>放射學報告生成 (RRG) 旨在從臨床影像建立自由文字的放射學報告。基礎放射學報告生成 (GRRG) 透過納入影像上個別發現的定位，來延伸 RRG。目前，沒有手動標記的胸部 X 光 (CXR) 資料集，可供訓練 GRRG 模型。在此研究中，我們提出一個名為 PadChest-GR（基礎報告）的資料集，其源自 PadChest，旨在訓練 CXR 影像的 GRRG 模型。我們策劃了一個公開的雙語資料集，其中包含 4,555 份 CXR 研究，附有基礎報告（3,099 份異常報告和 1,456 份正常報告），每個報告都包含完整的句子清單，用英文和西班牙文描述個別存在的（陽性）和不存在的（陰性）發現。總計，PadChest-GR 包含 7,037 個陽性發現句子和 3,422 個陰性發現句子。每個陽性發現句子最多與兩組獨立的邊界框相關聯，由不同的讀者標記，並具有發現類型、位置和進展的分類標籤。據我們所知，PadChest-GR 是第一個手動策劃的資料集，旨在訓練 GRRG 模型，以理解和詮釋放射學影像和產生的文字。透過納入所有臨床相關發現的詳細定位和綜合註解，它為從 CXR 影像開發和評估 GRRG 模型提供了寶貴的資源。PadChest-GR 可應要求從 https://bimcv.cipf.es/bimcv-projects/padchest-gr/ 下載</paragraph>", "author": "Daniel C. Castro et.al.", "authors": "Daniel C. Castro, Aurelia Bustos, Shruthi Bannur, Stephanie L. Hyland, Kenza Bouzid, Maria Teodora Wetscherek, Maria Dolores Sánchez-Valverde, Lara Jaques-Pérez, Lourdes Pérez-Rodríguez, Kenji Takeda, José María Salinas, Javier Alvarez-Valle, Joaquín Galant Herrero, Antonio Pertusa", "id": "2411.05085v1", "paper_url": "http://arxiv.org/abs/2411.05085v1", "repo": "null"}}