{"2410.10604": {"publish_time": "2024-10-14", "title": "BrainMVP: Multi-modal Vision Pre-training for Brain Image Analysis using Multi-parametric MRI", "paper_summary": "Accurate diagnosis of brain abnormalities is greatly enhanced by the\ninclusion of complementary multi-parametric MRI imaging data. There is\nsignificant potential to develop a universal pre-training model that can be\nquickly adapted for image modalities and various clinical scenarios. However,\ncurrent models often rely on uni-modal image data, neglecting the cross-modal\ncorrelations among different image modalities or struggling to scale up\npre-training in the presence of missing modality data. In this paper, we\npropose BrainMVP, a multi-modal vision pre-training framework for brain image\nanalysis using multi-parametric MRI scans. First, we collect 16,022 brain MRI\nscans (over 2.4 million images), encompassing eight MRI modalities sourced from\na diverse range of centers and devices. Then, a novel pre-training paradigm is\nproposed for the multi-modal MRI data, addressing the issue of missing\nmodalities and achieving multi-modal information fusion. Cross-modal\nreconstruction is explored to learn distinctive brain image embeddings and\nefficient modality fusion capabilities. A modality-wise data distillation\nmodule is proposed to extract the essence representation of each MR image\nmodality for both the pre-training and downstream application purposes.\nFurthermore, we introduce a modality-aware contrastive learning module to\nenhance the cross-modality association within a study. Extensive experiments on\ndownstream tasks demonstrate superior performance compared to state-of-the-art\npre-training methods in the medical domain, with Dice Score improvement of\n0.28%-14.47% across six segmentation benchmarks and a consistent accuracy\nimprovement of 0.65%-18.07% in four individual classification tasks.", "paper_summary_zh": "<paragraph>準確診斷腦部異常會透過加入互補的多參數 MRI 影像資料而大幅提升。開發一個通用預訓練模型具有相當大的潛力，而此模型可以快速調整以符合影像形式和各種臨床場景。然而，目前的模型通常仰賴單一形式的影像資料，忽略了不同影像形式之間的跨形式關聯性，或是難以在缺乏形式資料的情況下擴展預訓練。在本文中，我們提出 BrainMVP，一個用於腦部影像分析的多形式視覺預訓練架構，使用多參數 MRI 掃描。首先，我們收集了 16,022 個腦部 MRI 掃描（超過 240 萬張影像），涵蓋了八種 MRI 形式，這些形式來自於各種不同的中心和裝置。接著，針對多形式 MRI 資料提出了一個新穎的預訓練範例，解決了缺乏形式的問題，並達到了多形式資訊融合。探索了跨形式重建，以學習獨特的腦部影像嵌入和有效率的形式融合能力。提出了一個形式明智的資料萃取模組，用於萃取每個 MR 影像形式的本質表徵，以符合預訓練和下游應用目的。此外，我們引入了形式感知對比學習模組，以加強研究中的跨形式關聯性。針對下游任務進行的廣泛實驗證明了與醫療領域中現有最先進的預訓練方法相比，其具有優異的效能，在六個分割基準中骰子分數提升了 0.28%-14.47%，在四個個別分類任務中精確度一致提升了 0.65%-18.07%。</paragraph>", "author": "Shaohao Rui et.al.", "authors": "Shaohao Rui, Lingzhi Chen, Zhenyu Tang, Lilong Wang, Mianxin Liu, Shaoting Zhang, Xiaosong Wang", "id": "2410.10604v1", "paper_url": "http://arxiv.org/abs/2410.10604v1", "repo": "null"}}