{"2410.13592": {"publish_time": "2024-10-17", "title": "OAH-Net: A Deep Neural Network for Hologram Reconstruction of Off-axis Digital Holographic Microscope", "paper_summary": "Off-axis digital holographic microscopy is a high-throughput, label-free\nimaging technology that provides three-dimensional, high-resolution information\nabout samples, particularly useful in large-scale cellular imaging. However,\nthe hologram reconstruction process poses a significant bottleneck for timely\ndata analysis. To address this challenge, we propose a novel reconstruction\napproach that integrates deep learning with the physical principles of off-axis\nholography. We initialized part of the network weights based on the physical\nprinciple and then fine-tuned them via weakly supersized learning. Our off-axis\nhologram network (OAH-Net) retrieves phase and amplitude images with errors\nthat fall within the measurement error range attributable to hardware, and its\nreconstruction speed significantly surpasses the microscope's acquisition rate.\nCrucially, OAH-Net demonstrates remarkable external generalization capabilities\non unseen samples with distinct patterns and can be seamlessly integrated with\nother models for downstream tasks to achieve end-to-end real-time hologram\nanalysis. This capability further expands off-axis holography's applications in\nboth biological and medical studies.", "paper_summary_zh": "離軸數位全像顯微鏡是一種高通量、無標籤的影像技術，可提供立體、高解析度的樣品資訊，特別適用於大規模細胞影像。然而，全像重建過程對及時的資料分析構成重大的瓶頸。為了應對這項挑戰，我們提出了一種創新的重建方法，將深度學習與離軸全像的物理原理整合在一起。我們根據物理原理初始化部分網路權重，然後透過弱監督學習微調它們。我們的離軸全像網路 (OAH-Net) 擷取相位和振幅影像，其誤差落在歸因於硬體的量測誤差範圍內，而且其重建速度顯著超越顯微鏡的擷取率。至關重要的是，OAH-Net 在具有不同模式的未見樣本上展現出卓越的外在泛化能力，而且可以與其他模型無縫整合，以執行下游任務，以達成端對端的即時全像分析。此能力進一步擴展了離軸全像在生物和醫學研究中的應用。", "author": "Wei Liu et.al.", "authors": "Wei Liu, Kerem Delikoyun, Qianyu Chen, Alperen Yildiz, Si Ko Myo, Win Sen Kuan, John Tshon Yit Soong, Matthew Edward Cove, Oliver Hayden, Hweekuan Lee", "id": "2410.13592v1", "paper_url": "http://arxiv.org/abs/2410.13592v1", "repo": "null"}}