{"2501.03456": {"publish_time": "2025-01-07", "title": "Text to Band Gap: Pre-trained Language Models as Encoders for Semiconductor Band Gap Prediction", "paper_summary": "In this study, we explore the use of a transformer-based language model as an\nencoder to predict the band gaps of semiconductor materials directly from their\ntext descriptions. Quantum chemistry simulations, including Density Functional\nTheory (DFT), are computationally intensive and time-consuming, which limits\ntheir practicality for high-throughput material screening, particularly for\ncomplex systems. Shallow machine learning (ML) models, while effective, often\nrequire extensive data preprocessing to convert non-numerical material\nproperties into numerical inputs. In contrast, our approach leverages textual\ndata directly, bypassing the need for complex feature engineering. We generate\nmaterial descriptions in two formats: formatted strings combining features and\nnatural language text generated using the ChatGPT API. We demonstrate that the\nRoBERTa model, pre-trained on natural language processing tasks, performs\neffectively as an encoder for prediction tasks. With minimal fine-tuning, it\nachieves a mean absolute error (MAE) of approximately 0.33 eV, performing\nbetter than shallow machine learning models such as Support Vector Regression,\nRandom Forest, and XGBoost. Even when only the linear regression head is\ntrained while keeping the RoBERTa encoder layers frozen, the accuracy remains\nnearly identical to that of the fully trained model. This demonstrates that the\npre-trained RoBERTa encoder is highly adaptable for processing domain-specific\ntext related to material properties, such as the band gap, significantly\nreducing the need for extensive retraining. This study highlights the potential\nof transformer-based language models to serve as efficient and versatile\nencoders for semiconductor materials property prediction tasks.", "paper_summary_zh": "<paragraph>在本研究中，我們探討使用基於Transformer的語言模型作為編碼器，從半導體材料的文本描述中直接預測其能隙。量子化學模擬，包括密度泛函理論 (DFT)，計算量大且耗時，這限制了它們在高通量材料篩選中的實用性，特別是對於複雜系統。淺層機器學習 (ML) 模型雖然有效，但通常需要廣泛的資料預處理，才能將非數值的材料屬性轉換為數值輸入。相比之下，我們的做法直接利用文本資料，繞過了對複雜特徵工程的需求。我們使用兩種格式產生材料描述：結合特徵的格式化字串和使用 ChatGPT API 生成的自然語言文字。我們證明了在自然語言處理任務上經過預訓練的 RoBERTa 模型，作為預測任務的編碼器時表現得很有效。在經過最小的微調後，它達到了約 0.33 eV 的平均絕對誤差 (MAE)，效能優於支持向量回歸、隨機森林和 XGBoost 等淺層機器學習模型。即使在保持 RoBERTa 編碼器層凍結的同時只訓練線性回歸頭，其準確度仍然與完全訓練的模型幾乎相同。這表明預訓練的 RoBERTa 編碼器非常適合處理與材料屬性（如能隙）相關的特定領域文字，大大減少了廣泛重新訓練的需求。本研究強調了基於Transformer的語言模型作為半導體材料屬性預測任務的高效且通用的編碼器的潛力。</paragraph>", "author": "Ying-Ting Yeh et.al.", "authors": "Ying-Ting Yeh, Janghoon Ock, Amir Barati Farimani", "id": "2501.03456v1", "paper_url": "http://arxiv.org/abs/2501.03456v1", "repo": "null"}}