{"2408.07324": {"publish_time": "2024-08-14", "title": "On-the-fly Synthesis for LTL over Finite Traces: An Efficient Approach that Counts", "paper_summary": "We present an on-the-fly synthesis framework for Linear Temporal Logic over\nfinite traces (LTLf) based on top-down deterministic automata construction.\nExisting approaches rely on constructing a complete Deterministic Finite\nAutomaton (DFA) corresponding to the LTLf specification, a process with doubly\nexponential complexity relative to the formula size in the worst case. In this\ncase, the synthesis procedure cannot be conducted until the entire DFA is\nconstructed. This inefficiency is the main bottleneck of existing approaches.\nTo address this challenge, we first present a method for converting LTLf into\nTransition-based DFA (TDFA) by directly leveraging LTLf semantics,\nincorporating intermediate results as direct components of the final automaton\nto enable parallelized synthesis and automata construction. We then explore the\nrelationship between LTLf synthesis and TDFA games and subsequently develop an\nalgorithm for performing LTLf synthesis using on-the-fly TDFA game solving.\nThis algorithm traverses the state space in a global forward manner combined\nwith a local backward method, along with the detection of strongly connected\ncomponents. Moreover, we introduce two optimization techniques -- model-guided\nsynthesis and state entailment -- to enhance the practical efficiency of our\napproach. Experimental results demonstrate that our on-the-fly approach\nachieves the best performance on the tested benchmarks and effectively\ncomplements existing tools and approaches.", "paper_summary_zh": "<paragraph>我們提出一個基於自頂向下確定性自動機建構的線性時序邏輯在有限軌跡（LTLf）上的即時合成架構。現有方法依賴於建構一個對應於 LTLf 規範的完整確定性有限自動機（DFA），這個過程在最壞情況下相對於公式大小具有雙重指數複雜度。在這種情況下，合成程序在整個 DFA 建構完成之前無法執行。這種低效率是現有方法的主要瓶頸。為了應對這一挑戰，我們首先提出了一種將 LTLf 轉換為基於轉換的 DFA（TDFA）的方法，通過直接利用 LTLf 語義，將中間結果作為最終自動機的直接組成部分，以實現並行合成和自動機建構。然後，我們探討了 LTLf 合成與 TDFA 遊戲之間的關係，並隨後開發了一種使用即時 TDFA 遊戲求解來執行 LTLf 合成的演算法。此演算法以全局向前的方式與局部向後方法結合的方式遍歷狀態空間，同時檢測強連通組件。此外，我們引入了兩種優化技術——模型引導合成和狀態蘊涵——以增強我們方法的實用效率。實驗結果表明，我們的即時方法在測試基準上實現了最佳性能，並有效地補充了現有工具和方法。</paragraph>", "author": "Shengping Xiao et.al.", "authors": "Shengping Xiao, Yongkang Li, Shufang Zhu, Jun Sun, Jianwen Li, Geguang Pu, Moshe Y. Vardi", "id": "2408.07324v1", "paper_url": "http://arxiv.org/abs/2408.07324v1", "repo": "null"}}