{"2502.15278": {"publish_time": "2025-02-21", "title": "CopyJudge: Automated Copyright Infringement Identification and Mitigation in Text-to-Image Diffusion Models", "paper_summary": "Assessing whether AI-generated images are substantially similar to\ncopyrighted works is a crucial step in resolving copyright disputes. In this\npaper, we propose CopyJudge, an automated copyright infringement identification\nframework that leverages large vision-language models (LVLMs) to simulate\npractical court processes for determining substantial similarity between\ncopyrighted images and those generated by text-to-image diffusion models.\nSpecifically, we employ an abstraction-filtration-comparison test framework\nwith multi-LVLM debate to assess the likelihood of infringement and provide\ndetailed judgment rationales. Based on the judgments, we further introduce a\ngeneral LVLM-based mitigation strategy that automatically optimizes infringing\nprompts by avoiding sensitive expressions while preserving the non-infringing\ncontent. Besides, our approach can be enhanced by exploring non-infringing\nnoise vectors within the diffusion latent space via reinforcement learning,\neven without modifying the original prompts. Experimental results show that our\nidentification method achieves comparable state-of-the-art performance, while\noffering superior generalization and interpretability across various forms of\ninfringement, and that our mitigation method could more effectively mitigate\nmemorization and IP infringement without losing non-infringing expressions.", "paper_summary_zh": "評估 AI 生成的影像是否與受著作權保護的作品實質上相似，是解決著作權爭議的關鍵步驟。在本文中，我們提出 CopyJudge，一個自動化的著作權侵權識別架構，它利用大型視覺語言模型 (LVLMs) 模擬實際的法院程序，以確定受著作權保護的影像與文字轉影像擴散模型所產生的影像之間的實質相似性。具體來說，我們採用抽象過濾比較測試架構，並搭配多個 LVLM 辯論，以評估侵權的可能性並提供詳細的判決依據。根據判決，我們進一步引入一個基於 LVLM 的通用緩解策略，該策略透過避免敏感表達，同時保留非侵權內容，自動最佳化侵權提示。此外，我們的做法可以透過強化學習，在擴散潛在空間中探索非侵權雜訊向量，即使不修改原始提示，也能獲得改善。實驗結果顯示，我們的識別方法達到了與現有技術相當的效能，同時在各種形式的侵權中提供了卓越的泛化性和可解釋性，而我們的緩解方法可以更有效地減輕記憶和智慧財產權侵權，而不會失去非侵權表達。", "author": "Shunchang Liu et.al.", "authors": "Shunchang Liu, Zhuan Shi, Lingjuan Lyu, Yaochu Jin, Boi Faltings", "id": "2502.15278v1", "paper_url": "http://arxiv.org/abs/2502.15278v1", "repo": "null"}}