{"2501.03676": {"publish_time": "2025-01-07", "title": "SALE-Based Offline Reinforcement Learning with Ensemble Q-Networks", "paper_summary": "In this work, we build upon the offline reinforcement learning algorithm TD7,\nwhich incorporates State-Action Learned Embeddings (SALE) and LAP, and propose\na model-free actor-critic algorithm that integrates ensemble Q-networks and a\ngradient diversity penalty from EDAC. The ensemble Q-networks effectively\naddress the challenge of out-of-distribution actions by introducing penalties\nthat guide the actor network to focus on in-distribution actions. Meanwhile,\nthe gradient diversity penalty encourages diverse Q-value gradients, further\nsuppressing overestimation for out-of-distribution actions. Additionally, our\nmethod retains an adjustable behavior cloning (BC) term that directs the actor\nnetwork toward dataset actions during early training stages, while gradually\nreducing its influence as the precision of the Q-ensemble improves. These\nenhancements work synergistically to improve training stability and accuracy.\nExperimental results on the D4RL MuJoCo benchmarks demonstrate that our\nalgorithm achieves superior convergence speed, stability, and performance\ncompared to existing methods.", "paper_summary_zh": "在此工作中，我们建立在离线强化学习算法 TD7 之上，该算法结合了状态动作学习嵌入 (SALE) 和 LAP，并提出了一个无模型的 actor-critic 算法，该算法集成了 ensemble Q 网络和 EDAC 的梯度多样性惩罚。ensemble Q 网络通过引入惩罚来有效应对分布外动作的挑战，这些惩罚引导 actor 网络专注于分布内动作。同时，梯度多样性惩罚鼓励不同的 Q 值梯度，进一步抑制对分布外动作的过高估计。此外，我们的方法保留了一个可调整的行为克隆 (BC) 项，该项在早期训练阶段将 actor 网络引导至数据集动作，同时随着 Q ensemble 精度的提高逐渐减少其影响。这些增强功能协同工作，以提高训练稳定性和准确性。D4RL MuJoCo 基准上的实验结果表明，与现有方法相比，我们的算法实现了卓越的收敛速度、稳定性和性能。", "author": "Zheng Chun et.al.", "authors": "Zheng Chun", "id": "2501.03676v1", "paper_url": "http://arxiv.org/abs/2501.03676v1", "repo": "null"}}