{"2412.08021": {"publish_time": "2024-12-11", "title": "Can a MISL Fly? Analysis and Ingredients for Mutual Information Skill Learning", "paper_summary": "Self-supervised learning has the potential of lifting several of the key\nchallenges in reinforcement learning today, such as exploration, representation\nlearning, and reward design. Recent work (METRA) has effectively argued that\nmoving away from mutual information and instead optimizing a certain\nWasserstein distance is important for good performance. In this paper, we argue\nthat the benefits seen in that paper can largely be explained within the\nexisting framework of mutual information skill learning (MISL). Our analysis\nsuggests a new MISL method (contrastive successor features) that retains the\nexcellent performance of METRA with fewer moving parts, and highlights\nconnections between skill learning, contrastive representation learning, and\nsuccessor features. Finally, through careful ablation studies, we provide\nfurther insight into some of the key ingredients for both our method and METRA.", "paper_summary_zh": "自我監督學習有潛力解決當今強化學習中的幾個關鍵挑戰，例如探索、表徵學習和獎勵設計。最近的研究（METRA）有效地論證了遠離互信息並改為優化某個 Wasserstein 距離對於良好的性能很重要。在本文中，我們論證該論文中看到的優點可以在互信息技能學習（MISL）的現有框架內得到很大程度的解釋。我們的分析提出了一種新的 MISL 方法（對比後繼特徵），它保留了 METRA 的出色性能，同時減少了活動部件，並突出了技能學習、對比表徵學習和後繼特徵之間的聯繫。最後，通過仔細的消融研究，我們進一步深入了解了我們的方法和 METRA 的一些關鍵要素。", "author": "Chongyi Zheng et.al.", "authors": "Chongyi Zheng, Jens Tuyls, Joanne Peng, Benjamin Eysenbach", "id": "2412.08021v1", "paper_url": "http://arxiv.org/abs/2412.08021v1", "repo": "null"}}