{"2407.07544": {"publish_time": "2024-07-10", "title": "Disentangling Masked Autoencoders for Unsupervised Domain Generalization", "paper_summary": "Domain Generalization (DG), designed to enhance out-of-distribution (OOD)\ngeneralization, is all about learning invariance against domain shifts\nutilizing sufficient supervision signals. Yet, the scarcity of such labeled\ndata has led to the rise of unsupervised domain generalization (UDG) - a more\nimportant yet challenging task in that models are trained across diverse\ndomains in an unsupervised manner and eventually tested on unseen domains. UDG\nis fast gaining attention but is still far from well-studied. To close the\nresearch gap, we propose a novel learning framework designed for UDG, termed\nthe Disentangled Masked Auto Encoder (DisMAE), aiming to discover the\ndisentangled representations that faithfully reveal the intrinsic features and\nsuperficial variations without access to the class label. At its core is the\ndistillation of domain-invariant semantic features, which cannot be\ndistinguished by domain classifier, while filtering out the domain-specific\nvariations (for example, color schemes and texture patterns) that are unstable\nand redundant. Notably, DisMAE co-trains the asymmetric dual-branch\narchitecture with semantic and lightweight variation encoders, offering dynamic\ndata manipulation and representation level augmentation capabilities. Extensive\nexperiments on four benchmark datasets (i.e., DomainNet, PACS, VLCS, Colored\nMNIST) with both DG and UDG tasks demonstrate that DisMAE can achieve\ncompetitive OOD performance compared with the state-of-the-art DG and UDG\nbaselines, which shed light on potential research line in improving the\ngeneralization ability with large-scale unlabeled data.", "paper_summary_zh": "領域泛化 (DG) 旨在增強非分佈 (OOD) 泛化，其關鍵在於利用足夠的監督訊號來學習對抗領域轉移的不變性。然而，此類標記資料的稀缺性導致無監督領域泛化 (UDG) 的興起，這是一項更重要但更具挑戰性的任務，因為模型是以無監督的方式在不同的領域中訓練，並最終在未見過的領域中進行測試。UDG 迅速受到關注，但仍遠未得到充分的研究。為了縮小研究差距，我們提出了一個專為 UDG 設計的新穎學習架構，稱為分離遮罩自動編碼器 (DisMAE)，旨在發現分離的表徵，這些表徵忠實地揭示了內在特徵和表面變化，而無需存取類別標籤。其核心是對領域不變語義特徵的萃取，這些特徵無法被領域分類器區分，同時過濾掉不穩定且冗餘的領域特定變化（例如，配色方案和紋理模式）。值得注意的是，DisMAE 使用語義和輕量級變異編碼器共同訓練不對稱的雙分支架構，提供動態資料處理和表徵層級擴充功能。在四個基準資料集（即 DomainNet、PACS、VLCS、Colored MNIST）上進行的廣泛實驗，包括 DG 和 UDG 任務，證明 DisMAE 能夠與最先進的 DG 和 UDG 基準相比，取得具有競爭力的 OOD 效能，這為利用大規模未標記資料改善泛化能力的潛在研究方向提供了啟示。", "author": "An Zhang et.al.", "authors": "An Zhang, Han Wang, Xiang Wang, Tat-Seng Chua", "id": "2407.07544v1", "paper_url": "http://arxiv.org/abs/2407.07544v1", "repo": "https://github.com/rookiehb/dismae"}}