{"2411.04905": {"publish_time": "2024-11-07", "title": "OpenCoder: The Open Cookbook for Top-Tier Code Large Language Models", "paper_summary": "Large language models (LLMs) for code have become indispensable in various\ndomains, including code generation, reasoning tasks and agent systems.While\nopen-access code LLMs are increasingly approaching the performance levels of\nproprietary models, high-quality code LLMs suitable for rigorous scientific\ninvestigation, particularly those with reproducible data processing pipelines\nand transparent training protocols, remain limited. The scarcity is due to\nvarious challenges, including resource constraints, ethical considerations, and\nthe competitive advantages of keeping models advanced. To address the gap, we\nintroduce OpenCoder, a top-tier code LLM that not only achieves performance\ncomparable to leading models but also serves as an ``open cookbook'' for the\nresearch community. Unlike most prior efforts, we release not only model\nweights and inference code, but also the reproducible training data, complete\ndata processing pipeline, rigorous experimental ablation results, and detailed\ntraining protocols for open scientific research. Through this comprehensive\nrelease, we identify the key ingredients for building a top-tier code LLM: (1)\ncode optimized heuristic rules for data cleaning and methods for data\ndeduplication, (2) recall of text corpus related to code and (3) high-quality\nsynthetic data in both annealing and supervised fine-tuning stages. By offering\nthis level of openness, we aim to broaden access to all aspects of a top-tier\ncode LLM, with OpenCoder serving as both a powerful model and an open\nfoundation to accelerate research, and enable reproducible advancements in code\nAI.", "paper_summary_zh": "大型語言模型 (LLM) 已成為各種領域不可或缺的程式碼，包括程式碼生成、推理任務和代理系統。雖然開放取用的程式碼 LLM 逐漸接近專有模型的效能水準，但適合嚴謹科學調查的高品質程式碼 LLM，特別是那些具有可複製資料處理管線和透明訓練協定的程式碼 LLM，仍然有限。這種稀缺性是由於各種挑戰，包括資源限制、倫理考量以及保持模型先進的競爭優勢。為了解決這個差距，我們引入了 OpenCoder，這是一個頂級程式碼 LLM，不僅能達到與領先模型相當的效能，還能作為研究社群的「開放食譜」。與大多數先前的努力不同，我們不僅釋出模型權重和推論程式碼，還釋出可複製的訓練資料、完整的資料處理管線、嚴謹的實驗消融結果，以及開放科學研究的詳細訓練協定。透過這個全面的釋出，我們找出建立頂級程式碼 LLM 的關鍵要素：(1) 資料清理的最佳化啟發式規則和資料重複消除的方法，(2) 與程式碼相關的文字語料庫的召回，以及 (3) 退火和監督微調階段中的高品質合成資料。透過提供這種程度的開放性，我們旨在擴大對頂級程式碼 LLM 各個方面的使用，讓 OpenCoder 同時成為強大的模型和開放基礎，以加速研究，並促進程式碼 AI 的可複製進展。", "author": "Siming Huang et.al.", "authors": "Siming Huang, Tianhao Cheng, Jason Klein Liu, Jiaran Hao, Liuyihan Song, Yang Xu, J. Yang, J. H. Liu, Chenchen Zhang, Linzheng Chai, Ruifeng Yuan, Zhaoxiang Zhang, Jie Fu, Qian Liu, Ge Zhang, Zili Wang, Yuan Qi, Yinghui Xu, Wei Chu", "id": "2411.04905v1", "paper_url": "http://arxiv.org/abs/2411.04905v1", "repo": "null"}}