{"2504.08552": {"publish_time": "2025-04-11", "title": "Towards an Evaluation Framework for Explainable Artificial Intelligence Systems for Health and Well-being", "paper_summary": "The integration of Artificial Intelligence in the development of computer\nsystems presents a new challenge: make intelligent systems explainable to\nhumans. This is especially vital in the field of health and well-being, where\ntransparency in decision support systems enables healthcare professionals to\nunderstand and trust automated decisions and predictions. To address this need,\ntools are required to guide the development of explainable AI systems. In this\npaper, we introduce an evaluation framework designed to support the development\nof explainable AI systems for health and well-being. Additionally, we present a\ncase study that illustrates the application of the framework in practice. We\nbelieve that our framework can serve as a valuable tool not only for developing\nexplainable AI systems in healthcare but also for any AI system that has a\nsignificant impact on individuals.", "paper_summary_zh": "人工智慧在電腦系統發展中的整合提出了一個新的挑戰：讓智慧系統能夠向人類解釋其運作方式。這在健康和福祉領域尤其重要，因為決策支援系統的透明度使醫療保健專業人員能夠理解並信任自動化的決策和預測。為了滿足這一需求，需要開發一些工具來指導可解釋性人工智慧系統的開發。在本文中，我們介紹了一個評估框架，旨在支援健康和福祉領域可解釋性人工智慧系統的開發。此外，我們還提供了一個案例研究，說明了該框架在實務中的應用。我們相信，我們的框架不僅可以作為開發醫療保健領域可解釋性人工智慧系統的寶貴工具，也可以用於任何對個人有重大影響的人工智慧系統。\n", "author": "Esperança Amengual-Alcover et.al.", "authors": "Esperança Amengual-Alcover, Antoni Jaume-i-Capó, Miquel Miró-Nicolau, Gabriel Moyà-Alcover, Antonia Paniza-Fullana", "id": "2504.08552v1", "paper_url": "http://arxiv.org/abs/2504.08552v1", "repo": "null"}}