{"2409.04977": {"publish_time": "2024-09-08", "title": "Enhancing Convolutional Neural Networks with Higher-Order Numerical Difference Methods", "paper_summary": "With the rise of deep learning technology in practical applications,\nConvolutional Neural Networks (CNNs) have been able to assist humans in solving\nmany real-world problems. To enhance the performance of CNNs, numerous network\narchitectures have been explored. Some of these architectures are designed\nbased on the accumulated experience of researchers over time, while others are\ndesigned through neural architecture search methods. The improvements made to\nCNNs by the aforementioned methods are quite significant, but most of the\nimprovement methods are limited in reality by model size and environmental\nconstraints, making it difficult to fully realize the improved performance. In\nrecent years, research has found that many CNN structures can be explained by\nthe discretization of ordinary differential equations. This implies that we can\ndesign theoretically supported deep network structures using higher-order\nnumerical difference methods. It should be noted that most of the previous CNN\nmodel structures are based on low-order numerical methods. Therefore,\nconsidering that the accuracy of linear multi-step numerical difference methods\nis higher than that of the forward Euler method, this paper proposes a stacking\nscheme based on the linear multi-step method. This scheme enhances the\nperformance of ResNet without increasing the model size and compares it with\nthe Runge-Kutta scheme. The experimental results show that the performance of\nthe stacking scheme proposed in this paper is superior to existing stacking\nschemes (ResNet and HO-ResNet), and it has the capability to be extended to\nother types of neural networks.", "paper_summary_zh": "隨著深度學習技術在實際應用中的興起，\n卷積神經網路 (CNN) 已能協助人類解決\n許多真實世界中的問題。為了提升 CNN 的效能，\n無數的網路架構已被探討。其中一些架構是\n基於研究人員隨著時間累積的經驗所設計，而其他\n則是透過神經架構搜尋方法所設計。前述方法對\nCNN 所做的改良相當顯著，但大多數的改良方法在\n現實中受到模型大小與環境限制，難以完全發揮\n改良後的效能。近年來，研究發現許多 CNN 結構\n可以用常微分方程式的離散化來解釋。這意味著我們\n可以使用高階數值差分方法來設計有理論依據的深度網路架構。\n值得注意的是，大多數先前的 CNN 模型結構都是\n基於低階數值方法。因此，考量線性多步數值差分方法\n的準確度高於前進歐拉法，本論文提出一個基於線性\n多步數值差分方法的堆疊架構。此架構在不增加模型\n大小的情況下提升 ResNet 的效能，並與 Runge-Kutta\n架構進行比較。實驗結果顯示，本論文提出的堆疊\n架構效能優於現有的堆疊架構（ResNet 和 HO-ResNet），\n且有能力延伸至其他類型的類神經網路。", "author": "Qi Wang et.al.", "authors": "Qi Wang, Zijun Gao, Mingxiu Sui, Taiyuan Mei, Xiaohan Cheng, Iris Li", "id": "2409.04977v1", "paper_url": "http://arxiv.org/abs/2409.04977v1", "repo": "null"}}