{"2409.17827": {"publish_time": "2024-09-26", "title": "BeanCounter: A low-toxicity, large-scale, and open dataset of business-oriented text", "paper_summary": "Many of the recent breakthroughs in language modeling have resulted from\nscaling effectively the same model architecture to larger datasets. In this\nvein, recent work has highlighted performance gains from increasing training\ndataset size and quality, suggesting a need for novel sources of large-scale\ndatasets. In this work, we introduce BeanCounter, a public dataset consisting\nof more than 159B tokens extracted from businesses' disclosures. We show that\nthis data is indeed novel: less than 0.1% of BeanCounter appears in Common\nCrawl-based datasets and it is an order of magnitude larger than datasets\nrelying on similar sources. Given the data's provenance, we hypothesize that\nBeanCounter is comparatively more factual and less toxic than web-based\ndatasets. Exploring this hypothesis, we find that many demographic identities\noccur with similar prevalence in BeanCounter but with significantly less toxic\ncontext relative to other datasets. To demonstrate the utility of BeanCounter,\nwe evaluate and compare two LLMs continually pre-trained on BeanCounter with\ntheir base models. We find an 18-33% reduction in toxic generation and improved\nperformance within the finance domain for the continually pretrained models.\nCollectively, our work suggests that BeanCounter is a novel source of\nlow-toxicity and high-quality domain-specific data with sufficient scale to\ntrain multi-billion parameter LLMs.", "paper_summary_zh": "最近在語言模型的許多突破來自於將相同的模型架構有效地擴展到更大的資料集。在這方面，最近的研究強調了增加訓練資料集大小和品質的效能提升，這表示需要新的來源來取得大型資料集。在這項研究中，我們介紹了 BeanCounter，一個由企業揭露中萃取出的超過 159B 個代幣的公開資料集。我們展示了這些資料確實是新的：在基於 Common Crawl 的資料集中，少於 0.1% 的 BeanCounter 會出現，而且它比依賴類似來源的資料集大上一個數量級。鑑於資料的來源，我們假設 BeanCounter 相較於基於網路的資料集更具有事實性且毒性較低。在探討這個假設時，我們發現許多人口統計特徵在 BeanCounter 中出現的普遍性相似，但與其他資料集相比，其毒性背景顯著降低。為了展示 BeanCounter 的效用，我們評估並比較了兩個持續預先訓練於 BeanCounter 的 LLM 與其基礎模型。我們發現持續預先訓練的模型的毒性生成減少了 18-33%，且在金融領域的效能也有所提升。總的來說，我們的研究表明 BeanCounter 是低毒性和高品質領域特定資料的新來源，其規模足以訓練多個十億參數的 LLM。", "author": "Siyan Wang et.al.", "authors": "Siyan Wang, Bradford Levy", "id": "2409.17827v2", "paper_url": "http://arxiv.org/abs/2409.17827v2", "repo": "null"}}