{"2501.14082": {"publish_time": "2025-01-23", "title": "Communicating Activations Between Language Model Agents", "paper_summary": "Communication between multiple language model (LM) agents has been shown to\nscale up the reasoning ability of LMs. While natural language has been the\ndominant medium for inter-LM communication, it is not obvious this should be\nthe standard: not only does natural language communication incur high inference\ncosts that scale quickly with the number of both agents and messages, but also\nthe decoding process abstracts away too much rich information that could be\notherwise accessed from the internal activations. In this work, we propose a\nsimple technique whereby LMs communicate via activations; concretely, we pause\nan LM $\\textit{B}$'s computation at an intermediate layer, combine its current\nactivation with another LM $\\textit{A}$'s intermediate activation via some\nfunction $\\textit{f}$, then pass $\\textit{f}$'s output into the next layer of\n$\\textit{B}$ and continue the forward pass till decoding is complete. This\napproach scales up LMs on new tasks with zero additional parameters and data,\nand saves a substantial amount of compute over natural language communication.\nWe test our method with various functional forms $\\textit{f}$ on two\nexperimental setups--multi-player coordination games and reasoning\nbenchmarks--and find that it achieves up to $27.0\\%$ improvement over natural\nlanguage communication across datasets with $<$$1/4$ the compute, illustrating\nthe superiority and robustness of activations as an alternative \"language\" for\ncommunication between LMs.", "paper_summary_zh": "多語系語言模型 (LM) 代理之間的溝通已被證實能提升 LM 的推理能力。儘管自然語言一直是 LM 間溝通的主要媒介，但這並不表示自然語言理應成為標準：自然語言溝通不僅會產生高昂的推理成本，且成本會隨著代理和訊息數量快速增加，而且解碼程序會抽象化太多豐富的資訊，否則這些資訊可從內部啟用存取。在這項研究中，我們提出了一種簡單的技術，讓 LM 能透過啟用進行溝通；具體來說，我們暫停 LM $\\textit{B}$ 在中間層的運算，透過函數 $\\textit{f}$ 將其目前的啟用與另一個 LM $\\textit{A}$ 的中間啟用結合，然後將 $\\textit{f}$ 的輸出傳遞到 $\\textit{B}$ 的下一層，並繼續進行前向傳遞，直到解碼完成。這種方法能讓 LM 在新的任務中擴充，而無需額外的參數和資料，還能比自然語言溝通節省大量的運算量。我們在兩個實驗設置（多玩家協調遊戲和推理基準）上測試了我們的各種函數形式 $\\textit{f}$，發現它在資料集上實現了比自然語言溝通高達 $27.0\\%$ 的進步，運算量卻不到 $1/4$，這說明了啟用作為 LM 間溝通的另一種「語言」的優越性和穩健性。", "author": "Vignav Ramesh et.al.", "authors": "Vignav Ramesh, Kenneth Li", "id": "2501.14082v1", "paper_url": "http://arxiv.org/abs/2501.14082v1", "repo": "null"}}