{"2409.08815": {"publish_time": "2024-09-13", "title": "Deep reinforcement learning for tracking a moving target in jellyfish-like swimming", "paper_summary": "We develop a deep reinforcement learning method for training a jellyfish-like\nswimmer to effectively track a moving target in a two-dimensional flow. This\nswimmer is a flexible object equipped with a muscle model based on torsional\nsprings. We employ a deep Q-network (DQN) that takes the swimmer's geometry and\ndynamic parameters as inputs, and outputs actions which are the forces applied\nto the swimmer. In particular, we introduce an action regulation to mitigate\nthe interference from complex fluid-structure interactions. The goal of these\nactions is to navigate the swimmer to a target point in the shortest possible\ntime. In the DQN training, the data on the swimmer's motions are obtained from\nsimulations conducted using the immersed boundary method. During tracking a\nmoving target, there is an inherent delay between the application of forces and\nthe corresponding response of the swimmer's body due to hydrodynamic\ninteractions between the shedding vortices and the swimmer's own locomotion.\nOur tests demonstrate that the swimmer, with the DQN agent and action\nregulation, is able to dynamically adjust its course based on its instantaneous\nstate. This work extends the application scope of machine learning in\ncontrolling flexible objects within fluid environments.", "paper_summary_zh": "我們開發了一種深度強化學習方法，用於訓練一個類似水母的游泳者，以有效追蹤在二維流中的移動目標。這個游泳者是一個具有基於扭轉彈簧的肌肉模型的柔性物體。我們採用一個深度 Q 網路 (DQN)，它將游泳者的幾何形狀和動態參數作為輸入，並輸出作用在游泳者身上的力，即動作。特別是，我們引入了一個動作調節，以減輕複雜流體結構相互作用的干擾。這些動作的目標是在最短時間內導航游泳者到目標點。在 DQN 訓練中，游泳者運動的數據是從使用浸沒邊界方法進行的模擬中獲得的。在追蹤移動目標的過程中，由於脫落渦流和游泳者自身的運動之間的流體動力相互作用，力的施加和游泳者身體的相應反應之間存在固有的延遲。我們的測試表明，游泳者在 DQN 代理和動作調節的作用下，能夠根據其瞬時狀態動態調整其航向。這項工作擴大了機器學習在流體環境中控制柔性物體的應用範圍。", "author": "Yihao Chen et.al.", "authors": "Yihao Chen, Yue Yang", "id": "2409.08815v1", "paper_url": "http://arxiv.org/abs/2409.08815v1", "repo": "null"}}