{"2412.12832": {"publish_time": "2024-12-17", "title": "DSGram: Dynamic Weighting Sub-Metrics for Grammatical Error Correction in the Era of Large Language Models", "paper_summary": "Evaluating the performance of Grammatical Error Correction (GEC) models has\nbecome increasingly challenging, as large language model (LLM)-based GEC\nsystems often produce corrections that diverge from provided gold references.\nThis discrepancy undermines the reliability of traditional reference-based\nevaluation metrics. In this study, we propose a novel evaluation framework for\nGEC models, DSGram, integrating Semantic Coherence, Edit Level, and Fluency,\nand utilizing a dynamic weighting mechanism. Our framework employs the Analytic\nHierarchy Process (AHP) in conjunction with large language models to ascertain\nthe relative importance of various evaluation criteria. Additionally, we\ndevelop a dataset incorporating human annotations and LLM-simulated sentences\nto validate our algorithms and fine-tune more cost-effective models.\nExperimental results indicate that our proposed approach enhances the\neffectiveness of GEC model evaluations.", "paper_summary_zh": "評估文法錯誤修正 (GEC) 模型的效能變得越來越有挑戰性，因為基於大型語言模型 (LLM) 的 GEC 系統經常產生與提供的黃金參考不同的修正。這種差異會破壞傳統基於參考的評估指標的可靠性。在本研究中，我們提出了一個新的 GEC 模型評估架構 DSGram，它整合了語義一致性、編輯層級和流暢度，並利用動態加權機制。我們的架構採用層級分析法 (AHP) 結合大型語言模型來確定各種評估標準的相對重要性。此外，我們開發了一個包含人工標註和 LLM 模擬句子的資料集，以驗證我們的演算法並微調更具成本效益的模型。實驗結果表明，我們提出的方法增強了 GEC 模型評估的有效性。", "author": "Jinxiang Xie et.al.", "authors": "Jinxiang Xie, Yilin Li, Xunjian Yin, Xiaojun Wan", "id": "2412.12832v1", "paper_url": "http://arxiv.org/abs/2412.12832v1", "repo": "https://github.com/jxtse/GEC-Metrics-DSGram"}}