{"2410.05218": {"publish_time": "2024-10-07", "title": "Density estimation with LLMs: a geometric investigation of in-context learning trajectories", "paper_summary": "Large language models (LLMs) demonstrate remarkable emergent abilities to\nperform in-context learning across various tasks, including time series\nforecasting. This work investigates LLMs' ability to estimate probability\ndensity functions (PDFs) from data observed in-context; such density estimation\n(DE) is a fundamental task underlying many probabilistic modeling problems. We\nleverage the Intensive Principal Component Analysis (InPCA) to visualize and\nanalyze the in-context learning dynamics of LLaMA-2 models. Our main finding is\nthat these LLMs all follow similar learning trajectories in a low-dimensional\nInPCA space, which are distinct from those of traditional density estimation\nmethods like histograms and Gaussian kernel density estimation (KDE). We\ninterpret the LLaMA in-context DE process as a KDE with an adaptive kernel\nwidth and shape. This custom kernel model captures a significant portion of\nLLaMA's behavior despite having only two parameters. We further speculate on\nwhy LLaMA's kernel width and shape differs from classical algorithms, providing\ninsights into the mechanism of in-context probabilistic reasoning in LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 展示了非凡的新興能力，可以在各種任務中執行情境學習，包括時間序列預測。這項工作探討了 LLM 從情境中觀察到的資料估計機率密度函數 (PDF) 的能力；這種密度估計 (DE) 是許多機率模型問題的基礎任務。我們利用密集主成分分析 (InPCA) 來視覺化和分析 LLaMA-2 模型的情境學習動態。我們的發現是，這些 LLM 在低維度 InPCA 空間中都遵循類似的學習軌跡，這與直方圖和高斯核密度估計 (KDE) 等傳統密度估計方法不同。我們將 LLaMA 情境 DE 過程解釋為具有自適應核寬度和形狀的 KDE。儘管只有兩個參數，但此自訂核模型仍捕捉到 LLaMA 行為的重要部分。我們進一步推測 LLaMA 的核寬度和形狀與經典演算法不同的原因，並深入了解 LLM 中情境機率推理的機制。", "author": "Toni J. B. Liu et.al.", "authors": "Toni J. B. Liu, Nicolas Boullé, Raphaël Sarfati, Christopher J. Earls", "id": "2410.05218v1", "paper_url": "http://arxiv.org/abs/2410.05218v1", "repo": "null"}}