{"2408.12981": {"publish_time": "2024-08-23", "title": "QD-VMR: Query Debiasing with Contextual Understanding Enhancement for Video Moment Retrieval", "paper_summary": "Video Moment Retrieval (VMR) aims to retrieve relevant moments of an\nuntrimmed video corresponding to the query. While cross-modal interaction\napproaches have shown progress in filtering out query-irrelevant information in\nvideos, they assume the precise alignment between the query semantics and the\ncorresponding video moments, potentially overlooking the misunderstanding of\nthe natural language semantics. To address this challenge, we propose a novel\nmodel called \\textit{QD-VMR}, a query debiasing model with enhanced contextual\nunderstanding. Firstly, we leverage a Global Partial Aligner module via video\nclip and query features alignment and video-query contrastive learning to\nenhance the cross-modal understanding capabilities of the model. Subsequently,\nwe employ a Query Debiasing Module to obtain debiased query features\nefficiently, and a Visual Enhancement module to refine the video features\nrelated to the query. Finally, we adopt the DETR structure to predict the\npossible target video moments. Through extensive evaluations of three benchmark\ndatasets, QD-VMR achieves state-of-the-art performance, proving its potential\nto improve the accuracy of VMR. Further analytical experiments demonstrate the\neffectiveness of our proposed module. Our code will be released to facilitate\nfuture research.", "paper_summary_zh": "影片時刻檢索 (VMR) 的目的是檢索與查詢相應的未修剪影片的相關時刻。雖然跨模態互動方法已顯示出在影片中過濾與查詢無關資訊的進展，但它們假設查詢語意與對應的影片時刻之間的精確對齊，可能會忽略對自然語言語意的誤解。為了應對這個挑戰，我們提出了一個名為「QD-VMR」的新穎模型，這是一個具備增強脈絡理解的查詢去偏差模型。首先，我們透過影片片段和查詢特徵對齊以及影片-查詢對比學習，利用一個全局部分對齊器模組來增強模型的跨模態理解能力。隨後，我們採用一個查詢去偏差模組來有效取得去偏差的查詢特徵，並採用一個視覺增強模組來改善與查詢相關的影片特徵。最後，我們採用 DETR 結構來預測可能的目標影片時刻。透過對三個基準資料集的廣泛評估，QD-VMR 達到了最先進的效能，證明了其改善 VMR 精確度的潛力。進一步的分析實驗證明了我們提出的模組的有效性。我們的程式碼將會釋出，以利未來的研究。", "author": "Chenghua Gao et.al.", "authors": "Chenghua Gao, Min Li, Jianshuo Liu, Junxing Ren, Lin Chen, Haoyu Liu, Bo Meng, Jitao Fu, Wenwen Su", "id": "2408.12981v1", "paper_url": "http://arxiv.org/abs/2408.12981v1", "repo": "null"}}