{"2407.03035": {"publish_time": "2024-07-03", "title": "NLP Sampling: Combining MCMC and NLP Methods for Diverse Constrained Sampling", "paper_summary": "Generating diverse samples under hard constraints is a core challenge in many\nareas. With this work we aim to provide an integrative view and framework to\ncombine methods from the fields of MCMC, constrained optimization, as well as\nrobotics, and gain insights in their strengths from empirical evaluations. We\npropose NLP Sampling as a general problem formulation, propose a family of\nrestarting two-phase methods as a framework to integrated methods from across\nthe fields, and evaluate them on analytical and robotic manipulation planning\nproblems. Complementary to this, we provide several conceptual discussions,\ne.g. on the role of Lagrange parameters, global sampling, and the idea of a\nDiffused NLP and a corresponding model-based denoising sampler.", "paper_summary_zh": "在嚴格限制下產生多樣化樣本是許多領域的核心挑戰。透過這項工作，我們旨在提供一個整合的觀點和架構，以結合 MCMC、受限最佳化以及機器人領域的方法，並從經驗評估中獲得其優勢的見解。我們提出 NLP 採樣作為一個通用的問題表述，提出一個重新啟動兩階段方法的系列，作為一個整合跨領域方法的架構，並在分析和機器人操作規劃問題上評估它們。補充這一點，我們提供了幾個概念性討論，例如，關於拉格朗日參數、全局採樣以及擴散 NLP 和相應的基於模型的去噪採樣器的概念。", "author": "Marc Toussaint et.al.", "authors": "Marc Toussaint, Cornelius V. Braun, Joaquim Ortiz-Haro", "id": "2407.03035v1", "paper_url": "http://arxiv.org/abs/2407.03035v1", "repo": "null"}}