{"2502.12959": {"publish_time": "2025-02-18", "title": "AlignFreeze: Navigating the Impact of Realignment on the Layers of Multilingual Models Across Diverse Languages", "paper_summary": "Realignment techniques are often employed to enhance cross-lingual transfer\nin multilingual language models, still, they can sometimes degrade performance\nin languages that differ significantly from the fine-tuned source language.\nThis paper introduces AlignFreeze, a method that freezes either the layers'\nlower half or upper half during realignment. Through controlled experiments on\n4 tasks, 3 models, and in 35 languages, we find that realignment affects all\nthe layers but can be the most detrimental to the lower ones. Freezing the\nlower layers can prevent performance degradation. Particularly, AlignFreeze\nimproves Part-of-Speech (PoS) tagging performances in languages where full\nrealignment fails: with XLM-R, it provides improvements of more than one\nstandard deviation in accuracy in seven more languages than full realignment.", "paper_summary_zh": "重新對齊技術通常用於增強多語言語言模型中的跨語言轉移，然而，它們有時會降低與微調源語言顯著不同的語言的效能。本文介紹了 AlignFreeze，一種在重新對齊期間凍結層的下半部或上半部的的方法。透過 4 項任務、3 個模型和 35 種語言的受控實驗，我們發現重新對齊會影響所有層，但對較低層的影響最大。凍結較低層可以防止效能下降。特別是，AlignFreeze 改善了在完全重新對齊失敗的語言中的詞性 (PoS) 標記效能：使用 XLM-R，它比完全重新對齊在七種語言中提供了超過一個標準差的準確度改進。", "author": "Steve Bakos et.al.", "authors": "Steve Bakos, Félix Gaschi, David Guzmán, Riddhi More, Kelly Chutong Li, En-Shiun Annie Lee", "id": "2502.12959v1", "paper_url": "http://arxiv.org/abs/2502.12959v1", "repo": "null"}}