{"2501.14617": {"publish_time": "2025-01-24", "title": "Funzac at CoMeDi Shared Task: Modeling Annotator Disagreement from Word-In-Context Perspectives", "paper_summary": "In this work, we evaluate annotator disagreement in Word-in-Context (WiC)\ntasks exploring the relationship between contextual meaning and disagreement as\npart of the CoMeDi shared task competition. While prior studies have modeled\ndisagreement by analyzing annotator attributes with single-sentence inputs,\nthis shared task incorporates WiC to bridge the gap between sentence-level\nsemantic representation and annotator judgment variability. We describe three\ndifferent methods that we developed for the shared task, including a feature\nenrichment approach that combines concatenation, element-wise differences,\nproducts, and cosine similarity, Euclidean and Manhattan distances to extend\ncontextual embedding representations, a transformation by Adapter blocks to\nobtain task-specific representations of contextual embeddings, and classifiers\nof varying complexities, including ensembles. The comparison of our methods\ndemonstrates improved performance for methods that include enriched and\ntask-specfic features. While the performance of our method falls short in\ncomparison to the best system in subtask 1 (OGWiC), it is competitive to the\nofficial evaluation results in subtask 2 (DisWiC).", "paper_summary_zh": "在這項工作中，我們評估了語境中的單字 (WiC) 任務中的註解者分歧，探索了語境意義和分歧之間的關係，作為 CoMeDi 共享任務競賽的一部分。雖然先前的研究已通過分析單一句子輸入的註解者屬性對分歧進行建模，但此共享任務納入了 WiC，以彌合句子層級語義表示和註解者判斷變異之間的差距。我們描述了我們為共享任務開發的三種不同方法，包括一種特徵豐富化方法，它結合了串聯、元素差異、乘積和餘弦相似性、歐幾里得和曼哈頓距離來擴充語境嵌入表示，通過適配器塊進行轉換以獲得語境嵌入的特定於任務的表示，以及包括集合在內的不同複雜程度的分類器。我們的方法的比較證明了包含豐富和特定於任務的特徵的方法的效能有所提升。雖然我們的方法的效能與子任務 1 (OGWiC) 中的最佳系統相比有所不足，但它與子任務 2 (DisWiC) 中的官方評估結果具有競爭力。", "author": "Olufunke O. Sarumi et.al.", "authors": "Olufunke O. Sarumi, Charles Welch, Lucie Flek, Jörg Schlötterer", "id": "2501.14617v1", "paper_url": "http://arxiv.org/abs/2501.14617v1", "repo": "https://github.com/funzac/comedi"}}