{"2407.15839": {"publish_time": "2024-07-22", "title": "Importance Sampling-Guided Meta-Training for Intelligent Agents in Highly Interactive Environments", "paper_summary": "Training intelligent agents to navigate highly interactive environments\npresents significant challenges. While guided meta reinforcement learning (RL)\napproach that first trains a guiding policy to train the ego agent has proven\neffective in improving generalizability across various levels of interaction,\nthe state-of-the-art method tends to be overly sensitive to extreme cases,\nimpairing the agents' performance in the more common scenarios. This study\nintroduces a novel training framework that integrates guided meta RL with\nimportance sampling (IS) to optimize training distributions for navigating\nhighly interactive driving scenarios, such as T-intersections. Unlike\ntraditional methods that may underrepresent critical interactions or\noveremphasize extreme cases during training, our approach strategically adjusts\nthe training distribution towards more challenging driving behaviors using IS\nproposal distributions and applies the importance ratio to de-bias the result.\nBy estimating a naturalistic distribution from real-world datasets and\nemploying a mixture model for iterative training refinements, the framework\nensures a balanced focus across common and extreme driving scenarios.\nExperiments conducted with both synthetic dataset and T-intersection scenarios\nfrom the InD dataset demonstrate not only accelerated training but also\nimprovement in agent performance under naturalistic conditions, showcasing the\nefficacy of combining IS with meta RL in training reliable autonomous agents\nfor highly interactive navigation tasks.", "paper_summary_zh": "訓練智能代理程式在高度互動的環境中導航，會面臨重大挑戰。雖然引導元強化學習 (RL) 方法先訓練引導政策來訓練自我代理程式，已被證明可以有效提升在不同互動層級之間的泛化性，但最先進的方法往往對極端案例過度敏感，損害代理程式在更常見場景中的效能。本研究提出一個新的訓練架構，將引導元 RL 與重要性抽樣 (IS) 整合，以最佳化訓練分佈，用於導航高度互動的駕駛場景，例如 T 型路口。與傳統方法不同，傳統方法在訓練過程中可能低估關鍵互動或過度強調極端案例，我們的做法策略性地調整訓練分佈，使用 IS 提議分佈朝向更具挑戰性的駕駛行為，並套用重要性比率來消除結果偏差。透過從真實世界資料集估計自然分佈，並採用混合模型進行反覆訓練調整，該架構確保在常見和極端駕駛場景之間取得平衡的關注。使用合成資料集和 InD 資料集中的 T 型路口場景進行的實驗，不僅證明了訓練加速，也證明了在自然條件下代理程式效能的提升，展示了在訓練可靠的自主代理程式以執行高度互動導航任務時，結合 IS 和元 RL 的效能。", "author": "Mansur Arief et.al.", "authors": "Mansur Arief, Mike Timmerman, Jiachen Li, David Isele, Mykel J Kochenderfer", "id": "2407.15839v1", "paper_url": "http://arxiv.org/abs/2407.15839v1", "repo": "null"}}