{"2412.11567": {"publish_time": "2024-12-16", "title": "AUEB-Archimedes at RIRAG-2025: Is obligation concatenation really all you need?", "paper_summary": "This paper presents the systems we developed for RIRAG-2025, a shared task\nthat requires answering regulatory questions by retrieving relevant passages.\nThe generated answers are evaluated using RePASs, a reference-free and\nmodel-based metric. Our systems use a combination of three retrieval models and\na reranker. We show that by exploiting a neural component of RePASs that\nextracts important sentences ('obligations') from the retrieved passages, we\nachieve a dubiously high score (0.947), even though the answers are directly\nextracted from the retrieved passages and are not actually generated answers.\nWe then show that by selecting the answer with the best RePASs among a few\ngenerated alternatives and then iteratively refining this answer by reducing\ncontradictions and covering more obligations, we can generate readable,\ncoherent answers that achieve a more plausible and relatively high score\n(0.639).", "paper_summary_zh": "本文介紹我們為 RIRAG-2025 開發的系統，這是一項共用任務，需要透過擷取相關段落來回答法規問題。產生的答案使用 RePASs 進行評估，這是一個不依賴參考且基於模型的指標。我們的系統使用三個擷取模型和一個重新排序器的組合。我們展示透過利用 RePASs 的神經元組件從擷取的段落中萃取出重要句子（「義務」），我們達到了可疑的高分（0.947），即使答案是直接從擷取的段落中萃取，且實際上並非產生的答案。接著我們展示透過在幾個產生的備選方案中選出 RePASs 最佳的答案，然後透過減少矛盾和涵蓋更多義務來反覆精煉這個答案，我們可以產生可讀、連貫的答案，並達到更合理且相對較高的分數（0.639）。", "author": "Ioannis Chasandras et.al.", "authors": "Ioannis Chasandras, Odysseas S. Chlapanis, Ion Androutsopoulos", "id": "2412.11567v1", "paper_url": "http://arxiv.org/abs/2412.11567v1", "repo": "null"}}