{"2406.16521": {"publish_time": "2024-06-24", "title": "Carrot and Stick: Inducing Self-Motivation with Positive & Negative Feedback", "paper_summary": "Positive thinking is thought to be an important component of self-motivation\nin various practical fields such as education and the workplace. Previous work,\nincluding sentiment transfer and positive reframing, has focused on the\npositive side of language. However, self-motivation that drives people to reach\ntheir goals has not yet been studied from a computational perspective.\nMoreover, negative feedback has not yet been explored, even though positive and\nnegative feedback are both necessary to grow self-motivation. To facilitate\nself-motivation, we propose CArrot and STICk (CASTIC) dataset, consisting of\n12,590 sentences with 5 different strategies for enhancing self-motivation. Our\ndata and code are publicly available at here.", "paper_summary_zh": "正面思考被認為是各種實務領域（例如教育和職場）中自我激勵的重要組成部分。先前的研究（包括情緒轉移和正面重構）著重於語言的正面面向。然而，驅使人們達成目標的自我激勵尚未從計算觀點進行研究。此外，儘管正面和負面回饋對於培養自我激勵都是必要的，但負面回饋尚未被探討。為了促進自我激勵，我們提出 CArrot and STICk (CASTIC) 資料集，其中包含 12,590 個句子，採用 5 種不同的策略來增強自我激勵。我們的資料和程式碼在此公開提供。", "author": "Jimin Sohn et.al.", "authors": "Jimin Sohn, Jeihee Cho, Junyong Lee, Songmu Heo, Ji-Eun Han, David R. Mortensen", "id": "2406.16521v1", "paper_url": "http://arxiv.org/abs/2406.16521v1", "repo": "null"}}