{"2501.04961": {"publish_time": "2025-01-09", "title": "Demystifying Domain-adaptive Post-training for Financial LLMs", "paper_summary": "Domain-adaptive post-training of large language models (LLMs) has emerged as\na promising approach for specialized domains such as medicine and finance.\nHowever, significant challenges remain in identifying optimal adaptation\ncriteria and training strategies across varying data and model configurations.\nTo address these challenges, we introduce FINDAP, a systematic and fine-grained\ninvestigation into domain-adaptive post-training of LLMs for the finance\ndomain. Our approach begins by identifying the core capabilities required for\nthe target domain and designing a comprehensive evaluation suite aligned with\nthese needs. We then analyze the effectiveness of key post-training stages,\nincluding continual pretraining, instruction tuning, and preference alignment.\nBuilding on these insights, we propose an effective training recipe centered on\na novel preference data distillation method, which leverages process signals\nfrom a generative reward model. The resulting model, Llama-Fin, achieves\nstate-of-the-art performance across a wide range of financial tasks. Our\nanalysis also highlights how each post-training stage contributes to distinct\ncapabilities, uncovering specific challenges and effective solutions, providing\nvaluable insights for domain adaptation of LLMs. Project page:\nhttps://github.com/SalesforceAIResearch/FinDap", "paper_summary_zh": "大型語言模型 (LLM) 的領域適應後訓練已成為醫學和金融等專業領域中一種有前途的方法。\n然而，在確定最佳適應標準和跨不同數據和模型配置的訓練策略方面，仍然存在重大挑戰。\n為了應對這些挑戰，我們引入了 FINDAP，這是一種對 LLM 的金融領域適應後訓練進行系統且細緻的調查。我們的做法首先是確定目標領域所需的核心能力，並設計一個與這些需求相一致的綜合評估套件。然後，我們分析關鍵後訓練階段的有效性，包括持續預訓練、指令微調和偏好對齊。根據這些見解，我們提出了一個以新穎的偏好數據蒸餾方法為中心的有效訓練配方，該方法利用生成獎勵模型中的過程信號。由此產生的模型 Llama-Fin 在廣泛的金融任務中實現了最先進的性能。我們的分析還強調了每個後訓練階段如何促成不同的能力，揭示具體的挑戰和有效的解決方案，為 LLM 的領域適應提供了有價值的見解。專案頁面：\nhttps://github.com/SalesforceAIResearch/FinDap", "author": "Zixuan Ke et.al.", "authors": "Zixuan Ke, Yifei Ming, Xuan-Phi Nguyen, Caiming Xiong, Shafiq Joty", "id": "2501.04961v1", "paper_url": "http://arxiv.org/abs/2501.04961v1", "repo": "null"}}