{"2405.14411": {"publish_time": "2024-05-23", "title": "Large Language Models for Explainable Decisions in Dynamic Digital Twins", "paper_summary": "Dynamic data-driven Digital Twins (DDTs) can enable informed decision-making\nand provide an optimisation platform for the underlying system. By leveraging\nprinciples of Dynamic Data-Driven Applications Systems (DDDAS), DDTs can\nformulate computational modalities for feedback loops, model updates and\ndecision-making, including autonomous ones. However, understanding autonomous\ndecision-making often requires technical and domain-specific knowledge. This\npaper explores using large language models (LLMs) to provide an explainability\nplatform for DDTs, generating natural language explanations of the system's\ndecision-making by leveraging domain-specific knowledge bases. A case study\nfrom smart agriculture is presented.", "paper_summary_zh": "動態資料驅動的數位分身（DDT）能讓資料驅動的決策制定更明智，並提供一個最佳化平台給底層系統。透過運用動態資料驅動應用系統（DDDAS）的原則，DDT 能制定計算模式，用於回饋迴路、模型更新和決策制定，包括自動決策制定。然而，理解自動決策制定通常需要技術和領域特定的知識。本文探討使用大型語言模型（LLM）來提供 DDT 的可解釋性平台，透過運用領域特定的知識庫，產生系統決策制定的自然語言解釋。本文提供了一個智慧農業的案例研究。", "author": "Nan Zhang et.al.", "authors": "Nan Zhang, Christian Vergara-Marcillo, Georgios Diamantopoulos, Jingran Shen, Nikos Tziritas, Rami Bahsoon, Georgios Theodoropoulos", "id": "2405.14411v1", "paper_url": "http://arxiv.org/abs/2405.14411v1", "repo": "null"}}