{"2502.14830": {"publish_time": "2025-02-20", "title": "Middle-Layer Representation Alignment for Cross-Lingual Transfer in Fine-Tuned LLMs", "paper_summary": "While large language models demonstrate remarkable capabilities at\ntask-specific applications through fine-tuning, extending these benefits across\ndiverse languages is essential for broad accessibility. However, effective\ncross-lingual transfer is hindered by LLM performance gaps across languages and\nthe scarcity of fine-tuning data in many languages. Through analysis of LLM\ninternal representations from over 1,000+ language pairs, we discover that\nmiddle layers exhibit the strongest potential for cross-lingual alignment.\nBuilding on this finding, we propose a middle-layer alignment objective\nintegrated into task-specific training. Our experiments on slot filling,\nmachine translation, and structured text generation show consistent\nimprovements in cross-lingual transfer, especially to lower-resource languages.\nThe method is robust to the choice of alignment languages and generalizes to\nlanguages unseen during alignment. Furthermore, we show that separately trained\nalignment modules can be merged with existing task-specific modules, improving\ncross-lingual capabilities without full re-training. Our code is publicly\navailable (https://github.com/dannigt/mid-align).", "paper_summary_zh": "儘管大型語言模型在特定任務應用中透過微調展現出卓越的能力，但要讓這些好處擴及各種語言，對於廣泛的可及性來說至關重要。然而，有效的跨語言轉移受到跨語言 LLM 效能差距以及許多語言中微調資料的稀少性所阻礙。透過分析來自 1,000 多種語言對的 LLM 內部表示，我們發現中間層展現出最強的跨語言對齊潛力。根據這個發現，我們提出一個整合到特定任務訓練中的中間層對齊目標。我們在插槽填補、機器翻譯和結構化文字生成方面的實驗顯示，跨語言轉移持續改善，特別是對於低資源語言。此方法對於對齊語言的選擇具有穩健性，並推廣到對齊期間未曾見過的語言。此外，我們展示了單獨訓練的對齊模組可以與現有的特定任務模組合併，在不重新訓練的情況下改善跨語言能力。我們的程式碼已公開（https://github.com/dannigt/mid-align）。", "author": "Danni Liu et.al.", "authors": "Danni Liu, Jan Niehues", "id": "2502.14830v1", "paper_url": "http://arxiv.org/abs/2502.14830v1", "repo": "null"}}