{"2407.13241": {"publish_time": "2024-07-18", "title": "NODER: Image Sequence Regression Based on Neural Ordinary Differential Equations", "paper_summary": "Regression on medical image sequences can capture temporal image pattern\nchanges and predict images at missing or future time points. However, existing\ngeodesic regression methods limit their regression performance by a strong\nunderlying assumption of linear dynamics, while diffusion-based methods have\nhigh computational costs and lack constraints to preserve image topology. In\nthis paper, we propose an optimization-based new framework called NODER, which\nleverages neural ordinary differential equations to capture complex underlying\ndynamics and reduces its high computational cost of handling high-dimensional\nimage volumes by introducing the latent space. We compare our NODER with two\nrecent regression methods, and the experimental results on ADNI and ACDC\ndatasets demonstrate that our method achieves the state-of-the-art performance\nin 3D image regression. Our model needs only a couple of images in a sequence\nfor prediction, which is practical, especially for clinical situations where\nextremely limited image time series are available for analysis. Our source code\nis available at https://github.com/ZedKing12138/NODER-pytorch.", "paper_summary_zh": "回歸醫療影像序列可以捕捉時間影像模式變化，並預測遺失或未來時間點的影像。然而，現有的測地線迴歸方法限制其迴歸效能，因為其強烈依賴線性動態的基本假設，而基於擴散的方法則具有很高的運算成本，而且缺乏保留影像拓撲的約束。在本文中，我們提出一個稱為 NODER 的基於最佳化的全新架構，它利用神經常微分方程式來捕捉複雜的底層動態，並透過引入潛在空間來降低處理高維度影像體積的高運算成本。我們將 NODER 與兩種最近的迴歸方法進行比較，在 ADNI 和 ACDC 資料集上的實驗結果證明，我們的模型在 3D 影像迴歸中取得了最先進的效能。我們的模型只需要序列中幾個影像即可進行預測，這很實用，特別是在臨床情況下，極其有限的影像時間序列可供分析。我們的原始程式碼可在 https://github.com/ZedKing12138/NODER-pytorch 取得。", "author": "Hao Bai et.al.", "authors": "Hao Bai, Yi Hong", "id": "2407.13241v1", "paper_url": "http://arxiv.org/abs/2407.13241v1", "repo": "null"}}