{"2408.08041": {"publish_time": "2024-08-15", "title": "The Clever Hans Effect in Unsupervised Learning", "paper_summary": "Unsupervised learning has become an essential building block of AI systems.\nThe representations it produces, e.g. in foundation models, are critical to a\nwide variety of downstream applications. It is therefore important to carefully\nexamine unsupervised models to ensure not only that they produce accurate\npredictions, but also that these predictions are not \"right for the wrong\nreasons\", the so-called Clever Hans (CH) effect. Using specially developed\nExplainable AI techniques, we show for the first time that CH effects are\nwidespread in unsupervised learning. Our empirical findings are enriched by\ntheoretical insights, which interestingly point to inductive biases in the\nunsupervised learning machine as a primary source of CH effects. Overall, our\nwork sheds light on unexplored risks associated with practical applications of\nunsupervised learning and suggests ways to make unsupervised learning more\nrobust.", "paper_summary_zh": "無監督式學習已成為人工智慧系統的基石。\n它產生的表徵（例如在基礎模型中）對於廣泛的下游應用至關重要。因此，仔細檢查無監督式模型以確保它們不僅產生準確的預測，而且這些預測並非「錯誤的原因導致正確的結果」，也就是所謂的克萊佛漢斯 (CH) 效應，這非常重要。我們使用特別開發的可解釋人工智慧技術，首次證明 CH 效應在無監督式學習中普遍存在。我們的實證發現豐富了理論見解，有趣的是，這些見解指出無監督式學習機器中的歸納偏誤是 CH 效應的主要來源。總的來說，我們的研究揭露了與無監督式學習的實際應用相關的未知風險，並提出讓無監督式學習更強健的方法。", "author": "Jacob Kauffmann et.al.", "authors": "Jacob Kauffmann, Jonas Dippel, Lukas Ruff, Wojciech Samek, Klaus-Robert Müller, Grégoire Montavon", "id": "2408.08041v1", "paper_url": "http://arxiv.org/abs/2408.08041v1", "repo": "null"}}