{"2501.17207": {"publish_time": "2025-01-28", "title": "Rethinking Functional Brain Connectome Analysis: Do Graph Deep Learning Models Help?", "paper_summary": "Functional brain connectome is crucial for deciphering the neural mechanisms\nunderlying cognitive functions and neurological disorders. Graph deep learning\nmodels have recently gained tremendous popularity in this field. However, their\nactual effectiveness in modeling the brain connectome remains unclear. In this\nstudy, we re-examine graph deep learning models based on four large-scale\nneuroimaging studies encompassing diverse cognitive and clinical outcomes.\nSurprisingly, we find that the message aggregation mechanism, a hallmark of\ngraph deep learning models, does not help with predictive performance as\ntypically assumed, but rather consistently degrades it. To address this issue,\nwe propose a hybrid model combining a linear model with a graph attention\nnetwork through dual pathways, achieving robust predictions and enhanced\ninterpretability by revealing both localized and global neural connectivity\npatterns. Our findings urge caution in adopting complex deep learning models\nfor functional brain connectome analysis, emphasizing the need for rigorous\nexperimental designs to establish tangible performance gains and perhaps more\nimportantly, to pursue improvements in model interpretability.", "paper_summary_zh": "功能性腦連接體對於破譯認知功能和神經疾病背後的機制至關重要。圖形深度學習模型最近在這個領域獲得極大的歡迎。然而，它們在建模腦連接體的實際效能仍不明確。在這項研究中，我們根據四項涵蓋不同認知和臨床結果的大規模神經影像研究，重新檢視圖形深度學習模型。令人驚訝的是，我們發現訊息聚合機制（圖形深度學習模型的標誌）並不像通常假設的那樣有助於預測效能，反而持續降低效能。為了解決這個問題，我們提出一個混合模型，透過雙路徑結合線性模型與圖形注意力網路，達成穩健的預測和增強的可解釋性，方法是揭露局部和整體的神經連接模式。我們的發現敦促在採用複雜的深度學習模型進行功能性腦連接體分析時保持謹慎，強調需要嚴謹的實驗設計，以建立具體的效能增益，或許更重要的是，追求模型可解釋性的改進。", "author": "Keqi Han et.al.", "authors": "Keqi Han, Yao Su, Lifang He, Liang Zhan, Sergey Plis, Vince Calhoun, Carl Yang", "id": "2501.17207v1", "paper_url": "http://arxiv.org/abs/2501.17207v1", "repo": "https://github.com/learningkeqi/rethinkingbca"}}