{"2406.15268": {"publish_time": "2024-06-21", "title": "Towards Robust Training Datasets for Machine Learning with Ontologies: A Case Study for Emergency Road Vehicle Detection", "paper_summary": "Countless domains rely on Machine Learning (ML) models, including\nsafety-critical domains, such as autonomous driving, which this paper focuses\non. While the black box nature of ML is simply a nuisance in some domains, in\nsafety-critical domains, this makes ML models difficult to trust. To fully\nutilize ML models in safety-critical domains, it would be beneficial to have a\nmethod to improve trust in model robustness and accuracy without human experts\nchecking each decision. This research proposes a method to increase trust in ML\nmodels used in safety-critical domains by ensuring the robustness and\ncompleteness of the model's training dataset. Because ML models embody what\nthey are trained with, ensuring the completeness of training datasets can help\nto increase the trust in the training of ML models. To this end, this paper\nproposes the use of a domain ontology and an image quality characteristic\nontology to validate the domain completeness and image quality robustness of a\ntraining dataset. This research also presents an experiment as a proof of\nconcept for this method, where ontologies are built for the emergency road\nvehicle domain.", "paper_summary_zh": "無數領域都依賴機器學習 (ML) 模型，包括本文重點關注的自動駕駛等安全關鍵領域。儘管 ML 的黑箱性質在某些領域僅僅是一種麻煩，但在安全關鍵領域，這使得 ML 模型難以讓人信賴。為在安全關鍵領域充分利用 ML 模型，最好有一種方法來提高對模型健壯性和準確性的信賴，而無需人工專家檢查每個決策。本研究提出了一種方法，通過確保模型訓練資料集的健壯性和完整性，來提高對用於安全關鍵領域的 ML 模型的信賴。由於 ML 模型體現了它們的訓練內容，因此確保訓練資料集的完整性有助於提高對 ML 模型訓練的信賴。為此，本文提出了使用領域本体和圖像品質特徵本体來驗證訓練資料集的領域完整性和圖像品質健壯性。本研究還提出了一個實驗作為此方法的概念驗證，其中為緊急道路車輛領域構建了本体。", "author": "Lynn Vonderhaar et.al.", "authors": "Lynn Vonderhaar, Timothy Elvira, Tyler Procko, Omar Ochoa", "id": "2406.15268v1", "paper_url": "http://arxiv.org/abs/2406.15268v1", "repo": "null"}}