{"2410.21641": {"publish_time": "2024-10-29", "title": "RDSinger: Reference-based Diffusion Network for Singing Voice Synthesis", "paper_summary": "Singing voice synthesis (SVS) aims to produce high-fidelity singing audio\nfrom music scores, requiring a detailed understanding of notes, pitch, and\nduration, unlike text-to-speech tasks. Although diffusion models have shown\nexceptional performance in various generative tasks like image and video\ncreation, their application in SVS is hindered by time complexity and the\nchallenge of capturing acoustic features, particularly during pitch\ntransitions. Some networks learn from the prior distribution and use the\ncompressed latent state as a better start in the diffusion model, but the\ndenoising step doesn't consistently improve quality over the entire duration.\nWe introduce RDSinger, a reference-based denoising diffusion network that\ngenerates high-quality audio for SVS tasks. Our approach is inspired by Animate\nAnyone, a diffusion image network that maintains intricate appearance features\nfrom reference images. RDSinger utilizes FastSpeech2 mel-spectrogram as a\nreference to mitigate denoising step artifacts. Additionally, existing models\ncould be influenced by misleading information on the compressed latent state\nduring pitch transitions. We address this issue by applying Gaussian blur on\npartial reference mel-spectrogram and adjusting loss weights in these regions.\nExtensive ablation studies demonstrate the efficiency of our method.\nEvaluations on OpenCpop, a Chinese singing dataset, show that RDSinger\noutperforms current state-of-the-art SVS methods in performance.", "paper_summary_zh": "歌唱聲音合成 (SVS) 旨在根據樂譜產生高保真歌唱音訊，需要詳細了解音符、音高和時長，這與文字轉語音任務不同。儘管擴散模型在各種生成任務（例如影像和影片建立）中表現出色，但其在 SVS 中的應用受到時間複雜度和擷取音響特徵的挑戰所阻礙，尤其是在音高轉換期間。有些網路會從先驗分佈中學習，並使用壓縮潛在狀態作為擴散模型中更好的起點，但去噪步驟並未在整個時長中持續改善品質。我們引入了 RDSinger，這是一個基於參考的去噪擴散網路，可為 SVS 任務產生高品質音訊。我們的做法靈感來自 Animate Anyone，這是一個擴散影像網路，可從參考影像中保留複雜的外觀特徵。RDSinger 利用 FastSpeech2 mel-spectrogram 作為參考，以減輕去噪步驟的偽影。此外，現有模型可能會受到壓縮潛在狀態中音高轉換期間的誤導資訊影響。我們透過對部分參考 mel-spectrogram 應用高斯模糊並調整這些區域中的損失權重來解決此問題。廣泛的消融研究證明了我們方法的效率。在中文歌唱資料集 OpenCpop 上的評估顯示，RDSinger 在效能上優於目前的 SVS 最先進方法。", "author": "Kehan Sui et.al.", "authors": "Kehan Sui, Jinxu Xiang, Fang Jin", "id": "2410.21641v1", "paper_url": "http://arxiv.org/abs/2410.21641v1", "repo": "null"}}