{"2502.17422": {"publish_time": "2025-02-24", "title": "MLLMs Know Where to Look: Training-free Perception of Small Visual Details with Multimodal LLMs", "paper_summary": "Multimodal Large Language Models (MLLMs) have experienced rapid progress in\nvisual recognition tasks in recent years. Given their potential integration\ninto many critical applications, it is important to understand the limitations\nof their visual perception. In this work, we study whether MLLMs can perceive\nsmall visual details as effectively as large ones when answering questions\nabout images. We observe that their performance is very sensitive to the size\nof the visual subject of the question, and further show that this effect is in\nfact causal by conducting an intervention study. Next, we study the attention\npatterns of MLLMs when answering visual questions, and intriguingly find that\nthey consistently know where to look, even when they provide the wrong answer.\nBased on these findings, we then propose training-free visual intervention\nmethods that leverage the internal knowledge of any MLLM itself, in the form of\nattention and gradient maps, to enhance its perception of small visual details.\nWe evaluate our proposed methods on two widely-used MLLMs and seven visual\nquestion answering benchmarks and show that they can significantly improve\nMLLMs' accuracy without requiring any training. Our results elucidate the risk\nof applying MLLMs to visual recognition tasks concerning small details and\nindicate that visual intervention using the model's internal state is a\npromising direction to mitigate this risk.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 近年来在视觉识别任务中取得了飞速进展。鉴于其可能集成到许多关键应用中，了解其视觉感知的局限性非常重要。在这项工作中，我们研究了 MLLM 在回答有关图像的问题时是否能像识别大型视觉细节一样有效地感知小型视觉细节。我们观察到，其性能对问题视觉主体的尺寸非常敏感，并进一步通过进行干预研究表明这种影响实际上是因果关系。接下来，我们研究了 MLLM 在回答视觉问题时的注意力模式，并有趣地发现，即使它们给出了错误的答案，它们也始终知道在哪里寻找。基于这些发现，我们随后提出了无训练视觉干预方法，该方法利用 MLLM 本身的内部知识（以注意力和梯度图的形式）来增强其对小型视觉细节的感知。我们在两个广泛使用的 MLLM 和七个视觉问题回答基准上评估了我们提出的方法，并表明它们可以在不需要任何训练的情况下显著提高 MLLM 的准确性。我们的结果阐明了将 MLLM 应用于涉及小细节的视觉识别任务的风险，并表明使用模型内部状态的视觉干预是降低这种风险的一个有希望的方向。", "author": "Jiarui Zhang et.al.", "authors": "Jiarui Zhang, Mahyar Khayatkhoei, Prateek Chhikara, Filip Ilievski", "id": "2502.17422v1", "paper_url": "http://arxiv.org/abs/2502.17422v1", "repo": "null"}}