{"2408.14307": {"publish_time": "2024-08-26", "title": "LLM-3D Print: Large Language Models To Monitor and Control 3D Printing", "paper_summary": "Industry 4.0 has revolutionized manufacturing by driving digitalization and\nshifting the paradigm toward additive manufacturing (AM). Fused Deposition\nModeling (FDM), a key AM technology, enables the creation of highly customized,\ncost-effective products with minimal material waste through layer-by-layer\nextrusion, posing a significant challenge to traditional subtractive methods.\nHowever, the susceptibility of material extrusion techniques to errors often\nrequires expert intervention to detect and mitigate defects that can severely\ncompromise product quality. While automated error detection and machine\nlearning models exist, their generalizability across diverse 3D printer setups,\nfirmware, and sensors is limited, and deep learning methods require extensive\nlabeled datasets, hindering scalability and adaptability. To address these\nchallenges, we present a process monitoring and control framework that\nleverages pre-trained Large Language Models (LLMs) alongside 3D printers to\ndetect and address printing defects. The LLM evaluates print quality by\nanalyzing images captured after each layer or print segment, identifying\nfailure modes and querying the printer for relevant parameters. It then\ngenerates and executes a corrective action plan. We validated the effectiveness\nof the proposed framework in identifying defects by comparing it against a\ncontrol group of engineers with diverse AM expertise. Our evaluation\ndemonstrated that LLM-based agents not only accurately identify common 3D\nprinting errors, such as inconsistent extrusion, stringing, warping, and layer\nadhesion, but also effectively determine the parameters causing these failures\nand autonomously correct them without any need for human intervention.", "paper_summary_zh": "工業 4.0 透過推動數位化並將典範轉移到增材製造 (AM) 而徹底改變了製造業。熔融沉積建模 (FDM) 是一項關鍵的 AM 技術，可透過逐層擠壓來建立高度客製化、成本效益高的產品，且材料浪費極少，對傳統的減材法構成重大挑戰。然而，材料擠壓技術容易發生錯誤，因此經常需要專家介入來偵測並減輕可能會嚴重損害產品品質的缺陷。雖然有自動化錯誤偵測和機器學習模型，但它們在不同的 3D 印表機設定、韌體和感測器之間的普遍性有限，而且深度學習方法需要大量的標籤化資料集，這會阻礙可擴充性和適應性。為了應對這些挑戰，我們提出了一個製程監控和控制架構，它利用預先訓練的大語言模型 (LLM) 和 3D 印表機來偵測和處理列印缺陷。LLM 透過分析在每層或列印區段後擷取的影像來評估列印品質，識別故障模式並查詢印表機以取得相關參數。然後，它會產生並執行一個修正動作計畫。我們透過將提議的架構與具備不同 AM 專業知識的工程師控制組進行比較，驗證了其在識別缺陷方面的有效性。我們的評估顯示，基於 LLM 的代理程式不僅可以準確識別常見的 3D 列印錯誤，例如不一致的擠壓、牽絲、翹曲和層黏著，還能有效地確定造成這些故障的參數，並在無需人工介入的情況下自動修正它們。", "author": "Yayati Jadhav et.al.", "authors": "Yayati Jadhav, Peter Pak, Amir Barati Farimani", "id": "2408.14307v1", "paper_url": "http://arxiv.org/abs/2408.14307v1", "repo": "null"}}