{"2411.07760": {"publish_time": "2024-11-12", "title": "Navigation with QPHIL: Quantizing Planner for Hierarchical Implicit Q-Learning", "paper_summary": "Offline Reinforcement Learning (RL) has emerged as a powerful alternative to\nimitation learning for behavior modeling in various domains, particularly in\ncomplex navigation tasks. An existing challenge with Offline RL is the\nsignal-to-noise ratio, i.e. how to mitigate incorrect policy updates due to\nerrors in value estimates. Towards this, multiple works have demonstrated the\nadvantage of hierarchical offline RL methods, which decouples high-level path\nplanning from low-level path following. In this work, we present a novel\nhierarchical transformer-based approach leveraging a learned quantizer of the\nspace. This quantization enables the training of a simpler zone-conditioned\nlow-level policy and simplifies planning, which is reduced to discrete\nautoregressive prediction. Among other benefits, zone-level reasoning in\nplanning enables explicit trajectory stitching rather than implicit stitching\nbased on noisy value function estimates. By combining this transformer-based\nplanner with recent advancements in offline RL, our proposed approach achieves\nstate-of-the-art results in complex long-distance navigation environments.", "paper_summary_zh": "離線強化學習 (RL) 已成為各種領域中行為建模的強大替代方案，特別是在複雜的導航任務中。離線 RL 現有的挑戰是訊號雜訊比，亦即如何因應價值估計中的錯誤而減輕不正確的政策更新。為此，多項研究已證明分層離線 RL 方法的優點，它將高階路徑規劃與低階路徑追蹤分開。在這項研究中，我們提出了一種新穎的分層Transformer方法，它利用空間的學習量化器。此量化能夠訓練更簡單的區域條件低階政策，並簡化規劃，而規劃則簡化為離散自迴歸預測。在其他好處中，規劃中的區域級推理能執行明確的軌跡拼接，而不是基於有雜訊的價值函數估計的隱式拼接。透過將此基於Transformer的規劃器與離線 RL 的最新進展相結合，我們提出的方法在複雜的長距離導航環境中達到了最先進的結果。", "author": "Alexi Canesse et.al.", "authors": "Alexi Canesse, Mathieu Petitbois, Ludovic Denoyer, Sylvain Lamprier, Rémy Portelas", "id": "2411.07760v1", "paper_url": "http://arxiv.org/abs/2411.07760v1", "repo": "null"}}