{"2407.11359": {"publish_time": "2024-07-16", "title": "Feature Inference Attack on Shapley Values", "paper_summary": "As a solution concept in cooperative game theory, Shapley value is highly\nrecognized in model interpretability studies and widely adopted by the leading\nMachine Learning as a Service (MLaaS) providers, such as Google, Microsoft, and\nIBM. However, as the Shapley value-based model interpretability methods have\nbeen thoroughly studied, few researchers consider the privacy risks incurred by\nShapley values, despite that interpretability and privacy are two foundations\nof machine learning (ML) models.\n  In this paper, we investigate the privacy risks of Shapley value-based model\ninterpretability methods using feature inference attacks: reconstructing the\nprivate model inputs based on their Shapley value explanations. Specifically,\nwe present two adversaries. The first adversary can reconstruct the private\ninputs by training an attack model based on an auxiliary dataset and black-box\naccess to the model interpretability services. The second adversary, even\nwithout any background knowledge, can successfully reconstruct most of the\nprivate features by exploiting the local linear correlations between the model\ninputs and outputs. We perform the proposed attacks on the leading MLaaS\nplatforms, i.e., Google Cloud, Microsoft Azure, and IBM aix360. The\nexperimental results demonstrate the vulnerability of the state-of-the-art\nShapley value-based model interpretability methods used in the leading MLaaS\nplatforms and highlight the significance and necessity of designing\nprivacy-preserving model interpretability methods in future studies. To our\nbest knowledge, this is also the first work that investigates the privacy risks\nof Shapley values.", "paper_summary_zh": "作為合作博弈論中的解決概念，Shapley 值在模型可解釋性研究中受到高度重視，並被 Google、Microsoft 和 IBM 等領先的機器學習即服務 (MLaaS) 供應商廣泛採用。然而，儘管基於 Shapley 值的模型可解釋性方法已得到深入研究，但很少有研究人員考慮 Shapley 值帶來的隱私風險，儘管可解釋性和隱私是機器學習 (ML) 模型的兩個基礎。在本文中，我們使用特徵推論攻擊來研究基於 Shapley 值的模型可解釋性方法的隱私風險：根據其 Shapley 值解釋重建私有模型輸入。具體來說，我們提出了兩個對手。第一個對手可以通過基於輔助數據集訓練攻擊模型並黑盒訪問模型可解釋性服務來重建私有輸入。第二個對手，即使沒有任何背景知識，也可以通過利用模型輸入和輸出之間的局部線性相關性成功重建大部分私有特徵。我們在領先的 MLaaS 平台（即 Google Cloud、Microsoft Azure 和 IBM aix360）上執行提議的攻擊。實驗結果證明了領先的 MLaaS 平台中使用的基於 Shapley 值的最新模型可解釋性方法的脆弱性，並強調了在未來的研究中設計隱私保護模型可解釋性方法的重要性與必要性。據我們所知，這也是第一個研究 Shapley 值的隱私風險的工作。", "author": "Xinjian Luo et.al.", "authors": "Xinjian Luo, Yangfan Jiang, Xiaokui Xiao", "id": "2407.11359v1", "paper_url": "http://arxiv.org/abs/2407.11359v1", "repo": "null"}}