{"2410.03741": {"publish_time": "2024-10-01", "title": "Towards Democratization of Subspeciality Medical Expertise", "paper_summary": "The scarcity of subspecialist medical expertise, particularly in rare,\ncomplex and life-threatening diseases, poses a significant challenge for\nhealthcare delivery. This issue is particularly acute in cardiology where\ntimely, accurate management determines outcomes. We explored the potential of\nAMIE (Articulate Medical Intelligence Explorer), a large language model\n(LLM)-based experimental AI system optimized for diagnostic dialogue, to\npotentially augment and support clinical decision-making in this challenging\ncontext. We curated a real-world dataset of 204 complex cases from a\nsubspecialist cardiology practice, including results for electrocardiograms,\nechocardiograms, cardiac MRI, genetic tests, and cardiopulmonary stress tests.\nWe developed a ten-domain evaluation rubric used by subspecialists to evaluate\nthe quality of diagnosis and clinical management plans produced by general\ncardiologists or AMIE, the latter enhanced with web-search and self-critique\ncapabilities. AMIE was rated superior to general cardiologists for 5 of the 10\ndomains (with preference ranging from 9% to 20%), and equivalent for the rest.\nAccess to AMIE's response improved cardiologists' overall response quality in\n63.7% of cases while lowering quality in just 3.4%. Cardiologists' responses\nwith access to AMIE were superior to cardiologist responses without access to\nAMIE for all 10 domains. Qualitative examinations suggest AMIE and general\ncardiologist could complement each other, with AMIE thorough and sensitive,\nwhile general cardiologist concise and specific. Overall, our results suggest\nthat specialized medical LLMs have the potential to augment general\ncardiologists' capabilities by bridging gaps in subspecialty expertise, though\nfurther research and validation are essential for wide clinical utility.", "paper_summary_zh": "<paragraph>在罕见、复杂且危及生命的疾病中，特别是缺乏次专科医学专业知识，这对医疗保健的提供构成了重大挑战。此问题在心脏病学中尤为严重，因为及时的准确管理决定了结果。我们探索了 AMIE（Articulate Medical Intelligence Explorer）的潜力，它是一种基于大语言模型 (LLM) 的实验性人工智能系统，针对诊断对话进行了优化，可以增强和支持在这种具有挑战性的情况下进行临床决策。我们从次专科心脏病实践中整理了一个包含 204 个复杂病例的真实世界数据集，包括心电图、超声心动图、心脏核磁共振、基因检测和心肺压力测试的结果。我们制定了一个由次专科医生使用的十个领域评估标准，用于评估普通心脏病专家或 AMIE 产生的诊断和临床管理计划的质量，后者通过网络搜索和自我批评能力得到了增强。在 10 个领域中，AMIE 被评为优于普通心脏病专家（偏好范围为 9% 至 20%），其余领域则相当。在 63.7% 的病例中，获得 AMIE 的回应改善了心脏病专家的整体回应质量，而在 3.4% 的病例中降低了质量。获得 AMIE 的心脏病专家的回应优于没有获得 AMIE 的心脏病专家的回应，适用于所有 10 个领域。定性检查表明，AMIE 和普通心脏病专家可以互为补充，AMIE 全面而敏感，而普通心脏病专家则简洁而具体。总体而言，我们的研究结果表明，专业的医学 LLM 有可能通过弥合次专科专业知识的差距来增强普通心脏病专家的能力，尽管进一步的研究和验证对于广泛的临床应用至关重要。</paragraph>", "author": "Jack W. O'Sullivan et.al.", "authors": "Jack W. O'Sullivan, Anil Palepu, Khaled Saab, Wei-Hung Weng, Yong Cheng, Emily Chu, Yaanik Desai, Aly Elezaby, Daniel Seung Kim, Roy Lan, Wilson Tang, Natalie Tapaskar, Victoria Parikh, Sneha S. Jain, Kavita Kulkarni, Philip Mansfield, Dale Webster, Juraj Gottweis, Joelle Barral, Mike Schaekermann, Ryutaro Tanno, S. Sara Mahdavi, Vivek Natarajan, Alan Karthikesalingam, Euan Ashley, Tao Tu", "id": "2410.03741v1", "paper_url": "http://arxiv.org/abs/2410.03741v1", "repo": "null"}}