{"2412.15188": {"publish_time": "2024-12-19", "title": "LlamaFusion: Adapting Pretrained Language Models for Multimodal Generation", "paper_summary": "We present LlamaFusion, a framework for empowering pretrained text-only large\nlanguage models (LLMs) with multimodal generative capabilities, enabling them\nto understand and generate both text and images in arbitrary sequences.\nLlamaFusion leverages existing Llama-3's weights for processing texts\nautoregressively while introducing additional and parallel transformer modules\nfor processing images with diffusion. During training, the data from each\nmodality is routed to its dedicated modules: modality-specific feedforward\nlayers, query-key-value projections, and normalization layers process each\nmodality independently, while the shared self-attention layers allow\ninteractions across text and image features. By freezing the text-specific\nmodules and only training the image-specific modules, LlamaFusion preserves the\nlanguage capabilities of text-only LLMs while developing strong visual\nunderstanding and generation abilities. Compared to methods that pretrain\nmultimodal generative models from scratch, our experiments demonstrate that,\nLlamaFusion improves image understanding by 20% and image generation by 3.6%\nusing only 50% of the FLOPs while maintaining Llama-3's language capabilities.\nWe also demonstrate that this framework can adapt existing vision-language\nmodels with multimodal generation ability. Overall, this framework not only\nleverages existing computational investments in text-only LLMs but also enables\nthe parallel development of language and vision capabilities, presenting a\npromising direction for efficient multimodal model development.", "paper_summary_zh": "<paragraph>我們提出了 LlamaFusion，一個用於賦予預訓練純文字大型語言模型 (LLM) 多模態生成功能的框架，使它們能夠理解並生成任意序列中的文字和影像。\nLlamaFusion 充分利用了現有 Llama-3 的權重來自動迴歸地處理文字，同時引入了額外的平行Transformer模組來處理影像擴散。在訓練期間，每個模態的資料都會路由到其專屬模組：模態特定的前饋層、查詢鍵值投影和正規化層會獨立處理每個模態，而共享的自我注意層則允許文字和影像特徵之間的互動。透過凍結文字特定模組並只訓練影像特定模組，LlamaFusion 保留了純文字 LLM 的語言能力，同時發展出強大的視覺理解和生成能力。與從頭開始預訓練多模態生成模型的方法相比，我們的實驗證明，LlamaFusion 在僅使用 50% 的 FLOP 的情況下，將影像理解力提升了 20%，影像生成能力提升了 3.6%，同時維持了 Llama-3 的語言能力。我們也證明了這個框架可以讓現有的視覺語言模型適應多模態生成能力。總的來說，這個框架不僅利用了在純文字 LLM 上既有的運算投資，也讓語言和視覺能力可以平行發展，為高效的多模態模型開發展示了一個有前景的方向。</paragraph>", "author": "Weijia Shi et.al.", "authors": "Weijia Shi, Xiaochuang Han, Chunting Zhou, Weixin Liang, Xi Victoria Lin, Luke Zettlemoyer, Lili Yu", "id": "2412.15188v1", "paper_url": "http://arxiv.org/abs/2412.15188v1", "repo": "null"}}