{"2501.18741": {"publish_time": "2025-01-30", "title": "Synthetic Data Generation for Augmenting Small Samples", "paper_summary": "Small datasets are common in health research. However, the generalization\nperformance of machine learning models is suboptimal when the training datasets\nare small. To address this, data augmentation is one solution. Augmentation\nincreases sample size and is seen as a form of regularization that increases\nthe diversity of small datasets, leading them to perform better on unseen data.\nWe found that augmentation improves prognostic performance for datasets that:\nhave fewer observations, with smaller baseline AUC, have higher cardinality\ncategorical variables, and have more balanced outcome variables. No specific\ngenerative model consistently outperformed the others. We developed a decision\nsupport model that can be used to inform analysts if augmentation would be\nuseful. For seven small application datasets, augmenting the existing data\nresults in an increase in AUC between 4.31% (AUC from 0.71 to 0.75) and 43.23%\n(AUC from 0.51 to 0.73), with an average 15.55% relative improvement,\ndemonstrating the nontrivial impact of augmentation on small datasets\n(p=0.0078). Augmentation AUC was higher than resampling only AUC (p=0.016). The\ndiversity of augmented datasets was higher than the diversity of resampled\ndatasets (p=0.046).", "paper_summary_zh": "在健康研究中，小型数据集很常见。然而，当训练数据集较小时，机器学习模型的泛化性能并不理想。为了解决这个问题，数据增强是一种解决方案。增强增加了样本量，并被视为一种正则化形式，它增加了小型数据集的多样性，从而使其在未见数据上表现得更好。我们发现，增强提高了以下数据集的预测性能：具有较少的观测值、较小的基线 AUC、较高的基数分类变量以及更平衡的结果变量。没有特定的生成模型始终优于其他模型。我们开发了一个决策支持模型，可用于告知分析师增强是否有用。对于七个小型应用程序数据集，增强现有数据导致 AUC 增加 4.31%（AUC 从 0.71 增加到 0.75）和 43.23%（AUC 从 0.51 增加到 0.73），平均相对改进 15.55%，这表明了增强对小型数据集的非平凡影响（p=0.0078）。增强 AUC 高于仅重新采样的 AUC（p=0.016）。增强数据集的多样性高于重新采样数据集的多样性（p=0.046）。", "author": "Dan Liu et.al.", "authors": "Dan Liu, Samer El Kababji, Nicholas Mitsakakis, Lisa Pilgram, Thomas Walters, Mark Clemons, Greg Pond, Alaa El-Hussuna, Khaled El Emam", "id": "2501.18741v1", "paper_url": "http://arxiv.org/abs/2501.18741v1", "repo": "null"}}