{"2408.00640": {"publish_time": "2024-08-01", "title": "AMAES: Augmented Masked Autoencoder Pretraining on Public Brain MRI Data for 3D-Native Segmentation", "paper_summary": "This study investigates the impact of self-supervised pretraining of 3D\nsemantic segmentation models on a large-scale, domain-specific dataset. We\nintroduce BRAINS-45K, a dataset of 44,756 brain MRI volumes from public\nsources, the largest public dataset available, and revisit a number of design\nchoices for pretraining modern segmentation architectures by simplifying and\noptimizing state-of-the-art methods, and combining them with a novel\naugmentation strategy. The resulting AMAES framework is based on\nmasked-image-modeling and intensity-based augmentation reversal and balances\nmemory usage, runtime, and finetuning performance. Using the popular U-Net and\nthe recent MedNeXt architecture as backbones, we evaluate the effect of\npretraining on three challenging downstream tasks, covering single-sequence,\nlow-resource settings, and out-of-domain generalization. The results highlight\nthat pretraining on the proposed dataset with AMAES significantly improves\nsegmentation performance in the majority of evaluated cases, and that it is\nbeneficial to pretrain the model with augmentations, despite pretraing on a\nlarge-scale dataset. Code and model checkpoints for reproducing results, as\nwell as the BRAINS-45K dataset are available at\n\\url{https://github.com/asbjrnmunk/amaes}.", "paper_summary_zh": "本研究調查了 3D 語意分割模型的自我監督預訓練對大型特定領域資料集的影響。我們引入了 BRAINS-45K，這是一個包含來自公共來源的 44,756 個大腦 MRI 卷的資料集，是最大的公開資料集，並重新審視了現代分割架構預訓練的許多設計選擇，透過簡化和最佳化最先進的方法，並將其與新穎的擴充策略相結合。由此產生的 AMAES 框架基於遮罩影像建模和基於強度的擴充反轉，並平衡了記憶體使用量、執行時間和微調效能。使用流行的 U-Net 和最近的 MedNeXt 架構作為主幹，我們評估了預訓練對三個具有挑戰性的下游任務的影響，涵蓋單一序列、低資源設定和領域外概化。結果強調了使用 AMAES 在建議的資料集上進行預訓練，在評估案例中大部分顯著改善了分割效能，並且儘管在大規模資料集上進行預訓練，但使用擴充預訓練模型是有益的。重製結果的程式碼和模型檢查點，以及 BRAINS-45K 資料集可在\\url{https://github.com/asbjrnmunk/amaes} 取得。", "author": "Asbjørn Munk et.al.", "authors": "Asbjørn Munk, Jakob Ambsdorf, Sebastian Llambias, Mads Nielsen", "id": "2408.00640v1", "paper_url": "http://arxiv.org/abs/2408.00640v1", "repo": "null"}}