{"2407.04699": {"publish_time": "2024-07-05", "title": "LaRa: Efficient Large-Baseline Radiance Fields", "paper_summary": "Radiance field methods have achieved photorealistic novel view synthesis and\ngeometry reconstruction. But they are mostly applied in per-scene optimization\nor small-baseline settings. While several recent works investigate feed-forward\nreconstruction with large baselines by utilizing transformers, they all operate\nwith a standard global attention mechanism and hence ignore the local nature of\n3D reconstruction. We propose a method that unifies local and global reasoning\nin transformer layers, resulting in improved quality and faster convergence.\nOur model represents scenes as Gaussian Volumes and combines this with an image\nencoder and Group Attention Layers for efficient feed-forward reconstruction.\nExperimental results demonstrate that our model, trained for two days on four\nGPUs, demonstrates high fidelity in reconstructing 360&deg radiance fields, and\nrobustness to zero-shot and out-of-domain testing.", "paper_summary_zh": "輻射場方法已實現逼真的新視圖合成和幾何重建。但它們大多用於場景優化或小基線設置。儘管最近有幾項工作利用Transformer研究大基線的饋送前向重建，但它們都使用標準的全局注意力機制，因此忽略了 3D 重建的局部性質。我們提出了一種在Transformer層中統一局部和全局推理的方法，從而提高了品質並加快了收斂速度。我們的模型將場景表示為高斯體積，並將其與圖像編碼器和群組注意力層結合，以進行高效的饋送前向重建。實驗結果表明，我們的模型在四個 GPU 上訓練兩天，在重建 360 度輻射場方面表現出高保真度，並且對零次學習和域外測試具有魯棒性。", "author": "Anpei Chen et.al.", "authors": "Anpei Chen, Haofei Xu, Stefano Esposito, Siyu Tang, Andreas Geiger", "id": "2407.04699v1", "paper_url": "http://arxiv.org/abs/2407.04699v1", "repo": "null"}}