{"2405.14646": {"publish_time": "2024-05-23", "title": "Unveiling the Achilles' Heel of NLG Evaluators: A Unified Adversarial Framework Driven by Large Language Models", "paper_summary": "The automatic evaluation of natural language generation (NLG) systems\npresents a long-lasting challenge. Recent studies have highlighted various\nneural metrics that align well with human evaluations. Yet, the robustness of\nthese evaluators against adversarial perturbations remains largely\nunder-explored due to the unique challenges in obtaining adversarial data for\ndifferent NLG evaluation tasks. To address the problem, we introduce AdvEval, a\nnovel black-box adversarial framework against NLG evaluators. AdvEval is\nspecially tailored to generate data that yield strong disagreements between\nhuman and victim evaluators. Specifically, inspired by the recent success of\nlarge language models (LLMs) in text generation and evaluation, we adopt strong\nLLMs as both the data generator and gold evaluator. Adversarial data are\nautomatically optimized with feedback from the gold and victim evaluator. We\nconduct experiments on 12 victim evaluators and 11 NLG datasets, spanning tasks\nincluding dialogue, summarization, and question evaluation. The results show\nthat AdvEval can lead to significant performance degradation of various victim\nmetrics, thereby validating its efficacy.", "paper_summary_zh": "自然語言生成 (NLG) 系統的自動評估是一項長期的挑戰。最近的研究強調了各種與人類評估一致的神經指標。然而，由於在為不同的 NLG 評估任務獲取對抗性資料方面存在獨特挑戰，因此這些評估器對抗對抗性擾動的穩健性在很大程度上仍未得到探索。為了解決這個問題，我們引入了 AdvEval，一個針對 NLG 評估器的全新黑盒對抗性框架。AdvEval 專門用於生成在人類和受害者評估器之間產生強烈分歧的資料。具體來說，受大型語言模型 (LLM) 在文本生成和評估中近期成功的啟發，我們採用強大的 LLM 作為資料生成器和黃金評估器。對抗性資料會自動根據黃金和受害者評估器的回饋進行最佳化。我們對 12 個受害者評估器和 11 個 NLG 資料集進行了實驗，涵蓋對話、摘要和問題評估等任務。結果表明，AdvEval 可以導致各種受害者指標的效能顯著下降，從而驗證了其功效。", "author": "Yiming Chen et.al.", "authors": "Yiming Chen, Chen Zhang, Danqing Luo, Luis Fernando D'Haro, Robby T. Tan, Haizhou Li", "id": "2405.14646v1", "paper_url": "http://arxiv.org/abs/2405.14646v1", "repo": "null"}}