{"2410.08588": {"publish_time": "2024-10-11", "title": "ViT3D Alignment of LLaMA3: 3D Medical Image Report Generation", "paper_summary": "Automatic medical report generation (MRG), which aims to produce detailed\ntext reports from medical images, has emerged as a critical task in this\ndomain. MRG systems can enhance radiological workflows by reducing the time and\neffort required for report writing, thereby improving diagnostic efficiency. In\nthis work, we present a novel approach for automatic MRG utilizing a multimodal\nlarge language model. Specifically, we employed the 3D Vision Transformer\n(ViT3D) image encoder introduced from M3D-CLIP to process 3D scans and use the\nAsclepius-Llama3-8B as the language model to generate the text reports by\nauto-regressive decoding. The experiment shows our model achieved an average\nGreen score of 0.3 on the MRG task validation set and an average accuracy of\n0.61 on the visual question answering (VQA) task validation set, outperforming\nthe baseline model. Our approach demonstrates the effectiveness of the ViT3D\nalignment of LLaMA3 for automatic MRG and VQA tasks by tuning the model on a\nsmall dataset.", "paper_summary_zh": "自動化醫療報告生成 (MRG) 的目標是根據醫學影像產生詳細的文字報告，已成為此領域的一項重要任務。MRG 系統可以減少撰寫報告所需的時間和精力，從而提升放射科的工作流程，進而改善診斷效率。在這項工作中，我們提出了一種利用多模態大型語言模型進行自動化 MRG 的新方法。具體來說，我們採用了從 M3D-CLIP 引入的 3D 視覺Transformer (ViT3D) 影像編碼器來處理 3D 掃描，並使用 Asclepius-Llama3-8B 作為語言模型，透過自迴歸解碼來產生文字報告。實驗顯示，我們的模型在 MRG 任務驗證集上達到了平均 0.3 的 Green 分數，在視覺問答 (VQA) 任務驗證集上達到了平均 0.61 的準確率，優於基線模型。我們的做法證明了 ViT3D 對齊 LLaMA3 在自動化 MRG 和 VQA 任務中的有效性，方法是在小型資料集上調整模型。", "author": "Siyou Li et.al.", "authors": "Siyou Li, Beining Xu, Yihao Luo, Dong Nie, Le Zhang", "id": "2410.08588v1", "paper_url": "http://arxiv.org/abs/2410.08588v1", "repo": "null"}}