{"2409.18724": {"publish_time": "2024-09-27", "title": "Cross-Domain Keyword Extraction with Keyness Patterns", "paper_summary": "Domain dependence and annotation subjectivity pose challenges for supervised\nkeyword extraction. Based on the premises that second-order keyness patterns\nare existent at the community level and learnable from annotated keyword\nextraction datasets, this paper proposes a supervised ranking approach to\nkeyword extraction that ranks keywords with keyness patterns consisting of\nindependent features (such as sublanguage domain and term length) and three\ncategories of dependent features -- heuristic features, specificity features,\nand representavity features. The approach uses two convolutional-neural-network\nbased models to learn keyness patterns from keyword datasets and overcomes\nannotation subjectivity by training the two models with bootstrap sampling\nstrategy. Experiments demonstrate that the approach not only achieves\nstate-of-the-art performance on ten keyword datasets in general supervised\nkeyword extraction with an average top-10-F-measure of 0.316 , but also robust\ncross-domain performance with an average top-10-F-measure of 0.346 on four\ndatasets that are excluded in the training process. Such cross-domain\nrobustness is attributed to the fact that community-level keyness patterns are\nlimited in number and temperately independent of language domains, the\ndistinction between independent features and dependent features, and the\nsampling training strategy that balances excess risk and lack of negative\ntraining data.", "paper_summary_zh": "領域依賴性和標註主觀性對監督式關鍵字萃取構成挑戰。本文基於以下前提：次序關鍵模式存在於社群層級，且可以從標註的關鍵字萃取資料集學習，提出一個監督式排名方法來進行關鍵字萃取，該方法使用包含獨立特徵（例如次語言領域和術語長度）和三類依賴特徵（啟發式特徵、特異性特徵和代表性特徵）的關鍵模式對關鍵字進行排名。該方法使用兩個基於卷積神經網路的模型從關鍵字資料集學習關鍵模式，並透過引導取樣策略訓練兩個模型來克服標註主觀性。實驗證明，該方法不僅在一般監督式關鍵字萃取中對十個關鍵字資料集獲得了最先進的效能，平均前 10 名 F 值為 0.316，而且在四個訓練過程中排除的資料集上也獲得了穩健的跨領域效能，平均前 10 名 F 值為 0.346。這種跨領域的穩健性歸因於以下事實：社群層級的關鍵模式數量有限，且與語言領域的關聯性較低，獨立特徵和依賴特徵之間的區別，以及平衡過度風險和缺乏負面訓練資料的取樣訓練策略。", "author": "Dongmei Zhou et.al.", "authors": "Dongmei Zhou, Xuri Tang", "id": "2409.18724v1", "paper_url": "http://arxiv.org/abs/2409.18724v1", "repo": "null"}}