{"2410.13441": {"publish_time": "2024-10-17", "title": "Instruction-Driven Game Engine: A Poker Case Study", "paper_summary": "The Instruction-Driven Game Engine (IDGE) project aims to democratize game\ndevelopment by enabling a large language model (LLM) to follow free-form game\ndescriptions and generate game-play processes. The IDGE allows users to create\ngames simply by natural language instructions, which significantly lowers the\nbarrier for game development. We approach the learning process for IDGEs as a\nNext State Prediction task, wherein the model autoregressively predicts the\ngame states given player actions. The computation of game states must be\nprecise; otherwise, slight errors could corrupt the game-play experience. This\nis challenging because of the gap between stability and diversity. To address\nthis, we train the IDGE in a curriculum manner that progressively increases its\nexposure to complex scenarios. Our initial progress lies in developing an IDGE\nfor Poker, which not only supports a wide range of poker variants but also\nallows for highly individualized new poker games through natural language\ninputs. This work lays the groundwork for future advancements in transforming\nhow games are created and played.", "paper_summary_zh": "指令驅動遊戲引擎 (IDGE) 計畫旨在透過讓大型語言模型 (LLM) 遵循自由形式的遊戲描述並產生遊戲玩法流程，來民主化遊戲開發。IDGE 允許使用者僅透過自然語言指令來建立遊戲，這大幅降低了遊戲開發的門檻。我們將 IDGE 的學習過程視為一個下一個狀態預測任務，其中模型會根據玩家動作自動迴歸預測遊戲狀態。遊戲狀態的計算必須精確；否則，輕微的錯誤可能會破壞遊戲體驗。由於穩定性和多樣性之間的差距，這具有挑戰性。為了解決這個問題，我們以課程方式訓練 IDGE，逐漸增加它接觸複雜場景的機會。我們最初的進展在於為撲克開發一個 IDGE，它不僅支援各種撲克變體，還允許透過自然語言輸入建立高度個性化的全新撲克遊戲。這項工作為未來在轉變遊戲建立和遊玩方式方面奠定了基礎。", "author": "Hongqiu Wu et.al.", "authors": "Hongqiu Wu, Xingyuan Liu, Yan Wang, Hai Zhao", "id": "2410.13441v1", "paper_url": "http://arxiv.org/abs/2410.13441v1", "repo": "null"}}