{"2501.11733": {"publish_time": "2025-01-20", "title": "Mobile-Agent-E: Self-Evolving Mobile Assistant for Complex Tasks", "paper_summary": "Smartphones have become indispensable in modern life, yet navigating complex\ntasks on mobile devices often remains frustrating. Recent advancements in large\nmultimodal model (LMM)-based mobile agents have demonstrated the ability to\nperceive and act in mobile environments. However, current approaches face\nsignificant limitations: they fall short in addressing real-world human needs,\nstruggle with reasoning-intensive and long-horizon tasks, and lack mechanisms\nto learn and improve from prior experiences. To overcome these challenges, we\nintroduce Mobile-Agent-E, a hierarchical multi-agent framework capable of\nself-evolution through past experience. By hierarchical, we mean an explicit\nseparation of high-level planning and low-level action execution. The framework\ncomprises a Manager, responsible for devising overall plans by breaking down\ncomplex tasks into subgoals, and four subordinate agents--Perceptor, Operator,\nAction Reflector, and Notetaker--which handle fine-grained visual perception,\nimmediate action execution, error verification, and information aggregation,\nrespectively. Mobile-Agent-E also features a novel self-evolution module which\nmaintains a persistent long-term memory comprising Tips and Shortcuts. Tips are\ngeneral guidance and lessons learned from prior tasks on how to effectively\ninteract with the environment. Shortcuts are reusable, executable sequences of\natomic operations tailored for specific subroutines. The inclusion of Tips and\nShortcuts facilitates continuous refinement in performance and efficiency.\nAlongside this framework, we introduce Mobile-Eval-E, a new benchmark featuring\ncomplex mobile tasks requiring long-horizon, multi-app interactions. Empirical\nresults show that Mobile-Agent-E achieves a 22% absolute improvement over\nprevious state-of-the-art approaches across three foundation model backbones.\nProject page: https://x-plug.github.io/MobileAgent.", "paper_summary_zh": "智慧型手機在現代生活中已不可或缺，然而在行動裝置上執行複雜的任務往往令人沮喪。大型多模態模型 (LMM) 為基礎的行動代理程式在最近的進展中已展現出感知和在行動環境中執行的能力。然而，目前的作法面臨重大的限制：它們無法滿足現實世界中人類的需求、難以應付需要推理且時間跨度長的任務，而且缺乏從過往經驗中學習和改進的機制。為了克服這些挑戰，我們引入了 Mobile-Agent-E，這是一個分層多代理架構，能夠透過過往經驗自我演進。所謂分層，意指將高階規劃和低階動作執行明確分開。此架構包含一個管理員，負責透過將複雜任務分解成子目標來擬定整體計畫，以及四個從屬代理程式，分別為感知器、操作員、動作反射器和筆記員，負責處理細微的視覺感知、立即動作執行、錯誤驗證和資訊彙整。Mobile-Agent-E 也具備一個新穎的自我演進模組，維護一個持久的長期記憶，包含提示和捷徑。提示是從過往任務中學到的通用指導和教訓，說明如何有效與環境互動。捷徑是可以重複使用的可執行原子操作序列，專門用於特定子常式。包含提示和捷徑有助於持續改善效能和效率。除了這個架構，我們還引入了 Mobile-Eval-E，這是一個新的基準，包含需要長時間跨度、多應用程式互動的複雜行動任務。實證結果顯示，Mobile-Agent-E 在三個基礎模型骨幹上，比先前的最先進作法獲得了 22% 的絕對改善。專案頁面：https://x-plug.github.io/MobileAgent。", "author": "Zhenhailong Wang et.al.", "authors": "Zhenhailong Wang, Haiyang Xu, Junyang Wang, Xi Zhang, Ming Yan, Ji Zhang, Fei Huang, Heng Ji", "id": "2501.11733v1", "paper_url": "http://arxiv.org/abs/2501.11733v1", "repo": "null"}}