{"2501.01306": {"publish_time": "2025-01-02", "title": "Think More, Hallucinate Less: Mitigating Hallucinations via Dual Process of Fast and Slow Thinking", "paper_summary": "Large language models (LLMs) demonstrate exceptional capabilities, yet still\nface the hallucination issue. Typical text generation approaches adopt an\nauto-regressive generation without deliberate reasoning, which often results in\nuntrustworthy and factually inaccurate responses. In this paper, we propose\nHaluSearch, a novel framework that incorporates tree search-based algorithms\n(e.g. MCTS) to enable an explicit slow thinking generation process for\nmitigating hallucinations of LLMs during inference. Specifically, HaluSearch\nframes text generation as a step-by-step reasoning process, using a\nself-evaluation reward model to score each generation step and guide the tree\nsearch towards the most reliable generation pathway for fully exploiting the\ninternal knowledge of LLMs. To balance efficiency and quality, we introduce a\nhierarchical thinking system switch mechanism inspired by the dual process\ntheory in cognitive science, which dynamically alternates between fast and slow\nthinking modes at both the instance and step levels, adapting to the complexity\nof questions and reasoning states. We conduct extensive experiments on both\nEnglish and Chinese datasets and the results show that our approach\nsignificantly outperforms baseline approaches.", "paper_summary_zh": "大型語言模型 (LLM) 表現出非凡的能力，但仍面臨幻覺問題。典型的文字生成方法採用自動迴歸生成，沒有經過深思熟慮的推理，這通常會導致不可信和事實不正確的回應。在本文中，我們提出 HaluSearch，這是一個新的框架，它結合了基於樹狀搜尋的演算法（例如 MCTS），以啟用明確的慢速思考生成過程，以減輕 LLM 在推理期間的幻覺。具體來說，HaluSearch 將文字生成設定為一個逐步的推理過程，使用自我評估獎勵模型為每個生成步驟評分，並引導樹狀搜尋朝向最可靠的生成路徑，以充分利用 LLM 的內部知識。為了平衡效率和品質，我們引入了一個階層式思考系統切換機制，其靈感來自認知科學中的雙重過程理論，它在例項和步驟層級中動態交替快思考模式和慢思考模式，以適應問題和推理狀態的複雜性。我們對英語和中文資料集進行了廣泛的實驗，結果表明，我們的做法顯著優於基準方法。", "author": "Xiaoxue Cheng et.al.", "authors": "Xiaoxue Cheng, Junyi Li, Wayne Xin Zhao, Ji-Rong Wen", "id": "2501.01306v2", "paper_url": "http://arxiv.org/abs/2501.01306v2", "repo": "null"}}