{"2502.03724": {"publish_time": "2025-02-06", "title": "MD-BERT: Action Recognition in Dark Videos via Dynamic Multi-Stream Fusion and Temporal Modeling", "paper_summary": "Action recognition in dark, low-light (under-exposed) or noisy videos is a\nchallenging task due to visibility degradation, which can hinder critical\nspatiotemporal details. This paper proposes MD-BERT, a novel multi-stream\napproach that integrates complementary pre-processing techniques such as gamma\ncorrection and histogram equalization alongside raw dark frames to address\nthese challenges. We introduce the Dynamic Feature Fusion (DFF) module,\nextending existing attentional fusion methods to a three-stream setting,\nthereby capturing fine-grained and global contextual information across\ndifferent brightness and contrast enhancements. The fused spatiotemporal\nfeatures are then processed by a BERT-based temporal model, which leverages its\nbidirectional self-attention to effectively capture long-range dependencies and\ncontextual relationships across frames. Extensive experiments on the ARID V1.0\nand ARID V1.5 dark video datasets show that MD-BERT outperforms existing\nmethods, establishing a new state-of-the-art performance. Ablation studies\nfurther highlight the individual contributions of each input stream and the\neffectiveness of the proposed DFF and BERT modules. The official website of\nthis work is available at: https://github.com/HrishavBakulBarua/DarkBERT", "paper_summary_zh": "在黑暗、低光（曝光不足）或有雜訊的影片中進行動作辨識是一項具有挑戰性的任務，因為能見度降低，可能會阻礙關鍵的時空細節。這篇論文提出 MD-BERT，這是一種新穎的多串流方法，它整合了補充性的前處理技術，例如伽瑪校正和直方圖等化，以及原始的黑暗影像，以應對這些挑戰。我們引入了動態特徵融合 (DFF) 模組，將現有的注意力融合方法擴充套件到三串流設定，從而跨越不同的亮度和對比度增強來捕捉細粒度和全域性的脈絡資訊。接著，融合的時空特徵會由基於 BERT 的時序模型處理，它利用其雙向自我注意力來有效捕捉長距離的依存關係和影像之間的脈絡關係。在 ARID V1.0 和 ARID V1.5 黑暗影片資料集上進行的廣泛實驗顯示，MD-BERT 優於現有的方法，樹立了新的最先進效能。消融研究進一步突顯了每個輸入串流的個別貢獻，以及所提出的 DFF 和 BERT 模組的效能。這項工作的官方網站可在以下網址取得：https://github.com/HrishavBakulBarua/DarkBERT", "author": "Sharana Dharshikgan Suresh Dass et.al.", "authors": "Sharana Dharshikgan Suresh Dass, Hrishav Bakul Barua, Ganesh Krishnasamy, Raveendran Paramesran, Raphael C. -W. Phan", "id": "2502.03724v1", "paper_url": "http://arxiv.org/abs/2502.03724v1", "repo": "null"}}