{"2412.08127": {"publish_time": "2024-12-11", "title": "Evil twins are not that evil: Qualitative insights into machine-generated prompts", "paper_summary": "It has been widely observed that language models (LMs) respond in predictable\nways to algorithmically generated prompts that are seemingly unintelligible.\nThis is both a sign that we lack a full understanding of how LMs work, and a\npractical challenge, because opaqueness can be exploited for harmful uses of\nLMs, such as jailbreaking. We present the first thorough analysis of opaque\nmachine-generated prompts, or autoprompts, pertaining to 3 LMs of different\nsizes and families. We find that machine-generated prompts are characterized by\na last token that is often intelligible and strongly affects the generation. A\nsmall but consistent proportion of the previous tokens are fillers that\nprobably appear in the prompt as a by-product of the fact that the optimization\nprocess fixes the number of tokens. The remaining tokens tend to have at least\na loose semantic relation with the generation, although they do not engage in\nwell-formed syntactic relations with it. We find moreover that some of the\nablations we applied to machine-generated prompts can also be applied to\nnatural language sequences, leading to similar behavior, suggesting that\nautoprompts are a direct consequence of the way in which LMs process linguistic\ninputs in general.", "paper_summary_zh": "人們廣泛觀察到，語言模型 (LM) 以可預測的方式回應看似難以理解的演算法產生提示。這既是我們缺乏對 LM 工作方式的充分理解的跡象，也是一個實際挑戰，因為不透明性可能會被利用於 LM 的有害用途，例如越獄。我們針對 3 個不同大小和類型的 LM 提出首次對不透明機器產生的提示或自動提示的徹底分析。我們發現機器產生的提示的特徵是最後一個通常可以理解且強烈影響生成的標記。前一個標記中有一小部分但一致的比例是填料，這些填料可能出現在提示中，因為最佳化過程固定了標記的數量。其餘標記往往與生成至少有鬆散的語義關係，儘管它們不會與生成建立良好的句法關係。此外，我們發現應用於機器產生的提示的一些消融也可以應用於自然語言序列，導致類似的行為，這表明自動提示是 LM 一般處理語言輸入的方式的直接結果。", "author": "Nathanaël Carraz Rakotonirina et.al.", "authors": "Nathanaël Carraz Rakotonirina, Corentin Kervadec, Francesca Franzon, Marco Baroni", "id": "2412.08127v1", "paper_url": "http://arxiv.org/abs/2412.08127v1", "repo": "null"}}