{"2501.10809": {"publish_time": "2025-01-18", "title": "Efficient Auto-Labeling of Large-Scale Poultry Datasets (ALPD) Using Semi-Supervised Models, Active Learning, and Prompt-then-Detect Approach", "paper_summary": "The rapid growth of AI in poultry farming has highlighted the challenge of\nefficiently labeling large, diverse datasets. Manual annotation is\ntime-consuming, making it impractical for modern systems that continuously\ngenerate data. This study explores semi-supervised auto-labeling methods,\nintegrating active learning, and prompt-then-detect paradigm to develop an\nefficient framework for auto-labeling of large poultry datasets aimed at\nadvancing AI-driven behavior and health monitoring. Viideo data were collected\nfrom broilers and laying hens housed at the University of Arkansas and the\nUniversity of Georgia. The collected videos were converted into images,\npre-processed, augmented, and labeled. Various machine learning models,\nincluding zero-shot models like Grounding DINO, YOLO-World, and CLIP, and\nsupervised models like YOLO and Faster-RCNN, were utilized for broilers, hens,\nand behavior detection. The results showed that YOLOv8s-World and YOLOv9s\nperformed better when compared performance metrics for broiler and hen\ndetection under supervised learning, while among the semi-supervised model,\nYOLOv8s-ALPD achieved the highest precision (96.1%) and recall (99.0%) with an\nRMSE of 1.9. The hybrid YOLO-World model, incorporating the optimal YOLOv8s\nbackbone, demonstrated the highest overall performance. It achieved a precision\nof 99.2%, recall of 99.4%, and an F1 score of 98.7% for breed detection,\nalongside a precision of 88.4%, recall of 83.1%, and an F1 score of 84.5% for\nindividual behavior detection. Additionally, semi-supervised models showed\nsignificant improvements in behavior detection, achieving up to 31% improvement\nin precision and 16% in F1-score. The semi-supervised models with minimal\nactive learning reduced annotation time by over 80% compared to full manual\nlabeling. Moreover, integrating zero-shot models enhanced detection and\nbehavior identification.", "paper_summary_zh": "<paragraph>家禽养殖中人工智能的快速增长凸显了高效标注大型、多样化数据集的挑战。手动标注非常耗时，对于持续生成数据的现代系统而言不切实际。本研究探索了半监督自动标注方法，集成了主动学习和提示再检测范式，以开发一个高效的框架，用于自动标注大型家禽数据集，旨在推进人工智能驱动的行为和健康监测。视频数据是从阿肯色大学和佐治亚大学饲养的肉鸡和蛋鸡中收集的。收集的视频被转换成图像，经过预处理、增强和标注。各种机器学习模型，包括 Grounding DINO、YOLO-World 和 CLIP 等零样本学习模型，以及 YOLO 和 Faster-RCNN 等监督模型，被用于肉鸡、母鸡和行为检测。结果表明，在监督学习下，YOLOv8s-World 和 YOLOv9s 在肉鸡和母鸡检测的性能指标比较中表现得更好，而在半监督模型中，YOLOv8s-ALPD 以 1.9 的 RMSE 实现了最高的精度 (96.1%) 和召回率 (99.0%)。结合了最佳 YOLOv8s 主干网络的混合 YOLO-World 模型展示了最高的整体性能。它在品种检测中实现了 99.2% 的精度、99.4% 的召回率和 98.7% 的 F1 分数，在个体行为检测中实现了 88.4% 的精度、83.1% 的召回率和 84.5% 的 F1 分数。此外，半监督模型在行为检测中显示出显著的改进，在精度上提高了 31%，在 F1 分数上提高了 16%。与完全手动标注相比，具有最少主动学习的半监督模型将标注时间减少了 80% 以上。此外，集成零样本学习模型增强了检测和行为识别。</paragraph>", "author": "Ramesh Bahadur Bist et.al.", "authors": "Ramesh Bahadur Bist, Lilong Chai, Shawna Weimer, Hannah Atungulua, Chantel Pennicott, Xiao Yang, Sachin Subedi, Chaitanya Pallerla, Yang Tian, Dongyi Wang", "id": "2501.10809v1", "paper_url": "http://arxiv.org/abs/2501.10809v1", "repo": "null"}}