{"2502.14502": {"publish_time": "2025-02-20", "title": "How Much Knowledge Can You Pack into a LoRA Adapter without Harming LLM?", "paper_summary": "The performance of Large Language Models (LLMs) on many tasks is greatly\nlimited by the knowledge learned during pre-training and stored in the model's\nparameters. Low-rank adaptation (LoRA) is a popular and efficient training\ntechnique for updating or domain-specific adaptation of LLMs. In this study, we\ninvestigate how new facts can be incorporated into the LLM using LoRA without\ncompromising the previously learned knowledge. We fine-tuned\nLlama-3.1-8B-instruct using LoRA with varying amounts of new knowledge. Our\nexperiments have shown that the best results are obtained when the training\ndata contains a mixture of known and new facts. However, this approach is still\npotentially harmful because the model's performance on external\nquestion-answering benchmarks declines after such fine-tuning. When the\ntraining data is biased towards certain entities, the model tends to regress to\nfew overrepresented answers. In addition, we found that the model becomes more\nconfident and refuses to provide an answer in only few cases. These findings\nhighlight the potential pitfalls of LoRA-based LLM updates and underscore the\nimportance of training data composition and tuning parameters to balance new\nknowledge integration and general model capabilities.", "paper_summary_zh": "大型語言模型 (LLM) 在許多任務上的表現受到預訓練期間學到的知識和儲存在模型參數中的知識的極大限制。低階適應 (LoRA) 是一種流行且有效的訓練技術，用於更新或 LLM 的特定領域適應。在這項研究中，我們探討如何使用 LoRA 將新事實納入 LLM，同時不損害先前學到的知識。我們使用不同數量的知識微調 Llama-3.1-8B-instruct。我們的實驗表明，當訓練資料包含已知和新事實的混合時，會獲得最佳結果。然而，這種方法仍然具有潛在的危害性，因為模型在外部問答基準上的表現會在這種微調後下降。當訓練資料偏向於某些實體時，模型傾向於回歸到少數過度表示的答案。此外，我們發現模型變得更有信心，並且在極少數情況下拒絕提供答案。這些發現突顯了基於 LoRA 的 LLM 更新的潛在缺點，並強調了訓練資料組成和調整參數以平衡新知識整合和一般模型能力的重要性。", "author": "Sergey Pletenev et.al.", "authors": "Sergey Pletenev, Maria Marina, Daniil Moskovskiy, Vasily Konovalov, Pavel Braslavski, Alexander Panchenko, Mikhail Salnikov", "id": "2502.14502v1", "paper_url": "http://arxiv.org/abs/2502.14502v1", "repo": "null"}}