{"2405.07442": {"publish_time": "2024-05-13", "title": "Rene: A Pre-trained Multi-modal Architecture for Auscultation of Respiratory Diseases", "paper_summary": "This study presents a novel methodology utilizing a pre-trained speech\nrecognition model for processing respiratory sound data. By incorporating\nmedical record information, we introduce an innovative multi-modal\ndeep-learning architecture, named Rene, which addresses the challenges of poor\ninterpretability and underperformance in real-time clinical diagnostic response\nobserved in previous respiratory disease-focused models. The proposed Rene\narchitecture demonstrated significant improvements of 10.24%, 16.15%, 15.29%,\nand 18.90% respectively, compared to the baseline across four tasks related to\nrespiratory event detection and audio record classification on the SPRSound\ndatabase. In patient disease prediction tests on the ICBHI database, the\narchitecture exhibited improvements of 23% in the mean of average score and\nharmonic score compared to the baseline. Furthermore, we developed a real-time\nrespiratory sound discrimination system based on the Rene architecture,\nfeaturing a dual-thread design and compressed model parameters for simultaneous\nmicrophone recording and real-time dynamic decoding. Employing state-of-the-art\nEdge AI technology, this system enables rapid and accurate responses for\nrespiratory sound auscultation, facilitating deployment on wearable clinical\ndetection devices to capture incremental data, which can be synergistically\nevolved with large-scale models deployed on cloud servers for downstream tasks.", "paper_summary_zh": "本研究提出了一種新穎的方法，利用預訓練的語音識別模型來處理呼吸音數據。通過整合病歷信息，我們引入了一種創新的多模態深度學習架構，名為 Rene，它應對了在先前的呼吸道疾病模型中觀察到的實時臨床診斷響應中可解釋性差和性能不佳的挑戰。與 SPRSound 數據庫中與呼吸事件檢測和音頻記錄分類相關的四項任務的基準相比，提出的 Rene 架構分別展示了 10.24%、16.15%、15.29% 和 18.90% 的顯著改進。在 ICBHI 數據庫上的患者疾病預測測試中，與基準相比，該架構在平均分和諧波分上表現出 23% 的改進。此外，我們開發了一個基於 Rene 架構的實時呼吸音識別系統，具有雙線程設計和壓縮模型參數，用於同時麥克風錄音和實時動態解碼。採用最先進的 Edge AI 技術，該系統能夠對呼吸音聽診進行快速準確的響應，促進在可穿戴式臨床檢測設備上部署以捕獲增量數據，這些數據可以與部署在雲服務器上的大規模模型協同進化，以執行下游任務。", "author": "Pengfei Zhang et.al.", "authors": "Pengfei Zhang, Zhihang Zheng, Shichen Zhang, Minghao Yang, Shaojun Tang", "id": "2405.07442v1", "paper_url": "http://arxiv.org/abs/2405.07442v1", "repo": "null"}}