{"2408.00113": {"publish_time": "2024-07-31", "title": "Measuring Progress in Dictionary Learning for Language Model Interpretability with Board Game Models", "paper_summary": "What latent features are encoded in language model (LM) representations?\nRecent work on training sparse autoencoders (SAEs) to disentangle interpretable\nfeatures in LM representations has shown significant promise. However,\nevaluating the quality of these SAEs is difficult because we lack a\nground-truth collection of interpretable features that we expect good SAEs to\nrecover. We thus propose to measure progress in interpretable dictionary\nlearning by working in the setting of LMs trained on chess and Othello\ntranscripts. These settings carry natural collections of interpretable features\n-- for example, \"there is a knight on F3\" -- which we leverage into\n$\\textit{supervised}$ metrics for SAE quality. To guide progress in\ninterpretable dictionary learning, we introduce a new SAE training technique,\n$\\textit{p-annealing}$, which improves performance on prior unsupervised\nmetrics as well as our new metrics.", "paper_summary_zh": "語言模型（LM）表徵中編碼了哪些潛在特徵？\n最近關於訓練稀疏自動編碼器（SAE）以解開 LM 表徵中可解釋特徵的研究顯示出顯著的成果。然而，評估這些 SAE 的品質很困難，因為我們缺乏預期良好 SAE 能夠恢復的可解釋特徵的真實資料集。因此，我們提議透過在針對西洋棋和奧賽羅棋譜訓練的 LM 設定中工作來衡量可解釋字典學習的進度。這些設定包含自然的可解釋特徵集合，例如「F3 上有一個騎士」，我們將其運用到 SAE 品質的「監督式」指標中。為了引導可解釋字典學習的進度，我們引入了一種新的 SAE 訓練技術「p 退火」，它改善了先前非監督式指標以及我們的新指標的效能。", "author": "Adam Karvonen et.al.", "authors": "Adam Karvonen, Benjamin Wright, Can Rager, Rico Angell, Jannik Brinkmann, Logan Smith, Claudio Mayrink Verdun, David Bau, Samuel Marks", "id": "2408.00113v1", "paper_url": "http://arxiv.org/abs/2408.00113v1", "repo": "null"}}