{"2412.11691": {"publish_time": "2024-12-16", "title": "Multilingual and Explainable Text Detoxification with Parallel Corpora", "paper_summary": "Even with various regulations in place across countries and social media\nplatforms (Government of India, 2021; European Parliament and Council of the\nEuropean Union, 2022, digital abusive speech remains a significant issue. One\npotential approach to address this challenge is automatic text detoxification,\na text style transfer (TST) approach that transforms toxic language into a more\nneutral or non-toxic form. To date, the availability of parallel corpora for\nthe text detoxification task (Logachevavet al., 2022; Atwell et al., 2022;\nDementievavet al., 2024a) has proven to be crucial for state-of-the-art\napproaches. With this work, we extend parallel text detoxification corpus to\nnew languages -- German, Chinese, Arabic, Hindi, and Amharic -- testing in the\nextensive multilingual setup TST baselines. Next, we conduct the first of its\nkind an automated, explainable analysis of the descriptive features of both\ntoxic and non-toxic sentences, diving deeply into the nuances, similarities,\nand differences of toxicity and detoxification across 9 languages. Finally,\nbased on the obtained insights, we experiment with a novel text detoxification\nmethod inspired by the Chain-of-Thoughts reasoning approach, enhancing the\nprompting process through clustering on relevant descriptive attributes.", "paper_summary_zh": "儘管各國和社群媒體平台制定了各種法規（印度政府，2021 年；歐洲議會和歐盟理事會，2022 年），數位網路霸凌仍是一個重大問題。解決此挑戰的一種潛在方法是自動文字解毒，一種文字風格轉換 (TST) 方法，可將有毒語言轉換為更中立或無毒的形式。迄今為止，平行語料庫在文字解毒任務中的可用性（Logachevavet al.，2022 年；Atwell et al.，2022 年；Dementievavet al.，2024a 年）已被證明對最先進的方法至關重要。有了這項工作，我們將平行文字解毒語料庫擴展到新的語言——德語、中文、阿拉伯語、印地語和阿姆哈拉語——在廣泛的多語言設置 TST 基準中進行測試。接下來，我們將進行第一個此類自動化、可解釋的分析，分析有毒和無毒句子的描述性特徵，深入探討跨 9 種語言的毒性和解毒的細微差別、相似性和差異。最後，根據獲得的見解，我們嘗試一種新穎的文字解毒方法，該方法受到思想鏈推理方法的啟發，通過對相關描述屬性的聚類來增強提示過程。", "author": "Daryna Dementieva et.al.", "authors": "Daryna Dementieva, Nikolay Babakov, Amit Ronen, Abinew Ali Ayele, Naquee Rizwan, Florian Schneider, Xintong Wang, Seid Muhie Yimam, Daniil Moskovskiy, Elisei Stakovskii, Eran Kaufman, Ashraf Elnagar, Animesh Mukherjee, Alexander Panchenko", "id": "2412.11691v1", "paper_url": "http://arxiv.org/abs/2412.11691v1", "repo": "https://github.com/textdetox/multilingual_explainable_paradetox"}}