{"2412.21199": {"publish_time": "2024-12-30", "title": "HumanEval Pro and MBPP Pro: Evaluating Large Language Models on Self-invoking Code Generation", "paper_summary": "We introduce self-invoking code generation, a new task designed to evaluate\nthe progressive reasoning and problem-solving capabilities of LLMs. In this\ntask, models are presented with a base problem and a related, more complex\nproblem. They must solve the base problem and then utilize its solution to\naddress the more complex one. This work features three key contributions.\nFirst, we propose a general recipe for generating more challenging versions of\nexisting benchmarks, resulting in three new benchmarks: HumanEval Pro, MBPP\nPro, and BigCodeBench-Lite Pro, specifically designed to assess LLMs on\nself-invoking code generation. Second, from the analysis of experimental\nresults over twenty LLMs on our benchmarks, we have two important observations:\n(i) Most LLMs excel in traditional code generation benchmarks like HumanEval\nand MBPP, but their performance declines on self-invoking tasks. For example,\no1-mini achieves 96.2% pass@1 on HumanEval but only 76.2% on HumanEval Pro.\n(ii) On self-invoking code generation task, the instruction-tuned models\ndemonstrate only marginal improvements compared to the base models. Third, we\ndisclose the types of failure modes that exist in our evaluation results. All\nthese results underscore the need for further advancements in self-invoking\ncode generation tasks and provide a new direction for future research on\nenhancing LLMs' code reasoning capabilities.", "paper_summary_zh": "<paragraph>我們引入了自呼叫程式碼生成，這是一項新任務，旨在評估 LLM 的漸進式推理和問題解決能力。在此任務中，模型會遇到一個基本問題和一個相關的更複雜問題。他們必須解決基本問題，然後利用其解決方案來解決更複雜的問題。這項工作有三大貢獻。首先，我們提出了一個通用配方，用於生成更具挑戰性的現有基準版本，從而產生了三個新的基準：HumanEval Pro、MBPP Pro 和 BigCodeBench-Lite Pro，專門用於評估 LLM 的自呼叫程式碼生成。其次，從對我們基準上二十個 LLM 的實驗結果的分析中，我們有兩個重要的觀察結果：(i) 大多數 LLM 在傳統程式碼生成基準（如 HumanEval 和 MBPP）中表現出色，但它們在自呼叫任務中的表現卻下降了。例如，o1-mini 在 HumanEval 上達到了 96.2% 的 pass@1，但在 HumanEval Pro 上僅達到了 76.2%。(ii) 在自呼叫程式碼生成任務中，與基本模型相比，指令調整模型僅顯示出邊際改進。第三，我們公開了我們評估結果中存在的失敗模式類型。所有這些結果都強調了進一步推進自呼叫程式碼生成任務的必要性，並為未來增強 LLM 程式碼推理能力的研究提供了新的方向。</paragraph>", "author": "Zhaojian Yu et.al.", "authors": "Zhaojian Yu, Yilun Zhao, Arman Cohan, Xiao-Ping Zhang", "id": "2412.21199v2", "paper_url": "http://arxiv.org/abs/2412.21199v2", "repo": "https://github.com/CodeEval-Pro/CodeEval-Pro"}}