{"2406.19763": {"publish_time": "2024-06-28", "title": "xSemAD: Explainable Semantic Anomaly Detection in Event Logs Using Sequence-to-Sequence Models", "paper_summary": "The identification of undesirable behavior in event logs is an important\naspect of process mining that is often addressed by anomaly detection methods.\nTraditional anomaly detection methods tend to focus on statistically rare\nbehavior and neglect the subtle difference between rarity and undesirability.\nThe introduction of semantic anomaly detection has opened a promising avenue by\nidentifying semantically deviant behavior. This work addresses a gap in\nsemantic anomaly detection, which typically indicates the occurrence of an\nanomaly without explaining the nature of the anomaly. We propose xSemAD, an\napproach that uses a sequence-to-sequence model to go beyond pure\nidentification and provides extended explanations. In essence, our approach\nlearns constraints from a given process model repository and then checks\nwhether these constraints hold in the considered event log. This approach not\nonly helps understand the specifics of the undesired behavior, but also\nfacilitates targeted corrective actions. Our experiments demonstrate that our\napproach outperforms existing state-of-the-art semantic anomaly detection\nmethods.", "paper_summary_zh": "事件記錄中不良行為的識別是流程探勘中的一個重要面向，通常由異常偵測方法來處理。傳統的異常偵測方法傾向於關注統計上罕見的行為，而忽略了罕見與不良之間的細微差異。語義異常偵測的引入開闢了一條有前景的途徑，透過識別語義偏差行為。這項工作解決了語義異常偵測中的差距，這通常表示異常的發生，但沒有解釋異常的性質。我們提出 xSemAD，這是一種使用序列對序列模型的方法，超越純粹的識別並提供延伸的解釋。從本質上來說，我們的做法從給定的流程模型儲存庫中學習約束，然後檢查這些約束是否在所考慮的事件記錄中成立。這種方法不僅有助於了解不良行為的具體情況，也有助於採取有針對性的矯正措施。我們的實驗證明，我們的做法優於現有的最先進語義異常偵測方法。", "author": "Kiran Busch et.al.", "authors": "Kiran Busch, Timotheus Kampik, Henrik Leopold", "id": "2406.19763v1", "paper_url": "http://arxiv.org/abs/2406.19763v1", "repo": "null"}}