{"2409.12122": {"publish_time": "2024-09-18", "title": "Qwen2.5-Math Technical Report: Toward Mathematical Expert Model via Self-Improvement", "paper_summary": "In this report, we present a series of math-specific large language models:\nQwen2.5-Math and Qwen2.5-Math-Instruct-1.5B/7B/72B. The core innovation of the\nQwen2.5 series lies in integrating the philosophy of self-improvement\nthroughout the entire pipeline, from pre-training and post-training to\ninference: (1) During the pre-training phase, Qwen2-Math-Instruct is utilized\nto generate large-scale, high-quality mathematical data. (2) In the\npost-training phase, we develop a reward model (RM) by conducting massive\nsampling from Qwen2-Math-Instruct. This RM is then applied to the iterative\nevolution of data in supervised fine-tuning (SFT). With a stronger SFT model,\nit's possible to iteratively train and update the RM, which in turn guides the\nnext round of SFT data iteration. On the final SFT model, we employ the\nultimate RM for reinforcement learning, resulting in the Qwen2.5-Math-Instruct.\n(3) Furthermore, during the inference stage, the RM is used to guide sampling,\noptimizing the model's performance.\n  Qwen2.5-Math-Instruct supports both Chinese and English, and possess advanced\nmathematical reasoning capabilities, including Chain-of-Thought (CoT) and\nTool-Integrated Reasoning (TIR). We evaluate our models on 10 mathematics\ndatasets in both English and Chinese, such as GSM8K, MATH, GaoKao, AMC23, and\nAIME24, covering a range of difficulties from grade school level to math\ncompetition problems.", "paper_summary_zh": "<paragraph>在這份報告中，我們提出了一系列數學專用的大型語言模型：\nQwen2.5-Math 和 Qwen2.5-Math-Instruct-1.5B/7B/72B。\nQwen2.5 系列的核心創新在於將自我提升的理念整合到整個流程中，從預訓練和後訓練到推理：(1) 在預訓練階段，Qwen2-Math-Instruct 被用於生成大規模、高品質的數學數據。(2) 在後訓練階段，我們通過從 Qwen2-Math-Instruct 進行大量採樣來開發一個獎勵模型 (RM)。然後將此 RM 應用於監督微調 (SFT) 中數據的迭代演化。使用更強大的 SFT 模型，可以迭代訓練和更新 RM，而 RM 又指導下一輪 SFT 數據迭代。在最終的 SFT 模型中，我們採用最終的 RM 進行強化學習，從而得到 Qwen2.5-Math-Instruct。(3) 此外，在推理階段，RM 被用於指導採樣，優化模型的性能。\nQwen2.5-Math-Instruct 同時支援中文和英文，並具備先進的數學推理能力，包括思維鏈 (CoT) 和工具整合推理 (TIR)。我們在 10 個英文和中文數學數據集上評估了我們的模型，例如 GSM8K、MATH、高考、AMC23 和 AIME24，涵蓋了從小學到數學競賽問題的各種難度。</paragraph>", "author": "An Yang et.al.", "authors": "An Yang, Beichen Zhang, Binyuan Hui, Bofei Gao, Bowen Yu, Chengpeng Li, Dayiheng Liu, Jianhong Tu, Jingren Zhou, Junyang Lin, Keming Lu, Mingfeng Xue, Runji Lin, Tianyu Liu, Xingzhang Ren, Zhenru Zhang", "id": "2409.12122v1", "paper_url": "http://arxiv.org/abs/2409.12122v1", "repo": "null"}}