{"2411.19832": {"publish_time": "2024-11-29", "title": "Sensitive Content Classification in Social Media: A Holistic Resource and Evaluation", "paper_summary": "The detection of sensitive content in large datasets is crucial for ensuring\nthat shared and analysed data is free from harmful material. However, current\nmoderation tools, such as external APIs, suffer from limitations in\ncustomisation, accuracy across diverse sensitive categories, and privacy\nconcerns. Additionally, existing datasets and open-source models focus\npredominantly on toxic language, leaving gaps in detecting other sensitive\ncategories such as substance abuse or self-harm. In this paper, we put forward\na unified dataset tailored for social media content moderation across six\nsensitive categories: conflictual language, profanity, sexually explicit\nmaterial, drug-related content, self-harm, and spam. By collecting and\nannotating data with consistent retrieval strategies and guidelines, we address\nthe shortcomings of previous focalised research. Our analysis demonstrates that\nfine-tuning large language models (LLMs) on this novel dataset yields\nsignificant improvements in detection performance compared to open\noff-the-shelf models such as LLaMA, and even proprietary OpenAI models, which\nunderperform by 10-15% overall. This limitation is even more pronounced on\npopular moderation APIs, which cannot be easily tailored to specific sensitive\ncontent categories, among others.", "paper_summary_zh": "偵測大型資料集中的敏感內容對於確保共享和分析的資料沒有有害內容至關重要。然而，目前的審核工具（例如外部 API）在自訂、不同敏感類別的準確性以及隱私疑慮方面有其限制。此外，現有的資料集和開源模型主要關注有毒語言，在偵測其他敏感類別（例如藥物濫用或自殘）方面存在缺口。在本文中，我們提出了一個統一的資料集，專門針對社交媒體內容審核，涵蓋六個敏感類別：衝突性語言、褻瀆、色情內容、與藥物相關的內容、自殘和垃圾訊息。透過收集和註解具有一致性擷取策略和準則的資料，我們解決了先前焦點研究的缺點。我們的分析表明，針對這個新穎的資料集微調大型語言模型 (LLM) 與 LLaMA 等現成的公開模型相比，偵測效能有顯著的提升，甚至連專有的 OpenAI 模型也低於整體 10-15%。這種限制在流行的審核 API 上更加明顯，其中無法輕鬆地針對特定敏感內容類別進行調整。", "author": "Dimosthenis Antypas et.al.", "authors": "Dimosthenis Antypas, Indira Sen, Carla Perez-Almendros, Jose Camacho-Collados, Francesco Barbieri", "id": "2411.19832v1", "paper_url": "http://arxiv.org/abs/2411.19832v1", "repo": "null"}}