{"2411.02797": {"publish_time": "2024-11-05", "title": "DeepContext: A Context-aware, Cross-platform, and Cross-framework Tool for Performance Profiling and Analysis of Deep Learning Workloads", "paper_summary": "Effective performance profiling and analysis are essential for optimizing\ntraining and inference of deep learning models, especially given the growing\ncomplexity of heterogeneous computing environments. However, existing tools\noften lack the capability to provide comprehensive program context information\nand performance optimization insights for sophisticated interactions between\nCPUs and GPUs. This paper introduces DeepContext, a novel profiler that links\nprogram contexts across high-level Python code, deep learning frameworks,\nunderlying libraries written in C/C++, as well as device code executed on GPUs.\nDeepContext incorporates measurements of both coarse- and fine-grained\nperformance metrics for major deep learning frameworks, such as PyTorch and\nJAX, and is compatible with GPUs from both Nvidia and AMD, as well as various\nCPU architectures, including x86 and ARM. In addition, DeepContext integrates a\nnovel GUI that allows users to quickly identify hotpots and an innovative\nautomated performance analyzer that suggests users with potential optimizations\nbased on performance metrics and program context. Through detailed use cases,\nwe demonstrate how DeepContext can help users identify and analyze performance\nissues to enable quick and effective optimization of deep learning workloads.\nWe believe Deep Context is a valuable tool for users seeking to optimize\ncomplex deep learning workflows across multiple compute environments.", "paper_summary_zh": "有效的效能剖析和分析對於最佳化深度學習模型的訓練和推論至關重要，特別是在異質運算環境日益複雜的情況下。然而，現有的工具常常缺乏提供全面程式背景資訊和效能最佳化見解的能力，以應對 CPU 和 GPU 之間複雜的互動。本文介紹 DeepContext，一個創新的剖析器，它連結了跨高階 Python 程式碼、深度學習架構、以 C/C++ 編寫的底層函式庫，以及在 GPU 上執行的裝置程式碼的程式背景。DeepContext 結合了對 PyTorch 和 JAX 等主要深度學習架構的粗粒度和細粒度效能指標的測量，並與 Nvidia 和 AMD 的 GPU，以及包括 x86 和 ARM 在內的各種 CPU 架構相容。此外，DeepContext 整合了一個創新的 GUI，使用戶能夠快速識別熱點，並具備一個創新的自動化效能分析器，根據效能指標和程式背景向使用者建議潛在的最佳化。透過詳細的使用案例，我們展示了 DeepContext 如何協助使用者識別和分析效能問題，以實現深度學習工作負載的快速且有效的最佳化。我們相信 Deep Context 是尋求最佳化跨多個運算環境的複雜深度學習工作流程的使用者的一個有價值的工具。", "author": "Qidong Zhao et.al.", "authors": "Qidong Zhao, Hao Wu, Yuming Hao, Zilingfeng Ye, Jiajia Li, Xu Liu, Keren Zhou", "id": "2411.02797v1", "paper_url": "http://arxiv.org/abs/2411.02797v1", "repo": "null"}}