{"2409.11780": {"publish_time": "2024-09-18", "title": "Explaining Non-monotonic Normative Reasoning using Argumentation Theory with Deontic Logic", "paper_summary": "In our previous research, we provided a reasoning system (called LeSAC) based\non argumentation theory to provide legal support to designers during the design\nprocess. Building on this, this paper explores how to provide designers with\neffective explanations for their legally relevant design decisions. We extend\nthe previous system for providing explanations by specifying norms and the key\nlegal or ethical principles for justifying actions in normative contexts.\nConsidering that first-order logic has strong expressive power, in the current\npaper we adopt a first-order deontic logic system with deontic operators and\npreferences. We illustrate the advantages and necessity of introducing deontic\nlogic and designing explanations under LeSAC by modelling two cases in the\ncontext of autonomous driving. In particular, this paper also discusses the\nrequirements of the updated LeSAC to guarantee rationality, and proves that a\nwell-defined LeSAC can satisfy the rationality postulate for rule-based\nargumentation frameworks. This ensures the system's ability to provide\ncoherent, legally valid explanations for complex design decisions.", "paper_summary_zh": "在我們先前的研究中，我們提供了一個基於論證理論的推理系統（稱為 LeSAC），以便在設計過程中為設計師提供法律支持。在此基礎上，本文探討如何為設計師提供其與法律相關的設計決策的有效解釋。我們通過指定規範和關鍵法律或道德原則來擴展先前的解釋系統，以證明在規範性背景下的行為。考慮到一階邏輯具有強大的表達能力，在當前論文中，我們採用具有本務算子和偏好的一階本務邏輯系統。我們通過在自動駕駛背景下建模兩個案例來說明引入本務邏輯和在 LeSAC 下設計解釋的優點和必要性。特別是，本文還討論了更新 LeSAC 以保證理性的要求，並證明了一個定義良好的 LeSAC 可以滿足基於規則的論證框架的理性公設。這確保了系統為複雜的設計決策提供連貫、合法有效的解釋的能力。", "author": "Zhe Yu et.al.", "authors": "Zhe Yu, Yiwei Lu", "id": "2409.11780v1", "paper_url": "http://arxiv.org/abs/2409.11780v1", "repo": "null"}}