{"2408.06761": {"publish_time": "2024-08-13", "title": "Cross-View Geolocalization and Disaster Mapping with Street-View and VHR Satellite Imagery: A Case Study of Hurricane IAN", "paper_summary": "Nature disasters play a key role in shaping human-urban infrastructure\ninteractions. Effective and efficient response to natural disasters is\nessential for building resilience and a sustainable urban environment. Two\ntypes of information are usually the most necessary and difficult to gather in\ndisaster response. The first information is about disaster damage perception,\nwhich shows how badly people think that urban infrastructure has been damaged.\nThe second information is geolocation awareness, which means how people\nwhereabouts are made available. In this paper, we proposed a novel disaster\nmapping framework, namely CVDisaster, aiming at simultaneously addressing\ngeolocalization and damage perception estimation using cross-view Street-View\nImagery (SVI) and Very High-Resolution satellite imagery. CVDisaster consists\nof two cross-view models, where CVDisaster-Geoloc refers to a cross-view\ngeolocalization model based on a contrastive learning objective with a Siamese\nConvNeXt image encoder, and CVDisaster-Est is a cross-view classification model\nbased on a Couple Global Context Vision Transformer (CGCViT). Taking Hurricane\nIAN as a case study, we evaluate the CVDisaster framework by creating a novel\ncross-view dataset (CVIAN) and conducting extensive experiments. As a result,\nwe show that CVDisaster can achieve highly competitive performance (over 80%\nfor geolocalization and 75% for damage perception estimation) with even limited\nfine-tuning efforts, which largely motivates future cross-view models and\napplications within a broader GeoAI research community. The data and code are\npublicly available at: https://github.com/tum-bgd/CVDisaster.", "paper_summary_zh": "自然災害在塑造人類城市基礎設施互動中扮演著關鍵角色。有效且高效的自然災害應變措施對於建立韌性和永續的城市環境至關重要。在災害應變中，通常有兩種資訊最為必要且難以收集。第一種資訊是災害損害感知，這顯示了人們認為城市基礎設施損壞的程度。第二種資訊是地理位置感知，這表示人們的行蹤是如何被獲取的。在本文中，我們提出了一個新穎的災害製圖架構，即 CVDisaster，旨在同時利用跨視角街景影像 (SVI) 和極高解析度衛星影像，來解決地理定位和損害感知估計問題。CVDisaster 由兩個跨視角模型組成，其中 CVDisaster-Geoloc 指的是一個基於對比學習目標的跨視角地理定位模型，使用 Siamese ConvNeXt 影像編碼器；而 CVDisaster-Est 則是一個基於 Couple Global Context Vision Transformer (CGCViT) 的跨視角分類模型。我們以颶風 IAN 為例，透過建立一個新穎的跨視角資料集 (CVIAN) 並進行廣泛的實驗，來評估 CVDisaster 架構。結果顯示，即使在有限的微調工作下，CVDisaster 仍能達到極具競爭力的效能（地理定位超過 80%，損害感知估計超過 75%），這在很大程度上激勵了未來在更廣泛的 GeoAI 研究社群中開發跨視角模型和應用程式。資料和程式碼已公開於：https://github.com/tum-bgd/CVDisaster。", "author": "Hao Li et.al.", "authors": "Hao Li, Fabian Deuser, Wenping Yina, Xuanshu Luo, Paul Walther, Gengchen Mai, Wei Huang, Martin Werner", "id": "2408.06761v1", "paper_url": "http://arxiv.org/abs/2408.06761v1", "repo": "null"}}