{"2411.18320": {"publish_time": "2024-11-27", "title": "Continual Learning in Machine Speech Chain Using Gradient Episodic Memory", "paper_summary": "Continual learning for automatic speech recognition (ASR) systems poses a\nchallenge, especially with the need to avoid catastrophic forgetting while\nmaintaining performance on previously learned tasks. This paper introduces a\nnovel approach leveraging the machine speech chain framework to enable\ncontinual learning in ASR using gradient episodic memory (GEM). By\nincorporating a text-to-speech (TTS) component within the machine speech chain,\nwe support the replay mechanism essential for GEM, allowing the ASR model to\nlearn new tasks sequentially without significant performance degradation on\nearlier tasks. Our experiments, conducted on the LJ Speech dataset, demonstrate\nthat our method outperforms traditional fine-tuning and multitask learning\napproaches, achieving a substantial error rate reduction while maintaining high\nperformance across varying noise conditions. We showed the potential of our\nsemi-supervised machine speech chain approach for effective and efficient\ncontinual learning in speech recognition.", "paper_summary_zh": "持續學習自動語音辨識 (ASR) 系統是一個挑戰，特別是在需要避免災難性遺忘的同時，還要在先前學習的任務上維持效能。這篇論文介紹一種創新的方法，利用機器語音鏈架構，以使用梯度情節記憶體 (GEM) 實現 ASR 中的持續學習。透過在機器語音鏈中加入文字轉語音 (TTS) 組件，我們支援 GEM 所需的重播機制，讓 ASR 模型能夠依序學習新任務，而不會對先前任務的效能造成顯著的降低。我們在 LJ Speech 資料集上進行的實驗證明，我們的模型優於傳統的微調和多任務學習方法，在各種噪音條件下都能維持高效能，同時大幅降低錯誤率。我們展示了半監督機器語音鏈方法在語音辨識中進行有效且高效持續學習的潛力。", "author": "Geoffrey Tyndall et.al.", "authors": "Geoffrey Tyndall, Kurniawati Azizah, Dipta Tanaya, Ayu Purwarianti, Dessi Puji Lestari, Sakriani Sakti", "id": "2411.18320v1", "paper_url": "http://arxiv.org/abs/2411.18320v1", "repo": "null"}}