{"2503.02849": {"publish_time": "2025-03-04", "title": "Multimodal Deep Learning for Subtype Classification in Breast Cancer Using Histopathological Images and Gene Expression Data", "paper_summary": "Molecular subtyping of breast cancer is crucial for personalized treatment\nand prognosis. Traditional classification approaches rely on either\nhistopathological images or gene expression profiling, limiting their\npredictive power. In this study, we propose a deep multimodal learning\nframework that integrates histopathological images and gene expression data to\nclassify breast cancer into BRCA.Luminal and BRCA.Basal / Her2 subtypes. Our\napproach employs a ResNet-50 model for image feature extraction and fully\nconnected layers for gene expression processing, with a cross-attention fusion\nmechanism to enhance modality interaction. We conduct extensive experiments\nusing five-fold cross-validation, demonstrating that our multimodal integration\noutperforms unimodal approaches in terms of classification accuracy,\nprecision-recall AUC, and F1-score. Our findings highlight the potential of\ndeep learning for robust and interpretable breast cancer subtype\nclassification, paving the way for improved clinical decision-making.", "paper_summary_zh": "乳腺癌的分子分型對於個人化治療和預後至關重要。傳統的分類方法依賴於組織病理學圖像或基因表達譜，限制了其預測能力。在這項研究中，我們提出了一個深度多模態學習框架，整合組織病理學圖像和基因表達數據，將乳腺癌分為 BRCA.Luminal 和 BRCA.Basal / Her2 亞型。我們的方法採用 ResNet-50 模型進行圖像特徵提取，並使用全連接層進行基因表達處理，並利用交叉注意力融合機制來增強模態交互。我們使用五折交叉驗證進行了廣泛的實驗，證明我們多模態整合方法在分類準確度、精確率-召回率 AUC 和 F1-score 方面優於單模態方法。我們的研究結果突顯了深度學習在穩健且可解釋的乳腺癌亞型分類方面的潛力，為改進臨床決策鋪平了道路。\n", "author": "Amin Honarmandi Shandiz et.al.", "authors": "Amin Honarmandi Shandiz", "id": "2503.02849v1", "paper_url": "http://arxiv.org/abs/2503.02849v1", "repo": "null"}}