{"2501.11695": {"publish_time": "2025-01-20", "title": "Spatially-Delineated Domain-Adapted AI Classification: An Application for Oncology Data", "paper_summary": "Given multi-type point maps from different place-types (e.g., tumor regions),\nour objective is to develop a classifier trained on the source place-type to\naccurately distinguish between two classes of the target place-type based on\ntheir point arrangements. This problem is societally important for many\napplications, such as generating clinical hypotheses for designing new\nimmunotherapies for cancer treatment. The challenge lies in the spatial\nvariability, the inherent heterogeneity and variation observed in spatial\nproperties or arrangements across different locations (i.e., place-types).\nPrevious techniques focus on self-supervised tasks to learn domain-invariant\nfeatures and mitigate domain differences; however, they often neglect the\nunderlying spatial arrangements among data points, leading to significant\ndiscrepancies across different place-types. We explore a novel multi-task\nself-learning framework that targets spatial arrangements, such as spatial\nmix-up masking and spatial contrastive predictive coding, for\nspatially-delineated domain-adapted AI classification. Experimental results on\nreal-world datasets (e.g., oncology data) show that the proposed framework\nprovides higher prediction accuracy than baseline methods.", "paper_summary_zh": "從不同類型的點圖（例如，腫瘤區域）中給定多類型點圖，\n我們的目標是開發一個在來源類型上訓練的分類器，以\n根據其點排列準確區分目標類型中的兩類。這個問題對於許多\n應用來說具有社會重要性，例如為癌症治療設計新的免疫療法而生成臨床假設。挑戰在於空間\n變異性、固有的異質性和在不同位置（即類型）中觀察到的空間\n屬性或排列的變化。先前的技術專注於自監督任務以學習不變領域\n特徵並減輕領域差異；然而，它們通常忽視數據點之間的\n底層空間排列，導致不同類型之間存在顯著差異。我們探索了一種新穎的多任務\n自學習框架，以針對空間排列，例如空間混合掩蔽和空間對比預測編碼，用於\n空間劃分的領域適應 AI 分類。在\n真實世界數據集（例如，腫瘤學數據）上的實驗結果表明，所提出的框架\n提供的預測準確度高於基線方法。", "author": "Majid Farhadloo et.al.", "authors": "Majid Farhadloo, Arun Sharma, Alexey Leontovich, Svetomir N. Markovic, Shashi Shekhar", "id": "2501.11695v1", "paper_url": "http://arxiv.org/abs/2501.11695v1", "repo": "null"}}