{"2501.07774": {"publish_time": "2025-01-14", "title": "Transforming Indoor Localization: Advanced Transformer Architecture for NLOS Dominated Wireless Environments with Distributed Sensors", "paper_summary": "Indoor localization in challenging non-line-of-sight (NLOS) environments\noften leads to mediocre accuracy with traditional approaches. Deep learning\n(DL) has been applied to tackle these challenges; however, many DL approaches\noverlook computational complexity, especially for floating-point operations\n(FLOPs), making them unsuitable for resource-limited devices. Transformer-based\nmodels have achieved remarkable success in natural language processing (NLP)\nand computer vision (CV) tasks, motivating their use in wireless applications.\nHowever, their use in indoor localization remains nascent, and directly\napplying Transformers for indoor localization can be both computationally\nintensive and exhibit limitations in accuracy. To address these challenges, in\nthis work, we introduce a novel tokenization approach, referred to as Sensor\nSnapshot Tokenization (SST), which preserves variable-specific representations\nof power delay profile (PDP) and enhances attention mechanisms by effectively\ncapturing multi-variate correlation. Complementing this, we propose a\nlightweight Swish-Gated Linear Unit-based Transformer (L-SwiGLU Transformer)\nmodel, designed to reduce computational complexity without compromising\nlocalization accuracy. Together, these contributions mitigate the computational\nburden and dependency on large datasets, making Transformer models more\nefficient and suitable for resource-constrained scenarios. The proposed\ntokenization method enables the Vanilla Transformer to achieve a 90th\npercentile positioning error of 0.388 m in a highly NLOS indoor factory,\nsurpassing conventional tokenization methods. The L-SwiGLU ViT further reduces\nthe error to 0.355 m, achieving an 8.51% improvement. Additionally, the\nproposed model outperforms a 14.1 times larger model with a 46.13% improvement,\nunderscoring its computational efficiency.", "paper_summary_zh": "在具有挑戰性的非視線（NLOS）環境中進行室內定位，通常會導致傳統方法的準確度平庸。深度學習（DL）已被應用於應對這些挑戰；然而，許多 DL 方法忽視了計算複雜度，特別是對於浮點運算（FLOP），這使得它們不適合資源受限的設備。基於 Transformer 的模型在自然語言處理（NLP）和計算機視覺（CV）任務中取得了顯著的成功，激勵了它們在無線應用中的使用。然而，它們在室內定位中的使用仍然處於萌芽階段，並且直接應用 Transformer 進行室內定位既會計算密集，又會表現出準確性方面的限制。為了應對這些挑戰，在這項工作中，我們引入了一種新穎的標記化方法，稱為傳感器快照標記化（SST），它保留了功率延遲輪廓（PDP）的特定於變量的表示，並通過有效地捕獲多變量相關性來增強注意力機制。與此相輔相成的是，我們提出了一個輕量級的 Swish-Gated 線性單元 Transformer（L-SwiGLU Transformer）模型，旨在降低計算複雜度，同時不損害定位精度。這些貢獻共同減輕了計算負擔和對大型數據集的依賴性，使 Transformer 模型更有效率，更適合資源受限的場景。所提出的標記化方法使 Vanilla Transformer 能夠在高度 NLOS 室內工廠中實現 0.388 m 的第 90 個百分位定位誤差，超過了傳統的標記化方法。L-SwiGLU ViT 進一步將誤差降低到 0.355 m，實現了 8.51% 的改進。此外，所提出的模型優於一個大 14.1 倍的模型，改進了 46.13%，突顯了它的計算效率。", "author": "Saad Masrur et.al.", "authors": "Saad Masrur, Jung-Fu, Cheng, Atieh R. Khamesi, Ismail Guvenc", "id": "2501.07774v1", "paper_url": "http://arxiv.org/abs/2501.07774v1", "repo": "null"}}