{"2406.10172": {"publish_time": "2024-06-14", "title": "Datasets for Multilingual Answer Sentence Selection", "paper_summary": "Answer Sentence Selection (AS2) is a critical task for designing effective\nretrieval-based Question Answering (QA) systems. Most advancements in AS2 focus\non English due to the scarcity of annotated datasets for other languages. This\nlack of resources prevents the training of effective AS2 models in different\nlanguages, creating a performance gap between QA systems in English and other\nlocales. In this paper, we introduce new high-quality datasets for AS2 in five\nEuropean languages (French, German, Italian, Portuguese, and Spanish), obtained\nthrough supervised Automatic Machine Translation (AMT) of existing English AS2\ndatasets such as ASNQ, WikiQA, and TREC-QA using a Large Language Model (LLM).\nWe evaluated our approach and the quality of the translated datasets through\nmultiple experiments with different Transformer architectures. The results\nindicate that our datasets are pivotal in producing robust and powerful\nmultilingual AS2 models, significantly contributing to closing the performance\ngap between English and other languages.", "paper_summary_zh": "答案句子選擇 (AS2) 是設計有效基於檢索的問答 (QA) 系統的一項關鍵任務。由於缺乏其他語言的註解資料集，因此 AS2 的大多數進展都著重於英語。這種資源不足的情況會阻礙在不同語言中訓練有效的 AS2 模型，造成英語和其他地區的 QA 系統在效能上的差距。在本文中，我們引進了五種歐洲語言（法語、德語、義大利語、葡萄牙語和西班牙語）的新的高品質 AS2 資料集，這些資料集是透過使用大型語言模型 (LLM) 對現有的英語 AS2 資料集（例如 ASNQ、WikiQA 和 TREC-QA）進行監督式自動機器翻譯 (AMT) 所取得的。我們透過使用不同的 Transformer 架構進行多項實驗，來評估我們的做法和翻譯資料集的品質。結果顯示我們的資料集對於產生強健且強大的多語言 AS2 模型至關重要，有助於顯著縮小英語和其他語言之間的效能差距。", "author": "Matteo Gabburo et.al.", "authors": "Matteo Gabburo, Stefano Campese, Federico Agostini, Alessandro Moschitti", "id": "2406.10172v1", "paper_url": "http://arxiv.org/abs/2406.10172v1", "repo": "null"}}