{"2501.12487": {"publish_time": "2025-01-21", "title": "fabSAM: A Farmland Boundary Delineation Method Based on the Segment Anything Model", "paper_summary": "Delineating farmland boundaries is essential for agricultural management such\nas crop monitoring and agricultural census. Traditional methods using remote\nsensing imagery have been efficient but limited in generalisation. The Segment\nAnything Model (SAM), known for its impressive zero shot performance, has been\nadapted for remote sensing tasks through prompt learning and fine tuning. Here,\nwe propose a SAM based farmland boundary delineation framework 'fabSAM' that\ncombines a Deeplabv3+ based Prompter and SAM. Also, a fine tuning strategy was\nintroduced to enable SAMs decoder to improve the use of prompt information.\nExperimental results on the AI4Boundaries and AI4SmallFarms datasets have shown\nthat fabSAM has a significant improvement in farmland region identification and\nboundary delineation. Compared to zero shot SAM, fabSAM surpassed it by 23.5%\nand 15.1% in mIOU on the AI4Boundaries and AI4SmallFarms datasets,\nrespectively. For Deeplabv3+, fabSAM outperformed it by 4.9% and 12.5% in mIOU,\nrespectively. These results highlight the effectiveness of fabSAM, which also\nmeans that we can more easily obtain the global farmland region and boundary\nmaps from open source satellite image datasets like Sentinel2.", "paper_summary_zh": "劃定農田邊界對於農業管理（例如作物監控和農業普查）至關重要。傳統使用遙測影像的方法效率很高，但普遍性有限。以其令人印象深刻的零次學習表現而聞名的 Segment Anything Model (SAM) 已透過提示學習和微調，改編為遙測任務。在此，我們提出一個基於 SAM 的農田邊界描繪架構「fabSAM」，它結合了基於 Deeplabv3+ 的提示器和 SAM。此外，還引入了一種微調策略，讓 SAM 解碼器能夠改善提示資訊的使用。在 AI4Boundaries 和 AI4SmallFarms 資料集上的實驗結果顯示，fabSAM 在農田區域識別和邊界描繪方面有顯著的進步。與零次學習 SAM 相比，fabSAM 在 AI4Boundaries 和 AI4SmallFarms 資料集上的 mIOU 分別超越了它 23.5% 和 15.1%。與 Deeplabv3+ 相比，fabSAM 在 mIOU 上分別超越了它 4.9% 和 12.5%。這些結果突顯了 fabSAM 的有效性，這也意味著我們可以更容易地從 Sentinel2 等開源衛星影像資料集取得全球農田區域和邊界地圖。", "author": "Yufeng Xie et.al.", "authors": "Yufeng Xie, Hanzhi Wu, Hongxiang Tong, Lei Xiao, Wenwen Zhou, Ling Li, Thomas Cherico Wanger", "id": "2501.12487v1", "paper_url": "http://arxiv.org/abs/2501.12487v1", "repo": "null"}}