{"2412.17395": {"publish_time": "2024-12-23", "title": "WarriorCoder: Learning from Expert Battles to Augment Code Large Language Models", "paper_summary": "Despite recent progress achieved by code large language models (LLMs), their\nremarkable abilities are largely dependent on fine-tuning on the high-quality\ndata, posing challenges for data collection and annotation. To address this,\ncurrent methods often design various data flywheels to gather complex code\ninstructions, enabling models to handle more intricate tasks. However, these\napproaches typically rely on off-the-shelf datasets and data augmentation from\nthe limited pool of proprietary LLMs (e.g., Claude, GPT4, and so on), which\nlimits the diversity of the constructed data and makes it prone to systemic\nbiases. In this paper, we propose WarriorCoder which learns from expert battles\nto address these limitations. Specifically, we create an arena for current\nexpert code LLMs, where each model challenges and responds to others'\nchallenges, with evaluations conducted by uninvolved judge models. This\ncompetitive framework generates novel training data constructed from scratch,\nharnessing the strengths of all participants. Experimental results demonstrate\nthat WarriorCoder achieves competitive performance compared to previous\nmethods, even without relying on proprietary LLMs.", "paper_summary_zh": "儘管大型語言模型 (LLM) 的程式碼最近取得進展，但它們卓越的能力在很大程度上依賴於對高品質資料進行微調，這對資料收集和註解構成挑戰。為了解決這個問題，目前的各種方法通常會設計各種資料飛輪來收集複雜的程式碼指令，使模型能夠處理更複雜的任務。然而，這些方法通常依賴於現成的資料集和來自有限專有 LLM（例如 Claude、GPT4 等）的資料擴充，這限制了建構資料的多樣性，並使其容易產生系統性偏差。在本文中，我們提出 WarriorCoder，它從專家戰鬥中學習以解決這些限制。具體來說，我們為目前的專家程式碼 LLM 建立了一個競技場，每個模型都會挑戰並回應其他模型的挑戰，並由未參與的評審模型進行評估。這個競爭框架會產生從頭建構的新訓練資料，利用所有參與者的優勢。實驗結果表明，即使不依賴專有 LLM，WarriorCoder 也能達到與先前方法相當的競爭力。", "author": "Huawen Feng et.al.", "authors": "Huawen Feng, Pu Zhao, Qingfeng Sun, Can Xu, Fangkai Yang, Lu Wang, Qianli Ma, Qingwei Lin, Saravan Rajmohan, Dongmei Zhang, Qi Zhang", "id": "2412.17395v1", "paper_url": "http://arxiv.org/abs/2412.17395v1", "repo": "null"}}