{"2408.02416": {"publish_time": "2024-08-05", "title": "Why Are My Prompts Leaked? Unraveling Prompt Extraction Threats in Customized Large Language Models", "paper_summary": "The drastic increase of large language models' (LLMs) parameters has led to a\nnew research direction of fine-tuning-free downstream customization by prompts,\ni.e., task descriptions. While these prompt-based services (e.g. OpenAI's GPTs)\nplay an important role in many businesses, there has emerged growing concerns\nabout the prompt leakage, which undermines the intellectual properties of these\nservices and causes downstream attacks. In this paper, we analyze the\nunderlying mechanism of prompt leakage, which we refer to as prompt\nmemorization, and develop corresponding defending strategies. By exploring the\nscaling laws in prompt extraction, we analyze key attributes that influence\nprompt extraction, including model sizes, prompt lengths, as well as the types\nof prompts. Then we propose two hypotheses that explain how LLMs expose their\nprompts. The first is attributed to the perplexity, i.e. the familiarity of\nLLMs to texts, whereas the second is based on the straightforward token\ntranslation path in attention matrices. To defend against such threats, we\ninvestigate whether alignments can undermine the extraction of prompts. We find\nthat current LLMs, even those with safety alignments like GPT-4, are highly\nvulnerable to prompt extraction attacks, even under the most straightforward\nuser attacks. Therefore, we put forward several defense strategies with the\ninspiration of our findings, which achieve 83.8\\% and 71.0\\% drop in the prompt\nextraction rate for Llama2-7B and GPT-3.5, respectively. Source code is\navaliable at \\url{https://github.com/liangzid/PromptExtractionEval}.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 參數的急劇增加，導致了提示符進行微調自由下游自訂的新研究方向，即任務描述。雖然這些基於提示符的服務（例如 OpenAI 的 GPT）在許多企業中扮演著重要的角色，但對於提示符洩漏的擔憂與日俱增，這會破壞這些服務的智慧財產權並導致下游攻擊。在本文中，我們分析了提示符洩漏的底層機制，我們稱之為提示符記憶，並制定了相應的防禦策略。通過探索提示符提取中的規模定律，我們分析了影響提示符提取的關鍵屬性，包括模型大小、提示符長度以及提示符類型。然後，我們提出了兩個假設來解釋 LLM 如何公開其提示符。第一個歸因於困惑，即 LLM 對文本的熟悉度，而第二個則基於注意力矩陣中的直接代幣轉換路徑。為了防禦此類威脅，我們研究了對齊是否會破壞提示符的提取。我們發現當前的 LLM，即使是那些具有安全對齊功能（例如 GPT-4）的 LLM，也極易受到提示符提取攻擊，即使是在最直接的使用者攻擊下也是如此。因此，我們根據我們的發現提出了幾種防禦策略，這些策略分別為 Llama2-7B 和 GPT-3.5 的提示符提取率降低了 83.8% 和 71.0%。原始碼可於\\url{https://github.com/liangzid/PromptExtractionEval}取得。</paragraph>", "author": "Zi Liang et.al.", "authors": "Zi Liang, Haibo Hu, Qingqing Ye, Yaxin Xiao, Haoyang Li", "id": "2408.02416v1", "paper_url": "http://arxiv.org/abs/2408.02416v1", "repo": "null"}}