{"2501.14268": {"publish_time": "2025-01-24", "title": "Pre-train and Fine-tune: Recommenders as Large Models", "paper_summary": "In reality, users have different interests in different periods, regions,\nscenes, etc. Such changes in interest are so drastic that they are difficult to\nbe captured by recommenders. Existing multi-domain learning can alleviate this\nproblem. However, the structure of the industrial recommendation system is\ncomplex, the amount of data is huge, and the training cost is extremely high,\nso it is difficult to modify the structure of the industrial recommender and\nre-train it. To fill this gap, we consider recommenders as large pre-trained\nmodels and fine-tune them. We first propose the theory of the information\nbottleneck for fine-tuning and present an explanation for the fine-tuning\ntechnique in recommenders. To tailor for recommendation, we design an\ninformation-aware adaptive kernel (IAK) technique to fine-tune the pre-trained\nrecommender. Specifically, we define fine-tuning as two phases: knowledge\ncompression and knowledge matching and let the training stage of IAK explicitly\napproximate these two phases. Our proposed approach designed from the essence\nof fine-tuning is well interpretable. Extensive online and offline experiments\nshow the superiority of our proposed method. Besides, we also share unique and\nimportant lessons we learned when deploying the method in a large-scale online\nplatform. We also present the potential issues of fine-tuning techniques in\nrecommendation systems and the corresponding solutions. The recommender with\nIAK technique has been deployed on the homepage of a billion-scale online food\nplatform for several months and has yielded considerable profits in our\nbusiness.", "paper_summary_zh": "<paragraph>在現實中，使用者在不同的時段、區域、場景等，會有不同的興趣。而這樣的興趣變化劇烈，難以被推薦系統捕捉到。現有的多領域學習可以緩解這個問題。然而，產業推薦系統的架構複雜、資料量龐大、訓練成本極高，因此難以修改產業推薦系統的架構並重新訓練。為了填補這個缺口，我們將推薦系統視為大型預訓練模型，並對其進行微調。我們首先提出微調的資訊瓶頸理論，並對推薦系統中的微調技術提出解釋。為了客製化推薦，我們設計了一種資訊感知自適應核 (IAK) 技術來微調預訓練的推薦系統。具體來說，我們將微調定義為兩個階段：知識壓縮和知識匹配，並讓 IAK 的訓練階段明確逼近這兩個階段。我們提出的方法從微調的本質設計，具有良好的可解釋性。廣泛的線上和離線實驗顯示了我們提出的方法的優越性。此外，我們還分享了在大型線上平台部署該方法時學到的獨特且重要的經驗。我們也提出了微調技術在推薦系統中的潛在問題和對應的解決方案。結合 IAK 技術的推薦系統已在十億規模的線上美食平台首頁部署數月，並在我們的業務中產生了可觀的利潤。</paragraph>", "author": "Zhenhao Jiang et.al.", "authors": "Zhenhao Jiang, Chenghao Chen, Hao Feng, Yu Yang, Jin Liu, Jie Zhang, Jia Jia, Ning Hu", "id": "2501.14268v1", "paper_url": "http://arxiv.org/abs/2501.14268v1", "repo": "null"}}