{"2406.10173": {"publish_time": "2024-06-14", "title": "IntentionQA: A Benchmark for Evaluating Purchase Intention Comprehension Abilities of Language Models in E-commerce", "paper_summary": "Enhancing Language Models' (LMs) ability to understand purchase intentions in\nE-commerce scenarios is crucial for their effective assistance in various\ndownstream tasks. However, previous approaches that distill intentions from LMs\noften fail to generate meaningful and human-centric intentions applicable in\nreal-world E-commerce contexts. This raises concerns about the true\ncomprehension and utilization of purchase intentions by LMs. In this paper, we\npresent IntentionQA, a double-task multiple-choice question answering benchmark\nto evaluate LMs' comprehension of purchase intentions in E-commerce.\nSpecifically, LMs are tasked to infer intentions based on purchased products\nand utilize them to predict additional purchases. IntentionQA consists of 4,360\ncarefully curated problems across three difficulty levels, constructed using an\nautomated pipeline to ensure scalability on large E-commerce platforms. Human\nevaluations demonstrate the high quality and low false-negative rate of our\nbenchmark. Extensive experiments across 19 language models show that they still\nstruggle with certain scenarios, such as understanding products and intentions\naccurately, jointly reasoning with products and intentions, and more, in which\nthey fall far behind human performances. Our code and data are publicly\navailable at https://github.com/HKUST-KnowComp/IntentionQA.", "paper_summary_zh": "加強語言模型 (LM) 在電子商務場景中了解購買意圖的能力，對於它們在各種下游任務中提供有效協助至關重要。然而，先前從 LM 中提煉意圖的方法通常無法產生在現實世界電子商務環境中適用的有意義且以人為中心的意圖。這引起了人們對 LM 對購買意圖的真正理解和利用的擔憂。在本文中，我們提出了 IntentionQA，這是一個雙任務多選題問答基準，用於評估 LM 在電子商務中對購買意圖的理解。具體來說，LM 被要求根據已購買的產品推斷意圖，並利用它們來預測額外的購買。IntentionQA 包含 4,360 個精心策劃的問題，分為三個難度等級，使用自動化管道構建，以確保在大型電子商務平台上的可擴展性。人工評估證明了我們基準的高品質和低假陰性率。跨 19 個語言模型進行的廣泛實驗表明，它們仍然難以應對某些場景，例如準確理解產品和意圖、結合產品和意圖進行推理等等，在這些場景中它們遠遠落後於人類的表現。我們的代碼和數據已公開發布在 https://github.com/HKUST-KnowComp/IntentionQA。", "author": "Wenxuan Ding et.al.", "authors": "Wenxuan Ding, Weiqi Wang, Sze Heng Douglas Kwok, Minghao Liu, Tianqing Fang, Jiaxin Bai, Junxian He, Yangqiu Song", "id": "2406.10173v1", "paper_url": "http://arxiv.org/abs/2406.10173v1", "repo": "https://github.com/hkust-knowcomp/intentionqa"}}