{"2407.07263": {"publish_time": "2024-07-09", "title": "Reuse, Don't Retrain: A Recipe for Continued Pretraining of Language Models", "paper_summary": "As language models have scaled both their number of parameters and\npretraining dataset sizes, the computational cost for pretraining has become\nintractable except for the most well-resourced teams. This increasing cost\nmakes it ever more important to be able to reuse a model after it has completed\npretraining; allowing for a model's abilities to further improve without\nneeding to train from scratch. In this work, we detail a set of guidelines that\ncover how to design efficacious data distributions and learning rate schedules\nfor continued pretraining of language models. When applying these findings\nwithin a continued pretraining run on top of a well-trained 15B parameter\nmodel, we show an improvement of 9\\% in average model accuracy compared to the\nbaseline of continued training on the pretraining set. The resulting recipe\nprovides a practical starting point with which to begin developing language\nmodels through reuse rather than retraining.", "paper_summary_zh": "隨著語言模型擴展其參數數量和預訓練資料集大小，預訓練的運算成本已變得難以處理，除了資源最豐富的團隊外。這種成本的增加使得在預訓練完成後能夠重複使用模型變得更加重要；允許模型的能力進一步提升，而無需從頭開始訓練。在這項工作中，我們詳細說明了一組準則，涵蓋如何設計有效的資料分佈和學習率時間表，以持續預訓練語言模型。在訓練有素的 15B 參數模型上應用這些發現時，我們展示了與在預訓練集上持續訓練的基準相比，平均模型準確度提高了 9%。由此產生的方法提供了一個實用的起點，可以開始通過重複使用而不是重新訓練來開發語言模型。", "author": "Jupinder Parmar et.al.", "authors": "Jupinder Parmar, Sanjev Satheesh, Mostofa Patwary, Mohammad Shoeybi, Bryan Catanzaro", "id": "2407.07263v1", "paper_url": "http://arxiv.org/abs/2407.07263v1", "repo": "null"}}