{"2412.15498": {"publish_time": "2024-12-20", "title": "The First Multilingual Model For The Detection of Suicide Texts", "paper_summary": "Suicidal ideation is a serious health problem affecting millions of people\nworldwide. Social networks provide information about these mental health\nproblems through users' emotional expressions. We propose a multilingual model\nleveraging transformer architectures like mBERT, XML-R, and mT5 to detect\nsuicidal text across posts in six languages - Spanish, English, German,\nCatalan, Portuguese and Italian. A Spanish suicide ideation tweet dataset was\ntranslated into five other languages using SeamlessM4T. Each model was\nfine-tuned on this multilingual data and evaluated across classification\nmetrics. Results showed mT5 achieving the best performance overall with F1\nscores above 85%, highlighting capabilities for cross-lingual transfer\nlearning. The English and Spanish translations also displayed high quality\nbased on perplexity. Our exploration underscores the importance of considering\nlinguistic diversity in developing automated multilingual tools to identify\nsuicidal risk. Limitations exist around semantic fidelity in translations and\nethical implications which provide guidance for future human-in-the-loop\nevaluations.", "paper_summary_zh": "自殺意念是一個嚴重的健康問題，影響全球數百萬人。社交網路透過使用者的情緒表達，提供這些心理健康問題的資訊。我們提出一個多語言模型，利用像 mBERT、XML-R 和 mT5 的轉換器架構，來偵測六種語言（西班牙文、英文、德文、加泰隆尼亞文、葡萄牙文和義大利文）貼文中具有自殺傾向的文字。一個西班牙文自殺意念推文資料集使用 SeamlessM4T 翻譯成其他五種語言。每個模型都針對這個多語言資料進行微調，並評估分類指標。結果顯示，mT5 在整體表現上達到最佳，F1 分數高於 85%，突顯跨語言轉移學習的能力。英文和西班牙文的翻譯也根據困惑度顯示出高品質。我們的探索強調在開發自動化多語言工具以識別自殺風險時，考慮語言多樣性的重要性。翻譯中的語義忠實度和倫理意涵存在限制，這些限制為未來的人類參與評估提供了指導。", "author": "Rodolfo Zevallos et.al.", "authors": "Rodolfo Zevallos, Annika Schoene, John E. Ortega", "id": "2412.15498v1", "paper_url": "http://arxiv.org/abs/2412.15498v1", "repo": "null"}}