{"2409.08069": {"publish_time": "2024-09-12", "title": "TravelAgent: An AI Assistant for Personalized Travel Planning", "paper_summary": "As global tourism expands and artificial intelligence technology advances,\nintelligent travel planning services have emerged as a significant research\nfocus. Within dynamic real-world travel scenarios with multi-dimensional\nconstraints, services that support users in automatically creating practical\nand customized travel itineraries must address three key objectives:\nRationality, Comprehensiveness, and Personalization. However, existing systems\nwith rule-based combinations or LLM-based planning methods struggle to fully\nsatisfy these criteria. To overcome the challenges, we introduce TravelAgent, a\ntravel planning system powered by large language models (LLMs) designed to\nprovide reasonable, comprehensive, and personalized travel itineraries grounded\nin dynamic scenarios. TravelAgent comprises four modules: Tool-usage,\nRecommendation, Planning, and Memory Module. We evaluate TravelAgent's\nperformance with human and simulated users, demonstrating its overall\neffectiveness in three criteria and confirming the accuracy of personalized\nrecommendations.", "paper_summary_zh": "隨著全球旅遊業的擴張和人工智慧技術的進步，\n智慧型旅遊規劃服務已成為重要的研究重點。在具有多維度限制的動態真實世界旅遊場景中，支援使用者自動建立實用且客製化的旅遊行程的服務必須解決三個關鍵目標：合理性、全面性、個人化。然而，現有基於規則組合或 LLM 的規劃方法的系統難以完全滿足這些標準。為了克服這些挑戰，我們引入了 TravelAgent，一個由大型語言模型 (LLM) 支援的旅遊規劃系統，旨在提供合理、全面且個人化的旅遊行程，並以動態場景為基礎。TravelAgent 包含四個模組：工具使用、推薦、規劃和記憶體模組。我們透過人類和模擬使用者評估 TravelAgent 的效能，證明其在三個標準中的整體效能，並確認個人化建議的準確性。", "author": "Aili Chen et.al.", "authors": "Aili Chen, Xuyang Ge, Ziquan Fu, Yanghua Xiao, Jiangjie Chen", "id": "2409.08069v1", "paper_url": "http://arxiv.org/abs/2409.08069v1", "repo": "null"}}