{"2501.12421": {"publish_time": "2025-01-21", "title": "Tackling Small Sample Survival Analysis via Transfer Learning: A Study of Colorectal Cancer Prognosis", "paper_summary": "Survival prognosis is crucial for medical informatics. Practitioners often\nconfront small-sized clinical data, especially cancer patient cases, which can\nbe insufficient to induce useful patterns for survival predictions. This study\ndeals with small sample survival analysis by leveraging transfer learning, a\nuseful machine learning technique that can enhance the target analysis with\nrelated knowledge pre-learned from other data. We propose and develop various\ntransfer learning methods designed for common survival models. For parametric\nmodels such as DeepSurv, Cox-CC (Cox-based neural networks), and DeepHit\n(end-to-end deep learning model), we apply standard transfer learning\ntechniques like pretraining and fine-tuning. For non-parametric models such as\nRandom Survival Forest, we propose a new transfer survival forest (TSF) model\nthat transfers tree structures from source tasks and fine-tunes them with\ntarget data. We evaluated the transfer learning methods on colorectal cancer\n(CRC) prognosis. The source data are 27,379 SEER CRC stage I patients, and the\ntarget data are 728 CRC stage I patients from the West China Hospital. When\nenhanced by transfer learning, Cox-CC's $C^{td}$ value was boosted from 0.7868\nto 0.8111, DeepHit's from 0.8085 to 0.8135, DeepSurv's from 0.7722 to 0.8043,\nand RSF's from 0.7940 to 0.8297 (the highest performance). All models trained\nwith data as small as 50 demonstrated even more significant improvement.\nConclusions: Therefore, the current survival models used for cancer prognosis\ncan be enhanced and improved by properly designed transfer learning techniques.\nThe source code used in this study is available at\nhttps://github.com/YonghaoZhao722/TSF.", "paper_summary_zh": "<paragraph>存活預測對醫療資訊學至關重要。實務工作者經常面對小規模的臨床資料，特別是癌症病患個案，這些資料可能不足以誘發有用的模式來進行存活預測。此研究透過利用轉移學習來處理小樣本存活分析，這是一種有用的機器學習技術，可以透過從其他資料預先學習到的相關知識來增強目標分析。我們提出並開發各種專為常見存活模型設計的轉移學習方法。對於參數化模型，例如 DeepSurv、Cox-CC（基於 Cox 的神經網路）和 DeepHit（端到端深度學習模型），我們應用標準轉移學習技術，例如預訓練和微調。對於非參數化模型，例如隨機存活森林，我們提出一個新的轉移存活森林（TSF）模型，它從來源任務傳輸樹狀結構，並使用目標資料微調它們。我們在結直腸癌（CRC）預後上評估了轉移學習方法。來源資料為 27,379 名 SEER CRC 第一期患者，目標資料為來自中國西部醫院的 728 名 CRC 第一期患者。在透過轉移學習增強後，Cox-CC 的 $C^{td}$ 值從 0.7868 提升到 0.8111，DeepHit 的從 0.8085 提升到 0.8135，DeepSurv 的從 0.7722 提升到 0.8043，RSF 的從 0.7940 提升到 0.8297（最高效能）。所有以小至 50 的資料訓練的模型都展示出更顯著的進步。結論：因此，目前用於癌症預後的存活模型可以透過適當設計的轉移學習技術來增強和改善。本研究中使用的原始碼可在 https://github.com/YonghaoZhao722/TSF 取得。</paragraph>", "author": "Yonghao Zhao et.al.", "authors": "Yonghao Zhao, Changtao Li, Chi Shu, Qingbin Wu, Hong Li, Chuan Xu, Tianrui Li, Ziqiang Wang, Zhipeng Luo, Yazhou He", "id": "2501.12421v1", "paper_url": "http://arxiv.org/abs/2501.12421v1", "repo": "null"}}