{"2411.16080": {"publish_time": "2024-11-25", "title": "Boosting 3D Object Generation through PBR Materials", "paper_summary": "Automatic 3D content creation has gained increasing attention recently, due\nto its potential in various applications such as video games, film industry,\nand AR/VR. Recent advancements in diffusion models and multimodal models have\nnotably improved the quality and efficiency of 3D object generation given a\nsingle RGB image. However, 3D objects generated even by state-of-the-art\nmethods are still unsatisfactory compared to human-created assets. Considering\nonly textures instead of materials makes these methods encounter challenges in\nphoto-realistic rendering, relighting, and flexible appearance editing. And\nthey also suffer from severe misalignment between geometry and high-frequency\ntexture details. In this work, we propose a novel approach to boost the quality\nof generated 3D objects from the perspective of Physics-Based Rendering (PBR)\nmaterials. By analyzing the components of PBR materials, we choose to consider\nalbedo, roughness, metalness, and bump maps. For albedo and bump maps, we\nleverage Stable Diffusion fine-tuned on synthetic data to extract these values,\nwith novel usages of these fine-tuned models to obtain 3D consistent albedo UV\nand bump UV for generated objects. In terms of roughness and metalness maps, we\nadopt a semi-automatic process to provide room for interactive adjustment,\nwhich we believe is more practical. Extensive experiments demonstrate that our\nmodel is generally beneficial for various state-of-the-art generation methods,\nsignificantly boosting the quality and realism of their generated 3D objects,\nwith natural relighting effects and substantially improved geometry.", "paper_summary_zh": "<paragraph>自動 3D 內容創作近年來備受關注，因為它在各種應用中具有潛力，例如視訊遊戲、電影產業和 AR/VR。擴散模型和多模態模型的最新進展顯著提升了根據單一 RGB 影像生成 3D 物件的品質和效率。然而，即使是使用最先進方法生成的 3D 物件，與人工建立的資產相比仍不盡理想。這些方法僅考慮紋理而非材質，這使得它們在寫實渲染、重新打光和彈性外觀編輯方面遭遇挑戰。而且它們還存在幾何形狀和高頻率紋理細節之間嚴重的錯位。在這項工作中，我們提出了一種新穎的方法，從基於物理的渲染 (PBR) 材質的角度提升生成 3D 物件的品質。透過分析 PBR 材質的組成，我們選擇考慮漫反射率、粗糙度、金屬度和凹凸貼圖。對於漫反射率和凹凸貼圖，我們利用在合成資料上微調的 Stable Diffusion 來提取這些值，並創新使用這些微調模型來取得生成物件的 3D 一致漫反射率 UV 和凹凸 UV。在粗糙度和金屬度貼圖方面，我們採用半自動的流程來提供互動調整的空間，我們相信這更實用。廣泛的實驗證明，我們的模型通常有利於各種最先進的生成方法，顯著提升其生成 3D 物件的品質和真實感，具有自然的重新打光效果和大幅改善的幾何形狀。</paragraph>", "author": "Yitong Wang et.al.", "authors": "Yitong Wang, Xudong Xu, Li Ma, Haoran Wang, Bo Dai", "id": "2411.16080v1", "paper_url": "http://arxiv.org/abs/2411.16080v1", "repo": "null"}}