{"2407.16444": {"publish_time": "2024-07-23", "title": "Psychomatics -- A Multidisciplinary Framework for Understanding Artificial Minds", "paper_summary": "Although LLMs and other artificial intelligence systems demonstrate cognitive\nskills similar to humans, like concept learning and language acquisition, the\nway they process information fundamentally differs from biological cognition.\nTo better understand these differences this paper introduces Psychomatics, a\nmultidisciplinary framework bridging cognitive science, linguistics, and\ncomputer science. It aims to better understand the high-level functioning of\nLLMs, focusing specifically on how LLMs acquire, learn, remember, and use\ninformation to produce their outputs. To achieve this goal, Psychomatics will\nrely on a comparative methodology, starting from a theory-driven research\nquestion - is the process of language development and use different in humans\nand LLMs? - drawing parallels between LLMs and biological systems. Our analysis\nshows how LLMs can map and manipulate complex linguistic patterns in their\ntraining data. Moreover, LLMs can follow Grice's Cooperative Principle to\nprovide relevant and informative responses. However, human cognition draws from\nmultiple sources of meaning, including experiential, emotional, and imaginative\nfacets, which transcend mere language processing and are rooted in our social\nand developmental trajectories. Moreover, current LLMs lack physical\nembodiment, reducing their ability to make sense of the intricate interplay\nbetween perception, action, and cognition that shapes human understanding and\nexpression. Ultimately, Psychomatics holds the potential to yield\ntransformative insights into the nature of language, cognition, and\nintelligence, both artificial and biological. Moreover, by drawing parallels\nbetween LLMs and human cognitive processes, Psychomatics can inform the\ndevelopment of more robust and human-like AI systems.", "paper_summary_zh": "儘管大型語言模型和其他人工智慧系統展現出類似人類的概念學習和語言習得等認知技能，但它們處理資訊的方式與生物認知有根本上的不同。為了更了解這些差異，本文介紹了心身學，一個橋接認知科學、語言學和電腦科學的多領域架構。它旨在更了解大型語言模型的高階功能，特別專注於大型語言模型如何取得、學習、記憶和使用資訊來產生它們的輸出。為了達成這個目標，心身學將依賴比較方法，從理論驅動的研究問題開始——人類和大型語言模型的語言發展和使用過程是否不同？——在大型語言模型和生物系統之間畫出平行線。我們的分析顯示大型語言模型如何對其訓練資料中的複雜語言模式進行對應和操作。此外，大型語言模型可以遵循格萊斯的合作原則來提供相關且有資訊的回應。然而，人類認知從多種意義來源汲取，包括經驗、情緒和想像層面，這超越了單純的語言處理，並根植於我們的社會和發展軌跡。此外，當前的大型語言模型缺乏物理具身性，降低了它們理解形塑人類理解和表達的知覺、行動和認知之間複雜交互作用的能力。最終，心身學具有潛力對語言、認知和智慧的本質產生變革性的見解，無論是人工的還是生物的。此外，透過在大型語言模型和人類認知過程之間畫出平行線，心身學可以為更強大且更類似人類的 AI 系統的發展提供資訊。", "author": "Giuseppe Riva et.al.", "authors": "Giuseppe Riva, Fabrizia Mantovani, Brenda K. Wiederhold, Antonella Marchetti, Andrea Gaggioli", "id": "2407.16444v1", "paper_url": "http://arxiv.org/abs/2407.16444v1", "repo": "null"}}