{"2502.03688": {"publish_time": "2025-02-06", "title": "A Comparison of DeepSeek and Other LLMs", "paper_summary": "Recently, DeepSeek has been the focus of attention in and beyond the AI\ncommunity. An interesting problem is how DeepSeek compares to other large\nlanguage models (LLMs). There are many tasks an LLM can do, and in this paper,\nwe use the task of predicting an outcome using a short text for comparison. We\nconsider two settings, an authorship classification setting and a citation\nclassification setting. In the first one, the goal is to determine whether a\nshort text is written by human or AI. In the second one, the goal is to\nclassify a citation to one of four types using the textual content. For each\nexperiment, we compare DeepSeek with $4$ popular LLMs: Claude, Gemini, GPT, and\nLlama.\n  We find that, in terms of classification accuracy, DeepSeek outperforms\nGemini, GPT, and Llama in most cases, but underperforms Claude. We also find\nthat DeepSeek is comparably slower than others but with a low cost to use,\nwhile Claude is much more expensive than all the others. Finally, we find that\nin terms of similarity, the output of DeepSeek is most similar to those of\nGemini and Claude (and among all $5$ LLMs, Claude and Gemini have the most\nsimilar outputs).\n  In this paper, we also present a fully-labeled dataset collected by\nourselves, and propose a recipe where we can use the LLMs and a recent data\nset, MADStat, to generate new data sets. The datasets in our paper can be used\nas benchmarks for future study on LLMs.", "paper_summary_zh": "<paragraph>最近，DeepSeek一直是人工智能社群内外关注的焦点。一个有趣的问题是DeepSeek与其他大型语言模型（LLM）相比如何。LLM可以完成许多任务，在本文中，我们使用使用简短文本预测结果的任务进行比较。我们考虑两种设置，一种是作者分类设置，另一种是引用分类设置。在第一个设置中，目标是确定简短文本是由人还是人工智能编写的。在第二个设置中，目标是使用文本内容将引用分类为四种类型之一。对于每个实验，我们将DeepSeek与4个流行的LLM进行比较：Claude、Gemini、GPT和Llama。\n我们发现，在分类准确性方面，DeepSeek在大多数情况下优于Gemini、GPT和Llama，但在Claude面前表现不佳。我们还发现，DeepSeek比其他模型慢，但使用成本低，而Claude比其他模型贵得多。最后，我们发现，在相似性方面，DeepSeek的输出与Gemini和Claude的输出最相似（在所有5个LLM中，Claude和Gemini的输出最相似）。\n在本文中，我们还展示了一个由我们自己收集的完全标记的数据集，并提出了一个配方，我们可以使用LLM和最近的数据集MADStat来生成新的数据集。我们论文中的数据集可以用作未来对LLM的研究基准。</paragraph>", "author": "Tianchen Gao et.al.", "authors": "Tianchen Gao, Jiashun Jin, Zheng Tracy Ke, Gabriel Moryoussef", "id": "2502.03688v1", "paper_url": "http://arxiv.org/abs/2502.03688v1", "repo": "null"}}