{"2411.06860": {"publish_time": "2024-11-11", "title": "Enhancing Phishing Detection through Feature Importance Analysis and Explainable AI: A Comparative Study of CatBoost, XGBoost, and EBM Models", "paper_summary": "Phishing attacks remain a persistent threat to online security, demanding\nrobust detection methods. This study investigates the use of machine learning\nto identify phishing URLs, emphasizing the crucial role of feature selection\nand model interpretability for improved performance. Employing Recursive\nFeature Elimination, the research pinpointed key features like \"length_url,\"\n\"time_domain_activation\" and \"Page_rank\" as strong indicators of phishing\nattempts. The study evaluated various algorithms, including CatBoost, XGBoost,\nand Explainable Boosting Machine, assessing their robustness and scalability.\nXGBoost emerged as highly efficient in terms of runtime, making it well-suited\nfor large datasets. CatBoost, on the other hand, demonstrated resilience by\nmaintaining high accuracy even with reduced features. To enhance transparency\nand trustworthiness, Explainable AI techniques, such as SHAP, were employed to\nprovide insights into feature importance. The study's findings highlight that\neffective feature selection and model interpretability can significantly\nbolster phishing detection systems, paving the way for more efficient and\nadaptable defenses against evolving cyber threats", "paper_summary_zh": "網路釣魚攻擊持續對線上安全構成威脅，因此需要強大的偵測方法。本研究探討使用機器學習來識別網路釣魚網址，並強調特徵選擇和模型可解釋性對於提升效能至關重要的角色。研究採用遞迴特徵消除法，找出「網址長度」、「時域啟動」和「網頁排名」等關鍵特徵，作為網路釣魚攻擊的強力指標。本研究評估了各種演算法，包括 CatBoost、XGBoost 和可解釋提升機，評估其穩健性和可擴充性。XGBoost 在執行時間方面表現出極高的效率，使其非常適合大型資料集。另一方面，CatBoost 即使在特徵減少的情況下，仍能維持高準確度，展現出韌性。為了提高透明度和可信度，本研究採用可解釋 AI 技術（例如 SHAP），以提供特徵重要性的見解。本研究的發現強調，有效的特徵選擇和模型可解釋性可以顯著地強化網路釣魚偵測系統，為對抗不斷演變的網路威脅奠定更有效率且適應性更強的防禦基礎。", "author": "Abdullah Fajar et.al.", "authors": "Abdullah Fajar, Setiadi Yazid, Indra Budi", "id": "2411.06860v1", "paper_url": "http://arxiv.org/abs/2411.06860v1", "repo": "null"}}