{"2412.12781": {"publish_time": "2024-12-17", "title": "Predicting change in time production -- A machine learning approach to time perception", "paper_summary": "Time perception research has advanced significantly over the years. However,\nsome areas remain largely unexplored. This study addresses two such\nunder-explored areas in timing research: (1) A quantitative analysis of time\nperception at an individual level, and (2) Time perception in an ecological\nsetting. In this context, we trained a machine learning model to predict the\ndirection of change in an individual's time production. The model's training\ndata was collected using an ecologically valid setup. We moved closer to an\necological setting by conducting an online experiment with 995 participants\nperforming a time production task that used naturalistic videos (no audio) as\nstimuli. The model achieved an accuracy of 61%. This was 10 percentage points\nhigher than the baseline models derived from cognitive theories of timing. The\nmodel performed equally well on new data from a second experiment, providing\nevidence of its generalization capabilities. The model's output analysis\nrevealed that it also contained information about the magnitude of change in\ntime production. The predictions were further analysed at both population and\nindividual level. It was found that a participant's previous timing performance\nplayed a significant role in determining the direction of change in time\nproduction. By integrating attentional-gate theories from timing research with\nfeature importance techniques from machine learning, we explained model\npredictions using cognitive theories of timing. The model and findings from\nthis study have potential applications in systems involving human-computer\ninteractions where understanding and predicting changes in user's time\nperception can enable better user experience and task performance.", "paper_summary_zh": "<paragraph>隨著時間推移，時間知覺研究已取得顯著進展。然而，\n一些領域仍未被廣泛探索。本研究探討了時間研究中兩個尚未充分探索的領域：(1) 個體層面的時間知覺量化分析，以及 (2) 生態環境中的時間知覺。在此脈絡中，我們訓練了一個機器學習模型，以預測個人時間產出的變化方向。該模型的訓練數據是使用生態學上有效的設置收集的。我們通過對 995 名參與者進行在線實驗，執行時間製作任務，使用自然主義影片（無音訊）作為刺激，從而更接近生態環境設置。該模型達到了 61% 的準確度。這比源自時間認知理論的基準模型高出 10 個百分點。該模型在第二次實驗的新數據中表現得同樣出色，提供了其泛化能力的證據。該模型的輸出分析顯示，它還包含有關時間產出變化幅度的資訊。預測在人口和個人層面進一步分析。結果發現，參與者先前的計時表現對於確定時間產出變化方向起著重要作用。通過將時間研究中的注意力門控理論與機器學習中的特徵重要性技術相結合，我們使用時間的認知理論解釋了模型預測。本研究的模型和發現具有在涉及人機互動的系統中的潛在應用，在這些系統中，理解和預測使用者時間知覺的變化可以帶來更好的使用者體驗和任務表現。</paragraph>", "author": "Amrapali Pednekar et.al.", "authors": "Amrapali Pednekar, Alvaro Garrido, Yara Khaluf, Pieter Simoens", "id": "2412.12781v1", "paper_url": "http://arxiv.org/abs/2412.12781v1", "repo": "null"}}