{"2405.15317": {"publish_time": "2024-05-24", "title": "NuwaTS: Mending Every Incomplete Time Series", "paper_summary": "Time series imputation plays a crucial role in various real-world systems and\nhas been extensively explored. Models for time series imputation often require\nspecialization, necessitating distinct designs for different domains and\nmissing patterns. In this study, we introduce NuwaTS, a framework to repurpose\nPre-trained Language Model (PLM) for general time series imputation. Once\ntrained, this model can be applied to imputation tasks on incomplete time\nseries from any domain with any missing patterns. We begin by devising specific\nembeddings for each sub-series patch of the incomplete time series. These\nembeddings encapsulate information about the patch itself, the missing data\npatterns within the patch, and the patch's statistical characteristics. To\nenhance the model's adaptability to different missing patterns, we propose a\ncontrastive learning approach to make representations of the same patch more\nsimilar across different missing patterns. By combining this contrastive loss\nwith the missing data imputation task, we train PLMs to obtain a one-for-all\nimputation model. Furthermore, we utilize a plug-and-play layer-wise\nfine-tuning approach to train domain-specific models. Experimental results\ndemonstrate that leveraging a dataset of over seventeen million time series\nfrom diverse domains, we obtain a one-for-all imputation model which\noutperforms existing domain-specific models across various datasets and missing\npatterns. Additionally, we find that NuwaTS can be generalized to other time\nseries tasks such as forecasting. Our codes are available at\nhttps://github.com/Chengyui/NuwaTS.", "paper_summary_zh": "時間序列填補在各種真實世界系統中扮演著至關重要的角色，並且已被廣泛探討。時間序列填補模型通常需要專業化，這使得不同領域和遺失模式需要不同的設計。在這項研究中，我們引入了 NuwaTS，一個用於重新利用預訓練語言模型 (PLM) 以進行一般時間序列填補的架構。一旦訓練完成，此模型就可以應用於來自任何領域且具有任何遺失模式的不完整時間序列的填補任務。我們首先為不完整時間序列的每個子序列區塊設計特定的嵌入。這些嵌入封裝了有關區塊本身、區塊內的遺失數據模式以及區塊統計特徵的資訊。為了增強模型對不同遺失模式的適應性，我們提出了一種對比學習方法，以使同一個區塊的表示在不同的遺失模式之間更相似。透過將此對比損失與遺失數據填補任務結合，我們訓練 PLM 以獲得一個通用的填補模型。此外，我們利用即插即用的逐層微調方法來訓練特定於領域的模型。實驗結果表明，透過利用來自不同領域的超過一千七百萬個時間序列的資料集，我們獲得了一個通用的填補模型，它在各種資料集和遺失模式中都優於現有的特定於領域的模型。此外，我們發現 NuwaTS 可以推廣到其他時間序列任務，例如預測。我們的程式碼可在 https://github.com/Chengyui/NuwaTS 獲得。", "author": "Jinguo Cheng et.al.", "authors": "Jinguo Cheng, Chunwei Yang, Wanlin Cai, Yuxuan Liang, Yuankai Wu", "id": "2405.15317v1", "paper_url": "http://arxiv.org/abs/2405.15317v1", "repo": "https://github.com/chengyui/nuwats"}}