{"2411.19274": {"publish_time": "2024-11-28", "title": "On-chip Hyperspectral Image Segmentation with Fully Convolutional Networks for Scene Understanding in Autonomous Driving", "paper_summary": "Most of current computer vision-based advanced driver assistance systems\n(ADAS) perform detection and tracking of objects quite successfully under\nregular conditions. However, under adverse weather and changing lighting\nconditions, and in complex situations with many overlapping objects, these\nsystems are not completely reliable. The spectral reflectance of the different\nobjects in a driving scene beyond the visible spectrum can offer additional\ninformation to increase the reliability of these systems, especially under\nchallenging driving conditions. Furthermore, this information may be\nsignificant enough to develop vision systems that allow for a better\nunderstanding and interpretation of the whole driving scene. In this work we\nexplore the use of snapshot, video-rate hyperspectral imaging (HSI) cameras in\nADAS on the assumption that the near infrared (NIR) spectral reflectance of\ndifferent materials can help to better segment the objects in real driving\nscenarios. To do this, we have used the HSI-Drive 1.1 dataset to perform\nvarious experiments on spectral classification algorithms. However, the\ninformation retrieval of hyperspectral recordings in natural outdoor scenarios\nis challenging, mainly because of deficient colour constancy and other inherent\nshortcomings of current snapshot HSI technology, which poses some limitations\nto the development of pure spectral classifiers. In consequence, in this work\nwe analyze to what extent the spatial features codified by standard, tiny fully\nconvolutional network (FCN) models can improve the performance of HSI\nsegmentation systems for ADAS applications.\n  The abstract above is truncated due to submission limits. For the full\nabstract, please refer to the published article.", "paper_summary_zh": "當前基於電腦視覺的高階駕駛輔助系統 (ADAS) 大多在一般情況下相當成功地執行物件偵測和追蹤。然而，在惡劣天氣和變化的光照條件下，以及許多重疊物件的複雜情況中，這些系統並非完全可靠。駕駛場景中不同物件在可見光譜之外的不同光譜反射率可提供額外資訊，以提高這些系統的可靠性，特別是在具有挑戰性的駕駛條件下。此外，此資訊可能足夠重要，足以開發出能讓系統更佳理解和詮釋整個駕駛場景的視覺系統。在這項工作中，我們探討在 ADAS 中使用快照、影片速率高光譜影像 (HSI) 相機，假設不同材質的近紅外線 (NIR) 光譜反射率有助於在真實駕駛場景中更佳地分割物件。為此，我們使用 HSI-Drive 1.1 資料集對光譜分類演算法執行各種實驗。然而，在自然戶外場景中擷取高光譜記錄的資訊具有挑戰性，這主要是由於當前快照 HSI 技術的色彩恆常性不足和其他固有缺點，這對純光譜分類器的開發造成了一些限制。因此，在這項工作中，我們分析標準、小型全卷積網路 (FCN) 模型所編碼的空間特徵在多大程度上能改善 ADAS 應用中 HSI 分割系統的效能。\n由於提交限制，以上摘要已被截斷。如需完整摘要，請參閱已發表的文章。", "author": "Jon Gutiérrez-Zaballa et.al.", "authors": "Jon Gutiérrez-Zaballa, Koldo Basterretxea, Javier Echanobe, M. Victoria Martínez, Unai Martínez-Corral, Óscar Mata Carballeira, Inés del Campo", "id": "2411.19274v1", "paper_url": "http://arxiv.org/abs/2411.19274v1", "repo": "null"}}