{"2410.04663": {"publish_time": "2024-10-07", "title": "Adversarial Multi-Agent Evaluation of Large Language Models through Iterative Debates", "paper_summary": "This paper explores optimal architectures for evaluating the outputs of large\nlanguage models (LLMs) using LLMs themselves. We propose a novel framework that\ninterprets LLMs as advocates within an ensemble of interacting agents, allowing\nthem to defend their answers and reach conclusions through a judge and jury\nsystem. This approach offers a more dynamic and comprehensive evaluation\nprocess compared to traditional human-based assessments or automated metrics.\nWe discuss the motivation behind this framework, its key components, and\ncomparative advantages. We also present a probabilistic model to evaluate the\nerror reduction achieved by iterative advocate systems. Finally, we outline\nexperiments to validate the effectiveness of multi-advocate architectures and\ndiscuss future research directions.", "paper_summary_zh": "這篇論文探討使用大型語言模型 (LLM) 本身來評估大型語言模型 (LLM) 輸出的最佳架構。我們提出一個新的框架，將 LLM 解釋為一群互動代理中的倡導者，讓它們為自己的答案辯護並透過法官和陪審團制度達成結論。與傳統的人類評估或自動化指標相比，這種方法提供了一個更動態且全面的評估過程。我們討論這個框架背後的動機、它的關鍵組成部分和比較優勢。我們也提出一個機率模型來評估迭代倡導系統達成的錯誤減少。最後，我們概述實驗以驗證多倡導架構的有效性，並討論未來的研究方向。", "author": "Chaithanya Bandi et.al.", "authors": "Chaithanya Bandi, Hari Bandi, Abir Harrasse", "id": "2410.04663v1", "paper_url": "http://arxiv.org/abs/2410.04663v1", "repo": "null"}}