{"2501.01108": {"publish_time": "2025-01-02", "title": "MuQ: Self-Supervised Music Representation Learning with Mel Residual Vector Quantization", "paper_summary": "Recent years have witnessed the success of foundation models pre-trained with\nself-supervised learning (SSL) in various music informatics understanding\ntasks, including music tagging, instrument classification, key detection, and\nmore. In this paper, we propose a self-supervised music representation learning\nmodel for music understanding. Distinguished from previous studies adopting\nrandom projection or existing neural codec, the proposed model, named MuQ, is\ntrained to predict tokens generated by Mel Residual Vector Quantization\n(Mel-RVQ). Our Mel-RVQ utilizes residual linear projection structure for Mel\nspectrum quantization to enhance the stability and efficiency of target\nextraction and lead to better performance. Experiments in a large variety of\ndownstream tasks demonstrate that MuQ outperforms previous self-supervised\nmusic representation models with only 0.9K hours of open-source pre-training\ndata. Scaling up the data to over 160K hours and adopting iterative training\nconsistently improve the model performance. To further validate the strength of\nour model, we present MuQ-MuLan, a joint music-text embedding model based on\ncontrastive learning, which achieves state-of-the-art performance in the\nzero-shot music tagging task on the MagnaTagATune dataset. Code and checkpoints\nare open source in https://github.com/tencent-ailab/MuQ.", "paper_summary_zh": "近年来，在各种音乐信息学理解任务中，利用自我监督学习 (SSL) 预训练的基础模型取得了成功，包括音乐标记、乐器分类、键检测等。在本文中，我们提出了一种用于音乐理解的自我监督音乐表征学习模型。与采用随机投影或现有神经编解码器的先前的研究不同，所提出的模型 MuQ 被训练为预测 Mel 残差矢量量化 (Mel-RVQ) 生成的标记。我们的 Mel-RVQ 利用残差线性投影结构对 Mel 谱进行量化，以增强目标提取的稳定性和效率，并带来更好的性能。在各种下游任务中的实验表明，MuQ 仅使用 0.9K 小时的开源预训练数据就优于先前的自我监督音乐表征模型。将数据扩展到超过 160K 小时并采用迭代训练可以持续提高模型性能。为了进一步验证我们模型的优势，我们提出了 MuQ-MuLan，这是一种基于对比学习的联合音乐文本嵌入模型，在 MagnaTagATune 数据集上的零样本音乐标记任务中实现了最先进的性能。代码和检查点在 https://github.com/tencent-ailab/MuQ 中开源。", "author": "Haina Zhu et.al.", "authors": "Haina Zhu, Yizhi Zhou, Hangting Chen, Jianwei Yu, Ziyang Ma, Rongzhi Gu, Wei Tan, Xie Chen", "id": "2501.01108v1", "paper_url": "http://arxiv.org/abs/2501.01108v1", "repo": "null"}}