{"2412.03401": {"publish_time": "2024-12-04", "title": "Benchmarking Pretrained Attention-based Models for Real-Time Recognition in Robot-Assisted Esophagectomy", "paper_summary": "Esophageal cancer is among the most common types of cancer worldwide. It is\ntraditionally treated using open esophagectomy, but in recent years,\nrobot-assisted minimally invasive esophagectomy (RAMIE) has emerged as a\npromising alternative. However, robot-assisted surgery can be challenging for\nnovice surgeons, as they often suffer from a loss of spatial orientation.\nComputer-aided anatomy recognition holds promise for improving surgical\nnavigation, but research in this area remains limited. In this study, we\ndeveloped a comprehensive dataset for semantic segmentation in RAMIE, featuring\nthe largest collection of vital anatomical structures and surgical instruments\nto date. Handling this diverse set of classes presents challenges, including\nclass imbalance and the recognition of complex structures such as nerves. This\nstudy aims to understand the challenges and limitations of current\nstate-of-the-art algorithms on this novel dataset and problem. Therefore, we\nbenchmarked eight real-time deep learning models using two pretraining\ndatasets. We assessed both traditional and attention-based networks,\nhypothesizing that attention-based networks better capture global patterns and\naddress challenges such as occlusion caused by blood or other tissues. The\nbenchmark includes our RAMIE dataset and the publicly available CholecSeg8k\ndataset, enabling a thorough assessment of surgical segmentation tasks. Our\nfindings indicate that pretraining on ADE20k, a dataset for semantic\nsegmentation, is more effective than pretraining on ImageNet. Furthermore,\nattention-based models outperform traditional convolutional neural networks,\nwith SegNeXt and Mask2Former achieving higher Dice scores, and Mask2Former\nadditionally excelling in average symmetric surface distance.", "paper_summary_zh": "食道癌是全球最常見的癌症類型之一。傳統上使用開胸食道切除術進行治療，但近年來，機器人輔助微創食道切除術 (RAMIE) 已成為一種有前景的替代方案。然而，對於新手外科醫生來說，機器人輔助手術可能具有挑戰性，因為他們經常會喪失空間定位能力。電腦輔助解剖識別有望改善手術導航，但這方面的研究仍然有限。在這項研究中，我們為 RAMIE 中的語義分割開發了一個全面的數據集，其中包含迄今為止最大的重要解剖結構和手術器械集合。處理這一組不同的類別會帶來挑戰，包括類別不平衡以及對神經等複雜結構的識別。本研究旨在了解當前最先進演算法在這個新數據集和問題上的挑戰和限制。因此，我們使用兩個預訓練數據集對八個實時深度學習模型進行了基準測試。我們評估了傳統和基於注意力的網路，假設基於注意力的網路可以更好地捕捉全局模式，並解決因血液或其他組織引起的遮擋等挑戰。基準測試包括我們的 RAMIE 數據集和公開的 CholecSeg8k 數據集，可以對外科分割任務進行全面評估。我們的研究結果表明，在 ADE20k（一個用於語義分割的數據集）上進行預訓練比在 ImageNet 上進行預訓練更有效。此外，基於注意力的模型優於傳統的卷積神經網路，其中 SegNeXt 和 Mask2Former 獲得了更高的 Dice 分數，而 Mask2Former 在平均對稱表面距離方面也表現出色。", "author": "Ronald L. P. D. de Jong et.al.", "authors": "Ronald L. P. D. de Jong, Yasmina al Khalil, Tim J. M. Jaspers, Romy C. van Jaarsveld, Gino M. Kuiper, Yiping Li, Richard van Hillegersberg, Jelle P. Ruurda, Marcel Breeuwer, Fons van der Sommen", "id": "2412.03401v1", "paper_url": "http://arxiv.org/abs/2412.03401v1", "repo": "null"}}