{"2412.18426": {"publish_time": "2024-12-24", "title": "GUI Testing Arena: A Unified Benchmark for Advancing Autonomous GUI Testing Agent", "paper_summary": "Nowadays, research on GUI agents is a hot topic in the AI community. However,\ncurrent research focuses on GUI task automation, limiting the scope of\napplications in various GUI scenarios. In this paper, we propose a formalized\nand comprehensive environment to evaluate the entire process of automated GUI\nTesting (GTArena), offering a fair, standardized environment for consistent\noperation of diverse multimodal large language models. We divide the testing\nprocess into three key subtasks: test intention generation, test task\nexecution, and GUI defect detection, and construct a benchmark dataset based on\nthese to conduct a comprehensive evaluation. It evaluates the performance of\ndifferent models using three data types: real mobile applications, mobile\napplications with artificially injected defects, and synthetic data, thoroughly\nassessing their capabilities in this relevant task. Additionally, we propose a\nmethod that helps researchers explore the correlation between the performance\nof multimodal language large models in specific scenarios and their general\ncapabilities in standard benchmark tests. Experimental results indicate that\neven the most advanced models struggle to perform well across all sub-tasks of\nautomated GUI Testing, highlighting a significant gap between the current\ncapabilities of Autonomous GUI Testing and its practical, real-world\napplicability. This gap provides guidance for the future direction of GUI Agent\ndevelopment. Our code is available at\nhttps://github.com/ZJU-ACES-ISE/ChatUITest.", "paper_summary_zh": "當今，GUI 代理的研究是 AI 社群中的熱門話題。然而，目前的\n研究專注於 GUI 任務自動化，限制了在各種 GUI 場景中的應用範圍。在本文中，我們提出一個形式化且全面的環境來評估自動化 GUI\n測試的整個過程 (GTArena)，為不同多模態大型語言模型的一致操作提供一個公平、標準化的環境。我們將測試過程分為三個關鍵的子任務：測試意圖產生、測試任務執行和 GUI 缺陷偵測，並根據這些任務建構一個基準資料集來進行全面的評估。它使用三種類型的資料來評估不同模型的效能：真實的行動應用程式、人工注入缺陷的行動應用程式，以及合成資料，徹底評估它們在這個相關任務中的能力。此外，我們提出一個方法，幫助研究人員探索特定場景中多模態大型語言模型的效能與其在標準基準測試中的整體能力之間的關聯性。實驗結果表明，即使是最先進的模型也很難在自動化 GUI 測試的所有子任務中表現良好，這突顯了當前自動化 GUI 測試的能力與其實際的真實世界適用性之間的顯著差距。這個差距為 GUI 代理開發的未來方向提供了指導。我們的程式碼可在\nhttps://github.com/ZJU-ACES-ISE/ChatUITest 取得。", "author": "Kangjia Zhao et.al.", "authors": "Kangjia Zhao, Jiahui Song, Leigang Sha, Haozhan Shen, Zhi Chen, Tiancheng Zhao, Xiubo Liang, Jianwei Yin", "id": "2412.18426v1", "paper_url": "http://arxiv.org/abs/2412.18426v1", "repo": "null"}}