{"2406.18505": {"publish_time": "2024-06-26", "title": "Mental Modeling of Reinforcement Learning Agents by Language Models", "paper_summary": "Can emergent language models faithfully model the intelligence of\ndecision-making agents? Though modern language models exhibit already some\nreasoning ability, and theoretically can potentially express any probable\ndistribution over tokens, it remains underexplored how the world knowledge\nthese pretrained models have memorized can be utilized to comprehend an agent's\nbehaviour in the physical world. This study empirically examines, for the first\ntime, how well large language models (LLMs) can build a mental model of agents,\ntermed agent mental modelling, by reasoning about an agent's behaviour and its\neffect on states from agent interaction history. This research may unveil the\npotential of leveraging LLMs for elucidating RL agent behaviour, addressing a\nkey challenge in eXplainable reinforcement learning (XRL). To this end, we\npropose specific evaluation metrics and test them on selected RL task datasets\nof varying complexity, reporting findings on agent mental model establishment.\nOur results disclose that LLMs are not yet capable of fully mental modelling\nagents through inference alone without further innovations. This work thus\nprovides new insights into the capabilities and limitations of modern LLMs.", "paper_summary_zh": "新興語言模型能否忠實模擬決策制定代理的智慧？儘管現代語言模型已經展現出一些推理能力，理論上也能表達任何可能的符號分佈，但這些預先訓練模型所記憶的世界知識如何用於理解代理在物理世界中的行為，這方面仍未得到充分探討。本研究首次實證檢驗大型語言模型 (LLM) 在推理代理行為及其對代理互動歷史狀態的影響後，建立代理心智模型（稱為代理心智建模）的能力。這項研究可能揭示利用 LLM 來闡明 RL 代理行為的潛力，以應對可解釋強化學習 (XRL) 中的一項關鍵挑戰。為此，我們提出了具體的評估指標，並在複雜度不同的選定 RL 任務資料集上對其進行測試，報告代理心智模型建立的發現。我們的結果揭示，LLM 尚未能夠僅透過推理，在沒有進一步創新的情況下，完全對代理進行心智建模。因此，這項工作對現代 LLM 的能力和限制提供了新的見解。", "author": "Wenhao Lu et.al.", "authors": "Wenhao Lu, Xufeng Zhao, Josua Spisak, Jae Hee Lee, Stefan Wermter", "id": "2406.18505v1", "paper_url": "http://arxiv.org/abs/2406.18505v1", "repo": "null"}}