{"2502.13820": {"publish_time": "2025-02-19", "title": "Scoring Verifiers: Evaluating Synthetic Verification in Code and Reasoning", "paper_summary": "Code verification has recently found great success as a critical component in\ntraining large scale reasoning models for coding. Synthetic techniques such as\nself-generated test cases and reward models provide a way to enhance code\ncapabilities beyond predefined tests. Building on these advancements, we\npropose new benchmarks designed to systematically evaluate the impact of\nsynthetic verification methods on assessing solution correctness. We introduce\nHE-R, HE-R+, MBPP-R, and MBPP-R+, which transform existing coding benchmarks\ninto scoring and ranking datasets to evaluate the effectiveness of synthetic\nverifiers. Using these benchmarks, we analyze synthetic verification methods in\nstandard, reasoning-based, and reward-based LLMs. Our results show that recent\nreasoning models significantly improve test case generation and that scaling\ntest cases enhances verification accuracy.", "paper_summary_zh": "程式碼驗證最近被發現作為訓練大型推理模型進行編碼的重要組成部分而獲得巨大的成功。自我產生的測試案例和獎勵模型等合成技術提供了一種方法，可以增強程式碼功能，超越預定義的測試。在這些進展的基礎上，我們提出了新的基準，旨在系統性地評估合成驗證方法對評估解決方案正確性的影響。我們介紹了 HE-R、HE-R+、MBPP-R 和 MBPP-R+，它們將現有的編碼基準轉換為評分和排名資料集，以評估合成驗證器的有效性。使用這些基準，我們分析了標準、基於推理和基於獎勵的 LLM 中的合成驗證方法。我們的結果表明，最近的推理模型顯著改進了測試案例生成，並且擴充測試案例增強了驗證準確性。", "author": "Aleksander Ficek et.al.", "authors": "Aleksander Ficek, Somshubra Majumdar, Vahid Noroozi, Boris Ginsburg", "id": "2502.13820v1", "paper_url": "http://arxiv.org/abs/2502.13820v1", "repo": "null"}}