{"2411.10015": {"publish_time": "2024-11-15", "title": "MicroCrackAttentionNeXt: Advancing Microcrack Detection in Wave Field Analysis Using Deep Neural Networks through Feature Visualization", "paper_summary": "Micro Crack detection using deep neural networks (DNNs) through an automated\npipeline using wave fields interacting with the damaged areas is highly sought\nafter. These high-dimensional spatio-temporal crack data are limited, and these\ndatasets have large dimensions in the temporal domain. The dataset presents a\nsubstantial class imbalance, with crack pixels constituting an average of only\n5% of the total pixels per sample. This extreme class imbalance poses a\nchallenge for deep learning models with the different micro-scale cracks, as\nthe network can be biased toward predicting the majority class, generally\nleading to poor detection accuracy. This study builds upon the previous\nbenchmark SpAsE-Net, an asymmetric encoder-decoder network for micro-crack\ndetection. The impact of various activation and loss functions were examined\nthrough feature space visualization using the manifold discovery and analysis\n(MDA) algorithm. The optimized architecture and training methodology achieved\nan accuracy of 86.85%.", "paper_summary_zh": "利用波場與受損區域交互作用的自動化管道，使用深度神經網路 (DNN) 進行微裂紋檢測備受重視。這些高維時空裂紋資料有限，且這些資料集在時域中具有大維度。該資料集呈現出顯著的類別不平衡，其中裂紋像素平均僅構成每個樣本總像素的 5%。這種極端的類別不平衡對具有不同微尺度裂紋的深度學習模型構成挑戰，因為網路可能偏向於預測多數類別，通常導致檢測準確度不佳。本研究建立在先前的基準 SpAsE-Net，一種用於微裂紋檢測的不對稱編碼器-解碼器網路。透過使用流形發現和分析 (MDA) 演算法進行特徵空間視覺化，檢驗了各種激活和損失函數的影響。最佳化的架構和訓練方法達到 86.85% 的準確度。", "author": "Fatahlla Moreh et.al.", "authors": "Fatahlla Moreh, Yusuf Hasan, Bilal Zahid Hussain, Mohammad Ammar, Sven Tomforde", "id": "2411.10015v1", "paper_url": "http://arxiv.org/abs/2411.10015v1", "repo": "null"}}