{"2502.02067": {"publish_time": "2025-02-04", "title": "AdaptBot: Combining LLM with Knowledge Graphs and Human Input for Generic-to-Specific Task Decomposition and Knowledge Refinement", "paper_summary": "Embodied agents assisting humans are often asked to complete a new task in a\nnew scenario. An agent preparing a particular dish in the kitchen based on a\nknown recipe may be asked to prepare a new dish or to perform cleaning tasks in\nthe storeroom. There may not be sufficient resources, e.g., time or labeled\nexamples, to train the agent for these new situations. Large Language Models\n(LLMs) trained on considerable knowledge across many domains are able to\npredict a sequence of abstract actions for such new tasks and scenarios,\nalthough it may not be possible for the agent to execute this action sequence\ndue to task-, agent-, or domain-specific constraints. Our framework addresses\nthese challenges by leveraging the generic predictions provided by LLM and the\nprior domain-specific knowledge encoded in a Knowledge Graph (KG), enabling an\nagent to quickly adapt to new tasks and scenarios. The robot also solicits and\nuses human input as needed to refine its existing knowledge. Based on\nexperimental evaluation over cooking and cleaning tasks in simulation domains,\nwe demonstrate that the interplay between LLM, KG, and human input leads to\nsubstantial performance gains compared with just using the LLM output.", "paper_summary_zh": "具身代理协助人类时，通常需要在新的情境中完成新的任务。基于已知食谱在厨房准备特定菜肴的代理可能会被要求准备新菜肴或在储藏室执行清洁任务。可能没有足够资源（例如时间或标记的示例）来训练代理以应对这些新情况。在许多领域接受大量知识训练的大型语言模型 (LLM) 能够预测此类新任务和情境的抽象动作序列，尽管代理可能无法执行此动作序列，因为任务、代理或特定于域的约束。我们的框架通过利用 LLM 提供的通用预测和知识图 (KG) 中编码的先前特定于域的知识来应对这些挑战，使代理能够快速适应新任务和情境。该机器人还会根据需要征求并使用人类输入来完善其现有知识。基于在模拟域中对烹饪和清洁任务的实验评估，我们证明了 LLM、KG 和人类输入之间的相互作用与仅使用 LLM 输出相比带来了巨大的性能提升。", "author": "Shivam Singh et.al.", "authors": "Shivam Singh, Karthik Swaminathan, Nabanita Dash, Ramandeep Singh, Snehasis Banerjee, Mohan Sridharan, Madhava Krishna", "id": "2502.02067v1", "paper_url": "http://arxiv.org/abs/2502.02067v1", "repo": "https://github.com/sssshivvvv/adaptbot"}}