{"2406.02224": {"publish_time": "2024-06-04", "title": "FedMKT: Federated Mutual Knowledge Transfer for Large and Small Language Models", "paper_summary": "Recent research in federated large language models (LLMs) has primarily\nfocused on enabling clients to fine-tune their locally deployed homogeneous\nLLMs collaboratively or on transferring knowledge from server-based LLMs to\nsmall language models (SLMs) at downstream clients. However, a significant gap\nremains in the simultaneous mutual enhancement of both the server's LLM and\nclients' SLMs. To bridge this gap, we propose FedMKT, a parameter-efficient\nfederated mutual knowledge transfer framework for large and small language\nmodels. This framework is designed to adaptively transfer knowledge from the\nserver's LLM to clients' SLMs while concurrently enriching the LLM with\nclients' unique domain insights. We facilitate token alignment using minimum\nedit distance (MinED) and then selective mutual knowledge transfer between\nclient-side SLMs and a server-side LLM, aiming to collectively enhance their\nperformance. Through extensive experiments across three distinct scenarios,\nheterogeneous, homogeneous, and one-to-one, we evaluate the effectiveness of\nFedMKT using various public LLMs and SLMs on a range of NLP text generation\ntasks. Empirical results demonstrate significant performance improvements in\nclients' SLMs with the aid of the LLM. Furthermore, the LLM optimized by FedMKT\nachieves a performance comparable to that achieved through direct fine-tuning\nbased on clients' data, highlighting the effectiveness and adaptability of\nFedMKT.", "paper_summary_zh": "近期在联邦大型语言模型 (LLM) 的研究主要专注于让客户端协作微调其本地部署的同质 LLM，或将基于服务器的 LLM 的知识转移到下游客户端的小语言模型 (SLM)。然而，在服务器的 LLM 和客户端的 SLM 的同时相互增强方面仍然存在显著差距。为了弥合这一差距，我们提出了 FedMKT，一个针对大型和小型语言模型的参数高效联邦互知识迁移框架。此框架旨在自适应地将知识从服务器的 LLM 转移到客户端的 SLM，同时用客户端独特的领域见解丰富 LLM。我们利用最小编辑距离 (MinED) 来促进标记对齐，然后在客户端 SLM 和服务器端 LLM 之间进行选择性互知识迁移，旨在共同增强其性能。通过在三个不同的场景（异构、同构和一对一）中进行广泛的实验，我们使用各种公共 LLM 和 SLM 评估了 FedMKT 在一系列 NLP 文本生成任务中的有效性。实证结果表明，在 LLM 的帮助下，客户端的 SLM 性能有了显著提升。此外，通过 FedMKT 优化的 LLM 实现的性能与基于客户端数据进行直接微调所实现的性能相当，突出了 FedMKT 的有效性和适应性。", "author": "Tao Fan et.al.", "authors": "Tao Fan, Guoqiang Ma, Yan Kang, Hanlin Gu, Lixin Fan, Qiang Yang", "id": "2406.02224v1", "paper_url": "http://arxiv.org/abs/2406.02224v1", "repo": "null"}}