{"2411.15893": {"publish_time": "2024-11-24", "title": "Distribution-aware Online Continual Learning for Urban Spatio-Temporal Forecasting", "paper_summary": "Urban spatio-temporal (ST) forecasting is crucial for various urban\napplications such as intelligent scheduling and trip planning. Previous studies\nfocus on modeling ST correlations among urban locations in offline settings,\nwhich often neglect the non-stationary nature of urban ST data, particularly,\ndistribution shifts over time. This oversight can lead to degraded performance\nin real-world scenarios. In this paper, we first analyze the distribution\nshifts in urban ST data, and then introduce DOST, a novel online continual\nlearning framework tailored for ST data characteristics. DOST employs an\nadaptive ST network equipped with a variable-independent adapter to address the\nunique distribution shifts at each urban location dynamically. Further, to\naccommodate the gradual nature of these shifts, we also develop an\nawake-hibernate learning strategy that intermittently fine-tunes the adapter\nduring the online phase to reduce computational overhead. This strategy\nintegrates a streaming memory update mechanism designed for urban ST sequential\ndata, enabling effective network adaptation to new patterns while preventing\ncatastrophic forgetting. Experimental results confirm DOST's superiority over\nstate-of-the-art models on four real-world datasets, providing online forecasts\nwithin an average of 0.1 seconds and achieving a 12.89% reduction in forecast\nerrors compared to baseline models.", "paper_summary_zh": "城市時空 (ST) 預測對於各項城市應用至關重要，例如智慧排程和行程規劃。先前的研究專注於在離線設定中建模城市位置之間的 ST 關聯性，這常常忽略了城市 ST 資料的非平穩特性，特別是隨著時間推移的分配轉移。這種疏忽可能導致實際場景中的效能下降。在本文中，我們首先分析城市 ST 資料中的分配轉移，然後介紹 DOST，一個針對 ST 資料特性的新穎線上持續學習架構。DOST 使用配備可變獨立適配器的自適應 ST 網路，以動態解決每個城市位置的獨特分配轉移。此外，為了適應這些轉移的漸進式特性，我們還開發了一種清醒休眠學習策略，在線上階段間歇性地微調適配器，以降低運算負擔。此策略整合了一個專為城市 ST 順序資料設計的串流記憶體更新機制，讓網路能有效適應新的模式，同時防止災難性遺忘。實驗結果證實 DOST 在四個真實世界資料集上優於最先進的模型，在平均 0.1 秒內提供線上預測，並與基準模型相比，預測誤差減少了 12.89%。", "author": "Chengxin Wang et.al.", "authors": "Chengxin Wang, Gary Tan, Swagato Barman Roy, Beng Chin Ooi", "id": "2411.15893v1", "paper_url": "http://arxiv.org/abs/2411.15893v1", "repo": "null"}}