{"2501.02732": {"publish_time": "2025-01-06", "title": "AFed: Algorithmic Fair Federated Learning", "paper_summary": "Federated Learning (FL) has gained significant attention as it facilitates\ncollaborative machine learning among multiple clients without centralizing\ntheir data on a server. FL ensures the privacy of participating clients by\nlocally storing their data, which creates new challenges in fairness.\nTraditional debiasing methods assume centralized access to sensitive\ninformation, rendering them impractical for the FL setting. Additionally, FL is\nmore susceptible to fairness issues than centralized machine learning due to\nthe diverse client data sources that may be associated with group information.\nTherefore, training a fair model in FL without access to client local data is\nimportant and challenging. This paper presents AFed, a straightforward yet\neffective framework for promoting group fairness in FL. The core idea is to\ncircumvent restricted data access by learning the global data distribution.\nThis paper proposes two approaches: AFed-G, which uses a conditional generator\ntrained on the server side, and AFed-GAN, which improves upon AFed-G by\ntraining a conditional GAN on the client side. We augment the client data with\nthe generated samples to help remove bias. Our theoretical analysis justifies\nthe proposed methods, and empirical results on multiple real-world datasets\ndemonstrate a substantial improvement in AFed over several baselines.", "paper_summary_zh": "聯盟式學習 (FL) 獲得顯著的關注，因為它促進多個用戶之間的協作機器學習，而無需將其資料集中在伺服器上。FL 透過在本地儲存參與用戶的資料來確保其隱私，這在公平性方面產生新的挑戰。傳統的去偏見方法假設集中存取敏感資訊，讓它們不適用於 FL 設定。此外，FL 比集中式機器學習更容易受到公平性問題的影響，因為多樣化的用戶資料來源可能與群組資訊相關聯。因此，在無法存取用戶本地資料的情況下訓練 FL 中的公平模型非常重要且具有挑戰性。本文提出 AFed，一個直接但有效的架構，用於促進 FL 中的群組公平性。核心概念是透過學習全球資料分佈來規避受限的資料存取。本文提出兩種方法：AFed-G，它使用在伺服器端訓練的條件式產生器，以及 AFed-GAN，它透過在用戶端訓練條件式 GAN 來改善 AFed-G。我們使用產生的範例擴充用戶資料，以協助消除偏見。我們的理論分析證明了所提出的方法，而多個真實世界資料集上的經驗結果證明 AFed 在多個基準上都有顯著的改善。", "author": "Huiqiang Chen et.al.", "authors": "Huiqiang Chen, Tianqing Zhu, Wanlei Zhou, Wei Zhao", "id": "2501.02732v1", "paper_url": "http://arxiv.org/abs/2501.02732v1", "repo": "null"}}