{"2409.16120": {"publish_time": "2024-09-24", "title": "MOSS: Enabling Code-Driven Evolution and Context Management for AI Agents", "paper_summary": "Developing AI agents powered by large language models (LLMs) faces\nsignificant challenges in achieving true Turing completeness and adaptive,\ncode-driven evolution. Current approaches often generate code independently of\nits runtime context, relying heavily on the LLM's memory, which results in\ninefficiencies and limits adaptability. Manual protocol development in sandbox\nenvironments further constrains the agent's autonomous adaptability. Crucially,\nachieving consistency in code and context across multi-turn interactions and\nensuring isolation of local variables within each interaction remains an\nunsolved problem.\n  We introduce MOSS (llM-oriented Operating System Simulation), a novel\nframework that addresses these challenges by integrating code generation with a\ndynamic context management system. MOSS ensures consistency and adaptability by\nusing a mechanism that maintains the Python context across interactions,\nincluding isolation of local variables and preservation of runtime integrity.\nAt its core, the framework employs an Inversion of Control (IoC) container in\nconjunction with decorators to enforce the least knowledge principle, allowing\nagents to focus on abstract interfaces rather than concrete implementations.\nThis facilitates seamless integration of new tools and libraries, enables\nruntime instance replacement, and reduces prompt complexity, providing a \"what\nyou see is what you get\" environment for the agent.\n  Through a series of case studies, we show how this framework can enhance the\nefficiency and capabilities of agent development and highlight its advantages\nin moving towards Turing-complete agents capable of evolving through code.", "paper_summary_zh": "開發由大型語言模型（LLM）驅動的人工智慧代理程式在實現真正的圖靈完備性以及適應性、以程式碼為導向的演化方面面臨重大挑戰。目前的做法通常獨立於其執行時間上下文產生程式碼，嚴重依賴 LLM 的記憶體，這會導致效率低下並限制適應性。沙盒環境中的手動協定開發進一步限制了代理程式的自主適應性。至關重要的是，在多輪互動中實現程式碼和上下文的相容性，並確保每個互動中局部變數的隔離仍然是一個未解決的問題。\n我們引入了 MOSS（面向 llM 的作業系統模擬），這是一個新穎的架構，它透過將程式碼產生與動態上下文管理系統整合來解決這些挑戰。MOSS 透過使用一種在互動中維護 Python 上下文的機制來確保相容性和適應性，包括隔離局部變數和保留執行時間完整性。在核心部分，該架構採用控制反轉 (IoC) 容器，並結合裝飾器來強制執行最少知識原則，讓代理程式能夠專注於抽象介面，而不是具體實作。這促進了新工具和函式庫的無縫整合，支援執行時間實例替換，並降低提示複雜性，為代理程式提供「所見即所得」的環境。\n透過一系列案例研究，我們展示了這個架構如何增強代理程式開發的效率和能力，並強調其在朝向能夠透過程式碼演化的圖靈完備代理程式邁進的優勢。", "author": "Ming Zhu et.al.", "authors": "Ming Zhu, Yi Zhou", "id": "2409.16120v1", "paper_url": "http://arxiv.org/abs/2409.16120v1", "repo": "https://github.com/ghost-in-moss/ghostos"}}