{"2412.02101": {"publish_time": "2024-12-03", "title": "Improving Language Transfer Capability of Decoder-only Architecture in Multilingual Neural Machine Translation", "paper_summary": "Existing multilingual neural machine translation (MNMT) approaches mainly\nfocus on improving models with the encoder-decoder architecture to translate\nmultiple languages. However, decoder-only architecture has been explored less\nin MNMT due to its underperformance when trained on parallel data solely. In\nthis work, we attribute the issue of the decoder-only architecture to its lack\nof language transfer capability. Specifically, the decoder-only architecture is\ninsufficient in encoding source tokens with the target language features. We\npropose dividing the decoding process into two stages so that target tokens are\nexplicitly excluded in the first stage to implicitly boost the transfer\ncapability across languages. Additionally, we impose contrastive learning on\ntranslation instructions, resulting in improved performance in zero-shot\ntranslation. We conduct experiments on TED-19 and OPUS-100 datasets,\nconsidering both training from scratch and fine-tuning scenarios. Experimental\nresults show that, compared to the encoder-decoder architecture, our methods\nnot only perform competitively in supervised translations but also achieve\nimprovements of up to 3.39 BLEU, 6.99 chrF++, 3.22 BERTScore, and 4.81 COMET in\nzero-shot translations.", "paper_summary_zh": "現有的多語言神經機器翻譯 (MNMT) 方法主要專注於改進具有編碼器-解碼器架構的模型，以翻譯多種語言。然而，由於僅在平行數據上訓練時效能不佳，因此在 MNMT 中較少探討僅解碼器架構。在這項工作中，我們將僅解碼器架構的問題歸因於其缺乏語言轉移能力。具體來說，僅解碼器架構不足以使用目標語言功能對源代幣進行編碼。我們建議將解碼過程分為兩個階段，以便在第一階段明確排除目標代幣，從而隱式提升跨語言的轉移能力。此外，我們對翻譯說明施加對比學習，從而提高零次學習翻譯的效能。我們在 TED-19 和 OPUS-100 資料集上進行實驗，同時考慮從頭訓練和微調場景。實驗結果表明，與編碼器-解碼器架構相比，我們的模型不僅在監督式翻譯中具有競爭力，而且在零次學習翻譯中，BLEU、chrF++、BERTScore 和 COMET 分別提高了 3.39、6.99、3.22 和 4.81。", "author": "Zhi Qu et.al.", "authors": "Zhi Qu, Yiran Wang, Chenchen Ding, Hideki Tanaka, Masao Utiyama, Taro Watanabe", "id": "2412.02101v1", "paper_url": "http://arxiv.org/abs/2412.02101v1", "repo": "null"}}