{"2411.08764": {"publish_time": "2024-11-13", "title": "Flow reconstruction in time-varying geometries using graph neural networks", "paper_summary": "The paper presents a Graph Attention Convolutional Network (GACN) for flow\nreconstruction from very sparse data in time-varying geometries. The model\nincorporates a feature propagation algorithm as a preprocessing step to handle\nextremely sparse inputs, leveraging information from neighboring nodes to\ninitialize missing features. In addition, a binary indicator is introduced as a\nvalidity mask to distinguish between the original and propagated data points,\nenabling more effective learning from sparse inputs. Trained on a unique data\nset of Direct Numerical Simulations (DNS) of a motored engine at a technically\nrelevant operating condition, the GACN shows robust performance across\ndifferent resolutions and domain sizes and can effectively handle unstructured\ndata and variable input sizes. The model is tested on previously unseen DNS\ndata as well as on an experimental data set from Particle Image Velocimetry\n(PIV) measurements that were not considered during training. A comparative\nanalysis shows that the GACN consistently outperforms both a conventional\nConvolutional Neural Network (CNN) and cubic interpolation methods on the DNS\nand PIV test sets by achieving lower reconstruction errors and better capturing\nfine-scale turbulent structures. In particular, the GACN effectively\nreconstructs flow fields from domains up to 14 times larger than those observed\nduring training, with the performance advantage increasing for larger domains.", "paper_summary_zh": "本文提出了一种图注意力卷积网络 (GACN)，用于从时变几何中的极稀疏数据重建流动。该模型将特征传播算法作为预处理步骤，以处理极稀疏输入，利用来自相邻节点的信息来初始化缺失特征。此外，引入了一个二进制指示符作为有效掩码，以区分原始数据点和传播数据点，从而能够更有效地从稀疏输入中学习。在技术相关操作条件下对电机引擎的直接数值模拟 (DNS) 的唯一数据集上进行训练后，GACN 在不同的分辨率和域大小上显示出稳健的性能，并且可以有效地处理非结构化数据和可变输入大小。该模型在以前未见过的 DNS 数据以及在训练期间未考虑的粒子图像测速 (PIV) 测量实验数据集上进行了测试。比较分析表明，GACN 在 DNS 和 PIV 测试集上始终优于传统的卷积神经网络 (CNN) 和三次插值方法，通过实现较低的重建误差和更好地捕获小尺度湍流结构。特别是，GACN 有效地从比训练期间观测到的域大 14 倍的域重建流场，并且随着域的增大，性能优势也随之增加。", "author": "Bogdan A. Danciu et.al.", "authors": "Bogdan A. Danciu, Vito A. Pagone, Benjamin Böhm, Marius Schmidt, Christos E. Frouzakis", "id": "2411.08764v1", "paper_url": "http://arxiv.org/abs/2411.08764v1", "repo": "null"}}