{"2503.09947": {"publish_time": "2025-03-13", "title": "Identifying Trustworthiness Challenges in Deep Learning Models for Continental-Scale Water Quality Prediction", "paper_summary": "Water quality is foundational to environmental sustainability, ecosystem\nresilience, and public health. Deep learning models, particularly Long\nShort-Term Memory (LSTM) networks, offer transformative potential for\nlarge-scale water quality prediction and scientific insights generation.\nHowever, their widespread adoption in high-stakes decision-making, such as\npollution mitigation and equitable resource allocation, is prevented by\nunresolved trustworthiness challenges including fairness, uncertainty,\ninterpretability, robustness, generalizability, and reproducibility. In this\nwork, we present the first comprehensive evaluation of trustworthiness in a\ncontinental-scale multi-task LSTM model predicting 20 water quality variables\n(encompassing physical/chemical processes, geochemical weathering, and nutrient\ncycling) across 482 U.S. basins. Our investigation uncovers systematic patterns\nof model performance disparities linked to basin characteristics, the inherent\ncomplexity of biogeochemical processes, and variable predictability,\nemphasizing critical performance fairness concerns. We further propose\nmethodological frameworks for quantitatively evaluating critical aspects of\ntrustworthiness, including uncertainty, interpretability, and robustness,\nidentifying key limitations that could challenge reliable real-world\ndeployment. This work serves as a timely call to action for advancing\ntrustworthy data-driven methods for water resources management and provides a\npathway to offering critical insights for researchers, decision-makers, and\npractitioners seeking to leverage artificial intelligence (AI) responsibly in\nenvironmental management.", "paper_summary_zh": "<paragraph>水質是環境永續、生態系統韌性和公共衛生的基礎。深度學習模型，尤其是長短期記憶（LSTM）網絡，為大規模水質預測和科學洞見的產生提供了變革性的潛力。然而，它們在高風險決策（例如污染減輕和公平資源分配）中的廣泛應用，卻受到尚未解決的可信度挑戰的阻礙，這些挑戰包括公平性、不確定性、可解釋性、穩健性、泛化性和可重複性。在這項工作中，我們首次對一個大陸尺度的多任務 LSTM 模型進行了全面的可信度評估，該模型預測了美國 482 個流域的 20 個水質變量（涵蓋物理/化學過程、地球化學風化和養分循環）。我們的調查揭示了與流域特徵、生物地球化學過程的固有複雜性和變量可預測性相關的模型性能差異的系統模式，強調了關鍵的性能公平性問題。我們進一步提出了用於定量評估可信度關鍵方面的的方法框架，包括不確定性、可解釋性和穩健性，確定了可能挑戰可靠的現實世界部署的關鍵限制。這項工作作為及時的行動呼籲，推動了用於水資源管理的可信數據驅動方法的發展，並為尋求在環境管理中負責任地利用人工智能 (AI) 的研究人員、決策者和從業者提供了獲得關鍵見解的途徑。</paragraph>\n", "author": "Xiaobo Xia et.al.", "authors": "Xiaobo Xia, Xiaofeng Liu, Jiale Liu, Kuai Fang, Lu Lu, Samet Oymak, William S. Currie, Tongliang Liu", "id": "2503.09947v1", "paper_url": "http://arxiv.org/abs/2503.09947v1", "repo": "null"}}