{"2501.14342": {"publish_time": "2025-01-24", "title": "Chain-of-Retrieval Augmented Generation", "paper_summary": "This paper introduces an approach for training o1-like RAG models that\nretrieve and reason over relevant information step by step before generating\nthe final answer. Conventional RAG methods usually perform a single retrieval\nstep before the generation process, which limits their effectiveness in\naddressing complex queries due to imperfect retrieval results. In contrast, our\nproposed method, CoRAG (Chain-of-Retrieval Augmented Generation), allows the\nmodel to dynamically reformulate the query based on the evolving state. To\ntrain CoRAG effectively, we utilize rejection sampling to automatically\ngenerate intermediate retrieval chains, thereby augmenting existing RAG\ndatasets that only provide the correct final answer. At test time, we propose\nvarious decoding strategies to scale the model's test-time compute by\ncontrolling the length and number of sampled retrieval chains. Experimental\nresults across multiple benchmarks validate the efficacy of CoRAG, particularly\nin multi-hop question answering tasks, where we observe more than 10 points\nimprovement in EM score compared to strong baselines. On the KILT benchmark,\nCoRAG establishes a new state-of-the-art performance across a diverse range of\nknowledge-intensive tasks. Furthermore, we offer comprehensive analyses to\nunderstand the scaling behavior of CoRAG, laying the groundwork for future\nresearch aimed at developing factual and grounded foundation models.", "paper_summary_zh": "本文介紹一種訓練類似 o1 的 RAG 模型的方法，該模型在產生最終答案之前，會逐步擷取並推理相關資訊。傳統的 RAG 方法通常在產生過程之前執行單一擷取步驟，這會限制它們在處理複雜查詢時的有效性，因為擷取結果不完美。相反，我們提出的方法 CoRAG（擷取增強生成鏈）允許模型根據演化狀態動態重新表述查詢。為了有效訓練 CoRAG，我們利用拒絕抽樣自動產生中間擷取鏈，從而擴充現有的 RAG 資料集，這些資料集只提供正確的最終答案。在測試時，我們提出各種解碼策略，透過控制抽樣擷取鏈的長度和數量來擴充模型的測試時間運算。在多個基準測試中的實驗結果驗證了 CoRAG 的效能，特別是在多跳式問答任務中，我們觀察到 EM 分數比強大的基線改進了 10 分以上。在 KILT 基準測試中，CoRAG 在各種知識密集型任務中建立了新的最先進效能。此外，我們提供全面的分析來了解 CoRAG 的擴充行為，為未來旨在開發事實和基礎基礎模型的研究奠定基礎。", "author": "Liang Wang et.al.", "authors": "Liang Wang, Haonan Chen, Nan Yang, Xiaolong Huang, Zhicheng Dou, Furu Wei", "id": "2501.14342v1", "paper_url": "http://arxiv.org/abs/2501.14342v1", "repo": "null"}}