{"2408.01003": {"publish_time": "2024-08-02", "title": "Piculet: Specialized Models-Guided Hallucination Decrease for MultiModal Large Language Models", "paper_summary": "Multimodal Large Language Models (MLLMs) have made significant progress in\nbridging the gap between visual and language modalities. However,\nhallucinations in MLLMs, where the generated text does not align with image\ncontent, continue to be a major challenge. Existing methods for addressing\nhallucinations often rely on instruction-tuning, which requires retraining the\nmodel with specific data, which increases the cost of utilizing MLLMs further.\nIn this paper, we introduce a novel training-free method, named Piculet, for\nenhancing the input representation of MLLMs. Piculet leverages multiple\nspecialized models to extract descriptions of visual information from the input\nimage and combine these descriptions with the original image and query as input\nto the MLLM. We evaluate our method both quantitively and qualitatively, and\nthe results demonstrate that Piculet greatly decreases hallucinations of MLLMs.\nOur method can be easily extended to different MLLMs while being universal.", "paper_summary_zh": "多模態大型語言模型 (MLLM) 在彌合視覺與語言模式之間的差距方面取得了顯著進展。然而，MLLM 中的幻覺，即生成的文字與影像內容不符，仍然是一項重大挑戰。現有解決幻覺的方法通常依賴於指令微調，這需要使用特定資料重新訓練模型，這進一步增加了使用 MLLM 的成本。在本文中，我們介紹了一種新的免訓練方法，稱為 Piculet，用於增強 MLLM 的輸入表示。Piculet 利用多個專業模型從輸入影像中提取視覺資訊的描述，並將這些描述與原始影像和查詢結合作為輸入提供給 MLLM。我們對方法進行了量化和質化評估，結果表明 Piculet 大大減少了 MLLM 的幻覺。我們的這種方法可以輕鬆地擴展到不同的 MLLM，同時具有通用性。", "author": "Kohou Wang et.al.", "authors": "Kohou Wang, Xiang Liu, Zhaoxiang Liu, Kai Wang, Shiguo Lian", "id": "2408.01003v1", "paper_url": "http://arxiv.org/abs/2408.01003v1", "repo": "null"}}