{"2406.18995": {"publish_time": "2024-06-27", "title": "FedMLP: Federated Multi-Label Medical Image Classification under Task Heterogeneity", "paper_summary": "Cross-silo federated learning (FL) enables decentralized organizations to\ncollaboratively train models while preserving data privacy and has made\nsignificant progress in medical image classification. One common assumption is\ntask homogeneity where each client has access to all classes during training.\nHowever, in clinical practice, given a multi-label classification task,\nconstrained by the level of medical knowledge and the prevalence of diseases,\neach institution may diagnose only partial categories, resulting in task\nheterogeneity. How to pursue effective multi-label medical image classification\nunder task heterogeneity is under-explored. In this paper, we first formulate\nsuch a realistic label missing setting in the multi-label FL domain and propose\na two-stage method FedMLP to combat class missing from two aspects: pseudo\nlabel tagging and global knowledge learning. The former utilizes a warmed-up\nmodel to generate class prototypes and select samples with high confidence to\nsupplement missing labels, while the latter uses a global model as a teacher\nfor consistency regularization to prevent forgetting missing class knowledge.\nExperiments on two publicly-available medical datasets validate the superiority\nof FedMLP against the state-of-the-art both federated semi-supervised and noisy\nlabel learning approaches under task heterogeneity. Code is available at\nhttps://github.com/szbonaldo/FedMLP.", "paper_summary_zh": "跨資料庫聯邦學習 (FL) 讓分散式組織能夠在保留資料隱私的同時協作訓練模型，並在醫學影像分類方面取得顯著進展。一個常見的假設是任務同質性，其中每個客戶端在訓練期間都可以存取所有類別。然而，在臨床實務中，給定一個多標籤分類任務，受限於醫學知識的層級和疾病的流行率，每個機構可能只診斷部分類別，導致任務異質性。如何在任務異質性下追求有效的多標籤醫學影像分類仍有待探討。在本文中，我們首先在多標籤 FL 領域中制定這種現實的標籤遺失設定，並提出一個兩階段方法 FedMLP 來從兩個方面解決類別遺失問題：偽標籤標記和全局知識學習。前者利用熱身模型產生類別原型，並選擇具有高度信心的樣本來補充遺失標籤，而後者使用全局模型作為教師進行一致性正則化，以防止遺忘遺失類別的知識。在兩個公開可用的醫學資料集上進行的實驗驗證了 FedMLP 在任務異質性下優於最先進的聯合半監督和雜訊標籤學習方法。程式碼可在 https://github.com/szbonaldo/FedMLP 取得。", "author": "Zhaobin Sun et.al.", "authors": "Zhaobin Sun, Nannan Wu, Junjie Shi, Li Yu, Xin Yang, Kwang-Ting Cheng, Zengqiang Yan", "id": "2406.18995v1", "paper_url": "http://arxiv.org/abs/2406.18995v1", "repo": "https://github.com/szbonaldo/fedmlp"}}