{"2409.12450": {"publish_time": "2024-09-19", "title": "Domain Generalization for Endoscopic Image Segmentation by Disentangling Style-Content Information and SuperPixel Consistency", "paper_summary": "Frequent monitoring is necessary to stratify individuals based on their\nlikelihood of developing gastrointestinal (GI) cancer precursors. In clinical\npractice, white-light imaging (WLI) and complementary modalities such as\nnarrow-band imaging (NBI) and fluorescence imaging are used to assess risk\nareas. However, conventional deep learning (DL) models show degraded\nperformance due to the domain gap when a model is trained on one modality and\ntested on a different one. In our earlier approach, we used a superpixel-based\nmethod referred to as \"SUPRA\" to effectively learn domain-invariant information\nusing color and space distances to generate groups of pixels. One of the main\nlimitations of this earlier work is that the aggregation does not exploit\nstructural information, making it suboptimal for segmentation tasks, especially\nfor polyps and heterogeneous color distributions. Therefore, in this work, we\npropose an approach for style-content disentanglement using instance\nnormalization and instance selective whitening (ISW) for improved domain\ngeneralization when combined with SUPRA. We evaluate our approach on two\ndatasets: EndoUDA Barrett's Esophagus and EndoUDA polyps, and compare its\nperformance with three state-of-the-art (SOTA) methods. Our findings\ndemonstrate a notable enhancement in performance compared to both baseline and\nSOTA methods across the target domain data. Specifically, our approach\nexhibited improvements of 14%, 10%, 8%, and 18% over the baseline and three\nSOTA methods on the polyp dataset. Additionally, it surpassed the second-best\nmethod (EndoUDA) on the Barrett's Esophagus dataset by nearly 2%.", "paper_summary_zh": "為了根據個人罹患胃腸道 (GI) 癌前驅病變的可能性對其進行分層，頻繁監控是必要的。在臨床實務中，白光影像 (WLI) 和補充方式（例如窄頻影像 (NBI) 和螢光影像）用於評估風險區域。然而，當模型在一個方式上訓練並在不同的方式上測試時，傳統深度學習 (DL) 模型會因為領域差距而顯示出降低的效能。在我們之前的方法中，我們使用稱為「SUPRA」的超像素為基礎的方法，使用顏色和空間距離有效地學習領域不變資訊以產生像素群組。這項早期工作的其中一項主要限制是，聚合並未利用結構資訊，這使得它不適合分割任務，特別是對於息肉和異質性顏色分佈。因此，在這項工作中，我們提出一個使用實例正規化和實例選擇性白化 (ISW) 進行風格內容解開的方法，以在與 SUPRA 結合時改善領域概化。我們在兩個資料集上評估我們的方法：EndoUDA Barrett 食道和 EndoUDA 息肉，並將其效能與三種最先進 (SOTA) 方法進行比較。我們的研究結果顯示，與目標領域資料上的基線和 SOTA 方法相比，效能有顯著的提升。具體來說，我們的方法在息肉資料集上比基線和三種 SOTA 方法分別提升了 14%、10%、8% 和 18%。此外，它在 Barrett 食道資料集上比第二好的方法 (EndoUDA) 高出近 2%。", "author": "Mansoor Ali Teevno et.al.", "authors": "Mansoor Ali Teevno, Rafael Martinez-Garcia-Pena, Gilberto Ochoa-Ruiz, Sharib Ali", "id": "2409.12450v1", "paper_url": "http://arxiv.org/abs/2409.12450v1", "repo": "null"}}