{"2408.04614": {"publish_time": "2024-08-08", "title": "Better Alignment with Instruction Back-and-Forth Translation", "paper_summary": "We propose a new method, instruction back-and-forth translation, to construct\nhigh-quality synthetic data grounded in world knowledge for aligning large\nlanguage models (LLMs). Given documents from a web corpus, we generate and\ncurate synthetic instructions using the backtranslation approach proposed by Li\net al.(2023a), and rewrite the responses to improve their quality further based\non the initial documents. Fine-tuning with the resulting (backtranslated\ninstruction, rewritten response) pairs yields higher win rates on AlpacaEval\nthan using other common instruction datasets such as Humpback, ShareGPT, Open\nOrca, Alpaca-GPT4 and Self-instruct. We also demonstrate that rewriting the\nresponses with an LLM outperforms direct distillation, and the two generated\ntext distributions exhibit significant distinction in embedding space. Further\nanalysis shows that our backtranslated instructions are of higher quality than\nother sources of synthetic instructions, while our responses are more diverse\nand complex than those obtained from distillation. Overall we find that\ninstruction back-and-forth translation combines the best of both worlds --\nmaking use of the information diversity and quantity found on the web, while\nensuring the quality of the responses which is necessary for effective\nalignment.", "paper_summary_zh": "我們提出了一種新的方法，即指令來回翻譯，用於構建\n基於世界知識的高品質合成資料，以對齊大型\n語言模型 (LLM)。給定來自網路語料庫的文件，我們生成並\n使用 Li\net al.(2023a) 提出的回譯方法整理合成指令，並根據\n原始文件進一步改寫回應以提升其品質。使用產生的（回譯\n指令、改寫回應）配對進行微調，在 AlpacaEval 上產生的獲勝率\n高於使用其他常見指令資料集，例如 Humpback、ShareGPT、Open\nOrca、Alpaca-GPT4 和 Self-instruct。我們也證明了使用 LLM 改寫\n回應的表現優於直接萃取，而且這兩個生成的\n文字分佈在嵌入空間中展現出顯著的區別。進一步的分析顯示，我們的回譯\n指令品質高於其他合成指令來源，而我們的回應則比從萃取中獲得的\n回應更為多元且複雜。總體而言，我們發現指令來回翻譯結合了兩全其美的優點\n——利用網路上的資訊多元性和數量，同時\n確保回應的品質，這對於有效的對齊是必要的。", "author": "Thao Nguyen et.al.", "authors": "Thao Nguyen, Jeffrey Li, Sewoong Oh, Ludwig Schmidt, Jason Weston, Luke Zettlemoyer, Xian Li", "id": "2408.04614v1", "paper_url": "http://arxiv.org/abs/2408.04614v1", "repo": "null"}}