{"2412.19523": {"publish_time": "2024-12-27", "title": "Attribution for Enhanced Explanation with Transferable Adversarial eXploration", "paper_summary": "The interpretability of deep neural networks is crucial for understanding\nmodel decisions in various applications, including computer vision.\nAttEXplore++, an advanced framework built upon AttEXplore, enhances attribution\nby incorporating transferable adversarial attack methods such as MIG and GRA,\nsignificantly improving the accuracy and robustness of model explanations. We\nconduct extensive experiments on five models, including CNNs (Inception-v3,\nResNet-50, VGG16) and vision transformers (MaxViT-T, ViT-B/16), using the\nImageNet dataset. Our method achieves an average performance improvement of\n7.57\\% over AttEXplore and 32.62\\% compared to other state-of-the-art\ninterpretability algorithms. Using insertion and deletion scores as evaluation\nmetrics, we show that adversarial transferability plays a vital role in\nenhancing attribution results. Furthermore, we explore the impact of\nrandomness, perturbation rate, noise amplitude, and diversity probability on\nattribution performance, demonstrating that AttEXplore++ provides more stable\nand reliable explanations across various models. We release our code at:\nhttps://anonymous.4open.science/r/ATTEXPLOREP-8435/", "paper_summary_zh": "深度神经网络的可解释性对于理解各种应用（包括计算机视觉）中的模型决策至关重要。AttEXplore++ 是建立在 AttEXplore 之上的高级框架，通过整合可转移对抗攻击方法（例如 MIG 和 GRA）来增强归因，从而显著提高模型解释的准确性和鲁棒性。我们对五个模型（包括 CNN（Inception-v3、ResNet-50、VGG16）和视觉转换器（MaxViT-T、ViT-B/16））进行了广泛的实验，使用 ImageNet 数据集。我们的方法比 AttEXplore 实现了平均 7.57% 的性能提升，比其他最先进的可解释性算法提升了 32.62%。使用插入和删除分数作为评估指标，我们表明对抗可转移性在增强归因结果中起着至关重要的作用。此外，我们探讨了随机性、扰动率、噪声幅度和多样性概率对归因性能的影响，证明 AttEXplore++ 在各种模型中提供了更稳定和可靠的解释。我们在以下位置发布我们的代码：https://anonymous.4open.science/r/ATTEXPLOREP-8435/", "author": "Zhiyu Zhu et.al.", "authors": "Zhiyu Zhu, Jiayu Zhang, Zhibo Jin, Huaming Chen, Jianlong Zhou, Fang Chen", "id": "2412.19523v1", "paper_url": "http://arxiv.org/abs/2412.19523v1", "repo": "null"}}