{"2408.07945": {"publish_time": "2024-08-15", "title": "Solving a Rubik's Cube Using its Local Graph Structure", "paper_summary": "The Rubix Cube is a 3-dimensional single-player combination puzzle attracting\nattention in the reinforcement learning community. A Rubix Cube has six faces\nand twelve possible actions, leading to a small and unconstrained action space\nand a very large state space with only one goal state. Modeling such a large\nstate space and storing the information of each state requires exceptional\ncomputational resources, which makes it challenging to find the shortest\nsolution to a scrambled Rubix cube with limited resources. The Rubix Cube can\nbe represented as a graph, where states of the cube are nodes and actions are\nedges. Drawing on graph convolutional networks, we design a new heuristic,\nweighted convolutional distance, for A star search algorithm to find the\nsolution to a scrambled Rubix Cube. This heuristic utilizes the information of\nneighboring nodes and convolves them with attention-like weights, which creates\na deeper search for the shortest path to the solved state.", "paper_summary_zh": "魔術方塊是一個三維單人組合拼圖，在強化學習社群中備受關注。魔術方塊有六個面和十二種可能的動作，導致動作空間小且不受約束，以及只有單一目標狀態的非常大的狀態空間。對如此大的狀態空間建模並儲存每個狀態的資訊需要非凡的運算資源，這使得在有限資源下找到打亂的魔術方塊的最短解法具有挑戰性。魔術方塊可以表示為一個圖形，其中方塊的狀態是節點，動作是邊。利用圖形卷積網路，我們設計了一個新的啟發式方法，加權卷積距離，供 A 星搜尋演算法找到打亂的魔術方塊的解法。此啟發式方法利用鄰近節點的資訊，並透過類似的注意力權重對它們進行卷積，這會為求解狀態尋找更短路徑進行更深入的搜尋。", "author": "Shunyu Yao et.al.", "authors": "Shunyu Yao, Mitchy Lee", "id": "2408.07945v1", "paper_url": "http://arxiv.org/abs/2408.07945v1", "repo": "null"}}