{"2410.14225": {"publish_time": "2024-10-18", "title": "Few-Shot Joint Multimodal Entity-Relation Extraction via Knowledge-Enhanced Cross-modal Prompt Model", "paper_summary": "Joint Multimodal Entity-Relation Extraction (JMERE) is a challenging task\nthat aims to extract entities and their relations from text-image pairs in\nsocial media posts. Existing methods for JMERE require large amounts of labeled\ndata. However, gathering and annotating fine-grained multimodal data for JMERE\nposes significant challenges. Initially, we construct diverse and comprehensive\nmultimodal few-shot datasets fitted to the original data distribution. To\naddress the insufficient information in the few-shot setting, we introduce the\n\\textbf{K}nowledge-\\textbf{E}nhanced \\textbf{C}ross-modal \\textbf{P}rompt\n\\textbf{M}odel (KECPM) for JMERE. This method can effectively address the\nproblem of insufficient information in the few-shot setting by guiding a large\nlanguage model to generate supplementary background knowledge. Our proposed\nmethod comprises two stages: (1) a knowledge ingestion stage that dynamically\nformulates prompts based on semantic similarity guide ChatGPT generating\nrelevant knowledge and employs self-reflection to refine the knowledge; (2) a\nknowledge-enhanced language model stage that merges the auxiliary knowledge\nwith the original input and utilizes a transformer-based model to align with\nJMERE's required output format. We extensively evaluate our approach on a\nfew-shot dataset derived from the JMERE dataset, demonstrating its superiority\nover strong baselines in terms of both micro and macro F$_1$ scores.\nAdditionally, we present qualitative analyses and case studies to elucidate the\neffectiveness of our model.", "paper_summary_zh": "<paragraph>聯合多模態實體關係抽取 (JMERE) 是一項具有挑戰性的任務，旨在從社群媒體文章中的文字影像對中抽取實體及其關係。現有的 JMERE 方法需要大量的標籤資料。然而，收集和標註 JMERE 的細粒度多模態資料會帶來重大的挑戰。最初，我們構建了多樣化且全面的多模態少量資料集，以符合原始資料分佈。為了解決少量資料設定中的資訊不足問題，我們引入了\\textbf{K}nowledge-\\textbf{E}nhanced \\textbf{C}ross-modal \\textbf{P}rompt \\textbf{M}odel (KECPM) for JMERE。此方法可以透過引導大型語言模型產生補充背景知識來有效解決少量資料設定中的資訊不足問題。我們提出的方法包含兩個階段：(1) 知識吸收階段，根據語義相似性指南動態制定提示，引導 ChatGPT 產生相關知識，並利用自我反省來精進知識；(2) 知識增強語言模型階段，將輔助知識與原始輸入合併，並利用基於轉換器的模型與 JMERE 所需的輸出格式對齊。我們廣泛評估了我們的方法在從 JMERE 資料集衍生的少量資料集上的表現，證明其在微觀和巨觀 F$_1$ 分數方面都優於強大的基準。此外，我們提出定性分析和案例研究，以闡明我們模型的有效性。</paragraph>", "author": "Li Yuan et.al.", "authors": "Li Yuan, Yi Cai, Junsheng Huang", "id": "2410.14225v1", "paper_url": "http://arxiv.org/abs/2410.14225v1", "repo": "null"}}