{"2406.19561": {"publish_time": "2024-06-27", "title": "Meta-Gradient Search Control: A Method for Improving the Efficiency of Dyna-style Planning", "paper_summary": "We study how a Reinforcement Learning (RL) system can remain sample-efficient\nwhen learning from an imperfect model of the environment. This is particularly\nchallenging when the learning system is resource-constrained and in continual\nsettings, where the environment dynamics change. To address these challenges,\nour paper introduces an online, meta-gradient algorithm that tunes a\nprobability with which states are queried during Dyna-style planning. Our study\ncompares the aggregate, empirical performance of this meta-gradient method to\nbaselines that employ conventional sampling strategies. Results indicate that\nour method improves efficiency of the planning process, which, as a\nconsequence, improves the sample-efficiency of the overall learning process. On\nthe whole, we observe that our meta-learned solutions avoid several pathologies\nof conventional planning approaches, such as sampling inaccurate transitions\nand those that stall credit assignment. We believe these findings could prove\nuseful, in future work, for designing model-based RL systems at scale.", "paper_summary_zh": "我們研究強化學習 (RL) 系統如何能在從環境的不完美模型中學習時，仍然保持樣本效率。當學習系統資源受限且在環境動態變化的持續設定中時，這項任務特別具有挑戰性。為了應對這些挑戰，我們的論文提出了一種線上元梯度演算法，用來調整在 Dyna 式規劃期間查詢狀態的機率。我們的研究將此元梯度方法的總體經驗效能，與採用傳統抽樣策略的基線方法進行比較。結果顯示，我們的演算法提升了規劃程序的效率，進而提升了整體學習程序的樣本效率。總的來說，我們觀察到我們的元學習解法避免了傳統規劃方法的數種病態，例如抽取不準確的轉換以及阻礙信用指派的轉換。我們相信這些發現對於未來設計大規模的基於模型的 RL 系統很有用。", "author": "Bradley Burega et.al.", "authors": "Bradley Burega, John D. Martin, Luke Kapeluck, Michael Bowling", "id": "2406.19561v1", "paper_url": "http://arxiv.org/abs/2406.19561v1", "repo": "null"}}