{"2502.20988": {"publish_time": "2025-02-28", "title": "Merging Clinical Knowledge into Large Language Models for Medical Research and Applications: A Survey", "paper_summary": "Clinical knowledge is the collection of information learned from studies on\nthe causes, prognosis, diagnosis, and treatment of diseases. This type of\nknowledge can improve curing performances, and promote physical health. With\nthe emergence of large language models (LLMs), medical artificial intelligence\n(medical AI), which aims to apply academic medical AI systems to real-world\nmedical scenarios, has entered a new age of development, resulting in excellent\nworks such as DoctorGPT and Pangu-Drug from academic and industrial researches.\nHowever, the field lacks a comprehensive compendium and comparison of building\nmedical AI systems from academia and industry. Therefore, this survey focuses\non the building paradigms of medical AI systems including the use of clinical\ndatabases, datasets, training pipelines, integrating medical knowledge graphs,\nsystem applications, and evaluation systems. We hope that this survey can help\nrelevant practical researchers understand the current performance of academic\nmodels in various fields of healthcare, as well as the potential problems and\nfuture directions for implementing these scientific achievements.", "paper_summary_zh": "臨床知識是從疾病的病因、預後、診斷和治療研究中學到的信息的集合。這類知識可以提高治癒效果，促進身體健康。隨著大型語言模型 (LLM) 的出現，旨在將學術醫學 AI 系統應用於現實世界醫療場景的醫學人工智慧 (醫學 AI) 進入了一個新的發展時代，學術界和業界的研究成果斐然，例如 DoctorGPT 和盤古藥物。然而，該領域缺乏對學術界和業界構建醫學 AI 系統的全面彙編和比較。因此，本次綜述重點關注醫學 AI 系統的構建範例，包括臨床資料庫、數據集、訓練流程、整合醫學知識圖譜、系統應用和評估系統的使用。我們希望本次綜述可以幫助相關的實務研究人員了解學術模型在各個醫療保健領域的當前表現，以及實施這些科學成果的潛在問題和未來方向。\n", "author": "Qiyuan Li et.al.", "authors": "Qiyuan Li, Haijiang Liu, Caicai Guo, Deyu Chen, Meng Wang, Feng Gao, Jinguang Gu", "id": "2502.20988v1", "paper_url": "http://arxiv.org/abs/2502.20988v1", "repo": "null"}}