{"2409.05197": {"publish_time": "2024-09-08", "title": "Seemingly Plausible Distractors in Multi-Hop Reasoning: Are Large Language Models Attentive Readers?", "paper_summary": "State-of-the-art Large Language Models (LLMs) are accredited with an\nincreasing number of different capabilities, ranging from reading\ncomprehension, over advanced mathematical and reasoning skills to possessing\nscientific knowledge. In this paper we focus on their multi-hop reasoning\ncapability: the ability to identify and integrate information from multiple\ntextual sources.\n  Given the concerns with the presence of simplifying cues in existing\nmulti-hop reasoning benchmarks, which allow models to circumvent the reasoning\nrequirement, we set out to investigate, whether LLMs are prone to exploiting\nsuch simplifying cues. We find evidence that they indeed circumvent the\nrequirement to perform multi-hop reasoning, but they do so in more subtle ways\nthan what was reported about their fine-tuned pre-trained language model (PLM)\npredecessors. Motivated by this finding, we propose a challenging multi-hop\nreasoning benchmark, by generating seemingly plausible multi-hop reasoning\nchains, which ultimately lead to incorrect answers. We evaluate multiple open\nand proprietary state-of-the-art LLMs, and find that their performance to\nperform multi-hop reasoning is affected, as indicated by up to 45% relative\ndecrease in F1 score when presented with such seemingly plausible alternatives.\nWe conduct a deeper analysis and find evidence that while LLMs tend to ignore\nmisleading lexical cues, misleading reasoning paths indeed present a\nsignificant challenge.", "paper_summary_zh": "最先进的大语言模型 (LLM) 被认为具有越来越多的不同能力，从阅读理解、高级数学和推理技能到拥有科学知识。在本文中，我们专注于它们的多跳推理能力：识别和整合来自多个文本来源的信息的能力。\n鉴于现有的多跳推理基准中存在简化提示的问题，这些提示允许模型绕过推理要求，我们着手调查 LLM 是否容易利用此类简化提示。我们发现证据表明它们确实绕过了执行多跳推理的要求，但它们这样做的方式比针对经过微调的预训练语言模型 (PLM) 前辈所报告的更加微妙。受此发现的启发，我们提出了一个具有挑战性的多跳推理基准，通过生成看似合理的推理链，最终得出错误的答案。我们评估了多个开放且专有的最先进的 LLM，并发现它们执行多跳推理的性能受到影响，当提供如此看似合理的替代方案时，F1 分数最多会相对下降 45%。我们进行了更深入的分析，并找到了证据表明，虽然 LLM 倾向于忽略具有误导性的词汇提示，但具有误导性的推理路径确实构成了重大挑战。", "author": "Neeladri Bhuiya et.al.", "authors": "Neeladri Bhuiya, Viktor Schlegel, Stefan Winkler", "id": "2409.05197v1", "paper_url": "http://arxiv.org/abs/2409.05197v1", "repo": "null"}}