{"2411.06878": {"publish_time": "2024-11-11", "title": "GraphRPM: Risk Pattern Mining on Industrial Large Attributed Graphs", "paper_summary": "Graph-based patterns are extensively employed and favored by practitioners\nwithin industrial companies due to their capacity to represent the behavioral\nattributes and topological relationships among users, thereby offering enhanced\ninterpretability in comparison to black-box models commonly utilized for\nclassification and recognition tasks. For instance, within the scenario of\ntransaction risk management, a graph pattern that is characteristic of a\nparticular risk category can be readily employed to discern transactions\nfraught with risk, delineate networks of criminal activity, or investigate the\nmethodologies employed by fraudsters. Nonetheless, graph data in industrial\nsettings is often characterized by its massive scale, encompassing data sets\nwith millions or even billions of nodes, making the manual extraction of graph\npatterns not only labor-intensive but also necessitating specialized knowledge\nin particular domains of risk. Moreover, existing methodologies for mining\ngraph patterns encounter significant obstacles when tasked with analyzing\nlarge-scale attributed graphs. In this work, we introduce GraphRPM, an\nindustry-purpose parallel and distributed risk pattern mining framework on\nlarge attributed graphs. The framework incorporates a novel edge-involved graph\nisomorphism network alongside optimized operations for parallel graph\ncomputation, which collectively contribute to a considerable reduction in\ncomputational complexity and resource expenditure. Moreover, the intelligent\nfiltration of efficacious risky graph patterns is facilitated by the proposed\nevaluation metrics. Comprehensive experimental evaluations conducted on\nreal-world datasets of varying sizes substantiate the capability of GraphRPM to\nadeptly address the challenges inherent in mining patterns from large-scale\nindustrial attributed graphs, thereby underscoring its substantial value for\nindustrial deployment.", "paper_summary_zh": "<paragraph>圖形化模式因能表示使用者行為屬性和拓撲關係，在產業公司中被廣泛採用且受青睞，因此與常使用於分類和辨識任務的黑箱模型相比，具備增強的可解釋性。例如，在交易風險管理的情境中，具有特定風險類別特徵的圖形模式可輕易用於辨識風險交易、描繪犯罪活動網路，或調查詐騙者所採用的方法。然而，產業環境中的圖形資料通常以其龐大規模為特徵，包含數百萬甚至數十億個節點的資料集，這使得圖形模式的手動萃取不僅耗費大量人力，還需要特定風險領域的專業知識。此外，現有的圖形模式挖掘方法在分析大型屬性圖形時會遭遇重大障礙。在這項工作中，我們引入了 GraphRPM，一個針對大型屬性圖形進行產業用途平行且分散的風險模式挖掘架構。此架構結合了新穎的邊緣參與圖形同構網路以及平行圖形運算的最佳化運算，共同大幅降低了運算複雜度和資源支出。此外，所提出的評估指標有助於有效風險圖形模式的智慧化過濾。在各種規模的真實世界資料集上進行的全面實驗評估證實了 GraphRPM 能夠適當地解決從大型產業屬性圖形中挖掘模式所固有的挑戰，因此強調了其在產業部署中的重要價值。</paragraph>", "author": "Sheng Tian et.al.", "authors": "Sheng Tian, Xintan Zeng, Yifei Hu, Baokun Wang, Yongchao Liu, Yue Jin, Changhua Meng, Chuntao Hong, Tianyi Zhang, Weiqiang Wang", "id": "2411.06878v1", "paper_url": "http://arxiv.org/abs/2411.06878v1", "repo": "null"}}