{"2501.13299": {"publish_time": "2025-01-23", "title": "Hypothesis Generation for Materials Discovery and Design Using Goal-Driven and Constraint-Guided LLM Agents", "paper_summary": "Materials discovery and design are essential for advancing technology across\nvarious industries by enabling the development of application-specific\nmaterials. Recent research has leveraged Large Language Models (LLMs) to\naccelerate this process. We explore the potential of LLMs to generate viable\nhypotheses that, once validated, can expedite materials discovery.\nCollaborating with materials science experts, we curated a novel dataset from\nrecent journal publications, featuring real-world goals, constraints, and\nmethods for designing real-world applications. Using this dataset, we test\nLLM-based agents that generate hypotheses for achieving given goals under\nspecific constraints. To assess the relevance and quality of these hypotheses,\nwe propose a novel scalable evaluation metric that emulates the process a\nmaterials scientist would use to evaluate a hypothesis critically. Our curated\ndataset, proposed method, and evaluation framework aim to advance future\nresearch in accelerating materials discovery and design with LLMs.", "paper_summary_zh": "材料發現和設計對於推進各行各業的技術至關重要，因為它能促進特定應用材料的開發。最近的研究利用大型語言模型 (LLM) 來加速此過程。我們探索 LLM 產生可行假設的潛力，一旦驗證，就能加速材料發現。我們與材料科學專家合作，從最近的期刊出版物中策劃了一個新穎的數據集，其中包含設計實際應用程式的實際目標、限制和方法。使用此數據集，我們測試了 LLM 基礎代理，這些代理會產生假設，以在特定限制下實現既定目標。為了評估這些假設的相關性和品質，我們提出了一種新穎的可擴充評估指標，模擬材料科學家用來批判性評估假設的過程。我們策劃的數據集、提出的方法和評估架構旨在推進未來在使用 LLM 加速材料發現和設計方面的研究。", "author": "Shrinidhi Kumbhar et.al.", "authors": "Shrinidhi Kumbhar, Venkatesh Mishra, Kevin Coutinho, Divij Handa, Ashif Iquebal, Chitta Baral", "id": "2501.13299v1", "paper_url": "http://arxiv.org/abs/2501.13299v1", "repo": "null"}}