{"2412.14011": {"publish_time": "2024-12-18", "title": "Towards an optimised evaluation of teachers' discourse: The case of engaging messages", "paper_summary": "Evaluating teachers' skills is crucial for enhancing education quality and\nstudent outcomes. Teacher discourse, significantly influencing student\nperformance, is a key component. However, coding this discourse can be\nlaborious. This study addresses this issue by introducing a new methodology for\noptimising the assessment of teacher discourse. The research consisted of two\nstudies, both within the framework of engaging messages used by secondary\neducation teachers. The first study involved training two large language models\non real-world examples from audio-recorded lessons over two academic years to\nidentify and classify the engaging messages from the lessons' transcripts. This\nresulted in sensitivities of 84.31% and 91.11%, and specificities of 97.69% and\n86.36% in identification and classification, respectively. The second study\napplied these models to transcripts of audio-recorded lessons from a third\nacademic year to examine the frequency and distribution of message types by\neducational level and moment of the academic year. Results showed teachers\npredominantly use messages emphasising engagement benefits, linked to improved\noutcomes, while one-third highlighted non-engagement disadvantages, associated\nwith increased anxiety. The use of engaging messages declined in Grade 12 and\ntowards the academic year's end. These findings suggest potential interventions\nto optimise engaging message use, enhancing teaching quality and student\noutcomes.", "paper_summary_zh": "評量教師技能對於提升教育品質和學生成就至關重要，而教師話語對學生表現有顯著影響，是關鍵組成部分。然而，對話語進行編碼可能很費力。本研究透過提出新的方法論來最佳化教師話語評量，以解決此問題。研究包含兩項研究，兩者皆在中等教育教師所使用的引人訊息架構內進行。第一項研究涉及訓練兩個大型語言模型，使用來自兩學年錄音課程的真實範例，以識別和分類課程講義中的引人訊息。這導致識別和分類的敏感度分別為 84.31% 和 91.11%，特異度分別為 97.69% 和 86.36%。第二項研究將這些模型應用於第三個學年的錄音課程講義，以檢視訊息類型的頻率和分佈，依據教育程度和學年時間。結果顯示，教師主要使用強調參與好處的訊息，與改善成果相關，而三分之一強調不參與的缺點，與焦慮增加相關。引人訊息的使用在 12 年級和學年末下降。這些發現建議潛在的介入措施，以最佳化引人訊息的使用，提升教學品質和學生成就。", "author": "Samuel Falcon et.al.", "authors": "Samuel Falcon, Jaime Leon", "id": "2412.14011v1", "paper_url": "http://arxiv.org/abs/2412.14011v1", "repo": "null"}}