{"2407.19630": {"publish_time": "2024-07-29", "title": "LLMs' Understanding of Natural Language Revealed", "paper_summary": "Large language models (LLMs) are the result of a massive experiment in\nbottom-up, data-driven reverse engineering of language at scale. Despite their\nutility in a number of downstream NLP tasks, ample research has shown that LLMs\nare incapable of performing reasoning in tasks that require quantification over\nand the manipulation of symbolic variables (e.g., planning and problem\nsolving); see for example [25][26]. In this document, however, we will focus on\ntesting LLMs for their language understanding capabilities, their supposed\nforte. As we will show here, the language understanding capabilities of LLMs\nhave been widely exaggerated. While LLMs have proven to generate human-like\ncoherent language (since that's how they were designed), their language\nunderstanding capabilities have not been properly tested. In particular, we\nbelieve that the language understanding capabilities of LLMs should be tested\nby performing an operation that is the opposite of 'text generation' and\nspecifically by giving the LLM snippets of text as input and then querying what\nthe LLM \"understood\". As we show here, when doing so it will become apparent\nthat LLMs do not truly understand language, beyond very superficial inferences\nthat are essentially the byproduct of the memorization of massive amounts of\ningested text.", "paper_summary_zh": "大型語言模型 (LLM) 是大規模自下而上、資料驅動反向語言工程實驗的成果。儘管它們在許多下游 NLP 任務中很有用，但充足的研究表明，LLM 無法在需要量化和符號變數操作的任務中進行推理（例如，規劃和問題解決）；例如，請參閱 [25][26]。然而，在本文檔中，我們將重點放在測試 LLM 的語言理解能力，這是它們假設的優勢。正如我們在此處所示，LLM 的語言理解能力已被廣泛誇大。雖然 LLM 已被證明可以產生類似人類的連貫語言（因為這是它們的設計方式），但它們的語言理解能力尚未經過適當測試。特別是，我們相信 LLM 的語言理解能力應該通過執行與「文字生成」相反的操作來測試，特別是通過將 LLM 文字片段作為輸入，然後查詢 LLM「理解」了什麼。正如我們在此處所示，在這樣做的過程中，很明顯 LLM 並不真正理解語言，除了基本上是大量吸收文字的記憶副產品的非常表面的推論。", "author": "Walid S. Saba et.al.", "authors": "Walid S. Saba", "id": "2407.19630v1", "paper_url": "http://arxiv.org/abs/2407.19630v1", "repo": "null"}}