{"2405.14506": {"publish_time": "2024-05-23", "title": "SIAVC: Semi-Supervised Framework for Industrial Accident Video Classification", "paper_summary": "Semi-supervised learning suffers from the imbalance of labeled and unlabeled\ntraining data in the video surveillance scenario. In this paper, we propose a\nnew semi-supervised learning method called SIAVC for industrial accident video\nclassification. Specifically, we design a video augmentation module called the\nSuper Augmentation Block (SAB). SAB adds Gaussian noise and randomly masks\nvideo frames according to historical loss on the unlabeled data for model\noptimization. Then, we propose a Video Cross-set Augmentation Module (VCAM) to\ngenerate diverse pseudo-label samples from the high-confidence unlabeled\nsamples, which alleviates the mismatch of sampling experience and provides\nhigh-quality training data. Additionally, we construct a new industrial\naccident surveillance video dataset with frame-level annotation, namely ECA9,\nto evaluate our proposed method. Compared with the state-of-the-art\nsemi-supervised learning based methods, SIAVC demonstrates outstanding video\nclassification performance, achieving 88.76\\% and 89.13\\% accuracy on ECA9 and\nFire Detection datasets, respectively. The source code and the constructed\ndataset ECA9 will be released in \\url{https://github.com/AlchemyEmperor/SIAVC}.", "paper_summary_zh": "半监督学习在视频监控场景中受到标记和未标记训练数据不平衡的影响。在本文中，我们提出了一种称为 SIAVC 的新的半监督学习方法，用于工业事故视频分类。具体来说，我们设计了一个名为超级增强块 (SAB) 的视频增强模块。SAB 根据未标记数据上的历史损失为模型优化添加高斯噪声和随机掩蔽视频帧。然后，我们提出了一个视频交叉集增强模块 (VCAM)，以从高置信度未标记样本中生成不同的伪标签样本，这减轻了抽样经验的不匹配并提供了高质量的训练数据。此外，我们构建了一个新的工业事故监控视频数据集，其中包含帧级注释，即 ECA9，以评估我们提出的方法。与最先进的基于半监督学习的方法相比，SIAVC 展示了出色的视频分类性能，在 ECA9 和 Fire Detection 数据集上分别实现了 88.76% 和 89.13% 的准确率。源代码和构建的数据集 ECA9 将在 \\url{https://github.com/AlchemyEmperor/SIAVC} 中发布。", "author": "Zuoyong Li et.al.", "authors": "Zuoyong Li, Qinghua Lin, Haoyi Fan, Tiesong Zhao, David Zhang", "id": "2405.14506v1", "paper_url": "http://arxiv.org/abs/2405.14506v1", "repo": "null"}}