{"2410.07858": {"publish_time": "2024-10-10", "title": "From Logits to Hierarchies: Hierarchical Clustering made Simple", "paper_summary": "The structure of many real-world datasets is intrinsically hierarchical,\nmaking the modeling of such hierarchies a critical objective in both\nunsupervised and supervised machine learning. Recently, novel approaches for\nhierarchical clustering with deep architectures have been proposed. In this\nwork, we take a critical perspective on this line of research and demonstrate\nthat many approaches exhibit major limitations when applied to realistic\ndatasets, partly due to their high computational complexity. In particular, we\nshow that a lightweight procedure implemented on top of pre-trained\nnon-hierarchical clustering models outperforms models designed specifically for\nhierarchical clustering. Our proposed approach is computationally efficient and\napplicable to any pre-trained clustering model that outputs logits, without\nrequiring any fine-tuning. To highlight the generality of our findings, we\nillustrate how our method can also be applied in a supervised setup, recovering\nmeaningful hierarchies from a pre-trained ImageNet classifier.", "paper_summary_zh": "許多真實世界資料集的結構本質上是階層式的，\n使得對此類階層建模成為無監督和監督機器學習中的重要目標。最近，\n已經提出具有深度架構的階層式聚類新方法。在這個\n工作中，我們對這條研究路線採取批判性的觀點，並證明\n許多方法在應用於實際\n資料集時表現出重大的限制，部分原因是它們的高計算複雜度。特別是，我們\n表明在預先訓練的\n非階層式聚類模型之上實作的輕量級程序優於專門為\n階層式聚類設計的模型。我們提出的方法在計算上是有效的，並且\n適用於任何輸出 logit 的預先訓練聚類模型，而無需\n進行任何微調。為了強調我們發現的普遍性，我們\n說明我們的模型如何也可以應用在有監督的設定中，從預先訓練的 ImageNet 分類器中恢復\n有意義的階層。", "author": "Emanuele Palumbo et.al.", "authors": "Emanuele Palumbo, Moritz Vandenhirtz, Alain Ryser, Imant Daunhawer, Julia E. Vogt", "id": "2410.07858v1", "paper_url": "http://arxiv.org/abs/2410.07858v1", "repo": "null"}}