{"2409.10994": {"publish_time": "2024-09-17", "title": "Less is More: A Simple yet Effective Token Reduction Method for Efficient Multi-modal LLMs", "paper_summary": "The rapid advancement of Multimodal Large Language Models (MLLMs) has led to\nremarkable performances across various domains. However, this progress is\naccompanied by a substantial surge in the resource consumption of these models.\nWe address this pressing issue by introducing a new approach, Token Reduction\nusing CLIP Metric (TRIM), aimed at improving the efficiency of MLLMs without\nsacrificing their performance. Inspired by human attention patterns in Visual\nQuestion Answering (VQA) tasks, TRIM presents a fresh perspective on the\nselection and reduction of image tokens. The TRIM method has been extensively\ntested across 12 datasets, and the results demonstrate a significant reduction\nin computational overhead while maintaining a consistent level of performance.\nThis research marks a critical stride in efficient MLLM development, promoting\ngreater accessibility and sustainability of high-performing models.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 的快速发展导致了在各个领域的卓越表现。然而，这一进展伴随着这些模型资源消耗的大幅增加。我们通过引入一种新方法来解决这一紧迫问题，即使用 CLIP 指标 (TRIM) 进行标记减少，旨在提高 MLLM 的效率而不牺牲其性能。受视觉问答 (VQA) 任务中人类注意力模式的启发，TRIM 提供了对图像标记选择和减少的新视角。TRIM 方法已在 12 个数据集上进行了广泛测试，结果表明在保持一致性能水平的同时，计算开销显著减少。这项研究标志着高效 MLLM 开发的关键一步，促进了高性能模型的更大可访问性和可持续性。", "author": "Dingjie Song et.al.", "authors": "Dingjie Song, Wenjun Wang, Shunian Chen, Xidong Wang, Michael Guan, Benyou Wang", "id": "2409.10994v1", "paper_url": "http://arxiv.org/abs/2409.10994v1", "repo": "null"}}