{"2501.05066": {"publish_time": "2025-01-09", "title": "Improving Skeleton-based Action Recognition with Interactive Object Information", "paper_summary": "Human skeleton information is important in skeleton-based action recognition,\nwhich provides a simple and efficient way to describe human pose. However,\nexisting skeleton-based methods focus more on the skeleton, ignoring the\nobjects interacting with humans, resulting in poor performance in recognizing\nactions that involve object interactions. We propose a new action recognition\nframework introducing object nodes to supplement absent interactive object\ninformation. We also propose Spatial Temporal Variable Graph Convolutional\nNetworks (ST-VGCN) to effectively model the Variable Graph (VG) containing\nobject nodes. Specifically, in order to validate the role of interactive object\ninformation, by leveraging a simple self-training approach, we establish a new\ndataset, JXGC 24, and an extended dataset, NTU RGB+D+Object 60, including more\nthan 2 million additional object nodes. At the same time, we designe the\nVariable Graph construction method to accommodate a variable number of nodes\nfor graph structure. Additionally, we are the first to explore the overfitting\nissue introduced by incorporating additional object information, and we propose\na VG-based data augmentation method to address this issue, called Random Node\nAttack. Finally, regarding the network structure, we introduce two fusion\nmodules, CAF and WNPool, along with a novel Node Balance Loss, to enhance the\ncomprehensive performance by effectively fusing and balancing skeleton and\nobject node information. Our method surpasses the previous state-of-the-art on\nmultiple skeleton-based action recognition benchmarks. The accuracy of our\nmethod on NTU RGB+D 60 cross-subject split is 96.7\\%, and on cross-view split,\nit is 99.2\\%.", "paper_summary_zh": "人體骨骼資訊對於基於骨骼的動作辨識非常重要，這提供了描述人體姿勢的簡單且有效率的方法。然而，現有的基於骨骼的方法更專注於骨骼，忽略了與人類互動的物體，導致在辨識涉及物體互動的動作時效能不佳。我們提出一個新的動作辨識架構，引入物體節點來補充缺少的互動物體資訊。我們也提出時空變數圖形卷積網路 (ST-VGCN) 來有效地建模包含物體節點的變數圖形 (VG)。具體來說，為了驗證互動物體資訊的角色，我們透過利用一個簡單的自訓練方法，建立了一個新的資料集 JXGC 24 和一個擴充的資料集 NTU RGB+D+Object 60，包含超過 200 萬個額外的物體節點。同時，我們設計了變數圖形建構方法來容納圖形結構中變數的節點數量。此外，我們率先探討了加入額外物體資訊所造成的過度擬合問題，並提出一個基於 VG 的資料擴充方法來解決這個問題，稱為隨機節點攻擊。最後，關於網路結構，我們引入了兩個融合模組，CAF 和 WNPool，以及一個新穎的節點平衡損失，透過有效地融合和平衡骨骼和物體節點資訊來增強綜合效能。我們的模型超越了多個基於骨骼的動作辨識基準上的先前技術水準。我們的模型在 NTU RGB+D 60 交叉主體分割上的準確度為 96.7%，在交叉視角分割上的準確度為 99.2%。", "author": "Hao Wen et.al.", "authors": "Hao Wen, Ziqian Lu, Fengli Shen, Zhe-Ming Lu, Jialin Cui", "id": "2501.05066v1", "paper_url": "http://arxiv.org/abs/2501.05066v1", "repo": "null"}}