{"2502.07776": {"publish_time": "2025-02-11", "title": "Auditing Prompt Caching in Language Model APIs", "paper_summary": "Prompt caching in large language models (LLMs) results in data-dependent\ntiming variations: cached prompts are processed faster than non-cached prompts.\nThese timing differences introduce the risk of side-channel timing attacks. For\nexample, if the cache is shared across users, an attacker could identify cached\nprompts from fast API response times to learn information about other users'\nprompts. Because prompt caching may cause privacy leakage, transparency around\nthe caching policies of API providers is important. To this end, we develop and\nconduct statistical audits to detect prompt caching in real-world LLM API\nproviders. We detect global cache sharing across users in seven API providers,\nincluding OpenAI, resulting in potential privacy leakage about users' prompts.\nTiming variations due to prompt caching can also result in leakage of\ninformation about model architecture. Namely, we find evidence that OpenAI's\nembedding model is a decoder-only Transformer, which was previously not\npublicly known.", "paper_summary_zh": "大型語言模型 (LLM) 中的提示快取會導致資料相關的時序變化：快取提示的處理速度比非快取提示快。\n這些時序差異會造成側頻時序攻擊的風險。例如，如果快取在使用者之間共用，攻擊者可以從快速的 API 回應時間中找出快取提示，以得知其他使用者的提示資訊。由於提示快取可能會導致隱私外洩，因此 API 提供者的快取政策必須保持透明度。為此，我們開發並執行統計稽核，以偵測實際 LLM API 提供者中的提示快取。我們在七個 API 提供者中偵測到使用者之間的全球快取共用，包括 OpenAI，這會導致使用者提示的隱私外洩。提示快取造成的時序變化也會導致模型架構資訊外洩。也就是說，我們發現證據顯示 OpenAI 的嵌入模型是只含解碼器的 Transformer，這在之前並未公開。", "author": "Chenchen Gu et.al.", "authors": "Chenchen Gu, Xiang Lisa Li, Rohith Kuditipudi, Percy Liang, Tatsunori Hashimoto", "id": "2502.07776v1", "paper_url": "http://arxiv.org/abs/2502.07776v1", "repo": "null"}}