{"2505.00467": {"publish_time": "2025-05-01", "title": "Red Teaming Large Language Models for Healthcare", "paper_summary": "We present the design process and findings of the pre-conference workshop at\nthe Machine Learning for Healthcare Conference (2024) entitled Red Teaming\nLarge Language Models for Healthcare, which took place on August 15, 2024.\nConference participants, comprising a mix of computational and clinical\nexpertise, attempted to discover vulnerabilities -- realistic clinical prompts\nfor which a large language model (LLM) outputs a response that could cause\nclinical harm. Red-teaming with clinicians enables the identification of LLM\nvulnerabilities that may not be recognised by LLM developers lacking clinical\nexpertise. We report the vulnerabilities found, categorise them, and present\nthe results of a replication study assessing the vulnerabilities across all\nLLMs provided.", "paper_summary_zh": "我們展示了在 2024 年 8 月 15 日舉行的醫療保健機器學習會議 (2024) 的會前工作坊「醫療保健大型語言模型紅隊測試」的設計過程和發現。會議參與者，包含了計算和臨床專業知識的組合，試圖發現漏洞 -- 也就是找出一些實際的臨床提示，讓大型語言模型 (LLM) 輸出的回應可能會造成臨床傷害。與臨床醫生一起進行紅隊測試可以識別出缺乏臨床專業知識的 LLM 開發人員可能無法察覺的 LLM 漏洞。我們報告了發現的漏洞、對其進行分類，並展示了評估所有提供的 LLM 漏洞的複製研究結果。\n", "author": "Vahid Balazadeh et.al.", "authors": "Vahid Balazadeh, Michael Cooper, David Pellow, Atousa Assadi, Jennifer Bell, Jim Fackler, Gabriel Funingana, Spencer Gable-Cook, Anirudh Gangadhar, Abhishek Jaiswal, Sumanth Kaja, Christopher Khoury, Randy Lin, Kaden McKeen, Sara Naimimohasses, Khashayar Namdar, Aviraj Newatia, Allan Pang, Anshul Pattoo, Sameer Peesapati, Diana Prepelita, Bogdana Rakova, Saba Sadatamin, Rafael Schulman, Ajay Shah, Syed Azhar Shah, Syed Ahmar Shah, Babak Taati, Balagopal Unnikrishnan, Stephanie Williams, Rahul G Krishnan", "id": "2505.00467v1", "paper_url": "http://arxiv.org/abs/2505.00467v1", "repo": "null"}}