{"2411.19574": {"publish_time": "2024-11-29", "title": "KV Shifting Attention Enhances Language Modeling", "paper_summary": "The current large language models are mainly based on decode-only structure\ntransformers, which have great in-context learning (ICL) capabilities. It is\ngenerally believed that the important foundation of its ICL capability is the\ninduction heads mechanism, which requires at least two layers attention. In\norder to more efficiently implement the ability of the model's induction, we\nrevisit the induction heads mechanism and proposed a KV shifting attention. We\ntheoretically prove that the KV shifting attention reducing the model's\nrequirements for the depth and width of the induction heads mechanism. Our\nexperimental results demonstrate that KV shifting attention is beneficial to\nlearning induction heads and language modeling, which lead to better\nperformance or faster convergence from toy models to the pre-training models\nwith more than 10 B parameters.", "paper_summary_zh": "目前的大語言模型主要基於僅解碼結構的 Transformer，它具有強大的情境內學習 (ICL) 能力。一般認為其 ICL 能力的重要基礎是歸納頭機制，這需要至少兩層注意力。為了更有效地實現模型歸納的能力，我們重新審視了歸納頭機制，並提出了一種 KV 轉移注意力。我們從理論上證明了 KV 轉移注意力降低了模型對歸納頭機制的深度和寬度的要求。我們的實驗結果表明，KV 轉移注意力有利於學習歸納頭和語言建模，這導致了從玩具模型到擁有超過 10B 參數的預訓練模型的更好的性能或更快的收斂。", "author": "Mingyu Xu et.al.", "authors": "Mingyu Xu, Wei Cheng, Bingning Wang, Weipeng Chen", "id": "2411.19574v1", "paper_url": "http://arxiv.org/abs/2411.19574v1", "repo": "null"}}