{"2405.08131": {"publish_time": "2024-05-13", "title": "When factorization meets argumentation: towards argumentative explanations", "paper_summary": "Factorization-based models have gained popularity since the Netflix challenge\n{(2007)}. Since that, various factorization-based models have been developed\nand these models have been proven to be efficient in predicting users' ratings\ntowards items. A major concern is that explaining the recommendations generated\nby such methods is non-trivial because the explicit meaning of the latent\nfactors they learn are not always clear. In response, we propose a novel model\nthat combines factorization-based methods with argumentation frameworks (AFs).\nThe integration of AFs provides clear meaning at each stage of the model,\nenabling it to produce easily understandable explanations for its\nrecommendations. In this model, for every user-item interaction, an AF is\ndefined in which the features of items are considered as arguments, and the\nusers' ratings towards these features determine the strength and polarity of\nthese arguments. This perspective allows our model to treat feature attribution\nas a structured argumentation procedure, where each calculation is marked with\nexplicit meaning, enhancing its inherent interpretability. Additionally, our\nframework seamlessly incorporates side information, such as user contexts,\nleading to more accurate predictions. We anticipate at least three practical\napplications for our model: creating explanation templates, providing\ninteractive explanations, and generating contrastive explanations. Through\ntesting on real-world datasets, we have found that our model, along with its\nvariants, not only surpasses existing argumentation-based methods but also\ncompetes effectively with current context-free and context-aware methods.", "paper_summary_zh": "<paragraph>自 Netflix 挑戰賽 {(2007)} 以來，基於分解的模型越來越受歡迎。自此，各種基於分解的模型已被開發出來，這些模型已被證明可以有效預測使用者對商品的評分。一個主要的問題是，解釋此類方法產生的推薦並非易事，因為他們學習到的潛在因素的明確含義並不總是清楚。為了解決這個問題，我們提出了一個新穎的模型，將基於分解的方法與論證架構 (AF) 結合起來。AF 的整合在模型的每個階段提供清晰的含義，使其能夠為其推薦產生容易理解的解釋。在此模型中，對於每個使用者與商品的互動，定義了一個 AF，其中商品的特性被視為論證，而使用者對這些特性的評分決定了這些論證的強度和極性。這個觀點使我們的模型能夠將特徵歸因視為一個結構化的論證程序，其中每一個計算都標記有明確的含義，增強其內在的可解釋性。此外，我們的框架無縫地整合了側邊資訊，例如使用者背景，從而產生更準確的預測。我們預期我們的模型至少有三個實際應用：建立解釋範本、提供互動式解釋以及產生對比式解釋。透過在真實世界資料集上進行測試，我們發現我們的模型及其變體不僅超越了現有的基於論證的方法，而且還能有效地與當前的無背景和有背景感知的方法競爭。</paragraph>", "author": "Jinfeng Zhong et.al.", "authors": "Jinfeng Zhong, Elsa Negre", "id": "2405.08131v1", "paper_url": "http://arxiv.org/abs/2405.08131v1", "repo": "null"}}