{"2504.11406": {"publish_time": "2025-04-15", "title": "Multi-level Cellular Automata for FLIM networks", "paper_summary": "The necessity of abundant annotated data and complex network architectures\npresents a significant challenge in deep-learning Salient Object Detection\n(deep SOD) and across the broader deep-learning landscape. This challenge is\nparticularly acute in medical applications in developing countries with limited\ncomputational resources. Combining modern and classical techniques offers a\npath to maintaining competitive performance while enabling practical\napplications. Feature Learning from Image Markers (FLIM) methodology empowers\nexperts to design convolutional encoders through user-drawn markers, with\nfilters learned directly from these annotations. Recent findings demonstrate\nthat coupling a FLIM encoder with an adaptive decoder creates a flyweight\nnetwork suitable for SOD, requiring significantly fewer parameters than\nlightweight models and eliminating the need for backpropagation. Cellular\nAutomata (CA) methods have proven successful in data-scarce scenarios but\nrequire proper initialization -- typically through user input, priors, or\nrandomness. We propose a practical intersection of these approaches: using FLIM\nnetworks to initialize CA states with expert knowledge without requiring user\ninteraction for each image. By decoding features from each level of a FLIM\nnetwork, we can initialize multiple CAs simultaneously, creating a multi-level\nframework. Our method leverages the hierarchical knowledge encoded across\ndifferent network layers, merging multiple saliency maps into a high-quality\nfinal output that functions as a CA ensemble. Benchmarks across two challenging\nmedical datasets demonstrate the competitiveness of our multi-level CA approach\ncompared to established models in the deep SOD literature.", "paper_summary_zh": "<paragraph>大量的標註數據和複雜的網絡架構是深度學習顯著目標檢測 (deep SOD) 和更廣泛的深度學習領域所面臨的一項重大挑戰。這種挑戰在開發中國家醫療應用中尤為突出，因為這些國家的計算資源有限。結合現代和經典技術，我們可以保持競爭力的同時，又能實現實際應用。基於圖像標記的特征學習 (FLIM) 方法使專家能夠通過用戶繪製的標記來設計卷積編碼器，並直接從這些標註中學習過濾器。最近的研究結果表明，將 FLIM 編碼器與自適應解碼器相結合，可以創建一個適用於 SOD 的輕量級網絡，所需的參數比輕量級模型少得多，並且无需反向傳播。元胞自動機 (CA) 方法已被證明在數據稀缺的情況下是成功的，但需要正確的初始化——通常通過用戶輸入、先驗或隨機性來實現。我們提出了一種將這些方法實際結合起來的方法：使用 FLIM 網絡用專家知識初始化 CA 狀態，而不需要針對每個圖像進行用戶交互。通過解碼 FLIM 網絡每一層的特征，我們可以同時初始化多個 CA，從而創建一個多層級框架。我們的方法利用了跨不同網絡層編碼的分層知識，將多個顯著性圖合併成一個高質量的最終輸出，作為一個 CA 系綜。在兩個具有挑戰性的醫學數據集上的基準測試表明，與深度 SOD 文獻中已建立的模型相比，我們提出的多層級 CA 方法具有競爭力。</paragraph>\n", "author": "Felipe Crispim Salvagnini et.al.", "authors": "Felipe Crispim Salvagnini, Jancarlo F. Gomes, Cid A. N. Santos, Silvio Jamil F. Guimarães, Alexandre X. Falcão", "id": "2504.11406v1", "paper_url": "http://arxiv.org/abs/2504.11406v1", "repo": "null"}}