{"2406.06110": {"publish_time": "2024-06-10", "title": "Recurrent Context Compression: Efficiently Expanding the Context Window of LLM", "paper_summary": "To extend the context length of Transformer-based large language models\n(LLMs) and improve comprehension capabilities, we often face limitations due to\ncomputational resources and bounded memory storage capacity. This work\nintroduces a method called Recurrent Context Compression (RCC), designed to\nefficiently expand the context window length of LLMs within constrained storage\nspace. We also investigate the issue of poor model responses when both\ninstructions and context are compressed in downstream tasks, and propose an\ninstruction reconstruction method to mitigate this problem. We validated the\neffectiveness of our approach on multiple tasks, achieving a compression rate\nof up to 32x on text reconstruction tasks with a BLEU4 score close to 0.95, and\nnearly 100\\% accuracy on a passkey retrieval task with a sequence length of 1M.\nFinally, our method demonstrated competitive performance in long-text\nquestion-answering tasks compared to non-compressed methods, while\nsignificantly saving storage resources in long-text inference tasks. Our code,\nmodels, and demo are available at https://github.com/WUHU-G/RCC_Transformer", "paper_summary_zh": "為了擴展基於 Transformer 的大型語言模型 (LLM) 的內容長度，並改善理解能力，我們常常會因為計算資源和受限的記憶體儲存容量而面臨限制。這項工作介紹一種稱為遞迴內容壓縮 (RCC) 的方法，旨在有效地擴展 LLM 在受限儲存空間內的內容視窗長度。我們也探討了當指示和內容在下游任務中都經過壓縮時，模型回應不佳的問題，並提出了一種指示重建方法來減輕這個問題。我們在多項任務中驗證了我們方法的有效性，在文本重建任務中實現了高達 32 倍的壓縮率，BLEU4 分數接近 0.95，並且在序列長度為 1M 的密鑰檢索任務中準確率接近 100%。最後，我們的模型在長文本問答任務中展現出與未壓縮方法相當的效能，同時在長文本推論任務中大幅節省了儲存資源。我們的程式碼、模型和示範可在 https://github.com/WUHU-G/RCC_Transformer 取得。", "author": "Chensen Huang et.al.", "authors": "Chensen Huang, Guibo Zhu, Xuepeng Wang, Yifei Luo, Guojing Ge, Haoran Chen, Dong Yi, Jinqiao Wang", "id": "2406.06110v1", "paper_url": "http://arxiv.org/abs/2406.06110v1", "repo": "https://github.com/WUHU-G/RCC_Transformer"}}