{"2410.10502": {"publish_time": "2024-10-14", "title": "A Practical Approach to Causal Inference over Time", "paper_summary": "In this paper, we focus on estimating the causal effect of an intervention\nover time on a dynamical system. To that end, we formally define causal\ninterventions and their effects over time on discrete-time stochastic processes\n(DSPs). Then, we show under which conditions the equilibrium states of a DSP,\nboth before and after a causal intervention, can be captured by a structural\ncausal model (SCM). With such an equivalence at hand, we provide an explicit\nmapping from vector autoregressive models (VARs), broadly applied in\neconometrics, to linear, but potentially cyclic and/or affected by unmeasured\nconfounders, SCMs. The resulting causal VAR framework allows us to perform\ncausal inference over time from observational time series data. Our experiments\non synthetic and real-world datasets show that the proposed framework achieves\nstrong performance in terms of observational forecasting while enabling\naccurate estimation of the causal effect of interventions on dynamical systems.\nWe demonstrate, through a case study, the potential practical questions that\ncan be addressed using the proposed causal VAR framework.", "paper_summary_zh": "在本文中，我們專注於估計介入在一段時間內對動態系統的因果效應。為此，我們正式定義因果介入及其對離散時間隨機過程 (DSP) 的時間效應。然後，我們展示在哪些條件下，DSP 的平衡狀態，無論是在因果介入之前還是之後，都可以由結構因果模型 (SCM) 捕捉。有了這樣的等價性，我們提供了一個從廣泛應用於計量經濟學的向量自迴歸模型 (VAR) 到線性（但潛在地循環和/或受未測量混雜因素影響）SCM 的明確映射。由此產生的因果 VAR 框架允許我們從觀測時間序列數據中隨時間執行因果推論。我們在合成和真實世界數據集上的實驗表明，所提出的框架在觀測預測方面實現了強大的性能，同時能夠準確估計介入對動態系統的因果效應。我們通過案例研究展示了可以使用所提出的因果 VAR 框架解決的潛在實際問題。", "author": "Martina Cinquini et.al.", "authors": "Martina Cinquini, Isacco Beretta, Salvatore Ruggieri, Isabel Valera", "id": "2410.10502v1", "paper_url": "http://arxiv.org/abs/2410.10502v1", "repo": "null"}}