{"2408.10720": {"publish_time": "2024-08-20", "title": "Towards Foundation Models for the Industrial Forecasting of Chemical Kinetics", "paper_summary": "Scientific Machine Learning is transforming traditional engineering\nindustries by enhancing the efficiency of existing technologies and\naccelerating innovation, particularly in modeling chemical reactions. Despite\nrecent advancements, the issue of solving stiff chemically reacting problems\nwithin computational fluid dynamics remains a significant issue. In this study\nwe propose a novel approach utilizing a multi-layer-perceptron mixer\narchitecture (MLP-Mixer) to model the time-series of stiff chemical kinetics.\nWe evaluate this method using the ROBER system, a benchmark model in chemical\nkinetics, to compare its performance with traditional numerical techniques.\nThis study provides insight into the industrial utility of the recently\ndeveloped MLP-Mixer architecture to model chemical kinetics and provides\nmotivation for such neural architecture to be used as a base for time-series\nfoundation models.", "paper_summary_zh": "科學機器學習透過提升現有技術的效率和加速創新來轉變傳統工程產業，特別是在化學反應建模方面。儘管有近期的進展，在計算流體力學中解決僵硬化學反應問題的問題仍然是一個重大的問題。在這項研究中，我們提出了一種新穎的方法，利用多層感知器混合器架構 (MLP-Mixer) 來建模僵硬化學動力學的時間序列。我們使用化學動力學中的基準模型 ROBER 系統來評估此方法，以將其效能與傳統數值技術進行比較。本研究提供了對最近開發的 MLP-Mixer 架構在化學動力學建模中的產業效用的見解，並提供了將此類神經架構用作時間序列基礎模型的動機。", "author": "Imran Nasim et.al.", "authors": "Imran Nasim, Joaõ Lucas de Sousa Almeida", "id": "2408.10720v1", "paper_url": "http://arxiv.org/abs/2408.10720v1", "repo": "null"}}