{"2412.06211": {"publish_time": "2024-12-09", "title": "MSCrackMamba: Leveraging Vision Mamba for Crack Detection in Fused Multispectral Imagery", "paper_summary": "Crack detection is a critical task in structural health monitoring, aimed at\nassessing the structural integrity of bridges, buildings, and roads to prevent\npotential failures. Vision-based crack detection has become the mainstream\napproach due to its ease of implementation and effectiveness. Fusing infrared\n(IR) channels with red, green and blue (RGB) channels can enhance feature\nrepresentation and thus improve crack detection. However, IR and RGB channels\noften differ in resolution. To align them, higher-resolution RGB images\ntypically need to be downsampled to match the IR image resolution, which leads\nto the loss of fine details. Moreover, crack detection performance is\nrestricted by the limited receptive fields and high computational complexity of\ntraditional image segmentation networks. Inspired by the recently proposed\nMamba neural architecture, this study introduces a two-stage paradigm called\nMSCrackMamba, which leverages Vision Mamba along with a super-resolution\nnetwork to address these challenges. Specifically, to align IR and RGB\nchannels, we first apply super-resolution to IR channels to match the\nresolution of RGB channels for data fusion. Vision Mamba is then adopted as the\nbackbone network, while UperNet is employed as the decoder for crack detection.\nOur approach is validated on the large-scale Crack Detection dataset Crack900,\ndemonstrating an improvement of 3.55% in mIoU compared to the best-performing\nbaseline methods.", "paper_summary_zh": "裂縫偵測在結構健康監測中是一項重要的任務，旨在評估橋樑、建築物和道路的結構完整性，以防止潛在的故障。基於視覺的裂縫偵測由於其易於實作和有效性，已成為主流方法。將紅外線 (IR) 通道與紅色、綠色和藍色 (RGB) 通道融合可以增強特徵表示，進而改善裂縫偵測。然而，IR 和 RGB 通道通常解析度不同。為了對齊它們，通常需要對較高解析度的 RGB 影像進行降採樣以匹配 IR 影像解析度，這會導致精細細節的遺失。此外，裂縫偵測效能受到傳統影像分割網路有限的感受野和高運算複雜度的限制。受近期提出的 Mamba 神經架構啟發，本研究引入了一個稱為 MSCrackMamba 的兩階段範例，它利用 Vision Mamba 和超解析度網路來應對這些挑戰。具體來說，為了對齊 IR 和 RGB 通道，我們首先對 IR 通道應用超解析度，以匹配 RGB 通道的解析度，以進行資料融合。然後採用 Vision Mamba 作為骨幹網路，同時採用 UperNet 作為裂縫偵測的解碼器。我們的做法已在大型裂縫偵測資料集 Crack900 中得到驗證，與效能最佳的基準方法相比，mIoU 提升了 3.55%。", "author": "Qinfeng Zhu et.al.", "authors": "Qinfeng Zhu, Yuan Fang, Lei Fan", "id": "2412.06211v1", "paper_url": "http://arxiv.org/abs/2412.06211v1", "repo": "null"}}