{"2503.13430": {"publish_time": "2025-03-17", "title": "AugMapNet: Improving Spatial Latent Structure via BEV Grid Augmentation for Enhanced Vectorized Online HD Map Construction", "paper_summary": "Autonomous driving requires an understanding of the infrastructure elements,\nsuch as lanes and crosswalks. To navigate safely, this understanding must be\nderived from sensor data in real-time and needs to be represented in vectorized\nform. Learned Bird's-Eye View (BEV) encoders are commonly used to combine a set\nof camera images from multiple views into one joint latent BEV grid.\nTraditionally, from this latent space, an intermediate raster map is predicted,\nproviding dense spatial supervision but requiring post-processing into the\ndesired vectorized form. More recent models directly derive infrastructure\nelements as polylines using vectorized map decoders, providing instance-level\ninformation. Our approach, Augmentation Map Network (AugMapNet), proposes\nlatent BEV grid augmentation, a novel technique that significantly enhances the\nlatent BEV representation. AugMapNet combines vector decoding and dense spatial\nsupervision more effectively than existing architectures while remaining as\nstraightforward to integrate and as generic as auxiliary supervision.\nExperiments on nuScenes and Argoverse2 datasets demonstrate significant\nimprovements in vectorized map prediction performance up to 13.3% over the\nStreamMapNet baseline on 60m range and greater improvements on larger ranges.\nWe confirm transferability by applying our method to another baseline and find\nsimilar improvements. A detailed analysis of the latent BEV grid confirms a\nmore structured latent space of AugMapNet and shows the value of our novel\nconcept beyond pure performance improvement. The code will be released soon.", "paper_summary_zh": "<paragraph>自動駕駛需要了解基礎設施元素，例如車道和人行橫道。為了安全導航，這種理解必須從傳感器數據中實時獲取，並且需要以向量化的形式表示。學習型鳥瞰圖 (BEV) 編碼器通常用於將一組來自多個視角的攝像機圖像組合成一個聯合潛在 BEV 網格。傳統上，從這個潛在空間中，會預測一個中間柵格地圖，提供密集的空間監督，但需要後處理成所需的向量化形式。更新的模型直接使用向量化地圖解碼器將基礎設施元素導出為折線，提供實例級信息。我們的方法，增強地圖網絡 (AugMapNet)，提出潛在 BEV 網格增強，這是一種顯著增強潛在 BEV 表示的新技術。AugMapNet 比現有架構更有效地結合了向量解碼和密集空間監督，同時保持了與輔助監督一樣易於集成和通用。在 nuScenes 和 Argoverse2 數據集上的實驗表明，向量化地圖預測性能比 StreamMapNet 基線在 60 公尺範圍內顯著提高了 13.3%，在更大範圍內的提升則更大。我們通過將我們的方法應用於另一個基線來確認可遷移性，並發現了類似的改進。對潛在 BEV 網格的詳細分析證實了 AugMapNet 更結構化的潛在空間，並展示了我們新概念的價值，而不僅僅是純粹的性能提升。程式碼將很快發布。</paragraph>\n", "author": "Thomas Monninger et.al.", "authors": "Thomas Monninger, Md Zafar Anwar, Stanislaw Antol, Steffen Staab, Sihao Ding", "id": "2503.13430v1", "paper_url": "http://arxiv.org/abs/2503.13430v1", "repo": "null"}}