{"2406.06967": {"publish_time": "2024-06-11", "title": "Dual Thinking and Perceptual Analysis of Deep Learning Models using Human Adversarial Examples", "paper_summary": "The dual thinking framework considers fast, intuitive processing and slower,\nlogical processing. The perception of dual thinking in vision requires images\nwhere inferences from intuitive and logical processing differ. We introduce an\nadversarial dataset to provide evidence for the dual thinking framework in\nhuman vision, which also aids in studying the qualitative behavior of deep\nlearning models. Our study also addresses a major criticism of using\nclassification models as computational models of human vision by using instance\nsegmentation models that localize objects. The evidence underscores the\nimportance of shape in identifying instances in human vision and shows that\ndeep learning models lack an understanding of sub-structures, as indicated by\nerrors related to the position and number of sub-components. Additionally, the\nsimilarity in errors made by models and intuitive human processing indicates\nthat models only address intuitive thinking in human vision.", "paper_summary_zh": "雙重思考架構考量快速、直覺的處理，以及較慢、邏輯的處理。在視覺中對雙重思考的感知需要影像，其中直覺和邏輯處理的推論不同。我們引入對抗性資料集，以提供人類視覺中雙重思考架構的證據，這也有助於研究深度學習模型的品質行為。我們的研究也處理使用分類模型作為人類視覺的計算模型的主要批評，方法是使用局部化物件的實例分割模型。證據強調形狀在人類視覺中識別實例的重要性，並顯示深度學習模型缺乏對子結構的理解，如與子組件的位置和數量相關的錯誤所顯示的。此外，模型和直覺人類處理所犯錯誤的相似性表明，模型僅處理人類視覺中的直覺思考。", "author": "Kailas Dayanandan et.al.", "authors": "Kailas Dayanandan, Anand Sinha, Brejesh Lall", "id": "2406.06967v1", "paper_url": "http://arxiv.org/abs/2406.06967v1", "repo": "https://github.com/kailasdayanandan/dual_thinking"}}