{"2501.17567": {"publish_time": "2025-01-29", "title": "Exploring the Potential of Wireless-enabled Multi-Chip AI Accelerators", "paper_summary": "The insatiable appetite of Artificial Intelligence (AI) workloads for\ncomputing power is pushing the industry to develop faster and more efficient\naccelerators. The rigidity of custom hardware, however, conflicts with the need\nfor scalable and versatile architectures capable of catering to the needs of\nthe evolving and heterogeneous pool of Machine Learning (ML) models in the\nliterature. In this context, multi-chiplet architectures assembling multiple\n(perhaps heterogeneous) accelerators are an appealing option that is\nunfortunately hindered by the still rigid and inefficient chip-to-chip\ninterconnects. In this paper, we explore the potential of wireless technology\nas a complement to existing wired interconnects in this multi-chiplet approach.\nUsing an evaluation framework from the state-of-the-art, we show that wireless\ninterconnects can lead to speedups of 10% on average and 20% maximum. We also\nhighlight the importance of load balancing between the wired and wireless\ninterconnects, which will be further explored in future work.", "paper_summary_zh": "人工智慧（AI）工作負載對運算能力的貪婪胃口正推動產業開發更快速且更有效率的加速器。然而，客製化硬體的僵化性與可擴充且多功能架構的需求產生衝突，而這些架構有能力滿足文獻中不斷演進且異質的機器學習（ML）模型的需求。在此脈絡下，組裝多個（可能是異質的）加速器的多晶片架構是一個誘人的選擇，但不幸的是，受到仍然僵化且低效率的晶片間互連阻礙。在本文中，我們探討無線技術作為此多晶片方法中現有有線互連的補充的潛力。使用來自最新技術的評估架構，我們顯示無線互連平均可提升 10% 的速度，最高可提升 20%。我們也強調有線和無線互連之間負載平衡的重要性，這將在未來的研究中進一步探討。", "author": "Emmanuel Irabor et.al.", "authors": "Emmanuel Irabor, Mariam Musavi, Abhijit Das, Sergi Abadal", "id": "2501.17567v1", "paper_url": "http://arxiv.org/abs/2501.17567v1", "repo": "null"}}