{"2412.04832": {"publish_time": "2024-12-06", "title": "WRF-GS: Wireless Radiation Field Reconstruction with 3D Gaussian Splatting", "paper_summary": "Wireless channel modeling plays a pivotal role in designing, analyzing, and\noptimizing wireless communication systems. Nevertheless, developing an\neffective channel modeling approach has been a longstanding challenge. This\nissue has been escalated due to the denser network deployment, larger antenna\narrays, and wider bandwidth in 5G and beyond networks. To address this\nchallenge, we put forth WRF-GS, a novel framework for channel modeling based on\nwireless radiation field (WRF) reconstruction using 3D Gaussian splatting.\nWRF-GS employs 3D Gaussian primitives and neural networks to capture the\ninteractions between the environment and radio signals, enabling efficient WRF\nreconstruction and visualization of the propagation characteristics. The\nreconstructed WRF can then be used to synthesize the spatial spectrum for\ncomprehensive wireless channel characterization. Notably, with a small number\nof measurements, WRF-GS can synthesize new spatial spectra within milliseconds\nfor a given scene, thereby enabling latency-sensitive applications.\nExperimental results demonstrate that WRF-GS outperforms existing methods for\nspatial spectrum synthesis, such as ray tracing and other deep-learning\napproaches. Moreover, WRF-GS achieves superior performance in the channel state\ninformation prediction task, surpassing existing methods by a significant\nmargin of more than 2.43 dB.", "paper_summary_zh": "無線通道建模在設計、分析和最佳化無線通訊系統中扮演著關鍵角色。儘管如此，開發一個有效的通道建模方法一直是一個長期的挑戰。這個問題由於 5G 及其後續網路中更密集的網路部署、更大的天線陣列和更寬的頻寬而升級。為了應對這個挑戰，我們提出了 WRF-GS，一個基於使用 3D 高斯散射重構無線輻射場 (WRF) 的通道建模新架構。WRF-GS 使用 3D 高斯基元和神經網路來擷取環境和無線電訊號之間的交互作用，實現有效的 WRF 重構和傳播特性的可視化。然後，可以利用重構的 WRF 合成空間頻譜，以進行全面的無線通道特性描述。值得注意的是，使用少量測量，WRF-GS 可以針對給定的場景在幾毫秒內合成新的空間頻譜，從而支援對延遲敏感的應用。實驗結果表明，WRF-GS 在空間頻譜合成方面優於現有方法，例如射線追蹤和其他深度學習方法。此外，WRF-GS 在通道狀態資訊預測任務中取得了卓越的效能，以超過 2.43 dB 的顯著幅度超越現有方法。", "author": "Chaozheng Wen et.al.", "authors": "Chaozheng Wen, Jingwen Tong, Yingdong Hu, Zehong Lin, Jun Zhang", "id": "2412.04832v1", "paper_url": "http://arxiv.org/abs/2412.04832v1", "repo": "null"}}