{"2412.02292": {"publish_time": "2024-12-03", "title": "Deep Matrix Factorization with Adaptive Weights for Multi-View Clustering", "paper_summary": "Recently, deep matrix factorization has been established as a powerful model\nfor unsupervised tasks, achieving promising results, especially for multi-view\nclustering. However, existing methods often lack effective feature selection\nmechanisms and rely on empirical hyperparameter selection. To address these\nissues, we introduce a novel Deep Matrix Factorization with Adaptive Weights\nfor Multi-View Clustering (DMFAW). Our method simultaneously incorporates\nfeature selection and generates local partitions, enhancing clustering results.\nNotably, the features weights are controlled and adjusted by a parameter that\nis dynamically updated using Control Theory inspired mechanism, which not only\nimproves the model's stability and adaptability to diverse datasets but also\naccelerates convergence. A late fusion approach is then proposed to align the\nweighted local partitions with the consensus partition. Finally, the\noptimization problem is solved via an alternating optimization algorithm with\ntheoretically guaranteed convergence. Extensive experiments on benchmark\ndatasets highlight that DMFAW outperforms state-of-the-art methods in terms of\nclustering performance.", "paper_summary_zh": "最近，深度矩阵分解已被确立为无监督任务的强大模型，在多视图聚类方面取得了有希望的结果。然而，现有方法通常缺乏有效的特征选择机制，并依赖于经验超参数选择。为了解决这些问题，我们引入了一种用于多视图聚类的新型自适应权重深度矩阵分解（DMFAW）。我们的方法同时结合了特征选择并生成了局部分区，从而增强了聚类结果。值得注意的是，特征权重由一个参数控制和调整，该参数使用受控制理论启发的机制动态更新，这不仅提高了模型对不同数据集的稳定性和适应性，而且还加速了收敛。然后提出了一种后期融合方法，以将加权局部分区与共识分区对齐。最后，通过交替优化算法解决了优化问题，该算法具有理论保证的收敛性。基准数据集上的大量实验表明，DMFAW 在聚类性能方面优于最先进的方法。", "author": "Yasser Khalafaoui et.al.", "authors": "Yasser Khalafaoui, Basarab Matei, Martino Lovisetto, Nistor Grozavu", "id": "2412.02292v1", "paper_url": "http://arxiv.org/abs/2412.02292v1", "repo": "null"}}