{"2405.06067": {"publish_time": "2024-05-09", "title": "HMT: Hierarchical Memory Transformer for Long Context Language Processing", "paper_summary": "Transformer-based large language models (LLM) have been widely used in\nlanguage processing applications. However, most of them restrict the context\nwindow that permits the model to attend to every token in the inputs. Previous\nworks in recurrent models can memorize past tokens to enable unlimited context\nand maintain effectiveness. However, they have \"flat\" memory architectures,\nwhich have limitations in selecting and filtering information. Since humans are\ngood at learning and self-adjustment, we speculate that imitating brain memory\nhierarchy is beneficial for model memorization. We propose the Hierarchical\nMemory Transformer (HMT), a novel framework that enables and improves models'\nlong-context processing ability by imitating human memorization behavior.\nLeveraging memory-augmented segment-level recurrence, we organize the memory\nhierarchy by preserving tokens from early input token segments, passing memory\nembeddings along the sequence, and recalling relevant information from history.\nEvaluating general language modeling (Wikitext-103, PG-19) and\nquestion-answering tasks (PubMedQA), we show that HMT steadily improves the\nlong-context processing ability of context-constrained and long-context models.\nWith an additional 0.5% - 2% of parameters, HMT can easily plug in and augment\nfuture LLMs to handle long context effectively. Our code is open-sourced on\nGithub: https://github.com/OswaldHe/HMT-pytorch.", "paper_summary_zh": "<paragraph>基於 Transformer 的大型語言模型 (LLM) 已廣泛用於語言處理應用程式中。然而，它們大多限制了允許模型關注輸入中每個符號的上下文視窗。以往在遞迴模型中的工作可以記住過去的符號，以啟用無限的上下文並維持效能。然而，它們有「扁平」的記憶體架構，在選擇和過濾資訊方面有其限制。由於人類擅長學習和自我調整，我們推測模仿大腦記憶體階層對於模型記憶化是有益的。我們提出階層式記憶Transformer (HMT)，這是一個新穎的架構，透過模仿人類的記憶行為，啟用並提升模型的長上下文處理能力。利用記憶增強的區段層級遞迴，我們透過保留早期輸入符號區段的符號，沿著序列傳遞記憶嵌入，並從歷史中提取相關資訊，來組織記憶體階層。評估一般語言模型（Wikitext-103、PG-19）和問答任務（PubMedQA），我們展示 HMT 穩定地提升了受限於上下文的模型和長上下文模型的長上下文處理能力。透過額外的 0.5% - 2% 參數，HMT 可以輕鬆地插入和擴充未來的 LLM，以有效地處理長上下文。我們的程式碼在 Github 上開放原始碼：https://github.com/OswaldHe/HMT-pytorch。</paragraph>", "author": "Zifan He et.al.", "authors": "Zifan He, Zongyue Qin, Neha Prakriya, Yizhou Sun, Jason Cong", "id": "2405.06067v1", "paper_url": "http://arxiv.org/abs/2405.06067v1", "repo": "https://github.com/OswaldHe/HMT-pytorch"}}