{"2503.22677": {"publish_time": "2025-03-28", "title": "DSO: Aligning 3D Generators with Simulation Feedback for Physical Soundness", "paper_summary": "Most 3D object generators focus on aesthetic quality, often neglecting\nphysical constraints necessary in applications. One such constraint is that the\n3D object should be self-supporting, i.e., remains balanced under gravity.\nPrior approaches to generating stable 3D objects used differentiable physics\nsimulators to optimize geometry at test-time, which is slow, unstable, and\nprone to local optima. Inspired by the literature on aligning generative models\nto external feedback, we propose Direct Simulation Optimization (DSO), a\nframework to use the feedback from a (non-differentiable) simulator to increase\nthe likelihood that the 3D generator outputs stable 3D objects directly. We\nconstruct a dataset of 3D objects labeled with a stability score obtained from\nthe physics simulator. We can then fine-tune the 3D generator using the\nstability score as the alignment metric, via direct preference optimization\n(DPO) or direct reward optimization (DRO), a novel objective, which we\nintroduce, to align diffusion models without requiring pairwise preferences.\nOur experiments show that the fine-tuned feed-forward generator, using either\nDPO or DRO objective, is much faster and more likely to produce stable objects\nthan test-time optimization. Notably, the DSO framework works even without any\nground-truth 3D objects for training, allowing the 3D generator to self-improve\nby automatically collecting simulation feedback on its own outputs.", "paper_summary_zh": "大多數 3D 物件產生器都專注於美學品質，卻經常忽略應用程式中必要的物理限制。其中一個限制就是 3D 物件必須能夠自我支撐，也就是在重力作用下保持平衡。先前產生穩定 3D 物件的方法是使用可微分物理模擬器在測試時優化幾何形狀，這種方法速度慢、不穩定，而且容易陷入局部最佳解。受到將生成模型與外部回饋對齊的相關文獻的啟發，我們提出了直接模擬優化 (DSO)，這是一個利用（不可微分）模擬器的回饋來直接提高 3D 產生器輸出穩定 3D 物件的可能性的框架。我們構建了一個 3D 物件資料集，並使用從物理模擬器獲得的穩定性分數為其加上標籤。然後，我們可以使用穩定性分數作為對齊指標，透過直接偏好優化 (DPO) 或直接獎勵優化 (DRO) 來微調 3D 產生器，這是一種我們引入的新穎目標函數，可以在不需要成對偏好的情況下對齊擴散模型。我們的實驗表明，使用 DPO 或 DRO 目標函數微調的前饋產生器比測試時優化更快，也更有可能產生穩定的物件。值得注意的是，即使沒有任何用於訓練的真實 3D 物件，DSO 框架也能正常工作，這使得 3D 產生器能夠透過自動收集自身輸出的模擬回饋來自我改進。\n", "author": "Ruining Li et.al.", "authors": "Ruining Li, Chuanxia Zheng, Christian Rupprecht, Andrea Vedaldi", "id": "2503.22677v1", "paper_url": "http://arxiv.org/abs/2503.22677v1", "repo": "null"}}