{"2406.07505": {"publish_time": "2024-06-11", "title": "THaLLE: Text Hyperlocally Augmented Large Language Extension -- Technical Report", "paper_summary": "Recent advancements in Large Language Models (LLMs) have revealed new\ncapabilities and opportunities across the technological landscape. However, the\npracticality of very large LLMs is challenged by their high compute cost, which\ndoes not justify the benefits given their limited capability compared to\nhumans. While smaller, more practical LLMs have shown potential in financial\nanalysis, though they are not yet fully proficient, as evidenced by their\nnear-passing performance on the Chartered Financial Analyst (CFA) exam. In this\nwork, we present Financial Analyst Extension to our Text Hyperlocally Augmented\nLarge Language Extension (THaLLE), a series of 8B LLMs consistently achieving\nhighest performance on mock CFA exams against models of comparable size. We\nthoroughly document the fine-tuning techniques used to facilitate future\nresearch. Additionally, we introduce the use of Flare CFA, a publicly available\ndataset for evaluating LLMs as a financial advisor.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展揭示了技術領域的新功能和機會。然而，超大型 LLM 的實用性受到其高運算成本的挑戰，這無法證明其好處，因為與人類相比，它們的能力有限。雖然較小、更實用的 LLM 已在財務分析中展現潛力，但它們尚未完全熟練，這從它們在特許金融分析師 (CFA) 考試中接近及格的表現中可以看出。在這項工作中，我們為我們的文本超本地增強大型語言擴展 (THaLLE) 提出財務分析師擴展，一系列 8B LLM 在模擬 CFA 考試中持續取得最高表現，優於同等規模的模型。我們徹底記錄了用於促進未來研究的微調技術。此外，我們介紹了使用 Flare CFA，這是一個公開可用的數據集，用於評估 LLM 作為財務顧問。", "author": "KBTG Labs et.al.", "authors": "KBTG Labs, Danupat Khamnuansin, Atthakorn Petchsod, Anuruth Lertpiya, Pornchanan Balee, Thanawat Lodkaew, Tawunrat Chalothorn, Thadpong Pongthawornkamol, Monchai Lertsutthiwong", "id": "2406.07505v1", "paper_url": "http://arxiv.org/abs/2406.07505v1", "repo": "null"}}