{"2412.11863": {"publish_time": "2024-12-16", "title": "GeoX: Geometric Problem Solving Through Unified Formalized Vision-Language Pre-training", "paper_summary": "Despite their proficiency in general tasks, Multi-modal Large Language Models\n(MLLMs) struggle with automatic Geometry Problem Solving (GPS), which demands\nunderstanding diagrams, interpreting symbols, and performing complex reasoning.\nThis limitation arises from their pre-training on natural images and texts,\nalong with the lack of automated verification in the problem-solving process.\nBesides, current geometric specialists are limited by their task-specific\ndesigns, making them less effective for broader geometric problems. To this\nend, we present GeoX, a multi-modal large model focusing on geometric\nunderstanding and reasoning tasks. Given the significant differences between\ngeometric diagram-symbol and natural image-text, we introduce unimodal\npre-training to develop a diagram encoder and symbol decoder, enhancing the\nunderstanding of geometric images and corpora. Furthermore, we introduce\ngeometry-language alignment, an effective pre-training paradigm that bridges\nthe modality gap between unimodal geometric experts. We propose a\nGenerator-And-Sampler Transformer (GS-Former) to generate discriminative\nqueries and eliminate uninformative representations from unevenly distributed\ngeometric signals. Finally, GeoX benefits from visual instruction tuning,\nempowering it to take geometric images and questions as input and generate\nverifiable solutions. Experiments show that GeoX outperforms both generalists\nand geometric specialists on publicly recognized benchmarks, such as GeoQA,\nUniGeo, Geometry3K, and PGPS9k.", "paper_summary_zh": "儘管多模態大型語言模型 (MLLM) 在一般任務中表現出色，但它們在自動幾何問題求解 (GPS) 方面仍有困難，這需要理解圖表、解釋符號和進行複雜推理。這種限制來自於它們在自然影像和文字上的預訓練，以及在問題求解過程中缺乏自動驗證。此外，目前的幾何專家受到其特定任務設計的限制，這使得它們對於更廣泛的幾何問題效果不佳。為了解決這個問題，我們提出了 GeoX，這是一個專注於幾何理解和推理任務的多模態大型模型。鑑於幾何圖表符號與自然影像文字之間的顯著差異，我們引入了單模態預訓練來開發圖表編碼器和符號解碼器，增強對幾何影像和語料的理解。此外，我們引入了幾何語言對齊，這是一種有效的預訓練範例，可以彌合單模態幾何專家之間的模態差距。我們提出了一個生成器和採樣器Transformer (GS-Former) 來產生區分性的查詢，並從分佈不均的幾何訊號中消除無資訊的表示。最後，GeoX 受益於視覺指令調整，使其能夠將幾何影像和問題作為輸入，並產生可驗證的解決方案。實驗表明，GeoX 在公認的基準上優於通才和幾何專家，例如 GeoQA、UniGeo、Geometry3K 和 PGPS9k。", "author": "Renqiu Xia et.al.", "authors": "Renqiu Xia, Mingsheng Li, Hancheng Ye, Wenjie Wu, Hongbin Zhou, Jiakang Yuan, Tianshuo Peng, Xinyu Cai, Xiangchao Yan, Bin Wang, Conghui He, Botian Shi, Tao Chen, Junchi Yan, Bo Zhang", "id": "2412.11863v1", "paper_url": "http://arxiv.org/abs/2412.11863v1", "repo": "https://github.com/unimodal4reasoning/geox"}}