{"2501.17629": {"publish_time": "2025-01-29", "title": "The Imitation Game According To Turing", "paper_summary": "The current cycle of hype and anxiety concerning the benefits and risks to\nhuman society of Artificial Intelligence is fuelled, not only by the increasing\nuse of generative AI and other AI tools by the general public, but also by\nclaims made on behalf of such technology by popularizers and scientists. In\nparticular, recent studies have claimed that Large Language Models (LLMs) can\npass the Turing Test-a goal for AI since the 1950s-and therefore can \"think\".\nLarge-scale impacts on society have been predicted as a result. Upon detailed\nexamination, however, none of these studies has faithfully applied Turing's\noriginal instructions. Consequently, we conducted a rigorous Turing Test with\nGPT-4-Turbo that adhered closely to Turing's instructions for a three-player\nimitation game. We followed established scientific standards where Turing's\ninstructions were ambiguous or missing. For example, we performed a\nComputer-Imitates-Human Game (CIHG) without constraining the time duration and\nconducted a Man-Imitates-Woman Game (MIWG) as a benchmark. All but one\nparticipant correctly identified the LLM, showing that one of today's most\nadvanced LLMs is unable to pass a rigorous Turing Test. We conclude that recent\nextravagant claims for such models are unsupported, and do not warrant either\noptimism or concern about the social impact of thinking machines.", "paper_summary_zh": "當前關於人工智慧對人類社會的利弊的炒作和焦慮循環，不僅是由於公眾對生成式 AI 和其他 AI 工具的使用日益增加，還由於推廣者和科學家對此類技術提出的主張。特別是，最近的研究聲稱大型語言模型 (LLM) 可以通過圖靈測試——自 1950 年代以來 AI 的目標——因此可以「思考」。預測這將對社會產生大規模影響。然而，經過仔細檢查，這些研究都沒有忠實地應用圖靈的原始說明。因此，我們對 GPT-4-Turbo 進行了一項嚴格的圖靈測試，嚴格遵守圖靈對三人模仿遊戲的說明。在圖靈的說明模棱兩可或缺失的情況下，我們遵循既定的科學標準。例如，我們進行了一場計算機模仿人類遊戲 (CIHG)，沒有限制時間，並進行了一場男人模仿女人遊戲 (MIWG) 作為基準。除了參與者正確地識別了 LLM 之外，所有參與者都正確地識別了 LLM，這表明當今最先進的 LLM 之一無法通過嚴格的圖靈測試。我們得出結論，最近對此類模型的誇張說法得不到支持，也不保證對思考機器對社會影響的樂觀或擔憂。", "author": "Sharon Temtsin et.al.", "authors": "Sharon Temtsin, Diane Proudfoot, David Kaber, Christoph Bartneck", "id": "2501.17629v1", "paper_url": "http://arxiv.org/abs/2501.17629v1", "repo": "null"}}