{"2406.02134": {"publish_time": "2024-06-04", "title": "The current status of large language models in summarizing radiology report impressions", "paper_summary": "Large language models (LLMs) like ChatGPT show excellent capabilities in\nvarious natural language processing tasks, especially for text generation. The\neffectiveness of LLMs in summarizing radiology report impressions remains\nunclear. In this study, we explore the capability of eight LLMs on the\nradiology report impression summarization. Three types of radiology reports,\ni.e., CT, PET-CT, and Ultrasound reports, are collected from Peking University\nCancer Hospital and Institute. We use the report findings to construct the\nzero-shot, one-shot, and three-shot prompts with complete example reports to\ngenerate the impressions. Besides the automatic quantitative evaluation\nmetrics, we define five human evaluation metrics, i.e., completeness,\ncorrectness, conciseness, verisimilitude, and replaceability, to evaluate the\nsemantics of the generated impressions. Two thoracic surgeons (ZSY and LB) and\none radiologist (LQ) compare the generated impressions with the reference\nimpressions and score each impression under the five human evaluation metrics.\nExperimental results show that there is a gap between the generated impressions\nand reference impressions. Although the LLMs achieve comparable performance in\ncompleteness and correctness, the conciseness and verisimilitude scores are not\nvery high. Using few-shot prompts can improve the LLMs' performance in\nconciseness and verisimilitude, but the clinicians still think the LLMs can not\nreplace the radiologists in summarizing the radiology impressions.", "paper_summary_zh": "大型語言模型 (LLM)，例如 ChatGPT，在各種自然語言處理任務中展現出色的能力，特別是在文本生成方面。LLM 在總結放射科報告印象方面的有效性仍不清楚。在本研究中，我們探討了八個 LLM 在放射科報告印象摘要中的能力。從北京大學腫瘤醫院和研究所收集了三種類型的放射科報告，即 CT、PET-CT 和超音波報告。我們使用報告結果來建構零次、一次和三次提示，並附上完整的範例報告以產生印象。除了自動量化評估指標之外，我們定義了五個人類評估指標，即完整性、正確性、簡潔性、合理性和可替換性，以評估所產生印象的語義。兩位胸腔外科醫生 (ZSY 和 LB) 和一位放射科醫生 (LQ) 將產生的印象與參考印象進行比較，並根據五個人類評估指標對每個印象進行評分。實驗結果顯示，產生的印象與參考印象之間存在差距。儘管 LLM 在完整性和正確性方面取得相當的表現，但簡潔性和合理性分數並不高。使用少次提示可以改善 LLM 在簡潔性和合理性方面的表現，但臨床醫生仍然認為 LLM 無法取代放射科醫生總結放射科印象。", "author": "Danqing Hu et.al.", "authors": "Danqing Hu, Shanyuan Zhang, Qing Liu, Xiaofeng Zhu, Bing Liu", "id": "2406.02134v1", "paper_url": "http://arxiv.org/abs/2406.02134v1", "repo": "null"}}