{"2412.03179": {"publish_time": "2024-12-04", "title": "Optimizing Dense Visual Predictions Through Multi-Task Coherence and Prioritization", "paper_summary": "Multi-Task Learning (MTL) involves the concurrent training of multiple tasks,\noffering notable advantages for dense prediction tasks in computer vision. MTL\nnot only reduces training and inference time as opposed to having multiple\nsingle-task models, but also enhances task accuracy through the interaction of\nmultiple tasks. However, existing methods face limitations. They often rely on\nsuboptimal cross-task interactions, resulting in task-specific predictions with\npoor geometric and predictive coherence. In addition, many approaches use\ninadequate loss weighting strategies, which do not address the inherent\nvariability in task evolution during training. To overcome these challenges, we\npropose an advanced MTL model specifically designed for dense vision tasks. Our\nmodel leverages state-of-the-art vision transformers with task-specific\ndecoders. To enhance cross-task coherence, we introduce a trace-back method\nthat improves both cross-task geometric and predictive features. Furthermore,\nwe present a novel dynamic task balancing approach that projects task losses\nonto a common scale and prioritizes more challenging tasks during training.\nExtensive experiments demonstrate the superiority of our method, establishing\nnew state-of-the-art performance across two benchmark datasets. The code is\navailable at:https://github.com/Klodivio355/MT-CP", "paper_summary_zh": "多任務學習 (MTL) 涉及多個任務的並發訓練，為電腦視覺中的密集預測任務提供了顯著優勢。MTL 不僅減少了訓練和推理時間，與擁有多個單任務模型相比，還通過多個任務的交互增強了任務準確性。然而，現有方法面臨限制。它們通常依賴於次優的跨任務交互，導致任務特定的預測具有較差的幾何和預測一致性。此外，許多方法使用不充分的損失加權策略，這無法解決訓練過程中任務演化的固有變異性。為了克服這些挑戰，我們提出了一個專門為密集視覺任務設計的高級 MTL 模型。我們的模型利用了最先進的視覺變換器和任務特定的解碼器。為了增強跨任務一致性，我們引入了一種追溯方法，它改進了跨任務幾何和預測特徵。此外，我們提出了一種新穎的動態任務平衡方法，它將任務損失投影到一個公共尺度上，並在訓練過程中優先考慮更具挑戰性的任務。廣泛的實驗證明了我們方法的優越性，在兩個基準數據集上建立了新的最先進性能。代碼可在以下位置獲得：https://github.com/Klodivio355/MT-CP", "author": "Maxime Fontana et.al.", "authors": "Maxime Fontana, Michael Spratling, Miaojing Shi", "id": "2412.03179v1", "paper_url": "http://arxiv.org/abs/2412.03179v1", "repo": "null"}}