{"2502.11995": {"publish_time": "2025-02-17", "title": "Presumed Cultural Identity: How Names Shape LLM Responses", "paper_summary": "Names are deeply tied to human identity. They can serve as markers of\nindividuality, cultural heritage, and personal history. However, using names as\na core indicator of identity can lead to over-simplification of complex\nidentities. When interacting with LLMs, user names are an important point of\ninformation for personalisation. Names can enter chatbot conversations through\ndirect user input (requested by chatbots), as part of task contexts such as CV\nreviews, or as built-in memory features that store user information for\npersonalisation. We study biases associated with names by measuring cultural\npresumptions in the responses generated by LLMs when presented with common\nsuggestion-seeking queries, which might involve making assumptions about the\nuser. Our analyses demonstrate strong assumptions about cultural identity\nassociated with names present in LLM generations across multiple cultures. Our\nwork has implications for designing more nuanced personalisation systems that\navoid reinforcing stereotypes while maintaining meaningful customisation.", "paper_summary_zh": "姓名與人類身分密不可分。它們可以作為個人特質、文化遺產和個人歷史的標記。然而，將姓名作為身分的核心指標可能會導致複雜身分的過度簡化。在與 LLM 互動時，使用者名稱是個人化的重要資訊點。姓名可以透過直接使用者輸入（聊天機器人要求）、作為履歷審查等任務情境的其中一部分，或作為儲存使用者資訊以供個人化的內建記憶功能，進入聊天機器人對話。我們透過衡量 LLM 在面對常見的建議尋求查詢時所產生的回應中的文化預設，來研究與姓名相關的偏見，這可能涉及對使用者的假設。我們的分析顯示，在跨多種文化的 LLM 世代中，與姓名相關的文化身分有強烈的假設。我們的研究對於設計更細緻的個人化系統有影響，這些系統避免強化刻板印象，同時維持有意義的客製化。", "author": "Siddhesh Pawar et.al.", "authors": "Siddhesh Pawar, Arnav Arora, Lucie-Aimée Kaffee, Isabelle Augenstein", "id": "2502.11995v1", "paper_url": "http://arxiv.org/abs/2502.11995v1", "repo": "null"}}