{"2405.17220": {"publish_time": "2024-05-27", "title": "RLAIF-V: Aligning MLLMs through Open-Source AI Feedback for Super GPT-4V Trustworthiness", "paper_summary": "Learning from feedback reduces the hallucination of multimodal large language\nmodels (MLLMs) by aligning them with human preferences. While traditional\nmethods rely on labor-intensive and time-consuming manual labeling, recent\napproaches employing models as automatic labelers have shown promising results\nwithout human intervention. However, these methods heavily rely on costly\nproprietary models like GPT-4V, resulting in scalability issues. Moreover, this\nparadigm essentially distills the proprietary models to provide a temporary\nsolution to quickly bridge the performance gap. As this gap continues to\nshrink, the community is soon facing the essential challenge of aligning MLLMs\nusing labeler models of comparable capability. In this work, we introduce\nRLAIF-V, a novel framework that aligns MLLMs in a fully open-source paradigm\nfor super GPT-4V trustworthiness. RLAIF-V maximally exploits the open-source\nfeedback from two perspectives, including high-quality feedback data and online\nfeedback learning algorithm. Extensive experiments on seven benchmarks in both\nautomatic and human evaluation show that RLAIF-V substantially enhances the\ntrustworthiness of models without sacrificing performance on other tasks. Using\na 34B model as labeler, RLAIF-V 7B model reduces object hallucination by 82.9\\%\nand overall hallucination by 42.1\\%, outperforming the labeler model.\nRemarkably, RLAIF-V also reveals the self-alignment potential of open-source\nMLLMs, where a 12B model can learn from the feedback of itself to achieve less\nthan 29.5\\% overall hallucination rate, surpassing GPT-4V (45.9\\%) by a large\nmargin. The results shed light on a promising route to enhance the efficacy of\nleading-edge MLLMs.", "paper_summary_zh": "<paragraph>從回饋中學習可減少多模態大型語言模型 (MLLM) 的幻覺，方法是讓它們與人類偏好保持一致。雖然傳統方法依賴於勞力密集且耗時的標籤手動標記，但最近採用模型作為自動標籤器的做法已顯示出有希望的結果，而無需人工干預。然而，這些方法嚴重依賴於像 GPT-4V 這樣的昂貴專有模型，導致可擴充性問題。此外，這種範例基本上會精簡專有模型，以提供暫時解決方案來快速縮小效能差距。隨著這個差距持續縮小，社群很快就會面臨使用具有可比能力的標籤器模型來調整 MLLM 的基本挑戰。在這項工作中，我們介紹了 RLAIF-V，這是一個新穎的框架，它在一個完全開源的範例中調整 MLLM，以獲得超 GPT-4V 的可信度。RLAIF-V 從兩個角度最大程度地利用開源回饋，包括高品質回饋資料和線上回饋學習演算法。在自動和人工評估中對七個基準進行的廣泛實驗表明，RLAIF-V 大幅提升了模型的可信度，而不會犧牲其他任務的效能。使用 34B 模型作為標籤器，RLAIF-V 7B 模型將物件幻覺減少了 82.9%，整體幻覺減少了 42.1%，表現優於標籤器模型。值得注意的是，RLAIF-V 也揭示了開源 MLLM 的自我調整潛力，其中一個 12B 模型可以從自身的回饋中學習，以達到低於 29.5% 的整體幻覺率，大幅超越 GPT-4V (45.9%)。這些結果為提升領先 MLLM 的功效照亮了一條有希望的途徑。</paragraph>", "author": "Tianyu Yu et.al.", "authors": "Tianyu Yu, Haoye Zhang, Yuan Yao, Yunkai Dang, Da Chen, Xiaoman Lu, Ganqu Cui, Taiwen He, Zhiyuan Liu, Tat-Seng Chua, Maosong Sun", "id": "2405.17220v1", "paper_url": "http://arxiv.org/abs/2405.17220v1", "repo": "https://github.com/rlhf-v/rlaif-v"}}