{"2406.18049": {"publish_time": "2024-06-26", "title": "Improving Entity Recognition Using Ensembles of Deep Learning and Fine-tuned Large Language Models: A Case Study on Adverse Event Extraction from Multiple Sources", "paper_summary": "Adverse event (AE) extraction following COVID-19 vaccines from text data is\ncrucial for monitoring and analyzing the safety profiles of immunizations.\nTraditional deep learning models are adept at learning intricate feature\nrepresentations and dependencies in sequential data, but often require\nextensive labeled data. In contrast, large language models (LLMs) excel in\nunderstanding contextual information, but exhibit unstable performance on named\nentity recognition tasks, possibly due to their broad but unspecific training.\nThis study aims to evaluate the effectiveness of LLMs and traditional deep\nlearning models in AE extraction, and to assess the impact of ensembling these\nmodels on performance. In this study, we utilized reports and posts from the\nVAERS (n=621), Twitter (n=9,133), and Reddit (n=131) as our corpora. Our goal\nwas to extract three types of entities: \"vaccine\", \"shot\", and \"ae\". We\nexplored and fine-tuned (except GPT-4) multiple LLMs, including GPT-2, GPT-3.5,\nGPT-4, and Llama-2, as well as traditional deep learning models like RNN and\nBioBERT. To enhance performance, we created ensembles of the three models with\nthe best performance. For evaluation, we used strict and relaxed F1 scores to\nevaluate the performance for each entity type, and micro-average F1 was used to\nassess the overall performance. The ensemble model achieved the highest\nperformance in \"vaccine\", \"shot\", and \"ae\" with strict F1-scores of 0.878,\n0.930, and 0.925, respectively, along with a micro-average score of 0.903. In\nconclusion, this study demonstrates the effectiveness and robustness of\nensembling fine-tuned traditional deep learning models and LLMs, for extracting\nAE-related information. This study contributes to the advancement of biomedical\nnatural language processing, providing valuable insights into improving AE\nextraction from text data for pharmacovigilance and public health surveillance.", "paper_summary_zh": "從文本資料中擷取 COVID-19 疫苗的不良事件 (AE) 對於監控和分析免疫的安全性非常重要。傳統深度學習模型擅長學習序列資料中的複雜特徵表示和依賴關係，但通常需要大量的標籤資料。相比之下，大型語言模型 (LLM) 擅長理解上下文資訊，但在命名實體識別任務上的表現不穩定，這可能是因為它們的訓練範圍廣泛但缺乏針對性。本研究旨在評估 LLM 和傳統深度學習模型在 AE 擷取中的有效性，並評估將這些模型組成的影響。在本研究中，我們利用 VAERS (n=621)、Twitter (n=9,133) 和 Reddit (n=131) 的報告和文章作為語料庫。我們的目標是擷取三種類型的實體：「疫苗」、「注射」和「不良事件」。我們探索並微調了多個 LLM，包括 GPT-2、GPT-3.5、GPT-4 和 Llama-2，以及傳統深度學習模型，例如 RNN 和 BioBERT（GPT-4 除外）。為了提升效能，我們建立了表現最佳的三個模型的集合。在評估方面，我們使用嚴格和放寬的 F1 分數來評估每個實體類型的效能，並使用微平均 F1 來評估整體效能。組合模型在「疫苗」、「注射」和「不良事件」中分別以 0.878、0.930 和 0.925 的嚴格 F1 分數獲得最高效能，微平均分數為 0.903。結論是，本研究證明了微調後的傳統深度學習模型和 LLM 的集合在擷取與 AE 相關的資訊方面的有效性和穩健性。本研究有助於促進生物醫學自然語言處理，並提供有價值的見解，以改善藥物警戒和公共衛生監測中從文本資料中擷取 AE 的方式。", "author": "Yiming Li et.al.", "authors": "Yiming Li, Deepthi Viswaroopan, William He, Jianfu Li, Xu Zuo, Hua Xu, Cui Tao", "id": "2406.18049v1", "paper_url": "http://arxiv.org/abs/2406.18049v1", "repo": "null"}}