{"2501.17384": {"publish_time": "2025-01-29", "title": "A Dual-Agent Adversarial Framework for Robust Generalization in Deep Reinforcement Learning", "paper_summary": "Recently, empowered with the powerful capabilities of neural networks,\nreinforcement learning (RL) has successfully tackled numerous challenging\ntasks. However, while these models demonstrate enhanced decision-making\nabilities, they are increasingly prone to overfitting. For instance, a trained\nRL model often fails to generalize to even minor variations of the same task,\nsuch as a change in background color or other minor semantic differences. To\naddress this issue, we propose a dual-agent adversarial policy learning\nframework, which allows agents to spontaneously learn the underlying semantics\nwithout introducing any human prior knowledge. Specifically, our framework\ninvolves a game process between two agents: each agent seeks to maximize the\nimpact of perturbing on the opponent's policy by producing representation\ndifferences for the same state, while maintaining its own stability against\nsuch perturbations. This interaction encourages agents to learn generalizable\npolicies, capable of handling irrelevant features from the high-dimensional\nobservations. Extensive experimental results on the Procgen benchmark\ndemonstrate that the adversarial process significantly improves the\ngeneralization performance of both agents, while also being applied to various\nRL algorithms, e.g., Proximal Policy Optimization (PPO). With the adversarial\nframework, the RL agent outperforms the baseline methods by a significant\nmargin, especially in hard-level tasks, marking a significant step forward in\nthe generalization capabilities of deep reinforcement learning.", "paper_summary_zh": "<paragraph>近期，在神经網路強大功能的加持下，強化學習 (RL) 已成功解決許多具有挑戰性的任務。然而，儘管這些模型展現出增強的決策能力，它們卻越來越容易過度擬合。例如，訓練過的 RL 模型通常無法概括到同一個任務的微小變化，例如背景顏色的改變或其他細微的語義差異。為了解決這個問題，我們提出一個雙代理對抗策略學習框架，該框架允許代理自動學習基礎語義，而無需引入任何人類先驗知識。具體來說，我們的框架涉及兩個代理之間的遊戲過程：每個代理都試圖通過產生相同狀態的表示差異來最大化對對手策略的擾動影響，同時保持其自身對這些擾動的穩定性。這種交互作用鼓勵代理學習可概括的策略，能夠處理高維度觀察中的無關特徵。在 Procgen 基準上的廣泛實驗結果表明，對抗過程顯著提高了兩個代理的泛化效能，同時也應用於各種 RL 演算法，例如近端策略最佳化 (PPO)。有了對抗框架，RL 代理的表現顯著優於基準方法，特別是在高難度任務中，標誌著深度強化學習的泛化能力向前邁進了一大步。</paragraph>", "author": "Zhengpeng Xie et.al.", "authors": "Zhengpeng Xie, Jiahang Cao, Yulong Zhang, Qiang Zhang, Renjing Xu", "id": "2501.17384v1", "paper_url": "http://arxiv.org/abs/2501.17384v1", "repo": "null"}}