{"2405.20253": {"publish_time": "2024-05-30", "title": "Evaluating Large Language Model Biases in Persona-Steered Generation", "paper_summary": "The task of persona-steered text generation requires large language models\n(LLMs) to generate text that reflects the distribution of views that an\nindividual fitting a persona could have. People have multifaceted personas, but\nprior work on bias in LLM-generated opinions has only explored multiple-choice\nsettings or one-dimensional personas. We define an incongruous persona as a\npersona with multiple traits where one trait makes its other traits less likely\nin human survey data, e.g. political liberals who support increased military\nspending. We find that LLMs are 9.7% less steerable towards incongruous\npersonas than congruous ones, sometimes generating the stereotypical stance\nassociated with its demographic rather than the target stance. Models that we\nevaluate that are fine-tuned with Reinforcement Learning from Human Feedback\n(RLHF) are more steerable, especially towards stances associated with political\nliberals and women, but present significantly less diverse views of personas.\nWe also find variance in LLM steerability that cannot be predicted from\nmultiple-choice opinion evaluation. Our results show the importance of\nevaluating models in open-ended text generation, as it can surface new LLM\nopinion biases. Moreover, such a setup can shed light on our ability to steer\nmodels toward a richer and more diverse range of viewpoints.", "paper_summary_zh": "人格導向文本生成的任務需要大型語言模型 (LLM) 產生反映擁有特定人格的個人觀點分佈的文本。人們有多面性的人格，但先前關於 LLM 生成意見中偏見的研究僅探討了多重選擇設定或一維人格。我們將不一致的人格定義為具有多重特質的人格，其中一個特質使其其他特質在人類調查數據中不太可能出現，例如支持增加軍費開支的政治自由派。我們發現，LLM 對不一致人格的引導力比一致人格低 9.7%，有時會產生與其人口統計資料相關的刻板立場，而不是目標立場。我們評估的模型經過人類回饋強化學習 (RLHF) 微調後，更具可引導性，特別是對與政治自由派和女性相關的立場，但呈現出明顯較少樣化的人格觀點。我們還發現 LLM 可引導性中的差異無法從多重選擇意見評估中預測。我們的結果顯示了在開放式文本生成中評估模型的重要性，因為它可以浮現新的 LLM 意見偏見。此外，這樣的設定可以闡明我們引導模型朝向更豐富、更多樣化的觀點範圍的能力。", "author": "Andy Liu et.al.", "authors": "Andy Liu, Mona Diab, Daniel Fried", "id": "2405.20253v1", "paper_url": "http://arxiv.org/abs/2405.20253v1", "repo": "https://github.com/andyjliu/persona-steered-generation-bias"}}