{"2406.02396": {"publish_time": "2024-06-04", "title": "The Scandinavian Embedding Benchmarks: Comprehensive Assessment of Multilingual and Monolingual Text Embedding", "paper_summary": "The evaluation of English text embeddings has transitioned from evaluating a\nhandful of datasets to broad coverage across many tasks through benchmarks such\nas MTEB. However, this is not the case for multilingual text embeddings due to\na lack of available benchmarks. To address this problem, we introduce the\nScandinavian Embedding Benchmark (SEB). SEB is a comprehensive framework that\nenables text embedding evaluation for Scandinavian languages across 24 tasks,\n10 subtasks, and 4 task categories. Building on SEB, we evaluate more than 26\nmodels, uncovering significant performance disparities between public and\ncommercial solutions not previously captured by MTEB. We open-source SEB and\nintegrate it with MTEB, thus bridging the text embedding evaluation gap for\nScandinavian languages.", "paper_summary_zh": "英語文字嵌入的評估已從評估少數資料集轉變為透過 MTEB 等基準在許多任務中廣泛涵蓋。然而，由於缺乏可用的基準，多語文字嵌入並非如此。為了解決這個問題，我們引入了斯堪地那維亞嵌入基準 (SEB)。SEB 是個全面的架構，可在 24 個任務、10 個子任務和 4 個任務類別中啟用斯堪地那維亞語言的文字嵌入評估。建立在 SEB 的基礎上，我們評估了超過 26 個模型，發現了 MTEB 之前未捕捉到的公開和商業解決方案之間的顯著效能差異。我們開放原始碼 SEB 並將其與 MTEB 整合，從而彌補了斯堪地那維亞語言的文字嵌入評估差距。", "author": "Kenneth Enevoldsen et.al.", "authors": "Kenneth Enevoldsen, Márton Kardos, Niklas Muennighoff, Kristoffer Laigaard Nielbo", "id": "2406.02396v1", "paper_url": "http://arxiv.org/abs/2406.02396v1", "repo": "https://github.com/kennethenevoldsen/scandinavian-embedding-benchmark"}}