{"2407.12259": {"publish_time": "2024-07-17", "title": "In-Context Probing Approximates Influence Function for Data Valuation", "paper_summary": "Data valuation quantifies the value of training data, and is used for data\nattribution (i.e., determining the contribution of training data towards model\npredictions), and data selection; both of which are important for curating\nhigh-quality datasets to train large language models. In our paper, we show\nthat data valuation through in-context probing (i.e., prompting a LLM)\napproximates influence functions for selecting training data. We provide a\ntheoretical sketch on this connection based on transformer models performing\n\"implicit\" gradient descent on its in-context inputs. Our empirical findings\nshow that in-context probing and gradient-based influence frameworks are\nsimilar in how they rank training data. Furthermore, fine-tuning experiments on\ndata selected by either method reveal similar model performance.", "paper_summary_zh": "資料估值量化訓練資料的價值，並用於資料歸因（即，決定訓練資料對模型預測的貢獻），以及資料選擇；這兩者對於策劃高品質的資料集來訓練大型語言模型都很重要。在我們的論文中，我們展示了透過脈絡探測（即，提示 LLM）進行資料估值，近似於用於選擇訓練資料的影響函數。我們根據Transformer模型在其脈絡輸入上執行「隱式」梯度下降，提供了關於此關聯的理論草圖。我們的實證結果顯示，脈絡探測和基於梯度的影響框架在對訓練資料進行排序的方式上很相似。此外，對由任一方法選擇的資料進行微調的實驗揭示了類似的模型效能。", "author": "Cathy Jiao et.al.", "authors": "Cathy Jiao, Gary Gao, Chenyan Xiong", "id": "2407.12259v1", "paper_url": "http://arxiv.org/abs/2407.12259v1", "repo": "null"}}