{"2502.02740": {"publish_time": "2025-02-04", "title": "Vision-Language Model Dialog Games for Self-Improvement", "paper_summary": "The increasing demand for high-quality, diverse training data poses a\nsignificant bottleneck in advancing vision-language models (VLMs). This paper\npresents VLM Dialog Games, a novel and scalable self-improvement framework for\nVLMs. Our approach leverages self-play between two agents engaged in a\ngoal-oriented play centered around image identification. By filtering for\nsuccessful game interactions, we automatically curate a high-quality dataset of\ninterleaved images and text. We demonstrate that fine-tuning on this synthetic\ndata leads to performance gains on downstream tasks and generalises across\ndatasets. Moreover, as the improvements in the model lead to better game play,\nthis procedure can be applied iteratively. This work paves the way for\nself-improving VLMs, with potential applications in various real-world\nscenarios especially when the high-quality multimodal data is scarce.", "paper_summary_zh": "隨著對高品質、多元訓練資料需求的增加，在推進視覺語言模型 (VLM) 方面出現一個重大的瓶頸。本文提出 VLM 對話遊戲，一個新穎且可擴充的自提升架構，用於 VLM。我們的做法利用兩個參與以影像辨識為中心的目標導向遊戲的代理之間的自我對弈。透過篩選成功的遊戲互動，我們自動策展一個高品質的交錯影像和文字資料集。我們展示在這個合成資料上進行微調，會提升下游任務的效能，並在資料集之間進行概化。此外，隨著模型的提升導致更好的遊戲玩法，這個程序可以反覆套用。這項工作為自我提升的 VLM 鋪路，在各種真實世界場景中具有潛在應用，尤其是在高品質多模態資料稀少的情況下。", "author": "Ksenia Konyushkova et.al.", "authors": "Ksenia Konyushkova, Christos Kaplanis, Serkan Cabi, Misha Denil", "id": "2502.02740v1", "paper_url": "http://arxiv.org/abs/2502.02740v1", "repo": "null"}}