{"2408.11396": {"publish_time": "2024-08-21", "title": "MoE-LPR: Multilingual Extension of Large Language Models through Mixture-of-Experts with Language Priors Routing", "paper_summary": "Large Language Models (LLMs) are often English-centric due to the\ndisproportionate distribution of languages in their pre-training data.\nEnhancing non-English language capabilities through post-pretraining often\nresults in catastrophic forgetting of the ability of original languages.\nPrevious methods either achieve good expansion with severe forgetting or slight\nforgetting with poor expansion, indicating the challenge of balancing language\nexpansion while preventing forgetting. In this paper, we propose a method\ncalled MoE-LPR (Mixture-of-Experts with Language Priors Routing) to alleviate\nthis problem. MoE-LPR employs a two-stage training approach to enhance the\nmultilingual capability. First, the model is post-pretrained into a\nMixture-of-Experts (MoE) architecture by upcycling, where all the original\nparameters are frozen and new experts are added. In this stage, we focus\nimproving the ability on expanded languages, without using any original\nlanguage data. Then, the model reviews the knowledge of the original languages\nwith replay data amounting to less than 1% of post-pretraining, where we\nincorporate language priors routing to better recover the abilities of the\noriginal languages. Evaluations on multiple benchmarks show that MoE-LPR\noutperforms other post-pretraining methods. Freezing original parameters\npreserves original language knowledge while adding new experts preserves the\nlearning ability. Reviewing with LPR enables effective utilization of\nmultilingual knowledge within the parameters. Additionally, the MoE\narchitecture maintains the same inference overhead while increasing total model\nparameters. Extensive experiments demonstrate MoE-LPR's effectiveness in\nimproving expanded languages and preserving original language proficiency with\nsuperior scalability. Code and scripts are freely available at\nhttps://github.com/zjwang21/MoE-LPR.git.", "paper_summary_zh": "大型語言模型（LLM）通常以英語為中心，因為在預訓練資料中語言分佈不均衡。透過後預訓練增強非英語語言能力通常會導致原本語言能力的災難性遺忘。先前的做法不是達到良好的擴充，但有嚴重的遺忘，就是遺忘輕微但擴充不良，這表示在防止遺忘的同時平衡語言擴充的挑戰。在本文中，我們提出一個稱為 MoE-LPR（混合專家與語言先驗路由）的方法來減輕這個問題。MoE-LPR 採用兩階段的訓練方法來增強多語言能力。首先，模型透過升級後預訓練成混合專家（MoE）架構，其中所有原本的參數都會凍結，並加入新的專家。在這個階段，我們專注於提升擴充語言的能力，而不使用任何原本的語言資料。接著，模型會檢視原本語言的知識，並使用少於 1% 後預訓練的重播資料，其中我們納入語言先驗路由，以便更好地恢復原本語言的能力。在多個基準上的評估顯示，MoE-LPR 的表現優於其他後預訓練方法。凍結原本的參數可以保留原本的語言知識，同時加入新的專家可以保留學習能力。使用 LPR 檢視可以有效利用參數中的多語言知識。此外，MoE 架構在增加總模型參數的同時，維持相同的推論開銷。廣泛的實驗證明了 MoE-LPR 在提升擴充語言和保留原本語言能力方面的效能，並具有優異的可擴充性。程式碼和指令碼可於 https://github.com/zjwang21/MoE-LPR.git 免費取得。", "author": "Hao Zhou et.al.", "authors": "Hao Zhou, Zhijun Wang, Shujian Huang, Xin Huang, Xue Han, Junlan Feng, Chao Deng, Weihua Luo, Jiajun Chen", "id": "2408.11396v1", "paper_url": "http://arxiv.org/abs/2408.11396v1", "repo": "https://github.com/zjwang21/moe-lpr"}}