{"2501.07849": {"publish_time": "2025-01-14", "title": "Unveiling Provider Bias in Large Language Models for Code Generation", "paper_summary": "Large Language Models (LLMs) have emerged as the new recommendation engines,\noutperforming traditional methods in both capability and scope, particularly in\ncode generation applications. Our research reveals a novel provider bias in\nLLMs, namely without explicit input prompts, these models show systematic\npreferences for services from specific providers in their recommendations\n(e.g., favoring Google Cloud over Microsoft Azure). This bias holds significant\nimplications for market dynamics and societal equilibrium, potentially\npromoting digital monopolies. It may also deceive users and violate their\nexpectations, leading to various consequences. This paper presents the first\ncomprehensive empirical study of provider bias in LLM code generation. We\ndevelop a systematic methodology encompassing an automated pipeline for dataset\ngeneration, incorporating 6 distinct coding task categories and 30 real-world\napplication scenarios. Our analysis encompasses over 600,000 LLM-generated\nresponses across seven state-of-the-art models, utilizing approximately 500\nmillion tokens (equivalent to \\$5,000+ in computational costs). The study\nevaluates both the generated code snippets and their embedded service provider\nselections to quantify provider bias. Additionally, we conduct a comparative\nanalysis of seven debiasing prompting techniques to assess their efficacy in\nmitigating these biases. Our findings demonstrate that LLMs exhibit significant\nprovider preferences, predominantly favoring services from Google and Amazon,\nand can autonomously modify input code to incorporate their preferred providers\nwithout users' requests. Notably, we observe discrepancies between providers\nrecommended in conversational contexts versus those implemented in generated\ncode. The complete dataset and analysis results are available in our\nrepository.", "paper_summary_zh": "大型語言模型 (LLM) 已成為新的推薦引擎，在能力和範圍上都優於傳統方法，特別是在程式碼產生應用中。我們的研究揭露了 LLM 中一種新的供應商偏見，即在沒有明確輸入提示的情況下，這些模型在其推薦中系統性地偏好特定供應商的服務（例如，偏好 Google Cloud 而非 Microsoft Azure）。這種偏見對市場動態和社會平衡具有重大影響，可能會促進數位壟斷。它也可能欺騙使用者並違反他們的期望，導致各種後果。本文提出了第一個關於 LLM 程式碼產生中供應商偏見的全面實證研究。我們開發了一種系統化的方法，包括一個用於產生資料集的自動化流程，其中包含 6 個不同的編碼任務類別和 30 個真實世界的應用場景。我們的分析涵蓋了七個最先進模型產生的超過 600,000 個 LLM 回應，使用了大約 5 億個代幣（相當於 5,000 美元以上的運算成本）。該研究評估了產生的程式碼片段及其嵌入的服務供應商選擇，以量化供應商偏見。此外，我們對七種去偏提示技術進行了比較分析，以評估它們在減輕這些偏見方面的效力。我們的研究結果表明，LLM 表現出顯著的供應商偏好，主要偏好 Google 和 Amazon 的服務，並且可以在沒有使用者要求的情況下自主修改輸入程式碼以納入其首選供應商。值得注意的是，我們觀察到在對話情境中推薦的供應商與在產生的程式碼中實現的供應商之間存在差異。完整的資料集和分析結果可在我們的儲存庫中找到。", "author": "Xiaoyu Zhang et.al.", "authors": "Xiaoyu Zhang, Juan Zhai, Shiqing Ma, Qingshuang Bao, Weipeng Jiang, Chao Shen, Yang Liu", "id": "2501.07849v1", "paper_url": "http://arxiv.org/abs/2501.07849v1", "repo": "null"}}