{"2501.12485": {"publish_time": "2025-01-21", "title": "R2D2: Remembering, Reflecting and Dynamic Decision Making for Web Agents", "paper_summary": "The proliferation of web agents necessitates advanced navigation and\ninteraction strategies within complex web environments. Current models often\nstruggle with efficient navigation and action execution due to limited\nvisibility and understanding of web structures. Our proposed R2D2 framework\naddresses these challenges by integrating two paradigms: Remember and Reflect.\nThe Remember paradigm utilizes a replay buffer that aids agents in\nreconstructing the web environment dynamically, thus enabling the formulation\nof a detailed ``map'' of previously visited pages. This helps in reducing\nnavigational errors and optimizing the decision-making process during web\ninteractions. Conversely, the Reflect paradigm allows agents to learn from past\nmistakes by providing a mechanism for error analysis and strategy refinement,\nenhancing overall task performance. We evaluate R2D2 using the WEBARENA\nbenchmark, demonstrating significant improvements over existing methods,\nincluding a 50% reduction in navigation errors and a threefold increase in task\ncompletion rates. Our findings suggest that a combination of memory-enhanced\nnavigation and reflective learning promisingly advances the capabilities of web\nagents, potentially benefiting various applications such as automated customer\nservice and personal digital assistants.", "paper_summary_zh": "網路代理的激增需要在複雜的網路環境中進階的導航和互動策略。由於對網路結構的能見度和理解有限，目前的模型常常在有效導航和動作執行上遇到困難。我們提出的 R2D2 架構透過整合「記憶」和「反思」兩個範例來解決這些挑戰。記憶範例利用重播緩衝區，協助代理動態重建網路環境，進而形成先前造訪頁面的詳細「地圖」。這有助於減少導航錯誤，並在網路互動中最佳化決策制定過程。相反地，反思範例允許代理透過提供錯誤分析和策略精進的機制，從過去的錯誤中學習，進而提升整體任務執行。我們使用 WEBARENA 基準評估 R2D2，展示出相較於現有方法的顯著改善，包括導航錯誤減少 50%，以及任務完成率增加三倍。我們的發現顯示，結合記憶增強導航和反思學習，有望提升網路代理的能力，進而造福各種應用，例如自動化客戶服務和個人數位助理。", "author": "Tenghao Huang et.al.", "authors": "Tenghao Huang, Kinjal Basu, Ibrahim Abdelaziz, Pavan Kapanipathi, Jonathan May, Muhao Chen", "id": "2501.12485v1", "paper_url": "http://arxiv.org/abs/2501.12485v1", "repo": "null"}}