{"2412.12650": {"publish_time": "2024-12-17", "title": "Neural-Network-Driven Reward Prediction as a Heuristic: Advancing Q-Learning for Mobile Robot Path Planning", "paper_summary": "Q-learning is a widely used reinforcement learning technique for solving path\nplanning problems. It primarily involves the interaction between an agent and\nits environment, enabling the agent to learn an optimal strategy that maximizes\ncumulative rewards. Although many studies have reported the effectiveness of\nQ-learning, it still faces slow convergence issues in practical applications.\nTo address this issue, we propose the NDR-QL method, which utilizes neural\nnetwork outputs as heuristic information to accelerate the convergence process\nof Q-learning. Specifically, we improved the dual-output neural network model\nby introducing a start-end channel separation mechanism and enhancing the\nfeature fusion process. After training, the proposed NDR model can output a\nnarrowly focused optimal probability distribution, referred to as the\nguideline, and a broadly distributed suboptimal distribution, referred to as\nthe region. Subsequently, based on the guideline prediction, we calculate the\ncontinuous reward function for the Q-learning method, and based on the region\nprediction, we initialize the Q-table with a bias. We conducted training,\nvalidation, and path planning simulation experiments on public datasets. The\nresults indicate that the NDR model outperforms previous methods by up to 5\\%\nin prediction accuracy. Furthermore, the proposed NDR-QL method improves the\nconvergence speed of the baseline Q-learning method by 90\\% and also surpasses\nthe previously improved Q-learning methods in path quality metrics.", "paper_summary_zh": "Q 學習是一種廣泛使用的強化學習技術，用於解決路徑規劃問題。它主要涉及代理和其環境之間的互動，使代理能夠學習一種最佳策略，以最大化累積獎勵。儘管許多研究報告了 Q 學習的有效性，但它在實際應用中仍然面臨收斂速度慢的問題。為了解決這個問題，我們提出了 NDR-QL 方法，它利用神經網路輸出作為啟發式資訊，以加速 Q 學習的收斂過程。具體來說，我們通過引入起始端通道分離機制和增強特徵融合過程，改進了雙輸出神經網路模型。經過訓練後，所提出的 NDR 模型可以輸出一個集中焦點的最佳機率分佈，稱為準則，以及一個廣泛分佈的次佳分佈，稱為區域。隨後，根據準則預測，我們計算 Q 學習方法的連續獎勵函數，並根據區域預測，我們用偏差初始化 Q 表。我們對公共資料集進行了訓練、驗證和路徑規劃模擬實驗。結果表明，NDR 模型在預測準確度上比以前的方法高出 5%。此外，所提出的 NDR-QL 方法將基準 Q 學習方法的收斂速度提高了 90%，並且在路徑品質指標上也超越了以前改進的 Q 學習方法。", "author": "Yiming Ji et.al.", "authors": "Yiming Ji, Kaijie Yun, Yang Liu, Zongwu Xie, Hong Liu", "id": "2412.12650v1", "paper_url": "http://arxiv.org/abs/2412.12650v1", "repo": "null"}}