{"2406.06618": {"publish_time": "2024-06-07", "title": "PANDORA: Deep graph learning based COVID-19 infection risk level forecasting", "paper_summary": "COVID-19 as a global pandemic causes a massive disruption to social stability\nthat threatens human life and the economy. Policymakers and all elements of\nsociety must deliver measurable actions based on the pandemic's severity to\nminimize the detrimental impact of COVID-19. A proper forecasting system is\narguably important to provide an early signal of the risk of COVID-19 infection\nso that the authorities are ready to protect the people from the worst.\nHowever, making a good forecasting model for infection risks in different\ncities or regions is not an easy task, because it has a lot of influential\nfactors that are difficult to be identified manually. To address the current\nlimitations, we propose a deep graph learning model, called PANDORA, to predict\nthe infection risks of COVID-19, by considering all essential factors and\nintegrating them into a geographical network. The framework uses geographical\nposition relations and transportation frequency as higher-order structural\nproperties formulated by higher-order network structures (i.e., network\nmotifs). Moreover, four significant node attributes (i.e., multiple features of\na particular area, including climate, medical condition, economy, and human\nmobility) are also considered. We propose three different aggregators to better\naggregate node attributes and structural features, namely, Hadamard, Summation,\nand Connection. Experimental results over real data show that PANDORA\noutperforms the baseline method with higher accuracy and faster convergence\nspeed, no matter which aggregator is chosen. We believe that PANDORA using deep\ngraph learning provides a promising approach to get superior performance in\ninfection risk level forecasting and help humans battle the COVID-19 crisis.", "paper_summary_zh": "COVID-19 作為全球大流行病對社會穩定造成大規模的破壞，威脅到人類生命和經濟。政策制定者和社會各階層必須根據疫情的嚴重程度採取可衡量的行動，以將 COVID-19 的不利影響降到最低。一個適當的預測系統無疑對於提供 COVID-19 感染風險的早期信號非常重要，以便當局做好準備保護人民免於最壞的狀況。然而，為不同城市或地區的感染風險建立一個良好的預測模型並非易事，因為它有許多影響因素，難以人工識別。為了解決目前的局限性，我們提出了一個名為 PANDORA 的深度圖學習模型，通過考慮所有必要因素並將它們整合到一個地理網路中，來預測 COVID-19 的感染風險。該框架使用地理位置關係和運輸頻率作為由高階網路結構（即網路主題）制定的高階結構屬性。此外，還考慮了四個重要的節點屬性（即特定區域的氣候、醫療條件、經濟和人類流動性等多種特徵）。我們提出了三個不同的聚合器來更好地聚合節點屬性和結構特徵，即 Hadamard、Summation 和 Connection。在真實資料上的實驗結果表明，無論選擇哪個聚合器，PANDORA 都以更高的準確性和更快的收斂速度優於基線方法。我們相信使用深度圖學習的 PANDORA 提供了一種有前景的方法，可以在感染風險等級預測中獲得卓越的性能，並幫助人類戰勝 COVID-19 危機。", "author": "Shuo Yu et.al.", "authors": "Shuo Yu, Feng Xia, Yueru Wang, Shihao Li, Falih Febrinanto, Madhu Chetty", "id": "2406.06618v1", "paper_url": "http://arxiv.org/abs/2406.06618v1", "repo": "null"}}