{"2408.06752": {"publish_time": "2024-08-13", "title": "Evaluating Research Quality with Large Language Models: An Analysis of ChatGPT's Effectiveness with Different Settings and Inputs", "paper_summary": "Evaluating the quality of academic journal articles is a time consuming but\ncritical task for national research evaluation exercises, appointments and\npromotion. It is therefore important to investigate whether Large Language\nModels (LLMs) can play a role in this process. This article assesses which\nChatGPT inputs (full text without tables, figures and references; title and\nabstract; title only) produce better quality score estimates, and the extent to\nwhich scores are affected by ChatGPT models and system prompts. The results\nshow that the optimal input is the article title and abstract, with average\nChatGPT scores based on these (30 iterations on a dataset of 51 papers)\ncorrelating at 0.67 with human scores, the highest ever reported. ChatGPT 4o is\nslightly better than 3.5-turbo (0.66), and 4o-mini (0.66). The results suggest\nthat article full texts might confuse LLM research quality evaluations, even\nthough complex system instructions for the task are more effective than simple\nones. Thus, whilst abstracts contain insufficient information for a thorough\nassessment of rigour, they may contain strong pointers about originality and\nsignificance. Finally, linear regression can be used to convert the model\nscores into the human scale scores, which is 31% more accurate than guessing.", "paper_summary_zh": "評估學術期刊文章的品質是一項耗時但至關重要的任務，用於國家研究評鑑、任命和晉升。因此，探討大型語言模型 (LLM) 是否能在這個過程中發揮作用非常重要。本文評估了哪些 ChatGPT 輸入（沒有表格、圖表和參考文獻的全文；標題和摘要；僅標題）能產生品質更好的評分估計，以及 ChatGPT 模型和系統提示影響評分的程度。結果顯示，最佳輸入是文章標題和摘要，根據這些輸入的平均 ChatGPT 評分（對 51 篇論文的資料集進行 30 次反覆運算）與人工評分相關性為 0.67，是歷來報告過的最高分。ChatGPT 4o 略優於 3.5-turbo（0.66）和 4o-mini（0.66）。結果顯示，儘管針對此任務的複雜系統指令比簡單指令更有效，但文章全文可能會混淆 LLM 研究品質評估。因此，儘管摘要包含的資訊不足以進行徹底的嚴謹性評估，但它們可能包含關於原創性和重要性的有力指標。最後，線性迴歸可被用於將模型評分轉換為人工評分，其準確度比猜測高出 31%。", "author": "Mike Thelwall et.al.", "authors": "Mike Thelwall", "id": "2408.06752v1", "paper_url": "http://arxiv.org/abs/2408.06752v1", "repo": "null"}}