{"2305.10201": {"publish_time": "2023-05-17", "title": "Echoes of Biases: How Stigmatizing Language Affects AI Performance", "paper_summary": "Electronic health records (EHRs) serve as an essential data source for the\nenvisioned artificial intelligence (AI)-driven transformation in healthcare.\nHowever, clinician biases reflected in EHR notes can lead to AI models\ninheriting and amplifying these biases, perpetuating health disparities. This\nstudy investigates the impact of stigmatizing language (SL) in EHR notes on\nmortality prediction using a Transformer-based deep learning model and\nexplainable AI (XAI) techniques. Our findings demonstrate that SL written by\nclinicians adversely affects AI performance, particularly so for black\npatients, highlighting SL as a source of racial disparity in AI model\ndevelopment. To explore an operationally efficient way to mitigate SL's impact,\nwe investigate patterns in the generation of SL through a clinicians'\ncollaborative network, identifying central clinicians as having a stronger\nimpact on racial disparity in the AI model. We find that removing SL written by\ncentral clinicians is a more efficient bias reduction strategy than eliminating\nall SL in the entire corpus of data. This study provides actionable insights\nfor responsible AI development and contributes to understanding clinician\nbehavior and EHR note writing in healthcare.", "paper_summary_zh": "電子健康紀錄 (EHR) 作為預想中由人工智慧 (AI) 推動的醫療保健轉型的重要資料來源。然而，反映在 EHR 備註中的臨床偏見可能導致 AI 模型繼承並擴大這些偏見，進而造成健康差異。本研究探討 EHR 備註中汙名化語言 (SL) 對使用基於 Transformer 的深度學習模型和可解釋 AI (XAI) 技術預測死亡率的影響。我們的研究結果表明，由臨床醫生撰寫的 SL 會對 AI 效能產生不利影響，特別是對黑人患者而言，突顯 SL 是 AI 模型開發中種族差異的來源。為了探索一種運作上有效率的方法來減輕 SL 的影響，我們透過臨床醫生的協作網路探討 SL 產生的模式，並找出核心臨床醫生對 AI 模型中的種族差異有較大的影響。我們發現，移除由核心臨床醫生撰寫的 SL 是比消除資料集中所有 SL 更有效率的偏見減少策略。本研究提供可行的見解，用於負責任的 AI 開發，並有助於了解臨床醫生行為和醫療保健中的 EHR 備註撰寫。", "author": "Yizhi Liu et.al.", "authors": "Yizhi Liu, Weiguang Wang, Guodong Gordon Gao, Ritu Agarwal", "id": "2305.10201v4", "paper_url": "http://arxiv.org/abs/2305.10201v4", "repo": "null"}}