{"2405.20519": {"publish_time": "2024-05-30", "title": "Diffusion On Syntax Trees For Program Synthesis", "paper_summary": "Large language models generate code one token at a time. Their autoregressive\ngeneration process lacks the feedback of observing the program's output.\nTraining LLMs to suggest edits directly can be challenging due to the scarcity\nof rich edit data. To address these problems, we propose neural diffusion\nmodels that operate on syntax trees of any context-free grammar. Similar to\nimage diffusion models, our method also inverts ``noise'' applied to syntax\ntrees. Rather than generating code sequentially, we iteratively edit it while\npreserving syntactic validity, which makes it easy to combine this neural model\nwith search. We apply our approach to inverse graphics tasks, where our model\nlearns to convert images into programs that produce those images. Combined with\nsearch, our model is able to write graphics programs, see the execution result,\nand debug them to meet the required specifications. We additionally show how\nour system can write graphics programs for hand-drawn sketches.", "paper_summary_zh": "大型語言模型一次只產生一個代碼符號。它們的自動迴歸生成過程缺乏觀察程式輸出回饋。由於豐富的編輯資料稀少，訓練 LLM 直接建議編輯可能會具有挑戰性。為了解決這些問題，我們提出神經擴散模型，它在任何無脈絡語法的語法樹上運作。與影像擴散模型類似，我們的模型也會對應用於語法樹的「雜訊」進行反轉。我們不是循序漸進地產生程式碼，而是反覆編輯它，同時保持語法有效性，這使得將這個神經模型與搜尋結合變得容易。我們將我們的做法應用於反向圖形任務，我們的模型學習將影像轉換為產生那些影像的程式。結合搜尋，我們的模型能夠撰寫圖形程式，查看執行結果，並除錯它們以符合所需的規格。我們另外展示我們的系統如何為手繪草圖撰寫圖形程式。", "author": "Shreyas Kapur et.al.", "authors": "Shreyas Kapur, Erik Jenner, Stuart Russell", "id": "2405.20519v1", "paper_url": "http://arxiv.org/abs/2405.20519v1", "repo": "null"}}