{"2409.03650": {"publish_time": "2024-09-05", "title": "On the Limited Generalization Capability of the Implicit Reward Model Induced by Direct Preference Optimization", "paper_summary": "Reinforcement Learning from Human Feedback (RLHF) is an effective approach\nfor aligning language models to human preferences. Central to RLHF is learning\na reward function for scoring human preferences. Two main approaches for\nlearning a reward model are 1) training an EXplicit Reward Model (EXRM) as in\nRLHF, and 2) using an implicit reward learned from preference data through\nmethods such as Direct Preference Optimization (DPO). Prior work has shown that\nthe implicit reward model of DPO (denoted as DPORM) can approximate an EXRM in\nthe limit. DPORM's effectiveness directly implies the optimality of the learned\npolicy, and also has practical implication for LLM alignment methods including\niterative DPO. However, it is unclear how well DPORM empirically matches the\nperformance of EXRM. This work studies the accuracy at distinguishing preferred\nand rejected answers for both DPORM and EXRM. Our findings indicate that even\nthough DPORM fits the training dataset comparably, it generalizes less\neffectively than EXRM, especially when the validation datasets contain\ndistribution shifts. Across five out-of-distribution settings, DPORM has a mean\ndrop in accuracy of 3% and a maximum drop of 7%. These findings highlight that\nDPORM has limited generalization ability and substantiates the integration of\nan explicit reward model in iterative DPO approaches.", "paper_summary_zh": "人類回饋強化學習 (RLHF) 是一種有效的方法，可以將語言模型調整到人類偏好。RLHF 的核心是學習一個獎勵函數來評分人類偏好。學習獎勵模型的兩種主要方法為 1) 訓練一個明確獎勵模型 (EXRM)，如同 RLHF 中，2) 使用從偏好數據中學習到的隱含獎勵，透過直接偏好最佳化 (DPO) 等方法。先前的研究顯示，DPO 的隱含獎勵模型 (表示為 DPORM) 可在極限中近似 EXRM。DPORM 的效能直接暗示學習到的政策的最佳性，且對 LLM 調整方法（包括反覆 DPO）也有實際的意義。然而，尚不清楚 DPORM 在經驗上有多符合 EXRM 的效能。本研究探討區分 DPORM 和 EXRM 的偏好和拒絕答案的準確性。我們的發現顯示，儘管 DPORM 符合訓練資料集的程度相當，但其泛化效果不如 EXRM，特別是在驗證資料集包含分配轉移時。在五個非分配設定中，DPORM 的準確性平均下降 3%，最大下降 7%。這些發現強調 DPORM 的泛化能力有限，並證實了在反覆 DPO 方法中整合明確獎勵模型。", "author": "Yong Lin et.al.", "authors": "Yong Lin, Skyler Seto, Maartje ter Hoeve, Katherine Metcalf, Barry-John Theobald, Xuan Wang, Yizhe Zhang, Chen Huang, Tong Zhang", "id": "2409.03650v1", "paper_url": "http://arxiv.org/abs/2409.03650v1", "repo": "null"}}