{"2412.10151": {"publish_time": "2024-12-13", "title": "VLR-Bench: Multilingual Benchmark Dataset for Vision-Language Retrieval Augmented Generation", "paper_summary": "We propose the VLR-Bench, a visual question answering (VQA) benchmark for\nevaluating vision language models (VLMs) based on retrieval augmented\ngeneration (RAG). Unlike existing evaluation datasets for external\nknowledge-based VQA, the proposed VLR-Bench includes five input passages. This\nallows testing of the ability to determine which passage is useful for\nanswering a given query, a capability lacking in previous research. In this\ncontext, we constructed a dataset of 32,000 automatically generated\ninstruction-following examples, which we denote as VLR-IF. This dataset is\nspecifically designed to enhance the RAG capabilities of VLMs by enabling them\nto learn how to generate appropriate answers based on input passages. We\nevaluated the validity of the proposed benchmark and training data and verified\nits performance using the state-of-the-art Llama3-based VLM, the Llava-Llama-3\nmodel. The proposed VLR-Bench and VLR-IF datasets are publicly available\nonline.", "paper_summary_zh": "我們提出 VLR-Bench，一種視覺問答 (VQA) 基準，用於根據檢索增強生成 (RAG) 評估視覺語言模型 (VLM)。與現有外部知識庫 VQA 評估資料集不同，所提出的 VLR-Bench 包含五個輸入段落。這允許測試確定哪個段落有助於回答特定查詢的能力，這項功能在先前的研究中有所欠缺。在此背景下，我們建構了一個資料集，包含 32,000 個自動產生的遵循指令範例，我們將其表示為 VLR-IF。此資料集特別設計用於增強 VLM 的 RAG 功能，讓它們能夠學習如何根據輸入段落產生適當的答案。我們評估了所提出的基準和訓練資料的有效性，並使用最先進的基於 Llama3 的 VLM，即 Llava-Llama-3 模型，驗證其效能。所提出的 VLR-Bench 和 VLR-IF 資料集已公開在線上。", "author": "Hyeonseok Lim et.al.", "authors": "Hyeonseok Lim, Dongjae Shin, Seohyun Song, Inho Won, Minjun Kim, Junghun Yuk, Haneol Jang, KyungTae Lim", "id": "2412.10151v1", "paper_url": "http://arxiv.org/abs/2412.10151v1", "repo": "null"}}