{"2501.14315": {"publish_time": "2025-01-24", "title": "Clear Minds Think Alike: What Makes LLM Fine-tuning Robust? A Study of Token Perplexity", "paper_summary": "Maintaining consistent model performance across domains is a fundamental\nchallenge in machine learning. While recent work has explored using\nLLM-generated data for fine-tuning, its impact on cross-domain generalization\nremains poorly understood. In this paper, we present a systematic analysis\nrevealing that fine-tuning with LLM-generated data not only improves target\ntask performance but also reduces out-of-domain (OOD) degradation compared to\nfine-tuning with ground truth data. Through analyzing the data sequence in\ntasks of various domains, we demonstrate that this enhanced OOD robustness\nstems from a reduced prevalence of high perplexity tokens in LLM-generated\nsequences. Following this hypothesis we showed that masking high perplexity\ntokens in ground truth training data also achieves similar OOD preservation\ncomparable to using LLM-generated data. Extensive experiments across diverse\nmodel architectures and scales, including Gemma2-2B, Mistral-7B and Llama3-8B,\ncorroborate the consistency of our findings. To the best of our knowledge, this\nwork provides the first mechanistic explanation for the superior OOD robustness\nconferred by LLM-generated training data, offering valuable insights for\ndeveloping more robust fine-tuning strategies.", "paper_summary_zh": "在機器學習中，維持模型在不同領域中的一致效能是一項基本的挑戰。雖然最近的研究探討了使用 LLM 生成的資料進行微調，但它對跨領域泛化的影響仍然知之甚少。在本文中，我們提出一個系統性的分析，揭示使用 LLM 生成的資料進行微調不僅可以改善目標任務的效能，而且與使用真實資料進行微調相比，還能減少領域外 (OOD) 的退化。透過分析不同領域任務中的資料序列，我們證明了這種增強的 OOD 穩健性源於 LLM 生成的序列中高困惑度標記的發生率降低。根據這個假設，我們表明在真實訓練資料中遮蔽高困惑度標記也可以實現與使用 LLM 生成的資料相似的 OOD 保留。在包括 Gemma2-2B、Mistral-7B 和 Llama3-8B 在內的各種模型架構和規模中進行的廣泛實驗，證實了我們發現的一致性。據我們所知，這項工作首次提供了 LLM 生成的訓練資料賦予的優異 OOD 穩健性的機制解釋，為開發更穩健的微調策略提供了寶貴的見解。", "author": "Chao-Chung Wu et.al.", "authors": "Chao-Chung Wu, Zhi Rui Tam, Chieh-Yen Lin, Hung-yi Lee, Yun-Nung Chen", "id": "2501.14315v1", "paper_url": "http://arxiv.org/abs/2501.14315v1", "repo": "null"}}