{"2408.12598": {"publish_time": "2024-08-22", "title": "ND-SDF: Learning Normal Deflection Fields for High-Fidelity Indoor Reconstruction", "paper_summary": "Neural implicit reconstruction via volume rendering has demonstrated its\neffectiveness in recovering dense 3D surfaces. However, it is non-trivial to\nsimultaneously recover meticulous geometry and preserve smoothness across\nregions with differing characteristics. To address this issue, previous methods\ntypically employ geometric priors, which are often constrained by the\nperformance of the prior models. In this paper, we propose ND-SDF, which learns\na Normal Ddeflection field to represent the angular deviation between the scene\nnormal and the prior normal. Unlike previous methods that uniformly apply\ngeometric priors on all samples, introducing significant bias in accuracy, our\nproposed normal deflection field dynamically learns and adapts the utilization\nof samples based on their specific characteristics, thereby improving both the\naccuracy and effectiveness of the model. Our method not only obtains smooth\nweakly textured regions such as walls and floors but also preserves the\ngeometric details of complex structures. In addition, we introduce a novel ray\nsampling strategy based on the deflection angle to facilitate the unbiased\nrendering process, which significantly improves the quality and accuracy of\nintricate surfaces, especially on thin structures. Consistent improvements on\nvarious challenging datasets demonstrate the superiority of our method.", "paper_summary_zh": "神經隱式重建經由體積渲染已證實其在恢復密集 3D 表面上的效能。然而，要同時恢復細緻的幾何結構並在具有不同特徵的區域中保持平滑度並非易事。為了解決此問題，先前的做法通常採用幾何先驗，這些先驗通常受到先驗模型效能的限制。在本文中，我們提出了 ND-SDF，它學習一個法向量偏移場，以表示場景法向量與先驗法向量之間的角度偏差。與先前在所有範例中均一地套用幾何先驗的方法不同，我們的法向量偏移場會根據範例的特定特徵動態地學習並調整範例的使用，從而提升模型的準確度和效能。我們的做法不僅能獲得平滑的弱紋理區域（例如牆壁和地板），還能保留複雜結構的幾何細節。此外，我們引進了一種基於偏移角的新型光線取樣策略，以利於無偏渲染程序，這顯著提升了複雜表面的品質和準確度，特別是在薄結構上。在各種具有挑戰性的資料集上的一致改進證明了我們方法的優越性。", "author": "Ziyu Tang et.al.", "authors": "Ziyu Tang, Weicai Ye, Yifan Wang, Di Huang, Hujun Bao, Tong He, Guofeng Zhang", "id": "2408.12598v1", "paper_url": "http://arxiv.org/abs/2408.12598v1", "repo": "null"}}