{"2409.18364": {"publish_time": "2024-09-27", "title": "Multi-hypotheses Conditioned Point Cloud Diffusion for 3D Human Reconstruction from Occluded Images", "paper_summary": "3D human shape reconstruction under severe occlusion due to human-object or\nhuman-human interaction is a challenging problem. Parametric models i.e.,\nSMPL(-X), which are based on the statistics across human shapes, can represent\nwhole human body shapes but are limited to minimally-clothed human shapes.\nImplicit-function-based methods extract features from the parametric models to\nemploy prior knowledge of human bodies and can capture geometric details such\nas clothing and hair. However, they often struggle to handle misaligned\nparametric models and inpaint occluded regions given a single RGB image. In\nthis work, we propose a novel pipeline, MHCDIFF, Multi-hypotheses Conditioned\nPoint Cloud Diffusion, composed of point cloud diffusion conditioned on\nprobabilistic distributions for pixel-aligned detailed 3D human reconstruction\nunder occlusion. Compared to previous implicit-function-based methods, the\npoint cloud diffusion model can capture the global consistent features to\ngenerate the occluded regions, and the denoising process corrects the\nmisaligned SMPL meshes. The core of MHCDIFF is extracting local features from\nmultiple hypothesized SMPL(-X) meshes and aggregating the set of features to\ncondition the diffusion model. In the experiments on CAPE and MultiHuman\ndatasets, the proposed method outperforms various SOTA methods based on SMPL,\nimplicit functions, point cloud diffusion, and their combined, under synthetic\nand real occlusions.", "paper_summary_zh": "由於人體與物體或人體與人體的交互作用導致嚴重的遮擋，3D 人體形狀重建是一個具有挑戰性的問題。基於人體形狀統計資料的參數模型，例如 SMPL(-X)，可以表示完整的人體形狀，但僅限於穿著最少衣物的的人體形狀。基於隱式函數的方法從參數模型中提取特徵，以運用人體的先驗知識，並可以捕捉幾何細節，例如衣物和頭髮。然而，它們通常難以處理未對齊的參數模型，並在給定單一 RGB 影像的情況下填補被遮擋的區域。在這項工作中，我們提出了一個新穎的管道，即 MHCDIFF，多假設條件點雲擴散，它由條件化於像素對齊的詳細 3D 人體重建的機率分佈的點雲擴散組成。與先前的基於隱式函數的方法相比，點雲擴散模型可以捕捉全局一致的特徵以生成被遮擋的區域，而去雜訊程序會修正未對齊的 SMPL 網格。MHCDIFF 的核心是從多個假設的 SMPL(-X) 網格中提取局部特徵，並聚合特徵集合以調整擴散模型。在 CAPE 和 MultiHuman 資料集上的實驗中，所提出的方法優於各種基於 SMPL、隱式函數、點雲擴散及其組合的 SOTA 方法，在合成和真實遮擋下皆是如此。", "author": "Donghwan Kim et.al.", "authors": "Donghwan Kim, Tae-Kyun Kim", "id": "2409.18364v1", "paper_url": "http://arxiv.org/abs/2409.18364v1", "repo": "null"}}