{"2411.11616": {"publish_time": "2024-11-18", "title": "Signaling and Social Learning in Swarms of Robots", "paper_summary": "This paper investigates the role of communication in improving coordination\nwithin robot swarms, focusing on a paradigm where learning and execution occur\nsimultaneously in a decentralized manner. We highlight the role communication\ncan play in addressing the credit assignment problem (individual contribution\nto the overall performance), and how it can be influenced by it. We propose a\ntaxonomy of existing and future works on communication, focusing on information\nselection and physical abstraction as principal axes for classification: from\nlow-level lossless compression with raw signal extraction and processing to\nhigh-level lossy compression with structured communication models. The paper\nreviews current research from evolutionary robotics, multi-agent (deep)\nreinforcement learning, language models, and biophysics models to outline the\nchallenges and opportunities of communication in a collective of robots that\ncontinuously learn from one another through local message exchanges,\nillustrating a form of social learning.", "paper_summary_zh": "本文探討了通訊在改善機器人蜂群協調中的角色，重點在於一種典範，其中學習和執行以分散的方式同時發生。我們強調了通訊在解決信用分配問題（對整體效能的個別貢獻）中所扮演的角色，以及它如何受到影響。我們提出了現有和未來通訊工作的分類法，重點在於將資訊選擇和物理抽象作為分類的主要軸線：從具有原始訊號提取和處理的低階無失真壓縮到具有結構化通訊模型的高階有失真壓縮。本文回顧了演化機器人、多重代理（深度）強化學習、語言模型和生物物理模型的現行研究，以概述一群機器人透過局部訊息交換持續彼此學習的通訊挑戰和機會，說明了一種社會學習的形式。", "author": "Leo Cazenille et.al.", "authors": "Leo Cazenille, Maxime Toquebiau, Nicolas Lobato-Dauzier, Alessia Loi, Loona Macabre, Nathanael Aubert-Kato, Anthony Genot, Nicolas Bredeche", "id": "2411.11616v1", "paper_url": "http://arxiv.org/abs/2411.11616v1", "repo": "null"}}