{"2406.18022": {"publish_time": "2024-06-26", "title": "AutoOPE: Automated Off-Policy Estimator Selection", "paper_summary": "The Off-Policy Evaluation (OPE) problem consists of evaluating the\nperformance of counterfactual policies with data collected by another one. This\nproblem is of utmost importance for various application domains, e.g.,\nrecommendation systems, medical treatments, and many others. To solve the OPE\nproblem, we resort to estimators, which aim to estimate in the most accurate\nway possible the performance that the counterfactual policies would have had if\nthey were deployed in place of the logging policy. In the literature, several\nestimators have been developed, all with different characteristics and\ntheoretical guarantees. Therefore, there is no dominant estimator, and each\nestimator may be the best one for different OPE problems, depending on the\ncharacteristics of the dataset at hand. While the selection of the estimator is\na crucial choice for an accurate OPE, this problem has been widely overlooked\nin the literature. We propose an automated data-driven OPE estimator selection\nmethod based on machine learning. In particular, the core idea we propose in\nthis paper is to create several synthetic OPE tasks and use a machine learning\nmodel trained to predict the best estimator for those synthetic tasks. We\nempirically show how our method is able to generalize to unseen tasks and make\na better estimator selection compared to a baseline method on several\nreal-world datasets, with a computational cost significantly lower than the one\nof the baseline.", "paper_summary_zh": "離線策略評估 (OPE) 問題包含使用由其他政策收集的資料評估反事實政策的效能。此問題對於各種應用領域至關重要，例如推薦系統、醫療治療等。為了解決 OPE 問題，我們求助於估計器，其目標是以最精確的方式估計反事實政策在部署於記錄政策時所具備的效能。在文獻中，已經開發出多個估計器，每個估計器都具有不同的特性和理論保證。因此，沒有主導估計器，每個估計器可能是不同 OPE 問題的最佳估計器，具體取決於手邊資料集的特徵。雖然估計器的選擇對於準確的 OPE 至關重要，但這個問題在文獻中已被廣泛忽視。我們提出一個基於機器學習的自動化資料驅動 OPE 估計器選擇方法。特別是，我們在這篇論文中提出的核心概念是建立幾個合成 OPE 任務，並使用機器學習模型訓練來預測這些合成任務的最佳估計器。我們以實證方式說明我們的模型如何能夠概化為未見任務，並在幾個真實世界資料集上與基線方法相比，做出更好的估計器選擇，且運算成本遠低於基線方法。", "author": "Nicolò Felicioni et.al.", "authors": "Nicolò Felicioni, Michael Benigni, Maurizio Ferrari Dacrema", "id": "2406.18022v1", "paper_url": "http://arxiv.org/abs/2406.18022v1", "repo": "null"}}