{"2410.14251": {"publish_time": "2024-10-18", "title": "Synthesizing Post-Training Data for LLMs through Multi-Agent Simulation", "paper_summary": "Post-training is essential for enabling large language models (LLMs) to\nfollow human instructions. Inspired by the recent success of using LLMs to\nsimulate human society, we leverage multi-agent simulation to automatically\ngenerate diverse text-based scenarios, capturing a wide range of real-world\nhuman needs. We propose MATRIX, a multi-agent simulator that creates realistic\nand scalable scenarios. Leveraging these outputs, we introduce a novel\nscenario-driven instruction generator MATRIX-Gen for controllable and highly\nrealistic data synthesis. Extensive experiments demonstrate that our framework\neffectively generates both general and domain-specific data. Notably, on\nAlpacaEval 2 and Arena-Hard benchmarks, Llama-3-8B-Base, post-trained on\ndatasets synthesized by MATRIX-Gen with just 20K instruction-response pairs,\noutperforms Meta's Llama-3-8B-Instruct model, which was trained on over 10M\npairs; see our project at https://github.com/ShuoTang123/MATRIX-Gen.", "paper_summary_zh": "訓練後對於大型語言模型 (LLM) 來說非常重要，可以讓它們遵循人類的指示。受到最近使用 LLM 模擬人類社會的成功啟發，我們利用多重代理模擬自動產生多樣化的基於文字的場景，捕捉廣泛的真實世界人類需求。我們建議使用 MATRIX，一種多重代理模擬器，可以建立寫實且具備擴充性的場景。利用這些輸出，我們介紹一個新的場景驅動式指示產生器 MATRIX-Gen，用於可控且高度寫實的資料合成。廣泛的實驗證明我們的架構有效地產生一般性和特定領域的資料。特別是在 AlpacaEval 2 和 Arena-Hard 基準上，Llama-3-8B-Base 僅使用 20K 指示回應對，在 MATRIX-Gen 合成的資料集上進行後續訓練，其效能優於 Meta 的 Llama-3-8B-Instruct 模型，而後者是在超過 10M 對上進行訓練；請參閱我們的專案 https://github.com/ShuoTang123/MATRIX-Gen。", "author": "Shuo Tang et.al.", "authors": "Shuo Tang, Xianghe Pang, Zexi Liu, Bohan Tang, Rui Ye, Xiaowen Dong, Yanfeng Wang, Siheng Chen", "id": "2410.14251v1", "paper_url": "http://arxiv.org/abs/2410.14251v1", "repo": "null"}}