{"2406.18934": {"publish_time": "2024-06-27", "title": "The single-use restriction for register automata and transducers over infinite alphabets", "paper_summary": "This thesis studies the single-use restriction for register automata and\ntransducers over infinite alphabets. The restriction requires that a\nread-access to a register should have the side effect of destroying its\ncontents. This constraint results in robust classes of languages and\ntransductions. For automata models, we show that one-way register automata,\ntwo-way register automata, and orbit-finite monoids have the same expressive\npower. For transducer models, we show that single-use Mealy machines and\nsingle-use two-way transducers admit versions of the Krohn-Rhodes decomposition\ntheorem. Moreover, single-use Mealy machines are equivalent to an algebraic\nmodel called local algebraic semigroup transductions. Additionally, we show\nthat single-use two-way transducers are equivalent to single-use streaming\nstring transducers (SSTs) over infinite alphabets and to regular list functions\nwith atoms.\n  Compared with the previous work arXiv:1907.10504, this thesis offers a\ncoherent narrative on the single-use restriction. We introduce an abstract\nnotion of single-use functions and use them to define all the discussed\nsingle-use models. We also introduce and study the algebraic models of local\nsemigroup transduction and local rational semigroup transduction.", "paper_summary_zh": "本論文探討了無限字母表上註冊自動機和轉換器的單次使用限制。此限制要求對註冊器的讀取存取應具有銷毀其內容的副作用。此限制會產生強健的語言和轉換類別。對於自動機模型，我們證明了單向註冊自動機、雙向註冊自動機和軌道有限單元具有相同的表達能力。對於轉換器模型，我們證明了單次使用 Mealy 機器和單次使用雙向轉換器允許使用 Krohn-Rhodes 分解定理。此外，單次使用 Mealy 機器等於稱為局部代數半群轉換的代數模型。此外，我們證明了單次使用雙向轉換器等於無限字母表上的單次使用串流字串轉換器 (SST) 和具有原子的正則清單函數。\n與前一篇論文 arXiv:1907.10504 相比，本論文提供了關於單次使用限制的連貫敘述。我們引入了單次使用函數的抽象概念，並使用它們來定義所有討論過的單次使用模型。我們還介紹並研究了局部半群轉換和局部有理半群轉換的代數模型。", "author": "Rafał Stefański et.al.", "authors": "Rafał Stefański", "id": "2406.18934v1", "paper_url": "http://arxiv.org/abs/2406.18934v1", "repo": "null"}}