{"2410.11403": {"publish_time": "2024-10-15", "title": "Enhancing Unimodal Latent Representations in Multimodal VAEs through Iterative Amortized Inference", "paper_summary": "Multimodal variational autoencoders (VAEs) aim to capture shared latent\nrepresentations by integrating information from different data modalities. A\nsignificant challenge is accurately inferring representations from any subset\nof modalities without training an impractical number (2^M) of inference\nnetworks for all possible modality combinations. Mixture-based models simplify\nthis by requiring only as many inference models as there are modalities,\naggregating unimodal inferences. However, they suffer from information loss\nwhen modalities are missing. Alignment-based VAEs address this by aligning\nunimodal inference models with a multimodal model through minimizing the\nKullback-Leibler (KL) divergence but face issues due to amortization gaps,\nwhich compromise inference accuracy. To tackle these problems, we introduce\nmultimodal iterative amortized inference, an iterative refinement mechanism\nwithin the multimodal VAE framework. This method overcomes information loss\nfrom missing modalities and minimizes the amortization gap by iteratively\nrefining the multimodal inference using all available modalities. By aligning\nunimodal inference to this refined multimodal posterior, we achieve unimodal\ninferences that effectively incorporate multimodal information while requiring\nonly unimodal inputs during inference. Experiments on benchmark datasets show\nthat our approach improves inference performance, evidenced by higher linear\nclassification accuracy and competitive cosine similarity, and enhances\ncross-modal generation, indicated by lower FID scores. This demonstrates that\nour method enhances inferred representations from unimodal inputs.", "paper_summary_zh": "多模態變異自動編碼器 (VAE) 旨在透過整合來自不同資料模態的資訊來擷取共享潛在表示。一個重大的挑戰是準確推論來自任何模態子集的表示，而不用為所有可能的模態組合訓練不切實際數量的 (2^M) 推論網路。基於混合的模型透過只需要與模態一樣多的推論模型來簡化這項工作，並彙總單模態推論。然而，當模態遺失時，它們會遭受資訊遺失的問題。基於對齊的 VAE 透過最小化 Kullback-Leibler (KL) 差異來將單模態推論模型與多模態模型對齊，以解決這個問題，但會因為攤銷差距而面臨問題，這會影響推論準確性。為了解決這些問題，我們引入了多模態反覆攤銷推論，這是一種多模態 VAE 架構內的反覆精煉機制。此方法克服了遺失模態的資訊遺失，並透過反覆使用所有可用模態精煉多模態推論來最小化攤銷差距。透過將單模態推論與這個精煉的多模態後驗對齊，我們達到了單模態推論，有效地納入了多模態資訊，同時在推論期間只需要單模態輸入。在基準資料集上的實驗顯示，我們的做法改善了推論效能，這由更高的線性分類準確度和有競爭力的餘弦相似性證明，並增強了跨模態生成，這由較低的 FID 分數表示。這證明了我們的做法增強了從單模態輸入推論的表示。", "author": "Yuta Oshima et.al.", "authors": "Yuta Oshima, Masahiro Suzuki, Yutaka Matsuo", "id": "2410.11403v1", "paper_url": "http://arxiv.org/abs/2410.11403v1", "repo": "null"}}