{"2406.11568": {"publish_time": "2024-06-17", "title": "Towards an End-to-End Framework for Invasive Brain Signal Decoding with Large Language Models", "paper_summary": "In this paper, we introduce a groundbreaking end-to-end (E2E) framework for\ndecoding invasive brain signals, marking a significant advancement in the field\nof speech neuroprosthesis. Our methodology leverages the comprehensive\nreasoning abilities of large language models (LLMs) to facilitate direct\ndecoding. By fully integrating LLMs, we achieve results comparable to the\nstate-of-the-art cascade models. Our findings underscore the immense potential\nof E2E frameworks in speech neuroprosthesis, particularly as the technology\nbehind brain-computer interfaces (BCIs) and the availability of relevant\ndatasets continue to evolve. This work not only showcases the efficacy of\ncombining LLMs with E2E decoding for enhancing speech neuroprosthesis but also\nsets a new direction for future research in BCI applications, underscoring the\nimpact of LLMs in decoding complex neural signals for communication\nrestoration. Code will be made available at\nhttps://github.com/FsFrancis15/BrainLLM.", "paper_summary_zh": "在本文中，我們介紹了一個突破性的端到端 (E2E) 框架，用於解碼侵入性腦信號，標誌著語音神經假體領域的重大進展。我們的技術利用大型語言模型 (LLM) 的全面推理能力，以促進直接解碼。通過完全整合 LLM，我們取得了與最先進的串聯模型相當的結果。我們的研究結果強調了 E2E 框架在語音神經假體中的巨大潛力，特別是隨著腦機介面 (BCI) 技術和相關資料集可用性的持續發展。這項工作不僅展示了將 LLM 與 E2E 解碼相結合以增強語音神經假體的功效，而且也為 BCI 應用中的未來研究設定了一個新方向，強調了 LLM 在解碼複雜神經信號以恢復溝通方面的影響力。程式碼將在 https://github.com/FsFrancis15/BrainLLM 上提供。", "author": "Sheng Feng et.al.", "authors": "Sheng Feng, Heyang Liu, Yu Wang, Yanfeng Wang", "id": "2406.11568v1", "paper_url": "http://arxiv.org/abs/2406.11568v1", "repo": "https://github.com/fsfrancis15/brainllm"}}