{"2411.10957": {"publish_time": "2024-11-17", "title": "IMPaCT GNN: Imposing invariance with Message Passing in Chronological split Temporal Graphs", "paper_summary": "This paper addresses domain adaptation challenges in graph data resulting\nfrom chronological splits. In a transductive graph learning setting, where each\nnode is associated with a timestamp, we focus on the task of Semi-Supervised\nNode Classification (SSNC), aiming to classify recent nodes using labels of\npast nodes. Temporal dependencies in node connections create domain shifts,\ncausing significant performance degradation when applying models trained on\nhistorical data into recent data. Given the practical relevance of this\nscenario, addressing domain adaptation in chronological split data is crucial,\nyet underexplored. We propose Imposing invariance with Message Passing in\nChronological split Temporal Graphs (IMPaCT), a method that imposes invariant\nproperties based on realistic assumptions derived from temporal graph\nstructures. Unlike traditional domain adaptation approaches which rely on\nunverifiable assumptions, IMPaCT explicitly accounts for the characteristics of\nchronological splits. The IMPaCT is further supported by rigorous mathematical\nanalysis, including a derivation of an upper bound of the generalization error.\nExperimentally, IMPaCT achieves a 3.8% performance improvement over current\nSOTA method on the ogbn-mag graph dataset. Additionally, we introduce the\nTemporal Stochastic Block Model (TSBM), which replicates temporal graphs under\nvarying conditions, demonstrating the applicability of our methods to general\nspatial GNNs.", "paper_summary_zh": "本文探讨了由时间顺序分割产生的图数据中的领域适应挑战。在转导图学习设置中，每个节点都与时间戳相关联，我们专注于半监督节点分类 (SSNC) 的任务，旨在使用过去节点的标签对最近的节点进行分类。节点连接中的时间依赖性会产生领域转移，导致在将针对历史数据训练的模型应用于最近数据时性能大幅下降。鉴于此场景的实际相关性，解决时间顺序分割数据中的领域适应至关重要，但尚未得到充分探索。我们提出了在时间顺序分割时间图 (IMPaCT) 中通过消息传递强制不变性，这是一种基于从时间图结构中得出的现实假设来强制不变性属性的方法。与依赖不可验证假设的传统领域适应方法不同，IMPaCT 明确考虑了时间顺序分割的特征。IMPaCT 还得到严格的数学分析的支持，包括泛化误差的上界推导。在实验中，IMPaCT 在 ogbn-mag 图数据集上比当前 SOTA 方法提高了 3.8% 的性能。此外，我们引入了时间随机块模型 (TSBM)，它在不同条件下复制时间图，展示了我们的方法对一般空间 GNN 的适用性。", "author": "Sejun Park et.al.", "authors": "Sejun Park, Joo Young Park, Hyunwoo Park", "id": "2411.10957v1", "paper_url": "http://arxiv.org/abs/2411.10957v1", "repo": "null"}}