{"2411.19581": {"publish_time": "2024-11-29", "title": "In-Context Learning with Noisy Labels", "paper_summary": "In-context learning refers to the emerging ability of large language models\n(LLMs) to perform a target task without additional training, utilizing\ndemonstrations of the task. Recent studies aim to enhance in-context learning\nperformance by selecting more useful demonstrations. However, they overlook the\npresence of inevitable noisy labels in task demonstrations that arise during\nthe labeling process in the real-world. In this paper, we propose a new task,\nin-context learning with noisy labels, which aims to solve real-world problems\nfor in-context learning where labels in task demonstrations would be corrupted.\nMoreover, we propose a new method and baseline methods for the new task,\ninspired by studies in learning with noisy labels. Through experiments, we\ndemonstrate that our proposed method can serve as a safeguard against\nperformance degradation in in-context learning caused by noisy labels.", "paper_summary_zh": "情境學習指的是大型語言模型 (LLM) 在沒有額外訓練的情況下，利用任務示範來執行目標任務的新興能力。最近的研究旨在透過選擇更有用的示範來增強情境學習表現。然而，它們忽略了在標記過程中產生的任務示範中不可避免的雜訊標籤。在本文中，我們提出了一個新的任務，即帶有雜訊標籤的情境學習，旨在解決情境學習的現實問題，其中任務示範中的標籤會被破壞。此外，我們提出了一種新方法和基準方法，靈感來自帶有雜訊標籤的學習研究。透過實驗，我們證明了我們提出的方法可以作為一種保障措施，防止情境學習中因雜訊標籤而導致的效能下降。", "author": "Junyong Kang et.al.", "authors": "Junyong Kang, Donghyun Son, Hwanjun Song, Buru Chang", "id": "2411.19581v1", "paper_url": "http://arxiv.org/abs/2411.19581v1", "repo": "null"}}