{"2408.01308": {"publish_time": "2024-08-02", "title": "Reconsidering Token Embeddings with the Definitions for Pre-trained Language Models", "paper_summary": "Learning token embeddings based on token co-occurrence statistics has proven\neffective for both pre-training and fine-tuning in natural language processing.\nHowever, recent studies have pointed out the distribution of learned embeddings\ndegenerates into anisotropy, and even pre-trained language models (PLMs) suffer\nfrom a loss of semantics-related information in embeddings for low-frequency\ntokens. This study first analyzes fine-tuning dynamics of a PLM, BART-large,\nand demonstrates its robustness against degeneration. On the basis of this\nfinding, we propose DefinitionEMB, a method that utilizes definitions to\nconstruct isotropically distributed and semantics-related token embeddings for\nPLMs while maintaining original robustness during fine-tuning. Our experiments\ndemonstrate the effectiveness of leveraging definitions from Wiktionary to\nconstruct such embeddings for RoBERTa-base and BART-large. Furthermore, the\nconstructed embeddings for low-frequency tokens improve the performance of\nthese models across various GLUE and four text summarization datasets.", "paper_summary_zh": "學習基於標記共現統計的標記嵌入已證明對於自然語言處理中的預訓練和微調都很有效。\n然而，最近的研究指出，學習到的嵌入分佈會退化為各向異性，甚至預訓練語言模型 (PLM) 也會因為低頻率標記的嵌入而喪失語義相關資訊。本研究首先分析了 PLM BART-large 的微調動態，並展示其對退化的穩健性。根據此發現，我們提出了 DefinitionEMB，這是一種利用定義來建構各向同性分佈且語義相關的 PLM 標記嵌入的方法，同時在微調期間維持原始穩健性。我們的實驗證明了利用維基詞典中的定義來建構 RoBERTa-base 和 BART-large 的此類嵌入的有效性。此外，為低頻率標記建構的嵌入改善了這些模型在各種 GLUE 和四個文本摘要資料集中的效能。", "author": "Ying Zhang et.al.", "authors": "Ying Zhang, Dongyuan Li, Manabu Okumura", "id": "2408.01308v1", "paper_url": "http://arxiv.org/abs/2408.01308v1", "repo": "null"}}