{"2408.11546": {"publish_time": "2024-08-21", "title": "Memorization In In-Context Learning", "paper_summary": "In-context learning (ICL) has proven to be an effective strategy for\nimproving the performance of large language models (LLMs) with no additional\ntraining. However, the exact mechanism behind these performance improvements\nremains unclear. This study is the first to show how ICL surfaces memorized\ntraining data and to explore the correlation between this memorization and\nperformance across various ICL regimes: zero-shot, few-shot, and many-shot. Our\nmost notable findings include: (1) ICL significantly surfaces memorization\ncompared to zero-shot learning in most cases; (2) demonstrations, without their\nlabels, are the most effective element in surfacing memorization; (3) ICL\nimproves performance when the surfaced memorization in few-shot regimes reaches\na high level (about 40%); and (4) there is a very strong correlation between\nperformance and memorization in ICL when it outperforms zero-shot learning.\nOverall, our study uncovers a hidden phenomenon -- memorization -- at the core\nof ICL, raising an important question: to what extent do LLMs truly generalize\nfrom demonstrations in ICL, and how much of their success is due to\nmemorization?", "paper_summary_zh": "情境學習 (ICL) 已被證明是一種有效的策略，可以在不進行額外訓練的情況下提升大型語言模型 (LLM) 的效能。然而，這些效能提升背後的確切機制仍不明確。本研究首次展示了 ICL 如何浮現記憶化的訓練資料，並探索此記憶化與各種 ICL 制度（零次學習、少次學習和多次學習）之間的關聯性。我們最顯著的發現包括：(1) 在大多數情況下，與零次學習相比，ICL 會顯著浮現記憶化；(2) 示範（不含標籤）是浮現記憶化最有效的元素；(3) 當少次學習制度中的浮現記憶化達到高水準（約 40%）時，ICL 會提升效能；(4) 當 ICL 勝過零次學習時，效能與記憶化之間存在非常強烈的關聯性。總體而言，我們的研究揭露了一個隱藏的現象——記憶化——這是 ICL 的核心，並提出了一個重要問題：LLM 在多大程度上真正從 ICL 中的示範中概括，而它們的成功有多少歸功於記憶化？", "author": "Shahriar Golchin et.al.", "authors": "Shahriar Golchin, Mihai Surdeanu, Steven Bethard, Eduardo Blanco, Ellen Riloff", "id": "2408.11546v1", "paper_url": "http://arxiv.org/abs/2408.11546v1", "repo": "null"}}