{"2406.08466": {"publish_time": "2024-06-12", "title": "Scaling Laws in Linear Regression: Compute, Parameters, and Data", "paper_summary": "Empirically, large-scale deep learning models often satisfy a neural scaling\nlaw: the test error of the trained model improves polynomially as the model\nsize and data size grow. However, conventional wisdom suggests the test error\nconsists of approximation, bias, and variance errors, where the variance error\nincreases with model size. This disagrees with the general form of neural\nscaling laws, which predict that increasing model size monotonically improves\nperformance.\n  We study the theory of scaling laws in an infinite dimensional linear\nregression setup. Specifically, we consider a model with $M$ parameters as a\nlinear function of sketched covariates. The model is trained by one-pass\nstochastic gradient descent (SGD) using $N$ data. Assuming the optimal\nparameter satisfies a Gaussian prior and the data covariance matrix has a\npower-law spectrum of degree $a>1$, we show that the reducible part of the test\nerror is $\\Theta(M^{-(a-1)} + N^{-(a-1)/a})$. The variance error, which\nincreases with $M$, is dominated by the other errors due to the implicit\nregularization of SGD, thus disappearing from the bound. Our theory is\nconsistent with the empirical neural scaling laws and verified by numerical\nsimulation.", "paper_summary_zh": "经验上，大规模深度学习模型通常满足神经网络缩放定律：随着模型大小和数据大小的增长，训练模型的测试误差以多项式方式得到改善。然而，传统观点认为测试误差由近似误差、偏差误差和方差误差组成，其中方差误差随着模型大小的增加而增加。这与神经网络缩放定律的一般形式相矛盾，后者预测增加模型大小会单调地提高性能。我们研究了无限维线性回归设置中的缩放定律理论。具体来说，我们考虑了一个模型，其中 $M$ 个参数作为素描协变量的线性函数。该模型通过使用 $N$ 个数据的一遍随机梯度下降 (SGD) 进行训练。假设最优参数满足高斯先验，并且数据协方差矩阵具有 $a>1$ 阶的幂律谱，我们表明测试误差的可约部分为 $\\Theta(M^{-(a-1)} + N^{-(a-1)/a})$。方差误差随着 $M$ 的增加而增加，由于 SGD 的隐式正则化，它被其他误差所支配，因此从界限中消失。我们的理论与经验神经网络缩放定律一致，并通过数值模拟得到验证。", "author": "Licong Lin et.al.", "authors": "Licong Lin, Jingfeng Wu, Sham M. Kakade, Peter L. Bartlett, Jason D. Lee", "id": "2406.08466v1", "paper_url": "http://arxiv.org/abs/2406.08466v1", "repo": "null"}}