{"2410.14146": {"publish_time": "2024-10-18", "title": "CausalChat: Interactive Causal Model Development and Refinement Using Large Language Models", "paper_summary": "Causal networks are widely used in many fields to model the complex\nrelationships between variables. A recent approach has sought to construct\ncausal networks by leveraging the wisdom of crowds through the collective\nparticipation of humans. While this can yield detailed causal networks that\nmodel the underlying phenomena quite well, it requires a large number of\nindividuals with domain understanding. We adopt a different approach:\nleveraging the causal knowledge that large language models, such as OpenAI's\nGPT-4, have learned by ingesting massive amounts of literature. Within a\ndedicated visual analytics interface, called CausalChat, users explore single\nvariables or variable pairs recursively to identify causal relations, latent\nvariables, confounders, and mediators, constructing detailed causal networks\nthrough conversation. Each probing interaction is translated into a tailored\nGPT-4 prompt and the response is conveyed through visual representations which\nare linked to the generated text for explanations. We demonstrate the\nfunctionality of CausalChat across diverse data contexts and conduct user\nstudies involving both domain experts and laypersons.", "paper_summary_zh": "因果网络在许多领域被广泛用于对变量之间的复杂关系进行建模。最近一种方法试图通过集体参与人类来利用群体智慧构建因果网络。虽然这可以产生非常好的对底层现象进行建模的详细因果网络，但它需要大量具有领域理解力的人员。我们采用了一种不同的方法：利用大型语言模型（例如 OpenAI 的 GPT-4）通过摄取大量文献所学到的因果知识。在称为 CausalChat 的专用可视化分析界面中，用户递归探索单个变量或变量对以识别因果关系、潜在变量、混杂因素和中介，通过对话构建详细的因果网络。每次探查交互都会被翻译成一个定制的 GPT-4 提示，并且响应通过可视化表示传达，这些表示链接到生成的文本以进行解释。我们展示了 CausalChat 在不同数据上下文中的功能，并进行了涉及领域专家和外行人士的用户研究。", "author": "Yanming Zhang et.al.", "authors": "Yanming Zhang, Akshith Kota, Eric Papenhausen, Klaus Mueller", "id": "2410.14146v1", "paper_url": "http://arxiv.org/abs/2410.14146v1", "repo": "null"}}