{"2410.07819": {"publish_time": "2024-10-10", "title": "Uncovering Overfitting in Large Language Model Editing", "paper_summary": "Knowledge editing has been proposed as an effective method for updating and\ncorrecting the internal knowledge of Large Language Models (LLMs). However,\nexisting editing methods often struggle with complex tasks, such as multi-hop\nreasoning. In this paper, we identify and investigate the phenomenon of Editing\nOverfit, where edited models assign disproportionately high probabilities to\nthe edit target, hindering the generalization of new knowledge in complex\nscenarios. We attribute this issue to the current editing paradigm, which\nplaces excessive emphasis on the direct correspondence between the input prompt\nand the edit target for each edit sample. To further explore this issue, we\nintroduce a new benchmark, EVOKE (EValuation of Editing Overfit in Knowledge\nEditing), along with fine-grained evaluation metrics. Through comprehensive\nexperiments and analysis, we demonstrate that Editing Overfit is prevalent in\ncurrent editing methods and that common overfitting mitigation strategies are\nof limited effectiveness in knowledge editing. To overcome this, inspired by\nLLMs' knowledge recall mechanisms, we propose a new plug-and-play strategy\ncalled Learn to Inference (LTI), which introduce a Multi-stage Inference\nConstraint module to guide the edited models in recalling new knowledge\nsimilarly to how unedited LLMs leverage knowledge through in-context learning.\nExtensive experimental results across a wide range of tasks validate the\neffectiveness of LTI in mitigating Editing Overfit.", "paper_summary_zh": "知識編輯已被提議為更新和修正大型語言模型 (LLM) 內部知識的有效方法。然而，現有的編輯方法通常難以處理複雜的任務，例如多跳推理。在本文中，我們找出並研究編輯過度擬合的現象，其中已編輯模型會將不成比例的高機率分配給編輯目標，阻礙複雜場景中新知識的概化。我們將此問題歸因於目前的編輯範例，該範例過度強調輸入提示和每個編輯範例的編輯目標之間的直接對應關係。為了進一步探討這個問題，我們引入了一個新的基準 EVOKE（知識編輯中編輯過度擬合的評估），以及細粒度的評估指標。透過全面的實驗和分析，我們證明編輯過度擬合在目前的編輯方法中很普遍，而常見的過度擬合緩解策略在知識編輯中的效果有限。為了克服這個問題，受到 LLM 知識回溯機制的啟發，我們提出了一種新的即插即用策略，稱為學習推論 (LTI)，它引入了一個多階段推論約束模組，以引導已編輯的模型回溯新知識，類似於未編輯的 LLM 如何透過情境學習來利用知識。在各種任務中進行的廣泛實驗結果驗證了 LTI 在緩解編輯過度擬合方面的有效性。", "author": "Mengqi Zhang et.al.", "authors": "Mengqi Zhang, Xiaotian Ye, Qiang Liu, Pengjie Ren, Shu Wu, Zhumin Chen", "id": "2410.07819v1", "paper_url": "http://arxiv.org/abs/2410.07819v1", "repo": "null"}}