{"2410.18636": {"publish_time": "2024-10-24", "title": "Multi-agent cooperation through learning-aware policy gradients", "paper_summary": "Self-interested individuals often fail to cooperate, posing a fundamental\nchallenge for multi-agent learning. How can we achieve cooperation among\nself-interested, independent learning agents? Promising recent work has shown\nthat in certain tasks cooperation can be established between learning-aware\nagents who model the learning dynamics of each other. Here, we present the\nfirst unbiased, higher-derivative-free policy gradient algorithm for\nlearning-aware reinforcement learning, which takes into account that other\nagents are themselves learning through trial and error based on multiple noisy\ntrials. We then leverage efficient sequence models to condition behavior on\nlong observation histories that contain traces of the learning dynamics of\nother agents. Training long-context policies with our algorithm leads to\ncooperative behavior and high returns on standard social dilemmas, including a\nchallenging environment where temporally-extended action coordination is\nrequired. Finally, we derive from the iterated prisoner's dilemma a novel\nexplanation for how and when cooperation arises among self-interested\nlearning-aware agents.", "paper_summary_zh": "自私的人常常无法合作，对多智能体学习构成了根本挑战。我们如何在自私、独立的学习智能体之间实现合作？最近有希望的研究表明，在某些任务中，可以建立学习感知智能体之间的合作，这些智能体对彼此的学习动态进行建模。在这里，我们提出了第一个无偏、无高阶导数的策略梯度算法，用于学习感知强化学习，它考虑到其他智能体本身正在通过多次嘈杂试验进行试错学习。然后，我们利用高效的序列模型，根据包含其他智能体学习动态痕迹的长观察历史记录来调节行为。使用我们的算法训练长上下文策略会导致合作行为，并在标准社会困境中获得高回报，包括需要时间扩展动作协调的具有挑战性的环境。最后，我们从重复囚徒困境中推导出一个新颖的解释，说明自私的学习感知智能体如何以及何时产生合作。", "author": "Alexander Meulemans et.al.", "authors": "Alexander Meulemans, Seijin Kobayashi, Johannes von Oswald, Nino Scherrer, Eric Elmoznino, Blake Richards, Guillaume Lajoie, Blaise Agüera y Arcas, João Sacramento", "id": "2410.18636v1", "paper_url": "http://arxiv.org/abs/2410.18636v1", "repo": "null"}}