{"2406.02027": {"publish_time": "2024-06-04", "title": "Inference Attacks in Machine Learning as a Service: A Taxonomy, Review, and Promising Directions", "paper_summary": "The prosperity of machine learning has also brought people's concerns about\ndata privacy. Among them, inference attacks can implement privacy breaches in\nvarious MLaaS scenarios and model training/prediction phases. Specifically,\ninference attacks can perform privacy inference on undisclosed target training\nsets based on outputs of the target model, including but not limited to\nstatistics, membership, semantics, data representation, etc. For instance,\ninfer whether the target data has the characteristics of AIDS. In addition, the\nrapid development of the machine learning community in recent years, especially\nthe surge of model types and application scenarios, has further stimulated the\ninference attacks' research. Thus, studying inference attacks and analyzing\nthem in depth is urgent and significant. However, there is still a gap in the\nsystematic discussion of inference attacks from taxonomy, global perspective,\nattack, and defense perspectives. This survey provides an in-depth and\ncomprehensive inference of attacks and corresponding countermeasures in\nML-as-a-service based on taxonomy and the latest researches. Without\ncompromising researchers' intuition, we first propose the 3MP taxonomy based on\nthe community research status, trying to normalize the confusing naming system\nof inference attacks. Also, we analyze the pros and cons of each type of\ninference attack, their workflow, countermeasure, and how they interact with\nother attacks. In the end, we point out several promising directions for\nresearchers from a more comprehensive and novel perspective.", "paper_summary_zh": "機器學習的蓬勃發展也帶來了人們對於資料隱私的疑慮。其中，推論攻擊可以在各種 MLaaS 場景和模型訓練/預測階段實作隱私洩露。具體來說，推論攻擊可以根據目標模型的輸出，對未公開的目標訓練集執行隱私推論，包括但不限於統計、成員資格、語義、資料表示等。例如，推論目標資料是否具有愛滋病的特徵。此外，近年來機器學習社群的快速發展，特別是模型類型和應用場景的激增，進一步刺激了推論攻擊的研究。因此，研究推論攻擊並深入分析它們迫在眉睫且意義重大。然而，從分類、全球觀點、攻擊和防禦觀點對推論攻擊進行系統性討論仍存在差距。這項調查根據分類法和最新研究，對機器學習即服務中的攻擊和相應的對策提供了深入且全面的推論。在不影響研究人員直覺的情況下，我們首先基於社群研究現狀提出 3MP 分類法，試圖將推論攻擊中混亂的命名系統標準化。此外，我們分析了每種類型的推論攻擊的優缺點、工作流程、對策以及它們如何與其他攻擊互動。最後，我們從更全面且新穎的角度為研究人員指出了幾個有希望的研究方向。", "author": "Feng Wu et.al.", "authors": "Feng Wu, Lei Cui, Shaowen Yao, Shui Yu", "id": "2406.02027v1", "paper_url": "http://arxiv.org/abs/2406.02027v1", "repo": "null"}}