{"2501.05663": {"publish_time": "2025-01-10", "title": "Learning to Measure Quantum Neural Networks", "paper_summary": "The rapid progress in quantum computing (QC) and machine learning (ML) has\nattracted growing attention, prompting extensive research into quantum machine\nlearning (QML) algorithms to solve diverse and complex problems. Designing\nhigh-performance QML models demands expert-level proficiency, which remains a\nsignificant obstacle to the broader adoption of QML. A few major hurdles\ninclude crafting effective data encoding techniques and parameterized quantum\ncircuits, both of which are crucial to the performance of QML models.\nAdditionally, the measurement phase is frequently overlooked-most current QML\nmodels rely on pre-defined measurement protocols that often fail to account for\nthe specific problem being addressed. We introduce a novel approach that makes\nthe observable of the quantum system-specifically, the Hermitian\nmatrix-learnable. Our method features an end-to-end differentiable learning\nframework, where the parameterized observable is trained alongside the ordinary\nquantum circuit parameters simultaneously. Using numerical simulations, we show\nthat the proposed method can identify observables for variational quantum\ncircuits that lead to improved outcomes, such as higher classification\naccuracy, thereby boosting the overall performance of QML models.", "paper_summary_zh": "量子運算 (QC) 和機器學習 (ML) 的快速進展已引起越來越多的關注，促使人們廣泛研究量子機器學習 (QML) 演算法，以解決多樣且複雜的問題。設計高性能 QML 模型需要專家級的熟練度，這仍然是 QML 更廣泛採用的重大障礙。一些主要的障礙包括製作有效的資料編碼技術和參數化量子電路，這兩者對於 QML 模型的性能至關重要。此外，測量階段經常被忽視 - 大多數當前的 QML 模型依賴於預先定義的測量協定，這些協定通常無法解決具體問題。我們引入了一種新穎的方法，它使量子系統的可觀察性（特別是 Hermitian 矩陣）可學習。我們的模型特點是一個端到端可微分學習框架，其中參數化可觀察性與常規量子電路參數同時訓練。使用數值模擬，我們表明所提出的方法可以識別變分量子電路的可觀察性，從而導致改進的結果，例如更高的分類準確度，從而提高 QML 模型的整體性能。", "author": "Samuel Yen-Chi Chen et.al.", "authors": "Samuel Yen-Chi Chen, Huan-Hsin Tseng, Hsin-Yi Lin, Shinjae Yoo", "id": "2501.05663v1", "paper_url": "http://arxiv.org/abs/2501.05663v1", "repo": "null"}}