{"2411.04825": {"publish_time": "2024-11-07", "title": "VTechAGP: An Academic-to-General-Audience Text Paraphrase Dataset and Benchmark Models", "paper_summary": "Existing text simplification or paraphrase datasets mainly focus on\nsentence-level text generation in a general domain. These datasets are\ntypically developed without using domain knowledge. In this paper, we release a\nnovel dataset, VTechAGP, which is the first academic-to-general-audience text\nparaphrase dataset consisting of 4,938 document-level these and dissertation\nacademic and general-audience abstract pairs from 8 colleges authored over 25\nyears. We also propose a novel dynamic soft prompt generative language model,\nDSPT5. For training, we leverage a contrastive-generative loss function to\nlearn the keyword vectors in the dynamic prompt. For inference, we adopt a\ncrowd-sampling decoding strategy at both semantic and structural levels to\nfurther select the best output candidate. We evaluate DSPT5 and various\nstate-of-the-art large language models (LLMs) from multiple perspectives.\nResults demonstrate that the SOTA LLMs does not provide satisfactory outcomes,\nwhile the lightweight DSPT5 can achieve competitive results. To the best of our\nknowledge, we are the first to build a benchmark dataset and solutions for\nacademic-to-general-audience text paraphrase dataset.", "paper_summary_zh": "現有的文字簡化或改寫資料集主要集中在一般領域的句子級文字產生。這些資料集通常在不使用領域知識的情況下開發。在本文中，我們發布了一個新的資料集 VTechAGP，它是第一個由學術轉向大眾的文字改寫資料集，包含 4,938 個文件級別的論文和論文學術和一般受眾摘要對，來自 8 所大學，撰寫於 25 年以上。我們還提出了一種新的動態軟提示生成語言模型 DSPT5。對於訓練，我們利用對比生成損失函數來學習動態提示中的關鍵字向量。對於推理，我們在語義和結構層級採用群眾採樣解碼策略，進一步選擇最佳輸出候選。我們從多個角度評估了 DSPT5 和各種最先進的大語言模型 (LLM)。結果表明，SOTA LLM 沒有提供令人滿意的結果，而輕量級的 DSPT5 可以實現有競爭力的結果。據我們所知，我們是第一個為學術到一般受眾的文字改寫資料集構建基準資料集和解決方案的人。", "author": "Ming Cheng et.al.", "authors": "Ming Cheng, Jiaying Gong, Chenhan Yuan, William A. Ingram, Edward Fox, Hoda Eldardiry", "id": "2411.04825v1", "paper_url": "http://arxiv.org/abs/2411.04825v1", "repo": "null"}}