{"2503.21541": {"publish_time": "2025-03-27", "title": "LOCATEdit: Graph Laplacian Optimized Cross Attention for Localized Text-Guided Image Editing", "paper_summary": "Text-guided image editing aims to modify specific regions of an image\naccording to natural language instructions while maintaining the general\nstructure and the background fidelity. Existing methods utilize masks derived\nfrom cross-attention maps generated from diffusion models to identify the\ntarget regions for modification. However, since cross-attention mechanisms\nfocus on semantic relevance, they struggle to maintain the image integrity. As\na result, these methods often lack spatial consistency, leading to editing\nartifacts and distortions. In this work, we address these limitations and\nintroduce LOCATEdit, which enhances cross-attention maps through a graph-based\napproach utilizing self-attention-derived patch relationships to maintain\nsmooth, coherent attention across image regions, ensuring that alterations are\nlimited to the designated items while retaining the surrounding structure.\n\\method consistently and substantially outperforms existing baselines on\nPIE-Bench, demonstrating its state-of-the-art performance and effectiveness on\nvarious editing tasks. Code can be found on\nhttps://github.com/LOCATEdit/LOCATEdit/", "paper_summary_zh": "<paragraph>文字引導的圖像編輯旨在根據自然語言指令修改圖像的特定區域，同時保持整體結構和背景的保真度。現有方法利用從擴散模型生成的交叉注意力圖譜衍生的遮罩來識別要修改的目標區域。然而，由於交叉注意力機制側重於語義相關性，因此難以保持圖像完整性。結果，這些方法通常缺乏空間一致性，導致編輯出現偽影和失真。在這項工作中，我們解決了這些限制，並引入了 LOCATEdit，它透過基於圖形的方法增強交叉注意力圖譜，利用自注意力衍生的區塊關係來保持圖像區域之間平滑、連貫的注意力，確保更改僅限於指定的項目，同時保留周圍的結構。此方法在 PIE-Bench 上持續且顯著地優於現有基準，展現了其在各種編輯任務中的最先進性能和有效性。程式碼可在 https://github.com/LOCATEdit/LOCATEdit/ 上找到。</paragraph>\n", "author": "Achint Soni et.al.", "authors": "Achint Soni, Meet Soni, Sirisha Rambhatla", "id": "2503.21541v1", "paper_url": "http://arxiv.org/abs/2503.21541v1", "repo": "null"}}