{"2408.00257": {"publish_time": "2024-08-01", "title": "RoCo:Robust Collaborative Perception By Iterative Object Matching and Pose Adjustment", "paper_summary": "Collaborative autonomous driving with multiple vehicles usually requires the\ndata fusion from multiple modalities. To ensure effective fusion, the data from\neach individual modality shall maintain a reasonably high quality. However, in\ncollaborative perception, the quality of object detection based on a modality\nis highly sensitive to the relative pose errors among the agents. It leads to\nfeature misalignment and significantly reduces collaborative performance. To\naddress this issue, we propose RoCo, a novel unsupervised framework to conduct\niterative object matching and agent pose adjustment. To the best of our\nknowledge, our work is the first to model the pose correction problem in\ncollaborative perception as an object matching task, which reliably associates\ncommon objects detected by different agents. On top of this, we propose a graph\noptimization process to adjust the agent poses by minimizing the alignment\nerrors of the associated objects, and the object matching is re-done based on\nthe adjusted agent poses. This process is carried out iteratively until\nconvergence. Experimental study on both simulated and real-world datasets\ndemonstrates that the proposed framework RoCo consistently outperforms existing\nrelevant methods in terms of the collaborative object detection performance,\nand exhibits highly desired robustness when the pose information of agents is\nwith high-level noise. Ablation studies are also provided to show the impact of\nits key parameters and components. The code is released at\nhttps://github.com/HuangZhe885/RoCo.", "paper_summary_zh": "多車輛協作自動駕駛通常需要來自多種模態的資料融合。為了確保融合有效，來自每個單獨模態的資料應維持相當高的品質。然而，在協作感知中，基於模態的物件偵測品質對代理之間的相對位姿誤差高度敏感。這會導致特徵未對齊，並顯著降低協作效能。為了解決這個問題，我們提出 RoCo，一種新的無監督架構，用於執行反覆物件配對和代理位姿調整。據我們所知，我們的研究率先將協作感知中的位姿校正問題建模為物件配對任務，它會可靠地關聯由不同代理偵測到的共同物件。此外，我們提出一個圖形最佳化流程，藉由最小化關聯物件的對齊誤差來調整代理位姿，並根據調整後的代理位姿重新執行物件配對。這個流程會反覆執行，直到收斂。在模擬和真實世界資料集上的實驗研究顯示，所提出的 RoCo 架構在協作物件偵測效能方面始終優於現有的相關方法，並且在代理的位姿資訊具有高層級雜訊時展現高度的穩健性。也提供了消融研究，以顯示其關鍵參數和組成的影響。程式碼已於 https://github.com/HuangZhe885/RoCo 發布。", "author": "Zhe Huang et.al.", "authors": "Zhe Huang, Shuo Wang, Yongcai Wang, Wanting Li, Deying Li, Lei Wang", "id": "2408.00257v1", "paper_url": "http://arxiv.org/abs/2408.00257v1", "repo": "null"}}