{"2410.15064": {"publish_time": "2024-10-19", "title": "A Prompt Engineering Approach and a Knowledge Graph based Framework for Tackling Legal Implications of Large Language Model Answers", "paper_summary": "With the recent surge in popularity of Large Language Models (LLMs), there is\nthe rising risk of users blindly trusting the information in the response, even\nin cases where the LLM recommends actions that have potential legal\nimplications and this may put the user in danger. We provide an empirical\nanalysis on multiple existing LLMs showing the urgency of the problem. Hence,\nwe propose a short-term solution consisting in an approach for isolating these\nlegal issues through prompt re-engineering. We further analyse the outcomes but\nalso the limitations of the prompt engineering based approach and we highlight\nthe need of additional resources for fully solving the problem We also propose\na framework powered by a legal knowledge graph (KG) to generate legal citations\nfor these legal issues, enriching the response of the LLM.", "paper_summary_zh": "隨著大型語言模型（LLM）近期流行激增，使用者盲目相信回應中資訊的風險也隨之升高，即使在 LLM 建議採取可能產生法律影響的行動時亦然，這可能會使使用者陷入危險之中。我們針對多個現有 LLM 提供實證分析，顯示此問題的急迫性。因此，我們提出一個短期解決方案，包括透過提示重新設計來孤立這些法律問題的方法。我們進一步分析提示工程方法的成果，但也分析其限制，並強調完全解決問題需要額外資源。我們還提出一個由法律知識圖譜（KG）驅動的架構，為這些法律問題產生法律引文，豐富 LLM 的回應。", "author": "George Hannah et.al.", "authors": "George Hannah, Rita T. Sousa, Ioannis Dasoulas, Claudia d'Amato", "id": "2410.15064v1", "paper_url": "http://arxiv.org/abs/2410.15064v1", "repo": "null"}}