{"2410.16166": {"publish_time": "2024-10-21", "title": "Beyond Filtering: Adaptive Image-Text Quality Enhancement for MLLM Pretraining", "paper_summary": "Multimodal large language models (MLLMs) have made significant strides by\nintegrating visual and textual modalities. A critical factor in training MLLMs\nis the quality of image-text pairs within multimodal pretraining datasets.\nHowever, $\\textit {de facto}$ filter-based data quality enhancement paradigms\noften discard a substantial portion of high-quality image data due to\ninadequate semantic alignment between images and texts, leading to\ninefficiencies in data utilization and scalability. In this paper, we propose\nthe Adaptive Image-Text Quality Enhancer (AITQE), a model that dynamically\nassesses and enhances the quality of image-text pairs. AITQE employs a text\nrewriting mechanism for low-quality pairs and incorporates a negative sample\nlearning strategy to improve evaluative capabilities by integrating\ndeliberately selected low-quality samples during training. Unlike prior\napproaches that significantly alter text distributions, our method minimally\nadjusts text to preserve data volume while enhancing quality. Experimental\nresults demonstrate that AITQE surpasses existing methods on various benchmark,\neffectively leveraging raw data and scaling efficiently with increasing data\nvolumes. We hope our work will inspire future works. The code and model are\navailable at: https://github.com/hanhuang22/AITQE.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 透过整合视觉和文本模态，取得了重大进展。训练 MLLM 的关键因素是多模态预训练数据集中的图像文本对的质量。然而，事实上基于过滤器的资料品质提升范例，常常会因为图像和文本之间的语意对齐不足，而丢弃大量高品质的图像资料，导致资料使用和可扩展性的低效率。在本文中，我们提出自适应图像文本品质强化器 (AITQE)，这是一个动态评估和提升图像文本对品质的模型。AITQE 对低品质的对使用文本改写机制，并结合负样本学习策略，透过在训练期间整合刻意选取的低品质样本，来提升评估能力。与大幅度改变文本分布的先前方法不同，我们的方法最小幅度地调整文本，以在提升品质的同时保留资料量。实验结果显示，AITQE 在各种基准上都超越现有的方法，有效利用原始资料，并随着资料量的增加而有效扩展。我们希望我们的工作能启发未来的研究。代码和模型可在以下网址取得：https://github.com/hanhuang22/AITQE。", "author": "Han Huang et.al.", "authors": "Han Huang, Yuqi Huo, Zijia Zhao, Haoyu Lu, Shu Wu, Bingning Wang, Qiang Liu, Weipeng Chen, Liang Wang", "id": "2410.16166v1", "paper_url": "http://arxiv.org/abs/2410.16166v1", "repo": "https://github.com/hanhuang22/aitqe"}}