{"2502.09215": {"publish_time": "2025-02-13", "title": "Architecture for Simulating Behavior Mode Changes in Norm-Aware Autonomous Agents", "paper_summary": "This paper presents an architecture for simulating the actions of a\nnorm-aware intelligent agent whose behavior with respect to norm compliance is\nset, and can later be changed, by a human controller. Updating an agent's\nbehavior mode from a norm-abiding to a riskier one may be relevant when the\nagent is involved in time-sensitive rescue operations, for example. We base our\nwork on the Authorization and Obligation Policy Language AOPL designed by\nGelfond and Lobo for the specification of norms. We introduce an architecture\nand a prototype software system that can be used to simulate an agent's plans\nunder different behavior modes that can later be changed by the controller. We\nenvision such software to be useful to policy makers, as they can more readily\nunderstand how agents may act in certain situations based on the agents'\nattitudes towards norm-compliance. Policy makers may then refine their policies\nif simulations show unwanted consequences.", "paper_summary_zh": "本文提出了一個架構，用於模擬一個規範感知智能代理的行為，其行為遵守規範，並可以由人類控制者設定，並可以在稍後進行更改。當代理參與時間敏感的救援行動時，將代理的行為模式從遵守規範更新為更冒險的行為模式可能是相關的。我們的工作基於 Gelfond 和 Lobo 為規範規範設計的授權和義務政策語言 AOPL。我們引入了一個架構和一個原型軟體系統，可用於模擬代理在不同行為模式下的計畫，這些行為模式稍後可以由控制者更改。我們預計此類軟體對政策制定者很有用，因為他們可以更容易地根據代理對規範遵守的態度了解代理在特定情況下的行為方式。如果模擬顯示出不希望的後果，政策制定者可以修改他們的政策。", "author": "Sean Glaze et.al.", "authors": "Sean Glaze, Daniela Inclezan", "id": "2502.09215v1", "paper_url": "http://arxiv.org/abs/2502.09215v1", "repo": "null"}}