{"2407.02819": {"publish_time": "2024-07-03", "title": "Efficient Training of Language Models with Compact and Consistent Next Token Distributions", "paper_summary": "Maximizing the likelihood of the next token is an established, statistically\nsound objective for pre-training language models. In this paper we show that we\ncan train better models faster by pre-aggregating the corpus with a collapsed\n$n$-gram distribution. Previous studies have proposed corpus-level $n$-gram\nstatistics as a regularizer; however, the construction and querying of such\n$n$-grams, if done naively, prove to be costly and significantly impede\ntraining speed, thereby limiting their application in modern large language\nmodel pre-training.\n  We introduce an alternative compact representation of the next token\ndistribution that, in expectation, aligns with the complete $n$-gram\ndistribution while markedly reducing variance across mini-batches compared to\nthe standard next-token loss. Empirically, we demonstrate that both the\n$n$-gram regularized model and our approximation yield substantial improvements\nin model quality and convergence rate compared to existing methods.\nFurthermore, our approximation facilitates scalability of gains to larger\ndatasets and models compared to the straightforward $n$-gram regularization\nmethod.", "paper_summary_zh": "最大化下一個符號的可能性是預訓練語言模型已建立的、在統計上合理的目標。在本文中，我們展示了我們可以透過使用折疊的 $n$-gram 分布預先彙總語料庫，來更快地訓練出更好的模型。先前的研究已提出語料庫級別的 $n$-gram 統計資料作為正則化器；然而，如果天真地進行此類 $n$-gram 的建構和查詢，證明代價高昂，且會顯著阻礙訓練速度，從而限制它們在現代大型語言模型預訓練中的應用。\n我們引入了下一個符號分佈的替代緊湊表示法，在預期中，它與完整的 $n$-gram 分佈一致，同時顯著降低了與標準下一個符號損失相比的迷你批次間的變異。經驗上，我們證明了 $n$-gram 正則化模型和我們的近似值在模型品質和收斂速度方面都比現有方法有顯著改善。\n此外，與直接的 $n$-gram 正則化方法相比，我們的近似值促進了收益對更大資料集和模型的可擴充性。", "author": "Ashutosh Sathe et.al.", "authors": "Ashutosh Sathe, Sunita Sarawagi", "id": "2407.02819v1", "paper_url": "http://arxiv.org/abs/2407.02819v1", "repo": "null"}}