{"2407.11463": {"publish_time": "2024-07-16", "title": "Investigating Imperceptibility of Adversarial Attacks on Tabular Data: An Empirical Analysis", "paper_summary": "Adversarial attacks are a potential threat to machine learning models, as\nthey can cause the model to make incorrect predictions by introducing\nimperceptible perturbations to the input data. While extensively studied in\nunstructured data like images, their application to structured data like\ntabular data presents unique challenges due to the heterogeneity and intricate\nfeature interdependencies of tabular data. Imperceptibility in tabular data\ninvolves preserving data integrity while potentially causing misclassification,\nunderscoring the need for tailored imperceptibility criteria for tabular data.\nHowever, there is currently a lack of standardised metrics for assessing\nadversarial attacks specifically targeted at tabular data. To address this gap,\nwe derive a set of properties for evaluating the imperceptibility of\nadversarial attacks on tabular data. These properties are defined to capture\nseven perspectives of perturbed data: proximity to original inputs, sparsity of\nalterations, deviation to datapoints in the original dataset, sensitivity of\naltering sensitive features, immutability of perturbation, feasibility of\nperturbed values and intricate feature interdepencies among tabular features.\nFurthermore, we conduct both quantitative empirical evaluation and case-based\nqualitative examples analysis for seven properties. The evaluation reveals a\ntrade-off between attack success and imperceptibility, particularly concerning\nproximity, sensitivity, and deviation. Although no evaluated attacks can\nachieve optimal effectiveness and imperceptibility simultaneously, unbounded\nattacks prove to be more promised for tabular data in crafting imperceptible\nadversarial examples. The study also highlights the limitation of evaluated\nalgorithms in controlling sparsity effectively. We suggest incorporating a\nsparsity metric in future attack design to regulate the number of perturbed\nfeatures.", "paper_summary_zh": "對抗攻擊對機器學習模型來說是一個潛在的威脅，因為它們會透過在輸入資料中引入難以察覺的擾動，導致模型做出不正確的預測。雖然在影像等非結構化資料中已廣泛研究，但由於表格資料的異質性和複雜的特性相互依賴性，將其應用於表格資料等結構化資料會帶來獨特的挑戰。表格資料中的難以察覺性涉及在潛在導致錯誤分類的同時，保持資料的完整性，這凸顯了為表格資料量身打造難以察覺性標準的必要性。然而，目前針對表格資料的對抗攻擊評估標準化指標仍有不足。為了解決這個差距，我們推導出一組用於評估表格資料對抗攻擊難以察覺性的屬性。這些屬性被定義為捕捉擾動資料的七個觀點：與原始輸入的接近程度、變動的稀疏性、與原始資料集中資料點的偏差、變動敏感特性的敏感性、擾動的不變性、擾動值的可能性，以及表格特性之間複雜的特性相互依賴性。此外，我們對七個屬性進行定量實證評估和基於案例的定性範例分析。評估結果揭示了攻擊成功與難以察覺性之間的權衡，特別是關於接近度、敏感性和偏差。儘管沒有評估的攻擊可以同時達到最佳的有效性和難以察覺性，但無界攻擊被證明在製作難以察覺的對抗範例方面對表格資料更有前景。研究還強調了評估演算法在有效控制稀疏性方面的限制。我們建議在未來的攻擊設計中納入稀疏性指標，以規範擾動特性的數量。", "author": "Zhipeng He et.al.", "authors": "Zhipeng He, Chun Ouyang, Laith Alzubaidi, Alistair Barros, Catarina Moreira", "id": "2407.11463v1", "paper_url": "http://arxiv.org/abs/2407.11463v1", "repo": "https://github.com/zhipenghe/imperceptibility-of-tabular-adversarial-attack"}}