{"2407.04130": {"publish_time": "2024-07-04", "title": "Towards Automating Text Annotation: A Case Study on Semantic Proximity Annotation using GPT-4", "paper_summary": "This paper explores using GPT-3.5 and GPT-4 to automate the data annotation\nprocess with automatic prompting techniques. The main aim of this paper is to\nreuse human annotation guidelines along with some annotated data to design\nautomatic prompts for LLMs, focusing on the semantic proximity annotation task.\nAutomatic prompts are compared to customized prompts. We further implement the\nprompting strategies into an open-source text annotation tool, enabling easy\nonline use via the OpenAI API. Our study reveals the crucial role of accurate\nprompt design and suggests that prompting GPT-4 with human-like instructions is\nnot straightforwardly possible for the semantic proximity task. We show that\nsmall modifications to the human guidelines already improve the performance,\nsuggesting possible ways for future research.", "paper_summary_zh": "本文探討使用 GPT-3.5 和 GPT-4 自動化資料標註流程，並使用自動提示技術。本文的主要目標是重複使用人類標註指南以及一些標註資料，以設計 LLM 的自動提示，專注於語義接近標註任務。將自動提示與自訂提示進行比較。我們進一步將提示策略實作到開源文字標註工具中，讓使用者能透過 OpenAI API 輕鬆線上使用。我們的研究揭露了準確提示設計的關鍵角色，並建議使用類似人類的指示提示 GPT-4 並非語義接近任務的直接作法。我們顯示，對人類指南進行微調已能提升效能，這建議了未來研究的可能途徑。", "author": "Sachin Yadav et.al.", "authors": "Sachin Yadav, Tejaswi Choppa, Dominik Schlechtweg", "id": "2407.04130v1", "paper_url": "http://arxiv.org/abs/2407.04130v1", "repo": "null"}}