{"2408.10940": {"publish_time": "2024-08-20", "title": "A Closer Look at Data Augmentation Strategies for Finetuning-Based Low/Few-Shot Object Detection", "paper_summary": "Current methods for low- and few-shot object detection have primarily focused\non enhancing model performance for detecting objects. One common approach to\nachieve this is by combining model finetuning with data augmentation\nstrategies. However, little attention has been given to the energy efficiency\nof these approaches in data-scarce regimes. This paper seeks to conduct a\ncomprehensive empirical study that examines both model performance and energy\nefficiency of custom data augmentations and automated data augmentation\nselection strategies when combined with a lightweight object detector. The\nmethods are evaluated in three different benchmark datasets in terms of their\nperformance and energy consumption, and the Efficiency Factor is employed to\ngain insights into their effectiveness considering both performance and\nefficiency. Consequently, it is shown that in many cases, the performance gains\nof data augmentation strategies are overshadowed by their increased energy\nusage, necessitating the development of more energy efficient data augmentation\nstrategies to address data scarcity.", "paper_summary_zh": "目前低樣本和少樣本目標偵測方法主要集中於增強模型效能以偵測目標。達成此目標的一種常見方法是將模型微調與資料擴充策略結合。然而，在資料稀少的環境中，這些方法的能源效率卻鮮少受到關注。本文旨在進行一項全面的實證研究，探討自訂資料擴充與自動化資料擴充選取策略在與輕量級目標偵測器結合使用時的模型效能和能源效率。這些方法在三個不同的基準資料集中的效能和能源消耗方面進行評估，並採用效率因子來深入了解其在效能和效率兩方面的有效性。因此，結果顯示在許多情況下，資料擴充策略的效能提升會被其增加的能源使用量所抵銷，這使得有必要開發更節能的資料擴充策略來解決資料稀少的問題。", "author": "Vladislav Li et.al.", "authors": "Vladislav Li, Georgios Tsoumplekas, Ilias Siniosoglou, Vasileios Argyriou, Anastasios Lytos, Eleftherios Fountoukidis, Panagiotis Sarigiannidis", "id": "2408.10940v1", "paper_url": "http://arxiv.org/abs/2408.10940v1", "repo": "null"}}