{"2411.17454": {"publish_time": "2024-11-26", "title": "FLEX-CLIP: Feature-Level GEneration Network Enhanced CLIP for X-shot Cross-modal Retrieval", "paper_summary": "Given a query from one modality, few-shot cross-modal retrieval (CMR)\nretrieves semantically similar instances in another modality with the target\ndomain including classes that are disjoint from the source domain. Compared\nwith classical few-shot CMR methods, vision-language pretraining methods like\nCLIP have shown great few-shot or zero-shot learning performance. However, they\nstill suffer challenges due to (1) the feature degradation encountered in the\ntarget domain and (2) the extreme data imbalance. To tackle these issues, we\npropose FLEX-CLIP, a novel Feature-level Generation Network Enhanced CLIP.\nFLEX-CLIP includes two training stages. In multimodal feature generation, we\npropose a composite multimodal VAE-GAN network to capture real feature\ndistribution patterns and generate pseudo samples based on CLIP features,\naddressing data imbalance. For common space projection, we develop a gate\nresidual network to fuse CLIP features with projected features, reducing\nfeature degradation in X-shot scenarios. Experimental results on four benchmark\ndatasets show a 7%-15% improvement over state-of-the-art methods, with ablation\nstudies demonstrating enhancement of CLIP features.", "paper_summary_zh": "给定一个来自一个模态的查询，少样本跨模态检索（CMR）\n在另一个模态中检索语义相似的实例，目标\n域包括与源域不相交的类别。与经典的少样本 CMR 方法相比，视觉语言预训练方法（如\nCLIP）已经展示了极好的少样本或零样本学习性能。然而，它们\n仍然面临挑战，原因在于（1）在目标域中遇到的特征退化和（2）极端的数据不平衡。为了解决这些问题，我们\n提出了 FLEX-CLIP，一种新颖的特征级生成网络增强 CLIP。\nFLEX-CLIP 包括两个训练阶段。在多模态特征生成中，我们\n提出了一种复合多模态 VAE-GAN 网络来捕获真实的特征\n分布模式并基于 CLIP 特征生成伪样本，解决数据不平衡。对于公共空间投影，我们开发了一个门\n残差网络来融合 CLIP 特征和投影特征，减少\n在 X-shot 场景中的特征退化。在四个基准数据集上的实验结果显示出比最先进的方法有 7%-15% 的改进，消融\n研究证明了 CLIP 特征的增强。", "author": "Jingyou Xie et.al.", "authors": "Jingyou Xie, Jiayi Kuang, Zhenzhou Lin, Jiarui Ouyang, Zishuo Zhao, Ying Shen", "id": "2411.17454v1", "paper_url": "http://arxiv.org/abs/2411.17454v1", "repo": "null"}}