{"2409.09684": {"publish_time": "2024-09-15", "title": "Anatomy of Machines for Markowitz: Decision-Focused Learning for Mean-Variance Portfolio Optimization", "paper_summary": "Markowitz laid the foundation of portfolio theory through the mean-variance\noptimization (MVO) framework. However, the effectiveness of MVO is contingent\non the precise estimation of expected returns, variances, and covariances of\nasset returns, which are typically uncertain. Machine learning models are\nbecoming useful in estimating uncertain parameters, and such models are trained\nto minimize prediction errors, such as mean squared errors (MSE), which treat\nprediction errors uniformly across assets. Recent studies have pointed out that\nthis approach would lead to suboptimal decisions and proposed Decision-Focused\nLearning (DFL) as a solution, integrating prediction and optimization to\nimprove decision-making outcomes. While studies have shown DFL's potential to\nenhance portfolio performance, the detailed mechanisms of how DFL modifies\nprediction models for MVO remain unexplored. This study aims to investigate how\nDFL adjusts stock return prediction models to optimize decisions in MVO,\naddressing the question: \"MSE treats the errors of all assets equally, but how\ndoes DFL reduce errors of different assets differently?\" Answering this will\nprovide crucial insights into optimal stock return prediction for constructing\nefficient portfolios.", "paper_summary_zh": "馬可維茲透過平均數-變異數最佳化（MVO）架構奠定了投資組合理論的基礎。然而，MVO 的有效性取決於預期報酬、變異數和資產報酬的共變異數的精確估計，而這些通常是不確定的。機器學習模型在估計不確定的參數方面變得有用，並且這些模型經過訓練以最小化預測誤差，例如均方誤差（MSE），均方誤差對所有資產的預測誤差進行統一處理。最近的研究指出，這種方法會導致次優決策，並提出以決策為中心的學習（DFL）作為解決方案，整合預測和最佳化以改善決策制定成果。雖然研究已顯示 DFL 改善投資組合績效的潛力，但 DFL 如何修改 MVO 的預測模型的詳細機制仍未探討。本研究旨在探討 DFL 如何調整股票報酬預測模型以最佳化 MVO 中的決策，探討這個問題：「MSE 以相同的方式處理所有資產的誤差，但 DFL 如何以不同的方式減少不同資產的誤差？」回答這個問題將提供對最佳股票報酬預測的關鍵見解，以建構有效的投資組合。", "author": "Junhyeong Lee et.al.", "authors": "Junhyeong Lee, Inwoo Tae, Yongjae Lee", "id": "2409.09684v1", "paper_url": "http://arxiv.org/abs/2409.09684v1", "repo": "null"}}