{"2412.06769": {"publish_time": "2024-12-09", "title": "Training Large Language Models to Reason in a Continuous Latent Space", "paper_summary": "Large language models (LLMs) are restricted to reason in the \"language\nspace\", where they typically express the reasoning process with a\nchain-of-thought (CoT) to solve a complex reasoning problem. However, we argue\nthat language space may not always be optimal for reasoning. For example, most\nword tokens are primarily for textual coherence and not essential for\nreasoning, while some critical tokens require complex planning and pose huge\nchallenges to LLMs. To explore the potential of LLM reasoning in an\nunrestricted latent space instead of using natural language, we introduce a new\nparadigm Coconut (Chain of Continuous Thought). We utilize the last hidden\nstate of the LLM as a representation of the reasoning state (termed \"continuous\nthought\"). Rather than decoding this into a word token, we feed it back to the\nLLM as the subsequent input embedding directly in the continuous space.\nExperiments show that Coconut can effectively augment the LLM on several\nreasoning tasks. This novel latent reasoning paradigm leads to emergent\nadvanced reasoning patterns: the continuous thought can encode multiple\nalternative next reasoning steps, allowing the model to perform a breadth-first\nsearch (BFS) to solve the problem, rather than prematurely committing to a\nsingle deterministic path like CoT. Coconut outperforms CoT in certain logical\nreasoning tasks that require substantial backtracking during planning, with\nfewer thinking tokens during inference. These findings demonstrate the promise\nof latent reasoning and offer valuable insights for future research.", "paper_summary_zh": "大型語言模型 (LLM) 被限制在「語言空間」中推理，在語言空間中，它們通常使用思想鏈 (CoT) 來表達推理過程，以解決複雜的推理問題。然而，我們認為語言空間可能並不總是推理的最佳選擇。例如，大多數字元標記主要用於文字連貫性，而非推理的必要條件，而某些關鍵標記則需要複雜的規劃，並對 LLM 構成巨大挑戰。為了探索 LLM 在非受限潛在空間中推理的可能性，而不是使用自然語言，我們引入了一個新的範例 Coconut（連續思想鏈）。我們利用 LLM 的最後隱藏狀態作為推理狀態的表示（稱為「連續思想」）。我們並未將其解碼成字元標記，而是將其直接在連續空間中作為後續輸入嵌入回饋給 LLM。實驗表明，Coconut 可以有效地增強 LLM 在多項推理任務上的能力。這種新穎的潛在推理範例會導致出現進階推理模式：連續思想可以編碼多個備選的後續推理步驟，使模型能夠執行廣度優先搜尋 (BFS) 來解決問題，而不是像 CoT 那樣過早地承諾單一的確定性路徑。在某些邏輯推理任務中，Coconut 優於 CoT，這些任務需要在規劃過程中進行大量的回溯，推理期間的思考標記較少。這些發現證明了潛在推理的前景，並為未來的研究提供了寶貴的見解。", "author": "Shibo Hao et.al.", "authors": "Shibo Hao, Sainbayar Sukhbaatar, DiJia Su, Xian Li, Zhiting Hu, Jason Weston, Yuandong Tian", "id": "2412.06769v1", "paper_url": "http://arxiv.org/abs/2412.06769v1", "repo": "null"}}