{"2406.09688": {"publish_time": "2024-06-14", "title": "FreeCtrl: Constructing Control Centers with Feedforward Layers for Learning-Free Controllable Text Generation", "paper_summary": "Controllable text generation (CTG) seeks to craft texts adhering to specific\nattributes, traditionally employing learning-based techniques such as training,\nfine-tuning, or prefix-tuning with attribute-specific datasets. These\napproaches, while effective, demand extensive computational and data resources.\nIn contrast, some proposed learning-free alternatives circumvent learning but\noften yield inferior results, exemplifying the fundamental machine learning\ntrade-off between computational expense and model efficacy. To overcome these\nlimitations, we propose FreeCtrl, a learning-free approach that dynamically\nadjusts the weights of selected feedforward neural network (FFN) vectors to\nsteer the outputs of large language models (LLMs). FreeCtrl hinges on the\nprinciple that the weights of different FFN vectors influence the likelihood of\ndifferent tokens appearing in the output. By identifying and adaptively\nadjusting the weights of attribute-related FFN vectors, FreeCtrl can control\nthe output likelihood of attribute keywords in the generated content. Extensive\nexperiments on single- and multi-attribute control reveal that the\nlearning-free FreeCtrl outperforms other learning-free and learning-based\nmethods, successfully resolving the dilemma between learning costs and model\nperformance.", "paper_summary_zh": "可控文本生成 (CTG) 旨在生成符合特定屬性的文本，傳統上採用基於學習的技術，例如使用特定屬性的資料集進行訓練、微調或前綴微調。這些方法雖然有效，但需要大量的計算和資料資源。相比之下，一些提出的免學習替代方案避開了學習，但通常會產生較差的結果，這說明了計算成本和模型效能之間的基本機器學習權衡。為了克服這些限制，我們提出了 FreeCtrl，這是一種免學習方法，可以動態調整所選前饋神經網路 (FFN) 向量權重，以引導大型語言模型 (LLM) 的輸出。FreeCtrl 採用了一個原則，即不同 FFN 向量權重會影響輸出中出現不同記號的可能性。透過識別和適應性調整與屬性相關的 FFN 向量權重，FreeCtrl 可以控制生成內容中屬性關鍵字的輸出可能性。對單屬性和多屬性控制的廣泛實驗表明，免學習的 FreeCtrl 優於其他免學習和基於學習的方法，成功地解決了學習成本和模型效能之間的兩難困境。", "author": "Zijian Feng et.al.", "authors": "Zijian Feng, Hanzhang Zhou, Zixiao Zhu, Kezhi Mao", "id": "2406.09688v1", "paper_url": "http://arxiv.org/abs/2406.09688v1", "repo": "null"}}