{"2409.03260": {"publish_time": "2024-09-05", "title": "In Search of Trees: Decision-Tree Policy Synthesis for Black-Box Systems via Search", "paper_summary": "Decision trees, owing to their interpretability, are attractive as control\npolicies for (dynamical) systems. Unfortunately, constructing, or synthesising,\nsuch policies is a challenging task. Previous approaches do so by imitating a\nneural-network policy, approximating a tabular policy obtained via formal\nsynthesis, employing reinforcement learning, or modelling the problem as a\nmixed-integer linear program. However, these works may require access to a\nhard-to-obtain accurate policy or a formal model of the environment (within\nreach of formal synthesis), and may not provide guarantees on the quality or\nsize of the final tree policy. In contrast, we present an approach to\nsynthesise optimal decision-tree policies given a black-box environment and\nspecification, and a discretisation of the tree predicates, where optimality is\ndefined with respect to the number of steps to achieve the goal. Our approach\nis a specialised search algorithm which systematically explores the\n(exponentially large) space of decision trees under the given discretisation.\nThe key component is a novel pruning mechanism that significantly reduces the\nsearch space. Our approach represents a conceptually novel way of synthesising\nsmall decision-tree policies with optimality guarantees even for black-box\nenvironments with black-box specifications.", "paper_summary_zh": "決策樹由於其可解釋性，對於（動態）系統的控制策略而言很有吸引力。不幸的是，構建或綜合此類策略是一項具有挑戰性的任務。先前的做法是通過模仿神經網路策略、近似通過形式綜合獲得的表格策略、採用強化學習或將問題建模為混合整數線性規劃來實現的。然而，這些工作可能需要獲取難以獲得的準確策略或環境的正式模型（在形式綜合的範圍內），並且可能無法保證最終樹策略的質量或大小。相比之下，我們提出了一種在給定黑盒環境和規範以及樹謂詞離散化的情況下綜合最優決策樹策略的方法，其中最優性是根據實現目標的步驟數定義的。我們的做法是一種專門的搜尋演算法，它系統地探索給定離散化下的（指數級大的）決策樹空間。關鍵組成部分是一種新穎的剪枝機制，它顯著地減少了搜尋空間。我們的做法代表了一種概念上新穎的方式，即使對於具有黑盒規範的黑盒環境，也能綜合出具有最優性保證的小型決策樹策略。", "author": "Emir Demirović et.al.", "authors": "Emir Demirović, Christian Schilling, Anna Lukina", "id": "2409.03260v1", "paper_url": "http://arxiv.org/abs/2409.03260v1", "repo": "null"}}