{"2412.14158": {"publish_time": "2024-12-18", "title": "AKiRa: Augmentation Kit on Rays for optical video generation", "paper_summary": "Recent advances in text-conditioned video diffusion have greatly improved\nvideo quality. However, these methods offer limited or sometimes no control to\nusers on camera aspects, including dynamic camera motion, zoom, distorted lens\nand focus shifts. These motion and optical aspects are crucial for adding\ncontrollability and cinematic elements to generation frameworks, ultimately\nresulting in visual content that draws focus, enhances mood, and guides\nemotions according to filmmakers' controls. In this paper, we aim to close the\ngap between controllable video generation and camera optics. To achieve this,\nwe propose AKiRa (Augmentation Kit on Rays), a novel augmentation framework\nthat builds and trains a camera adapter with a complex camera model over an\nexisting video generation backbone. It enables fine-tuned control over camera\nmotion as well as complex optical parameters (focal length, distortion,\naperture) to achieve cinematic effects such as zoom, fisheye effect, and bokeh.\nExtensive experiments demonstrate AKiRa's effectiveness in combining and\ncomposing camera optics while outperforming all state-of-the-art methods. This\nwork sets a new landmark in controlled and optically enhanced video generation,\npaving the way for future optical video generation methods.", "paper_summary_zh": "最近在文字条件视频扩散方面取得的进展极大地改善了视频质量。然而，这些方法对用户在摄像机方面（包括动态摄像机运动、缩放、失真的镜头和焦点转换）的控制有限，有时甚至没有控制。这些运动和光学方面对于为生成框架添加可控性和电影元素至关重要，最终会产生吸引注意力、增强情绪并根据电影制作人的控制引导情绪的视觉内容。在本文中，我们旨在缩小可控视频生成和摄像机光学之间的差距。为了实现这一点，我们提出了 AKiRa（射线上的增强工具包），这是一种新颖的增强框架，它在现有的视频生成主干上构建并训练具有复杂摄像机模型的摄像机适配器。它可以对摄像机运动以及复杂的光学参数（焦距、失真、光圈）进行微调控制，以实现诸如缩放、鱼眼效果和散景等电影效果。大量的实验表明，AKiRa 在组合和合成摄像机光学方面是有效的，同时优于所有最先进的方法。这项工作在受控和光学增强视频生成方面树立了新的里程碑，为未来的光学视频生成方法铺平了道路。", "author": "Xi Wang et.al.", "authors": "Xi Wang, Robin Courant, Marc Christie, Vicky Kalogeiton", "id": "2412.14158v1", "paper_url": "http://arxiv.org/abs/2412.14158v1", "repo": "null"}}