{"2409.08580": {"publish_time": "2024-09-13", "title": "Molecular Graph Representation Learning via Structural Similarity Information", "paper_summary": "Graph Neural Networks (GNNs) have been widely employed for feature\nrepresentation learning in molecular graphs. Therefore, it is crucial to\nenhance the expressiveness of feature representation to ensure the\neffectiveness of GNNs. However, a significant portion of current research\nprimarily focuses on the structural features within individual molecules, often\noverlooking the structural similarity between molecules, which is a crucial\naspect encapsulating rich information on the relationship between molecular\nproperties and structural characteristics. Thus, these approaches fail to\ncapture the rich semantic information at the molecular structure level. To\nbridge this gap, we introduce the \\textbf{Molecular Structural Similarity Motif\nGNN (MSSM-GNN)}, a novel molecular graph representation learning method that\ncan capture structural similarity information among molecules from a global\nperspective. In particular, we propose a specially designed graph that\nleverages graph kernel algorithms to represent the similarity between molecules\nquantitatively. Subsequently, we employ GNNs to learn feature representations\nfrom molecular graphs, aiming to enhance the accuracy of property prediction by\nincorporating additional molecular representation information. Finally, through\na series of experiments conducted on both small-scale and large-scale molecular\ndatasets, we demonstrate that our model consistently outperforms eleven\nstate-of-the-art baselines. The codes are available at\nhttps://github.com/yaoyao-yaoyao-cell/MSSM-GNN.", "paper_summary_zh": "<paragraph>圖神經網路 (GNN) 已廣泛用於分子圖中的特徵表示學習。因此，增強特徵表示的表達能力對於確保 GNN 的有效性至關重要。然而，目前研究的很大一部分主要集中於個別分子內的結構特徵，常常忽略分子之間的結構相似性，而這是一個包含分子特性和結構特徵之間關係的豐富資訊的關鍵面向。因此，這些方法無法擷取分子結構層級的豐富語義資訊。為了彌補這個差距，我們引入了**分子結構相似性基序 GNN (MSSM-GNN)**，這是一種新穎的分子圖表示學習方法，可以從全局觀點擷取分子之間的結構相似性資訊。具體來說，我們提出了一個特別設計的圖，利用圖核演算法來量化表示分子之間的相似性。隨後，我們採用 GNN 從分子圖中學習特徵表示，旨在透過納入額外的分子表示資訊來提高屬性預測的準確性。最後，透過在小規模和大型分子資料集上進行一系列實驗，我們證明我們的模型始終優於十一種最先進的基準。程式碼可在 https://github.com/yaoyao-yaoyao-cell/MSSM-GNN 取得。</paragraph>", "author": "Chengyu Yao et.al.", "authors": "Chengyu Yao, Hong Huang, Hang Gao, Fengge Wu, Haiming Chen, Junsuo Zhao", "id": "2409.08580v1", "paper_url": "http://arxiv.org/abs/2409.08580v1", "repo": "https://github.com/yaoyao-yaoyao-cell/mssm-gnn"}}