{"2411.13159": {"publish_time": "2024-11-20", "title": "Hard-Synth: Synthesizing Diverse Hard Samples for ASR using Zero-Shot TTS and LLM", "paper_summary": "Text-to-speech (TTS) models have been widely adopted to enhance automatic\nspeech recognition (ASR) systems using text-only corpora, thereby reducing the\ncost of labeling real speech data. Existing research primarily utilizes\nadditional text data and predefined speech styles supported by TTS models. In\nthis paper, we propose Hard-Synth, a novel ASR data augmentation method that\nleverages large language models (LLMs) and advanced zero-shot TTS. Our approach\nemploys LLMs to generate diverse in-domain text through rewriting, without\nrelying on additional text data. Rather than using predefined speech styles, we\nintroduce a hard prompt selection method with zero-shot TTS to clone speech\nstyles that the ASR model finds challenging to recognize. Experiments\ndemonstrate that Hard-Synth significantly enhances the Conformer model,\nachieving relative word error rate (WER) reductions of 6.5\\%/4.4\\% on\nLibriSpeech dev/test-other subsets. Additionally, we show that Hard-Synth is\ndata-efficient and capable of reducing bias in ASR.", "paper_summary_zh": "文本轉語音 (TTS) 模型已被廣泛採用，以利用純文字語料庫增強自動語音辨識 (ASR) 系統，從而降低標記真實語音資料的成本。現有研究主要利用 TTS 模型支援的額外文字資料和預先定義的語音風格。在本文中，我們提出 Hard-Synth，這是一種新穎的 ASR 資料擴充方法，它利用大型語言模型 (LLM) 和進階的零次學習 TTS。我們的方法利用 LLM 透過改寫來產生多樣化的領域內文字，而不依賴額外的文字資料。我們沒有使用預先定義的語音風格，而是引進一種搭配零次學習 TTS 的硬提示選取方法，以複製 ASR 模型難以辨識的語音風格。實驗證明 Hard-Synth 大幅增強 Conformer 模型，在 LibriSpeech dev/test-other 子集中達成 6.5%/4.4% 的相對詞彙錯誤率 (WER) 降低。此外，我們證明 Hard-Synth 具有資料效率，並且能夠降低 ASR 中的偏差。", "author": "Jiawei Yu et.al.", "authors": "Jiawei Yu, Yuang Li, Xiaosong Qiao, Huan Zhao, Xiaofeng Zhao, Wei Tang, Min Zhang, Hao Yang, Jinsong Su", "id": "2411.13159v1", "paper_url": "http://arxiv.org/abs/2411.13159v1", "repo": "null"}}