{"2411.09850": {"publish_time": "2024-11-15", "title": "Enhancing Diffusion Posterior Sampling for Inverse Problems by Integrating Crafted Measurements", "paper_summary": "Diffusion models have emerged as a powerful foundation model for visual\ngeneration. With an appropriate sampling process, it can effectively serve as a\ngenerative prior to solve general inverse problems. Current posterior sampling\nbased methods take the measurement (i.e., degraded image sample) into the\nposterior sampling to infer the distribution of the target data (i.e., clean\nimage sample). However, in this manner, we show that high-frequency information\ncan be prematurely introduced during the early stages, which could induce\nlarger posterior estimate errors during the restoration sampling. To address\nthis issue, we first reveal that forming the log posterior gradient with the\nnoisy measurement ( i.e., samples from a diffusion forward process) instead of\nthe clean one can benefit the reverse process. Consequently, we propose a novel\ndiffusion posterior sampling method DPS-CM, which incorporates a Crafted\nMeasurement (i.e., samples generated by a reverse denoising process, compared\nto random sampling with noise in standard methods) to form the posterior\nestimate. This integration aims to mitigate the misalignment with the diffusion\nprior caused by cumulative posterior estimate errors. Experimental results\ndemonstrate that our approach significantly improves the overall capacity to\nsolve general and noisy inverse problems, such as Gaussian deblurring,\nsuper-resolution, inpainting, nonlinear deblurring, and tasks with Poisson\nnoise, relative to existing approaches.", "paper_summary_zh": "擴散模型已成為視覺生成的有力基礎模型。透過適當的取樣程序，它可以有效地作為生成先驗來解決一般的逆問題。當前的後驗取樣方法將測量（即退化的影像樣本）納入後驗取樣，以推斷目標資料（即乾淨的影像樣本）的分布。然而，我們在此顯示，高頻率資訊可能會在早期階段過早地被引入，這可能會在還原取樣期間導致較大的後驗估計誤差。為了解決此問題，我們首先揭示，使用有雜訊的測量（即從擴散前向過程中取樣的樣本）而不是乾淨的測量來形成對數後驗梯度，有助於反向過程。因此，我們提出了一種新的擴散後驗取樣方法 DPS-CM，它結合了精心製作的測量（即由反向去雜訊過程生成的樣本，與標準方法中的雜訊隨機取樣相比）來形成後驗估計。這種整合旨在減輕由累積後驗估計誤差引起的與擴散先驗的不一致。實驗結果表明，與現有方法相比，我們的做法顯著改善了解決一般和有雜訊的逆問題的整體能力，例如高斯去模糊、超解析度、內插、非線性去模糊，以及具有泊松雜訊的任務。", "author": "Shijie Zhou et.al.", "authors": "Shijie Zhou, Huaisheng Zhu, Rohan Sharma, Ruiyi Zhang, Kaiyi Ji, Changyou Chen", "id": "2411.09850v1", "paper_url": "http://arxiv.org/abs/2411.09850v1", "repo": "null"}}