{"2406.04820": {"publish_time": "2024-06-07", "title": "Navigating Efficiency in MobileViT through Gaussian Process on Global Architecture Factors", "paper_summary": "Numerous techniques have been meticulously designed to achieve optimal\narchitectures for convolutional neural networks (CNNs), yet a comparable focus\non vision transformers (ViTs) has been somewhat lacking. Despite the remarkable\nsuccess of ViTs in various vision tasks, their heavyweight nature presents\nchallenges of computational costs. In this paper, we leverage the Gaussian\nprocess to systematically explore the nonlinear and uncertain relationship\nbetween performance and global architecture factors of MobileViT, such as\nresolution, width, and depth including the depth of in-verted residual blocks\nand the depth of ViT blocks, and joint factors including resolution-depth and\nresolution-width. We present design principles twisting magic 4D cube of the\nglobal architecture factors that minimize model sizes and computational costs\nwith higher model accuracy. We introduce a formula for downsizing architectures\nby iteratively deriving smaller MobileViT V2, all while adhering to a specified\nconstraint of multiply-accumulate operations (MACs). Experiment results show\nthat our formula significantly outperforms CNNs and mobile ViTs across\ndiversified datasets", "paper_summary_zh": "為達成卷積神經網路 (CNN) 的最佳架構，已精心設計出許多技術，但對視覺Transformer (ViT) 的關注卻相對不足。儘管 ViT 在各種視覺任務中取得顯著的成功，但其龐大特性對運算成本構成挑戰。在本文中，我們利用高斯過程系統性地探討 MobileViT 的效能與整體架構因子之間的非線性和不確定關係，例如解析度、寬度和深度，包括反轉殘差區塊的深度和 ViT 區塊的深度，以及解析度深度和解析度寬度等聯合因子。我們提出設計原則，扭曲整體架構因子的 4D 魔術方塊，以最小化模型大小和運算成本，同時提高模型準確度。我們引入一個公式，透過反覆推導較小的 MobileViT V2 來縮小架構，同時遵守乘加運算 (MAC) 的指定限制。實驗結果顯示，我們的公式在多元化的資料集上明顯優於 CNN 和行動裝置 ViT", "author": "Ke Meng et.al.", "authors": "Ke Meng, Kai Chen", "id": "2406.04820v1", "paper_url": "http://arxiv.org/abs/2406.04820v1", "repo": "null"}}