{"2406.16536": {"publish_time": "2024-06-24", "title": "C-LLM: Learn to Check Chinese Spelling Errors Character by Character", "paper_summary": "Chinese Spell Checking (CSC) aims to detect and correct spelling errors in\nsentences. Despite Large Language Models (LLMs) exhibit robust capabilities and\nare widely applied in various tasks, their performance on CSC is often\nunsatisfactory. We find that LLMs fail to meet the Chinese character-level\nconstraints of the CSC task, namely equal length and phonetic similarity,\nleading to a performance bottleneck. Further analysis reveal that this issue\nstems from the granularity of tokenization, as current mixed character-word\ntokenization struggles to satisfy these character-level constraints. To address\nthis issue, we propose C-LLM, a Large Language Model-based Chinese Spell\nChecking method that learns to check errors Character by Character.\nCharacter-level tokenization enables the model to learn character-level\nalignment, effectively mitigating issues related to character-level\nconstraints. Furthermore, CSC is simplified to replication-dominated and\nsubstitution-supplemented tasks. Experiments on two CSC benchmarks demonstrate\nthat C-LLM achieves an average improvement of 10% over existing methods.\nSpecifically, it shows a 2.1% improvement in general scenarios and a\nsignificant 12% improvement in vertical domain scenarios, establishing\nstate-of-the-art performance. The source code can be accessed at\nhttps://github.com/ktlKTL/C-LLM.", "paper_summary_zh": "中文拼寫檢查 (CSC) 旨在偵測和修正句子中的拼寫錯誤。儘管大型語言模型 (LLM) 展現強大的功能，並廣泛應用於各種任務中，它們在 CSC 上的表現通常不盡人意。我們發現 LLM 無法滿足 CSC 任務的中文字元層級限制，即等長和音似，導致效能瓶頸。進一步的分析顯示，這個問題源於標記化的粒度，因為目前混合字元詞彙標記化難以滿足這些字元層級限制。為了解決這個問題，我們提出 C-LLM，一種基於大型語言模型的中文拼寫檢查方法，學習逐字檢查錯誤。字元層級標記化讓模型能夠學習字元層級比對，有效減輕與字元層級限制相關的問題。此外，CSC 被簡化為以複製為主的替換補充任務。在兩個 CSC 基準上的實驗證明，C-LLM 比現有方法平均提升了 10%。具體來說，它在一般場景中提升了 2.1%，在垂直領域場景中提升了顯著的 12%，建立了最先進的效能。原始碼可以在 https://github.com/ktlKTL/C-LLM 取得。", "author": "Kunting Li et.al.", "authors": "Kunting Li, Yong Hu, Liang He, Fandong Meng, Jie Zhou", "id": "2406.16536v1", "paper_url": "http://arxiv.org/abs/2406.16536v1", "repo": "https://github.com/ktlktl/c-llm"}}