{"2406.02913": {"publish_time": "2024-06-05", "title": "Zeroth-Order Fine-Tuning of LLMs with Extreme Sparsity", "paper_summary": "Zeroth-order optimization (ZO) is a memory-efficient strategy for fine-tuning\nLarge Language Models using only forward passes. However, the application of ZO\nfine-tuning in memory-constrained settings such as mobile phones and laptops is\nstill challenging since full precision forward passes are infeasible. In this\nstudy, we address this limitation by integrating sparsity and quantization into\nZO fine-tuning of LLMs. Specifically, we investigate the feasibility of\nfine-tuning an extremely small subset of LLM parameters using ZO. This approach\nallows the majority of un-tuned parameters to be quantized to accommodate the\nconstraint of limited device memory. Our findings reveal that the pre-training\nprocess can identify a set of \"sensitive parameters\" that can guide the ZO\nfine-tuning of LLMs on downstream tasks. Our results demonstrate that\nfine-tuning 0.1% sensitive parameters in the LLM with ZO can outperform the\nfull ZO fine-tuning performance, while offering wall-clock time speedup.\nAdditionally, we show that ZO fine-tuning targeting these 0.1% sensitive\nparameters, combined with 4 bit quantization, enables efficient ZO fine-tuning\nof an Llama2-7B model on a GPU device with less than 8 GiB of memory and\nnotably reduced latency.", "paper_summary_zh": "零階最佳化 (ZO) 是一種記憶體效率高的策略，用於僅使用前向傳遞來微調大型語言模型。然而，ZO 微調在記憶體受限的設定中（例如行動電話和筆電）的應用仍然具有挑戰性，因為全精度的前向傳遞不可行。在本研究中，我們透過將稀疏性和量化整合到 LLM 的 ZO 微調中來解決這個限制。具體來說，我們探討了使用 ZO 微調 LLM 極小參數子集的可行性。這種方法允許將大多數未調整的參數量化，以適應裝置記憶體有限的限制。我們的研究結果顯示，預訓練過程可以找出一個「敏感參數」集合，用於指導 LLM 在下游任務上的 ZO 微調。我們的結果證明，使用 ZO 微調 LLM 中的 0.1% 敏感參數可以優於完整的 ZO 微調效能，同時提供牆上時間加速。此外，我們表明 ZO 微調針對這些 0.1% 敏感參數，結合 4 位元量化，可以在記憶體小於 8 GiB 的 GPU 裝置上有效執行 Llama2-7B 模型的 ZO 微調，而且大幅降低延遲。", "author": "Wentao Guo et.al.", "authors": "Wentao Guo, Jikai Long, Yimeng Zeng, Zirui Liu, Xinyu Yang, Yide Ran, Jacob R. Gardner, Osbert Bastani, Christopher De Sa, Xiaodong Yu, Beidi Chen, Zhaozhuo Xu", "id": "2406.02913v1", "paper_url": "http://arxiv.org/abs/2406.02913v1", "repo": "null"}}