{"2408.11987": {"publish_time": "2024-08-21", "title": "SimBench: A Rule-Based Multi-Turn Interaction Benchmark for Evaluating an LLM's Ability to Generate Digital Twins", "paper_summary": "We introduce SimBench, a benchmark designed to evaluate the proficiency of\nstudent large language models (S-LLMs) in generating digital twins (DTs) that\ncan be used in simulators for virtual testing. Given a collection of S-LLMs,\nthis benchmark enables the ranking of the S-LLMs based on their ability to\nproduce high-quality DTs. We demonstrate this by comparing over 20 open- and\nclosed-source S-LLMs. Using multi-turn interactions, SimBench employs a\nrule-based judge LLM (J-LLM) that leverages both predefined rules and\nhuman-in-the-loop guidance to assign scores for the DTs generated by the S-LLM,\nthus providing a consistent and expert-inspired evaluation protocol. The J-LLM\nis specific to a simulator, and herein the proposed benchmarking approach is\ndemonstrated in conjunction with the Chrono multi-physics simulator. Chrono\nprovided the backdrop used to assess an S-LLM in relation to the latter's\nability to create digital twins for multibody dynamics, finite element\nanalysis, vehicle dynamics, robotic dynamics, and sensor simulations. The\nproposed benchmarking principle is broadly applicable and enables the\nassessment of an S-LLM's ability to generate digital twins for other simulation\npackages. All code and data are available at\nhttps://github.com/uwsbel/SimBench.", "paper_summary_zh": "<paragraph>我們推出 SimBench，這是一個基準，旨在評估學生大型語言模型 (S-LLM) 在產生可於模擬器中用於虛擬測試的數位雙胞胎 (DT) 時的熟練度。給定一個 S-LLM 集合，此基準能根據 S-LLM 產生高品質 DT 的能力，對 S-LLM 進行排名。我們透過比較超過 20 個開源和閉源 S-LLM 來展示這一點。SimBench 使用多輪互動，採用基於規則的評判 LLM (J-LLM)，它利用預定義規則和人機互動指導，為 S-LLM 產生的 DT 分配分數，從而提供一致且由專家啟發的評估協定。J-LLM 是特定於模擬器的，本文中建議的基準方法與 Chrono 多物理模擬器結合使用。Chrono 提供了用於評估 S-LLM 在產生多體動力學、有限元素分析、車輛動力學、機器人動力學和感測器模擬的數位雙胞胎的能力時所使用的背景。建議的基準原則具有廣泛的適用性，並能夠評估 S-LLM 為其他模擬套件產生數位雙胞胎的能力。所有程式碼和資料都可以在 https://github.com/uwsbel/SimBench 取得。</paragraph>", "author": "Jingquan Wang et.al.", "authors": "Jingquan Wang, Harry Zhang, Huzaifa Mustafa Unjhawala, Peter Negrut, Shu Wang, Khailanii Slaton, Radu Serban, Jin-Long Wu, Dan Negrut", "id": "2408.11987v1", "paper_url": "http://arxiv.org/abs/2408.11987v1", "repo": "https://github.com/uwsbel/simbench"}}