{"2406.03476": {"publish_time": "2024-06-05", "title": "Does your data spark joy? Performance gains from domain upsampling at the end of training", "paper_summary": "Pretraining datasets for large language models (LLMs) have grown to trillions\nof tokens composed of large amounts of CommonCrawl (CC) web scrape along with\nsmaller, domain-specific datasets. It is expensive to understand the impact of\nthese domain-specific datasets on model capabilities as training at large FLOP\nscales is required to reveal significant changes to difficult and emergent\nbenchmarks. Given the increasing cost of experimenting with pretraining data,\nhow does one determine the optimal balance between the diversity in general web\nscrapes and the information density of domain specific data? In this work, we\nshow how to leverage the smaller domain specific datasets by upsampling them\nrelative to CC at the end of training to drive performance improvements on\ndifficult benchmarks. This simple technique allows us to improve up to 6.90 pp\non MMLU, 8.26 pp on GSM8K, and 6.17 pp on HumanEval relative to the base data\nmix for a 7B model trained for 1 trillion (T) tokens, thus rivaling Llama-2\n(7B)$\\unicode{x2014}$a model trained for twice as long. We experiment with\nablating the duration of domain upsampling from 5% to 30% of training and find\nthat 10% to 20% percent is optimal for navigating the tradeoff between general\nlanguage modeling capabilities and targeted benchmarks. We also use domain\nupsampling to characterize at scale the utility of individual datasets for\nimproving various benchmarks by removing them during this final phase of\ntraining. This tool opens up the ability to experiment with the impact of\ndifferent pretraining datasets at scale, but at an order of magnitude lower\ncost compared to full pretraining runs.", "paper_summary_zh": "大型语言模型 (LLM) 的预训练数据集已增长到数万亿个标记，其中包含大量 CommonCrawl (CC) 网络抓取，以及较小的特定领域数据集。了解这些特定领域数据集对模型功能的影响代价高昂，因为需要在大规模浮点运算 (FLOP) 范围内进行训练才能揭示对困难和新兴基准的重大变化。鉴于对预训练数据进行实验的成本越来越高，如何确定通用网络抓取的多样性与特定领域数据的的信息密度之间的最佳平衡？在这项工作中，我们展示了如何通过在训练结束时相对于 CC 对较小的特定领域数据集进行上采样来提高其利用率，从而提高困难基准的性能。这种简单的技术使我们能够在针对 1 万亿 (T) 个标记训练的 7B 模型上，相对于基本数据组合，在 MMLU 上提高高达 6.90 pp，在 GSM8K 上提高 8.26 pp，在 HumanEval 上提高 6.17 pp，从而与 Llama-2 (7B) 相媲美——一个训练时间长达两倍的模型。我们尝试从训练的 5% 到 30% 减少领域上采样的持续时间，并发现 10% 到 20% 是在通用语言建模功能和目标基准之间进行权衡的最佳选择。我们还使用领域上采样来大规模表征各个数据集在训练的最后阶段通过删除它们来改善各种基准的效用。此工具开启了以较低数量级成本（与完整的预训练运行相比）大规模试验不同预训练数据集影响的能力。", "author": "Cody Blakeney et.al.", "authors": "Cody Blakeney, Mansheej Paul, Brett W. Larsen, Sean Owen, Jonathan Frankle", "id": "2406.03476v1", "paper_url": "http://arxiv.org/abs/2406.03476v1", "repo": "null"}}