{"2406.02333": {"publish_time": "2024-06-04", "title": "Towards Neural Architecture Search for Transfer Learning in 6G Networks", "paper_summary": "The future 6G network is envisioned to be AI-native, and as such, ML models\nwill be pervasive in support of optimizing performance, reducing energy\nconsumption, and in coping with increasing complexity and heterogeneity. A key\nchallenge is automating the process of finding optimal model architectures\nsatisfying stringent requirements stemming from varying tasks, dynamicity and\navailable resources in the infrastructure and deployment positions. In this\npaper, we describe and review the state-of-the-art in Neural Architecture\nSearch and Transfer Learning and their applicability in networking. Further, we\nidentify open research challenges and set directions with a specific focus on\nthree main requirements with elements unique to the future network, namely\ncombining NAS and TL, multi-objective search, and tabular data. Finally, we\noutline and discuss both near-term and long-term work ahead.", "paper_summary_zh": "預計未來的 6G 網路將以 AI 為基礎，因此機器學習模型將普遍用於支援效能最佳化、降低能源消耗，並因應日益增加的複雜性和異質性。一項關鍵挑戰在於自動化尋找最佳模型架構的程序，以滿足來自基礎架構和部署位置中不同任務、動態性和可用資源所產生的嚴格需求。在本文中，我們描述並回顧神經架構搜尋和遷移學習的最新進展，以及它們在網路中的適用性。此外，我們找出開放的研究挑戰，並針對三個主要需求設定方向，其中包含未來網路獨有的元素，即結合 NAS 和 TL、多目標搜尋和表格資料。最後，我們概述並討論近期和長期的工作進程。", "author": "Adam Orucu et.al.", "authors": "Adam Orucu, Farnaz Moradi, Masoumeh Ebrahimi, Andreas Johnsson", "id": "2406.02333v1", "paper_url": "http://arxiv.org/abs/2406.02333v1", "repo": "null"}}