{"2406.18403": {"publish_time": "2024-06-26", "title": "LLMs instead of Human Judges? A Large Scale Empirical Study across 20 NLP Evaluation Tasks", "paper_summary": "There is an increasing trend towards evaluating NLP models with LLM-generated\njudgments instead of human judgments. In the absence of a comparison against\nhuman data, this raises concerns about the validity of these evaluations; in\ncase they are conducted with proprietary models, this also raises concerns over\nreproducibility. We provide JUDGE-BENCH, a collection of 20 NLP datasets with\nhuman annotations, and comprehensively evaluate 11 current LLMs, covering both\nopen-weight and proprietary models, for their ability to replicate the\nannotations. Our evaluations show that each LLM exhibits a large variance\nacross datasets in its correlation to human judgments. We conclude that LLMs\nare not yet ready to systematically replace human judges in NLP.", "paper_summary_zh": "NLP 模型評估的趨勢正朝著使用 LLM 生成的判斷，而非人類判斷的方向前進。在沒有與人類資料進行比較的情況下，這引發了對這些評估的有效性之疑慮；在使用專有模型進行評估時，這也引發了對可複製性的疑慮。我們提供了 JUDGE-BENCH，這是一個包含 20 個帶有人類註解的 NLP 資料集的集合，並全面評估了 11 個現有的 LLM，涵蓋開放權重和專有模型，以了解它們複製註解的能力。我們的評估顯示，每個 LLM 在與人類判斷的相關性上，在不同資料集之間都展現出很大的差異。我們得出的結論是，LLM 尚未準備好系統性地取代 NLP 中的人類評審。", "author": "Anna Bavaresco et.al.", "authors": "Anna Bavaresco, Raffaella Bernardi, Leonardo Bertolazzi, Desmond Elliott, Raquel Fernández, Albert Gatt, Esam Ghaleb, Mario Giulianelli, Michael Hanna, Alexander Koller, André F. T. Martins, Philipp Mondorf, Vera Neplenbroek, Sandro Pezzelle, Barbara Plank, David Schlangen, Alessandro Suglia, Aditya K Surikuchi, Ece Takmaz, Alberto Testoni", "id": "2406.18403v1", "paper_url": "http://arxiv.org/abs/2406.18403v1", "repo": "null"}}