{"2412.18440": {"publish_time": "2024-12-24", "title": "Unlocking the Potential of Multiple BERT Models for Bangla Question Answering in NCTB Textbooks", "paper_summary": "Evaluating text comprehension in educational settings is critical for\nunderstanding student performance and improving curricular effectiveness. This\nstudy investigates the capability of state-of-the-art language models-RoBERTa\nBase, Bangla-BERT, and BERT Base-in automatically assessing Bangla\npassage-based question-answering from the National Curriculum and Textbook\nBoard (NCTB) textbooks for classes 6-10. A dataset of approximately 3,000\nBangla passage-based question-answering instances was compiled, and the models\nwere evaluated using F1 Score and Exact Match (EM) metrics across various\nhyperparameter configurations. Our findings revealed that Bangla-BERT\nconsistently outperformed the other models, achieving the highest F1 (0.75) and\nEM (0.53) scores, particularly with smaller batch sizes, the inclusion of stop\nwords, and a moderate learning rate. In contrast, RoBERTa Base demonstrated the\nweakest performance, with the lowest F1 (0.19) and EM (0.27) scores under\ncertain configurations. The results underscore the importance of fine-tuning\nhyperparameters for optimizing model performance and highlight the potential of\nmachine learning models in evaluating text comprehension in educational\ncontexts. However, limitations such as dataset size, spelling inconsistencies,\nand computational constraints emphasize the need for further research to\nenhance the robustness and applicability of these models. This study lays the\ngroundwork for the future development of automated evaluation systems in\neducational institutions, providing critical insights into model performance in\nthe context of Bangla text comprehension.", "paper_summary_zh": "<paragraph>評估教育環境中的文本理解力對於了解學生表現和改善課程成效至關重要。本研究探討了最先進的語言模型 RoBERTa Base、Bangla-BERT 和 BERT Base 在自動評估國家課程和教科書委員會 (NCTB) 6-10 年級教科書中的孟加拉語段落式問答的能力。編制了一個包含大約 3,000 個孟加拉語段落式問答實例的資料集，並使用 F1 分數和完全匹配 (EM) 指標在各種超參數配置中評估模型。我們的研究結果顯示，Bangla-BERT 持續優於其他模型，獲得了最高的 F1（0.75）和 EM（0.53）分數，特別是在批次大小較小、包含停用詞和適度的學習率時。相比之下，RoBERTa Base 的表現最差，在某些配置下獲得了最低的 F1（0.19）和 EM（0.27）分數。這些結果強調了微調超參數以最佳化模型效能的重要性，並突顯了機器學習模型在評估教育環境中的文本理解力的潛力。然而，資料集大小、拼寫不一致和計算限制等限制強調了進一步研究以增強這些模型的穩健性和適用性的必要性。本研究為教育機構中自動化評估系統的未來發展奠定了基礎，提供了孟加拉語文本理解語境中模型效能的重要見解。</paragraph>", "author": "Abdullah Khondoker et.al.", "authors": "Abdullah Khondoker, Enam Ahmed Taufik, Md Iftekhar Islam Tashik, S M Ishtiak mahmud, Antara Firoz Parsa", "id": "2412.18440v1", "paper_url": "http://arxiv.org/abs/2412.18440v1", "repo": "null"}}