{"2408.06266": {"publish_time": "2024-08-12", "title": "Anchored Preference Optimization and Contrastive Revisions: Addressing Underspecification in Alignment", "paper_summary": "Large Language Models (LLMs) are often aligned using contrastive alignment\nobjectives and preference pair datasets. The interaction between model, paired\ndata, and objective makes alignment a complicated procedure, sometimes\nproducing subpar results. We study this and find that (i) preference data gives\na better learning signal when the underlying responses are contrastive, and\n(ii) alignment objectives lead to better performance when they specify more\ncontrol over the model during training. Based on these insights, we introduce\nContrastive Learning from AI Revisions (CLAIR), a data-creation method which\nleads to more contrastive preference pairs, and Anchored Preference\nOptimization (APO), a controllable and more stable alignment objective. We\nalign Llama-3-8B-Instruct using various comparable datasets and alignment\nobjectives and measure MixEval-Hard scores, which correlate highly with human\njudgments. The CLAIR preferences lead to the strongest performance out of all\ndatasets, and APO consistently outperforms less controllable objectives. Our\nbest model, trained on 32K CLAIR preferences with APO, improves\nLlama-3-8B-Instruct by 7.65%, closing the gap with GPT4-turbo by 45%. Our code\nis available at https://github.com/ContextualAI/CLAIR_and_APO.", "paper_summary_zh": "大型語言模型 (LLM) 通常使用對比式比對目標和偏好配對資料集來對齊。模型、配對資料和目標之間的互動使對齊成為一個複雜的程序，有時會產生次佳結果。我們研究了這一點，發現 (i) 當基礎回應具有對比性時，偏好資料會提供更好的學習訊號，以及 (ii) 對齊目標會在訓練期間對模型有更多控制時帶來更好的效能。根據這些見解，我們引入了 AI 修訂對比學習 (CLAIR)，這是一種資料建立方法，可產生更多對比偏好配對，以及錨定偏好最佳化 (APO)，這是一種可控且更穩定的對齊目標。我們使用各種可比較的資料集和對齊目標來對齊 Llama-3-8B-Instruct，並測量與人類判斷高度相關的 MixEval-Hard 分數。在所有資料集中，CLAIR 偏好帶來最強的效能，而 APO 則始終優於可控性較低的目標。我們在 32K CLAIR 偏好上訓練的最佳模型，使用 APO，將 Llama-3-8B-Instruct 提升了 7.65%，將與 GPT4-turbo 的差距縮小了 45%。我們的程式碼可在 https://github.com/ContextualAI/CLAIR_and_APO 取得。", "author": "Karel D'Oosterlinck et.al.", "authors": "Karel D'Oosterlinck, Winnie Xu, Chris Develder, Thomas Demeester, Amanpreet Singh, Christopher Potts, Douwe Kiela, Shikib Mehri", "id": "2408.06266v1", "paper_url": "http://arxiv.org/abs/2408.06266v1", "repo": "null"}}