{"2407.12500": {"publish_time": "2024-07-17", "title": "Automate or Assist? The Role of Computational Models in Identifying Gendered Discourse in US Capital Trial Transcripts", "paper_summary": "The language used by US courtroom actors in criminal trials has long been\nstudied for biases. However, systematic studies for bias in high-stakes court\ntrials have been difficult, due to the nuanced nature of bias and the legal\nexpertise required. New large language models offer the possibility to automate\nannotation, saving time and cost. But validating these approaches requires both\nhigh quantitative performance as well as an understanding of how automated\nmethods fit in existing workflows, and what they really offer. In this paper we\npresent a case study of adding an automated system to a complex and high-stakes\nproblem: identifying gender-biased language in US capital trials for women\ndefendants. Our team of experienced death-penalty lawyers and NLP technologists\npursued a three-phase study: first annotating manually, then training and\nevaluating computational models, and finally comparing human annotations to\nmodel predictions. Unlike many typical NLP tasks, annotating for gender bias in\nmonths-long capital trials was a complicated task that involves with many\nindividual judgment calls. In contrast to standard arguments for automation\nthat are based on efficiency and scalability, legal experts found the\ncomputational models most useful in challenging their personal bias in\nannotation and providing opportunities to refine and build consensus on rules\nfor annotation. This suggests that seeking to replace experts with\ncomputational models is both unrealistic and undesirable. Rather, computational\nmodels offer valuable opportunities to assist the legal experts in\nannotation-based studies.", "paper_summary_zh": "美國法庭演員在刑事審判中所使用的語言長期以來一直被研究其偏見。然而，由於偏見的微妙性質和所需的法律專業知識，很難對高風險法庭審判中的偏見進行系統性研究。新的大型語言模型提供了自動化註解的可能性，節省了時間和成本。但是，驗證這些方法既需要高質量的定量表現，也需要了解自動化方法如何融入現有的工作流程以及它們真正提供的內容。在本文中，我們提出了將自動化系統添加到一個複雜且高風險的問題中的案例研究：識別美國死刑審判中針對女性被告的性別偏見語言。我們經驗豐富的死刑律師和 NLP 技術人員組成的團隊進行了一項三階段研究：首先手動註解，然後訓練和評估計算模型，最後將人工註解與模型預測進行比較。與許多典型的 NLP 任務不同，在為期數月的死刑審判中註解性別偏見是一項複雜的任務，涉及許多個人的判斷。與基於效率和可擴展性的標準自動化論點相反，法律專家發現計算模型在挑戰他們在註解中的個人偏見以及提供機會來完善和就註解規則達成共識方面最有幫助。這表明尋求用計算模型取代專家既不現實也不可取。相反，計算模型為法律專家提供有價值的機會，以協助基於註解的研究。", "author": "Andrea W Wen-Yi et.al.", "authors": "Andrea W Wen-Yi, Kathryn Adamson, Nathalie Greenfield, Rachel Goldberg, Sandra Babcock, David Mimno, Allison Koenecke", "id": "2407.12500v1", "paper_url": "http://arxiv.org/abs/2407.12500v1", "repo": "null"}}