{"2412.02427": {"publish_time": "2024-12-03", "title": "GerPS-Compare: Comparing NER methods for legal norm analysis", "paper_summary": "We apply NER to a particular sub-genre of legal texts in German: the genre of\nlegal norms regulating administrative processes in public service\nadministration. The analysis of such texts involves identifying stretches of\ntext that instantiate one of ten classes identified by public service\nadministration professionals. We investigate and compare three methods for\nperforming Named Entity Recognition (NER) to detect these classes: a Rule-based\nsystem, deep discriminative models, and a deep generative model. Our results\nshow that Deep Discriminative models outperform both the Rule-based system as\nwell as the Deep Generative model, the latter two roughly performing equally\nwell, outperforming each other in different classes. The main cause for this\nsomewhat surprising result is arguably the fact that the classes used in the\nanalysis are semantically and syntactically heterogeneous, in contrast to the\nclasses used in more standard NER tasks. Deep Discriminative models appear to\nbe better equipped for dealing with this heterogenerity than both generic LLMs\nand human linguists designing rule-based NER systems.", "paper_summary_zh": "我們將 NER 應用於德語中的一個特定法律文本子類型：公務行政中規範行政程序的法律規範類型。此類文本的分析涉及識別由公務行政專業人員識別的十個類別之一的文本範圍。我們研究並比較了三種執行命名實體識別 (NER) 以檢測這些類別的方法：基於規則的系統、深度判別模型和深度生成模型。我們的結果表明，深度判別模型優於基於規則的系統和深度生成模型，後兩者表現大致相同，在不同的類別中表現優於對方。這個有點令人驚訝的結果的主要原因可能是用於分析的類別在語義和句法上是異質的，這與用於更標準的 NER 任務的類別形成對比。與設計基於規則的 NER 系統的一般 LLM 和人類語言學家相比，深度判別模型似乎更適合處理這種異質性。", "author": "Sarah T. Bachinger et.al.", "authors": "Sarah T. Bachinger, Christoph Unger, Robin Erd, Leila Feddoul, Clara Lachenmaier, Sina Zarrieß, Birgitta König-Ries", "id": "2412.02427v1", "paper_url": "http://arxiv.org/abs/2412.02427v1", "repo": "null"}}