{"2406.14192": {"publish_time": "2024-06-20", "title": "Timo: Towards Better Temporal Reasoning for Language Models", "paper_summary": "Reasoning about time is essential for Large Language Models (LLMs) to\nunderstand the world. Previous works focus on solving specific tasks, primarily\non time-sensitive question answering. While these methods have proven\neffective, they cannot generalize to a wider spectrum of temporal reasoning\ntasks. Therefore, we propose a crucial question: Can we build a universal\nframework to handle a variety of temporal reasoning tasks? To that end, we\nsystematically study 38 temporal reasoning tasks. Based on the observation that\n19 tasks are directly related to mathematics, we first leverage the available\nmathematical dataset to set a solid foundation for temporal reasoning. However,\nthe in-depth study indicates that focusing solely on mathematical enhancement\nfalls short of addressing pure temporal reasoning tasks. To mitigate this\nlimitation, we propose a simple but effective self-critic temporal optimization\nmethod to enhance the model's temporal reasoning capabilities without\nsacrificing general task abilities. Finally, we develop Timo, a model designed\nto excel in temporal reasoning at the 7B and 13B scales. Notably, Timo\noutperforms the counterpart LLMs by 10.0 and 7.6 in average accuracy scores and\nachieves the new state-of-the-art (SOTA) performance of comparable size.\nExtensive experiments further validate our framework's effectiveness and its\ngeneralization across diverse temporal tasks. The code is available at\nhttps://github.com/zhaochen0110/Timo.", "paper_summary_zh": "對於大型語言模型（LLM）來說，時間推理對於理解世界至關重要。先前的研究專注於解決特定任務，主要是時間敏感問題解答。雖然這些方法已被證明有效，但它們無法推廣到更廣泛的時間推理任務。因此，我們提出了一個關鍵問題：我們可以建立一個通用框架來處理各種時間推理任務嗎？為此，我們系統性地研究了 38 項時間推理任務。根據 19 項任務與數學直接相關的觀察，我們首先利用現有的數學資料集為時間推理奠定堅實的基礎。然而，深入研究表明，僅專注於數學強化並不足以解決純粹的時間推理任務。為了減輕這種限制，我們提出了一種簡單但有效的方法，即自我批判時間優化方法，以增強模型的時間推理能力，同時不犧牲一般任務能力。最後，我們開發了 Timo，這是一個旨在在 7B 和 13B 規模上優於時間推理的模型。值得注意的是，Timo 在平均準確度得分上比對應的 LLM 高出 10.0 和 7.6，並達到了同等規模的最新技術（SOTA）效能。廣泛的實驗進一步驗證了我們框架的有效性和其在不同時間任務中的泛化能力。程式碼可在 https://github.com/zhaochen0110/Timo 取得。", "author": "Zhaochen Su et.al.", "authors": "Zhaochen Su, Jun Zhang, Tong Zhu, Xiaoye Qu, Juntao Li, Min Zhang, Yu Cheng", "id": "2406.14192v1", "paper_url": "http://arxiv.org/abs/2406.14192v1", "repo": "https://github.com/zhaochen0110/timo"}}