{"2411.03964": {"publish_time": "2024-11-06", "title": "What Really is Commonsense Knowledge?", "paper_summary": "Commonsense datasets have been well developed in Natural Language Processing,\nmainly through crowdsource human annotation. However, there are debates on the\ngenuineness of commonsense reasoning benchmarks. In specific, a significant\nportion of instances in some commonsense benchmarks do not concern commonsense\nknowledge. That problem would undermine the measurement of the true commonsense\nreasoning ability of evaluated models. It is also suggested that the problem\noriginated from a blurry concept of commonsense knowledge, as distinguished\nfrom other types of knowledge. To demystify all of the above claims, in this\nstudy, we survey existing definitions of commonsense knowledge, ground into the\nthree frameworks for defining concepts, and consolidate them into a\nmulti-framework unified definition of commonsense knowledge (so-called\nconsolidated definition). We then use the consolidated definition for\nannotations and experiments on the CommonsenseQA and CommonsenseQA 2.0 datasets\nto examine the above claims. Our study shows that there exists a large portion\nof non-commonsense-knowledge instances in the two datasets, and a large\nperformance gap on these two subsets where Large Language Models (LLMs) perform\nworse on commonsense-knowledge instances.", "paper_summary_zh": "常识数据集在自然语言处理中得到很好的发展，主要是通过众包人工注释。然而，关于常识推理基准的真实性存在争论。具体来说，一些常识基准中的大量实例并不涉及常识知识。该问题将损害对评估模型的真实常识推理能力的衡量。还提出，该问题源于对常识知识的模糊概念，与其他类型的知识相区别。为了揭开上述所有说法的神秘面纱，在本研究中，我们调查了常识知识的现有定义，将其归纳为定义概念的三个框架，并将它们整合到常识知识的多框架统一定义中（即所谓的综合定义）。然后，我们对 CommonsenseQA 和 CommonsenseQA 2.0 数据集使用综合定义进行注释和实验，以检验上述说法。我们的研究表明，这两个数据集中存在大量的非常识知识实例，并且在这两个子集上存在较大的性能差距，其中大型语言模型 (LLM) 在常识知识实例上的表现较差。", "author": "Quyet V. Do et.al.", "authors": "Quyet V. Do, Junze Li, Tung-Duong Vuong, Zhaowei Wang, Yangqiu Song, Xiaojuan Ma", "id": "2411.03964v1", "paper_url": "http://arxiv.org/abs/2411.03964v1", "repo": "null"}}