{"2411.09400": {"publish_time": "2024-11-14", "title": "Imagined Speech and Visual Imagery as Intuitive Paradigms for Brain-Computer Interfaces", "paper_summary": "Recent advancements in brain-computer interface (BCI) technology have\nemphasized the promise of imagined speech and visual imagery as effective\nparadigms for intuitive communication. This study investigates the\nclassification performance and brain connectivity patterns associated with\nthese paradigms, focusing on decoding accuracy across selected word classes.\nSixteen participants engaged in tasks involving thirteen imagined speech and\nvisual imagery classes, revealing above-chance classification accuracy for both\nparadigms. Variability in classification accuracy across individual classes\nhighlights the influence of sensory and motor associations in imagined speech\nand vivid visual associations in visual imagery. Connectivity analysis further\ndemonstrated increased functional connectivity in language-related and sensory\nregions for imagined speech, whereas visual imagery activated spatial and\nvisual processing networks. These findings suggest the potential of imagined\nspeech and visual imagery as an intuitive and scalable paradigm for BCI\ncommunication when selecting optimal word classes. Further exploration of the\ndecoding outcomes for these two paradigms could provide insights for practical\nBCI communication.", "paper_summary_zh": "腦機介面 (BCI) 技術的最新進展\n強調了想像語言和視覺意象作為直覺溝通的有效典範。本研究探討了與這些典範相關的分類效能和腦部連結模式，專注於解碼特定字詞類別的準確度。十六位參與者參與了包含十三種想像語言和視覺意象類別的任務，揭露了兩種典範皆高於隨機的分類準確度。不同類別的分類準確度變異性突顯了感覺和運動關聯對想像語言的影響，以及視覺意象中生動的視覺關聯。連接性分析進一步證明了想像語言的語言相關和感覺區域功能連接性增加，而視覺意象則活化了空間和視覺處理網路。這些發現表明想像語言和視覺意象具有潛力，可用於選擇最佳字詞類別時，作為 BCI 溝通的直覺且可擴充的典範。進一步探討這兩種典範的解碼結果，可以為實務上的 BCI 溝通提供見解。", "author": "Seo-Hyun Lee et.al.", "authors": "Seo-Hyun Lee, Ji-Ha Park, Deok-Seon Kim", "id": "2411.09400v1", "paper_url": "http://arxiv.org/abs/2411.09400v1", "repo": "null"}}