{"2501.18365": {"publish_time": "2025-01-30", "title": "RbFT: Robust Fine-tuning for Retrieval-Augmented Generation against Retrieval Defects", "paper_summary": "Retrieval-augmented generation (RAG) enhances large language models (LLMs) by\nintegrating external knowledge retrieved from a knowledge base. However, its\neffectiveness is fundamentally constrained by the reliability of both the\nretriever and the knowledge base. In real-world scenarios, imperfections in\nthese components often lead to the retrieval of noisy, irrelevant, or\nmisleading counterfactual information, ultimately undermining the\ntrustworthiness of RAG systems. To address this challenge, we propose Robust\nFine-Tuning (RbFT), a method designed to enhance the resilience of LLMs against\nretrieval defects through two targeted fine-tuning tasks. Experimental results\ndemonstrate that RbFT significantly improves the robustness of RAG systems\nacross diverse retrieval conditions, surpassing existing methods while\nmaintaining high inference efficiency and compatibility with other robustness\ntechniques.", "paper_summary_zh": "檢索增強生成 (RAG) 整合從知識庫中檢索到的外部知識，增強大型語言模型 (LLM)。然而，其有效性基本上受到檢索器和知識庫可靠性的限制。在實際情況中，這些組件的不完善經常導致檢索到有雜訊、不相關或誤導性的反事實資訊，最終損害 RAG 系統的可信度。為了應對此挑戰，我們提出穩健微調 (RbFT)，這是一種方法，旨在透過兩個目標微調任務來增強 LLM 抵抗檢索缺陷的韌性。實驗結果證明，RbFT 大幅提升 RAG 系統在各種檢索條件下的穩健性，超越現有方法，同時維持高推論效率，且與其他穩健性技術相容。", "author": "Yiteng Tu et.al.", "authors": "Yiteng Tu, Weihang Su, Yujia Zhou, Yiqun Liu, Qingyao Ai", "id": "2501.18365v1", "paper_url": "http://arxiv.org/abs/2501.18365v1", "repo": "https://github.com/StibiumT16/Robust-Fine-tuning"}}