{"2412.09859": {"publish_time": "2024-12-13", "title": "Financial Sentiment Analysis: Leveraging Actual and Synthetic Data for Supervised Fine-tuning", "paper_summary": "The Efficient Market Hypothesis (EMH) highlights the essence of financial\nnews in stock price movement. Financial news comes in the form of corporate\nannouncements, news titles, and other forms of digital text. The generation of\ninsights from financial news can be done with sentiment analysis.\nGeneral-purpose language models are too general for sentiment analysis in\nfinance. Curated labeled data for fine-tuning general-purpose language models\nare scare, and existing fine-tuned models for sentiment analysis in finance do\nnot capture the maximum context width. We hypothesize that using actual and\nsynthetic data can improve performance. We introduce BertNSP-finance to\nconcatenate shorter financial sentences into longer financial sentences, and\nfinbert-lc to determine sentiment from digital text. The results show improved\nperformance on the accuracy and the f1 score for the financial phrasebank data\nwith $50\\%$ and $100\\%$ agreement levels.", "paper_summary_zh": "有效市場假設 (EMH) 強調了財經新聞在股價變動中的精髓。財經新聞以公司公告、新聞標題和其他形式的數位文字呈現。從財經新聞中產生見解可以使用情緒分析來完成。\n通用語言模型對於財務中的情緒分析來說過於通用。用於微調通用語言模型的精選標籤數據很稀少，而現有的用於財務情緒分析的微調模型無法捕捉最大的上下文寬度。我們假設使用實際和合成數據可以提高性能。我們引入 BertNSP-finance 將較短的財務句子串聯成較長的財務句子，以及 finbert-lc 從數位文字中確定情緒。結果顯示在準確性和 f1 分數上改進了財務詞彙庫數據的表現，同意程度為 50% 和 100%。", "author": "Abraham Atsiwo et.al.", "authors": "Abraham Atsiwo", "id": "2412.09859v1", "paper_url": "http://arxiv.org/abs/2412.09859v1", "repo": "null"}}