{"2503.15990": {"publish_time": "2025-03-20", "title": "ECKGBench: Benchmarking Large Language Models in E-commerce Leveraging Knowledge Graph", "paper_summary": "Large language models (LLMs) have demonstrated their capabilities across\nvarious NLP tasks. Their potential in e-commerce is also substantial, evidenced\nby practical implementations such as platform search, personalized\nrecommendations, and customer service. One primary concern associated with LLMs\nis their factuality (e.g., hallucination), which is urgent in e-commerce due to\nits significant impact on user experience and revenue. Despite some methods\nproposed to evaluate LLMs' factuality, issues such as lack of reliability, high\nconsumption, and lack of domain expertise leave a gap between effective\nassessment in e-commerce. To bridge the evaluation gap, we propose ECKGBench, a\ndataset specifically designed to evaluate the capacities of LLMs in e-commerce\nknowledge. Specifically, we adopt a standardized workflow to automatically\ngenerate questions based on a large-scale knowledge graph, guaranteeing\nsufficient reliability. We employ the simple question-answering paradigm,\nsubstantially improving the evaluation efficiency by the least input and output\ntokens. Furthermore, we inject abundant e-commerce expertise in each evaluation\nstage, including human annotation, prompt design, negative sampling, and\nverification. Besides, we explore the LLMs' knowledge boundaries in e-commerce\nfrom a novel perspective. Through comprehensive evaluations of several advanced\nLLMs on ECKGBench, we provide meticulous analysis and insights into leveraging\nLLMs for e-commerce.", "paper_summary_zh": "大型語言模型 (LLM) 已在各種自然語言處理任務中展現其能力。它們在電子商務領域的潛力也很大，平台搜尋、個人化推薦和客戶服務等實際應用就是明證。與 LLM 相關的一個主要問題是它們的真實性（例如，幻覺），這在電子商務中很緊迫，因為它會對用戶體驗和收入產生重大影響。儘管已提出一些評估 LLM 真實性的方法，但可靠性不足、高耗能以及缺乏領域專業知識等問題，使得電子商務的有效評估仍存在差距。為了彌合評估差距，我們提出了 ECKGBench，這是一個專門設計用於評估 LLM 在電子商務知識方面能力的數據集。具體來說，我們採用標準化工作流程，根據大規模知識圖譜自動生成問題，以確保足夠的可靠性。我們採用簡單的問答模式，透過最少的輸入和輸出token來大幅提高評估效率。此外，我們在每個評估階段都注入了豐富的電子商務專業知識，包括人工標記、提示設計、負採樣和驗證。此外，我們還從一個新的角度探索了 LLM 在電子商務中的知識邊界。透過對 ECKGBench 上幾個先進 LLM 的全面評估，我們提供了對利用 LLM 進行電子商務的詳細分析和見解。\n", "author": "Langming Liu et.al.", "authors": "Langming Liu, Haibin Chen, Yuhao Wang, Yujin Yuan, Shilei Liu, Wenbo Su, Xiangyu Zhao, Bo Zheng", "id": "2503.15990v1", "paper_url": "http://arxiv.org/abs/2503.15990v1", "repo": "null"}}