{"2405.15230": {"publish_time": "2024-05-24", "title": "$i$REPO: $i$mplicit Reward Pairwise Difference based Empirical Preference Optimization", "paper_summary": "While astonishingly capable, large Language Models (LLM) can sometimes\nproduce outputs that deviate from human expectations. Such deviations\nnecessitate an alignment phase to prevent disseminating untruthful, toxic, or\nbiased information. Traditional alignment methods based on reinforcement\nlearning often struggle with the identified instability, whereas preference\noptimization methods are limited by their overfitting to pre-collected\nhard-label datasets. In this paper, we propose a novel LLM alignment framework\nnamed $i$REPO, which utilizes implicit Reward pairwise difference regression\nfor Empirical Preference Optimization. Particularly, $i$REPO employs\nself-generated datasets labelled by empirical human (or AI annotator)\npreference to iteratively refine the aligned policy through a novel\nregression-based loss function. Furthermore, we introduce an innovative\nalgorithm backed by theoretical guarantees for achieving optimal results under\nideal assumptions and providing a practical performance-gap result without such\nassumptions. Experimental results with Phi-2 and Mistral-7B demonstrate that\n$i$REPO effectively achieves self-alignment using soft-label, self-generated\nresponses and the logit of empirical AI annotators. Furthermore, our approach\nsurpasses preference optimization baselines in evaluations using the Language\nModel Evaluation Harness and Multi-turn benchmarks.", "paper_summary_zh": "儘管大型語言模型 (LLM) 具有驚人的能力，但有時仍會產生偏離人類預期的輸出。此類偏差需要校準階段才能防止散布不實、有害或有偏見的資訊。傳統的校準方法基於強化學習，通常難以處理已識別的不穩定性，而偏好最佳化方法則受限於過度擬合預先收集的硬標籤資料集。在本文中，我們提出一個名為 $i$REPO 的新型 LLM 校準架構，它利用隱式獎勵成對差異回歸進行經驗偏好最佳化。特別是，$i$REPO 使用由經驗人類（或 AI 標註員）偏好標籤的自生資料集，透過新型的基於回歸的損失函數反覆優化校準政策。此外，我們引入一種創新的演算法，並提供理論保證，可在理想假設下達成最佳結果，並在沒有此類假設的情況下提供實際的效能差距結果。使用 Phi-2 和 Mistral-7B 的實驗結果證明，$i$REPO 有效地使用軟標籤、自生回應和經驗 AI 標註員的 logit 達到自我校準。此外，我們的做法在使用語言模型評估工具和多輪基準進行評估時，超越了偏好最佳化基準。", "author": "Long Tan Le et.al.", "authors": "Long Tan Le, Han Shu, Tung-Anh Nguyen, Choong Seon Hong, Nguyen H. Tran", "id": "2405.15230v1", "paper_url": "http://arxiv.org/abs/2405.15230v1", "repo": "null"}}