{"2406.05948": {"publish_time": "2024-06-10", "title": "Chain-of-Scrutiny: Detecting Backdoor Attacks for Large Language Models", "paper_summary": "Backdoor attacks present significant threats to Large Language Models (LLMs),\nparticularly with the rise of third-party services that offer API integration\nand prompt engineering. Untrustworthy third parties can plant backdoors into\nLLMs and pose risks to users by embedding malicious instructions into user\nqueries. The backdoor-compromised LLM will generate malicious output when and\ninput is embedded with a specific trigger predetermined by an attacker.\nTraditional defense strategies, which primarily involve model parameter\nfine-tuning and gradient calculation, are inadequate for LLMs due to their\nextensive computational and clean data requirements. In this paper, we propose\na novel solution, Chain-of-Scrutiny (CoS), to address these challenges.\nBackdoor attacks fundamentally create a shortcut from the trigger to the target\noutput, thus lack reasoning support. Accordingly, CoS guides the LLMs to\ngenerate detailed reasoning steps for the input, then scrutinizes the reasoning\nprocess to ensure consistency with the final answer. Any inconsistency may\nindicate an attack. CoS only requires black-box access to LLM, offering a\npractical defense, particularly for API-accessible LLMs. It is user-friendly,\nenabling users to conduct the defense themselves. Driven by natural language,\nthe entire defense process is transparent to users. We validate the\neffectiveness of CoS through extensive experiments across various tasks and\nLLMs. Additionally, experiments results shows CoS proves more beneficial for\nmore powerful LLMs.", "paper_summary_zh": "後門攻擊對大型語言模型 (LLM) 構成重大威脅，特別是在提供 API 整合和提示工程的第三方服務興起的情況下。不可信的第三方可以將後門植入 LLM，並透過將惡意指令嵌入使用者查詢中，對使用者構成風險。後門受損的 LLM 將在輸入嵌入攻擊者預先設定的特定觸發器時產生惡意輸出。傳統的防禦策略主要涉及模型參數微調和梯度計算，由於其廣泛的計算和乾淨資料需求，因此不足以應對 LLM。在本文中，我們提出了一種創新的解決方案，即審查鏈 (CoS)，以應對這些挑戰。後門攻擊基本上從觸發器建立到目標輸出的捷徑，因此缺乏推理支援。因此，CoS 指導 LLM 為輸入產生詳細的推理步驟，然後仔細審查推理過程，以確保與最終答案一致。任何不一致都可能表示攻擊。CoS 只需要對 LLM 進行黑盒存取，提供實用的防禦，特別是對於可透過 API 存取的 LLM。它使用方便，使用戶可以自行進行防禦。在自然語言的驅動下，整個防禦過程對使用者而言是透明的。我們透過各種任務和 LLM 的廣泛實驗驗證了 CoS 的有效性。此外，實驗結果顯示 CoS 對功能更強大的 LLM 更有益。", "author": "Xi Li et.al.", "authors": "Xi Li, Yusen Zhang, Renze Lou, Chen Wu, Jiaqi Wang", "id": "2406.05948v1", "paper_url": "http://arxiv.org/abs/2406.05948v1", "repo": "null"}}