{"2501.05122": {"publish_time": "2025-01-09", "title": "Centurio: On Drivers of Multilingual Ability of Large Vision-Language Model", "paper_summary": "Most Large Vision-Language Models (LVLMs) to date are trained predominantly\non English data, which makes them struggle to understand non-English input and\nfail to generate output in the desired target language. Existing efforts\nmitigate these issues by adding multilingual training data, but do so in a\nlargely ad-hoc manner, lacking insight into how different training mixes tip\nthe scale for different groups of languages. In this work, we present a\ncomprehensive investigation into the training strategies for massively\nmultilingual LVLMs. First, we conduct a series of multi-stage experiments\nspanning 13 downstream vision-language tasks and 43 languages, systematically\nexamining: (1) the number of training languages that can be included without\ndegrading English performance and (2) optimal language distributions of\npre-training as well as (3) instruction-tuning data. Further, we (4)\ninvestigate how to improve multilingual text-in-image understanding, and\nintroduce a new benchmark for the task. Surprisingly, our analysis reveals that\none can (i) include as many as 100 training languages simultaneously (ii) with\nas little as 25-50\\% of non-English data, to greatly improve multilingual\nperformance while retaining strong English performance. We further find that\n(iii) including non-English OCR data in pre-training and instruction-tuning is\nparamount for improving multilingual text-in-image understanding. Finally, we\nput all our findings together and train Centurio, a 100-language LVLM, offering\nstate-of-the-art performance in an evaluation covering 14 tasks and 56\nlanguages.", "paper_summary_zh": "<paragraph>迄今為止，大多數大型視覺語言模型 (LVLMs) 主要都是以英文資料進行訓練，這使得它們難以理解非英文輸入，也無法產生目標語言的輸出。現有的解決方法是透過加入多語言訓練資料來減輕這些問題，但這些方法大多都是臨時應變，缺乏對於不同訓練組合如何影響不同語言群體的見解。在本文中，我們針對大量多語言 LVLMs 的訓練策略進行全面調查。首先，我們進行了一系列多階段實驗，涵蓋 13 個下游視覺語言任務和 43 種語言，系統性地探討：(1) 在不降低英文效能的情況下可以納入的訓練語言數量，以及 (2) 預訓練的最佳語言分佈，以及 (3) 指令調整資料。此外，我們 (4) 探討如何改善多語言文字影像理解，並為此任務引入一個新的基準。令人驚訝的是，我們的分析顯示，人們可以 (i) 同時納入多達 100 種訓練語言，(ii) 只要 25-50% 的非英文資料，就能大幅改善多語言效能，同時維持強勁的英文效能。我們進一步發現，(iii) 在預訓練和指令調整中納入非英文 OCR 資料對於改善多語言文字影像理解至關重要。最後，我們將所有發現彙整起來，訓練出 Centurio，這是一個 100 語言的 LVLM，在涵蓋 14 個任務和 56 種語言的評估中提供最先進的效能。</paragraph>", "author": "Gregor Geigle et.al.", "authors": "Gregor Geigle, Florian Schneider, Carolin Holtermann, Chris Biemann, Radu Timofte, Anne Lauscher, Goran Glavaš", "id": "2501.05122v1", "paper_url": "http://arxiv.org/abs/2501.05122v1", "repo": "null"}}