{"2501.09469": {"publish_time": "2025-01-16", "title": "Predicting Air Temperature from Volumetric Urban Morphology with Machine Learning", "paper_summary": "In this study, we firstly introduce a method that converts CityGML data into\nvoxels which works efficiently and fast in high resolution for large scale\ndatasets such as cities but by sacrificing some building details to overcome\nthe limitations of previous voxelization methodologies that have been\ncomputationally intensive and inefficient at transforming large-scale urban\nareas into voxel representations for high resolution. Those voxelized 3D city\ndata from multiple cities and corresponding air temperature data are used to\ndevelop a machine learning model. Before the model training, Gaussian blurring\nis implemented on input data to consider spatial relationships, as a result the\ncorrelation rate between air temperature and volumetric building morphology is\nalso increased after the Gaussian blurring. After the model training, the\nprediction results are not just evaluated with Mean Square Error (MSE) but some\nimage similarity metrics such as Structural Similarity Index Measure (SSIM) and\nLearned Perceptual Image Patch Similarity (LPIPS) that are able to detect and\nconsider spatial relations during the evaluation process. This trained model is\ncapable of predicting the spatial distribution of air temperature by using\nbuilding volume information of corresponding pixel as input. By doing so, this\nresearch aims to assist urban planners in incorporating environmental\nparameters into their planning strategies, thereby facilitating more\nsustainable and inhabitable urban environments.", "paper_summary_zh": "在本研究中，我们首先介绍了一种方法，该方法将 CityGML 数据转换为体素，该方法在高分辨率下对大规模数据集（如城市）高效快速地工作，但通过牺牲一些建筑细节来克服以前体素化方法的局限性，这些方法在将大规模城市区域转换为高分辨率体素表示时计算密集且效率低下。这些来自多个城市体素化 3D 城市数据和相应的空气温度数据用于开发机器学习模型。在模型训练之前，对输入数据实施高斯模糊以考虑空间关系，因此，高斯模糊后空气温度与体积建筑形态之间的相关率也增加了。在模型训练之后，预测结果不仅通过均方误差 (MSE) 评估，而且还通过一些图像相似性指标（例如结构相似性指数度量 (SSIM) 和学习感知图像块相似性 (LPIPS)）评估，这些指标能够在评估过程中检测和考虑空间关系。该训练模型能够通过使用相应像素的建筑体积信息作为输入来预测空气温度的空间分布。通过这样做，本研究旨在帮助城市规划者将环境参数纳入其规划策略中，从而促进更可持续和宜居的城市环境。", "author": "Berk Kıvılcım et.al.", "authors": "Berk Kıvılcım, Patrick Erik Bradley", "id": "2501.09469v1", "paper_url": "http://arxiv.org/abs/2501.09469v1", "repo": "null"}}