{"2407.02783": {"publish_time": "2024-07-03", "title": "52B to 1T: Lessons Learned via Tele-FLM Series", "paper_summary": "Large Language Models (LLMs) represent a significant stride toward Artificial\nGeneral Intelligence. As scaling laws underscore the potential of increasing\nmodel sizes, the academic community has intensified its investigations into\nLLMs with capacities exceeding 50 billion parameters. This technical report\nbuilds on our prior work with Tele-FLM (also known as FLM-2), a publicly\navailable 52-billion-parameter model. We delve into two primary areas: we first\ndiscuss our observation of Supervised Fine-tuning (SFT) on Tele-FLM-52B, which\nsupports the \"less is more\" approach for SFT data construction; second, we\ndemonstrate our experiments and analyses on the best practices for\nprogressively growing a model from 52 billion to 102 billion, and subsequently\nto 1 trillion parameters. We will open-source a 1T model checkpoint, namely\nTele-FLM-1T, to advance further training and research.", "paper_summary_zh": "大型語言模型 (LLM) 代表著朝向人工通用智慧邁進一大步。由於規模定律強調了增加模型規模的潛力，學術界已加強其對容量超過 500 億個參數的 LLM 的研究。這份技術報告建立在我們先前使用 Tele-FLM（也稱為 FLM-2）的研究之上，Tele-FLM 是一個公開可用的 520 億個參數模型。我們深入探討兩個主要領域：我們首先討論我們對 Tele-FLM-52B 上的監督微調 (SFT) 的觀察，這支持了 SFT 資料建構的「少即是多」方法；其次，我們展示我們對從 520 億個模型逐步增加到 1020 億個，再到 1 兆個參數的最佳實務的實驗和分析。我們將開源一個 1T 模型檢查點，即 Tele-FLM-1T，以推進進一步的訓練和研究。", "author": "Xiang Li et.al.", "authors": "Xiang Li, Yiqun Yao, Xin Jiang, Xuezhi Fang, Chao Wang, Xinzhang Liu, Zihan Wang, Yu Zhao, Xin Wang, Yuyao Huang, Shuangyong Song, Yongxiang Li, Zheng Zhang, Bo Zhao, Aixin Sun, Yequan Wang, Zhongjiang He, Zhongyuan Wang, Xuelong Li, Tiejun Huang", "id": "2407.02783v1", "paper_url": "http://arxiv.org/abs/2407.02783v1", "repo": "null"}}