{"2409.02795": {"publish_time": "2024-09-04", "title": "Towards a Unified View of Preference Learning for Large Language Models: A Survey", "paper_summary": "Large Language Models (LLMs) exhibit remarkably powerful capabilities. One of\nthe crucial factors to achieve success is aligning the LLM's output with human\npreferences. This alignment process often requires only a small amount of data\nto efficiently enhance the LLM's performance. While effective, research in this\narea spans multiple domains, and the methods involved are relatively complex to\nunderstand. The relationships between different methods have been\nunder-explored, limiting the development of the preference alignment. In light\nof this, we break down the existing popular alignment strategies into different\ncomponents and provide a unified framework to study the current alignment\nstrategies, thereby establishing connections among them. In this survey, we\ndecompose all the strategies in preference learning into four components:\nmodel, data, feedback, and algorithm. This unified view offers an in-depth\nunderstanding of existing alignment algorithms and also opens up possibilities\nto synergize the strengths of different strategies. Furthermore, we present\ndetailed working examples of prevalent existing algorithms to facilitate a\ncomprehensive understanding for the readers. Finally, based on our unified\nperspective, we explore the challenges and future research directions for\naligning large language models with human preferences.", "paper_summary_zh": "大型語言模型 (LLM) 展現出強大的功能。成功的重要因素之一是將 LLM 的輸出與人類偏好相符。此比對程序通常只需要少量資料即可有效提升 LLM 的效能。儘管有效，此領域的研究橫跨多個範疇，而所涉及的方法相對難以理解。不同方法之間的關係尚未充分探討，這限制了偏好比對的發展。有鑑於此，我們將現有熱門比對策略分解成不同的組成部分，並提供一個統一架構來研究目前的比對策略，進而建立它們之間的關聯。在此調查中，我們將偏好學習中的所有策略分解成四個組成部分：模型、資料、回饋和演算法。此統一觀點提供對現有比對演算法的深入理解，也開啟了協同運用不同策略優勢的可能性。此外，我們提供現有盛行演算法的詳細工作範例，以促進讀者全面理解。最後，根據我們的統一觀點，我們探討了將大型語言模型與人類偏好相符的挑戰和未來研究方向。", "author": "Bofei Gao et.al.", "authors": "Bofei Gao, Feifan Song, Yibo Miao, Zefan Cai, Zhe Yang, Liang Chen, Helan Hu, Runxin Xu, Qingxiu Dong, Ce Zheng, Wen Xiao, Ge Zhang, Daoguang Zan, Keming Lu, Bowen Yu, Dayiheng Liu, Zeyu Cui, Jian Yang, Lei Sha, Houfeng Wang, Zhifang Sui, Peiyi Wang, Tianyu Liu, Baobao Chang", "id": "2409.02795v2", "paper_url": "http://arxiv.org/abs/2409.02795v2", "repo": "null"}}