{"2502.11973": {"publish_time": "2025-02-17", "title": "Generating Text from Uniform Meaning Representation", "paper_summary": "Uniform Meaning Representation (UMR) is a recently developed graph-based\nsemantic representation, which expands on Abstract Meaning Representation (AMR)\nin a number of ways, in particular through the inclusion of document-level\ninformation and multilingual flexibility. In order to effectively adopt and\nleverage UMR for downstream tasks, efforts must be placed toward developing a\nUMR technological ecosystem. Though still limited amounts of UMR annotations\nhave been produced to date, in this work, we investigate the first approaches\nto producing text from multilingual UMR graphs: (1) a pipeline conversion of\nUMR to AMR, then using AMR-to-text generation models, (2) fine-tuning large\nlanguage models with UMR data, and (3) fine-tuning existing AMR-to-text\ngeneration models with UMR data. Our best performing model achieves a\nmultilingual BERTscore of 0.825 for English and 0.882 for Chinese when compared\nto the reference, which is a promising indication of the effectiveness of\nfine-tuning approaches for UMR-to-text generation with even limited amounts of\nUMR data.", "paper_summary_zh": "統一語意表示 (UMR) 是一種最近開發的基於圖形的語意表示，它在許多方面擴展了抽象語意表示 (AMR)，特別是透過納入文件層級資訊和多語言靈活性。為了有效採用和利用下游任務的 UMR，必須投入精力開發 UMR 技術生態系統。雖然到目前為止產生的 UMR 標註數量仍然有限，但在這項工作中，我們探討了從多語言 UMR 圖形產生文字的第一種方法：(1) 將 UMR 轉換為 AMR 的管道，然後使用 AMR 轉文字生成模型，(2) 使用 UMR 資料微調大型語言模型，以及 (3) 使用 UMR 資料微調現有的 AMR 轉文字生成模型。與參考相比，我們效能最好的模型在英文中達到 0.825 的多語言 BERT 分數，在中文中達到 0.882，這表示使用 UMR 資料進行 UMR 轉文字生成的微調方法具有良好的效果，即使 UMR 資料數量有限。", "author": "Emma Markle et.al.", "authors": "Emma Markle, Reihaneh Iranmanesh, Shira Wein", "id": "2502.11973v1", "paper_url": "http://arxiv.org/abs/2502.11973v1", "repo": "null"}}