{"2408.02861": {"publish_time": "2024-08-05", "title": "A Framework for Fine-Tuning LLMs using Heterogeneous Feedback", "paper_summary": "Large language models (LLMs) have been applied to a wide range of tasks,\nincluding text summarization, web navigation, and chatbots. They have\nbenefitted from supervised fine-tuning (SFT) and reinforcement learning from\nhuman feedback (RLHF) following an unsupervised pretraining. These datasets can\nbe difficult to collect, limited in scope, and vary in sample quality.\nAdditionally, datasets can vary extensively in supervision format, from\nnumerical to binary as well as multi-dimensional with many different values. We\npresent a framework for fine-tuning LLMs using heterogeneous feedback, which\nhas two main components. First, we combine the heterogeneous feedback data into\na single supervision format, compatible with methods like SFT and RLHF. Next,\ngiven this unified feedback dataset, we extract a high-quality and diverse\nsubset to obtain performance increases potentially exceeding the full dataset.\nWe conduct extensive experiments to understand the effectiveness of these\ntechniques for incorporating heterogeneous feedback, and demonstrate\nimprovements from using a high-quality and diverse subset of the data. We find\nthat our framework is able to improve models in multiple areas simultaneously,\nsuch as in instruction following and bias reduction.", "paper_summary_zh": "大型語言模型 (LLM) 已應用於各種任務，\n包括文字摘要、網頁瀏覽和聊天機器人。它們\n受益於無監督預訓練後的監督微調 (SFT) 和人類回饋的強化學習 (RLHF)。這些資料集可能\n難以收集、範圍受限且樣本品質不一。\n此外，資料集在監督格式上可能差異很大，從\n數字到二元，以及具有許多不同值的多分量。我們\n提出了一個使用異質回饋微調 LLM 的框架，它\n有兩個主要組成部分。首先，我們將異質回饋資料合併為\n單一監督格式，與 SFT 和 RLHF 等方法相容。接下來，\n給定這個統一的回饋資料集，我們提取一個高品質且多樣化的\n子集，以獲得潛在超過完整資料集的效能提升。\n我們進行了廣泛的實驗，以了解這些\n技術在整合異質回饋方面的有效性，並展示\n使用高品質且多樣化的資料子集所帶來的改進。我們發現\n我們的框架能夠同時改善模型的各個領域，\n例如指令遵循和偏差減少。", "author": "Ryan Aponte et.al.", "authors": "Ryan Aponte, Ryan A. Rossi, Shunan Guo, Franck Dernoncourt, Tong Yu, Xiang Chen, Subrata Mitra, Nedim Lipka", "id": "2408.02861v1", "paper_url": "http://arxiv.org/abs/2408.02861v1", "repo": "null"}}