{"2409.17655": {"publish_time": "2024-09-26", "title": "AssistantX: An LLM-Powered Proactive Assistant in Collaborative Human-Populated Environment", "paper_summary": "The increasing demand for intelligent assistants in human-populated\nenvironments has motivated significant research in autonomous robotic systems.\nTraditional service robots and virtual assistants, however, struggle with\nreal-world task execution due to their limited capacity for dynamic reasoning\nand interaction, particularly when human collaboration is required. Recent\ndevelopments in Large Language Models have opened new avenues for improving\nthese systems, enabling more sophisticated reasoning and natural interaction\ncapabilities. In this paper, we introduce AssistantX, an LLM-powered proactive\nassistant designed to operate autonomously in a physical office environment.\nUnlike conventional service robots, AssistantX leverages a novel multi-agent\narchitecture, PPDR4X, which provides advanced inference capabilities and\ncomprehensive collaboration awareness. By effectively bridging the gap between\nvirtual operations and physical interactions, AssistantX demonstrates robust\nperformance in managing complex real-world scenarios. Our evaluation highlights\nthe architecture's effectiveness, showing that AssistantX can respond to clear\ninstructions, actively retrieve supplementary information from memory, and\nproactively seek collaboration from team members to ensure successful task\ncompletion. More details and videos can be found at\nhttps://assistantx-agent.github.io/AssistantX/.", "paper_summary_zh": "在人員密集的環境中對智慧助理的需求日益增長，這激勵了對自主機器人系統進行大量的研究。然而，傳統的服務機器人和虛擬助理由於其動態推理和互動能力有限，在執行現實世界的任務時會遇到困難，特別是在需要人類協作時。最近大型語言模型的發展為改進這些系統開闢了新的途徑，實現了更精密的推理和自然互動能力。在本文中，我們介紹了 AssistantX，這是一個由 LLM 驅動的積極主動助理，旨在在物理辦公室環境中自主運作。與傳統的服務機器人不同，AssistantX 利用了一種新穎的多代理架構 PPDR4X，它提供了先進的推理能力和全面的協作意識。通過有效地彌合虛擬操作和物理互動之間的差距，AssistantX 在管理複雜的現實世界場景中展示了強大的性能。我們的評估突出了該架構的有效性，表明 AssistantX 可以響應明確的指令，主動從記憶體中檢索補充資訊，並主動尋求團隊成員的協作，以確保任務成功完成。更多詳細資訊和影片可以在 https://assistantx-agent.github.io/AssistantX/ 找到。", "author": "Nan Sun et.al.", "authors": "Nan Sun, Bo Mao, Yongchang Li, Lumeng Ma, Di Guo, Huaping Liu", "id": "2409.17655v1", "paper_url": "http://arxiv.org/abs/2409.17655v1", "repo": "null"}}