{"2404.06413": {"publish_time": "2024-04-09", "title": "Large Language Models to the Rescue: Deadlock Resolution in Multi-Robot Systems", "paper_summary": "Multi-agent robotic systems are prone to deadlocks in an obstacle environment\nwhere the system can get stuck away from its desired location under a smooth\nlow-level control policy. Without an external intervention, often in terms of a\nhigh-level command, it is not possible to guarantee that just a low-level\ncontrol policy can resolve such deadlocks. Utilizing the generalizability and\nlow data requirements of large language models (LLMs), this paper explores the\npossibility of using LLMs for deadlock resolution. We propose a hierarchical\ncontrol framework where an LLM resolves deadlocks by assigning a leader and\ndirection for the leader to move along. A graph neural network (GNN) based\nlow-level distributed control policy executes the assigned plan. We\nsystematically study various prompting techniques to improve LLM's performance\nin resolving deadlocks. In particular, as part of prompt engineering, we\nprovide in-context examples for LLMs. We conducted extensive experiments on\nvarious multi-robot environments with up to 15 agents and 40 obstacles. Our\nresults demonstrate that LLM-based high-level planners are effective in\nresolving deadlocks in MRS.", "paper_summary_zh": "多智能體機器人系統在障礙物環境中容易陷入僵局，在平穩的低階控制策略下，系統可能遠離其目標位置而卡住。如果不進行外部干預（通常以高階指令的形式），無法保證僅低階控制策略就能解決此類僵局。利用大型語言模型 (LLM) 的泛化性和低數據需求，本文探討了使用 LLM 解決僵局的可能性。我們提出了一個分層控制框架，其中 LLM 通過指定一個領導者和領導者沿著該方向移動來解決僵局。基於圖神經網路 (GNN) 的低階分散控制策略執行分配的計畫。我們系統地研究了各種提示技術，以提高 LLM 在解決僵局方面的效能。特別是，作為提示工程的一部分，我們為 LLM 提供了情境範例。我們對最多包含 15 個智能體和 40 個障礙物的各種多機器人環境進行了廣泛的實驗。我們的結果表明，基於 LLM 的高階規劃器在解決 MRS 中的僵局方面是有效的。", "author": "Kunal Garg et.al.", "authors": "Kunal Garg, Jacob Arkin, Songyuan Zhang, Nicholas Roy, Chuchu Fan", "id": "2404.06413v1", "paper_url": "http://arxiv.org/abs/2404.06413v1", "repo": "null"}}