{"2411.02796": {"publish_time": "2024-11-05", "title": "Specialized Foundation Models Struggle to Beat Supervised Baselines", "paper_summary": "Following its success for vision and text, the \"foundation model\" (FM)\nparadigm -- pretraining large models on massive data, then fine-tuning on\ntarget tasks -- has rapidly expanded to domains in the sciences, engineering,\nhealthcare, and beyond. Has this achieved what the original FMs accomplished,\ni.e. the supplanting of traditional supervised learning in their domains? To\nanswer we look at three modalities -- genomics, satellite imaging, and time\nseries -- with multiple recent FMs and compare them to a standard supervised\nlearning workflow: model development, hyperparameter tuning, and training, all\nusing only data from the target task. Across these three specialized domains,\nwe find that it is consistently possible to train simple supervised models --\nno more complicated than a lightly modified wide ResNet or UNet -- that match\nor even outperform the latest foundation models. Our work demonstrates that the\nbenefits of large-scale pretraining have yet to be realized in many specialized\nareas, reinforces the need to compare new FMs to strong, well-tuned baselines,\nand introduces two new, easy-to-use, open-source, and automated workflows for\ndoing so.", "paper_summary_zh": "在視覺和文本方面取得成功後，「基礎模型」（FM）範例——在大量資料上預先訓練大型模型，然後針對目標任務進行微調——已迅速擴展到科學、工程、醫療保健等領域。這是否達到了原始 FM 所完成的目標，即取代其領域中的傳統監督式學習？為了回答這個問題，我們觀察了三個模態——基因組學、衛星影像和時間序列——以及多個最近的 FM，並將它們與標準監督式學習工作流程進行比較：模型開發、超參數調整和訓練，所有這些都僅使用來自目標任務的資料。在這些三個專門領域中，我們發現持續訓練簡單的監督式模型是可行的——不比經過輕微修改的廣泛 ResNet 或 UNet 更複雜——與最新的基礎模型相匹配，甚至表現得更好。我們的研究表明，在許多專門領域中，大規模預訓練的優點尚未實現，這強化了將新的 FM 與強大且經過良好調整的基準進行比較的需求，並引入了兩個新的、易於使用、開放原始碼和自動化的工作流程來執行此操作。", "author": "Zongzhe Xu et.al.", "authors": "Zongzhe Xu, Ritvik Gupta, Wenduo Cheng, Alexander Shen, Junhong Shen, Ameet Talwalkar, Mikhail Khodak", "id": "2411.02796v1", "paper_url": "http://arxiv.org/abs/2411.02796v1", "repo": "https://github.com/ritvikgupta199/DASHA"}}