{"2407.11652": {"publish_time": "2024-07-16", "title": "CCVA-FL: Cross-Client Variations Adaptive Federated Learning for Medical Imaging", "paper_summary": "Federated Learning (FL) offers a privacy-preserving approach to train models\non decentralized data. Its potential in healthcare is significant, but\nchallenges arise due to cross-client variations in medical image data,\nexacerbated by limited annotations. This paper introduces Cross-Client\nVariations Adaptive Federated Learning (CCVA-FL) to address these issues.\nCCVA-FL aims to minimize cross-client variations by transforming images into a\ncommon feature space. It involves expert annotation of a subset of images from\neach client, followed by the selection of a client with the least data\ncomplexity as the target. Synthetic medical images are then generated using\nScalable Diffusion Models with Transformers (DiT) based on the target client's\nannotated images. These synthetic images, capturing diversity and representing\nthe original data, are shared with other clients. Each client then translates\nits local images into the target image space using image-to-image translation.\nThe translated images are subsequently used in a federated learning setting to\ndevelop a server model. Our results demonstrate that CCVA-FL outperforms\nVanilla Federated Averaging by effectively addressing data distribution\ndifferences across clients without compromising privacy.", "paper_summary_zh": "聯邦學習 (FL) 提供一種保護隱私的方法，可以在分散式數據上訓練模型。其在醫療保健中的潛力很大，但由於醫療影像數據中的跨客戶差異，加上註釋有限，因此產生了挑戰。本文介紹跨客戶差異自適應聯邦學習 (CCVA-FL) 來解決這些問題。CCVA-FL 旨在透過將影像轉換到一個共同特徵空間來最小化跨客戶差異。它涉及從每個客戶端中的一個影像子集進行專家註釋，然後選擇數據複雜性最低的客戶端作為目標。然後使用基於目標客戶端註釋影像的可擴充擴散模型與 Transformer (DiT) 來產生合成醫療影像。這些合成影像擷取多樣性並代表原始數據，並與其他客戶端共享。然後，每個客戶端使用影像到影像翻譯，將其本地影像轉換到目標影像空間。翻譯後的影像隨後用於聯邦學習設定，以開發伺服器模型。我們的結果證明，CCVA-FL 透過有效解決客戶端之間的數據分佈差異，在不損害隱私的情況下，優於香草聯邦平均。", "author": "Sunny Gupta et.al.", "authors": "Sunny Gupta, Amit Sethi", "id": "2407.11652v2", "paper_url": "http://arxiv.org/abs/2407.11652v2", "repo": "null"}}