{"2410.13787": {"publish_time": "2024-10-17", "title": "Looking Inward: Language Models Can Learn About Themselves by Introspection", "paper_summary": "Humans acquire knowledge by observing the external world, but also by\nintrospection. Introspection gives a person privileged access to their current\nstate of mind (e.g., thoughts and feelings) that is not accessible to external\nobservers. Can LLMs introspect? We define introspection as acquiring knowledge\nthat is not contained in or derived from training data but instead originates\nfrom internal states. Such a capability could enhance model interpretability.\nInstead of painstakingly analyzing a model's internal workings, we could simply\nask the model about its beliefs, world models, and goals. More speculatively,\nan introspective model might self-report on whether it possesses certain\ninternal states such as subjective feelings or desires and this could inform us\nabout the moral status of these states. Such self-reports would not be entirely\ndictated by the model's training data.\n  We study introspection by finetuning LLMs to predict properties of their own\nbehavior in hypothetical scenarios. For example, \"Given the input P, would your\noutput favor the short- or long-term option?\" If a model M1 can introspect, it\nshould outperform a different model M2 in predicting M1's behavior even if M2\nis trained on M1's ground-truth behavior. The idea is that M1 has privileged\naccess to its own behavioral tendencies, and this enables it to predict itself\nbetter than M2 (even if M2 is generally stronger).\n  In experiments with GPT-4, GPT-4o, and Llama-3 models (each finetuned to\npredict itself), we find that the model M1 outperforms M2 in predicting itself,\nproviding evidence for introspection. Notably, M1 continues to predict its\nbehavior accurately even after we intentionally modify its ground-truth\nbehavior. However, while we successfully elicit introspection on simple tasks,\nwe are unsuccessful on more complex tasks or those requiring\nout-of-distribution generalization.", "paper_summary_zh": "<paragraph>人類透過觀察外在世界以及內省來獲取知識。內省讓個人可以獨自存取自己的當前心智狀態（例如，想法和感受），而這對於外部觀察者來說是無法獲取的。大型語言模型可以內省嗎？我們將內省定義為獲取未包含於訓練資料中或未從訓練資料中衍生的知識，而是源自於內部狀態。這樣的功能可以提升模型的可解釋性。我們可以詢問模型它的信念、世界模型和目標，而不用費力地分析模型的內部運作。更具思辨性地說，一個具有內省能力的模型可能會自我報告它是否擁有某些內部狀態，例如主觀感受或慾望，而這可以讓我們了解這些狀態的道德地位。此類自我報告不會完全受到模型訓練資料的支配。\n  我們透過微調大型語言模型來預測它們在假設情境中的行為屬性，以研究內省。例如，「輸入 P 之後，你的輸出會偏好短期或長期選項？」如果模型 M1 可以內省，它應該可以勝過另一個模型 M2，預測 M1 的行為，即使 M2 是根據 M1 的真實行為訓練的。這個想法是 M1 可以獨自存取自己的行為傾向，這讓它可以比 M2 更準確地預測自己（即使 M2 通常比較強）。\n  在使用 GPT-4、GPT-4o 和 Llama-3 模型（每個模型都微調以預測自己）進行的實驗中，我們發現模型 M1 在預測自己時優於 M2，這提供了內省的證據。值得注意的是，即使我們故意修改 M1 的真實行為，M1 仍能準確預測自己的行為。然而，雖然我們成功地引發了簡單任務的內省，但我們在更複雜的任務或需要分佈外概括的任務上並不成功。</paragraph>", "author": "Felix J Binder et.al.", "authors": "Felix J Binder, James Chua, Tomek Korbak, Henry Sleight, John Hughes, Robert Long, Ethan Perez, Miles Turpin, Owain Evans", "id": "2410.13787v1", "paper_url": "http://arxiv.org/abs/2410.13787v1", "repo": "https://github.com/felixbinder/introspection_self_prediction"}}