{"2407.07840": {"publish_time": "2024-07-10", "title": "Decompose and Compare Consistency: Measuring VLMs' Answer Reliability via Task-Decomposition Consistency Comparison", "paper_summary": "Despite tremendous advancements, current state-of-the-art Vision-Language\nModels (VLMs) are still far from perfect. They tend to hallucinate and may\ngenerate biased responses. In such circumstances, having a way to assess the\nreliability of a given response generated by a VLM is quite useful. Existing\nmethods, such as estimating uncertainty using answer likelihoods or\nprompt-based confidence generation, often suffer from overconfidence. Other\nmethods use self-consistency comparison but are affected by confirmation\nbiases. To alleviate these, we propose \\textbf{De}compose and \\textbf{C}ompare\n\\textbf{C}onsistency (\\texttt{DeCC}) for reliability measurement. By comparing\nthe consistency between the direct answer generated using the VLM's internal\nreasoning process, and the indirect answers obtained by decomposing the\nquestion into sub-questions and reasoning over the sub-answers produced by the\nVLM, \\texttt{DeCC} measures the reliability of VLM's direct answer. Experiments\nacross six vision-language tasks with three VLMs show \\texttt{DeCC}'s\nreliability estimation achieves better correlation with task accuracy compared\nto the existing methods.", "paper_summary_zh": "儘管有長足的進展，目前的最新視覺語言模型（VLM）仍遠未完美。它們傾向於產生幻覺，並且可能會產生有偏見的回應。在這種情況下，有一種方法可以評估 VLM 生成的特定回應的可靠性非常有用。現有的方法，例如使用答案可能性估計不確定性或基於提示的信心生成，通常會過於自信。其他方法使用自我一致性比較，但會受到確認偏誤的影響。為了緩解這些問題，我們提出\\textbf{分}解和\\textbf{比}較\\textbf{一}致性（\\texttt{DeCC}）以進行可靠性測量。透過比較使用 VLM 內部推理過程產生的直接答案與透過將問題分解成子問題並對 VLM 產生的子答案進行推理而獲得的間接答案之間的一致性，\\texttt{DeCC} 測量 VLM 直接答案的可靠性。使用三個 VLM 進行的六項視覺語言任務的實驗表明，與現有方法相比，\\texttt{DeCC} 的可靠性估計與任務準確性具有更好的相關性。", "author": "Qian Yang et.al.", "authors": "Qian Yang, Weixiang Yan, Aishwarya Agrawal", "id": "2407.07840v1", "paper_url": "http://arxiv.org/abs/2407.07840v1", "repo": "null"}}