{"2504.12417": {"publish_time": "2025-04-16", "title": "Interpretable AI-driven Guidelines for Type 2 Diabetes Treatment from Observational Data", "paper_summary": "Objective: Create precise, structured, data-backed guidelines for type 2\ndiabetes treatment progression, suitable for clinical adoption.\n  Research Design and Methods: Our training cohort was composed of patient\n(with type 2 diabetes) visits from Boston Medical Center (BMC) from 1998 to\n2014. We divide visits into 4 groups based on the patient's treatment regimen\nbefore the visit, and further divide them into subgroups based on the\nrecommended treatment during the visit. Since each subgroup has observational\ndata, which has confounding bias (sicker patients are prescribed more\naggressive treatments), we used machine learning and optimization to remove\nsome datapoints so that the remaining data resembles a randomized trial. On\neach subgroup, we train AI-backed tree-based models to prescribe treatment\nchanges. Once we train these tree models, we manually combine the models for\nevery group to create an end-to-end prescription pipeline for all patients in\nthat group. In this process, we prioritize stepping up to a more aggressive\ntreatment before considering less aggressive options. We tested this pipeline\non unseen data from BMC, and an external dataset from Hartford healthcare (type\n2 diabetes patient visits from January 2020 to May 2024).\n  Results: The median HbA1c reduction achieved by our pipelines is 0.26% more\nthan what the doctors achieved on the unseen BMC patients. For the Hartford\ncohort, our pipelines were better by 0.13%.\n  Conclusions: This precise, interpretable, and efficient AI-backed approach to\ntreatment progression in type 2 diabetes is predicted to outperform the current\npractice and can be deployed to improve patient outcomes.", "paper_summary_zh": "<paragraph>目標：為第 2 型糖尿病的治療進展制定精確、結構化且基於數據的準則，使其適用於臨床應用。研究設計與方法：我們的訓練隊列由 1998 年至 2014 年波士頓醫療中心 (BMC) 的第 2 型糖尿病患者就診資料組成。我們根據患者就診前的治療方案將就診資料分為 4 組，並根據就診期間的建議治療方案將其進一步劃分為子組。由於每個子組都有觀察數據，其中存在混雜偏差（病情較重的患者會被開立更積極的治療方案），因此我們使用機器學習和優化來移除一些數據點，使剩餘數據類似於隨機試驗。在每個子組上，我們訓練基於 AI 的樹狀模型來開立治療方案的變化。訓練完這些樹狀模型後，我們手動組合每個組的模型，為該組中的所有患者創建端到端的處方流程。在此過程中，我們優先考慮升級到更積極的治療方案，然後再考慮不太積極的方案。我們在 BMC 的未公開數據以及 Hartford 醫療保健的外部數據集（2020 年 1 月至 2024 年 5 月的第 2 型糖尿病患者就診資料）上測試了此流程。結果：我們的流程實現的 HbA1c 中位數降低比醫生在未公開的 BMC 患者中實現的降低多 0.26%。對於 Hartford 隊列，我們的流程提升了 0.13%。結論：這種精確、可解釋且高效的基於 AI 的第 2 型糖尿病治療進展方法預計將優於目前的做法，並且可以部署以改善患者的治療結果。</paragraph>\n", "author": "Dewang Kumar Agarwal et.al.", "authors": "Dewang Kumar Agarwal, Dimitris J. Bertsimas", "id": "2504.12417v1", "paper_url": "http://arxiv.org/abs/2504.12417v1", "repo": "null"}}