{"2405.19933": {"publish_time": "2024-05-30", "title": "Learning Latent Graph Structures and their Uncertainty", "paper_summary": "Within a prediction task, Graph Neural Networks (GNNs) use relational\ninformation as an inductive bias to enhance the model's accuracy. As\ntask-relevant relations might be unknown, graph structure learning approaches\nhave been proposed to learn them while solving the downstream prediction task.\nIn this paper, we demonstrate that minimization of a point-prediction loss\nfunction, e.g., the mean absolute error, does not guarantee proper learning of\nthe latent relational information and its associated uncertainty. Conversely,\nwe prove that a suitable loss function on the stochastic model outputs\nsimultaneously grants (i) the unknown adjacency matrix latent distribution and\n(ii) optimal performance on the prediction task. Finally, we propose a\nsampling-based method that solves this joint learning task. Empirical results\nvalidate our theoretical claims and demonstrate the effectiveness of the\nproposed approach.", "paper_summary_zh": "<paragraph>在預測任務中，圖神經網路 (GNN) 使用關聯資訊作為歸納偏誤，以增強模型準確性。由於與任務相關的關係可能是未知的，因此提出圖結構學習方法，以便在解決下游預測任務時學習它們。在本文中，我們證明點預測損失函數（例如平均絕對誤差）的最小化並不能保證正確學習潛在關係資訊及其相關的不確定性。相反，我們證明了隨機模型輸出上的合適損失函數同時賦予 (i) 未知鄰接矩陣潛在分佈和 (ii) 預測任務的最佳效能。最後，我們提出一個基於抽樣的解決此聯合學習任務的方法。實證結果驗證了我們的理論主張，並證明了所提出方法的有效性。</paragraph>", "author": "Alessandro Manenti et.al.", "authors": "Alessandro Manenti, Daniele Zambon, Cesare Alippi", "id": "2405.19933v1", "paper_url": "http://arxiv.org/abs/2405.19933v1", "repo": "null"}}