{"2501.08471": {"publish_time": "2025-01-14", "title": "Benchmarking Classical, Deep, and Generative Models for Human Activity Recognition", "paper_summary": "Human Activity Recognition (HAR) has gained significant importance with the\ngrowing use of sensor-equipped devices and large datasets. This paper evaluates\nthe performance of three categories of models : classical machine learning,\ndeep learning architectures, and Restricted Boltzmann Machines (RBMs) using\nfive key benchmark datasets of HAR (UCI-HAR, OPPORTUNITY, PAMAP2, WISDM, and\nBerkeley MHAD). We assess various models, including Decision Trees, Random\nForests, Convolutional Neural Networks (CNN), and Deep Belief Networks (DBNs),\nusing metrics such as accuracy, precision, recall, and F1-score for a\ncomprehensive comparison. The results show that CNN models offer superior\nperformance across all datasets, especially on the Berkeley MHAD. Classical\nmodels like Random Forest do well on smaller datasets but face challenges with\nlarger, more complex data. RBM-based models also show notable potential,\nparticularly for feature learning. This paper offers a detailed comparison to\nhelp researchers choose the most suitable model for HAR tasks.", "paper_summary_zh": "人類活動辨識 (HAR) 隨著配備感測器裝置和大型資料集的使用日益普及，變得越來越重要。本文評估了三種類別模型的效能：傳統機器學習、深度學習架構和受限玻爾茲曼機 (RBM)，使用五個 HAR 主要基準資料集 (UCI-HAR、OPPORTUNITY、PAMAP2、WISDM 和 Berkeley MHAD)。我們評估了各種模型，包括決策樹、隨機森林、卷積神經網路 (CNN) 和深度信念網路 (DBN)，使用準確度、精確度、召回率和 F1 分數等指標進行全面比較。結果顯示 CNN 模型在所有資料集上都提供優異的效能，特別是在 Berkeley MHAD 上。隨機森林等傳統模型在較小的資料集上表現良好，但面對較大、較複雜的資料時會面臨挑戰。基於 RBM 的模型也展現了顯著的潛力，特別是在特徵學習方面。本文提供了詳細的比較，以協助研究人員選擇最適合 HAR 任務的模型。", "author": "Md Meem Hossain et.al.", "authors": "Md Meem Hossain, The Anh Han, Safina Showkat Ara, Zia Ush Shamszaman", "id": "2501.08471v1", "paper_url": "http://arxiv.org/abs/2501.08471v1", "repo": "null"}}