{"2501.00190": {"publish_time": "2024-12-31", "title": "SepsisCalc: Integrating Clinical Calculators into Early Sepsis Prediction via Dynamic Temporal Graph Construction", "paper_summary": "Sepsis is an organ dysfunction caused by a deregulated immune response to an\ninfection. Early sepsis prediction and identification allow for timely\nintervention, leading to improved clinical outcomes. Clinical calculators\n(e.g., the six-organ dysfunction assessment of SOFA) play a vital role in\nsepsis identification within clinicians' workflow, providing evidence-based\nrisk assessments essential for sepsis diagnosis. However, artificial\nintelligence (AI) sepsis prediction models typically generate a single sepsis\nrisk score without incorporating clinical calculators for assessing organ\ndysfunctions, making the models less convincing and transparent to clinicians.\nTo bridge the gap, we propose to mimic clinicians' workflow with a novel\nframework SepsisCalc to integrate clinical calculators into the predictive\nmodel, yielding a clinically transparent and precise model for utilization in\nclinical settings. Practically, clinical calculators usually combine\ninformation from multiple component variables in Electronic Health Records\n(EHR), and might not be applicable when the variables are (partially) missing.\nWe mitigate this issue by representing EHRs as temporal graphs and integrating\na learning module to dynamically add the accurately estimated calculator to the\ngraphs. Experimental results on real-world datasets show that the proposed\nmodel outperforms state-of-the-art methods on sepsis prediction tasks.\nMoreover, we developed a system to identify organ dysfunctions and potential\nsepsis risks, providing a human-AI interaction tool for deployment, which can\nhelp clinicians understand the prediction outputs and prepare timely\ninterventions for the corresponding dysfunctions, paving the way for actionable\nclinical decision-making support for early intervention.", "paper_summary_zh": "敗血症是由失調的免疫反應對感染引起的器官功能障礙。敗血症的早期預測和識別允許及時介入，從而改善臨床結果。臨床計算器（例如 SOFA 的六器官功能障礙評估）在臨床醫生工作流程中對敗血症識別發揮著至關重要的作用，提供了敗血症診斷必不可少的基於證據的風險評估。然而，人工智能 (AI) 敗血症預測模型通常會產生單一的敗血症風險評分，而不會納入臨床計算器來評估器官功能障礙，這使得這些模型對臨床醫生來說不太令人信服且不透明。為了彌合這一差距，我們建議模擬臨床醫生的工作流程，使用一個新的框架 SepsisCalc 將臨床計算器整合到預測模型中，從而產生一個在臨床環境中使用的臨床透明且精確的模型。實際上，臨床計算器通常會結合電子健康記錄 (EHR) 中多個組成變量的資訊，並且在變量（部分）缺失時可能不適用。我們通過將 EHR 表示為時間圖並整合一個學習模組來動態地將準確估計的計算器新增到圖形中，從而緩解了這個問題。在真實世界資料集上的實驗結果表明，所提出的模型在敗血症預測任務上優於最先進的方法。此外，我們開發了一個系統來識別器官功能障礙和潛在的敗血症風險，提供了一個可供部署的人機互動工具，這可以幫助臨床醫生瞭解預測輸出並為相應的功能障礙準備及時的干預措施，為早期干預的行動臨床決策支援鋪平道路。", "author": "Changchang Yin et.al.", "authors": "Changchang Yin, Shihan Fu, Bingsheng Yao, Thai-Hoang Pham, Weidan Cao, Dakuo Wang, Jeffrey Caterino, Ping Zhang", "id": "2501.00190v1", "paper_url": "http://arxiv.org/abs/2501.00190v1", "repo": "null"}}