{"2407.20653": {"publish_time": "2024-07-30", "title": "FACL-Attack: Frequency-Aware Contrastive Learning for Transferable Adversarial Attacks", "paper_summary": "Deep neural networks are known to be vulnerable to security risks due to the\ninherent transferable nature of adversarial examples. Despite the success of\nrecent generative model-based attacks demonstrating strong transferability, it\nstill remains a challenge to design an efficient attack strategy in a\nreal-world strict black-box setting, where both the target domain and model\narchitectures are unknown. In this paper, we seek to explore a feature\ncontrastive approach in the frequency domain to generate adversarial examples\nthat are robust in both cross-domain and cross-model settings. With that goal\nin mind, we propose two modules that are only employed during the training\nphase: a Frequency-Aware Domain Randomization (FADR) module to randomize\ndomain-variant low- and high-range frequency components and a\nFrequency-Augmented Contrastive Learning (FACL) module to effectively separate\ndomain-invariant mid-frequency features of clean and perturbed image. We\ndemonstrate strong transferability of our generated adversarial perturbations\nthrough extensive cross-domain and cross-model experiments, while keeping the\ninference time complexity.", "paper_summary_zh": "深度神经网络因其对抗性范例固有的可转移性而容易受到安全风险的攻击。尽管最近基于生成模型的攻击取得了成功，展示了很强的可转移性，但在实际严格的黑盒设置中设计一种有效的攻击策略仍然是一个挑战，其中目标域和模型架构都是未知的。在本文中，我们试图在频域中探索一种特征对比方法，以生成在跨域和跨模型设置中都鲁棒的对抗性示例。基于这一目标，我们提出了两个仅在训练阶段使用的模块：一个频率感知域随机化 (FADR) 模块，用于随机化域变体低频和高频分量，以及一个频率增强对比学习 (FACL) 模块，用于有效分离干净图像和扰动图像的域不变中频特征。我们通过广泛的跨域和跨模型实验展示了我们生成的对抗性扰动的强大可转移性，同时保持了推理时间复杂度。", "author": "Hunmin Yang et.al.", "authors": "Hunmin Yang, Jongoh Jeong, Kuk-Jin Yoon", "id": "2407.20653v1", "paper_url": "http://arxiv.org/abs/2407.20653v1", "repo": "null"}}