{"2502.12965": {"publish_time": "2025-02-18", "title": "A Survey of Text Classification Under Class Distribution Shift", "paper_summary": "The basic underlying assumption of machine learning (ML) models is that the\ntraining and test data are sampled from the same distribution. However, in\ndaily practice, this assumption is often broken, i.e.~the distribution of the\ntest data changes over time, which hinders the application of conventional ML\nmodels. One domain where the distribution shift naturally occurs is text\nclassification, since people always find new topics to discuss. To this end, we\nsurvey research articles studying open-set text classification and related\ntasks. We divide the methods in this area based on the constraints that define\nthe kind of distribution shift and the corresponding problem formulation,\ni.e.~learning with the Universum, zero-shot learning, and open-set learning. We\nnext discuss the predominant mitigation approaches for each problem setup.\nFinally, we identify several future work directions, aiming to push the\nboundaries beyond the state of the art. Interestingly, we find that continual\nlearning can solve many of the issues caused by the shifting class\ndistribution. We maintain a list of relevant papers at\nhttps://github.com/Eduard6421/Open-Set-Survey.", "paper_summary_zh": "機器學習 (ML) 模型的基本假設是訓練資料和測試資料取樣自同一個分佈。然而，在日常實務中，這個假設經常被打破，也就是說測試資料的分布會隨著時間改變，這會阻礙傳統 ML 模型的應用。分佈轉移自然發生的其中一個領域是文字分類，因為人們總能找到新的主題來討論。為此，我們調查研究開放集文字分類和相關任務的研究文章。我們根據定義分佈轉移的類型和對應問題公式的限制，將這個領域的方法分為：使用 Universum 學習、零次學習和開放集學習。接下來，我們討論每個問題設定的主要緩解方法。最後，我們找出幾個未來的研究方向，目標是將界線推展到現有技術的極限之外。有趣的是，我們發現持續學習可以解決許多由類別分佈轉移所造成的議題。我們在 https://github.com/Eduard6421/Open-Set-Survey 維護一份相關論文清單。", "author": "Adriana Valentina Costache et.al.", "authors": "Adriana Valentina Costache, Silviu Florin Gheorghe, Eduard Gabriel Poesina, Paul Irofti, Radu Tudor Ionescu", "id": "2502.12965v1", "paper_url": "http://arxiv.org/abs/2502.12965v1", "repo": "null"}}