{"2410.14579": {"publish_time": "2024-10-18", "title": "Towards Unsupervised Validation of Anomaly-Detection Models", "paper_summary": "Unsupervised validation of anomaly-detection models is a highly challenging\ntask. While the common practices for model validation involve a labeled\nvalidation set, such validation sets cannot be constructed when the underlying\ndatasets are unlabeled. The lack of robust and efficient unsupervised\nmodel-validation techniques presents an acute challenge in the implementation\nof automated anomaly-detection pipelines, especially when there exists no prior\nknowledge of the model's performance on similar datasets. This work presents a\nnew paradigm to automated validation of anomaly-detection models, inspired by\nreal-world, collaborative decision-making mechanisms. We focus on two\ncommonly-used, unsupervised model-validation tasks -- model selection and model\nevaluation -- and provide extensive experimental results that demonstrate the\naccuracy and robustness of our approach on both tasks.", "paper_summary_zh": "異常偵測模型的無監督驗證是一項極具挑戰性的任務。雖然模型驗證的常見做法涉及標記驗證集，但在基礎資料集未標記時無法建構此類驗證集。缺乏穩健且有效的無監督模型驗證技術在自動化異常偵測管線的實作中造成嚴峻挑戰，特別是在對模型在類似資料集上的效能沒有先驗知識時。本研究提出了一種新的範例，用於異常偵測模型的自動化驗證，其靈感來自於現實世界的協作決策機制。我們專注於兩個常見的無監督模型驗證任務：模型選擇和模型評估，並提供廣泛的實驗結果，證明了我們的方法在兩個任務上的準確性和穩健性。", "author": "Lihi Idan et.al.", "authors": "Lihi Idan", "id": "2410.14579v1", "paper_url": "http://arxiv.org/abs/2410.14579v1", "repo": "null"}}