{"2501.08850": {"publish_time": "2025-01-15", "title": "Graph Counterfactual Explainable AI via Latent Space Traversal", "paper_summary": "Explaining the predictions of a deep neural network is a nontrivial task, yet\nhigh-quality explanations for predictions are often a prerequisite for\npractitioners to trust these models. Counterfactual explanations aim to explain\npredictions by finding the ''nearest'' in-distribution alternative input whose\nprediction changes in a pre-specified way. However, it remains an open question\nhow to define this nearest alternative input, whose solution depends on both\nthe domain (e.g. images, graphs, tabular data, etc.) and the specific\napplication considered. For graphs, this problem is complicated i) by their\ndiscrete nature, as opposed to the continuous nature of state-of-the-art graph\nclassifiers; and ii) by the node permutation group acting on the graphs. We\npropose a method to generate counterfactual explanations for any differentiable\nblack-box graph classifier, utilizing a case-specific permutation equivariant\ngraph variational autoencoder. We generate counterfactual explanations in a\ncontinuous fashion by traversing the latent space of the autoencoder across the\nclassification boundary of the classifier, allowing for seamless integration of\ndiscrete graph structure and continuous graph attributes. We empirically\nvalidate the approach on three graph datasets, showing that our model is\nconsistently high-performing and more robust than the baselines.", "paper_summary_zh": "解釋深度神經網路的預測並非易事，但高品質的預測解釋通常是實務人員信賴這些模型的先決條件。反事實解釋旨在透過尋找預測以預先指定方式改變的「最近」同分佈替代輸入，來解釋預測。然而，如何定義這個最近的替代輸入仍然是一個開放問題，其解決方案取決於領域（例如影像、圖表、表格資料等）和所考慮的特定應用程式。對於圖表而言，這個問題的複雜性在於：i）與最先進圖表分類器的連續性質相反，圖表的離散性質；以及 ii）作用於圖表的節點置換群。我們提出一個方法，利用特定案例置換等變圖表變異自動編碼器，為任何可微分的黑盒圖表分類器產生反事實解釋。我們透過在分類器分類邊界上穿越自動編碼器的潛在空間，以連續的方式產生反事實解釋，允許離散圖表結構和連續圖表屬性的無縫整合。我們在三個圖表資料集上實證驗證了此方法，顯示我們的模型效能始終很高，且比基線更強健。", "author": "Andreas Abildtrup Hansen et.al.", "authors": "Andreas Abildtrup Hansen, Paraskevas Pegios, Anna Calissano, Aasa Feragen", "id": "2501.08850v1", "paper_url": "http://arxiv.org/abs/2501.08850v1", "repo": "null"}}