{"2406.19356": {"publish_time": "2024-06-27", "title": "DiVERT: Distractor Generation with Variational Errors Represented as Text for Math Multiple-choice Questions", "paper_summary": "High-quality distractors are crucial to both the assessment and pedagogical\nvalue of multiple-choice questions (MCQs), where manually crafting ones that\nanticipate knowledge deficiencies or misconceptions among real students is\ndifficult. Meanwhile, automated distractor generation, even with the help of\nlarge language models (LLMs), remains challenging for subjects like math. It is\ncrucial to not only identify plausible distractors but also understand the\nerror behind them. In this paper, we introduce DiVERT (Distractor Generation\nwith Variational Errors Represented as Text), a novel variational approach that\nlearns an interpretable representation of errors behind distractors in math\nMCQs. Through experiments on a real-world math MCQ dataset with 1,434 questions\nused by hundreds of thousands of students, we show that DiVERT, despite using a\nbase open-source LLM with 7B parameters, outperforms state-of-the-art\napproaches using GPT-4o on downstream distractor generation. We also conduct a\nhuman evaluation with math educators and find that DiVERT leads to error labels\nthat are of comparable quality to human-authored ones.", "paper_summary_zh": "優質的干擾選項對於多選題 (MCQ) 的評量和教學價值至關重要，而手動製作能預期到真實學生知識不足或觀念錯誤的選項很困難。同時，自動化干擾選項生成，即使在大型語言模型 (LLM) 的協助下，對於數學等科目而言仍然具有挑戰性。不僅要找出合理的干擾選項，還要了解其背後的錯誤至關重要。在本文中，我們介紹 DiVERT（以文字表示的變異錯誤干擾選項生成），這是一種新穎的變異方法，可以學習數學多選題中干擾選項背後錯誤的可詮釋表示。透過對 1,434 個問題的真實世界數學多選題資料集進行實驗，數十萬名學生使用這些問題，我們展示了 DiVERT，儘管使用帶有 7B 參數的基本開源 LLM，但在下游干擾選項生成中優於使用 GPT-4o 的最先進方法。我們還與數學教育工作者進行了人工評量，發現 DiVERT 產生的錯誤標籤與人工編寫的標籤品質相當。", "author": "Nigel Fernandez et.al.", "authors": "Nigel Fernandez, Alexander Scarlatos, Simon Woodhead, Andrew Lan", "id": "2406.19356v1", "paper_url": "http://arxiv.org/abs/2406.19356v1", "repo": "null"}}