{"2406.02105": {"publish_time": "2024-06-04", "title": "Kernel vs. Kernel: Exploring How the Data Structure Affects Neural Collapse", "paper_summary": "Recently, a vast amount of literature has focused on the \"Neural Collapse\"\n(NC) phenomenon, which emerges when training neural network (NN) classifiers\nbeyond the zero training error point. The core component of NC is the decrease\nin the within class variability of the network's deepest features, dubbed as\nNC1. The theoretical works that study NC are typically based on simplified\nunconstrained features models (UFMs) that mask any effect of the data on the\nextent of collapse. In this paper, we provide a kernel-based analysis that does\nnot suffer from this limitation. First, given a kernel function, we establish\nexpressions for the traces of the within- and between-class covariance matrices\nof the samples' features (and consequently an NC1 metric). Then, we turn to\nfocus on kernels associated with shallow NNs. First, we consider the NN\nGaussian Process kernel (NNGP), associated with the network at initialization,\nand the complement Neural Tangent Kernel (NTK), associated with its training in\nthe \"lazy regime\". Interestingly, we show that the NTK does not represent more\ncollapsed features than the NNGP for prototypical data models. As NC emerges\nfrom training, we then consider an alternative to NTK: the recently proposed\nadaptive kernel, which generalizes NNGP to model the feature mapping learned\nfrom the training data. Contrasting our NC1 analysis for these two kernels\nenables gaining insights into the effect of data distribution on the extent of\ncollapse, which are empirically aligned with the behavior observed with\npractical training of NNs.", "paper_summary_zh": "<paragraph>最近，大量文献关注「神经崩塌」(NC)现象，此现象在神经网络 (NN) 分类器训练超越零训练误差点时出现。NC 的核心组件是网络最深层特征的类内变异性降低，称为 NC1。研究 NC 的理论工作通常基于简化的无约束特征模型 (UFM)，其掩盖了数据对崩塌程度的任何影响。在本文中，我们提供了一种基于核的分析，不受此限制。首先，给定一个核函数，我们建立样本特征的类内和类间协方差矩阵迹的表达式（因此也是 NC1 度量）。然后，我们专注于与浅层 NN 相关的核。首先，我们考虑 NN 高斯过程核 (NNGP)，它与初始化时的网络相关，以及与在「惰性模式」中训练相关的补集神经切线核 (NTK)。有趣的是，我们表明 NTK 对于原型数据模型并不表示比 NNGP 更多的崩塌特征。当 NC 从训练中出现时，我们考虑 NTK 的替代方案：最近提出的自适应核，它概括了 NNGP 以建模从训练数据中学到的特征映射。对比这两个核的 NC1 分析，可以深入了解数据分布对崩塌程度的影响，这与 NN 实际训练中观察到的行为在经验上是一致的。</paragraph>", "author": "Vignesh Kothapalli et.al.", "authors": "Vignesh Kothapalli, Tom Tirer", "id": "2406.02105v1", "paper_url": "http://arxiv.org/abs/2406.02105v1", "repo": "null"}}