{"2501.13824": {"publish_time": "2025-01-23", "title": "Hallucinations Can Improve Large Language Models in Drug Discovery", "paper_summary": "Concerns about hallucinations in Large Language Models (LLMs) have been\nraised by researchers, yet their potential in areas where creativity is vital,\nsuch as drug discovery, merits exploration. In this paper, we come up with the\nhypothesis that hallucinations can improve LLMs in drug discovery. To verify\nthis hypothesis, we use LLMs to describe the SMILES string of molecules in\nnatural language and then incorporate these descriptions as part of the prompt\nto address specific tasks in drug discovery. Evaluated on seven LLMs and five\nclassification tasks, our findings confirm the hypothesis: LLMs can achieve\nbetter performance with text containing hallucinations. Notably, Llama-3.1-8B\nachieves an 18.35% gain in ROC-AUC compared to the baseline without\nhallucination. Furthermore, hallucinations generated by GPT-4o provide the most\nconsistent improvements across models. Additionally, we conduct empirical\nanalyses and a case study to investigate key factors affecting performance and\nthe underlying reasons. Our research sheds light on the potential use of\nhallucinations for LLMs and offers new perspectives for future research\nleveraging LLMs in drug discovery.", "paper_summary_zh": "大型语言模型 (LLM) 中的幻觉问题已被研究人员提出，但其在创造力至关重要的领域（例如药物发现）中的潜力值得探索。在本文中，我们提出了一个假设，即幻觉可以改善 LLM 在药物发现中的表现。为了验证这个假设，我们使用 LLM 用自然语言描述分子的 SMILES 字符串，然后将这些描述作为提示的一部分，以解决药物发现中的特定任务。在七个 LLM 和五个分类任务上的评估中，我们的发现证实了这一假设：LLM 可以通过包含幻觉的文本获得更好的性能。值得注意的是，与没有幻觉的基线相比，Llama-3.1-8B 在 ROC-AUC 中获得了 18.35% 的收益。此外，GPT-4o 生成的幻觉在所有模型中提供了最一致的改进。此外，我们进行了实证分析和案例研究，以调查影响性能的关键因素和潜在原因。我们的研究揭示了幻觉在 LLM 中的潜在用途，并为未来利用 LLM 进行药物发现的研究提供了新的视角。", "author": "Shuzhou Yuan et.al.", "authors": "Shuzhou Yuan, Michael Färber", "id": "2501.13824v1", "paper_url": "http://arxiv.org/abs/2501.13824v1", "repo": "null"}}