{"2410.12672": {"publish_time": "2024-10-16", "title": "Context Matters: Leveraging Contextual Features for Time Series Forecasting", "paper_summary": "Time series forecasts are often influenced by exogenous contextual features\nin addition to their corresponding history. For example, in financial settings,\nit is hard to accurately predict a stock price without considering public\nsentiments and policy decisions in the form of news articles, tweets, etc.\nThough this is common knowledge, the current state-of-the-art (SOTA)\nforecasting models fail to incorporate such contextual information, owing to\nits heterogeneity and multimodal nature. To address this, we introduce\nContextFormer, a novel plug-and-play method to surgically integrate multimodal\ncontextual information into existing pre-trained forecasting models.\nContextFormer effectively distills forecast-specific information from rich\nmultimodal contexts, including categorical, continuous, time-varying, and even\ntextual information, to significantly enhance the performance of existing base\nforecasters. ContextFormer outperforms SOTA forecasting models by up to 30% on\na range of real-world datasets spanning energy, traffic, environmental, and\nfinancial domains.", "paper_summary_zh": "時間序列預測通常會受到外生脈絡特徵的影響，除了對應的歷史記錄之外。例如，在金融環境中，在不考慮新聞文章、推文等形式的公眾情緒和政策決策的情況下，很難準確預測股票價格。儘管這是常識，但當前最先進 (SOTA) 預測模型無法整合此類脈絡資訊，因為它的異質性和多模態性質。為了解決這個問題，我們引入了 ContextFormer，這是一種新穎的即插即用方法，用於將多模態脈絡資訊外科手術式整合到現有的預訓練預測模型中。ContextFormer 有效地從豐富的多模態脈絡中提取預測特定資訊，包括分類、連續、時變，甚至文字資訊，以顯著增強現有基礎預測器的效能。ContextFormer 在涵蓋能源、交通、環境和金融領域的一系列真實世界資料集上，比 SOTA 預測模型高出 30%。", "author": "Sameep Chattopadhyay et.al.", "authors": "Sameep Chattopadhyay, Pulkit Paliwal, Sai Shankar Narasimhan, Shubhankar Agarwal, Sandeep P. Chinchali", "id": "2410.12672v1", "paper_url": "http://arxiv.org/abs/2410.12672v1", "repo": "null"}}