{"2502.10062": {"publish_time": "2025-02-14", "title": "Adaptive Bi-Level Multi-Robot Task Allocation and Learning under Uncertainty with Temporal Logic Constraints", "paper_summary": "This work addresses the problem of multi-robot coordination under unknown\nrobot transition models, ensuring that tasks specified by Time Window Temporal\nLogic are satisfied with user-defined probability thresholds. We present a\nbi-level framework that integrates (i) high-level task allocation, where tasks\nare assigned based on the robots' estimated task completion probabilities and\nexpected rewards, and (ii) low-level distributed policy learning and execution,\nwhere robots independently optimize auxiliary rewards while fulfilling their\nassigned tasks. To handle uncertainty in robot dynamics, our approach leverages\nreal-time task execution data to iteratively refine expected task completion\nprobabilities and rewards, enabling adaptive task allocation without explicit\nrobot transition models. We theoretically validate the proposed algorithm,\ndemonstrating that the task assignments meet the desired probability thresholds\nwith high confidence. Finally, we demonstrate the effectiveness of our\nframework through comprehensive simulations.", "paper_summary_zh": "本研究解決了在未知機器人轉換模型下多機器人協調的問題，確保由時間窗口時序邏輯規定的任務滿足使用者定義的機率閥值。我們提出一個雙層架構，整合 (i) 高層級任務分配，其中任務根據機器人的估計任務完成機率和預期獎勵分配，以及 (ii) 低層級分散策略學習和執行，其中機器人在執行分配的任務時獨立最佳化輔助獎勵。為了處理機器人動態中的不確定性，我們的做法利用即時任務執行資料來反覆調整預期的任務完成機率和獎勵，在沒有明確機器人轉換模型的情況下實現自適應任務分配。我們在理論上驗證了所提出的演算法，證明任務分配以高信心滿足所需的機率閥值。最後，我們透過全面的模擬證明了我們架構的有效性。", "author": "Xiaoshan Lin et.al.", "authors": "Xiaoshan Lin, Roberto Tron", "id": "2502.10062v1", "paper_url": "http://arxiv.org/abs/2502.10062v1", "repo": "null"}}