{"2409.19884": {"publish_time": "2024-09-30", "title": "SWIM: Short-Window CNN Integrated with Mamba for EEG-Based Auditory Spatial Attention Decoding", "paper_summary": "In complex auditory environments, the human auditory system possesses the\nremarkable ability to focus on a specific speaker while disregarding others. In\nthis study, a new model named SWIM, a short-window convolution neural network\n(CNN) integrated with Mamba, is proposed for identifying the locus of auditory\nattention (left or right) from electroencephalography (EEG) signals without\nrelying on speech envelopes. SWIM consists of two parts. The first is a\nshort-window CNN (SW$_\\text{CNN}$), which acts as a short-term EEG feature\nextractor and achieves a final accuracy of 84.9% in the leave-one-speaker-out\nsetup on the widely used KUL dataset. This improvement is due to the use of an\nimproved CNN structure, data augmentation, multitask training, and model\ncombination. The second part, Mamba, is a sequence model first applied to\nauditory spatial attention decoding to leverage the long-term dependency from\nprevious SW$_\\text{CNN}$ time steps. By joint training SW$_\\text{CNN}$ and\nMamba, the proposed SWIM structure uses both short-term and long-term\ninformation and achieves an accuracy of 86.2%, which reduces the classification\nerrors by a relative 31.0% compared to the previous state-of-the-art result.\nThe source code is available at https://github.com/windowso/SWIM-ASAD.", "paper_summary_zh": "在複雜的聽覺環境中，人類聽覺系統擁有專注於特定說話者，同時忽視其他說話者的非凡能力。在這項研究中，提出了一個名為 SWIM 的新模型，一個與 Mamba 整合的短時窗卷積神經網路 (CNN)，用於從腦電圖 (EEG) 信號中識別聽覺注意力的位置 (左或右)，而不依賴語音包絡。SWIM 由兩部分組成。第一個是短時窗 CNN (SW$_\\text{CNN}$)，它充當短期 EEG 特徵提取器，並在廣泛使用的 KUL 資料集上在留一說話者法設定中達到 84.9% 的最終準確度。這種改進是歸功於使用改進的 CNN 結構、資料擴充、多任務訓練和模型組合。第二部分 Mamba 是一個序列模型，首先應用於聽覺空間注意力解碼，以利用來自先前 SW$_\\text{CNN}$ 時間步長的長期依賴性。透過聯合訓練 SW$_\\text{CNN}$ 和 Mamba，提出的 SWIM 結構使用短期和長期資訊，並達到 86.2% 的準確度，與先前的最先進結果相比，將分類錯誤減少了相對的 31.0%。原始碼可在 https://github.com/windowso/SWIM-ASAD 取得。", "author": "Ziyang Zhang et.al.", "authors": "Ziyang Zhang, Andrew Thwaites, Alexandra Woolgar, Brian Moore, Chao Zhang", "id": "2409.19884v1", "paper_url": "http://arxiv.org/abs/2409.19884v1", "repo": "https://github.com/windowso/swim-asad"}}