{"2410.07009": {"publish_time": "2024-10-09", "title": "Pap2Pat: Towards Automated Paper-to-Patent Drafting using Chunk-based Outline-guided Generation", "paper_summary": "The patent domain is gaining attention in natural language processing\nresearch, offering practical applications in streamlining the patenting process\nand providing challenging benchmarks for large language models (LLMs). However,\nthe generation of the description sections of patents, which constitute more\nthan 90% of the patent document, has not been studied to date. We address this\ngap by introducing the task of outline-guided paper-to-patent generation, where\nan academic paper provides the technical specification of the invention and an\noutline conveys the desired patent structure. We present PAP2PAT, a new\nchallenging benchmark of 1.8k patent-paper pairs with document outlines,\ncollected using heuristics that reflect typical research lab practices. Our\nexperiments with current open-weight LLMs and outline-guided chunk-based\ngeneration show that they can effectively use information from the paper but\nstruggle with repetitions, likely due to the inherent repetitiveness of patent\nlanguage. We release our data and code.", "paper_summary_zh": "專利領域在自然語言處理研究中備受關注，在簡化專利流程和為大型語言模型 (LLM) 提供具有挑戰性的基準方面提供實用應用。然而，專利說明書部分的產生，其構成專利文件 90% 以上的內容，迄今為止尚未經過研究。我們透過引入綱要引導的論文轉專利產生任務來解決這個差距，其中學術論文提供發明的技術規範，而綱要傳達所需的專利結構。我們提出 PAP2PAT，一個新的具有挑戰性的基準，包含 1.8k 專利論文對，以及使用反映典型研究實驗室實務的啟發法收集的的文件綱要。我們使用目前的開放權重 LLM 和綱要引導的區塊式產生進行的實驗顯示，它們可以有效地使用論文中的資訊，但會遇到重複的問題，這可能是由於專利語言固有的重複性。我們釋出我們的資料和程式碼。", "author": "Valentin Knappich et.al.", "authors": "Valentin Knappich, Simon Razniewski, Anna Hätty, Annemarie Friedrich", "id": "2410.07009v1", "paper_url": "http://arxiv.org/abs/2410.07009v1", "repo": "null"}}