{"2502.04882": {"publish_time": "2025-02-07", "title": "pytopicgram: A library for data extraction and topic modeling from Telegram channels", "paper_summary": "Telegram is a popular platform for public communication, generating large\namounts of messages through its channels. pytopicgram is a Python library that\nhelps researchers collect, organize, and analyze these Telegram messages. The\nlibrary offers key features such as easy message retrieval, detailed channel\ninformation, engagement metrics, and topic identification using advanced\nmodeling techniques. By simplifying data extraction and analysis, pytopicgram\nallows users to understand how content spreads and how audiences interact on\nTelegram. This paper describes the design, main features, and practical uses of\n\\pytopicgram, showcasing its effectiveness for studying public conversations on\nTelegram.", "paper_summary_zh": "Telegram 是一个用于公开交流的热门平台，通过其频道生成大量消息。pytopicgram 是一个 Python 库，可帮助研究人员收集、整理和分析这些 Telegram 消息。该库提供了一些关键功能，例如轻松检索消息、详细的频道信息、参与度指标以及使用高级建模技术识别主题。通过简化数据提取和分析，pytopicgram 允许用户了解内容如何在 Telegram 上传播以及受众如何在 Telegram 上互动。本文介绍了 \\pytopicgram 的设计、主要功能和实际用法，展示了其在研究 Telegram 上的公开对话方面的有效性。", "author": "J. Gómez-Romero et.al.", "authors": "J. Gómez-Romero, J. Cantón Correa, R. Pérez Mercado, F. Prados Abad, M. Molina-Solana, W. Fajardo", "id": "2502.04882v1", "paper_url": "http://arxiv.org/abs/2502.04882v1", "repo": "null"}}