{"2501.01282": {"publish_time": "2025-01-02", "title": "CultureVLM: Characterizing and Improving Cultural Understanding of Vision-Language Models for over 100 Countries", "paper_summary": "Vision-language models (VLMs) have advanced human-AI interaction but struggle\nwith cultural understanding, often misinterpreting symbols, gestures, and\nartifacts due to biases in predominantly Western-centric training data. In this\npaper, we construct CultureVerse, a large-scale multimodal benchmark covering\n19, 682 cultural concepts, 188 countries/regions, 15 cultural concepts, and 3\nquestion types, with the aim of characterizing and improving VLMs'\nmulticultural understanding capabilities. Then, we propose CultureVLM, a series\nof VLMs fine-tuned on our dataset to achieve significant performance\nimprovement in cultural understanding. Our evaluation of 16 models reveals\nsignificant disparities, with a stronger performance in Western concepts and\nweaker results in African and Asian contexts. Fine-tuning on our CultureVerse\nenhances cultural perception, demonstrating cross-cultural, cross-continent,\nand cross-dataset generalization without sacrificing performance on models'\ngeneral VLM benchmarks. We further present insights on cultural generalization\nand forgetting. We hope that this work could lay the foundation for more\nequitable and culturally aware multimodal AI systems.", "paper_summary_zh": "視覺語言模型 (VLM) 促進了人類與人工智慧的互動，但卻在文化理解方面遇到困難，由於以西方為主的訓練資料中的偏見，常常誤解符號、手勢和文物。在本文中，我們建構了 CultureVerse，一個涵蓋 19,682 個文化概念、188 個國家/地區、15 個文化概念和 3 種問題類型的大規模多模態基準，目的是描述和改善 VLM 的多元文化理解能力。然後，我們提出了 CultureVLM，這是一系列針對我們的資料集進行微調的 VLM，以在文化理解方面實現顯著的效能提升。我們對 16 個模型的評估顯示出顯著的差異，在西方概念中表現較佳，而在非洲和亞洲背景中的結果較差。針對我們的 CultureVerse 進行微調可以增強文化認知，展示跨文化、跨洲和跨資料集的概化，而不會犧牲模型在一般 VLM 基準上的效能。我們進一步提出了關於文化概化和遺忘的見解。我們希望這項工作可以為更公平且具有文化意識的多模態人工智慧系統奠定基礎。", "author": "Shudong Liu et.al.", "authors": "Shudong Liu, Yiqiao Jin, Cheng Li, Derek F. Wong, Qingsong Wen, Lichao Sun, Haipeng Chen, Xing Xie, Jindong Wang", "id": "2501.01282v1", "paper_url": "http://arxiv.org/abs/2501.01282v1", "repo": "null"}}