{"2407.19813": {"publish_time": "2024-07-29", "title": "Improving Retrieval Augmented Language Model with Self-Reasoning", "paper_summary": "The Retrieval-Augmented Language Model (RALM) has shown remarkable\nperformance on knowledge-intensive tasks by incorporating external knowledge\nduring inference, which mitigates the factual hallucinations inherited in large\nlanguage models (LLMs). Despite these advancements, challenges persist in the\nimplementation of RALMs, particularly concerning their reliability and\ntraceability. To be specific, the irrelevant document retrieval may result in\nunhelpful response generation or even deteriorate the performance of LLMs,\nwhile the lack of proper citations in generated outputs complicates efforts to\nverify the trustworthiness of the models. To this end, we propose a novel\nself-reasoning framework aimed at improving the reliability and traceability of\nRALMs, whose core idea is to leverage reasoning trajectories generated by the\nLLM itself. The framework involves constructing self-reason trajectories with\nthree processes: a relevance-aware process, an evidence-aware selective\nprocess, and a trajectory analysis process. We have evaluated our framework\nacross four public datasets (two short-form QA datasets, one long-form QA\ndataset, and one fact verification dataset) to demonstrate the superiority of\nour method, which can outperform existing state-of-art models and can achieve\ncomparable performance with GPT-4, while only using 2,000 training samples.", "paper_summary_zh": "檢索增強語言模型 (RALM) 在知識密集型任務中展現出卓越的表現，方法是在推論過程中納入外部知識，這減輕了大型語言模型 (LLM) 中繼承而來的虛構事實。儘管有這些進展，在 RALM 的實作中仍然存在挑戰，特別是關於它們的可靠性和可追溯性。具體來說，不相關的文件檢索可能會導致無益的回應產生，甚至會降低 LLM 的效能，而產生的輸出中缺乏適當的引文，使得驗證模型可信度的努力變得複雜。為此，我們提出了一個新穎的自推理架構，旨在提高 RALM 的可靠性和可追溯性，其核心思想是利用 LLM 本身產生的推理軌跡。該框架涉及使用三個流程來建構自推理軌跡：與相關性相關的流程、與證據相關的選擇性流程和軌跡分析流程。我們已經在四個公開數據集（兩個簡短問答數據集、一個長篇問答數據集和一個事實驗證數據集）中評估了我們的框架，以證明我們的方法的優越性，它可以優於現有的最先進模型，並且可以達到與 GPT-4 相當的效能，而只使用 2,000 個訓練樣本。", "author": "Yuan Xia et.al.", "authors": "Yuan Xia, Jingbo Zhou, Zhenhui Shi, Jun Chen, Haifeng Huang", "id": "2407.19813v1", "paper_url": "http://arxiv.org/abs/2407.19813v1", "repo": "null"}}