{"2407.13757": {"publish_time": "2024-07-18", "title": "Black-Box Opinion Manipulation Attacks to Retrieval-Augmented Generation of Large Language Models", "paper_summary": "Retrieval-Augmented Generation (RAG) is applied to solve hallucination\nproblems and real-time constraints of large language models, but it also\ninduces vulnerabilities against retrieval corruption attacks. Existing research\nmainly explores the unreliability of RAG in white-box and closed-domain QA\ntasks. In this paper, we aim to reveal the vulnerabilities of\nRetrieval-Enhanced Generative (RAG) models when faced with black-box attacks\nfor opinion manipulation. We explore the impact of such attacks on user\ncognition and decision-making, providing new insight to enhance the reliability\nand security of RAG models. We manipulate the ranking results of the retrieval\nmodel in RAG with instruction and use these results as data to train a\nsurrogate model. By employing adversarial retrieval attack methods to the\nsurrogate model, black-box transfer attacks on RAG are further realized.\nExperiments conducted on opinion datasets across multiple topics show that the\nproposed attack strategy can significantly alter the opinion polarity of the\ncontent generated by RAG. This demonstrates the model's vulnerability and, more\nimportantly, reveals the potential negative impact on user cognition and\ndecision-making, making it easier to mislead users into accepting incorrect or\nbiased information.", "paper_summary_zh": "檢索增強生成 (RAG) 用於解決大型語言模型的幻覺問題和即時約束，但它也會引發對檢索破壞攻擊的漏洞。現有研究主要探討 RAG 在白盒和封閉域 QA 任務中的不可靠性。在本文中，我們旨在揭示檢索增強生成 (RAG) 模型在面對意見操縱的黑盒攻擊時的漏洞。我們探討了此類攻擊對使用者認知和決策制定的影響，並提供新的見解來增強 RAG 模型的可靠性和安全性。我們使用說明操縱 RAG 中檢索模型的排名結果，並使用這些結果作為資料來訓練代理模型。通過對代理模型採用對抗性檢索攻擊方法，進一步實現了對 RAG 的黑盒傳輸攻擊。在多個主題的意見資料集上進行的實驗表明，所提出的攻擊策略可以顯著改變 RAG 生成的內容的意見極性。這證明了模型的脆弱性，更重要的是，揭示了對使用者認知和決策制定的潛在負面影響，使得誤導使用者接受不正確或有偏見的資訊變得更加容易。", "author": "Zhuo Chen et.al.", "authors": "Zhuo Chen, Jiawei Liu, Haotan Liu, Qikai Cheng, Fan Zhang, Wei Lu, Xiaozhong Liu", "id": "2407.13757v1", "paper_url": "http://arxiv.org/abs/2407.13757v1", "repo": "null"}}