{"2502.04684": {"publish_time": "2025-02-07", "title": "G2PDiffusion: Genotype-to-Phenotype Prediction with Diffusion Models", "paper_summary": "Discovering the genotype-phenotype relationship is crucial for genetic\nengineering, which will facilitate advances in fields such as crop breeding,\nconservation biology, and personalized medicine. Current research usually\nfocuses on single species and small datasets due to limitations in phenotypic\ndata collection, especially for traits that require visual assessments or\nphysical measurements. Deciphering complex and composite phenotypes, such as\nmorphology, from genetic data at scale remains an open question. To break\nthrough traditional generic models that rely on simplified assumptions, this\npaper introduces G2PDiffusion, the first-of-its-kind diffusion model designed\nfor genotype-to-phenotype generation across multiple species. Specifically, we\nuse images to represent morphological phenotypes across species and redefine\nphenotype prediction as conditional image generation. To this end, this paper\nintroduces an environment-enhanced DNA sequence conditioner and trains a stable\ndiffusion model with a novel alignment method to improve genotype-to-phenotype\nconsistency. Extensive experiments demonstrate that our approach enhances\nphenotype prediction accuracy across species, capturing subtle genetic\nvariations that contribute to observable traits.", "paper_summary_zh": "發現基因型與表型之間的關係對於遺傳工程至關重要，這將促進作物育種、保育生物學和個人化醫療等領域的進展。由於表型數據收集的限制，當前研究通常集中於單一物種和小數據集，特別是對於需要視覺評估或物理測量的性狀。從遺傳數據中破譯複雜和複合的表型（例如形態）仍然是一個懸而未決的問題。為了突破依賴於簡化假設的傳統通用模型，本文介紹了 G2PDiffusion，這是一個首創的擴散模型，專門用於跨多個物種進行基因型到表型的生成。具體來說，我們使用圖像來表示跨物種的形態表型，並將表型預測重新定義為條件圖像生成。為此，本文介紹了一個環境增強的 DNA 序列調節器，並訓練了一個具有新對齊方法的穩定擴散模型，以提高基因型到表型的稠密性。大量的實驗表明，我們的做法提高了跨物種的表型預測準確度，捕捉到導致可觀察性狀的細微遺傳變異。", "author": "Mengdi Liu et.al.", "authors": "Mengdi Liu, Zhangyang Gao, Hong Chang, Stan Z. Li, Shiguang Shan, Xinlin Chen", "id": "2502.04684v1", "paper_url": "http://arxiv.org/abs/2502.04684v1", "repo": "null"}}