{"2502.15359": {"publish_time": "2025-02-21", "title": "ARS: Automatic Routing Solver with Large Language Models", "paper_summary": "Real-world Vehicle Routing Problems (VRPs) are characterized by a variety of\npractical constraints, making manual solver design both knowledge-intensive and\ntime-consuming. Although there is increasing interest in automating the design\nof routing algorithms, existing research has explored only a limited array of\nVRP variants and fails to adequately address the complex and prevalent\nconstraints encountered in real-world situations. To fill this gap, this paper\nintroduces RoutBench, a benchmark of 1,000 VRP variants derived from 24\nattributes, for evaluating the effectiveness of automatic routing solvers in\naddressing complex constraints. Along with RoutBench, we present the Automatic\nRouting Solver (ARS), which employs Large Language Model (LLM) agents to\nenhance a backbone algorithm framework by automatically generating\nconstraint-aware heuristic code, based on problem descriptions and several\nrepresentative constraints selected from a database. Our experiments show that\nARS outperforms state-of-the-art LLM-based methods and commonly used solvers,\nautomatically solving 91.67% of common VRPs and achieving at least a 30%\nimprovement across all benchmarks.", "paper_summary_zh": "現實世界的車輛路徑問題 (VRP) 的特點是具有各種實際限制，使得手動求解器設計既需要大量知識，又耗時費力。儘管自動化路徑演算法設計越來越受到關注，但現有的研究僅探討了有限的 VRP 變體，未能充分解決現實世界中遇到的複雜且普遍存在的限制。為了填補這一空白，本文介紹了 RoutBench，這是一個由 24 個屬性衍生的 1,000 個 VRP 變體的基準，用於評估自動路徑求解器在解決複雜限制方面的有效性。除了 RoutBench，我們還展示了自動路徑求解器 (ARS)，它採用大型語言模型 (LLM) 代理，透過根據問題描述和從資料庫中選取的幾個代表性限制自動產生具約束意識的啟發式程式碼，來增強主幹演算法架構。我們的實驗表明，ARS 優於最先進的基於 LLM 的方法和常用的求解器，自動解決了 91.67% 的常見 VRP，並且在所有基準測試中都實現了至少 30% 的改進。", "author": "Kai Li et.al.", "authors": "Kai Li, Fei Liu, Zhenkun Wang, Xialiang Tong, Xiongwei Han, Mingxuan Yuan", "id": "2502.15359v1", "paper_url": "http://arxiv.org/abs/2502.15359v1", "repo": "null"}}