{"2408.04831": {"publish_time": "2024-08-09", "title": "Self-augmented Gaussian Splatting with Structure-aware Masks for Sparse-view 3D Reconstruction", "paper_summary": "Sparse-view 3D reconstruction stands as a formidable challenge in computer\nvision, aiming to build complete three-dimensional models from a limited array\nof viewing perspectives. This task confronts several difficulties: 1) the\nlimited number of input images that lack consistent information; 2) dependence\non the quality of input images; and 3) the substantial size of model\nparameters. To address these challenges, we propose a self-augmented\ncoarse-to-fine Gaussian splatting paradigm, enhanced with a structure-aware\nmask, for sparse-view 3D reconstruction. In particular, our method initially\nemploys a coarse Gaussian model to obtain a basic 3D representation from\nsparse-view inputs. Subsequently, we develop a fine Gaussian network to enhance\nconsistent and detailed representation of the output with both 3D geometry\naugmentation and perceptual view augmentation. During training, we design a\nstructure-aware masking strategy to further improve the model's robustness\nagainst sparse inputs and noise.Experimental results on the MipNeRF360 and\nOmniObject3D datasets demonstrate that the proposed method achieves\nstate-of-the-art performances for sparse input views in both perceptual quality\nand efficiency.", "paper_summary_zh": "稀疏視圖 3D 重建是電腦視覺中的一項艱鉅挑戰，目的是從有限的視角陣列中建立完整的立體模型。此任務面臨數項困難：1) 輸入影像數量有限，且缺乏一致性資訊；2) 依賴輸入影像的品質；3) 模型參數的龐大規模。為了應對這些挑戰，我們提出一個自增強的粗糙到精細高斯噴繪範例，並透過結構感知遮罩增強，進行稀疏視圖 3D 重建。特別是，我們的技術最初採用粗糙高斯模型，從稀疏視圖輸入中取得基本的 3D 呈現。隨後，我們開發一個精細高斯網路，透過 3D 幾何增強和感知視圖增強，來增強輸出的一致性和詳細呈現。在訓練期間，我們設計一個結構感知遮罩策略，進一步提升模型對稀疏輸入和雜訊的穩健性。在 MipNeRF360 和 OmniObject3D 資料集上的實驗結果證明，所提出的技術在稀疏輸入視圖中，無論在感知品質或效率上，都達到了最先進的效能。", "author": "Lingbei Meng et.al.", "authors": "Lingbei Meng, Bi'an Du, Wei Hu", "id": "2408.04831v1", "paper_url": "http://arxiv.org/abs/2408.04831v1", "repo": "null"}}