{"2409.15868": {"publish_time": "2024-09-24", "title": "Privacy Evaluation Benchmarks for NLP Models", "paper_summary": "By inducing privacy attacks on NLP models, attackers can obtain sensitive\ninformation such as training data and model parameters, etc. Although\nresearchers have studied, in-depth, several kinds of attacks in NLP models,\nthey are non-systematic analyses. It lacks a comprehensive understanding of the\nimpact caused by the attacks. For example, we must consider which scenarios can\napply to which attacks, what the common factors are that affect the performance\nof different attacks, the nature of the relationships between different\nattacks, and the influence of various datasets and models on the effectiveness\nof the attacks, etc. Therefore, we need a benchmark to holistically assess the\nprivacy risks faced by NLP models. In this paper, we present a privacy attack\nand defense evaluation benchmark in the field of NLP, which includes the\nconventional/small models and large language models (LLMs). This benchmark\nsupports a variety of models, datasets, and protocols, along with standardized\nmodules for comprehensive evaluation of attacks and defense strategies. Based\non the above framework, we present a study on the association between auxiliary\ndata from different domains and the strength of privacy attacks. And we provide\nan improved attack method in this scenario with the help of Knowledge\nDistillation (KD). Furthermore, we propose a chained framework for privacy\nattacks. Allowing a practitioner to chain multiple attacks to achieve a\nhigher-level attack objective. Based on this, we provide some defense and\nenhanced attack strategies. The code for reproducing the results can be found\nat https://github.com/user2311717757/nlp_doctor.", "paper_summary_zh": "<paragraph>透過對 NLP 模型發動隱私攻擊，攻擊者可以取得訓練資料、模型參數等敏感資訊。儘管研究人員深入研究了 NLP 模型中各種攻擊，但這些分析並非系統性的。它缺乏對攻擊所造成影響的全面理解。例如，我們必須考慮哪些場景可以應用於哪些攻擊、影響不同攻擊效能的共同因素是什麼、不同攻擊之間關係的性質以及各種資料集和模型對攻擊有效性的影響等。因此，我們需要一個基準來全面評估 NLP 模型面臨的隱私風險。在本文中，我們提出了 NLP 領域中的隱私攻擊和防禦評估基準，其中包括傳統/小型模型和大語言模型 (LLM)。此基準支援各種模型、資料集和協定，以及用於全面評估攻擊和防禦策略的標準化模組。基於上述架構，我們提出了一項關於不同領域的輔助資料與隱私攻擊強度之間關聯性的研究。我們在這種情況下提供了一種改良的攻擊方法，並借助知識蒸餾 (KD) 來進行。此外，我們提出了隱私攻擊的鏈式架構。允許從業人員鏈接多個攻擊以達成更高級別的攻擊目標。基於此，我們提供了一些防禦和增強攻擊策略。可以在 https://github.com/user2311717757/nlp_doctor 中找到重現結果的程式碼。</paragraph>", "author": "Wei Huang et.al.", "authors": "Wei Huang, Yinggui Wang, Cen Chen", "id": "2409.15868v2", "paper_url": "http://arxiv.org/abs/2409.15868v2", "repo": "https://github.com/user2311717757/nlp_doctor"}}