{"2412.07255": {"publish_time": "2024-12-10", "title": "Label-Confidence-Aware Uncertainty Estimation in Natural Language Generation", "paper_summary": "Large Language Models (LLMs) display formidable capabilities in generative\ntasks but also pose potential risks due to their tendency to generate\nhallucinatory responses. Uncertainty Quantification (UQ), the evaluation of\nmodel output reliability, is crucial for ensuring the safety and robustness of\nAI systems. Recent studies have concentrated on model uncertainty by analyzing\nthe relationship between output entropy under various sampling conditions and\nthe corresponding labels. However, these methods primarily focus on measuring\nmodel entropy with precision to capture response characteristics, often\nneglecting the uncertainties associated with greedy decoding results-the\nsources of model labels, which can lead to biased classification outcomes. In\nthis paper, we explore the biases introduced by greedy decoding and propose a\nlabel-confidence-aware (LCA) uncertainty estimation based on Kullback-Leibler\n(KL) divergence bridging between samples and label source, thus enhancing the\nreliability and stability of uncertainty assessments. Our empirical evaluations\nacross a range of popular LLMs and NLP datasets reveal that different label\nsources can indeed affect classification, and that our approach can effectively\ncapture differences in sampling results and label sources, demonstrating more\neffective uncertainty estimation.", "paper_summary_zh": "大型語言模型 (LLM) 在生成任務中展現出強大的能力，但由於它們傾向於產生幻覺反應，也帶來了潛在風險。不確定量化 (UQ) 是模型輸出可靠性的評估，對於確保 AI 系統的安全性和穩健性至關重要。最近的研究集中在模型不確定性上，分析了在各種抽樣條件下輸出熵與對應標籤之間的關係。然而，這些方法主要集中於準確測量模型熵以捕捉響應特徵，常常忽略與貪婪解碼結果相關的不確定性，即模型標籤的來源，這可能導致分類結果有偏差。在本文中，我們探討了貪婪解碼引入的偏差，並提出了一個基於 Kullback-Leibler (KL) 散度的標籤置信度感知 (LCA) 不確定性估計，在樣本和標籤來源之間建立橋樑，從而增強不確定性評估的可靠性和穩定性。我們對一系列流行的 LLM 和 NLP 資料集進行的實證評估表明，不同的標籤來源確實會影響分類，並且我們的做法可以有效地捕捉抽樣結果和標籤來源的差異，證明更有效的不確定性估計。", "author": "Qinhong Lin et.al.", "authors": "Qinhong Lin, Linna Zhou, Zhongliang Yang, Yuang Cai", "id": "2412.07255v1", "paper_url": "http://arxiv.org/abs/2412.07255v1", "repo": "null"}}