{"2406.10855": {"publish_time": "2024-06-16", "title": "ALPS: An Auto-Labeling and Pre-training Scheme for Remote Sensing Segmentation With Segment Anything Model", "paper_summary": "In the fast-growing field of Remote Sensing (RS) image analysis, the gap\nbetween massive unlabeled datasets and the ability to fully utilize these\ndatasets for advanced RS analytics presents a significant challenge. To fill\nthe gap, our work introduces an innovative auto-labeling framework named ALPS\n(Automatic Labeling for Pre-training in Segmentation), leveraging the Segment\nAnything Model (SAM) to predict precise pseudo-labels for RS images without\nnecessitating prior annotations or additional prompts. The proposed pipeline\nsignificantly reduces the labor and resource demands traditionally associated\nwith annotating RS datasets. By constructing two comprehensive pseudo-labeled\nRS datasets via ALPS for pre-training purposes, our approach enhances the\nperformance of downstream tasks across various benchmarks, including iSAID and\nISPRS Potsdam. Experiments demonstrate the effectiveness of our framework,\nshowcasing its ability to generalize well across multiple tasks even under the\nscarcity of extensively annotated datasets, offering a scalable solution to\nautomatic segmentation and annotation challenges in the field. In addition, the\nproposed a pipeline is flexible and can be applied to medical image\nsegmentation, remarkably boosting the performance. Note that ALPS utilizes\npre-trained SAM to semi-automatically annotate RS images without additional\nmanual annotations. Though every component in the pipeline has bee well\nexplored, integrating clustering algorithms with SAM and novel pseudo-label\nalignment significantly enhances RS segmentation, as an off-the-shelf tool for\npre-training data preparation. Our source code is available at:\nhttps://github.com/StriveZs/ALPS.", "paper_summary_zh": "<paragraph>在快速發展的遙感 (RS) 影像分析領域中，海量未標籤資料集與充分利用這些資料集進行進階 RS 分析的能力之間的差距，是一個重大的挑戰。為了填補這個差距，我們的研究引入了名為 ALPS (分段預訓練自動標籤) 的創新自動標籤框架，利用任何分段模型 (SAM) 來預測 RS 影像的精確偽標籤，而不需要事先註解或額外的提示。所提出的管線大幅減少了傳統上與註解 RS 資料集相關的人力和資源需求。透過 ALPS 為預訓練目的建構兩個全面的偽標籤 RS 資料集，我們的做法增強了各種基準（包括 iSAID 和 ISPRS Potsdam）中下游任務的效能。實驗證明了我們框架的有效性，展示了其即使在廣泛註解資料集稀缺的情況下，也能跨多個任務進行良好概化的能力，為該領域的自動分段和註解挑戰提供了可擴充的解決方案。此外，所提出的管線具有彈性，且可應用於醫學影像分段，顯著提升效能。請注意，ALPS 利用預訓練的 SAM 來半自動註解 RS 影像，而不需要額外的標籤。儘管管線中的每個元件都已充分探討，但將分群演算法與 SAM 整合，以及新穎的偽標籤比對，顯著增強了 RS 分段，作為預訓練資料準備的現成工具。我們的原始程式碼可在以下網址取得：https://github.com/StriveZs/ALPS。</paragraph>", "author": "Song Zhang et.al.", "authors": "Song Zhang, Qingzhong Wang, Junyi Liu, Haoyi Xiong", "id": "2406.10855v1", "paper_url": "http://arxiv.org/abs/2406.10855v1", "repo": "https://github.com/strivezs/alps"}}