{"2412.07730": {"publish_time": "2024-12-10", "title": "STIV: Scalable Text and Image Conditioned Video Generation", "paper_summary": "The field of video generation has made remarkable advancements, yet there\nremains a pressing need for a clear, systematic recipe that can guide the\ndevelopment of robust and scalable models. In this work, we present a\ncomprehensive study that systematically explores the interplay of model\narchitectures, training recipes, and data curation strategies, culminating in a\nsimple and scalable text-image-conditioned video generation method, named STIV.\nOur framework integrates image condition into a Diffusion Transformer (DiT)\nthrough frame replacement, while incorporating text conditioning via a joint\nimage-text conditional classifier-free guidance. This design enables STIV to\nperform both text-to-video (T2V) and text-image-to-video (TI2V) tasks\nsimultaneously. Additionally, STIV can be easily extended to various\napplications, such as video prediction, frame interpolation, multi-view\ngeneration, and long video generation, etc. With comprehensive ablation studies\non T2I, T2V, and TI2V, STIV demonstrate strong performance, despite its simple\ndesign. An 8.7B model with 512 resolution achieves 83.1 on VBench T2V,\nsurpassing both leading open and closed-source models like CogVideoX-5B, Pika,\nKling, and Gen-3. The same-sized model also achieves a state-of-the-art result\nof 90.1 on VBench I2V task at 512 resolution. By providing a transparent and\nextensible recipe for building cutting-edge video generation models, we aim to\nempower future research and accelerate progress toward more versatile and\nreliable video generation solutions.", "paper_summary_zh": "影片生成領域已取得顯著進展，但仍迫切需要一個清晰且系統化的配方，以引導穩健且可擴充模型的開發。在這項工作中，我們提出了一項全面性的研究，系統性地探討模型架構、訓練配方和資料策展策略的交互作用，最終形成一種簡單且可擴充的文字影像條件影片生成方法，稱為 STIV。我們的架構透過畫面替換將影像條件整合到擴散轉換器 (DiT) 中，同時透過聯合影像文字條件分類器自由引導來納入文字條件。此設計讓 STIV 能夠同時執行文字轉影片 (T2V) 和文字影像轉影片 (TI2V) 任務。此外，STIV 可以輕鬆延伸至各種應用，例如影片預測、畫面內插、多視圖生成和長影片生成等。透過對 T2I、T2V 和 TI2V 進行全面的消融研究，STIV 展現出強大的效能，儘管其設計簡單。一個解析度為 512 的 8.7B 模型在 VBench T2V 上達到 83.1，超越了 CogVideoX-5B、Pika、Kling 和 Gen-3 等領先的開放和閉源模型。相同大小的模型在解析度為 512 的 VBench I2V 任務上也達到了 90.1 的最新技術成果。透過提供一個透明且可擴充的配方來建構尖端的影片生成模型，我們旨在賦能未來的研究，並加速朝向更通用且可靠的影片生成解決方案邁進。", "author": "Zongyu Lin et.al.", "authors": "Zongyu Lin, Wei Liu, Chen Chen, Jiasen Lu, Wenze Hu, Tsu-Jui Fu, Jesse Allardice, Zhengfeng Lai, Liangchen Song, Bowen Zhang, Cha Chen, Yiran Fei, Yifan Jiang, Lezhi Li, Yizhou Sun, Kai-Wei Chang, Yinfei Yang", "id": "2412.07730v1", "paper_url": "http://arxiv.org/abs/2412.07730v1", "repo": "null"}}