{"2410.11348": {"publish_time": "2024-10-15", "title": "RATE: Score Reward Models with Imperfect Rewrites of Rewrites", "paper_summary": "This paper concerns the evaluation of reward models used in language\nmodeling. A reward model is a function that takes a prompt and a response and\nassigns a score indicating how good that response is for the prompt. A key\nchallenge is that reward models are usually imperfect proxies for actual\npreferences. For example, we may worry that a model trained to reward\nhelpfulness learns to instead prefer longer responses. In this paper, we\ndevelop an evaluation method, RATE (Rewrite-based Attribute Treatment\nEstimators), that allows us to measure the causal effect of a given attribute\nof a response (e.g., length) on the reward assigned to that response. The core\nidea is to use large language models to rewrite responses to produce imperfect\ncounterfactuals, and to adjust for rewriting error by rewriting twice. We show\nthat the RATE estimator is consistent under reasonable assumptions. We\ndemonstrate the effectiveness of RATE on synthetic and real-world data, showing\nthat it can accurately estimate the effect of a given attribute on the reward\nmodel.", "paper_summary_zh": "本文涉及對語言模型中使用的獎勵模型的評估。獎勵模型是一個函數，它接收提示和回應，並指派一個分數，表示該回應對提示有多好。一個關鍵的挑戰在於，獎勵模型通常是不完美的代理，無法反映實際偏好。例如，我們可能擔心一個訓練成獎勵有用的模型，反而學會偏好較長的回應。在本文中，我們開發了一個評估方法 RATE（基於改寫的屬性處理估計器），它讓我們能夠測量回應的給定屬性（例如，長度）對指派給該回應的獎勵的因果關係。核心概念是使用大型語言模型改寫回應來產生不完美的反事實，並通過重複改寫來調整改寫誤差。我們表明，在合理的假設下，RATE 估計器是一致的。我們在合成和真實世界資料上展示了 RATE 的有效性，表明它可以準確估計給定屬性對獎勵模型的影響。", "author": "David Reber et.al.", "authors": "David Reber, Sean Richardson, Todd Nief, Cristina Garbacea, Victor Veitch", "id": "2410.11348v1", "paper_url": "http://arxiv.org/abs/2410.11348v1", "repo": "https://github.com/toddnief/rate"}}