{"2406.15007": {"publish_time": "2024-06-21", "title": "RouteFinder: Towards Foundation Models for Vehicle Routing Problems", "paper_summary": "Vehicle Routing Problems (VRPs) are optimization problems with significant\nreal-world implications in logistics, transportation, and supply chain\nmanagement. Despite the recent progress made in learning to solve individual\nVRP variants, there is a lack of a unified approach that can effectively tackle\na wide range of tasks, which is crucial for real-world impact. This paper\nintroduces RouteFinder, a framework for developing foundation models for VRPs.\nOur key idea is that a foundation model for VRPs should be able to model\nvariants by treating each variant as a subset of a larger VRP problem, equipped\nwith different attributes. We introduce a parallelized environment that can\nhandle any combination of attributes at the same time in a batched manner, and\nan efficient sampling procedure to train on a mix of problems at each\noptimization step that can greatly improve convergence robustness. We also\nintroduce novel Global Feature Embeddings that project instance-wise attributes\nefficiently onto the latent space and help the model understand different VRP\nvariants. Finally, we introduce Efficient Adapter Layers, a simple yet\neffective technique to finetune pre-trained RouteFinder models to solve novel\nvariants with previously unseen attributes outside of the original feature\nspace. We validate our approach through extensive experiments on 24 VRP\nvariants, demonstrating competitive results over recent multi-task learning\nmodels. We make our code openly available at\nhttps://github.com/ai4co/routefinder.", "paper_summary_zh": "車輛路線問題 (VRP) 是最佳化問題，在物流、運輸和供應鏈管理中具有重要的現實世界意義。儘管在學習解決個別 VRP 變體方面取得了進展，但缺乏統一的方法來有效應對廣泛的任務，這對於現實世界的影響至關重要。本文介紹了 RouteFinder，一個用於開發 VRP 基礎模型的框架。我們的關鍵思想是，VRP 的基礎模型應該能夠通過將每個變體視為具有不同屬性的較大 VRP 問題的子集來建模變體。我們引入了一個並行環境，它可以同時以批次方式處理任何屬性組合，並在每個最佳化步驟中引入一個有效的採樣程序來訓練混合問題，這可以大大提高收斂魯棒性。我們還引入了新的全局特徵嵌入，它將實例屬性有效地投影到潛在空間，並幫助模型理解不同的 VRP 變體。最後，我們引入了高效適配層，這是一種簡單但有效的技術，用於微調預先訓練的 RouteFinder 模型，以解決原始特徵空間之外具有以前未見屬性的新變體。我們通過對 24 個 VRP 變體進行廣泛的實驗驗證了我們的做法，展示了優於近期多任務學習模型的競爭結果。我們在 https://github.com/ai4co/routefinder 上公開我們的代碼。", "author": "Federico Berto et.al.", "authors": "Federico Berto, Chuanbo Hua, Nayeli Gast Zepeda, André Hottung, Niels Wouda, Leon Lan, Kevin Tierney, Jinkyoo Park", "id": "2406.15007v1", "paper_url": "http://arxiv.org/abs/2406.15007v1", "repo": "null"}}