{"2412.00136": {"publish_time": "2024-11-28", "title": "FonTS: Text Rendering with Typography and Style Controls", "paper_summary": "Visual text images are prevalent in various applications, requiring careful\nfont selection and typographic choices. Recent advances in Diffusion\nTransformer (DiT)-based text-to-image (T2I) models show promise in automating\nthese processes. However, these methods still face challenges such as\ninconsistent fonts, style variation, and limited fine-grained control,\nparticularly at the word level. This paper proposes a two-stage DiT-based\npipeline to address these issues by enhancing controllability over typography\nand style in text rendering. We introduce Typography Control (TC) finetuning,\nan efficient parameter fine-tuning method, and enclosing typography control\ntokens (ETC-tokens), which enable precise word-level application of typographic\nfeatures. To further enhance style control, we present a Style Control Adapter\n(SCA) that injects style information through image inputs independent of text\nprompts. Through comprehensive experiments, we demonstrate the effectiveness of\nour approach in achieving superior word-level typographic control, font\nconsistency, and style consistency in Basic and Artistic Text Rendering (BTR\nand ATR) tasks. Our results mark a significant advancement in the precision and\nadaptability of T2I models, presenting new possibilities for creative\napplications and design-oriented tasks.", "paper_summary_zh": "視覺文字圖像在各種應用中很普遍，需要仔細選擇字體和排版選項。最近在基於擴散轉換器 (DiT) 的文字轉圖像 (T2I) 模型的進展顯示出自動化這些程序的潛力。然而，這些方法仍然面臨諸如字體不一致、樣式變化和有限的細粒度控制等挑戰，特別是在文字層級。本文提出了一個基於 DiT 的兩階段管道來解決這些問題，方法是增強對文字渲染中的排版和樣式的可控性。我們引入了排版控制 (TC) 微調，一種高效的參數微調方法，以及封裝排版控制代幣 (ETC 代幣)，它能精確地應用字體功能在文字層級。為了進一步增強樣式控制，我們提出了一個樣式控制適配器 (SCA)，它通過圖像輸入注入樣式資訊，而與文字提示無關。透過全面的實驗，我們證明了我們的方法在實現優異的文字層級排版控制、字體一致性和基本和藝術文字渲染 (BTR 和 ATR) 任務中的樣式一致性方面的有效性。我們的結果標誌著 T2I 模型的精確度和適應性的重大進展，為創意應用和設計導向任務提供了新的可能性。", "author": "Wenda Shi et.al.", "authors": "Wenda Shi, Yiren Song, Dengming Zhang, Jiaming Liu, Xingxing Zou", "id": "2412.00136v1", "paper_url": "http://arxiv.org/abs/2412.00136v1", "repo": "null"}}