{"2501.00750": {"publish_time": "2025-01-01", "title": "Beyond Text: Implementing Multimodal Large Language Model-Powered Multi-Agent Systems Using a No-Code Platform", "paper_summary": "This study proposes the design and implementation of a multimodal LLM-based\nMulti-Agent System (MAS) leveraging a No-Code platform to address the practical\nconstraints and significant entry barriers associated with AI adoption in\nenterprises. Advanced AI technologies, such as Large Language Models (LLMs),\noften pose challenges due to their technical complexity and high implementation\ncosts, making them difficult for many organizations to adopt. To overcome these\nlimitations, this research develops a No-Code-based Multi-Agent System designed\nto enable users without programming knowledge to easily build and manage AI\nsystems. The study examines various use cases to validate the applicability of\nAI in business processes, including code generation from image-based notes,\nAdvanced RAG-based question-answering systems, text-based image generation, and\nvideo generation using images and prompts. These systems lower the barriers to\nAI adoption, empowering not only professional developers but also general users\nto harness AI for significantly improved productivity and efficiency. By\ndemonstrating the scalability and accessibility of No-Code platforms, this\nstudy advances the democratization of AI technologies within enterprises and\nvalidates the practical applicability of Multi-Agent Systems, ultimately\ncontributing to the widespread adoption of AI across various industries.", "paper_summary_zh": "本研究提出一個多模態 LLM 為基礎的多主體系統 (MAS) 的設計與實作，利用無程式碼平台來解決企業採用 AI 時所面臨的實際限制和顯著的進入障礙。進階 AI 技術（例如大型語言模型 (LLM)）通常會因為技術複雜性和高實作成本而帶來挑戰，讓許多組織難以採用。為了克服這些限制，本研究開發了一個基於無程式碼的多主體系統，讓沒有程式設計知識的使用者可以輕鬆建置和管理 AI 系統。本研究檢視了各種使用案例，驗證 AI 在商業流程中的適用性，包括從影像筆記產生程式碼、基於 RAG 的進階問答系統、基於文字的影像產生，以及使用影像和提示產生影片。這些系統降低了 AI 採用的障礙，不僅讓專業開發人員，也讓一般使用者能夠利用 AI 大幅提升生產力和效率。透過展示無程式碼平台的可擴充性和可近性，本研究推動了企業內 AI 技術的民主化，並驗證了多主體系統的實際適用性，最終有助於 AI 在各產業的廣泛採用。", "author": "Cheonsu Jeong et.al.", "authors": "Cheonsu Jeong", "id": "2501.00750v1", "paper_url": "http://arxiv.org/abs/2501.00750v1", "repo": "null"}}