{"2410.14515": {"publish_time": "2024-10-18", "title": "Efficient Annotator Reliability Assessment and Sample Weighting for Knowledge-Based Misinformation Detection on Social Media", "paper_summary": "Misinformation spreads rapidly on social media, confusing the truth and\ntargetting potentially vulnerable people. To effectively mitigate the negative\nimpact of misinformation, it must first be accurately detected before applying\na mitigation strategy, such as X's community notes, which is currently a manual\nprocess. This study takes a knowledge-based approach to misinformation\ndetection, modelling the problem similarly to one of natural language\ninference. The EffiARA annotation framework is introduced, aiming to utilise\ninter- and intra-annotator agreement to understand the reliability of each\nannotator and influence the training of large language models for\nclassification based on annotator reliability. In assessing the EffiARA\nannotation framework, the Russo-Ukrainian Conflict Knowledge-Based\nMisinformation Classification Dataset (RUC-MCD) was developed and made publicly\navailable. This study finds that sample weighting using annotator reliability\nperforms the best, utilising both inter- and intra-annotator agreement and\nsoft-label training. The highest classification performance achieved using\nLlama-3.2-1B was a macro-F1 of 0.757 and 0.740 using TwHIN-BERT-large.", "paper_summary_zh": "错误讯息在社交媒体上快速散播，混淆了真相，并针对可能容易受骗的人。为了有效减轻错误讯息的负面影响，必须先准确地侦测出错误讯息，然后再应用缓解策略，例如 X 的社群笔记，这目前是一个手动的程序。本研究采取基于知识的方法来侦测错误讯息，将问题建模为类似于自然语言推论的问题。引入了 EffiARA 标注框架，旨在利用标注者之间和标注者内部的一致性来了解每个标注者的可靠性，并影响大型语言模型的训练，以便根据标注者的可靠性进行分类。在评估 EffiARA 标注框架时，开发了俄乌冲突知识型错误讯息分类数据集 (RUC-MCD)，并公开提供。本研究发现，使用标注者可靠性进行样本加权表现最佳，同时利用标注者之间和标注者内部的一致性，以及软标签训练。使用 Llama-3.2-1B 达到的最高分类效能，使用 TwHIN-BERT-large 时，宏观 F1 分别为 0.757 和 0.740。", "author": "Owen Cook et.al.", "authors": "Owen Cook, Charlie Grimshaw, Ben Wu, Sophie Dillon, Jack Hicks, Luke Jones, Thomas Smith, Matyas Szert, Xingyi Song", "id": "2410.14515v1", "paper_url": "http://arxiv.org/abs/2410.14515v1", "repo": "https://github.com/minieggz/ruc-misinfo"}}