{"2502.14727": {"publish_time": "2025-02-20", "title": "WavRAG: Audio-Integrated Retrieval Augmented Generation for Spoken Dialogue Models", "paper_summary": "Retrieval Augmented Generation (RAG) has gained widespread adoption owing to\nits capacity to empower large language models (LLMs) to integrate external\nknowledge. However, existing RAG frameworks are primarily designed for\ntext-based LLMs and rely on Automatic Speech Recognition to process speech\ninput, which discards crucial audio information, risks transcription errors,\nand increases computational overhead. Therefore, we introduce WavRAG, the first\nretrieval augmented generation framework with native, end-to-end audio support.\nWavRAG offers two key features: 1) Bypassing ASR, WavRAG directly processes raw\naudio for both embedding and retrieval. 2) WavRAG integrates audio and text\ninto a unified knowledge representation. Specifically, we propose the\nWavRetriever to facilitate the retrieval from a text-audio hybrid knowledge\nbase, and further enhance the in-context capabilities of spoken dialogue models\nthrough the integration of chain-of-thought reasoning. In comparison to\nstate-of-the-art ASR-Text RAG pipelines, WavRAG achieves comparable retrieval\nperformance while delivering a 10x acceleration. Furthermore, WavRAG's unique\ntext-audio hybrid retrieval capability extends the boundaries of RAG to the\naudio modality.", "paper_summary_zh": "檢索增強生成 (RAG) 因其賦能大型語言模型 (LLM) 整合外部知識的能力而獲得廣泛採用。然而，現有的 RAG 框架主要設計用於基於文字的 LLM，並依賴自動語音辨識處理語音輸入，這會捨棄重要的音訊資訊、有轉錄錯誤的風險，並增加運算負擔。因此，我們引入了 WavRAG，這是第一個具備原生端對端音訊支援的檢索增強生成框架。WavRAG 提供兩個主要功能：1) 繞過 ASR，WavRAG 直接處理原始音訊以進行嵌入和檢索。2) WavRAG 將音訊和文字整合到統一的知識表示中。具體來說，我們提出了 WavRetriever 以利於從文字音訊混合知識庫中進行檢索，並透過整合思考鏈推理進一步增強對話模型的語境能力。與最先進的 ASR 文字 RAG 管線相比，WavRAG 達到了相當的檢索效能，同時提供了 10 倍的加速。此外，WavRAG 獨特的文字音訊混合檢索能力將 RAG 的界線延伸到音訊模式。", "author": "Yifu Chen et.al.", "authors": "Yifu Chen, Shengpeng Ji, Haoxiao Wang, Ziqing Wang, Siyu Chen, Jinzheng He, Jin Xu, Zhou Zhao", "id": "2502.14727v1", "paper_url": "http://arxiv.org/abs/2502.14727v1", "repo": "null"}}