{"2501.08188": {"publish_time": "2025-01-14", "title": "A Critical Synthesis of Uncertainty Quantification and Foundation Models in Monocular Depth Estimation", "paper_summary": "While recent foundation models have enabled significant breakthroughs in\nmonocular depth estimation, a clear path towards safe and reliable deployment\nin the real-world remains elusive. Metric depth estimation, which involves\npredicting absolute distances, poses particular challenges, as even the most\nadvanced foundation models remain prone to critical errors. Since quantifying\nthe uncertainty has emerged as a promising endeavor to address these\nlimitations and enable trustworthy deployment, we fuse five different\nuncertainty quantification methods with the current state-of-the-art\nDepthAnythingV2 foundation model. To cover a wide range of metric depth\ndomains, we evaluate their performance on four diverse datasets. Our findings\nidentify fine-tuning with the Gaussian Negative Log-Likelihood Loss (GNLL) as a\nparticularly promising approach, offering reliable uncertainty estimates while\nmaintaining predictive performance and computational efficiency on par with the\nbaseline, encompassing both training and inference time. By fusing uncertainty\nquantification and foundation models within the context of monocular depth\nestimation, this paper lays a critical foundation for future research aimed at\nimproving not only model performance but also its explainability. Extending\nthis critical synthesis of uncertainty quantification and foundation models\ninto other crucial tasks, such as semantic segmentation and pose estimation,\npresents exciting opportunities for safer and more reliable machine vision\nsystems.", "paper_summary_zh": "儘管近期基礎模型在單眼深度估計方面取得重大突破，但通往現實世界中安全且可靠部署的明確路徑仍難以捉摸。度量深度估計涉及預測絕對距離，這會造成特定的挑戰，因為即使是最先進的基礎模型仍容易出現重大錯誤。由於量化不確定性已成為了解決這些限制和實現可信賴部署的潛力方法，我們將五種不同的不確定性量化方法與當前最先進的 DepthAnythingV2 基礎模型融合在一起。為了涵蓋廣泛的度量深度領域，我們在四個不同的資料集上評估其效能。我們的研究結果發現，使用高斯負對數似然損失 (GNLL) 進行微調是一種特別有前途的方法，它在維持預測效能和運算效率與基準相當時，提供可靠的不確定性估計，涵蓋訓練和推論時間。透過在單眼深度估計的背景下融合不確定性量化和基礎模型，本文為未來的研究奠定了重要的基礎，旨在不僅提升模型效能，也提升其可解釋性。將不確定性量化和基礎模型的這種重要綜合延伸到其他關鍵任務中，例如語意分割和姿勢估計，為更安全、更可靠的機器視覺系統提供了令人興奮的機會。", "author": "Steven Landgraf et.al.", "authors": "Steven Landgraf, Rongjun Qin, Markus Ulrich", "id": "2501.08188v1", "paper_url": "http://arxiv.org/abs/2501.08188v1", "repo": "null"}}