{"2210.13535": {"publish_time": "2022-10-24", "title": "Human-centered XAI for Burn Depth Characterization", "paper_summary": "Approximately 1.25 million people in the United States are treated each year\nfor burn injuries. Precise burn injury classification is an important aspect of\nthe medical AI field. In this work, we propose an explainable human-in-the-loop\nframework for improving burn ultrasound classification models. Our framework\nleverages an explanation system based on the LIME classification explainer to\ncorroborate and integrate a burn expert's knowledge -- suggesting new features\nand ensuring the validity of the model. Using this framework, we discover that\nB-mode ultrasound classifiers can be enhanced by supplying textural features.\nMore specifically, we confirm that texture features based on the Gray Level\nCo-occurance Matrix (GLCM) of ultrasound frames can increase the accuracy of\ntransfer learned burn depth classifiers. We test our hypothesis on real data\nfrom porcine subjects. We show improvements in the accuracy of burn depth\nclassification -- from ~88% to ~94% -- once modified according to our\nframework.", "paper_summary_zh": "美國每年約有 125 萬人接受燒傷治療。準確的燒傷分類是醫療 AI 領域的重要面向。在此研究中，我們提出一個可解釋的迴圈中的人類框架，用於改善燒傷超音波分類模型。我們的框架利用基於 LIME 分類解釋器的解釋系統，來驗證和整合燒傷專家的知識，建議新的特徵並確保模型的有效性。使用此框架，我們發現 B 型超音波分類器可透過提供紋理特徵來增強。更具體地說，我們確認基於超音波影像的灰階共生矩陣 (GLCM) 的紋理特徵，可以提高轉移學習的燒傷深度分類器的準確性。我們在豬隻受試者的真實資料上測試我們的假設。我們顯示出在根據我們的框架修改後，燒傷深度分類的準確性有所提升，從約 88% 提升至約 94%。", "author": "Maxwell J. Jacobson et.al.", "authors": "Maxwell J. Jacobson, Daniela Chanci Arrubla, Maria Romeo Tricas, Gayle Gordillo, Yexiang Xue, Chandan Sen, Juan Wachs", "id": "2210.13535v2", "paper_url": "http://arxiv.org/abs/2210.13535v2", "repo": "null"}}