{"2503.05683": {"publish_time": "2025-03-07", "title": "Understanding the Limits of Lifelong Knowledge Editing in LLMs", "paper_summary": "Keeping large language models factually up-to-date is crucial for deployment,\nyet costly retraining remains a challenge. Knowledge editing offers a promising\nalternative, but methods are only tested on small-scale or synthetic edit\nbenchmarks. In this work, we aim to bridge research into lifelong knowledge\nediting to real-world edits at practically relevant scale. We first introduce\nWikiBigEdit; a large-scale benchmark of real-world Wikidata edits, built to\nautomatically extend lifelong for future-proof benchmarking. In its first\ninstance, it includes over 500K question-answer pairs for knowledge editing\nalongside a comprehensive evaluation pipeline. Finally, we use WikiBigEdit to\nstudy existing knowledge editing techniques' ability to incorporate large\nvolumes of real-world facts and contrast their capabilities to generic\nmodification techniques such as retrieval augmentation and continual finetuning\nto acquire a complete picture of the practical extent of current lifelong\nknowledge editing.", "paper_summary_zh": "保持大型語言模型的資訊與時俱進對於部署至關重要，然而，成本高昂的重新訓練仍然是一個挑戰。知識編輯提供了一個有希望的替代方案，但這些方法僅在小規模或合成的編輯基準上進行了測試。在這項工作中，我們的目標是將終身知識編輯的研究與實際相關規模的真實世界編輯聯繫起來。我們首先介紹 WikiBigEdit；這是一個大規模的真實世界 Wikidata 編輯基準，旨在自動擴展終身性以實現面向未來的基準測試。在其第一個實例中，它包含超過 50 萬個用於知識編輯的問答對以及一個全面的評估流程。最後，我們使用 WikiBigEdit 來研究現有知識編輯技術整合大量真實世界事實的能力，並將其功能與檢索增強和持續微調等通用修改技術進行對比，以全面了解當前終身知識編輯的實際程度。\n", "author": "Lukas Thede et.al.", "authors": "Lukas Thede, Karsten Roth, Matthias Bethge, Zeynep Akata, Tom Hartvigsen", "id": "2503.05683v1", "paper_url": "http://arxiv.org/abs/2503.05683v1", "repo": "null"}}