{"2412.19396": {"publish_time": "2024-12-27", "title": "Comparing Few to Rank Many: Active Human Preference Learning using Randomized Frank-Wolfe", "paper_summary": "We study learning of human preferences from a limited comparison feedback.\nThis task is ubiquitous in machine learning. Its applications such as\nreinforcement learning from human feedback, have been transformational. We\nformulate this problem as learning a Plackett-Luce model over a universe of $N$\nchoices from $K$-way comparison feedback, where typically $K \\ll N$. Our\nsolution is the D-optimal design for the Plackett-Luce objective. The design\ndefines a data logging policy that elicits comparison feedback for a small\ncollection of optimally chosen points from all ${N \\choose K}$ feasible\nsubsets. The main algorithmic challenge in this work is that even fast methods\nfor solving D-optimal designs would have $O({N \\choose K})$ time complexity. To\naddress this issue, we propose a randomized Frank-Wolfe (FW) algorithm that\nsolves the linear maximization sub-problems in the FW method on randomly chosen\nvariables. We analyze the algorithm, and evaluate it empirically on synthetic\nand open-source NLP datasets.", "paper_summary_zh": "我們研究從有限的比較回饋中學習人類偏好的方法。\n這項任務在機器學習中無所不在。它的應用，例如從人類回饋中強化學習，已經產生變革。我們將這個問題表述為學習一個 Plackett-Luce 模型，從 $N$ 個選擇中，透過 $K$ 向比較回饋來學習，其中通常 $K \\ll N$。我們的解決方案是針對 Plackett-Luce 目標的 D 最佳設計。該設計定義了一個資料記錄政策，它會從所有 ${N \\choose K}$ 可行子集中，引發對少數最佳選擇點的比較回饋。這項工作中主要的演算法挑戰在於，即使是解決 D 最佳設計的快速方法，也會有 $O({N \\choose K})$ 的時間複雜度。為了解決這個問題，我們提出一個隨機化 Frank-Wolfe (FW) 演算法，它在 FW 方法中，針對隨機選擇的變數來解決線性最大化子問題。我們分析了該演算法，並在合成和開源的 NLP 資料集上對它進行經驗評估。", "author": "Kiran Koshy Thekumparampil et.al.", "authors": "Kiran Koshy Thekumparampil, Gaurush Hiranandani, Kousha Kalantari, Shoham Sabach, Branislav Kveton", "id": "2412.19396v1", "paper_url": "http://arxiv.org/abs/2412.19396v1", "repo": "null"}}