{"2501.05058": {"publish_time": "2025-01-09", "title": "Simultaneous emulation and downscaling with physically-consistent deep learning-based regional ocean emulators", "paper_summary": "Building on top of the success in AI-based atmospheric emulation, we propose\nan AI-based ocean emulation and downscaling framework focusing on the\nhigh-resolution regional ocean over Gulf of Mexico. Regional ocean emulation\npresents unique challenges owing to the complex bathymetry and lateral boundary\nconditions as well as from fundamental biases in deep learning-based\nframeworks, such as instability and hallucinations. In this paper, we develop a\ndeep learning-based framework to autoregressively integrate ocean-surface\nvariables over the Gulf of Mexico at $8$ Km spatial resolution without\nunphysical drifts over decadal time scales and simulataneously downscale and\nbias-correct it to $4$ Km resolution using a physics-constrained generative\nmodel. The framework shows both short-term skills as well as accurate long-term\nstatistics in terms of mean and variability.", "paper_summary_zh": "建立在以 AI 為基礎的大氣模擬的成功之上，我們提出一個以 AI 為基礎的海洋模擬和降尺度架構，專注於墨西哥灣的高解析度區域海洋。區域海洋模擬由於複雜的水深測量學和邊界條件，以及基於深度學習的架構（例如不穩定性和幻覺）中的基本偏差，因此呈現出獨特的挑戰。在本文中，我們開發了一個基於深度學習的架構，以自迴歸方式整合墨西哥灣的海面變數，空間解析度為 8 公里，在十年時間尺度上沒有非物理漂移，並且同時使用受物理約束的生成模型將其降尺度並校正偏差至 4 公里解析度。該架構在均值和變異性方面顯示了短期技能和準確的長期統計數據。", "author": "Leonard Lupin-Jimenez et.al.", "authors": "Leonard Lupin-Jimenez, Moein Darman, Subhashis Hazarika, Tianning Wu, Michael Gray, Ruyoing He, Anthony Wong, Ashesh Chattopadhyay", "id": "2501.05058v1", "paper_url": "http://arxiv.org/abs/2501.05058v1", "repo": "null"}}