{"2502.06703": {"publish_time": "2025-02-10", "title": "Can 1B LLM Surpass 405B LLM? Rethinking Compute-Optimal Test-Time Scaling", "paper_summary": "Test-Time Scaling (TTS) is an important method for improving the performance\nof Large Language Models (LLMs) by using additional computation during the\ninference phase. However, current studies do not systematically analyze how\npolicy models, Process Reward Models (PRMs), and problem difficulty influence\nTTS. This lack of analysis limits the understanding and practical use of TTS\nmethods. In this paper, we focus on two core questions: (1) What is the optimal\napproach to scale test-time computation across different policy models, PRMs,\nand problem difficulty levels? (2) To what extent can extended computation\nimprove the performance of LLMs on complex tasks, and can smaller language\nmodels outperform larger ones through this approach? Through comprehensive\nexperiments on MATH-500 and challenging AIME24 tasks, we have the following\nobservations: (1) The compute-optimal TTS strategy is highly dependent on the\nchoice of policy model, PRM, and problem difficulty. (2) With our\ncompute-optimal TTS strategy, extremely small policy models can outperform\nlarger models. For example, a 1B LLM can exceed a 405B LLM on MATH-500.\nMoreover, on both MATH-500 and AIME24, a 0.5B LLM outperforms GPT-4o, a 3B LLM\nsurpasses a 405B LLM, and a 7B LLM beats o1 and DeepSeek-R1, while with higher\ninference efficiency. These findings show the significance of adapting TTS\nstrategies to the specific characteristics of each task and model and indicate\nthat TTS is a promising approach for enhancing the reasoning abilities of LLMs.", "paper_summary_zh": "測試時縮放 (TTS) 是一種重要的方法，可透過在推論階段使用額外運算來提升大型語言模型 (LLM) 的效能。然而，目前的研究所沒有系統性地分析政策模型、程序獎勵模型 (PRM) 和問題難度如何影響 TTS。這種分析的缺乏限制了對 TTS 方法的理解和實際使用。在本文中，我們專注於兩個核心問題：(1) 什麼是跨不同政策模型、PRM 和問題難度層級縮放測試時運算的最佳方法？(2) 擴展運算可以在多大程度上提升 LLM 在複雜任務上的效能，較小的語言模型是否能透過這種方法勝過較大的模型？透過對 MATH-500 和具有挑戰性的 AIME24 任務進行全面的實驗，我們有以下觀察：(1) 最佳運算 TTS 策略高度依賴於政策模型、PRM 和問題難度的選擇。(2) 使用我們最佳運算 TTS 策略，極小的政策模型可以勝過較大的模型。例如，1B LLM 可以超過 MATH-500 上的 405B LLM。此外，在 MATH-500 和 AIME24 上，0.5B LLM 勝過 GPT-4o，3B LLM 勝過 405B LLM，7B LLM 勝過 o1 和 DeepSeek-R1，同時具有更高的推論效率。這些發現顯示了調整 TTS 策略以適應每個任務和模型的特定特徵的重要性，並表明 TTS 是增強 LLM 推理能力的一種有前途的方法。", "author": "Runze Liu et.al.", "authors": "Runze Liu, Junqi Gao, Jian Zhao, Kaiyan Zhang, Xiu Li, Biqing Qi, Wanli Ouyang, Bowen Zhou", "id": "2502.06703v1", "paper_url": "http://arxiv.org/abs/2502.06703v1", "repo": "null"}}