{"2406.14137": {"publish_time": "2024-06-20", "title": "MACAROON: Training Vision-Language Models To Be Your Engaged Partners", "paper_summary": "Large vision-language models (LVLMs), while proficient in following\ninstructions and responding to diverse questions, invariably generate detailed\nresponses even when questions are ambiguous or unanswerable, leading to\nhallucinations and bias issues. Thus, it is essential for LVLMs to proactively\nengage with humans to ask for clarifications or additional information for\nbetter responses. In this study, we aim to shift LVLMs from passive answer\nproviders to proactive engaged partners. We begin by establishing a\nthree-tiered hierarchy for questions of invalid, ambiguous, and personalizable\nnature to measure the proactive engagement capabilities of LVLMs. Utilizing\nthis hierarchy, we create PIE, (ProactIve Engagement Evaluation) through GPT-4o\nand human annotators, consisting of 853 questions across six distinct,\nfine-grained question types that are verified by human annotators and\naccompanied with well-defined metrics. Our evaluations on \\benchmark indicate\npoor performance of existing LVLMs, with the best-performing open-weights model\nonly achieving an Aggregate Align Rate (AAR) of 0.28. In response, we introduce\nMACAROON, self-iMaginAtion for ContrAstive pReference OptimizatiON, which\ninstructs LVLMs to autonomously generate contrastive response pairs for\nunlabeled questions given the task description and human-crafted criteria.\nThen, the self-imagined data is formatted for conditional reinforcement\nlearning. Experimental results show MACAROON effectively improves LVLMs'\ncapabilities to be proactively engaged (0.84 AAR) while maintaining comparable\nperformance on general tasks.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 雖然擅長遵循指示並回答各種問題，但即使在問題模稜兩可或無法回答時，它們也會產生詳細的回應，導致出現幻覺和偏見問題。因此，LVLMs 主動與人類互動以尋求澄清或額外資訊以獲得更好的回應至關重要。在這項研究中，我們旨在將 LVLMs 從被動的答案提供者轉變為主動參與的合作夥伴。我們首先為無效、模稜兩可和可個人化的問題建立一個三層等級，以衡量 LVLMs 的主動參與能力。利用這個層級，我們透過 GPT-4o 和人工標記員建立 PIE（主動參與評估），包含六種不同、細緻的問題類型中的 853 個問題，這些問題已由人工標記員驗證並附上明確的指標。我們對 \\benchmark 的評估表明現有 LVLMs 的效能不佳，效能最佳的開放權重模型僅達到 0.28 的總體對齊率 (AAR)。為了解決這個問題，我們引入了 MACAROON，一種用於對比性偏好最佳化的自我想像，它指示 LVLMs 在給定任務描述和人工建立的標準下，自主產生未標記問題的對比回應對。然後，將自我想像的資料格式化為條件增強學習。實驗結果顯示，MACAROON 有效地提升了 LVLMs 主動參與的能力（0.84 AAR），同時在一般任務上維持了相當的效能。", "author": "Shujin Wu et.al.", "authors": "Shujin Wu, Yi R. Fung, Sha Li, Yixin Wan, Kai-Wei Chang, Heng Ji", "id": "2406.14137v1", "paper_url": "http://arxiv.org/abs/2406.14137v1", "repo": "null"}}