{"2502.05879": {"publish_time": "2025-02-09", "title": "Enhancing Depression Detection with Chain-of-Thought Prompting: From Emotion to Reasoning Using Large Language Models", "paper_summary": "Depression is one of the leading causes of disability worldwide, posing a\nsevere burden on individuals, healthcare systems, and society at large. Recent\nadvancements in Large Language Models (LLMs) have shown promise in addressing\nmental health challenges, including the detection of depression through\ntext-based analysis. However, current LLM-based methods often struggle with\nnuanced symptom identification and lack a transparent, step-by-step reasoning\nprocess, making it difficult to accurately classify and explain mental health\nconditions. To address these challenges, we propose a Chain-of-Thought\nPrompting approach that enhances both the performance and interpretability of\nLLM-based depression detection. Our method breaks down the detection process\ninto four stages: (1) sentiment analysis, (2) binary depression classification,\n(3) identification of underlying causes, and (4) assessment of severity. By\nguiding the model through these structured reasoning steps, we improve\ninterpretability and reduce the risk of overlooking subtle clinical indicators.\nWe validate our method on the E-DAIC dataset, where we test multiple\nstate-of-the-art large language models. Experimental results indicate that our\nChain-of-Thought Prompting technique yields superior performance in both\nclassification accuracy and the granularity of diagnostic insights, compared to\nbaseline approaches.", "paper_summary_zh": "憂鬱症是全球殘障的主要原因之一，對個人、醫療保健系統和整個社會造成嚴重負擔。大型語言模型 (LLM) 的最新進展已展現出解決心理健康挑戰的希望，包括透過基於文字的分析來偵測憂鬱症。然而，現有的基於 LLM 的方法通常難以辨識細微的症狀，而且缺乏透明且逐步的推理過程，這使得準確分類和解釋心理健康狀況變得困難。為了應對這些挑戰，我們提出了一種思考鏈提示方法，它增強了基於 LLM 的憂鬱症偵測的效能和可解釋性。我們的這項方法將偵測過程分解為四個階段：(1) 情緒分析，(2) 二元憂鬱症分類，(3) 找出潛在原因，以及 (4) 評估嚴重程度。透過引導模型完成這些結構化的推理步驟，我們提升了可解釋性，並降低了忽略細微臨床指標的風險。我們在 E-DAIC 資料集上驗證了我們的這項方法，並在其中測試了多種最先進的大型語言模型。實驗結果顯示，與基線方法相比，我們的思考鏈提示技術在分類準確度和診斷見解的精細度方面都表現出優異的效能。", "author": "Shiyu Teng et.al.", "authors": "Shiyu Teng, Jiaqing Liu, Rahul Kumar Jain, Shurong Chai, Ruibo Hou, Tomoko Tateyama, Lanfen Lin, Yen-wei Chen", "id": "2502.05879v1", "paper_url": "http://arxiv.org/abs/2502.05879v1", "repo": "null"}}