{"2409.03833": {"publish_time": "2024-09-05", "title": "AI forecasting of higher-order wave modes of spinning binary black hole mergers", "paper_summary": "We present a physics-inspired transformer model that predicts the non-linear\ndynamics of higher-order wave modes emitted by quasi-circular, spinning,\nnon-precessing binary black hole mergers. The model forecasts the waveform\nevolution from the pre-merger phase through the ringdown, starting with an\ninput time-series spanning $ t \\in [-5000\\textrm{M}, -100\\textrm{M}) $. The\nmerger event, defined as the peak amplitude of waveforms that include the $l =\n|m| = 2$ modes, occurs at $ t = 0\\textrm{M} $. The transformer then generates\npredictions over the time range $ t \\in [-100\\textrm{M}, 130\\textrm{M}] $. We\nproduced training, evaluation and test sets using the NRHybSur3dq8 model,\nconsidering a signal manifold defined by mass ratios $ q \\in [1, 8] $; spin\ncomponents $ s^z_{\\{1,2\\}} \\in [-0.8, 0.8] $; modes up to $l \\leq 4$, including\nthe $(5,5)$ mode but excluding the $(4,0)$ and $(4,1)$ modes; and inclination\nangles $\\theta \\in [0, \\pi]$. We trained the model on 14,440,761 waveforms,\ncompleting the training in 15 hours using 16 NVIDIA A100 GPUs in the Delta\nsupercomputer. We used 4 H100 GPUs in the DeltaAI supercomputer to compute,\nwithin 7 hours, the overlap between ground truth and predicted waveforms using\na test set of 840,000 waveforms, finding that the mean and median overlaps over\nthe test set are 0.996 and 0.997, respectively. Additionally, we conducted\ninterpretability studies to elucidate the waveform features utilized by our\ntransformer model to produce accurate predictions. The scientific software used\nfor this work is released with this manuscript.", "paper_summary_zh": "<paragraph>我們提出了一個受物理啟發的 Transformer 模型，它可以預測準圓形、自旋、非進動二元黑洞合併所發射的高階波模的非線性動力學。該模型預測了從合併前階段到衰變的波形演化，從輸入時間序列開始，跨越 $ t \\in [-5000\\textrm{M}, -100\\textrm{M}) $。合併事件定義為包含 $l = |m| = 2$ 模式的波形的峰值振幅，發生在 $ t = 0\\textrm{M} $。然後，Transformer在時間範圍 $ t \\in [-100\\textrm{M}, 130\\textrm{M}] $ 上生成預測。我們使用 NRHybSur3dq8 模型生成了訓練、評估和測試集，考慮了由質量比 $ q \\in [1, 8] $ 定義的信號流形；自旋分量 $ s^z_{\\{1,2\\}} \\in [-0.8, 0.8] $；模態高達 $l \\leq 4$，包括 $(5,5)$ 模態，但不包括 $(4,0)$ 和 $(4,1)$ 模態；和傾角 $\\theta \\in [0, \\pi]$。我們在 14,440,761 個波形上訓練了該模型，使用 Delta 超級計算機中的 16 個 NVIDIA A100 GPU，在 15 小時內完成了訓練。我們在 DeltaAI 超級計算機中使用了 4 個 H100 GPU，在 7 小時內計算了使用 840,000 個波形的測試集的真實波形和預測波形之間的重疊，發現測試集上的平均和中值重疊分別為 0.996 和 0.997。此外，我們進行了解釋性研究，以闡明我們的 Transformer 模型用於產生準確預測的波形特徵。用於這項工作的科學軟件隨此手稿一起發布。</paragraph>", "author": "Victoria Tiki et.al.", "authors": "Victoria Tiki, Kiet Pham, Eliu Huerta", "id": "2409.03833v1", "paper_url": "http://arxiv.org/abs/2409.03833v1", "repo": "null"}}