{"2501.04283": {"publish_time": "2025-01-08", "title": "Enhancing Scene Classification in Cloudy Image Scenarios: A Collaborative Transfer Method with Information Regulation Mechanism using Optical Cloud-Covered and SAR Remote Sensing Images", "paper_summary": "In remote sensing scene classification, leveraging the transfer methods with\nwell-trained optical models is an efficient way to overcome label scarcity.\nHowever, cloud contamination leads to optical information loss and significant\nimpacts on feature distribution, challenging the reliability and stability of\ntransferred target models. Common solutions include cloud removal for optical\ndata or directly using Synthetic aperture radar (SAR) data in the target\ndomain. However, cloud removal requires substantial auxiliary data for support\nand pre-training, while directly using SAR disregards the unobstructed portions\nof optical data. This study presents a scene classification transfer method\nthat synergistically combines multi-modality data, which aims to transfer the\nsource domain model trained on cloudfree optical data to the target domain that\nincludes both cloudy optical and SAR data at low cost. Specifically, the\nframework incorporates two parts: (1) the collaborative transfer strategy,\nbased on knowledge distillation, enables the efficient prior knowledge transfer\nacross heterogeneous data; (2) the information regulation mechanism (IRM) is\nproposed to address the modality imbalance issue during transfer. It employs\nauxiliary models to measure the contribution discrepancy of each modality, and\nautomatically balances the information utilization of modalities during the\ntarget model learning process at the sample-level. The transfer experiments\nwere conducted on simulated and real cloud datasets, demonstrating the superior\nperformance of the proposed method compared to other solutions in cloud-covered\nscenarios. We also verified the importance and limitations of IRM, and further\ndiscussed and visualized the modality imbalance problem during the model\ntransfer. Codes are available at https://github.com/wangyuze-csu/ESCCS", "paper_summary_zh": "<paragraph>在遥感场景分类中，利用经过良好训练的光学模型的迁移方法是克服标签稀缺的有效方法。\n然而，云污染导致光学信息丢失，并对特征分布产生重大影响，对迁移目标模型的可靠性和稳定性构成挑战。常见的解决方案包括去除光学数据的云或直接在目标域中使用合成孔径雷达 (SAR) 数据。然而，去除云需要大量的辅助数据来支持和预训练，而直接使用 SAR 则忽略了光学数据的畅通部分。本研究提出了一种场景分类迁移方法，该方法协同组合多模态数据，旨在将训练在无云光学数据上的源域模型转移到同时包含多云光学和 SAR 数据的目标域，且成本低。具体来说，该框架包含两个部分：(1) 基于知识蒸馏的协作迁移策略，能够跨异构数据进行有效的先验知识迁移；(2) 提出信息调节机制 (IRM) 以解决迁移期间的模态不平衡问题。它采用辅助模型来测量每个模态的贡献差异，并在样本级目标模型学习过程中自动平衡模态的信息利用。在模拟和真实云数据集上进行了迁移实验，结果表明，与其他解决方案相比，该方法在云覆盖场景中表现出卓越的性能。我们还验证了 IRM 的重要性和局限性，并进一步讨论和可视化了模型迁移过程中的模态不平衡问题。代码可在 https://github.com/wangyuze-csu/ESCCS 获得</paragraph>", "author": "Yuze Wang et.al.", "authors": "Yuze Wang, Rong Xiao, Haifeng Li, Mariana Belgiu, Chao Tao", "id": "2501.04283v1", "paper_url": "http://arxiv.org/abs/2501.04283v1", "repo": "null"}}