{"2408.16537": {"publish_time": "2024-08-29", "title": "SFR-GNN: Simple and Fast Robust GNNs against Structural Attacks", "paper_summary": "Graph Neural Networks (GNNs) have demonstrated commendable performance for\ngraph-structured data. Yet, GNNs are often vulnerable to adversarial structural\nattacks as embedding generation relies on graph topology. Existing efforts are\ndedicated to purifying the maliciously modified structure or applying adaptive\naggregation, thereby enhancing the robustness against adversarial structural\nattacks. It is inevitable for a defender to consume heavy computational costs\ndue to lacking prior knowledge about modified structures. To this end, we\npropose an efficient defense method, called Simple and Fast Robust Graph Neural\nNetwork (SFR-GNN), supported by mutual information theory. The SFR-GNN first\npre-trains a GNN model using node attributes and then fine-tunes it over the\nmodified graph in the manner of contrastive learning, which is free of\npurifying modified structures and adaptive aggregation, thus achieving great\nefficiency gains. Consequently, SFR-GNN exhibits a 24%--162% speedup compared\nto advanced robust models, demonstrating superior robustness for node\nclassification tasks.", "paper_summary_zh": "圖形神經網路 (GNN) 已證明在圖形結構資料中表現優異。然而，GNN 經常容易受到對抗性結構攻擊，因為嵌入產生依賴於圖形拓撲。現有的努力專注於淨化惡意修改的結構或應用自適應聚合，從而增強對抗對抗性結構攻擊的魯棒性。由於缺乏關於修改結構的先驗知識，因此防禦者不可避免地會消耗大量的運算成本。為此，我們提出了一種稱為簡單且快速的魯棒圖形神經網路 (SFR-GNN) 的高效防禦方法，該方法由互信息理論支持。SFR-GNN 首先使用節點屬性預訓練 GNN 模型，然後以對比學習的方式對修改後的圖形進行微調，這無需淨化修改後的結構和自適應聚合，從而獲得巨大的效率提升。因此，與先進的魯棒模型相比，SFR-GNN 表現出 24%--162% 的加速，證明了節點分類任務的卓越魯棒性。", "author": "Xing Ai et.al.", "authors": "Xing Ai, Guanyu Zhu, Yulin Zhu, Yu Zheng, Gaolei Li, Jianhua Li, Kai Zhou", "id": "2408.16537v2", "paper_url": "http://arxiv.org/abs/2408.16537v2", "repo": "null"}}