{"2405.09806": {"publish_time": "2024-05-16", "title": "MediSyn: Text-Guided Diffusion Models for Broad Medical 2D and 3D Image Synthesis", "paper_summary": "Diffusion models have recently gained significant traction due to their\nability to generate high-fidelity and diverse images and videos conditioned on\ntext prompts. In medicine, this application promises to address the critical\nchallenge of data scarcity, a consequence of barriers in data sharing,\nstringent patient privacy regulations, and disparities in patient population\nand demographics. By generating realistic and varying medical 2D and 3D images,\nthese models offer a rich, privacy-respecting resource for algorithmic training\nand research. To this end, we introduce MediSyn, a pair of instruction-tuned\ntext-guided latent diffusion models with the ability to generate high-fidelity\nand diverse medical 2D and 3D images across specialties and modalities. Through\nestablished metrics, we show significant improvement in broad medical image and\nvideo synthesis guided by text prompts.", "paper_summary_zh": "擴散模型最近獲得顯著的關注，因為它們能夠根據文字提示產生高保真且多樣的圖像和影片。在醫學中，此應用程式承諾解決資料稀少性的重大挑戰，這是由於資料共用、嚴格的患者隱私法規以及患者族群和人口統計資料的差異所造成的後果。透過產生逼真且多變的醫學 2D 和 3D 圖像，這些模型提供了豐富且尊重隱私的資源，可用於演算法訓練和研究。為此，我們引入了 MediSyn，這是一種成對的指令調整文字引導潛在擴散模型，能夠跨專業和方式產生高保真且多樣的醫學 2D 和 3D 圖像。透過既定的指標，我們展示了在文字提示引導下，廣泛的醫學影像和影片合成有了顯著的進步。", "author": "Joseph Cho et.al.", "authors": "Joseph Cho, Cyril Zakka, Rohan Shad, Ross Wightman, Akshay Chaudhari, William Hiesinger", "id": "2405.09806v1", "paper_url": "http://arxiv.org/abs/2405.09806v1", "repo": "null"}}