{"2409.10496": {"publish_time": "2024-09-16", "title": "MusicLIME: Explainable Multimodal Music Understanding", "paper_summary": "Multimodal models are critical for music understanding tasks, as they capture\nthe complex interplay between audio and lyrics. However, as these models become\nmore prevalent, the need for explainability grows-understanding how these\nsystems make decisions is vital for ensuring fairness, reducing bias, and\nfostering trust. In this paper, we introduce MusicLIME, a model-agnostic\nfeature importance explanation method designed for multimodal music models.\nUnlike traditional unimodal methods, which analyze each modality separately\nwithout considering the interaction between them, often leading to incomplete\nor misleading explanations, MusicLIME reveals how audio and lyrical features\ninteract and contribute to predictions, providing a holistic view of the\nmodel's decision-making. Additionally, we enhance local explanations by\naggregating them into global explanations, giving users a broader perspective\nof model behavior. Through this work, we contribute to improving the\ninterpretability of multimodal music models, empowering users to make informed\nchoices, and fostering more equitable, fair, and transparent music\nunderstanding systems.", "paper_summary_zh": "多模態模型對於音樂理解任務至關重要，因為它們捕捉了音訊和歌詞之間複雜的交互作用。然而，隨著這些模型變得越來越普遍，對於可解釋性的需求也隨之增加，了解這些系統如何做出決策對於確保公平性、減少偏見和建立信任至關重要。在本文中，我們介紹了 MusicLIME，一種與模型無關的功能重要性解釋方法，專為多模態音樂模型設計。與傳統的單模態方法不同，後者分別分析每個模態而不考慮它們之間的交互作用，通常會導致不完整或誤導性的解釋，MusicLIME 揭示了音訊和歌詞特徵如何交互並促成預測，提供了模型決策制定過程的整體視角。此外，我們通過將局部解釋匯總成全局解釋來增強局部解釋，使用戶對模型行為有更廣泛的了解。透過這項工作，我們有助於提高多模態音樂模型的可解釋性，使用戶能夠做出明智的選擇，並促進更公平、公正和透明的音樂理解系統。", "author": "Theodoros Sotirou et.al.", "authors": "Theodoros Sotirou, Vassilis Lyberatos, Orfeas Menis Mastromichalakis, Giorgos Stamou", "id": "2409.10496v1", "paper_url": "http://arxiv.org/abs/2409.10496v1", "repo": "https://github.com/iamtheo2000/musiclime"}}