{"2406.14265": {"publish_time": "2024-06-20", "title": "VeriFlow: Modeling Distributions for Neural Network Verification", "paper_summary": "Formal verification has emerged as a promising method to ensure the safety\nand reliability of neural networks. Naively verifying a safety property amounts\nto ensuring the safety of a neural network for the whole input space\nirrespective of any training or test set. However, this also implies that the\nsafety of the neural network is checked even for inputs that do not occur in\nthe real-world and have no meaning at all, often resulting in spurious errors.\nTo tackle this shortcoming, we propose the VeriFlow architecture as a flow\nbased density model tailored to allow any verification approach to restrict its\nsearch to the some data distribution of interest. We argue that our\narchitecture is particularly well suited for this purpose because of two major\nproperties. First, we show that the transformation and log-density function\nthat are defined by our model are piece-wise affine. Therefore, the model\nallows the usage of verifiers based on SMT with linear arithmetic. Second,\nupper density level sets (UDL) of the data distribution take the shape of an\n$L^p$-ball in the latent space. As a consequence, representations of UDLs\nspecified by a given probability are effectively computable in latent space.\nThis allows for SMT and abstract interpretation approaches with fine-grained,\nprobabilistically interpretable, control regarding on how (a)typical the inputs\nsubject to verification are.", "paper_summary_zh": "形式驗證已成為確保神經網路安全性和可靠性的有前途方法。天真地驗證安全屬性等於確保神經網路在整個輸入空間中的安全性，而不考慮任何訓練或測試集。然而，這也意味著即使對於在現實世界中不會出現且完全沒有意義的輸入，也會檢查神經網路的安全性，這通常會導致虛假錯誤。為了解決這個缺點，我們提出 VeriFlow 架構作為一個基於流的密度模型，專門用於允許任何驗證方法將其搜尋限制在感興趣的某些資料分佈上。我們認為我們的架構特別適合這個目的，原因有兩個主要特性。首先，我們展示由我們的模型定義的轉換和對數密度函數是分段仿射的。因此，該模型允許使用基於線性算術的 SMT 驗證器。其次，資料分佈的上密度層級集 (UDL) 在潛在空間中呈現出 $L^p$-球的形狀。因此，由給定機率指定的 UDL 表示在潛在空間中可以有效計算。這允許使用 SMT 和抽象詮釋方法，對輸入的 (a) 典型性進行精細、可機率詮釋的控制，以進行驗證。", "author": "Faried Abu Zaid et.al.", "authors": "Faried Abu Zaid, Daniel Neider, Mustafa Yalçıner", "id": "2406.14265v1", "paper_url": "http://arxiv.org/abs/2406.14265v1", "repo": "null"}}