{"2405.05723": {"publish_time": "2024-05-09", "title": "Computational lexical analysis of Flamenco genres", "paper_summary": "Flamenco, recognized by UNESCO as part of the Intangible Cultural Heritage of\nHumanity, is a profound expression of cultural identity rooted in Andalusia,\nSpain. However, there is a lack of quantitative studies that help identify\ncharacteristic patterns in this long-lived music tradition. In this work, we\npresent a computational analysis of Flamenco lyrics, employing natural language\nprocessing and machine learning to categorize over 2000 lyrics into their\nrespective Flamenco genres, termed as $\\textit{palos}$. Using a Multinomial\nNaive Bayes classifier, we find that lexical variation across styles enables to\naccurately identify distinct $\\textit{palos}$. More importantly, from an\nautomatic method of word usage, we obtain the semantic fields that characterize\neach style. Further, applying a metric that quantifies the inter-genre distance\nwe perform a network analysis that sheds light on the relationship between\nFlamenco styles. Remarkably, our results suggest historical connections and\n$\\textit{palo}$ evolutions. Overall, our work illuminates the intricate\nrelationships and cultural significance embedded within Flamenco lyrics,\ncomplementing previous qualitative discussions with quantitative analyses and\nsparking new discussions on the origin and development of traditional music\ngenres.", "paper_summary_zh": "弗拉門戈舞，被聯合國教科文組織認定為人類非物質文化遺產的一部分，是根植於西班牙安達盧西亞的文化認同的深刻表達。然而，缺乏定量的研究來幫助識別這一悠久的音樂傳統中的特徵模式。在這項工作中，我們提出了弗拉門戈歌詞的計算分析，採用自然語言處理和機器學習將 2000 多首歌詞分類到各自的弗拉門戈流派中，稱為$\\textit{palos}$。使用多項式樸素貝葉斯分類器，我們發現不同風格的詞彙變異能夠準確識別不同的$\\textit{palos}$。更重要的是，從一種自動化的詞彙使用方式中，我們獲得了表徵每種風格的語義場。此外，應用量化流派間距離的度量標準，我們進行了一項網路分析，闡明了弗拉門戈風格之間的關係。值得注意的是，我們的結果表明了歷史聯繫和$\\textit{palo}$的演變。總的來說，我們的作品闡明了弗拉門戈歌詞中嵌入的複雜關係和文化意義，用定量分析補充了先前的定性討論，並引發了對傳統音樂流派起源和發展的新討論。", "author": "Pablo Rosillo-Rodes et.al.", "authors": "Pablo Rosillo-Rodes, Maxi San Miguel, David Sanchez", "id": "2405.05723v1", "paper_url": "http://arxiv.org/abs/2405.05723v1", "repo": "null"}}