{"2410.23156": {"publish_time": "2024-10-30", "title": "VisualPredicator: Learning Abstract World Models with Neuro-Symbolic Predicates for Robot Planning", "paper_summary": "Broadly intelligent agents should form task-specific abstractions that\nselectively expose the essential elements of a task, while abstracting away the\ncomplexity of the raw sensorimotor space. In this work, we present\nNeuro-Symbolic Predicates, a first-order abstraction language that combines the\nstrengths of symbolic and neural knowledge representations. We outline an\nonline algorithm for inventing such predicates and learning abstract world\nmodels. We compare our approach to hierarchical reinforcement learning,\nvision-language model planning, and symbolic predicate invention approaches, on\nboth in- and out-of-distribution tasks across five simulated robotic domains.\nResults show that our approach offers better sample complexity, stronger\nout-of-distribution generalization, and improved interpretability.", "paper_summary_zh": "廣泛智能代理應該形成特定任務的抽象，選擇性地揭露任務的本質元素，同時抽象掉原始感測運動空間的複雜性。在這項工作中，我們提出了神經符號謂詞，一種結合符號和神經知識表示的優點的一階抽象語言。我們概述了一種用於發明此類謂詞和學習抽象世界模型的線上演算法。我們將我們的做法與分層強化學習、視覺語言模型規劃和符號謂詞發明方法進行比較，在五個模擬機器人領域的分布內和分布外任務上進行比較。結果表明，我們的做法提供了更好的範例複雜度、更強的分布外概括化和改進的可解釋性。", "author": "Yichao Liang et.al.", "authors": "Yichao Liang, Nishanth Kumar, Hao Tang, Adrian Weller, Joshua B. Tenenbaum, Tom Silver, João F. Henriques, Kevin Ellis", "id": "2410.23156v1", "paper_url": "http://arxiv.org/abs/2410.23156v1", "repo": "null"}}