{"2412.19513": {"publish_time": "2024-12-27", "title": "Confidence v.s. Critique: A Decomposition of Self-Correction Capability for LLMs", "paper_summary": "Large Language Models (LLMs) can correct their self-generated responses, but\na decline in accuracy after self-correction is also witnessed. To have a deeper\nunderstanding of self-correction, we endeavor to decompose, evaluate, and\nanalyze the self-correction behaviors of LLMs. By enumerating and analyzing\nanswer correctness before and after self-correction, we decompose the\nself-correction capability into confidence (being confident to correct answers)\nand critique (turning wrong answers to correct) capabilities, and propose two\nmetrics from a probabilistic perspective to measure these 2 capabilities, along\nwith another metric for overall self-correction capability evaluation. Based on\nour decomposition and evaluation metrics, we conduct extensive experiments and\ndraw some empirical conclusions. For example, we find different models can\nexhibit distinct behaviors: some models are confident while others are more\ncritical. We also find the trade-off between the two capabilities (i.e.\nimproving one can lead to a decline in the other) when manipulating model\nself-correction behavior by prompts or in-context learning. Further, we find a\nsimple yet efficient strategy to improve self-correction capability by\ntransforming Supervision Fine-Tuning (SFT) data format, and our strategy\noutperforms vanilla SFT in both capabilities and achieves much higher accuracy\nafter self-correction. Our code will be publicly available on GitHub.", "paper_summary_zh": "大型語言模型 (LLM) 可以修正其自行產生的回應，但\n在自我修正後，準確度也會下降。為了更深入了解自我修正，我們致力於分解、評估和\n分析 LLM 的自我修正行為。透過列舉和分析自我修正前後的答案正確性，我們將\n自我修正能力分解為信心（有信心修正答案）和批評（將錯誤答案轉為正確）能力，並提出兩個\n從機率角度測量這 2 種能力的指標，以及另一個用於整體自我修正能力評估的指標。根據\n我們的分解和評估指標，我們進行了大量的實驗，並得出了一些經驗結論。例如，我們發現不同的模型可以\n表現出不同的行為：有些模型有信心，而其他模型則更具批判性。我們還發現，當通過提示或情境學習來操縱模型\n自我修正行為時，這兩種能力之間存在權衡（即，提高一種能力可能導致另一種能力下降）。此外，我們找到了一個\n簡單但有效的策略，透過轉換監督微調 (SFT) 資料格式來提高自我修正能力，我們的策略在兩種能力上都優於傳統的 SFT，並在自我修正後實現了更高的準確度。我們的程式碼將公開在 GitHub 上。", "author": "Zhe Yang et.al.", "authors": "Zhe Yang, Yichang Zhang, Yudong Wang, Ziyao Xu, Junyang Lin, Zhifang Sui", "id": "2412.19513v1", "paper_url": "http://arxiv.org/abs/2412.19513v1", "repo": "null"}}