{"2409.18428": {"publish_time": "2024-09-27", "title": "Improving Multilingual ASR in the Wild Using Simple N-best Re-ranking", "paper_summary": "Multilingual Automatic Speech Recognition (ASR) models are typically\nevaluated in a setting where the ground-truth language of the speech utterance\nis known, however, this is often not the case for most practical settings.\nAutomatic Spoken Language Identification (SLID) models are not perfect and\nmisclassifications have a substantial impact on the final ASR accuracy. In this\npaper, we present a simple and effective N-best re-ranking approach to improve\nmultilingual ASR accuracy for several prominent acoustic models by employing\nexternal features such as language models and text-based language\nidentification models. Our results on FLEURS using the MMS and Whisper models\nshow spoken language identification accuracy improvements of 8.7% and 6.1%,\nrespectively and word error rates which are 3.3% and 2.0% lower on these\nbenchmarks.", "paper_summary_zh": "多語言自動語音識別 (ASR) 模型通常在語音話語的真實語言已知的環境中進行評估，然而，這在多數實際環境中並非如此。自動口說語言辨識 (SLID) 模型並不完美，且錯誤分類會對最終的 ASR 準確度造成重大影響。在本文中，我們提出一個簡單且有效的方法，透過採用語言模型和基於文字的語言辨識模型等外部特徵，對多語言 ASR 準確度進行 N-best 重新排序，以提升準確度。我們在 FLEURS 上使用 MMS 和 Whisper 模型所獲得的結果顯示，口說語言辨識準確度分別提升了 8.7% 和 6.1%，而這些基準上的字元錯誤率則降低了 3.3% 和 2.0%。", "author": "Brian Yan et.al.", "authors": "Brian Yan, Vineel Pratap, Shinji Watanabe, Michael Auli", "id": "2409.18428v1", "paper_url": "http://arxiv.org/abs/2409.18428v1", "repo": "null"}}