{"2406.16252": {"publish_time": "2024-06-24", "title": "Graph-Augmented LLMs for Personalized Health Insights: A Case Study in Sleep Analysis", "paper_summary": "Health monitoring systems have revolutionized modern healthcare by enabling\nthe continuous capture of physiological and behavioral data, essential for\npreventive measures and early health intervention. While integrating this data\nwith Large Language Models (LLMs) has shown promise in delivering interactive\nhealth advice, traditional methods like Retrieval-Augmented Generation (RAG)\nand fine-tuning often fail to fully utilize the complex, multi-dimensional, and\ntemporally relevant data from wearable devices. These conventional approaches\ntypically provide limited actionable and personalized health insights due to\ntheir inadequate capacity to dynamically integrate and interpret diverse health\ndata streams. In response, this paper introduces a graph-augmented LLM\nframework designed to significantly enhance the personalization and clarity of\nhealth insights. Utilizing a hierarchical graph structure, the framework\ncaptures inter and intra-patient relationships, enriching LLM prompts with\ndynamic feature importance scores derived from a Random Forest Model. The\neffectiveness of this approach is demonstrated through a sleep analysis case\nstudy involving 20 college students during the COVID-19 lockdown, highlighting\nthe potential of our model to generate actionable and personalized health\ninsights efficiently. We leverage another LLM to evaluate the insights for\nrelevance, comprehensiveness, actionability, and personalization, addressing\nthe critical need for models that process and interpret complex health data\neffectively. Our findings show that augmenting prompts with our framework\nyields significant improvements in all 4 criteria. Through our framework, we\ncan elicit well-crafted, more thoughtful responses tailored to a specific\npatient.", "paper_summary_zh": "健康監控系統透過持續收集生理和行為資料，徹底改變了現代醫療保健，這些資料對於預防措施和早期健康干預至關重要。雖然將這些資料與大型語言模型 (LLM) 整合，已展現出提供互動式健康建議的潛力，但傳統方法（例如檢索擴充生成 (RAG) 和微調）通常無法充分利用穿戴式裝置中複雜、多面向且與時間相關的資料。這些傳統方法通常會提供有限的可行且個人化的健康見解，因為它們無法動態整合和詮釋不同的健康資料串流。為了解決這個問題，本文介紹了一個圖形擴充 LLM 架構，旨在大幅提升健康見解的個人化和清晰度。這個架構利用階層式圖形結構，擷取患者之間和患者內部的關係，並使用從 Random Forest 模型衍生的動態特徵重要性評分，豐富 LLM 提示。透過一項睡眠分析案例研究（在 COVID-19 封鎖期間針對 20 名大學生進行）證明了這個方法的有效性，突顯了我們的模型在有效產生可行且個人化的健康見解方面的潛力。我們利用另一個 LLM 評估見解的相關性、全面性、可行性和個人化，滿足了模型有效處理和詮釋複雜健康資料的關鍵需求。我們的研究結果顯示，使用我們的架構擴充提示，可以在所有 4 個標準中大幅改善。透過我們的架構，我們可以引發精心設計、更周全的回應，針對特定患者量身打造。", "author": "Ajan Subramanian et.al.", "authors": "Ajan Subramanian, Zhongqi Yang, Iman Azimi, Amir M. Rahmani", "id": "2406.16252v2", "paper_url": "http://arxiv.org/abs/2406.16252v2", "repo": "null"}}