{"2411.06666": {"publish_time": "2024-11-11", "title": "Adversarial Detection with a Dynamically Stable System", "paper_summary": "Adversarial detection is designed to identify and reject maliciously crafted\nadversarial examples(AEs) which are generated to disrupt the classification of\ntarget models.\n  Presently, various input transformation-based methods have been developed on\nadversarial example detection, which typically rely on empirical experience and\nlead to unreliability against new attacks.\n  To address this issue, we propose and conduct a Dynamically Stable System\n(DSS), which can effectively detect the adversarial examples from normal\nexamples according to the stability of input examples.\n  Particularly, in our paper, the generation of adversarial examples is\nconsidered as the perturbation process of a Lyapunov dynamic system, and we\npropose an example stability mechanism, in which a novel control term is added\nin adversarial example generation to ensure that the normal examples can\nachieve dynamic stability while the adversarial examples cannot achieve the\nstability.\n  Then, based on the proposed example stability mechanism, a Dynamically Stable\nSystem (DSS) is proposed, which can utilize the disruption and restoration\nactions to determine the stability of input examples and detect the adversarial\nexamples through changes in the stability of the input examples.\n  In comparison with existing methods in three benchmark datasets(MNIST,\nCIFAR10, and CIFAR100), our evaluation results show that our proposed DSS can\nachieve ROC-AUC values of 99.83%, 97.81% and 94.47%, surpassing the\nstate-of-the-art(SOTA) values of 97.35%, 91.10% and 93.49% in the other 7\nmethods.", "paper_summary_zh": "對抗性偵測旨在識別和拒絕惡意製作的對抗性範例 (AE)，這些範例會產生以擾亂目標模型分類。\n目前，已針對對抗性範例偵測開發了各種基於輸入轉換的方法，這些方法通常依賴於經驗經驗，且無法對抗新的攻擊。\n為了解決此問題，我們提出並進行動態穩定系統 (DSS)，可根據輸入範例的穩定性有效偵測出正常範例中的對抗性範例。\n特別是在我們的論文中，對抗性範例的產生被視為李亞普諾夫動態系統的擾動過程，我們提出了一個範例穩定機制，在其中於對抗性範例產生中加入一個新穎的控制項，以確保正常範例可以達到動態穩定，而對抗性範例則無法達到穩定。\n然後，根據所提出的範例穩定機制，提出了一個動態穩定系統 (DSS)，它可以利用擾動和復原動作來確定輸入範例的穩定性，並透過輸入範例穩定性的變化來偵測對抗性範例。\n與三個基準資料集 (MNIST、CIFAR10 和 CIFAR100) 中現有方法相比，我們的評估結果顯示，我們提出的 DSS 可以達到 99.83%、97.81% 和 94.47% 的 ROC-AUC 值，超越其他 7 種方法的 97.35%、91.10% 和 93.49% 的最先進 (SOTA) 值。", "author": "Xiaowei Long et.al.", "authors": "Xiaowei Long, Jie Lin, Xiangyuan Yang", "id": "2411.06666v1", "paper_url": "http://arxiv.org/abs/2411.06666v1", "repo": "null"}}