{"2412.15593": {"publish_time": "2024-12-20", "title": "Machine Learning Techniques for Pattern Recognition in High-Dimensional Data Mining", "paper_summary": "This paper proposes a frequent pattern data mining algorithm based on support\nvector machine (SVM), aiming to solve the performance bottleneck of traditional\nfrequent pattern mining algorithms in high-dimensional and sparse data\nenvironments. By converting the frequent pattern mining task into a\nclassification problem, the SVM model is introduced to improve the accuracy and\nrobustness of pattern extraction. In terms of method design, the kernel\nfunction is used to map the data to a high-dimensional feature space, so as to\nconstruct the optimal classification hyperplane, realize the nonlinear\nseparation of patterns and the accurate mining of frequent items. In the\nexperiment, two public datasets, Retail and Mushroom, were selected to compare\nand analyze the proposed algorithm with traditional FP-Growth, FP-Tree,\ndecision tree and random forest models. The experimental results show that the\nalgorithm in this paper is significantly better than the traditional model in\nterms of three key indicators: support, confidence and lift, showing strong\npattern recognition ability and rule extraction effect. The study shows that\nthe SVM model has excellent performance advantages in an environment with high\ndata sparsity and a large number of transactions, and can effectively cope with\ncomplex pattern mining tasks. At the same time, this paper also points out the\npotential direction of future research, including the introduction of deep\nlearning and ensemble learning frameworks to further improve the scalability\nand adaptability of the algorithm. This research not only provides a new idea\nfor frequent pattern mining, but also provides important technical support for\nsolving pattern discovery and association rule mining problems in practical\napplications.", "paper_summary_zh": "<paragraph>本文提出了一種基於支持向量機 (SVM) 的頻繁模式數據挖掘演算法，旨在解決傳統頻繁模式挖掘演算法在高維度和稀疏數據環境中的效能瓶頸。通過將頻繁模式挖掘任務轉換為分類問題，引入了 SVM 模型以提高模式提取的準確性和穩健性。在方法設計方面，利用核函數將數據映射到高維度特徵空間，從而構造最優分類超平面，實現模式的非線性分離和頻繁項的準確挖掘。在實驗中，選取了兩個公開數據集 Retail 和 Mushroom，對所提出的演算法與傳統的 FP-Growth、FP-Tree、決策樹和隨機森林模型進行了比較和分析。實驗結果表明，本文演算法在支持度、可信度和提升度三個關鍵指標上均顯著優於傳統模型，表現出強大的模式識別能力和規則提取效果。研究表明，SVM 模型在數據稀疏度高、交易量大的環境中具有優異的效能優勢，能有效應對複雜的模式挖掘任務。同時，本文也指出了未來研究的潛在方向，包括引入深度學習和集成學習框架以進一步提高演算法的可擴展性和適應性。本研究不僅為頻繁模式挖掘提供了新思路，也為解決實際應用中的模式發現和關聯規則挖掘問題提供了重要的技術支撐。</paragraph>", "author": "Pochun Li et.al.", "authors": "Pochun Li", "id": "2412.15593v1", "paper_url": "http://arxiv.org/abs/2412.15593v1", "repo": "null"}}