{"2408.10642": {"publish_time": "2024-08-20", "title": "Minor SFT loss for LLM fine-tune to increase performance and reduce model deviation", "paper_summary": "Instruct LLM provide a paradigm used in large scale language model to align\nLLM to human preference. The paradigm contains supervised fine tuning and\nreinforce learning from human feedback. This paradigm is also used in\ndownstream scenarios to adapt LLM to specific corpora and applications.\nComparing to SFT, there are many efforts focused on RLHF and several algorithms\nbeing proposed, such as PPO, DPO, IPO, KTO, MinorDPO and etc. Meanwhile most\nefforts for SFT are focused on how to collect, filter and mix high quality\ndata. In this article with insight from DPO and MinorDPO, we propose a training\nmetric for SFT to measure the discrepancy between the optimized model and the\noriginal model, and a loss function MinorSFT that can increase the training\neffectiveness, and reduce the discrepancy between the optimized LLM and\noriginal LLM.", "paper_summary_zh": "指示 LLM 提供大型语言模型中用于将 LLM 与人类偏好对齐的范例。该范例包含有监督的微调和根据人类反馈进行的强化学习。该范例还用于下游场景，以使 LLM 适应特定语料库和应用程序。与 SFT 相比，有许多工作重点关注 RLHF，并提出了多种算法，例如 PPO、DPO、IPO、KTO、MinorDPO 等。同时，SFT 的大多数工作重点在于如何收集、筛选和混合高质量数据。在本文中，利用 DPO 和 MinorDPO 的见解，我们提出了一个用于 SFT 的训练指标，以衡量优化后的模型与原始模型之间的差异，以及一个可以提高训练效果的损失函数 MinorSFT，并减少优化后的 LLM 与原始 LLM 之间的差异。", "author": "Shiming Xie et.al.", "authors": "Shiming Xie, Hong Chen, Fred Yu, Zeye Sun, Xiuyu Wu", "id": "2408.10642v1", "paper_url": "http://arxiv.org/abs/2408.10642v1", "repo": "null"}}