{"2501.04173": {"publish_time": "2025-01-07", "title": "Multimodal Multihop Source Retrieval for Web Question Answering", "paper_summary": "This work deals with the challenge of learning and reasoning over multi-modal\nmulti-hop question answering (QA). We propose a graph reasoning network based\non the semantic structure of the sentences to learn multi-source reasoning\npaths and find the supporting facts across both image and text modalities for\nanswering the question. In this paper, we investigate the importance of graph\nstructure for multi-modal multi-hop question answering. Our analysis is\ncentered on WebQA. We construct a strong baseline model, that finds relevant\nsources using a pairwise classification task. We establish that, with the\nproper use of feature representations from pre-trained models, graph structure\nhelps in improving multi-modal multi-hop question answering. We point out that\nboth graph structure and adjacency matrix are task-related prior knowledge, and\ngraph structure can be leveraged to improve the retrieval performance for the\ntask. Experiments and visualized analysis demonstrate that message propagation\nover graph networks or the entire graph structure can replace massive\nmultimodal transformers with token-wise cross-attention. We demonstrated the\napplicability of our method and show a performance gain of \\textbf{4.6$\\%$}\nretrieval F1score over the transformer baselines, despite being a very light\nmodel. We further demonstrated the applicability of our model to a large scale\nretrieval setting.", "paper_summary_zh": "本研究應對多模態多跳問題解答 (QA) 的學習和推理挑戰。我們提出一個基於句子語義結構的圖推理網路，用於學習多來源推理路徑，並在影像和文字模態中找到支撐事實，以回答問題。在本文中，我們探討圖結構對於多模態多跳問題解答的重要性。我們的分析集中在 WebQA。我們建構了一個強大的基線模型，它使用成對分類任務來找出相關來源。我們確立了，透過適當使用預訓練模型中的特徵表示，圖結構有助於改善多模態多跳問題解答。我們指出，圖結構和鄰接矩陣都是與任務相關的先驗知識，並且圖結構可用於改善任務的檢索效能。實驗和視覺化分析表明，圖網路或整個圖結構上的訊息傳播可以取代具有令牌明智交叉注意力的巨大多模態Transformer。我們展示了我們方法的適用性，並且展示了比Transformer基線高出 \\textbf{4.6$\\%$} 的檢索 F1 分數，儘管它是一個非常輕量級的模型。我們進一步展示了我們的模型對大規模檢索設定的適用性。", "author": "Navya Yarrabelly et.al.", "authors": "Navya Yarrabelly, Saloni Mittal", "id": "2501.04173v1", "paper_url": "http://arxiv.org/abs/2501.04173v1", "repo": "null"}}