{"2410.11410": {"publish_time": "2024-10-15", "title": "PMMT: Preference Alignment in Multilingual Machine Translation via LLM Distillation", "paper_summary": "Translation is important for cross-language communication, and many efforts\nhave been made to improve its accuracy. However, less investment is conducted\nin aligning translations with human preferences, such as translation tones or\nstyles. In this paper, a new method is proposed to effectively generate\nlarge-scale multilingual parallel corpora with specific translation preferences\nusing Large Language Models (LLMs). Meanwhile, an automatic pipeline is\ndesigned to distill human preferences into smaller Machine Translation (MT)\nmodels for efficiently and economically supporting large-scale calls in online\nservices. Experiments indicate that the proposed method takes the lead in\ntranslation tasks with aligned human preferences by a large margin. Meanwhile,\non popular public benchmarks like WMT and Flores, on which our models were not\ntrained, the proposed method also shows a competitive performance compared to\nSOTA works.", "paper_summary_zh": "翻譯對於跨語言溝通非常重要，許多努力都專注於提升翻譯的準確性。然而，在調整翻譯與人類偏好（例如翻譯語氣或風格）方面投入的資源較少。在本文中，提出了一種新的方法，可使用大型語言模型 (LLM) 有效產生具有特定翻譯偏好的大規模多語言平行語料庫。同時，設計了一個自動化流程，將人類偏好提煉到較小的機器翻譯 (MT) 模型中，以經濟有效的方式支援線上服務中的大規模呼叫。實驗結果顯示，所提出的方法在與人類偏好相符的翻譯任務中大幅領先。同時，在我們的模型未受過訓練的熱門公開基準（例如 WMT 和 Flores）上，所提出的方法也展現出與 SOTA 作品相匹敵的效能。", "author": "Shuqiao Sun et.al.", "authors": "Shuqiao Sun, Yutong Yao, Peiwen Wu, Feijun Jiang, Kaifu Zhang", "id": "2410.11410v1", "paper_url": "http://arxiv.org/abs/2410.11410v1", "repo": "null"}}