{"2405.17361": {"publish_time": "2024-05-27", "title": "A One-Layer Decoder-Only Transformer is a Two-Layer RNN: With an Application to Certified Robustness", "paper_summary": "This paper reveals a key insight that a one-layer decoder-only Transformer is\nequivalent to a two-layer Recurrent Neural Network (RNN). Building on this\ninsight, we propose ARC-Tran, a novel approach for verifying the robustness of\ndecoder-only Transformers against arbitrary perturbation spaces. Compared to\nARC-Tran, current robustness verification techniques are limited either to\nspecific and length-preserving perturbations like word substitutions or to\nrecursive models like LSTMs. ARC-Tran addresses these limitations by\nmeticulously managing position encoding to prevent mismatches and by utilizing\nour key insight to achieve precise and scalable verification. Our evaluation\nshows that ARC-Tran (1) trains models more robust to arbitrary perturbation\nspaces than those produced by existing techniques and (2) shows high\ncertification accuracy of the resulting models.", "paper_summary_zh": "這篇論文揭示了一個關鍵見解，即僅有解碼器的單層 Transformer 等同於雙層遞迴神經網路 (RNN)。基於這個見解，我們提出 ARC-Tran，一種驗證僅有解碼器的 Transformer 對任意擾動空間的穩健性的新方法。與 ARC-Tran 相比，目前的穩健性驗證技術僅限於特定且長度保持不變的擾動，例如單字替換，或遞迴模型，例如 LSTM。ARC-Tran 透過仔細管理位置編碼來防止不匹配，並利用我們的關鍵見解來實現精確且可擴充的驗證，從而解決這些限制。我們的評估顯示，ARC-Tran (1) 訓練出的模型比現有技術產生的模型對任意擾動空間更穩健，且 (2) 顯示出對結果模型的高驗證準確度。", "author": "Yuhao Zhang et.al.", "authors": "Yuhao Zhang, Aws Albarghouthi, Loris D'Antoni", "id": "2405.17361v1", "paper_url": "http://arxiv.org/abs/2405.17361v1", "repo": "null"}}