{"2409.11654": {"publish_time": "2024-09-18", "title": "How to Build the Virtual Cell with Artificial Intelligence: Priorities and Opportunities", "paper_summary": "The cell is arguably the smallest unit of life and is central to\nunderstanding biology. Accurate modeling of cells is important for this\nunderstanding as well as for determining the root causes of disease. Recent\nadvances in artificial intelligence (AI), combined with the ability to generate\nlarge-scale experimental data, present novel opportunities to model cells. Here\nwe propose a vision of AI-powered Virtual Cells, where robust representations\nof cells and cellular systems under different conditions are directly learned\nfrom growing biological data across measurements and scales. We discuss desired\ncapabilities of AI Virtual Cells, including generating universal\nrepresentations of biological entities across scales, and facilitating\ninterpretable in silico experiments to predict and understand their behavior\nusing Virtual Instruments. We further address the challenges, opportunities and\nrequirements to realize this vision including data needs, evaluation\nstrategies, and community standards and engagement to ensure biological\naccuracy and broad utility. We envision a future where AI Virtual Cells help\nidentify new drug targets, predict cellular responses to perturbations, as well\nas scale hypothesis exploration. With open science collaborations across the\nbiomedical ecosystem that includes academia, philanthropy, and the biopharma\nand AI industries, a comprehensive predictive understanding of cell mechanisms\nand interactions is within reach.", "paper_summary_zh": "細胞可以說是生命中最小的單位，也是了解生物學的中心。準確地建立細胞模型對於理解生物學以及確定疾病的根本原因非常重要。最近人工智慧 (AI) 的進展，加上產生大規模實驗數據的能力，為細胞建模提供了新的機會。在此，我們提出了一個由 AI 驅動的虛擬細胞願景，其中在不同的條件下，細胞和細胞系統的強健表徵會直接從跨度測量和規模的生物數據中學習而來。我們討論了 AI 虛擬細胞所需的能力，包括產生跨度不同規模的生物實體的通用表徵，以及促進可解釋的電腦模擬實驗，以使用虛擬儀器預測和了解其行為。我們進一步說明了實現此願景的挑戰、機會和需求，包括數據需求、評估策略，以及確保生物準確性和廣泛實用性的社群標準和參與。我們預想一個未來，其中 AI 虛擬細胞有助於識別新的藥物目標、預測細胞對擾動的反應，以及擴大假設探索。透過跨生物醫學生態系統的開放科學合作，其中包括學術界、慈善事業，以及生物製藥和 AI 產業，對於細胞機制和交互作用的全面預測性理解即在我們掌握之中。", "author": "Charlotte Bunne et.al.", "authors": "Charlotte Bunne, Yusuf Roohani, Yanay Rosen, Ankit Gupta, Xikun Zhang, Marcel Roed, Theo Alexandrov, Mohammed AlQuraishi, Patricia Brennan, Daniel B. Burkhardt, Andrea Califano, Jonah Cool, Abby F. Dernburg, Kirsty Ewing, Emily B. Fox, Matthias Haury, Amy E. Herr, Eric Horvitz, Patrick D. Hsu, Viren Jain, Gregory R. Johnson, Thomas Kalil, David R. Kelley, Shana O. Kelley, Anna Kreshuk, Tim Mitchison, Stephani Otte, Jay Shendure, Nicholas J. Sofroniew, Fabian Theis, Christina V. Theodoris, Srigokul Upadhyayula, Marc Valer, Bo Wang, Eric Xing, Serena Yeung-Levy, Marinka Zitnik, Theofanis Karaletsos, Aviv Regev, Emma Lundberg, Jure Leskovec, Stephen R. Quake", "id": "2409.11654v1", "paper_url": "http://arxiv.org/abs/2409.11654v1", "repo": "null"}}