{"2405.03239": {"publish_time": "2024-05-06", "title": "Deep Learning for Detecting and Early Predicting Chronic Obstructive Pulmonary Disease from Spirogram Time Series: A UK Biobank Study", "paper_summary": "Chronic Obstructive Pulmonary Disease (COPD) is a chronic inflammatory lung\ncondition that causes airflow obstruction. The existing methods can only detect\npatients who already have COPD based on obvious features shown in the spirogram\n(In this article, the spirogram specifically involves measuring Volume-Flow\ncurve time series). Early prediction of COPD risk is vital for monitoring COPD\ndisease progression, slowing it down, or even preventing its onset. However,\nthese methods fail to early predict an individual's probability of COPD in the\nfuture based on subtle features in the spirogram. To address this gap, for the\nfirst time, we propose DeepSpiro, a method based on deep learning for early\nprediction of future COPD risk. DeepSpiro consists of four parts. First, we\nconstruct Volume-Flow curves guided by Time-Volume instability smoothing\n(SpiroSmoother) to enhance the stability of the original Volume-Flow curves\nprecisely. Second, we extract critical features from the evolution of\nvaried-length key patches (SpiroEncoder) to capture the key temporal evolution\nfrom original high-dimensional dynamic sequences to a unified low-dimensional\ntemporal representation. Third, we explain the model based on temporal\nattention and heterogeneous feature fusion (SpiroExplainer), which integrates\ninformation from heterogeneous data such as spirogram and demographic\ninformation. Fourth, we predict the risk of COPD based on the evolution of key\npatch concavity (SpiroPredictor), enabling accurate prediction of the risk of\ndisease in high-risk patients who are not yet diagnosed, for up to 1, 2, 3, 4,\n5 years, and beyond. We conduct experiments on the UK Biobank dataset. Results\nshow that DeepSpiro achieves an AUC value of 0.8328 in the task of detecting\nCOPD. In early prediction tasks, high-risk and low-risk groups show significant\ndifferences in the future, with a p-value of <0.001.", "paper_summary_zh": "", "author": "Shuhao Mei et.al.", "authors": "Shuhao Mei,Yuxi Zhou,Jiahao Xu,Yuxuan Wan,Shan Cao,Qinghao Zhao,Shijia Geng,Junqing Xie,Shenda Hong", "id": "2405.03239v1", "paper_url": "http://arxiv.org/abs/2405.03239v1", "repo": "null"}}