{"2502.05783": {"publish_time": "2025-02-09", "title": "WatchGuardian: Enabling User-Defined Personalized Just-in-Time Intervention on Smartwatch", "paper_summary": "While just-in-time interventions (JITIs) have effectively targeted common\nhealth behaviors, individuals often have unique needs to intervene in personal\nundesirable actions that can negatively affect physical, mental, and social\nwell-being. We present WatchGuardian, a smartwatch-based JITI system that\nempowers users to define custom interventions for these personal actions with a\nsmall number of samples. For the model to detect new actions based on limited\nnew data samples, we developed a few-shot learning pipeline that finetuned a\npre-trained inertial measurement unit (IMU) model on public hand-gesture\ndatasets. We then designed a data augmentation and synthesis process to train\nadditional classification layers for customization. Our offline evaluation with\n26 participants showed that with three, five, and ten examples, our approach\nachieved an average accuracy of 76.8%, 84.7%, and 87.7%, and an F1 score of\n74.8%, 84.2%, and 87.2% We then conducted a four-hour intervention study to\ncompare WatchGuardian against a rule-based intervention. Our results\ndemonstrated that our system led to a significant reduction by 64.0 +- 22.6% in\nundesirable actions, substantially outperforming the baseline by 29.0%. Our\nfindings underscore the effectiveness of a customizable, AI-driven JITI system\nfor individuals in need of behavioral intervention in personal undesirable\nactions. We envision that our work can inspire broader applications of\nuser-defined personalized intervention with advanced AI solutions.", "paper_summary_zh": "<paragraph>雖然即時介入（JITIs）有效地針對常見的健康行為，但個人通常有獨特的需求來介入可能會對身心和社會福祉產生負面影響的個人不良行為。我們提出 WatchGuardian，這是一個基於智慧手錶的 JITI 系統，它使用少數樣本讓使用者能夠為這些個人行為定義自訂介入措施。為了讓模型根據有限的新資料樣本偵測新行為，我們開發了一個小樣本學習管道，微調了公共手勢資料集上的預訓練慣性測量單元（IMU）模型。然後，我們設計了一個資料擴充和合成流程，以訓練其他分類層以進行自訂。我們對 26 位參與者進行的離線評估顯示，我們的做法使用三個、五個和十個範例，達到了 76.8%、84.7% 和 87.7% 的平均準確度，以及 74.8%、84.2% 和 87.2% 的 F1 分數。然後，我們進行了一項為時四小時的介入研究，以將 WatchGuardian 與基於規則的介入進行比較。我們的結果表明，我們的系統導致不良行為顯著減少了 64.0 +- 22.6%，大幅優於基線 29.0%。我們的研究結果強調了可自訂、AI 驅動的 JITI 系統對需要行為介入以應對個人不良行為的個人的有效性。我們預計我們的研究可以激勵使用者定義個人化介入的更廣泛應用，並採用先進的 AI 解決方案。</paragraph>", "author": "Ying Lei et.al.", "authors": "Ying Lei, Yancheng Cao, Will Wang, Yuanzhe Dong, Changchang Yin, Weidan Cao, Ping Zhang, Jingzhen Yang, Bingsheng Yao, Yifan Peng, Chunhua Weng, Randy Auerbach, Lena Mamykina, Dakuo Wang, Yuntao Wang, Xuhai Xu", "id": "2502.05783v1", "paper_url": "http://arxiv.org/abs/2502.05783v1", "repo": "null"}}