{"2405.15750": {"publish_time": "2024-05-24", "title": "Filtered Corpus Training (FiCT) Shows that Language Models can Generalize from Indirect Evidence", "paper_summary": "This paper introduces Filtered Corpus Training, a method that trains language\nmodels (LMs) on corpora with certain linguistic constructions filtered out from\nthe training data, and uses it to measure the ability of LMs to perform\nlinguistic generalization on the basis of indirect evidence. We apply the\nmethod to both LSTM and Transformer LMs (of roughly comparable size),\ndeveloping filtered corpora that target a wide range of linguistic phenomena.\nOur results show that while transformers are better qua LMs (as measured by\nperplexity), both models perform equally and surprisingly well on linguistic\ngeneralization measures, suggesting that they are capable of generalizing from\nindirect evidence.", "paper_summary_zh": "本文介紹了過濾語料訓練，這是一種在語料庫中過濾掉特定語言結構的訓練語言模型 (LM) 的方法，並用於衡量 LM 在間接證據基礎上執行語言概括的能力。我們將該方法應用於 LSTM 和 Transformer LM（大小大致相當），開發了針對各種語言現象的過濾語料庫。我們的結果表明，雖然 Transformer 在 LM 方面表現得更好（根據困惑度衡量），但這兩種模型在語言概括測量上表現得同樣好且令人驚訝，這表明它們能夠從間接證據中進行概括。", "author": "Abhinav Patil et.al.", "authors": "Abhinav Patil, Jaap Jumelet, Yu Ying Chiu, Andy Lapastora, Peter Shen, Lexie Wang, Clevis Willrich, Shane Steinert-Threlkeld", "id": "2405.15750v1", "paper_url": "http://arxiv.org/abs/2405.15750v1", "repo": "null"}}