{"2412.03593": {"publish_time": "2024-11-28", "title": "CovidLLM: A Robust Large Language Model with Missing Value Adaptation and Multi-Objective Learning Strategy for Predicting Disease Severity and Clinical Outcomes in COVID-19 Patients", "paper_summary": "Coronavirus Disease 2019 (COVID-19), which emerged in 2019, has caused\nmillions of deaths worldwide. Although effective vaccines have been developed\nto mitigate severe symptoms, certain populations, particularly the elderly and\nthose with comorbidities, remain at high risk for severe outcomes and increased\nmortality. Consequently, early identification of the severity and clinical\noutcomes of the disease in these patients is vital to prevent adverse\nprognoses. Although traditional machine learning and deep learning models have\nbeen widely employed in this area, the potential of large language models\n(LLMs) remains largely unexplored. Our research focuses primarily on\nconstructing specialized prompts and adopting multi-objective learning\nstrategies. We started by selecting serological indicators that significantly\ncorrelate with clinical outcomes and disease severity to serve as input data\nfor the model. Blood test samples often contain numerous missing values, and\ntraditional models generally rely on imputation to handle these gaps in the\ndata. In contrast, LLMs offer the advantage of robust semantic understanding.\nBy setting prompts, we can explicitly inform the model when a feature's value\nis missing, without the need for imputation. For the multi-objective learning\nstrategy, the model is designed to first predict disease severity and then\npredict clinical outcomes. Given that LLMs utilize both the input text and the\ngenerated tokens as input for generating the next token, the predicted severity\nis used as a basis for generating the clinical outcome. During the fine-tuning\nof the LLM, the two objectives influence and improve each other. Our\nexperiments were implemented based on the ChatGLM model. The results\ndemonstrate the effectiveness of LLMs in this task, suggesting promising\npotential for further development.", "paper_summary_zh": "2019 年出現的冠狀病毒疾病 (COVID-19) 已造成全球數百萬人死亡。儘管已研發出有效的疫苗來減輕嚴重症狀，但某些族群，尤其是老年人和有合併症者，仍然面臨嚴重的後果和死亡率增加的高風險。因此，及早辨識這些患者的疾病嚴重程度和臨床結果對於預防不良預後至關重要。儘管傳統機器學習和深度學習模型已廣泛用於此領域，但大型語言模型 (LLM) 的潛力仍未被充分探索。我們的研究主要專注於建構專業提示和採用多目標學習策略。我們首先選擇與臨床結果和疾病嚴重程度顯著相關的血清指標，作為模型的輸入資料。血液檢驗樣本通常包含許多缺失值，而傳統模型通常依賴插補來處理資料中的這些空白。相比之下，LLM 提供了強大的語義理解優勢。透過設定提示，我們可以明確告知模型何時缺少特徵值，而無需插補。對於多目標學習策略，模型被設計為先預測疾病嚴重程度，然後預測臨床結果。由於 LLM 將輸入文字和產生的符號同時作為輸入來產生下一個符號，因此預測的嚴重程度被用作產生臨床結果的基礎。在 LLM 的微調過程中，這兩個目標會相互影響和改善。我們的實驗是基於 ChatGLM 模型實作的。結果證明了 LLM 在此任務中的有效性，顯示出進一步發展的潛力。", "author": "Shengjun Zhu et.al.", "authors": "Shengjun Zhu, Siyu Liu, Yang Li, Qing Lei, Hongyan Hou, Hewei Jiang, Shujuan Guo, Feng Wang, Rongshang Chen, Xionglin Fan, Shengce Tao, Jiaxin Cai", "id": "2412.03593v1", "paper_url": "http://arxiv.org/abs/2412.03593v1", "repo": "null"}}