{"2502.02673": {"publish_time": "2025-02-04", "title": "MedRAX: Medical Reasoning Agent for Chest X-ray", "paper_summary": "Chest X-rays (CXRs) play an integral role in driving critical decisions in\ndisease management and patient care. While recent innovations have led to\nspecialized models for various CXR interpretation tasks, these solutions often\noperate in isolation, limiting their practical utility in clinical practice. We\npresent MedRAX, the first versatile AI agent that seamlessly integrates\nstate-of-the-art CXR analysis tools and multimodal large language models into a\nunified framework. MedRAX dynamically leverages these models to address complex\nmedical queries without requiring additional training. To rigorously evaluate\nits capabilities, we introduce ChestAgentBench, a comprehensive benchmark\ncontaining 2,500 complex medical queries across 7 diverse categories. Our\nexperiments demonstrate that MedRAX achieves state-of-the-art performance\ncompared to both open-source and proprietary models, representing a significant\nstep toward the practical deployment of automated CXR interpretation systems.\nData and code have been publicly available at\nhttps://github.com/bowang-lab/MedRAX", "paper_summary_zh": "胸部 X 光片 (CXR) 在疾病管理和患者照護中扮演著不可或缺的角色，推動著關鍵決策的制定。儘管近期的創新已針對各種 CXR 解讀任務開發出專門的模型，但這些解決方案通常獨立運作，限制了它們在臨床實務中的實際效用。我們提出 MedRAX，這是一款首創的多功能 AI 代理，它將最先進的 CXR 分析工具和多模態大型語言模型無縫整合到一個統一的架構中。MedRAX 動態運用這些模型來解決複雜的醫療查詢，而無需額外的訓練。為了嚴格評估其功能，我們引入了 ChestAgentBench，這是一個全面的基準，包含 7 個不同類別的 2,500 個複雜醫療查詢。我們的實驗證明，與開源和專有模型相比，MedRAX 達到了最先進的效能，這代表了自動化 CXR 解讀系統實際部署的重要一步。資料和程式碼已公開於 https://github.com/bowang-lab/MedRAX", "author": "Adibvafa Fallahpour et.al.", "authors": "Adibvafa Fallahpour, Jun Ma, Alif Munim, Hongwei Lyu, Bo Wang", "id": "2502.02673v1", "paper_url": "http://arxiv.org/abs/2502.02673v1", "repo": "null"}}