{"2406.14903": {"publish_time": "2024-06-21", "title": "GIEBench: Towards Holistic Evaluation of Group Indentity-based Empathy for Large Language Models", "paper_summary": "As large language models (LLMs) continue to develop and gain widespread\napplication, the ability of LLMs to exhibit empathy towards diverse group\nidentities and understand their perspectives is increasingly recognized as\ncritical. Most existing benchmarks for empathy evaluation of LLMs focus\nprimarily on universal human emotions, such as sadness and pain, often\noverlooking the context of individuals' group identities. To address this gap,\nwe introduce GIEBench, a comprehensive benchmark that includes 11 identity\ndimensions, covering 97 group identities with a total of 999 single-choice\nquestions related to specific group identities. GIEBench is designed to\nevaluate the empathy of LLMs when presented with specific group identities such\nas gender, age, occupation, and race, emphasizing their ability to respond from\nthe standpoint of the identified group. This supports the ongoing development\nof empathetic LLM applications tailored to users with different identities. Our\nevaluation of 23 LLMs revealed that while these LLMs understand different\nidentity standpoints, they fail to consistently exhibit equal empathy across\nthese identities without explicit instructions to adopt those perspectives.\nThis highlights the need for improved alignment of LLMs with diverse values to\nbetter accommodate the multifaceted nature of human identities. Our datasets\nare available at https://github.com/GIEBench/GIEBench.", "paper_summary_zh": "隨著大型語言模型 (LLM) 持續發展並廣泛應用，LLM 對不同群體身分展現同理心和理解其觀點的能力愈發被視為至關重要。現有的 LLM 同理心評估基準主要集中於普遍的人類情緒，例如悲傷和痛苦，往往忽略了個人群體身分的背景。為了解決這個差距，我們引入了 GIEBench，這是一個包含 11 個身分維度的綜合基準，涵蓋 97 個群體身分，共有 999 個與特定群體身分相關的單選題。GIEBench 旨在評估 LLM 在面對特定群體身分時，例如性別、年齡、職業和種族，展現同理心的能力，強調它們從所識別群體的立場做出回應的能力。這支持了針對具有不同身分的使用者量身打造的同理心 LLM 應用程式的持續開發。我們對 23 個 LLM 的評估顯示，雖然這些 LLM 了解不同的身分立場，但它們無法在這些身分之間始終如一地展現同等的同理心，除非明確指示採用這些觀點。這突顯了 LLM 與多元價值觀保持一致性的需求，以更好地適應人類身分的複雜本質。我們的資料集可在 https://github.com/GIEBench/GIEBench 取得。", "author": "Leyan Wang et.al.", "authors": "Leyan Wang, Yonggang Jin, Tianhao Shen, Tianyu Zheng, Xinrun Du, Chenchen Zhang, Wenhao Huang, Jiaheng Liu, Shi Wang, Ge Zhang, Liuyu Xiang, Zhaofeng He", "id": "2406.14903v1", "paper_url": "http://arxiv.org/abs/2406.14903v1", "repo": "https://github.com/giebench/giebench"}}