{"2411.05261": {"publish_time": "2024-11-08", "title": "Decoding Report Generators: A Cyclic Vision-Language Adapter for Counterfactual Explanations", "paper_summary": "Despite significant advancements in report generation methods, a critical\nlimitation remains: the lack of interpretability in the generated text. This\npaper introduces an innovative approach to enhance the explainability of text\ngenerated by report generation models. Our method employs cyclic text\nmanipulation and visual comparison to identify and elucidate the features in\nthe original content that influence the generated text. By manipulating the\ngenerated reports and producing corresponding images, we create a comparative\nframework that highlights key attributes and their impact on the text\ngeneration process. This approach not only identifies the image features\naligned to the generated text but also improves transparency but also provides\ndeeper insights into the decision-making mechanisms of the report generation\nmodels. Our findings demonstrate the potential of this method to significantly\nenhance the interpretability and transparency of AI-generated reports.", "paper_summary_zh": "儘管報告生成方法有顯著進展，但仍存在一個嚴重的限制：所產生文字缺乏可解釋性。本文介紹了一種創新的方法，以增強報告生成模型所產生文字的可解釋性。我們的做法採用循環文字處理和視覺比較，以識別並闡明原始內容中影響所產生文字的功能。藉由處理所產生的報告並產生對應的影像，我們建立了一個比較架構，突顯關鍵屬性和它們對文字生成過程的影響。這種方法不僅識別與所產生文字對齊的影像功能，還提高透明度，並提供對報告生成模型決策機制的更深入見解。我們的發現證明了這種方法的潛力，可以顯著增強 AI 生成的報告的可解釋性和透明度。", "author": "Yingying Fang et.al.", "authors": "Yingying Fang, Zihao Jin, Shaojie Guo, Jinda Liu, Yijian Gao, Junzhi Ning, Zhiling Yue, Zhi Li, Simon LF Walsh, Guang Yang", "id": "2411.05261v1", "paper_url": "http://arxiv.org/abs/2411.05261v1", "repo": "null"}}