{"2406.10085": {"publish_time": "2024-06-14", "title": "Enhancing Question Answering on Charts Through Effective Pre-training Tasks", "paper_summary": "To completely understand a document, the use of textual information is not\nenough. Understanding visual cues, such as layouts and charts, is also\nrequired. While the current state-of-the-art approaches for document\nunderstanding (both OCR-based and OCR-free) work well, a thorough analysis of\ntheir capabilities and limitations has not yet been performed. Therefore, in\nthis work, we addresses the limitation of current VisualQA models when applied\nto charts and plots. To investigate shortcomings of the state-of-the-art\nmodels, we conduct a comprehensive behavioral analysis, using ChartQA as a case\nstudy. Our findings indicate that existing models particularly underperform in\nanswering questions related to the chart's structural and visual context, as\nwell as numerical information. To address these issues, we propose three simple\npre-training tasks that enforce the existing model in terms of both\nstructural-visual knowledge, as well as its understanding of numerical\nquestions. We evaluate our pre-trained model (called MatCha-v2) on three chart\ndatasets - both extractive and abstractive question datasets - and observe that\nit achieves an average improvement of 1.7% over the baseline model.", "paper_summary_zh": "要完全理解文件，僅使用文字資訊是不夠的。也需要理解視覺提示，例如配置和圖表。雖然用於文件理解（基於 OCR 和非 OCR）的目前最先進的方法運作良好，但尚未徹底分析它們的能力和限制。因此，在這項工作中，我們探討了應用於圖表和繪圖時的當前 VisualQA 模型的限制。為了調查最先進模型的缺點，我們以 ChartQA 為案例研究，進行了全面的行為分析。我們的發現表明，現有模型在回答與圖表的結構和視覺內容以及數值資訊相關的問題時表現特別不佳。為了解決這些問題，我們提出了三項簡單的預訓練任務，在結構視覺知識和對數值問題的理解方面強制執行現有模型。我們在三個圖表資料集（萃取式和抽象式問題資料集）上評估我們的預訓練模型（稱為 MatCha-v2），並觀察到它比基準模型平均提高了 1.7%。", "author": "Ashim Gupta et.al.", "authors": "Ashim Gupta, Vivek Gupta, Shuo Zhang, Yujie He, Ning Zhang, Shalin Shah", "id": "2406.10085v1", "paper_url": "http://arxiv.org/abs/2406.10085v1", "repo": "null"}}