{"2411.18242": {"publish_time": "2024-11-27", "title": "Thai Financial Domain Adaptation of THaLLE -- Technical Report", "paper_summary": "Large Language Models (LLMs) excel in general tasks but struggle with\ndomain-specific challenges, such as specialized terminology and localized\nregulations. Existing financial LLMs, like FinGPT and BloombergGPT, lack\nsupport for the Thai financial domain. We developed a Thai Financial LLM using\nthe Investment Consultant (IC) exam dataset from the Stock Exchange of\nThailand. To address dataset limitations, we applied data augmentation, ReLoRA\nfor efficient training, Continued Pretraining (CPT) for domain knowledge, and\nRank-Stabilized LoRA (rsLoRA) for fine-tuning. Supervised Fine-Tuning (SFT)\nsimulated exam scenarios, while Direct Preference Optimization (DPO) refined\nthe model using feedback. The model achieved scores of 72%, 72%, and 84% on IC\nexam levels P1, P2, and P3, respectively, demonstrating its effectiveness in\nThai financial advisory tasks and its potential for specialized applications.", "paper_summary_zh": "大型語言模型 (LLM) 在一般任務中表現出色，但在特定領域的挑戰中卻舉步維艱，例如專業術語和在地法規。現有的金融 LLM，例如 FinGPT 和 BloombergGPT，缺乏對泰國金融領域的支持。我們使用泰國證券交易所的投資顧問 (IC) 考試數據集開發了一個泰國金融 LLM。為了解決數據集限制，我們應用數據擴充、用於高效訓練的 ReLoRA、用於領域知識的持續預訓練 (CPT) 以及用於微調的秩穩定 LoRA (rsLoRA)。監督微調 (SFT) 模擬考試場景，而直接偏好最佳化 (DPO) 則使用回饋改進模型。該模型在 IC 考試 P1、P2 和 P3 級別分別達到 72%、72% 和 84% 的分數，證明了其在泰國金融諮詢任務中的有效性及其在專業應用中的潛力。", "author": "KBTG Labs et.al.", "authors": "KBTG Labs, Atthakorn Petchsod, Pornchanan Balee, Danupat Khamnuansin, Anuruth Lertpiya, Chanatip Saetia, Tawunrat Chalothorn, Thadpong Pongthawornkamol, Monchai Lertsutthiwong", "id": "2411.18242v1", "paper_url": "http://arxiv.org/abs/2411.18242v1", "repo": "null"}}