{"2408.08808": {"publish_time": "2024-08-16", "title": "Constructing Domain-Specific Evaluation Sets for LLM-as-a-judge", "paper_summary": "Large Language Models (LLMs) have revolutionized the landscape of machine\nlearning, yet current benchmarks often fall short in capturing the diverse\nbehavior of these models in real-world applications. A benchmark's usefulness\nis determined by its ability to clearly differentiate between models of varying\ncapabilities (separability) and closely align with human preferences. Existing\nframeworks like Alpaca-Eval 2.0 LC\n\\cite{dubois2024lengthcontrolledalpacaevalsimpleway} and Arena-Hard v0.1\n\\cite{li2024crowdsourced} are limited by their focus on general-purpose queries\nand lack of diversity across domains such as law, medicine, and multilingual\ncontexts. In this paper, we address these limitations by introducing a novel\ndata pipeline that curates diverse, domain-specific evaluation sets tailored\nfor LLM-as-a-Judge frameworks. Our approach leverages a combination of manual\ncuration, semi-supervised learning to generate clusters, and stratified\nsampling to ensure balanced representation across a wide range of domains and\nlanguages. The resulting evaluation set, which includes 1573 samples across 14\ncategories, demonstrates high separability (84\\%) across ten top-ranked models,\nand agreement (84\\%) with Chatbot Arena and (0.915) Spearman correlation. The\nagreement values are 9\\% better than Arena Hard and 20\\% better than AlpacaEval\n2.0 LC, while the Spearman coefficient is 0.7 more than the next best\nbenchmark, showcasing a significant improvement in the usefulness of the\nbenchmark. We further provide an open-source evaluation tool that enables\nfine-grained analysis of model performance across user-defined categories,\noffering valuable insights for practitioners. This work contributes to the\nongoing effort to enhance the transparency, diversity, and effectiveness of LLM\nevaluation methodologies.", "paper_summary_zh": "大型語言模型 (LLM) 徹底改變了機器學習的格局，但目前的基準經常無法捕捉這些模型在實際應用中的多樣化行為。基準的效用取決於其清楚區分不同能力模型（可分離性）並與人類偏好緊密結合的能力。現有的框架（例如 Alpaca-Eval 2.0 LC\\cite{dubois2024lengthcontrolledalpacaevalsimpleway} 和 Arena-Hard v0.1\\cite{li2024crowdsourced}）受到其對通用查詢的關注以及缺乏法律、醫學和多語言環境等領域多樣性的限制。在本文中，我們通過引入一種新穎的資料管道來解決這些限制，該管道策劃了針對 LLM 作為評審框架量身打造的多樣化、特定於領域的評估集。我們的做法利用了手動策劃、半監督式學習來生成群集以及分層抽樣的組合，以確保在廣泛的領域和語言中具有平衡的表示。生成的評估集包含 14 個類別中的 1573 個樣本，展示了前十名模型之間的高可分離性 (84%)，以及與聊天機器人競技場的一致性 (84%) 和 (0.915) Spearman 相關性。一致性值比 Arena Hard 高 9%，比 AlpacaEval 2.0 LC 高 20%，而 Spearman 係數比次佳基準高 0.7，顯示基準的效用有顯著提升。我們進一步提供了一個開源評估工具，該工具可以對使用者定義類別中的模型效能進行細緻的分析，為實務工作者提供有價值的見解。這項工作有助於持續努力提高 LLM 評估方法的透明度、多樣性和有效性。", "author": "Ravi Raju et.al.", "authors": "Ravi Raju, Swayambhoo Jain, Bo Li, Jonathan Li, Urmish Thakkar", "id": "2408.08808v1", "paper_url": "http://arxiv.org/abs/2408.08808v1", "repo": "null"}}