{"2412.13196": {"publish_time": "2024-12-17", "title": "ExBody2: Advanced Expressive Humanoid Whole-Body Control", "paper_summary": "This paper enables real-world humanoid robots to maintain stability while\nperforming expressive motions like humans do. We propose ExBody2, a generalized\nwhole-body tracking framework that can take any reference motion inputs and\ncontrol the humanoid to mimic the motion. The model is trained in simulation\nwith Reinforcement Learning and then transferred to the real world. It\ndecouples keypoint tracking with velocity control, and effectively leverages a\nprivileged teacher policy to distill precise mimic skills into the target\nstudent policy, which enables high-fidelity replication of dynamic movements\nsuch as running, crouching, dancing, and other challenging motions. We present\na comprehensive qualitative and quantitative analysis of crucial design factors\nin the paper. We conduct our experiments on two humanoid platforms and\ndemonstrate the superiority of our approach against state-of-the-arts,\nproviding practical guidelines to pursue the extreme of whole-body control for\nhumanoid robots.", "paper_summary_zh": "這篇論文使真實世界的類人機器人在執行人類般的表現動作時能維持穩定。我們提出 ExBody2，一個廣泛化的全身追蹤架構，它可以接收任何參考動作輸入，並控制類人機器人模仿動作。模型在模擬中使用強化學習進行訓練，然後轉移到真實世界。它將關鍵點追蹤與速度控制分離，並有效地利用特權教師策略將精確的模仿技能提煉到目標學生策略中，這使得能夠高保真地複製動態動作，例如跑步、蹲伏、跳舞和其他具有挑戰性的動作。我們在論文中提出了關鍵設計因素的全面定性和定量分析。我們在兩個類人機器人平台上進行實驗，並展示了我們的方法優於現有技術，為追求類人機器人的全身控制極致提供了實用指南。", "author": "Mazeyu Ji et.al.", "authors": "Mazeyu Ji, Xuanbin Peng, Fangchen Liu, Jialong Li, Ge Yang, Xuxin Cheng, Xiaolong Wang", "id": "2412.13196v1", "paper_url": "http://arxiv.org/abs/2412.13196v1", "repo": "null"}}