{"2411.18138": {"publish_time": "2024-11-27", "title": "SALMONN-omni: A Codec-free LLM for Full-duplex Speech Understanding and Generation", "paper_summary": "Full-duplex multimodal large language models (LLMs) provide a unified\nframework for addressing diverse speech understanding and generation tasks,\nenabling more natural and seamless human-machine conversations. Unlike\ntraditional modularised conversational AI systems, which separate speech\nrecognition, understanding, and text-to-speech generation into distinct\ncomponents, multimodal LLMs operate as single end-to-end models. This\nstreamlined design eliminates error propagation across components and fully\nleverages the rich non-verbal information embedded in input speech signals. We\nintroduce SALMONN-omni, a codec-free, full-duplex speech understanding and\ngeneration model capable of simultaneously listening to its own generated\nspeech and background sounds while speaking. To support this capability, we\npropose a novel duplex spoken dialogue framework incorporating a ``thinking''\nmechanism that facilitates asynchronous text and speech generation relying on\nembeddings instead of codecs (quantized speech and audio tokens). Experimental\nresults demonstrate SALMONN-omni's versatility across a broad range of\nstreaming speech tasks, including speech recognition, speech enhancement, and\nspoken question answering. Additionally, SALMONN-omni excels at managing\nturn-taking, barge-in, and echo cancellation scenarios, establishing its\npotential as a robust prototype for full-duplex conversational AI systems. To\nthe best of our knowledge, SALMONN-omni is the first codec-free model of its\nkind. A full technical report along with model checkpoints will be released\nsoon.", "paper_summary_zh": "全雙工多模態大型語言模型 (LLM) 提供了一個統一的架構，用於處理各種語音理解和生成任務，實現更自然、更順暢的人機對話。與傳統的模組化對話式 AI 系統不同，傳統系統將語音辨識、理解和文字轉語音生成分為不同的元件，多模態 LLM 則作為單一的端到端模型運作。這種簡化的設計消除了元件間的錯誤傳播，並充分利用輸入語音訊號中豐富的非語言資訊。我們推出 SALMONN-omni，這是一個無編碼器、全雙工的語音理解和生成模型，能夠在說話時同時聆聽自己產生的語音和背景音。為了支援此功能，我們提出一個新穎的雙工口語對話架構，結合了一個「思考」機制，這個機制使用嵌入式技術（而非編碼器，即量化的語音和音訊代碼）來促進非同步文字和語音生成。實驗結果證明 SALMONN-omni 在廣泛的串流語音任務中展現了多功能性，包括語音辨識、語音增強和口說問題回答。此外，SALMONN-omni 在管理輪流發言、插話和回音消除場景方面表現出色，確立了其作為全雙工對話式 AI 系統的強健原型之潛力。據我們所知，SALMONN-omni 是同類中第一個無編碼器的模型。完整的技術報告和模型檢查點將很快發布。", "author": "Wenyi Yu et.al.", "authors": "Wenyi Yu, Siyin Wang, Xiaoyu Yang, Xianzhao Chen, Xiaohai Tian, Jun Zhang, Guangzhi Sun, Lu Lu, Yuxuan Wang, Chao Zhang", "id": "2411.18138v1", "paper_url": "http://arxiv.org/abs/2411.18138v1", "repo": "null"}}