{"2408.13704": {"publish_time": "2024-08-25", "title": "DHP Benchmark: Are LLMs Good NLG Evaluators?", "paper_summary": "Large Language Models (LLMs) are increasingly serving as evaluators in\nNatural Language Generation (NLG) tasks. However, the capabilities of LLMs in\nscoring NLG quality remain inadequately explored. Current studies depend on\nhuman assessments and simple metrics that fail to capture the discernment of\nLLMs across diverse NLG tasks. To address this gap, we propose the Discernment\nof Hierarchical Perturbation (DHP) benchmarking framework, which provides\nquantitative discernment scores for LLMs utilizing hierarchically perturbed\ntext data and statistical tests to measure the NLG evaluation capabilities of\nLLMs systematically. We have re-established six evaluation datasets for this\nbenchmark, covering four NLG tasks: Summarization, Story Completion, Question\nAnswering, and Translation. Our comprehensive benchmarking of five major LLM\nseries provides critical insight into their strengths and limitations as NLG\nevaluators.", "paper_summary_zh": "大型語言模型 (LLM) 在自然語言生成 (NLG) 任務中越來越常擔任評估者的角色。然而，LLM 在評分 NLG 品質方面的能力仍未得到充分的探討。目前的研究所依賴於無法捕捉 LLM 在不同 NLG 任務中辨別能力的人類評估和簡單指標。為了解決這個差距，我們提出了分層擾動辨別 (DHP) 評量基準架構，該架構利用分層擾動文本資料和統計檢定，提供 LLM 的量化辨別分數，以系統化地衡量 LLM 的 NLG 評估能力。我們為此評量基準重新建立了六個評估資料集，涵蓋四項 NLG 任務：摘要、故事完成、問題解答和翻譯。我們對五個主要 LLM 系列進行的全面評量基準，提供了對其作為 NLG 評估者的優勢和限制的關鍵見解。", "author": "Yicheng Wang et.al.", "authors": "Yicheng Wang, Jiayi Yuan, Yu-Neng Chuang, Zhuoer Wang, Yingchi Liu, Mark Cusick, Param Kulkarni, Zhengping Ji, Yasser Ibrahim, Xia Hu", "id": "2408.13704v1", "paper_url": "http://arxiv.org/abs/2408.13704v1", "repo": "null"}}