{"2408.11344": {"publish_time": "2024-08-21", "title": "Clinical Context-aware Radiology Report Generation from Medical Images using Transformers", "paper_summary": "Recent developments in the field of Natural Language Processing, especially\nlanguage models such as the transformer have brought state-of-the-art results\nin language understanding and language generation. In this work, we investigate\nthe use of the transformer model for radiology report generation from chest\nX-rays. We also highlight limitations in evaluating radiology report generation\nusing only the standard language generation metrics. We then applied a\ntransformer based radiology report generation architecture, and also compare\nthe performance of a transformer based decoder with the recurrence based\ndecoder. Experiments were performed using the IU-CXR dataset, showing superior\nresults to its LSTM counterpart and being significantly faster. Finally, we\nidentify the need of evaluating radiology report generation system using both\nlanguage generation metrics and classification metrics, which helps to provide\nrobust measure of generated reports in terms of their coherence and diagnostic\nvalue.", "paper_summary_zh": "自然語言處理領域的最新發展，尤其是Transformer等語言模型，在語言理解和語言生成方面帶來了最先進的成果。在這項工作中，我們研究了使用Transformer模型從胸部 X 射線生成放射學報告。我們還強調了僅使用標準語言生成指標評估放射學報告生成的局限性。然後我們應用基於Transformer的放射學報告生成架構，並將基於Transformer的解碼器的性能與基於遞歸的解碼器進行比較。使用 IU-CXR 數據集進行了實驗，顯示出優於其 LSTM 對應方的結果，並且速度顯著提升。最後，我們確定需要使用語言生成指標和分類指標來評估放射學報告生成系統，這有助於在連貫性和診斷價值方面提供生成的報告的穩健測量。", "author": "Sonit Singh et.al.", "authors": "Sonit Singh", "id": "2408.11344v1", "paper_url": "http://arxiv.org/abs/2408.11344v1", "repo": "null"}}