{"2406.08116": {"publish_time": "2024-06-12", "title": "Supportiveness-based Knowledge Rewriting for Retrieval-augmented Language Modeling", "paper_summary": "Retrieval-augmented language models (RALMs) have recently shown great\npotential in mitigating the limitations of implicit knowledge in LLMs, such as\nuntimely updating of the latest expertise and unreliable retention of long-tail\nknowledge. However, since the external knowledge base, as well as the\nretriever, can not guarantee reliability, potentially leading to the knowledge\nretrieved not being helpful or even misleading for LLM generation. In this\npaper, we introduce Supportiveness-based Knowledge Rewriting (SKR), a robust\nand pluggable knowledge rewriter inherently optimized for LLM generation.\nSpecifically, we introduce the novel concept of \"supportiveness\"--which\nrepresents how effectively a knowledge piece facilitates downstream tasks--by\nconsidering the perplexity impact of augmented knowledge on the response text\nof a white-box LLM. Based on knowledge supportiveness, we first design a\ntraining data curation strategy for our rewriter model, effectively identifying\nand filtering out poor or irrelevant rewrites (e.g., with low supportiveness\nscores) to improve data efficacy. We then introduce the direct preference\noptimization (DPO) algorithm to align the generated rewrites to optimal\nsupportiveness, guiding the rewriter model to summarize augmented content that\nbetter improves the final response. Comprehensive evaluations across six\npopular knowledge-intensive tasks and four LLMs have demonstrated the\neffectiveness and superiority of SKR. With only 7B parameters, SKR has shown\nbetter knowledge rewriting capability over GPT-4, the current state-of-the-art\ngeneral-purpose LLM.", "paper_summary_zh": "<paragraph>擷取增強語言模型 (RALM) 近期已展現出極佳潛力，可減輕隱含知識在大型語言模型 (LLM) 中的限制，例如最新專業知識的更新不即時，以及長尾知識的保留不可靠。然而，由於外部知識庫和擷取器無法保證可靠性，可能會導致擷取的知識對 LLM 生成沒有幫助，甚至會產生誤導。在本文中，我們介紹了基於支援度的知識改寫 (SKR)，這是一個強健且可插入的知識改寫器，本質上經過最佳化以進行 LLM 生成。具體來說，我們引入了「支援度」的新穎概念，它表示知識片段促進下游任務的成效，方法是考量增強知識對白盒 LLM 回應文字的困惑度影響。根據知識支援度，我們首先為我們的改寫器模型設計一個訓練資料策展策略，有效地找出並過濾掉不良或不相關的改寫（例如，支援度評分低），以提升資料效能。接著，我們引入了直接偏好最佳化 (DPO) 演算法，以將產生的改寫與最佳支援度對齊，引導改寫器模型摘要增強的內容，進而改善最終的回應。在六項廣泛使用的知識密集型任務和四個 LLM 中進行的全面評估，已證明 SKR 的效能和優越性。SKR 僅有 7B 個參數，已展現出比 GPT-4 更佳的知識改寫能力，GPT-4 是目前最先進的通用 LLM。</paragraph>", "author": "Zile Qiao et.al.", "authors": "Zile Qiao, Wei Ye, Yong Jiang, Tong Mo, Pengjun Xie, Weiping Li, Fei Huang, Shikun Zhang", "id": "2406.08116v1", "paper_url": "http://arxiv.org/abs/2406.08116v1", "repo": "null"}}