{"2411.09689": {"publish_time": "2024-11-14", "title": "LLM Hallucination Reasoning with Zero-shot Knowledge Test", "paper_summary": "LLM hallucination, where LLMs occasionally generate unfaithful text, poses\nsignificant challenges for their practical applications. Most existing\ndetection methods rely on external knowledge, LLM fine-tuning, or\nhallucination-labeled datasets, and they do not distinguish between different\ntypes of hallucinations, which are crucial for improving detection performance.\nWe introduce a new task, Hallucination Reasoning, which classifies\nLLM-generated text into one of three categories: aligned, misaligned, and\nfabricated. Our novel zero-shot method assesses whether LLM has enough\nknowledge about a given prompt and text. Our experiments conducted on new\ndatasets demonstrate the effectiveness of our method in hallucination reasoning\nand underscore its importance for enhancing detection performance.", "paper_summary_zh": "大型语言模型 (LLM) 的幻觉，也就是 LLM 偶尔会生成不忠实文本的情况，对其实际应用构成了重大挑战。大多数现有的检测方法依赖于外部知识、LLM 微调或幻觉标记数据集，而且它们不区分不同类型的幻觉，而这对于提高检测性能至关重要。我们引入了一项新任务，即幻觉推理，它将 LLM 生成的文本归类为以下三类之一：对齐、错位和虚构。我们新颖的零样本方法评估了 LLM 是否对给定的提示和文本有足够的了解。我们对新数据集进行的实验证明了我们的方法在幻觉推理中的有效性，并强调了其对提高检测性能的重要性。", "author": "Seongmin Lee et.al.", "authors": "Seongmin Lee, Hsiang Hsu, Chun-Fu Chen", "id": "2411.09689v1", "paper_url": "http://arxiv.org/abs/2411.09689v1", "repo": "null"}}