{"2412.07682": {"publish_time": "2024-12-10", "title": "TRIM: Token Reduction and Inference Modeling for Cost-Effective Language Generation", "paper_summary": "The inference cost of Large Language Models (LLMs) is a significant challenge\ndue to their computational demands, specially on tasks requiring long outputs.\nHowever, natural language often contains redundancy, which presents an\nopportunity for optimization. We have observed that LLMs can generate distilled\nlanguage-concise outputs that retain essential meaning, when prompted\nappropriately. We propose a framework for saving computational cost, in which a\nshorter distilled output from the LLM is reconstructed into a full narrative by\na smaller model with lower inference costs. Our experiments show promising\nresults, particularly in general knowledge domains with 20.58% saved tokens on\naverage with tiny decrease in evaluation metrics, hinting that this approach\ncan effectively balance efficiency and accuracy in language processing tasks.", "paper_summary_zh": "由於大型語言模型 (LLM) 的運算需求，特別是在需要長輸出時，其推論成本是一項重大的挑戰。\n然而，自然語言通常包含冗餘，這提供了最佳化的機會。我們觀察到，LLM 在適當地提示時，可以產生保留基本含義的精煉語言簡潔輸出。我們提出了一個用於節省運算成本的框架，其中 LLM 的較短精煉輸出由具有較低推論成本的較小模型重建成一個完整的敘述。我們的實驗顯示出有希望的結果，特別是在一般知識領域中，評估指標平均節省了 20.58% 的代幣，這暗示了這種方法可以有效地在語言處理任務中平衡效率和準確性。", "author": "Alfredo Garrachón Ruiz et.al.", "authors": "Alfredo Garrachón Ruiz, Tomás de la Rosa, Daniel Borrajo", "id": "2412.07682v1", "paper_url": "http://arxiv.org/abs/2412.07682v1", "repo": "null"}}