{"2406.17967": {"publish_time": "2024-06-25", "title": "Unmasking the Imposters: In-Domain Detection of Human vs. Machine-Generated Tweets", "paper_summary": "The rapid development of large language models (LLMs) has significantly\nimproved the generation of fluent and convincing text, raising concerns about\ntheir misuse on social media platforms. We present a methodology using Twitter\ndatasets to examine the generative capabilities of four LLMs: Llama 3, Mistral,\nQwen2, and GPT4o. We evaluate 7B and 8B parameter base-instruction models of\nthe three open-source LLMs and validate the impact of further fine-tuning and\n\"uncensored\" versions. Our findings show that \"uncensored\" models with\nadditional in-domain fine-tuning dramatically reduce the effectiveness of\nautomated detection methods. This study addresses a gap by exploring smaller\nopen-source models and the effects of \"uncensoring,\" providing insights into\nhow fine-tuning and content moderation influence machine-generated text\ndetection.", "paper_summary_zh": "大型語言模型 (LLM) 的快速發展已大幅提升流暢且有說服力的文字生成，引發了人們對其在社群媒體平台上遭濫用的擔憂。我們提出一個方法，使用 Twitter 資料集來檢視四個 LLM 的生成能力：Llama 3、Mistral、Qwen2 和 GPT4o。我們評估三個開源 LLM 的 7B 和 8B 參數基本指令模型，並驗證進一步微調和「無審查」版本的影響。我們的研究結果顯示，經過額外領域內微調的「無審查」模型大幅降低了自動化偵測方法的效能。本研究透過探索較小的開源模型和「無審查」的效應來解決一個缺口，提供微調和內容審核如何影響機器生成的文字偵測的見解。", "author": "Bryan E. Tuck et.al.", "authors": "Bryan E. Tuck, Rakesh M. Verma", "id": "2406.17967v1", "paper_url": "http://arxiv.org/abs/2406.17967v1", "repo": "null"}}