{"2410.11464": {"publish_time": "2024-10-15", "title": "CoActionGraphRec: Sequential Multi-Interest Recommendations Using Co-Action Graphs", "paper_summary": "There are unique challenges to developing item recommender systems for\ne-commerce platforms like eBay due to sparse data and diverse user interests.\nWhile rich user-item interactions are important, eBay's data sparsity exceeds\nother e-commerce sites by an order of magnitude. To address this challenge, we\npropose CoActionGraphRec (CAGR), a text based two-tower deep learning model\n(Item Tower and User Tower) utilizing co-action graph layers. In order to\nenhance user and item representations, a graph-based solution tailored to\neBay's environment is utilized. For the Item Tower, we represent each item\nusing its co-action items to capture collaborative signals in a co-action graph\nthat is fully leveraged by the graph neural network component. For the User\nTower, we build a fully connected graph of each user's behavior sequence, with\nedges encoding pairwise relationships. Furthermore, an explicit interaction\nmodule learns representations capturing behavior interactions. Extensive\noffline and online A/B test experiments demonstrate the effectiveness of our\nproposed approach and results show improved performance over state-of-the-art\nmethods on key metrics.", "paper_summary_zh": "對於 eBay 等電子商務平台來說，由於資料稀疏且使用者興趣多元，開發商品推薦系統面臨獨特的挑戰。雖然豐富的使用者商品互動很重要，但 eBay 的資料稀疏性卻比其他電子商務網站高出一個數量級。為了應對這項挑戰，我們提出了 CoActionGraphRec (CAGR)，一個基於文字的雙塔深度學習模型（商品塔和使用者塔），利用協同動作圖層。為了增強使用者和商品的表現，我們利用了專門針對 eBay 環境的基於圖表的解決方案。對於商品塔，我們使用其協同動作商品來表示每個商品，以在協同動作圖表中擷取協作訊號，而圖形神經網路元件則充分利用了該圖表。對於使用者塔，我們建立了每個使用者行為序列的完全連接圖表，其中邊緣編碼成對關係。此外，一個明確的互動模組學習表示，擷取行為互動。廣泛的離線和線上 A/B 測試實驗證明了我們提出的方法的有效性，結果顯示在關鍵指標上優於最先進的方法。", "author": "Yi Sun et.al.", "authors": "Yi Sun, Yuri M. Brovman", "id": "2410.11464v1", "paper_url": "http://arxiv.org/abs/2410.11464v1", "repo": "null"}}