{"2410.16212": {"publish_time": "2024-10-21", "title": "Comprehensive benchmarking of large language models for RNA secondary structure prediction", "paper_summary": "Inspired by the success of large language models (LLM) for DNA and proteins,\nseveral LLM for RNA have been developed recently. RNA-LLM uses large datasets\nof RNA sequences to learn, in a self-supervised way, how to represent each RNA\nbase with a semantically rich numerical vector. This is done under the\nhypothesis that obtaining high-quality RNA representations can enhance\ndata-costly downstream tasks. Among them, predicting the secondary structure is\na fundamental task for uncovering RNA functional mechanisms. In this work we\npresent a comprehensive experimental analysis of several pre-trained RNA-LLM,\ncomparing them for the RNA secondary structure prediction task in an unified\ndeep learning framework. The RNA-LLM were assessed with increasing\ngeneralization difficulty on benchmark datasets. Results showed that two LLM\nclearly outperform the other models, and revealed significant challenges for\ngeneralization in low-homology scenarios.", "paper_summary_zh": "受 DNA 和蛋白质的大语言模型 (LLM) 的成功启发，最近已经开发出几种用于 RNA 的 LLM。RNA-LLM 使用大型 RNA 序列数据集以自监督的方式学习如何用语义丰富的数字向量表示每个 RNA 碱基。这是在假设获得高质量的 RNA 表示可以增强数据成本高昂的下游任务的前提下完成的。其中，预测二级结构是揭示 RNA 功能机制的一项基本任务。在这项工作中，我们对几个经过预训练的 RNA-LLM 进行了全面的实验分析，在统一的深度学习框架中将它们用于 RNA 二级结构预测任务进行了比较。RNA-LLM 在基准数据集上以越来越大的泛化难度进行了评估。结果表明，两个 LLM 明显优于其他模型，并揭示了在低同源性场景中泛化的重大挑战。", "author": "L. I. Zablocki et.al.", "authors": "L. I. Zablocki, L. A. Bugnon, M. Gerard, L. Di Persia, G. Stegmayer, D. H. Milone", "id": "2410.16212v1", "paper_url": "http://arxiv.org/abs/2410.16212v1", "repo": "https://github.com/sinc-lab/rna-llm-folding"}}