{"2405.20315": {"publish_time": "2024-05-30", "title": "ANAH: Analytical Annotation of Hallucinations in Large Language Models", "paper_summary": "Reducing the `$\\textit{hallucination}$' problem of Large Language Models\n(LLMs) is crucial for their wide applications. A comprehensive and fine-grained\nmeasurement of the hallucination is the first key step for the governance of\nthis issue but is under-explored in the community. Thus, we present\n$\\textbf{ANAH}$, a bilingual dataset that offers $\\textbf{AN}$alytical\n$\\textbf{A}$nnotation of $\\textbf{H}$allucinations in LLMs within Generative\nQuestion Answering. Each answer sentence in our dataset undergoes rigorous\nannotation, involving the retrieval of a reference fragment, the judgment of\nthe hallucination type, and the correction of hallucinated content. ANAH\nconsists of ~12k sentence-level annotations for ~4.3k LLM responses covering\nover 700 topics, constructed by a human-in-the-loop pipeline. Thanks to the\nfine granularity of the hallucination annotations, we can quantitatively\nconfirm that the hallucinations of LLMs progressively accumulate in the answer\nand use ANAH to train and evaluate hallucination annotators. We conduct\nextensive experiments on studying generative and discriminative annotators and\nshow that, although current open-source LLMs have difficulties in fine-grained\nhallucination annotation, the generative annotator trained with ANAH can\nsurpass all open-source LLMs and GPT-3.5, obtain performance competitive with\nGPT-4, and exhibits better generalization ability on unseen questions.", "paper_summary_zh": "<paragraph>降低大型語言模型 (LLM) 的「幻覺」問題對於其廣泛應用至關重要。對幻覺進行全面且細緻的測量是解決此問題的第一個關鍵步驟，但社群對此的探討卻不足。因此，我們提出了 $\\textbf{ANAH}$，一個雙語資料集，提供生成式問題解答中 LLM 幻覺的 $\\textbf{AN}$alytical $\\textbf{A}$nnotation of $\\textbf{H}$allucinations。我們資料集中的每個答案句子都經過嚴格的註解，包括檢索參考片段、判斷幻覺類型以及更正幻覺內容。ANAH 由人工迴路管道建構，包含超過 700 個主題的約 4.3k 個 LLM 回應，共約 12k 個句子層級註解。由於幻覺註解的細緻程度，我們可以定量確認 LLM 的幻覺會逐漸累積在答案中，並使用 ANAH 來訓練和評估幻覺註解器。我們對生成式和判別式註解器進行了廣泛的實驗，並表明，儘管目前的開源 LLM 難以進行細緻的幻覺註解，但使用 ANAH 訓練的生成式註解器可以超越所有開源 LLM 和 GPT-3.5，獲得與 GPT-4 相當的效能，並在未見過的問題上展現出更好的泛化能力。</paragraph>", "author": "Ziwei Ji et.al.", "authors": "Ziwei Ji, Yuzhe Gu, Wenwei Zhang, Chengqi Lyu, Dahua Lin, Kai Chen", "id": "2405.20315v1", "paper_url": "http://arxiv.org/abs/2405.20315v1", "repo": "https://github.com/open-compass/anah"}}