{"2407.04486": {"publish_time": "2024-07-05", "title": "Variational and Explanatory Neural Networks for Encoding Cancer Profiles and Predicting Drug Responses", "paper_summary": "Human cancers present a significant public health challenge and require the\ndiscovery of novel drugs through translational research. Transcriptomics\nprofiling data that describes molecular activities in tumors and cancer cell\nlines are widely utilized for predicting anti-cancer drug responses. However,\nexisting AI models face challenges due to noise in transcriptomics data and\nlack of biological interpretability. To overcome these limitations, we\nintroduce VETE (Variational and Explanatory Transcriptomics Encoder), a novel\nneural network framework that incorporates a variational component to mitigate\nnoise effects and integrates traceable gene ontology into the neural network\narchitecture for encoding cancer transcriptomics data. Key innovations include\na local interpretability-guided method for identifying ontology paths, a\nvisualization tool to elucidate biological mechanisms of drug responses, and\nthe application of centralized large scale hyperparameter optimization. VETE\ndemonstrated robust accuracy in cancer cell line classification and drug\nresponse prediction. Additionally, it provided traceable biological\nexplanations for both tasks and offers insights into the mechanisms underlying\nits predictions. VETE bridges the gap between AI-driven predictions and\nbiologically meaningful insights in cancer research, which represents a\npromising advancement in the field.", "paper_summary_zh": "人類癌症對公共衛生構成重大挑戰，需要透過轉譯研究發現新藥物。描述腫瘤和癌細胞株分子活動的轉錄組學分析資料廣泛用於預測抗癌藥物反應。然而，現有的 AI 模型因轉錄組學資料中的雜訊和缺乏生物學可解釋性而面臨挑戰。為了克服這些限制，我們引入了 VETE（變異和解釋性轉錄組學編碼器），這是一種新穎的神經網路架構，它結合了變異組成以減輕雜訊效應，並將可追蹤的基因本體整合到神經網路架構中以編碼癌症轉錄組學資料。關鍵創新包括一種局部可解釋性引導方法，用於識別本體路徑，一種用於闡明藥物反應的生物機制的視覺化工具，以及集中式大規模超參數最佳化的應用。VETE 在癌細胞株分類和藥物反應預測方面表現出穩健的準確性。此外，它為這兩個任務提供了可追蹤的生物學解釋，並提供了對其預測背後機制的見解。VETE 彌合了 AI 驅動預測與癌症研究中具有生物學意義的見解之間的差距，這代表了該領域的一項有前途的進展。", "author": "Tianshu Feng et.al.", "authors": "Tianshu Feng, Rohan Gnanaolivu, Abolfazl Safikhani, Yuanhang Liu, Jun Jiang, Nicholas Chia, Alexander Partin, Priyanka Vasanthakumari, Yitan Zhu, Chen Wang", "id": "2407.04486v1", "paper_url": "http://arxiv.org/abs/2407.04486v1", "repo": "null"}}