{"2409.04164": {"publish_time": "2024-09-06", "title": "Can OpenSource beat ChatGPT? -- A Comparative Study of Large Language Models for Text-to-Code Generation", "paper_summary": "In recent years, large language models (LLMs) have emerged as powerful tools\nwith potential applications in various fields, including software engineering.\nWithin the scope of this research, we evaluate five different state-of-the-art\nLLMs - Bard, BingChat, ChatGPT, Llama2, and Code Llama - concerning their\ncapabilities for text-to-code generation. In an empirical study, we feed\nprompts with textual descriptions of coding problems sourced from the\nprogramming website LeetCode to the models with the task of creating solutions\nin Python. Subsequently, the quality of the generated outputs is assessed using\nthe testing functionalities of LeetCode. The results indicate large differences\nin performance between the investigated models. ChatGPT can handle these\ntypical programming challenges by far the most effectively, surpassing even\ncode-specialized models like Code Llama. To gain further insights, we measure\nthe runtime as well as the memory usage of the generated outputs and compared\nthem to the other code submissions on Leetcode. A detailed error analysis,\nencompassing a comparison of the differences concerning correct indentation and\nform of the generated code as well as an assignment of the incorrectly solved\ntasks to certain error categories allows us to obtain a more nuanced picture of\nthe results and potential for improvement. The results also show a clear\npattern of increasingly incorrect produced code when the models are facing a\nlot of context in the form of longer prompts.", "paper_summary_zh": "近年來，大型語言模型 (LLM) 已成為強大的工具，在各種領域中具有潛在應用，包括軟體工程。在此研究範圍內，我們評估五種不同的最先進 LLM - Bard、BingChat、ChatGPT、Llama2 和 Code Llama - 關於它們在文字轉程式碼生成的效能。在實證研究中，我們將來自程式設計網站 LeetCode 的編碼問題文字描述作為提示輸入模型，並賦予它們使用 Python 建立解決方案的任務。隨後，使用 LeetCode 的測試功能評估所產生輸出的品質。結果顯示，所調查模型之間的效能差異很大。ChatGPT 可以最有效地處理這些典型的程式設計挑戰，甚至超越了像 Code Llama 這樣的程式碼專用模型。為了獲得進一步的見解，我們測量了執行時間以及所產生輸出的記憶體使用量，並將它們與 Leetcode 上的其他程式碼提交進行比較。詳細的錯誤分析，包括比較正確縮排和所產生程式碼形式的差異，以及將錯誤解決的任務分配到特定錯誤類別，讓我們能夠獲得更細緻的結果和改善潛力。結果還顯示了一個明確的模式，即當模型面對大量以較長提示形式出現的內容時，產生的程式碼不正確的情況會越來越多。", "author": "Luis Mayer et.al.", "authors": "Luis Mayer, Christian Heumann, Matthias Aßenmacher", "id": "2409.04164v1", "paper_url": "http://arxiv.org/abs/2409.04164v1", "repo": "null"}}