{"2406.07969": {"publish_time": "2024-06-12", "title": "LibriTTS-P: A Corpus with Speaking Style and Speaker Identity Prompts for Text-to-Speech and Style Captioning", "paper_summary": "We introduce LibriTTS-P, a new corpus based on LibriTTS-R that includes\nutterance-level descriptions (i.e., prompts) of speaking style and\nspeaker-level prompts of speaker characteristics. We employ a hybrid approach\nto construct prompt annotations: (1) manual annotations that capture human\nperceptions of speaker characteristics and (2) synthetic annotations on\nspeaking style. Compared to existing English prompt datasets, our corpus\nprovides more diverse prompt annotations for all speakers of LibriTTS-R.\nExperimental results for prompt-based controllable TTS demonstrate that the TTS\nmodel trained with LibriTTS-P achieves higher naturalness than the model using\nthe conventional dataset. Furthermore, the results for style captioning tasks\nshow that the model utilizing LibriTTS-P generates 2.5 times more accurate\nwords than the model using a conventional dataset. Our corpus, LibriTTS-P, is\navailable at https://github.com/line/LibriTTS-P.", "paper_summary_zh": "我們推出 LibriTTS-P，這是一個基於 LibriTTS-R 的新語料庫，其中包含說話風格的語句級描述（即提示）和說話者特徵的說話者級提示。我們採用混合方法來建構提示註解：(1) 捕捉說話者特徵的人類感知的手動註解，以及 (2) 關於說話風格的合成註解。與現有的英語提示資料集相比，我們的語料庫為 LibriTTS-R 的所有說話者提供了更多樣化的提示註解。基於提示的可控 TTS 的實驗結果表明，使用 LibriTTS-P 訓練的 TTS 模型比使用傳統資料集的模型獲得更高的自然度。此外，風格標題任務的結果表明，利用 LibriTTS-P 的模型產生的準確字詞數比使用傳統資料集的模型多 2.5 倍。我們的語料庫 LibriTTS-P 可在 https://github.com/line/LibriTTS-P 取得。", "author": "Masaya Kawamura et.al.", "authors": "Masaya Kawamura, Ryuichi Yamamoto, Yuma Shirahata, Takuya Hasumi, Kentaro Tachibana", "id": "2406.07969v1", "paper_url": "http://arxiv.org/abs/2406.07969v1", "repo": "https://github.com/line/libritts-p"}}