{"2502.14676": {"publish_time": "2025-02-20", "title": "BP-SGCN: Behavioral Pseudo-Label Informed Sparse Graph Convolution Network for Pedestrian and Heterogeneous Trajectory Prediction", "paper_summary": "Trajectory prediction allows better decision-making in applications of\nautonomous vehicles or surveillance by predicting the short-term future\nmovement of traffic agents. It is classified into pedestrian or heterogeneous\ntrajectory prediction. The former exploits the relatively consistent behavior\nof pedestrians, but is limited in real-world scenarios with heterogeneous\ntraffic agents such as cyclists and vehicles. The latter typically relies on\nextra class label information to distinguish the heterogeneous agents, but such\nlabels are costly to annotate and cannot be generalized to represent different\nbehaviors within the same class of agents. In this work, we introduce the\nbehavioral pseudo-labels that effectively capture the behavior distributions of\npedestrians and heterogeneous agents solely based on their motion features,\nsignificantly improving the accuracy of trajectory prediction. To implement the\nframework, we propose the Behavioral Pseudo-Label Informed Sparse Graph\nConvolution Network (BP-SGCN) that learns pseudo-labels and informs to a\ntrajectory predictor. For optimization, we propose a cascaded training scheme,\nin which we first learn the pseudo-labels in an unsupervised manner, and then\nperform end-to-end fine-tuning on the labels in the direction of increasing the\ntrajectory prediction accuracy. Experiments show that our pseudo-labels\neffectively model different behavior clusters and improve trajectory\nprediction. Our proposed BP-SGCN outperforms existing methods using both\npedestrian (ETH/UCY, pedestrian-only SDD) and heterogeneous agent datasets\n(SDD, Argoverse 1).", "paper_summary_zh": "軌跡預測允許在自動駕駛車輛或監視應用中做出更好的決策，藉由預測交通代理的短期未來移動。它被分類為行人或異質軌跡預測。前者利用行人相對一致的行為，但受限於與自行車騎士和車輛等異質交通代理的真實世界場景。後者通常依賴額外的類別標籤資訊來區分異質代理，但此類標籤的註解成本很高，且無法概括為表示同一類別代理中的不同行為。在這項工作中，我們引入了行為偽標籤，它僅根據行人和異質代理的運動特徵有效捕捉行為分佈，顯著提升軌跡預測的準確度。為實作架構，我們提出了行為偽標籤告知稀疏圖形卷積網路 (BP-SGCN)，它學習偽標籤並告知軌跡預測器。針對最佳化，我們提出了一種串聯訓練方案，其中我們首先以非監督的方式學習偽標籤，然後在標籤上執行端到端微調，朝著提升軌跡預測準確度的方向進行。實驗顯示我們的偽標籤有效建模不同的行為叢集，並提升軌跡預測。我們提出的 BP-SGCN 使用行人 (ETH/UCY，僅限行人的 SDD) 和異質代理資料集 (SDD，Argoverse 1) 都優於現有方法。", "author": "Ruochen Li et.al.", "authors": "Ruochen Li, Stamos Katsigiannis, Tae-Kyun Kim, Hubert P. H. Shum", "id": "2502.14676v1", "paper_url": "http://arxiv.org/abs/2502.14676v1", "repo": "null"}}