{"2406.11818": {"publish_time": "2024-06-17", "title": "Embodied Instruction Following in Unknown Environments", "paper_summary": "Enabling embodied agents to complete complex human instructions from natural\nlanguage is crucial to autonomous systems in household services. Conventional\nmethods can only accomplish human instructions in the known environment where\nall interactive objects are provided to the embodied agent, and directly\ndeploying the existing approaches for the unknown environment usually generates\ninfeasible plans that manipulate non-existing objects. On the contrary, we\npropose an embodied instruction following (EIF) method for complex tasks in the\nunknown environment, where the agent efficiently explores the unknown\nenvironment to generate feasible plans with existing objects to accomplish\nabstract instructions. Specifically, we build a hierarchical embodied\ninstruction following framework including the high-level task planner and the\nlow-level exploration controller with multimodal large language models. We then\nconstruct a semantic representation map of the scene with dynamic region\nattention to demonstrate the known visual clues, where the goal of task\nplanning and scene exploration is aligned for human instruction. For the task\nplanner, we generate the feasible step-by-step plans for human goal\naccomplishment according to the task completion process and the known visual\nclues. For the exploration controller, the optimal navigation or object\ninteraction policy is predicted based on the generated step-wise plans and the\nknown visual clues. The experimental results demonstrate that our method can\nachieve 45.09% success rate in 204 complex human instructions such as making\nbreakfast and tidying rooms in large house-level scenes.", "paper_summary_zh": "讓具身代理人完成自然語言中的複雜人類指示對於家庭服務中的自主系統至關重要。傳統方法只能在已知環境中完成人類指示，其中所有互動對象都提供給具身代理人，並且直接部署現有方法來應對未知環境通常會產生不可行的計畫，這些計畫會操作不存在的對象。相反，我們提出了一種在未知環境中執行複雜任務的具身指令遵循 (EIF) 方法，其中代理人有效地探索未知環境以生成可行的計畫，並使用現有對象來完成抽象指令。具體來說，我們構建了一個分層具身指令遵循架構，包括高級任務規劃器和具有多模態大型語言模型的低級探索控制器。然後，我們構建一個場景的語義表示圖，並使用動態區域注意來展示已知的視覺線索，其中任務規劃和場景探索的目標與人類指令保持一致。對於任務規劃器，我們根據任務完成過程和已知的視覺線索來生成可行的逐步計畫，以完成人類目標。對於探索控制器，最佳導航或對象互動策略是根據生成的逐步計畫和已知的視覺線索來預測的。實驗結果表明，我們的模型可以在 204 條複雜的人類指令中實現 45.09% 的成功率，例如在大型房屋場景中製作早餐和整理房間。", "author": "Zhenyu Wu et.al.", "authors": "Zhenyu Wu, Ziwei Wang, Xiuwei Xu, Jiwen Lu, Haibin Yan", "id": "2406.11818v1", "paper_url": "http://arxiv.org/abs/2406.11818v1", "repo": "null"}}