{"2407.04648": {"publish_time": "2024-07-05", "title": "Efficient Materials Informatics between Rockets and Electrons", "paper_summary": "The true power of computational research typically can lay in either what it\naccomplishes or what it enables others to accomplish. In this work, both\navenues are simultaneously embraced across several distinct efforts existing at\nthree general scales of abstractions of what a material is - atomistic,\nphysical, and design. At each, an efficient materials informatics\ninfrastructure is being built from the ground up based on (1) the fundamental\nunderstanding of the underlying prior knowledge, including the data, (2)\ndeployment routes that take advantage of it, and (3) pathways to extend it in\nan autonomous or semi-autonomous fashion, while heavily relying on artificial\nintelligence (AI) to guide well-established DFT-based ab initio and\nCALPHAD-based thermodynamic methods.\n  The resulting multi-level discovery infrastructure is highly generalizable as\nit focuses on encoding problems to solve them easily rather than looking for an\nexisting solution. To showcase it, this dissertation discusses the design of\nmulti-alloy functionally graded materials (FGMs) incorporating ultra-high\ntemperature refractory high entropy alloys (RHEAs) towards gas turbine and jet\nengine efficiency increase reducing CO2 emissions, as well as hypersonic\nvehicles. It leverages a new graph representation of underlying mathematical\nspace using a newly developed algorithm based on combinatorics, not subject to\nmany problems troubling the community. Underneath, property models and phase\nrelations are learned from optimized samplings of the largest and highest\nquality dataset of HEA in the world, called ULTERA. At the atomistic level, a\ndata ecosystem optimized for machine learning (ML) from over 4.5 million\nrelaxed structures, called MPDD, is used to inform experimental observations\nand improve thermodynamic models by providing stability data enabled by a new\nefficient featurization framework.", "paper_summary_zh": "計算研究的真正力量通常在於它所完成的事情或它使他人能夠完成的事情。在這項工作中，這兩個途徑同時在三個不同的層面上被同時採用，這些層面存在於材料的抽象的三個一般尺度上——原子、物理和設計。在每個層面上，一個高效的材料信息學基礎設施正在從頭開始建立，基於 (1) 對基礎先驗知識的理解，包括數據，(2) 利用它的部署路線，以及 (3) 以自主或半自主的方式擴展它的途徑，同時依賴人工智能 (AI) 來指導完善的 DFT 為基礎的從頭算起和 CALPHAD 為基礎的熱力學方法。\n由此產生的多級發現基礎設施具有高度的概括性，因為它專注於編碼問題以輕鬆地解決它們，而不是尋找現有的解決方案。為了展示它，本文討論了多合金功能梯度材料 (FGM) 的設計，它結合了超高溫耐火高熵合金 (RHEA)，以提高燃氣輪機和噴氣發動機的效率，減少二氧化碳排放，以及高超音速飛行器。它利用了一種新的數學空間圖形表示，使用一種新開發的基於組合學的算法，不受困擾社區的許多問題的影響。在下面，從世界上最大、質量最高的高熵合金數據集 ULTERA 的優化抽樣中學習屬性模型和相關係。在原子層面上，一個針對機器學習 (ML) 優化的數據生態系統，來自 450 萬個以上的放鬆結構，稱為 MPDD，用於通知實驗觀察並通過一個新的高效特徵化框架提供的穩定性數據來改進熱力學模型。", "author": "Adam M. Krajewski et.al.", "authors": "Adam M. Krajewski", "id": "2407.04648v1", "paper_url": "http://arxiv.org/abs/2407.04648v1", "repo": "null"}}