{"2407.13505": {"publish_time": "2024-07-18", "title": "Robots Can Multitask Too: Integrating a Memory Architecture and LLMs for Enhanced Cross-Task Robot Action Generation", "paper_summary": "Large Language Models (LLMs) have been recently used in robot applications\nfor grounding LLM common-sense reasoning with the robot's perception and\nphysical abilities. In humanoid robots, memory also plays a critical role in\nfostering real-world embodiment and facilitating long-term interactive\ncapabilities, especially in multi-task setups where the robot must remember\nprevious task states, environment states, and executed actions. In this paper,\nwe address incorporating memory processes with LLMs for generating cross-task\nrobot actions, while the robot effectively switches between tasks. Our proposed\ndual-layered architecture features two LLMs, utilizing their complementary\nskills of reasoning and following instructions, combined with a memory model\ninspired by human cognition. Our results show a significant improvement in\nperformance over a baseline of five robotic tasks, demonstrating the potential\nof integrating memory with LLMs for combining the robot's action and perception\nfor adaptive task execution.", "paper_summary_zh": "大型語言模型 (LLM) 近來已用於機器人應用中，以機器人的感知和物理能力為基礎，建立 LLM 常識推理。在類人機器人中，記憶也扮演著關鍵角色，促進真實世界的具體化，並促進長期互動能力，特別是在多任務設定中，機器人必須記住先前的任務狀態、環境狀態和執行動作。在本文中，我們探討將記憶流程與 LLM 整合，以產生跨任務機器人動作，同時機器人在任務之間有效切換。我們提出的雙層架構採用兩個 LLM，利用它們在推理和遵循指令方面的互補技能，並結合受人類認知啟發的記憶模型。我們的結果顯示，在五項機器人任務的基準上，效能有顯著提升，證明了將記憶與 LLM 整合以結合機器人的動作和感知，以進行適應性任務執行的潛力。", "author": "Hassan Ali et.al.", "authors": "Hassan Ali, Philipp Allgeuer, Carlo Mazzola, Giulia Belgiovine, Burak Can Kaplan, Stefan Wermter", "id": "2407.13505v1", "paper_url": "http://arxiv.org/abs/2407.13505v1", "repo": "null"}}