{"2406.04758": {"publish_time": "2024-06-07", "title": "Think out Loud: Emotion Deducing Explanation in Dialogues", "paper_summary": "Humans convey emotions through daily dialogues, making emotion understanding\na crucial step of affective intelligence. To understand emotions in dialogues,\nmachines are asked to recognize the emotion for an utterance (Emotion\nRecognition in Dialogues, ERD); based on the emotion, then find causal\nutterances for the emotion (Emotion Cause Extraction in Dialogues, ECED). The\nsetting of the two tasks requires first ERD and then ECED, ignoring the mutual\ncomplement between emotion and cause. To fix this, some new tasks are proposed\nto extract them simultaneously. Although the current research on these tasks\nhas excellent achievements, simply identifying emotion-related factors by\nclassification modeling lacks realizing the specific thinking process of causes\nstimulating the emotion in an explainable way. This thinking process especially\nreflected in the reasoning ability of Large Language Models (LLMs) is\nunder-explored. To this end, we propose a new task \"Emotion Deducing\nExplanation in Dialogues\" (EDEN). EDEN recognizes emotion and causes in an\nexplicitly thinking way. That is, models need to generate an explanation text,\nwhich first summarizes the causes; analyzes the inner activities of the\nspeakers triggered by the causes using common sense; then guesses the emotion\naccordingly. To support the study of EDEN, based on the existing resources in\nECED, we construct two EDEN datasets by human effort. We further evaluate\ndifferent models on EDEN and find that LLMs are more competent than\nconventional PLMs. Besides, EDEN can help LLMs achieve better recognition of\nemotions and causes, which explores a new research direction of explainable\nemotion understanding in dialogues.", "paper_summary_zh": "人類透過日常對話傳達情緒，使情緒理解成為情感智能的關鍵一步。為了理解對話中的情緒，機器被要求辨識一段話的情緒（對話中的情緒辨識，ERD）；接著根據情緒，找出造成該情緒的因果話語（對話中的情緒原因萃取，ECED）。這兩個任務的設定需要先進行 ERD，再進行 ECED，忽略了情緒與原因之間的相互補充。為了修正這個問題，一些新的任務被提出來同時萃取它們。儘管目前對這些任務的研究已有卓越的成就，但僅透過分類模型辨識與情緒相關的因素，無法以可解釋的方式實現導致情緒的具體思考過程。這個思考過程特別反映在大型語言模型 (LLM) 的推理能力中，卻未被充分探討。為此，我們提出一個新的任務「對話中的情緒推理解釋」（EDEN）。EDEN 以一種明確思考的方式辨識情緒和原因。也就是說，模型需要生成一個解釋文字，它首先總結原因；使用常識分析原因觸發說話者的內在活動；然後據此猜測情緒。為了支持 EDEN 的研究，我們根據 ECED 中現有的資源，透過人力建構了兩個 EDEN 資料集。我們進一步評估了 EDEN 上的不同模型，發現 LLM 比傳統的 PLM 更勝任。此外，EDEN 可以幫助 LLM 更準確地辨識情緒和原因，這探索了對話中可解釋情緒理解的新研究方向。", "author": "Jiangnan Li et.al.", "authors": "Jiangnan Li, Zheng Lin, Lanrui Wang, Qingyi Si, Yanan Cao, Mo Yu, Peng Fu, Weiping Wang, Jie Zhou", "id": "2406.04758v1", "paper_url": "http://arxiv.org/abs/2406.04758v1", "repo": "null"}}