{"2503.18945": {"publish_time": "2025-03-24", "title": "Aether: Geometric-Aware Unified World Modeling", "paper_summary": "The integration of geometric reconstruction and generative modeling remains a\ncritical challenge in developing AI systems capable of human-like spatial\nreasoning. This paper proposes Aether, a unified framework that enables\ngeometry-aware reasoning in world models by jointly optimizing three core\ncapabilities: (1) 4D dynamic reconstruction, (2) action-conditioned video\nprediction, and (3) goal-conditioned visual planning. Through task-interleaved\nfeature learning, Aether achieves synergistic knowledge sharing across\nreconstruction, prediction, and planning objectives. Building upon video\ngeneration models, our framework demonstrates unprecedented synthetic-to-real\ngeneralization despite never observing real-world data during training.\nFurthermore, our approach achieves zero-shot generalization in both action\nfollowing and reconstruction tasks, thanks to its intrinsic geometric modeling.\nRemarkably, even without real-world data, its reconstruction performance far\nexceeds that of domain-specific models. Additionally, Aether leverages a\ngeometry-informed action space to seamlessly translate predictions into\nactions, enabling effective autonomous trajectory planning. We hope our work\ninspires the community to explore new frontiers in physically-reasonable world\nmodeling and its applications.", "paper_summary_zh": "<paragraph>在開發具備類似人類空間推理能力的 AI 系統方面，幾何重建與生成模型的整合仍然是一項關鍵挑戰。本文提出了 Aether，這是一個統一的框架，透過共同優化三個核心能力，使世界模型能夠進行幾何感知推理：(1) 4D 動態重建，(2) 基於動作的影片預測，以及 (3) 基於目標的視覺規劃。透過任務交錯的特徵學習，Aether 在重建、預測和規劃目標之間實現了協同知識共享。基於影片生成模型，儘管在訓練期間從未觀察到真實世界數據，我們的框架展現了前所未有的合成到真實的泛化能力。此外，由於其內在的幾何建模，我們的方法在動作執行和重建任務中都實現了零樣本泛化。值得注意的是，即使沒有真實世界的數據，它的重建性能也遠遠超過特定領域的模型。此外，Aether 利用幾何資訊的動作空間將預測無縫轉化為動作，從而實現有效的自主軌跡規劃。我們希望這項工作能夠激勵社群探索物理合理的世界建模及其應用方面的新領域。</paragraph>\n", "author": "Aether Team et.al.", "authors": "Aether Team, Haoyi Zhu, Yifan Wang, Jianjun Zhou, Wenzheng Chang, Yang Zhou, Zizun Li, Junyi Chen, Chunhua Shen, Jiangmiao Pang, Tong He", "id": "2503.18945v1", "paper_url": "http://arxiv.org/abs/2503.18945v1", "repo": "null"}}