{"2502.11753": {"publish_time": "2025-02-17", "title": "HintsOfTruth: A Multimodal Checkworthiness Detection Dataset with Real and Synthetic Claims", "paper_summary": "Misinformation can be countered with fact-checking, but the process is costly\nand slow. Identifying checkworthy claims is the first step, where automation\ncan help scale fact-checkers' efforts. However, detection methods struggle with\ncontent that is 1) multimodal, 2) from diverse domains, and 3) synthetic. We\nintroduce HintsOfTruth, a public dataset for multimodal checkworthiness\ndetection with $27$K real-world and synthetic image/claim pairs. The mix of\nreal and synthetic data makes this dataset unique and ideal for benchmarking\ndetection methods. We compare fine-tuned and prompted Large Language Models\n(LLMs). We find that well-configured lightweight text-based encoders perform\ncomparably to multimodal models but the first only focus on identifying\nnon-claim-like content. Multimodal LLMs can be more accurate but come at a\nsignificant computational cost, making them impractical for large-scale\napplications. When faced with synthetic data, multimodal models perform more\nrobustly", "paper_summary_zh": "錯誤訊息可以透過事實查核來反駁，但這個過程既昂貴又緩慢。辨識需要查核的說法是第一步，自動化可以幫助擴大事實查核人員的努力。然而，偵測方法會在處理 1) 多模態、2) 來自不同領域，以及 3) 合成的內容時遇到困難。我們引進 HintsOfTruth，一個用於多模態查核價值偵測的公開資料集，其中包含 27K 個真實世界和合成的影像/說法配對。真實和合成資料的組合讓這個資料集獨一無二，非常適合用於基準偵測方法。我們比較微調和提示的大語言模型 (LLM)。我們發現，設定良好的輕量級文字編碼器的表現與多模態模型相當，但前者只專注於辨識非說法類型的內容。多模態 LLM 可能更準確，但需要大量的運算成本，這讓它們不適用於大規模的應用。在面對合成資料時，多模態模型的表現更強健。", "author": "Michiel van der Meer et.al.", "authors": "Michiel van der Meer, Pavel Korshunov, Sébastien Marcel, Lonneke van der Plas", "id": "2502.11753v1", "paper_url": "http://arxiv.org/abs/2502.11753v1", "repo": "null"}}