{"2504.07830": {"publish_time": "2025-04-10", "title": "MOSAIC: Modeling Social AI for Content Dissemination and Regulation in Multi-Agent Simulations", "paper_summary": "We present a novel, open-source social network simulation framework, MOSAIC,\nwhere generative language agents predict user behaviors such as liking,\nsharing, and flagging content. This simulation combines LLM agents with a\ndirected social graph to analyze emergent deception behaviors and gain a better\nunderstanding of how users determine the veracity of online social content. By\nconstructing user representations from diverse fine-grained personas, our\nsystem enables multi-agent simulations that model content dissemination and\nengagement dynamics at scale. Within this framework, we evaluate three\ndifferent content moderation strategies with simulated misinformation\ndissemination, and we find that they not only mitigate the spread of\nnon-factual content but also increase user engagement. In addition, we analyze\nthe trajectories of popular content in our simulations, and explore whether\nsimulation agents' articulated reasoning for their social interactions truly\naligns with their collective engagement patterns. We open-source our simulation\nsoftware to encourage further research within AI and social sciences.", "paper_summary_zh": "<paragraph>我們提出了一個新穎的開源社群網路模擬框架 MOSAIC，其中的生成式語言代理可以預測使用者行為，例如按讚、分享和標記內容。這個模擬結合了大型語言模型代理和有向社交圖譜，用於分析新興的欺騙行為，並更好地理解使用者如何判斷線上社群內容的真實性。透過根據不同的細粒度角色建構使用者表徵，我們的系統可以進行多代理模擬，以大規模模擬內容傳播和參與動態。在這個框架內，我們評估了三種不同的內容審核策略以及模擬的錯誤資訊傳播，我們發現這些策略不僅能減緩非事實內容的傳播，還能提高使用者參與度。此外，我們分析了模擬中熱門內容的軌跡，並探討了模擬代理闡述的社群互動推理是否與其集體參與模式真正一致。我們將模擬軟體開源，以鼓勵人工智慧和社會科學領域的進一步研究。</paragraph>\n", "author": "Genglin Liu et.al.", "authors": "Genglin Liu, Salman Rahman, Elisa Kreiss, Marzyeh Ghassemi, Saadia Gabriel", "id": "2504.07830v1", "paper_url": "http://arxiv.org/abs/2504.07830v1", "repo": "null"}}