{"2411.08414": {"publish_time": "2024-11-13", "title": "Material Property Prediction with Element Attribute Knowledge Graphs and Multimodal Representation Learning", "paper_summary": "Machine learning has become a crucial tool for predicting the properties of\ncrystalline materials. However, existing methods primarily represent material\ninformation by constructing multi-edge graphs of crystal structures, often\noverlooking the chemical and physical properties of elements (such as atomic\nradius, electronegativity, melting point, and ionization energy), which have a\nsignificant impact on material performance. To address this limitation, we\nfirst constructed an element property knowledge graph and utilized an embedding\nmodel to encode the element attributes within the knowledge graph. Furthermore,\nwe propose a multimodal fusion framework, ESNet, which integrates element\nproperty features with crystal structure features to generate joint multimodal\nrepresentations. This provides a more comprehensive perspective for predicting\nthe performance of crystalline materials, enabling the model to consider both\nmicrostructural composition and chemical characteristics of the materials. We\nconducted experiments on the Materials Project benchmark dataset, which showed\nleading performance in the bandgap prediction task and achieved results on a\npar with existing benchmarks in the formation energy prediction task.", "paper_summary_zh": "機器學習已成為預測結晶材料特性的關鍵工具。然而，現有方法主要透過建立晶體結構的多邊圖來表示材料資訊，常常忽略元素的化學和物理特性（例如原子半徑、電負性、熔點和電離能），而這些特性對材料效能有顯著影響。為了解決這個限制，我們首先建構了一個元素屬性知識圖譜，並利用嵌入模型對知識圖譜中的元素屬性進行編碼。此外，我們提出了一個多模態融合框架 ESNet，它將元素屬性特徵與晶體結構特徵整合起來，以產生聯合的多模態表示。這為預測結晶材料的效能提供了更全面的觀點，使模型能夠同時考慮材料的微結構組成和化學特性。我們對 Materials Project 基準資料集進行了實驗，結果顯示在能隙預測任務中表現出色，並且在形成能預測任務中取得了與現有基準相當的結果。", "author": "Chao Huang et.al.", "authors": "Chao Huang, Chunyan Chen, Ling Shi, Chen Chen", "id": "2411.08414v1", "paper_url": "http://arxiv.org/abs/2411.08414v1", "repo": "null"}}