{"2501.11896": {"publish_time": "2025-01-21", "title": "Systematic Abductive Reasoning via Diverse Relation Representations in Vector-symbolic Architecture", "paper_summary": "In abstract visual reasoning, monolithic deep learning models suffer from\nlimited interpretability and generalization, while existing neuro-symbolic\napproaches fall short in capturing the diversity and systematicity of\nattributes and relation representations. To address these challenges, we\npropose a Systematic Abductive Reasoning model with diverse relation\nrepresentations (Rel-SAR) in Vector-symbolic Architecture (VSA) to solve\nRaven's Progressive Matrices (RPM). To derive attribute representations with\nsymbolic reasoning potential, we introduce not only various types of atomic\nvectors that represent numeric, periodic and logical semantics, but also the\nstructured high-dimentional representation (SHDR) for the overall Grid\ncomponent. For systematic reasoning, we propose novel numerical and logical\nrelation functions and perform rule abduction and execution in a unified\nframework that integrates these relation representations. Experimental results\ndemonstrate that Rel-SAR achieves significant improvement on RPM tasks and\nexhibits robust out-of-distribution generalization. Rel-SAR leverages the\nsynergy between HD attribute representations and symbolic reasoning to achieve\nsystematic abductive reasoning with both interpretable and computable\nsemantics.", "paper_summary_zh": "在抽象视觉推理中，单一深度学习模型在可解释性和泛化能力方面存在不足，而现有的神经符号方法在捕捉属性和关系表示的多样性和系统性方面存在不足。为了应对这些挑战，我们在矢量符号架构 (VSA) 中提出了一种具有不同关系表示的系统演绎推理模型 (Rel-SAR)，以解决雷文渐进矩阵 (RPM)。为了推导出具有符号推理潜力的属性表示，我们不仅引入了表示数字、周期性和逻辑语义的各种类型的原子向量，还引入了整体网格组件的结构化高维表示 (SHDR)。对于系统推理，我们提出了新的数值和逻辑关系函数，并在统一的框架中执行规则归纳和执行，该框架集成了这些关系表示。实验结果表明，Rel-SAR 在 RPM 任务上取得了显着改进，并表现出稳健的分布外泛化能力。Rel-SAR 利用高清属性表示和符号推理之间的协同作用，实现了可解释和可计算语义的系统演绎推理。", "author": "Zhong-Hua Sun et.al.", "authors": "Zhong-Hua Sun, Ru-Yuan Zhang, Zonglei Zhen, Da-Hui Wang, Yong-Jie Li, Xiaohong Wan, Hongzhi You", "id": "2501.11896v1", "paper_url": "http://arxiv.org/abs/2501.11896v1", "repo": "null"}}