{"2409.17892": {"publish_time": "2024-09-26", "title": "EMMA-500: Enhancing Massively Multilingual Adaptation of Large Language Models", "paper_summary": "In this work, we introduce EMMA-500, a large-scale multilingual language\nmodel continue-trained on texts across 546 languages designed for enhanced\nmultilingual performance, focusing on improving language coverage for\nlow-resource languages. To facilitate continual pre-training, we compile the\nMaLA corpus, a comprehensive multilingual dataset enriched with curated\ndatasets across diverse domains. Leveraging this corpus, we conduct extensive\ncontinual pre-training of the Llama 2 7B model, resulting in EMMA-500, which\ndemonstrates robust performance across a wide collection of benchmarks,\nincluding a comprehensive set of multilingual tasks and PolyWrite, an\nopen-ended generation benchmark developed in this study. Our results highlight\nthe effectiveness of continual pre-training in expanding large language models'\nlanguage capacity, particularly for underrepresented languages, demonstrating\nsignificant gains in cross-lingual transfer, task generalization, and language\nadaptability.", "paper_summary_zh": "在這項工作中，我們介紹了 EMMA-500，這是一個經過 546 種語言訓練的大型多語言語言模型，專注於改善語言覆蓋範圍，以提升多語言效能，特別是低資源語言。為了促進持續預訓練，我們編譯了 MaLA 語料庫，這是一個全面的多語言資料集，其中包含了來自不同領域的策展資料集。利用這個語料庫，我們對 Llama 2 7B 模型進行廣泛的持續預訓練，產生了 EMMA-500，它在廣泛的基準集合中展示了強大的效能，包括一組全面的多語言任務和 PolyWrite，這是本研究中開發的開放式生成基準。我們的結果突顯了持續預訓練在擴展大型語言模型語言能力方面的有效性，特別是對於代表性不足的語言，證明了跨語言轉移、任務概化和語言適應性的顯著進步。", "author": "Shaoxiong Ji et.al.", "authors": "Shaoxiong Ji, Zihao Li, Indraneil Paul, Jaakko Paavola, Peiqin Lin, Pinzhen Chen, Dayyán O'Brien, Hengyu Luo, Hinrich Schütze, Jörg Tiedemann, Barry Haddow", "id": "2409.17892v1", "paper_url": "http://arxiv.org/abs/2409.17892v1", "repo": "null"}}