{"2501.08182": {"publish_time": "2025-01-14", "title": "CG-MER: A Card Game-based Multimodal dataset for Emotion Recognition", "paper_summary": "The field of affective computing has seen significant advancements in\nexploring the relationship between emotions and emerging technologies. This\npaper presents a novel and valuable contribution to this field with the\nintroduction of a comprehensive French multimodal dataset designed specifically\nfor emotion recognition. The dataset encompasses three primary modalities:\nfacial expressions, speech, and gestures, providing a holistic perspective on\nemotions. Moreover, the dataset has the potential to incorporate additional\nmodalities, such as Natural Language Processing (NLP) to expand the scope of\nemotion recognition research. The dataset was curated through engaging\nparticipants in card game sessions, where they were prompted to express a range\nof emotions while responding to diverse questions. The study included 10\nsessions with 20 participants (9 females and 11 males). The dataset serves as a\nvaluable resource for furthering research in emotion recognition and provides\nan avenue for exploring the intricate connections between human emotions and\ndigital technologies.", "paper_summary_zh": "情感計算領域在探索情緒與新興科技之間的關係方面已取得顯著進展。這篇論文透過引入專門為情緒辨識而設計的全面法語多模態資料集，對此領域提出新穎且有價值的貢獻。資料集包含三個主要的模態：表情、語音和手勢，提供對情緒的整體觀點。此外，資料集有潛力納入其他模態，例如自然語言處理 (NLP)，以擴展情緒辨識研究的範圍。此資料集是透過讓參與者參與紙牌遊戲，並在回答各種問題的同時提示他們表達一系列情緒來策劃的。這項研究包括 10 場會議，有 20 位參與者（9 位女性和 11 位男性）。此資料集是促進情緒辨識研究的寶貴資源，並提供探索人類情緒與數位科技之間複雜關聯的途徑。", "author": "Nessrine Farhat et.al.", "authors": "Nessrine Farhat, Amine Bohi, Leila Ben Letaifa, Rim Slama", "id": "2501.08182v1", "paper_url": "http://arxiv.org/abs/2501.08182v1", "repo": "null"}}