{"2501.05113": {"publish_time": "2025-01-09", "title": "Constrained Optimization of Charged Particle Tracking with Multi-Agent Reinforcement Learning", "paper_summary": "Reinforcement learning demonstrated immense success in modelling complex\nphysics-driven systems, providing end-to-end trainable solutions by interacting\nwith a simulated or real environment, maximizing a scalar reward signal. In\nthis work, we propose, building upon previous work, a multi-agent reinforcement\nlearning approach with assignment constraints for reconstructing particle\ntracks in pixelated particle detectors. Our approach optimizes collaboratively\na parametrized policy, functioning as a heuristic to a multidimensional\nassignment problem, by jointly minimizing the total amount of particle\nscattering over the reconstructed tracks in a readout frame. To satisfy\nconstraints, guaranteeing a unique assignment of particle hits, we propose a\nsafety layer solving a linear assignment problem for every joint action.\nFurther, to enforce cost margins, increasing the distance of the local policies\npredictions to the decision boundaries of the optimizer mappings, we recommend\nthe use of an additional component in the blackbox gradient estimation, forcing\nthe policy to solutions with lower total assignment costs. We empirically show\non simulated data, generated for a particle detector developed for proton\nimaging, the effectiveness of our approach, compared to multiple single- and\nmulti-agent baselines. We further demonstrate the effectiveness of constraints\nwith cost margins for both optimization and generalization, introduced by wider\nregions with high reconstruction performance as well as reduced predictive\ninstabilities. Our results form the basis for further developments in RL-based\ntracking, offering both enhanced performance with constrained policies and\ngreater flexibility in optimizing tracking algorithms through the option for\nindividual and team rewards.", "paper_summary_zh": "強化學習在建模複雜的物理驅動系統方面展現出巨大的成功，透過與模擬或真實環境互動，提供端到端的可訓練解決方案，最大化標量獎勵訊號。在這項工作中，我們提出建立在先前工作上的多重代理強化學習方法，使用指派約束來重建像素化粒子探測器中的粒子軌跡。我們的做法透過共同最小化讀取框架中重建軌跡上粒子的總散射量，協調最佳化一個參數化策略，作為多維指派問題的啟發法。為了滿足約束，確保粒子命中事件的唯一指派，我們提出一個安全層，為每個聯合動作解決線性指派問題。此外，為了強制執行成本邊際，增加局部策略預測與最佳化對應的決策邊界的距離，我們建議在黑盒梯度估計中使用額外的組成，迫使策略採取總指派成本較低的解決方案。我們在為質子影像開發的粒子探測器產生的模擬資料上，實證顯示我們的方法有效，並與多個單一和多重代理基準進行比較。我們進一步展示了約束在最佳化和概括中的有效性，這些約束透過具有高重建效能的較寬廣區域以及減少預測不穩定性而引入。我們的結果為基於 RL 的追蹤進一步發展奠定基礎，透過受約束策略提供增強的效能，以及透過個人和團隊獎勵的選項，在最佳化追蹤演算法方面提供更大的彈性。", "author": "Tobias Kortus et.al.", "authors": "Tobias Kortus, Ralf Keidel, Nicolas R. Gauger, Jan Kieseler", "id": "2501.05113v1", "paper_url": "http://arxiv.org/abs/2501.05113v1", "repo": "null"}}