{"2405.14203": {"publish_time": "2024-05-23", "title": "GLaD: Synergizing Molecular Graphs and Language Descriptors for Enhanced Power Conversion Efficiency Prediction in Organic Photovoltaic Devices", "paper_summary": "This paper presents a novel approach for predicting Power Conversion\nEfficiency (PCE) of Organic Photovoltaic (OPV) devices, called GLaD:\nsynergizing molecular Graphs and Language Descriptors for enhanced PCE\nprediction. Due to the lack of high-quality experimental data, we collect a\ndataset consisting of 500 pairs of OPV donor and acceptor molecules along with\ntheir corresponding PCE values, which we utilize as the training data for our\npredictive model. In this low-data regime, GLaD leverages properties learned\nfrom large language models (LLMs) pretrained on extensive scientific literature\nto enrich molecular structural representations, allowing for a multimodal\nrepresentation of molecules. GLaD achieves precise predictions of PCE, thereby\nfacilitating the synthesis of new OPV molecules with improved efficiency.\nFurthermore, GLaD showcases versatility, as it applies to a range of molecular\nproperty prediction tasks (BBBP, BACE, ClinTox, and SIDER), not limited to\nthose concerning OPV materials. Especially, GLaD proves valuable for tasks in\nlow-data regimes within the chemical space, as it enriches molecular\nrepresentations by incorporating molecular property descriptions learned from\nlarge-scale pretraining. This capability is significant in real-world\nscientific endeavors like drug and material discovery, where access to\ncomprehensive data is crucial for informed decision-making and efficient\nexploration of the chemical space.", "paper_summary_zh": "這篇論文提出了一個新穎的方法來預測有機光電 (OPV) 裝置的功率轉換效率 (PCE)，稱為 GLaD：結合分子圖形和語言描述符以增強 PCE 預測。由於缺乏高品質的實驗數據，我們收集了一個包含 500 對 OPV 供體和受體分子的數據集，以及對應的 PCE 值，我們將其用作預測模型的訓練數據。在這個低數據模式中，GLaD 利用從大型語言模型 (LLM) 中學習到的特性，這些 LLM 在廣泛的科學文獻上進行預訓練，以豐富分子結構表示，從而允許對分子進行多模態表示。GLaD 對 PCE 進行精確預測，從而促進合成具有更高效率的新型 OPV 分子。此外，GLaD 展示了其多功能性，因為它適用於一系列分子特性預測任務 (BBBP、BACE、ClinTox 和 SIDER)，而不僅限於那些涉及 OPV 材料的任務。特別是，GLaD 證明對於化學空間中的低數據模式任務非常有價值，因為它通過結合從大規模預訓練中學習到的分子特性描述來豐富分子表示。這種能力在像藥物和材料發現這樣的現實世界科學工作中非常重要，在這些工作中，獲得全面數據對於明智的決策制定和化學空間的有效探索至關重要。", "author": "Thao Nguyen et.al.", "authors": "Thao Nguyen, Tiara Torres-Flores, Changhyun Hwang, Carl Edwards, Ying Diao, Heng Ji", "id": "2405.14203v1", "paper_url": "http://arxiv.org/abs/2405.14203v1", "repo": "null"}}