{"2411.05029": {"publish_time": "2024-11-06", "title": "Ultrasound-Based AI for COVID-19 Detection: A Comprehensive Review of Public and Private Lung Ultrasound Datasets and Studies", "paper_summary": "The COVID-19 pandemic has affected millions of people globally, with\nrespiratory organs being strongly affected in individuals with comorbidities.\nMedical imaging-based diagnosis and prognosis have become increasingly popular\nin clinical settings for detecting COVID-19 lung infections. Among various\nmedical imaging modalities, ultrasound stands out as a low-cost, mobile, and\nradiation-safe imaging technology. In this comprehensive review, we focus on\nAI-driven studies utilizing lung ultrasound (LUS) for COVID-19 detection and\nanalysis. We provide a detailed overview of both publicly available and private\nLUS datasets and categorize the AI studies according to the dataset they used.\nAdditionally, we systematically analyzed and tabulated the studies across\nvarious dimensions, including data preprocessing methods, AI models,\ncross-validation techniques, and evaluation metrics. In total, we reviewed 60\narticles, 41 of which utilized public datasets, while the remaining employed\nprivate data. Our findings suggest that ultrasound-based AI studies for\nCOVID-19 detection have great potential for clinical use, especially for\nchildren and pregnant women. Our review also provides a useful summary for\nfuture researchers and clinicians who may be interested in the field.", "paper_summary_zh": "COVID-19 疫情影響全球數百萬人，其中合併症患者的呼吸器官受到嚴重影響。基於醫學影像的診斷和預後在臨床環境中已日益普及，用於偵測 COVID-19 肺部感染。在各種醫學影像模式中，超音波因其低成本、可攜式且無輻射的影像技術而脫穎而出。在這篇全面的評論中，我們專注於利用肺部超音波 (LUS) 進行 COVID-19 偵測和分析的人工智慧驅動研究。我們提供公開和私人 LUS 資料集的詳細概觀，並根據所使用的資料集對人工智慧研究進行分類。此外，我們系統地分析並整理了各種面向的研究，包括資料前處理方法、人工智慧模型、交叉驗證技術和評估指標。總計，我們檢閱了 60 篇文章，其中 41 篇使用公開資料集，而其餘則使用私人資料。我們的研究結果表明，基於超音波的人工智慧研究對於 COVID-19 偵測具有極大的臨床應用潛力，特別是對於兒童和孕婦。我們的評論也為可能對此領域感興趣的未來研究人員和臨床醫生提供了有用的摘要。", "author": "Abrar Morshed et.al.", "authors": "Abrar Morshed, Abdulla Al Shihab, Md Abrar Jahin, Md Jaber Al Nahian, Md Murad Hossain Sarker, Md Sharjis Ibne Wadud, Mohammad Istiaq Uddin, Muntequa Imtiaz Siraji, Nafisa Anjum, Sumiya Rajjab Shristy, Tanvin Rahman, Mahmuda Khatun, Md Rubel Dewan, Mosaddeq Hossain, Razia Sultana, Ripel Chakma, Sonet Barua Emon, Towhidul Islam, Mohammad Arafat Hussain", "id": "2411.05029v1", "paper_url": "http://arxiv.org/abs/2411.05029v1", "repo": "null"}}