{"2407.13982": {"publish_time": "2024-07-19", "title": "Reexamining Racial Disparities in Automatic Speech Recognition Performance: The Role of Confounding by Provenance", "paper_summary": "Automatic speech recognition (ASR) models trained on large amounts of audio\ndata are now widely used to convert speech to written text in a variety of\napplications from video captioning to automated assistants used in healthcare\nand other domains. As such, it is important that ASR models and their use is\nfair and equitable. Prior work examining the performance of commercial ASR\nsystems on the Corpus of Regional African American Language (CORAAL)\ndemonstrated significantly worse ASR performance on African American English\n(AAE). The current study seeks to understand the factors underlying this\ndisparity by examining the performance of the current state-of-the-art neural\nnetwork based ASR system (Whisper, OpenAI) on the CORAAL dataset. Two key\nfindings have been identified as a result of the current study. The first\nconfirms prior findings of significant dialectal variation even across\nneighboring communities, and worse ASR performance on AAE that can be improved\nto some extent with fine-tuning of ASR models. The second is a novel finding\nnot discussed in prior work on CORAAL: differences in audio recording practices\nwithin the dataset have a significant impact on ASR accuracy resulting in a\n``confounding by provenance'' effect in which both language use and recording\nquality differ by study location. These findings highlight the need for further\nsystematic investigation to disentangle the effects of recording quality and\ninherent linguistic diversity when examining the fairness and bias present in\nneural ASR models, as any bias in ASR accuracy may have negative downstream\neffects on disparities in various domains of life in which ASR technology is\nused.", "paper_summary_zh": "<paragraph>訓練大量音訊資料的自動語音辨識 (ASR) 模型現在廣泛用於將語音轉換為書面文字，應用於從影片字幕到醫療保健和其他領域中使用的自動化助理程式。因此，ASR 模型及其使用方式的公平性和公正性非常重要。先前針對商業 ASR 系統在非洲裔美國人語言語料庫 (CORAAL) 上的效能進行研究，結果顯示非洲裔美國英語 (AAE) 的 ASR 效能顯著較差。目前的研究旨在透過檢視基於神經網路的最新 ASR 系統 (Whisper，OpenAI) 在 CORAAL 資料集上的效能，了解造成此差異的因素。目前的研究已找出兩個主要發現。第一個發現證實了先前的發現，即使在鄰近的社群中，方言差異也很顯著，而 AAE 的 ASR 效能較差，但透過微調 ASR 模型，效能可以獲得一定程度的改善。第二個發現是先前針對 CORAAL 的研究中未討論過的新發現：資料集中音訊錄製方式的差異對 ASR 準確度有顯著影響，導致「來源混淆」效應，其中語言使用和錄音品質因研究地點而異。這些發現突顯了進一步進行系統性調查的必要性，以釐清在檢視神經 ASR 模型中的公平性和偏差時，錄音品質和固有的語言多樣性的影響，因為 ASR 準確度的任何偏差都可能對 ASR 技術所使用的各種生活領域的差異產生負面的下游影響。</paragraph>", "author": "Changye Li et.al.", "authors": "Changye Li, Trevor Cohen, Serguei Pakhomov", "id": "2407.13982v1", "paper_url": "http://arxiv.org/abs/2407.13982v1", "repo": "https://github.com/LinguisticAnomalies/confounding-ASR"}}