{"2412.13091": {"publish_time": "2024-12-17", "title": "LMUnit: Fine-grained Evaluation with Natural Language Unit Tests", "paper_summary": "As language models become integral to critical workflows, assessing their\nbehavior remains a fundamental challenge -- human evaluation is costly and\nnoisy, while automated metrics provide only coarse, difficult-to-interpret\nsignals. We introduce natural language unit tests, a paradigm that decomposes\nresponse quality into explicit, testable criteria, along with a unified scoring\nmodel, LMUnit, which combines multi-objective training across preferences,\ndirect ratings, and natural language rationales. Through controlled human\nstudies, we show this paradigm significantly improves inter-annotator agreement\nand enables more effective LLM development workflows. LMUnit achieves\nstate-of-the-art performance on evaluation benchmarks (FLASK, BigGenBench) and\ncompetitive results on RewardBench. These results validate both our proposed\nparadigm and scoring model, suggesting a promising path forward for language\nmodel evaluation and development.", "paper_summary_zh": "隨著語言模型成為關鍵工作流程中不可或缺的一部分，評估其行為仍然是一項基本挑戰——人工評估成本高昂且嘈雜，而自動化指標僅提供粗略、難以解釋的訊號。我們引入了自然語言單元測試，這是一種將回應品質分解為明確、可測試標準的範例，並結合了統一評分模型 LMUnit，它結合了跨偏好、直接評分和自然語言依據的多目標訓練。透過受控的人類研究，我們表明這個範例顯著改善了標記者間的一致性，並實現了更有效的 LLM 開發工作流程。LMUnit 在評估基準（FLASK、BigGenBench）上取得了最先進的效能，並且在 RewardBench 上取得了具有競爭力的結果。這些結果驗證了我們提出的範例和評分模型，為語言模型評估和開發提出了有希望的前進道路。", "author": "Jon Saad-Falcon et.al.", "authors": "Jon Saad-Falcon, Rajan Vivek, William Berrios, Nandita Shankar Naik, Matija Franklin, Bertie Vidgen, Amanpreet Singh, Douwe Kiela, Shikib Mehri", "id": "2412.13091v1", "paper_url": "http://arxiv.org/abs/2412.13091v1", "repo": "null"}}