{"2408.12734": {"publish_time": "2024-08-22", "title": "Towards measuring fairness in speech recognition: Fair-Speech dataset", "paper_summary": "The current public datasets for speech recognition (ASR) tend not to focus\nspecifically on the fairness aspect, such as performance across different\ndemographic groups. This paper introduces a novel dataset, Fair-Speech, a\npublicly released corpus to help researchers evaluate their ASR models for\naccuracy across a diverse set of self-reported demographic information, such as\nage, gender, ethnicity, geographic variation and whether the participants\nconsider themselves native English speakers. Our dataset includes approximately\n26.5K utterances in recorded speech by 593 people in the United States, who\nwere paid to record and submit audios of themselves saying voice commands. We\nalso provide ASR baselines, including on models trained on transcribed and\nuntranscribed social media videos and open source models.", "paper_summary_zh": "目前的語音辨識 (ASR) 公開資料集傾向於不特別關注公平性面向，例如不同人口統計群組的表現。這篇論文介紹了一個新資料集 Fair-Speech，這是一個公開發布的語料庫，協助研究人員評估其 ASR 模型在各種自我報告人口統計資訊（例如年齡、性別、種族、地理差異，以及參與者是否認為自己是英語母語人士）的準確性。我們的資料集包含美國 593 人錄製的語音，約 26.5K 個語句，這些人受雇錄製並提交他們說出語音指令的音訊。我們也提供 ASR 基準，包括在轉錄和未轉錄的社群媒體影片以及開放原始碼模型上訓練的模型。", "author": "Irina-Elena Veliche et.al.", "authors": "Irina-Elena Veliche, Zhuangqun Huang, Vineeth Ayyat Kochaniyan, Fuchun Peng, Ozlem Kalinli, Michael L. Seltzer", "id": "2408.12734v1", "paper_url": "http://arxiv.org/abs/2408.12734v1", "repo": "null"}}