{"2410.03234": {"publish_time": "2024-10-04", "title": "Showing LLM-Generated Code Selectively Based on Confidence of LLMs", "paper_summary": "Large Language Models (LLMs) have shown impressive abilities in code\ngeneration, but they may generate erroneous programs. Reading a program takes\nten times longer than writing it. Showing these erroneous programs to\ndevelopers will waste developers' energies and introduce security risks to\nsoftware.\n  To address the above limitations, we propose HonestCoder, a novel LLM-based\ncode generation approach. HonestCoder selectively shows the generated programs\nto developers based on LLMs' confidence. The confidence provides valuable\ninsights into the correctness of generated programs. To achieve this goal, we\npropose a novel approach to estimate LLMs' confidence in code generation. It\nestimates confidence by measuring the multi-modal similarity between\nLLMs-generated programs.\n  We collect and release a multilingual benchmark named TruthCodeBench, which\nconsists of 2,265 samples and covers two popular programming languages (i.e.,\nPython and Java). We apply HonestCoder to four popular LLMs (e.g.,\nDeepSeek-Coder and Code Llama) and evaluate it on TruthCodeBench. Based on the\nexperiments, we obtain the following insights. (1) HonestCoder can effectively\nestimate LLMs' confidence and accurately determine the correctness of generated\nprograms. For example, HonestCoder outperforms the state-of-the-art baseline by\n27.79% in AUROC and 63.74% in AUCPR. (2) HonestCoder can decrease the number of\nerroneous programs shown to developers. Compared to eight baselines, it can\nshow more correct programs and fewer erroneous programs to developers. (3)\nCompared to showing code indiscriminately, HonestCoder only adds slight time\noverhead (approximately 0.4 seconds per requirement). (4) We discuss future\ndirections to facilitate the application of LLMs in software development. We\nhope this work can motivate broad discussions about measuring the reliability\nof LLMs' outputs in performing code-related tasks.", "paper_summary_zh": "大型語言模型 (LLM) 在程式碼生成方面展現驚人的能力，但它們可能會產生錯誤的程式。閱讀程式碼的時間是撰寫程式碼的十倍。將這些有錯誤的程式碼顯示給開發人員會浪費開發人員的精力，並對軟體引入安全風險。\n為了解決上述限制，我們提出 HonestCoder，一種新的基於 LLM 的程式碼生成方法。HonestCoder 根據 LLM 的信心有選擇地向開發人員顯示生成的程式碼。信心提供對生成程式碼正確性的寶貴見解。為了實現這個目標，我們提出了一種新的方法來估計 LLM 在程式碼生成中的信心。它透過測量 LLM 生成的程式碼之間的多模式相似性來估計信心。\n我們收集並發布了一個名為 TruthCodeBench 的多語言基準，其中包含 2,265 個範例，涵蓋兩種流行的程式語言（即 Python 和 Java）。我們將 HonestCoder 應用於四個流行的 LLM（例如 DeepSeek-Coder 和 Code Llama），並在 TruthCodeBench 上對其進行評估。根據實驗，我們獲得以下見解。（1）HonestCoder 可以有效估計 LLM 的信心，並準確確定生成程式碼的正確性。例如，HonestCoder 在 AUROC 中比最先進的基準高出 27.79%，在 AUCPR 中高出 63.74%。（2）HonestCoder 可以減少顯示給開發人員的錯誤程式碼數量。與八個基準相比，它可以向開發人員顯示更多正確的程式碼和更少的錯誤程式碼。（3）與不加選擇地顯示程式碼相比，HonestCoder 只會增加輕微的時間開銷（每個需求大約 0.4 秒）。（4）我們討論了促進 LLM 在軟體開發中應用的未來方向。我們希望這項工作可以激勵廣泛討論，以衡量 LLM 在執行與程式碼相關任務時的輸出可靠性。", "author": "Jia Li et.al.", "authors": "Jia Li, Yuqi Zhu, Yongmin Li, Ge Li, Zhi Jin", "id": "2410.03234v1", "paper_url": "http://arxiv.org/abs/2410.03234v1", "repo": "null"}}