{"2502.13920": {"publish_time": "2025-02-19", "title": "Exploring Personalized Health Support through Data-Driven, Theory-Guided LLMs: A Case Study in Sleep Health", "paper_summary": "Despite the prevalence of sleep-tracking devices, many individuals struggle\nto translate data into actionable improvements in sleep health. Current methods\noften provide data-driven suggestions but may not be feasible and adaptive to\nreal-life constraints and individual contexts. We present HealthGuru, a novel\nlarge language model-powered chatbot to enhance sleep health through\ndata-driven, theory-guided, and adaptive recommendations with conversational\nbehavior change support. HealthGuru's multi-agent framework integrates wearable\ndevice data, contextual information, and a contextual multi-armed bandit model\nto suggest tailored sleep-enhancing activities. The system facilitates natural\nconversations while incorporating data-driven insights and theoretical behavior\nchange techniques. Our eight-week in-the-wild deployment study with 16\nparticipants compared HealthGuru to a baseline chatbot. Results show improved\nmetrics like sleep duration and activity scores, higher quality responses, and\nincreased user motivation for behavior change with HealthGuru. We also identify\nchallenges and design considerations for personalization and user engagement in\nhealth chatbots.", "paper_summary_zh": "儘管有許多睡眠追蹤裝置盛行，但許多人仍難以將資料轉化為改善睡眠健康的實際行動。目前的許多方法提供以資料為基礎的建議，但可能無法在現實生活的限制與個人背景中發揮作用且無法適應。我們提出 HealthGuru，這是一個由大型語言模型驅動的新型聊天機器人，透過以資料為基礎、理論為導向且具適應性的建議，搭配對話式行為改變支援，來改善睡眠健康。HealthGuru 的多重代理架構整合了穿戴式裝置資料、情境資訊，以及情境式多重選擇性賭博機模型，以建議量身打造的助眠活動。此系統促進自然對話，同時納入以資料為基礎的見解和理論行為改變技巧。我們進行為期八週的野外部署研究，有 16 位參與者比較了 HealthGuru 和一個基準聊天機器人。結果顯示 HealthGuru 改善了睡眠時數和活動分數等指標，並獲得較高品質的回應，以及增加使用者改變行為的動機。我們也找出個人化和使用者參與在健康聊天機器人中的挑戰和設計考量。", "author": "Xingbo Wang et.al.", "authors": "Xingbo Wang, Janessa Griffith, Daniel A. Adler, Joey Castillo, Tanzeem Choudhury, Fei Wang", "id": "2502.13920v1", "paper_url": "http://arxiv.org/abs/2502.13920v1", "repo": "null"}}