{"2407.02977": {"publish_time": "2024-07-03", "title": "Large Language Models as Evaluators for Scientific Synthesis", "paper_summary": "Our study explores how well the state-of-the-art Large Language Models\n(LLMs), like GPT-4 and Mistral, can assess the quality of scientific summaries\nor, more fittingly, scientific syntheses, comparing their evaluations to those\nof human annotators. We used a dataset of 100 research questions and their\nsyntheses made by GPT-4 from abstracts of five related papers, checked against\nhuman quality ratings. The study evaluates both the closed-source GPT-4 and the\nopen-source Mistral model's ability to rate these summaries and provide reasons\nfor their judgments. Preliminary results show that LLMs can offer logical\nexplanations that somewhat match the quality ratings, yet a deeper statistical\nanalysis shows a weak correlation between LLM and human ratings, suggesting the\npotential and current limitations of LLMs in scientific synthesis evaluation.", "paper_summary_zh": "我們的研究探討了最先進的大語言模型 (LLM)，例如 GPT-4 和 Mistral，如何評估科學摘要或更貼切地說，科學綜合的品質，並將其評估結果與人類註解者的評估結果進行比較。我們使用了一個資料集，其中包含 100 個研究問題和 GPT-4 從五篇相關論文摘要中得出的綜合，並與人類品質評分進行比對。這項研究評估了閉源的 GPT-4 和開源的 Mistral 模型評分這些摘要並提供其判斷理由的能力。初步結果顯示，LLM 能夠提供與品質評分大致相符的邏輯解釋，但更深入的統計分析顯示 LLM 和人類評分之間的關聯性很弱，這表明 LLM 在科學綜合評估中的潛力與當前限制。", "author": "Julia Evans et.al.", "authors": "Julia Evans, Jennifer D'Souza, Sören Auer", "id": "2407.02977v1", "paper_url": "http://arxiv.org/abs/2407.02977v1", "repo": "null"}}