{"2412.04469": {"publish_time": "2024-12-05", "title": "QUEEN: QUantized Efficient ENcoding of Dynamic Gaussians for Streaming Free-viewpoint Videos", "paper_summary": "Online free-viewpoint video (FVV) streaming is a challenging problem, which\nis relatively under-explored. It requires incremental on-the-fly updates to a\nvolumetric representation, fast training and rendering to satisfy real-time\nconstraints and a small memory footprint for efficient transmission. If\nachieved, it can enhance user experience by enabling novel applications, e.g.,\n3D video conferencing and live volumetric video broadcast, among others. In\nthis work, we propose a novel framework for QUantized and Efficient ENcoding\n(QUEEN) for streaming FVV using 3D Gaussian Splatting (3D-GS). QUEEN directly\nlearns Gaussian attribute residuals between consecutive frames at each\ntime-step without imposing any structural constraints on them, allowing for\nhigh quality reconstruction and generalizability. To efficiently store the\nresiduals, we further propose a quantization-sparsity framework, which contains\na learned latent-decoder for effectively quantizing attribute residuals other\nthan Gaussian positions and a learned gating module to sparsify position\nresiduals. We propose to use the Gaussian viewspace gradient difference vector\nas a signal to separate the static and dynamic content of the scene. It acts as\na guide for effective sparsity learning and speeds up training. On diverse FVV\nbenchmarks, QUEEN outperforms the state-of-the-art online FVV methods on all\nmetrics. Notably, for several highly dynamic scenes, it reduces the model size\nto just 0.7 MB per frame while training in under 5 sec and rendering at 350\nFPS. Project website is at https://research.nvidia.com/labs/amri/projects/queen", "paper_summary_zh": "<paragraph>線上自由視角影片 (FVV) 串流是個具有挑戰性的問題，且相對來說較少被探討。它需要對體積表示進行增量即時更新、快速訓練和渲染以滿足即時限制，以及一個小型記憶體佔用空間以利於有效傳輸。如果達成，它可以透過啟用新穎應用程式（例如 3D 視訊會議和現場體積影片廣播等）來提升使用者體驗。在這項工作中，我們提出一個新穎的框架，稱為量化與有效編碼 (QUEEN)，以使用 3D 高斯潑濺 (3D-GS) 串流 FVV。QUEEN 直接學習每個時間步長中連續幀之間的高斯屬性殘差，而不會對它們施加任何結構限制，從而實現高品質重建和泛化性。為了有效儲存殘差，我們進一步提出一個量化稀疏性框架，其中包含一個學習的潛在解碼器，用於有效量化高斯位置以外的屬性殘差，以及一個學習的閘控模組，用於稀疏化位置殘差。我們建議使用高斯視角空間梯度差向量作為一個訊號，以分離場景中的靜態和動態內容。它作為一個有效稀疏性學習指南，並加快訓練速度。在不同的 FVV 基準上，QUEEN 在所有指標上都優於最先進的線上 FVV 方法。值得注意的是，對於幾個高度動態的場景，它將模型大小減小到每幀僅 0.7 MB，同時在不到 5 秒的時間內完成訓練，並以 350 FPS 進行渲染。專案網站位於 https://research.nvidia.com/labs/amri/projects/queen</paragraph>", "author": "Sharath Girish et.al.", "authors": "Sharath Girish, Tianye Li, Amrita Mazumdar, Abhinav Shrivastava, David Luebke, Shalini De Mello", "id": "2412.04469v1", "paper_url": "http://arxiv.org/abs/2412.04469v1", "repo": "null"}}