{"2411.08409": {"publish_time": "2024-11-13", "title": "DiVR: incorporating context from diverse VR scenes for human trajectory prediction", "paper_summary": "Virtual environments provide a rich and controlled setting for collecting\ndetailed data on human behavior, offering unique opportunities for predicting\nhuman trajectories in dynamic scenes. However, most existing approaches have\noverlooked the potential of these environments, focusing instead on static\ncontexts without considering userspecific factors. Employing the CREATTIVE3D\ndataset, our work models trajectories recorded in virtual reality (VR) scenes\nfor diverse situations including road-crossing tasks with user interactions and\nsimulated visual impairments. We propose Diverse Context VR Human Motion\nPrediction (DiVR), a cross-modal transformer based on the Perceiver\narchitecture that integrates both static and dynamic scene context using a\nheterogeneous graph convolution network. We conduct extensive experiments\ncomparing DiVR against existing architectures including MLP, LSTM, and\ntransformers with gaze and point cloud context. Additionally, we also stress\ntest our model's generalizability across different users, tasks, and scenes.\nResults show that DiVR achieves higher accuracy and adaptability compared to\nother models and to static graphs. This work highlights the advantages of using\nVR datasets for context-aware human trajectory modeling, with potential\napplications in enhancing user experiences in the metaverse. Our source code is\npublicly available at https://gitlab.inria.fr/ffrancog/creattive3d-divr-model.", "paper_summary_zh": "虛擬環境提供了一個豐富且受控的設定，用於收集人類行為的詳細資料，為預測動態場景中的人類軌跡提供獨特的機會。然而，現有的方法大多忽略了這些環境的潛力，而是專注於靜態情境，而不考慮使用者特定的因素。透過使用 CREATTIVE3D 資料集，我們的模型會針對虛擬實境 (VR) 場景中記錄的軌跡進行建模，適用於各種情況，包括與使用者互動的道路穿越任務和模擬視覺障礙。我們提出多元情境 VR 人類動作預測 (DiVR)，這是一種基於感知器架構的跨模態轉換器，使用異質圖形捲積網路整合靜態和動態場景情境。我們進行了廣泛的實驗，將 DiVR 與現有的架構進行比較，包括 MLP、LSTM 和具有視線和點雲情境的轉換器。此外，我們還強調測試了我們的模型在不同使用者、任務和場景中的泛化性。結果顯示，與其他模型和靜態圖形相比，DiVR 達到了更高的準確度和適應性。這項工作突顯了使用 VR 資料集進行情境感知人類軌跡建模的優點，在增強元宇宙中的使用者體驗方面具有潛在應用。我們的原始程式碼可在 https://gitlab.inria.fr/ffrancog/creattive3d-divr-model 公開取得。", "author": "Franz Franco Gallo et.al.", "authors": "Franz Franco Gallo, Hui-Yin Wu, Lucile Sassatelli", "id": "2411.08409v1", "paper_url": "http://arxiv.org/abs/2411.08409v1", "repo": "null"}}