{"2408.08781": {"publish_time": "2024-08-16", "title": "Evaluating the Evaluator: Measuring LLMs' Adherence to Task Evaluation Instructions", "paper_summary": "LLMs-as-a-judge is a recently popularized method which replaces human\njudgements in task evaluation (Zheng et al. 2024) with automatic evaluation\nusing LLMs. Due to widespread use of RLHF (Reinforcement Learning from Human\nFeedback), state-of-the-art LLMs like GPT4 and Llama3 are expected to have\nstrong alignment with human preferences when prompted for a quality judgement,\nsuch as the coherence of a text. While this seems beneficial, it is not clear\nwhether the assessments by an LLM-as-a-judge constitute only an evaluation\nbased on the instructions in the prompts, or reflect its preference for\nhigh-quality data similar to its fine-tune data. To investigate how much\ninfluence prompting the LLMs-as-a-judge has on the alignment of AI judgements\nto human judgements, we analyze prompts with increasing levels of instructions\nabout the target quality of an evaluation, for several LLMs-as-a-judge.\nFurther, we compare to a prompt-free method using model perplexity as a quality\nmeasure instead. We aggregate a taxonomy of quality criteria commonly used\nacross state-of-the-art evaluations with LLMs and provide this as a rigorous\nbenchmark of models as judges. Overall, we show that the LLMs-as-a-judge\nbenefit only little from highly detailed instructions in prompts and that\nperplexity can sometimes align better with human judgements than prompting,\nespecially on textual quality.", "paper_summary_zh": "LLM 即法官是一種最近很流行的方法，它用 LLM 自動評估取代了任務評估中的人類判斷（鄭等人，2024 年）。由於廣泛使用 RLHF（人類回饋強化學習），當提示進行品質判斷時，例如文本的連貫性，預期像 GPT4 和 Llama3 等最先進的 LLM 與人類偏好有很強的一致性。雖然這看起來有益，但尚不清楚 LLM 即法官的評估是否僅構成基於提示中說明的評估，還是反映了它對類似於其微調資料的高品質資料的偏好。為了調查提示 LLM 即法官對 AI 判斷與人類判斷的一致性有多大影響，我們分析了針對多個 LLM 即法官，包含越來越高層級的評估目標品質說明的提示。此外，我們將其與一種無提示方法進行比較，該方法使用模型困惑度作為品質衡量標準。我們彙總了一個分類法，其中包含 LLM 最先進評估中常用的品質標準，並將其作為模型作為法官的嚴格基準。總的來說，我們表明 LLM 即法官僅從提示中非常詳細的說明中受益很少，並且困惑度有時可以比提示更好地與人類判斷保持一致，特別是在文字品質方面。", "author": "Bhuvanashree Murugadoss et.al.", "authors": "Bhuvanashree Murugadoss, Christian Poelitz, Ian Drosos, Vu Le, Nick McKenna, Carina Suzana Negreanu, Chris Parnin, Advait Sarkar", "id": "2408.08781v1", "paper_url": "http://arxiv.org/abs/2408.08781v1", "repo": "null"}}