{"2408.03617": {"publish_time": "2024-08-07", "title": "Is Child-Directed Speech Effective Training Data for Language Models?", "paper_summary": "While high-performing language models are typically trained on hundreds of\nbillions of words, human children become fluent language users with a much\nsmaller amount of data. What are the features of the data they receive, and how\ndo these features support language modeling objectives? To investigate this\nquestion, we train GPT-2 models on 29M words of English-language child-directed\nspeech and a new matched, synthetic dataset (TinyDialogues), comparing to a\nheterogeneous blend of datasets from the BabyLM challenge. We evaluate both the\nsyntactic and semantic knowledge of these models using developmentally-inspired\nevaluations. Through pretraining experiments, we test whether the global\ndevelopmental ordering or the local discourse ordering of children's training\ndata support high performance relative to other datasets. The local properties\nof the data affect model results, but somewhat surprisingly, global properties\ndo not. Further, child language input is not uniquely valuable for training\nlanguage models. These findings support the hypothesis that, rather than\nproceeding from better data, children's learning is instead substantially more\nefficient than current language modeling techniques.", "paper_summary_zh": "儘管高性能語言模型通常會在數百億個單字上進行訓練，但人類孩童只需使用更少量的資料，就能成為流利的語言使用者。他們接收的資料有哪些特徵，這些特徵如何支援語言建模目標？為了探討這個問題，我們在 2900 萬個單字的英語兒童導向語言和一個新的匹配式合成資料集 (TinyDialogues) 上訓練 GPT-2 模型，並與 BabyLM 挑戰中各種異質資料集進行比較。我們使用發展靈感評估來評估這些模型的句法和語義知識。透過預訓練實驗，我們測試兒童訓練資料的整體發展順序或局部語篇順序是否相對於其他資料集支援高性能。資料的局部屬性會影響模型結果，但令人驚訝的是，整體屬性並不會。此外，兒童語言輸入並非訓練語言模型的唯一有價值資料。這些發現支持以下假設：兒童的學習並非來自更好的資料，而是比目前的語言建模技術有效率許多。", "author": "Steven Y. Feng et.al.", "authors": "Steven Y. Feng, Noah D. Goodman, Michael C. Frank", "id": "2408.03617v1", "paper_url": "http://arxiv.org/abs/2408.03617v1", "repo": "null"}}