{"2410.21637": {"publish_time": "2024-10-29", "title": "Are Paraphrases Generated by Large Language Models Invertible?", "paper_summary": "Large language models can produce highly fluent paraphrases while retaining\nmuch of the original meaning. While this capability has a variety of helpful\napplications, it may also be abused by bad actors, for example to plagiarize\ncontent or to conceal their identity. This motivates us to consider the problem\nof paraphrase inversion: given a paraphrased document, attempt to recover the\noriginal text. To explore the feasibility of this task, we fine-tune paraphrase\ninversion models, both with and without additional author-specific context to\nhelp guide the inversion process. We explore two approaches to author-specific\ninversion: one using in-context examples of the target author's writing, and\nanother using learned style representations that capture distinctive features\nof the author's style. We show that, when starting from paraphrased\nmachine-generated text, we can recover significant portions of the document\nusing a learned inversion model. When starting from human-written text, the\nvariety of source writing styles poses a greater challenge for invertability.\nHowever, even when the original tokens can't be recovered, we find the inverted\ntext is stylistically similar to the original, which significantly improves the\nperformance of plagiarism detectors and authorship identification systems that\nrely on stylistic markers.", "paper_summary_zh": "大型語言模型可以產生高度流利的同義改寫，同時保留大部分原始含義。雖然此功能有各種有用的應用，但它也可能被不良行為者濫用，例如抄襲內容或隱藏其身分。這促使我們考慮同義改寫反演的問題：給定一篇同義改寫的文件，嘗試恢復原始文字。為了探索此任務的可行性，我們微調同義改寫反演模型，無論是否包含額外的作者特定脈絡以協助引導反演程序。我們探索兩種作者特定反演方法：一種使用目標作者寫作的脈絡範例，另一種使用學習到的風格表示，捕捉作者風格的獨特特徵。我們表明，當從同義改寫的機器產生的文字開始時，我們可以使用學習到的反演模型恢復文件的顯著部分。當從人工撰寫的文字開始時，各種來源寫作風格對可逆性構成更大的挑戰。然而，即使無法恢復原始詞彙，我們發現反演文字在風格上與原始文字類似，這顯著改善了依賴風格標記的抄襲偵測器和作者身分識別系統的效能。", "author": "Rafael Rivera Soto et.al.", "authors": "Rafael Rivera Soto, Barry Chen, Nicholas Andrews", "id": "2410.21637v1", "paper_url": "http://arxiv.org/abs/2410.21637v1", "repo": "null"}}