{"2411.01996": {"publish_time": "2024-11-04", "title": "Culinary Class Wars: Evaluating LLMs using ASH in Cuisine Transfer Task", "paper_summary": "The advent of Large Language Models (LLMs) have shown promise in various\ncreative domains, including culinary arts. However, many LLMs still struggle to\ndeliver the desired level of culinary creativity, especially when tasked with\nadapting recipes to meet specific cultural requirements. This study focuses on\ncuisine transfer-applying elements of one cuisine to another-to assess LLMs'\nculinary creativity. We employ a diverse set of LLMs to generate and evaluate\nculturally adapted recipes, comparing their evaluations against LLM and human\njudgments. We introduce the ASH (authenticity, sensitivity, harmony) benchmark\nto evaluate LLMs' recipe generation abilities in the cuisine transfer task,\nassessing their cultural accuracy and creativity in the culinary domain. Our\nfindings reveal crucial insights into both generative and evaluative\ncapabilities of LLMs in the culinary domain, highlighting strengths and\nlimitations in understanding and applying cultural nuances in recipe creation.\nThe code and dataset used in this project will be openly available in\n\\url{http://github.com/dmis-lab/CulinaryASH}.", "paper_summary_zh": "大型語言模型 (LLM) 的出現已在各種創意領域中展現出前景，包括料理藝術。然而，許多 LLM 仍難以提供所需的料理創意水準，特別是在需要調整食譜以符合特定文化需求時。本研究專注於料理轉移，將一種料理的元素應用到另一種料理中，以評估 LLM 的料理創意。我們採用多元的 LLM 來產生並評估經過文化調整的食譜，並將其評估與 LLM 和人類的判斷進行比較。我們導入 ASH（真實性、敏感性、和諧性）基準來評估 LLM 在料理轉移任務中的食譜產生能力，評估其在料理領域中的文化準確性和創意性。我們的研究結果揭露了 LLM 在料理領域中產生和評估能力的重要見解，突顯了在食譜創作中理解和應用文化細微差的優點和限制。本專案中使用的程式碼和資料集將在 \\url{http://github.com/dmis-lab/CulinaryASH} 中開放取得。", "author": "Hoonick Lee et.al.", "authors": "Hoonick Lee, Mogan Gim, Donghyeon Park, Donghee Choi, Jaewoo Kang", "id": "2411.01996v1", "paper_url": "http://arxiv.org/abs/2411.01996v1", "repo": "null"}}