{"2407.04451": {"publish_time": "2024-07-05", "title": "Hindsight Preference Learning for Offline Preference-based Reinforcement Learning", "paper_summary": "Offline preference-based reinforcement learning (RL), which focuses on\noptimizing policies using human preferences between pairs of trajectory\nsegments selected from an offline dataset, has emerged as a practical avenue\nfor RL applications. Existing works rely on extracting step-wise reward signals\nfrom trajectory-wise preference annotations, assuming that preferences\ncorrelate with the cumulative Markovian rewards. However, such methods fail to\ncapture the holistic perspective of data annotation: Humans often assess the\ndesirability of a sequence of actions by considering the overall outcome rather\nthan the immediate rewards. To address this challenge, we propose to model\nhuman preferences using rewards conditioned on future outcomes of the\ntrajectory segments, i.e. the hindsight information. For downstream RL\noptimization, the reward of each step is calculated by marginalizing over\npossible future outcomes, the distribution of which is approximated by a\nvariational auto-encoder trained using the offline dataset. Our proposed\nmethod, Hindsight Preference Learning (HPL), can facilitate credit assignment\nby taking full advantage of vast trajectory data available in massive unlabeled\ndatasets. Comprehensive empirical studies demonstrate the benefits of HPL in\ndelivering robust and advantageous rewards across various domains. Our code is\npublicly released at https://github.com/typoverflow/WiseRL.", "paper_summary_zh": "離線基於偏好的強化學習 (RL)，專注於使用人類偏好來最佳化策略，這些偏好來自離線資料集中選擇的軌跡區段對之間，已成為 RL 應用的一條實用途徑。現有工作依賴於從軌跡偏好註解中提取逐步獎勵訊號，假設偏好與累積馬可夫獎勵相關。然而，這些方法未能捕捉到資料註解的整體觀點：人類通常透過考量整體結果而非立即獎勵，來評估一系列動作的可取性。為了應對這個挑戰，我們提議使用受軌跡區段未來結果制約的獎勵，亦即後見之明資訊，來建模人類偏好。對於下游 RL 最佳化，每個步驟的獎勵是透過對可能的未來結果進行邊際化來計算，其分佈由使用離線資料集訓練的變異自動編碼器來近似。我們提出的方法，後見之明偏好學習 (HPL)，可以透過充分利用大量未標記資料集中可用的龐大軌跡資料，來促進信用分配。全面的實證研究證明了 HPL 在提供各種領域的穩健且有利獎勵方面的優點。我們的程式碼已公開發布在 https://github.com/typoverflow/WiseRL。", "author": "Chen-Xiao Gao et.al.", "authors": "Chen-Xiao Gao, Shengjun Fang, Chenjun Xiao, Yang Yu, Zongzhang Zhang", "id": "2407.04451v1", "paper_url": "http://arxiv.org/abs/2407.04451v1", "repo": "https://github.com/typoverflow/wiserl"}}