{"2410.22135": {"publish_time": "2024-10-29", "title": "Lightweight Frequency Masker for Cross-Domain Few-Shot Semantic Segmentation", "paper_summary": "Cross-domain few-shot segmentation (CD-FSS) is proposed to first pre-train\nthe model on a large-scale source-domain dataset, and then transfer the model\nto data-scarce target-domain datasets for pixel-level segmentation. The\nsignificant domain gap between the source and target datasets leads to a sharp\ndecline in the performance of existing few-shot segmentation (FSS) methods in\ncross-domain scenarios. In this work, we discover an intriguing phenomenon:\nsimply filtering different frequency components for target domains can lead to\na significant performance improvement, sometimes even as high as 14% mIoU.\nThen, we delve into this phenomenon for an interpretation, and find such\nimprovements stem from the reduced inter-channel correlation in feature maps,\nwhich benefits CD-FSS with enhanced robustness against domain gaps and larger\nactivated regions for segmentation. Based on this, we propose a lightweight\nfrequency masker, which further reduces channel correlations by an\namplitude-phase-masker (APM) module and an Adaptive Channel Phase Attention\n(ACPA) module. Notably, APM introduces only 0.01% additional parameters but\nimproves the average performance by over 10%, and ACPA imports only 2.5%\nparameters but further improves the performance by over 1.5%, which\nsignificantly surpasses the state-of-the-art CD-FSS methods.", "paper_summary_zh": "跨域小样本分割（CD-FSS）提出首先在大型源域数据集上预训练模型，然后将模型转移到数据稀缺的目标域数据集进行像素级分割。源数据集和目标数据集之间的显著域差异导致现有小样本分割（FSS）方法在跨域场景中的性能急剧下降。在这项工作中，我们发现了一个有趣的现象：仅仅过滤目标域的不同频率分量就可以带来显著的性能提升，有时甚至高达 14% mIoU。然后，我们深入研究了这种现象以进行解释，并发现这种改进源于特征图中减少的通道间相关性，这使 CD-FSS 具有增强的抗域差异鲁棒性和更大的分割激活区域。基于此，我们提出了一种轻量级频率掩码器，它通过幅度相位掩码器（APM）模块和自适应通道相位注意力（ACPA）模块进一步降低了通道相关性。值得注意的是，APM 仅引入了 0.01% 的附加参数，但平均性能提高了 10% 以上，而 ACPA 仅引入了 2.5% 的参数，但进一步提高了 1.5% 以上的性能，这明显超过了最先进的 CD-FSS 方法。", "author": "Jintao Tong et.al.", "authors": "Jintao Tong, Yixiong Zou, Yuhua Li, Ruixuan Li", "id": "2410.22135v1", "paper_url": "http://arxiv.org/abs/2410.22135v1", "repo": "null"}}