{"2411.09055": {"publish_time": "2024-11-13", "title": "SAFELOC: Overcoming Data Poisoning Attacks in Heterogeneous Federated Machine Learning for Indoor Localization", "paper_summary": "Machine learning (ML) based indoor localization solutions are critical for\nmany emerging applications, yet their efficacy is often compromised by\nhardware/software variations across mobile devices (i.e., device heterogeneity)\nand the threat of ML data poisoning attacks. Conventional methods aimed at\ncountering these challenges show limited resilience to the uncertainties\ncreated by these phenomena. In response, in this paper, we introduce SAFELOC, a\nnovel framework that not only minimizes localization errors under these\nchallenging conditions but also ensures model compactness for efficient mobile\ndevice deployment. Our framework targets a distributed and co-operative\nlearning environment that uses federated learning (FL) to preserve user data\nprivacy and assumes heterogeneous mobile devices carried by users (just like in\nmost real-world scenarios). Within this heterogeneous FL context, SAFELOC\nintroduces a novel fused neural network architecture that performs data\npoisoning detection and localization, with a low model footprint. Additionally,\na dynamic saliency map-based aggregation strategy is designed to adapt based on\nthe severity of the detected data poisoning scenario. Experimental evaluations\ndemonstrate that SAFELOC achieves improvements of up to 5.9x in mean\nlocalization error, 7.8x in worst-case localization error, and a 2.1x reduction\nin model inference latency compared to state-of-the-art indoor localization\nframeworks, across diverse building floorplans, mobile devices, and ML data\npoisoning attack scenarios.", "paper_summary_zh": "基於機器學習 (ML) 的室內定位解決方案對於許多新興應用至關重要，但其效能常常受到行動裝置間的硬體/軟體差異（即裝置異質性）和 ML 資料中毒攻擊的威脅而受損。針對這些挑戰的傳統方法顯示出對這些現象所造成的變數具有有限的韌性。為了解決這個問題，我們在本文中介紹 SAFELOC，這是一個新穎的架構，它不僅在這些具有挑戰性的條件下將定位誤差降至最低，而且還確保模型緊湊性以進行有效的行動裝置部署。我們的架構目標是一個分散且合作的學習環境，它使用聯合學習 (FL) 來保護使用者資料隱私，並假設使用者攜帶異質行動裝置（就像在大多數真實世界場景中一樣）。在這個異質的 FL 背景下，SAFELOC 引入了一種新穎的融合神經網路架構，它執行資料中毒偵測和定位，並具有低模型佔用空間。此外，動態顯著性圖聚合策略旨在根據偵測到的資料中毒情境的嚴重性進行調整。實驗評估證明，與最先進的室內定位架構相比，SAFELOC 在平均定位誤差方面提高了 5.9 倍，在最差情況定位誤差方面提高了 7.8 倍，並且模型推論延遲減少了 2.1 倍，涵蓋了不同的建築平面圖、行動裝置和 ML 資料中毒攻擊情境。", "author": "Akhil Singampalli et.al.", "authors": "Akhil Singampalli, Danish Gufran, Sudeep Pasricha", "id": "2411.09055v1", "paper_url": "http://arxiv.org/abs/2411.09055v1", "repo": "null"}}