{"2408.07527": {"publish_time": "2024-08-14", "title": "Evidential Graph Contrastive Alignment for Source-Free Blending-Target Domain Adaptation", "paper_summary": "In this paper, we firstly tackle a more realistic Domain Adaptation (DA)\nsetting: Source-Free Blending-Target Domain Adaptation (SF-BTDA), where we can\nnot access to source domain data while facing mixed multiple target domains\nwithout any domain labels in prior. Compared to existing DA scenarios, SF-BTDA\ngenerally faces the co-existence of different label shifts in different\ntargets, along with noisy target pseudo labels generated from the source model.\nIn this paper, we propose a new method called Evidential Contrastive Alignment\n(ECA) to decouple the blending target domain and alleviate the effect from\nnoisy target pseudo labels. First, to improve the quality of pseudo target\nlabels, we propose a calibrated evidential learning module to iteratively\nimprove both the accuracy and certainty of the resulting model and adaptively\ngenerate high-quality pseudo target labels. Second, we design a graph\ncontrastive learning with the domain distance matrix and confidence-uncertainty\ncriterion, to minimize the distribution gap of samples of a same class in the\nblended target domains, which alleviates the co-existence of different label\nshifts in blended targets. We conduct a new benchmark based on three standard\nDA datasets and ECA outperforms other methods with considerable gains and\nachieves comparable results compared with those that have domain labels or\nsource data in prior.", "paper_summary_zh": "在本文中，我们首先解决一个更贴近现实的领域自适应 (DA) 设置：无源混合目标领域自适应 (SF-BTDA)，其中我们无法访问源领域数据，同时面临混合多个目标领域，且事先没有任何领域标签。与现有的 DA 场景相比，SF-BTDA 通常面临不同目标中标签偏移并存的问题，以及从源模型生成的噪声目标伪标签。在本文中，我们提出了一种称为证据对比对齐 (ECA) 的新方法，以解耦混合目标域并减轻噪声目标伪标签的影响。首先，为了提高伪目标标签的质量，我们提出了一种校准的证据学习模块，以迭代方式提高所得模型的准确性和确定性，并自适应地生成高质量的伪目标标签。其次，我们设计了一个具有域距离矩阵和置信度不确定性准则的图对比学习，以最小化混合目标域中同一类样本的分布差距，从而减轻混合目标中不同标签偏移的并存。我们基于三个标准 DA 数据集进行了新的基准测试，ECA 以相当大的增益优于其他方法，并且与事先具有领域标签或源数据的方法相比取得了相当的结果。", "author": "Juepeng Zheng et.al.", "authors": "Juepeng Zheng, Yibin Wen, Jinxiao Zhang, Runmin Dong, Haohuan Fu", "id": "2408.07527v1", "paper_url": "http://arxiv.org/abs/2408.07527v1", "repo": "null"}}