{"2406.04106": {"publish_time": "2024-06-06", "title": "Explainability and Hate Speech: Structured Explanations Make Social Media Moderators Faster", "paper_summary": "Content moderators play a key role in keeping the conversation on social\nmedia healthy. While the high volume of content they need to judge represents a\nbottleneck to the moderation pipeline, no studies have explored how models\ncould support them to make faster decisions. There is, by now, a vast body of\nresearch into detecting hate speech, sometimes explicitly motivated by a desire\nto help improve content moderation, but published research using real content\nmoderators is scarce. In this work we investigate the effect of explanations on\nthe speed of real-world moderators. Our experiments show that while generic\nexplanations do not affect their speed and are often ignored, structured\nexplanations lower moderators' decision making time by 7.4%.", "paper_summary_zh": "內容審核員在維持社群媒體對話的健康方面扮演著關鍵角色。儘管他們需要判斷的內容數量龐大，對審核流程來說是一大瓶頸，但沒有任何研究探討模型如何協助他們做出更快速的決定。到目前為止，針對仇恨言論偵測的研究已相當廣泛，有時明確地受到改善內容審核的願望所驅動，但使用真實內容審核員的已發表研究卻相當稀少。在這項工作中，我們探討解釋對真實世界審核員速度的影響。我們的實驗顯示，儘管一般性的解釋不會影響他們的速度，且經常被忽略，但結構化的解釋可以將審核員的決策時間縮短 7.4%。", "author": "Agostina Calabrese et.al.", "authors": "Agostina Calabrese, Leonardo Neves, Neil Shah, Maarten W. Bos, Björn Ross, Mirella Lapata, Francesco Barbieri", "id": "2406.04106v1", "paper_url": "http://arxiv.org/abs/2406.04106v1", "repo": "null"}}