{"2411.17598": {"publish_time": "2024-11-26", "title": "Agentic AI for Improving Precision in Identifying Contributions to Sustainable Development Goals", "paper_summary": "As research institutions increasingly commit to supporting the United\nNations' Sustainable Development Goals (SDGs), there is a pressing need to\naccurately assess their research output against these goals. Current\napproaches, primarily reliant on keyword-based Boolean search queries, conflate\nincidental keyword matches with genuine contributions, reducing retrieval\nprecision and complicating benchmarking efforts. This study investigates the\napplication of autoregressive Large Language Models (LLMs) as evaluation agents\nto identify relevant scholarly contributions to SDG targets in scholarly\npublications. Using a dataset of academic abstracts retrieved via SDG-specific\nkeyword queries, we demonstrate that small, locally-hosted LLMs can\ndifferentiate semantically relevant contributions to SDG targets from documents\nretrieved due to incidental keyword matches, addressing the limitations of\ntraditional methods. By leveraging the contextual understanding of LLMs, this\napproach provides a scalable framework for improving SDG-related research\nmetrics and informing institutional reporting.", "paper_summary_zh": "隨著研究機構日益致力於支持聯合國永續發展目標 (SDG)，準確評估其研究成果是否符合這些目標的需求日益迫切。目前的做法主要依賴於基於關鍵字的布林搜尋查詢，將偶然的關鍵字比對與真實的貢獻混為一談，降低了檢索精準度，並使基準測試工作複雜化。本研究探討了將自迴歸大型語言模型 (LLM) 作為評估代理，用於識別學術刊物中與 SDG 目標相關的學術貢獻。我們使用透過 SDG 特定關鍵字查詢檢索的學術摘要資料集，證明小型的、本地託管的 LLM 可以區分與 SDG 目標語義相關的貢獻，以及由於偶然關鍵字比對而檢索到的文件，從而解決傳統方法的限制。透過利用 LLM 的脈絡理解，此方法提供了一個可擴充的架構，用於改善與 SDG 相關的研究指標，並提供機構報告資訊。", "author": "William A. Ingram et.al.", "authors": "William A. Ingram, Bipasha Banerjee, Edward A. Fox", "id": "2411.17598v1", "paper_url": "http://arxiv.org/abs/2411.17598v1", "repo": "null"}}