{"2409.03659": {"publish_time": "2024-09-05", "title": "LLM-based multi-agent poetry generation in non-cooperative environments", "paper_summary": "Despite substantial progress of large language models (LLMs) for automatic\npoetry generation, the generated poetry lacks diversity while the training\nprocess differs greatly from human learning. Under the rationale that the\nlearning process of the poetry generation systems should be more human-like and\ntheir output more diverse and novel, we introduce a framework based on social\nlearning where we emphasize non-cooperative interactions besides cooperative\ninteractions to encourage diversity. Our experiments are the first attempt at\nLLM-based multi-agent systems in non-cooperative environments for poetry\ngeneration employing both TRAINING-BASED agents (GPT-2) and PROMPTING-BASED\nagents (GPT-3 and GPT-4). Our evaluation based on 96k generated poems shows\nthat our framework benefits the poetry generation process for TRAINING-BASED\nagents resulting in 1) a 3.0-3.7 percentage point (pp) increase in diversity\nand a 5.6-11.3 pp increase in novelty according to distinct and novel n-grams.\nThe generated poetry from TRAINING-BASED agents also exhibits group divergence\nin terms of lexicons, styles and semantics. PROMPTING-BASED agents in our\nframework also benefit from non-cooperative environments and a more diverse\nensemble of models with non-homogeneous agents has the potential to further\nenhance diversity, with an increase of 7.0-17.5 pp according to our\nexperiments. However, PROMPTING-BASED agents show a decrease in lexical\ndiversity over time and do not exhibit the group-based divergence intended in\nthe social network. Our paper argues for a paradigm shift in creative tasks\nsuch as automatic poetry generation to include social learning processes (via\nLLM-based agent modeling) similar to human interaction.", "paper_summary_zh": "<paragraph>儘管大型語言模型 (LLM) 在自動詩歌生成方面取得了顯著進展，但生成的詩歌缺乏多樣性，而訓練過程與人類學習有很大不同。基於詩歌生成系統的學習過程應更像人類，其輸出應更具多樣性和新穎性，我們引入了一個基於社會學習的框架，在其中我們強調非合作互動，除了合作互動以鼓勵多樣性。我們的實驗是 LLM 為基礎的多代理系統在非合作環境中生成詩歌的首次嘗試，採用基於訓練的代理（GPT-2）和基於提示的代理（GPT-3 和 GPT-4）。我們根據 96k 首生成的詩歌進行評估，顯示我們的框架有利於基於訓練的代理的詩歌生成過程，導致 1) 多樣性增加 3.0-3.7 個百分點 (pp)，根據不同的新穎 n-gram，新穎性增加 5.6-11.3 pp。基於訓練的代理所生成的詩歌在詞彙、風格和語義方面也表現出群體差異。我們框架中的基於提示的代理也受益於非合作環境，並且具有非同質代理的多樣化模型集合有可能進一步提高多樣性，根據我們的實驗，增加了 7.0-17.5 pp。然而，基於提示的代理會隨著時間推移而降低詞彙多樣性，並且不會表現出社交網路中預期的基於群體的差異。我們的論文主張在創造性任務（例如自動詩歌生成）中進行典範轉移，以納入類似於人類互動的社會學習過程（通過基於 LLM 的代理建模）。</paragraph>", "author": "Ran Zhang et.al.", "authors": "Ran Zhang, Steffen Eger", "id": "2409.03659v1", "paper_url": "http://arxiv.org/abs/2409.03659v1", "repo": "https://github.com/zhangr2021/Multiagent_poetry"}}