{"2409.08435": {"publish_time": "2024-09-13", "title": "When Context Leads but Parametric Memory Follows in Large Language Models", "paper_summary": "Large language models (LLMs) have demonstrated remarkable progress in\nleveraging diverse knowledge sources. This study investigates how nine widely\nused LLMs allocate knowledge between local context and global parameters when\nanswering open-ended questions in knowledge-consistent scenarios. We introduce\na novel dataset, WikiAtomic, and systematically vary context sizes to analyze\nhow LLMs prioritize and utilize the provided information and their parametric\nknowledge in knowledge-consistent scenarios. Additionally, we also study their\ntendency to hallucinate under varying context sizes. Our findings reveal\nconsistent patterns across models, including a consistent reliance on both\ncontextual (around 70%) and parametric (around 30%) knowledge, and a decrease\nin hallucinations with increasing context. These insights highlight the\nimportance of more effective context organization and developing models that\nuse input more deterministically for robust performance.", "paper_summary_zh": "大型語言模型 (LLM) 在利用多樣化的知識來源方面已展現顯著進展。本研究探討九種廣泛使用的 LLM 在知識一致的場景中回答開放式問題時，如何將知識分配到局部脈絡和全局參數。我們引入了一個新穎的資料集 WikiAtomic，並系統性地改變脈絡大小，以分析 LLM 如何在知識一致的場景中優先處理和利用提供的資訊及其參數知識。此外，我們還研究了它們在不同脈絡大小下產生幻覺的傾向。我們的研究結果揭示了所有模型的一致模式，包括持續依賴於脈絡（約 70%）和參數（約 30%）知識，以及隨著脈絡增加而減少幻覺。這些見解強調了更有效脈絡組織和開發模型的重要性，這些模型更確定地使用輸入以獲得穩健的效能。", "author": "Yufei Tao et.al.", "authors": "Yufei Tao, Adam Hiatt, Erik Haake, Antonie J. Jetter, Ameeta Agrawal", "id": "2409.08435v1", "paper_url": "http://arxiv.org/abs/2409.08435v1", "repo": "https://github.com/PortNLP/WikiAtomic"}}