{"2407.02842": {"publish_time": "2024-07-03", "title": "MindBench: A Comprehensive Benchmark for Mind Map Structure Recognition and Analysis", "paper_summary": "Multimodal Large Language Models (MLLM) have made significant progress in the\nfield of document analysis. Despite this, existing benchmarks typically focus\nonly on extracting text and simple layout information, neglecting the complex\ninteractions between elements in structured documents such as mind maps and\nflowcharts. To address this issue, we introduce the new benchmark named\nMindBench, which not only includes meticulously constructed bilingual authentic\nor synthetic images, detailed annotations, evaluation metrics and baseline\nmodels, but also specifically designs five types of structured understanding\nand parsing tasks. These tasks include full parsing, partial parsing,\nposition-related parsing, structured Visual Question Answering (VQA), and\nposition-related VQA, covering key areas such as text recognition, spatial\nawareness, relationship discernment, and structured parsing. Extensive\nexperimental results demonstrate the substantial potential and significant room\nfor improvement in current models' ability to handle structured document\ninformation. We anticipate that the launch of MindBench will significantly\nadvance research and application development in structured document analysis\ntechnology. MindBench is available at:\nhttps://miasanlei.github.io/MindBench.github.io/.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 在文件分析领域取得了重大进展。尽管如此，现有的基准通常只专注于提取文本和简单的布局信息，而忽略了结构化文件（如思维导图和流程图）中元素之间的复杂交互。为了解决这个问题，我们引入了名为 MindBench 的新基准，它不仅包括精心构建的双语真实或合成图像、详细注释、评估指标和基线模型，还专门设计了五种类型的结构化理解和解析任务。这些任务包括完全解析、部分解析、位置相关解析、结构化视觉问答 (VQA) 和位置相关 VQA，涵盖文本识别、空间感知、关系辨别和结构化解析等关键领域。广泛的实验结果证明了当前模型处理结构化文档信息的能力具有巨大的潜力和显着的改进空间。我们预计 MindBench 的推出将极大地推进结构化文档分析技术的研究和应用开发。MindBench 可在以下网址获得：\nhttps://miasanlei.github.io/MindBench.github.io/。", "author": "Lei Chen et.al.", "authors": "Lei Chen, Feng Yan, Yujie Zhong, Shaoxiang Chen, Zequn Jie, Lin Ma", "id": "2407.02842v1", "paper_url": "http://arxiv.org/abs/2407.02842v1", "repo": "null"}}