{"2410.20779": {"publish_time": "2024-10-28", "title": "Decoding Reading Goals from Eye Movements", "paper_summary": "Readers can have different goals with respect to the text they are reading.\nCan these goals be decoded from the pattern of their eye movements over the\ntext? In this work, we examine for the first time whether it is possible to\ndecode two types of reading goals that are common in daily life: information\nseeking and ordinary reading. Using large scale eye-tracking data, we apply to\nthis task a wide range of state-of-the-art models for eye movements and text\nthat cover different architectural and data representation strategies, and\nfurther introduce a new model ensemble. We systematically evaluate these models\nat three levels of generalization: new textual item, new participant, and the\ncombination of both. We find that eye movements contain highly valuable signals\nfor this task. We further perform an error analysis which builds on prior\nempirical findings on differences between ordinary reading and information\nseeking and leverages rich textual annotations. This analysis reveals key\nproperties of textual items and participant eye movements that contribute to\nthe difficulty of the task.", "paper_summary_zh": "讀者對於他們正在閱讀的文本可能有不同的目標。\n這些目標可以從他們在文本上的眼睛移動模式中解碼出來嗎？\n在這項工作中，我們首次探討是否可以解碼日常生活中的兩種常見閱讀目標：\n尋求資訊和一般閱讀。使用大規模的眼球追蹤數據，我們將各種最先進的眼球運動和文本模型應用於此任務，\n這些模型涵蓋不同的架構和數據表示策略，並進一步引入新的模型集合。\n我們在三個概括層級系統性地評估這些模型：新的文本項目、新的參與者，以及兩者的組合。\n我們發現眼球運動包含了此任務中非常有價值的訊號。\n我們進一步執行錯誤分析，該分析建立在先前關於一般閱讀和資訊尋求之間差異的經驗發現，\n並利用豐富的文字註解。此分析揭示了文本項目和參與者眼球運動的主要屬性，\n這些屬性會導致任務的難度。", "author": "Omer Shubi et.al.", "authors": "Omer Shubi, Cfir Avraham Hadar, Yevgeni Berzak", "id": "2410.20779v1", "paper_url": "http://arxiv.org/abs/2410.20779v1", "repo": "null"}}