{"2412.13618": {"publish_time": "2024-12-18", "title": "NPC: Neural Predictive Control for Fuel-Efficient Autonomous Trucks", "paper_summary": "Fuel efficiency is a crucial aspect of long-distance cargo transportation by\noil-powered trucks that economize on costs and decrease carbon emissions.\nCurrent predictive control methods depend on an accurate model of vehicle\ndynamics and engine, including weight, drag coefficient, and the Brake-specific\nFuel Consumption (BSFC) map of the engine. We propose a pure data-driven\nmethod, Neural Predictive Control (NPC), which does not use any physical model\nfor the vehicle. After training with over 20,000 km of historical data, the\nnovel proposed NVFormer implicitly models the relationship between vehicle\ndynamics, road slope, fuel consumption, and control commands using the\nattention mechanism. Based on the online sampled primitives from the past of\nthe current freight trip and anchor-based future data synthesis, the NVFormer\ncan infer optimal control command for reasonable fuel consumption. The physical\nmodel-free NPC outperforms the base PCC method with 2.41% and 3.45% more\nsignificant fuel saving in simulation and open-road highway testing,\nrespectively.", "paper_summary_zh": "燃油效率是長途貨運中由燃油卡車執行的關鍵面向，可節省成本並減少碳排放。\n目前的預測控制方法依賴於車輛動力學和引擎的精準模型，包括重量、阻力係數和引擎的特定煞車燃油消耗 (BSFC) 地圖。我們提出了一種純數據驅動的方法，神經預測控制 (NPC)，它不使用任何車輛物理模型。在使用超過 20,000 公里的歷史資料進行訓練後，新提出的 NVFormer 隱含地使用注意力機制建構車輛動力學、道路坡度、燃料消耗和控制指令之間的關係。基於當前貨運行程過去的在線取樣基元和基於錨點的未來資料合成，NVFormer 可以推斷出合理燃料消耗的最佳控制指令。無物理模型的 NPC 在模擬和開放道路高速公路測試中分別比基礎 PCC 方法節省了 2.41% 和 3.45% 的燃料，表現更出色。", "author": "Jiaping Ren et.al.", "authors": "Jiaping Ren, Jiahao Xiang, Hongfei Gao, Jinchuan Zhang, Yiming Ren, Yuexin Ma, Yi Wu, Ruigang Yang, Wei Li", "id": "2412.13618v1", "paper_url": "http://arxiv.org/abs/2412.13618v1", "repo": "null"}}