{"2411.13768": {"publish_time": "2024-11-21", "title": "An Evaluation-Driven Approach to Designing LLM Agents: Process and Architecture", "paper_summary": "The advent of Large Language Models (LLMs) has enabled the development of LLM\nagents capable of autonomously achieving under-specified goals and continuously\nevolving through post-deployment improvement, sometimes without requiring code\nor model updates. Conventional approaches, such as pre-defined test cases and\ncode/model redevelopment pipelines, are inadequate for addressing the unique\nchallenges of LLM agent development, particularly in terms of quality and risk\ncontrol. This paper introduces an evaluation-driven design approach, inspired\nby test-driven development, to address these challenges. Through a multivocal\nliterature review (MLR), we synthesize existing LLM evaluation methods and\npropose a novel process model and reference architecture specifically designed\nfor LLM agents. The proposed approach integrates online and offline evaluations\nto support adaptive runtime adjustments and systematic offline redevelopment,\nimproving runtime pipelines, artifacts, system architecture, and LLMs by\ncontinuously incorporating evaluation results, including fine-grained feedback\nfrom human and AI evaluators.", "paper_summary_zh": "大型語言模型 (LLM) 的出現促成了 LLM 代理的開發，此類代理能夠在未指定目標下自主實現目標，並透過部署後持續改進不斷進化，有時不需要程式碼或模型更新。傳統方法，例如預先定義的測試案例和程式碼/模型重新開發管線，不足以解決 LLM 代理開發的獨特挑戰，特別是在品質和風險控制方面。本文介紹了一種評估驅動設計方法，靈感來自測試驅動開發，以應對這些挑戰。透過多聲道文獻回顧 (MLR)，我們綜合現有的 LLM 評估方法，並提出專門為 LLM 代理設計的新穎流程模型和參考架構。所提出的方法整合線上和離線評估，以支援適應性執行時期調整和系統性離線重新開發，透過持續納入評估結果（包括來自人類和 AI 評估者的細微回饋），改善執行時期管線、人工製品、系統架構和 LLM。", "author": "Boming Xia et.al.", "authors": "Boming Xia, Qinghua Lu, Liming Zhu, Zhenchang Xing, Dehai Zhao, Hao Zhang", "id": "2411.13768v1", "paper_url": "http://arxiv.org/abs/2411.13768v1", "repo": "null"}}