{"2411.12357": {"publish_time": "2024-11-19", "title": "A Layered Architecture for Developing and Enhancing Capabilities in Large Language Model-based Software Systems", "paper_summary": "Significant efforts has been made to expand the use of Large Language Models\n(LLMs) beyond basic language tasks. While the generalizability and versatility\nof LLMs have enabled widespread adoption, evolving demands in application\ndevelopment often exceed their native capabilities. Meeting these demands may\ninvolve a diverse set of methods, such as enhancing creativity through either\ninference temperature adjustments or creativity-provoking prompts. Selecting\nthe right approach is critical, as different methods lead to trade-offs in\nengineering complexity, scalability, and operational costs. This paper\nintroduces a layered architecture that organizes LLM software system\ndevelopment into distinct layers, each characterized by specific attributes. By\naligning capabilities with these layers, the framework encourages the\nsystematic implementation of capabilities in effective and efficient ways that\nultimately supports desired functionalities and qualities. Through practical\ncase studies, we illustrate the utility of the framework. This work offers\ndevelopers actionable insights for selecting suitable technologies in LLM-based\nsoftware system development, promoting robustness and scalability.", "paper_summary_zh": "為了擴展大型語言模型 (LLM) 在基本語言任務以外的應用，已投入大量心力。雖然 LLM 的泛用性和多功能性讓其廣泛採用，但應用程式開發中不斷變化的需求往往超過其原生能力。滿足這些需求可能涉及各種方法，例如透過推論溫度調整或激發創造力的提示來增強創造力。選擇正確的方法至關重要，因為不同的方法會在工程複雜性、可擴充性和運營成本方面產生權衡。本文介紹了一種分層架構，將 LLM 軟體系統開發組織成不同的層級，每個層級都有特定的屬性。透過將功能與這些層級對齊，此架構鼓勵以有效且高效的方式系統性地實作功能，最終支援所需的機能和品質。透過實際案例研究，我們說明了此架構的實用性。這項工作為開發人員提供了可行的見解，以選擇 LLM 為基礎的軟體系統開發中合適的技術，促進穩健性和可擴充性。", "author": "Dawen Zhang et.al.", "authors": "Dawen Zhang, Xiwei Xu, Chen Wang, Zhenchang Xing, Robert Mao", "id": "2411.12357v1", "paper_url": "http://arxiv.org/abs/2411.12357v1", "repo": "null"}}