{"2412.14602": {"publish_time": "2024-12-19", "title": "Towards Scalable and Deep Graph Neural Networks via Noise Masking", "paper_summary": "In recent years, Graph Neural Networks (GNNs) have achieved remarkable\nsuccess in many graph mining tasks. However, scaling them to large graphs is\nchallenging due to the high computational and storage costs of repeated feature\npropagation and non-linear transformation during training. One commonly\nemployed approach to address this challenge is model-simplification, which only\nexecutes the Propagation (P) once in the pre-processing, and Combine (C) these\nreceptive fields in different ways and then feed them into a simple model for\nbetter performance. Despite their high predictive performance and scalability,\nthese methods still face two limitations. First, existing approaches mainly\nfocus on exploring different C methods from the model perspective, neglecting\nthe crucial problem of performance degradation with increasing P depth from the\ndata-centric perspective, known as the over-smoothing problem. Second,\npre-processing overhead takes up most of the end-to-end processing time,\nespecially for large-scale graphs. To address these limitations, we present\nrandom walk with noise masking (RMask), a plug-and-play module compatible with\nthe existing model-simplification works. This module enables the exploration of\ndeeper GNNs while preserving their scalability. Unlike the previous\nmodel-simplification works, we focus on continuous P and found that the noise\nexisting inside each P is the cause of the over-smoothing issue, and use the\nefficient masking mechanism to eliminate them. Experimental results on six\nreal-world datasets demonstrate that model-simplification works equipped with\nRMask yield superior performance compared to their original version and can\nmake a good trade-off between accuracy and efficiency.", "paper_summary_zh": "近年来，图神经网络 (GNN) 已在许多图挖掘任务中取得了显著成功。然而，由于训练期间重复特征传播和非线性转换的高计算和存储成本，将它们扩展到大型图极具挑战性。解决这一挑战的一种常用方法是模型简化，它只在预处理中执行一次传播 (P)，并以不同的方式组合 (C) 这些感受野，然后将它们输入到一个简单的模型中以获得更好的性能。尽管它们具有很高的预测性能和可扩展性，但这些方法仍然面临两个限制。首先，现有方法主要集中于从模型角度探索不同的 C 方法，忽略了从以数据为中心的角度来看，随着 P 深度的增加而导致的性能下降的关键问题，即过度平滑问题。其次，预处理开销占据了端到端处理时间的最大部分，尤其是对于大规模图。为了解决这些限制，我们提出了带有噪声掩码的随机游走 (RMask)，这是一个与现有的模型简化工作兼容的即插即用模块。该模块能够探索更深的 GNN，同时保持其可扩展性。与之前的模型简化工作不同，我们专注于连续 P，并发现每个 P 中存在的噪声是过度平滑问题的原因，并使用高效的掩码机制来消除它们。在六个真实世界数据集上的实验结果表明，配备了 RMask 的模型简化工作与它们的原始版本相比产生了更好的性能，并且可以在准确性和效率之间做出很好的权衡。", "author": "Yuxuan Liang et.al.", "authors": "Yuxuan Liang, Wentao Zhang, Zeang Sheng, Ling Yang, Quanqing Xu, Jiawei Jiang, Yunhai Tong, Bin Cu", "id": "2412.14602v1", "paper_url": "http://arxiv.org/abs/2412.14602v1", "repo": "null"}}