{"2412.11878": {"publish_time": "2024-12-16", "title": "Using Instruction-Tuned Large Language Models to Identify Indicators of Vulnerability in Police Incident Narratives", "paper_summary": "Objectives: Compare qualitative coding of instruction tuned large language\nmodels (IT-LLMs) against human coders in classifying the presence or absence of\nvulnerability in routinely collected unstructured text that describes\npolice-public interactions. Evaluate potential bias in IT-LLM codings. Methods:\nAnalyzing publicly available text narratives of police-public interactions\nrecorded by Boston Police Department, we provide humans and IT-LLMs with\nqualitative labelling codebooks and compare labels generated by both, seeking\nto identify situations associated with (i) mental ill health; (ii) substance\nmisuse; (iii) alcohol dependence; and (iv) homelessness. We explore multiple\nprompting strategies and model sizes, and the variability of labels generated\nby repeated prompts. Additionally, to explore model bias, we utilize\ncounterfactual methods to assess the impact of two protected characteristics -\nrace and gender - on IT-LLM classification. Results: Results demonstrate that\nIT-LLMs can effectively support human qualitative coding of police incident\nnarratives. While there is some disagreement between LLM and human generated\nlabels, IT-LLMs are highly effective at screening narratives where no\nvulnerabilities are present, potentially vastly reducing the requirement for\nhuman coding. Counterfactual analyses demonstrate that manipulations to both\ngender and race of individuals described in narratives have very limited\neffects on IT-LLM classifications beyond those expected by chance. Conclusions:\nIT-LLMs offer effective means to augment human qualitative coding in a way that\nrequires much lower levels of resource to analyze large unstructured datasets.\nMoreover, they encourage specificity in qualitative coding, promote\ntransparency, and provide the opportunity for more standardized, replicable\napproaches to analyzing large free-text police data sources.", "paper_summary_zh": "<paragraph>目標：比較針對人類編碼器，對大型語言模型 (IT-LLM) 的指令調整定性編碼，以分類在常規收集的非結構化文本中描述的警民互動中是否存在漏洞。評估 IT-LLM 編碼中的潛在偏差。方法：分析波士頓警察局記錄的警民互動的公開文本敘述，我們為人類和 IT-LLM 提供定性標籤編碼手冊，並比較兩者產生的標籤，試圖找出與 (i) 心理疾病；(ii) 物質濫用；(iii) 酒精依賴；和 (iv) 無家可歸相關的情況。我們探索多種提示策略和模型大小，以及重複提示產生的標籤的可變性。此外，為了探索模型偏差，我們利用反事實方法來評估兩個受保護特徵（種族和性別）對 IT-LLM 分類的影響。結果：結果表明，IT-LLM 可以有效支持人類對警察事件敘述的定性編碼。雖然 LLM 和人類產生的標籤之間存在一些分歧，但 IT-LLM 在篩選不存在漏洞的敘述方面非常有效，這可能會大大減少對人類編碼的要求。反事實分析表明，對敘述中描述的個體的性別和種族的操縱對 IT-LLM 分類的影響非常有限，超出預期。結論：IT-LLM 提供了有效的方法來擴充人類定性編碼，這種方法需要更低級別的資源來分析大型非結構化數據集。此外，它們鼓勵在定性編碼中具體化，促進透明度，並為分析大型自由文本警察數據源提供了更標準化、可複製的方法。</paragraph>", "author": "Sam Relins et.al.", "authors": "Sam Relins, Daniel Birks, Charlie Lloyd", "id": "2412.11878v1", "paper_url": "http://arxiv.org/abs/2412.11878v1", "repo": "null"}}