{"2410.02713": {"publish_time": "2024-10-03", "title": "Video Instruction Tuning With Synthetic Data", "paper_summary": "The development of video large multimodal models (LMMs) has been hindered by\nthe difficulty of curating large amounts of high-quality raw data from the web.\nTo address this, we propose an alternative approach by creating a high-quality\nsynthetic dataset specifically for video instruction-following, namely\nLLaVA-Video-178K. This dataset includes key tasks such as detailed captioning,\nopen-ended question-answering (QA), and multiple-choice QA. By training on this\ndataset, in combination with existing visual instruction tuning data, we\nintroduce LLaVA-Video, a new video LMM. Our experiments demonstrate that\nLLaVA-Video achieves strong performance across various video benchmarks,\nhighlighting the effectiveness of our dataset. We plan to release the dataset,\nits generation pipeline, and the model checkpoints.", "paper_summary_zh": "影片大型多模态模型 (LMM) 的发展受到从网络中整理大量高质量原始资料的困难度所阻碍。为了解决这个问题，我们提出一种替代方法，通过创建一个专门用于影片指令遵循的高质量合成数据集，即 LLaVA-Video-178K。此数据集包含详细说明、开放式问答 (QA) 和多项选择 QA 等关键任务。通过使用此数据集进行训练，结合现有的视觉指令调整数据，我们引入了 LLaVA-Video，一种新的影片 LMM。我们的实验表明，LLaVA-Video 在各种影片基准测试中均取得了强劲的性能，突显了我们数据集的有效性。我们计划发布数据集、其生成管道和模型检查点。", "author": "Yuanhan Zhang et.al.", "authors": "Yuanhan Zhang, Jinming Wu, Wei Li, Bo Li, Zejun Ma, Ziwei Liu, Chunyuan Li", "id": "2410.02713v1", "paper_url": "http://arxiv.org/abs/2410.02713v1", "repo": "null"}}