{"2411.17863": {"publish_time": "2024-11-26", "title": "LongKey: Keyphrase Extraction for Long Documents", "paper_summary": "In an era of information overload, manually annotating the vast and growing\ncorpus of documents and scholarly papers is increasingly impractical. Automated\nkeyphrase extraction addresses this challenge by identifying representative\nterms within texts. However, most existing methods focus on short documents (up\nto 512 tokens), leaving a gap in processing long-context documents. In this\npaper, we introduce LongKey, a novel framework for extracting keyphrases from\nlengthy documents, which uses an encoder-based language model to capture\nextended text intricacies. LongKey uses a max-pooling embedder to enhance\nkeyphrase candidate representation. Validated on the comprehensive LDKP\ndatasets and six diverse, unseen datasets, LongKey consistently outperforms\nexisting unsupervised and language model-based keyphrase extraction methods.\nOur findings demonstrate LongKey's versatility and superior performance,\nmarking an advancement in keyphrase extraction for varied text lengths and\ndomains.", "paper_summary_zh": "在資訊爆炸的時代，手動標註大量且持續增長的文獻和學術論文越來越不切實際。自動關鍵字萃取透過識別文本中的代表性詞彙，來解決這個挑戰。然而，現有的方法大多著重於短文件（最多 512 個詞彙），在處理長文脈文件時仍有不足。在本文中，我們提出 LongKey，一個從長篇文件中萃取關鍵字的新框架，它使用基於編碼器的語言模型來捕捉延伸文本的複雜性。LongKey 使用最大池化嵌入器來增強關鍵字候選的表示。在全面的 LDKP 資料集和六個不同的未見過資料集上驗證後，LongKey 持續優於現有的非監督式和基於語言模型的關鍵字萃取方法。我們的發現證明了 LongKey 的多功能性和優異效能，標誌著關鍵字萃取在不同文本長度和領域的進步。", "author": "Jeovane Honorio Alves et.al.", "authors": "Jeovane Honorio Alves, Radu State, Cinthia Obladen de Almendra Freitas, Jean Paul Barddal", "id": "2411.17863v1", "paper_url": "http://arxiv.org/abs/2411.17863v1", "repo": "https://github.com/jeohalves/longkey"}}