{"2412.15127": {"publish_time": "2024-12-19", "title": "Adaptive Pruning for Large Language Models with Structural Importance Awareness", "paper_summary": "The recent advancements in large language models (LLMs) have significantly\nimproved language understanding and generation capabilities. However, it is\ndifficult to deploy LLMs on resource-constrained edge devices due to their high\ncomputational and storage resource demands. To address this issue, we propose a\nnovel LLM model pruning method, namely structurally-aware adaptive pruning\n(SAAP), to significantly reduce the computational and memory costs while\nmaintaining model performance. We first define an adaptive importance fusion\nmetric to evaluate the importance of all coupled structures in LLMs by\nconsidering their homoscedastic uncertainty. Then, we rank the importance of\nall modules to determine the specific layers that should be pruned to meet\nparticular performance requirements. Furthermore, we develop a new group\nfine-tuning strategy to improve the inference efficiency of LLMs. Finally, we\nevaluate the proposed SAAP method on multiple LLMs across two common tasks,\ni.e., zero-shot classification and text generation. Experimental results show\nthat our SAAP method outperforms several state-of-the-art baseline methods,\nachieving 2.17%, 2.37%, and 2.39% accuracy gains on LLaMA-7B, Vicuna-7B, and\nLLaMA-13B. Additionally, SAAP improves the token generation speed by 5%,\nshowcasing its practical advantages in resource-constrained scenarios.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展顯著地\n改進了語言理解和生成能力。然而，由於 LLM 對計算和儲存資源需求高，因此難以將其部署在資源受限的邊緣裝置上。為了解決此問題，我們提出了一種新穎的 LLM 模型剪枝方法，即結構感知自適應剪枝 (SAAP)，以在維持模型效能的同時顯著降低計算和記憶體成本。我們首先定義一個自適應重要性融合指標，透過考慮 LLM 中所有耦合結構的同質異方差不確定性來評估其重要性。然後，我們對所有模組的重要性進行排序，以確定應剪枝的特定層，以滿足特定的效能需求。此外，我們開發了一種新的群組微調策略，以改善 LLM 的推論效率。最後，我們在兩個常見任務中對多個 LLM 評估所提出的 SAAP 方法，即零次分類和文字生成。實驗結果顯示，我們的 SAAP 方法優於多種最先進的基線方法，在 LLaMA-7B、Vicuna-7B 和 LLaMA-13B 上分別獲得 2.17%、2.37% 和 2.39% 的準確度提升。此外，SAAP 將代碼生成速度提高了 5%，展示了其在資源受限場景中的實際優勢。", "author": "Haotian Zheng et.al.", "authors": "Haotian Zheng, Jinke Ren, Yushan Sun, Ruichen Zhang, Wenbo Zhang, Zhen Li, Dusit Niyato, Shuguang Cui, Yatong Han", "id": "2412.15127v1", "paper_url": "http://arxiv.org/abs/2412.15127v1", "repo": "null"}}