{"2405.10853": {"publish_time": "2024-05-17", "title": "The Future of Large Language Model Pre-training is Federated", "paper_summary": "Generative pre-trained large language models (LLMs) have demonstrated\nimpressive performance over a wide range of tasks, thanks to the unprecedented\namount of data they have been trained on. As established scaling laws indicate,\nLLMs' future performance improvement depends on the amount of computing and\ndata sources we can leverage for pre-training. Federated learning (FL) has the\npotential to unleash the majority of the planet's data and computational\nresources, which are underutilized by the data-center-focused training\nmethodology of current LLM practice. Our work presents a robust, flexible,\nreproducible FL approach that enables large-scale collaboration across\ninstitutions to train LLMs. This would mobilize more computational and data\nresources while matching or potentially exceeding centralized performance. We\nfurther show the effectiveness of the federated training scales with model size\nand present our approach for training a billion-scale federated LLM using\nlimited resources. This will help data-rich actors to become the protagonists\nof LLMs pre-training instead of leaving the stage to compute-rich actors alone.", "paper_summary_zh": "生成式预训练大型语言模型 (LLM) 已在广泛的任务中展示出令人印象深刻的性能，这要归功于它们接受过前所未有的数据训练。正如既定的缩放定律所表明的，LLM 未来性能的提升取决于我们可用于预训练的计算量和数据源。联邦学习 (FL) 有可能释放地球上大部分数据和计算资源，而这些资源目前并未得到以数据中心为中心的当前 LLM 实践训练方法的充分利用。我们的工作提出了一种稳健、灵活、可复制的 FL 方法，该方法支持跨机构进行大规模协作以训练 LLM。这将调动更多计算和数据资源，同时匹配或可能超过集中式性能。我们进一步展示了联邦训练规模与模型大小的有效性，并提出了我们使用有限资源训练十亿级联邦 LLM 的方法。这将帮助数据丰富的参与者成为 LLM 预训练的主角，而不是将舞台留给仅有的计算丰富的参与者。", "author": "Lorenzo Sani et.al.", "authors": "Lorenzo Sani, Alex Iacob, Zeyu Cao, Bill Marino, Yan Gao, Tomas Paulik, Wanru Zhao, William F. Shen, Preslav Aleksandrov, Xinchi Qiu, Nicholas D. Lane", "id": "2405.10853v1", "paper_url": "http://arxiv.org/abs/2405.10853v1", "repo": "null"}}