{"2408.12772": {"publish_time": "2024-08-23", "title": "Symmetric masking strategy enhances the performance of Masked Image Modeling", "paper_summary": "Masked Image Modeling (MIM) is a technique in self-supervised learning that\nfocuses on acquiring detailed visual representations from unlabeled images by\nestimating the missing pixels in randomly masked sections. It has proven to be\na powerful tool for the preliminary training of Vision Transformers (ViTs),\nyielding impressive results across various tasks. Nevertheless, most MIM\nmethods heavily depend on the random masking strategy to formulate the pretext\ntask. This strategy necessitates numerous trials to ascertain the optimal\ndropping ratio, which can be resource-intensive, requiring the model to be\npre-trained for anywhere between 800 to 1600 epochs. Furthermore, this approach\nmay not be suitable for all datasets. In this work, we propose a new masking\nstrategy that effectively helps the model capture global and local features.\nBased on this masking strategy, SymMIM, our proposed training pipeline for MIM\nis introduced. SymMIM achieves a new SOTA accuracy of 85.9\\% on ImageNet using\nViT-Large and surpasses previous SOTA across downstream tasks such as image\nclassification, semantic segmentation, object detection, instance segmentation\ntasks, and so on.", "paper_summary_zh": "遮蔽影像建模 (Masked Image Modeling, MIM) 是一種自監督學習技術，其重點在於透過估計隨機遮蔽區段中遺失的畫素，從未標籤影像中獲取詳細的視覺表徵。它已被證明是 Vision Transformers (ViTs) 初步訓練的強大工具，在各種任務中產生令人印象深刻的結果。儘管如此，大多數 MIM 方法都高度依賴隨機遮蔽策略來制定藉口任務。此策略需要進行多次試驗才能確定最佳丟棄率，這可能會消耗大量資源，需要對模型進行 800 到 1600 個世代的預訓練。此外，此方法可能並不適用於所有資料集。在這項工作中，我們提出了一種新的遮蔽策略，可有效幫助模型擷取全局和局部特徵。基於此遮蔽策略，我們引入了用於 MIM 的建議訓練管線 SymMIM。SymMIM 使用 ViT-Large 在 ImageNet 上達到了 85.9% 的新 SOTA 精度，並在影像分類、語意分割、物件偵測、實例分割任務等下游任務中超越了先前的 SOTA。", "author": "Khanh-Binh Nguyen et.al.", "authors": "Khanh-Binh Nguyen, Chae Jung Park", "id": "2408.12772v1", "paper_url": "http://arxiv.org/abs/2408.12772v1", "repo": "null"}}