{"2409.04102": {"publish_time": "2024-09-06", "title": "Intelligent tutoring systems by Bayesian networks with noisy gates", "paper_summary": "Directed graphical models such as Bayesian nets are often used to implement\nintelligent tutoring systems able to interact in real-time with learners in a\npurely automatic way. When coping with such models, keeping a bound on the\nnumber of parameters might be important for multiple reasons. First, as these\nmodels are typically based on expert knowledge, a huge number of parameters to\nelicit might discourage practitioners from adopting them. Moreover, the number\nof model parameters affects the complexity of the inferences, while a fast\ncomputation of the queries is needed for real-time feedback. We advocate\nlogical gates with uncertainty for a compact parametrization of the conditional\nprobability tables in the underlying Bayesian net used by tutoring systems. We\ndiscuss the semantics of the model parameters to elicit and the assumptions\nrequired to apply such approach in this domain. We also derive a dedicated\ninference scheme to speed up computations.", "paper_summary_zh": "有向圖形模型（例如貝氏網路）常被用於實作智慧型教學系統，此系統能夠以純自動化的方式與學習者進行即時互動。在應對此類模型時，基於多項原因，控制參數數量可能很重要。首先，由於這些模型通常基於專家知識，因此可能需要大量參數，這可能會讓從業者卻步。此外，模型參數數量會影響推論的複雜度，而即時回饋需要快速運算查詢。我們提倡使用具有不確定性的邏輯閘，以對教學系統所使用的基礎貝氏網路中的條件機率表進行精簡參數化。我們討論模型參數的語意，以引發並假設在這個領域中套用此方法時所需要的假設。我們也推導出專門的推論架構，以加速運算。", "author": "Alessandro Antonucci et.al.", "authors": "Alessandro Antonucci, Francesca Mangili, Claudio Bonesana, Giorgia Adorni", "id": "2409.04102v1", "paper_url": "http://arxiv.org/abs/2409.04102v1", "repo": "null"}}