{"2410.04962": {"publish_time": "2024-10-07", "title": "Activation Scaling for Steering and Interpreting Language Models", "paper_summary": "Given the prompt \"Rome is in\", can we steer a language model to flip its\nprediction of an incorrect token \"France\" to a correct token \"Italy\" by only\nmultiplying a few relevant activation vectors with scalars? We argue that\nsuccessfully intervening on a model is a prerequisite for interpreting its\ninternal workings. Concretely, we establish a three-term objective: a\nsuccessful intervention should flip the correct with the wrong token and vice\nversa (effectiveness), and leave other tokens unaffected (faithfulness), all\nwhile being sparse (minimality). Using gradient-based optimization, this\nobjective lets us learn (and later evaluate) a specific kind of efficient and\ninterpretable intervention: activation scaling only modifies the signed\nmagnitude of activation vectors to strengthen, weaken, or reverse the steering\ndirections already encoded in the model. On synthetic tasks, this intervention\nperforms comparably with steering vectors in terms of effectiveness and\nfaithfulness, but is much more minimal allowing us to pinpoint interpretable\nmodel components. We evaluate activation scaling from different angles, compare\nperformance on different datasets, and make activation scalars a learnable\nfunction of the activation vectors themselves to generalize to varying-length\nprompts.", "paper_summary_zh": "给定提示“罗马在”，我们是否可以通过仅用标量乘以几个相关的激活向量，引导语言模型将其对错误标记“法国”的预测翻转为正确标记“意大利”？我们认为，成功干预模型是解释其内部运作的前提。具体来说，我们建立了一个三项目标：一个成功的干预应该将正确的标记与错误的标记翻转，反之亦然（有效性），并且不影响其他标记（忠实度），同时是稀疏的（最小性）。使用基于梯度的优化，此目标使我们能够学习（并在稍后评估）一种特定类型的有效且可解释的干预：激活缩放仅修改激活向量的有符号幅度，以增强、削弱或反转模型中已编码的转向方向。在合成任务中，这种干预在有效性和忠实度方面与转向向量表现相当，但最小得多，使我们能够精确定位可解释的模型组件。我们从不同的角度评估激活缩放，比较不同数据集上的性能，并将激活标量作为激活向量本身的可学习函数，以推广到变长提示。", "author": "Niklas Stoehr et.al.", "authors": "Niklas Stoehr, Kevin Du, Vésteinn Snæbjarnarson, Robert West, Ryan Cotterell, Aaron Schein", "id": "2410.04962v1", "paper_url": "http://arxiv.org/abs/2410.04962v1", "repo": "null"}}