{"2410.19367": {"publish_time": "2024-10-25", "title": "BitPipe: Bidirectional Interleaved Pipeline Parallelism for Accelerating Large Models Training", "paper_summary": "With the increasing scale of models, the need for efficient distributed\ntraining has become increasingly urgent. Recently, many synchronous pipeline\nparallelism approaches have been proposed to improve training throughput.\nHowever, these approaches still suffer from two major issues, i.e., pipeline\nbubbles caused by periodic flushing and extra communication due to the\nincreasing number of pipeline stages. To this end, we propose BitPipe, a\nbidirectional interleaved pipeline parallelism for accelerating large models\ntraining. Specifically, a hybrid scheme of fusing interleaved pipelines with\nbidirectional pipelines is proposed to reduce the computational time of each\nsingle micro-batch and multiply the number of devices executing simultaneously.\nA V-shaped schedule with eager gradient synchronization is introduced to reduce\nand overlap the communication between devices. Experiments conducted on up to\n32 GPUs show that BitPipe improves the training throughput of GPT-style and\nBERT-style models by 1.05x-1.28x compared to the state-of-the-art synchronous\napproaches. The code of our implementation is available at\nhttps://github.com/wuhouming/BitPipe.", "paper_summary_zh": "隨著模型規模的擴大，對於高效分布式訓練的需求變得越來越迫切。最近，已經提出了許多同步管道並行方法來改善訓練吞吐量。然而，這些方法仍然存在兩個主要問題，即由週期性沖洗引起的管道氣泡，以及由於管道階段數的增加而導致的額外通訊。為此，我們提出 BitPipe，這是一種雙向交錯管道並行方法，用於加速大型模型訓練。具體來說，提出了一種融合交錯管道和雙向管道的混合方案，以減少每個單一微批次的計算時間，並增加同時執行的設備數量。引入了帶有急切梯度同步的 V 形調度，以減少和重疊設備之間的通訊。在多達 32 個 GPU 上進行的實驗表明，與最先進的同步方法相比，BitPipe 將 GPT 風格和 BERT 風格模型的訓練吞吐量提高了 1.05 倍至 1.28 倍。我們的實現代碼可在 https://github.com/wuhouming/BitPipe 獲得。", "author": "Houming Wu et.al.", "authors": "Houming Wu, Ling Chen, Wenjie Yu", "id": "2410.19367v1", "paper_url": "http://arxiv.org/abs/2410.19367v1", "repo": "https://github.com/wuhouming/bitpipe"}}