{"2411.14055": {"publish_time": "2024-11-21", "title": "DRPruning: Efficient Large Language Model Pruning through Distributionally Robust Optimization", "paper_summary": "Large language models (LLMs) deliver impressive results but face challenges\nfrom increasing model sizes and computational costs. Structured pruning reduces\nmodel size and speeds up inference but often causes uneven degradation across\ndomains, leading to biased performance. To address this, we propose DRPruning,\nwhich incorporates distributionally robust optimization to restore balanced\nperformance across domains, along with further improvements to enhance\nrobustness. Experiments in monolingual and multilingual settings show that our\nmethod surpasses similarly sized models in pruning and continued pretraining\nover perplexity, downstream tasks, and instruction tuning. We further provide\nanalysis demonstrating the robustness of our method towards various domains and\ndistribution shifts. Furthermore, our method automatically determines optimal\nreference losses and data ratios, suggesting potential for broader\napplications. Our code is available at https://github.com/hexuandeng/DRPruning.", "paper_summary_zh": "大型語言模型 (LLM) 提供令人印象深刻的結果，但面臨模型規模和運算成本增加的挑戰。結構化剪枝可減少模型大小並加速推理，但通常會導致不同領域的性能下降不均，進而導致性能偏差。為了解決這個問題，我們提出了 DRPruning，它結合了分布穩健最佳化，以恢復不同領域的平衡性能，同時進一步改進以增強穩健性。單語和多語環境中的實驗表明，我們的模型在剪枝和持續預訓練方面優於大小相似的模型，在困惑度、下游任務和指令調整方面表現出色。我們進一步提供了分析，證明了我們的模型對各種領域和分佈轉移的穩健性。此外，我們的模型自動確定最佳參考損失和數據比率，表明其在更廣泛的應用中具有潛力。我們的程式碼可在 https://github.com/hexuandeng/DRPruning 取得。", "author": "Hexuan Deng et.al.", "authors": "Hexuan Deng, Wenxiang Jiao, Xuebo Liu, Min Zhang, Zhaopeng Tu", "id": "2411.14055v1", "paper_url": "http://arxiv.org/abs/2411.14055v1", "repo": "https://github.com/hexuandeng/drpruning"}}