{"2501.04513": {"publish_time": "2025-01-08", "title": "Improving Image Captioning by Mimicking Human Reformulation Feedback at Inference-time", "paper_summary": "Incorporating automatically predicted human feedback into the process of\ntraining generative models has attracted substantial recent interest, while\nfeedback at inference time has received less attention. The typical feedback at\ntraining time, i.e., preferences of choice given two samples, does not\nnaturally transfer to the inference phase. We introduce a novel type of\nfeedback -- caption reformulations -- and train models to mimic reformulation\nfeedback based on human annotations. Our method does not require training the\nimage captioning model itself, thereby demanding substantially less\ncomputational effort. We experiment with two types of reformulation feedback:\nfirst, we collect a dataset of human reformulations that correct errors in the\ngenerated captions. We find that incorporating reformulation models trained on\nthis data into the inference phase of existing image captioning models results\nin improved captions, especially when the original captions are of low quality.\nWe apply our method to non-English image captioning, a domain where robust\nmodels are less prevalent, and gain substantial improvement. Second, we apply\nreformulations to style transfer. Quantitative evaluations reveal\nstate-of-the-art performance on German image captioning and English style\ntransfer, while human validation with a detailed comparative framework exposes\nthe specific axes of improvement.", "paper_summary_zh": "將自動預測的人類回饋納入生成模型訓練過程中已引起近期大量關注，而推論時間的回饋則較少受到關注。訓練時間的典型回饋，也就是給定兩個範例的選擇偏好，並未自然轉移到推論階段。我們引入一種新類型的回饋——標題重新表述——並訓練模型根據人類註解來模擬重新表述的回饋。我們的做法不需要訓練影像標題模型本身，因此大幅減少運算需求。我們實驗了兩種類型的重新表述回饋：首先，我們收集了一組人類重新表述的資料集，來修正產生標題中的錯誤。我們發現將訓練於此資料的重新表述模型納入現有影像標題模型的推論階段，會改善標題品質，尤其是在原始標題品質不佳時。我們將我們的做法應用於非英語影像標題，這是一個強健模型較不普遍的領域，並獲得大幅改善。其次，我們將重新表述應用於風格轉移。量化評估顯示在德語影像標題和英語風格轉移方面達到最先進的效能，而使用詳細比較架構進行的人類驗證則揭露了具體的改善面向。", "author": "Uri Berger et.al.", "authors": "Uri Berger, Omri Abend, Lea Frermann, Gabriel Stanovsky", "id": "2501.04513v1", "paper_url": "http://arxiv.org/abs/2501.04513v1", "repo": "null"}}