{"2410.06809": {"publish_time": "2024-10-09", "title": "Root Defence Strategies: Ensuring Safety of LLM at the Decoding Level", "paper_summary": "Large language models (LLMs) have demonstrated immense utility across various\nindustries. However, as LLMs advance, the risk of harmful outputs increases due\nto incorrect or malicious instruction prompts. While current methods\neffectively address jailbreak risks, they share common limitations: 1) Judging\nharmful responses from the prefill-level lacks utilization of the model's\ndecoding outputs, leading to relatively lower effectiveness and robustness. 2)\nRejecting potentially harmful responses based on a single evaluation can\nsignificantly impair the model's helpfulness.This paper examines the LLMs'\ncapability to recognize harmful outputs, revealing and quantifying their\nproficiency in assessing the danger of previous tokens. Motivated by pilot\nexperiment results, we design a robust defense mechanism at the decoding level.\nOur novel decoder-oriented, step-by-step defense architecture corrects harmful\nqueries directly rather than rejecting them outright. We introduce speculative\ndecoding to enhance usability and facilitate deployment to boost secure\ndecoding speed. Extensive experiments demonstrate that our approach improves\nmodel security without compromising reasoning speed. Notably, our method\nleverages the model's ability to discern hazardous information, maintaining its\nhelpfulness compared to existing methods.", "paper_summary_zh": "大型語言模型 (LLM) 已在各產業展示出極大的效用。然而，隨著 LLM 的進步，由於錯誤或惡意的指令提示，有害輸出的風險也隨之增加。雖然目前的技術能有效解決越獄風險，但它們有共同的限制：1) 從預填層級判斷有害回應缺乏利用模型的解碼輸出，導致相對較低的有效性和穩健性。2) 根據單一評估拒絕潛在有害的回應會顯著損害模型的幫助性。本文探討了 LLM 識別有害輸出的能力，揭示並量化了它們評估先前標記危險的能力。受試驗結果啟發，我們在解碼層級設計了一個強健的防禦機制。我們新穎的面向解碼器、逐步進行的防禦架構會直接修正有害查詢，而不是直接拒絕它們。我們引入了推測性解碼來增強可用性，並促進部署以提升安全的解碼速度。大量的實驗證實，我們的方法改善了模型安全性，同時不影響推理速度。值得注意的是，與現有方法相比，我們的方法利用了模型辨別有害資訊的能力，維持了其幫助性。", "author": "Xinyi Zeng et.al.", "authors": "Xinyi Zeng, Yuying Shang, Yutao Zhu, Jiawei Chen, Yu Tian", "id": "2410.06809v1", "paper_url": "http://arxiv.org/abs/2410.06809v1", "repo": "null"}}