{"2504.20998": {"publish_time": "2025-04-29", "title": "YoChameleon: Personalized Vision and Language Generation", "paper_summary": "Large Multimodal Models (e.g., GPT-4, Gemini, Chameleon) have evolved into\npowerful tools with millions of users. However, they remain generic models and\nlack personalized knowledge of specific user concepts. Previous work has\nexplored personalization for text generation, yet it remains unclear how these\nmethods can be adapted to new modalities, such as image generation. In this\npaper, we introduce Yo'Chameleon, the first attempt to study personalization\nfor large multimodal models. Given 3-5 images of a particular concept,\nYo'Chameleon leverages soft-prompt tuning to embed subject-specific information\nto (i) answer questions about the subject and (ii) recreate pixel-level details\nto produce images of the subject in new contexts. Yo'Chameleon is trained with\n(i) a self-prompting optimization mechanism to balance performance across\nmultiple modalities, and (ii) a ``soft-positive\" image generation approach to\nenhance image quality in a few-shot setting.", "paper_summary_zh": "大型多模態模型（例如 GPT-4、Gemini、Chameleon）已經發展成為擁有數百萬用戶的強大工具。然而，它們仍然是通用模型，缺乏對特定用戶概念的個性化知識。先前的研究已經探索了針對文本生成的個性化，但目前尚不清楚如何將這些方法應用於新的模態，例如圖像生成。在本文中，我們介紹了 Yo'Chameleon，這是第一個研究大型多模態模型個性化的嘗試。給定 3-5 張特定概念的圖像，Yo'Chameleon 利用軟提示調整來嵌入特定主題的信息，以 (i) 回答有關該主題的問題，以及 (ii) 重建像素級細節，從而在新的上下文中生成該主題的圖像。Yo'Chameleon 透過 (i) 一種自我提示優化機制來平衡跨多個模態的性能，以及 (ii) 一種「軟正」圖像生成方法，以在少樣本設定中提高圖像質量來進行訓練。\n", "author": "Thao Nguyen et.al.", "authors": "Thao Nguyen, Krishna Kumar Singh, Jing Shi, Trung Bui, Yong Jae Lee, Yuheng Li", "id": "2504.20998v1", "paper_url": "http://arxiv.org/abs/2504.20998v1", "repo": "null"}}