{"2410.23123": {"publish_time": "2024-10-30", "title": "On Memorization of Large Language Models in Logical Reasoning", "paper_summary": "Large language models (LLMs) achieve good performance on challenging\nreasoning benchmarks, yet could also make basic reasoning mistakes. This\ncontrasting behavior is puzzling when it comes to understanding the mechanisms\nbehind LLMs' reasoning capabilities. One hypothesis is that the increasingly\nhigh and nearly saturated performance on common reasoning benchmarks could be\ndue to the memorization of similar problems. In this paper, we systematically\ninvestigate this hypothesis with a quantitative measurement of memorization in\nreasoning tasks, using a dynamically generated logical reasoning benchmark\nbased on Knights and Knaves (K&K) puzzles. We found that LLMs could interpolate\nthe training puzzles (achieving near-perfect accuracy) after fine-tuning, yet\nfail when those puzzles are slightly perturbed, suggesting that the models\nheavily rely on memorization to solve those training puzzles. On the other\nhand, we show that while fine-tuning leads to heavy memorization, it also\nconsistently improves generalization performance. In-depth analyses with\nperturbation tests, cross difficulty-level transferability, probing model\ninternals, and fine-tuning with wrong answers suggest that the LLMs learn to\nreason on K&K puzzles despite training data memorization. This phenomenon\nindicates that LLMs exhibit a complex interplay between memorization and\ngenuine reasoning abilities. Finally, our analysis with per-sample memorization\nscore sheds light on how LLMs switch between reasoning and memorization in\nsolving logical puzzles. Our code and data are available at\nhttps://memkklogic.github.io.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 在具挑戰性的推理基準上取得良好表現，但也會犯下基本的推理錯誤。這種對比行為令人費解，因為它涉及理解 LLM 推理能力背後的機制。一個假設是，在常見推理基準上越來越高且接近飽和的表現可能是由於記住了類似的問題。在本文中，我們使用基於騎士與惡棍 (K&K) 謎題的動態生成邏輯推理基準，對推理任務中的記憶進行定量測量，系統性地探討這個假設。我們發現，LLM 在微調後可以內插訓練謎題（達到接近完美的準確度），但在這些謎題稍有擾動時卻會失敗，這表明模型在很大程度上依賴記憶來解決這些訓練謎題。另一方面，我們表明，雖然微調會導致大量的記憶，但它也會持續改善泛化表現。使用擾動測試、跨難度級別的可傳遞性、探測模型內部結構以及使用錯誤答案進行微調的深入分析表明，LLM 學會了對 K&K 謎題進行推理，儘管訓練數據記憶。這種現象表明，LLM 在記憶和真正的推理能力之間表現出複雜的相互作用。最後，我們對每個樣本記憶分數的分析闡明了 LLM 在解決邏輯謎題時如何在推理和記憶之間切換。我們的程式碼和數據可在 https://memkklogic.github.io/ 獲得。</paragraph>", "author": "Chulin Xie et.al.", "authors": "Chulin Xie, Yangsibo Huang, Chiyuan Zhang, Da Yu, Xinyun Chen, Bill Yuchen Lin, Bo Li, Badih Ghazi, Ravi Kumar", "id": "2410.23123v1", "paper_url": "http://arxiv.org/abs/2410.23123v1", "repo": "null"}}