{"2409.06043": {"publish_time": "2024-09-09", "title": "Identifying the sources of ideological bias in GPT models through linguistic variation in output", "paper_summary": "Extant work shows that generative AI models such as GPT-3.5 and 4 perpetuate\nsocial stereotypes and biases. One concerning but less explored source of bias\nis ideology. Do GPT models take ideological stances on politically sensitive\ntopics? In this article, we provide an original approach to identifying\nideological bias in generative models, showing that bias can stem from both the\ntraining data and the filtering algorithm. We leverage linguistic variation in\ncountries with contrasting political attitudes to evaluate bias in average GPT\nresponses to sensitive political topics in those languages. First, we find that\nGPT output is more conservative in languages that map well onto conservative\nsocieties (i.e., Polish), and more liberal in languages used uniquely in\nliberal societies (i.e., Swedish). This result provides strong evidence of\ntraining data bias in GPT models. Second, differences across languages observed\nin GPT-3.5 persist in GPT-4, even though GPT-4 is significantly more liberal\ndue to OpenAI's filtering policy. Our main takeaway is that generative model\ntraining must focus on high-quality, curated datasets to reduce bias, even if\nit entails a compromise in training data size. Filtering responses after\ntraining only introduces new biases and does not remove the underlying training\nbiases.", "paper_summary_zh": "現有的研究顯示，生成式 AI 模型（例如 GPT-3.5 和 4）會延續社會刻板印象和偏見。意識形態是一個令人擔憂但較少探討的偏見來源。GPT 模型是否對政治敏感議題採取意識形態立場？在本文中，我們提供一種辨識生成式模型中意識形態偏見的原創方法，並說明偏見可能來自訓練資料和篩選演算法。我們利用政治態度截然不同的國家中的語言差異，來評估 GPT 對這些語言中敏感政治議題的平均回應中的偏見。首先，我們發現 GPT 輸出的保守程度，在對應於保守社會的語言（例如波蘭語）中較高，而在僅用於自由社會的語言（例如瑞典語）中較低。此結果提供了 GPT 模型中訓練資料偏見的有力證據。其次，GPT-3.5 中觀察到的跨語言差異在 GPT-4 中仍然存在，儘管 GPT-4 由於 OpenAI 的篩選政策而顯著地更為自由。我們的重點是，即使這會犧牲訓練資料的大小，生成式模型訓練也必須專注於高品質、經過整理的資料集，以減少偏見。訓練後篩選回應只會引入新的偏見，並不會消除潛在的訓練偏見。", "author": "Christina Walker et.al.", "authors": "Christina Walker, Joan C. Timoneda", "id": "2409.06043v1", "paper_url": "http://arxiv.org/abs/2409.06043v1", "repo": "null"}}