{"2502.13619": {"publish_time": "2025-02-19", "title": "Complex Ontology Matching with Large Language Model Embeddings", "paper_summary": "Ontology, and more broadly, Knowledge Graph Matching is a challenging task in\nwhich expressiveness has not been fully addressed. Despite the increasing use\nof embeddings and language models for this task, approaches for generating\nexpressive correspondences still do not take full advantage of these models, in\nparticular, large language models (LLMs). This paper proposes to integrate LLMs\ninto an approach for generating expressive correspondences based on alignment\nneed and ABox-based relation discovery. The generation of correspondences is\nperformed by matching similar surroundings of instance sub-graphs. The\nintegration of LLMs results in different architectural modifications, including\nlabel similarity, sub-graph matching, and entity matching. The performance word\nembeddings, sentence embeddings, and LLM-based embeddings, was compared. The\nresults demonstrate that integrating LLMs surpasses all other models, enhancing\nthe baseline version of the approach with a 45\\% increase in F-measure.", "paper_summary_zh": "本体论，更广泛地说，知识图谱匹配是一项具有挑战性的任务，其中表达力尚未得到充分解决。尽管越来越多地使用嵌入和语言模型来完成此任务，但生成表达性对应关系的方法仍然没有充分利用这些模型，特别是大型语言模型 (LLM)。本文提出将 LLM 集成到一种基于对齐需求和基于 ABox 的关系发现来生成表达性对应关系的方法中。对应关系的生成是通过匹配实例子图的相似周围环境来执行的。LLM 的集成导致了不同的架构修改，包括标签相似性、子图匹配和实体匹配。比较了单词嵌入、句子嵌入和基于 LLM 的嵌入的性能。结果表明，集成 LLM 超越了所有其他模型，通过 F-measure 提高了 45% 的基准版本的方法。", "author": "Guilherme Sousa et.al.", "authors": "Guilherme Sousa, Rinaldo Lima, Cassia Trojahn", "id": "2502.13619v1", "paper_url": "http://arxiv.org/abs/2502.13619v1", "repo": "null"}}