{"2501.11877": {"publish_time": "2025-01-21", "title": "From Drafts to Answers: Unlocking LLM Potential via Aggregation Fine-Tuning", "paper_summary": "Scaling data and model size has been proven effective for boosting the\nperformance of large language models. In addition to training-time scaling,\nrecent studies have revealed that increasing test-time computational resources\ncan further improve performance. In this work, we introduce Aggregation\nFine-Tuning (AFT), a supervised finetuning paradigm where the model learns to\nsynthesize multiple draft responses, referred to as proposals, into a single,\nrefined answer, termed aggregation. At inference time, a propose-and-aggregate\nstrategy further boosts performance by iteratively generating proposals and\naggregating them. Empirical evaluations on benchmark datasets show that\nAFT-trained models substantially outperform standard SFT. Notably, an AFT\nmodel, fine-tuned from Llama3.1-8B-Base with only 64k data, achieves a 41.3% LC\nwin rate on AlpacaEval 2, surpassing significantly larger LLMs such as\nLlama3.1-405B-Instruct and GPT4. By combining sequential refinement and\nparallel sampling, the propose-and-aggregate framework scales inference-time\ncomputation in a flexible manner. Overall, These findings position AFT as a\npromising approach to unlocking additional capabilities of LLMs without\nresorting to increasing data volume or model size.", "paper_summary_zh": "擴展資料和模型大小已被證明能有效提升大型語言模型的效能。除了訓練時間的擴展，最近的研究顯示，增加測試時間的運算資源能進一步提升效能。在這項工作中，我們引入了聚合微調 (AFT)，一種監督式微調範例，其中模型學習將多個草稿回應（稱為提案）合成為一個單一的精緻答案，稱為聚合。在推論時間，一種提出和聚合策略通過反覆生成提案並將它們聚合起來進一步提升效能。基準資料集上的經驗評估顯示，AFT 訓練的模型明顯優於標準 SFT。值得注意的是，一個 AFT 模型，僅使用 64k 資料從 Llama3.1-8B-Base 微調，在 AlpacaEval 2 上實現了 41.3% 的 LC 勝率，超過了顯著更大的 LLM，例如 Llama3.1-405B-Instruct 和 GPT4。通過結合順序精煉和並行採樣，提出和聚合框架以靈活的方式擴展了推論時間的運算。總體而言，這些發現將 AFT 定位為一種有希望的方法，可以在不增加資料量或模型大小的情況下釋放 LLM 的額外功能。", "author": "Yafu Li et.al.", "authors": "Yafu Li, Zhilin Wang, Tingchen Fu, Ganqu Cui, Sen Yang, Yu Cheng", "id": "2501.11877v1", "paper_url": "http://arxiv.org/abs/2501.11877v1", "repo": "https://github.com/linzwcs/aft"}}