{"2501.11852": {"publish_time": "2025-01-21", "title": "Cross-Entropy Attacks to Language Models via Rare Event Simulation", "paper_summary": "Black-box textual adversarial attacks are challenging due to the lack of\nmodel information and the discrete, non-differentiable nature of text. Existing\nmethods often lack versatility for attacking different models, suffer from\nlimited attacking performance due to the inefficient optimization with word\nsaliency ranking, and frequently sacrifice semantic integrity to achieve better\nattack outcomes. This paper introduces a novel approach to textual adversarial\nattacks, which we call Cross-Entropy Attacks (CEA), that uses Cross-Entropy\noptimization to address the above issues. Our CEA approach defines adversarial\nobjectives for both soft-label and hard-label settings and employs CE\noptimization to identify optimal replacements. Through extensive experiments on\ndocument classification and language translation problems, we demonstrate that\nour attack method excels in terms of attacking performance, imperceptibility,\nand sentence quality.", "paper_summary_zh": "黑盒文本对抗攻擊由於缺乏模型資訊以及文字的離散、不可微分的特性，因此具有挑戰性。現有方法通常缺乏攻擊不同模型的多功能性，由於使用字詞顯著性排名而導致攻擊效能有限，且經常犧牲語意完整性以達成更好的攻擊結果。本文提出了一種新的文本對抗攻擊方法，我們稱之為交叉熵攻擊 (CEA)，它使用交叉熵最佳化來解決上述問題。我們的 CEA 方法定義了軟標籤和硬標籤設定的對抗目標，並採用 CE 最佳化來識別最佳替換。透過文件分類和語言翻譯問題的廣泛實驗，我們證明我們的攻擊方法在攻擊效能、難以察覺性和句子品質方面表現優異。", "author": "Mingze Ni et.al.", "authors": "Mingze Ni, Yongshun Gong, Wei Liu", "id": "2501.11852v1", "paper_url": "http://arxiv.org/abs/2501.11852v1", "repo": "null"}}