{"2501.09838": {"publish_time": "2025-01-16", "title": "CrossModalityDiffusion: Multi-Modal Novel View Synthesis with Unified Intermediate Representation", "paper_summary": "Geospatial imaging leverages data from diverse sensing modalities-such as EO,\nSAR, and LiDAR, ranging from ground-level drones to satellite views. These\nheterogeneous inputs offer significant opportunities for scene understanding\nbut present challenges in interpreting geometry accurately, particularly in the\nabsence of precise ground truth data. To address this, we propose\nCrossModalityDiffusion, a modular framework designed to generate images across\ndifferent modalities and viewpoints without prior knowledge of scene geometry.\nCrossModalityDiffusion employs modality-specific encoders that take multiple\ninput images and produce geometry-aware feature volumes that encode scene\nstructure relative to their input camera positions. The space where the feature\nvolumes are placed acts as a common ground for unifying input modalities. These\nfeature volumes are overlapped and rendered into feature images from novel\nperspectives using volumetric rendering techniques. The rendered feature images\nare used as conditioning inputs for a modality-specific diffusion model,\nenabling the synthesis of novel images for the desired output modality. In this\npaper, we show that jointly training different modules ensures consistent\ngeometric understanding across all modalities within the framework. We validate\nCrossModalityDiffusion's capabilities on the synthetic ShapeNet cars dataset,\ndemonstrating its effectiveness in generating accurate and consistent novel\nviews across multiple imaging modalities and perspectives.", "paper_summary_zh": "地理空間影像利用來自不同感測方式的資料，例如 EO、SAR 和 LiDAR，範圍從地面無人機到衛星影像。這些異質輸入為場景理解提供了顯著的機會，但在準確解讀幾何形狀時會產生挑戰，特別是在缺乏精確地面真實資料的情況下。為了解決這個問題，我們提出 CrossModalityDiffusion，這是一個模組化架構，旨在跨不同方式和觀點生成影像，而無需事先了解場景幾何形狀。CrossModalityDiffusion 使用特定於方式的編碼器，它會擷取多個輸入影像，並產生具有幾何感知特徵量的特徵量，這些特徵量會根據其輸入相機位置對場景結構進行編碼。放置特徵量的空間作為統一輸入方式的共同基礎。這些特徵量會重疊並使用體積渲染技術從新觀點渲染成特徵影像。渲染的特徵影像用作特定於方式的擴散模型的條件輸入，從而能夠為所需的輸出方式合成新影像。在本文中，我們展示了聯合訓練不同模組可確保架構內所有方式的一致幾何理解。我們在合成 ShapeNet 汽車資料集上驗證了 CrossModalityDiffusion 的功能，展示了其跨多種影像方式和觀點生成準確且一致的新觀點的有效性。", "author": "Alex Berian et.al.", "authors": "Alex Berian, Daniel Brignac, JhihYang Wu, Natnael Daba, Abhijit Mahalanobis", "id": "2501.09838v1", "paper_url": "http://arxiv.org/abs/2501.09838v1", "repo": "null"}}