{"2406.07515": {"publish_time": "2024-06-11", "title": "Beyond Model Collapse: Scaling Up with Synthesized Data Requires Reinforcement", "paper_summary": "Synthesized data from generative models is increasingly considered as an\nalternative to human-annotated data for fine-tuning Large Language Models. This\nraises concerns about model collapse: a drop in performance of models\nfine-tuned on generated data. Considering that it is easier for both humans and\nmachines to tell between good and bad examples than to generate high-quality\nsamples, we investigate the use of feedback on synthesized data to prevent\nmodel collapse. We derive theoretical conditions under which a Gaussian mixture\nclassification model can achieve asymptotically optimal performance when\ntrained on feedback-augmented synthesized data, and provide supporting\nsimulations for finite regimes. We illustrate our theoretical predictions on\ntwo practical problems: computing matrix eigenvalues with transformers and news\nsummarization with large language models, which both undergo model collapse\nwhen trained on model-generated data. We show that training from\nfeedback-augmented synthesized data, either by pruning incorrect predictions or\nby selecting the best of several guesses, can prevent model collapse,\nvalidating popular approaches like RLHF.", "paper_summary_zh": "合成資料來自生成模型，越來越被視為用於微調大型語言模型的真人標註資料的替代方案。這引起了模型崩潰的擔憂：在生成資料上微調模型的效能下降。考慮到人類和機器比生成高品質範例更容易分辨好壞範例，我們研究在合成資料上使用回饋以防止模型崩潰。我們推導出高斯混合分類模型在訓練於回饋增強合成資料時，可以在漸近最佳效能下達成的理論條件，並提供有限狀態的支援模擬。我們在兩個實際問題上說明我們的理論預測：使用轉換器計算矩陣特徵值和使用大型語言模型進行新聞摘要，這兩個問題在訓練於模型生成的資料時都會發生模型崩潰。我們表明，透過修剪不正確的預測或選擇多個猜測中的最佳猜測，從回饋增強合成資料進行訓練可以防止模型崩潰，驗證了 RLHF 等熱門方法。", "author": "Yunzhen Feng et.al.", "authors": "Yunzhen Feng, Elvis Dohmatob, Pu Yang, Francois Charton, Julia Kempe", "id": "2406.07515v1", "paper_url": "http://arxiv.org/abs/2406.07515v1", "repo": "null"}}