{"2411.15982": {"publish_time": "2024-11-24", "title": "Anda: Unlocking Efficient LLM Inference with a Variable-Length Grouped Activation Data Format", "paper_summary": "The widely-used, weight-only quantized large language models (LLMs), which\nleverage low-bit integer (INT) weights and retain floating-point (FP)\nactivations, reduce storage requirements while maintaining accuracy. However,\nthis shifts the energy and latency bottlenecks towards the FP activations that\nare associated with costly memory accesses and computations. Existing LLM\naccelerators focus primarily on computation optimizations, overlooking the\npotential of jointly optimizing FP computations and data movement, particularly\nfor the dominant FP-INT GeMM operations in LLM inference.\n  To address these challenges, we investigate the sensitivity of activation\nprecision across various LLM modules and its impact on overall model accuracy.\nBased on our findings, we first propose the Anda data type: an adaptive data\nformat with group-shared exponent bits and dynamic mantissa bit allocation.\nSecondly, we develop an iterative post-training adaptive precision search\nalgorithm that optimizes the bit-width for different LLM modules to balance\nmodel accuracy, energy efficiency, and inference speed. Lastly, a suite of\nhardware optimization techniques is proposed to maximally exploit the benefits\nof the Anda format. These include a bit-plane-based data organization scheme,\nAnda-enhanced processing units with bit-serial computation, and a runtime\nbit-plane Anda compressor to simultaneously optimize storage, computation, and\nmemory footprints. Our evaluations on FPINT GeMM operations show that Anda\nachieves a 2.4x speedup, 4.0x area efficiency, and 3.1x energy efficiency\nimprovement on average for popular LLMs including OPT, LLaMA, and LLaMA-2\nseries over the GPU-like FP-FP baseline. Anda demonstrates strong adaptability\nacross various application scenarios, accuracy requirements, and system\nperformance, enabling efficient LLM inference across a wide range of deployment\nscenarios.", "paper_summary_zh": "廣泛使用的、僅權重量化的巨量語言模型 (LLM) 利用低位元整數 (INT) 權重並保留浮點 (FP) 激活，在維持精準度的同時降低儲存需求。然而，這將能量和延遲瓶頸轉移到與昂貴的記憶體存取和運算相關的 FP 激活。現有的 LLM 加速器主要專注於運算最佳化，忽視了聯合最佳化 FP 運算和資料移動的潛力，特別是針對 LLM 推論中佔主導地位的 FP-INT GeMM 運算。\n為了應對這些挑戰，我們探討了各種 LLM 模組中激活精度的敏感性及其對整體模型精度的影響。根據我們的發現，我們首先提出 Anda 資料類型：一種具有群組共用指數位元和動態尾數位元配置的自適應資料格式。其次，我們開發了一種反覆訓練後自適應精度的搜尋演算法，針對不同的 LLM 模組最佳化位元寬度，以平衡模型精度、能源效率和推論速度。最後，提出了一套硬體最佳化技術，以最大程度地利用 Anda 格式的優點。這些技術包括基於位元平面的資料組織架構、具有位元序列運算的 Anda 增強處理單元，以及同時最佳化儲存、運算和記憶體佔用空間的執行時期位元平面 Anda 壓縮器。我們對 FPINT GeMM 運算的評估顯示，與類 GPU 的 FP-FP 基準相比，Anda 對包括 OPT、LLaMA 和 LLaMA-2 系列在內的熱門 LLM 平均可實現 2.4 倍的速度提升、4.0 倍的面積效率和 3.1 倍的能源效率提升。Anda 在各種應用場景、精度要求和系統效能中展現出強大的適應性，可在廣泛的部署場景中實現高效的 LLM 推論。", "author": "Chao Fang et.al.", "authors": "Chao Fang, Man Shi, Robin Geens, Arne Symons, Zhongfeng Wang, Marian Verhelst", "id": "2411.15982v1", "paper_url": "http://arxiv.org/abs/2411.15982v1", "repo": "null"}}