{"2412.07249": {"publish_time": "2024-12-10", "title": "Buster: Incorporating Backdoor Attacks into Text Encoder to Mitigate NSFW Content Generation", "paper_summary": "In the digital age, the proliferation of deep learning models has led to\nsignificant concerns about the generation of Not Safe for Work (NSFW) content.\nExisting defense methods primarily involve model fine-tuning and post-hoc\ncontent moderation. However, these approaches often lack scalability in\neliminating harmful content, degrade the quality of benign image generation, or\nincur high inference costs. To tackle these challenges, we propose an\ninnovative framework called \\textbf{Buster}, which injects backdoor attacks\ninto the text encoder to prevent NSFW content generation. Specifically, Buster\nleverages deep semantic information rather than explicit prompts as triggers,\nredirecting NSFW prompts towards targeted benign prompts. This approach\ndemonstrates exceptional resilience and scalability in mitigating NSFW content.\nRemarkably, Buster fine-tunes the text encoder of Text-to-Image models within\njust five minutes, showcasing high efficiency. Our extensive experiments reveal\nthat Buster outperforms all other baselines, achieving superior NSFW content\nremoval rate while preserving the quality of harmless images.", "paper_summary_zh": "在數位時代，深度學習模型的激增已導致對產生不適宜工作 (NSFW) 內容的重大疑慮。現有的防禦方法主要涉及模型微調和事後內容審核。然而，這些方法在消除有害內容時通常缺乏可擴充性，會降低良性影像產生的品質，或產生高昂的推論成本。為了應對這些挑戰，我們提出一個名為 \\textbf{Buster} 的創新架構，它將後門攻擊注入文字編碼器以防止產生 NSFW 內容。具體來說，Buster 利用深度語義資訊，而不是明確的提示作為觸發，將 NSFW 提示重新導向到目標良性提示。這種方法在減輕 NSFW 內容方面展現出卓越的韌性和可擴充性。值得注意的是，Buster 在短短五分鐘內微調文字轉影像模型的文字編碼器，展現出高效率。我們廣泛的實驗表明，Buster 優於所有其他基準，在保留無害影像品質的同時，達到優異的 NSFW 內容移除率。", "author": "Xin Zhao et.al.", "authors": "Xin Zhao, Xiaojun Chen, Yuexin Xuan, Zhendong Zhao", "id": "2412.07249v1", "paper_url": "http://arxiv.org/abs/2412.07249v1", "repo": "null"}}