{"2501.05855": {"publish_time": "2025-01-10", "title": "ConSim: Measuring Concept-Based Explanations' Effectiveness with Automated Simulatability", "paper_summary": "Concept-based explanations work by mapping complex model computations to\nhuman-understandable concepts. Evaluating such explanations is very difficult,\nas it includes not only the quality of the induced space of possible concepts\nbut also how effectively the chosen concepts are communicated to users.\nExisting evaluation metrics often focus solely on the former, neglecting the\nlatter. We introduce an evaluation framework for measuring concept explanations\nvia automated simulatability: a simulator's ability to predict the explained\nmodel's outputs based on the provided explanations. This approach accounts for\nboth the concept space and its interpretation in an end-to-end evaluation.\nHuman studies for simulatability are notoriously difficult to enact,\nparticularly at the scale of a wide, comprehensive empirical evaluation (which\nis the subject of this work). We propose using large language models (LLMs) as\nsimulators to approximate the evaluation and report various analyses to make\nsuch approximations reliable. Our method allows for scalable and consistent\nevaluation across various models and datasets. We report a comprehensive\nempirical evaluation using this framework and show that LLMs provide consistent\nrankings of explanation methods. Code available at\nhttps://github.com/AnonymousConSim/ConSim", "paper_summary_zh": "概念型解釋透過將複雜的模型運算對應到人類可以理解的概念來運作。評估這種解釋非常困難，因為它不僅包括可能的概念誘發空間的品質，還包括選擇的概念有效傳達給使用者的程度。現有的評估指標通常只關注前者，而忽略後者。我們引入一個評估架構，透過自動模擬性來衡量概念解釋：模擬器根據提供的解釋預測已解釋模型的輸出。這種方法同時考量了概念空間及其在端到端評估中的詮釋。眾所周知，模擬性的人類研究難以制定，特別是在廣泛、全面的實證評估的規模上（這是這項工作的重點）。我們建議使用大型語言模型 (LLM) 作為模擬器來近似評估並報告各種分析，以使此類近似值更可靠。我們的模型允許跨各種模型和資料集進行可擴充且一致的評估。我們使用這個架構報告了一個全面的實證評估，並顯示 LLM 提供了一致的解釋方法排名。程式碼可在 https://github.com/AnonymousConSim/ConSim 取得", "author": "Antonin Poché et.al.", "authors": "Antonin Poché, Alon Jacovi, Agustin Martin Picard, Victor Boutin, Fanny Jourdan", "id": "2501.05855v1", "paper_url": "http://arxiv.org/abs/2501.05855v1", "repo": "https://github.com/anonymousconsim/consim"}}