{"2406.07016": {"publish_time": "2024-06-11", "title": "Delving into ChatGPT usage in academic writing through excess vocabulary", "paper_summary": "Recent large language models (LLMs) can generate and revise text with\nhuman-level performance, and have been widely commercialized in systems like\nChatGPT. These models come with clear limitations: they can produce inaccurate\ninformation, reinforce existing biases, and be easily misused. Yet, many\nscientists have been using them to assist their scholarly writing. How\nwide-spread is LLM usage in the academic literature currently? To answer this\nquestion, we use an unbiased, large-scale approach, free from any assumptions\non academic LLM usage. We study vocabulary changes in 14 million PubMed\nabstracts from 2010-2024, and show how the appearance of LLMs led to an abrupt\nincrease in the frequency of certain style words. Our analysis based on excess\nwords usage suggests that at least 10% of 2024 abstracts were processed with\nLLMs. This lower bound differed across disciplines, countries, and journals,\nand was as high as 30% for some PubMed sub-corpora. We show that the appearance\nof LLM-based writing assistants has had an unprecedented impact in the\nscientific literature, surpassing the effect of major world events such as the\nCovid pandemic.", "paper_summary_zh": "最近的大型语言模型 (LLM) 能够以人类级别的表现生成和修改文本，并且已在 ChatGPT 等系统中得到广泛的商业化应用。这些模型带有明显的限制：它们可能会产生不准确的信息、强化现有偏见，并且很容易被滥用。然而，许多科学家一直在使用它们来辅助他们的学术写作。目前 LLM 在学术文献中的使用有多广泛？为了回答这个问题，我们使用了一种公正、大规模的方法，不受任何关于学术 LLM 使用的假设的影响。我们研究了 2010-2024 年间 1400 万篇 PubMed 摘要中的词汇变化，并展示了 LLM 的出现如何导致某些风格词的频率急剧增加。我们基于超额词语使用的分析表明，至少 10% 的 2024 年摘要是用 LLM 处理过的。这个下限因学科、国家和期刊而异，对于一些 PubMed 子语料库而言，这个下限高达 30%。我们表明，基于 LLM 的写作助手的出现对科学文献产生了前所未有的影响，超过了 Covid 大流行等重大世界事件的影响。", "author": "Dmitry Kobak et.al.", "authors": "Dmitry Kobak, Rita González Márquez, Emőke-Ágnes Horvát, Jan Lause", "id": "2406.07016v1", "paper_url": "http://arxiv.org/abs/2406.07016v1", "repo": "null"}}