{"2409.02069": {"publish_time": "2024-09-03", "title": "A Deployed Online Reinforcement Learning Algorithm In An Oral Health Clinical Trial", "paper_summary": "Dental disease is a prevalent chronic condition associated with substantial\nfinancial burden, personal suffering, and increased risk of systemic diseases.\nDespite widespread recommendations for twice-daily tooth brushing, adherence to\nrecommended oral self-care behaviors remains sub-optimal due to factors such as\nforgetfulness and disengagement. To address this, we developed Oralytics, a\nmHealth intervention system designed to complement clinician-delivered\npreventative care for marginalized individuals at risk for dental disease.\nOralytics incorporates an online reinforcement learning algorithm to determine\noptimal times to deliver intervention prompts that encourage oral self-care\nbehaviors. We have deployed Oralytics in a registered clinical trial. The\ndeployment required careful design to manage challenges specific to the\nclinical trials setting in the U.S. In this paper, we (1) highlight key design\ndecisions of the RL algorithm that address these challenges and (2) conduct a\nre-sampling analysis to evaluate algorithm design decisions. A second phase\n(randomized control trial) of Oralytics is planned to start in spring 2025.", "paper_summary_zh": "牙科疾病是一種普遍的慢性疾病，與大量的經濟負擔、個人痛苦和增加的全身疾病風險有關。儘管普遍建議每天刷牙兩次，但由於健忘和脫離等因素，對建議的口腔自我保健行為的依從性仍然低於最佳水平。為了解決這個問題，我們開發了 Oralytics，一個 mHealth 介入系統，旨在補充臨床醫生提供的預防保健，以預防有牙科疾病風險的邊緣化個人。Oralytics 結合了一個在線強化學習演算法，以確定提供介入提示的最佳時間，這些提示鼓勵口腔自我保健行為。我們已在註冊的臨床試驗中部署了 Oralytics。該部署需要仔細的設計來管理美國臨床試驗設置中具體的挑戰。在本文中，我們（1）重點介紹了解決這些挑戰的 RL 演算法的關鍵設計決策，以及（2）進行重新抽樣分析以評估演算法設計決策。Oralytics 的第二階段（隨機對照試驗）計劃於 2025 年春季開始。", "author": "Anna L. Trella et.al.", "authors": "Anna L. Trella, Kelly W. Zhang, Hinal Jajal, Inbal Nahum-Shani, Vivek Shetty, Finale Doshi-Velez, Susan A. Murphy", "id": "2409.02069v1", "paper_url": "http://arxiv.org/abs/2409.02069v1", "repo": "null"}}