{"2410.07919": {"publish_time": "2024-10-10", "title": "InstructBioMol: Advancing Biomolecule Understanding and Design Following Human Instructions", "paper_summary": "Understanding and designing biomolecules, such as proteins and small\nmolecules, is central to advancing drug discovery, synthetic biology, and\nenzyme engineering. Recent breakthroughs in Artificial Intelligence (AI) have\nrevolutionized biomolecular research, achieving remarkable accuracy in\nbiomolecular prediction and design. However, a critical gap remains between\nAI's computational power and researchers' intuition, using natural language to\nalign molecular complexity with human intentions. Large Language Models (LLMs)\nhave shown potential to interpret human intentions, yet their application to\nbiomolecular research remains nascent due to challenges including specialized\nknowledge requirements, multimodal data integration, and semantic alignment\nbetween natural language and biomolecules. To address these limitations, we\npresent InstructBioMol, a novel LLM designed to bridge natural language and\nbiomolecules through a comprehensive any-to-any alignment of natural language,\nmolecules, and proteins. This model can integrate multimodal biomolecules as\ninput, and enable researchers to articulate design goals in natural language,\nproviding biomolecular outputs that meet precise biological needs. Experimental\nresults demonstrate InstructBioMol can understand and design biomolecules\nfollowing human instructions. Notably, it can generate drug molecules with a\n10% improvement in binding affinity and design enzymes that achieve an ESP\nScore of 70.4, making it the only method to surpass the enzyme-substrate\ninteraction threshold of 60.0 recommended by the ESP developer. This highlights\nits potential to transform real-world biomolecular research.", "paper_summary_zh": "<paragraph>了解和設計生物分子（例如蛋白質和小分子）對於推進藥物發現、合成生物學和酶工程至關重要。最近人工智能 (AI) 的突破徹底改變了生物分子研究，在生物分子預測和設計方面取得了顯著的準確性。然而，AI 的計算能力和研究人員的直覺之間仍然存在關鍵差距，使用自然語言將分子複雜性與人類意圖對齊。大型語言模型 (LLM) 已顯示出解釋人類意圖的潛力，但由於包括專業知識要求、多模式數據整合以及自然語言和生物分子之間的語義對齊在內的挑戰，它們在生物分子研究中的應用仍然處於萌芽階段。為了解決這些限制，我們提出了 InstructBioMol，這是一種新穎的 LLM，旨在通過自然語言、分子和蛋白質的全面任意對齊來橋接自然語言和生物分子。此模型可以整合多模式生物分子作為輸入，並使研究人員能夠用自然語言表達設計目標，提供滿足精確生物需求的生物分子輸出。實驗結果表明，InstructBioMol 可以理解和設計遵循人類指令的生物分子。值得注意的是，它可以生成結合親和力提高 10% 的藥物分子，並設計出 ESP 得分達到 70.4 的酶，使其成為唯一一種超越 ESP 開發人員推薦的 60.0 酶底物相互作用閾值的技術。這突顯了其轉變現實世界生物分子研究的潛力。</paragraph>", "author": "Xiang Zhuang et.al.", "authors": "Xiang Zhuang, Keyan Ding, Tianwen Lyu, Yinuo Jiang, Xiaotong Li, Zhuoyi Xiang, Zeyuan Wang, Ming Qin, Kehua Feng, Jike Wang, Qiang Zhang, Huajun Chen", "id": "2410.07919v1", "paper_url": "http://arxiv.org/abs/2410.07919v1", "repo": "null"}}