{"2409.09784": {"publish_time": "2024-09-15", "title": "Enhancing Lesion Segmentation in PET/CT Imaging with Deep Learning and Advanced Data Preprocessing Techniques", "paper_summary": "The escalating global cancer burden underscores the critical need for precise\ndiagnostic tools in oncology. This research employs deep learning to enhance\nlesion segmentation in PET/CT imaging, utilizing a dataset of 900 whole-body\nFDG-PET/CT and 600 PSMA-PET/CT studies from the AutoPET challenge III. Our\nmethodical approach includes robust preprocessing and data augmentation\ntechniques to ensure model robustness and generalizability. We investigate the\ninfluence of non-zero normalization and modifications to the data augmentation\npipeline, such as the introduction of RandGaussianSharpen and adjustments to\nthe Gamma transform parameter. This study aims to contribute to the\nstandardization of preprocessing and augmentation strategies in PET/CT imaging,\npotentially improving the diagnostic accuracy and the personalized management\nof cancer patients. Our code will be open-sourced and available at\nhttps://github.com/jiayiliu-pku/DC2024.", "paper_summary_zh": "全球癌症负担不断加重，这凸显了肿瘤学中对精确诊断工具的关键需求。本研究采用深度学习来增强 PET/CT 成像中的病灶分割，利用来自 AutoPET 挑战 III 的 900 个全身 FDG-PET/CT 和 600 个 PSMA-PET/CT 研究的数据集。我们的方法论方法包括鲁棒的预处理和数据增强技术，以确保模型的鲁棒性和可推广性。我们研究了非零归一化和数据增强管道修改的影响，例如引入 RandGaussianSharpen 和调整 Gamma 转换参数。本研究旨在为 PET/CT 成像中的预处理和增强策略的标准化做出贡献，从而有可能提高癌症患者的诊断准确性和个性化管理。我们的代码将开源，可在 https://github.com/jiayiliu-pku/DC2024 获得。", "author": "Jiayi Liu et.al.", "authors": "Jiayi Liu, Qiaoyi Xue, Youdan Feng, Tianming Xu, Kaixin Shen, Chuyun Shen, Yuhang Shi", "id": "2409.09784v1", "paper_url": "http://arxiv.org/abs/2409.09784v1", "repo": "https://github.com/jiayiliu-pku/dc2024"}}