{"2411.04585": {"publish_time": "2024-11-07", "title": "The State and Fate of Summarization Datasets", "paper_summary": "Automatic summarization has consistently attracted attention, due to its\nversatility and wide application in various downstream tasks. Despite its\npopularity, we find that annotation efforts have largely been disjointed, and\nhave lacked common terminology. Consequently, it is challenging to discover\nexisting resources or identify coherent research directions. To address this,\nwe survey a large body of work spanning 133 datasets in over 100 languages,\ncreating a novel ontology covering sample properties, collection methods and\ndistribution. With this ontology we make key observations, including the lack\nin accessible high-quality datasets for low-resource languages, and the field's\nover-reliance on the news domain and on automatically collected distant\nsupervision. Finally, we make available a web interface that allows users to\ninteract and explore our ontology and dataset collection, as well as a template\nfor a summarization data card, which can be used to streamline future research\ninto a more coherent body of work.", "paper_summary_zh": "自動摘要一直備受關注，因為它具有多功能性，且廣泛應用於各種下游任務。儘管它很受歡迎，但我們發現註解工作在很大程度上是脫節的，並且缺乏通用的術語。因此，很難發現現有資源或確定連貫的研究方向。為了解決這個問題，我們調查了涵蓋 100 多種語言的 133 個資料集的大量工作，創建了一個涵蓋範例屬性、收集方法和分佈的新穎本體論。有了這個本體論，我們做出了關鍵觀察，包括缺乏低資源語言的可訪問高品質資料集，以及該領域過度依賴新聞領域和自動收集的遠程監督。最後，我們提供了一個 Web 介面，允許使用者互動並探索我們的本體論和資料集收集，以及一個摘要資料卡範本，可用於簡化未來研究，使其成為一個更連貫的工作主體。", "author": "Noam Dahan et.al.", "authors": "Noam Dahan, Gabriel Stanovsky", "id": "2411.04585v1", "paper_url": "http://arxiv.org/abs/2411.04585v1", "repo": "null"}}