{"2410.07671": {"publish_time": "2024-10-10", "title": "DISCO: A Hierarchical Disentangled Cognitive Diagnosis Framework for Interpretable Job Recommendation", "paper_summary": "The rapid development of online recruitment platforms has created\nunprecedented opportunities for job seekers while concurrently posing the\nsignificant challenge of quickly and accurately pinpointing positions that\nalign with their skills and preferences. Job recommendation systems have\nsignificantly alleviated the extensive search burden for job seekers by\noptimizing user engagement metrics, such as clicks and applications, thus\nachieving notable success. In recent years, a substantial amount of research\nhas been devoted to developing effective job recommendation models, primarily\nfocusing on text-matching based and behavior modeling based methods. While\nthese approaches have realized impressive outcomes, it is imperative to note\nthat research on the explainability of recruitment recommendations remains\nprofoundly unexplored. To this end, in this paper, we propose DISCO, a\nhierarchical Disentanglement based Cognitive diagnosis framework, aimed at\nflexibly accommodating the underlying representation learning model for\neffective and interpretable job recommendations. Specifically, we first design\na hierarchical representation disentangling module to explicitly mine the\nhierarchical skill-related factors implied in hidden representations of job\nseekers and jobs. Subsequently, we propose level-aware association modeling to\nenhance information communication and robust representation learning both\ninter- and intra-level, which consists of the interlevel knowledge influence\nmodule and the level-wise contrastive learning. Finally, we devise an\ninteraction diagnosis module incorporating a neural diagnosis function for\neffectively modeling the multi-level recruitment interaction process between\njob seekers and jobs, which introduces the cognitive measurement theory.", "paper_summary_zh": "線上招募平台的快速發展為求職者創造了前所未有的機會，同時也帶來了快速且準確找出與其技能和偏好相符職位的重大挑戰。求職推薦系統透過最佳化使用者參與度指標（例如點擊和應徵），大幅減輕求職者的廣泛搜尋負擔，因而獲得顯著的成功。近年來，大量研究致力於開發有效的求職推薦模型，主要著重於基於文字比對和基於行為建模的方法。儘管這些方法已實現令人印象深刻的成果，但必須注意的是，對於招募推薦的可解釋性研究仍未深入探討。為此，我們在本文中提出 DISCO，一個基於階層式解開的認知診斷架構，旨在靈活容納基礎表徵學習模型，以提供有效且可解釋的求職推薦。具體來說，我們首先設計一個階層式表徵解開模組，以明確找出隱含在求職者和職務的隱藏表徵中的階層式技能相關因素。隨後，我們提出層級感知關聯建模，以增強資訊傳遞和強健表徵學習，包括層級間知識影響模組和層級對比學習。最後，我們設計了一個互動診斷模組，結合神經診斷函數，以有效建模求職者與職務之間的多層次招募互動過程，並引入認知測量理論。", "author": "Xiaoshan Yu et.al.", "authors": "Xiaoshan Yu, Chuan Qin, Qi Zhang, Chen Zhu, Haiping Ma, Xingyi Zhang, Hengshu Zhu", "id": "2410.07671v1", "paper_url": "http://arxiv.org/abs/2410.07671v1", "repo": "null"}}