{"2411.18294": {"publish_time": "2024-11-27", "title": "Aligning Pre-trained Models for Spoken Language Translation", "paper_summary": "This paper investigates a novel approach to end-to-end speech translation\n(ST) based on aligning frozen pre-trained automatic speech recognition (ASR)\nand machine translation (MT) models via a small connector module (Q-Former, our\nSubsampler-Transformer Encoder). This connector bridges the gap between the\nspeech and text modalities, transforming ASR encoder embeddings into the latent\nrepresentation space of the MT encoder while being the only part of the system\noptimized during training. Experiments are conducted on the How2\nEnglish-Portuguese dataset as we investigate the alignment approach in a\nsmall-scale scenario focusing on ST. While keeping the size of the connector\nmodule constant and small in comparison ( < 5% of the size of the larger\naligned models), increasing the size and capability of the foundation ASR and\nMT models universally improves translation results. We also find that the\nconnectors can serve as domain adapters for the foundation MT models,\nsignificantly improving translation performance in the aligned ST setting. We\nconclude that this approach represents a viable and scalable approach to\ntraining end-to-end ST systems.", "paper_summary_zh": "本文探討了一種端對端語音翻譯 (ST) 的新方法，此方法是透過一個小型連接模組 (Q-Former，我們的子採樣器轉換器編碼器) 來對齊凍結的預訓練自動語音辨識 (ASR) 和機器翻譯 (MT) 模型。此連接器彌補了語音和文字模態之間的差距，將 ASR 編碼器嵌入轉換成 MT 編碼器的潛在表示空間，同時成為訓練期間系統中唯一最佳化的部分。我們在 How2 英葡資料集上進行實驗，因為我們在小規模場景中探討對齊方法，專注於 ST。在保持連接器模組大小恆定且較小 (小於較大對齊模型大小的 5%) 的同時，增加基礎 ASR 和 MT 模型的大小和功能普遍改善了翻譯結果。我們還發現連接器可以用作基礎 MT 模型的領域適配器，大幅改善對齊 ST 設定中的翻譯效能。我們得出結論，這種方法代表一種可行且可擴充的方法，用於訓練端對端 ST 系統。", "author": "Šimon Sedláček et.al.", "authors": "Šimon Sedláček, Santosh Kesiraju, Alexander Polok, Jan Černocký", "id": "2411.18294v1", "paper_url": "http://arxiv.org/abs/2411.18294v1", "repo": "null"}}