{"2409.09009": {"publish_time": "2024-09-13", "title": "Optimizing Rare Word Accuracy in Direct Speech Translation with a Retrieval-and-Demonstration Approach", "paper_summary": "Direct speech translation (ST) models often struggle with rare words.\nIncorrect translation of these words can have severe consequences, impacting\ntranslation quality and user trust. While rare word translation is inherently\nchallenging for neural models due to sparse learning signals, real-world\nscenarios often allow access to translations of past recordings on similar\ntopics. To leverage these valuable resources, we propose a\nretrieval-and-demonstration approach to enhance rare word translation accuracy\nin direct ST models. First, we adapt existing ST models to incorporate\nretrieved examples for rare word translation, which allows the model to benefit\nfrom prepended examples, similar to in-context learning. We then develop a\ncross-modal (speech-to-speech, speech-to-text, text-to-text) retriever to\nlocate suitable examples. We demonstrate that standard ST models can be\neffectively adapted to leverage examples for rare word translation, improving\nrare word translation accuracy over the baseline by 17.6% with gold examples\nand 8.5% with retrieved examples. Moreover, our speech-to-speech retrieval\napproach outperforms other modalities and exhibits higher robustness to unseen\nspeakers. Our code is publicly available\n(https://github.com/SiqiLii/Retrieve-and-Demonstration-ST).", "paper_summary_zh": "直译 (ST) 模型通常难以处理罕见字词。\n这些字词翻译不正确可能会造成严重后果，影响翻译品质和使用者信任。虽然罕见字词翻译对神经模型来说本来就具有挑战性，因为学习信号稀疏，但现实世界的情境通常可以存取类似主题过去录音的翻译。为了善用这些有价值的资源，我们提出一种撷取与示范方法来提升直接 ST 模型中罕见字词翻译的准确度。首先，我们调整现有的 ST 模型，纳入罕见字词翻译的撷取范例，让模型能够受益于前置范例，类似于语境学习。然后，我们开发一个跨模态（语音转语音、语音转文字、文字转文字）撷取器来找出合适的范例。我们示范标准 ST 模型可以有效地调整来善用罕见字词翻译的范例，以黄金范例提升罕见字词翻译准确度 17.6%，以撷取范例提升 8.5%。此外，我们的语音转语音撷取方法优于其他模态，且对未见过的说话者展现出更高的稳健性。我们的代码已公开（https://github.com/SiqiLii/Retrieve-and-Demonstration-ST）。", "author": "Siqi Li et.al.", "authors": "Siqi Li, Danni Liu, Jan Niehues", "id": "2409.09009v1", "paper_url": "http://arxiv.org/abs/2409.09009v1", "repo": "https://github.com/siqilii/retrieve-and-demonstration-st"}}