{"2409.05028": {"publish_time": "2024-09-08", "title": "LLM-based Abstraction and Concretization for GUI Test Migration", "paper_summary": "GUI test migration aims to produce test cases with events and assertions to\ntest specific functionalities of a target app. Existing migration approaches\ntypically focus on the widget-mapping paradigm that maps widgets from source\napps to target apps. However, since different apps may implement the same\nfunctionality in different ways, direct mapping may result in incomplete or\nbuggy test cases, thus significantly impacting the effectiveness of testing\ntarget functionality and the practical applicability.\n  In this paper, we propose a new migration paradigm (i.e.,\nabstraction-concretization paradigm) that first abstracts the test logic for\nthe target functionality and then utilizes this logic to generate the concrete\nGUI test case. Furthermore, we introduce MACdroid, the first approach that\nmigrates GUI test cases based on this paradigm. Specifically, we propose an\nabstraction technique that utilizes source test cases from source apps\ntargeting the same functionality to extract a general test logic for that\nfunctionality. Then, we propose a concretization technique that utilizes the\ngeneral test logic to guide an LLM in generating the corresponding GUI test\ncase (including events and assertions) for the target app. We evaluate MACdroid\non two widely-used datasets (including 31 apps, 34 functionalities, and 123\ntest cases). On the FrUITeR dataset, the test cases generated by MACdroid\nsuccessfully test 64% of the target functionalities, improving the baselines by\n191%. On the Lin dataset, MACdroid successfully tests 75% of the target\nfunctionalities, outperforming the baselines by 42%. These results underscore\nthe effectiveness of MACdroid in GUI test migration.", "paper_summary_zh": "GUI 測試遷移旨在產生測試案例，其中包含事件和斷言，以測試目標應用程式的特定功能。現有的遷移方法通常專注於小工具對應範例，該範例會將小工具從來源應用程式對應到目標應用程式。然而，由於不同的應用程式可能會以不同的方式實作相同的功能，因此直接對應可能會導致測試案例不完整或有錯誤，從而顯著影響測試目標功能和實際適用性的有效性。\n在本文中，我們提出了一個新的遷移範例（即抽象化具體化範例），該範例首先抽象化目標功能的測試邏輯，然後利用此邏輯產生具體的 GUI 測試案例。此外，我們介紹了 MACdroid，這是第一個基於此範例遷移 GUI 測試案例的方法。具體來說，我們提出了一種抽象化技術，該技術利用來自針對相同功能的來源應用程式的來源測試案例，以提取該功能的一般測試邏輯。然後，我們提出了一種具體化技術，該技術利用一般測試邏輯來指導 LLM 為目標應用程式產生對應的 GUI 測試案例（包括事件和斷言）。我們在兩個廣泛使用的資料集（包括 31 個應用程式、34 個功能和 123 個測試案例）上評估 MACdroid。在 FrUITeR 資料集上，MACdroid 產生的測試案例成功測試了 64% 的目標功能，將基準提高了 191%。在 Lin 資料集上，MACdroid 成功測試了 75% 的目標功能，比基準高出 42%。這些結果強調了 MACdroid 在 GUI 測試遷移中的有效性。", "author": "Yakun Zhang et.al.", "authors": "Yakun Zhang, Chen Liu, Xiaofei Xie, Yun Lin, Jin Song Dong, Dan Hao, Lu Zhang", "id": "2409.05028v1", "paper_url": "http://arxiv.org/abs/2409.05028v1", "repo": "null"}}