{"2408.05024": {"publish_time": "2024-08-09", "title": "MIDI-to-Tab: Guitar Tablature Inference via Masked Language Modeling", "paper_summary": "Guitar tablatures enrich the structure of traditional music notation by\nassigning each note to a string and fret of a guitar in a particular tuning,\nindicating precisely where to play the note on the instrument. The problem of\ngenerating tablature from a symbolic music representation involves inferring\nthis string and fret assignment per note across an entire composition or\nperformance. On the guitar, multiple string-fret assignments are possible for\nmost pitches, which leads to a large combinatorial space that prevents\nexhaustive search approaches. Most modern methods use constraint-based dynamic\nprogramming to minimize some cost function (e.g.\\ hand position movement). In\nthis work, we introduce a novel deep learning solution to symbolic guitar\ntablature estimation. We train an encoder-decoder Transformer model in a masked\nlanguage modeling paradigm to assign notes to strings. The model is first\npre-trained on DadaGP, a dataset of over 25K tablatures, and then fine-tuned on\na curated set of professionally transcribed guitar performances. Given the\nsubjective nature of assessing tablature quality, we conduct a user study\namongst guitarists, wherein we ask participants to rate the playability of\nmultiple versions of tablature for the same four-bar excerpt. The results\nindicate our system significantly outperforms competing algorithms.", "paper_summary_zh": "吉他指法譜豐富了傳統樂譜的結構，方法是將每個音符分配給特定調音的吉他弦和品格，準確地指出在樂器上彈奏音符的位置。根據符號音樂表示法生成指法譜的問題涉及推斷整個樂曲或演奏中每個音符的這個弦和品格分配。在吉他上，大多數音高都可以有多個弦格分配，這導致一個龐大的組合空間，從而阻止了窮舉搜索方法。大多數現代方法使用基於約束的動態規劃來最小化某些成本函數（例如手部位置移動）。在這項工作中，我們引入了一種新的深度學習解決方案，用於符號吉他指法譜估計。我們在掩蔽語言建模範例中訓練了一個編碼器-解碼器 Transformer 模型，以將音符分配給弦。該模型首先在 DadaGP（一個包含超過 25K 個指法譜的數據集）上進行預訓練，然後在經過整理的一組專業轉錄的吉他演奏上進行微調。鑑於評估指法譜質量的主觀性，我們在吉他手之間進行了一項用戶研究，其中我們要求參與者對同一四小節選段的指法譜多個版本的可演奏性進行評分。結果表明，我們的系統顯著優於競爭演算法。", "author": "Drew Edwards et.al.", "authors": "Drew Edwards, Xavier Riley, Pedro Sarmento, Simon Dixon", "id": "2408.05024v1", "paper_url": "http://arxiv.org/abs/2408.05024v1", "repo": "null"}}