{"2501.01054": {"publish_time": "2025-01-02", "title": "Dynamic Scaling of Unit Tests for Code Reward Modeling", "paper_summary": "Current large language models (LLMs) often struggle to produce accurate\nresponses on the first attempt for complex reasoning tasks like code\ngeneration. Prior research tackles this challenge by generating multiple\ncandidate solutions and validating them with LLM-generated unit tests. The\nexecution results of unit tests serve as reward signals to identify correct\nsolutions. As LLMs always confidently make mistakes, these unit tests are not\nreliable, thereby diminishing the quality of reward signals. Motivated by the\nobservation that scaling the number of solutions improves LLM performance, we\nexplore the impact of scaling unit tests to enhance reward signal quality. Our\npioneer experiment reveals a positive correlation between the number of unit\ntests and reward signal quality, with greater benefits observed in more\nchallenging problems. Based on these insights, we propose CodeRM-8B, a\nlightweight yet effective unit test generator that enables efficient and\nhigh-quality unit test scaling. Additionally, we implement a dynamic scaling\nmechanism that adapts the number of unit tests based on problem difficulty,\nfurther improving efficiency. Experimental results show that our approach\nsignificantly improves performance across various models on three benchmarks\n(e.g., with gains of 18.43% for Llama3-8B and 3.42% for GPT-4o-mini on\nHumanEval Plus).", "paper_summary_zh": "<paragraph>當前的巨量語言模型 (LLM) 在首次嘗試複雜的推理任務（例如程式碼生成）時，通常難以產生準確的回應。先前的研究透過產生多個候選解，並使用 LLM 生成的單元測試驗證它們來應對此挑戰。單元測試的執行結果用作獎勵訊號，以識別正確的解。由於 LLM 總是自信地犯錯，因此這些單元測試並不可靠，從而降低了獎勵訊號的品質。受到擴充解的數量會改善 LLM 效能的觀察所激勵，我們探討了擴充單元測試以提升獎勵訊號品質的影響。我們的先驅實驗揭示了單元測試數量與獎勵訊號品質之間的正相關，在更具挑戰性的問題中觀察到更大的好處。根據這些見解，我們提出了 CodeRM-8B，這是一個輕量級但有效的單元測試產生器，可實現高效且高品質的單元測試擴充。此外，我們實作了一個動態擴充機制，根據問題難度調整單元測試的數量，進一步提高效率。實驗結果顯示，我們的做法在三個基準上顯著提升了各種模型的效能（例如，在 HumanEval Plus 上，Llama3-8B 提升了 18.43%，GPT-4o-mini 提升了 3.42%）。</paragraph>", "author": "Zeyao Ma et.al.", "authors": "Zeyao Ma, Xiaokang Zhang, Jing Zhang, Jifan Yu, Sijia Luo, Jie Tang", "id": "2501.01054v1", "paper_url": "http://arxiv.org/abs/2501.01054v1", "repo": "null"}}