{"2409.11279": {"publish_time": "2024-09-17", "title": "P-RAG: Progressive Retrieval Augmented Generation For Planning on Embodied Everyday Task", "paper_summary": "Embodied Everyday Task is a popular task in the embodied AI community,\nrequiring agents to make a sequence of actions based on natural language\ninstructions and visual observations. Traditional learning-based approaches\nface two challenges. Firstly, natural language instructions often lack explicit\ntask planning. Secondly, extensive training is required to equip models with\nknowledge of the task environment. Previous works based on Large Language Model\n(LLM) either suffer from poor performance due to the lack of task-specific\nknowledge or rely on ground truth as few-shot samples. To address the above\nlimitations, we propose a novel approach called Progressive Retrieval Augmented\nGeneration (P-RAG), which not only effectively leverages the powerful language\nprocessing capabilities of LLMs but also progressively accumulates\ntask-specific knowledge without ground-truth. Compared to the conventional RAG\nmethods, which retrieve relevant information from the database in a one-shot\nmanner to assist generation, P-RAG introduces an iterative approach to\nprogressively update the database. In each iteration, P-RAG retrieves the\nlatest database and obtains historical information from the previous\ninteraction as experiential references for the current interaction. Moreover,\nwe also introduce a more granular retrieval scheme that not only retrieves\nsimilar tasks but also incorporates retrieval of similar situations to provide\nmore valuable reference experiences. Extensive experiments reveal that P-RAG\nachieves competitive results without utilizing ground truth and can even\nfurther improve performance through self-iterations.", "paper_summary_zh": "具身日常任務是具身 AI 社群中常見的任務，\n要求代理根據自然語言指令和視覺觀察進行一系列動作。傳統的基於學習的方法\n面臨兩項挑戰。首先，自然語言指令通常缺乏明確的\n任務規劃。其次，需要大量的訓練才能讓模型具備\n任務環境的知識。基於大型語言模型 (LLM) 的先前作品\n由於缺乏特定任務的知識而導致效能不佳或依賴於少數樣本的真實數據。為了解決上述\n限制，我們提出了一種稱為漸進式檢索增強生成 (P-RAG) 的新方法，它不僅有效地利用了 LLM 強大的語言\n處理能力，而且還逐步累積\n任務特定知識，而無需真實數據。與傳統的 RAG 方法相比，後者以一次性的方式從資料庫中檢索相關資訊以協助生成，P-RAG 採用一種反覆運算的方法來\n逐步更新資料庫。在每個反覆運算中，P-RAG 檢索最新的資料庫並從先前的\n互動中獲取歷史資訊作為當前互動的經驗參考。此外，\n我們還引入了一個更精細的檢索方案，它不僅檢索\n類似的任務，還包含檢索類似的狀況，以提供\n更有價值的參考經驗。大量的實驗表明，P-RAG\n在不使用真實數據的情況下實現了具有競爭力的結果，甚至\n可以透過自我反覆運算進一步提高效能。", "author": "Weiye Xu et.al.", "authors": "Weiye Xu, Min Wang, Wengang Zhou, Houqiang Li", "id": "2409.11279v1", "paper_url": "http://arxiv.org/abs/2409.11279v1", "repo": "null"}}