{"2411.13932": {"publish_time": "2024-11-21", "title": "XAgents: A Framework for Interpretable Rule-Based Multi-Agents Cooperation", "paper_summary": "Extracting implicit knowledge and logical reasoning abilities from large\nlanguage models (LLMs) has consistently been a significant challenge. The\nadvancement of multi-agent systems has further en-hanced the capabilities of\nLLMs. Inspired by the structure of multi-polar neurons (MNs), we propose the\nXAgents framework, an in-terpretable multi-agent cooperative framework based on\nthe IF-THEN rule-based system. The IF-Parts of the rules are responsible for\nlogical reasoning and domain membership calculation, while the THEN-Parts are\ncomprised of domain expert agents that generate domain-specific contents.\nFollowing the calculation of the member-ship, XAgetns transmits the task to the\ndisparate domain rules, which subsequently generate the various responses.\nThese re-sponses are analogous to the answers provided by different experts to\nthe same question. The final response is reached at by eliminat-ing the\nhallucinations and erroneous knowledge of the LLM through membership\ncomputation and semantic adversarial genera-tion of the various domain rules.\nThe incorporation of rule-based interpretability serves to bolster user\nconfidence in the XAgents framework. We evaluate the efficacy of XAgents\nthrough a com-parative analysis with the latest AutoAgents, in which XAgents\ndemonstrated superior performance across three distinct datasets. We perform\npost-hoc interpretable studies with SHAP algorithm and case studies, proving\nthe interpretability of XAgent in terms of input-output feature correlation and\nrule-based semantics.", "paper_summary_zh": "<paragraph>從大型語言模型 (LLM) 中萃取隱含知識和邏輯推理能力一直都是一項重大挑戰。多主體系統的進展進一步增強了 LLM 的能力。受多極神經元 (MN) 的結構啟發，我們提出 XAgents 框架，一個基於 IF-THEN 規則系統的可解釋多主體合作框架。規則的 IF 部分負責邏輯推理和領域成員計算，而 THEN 部分由產生特定領域內容的領域專家主體組成。在計算成員資格後，XAgetns 將任務傳遞給不同的領域規則，隨後生成各種回應。這些回應類似於不同專家對同一個問題提供的答案。最終的回應是透過消除 LLM 的幻覺和錯誤知識，藉由成員計算和各種領域規則的語義對抗產生而達成的。基於規則的可解釋性的納入有助於提升使用者對 XAgents 框架的信心。我們透過與最新的 AutoAgents 進行比較分析來評估 XAgents 的效能，其中 XAgents 在三個不同的資料集上展現出優異的效能。我們使用 SHAP 演算法和案例研究進行事後可解釋性研究，證明 XAgent 在輸入輸出特徵關聯性和基於規則的語義方面的可解釋性。</paragraph>", "author": "Hailong Yang et.al.", "authors": "Hailong Yang, Mingxian Gu, Renhuo Zhao, Fuping Hu, Zhaohong Deng, Yitang Chen", "id": "2411.13932v1", "paper_url": "http://arxiv.org/abs/2411.13932v1", "repo": "null"}}