{"2411.07392": {"publish_time": "2024-11-11", "title": "Feature-Space Semantic Invariance: Enhanced OOD Detection for Open-Set Domain Generalization", "paper_summary": "Open-set domain generalization addresses a real-world challenge: training a\nmodel to generalize across unseen domains (domain generalization) while also\ndetecting samples from unknown classes not encountered during training\n(open-set recognition). However, most existing approaches tackle these issues\nseparately, limiting their practical applicability. To overcome this\nlimitation, we propose a unified framework for open-set domain generalization\nby introducing Feature-space Semantic Invariance (FSI). FSI maintains semantic\nconsistency across different domains within the feature space, enabling more\naccurate detection of OOD instances in unseen domains. Additionally, we adopt a\ngenerative model to produce synthetic data with novel domain styles or class\nlabels, enhancing model robustness. Initial experiments show that our method\nimproves AUROC by 9.1% to 18.9% on ColoredMNIST, while also significantly\nincreasing in-distribution classification accuracy.", "paper_summary_zh": "開放集域泛化解決了一個真實世界的挑戰：訓練一個模型在未見過的域中進行泛化（域泛化），同時也偵測訓練過程中未遇到的未知類別的樣本（開放集識別）。然而，大多數現有方法分別處理這些問題，限制了它們的實際適用性。為了克服這個限制，我們提出了一個開放集域泛化的統一架構，引入了特徵空間語義不變性（FSI）。FSI 在特徵空間中維護不同域之間的語義一致性，從而能夠更準確地偵測未見域中的 OOD 實例。此外，我們採用一個生成模型來產生具有新穎域樣式或類別標籤的合成資料，增強模型的穩健性。初步實驗表明，我們的模型在 ColoredMNIST 上將 AUROC 提高了 9.1% 至 18.9%，同時也顯著提高了分布內分類準確度。", "author": "Haoliang Wang et.al.", "authors": "Haoliang Wang, Chen Zhao, Feng Chen", "id": "2411.07392v1", "paper_url": "http://arxiv.org/abs/2411.07392v1", "repo": "null"}}