{"2405.10082": {"publish_time": "2024-05-16", "title": "An Integrated Framework for Multi-Granular Explanation of Video Summarization", "paper_summary": "In this paper, we propose an integrated framework for multi-granular\nexplanation of video summarization. This framework integrates methods for\nproducing explanations both at the fragment level (indicating which video\nfragments influenced the most the decisions of the summarizer) and the more\nfine-grained visual object level (highlighting which visual objects were the\nmost influential for the summarizer). To build this framework, we extend our\nprevious work on this field, by investigating the use of a model-agnostic,\nperturbation-based approach for fragment-level explanation of the video\nsummarization results, and introducing a new method that combines the results\nof video panoptic segmentation with an adaptation of a perturbation-based\nexplanation approach to produce object-level explanations. The performance of\nthe developed framework is evaluated using a state-of-the-art summarization\nmethod and two datasets for benchmarking video summarization. The findings of\nthe conducted quantitative and qualitative evaluations demonstrate the ability\nof our framework to spot the most and least influential fragments and visual\nobjects of the video for the summarizer, and to provide a comprehensive set of\nvisual-based explanations about the output of the summarization process.", "paper_summary_zh": "<paragraph>在本文中，我們提出了一個用於多粒度解釋影片摘要的整合架構。此架構整合了在片段層級（指出哪些影片片段最影響摘要器的決策）和更細粒度的視覺物件層級（強調哪些視覺物件對摘要器最有影響力）產生解釋的方法。為了建立這個架構，我們擴展了我們之前在這方面的研究，探討使用與模型無關的、基於擾動的方法來解釋片段層級的影片摘要結果，並引入一種新方法，將影片全景分割的結果與基於擾動的解釋方法的改編相結合，以產生物件層級的解釋。已開發架構的效能使用最先進的摘要方法和兩個用於基準測試影片摘要的資料集進行評估。所進行的量化和質化評估的結果證明了我們的架構能夠找出摘要器中影響最大和最小的片段和視覺物件，並提供一組關於摘要過程輸出的基於視覺的全面解釋。</paragraph>", "author": "Konstantinos Tsigos et.al.", "authors": "Konstantinos Tsigos, Evlampios Apostolidis, Vasileios Mezaris", "id": "2405.10082v1", "paper_url": "http://arxiv.org/abs/2405.10082v1", "repo": "null"}}