{"2406.05984": {"publish_time": "2024-06-10", "title": "Explainable AI for Mental Disorder Detection via Social Media: A survey and outlook", "paper_summary": "Mental health constitutes a complex and pervasive global challenge, affecting\nmillions of lives and often leading to severe consequences. In this paper, we\nconduct a thorough survey to explore the intersection of data science,\nartificial intelligence, and mental healthcare, focusing on the recent\ndevelopments of mental disorder detection through online social media (OSM). A\nsignificant portion of the population actively engages in OSM platforms,\ncreating a vast repository of personal data that holds immense potential for\nmental health analytics. The paper navigates through traditional diagnostic\nmethods, state-of-the-art data- and AI-driven research studies, and the\nemergence of explainable AI (XAI) models for mental healthcare. We review\nstate-of-the-art machine learning methods, particularly those based on modern\ndeep learning, while emphasising the need for explainability in healthcare AI\nmodels. The experimental design section provides insights into prevalent\npractices, including available datasets and evaluation approaches. We also\nidentify key issues and challenges in the field and propose promising future\nresearch directions. As mental health decisions demand transparency,\ninterpretability, and ethical considerations, this paper contributes to the\nongoing discourse on advancing XAI in mental healthcare through social media.\nThe comprehensive overview presented here aims to guide researchers,\npractitioners, and policymakers in developing the area of mental disorder\ndetection.", "paper_summary_zh": "心理健康構成了一項複雜且普遍的全球挑戰，影響了數百萬人的生活，並經常導致嚴重的後果。在本文中，我們進行了一項徹底的調查，以探索數據科學、人工智慧和心理保健的交集，重點關注通過線上社交媒體 (OSM) 進行心理疾病檢測的最新發展。很大一部分人口積極參與 OSM 平台，創造了一個龐大的人員資料庫，對心理健康分析具有巨大的潛力。本文探討了傳統的診斷方法、最先進的資料和 AI 驅動的研究，以及心理保健中可解釋 AI (XAI) 模型的出現。我們回顧了最先進的機器學習方法，特別是那些基於現代深度學習的方法，同時強調了醫療保健 AI 模型中可解釋性的必要性。實驗設計部分提供了對普遍做法的見解，包括可用的資料集和評估方法。我們還找出該領域的主要問題和挑戰，並提出了有希望的未來研究方向。由於心理健康決策需要透明度、可解釋性和道德考量，本文有助於推進心理保健中透過社交媒體推進 XAI 的持續討論。這裡提出的全面概述旨在引導研究人員、從業人員和政策制定者發展心理疾病檢測領域。", "author": "Yusif Ibrahimov et.al.", "authors": "Yusif Ibrahimov, Tarique Anwar, Tommy Yuan", "id": "2406.05984v1", "paper_url": "http://arxiv.org/abs/2406.05984v1", "repo": "null"}}