{"2409.08767": {"publish_time": "2024-09-13", "title": "HOLA-Drone: Hypergraphic Open-ended Learning for Zero-Shot Multi-Drone Cooperative Pursuit", "paper_summary": "Zero-shot coordination (ZSC) is a significant challenge in multi-agent\ncollaboration, aiming to develop agents that can coordinate with unseen\npartners they have not encountered before. Recent cutting-edge ZSC methods have\nprimarily focused on two-player video games such as OverCooked!2 and Hanabi. In\nthis paper, we extend the scope of ZSC research to the multi-drone cooperative\npursuit scenario, exploring how to construct a drone agent capable of\ncoordinating with multiple unseen partners to capture multiple evaders. We\npropose a novel Hypergraphic Open-ended Learning Algorithm (HOLA-Drone) that\ncontinuously adapts the learning objective based on our hypergraphic-form game\nmodeling, aiming to improve cooperative abilities with multiple unknown drone\nteammates. To empirically verify the effectiveness of HOLA-Drone, we build two\ndifferent unseen drone teammate pools to evaluate their performance in\ncoordination with various unseen partners. The experimental results demonstrate\nthat HOLA-Drone outperforms the baseline methods in coordination with unseen\ndrone teammates. Furthermore, real-world experiments validate the feasibility\nof HOLA-Drone in physical systems. Videos can be found on the project\nhomepage~\\url{https://sites.google.com/view/hola-drone}.", "paper_summary_zh": "零次學習協調 (ZSC) 是多重代理合作中的一項重大挑戰，目標是開發出能與未曾遇見的陌生合作夥伴協調的代理。最近的尖端 ZSC 方法主要專注於雙人電玩遊戲，例如 OverCooked!2 和 Hanabi。在本文中，我們將 ZSC 研究的範圍擴展到多無人機協作追逐場景，探討如何建構一個無人機代理，以便與多個未曾見過的合作夥伴協調，以捕捉多個逃犯。我們提出了一種新穎的超圖開放式學習演算法 (HOLA-Drone)，該演算法會根據我們的超圖形式遊戲建模持續調整學習目標，旨在提升與多個未知無人機隊友的合作能力。為了憑經驗驗證 HOLA-Drone 的效能，我們建立了兩個不同的未曾見過無人機隊友池，以評估它們在與各種未曾見過合作夥伴協調時的表現。實驗結果證明，HOLA-Drone 在與未曾見過的無人機隊友協調時，表現優於基線方法。此外，真實世界的實驗驗證了 HOLA-Drone 在物理系統中的可行性。可以在專案首頁~\\url{https://sites.google.com/view/hola-drone} 找到影片。", "author": "Yang Li et.al.", "authors": "Yang Li, Dengyu Zhang, Junfan Chen, Ying Wen, Qingrui Zhang, Shaoshuai Mou, Wei Pan", "id": "2409.08767v1", "paper_url": "http://arxiv.org/abs/2409.08767v1", "repo": "null"}}