{"2412.08508": {"publish_time": "2024-12-11", "title": "Comparative Opinion Mining in Product Reviews: Multi-perspective Prompt-based Learning", "paper_summary": "Comparative reviews are pivotal in understanding consumer preferences and\ninfluencing purchasing decisions. Comparative Quintuple Extraction (COQE) aims\nto identify five key components in text: the target entity, compared entities,\ncompared aspects, opinions on these aspects, and polarity. Extracting precise\ncomparative information from product reviews is challenging due to nuanced\nlanguage and sequential task errors in traditional methods. To mitigate these\nproblems, we propose MTP-COQE, an end-to-end model designed for COQE.\nLeveraging multi-perspective prompt-based learning, MTP-COQE effectively guides\nthe generative model in comparative opinion mining tasks. Evaluation on the\nCamera-COQE (English) and VCOM (Vietnamese) datasets demonstrates MTP-COQE's\nefficacy in automating COQE, achieving superior performance with a 1.41% higher\nF1 score than the previous baseline models on the English dataset.\nAdditionally, we designed a strategy to limit the generative model's creativity\nto ensure the output meets expectations. We also performed data augmentation to\naddress data imbalance and to prevent the model from becoming biased towards\ndominant samples.", "paper_summary_zh": "比較評論對於了解消費者偏好和影響購買決定至關重要。比較五元萃取 (COQE) 旨在識別文本中的五個關鍵組成部分：目標實體、比較實體、比較面向、對這些面向的意見以及極性。由於傳統方法中語言的細微差別和順序任務錯誤，從產品評論中提取精確的比較資訊具有挑戰性。為了減輕這些問題，我們提出了 MTP-COQE，這是一個專為 COQE 設計的端到端模型。利用多視角提示式學習，MTP-COQE 有效地指導生成模型進行比較意見挖掘任務。在 Camera-COQE（英語）和 VCOM（越南語）資料集上的評估證明了 MTP-COQE 在自動化 COQE 中的功效，在英語資料集上比以前的基準模型實現了高出 1.41% 的 F1 分數的優異效能。此外，我們設計了一種策略來限制生成模型的創造力，以確保輸出符合預期。我們還執行了資料擴充，以解決資料不平衡問題，並防止模型對主要樣本產生偏見。", "author": "Hai-Yen Thi Nguyen et.al.", "authors": "Hai-Yen Thi Nguyen, Cam-Van Thi Nguyen", "id": "2412.08508v1", "paper_url": "http://arxiv.org/abs/2412.08508v1", "repo": "null"}}