{"2410.21662": {"publish_time": "2024-10-29", "title": "$f$-PO: Generalizing Preference Optimization with $f$-divergence Minimization", "paper_summary": "Preference optimization has made significant progress recently, with numerous\nmethods developed to align language models with human preferences. This paper\nintroduces $f$-divergence Preference Optimization ($f$-PO), a novel framework\nthat generalizes and extends existing approaches. $f$-PO minimizes\n$f$-divergences between the optimized policy and the optimal policy,\nencompassing a broad family of alignment methods using various divergences. Our\napproach unifies previous algorithms like DPO and EXO, while offering new\nvariants through different choices of $f$-divergences. We provide theoretical\nanalysis of $f$-PO's properties and conduct extensive experiments on\nstate-of-the-art language models using benchmark datasets. Results demonstrate\n$f$-PO's effectiveness across various tasks, achieving superior performance\ncompared to existing methods on popular benchmarks such as AlpacaEval 2,\nArena-Hard, and MT-Bench. Additionally, we present ablation studies exploring\nthe impact of different $f$-divergences, offering insights into the trade-offs\nbetween regularization and performance in offline preference optimization. Our\nwork contributes both practical algorithms and theoretical understanding to the\nfield of language model alignment. Code is available at\nhttps://github.com/MinkaiXu/fPO.", "paper_summary_zh": "偏好优化最近取得了重大进展，开发了许多方法来将语言模型与人类偏好保持一致。本文介绍了 $f$-散度偏好优化 ($f$-PO)，这是一个新颖的框架，可以概括和扩展现有方法。$f$-PO 最小化优化策略和最优策略之间的 $f$-散度，涵盖使用各种散度的广泛的校准方法族。我们的方法统一了 DPO 和 EXO 等先前的算法，同时通过不同的 $f$-散度选择提供了新的变体。我们提供了 $f$-PO 特性的理论分析，并使用基准数据集对最先进的语言模型进行了广泛的实验。结果表明 $f$-PO 在各种任务中都非常有效，与 AlpacaEval 2、Arena-Hard 和 MT-Bench 等流行基准上的现有方法相比，取得了卓越的性能。此外，我们还提供了消融研究，探讨了不同 $f$-散度的影响，深入了解了离线偏好优化中正则化和性能之间的权衡。我们的工作为语言模型校准领域做出了实用算法和理论理解的贡献。代码可在 https://github.com/MinkaiXu/fPO 获得。", "author": "Jiaqi Han et.al.", "authors": "Jiaqi Han, Mingjian Jiang, Yuxuan Song, Jure Leskovec, Stefano Ermon, Minkai Xu", "id": "2410.21662v1", "paper_url": "http://arxiv.org/abs/2410.21662v1", "repo": "null"}}