{"2411.15087": {"publish_time": "2024-11-22", "title": "Instance-Aware Generalized Referring Expression Segmentation", "paper_summary": "Recent works on Generalized Referring Expression Segmentation (GRES) struggle\nwith handling complex expressions referring to multiple distinct objects. This\nis because these methods typically employ an end-to-end foreground-background\nsegmentation and lack a mechanism to explicitly differentiate and associate\ndifferent object instances to the text query. To this end, we propose\nInstAlign, a method that incorporates object-level reasoning into the\nsegmentation process. Our model leverages both text and image inputs to extract\na set of object-level tokens that capture both the semantic information in the\ninput prompt and the objects within the image. By modeling the text-object\nalignment via instance-level supervision, each token uniquely represents an\nobject segment in the image, while also aligning with relevant semantic\ninformation from the text. Extensive experiments on the gRefCOCO and Ref-ZOM\nbenchmarks demonstrate that our method significantly advances state-of-the-art\nperformance, setting a new standard for precise and flexible GRES.", "paper_summary_zh": "近期關於廣義指涉表達式分割 (GRES) 的研究在處理指涉多個不同物體的複雜表達式時遇到困難。這是因為這些方法通常採用端對端的背景前景分割，並且缺乏明確區分和將不同的物件實例與文字查詢關聯的機制。為此，我們提出了 InstAlign，這是一種將物件層級推理納入分割過程的方法。我們的模型同時利用文字和影像輸入，以萃取一組物件層級的標記，這些標記擷取輸入提示中的語意資訊和影像中的物件。透過實例層級監督對文字物件比對進行建模，每個標記在影像中唯一代表一個物件區段，同時也與文字中的相關語意資訊對齊。在 gRefCOCO 和 Ref-ZOM 基準上的廣泛實驗顯示，我們的模型顯著提升了現有技術的效能，為精確且彈性的 GRES 設定了新的標準。", "author": "E-Ro Nguyen et.al.", "authors": "E-Ro Nguyen, Hieu Le, Dimitris Samaras, Michael Ryoo", "id": "2411.15087v1", "paper_url": "http://arxiv.org/abs/2411.15087v1", "repo": "null"}}