{"2504.20022": {"publish_time": "2025-04-28", "title": "Better To Ask in English? Evaluating Factual Accuracy of Multilingual LLMs in English and Low-Resource Languages", "paper_summary": "Multilingual Large Language Models (LLMs) have demonstrated significant\neffectiveness across various languages, particularly in high-resource languages\nsuch as English. However, their performance in terms of factual accuracy across\nother low-resource languages, especially Indic languages, remains an area of\ninvestigation. In this study, we assess the factual accuracy of LLMs - GPT-4o,\nGemma-2-9B, Gemma-2-2B, and Llama-3.1-8B - by comparing their performance in\nEnglish and Indic languages using the IndicQuest dataset, which contains\nquestion-answer pairs in English and 19 Indic languages. By asking the same\nquestions in English and their respective Indic translations, we analyze\nwhether the models are more reliable for regional context questions in Indic\nlanguages or when operating in English. Our findings reveal that LLMs often\nperform better in English, even for questions rooted in Indic contexts.\nNotably, we observe a higher tendency for hallucination in responses generated\nin low-resource Indic languages, highlighting challenges in the multilingual\nunderstanding capabilities of current LLMs.", "paper_summary_zh": "多語言大型語言模型 (LLM) 已在各種語言中展現出顯著的有效性，尤其是在英語等高資源語言中。然而，它們在其他低資源語言（尤其是印度語系語言）中的事實準確性表現仍然是一個待研究的領域。在本研究中，我們通過使用 IndicQuest 資料集（其中包含英語和 19 種印度語系的問答對）比較 GPT-4o、Gemma-2-9B、Gemma-2-2B 和 Llama-3.1-8B 在英語和印度語系語言中的表現，來評估 LLM 的事實準確性。通過用英語及其各自的印度語系翻譯提出相同的問題，我們分析了這些模型對於印度語系語言中的區域背景問題，或是在使用英語時是否更可靠。我們的研究結果顯示，即使是源於印度背景的問題，LLM 的英語表現通常也更好。值得注意的是，我們觀察到以低資源印度語系語言生成的回應中，更容易出現幻覺，這凸顯了當前 LLM 在多語言理解能力方面的挑戰。\n", "author": "Pritika Rohera et.al.", "authors": "Pritika Rohera, Chaitrali Ginimav, Gayatri Sawant, Raviraj Joshi", "id": "2504.20022v1", "paper_url": "http://arxiv.org/abs/2504.20022v1", "repo": "null"}}