{"2501.03843": {"publish_time": "2025-01-07", "title": "BERTopic for Topic Modeling of Hindi Short Texts: A Comparative Study", "paper_summary": "As short text data in native languages like Hindi increasingly appear in\nmodern media, robust methods for topic modeling on such data have gained\nimportance. This study investigates the performance of BERTopic in modeling\nHindi short texts, an area that has been under-explored in existing research.\nUsing contextual embeddings, BERTopic can capture semantic relationships in\ndata, making it potentially more effective than traditional models, especially\nfor short and diverse texts. We evaluate BERTopic using 6 different document\nembedding models and compare its performance against 8 established topic\nmodeling techniques, such as Latent Dirichlet Allocation (LDA), Non-negative\nMatrix Factorization (NMF), Latent Semantic Indexing (LSI), Additive\nRegularization of Topic Models (ARTM), Probabilistic Latent Semantic Analysis\n(PLSA), Embedded Topic Model (ETM), Combined Topic Model (CTM), and Top2Vec.\nThe models are assessed using coherence scores across a range of topic counts.\nOur results reveal that BERTopic consistently outperforms other models in\ncapturing coherent topics from short Hindi texts.", "paper_summary_zh": "由於印地語等原生的語言中短文本資料越來越常出現在現代媒體中，因此在這些資料上進行主題建模的強健方法變得越來越重要。本研究探討了 BERTopic 在建模印地語短文本中的表現，這是一個現有研究中尚未充分探討的領域。透過使用脈絡嵌入，BERTopic 能夠擷取資料中的語義關係，使其潛在效能優於傳統模型，特別是對於簡短且多樣化的文本。我們使用 6 個不同的文件嵌入模型評估 BERTopic，並將其效能與 8 種已建立的主題建模技術進行比較，例如隱含狄利克雷配置 (LDA)、非負矩陣分解 (NMF)、潛在語義索引 (LSI)、主題模型的加成正則化 (ARTM)、機率潛在語義分析 (PLSA)、嵌入式主題模型 (ETM)、組合式主題模型 (CTM) 和 Top2Vec。這些模型會使用不同主題計數的相干性分數進行評估。我們的結果顯示，BERTopic 在從印地語短文本中擷取相干主題方面始終優於其他模型。", "author": "Atharva Mutsaddi et.al.", "authors": "Atharva Mutsaddi, Anvi Jamkhande, Aryan Thakre, Yashodhara Haribhakta", "id": "2501.03843v1", "paper_url": "http://arxiv.org/abs/2501.03843v1", "repo": "null"}}