{"2409.20075": {"publish_time": "2024-09-30", "title": "BSharedRAG: Backbone Shared Retrieval-Augmented Generation for the E-commerce Domain", "paper_summary": "Retrieval Augmented Generation (RAG) system is important in domains such as\ne-commerce, which has many long-tail entities and frequently updated\ninformation. Most existing works adopt separate modules for retrieval and\ngeneration, which may be suboptimal since the retrieval task and the generation\ntask cannot benefit from each other to improve performance. We propose a novel\nBackbone Shared RAG framework (BSharedRAG). It first uses a domain-specific\ncorpus to continually pre-train a base model as a domain-specific backbone\nmodel and then trains two plug-and-play Low-Rank Adaptation (LoRA) modules\nbased on the shared backbone to minimize retrieval and generation losses\nrespectively. Experimental results indicate that our proposed BSharedRAG\noutperforms baseline models by 5% and 13% in Hit@3 upon two datasets in\nretrieval evaluation and by 23% in terms of BLEU-3 in generation evaluation.\nOur codes, models, and dataset are available at https://bsharedrag.github.io.", "paper_summary_zh": "擷取增強生成（RAG）系統在電子商務等領域中非常重要，電子商務有許多長尾實體和經常更新的資訊。大多數現有作品採用獨立模組進行擷取和生成，這可能是次佳方案，因為擷取任務和生成任務無法互相受益以改善效能。我們提出了一種新穎的 Backbone 共享 RAG 架構（BSharedRAG）。它首先使用特定領域的語料庫持續預訓練基礎模型作為特定領域的 Backbone 模型，然後根據共享 Backbone 訓練兩個即插即用的低階適應（LoRA）模組，以分別最小化擷取和生成損失。實驗結果表明，我們提出的 BSharedRAG 在擷取評估中，於兩個資料集的 Hit@3 中優於基準模型 5% 和 13%，在生成評估中，以 BLEU-3 而言優於基準模型 23%。我們的程式碼、模型和資料集可在 https://bsharedrag.github.io/ 取得。", "author": "Kaisi Guan et.al.", "authors": "Kaisi Guan, Qian Cao, Yuchong Sun, Xiting Wang, Ruihua Song", "id": "2409.20075v1", "paper_url": "http://arxiv.org/abs/2409.20075v1", "repo": "null"}}