{"2406.05063": {"publish_time": "2024-06-07", "title": "Are Large Language Models More Empathetic than Humans?", "paper_summary": "With the emergence of large language models (LLMs), investigating if they can\nsurpass humans in areas such as emotion recognition and empathetic responding\nhas become a focal point of research. This paper presents a comprehensive study\nexploring the empathetic responding capabilities of four state-of-the-art LLMs:\nGPT-4, LLaMA-2-70B-Chat, Gemini-1.0-Pro, and Mixtral-8x7B-Instruct in\ncomparison to a human baseline. We engaged 1,000 participants in a\nbetween-subjects user study, assessing the empathetic quality of responses\ngenerated by humans and the four LLMs to 2,000 emotional dialogue prompts\nmeticulously selected to cover a broad spectrum of 32 distinct positive and\nnegative emotions. Our findings reveal a statistically significant superiority\nof the empathetic responding capability of LLMs over humans. GPT-4 emerged as\nthe most empathetic, marking approximately 31% increase in responses rated as\n\"Good\" compared to the human benchmark. It was followed by LLaMA-2,\nMixtral-8x7B, and Gemini-Pro, which showed increases of approximately 24%, 21%,\nand 10% in \"Good\" ratings, respectively. We further analyzed the response\nratings at a finer granularity and discovered that some LLMs are significantly\nbetter at responding to specific emotions compared to others. The suggested\nevaluation framework offers a scalable and adaptable approach for assessing the\nempathy of new LLMs, avoiding the need to replicate this study's findings in\nfuture research.", "paper_summary_zh": "<paragraph>隨著大型語言模型 (LLM) 的出現，探討它們是否能在情緒辨識和同理回應等領域超越人類已成為研究重點。本文提出了一項綜合性研究，探討四種最先進的 LLM 的同理回應能力：GPT-4、LLaMA-2-70B-Chat、Gemini-1.0-Pro 和 Mixtral-8x7B-Instruct，並將它們與人類基準進行比較。我們在一個受試者間用戶研究中聘請了 1,000 名參與者，評估人類和四種 LLM 對 2,000 個情緒對話提示所產生的回應的同理品質，這些提示經過精心挑選，涵蓋了 32 種不同的正面和負面情緒。我們的研究結果顯示，LLM 的同理回應能力在統計上顯著優於人類。GPT-4 脫穎而出，成為最具同理心的，與人類基準相比，被評為「好」的回應增加了約 31%。其次是 LLaMA-2、Mixtral-8x7B 和 Gemini-Pro，它們的「好」評分分別增加了約 24%、21% 和 10%。我們進一步分析了回應評分，發現有些 LLM 在回應特定情緒方面顯著優於其他 LLM。建議的評估架構提供了一個可擴充且可適應的方法來評估新 LLM 的同理心，避免在未來的研究中複製本研究的發現。</paragraph>", "author": "Anuradha Welivita et.al.", "authors": "Anuradha Welivita, Pearl Pu", "id": "2406.05063v1", "paper_url": "http://arxiv.org/abs/2406.05063v1", "repo": "null"}}