{"2408.00550": {"publish_time": "2024-08-01", "title": "Mitigating Multilingual Hallucination in Large Vision-Language Models", "paper_summary": "While Large Vision-Language Models (LVLMs) have exhibited remarkable\ncapabilities across a wide range of tasks, they suffer from hallucination\nproblems, where models generate plausible yet incorrect answers given the input\nimage-query pair. This hallucination phenomenon is even more severe when\nquerying the image in non-English languages, while existing methods for\nmitigating hallucinations in LVLMs only consider the English scenarios. In this\npaper, we make the first attempt to mitigate this important multilingual\nhallucination in LVLMs. With thorough experiment analysis, we found that\nmultilingual hallucination in LVLMs is a systemic problem that could arise from\ndeficiencies in multilingual capabilities or inadequate multimodal abilities.\nTo this end, we propose a two-stage Multilingual Hallucination Removal (MHR)\nframework for LVLMs, aiming to improve resistance to hallucination for both\nhigh-resource and low-resource languages. Instead of relying on the intricate\nmanual annotations of multilingual resources, we fully leverage the inherent\ncapabilities of the LVLM and propose a novel cross-lingual alignment method,\nwhich generates multiple responses for each image-query input and then\nidentifies the hallucination-aware pairs for each language. These data pairs\nare finally used for direct preference optimization to prompt the LVLMs to\nfavor non-hallucinating responses. Experimental results show that our MHR\nachieves a substantial reduction in hallucination generation for LVLMs.\nNotably, on our extended multilingual POPE benchmark, our framework delivers an\naverage increase of 19.0% in accuracy across 13 different languages. Our code\nand model weights are available at https://github.com/ssmisya/MHR", "paper_summary_zh": "<paragraph>儘管大型視覺語言模型 (LVLMs) 在各種任務中展現出非凡的能力，但它們卻飽受幻覺問題所苦，也就是模型根據輸入的影像查詢對產生看似合理但實際上不正確的答案。這種幻覺現象在以非英語語言查詢影像時會更加嚴重，而現有針對 LVLMs 中幻覺問題的緩解方法僅考慮英語情境。在本文中，我們首次嘗試緩解 LVLMs 中這種重要的多語言幻覺問題。透過徹底的實驗分析，我們發現 LVLMs 中的多語言幻覺是一個系統性問題，可能源自多語言能力的不足或多模態能力的不足。有鑑於此，我們針對 LVLMs 提出一個兩階段的多語言幻覺移除 (MHR) 架構，目標是提升高資源語言和低資源語言對幻覺的抵抗力。我們並未依賴多語言資源的複雜手動註解，而是充分利用 LVLM 的內在能力，並提出一個創新的跨語言對齊方法，為每個影像查詢輸入產生多個回應，然後針對每種語言找出具備幻覺感知能力的配對。這些資料配對最後用於直接偏好最佳化，促使 LVLMs 偏好非幻覺的回應。實驗結果顯示，我們的 MHR 大幅減少了 LVLMs 中的幻覺產生。值得注意的是，在我們擴充的多語言 POPE 基準測試中，我們的架構在 13 種不同語言中平均提升了 19.0% 的準確度。我們的程式碼和模型權重可在 https://github.com/ssmisya/MHR 取得</paragraph>", "author": "Xiaoye Qu et.al.", "authors": "Xiaoye Qu, Mingyang Song, Wei Wei, Jianfeng Dong, Yu Cheng", "id": "2408.00550v1", "paper_url": "http://arxiv.org/abs/2408.00550v1", "repo": "null"}}