{"2411.03948": {"publish_time": "2024-11-06", "title": "Long-Form Text-to-Music Generation with Adaptive Prompts: A Case of Study in Tabletop Role-Playing Games Soundtracks", "paper_summary": "This paper investigates the capabilities of text-to-audio music generation\nmodels in producing long-form music with prompts that change over time,\nfocusing on soundtrack generation for Tabletop Role-Playing Games (TRPGs). We\nintroduce Babel Bardo, a system that uses Large Language Models (LLMs) to\ntransform speech transcriptions into music descriptions for controlling a\ntext-to-music model. Four versions of Babel Bardo were compared in two TRPG\ncampaigns: a baseline using direct speech transcriptions, and three LLM-based\nversions with varying approaches to music description generation. Evaluations\nconsidered audio quality, story alignment, and transition smoothness. Results\nindicate that detailed music descriptions improve audio quality while\nmaintaining consistency across consecutive descriptions enhances story\nalignment and transition smoothness.", "paper_summary_zh": "本文探討文本轉音訊音樂生成模型在產生隨著時間推移而變化的長篇音樂的能力，重點在於桌上角色扮演遊戲 (TRPG) 的配樂生成。我們介紹 Babel Bardo，一個使用大型語言模型 (LLM) 將語音轉錄轉換為音樂描述的系統，用於控制文本轉音樂模型。在兩個 TRPG 戰役中比較了四個版本的 Babel Bardo：使用直接語音轉錄的基準，以及三個採用不同音樂描述生成方法的基於 LLM 的版本。評估考慮了音訊品質、故事對齊和轉場流暢度。結果表明，詳細的音樂描述改善了音訊品質，而連續描述之間保持一致性則增強了故事對齊和轉場流暢度。", "author": "Felipe Marra et.al.", "authors": "Felipe Marra, Lucas N. Ferreira", "id": "2411.03948v1", "paper_url": "http://arxiv.org/abs/2411.03948v1", "repo": "null"}}