{"2411.02589": {"publish_time": "2024-11-04", "title": "Context-Informed Machine Translation of Manga using Multimodal Large Language Models", "paper_summary": "Due to the significant time and effort required for handcrafting\ntranslations, most manga never leave the domestic Japanese market. Automatic\nmanga translation is a promising potential solution. However, it is a budding\nand underdeveloped field and presents complexities even greater than those\nfound in standard translation due to the need to effectively incorporate visual\nelements into the translation process to resolve ambiguities. In this work, we\ninvestigate to what extent multimodal large language models (LLMs) can provide\neffective manga translation, thereby assisting manga authors and publishers in\nreaching wider audiences. Specifically, we propose a methodology that leverages\nthe vision component of multimodal LLMs to improve translation quality and\nevaluate the impact of translation unit size, context length, and propose a\ntoken efficient approach for manga translation. Moreover, we introduce a new\nevaluation dataset -- the first parallel Japanese-Polish manga translation\ndataset -- as part of a benchmark to be used in future research. Finally, we\ncontribute an open-source software suite, enabling others to benchmark LLMs for\nmanga translation. Our findings demonstrate that our proposed methods achieve\nstate-of-the-art results for Japanese-English translation and set a new\nstandard for Japanese-Polish.", "paper_summary_zh": "由於手工翻譯需要大量時間和精力，大多數漫畫從未離開日本國內市場。自動漫畫翻譯是一個很有前景的潛在解決方案。然而，它是一個新興且不發達的領域，並且由於需要有效地將視覺元素納入翻譯過程中以解決歧義，因此比標準翻譯中的複雜性更大。在這項工作中，我們探討了多模態大型語言模型 (LLM) 在多大程度上可以提供有效的漫畫翻譯，從而協助漫畫作者和出版商接觸更廣泛的受眾。具體來說，我們提出了一種利用多模態 LLM 的視覺組成部分的方法來提高翻譯品質，並評估翻譯單元大小、上下文長度和提出漫畫翻譯的代幣有效方法的影響。此外，我們引入了一個新的評估資料集——第一個日語-波蘭語漫畫翻譯平行資料集——作為未來研究中使用的基準的一部分。最後，我們貢獻了一個開源軟體套件，讓其他人可以對 LLM 進行漫畫翻譯基準測試。我們的研究結果表明，我們提出的方法達到了日語-英語翻譯的最新結果，並為日語-波蘭語設定了新的標準。", "author": "Philip Lippmann et.al.", "authors": "Philip Lippmann, Konrad Skublicki, Joshua Tanner, Shonosuke Ishiwatari, Jie Yang", "id": "2411.02589v1", "paper_url": "http://arxiv.org/abs/2411.02589v1", "repo": "null"}}