{"2411.04637": {"publish_time": "2024-11-07", "title": "Hands-On Tutorial: Labeling with LLM and Human-in-the-Loop", "paper_summary": "Training and deploying machine learning models relies on a large amount of\nhuman-annotated data. As human labeling becomes increasingly expensive and\ntime-consuming, recent research has developed multiple strategies to speed up\nannotation and reduce costs and human workload: generating synthetic training\ndata, active learning, and hybrid labeling. This tutorial is oriented toward\npractical applications: we will present the basics of each strategy, highlight\ntheir benefits and limitations, and discuss in detail real-life case studies.\nAdditionally, we will walk through best practices for managing human annotators\nand controlling the quality of the final dataset. The tutorial includes a\nhands-on workshop, where attendees will be guided in implementing a hybrid\nannotation setup. This tutorial is designed for NLP practitioners from both\nresearch and industry backgrounds who are involved in or interested in\noptimizing data labeling projects.", "paper_summary_zh": "訓練和部署機器學習模型仰賴大量的\n人工標記資料。由於人工標記的成本越來越高昂且耗時，最近的研究已開發出多種策略來加速\n標記並降低成本和人力負擔：產生合成訓練\n資料、主動學習和混合標記。本教學課程以\n實際應用為導向：我們將介紹每種策略的基本原理，強調\n它們的優點和限制，並詳細討論實際案例研究。\n此外，我們將逐步介紹管理人工標記員和控制最終\n資料集品質的最佳實務。本教學課程包括實作工作坊，參與者將在其中接受指導，實作混合\n標記設定。本教學課程專為來自\n研究和產業背景，且參與或有興趣\n最佳化資料標記專案的 NLP 實務人員所設計。", "author": "Ekaterina Artemova et.al.", "authors": "Ekaterina Artemova, Akim Tsvigun, Dominik Schlechtweg, Natalia Fedorova, Sergei Tilga, Boris Obmoroshev", "id": "2411.04637v1", "paper_url": "http://arxiv.org/abs/2411.04637v1", "repo": "null"}}