{"2408.11239": {"publish_time": "2024-08-20", "title": "A Little Confidence Goes a Long Way", "paper_summary": "We introduce a group of related methods for binary classification tasks using\nprobes of the hidden state activations in large language models (LLMs).\nPerformance is on par with the largest and most advanced LLMs currently\navailable, but requiring orders of magnitude fewer computational resources and\nnot requiring labeled data. This approach involves translating class labels\ninto a semantically rich description, spontaneous symmetry breaking of\nmultilayer perceptron probes for unsupervised learning and inference, training\nprobes to generate confidence scores (prior probabilities) from hidden state\nactivations subject to known constraints via entropy maximization, and\nselecting the most confident probe model from an ensemble for prediction. These\ntechniques are evaluated on four datasets using five base LLMs.", "paper_summary_zh": "我們介紹了一組相關方法，用於二元分類任務，使用大型語言模型 (LLM) 中隱藏狀態激活的探針。\n效能與目前最大的最先進 LLM 相當，但需要的計算資源少了好幾個數量級，而且不需要標記資料。此方法包括將類別標籤轉換為語意豐富的描述、多層感知器探針的自發對稱性破壞，用於無監督學習和推論、訓練探針以從隱藏狀態激活中產生信心分數（先驗機率），受制於透過熵最大化而得知的約束，以及從一個整體中選出最具信心的探針模型以進行預測。這些技術使用五個基礎 LLM 在四個資料集上進行評估。", "author": "John Scoville et.al.", "authors": "John Scoville, Shang Gao, Devanshu Agrawal, Javed Qadrud-Din", "id": "2408.11239v1", "paper_url": "http://arxiv.org/abs/2408.11239v1", "repo": "null"}}