{"2412.09173": {"publish_time": "2024-12-12", "title": "ReFF: Reinforcing Format Faithfulness in Language Models across Varied Tasks", "paper_summary": "Following formatting instructions to generate well-structured content is a\nfundamental yet often unmet capability for large language models (LLMs). To\nstudy this capability, which we refer to as format faithfulness, we present\nFormatBench, a comprehensive format-related benchmark. Compared to previous\nformat-related benchmarks, FormatBench involves a greater variety of tasks in\nterms of application scenes (traditional NLP tasks, creative works, autonomous\nagency tasks), human-LLM interaction styles (single-turn instruction,\nmulti-turn chat), and format types (inclusion, wrapping, length, coding).\nMoreover, each task in FormatBench is attached with a format checker program.\nExtensive experiments on the benchmark reveal that state-of-the-art open- and\nclosed-source LLMs still suffer from severe deficiency in format faithfulness.\nBy virtue of the decidable nature of formats, we propose to Reinforce Format\nFaithfulness (ReFF) to help LLMs generate formatted output as instructed\nwithout compromising general quality. Without any annotated data, ReFF can\nsubstantially improve the format faithfulness rate (e.g., from 21.6% in\noriginal LLaMA3 to 95.0% on caption segmentation task), while keep the general\nquality comparable (e.g., from 47.3 to 46.4 in F1 scores). Combined with\nlabeled training data, ReFF can simultaneously improve both format faithfulness\n(e.g., from 21.6% in original LLaMA3 to 75.5%) and general quality (e.g., from\n47.3 to 61.6 in F1 scores). We further offer an interpretability analysis to\nexplain how ReFF improves both format faithfulness and general quality.", "paper_summary_zh": "<paragraph>遵循格式化指令來產生結構良好的內容，是大型語言模型 (LLM) 的基本功能，但通常無法滿足。為了研究這種我們稱為格式忠實度的功能，我們提出了 FormatBench，一個全面的格式相關基準測試。與之前的格式相關基準測試相比，FormatBench 涉及更多樣化的任務，包括應用場景（傳統 NLP 任務、創意作品、自主代理任務）、人機互動風格（單回合指令、多回合聊天）和格式類型（包含、換行、長度、編碼）。此外，FormatBench 中的每個任務都附帶一個格式檢查器程式。在基準測試上進行的廣泛實驗表明，最先進的開源和閉源 LLM 仍然存在嚴重的格式忠實度缺陷。由於格式的可決定性，我們提出加強格式忠實度 (ReFF) 來幫助 LLM 按照指示產生格式化的輸出，而不會損害一般品質。在沒有任何註解資料的情況下，ReFF 可以大幅提高格式忠實度（例如，從 LLaMA3 中的 21.6% 提高到標題分段任務中的 95.0%），同時保持一般品質相當（例如，F1 分數從 47.3 提高到 46.4）。結合標籤訓練資料，ReFF 可以同時提高格式忠實度（例如，從 LLaMA3 中的 21.6% 提高到 75.5%）和一般品質（例如，F1 分數從 47.3 提高到 61.6）。我們進一步提供了可解釋性分析，說明 ReFF 如何同時提高格式忠實度和一般品質。</paragraph>", "author": "Jiashu Yao et.al.", "authors": "Jiashu Yao, Heyan Huang, Zeming Liu, Haoyu Wen, Wei Su, Boao Qian, Yuhang Guo", "id": "2412.09173v1", "paper_url": "http://arxiv.org/abs/2412.09173v1", "repo": "null"}}