{"2502.10388": {"publish_time": "2025-02-14", "title": "Aspect-Oriented Summarization for Psychiatric Short-Term Readmission Prediction", "paper_summary": "Recent progress in large language models (LLMs) has enabled the automated\nprocessing of lengthy documents even without supervised training on a\ntask-specific dataset. Yet, their zero-shot performance in complex tasks as\nopposed to straightforward information extraction tasks remains suboptimal. One\nfeasible approach for tasks with lengthy, complex input is to first summarize\nthe document and then apply supervised fine-tuning to the summary. However, the\nsummarization process inevitably results in some loss of information. In this\nstudy we present a method for processing the summaries of long documents aimed\nto capture different important aspects of the original document. We hypothesize\nthat LLM summaries generated with different aspect-oriented prompts contain\ndifferent \\textit{information signals}, and we propose methods to measure these\ndifferences. We introduce approaches to effectively integrate signals from\nthese different summaries for supervised training of transformer models. We\nvalidate our hypotheses on a high-impact task -- 30-day readmission prediction\nfrom a psychiatric discharge -- using real-world data from four hospitals, and\nshow that our proposed method increases the prediction performance for the\ncomplex task of predicting patient outcome.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展使得即使沒有針對特定任務資料集進行監督式訓練，也能自動處理冗長的文檔。然而，它們在複雜任務中的零次學習表現，與直接的資訊萃取任務相比，仍然不是最佳的。對於有冗長、複雜輸入的任務，一種可行的做法是先摘要文件，然後對摘要進行監督式微調。然而，摘要過程不可避免會導致一些資訊遺失。在本研究中，我們提出了一種處理長文摘要的方法，旨在擷取原始文件中的不同重要面向。我們假設使用不同面向提示產生的 LLM 摘要包含不同的「資訊訊號」，並且我們提出方法來衡量這些差異。我們引入了有效整合來自這些不同摘要的訊號，以進行Transformer模型的監督式訓練的方法。我們在一個高影響力的任務上驗證了我們的假設——從精神科出院預測 30 天再入院——使用來自四家醫院的真實世界資料，並證明我們提出的方法增加了預測複雜的患者預後任務的預測效能。", "author": "WonJin Yoon et.al.", "authors": "WonJin Yoon, Boyu Ren, Spencer Thomas, Chanwhi Kim, Guergana Savova, Mei-Hua Hall, Timothy Miller", "id": "2502.10388v1", "paper_url": "http://arxiv.org/abs/2502.10388v1", "repo": "null"}}