{"2502.04134": {"publish_time": "2025-02-06", "title": "The Order Effect: Investigating Prompt Sensitivity in Closed-Source LLMs", "paper_summary": "As large language models (LLMs) become integral to diverse applications,\nensuring their reliability under varying input conditions is crucial. One key\nissue affecting this reliability is order sensitivity, wherein slight\nvariations in input arrangement can lead to inconsistent or biased outputs.\nAlthough recent advances have reduced this sensitivity, the problem remains\nunresolved. This paper investigates the extent of order sensitivity in\nclosed-source LLMs by conducting experiments across multiple tasks, including\nparaphrasing, relevance judgment, and multiple-choice questions. Our results\nshow that input order significantly affects performance across tasks, with\nshuffled inputs leading to measurable declines in output accuracy. Few-shot\nprompting demonstrates mixed effectiveness and offers partial mitigation,\nhowever, fails to fully resolve the problem. These findings highlight\npersistent risks, particularly in high-stakes applications, and point to the\nneed for more robust LLMs or improved input-handling techniques in future\ndevelopment.", "paper_summary_zh": "隨著大型語言模型 (LLM) 成為各種應用程式中不可或缺的一部分，確保它們在不同的輸入條件下都能可靠運作至關重要。影響這個可靠性的主要問題之一是順序敏感性，其中輸入排列的微小變化可能導致不一致或有偏差的輸出。儘管最近的進展已經降低了這種敏感性，但這個問題仍未得到解決。本文透過在多項任務中進行實驗來探討閉源 LLM 中順序敏感性的程度，包括改寫、相關性判斷和多選題。我們的結果顯示，輸入順序會顯著影響各項任務的效能，輸入順序打亂會導致輸出準確度明顯下降。少次提示展示出不同的效果，並提供部分緩解，但無法完全解決問題。這些發現突顯了持續存在的風險，特別是在高風險應用中，並指出未來開發中需要更強大的 LLM 或改進的輸入處理技術。", "author": "Bryan Guan et.al.", "authors": "Bryan Guan, Tanya Roosta, Peyman Passban, Mehdi Rezagholizadeh", "id": "2502.04134v1", "paper_url": "http://arxiv.org/abs/2502.04134v1", "repo": "null"}}