{"2502.13019": {"publish_time": "2025-02-18", "title": "Oreo: A Plug-in Context Reconstructor to Enhance Retrieval-Augmented Generation", "paper_summary": "Despite the remarkable capabilities of Large Language Models (LLMs) in\nvarious NLP tasks, they remain vulnerable to hallucinations due to their\nlimited parametric knowledge and lack of domain-specific expertise.\nRetrieval-Augmented Generation (RAG) addresses this challenge by incorporating\nexternal document retrieval to augment the knowledge base of LLMs. In this\napproach, RAG retrieves document chunks from an external corpus in response to\na query, which are then used as context for the downstream language model to\ngenerate an answer. However, these retrieved knowledge sources often include\nirrelevant or erroneous information, undermining the effectiveness of RAG in\ndownstream tasks. To overcome this limitation, we introduce a compact,\nefficient, and pluggable module designed to refine external knowledge sources\nbefore feeding them to the generator. The module reconstructs retrieved content\nby extracting the most relevant and supportive information and reorganising it\ninto a concise, query-specific format. Through a three-stage training paradigm\n- comprising supervised fine-tuning, contrastive multi-task learning, and\nreinforcement learning-based alignment - it prioritises critical knowledge and\naligns it with the generator's preferences. This method enables LLMs to produce\noutputs that are more accurate, reliable, and contextually appropriate.", "paper_summary_zh": "儘管大型語言模型 (LLM) 在各種自然語言處理任務中具備卓越的能力，但由於其參數知識有限且缺乏特定領域的專業知識，因此它們仍然容易出現幻覺。檢索增強式生成 (RAG) 透過納入外部文件檢索來擴充 LLM 的知識庫，以應對此項挑戰。在此方法中，RAG 會根據查詢檢索外部語料庫中的文件區塊，然後將其用作下游語言模型的背景，以產生答案。然而，這些檢索到的知識來源通常包含不相關或錯誤的資訊，因而損害了 RAG 在下游任務中的效能。為了克服此項限制，我們引入了一個精簡、有效率且可插入的模組，用於在將外部知識來源提供給生成器之前對其進行精煉。此模組透過提取最相關且有用的資訊並將其重新組織成簡潔且特定於查詢的格式，來重建檢索到的內容。透過三階段訓練範例 - 包含監督微調、對比多任務學習以及基於強化學習的比對 - 它優先考量關鍵知識，並使其與生成器的偏好相符。此方法可讓 LLM 產生更準確、可靠且在語境上更適當的輸出。", "author": "Sha Li et.al.", "authors": "Sha Li, Naren Ramarkrishnan", "id": "2502.13019v1", "paper_url": "http://arxiv.org/abs/2502.13019v1", "repo": "null"}}