{"2405.06419": {"publish_time": "2024-05-10", "title": "Time Evidence Fusion Network: Multi-source View in Long-Term Time Series Forecasting", "paper_summary": "In real-world scenarios, time series forecasting often demands timeliness,\nmaking research on model backbones a perennially hot topic. To meet these\nperformance demands, we propose a novel backbone from the perspective of\ninformation fusion. Introducing the Basic Probability Assignment (BPA) Module\nand the Time Evidence Fusion Network (TEFN), based on evidence theory, allows\nus to achieve superior performance. On the other hand, the perspective of\nmulti-source information fusion effectively improves the accuracy of\nforecasting. Due to the fact that BPA is generated by fuzzy theory, TEFN also\nhas considerable interpretability. In real data experiments, the TEFN partially\nachieved state-of-the-art, with low errors comparable to PatchTST, and\noperating efficiency surpass performance models such as Dlinear. Meanwhile,\nTEFN has high robustness and small error fluctuations in the random\nhyperparameter selection. TEFN is not a model that achieves the ultimate in\nsingle aspect, but a model that balances performance, accuracy, stability, and\ninterpretability.", "paper_summary_zh": "在現實世界的場景中，時間序列預測通常需要及時性，這使得模型主幹的研究成為一個長盛不衰的熱門話題。為了滿足這些效能需求，我們從資訊融合的角度提出了一個新穎的主幹。引入基於證據理論的基本機率分配（BPA）模組和時間證據融合網路（TEFN），讓我們能夠實現卓越的效能。另一方面，多來源資訊融合的觀點有效地提高了預測的準確性。由於 BPA 是由模糊理論產生的，因此 TEFN 也具有相當的可解釋性。在真實資料實驗中，TEFN 部分達到最先進的技術，其誤差低於 PatchTST，且運作效率優於 Dlinear 等效能模型。同時，TEFN 在隨機超參數選擇中具有很高的穩健性和小的誤差波動。TEFN 不是一個在單一層面達到極致的模型，而是一個平衡效能、準確性、穩定性和可解釋性的模型。", "author": "Tianxiang Zhan et.al.", "authors": "Tianxiang Zhan, Yuanpeng He, Zhen Li, Yong Deng", "id": "2405.06419v1", "paper_url": "http://arxiv.org/abs/2405.06419v1", "repo": "https://github.com/ztxtech/Time-Evidence-Fusion-Network"}}