{"2501.08068": {"publish_time": "2025-01-14", "title": "A Roadmap to Guide the Integration of LLMs in Hierarchical Planning", "paper_summary": "Recent advances in Large Language Models (LLMs) are fostering their\nintegration into several reasoning-related fields, including Automated Planning\n(AP). However, their integration into Hierarchical Planning (HP), a subfield of\nAP that leverages hierarchical knowledge to enhance planning performance,\nremains largely unexplored. In this preliminary work, we propose a roadmap to\naddress this gap and harness the potential of LLMs for HP. To this end, we\npresent a taxonomy of integration methods, exploring how LLMs can be utilized\nwithin the HP life cycle. Additionally, we provide a benchmark with a\nstandardized dataset for evaluating the performance of future LLM-based HP\napproaches, and present initial results for a state-of-the-art HP planner and\nLLM planner. As expected, the latter exhibits limited performance (3\\% correct\nplans, and none with a correct hierarchical decomposition) but serves as a\nvaluable baseline for future approaches.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展促進了它們與多個推理相關領域的整合，包括自動規劃 (AP)。然而，它們與階層規劃 (HP) 的整合，一個利用階層知識來增強規劃效能的 AP 子領域，在很大程度上仍未被探索。在這個初步工作中，我們提出了一個路線圖來解決這個差距，並利用 LLM 在 HP 中的潛力。為此，我們提出了一種整合方法分類法，探討如何在 HP 生命周期中利用 LLM。此外，我們提供了一個具有標準化資料集的基準，用於評估基於 LLM 的 HP 方法的未來效能，並提出了一個最先進的 HP 規劃器和 LLM 規劃器的初步結果。正如預期的那樣，後者表現出有限的效能（3% 正確的計畫，沒有任何正確的階層分解），但作為未來方法的一個有價值的基準。", "author": "Israel Puerta-Merino et.al.", "authors": "Israel Puerta-Merino, Carlos Núñez-Molina, Pablo Mesejo, Juan Fernández-Olivares", "id": "2501.08068v1", "paper_url": "http://arxiv.org/abs/2501.08068v1", "repo": "null"}}