{"2412.03154": {"publish_time": "2024-12-04", "title": "Testing Neural Network Verifiers: A Soundness Benchmark with Hidden Counterexamples", "paper_summary": "In recent years, many neural network (NN) verifiers have been developed to\nformally verify certain properties of neural networks such as robustness.\nAlthough many benchmarks have been constructed to evaluate the performance of\nNN verifiers, they typically lack a ground-truth for hard instances where no\ncurrent verifier can verify and no counterexample can be found, which makes it\ndifficult to check the soundness of a new verifier if it claims to verify hard\ninstances which no other verifier can do. We propose to develop a soundness\nbenchmark for NN verification. Our benchmark contains instances with\ndeliberately inserted counterexamples while we also try to hide the\ncounterexamples from regular adversarial attacks which can be used for finding\ncounterexamples. We design a training method to produce neural networks with\nsuch hidden counterexamples. Our benchmark aims to be used for testing the\nsoundness of NN verifiers and identifying falsely claimed verifiability when it\nis known that hidden counterexamples exist. We systematically construct our\nbenchmark and generate instances across diverse model architectures, activation\nfunctions, input sizes, and perturbation radii. We demonstrate that our\nbenchmark successfully identifies bugs in state-of-the-art NN verifiers, as\nwell as synthetic bugs, providing a crucial step toward enhancing the\nreliability of testing NN verifiers. Our code is available at\nhttps://github.com/MVP-Harry/SoundnessBench and our benchmark is available at\nhttps://huggingface.co/datasets/SoundnessBench/SoundnessBench.", "paper_summary_zh": "近年来，许多神经网络 (NN) 验证器被开发出来，以正式验证神经网络的某些属性，例如鲁棒性。虽然已经构建了许多基准来评估 NN 验证器的性能，但它们通常缺乏难以验证的实例的基本事实，而当前没有验证器可以验证并且找不到反例，这使得如果声称验证其他验证器无法验证的困难实例，则难以检查新验证器的健全性。我们建议为 NN 验证开发一个健全性基准。我们的基准包含故意插入反例的实例，而我们也尝试将反例隐藏在常规对抗性攻击中，该攻击可用于查找反例。我们设计了一种训练方法来生成具有此类隐藏反例的神经网络。我们的基准旨在用于测试 NN 验证器的健全性，并在已知存在隐藏反例的情况下识别错误声称的可验证性。我们系统地构建基准，并在不同的模型架构、激活函数、输入大小和扰动半径中生成实例。我们证明了我们的基准成功地识别了最先进的 NN 验证器中的错误，以及合成的错误，为提高 NN 验证器测试的可靠性提供了至关重要的一步。我们的代码可在 https://github.com/MVP-Harry/SoundnessBench 获得，我们的基准可在 https://huggingface.co/datasets/SoundnessBench/SoundnessBench 获得。", "author": "Xingjian Zhou et.al.", "authors": "Xingjian Zhou, Hongji Xu, Andy Xu, Zhouxing Shi, Cho-Jui Hsieh, Huan Zhang", "id": "2412.03154v1", "paper_url": "http://arxiv.org/abs/2412.03154v1", "repo": "https://github.com/mvp-harry/soundnessbench"}}