{"2410.10733": {"publish_time": "2024-10-14", "title": "Deep Compression Autoencoder for Efficient High-Resolution Diffusion Models", "paper_summary": "We present Deep Compression Autoencoder (DC-AE), a new family of autoencoder\nmodels for accelerating high-resolution diffusion models. Existing autoencoder\nmodels have demonstrated impressive results at a moderate spatial compression\nratio (e.g., 8x), but fail to maintain satisfactory reconstruction accuracy for\nhigh spatial compression ratios (e.g., 64x). We address this challenge by\nintroducing two key techniques: (1) Residual Autoencoding, where we design our\nmodels to learn residuals based on the space-to-channel transformed features to\nalleviate the optimization difficulty of high spatial-compression autoencoders;\n(2) Decoupled High-Resolution Adaptation, an efficient decoupled three-phases\ntraining strategy for mitigating the generalization penalty of high\nspatial-compression autoencoders. With these designs, we improve the\nautoencoder's spatial compression ratio up to 128 while maintaining the\nreconstruction quality. Applying our DC-AE to latent diffusion models, we\nachieve significant speedup without accuracy drop. For example, on ImageNet\n512x512, our DC-AE provides 19.1x inference speedup and 17.9x training speedup\non H100 GPU for UViT-H while achieving a better FID, compared with the widely\nused SD-VAE-f8 autoencoder. Our code is available at\nhttps://github.com/mit-han-lab/efficientvit.", "paper_summary_zh": "<paragraph>我們提出深度壓縮自編碼器 (DC-AE)，一種用於加速高解析度擴散模型的自編碼器模型的新系列。現有的自編碼器模型在中等空間壓縮比 (例如 8 倍) 下已展現令人印象深刻的結果，但無法維持高空間壓縮比 (例如 64 倍) 的滿意重建準確度。我們透過引入兩項關鍵技術來解決此挑戰：(1) 殘差自編碼，我們設計我們的模型以學習基於空間到通道轉換特徵的殘差，以減輕高空間壓縮自編碼器的最佳化難度；(2) 解耦的高解析度適應，一種用於減輕高空間壓縮自編碼器的泛化懲罰的有效解耦三階段訓練策略。透過這些設計，我們將自編碼器的空間壓縮比提升至 128，同時維持重建品質。將我們的 DC-AE 套用於潛在擴散模型，我們在不降低準確度的情況下實現顯著的加速。例如，在 ImageNet 512x512 上，我們的 DC-AE 在 H100 GPU 上為 UViT-H 提供 19.1 倍的推論加速和 17.9 倍的訓練加速，同時實現比廣泛使用的 SD-VAE-f8 自編碼器更好的 FID。我們的程式碼可於 https://github.com/mit-han-lab/efficientvit 取得。</paragraph>", "author": "Junyu Chen et.al.", "authors": "Junyu Chen, Han Cai, Junsong Chen, Enze Xie, Shang Yang, Haotian Tang, Muyang Li, Yao Lu, Song Han", "id": "2410.10733v1", "paper_url": "http://arxiv.org/abs/2410.10733v1", "repo": "https://github.com/mit-han-lab/efficientvit"}}