{"2411.02126": {"publish_time": "2024-11-04", "title": "Unsupervised detection of semantic correlations in big data", "paper_summary": "In real-world data, information is stored in extremely large feature vectors.\nThese variables are typically correlated due to complex interactions involving\nmany features simultaneously. Such correlations qualitatively correspond to\nsemantic roles and are naturally recognized by both the human brain and\nartificial neural networks. This recognition enables, for instance, the\nprediction of missing parts of an image or text based on their context. We\npresent a method to detect these correlations in high-dimensional data\nrepresented as binary numbers. We estimate the binary intrinsic dimension of a\ndataset, which quantifies the minimum number of independent coordinates needed\nto describe the data, and is therefore a proxy of semantic complexity. The\nproposed algorithm is largely insensitive to the so-called curse of\ndimensionality, and can therefore be used in big data analysis. We test this\napproach identifying phase transitions in model magnetic systems and we then\napply it to the detection of semantic correlations of images and text inside\ndeep neural networks.", "paper_summary_zh": "在現實世界的資料中，資訊儲存在極大的特徵向量中。\n這些變數通常由於包含許多特徵的複雜交互作用而相關。\n這種相關性在質上對應於語義角色，並且自然地被人腦和人工神經網路所識別。\n例如，這種識別使預測影像或文字的遺失部分成為可能，其依據是其脈絡。\n我們提出一個方法來偵測高維度資料中的這些相關性，這些資料表示為二進位數字。\n我們估計資料集的二進位內秉維度，它量化描述資料所需的最小獨立座標數，因此是語義複雜性的代理。\n所提出的演算法在很大程度上不受所謂的維度詛咒影響，因此可用於大資料分析。\n我們測試此方法來識別模型磁性系統中的相變，然後將其應用於深度神經網路中影像和文字的語義相關性偵測。", "author": "Santiago Acevedo et.al.", "authors": "Santiago Acevedo, Alex Rodriguez, Alessandro Laio", "id": "2411.02126v1", "paper_url": "http://arxiv.org/abs/2411.02126v1", "repo": "null"}}