{"2408.10692": {"publish_time": "2024-08-20", "title": "Unconditional Truthfulness: Learning Conditional Dependency for Uncertainty Quantification of Large Language Models", "paper_summary": "Uncertainty quantification (UQ) is a perspective approach to detecting Large\nLanguage Model (LLM) hallucinations and low quality output. In this work, we\naddress one of the challenges of UQ in generation tasks that arises from the\nconditional dependency between the generation steps of an LLM. We propose to\nlearn this dependency from data. We train a regression model, which target\nvariable is the gap between the conditional and the unconditional generation\nconfidence. During LLM inference, we use this learned conditional dependency\nmodel to modulate the uncertainty of the current generation step based on the\nuncertainty of the previous step. Our experimental evaluation on nine datasets\nand three LLMs shows that the proposed method is highly effective for\nuncertainty quantification, achieving substantial improvements over rivaling\napproaches.", "paper_summary_zh": "不確定量化 (UQ) 是一種觀點方法，用於偵測大型語言模型 (LLM) 的幻覺和低品質輸出。在這項工作中，我們解決了 UQ 在生成任務中的一個挑戰，該挑戰來自 LLM 的生成步驟之間的條件依賴性。我們提議從資料中學習這種依賴性。我們訓練了一個回歸模型，其目標變數是條件生成和無條件生成信心之間的差距。在 LLM 推論期間，我們使用這個已學習的條件依賴性模型來根據前一步的不確定性來調節當前生成步驟的不確定性。我們在九個資料集和三個 LLM 上的實驗評估表明，所提出的方法對於不確定量化非常有效，與競爭方法相比取得了顯著的改進。", "author": "Artem Vazhentsev et.al.", "authors": "Artem Vazhentsev, Ekaterina Fadeeva, Rui Xing, Alexander Panchenko, Preslav Nakov, Timothy Baldwin, Maxim Panov, Artem Shelmanov", "id": "2408.10692v1", "paper_url": "http://arxiv.org/abs/2408.10692v1", "repo": "null"}}