{"2411.03417": {"publish_time": "2024-11-05", "title": "Usefulness of LLMs as an Author Checklist Assistant for Scientific Papers: NeurIPS'24 Experiment", "paper_summary": "Large language models (LLMs) represent a promising, but controversial, tool\nin aiding scientific peer review. This study evaluates the usefulness of LLMs\nin a conference setting as a tool for vetting paper submissions against\nsubmission standards. We conduct an experiment at the 2024 Neural Information\nProcessing Systems (NeurIPS) conference, where 234 papers were voluntarily\nsubmitted to an \"LLM-based Checklist Assistant.\" This assistant validates\nwhether papers adhere to the author checklist used by NeurIPS, which includes\nquestions to ensure compliance with research and manuscript preparation\nstandards. Evaluation of the assistant by NeurIPS paper authors suggests that\nthe LLM-based assistant was generally helpful in verifying checklist\ncompletion. In post-usage surveys, over 70% of authors found the assistant\nuseful, and 70% indicate that they would revise their papers or checklist\nresponses based on its feedback. While causal attribution to the assistant is\nnot definitive, qualitative evidence suggests that the LLM contributed to\nimproving some submissions. Survey responses and analysis of re-submissions\nindicate that authors made substantive revisions to their submissions in\nresponse to specific feedback from the LLM. The experiment also highlights\ncommon issues with LLMs: inaccuracy (20/52) and excessive strictness (14/52)\nwere the most frequent issues flagged by authors. We also conduct experiments\nto understand potential gaming of the system, which reveal that the assistant\ncould be manipulated to enhance scores through fabricated justifications,\nhighlighting potential vulnerabilities of automated review tools.", "paper_summary_zh": "大型語言模型 (LLM) 是一種有前途但有爭議的工具，有助於科學同行評審。本研究評估了 LLM 在會議環境中作為審查論文提交是否符合提交標準的工具的效用。我們在 2024 年神經資訊處理系統 (NeurIPS) 會議上進行了一項實驗，其中 234 篇論文自願提交給「基於 LLM 的核對清單助理」。此助理驗證論文是否符合 NeurIPS 使用的作者核對清單，其中包括確保符合研究和手稿準備標準的問題。NeurIPS 論文作者對助理的評估表明，基於 LLM 的助理通常有助於驗證核對清單完成情況。在使用後調查中，超過 70% 的作者發現該助理有用，而 70% 表示他們會根據其回饋修改論文或核對清單回應。雖然無法明確將因果關係歸因於助理，但定性證據表明，LLM 有助於改善某些提交。調查回應和重新提交的分析表明，作者根據 LLM 的具體回饋對其提交進行了實質性修改。該實驗還突出了 LLM 的常見問題：不準確 (20/52) 和過度嚴格 (14/52) 是作者標記的最常見問題。我們還進行實驗以了解系統的潛在博弈，這表明可以通過捏造的理由來操縱助理以提高分數，強調了自動化審查工具的潛在漏洞。", "author": "Alexander Goldberg et.al.", "authors": "Alexander Goldberg, Ihsan Ullah, Thanh Gia Hieu Khuong, Benedictus Kent Rachmat, Zhen Xu, Isabelle Guyon, Nihar B. Shah", "id": "2411.03417v1", "paper_url": "http://arxiv.org/abs/2411.03417v1", "repo": "null"}}