{"2502.12782": {"publish_time": "2025-02-18", "title": "VidCapBench: A Comprehensive Benchmark of Video Captioning for Controllable Text-to-Video Generation", "paper_summary": "The training of controllable text-to-video (T2V) models relies heavily on the\nalignment between videos and captions, yet little existing research connects\nvideo caption evaluation with T2V generation assessment. This paper introduces\nVidCapBench, a video caption evaluation scheme specifically designed for T2V\ngeneration, agnostic to any particular caption format. VidCapBench employs a\ndata annotation pipeline, combining expert model labeling and human refinement,\nto associate each collected video with key information spanning video\naesthetics, content, motion, and physical laws. VidCapBench then partitions\nthese key information attributes into automatically assessable and manually\nassessable subsets, catering to both the rapid evaluation needs of agile\ndevelopment and the accuracy requirements of thorough validation. By evaluating\nnumerous state-of-the-art captioning models, we demonstrate the superior\nstability and comprehensiveness of VidCapBench compared to existing video\ncaptioning evaluation approaches. Verification with off-the-shelf T2V models\nreveals a significant positive correlation between scores on VidCapBench and\nthe T2V quality evaluation metrics, indicating that VidCapBench can provide\nvaluable guidance for training T2V models. The project is available at\nhttps://github.com/VidCapBench/VidCapBench.", "paper_summary_zh": "可控制文本到影片 (T2V) 模型的訓練極度仰賴影片和字幕之間的對齊，但現有研究鮮少將影片字幕評估與 T2V 生成評估連結起來。本文介紹 VidCapBench，這是一種專門為 T2V 生成設計的影片字幕評估架構，與任何特定的字幕格式無關。VidCapBench 採用資料標註流程，結合專家模型標記和人工微調，將每個收集到的影片與涵蓋影片美學、內容、動作和物理定律等關鍵資訊關聯起來。VidCapBench 接著將這些關鍵資訊屬性分割成可自動評估和可手動評估的子集，以滿足敏捷開發的快速評估需求和全面驗證的準確性要求。透過評估許多最先進的字幕模型，我們證明了 VidCapBench 與現有的影片字幕評估方法相比，具有優異的穩定性和全面性。使用現成的 T2V 模型驗證顯示，VidCapBench 得分與 T2V 品質評估指標之間存在顯著的正相關，這表示 VidCapBench 可以為訓練 T2V 模型提供有價值的指導。專案可於 https://github.com/VidCapBench/VidCapBench 取得。", "author": "Xinlong Chen et.al.", "authors": "Xinlong Chen, Yuanxing Zhang, Chongling Rao, Yushuo Guan, Jiaheng Liu, Fuzheng Zhang, Chengru Song, Qiang Liu, Di Zhang, Tieniu Tan", "id": "2502.12782v1", "paper_url": "http://arxiv.org/abs/2502.12782v1", "repo": "null"}}