{"2407.13559": {"publish_time": "2024-07-18", "title": "Qalam : A Multimodal LLM for Arabic Optical Character and Handwriting Recognition", "paper_summary": "Arabic Optical Character Recognition (OCR) and Handwriting Recognition (HWR)\npose unique challenges due to the cursive and context-sensitive nature of the\nArabic script. This study introduces Qalam, a novel foundation model designed\nfor Arabic OCR and HWR, built on a SwinV2 encoder and RoBERTa decoder\narchitecture. Our model significantly outperforms existing methods, achieving a\nWord Error Rate (WER) of just 0.80% in HWR tasks and 1.18% in OCR tasks. We\ntrain Qalam on a diverse dataset, including over 4.5 million images from Arabic\nmanuscripts and a synthetic dataset comprising 60k image-text pairs. Notably,\nQalam demonstrates exceptional handling of Arabic diacritics, a critical\nfeature in Arabic scripts. Furthermore, it shows a remarkable ability to\nprocess high-resolution inputs, addressing a common limitation in current OCR\nsystems. These advancements underscore Qalam's potential as a leading solution\nfor Arabic script recognition, offering a significant leap in accuracy and\nefficiency.", "paper_summary_zh": "阿拉伯光學字元辨識 (OCR) 和手寫辨識 (HWR)\n由於阿拉伯文字的草書和語境相關性，因此帶來了獨特的挑戰。本研究引入了 Qalam，一種專為阿拉伯 OCR 和 HWR 設計的新型基礎模型，建立在 SwinV2 編碼器和 RoBERTa 解碼器架構上。我們的模型顯著優於現有方法，在 HWR 任務中實現了僅為 0.80% 的字元錯誤率 (WER)，在 OCR 任務中實現了 1.18% 的字元錯誤率。我們在一個多樣化的資料集上訓練 Qalam，其中包括來自阿拉伯手稿的超過 450 萬張圖片和一個包含 6 萬張圖片文字對的合成資料集。值得注意的是，Qalam 展示了對阿拉伯變音符號的出色處理，這是阿拉伯文字中的一項關鍵特徵。此外，它還展示了處理高解析度輸入的非凡能力，解決了當前 OCR 系統中的常見限制。這些進步強調了 Qalam 作為阿拉伯文字辨識領先解決方案的潛力，在準確性和效率方面提供了顯著的飛躍。", "author": "Gagan Bhatia et.al.", "authors": "Gagan Bhatia, El Moatez Billah Nagoudi, Fakhraddin Alwajih, Muhammad Abdul-Mageed", "id": "2407.13559v1", "paper_url": "http://arxiv.org/abs/2407.13559v1", "repo": "null"}}