{"2406.04635": {"publish_time": "2024-06-07", "title": "Scaling Automatic Extraction of Pseudocode", "paper_summary": "Pseudocode in a scholarly paper provides a concise way to express the\nalgorithms implemented therein. Pseudocode can also be thought of as an\nintermediary representation that helps bridge the gap between programming\nlanguages and natural languages. Having access to a large collection of\npseudocode can provide various benefits ranging from enhancing algorithmic\nunderstanding, facilitating further algorithmic design, to empowering NLP or\ncomputer vision based models for tasks such as automated code generation and\noptical character recognition (OCR). We have created a large pseudocode\ncollection by extracting nearly 320,000 pseudocode examples from arXiv papers.\nThis process involved scanning over $2.2$ million scholarly papers, with 1,000\nof them being manually inspected and labeled. Our approach encompasses an\nextraction mechanism tailored to optimize the coverage and a validation\nmechanism based on random sampling to check its accuracy and reliability, given\nthe inherent heterogeneity of the collection. In addition, we offer insights\ninto common pseudocode structures, supported by clustering and statistical\nanalyses. Notably, these analyses indicate an exponential-like growth in the\nusage of pseudocodes, highlighting their increasing significance.", "paper_summary_zh": "在學術論文中，偽代碼提供了一種簡潔的方式來表達其中實作的演算法。偽代碼也可以被視為一種中間表示，有助於彌合程式語言和自然語言之間的差距。存取大量的偽代碼可以提供各種好處，從增強演算法理解、促進進一步的演算法設計，到賦能 NLP 或基於電腦視覺的模型，以執行自動化程式碼產生和光學字元辨識 (OCR) 等任務。我們從 arXiv 論文中萃取了近 320,000 個偽代碼範例，建立了一個大型偽代碼集合。這個程序包括掃描超過 220 萬篇學術論文，並手動檢查和標記其中的 1,000 篇。我們的做法包含了一個萃取機制，專門用於最佳化涵蓋範圍，以及一個基於隨機抽樣的驗證機制，以檢查其準確性和可靠性，考量到這個集合的內在異質性。此外，我們提供了對常見偽代碼結構的見解，並輔以分群和統計分析。值得注意的是，這些分析顯示偽代碼的使用呈指數成長，突顯出它們日益重要的意義。", "author": "Levent Toksoz et.al.", "authors": "Levent Toksoz, Gang Tan, C. Lee Giles", "id": "2406.04635v1", "paper_url": "http://arxiv.org/abs/2406.04635v1", "repo": "null"}}