{"2408.03519": {"publish_time": "2024-08-07", "title": "RepoMasterEval: Evaluating Code Completion via Real-World Repositories", "paper_summary": "With the growing reliance on automated code completion tools in software\ndevelopment, the need for robust evaluation benchmarks has become critical.\nHowever, existing benchmarks focus more on code generation tasks in function\nand class level and provide rich text description to prompt the model. By\ncontrast, such descriptive prompt is commonly unavailable in real development\nand code completion can occur in wider range of situations such as in the\nmiddle of a function or a code block. These limitations makes the evaluation\npoorly align with the practical scenarios of code completion tools. In this\npaper, we propose RepoMasterEval, a novel benchmark for evaluating code\ncompletion models constructed from real-world Python and TypeScript\nrepositories. Each benchmark datum is generated by masking a code snippet\n(ground truth) from one source code file with existing test suites. To improve\ntest accuracy of model generated code, we employ mutation testing to measure\nthe effectiveness of the test cases and we manually crafted new test cases for\nthose test suites with low mutation score. Our empirical evaluation on 6\nstate-of-the-art models shows that test argumentation is critical in improving\nthe accuracy of the benchmark and RepoMasterEval is able to report difference\nin model performance in real-world scenarios. The deployment of RepoMasterEval\nin a collaborated company for one month also revealed that the benchmark is\nuseful to give accurate feedback during model training and the score is in high\ncorrelation with the model's performance in practice. Based on our findings, we\ncall for the software engineering community to build more LLM benchmarks\ntailored for code generation tools taking the practical and complex development\nenvironment into consideration.", "paper_summary_zh": "<paragraph>隨著軟體開發中越來越依賴自動化程式碼完成工具，對健全的評估基準的需求變得至關重要。\n然而，現有的基準更注重函式和類別層級的程式碼產生任務，並提供豐富的文字描述來提示模型。\n相反地，這種描述性提示通常在實際開發中不可用，而且程式碼完成可以在更廣泛的情況下發生，例如在函式或程式碼區塊的中間。\n這些限制使得評估與程式碼完成工具的實際場景對齊不佳。\n在本文中，我們提出 RepoMasterEval，這是一個用於評估從真實世界 Python 和 TypeScript 儲存庫建構的程式碼完成模型的新基準。\n每個基準資料都是透過遮蔽來自一個原始碼檔案的程式碼片段（基本事實）和現有的測試套件來產生的。\n為了提高模型產生程式碼的測試準確度，我們採用突變測試來衡量測試案例的有效性，並為突變分數低的那些測試套件手動建立新的測試案例。\n我們對 6 個最先進的模型進行的實證評估顯示，測試論證對於提高基準的準確度至關重要，而 RepoMasterEval 能夠報告真實世界場景中模型效能的差異。\n在一家合作公司中部署 RepoMasterEval 一個月後，也發現該基準有助於在模型訓練期間提供準確的回饋，而且分數與模型在實際中的效能高度相關。\n根據我們的發現，我們呼籲軟體工程社群建立更多針對程式碼產生工具量身打造的 LLM 基準，並將實際且複雜的開發環境納入考量。</paragraph>", "author": "Qinyun Wu et.al.", "authors": "Qinyun Wu, Chao Peng, Pengfei Gao, Ruida Hu, Haoyu Gan, Bo Jiang, Jinhe Tang, Zhiwen Deng, Zhanming Guan, Cuiyun Gao, Xia Liu, Ping Yang", "id": "2408.03519v1", "paper_url": "http://arxiv.org/abs/2408.03519v1", "repo": "null"}}