{"2412.15594": {"publish_time": "2024-12-20", "title": "Template-Driven LLM-Paraphrased Framework for Tabular Math Word Problem Generation", "paper_summary": "Solving tabular math word problems (TMWPs) has become a critical role in\nevaluating the mathematical reasoning ability of large language models (LLMs),\nwhere large-scale TMWP samples are commonly required for LLM fine-tuning. Since\nthe collection of high-quality TMWP datasets is costly and time-consuming,\nrecent research has concentrated on automatic TMWP generation. However, current\ngenerated samples usually suffer from issues of either correctness or\ndiversity. In this paper, we propose a Template-driven LLM-paraphrased (TeLL)\nframework for generating high-quality TMWP samples with diverse backgrounds and\naccurate tables, questions, answers, and solutions. To this end, we first\nextract templates from existing real samples to generate initial problems,\nensuring correctness. Then, we adopt an LLM to extend templates and paraphrase\nproblems, obtaining diverse TMWP samples. Furthermore, we find the reasoning\nannotation is important for solving TMWPs. Therefore, we propose to enrich each\nsolution with illustrative reasoning steps. Through the proposed framework, we\nconstruct a high-quality dataset TabMWP-TeLL by adhering to the question types\nin the TabMWP dataset, and we conduct extensive experiments on a variety of\nLLMs to demonstrate the effectiveness of TabMWP-TeLL in improving TMWP solving\nperformance. The code and data of this paper are available at:\nhttps://github.com/Jason8Kang/TELL.", "paper_summary_zh": "<paragraph>解決表格數學文字題 (TMWP) 已成為評估大型語言模型 (LLM) 的數學推理能力的一項關鍵角色，其中通常需要大規模的 TMWP 樣本進行 LLM 微調。由於收集高品質的 TMWP 資料集既昂貴又費時，因此最近的研究集中在自動化 TMWP 生成上。然而，目前產生的樣本通常會遇到正確性或多樣性的問題。在本文中，我們提出一個由範本驅動的 LLM 釋義 (TeLL) 架構，用於生成具有多樣化背景和準確表格、問題、答案和解決方案的高品質 TMWP 樣本。為此，我們首先從現有的真實樣本中提取範本以生成初始問題，確保正確性。然後，我們採用 LLM 來擴充範本和釋義問題，獲得多樣化的 TMWP 樣本。此外，我們發現推理註解對於解決 TMWP 非常重要。因此，我們建議用說明性的推理步驟豐富每個解決方案。透過所提出的架構，我們構建了一個高品質的資料集 TabMWP-TeLL，並遵循 TabMWP 資料集中的問題類型，並對各種 LLM 進行廣泛的實驗，以證明 TabMWP-TeLL 在改善 TMWP 解決效能方面的有效性。本文的程式碼和資料可在以下位置取得：\nhttps://github.com/Jason8Kang/TELL。</paragraph>", "author": "Xiaoqiang Kang et.al.", "authors": "Xiaoqiang Kang, Zimu Wang, Xiaobo Jin, Wei Wang, Kaizhu Huang, Qiufeng Wang", "id": "2412.15594v1", "paper_url": "http://arxiv.org/abs/2412.15594v1", "repo": "https://github.com/jason8kang/tell"}}