{"2501.05079": {"publish_time": "2025-01-09", "title": "Multimodal-to-Text Prompt Engineering in Large Language Models Using Feature Embeddings for GNSS Interference Characterization", "paper_summary": "Large language models (LLMs) are advanced AI systems applied across various\ndomains, including NLP, information retrieval, and recommendation systems.\nDespite their adaptability and efficiency, LLMs have not been extensively\nexplored for signal processing tasks, particularly in the domain of global\nnavigation satellite system (GNSS) interference monitoring. GNSS interference\nmonitoring is essential to ensure the reliability of vehicle localization on\nroads, a critical requirement for numerous applications. However, GNSS-based\npositioning is vulnerable to interference from jamming devices, which can\ncompromise its accuracy. The primary objective is to identify, classify, and\nmitigate these interferences. Interpreting GNSS snapshots and the associated\ninterferences presents significant challenges due to the inherent complexity,\nincluding multipath effects, diverse interference types, varying sensor\ncharacteristics, and satellite constellations. In this paper, we extract\nfeatures from a large GNSS dataset and employ LLaVA to retrieve relevant\ninformation from an extensive knowledge base. We employ prompt engineering to\ninterpret the interferences and environmental factors, and utilize t-SNE to\nanalyze the feature embeddings. Our findings demonstrate that the proposed\nmethod is capable of visual and logical reasoning within the GNSS context.\nFurthermore, our pipeline outperforms state-of-the-art machine learning models\nin interference classification tasks.", "paper_summary_zh": "大型語言模型 (LLM) 是先進的人工智慧系統，應用於各種領域，包括自然語言處理、資訊檢索和推薦系統。儘管 LLM 具有適應性和效率，但尚未廣泛探索用於訊號處理任務，特別是在全球導航衛星系統 (GNSS) 干擾監控領域。GNSS 干擾監控對於確保道路上車輛定位的可靠性至關重要，這對於許多應用來說是一項關鍵要求。然而，基於 GNSS 的定位容易受到干擾裝置的干擾，這可能會影響其準確性。主要目標是識別、分類和減輕這些干擾。由於固有的複雜性，包括多路徑效應、多樣化的干擾類型、不同的感測器特性和衛星星座，因此解釋 GNSS 快照和相關干擾會帶來重大挑戰。在本文中，我們從大型 GNSS 資料集中提取特徵，並使用 LLaVA 從廣泛的知識庫中檢索相關資訊。我們採用提示工程來解釋干擾和環境因素，並利用 t-SNE 來分析特徵嵌入。我們的研究結果表明，所提出的方法能夠在 GNSS 背景下進行視覺和邏輯推理。此外，我們的管道在干擾分類任務中優於最先進的機器學習模型。", "author": "Harshith Manjunath et.al.", "authors": "Harshith Manjunath, Lucas Heublein, Tobias Feigl, Felix Ott", "id": "2501.05079v1", "paper_url": "http://arxiv.org/abs/2501.05079v1", "repo": "null"}}