{"2411.18350": {"publish_time": "2024-11-27", "title": "TryOffDiff: Virtual-Try-Off via High-Fidelity Garment Reconstruction using Diffusion Models", "paper_summary": "This paper introduces Virtual Try-Off (VTOFF), a novel task focused on\ngenerating standardized garment images from single photos of clothed\nindividuals. Unlike traditional Virtual Try-On (VTON), which digitally dresses\nmodels, VTOFF aims to extract a canonical garment image, posing unique\nchallenges in capturing garment shape, texture, and intricate patterns. This\nwell-defined target makes VTOFF particularly effective for evaluating\nreconstruction fidelity in generative models. We present TryOffDiff, a model\nthat adapts Stable Diffusion with SigLIP-based visual conditioning to ensure\nhigh fidelity and detail retention. Experiments on a modified VITON-HD dataset\nshow that our approach outperforms baseline methods based on pose transfer and\nvirtual try-on with fewer pre- and post-processing steps. Our analysis reveals\nthat traditional image generation metrics inadequately assess reconstruction\nquality, prompting us to rely on DISTS for more accurate evaluation. Our\nresults highlight the potential of VTOFF to enhance product imagery in\ne-commerce applications, advance generative model evaluation, and inspire\nfuture work on high-fidelity reconstruction. Demo, code, and models are\navailable at: https://rizavelioglu.github.io/tryoffdiff/", "paper_summary_zh": "這篇論文介紹了虛擬試穿 (VTOFF)，這是一項新穎的任務，專注於從穿著衣服的個人的單張照片中產生標準化的服裝影像。與傳統的虛擬試穿 (VTON) 不同，後者以數位方式為模特兒穿衣服，VTOFF 旨在提取標準的服裝影像，在捕捉服裝形狀、紋理和複雜圖案方面面臨獨特的挑戰。這個定義明確的目標讓 VTOFF 特別有效於評估生成模型中的重建保真度。我們提出了 TryOffDiff，一個使用基於 SigLIP 的視覺條件調整 Stable Diffusion 的模型，以確保高保真度和細節保留。在修改過的 VITON-HD 資料集上進行的實驗表明，我們的做法優於基於姿勢轉移和虛擬試穿的基準方法，並且預處理和後處理步驟更少。我們的分析顯示，傳統的影像生成指標無法充分評估重建品質，促使我們依賴 DISTS 進行更準確的評估。我們的結果突顯了 VTOFF 在提升電子商務應用程式中產品影像的潛力，推進生成模型評估，並激勵未來在高保真度重建方面的工作。示範、程式碼和模型可在 https://rizavelioglu.github.io/tryoffdiff/ 取得。", "author": "Riza Velioglu et.al.", "authors": "Riza Velioglu, Petra Bevandic, Robin Chan, Barbara Hammer", "id": "2411.18350v1", "paper_url": "http://arxiv.org/abs/2411.18350v1", "repo": "null"}}