{"2412.15113": {"publish_time": "2024-12-19", "title": "Associative memory inspires improvements for in-context learning using a novel attention residual stream architecture", "paper_summary": "Large language models (LLMs) demonstrate an impressive ability to utilise\ninformation within the context of their input sequences to appropriately\nrespond to data unseen by the LLM during its training procedure. This ability\nis known as in-context learning (ICL). Humans and non-human animals demonstrate\nsimilar abilities, however their neural architectures differ substantially from\nLLMs. Despite this, a critical component within LLMs, the attention mechanism,\nresembles modern associative memory models, widely used in and influenced by\nthe computational neuroscience community to model biological memory systems.\nUsing this connection, we introduce an associative memory model capable of\nperforming ICL. We use this as inspiration for a novel residual stream\narchitecture which allows information to directly flow between attention heads.\nWe test this architecture during training within a two-layer Transformer and\nshow its ICL abilities manifest more quickly than without this modification. We\nthen apply our architecture in small language models with 8 million parameters,\nfocusing on attention head values, with results also indicating improved ICL\nperformance at this larger and more naturalistic scale.", "paper_summary_zh": "大型語言模型 (LLM) 表現出令人印象深刻的能力，能夠利用其輸入序列中的資訊，適當地回應 LLM 在訓練過程中未見過的資料。這種能力稱為語境中學習 (ICL)。人類和非人類動物表現出類似的能力，但他們的神經架構與 LLM 有很大不同。儘管如此，LLM 中的一個關鍵組成部分，注意機制，類似於現代聯想記憶模型，在計算神經科學社群中廣泛使用並受到其影響，用於建模生物記憶系統。利用這種聯繫，我們引入了一個能夠執行 ICL 的聯想記憶模型。我們以此為靈感，打造了一個新穎的殘差串流架構，讓資訊能夠直接在注意權重之間流動。我們在一個兩層 Transformer 中訓練期間測試這個架構，並展示其 ICL 能力比沒有這個修改時表現得更快。然後，我們將我們的架構應用於具有 800 萬個參數的小語言模型，專注於注意權重值，結果也表明在這個更大且更自然的規模下，ICL 效能有所提升。", "author": "Thomas F Burns et.al.", "authors": "Thomas F Burns, Tomoki Fukai, Christopher J Earls", "id": "2412.15113v1", "paper_url": "http://arxiv.org/abs/2412.15113v1", "repo": "https://github.com/tfburns/amicl-and-residual-attention-streams"}}