{"2410.09350": {"publish_time": "2024-10-12", "title": "Generative Subgraph Retrieval for Knowledge Graph-Grounded Dialog Generation", "paper_summary": "Knowledge graph-grounded dialog generation requires retrieving a\ndialog-relevant subgraph from the given knowledge base graph and integrating it\nwith the dialog history. Previous works typically represent the graph using an\nexternal encoder, such as graph neural networks, and retrieve relevant triplets\nbased on the similarity between single-vector representations of triplets and\nthe dialog history. However, these external encoders fail to leverage the rich\nknowledge of pretrained language models, and the retrieval process is also\nsuboptimal due to the information bottleneck caused by the single-vector\nabstraction of the dialog history. In this work, we propose Dialog generation\nwith Generative Subgraph Retrieval (DialogGSR), which retrieves relevant\nknowledge subgraphs by directly generating their token sequences on top of\nlanguage models. For effective generative subgraph retrieval, we introduce two\nkey methods: (i) structure-aware knowledge graph linearization with\nself-supervised graph-specific tokens and (ii) graph-constrained decoding\nutilizing graph structural proximity-based entity informativeness scores for\nvalid and relevant generative retrieval. DialogGSR achieves state-of-the-art\nperformance in knowledge graph-grounded dialog generation, as demonstrated on\nOpenDialKG and KOMODIS datasets.", "paper_summary_zh": "知識圖譜對話生成需要從給定的知識庫圖譜中擷取與對話相關的子圖，並將其與對話記錄整合。先前的研究通常使用外部編碼器（例如圖形神經網路）來表示圖形，並根據三元組的單向量表示與對話記錄之間的相似性來擷取相關的三元組。然而，這些外部編碼器無法利用預訓練語言模型的豐富知識，而擷取過程也因對話記錄的單向量抽象化造成的資訊瓶頸而次於最佳。在這項工作中，我們提出帶有生成子圖擷取的對話生成（DialogGSR），它直接在語言模型之上生成其標記序列來擷取相關的知識子圖。為了有效地生成子圖擷取，我們引入了兩種關鍵方法：（一）具有自我監督圖形特定標記的結構感知知識圖形線性化，以及（二）利用圖形結構鄰近度為基礎的實體資訊性分數進行圖形約束解碼，以進行有效且相關的生成性擷取。DialogGSR 在知識圖譜對話生成中實現了最先進的效能，如 OpenDialKG 和 KOMODIS 資料集所示。", "author": "Jinyoung Park et.al.", "authors": "Jinyoung Park, Minseok Joo, Joo-Kyung Kim, Hyunwoo J. Kim", "id": "2410.09350v1", "paper_url": "http://arxiv.org/abs/2410.09350v1", "repo": "null"}}