{"2410.18967": {"publish_time": "2024-10-24", "title": "Ferret-UI 2: Mastering Universal User Interface Understanding Across Platforms", "paper_summary": "Building a generalist model for user interface (UI) understanding is\nchallenging due to various foundational issues, such as platform diversity,\nresolution variation, and data limitation. In this paper, we introduce\nFerret-UI 2, a multimodal large language model (MLLM) designed for universal UI\nunderstanding across a wide range of platforms, including iPhone, Android,\niPad, Webpage, and AppleTV. Building on the foundation of Ferret-UI, Ferret-UI\n2 introduces three key innovations: support for multiple platform types,\nhigh-resolution perception through adaptive scaling, and advanced task training\ndata generation powered by GPT-4o with set-of-mark visual prompting. These\nadvancements enable Ferret-UI 2 to perform complex, user-centered interactions,\nmaking it highly versatile and adaptable for the expanding diversity of\nplatform ecosystems. Extensive empirical experiments on referring, grounding,\nuser-centric advanced tasks (comprising 9 subtasks $\\times$ 5 platforms), GUIDE\nnext-action prediction dataset, and GUI-World multi-platform benchmark\ndemonstrate that Ferret-UI 2 significantly outperforms Ferret-UI, and also\nshows strong cross-platform transfer capabilities.", "paper_summary_zh": "<paragraph>建立一個通用的使用者介面 (UI) 理解模型，由於各種基礎問題（例如平台多樣性、解析度差異和資料限制）而具有挑戰性。在本文中，我們介紹 Ferret-UI 2，這是一個多模態大型語言模型 (MLLM)，旨在跨越廣泛的平台（包括 iPhone、Android、iPad、網頁和 AppleTV）進行通用的 UI 理解。在 Ferret-UI 的基礎上，Ferret-UI 2 引入了三項關鍵創新：支援多種平台類型、透過自適應縮放進行高解析度感知，以及由 GPT-4o 提供支援的進階任務訓練資料產生，並搭配一組視覺提示。這些進展使 Ferret-UI 2 能夠執行複雜且以使用者為中心的互動，使其高度靈活且適應不斷擴展的多樣化平台生態系統。在指涉、基礎、以使用者為中心的進階任務（包含 9 個子任務 $\\times$ 5 個平台）、GUIDE 下一個動作預測資料集和 GUI-World 多平台基準上的廣泛實證實驗證明，Ferret-UI 2 明顯優於 Ferret-UI，並且還展現了強大的跨平台傳輸能力。</paragraph>", "author": "Zhangheng Li et.al.", "authors": "Zhangheng Li, Keen You, Haotian Zhang, Di Feng, Harsh Agrawal, Xiujun Li, Mohana Prasad Sathya Moorthy, Jeff Nichols, Yinfei Yang, Zhe Gan", "id": "2410.18967v1", "paper_url": "http://arxiv.org/abs/2410.18967v1", "repo": "null"}}