{"2412.11803": {"publish_time": "2024-12-16", "title": "UAlign: Leveraging Uncertainty Estimations for Factuality Alignment on Large Language Models", "paper_summary": "Despite demonstrating impressive capabilities, Large Language Models (LLMs)\nstill often struggle to accurately express the factual knowledge they possess,\nespecially in cases where the LLMs' knowledge boundaries are ambiguous. To\nimprove LLMs' factual expressions, we propose the UAlign framework, which\nleverages Uncertainty estimations to represent knowledge boundaries, and then\nexplicitly incorporates these representations as input features into prompts\nfor LLMs to Align with factual knowledge. First, we prepare the dataset on\nknowledge question-answering (QA) samples by calculating two uncertainty\nestimations, including confidence score and semantic entropy, to represent the\nknowledge boundaries for LLMs. Subsequently, using the prepared dataset, we\ntrain a reward model that incorporates uncertainty estimations and then employ\nthe Proximal Policy Optimization (PPO) algorithm for factuality alignment on\nLLMs. Experimental results indicate that, by integrating uncertainty\nrepresentations in LLM alignment, the proposed UAlign can significantly enhance\nthe LLMs' capacities to confidently answer known questions and refuse unknown\nquestions on both in-domain and out-of-domain tasks, showing reliability\nimprovements and good generalizability over various prompt- and training-based\nbaselines.", "paper_summary_zh": "儘管展示了令人印象深刻的能力，大型語言模型（LLM）\n仍然常常難以準確表達他們所擁有的事實知識，\n特別是在 LLM 的知識界線模糊的情況下。為了\n改善 LLM 的事實表達，我們提出了 UAlign 框架，它\n利用不確定性估計來表示知識界線，然後\n明確定義這些表示，作為輸入特徵，提示 LLM 與事實知識對齊。首先，我們準備知識問答（QA）範例的資料集，藉由計算兩個不確定性估計，包括信心分數和語義熵，來表示 LLM 的知識界線。隨後，使用準備好的資料集，我們訓練一個結合不確定性估計的獎勵模型，然後使用近端策略最佳化（PPO）演算法在 LLM 上進行事實對齊。實驗結果表明，藉由整合 LLM 對齊中的不確定性表示，所提出的 UAlign 可以顯著增強 LLM 在已知問題上自信回答和拒絕未知問題的能力，無論是在網域內還是網域外任務，在各種提示和基於訓練的基準上顯示出可靠性的改進和良好的泛化性。", "author": "Boyang Xue et.al.", "authors": "Boyang Xue, Fei Mi, Qi Zhu, Hongru Wang, Rui Wang, Sheng Wang, Erxin Yu, Xuming Hu, Kam-Fai Wong", "id": "2412.11803v1", "paper_url": "http://arxiv.org/abs/2412.11803v1", "repo": "null"}}