{"2406.18178": {"publish_time": "2024-06-26", "title": "Games of Knightian Uncertainty", "paper_summary": "Arguably, for the latter part of the late 20th and early 21st centuries,\ngames have been seen as the drosophila of AI. Games are a set of exciting\ntestbeds, whose solutions (in terms of identifying optimal players) would lead\nto machines that would possess some form of general intelligence, or at the\nvery least help us gain insights toward building intelligent machines.\nFollowing impressive successes in traditional board games like Go, Chess, and\nPoker, but also video games like the Atari 2600 collection, it is clear that\nthis is not the case. Games have been attacked successfully, but we are nowhere\nnear AGI developments (or, as harsher critics might say, useful AI\ndevelopments!). In this short vision paper, we argue that for game research to\nbecome again relevant to the AGI pathway, we need to be able to address\n\\textit{Knightian uncertainty} in the context of games, i.e. agents need to be\nable to adapt to rapid changes in game rules on the fly with no warning, no\nprevious data, and no model access.", "paper_summary_zh": "可以說，在 20 世紀末和 21 世紀初的後半段，遊戲被視為 AI 的果蠅。遊戲是一組令人興奮的測試平台，其解決方案（在識別最佳玩家方面）將導致擁有某種形式的通用智能的機器，或至少幫助我們獲得對構建智能機器的見解。在圍棋、國際象棋和撲克等傳統棋盤遊戲以及 Atari 2600 收藏等電子遊戲中取得令人印象深刻的成功之後，很明顯情況並非如此。遊戲已經成功受到攻擊，但我們遠遠沒有達到 AGI 發展（或者，正如嚴厲的批評者所說，有用的 AI 發展！）。在這篇簡短的願景論文中，我們認為遊戲研究要再次與 AGI 路徑相關，我們需要能夠在遊戲的背景下解決「奈特不確定性」，即代理必須能夠在沒有警告、沒有先前數據和沒有模型訪問的情況下適應遊戲規則的快速變化。", "author": "Spyridon Samothrakis et.al.", "authors": "Spyridon Samothrakis, Dennis J. N. J. Soemers, Damian Machlanski", "id": "2406.18178v1", "paper_url": "http://arxiv.org/abs/2406.18178v1", "repo": "null"}}