{"2501.17420": {"publish_time": "2025-01-29", "title": "Actions Speak Louder than Words: Agent Decisions Reveal Implicit Biases in Language Models", "paper_summary": "While advances in fairness and alignment have helped mitigate overt biases\nexhibited by large language models (LLMs) when explicitly prompted, we\nhypothesize that these models may still exhibit implicit biases when simulating\nhuman behavior. To test this hypothesis, we propose a technique to\nsystematically uncover such biases across a broad range of sociodemographic\ncategories by assessing decision-making disparities among agents with\nLLM-generated, sociodemographically-informed personas. Using our technique, we\ntested six LLMs across three sociodemographic groups and four decision-making\nscenarios. Our results show that state-of-the-art LLMs exhibit significant\nsociodemographic disparities in nearly all simulations, with more advanced\nmodels exhibiting greater implicit biases despite reducing explicit biases.\nFurthermore, when comparing our findings to real-world disparities reported in\nempirical studies, we find that the biases we uncovered are directionally\naligned but markedly amplified. This directional alignment highlights the\nutility of our technique in uncovering systematic biases in LLMs rather than\nrandom variations; moreover, the presence and amplification of implicit biases\nemphasizes the need for novel strategies to address these biases.", "paper_summary_zh": "<paragraph>雖然公平性和對齊的進展有助於減輕大型語言模型 (LLM) 在明確提示下表現出的明顯偏見，但我們假設這些模型在模擬人類行為時仍可能表現出隱含偏見。為了驗證這個假設，我們提出了一種技術，通過評估具有 LLM 生成、社會人口統計資料知情角色的代理之間的決策差異，系統地揭示廣泛的社會人口統計類別中的此類偏見。使用我們的技術，我們在三個社會人口統計群組和四個決策制定場景中測試了六個 LLM。我們的結果表明，最先進的 LLM 在幾乎所有模擬中都表現出顯著的社會人口統計差異，儘管減少了明顯偏見，但更先進的模型表現出更大的隱含偏見。此外，當將我們的發現與實證研究中報告的現實世界差異進行比較時，我們發現我們發現的偏見在方向上是一致的，但明顯放大。這種方向一致性突出了我們的技術在揭示 LLM 中的系統性偏見而不是隨機變異方面的效用；此外，隱含偏見的存在和放大強調了需要新的策略來解決這些偏見。</paragraph>", "author": "Yuxuan Li et.al.", "authors": "Yuxuan Li, Hirokazu Shirado, Sauvik Das", "id": "2501.17420v1", "paper_url": "http://arxiv.org/abs/2501.17420v1", "repo": "null"}}