{"2407.05580": {"publish_time": "2024-07-08", "title": "$\\mathrm{E^{2}CFD}$: Towards Effective and Efficient Cost Function Design for Safe Reinforcement Learning via Large Language Model", "paper_summary": "Different classes of safe reinforcement learning algorithms have shown\nsatisfactory performance in various types of safety requirement scenarios.\nHowever, the existing methods mainly address one or several classes of specific\nsafety requirement scenario problems and cannot be applied to arbitrary safety\nrequirement scenarios. In addition, the optimization objectives of existing\nreinforcement learning algorithms are misaligned with the task requirements.\nBased on the need to address these issues, we propose $\\mathrm{E^{2}CFD}$, an\neffective and efficient cost function design framework. $\\mathrm{E^{2}CFD}$\nleverages the capabilities of a large language model (LLM) to comprehend\nvarious safety scenarios and generate corresponding cost functions. It\nincorporates the \\textit{fast performance evaluation (FPE)} method to\nfacilitate rapid and iterative updates to the generated cost function. Through\nthis iterative process, $\\mathrm{E^{2}CFD}$ aims to obtain the most suitable\ncost function for policy training, tailored to the specific tasks within the\nsafety scenario. Experiments have proven that the performance of policies\ntrained using this framework is superior to traditional safe reinforcement\nlearning algorithms and policies trained with carefully designed cost\nfunctions.", "paper_summary_zh": "不同的安全强化学习算法类别在各种类型安全需求场景中表现出令人满意的性能。\n然而，现有的方法主要解决一类或几类特定安全需求场景问题，不能应用于任意的安全需求场景。此外，现有的强化学习算法的优化目标与任务需求不一致。\n基于解决这些问题的需要，我们提出了$\\mathrm{E^{2}CFD}$，这是一个有效且高效的成本函数设计框架。$\\mathrm{E^{2}CFD}$利用大语言模型（LLM）的能力来理解各种安全场景并生成相应的成本函数。它结合了\\textit{快速性能评估（FPE）}方法，以促进对生成成本函数的快速迭代更新。通过这个迭代过程，$\\mathrm{E^{2}CFD}$旨在获得最适合策略训练的成本函数，针对安全场景中的特定任务。实验表明，使用此框架训练的策略的性能优于传统的安全强化学习算法和使用精心设计的成本函数训练的策略。", "author": "Zepeng Wang et.al.", "authors": "Zepeng Wang, Chao Ma, Linjiang Zhou, Libing Wu, Lei Yang, Xiaochuan Shi, Guojun Peng", "id": "2407.05580v1", "paper_url": "http://arxiv.org/abs/2407.05580v1", "repo": "null"}}