{"2411.07722": {"publish_time": "2024-11-12", "title": "Is Cognition consistent with Perception? Assessing and Mitigating Multimodal Knowledge Conflicts in Document Understanding", "paper_summary": "Multimodal large language models (MLLMs) have shown impressive capabilities\nin document understanding, a rapidly growing research area with significant\nindustrial demand in recent years. As a multimodal task, document understanding\nrequires models to possess both perceptual and cognitive abilities. However,\ncurrent MLLMs often face conflicts between perception and cognition. Taking a\ndocument VQA task (cognition) as an example, an MLLM might generate answers\nthat do not match the corresponding visual content identified by its OCR\n(perception). This conflict suggests that the MLLM might struggle to establish\nan intrinsic connection between the information it \"sees\" and what it\n\"understands.\" Such conflicts challenge the intuitive notion that cognition is\nconsistent with perception, hindering the performance and explainability of\nMLLMs. In this paper, we define the conflicts between cognition and perception\nas Cognition and Perception (C&P) knowledge conflicts, a form of multimodal\nknowledge conflicts, and systematically assess them with a focus on document\nunderstanding. Our analysis reveals that even GPT-4o, a leading MLLM, achieves\nonly 68.6% C&P consistency. To mitigate the C&P knowledge conflicts, we propose\na novel method called Multimodal Knowledge Consistency Fine-tuning. This method\nfirst ensures task-specific consistency and then connects the cognitive and\nperceptual knowledge. Our method significantly reduces C&P knowledge conflicts\nacross all tested MLLMs and enhances their performance in both cognitive and\nperceptual tasks in most scenarios.", "paper_summary_zh": "多模態大型語言模型 (MMLM) 在文件理解方面展現了令人印象深刻的能力，這是一個近年來快速發展的研究領域，在產業上有著重大的需求。作為一個多模態任務，文件理解需要模型具備感知和認知能力。然而，現有的 MLLM 經常面臨感知和認知之間的衝突。以文件 VQA 任務（認知）為例，MMLM 產生的答案可能與其 OCR（感知）識別的對應視覺內容不符。這種衝突表明，MMLM 可能難以在它「看見」的資訊和它「理解」的資訊之間建立內在的連結。這種衝突挑戰了認知與感知一致的直覺觀念，阻礙了 MLLM 的效能和可解釋性。在本文中，我們將認知和感知之間的衝突定義為認知與感知 (C&P) 知識衝突，這是一種多模態知識衝突，並專注於文件理解，對它們進行系統性的評估。我們的分析顯示，即使是領先的 MLLM GPT-4o，也只達到了 68.6% 的 C&P 一致性。為了減輕 C&P 知識衝突，我們提出了一種稱為多模態知識一致性微調的新方法。此方法首先確保任務特定的相容性，然後連結認知和感知知識。我們的這項方法大幅減少了所有經過測試的 MLLM 中的 C&P 知識衝突，並在大多數情況下提升了它們在認知和感知任務中的效能。", "author": "Zirui Shao et.al.", "authors": "Zirui Shao, Chuwei Luo, Zhaoqing Zhu, Hangdi Xing, Zhi Yu, Qi Zheng, Jiajun Bu", "id": "2411.07722v1", "paper_url": "http://arxiv.org/abs/2411.07722v1", "repo": "null"}}