{"2411.03782": {"publish_time": "2024-11-06", "title": "Navigating the landscape of multimodal AI in medicine: a scoping review on technical challenges and clinical applications", "paper_summary": "Recent technological advances in healthcare have led to unprecedented growth\nin patient data quantity and diversity. While artificial intelligence (AI)\nmodels have shown promising results in analyzing individual data modalities,\nthere is increasing recognition that models integrating multiple complementary\ndata sources, so-called multimodal AI, could enhance clinical decision-making.\nThis scoping review examines the landscape of deep learning-based multimodal AI\napplications across the medical domain, analyzing 432 papers published between\n2018 and 2024. We provide an extensive overview of multimodal AI development\nacross different medical disciplines, examining various architectural\napproaches, fusion strategies, and common application areas. Our analysis\nreveals that multimodal AI models consistently outperform their unimodal\ncounterparts, with an average improvement of 6.2 percentage points in AUC.\nHowever, several challenges persist, including cross-departmental coordination,\nheterogeneous data characteristics, and incomplete datasets. We critically\nassess the technical and practical challenges in developing multimodal AI\nsystems and discuss potential strategies for their clinical implementation,\nincluding a brief overview of commercially available multimodal AI models for\nclinical decision-making. Additionally, we identify key factors driving\nmultimodal AI development and propose recommendations to accelerate the field's\nmaturation. This review provides researchers and clinicians with a thorough\nunderstanding of the current state, challenges, and future directions of\nmultimodal AI in medicine.", "paper_summary_zh": "醫療保健領域的近期科技進展導致病患資料數量和多樣性前所未有的成長。儘管人工智慧 (AI) 模型在分析個別資料模式中展現出有前途的成果，但整合多個互補資料來源的模型，即所謂的多模式 AI，可以提升臨床決策制定，這項認知正與日俱增。這篇範圍探討回顧研究探討了涵蓋醫療領域的深度學習基礎多模式 AI 應用現況，分析 2018 年至 2024 年間發表的 432 篇論文。我們提供了多模式 AI 發展的廣泛概觀，涵蓋不同的醫療領域，探討各種架構方法、融合策略和常見應用領域。我們的分析顯示，多模式 AI 模型始終優於其單一模式的對應模型，AUC 平均改善 6.2 個百分點。然而，仍有許多挑戰持續存在，包括跨部門協調、異質資料特性和不完整資料集。我們批判性地評估開發多模式 AI 系統在技術和實務上的挑戰，並討論其臨床實作的潛在策略，包括對市售多模式 AI 模型的簡要概述，用於臨床決策制定。此外，我們找出推動多模式 AI 發展的主要因素，並提出建議以加速該領域的成熟。本回顧研究讓研究人員和臨床醫師深入了解多模式 AI 在醫學領域的現況、挑戰和未來方向。", "author": "Daan Schouten et.al.", "authors": "Daan Schouten, Giulia Nicoletti, Bas Dille, Catherine Chia, Pierpaolo Vendittelli, Megan Schuurmans, Geert Litjens, Nadieh Khalili", "id": "2411.03782v1", "paper_url": "http://arxiv.org/abs/2411.03782v1", "repo": "null"}}