{"2404.18731": {"publish_time": "2024-04-29", "title": "Real Time Multi Organ Classification on Computed Tomography Images", "paper_summary": "Organ segmentation is a fundamental task in medical imaging, and it is useful\nfor many clinical automation pipelines. Typically, the process involves\nsegmenting the entire volume, which can be unnecessary when the points of\ninterest are limited. In those cases, a classifier could be used instead of\nsegmentation. However, there is an inherent trade-off between the context size\nand the speed of classifiers. To address this issue, we propose a new method\nthat employs a data selection strategy with sparse sampling across a wide field\nof view without image resampling. This sparse sampling strategy makes it\npossible to classify voxels into multiple organs in real time without using\naccelerators. Although our method is an independent classifier, it can generate\nfull segmentation by querying grid locations at any resolution. We have\ncompared our method with existing segmentation techniques, demonstrating its\npotential for superior runtime in practical applications in medical imaging.", "paper_summary_zh": "器官分割是醫學影像的基本任務，對於許多臨床自動化管道很有用。通常，此程序包括分割整個體積，當感興趣的點有限時，這可能是沒有必要的。在這些情況下，可以使用分類器代替分割。但是，分類器的大小和速度之間存在固有的權衡。為了解決這個問題，我們提出了一種新方法，該方法採用了在整個視野中採用稀疏採樣的數據選擇策略，而無需圖像重新採樣。這種稀疏採樣策略使得可以將體素分類為多個器官，而無需使用加速器。儘管我們的分類器是一個獨立的分類器，但它可以通過查詢任何解析度下的網格位置來生成完整的分割。我們已將我們的分類器與現有的分割技術進行了比較，證明了其在醫學影像實際應用中具有更佳運行時間的潛力。", "author": "Halid Ziya Yerebakan et.al.", "authors": "Halid Ziya Yerebakan, Yoshihisa Shinagawa, Gerardo Hermosillo Valadez", "id": "2404.18731v1", "paper_url": "http://arxiv.org/abs/2404.18731v1", "repo": "null"}}