{"2407.20582": {"publish_time": "2024-07-30", "title": "Image-based Detection of Segment Misalignment in Multi-mirror Satellites using Transfer Learning", "paper_summary": "In this paper, we introduce a system based on transfer learning for detecting\nsegment misalignment in multimirror satellites, such as future CubeSat designs\nand the James Webb Space Telescope (JWST), using image-based methods. When a\nmirror segment becomes misaligned due to various environmental factors, such as\nspace debris, the images can become distorted with a shifted copy of itself\ncalled a \"ghost image\". To detect whether segments are misaligned, we use\npre-trained, large-scale image models trained on the Fast Fourier Transform\n(FFT) of patches of satellite images in grayscale. Multi-mirror designs can use\nany arbitrary number of mirrors. For our purposes, the tests were performed on\nsimulated CubeSats with 4, 6, and 8 segments. For system design, we took this\ninto account when we want to know when a satellite has a misaligned segment and\nhow many segments are misaligned. The intensity of the ghost image is directly\nproportional to the number of segments misaligned. Models trained for intensity\nclassification attempted to classify N-1 segments. Across eight classes, binary\nmodels were able to achieve a classification accuracy of 98.75%, and models for\nintensity classification were able to achieve an accuracy of 98.05%.", "paper_summary_zh": "<paragraph>在本文中，我們介紹一個基於轉移學習的系統，用於檢測多鏡面衛星（例如未來的 CubeSat 設計和詹姆斯韋伯太空望遠鏡 (JWST)）中的分段錯位，使用基於圖像的方法。當鏡段由於各種環境因素（例如太空碎片）而錯位時，圖像可能會因其本身的偏移副本（稱為「鬼影」）而失真。為了檢測分段是否錯位，我們使用在灰階衛星圖像補丁的快速傅立葉變換 (FFT) 上訓練的大規模預訓練圖像模型。多鏡面設計可以使用任意數量的鏡面。就我們的目的而言，測試是在模擬的 4、6 和 8 段 CubeSat 上進行的。對於系統設計，當我們想知道衛星何時有錯位分段以及有多少分段錯位時，我們會考慮這一點。鬼影的強度與錯位分段的數量成正比。為強度分類訓練的模型嘗試對 N-1 個分段進行分類。在八個類別中，二元模型能夠實現 98.75% 的分類準確度，而強度分類模型能夠實現 98.05% 的準確度。</paragraph>", "author": "C. Tanner Fredieu et.al.", "authors": "C. Tanner Fredieu, Jonathan Tesch, Andrew Kee, David Redding", "id": "2407.20582v1", "paper_url": "http://arxiv.org/abs/2407.20582v1", "repo": "null"}}