{"2407.11773": {"publish_time": "2024-07-16", "title": "Educational Personalized Learning Path Planning with Large Language Models", "paper_summary": "Educational Personalized Learning Path Planning (PLPP) aims to tailor\nlearning experiences to individual learners' needs, enhancing learning\nefficiency and engagement. Despite its potential, traditional PLPP systems\noften lack adaptability, interactivity, and transparency. This paper proposes a\nnovel approach integrating Large Language Models (LLMs) with prompt engineering\nto address these challenges. By designing prompts that incorporate\nlearner-specific information, our method guides LLMs like LLama-2-70B and GPT-4\nto generate personalized, coherent, and pedagogically sound learning paths. We\nconducted experiments comparing our method with a baseline approach across\nvarious metrics, including accuracy, user satisfaction, and the quality of\nlearning paths. The results show significant improvements in all areas,\nparticularly with GPT-4, demonstrating the effectiveness of prompt engineering\nin enhancing PLPP. Additional long-term impact analysis further validates our\nmethod's potential to improve learner performance and retention. This research\nhighlights the promise of LLMs and prompt engineering in advancing personalized\neducation.", "paper_summary_zh": "教育個人化學習路徑規劃 (PLPP) 旨在根據個別學習者的需求量身打造學習體驗，提升學習效率和參與度。儘管 PLPP 系統具有潛力，但傳統的 PLPP 系統通常缺乏適應性、互動性和透明度。本文提出了一種創新的方法，將大型語言模型 (LLM) 與提示工程相結合，以應對這些挑戰。通過設計包含學習者特定資訊的提示，我們的模型引導 LLM（例如 LLama-2-70B 和 GPT-4）生成個性化、連貫且具有教學意義的學習路徑。我們進行了實驗，在準確度、使用者滿意度和學習路徑品質等各種指標上，比較了我們的方法與基線方法。結果顯示在所有領域都有顯著的進步，特別是 GPT-4，這證明了提示工程在增強 PLPP 中的有效性。進一步的長期影響分析進一步驗證了我們的方法在改善學習者表現和保留方面的潛力。本研究強調了 LLM 和提示工程在促進個人化教育方面的潛力。", "author": "Chee Ng et.al.", "authors": "Chee Ng, Yuen Fung", "id": "2407.11773v1", "paper_url": "http://arxiv.org/abs/2407.11773v1", "repo": "null"}}