{"2411.17181": {"publish_time": "2024-11-26", "title": "A Novel Word Pair-based Gaussian Sentence Similarity Algorithm For Bengali Extractive Text Summarization", "paper_summary": "Extractive Text Summarization is the process of selecting the most\nrepresentative parts of a larger text without losing any key information.\nRecent attempts at extractive text summarization in Bengali, either relied on\nstatistical techniques like TF-IDF or used naive sentence similarity measures\nlike the word averaging technique. All of these strategies suffer from\nexpressing semantic relationships correctly. Here, we propose a novel Word\npair-based Gaussian Sentence Similarity (WGSS) algorithm for calculating the\nsemantic relation between two sentences. WGSS takes the geometric means of\nindividual Gaussian similarity values of word embedding vectors to get the\nsemantic relationship between sentences. It compares two sentences on a\nword-to-word basis which rectifies the sentence representation problem faced by\nthe word averaging method. The summarization process extracts key sentences by\ngrouping semantically similar sentences into clusters using the Spectral\nClustering algorithm. After clustering, we use TF-IDF ranking to pick the best\nsentence from each cluster. The proposed method is validated using four\ndifferent datasets, and it outperformed other recent models by 43.2\\% on\naverage ROUGE scores (ranging from 2.5\\% to 95.4\\%). It is also experimented on\nother low-resource languages i.e. Turkish, Marathi, and Hindi language, where\nwe find that the proposed method performs as similar as Bengali for these\nlanguages. In addition, a new high-quality Bengali dataset is curated which\ncontains 250 articles and a pair of summaries for each of them. We believe this\nresearch is a crucial addition to Bengali Natural Language Processing (NLP)\nresearch and it can easily be extended into other low-resource languages. We\nmade the implementation of the proposed model and data public on\n\\href{https://github.com/FMOpee/WGSS}{https://github.com/FMOpee/WGSS}.", "paper_summary_zh": "萃取式文字摘要是選擇較大型文字中具代表性的部分的過程，同時不遺失任何關鍵資訊。\n最近以孟加拉語進行萃取式文字摘要的嘗試，依賴於像 TF-IDF 的統計技術，或使用像字詞平均技術的樸素句子相似度測量。這些策略都會有正確表達語意關係的問題。在此，我們提出一個新的基於字詞對的 Gaussian 句子相似度 (WGSS) 演算法，用於計算兩個句子之間的語意關係。WGSS 取字詞嵌入向量的個別 Gaussian 相似度值的幾何平均值，以取得句子之間的語意關係。它在字詞對字詞的基礎上比較兩個句子，修正了字詞平均法所面臨的句子表示問題。摘要處理會使用 Spectral Clustering 演算法，將語意相似的句子分組成群集，以萃取關鍵句子。在分群後，我們使用 TF-IDF 排名從每個群集中選取最佳句子。我們使用四個不同的資料集驗證所提出的方法，而它在 ROUGE 分數上平均優於其他最近的模型 43.2%（範圍從 2.5% 到 95.4%）。它也用於其他低資源語言的實驗，例如土耳其語、馬拉地語和印地語，我們發現所提出的方法在這些語言中的表現與孟加拉語類似。此外，我們策劃了一個新的高品質孟加拉語資料集，其中包含 250 篇文章，以及每篇文章的一對摘要。我們相信這項研究對於孟加拉語自然語言處理 (NLP) 研究至關重要，而且可以輕鬆延伸到其他低資源語言。我們已將所提出的模型和資料的實作公開在 \\href{https://github.com/FMOpee/WGSS}{https://github.com/FMOpee/WGSS}。", "author": "Fahim Morshed et.al.", "authors": "Fahim Morshed, Md. Abdur Rahman, Sumon Ahmed", "id": "2411.17181v1", "paper_url": "http://arxiv.org/abs/2411.17181v1", "repo": "https://github.com/FMOpee/WGSS"}}