{"2501.18137": {"publish_time": "2025-01-30", "title": "Tensor Completion for Surrogate Modeling of Material Property Prediction", "paper_summary": "When designing materials to optimize certain properties, there are often many\npossible configurations of designs that need to be explored. For example, the\nmaterials' composition of elements will affect properties such as strength or\nconductivity, which are necessary to know when developing new materials.\nExploring all combinations of elements to find optimal materials becomes very\ntime consuming, especially when there are more design variables. For this\nreason, there is growing interest in using machine learning (ML) to predict a\nmaterial's properties. In this work, we model the optimization of certain\nmaterial properties as a tensor completion problem, to leverage the structure\nof our datasets and navigate the vast number of combinations of material\nconfigurations. Across a variety of material property prediction tasks, our\nexperiments show tensor completion methods achieving 10-20% decreased error\ncompared with baseline ML models such as GradientBoosting and Multilayer\nPerceptron (MLP), while maintaining similar training speed.", "paper_summary_zh": "在設計材料以最佳化特定屬性時，常有許多可能的設計配置需要探討。例如，材料的元素組成會影響強度或導電性等屬性，而這些屬性在開發新材料時是必須知道的。探索所有元素組合以找出最佳材料會非常耗時，尤其是在有更多設計變數時。因此，使用機器學習 (ML) 來預測材料屬性正受到越來越多的關注。在這項工作中，我們將特定材料屬性的最佳化建模為張量完成問題，以利用我們資料集的結構，並在大量的材料配置組合中導航。在各種材料屬性預測任務中，我們的實驗顯示，與 GradientBoosting 和多層感知器 (MLP) 等基準 ML 模型相比，張量完成方法可將誤差降低 10-20%，同時維持類似的訓練速度。", "author": "Shaan Pakala et.al.", "authors": "Shaan Pakala, Dawon Ahn, Evangelos Papalexakis", "id": "2501.18137v1", "paper_url": "http://arxiv.org/abs/2501.18137v1", "repo": "null"}}