{"2410.05224": {"publish_time": "2024-10-07", "title": "Cookbook: A framework for improving LLM generative abilities via programmatic data generating templates", "paper_summary": "Fine-tuning large language models (LLMs) on instruction datasets is a common\nway to improve their generative capabilities. However, instruction datasets can\nbe expensive and time-consuming to manually curate, and while LLM-generated\ndata is less labor-intensive, it may violate user privacy agreements or terms\nof service of LLM providers. Therefore, we seek a way of constructing\ninstruction datasets with samples that are not generated by humans or LLMs but\nstill improve LLM generative capabilities. In this work, we introduce Cookbook,\na framework that programmatically generates training data consisting of simple\npatterns over random tokens, resulting in a scalable, cost-effective approach\nthat avoids legal and privacy issues. First, Cookbook uses a template -- a data\ngenerating Python function -- to produce training data that encourages the\nmodel to learn an explicit pattern-based rule that corresponds to a desired\ntask. We find that fine-tuning on Cookbook-generated data is able to improve\nperformance on its corresponding task by up to 52.7 accuracy points. Second,\nsince instruction datasets improve performance on multiple downstream tasks\nsimultaneously, Cookbook algorithmically learns how to mix data from various\ntemplates to optimize performance on multiple tasks. On the standard multi-task\nGPT4ALL evaluation suite, Mistral-7B fine-tuned using a Cookbook-generated\ndataset attains the best accuracy on average compared to other 7B parameter\ninstruction-tuned models and is the best performing model on 3 out of 8 tasks.\nFinally, we analyze when and why Cookbook improves performance and present a\nmetric that allows us to verify that the improvement is largely explained by\nthe model's generations adhering better to template rules.", "paper_summary_zh": "<paragraph>微調大型語言模型 (LLM) 的指令資料集是一種常見的改善其生成能力的方法。然而，指令資料集的建立可能需要大量手動整理，且耗時費力；而 LLM 生成的資料雖然較不費力，卻可能違反使用者的隱私協議或 LLM 提供者的服務條款。因此，我們尋求一種方法來建構指令資料集，其中包含的範例並非由人類或 LLM 生成，但仍能提升 LLM 的生成能力。在本文中，我們介紹 Cookbook，一個以程式方式生成訓練資料的架構，這些資料由隨機代碼上的簡單模式組成，進而產生一種可擴充、經濟實惠的方法，避免法律和隱私問題。首先，Cookbook 使用一個範本（一個資料產生 Python 函式）來產生訓練資料，鼓勵模型學習與所需任務相對應的明確模式化規則。我們發現微調 Cookbook 生成的資料能夠將其對應任務的效能提升多達 52.7 個準確度點。其次，由於指令資料集可以同時提升多個下游任務的效能，Cookbook 以演算法的方式學習如何混合來自不同範本的資料，以最佳化多個任務的效能。在標準多任務 GPT4ALL 評量套件上，微調使用 Cookbook 生成的資料集的 Mistral-7B 在與其他 7B 參數指令微調模型相比之下，平均準確度最高，且在 8 個任務中有 3 個任務的表現最佳。最後，我們分析 Cookbook 何時以及為何提升效能，並提出一個指標，讓我們能夠驗證效能提升在很大程度上是由於模型的生成更符合範本規則所致。</paragraph>", "author": "Avanika Narayan et.al.", "authors": "Avanika Narayan, Mayee F. Chen, Kush Bhatia, Christopher Ré", "id": "2410.05224v1", "paper_url": "http://arxiv.org/abs/2410.05224v1", "repo": "null"}}