{"2501.12651": {"publish_time": "2025-01-22", "title": "The potential -- and the pitfalls -- of using pre-trained language models as cognitive science theories", "paper_summary": "Many studies have evaluated the cognitive alignment of Pre-trained Language\nModels (PLMs), i.e., their correspondence to adult performance across a range\nof cognitive domains. Recently, the focus has expanded to the developmental\nalignment of these models: identifying phases during training where\nimprovements in model performance track improvements in children's thinking\nover development. However, there are many challenges to the use of PLMs as\ncognitive science theories, including different architectures, different\ntraining data modalities and scales, and limited model interpretability. In\nthis paper, we distill lessons learned from treating PLMs, not as engineering\nartifacts but as cognitive science and developmental science models. We review\nassumptions used by researchers to map measures of PLM performance to measures\nof human performance. We identify potential pitfalls of this approach to\nunderstanding human thinking, and we end by enumerating criteria for using PLMs\nas credible accounts of cognition and cognitive development.", "paper_summary_zh": "許多研究評估了預訓練語言模型 (PLM) 的認知對齊，即它們在各種認知領域中與成人表現的對應關係。最近，焦點已擴展到這些模型的發展對齊：識別訓練期間的階段，其中模型表現的進步追蹤兒童思維在發展過程中的進步。然而，將 PLM 用作認知科學理論存在許多挑戰，包括不同的架構、不同的訓練數據模式和規模，以及有限的模型可解釋性。在本文中，我們從將 PLM 視為認知科學和發展科學模型，而不是工程人工製品中吸取教訓。我們回顧了研究人員用於將 PLM 效能測量對應到人類效能測量的假設。我們識別了這種理解人類思維方法的潛在缺陷，並最後列舉了將 PLM 用作認知和認知發展的可信說明的標準。", "author": "Raj Sanjay Shah et.al.", "authors": "Raj Sanjay Shah, Sashank Varma", "id": "2501.12651v1", "paper_url": "http://arxiv.org/abs/2501.12651v1", "repo": "null"}}