{"2407.16931": {"publish_time": "2024-07-24", "title": "ScholarChemQA: Unveiling the Power of Language Models in Chemical Research Question Answering", "paper_summary": "Question Answering (QA) effectively evaluates language models' reasoning and\nknowledge depth. While QA datasets are plentiful in areas like general domain\nand biomedicine, academic chemistry is less explored. Chemical QA plays a\ncrucial role in both education and research by effectively translating complex\nchemical information into readily understandable format. Addressing this gap,\nwe introduce ScholarChemQA, a large-scale QA dataset constructed from chemical\npapers. This dataset reflects typical real-world challenges, including an\nimbalanced data distribution and a substantial amount of unlabeled data that\ncan be potentially useful. Correspondingly, we introduce a QAMatch model,\nspecifically designed to effectively answer chemical questions by fully\nleveraging our collected data. We first address the issue of imbalanced label\ndistribution by re-weighting the instance-wise loss based on the inverse\nfrequency of each class, ensuring minority classes are not dominated by\nmajority ones during optimization. Next, we utilize the unlabeled data to\nenrich the learning process, generating a variety of augmentations based on a\nSoftMix operation and ensuring their predictions align with the same target,\ni.e., pseudo-labels. To ensure the quality of the pseudo-labels, we propose a\ncalibration procedure aimed at closely aligning the pseudo-label estimates of\nindividual samples with a desired ground truth distribution. Experiments show\nthat our QAMatch significantly outperforms the recent similar-scale baselines\nand Large Language Models (LLMs) not only on our ScholarChemQA dataset but also\non four benchmark datasets. We hope our benchmark and model can facilitate and\npromote more research on chemical QA.", "paper_summary_zh": "問答 (QA) 有效地評估語言模型的推理和知識深度。雖然在一般領域和生物醫學等領域中 QA 資料集很豐富，但學術化學卻較少被探討。化學 QA 在教育和研究中都扮演著關鍵角色，它能有效地將複雜的化學資訊轉換成易於理解的格式。為了解決這個差距，我們引入了 ScholarChemQA，一個由化學論文建構而成的、大規模的 QA 資料集。這個資料集反映了典型的現實世界挑戰，包括不平衡的資料分佈和大量的未標註資料，而這些資料可能具有潛在用途。相應地，我們引入了 QAMatch 模型，它專門設計用來有效地回答化學問題，並充分利用我們收集到的資料。我們首先透過根據每個類別的逆頻率重新調整每個例子的損失，來解決不平衡標籤分佈的問題，確保少數類別在最佳化過程中不會被多數類別所主導。接下來，我們利用未標註的資料來豐富學習過程，根據 SoftMix 運算產生各種增強，並確保它們的預測與同一個目標（即偽標籤）保持一致。為了確保偽標籤的品質，我們提出了一個校準程序，旨在讓個別樣本的偽標籤估計值與預期的基本事實分佈緊密一致。實驗顯示，我們的 QAMatch 不僅在我們的 ScholarChemQA 資料集上，也在四個基準資料集上，都明顯優於最近的類似規模基準和大型語言模型 (LLM)。我們希望我們的基準和模型能促進和推動更多關於化學 QA 的研究。", "author": "Xiuying Chen et.al.", "authors": "Xiuying Chen, Tairan Wang, Taicheng Guo, Kehan Guo, Juexiao Zhou, Haoyang Li, Mingchen Zhuge, Jürgen Schmidhuber, Xin Gao, Xiangliang Zhang", "id": "2407.16931v1", "paper_url": "http://arxiv.org/abs/2407.16931v1", "repo": "null"}}