{"2409.03947": {"publish_time": "2024-09-06", "title": "FODA-PG for Enhanced Medical Imaging Narrative Generation: Adaptive Differentiation of Normal and Abnormal Attributes", "paper_summary": "Automatic Medical Imaging Narrative generation aims to alleviate the workload\nof radiologists by producing accurate clinical descriptions directly from\nradiological images. However, the subtle visual nuances and domain-specific\nterminology in medical images pose significant challenges compared to generic\nimage captioning tasks. Existing approaches often neglect the vital distinction\nbetween normal and abnormal findings, leading to suboptimal performance. In\nthis work, we propose FODA-PG, a novel Fine-grained Organ-Disease Adaptive\nPartitioning Graph framework that addresses these limitations through\ndomain-adaptive learning. FODA-PG constructs a granular graphical\nrepresentation of radiological findings by separating disease-related\nattributes into distinct \"disease-specific\" and \"disease-free\" categories based\non their clinical significance and location. This adaptive partitioning enables\nour model to capture the nuanced differences between normal and pathological\nstates, mitigating the impact of data biases. By integrating this fine-grained\nsemantic knowledge into a powerful transformer-based architecture and providing\nrigorous mathematical justifications for its effectiveness, FODA-PG generates\nprecise and clinically coherent reports with enhanced generalization\ncapabilities. Extensive experiments on the IU-Xray and MIMIC-CXR benchmarks\ndemonstrate the superiority of our approach over state-of-the-art methods,\nhighlighting the importance of domain adaptation in medical report generation.", "paper_summary_zh": "自動醫學影像敘述生成旨在透過直接從放射影像產生精確的臨床描述，減輕放射科醫師的工作負擔。然而，與一般影像標題任務相比，醫學影像中的細微視覺差異和特定領域術語會帶來重大挑戰。現有方法常常忽略正常與異常發現之間的重要區別，導致次佳效能。在這項工作中，我們提出 FODA-PG，這是一個新穎的細粒度器官疾病自適應分割圖形架構，透過領域自適應學習來解決這些限制。FODA-PG 透過將疾病相關屬性依據其臨床重要性和位置分為不同的「特定疾病」和「無疾病」類別，來建構放射學發現的細粒度圖形表示。這種自適應分割使我們的模型能夠捕捉正常與病理狀態之間的細微差異，減輕資料偏差的影響。透過將這種細粒度語義知識整合到強大的基於轉換器的架構中，並提供其有效性的嚴謹數學證明，FODA-PG 能夠生成精確且臨床上連貫的報告，並具備增強的概括能力。在 IU-Xray 和 MIMIC-CXR 基準上的廣泛實驗證明了我們的方法優於最先進的方法，突顯了領域適應在醫學報告生成中的重要性。", "author": "Kai Shu et.al.", "authors": "Kai Shu, Yuzhuo Jia, Ziyang Zhang, Jiechao Gao", "id": "2409.03947v1", "paper_url": "http://arxiv.org/abs/2409.03947v1", "repo": "null"}}