{"2406.02511": {"publish_time": "2024-06-04", "title": "V-Express: Conditional Dropout for Progressive Training of Portrait Video Generation", "paper_summary": "In the field of portrait video generation, the use of single images to\ngenerate portrait videos has become increasingly prevalent. A common approach\ninvolves leveraging generative models to enhance adapters for controlled\ngeneration. However, control signals (e.g., text, audio, reference image, pose,\ndepth map, etc.) can vary in strength. Among these, weaker conditions often\nstruggle to be effective due to interference from stronger conditions, posing a\nchallenge in balancing these conditions. In our work on portrait video\ngeneration, we identified audio signals as particularly weak, often\novershadowed by stronger signals such as facial pose and reference image.\nHowever, direct training with weak signals often leads to difficulties in\nconvergence. To address this, we propose V-Express, a simple method that\nbalances different control signals through the progressive training and the\nconditional dropout operation. Our method gradually enables effective control\nby weak conditions, thereby achieving generation capabilities that\nsimultaneously take into account the facial pose, reference image, and audio.\nThe experimental results demonstrate that our method can effectively generate\nportrait videos controlled by audio. Furthermore, a potential solution is\nprovided for the simultaneous and effective use of conditions of varying\nstrengths.", "paper_summary_zh": "<paragraph>在人像影片生成领域中，使用单一影像来生成人像影片变得越来越普遍。一种常见的方法是利用生成模型来增强用于受控生成的适配器。然而，控制讯号（例如文字、音讯、参考影像、姿势、深度图等）的强度可能有所不同。在这些讯号当中，较弱的讯号往往难以发挥作用，因为会受到较强讯号的干扰，在平衡这些讯号时构成了一项挑战。在我们的人像影片生成工作中，我们发现音讯讯号特别弱，经常会被较强的讯号（例如脸部姿势和参考影像）所掩盖。然而，直接使用弱讯号进行训练通常会导致收敛困难。为了解决这个问题，我们提出了 V-Express，这是一种透过渐进式训练和条件式 Dropout 操作来平衡不同控制讯号的简单方法。我们的方法逐渐让弱讯号能够有效地进行控制，进而实现同时考量脸部姿势、参考影像和音讯的生成能力。实验结果显示，我们的方法能够有效地生成受音讯控制的人像影片。此外，我们提供了一种可能的解决方案，用于同时有效地使用强度不同的讯号。</paragraph>", "author": "Cong Wang et.al.", "authors": "Cong Wang, Kuan Tian, Jun Zhang, Yonghang Guan, Feng Luo, Fei Shen, Zhiwei Jiang, Qing Gu, Xiao Han, Wei Yang", "id": "2406.02511v1", "paper_url": "http://arxiv.org/abs/2406.02511v1", "repo": "null"}}