{"2407.21001": {"publish_time": "2024-07-30", "title": "GABInsight: Exploring Gender-Activity Binding Bias in Vision-Language Models", "paper_summary": "Vision-language models (VLMs) are intensively used in many downstream tasks,\nincluding those requiring assessments of individuals appearing in the images.\nWhile VLMs perform well in simple single-person scenarios, in real-world\napplications, we often face complex situations in which there are persons of\ndifferent genders doing different activities. We show that in such cases, VLMs\nare biased towards identifying the individual with the expected gender\n(according to ingrained gender stereotypes in the model or other forms of\nsample selection bias) as the performer of the activity. We refer to this bias\nin associating an activity with the gender of its actual performer in an image\nor text as the Gender-Activity Binding (GAB) bias and analyze how this bias is\ninternalized in VLMs. To assess this bias, we have introduced the GAB dataset\nwith approximately 5500 AI-generated images that represent a variety of\nactivities, addressing the scarcity of real-world images for some scenarios. To\nhave extensive quality control, the generated images are evaluated for their\ndiversity, quality, and realism. We have tested 12 renowned pre-trained VLMs on\nthis dataset in the context of text-to-image and image-to-text retrieval to\nmeasure the effect of this bias on their predictions. Additionally, we have\ncarried out supplementary experiments to quantify the bias in VLMs' text\nencoders and to evaluate VLMs' capability to recognize activities. Our\nexperiments indicate that VLMs experience an average performance decline of\nabout 13.2% when confronted with gender-activity binding bias.", "paper_summary_zh": "視覺語言模型 (VLM) 被廣泛用於許多下游任務，\n包括需要評估出現在影像中的人員。\n雖然 VLM 在簡單的單人情境中表現良好，但在現實世界\n的應用中，我們經常會遇到複雜的情況，其中有不同性別的人從事不同的活動。我們表明，在這種情況下，VLM 傾向於將具有預期性別的個人（根據模型中根深蒂固的性別刻板印象或其他形式的樣本選擇偏差）識別為活動的執行者。我們將這種將活動與其實際執行者的性別聯繫起來的偏差稱為性別活動綁定 (GAB) 偏差，並分析此偏差如何在 VLM 中內化。為了評估此偏差，我們引入了 GAB 資料集，其中包含約 5500 張 AI 生成的影像，這些影像代表了各種活動，解決了某些情境中缺乏真實世界影像的問題。為了進行廣泛的品質控管，我們對生成的影像進行了多樣性、品質和真實性的評估。我們在這個資料集上測試了 12 個著名的預訓練 VLM，在文字轉影像和影像轉文字檢索的背景下，以衡量此偏差對其預測的影響。此外，我們還進行了補充實驗，以量化 VLM 文字編碼器中的偏差，並評估 VLM 識別活動的能力。我們的實驗表明，當面對性別活動綁定偏差時，VLM 的平均效能下降約 13.2%。", "author": "Ali Abdollahi et.al.", "authors": "Ali Abdollahi, Mahdi Ghaznavi, Mohammad Reza Karimi Nejad, Arash Mari Oriyad, Reza Abbasi, Ali Salesi, Melika Behjati, Mohammad Hossein Rohban, Mahdieh Soleymani Baghshah", "id": "2407.21001v1", "paper_url": "http://arxiv.org/abs/2407.21001v1", "repo": "null"}}