{"2502.14898": {"publish_time": "2025-02-18", "title": "Retrieval-augmented systems can be dangerous medical communicators", "paper_summary": "Patients have long sought health information online, and increasingly, they\nare turning to generative AI to answer their health-related queries. Given the\nhigh stakes of the medical domain, techniques like retrieval-augmented\ngeneration and citation grounding have been widely promoted as methods to\nreduce hallucinations and improve the accuracy of AI-generated responses and\nhave been widely adopted into search engines. This paper argues that even when\nthese methods produce literally accurate content drawn from source documents\nsans hallucinations, they can still be highly misleading. Patients may derive\nsignificantly different interpretations from AI-generated outputs than they\nwould from reading the original source material, let alone consulting a\nknowledgeable clinician. Through a large-scale query analysis on topics\nincluding disputed diagnoses and procedure safety, we support our argument with\nquantitative and qualitative evidence of the suboptimal answers resulting from\ncurrent systems. In particular, we highlight how these models tend to\ndecontextualize facts, omit critical relevant sources, and reinforce patient\nmisconceptions or biases. We propose a series of recommendations -- such as the\nincorporation of communication pragmatics and enhanced comprehension of source\ndocuments -- that could help mitigate these issues and extend beyond the\nmedical domain.", "paper_summary_zh": "<paragraph>患者長期以來一直在網路上搜尋健康資訊，而現在他們越來越常使用生成式 AI 來回答與健康相關的問題。由於醫療領域的風險很高，因此像檢索增強生成和引文基礎等技術已被廣泛推廣為減少幻覺並提高 AI 生成的回應準確性的方法，並已廣泛採用於搜尋引擎中。本文論證，即使這些方法產生了從原始文件得出的字面準確內容，沒有幻覺，它們仍然可能具有高度誤導性。患者可能會從 AI 生成的輸出中得出與閱讀原始來源資料時截然不同的解釋，更不用說諮詢知識淵博的臨床醫生了。透過對有爭議的診斷和程序安全等主題進行大規模查詢分析，我們用定量和定性證據支持我們的論點，證明了當前系統產生的次優答案。特別是，我們強調這些模型如何傾向於將事實去脈絡化、省略關鍵相關來源，並強化患者的誤解或偏見。我們提出了一系列建議，例如納入溝通語用學和加強對原始文件的理解，這些建議可以幫助減輕這些問題，並擴展到醫療領域之外。</paragraph>", "author": "Lionel Wong et.al.", "authors": "Lionel Wong, Ayman Ali, Raymond Xiong, Shannon Zeijang Shen, Yoon Kim, Monica Agrawal", "id": "2502.14898v1", "paper_url": "http://arxiv.org/abs/2502.14898v1", "repo": "null"}}