{"2409.04103": {"publish_time": "2024-09-06", "title": "The Role of Graph Topology in the Performance of Biomedical Knowledge Graph Completion Models", "paper_summary": "Knowledge Graph Completion has been increasingly adopted as a useful method\nfor several tasks in biomedical research, like drug repurposing or drug-target\nidentification. To that end, a variety of datasets and Knowledge Graph\nEmbedding models has been proposed over the years. However, little is known\nabout the properties that render a dataset useful for a given task and, even\nthough theoretical properties of Knowledge Graph Embedding models are well\nunderstood, their practical utility in this field remains controversial. We\nconduct a comprehensive investigation into the topological properties of\npublicly available biomedical Knowledge Graphs and establish links to the\naccuracy observed in real-world applications. By releasing all model\npredictions and a new suite of analysis tools we invite the community to build\nupon our work and continue improving the understanding of these crucial\napplications.", "paper_summary_zh": "知識圖譜補全已逐漸被採用為生物醫學研究中多項任務的有用方法，例如藥物再利用或藥物靶標識別。為此，多年來已提出各種資料集和知識圖譜嵌入模型。然而，對於讓資料集對特定任務有用的屬性所知甚少，儘管知識圖譜嵌入模型的理論屬性已廣為理解，它們在該領域的實用性仍存在爭議。我們對公開的生物醫學知識圖譜的拓撲屬性進行了全面調查，並建立了與實際應用中觀察到的準確性之間的聯繫。透過釋出所有模型預測和一套新的分析工具，我們邀請社群建立在我們的研究之上，並持續改善對這些關鍵應用程式的理解。", "author": "Alberto Cattaneo et.al.", "authors": "Alberto Cattaneo, Stephen Bonner, Thomas Martynec, Carlo Luschi, Ian P Barrett, Daniel Justus", "id": "2409.04103v1", "paper_url": "http://arxiv.org/abs/2409.04103v1", "repo": "null"}}