{"2409.19925": {"publish_time": "2024-09-30", "title": "Large Language Model Empowered Embedding Generator for Sequential Recommendation", "paper_summary": "Sequential Recommender Systems (SRS) are extensively applied across various\ndomains to predict users' next interaction by modeling their interaction\nsequences. However, these systems typically grapple with the long-tail problem,\nwhere they struggle to recommend items that are less popular. This challenge\nresults in a decline in user discovery and reduced earnings for vendors,\nnegatively impacting the system as a whole. Large Language Model (LLM) has the\npotential to understand the semantic connections between items, regardless of\ntheir popularity, positioning them as a viable solution to this dilemma. In our\npaper, we present LLMEmb, an innovative technique that harnesses LLM to create\nitem embeddings that bolster the performance of SRS. To align the capabilities\nof general-purpose LLM with the needs of the recommendation domain, we\nintroduce a method called Supervised Contrastive Fine-Tuning (SCFT). This\nmethod involves attribute-level data augmentation and a custom contrastive loss\ndesigned to tailor LLM for enhanced recommendation performance. Moreover, we\nhighlight the necessity of incorporating collaborative filtering signals into\nLLM-generated embeddings and propose Recommendation Adaptation Training (RAT)\nfor this purpose. RAT refines the embeddings to be optimally suited for SRS.\nThe embeddings derived from LLMEmb can be easily integrated with any SRS model,\nshowcasing its practical utility. Extensive experimentation on three real-world\ndatasets has shown that LLMEmb significantly improves upon current methods when\napplied across different SRS models.", "paper_summary_zh": "序列推薦系統 (SRS) 廣泛應用於各種領域，透過建模使用者的互動序列來預測他們的下一個互動。然而，這些系統通常會遇到長尾問題，也就是難以推薦較不受歡迎的項目。此挑戰導致使用者探索減少，以及供應商收益降低，對系統整體造成負面影響。大型語言模型 (LLM) 有潛力了解項目之間的語義關聯，而不管其受歡迎程度如何，使其成為解決此困境的可行方案。在我們的論文中，我們提出 LLMEmb，這是一種創新的技術，利用 LLM 來建立項目嵌入，以提升 SRS 的效能。為了將通用 LLM 的功能與推薦領域的需求結合，我們引入一種稱為監督對比微調 (SCFT) 的方法。此方法涉及屬性層級資料擴充和自訂對比損失，旨在調整 LLM 以增強推薦效能。此外，我們強調將協同過濾訊號納入 LLM 生成的嵌入的必要性，並提出推薦適應訓練 (RAT) 以達到此目的。RAT 會調整嵌入，使其最適合 SRS。從 LLMEmb 衍生的嵌入可以輕鬆與任何 SRS 模型整合，展示其實用性。在三個真實世界資料集上進行的廣泛實驗顯示，LLMEmb 在應用於不同 SRS 模型時，顯著優於目前的方法。", "author": "Qidong Liu et.al.", "authors": "Qidong Liu, Xian Wu, Wanyu Wang, Yejing Wang, Yuanshao Zhu, Xiangyu Zhao, Feng Tian, Yefeng Zheng", "id": "2409.19925v1", "paper_url": "http://arxiv.org/abs/2409.19925v1", "repo": "null"}}