{"2503.09969": {"publish_time": "2025-03-13", "title": "Detecting Dataset Bias in Medical AI: A Generalized and Modality-Agnostic Auditing Framework", "paper_summary": "Data-driven AI is establishing itself at the center of evidence-based\nmedicine. However, reports of shortcomings and unexpected behavior are growing\ndue to AI's reliance on association-based learning. A major reason for this\nbehavior: latent bias in machine learning datasets can be amplified during\ntraining and/or hidden during testing. We present a data modality-agnostic\nauditing framework for generating targeted hypotheses about sources of bias\nwhich we refer to as Generalized Attribute Utility and Detectability-Induced\nbias Testing (G-AUDIT) for datasets. Our method examines the relationship\nbetween task-level annotations and data properties including protected\nattributes (e.g., race, age, sex) and environment and acquisition\ncharacteristics (e.g., clinical site, imaging protocols). G-AUDIT automatically\nquantifies the extent to which the observed data attributes may enable shortcut\nlearning, or in the case of testing data, hide predictions made based on\nspurious associations. We demonstrate the broad applicability and value of our\nmethod by analyzing large-scale medical datasets for three distinct modalities\nand learning tasks: skin lesion classification in images, stigmatizing language\nclassification in Electronic Health Records (EHR), and mortality prediction for\nICU tabular data. In each setting, G-AUDIT successfully identifies subtle\nbiases commonly overlooked by traditional qualitative methods that focus\nprimarily on social and ethical objectives, underscoring its practical value in\nexposing dataset-level risks and supporting the downstream development of\nreliable AI systems. Our method paves the way for achieving deeper\nunderstanding of machine learning datasets throughout the AI development\nlife-cycle from initial prototyping all the way to regulation, and creates\nopportunities to reduce model bias, enabling safer and more trustworthy AI\nsystems.", "paper_summary_zh": "<paragraph>數據驅動的 AI 正逐漸確立其在循證醫學中的核心地位。然而，由於 AI 依賴於基於關聯的學習，關於其缺陷和意外行為的報告也越來越多。造成這種現象的一個主要原因是：機器學習數據集中潛在的偏差會在訓練過程中被放大，並且/或者在測試過程中被隱藏。我們提出了一個與數據模態無關的審計框架，用於生成關於偏差來源的目標假設，我們將其稱為通用屬性效用和可檢測性誘導偏差測試 (G-AUDIT)。我們的方法檢查了任務級註釋與數據屬性之間的關係，包括受保護的屬性（例如種族、年齡、性別）以及環境和採集特徵（例如臨床地點、成像協議）。G-AUDIT 自動量化觀察到的數據屬性可能導致捷徑學習的程度，或者在測試數據的情況下，隱藏基於虛假關聯做出的預測的程度。我們通過分析用於三種不同模態和學習任務的大規模醫學數據集來證明我們方法的廣泛適用性和價值：圖像中的皮膚病變分類、電子健康記錄 (EHR) 中的污名化語言分類以及 ICU 表格數據的死亡率預測。在每種情況下，G-AUDIT 都成功地識別出傳統定性方法通常會忽略的細微偏差，這些方法主要關注社會和倫理目標，這突顯了它在揭示數據集級風險和支持下游可靠 AI 系統開發方面的實用價值。我們的方法為在整個 AI 開發生命週期（從初始原型設計到監管）中更深入地理解機器學習數據集鋪平了道路，並創造了減少模型偏差的機會，從而實現更安全、更值得信賴的 AI 系統。</paragraph>\n", "author": "Nathan Drenkow et.al.", "authors": "Nathan Drenkow, Mitchell Pavlak, Keith Harrigian, Ayah Zirikly, Adarsh Subbaswamy, Mathias Unberath", "id": "2503.09969v1", "paper_url": "http://arxiv.org/abs/2503.09969v1", "repo": "null"}}