{"2408.10195": {"publish_time": "2024-08-19", "title": "SpaRP: Fast 3D Object Reconstruction and Pose Estimation from Sparse Views", "paper_summary": "Open-world 3D generation has recently attracted considerable attention. While\nmany single-image-to-3D methods have yielded visually appealing outcomes, they\noften lack sufficient controllability and tend to produce hallucinated regions\nthat may not align with users' expectations. In this paper, we explore an\nimportant scenario in which the input consists of one or a few unposed 2D\nimages of a single object, with little or no overlap. We propose a novel\nmethod, SpaRP, to reconstruct a 3D textured mesh and estimate the relative\ncamera poses for these sparse-view images. SpaRP distills knowledge from 2D\ndiffusion models and finetunes them to implicitly deduce the 3D spatial\nrelationships between the sparse views. The diffusion model is trained to\njointly predict surrogate representations for camera poses and multi-view\nimages of the object under known poses, integrating all information from the\ninput sparse views. These predictions are then leveraged to accomplish 3D\nreconstruction and pose estimation, and the reconstructed 3D model can be used\nto further refine the camera poses of input views. Through extensive\nexperiments on three datasets, we demonstrate that our method not only\nsignificantly outperforms baseline methods in terms of 3D reconstruction\nquality and pose prediction accuracy but also exhibits strong efficiency. It\nrequires only about 20 seconds to produce a textured mesh and camera poses for\nthe input views. Project page: https://chaoxu.xyz/sparp.", "paper_summary_zh": "開放世界 3D 生成最近引起了相當大的關注。雖然許多單張圖片轉 3D 的方法產生了視覺上令人滿意的結果，但它們通常缺乏足夠的可控性，並且容易產生可能與使用者預期不符的幻覺區域。在本文中，我們探討了一個重要的場景，其中輸入包含一個或幾個未擺放的單一物體 2D 影像，幾乎沒有或沒有重疊。我們提出了一種新方法 SpaRP，用於重建 3D 紋理網格並估計這些稀疏視圖影像的相對相機姿勢。SpaRP 從 2D 擴散模型中提煉知識，並對它們進行微調，以隱式推論稀疏視圖之間的 3D 空間關係。擴散模型經過訓練，可以聯合預測已知姿勢下相機姿勢和物體多視圖影像的替代表示，整合輸入稀疏視圖中的所有資訊。然後利用這些預測來完成 3D 重建和姿勢估計，並且可以利用重建的 3D 模型進一步改善輸入視圖的相機姿勢。透過對三個資料集進行廣泛的實驗，我們證明了我們的方法不僅在 3D 重建品質和姿勢預測準確度方面明顯優於基準方法，而且還表現出很強的效率。它只需要大約 20 秒即可為輸入視圖產生紋理網格和相機姿勢。專案頁面：https://chaoxu.xyz/sparp。", "author": "Chao Xu et.al.", "authors": "Chao Xu, Ang Li, Linghao Chen, Yulin Liu, Ruoxi Shi, Hao Su, Minghua Liu", "id": "2408.10195v1", "paper_url": "http://arxiv.org/abs/2408.10195v1", "repo": "null"}}