{"2408.14185": {"publish_time": "2024-08-26", "title": "DynamicRouteGPT: A Real-Time Multi-Vehicle Dynamic Navigation Framework Based on Large Language Models", "paper_summary": "Real-time dynamic path planning in complex traffic environments presents\nchallenges, such as varying traffic volumes and signal wait times. Traditional\nstatic routing algorithms like Dijkstra and A* compute shortest paths but often\nfail under dynamic conditions. Recent Reinforcement Learning (RL) approaches\noffer improvements but tend to focus on local optima, risking dead-ends or\nboundary issues. This paper proposes a novel approach based on causal inference\nfor real-time dynamic path planning, balancing global and local optimality. We\nfirst use the static Dijkstra algorithm to compute a globally optimal baseline\npath. A distributed control strategy then guides vehicles along this path. At\nintersections, DynamicRouteGPT performs real-time decision-making for local\npath selection, considering real-time traffic, driving preferences, and\nunexpected events. DynamicRouteGPT integrates Markov chains, Bayesian\ninference, and large-scale pretrained language models like Llama3 8B to provide\nan efficient path planning solution. It dynamically adjusts to traffic\nscenarios and driver preferences and requires no pre-training, offering broad\napplicability across road networks. A key innovation is the construction of\ncausal graphs for counterfactual reasoning, optimizing path decisions.\nExperimental results show that our method achieves state-of-the-art performance\nin real-time dynamic path planning for multiple vehicles while providing\nexplainable path selections, offering a novel and efficient solution for\ncomplex traffic environments.", "paper_summary_zh": "在複雜交通環境中進行實時動態路徑規劃會面臨挑戰，例如交通流量變化和信號等待時間。傳統的靜態路由演算法，例如 Dijkstra 和 A*，會計算最短路徑，但通常在動態條件下會失敗。最近的強化學習 (RL) 方法提供了改進，但傾向於關注局部最優，冒著陷入死胡同或邊界問題的風險。本文提出了一種基於因果推論的新穎方法，用於實時動態路徑規劃，平衡全局和局部最優性。我們首先使用靜態 Dijkstra 演算法計算全局最優基線路徑。然後，一個分布式控制策略沿著這條路徑引導車輛。在交叉路口，DynamicRouteGPT 針對局部路徑選擇執行實時決策，考量實時交通、駕駛偏好和意外事件。DynamicRouteGPT 整合了馬可夫鏈、貝氏推論和 Llama3 8B 等大規模預先訓練的語言模型，以提供有效的路徑規劃解決方案。它會動態調整到交通狀況和駕駛偏好，並且不需要預先訓練，在道路網路上提供廣泛的適用性。一個關鍵創新是建立反事實推理的因果圖，以最佳化路徑決策。實驗結果顯示，我們的模型在多輛車輛的實時動態路徑規劃中達到最先進的效能，同時提供可解釋的路徑選擇，為複雜的交通環境提供一種新穎且有效的解決方案。", "author": "Ziai Zhou et.al.", "authors": "Ziai Zhou, Bin Zhou, Hao Liu", "id": "2408.14185v1", "paper_url": "http://arxiv.org/abs/2408.14185v1", "repo": "null"}}