{"2407.13153": {"publish_time": "2024-07-18", "title": "Preset-Voice Matching for Privacy Regulated Speech-to-Speech Translation Systems", "paper_summary": "In recent years, there has been increased demand for speech-to-speech\ntranslation (S2ST) systems in industry settings. Although successfully\ncommercialized, cloning-based S2ST systems expose their distributors to\nliabilities when misused by individuals and can infringe on personality rights\nwhen exploited by media organizations. This work proposes a regulated S2ST\nframework called Preset-Voice Matching (PVM). PVM removes cross-lingual voice\ncloning in S2ST by first matching the input voice to a similar prior consenting\nspeaker voice in the target-language. With this separation, PVM avoids cloning\nthe input speaker, ensuring PVM systems comply with regulations and reduce risk\nof misuse. Our results demonstrate PVM can significantly improve S2ST system\nrun-time in multi-speaker settings and the naturalness of S2ST synthesized\nspeech. To our knowledge, PVM is the first explicitly regulated S2ST framework\nleveraging similarly-matched preset-voices for dynamic S2ST tasks.", "paper_summary_zh": "近年來，產業環境對於語音轉語音（S2ST）系統的需求日益增加。儘管已成功商業化，但基於複製的 S2ST 系統在遭個人不當使用時，會使發行商承擔法律責任，且在遭媒體組織利用時，可能會侵犯人格權。本研究提出一個稱為預設語音比對（PVM）的受規範 S2ST 架構。PVM 透過先將輸入語音與目標語言中類似的先前同意講者語音進行比對，來移除 S2ST 中的跨語言語音複製。透過這種分離，PVM 可避免複製輸入講者，確保 PVM 系統符合法規並降低遭不當使用的風險。我們的結果顯示，PVM 可以大幅改善多講者設定中的 S2ST 系統執行時間，以及 S2ST 合成語音的自然度。據我們所知，PVM 是第一個明確受規範的 S2ST 架構，它會利用類似的預設語音進行比對，以執行動態 S2ST 任務。", "author": "Daniel Platnick et.al.", "authors": "Daniel Platnick, Bishoy Abdelnour, Eamon Earl, Rahul Kumar, Zahra Rezaei, Thomas Tsangaris, Faraj Lagum", "id": "2407.13153v1", "paper_url": "http://arxiv.org/abs/2407.13153v1", "repo": "null"}}