{"2409.07627": {"publish_time": "2024-09-11", "title": "Leveraging User-Generated Reviews for Recommender Systems with Dynamic Headers", "paper_summary": "E-commerce platforms have a vast catalog of items to cater to their\ncustomers' shopping interests. Most of these platforms assist their customers\nin the shopping process by offering optimized recommendation carousels,\ndesigned to help customers quickly locate their desired items. Many models have\nbeen proposed in academic literature to generate and enhance the ranking and\nrecall set of items in these carousels. Conventionally, the accompanying\ncarousel title text (header) of these carousels remains static. In most\ninstances, a generic text such as \"Items similar to your current viewing\" is\nutilized. Fixed variations such as the inclusion of specific attributes \"Other\nitems from a similar seller\" or \"Items from a similar brand\" in addition to\n\"frequently bought together\" or \"considered together\" are observed as well.\nThis work proposes a novel approach to customize the header generation process\nof these carousels. Our work leverages user-generated reviews that lay focus on\nspecific attributes (aspects) of an item that were favorably perceived by users\nduring their interaction with the given item. We extract these aspects from\nreviews and train a graph neural network-based model under the framework of a\nconditional ranking task. We refer to our innovative methodology as Dynamic\nText Snippets (DTS) which generates multiple header texts for an anchor item\nand its recall set. Our approach demonstrates the potential of utilizing\nuser-generated reviews and presents a unique paradigm for exploring\nincreasingly context-aware recommendation systems.", "paper_summary_zh": "<paragraph>電子商務平台擁有龐大的商品目錄，以滿足客戶的購物興趣。這些平台大多數透過提供最佳化推薦輪播，協助客戶進行購物流程，旨在協助客戶快速找到他們想要的商品。許多模型已在學術文獻中提出，以產生和加強這些輪播中商品的排名和召回設定。傳統上，這些輪播的隨附輪播標題文字（標題）保持靜態。在多數情況下，會使用「與您目前瀏覽類似的商品」等一般文字。固定變化，例如包含特定屬性「來自類似賣家的其他商品」或「來自類似品牌的商品」，以及「經常一起購買」或「一起考慮」，也已觀察到。這項工作提出了一個新的方法，用於自訂這些輪播的標題產生流程。我們的作品利用使用者產生的評論，這些評論專注於使用者在與特定商品互動時，對商品的特定屬性（面向）產生良好的看法。我們從評論中擷取這些面向，並在條件式排名任務架構下訓練圖形神經網路模型。我們將我們的創新方法稱為動態文字片段 (DTS)，它會為錨定商品及其召回設定產生多個標題文字。我們的做法展示了利用使用者產生的評論的潛力，並提出了一個獨特的範例，用於探索越來越注重脈絡的推薦系統。</paragraph>", "author": "Shanu Vashishtha et.al.", "authors": "Shanu Vashishtha, Abhay Kumar, Lalitesh Morishetti, Kaushiki Nag, Kannan Achan", "id": "2409.07627v1", "paper_url": "http://arxiv.org/abs/2409.07627v1", "repo": "null"}}