{"2408.06223": {"publish_time": "2024-08-12", "title": "On Effects of Steering Latent Representation for Large Language Model Unlearning", "paper_summary": "Representation Misdirection for Unlearning (RMU), which steers model\nrepresentation in the intermediate layer to a target random representation, is\nan effective method for large language model (LLM) unlearning. Despite its high\nperformance, the underlying cause and explanation remain underexplored. In this\npaper, we first theoretically demonstrate that steering forget representations\nin the intermediate layer reduces token confidence, causing LLMs to generate\nwrong or nonsense responses. Second, we investigate how the coefficient\ninfluences the alignment of forget-sample representations with the random\ndirection and hint at the optimal coefficient values for effective unlearning\nacross different network layers. Third, we show that RMU unlearned models are\nrobust against adversarial jailbreak attacks. Last, our empirical analysis\nshows that RMU is less effective when applied to the middle and later layers in\nLLMs. To resolve this drawback, we propose Adaptive RMU -- a simple yet\neffective alternative method that makes unlearning effective with most layers.\nExtensive experiments demonstrate that Adaptive RMU significantly improves the\nunlearning performance compared to prior art while incurring no additional\ncomputational cost.", "paper_summary_zh": "表示失導用於去學習（RMU），它將中間層的模型表示導向目標隨機表示，是一種用於大型語言模型（LLM）去學習的有效方法。儘管其效能很高，但其根本原因和解釋仍未充分探討。在本文中，我們首先從理論上證明，在中間層導向遺忘表示會降低標記信心，導致 LLM 產生錯誤或無意義的回應。其次，我們探討係數如何影響遺忘範例表示與隨機方向的一致性，並暗示了在不同網路層中有效去學習的最佳係數值。第三，我們表明，RMU 去學習的模型對於對抗性越獄攻擊具有魯棒性。最後，我們的經驗分析表明，當應用於 LLM 中間層和後續層時，RMU 的效果較差。為了解決這個缺點，我們提出了自適應 RMU——一種簡單但有效的替代方法，它使去學習在大部分層中都有效。大量的實驗表明，與先前的技術相比，自適應 RMU 大幅改善了去學習效能，同時不會產生額外的運算成本。", "author": "Dang Huu-Tien et.al.", "authors": "Dang Huu-Tien, Trung-Tin Pham, Hoang Thanh-Tung, Naoya Inoue", "id": "2408.06223v1", "paper_url": "http://arxiv.org/abs/2408.06223v1", "repo": "null"}}