{"2407.12772": {"publish_time": "2024-07-17", "title": "LMMs-Eval: Reality Check on the Evaluation of Large Multimodal Models", "paper_summary": "The advances of large foundation models necessitate wide-coverage, low-cost,\nand zero-contamination benchmarks. Despite continuous exploration of language\nmodel evaluations, comprehensive studies on the evaluation of Large Multi-modal\nModels (LMMs) remain limited. In this work, we introduce LMMS-EVAL, a unified\nand standardized multimodal benchmark framework with over 50 tasks and more\nthan 10 models to promote transparent and reproducible evaluations. Although\nLMMS-EVAL offers comprehensive coverage, we find it still falls short in\nachieving low cost and zero contamination. To approach this evaluation\ntrilemma, we further introduce LMMS-EVAL LITE, a pruned evaluation toolkit that\nemphasizes both coverage and efficiency. Additionally, we present Multimodal\nLIVEBENCH that utilizes continuously updating news and online forums to assess\nmodels' generalization abilities in the wild, featuring a low-cost and\nzero-contamination evaluation approach. In summary, our work highlights the\nimportance of considering the evaluation trilemma and provides practical\nsolutions to navigate the trade-offs in evaluating large multi-modal models,\npaving the way for more effective and reliable benchmarking of LMMs. We\nopensource our codebase and maintain leaderboard of LIVEBENCH at\nhttps://github.com/EvolvingLMMs-Lab/lmms-eval and\nhttps://huggingface.co/spaces/lmms-lab/LiveBench.", "paper_summary_zh": "大型基礎模型的進展需要廣泛涵蓋、低成本且零污染的基準。儘管持續探索語言模型評估，但對大型多模態模型 (LMM) 評估的全面研究仍然有限。在這項工作中，我們引入了 LMMS-EVAL，一個統一且標準化的多模態基準架構，包含超過 50 項任務和 10 個以上模型，以促進透明且可重現的評估。儘管 LMMS-EVAL 提供了全面的涵蓋範圍，但我們發現它在實現低成本和零污染方面仍然不足。為了解決這個評估三難困境，我們進一步引入了 LMMS-EVAL LITE，這是一個精簡的評估工具包，強調涵蓋範圍和效率。此外，我們展示了多模態 LIVEBENCH，它利用持續更新的新聞和線上論壇來評估模型在野外的概括能力，採用低成本且零污染的評估方法。總之，我們的研究強調了考慮評估三難困境的重要性，並提供了實用的解決方案來權衡大型多模態模型的評估，為更有效和可靠的 LMM 基準測試鋪平道路。我們在 https://github.com/EvolvingLMMs-Lab/lmms-eval 和 https://huggingface.co/spaces/lmms-lab/LiveBench 開源我們的程式碼庫並維護 LIVEBENCH 的排行榜。", "author": "Kaichen Zhang et.al.", "authors": "Kaichen Zhang, Bo Li, Peiyuan Zhang, Fanyi Pu, Joshua Adrian Cahyono, Kairui Hu, Shuai Liu, Yuanhan Zhang, Jingkang Yang, Chunyuan Li, Ziwei Liu", "id": "2407.12772v1", "paper_url": "http://arxiv.org/abs/2407.12772v1", "repo": "https://github.com/evolvinglmms-lab/lmms-eval"}}