{"2408.12942": {"publish_time": "2024-08-23", "title": "Causal-Guided Active Learning for Debiasing Large Language Models", "paper_summary": "Although achieving promising performance, recent analyses show that current\ngenerative large language models (LLMs) may still capture dataset biases and\nutilize them for generation, leading to poor generalizability and harmfulness\nof LLMs. However, due to the diversity of dataset biases and the\nover-optimization problem, previous prior-knowledge-based debiasing methods and\nfine-tuning-based debiasing methods may not be suitable for current LLMs. To\naddress this issue, we explore combining active learning with the causal\nmechanisms and propose a casual-guided active learning (CAL) framework, which\nutilizes LLMs itself to automatically and autonomously identify informative\nbiased samples and induce the bias patterns. Then a cost-effective and\nefficient in-context learning based method is employed to prevent LLMs from\nutilizing dataset biases during generation. Experimental results show that CAL\ncan effectively recognize typical biased instances and induce various bias\npatterns for debiasing LLMs.", "paper_summary_zh": "儘管取得了可觀的效能，最近的分析顯示，現行的生成式大型語言模型 (LLM) 仍可能擷取資料集偏差，並將其用於生成，導致 LLM 的概括性不佳和有害性。然而，由於資料集偏差的多樣性和過度最佳化問題，先前的基於先驗知識的去偏差方法和基於微調的去偏差方法可能不適合於目前的 LLM。為了解決這個問題，我們探討將主動學習與因果機制結合起來，並提出一個因果引導主動學習 (CAL) 框架，它利用 LLM 本身自動且自主地識別具有資訊性的偏差樣本並誘導偏差模式。然後採用一種經濟且高效的基於情境學習的方法，以防止 LLM 在生成過程中利用資料集偏差。實驗結果表明，CAL 可以有效地識別典型的偏差實例，並誘導出各種偏差模式，以消除 LLM 的偏差。", "author": "Zhouhao Sun et.al.", "authors": "Zhouhao Sun, Li Du, Xiao Ding, Yixuan Ma, Kaitao Qiu, Ting Liu, Bing Qin", "id": "2408.12942v1", "paper_url": "http://arxiv.org/abs/2408.12942v1", "repo": "null"}}