{"2412.02012": {"publish_time": "2024-12-02", "title": "INSIGHT: Explainable Weakly-Supervised Medical Image Analysis", "paper_summary": "Due to their large sizes, volumetric scans and whole-slide pathology images\n(WSIs) are often processed by extracting embeddings from local regions and then\nan aggregator makes predictions from this set. However, current methods require\npost-hoc visualization techniques (e.g., Grad-CAM) and often fail to localize\nsmall yet clinically crucial details. To address these limitations, we\nintroduce INSIGHT, a novel weakly-supervised aggregator that integrates heatmap\ngeneration as an inductive bias. Starting from pre-trained feature maps,\nINSIGHT employs a detection module with small convolutional kernels to capture\nfine details and a context module with a broader receptive field to suppress\nlocal false positives. The resulting internal heatmap highlights diagnostically\nrelevant regions. On CT and WSI benchmarks, INSIGHT achieves state-of-the-art\nclassification results and high weakly-labeled semantic segmentation\nperformance. Project website and code are available at:\nhttps://zhangdylan83.github.io/ewsmia/", "paper_summary_zh": "由於體積龐大，體積掃描和全玻片病理圖像 (WSI) 通常會透過從局部區域擷取嵌入式處理，然後聚合器會根據這組資料進行預測。然而，目前的方法需要事後視覺化技術（例如 Grad-CAM），而且往往無法定位雖然細微但臨床上至關重要的細節。為了解決這些限制，我們引入了 INSIGHT，這是一種新穎的弱監督聚合器，可將熱圖生成整合為歸納偏差。INSIGHT 從預先訓練好的特徵圖開始，採用具有小型卷積核的偵測模組來擷取精細的細節，並採用具有較廣泛感受野的內容模組來抑制局部誤判。產生的內部熱圖突顯了診斷相關的區域。在 CT 和 WSI 基準上，INSIGHT 達到了最先進的分類結果，並具備高度弱標記語意分割效能。專案網站和程式碼可於下列網址取得：\nhttps://zhangdylan83.github.io/ewsmia/", "author": "Wenbo Zhang et.al.", "authors": "Wenbo Zhang, Junyu Chen, Christopher Kanan", "id": "2412.02012v1", "paper_url": "http://arxiv.org/abs/2412.02012v1", "repo": "null"}}