{"2501.06143": {"publish_time": "2025-01-10", "title": "Multilingual Performance of a Multimodal Artificial Intelligence System on Multisubject Physics Concept Inventories", "paper_summary": "We investigate the multilingual and multimodal performance of a large\nlanguage model-based artificial intelligence (AI) system, GPT-4o, on a diverse\nset of physics concept inventories spanning multiple languages and subject\nareas. The inventories taken from the PhysPort website cover the classical\nphysics topics of mechanics, electromagnetism, optics, and thermodynamics as\nwell as relativity, quantum mechanics, astronomy, mathematics, and laboratory\nskills. Unlike previous text-only studies, we uploaded the inventories as\nimages mirroring what a student would see on paper, assessing the system's\nmultimodal functionality. The AI is prompted in English and autonomously\nchooses the language of its response - either remaining in the nominal language\nof the test, switching entirely to English, or mixing languages - revealing\nadaptive behavior dependent on linguistic complexity and data availability. Our\nresults indicate some variation in performance across subject areas, with\nlaboratory skills standing out as the area of poorest performance. Furthermore,\nthe AI's performance on questions that require visual interpretation of images\nis worse than on purely text-based questions. Questions that are difficult for\nthe AI tend to be that way invariably of the inventory language. We also find\nlarge variations in performance across languages, with some appearing to\nbenefit substantially from language switching, a phenomenon similar to\ncode-switching ofhuman speakers. Overall, comparing the obtained AI results to\nthe existing literature, we find that the AI system outperforms average\nundergraduate students post-instruction in all subject areas but laboratory\nskills.", "paper_summary_zh": "<paragraph>我們調查了一個大型語言模型基礎的人工智慧 (AI) 系統 GPT-4o 在多語言和多模式的表現，它涵蓋了多種語言和主題領域的物理概念清單。從 PhysPort 網站取得的清單涵蓋了力學、電磁學、光學和熱力學等經典物理主題，以及相對論、量子力學、天文學、數學和實驗室技能。與先前的純文字研究不同，我們將清單上傳為圖像，反映學生在紙本上看到的內容，評估系統的多模式功能。AI 以英語提示，並自主選擇其回應的語言 - 留在測驗的名義語言、完全切換為英語或混合語言 - 顯示出適應性行為，取決於語言複雜性和資料可用性。我們的結果表明，不同科目領域的表現有所不同，其中實驗室技能表現最差。此外，AI 在需要視覺解讀圖像的問題上的表現比純文字問題差。對 AI 來說困難的問題往往與清單語言無關。我們還發現不同語言的表現差異很大，有些語言似乎從語言切換中受益匪淺，這是一種類似於人類說話者代碼切換的現象。總體而言，將獲得的 AI 結果與現有文獻進行比較，我們發現 AI 系統在所有科目領域（實驗室技能除外）的表現都優於平均大學生在教學後的表現。</paragraph>", "author": "Gerd Kortemeyer et.al.", "authors": "Gerd Kortemeyer, Marina Babayeva, Giulia Polverini, Bor Gregorcic, Ralf Widenhorn", "id": "2501.06143v1", "paper_url": "http://arxiv.org/abs/2501.06143v1", "repo": "null"}}