{"2410.09013": {"publish_time": "2024-10-11", "title": "The Impact of Visual Information in Chinese Characters: Evaluating Large Models' Ability to Recognize and Utilize Radicals", "paper_summary": "The glyphic writing system of Chinese incorporates information-rich visual\nfeatures in each character, such as radicals that provide hints about meaning\nor pronunciation. However, there has been no investigation into whether\ncontemporary Large Language Models (LLMs) and Vision-Language Models (VLMs) can\nharness these sub-character features in Chinese through prompting. In this\nstudy, we establish a benchmark to evaluate LLMs' and VLMs' understanding of\nvisual elements in Chinese characters, including radicals, composition\nstructures, strokes, and stroke counts. Our results reveal that models\nsurprisingly exhibit some, but still limited, knowledge of the visual\ninformation, regardless of whether images of characters are provided. To incite\nmodels' ability to use radicals, we further experiment with incorporating\nradicals into the prompts for Chinese language understanding tasks. We observe\nconsistent improvement in Part-Of-Speech tagging when providing additional\ninformation about radicals, suggesting the potential to enhance CLP by\nintegrating sub-character information.", "paper_summary_zh": "中文的象形文字系统在每个字符中都包含信息丰富的视觉特征，例如提供意义或发音提示的部首。然而，尚未调查当代大语言模型 (LLM) 和视觉语言模型 (VLM) 是否可以通过提示利用中文中的这些子字符特征。在这项研究中，我们建立了一个基准来评估 LLM 和 VLM 对汉字视觉元素的理解，包括部首、构字结构、笔画和笔画数。我们的结果表明，无论是否提供了字符图像，模型都惊人地表现出一些对视觉信息的了解，但仍然有限。为了激发模型使用部首的能力，我们进一步尝试将部首融入中文语言理解任务的提示中。我们观察到在提供有关部首的附加信息时，词性标注始终得到改善，这表明通过整合子字符信息来增强 CLP 的潜力。", "author": "Xiaofeng Wu et.al.", "authors": "Xiaofeng Wu, Karl Stratos, Wei Xu", "id": "2410.09013v1", "paper_url": "http://arxiv.org/abs/2410.09013v1", "repo": "null"}}