{"2501.05205": {"publish_time": "2025-01-09", "title": "Discovering Hidden Visual Concepts Beyond Linguistic Input in Infant Learning", "paper_summary": "Infants develop complex visual understanding rapidly, even preceding of the\nacquisition of linguistic inputs. As computer vision seeks to replicate the\nhuman vision system, understanding infant visual development may offer valuable\ninsights. In this paper, we present an interdisciplinary study exploring this\nquestion: can a computational model that imitates the infant learning process\ndevelop broader visual concepts that extend beyond the vocabulary it has heard,\nsimilar to how infants naturally learn? To investigate this, we analyze a\nrecently published model in Science by Vong et al.,which is trained on\nlongitudinal, egocentric images of a single child paired with transcribed\nparental speech. We introduce a training-free framework that can discover\nvisual concept neurons hidden in the model's internal representations. Our\nfindings show that these neurons can classify objects outside its original\nvocabulary. Furthermore, we compare the visual representations in infant-like\nmodels with those in moder computer vision models, such as CLIP or ImageNet\npre-trained model, highlighting key similarities and differences. Ultimately,\nour work bridges cognitive science and computer vision by analyzing the\ninternal representations of a computational model trained on an infant's visual\nand linguistic inputs.", "paper_summary_zh": "嬰兒發展出複雜的視覺理解，甚至早於語言輸入的獲得。由於電腦視覺試圖複製人類視覺系統，了解嬰兒視覺發展可能會提供有價值的見解。在本文中，我們提出了一項探索這個問題的跨學科研究：一個模仿嬰兒學習過程的計算模型是否能發展出超越其聽到的詞彙的更廣泛的視覺概念，類似於嬰兒自然學習的方式？為了調查這一點，我們分析了 Vong 等人在 Science 上最近發表的模型，該模型訓練於一個孩子的縱向自我中心影像，並配有轉錄的父母語言。我們引入了一個無需訓練的框架，它可以在模型的內部表示中發現隱藏的視覺概念神經元。我們的研究結果表明，這些神經元可以對其原始詞彙之外的物體進行分類。此外，我們將類嬰兒模型中的視覺表示與現代電腦視覺模型（例如 CLIP 或 ImageNet 預訓練模型）中的視覺表示進行比較，突出了關鍵的相似性和差異。最終，我們的研究通過分析在嬰兒的視覺和語言輸入上訓練的計算模型的內部表示，架起了認知科學和電腦視覺之間的橋樑。", "author": "Xueyi Ke et.al.", "authors": "Xueyi Ke, Satoshi Tsutsui, Yayun Zhang, Bihan Wen", "id": "2501.05205v1", "paper_url": "http://arxiv.org/abs/2501.05205v1", "repo": "null"}}