{"2412.11698": {"publish_time": "2024-12-16", "title": "On Large Language Models in Mission-Critical IT Governance: Are We Ready Yet?", "paper_summary": "Context. The security of critical infrastructure has been a fundamental\nconcern since the advent of computers, and this concern has only intensified in\ntoday's cyber warfare landscape. Protecting mission-critical systems (MCSs),\nincluding essential assets like healthcare, telecommunications, and military\ncoordination, is vital for national security. These systems require prompt and\ncomprehensive governance to ensure their resilience, yet recent events have\nshown that meeting these demands is increasingly challenging. Aim. Building on\nprior research that demonstrated the potential of GAI, particularly Large\nLanguage Models (LLMs), in improving risk analysis tasks, we aim to explore\npractitioners' perspectives, specifically developers and security personnel, on\nusing generative AI (GAI) in the governance of IT MCSs seeking to provide\ninsights and recommendations for various stakeholders, including researchers,\npractitioners, and policymakers. Method. We designed a survey to collect\npractical experiences, concerns, and expectations of practitioners who develop\nand implement security solutions in the context of MCSs. Analyzing this data\nwill help identify key trends, challenges, and opportunities for introducing\nGAIs in this niche domain. Conclusions and Future Works. Our findings highlight\nthat the safe use of LLMs in MCS governance requires interdisciplinary\ncollaboration. Researchers should focus on designing regulation-oriented models\nand focus on accountability; practitioners emphasize data protection and\ntransparency, while policymakers must establish a unified AI framework with\nglobal benchmarks to ensure ethical and secure LLMs-based MCS governance.", "paper_summary_zh": "<paragraph>背景。自電腦出現以來，關鍵基礎設施的安全一直是基本考量，而此項考量在今日的網路戰爭情勢下只會更加劇烈。保護任務關鍵系統 (MCS)，包括醫療保健、電信和軍事協調等重要資產，對國家安全至關重要。這些系統需要及時且全面的治理才能確保其復原力，但近期事件顯示，要滿足這些需求越來越具挑戰性。目標。建構於先前的研究，該研究展示了 GAI 的潛力，特別是大型語言模型 (LLM)，在改善風險分析任務上的潛力，我們旨在探討實務工作者的觀點，特別是開發人員和安全人員，對於在 IT MCS 治理中使用生成式 AI (GAI)，以提供見解和建議給各個利害關係人，包括研究人員、實務工作者和政策制定者。方法。我們設計了一份調查問卷，以蒐集在 MCS 背景下開發和實施安全解決方案的實務工作者的實際經驗、疑慮和期望。分析這些資料將有助於找出在這個利基領域中導入 GAI 的主要趨勢、挑戰和機會。結論與未來工作。我們的發現強調，安全地在 MCS 治理中使用 LLM 需要跨領域合作。研究人員應專注於設計以法規為導向的模型，並專注於問責制；實務工作者強調資料保護和透明度，而政策制定者必須建立一個統一的 AI 架構，並制定全球基準，以確保基於 LLM 的 MCS 治理符合道德且安全。</paragraph>", "author": "Matteo Esposito et.al.", "authors": "Matteo Esposito, Francesco Palagiano, Valentina Lenarduzzi, Davide Taibi", "id": "2412.11698v1", "paper_url": "http://arxiv.org/abs/2412.11698v1", "repo": "null"}}