{"2411.02094": {"publish_time": "2024-11-04", "title": "Alignment-Based Adversarial Training (ABAT) for Improving the Robustness and Accuracy of EEG-Based BCIs", "paper_summary": "Machine learning has achieved great success in electroencephalogram (EEG)\nbased brain-computer interfaces (BCIs). Most existing BCI studies focused on\nimproving the decoding accuracy, with only a few considering the adversarial\nsecurity. Although many adversarial defense approaches have been proposed in\nother application domains such as computer vision, previous research showed\nthat their direct extensions to BCIs degrade the classification accuracy on\nbenign samples. This phenomenon greatly affects the applicability of\nadversarial defense approaches to EEG-based BCIs. To mitigate this problem, we\npropose alignment-based adversarial training (ABAT), which performs EEG data\nalignment before adversarial training. Data alignment aligns EEG trials from\ndifferent domains to reduce their distribution discrepancies, and adversarial\ntraining further robustifies the classification boundary. The integration of\ndata alignment and adversarial training can make the trained EEG classifiers\nsimultaneously more accurate and more robust. Experiments on five EEG datasets\nfrom two different BCI paradigms (motor imagery classification, and event\nrelated potential recognition), three convolutional neural network classifiers\n(EEGNet, ShallowCNN and DeepCNN) and three different experimental settings\n(offline within-subject cross-block/-session classification, online\ncross-session classification, and pre-trained classifiers) demonstrated its\neffectiveness. It is very intriguing that adversarial attacks, which are\nusually used to damage BCI systems, can be used in ABAT to simultaneously\nimprove the model accuracy and robustness.", "paper_summary_zh": "機器學習在腦電圖 (EEG)\n基於腦機介面 (BCI) 方面取得了巨大的成功。現有的 BCI 研究大多集中於\n改進解碼準確度，只有少數考慮對抗\n安全性。儘管在其他應用領域（例如電腦視覺）中已經提出了許多對抗性防禦方法，\n先前的研究表明，它們直接擴展到 BCI 會降低良性樣本的分類準確度。這種現象極大地影響了\n對抗性防禦方法在基於 EEG 的 BCI 中的適用性。為了減輕這個問題，我們\n提出基於對齊的對抗性訓練 (ABAT)，它在對抗性訓練之前執行 EEG 資料\n對齊。資料對齊會將來自不同領域的 EEG 試驗對齊，以減少它們的分布差異，而對抗性\n訓練進一步增強了分類邊界。\n資料對齊和對抗性訓練的整合可以使訓練後的 EEG 分類器同時更準確和更強健。在五個 EEG 資料集上的實驗\n來自兩種不同的 BCI 模式（運動意象分類和事件\n相關潛能識別），三個卷積神經網路分類器\n（EEGNet、ShallowCNN 和 DeepCNN）和三種不同的實驗設定\n（離線受試者內交叉區塊/-會話分類、線上\n交叉會話分類和預訓練分類器）證明了它的\n有效性。非常有趣的是，對抗性攻擊通常\n用於損壞 BCI 系統，可以在 ABAT 中使用以同時\n提高模型準確性和魯棒性。", "author": "Xiaoqing Chen et.al.", "authors": "Xiaoqing Chen, Ziwei Wang, Dongrui Wu", "id": "2411.02094v1", "paper_url": "http://arxiv.org/abs/2411.02094v1", "repo": "https://github.com/xqchen914/abat"}}