{"2409.06241": {"publish_time": "2024-09-10", "title": "DiPT: Enhancing LLM reasoning through diversified perspective-taking", "paper_summary": "Existing work on improving language model reasoning typically explores a\nsingle solution path, which can be prone to errors. Inspired by\nperspective-taking in social studies, this paper introduces DiPT, a novel\napproach that complements current reasoning methods by explicitly incorporating\ndiversified viewpoints. This approach allows the model to gain a deeper\nunderstanding of the problem's context and identify the most effective solution\npath during the inference stage. Additionally, it provides a general\ndata-centric AI recipe for augmenting existing data to improve their quality\nfor fine-tuning.\n  Our empirical results demonstrate that DiPT can be flexibly integrated into\nexisting methods that focus on a single reasoning approach, enhancing their\nreasoning performance and stability when presented with paraphrased problems.\nFurthermore, we illustrate improved context understanding by maintaining the\nmodel's safe outputs against \"jailbreaking\" prompts intentionally designed to\nbypass safeguards built into deployed models. Lastly, we show that fine-tuning\nwith data enriched with diverse perspectives can boost the reasoning\ncapabilities of the model compared to fine-tuning with raw data alone.", "paper_summary_zh": "現有的改善語言模型推理的工作通常會探索單一的解決方案路徑，這可能會容易出錯。受到社會研究中觀點採用的啟發，本文介紹了 DiPT，這是一種新方法，透過明確納入多元觀點來補充目前的推理方法。此方法允許模型更深入地了解問題的背景，並在推理階段找出最有效的解決方案路徑。此外，它提供了一種通用的以資料為中心的 AI 配方，用於擴充現有資料，以提升其微調品質。\n我們的實證結果證明，DiPT 可以靈活地整合到專注於單一推理方法的現有方法中，在遇到轉述問題時，提升其推理效能和穩定性。此外，透過維持模型對於「越獄」提示的安全性輸出，我們展示了改善的背景理解，而這些提示旨在繞過部署模型中內建的防護措施。最後，我們展示了使用豐富多元觀點的資料進行微調，與僅使用原始資料進行微調相比，可以提升模型的推理能力。", "author": "Hoang Anh Just et.al.", "authors": "Hoang Anh Just, Mahavir Dabas, Lifu Huang, Ming Jin, Ruoxi Jia", "id": "2409.06241v1", "paper_url": "http://arxiv.org/abs/2409.06241v1", "repo": "null"}}