{"2412.02611": {"publish_time": "2024-12-03", "title": "AV-Odyssey Bench: Can Your Multimodal LLMs Really Understand Audio-Visual Information?", "paper_summary": "Recently, multimodal large language models (MLLMs), such as GPT-4o, Gemini\n1.5 Pro, and Reka Core, have expanded their capabilities to include vision and\naudio modalities. While these models demonstrate impressive performance across\na wide range of audio-visual applications, our proposed DeafTest reveals that\nMLLMs often struggle with simple tasks humans find trivial: 1) determining\nwhich of two sounds is louder, and 2) determining which of two sounds has a\nhigher pitch. Motivated by these observations, we introduce AV-Odyssey Bench, a\ncomprehensive audio-visual benchmark designed to assess whether those MLLMs can\ntruly understand the audio-visual information. This benchmark encompasses 4,555\ncarefully crafted problems, each incorporating text, visual, and audio\ncomponents. To successfully infer answers, models must effectively leverage\nclues from both visual and audio inputs. To ensure precise and objective\nevaluation of MLLM responses, we have structured the questions as\nmultiple-choice, eliminating the need for human evaluation or LLM-assisted\nassessment. We benchmark a series of closed-source and open-source models and\nsummarize the observations. By revealing the limitations of current models, we\naim to provide useful insight for future dataset collection and model\ndevelopment.", "paper_summary_zh": "最近，多模态大型语言模型 (MLLM)，例如 GPT-4o、Gemini 1.5 Pro 和 Reka Core，已扩展其功能，包括视觉和音频模态。虽然这些模型在广泛的视听应用中表现出令人印象深刻的性能，但我们提出的 DeafTest 表明，MLLM 通常难以完成人类认为微不足道的简单任务：1) 确定两个声音中哪个声音更响亮，以及 2) 确定两个声音中哪个声音更高。受这些观察结果的启发，我们引入了 AV-Odyssey Bench，这是一个全面的视听基准，旨在评估这些 MLLM 是否真正能够理解视听信息。此基准包含 4,555 个精心设计的问题，每个问题都包含文本、视觉和音频组件。为了成功推断答案，模型必须有效利用视觉和音频输入的线索。为了确保对 MLLM 响应进行精确和客观的评估，我们已将问题构建为多项选择题，从而无需人工评估或 LLM 辅助评估。我们对一系列闭源和开源模型进行了基准测试，并总结了观察结果。通过揭示当前模型的局限性，我们旨在为未来的数据集收集和模型开发提供有用的见解。", "author": "Kaixiong Gong et.al.", "authors": "Kaixiong Gong, Kaituo Feng, Bohao Li, Yibing Wang, Mofan Cheng, Shijia Yang, Jiaming Han, Benyou Wang, Yutong Bai, Zhuoran Yang, Xiangyu Yue", "id": "2412.02611v1", "paper_url": "http://arxiv.org/abs/2412.02611v1", "repo": "null"}}