{"2407.04079": {"publish_time": "2024-07-04", "title": "AXOLOTL'24 Shared Task on Multilingual Explainable Semantic Change Modeling", "paper_summary": "This paper describes the organization and findings of AXOLOTL'24, the first\nmultilingual explainable semantic change modeling shared task. We present new\nsense-annotated diachronic semantic change datasets for Finnish and Russian\nwhich were employed in the shared task, along with a surprise test-only German\ndataset borrowed from an existing source. The setup of AXOLOTL'24 is new to the\nsemantic change modeling field, and involves subtasks of identifying unknown\n(novel) senses and providing dictionary-like definitions to these senses. The\nmethods of the winning teams are described and compared, thus paving a path\ntowards explainability in computational approaches to historical change of\nmeaning.", "paper_summary_zh": "本論文描述了 AXOLOTL'24 的組織和發現，這是第一個多語言可解釋語義變更建模共享任務。我們提供了用於共享任務的芬蘭語和俄語的新的感官註釋歷時語義變更數據集，以及從現有來源借用的驚喜測試專用德語數據集。AXOLOTL'24 的設置在語義變更建模領域是新的，並涉及識別未知（新穎）感官和為這些感官提供類似字典的定義的子任務。描述並比較了獲勝團隊的方法，從而為計算方法中歷史意義變化的可解釋性鋪平了道路。", "author": "Mariia Fedorova et.al.", "authors": "Mariia Fedorova, Timothee Mickus, Niko Partanen, Janine Siewert, Elena Spaziani, Andrey Kutuzov", "id": "2407.04079v1", "paper_url": "http://arxiv.org/abs/2407.04079v1", "repo": "null"}}