{"2412.04704": {"publish_time": "2024-12-06", "title": "On Interpreting the Effectiveness of Unsupervised Software Traceability with Information Theory", "paper_summary": "Traceability is a cornerstone of modern software development, ensuring system\nreliability and facilitating software maintenance. While unsupervised\ntechniques leveraging Information Retrieval (IR) and Machine Learning (ML)\nmethods have been widely used for predicting trace links, their effectiveness\nremains underexplored. In particular, these techniques often assume\ntraceability patterns are present within textual data - a premise that may not\nhold universally. Moreover, standard evaluation metrics such as precision,\nrecall, accuracy, or F1 measure can misrepresent the model performance when\nunderlying data distributions are not properly analyzed. Given that automated\ntraceability techniques tend to struggle to establish links, we need further\ninsight into the information limits related to traceability artifacts. In this\npaper, we propose an approach, TraceXplainer, for using information theory\nmetrics to evaluate and better understand the performance (limits) of\nunsupervised traceability techniques. Specifically, we introduce\nself-information, cross-entropy, and mutual information (MI) as metrics to\nmeasure the informativeness and reliability of traceability links. Through a\ncomprehensive replication and analysis of well-studied datasets and techniques,\nwe investigate the effectiveness of unsupervised techniques that predict\ntraceability links using IR/ML. This application of TraceXplainer illustrates\nan imbalance in typical traceability datasets where the source code has on\naverage 1.48 more information bits (i.e., entropy) than the linked\ndocumentation. Additionally, we demonstrate that an average MI of 4.81 bits,\nloss of 1.75, and noise of 0.28 bits signify that there are\ninformation-theoretic limits on the effectiveness of unsupervised traceability\ntechniques. We hope these findings spur additional research on understanding\nthe limits and progress of traceability research.", "paper_summary_zh": "<paragraph>追溯性是現代軟體開發的基石，確保系統可靠性並促進軟體維護。儘管利用資訊檢索 (IR) 和機器學習 (ML) 方法的非監督技術已廣泛用於預測追溯連結，但其有效性仍未充分探討。特別是，這些技術通常假設追溯模式存在於文字資料中，而這項前提可能無法普遍適用。此外，當底層資料分佈未經適當分析時，標準評估指標，例如精確度、召回率、準確度或 F1 量測，可能會曲解模型效能。鑑於自動化追溯技術往往難以建立連結，我們需要進一步了解與追溯性人工製品相關的資訊限制。在本文中，我們提出 TraceXplainer 方法，使用資訊理論指標來評估和更深入了解非監督追溯技術的效能（限制）。具體來說，我們引入自資訊、交叉熵和互資訊 (MI) 作為指標，以量測追溯連結的資訊量和可靠性。透過對研究完善的資料集和技術進行全面複製和分析，我們探討使用 IR/ML 預測追溯連結的非監督技術的有效性。TraceXplainer 的此應用說明了典型追溯性資料集的不平衡，其中原始碼平均比連結文件多 1.48 個資訊位元（即熵）。此外，我們證明平均 4.81 位元的 MI、1.75 的損失和 0.28 位元的雜訊表示非監督追溯技術的有效性存在資訊理論限制。我們希望這些發現能激勵更多研究，以了解追溯研究的限制和進展。</paragraph>", "author": "David N. Palacio et.al.", "authors": "David N. Palacio, Daniel Rodriguez-Cardenas, Denys Poshyvanyk, Kevin Moran", "id": "2412.04704v1", "paper_url": "http://arxiv.org/abs/2412.04704v1", "repo": "null"}}