{"2412.18295": {"publish_time": "2024-12-24", "title": "Pirates of the RAG: Adaptively Attacking LLMs to Leak Knowledge Bases", "paper_summary": "The growing ubiquity of Retrieval-Augmented Generation (RAG) systems in\nseveral real-world services triggers severe concerns about their security. A\nRAG system improves the generative capabilities of a Large Language Models\n(LLM) by a retrieval mechanism which operates on a private knowledge base,\nwhose unintended exposure could lead to severe consequences, including breaches\nof private and sensitive information. This paper presents a black-box attack to\nforce a RAG system to leak its private knowledge base which, differently from\nexisting approaches, is adaptive and automatic. A relevance-based mechanism and\nan attacker-side open-source LLM favor the generation of effective queries to\nleak most of the (hidden) knowledge base. Extensive experimentation proves the\nquality of the proposed algorithm in different RAG pipelines and domains,\ncomparing to very recent related approaches, which turn out to be either not\nfully black-box, not adaptive, or not based on open-source models. The findings\nfrom our study remark the urgent need for more robust privacy safeguards in the\ndesign and deployment of RAG systems.", "paper_summary_zh": "檢索增強生成 (RAG) 系統在多項實際服務中日益普及，引發了人們對其安全性嚴重的擔憂。RAG 系統透過運作於私人知識庫的檢索機制來提升大型語言模型 (LLM) 的生成能力，其意外曝光可能會導致嚴重後果，包括私人和敏感資訊的洩漏。本文提出了一種黑盒攻擊，以強制 RAG 系統洩漏其私人知識庫，這不同於現有方法，它是自適應且自動化的。基於相關性的機制和攻擊者端的開源 LLM 有利於產生有效的查詢，以洩漏大部分（隱藏的）知識庫。廣泛的實驗證明了所提出的演算法在不同 RAG 管線和領域中的品質，與最近相關的方法相比，後者結果證明不是完全黑盒的、非自適應的，或不是基於開源模型。我們的研究結果強調了在 RAG 系統的設計和部署中迫切需要更強大的隱私保障措施。", "author": "Christian Di Maio et.al.", "authors": "Christian Di Maio, Cristian Cosci, Marco Maggini, Valentina Poggioni, Stefano Melacci", "id": "2412.18295v1", "paper_url": "http://arxiv.org/abs/2412.18295v1", "repo": "null"}}