{"2409.06367": {"publish_time": "2024-09-10", "title": "Texture-AD: An Anomaly Detection Dataset and Benchmark for Real Algorithm Development", "paper_summary": "Anomaly detection is a crucial process in industrial manufacturing and has\nmade significant advancements recently. However, there is a large variance\nbetween the data used in the development and the data collected by the\nproduction environment. Therefore, we present the Texture-AD benchmark based on\nrepresentative texture-based anomaly detection to evaluate the effectiveness of\nunsupervised anomaly detection algorithms in real-world applications. This\ndataset includes images of 15 different cloth, 14 semiconductor wafers and 10\nmetal plates acquired under different optical schemes. In addition, it includes\nmore than 10 different types of defects produced during real manufacturing\nprocesses, such as scratches, wrinkles, color variations and point defects,\nwhich are often more difficult to detect than existing datasets. All anomalous\nareas are provided with pixel-level annotations to facilitate comprehensive\nevaluation using anomaly detection models. Specifically, to adapt to diverse\nproducts in automated pipelines, we present a new evaluation method and results\nof baseline algorithms. The experimental results show that Texture-AD is a\ndifficult challenge for state-of-the-art algorithms. To our knowledge,\nTexture-AD is the first dataset to be devoted to evaluating industrial defect\ndetection algorithms in the real world. The dataset is available at\nhttps://XXX.", "paper_summary_zh": "異常偵測在工業製造中是一個至關重要的程序，並且最近已取得重大進展。然而，用於開發的資料與生產環境收集的資料之間存在很大的差異。因此，我們提出了基於代表性紋理異常偵測的 Texture-AD 評量基準，以評估無監督異常偵測演算法在實際應用中的有效性。此資料集包含在不同光學方案下取得的 15 種不同布料、14 片半導體晶圓和 10 片金屬板的影像。此外，它還包含在實際製造過程中產生的 10 多種不同類型的缺陷，例如刮痕、皺紋、顏色變化和點缺陷，這些缺陷通常比現有資料集更難偵測。所有異常區域都提供像素級註解，以利於使用異常偵測模型進行全面評估。具體來說，為了適應自動化管道中的各種產品，我們提出了一種新的評估方法和基線演算法的結果。實驗結果表明，Texture-AD 對最先進的演算法來說是一個艱難的挑戰。據我們所知，Texture-AD 是第一個致力於評估實際環境中的工業缺陷偵測演算法的資料集。此資料集可在 https://XXX 取得。", "author": "Tianwu Lei et.al.", "authors": "Tianwu Lei, Bohan Wang, Silin Chen, Shurong Cao, Ningmu Zou", "id": "2409.06367v1", "paper_url": "http://arxiv.org/abs/2409.06367v1", "repo": "null"}}