{"2410.08950": {"publish_time": "2024-10-11", "title": "On the Adversarial Transferability of Generalized \"Skip Connections\"", "paper_summary": "Skip connection is an essential ingredient for modern deep models to be\ndeeper and more powerful. Despite their huge success in normal scenarios\n(state-of-the-art classification performance on natural examples), we\ninvestigate and identify an interesting property of skip connections under\nadversarial scenarios, namely, the use of skip connections allows easier\ngeneration of highly transferable adversarial examples. Specifically, in\nResNet-like models (with skip connections), we find that using more gradients\nfrom the skip connections rather than the residual modules according to a decay\nfactor during backpropagation allows one to craft adversarial examples with\nhigh transferability. The above method is termed as Skip Gradient Method (SGM).\nAlthough starting from ResNet-like models in vision domains, we further extend\nSGM to more advanced architectures, including Vision Transformers (ViTs) and\nmodels with length-varying paths and other domains, i.e. natural language\nprocessing. We conduct comprehensive transfer attacks against various models\nincluding ResNets, Transformers, Inceptions, Neural Architecture Search, and\nLarge Language Models (LLMs). We show that employing SGM can greatly improve\nthe transferability of crafted attacks in almost all cases. Furthermore,\nconsidering the big complexity for practical use, we further demonstrate that\nSGM can even improve the transferability on ensembles of models or targeted\nattacks and the stealthiness against current defenses. At last, we provide\ntheoretical explanations and empirical insights on how SGM works. Our findings\nnot only motivate new adversarial research into the architectural\ncharacteristics of models but also open up further challenges for secure model\narchitecture design. Our code is available at https://github.com/mo666666/SGM.", "paper_summary_zh": "跳躍連接是現代深度模型更深層且更強大的基本要素。儘管在正常場景中取得巨大成功（自然範例的最新分類效能），我們在對抗場景中探討並找出跳躍連接的有趣特性，也就是使用跳躍連接可以更輕鬆地產生高度可轉移的對抗範例。特別是在 ResNet 類似模型（帶有跳躍連接）中，我們發現根據反向傳播期間的衰減因子，使用來自跳躍連接而不是殘差模組的更多梯度，可以製作出具有高度可轉移性的對抗範例。上述方法稱為跳躍梯度方法 (SGM)。儘管從視覺領域的 ResNet 類似模型開始，我們進一步將 SGM 擴展到更先進的架構，包括視覺Transformer (ViT) 和具有長度變化路徑和其他領域（即自然語言處理）的模型。我們對各種模型進行全面的轉移攻擊，包括 ResNet、Transformer、Inception、神經架構搜尋和大語言模型 (LLM)。我們展示採用 SGM 幾乎可以在所有情況下大幅提升精心製作的攻擊的可轉移性。此外，考慮到實際使用中的龐大複雜性，我們進一步證明 SGM 甚至可以提升模型或目標攻擊的集合體的可轉移性，並提升對當前防禦的隱蔽性。最後，我們提供 SGM 如何運作的理論解釋和經驗見解。我們的發現不僅激勵新的對抗研究探討模型的架構特性，也為安全的模型架構設計開啟進一步的挑戰。我們的程式碼可在 https://github.com/mo666666/SGM 取得。", "author": "Yisen Wang et.al.", "authors": "Yisen Wang, Yichuan Mo, Dongxian Wu, Mingjie Li, Xingjun Ma, Zhouchen Lin", "id": "2410.08950v1", "paper_url": "http://arxiv.org/abs/2410.08950v1", "repo": "null"}}