{"2411.15041": {"publish_time": "2024-11-22", "title": "mR$^2$AG: Multimodal Retrieval-Reflection-Augmented Generation for Knowledge-Based VQA", "paper_summary": "Advanced Multimodal Large Language Models (MLLMs) struggle with recent\nKnowledge-based VQA tasks, such as INFOSEEK and Encyclopedic-VQA, due to their\nlimited and frozen knowledge scope, often leading to ambiguous and inaccurate\nresponses. Thus, multimodal Retrieval-Augmented Generation (mRAG) is naturally\nintroduced to provide MLLMs with comprehensive and up-to-date knowledge,\neffectively expanding the knowledge scope. However, current mRAG methods have\ninherent drawbacks, including: 1) Performing retrieval even when external\nknowledge is not needed. 2) Lacking of identification of evidence that supports\nthe query. 3) Increasing model complexity due to additional information\nfiltering modules or rules. To address these shortcomings, we propose a novel\ngeneralized framework called \\textbf{m}ultimodal\n\\textbf{R}etrieval-\\textbf{R}eflection-\\textbf{A}ugmented \\textbf{G}eneration\n(mR$^2$AG), which achieves adaptive retrieval and useful information\nlocalization to enable answers through two easy-to-implement reflection\noperations, preventing high model complexity. In mR$^2$AG, Retrieval-Reflection\nis designed to distinguish different user queries and avoids redundant\nretrieval calls, and Relevance-Reflection is introduced to guide the MLLM in\nlocating beneficial evidence of the retrieved content and generating answers\naccordingly. In addition, mR$^2$AG can be integrated into any well-trained MLLM\nwith efficient fine-tuning on the proposed mR$^2$AG Instruction-Tuning dataset\n(mR$^2$AG-IT). mR$^2$AG significantly outperforms state-of-the-art MLLMs (e.g.,\nGPT-4v/o) and RAG-based MLLMs on INFOSEEK and Encyclopedic-VQA, while\nmaintaining the exceptional capabilities of base MLLMs across a wide range of\nVisual-dependent tasks.", "paper_summary_zh": "先進的多模態大型語言模型 (MLLM) 在基於知識的 VQA 任務中遇到困難，例如 INFOSEEK 和百科全書 VQA，原因在於它們的知識範圍有限且已凍結，這通常會導致模棱兩可且不準確的回應。因此，多模態檢索增強生成 (mRAG) 自然而然地被引入，以向 MLLM 提供全面且最新的知識，有效地擴展了知識範圍。然而，當前的 mRAG 方法有其固有的缺點，包括：1) 即使不需要外部知識，也會執行檢索。2) 缺乏對支持查詢證據的識別。3) 由於額外的資訊過濾模組或規則，導致模型複雜度增加。為了解決這些缺點，我們提出了一個新穎的通用架構，稱為 **m**ultimodal **R**etrieval-**R**eflection-**A**ugmented **G**eneration (mR$^2$AG)，它通過兩個易於實作的反射操作實現了適應性檢索和有用的資訊定位，以啟用答案，防止模型複雜度高。在 mR$^2$AG 中，檢索反射被設計為區分不同的使用者查詢，並避免重複的檢索呼叫，而相關性反射被引入以指導 MLLM 定位檢索內容的有益證據，並據此產生答案。此外，mR$^2$AG 可以整合到任何訓練有素的 MLLM 中，並在提議的 mR$^2$AG 指令微調資料集 (mR$^2$AG-IT) 上進行有效的微調。mR$^2$AG 在 INFOSEEK 和百科全書 VQA 上明顯優於最先進的 MLLM（例如 GPT-4v/o）和基於 RAG 的 MLLM，同時在廣泛的視覺依賴任務中保持了基礎 MLLM 的卓越能力。", "author": "Tao Zhang et.al.", "authors": "Tao Zhang, Ziqi Zhang, Zongyang Ma, Yuxin Chen, Zhongang Qi, Chunfeng Yuan, Bing Li, Junfu Pu, Yuxuan Zhao, Zehua Xie, Jin Ma, Ying Shan, Weiming Hu", "id": "2411.15041v1", "paper_url": "http://arxiv.org/abs/2411.15041v1", "repo": "null"}}