{"2410.23913": {"publish_time": "2024-10-31", "title": "Efficient Inference and Computation of Optimal Alternatives for Preference Languages Based On Lexicographic Models", "paper_summary": "We analyse preference inference, through consistency, for general preference\nlanguages based on lexicographic models. We identify a property, which we call\nstrong compositionality, that applies for many natural kinds of preference\nstatement, and that allows a greedy algorithm for determining consistency of a\nset of preference statements. We also consider different natural definitions of\noptimality, and their relations to each other, for general preference languages\nbased on lexicographic models. Based on our framework, we show that testing\nconsistency, and thus inference, is polynomial for a specific preference\nlanguage LpqT, which allows strict and non-strict statements, comparisons\nbetween outcomes and between partial tuples, both ceteris paribus and strong\nstatements, and their combination. Computing different kinds of optimal sets is\nalso shown to be polynomial; this is backed up by our experimental results.", "paper_summary_zh": "我們透過一致性來分析偏好推論，以基於字典模型的一般偏好語言為基礎。我們辨識出一個屬性，我們稱之為強組合性，它適用於許多自然類型的偏好陳述，且允許使用貪婪演算法來判斷偏好陳述集合的一致性。我們也考慮基於字典模型的一般偏好語言的不同自然最佳化定義，以及它們彼此的關係。根據我們的架構，我們顯示測試一致性，以及推論，對於允許嚴格和非嚴格陳述、結果之間和部分元組之間的比較、ceteris paribus 和強陳述，以及它們的組合的特定偏好語言 LpqT 來說是多項式的。計算不同類型的最佳集合也被顯示為多項式的；這由我們的實驗結果支持。", "author": "Nic Wilson et.al.", "authors": "Nic Wilson, Anne-Marie George", "id": "2410.23913v1", "paper_url": "http://arxiv.org/abs/2410.23913v1", "repo": "null"}}