{"2405.17502": {"publish_time": "2024-05-26", "title": "Exploring Nutritional Impact on Alzheimer's Mortality: An Explainable AI Approach", "paper_summary": "This article uses machine learning (ML) and explainable artificial\nintelligence (XAI) techniques to investigate the relationship between\nnutritional status and mortality rates associated with Alzheimers disease (AD).\nThe Third National Health and Nutrition Examination Survey (NHANES III)\ndatabase is employed for analysis. The random forest model is selected as the\nbase model for XAI analysis, and the Shapley Additive Explanations (SHAP)\nmethod is used to assess feature importance. The results highlight significant\nnutritional factors such as serum vitamin B12 and glycated hemoglobin. The\nstudy demonstrates the effectiveness of random forests in predicting AD\nmortality compared to other diseases. This research provides insights into the\nimpact of nutrition on AD and contributes to a deeper understanding of disease\nprogression.", "paper_summary_zh": "本文使用機器學習 (ML) 和可解釋人工智慧 (XAI) 技術來探討營養狀況與阿茲海默症 (AD) 相關的死亡率之間的關係。採用第三次全國健康與營養檢查調查 (NHANES III) 資料庫進行分析。選擇隨機森林模型作為 XAI 分析的基礎模型，並使用 Shapley Additive Explanations (SHAP) 方法來評估特徵重要性。結果突顯了重要的營養因素，例如血清維生素 B12 和糖化血紅蛋白。該研究證明了隨機森林在預測 AD 死亡率方面相較於其他疾病的有效性。本研究提供了營養對 AD 的影響的見解，並有助於更深入地了解疾病的進展。", "author": "Ziming Liu et.al.", "authors": "Ziming Liu, Longjian Liu, Robert E. Heidel, Xiaopeng Zhao", "id": "2405.17502v1", "paper_url": "http://arxiv.org/abs/2405.17502v1", "repo": "null"}}