{"2406.02335": {"publish_time": "2024-06-04", "title": "Probing the Category of Verbal Aspect in Transformer Language Models", "paper_summary": "We investigate how pretrained language models (PLM) encode the grammatical\ncategory of verbal aspect in Russian. Encoding of aspect in transformer LMs has\nnot been studied previously in any language. A particular challenge is posed by\n\"alternative contexts\": where either the perfective or the imperfective aspect\nis suitable grammatically and semantically. We perform probing using BERT and\nRoBERTa on alternative and non-alternative contexts. First, we assess the\nmodels' performance on aspect prediction, via behavioral probing. Next, we\nexamine the models' performance when their contextual representations are\nsubstituted with counterfactual representations, via causal probing. These\ncounterfactuals alter the value of the \"boundedness\" feature--a semantic\nfeature, which characterizes the action in the context. Experiments show that\nBERT and RoBERTa do encode aspect--mostly in their final layers. The\ncounterfactual interventions affect perfective and imperfective in opposite\nways, which is consistent with grammar: perfective is positively affected by\nadding the meaning of boundedness, and vice versa. The practical implications\nof our probing results are that fine-tuning only the last layers of BERT on\npredicting aspect is faster and more effective than fine-tuning the whole\nmodel. The model has high predictive uncertainty about aspect in alternative\ncontexts, which tend to lack explicit hints about the boundedness of the\ndescribed action.", "paper_summary_zh": "我們探討預訓練語言模型 (PLM) 如何編碼俄語中動詞體的語法範疇。轉換器語言模型中體的編碼以前未在任何語言中研究過。一個特別的挑戰是由「替代語境」提出的：在語法和語義上，完成體或未完成體都是適用的。我們使用 BERT 和 RoBERTa 對替代和非替代語境進行探測。首先，我們透過行為探測評估模型在體預測上的表現。接下來，我們透過因果探測檢查模型在它們的上下文表示被反事實表示取代時的表現。這些反事實改變了「有界性」特徵的值，這是一個語義特徵，它描述了語境中的動作。實驗表明，BERT 和 RoBERTa 確實編碼了體，主要在它們的最後一層。反事實介入以相反的方式影響完成體和未完成體，這與語法一致：完成體因加入有界性的含義而受到正面影響，反之亦然。我們探測結果的實際含義是，只微調 BERT 的最後幾層來預測體比微調整個模型更快、更有效。該模型對替代語境中的體有很高的預測不確定性，而替代語境往往缺乏關於所描述動作有界性的明確提示。", "author": "Anisia Katinskaia et.al.", "authors": "Anisia Katinskaia, Roman Yangarber", "id": "2406.02335v1", "paper_url": "http://arxiv.org/abs/2406.02335v1", "repo": "null"}}