{"2410.07053": {"publish_time": "2024-10-09", "title": "Robots in the Middle: Evaluating LLMs in Dispute Resolution", "paper_summary": "Mediation is a dispute resolution method featuring a neutral third-party\n(mediator) who intervenes to help the individuals resolve their dispute. In\nthis paper, we investigate to which extent large language models (LLMs) are\nable to act as mediators. We investigate whether LLMs are able to analyze\ndispute conversations, select suitable intervention types, and generate\nappropriate intervention messages. Using a novel, manually created dataset of\n50 dispute scenarios, we conduct a blind evaluation comparing LLMs with human\nannotators across several key metrics. Overall, the LLMs showed strong\nperformance, even outperforming our human annotators across dimensions.\nSpecifically, in 62% of the cases, the LLMs chose intervention types that were\nrated as better than or equivalent to those chosen by humans. Moreover, in 84%\nof the cases, the intervention messages generated by the LLMs were rated as\nbetter than or equal to the intervention messages written by humans. LLMs\nlikewise performed favourably on metrics such as impartiality, understanding\nand contextualization. Our results demonstrate the potential of integrating AI\nin online dispute resolution (ODR) platforms.", "paper_summary_zh": "調解是一種爭議解決方法，特點是由中立的第三方（調解人）介入，協助個人解決爭議。在本文中，我們探討大型語言模型（LLM）在多大程度上能夠擔任調解人的角色。我們探討 LLM 是否能夠分析爭議對話、選擇合適的介入類型，以及產生適當的介入訊息。我們使用一個新穎的手動建立的 50 個爭議情境資料集，進行一項盲測評估，比較 LLM 與人類註解者在幾個關鍵指標上的表現。整體而言，LLM 表現出色，甚至在各個面向都優於我們的人類註解者。具體來說，在 62% 的案例中，LLM 選擇的介入類型被評為優於或等同於人類選擇的類型。此外，在 84% 的案例中，LLM 生成的介入訊息被評為優於或等同於人類撰寫的介入訊息。同樣地，LLM 在公正性、理解力和情境化等指標上也表現良好。我們的結果證明了將 AI 整合到線上爭議解決（ODR）平台的潛力。", "author": "Jinzhe Tan et.al.", "authors": "Jinzhe Tan, Hannes Westermann, Nikhil Reddy Pottanigari, Jaromír Šavelka, Sébastien Meeùs, Mia Godet, Karim Benyekhlef", "id": "2410.07053v1", "paper_url": "http://arxiv.org/abs/2410.07053v1", "repo": "null"}}