{"2411.08347": {"publish_time": "2024-11-13", "title": "A Chinese Multi-label Affective Computing Dataset Based on Social Media Network Users", "paper_summary": "Emotion and personality are central elements in understanding human\npsychological states. Emotions reflect an individual subjective experiences,\nwhile personality reveals relatively stable behavioral and cognitive patterns.\nExisting affective computing datasets often annotate emotion and personality\ntraits separately, lacking fine-grained labeling of micro-emotions and emotion\nintensity in both single-label and multi-label classifications. Chinese emotion\ndatasets are extremely scarce, and datasets capturing Chinese user personality\ntraits are even more limited. To address these gaps, this study collected data\nfrom the major social media platform Weibo, screening 11,338 valid users from\nover 50,000 individuals with diverse MBTI personality labels and acquiring\n566,900 posts along with the user MBTI personality tags. Using the EQN method,\nwe compiled a multi-label Chinese affective computing dataset that integrates\nthe same user's personality traits with six emotions and micro-emotions, each\nannotated with intensity levels. Validation results across multiple NLP\nclassification models demonstrate the dataset strong utility. This dataset is\ndesigned to advance machine recognition of complex human emotions and provide\ndata support for research in psychology, education, marketing, finance, and\npolitics.", "paper_summary_zh": "情感和人格是理解人類心理狀態的核心元素。情感反映了一個體的主觀體驗，而人格揭示了相對穩定的行為和認知模式。現有的情感計算數據集通常單獨註釋情感和人格特質，缺乏對微觀情感和情感強度的細粒度標註，無論是在單標籤還是多標籤分類中。中文情感數據集極為稀缺，而捕捉中文用戶人格特質的數據集更是少之又少。為了彌補這些差距，本研究從主流社交媒體平台微博收集數據，從 50,000 多名具有不同 MBTI 人格標籤的個體中篩選出 11,338 名有效用戶，並獲取 566,900 篇帖子以及用戶 MBTI 人格標籤。使用 EQN 方法，我們編制了一個多標籤中文情感計算數據集，將同一用戶的人格特質與六種情緒和微觀情緒相整合，每個情緒都註釋了強度級別。跨多個 NLP 分類模型的驗證結果證明了該數據集的強大效用。此數據集旨在推進對複雜人類情感的機器識別，並為心理學、教育、市場行銷、金融和政治等領域的研究提供數據支持。", "author": "Jingyi Zhou et.al.", "authors": "Jingyi Zhou, Senlin Luo, Haofan Chen", "id": "2411.08347v1", "paper_url": "http://arxiv.org/abs/2411.08347v1", "repo": "https://github.com/yeaso/chinese-affective-computing-dataset"}}