{"2411.07199": {"publish_time": "2024-11-11", "title": "OmniEdit: Building Image Editing Generalist Models Through Specialist Supervision", "paper_summary": "Instruction-guided image editing methods have demonstrated significant\npotential by training diffusion models on automatically synthesized or manually\nannotated image editing pairs. However, these methods remain far from\npractical, real-life applications. We identify three primary challenges\ncontributing to this gap. Firstly, existing models have limited editing skills\ndue to the biased synthesis process. Secondly, these methods are trained with\ndatasets with a high volume of noise and artifacts. This is due to the\napplication of simple filtering methods like CLIP-score. Thirdly, all these\ndatasets are restricted to a single low resolution and fixed aspect ratio,\nlimiting the versatility to handle real-world use cases. In this paper, we\npresent \\omniedit, which is an omnipotent editor to handle seven different\nimage editing tasks with any aspect ratio seamlessly. Our contribution is in\nfour folds: (1) \\omniedit is trained by utilizing the supervision from seven\ndifferent specialist models to ensure task coverage. (2) we utilize importance\nsampling based on the scores provided by large multimodal models (like GPT-4o)\ninstead of CLIP-score to improve the data quality. (3) we propose a new editing\narchitecture called EditNet to greatly boost the editing success rate, (4) we\nprovide images with different aspect ratios to ensure that our model can handle\nany image in the wild. We have curated a test set containing images of\ndifferent aspect ratios, accompanied by diverse instructions to cover different\ntasks. Both automatic evaluation and human evaluations demonstrate that\n\\omniedit can significantly outperform all the existing models. Our code,\ndataset and model will be available at\n\\url{https://tiger-ai-lab.github.io/OmniEdit/}", "paper_summary_zh": "<paragraph>以指令為導向的影像編輯方法已展現出顯著的潛力，方法是訓練擴散模型於自動合成或手動標註的影像編輯配對上。然而，這些方法仍遠離實務上的實際應用。我們找出導致此差距的三個主要挑戰。首先，現有的模型由於有偏差的合成程序，導致編輯技能受限。其次，這些方法使用包含大量雜訊和人工製品的資料集進行訓練。這是由於應用像 CLIP 分數之類的簡單過濾方法所致。第三，所有這些資料集都限制於單一低解析度和固定長寬比，限制了處理實際用例的多功能性。在本文中，我們提出 \\omniedit，這是一個萬能編輯器，可無縫處理七種不同的影像編輯任務，且不限長寬比。我們的貢獻有四個面向：(1) \\omniedit 透過利用來自七種不同專家模型的監督進行訓練，以確保任務涵蓋範圍。(2) 我們利用大型多模態模型 (例如 GPT-4o) 所提供的分數，而不是 CLIP 分數，來進行重要性抽樣，以提升資料品質。(3) 我們提出一個名為 EditNet 的新編輯架構，以大幅提升編輯成功率，(4) 我們提供具有不同長寬比的影像，以確保我們的模型能夠處理任何野外影像。我們策劃了一個包含不同長寬比影像的測試集，並附有不同的指令來涵蓋不同的任務。自動評估和人工評估均顯示，\\omniedit 能顯著優於所有現有模型。我們的程式碼、資料集和模型將會在 \\url{https://tiger-ai-lab.github.io/OmniEdit/} 提供。</paragraph>", "author": "Cong Wei et.al.", "authors": "Cong Wei, Zheyang Xiong, Weiming Ren, Xinrun Du, Ge Zhang, Wenhu Chen", "id": "2411.07199v1", "paper_url": "http://arxiv.org/abs/2411.07199v1", "repo": "null"}}