{"2411.03588": {"publish_time": "2024-11-06", "title": "An Experimental Study on Decomposition-Based Deep Ensemble Learning for Traffic Flow Forecasting", "paper_summary": "Traffic flow forecasting is a crucial task in intelligent transport systems.\nDeep learning offers an effective solution, capturing complex patterns in\ntime-series traffic flow data to enable the accurate prediction. However, deep\nlearning models are prone to overfitting the intricate details of flow data,\nleading to poor generalisation. Recent studies suggest that decomposition-based\ndeep ensemble learning methods may address this issue by breaking down a time\nseries into multiple simpler signals, upon which deep learning models are built\nand ensembled to generate the final prediction. However, few studies have\ncompared the performance of decomposition-based ensemble methods with\nnon-decomposition-based ones which directly utilise raw time-series data. This\nwork compares several decomposition-based and non-decomposition-based deep\nensemble learning methods. Experimental results on three traffic datasets\ndemonstrate the superiority of decomposition-based ensemble methods, while also\nrevealing their sensitivity to aggregation strategies and forecasting horizons.", "paper_summary_zh": "交通流量預測是智慧運輸系統中的一項重要任務。\n深度學習提供了一個有效的解決方案，捕捉時序交通流量資料中的複雜模式，以實現準確預測。然而，深度學習模型容易過度擬合流量資料的複雜細節，導致泛化能力不佳。最近的研究表明，基於分解的深度集成學習方法可以通過將時序分解為多個較簡單的信號來解決此問題，然後建立深度學習模型並集成它們以產生最終預測。然而，很少有研究比較基於分解的集成方法與直接利用原始時序資料的非基於分解方法的效能。這項工作比較了幾種基於分解和非基於分解的深度集成學習方法。在三個交通資料集上的實驗結果證明了基於分解的集成方法的優越性，同時也揭示了它們對聚合策略和預測範圍的敏感性。", "author": "Qiyuan Zhu et.al.", "authors": "Qiyuan Zhu, A. K. Qin, Hussein Dia, Adriana-Simona Mihaita, Hanna Grzybowska", "id": "2411.03588v1", "paper_url": "http://arxiv.org/abs/2411.03588v1", "repo": "null"}}