{"2408.02798": {"publish_time": "2024-08-05", "title": "Examining Gender and Power on Wikipedia Through Face and Politeness", "paper_summary": "We propose a framework for analyzing discourse by combining two\ninterdependent concepts from sociolinguistic theory: face acts and politeness.\nWhile politeness has robust existing tools and data, face acts are less\nresourced. We introduce a new corpus created by annotating Wikipedia talk pages\nwith face acts and we use this to train a face act tagger. We then employ our\nframework to study how face and politeness interact with gender and power in\ndiscussions between Wikipedia editors. Among other findings, we observe that\nfemale Wikipedians are not only more polite, which is consistent with prior\nstudies, but that this difference corresponds with significantly more language\ndirected at humbling aspects of their own face. Interestingly, the distinction\nnearly vanishes once limiting to editors with administrative power.", "paper_summary_zh": "我們提出一個分析話語的架構，結合社會語言學理論中的兩個相互依賴的概念：面子行為和禮貌。\n雖然禮貌有強大的現有工具和資料，但面子行為的資源較少。我們引入一個新的語料庫，它是通過用面子行為註釋維基百科討論頁面創建的，我們使用它來訓練一個面子行為標記器。然後，我們使用我們的框架來研究面子和禮貌如何在維基百科編輯之間的討論中與性別和權力互動。在其他發現中，我們觀察到女性維基百科編輯者不僅更禮貌，這與先前的研究一致，而且這種差異與更多針對自己面子謙卑方面的語言相一致。有趣的是，一旦限制在具有管理權力的編輯者，這種區別幾乎消失。", "author": "Adil Soubki et.al.", "authors": "Adil Soubki, Shyne Choi, Owen Rambow", "id": "2408.02798v1", "paper_url": "http://arxiv.org/abs/2408.02798v1", "repo": "null"}}