{"2501.12102": {"publish_time": "2025-01-21", "title": "Proxies for Distortion and Consistency with Applications for Real-World Image Restoration", "paper_summary": "Real-world image restoration deals with the recovery of images suffering from\nan unknown degradation. This task is typically addressed while being given only\ndegraded images, without their corresponding ground-truth versions. In this\nhard setting, designing and evaluating restoration algorithms becomes highly\nchallenging. This paper offers a suite of tools that can serve both the design\nand assessment of real-world image restoration algorithms. Our work starts by\nproposing a trained model that predicts the chain of degradations a given\nreal-world measured input has gone through. We show how this estimator can be\nused to approximate the consistency -- the match between the measurements and\nany proposed recovered image. We also use this estimator as a guiding force for\nthe design of a simple and highly-effective plug-and-play real-world image\nrestoration algorithm, leveraging a pre-trained diffusion-based image prior.\nFurthermore, this work proposes no-reference proxy measures of MSE and LPIPS,\nwhich, without access to the ground-truth images, allow ranking of real-world\nimage restoration algorithms according to their (approximate) MSE and LPIPS.\nThe proposed suite provides a versatile, first of its kind framework for\nevaluating and comparing blind image restoration algorithms in real-world\nscenarios.", "paper_summary_zh": "真實世界的影像修復處理受損影像的復原，其損壞情況不明。此任務通常在僅提供受損影像的情況下進行，而沒有對應的真實版本。在此艱難的設定中，設計和評估修復演算法變得極具挑戰性。本文提供了一套工具，可同時服務於真實世界影像修復演算法的設計和評估。我們的研究從提出一個訓練好的模型開始，該模型預測給定的真實世界測量輸入所經歷的一連串劣化。我們展示了如何使用此估計器來逼近一致性，即測量值與任何提議的復原影像之間的匹配。我們還使用此估計器作為設計一個簡單且高效的即插即用真實世界影像修復演算法的指導力量，利用預先訓練的基於擴散的影像先驗。此外，這項工作提出了 MSE 和 LPIPS 的無參考代理測量，在無法取得真實影像的情況下，可以根據其（近似的）MSE 和 LPIPS 對真實世界影像修復演算法進行排名。所提出的套件提供了一個通用且首創的架構，用於評估和比較在真實世界場景中盲目影像修復演算法。", "author": "Sean Man et.al.", "authors": "Sean Man, Guy Ohayon, Ron Raphaeli, Michael Elad", "id": "2501.12102v1", "paper_url": "http://arxiv.org/abs/2501.12102v1", "repo": "null"}}