{"2410.18558": {"publish_time": "2024-10-24", "title": "Infinity-MM: Scaling Multimodal Performance with Large-Scale and High-Quality Instruction Data", "paper_summary": "Vision-Language Models (VLMs) have recently made significant progress, but\nthe limited scale and quality of open-source instruction data hinder their\nperformance compared to closed-source models. In this work, we address this\nlimitation by introducing Infinity-MM, a large-scale multimodal instruction\ndataset with 40 million samples, enhanced through rigorous quality filtering\nand deduplication. We also propose a synthetic instruction generation method\nbased on open-source VLMs, using detailed image annotations and diverse\nquestion generation. Using this data, we trained a 2-billion-parameter VLM,\nAquila-VL-2B, achieving state-of-the-art (SOTA) performance for models of\nsimilar scale. This demonstrates that expanding instruction data and generating\nsynthetic data can significantly improve the performance of open-source models.", "paper_summary_zh": "視覺語言模型 (VLM) 近期取得顯著進展，但與封閉原始碼模型相比，開放原始碼指令資料的規模和品質有限，阻礙了其效能。在這項工作中，我們透過引入 Infinity-MM 來解決此限制，這是一個包含 4000 萬個範例的大型多模態指令資料集，並透過嚴格的品質過濾和刪除重複項而增強。我們也提出一個基於開放原始碼 VLM 的合成指令生成方法，使用詳細的影像註解和多元的問題生成。使用此資料，我們訓練了一個 20 億參數的 VLM，Aquila-VL-2B，達到了與類似規模模型的最新技術 (SOTA) 效能。這證明了擴充指令資料和生成合成資料可以顯著提升開放原始碼模型的效能。", "author": "Shuhao Gu et.al.", "authors": "Shuhao Gu, Jialing Zhang, Siyuan Zhou, Kevin Yu, Zhaohu Xing, Liangdong Wang, Zhou Cao, Jintao Jia, Zhuoyi Zhang, Yixuan Wang, Zhenchong Hu, Bo-Wen Zhang, Jijie Li, Dong Liang, Yingli Zhao, Yulong Ao, Yaoqi Liu, Fangxiang Feng, Guang Liu", "id": "2410.18558v1", "paper_url": "http://arxiv.org/abs/2410.18558v1", "repo": "null"}}