{"2410.08188": {"publish_time": "2024-10-10", "title": "DifFRelight: Diffusion-Based Facial Performance Relighting", "paper_summary": "We present a novel framework for free-viewpoint facial performance relighting\nusing diffusion-based image-to-image translation. Leveraging a subject-specific\ndataset containing diverse facial expressions captured under various lighting\nconditions, including flat-lit and one-light-at-a-time (OLAT) scenarios, we\ntrain a diffusion model for precise lighting control, enabling high-fidelity\nrelit facial images from flat-lit inputs. Our framework includes\nspatially-aligned conditioning of flat-lit captures and random noise, along\nwith integrated lighting information for global control, utilizing prior\nknowledge from the pre-trained Stable Diffusion model. This model is then\napplied to dynamic facial performances captured in a consistent flat-lit\nenvironment and reconstructed for novel-view synthesis using a scalable dynamic\n3D Gaussian Splatting method to maintain quality and consistency in the relit\nresults. In addition, we introduce unified lighting control by integrating a\nnovel area lighting representation with directional lighting, allowing for\njoint adjustments in light size and direction. We also enable high dynamic\nrange imaging (HDRI) composition using multiple directional lights to produce\ndynamic sequences under complex lighting conditions. Our evaluations\ndemonstrate the models efficiency in achieving precise lighting control and\ngeneralizing across various facial expressions while preserving detailed\nfeatures such as skintexture andhair. The model accurately reproduces complex\nlighting effects like eye reflections, subsurface scattering, self-shadowing,\nand translucency, advancing photorealism within our framework.", "paper_summary_zh": "<paragraph>我們提出一個新穎的架構，用於自由視點人臉性能重新打光，使用基於擴散的影像轉影像轉換。利用包含在各種光照條件下擷取的各種面部表情的主題特定資料集，包括平面光和一次一光（OLAT）場景，我們訓練一個擴散模型以進行精確的光照控制，從平面光輸入中啟用高保真重新點亮的面部影像。我們的架構包括平面光擷取和隨機雜訊的空間對齊條件，以及用於全局控制的整合光照資訊，利用預先訓練的 Stable Diffusion 模型的先驗知識。然後將此模型應用於在一致的平面光環境中擷取的動態面部表演，並使用可擴充的動態 3D 高斯噴繪方法重建以進行新視圖合成，以維持重新點亮結果的品質和一致性。此外，我們透過整合一個新穎區域光照表示與方向光照來引入統一光照控制，允許對光照大小和方向進行聯合調整。我們還啟用使用多個方向光的高動態範圍成像（HDRI）合成，以在複雜的光照條件下產生動態序列。我們的評估證明了該模型在實現精確光照控制和概括各種面部表情方面的效率，同時保留了皮膚紋理和頭髮等詳細特徵。該模型準確地重現了複雜的光照效果，例如眼睛反射、次表面散射、自遮蔽和半透明，推動了我們架構中的寫實主義。</paragraph>", "author": "Mingming He et.al.", "authors": "Mingming He, Pascal Clausen, Ahmet Levent Taşel, Li Ma, Oliver Pilarski, Wenqi Xian, Laszlo Rikker, Xueming Yu, Ryan Burgert, Ning Yu, Paul Debevec", "id": "2410.08188v1", "paper_url": "http://arxiv.org/abs/2410.08188v1", "repo": "null"}}