{"2501.14189": {"publish_time": "2025-01-24", "title": "Distributed Multi-Agent Coordination Using Multi-Modal Foundation Models", "paper_summary": "Distributed Constraint Optimization Problems (DCOPs) offer a powerful\nframework for multi-agent coordination but often rely on labor-intensive,\nmanual problem construction. To address this, we introduce VL-DCOPs, a\nframework that takes advantage of large multimodal foundation models (LFMs) to\nautomatically generate constraints from both visual and linguistic\ninstructions. We then introduce a spectrum of agent archetypes for solving\nVL-DCOPs: from a neuro-symbolic agent that delegates some of the algorithmic\ndecisions to an LFM, to a fully neural agent that depends entirely on an LFM\nfor coordination. We evaluate these agent archetypes using state-of-the-art\nLLMs (large language models) and VLMs (vision language models) on three novel\nVL-DCOP tasks and compare their respective advantages and drawbacks. Lastly, we\ndiscuss how this work extends to broader frontier challenges in the DCOP\nliterature.", "paper_summary_zh": "分散式約束最佳化問題 (DCOP) 提供了一個強大的多代理協調架構，但通常依賴於勞力密集的手動問題建構。為了解決這個問題，我們引入了 VL-DCOP，一個利用大型多模態基礎模型 (LFM) 從視覺和語言指令自動產生約束的架構。接著我們引入了用於解決 VL-DCOP 的一組代理原型：從將部分演算法決策委派給 LFM 的神經符號代理，到完全依賴 LFM 進行協調的全神經網路代理。我們使用最先進的 LLM (大型語言模型) 和 VLM (視覺語言模型) 在三個新穎的 VL-DCOP 任務上評估這些代理原型，並比較它們各自的優缺點。最後，我們討論了這項工作如何擴展到 DCOP 文獻中更廣泛的前沿挑戰。", "author": "Saaduddin Mahmud et.al.", "authors": "Saaduddin Mahmud, Dorian Benhamou Goldfajn, Shlomo Zilberstein", "id": "2501.14189v1", "paper_url": "http://arxiv.org/abs/2501.14189v1", "repo": "null"}}