{"2406.07232": {"publish_time": "2024-06-11", "title": "DUAL-REFLECT: Enhancing Large Language Models for Reflective Translation through Dual Learning Feedback Mechanisms", "paper_summary": "Recently, large language models (LLMs) enhanced by self-reflection have\nachieved promising performance on machine translation. The key idea is guiding\nLLMs to generate translation with human-like feedback. However, existing\nself-reflection methods lack effective feedback information, limiting the\ntranslation performance. To address this, we introduce a DUAL-REFLECT\nframework, leveraging the dual learning of translation tasks to provide\neffective feedback, thereby enhancing the models' self-reflective abilities and\nimproving translation performance. The application of this method across\nvarious translation tasks has proven its effectiveness in improving translation\naccuracy and eliminating ambiguities, especially in translation tasks with\nlow-resource language pairs.", "paper_summary_zh": "近期，由自我反省功能强化的巨量语言模型（LLM）已在机器翻译方面取得了可喜的成果。关键思想在于引导 LLM 根据类人反馈生成翻译。然而，现有的自我反省方法缺乏有效的反馈信息，限制了翻译性能。为了解决此问题，我们引入了 DUAL-REFLECT 框架，利用翻译任务的双重学习来提供有效的反馈，从而增强模型的自我反省能力并提高翻译性能。该方法在各种翻译任务中的应用已证明其在提高翻译准确性和消除歧义方面是有效的，尤其是在资源较少的语言对的翻译任务中。", "author": "Andong Chen et.al.", "authors": "Andong Chen, Lianzhang Lou, Kehai Chen, Xuefeng Bai, Yang Xiang, Muyun Yang, Tiejun Zhao, Min Zhang", "id": "2406.07232v1", "paper_url": "http://arxiv.org/abs/2406.07232v1", "repo": "https://github.com/loulianzhang/dual-reflect"}}