{"2502.09799": {"publish_time": "2025-02-13", "title": "Co-designing Large Language Model Tools for Project-Based Learning with K12 Educators", "paper_summary": "The emergence of generative AI, particularly large language models (LLMs),\nhas opened the door for student-centered and active learning methods like\nproject-based learning (PBL). However, PBL poses practical implementation\nchallenges for educators around project design and management, assessment, and\nbalancing student guidance with student autonomy. The following research\ndocuments a co-design process with interdisciplinary K-12 teachers to explore\nand address the current PBL challenges they face. Through teacher-driven\ninterviews, collaborative workshops, and iterative design of wireframes, we\ngathered evidence for ways LLMs can support teachers in implementing\nhigh-quality PBL pedagogy by automating routine tasks and enhancing\npersonalized learning. Teachers in the study advocated for supporting their\nprofessional growth and augmenting their current roles without replacing them.\nThey also identified affordances and challenges around classroom integration,\nincluding resource requirements and constraints, ethical concerns, and\npotential immediate and long-term impacts. Drawing on these, we propose design\nguidelines for future deployment of LLM tools in PBL.", "paper_summary_zh": "生成式 AI 的出現，尤其是大型語言模型 (LLM)，\n為以學生為中心和主動學習的方法開啟了大門，例如\n專題式學習 (PBL)。然而，PBL 對教育工作者提出了實際的實施\n挑戰，包括專題設計和管理、評量，以及平衡學生指導與學生自主性。以下研究\n記錄了一個與跨領域 K-12 教師共同設計的過程，以探索\n並解決他們目前面臨的 PBL 挑戰。透過教師主導的\n訪談、協作工作坊和線框圖的迭代設計，我們\n收集了 LLM 可以透過自動化例行工作和增強\n個人化學習來支援教師實施高品質 PBL 教學法的證據。研究中的教師主張支援他們的\n專業成長並擴充他們目前的角色，而不是取代他們。\n他們也指出了教室整合的優點和挑戰，\n包括資源需求和限制、倫理考量，以及\n潛在的立即和長期影響。根據這些，我們提出設計\n未來在 PBL 中部署 LLM 工具的準則。", "author": "Prerna Ravi et.al.", "authors": "Prerna Ravi, John Masla, Gisella Kakoti, Grace Lin, Emma Anderson, Matt Taylor, Anastasia Ostrowski, Cynthia Breazeal, Eric Klopfer, Hal Abelson", "id": "2502.09799v1", "paper_url": "http://arxiv.org/abs/2502.09799v1", "repo": "null"}}