{"2411.10246": {"publish_time": "2024-11-15", "title": "Scaling up the Evaluation of Collaborative Problem Solving: Promises and Challenges of Coding Chat Data with ChatGPT", "paper_summary": "Collaborative problem solving (CPS) is widely recognized as a critical 21st\ncentury skill. Efficiently coding communication data is a big challenge in\nscaling up research on assessing CPS. This paper reports the findings on using\nChatGPT to directly code CPS chat data by benchmarking performance across\nmultiple datasets and coding frameworks. We found that ChatGPT-based coding\noutperformed human coding in tasks where the discussions were characterized by\ncolloquial languages but fell short in tasks where the discussions dealt with\nspecialized scientific terminology and contexts. The findings offer practical\nguidelines for researchers to develop strategies for efficient and scalable\nanalysis of communication data from CPS tasks.", "paper_summary_zh": "協作問題解決 (CPS) 廣泛被認為是 21 世紀的一項關鍵技能。有效編碼溝通資料是擴大 CPS 評估研究的一項重大挑戰。本文報告了使用 ChatGPT 直接編碼 CPS 聊天資料的發現，並透過對多個資料集和編碼框架進行效能基準測試。我們發現，在討論以口語為特徵的任務中，基於 ChatGPT 的編碼優於人工編碼，但在討論涉及專業科學術語和背景的任務中則表現不佳。這些發現為研究人員提供了實用的指南，以便制定策略，以有效且可擴充的方式分析來自 CPS 任務的溝通資料。", "author": "Jiangang Hao et.al.", "authors": "Jiangang Hao, Wenju Cui, Patrick Kyllonen, Emily Kerzabi, Lei Liu, Michael Flor", "id": "2411.10246v1", "paper_url": "http://arxiv.org/abs/2411.10246v1", "repo": "null"}}