{"2501.11651": {"publish_time": "2025-01-20", "title": "Advancing Language Model Reasoning through Reinforcement Learning and Inference Scaling", "paper_summary": "Large language models (LLMs) have demonstrated remarkable capabilities in\ncomplex reasoning tasks. However, existing approaches mainly rely on imitation\nlearning and struggle to achieve effective test-time scaling. While\nreinforcement learning (RL) holds promise for enabling self-exploration and\nlearning from feedback, recent attempts yield only modest improvements in\ncomplex reasoning. In this paper, we present T1 to scale RL by encouraging\nexploration and understand inference scaling. We first initialize the LLM using\nsynthesized chain-of-thought data that integrates trial-and-error and\nself-verification. To scale RL training, we promote increased sampling\ndiversity through oversampling. We further employ an entropy bonus as an\nauxiliary loss, alongside a dynamic anchor for regularization to facilitate\nreward optimization. We demonstrate that T1 with open LLMs as its base exhibits\ninference scaling behavior and achieves superior performance on challenging\nmath reasoning benchmarks. For example, T1 with Qwen2.5-32B as the base model\noutperforms the recent Qwen QwQ-32B-Preview model on MATH500, AIME2024, and\nOmni-math-500. More importantly, we present a simple strategy to examine\ninference scaling, where increased inference budgets directly lead to T1's\nbetter performance without any additional verification. We will open-source the\nT1 models and the data used to train them at \\url{https://github.com/THUDM/T1}.", "paper_summary_zh": "大型語言模型（LLM）在複雜推理任務中展現出非凡的能力。然而，現有方法主要依賴於模仿學習，並且難以實現有效的測試時間擴展。雖然強化學習（RL）有望實現自我探索和從回饋中學習，但最近的嘗試在複雜推理中僅產生了適度的改進。在本文中，我們提出 T1 來擴展 RL，以鼓勵探索並了解推理擴展。我們首先使用綜合的思維鏈數據初始化 LLM，該數據整合了試錯和自我驗證。為了擴展 RL 訓練，我們通過過度採樣來促進增加採樣多樣性。我們進一步採用熵獎勵作為輔助損失，並採用動態錨點進行正則化，以促進獎勵優化。我們證明了以開放式 LLM 為基礎的 T1 表現出推理擴展行為，並在具有挑戰性的數學推理基準上取得了卓越的性能。例如，以 Qwen2.5-32B 作為基礎模型的 T1 在 MATH500、AIME2024 和 Omni-math-500 上優於最近的 Qwen QwQ-32B-Preview 模型。更重要的是，我們提出了一個簡單的策略來檢查推理擴展，其中增加的推理預算直接導致 T1 的更好性能，而無需任何額外的驗證。我們將在 https://github.com/THUDM/T1 開源 T1 模型和用於訓練它們的數據。", "author": "Zhenyu Hou et.al.", "authors": "Zhenyu Hou, Xin Lv, Rui Lu, Jiajie Zhang, Yujiang Li, Zijun Yao, Juanzi Li, Jie Tang, Yuxiao Dong", "id": "2501.11651v1", "paper_url": "http://arxiv.org/abs/2501.11651v1", "repo": "https://github.com/thudm/t1"}}