{"2412.17408": {"publish_time": "2024-12-23", "title": "Just What You Desire: Constrained Timeline Summarization with Self-Reflection for Enhanced Relevance", "paper_summary": "Given news articles about an entity, such as a public figure or organization,\ntimeline summarization (TLS) involves generating a timeline that summarizes the\nkey events about the entity. However, the TLS task is too underspecified, since\nwhat is of interest to each reader may vary, and hence there is not a single\nideal or optimal timeline. In this paper, we introduce a novel task, called\nConstrained Timeline Summarization (CTLS), where a timeline is generated in\nwhich all events in the timeline meet some constraint. An example of a\nconstrained timeline concerns the legal battles of Tiger Woods, where only\nevents related to his legal problems are selected to appear in the timeline. We\ncollected a new human-verified dataset of constrained timelines involving 47\nentities and 5 constraints per entity. We propose an approach that employs a\nlarge language model (LLM) to summarize news articles according to a specified\nconstraint and cluster them to identify key events to include in a constrained\ntimeline. In addition, we propose a novel self-reflection method during summary\ngeneration, demonstrating that this approach successfully leads to improved\nperformance.", "paper_summary_zh": "给定有关实体（例如公众人物或组织）的新闻文章，时间线摘要 (TLS) 涉及生成一条总结该实体关键事件的时间线。然而，TLS 任务过于不具体，因为每个读者的兴趣可能不同，因此没有单一的理想或最佳时间线。在本文中，我们引入了一项新任务，称为受限时间线摘要 (CTLS)，其中生成一条时间线，其中时间线中的所有事件都满足某些约束。受限时间线的一个示例涉及老虎伍兹的法律纠纷，其中仅选择与他的法律问题相关的时间出现在时间线中。我们收集了一个新的经过人工验证的受限时间线数据集，涉及 47 个实体和每个实体 5 个约束。我们提出了一种方法，该方法采用大型语言模型 (LLM) 根据指定约束总结新闻文章，并将它们聚类以识别要包含在受限时间线中的关键事件。此外，我们在摘要生成期间提出了一种新颖的自省方法，证明这种方法成功地带来了性能改进。", "author": "Muhammad Reza Qorib et.al.", "authors": "Muhammad Reza Qorib, Qisheng Hu, Hwee Tou Ng", "id": "2412.17408v1", "paper_url": "http://arxiv.org/abs/2412.17408v1", "repo": "https://github.com/nusnlp/reacts"}}