{"2412.06474": {"publish_time": "2024-12-09", "title": "From Uncertainty to Trust: Enhancing Reliability in Vision-Language Models with Uncertainty-Guided Dropout Decoding", "paper_summary": "Large vision-language models (LVLMs) demonstrate remarkable capabilities in\nmultimodal tasks but are prone to misinterpreting visual inputs, often\nresulting in hallucinations and unreliable outputs. To address these\nchallenges, we propose Dropout Decoding, a novel inference-time approach that\nquantifies the uncertainty of visual tokens and selectively masks uncertain\ntokens to improve decoding. Our method measures the uncertainty of each visual\ntoken by projecting it onto the text space and decomposing it into aleatoric\nand epistemic components. Specifically, we focus on epistemic uncertainty,\nwhich captures perception-related errors more effectively. Inspired by dropout\nregularization, we introduce uncertainty-guided token dropout, which applies\nthe dropout principle to input visual tokens instead of model parameters, and\nduring inference rather than training. By aggregating predictions from an\nensemble of masked decoding contexts, Dropout Decoding robustly mitigates\nerrors arising from visual token misinterpretations. Evaluations on benchmarks\nincluding CHAIR, THRONE, and MMBench demonstrate that Dropout Decoding\nsignificantly reduces object hallucinations (OH) and enhances both reliability\nand quality of LVLM outputs across diverse visual contexts.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 在多模態任務中展現出非凡的能力，但容易誤解視覺輸入，經常導致幻覺和不可靠的輸出。為了應對這些挑戰，我們提出 Dropout Decoding，這是一種新穎的推論時間方法，它量化視覺符號的不確定性，並選擇性地遮罩不確定的符號以改善解碼。我們的模型通過將每個視覺符號投射到文本空間並將其分解為隨機和認識論組成部分，來衡量每個視覺符號的不確定性。具體來說，我們專注於認識論不確定性，它更有效地捕捉與感知相關的錯誤。在 Dropout 正則化的啟發下，我們引入了不確定性引導符號 Dropout，它將 Dropout 原理應用於輸入視覺符號，而不是模型參數，並且在推論期間而不是訓練期間。通過匯總來自遮罩解碼上下文的預測，Dropout Decoding 強有力地減輕了源自視覺符號誤解的錯誤。在包括 CHAIR、THRONE 和 MMBench 在內的基準上的評估表明，Dropout Decoding 大幅減少了物件幻覺 (OH)，並增強了 LVLM 輸出在各種視覺環境中的可靠性和品質。", "author": "Yixiong Fang et.al.", "authors": "Yixiong Fang, Ziran Yang, Zhaorun Chen, Zhuokai Zhao, Jiawei Zhou", "id": "2412.06474v1", "paper_url": "http://arxiv.org/abs/2412.06474v1", "repo": "https://github.com/kigb/dropoutdecoding"}}