{"2501.14713": {"publish_time": "2025-01-24", "title": "FlexiGPT: Pruning and Extending Large Language Models with Low-Rank Weight Sharing", "paper_summary": "The rapid proliferation of large language models (LLMs) in natural language\nprocessing (NLP) has created a critical need for techniques that enable\nefficient deployment on memory-constrained devices without compromising\nperformance. We present a method to prune LLMs that selectively prunes model\nblocks based on an importance score and replaces them with a low-parameter\nreplacement strategy. Specifically, we propose a principled metric to replace\neach pruned block using a weight-sharing mechanism that leverages unpruned\ncounterparts from the model and block-specific low-rank adapters. Furthermore,\nwe facilitate the learning of these replacement blocks with output feature\nnormalization and an adapter initialization scheme built on low-rank SVD\nreconstructions. Empirical evaluations demonstrate substantial performance\ngains over existing methods, achieving state-of-the-art performance on 5/6\nbenchmarks for a compression rate of 30% and 6/6 benchmarks for a compression\nrate of 40%. We also demonstrate that our approach can extend smaller models,\nboosting performance on 6/6 benchmarks using only ~0.3% tokens of extended\ntraining with minimal additional parameter costs.", "paper_summary_zh": "大型語言模型（LLM）在自然語言處理（NLP）中的快速擴散，已創造出對技術的關鍵需求，這些技術可以在不影響效能的情況下，在受記憶體限制的裝置上進行有效率的部署。我們提出了一種修剪 LLM 的方法，該方法根據重要性分數選擇性地修剪模型區塊，並用低參數替換策略取代它們。具體來說，我們提出一個有原則的指標，使用權重共享機制替換每個修剪區塊，該機制利用模型中未修剪的對應部分和特定區塊的低階適配器。此外，我們使用輸出特徵正規化和建立在低階 SVD 重建上的適配器初始化方案，促進這些替換區塊的學習。經驗評估顯示，與現有方法相比，效能大幅提升，在壓縮率為 30% 的情況下，在 5/6 個基準測試中達到最先進的效能，在壓縮率為 40% 的情況下，在 6/6 個基準測試中達到最先進的效能。我們還證明，我們的做法可以擴充較小的模型，僅使用約 0.3% 的延伸訓練權標，就能在 6/6 個基準測試中提升效能，而額外的參數成本極小。", "author": "James Seale Smith et.al.", "authors": "James Seale Smith, Chi-Heng Lin, Shikhar Tuli, Haris Jeelani, Shangqian Gao, Yilin Shen, Hongxia Jin, Yen-Chang Hsu", "id": "2501.14713v1", "paper_url": "http://arxiv.org/abs/2501.14713v1", "repo": "null"}}