{"2405.10611": {"publish_time": "2024-05-17", "title": "A Certified Proof Checker for Deep Neural Network Verification", "paper_summary": "Recent advances in the verification of deep neural networks (DNNs) have\nopened the way for broader usage of DNN verification technology in many\napplication areas, including safety-critical ones. DNN verifiers are themselves\ncomplex programs that have been shown to be susceptible to errors and\nimprecisions; this in turn has raised the question of trust in DNN verifiers.\nOne prominent attempt to address this issue is enhancing DNN verifiers with the\ncapability of producing proofs of their results that are subject to independent\nalgorithmic certification (proof checking). Formulations of proof production\nand proof checking already exist on top of the state-of-the-art Marabou DNN\nverifier. The native implementation of the proof checking algorithm for Marabou\nwas done in C++ and itself raised the question of trust in the code (e.g., in\nthe precision of floating point calculations or guarantees for implementation\nsoundness). Here, we present an alternative implementation of the Marabou proof\nchecking algorithm in Imandra -- an industrial functional programming language\nand prover -- that allows us to obtain an implementation with formal\nguarantees, including proofs of mathematical results underlying the algorithm,\nsuch as the use of the Farkas lemma.", "paper_summary_zh": "深度神经网络 (DNN) 验证的最新进展为在许多应用领域（包括安全关键领域）更广泛地使用 DNN 验证技术开辟了道路。DNN 验证器本身就是复杂的程序，已被证明容易出现错误和不精确；这反过来又引发了对 DNN 验证器的信任问题。解决此问题的突出尝试之一是增强 DNN 验证器生成其结果证明的能力，这些证明受独立算法认证（证明检查）。证明生成和证明检查的公式已经存在于最先进的 Marabou DNN 验证器之上。Marabou 的证明检查算法的本机实现是用 C++ 完成的，它本身引发了对代码信任的问题（例如，在浮点计算的精度或实现健全性的保证中）。在此，我们提出了 Marabou 证明检查算法在 Imandra 中的替代实现——一种工业函数式编程语言和证明器——它允许我们获得具有正式保证的实现，包括算法底层数学结果的证明，例如 Farkas 引理的使用。", "author": "Remi Desmartin et.al.", "authors": "Remi Desmartin, Omri Isac, Ekaterina Komendantskaya, Kathrin Stark, Grant Passmore, Guy Katz", "id": "2405.10611v1", "paper_url": "http://arxiv.org/abs/2405.10611v1", "repo": "null"}}