{"2405.14606": {"publish_time": "2024-05-23", "title": "Logical Characterizations of Recurrent Graph Neural Networks with Reals and Floats", "paper_summary": "In pioneering work from 2019, Barcel\\'o and coauthors identified logics that\nprecisely match the expressive power of constant iteration-depth graph neural\nnetworks (GNNs) relative to properties definable in first-order logic. In this\narticle, we give exact logical characterizations of recurrent GNNs in two\nscenarios: (1) in the setting with floating-point numbers and (2) with reals.\nFor floats, the formalism matching recurrent GNNs is a rule-based modal logic\nwith counting, while for reals we use a suitable infinitary modal logic, also\nwith counting. These results give exact matches between logics and GNNs in the\nrecurrent setting without relativising to a background logic in either case,\nbut using some natural assumptions about floating-point arithmetic. Applying\nour characterizations, we also prove that, relative to graph properties\ndefinable in monadic second-order logic (MSO), our infinitary and rule-based\nlogics are equally expressive. This implies that recurrent GNNs with reals and\nfloats have the same expressive power over MSO-definable properties and shows\nthat, for such properties, also recurrent GNNs with reals are characterized by\na (finitary!) rule-based modal logic. In the general case, in contrast, the\nexpressive power with floats is weaker than with reals. In addition to\nlogic-oriented results, we also characterize recurrent GNNs, with both reals\nand floats, via distributed automata, drawing links to distributed computing\nmodels.", "paper_summary_zh": "在 2019 年的开创性工作中，Barcel\\'o 和合著者识别出逻辑，其精确匹配恒定迭代深度图神经网络 (GNN) 的表达能力，相对于一阶逻辑中可定义的属性。在本文中，我们对两种情况下的循环 GNN 给出了精确的逻辑表征：(1) 在浮点数设置中和 (2) 在实数中。对于浮点数，与循环 GNN 匹配的形式主义是一种基于规则的模态逻辑，带有计数，而对于实数，我们使用一种合适的无限模态逻辑，也带有计数。这些结果在循环设置中给出了逻辑和 GNN 之间的精确匹配，在任何情况下都不相对于背景逻辑，但使用了一些关于浮点运算的自然假设。应用我们的表征，我们还证明，相对于单子二阶逻辑 (MSO) 中可定义的图属性，我们的无限和基于规则的逻辑具有同等的表达能力。这意味着具有实数和浮点数的循环 GNN 对于 MSO 可定义的属性具有相同的表达能力，并表明，对于此类属性，具有实数的循环 GNN 也由（有限！）基于规则的模态逻辑表征。相反，在一般情况下，使用浮点数的表达能力弱于使用实数的表达能力。除了面向逻辑的结果外，我们还通过分布式自动机表征具有实数和浮点数的循环 GNN，从而建立与分布式计算模型的联系。", "author": "Veeti Ahvonen et.al.", "authors": "Veeti Ahvonen, Damian Heiman, Antti Kuusisto, Carsten Lutz", "id": "2405.14606v1", "paper_url": "http://arxiv.org/abs/2405.14606v1", "repo": "null"}}