{"2411.15396": {"publish_time": "2024-11-23", "title": "The Decoy Dilemma in Online Medical Information Evaluation: A Comparative Study of Credibility Assessments by LLM and Human Judges", "paper_summary": "Can AI be cognitively biased in automated information judgment tasks? Despite\nrecent progresses in measuring and mitigating social and algorithmic biases in\nAI and large language models (LLMs), it is not clear to what extent LLMs behave\n\"rationally\", or if they are also vulnerable to human cognitive bias triggers.\nTo address this open problem, our study, consisting of a crowdsourcing user\nexperiment and a LLM-enabled simulation experiment, compared the credibility\nassessments by LLM and human judges under potential decoy effects in an\ninformation retrieval (IR) setting, and empirically examined the extent to\nwhich LLMs are cognitively biased in COVID-19 medical (mis)information\nassessment tasks compared to traditional human assessors as a baseline. The\nresults, collected from a between-subject user experiment and a LLM-enabled\nreplicate experiment, demonstrate that 1) Larger and more recent LLMs tend to\nshow a higher level of consistency and accuracy in distinguishing credible\ninformation from misinformation. However, they are more likely to give higher\nratings for misinformation due to the presence of a more salient, decoy\nmisinformation result; 2) While decoy effect occurred in both human and LLM\nassessments, the effect is more prevalent across different conditions and\ntopics in LLM judgments compared to human credibility ratings. In contrast to\nthe generally assumed \"rationality\" of AI tools, our study empirically confirms\nthe cognitive bias risks embedded in LLM agents, evaluates the decoy impact on\nLLMs against human credibility assessments, and thereby highlights the\ncomplexity and importance of debiasing AI agents and developing\npsychology-informed AI audit techniques and policies for automated judgment\ntasks and beyond.", "paper_summary_zh": "大型語言模型 (LLM) 是否會在自動化資訊判斷任務中產生認知偏差？儘管最近在衡量和減輕 AI 和大型語言模型 (LLM) 中的社會和演算法偏差方面取得了進展，但尚不清楚 LLM 在何種程度上表現出「理性」，或者它們是否也容易受到人類認知偏差觸發因素的影響。為了解決這個開放性問題，我們的研究包含群眾外包使用者實驗和 LLM 啟用的模擬實驗，比較了 LLM 和人類評審員在資訊檢索 (IR) 設定中的潛在誘餌效應下的可信度評估，並實證檢驗了 LLM 在 COVID-19 醫療 (錯誤) 資訊評估任務中與傳統人類評估員相比在認知偏差的程度。從受試者之間的使用者實驗和 LLM 啟用的複製實驗中收集的結果顯示，1) 較大且較新的 LLM 往往在區分可信資訊和錯誤資訊時表現出較高程度的一致性和準確性。然而，由於存在更顯著的誘餌錯誤資訊結果，它們更有可能對錯誤資訊給予較高的評分；2) 雖然誘餌效應發生在人類和 LLM 評估中，但與人類可信度評分相比，該效應在 LLM 判斷的不同條件和主題中更為普遍。與一般假設的 AI 工具「理性」相反，我們的研究實證證實了 LLM 代理中嵌入的認知偏差風險，評估了誘餌對 LLM 的影響，並根據人類可信度評估，從而突顯了消除 AI 代理偏差和開發心理學資訊 AI 稽核技術和政策的複雜性和重要性，以用於自動化判斷任務及其他任務。", "author": "Jiqun Liu et.al.", "authors": "Jiqun Liu, Jiangen He", "id": "2411.15396v1", "paper_url": "http://arxiv.org/abs/2411.15396v1", "repo": "null"}}