{"2501.10048": {"publish_time": "2025-01-17", "title": "Virtual Nodes Improve Long-term Traffic Prediction", "paper_summary": "Effective traffic prediction is a cornerstone of intelligent transportation\nsystems, enabling precise forecasts of traffic flow, speed, and congestion.\nWhile traditional spatio-temporal graph neural networks (ST-GNNs) have achieved\nnotable success in short-term traffic forecasting, their performance in\nlong-term predictions remains limited. This challenge arises from\nover-squashing problem, where bottlenecks and limited receptive fields restrict\ninformation flow and hinder the modeling of global dependencies. To address\nthese challenges, this study introduces a novel framework that incorporates\nvirtual nodes, which are additional nodes added to the graph and connected to\nexisting nodes, in order to aggregate information across the entire graph\nwithin a single GNN layer. Our proposed model incorporates virtual nodes by\nconstructing a semi-adaptive adjacency matrix. This matrix integrates\ndistance-based and adaptive adjacency matrices, allowing the model to leverage\ngeographical information while also learning task-specific features from data.\nExperimental results demonstrate that the inclusion of virtual nodes\nsignificantly enhances long-term prediction accuracy while also improving\nlayer-wise sensitivity to mitigate the over-squashing problem. Virtual nodes\nalso offer enhanced explainability by focusing on key intersections and\nhigh-traffic areas, as shown by the visualization of their adjacency matrix\nweights on road network heat maps. Our advanced approach enhances the\nunderstanding and management of urban traffic systems, making it particularly\nwell-suited for real-world applications.", "paper_summary_zh": "有效的交通預測是智慧運輸系統的基石，能精準預測交通流量、速度和擁堵狀況。雖然傳統時空圖形神經網路 (ST-GNN) 在短期交通預測中取得顯著成功，但其在長期預測中的表現仍有待加強。這個挑戰來自過度壓縮問題，其中瓶頸和有限的感受野會限制資訊流動，並阻礙對全局依賴性的建模。為了應對這些挑戰，本研究引入了一個創新的架構，其中包含虛擬節點，這些節點是新增到圖形中並連接到現有節點，以便在單個 GNN 層中彙總整個圖形中的資訊。我們提出的模型透過建構半自適應鄰接矩陣來納入虛擬節點。此矩陣整合了基於距離和自適應的鄰接矩陣，讓模型能夠利用地理資訊，同時也能從資料中學習特定於任務的特性。實驗結果表明，虛擬節點的加入顯著提升了長期預測的準確度，同時也改善了層級敏感度，以減輕過度壓縮問題。虛擬節點還透過關注關鍵路口和高流量區域，提供了增強的可解釋性，如其鄰接矩陣權重在道路網路熱圖上的視覺化所示。我們進階的方法增強了對都市交通系統的理解和管理，使其特別適合於真實世界的應用。", "author": "Xiaoyang Cao et.al.", "authors": "Xiaoyang Cao, Dingyi Zhuang, Jinhua Zhao, Shenhao Wang", "id": "2501.10048v1", "paper_url": "http://arxiv.org/abs/2501.10048v1", "repo": "null"}}