{"2406.14862": {"publish_time": "2024-06-21", "title": "LatentExplainer: Explaining Latent Representations in Deep Generative Models with Multi-modal Foundation Models", "paper_summary": "Deep generative models like VAEs and diffusion models have advanced various\ngeneration tasks by leveraging latent variables to learn data distributions and\ngenerate high-quality samples. Despite the field of explainable AI making\nstrides in interpreting machine learning models, understanding latent variables\nin generative models remains challenging. This paper introduces\nLatentExplainer, a framework for automatically generating semantically\nmeaningful explanations of latent variables in deep generative models.\nLatentExplainer tackles three main challenges: inferring the meaning of latent\nvariables, aligning explanations with inductive biases, and handling varying\ndegrees of explainability. By perturbing latent variables and interpreting\nchanges in generated data, the framework provides a systematic approach to\nunderstanding and controlling the data generation process, enhancing the\ntransparency and interpretability of deep generative models. We evaluate our\nproposed method on several real-world and synthetic datasets, and the results\ndemonstrate superior performance in generating high-quality explanations of\nlatent variables.", "paper_summary_zh": "深度生成模型（如 VAE 和扩散模型）通过利用潜在变量学习数据分布并生成高质量样本，促进了各种生成任务的发展。尽管可解释 AI 领域在解释机器学习模型方面取得了进展，但理解生成模型中的潜在变量仍然具有挑战性。本文介绍了 LatentExplainer，这是一个用于自动生成深度生成模型中潜在变量的语义有意义解释的框架。LatentExplainer 解决了三个主要挑战：推断潜在变量的含义、使解释与归纳偏差保持一致，以及处理不同程度的可解释性。通过扰动潜在变量并解释生成数据中的变化，该框架提供了一种理解和控制数据生成过程的系统方法，从而增强了深度生成模型的透明度和可解释性。我们在几个真实世界和合成数据集上评估了我们提出的方法，结果表明在生成潜在变量的高质量解释方面具有卓越的性能。", "author": "Mengdan Zhu et.al.", "authors": "Mengdan Zhu, Raasikh Kanjiani, Jiahui Lu, Andrew Choi, Qirui Ye, Liang Zhao", "id": "2406.14862v1", "paper_url": "http://arxiv.org/abs/2406.14862v1", "repo": "null"}}