{"2412.14510": {"publish_time": "2024-12-19", "title": "PA-RAG: RAG Alignment via Multi-Perspective Preference Optimization", "paper_summary": "The emergence of Retrieval-augmented generation (RAG) has alleviated the\nissues of outdated and hallucinatory content in the generation of large\nlanguage models (LLMs), yet it still reveals numerous limitations. When a\ngeneral-purpose LLM serves as the RAG generator, it often suffers from\ninadequate response informativeness, response robustness, and citation quality.\nPast approaches to tackle these limitations, either by incorporating additional\nsteps beyond generating responses or optimizing the generator through\nsupervised fine-tuning (SFT), still failed to align with the RAG requirement\nthoroughly. Consequently, optimizing the RAG generator from multiple preference\nperspectives while maintaining its end-to-end LLM form remains a challenge. To\nbridge this gap, we propose Multiple Perspective Preference Alignment for\nRetrieval-Augmented Generation (PA-RAG), a method for optimizing the generator\nof RAG systems to align with RAG requirements comprehensively. Specifically, we\nconstruct high-quality instruction fine-tuning data and multi-perspective\npreference data by sampling varied quality responses from the generator across\ndifferent prompt documents quality scenarios. Subsequently, we optimize the\ngenerator using SFT and Direct Preference Optimization (DPO). Extensive\nexperiments conducted on four question-answer datasets across three LLMs\ndemonstrate that PA-RAG can significantly enhance the performance of RAG\ngenerators. Our code and datasets are available at\nhttps://github.com/wujwyi/PA-RAG.", "paper_summary_zh": "檢索增強生成（RAG）的出現緩解了大型語言模型（LLM）中過時和幻覺內容的問題，但它仍然暴露出許多限制。當通用 LLM 作為 RAG 生成器時，它通常會遭受回應資訊不足、回應穩健性和引文品質的問題。過去解決這些限制的方法，無論是透過納入生成回應以外的額外步驟，還是透過監督微調（SFT）最佳化生成器，仍然無法徹底符合 RAG 需求。因此，在維持其端到端 LLM 形式的同時，從多個偏好觀點最佳化 RAG 生成器仍然是一項挑戰。為了彌合這個差距，我們提出了檢索增強生成的「多觀點偏好對齊」（PA-RAG），這是一種最佳化 RAG 系統生成器的方法，以全面符合 RAG 要求。具體來說，我們透過從不同提示文件品質情境中對生成器的各種品質回應進行抽樣，來建構高品質的指令微調資料和多觀點偏好資料。隨後，我們使用 SFT 和直接偏好最佳化（DPO）來最佳化生成器。在三個 LLM 上對四個問答資料集進行的廣泛實驗表明，PA-RAG 可以顯著提升 RAG 生成器的效能。我們的程式碼和資料集可在 https://github.com/wujwyi/PA-RAG 取得。", "author": "Jiayi Wu et.al.", "authors": "Jiayi Wu, Hengyi Cai, Lingyong Yan, Hao Sun, Xiang Li, Shuaiqiang Wang, Dawei Yin, Ming Gao", "id": "2412.14510v1", "paper_url": "http://arxiv.org/abs/2412.14510v1", "repo": "https://github.com/wujwyi/pa-rag"}}