{"2412.04922": {"publish_time": "2024-12-06", "title": "Large Language Models for Ingredient Substitution in Food Recipes using Supervised Fine-tuning and Direct Preference Optimization", "paper_summary": "In this paper, we address the challenge of recipe personalization through\ningredient substitution. We make use of Large Language Models (LLMs) to build\nan ingredient substitution system designed to predict plausible substitute\ningredients within a given recipe context. Given that the use of LLMs for this\ntask has been barely done, we carry out an extensive set of experiments to\ndetermine the best LLM, prompt, and the fine-tuning setups. We further\nexperiment with methods such as multi-task learning, two-stage fine-tuning, and\nDirect Preference Optimization (DPO). The experiments are conducted using the\npublicly available Recipe1MSub corpus. The best results are produced by the\nMistral7-Base LLM after fine-tuning and DPO. This result outperforms the strong\nbaseline available for the same corpus with a Hit@1 score of 22.04. Thus we\nbelieve that this research represents a significant step towards enabling\npersonalized and creative culinary experiences by utilizing LLM-based\ningredient substitution.", "paper_summary_zh": "在本文中，我们透過食材替換來解決食譜個人化的挑戰。我們使用大型語言模型 (LLM) 來建構食材替換系統，旨在預測在給定食譜背景下合理的替代食材。由於鮮少將 LLM 用於此任務，因此我們進行了一系列廣泛的實驗，以找出最佳的 LLM、提示和微調設定。我們進一步嘗試多任務學習、兩階段微調和直接偏好最佳化 (DPO) 等方法。這些實驗是使用公開的 Recipe1MSub 語料庫進行的。微調和 DPO 後，Mistral7-Base LLM 產生了最佳結果。此結果優於針對相同語料庫提供的強大基準，其 Hit@1 分數為 22.04。因此，我們相信這項研究代表著利用基於 LLM 的食材替換，朝著實現個人化且富有創意的料理體驗邁出了一大步。", "author": "Thevin Senath et.al.", "authors": "Thevin Senath, Kumuthu Athukorala, Ransika Costa, Surangika Ranathunga, Rishemjit Kaur", "id": "2412.04922v1", "paper_url": "http://arxiv.org/abs/2412.04922v1", "repo": "null"}}