{"2502.03699": {"publish_time": "2025-02-06", "title": "LLM Alignment as Retriever Optimization: An Information Retrieval Perspective", "paper_summary": "Large Language Models (LLMs) have revolutionized artificial intelligence with\ncapabilities in reasoning, coding, and communication, driving innovation across\nindustries. Their true potential depends on effective alignment to ensure\ncorrect, trustworthy and ethical behavior, addressing challenges like\nmisinformation, hallucinations, bias and misuse. While existing Reinforcement\nLearning (RL)-based alignment methods are notoriously complex, direct\noptimization approaches offer a simpler alternative. In this work, we introduce\na novel direct optimization approach for LLM alignment by drawing on\nestablished Information Retrieval (IR) principles. We present a systematic\nframework that bridges LLM alignment and IR methodologies, mapping LLM\ngeneration and reward models to IR's retriever-reranker paradigm. Building on\nthis foundation, we propose LLM Alignment as Retriever Preference Optimization\n(LarPO), a new alignment method that enhances overall alignment quality.\nExtensive experiments validate LarPO's effectiveness with 38.9 % and 13.7 %\naveraged improvement on AlpacaEval2 and MixEval-Hard respectively. Our work\nopens new avenues for advancing LLM alignment by integrating IR foundations,\noffering a promising direction for future research.", "paper_summary_zh": "大型語言模型 (LLM) 透過在推理、編碼和溝通方面的能力，徹底革新了人工智慧，並推動各產業的創新。其真正的潛力取決於有效對齊，以確保正確、值得信賴且符合道德的行為，並解決錯誤資訊、幻覺、偏見和誤用等挑戰。雖然現有的基於強化學習 (RL) 的對齊方法出了名的複雜，但直接最佳化方法提供了一個更簡單的替代方案。在這項工作中，我們透過採用既定的資訊檢索 (IR) 原則，介紹了一種新的 LLM 對齊直接最佳化方法。我們提出了一個系統化的架構，將 LLM 對齊和 IR 方法論聯繫起來，將 LLM 生成和獎勵模型對應到 IR 的檢索器重新排序範例。在此基礎上，我們提出 LLM 對齊作為檢索器偏好最佳化 (LarPO)，這是一種新的對齊方法，可增強整體對齊品質。大量的實驗驗證了 LarPO 的有效性，在 AlpacaEval2 和 MixEval-Hard 分別平均改善了 38.9% 和 13.7%。我們的研究透過整合 IR 基礎，為推進 LLM 對齊開闢了新的途徑，並為未來的研究提供了有希望的方向。", "author": "Bowen Jin et.al.", "authors": "Bowen Jin, Jinsung Yoon, Zhen Qin, Ziqi Wang, Wei Xiong, Yu Meng, Jiawei Han, Sercan O. Arik", "id": "2502.03699v1", "paper_url": "http://arxiv.org/abs/2502.03699v1", "repo": "null"}}