{"2412.19496": {"publish_time": "2024-12-27", "title": "Multi-P$^2$A: A Multi-perspective Benchmark on Privacy Assessment for Large Vision-Language Models", "paper_summary": "Large Vision-Language Models (LVLMs) exhibit impressive potential across\nvarious tasks but also face significant privacy risks, limiting their practical\napplications. Current researches on privacy assessment for LVLMs is limited in\nscope, with gaps in both assessment dimensions and privacy categories. To\nbridge this gap, we propose Multi-P$^2$A, a comprehensive benchmark for\nevaluating the privacy preservation capabilities of LVLMs in terms of privacy\nawareness and leakage. Privacy awareness measures the model's ability to\nrecognize the privacy sensitivity of input data, while privacy leakage assesses\nthe risk of the model unintentionally disclosing privacy information in its\noutput. We design a range of sub-tasks to thoroughly evaluate the model's\nprivacy protection offered by LVLMs. Multi-P$^2$A covers 26 categories of\npersonal privacy, 15 categories of trade secrets, and 18 categories of state\nsecrets, totaling 31,962 samples. Based on Multi-P$^2$A, we evaluate the\nprivacy preservation capabilities of 21 open-source and 2 closed-source LVLMs.\nOur results reveal that current LVLMs generally pose a high risk of\nfacilitating privacy breaches, with vulnerabilities varying across personal\nprivacy, trade secret, and state secret.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 在各種任務中展現出令人印象深刻的潛力，但也面臨嚴重的隱私風險，限制了它們的實際應用。目前對 LVLMs 的隱私評估研究範圍有限，在評估維度和隱私類別方面都存在差距。為了彌補這一差距，我們提出了 Multi-P$^2$A，這是一個全面的基準，用於評估 LVLMs 在隱私意識和洩露方面的隱私保護能力。隱私意識衡量模型識別輸入數據隱私敏感性的能力，而隱私洩露則評估模型在其輸出中意外洩露隱私信息的風險。我們設計了一系列子任務來徹底評估 LVLMs 提供的隱私保護。Multi-P$^2$A 涵蓋 26 類個人隱私、15 類商業機密和 18 類國家機密，總計 31,962 個樣本。基於 Multi-P$^2$A，我們評估了 21 個開源和 2 個閉源 LVLMs 的隱私保護能力。我們的結果表明，當前 LVLMs 通常會帶來促進隱私洩露的高風險，其漏洞因個人隱私、商業機密和國家機密而異。", "author": "Jie Zhang et.al.", "authors": "Jie Zhang, Xiangkui Cao, Zhouyu Han, Shiguang Shan, Xilin Chen", "id": "2412.19496v1", "paper_url": "http://arxiv.org/abs/2412.19496v1", "repo": "null"}}