{"2406.14496": {"publish_time": "2024-06-20", "title": "African or European Swallow? Benchmarking Large Vision-Language Models for Fine-Grained Object Classification", "paper_summary": "Recent Large Vision-Language Models (LVLMs) demonstrate impressive abilities\non numerous image understanding and reasoning tasks. The task of fine-grained\nobject classification (e.g., distinction between \\textit{animal species}),\nhowever, has been probed insufficiently, despite its downstream importance. We\nfill this evaluation gap by creating \\texttt{FOCI} (\\textbf{F}ine-grained\n\\textbf{O}bject \\textbf{C}lass\\textbf{I}fication), a difficult multiple-choice\nbenchmark for fine-grained object classification, from existing object\nclassification datasets: (1) multiple-choice avoids ambiguous answers\nassociated with casting classification as open-ended QA task; (2) we retain\nclassification difficulty by mining negative labels with a CLIP model.\n\\texttt{FOCI}\\xspace complements five popular classification datasets with four\ndomain-specific subsets from ImageNet-21k. We benchmark 12 public LVLMs on\n\\texttt{FOCI} and show that it tests for a \\textit{complementary skill} to\nestablished image understanding and reasoning benchmarks. Crucially, CLIP\nmodels exhibit dramatically better performance than LVLMs. Since the image\nencoders of LVLMs come from these CLIP models, this points to inadequate\nalignment for fine-grained object distinction between the encoder and the LLM\nand warrants (pre)training data with more fine-grained annotation. We release\nour code at \\url{https://github.com/gregor-ge/FOCI-Benchmark}.", "paper_summary_zh": "<paragraph>最近的大型视觉语言模型 (LVLMs) 在许多图像理解和推理任务上表现出惊人的能力。然而，细粒度对象分类（例如，区分“动物种类”）的任务，尽管其下游重要性，但尚未得到充分探究。我们通过创建 \\texttt{FOCI}（\\textbf{F}ine-grained \\textbf{O}bject \\textbf{C}lass\\textbf{I}fication），一个困难的多项选择基准，用于从现有对象分类数据集进行细粒度对象分类，来填补这一评估空白：（1）多项选择避免了将分类表述为开放式问答任务所带来的模棱两可的答案；（2）我们通过使用 CLIP 模型挖掘负标签来保留分类难度。\\texttt{FOCI}\\xspace 用 ImageNet-21k 中的四个特定领域的子集补充了五个流行的分类数据集。我们在 \\texttt{FOCI} 上对 12 个公共 LVLMs 进行了基准测试，并表明它测试了一项“补充技能”，以建立图像理解和推理基准。至关重要的是，CLIP 模型表现出比 LVLMs 显著更好的性能。由于 LVLMs 的图像编码器来自这些 CLIP 模型，这表明编码器和 LLM 之间在细粒度对象区分方面存在不充分的对齐，并保证使用更细粒度的注释进行（预）训练数据。我们在 \\url{https://github.com/gregor-ge/FOCI-Benchmark} 上发布了我们的代码。</paragraph>", "author": "Gregor Geigle et.al.", "authors": "Gregor Geigle, Radu Timofte, Goran Glavaš", "id": "2406.14496v1", "paper_url": "http://arxiv.org/abs/2406.14496v1", "repo": "null"}}