{"2501.05398": {"publish_time": "2025-01-09", "title": "Mechanistic understanding and validation of large AI models with SemanticLens", "paper_summary": "Unlike human-engineered systems such as aeroplanes, where each component's\nrole and dependencies are well understood, the inner workings of AI models\nremain largely opaque, hindering verifiability and undermining trust. This\npaper introduces SemanticLens, a universal explanation method for neural\nnetworks that maps hidden knowledge encoded by components (e.g., individual\nneurons) into the semantically structured, multimodal space of a foundation\nmodel such as CLIP. In this space, unique operations become possible, including\n(i) textual search to identify neurons encoding specific concepts, (ii)\nsystematic analysis and comparison of model representations, (iii) automated\nlabelling of neurons and explanation of their functional roles, and (iv) audits\nto validate decision-making against requirements. Fully scalable and operating\nwithout human input, SemanticLens is shown to be effective for debugging and\nvalidation, summarizing model knowledge, aligning reasoning with expectations\n(e.g., adherence to the ABCDE-rule in melanoma classification), and detecting\ncomponents tied to spurious correlations and their associated training data. By\nenabling component-level understanding and validation, the proposed approach\nhelps bridge the \"trust gap\" between AI models and traditional engineered\nsystems. We provide code for SemanticLens on\nhttps://github.com/jim-berend/semanticlens and a demo on\nhttps://semanticlens.hhi-research-insights.eu.", "paper_summary_zh": "與飛機等由人類設計的系統不同，飛機每個組件的角色和依賴性都清楚明瞭，而 AI 模型的內部運作在很大程度上仍不透明，這阻礙了可驗證性並破壞了信任。本文介紹了 SemanticLens，這是一種針對神經網路的通用解釋方法，它將組件（例如個別神經元）編碼的隱藏知識映射到基礎模型（例如 CLIP）的語義結構化多模態空間中。在這個空間中，可以進行獨特的操作，包括 (i) 文字搜尋以識別編碼特定概念的神經元，(ii) 系統分析和比較模型表示，(iii) 自動標記神經元並解釋其功能角色，以及 (iv) 稽核以驗證決策制定是否符合要求。SemanticLens 完全可擴展且在沒有人工輸入的情況下運行，已證明其在除錯和驗證、總結模型知識、將推理與期望保持一致（例如，遵守黑色素瘤分類中的 ABCDE 規則）以及檢測與虛假相關性和其關聯訓練資料相關的組件方面是有效的。通過實現組件級別的理解和驗證，所提出的方法有助於彌合 AI 模型與傳統工程系統之間的「信任差距」。我們在 https://github.com/jim-berend/semanticlens 上提供了 SemanticLens 的程式碼，並在 https://semanticlens.hhi-research-insights.eu 上提供了示範。", "author": "Maximilian Dreyer et.al.", "authors": "Maximilian Dreyer, Jim Berend, Tobias Labarta, Johanna Vielhaben, Thomas Wiegand, Sebastian Lapuschkin, Wojciech Samek", "id": "2501.05398v1", "paper_url": "http://arxiv.org/abs/2501.05398v1", "repo": "null"}}