{"2406.07060": {"publish_time": "2024-06-11", "title": "Reading Miscue Detection in Primary School through Automatic Speech Recognition", "paper_summary": "Automatic reading diagnosis systems can benefit both teachers for more\nefficient scoring of reading exercises and students for accessing reading\nexercises with feedback more easily. However, there are limited studies on\nAutomatic Speech Recognition (ASR) for child speech in languages other than\nEnglish, and limited research on ASR-based reading diagnosis systems. This\nstudy investigates how efficiently state-of-the-art (SOTA) pretrained ASR\nmodels recognize Dutch native children speech and manage to detect reading\nmiscues. We found that Hubert Large finetuned on Dutch speech achieves SOTA\nphoneme-level child speech recognition (PER at 23.1\\%), while Whisper (Faster\nWhisper Large-v2) achieves SOTA word-level performance (WER at 9.8\\%). Our\nfindings suggest that Wav2Vec2 Large and Whisper are the two best ASR models\nfor reading miscue detection. Specifically, Wav2Vec2 Large shows the highest\nrecall at 0.83, whereas Whisper exhibits the highest precision at 0.52 and an\nF1 score of 0.52.", "paper_summary_zh": "自動閱讀診斷系統可讓教師更有效率地評分閱讀練習，並讓學生更容易取得有回饋的閱讀練習。然而，針對英語以外語言的兒童語音進行自動語音辨識 (ASR) 的研究有限，而基於 ASR 的閱讀診斷系統的研究也相當有限。本研究探討最先進 (SOTA) 的預訓練 ASR 模型能多有效地辨識荷蘭母語兒童的語音，並設法偵測閱讀錯誤。我們發現針對荷蘭語音微調的 Hubert Large 可達成最先進的音素層級兒童語音辨識 (PER 為 23.1%)，而 Whisper (Faster Whisper Large-v2) 則可達成最先進的詞彙層級表現 (WER 為 9.8%)。我們的研究結果顯示，Wav2Vec2 Large 和 Whisper 是用於偵測閱讀錯誤的兩大最佳 ASR 模型。具體來說，Wav2Vec2 Large 展現最高的召回率 0.83，而 Whisper 則展現最高的精確率 0.52 和 F1 分數 0.52。", "author": "Lingyun Gao et.al.", "authors": "Lingyun Gao, Cristian Tejedor-Garcia, Helmer Strik, Catia Cucchiarini", "id": "2406.07060v1", "paper_url": "http://arxiv.org/abs/2406.07060v1", "repo": "null"}}