{"2410.10818": {"publish_time": "2024-10-14", "title": "TemporalBench: Benchmarking Fine-grained Temporal Understanding for Multimodal Video Models", "paper_summary": "Understanding fine-grained temporal dynamics is crucial for multimodal video\ncomprehension and generation. Due to the lack of fine-grained temporal\nannotations, existing video benchmarks mostly resemble static image benchmarks\nand are incompetent at evaluating models for temporal understanding. In this\npaper, we introduce TemporalBench, a new benchmark dedicated to evaluating\nfine-grained temporal understanding in videos. TemporalBench consists of ~10K\nvideo question-answer pairs, derived from ~2K high-quality human annotations\ndetailing the temporal dynamics in video clips. As a result, our benchmark\nprovides a unique testbed for evaluating various temporal understanding and\nreasoning abilities such as action frequency, motion magnitude, event order,\netc. Moreover, it enables evaluations on various tasks like both video question\nanswering and captioning, both short and long video understanding, as well as\ndifferent models such as multimodal video embedding models and text generation\nmodels. Results show that state-of-the-art models like GPT-4o achieve only\n38.5% question answering accuracy on TemporalBench, demonstrating a significant\ngap (~30%) between humans and AI in temporal understanding. Furthermore, we\nnotice a critical pitfall for multi-choice QA where LLMs can detect the subtle\nchanges in negative captions and find a centralized description as a cue for\nits prediction, where we propose Multiple Binary Accuracy (MBA) to correct such\nbias. We hope that TemporalBench can foster research on improving models'\ntemporal reasoning capabilities. Both dataset and evaluation code will be made\navailable.", "paper_summary_zh": "<paragraph>了解精細的時間動態對於多模態影片理解和生成至關重要。由於缺乏精細的時間註解，現有的影片基準測試大多類似於靜態影像基準測試，並且無法評估時間理解模型。在本文中，我們介紹了 TemporalBench，這是一個新的基準測試，專門用於評估影片中的精細時間理解。TemporalBench 包含約 10K 個影片問答對，這些對來自約 2K 個人類高品質註解，詳細說明了影片剪輯中的時間動態。因此，我們的基準測試提供了一個獨特的測試平台，用於評估各種時間理解和推理能力，例如動作頻率、動作幅度、事件順序等。此外，它支援各種任務的評估，例如影片問答和字幕、短影片和長影片理解，以及各種模型，例如多模態影片嵌入模型和文字生成模型。結果顯示，像 GPT-4o 這樣的最先進模型在 TemporalBench 上僅達到 38.5% 的問答準確率，這表明人類和 AI 在時間理解上存在顯著差距（約 30%）。此外，我們注意到多選題 QA 的一個關鍵缺陷，其中 LLM 可以檢測到負面字幕中的細微變化，並找到一個集中描述作為其預測的線索，我們提出了多重二進制準確率 (MBA) 來糾正這種偏差。我們希望 TemporalBench 能夠促進改善模型時間推理能力的研究。資料集和評估程式碼都將公開。</paragraph>", "author": "Mu Cai et.al.", "authors": "Mu Cai, Reuben Tan, Jianrui Zhang, Bocheng Zou, Kai Zhang, Feng Yao, Fangrui Zhu, Jing Gu, Yiwu Zhong, Yuzhang Shang, Yao Dou, Jaden Park, Jianfeng Gao, Yong Jae Lee, Jianwei Yang", "id": "2410.10818v1", "paper_url": "http://arxiv.org/abs/2410.10818v1", "repo": "null"}}