{"2408.13253": {"publish_time": "2024-08-23", "title": "Domain-specific long text classification from sparse relevant information", "paper_summary": "Large Language Models have undoubtedly revolutionized the Natural Language\nProcessing field, the current trend being to promote one-model-for-all tasks\n(sentiment analysis, translation, etc.). However, the statistical mechanisms at\nwork in the larger language models struggle to exploit the relevant information\nwhen it is very sparse, when it is a weak signal. This is the case, for\nexample, for the classification of long domain-specific documents, when the\nrelevance relies on a single relevant word or on very few relevant words from\ntechnical jargon. In the medical domain, it is essential to determine whether a\ngiven report contains critical information about a patient's condition. This\ncritical information is often based on one or few specific isolated terms. In\nthis paper, we propose a hierarchical model which exploits a short list of\npotential target terms to retrieve candidate sentences and represent them into\nthe contextualized embedding of the target term(s) they contain. A pooling of\nthe term(s) embedding(s) entails the document representation to be classified.\nWe evaluate our model on one public medical document benchmark in English and\non one private French medical dataset. We show that our narrower hierarchical\nmodel is better than larger language models for retrieving relevant long\ndocuments in a domain-specific context.", "paper_summary_zh": "大型語言模型無疑徹底改變了自然語言處理領域，目前的趨勢是推廣一種適用於所有任務的模型（情緒分析、翻譯等）。然而，大型語言模型中運作的統計機制難以利用相關資訊，當資訊非常稀疏時，當它是一個微弱訊號時。例如，在長領域特定文件分類的情況下，當相關性依賴於單一相關字詞或技術術語中極少數的相關字詞時，就是這種情況。在醫療領域，確定特定報告是否包含有關患者病情的關鍵資訊至關重要。這些關鍵資訊通常基於一個或幾個特定的孤立術語。在本文中，我們提出了一個分層模型，它利用潛在目標術語的簡短清單來擷取候選句子，並將它們表示為它們所包含的目標術語的語境化嵌入。術語嵌入的匯集需要對要分類的文件表示進行分類。我們在一個公開的英文醫療文件基準和一個私人的法文醫療資料集上評估我們的模型。我們證明，我們較狹窄的分層模型比大型語言模型更適合在特定領域的語境中擷取相關的長文件。", "author": "Célia D'Cruz et.al.", "authors": "Célia D'Cruz, Jean-Marc Bereder, Frédéric Precioso, Michel Riveill", "id": "2408.13253v1", "paper_url": "http://arxiv.org/abs/2408.13253v1", "repo": "null"}}