{"2411.07140": {"publish_time": "2024-11-11", "title": "Chinese SimpleQA: A Chinese Factuality Evaluation for Large Language Models", "paper_summary": "New LLM evaluation benchmarks are important to align with the rapid\ndevelopment of Large Language Models (LLMs). In this work, we present Chinese\nSimpleQA, the first comprehensive Chinese benchmark to evaluate the factuality\nability of language models to answer short questions, and Chinese SimpleQA\nmainly has five properties (i.e., Chinese, Diverse, High-quality, Static,\nEasy-to-evaluate). Specifically, first, we focus on the Chinese language over 6\nmajor topics with 99 diverse subtopics. Second, we conduct a comprehensive\nquality control process to achieve high-quality questions and answers, where\nthe reference answers are static and cannot be changed over time. Third,\nfollowing SimpleQA, the questions and answers are very short, and the grading\nprocess is easy-to-evaluate based on OpenAI API. Based on Chinese SimpleQA, we\nperform a comprehensive evaluation on the factuality abilities of existing\nLLMs. Finally, we hope that Chinese SimpleQA could guide the developers to\nbetter understand the Chinese factuality abilities of their models and\nfacilitate the growth of foundation models.", "paper_summary_zh": "新的 LLM 評估基準對於與大型語言模型 (LLM) 的快速發展保持一致非常重要。在這項工作中，我們提出中文 SimpleQA，這是第一個全面的中文基準，用於評估語言模型回答簡短問題的事實能力，而中文 SimpleQA 主要有五個特性（即中文、多元化、高品質、靜態、易於評估）。具體來說，首先，我們專注於 6 個主要主題的中文，以及 99 個不同的子主題。其次，我們進行全面的品質控管流程，以獲得高品質的問題和答案，其中參考答案是靜態的，並且不會隨著時間而改變。第三，遵循 SimpleQA，問題和答案非常簡短，評分過程基於 OpenAI API，易於評估。根據中文 SimpleQA，我們對現有 LLM 的事實能力進行全面評估。最後，我們希望中文 SimpleQA 可以引導開發人員更好地了解其模型的中文事實能力，並促進基礎模型的發展。", "author": "Yancheng He et.al.", "authors": "Yancheng He, Shilong Li, Jiaheng Liu, Yingshui Tan, Hui Huang, Weixun Wang, Xingyuan Bu, Hangyu Guo, Chengwei Hu, Boren Zheng, Xuepeng Liu, Dekai Sun, Wenbo Su, Bo Zheng", "id": "2411.07140v1", "paper_url": "http://arxiv.org/abs/2411.07140v1", "repo": "null"}}