{"2410.23069": {"publish_time": "2024-10-30", "title": "LLMs Integration in Software Engineering Team Projects: Roles, Impact, and a Pedagogical Design Space for AI Tools in Computing Education", "paper_summary": "This work takes a pedagogical lens to explore the implications of generative\nAI (GenAI) models and tools, such as ChatGPT and GitHub Copilot, in a\nsemester-long 2nd-year undergraduate Software Engineering Team Project.\nQualitative findings from survey (39 students) and interviews (eight students)\nprovide insights into the students' views on the impact of GenAI use on their\ncoding experience, learning, and self-efficacy. Our results address a\nparticular gap in understanding the role and implications of GenAI on teamwork,\nteam-efficacy, and team dynamics. The analysis of the learning aspects is\ndistinguished by the application of learning and pedagogy informed lenses to\ndiscuss the data. We propose a preliminary design space for GenAI-based\nprogramming learning tools highlighting the importance of considering the roles\nthat GenAI can play during the learning process, the varying support-ability\npatterns that can be applied to each role, and the importance of supporting\ntransparency in GenAI for team members and students in addition to educators.", "paper_summary_zh": "本研究以教學觀點探討生成式 AI (GenAI) 模型和工具（例如 ChatGPT 和 GitHub Copilot）在為期一學期的二年級大學部軟體工程團隊專題中的影響。\n來自問卷調查（39 位學生）和訪談（8 位學生）的定性發現，提供了學生對 GenAI 使用對其程式編寫經驗、學習和自我效能影響的見解。我們的結果探討了在理解 GenAI 在團隊合作、團隊效能和團隊動力中的角色和影響方面的特定差距。學習面向的分析以應用學習和教學法觀點來探討資料為特色。我們提出了一個基於 GenAI 的程式設計學習工具的初步設計空間，強調考慮 GenAI 在學習過程中可以扮演的角色、可以應用於每個角色的不同支援能力模式，以及除了教育工作者之外，支援團隊成員和學生對 GenAI 的透明度的重要性。", "author": "Ahmed Kharrufa et.al.", "authors": "Ahmed Kharrufa, Sami Alghamdi, Abeer Aziz, Christopher Bull", "id": "2410.23069v1", "paper_url": "http://arxiv.org/abs/2410.23069v1", "repo": "null"}}