{"2406.08940": {"publish_time": "2024-06-13", "title": "Word Order in English-Japanese Simultaneous Interpretation: Analyses and Evaluation using Chunk-wise Monotonic Translation", "paper_summary": "This paper analyzes the features of monotonic translations, which follow the\nword order of the source language, in simultaneous interpreting (SI). The word\norder differences are one of the biggest challenges in SI, especially for\nlanguage pairs with significant structural differences like English and\nJapanese. We analyzed the characteristics of monotonic translations using the\nNAIST English-to-Japanese Chunk-wise Monotonic Translation Evaluation Dataset\nand found some grammatical structures that make monotonic translation difficult\nin English-Japanese SI. We further investigated the features of monotonic\ntranslations through evaluating the output from the existing speech translation\n(ST) and simultaneous speech translation (simulST) models on NAIST\nEnglish-to-Japanese Chunk-wise Monotonic Translation Evaluation Dataset as well\nas on existing test sets. The results suggest that the existing SI-based test\nset underestimates the model performance. We also found that the\nmonotonic-translation-based dataset would better evaluate simulST models, while\nusing an offline-based test set for evaluating simulST models underestimates\nthe model performance.", "paper_summary_zh": "本文分析了在同聲傳譯 (SI) 中遵循源語言詞序的單調翻譯的特徵。詞序差異是 SI 中最大的挑戰之一，特別是對於英語和日語等結構差異顯著的語言對。我們使用 NAIST 英日詞塊單調翻譯評估資料集分析了單調翻譯的特徵，發現了一些讓英語日語 SI 中的單調翻譯變得困難的語法結構。我們進一步透過評估現有語音翻譯 (ST) 和同聲語音翻譯 (simulST) 模型在 NAIST 英日詞塊單調翻譯評估資料集以及現有測試集上的輸出，調查了單調翻譯的特徵。結果表明，現有的基於 SI 的測試集低估了模型效能。我們還發現，基於單調翻譯的資料集可以更好地評估 simulST 模型，而使用基於離線的測試集來評估 simulST 模型會低估模型效能。", "author": "Kosuke Doi et.al.", "authors": "Kosuke Doi, Yuka Ko, Mana Makinae, Katsuhito Sudoh, Satoshi Nakamura", "id": "2406.08940v1", "paper_url": "http://arxiv.org/abs/2406.08940v1", "repo": "null"}}