{"2407.14384": {"publish_time": "2024-07-19", "title": "The Sticky Path to Expressive Querying: Decidability of Navigational Queries under Existential Rules", "paper_summary": "Extensive research in the field of ontology-based query answering has led to\nthe identification of numerous fragments of existential rules (also known as\ntuple-generating dependencies) that exhibit decidable answering of atomic and\nconjunctive queries. Motivated by the increased theoretical and practical\ninterest in navigational queries, this paper considers the question for which\nof these fragments decidability of querying extends to regular path queries\n(RPQs). In fact, decidability of RPQs has recently been shown to generally hold\nfor the comprehensive family of all fragments that come with the guarantee of\nuniversal models being reasonably well-shaped (that is, being of finite\ncliquewidth). Yet, for the second major family of fragments, known as finite\nunification sets (short: fus), which are based on first-order-rewritability,\ncorresponding results have been largely elusive so far. We complete the picture\nby showing that RPQ answering over arbitrary fus rulesets is undecidable. On\nthe positive side, we establish that the problem is decidable for the prominent\nfus subclass of sticky rulesets, with the caveat that a very mild extension of\nthe RPQ formalism turns the problem undecidable again.", "paper_summary_zh": "在基於本体的查詢回答領域的廣泛研究中，已經找出許多存在規則片段（也稱為元組生成依賴性），其展現出原子和聯集查詢的可判定回答。在航行查詢的理論和實務興趣增加的驅使下，本文考量了這些片段中的哪一個查詢判定性可延伸到常規路徑查詢 (RPQ)。事實上，最近已顯示 RPQ 的判定性通常適用於所有片段的綜合系列，這些片段保證通用模型的形狀合理（即為有限的團寬）。然而，對於第二個主要片段系列，稱為有限統一集（簡稱 fus），其基於一階重寫性，到目前為止，對應的結果在很大程度上仍然難以捉摸。我們透過顯示在任意 fus 規則集上回答 RPQ 是不可判定的來完成這幅圖畫。在正面方面，我們建立了這個問題對於顯著的 fus 子類別（黏著規則集）是可以判定的，但有一個警告，即 RPQ 形式主義的非常輕微的延伸會再次使這個問題變得不可判定。", "author": "Piotr Ostropolski-Nalewaja et.al.", "authors": "Piotr Ostropolski-Nalewaja, Sebastian Rudolph", "id": "2407.14384v1", "paper_url": "http://arxiv.org/abs/2407.14384v1", "repo": "null"}}