{"2411.15207": {"publish_time": "2024-11-20", "title": "Uni-Mlip: Unified Self-supervision for Medical Vision Language Pre-training", "paper_summary": "Recent advancements in vision-language pre-training via contrastive learning\nhave significantly improved performance across computer vision tasks. However,\nin the medical domain, obtaining multimodal data is often costly and\nchallenging due to privacy, sensitivity, and annotation complexity. To mitigate\ndata scarcity while boosting model performance, we introduce \\textbf{Uni-Mlip},\na unified self-supervision framework specifically designed to enhance medical\nvision-language pre-training. Uni-Mlip seamlessly integrates cross-modality,\nuni-modality, and fused-modality self-supervision techniques at the data-level\nand the feature-level. Additionally, Uni-Mlip tailors uni-modal image\nself-supervision to accommodate the unique characteristics of medical images.\nOur experiments across datasets of varying scales demonstrate that Uni-Mlip\nsignificantly surpasses current state-of-the-art methods in three key\ndownstream tasks: image-text retrieval, image classification, and visual\nquestion answering (VQA).", "paper_summary_zh": "透過對比學習進行視覺語言預訓練的最新進展，已顯著提升電腦視覺任務的效能。然而，在醫學領域中，取得多模態資料通常成本高昂且具挑戰性，原因在於隱私、敏感性和標註的複雜性。為了在提升模型效能的同時減輕資料稀少的問題，我們引入了 \\textbf{Uni-Mlip}，這是一個統一的自我監督架構，專門設計用於增強醫學視覺語言預訓練。Uni-Mlip 在資料層級和特徵層級無縫整合跨模態、單模態和融合模態的自我監督技術。此外，Uni-Mlip 針對單模態影像自我監督進行調整，以適應醫學影像的獨特特性。我們在不同規模的資料集上進行的實驗證明，Uni-Mlip 在三個關鍵的下游任務中顯著超越目前最先進的方法：影像文字檢索、影像分類和視覺問答 (VQA)。", "author": "Ameera Bawazir et.al.", "authors": "Ameera Bawazir, Kebin Wu, Wenbin Li", "id": "2411.15207v1", "paper_url": "http://arxiv.org/abs/2411.15207v1", "repo": "null"}}