{"2406.15175": {"publish_time": "2024-06-21", "title": "Enhancing Idiomatic Representation in Multiple Languages via an Adaptive Contrastive Triplet Loss", "paper_summary": "Accurately modeling idiomatic or non-compositional language has been a\nlongstanding challenge in Natural Language Processing (NLP). This is partly\nbecause these expressions do not derive their meanings solely from their\nconstituent words, but also due to the scarcity of relevant data resources, and\ntheir impact on the performance of downstream tasks such as machine translation\nand simplification. In this paper we propose an approach to model idiomaticity\neffectively using a triplet loss that incorporates the asymmetric contribution\nof components words to an idiomatic meaning for training language models by\nusing adaptive contrastive learning and resampling miners to build an\nidiomatic-aware learning objective. Our proposed method is evaluated on a\nSemEval challenge and outperforms previous alternatives significantly in many\nmetrics.", "paper_summary_zh": "在自然語言處理 (NLP) 中，準確建模慣用語或非組合語言一直是一個長期的挑戰。這部分是因為這些表達式並非完全從其組成詞彙中提取其含義，也由於相關資料資源的稀少，以及它們對機器翻譯和簡化等下游任務的執行效能所造成的影響。在本文中，我們提出了一個方法，使用三元組損失來有效建模慣用語，該損失將組成詞彙對慣用語含義的不對稱貢獻納入語言模型的訓練中，方法是使用自適應對比學習和重新抽樣礦工來建立一個慣用語感知學習目標。我們在 SemEval 挑戰中評估了我們提出的方法，並且在許多指標中都明顯優於先前的替代方案。", "author": "Wei He et.al.", "authors": "Wei He, Marco Idiart, Carolina Scarton, Aline Villavicencio", "id": "2406.15175v1", "paper_url": "http://arxiv.org/abs/2406.15175v1", "repo": "null"}}