{"2411.04427": {"publish_time": "2024-11-07", "title": "One fish, two fish, but not the whole sea: Alignment reduces language models' conceptual diversity", "paper_summary": "Researchers in social science and psychology have recently proposed using\nlarge language models (LLMs) as replacements for humans in behavioral research.\nIn addition to arguments about whether LLMs accurately capture population-level\npatterns, this has raised questions about whether LLMs capture human-like\nconceptual diversity. Separately, it is debated whether post-training alignment\n(RLHF or RLAIF) affects models' internal diversity. Inspired by human studies,\nwe use a new way of measuring the conceptual diversity of\nsynthetically-generated LLM \"populations\" by relating the internal variability\nof simulated individuals to the population-level variability. We use this\napproach to evaluate non-aligned and aligned LLMs on two domains with rich\nhuman behavioral data. While no model reaches human-like diversity, aligned\nmodels generally display less diversity than their instruction fine-tuned\ncounterparts. Our findings highlight potential trade-offs between increasing\nmodels' value alignment and decreasing the diversity of their conceptual\nrepresentations.", "paper_summary_zh": "社會科學和心理學的研究人員最近提出使用大型語言模型 (LLM) 來取代人類進行行為研究。除了關於 LLM 是否準確捕捉人口層級模式的論點之外，這也引發了 LLM 是否捕捉到類人概念多樣性的問題。另外，爭論的焦點在於訓練後的比對（RLHF 或 RLAIF）是否會影響模型的內部多樣性。受到人類研究的啟發，我們使用一種新的方式來衡量合成產生的 LLM「族群」的概念多樣性，方法是將模擬個體的內部變異與族群層級的變異關聯起來。我們使用這種方法在兩個具有豐富人類行為資料的領域中評估未比對和已比對的 LLM。雖然沒有任何模型達到類人的多樣性，但已比對的模型通常比其微調指令的對應模型顯示出較低的多樣性。我們的研究結果突出了在增加模型價值比對和降低其概念表徵多樣性之間的潛在取捨。", "author": "Sonia K. Murthy et.al.", "authors": "Sonia K. Murthy, Tomer Ullman, Jennifer Hu", "id": "2411.04427v1", "paper_url": "http://arxiv.org/abs/2411.04427v1", "repo": "https://github.com/skmur/onefish-twofish"}}