{"2405.10767": {"publish_time": "2024-05-17", "title": "Evaluating Saliency Explanations in NLP by Crowdsourcing", "paper_summary": "Deep learning models have performed well on many NLP tasks. However, their\ninternal mechanisms are typically difficult for humans to understand. The\ndevelopment of methods to explain models has become a key issue in the\nreliability of deep learning models in many important applications. Various\nsaliency explanation methods, which give each feature of input a score\nproportional to the contribution of output, have been proposed to determine the\npart of the input which a model values most. Despite a considerable body of\nwork on the evaluation of saliency methods, whether the results of various\nevaluation metrics agree with human cognition remains an open question. In this\nstudy, we propose a new human-based method to evaluate saliency methods in NLP\nby crowdsourcing. We recruited 800 crowd workers and empirically evaluated\nseven saliency methods on two datasets with the proposed method. We analyzed\nthe performance of saliency methods, compared our results with existing\nautomated evaluation methods, and identified notable differences between NLP\nand computer vision (CV) fields when using saliency methods. The instance-level\ndata of our crowdsourced experiments and the code to reproduce the explanations\nare available at https://github.com/xtlu/lreccoling_evaluation.", "paper_summary_zh": "深度學習模型在許多 NLP 任務上表現良好。然而，人類通常難以理解其內部機制。在許多重要應用中，開發解釋模型的方法已成為深度學習模型可靠性的關鍵問題。已經提出各種顯著性解釋方法，這些方法為輸入的每個特徵賦予一個與輸出貢獻成正比的分數，以確定模型最重視輸入的哪一部分。儘管在顯著性方法的評估方面有大量的工作，但各種評估指標的結果是否與人類認知一致仍然是一個開放的問題。在本研究中，我們提出了一種基於人類的新方法，通過眾包來評估 NLP 中的顯著性方法。我們招募了 800 名群眾工作者，並使用所提出的方法在兩個數據集上對七種顯著性方法進行了經驗評估。我們分析了顯著性方法的性能，將我們的結果與現有的自動評估方法進行了比較，並在使用顯著性方法時發現了 NLP 和計算機視覺 (CV) 領域之間的顯著差異。我們眾包實驗的實例級別數據和重現解釋的代碼可在 https://github.com/xtlu/lreccoling_evaluation 中獲得。", "author": "Xiaotian Lu et.al.", "authors": "Xiaotian Lu, Jiyi Li, Zhen Wan, Xiaofeng Lin, Koh Takeuchi, Hisashi Kashima", "id": "2405.10767v1", "paper_url": "http://arxiv.org/abs/2405.10767v1", "repo": "https://github.com/xtlu/lreccoling_evaluation"}}