{"2501.09444": {"publish_time": "2025-01-16", "title": "Solving the unsolvable: Translating case law in Hong Kong", "paper_summary": "This paper addresses the challenges translating case law under Hong Kong's\nbilingual legal system. It highlights the initial success of translating all\nwritten statutes into Chinese before the 1997 handover, a task mandated by the\nBasic Law. The effort involved significant collaboration among legal,\nlinguistic, and translation experts, resulting in a comprehensive and\nculturally appropriate bilingual legal system. However, translating case law\nremains a significant challenge due to the sheer volume and continuous growth\nof judicial decisions. The paper critiques the governments and judiciarys\nsporadic and uncoordinated efforts to translate case law, contrasting it with\nthe thorough approach previously taken for statute translation. Although the\ngovernment acknowledges the importance of legal bilingualism, it lacks a\nsustainable strategy for translating case law. The Judiciarys position that\ntranslating all judgments is unnecessary, unrealistic, and not cost-effectiveis\nanalyzed and critiqued for its impact on legal transparency and public trust. A\nproposed solution involves leveraging machine translation technology through a\nhuman-machine interactive translation platform, which undergoes two major\ntransitions. Initially based on a neural model, the platform transitions to\nusing a large language model for improved translation accuracy. Furthermore, it\nevolves from a single-agent system to a multi-agent system, incorporating\nTranslator, Annotator, and Proofreader agents. This multi-agent approach,\nsupported by a grant, aims to facilitate efficient, high-quality translation of\njudicial judgments by integrating advanced artificial intelligence and\ncontinuous feedback mechanisms, thus better meeting the needs of a bilingual\nlegal system.", "paper_summary_zh": "本文探討在香港雙語法律制度下翻譯判例所面臨的挑戰。重點說明在 1997 年回歸前將所有成文法規翻譯成中文的初步成功，這項任務是由基本法授權的。這項工作需要法律、語言和翻譯專家的大力合作，最終建立了一個全面且符合文化背景的雙語法律制度。然而，由於司法判決數量龐大且持續增加，翻譯判例仍然是一項重大挑戰。本文批判政府和司法機構在翻譯判例上的零星且不協調的努力，並將其與先前在法規翻譯上採取的徹底方法進行對比。儘管政府承認法律雙語化的重要性，但卻缺乏翻譯判例的可持續策略。本文分析並批判司法機構認為翻譯所有判決不必要、不切實際且不具成本效益的立場，探討其對法律透明度和公眾信任的影響。建議的解決方案包括透過人機互動翻譯平台運用機器翻譯技術，該平台經歷兩次重大轉變。最初基於神經網路模型，該平台轉而使用大型語言模型以提高翻譯準確度。此外，它從單一代理系統演變成多代理系統，包含翻譯者、註解者和校對者代理。這種多代理方法在補助金的支持下，旨在透過整合先進的人工智慧和持續回饋機制，促進司法判決的高品質翻譯，從而更好地滿足雙語法律制度的需求。", "author": "King-kui Sin et.al.", "authors": "King-kui Sin, Xi Xuan, Chunyu Kit, Clara Ho-yan Chan, Honic Ho-kin Ip", "id": "2501.09444v1", "paper_url": "http://arxiv.org/abs/2501.09444v1", "repo": "null"}}