{"2410.07526": {"publish_time": "2024-10-10", "title": "MKGL: Mastery of a Three-Word Language", "paper_summary": "Large language models (LLMs) have significantly advanced performance across a\nspectrum of natural language processing (NLP) tasks. Yet, their application to\nknowledge graphs (KGs), which describe facts in the form of triplets and allow\nminimal hallucinations, remains an underexplored frontier. In this paper, we\ninvestigate the integration of LLMs with KGs by introducing a specialized KG\nLanguage (KGL), where a sentence precisely consists of an entity noun, a\nrelation verb, and ends with another entity noun. Despite KGL's unfamiliar\nvocabulary to the LLM, we facilitate its learning through a tailored dictionary\nand illustrative sentences, and enhance context understanding via real-time KG\ncontext retrieval and KGL token embedding augmentation. Our results reveal that\nLLMs can achieve fluency in KGL, drastically reducing errors compared to\nconventional KG embedding methods on KG completion. Furthermore, our enhanced\nLLM shows exceptional competence in generating accurate three-word sentences\nfrom an initial entity and interpreting new unseen terms out of KGs.", "paper_summary_zh": "大型語言模型 (LLM) 已大幅提升各種自然語言處理 (NLP) 任務的效能。然而，它們在知識圖譜 (KG) 的應用上仍有待開發，知識圖譜以三元組形式描述事實，並允許最小的幻覺。在本文中，我們透過引入一種專業的 KG 語言 (KGL) 來探討 LLM 與 KG 的整合，其中一個句子精確地包含一個實體名詞、一個關係動詞，並以另一個實體名詞結尾。儘管 LLM 對 KGL 的詞彙不熟悉，但我們透過量身打造的字典和說明性句子來促進它的學習，並透過即時 KG 背景擷取和 KGL 代幣嵌入強化來提升背景理解。我們的結果顯示，LLM 能夠流暢使用 KGL，大幅減少錯誤，優於 KG 完成中傳統的 KG 嵌入方法。此外，我們增強的 LLM 在從初始實體生成準確的三字詞句子，以及從 KG 解釋新的未見術語方面展現出卓越的能力。", "author": "Lingbing Guo et.al.", "authors": "Lingbing Guo, Zhongpu Bo, Zhuo Chen, Yichi Zhang, Jiaoyan Chen, Yarong Lan, Mengshu Sun, Zhiqiang Zhang, Yangyifei Luo, Qian Li, Qiang Zhang, Wen Zhang, Huajun Chen", "id": "2410.07526v1", "paper_url": "http://arxiv.org/abs/2410.07526v1", "repo": "null"}}