{"2406.03068": {"publish_time": "2024-06-05", "title": "How Truncating Weights Improves Reasoning in Language Models", "paper_summary": "In addition to the ability to generate fluent text in various languages,\nlarge language models have been successful at tasks that involve basic forms of\nlogical \"reasoning\" over their context. Recent work found that selectively\nremoving certain components from weight matrices in pre-trained models can\nimprove such reasoning capabilities. We investigate this phenomenon further by\ncarefully studying how certain global associations tend to be stored in\nspecific weight components or Transformer blocks, in particular feed-forward\nlayers. Such associations may hurt predictions in reasoning tasks, and removing\nthe corresponding components may then improve performance. We analyze how this\narises during training, both empirically and theoretically, on a two-layer\nTransformer trained on a basic reasoning task with noise, a toy associative\nmemory model, and on the Pythia family of pre-trained models tested on simple\nreasoning tasks.", "paper_summary_zh": "除了生成各種語言的流利文字外，大型語言模型在涉及其背景中基本形式的邏輯「推理」的任務上也取得了成功。最近的研究發現，從預訓練模型的權重矩陣中選擇性地移除某些組成部分，可以改善這種推理能力。我們通過仔細研究某些全局關聯如何傾向於儲存在特定權重組成部分或 Transformer 區塊（尤其是前饋層）中，進一步探討了這種現象。這種關聯可能會損害推理任務中的預測，而移除對應的組成部分可能會提高效能。我們分析了在訓練過程中這是如何產生的，無論是在經驗上還是理論上，在一個訓練於帶有雜訊的基本推理任務、玩具關聯記憶模型和在簡單推理任務上測試的 Pythia 預訓練模型家族上的兩層 Transformer。", "author": "Lei Chen et.al.", "authors": "Lei Chen, Joan Bruna, Alberto Bietti", "id": "2406.03068v1", "paper_url": "http://arxiv.org/abs/2406.03068v1", "repo": "null"}}