{"2407.21560": {"publish_time": "2024-07-31", "title": "Generative Sentiment Analysis via Latent Category Distribution and Constrained Decoding", "paper_summary": "Fine-grained sentiment analysis involves extracting and organizing sentiment\nelements from textual data. However, existing approaches often overlook issues\nof category semantic inclusion and overlap, as well as inherent structural\npatterns within the target sequence. This study introduces a generative\nsentiment analysis model. To address the challenges related to category\nsemantic inclusion and overlap, a latent category distribution variable is\nintroduced. By reconstructing the input of a variational autoencoder, the model\nlearns the intensity of the relationship between categories and text, thereby\nimproving sequence generation. Additionally, a trie data structure and\nconstrained decoding strategy are utilized to exploit structural patterns,\nwhich in turn reduces the search space and regularizes the generation process.\nExperimental results on the Restaurant-ACOS and Laptop-ACOS datasets\ndemonstrate a significant performance improvement compared to baseline models.\nAblation experiments further confirm the effectiveness of latent category\ndistribution and constrained decoding strategy.", "paper_summary_zh": "細粒度情緒分析涉及從文本資料中萃取和組織情緒元素。然而，現有方法經常忽略類別語義包含和重疊的問題，以及目標序列內在的結構模式。本研究引入一個生成式情緒分析模型。為了應對與類別語義包含和重疊相關的挑戰，引入了潛在類別分佈變數。透過重建變異自動編碼器的輸入，模型學習類別與文字之間關係的強度，從而改善序列生成。此外，利用樹狀結構和約束式解碼策略來利用結構模式，進而減少搜尋空間並規範生成過程。在 Restaurant-ACOS 和 Laptop-ACOS 資料集上的實驗結果證明與基線模型相比有顯著的效能提升。消融實驗進一步確認了潛在類別分佈和約束式解碼策略的有效性。", "author": "Jun Zhou et.al.", "authors": "Jun Zhou, Dongyang Yu, Kamran Aziz, Fangfang Su, Qing Zhang, Fei Li, Donghong Ji", "id": "2407.21560v1", "paper_url": "http://arxiv.org/abs/2407.21560v1", "repo": "null"}}