{"2409.05199": {"publish_time": "2024-09-08", "title": "Interactive Machine Teaching by Labeling Rules and Instances", "paper_summary": "Weakly supervised learning aims to reduce the cost of labeling data by using\nexpert-designed labeling rules. However, existing methods require experts to\ndesign effective rules in a single shot, which is difficult in the absence of\nproper guidance and tooling. Therefore, it is still an open question whether\nexperts should spend their limited time writing rules or instead providing\ninstance labels via active learning. In this paper, we investigate how to\nexploit an expert's limited time to create effective supervision. First, to\ndevelop practical guidelines for rule creation, we conduct an exploratory\nanalysis of diverse collections of existing expert-designed rules and find that\nrule precision is more important than coverage across datasets. Second, we\ncompare rule creation to individual instance labeling via active learning and\ndemonstrate the importance of both across 6 datasets. Third, we propose an\ninteractive learning framework, INTERVAL, that achieves efficiency by\nautomatically extracting candidate rules based on rich patterns (e.g., by\nprompting a language model), and effectiveness by soliciting expert feedback on\nboth candidate rules and individual instances. Across 6 datasets, INTERVAL\noutperforms state-of-the-art weakly supervised approaches by 7% in F1.\nFurthermore, it requires as few as 10 queries for expert feedback to reach F1\nvalues that existing active learning methods cannot match even with 100\nqueries.", "paper_summary_zh": "弱监督学习旨在通过使用专家设计的标签规则来降低数据标记成本。然而，现有方法要求专家一次性设计有效的规则，这在缺乏适当指导和工具的情况下是困难的。因此，专家是否应该将有限的时间花在编写规则上，还是通过主动学习提供实例标签，仍然是一个悬而未决的问题。在本文中，我们研究如何利用专家的有限时间来创建有效的监督。首先，为了制定规则创建的实用指南，我们对现有的专家设计的规则的不同集合进行了探索性分析，发现规则精度比跨数据集的覆盖范围更重要。其次，我们将规则创建与通过主动学习进行的单个实例标记进行比较，并证明了两者在 6 个数据集中的重要性。第三，我们提出了一个交互式学习框架 INTERVAL，它通过基于丰富模式（例如，通过提示语言模型）自动提取候选规则，以及通过征求专家对候选规则和单个实例的反馈来实现有效性，从而实现效率。在 6 个数据集上，INTERVAL 在 F1 中比最先进的弱监督方法高出 7%。此外，它只需要 10 个查询就能获得专家反馈，以达到现有的主动学习方法即使有 100 个查询也无法匹配的 F1 值。", "author": "Giannis Karamanolakis et.al.", "authors": "Giannis Karamanolakis, Daniel Hsu, Luis Gravano", "id": "2409.05199v1", "paper_url": "http://arxiv.org/abs/2409.05199v1", "repo": "null"}}