{"2407.08422": {"publish_time": "2024-07-11", "title": "On the (In)Security of LLM App Stores", "paper_summary": "LLM app stores have seen rapid growth, leading to the proliferation of\nnumerous custom LLM apps. However, this expansion raises security concerns. In\nthis study, we propose a three-layer concern framework to identify the\npotential security risks of LLM apps, i.e., LLM apps with abusive potential,\nLLM apps with malicious intent, and LLM apps with exploitable vulnerabilities.\nOver five months, we collected 786,036 LLM apps from six major app stores: GPT\nStore, FlowGPT, Poe, Coze, Cici, and Character.AI. Our research integrates\nstatic and dynamic analysis, the development of a large-scale toxic word\ndictionary (i.e., ToxicDict) comprising over 31,783 entries, and automated\nmonitoring tools to identify and mitigate threats. We uncovered that 15,146\napps had misleading descriptions, 1,366 collected sensitive personal\ninformation against their privacy policies, and 15,996 generated harmful\ncontent such as hate speech, self-harm, extremism, etc. Additionally, we\nevaluated the potential for LLM apps to facilitate malicious activities,\nfinding that 616 apps could be used for malware generation, phishing, etc. Our\nfindings highlight the urgent need for robust regulatory frameworks and\nenhanced enforcement mechanisms.", "paper_summary_zh": "LLM 應用程式商店已迅速成長，導致大量自訂 LLM 應用程式激增。然而，此擴張引發了安全疑慮。在此研究中，我們提出一個三層關注架構，以識別 LLM 應用程式的潛在安全風險，亦即具有濫用潛力的 LLM 應用程式、具有惡意意圖的 LLM 應用程式以及具有可利用漏洞的 LLM 應用程式。在五個月內，我們從六個主要應用程式商店收集了 786,036 個 LLM 應用程式：GPT Store、FlowGPT、Poe、Coze、Cici 和 Character.AI。我們的研究整合了靜態和動態分析、開發包含超過 31,783 個條目的、大規模的毒害字詞字典（亦即 ToxicDict），以及用於識別和減輕威脅的自動化監控工具。我們發現有 15,146 個應用程式的說明具有誤導性，1,366 個應用程式違反其隱私權政策收集敏感的個人資訊，15,996 個應用程式產生仇恨言論、自殘、極端主義等有害內容。此外，我們評估了 LLM 應用程式促進惡意活動的潛力，發現有 616 個應用程式可用於產生惡意軟體、網路釣魚等。我們的研究結果突顯了對健全法規架構和加強執法機制的迫切需求。", "author": "Xinyi Hou et.al.", "authors": "Xinyi Hou, Yanjie Zhao, Haoyu Wang", "id": "2407.08422v1", "paper_url": "http://arxiv.org/abs/2407.08422v1", "repo": "null"}}