{"2412.07448": {"publish_time": "2024-12-10", "title": "Dynamic Ensemble Reasoning for LLM Experts", "paper_summary": "Ensemble reasoning for the strengths of different LLM experts is critical to\nachieving consistent and satisfactory performance on diverse inputs across a\nwide range of tasks. However, existing LLM ensemble methods are either\ncomputationally intensive or incapable of leveraging complementary knowledge\namong LLM experts for various inputs. In this paper, we propose a Dynamic\nEnsemble Reasoning paradigm, called DER to integrate the strengths of multiple\nLLM experts conditioned on dynamic inputs. Specifically, we model the LLM\nensemble reasoning problem as a Markov Decision Process (MDP), wherein an agent\nsequentially takes inputs to request knowledge from an LLM candidate and passes\nthe output to a subsequent LLM candidate. Moreover, we devise a reward function\nto train a DER-Agent to dynamically select an optimal answering route given the\ninput questions, aiming to achieve the highest performance with as few\ncomputational resources as possible. Last, to fully transfer the expert\nknowledge from the prior LLMs, we develop a Knowledge Transfer Prompt (KTP)\nthat enables the subsequent LLM candidates to transfer complementary knowledge\neffectively. Experiments demonstrate that our method uses fewer computational\nresources to achieve better performance compared to state-of-the-art baselines.", "paper_summary_zh": "針對不同 LLM 專家的優勢進行整體推理，對於在各種任務的各種輸入中達成一致且令人滿意的效能至關重要。然而，現有的 LLM 整合方法不是計算密集，就是無法針對各種輸入利用 LLM 專家之間的互補知識。在本文中，我們提出一個名為 DER 的動態整體推理範例，以整合多位 LLM 專家的優勢，並以動態輸入為條件。具體而言，我們將 LLM 整合推理問題建模為馬可夫決策過程 (MDP)，其中一個代理會依序取得輸入，以要求 LLM 候選者提供知識，並將輸出傳遞給後續的 LLM 候選者。此外，我們設計了一個獎勵函數來訓練 DER 代理，以動態選擇最佳回答路徑，並以最少的計算資源達成最高的效能。最後，為了完全傳遞先前 LLM 的專家知識，我們開發了一個知識傳遞提示 (KTP)，讓後續的 LLM 候選者能夠有效傳遞互補知識。實驗證明，與最先進的基準線相比，我們的模型使用較少的計算資源就能達成更好的效能。", "author": "Jinwu Hu et.al.", "authors": "Jinwu Hu, Yufeng Wang, Shuhai Zhang, Kai Zhou, Guohao Chen, Yu Hu, Bin Xiao, Mingkui Tan", "id": "2412.07448v1", "paper_url": "http://arxiv.org/abs/2412.07448v1", "repo": "null"}}