{"2411.03807": {"publish_time": "2024-11-06", "title": "GS2Pose: Tow-stage 6D Object Pose Estimation Guided by Gaussian Splatting", "paper_summary": "This paper proposes a new method for accurate and robust 6D pose estimation\nof novel objects, named GS2Pose. By introducing 3D Gaussian splatting, GS2Pose\ncan utilize the reconstruction results without requiring a high-quality CAD\nmodel, which means it only requires segmented RGBD images as input.\nSpecifically, GS2Pose employs a two-stage structure consisting of coarse\nestimation followed by refined estimation. In the coarse stage, a lightweight\nU-Net network with a polarization attention mechanism, called Pose-Net, is\ndesigned. By using the 3DGS model for supervised training, Pose-Net can\ngenerate NOCS images to compute a coarse pose. In the refinement stage, GS2Pose\nformulates a pose regression algorithm following the idea of reprojection or\nBundle Adjustment (BA), referred to as GS-Refiner. By leveraging Lie algebra to\nextend 3DGS, GS-Refiner obtains a pose-differentiable rendering pipeline that\nrefines the coarse pose by comparing the input images with the rendered images.\nGS-Refiner also selectively updates parameters in the 3DGS model to achieve\nenvironmental adaptation, thereby enhancing the algorithm's robustness and\nflexibility to illuminative variation, occlusion, and other challenging\ndisruptive factors. GS2Pose was evaluated through experiments conducted on the\nLineMod dataset, where it was compared with similar algorithms, yielding highly\ncompetitive results. The code for GS2Pose will soon be released on GitHub.", "paper_summary_zh": "本文提出了一種新的方法，用於準確且穩健地估計新物體的 6D 姿勢，稱為 GS2Pose。透過引入 3D 高斯噴濺，GS2Pose 可以利用重建結果，而無需高品質的 CAD 模型，這表示它只需要分割的 RGBD 影像作為輸入。具體來說，GS2Pose 使用由粗略估計和精緻估計組成的兩階段結構。在粗略階段，設計了一個具有極化注意力機制的輕量級 U-Net 網路，稱為 Pose-Net。透過使用 3DGS 模型進行監督訓練，Pose-Net 可以產生 NOCS 影像來計算粗略姿勢。在精緻階段，GS2Pose 根據重新投影或束調整 (BA) 的概念制定了一個姿勢回歸演算法，稱為 GS-Refiner。透過利用李代數來擴充 3DGS，GS-Refiner 獲得了一個姿勢可微分渲染管線，它透過比較輸入影像與渲染影像來精緻粗略姿勢。GS-Refiner 也選擇性地更新 3DGS 模型中的參數，以實現環境適應，從而增強演算法對光照變化、遮擋和其他具有挑戰性的破壞因素的穩健性和靈活性。GS2Pose 透過在 LineMod 資料集上進行的實驗進行評估，在該資料集上將其與類似的演算法進行比較，產生了極具競爭力的結果。GS2Pose 的程式碼將很快在 GitHub 上發布。", "author": "Jilan Mei et.al.", "authors": "Jilan Mei, Junbo Li, Cai Meng", "id": "2411.03807v1", "paper_url": "http://arxiv.org/abs/2411.03807v1", "repo": "null"}}