{"2502.06607": {"publish_time": "2025-02-10", "title": "Illegal Waste Detection in Remote Sensing Images: A Case Study", "paper_summary": "Environmental crime currently represents the third largest criminal activity\nworldwide while threatening ecosystems as well as human health. Among the\ncrimes related to this activity, improper waste management can nowadays be\ncountered more easily thanks to the increasing availability and decreasing cost\nof Very-High-Resolution Remote Sensing images, which enable semi-automatic\nterritory scanning in search of illegal landfills. This paper proposes a\npipeline, developed in collaboration with professionals from a local\nenvironmental agency, for detecting candidate illegal dumping sites leveraging\na classifier of Remote Sensing images. To identify the best configuration for\nsuch classifier, an extensive set of experiments was conducted and the impact\nof diverse image characteristics and training settings was thoroughly analyzed.\nThe local environmental agency was then involved in an experimental exercise\nwhere outputs from the developed classifier were integrated in the experts'\neveryday work, resulting in time savings with respect to manual\nphoto-interpretation. The classifier was eventually run with valuable results\non a location outside of the training area, highlighting potential for\ncross-border applicability of the proposed pipeline.", "paper_summary_zh": "環境犯罪目前是全球第三大犯罪活動，同時威脅著生態系統和人類健康。在與此活動相關的犯罪中，由於極高解析度遙測影像越來越普及且成本越來越低，現在可以更容易地應對不當的廢棄物管理，這使我們能夠半自動掃描領土以尋找非法垃圾掩埋場。本文提出了一個管道，與當地環境機構的專業人士合作開發，用於檢測候選非法傾倒場，並利用遙測影像分類器。為了找出此類分類器的最佳配置，進行了一系列廣泛的實驗，並徹底分析了不同影像特徵和訓練設定的影響。然後，當地環境機構參與了一項實驗，其中將已開發分類器的輸出整合到專家的日常工作中，從而節省了人工照片解譯的時間。最後，分類器在訓練區域外的某個位置執行，並獲得了有價值的結果，突顯了所提出的管道在跨境應用方面的潛力。", "author": "Federico Gibellini et.al.", "authors": "Federico Gibellini, Piero Fraternali, Giacomo Boracchi, Luca Morandini, Andrea Diecidue, Simona Malegori", "id": "2502.06607v1", "paper_url": "http://arxiv.org/abs/2502.06607v1", "repo": "null"}}