{"2406.16382": {"publish_time": "2024-06-24", "title": "UNO Arena for Evaluating Sequential Decision-Making Capability of Large Language Models", "paper_summary": "Sequential decision-making refers to algorithms that take into account the\ndynamics of the environment, where early decisions affect subsequent decisions.\nWith large language models (LLMs) demonstrating powerful capabilities between\ntasks, we can't help but ask: Can Current LLMs Effectively Make Sequential\nDecisions? In order to answer this question, we propose the UNO Arena based on\nthe card game UNO to evaluate the sequential decision-making capability of LLMs\nand explain in detail why we choose UNO. In UNO Arena, We evaluate the\nsequential decision-making capability of LLMs dynamically with novel metrics\nbased Monte Carlo methods. We set up random players, DQN-based reinforcement\nlearning players, and LLM players (e.g. GPT-4, Gemini-pro) for comparison\ntesting. Furthermore, in order to improve the sequential decision-making\ncapability of LLMs, we propose the TUTRI player, which can involves having LLMs\nreflect their own actions wtih the summary of game history and the game\nstrategy. Numerous experiments demonstrate that the TUTRI player achieves a\nnotable breakthrough in the performance of sequential decision-making compared\nto the vanilla LLM player.", "paper_summary_zh": "序貫決策制定是指考量環境動態的演算法，其中早期決策會影響後續決策。大型語言模型 (LLM) 在各項任務間展現強大的能力，我們不禁發問：目前的 LLM 能否有效地進行序貫決策？為了回答這個問題，我們提出基於卡牌遊戲 UNO 的 UNO Arena，用以評估 LLM 的序貫決策制定能力，並詳細說明我們選擇 UNO 的原因。在 UNO Arena 中，我們使用基於蒙地卡羅方法的新穎指標，動態評估 LLM 的序貫決策制定能力。我們設定隨機玩家、基於 DQN 的強化學習玩家和 LLM 玩家（例如 GPT-4、Gemini-pro）進行比較測試。此外，為了提升 LLM 的序貫決策制定能力，我們提出 TUTRI 玩家，它可以讓 LLM 透過遊戲歷史摘要和遊戲策略來反思自己的行動。許多實驗證明，與原始 LLM 玩家相比，TUTRI 玩家在序貫決策制定表現上取得顯著突破。", "author": "Zhanyue Qin et.al.", "authors": "Zhanyue Qin, Haochuan Wang, Deyuan Liu, Ziyang Song, Cunhang Fan, Zhao Lv, Jinlin Wu, Zhen Lei, Zhiying Tu, Dianhui Chu, Xiaoyan Yu, Dianbo Sui", "id": "2406.16382v1", "paper_url": "http://arxiv.org/abs/2406.16382v1", "repo": "null"}}