{"2406.14240": {"publish_time": "2024-06-20", "title": "CityNav: Language-Goal Aerial Navigation Dataset with Geographic Information", "paper_summary": "Vision-and-language navigation (VLN) aims to guide autonomous agents through\nreal-world environments by integrating visual and linguistic cues. While\nsubstantial progress has been made in understanding these interactive\nmodalities in ground-level navigation, aerial navigation remains largely\nunderexplored. This is primarily due to the scarcity of resources suitable for\nreal-world, city-scale aerial navigation studies. To bridge this gap, we\nintroduce CityNav, a new dataset for language-goal aerial navigation using a 3D\npoint cloud representation from real-world cities. CityNav includes 32,637\nnatural language descriptions paired with human demonstration trajectories,\ncollected from participants via a new web-based 3D simulator developed for this\nresearch. Each description specifies a navigation goal, leveraging the names\nand locations of landmarks within real-world cities. We also provide baseline\nmodels of navigation agents that incorporate an internal 2D spatial map\nrepresenting landmarks referenced in the descriptions. We benchmark the latest\naerial navigation baselines and our proposed model on the CityNav dataset. The\nresults using this dataset reveal the following key findings: (i) Our aerial\nagent models trained on human demonstration trajectories outperform those\ntrained on shortest path trajectories, highlighting the importance of\nhuman-driven navigation strategies; (ii) The integration of a 2D spatial map\nsignificantly enhances navigation efficiency at city scale. Our dataset and\ncode are available at https://water-cookie.github.io/city-nav-proj/", "paper_summary_zh": "視覺和語言導航 (VLN) 旨在透過整合視覺和語言提示，引導自主代理穿過真實世界的環境。雖然在理解地面導航中的這些互動模式方面已取得重大進展，但空中導航仍未得到充分探索。這主要是由於缺乏適合於真實世界、城市規模的空中導航研究的資源。為了彌補這一差距，我們引入了 CityNav，這是一個新的語言目標空中導航數據集，使用來自真實世界城市的 3D 點雲表示。CityNav 包含 32,637 個自然語言描述，並配有人類示範軌跡，這些軌跡是通過一個為此研究開發的新型網路 3D 模擬器從參與者那裡收集的。每個描述都指定了一個導航目標，利用真實世界城市中地標的名稱和位置。我們還提供了導航代理的基準模型，其中包含一個內部 2D 空間地圖，表示描述中引用的地標。我們在 CityNav 數據集上對最新的空中導航基準和我們提出的模型進行了基準測試。使用此數據集的結果揭示了以下關鍵發現：(i) 我們訓練於人類示範軌跡上的空中代理模型優於訓練於最短路徑軌跡上的模型，突出了人類驅動導航策略的重要性；(ii) 2D 空間地圖的整合顯著提高了城市規模的導航效率。我們的數據集和代碼可在 https://water-cookie.github.io/city-nav-proj/ 獲得。", "author": "Jungdae Lee et.al.", "authors": "Jungdae Lee, Taiki Miyanishi, Shuhei Kurita, Koya Sakamoto, Daichi Azuma, Yutaka Matsuo, Nakamasa Inoue", "id": "2406.14240v1", "paper_url": "http://arxiv.org/abs/2406.14240v1", "repo": "null"}}