{"2410.07864": {"publish_time": "2024-10-10", "title": "RDT-1B: a Diffusion Foundation Model for Bimanual Manipulation", "paper_summary": "Bimanual manipulation is essential in robotics, yet developing foundation\nmodels is extremely challenging due to the inherent complexity of coordinating\ntwo robot arms (leading to multi-modal action distributions) and the scarcity\nof training data. In this paper, we present the Robotics Diffusion Transformer\n(RDT), a pioneering diffusion foundation model for bimanual manipulation. RDT\nbuilds on diffusion models to effectively represent multi-modality, with\ninnovative designs of a scalable Transformer to deal with the heterogeneity of\nmulti-modal inputs and to capture the nonlinearity and high frequency of\nrobotic data. To address data scarcity, we further introduce a Physically\nInterpretable Unified Action Space, which can unify the action representations\nof various robots while preserving the physical meanings of original actions,\nfacilitating learning transferrable physical knowledge. With these designs, we\nmanaged to pre-train RDT on the largest collection of multi-robot datasets to\ndate and scaled it up to 1.2B parameters, which is the largest diffusion-based\nfoundation model for robotic manipulation. We finally fine-tuned RDT on a\nself-created multi-task bimanual dataset with over 6K+ episodes to refine its\nmanipulation capabilities. Experiments on real robots demonstrate that RDT\nsignificantly outperforms existing methods. It exhibits zero-shot\ngeneralization to unseen objects and scenes, understands and follows language\ninstructions, learns new skills with just 1~5 demonstrations, and effectively\nhandles complex, dexterous tasks. We refer to\nhttps://rdt-robotics.github.io/rdt-robotics/ for the code and videos.", "paper_summary_zh": "雙手操作在機器人技術中至關重要，然而由於協調兩個機器手臂（導致多模式動作分佈）的固有複雜性以及訓練數據的稀缺性，開發基礎模型極具挑戰性。在本文中，我們提出了機器人擴散Transformer (RDT)，這是一個用於雙手操作的開創性擴散基礎模型。RDT 建立在擴散模型之上，以有效表示多模態，並採用可擴充Transformer的創新設計來處理多模態輸入的異質性，並捕捉機器人數據的非線性和高頻率。為了解決數據稀缺問題，我們進一步引入了一個物理可解釋統一動作空間，它可以統一各種機器人的動作表示，同時保留原始動作的物理意義，促進學習可轉移的物理知識。有了這些設計，我們設法在迄今為止最大的多機器人數據集集合上對 RDT 進行預訓練，並將其擴展到 1.2B 參數，這是最大的基於擴散的機器人操作基礎模型。我們最終在一個自創的多任務雙手數據集上對 RDT 進行微調，該數據集包含超過 6K 個情節，以提升其操作能力。在真實機器人上的實驗表明，RDT 明顯優於現有方法。它對未見過的物體和場景表現出零次學習泛化，理解並遵循語言指令，只需 1~5 次示範就能學習新技能，並有效處理複雜的靈巧任務。我們參考 https://rdt-robotics.github.io/rdt-robotics/ 獲取代碼和影片。", "author": "Songming Liu et.al.", "authors": "Songming Liu, Lingxuan Wu, Bangguo Li, Hengkai Tan, Huayu Chen, Zhengyi Wang, Ke Xu, Hang Su, Jun Zhu", "id": "2410.07864v1", "paper_url": "http://arxiv.org/abs/2410.07864v1", "repo": "null"}}