{"2408.00374": {"publish_time": "2024-08-01", "title": "Conformal Trajectory Prediction with Multi-View Data Integration in Cooperative Driving", "paper_summary": "Current research on trajectory prediction primarily relies on data collected\nby onboard sensors of an ego vehicle. With the rapid advancement in connected\ntechnologies, such as vehicle-to-vehicle (V2V) and vehicle-to-infrastructure\n(V2I) communication, valuable information from alternate views becomes\naccessible via wireless networks. The integration of information from\nalternative views has the potential to overcome the inherent limitations\nassociated with a single viewpoint, such as occlusions and limited field of\nview. In this work, we introduce V2INet, a novel trajectory prediction\nframework designed to model multi-view data by extending existing single-view\nmodels. Unlike previous approaches where the multi-view data is manually fused\nor formulated as a separate training stage, our model supports end-to-end\ntraining, enhancing both flexibility and performance. Moreover, the predicted\nmultimodal trajectories are calibrated by a post-hoc conformal prediction\nmodule to get valid and efficient confidence regions. We evaluated the entire\nframework using the real-world V2I dataset V2X-Seq. Our results demonstrate\nsuperior performance in terms of Final Displacement Error (FDE) and Miss Rate\n(MR) using a single GPU. The code is publicly available at:\n\\url{https://github.com/xichennn/V2I_trajectory_prediction}.", "paper_summary_zh": "目前關於軌跡預測的研究主要依賴於自我車輛上搭載感測器所收集的資料。隨著車聯網技術的快速發展，例如車對車 (V2V) 和車對基礎設施 (V2I) 通訊，來自備用視角的寶貴資訊可透過無線網路存取。整合來自備用視角的資訊有潛力克服與單一視角相關的固有限制，例如遮擋和受限視野。在這項工作中，我們引進 V2INet，這是一個新穎的軌跡預測架構，旨在透過擴充現有的單一視角模型來建構多視角資料。與先前的做法不同，先前的做法是手動融合多視角資料或將其制定為一個獨立的訓練階段，我們的模型支援端對端的訓練，提升了彈性和效能。此外，預測的多模態軌跡由事後共形預測模組校正，以取得有效且精確的信心區域。我們使用真實世界的 V2I 資料集 V2X-Seq 評估了整個架構。我們的結果證明，使用單一 GPU 時，在最終位移誤差 (FDE) 和遺漏率 (MR) 方面表現出優異的效能。程式碼已公開於：\\url{https://github.com/xichennn/V2I_trajectory_prediction}。", "author": "Xi Chen et.al.", "authors": "Xi Chen, Rahul Bhadani, Larry Head", "id": "2408.00374v1", "paper_url": "http://arxiv.org/abs/2408.00374v1", "repo": "null"}}