{"2408.00989": {"publish_time": "2024-08-02", "title": "On the Resilience of Multi-Agent Systems with Malicious Agents", "paper_summary": "Multi-agent systems, powered by large language models, have shown great\nabilities across various tasks due to the collaboration of expert agents, each\nfocusing on a specific domain. However, when agents are deployed separately,\nthere is a risk that malicious users may introduce malicious agents who\ngenerate incorrect or irrelevant results that are too stealthy to be identified\nby other non-specialized agents. Therefore, this paper investigates two\nessential questions: (1) What is the resilience of various multi-agent system\nstructures (e.g., A$\\rightarrow$B$\\rightarrow$C,\nA$\\leftrightarrow$B$\\leftrightarrow$C) under malicious agents, on different\ndownstream tasks? (2) How can we increase system resilience to defend against\nmalicious agents? To simulate malicious agents, we devise two methods,\nAutoTransform and AutoInject, to transform any agent into a malicious one while\npreserving its functional integrity. We run comprehensive experiments on four\ndownstream multi-agent systems tasks, namely code generation, math problems,\ntranslation, and text evaluation. Results suggest that the \"hierarchical\"\nmulti-agent structure, i.e., A$\\rightarrow$(B$\\leftrightarrow$C), exhibits\nsuperior resilience with the lowest performance drop of $23.6\\%$, compared to\n$46.4\\%$ and $49.8\\%$ of other two structures. Additionally, we show the\npromise of improving multi-agent system resilience by demonstrating that two\ndefense methods, introducing an additional agent to review and correct messages\nor mechanisms for each agent to challenge others' outputs, can enhance system\nresilience. Our code and data are available at\nhttps://github.com/CUHK-ARISE/MAS-Resilience.", "paper_summary_zh": "<paragraph>多代理系統由大型語言模型驅動，由於專家代理的協作，每個代理專注於特定領域，因此在各種任務中展現出極佳的能力。然而，當代理分別部署時，存在惡意使用者可能引入惡意代理的風險，這些代理會產生不正確或不相關的結果，而這些結果隱蔽到無法被其他非專業代理識別。因此，本文探討兩個基本問題：(1) 在不同的下游任務中，各種多代理系統結構（例如，A→B→C，A↔B↔C）對惡意代理的韌性為何？(2) 我們如何提高系統韌性以抵禦惡意代理？為了模擬惡意代理，我們設計了兩種方法，AutoTransform 和 AutoInject，將任何代理轉換為惡意代理，同時保留其功能完整性。我們對四種下游多代理系統任務執行全面實驗，即程式碼生成、數學問題、翻譯和文字評估。結果表明，「階層式」多代理結構，即 A→(B↔C)，表現出優異的韌性，效能下降最低為 23.6%，而其他兩個結構的效能下降分別為 46.4% 和 49.8%。此外，我們展示了提高多代理系統韌性的前景，證明了兩種防禦方法，即引入額外的代理來檢閱和更正訊息，或讓每個代理挑戰其他代理輸出的機制，可以增強系統韌性。我們的程式碼和資料可在 https://github.com/CUHK-ARISE/MAS-Resilience 取得。</paragraph>", "author": "Jen-tse Huang et.al.", "authors": "Jen-tse Huang, Jiaxu Zhou, Tailin Jin, Xuhui Zhou, Zixi Chen, Wenxuan Wang, Youliang Yuan, Maarten Sap, Michael R. Lyu", "id": "2408.00989v1", "paper_url": "http://arxiv.org/abs/2408.00989v1", "repo": "null"}}