{"2412.04954": {"publish_time": "2024-12-06", "title": "Gla-AI4BioMed at RRG24: Visual Instruction-tuned Adaptation for Radiology Report Generation", "paper_summary": "We introduce a radiology-focused visual language model designed to generate\nradiology reports from chest X-rays. Building on previous findings that large\nlanguage models (LLMs) can acquire multimodal capabilities when aligned with\npretrained vision encoders, we demonstrate similar potential with chest X-ray\nimages. This integration enhances the ability of model to understand and\ndescribe chest X-ray images. Our model combines an image encoder with a\nfine-tuned LLM based on the Vicuna-7B architecture, enabling it to generate\ndifferent sections of a radiology report with notable accuracy. The training\nprocess involves a two-stage approach: (i) initial alignment of chest X-ray\nfeatures with the LLM (ii) followed by fine-tuning for radiology report\ngeneration.", "paper_summary_zh": "我們引入了一個專注於放射學的視覺語言模型，旨在根據胸部 X 光片生成放射學報告。根據先前的研究發現，當大型語言模型 (LLM) 與預訓練的視覺編碼器對齊時，可以獲得多模態能力，我們展示了胸部 X 光影像的類似潛力。這種整合增強了模型理解和描述胸部 X 光影像的能力。我們的模型結合了一個影像編碼器和一個基於 Vicuna-7B 架構的微調 LLM，使其能夠以顯著的準確度生成放射學報告的不同部分。訓練過程涉及一個兩階段方法：(i) 胸部 X 光特徵與 LLM 的初始對齊 (ii) 接著進行放射學報告生成的微調。", "author": "Xi Zhang et.al.", "authors": "Xi Zhang, Zaiqiao Meng, Jake Lever, Edmond S. L. Ho", "id": "2412.04954v1", "paper_url": "http://arxiv.org/abs/2412.04954v1", "repo": "null"}}