{"2407.16047": {"publish_time": "2024-07-22", "title": "Leveraging Large Language Models to Geolocate Linguistic Variations in Social Media Posts", "paper_summary": "Geolocalization of social media content is the task of determining the\ngeographical location of a user based on textual data, that may show linguistic\nvariations and informal language. In this project, we address the GeoLingIt\nchallenge of geolocalizing tweets written in Italian by leveraging large\nlanguage models (LLMs). GeoLingIt requires the prediction of both the region\nand the precise coordinates of the tweet. Our approach involves fine-tuning\npre-trained LLMs to simultaneously predict these geolocalization aspects. By\nintegrating innovative methodologies, we enhance the models' ability to\nunderstand the nuances of Italian social media text to improve the\nstate-of-the-art in this domain. This work is conducted as part of the Large\nLanguage Models course at the Bertinoro International Spring School 2024. We\nmake our code publicly available on GitHub\nhttps://github.com/dawoz/geolingit-biss2024.", "paper_summary_zh": "社交媒體內容的地理定位是根據可能顯示語言變異和非正式語言的文字資料，來確定使用者的地理位置的任務。在這個專案中，我們透過利用大型語言模型 (LLM) 來處理以義大利文撰寫的推文地理定位的 GeoLingIt 挑戰。GeoLingIt 需要預測推文的區域和精確座標。我們的做法包括微調預先訓練的 LLM，以同時預測這些地理定位面向。透過整合創新的方法，我們增強模型了解義大利文社交媒體文字細微差别的能力，以提升這個領域的最新技術。這項工作是作為 2024 年貝爾蒂諾羅國際春季學校的大型語言模型課程的一部分進行的。我們在 GitHub 上公開我們的程式碼 https://github.com/dawoz/geolingit-biss2024。", "author": "Davide Savarro et.al.", "authors": "Davide Savarro, Davide Zago, Stefano Zoia", "id": "2407.16047v1", "paper_url": "http://arxiv.org/abs/2407.16047v1", "repo": "https://github.com/dawoz/geolingit-biss2024"}}