{"2412.13794": {"publish_time": "2024-12-18", "title": "MATCHED: Multimodal Authorship-Attribution To Combat Human Trafficking in Escort-Advertisement Data", "paper_summary": "Human trafficking (HT) remains a critical issue, with traffickers\nincreasingly leveraging online escort advertisements (ads) to advertise victims\nanonymously. Existing detection methods, including Authorship Attribution (AA),\noften center on text-based analyses and neglect the multimodal nature of online\nescort ads, which typically pair text with images. To address this gap, we\nintroduce MATCHED, a multimodal dataset of 27,619 unique text descriptions and\n55,115 unique images collected from the Backpage escort platform across seven\nU.S. cities in four geographical regions. Our study extensively benchmarks\ntext-only, vision-only, and multimodal baselines for vendor identification and\nverification tasks, employing multitask (joint) training objectives that\nachieve superior classification and retrieval performance on in-distribution\nand out-of-distribution (OOD) datasets. Integrating multimodal features further\nenhances this performance, capturing complementary patterns across text and\nimages. While text remains the dominant modality, visual data adds stylistic\ncues that enrich model performance. Moreover, text-image alignment strategies\nlike CLIP and BLIP2 struggle due to low semantic overlap and vague connections\nbetween the modalities of escort ads, with end-to-end multimodal training\nproving more robust. Our findings emphasize the potential of multimodal AA\n(MAA) to combat HT, providing LEAs with robust tools to link ads and disrupt\ntrafficking networks.", "paper_summary_zh": "人口販運 (HT) 仍然是一個關鍵問題，販運者越來越利用線上應召廣告 (ad) 來匿名宣傳受害者。現有的偵測方法，包括作者歸因 (AA)，通常集中在基於文字的分析，而忽略線上應召廣告的多模態性質，而這通常會將文字與圖片配對。為了解決這個差距，我們引入了 MATCHED，一個多模態資料集，包含從美國七個城市在四個地理區域的 Backpage 應召平台收集的 27,619 個獨特文字描述和 55,115 個獨特圖片。我們的研究廣泛地比較了僅文字、僅視覺和多模態的基準，用於供應商識別和驗證任務，採用多任務 (聯合) 訓練目標，在分佈內和分佈外 (OOD) 資料集上獲得優異的分類和檢索效能。整合多模態特徵進一步增強了此效能，捕捉文字和圖片中的互補模式。儘管文字仍然是主要的模態，但視覺資料增加了豐富模型效能的風格線索。此外，由於應召廣告的模態之間的語義重疊低且關聯模糊，因此 CLIP 和 BLIP2 等文字影像對齊策略難以發揮作用，而端到端的多模態訓練則證明更為穩健。我們的研究結果強調了多模態 AA (MAA) 打擊 HT 的潛力，為執法機構 (LEA) 提供了強大的工具來連結廣告並瓦解販運網路。", "author": "Vageesh Saxena et.al.", "authors": "Vageesh Saxena, Benjamin Bashpole, Gijs Van Dijck, Gerasimos Spanakis", "id": "2412.13794v1", "paper_url": "http://arxiv.org/abs/2412.13794v1", "repo": "https://github.com/vageeshsaxena/matched"}}