{"2408.08803": {"publish_time": "2024-08-16", "title": "Leveraging FourierKAN Classification Head for Pre-Trained Transformer-based Text Classification", "paper_summary": "For many years, transformer-based pre-trained models with Multi-layer\nPerceptron (MLP) heads have been the standard for text classification tasks.\nHowever, the fixed non-linear functions employed by MLPs often fall short of\ncapturing the intricacies of the contextualized embeddings produced by\npre-trained encoders. Furthermore, MLPs usually require a significant number of\ntraining parameters, which can be computationally expensive. In this work, we\nintroduce FourierKAN (FR-KAN), a variant of the promising MLP alternative\ncalled Kolmogorov-Arnold Networks (KANs), as classification heads for\ntransformer-based encoders. Our studies reveal an average increase of 10% in\naccuracy and 11% in F1-score when incorporating FR-KAN heads instead of\ntraditional MLP heads for several transformer-based pre-trained models across\nmultiple text classification tasks. Beyond improving model accuracy, FR-KAN\nheads train faster and require fewer parameters. Our research opens new grounds\nfor broader applications of KAN across several Natural Language Processing\n(NLP) tasks.", "paper_summary_zh": "多年來，具有多層感知器 (MLP) 頭的基於Transformer的預訓練模型一直是文本分類任務的標準。\n然而，MLP 使用的固定非線性函數通常無法捕捉由預訓練編碼器產生的上下文化嵌入的複雜性。\n此外，MLP 通常需要大量的訓練參數，這在計算上可能是昂貴的。\n在這項工作中，我們引入了 FourierKAN (FR-KAN)，一種有前途的 MLP 替代方案，稱為 Kolmogorov-Arnold 網路 (KAN)，作為基於Transformer的編碼器的分類頭。\n我們的研究表明，在多個文本分類任務中，將 FR-KAN 頭整合到基於Transformer的預訓練模型中，而不是傳統的 MLP 頭，準確率平均提高了 10%，F1 分數提高了 11%。\n除了提高模型準確度之外，FR-KAN 頭訓練速度更快，並且需要更少的參數。\n我們的研究為 KAN 在多個自然語言處理 (NLP) 任務中的更廣泛應用開闢了新的領域。", "author": "Abdullah Al Imran et.al.", "authors": "Abdullah Al Imran, Md Farhan Ishmam", "id": "2408.08803v1", "paper_url": "http://arxiv.org/abs/2408.08803v1", "repo": "null"}}