{"2409.09704": {"publish_time": "2024-09-15", "title": "AlpaPICO: Extraction of PICO Frames from Clinical Trial Documents Using LLMs", "paper_summary": "In recent years, there has been a surge in the publication of clinical trial\nreports, making it challenging to conduct systematic reviews. Automatically\nextracting Population, Intervention, Comparator, and Outcome (PICO) from\nclinical trial studies can alleviate the traditionally time-consuming process\nof manually scrutinizing systematic reviews. Existing approaches of PICO frame\nextraction involves supervised approach that relies on the existence of\nmanually annotated data points in the form of BIO label tagging. Recent\napproaches, such as In-Context Learning (ICL), which has been shown to be\neffective for a number of downstream NLP tasks, require the use of labeled\nexamples. In this work, we adopt ICL strategy by employing the pretrained\nknowledge of Large Language Models (LLMs), gathered during the pretraining\nphase of an LLM, to automatically extract the PICO-related terminologies from\nclinical trial documents in unsupervised set up to bypass the availability of\nlarge number of annotated data instances. Additionally, to showcase the highest\neffectiveness of LLM in oracle scenario where large number of annotated samples\nare available, we adopt the instruction tuning strategy by employing Low Rank\nAdaptation (LORA) to conduct the training of gigantic model in low resource\nenvironment for the PICO frame extraction task. Our empirical results show that\nour proposed ICL-based framework produces comparable results on all the version\nof EBM-NLP datasets and the proposed instruction tuned version of our framework\nproduces state-of-the-art results on all the different EBM-NLP datasets. Our\nproject is available at \\url{https://github.com/shrimonmuke0202/AlpaPICO.git}.", "paper_summary_zh": "<paragraph>近年來，臨床試驗報告的出版數量激增，這使得進行系統性回顧具有挑戰性。自動從臨床試驗研究中提取人群、干預、比較和結果 (PICO) 可以減輕傳統上耗時的系統性回顧手動審查過程。現有的 PICO 框架提取方法涉及依賴以 BIO 標籤標記形式存在的手動註解數據點的監督式方法。最近的方法，例如語境學習 (ICL)，已被證明對許多下游 NLP 任務有效，需要使用標記範例。在這項工作中，我們採用 ICL 策略，利用大型語言模型 (LLM) 的預訓練知識，在 LLM 的預訓練階段收集，以在無監督設置中自動從臨床試驗文件中提取與 PICO 相關的術語，以繞過大量註解數據實例的可用性。此外，為了展示 LLM 在預言機場景中的最高效率，其中有大量註解樣本可用，我們採用指令調整策略，採用低秩適應 (LORA) 來在低資源環境中對大型模型進行訓練，以進行 PICO 框架提取任務。我們的實證結果表明，我們提出的基於 ICL 的框架在所有版本的 EBM-NLP 數據集上產生了可比較的結果，而我們框架提出的指令調整版本在所有不同的 EBM-NLP 數據集上產生了最先進的結果。我們的項目可在以下網址獲得：\\url{https://github.com/shrimonmuke0202/AlpaPICO.git}。</paragraph>", "author": "Madhusudan Ghosh et.al.", "authors": "Madhusudan Ghosh, Shrimon Mukherjee, Asmit Ganguly, Partha Basuchowdhuri, Sudip Kumar Naskar, Debasis Ganguly", "id": "2409.09704v1", "paper_url": "http://arxiv.org/abs/2409.09704v1", "repo": "https://github.com/shrimonmuke0202/alpapico"}}