{"2408.12369": {"publish_time": "2024-08-22", "title": "RoundTable: Leveraging Dynamic Schema and Contextual Autocomplete for Enhanced Query Precision in Tabular Question Answering", "paper_summary": "With advancements in Large Language Models (LLMs), a major use case that has\nemerged is querying databases in plain English, translating user questions into\nexecutable database queries, which has improved significantly. However,\nreal-world datasets often feature a vast array of attributes and complex\nvalues, complicating the LLMs task of accurately identifying relevant columns\nor values from natural language queries. Traditional methods cannot fully relay\nthe datasets size and complexity to the LLM. To address these challenges, we\npropose a novel framework that leverages Full-Text Search (FTS) on the input\ntable. This approach not only enables precise detection of specific values and\ncolumns but also narrows the search space for language models, thereby\nenhancing query accuracy. Additionally, it supports a custom auto-complete\nfeature that suggests queries based on the data in the table. This integration\nsignificantly refines the interaction between the user and complex datasets,\noffering a sophisticated solution to the limitations faced by current table\nquerying capabilities. This work is accompanied by an application for both Mac\nand Windows platforms, which readers can try out themselves on their own data.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的進步，一個主要的使用案例已經浮現，那就是以英語查詢資料庫，將使用者的問題轉換為可執行的資料庫查詢，這已經有了顯著的進步。然而，真實世界的資料集通常具有大量的屬性和複雜的值，這讓 LLM 難以準確地從自然語言查詢中識別出相關的欄位或值。傳統的方法無法完全向 LLM 傳達資料集的大小和複雜性。為了應對這些挑戰，我們提出了一個新穎的框架，它在輸入表上利用全文搜尋 (FTS)。這種方法不僅能夠精確地偵測特定值和欄位，還能縮小語言模型的搜尋空間，從而提高查詢的準確性。此外，它還支援自訂的自動完成功能，根據表中的資料建議查詢。這種整合顯著地改進了使用者與複雜資料集之間的互動，為目前表格查詢能力所面臨的限制提供了巧妙的解決方案。這項工作附帶了一個適用於 Mac 和 Windows 平台的應用程式，讀者可以自行在自己的資料上試用。", "author": "Pratyush Kumar et.al.", "authors": "Pratyush Kumar, Kuber Vijaykumar Bellad, Bharat Vadlamudi, Aman Chadha", "id": "2408.12369v1", "paper_url": "http://arxiv.org/abs/2408.12369v1", "repo": "null"}}