{"2408.06900": {"publish_time": "2024-08-13", "title": "Entendre, a Social Bot Detection Tool for Niche, Fringe, and Extreme Social Media", "paper_summary": "Social bots-automated accounts that generate and spread content on social\nmedia-are exploiting vulnerabilities in these platforms to manipulate public\nperception and disseminate disinformation. This has prompted the development of\npublic bot detection services; however, most of these services focus primarily\non Twitter, leaving niche platforms vulnerable. Fringe social media platforms\nsuch as Parler, Gab, and Gettr often have minimal moderation, which facilitates\nthe spread of hate speech and misinformation. To address this gap, we introduce\nEntendre, an open-access, scalable, and platform-agnostic bot detection\nframework. Entendre can process a labeled dataset from any social platform to\nproduce a tailored bot detection model using a random forest classification\napproach, ensuring robust social bot detection. We exploit the idea that most\nsocial platforms share a generic template, where users can post content,\napprove content, and provide a bio (common data features). By emphasizing\ngeneral data features over platform-specific ones, Entendre offers rapid\nextensibility at the expense of some accuracy. To demonstrate Entendre's\neffectiveness, we used it to explore the presence of bots among accounts\nposting racist content on the now-defunct right-wing platform Parler. We\nexamined 233,000 posts from 38,379 unique users and found that 1,916 unique\nusers (4.99%) exhibited bot-like behavior. Visualization techniques further\nrevealed that these bots significantly impacted the network, amplifying\ninfluential rhetoric and hashtags (e.g., #qanon, #trump, #antilgbt). These\npreliminary findings underscore the need for tools like Entendre to monitor and\nassess bot activity across diverse platforms.", "paper_summary_zh": "<paragraph>社交機器人（自動生成內容並在社交媒體上散布內容的自動帳戶）正在利用這些平台中的漏洞來操縱公眾認知並散布錯誤訊息。這促成了公共機器人偵測服務的開發；然而，這些服務大多主要關注 Twitter，讓利基平台容易受到攻擊。邊緣社交媒體平台，例如 Parler、Gab 和 Gettr 通常只有最少的審核，這促成了仇恨言論和錯誤訊息的散布。為了解決這個差距，我們引入了 Entendre，一個開放存取、可擴充且與平台無關的機器人偵測架構。Entendre 可以處理來自任何社交平台的標籤資料集，以使用隨機森林分類方法產生量身打造的機器人偵測模型，確保強大的社交機器人偵測。我們利用了大多數社交平台共用一個通用範本的想法，使用者可以在其中發布內容、核准內容並提供個人簡介（常見資料特徵）。透過強調一般資料特徵而非特定於平台的特徵，Entendre 以犧牲一些準確度為代價提供了快速的擴充性。為了展示 Entendre 的效能，我們使用它來探索現在已不存在的右翼平台 Parler 上發布種族主義內容的帳戶中的機器人存在。我們檢視了 38,379 個唯一使用者的 233,000 則貼文，發現 1,916 個唯一使用者（4.99%）表現出類似機器人的行為。視覺化技術進一步顯示這些機器人對網路產生了重大影響，擴大了有影響力的言論和標籤（例如，#qanon、#trump、#antilgbt）。這些初步發現強調了像 Entendre 這樣的工具在不同平台上監控和評估機器人活動的必要性。</paragraph>", "author": "Pranav Venkatesh et.al.", "authors": "Pranav Venkatesh, Kami Vinton, Dhiraj Murthy, Kellen Sharp, Akaash Kolluri", "id": "2408.06900v1", "paper_url": "http://arxiv.org/abs/2408.06900v1", "repo": "null"}}