{"2411.03012": {"publish_time": "2024-11-05", "title": "Leveraging Large Language Models in Code Question Answering: Baselines and Issues", "paper_summary": "Question answering over source code provides software engineers and project\nmanagers with helpful information about the implemented features of a software\nproduct. This paper presents a work devoted to using large language models for\nquestion answering over source code in Python. The proposed method for\nimplementing a source code question answering system involves fine-tuning a\nlarge language model on a unified dataset of questions and answers for Python\ncode. To achieve the highest quality answers, we tested various models trained\non datasets preprocessed in different ways: a dataset without grammar\ncorrection, a dataset with grammar correction, and a dataset augmented with the\ngenerated summaries. The model answers were also analyzed for errors manually.\nWe report BLEU-4, BERTScore F1, BLEURT, and Exact Match metric values, along\nwith the conclusions from the manual error analysis. The obtained experimental\nresults highlight the current problems of the research area, such as poor\nquality of the public genuine question-answering datasets. In addition, the\nfindings include the positive effect of the grammar correction of the training\ndata on the testing metric values. The addressed findings and issues could be\nimportant for other researchers who attempt to improve the quality of source\ncode question answering solutions. The training and evaluation code is publicly\navailable at https://github.com/IU-AES-AI4Code/CodeQuestionAnswering.", "paper_summary_zh": "<paragraph>透過原始碼進行問答，可為軟體工程師和專案經理提供有關軟體產品實作功能的實用資訊。本論文提出了一項致力於使用大型語言模型，針對 Python 中的原始碼進行問答的工作。實作原始碼問答系統的建議方法，包括針對 Python 程式碼的統一式問題和答案資料集，微調大型語言模型。為了獲得最高品質的答案，我們測試了在以不同方式預處理的資料集上訓練的各種模型：未經文法修正的資料集、已進行文法修正的資料集，以及透過產生的摘要增強的資料集。模型答案也經過人工分析錯誤。我們報告了 BLEU-4、BERTScore F1、BLEURT 和完全比對的指標值，以及人工錯誤分析的結論。獲得的實驗結果突顯了研究領域的現有問題，例如公開的真實問答資料集品質不佳。此外，研究結果包括訓練資料的文法修正對測試指標值的正面影響。所探討的研究結果和議題，對於嘗試改善原始碼問答解決方案品質的其他研究人員而言，可能非常重要。訓練和評估程式碼已公開於 https://github.com/IU-AES-AI4Code/CodeQuestionAnswering。</paragraph>", "author": "Georgy Andryushchenko et.al.", "authors": "Georgy Andryushchenko, Vladimir Ivanov, Vladimir Makharev, Elizaveta Tukhtina, Aidar Valeev", "id": "2411.03012v1", "paper_url": "http://arxiv.org/abs/2411.03012v1", "repo": "https://github.com/iu-aes-ai4code/codequestionanswering"}}