{"2410.07177": {"publish_time": "2024-10-09", "title": "MM-Ego: Towards Building Egocentric Multimodal LLMs", "paper_summary": "This research aims to comprehensively explore building a multimodal\nfoundation model for egocentric video understanding. To achieve this goal, we\nwork on three fronts. First, as there is a lack of QA data for egocentric video\nunderstanding, we develop a data engine that efficiently generates 7M\nhigh-quality QA samples for egocentric videos ranging from 30 seconds to one\nhour long, based on human-annotated data. This is currently the largest\negocentric QA dataset. Second, we contribute a challenging egocentric QA\nbenchmark with 629 videos and 7,026 questions to evaluate the models' ability\nin recognizing and memorizing visual details across videos of varying lengths.\nWe introduce a new de-biasing evaluation method to help mitigate the\nunavoidable language bias present in the models being evaluated. Third, we\npropose a specialized multimodal architecture featuring a novel \"Memory Pointer\nPrompting\" mechanism. This design includes a global glimpse step to gain an\noverarching understanding of the entire video and identify key visual\ninformation, followed by a fallback step that utilizes the key visual\ninformation to generate responses. This enables the model to more effectively\ncomprehend extended video content. With the data, benchmark, and model, we\nsuccessfully build MM-Ego, an egocentric multimodal LLM that shows powerful\nperformance on egocentric video understanding.", "paper_summary_zh": "本研究旨在全面探索建立一個用於以自我為中心影片理解的多模態基礎模型。為了達成此目標，我們在三個方面著手進行。首先，由於缺乏用於以自我為中心影片理解的問答資料，我們開發了一個資料引擎，可有效地為長度從 30 秒到一小時不等的以自我為中心影片生成 700 萬個高品質問答範例，這些範例是根據人工標註資料生成的。這目前是最龐大的以自我為中心問答資料集。其次，我們提供了一個具有挑戰性的以自我為中心問答基準，其中包含 629 部影片和 7,026 個問題，用於評估模型在辨識和記憶不同長度影片中視覺細節的能力。我們引入了一種新的去偏評估方法，以協助減輕模型評估中存在的不可避免的語言偏誤。第三，我們提出了一種特殊的多模態架構，其特色在於具備一種新穎的「記憶指標提示」機制。此設計包含一個整體概覽步驟，用於獲得對整個影片的全面理解並識別關鍵視覺資訊，接著是一個後備步驟，利用關鍵視覺資訊來產生回應。這使模型能夠更有效地理解延伸的影片內容。透過資料、基準和模型，我們成功建立了 MM-Ego，這是一個以自我為中心的多模態 LLM，在以自我為中心影片理解方面展現出強大的效能。", "author": "Hanrong Ye et.al.", "authors": "Hanrong Ye, Haotian Zhang, Erik Daxberger, Lin Chen, Zongyu Lin, Yanghao Li, Bowen Zhang, Haoxuan You, Dan Xu, Zhe Gan, Jiasen Lu, Yinfei Yang", "id": "2410.07177v1", "paper_url": "http://arxiv.org/abs/2410.07177v1", "repo": "null"}}