{"2410.02666": {"publish_time": "2024-10-03", "title": "AlphaIntegrator: Transformer Action Search for Symbolic Integration Proofs", "paper_summary": "We present the first correct-by-construction learning-based system for\nstep-by-step mathematical integration. The key idea is to learn a policy,\nrepresented by a GPT transformer model, which guides the search for the right\nmathematical integration rule, to be carried out by a symbolic solver.\nConcretely, we introduce a symbolic engine with axiomatically correct actions\non mathematical expressions, as well as the first dataset for step-by-step\nintegration. Our GPT-style transformer model, trained on this synthetic data,\ndemonstrates strong generalization by surpassing its own data generator in\naccuracy and efficiency, using 50% fewer search steps. Our experimental results\nwith SoTA LLMs also demonstrate that the standard approach of fine-tuning LLMs\non a set of question-answer pairs is insufficient for solving this mathematical\ntask. This motivates the importance of discovering creative methods for\ncombining LLMs with symbolic reasoning engines, of which our work is an\ninstance.", "paper_summary_zh": "我們提出了一個基於學習的第一個正確建構系統，用於逐步的數學積分。關鍵想法是學習一個策略，由 GPT 轉換器模型表示，它引導尋找正確的數學積分規則，由符號求解器執行。具體來說，我們引入了一個符號引擎，它對數學表達式具有公理上正確的動作，以及用於逐步積分的首個資料集。我們的 GPT 風格轉換器模型在這個合成資料上訓練，展示了強大的泛化能力，在準確度和效率上超越了自己的資料生成器，使用少 50% 的搜尋步驟。我們使用 SoTA LLM 的實驗結果也表明，在問題答案對上微調 LLM 的標準方法不足以解決這個數學任務。這激勵了發現將 LLM 與符號推理引擎相結合的創造性方法的重要性，其中我們的作品是一個實例。", "author": "Mert Ünsal et.al.", "authors": "Mert Ünsal, Timon Gehr, Martin Vechev", "id": "2410.02666v1", "paper_url": "http://arxiv.org/abs/2410.02666v1", "repo": "null"}}