{"2406.09290": {"publish_time": "2024-06-13", "title": "Exploring Spoken Language Identification Strategies for Automatic Transcription of Multilingual Broadcast and Institutional Speech", "paper_summary": "This paper addresses spoken language identification (SLI) and speech\nrecognition of multilingual broadcast and institutional speech, real\napplication scenarios that have been rarely addressed in the SLI literature.\nObserving that in these domains language changes are mostly associated with\nspeaker changes, we propose a cascaded system consisting of speaker diarization\nand language identification and compare it with more traditional language\nidentification and language diarization systems. Results show that the proposed\nsystem often achieves lower language classification and language diarization\nerror rates (up to 10% relative language diarization error reduction and 60%\nrelative language confusion reduction) and leads to lower WERs on multilingual\ntest sets (more than 8% relative WER reduction), while at the same time does\nnot negatively affect speech recognition on monolingual audio (with an absolute\nWER increase between 0.1% and 0.7% w.r.t. monolingual ASR).", "paper_summary_zh": "本文探討多語廣播和機構演講的口語辨識 (SLI) 和語音辨識，這些是 SLI 文獻中鮮少探討的實際應用場景。觀察到在這些領域中，語言變換大多與說話者變換有關，我們提出一個由說話者區分和語言辨識組成的串聯系統，並將其與更傳統的語言辨識和語言區分系統進行比較。結果顯示，所提出的系統通常能達到較低的語言分類和語言區分錯誤率（相對語言區分錯誤率降低多達 10%，相對語言混淆減少 60%），並在多語測試集中產生較低的 WER（相對 WER 降低超過 8%），同時不會對單語音訊的語音辨識產生負面影響（相較於單語音訊 ASR，絕對 WER 增加在 0.1% 到 0.7% 之間）。", "author": "Martina Valente et.al.", "authors": "Martina Valente, Fabio Brugnara, Giovanni Morrone, Enrico Zovato, Leonardo Badino", "id": "2406.09290v1", "paper_url": "http://arxiv.org/abs/2406.09290v1", "repo": "null"}}