{"2410.11239": {"publish_time": "2024-10-15", "title": "HR-Agent: A Task-Oriented Dialogue (TOD) LLM Agent Tailored for HR Applications", "paper_summary": "Recent LLM (Large Language Models) advancements benefit many fields such as\neducation and finance, but HR has hundreds of repetitive processes, such as\naccess requests, medical claim filing and time-off submissions, which are\nunaddressed. We relate these tasks to the LLM agent, which has addressed tasks\nsuch as writing assisting and customer support. We present HR-Agent, an\nefficient, confidential, and HR-specific LLM-based task-oriented dialogue\nsystem tailored for automating repetitive HR processes such as medical claims\nand access requests. Since conversation data is not sent to an LLM during\ninference, it preserves confidentiality required in HR-related tasks.", "paper_summary_zh": "近期的 LLM（大型语言模型）进步惠及了许多领域，例如教育和金融，但人力资源有数百个重复性的流程，例如存取要求、医疗索赔申报和休假提交，这些问题尚未解决。我们将这些任务与 LLM 代理联系起来，该代理已解决诸如写作辅助和客户支持之类的任务。我们提出 HR-Agent，这是一个高效、保密且针对人力资源的特定 LLM 为基础的任务导向对话系统，专为自动化重复性人力资源流程（例如医疗索赔和存取请求）而设计。由于对话数据在推理过程中不会发送到 LLM，因此它保留了人力资源相关任务所需的机密性。", "author": "Weijie Xu et.al.", "authors": "Weijie Xu, Jay Desai, Fanyou Wu, Josef Valvoda, Srinivasan H. Sengamedu", "id": "2410.11239v1", "paper_url": "http://arxiv.org/abs/2410.11239v1", "repo": "null"}}