{"2502.02225": {"publish_time": "2025-02-04", "title": "Exploring the latent space of diffusion models directly through singular value decomposition", "paper_summary": "Despite the groundbreaking success of diffusion models in generating\nhigh-fidelity images, their latent space remains relatively under-explored,\neven though it holds significant promise for enabling versatile and\ninterpretable image editing capabilities. The complicated denoising trajectory\nand high dimensionality of the latent space make it extremely challenging to\ninterpret. Existing methods mainly explore the feature space of U-Net in\nDiffusion Models (DMs) instead of the latent space itself. In contrast, we\ndirectly investigate the latent space via Singular Value Decomposition (SVD)\nand discover three useful properties that can be used to control generation\nresults without the requirements of data collection and maintain identity\nfidelity generated images. Based on these properties, we propose a novel image\nediting framework that is capable of learning arbitrary attributes from one\npair of latent codes destined by text prompts in Stable Diffusion Models. To\nvalidate our approach, extensive experiments are conducted to demonstrate its\neffectiveness and flexibility in image editing. We will release our codes soon\nto foster further research and applications in this area.", "paper_summary_zh": "儘管擴散模型在生成高保真影像方面取得了突破性的成功，但其潛在空間仍相對未被充分探索，儘管它對於實現多功能且可詮釋的影像編輯功能具有顯著的潛力。複雜的去噪軌跡和潛在空間的高維度使其極難詮釋。現有方法主要探索擴散模型 (DM) 中 U-Net 的特徵空間，而不是潛在空間本身。相比之下，我們透過奇異值分解 (SVD) 直接研究潛在空間，並發現三個有用的屬性，可用於控制生成結果，而無需收集資料和維護身分保真度所生成的影像。根據這些屬性，我們提出一個新穎的影像編輯架構，它能夠從 Stable Diffusion Models 中由文字提示註定的成對潛在碼中學習任意屬性。為了驗證我們的做法，進行了廣泛的實驗以證明其在影像編輯中的有效性和靈活性。我們將很快發布我們的程式碼，以促進在這個領域的進一步研究和應用。", "author": "Li Wang et.al.", "authors": "Li Wang, Boyan Gao, Yanran Li, Zhao Wang, Xiaosong Yang, David A. Clifton, Jun Xiao", "id": "2502.02225v1", "paper_url": "http://arxiv.org/abs/2502.02225v1", "repo": "null"}}