{"2411.09968": {"publish_time": "2024-11-15", "title": "Seeing Clearly by Layer Two: Enhancing Attention Heads to Alleviate Hallucination in LVLMs", "paper_summary": "The hallucination problem in multimodal large language models (MLLMs) remains\na common issue. Although image tokens occupy a majority of the input sequence\nof MLLMs, there is limited research to explore the relationship between image\ntokens and hallucinations. In this paper, we analyze the distribution of\nattention scores for image tokens across each layer and head of the model,\nrevealing an intriguing and common phenomenon: most hallucinations are closely\nlinked to the pattern of attention sinks in the self-attention matrix of image\ntokens, where shallow layers exhibit dense attention sinks and deeper layers\nshow sparse attention sinks. We further analyze the attention heads of\ndifferent layers and find that heads with high-density attention sink in the\nimage part play a positive role in alleviating hallucinations. In this paper,\nwe propose a training-free method named \\textcolor{red}{\\textbf{E}}nhancing\n\\textcolor{red}{\\textbf{A}}ttention \\textcolor{red}{\\textbf{H}}eads (EAH), an\napproach designed to enhance the convergence of image tokens attention sinks in\nthe shallow layers. EAH identifies the attention head that shows the vision\nsink in a shallow layer and extracts its attention matrix. This attention map\nis then broadcast to other heads in the layer, thereby strengthening the layer\nto pay more attention to the image itself. With extensive experiments, EAH\nshows significant hallucination-mitigating performance on different MLLMs and\nmetrics, proving its effectiveness and generality.", "paper_summary_zh": "多模态大型语言模型 (MLLM) 中的幻觉问题仍然是一个常见问题。尽管图像标记占据了 MLLM 输入序列的大部分，但探索图像标记和幻觉之间关系的研究却很有限。在本文中，我们分析了跨模型的每一层和头的图像标记的注意力分数分布，揭示了一个有趣且普遍的现象：大多数幻觉与图像标记的自注意力矩阵中的注意力汇聚模式密切相关，其中浅层表现出密集的注意力汇聚，而深层表现出稀疏的注意力汇聚。我们进一步分析了不同层的注意力头，发现图像部分中具有高密度注意力汇聚的注意力头在减轻幻觉中起到了积极作用。在本文中，我们提出了一种名为\\textcolor{red}{\\textbf{E}}nhancing \\textcolor{red}{\\textbf{A}}ttention \\textcolor{red}{\\textbf{H}}eads (EAH) 的免训练方法，这是一种旨在增强浅层中图像标记注意力汇聚收敛性的方法。EAH 识别出在浅层中显示视觉汇聚的注意力头并提取其注意力矩阵。然后将此注意力图广播到层中的其他头，从而增强该层对图像本身的关注。通过广泛的实验，EAH 在不同的 MLLM 和指标上显示出显着的缓解幻觉的性能，证明了其有效性和普遍性。", "author": "Xiaofeng Zhang et.al.", "authors": "Xiaofeng Zhang, Yihao Quan, Chaochen Gu, Chen Shen, Xiaosong Yuan, Shaotian Yan, Hao Cheng, Kaijie Wu, Jieping Ye", "id": "2411.09968v1", "paper_url": "http://arxiv.org/abs/2411.09968v1", "repo": "null"}}