{"2501.09214": {"publish_time": "2025-01-16", "title": "Boosting Short Text Classification with Multi-Source Information Exploration and Dual-Level Contrastive Learning", "paper_summary": "Short text classification, as a research subtopic in natural language\nprocessing, is more challenging due to its semantic sparsity and insufficient\nlabeled samples in practical scenarios. We propose a novel model named\nMI-DELIGHT for short text classification in this work. Specifically, it first\nperforms multi-source information (i.e., statistical information, linguistic\ninformation, and factual information) exploration to alleviate the sparsity\nissues. Then, the graph learning approach is adopted to learn the\nrepresentation of short texts, which are presented in graph forms. Moreover, we\nintroduce a dual-level (i.e., instance-level and cluster-level) contrastive\nlearning auxiliary task to effectively capture different-grained contrastive\ninformation within massive unlabeled data. Meanwhile, previous models merely\nperform the main task and auxiliary tasks in parallel, without considering the\nrelationship among tasks. Therefore, we introduce a hierarchical architecture\nto explicitly model the correlations between tasks. We conduct extensive\nexperiments across various benchmark datasets, demonstrating that MI-DELIGHT\nsignificantly surpasses previous competitive models. It even outperforms\npopular large language models on several datasets.", "paper_summary_zh": "短文本分類作為自然語言處理的研究子主題，由於其語義稀疏性和實際場景中標記樣本不足，因此更具挑戰性。在這項工作中，我們提出了一個名為 MI-DELIGHT 的新模型，用於短文本分類。具體來說，它首先執行多源信息（即統計信息、語言信息和事實信息）探索，以緩解稀疏性問題。然後，採用圖學習方法來學習以圖表形式呈現的短文本的表示。此外，我們引入了一個雙層級（即實例層級和群集層級）對比學習輔助任務，以有效捕獲大量未標記數據中的不同粒度對比信息。同時，以前的模型僅並行執行主任務和輔助任務，而沒有考慮任務之間的關係。因此，我們引入了一個分層架構來明確建模任務之間的相關性。我們在各種基準數據集上進行了廣泛的實驗，證明 MI-DELIGHT 明顯優於以前的競爭模型。它甚至在幾個數據集上優於流行的大語言模型。", "author": "Yonghao Liu et.al.", "authors": "Yonghao Liu, Mengyu Li, Wei Pang, Fausto Giunchiglia, Lan Huang, Xiaoyue Feng, Renchu Guan", "id": "2501.09214v1", "paper_url": "http://arxiv.org/abs/2501.09214v1", "repo": "https://github.com/keaml-jlu/mi-delight"}}