{"2405.03305": {"publish_time": "2024-05-06", "title": "Artificial Intelligence in the Autonomous Navigation of Endovascular Interventions: A Systematic Review", "paper_summary": "Purpose: Autonomous navigation of devices in endovascular interventions can\ndecrease operation times, improve decision-making during surgery, and reduce\noperator radiation exposure while increasing access to treatment. This\nsystematic review explores recent literature to assess the impact, challenges,\nand opportunities artificial intelligence (AI) has for the autonomous\nendovascular intervention navigation.\n  Methods: PubMed and IEEEXplore databases were queried. Eligibility criteria\nincluded studies investigating the use of AI in enabling the autonomous\nnavigation of catheters/guidewires in endovascular interventions. Following\nPRISMA, articles were assessed using QUADAS-2. PROSPERO: CRD42023392259.\n  Results: Among 462 studies, fourteen met inclusion criteria. Reinforcement\nlearning (9/14, 64%) and learning from demonstration (7/14, 50%) were used as\ndata-driven models for autonomous navigation. Studies predominantly utilised\nphysical phantoms (10/14, 71%) and in silico (4/14, 29%) models. Experiments\nwithin or around the blood vessels of the heart were reported by the majority\nof studies (10/14, 71%), while simple non-anatomical vessel platforms were used\nin three studies (3/14, 21%), and the porcine liver venous system in one study.\nWe observed that risk of bias and poor generalisability were present across\nstudies. No procedures were performed on patients in any of the studies\nreviewed. Studies lacked patient selection criteria, reference standards, and\nreproducibility, resulting in low clinical evidence levels.\n  Conclusions: AI's potential in autonomous endovascular navigation is\npromising, but in an experimental proof-of-concept stage, with a technology\nreadiness level of 3. We highlight that reference standards with\nwell-identified performance metrics are crucial to allow for comparisons of\ndata-driven algorithms proposed in the years to come.", "paper_summary_zh": "<paragraph>目的：設備在血管內介入手術中的自主導航可以\n減少手術時間、改善手術中的決策制定，並在增加治療機會的同時減少\n操作者輻射暴露。這項系統性回顧探討了近期文獻，以評估人工智慧 (AI) 對自主\n血管內介入導航的影響、挑戰和機會。\n方法：查詢了 PubMed 和 IEEEXplore 資料庫。資格標準\n包括探討使用 AI 在血管內介入手術中實現導管/導絲自主導航的研究。按照\nPRISMA，使用 QUADAS-2 評估文章。PROSPERO：CRD42023392259。\n結果：在 462 項研究中，有 14 項符合納入標準。強化\n學習 (9/14, 64%) 和從示範中學習 (7/14, 50%) 被用作自主導航的數據驅動模型。研究主要利用\n物理模擬人 (10/14, 71%) 和電腦模擬 (4/14, 29%) 模型。大多數\n研究報告了在心臟血管內或周圍進行的實驗 (10/14, 71%)，而三項研究 (3/14, 21%) 使用了簡單的非解剖血管平台，一項研究使用了豬肝靜脈系統。\n我們觀察到研究中存在偏見風險和普遍性差的問題。在任何已審查的研究中，均未對患者執行任何程序。研究缺乏患者選擇標準、參考標準和\n可重複性，導致臨床證據等級低。\n結論：AI 在自主血管內導航中的潛力很有希望，但處於實驗性的概念驗證階段，技術\n準備級別為 3。我們強調，具有明確識別的性能指標的參考標準對於允許比較\n未來幾年提出的數據驅動演算法至關重要。</paragraph>", "author": "Harry Robertshaw et.al.", "authors": "Harry Robertshaw, Lennart Karstensen, Benjamin Jackson, Hadi Sadati, Kawal Rhode, Sebastien Ourselin, Alejandro Granados, Thomas C Booth", "id": "2405.03305v1", "paper_url": "http://arxiv.org/abs/2405.03305v1", "repo": "null"}}