{"2405.03305": {"publish_time": "2024-05-06", "title": "Artificial Intelligence in the Autonomous Navigation of Endovascular Interventions: A Systematic Review", "paper_summary": "Purpose: Autonomous navigation of devices in endovascular interventions can\ndecrease operation times, improve decision-making during surgery, and reduce\noperator radiation exposure while increasing access to treatment. This\nsystematic review explores recent literature to assess the impact, challenges,\nand opportunities artificial intelligence (AI) has for the autonomous\nendovascular intervention navigation.\n  Methods: PubMed and IEEEXplore databases were queried. Eligibility criteria\nincluded studies investigating the use of AI in enabling the autonomous\nnavigation of catheters/guidewires in endovascular interventions. Following\nPRISMA, articles were assessed using QUADAS-2. PROSPERO: CRD42023392259.\n  Results: Among 462 studies, fourteen met inclusion criteria. Reinforcement\nlearning (9/14, 64%) and learning from demonstration (7/14, 50%) were used as\ndata-driven models for autonomous navigation. Studies predominantly utilised\nphysical phantoms (10/14, 71%) and in silico (4/14, 29%) models. Experiments\nwithin or around the blood vessels of the heart were reported by the majority\nof studies (10/14, 71%), while simple non-anatomical vessel platforms were used\nin three studies (3/14, 21%), and the porcine liver venous system in one study.\nWe observed that risk of bias and poor generalisability were present across\nstudies. No procedures were performed on patients in any of the studies\nreviewed. Studies lacked patient selection criteria, reference standards, and\nreproducibility, resulting in low clinical evidence levels.\n  Conclusions: AI's potential in autonomous endovascular navigation is\npromising, but in an experimental proof-of-concept stage, with a technology\nreadiness level of 3. We highlight that reference standards with\nwell-identified performance metrics are crucial to allow for comparisons of\ndata-driven algorithms proposed in the years to come.", "paper_summary_zh": "", "author": "Harry Robertshaw et.al.", "authors": "Harry Robertshaw,Lennart Karstensen,Benjamin Jackson,Hadi Sadati,Kawal Rhode,Sebastien Ourselin,Alejandro Granados,Thomas C Booth", "id": "2405.03305v1", "paper_url": "http://arxiv.org/abs/2405.03305v1", "repo": "null"}}