{"2410.02683": {"publish_time": "2024-10-03", "title": "DailyDilemmas: Revealing Value Preferences of LLMs with Quandaries of Daily Life", "paper_summary": "As we increasingly seek guidance from LLMs for decision-making in daily life,\nmany of these decisions are not clear-cut and depend significantly on the\npersonal values and ethical standards of the users. We present DailyDilemmas, a\ndataset of 1,360 moral dilemmas encountered in everyday life. Each dilemma\nincludes two possible actions and with each action, the affected parties and\nhuman values invoked. Based on these dilemmas, we consolidated a set of human\nvalues across everyday topics e.g., interpersonal relationships, workplace, and\nenvironmental issues. We evaluated LLMs on these dilemmas to determine what\naction they will take and the values represented by these actions. Then, we\nanalyzed these values through the lens of five popular theories inspired by\nsociology, psychology and philosophy. These theories are: World Value Survey,\nMoral Foundation Theory, Maslow's Hierarchy of Needs, Aristotle's Virtues, and\nPlutchik Wheel of Emotion. We find that LLMs are most aligned with the\nself-expression over survival values in terms of World Value Survey, care over\nloyalty in Moral Foundation Theory. Interestingly, we find large preferences\ndifferences in models for some core values such as truthfulness e.g.,\nMixtral-8x7B model tends to neglect it by 9.7% while GPT-4-turbo model tends to\nselect it by 9.4%. We also study the recent guidance released by OpenAI\n(ModelSpec), and Anthropic (Constitutional AI) to understand how their released\nprinciples reflect their actual value prioritization when facing nuanced moral\nreasoning in daily-life settings. We find that end users cannot effectively\nsteer such prioritization using system prompts.", "paper_summary_zh": "<paragraph>隨著我們在日常生活中越來越依賴 LLM 來進行決策，\n其中許多決策並非明確，而且在很大程度上取決於\n使用者的個人價值觀和道德標準。我們提出了日常困境，一個\n在日常生活中遇到的 1,360 個道德困境的數據集。每個困境\n包含兩個可能的行動，並針對每個行動，受到影響的各方和\n引發的人類價值觀。根據這些困境，我們彙整了一組人類\n價值觀，涵蓋日常主題，例如人際關係、職場和\n環境問題。我們針對這些困境評估 LLM，以確定它們將採取什麼\n行動以及這些行動所代表的價值觀。接著，我們\n透過社會學、心理學和哲學啟發的五種流行理論來分析這些價值觀。這些理論為：世界價值觀調查、\n道德基礎理論、馬斯洛需求層次理論、亞里斯多德美德，以及\n普拉契克情緒之輪。我們發現 LLM 在世界價值觀調查中與\n生存價值觀相比，更傾向於自我表達；在道德基礎理論中，更傾向於關懷而非忠誠。有趣的是，我們發現對於某些核心價值觀，例如誠實，不同模型之間存在很大的偏好差異，例如，\nMixtral-8x7B 模型傾向於忽略它 9.7%，而 GPT-4-turbo 模型傾向於選擇它 9.4%。我們還研究了 OpenAI\n(ModelSpec) 和 Anthropic (Constitutional AI) 最近發布的指導方針，以了解他們發布的原則如何在面對日常生活中微妙的道德推理時反映他們的實際價值優先順序。我們發現，最終使用者無法有效地\n使用系統提示來引導此類優先順序。</paragraph>", "author": "Yu Ying Chiu et.al.", "authors": "Yu Ying Chiu, Liwei Jiang, Yejin Choi", "id": "2410.02683v1", "paper_url": "http://arxiv.org/abs/2410.02683v1", "repo": "null"}}