{"2406.16356": {"publish_time": "2024-06-24", "title": "Evaluation of Instruction-Following Ability for Large Language Models on Story-Ending Generation", "paper_summary": "Instruction-tuned Large Language Models (LLMs) have achieved remarkable\nperformance across various benchmark tasks. While providing instructions to\nLLMs for guiding their generations is user-friendly, assessing their\ninstruction-following capabilities is still unclarified due to a lack of\nevaluation metrics. In this paper, we focus on evaluating the\ninstruction-following ability of LLMs in the context of story-ending\ngeneration, which requires diverse and context-specific instructions. We\npropose an automatic evaluation pipeline that utilizes a machine reading\ncomprehension (MRC) model to determine whether the generated story-ending\nreflects instruction. Our findings demonstrate that our proposed metric aligns\nwith human evaluation. Furthermore, our experiments confirm that recent\nopen-source LLMs can achieve instruction-following performance close to\nGPT-3.5, as assessed through automatic evaluation.", "paper_summary_zh": "指令調整大型語言模型 (LLM) 在各種基準任務中取得顯著的表現。雖然向 LLM 提供指令以指導其生成對使用者來說很友善，但由於缺乏評估指標，評估其指令遵循能力仍然不明確。在本文中，我們專注於評估 LLM 在故事結尾生成情境中的指令遵循能力，這需要多樣化且特定於情境的指令。我們提出一個自動評估管道，利用機器閱讀理解 (MRC) 模型來確定生成的故事情節是否反映指令。我們的發現證明我們提出的指標與人類評估一致。此外，我們的實驗確認最近的開源 LLM 可以實現接近 GPT-3.5 的指令遵循效能，這是透過自動評估來評估的。", "author": "Rem Hida et.al.", "authors": "Rem Hida, Junki Ohmura, Toshiyuki Sekiya", "id": "2406.16356v1", "paper_url": "http://arxiv.org/abs/2406.16356v1", "repo": "null"}}