{"2411.14827": {"publish_time": "2024-11-22", "title": "Physically Interpretable Probabilistic Domain Characterization", "paper_summary": "Characterizing domains is essential for models analyzing dynamic\nenvironments, as it allows them to adapt to evolving conditions or to hand the\ntask over to backup systems when facing conditions outside their operational\ndomain. Existing solutions typically characterize a domain by solving a\nregression or classification problem, which limits their applicability as they\nonly provide a limited summarized description of the domain. In this paper, we\npresent a novel approach to domain characterization by characterizing domains\nas probability distributions. Particularly, we develop a method to predict the\nlikelihood of different weather conditions from images captured by\nvehicle-mounted cameras by estimating distributions of physical parameters\nusing normalizing flows. To validate our proposed approach, we conduct\nexperiments within the context of autonomous vehicles, focusing on predicting\nthe distribution of weather parameters to characterize the operational domain.\nThis domain is characterized by physical parameters (absolute characterization)\nand arbitrarily predefined domains (relative characterization). Finally, we\nevaluate whether a system can safely operate in a target domain by comparing it\nto multiple source domains where safety has already been established. This\napproach holds significant potential, as accurate weather prediction and\neffective domain adaptation are crucial for autonomous systems to adjust to\ndynamic environmental conditions.", "paper_summary_zh": "描述領域對於分析動態環境的模型來說至關重要，因為它允許模型適應不斷變化的條件，或在面對運作領域之外的條件時將任務移交給備份系統。現有的解決方案通常透過解決回歸或分類問題來描述領域，這會限制它們的適用性，因為它們只提供領域的有限摘要描述。在本文中，我們提出了一種新的領域描述方法，將領域描述為機率分佈。特別是，我們開發了一種方法，透過估計使用正規化流的物理參數分佈，從車載相機拍攝的影像預測不同天氣條件發生的機率。為了驗證我們提出的方法，我們在自動駕駛車輛的背景下進行實驗，重點在於預測天氣參數的分佈以描述運作領域。此領域的特徵在於物理參數（絕對描述）和任意預定義的領域（相對描述）。最後，我們評估系統是否可以在目標領域中安全地運作，方法是將其與已經建立安全性的多個來源領域進行比較。這種方法具有重要的潛力，因為準確的天氣預測和有效的領域適應對於自動系統適應動態環境條件至關重要。", "author": "Anaïs Halin et.al.", "authors": "Anaïs Halin, Sébastien Piérard, Renaud Vandeghen, Benoît Gérin, Maxime Zanella, Martin Colot, Jan Held, Anthony Cioppa, Emmanuel Jean, Gianluca Bontempi, Saïd Mahmoudi, Benoît Macq, Marc Van Droogenbroeck", "id": "2411.14827v1", "paper_url": "http://arxiv.org/abs/2411.14827v1", "repo": "null"}}