{"2411.07595": {"publish_time": "2024-11-12", "title": "Entropy Controllable Direct Preference Optimization", "paper_summary": "In the post-training of large language models (LLMs), Reinforcement Learning\nfrom Human Feedback (RLHF) is an effective approach to achieve generation\naligned with human preferences. Direct Preference Optimization (DPO) allows for\npolicy training with a simple binary cross-entropy loss without a reward model.\nThe objective of DPO is regularized by reverse KL divergence that encourages\nmode-seeking fitting to the reference policy. Nonetheless, we indicate that\nminimizing reverse KL divergence could fail to capture a mode of the reference\ndistribution, which may hurt the policy's performance. Based on this\nobservation, we propose a simple modification to DPO, H-DPO, which allows for\ncontrol over the entropy of the resulting policy, enhancing the distribution's\nsharpness and thereby enabling mode-seeking fitting more effectively. In our\nexperiments, we show that H-DPO outperformed DPO across various tasks,\ndemonstrating superior results in pass@$k$ evaluations for mathematical tasks.\nMoreover, H-DPO is simple to implement, requiring only minor modifications to\nthe loss calculation of DPO, which makes it highly practical and promising for\nwide-ranging applications in the training of LLMs.", "paper_summary_zh": "在大語言模型 (LLM) 的後訓練中，來自人類回饋的強化學習 (RLHF) 是一種有效的方法，可以實現與人類偏好一致的生成。直接偏好最佳化 (DPO) 允許使用簡單的二元交叉熵損失進行政策訓練，而無需獎勵模型。DPO 的目標通過反向 KL 散度進行規範化，這鼓勵尋求模式以符合參考政策。儘管如此，我們指出，最小化反向 KL 散度可能無法捕捉參考分佈的模式，這可能會損害政策的效能。基於此觀察，我們建議對 DPO 進行一個簡單的修改，H-DPO，它允許控制結果政策的熵，增強分佈的清晰度，從而更有效地實現尋求模式的擬合。在我們的實驗中，我們表明 H-DPO 在各種任務中都優於 DPO，在數學任務的 pass@$k$ 評估中展示了優異的結果。此外，H-DPO 實現起來很簡單，只需要對 DPO 的損失計算進行微小的修改，這使得它在 LLM 訓練的廣泛應用中具有高度實用性和前景。", "author": "Motoki Omura et.al.", "authors": "Motoki Omura, Yasuhiro Fujita, Toshiki Kataoka", "id": "2411.07595v1", "paper_url": "http://arxiv.org/abs/2411.07595v1", "repo": "null"}}