{"2408.03632": {"publish_time": "2024-08-07", "title": "Concept Conductor: Orchestrating Multiple Personalized Concepts in Text-to-Image Synthesis", "paper_summary": "The customization of text-to-image models has seen significant advancements,\nyet generating multiple personalized concepts remains a challenging task.\nCurrent methods struggle with attribute leakage and layout confusion when\nhandling multiple concepts, leading to reduced concept fidelity and semantic\nconsistency. In this work, we introduce a novel training-free framework,\nConcept Conductor, designed to ensure visual fidelity and correct layout in\nmulti-concept customization. Concept Conductor isolates the sampling processes\nof multiple custom models to prevent attribute leakage between different\nconcepts and corrects erroneous layouts through self-attention-based spatial\nguidance. Additionally, we present a concept injection technique that employs\nshape-aware masks to specify the generation area for each concept. This\ntechnique injects the structure and appearance of personalized concepts through\nfeature fusion in the attention layers, ensuring harmony in the final image.\nExtensive qualitative and quantitative experiments demonstrate that Concept\nConductor can consistently generate composite images with accurate layouts\nwhile preserving the visual details of each concept. Compared to existing\nbaselines, Concept Conductor shows significant performance improvements. Our\nmethod supports the combination of any number of concepts and maintains high\nfidelity even when dealing with visually similar concepts. The code and models\nare available at https://github.com/Nihukat/Concept-Conductor.", "paper_summary_zh": "文字轉圖像模型的客製化已取得顯著進展，\n但產生多個個人化概念仍然是一項具有挑戰性的任務。\n現有方法在處理多個概念時會出現屬性外洩和版面混淆的問題，導致概念保真度降低和語義一致性。在這項工作中，我們引入了一個新穎的無訓練框架，概念指揮器，旨在確保多概念客製化中的視覺保真度和正確版面。概念指揮器隔離多個自訂模型的取樣過程，以防止不同概念之間的屬性外洩，並透過基於自我注意力的空間引導來修正錯誤的版面。此外，我們提出了一種概念注入技術，採用形狀感知遮罩來指定每個概念的生成區域。此技術透過注意層中的特徵融合來注入個人化概念的結構和外觀，確保最終影像的和諧。廣泛的定性和定量實驗證明，概念指揮器可以持續產生具有準確版面且保留每個概念視覺細節的複合影像。與現有的基線相比，概念指揮器顯示出顯著的效能提升。我們的模型支援任意數量的概念組合，即使在處理視覺上相似的概念時也能維持高保真度。程式碼和模型可在 https://github.com/Nihukat/Concept-Conductor 取得。", "author": "Zebin Yao et.al.", "authors": "Zebin Yao, Fangxiang Feng, Ruifan Li, Xiaojie Wang", "id": "2408.03632v1", "paper_url": "http://arxiv.org/abs/2408.03632v1", "repo": "null"}}