{"2411.07099": {"publish_time": "2024-11-11", "title": "Bounded Rationality Equilibrium Learning in Mean Field Games", "paper_summary": "Mean field games (MFGs) tractably model behavior in large agent populations.\nThe literature on learning MFG equilibria typically focuses on finding Nash\nequilibria (NE), which assume perfectly rational agents and are hence\nimplausible in many realistic situations. To overcome these limitations, we\nincorporate bounded rationality into MFGs by leveraging the well-known concept\nof quantal response equilibria (QRE). Two novel types of MFG QRE enable the\nmodeling of large agent populations where individuals only noisily estimate the\ntrue objective. We also introduce a second source of bounded rationality to\nMFGs by restricting agents' planning horizon. The resulting novel receding\nhorizon (RH) MFGs are combined with QRE and existing approaches to model\ndifferent aspects of bounded rationality in MFGs. We formally define MFG QRE\nand RH MFGs and compare them to existing equilibrium concepts such as\nentropy-regularized NE. Subsequently, we design generalized fixed point\niteration and fictitious play algorithms to learn QRE and RH equilibria. After\na theoretical analysis, we give different examples to evaluate the capabilities\nof our learning algorithms and outline practical differences between the\nequilibrium concepts.", "paper_summary_zh": "平均場博弈（MFG）可以追蹤大量代理人口的行為。\n學習 MFG 均衡的文獻通常著重於尋找納許均衡（NE），它假設代理人完全理性，因此在許多現實情況下是不合理的。為了克服這些限制，我們透過利用著名的分位數反應均衡（QRE）概念，將受限理性納入 MFG 中。兩種新穎的 MFG QRE 類型可以對大型代理人口進行建模，其中個體僅對真實目標進行雜訊估計。我們還透過限制代理人的規劃時域，在 MFG 中引入第二個受限理性來源。由此產生的新穎後退時域（RH）MFG 與 QRE 和現有方法相結合，以對 MFG 中受限理性的不同面向進行建模。我們正式定義 MFG QRE 和 RH MFG，並將它們與現有的均衡概念（例如熵正則化 NE）進行比較。隨後，我們設計了廣義不動點迭代和虛構博弈演算法來學習 QRE 和 RH 均衡。在進行理論分析後，我們舉出不同的範例來評估我們學習演算法的能力，並概述均衡概念之間的實際差異。", "author": "Yannick Eich et.al.", "authors": "Yannick Eich, Christian Fabian, Kai Cui, Heinz Koeppl", "id": "2411.07099v1", "paper_url": "http://arxiv.org/abs/2411.07099v1", "repo": "null"}}