{"2410.08182": {"publish_time": "2024-10-10", "title": "MRAG-Bench: Vision-Centric Evaluation for Retrieval-Augmented Multimodal Models", "paper_summary": "Existing multimodal retrieval benchmarks primarily focus on evaluating\nwhether models can retrieve and utilize external textual knowledge for question\nanswering. However, there are scenarios where retrieving visual information is\neither more beneficial or easier to access than textual data. In this paper, we\nintroduce a multimodal retrieval-augmented generation benchmark, MRAG-Bench, in\nwhich we systematically identify and categorize scenarios where visually\naugmented knowledge is better than textual knowledge, for instance, more images\nfrom varying viewpoints. MRAG-Bench consists of 16,130 images and 1,353\nhuman-annotated multiple-choice questions across 9 distinct scenarios. With\nMRAG-Bench, we conduct an evaluation of 10 open-source and 4 proprietary large\nvision-language models (LVLMs). Our results show that all LVLMs exhibit greater\nimprovements when augmented with images compared to textual knowledge,\nconfirming that MRAG-Bench is vision-centric. Additionally, we conduct\nextensive analysis with MRAG-Bench, which offers valuable insights into\nretrieval-augmented LVLMs. Notably, the top-performing model, GPT-4o, faces\nchallenges in effectively leveraging retrieved knowledge, achieving only a\n5.82% improvement with ground-truth information, in contrast to a 33.16%\nimprovement observed in human participants. These findings highlight the\nimportance of MRAG-Bench in encouraging the community to enhance LVLMs' ability\nto utilize retrieved visual knowledge more effectively.", "paper_summary_zh": "現有的多模態檢索基準主要集中在評估模型是否能檢索和利用外部文本知識來回答問題。然而，在某些情況下，檢索視覺資訊比檢索文字資料更有利或更容易。在本文中，我們引進了一個多模態檢索增強生成基準 MRAG-Bench，其中我們系統性地找出並分類出視覺增強知識優於文字知識的情況，例如更多來自不同視角的影像。MRAG-Bench 包含 16,130 張影像和 1,353 個由人類註解的多重選擇題，涵蓋 9 種不同的情況。透過 MRAG-Bench，我們對 10 個開源和 4 個專有的大型視覺語言模型 (LVLMs) 進行評估。我們的結果顯示，所有 LVLMs 在加入影像後都展現出比加入文字知識時更大的進步，證實 MRAG-Bench 以視覺為中心。此外，我們使用 MRAG-Bench 進行廣泛的分析，這提供了有價值的見解，讓我們深入了解檢索增強 LVLMs。值得注意的是，表現最佳的模型 GPT-4o 在有效利用檢索到的知識方面面臨挑戰，僅獲得 5.82% 的真實資訊進步，與人類參與者觀察到的 33.16% 進步形成對比。這些發現突顯了 MRAG-Bench 的重要性，它鼓勵社群提升 LVLMs 更有效地利用檢索到的視覺知識的能力。", "author": "Wenbo Hu et.al.", "authors": "Wenbo Hu, Jia-Chen Gu, Zi-Yi Dou, Mohsen Fayyaz, Pan Lu, Kai-Wei Chang, Nanyun Peng", "id": "2410.08182v1", "paper_url": "http://arxiv.org/abs/2410.08182v1", "repo": "null"}}