{"2405.09444": {"publish_time": "2024-05-15", "title": "Desk-AId: Humanitarian Aid Desk Assessment with Geospatial AI for Predicting Landmine Areas", "paper_summary": "The process of clearing areas, namely demining, starts by assessing and\nprioritizing potential hazardous areas (i.e., desk assessment) to go under\nthorough investigation of experts, who confirm the risk and proceed with the\nmines clearance operations. This paper presents Desk-AId that supports the desk\nassessment phase by estimating landmine risks using geospatial data and\nsocioeconomic information. Desk-AId uses a Geospatial AI approach specialized\nto landmines. The approach includes mixed data sampling strategies and\ncontext-enrichment by historical conflicts and key multi-domain facilities\n(e.g., buildings, roads, health sites). The proposed system addresses the issue\nof having only ground-truth for confirmed hazardous areas by implementing a new\nhard-negative data sampling strategy, where negative points are sampled in the\nvicinity of hazardous areas. Experiments validate Desk-Aid in two domains for\nlandmine risk assessment: 1) country-wide, and 2) uncharted study areas). The\nproposed approach increases the estimation accuracies up to 92%, for different\nclassification models such as RandomForest (RF), Feedforward Neural Networks\n(FNN), and Graph Neural Networks (GNN).", "paper_summary_zh": "清除區域的過程，即排雷，始於評估和優先處理潛在危險區域（即桌面評估），由專家進行徹底調查，確認風險並繼續進行排雷行動。本文提出 Desk-AId，它透過使用地理空間資料和社會經濟資訊來估計地雷風險，以支援桌面評估階段。Desk-AId 使用專門針對地雷的地理空間 AI 方法。此方法包括混合資料抽樣策略和透過歷史衝突和關鍵多重領域設施（例如建築物、道路、醫療場所）進行脈絡豐富化。所提出的系統透過實施新的困難負面資料抽樣策略來解決僅對已確認危險區域進行地面真實性驗證的問題，其中負面點會在危險區域附近進行抽樣。實驗在兩個領域驗證 Desk-Aid 以進行地雷風險評估：1) 全國範圍，以及 2) 未標示的研究區域。對於不同的分類模型，例如隨機森林 (RF)、前饋神經網路 (FNN) 和圖神經網路 (GNN)，所提出的方法將估計準確度提高到 92%。", "author": "Flavio Cirillo et.al.", "authors": "Flavio Cirillo, Gürkan Solmaz, Yi-Hsuan Peng, Christian Bizer, Martin Jebens", "id": "2405.09444v1", "paper_url": "http://arxiv.org/abs/2405.09444v1", "repo": "null"}}