{"2405.17287": {"publish_time": "2024-05-27", "title": "Opinion-Guided Reinforcement Learning", "paper_summary": "Human guidance is often desired in reinforcement learning to improve the\nperformance of the learning agent. However, human insights are often mere\nopinions and educated guesses rather than well-formulated arguments. While\nopinions are subject to uncertainty, e.g., due to partial informedness or\nignorance about a problem, they also emerge earlier than hard evidence could be\nproduced. Thus, guiding reinforcement learning agents through opinions offers\nthe potential for more performant learning processes, but comes with the\nchallenge of modeling and managing opinions in a formal way. In this article,\nwe present a method to guide reinforcement learning agents through opinions. To\nthis end, we provide an end-to-end method to model and manage advisors'\nopinions. To assess the utility of the approach, we evaluate it with synthetic\nand human advisors, at different levels of uncertainty, and under multiple\nadvise strategies. Our results indicate that opinions, even if uncertain,\nimprove the performance of reinforcement learning agents, resulting in higher\nrewards, more efficient exploration, and a better reinforced policy. Although\nwe demonstrate our approach in a simplified topological running example, our\napproach is applicable to complex problems with higher dimensions as well.", "paper_summary_zh": "人類的指導在強化學習中通常是必要的，以提升學習代理的表現。然而，人類的見解通常只是意見和有根據的猜測，而非經過良好建構的論點。雖然意見可能會受到不確定性影響，例如由於對問題的部分了解或無知，但它們也會比難以證明的證據更早出現。因此，透過意見來指導強化學習代理具有提供更高效能學習流程的潛力，但同時也伴隨著以正式方式建模和管理意見的挑戰。在本文中，我們提出了一種透過意見來指導強化學習代理的方法。為此，我們提供了一個端到端的方法來建模和管理顧問的意見。為了評估此方法的效用，我們在不同程度的不確定性下，以及在多種建議策略下，使用合成和人類顧問對其進行評估。我們的結果表明，即使是不確定的意見，也能提升強化學習代理的表現，進而獲得更高的獎勵、更有效的探索和更強化的政策。儘管我們在一個簡化的拓撲執行範例中展示了我們的做法，但我們的做法也適用於具有更高維度的複雜問題。", "author": "Kyanna Dagenais et.al.", "authors": "Kyanna Dagenais, Istvan David", "id": "2405.17287v1", "paper_url": "http://arxiv.org/abs/2405.17287v1", "repo": "null"}}