{"2410.08899": {"publish_time": "2024-10-11", "title": "Utilizing ChatGPT in a Data Structures and Algorithms Course: A Teaching Assistant's Perspective", "paper_summary": "Integrating large language models (LLMs) like ChatGPT is revolutionizing the\nfield of computer science education. These models offer new possibilities for\nenriching student learning and supporting teaching assistants (TAs) in\nproviding prompt feedback and supplementary learning resources. This research\ndelves into the use of ChatGPT in a data structures and algorithms (DSA)\ncourse, particularly when combined with TA supervision. The findings\ndemonstrate that incorporating ChatGPT with structured prompts and active TA\nguidance enhances students' understanding of intricate algorithmic concepts,\nboosts engagement, and elevates academic performance. However, challenges exist\nin addressing academic integrity and the limitations of LLMs in tackling\ncomplex problems. The study underscores the importance of active TA involvement\nin reducing students' reliance on AI-generated content and amplifying the\noverall educational impact. The results suggest that while LLMs can be\nadvantageous for education, their successful integration demands continuous\noversight and a thoughtful balance between AI and human guidance.", "paper_summary_zh": "整合大型語言模型 (LLM)，例如 ChatGPT，正在革新電腦科學教育領域。這些模型為豐富學生學習和支援教學助理 (TA) 提供即時回饋和補充學習資源提供了新的可能性。本研究探討了在資料結構和演算法 (DSA) 課程中使用 ChatGPT，特別是在結合 TA 指導的情況下。研究結果表明，將 ChatGPT 與結構化提示和積極的 TA 指導相結合，可以增強學生對複雜演算法概念的理解，提升參與度，並提高學業成績。然而，在解決學術誠信和 LLM 在解決複雜問題方面的限制方面存在挑戰。該研究強調了積極的 TA 參與在減少學生對 AI 生成的內容的依賴和擴大整體教育影響方面的重要性。研究結果表明，雖然 LLM 對教育有利，但它們的成功整合需要持續的監督和在 AI 和人類指導之間取得深思熟慮的平衡。", "author": "Pooriya Jamie et.al.", "authors": "Pooriya Jamie, Reyhaneh Hajihashemi, Sharareh Alipour", "id": "2410.08899v1", "paper_url": "http://arxiv.org/abs/2410.08899v1", "repo": "null"}}