{"2408.02152": {"publish_time": "2024-08-04", "title": "Generative Retrieval with Few-shot Indexing", "paper_summary": "Existing generative retrieval (GR) approaches rely on training-based\nindexing, i.e., fine-tuning a model to memorise the associations between a\nquery and the document identifier (docid) of a relevant document.\nTraining-based indexing has three limitations: high training overhead,\nunder-utilization of the pre-trained knowledge of large language models (LLMs),\nand challenges in adapting to a dynamic document corpus. To address the above\nissues, we propose a novel few-shot indexing-based GR framework (Few-Shot GR).\nIt has a novel few-shot indexing process, where we prompt an LLM to generate\ndocids for all documents in a corpus, ultimately creating a docid bank for the\nentire corpus. During retrieval, we feed a query to the same LLM and constrain\nit to generate a docid within the docid bank created during indexing, and then\nmap the generated docid back to its corresponding document. Few-Shot GR relies\nsolely on prompting an LLM without requiring any training, making it more\nefficient. Moreover, we devise few-shot indexing with one-to-many mapping to\nfurther enhance Few-Shot GR. Experiments show that Few-Shot GR achieves\nsuperior performance to state-of-the-art GR methods that require heavy\ntraining.", "paper_summary_zh": "現有的生成式檢索 (GR) 方法依賴於基於訓練的索引，即微調模型以記憶查詢與相關文件的文件識別碼 (docid) 之間的關聯。基於訓練的索引有三個限制：高訓練開銷、大型語言模型 (LLM) 的預訓練知識利用不足，以及適應動態文件語料庫時的挑戰。為了解決上述問題，我們提出了一個新穎的基於少量索引的 GR 框架 (Few-Shot GR)。它有一個新穎的少量索引過程，我們在其中提示 LLM 為語料庫中的所有文件生成 docid，最終為整個語料庫創建一個 docid 庫。在檢索過程中，我們將查詢饋送到同一個 LLM 並限制它在索引過程中創建的 docid 庫中生成 docid，然後將生成的 docid 映射回其對應的文件。Few-Shot GR 僅依賴於提示 LLM，而不需要任何訓練，這使其更有效率。此外，我們設計了一對多的映射的少量索引，以進一步增強 Few-Shot GR。實驗表明，Few-Shot GR 達到了優於需要大量訓練的最新 GR 方法的性能。", "author": "Arian Askari et.al.", "authors": "Arian Askari, Chuan Meng, Mohammad Aliannejadi, Zhaochun Ren, Evangelos Kanoulas, Suzan Verberne", "id": "2408.02152v1", "paper_url": "http://arxiv.org/abs/2408.02152v1", "repo": "null"}}