{"2405.08246": {"publish_time": "2024-05-14", "title": "Compositional Text-to-Image Generation with Dense Blob Representations", "paper_summary": "Existing text-to-image models struggle to follow complex text prompts,\nraising the need for extra grounding inputs for better controllability. In this\nwork, we propose to decompose a scene into visual primitives - denoted as dense\nblob representations - that contain fine-grained details of the scene while\nbeing modular, human-interpretable, and easy-to-construct. Based on blob\nrepresentations, we develop a blob-grounded text-to-image diffusion model,\ntermed BlobGEN, for compositional generation. Particularly, we introduce a new\nmasked cross-attention module to disentangle the fusion between blob\nrepresentations and visual features. To leverage the compositionality of large\nlanguage models (LLMs), we introduce a new in-context learning approach to\ngenerate blob representations from text prompts. Our extensive experiments show\nthat BlobGEN achieves superior zero-shot generation quality and better\nlayout-guided controllability on MS-COCO. When augmented by LLMs, our method\nexhibits superior numerical and spatial correctness on compositional image\ngeneration benchmarks. Project page: https://blobgen-2d.github.io.", "paper_summary_zh": "現有的文字轉圖像模型難以遵循複雜的文字提示，因此需要額外的基礎輸入以獲得更好的可控性。在這項工作中，我們建議將場景分解為視覺基元 - 表示為密集的斑點表示 - 其中包含場景的細緻細節，同時具有模組化、人類可解讀且易於建構的特性。基於斑點表示，我們開發了一個斑點基礎的文字轉圖像擴散模型，稱為 BlobGEN，用於合成生成。特別是，我們引入了一個新的遮罩交叉注意力模組，以解開斑點表示和視覺特徵之間的融合。為了利用大型語言模型 (LLM) 的組合性，我們引入了一種新的情境內學習方法，以從文字提示中生成斑點表示。我們的廣泛實驗表明，BlobGEN 在 MS-COCO 上實現了出色的零次生成品質和更好的佈局引導可控性。當由 LLM 增強時，我們的模型在合成圖像生成基準上展現出優異的數字和空間正確性。專案頁面：https://blobgen-2d.github.io。", "author": "Weili Nie et.al.", "authors": "Weili Nie, Sifei Liu, Morteza Mardani, Chao Liu, Benjamin Eckart, Arash Vahdat", "id": "2405.08246v1", "paper_url": "http://arxiv.org/abs/2405.08246v1", "repo": "null"}}