{"2405.14577": {"publish_time": "2024-05-23", "title": "Representation noising effectively prevents harmful fine-tuning on LLMs", "paper_summary": "Releasing open-source large language models (LLMs) presents a dual-use risk\nsince bad actors can easily fine-tune these models for harmful purposes. Even\nwithout the open release of weights, weight stealing and fine-tuning APIs make\nclosed models vulnerable to harmful fine-tuning attacks (HFAs). While safety\nmeasures like preventing jailbreaks and improving safety guardrails are\nimportant, such measures can easily be reversed through fine-tuning. In this\nwork, we propose Representation Noising (RepNoise), a defence mechanism that is\neffective even when attackers have access to the weights and the defender no\nlonger has any control. RepNoise works by removing information about harmful\nrepresentations such that it is difficult to recover them during fine-tuning.\nImportantly, our defence is also able to generalize across different subsets of\nharm that have not been seen during the defence process. Our method does not\ndegrade the general capability of LLMs and retains the ability to train the\nmodel on harmless tasks. We provide empirical evidence that the effectiveness\nof our defence lies in its \"depth\": the degree to which information about\nharmful representations is removed across all layers of the LLM.", "paper_summary_zh": "釋出開放原始碼大型語言模型 (LLM) 呈現出雙重風險，因為不法分子可以輕易微調這些模型以進行有害目的。即使沒有公開權重，權重竊取和微調 API 也會讓封閉模型容易受到有害的微調攻擊 (HFA)。雖然預防越獄和改善安全防護措施等安全措施很重要，但此類措施可以輕易透過微調來逆轉。在這項工作中，我們提出表徵雜訊 (RepNoise)，一種防禦機制，即使攻擊者可以存取權重，而且防禦者不再有任何控制權，它仍然有效。RepNoise 的運作方式是移除有關有害表徵的資訊，使其難以在微調期間復原。重要的是，我們的防禦也能概括到防禦過程中未曾見過的不同有害子集。我們的防禦方法不會降低 LLM 的一般能力，並保留訓練模型執行無害任務的能力。我們提供實證證據證明，我們的防禦有效性在於其「深度」：移除有關有害表徵的資訊的程度遍及 LLM 的所有層級。", "author": "Domenic Rosati et.al.", "authors": "Domenic Rosati, Jan Wehner, Kai Williams, Łukasz Bartoszcze, David Atanasov, Robie Gonzales, Subhabrata Majumdar, Carsten Maple, Hassan Sajjad, Frank Rudzicz", "id": "2405.14577v1", "paper_url": "http://arxiv.org/abs/2405.14577v1", "repo": "null"}}