{"2407.21384": {"publish_time": "2024-07-31", "title": "GEGA: Graph Convolutional Networks and Evidence Retrieval Guided Attention for Enhanced Document-level Relation Extraction", "paper_summary": "Document-level relation extraction (DocRE) aims to extract relations between\nentities from unstructured document text. Compared to sentence-level relation\nextraction, it requires more complex semantic understanding from a broader text\ncontext. Currently, some studies are utilizing logical rules within evidence\nsentences to enhance the performance of DocRE. However, in the data without\nprovided evidence sentences, researchers often obtain a list of evidence\nsentences for the entire document through evidence retrieval (ER). Therefore,\nDocRE suffers from two challenges: firstly, the relevance between evidence and\nentity pairs is weak; secondly, there is insufficient extraction of complex\ncross-relations between long-distance multi-entities. To overcome these\nchallenges, we propose GEGA, a novel model for DocRE. The model leverages graph\nneural networks to construct multiple weight matrices, guiding attention\nallocation to evidence sentences. It also employs multi-scale representation\naggregation to enhance ER. Subsequently, we integrate the most efficient\nevidence information to implement both fully supervised and weakly supervised\ntraining processes for the model. We evaluate the GEGA model on three widely\nused benchmark datasets: DocRED, Re-DocRED, and Revisit-DocRED. The\nexperimental results indicate that our model has achieved comprehensive\nimprovements compared to the existing SOTA model.", "paper_summary_zh": "<paragraph>文件級關係萃取 (DocRE) 旨在從非結構文件文字中萃取實體間的關係。與句子級關係萃取相比，它需要從更廣泛的文字脈絡中進行更複雜的語義理解。目前，一些研究利用證據句子中的邏輯規則來增強 DocRE 的效能。然而，在沒有提供證據句子的資料中，研究人員通常會透過證據擷取 (ER) 為整個文件取得一份證據句子清單。因此，DocRE 面臨兩項挑戰：首先，證據和實體對之間的關聯性較弱；其次，無法充分萃取遠距離多實體之間的複雜交叉關係。為了克服這些挑戰，我們提出 GEGA，這是一種用於 DocRE 的新型模型。該模型利用圖神經網路來建構多個權重矩陣，引導注意力分配到證據句子。它還採用多尺度表示聚合來增強 ER。隨後，我們整合最有效的證據資訊，為模型實作完全監督式和弱監督式訓練流程。我們在三個廣泛使用的基準資料集：DocRED、Re-DocRED 和 Revisit-DocRED 上評估 GEGA 模型。實驗結果表明，與現有的 SOTA 模型相比，我們的模型已獲得全面的改進。</paragraph>", "author": "Yanxu Mao et.al.", "authors": "Yanxu Mao, Peipei Liu, Tiehan Cui", "id": "2407.21384v1", "paper_url": "http://arxiv.org/abs/2407.21384v1", "repo": "null"}}