{"2405.04760": {"publish_time": "2024-05-08", "title": "Large Language Models for Cyber Security: A Systematic Literature Review", "paper_summary": "The rapid advancement of Large Language Models (LLMs) has opened up new\nopportunities for leveraging artificial intelligence in various domains,\nincluding cybersecurity. As the volume and sophistication of cyber threats\ncontinue to grow, there is an increasing need for intelligent systems that can\nautomatically detect vulnerabilities, analyze malware, and respond to attacks.\nIn this survey, we conduct a comprehensive review of the literature on the\napplication of LLMs in cybersecurity (LLM4Security). By comprehensively\ncollecting over 30K relevant papers and systematically analyzing 127 papers\nfrom top security and software engineering venues, we aim to provide a holistic\nview of how LLMs are being used to solve diverse problems across the\ncybersecurity domain. Through our analysis, we identify several key findings.\nFirst, we observe that LLMs are being applied to a wide range of cybersecurity\ntasks, including vulnerability detection, malware analysis, network intrusion\ndetection, and phishing detection. Second, we find that the datasets used for\ntraining and evaluating LLMs in these tasks are often limited in size and\ndiversity, highlighting the need for more comprehensive and representative\ndatasets. Third, we identify several promising techniques for adapting LLMs to\nspecific cybersecurity domains, such as fine-tuning, transfer learning, and\ndomain-specific pre-training. Finally, we discuss the main challenges and\nopportunities for future research in LLM4Security, including the need for more\ninterpretable and explainable models, the importance of addressing data privacy\nand security concerns, and the potential for leveraging LLMs for proactive\ndefense and threat hunting. Overall, our survey provides a comprehensive\noverview of the current state-of-the-art in LLM4Security and identifies several\npromising directions for future research.", "paper_summary_zh": "大型語言模型 (LLM) 的快速進步為利用人工智慧開啟了新的機會，在各種領域中，包括網路安全。隨著網路威脅的數量和複雜性持續增加，對於能夠自動偵測漏洞、分析惡意軟體和回應攻擊的智慧系統需求也與日俱增。在此調查中，我們對網路安全 (LLM4Security) 中 LLM 應用文獻進行全面回顧。透過全面收集超過 30K 篇相關論文，並系統性地分析來自頂尖安全和軟體工程場域的 127 篇論文，我們旨在提供 LLM 如何用於解決網路安全領域中各種問題的整體觀點。透過我們的分析，我們找出幾個關鍵發現。首先，我們觀察到 LLM 被應用於廣泛的網路安全任務，包括漏洞偵測、惡意軟體分析、網路入侵偵測和網路釣魚偵測。其次，我們發現用於訓練和評估這些任務中 LLM 的資料集通常在規模和多樣性上有限，突顯出需要更全面且具代表性的資料集。第三，我們找出幾個將 LLM 適應到特定網路安全領域的有前途技術，例如微調、遷移學習和特定領域預訓練。最後，我們討論 LLM4Security 中未來研究的主要挑戰和機會，包括需要更多可解釋和說明的模型、解決資料隱私和安全問題的重要性，以及利用 LLM 主動防禦和威脅偵測的潛力。總體而言，我們的調查提供了 LLM4Security 中目前最先進技術的全面概述，並找出幾個未來研究的有前途方向。", "author": "HanXiang Xu et.al.", "authors": "HanXiang Xu, ShenAo Wang, Ningke Li, Yanjie Zhao, Kai Chen, Kailong Wang, Yang Liu, Ting Yu, HaoYu Wang", "id": "2405.04760v1", "paper_url": "http://arxiv.org/abs/2405.04760v1", "repo": "null"}}