{"2405.12915": {"publish_time": "2024-05-21", "title": "G-DIG: Towards Gradient-based DIverse and hiGh-quality Instruction Data Selection for Machine Translation", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable abilities in\ngeneral scenarios. Instruction finetuning empowers them to align with humans in\nvarious tasks. Nevertheless, the Diversity and Quality of the instruction data\nremain two main challenges for instruction finetuning. With regard to this, in\nthis paper, we propose a novel gradient-based method to automatically select\nhigh-quality and diverse instruction finetuning data for machine translation.\nOur key innovation centers around analyzing how individual training examples\ninfluence the model during training. Specifically, we select training examples\nthat exert beneficial influences on the model as high-quality ones by means of\nInfluence Function plus a small high-quality seed dataset. Moreover, to enhance\nthe diversity of the training data we maximize the variety of influences they\nhave on the model by clustering on their gradients and resampling. Extensive\nexperiments on WMT22 and FLORES translation tasks demonstrate the superiority\nof our methods, and in-depth analysis further validates their effectiveness and\ngeneralization.", "paper_summary_zh": "大型語言模型 (LLM) 已在一般場景中展現出非凡的能力。指示微調使它們能夠在各種任務中與人類保持一致。儘管如此，指示數據的多樣性和品質仍然是指示微調的兩項主要挑戰。有鑑於此，我們在本文中提出了一種新穎的基於梯度的自動選擇機器翻譯的高品質且多樣化的指示微調數據的方法。我們的關鍵創新圍繞分析個別訓練範例在訓練期間如何影響模型。具體來說，我們選擇對模型產生有益影響的訓練範例，並透過影響函數加上少量高品質種子資料集來作為高品質的訓練範例。此外，為了增強訓練數據的多樣性，我們透過對它們的梯度進行分群和重新取樣，將它們對模型的影響最大化。在 WMT22 和 FLORES 翻譯任務上的廣泛實驗證明了我們方法的優越性，深入分析進一步驗證了它們的有效性和概括性。", "author": "Xingyuan Pan et.al.", "authors": "Xingyuan Pan, Luyang Huang, Liyan Kang, Zhicheng Liu, Yu Lu, Shanbo Cheng", "id": "2405.12915v1", "paper_url": "http://arxiv.org/abs/2405.12915v1", "repo": "null"}}