{"2406.05086": {"publish_time": "2024-06-07", "title": "Robust Reward Design for Markov Decision Processes", "paper_summary": "The problem of reward design examines the interaction between a leader and a\nfollower, where the leader aims to shape the follower's behavior to maximize\nthe leader's payoff by modifying the follower's reward function. Current\napproaches to reward design rely on an accurate model of how the follower\nresponds to reward modifications, which can be sensitive to modeling\ninaccuracies. To address this issue of sensitivity, we present a solution that\noffers robustness against uncertainties in modeling the follower, including 1)\nhow the follower breaks ties in the presence of nonunique best responses, 2)\ninexact knowledge of how the follower perceives reward modifications, and 3)\nbounded rationality of the follower. Our robust solution is guaranteed to exist\nunder mild conditions and can be obtained numerically by solving a\nmixed-integer linear program. Numerical experiments on multiple test cases\ndemonstrate that our solution improves robustness compared to the standard\napproach without incurring significant additional computing costs.", "paper_summary_zh": "獎勵設計問題探討領導者與追隨者之間的互動，其中領導者旨在透過修改追隨者的獎勵功能來塑造追隨者的行為，以最大化領導者的報酬。目前獎勵設計的方法依賴於追隨者如何回應獎勵修改的準確模型，而這可能會受到建模不準確的影響。為了解決這個敏感性問題，我們提出了一個解決方案，它提供對追隨者建模的不確定性具有穩健性，包括 1) 追隨者在存在非唯一最佳回應時如何打破平手，2) 對追隨者如何感知獎勵修改的不準確知識，以及 3) 追隨者的有限理性。我們的穩健解決方案保證在溫和的條件下存在，並且可以通過求解混合整數線性規劃來數值獲得。在多個測試案例上的數值實驗表明，我們的解決方案與標準方法相比提高了穩健性，而不會產生顯著的額外計算成本。", "author": "Shuo Wu et.al.", "authors": "Shuo Wu, Haoxiang Ma, Jie Fu, Shuo Han", "id": "2406.05086v1", "paper_url": "http://arxiv.org/abs/2406.05086v1", "repo": "null"}}