{"2407.06057": {"publish_time": "2024-07-08", "title": "Variational Best-of-N Alignment", "paper_summary": "Best-of-N (BoN) is a popular and effective algorithm for aligning language\nmodels to human preferences. The algorithm works as follows: at inference time,\nN samples are drawn from the language model, and the sample with the highest\nreward, as judged by a reward model, is returned as the output. Despite its\neffectiveness, BoN is computationally expensive; it reduces sampling throughput\nby a factor of N. To make BoN more efficient at inference time, one strategy is\nto fine-tune the language model to mimic what BoN does during inference. To\nachieve this, we derive the distribution induced by the BoN algorithm. We then\npropose to fine-tune the language model to minimize backward KL divergence to\nthe BoN distribution. Our approach is analogous to mean-field variational\ninference and, thus, we term it variational BoN (vBoN). To the extent this\nfine-tuning is successful and we end up with a good approximation, we have\nreduced the inference cost by a factor of N. Our experiments on a controlled\ngeneration task suggest that while variational BoN is not as effective as BoN\nin aligning language models, it is close to BoN performance as vBoN appears\nmore often on the Pareto frontier of reward and KL divergence compared to\nmodels trained with KL-constrained RL objective.", "paper_summary_zh": "最佳 N (BoN) 是一種廣受歡迎且有效的演算法，用於將語言模型與人類偏好相符。此演算法的運作方式如下：在推論時間，從語言模型中抽出 N 個樣本，並根據獎勵模型的判斷，將具有最高獎勵的樣本回傳為輸出。儘管 BoN 很有效，但其計算成本很高；它會將取樣處理量降低 N 倍。為了讓 BoN 在推論時間更有效率，其中一個策略是微調語言模型，以模擬 BoN 在推論期間執行的動作。為達成此目的，我們導出 BoN 演算法所引發的分配。接著，我們建議微調語言模型，以最小化到 BoN 分配的反向 KL 分歧。我們的做法類似於平均場變分推論，因此我們稱之為變異 BoN (vBoN)。在微調成功且我們獲得良好近似值的範圍內，我們已將推論成本降低 N 倍。我們在受控生成任務中進行的實驗顯示，雖然變異 BoN 在調整語言模型方面不如 BoN 有效，但其接近 BoN 的效能，因為與使用受 KL 約束的 RL 目標訓練的模型相比，vBoN 更常出現在獎勵和 KL 分歧的帕累托前緣。", "author": "Afra Amini et.al.", "authors": "Afra Amini, Tim Vieira, Ryan Cotterell", "id": "2407.06057v1", "paper_url": "http://arxiv.org/abs/2407.06057v1", "repo": "null"}}