{"2412.03531": {"publish_time": "2024-12-04", "title": "A Review on Scientific Knowledge Extraction using Large Language Models in Biomedical Sciences", "paper_summary": "The rapid advancement of large language models (LLMs) has opened new\nboundaries in the extraction and synthesis of medical knowledge, particularly\nwithin evidence synthesis. This paper reviews the state-of-the-art applications\nof LLMs in the biomedical domain, exploring their effectiveness in automating\ncomplex tasks such as evidence synthesis and data extraction from a biomedical\ncorpus of documents. While LLMs demonstrate remarkable potential, significant\nchallenges remain, including issues related to hallucinations, contextual\nunderstanding, and the ability to generalize across diverse medical tasks. We\nhighlight critical gaps in the current research literature, particularly the\nneed for unified benchmarks to standardize evaluations and ensure reliability\nin real-world applications. In addition, we propose directions for future\nresearch, emphasizing the integration of state-of-the-art techniques such as\nretrieval-augmented generation (RAG) to enhance LLM performance in evidence\nsynthesis. By addressing these challenges and utilizing the strengths of LLMs,\nwe aim to improve access to medical literature and facilitate meaningful\ndiscoveries in healthcare.", "paper_summary_zh": "大型語言模型 (LLM) 的快速進展開啟了醫療知識萃取和綜合的新領域，特別是在證據綜合中。本文回顧了 LLM 在生物醫學領域的最新應用，探討了它們在自動化複雜任務（例如從生物醫學文件語料庫中進行證據綜合和數據萃取）方面的效能。儘管 LLM 展現了顯著的潛力，但仍有重大的挑戰，包括與幻覺、脈絡理解以及在不同醫療任務中概括的能力相關的問題。我們強調了當前研究文獻中的關鍵差距，特別是需要統一的基準來標準化評估並確保實際應用中的可靠性。此外，我們提出了未來研究的方向，強調整合最先進的技術，例如檢索增強生成 (RAG)，以增強 LLM 在證據綜合中的表現。透過解決這些挑戰並利用 LLM 的優勢，我們旨在改善對醫學文獻的取得，並促進醫療保健中的有意義發現。", "author": "Gabriel Lino Garcia et.al.", "authors": "Gabriel Lino Garcia, João Renato Ribeiro Manesco, Pedro Henrique Paiola, Lucas Miranda, Maria Paola de Salvo, João Paulo Papa", "id": "2412.03531v1", "paper_url": "http://arxiv.org/abs/2412.03531v1", "repo": "null"}}