{"2408.04713": {"publish_time": "2024-08-08", "title": "DyGMamba: Efficiently Modeling Long-Term Temporal Dependency on Continuous-Time Dynamic Graphs with State Space Models", "paper_summary": "Learning useful representations for continuous-time dynamic graphs (CTDGs) is\nchallenging, due to the concurrent need to span long node interaction histories\nand grasp nuanced temporal details. In particular, two problems emerge: (1)\nEncoding longer histories requires more computational resources, making it\ncrucial for CTDG models to maintain low computational complexity to ensure\nefficiency; (2) Meanwhile, more powerful models are needed to identify and\nselect the most critical temporal information within the extended context\nprovided by longer histories. To address these problems, we propose a CTDG\nrepresentation learning model named DyGMamba, originating from the popular\nMamba state space model (SSM). DyGMamba first leverages a node-level SSM to\nencode the sequence of historical node interactions. Another time-level SSM is\nthen employed to exploit the temporal patterns hidden in the historical graph,\nwhere its output is used to dynamically select the critical information from\nthe interaction history. We validate DyGMamba experimentally on the dynamic\nlink prediction task. The results show that our model achieves state-of-the-art\nin most cases. DyGMamba also maintains high efficiency in terms of\ncomputational resources, making it possible to capture long temporal\ndependencies with a limited computation budget.", "paper_summary_zh": "學習連續時間動態圖形 (CTDG) 的有用表示很具有挑戰性，因為同時需要跨越節點互動的長歷史記錄，並掌握細微的時間細節。特別是，出現了兩個問題：(1) 編碼更長的歷史需要更多的計算資源，這使得 CTDG 模型必須保持較低的計算複雜度以確保效率；(2) 與此同時，需要更強大的模型來識別和選擇更長的歷史記錄所提供的擴展脈絡中最關鍵的時間資訊。為了解決這些問題，我們提出了一個名為 DyGMamba 的 CTDG 表示學習模型，它源自流行的 Mamba 狀態空間模型 (SSM)。DyGMamba 首先利用節點級別的 SSM 來編碼歷史節點互動的序列。然後採用另一個時間級別的 SSM 來利用隱藏在歷史圖形中的時間模式，其輸出用於動態地從互動歷史中選擇關鍵資訊。我們在動態連結預測任務上對 DyGMamba 進行了實驗驗證。結果表明，在大多數情況下，我們的模型都達到了最先進的水平。DyGMamba 在計算資源方面也保持了很高的效率，這使得在有限的計算預算下捕捉到很長的暫時依賴關係成為可能。", "author": "Zifeng Ding et.al.", "authors": "Zifeng Ding, Yifeng Li, Yuan He, Antonio Norelli, Jingcheng Wu, Volker Tresp, Yunpu Ma, Michael Bronstein", "id": "2408.04713v1", "paper_url": "http://arxiv.org/abs/2408.04713v1", "repo": "null"}}