{"2408.12890": {"publish_time": "2024-08-23", "title": "Multiple Areal Feature Aware Transportation Demand Prediction", "paper_summary": "A reliable short-term transportation demand prediction supports the\nauthorities in improving the capability of systems by optimizing schedules,\nadjusting fleet sizes, and generating new transit networks. A handful of\nresearch efforts incorporate one or a few areal features while learning\nspatio-temporal correlation, to capture similar demand patterns between similar\nareas. However, urban characteristics are polymorphic, and they need to be\nunderstood by multiple areal features such as land use, sociodemographics, and\nplace-of-interest (POI) distribution. In this paper, we propose a novel\nspatio-temporal multi-feature-aware graph convolutional recurrent network\n(ST-MFGCRN) that fuses multiple areal features during spatio-temproal\nunderstanding. Inside ST-MFGCRN, we devise sentinel attention to calculate the\nareal similarity matrix by allowing each area to take partial attention if the\nfeature is not useful. We evaluate the proposed model on two real-world\ntransportation datasets, one with our constructed BusDJ dataset and one with\nbenchmark TaxiBJ. Results show that our model outperforms the state-of-the-art\nbaselines up to 7\\% on BusDJ and 8\\% on TaxiBJ dataset.", "paper_summary_zh": "可靠的短期交通需求预测支持当局通过优化时间表、调整车队规模和生成新的交通网络来提高系统的运能。少数研究工作在学习时空相关性时纳入了一个或几个区域特征，以捕捉相似区域之间的相似需求模式。然而，城市特征是多态的，需要通过土地利用、社会人口统计和兴趣点 (POI) 分布等多个区域特征来理解它们。在本文中，我们提出了一种新颖的时空多特征感知图卷积循环网络 (ST-MFGCRN)，它在时空理解期间融合了多个区域特征。在 ST-MFGCRN 内部，我们设计了哨兵注意力，以计算区域相似性矩阵，允许每个区域在特征无用时采取部分注意力。我们在两个真实世界的交通数据集上评估了所提出的模型，一个是我们构建的 BusDJ 数据集，另一个是基准 TaxiBJ。结果表明，我们的模型在 BusDJ 上的性能比最先进的基线高出 7%，在 TaxiBJ 数据集上高出 8%。", "author": "Sumin Han et.al.", "authors": "Sumin Han, Jisun An, Youngjun Park, Suji Kim, Kitae Jang, Dongman Lee", "id": "2408.12890v1", "paper_url": "http://arxiv.org/abs/2408.12890v1", "repo": "null"}}