{"2410.03545": {"publish_time": "2024-10-04", "title": "Enhancing Data Quality through Simple De-duplication: Navigating Responsible Computational Social Science Research", "paper_summary": "Research in natural language processing (NLP) for Computational Social\nScience (CSS) heavily relies on data from social media platforms. This data\nplays a crucial role in the development of models for analysing\nsocio-linguistic phenomena within online communities. In this work, we conduct\nan in-depth examination of 20 datasets extensively used in NLP for CSS to\ncomprehensively examine data quality. Our analysis reveals that social media\ndatasets exhibit varying levels of data duplication. Consequently, this gives\nrise to challenges like label inconsistencies and data leakage, compromising\nthe reliability of models. Our findings also suggest that data duplication has\nan impact on the current claims of state-of-the-art performance, potentially\nleading to an overestimation of model effectiveness in real-world scenarios.\nFinally, we propose new protocols and best practices for improving dataset\ndevelopment from social media data and its usage.", "paper_summary_zh": "自然語言處理 (NLP) 在計算社會科學 (CSS) 中的研究，非常依賴於社群媒體平台的資料。這些資料在社群中分析社會語言現象的模型開發中，扮演至關重要的角色。在本研究中，我們對 NLP 中廣泛用於 CSS 的 20 個資料集進行深入探討，以全面檢查資料品質。我們的分析顯示，社群媒體資料集呈現出不同程度的資料重複。因此，這會導致標籤不一致和資料外洩等挑戰，進而損害模型的可靠性。我們的研究結果也顯示，資料重複會影響當前最先進的效能聲明，可能會導致在實際情況中高估模型的有效性。最後，我們提出新的協定和最佳實務，以改善社群媒體資料的資料集開發及其使用方式。", "author": "Yida Mu et.al.", "authors": "Yida Mu, Mali Jin, Xingyi Song, Nikolaos Aletras", "id": "2410.03545v1", "paper_url": "http://arxiv.org/abs/2410.03545v1", "repo": "null"}}