{"2407.14417": {"publish_time": "2024-07-19", "title": "Mixture of Experts with Mixture of Precisions for Tuning Quality of Service", "paper_summary": "The increasing demand for deploying large Mixture-of-Experts (MoE) models in\nresource-constrained environments necessitates efficient approaches to address\ntheir high memory and computational requirements challenges. Moreover, given\nthat tasks come in different user-defined constraints and the available\nresources change over time in multi-tenant environments, it is necessary to\ndesign an approach which provides a flexible configuration space. This paper\npresents an adaptive serving approach for the efficient deployment of MoE\nmodels, capitalizing on partial quantization of the experts. By dynamically\ndetermining the number of quantized experts and their distribution across CPU\nand GPU, our approach explores the Pareto frontier and offers a fine-grained\nrange of configurations for tuning throughput and model quality. Our evaluation\non an NVIDIA A100 GPU using a Mixtral 8x7B MoE model for three language\nmodelling benchmarks demonstrates that the throughput of token generation can\nbe adjusted from 0.63 to 13.00 token per second. This enhancement comes with a\nmarginal perplexity increase of 2.62 to 2.80, 6.48 to 7.24, and 3.24 to 3.53\nfor WikiText2, PTB, and C4 datasets respectively under maximum quantization.\nThese results highlight the practical applicability of our approach in dynamic\nand accuracy-sensitive applications where both memory usage and output quality\nare important.", "paper_summary_zh": "隨著在資源受限環境中部署大型混合專家 (MoE) 模型的需求日益增加，需要有效的方法來解決其高記憶體和運算需求的挑戰。此外，由於任務具有不同的使用者定義約束，且在多租戶環境中可用資源會隨著時間而改變，因此有必要設計一種提供彈性配置空間的方法。本文提出了一種自適應服務方法，用於有效部署 MoE 模型，利用專家的部分量化。透過動態確定量化專家的數量及其在 CPU 和 GPU 上的分布，我們的做法探索了 Pareto 前緣，並提供了用於調整通量和模型品質的細粒度配置範圍。我們使用 Mixtral 8x7B MoE 模型在 NVIDIA A100 GPU 上針對三個語言建模基準進行評估，結果表明，令牌產生的通量可以從每秒 0.63 個令牌調整到 13.00 個令牌。此增強功能的困惑度略有增加，在最大量化下，對於 WikiText2、PTB 和 C4 資料集分別為 2.62 到 2.80、6.48 到 7.24 和 3.24 到 3.53。這些結果突顯了我們的方法在動態且對準確度敏感的應用中的實際適用性，在這些應用中，記憶體使用量和輸出品質都很重要。", "author": "HamidReza Imani et.al.", "authors": "HamidReza Imani, Abdolah Amirany, Tarek El-Ghazawi", "id": "2407.14417v1", "paper_url": "http://arxiv.org/abs/2407.14417v1", "repo": "null"}}