{"2406.09012": {"publish_time": "2024-06-13", "title": "Bayesian Statistical Modeling with Predictors from LLMs", "paper_summary": "State of the art large language models (LLMs) have shown impressive\nperformance on a variety of benchmark tasks and are increasingly used as\ncomponents in larger applications, where LLM-based predictions serve as proxies\nfor human judgements or decision. This raises questions about the\nhuman-likeness of LLM-derived information, alignment with human intuition, and\nwhether LLMs could possibly be considered (parts of) explanatory models of\n(aspects of) human cognition or language use. To shed more light on these\nissues, we here investigate the human-likeness of LLMs' predictions for\nmultiple-choice decision tasks from the perspective of Bayesian statistical\nmodeling. Using human data from a forced-choice experiment on pragmatic\nlanguage use, we find that LLMs do not capture the variance in the human data\nat the item-level. We suggest different ways of deriving full distributional\npredictions from LLMs for aggregate, condition-level data, and find that some,\nbut not all ways of obtaining condition-level predictions yield adequate fits\nto human data. These results suggests that assessment of LLM performance\ndepends strongly on seemingly subtle choices in methodology, and that LLMs are\nat best predictors of human behavior at the aggregate, condition-level, for\nwhich they are, however, not designed to, or usually used to, make predictions\nin the first place.", "paper_summary_zh": "最先进的大型语言模型 (LLM) 在各种基准任务中表现出色，并且越来越多地用作大型应用程序中的组件，其中基于 LLM 的预测用作人类判断或决策的代理。这引发了关于 LLM 衍生信息的人类相似性、与人类直觉的一致性，以及 LLM 是否可能被认为是（部分）人类认知或语言使用的解释性模型的问题。为了更深入地了解这些问题，我们在此从贝叶斯统计建模的角度研究了 LLM 对多项选择决策任务的预测的人类相似性。使用来自务实语言使用强制选择实验的人类数据，我们发现 LLM 无法在项目级别捕捉人类数据中的差异。我们提出了从 LLM 中推导总体条件级数据的完整分布式预测的不同方法，并发现某些（但并非全部）获得条件级预测的方法产生了与人类数据充分拟合。这些结果表明，对 LLM 性能的评估在很大程度上取决于方法论中看似细微的选择，并且 LLM 最多是在总体条件级预测人类行为，但它们最初并非设计用于或通常用于进行预测。", "author": "Michael Franke et.al.", "authors": "Michael Franke, Polina Tsvilodub, Fausto Carcassi", "id": "2406.09012v1", "paper_url": "http://arxiv.org/abs/2406.09012v1", "repo": "null"}}