{"2408.16353": {"publish_time": "2024-08-29", "title": "DetectBERT: Towards Full App-Level Representation Learning to Detect Android Malware", "paper_summary": "Recent advancements in ML and DL have significantly improved Android malware\ndetection, yet many methodologies still rely on basic static analysis,\nbytecode, or function call graphs that often fail to capture complex malicious\nbehaviors. DexBERT, a pre-trained BERT-like model tailored for Android\nrepresentation learning, enriches class-level representations by analyzing\nSmali code extracted from APKs. However, its functionality is constrained by\nits inability to process multiple Smali classes simultaneously. This paper\nintroduces DetectBERT, which integrates correlated Multiple Instance Learning\n(c-MIL) with DexBERT to handle the high dimensionality and variability of\nAndroid malware, enabling effective app-level detection. By treating\nclass-level features as instances within MIL bags, DetectBERT aggregates these\ninto a comprehensive app-level representation. Our evaluation demonstrates that\nDetectBERT not only surpasses existing state-of-the-art detection methods but\nalso adapts to evolving malware threats. Moreover, the versatility of the\nDetectBERT framework holds promising potential for broader applications in\napp-level analysis and other software engineering tasks, offering new avenues\nfor research and development.", "paper_summary_zh": "最近在機器學習和深度學習的進展已顯著改善 Android 惡意軟體偵測，但許多方法仍依賴於基本的靜態分析、位元組碼或函式呼叫圖，這些方法通常無法擷取複雜的惡意行為。DexBERT 是一個針對 Android 表徵學習量身打造的預訓練 BERT 類似模型，透過分析從 APK 提取的 Smali 程式碼來豐富類別層級的表徵。然而，其功能受到無法同時處理多個 Smali 類別的限制。本文介紹 DetectBERT，它將相關的多重實例學習 (c-MIL) 與 DexBERT 整合，以處理 Android 惡意軟體的高維度和變異性，進而實現有效的應用程式層級偵測。透過將類別層級特徵視為 MIL 袋中的實例，DetectBERT 將這些特徵彙總成一個全面的應用程式層級表徵。我們的評估證明，DetectBERT 不僅超越現有的最先進偵測方法，還能適應不斷變化的惡意軟體威脅。此外，DetectBERT 框架的多功能性在應用程式層級分析和其他軟體工程任務中具有廣泛應用的潛力，為研究和開發提供了新的途徑。", "author": "Tiezhu Sun et.al.", "authors": "Tiezhu Sun, Nadia Daoudi, Kisub Kim, Kevin Allix, Tegawendé F. Bissyandé, Jacques Klein", "id": "2408.16353v1", "paper_url": "http://arxiv.org/abs/2408.16353v1", "repo": "https://github.com/trustworthy-software/detectbert"}}