{"2309.10293": {"publish_time": "2023-09-19", "title": "QXAI: Explainable AI Framework for Quantitative Analysis in Patient Monitoring Systems", "paper_summary": "Artificial Intelligence techniques can be used to classify a patient's\nphysical activities and predict vital signs for remote patient monitoring.\nRegression analysis based on non-linear models like deep learning models has\nlimited explainability due to its black-box nature. This can require\ndecision-makers to make blind leaps of faith based on non-linear model results,\nespecially in healthcare applications. In non-invasive monitoring, patient data\nfrom tracking sensors and their predisposing clinical attributes act as input\nfeatures for predicting future vital signs. Explaining the contributions of\nvarious features to the overall output of the monitoring application is\ncritical for a clinician's decision-making. In this study, an Explainable AI\nfor Quantitative analysis (QXAI) framework is proposed with post-hoc model\nexplainability and intrinsic explainability for regression and classification\ntasks in a supervised learning approach. This was achieved by utilizing the\nShapley values concept and incorporating attention mechanisms in deep learning\nmodels. We adopted the artificial neural networks (ANN) and attention-based\nBidirectional LSTM (BiLSTM) models for the prediction of heart rate and\nclassification of physical activities based on sensor data. The deep learning\nmodels achieved state-of-the-art results in both prediction and classification\ntasks. Global explanation and local explanation were conducted on input data to\nunderstand the feature contribution of various patient data. The proposed QXAI\nframework was evaluated using PPG-DaLiA data to predict heart rate and mobile\nhealth (MHEALTH) data to classify physical activities based on sensor data.\nMonte Carlo approximation was applied to the framework to overcome the time\ncomplexity and high computation power requirements required for Shapley value\ncalculations.", "paper_summary_zh": "人工智慧技術可用於分類病患的身體活動並預測遠距病患監控的重要生命徵象。基於深度學習模型等非線性模型的回歸分析由於其黑盒子的性質而具有有限的可解釋性。這可能需要決策者根據非線性模型結果做出盲目的信仰飛躍，特別是在醫療保健應用中。在非侵入性監控中，來自追蹤感測器和其易感臨床屬性的病患資料充當預測未來生命徵象的輸入特徵。解釋各種特徵對監控應用程式整體輸出的貢獻對於臨床醫生的決策至關重要。在本研究中，提出了一個用於量化分析的可解釋人工智慧 (QXAI) 架構，該架構具有監督式學習方法中回歸和分類任務的事後模型可解釋性和內在可解釋性。這透過利用 Shapley 值概念並將注意力機制納入深度學習模型來實現。我們採用人工神經網路 (ANN) 和基於注意力的雙向 LSTM (BiLSTM) 模型，根據感測器資料預測心率和分類身體活動。深度學習模型在預測和分類任務中都取得了最先進的成果。對輸入資料進行全局解釋和局部解釋，以了解各種病患資料的特徵貢獻。所提出的 QXAI 架構使用 PPG-DaLiA 資料評估，以預測心率，並使用行動健康 (MHEALTH) 資料根據感測器資料對身體活動進行分類。蒙地卡羅近似法應用於該架構，以克服 Shapley 值計算所需的時間複雜度和高運算能力需求。", "author": "Thanveer Shaik et.al.", "authors": "Thanveer Shaik, Xiaohui Tao, Haoran Xie, Lin Li, Juan D. Velasquez, Niall Higgins", "id": "2309.10293v3", "paper_url": "http://arxiv.org/abs/2309.10293v3", "repo": "null"}}