{"2309.10293": {"publish_time": "2023-09-19", "title": "QXAI: Explainable AI Framework for Quantitative Analysis in Patient Monitoring Systems", "paper_summary": "Artificial Intelligence techniques can be used to classify a patient's\nphysical activities and predict vital signs for remote patient monitoring.\nRegression analysis based on non-linear models like deep learning models has\nlimited explainability due to its black-box nature. This can require\ndecision-makers to make blind leaps of faith based on non-linear model results,\nespecially in healthcare applications. In non-invasive monitoring, patient data\nfrom tracking sensors and their predisposing clinical attributes act as input\nfeatures for predicting future vital signs. Explaining the contributions of\nvarious features to the overall output of the monitoring application is\ncritical for a clinician's decision-making. In this study, an Explainable AI\nfor Quantitative analysis (QXAI) framework is proposed with post-hoc model\nexplainability and intrinsic explainability for regression and classification\ntasks in a supervised learning approach. This was achieved by utilizing the\nShapley values concept and incorporating attention mechanisms in deep learning\nmodels. We adopted the artificial neural networks (ANN) and attention-based\nBidirectional LSTM (BiLSTM) models for the prediction of heart rate and\nclassification of physical activities based on sensor data. The deep learning\nmodels achieved state-of-the-art results in both prediction and classification\ntasks. Global explanation and local explanation were conducted on input data to\nunderstand the feature contribution of various patient data. The proposed QXAI\nframework was evaluated using PPG-DaLiA data to predict heart rate and mobile\nhealth (MHEALTH) data to classify physical activities based on sensor data.\nMonte Carlo approximation was applied to the framework to overcome the time\ncomplexity and high computation power requirements required for Shapley value\ncalculations.", "paper_summary_zh": "", "author": "Thanveer Shaik et.al.", "authors": "Thanveer Shaik,Xiaohui Tao,Haoran Xie,Lin Li,Juan D. Velasquez,Niall Higgins", "id": "2309.10293v3", "paper_url": "http://arxiv.org/abs/2309.10293v3", "repo": "null"}}