{"2409.09702": {"publish_time": "2024-09-15", "title": "GFlowNet Pretraining with Inexpensive Rewards", "paper_summary": "Generative Flow Networks (GFlowNets), a class of generative models have\nrecently emerged as a suitable framework for generating diverse and\nhigh-quality molecular structures by learning from unnormalized reward\ndistributions. Previous works in this direction often restrict exploration by\nusing predefined molecular fragments as building blocks, limiting the chemical\nspace that can be accessed. In this work, we introduce Atomic GFlowNets\n(A-GFNs), a foundational generative model leveraging individual atoms as\nbuilding blocks to explore drug-like chemical space more comprehensively. We\npropose an unsupervised pre-training approach using offline drug-like molecule\ndatasets, which conditions A-GFNs on inexpensive yet informative molecular\ndescriptors such as drug-likeliness, topological polar surface area, and\nsynthetic accessibility scores. These properties serve as proxy rewards,\nguiding A-GFNs towards regions of chemical space that exhibit desirable\npharmacological properties. We further our method by implementing a\ngoal-conditioned fine-tuning process, which adapts A-GFNs to optimize for\nspecific target properties. In this work, we pretrain A-GFN on the ZINC15\noffline dataset and employ robust evaluation metrics to show the effectiveness\nof our approach when compared to other relevant baseline methods in drug\ndesign.", "paper_summary_zh": "生成式流動網路 (GFlowNets) 是一類生成式模型，最近已成為生成多樣化且高品質分子結構的合適框架，方法是從未正規化的獎勵分佈中學習。此方向先前的研究通常透過使用預定義的分子片段作為建構區塊來限制探索，這限制了可存取的化學空間。在這項研究中，我們引入了原子生成式流動網路 (A-GFN)，這是一個基礎生成式模型，利用個別原子作為建構區塊，以更全面地探索類藥物化學空間。我們提出了一種使用離線類藥物分子資料集的無監督預訓練方法，該方法以低成本但有資訊性的分子描述符（例如類藥性、拓撲極性表面積和合成可及性分數）為條件，對 A-GFN 進行條件設定。這些屬性作為代理獎勵，引導 A-GFN 朝向展現理想藥理特性的化學空間區域。我們透過實作目標條件微調程序進一步改進方法，該程序調整 A-GFN 以最佳化特定目標屬性。在這項研究中，我們在 ZINC15 離線資料集上預訓練 A-GFN，並採用穩健的評估指標，在與其他相關基線方法進行比較時，顯示我們的方法的有效性在藥物設計中。", "author": "Mohit Pandey et.al.", "authors": "Mohit Pandey, Gopeshh Subbaraj, Emmanuel Bengio", "id": "2409.09702v1", "paper_url": "http://arxiv.org/abs/2409.09702v1", "repo": "null"}}