{"2410.11261": {"publish_time": "2024-10-15", "title": "Beyond Linear Approximations: A Novel Pruning Approach for Attention Matrix", "paper_summary": "Large Language Models (LLMs) have shown immense potential in enhancing\nvarious aspects of our daily lives, from conversational AI to search and AI\nassistants. However, their growing capabilities come at the cost of extremely\nlarge model sizes, making deployment on edge devices challenging due to memory\nand computational constraints. This paper introduces a novel approach to LLM\nweight pruning that directly optimizes for approximating the attention matrix,\na core component of transformer architectures. Unlike existing methods that\nfocus on linear approximations, our approach accounts for the non-linear nature\nof the Softmax attention mechanism. We provide theoretical guarantees for the\nconvergence of our Gradient Descent-based optimization method to a near-optimal\npruning mask solution. Our preliminary empirical results demonstrate the\neffectiveness of this approach in maintaining model performance while\nsignificantly reducing computational costs. This work establishes a new\ntheoretical foundation for pruning algorithm design in LLMs, potentially paving\nthe way for more efficient LLM inference on resource-constrained devices.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出極大的潛力，可增強我們日常生活中的各個面向，從對話式 AI 到搜尋和 AI 助理。然而，它們日益增長的效能是以極大的模型規模為代價，這使得在邊緣裝置上部署時面臨記憶體和運算限制的挑戰。本文介紹了一種創新的 LLM 權重剪枝方法，可直接針對近似注意矩陣進行最佳化，而注意矩陣是 Transformer 架構的核心元件。與專注於線性近似的現有方法不同，我們的做法考量了 Softmax 注意力機制的非線性性質。我們為基於梯度下降的最佳化方法提供了理論保證，以收斂到近乎最佳的剪枝遮罩解。我們的初步實證結果證明了此方法在維持模型效能的同時，大幅降低運算成本的有效性。這項工作為 LLM 中的剪枝演算法設計建立了新的理論基礎，可能為在資源受限的裝置上進行更有效率的 LLM 推論鋪路。", "author": "Yingyu Liang et.al.", "authors": "Yingyu Liang, Jiangxuan Long, Zhenmei Shi, Zhao Song, Yufa Zhou", "id": "2410.11261v1", "paper_url": "http://arxiv.org/abs/2410.11261v1", "repo": "null"}}