{"2501.19202": {"publish_time": "2025-01-31", "title": "Improving the Robustness of Representation Misdirection for Large Language Model Unlearning", "paper_summary": "Representation Misdirection (RM) and variants are established large language\nmodel (LLM) unlearning methods with state-of-the-art performance. In this\npaper, we show that RM methods inherently reduce models' robustness, causing\nthem to misbehave even when a single non-adversarial forget-token is in the\nretain-query. Toward understanding underlying causes, we reframe the unlearning\nprocess as backdoor attacks and defenses: forget-tokens act as backdoor\ntriggers that, when activated in retain-queries, cause disruptions in RM\nmodels' behaviors, similar to successful backdoor attacks. To mitigate this\nvulnerability, we propose Random Noise Augmentation -- a model and method\nagnostic approach with theoretical guarantees for improving the robustness of\nRM methods. Extensive experiments demonstrate that RNA significantly improves\nthe robustness of RM models while enhancing the unlearning performances.", "paper_summary_zh": "表徵誤導 (RM) 及其變體是已建立的大型語言模型 (LLM) 忘記方法，具有最先進的效能。在本文中，我們展示 RM 方法本質上會降低模型的穩健性，導致它們在保留查詢中即使只有一個非對抗性的遺忘代碼也會出現異常行為。為了理解背後的原因，我們將忘記過程重新定義為後門攻擊和防禦：遺忘代碼充當後門觸發器，當在保留查詢中被啟動時，會造成 RM 模型行為的中斷，類似於成功的後門攻擊。為了減輕此漏洞，我們提出隨機雜訊擴充——一種模型和方法不可知的方法，具有提高 RM 方法穩健性的理論保證。廣泛的實驗表明，RNA 在增強忘記效能的同時，顯著提高了 RM 模型的穩健性。", "author": "Dang Huu-Tien et.al.", "authors": "Dang Huu-Tien, Hoang Thanh-Tung, Le-Minh Nguyen, Naoya Inoue", "id": "2501.19202v2", "paper_url": "http://arxiv.org/abs/2501.19202v2", "repo": "https://github.com/rebelsnlu-jaist/llmu-robustness"}}