{"2411.11217": {"publish_time": "2024-11-18", "title": "MoE-Lightning: High-Throughput MoE Inference on Memory-constrained GPUs", "paper_summary": "Efficient deployment of large language models, particularly Mixture of\nExperts (MoE), on resource-constrained platforms presents significant\nchallenges, especially in terms of computational efficiency and memory\nutilization. The MoE architecture, renowned for its ability to increase model\ncapacity without a proportional increase in inference cost, greatly reduces the\ntoken generation latency compared with dense models. However, the large model\nsize makes MoE models inaccessible to individuals without high-end GPUs. In\nthis paper, we propose a high-throughput MoE batch inference system, that\nsignificantly outperforms past work. MoE-Lightning introduces a novel\nCPU-GPU-I/O pipelining schedule, CGOPipe, with paged weights to achieve high\nresource utilization, and a performance model, HRM, based on a Hierarchical\nRoofline Model we introduce to help find policies with higher throughput than\nexisting systems. MoE-Lightning can achieve up to 10.3x higher throughput than\nstate-of-the-art offloading-enabled LLM inference systems for Mixtral 8x7B on a\nsingle T4 GPU (16GB). When the theoretical system throughput is bounded by the\nGPU memory, MoE-Lightning can reach the throughput upper bound with 2-3x less\nCPU memory, significantly increasing resource utilization. MoE-Lightning also\nsupports efficient batch inference for much larger MoEs (e.g., Mixtral 8x22B\nand DBRX) on multiple low-cost GPUs (e.g., 2-4 T4).", "paper_summary_zh": "<paragraph>在資源受限的平台上有效部署大型語言模型，特別是混合專家 (MoE)，會帶來重大的挑戰，特別是在運算效率和記憶體使用方面。MoE 架構以其在不增加推論成本的情況下增加模型容量的能力而聞名，與密集模型相比，它大大降低了標記產生延遲。然而，龐大的模型規模使得沒有高端 GPU 的個人無法使用 MoE 模型。在本文中，我們提出一個高吞吐量的 MoE 批次推論系統，它顯著優於過去的工作。MoE-Lightning 引入了一個新穎的 CPU-GPU-I/O 管道排程，CGOPipe，使用分頁權重來實現高資源利用率，以及一個基於我們引入的分層屋頂線模型的效能模型 HRM，以幫助找到比現有系統具有更高吞吐量的策略。對於單個 T4 GPU（16GB）上的 Mixtral 8x7B，MoE-Lightning 可以比支援卸載的最新 LLM 推論系統實現高達 10.3 倍的吞吐量。當理論系統吞吐量受 GPU 記憶體限制時，MoE-Lightning 可以以少 2-3 倍的 CPU 記憶體達到吞吐量上限，從而顯著提高資源利用率。MoE-Lightning 還支援在多個低成本 GPU（例如 2-4 T4）上對更大的 MoE（例如 Mixtral 8x22B 和 DBRX）進行有效批次推論。</paragraph>", "author": "Shiyi Cao et.al.", "authors": "Shiyi Cao, Shu Liu, Tyler Griggs, Peter Schafhalter, Xiaoxuan Liu, Ying Sheng, Joseph E. Gonzalez, Matei Zaharia, Ion Stoica", "id": "2411.11217v1", "paper_url": "http://arxiv.org/abs/2411.11217v1", "repo": "null"}}