{"2407.14180": {"publish_time": "2024-07-19", "title": "Automatic Classification of News Subjects in Broadcast News: Application to a Gender Bias Representation Analysis", "paper_summary": "This paper introduces a computational framework designed to delineate gender\ndistribution biases in topics covered by French TV and radio news. We\ntranscribe a dataset of 11.7k hours, broadcasted in 2023 on 21 French channels.\nA Large Language Model (LLM) is used in few-shot conversation mode to obtain a\ntopic classification on those transcriptions. Using the generated LLM\nannotations, we explore the finetuning of a specialized smaller classification\nmodel, to reduce the computational cost. To evaluate the performances of these\nmodels, we construct and annotate a dataset of 804 dialogues. This dataset is\nmade available free of charge for research purposes. We show that women are\nnotably underrepresented in subjects such as sports, politics and conflicts.\nConversely, on topics such as weather, commercials and health, women have more\nspeaking time than their overall average across all subjects. We also observe\nrepresentations differences between private and public service channels.", "paper_summary_zh": "本論文介紹一個計算框架，用於描繪法國電視和廣播新聞報導主題中的性別分配偏見。我們轉錄了 2023 年在 21 個法國頻道播放的 11.7k 小時資料集。在小樣本對話模式中使用大型語言模型 (LLM) 來獲得這些轉錄的主题分類。使用生成的 LLM 注釋，我們探討了專門的較小分類模型的微調，以降低計算成本。為了評估這些模型的效能，我們構建並註釋了一個包含 804 個對話的資料集。此資料集免費提供給研究用途。我們顯示女性在體育、政治和衝突等主題中顯著代表不足。相反，在天氣、廣告和健康等主題中，女性的發言時間比她們在所有主題中的平均發言時間更多。我們還觀察到私人和公共服務頻道之間的代表差異。", "author": "Valentin Pelloin et.al.", "authors": "Valentin Pelloin, Lena Dodson, Émile Chapuis, Nicolas Hervé, David Doukhan", "id": "2407.14180v1", "paper_url": "http://arxiv.org/abs/2407.14180v1", "repo": "https://github.com/ina-foss/is24_news_topic"}}