{"2412.06441": {"publish_time": "2024-12-09", "title": "BoRA: Bi-dimensional Weight-Decomposed Low-Rank Adaptation", "paper_summary": "In recent years, Parameter-Efficient Fine-Tuning (PEFT) methods like Low-Rank\nAdaptation (LoRA) have significantly enhanced the adaptability of large-scale\npre-trained models. Weight-Decomposed Low-Rank Adaptation (DoRA) improves upon\nLoRA by separating the magnitude and direction components of the weight matrix,\nleading to superior performance. However, DoRA's improvements are limited to\nthe vertical dimension, resulting in an asymmetrical pattern between horizontal\nand vertical dimensions. This paper introduces BoRA, an innovative extension of\nLoRA and DoRA, characterized by symmetrical properties across horizontal and\nvertical dimensions. Our approach optimizes the weight matrix symmetrically by\nadjusting both column-wise and row-wise magnitudes. Extensive experiments\ndemonstrate that BoRA surpasses state-of-the-art PEFT methods, including LoRA\nand DoRA, achieving superior results across various benchmarks.", "paper_summary_zh": "近年來，參數高效微調 (PEFT) 方法（例如低秩適應 (LoRA)）顯著提升了大規模預訓練模型的適應性。權重分解低秩適應 (DoRA) 透過將權重矩陣的幅度和方向組成分離，進而改善 LoRA，進而提升效能。然而，DoRA 的改善僅限於垂直維度，導致水平維度和垂直維度之間出現不對稱模式。本文介紹 BoRA，這是 LoRA 和 DoRA 的創新延伸，其特徵在於橫向和縱向維度之間具有對稱特性。我們的做法透過調整逐列和逐列幅度，對稱地最佳化權重矩陣。廣泛的實驗證明，BoRA 超越了最先進的 PEFT 方法，包括 LoRA 和 DoRA，在各種基準測試中取得了優異的結果。", "author": "Qiushi Wang et.al.", "authors": "Qiushi Wang, Yuchen Fan, Junwei Bao, Hongfei Jiang, Yang Song", "id": "2412.06441v1", "paper_url": "http://arxiv.org/abs/2412.06441v1", "repo": "null"}}