{"2406.03202": {"publish_time": "2024-06-05", "title": "ChatLang-8: An LLM-Based Synthetic Data Generation Framework for Grammatical Error Correction", "paper_summary": "We explore and improve the capabilities of LLMs to generate data for\ngrammatical error correction (GEC). When merely producing parallel sentences,\ntheir patterns are too simplistic to be valuable as a corpus. To address this\nissue, we propose an automated framework that includes a Subject Selector,\nGrammar Selector, Prompt Manager, and Evaluator. Additionally, we introduce a\nnew dataset for GEC tasks, named \\textbf{ChatLang-8}, which encompasses eight\ntypes of subject nouns and 23 types of grammar. It consists of 1 million pairs\nfeaturing human-like grammatical errors. Our experiments reveal that ChatLang-8\nexhibits a more uniform pattern composition compared to existing GEC datasets.\nFurthermore, we observe improved model performance when using ChatLang-8\ninstead of existing GEC datasets. The experimental results suggest that our\nframework and ChatLang-8 are valuable resources for enhancing ChatGPT's data\ngeneration capabilities.", "paper_summary_zh": "我們探討並改善 LLM 生成語法錯誤修正 (GEC) 資料的能力。當僅產生平行句子時，其模式過於簡化，無法作為語料庫有價值。為了解決這個問題，我們提出一個自動化框架，其中包含主詞選擇器、語法選擇器、提示管理員和評估器。此外，我們還引入一個新的 GEC 任務資料集，稱為 \\textbf{ChatLang-8}，它包含八種類型的名詞和 23 種類型的語法。它包含 100 萬對具有類似人類語法錯誤的句子。我們的實驗表明，與現有的 GEC 資料集相比，ChatLang-8 呈現出更統一的模式組成。此外，我們觀察到在使用 ChatLang-8 而不是現有的 GEC 資料集時，模型效能有所提升。實驗結果表明，我們的框架和 ChatLang-8 是增強 ChatGPT 資料產生能力的寶貴資源。", "author": "Jeiyoon Park et.al.", "authors": "Jeiyoon Park, Chanjun Park, Heuiseok Lim", "id": "2406.03202v1", "paper_url": "http://arxiv.org/abs/2406.03202v1", "repo": "null"}}