{"2502.12961": {"publish_time": "2025-02-18", "title": "Adaptive Tool Use in Large Language Models with Meta-Cognition Trigger", "paper_summary": "Large language models (LLMs) have shown remarkable emergent capabilities,\ntransforming the execution of functional tasks by leveraging external tools for\ncomplex problems that require specialized processing or real-time data. While\nexisting research expands LLMs access to diverse tools (e.g., program\ninterpreters, search engines, weather/map apps), the necessity of using these\ntools is often overlooked, leading to indiscriminate tool invocation. This\nnaive approach raises two key issues:(1) increased delays due to unnecessary\ntool calls, and (2) potential errors resulting from faulty interactions with\nexternal tools. In this paper, we introduce meta-cognition as a proxy for LLMs\nself-assessment of their capabilities, representing the model's awareness of\nits own limitations. Based on this, we propose MeCo, an adaptive\ndecision-making strategy for external tool use. MeCo quantifies metacognitive\nscores by capturing high-level cognitive signals in the representation space,\nguiding when to invoke tools. Notably, MeCo is fine-tuning-free and incurs\nminimal cost. Our experiments show that MeCo accurately detects LLMs' internal\ncognitive signals and significantly improves tool-use decision-making across\nmultiple base models and benchmarks.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出顯著的新興能力，透過運用外部工具來執行功能任務，解決需要專業處理或即時資料的複雜問題，從而轉變任務的執行方式。儘管現有研究擴展了 LLM 對各種工具的存取（例如程式碼詮釋器、搜尋引擎、天氣/地圖應用程式），但使用這些工具的必要性往往被忽略，導致不加選擇地呼叫工具。這種天真的方法提出了兩個關鍵問題：(1) 由於不必要的工具呼叫而導致延遲增加，以及 (2) 由於與外部工具互動錯誤而導致的潛在錯誤。在本文中，我們將元認知引入作為 LLM 自我評估其能力的代理，代表模型意識到其自身的限制。基於此，我們提出了 MeCo，一種用於外部工具使用的適應性決策制定策略。MeCo 透過擷取表徵空間中的高階認知訊號來量化元認知分數，指導何時呼叫工具。值得注意的是，MeCo 是免微調的，而且成本極低。我們的實驗表明，MeCo 能夠準確地偵測 LLM 的內部認知訊號，並大幅改善跨多個基本模型和基準的工具使用決策制定。", "author": "Wenjun Li et.al.", "authors": "Wenjun Li, Dexun Li, Kuicai Dong, Cong Zhang, Hao Zhang, Weiwen Liu, Yasheng Wang, Ruiming Tang, Yong Liu", "id": "2502.12961v1", "paper_url": "http://arxiv.org/abs/2502.12961v1", "repo": "null"}}