{"2410.12521": {"publish_time": "2024-10-16", "title": "Spectrum Sharing using Deep Reinforcement Learning in Vehicular Networks", "paper_summary": "As the number of devices getting connected to the vehicular network grows\nexponentially, addressing the numerous challenges of effectively allocating\nspectrum in dynamic vehicular environment becomes increasingly difficult.\nTraditional methods may not suffice to tackle this issue. In vehicular networks\nsafety critical messages are involved and it is important to implement an\nefficient spectrum allocation paradigm for hassle free communication as well as\nmanage the congestion in the network. To tackle this, a Deep Q Network (DQN)\nmodel is proposed as a solution, leveraging its ability to learn optimal\nstrategies over time and make decisions. The paper presents a few results and\nanalyses, demonstrating the efficacy of the DQN model in enhancing spectrum\nsharing efficiency. Deep Reinforcement Learning methods for sharing spectrum in\nvehicular networks have shown promising outcomes, demonstrating the system's\nability to adjust to dynamic communication environments. Both SARL and MARL\nmodels have exhibited successful rates of V2V communication, with the\ncumulative reward of the RL model reaching its maximum as training progresses.", "paper_summary_zh": "隨著連接到車輛網路的裝置數量呈指數成長，在動態的車輛環境中有效分配頻譜的眾多挑戰變得越來越困難。傳統方法可能不足以解決此問題。在車輛網路中涉及安全關鍵訊息，並且實施有效的頻譜分配範例對於無障礙通訊以及管理網路中的壅塞非常重要。為了解決此問題，提出了深度 Q 網路 (DQN) 模型作為解決方案，利用其隨著時間推移學習最佳策略和做出決策的能力。本文提出了一些結果和分析，證明了 DQN 模型在提高頻譜共享效率方面的效能。車輛網路中用於共享頻譜的深度強化學習方法已顯示出有希望的結果，證明了系統適應動態通訊環境的能力。SARL 和 MARL 模型都展現了成功的 V2V 通訊速率，RL 模型的累積回報隨著訓練的進行而達到最大值。", "author": "Riya Dinesh Deshpande et.al.", "authors": "Riya Dinesh Deshpande, Faheem A. Khan, Qasim Zeeshan Ahmed", "id": "2410.12521v1", "paper_url": "http://arxiv.org/abs/2410.12521v1", "repo": "null"}}