{"2405.04081": {"publish_time": "2024-05-07", "title": "Counterfactual and Semifactual Explanations in Abstract Argumentation: Formal Foundations, Complexity and Computation", "paper_summary": "Explainable Artificial Intelligence and Formal Argumentation have received\nsignificant attention in recent years. Argumentation-based systems often lack\nexplainability while supporting decision-making processes. Counterfactual and\nsemifactual explanations are interpretability techniques that provide insights\ninto the outcome of a model by generating alternative hypothetical instances.\nWhile there has been important work on counterfactual and semifactual\nexplanations for Machine Learning models, less attention has been devoted to\nthese kinds of problems in argumentation. In this paper, we explore\ncounterfactual and semifactual reasoning in abstract Argumentation Framework.\nWe investigate the computational complexity of counterfactual- and\nsemifactual-based reasoning problems, showing that they are generally harder\nthan classical argumentation problems such as credulous and skeptical\nacceptance. Finally, we show that counterfactual and semifactual queries can be\nencoded in weak-constrained Argumentation Framework, and provide a\ncomputational strategy through ASP solvers.", "paper_summary_zh": "可解釋人工智慧與形式論證在近年獲得極大的關注。基於論證的系統在支援決策過程中，往往缺乏可解釋性。反事實與半事實解釋是可解釋性技術，透過產生替代的假設實例，提供模型結果的見解。儘管機器學習模型的反事實與半事實解釋已有重要的研究，但論證中這類問題較少受到關注。在本文中，我們探討抽象論證框架中的反事實與半事實推理。我們研究反事實與半事實推理問題的計算複雜度，證明它們通常比經典的論證問題（例如輕信與懷疑接受）更難。最後，我們證明反事實與半事實查詢可以編碼在弱約束論證框架中，並透過 ASP 求解器提供計算策略。", "author": "Gianvincenzo Alfano et.al.", "authors": "Gianvincenzo Alfano, Sergio Greco, Francesco Parisi, Irina Trubitsyna", "id": "2405.04081v1", "paper_url": "http://arxiv.org/abs/2405.04081v1", "repo": "null"}}