{"2410.02761": {"publish_time": "2024-10-03", "title": "FakeShield: Explainable Image Forgery Detection and Localization via Multi-modal Large Language Models", "paper_summary": "The rapid development of generative AI is a double-edged sword, which not\nonly facilitates content creation but also makes image manipulation easier and\nmore difficult to detect. Although current image forgery detection and\nlocalization (IFDL) methods are generally effective, they tend to face two\nchallenges: \\textbf{1)} black-box nature with unknown detection principle,\n\\textbf{2)} limited generalization across diverse tampering methods (e.g.,\nPhotoshop, DeepFake, AIGC-Editing). To address these issues, we propose the\nexplainable IFDL task and design FakeShield, a multi-modal framework capable of\nevaluating image authenticity, generating tampered region masks, and providing\na judgment basis based on pixel-level and image-level tampering clues.\nAdditionally, we leverage GPT-4o to enhance existing IFDL datasets, creating\nthe Multi-Modal Tamper Description dataSet (MMTD-Set) for training FakeShield's\ntampering analysis capabilities. Meanwhile, we incorporate a Domain Tag-guided\nExplainable Forgery Detection Module (DTE-FDM) and a Multi-modal Forgery\nLocalization Module (MFLM) to address various types of tamper detection\ninterpretation and achieve forgery localization guided by detailed textual\ndescriptions. Extensive experiments demonstrate that FakeShield effectively\ndetects and localizes various tampering techniques, offering an explainable and\nsuperior solution compared to previous IFDL methods.", "paper_summary_zh": "生成式 AI 的快速發展是一把雙面刃，它不僅促進了內容創作，還使影像處理更容易，且更難以偵測。儘管目前的影像偽造偵測與定位 (IFDL) 方法通常有效，但它們往往面臨兩項挑戰：\\textbf{1)} 具有未知偵測原理的黑盒子性質，\\textbf{2)} 在不同的竄改方法（例如 Photoshop、DeepFake、AIGC 編輯）中，有限的概化能力。為了解決這些問題，我們提出了可解釋的 IFDL 任務，並設計了 FakeShield，這是一個多模式架構，能夠評估影像真實性、產生竄改區域遮罩，並根據像素級別和影像級別竄改線索提供判斷依據。此外，我們利用 GPT-4o 來增強現有的 IFDL 資料集，建立多模式竄改描述資料集 (MMTD-Set)，以訓練 FakeShield 的竄改分析能力。同時，我們整合了網域標籤引導的可解釋偽造偵測模組 (DTE-FDM) 和多模式偽造定位模組 (MFLM)，以解決各種類型的竄改偵測詮釋，並根據詳細的文字描述，實現偽造定位。廣泛的實驗證明，與先前的 IFDL 方法相比，FakeShield 有效地偵測和定位各種竄改技術，提供了一個可解釋且優異的解決方案。", "author": "Zhipei Xu et.al.", "authors": "Zhipei Xu, Xuanyu Zhang, Runyi Li, Zecheng Tang, Qing Huang, Jian Zhang", "id": "2410.02761v1", "paper_url": "http://arxiv.org/abs/2410.02761v1", "repo": "null"}}