{"2410.22124": {"publish_time": "2024-10-29", "title": "RankUp: Boosting Semi-Supervised Regression with an Auxiliary Ranking Classifier", "paper_summary": "State-of-the-art (SOTA) semi-supervised learning techniques, such as FixMatch\nand it's variants, have demonstrated impressive performance in classification\ntasks. However, these methods are not directly applicable to regression tasks.\nIn this paper, we present RankUp, a simple yet effective approach that adapts\nexisting semi-supervised classification techniques to enhance the performance\nof regression tasks. RankUp achieves this by converting the original regression\ntask into a ranking problem and training it concurrently with the original\nregression objective. This auxiliary ranking classifier outputs a\nclassification result, thus enabling integration with existing semi-supervised\nclassification methods. Moreover, we introduce regression distribution\nalignment (RDA), a complementary technique that further enhances RankUp's\nperformance by refining pseudo-labels through distribution alignment. Despite\nits simplicity, RankUp, with or without RDA, achieves SOTA results in across a\nrange of regression benchmarks, including computer vision, audio, and natural\nlanguage processing tasks. Our code and log data are open-sourced at\nhttps://github.com/pm25/semi-supervised-regression.", "paper_summary_zh": "最先進（SOTA）的半監督式學習技術，例如 FixMatch 及其變體，已在分類任務中展現出令人印象深刻的效能。然而，這些方法並不直接適用於回歸任務。在本文中，我們提出 RankUp，一種簡單但有效的方法，它採用現有的半監督式分類技術來增強回歸任務的效能。RankUp 透過將原始回歸任務轉換為排名問題，並與原始回歸目標同時訓練來達成此目標。這個輔助排名分類器會輸出一個分類結果，因此能夠與現有的半監督式分類方法整合。此外，我們引入了回歸分佈比對（RDA），這是一種互補技術，它透過分佈比對精煉偽標籤，進一步增強 RankUp 的效能。儘管 RankUp 非常簡單，無論是否使用 RDA，它都能在各種回歸基準中達成 SOTA 結果，包括電腦視覺、音訊和自然語言處理任務。我們的程式碼和記錄資料已在 https://github.com/pm25/semi-supervised-regression 開源。", "author": "Pin-Yen Huang et.al.", "authors": "Pin-Yen Huang, Szu-Wei Fu, Yu Tsao", "id": "2410.22124v1", "paper_url": "http://arxiv.org/abs/2410.22124v1", "repo": "https://github.com/pm25/semi-supervised-regression"}}