{"2411.10055": {"publish_time": "2024-11-15", "title": "Towards unearthing neglected climate innovations from scientific literature using Large Language Models", "paper_summary": "Climate change poses an urgent global threat, needing the rapid\nidentification and deployment of innovative solutions. We hypothesise that many\nof these solutions already exist within scientific literature but remain\nunderutilised. To address this gap, this study employs a curated dataset\nsourced from OpenAlex, a comprehensive repository of scientific papers.\nUtilising Large Language Models (LLMs), such as GPT4-o from OpenAI, we evaluate\ntitle-abstract pairs from scientific papers on seven dimensions, covering\nclimate change mitigation potential, stage of technological development, and\nreadiness for deployment. The outputs of the language models are then compared\nwith human evaluations to assess their effectiveness in identifying promising\nyet overlooked climate innovations. Our findings suggest that these LLM-based\nmodels can effectively augment human expertise, uncovering climate solutions\nthat are potentially impactful but with far greater speed, throughput and\nconsistency. Here, we focused on UK-based solutions, but the workflow is\nregion-agnostic. This work contributes to the discovery of neglected\ninnovations in scientific literature and demonstrates the potential of AI in\nenhancing climate action strategies.", "paper_summary_zh": "氣候變遷構成一項迫切的全球威脅，需要快速找出並部署創新解決方案。我們假設，這些解決方案中的許多方案已存在於科學文獻中，但仍未得到充分利用。為了解決這個差距，本研究採用從 OpenAlex（一個全面的科學論文儲存庫）取得的精選資料集。利用大型語言模型 (LLM)，例如 OpenAI 的 GPT4-o，我們從七個面向評估科學論文的標題摘要配對，包括氣候變遷減緩潛力、技術發展階段和部署準備情況。然後將語言模型的輸出與人類評估進行比較，以評估其在找出有希望但被忽視的氣候創新方面的有效性。我們的研究結果表明，這些基於 LLM 的模型可以有效地擴充人類專長，找出可能產生影響但速度、產量和一致性遠高於人類的氣候解決方案。在此，我們專注於英國的解決方案，但工作流程與地區無關。這項工作有助於找出科學文獻中被忽視的創新，並展示了 AI 在加強氣候行動策略方面的潛力。", "author": "César Quilodrán-Casas et.al.", "authors": "César Quilodrán-Casas, Christopher Waite, Nicole Alhadeff, Diyona Dsouza, Cathal Hughes, Larissa Kunstel-Tabet, Alyssa Gilbert", "id": "2411.10055v1", "paper_url": "http://arxiv.org/abs/2411.10055v1", "repo": "null"}}