{"2411.16365": {"publish_time": "2024-11-25", "title": "Multi-modal Retrieval Augmented Multi-modal Generation: A Benchmark, Evaluate Metrics and Strong Baselines", "paper_summary": "This paper investigates an intriguing task of Multi-modal Retrieval Augmented\nMulti-modal Generation (M$^2$RAG). This task requires foundation models to\nbrowse multi-modal web pages, with mixed text and images, and generate\nmulti-modal responses for solving user queries, which exhibits better\ninformation density and readability. Given the early researching stage of\nM$^2$RAG task, there is a lack of systematic studies and analysis. To fill this\ngap, we construct a benchmark for M$^2$RAG task, equipped with a suite of\ntext-modal metrics and multi-modal metrics to analyze the capabilities of\nexisting foundation models. Besides, we also propose several effective methods\nfor foundation models to accomplish this task, based on the comprehensive\nevaluation results on our benchmark. Extensive experimental results reveal\nseveral intriguing phenomena worth further research.", "paper_summary_zh": "本文探討了一項引人入勝的多模態檢索增強多模態生成 (M$^2$RAG) 任務。此任務要求基礎模型瀏覽包含文字和圖片的混合多模態網頁，並針對使用者查詢產生多模態回應，以展現更好的資訊密度和可讀性。考量到 M$^2$RAG 任務仍處於早期研究階段，因此缺乏系統性的研究和分析。為了填補此一空白，我們建構了一個 M$^2$RAG 任務基準，並配備一組文字模態指標和多模態指標，以分析現有基礎模型的能力。此外，我們也針對基礎模型提出幾種有效的方法來完成此任務，這些方法是根據我們基準上的綜合評估結果而得。廣泛的實驗結果揭露了幾個值得進一步研究的有趣現象。", "author": "Zi-Ao Ma et.al.", "authors": "Zi-Ao Ma, Tian Lan, Rong-Cheng Tu, Yong Hu, Heyan Huang, Xian-Ling Mao", "id": "2411.16365v1", "paper_url": "http://arxiv.org/abs/2411.16365v1", "repo": "null"}}