{"2409.18023": {"publish_time": "2024-09-26", "title": "DARE: Diverse Visual Question Answering with Robustness Evaluation", "paper_summary": "Vision Language Models (VLMs) extend remarkable capabilities of text-only\nlarge language models and vision-only models, and are able to learn from and\nprocess multi-modal vision-text input. While modern VLMs perform well on a\nnumber of standard image classification and image-text matching tasks, they\nstill struggle with a number of crucial vision-language (VL) reasoning\nabilities such as counting and spatial reasoning. Moreover, while they might be\nvery brittle to small variations in instructions and/or evaluation protocols,\nexisting benchmarks fail to evaluate their robustness (or rather the lack of\nit). In order to couple challenging VL scenarios with comprehensive robustness\nevaluation, we introduce DARE, Diverse Visual Question Answering with\nRobustness Evaluation, a carefully created and curated multiple-choice VQA\nbenchmark. DARE evaluates VLM performance on five diverse categories and\nincludes four robustness-oriented evaluations based on the variations of:\nprompts, the subsets of answer options, the output format and the number of\ncorrect answers. Among a spectrum of other findings, we report that\nstate-of-the-art VLMs still struggle with questions in most categories and are\nunable to consistently deliver their peak performance across the tested\nrobustness evaluations. The worst case performance across the subsets of\noptions is up to 34% below the performance in the standard case. The robustness\nof the open-source VLMs such as LLaVA 1.6 and Idefics2 cannot match the\nclosed-source models such as GPT-4 and Gemini, but even the latter remain very\nbrittle to different variations.", "paper_summary_zh": "視覺語言模型 (VLM) 擴展了純文字大型語言模型和純視覺模型的顯著能力，並且能夠從多模態視覺文字輸入中學習和處理。雖然現代 VLM 在許多標準圖像分類和圖像文字匹配任務上表現良好，但它們在許多關鍵的視覺語言 (VL) 推理能力上仍存在困難，例如計數和空間推理。此外，雖然它們可能對指令和/或評估協議的微小變化非常脆弱，但現有的基準未能評估其健壯性（或更確切地說，缺乏健壯性）。為了將具有挑戰性的 VL 場景與全面的健壯性評估相結合，我們引入了 DARE，一種多選題 VQA 基準，具有健壯性評估，經過仔細創建和策劃。DARE 評估了 VLM 在五個不同類別上的表現，並包括四項基於以下變化的健壯性導向評估：提示、答案選項的子集、輸出格式和正確答案的數量。在其他一系列發現中，我們報告說，最先進的 VLM 仍然難以應對大多數類別中的問題，並且無法在測試的健壯性評估中持續提供其峰值效能。選項子集中的最差情況效能比標準情況下的效能低 34%。LLaVA 1.6 和 Idefics2 等開源 VLM 的健壯性無法與 GPT-4 和 Gemini 等閉源模型相匹配，但即使是後者對不同的變化仍然非常脆弱。", "author": "Hannah Sterz et.al.", "authors": "Hannah Sterz, Jonas Pfeiffer, Ivan Vulić", "id": "2409.18023v1", "paper_url": "http://arxiv.org/abs/2409.18023v1", "repo": "null"}}