{"2408.16313": {"publish_time": "2024-08-29", "title": "FA-YOLO: Research On Efficient Feature Selection YOLO Improved Algorithm Based On FMDS and AGMF Modules", "paper_summary": "Over the past few years, the YOLO series of models has emerged as one of the\ndominant methodologies in the realm of object detection. Many studies have\nadvanced these baseline models by modifying their architectures, enhancing data\nquality, and developing new loss functions. However, current models still\nexhibit deficiencies in processing feature maps, such as overlooking the fusion\nof cross-scale features and a static fusion approach that lacks the capability\nfor dynamic feature adjustment. To address these issues, this paper introduces\nan efficient Fine-grained Multi-scale Dynamic Selection Module (FMDS Module),\nwhich applies a more effective dynamic feature selection and fusion method on\nfine-grained multi-scale feature maps, significantly enhancing the detection\naccuracy of small, medium, and large-sized targets in complex environments.\nFurthermore, this paper proposes an Adaptive Gated Multi-branch Focus Fusion\nModule (AGMF Module), which utilizes multiple parallel branches to perform\ncomplementary fusion of various features captured by the gated unit branch,\nFMDS Module branch, and TripletAttention branch. This approach further enhances\nthe comprehensiveness, diversity, and integrity of feature fusion. This paper\nhas integrated the FMDS Module, AGMF Module, into Yolov9 to develop a novel\nobject detection model named FA-YOLO. Extensive experimental results show that\nunder identical experimental conditions, FA-YOLO achieves an outstanding 66.1%\nmean Average Precision (mAP) on the PASCAL VOC 2007 dataset, representing 1.0%\nimprovement over YOLOv9's 65.1%. Additionally, the detection accuracies of\nFA-YOLO for small, medium, and large targets are 44.1%, 54.6%, and 70.8%,\nrespectively, showing improvements of 2.0%, 3.1%, and 0.9% compared to YOLOv9's\n42.1%, 51.5%, and 69.9%.", "paper_summary_zh": "<paragraph>在過去幾年中，YOLO 系列模型已成為目標偵測領域中其中一種主要方法。許多研究透過修改架構、增強資料品質以及開發新的損失函數來提升這些基準模型。然而，目前的模型在處理特徵圖時仍存在缺陷，例如忽略跨尺度特徵的融合，以及缺乏動態特徵調整能力的靜態融合方法。為了解決這些問題，本文提出了一個高效的細粒度多尺度動態選擇模組（FMDS 模組），它在細粒度的多尺度特徵圖上應用更有效的動態特徵選擇和融合方法，大幅提升了在複雜環境中偵測小型、中型和大型目標的準確度。此外，本文提出了一個自適應閘控多支線焦點融合模組（AGMF 模組），它利用多個並行支線來執行閘控單元支線、FMDS 模組支線和 TripletAttention 支線所擷取的各種特徵的互補融合。這種方法進一步增強了特徵融合的全面性、多樣性和完整性。本文已將 FMDS 模組、AGMF 模組整合到 Yolov9 中，開發了一個名為 FA-YOLO 的新目標偵測模型。廣泛的實驗結果顯示，在相同的實驗條件下，FA-YOLO 在 PASCAL VOC 2007 資料集上達到了 66.1% 的出色平均準確度（mAP），比 YOLOv9 的 65.1% 提升了 1.0%。此外，FA-YOLO 對小型、中型和大型目標的偵測準確度分別為 44.1%、54.6% 和 70.8%，與 YOLOv9 的 42.1%、51.5% 和 69.9% 相比，分別提升了 2.0%、3.1% 和 0.9%。</paragraph>", "author": "Yukang Huo et.al.", "authors": "Yukang Huo, Mingyuan Yao, Qingbin Tian, Tonghao Wang, Ruifeng Wang, Haihua Wang", "id": "2408.16313v1", "paper_url": "http://arxiv.org/abs/2408.16313v1", "repo": "null"}}