{"2412.08169": {"publish_time": "2024-12-11", "title": "Illusory VQA: Benchmarking and Enhancing Multimodal Models on Visual Illusions", "paper_summary": "In recent years, Visual Question Answering (VQA) has made significant\nstrides, particularly with the advent of multimodal models that integrate\nvision and language understanding. However, existing VQA datasets often\noverlook the complexities introduced by image illusions, which pose unique\nchallenges for both human perception and model interpretation. In this study,\nwe introduce a novel task called Illusory VQA, along with four specialized\ndatasets: IllusionMNIST, IllusionFashionMNIST, IllusionAnimals, and\nIllusionChar. These datasets are designed to evaluate the performance of\nstate-of-the-art multimodal models in recognizing and interpreting visual\nillusions. We assess the zero-shot performance of various models, fine-tune\nselected models on our datasets, and propose a simple yet effective solution\nfor illusion detection using Gaussian and blur low-pass filters. We show that\nthis method increases the performance of models significantly and in the case\nof BLIP-2 on IllusionAnimals without any fine-tuning, it outperforms humans.\nOur findings highlight the disparity between human and model perception of\nillusions and demonstrate that fine-tuning and specific preprocessing\ntechniques can significantly enhance model robustness. This work contributes to\nthe development of more human-like visual understanding in multimodal models\nand suggests future directions for adapting filters using learnable parameters.", "paper_summary_zh": "近年來，視覺問答（VQA）取得了顯著進展，特別是隨著整合視覺和語言理解的多模態模型的出現。然而，現有的 VQA 資料集通常會忽略由視覺錯覺帶來的複雜性，而這對人類知覺和模型解釋都構成了獨特的挑戰。在本研究中，我們引入了一項稱為 Illusory VQA 的新任務，以及四個專門的資料集：IllusionMNIST、IllusionFashionMNIST、IllusionAnimals 和 IllusionChar。這些資料集旨在評估最先進的多模態模型在識別和解釋視覺錯覺方面的效能。我們評估了各種模型的零次學習效能，微調了我們資料集中的選定模型，並提出了一個簡單但有效的解決方案，使用高斯和模糊低通濾波器進行錯覺偵測。我們表明，這種方法顯著提升了模型效能，在沒有任何微調的情況下，對於 IllusionAnimals 上的 BLIP-2，它的表現優於人類。我們的研究結果突出了人類和模型對錯覺感知的差異，並證明微調和特定的預處理技術可以顯著增強模型的穩健性。這項工作有助於在多模態模型中開發更接近人類的視覺理解，並提出了使用可學習參數調整濾波器的未來方向。", "author": "Mohammadmostafa Rostamkhani et.al.", "authors": "Mohammadmostafa Rostamkhani, Baktash Ansari, Hoorieh Sabzevari, Farzan Rahmani, Sauleh Eetemadi", "id": "2412.08169v1", "paper_url": "http://arxiv.org/abs/2412.08169v1", "repo": "https://github.com/IllusoryVQA/IllusoryVQA"}}