{"2412.15603": {"publish_time": "2024-12-20", "title": "Dynamic Label Name Refinement for Few-Shot Dialogue Intent Classification", "paper_summary": "Dialogue intent classification aims to identify the underlying purpose or\nintent of a user's input in a conversation. Current intent classification\nsystems encounter considerable challenges, primarily due to the vast number of\npossible intents and the significant semantic overlap among similar intent\nclasses. In this paper, we propose a novel approach to few-shot dialogue intent\nclassification through in-context learning, incorporating dynamic label\nrefinement to address these challenges. Our method retrieves relevant examples\nfor a test input from the training set and leverages a large language model to\ndynamically refine intent labels based on semantic understanding, ensuring that\nintents are clearly distinguishable from one another. Experimental results\ndemonstrate that our approach effectively resolves confusion between\nsemantically similar intents, resulting in significantly enhanced performance\nacross multiple datasets compared to baselines. We also show that our method\ngenerates more interpretable intent labels, and has a better semantic coherence\nin capturing underlying user intents compared to baselines.", "paper_summary_zh": "對話意圖分類旨在識別使用者在對話中輸入內容的底層目的或意圖。目前的意圖分類系統會遇到相當大的挑戰，主要是因為可能的意圖數量龐大，以及類似的意圖類別之間存在顯著的語意重疊。在本文中，我們提出了一種透過情境學習進行少量樣本對話意圖分類的新方法，並結合動態標籤精煉來應對這些挑戰。我們的做法會從訓練集中擷取測試輸入相關的範例，並利用大型語言模型根據語意理解動態精煉意圖標籤，確保意圖彼此之間有明顯區別。實驗結果證明，與基準線相比，我們的做法有效解決了語意相似意圖之間的混淆，導致在多個資料集中的效能顯著提升。我們也證明了，我們的做法會產生更多可解釋的意圖標籤，並且在捕捉底層使用者意圖方面具有更好的語意一致性，優於基準線。", "author": "Gyutae Park et.al.", "authors": "Gyutae Park, Ingeol Baek, ByeongJeong Kim, Joongbo Shin, Hwanhee Lee", "id": "2412.15603v1", "paper_url": "http://arxiv.org/abs/2412.15603v1", "repo": "null"}}