{"2412.15487": {"publish_time": "2024-12-20", "title": "Multi-LLM Text Summarization", "paper_summary": "In this work, we propose a Multi-LLM summarization framework, and investigate\ntwo different multi-LLM strategies including centralized and decentralized. Our\nmulti-LLM summarization framework has two fundamentally important steps at each\nround of conversation: generation and evaluation. These steps are different\ndepending on whether our multi-LLM decentralized summarization is used or\ncentralized. In both our multi-LLM decentralized and centralized strategies, we\nhave k different LLMs that generate diverse summaries of the text. However,\nduring evaluation, our multi-LLM centralized summarization approach leverages a\nsingle LLM to evaluate the summaries and select the best one whereas k LLMs are\nused for decentralized multi-LLM summarization. Overall, we find that our\nmulti-LLM summarization approaches significantly outperform the baselines that\nleverage only a single LLM by up to 3x. These results indicate the\neffectiveness of multi-LLM approaches for summarization.", "paper_summary_zh": "在這項工作中，我們提出了一個多 LLM 摘要架構，並探討了兩種不同的多 LLM 策略，包括集中式和分散式。我們的多 LLM 摘要架構在每個對話回合中都有兩個基本重要的步驟：生成和評估。這些步驟會根據我們使用的是多 LLM 分散式摘要還是集中式摘要而有所不同。在我們的多 LLM 分散式和集中式策略中，我們有 k 個不同的 LLM 來產生文本的多樣化摘要。然而，在評估期間，我們的多 LLM 集中式摘要方法利用單一的 LLM 來評估摘要並選出最佳摘要，而分散式多 LLM 摘要則使用 k 個 LLM。總體而言，我們發現我們的多 LLM 摘要方法顯著優於僅利用單一 LLM 的基準，最多可達 3 倍。這些結果表明多 LLM 方法對於摘要的有效性。", "author": "Jiangnan Fang et.al.", "authors": "Jiangnan Fang, Cheng-Tse Liu, Jieun Kim, Yash Bhedaru, Ethan Liu, Nikhil Singh, Nedim Lipka, Puneet Mathur, Nesreen K. Ahmed, Franck Dernoncourt, Ryan A. Rossi, Hanieh Deilamsalehy", "id": "2412.15487v1", "paper_url": "http://arxiv.org/abs/2412.15487v1", "repo": "null"}}