{"2409.08372": {"publish_time": "2024-09-12", "title": "FedProphet: Memory-Efficient Federated Adversarial Training via Theoretic-Robustness and Low-Inconsistency Cascade Learning", "paper_summary": "Federated Learning (FL) provides a strong privacy guarantee by enabling local\ntraining across edge devices without training data sharing, and Federated\nAdversarial Training (FAT) further enhances the robustness against adversarial\nexamples, promoting a step toward trustworthy artificial intelligence. However,\nFAT requires a large model to preserve high accuracy while achieving strong\nrobustness, and it is impractically slow when directly training with\nmemory-constrained edge devices due to the memory-swapping latency. Moreover,\nexisting memory-efficient FL methods suffer from poor accuracy and weak\nrobustness in FAT because of inconsistent local and global models, i.e.,\nobjective inconsistency.\n  In this paper, we propose FedProphet, a novel FAT framework that can achieve\nmemory efficiency, adversarial robustness, and objective consistency\nsimultaneously. FedProphet partitions the large model into small cascaded\nmodules such that the memory-constrained devices can conduct adversarial\ntraining module-by-module. A strong convexity regularization is derived to\ntheoretically guarantee the robustness of the whole model, and we show that the\nstrong robustness implies low objective inconsistency in FedProphet. We also\ndevelop a training coordinator on the server of FL, with Adaptive Perturbation\nAdjustment for utility-robustness balance and Differentiated Module Assignment\nfor objective inconsistency mitigation. FedProphet empirically shows a\nsignificant improvement in both accuracy and robustness compared to previous\nmemory-efficient methods, achieving almost the same performance of end-to-end\nFAT with 80% memory reduction and up to 10.8x speedup in training time.", "paper_summary_zh": "<paragraph>联邦学习 (FL) 借由启用边缘设备进行本地训练，且不分享训练数据，提供强力的隐私保证，而联邦对抗训练 (FAT) 进一步增强对抗范例的稳健性，促进迈向可信赖的人工智能。然而，FAT 需要大型模型来保持高准确性，同时实现强稳健性，并且直接使用内存受限的边缘设备进行训练时，由于内存交换延迟，其实际上很慢。此外，现有的内存高效 FL 方法在 FAT 中遭受准确性差和稳健性弱的问题，这是因为本地模型和全局模型不一致，即目标不一致。\n  在本文中，我们提出 FedProphet，这是一个新颖的 FAT 框架，可以同时实现内存效率、对抗稳健性和目标一致性。FedProphet 将大型模型分割成小型级联模块，以便内存受限的设备可以逐模块地进行对抗训练。推导出强凸性正则化来从理论上保证整个模型的稳健性，并且我们表明强稳健性表示 FedProphet 中的低目标不一致性。我们还在 FL 的服务器上开发了一个训练协调器，其中包含用于效用稳健性平衡的自适应扰动调整和用于缓解目标不一致性的差异化模块分配。FedProphet 在准确性和稳健性方面均显示出显着的改善，与之前的内存高效方法相比，实现了与端到端 FAT 几乎相同的性能，内存减少了 80%，训练时间加快了 10.8 倍。</paragraph>", "author": "Minxue Tang et.al.", "authors": "Minxue Tang, Yitu Wang, Jingyang Zhang, Louis DiValentin, Aolin Ding, Amin Hass, Yiran Chen, Hai \"Helen\" Li", "id": "2409.08372v1", "paper_url": "http://arxiv.org/abs/2409.08372v1", "repo": "null"}}