{"2409.02667": {"publish_time": "2024-09-04", "title": "Creating Domain-Specific Translation Memories for Machine Translation Fine-tuning: The TRENCARD Bilingual Cardiology Corpus", "paper_summary": "This article investigates how translation memories (TM) can be created by\ntranslators or other language professionals in order to compile domain-specific\nparallel corpora , which can then be used in different scenarios, such as\nmachine translation training and fine-tuning, TM leveraging, and/or large\nlanguage model fine-tuning. The article introduces a semi-automatic TM\npreparation methodology leveraging primarily translation tools used by\ntranslators in favor of data quality and control by the translators. This\nsemi-automatic methodology is then used to build a cardiology-based Turkish ->\nEnglish corpus from bilingual abstracts of Turkish cardiology journals. The\nresulting corpus called TRENCARD Corpus has approximately 800,000 source words\nand 50,000 sentences. Using this methodology, translators can build their\ncustom TMs in a reasonable time and use them in their bilingual data requiring\ntasks.", "paper_summary_zh": "本文探討了翻譯人員或其他語言專業人員如何建立翻譯記憶體 (TM)，以編譯特定領域的平行語料庫，然後可將其用於不同的場景，例如機器翻譯訓練和微調、TM 利用和/或大型語言模型微調。本文介紹了一種半自動 TM 準備方法，主要利用翻譯人員使用的翻譯工具，有利於翻譯人員的資料品質和控制。然後使用這種半自動方法從土耳其心臟病學期刊的雙語摘要建立一個以心臟病學為基礎的土耳其語 -> 英語語料庫。所產生的語料庫稱為 TRENCARD 語料庫，大約有 800,000 個來源字詞和 50,000 個句子。使用這種方法，翻譯人員可以在合理的時間內建立自己的自訂 TM，並將其用於需要雙語資料的任務中。", "author": "Gokhan Dogru et.al.", "authors": "Gokhan Dogru", "id": "2409.02667v1", "paper_url": "http://arxiv.org/abs/2409.02667v1", "repo": "null"}}