{"2501.13391": {"publish_time": "2025-01-23", "title": "Can Large Language Models Understand Preferences in Personalized Recommendation?", "paper_summary": "Large Language Models (LLMs) excel in various tasks, including personalized\nrecommendations. Existing evaluation methods often focus on rating prediction,\nrelying on regression errors between actual and predicted ratings. However,\nuser rating bias and item quality, two influential factors behind rating\nscores, can obscure personal preferences in user-item pair data. To address\nthis, we introduce PerRecBench, disassociating the evaluation from these two\nfactors and assessing recommendation techniques on capturing the personal\npreferences in a grouped ranking manner. We find that the LLM-based\nrecommendation techniques that are generally good at rating prediction fail to\nidentify users' favored and disfavored items when the user rating bias and item\nquality are eliminated by grouping users. With PerRecBench and 19 LLMs, we find\nthat while larger models generally outperform smaller ones, they still struggle\nwith personalized recommendation. Our findings reveal the superiority of\npairwise and listwise ranking approaches over pointwise ranking, PerRecBench's\nlow correlation with traditional regression metrics, the importance of user\nprofiles, and the role of pretraining data distributions. We further explore\nthree supervised fine-tuning strategies, finding that merging weights from\nsingle-format training is promising but improving LLMs' understanding of user\npreferences remains an open research problem. Code and data are available at\nhttps://github.com/TamSiuhin/PerRecBench", "paper_summary_zh": "大型語言模型 (LLM) 在各種任務中表現出色，包括個人化推薦。現有的評估方法通常專注於評分預測，依賴於實際評分和預測評分之間的回歸誤差。然而，使用者評分偏差和項目品質這兩個影響評分背後的因素，可能會模糊使用者-項目配對資料中的個人偏好。為了解決這個問題，我們引入了 PerRecBench，將評估與這兩個因素分離，並評估推薦技術以群組排名方式捕捉個人偏好。我們發現，基於 LLM 的推薦技術通常很擅長評分預測，但在群組使用者時無法識別使用者的偏好和不偏好的項目。使用 PerRecBench 和 19 個 LLM，我們發現雖然較大的模型通常優於較小的模型，但它們在個人化推薦方面仍然有困難。我們的研究結果揭示了成對和清單排名方法優於逐點排名、PerRecBench 與傳統回歸指標的低相關性、使用者個人資料的重要性以及預訓練資料分布的角色。我們進一步探討了三種監督微調策略，發現合併單一格式訓練的權重是有希望的，但改善 LLM 對使用者偏好的理解仍然是一個開放的研究問題。程式碼和資料可在 https://github.com/TamSiuhin/PerRecBench 取得", "author": "Zhaoxuan Tan et.al.", "authors": "Zhaoxuan Tan, Zinan Zeng, Qingkai Zeng, Zhenyu Wu, Zheyuan Liu, Fengran Mo, Meng Jiang", "id": "2501.13391v1", "paper_url": "http://arxiv.org/abs/2501.13391v1", "repo": "null"}}