{"2502.03396": {"publish_time": "2025-02-05", "title": "Accurate AI-Driven Emergency Vehicle Location Tracking in Healthcare ITS Digital Twin", "paper_summary": "Creating a Digital Twin (DT) for Healthcare Intelligent Transportation\nSystems (HITS) is a hot research trend focusing on enhancing HITS management,\nparticularly in emergencies where ambulance vehicles must arrive at the crash\nscene on time and track their real-time location is crucial to the medical\nauthorities. Despite the claim of real-time representation, a temporal\nmisalignment persists between the physical and virtual domains, leading to\ndiscrepancies in the ambulance's location representation. This study proposes\nintegrating AI predictive models, specifically Support Vector Regression (SVR)\nand Deep Neural Networks (DNN), within a constructed mock DT data pipeline\nframework to anticipate the medical vehicle's next location in the virtual\nworld. These models align virtual representations with their physical\ncounterparts, i.e., metaphorically offsetting the synchronization delay between\nthe two worlds. Trained meticulously on a historical geospatial dataset, SVR\nand DNN exhibit exceptional prediction accuracy in MATLAB and Python\nenvironments. Through various testing scenarios, we visually demonstrate the\nefficacy of our methodology, showcasing SVR and DNN's key role in significantly\nreducing the witnessed gap within the HITS's DT. This transformative approach\nenhances real-time synchronization in emergency HITS by approximately 88% to\n93%.", "paper_summary_zh": "建立醫療智慧交通系統（HITS）的數位分身（DT）是熱門的研究趨勢，其重點在於提升 HITS 管理，特別是在救護車必須準時抵達車禍現場的緊急情況中，追蹤其即時位置對於醫療單位至關重要。儘管聲稱即時呈現，但實體和虛擬領域之間仍存在時間上的錯位，導致救護車位置呈現上的差異。本研究建議在建構的虛擬 DT 資料管道架構中整合人工智慧預測模型，特別是支援向量回歸（SVR）和深度神經網路（DNN），以預測醫療車輛在虛擬世界的下一個位置。這些模型將虛擬呈現與其實體對應物對齊，也就是說，在兩個世界之間比喻性地抵銷同步延遲。在歷史地理空間資料集上經過仔細訓練，SVR 和 DNN 在 MATLAB 和 Python 環境中展現出卓越的預測準確性。透過各種測試情境，我們視覺化展示了我們方法論的效能，展示了 SVR 和 DNN 在顯著縮小 HITS 的 DT 中見證到的差距方面的關鍵作用。這種變革性的方法將緊急 HITS 中的即時同步提升了大約 88% 到 93%。", "author": "Sarah Al-Shareeda et.al.", "authors": "Sarah Al-Shareeda, Yasar Celik, Bilge Bilgili, Ahmed Al-Dubai, Berk Canberk", "id": "2502.03396v1", "paper_url": "http://arxiv.org/abs/2502.03396v1", "repo": "null"}}