{"2406.16748": {"publish_time": "2024-06-24", "title": "OCALM: Object-Centric Assessment with Language Models", "paper_summary": "Properly defining a reward signal to efficiently train a reinforcement\nlearning (RL) agent is a challenging task. Designing balanced objective\nfunctions from which a desired behavior can emerge requires expert knowledge,\nespecially for complex environments. Learning rewards from human feedback or\nusing large language models (LLMs) to directly provide rewards are promising\nalternatives, allowing non-experts to specify goals for the agent. However,\nblack-box reward models make it difficult to debug the reward. In this work, we\npropose Object-Centric Assessment with Language Models (OCALM) to derive\ninherently interpretable reward functions for RL agents from natural language\ntask descriptions. OCALM uses the extensive world-knowledge of LLMs while\nleveraging the object-centric nature common to many environments to derive\nreward functions focused on relational concepts, providing RL agents with the\nability to derive policies from task descriptions.", "paper_summary_zh": "適當地定義獎勵訊號以有效訓練強化學習 (RL) 代理是一項具有挑戰性的任務。設計平衡的目標函數，以便出現所需的行為，需要專業知識，特別是對於複雜的環境。從人類回饋中學習獎勵或使用大型語言模型 (LLM) 來直接提供獎勵是有前途的替代方案，允許非專家為代理指定目標。然而，黑盒獎勵模型使得調試獎勵變得困難。在這項工作中，我們提出使用語言模型進行以物件為中心的評估 (OCALM)，以從自然語言任務描述中推導出 RL 代理的內在可解釋獎勵函數。OCALM 使用 LLM 廣泛的世界知識，同時利用許多環境中常見的以物件為中心的特性來推導專注於關係概念的獎勵函數，使 RL 代理能夠從任務描述中推導出政策。", "author": "Timo Kaufmann et.al.", "authors": "Timo Kaufmann, Jannis Blüml, Antonia Wüst, Quentin Delfosse, Kristian Kersting, Eyke Hüllermeier", "id": "2406.16748v1", "paper_url": "http://arxiv.org/abs/2406.16748v1", "repo": "null"}}