{"2407.12468": {"publish_time": "2024-07-17", "title": "Search Engines, LLMs or Both? Evaluating Information Seeking Strategies for Answering Health Questions", "paper_summary": "Search engines have traditionally served as primary tools for information\nseeking. However, the new Large Language Models (LLMs) have recently\ndemonstrated remarkable capabilities in multiple tasks and, specifically, their\nadoption as question answering systems is becoming increasingly prevalent. It\nis expected that LLM-based conversational systems and traditional web engines\nwill continue to coexist in the future, supporting end users in various ways.\nBut there is a need for more scientific research on the effectiveness of both\ntypes of systems in facilitating accurate information seeking. In this study,\nwe focus on their merits in answering health questions. We conducted an\nextensive study comparing different web search engines, LLMs and\nretrieval-augmented (RAG) approaches. Our research reveals intriguing\nconclusions. For example, we observed that the quality of webpages potentially\nresponding to a health question does not decline as we navigate further down\nthe ranked lists. However, according to our evaluation, web engines are less\naccurate than LLMs in finding correct answers to health questions. On the other\nhand, LLMs are quite sensitive to the input prompts, and we also found out that\nRAG leads to highly effective information seeking methods.", "paper_summary_zh": "搜尋引擎傳統上一直作為尋找資訊的主要工具。然而，新的大型語言模型 (LLM) 近期已在多項任務中展現出卓越的能力，特別是其被採用為問題解答系統正變得越來越普遍。預計未來基於 LLM 的對話系統和傳統網路引擎將持續共存，以各種方式支援最終使用者。但需要更多科學研究來探討這兩種系統在促進準確資訊搜尋方面的效能。在這項研究中，我們專注於它們在回答健康問題方面的優點。我們進行了一項廣泛的研究，比較了不同的網路搜尋引擎、LLM 和檢索增強 (RAG) 方法。我們的研究揭示了有趣的結論。例如，我們觀察到，隨著我們在排名清單中向下瀏覽，可能會回答健康問題的網頁品質並不會下降。然而，根據我們的評估，網路引擎在尋找健康問題的正確答案方面不如 LLM 準確。另一方面，LLM 對輸入提示非常敏感，我們還發現 RAG 導致高度有效的資訊搜尋方法。", "author": "Marcos Fernández-Pichel et.al.", "authors": "Marcos Fernández-Pichel, Juan C. Pichel, David E. Losada", "id": "2407.12468v2", "paper_url": "http://arxiv.org/abs/2407.12468v2", "repo": "null"}}