{"2502.09931": {"publish_time": "2025-02-14", "title": "TransGUNet: Transformer Meets Graph-based Skip Connection for Medical Image Segmentation", "paper_summary": "Skip connection engineering is primarily employed to address the semantic gap\nbetween the encoder and decoder, while also integrating global dependencies to\nunderstand the relationships among complex anatomical structures in medical\nimage segmentation. Although several models have proposed transformer-based\napproaches to incorporate global dependencies within skip connections, they\noften face limitations in capturing detailed local features with high\ncomputational complexity. In contrast, graph neural networks (GNNs) exploit\ngraph structures to effectively capture local and global features. Leveraging\nthese properties, we introduce an attentional cross-scale graph neural network\n(ACS-GNN), which enhances the skip connection framework by converting\ncross-scale feature maps into a graph structure and capturing complex\nanatomical structures through node attention. Additionally, we observed that\ndeep learning models often produce uninformative feature maps, which degrades\nthe quality of spatial attention maps. To address this problem, we integrated\nentropy-driven feature selection (EFS) with spatial attention, calculating an\nentropy score for each channel and filtering out high-entropy feature maps. Our\ninnovative framework, TransGUNet, comprises ACS-GNN and EFS-based spatial\nattentio} to effectively enhance domain generalizability across various\nmodalities by leveraging GNNs alongside a reliable spatial attention map,\nensuring more robust features within the skip connection. Through comprehensive\nexperiments and analysis, TransGUNet achieved superior segmentation performance\non six seen and eight unseen datasets, demonstrating significantly higher\nefficiency compared to previous methods.", "paper_summary_zh": "跳躍連接工程主要用於解決編碼器和解碼器之間的語義鴻溝，同時還整合全局依賴關係以了解醫學影像分割中複雜解剖結構之間的關係。儘管有幾個模型提出了基於Transformer的架構來整合跳躍連接中的全局依賴關係，但它們在以高計算複雜度擷取詳細的局部特徵時常常面臨限制。相比之下，圖神經網路 (GNN) 利用圖結構有效擷取局部和全局特徵。利用這些屬性，我們引入了注意力跨尺度圖神經網路 (ACS-GNN)，它通過將跨尺度特徵圖轉換為圖結構並通過節點注意力擷取複雜的解剖結構來增強跳躍連接框架。此外，我們觀察到深度學習模型通常會產生無意義的特徵圖，這會降低空間注意力圖的品質。為了解決這個問題，我們將熵驅動特徵選擇 (EFS) 與空間注意力整合在一起，為每個通道計算熵分數並濾出高熵特徵圖。我們創新的框架 TransGUNet 包含 ACS-GNN 和基於 EFS 的空間注意力，通過利用 GNN 以及可靠的空間注意力圖有效增強跨各種模態的域泛化能力，確保跳躍連接中更強大的特徵。透過全面的實驗和分析，TransGUNet 在六個已見和八個未見的資料集上實現了優異的分割效能，證明與先前的方法相比，效率顯著提高。", "author": "Ju-Hyeon Nam et.al.", "authors": "Ju-Hyeon Nam, Nur Suriza Syazwany, Sang-Chul Lee", "id": "2502.09931v1", "paper_url": "http://arxiv.org/abs/2502.09931v1", "repo": "null"}}