{"2412.02334": {"publish_time": "2024-12-03", "title": "Reinforcement learning to learn quantum states for Heisenberg scaling accuracy", "paper_summary": "Learning quantum states is a crucial task for realizing the potential of\nquantum information technology. Recently, neural approaches have emerged as\npromising methods for learning quantum states. We propose a meta-learning model\nthat employs reinforcement learning (RL) to optimize the process of learning\nquantum states. For learning quantum states, our scheme trains a Hardware\nefficient ansatz with a blackbox optimization algorithm, called evolution\nstrategy (ES). To enhance the efficiency of ES, a RL agent dynamically adjusts\nthe hyperparameters of ES. To facilitate the RL training, we introduce an\naction repetition strategy inspired by curriculum learning. The RL agent\nsignificantly improves the sample efficiency of learning random quantum states,\nand achieves infidelity scaling close to the Heisenberg limit. We showcase that\nthe RL agent trained using 3-qubit states can be generalized to learning up to\n5-qubit states. These results highlight the utility of RL-driven meta-learning\nto enhance the efficiency and generalizability of learning quantum states. Our\napproach can be applicable to improve quantum control, quantum optimization,\nand quantum machine learning.", "paper_summary_zh": "學習量子態對於實現量子資訊技術的潛力至關重要。最近，神經網路方法已成為學習量子態的有前途方法。我們提出了一個元學習模型，它採用強化學習 (RL) 來優化學習量子態的過程。對於學習量子態，我們的方案使用一個黑盒最佳化演算法，稱為演化策略 (ES)，來訓練一個硬體有效率的 ansatz。為了提高 ES 的效率，RL 代理會動態調整 ES 的超參數。為了促進 RL 訓練，我們引入了一個受課程學習啟發的動作重複策略。RL 代理顯著地提高了學習隨機量子態的樣本效率，並且實現了接近海森堡極限的不忠實度縮放。我們展示了使用 3 個量子位元態訓練的 RL 代理可以推廣到學習多達 5 個量子位元態。這些結果突顯了 RL 驅動的元學習在提高學習量子態的效率和泛化性方面的效用。我們的做法可以應用於改進量子控制、量子最佳化和量子機器學習。", "author": "Jeongwoo Jae et.al.", "authors": "Jeongwoo Jae, Jeonghoon Hong, Jinho Choo, Yeong-Dae Kwon", "id": "2412.02334v1", "paper_url": "http://arxiv.org/abs/2412.02334v1", "repo": "null"}}