{"2501.09155": {"publish_time": "2025-01-15", "title": "VCRScore: Image captioning metric based on V\\&L Transformers, CLIP, and precision-recall", "paper_summary": "Image captioning has become an essential Vision & Language research task. It\nis about predicting the most accurate caption given a specific image or video.\nThe research community has achieved impressive results by continuously\nproposing new models and approaches to improve the overall model's performance.\nNevertheless, despite increasing proposals, the performance metrics used to\nmeasure their advances have remained practically untouched through the years. A\nprobe of that, nowadays metrics like BLEU, METEOR, CIDEr, and ROUGE are still\nvery used, aside from more sophisticated metrics such as BertScore and\nClipScore.\n  Hence, it is essential to adjust how are measure the advances, limitations,\nand scopes of the new image captioning proposals, as well as to adapt new\nmetrics to these new advanced image captioning approaches.\n  This work proposes a new evaluation metric for the image captioning problem.\nTo do that, first, it was generated a human-labeled dataset to assess to which\ndegree the captions correlate with the image's content. Taking these human\nscores as ground truth, we propose a new metric, and compare it with several\nwell-known metrics, from classical to newer ones. Outperformed results were\nalso found, and interesting insights were presented and discussed.", "paper_summary_zh": "影像標題已成為視覺與語言研究的重要任務。目的是根據特定影像或影片預測最精確的標題。研究社群持續提出新的模型和方法來提升整體模型的效能，已獲得令人印象深刻的成果。儘管提出越來越多的建議，但多年來用於衡量其進展的效能指標實際上並未更動。其中一個探討是，如今像 BLEU、METEOR、CIDEr 和 ROUGE 等指標仍廣泛使用，除了 BertScore 和 ClipScore 等更精密的指標。因此，必須調整我們如何衡量新影像標題建議的進展、限制和範圍，以及調整新的指標以適應這些新的進階影像標題方法。這項研究針對影像標題問題提出新的評量指標。首先，產生一個由人類標記的資料集，以評估標題與影像內容相關的程度。將這些人類評分視為真實依據，我們提出一個新的指標，並將其與幾個著名的指標進行比較，從傳統指標到較新的指標。也發現表現優異的結果，並提出和討論了有趣的見解。", "author": "Guillermo Ruiz et.al.", "authors": "Guillermo Ruiz, Tania Ramírez, Daniela Moctezuma", "id": "2501.09155v1", "paper_url": "http://arxiv.org/abs/2501.09155v1", "repo": "null"}}