{"2501.05981": {"publish_time": "2025-01-10", "title": "Hermit Kingdom Through the Lens of Multiple Perspectives: A Case Study of LLM Hallucination on North Korea", "paper_summary": "Hallucination in large language models (LLMs) remains a significant challenge\nfor their safe deployment, particularly due to its potential to spread\nmisinformation. Most existing solutions address this challenge by focusing on\naligning the models with credible sources or by improving how models\ncommunicate their confidence (or lack thereof) in their outputs. While these\nmeasures may be effective in most contexts, they may fall short in scenarios\nrequiring more nuanced approaches, especially in situations where access to\naccurate data is limited or determining credible sources is challenging. In\nthis study, we take North Korea - a country characterised by an extreme lack of\nreliable sources and the prevalence of sensationalist falsehoods - as a case\nstudy. We explore and evaluate how some of the best-performing multilingual\nLLMs and specific language-based models generate information about North Korea\nin three languages spoken in countries with significant geo-political\ninterests: English (United States, United Kingdom), Korean (South Korea), and\nMandarin Chinese (China). Our findings reveal significant differences,\nsuggesting that the choice of model and language can lead to vastly different\nunderstandings of North Korea, which has important implications given the\nglobal security challenges the country poses.", "paper_summary_zh": "大型語言模型 (LLM) 中的幻覺仍然是其安全部署的一項重大挑戰，特別是因為它有可能散播錯誤訊息。現有的解決方案大多透過將模型與可信來源對齊，或透過改善模型傳達其對輸出結果的信心（或缺乏信心）來解決此挑戰。雖然這些措施在大部分情況下可能有效，但它們在需要更細緻方法的情況下可能會不足，特別是在無法取得準確資料或難以確定可信來源的情況下。在本研究中，我們以北韓為例，這個國家特徵是極度缺乏可靠來源和盛行聳人聽聞的虛假資訊。我們探討並評估一些表現最佳的多語言 LLM 和特定語言模型如何用三種語言產生有關北韓的資訊，而這三種語言是在具有重大地緣政治利益的國家所使用的：英語（美國、英國）、韓語（南韓）和華語（中國）。我們的研究結果揭示了顯著的差異，這表示模型和語言的選擇可能會導致對北韓有截然不同的理解，而這在考量到該國構成的全球安全挑戰時具有重要的意義。", "author": "Eunjung Cho et.al.", "authors": "Eunjung Cho, Won Ik Cho, Soomin Seo", "id": "2501.05981v1", "paper_url": "http://arxiv.org/abs/2501.05981v1", "repo": "null"}}