{"2407.07086": {"publish_time": "2024-07-09", "title": "Hypothetical Minds: Scaffolding Theory of Mind for Multi-Agent Tasks with Large Language Models", "paper_summary": "Multi-agent reinforcement learning (MARL) methods struggle with the\nnon-stationarity of multi-agent systems and fail to adaptively learn online\nwhen tested with novel agents. Here, we leverage large language models (LLMs)\nto create an autonomous agent that can handle these challenges. Our agent,\nHypothetical Minds, consists of a cognitively-inspired architecture, featuring\nmodular components for perception, memory, and hierarchical planning over two\nlevels of abstraction. We introduce the Theory of Mind module that scaffolds\nthe high-level planning process by generating hypotheses about other agents'\nstrategies in natural language. It then evaluates and iteratively refines these\nhypotheses by reinforcing hypotheses that make correct predictions about the\nother agents' behavior. Hypothetical Minds significantly improves performance\nover previous LLM-agent and RL baselines on a range of competitive, mixed\nmotive, and collaborative domains in the Melting Pot benchmark, including both\ndyadic and population-based environments. Additionally, comparisons against\nLLM-agent baselines and ablations reveal the importance of hypothesis\nevaluation and refinement for succeeding on complex scenarios.", "paper_summary_zh": "多智能體強化學習 (MARL) 方法難以應對多智能體系統的不穩定性，並且在使用新智能體進行測試時無法適應性地線上學習。在這裡，我們利用大型語言模型 (LLM) 來創建一個可以應對這些挑戰的自主智能體。我們的智能體 Hypothetical Minds 由認知啟發的架構組成，具有用於感知、記憶和分層規劃的模組化組件，涵蓋兩個抽象層級。我們引入了心智理論模組，該模組透過以自然語言生成關於其他智能體策略的假設，來支撐高階規劃流程。然後，它會評估並反覆優化這些假設，方法是強化對其他智能體行為做出正確預測的假設。在 Melting Pot 基準中的一系列競爭、混合動機和協作領域（包括二元和基於群體的環境），Hypothetical Minds 的效能顯著優於先前的 LLM 智能體和 RL 基準。此外，與 LLM 智能體基線和消融的比較顯示了假設評估和優化對於在複雜場景中取得成功的重要性。", "author": "Logan Cross et.al.", "authors": "Logan Cross, Violet Xiang, Agam Bhatia, Daniel LK Yamins, Nick Haber", "id": "2407.07086v1", "paper_url": "http://arxiv.org/abs/2407.07086v1", "repo": "https://github.com/locross93/hypothetical-minds"}}