{"2501.14379": {"publish_time": "2025-01-24", "title": "ECTIL: Label-efficient Computational Tumour Infiltrating Lymphocyte (TIL) assessment in breast cancer: Multicentre validation in 2,340 patients with breast cancer", "paper_summary": "The level of tumour-infiltrating lymphocytes (TILs) is a prognostic factor\nfor patients with (triple-negative) breast cancer (BC). Computational TIL\nassessment (CTA) has the potential to assist pathologists in this\nlabour-intensive task, but current CTA models rely heavily on many detailed\nannotations. We propose and validate a fundamentally simpler deep learning\nbased CTA that can be trained in only ten minutes on hundredfold fewer\npathologist annotations. We collected whole slide images (WSIs) with TILs\nscores and clinical data of 2,340 patients with BC from six cohorts including\nthree randomised clinical trials. Morphological features were extracted from\nwhole slide images (WSIs) using a pathology foundation model. Our\nlabel-efficient Computational stromal TIL assessment model (ECTIL) directly\nregresses the TILs score from these features. ECTIL trained on only a few\nhundred samples (ECTIL-TCGA) showed concordance with the pathologist over five\nheterogeneous external cohorts (r=0.54-0.74, AUROC=0.80-0.94). Training on all\nslides of five cohorts (ECTIL-combined) improved results on a held-out test set\n(r=0.69, AUROC=0.85). Multivariable Cox regression analyses indicated that\nevery 10% increase of ECTIL scores was associated with improved overall\nsurvival independent of clinicopathological variables (HR 0.86, p<0.01),\nsimilar to the pathologist score (HR 0.87, p<0.001). We demonstrate that ECTIL\nis highly concordant with an expert pathologist and obtains a similar hazard\nratio. ECTIL has a fundamentally simpler design than existing methods and can\nbe trained on orders of magnitude fewer annotations. Such a CTA may be used to\npre-screen patients for, e.g., immunotherapy clinical trial inclusion, or as a\ntool to assist clinicians in the diagnostic work-up of patients with BC. Our\nmodel is available under an open source licence\n(https://github.com/nki-ai/ectil).", "paper_summary_zh": "肿瘤浸润淋巴细胞 (TIL) 的水平是 (三阴性) 乳腺癌 (BC) 患者的预后因素。计算 TIL 评估 (CTA) 有可能协助病理学家完成这项劳动密集型任务，但目前的 CTA 模型严重依赖于许多详细的注释。我们提出并验证了一个基于深度学习的 CTA，它可以在几百倍更少的病理学家注释上仅在十分钟内进行训练。我们从六个队列中收集了 2,340 名 BC 患者的 TILs 评分和临床数据的全玻片图像 (WSI)，其中包括三项随机临床试验。使用病理基础模型从全玻片图像 (WSI) 中提取形态学特征。我们的标签高效计算基质 TIL 评估模型 (ECTIL) 直接从这些特征中回归 TILs 评分。仅在几百个样本上进行训练的 ECTIL（ECTIL-TCGA）显示出与病理学家在五个异质外部队列中的一致性（r=0.54-0.74，AUROC=0.80-0.94）。在五个队列的所有玻片上进行训练（ECTIL-combined）改善了保留测试集上的结果（r=0.69，AUROC=0.85）。多变量 Cox 回归分析表明，ECTIL 评分每增加 10%，与临床病理学变量无关的总体生存率就会提高（HR 0.86，p<0.01），类似于病理学家评分（HR 0.87，p<0.001）。我们证明 ECTIL 与专家病理学家高度一致，并获得了类似的风险比。ECTIL 的设计比现有方法从根本上更简单，并且可以在数量级更少的注释上进行训练。这种 CTA 可用于对患者进行预筛选，例如免疫治疗临床试验纳入，或作为一种工具来帮助临床医生对 BC 患者进行诊断检查。我们的模型可在开放源代码许可下获得 (https://github.com/nki-ai/ectil)。", "author": "Yoni Schirris et.al.", "authors": "Yoni Schirris, Rosie Voorthuis, Mark Opdam, Marte Liefaard, Gabe S Sonke, Gwen Dackus, Vincent de Jong, Yuwei Wang, Annelot Van Rossum, Tessa G Steenbruggen, Lars C Steggink, Liesbeth G. E. de Vries, Marc van de Vijver, Roberto Salgado, Efstratios Gavves, Paul J van Diest, Sabine C Linn, Jonas Teuwen, Renee Menezes, Marleen Kok, Hugo Horlings", "id": "2501.14379v1", "paper_url": "http://arxiv.org/abs/2501.14379v1", "repo": "null"}}