{"2411.10152": {"publish_time": "2024-11-15", "title": "Causal Time-Series Synchronization for Multi-Dimensional Forecasting", "paper_summary": "The process industry's high expectations for Digital Twins require modeling\napproaches that can generalize across tasks and diverse domains with\npotentially different data dimensions and distributional shifts i.e.,\nFoundational Models. Despite success in natural language processing and\ncomputer vision, transfer learning with (self-) supervised signals for\npre-training general-purpose models is largely unexplored in the context of\nDigital Twins in the process industry due to challenges posed by\nmulti-dimensional time-series data, lagged cause-effect dependencies, complex\ncausal structures, and varying number of (exogenous) variables. We propose a\nnovel channel-dependent pre-training strategy that leverages synchronized\ncause-effect pairs to overcome these challenges by breaking down the\nmulti-dimensional time-series data into pairs of cause-effect variables. Our\napproach focuses on: (i) identifying highly lagged causal relationships using\ndata-driven methods, (ii) synchronizing cause-effect pairs to generate training\nsamples for channel-dependent pre-training, and (iii) evaluating the\neffectiveness of this approach in channel-dependent forecasting. Our\nexperimental results demonstrate significant improvements in forecasting\naccuracy and generalization capability compared to traditional training\nmethods.", "paper_summary_zh": "製程產業對數位分身的高期望需要建模方法，這些方法能夠在任務和不同的領域中概化，並具有潛在不同的資料維度和分佈轉移，也就是基礎模型。儘管在自然語言處理和電腦視覺方面獲得成功，但針對製程產業中的數位分身，利用（自我）監督訊號進行轉移學習以預先訓練通用模型在很大程度上仍未探索，原因在於多維時間序列資料、滯後因果依賴性、複雜因果結構和變數（外生）數量多變所帶來的挑戰。我們提出了一種新穎的通道依賴預訓練策略，該策略利用同步的因果對來克服這些挑戰，方法是將多維時間序列資料分解成因果變數對。我們的做法著重於：(i) 使用資料驅動方法識別高度滯後的因果關係，(ii) 同步因果對以產生通道依賴預訓練的訓練樣本，以及 (iii) 評估此方法在通道依賴預測中的有效性。我們的實驗結果顯示，與傳統訓練方法相比，預測準確度和概化能力有顯著的提升。", "author": "Michael Mayr et.al.", "authors": "Michael Mayr, Georgios C. Chasparis, Josef Küng", "id": "2411.10152v1", "paper_url": "http://arxiv.org/abs/2411.10152v1", "repo": "null"}}