{"2406.12770": {"publish_time": "2024-06-18", "title": "Formatics & dairy industry coalition: AI trends and present challenges", "paper_summary": "Artificial Intelligence (AI) can potentially transform the industry,\nenhancing the production process and minimizing manual, repetitive tasks.\nAccordingly, the synergy between high-performance computing and powerful\nmathematical models enables the application of sophisticated data analysis\nprocedures like Machine Learning. However, challenges exist regarding\neffective, efficient, and flexible processing to generate valuable knowledge.\nConsequently, this work comprehensively describes industrial challenges where\nAI can be exploited, focusing on the dairy industry. The conclusions presented\ncan help researchers apply novel approaches for cattle monitoring and farmers\nby proposing advanced technological solutions to their needs.", "paper_summary_zh": "人工智慧（AI）有潛力轉變產業，\n增強生產流程並將手動、重複性的任務降到最低。\n因此，高性能運算與強大數學模型之間的綜效，\n能應用在精密資料分析的程序中，例如機器學習。\n然而，在產生有價值的知識過程中，\n仍存在著有效、效率和彈性處理的挑戰。\n因此，本研究全面性地描述了產業挑戰，\n說明 AI 能如何被利用，並專注於乳製品產業。\n提出的結論能幫助研究人員應用創新的方法來監控牛隻，\n並透過提出先進的技術解決方案來滿足農民的需求。", "author": "Silvia García-Méndez et.al.", "authors": "Silvia García-Méndez, Francisco de Arriba-Pérez, María del Carmen Somoza-López", "id": "2406.12770v1", "paper_url": "http://arxiv.org/abs/2406.12770v1", "repo": "null"}}