{"2406.09404": {"publish_time": "2024-06-13", "title": "ConsistDreamer: 3D-Consistent 2D Diffusion for High-Fidelity Scene Editing", "paper_summary": "This paper proposes ConsistDreamer - a novel framework that lifts 2D\ndiffusion models with 3D awareness and 3D consistency, thus enabling\nhigh-fidelity instruction-guided scene editing. To overcome the fundamental\nlimitation of missing 3D consistency in 2D diffusion models, our key insight is\nto introduce three synergetic strategies that augment the input of the 2D\ndiffusion model to become 3D-aware and to explicitly enforce 3D consistency\nduring the training process. Specifically, we design surrounding views as\ncontext-rich input for the 2D diffusion model, and generate 3D-consistent,\nstructured noise instead of image-independent noise. Moreover, we introduce\nself-supervised consistency-enforcing training within the per-scene editing\nprocedure. Extensive evaluation shows that our ConsistDreamer achieves\nstate-of-the-art performance for instruction-guided scene editing across\nvarious scenes and editing instructions, particularly in complicated\nlarge-scale indoor scenes from ScanNet++, with significantly improved sharpness\nand fine-grained textures. Notably, ConsistDreamer stands as the first work\ncapable of successfully editing complex (e.g., plaid/checkered) patterns. Our\nproject page is at immortalco.github.io/ConsistDreamer.", "paper_summary_zh": "本論文提出 ConsistDreamer - 一個新穎的框架，它提升了 2D 擴散模型，具備 3D 感知和 3D 一致性，從而實現高保真指令引導場景編輯。為了克服 2D 擴散模型中缺少 3D 一致性的基本限制，我們的關鍵見解是引入三種協同策略，擴充 2D 擴散模型的輸入，使其具備 3D 感知，並在訓練過程中明確執行 3D 一致性。具體來說，我們設計周圍視圖作為 2D 擴散模型的富含背景的輸入，並產生 3D 一致的結構化噪聲，而不是圖像無關的噪聲。此外，我們在場景編輯過程中引入了自監督一致性強制訓練。廣泛的評估表明，我們的 ConsistDreamer 在各種場景和編輯指令的指令引導場景編輯方面達到了最先進的性能，特別是在 ScanNet++ 中複雜的大型室內場景中，顯著提高了清晰度和精細紋理。值得注意的是，ConsistDreamer 是第一個能夠成功編輯複雜（例如格子/方格）圖案的作品。我們的專案頁面位於 immortalco.github.io/ConsistDreamer。", "author": "Jun-Kun Chen et.al.", "authors": "Jun-Kun Chen, Samuel Rota Bulò, Norman Müller, Lorenzo Porzi, Peter Kontschieder, Yu-Xiong Wang", "id": "2406.09404v1", "paper_url": "http://arxiv.org/abs/2406.09404v1", "repo": "null"}}