{"2408.05873": {"publish_time": "2024-08-11", "title": "Defining Boundaries: A Spectrum of Task Feasibility for Large Language Models", "paper_summary": "Large language models (LLMs) have shown remarkable performance in various\ntasks but often fail to handle queries that exceed their knowledge and\ncapabilities, leading to incorrect or fabricated responses. This paper\naddresses the need for LLMs to recognize and refuse infeasible tasks due to the\nrequired skills surpassing their capabilities. We first systematically\nconceptualize infeasible tasks for LLMs, providing formal definitions and\ncategorizations that cover a spectrum of related hallucinations. We develop and\nbenchmark a new dataset comprising diverse infeasible and feasible tasks to\ntest multiple LLMs' abilities on task feasibility. Furthermore, we explore the\npotential of training enhancements to increase LLMs' refusal capabilities with\nfine-tuning. Experiments validate the effectiveness of our methods, offering\npromising directions for refining the operational boundaries of LLMs in real\napplications.", "paper_summary_zh": "大型語言模型（LLM）在各種任務中展現出卓越的表現，但常常無法處理超出其知識和能力的查詢，導致回應不正確或虛構。本文探討 LLM 必須認知並拒絕無法執行之任務，因為所需的技能超出其能力。我們首先系統性地概念化 LLM 的不可行任務，提供涵蓋一系列相關幻覺的正式定義和分類。我們開發並基準測試一個新的資料集，包含各種不可行和可行的任務，以測試多個 LLM 在任務可行性上的能力。此外，我們探索訓練增強的潛力，以透過微調來提升 LLM 的拒絕能力。實驗驗證了我們方法的有效性，為在實際應用中精進 LLM 的運作界限提供了有希望的方向。", "author": "Wenbo Zhang et.al.", "authors": "Wenbo Zhang, Zihang Xu, Hengrui Cai", "id": "2408.05873v1", "paper_url": "http://arxiv.org/abs/2408.05873v1", "repo": "null"}}