{"2410.09008": {"publish_time": "2024-10-11", "title": "SuperCorrect: Supervising and Correcting Language Models with Error-Driven Insights", "paper_summary": "Large language models (LLMs) like GPT-4, PaLM, and LLaMA have shown\nsignificant improvements in various reasoning tasks. However, smaller models\nsuch as Llama-3-8B and DeepSeekMath-Base still struggle with complex\nmathematical reasoning because they fail to effectively identify and correct\nreasoning errors. Recent reflection-based methods aim to address these issues\nby enabling self-reflection and self-correction, but they still face challenges\nin independently detecting errors in their reasoning steps. To overcome these\nlimitations, we propose SuperCorrect, a novel two-stage framework that uses a\nlarge teacher model to supervise and correct both the reasoning and reflection\nprocesses of a smaller student model. In the first stage, we extract\nhierarchical high-level and detailed thought templates from the teacher model\nto guide the student model in eliciting more fine-grained reasoning thoughts.\nIn the second stage, we introduce cross-model collaborative direct preference\noptimization (DPO) to enhance the self-correction abilities of the student\nmodel by following the teacher's correction traces during training. This\ncross-model DPO approach teaches the student model to effectively locate and\nresolve erroneous thoughts with error-driven insights from the teacher model,\nbreaking the bottleneck of its thoughts and acquiring new skills and knowledge\nto tackle challenging problems. Extensive experiments consistently demonstrate\nour superiority over previous methods. Notably, our SuperCorrect-7B model\nsignificantly surpasses powerful DeepSeekMath-7B by 7.8%/5.3% and\nQwen2.5-Math-7B by 15.1%/6.3% on MATH/GSM8K benchmarks, achieving new SOTA\nperformance among all 7B models. Code:\nhttps://github.com/YangLing0818/SuperCorrect-llm", "paper_summary_zh": "大型語言模型（LLM），例如 GPT-4、PaLM 和 LLaMA，已在各種推理任務中展現出顯著的進步。然而，較小的模型，例如 Llama-3-8B 和 DeepSeekMath-Base 仍難以應對複雜的數學推理，因為它們無法有效識別和糾正推理錯誤。最近基於反思的方法旨在通過啟用自我反思和自我糾正來解決這些問題，但它們在獨立檢測推理步驟中的錯誤時仍面臨挑戰。為了克服這些限制，我們提出了 SuperCorrect，這是一個新穎的兩階段架構，它使用一個大型教師模型來監督和糾正較小學生模型的推理和反思過程。在第一階段，我們從教師模型中提取分層的高級和詳細的思考範本，以指導學生模型引發更細緻的推理思考。在第二階段，我們引入了跨模型協作直接偏好最佳化（DPO），以通過在訓練期間遵循教師的修正軌跡來增強學生模型的自我修正能力。這種跨模型 DPO 方法教導學生模型有效地定位和解決錯誤的思考，並從教師模型中獲得錯誤驅動的見解，突破其思考的瓶頸，並獲得解決具有挑戰性問題的新技能和知識。廣泛的實驗持續證明了我們優於先前方法。值得注意的是，我們的 SuperCorrect-7B 模型在 MATH/GSM8K 基準測試中顯著超越了強大的 DeepSeekMath-7B 7.8%/5.3% 和 Qwen2.5-Math-7B 15.1%/6.3%，在所有 7B 模型中實現了新的 SOTA 效能。程式碼：\nhttps://github.com/YangLing0818/SuperCorrect-llm", "author": "Ling Yang et.al.", "authors": "Ling Yang, Zhaochen Yu, Tianjun Zhang, Minkai Xu, Joseph E. Gonzalez, Bin Cui, Shuicheng Yan", "id": "2410.09008v1", "paper_url": "http://arxiv.org/abs/2410.09008v1", "repo": "https://github.com/yangling0818/supercorrect-llm"}}