{"2410.19469": {"publish_time": "2024-10-25", "title": "Unified Causality Analysis Based on the Degrees of Freedom", "paper_summary": "Temporally evolving systems are typically modeled by dynamic equations. A key\nchallenge in accurate modeling is understanding the causal relationships\nbetween subsystems, as well as identifying the presence and influence of\nunobserved hidden drivers on the observed dynamics. This paper presents a\nunified method capable of identifying fundamental causal relationships between\npairs of systems, whether deterministic or stochastic. Notably, the method also\nuncovers hidden common causes beyond the observed variables. By analyzing the\ndegrees of freedom in the system, our approach provides a more comprehensive\nunderstanding of both causal influence and hidden confounders. This unified\nframework is validated through theoretical models and simulations,\ndemonstrating its robustness and potential for broader application.", "paper_summary_zh": "時間演化系統通常由動態方程式建模。準確建模的一個關鍵挑戰是了解子系統之間的因果關係，以及識別未觀察到的隱藏驅動因素的存在和影響。本文提出了一種統一的方法，能夠識別系統對之間的根本因果關係，無論是確定性的還是隨機的。值得注意的是，該方法還揭示了觀察變量之外的隱藏共同原因。通過分析系統中的自由度，我們的做法提供了對因果影響和隱藏混雜因素的更全面理解。通過理論模型和模擬驗證了這個統一框架，證明了其穩健性和更廣泛應用。", "author": "András Telcs et.al.", "authors": "András Telcs, Marcell T. Kurbucz, Antal Jakovác", "id": "2410.19469v1", "paper_url": "http://arxiv.org/abs/2410.19469v1", "repo": "null"}}