{"2410.18556": {"publish_time": "2024-10-24", "title": "Complexity Matters: Effective Dimensionality as a Measure for Adversarial Robustness", "paper_summary": "Quantifying robustness in a single measure for the purposes of model\nselection, development of adversarial training methods, and anticipating trends\nhas so far been elusive. The simplest metric to consider is the number of\ntrainable parameters in a model but this has previously been shown to be\ninsufficient at explaining robustness properties. A variety of other metrics,\nsuch as ones based on boundary thickness and gradient flatness have been\nproposed but have been shown to be inadequate proxies for robustness.\n  In this work, we investigate the relationship between a model's effective\ndimensionality, which can be thought of as model complexity, and its robustness\nproperties. We run experiments on commercial-scale models that are often used\nin real-world environments such as YOLO and ResNet. We reveal a near-linear\ninverse relationship between effective dimensionality and adversarial\nrobustness, that is models with a lower dimensionality exhibit better\nrobustness. We investigate the effect of a variety of adversarial training\nmethods on effective dimensionality and find the same inverse linear\nrelationship present, suggesting that effective dimensionality can serve as a\nuseful criterion for model selection and robustness evaluation, providing a\nmore nuanced and effective metric than parameter count or previously-tested\nmeasures.", "paper_summary_zh": "量化健壯性以用於模型選擇、對抗訓練方法的開發和預期趨勢的單一指標，到目前為止一直難以捉摸。要考慮的最簡單指標是模型中的可訓練參數數量，但先前已顯示這不足以解釋健壯性屬性。已經提出了各種其他指標，例如基於邊界厚度和梯度平坦度的指標，但已顯示它們是不適當的健壯性代理。\n在這項工作中，我們探討模型的有效維度（可以視為模型複雜度）與其健壯性屬性之間的關係。我們對在現實世界環境中經常使用的商業規模模型（例如 YOLO 和 ResNet）執行實驗。我們揭示了有效維度和對抗健壯性之間近乎線性的反比關係，即維度較低的模型表現出更好的健壯性。我們探討了各種對抗訓練方法對有效維度的影響，並發現存在相同的反比線性關係，這表明有效維度可以用作模型選擇和健壯性評估的有用標準，提供比參數計數或先前測試的指標更細緻且有效的指標。", "author": "David Khachaturov et.al.", "authors": "David Khachaturov, Robert Mullins", "id": "2410.18556v1", "paper_url": "http://arxiv.org/abs/2410.18556v1", "repo": "null"}}