{"2406.18859": {"publish_time": "2024-06-27", "title": "Two-Pronged Human Evaluation of ChatGPT Self-Correction in Radiology Report Simplification", "paper_summary": "Radiology reports are highly technical documents aimed primarily at\ndoctor-doctor communication. There has been an increasing interest in sharing\nthose reports with patients, necessitating providing them patient-friendly\nsimplifications of the original reports. This study explores the suitability of\nlarge language models in automatically generating those simplifications. We\nexamine the usefulness of chain-of-thought and self-correction prompting\nmechanisms in this domain. We also propose a new evaluation protocol that\nemploys radiologists and laypeople, where radiologists verify the factual\ncorrectness of simplifications, and laypeople assess simplicity and\ncomprehension. Our experimental results demonstrate the effectiveness of\nself-correction prompting in producing high-quality simplifications. Our\nfindings illuminate the preferences of radiologists and laypeople regarding\ntext simplification, informing future research on this topic.", "paper_summary_zh": "放射科報告是高度技術性的文件，主要用於醫生與醫生之間的溝通。人們越來越有興趣與患者分享這些報告，因此必須為患者提供原始報告的患者友善簡化版。本研究探討大型語言模型在自動產生這些簡化版的適用性。我們檢視了鏈式思考和自訂正提示機制在這個領域中的效用。我們也提出一個新的評估協定，採用放射科醫師和外行人，其中放射科醫師驗證簡化版的正確性，而外行人則評估簡潔性和理解度。我們的實驗結果證明了自訂正提示在產生高品質簡化版上的有效性。我們的發現闡明了放射科醫師和外行人對文字簡化的偏好，為未來針對此主題的研究提供資訊。", "author": "Ziyu Yang et.al.", "authors": "Ziyu Yang, Santhosh Cherian, Slobodan Vucetic", "id": "2406.18859v1", "paper_url": "http://arxiv.org/abs/2406.18859v1", "repo": "https://github.com/ziyu-yang/human-evaluation"}}