{"2411.03223": {"publish_time": "2024-11-05", "title": "Beyond Grid Data: Exploring Graph Neural Networks for Earth Observation", "paper_summary": "Earth Observation (EO) data analysis has been significantly revolutionized by\ndeep learning (DL), with applications typically limited to grid-like data\nstructures. Graph Neural Networks (GNNs) emerge as an important innovation,\npropelling DL into the non-Euclidean domain. Naturally, GNNs can effectively\ntackle the challenges posed by diverse modalities, multiple sensors, and the\nheterogeneous nature of EO data. To introduce GNNs in the related domains, our\nreview begins by offering fundamental knowledge on GNNs. Then, we summarize the\ngeneric problems in EO, to which GNNs can offer potential solutions. Following\nthis, we explore a broad spectrum of GNNs' applications to scientific problems\nin Earth systems, covering areas such as weather and climate analysis, disaster\nmanagement, air quality monitoring, agriculture, land cover classification,\nhydrological process modeling, and urban modeling. The rationale behind\nadopting GNNs in these fields is explained, alongside methodologies for\norganizing graphs and designing favorable architectures for various tasks.\nFurthermore, we highlight methodological challenges of implementing GNNs in\nthese domains and possible solutions that could guide future research. While\nacknowledging that GNNs are not a universal solution, we conclude the paper by\ncomparing them with other popular architectures like transformers and analyzing\ntheir potential synergies.", "paper_summary_zh": "地球觀測 (EO) 資料分析已透過深度學習 (DL) 產生重大變革，應用通常僅限於網格狀資料結構。圖形神經網路 (GNN) 作為一項重要創新浮現，推動 DL 進入非歐幾里得領域。自然地，GNN 能有效應對不同模式、多重感測器和 EO 資料異質性所帶來的挑戰。為了在相關領域中導入 GNN，我們的評論從提供 GNN 的基礎知識開始。接著，我們總結 EO 中的常見問題，GNN 可為這些問題提供潛在解決方案。在此之後，我們探討 GNN 在地球系統科學問題中的廣泛應用，涵蓋天氣和氣候分析、災害管理、空氣品質監控、農業、土地覆蓋分類、水文過程建模和城市建模等領域。我們說明在這些領域採用 GNN 的理由，以及組織圖形和設計適用於各種任務的良好架構的方法。此外，我們強調在這些領域實作 GNN 的方法論挑戰，以及可能引導未來研究的潛在解決方案。雖然承認 GNN 並非萬能解，但我們透過將 GNN 與其他流行架構（例如Transformer）進行比較，並分析其潛在協同效應，來為本文作結。", "author": "Shan Zhao et.al.", "authors": "Shan Zhao, Zhaiyu Chen, Zhitong Xiong, Yilei Shi, Sudipan Saha, Xiao Xiang Zhu", "id": "2411.03223v1", "paper_url": "http://arxiv.org/abs/2411.03223v1", "repo": "null"}}