{"2406.14457": {"publish_time": "2024-06-20", "title": "Rewarding What Matters: Step-by-Step Reinforcement Learning for Task-Oriented Dialogue", "paper_summary": "Reinforcement learning (RL) is a powerful approach to enhance task-oriented\ndialogue (TOD) systems. However, existing RL methods tend to mainly focus on\ngeneration tasks, such as dialogue policy learning (DPL) or response generation\n(RG), while neglecting dialogue state tracking (DST) for understanding. This\nnarrow focus limits the systems to achieve globally optimal performance by\noverlooking the interdependence between understanding and generation.\nAdditionally, RL methods face challenges with sparse and delayed rewards, which\ncomplicates training and optimization. To address these issues, we extend RL\ninto both understanding and generation tasks by introducing step-by-step\nrewards throughout the token generation. The understanding reward increases as\nmore slots are correctly filled in DST, while the generation reward grows with\nthe accurate inclusion of user requests. Our approach provides a balanced\noptimization aligned with task completion. Experimental results demonstrate\nthat our approach effectively enhances the performance of TOD systems and\nachieves new state-of-the-art results on three widely used datasets, including\nMultiWOZ2.0, MultiWOZ2.1, and In-Car. Our approach also shows superior few-shot\nability in low-resource settings compared to current models.", "paper_summary_zh": "強化學習 (RL) 是增強任務導向對話 (TOD) 系統的強大方法。然而，現有的 RL 方法傾向於主要關注生成任務，例如對話策略學習 (DPL) 或回應生成 (RG)，同時忽略對話狀態追蹤 (DST) 以進行理解。這種狹隘的關注限制了系統通過忽視理解和生成之間的相互依賴性來實現全局最佳效能。此外，RL 方法面臨稀疏和延遲獎勵的挑戰，這使得訓練和最佳化變得複雜。為了解決這些問題，我們透過在整個代碼生成過程中引入逐步獎勵，將 RL 延伸到理解和生成任務中。隨著 DST 中正確填入更多時段，理解獎勵會增加，而生成獎勵則會隨著準確包含使用者要求而增加。我們的做法提供了一個與任務完成相一致的平衡最佳化。實驗結果表明，我們的方法有效地增強了 TOD 系統的效能，並在三個廣泛使用的資料集，包括 MultiWOZ2.0、MultiWOZ2.1 和 In-Car 上取得了新的最先進成果。與目前的模型相比，我們的做法在低資源設定中也展現出優異的少次學習能力。", "author": "Huifang Du et.al.", "authors": "Huifang Du, Shuqin Li, Minghao Wu, Xuejing Feng, Yuan-Fang Li, Haofen Wang", "id": "2406.14457v1", "paper_url": "http://arxiv.org/abs/2406.14457v1", "repo": "null"}}