{"2411.06691": {"publish_time": "2024-11-11", "title": "Autonomous Droplet Microfluidic Design Framework with Large Language Models", "paper_summary": "Droplet-based microfluidic devices have substantial promise as cost-effective\nalternatives to current assessment tools in biological research. Moreover,\nmachine learning models that leverage tabular data, including input design\nparameters and their corresponding efficiency outputs, are increasingly\nutilised to automate the design process of these devices and to predict their\nperformance. However, these models fail to fully leverage the data presented in\nthe tables, neglecting crucial contextual information, including column\nheadings and their associated descriptions. This study presents\nMicroFluidic-LLMs, a framework designed for processing and feature extraction,\nwhich effectively captures contextual information from tabular data formats.\nMicroFluidic-LLMs overcomes processing challenges by transforming the content\ninto a linguistic format and leveraging pre-trained large language models\n(LLMs) for analysis. We evaluate our MicroFluidic-LLMs framework on 11\nprediction tasks, covering aspects such as geometry, flow conditions, regimes,\nand performance, utilising a publicly available dataset on flow-focusing\ndroplet microfluidics. We demonstrate that our MicroFluidic-LLMs framework can\nempower deep neural network models to be highly effective and straightforward\nwhile minimising the need for extensive data preprocessing. Moreover, the\nexceptional performance of deep neural network models, particularly when\ncombined with advanced natural language processing models such as DistilBERT\nand GPT-2, reduces the mean absolute error in the droplet diameter and\ngeneration rate by nearly 5- and 7-fold, respectively, and enhances the regime\nclassification accuracy by over 4%, compared with the performance reported in a\nprevious study. This study lays the foundation for the huge potential\napplications of LLMs and machine learning in a wider spectrum of microfluidic\napplications.", "paper_summary_zh": "<paragraph>基於液滴的微流體裝置有望成為生物研究中經濟有效的替代方案，可取代現有的評估工具。此外，利用表格數據（包括輸入設計參數及其對應的效率輸出）的機器學習模型正日益用於自動化這些裝置的設計流程，並預測其性能。然而，這些模型未能充分利用表格中呈現的數據，忽視了關鍵的上下文信息，包括欄位標題及其相關描述。本研究提出了 MicroFluidic-LLMs，這是一個專門用於處理和特徵提取的框架，可有效擷取表格數據格式中的上下文信息。MicroFluidic-LLMs 通過將內容轉換為語言格式，並利用預先訓練的大語言模型 (LLM) 進行分析，克服了處理挑戰。我們在 11 項預測任務上評估了我們的 MicroFluidic-LLMs 框架，涵蓋幾何形狀、流動條件、機制和性能等方面，並利用了公開的流動聚焦液滴微流體數據集。我們證明了我們的 MicroFluidic-LLMs 框架可以讓深度神經網路模型高效且直接，同時最大限度地減少對大量數據預處理的需求。此外，深度神經網路模型的出色性能，特別是與 DistilBERT 和 GPT-2 等先進的自然語言處理模型結合使用時，將液滴直徑和生成率的平均絕對誤差分別降低了近 5 倍和 7 倍，並將機制分類準確度提高了 4% 以上，與先前研究報告的性能相比。本研究為 LLM 和機器學習在更廣泛的微流體應用中的巨大潛在應用奠定了基礎。</paragraph>", "author": "Dinh-Nguyen Nguyen et.al.", "authors": "Dinh-Nguyen Nguyen, Raymond Kai-Yu Tong, Ngoc-Duy Dinh", "id": "2411.06691v1", "paper_url": "http://arxiv.org/abs/2411.06691v1", "repo": "null"}}