{"2410.13456": {"publish_time": "2024-10-17", "title": "Unlocking Legal Knowledge: A Multilingual Dataset for Judicial Summarization in Switzerland", "paper_summary": "Legal research is a time-consuming task that most lawyers face on a daily\nbasis. A large part of legal research entails looking up relevant caselaw and\nbringing it in relation to the case at hand. Lawyers heavily rely on summaries\n(also called headnotes) to find the right cases quickly. However, not all\ndecisions are annotated with headnotes and writing them is time-consuming.\nAutomated headnote creation has the potential to make hundreds of thousands of\ndecisions more accessible for legal research in Switzerland alone. To kickstart\nthis, we introduce the Swiss Leading Decision Summarization ( SLDS) dataset, a\nnovel cross-lingual resource featuring 18K court rulings from the Swiss Federal\nSupreme Court (SFSC), in German, French, and Italian, along with German\nheadnotes. We fine-tune and evaluate three mT5 variants, along with proprietary\nmodels. Our analysis highlights that while proprietary models perform well in\nzero-shot and one-shot settings, fine-tuned smaller models still provide a\nstrong competitive edge. We publicly release the dataset to facilitate further\nresearch in multilingual legal summarization and the development of assistive\ntechnologies for legal professionals", "paper_summary_zh": "法律研究是一項耗時的任務，大多數律師每天都會面臨。法律研究的很大一部分涉及查找相關案例法，並將其與手頭的案件聯繫起來。律師在很大程度上依賴摘要（也稱為標題註釋）來快速找到正確的案件。然而，並非所有判決都附有標題註釋，而且撰寫標題註釋非常耗時。自動標題註釋的創建有可能讓瑞士的法律研究更容易獲得數十萬個判決。為了啟動這項工作，我們引入了瑞士領先判決摘要 (SLDS) 數據集，這是一個新穎的跨語言資源，其中包含來自瑞士聯邦最高法院 (SFSC) 的 18K 份法庭裁決，使用德語、法語和意大利語，以及德語標題註釋。我們對三種 mT5 變體以及專有模型進行微調和評估。我們的分析強調，儘管專有模型在零次學習和一次學習設置中表現良好，但經過微調的小型模型仍然提供了強大的競爭優勢。我們公開發布數據集，以促進多語言法律摘要和法律專業人士輔助技術的進一步研究", "author": "Luca Rolshoven et.al.", "authors": "Luca Rolshoven, Vishvaksenan Rasiah, Srinanda Brügger Bose, Matthias Stürmer, Joel Niklaus", "id": "2410.13456v1", "paper_url": "http://arxiv.org/abs/2410.13456v1", "repo": "null"}}