{"2411.02989": {"publish_time": "2024-11-05", "title": "Growing a Tail: Increasing Output Diversity in Large Language Models", "paper_summary": "How diverse are the outputs of large language models when diversity is\ndesired? We examine the diversity of responses of various models to questions\nwith multiple possible answers, comparing them with human responses. Our\nfindings suggest that models' outputs are highly concentrated, reflecting a\nnarrow, mainstream 'worldview', in comparison to humans, whose responses\nexhibit a much longer-tail. We examine three ways to increase models' output\ndiversity: 1) increasing generation randomness via temperature sampling; 2)\nprompting models to answer from diverse perspectives; 3) aggregating outputs\nfrom several models. A combination of these measures significantly increases\nmodels' output diversity, reaching that of humans. We discuss implications of\nthese findings for AI policy that wishes to preserve cultural diversity, an\nessential building block of a democratic social fabric.", "paper_summary_zh": "當需要多樣性時，大型語言模型的輸出有多麼多樣化？我們檢視各種模型對具有多種可能答案問題的回應的多樣性，並將它們與人類的回應進行比較。我們的發現表明，與人類相比，模型的輸出高度集中，反映了一個狹窄的主流“世界觀”，而人類的回應表現出更長的尾部。我們探討了增加模型輸出多樣性的三種方法：1）通過溫度採樣增加生成隨機性；2）提示模型從不同的角度回答；3）彙總來自多個模型的輸出。這些措施的組合顯著增加了模型的輸出多樣性，達到了人類的水平。我們討論了這些發現對希望維護文化多樣性的 AI 政策的影響，文化多樣性是民主社會結構的基本組成部分。", "author": "Michal Shur-Ofry et.al.", "authors": "Michal Shur-Ofry, Bar Horowitz-Amsalem, Adir Rahamim, Yonatan Belinkov", "id": "2411.02989v1", "paper_url": "http://arxiv.org/abs/2411.02989v1", "repo": "null"}}