{"2407.14114": {"publish_time": "2024-07-19", "title": "A3Rank: Augmentation Alignment Analysis for Prioritizing Overconfident Failing Samples for Deep Learning Models", "paper_summary": "Sharpening deep learning models by training them with examples close to the\ndecision boundary is a well-known best practice. Nonetheless, these models are\nstill error-prone in producing predictions. In practice, the inference of the\ndeep learning models in many application systems is guarded by a rejector, such\nas a confidence-based rejector, to filter out samples with insufficient\nprediction confidence. Such confidence-based rejectors cannot effectively guard\nagainst failing samples with high confidence. Existing test case prioritization\ntechniques effectively distinguish confusing samples from confident samples to\nidentify failing samples among the confusing ones, yet prioritizing the failing\nones high among many confident ones is challenging. In this paper, we propose\n$A^3$Rank, a novel test case prioritization technique with augmentation\nalignment analysis, to address this problem. $A^3$Rank generates augmented\nversions of each test case and assesses the extent of the prediction result for\nthe test case misaligned with these of the augmented versions and vice versa.\nOur experiment shows that $A^3$Rank can effectively rank failing samples\nescaping from the checking of confidence-based rejectors, which significantly\noutperforms the peer techniques by 163.63\\% in the detection ratio of\ntop-ranked samples. We also provide a framework to construct a detector devoted\nto augmenting these rejectors to defend these failing samples, and our detector\ncan achieve a significantly higher defense success rate.", "paper_summary_zh": "透過訓練深度學習模型，讓它們使用接近決策邊界的範例進行訓練，這項做法是眾所周知的最佳實務。儘管如此，這些模型在產生預測時仍容易出錯。在實務上，許多應用系統的深度學習模型推論都受到拒絕器的保護，例如基於信心的拒絕器，以過濾掉預測信心不足的樣本。這種基於信心的拒絕器無法有效防範具有高信心的失敗樣本。現有的測試案例優先順序技術可有效區分令人困惑的樣本和有信心的樣本，以識別令人困惑的樣本中的失敗樣本，但要在許多有信心的樣本中將失敗的樣本優先排序在較高位置卻是一項挑戰。在本文中，我們提出 $A^3$Rank，這是一種結合擴充比對分析的新測試案例優先順序技術，以解決這個問題。$A^3$Rank 會產生每個測試案例的擴充版本，並評估測試案例的預測結果與這些擴充版本的預測結果之間的錯位程度，反之亦然。我們的實驗顯示，$A^3$Rank 可以有效地對逃脫基於信心的拒絕器檢查的失敗樣本進行排名，在排名前幾名的樣本的檢測率方面，其顯著優於同儕技術 163.63%。我們還提供了一個架構，用於建構一個偵測器，專門用於擴充這些拒絕器以防禦這些失敗樣本，而我們的偵測器可以達到顯著更高的防禦成功率。", "author": "Zhengyuan Wei et.al.", "authors": "Zhengyuan Wei, Haipeng Wang, Qilin Zhou, W. K. Chan", "id": "2407.14114v1", "paper_url": "http://arxiv.org/abs/2407.14114v1", "repo": "null"}}