{"2502.11811": {"publish_time": "2025-02-17", "title": "FineFilter: A Fine-grained Noise Filtering Mechanism for Retrieval-Augmented Large Language Models", "paper_summary": "Retrieved documents containing noise will hinder Retrieval-Augmented\nGeneration (RAG) from detecting answer clues, necessitating noise filtering\nmechanisms to enhance accuracy.Existing methods use re-ranking or summarization\nto identify the most relevant sentences, but directly and accurately locating\nanswer clues from these large-scale and complex documents remains challenging.\nUnlike these document-level operations, we treat noise filtering as a\nsentence-level MinMax optimization problem: first identifying the potential\nclues from multiple documents using contextual information, then ranking them\nby relevance, and finally retaining the least clues through truncation. In this\npaper, we propose FineFilter, a novel fine-grained noise filtering mechanism\nfor RAG consisting of a clue extractor, a re-ranker, and a truncator. We\noptimize each module to tackle complex reasoning challenges: (1) Clue extractor\nfirstly uses sentences containing the answer and similar ones as fine-tuned\ntargets, aiming at extracting sufficient potential clues; (2) Re-ranker is\ntrained to prioritize effective clues based on the real feedback from\ngeneration module, with clues capable of generating correct answer as positive\nsamples and others as negative; (3) Truncator takes the minimum clues needed to\nanswer the question (truncation point) as fine-tuned targets, and performs\ntruncation on the re-ranked clues to achieve fine-grained noise filtering.\nExperiments on three QA datasets demonstrate that FineFilter significantly\noutperforms baselines in terms of performance and inference cost. Further\nanalysis on each module shows the effectiveness of our optimizations for\ncomplex reasoning.", "paper_summary_zh": "<paragraph>檢索到含有雜訊的文件會阻礙檢索增強生成 (RAG) 偵測答案線索，因此需要雜訊過濾機制來增強準確性。現有方法使用重新排序或摘要來找出最相關的句子，但從這些大規模且複雜的文件中直接且準確地找出答案線索仍然具有挑戰性。與這些文件層級的操作不同，我們將雜訊過濾視為一個句子層級的 MinMax 最佳化問題：首先使用脈絡資訊從多個文件中找出潛在線索，接著依據相關性對它們進行排序，最後透過截斷保留最少的線索。在本文中，我們提出 FineFilter，一種創新的細緻雜訊過濾機制，用於 RAG，它包含一個線索萃取器、一個重新排序器和一個截斷器。我們最佳化每個模組來應對複雜的推理挑戰：(1) 線索萃取器首先使用包含答案和類似答案的句子作為微調的目標，旨在萃取足夠的潛在線索；(2) 重新排序器經過訓練，根據生成模組的真實回饋來優先處理有效的線索，其中能夠生成正確答案的線索為正樣本，其他則為負樣本；(3) 截斷器將回答問題所需的最小線索 (截斷點) 視為微調的目標，並對重新排序的線索執行截斷，以達成細緻的雜訊過濾。在三個問答資料集上的實驗證實，FineFilter 在效能和推論成本方面都明顯優於基線。進一步分析每個模組顯示，我們的最佳化對於複雜推理而言是有效的。</paragraph>", "author": "Qianchi Zhang et.al.", "authors": "Qianchi Zhang, Hainan Zhang, Liang Pang, Hongwei Zheng, Yongxin Tong, Zhiming Zheng", "id": "2502.11811v1", "paper_url": "http://arxiv.org/abs/2502.11811v1", "repo": "null"}}