{"2504.11355": {"publish_time": "2025-04-15", "title": "Neural Networks for on-chip Model Predictive Control: a Method to Build Optimized Training Datasets and its application to Type-1 Diabetes", "paper_summary": "Training Neural Networks (NNs) to behave as Model Predictive Control (MPC)\nalgorithms is an effective way to implement them in constrained embedded\ndevices. By collecting large amounts of input-output data, where inputs\nrepresent system states and outputs are MPC-generated control actions, NNs can\nbe trained to replicate MPC behavior at a fraction of the computational cost.\nHowever, although the composition of the training data critically influences\nthe final NN accuracy, methods for systematically optimizing it remain\nunderexplored. In this paper, we introduce the concept of Optimally-Sampled\nDatasets (OSDs) as ideal training sets and present an efficient algorithm for\ngenerating them. An OSD is a parametrized subset of all the available data that\n(i) preserves existing MPC information up to a certain numerical resolution,\n(ii) avoids duplicate or near-duplicate states, and (iii) becomes saturated or\ncomplete. We demonstrate the effectiveness of OSDs by training NNs to replicate\nthe University of Virginia's MPC algorithm for automated insulin delivery in\nType-1 Diabetes, achieving a four-fold improvement in final accuracy. Notably,\ntwo OSD-trained NNs received regulatory clearance for clinical testing as the\nfirst NN-based control algorithm for direct human insulin dosing. This\nmethodology opens new pathways for implementing advanced optimizations on\nresource-constrained embedded platforms, potentially revolutionizing how\ncomplex algorithms are deployed.", "paper_summary_zh": "<paragraph>訓練神經網路 (NNs) 模擬模型預測控制 (MPC)演算法，是在受限嵌入式設備中實作它們的有效方法。藉由收集大量輸入輸出資料，其中輸入代表系統狀態，輸出是 MPC 產生的控制動作，NNs 可以被訓練以複製 MPC 行為，且只需一小部分的計算成本。然而，儘管訓練資料的組成會嚴重影響最終 NN 的準確性，但系統性優化它的方法仍然未被充分探索。在本文中，我們引入了最佳採樣資料集 (OSD) 的概念作為理想的訓練集，並提出了一種有效的演算法來產生它們。OSD 是所有可用資料的參數化子集，它(i) 將現有的 MPC 資訊保留到一定的數值解析度，(ii) 避免重複或近乎重複的狀態，並且 (iii) 變得飽和或完整。我們透過訓練 NNs 來複製維吉尼亞大學用於第一型糖尿病自動胰島素輸送的 MPC 演算法，展示了 OSD 的有效性，最終準確性提高了四倍。值得注意的是，兩個經 OSD 訓練的 NNs 作為第一個基於 NN 的直接人體胰島素劑量控制演算法，獲得了臨床試驗的監管許可。這種方法為在資源受限的嵌入式平台上實作進階優化開闢了新的途徑，可能徹底改變複雜演算法的部署方式。</paragraph>\n", "author": "Alberto Castillo et.al.", "authors": "Alberto Castillo, Elliot Pryor, Anas El Fathi, Boris Kovatchev, Marc Breton", "id": "2504.11355v1", "paper_url": "http://arxiv.org/abs/2504.11355v1", "repo": "null"}}