{"2412.04060": {"publish_time": "2024-12-05", "title": "Expanding Deep Learning-based Sensing Systems with Multi-Source Knowledge Transfer", "paper_summary": "Expanding the existing sensing systems to provide high-quality deep learning\nmodels for more domains, such as new users or environments, is challenged by\nthe limited labeled data and the data and device heterogeneities. While\nknowledge distillation methods could overcome label scarcity and device\nheterogeneity, they assume the teachers are fully reliable and overlook the\ndata heterogeneity, which prevents the direct adoption of existing models. To\naddress this problem, this paper proposes an efficient knowledge transfer\nframework, HaKT, to expand sensing systems. It first selects multiple\nhigh-quality models from the system at a low cost and then fuses their\nknowledge by assigning sample-wise weights to their predictions. Later, the\nfused knowledge is selectively injected into the customized models for new\ndomains based on the knowledge quality. Extensive experiments on different\ntasks, modalities, and settings show that HaKT outperforms stat-of-the-art\nbaselines by at most 16.5% accuracy and saves up to 39% communication traffic.", "paper_summary_zh": "擴展現有感測系統，以提供更多領域（例如新使用者或環境）的高品質深度學習模型，受到標籤資料有限以及資料和裝置異質性的挑戰。雖然知識蒸餾方法可以克服標籤稀少性和裝置異質性，但它們假設教師完全可靠，並忽略資料異質性，這會妨礙直接採用現有模型。為了解決這個問題，本文提出了一個有效的知識傳輸架構 HaKT，以擴展感測系統。它首先從系統中低成本地選擇多個高品質模型，然後透過為其預測指派樣本權重來融合其知識。稍後，基於知識品質，將融合的知識選擇性地注入到新領域的客製化模型中。在不同任務、方式和設定上的大量實驗表明，HaKT 的準確度比最先進的基準高出 16.5%，並節省了高達 39% 的通訊流量。", "author": "Gaole Dai et.al.", "authors": "Gaole Dai, Huatao Xu, Rui Tan, Mo Li", "id": "2412.04060v1", "paper_url": "http://arxiv.org/abs/2412.04060v1", "repo": "null"}}