{"2411.17066": {"publish_time": "2024-11-26", "title": "Relations, Negations, and Numbers: Looking for Logic in Generative Text-to-Image Models", "paper_summary": "Despite remarkable progress in multi-modal AI research, there is a salient\ndomain in which modern AI continues to lag considerably behind even human\nchildren: the reliable deployment of logical operators. Here, we examine three\nforms of logical operators: relations, negations, and discrete numbers. We\nasked human respondents (N=178 in total) to evaluate images generated by a\nstate-of-the-art image-generating AI (DALL-E 3) prompted with these `logical\nprobes', and find that none reliably produce human agreement scores greater\nthan 50\\%. The negation probes and numbers (beyond 3) fail most frequently. In\na 4th experiment, we assess a `grounded diffusion' pipeline that leverages\ntargeted prompt engineering and structured intermediate representations for\ngreater compositional control, but find its performance is judged even worse\nthan that of DALL-E 3 across prompts. To provide further clarity on potential\nsources of success and failure in these text-to-image systems, we supplement\nour 4 core experiments with multiple auxiliary analyses and schematic diagrams,\ndirectly quantifying, for example, the relationship between the N-gram\nfrequency of relational prompts and the average match to generated images; the\nsuccess rates for 3 different prompt modification strategies in the rendering\nof negation prompts; and the scalar variability / ratio dependence\n(`approximate numeracy') of prompts involving integers. We conclude by\ndiscussing the limitations inherent to `grounded' multimodal learning systems\nwhose grounding relies heavily on vector-based semantics (e.g. DALL-E 3), or\nunder-specified syntactical constraints (e.g. `grounded diffusion'), and\npropose minimal modifications (inspired by development, based in imagery) that\ncould help to bridge the lingering compositional gap between scale and\nstructure. All data and code is available at\nhttps://github.com/ColinConwell/T2I-Probology", "paper_summary_zh": "儘管多模態 AI 研究取得顯著進展，但現代 AI 在一個顯著領域仍遠遠落後於人類兒童：邏輯運算子的可靠部署。在此，我們探討三種形式的邏輯運算子：關係、否定和離散數字。我們要求人類受訪者（總數 N=178）評估由最先進的影像生成 AI（DALL-E 3）產生的影像，並提示這些「邏輯探針」，結果發現沒有任何一種可靠地產生高於 50% 的人類同意分數。否定探針和數字（超過 3）最常失敗。在第四個實驗中，我們評估一個「接地擴散」管道，它利用目標提示工程和結構化中間表示來獲得更大的組成控制，但發現它的表現被評為比 DALL-E 3 在所有提示中的表現還要差。為了進一步釐清這些文字轉影像系統中成功和失敗的潛在來源，我們用多個輔助分析和示意圖補充我們的 4 個核心實驗，直接量化例如關係提示的 N-gram 頻率與生成影像的平均匹配之間的關係；在否定提示的呈現中 3 種不同提示修改策略的成功率；以及涉及整數的提示的標量變異性/比率依賴性（「近似數學能力」）。最後，我們討論了「接地」多模態學習系統固有的限制，這些系統的接地嚴重依賴於基於向量的語義（例如 DALL-E 3）或未指定的句法約束（例如「接地擴散」），並提出最小的修改（受發展啟發，基於影像），這有助於彌合規模和結構之間持續存在的組成差距。所有資料和程式碼都可以在 https://github.com/ColinConwell/T2I-Probology 取得", "author": "Colin Conwell et.al.", "authors": "Colin Conwell, Rupert Tawiah-Quashie, Tomer Ullman", "id": "2411.17066v1", "paper_url": "http://arxiv.org/abs/2411.17066v1", "repo": "null"}}