{"2501.17630": {"publish_time": "2025-01-29", "title": "Uncertainty Quantification and Decomposition for LLM-based Recommendation", "paper_summary": "Despite the widespread adoption of large language models (LLMs) for\nrecommendation, we demonstrate that LLMs often exhibit uncertainty in their\nrecommendations. To ensure the trustworthy use of LLMs in generating\nrecommendations, we emphasize the importance of assessing the reliability of\nrecommendations generated by LLMs. We start by introducing a novel framework\nfor estimating the predictive uncertainty to quantitatively measure the\nreliability of LLM-based recommendations. We further propose to decompose the\npredictive uncertainty into recommendation uncertainty and prompt uncertainty,\nenabling in-depth analyses of the primary source of uncertainty. Through\nextensive experiments, we (1) demonstrate predictive uncertainty effectively\nindicates the reliability of LLM-based recommendations, (2) investigate the\norigins of uncertainty with decomposed uncertainty measures, and (3) propose\nuncertainty-aware prompting for a lower predictive uncertainty and enhanced\nrecommendation. Our source code and model weights are available at\nhttps://github.com/WonbinKweon/UNC_LLM_REC_WWW2025", "paper_summary_zh": "儘管大型語言模型 (LLM) 已廣泛用於推薦，但我們證明 LLM 通常在其推薦中表現出不確定性。為了確保在產生推薦時可信賴地使用 LLM，我們強調評估 LLM 產生的推薦之可靠性的重要性。我們首先介紹一個新的架構，用於估計預測不確定性，以量化衡量基於 LLM 的推薦之可靠性。我們進一步提出將預測不確定性分解為推薦不確定性和提示不確定性，從而深入分析不確定性的主要來源。透過廣泛的實驗，我們 (1) 證明預測不確定性有效地表示基於 LLM 的推薦之可靠性，(2) 調查具有分解不確定性測量的來源，以及 (3) 提出對不確定性有意識的提示，以降低預測不確定性和增強推薦。我們的原始碼和模型權重可在 https://github.com/WonbinKweon/UNC_LLM_REC_WWW2025 取得", "author": "Wonbin Kweon et.al.", "authors": "Wonbin Kweon, Sanghwan Jang, SeongKu Kang, Hwanjo Yu", "id": "2501.17630v1", "paper_url": "http://arxiv.org/abs/2501.17630v1", "repo": "https://github.com/wonbinkweon/unc_llm_rec_www2025"}}