{"2408.07599": {"publish_time": "2024-08-14", "title": "Assessing the Role of Lexical Semantics in Cross-lingual Transfer through Controlled Manipulations", "paper_summary": "While cross-linguistic model transfer is effective in many settings, there is\nstill limited understanding of the conditions under which it works. In this\npaper, we focus on assessing the role of lexical semantics in cross-lingual\ntransfer, as we compare its impact to that of other language properties.\nExamining each language property individually, we systematically analyze how\ndifferences between English and a target language influence the capacity to\nalign the language with an English pretrained representation space. We do so by\nartificially manipulating the English sentences in ways that mimic specific\ncharacteristics of the target language, and reporting the effect of each\nmanipulation on the quality of alignment with the representation space. We show\nthat while properties such as the script or word order only have a limited\nimpact on alignment quality, the degree of lexical matching between the two\nlanguages, which we define using a measure of translation entropy, greatly\naffects it.", "paper_summary_zh": "儘管跨語言模型轉移在許多情況下有效，但對於其運作條件的了解仍然有限。在本文中，我們專注於評估詞彙語義在跨語言轉移中的作用，並將其影響與其他語言屬性的影響進行比較。單獨檢視各語言屬性，我們系統性地分析英語和目標語言之間的差異如何影響將語言與英語預訓練表示空間對齊的能力。我們透過人為地操縱英語句子，使其模擬目標語言的特定特徵，並報告每個操縱對與表示空間對齊品質的影響。我們表明，儘管腳本或字序等屬性對對齊品質的影響有限，但我們使用轉譯熵度量定義的兩種語言之間的詞彙匹配程度會對其產生很大影響。", "author": "Roy Ilani et.al.", "authors": "Roy Ilani, Taelin Karidi, Omri Abend", "id": "2408.07599v1", "paper_url": "http://arxiv.org/abs/2408.07599v1", "repo": "null"}}