{"2410.10144": {"publish_time": "2024-10-14", "title": "Unified Representation of Genomic and Biomedical Concepts through Multi-Task, Multi-Source Contrastive Learning", "paper_summary": "We introduce GENomic Encoding REpresentation with Language Model (GENEREL), a\nframework designed to bridge genetic and biomedical knowledge bases. What sets\nGENEREL apart is its ability to fine-tune language models to infuse biological\nknowledge behind clinical concepts such as diseases and medications. This\nfine-tuning enables the model to capture complex biomedical relationships more\neffectively, enriching the understanding of how genomic data connects to\nclinical outcomes. By constructing a unified embedding space for biomedical\nconcepts and a wide range of common SNPs from sources such as patient-level\ndata, biomedical knowledge graphs, and GWAS summaries, GENEREL aligns the\nembeddings of SNPs and clinical concepts through multi-task contrastive\nlearning. This allows the model to adapt to diverse natural language\nrepresentations of biomedical concepts while bypassing the limitations of\ntraditional code mapping systems across different data sources. Our experiments\ndemonstrate GENEREL's ability to effectively capture the nuanced relationships\nbetween SNPs and clinical concepts. GENEREL also emerges to discern the degree\nof relatedness, potentially allowing for a more refined identification of\nconcepts. This pioneering approach in constructing a unified embedding system\nfor both SNPs and biomedical concepts enhances the potential for data\nintegration and discovery in biomedical research.", "paper_summary_zh": "<paragraph>我們介紹 GENomic Encoding REpresentation with Language Model (GENEREL)，一個旨在橋接遺傳和生物醫學知識庫的框架。GENEREL 的獨特之處在於它微調語言模型，以灌輸疾病和藥物等臨床概念背後的生物知識。這種微調使模型能夠更有效地捕捉複雜的生物醫學關係，豐富對基因組數據如何連接臨床結果的理解。通過構建一個統一的生物醫學概念嵌入空間和來自患者級別數據、生物醫學知識圖譜和 GWAS 總結等來源的廣泛常見 SNP，GENEREL 通過多任務對比學習對齊 SNP 和臨床概念的嵌入。這允許模型適應生物醫學概念的多元自然語言表示，同時繞過不同數據源中傳統代碼映射系統的限制。我們的實驗證明了 GENEREL 有效捕捉 SNP 和臨床概念之間細微關係的能力。GENEREL 也出現了辨別相關程度，潛在地允許更精確地識別概念。這種構建 SNP 和生物醫學概念統一嵌入系統的先驅方法增強了生物醫學研究中數據整合和發現的潛力。</paragraph>", "author": "Hongyi Yuan et.al.", "authors": "Hongyi Yuan, Suqi Liu, Kelly Cho, Katherine Liao, Alexandre Pereira, Tianxi Cai", "id": "2410.10144v1", "paper_url": "http://arxiv.org/abs/2410.10144v1", "repo": "null"}}