{"2410.05102": {"publish_time": "2024-10-07", "title": "SparsePO: Controlling Preference Alignment of LLMs via Sparse Token Masks", "paper_summary": "Preference Optimization (PO) has proven an effective step for aligning\nlanguage models to human-desired behaviors. Current variants, following the\noffline Direct Preference Optimization objective, have focused on a strict\nsetting where all tokens are contributing signals of KL divergence and rewards\nto the loss function. However, human preference is not affected by each word in\na sequence equally but is often dependent on specific words or phrases, e.g.\nexistence of toxic terms leads to non-preferred responses. Based on this\nobservation, we argue that not all tokens should be weighted equally during PO\nand propose a flexible objective termed SparsePO, that aims to automatically\nlearn to weight the KL divergence and reward corresponding to each token during\nPO training. We propose two different variants of weight-masks that can either\nbe derived from the reference model itself or learned on the fly. Notably, our\nmethod induces sparsity in the learned masks, allowing the model to learn how\nto best weight reward and KL divergence contributions at the token level,\nlearning an optimal level of mask sparsity. Extensive experiments on multiple\ndomains, including sentiment control, dialogue, text summarization and\ntext-to-code generation, illustrate that our approach assigns meaningful\nweights to tokens according to the target task, generates more responses with\nthe desired preference and improves reasoning tasks by up to 2 percentage\npoints compared to other token- and response-level PO methods.", "paper_summary_zh": "偏好优化 (PO) 已被证明是将语言模型与人类期望行为对齐的有效步骤。遵循离线直接偏好优化目标的当前变体专注于一个严格的设置，其中所有标记都在为损失函数贡献 KL 散度和奖励的信号。然而，人类偏好不会受到序列中每个单词的影响，而通常依赖于特定单词或短语，例如存在有毒术语会导致非首选响应。基于此观察，我们认为在 PO 期间并非所有标记都应赋予同等权重，并提出了一个灵活的目标，称为 SparsePO，旨在自动学习在 PO 训练期间为每个标记加权 KL 散度和奖励。我们提出了两种不同的权重掩码变体，它们可以从参考模型本身派生或动态学习。值得注意的是，我们的方法在学习的掩码中引入稀疏性，允许模型学习如何最好地对标记级别的奖励和 KL 散度贡献进行加权，从而学习最佳的掩码稀疏性级别。在包括情感控制、对话、文本摘要和文本到代码生成在内的多个领域的广泛实验表明，我们的方法根据目标任务为标记分配了有意义的权重，生成了更多具有所需偏好的响应，并且与其他标记和响应级别的 PO 方法相比，推理任务提高了 2 个百分点。", "author": "Fenia Christopoulou et.al.", "authors": "Fenia Christopoulou, Ronald Cardenas, Gerasimos Lampouras, Haitham Bou-Ammar, Jun Wang", "id": "2410.05102v1", "paper_url": "http://arxiv.org/abs/2410.05102v1", "repo": "null"}}