{"2412.20571": {"publish_time": "2024-12-29", "title": "Segmentation of Muscularis Propria in Colon Histopathology Images Using Vision Transformers for Hirschsprung's Disease", "paper_summary": "Hirschsprung's disease (HD) is a congenital birth defect diagnosed by\nidentifying the lack of ganglion cells within the colon's muscularis propria,\nspecifically within the myenteric plexus regions. There may be advantages for\nquantitative assessments of histopathology images of the colon, such as\ncounting the ganglion and assessing their spatial distribution; however, this\nwould be time-intensive for pathologists, costly, and subject to inter- and\nintra-rater variability. Previous research has demonstrated the potential for\ndeep learning approaches to automate histopathology image analysis, including\nsegmentation of the muscularis propria using convolutional neural networks\n(CNNs). Recently, Vision Transformers (ViTs) have emerged as a powerful deep\nlearning approach due to their self-attention. This study explores the\napplication of ViTs for muscularis propria segmentation in calretinin-stained\nhistopathology images and compares their performance to CNNs and shallow\nlearning methods. The ViT model achieved a DICE score of 89.9% and Plexus\nInclusion Rate (PIR) of 100%, surpassing the CNN (DICE score of 89.2%; PIR of\n96.0%) and k-means clustering method (DICE score of 80.7%; PIR 77.4%). Results\nassert that ViTs are a promising tool for advancing HD-related image analysis.", "paper_summary_zh": "先天性巨結腸症 (HD) 是一種先天性出生缺陷，透過確認結腸肌層內缺乏神經節細胞，特別是在神經肌叢區域內，來診斷。對結腸組織病理學影像進行定量評估可能有一些優點，例如計算神經節並評估其空間分佈；然而，這對病理學家來說會很耗時、成本高昂，而且容易受到評分者之間和評分者內變異的影響。先前的研究已證明深度學習方法有潛力自動化組織病理學影像分析，包括使用卷積神經網路 (CNN) 對肌層進行分割。最近，視覺Transformer (ViT) 由於其自我注意，已成為一種強大的深度學習方法。本研究探討了 ViT 在鈣雷蛋白染色組織病理學影像中對肌層分割的應用，並將其效能與 CNN 和淺層學習方法進行比較。ViT 模型達到了 89.9% 的 DICE 分數和 100% 的神經叢包覆率 (PIR)，優於 CNN（DICE 分數為 89.2%；PIR 為 96.0%）和 k 均值聚類方法（DICE 分數為 80.7%；PIR 為 77.4%）。結果表明，ViT 是推動 HD 相關影像分析的一種有前途的工具。", "author": "Youssef Megahed et.al.", "authors": "Youssef Megahed, Anthony Fuller, Saleh Abou-Alwan, Dina El Demellawy, Adrian D. C. Chan", "id": "2412.20571v1", "paper_url": "http://arxiv.org/abs/2412.20571v1", "repo": "null"}}