{"2410.11502": {"publish_time": "2024-10-15", "title": "Offline Model-Based Optimization by Learning to Rank", "paper_summary": "Offline model-based optimization (MBO) aims to identify a design that\nmaximizes a black-box function using only a fixed, pre-collected dataset of\ndesigns and their corresponding scores. A common approach in offline MBO is to\ntrain a regression-based surrogate model by minimizing mean squared error (MSE)\nand then find the best design within this surrogate model by different\noptimizers (e.g., gradient ascent). However, a critical challenge is the risk\nof out-of-distribution errors, i.e., the surrogate model may typically\noverestimate the scores and mislead the optimizers into suboptimal regions.\nPrior works have attempted to address this issue in various ways, such as using\nregularization techniques and ensemble learning to enhance the robustness of\nthe model, but it still remains. In this paper, we argue that regression models\ntrained with MSE are not well-aligned with the primary goal of offline MBO,\nwhich is to select promising designs rather than to predict their scores\nprecisely. Notably, if a surrogate model can maintain the order of candidate\ndesigns based on their relative score relationships, it can produce the best\ndesigns even without precise predictions. To validate it, we conduct\nexperiments to compare the relationship between the quality of the final\ndesigns and MSE, finding that the correlation is really very weak. In contrast,\na metric that measures order-maintaining quality shows a significantly stronger\ncorrelation. Based on this observation, we propose learning a ranking-based\nmodel that leverages learning to rank techniques to prioritize promising\ndesigns based on their relative scores. We show that the generalization error\non ranking loss can be well bounded. Empirical results across diverse tasks\ndemonstrate the superior performance of our proposed ranking-based models than\ntwenty existing methods.", "paper_summary_zh": "<paragraph>離線模型基礎最佳化 (MBO) 的目標是找出一個設計，使用僅有固定預先收集的設計資料集及其對應分數，最大化黑盒函數。離線 MBO 的常見方法是透過最小化均方誤差 (MSE) 來訓練回歸基礎代理模型，然後在這個代理模型中透過不同的最佳化器 (例如，梯度上升) 找出最佳設計。然而，一個重大的挑戰是分佈外誤差的風險，也就是說，代理模型通常會高估分數，並誤導最佳化器進入次佳區域。先前的研究嘗試使用各種方法來解決這個問題，例如使用正則化技術和整體學習來增強模型的穩健性，但問題仍然存在。在本文中，我們主張使用 MSE 訓練的回歸模型與離線 MBO 的主要目標不一致，離線 MBO 的目標是選擇有前景的設計，而不是精確預測其分數。值得注意的是，如果代理模型可以根據候選設計的相對分數關係來維持順序，它甚至可以在沒有精確預測的情況下產生最佳設計。為了驗證這一點，我們進行實驗來比較最終設計的品質和 MSE 之間的關係，發現相關性非常低。相反地，一個衡量順序維持品質的指標顯示出顯著更強的相關性。根據這個觀察，我們建議學習一個排名基礎模型，利用學習排名技術根據相對分數來優先考慮有前景的設計。我們展示了排名損失的泛化誤差可以得到很好的約束。在不同任務中的經驗結果證明了我們提出的排名基礎模型比現有的二十種方法具有更優異的效能。</paragraph>", "author": "Rong-Xi Tan et.al.", "authors": "Rong-Xi Tan, Ke Xue, Shen-Huan Lyu, Haopu Shang, Yao Wang, Yaoyuan Wang, Sheng Fu, Chao Qian", "id": "2410.11502v1", "paper_url": "http://arxiv.org/abs/2410.11502v1", "repo": "null"}}