{"2501.05334": {"publish_time": "2025-01-09", "title": "The Bakers and Millers Game with Restricted Locations", "paper_summary": "We study strategic location choice by customers and sellers, termed the\nBakers and Millers Game in the literature. In our generalized setting, each\nmiller can freely choose any location for setting up a mill, while each baker\nis restricted in the choice of location for setting up a bakery. For optimal\nbargaining power, a baker would like to select a location with many millers to\nbuy flour from and with little competition from other bakers. Likewise, a\nmiller aims for a location with many bakers and few competing millers. Thus,\nboth types of agents choose locations to optimize the ratio of agents of\nopposite type divided by agents of the same type at their chosen location.\nOriginally raised in the context of Fractional Hedonic Games, the Bakers and\nMillers Game has applications that range from commerce to product design.\n  We study the impact of location restrictions on the properties of the game.\nWhile pure Nash equilibria trivially exist in the setting without location\nrestrictions, we show via a sophisticated, efficient algorithm that even the\nmore challenging restricted setting admits equilibria. Moreover, the computed\nequilibrium approximates the optimal social welfare by a factor of at most\n$2\\left(\\frac{e}{e-1}\\right)$. Furthermore, we give tight bounds on the price\nof anarchy/stability.\n  On the conceptual side, the location choice feature adds a new layer to the\nstandard setting of Hedonic Games, in the sense that agents that select the\nsame location form a coalition. This allows to naturally restrict the possible\ncoalitions that can be formed. With this, our model generalizes simple\nsymmetric Fractional Hedonic Games on complete bipartite valuation graphs and\nalso Hedonic Diversity Games with utilities single-peaked at 0. We believe that\nthis generalization is also a very interesting direction for other types of\nHedonic Games.", "paper_summary_zh": "<paragraph>我們研究由客戶和賣方進行的策略性位置選擇，在文獻中稱為麵包師和磨坊主的遊戲。在我們概括的設定中，每個磨坊主可以自由選擇任何位置來設置磨坊，而每個麵包師在選擇設置麵包店的時受到地點限制。為了獲得最佳的議價能力，麵包師希望選擇一個有許多磨坊主可以購買麵粉且與其他麵包師競爭較少的地點。同樣地，磨坊主會選擇一個有許多麵包師且競爭對手較少的磨坊主的地點。因此，這兩種類型的代理人都會選擇地點來優化在他們所選擇的地點，相反類型的代理人與相同類型的代理人的比例。最初在分數享樂遊戲的背景下提出，麵包師和磨坊主的遊戲有從商業到產品設計的廣泛應用。我們研究地點限制對遊戲屬性的影響。雖然在沒有地點限制的設定中，純納許均衡顯然存在，但我們透過一種複雜、有效的演算法證明，即使在更具挑戰性的受限設定中也能承認均衡。此外，計算出的均衡以最多 $2\\left(\\frac{e}{e-1}\\right)$ 的因子近似最佳社會福利。此外，我們對無政府狀態/穩定的價格給予嚴格的限制。在概念方面，地點選擇功能為享樂遊戲的標準設定增加了一層，在於選擇相同地點的代理人會組成一個聯盟。這允許自然地限制可以形成的可能聯盟。有了這個，我們的模型概括了在完整理論二分圖估值圖表上的簡單對稱分數享樂遊戲，以及在 0 處單峰的享樂多樣性遊戲。我們相信這個概括對於其他類型的享樂遊戲來說也是一個非常有趣的發展方向。</paragraph>", "author": "Simon Krogmann et.al.", "authors": "Simon Krogmann, Pascal Lenzner, Alexander Skopalik", "id": "2501.05334v1", "paper_url": "http://arxiv.org/abs/2501.05334v1", "repo": "null"}}