{"2411.17188": {"publish_time": "2024-11-26", "title": "Interleaved Scene Graph for Interleaved Text-and-Image Generation Assessment", "paper_summary": "Many real-world user queries (e.g. \"How do to make egg fried rice?\") could\nbenefit from systems capable of generating responses with both textual steps\nwith accompanying images, similar to a cookbook. Models designed to generate\ninterleaved text and images face challenges in ensuring consistency within and\nacross these modalities. To address these challenges, we present ISG, a\ncomprehensive evaluation framework for interleaved text-and-image generation.\nISG leverages a scene graph structure to capture relationships between text and\nimage blocks, evaluating responses on four levels of granularity: holistic,\nstructural, block-level, and image-specific. This multi-tiered evaluation\nallows for a nuanced assessment of consistency, coherence, and accuracy, and\nprovides interpretable question-answer feedback. In conjunction with ISG, we\nintroduce a benchmark, ISG-Bench, encompassing 1,150 samples across 8\ncategories and 21 subcategories. This benchmark dataset includes complex\nlanguage-vision dependencies and golden answers to evaluate models effectively\non vision-centric tasks such as style transfer, a challenging area for current\nmodels. Using ISG-Bench, we demonstrate that recent unified vision-language\nmodels perform poorly on generating interleaved content. While compositional\napproaches that combine separate language and image models show a 111%\nimprovement over unified models at the holistic level, their performance\nremains suboptimal at both block and image levels. To facilitate future work,\nwe develop ISG-Agent, a baseline agent employing a \"plan-execute-refine\"\npipeline to invoke tools, achieving a 122% performance improvement.", "paper_summary_zh": "許多真實世界的使用者查詢（例如「如何製作蛋炒飯？」）可以受益於能夠產生包含文字步驟和附帶圖片的回應的系統，類似於食譜。專門用於產生交錯文本和圖片的模型面臨確保這些方式內部和之間的一致性的挑戰。為了應對這些挑戰，我們提出了 ISG，一個用於交錯文本和圖片產生的綜合評估架構。ISG 利用場景圖結構來捕捉文本和圖片區塊之間的關係，在四個層級的粒度上評估回應：整體、結構、區塊層級和圖片特定。這種多層評估允許對一致性、連貫性和準確性進行細緻的評估，並提供可解釋的問題解答回饋。結合 ISG，我們引入了基準 ISG-Bench，涵蓋 8 個類別和 21 個子類別中的 1,150 個範例。這個基準資料集包含複雜的語言視覺依賴關係和黃金答案，以有效評估模型在以視覺為中心的任務（例如風格轉移）上的表現，這是當前模型面臨的挑戰領域。使用 ISG-Bench，我們證明了最近的統一視覺語言模型在產生交錯內容上的表現不佳。雖然結合單獨語言和圖片模型的組合方法在整體層級上比統一模型提升了 111%，但它們在區塊和圖片層級上的表現仍然不佳。為了促進後續工作，我們開發了 ISG-Agent，一個採用「計畫執行修正」管線的基準代理，用於呼叫工具，實現了 122% 的效能提升。", "author": "Dongping Chen et.al.", "authors": "Dongping Chen, Ruoxi Chen, Shu Pu, Zhaoyi Liu, Yanru Wu, Caixi Chen, Benlin Liu, Yue Huang, Yao Wan, Pan Zhou, Ranjay Krishna", "id": "2411.17188v1", "paper_url": "http://arxiv.org/abs/2411.17188v1", "repo": "null"}}