{"2503.06486": {"publish_time": "2025-03-09", "title": "PerturboLLaVA: Reducing Multimodal Hallucinations with Perturbative Visual Training", "paper_summary": "This paper aims to address the challenge of hallucinations in Multimodal\nLarge Language Models (MLLMs) particularly for dense image captioning tasks. To\ntackle the challenge, we identify the current lack of a metric that finely\nmeasures the caption quality in concept level. We hereby introduce HalFscore, a\nnovel metric built upon the language graph and is designed to evaluate both the\naccuracy and completeness of dense captions at a granular level. Additionally,\nwe identify the root cause of hallucination as the model's over-reliance on its\nlanguage prior. To address this, we propose PerturboLLaVA, which reduces the\nmodel's reliance on the language prior by incorporating adversarially perturbed\ntext during training. This method enhances the model's focus on visual inputs,\neffectively reducing hallucinations and producing accurate, image-grounded\ndescriptions without incurring additional computational overhead. PerturboLLaVA\nsignificantly improves the fidelity of generated captions, outperforming\nexisting approaches in handling multimodal hallucinations and achieving\nimproved performance across general multimodal benchmarks.", "paper_summary_zh": "<paragraph>本文旨在探討多模態大型語言模型 (MLLM) 中的幻覺現象，特別是在密集圖像描述任務中的幻覺問題。為了應對這一挑戰，我們發現目前缺乏一個能在概念層面精細衡量描述品質的指標。因此，我們引入了 HalFscore，這是一個基於語言圖的新型指標，旨在評估密集描述在細粒度層面上的準確性和完整性。此外，我們將幻覺的根本原因確定為模型過度依賴其語言先驗知識。為了應對此問題，我們提出了 PerturboLLaVA，它透過在訓練期間加入對抗性擾動的文本，來減少模型對語言先驗知識的依賴。這種方法增強了模型對視覺輸入的關注，有效地減少了幻覺，並在不增加額外計算開銷的情況下產生準確的、基於圖像的描述。PerturboLLaVA 大大提高了生成描述的保真度，在處理多模態幻覺方面優於現有方法，並在一般多模態基準測試中取得了更好的效能。</paragraph>\n", "author": "Cong Chen et.al.", "authors": "Cong Chen, Mingyu Liu, Chenchen Jing, Yizhou Zhou, Fengyun Rao, Hao Chen, Bo Zhang, Chunhua Shen", "id": "2503.06486v1", "paper_url": "http://arxiv.org/abs/2503.06486v1", "repo": "null"}}