{"2501.05497": {"publish_time": "2025-01-09", "title": "Spatial Information Integration in Small Language Models for Document Layout Generation and Classification", "paper_summary": "Document layout understanding is a field of study that analyzes the spatial\narrangement of information in a document hoping to understand its structure and\nlayout. Models such as LayoutLM (and its subsequent iterations) can understand\nsemi-structured documents with SotA results; however, the lack of open\nsemi-structured data is a limitation in itself. While semi-structured data is\ncommon in everyday life (balance sheets, purchase orders, receipts), there is a\nlack of public datasets for training machine learning models for this type of\ndocument. In this investigation we propose a method to generate new, synthetic,\nlayout information that can help overcoming this data shortage. According to\nour results, the proposed method performs better than LayoutTransformer,\nanother popular layout generation method. We also show that, in some scenarios,\ntext classification can improve when supported by bounding box information.", "paper_summary_zh": "文件配置理解是一个研究领域，它分析文件中的空间信息配置，并希望了解其结构和配置。LayoutLM（及其后续迭代）等模型可以理解半结构化文件，并具有 SotA 结果；但是，缺少开放的半结构化数据本身就是一种限制。虽然半结构化数据在日常生活中很常见（资产负债表、采购订单、收据），但缺乏用于训练机器学习模型的公共数据集来处理此类文件。在本次调查中，我们提出了一种生成新的合成配置信息的方法，这有助于克服数据短缺问题。根据我们的结果，所提出的方法比 LayoutTransformer（另一种流行的配置生成方法）表现得更好。我们还表明，在某些情况下，当由边界框信息支持时，文本分类可以得到改善。", "author": "Pablo Melendez et.al.", "authors": "Pablo Melendez, Clemens Havas", "id": "2501.05497v1", "paper_url": "http://arxiv.org/abs/2501.05497v1", "repo": "null"}}