{"2409.11860": {"publish_time": "2024-09-18", "title": "Retrieve, Annotate, Evaluate, Repeat: Leveraging Multimodal LLMs for Large-Scale Product Retrieval Evaluation", "paper_summary": "Evaluating production-level retrieval systems at scale is a crucial yet\nchallenging task due to the limited availability of a large pool of\nwell-trained human annotators. Large Language Models (LLMs) have the potential\nto address this scaling issue and offer a viable alternative to humans for the\nbulk of annotation tasks. In this paper, we propose a framework for assessing\nthe product search engines in a large-scale e-commerce setting, leveraging\nMultimodal LLMs for (i) generating tailored annotation guidelines for\nindividual queries, and (ii) conducting the subsequent annotation task. Our\nmethod, validated through deployment on a large e-commerce platform,\ndemonstrates comparable quality to human annotations, significantly reduces\ntime and cost, facilitates rapid problem discovery, and provides an effective\nsolution for production-level quality control at scale.", "paper_summary_zh": "評估生產級檢索系統的規模是一項至關重要的任務，但由於缺乏大量訓練有素的人類註解員，這是一項具有挑戰性的任務。大型語言模型 (LLM) 有可能解決這個擴充問題，並為大部分註解任務提供一個可行的替代方案。在本文中，我們提出了一個框架，用於評估大型電子商務環境中的產品搜尋引擎，利用多模態 LLM 進行：(i) 為個別查詢生成客製化的註解指南，以及 (ii) 執行後續的註解任務。我們的這項方法已通過在大型電子商務平台上部署進行驗證，證明其品質與人類註解相當，大幅減少時間和成本，促進快速問題發現，並提供一個有效的解決方案，用於規模化的生產級品質控管。", "author": "Kasra Hosseini et.al.", "authors": "Kasra Hosseini, Thomas Kober, Josip Krapac, Roland Vollgraf, Weiwei Cheng, Ana Peleteiro Ramallo", "id": "2409.11860v1", "paper_url": "http://arxiv.org/abs/2409.11860v1", "repo": "null"}}