{"2412.03072": {"publish_time": "2024-12-04", "title": "Preference-based opponent shaping in differentiable games", "paper_summary": "Strategy learning in game environments with multi-agent is a challenging\nproblem. Since each agent's reward is determined by the joint strategy, a\ngreedy learning strategy that aims to maximize its own reward may fall into a\nlocal optimum. Recent studies have proposed the opponent modeling and shaping\nmethods for game environments. These methods enhance the efficiency of strategy\nlearning by modeling the strategies and updating processes of other agents.\nHowever, these methods often rely on simple predictions of opponent strategy\nchanges. Due to the lack of modeling behavioral preferences such as cooperation\nand competition, they are usually applicable only to predefined scenarios and\nlack generalization capabilities. In this paper, we propose a novel\nPreference-based Opponent Shaping (PBOS) method to enhance the strategy\nlearning process by shaping agents' preferences towards cooperation. We\nintroduce the preference parameter, which is incorporated into the agent's loss\nfunction, thus allowing the agent to directly consider the opponent's loss\nfunction when updating the strategy. We update the preference parameters\nconcurrently with strategy learning to ensure that agents can adapt to any\ncooperative or competitive game environment. Through a series of experiments,\nwe verify the performance of PBOS algorithm in a variety of differentiable\ngames. The experimental results show that the PBOS algorithm can guide the\nagent to learn the appropriate preference parameters, so as to achieve better\nreward distribution in multiple game environments.", "paper_summary_zh": "在具有多智能體的遊戲環境中進行策略學習是一個具有挑戰性的問題。由於每個智能體的獎勵是由聯合策略決定的，因此旨在最大化自身獎勵的貪婪學習策略可能會陷入局部最優。最近的研究提出了對手建模和塑造遊戲環境的方法。這些方法通過對其他智能體的策略和更新過程進行建模，提高了策略學習的效率。然而，這些方法通常依賴於對對手策略變化的簡單預測。由於缺乏對合作和競爭等行為偏好的建模，它們通常僅適用於預定義的場景，並且缺乏泛化能力。在本文中，我們提出了一種新的基於偏好的對手塑造 (PBOS) 方法，通過塑造智能體對合作的偏好來增強策略學習過程。我們引入了偏好參數，該參數被納入智能體的損失函數中，從而允許智能體在更新策略時直接考慮對手的損失函數。我們與策略學習同時更新偏好參數，以確保智能體可以適應任何合作或競爭的遊戲環境。通過一系列實驗，我們驗證了 PBOS 演算法在各種可微分遊戲中的性能。實驗結果表明，PBOS 演算法可以引導智能體學習適當的偏好參數，從而在多個遊戲環境中實現更好的獎勵分配。", "author": "Xinyu Qiao et.al.", "authors": "Xinyu Qiao, Yudong Hu, Congying Han, Weiyan Wu, Tiande Guo", "id": "2412.03072v1", "paper_url": "http://arxiv.org/abs/2412.03072v1", "repo": "null"}}