{"2405.18719": {"publish_time": "2024-05-29", "title": "Contextual Position Encoding: Learning to Count What's Important", "paper_summary": "The attention mechanism is a critical component of Large Language Models\n(LLMs) that allows tokens in a sequence to interact with each other, but is\norder-invariant. Incorporating position encoding (PE) makes it possible to\naddress by position, such as attending to the i-th token. However, current PE\nmethods use token counts to derive position, and thus cannot generalize to\nhigher levels of abstraction, such as attending to the i-th sentence. In this\npaper, we propose a new position encoding method, Contextual Position Encoding\n(CoPE), that allows positions to be conditioned on context by incrementing\nposition only on certain tokens determined by the model. This allows more\ngeneral position addressing such as attending to the $i$-th particular word,\nnoun, or sentence. We show that CoPE can solve the selective copy, counting and\nFlip-Flop tasks where popular position embeddings fail, and improves perplexity\non language modeling and coding tasks.", "paper_summary_zh": "注意力机制是大型语言模型 (LLM) 中的关键组件，它允许序列中的标记相互交互，但与顺序无关。合并位置编码 (PE) 可以按位置进行寻址，例如关注第 i 个标记。但是，当前的 PE 方法使用标记计数来推导出位置，因此无法概括到更高的抽象级别，例如关注第 i 个句子。在本文中，我们提出了一种新的位置编码方法，即上下文位置编码 (CoPE)，它允许位置通过仅在模型确定的某些标记上增加位置来根据上下文进行调节。这允许更通用的位置寻址，例如关注第 i 个特定单词、名词或句子。我们表明，CoPE 可以解决选择性复制、计数和触发器任务，而流行的位置嵌入会失败，并且可以提高语言建模和编码任务的困惑度。", "author": "Olga Golovneva et.al.", "authors": "Olga Golovneva, Tianlu Wang, Jason Weston, Sainbayar Sukhbaatar", "id": "2405.18719v1", "paper_url": "http://arxiv.org/abs/2405.18719v1", "repo": "null"}}