{"2411.10156": {"publish_time": "2024-11-15", "title": "Mitigating Sycophancy in Decoder-Only Transformer Architectures: Synthetic Data Intervention", "paper_summary": "To address the sycophancy problem caused by reinforcement learning from human\nfeedback in large language models, this research applies synthetic data\nintervention technology to the decoder-only transformer architecture. Based on\nthe research gaps in the existing literature, the researcher designed an\nexperimental process to reduce the tendency of models to cater by generating\ndiversified data, and used GPT4o as an experimental tool for verification. The\nexperiment used 100 true and false questions, and compared the performance of\nthe model trained with synthetic data intervention and the original untrained\nmodel on multiple indicators. The results show that the SDI training model\nsupports the technology in terms of accuracy rate and sycophancy rate and has\nsignificant effectiveness in reducing sycophancy phenomena. Notably, the data\nset, experimental process, code and data results have been uploaded to Github,\nthe link is https://github.com/brucewang123456789/GeniusTrail.git.", "paper_summary_zh": "為了解決大型語言模型中因人類反饋的強化學習所造成的阿諛奉承問題，本研究將合成資料介入技術應用於僅解碼器Transformer架構中。研究者基於現有文獻中的研究缺口，設計了一個實驗流程，透過生成多元資料來減少模型迎合的傾向，並以 GPT4o 作為驗證的實驗工具。實驗中採用 100 題是非題，並比較了使用合成資料介入訓練的模型與原未訓練模型在多項指標上的表現。結果顯示，SDI 訓練模型在準確率與阿諛奉承率上，皆支持了技術對於減少阿諛奉承現象的顯著成效。特別的是，資料集、實驗流程、程式碼與資料結果已上傳至 Github，連結為 https://github.com/brucewang123456789/GeniusTrail.git。", "author": "Libo Wang et.al.", "authors": "Libo Wang", "id": "2411.10156v1", "paper_url": "http://arxiv.org/abs/2411.10156v1", "repo": "https://github.com/brucewang123456789/GeniusTrail"}}