{"2408.03489": {"publish_time": "2024-08-07", "title": "Harnessing the Power of LLMs in Source Code Vulnerability Detection", "paper_summary": "Software vulnerabilities, caused by unintentional flaws in source code, are a\nprimary root cause of cyberattacks. Static analysis of source code has been\nwidely used to detect these unintentional defects introduced by software\ndevelopers. Large Language Models (LLMs) have demonstrated human-like\nconversational abilities due to their capacity to capture complex patterns in\nsequential data, such as natural languages. In this paper, we harness LLMs'\ncapabilities to analyze source code and detect known vulnerabilities. To ensure\nthe proposed vulnerability detection method is universal across multiple\nprogramming languages, we convert source code to LLVM IR and train LLMs on\nthese intermediate representations. We conduct extensive experiments on various\nLLM architectures and compare their accuracy. Our comprehensive experiments on\nreal-world and synthetic codes from NVD and SARD demonstrate high accuracy in\nidentifying source code vulnerabilities.", "paper_summary_zh": "軟體漏洞是由原始碼中的無心瑕疵所造成，是網路攻擊的主要根源。原始碼的靜態分析已廣泛用於偵測軟體開發人員所引入的這些無心缺陷。大型語言模型 (LLM) 已展現出類似人類的對話能力，因為它們有能力擷取序列資料中的複雜模式，例如自然語言。在本文中，我們利用 LLM 的能力來分析原始碼並偵測已知的漏洞。為了確保所提出的漏洞偵測方法在多種程式語言中通用，我們將原始碼轉換為 LLVM IR，並在這些中間表示上訓練 LLM。我們對各種 LLM 架構進行廣泛的實驗，並比較其準確性。我們對來自 NVD 和 SARD 的真實世界和合成程式碼進行的全面實驗，證明了在識別原始碼漏洞方面具有很高的準確性。", "author": "Andrew A Mahyari et.al.", "authors": "Andrew A Mahyari", "id": "2408.03489v1", "paper_url": "http://arxiv.org/abs/2408.03489v1", "repo": "null"}}