{"2408.06061": {"publish_time": "2024-08-12", "title": "Quantum Algorithms for Compositional Text Processing", "paper_summary": "Quantum computing and AI have found a fruitful intersection in the field of\nnatural language processing. We focus on the recently proposed DisCoCirc\nframework for natural language, and propose a quantum adaptation, QDisCoCirc.\nThis is motivated by a compositional approach to rendering AI interpretable:\nthe behavior of the whole can be understood in terms of the behavior of parts,\nand the way they are put together. For the model-native primitive operation of\ntext similarity, we derive quantum algorithms for fault-tolerant quantum\ncomputers to solve the task of question-answering within QDisCoCirc, and show\nthat this is BQP-hard; note that we do not consider the complexity of\nquestion-answering in other natural language processing models. Assuming\nwidely-held conjectures, implementing the proposed model classically would\nrequire super-polynomial resources. Therefore, it could provide a meaningful\ndemonstration of the power of practical quantum processors. The model\nconstruction builds on previous work in compositional quantum natural language\nprocessing. Word embeddings are encoded as parameterized quantum circuits, and\ncompositionality here means that the quantum circuits compose according to the\nlinguistic structure of the text. We outline a method for evaluating the model\non near-term quantum processors, and elsewhere we report on a recent\nimplementation of this on quantum hardware. In addition, we adapt a quantum\nalgorithm for the closest vector problem to obtain a Grover-like speedup in the\nfault-tolerant regime for our model. This provides an unconditional quadratic\nspeedup over any classical algorithm in certain circumstances, which we will\nverify empirically in future work.", "paper_summary_zh": "<paragraph>量子运算和 AI 在自然語言處理領域中找到了富有成效的交集。我們專注於最近提出的自然語言 DisCoCirc 框架，並提出一個量子適應 QDisCoCirc。這是一個基於組合式方法來讓 AI 可解讀的動機：整體的行為可以用部分的行為來理解，以及它們組合在一起的方式。對於文本相似性的模型原生原始操作，我們推導出容錯量子電腦的量子演算法，以解決 QDisCoCirc 中的問答任務，並表明這是一個 BQP-hard；請注意，我們不考慮其他自然語言處理模型中問答的複雜性。假設廣泛存在的猜想，以傳統方式實作建議的模型將需要超多項式資源。因此，它可以提供實際量子處理器功能的有意義示範。模型建構建立在先前的組合式量子自然語言處理工作上。字詞嵌入被編碼為參數化量子電路，而組合性在此表示量子電路根據文本的語言結構進行組合。我們概述了一種在近期量子處理器上評估模型的方法，而在其他地方我們報告了最近在量子硬體上的實作。此外，我們調整了最近向量問題的量子演算法，以在我們模型的容錯機制中獲得類似 Grover 的加速。在某些情況下，這提供了對任何傳統演算法的無條件二次加速，我們將在未來的研究中以經驗方式驗證這一點。</paragraph>", "author": "Tuomas Laakkonen et.al.", "authors": "Tuomas Laakkonen, Konstantinos Meichanetzidis, Bob Coecke", "id": "2408.06061v1", "paper_url": "http://arxiv.org/abs/2408.06061v1", "repo": "null"}}