{"2408.05636": {"publish_time": "2024-08-10", "title": "Speculative Diffusion Decoding: Accelerating Language Generation through Diffusion", "paper_summary": "Speculative decoding has emerged as a widely adopted method to accelerate\nlarge language model inference without sacrificing the quality of the model\noutputs. While this technique has facilitated notable speed improvements by\nenabling parallel sequence verification, its efficiency remains inherently\nlimited by the reliance on incremental token generation in existing draft\nmodels. To overcome this limitation, this paper proposes an adaptation of\nspeculative decoding which uses discrete diffusion models to generate draft\nsequences. This allows parallelization of both the drafting and verification\nsteps, providing significant speed-ups to the inference process. Our proposed\napproach, \\textit{Speculative Diffusion Decoding (SpecDiff)}, is validated on\nstandard language generation benchmarks and empirically demonstrated to provide\na \\textbf{up to 8.7x speed-up over standard generation processes and up to 2.5x\nspeed-up over existing speculative decoding approaches.}", "paper_summary_zh": "推論性解碼已成為一種廣泛採用的方法，用於加速大型語言模型推論，同時不犧牲模型輸出的品質。雖然此技術透過啟用並行序列驗證促進了顯著的速度提升，但其效率本質上仍受到現有草稿模型中依賴漸進式代碼產生所限制。為了克服此限制，本文提出推論性解碼的改編，該改編使用離散擴散模型來產生草稿序列。這允許起草和驗證步驟並行化，大幅提升推論程序的速度。我們提出的方法「推論性擴散解碼 (SpecDiff)」已在標準語言產生基準上驗證，並經實證證明可提供「比標準產生程序快上 8.7 倍，比現有推論性解碼方法快上 2.5 倍」的加速效果。", "author": "Jacob K Christopher et.al.", "authors": "Jacob K Christopher, Brian R Bartoldson, Bhavya Kailkhura, Ferdinando Fioretto", "id": "2408.05636v1", "paper_url": "http://arxiv.org/abs/2408.05636v1", "repo": "null"}}