{"2406.10519": {"publish_time": "2024-06-15", "title": "Self Pre-training with Topology- and Spatiality-aware Masked Autoencoders for 3D Medical Image Segmentation", "paper_summary": "Masked Autoencoders (MAEs) have been shown to be effective in pre-training\nVision Transformers (ViTs) for natural and medical image analysis problems. By\nreconstructing missing pixel/voxel information in visible patches, a ViT\nencoder can aggregate contextual information for downstream tasks. But,\nexisting MAE pre-training methods, which were specifically developed with the\nViT architecture, lack the ability to capture geometric shape and spatial\ninformation, which is critical for medical image segmentation tasks. In this\npaper, we propose a novel extension of known MAEs for self pre-training (i.e.,\nmodels pre-trained on the same target dataset) for 3D medical image\nsegmentation. (1) We propose a new topological loss to preserve geometric shape\ninformation by computing topological signatures of both the input and\nreconstructed volumes, learning geometric shape information. (2) We introduce a\npre-text task that predicts the positions of the centers and eight corners of\n3D crops, enabling the MAE to aggregate spatial information. (3) We extend the\nMAE pre-training strategy to a hybrid state-of-the-art (SOTA) medical image\nsegmentation architecture and co-pretrain it alongside the ViT. (4) We develop\na fine-tuned model for downstream segmentation tasks by complementing the\npre-trained ViT encoder with our pre-trained SOTA model. Extensive experiments\non five public 3D segmentation datasets show the effectiveness of our new\napproach.", "paper_summary_zh": "蒙面自動編碼器 (MAE) 已被證明可有效用於自然和醫學影像分析問題的 Vision Transformer (ViT) 預訓練。透過重建可見補丁中遺失的像素/體素資訊，ViT 編碼器可以彙總下游任務的脈絡資訊。但是，專門針對 ViT 架構開發的現有 MAE 預訓練方法缺乏擷取幾何形狀和空間資訊的能力，而這對於醫學影像分割任務至關重要。在本文中，我們提出已知 MAE 的新延伸，用於 3D 醫學影像分割的自預訓練（即在同一目標資料集上預訓練的模型）。（1）我們提出新的拓撲損失來保留幾何形狀資訊，方法是計算輸入和重建體積的拓撲特徵，學習幾何形狀資訊。（2）我們引入預文本任務，用於預測 3D 裁剪的中心和八個角的位置，使 MAE 能夠彙總空間資訊。（3）我們將 MAE 預訓練策略延伸到混合的最新 (SOTA) 醫學影像分割架構，並與 ViT 一起預訓練它。（4）我們透過補充預訓練的 ViT 編碼器與我們的預訓練 SOTA 模型，為下游分割任務開發微調模型。在五個公開 3D 分割資料集上進行的廣泛實驗顯示了我們新方法的有效性。", "author": "Pengfei Gu et.al.", "authors": "Pengfei Gu, Yejia Zhang, Huimin Li, Hongxiao Wang, Yizhe Zhang, Chaoli Wang, Danny Z. Chen", "id": "2406.10519v1", "paper_url": "http://arxiv.org/abs/2406.10519v1", "repo": "null"}}