{"2406.09606": {"publish_time": "2024-06-13", "title": "Cross-Modality Program Representation Learning for Electronic Design Automation with High-Level Synthesis", "paper_summary": "In recent years, domain-specific accelerators (DSAs) have gained popularity\nfor applications such as deep learning and autonomous driving. To facilitate\nDSA designs, programmers use high-level synthesis (HLS) to compile a high-level\ndescription written in C/C++ into a design with low-level hardware description\nlanguages that eventually synthesize DSAs on circuits. However, creating a\nhigh-quality HLS design still demands significant domain knowledge,\nparticularly in microarchitecture decisions expressed as \\textit{pragmas}.\nThus, it is desirable to automate such decisions with the help of machine\nlearning for predicting the quality of HLS designs, requiring a deeper\nunderstanding of the program that consists of original code and pragmas.\nNaturally, these programs can be considered as sequence data. In addition,\nthese programs can be compiled and converted into a control data flow graph\n(CDFG). But existing works either fail to leverage both modalities or combine\nthe two in shallow or coarse ways. We propose ProgSG, a model that allows\ninteraction between the source code sequence modality and the graph modality in\na deep and fine-grained way. To alleviate the scarcity of labeled designs, a\npre-training method is proposed based on a suite of compiler's data flow\nanalysis tasks. Experimental results show that ProgSG reduces the RMSE of\ndesign performance predictions by up to $22\\%$, and identifies designs with an\naverage of $1.10\\times$ and $1.26\\times$ (up to $8.17\\times$ and $13.31\\times$)\nperformance improvement in design space exploration (DSE) task compared to HARP\nand AutoDSE, respectively.", "paper_summary_zh": "<paragraph>近年来，特定领域加速器 (DSA) 在深度学习和自动驾驶等应用中获得了广泛应用。为了促进 DSA 设计，程序员使用高级综合 (HLS) 将用 C/C++ 编写的较高层次描述编译成采用低层次硬件描述语言的设计，最终在电路中综合 DSA。然而，创建高质量 HLS 设计仍然需要大量的领域知识，尤其是以“编译器指示”形式表达的微架构决策。因此，期望借助机器学习自动化此类决策，以预测 HLS 设计的质量，需要更深入地理解由原始代码和编译器指示组成的程序。自然而然地，这些程序可以被视为序列数据。此外，这些程序可以被编译并转换为控制数据流图 (CDFG)。但现有工作要么无法利用这两种方式，要么以浅显或粗略的方式将两者结合起来。我们提出了 ProgSG，这是一个允许以深入且细粒度的形式在源代码序列方式和图方式之间进行交互的模型。为了缓解标记设计稀缺的问题，提出了一种基于编译器数据流分析任务套件的预训练方法。实验结果表明，ProgSG 将设计性能预测的 RMSE 降低了高达 22%，并且在设计空间探索 (DSE) 任务中，与 HARP 和 AutoDSE 相比，分别以平均 1.10 倍和 1.26 倍（高达 8.17 倍和 13.31 倍）的性能改进识别设计。</paragraph>", "author": "Zongyue Qin et.al.", "authors": "Zongyue Qin, Yunsheng Bai, Atefeh Sohrabizadeh, Zijian Ding, Ziniu Hu, Yizhou Sun, Jason Cong", "id": "2406.09606v2", "paper_url": "http://arxiv.org/abs/2406.09606v2", "repo": "null"}}