{"2412.02612": {"publish_time": "2024-12-03", "title": "GLM-4-Voice: Towards Intelligent and Human-Like End-to-End Spoken Chatbot", "paper_summary": "We introduce GLM-4-Voice, an intelligent and human-like end-to-end spoken\nchatbot. It supports both Chinese and English, engages in real-time voice\nconversations, and varies vocal nuances such as emotion, intonation, speech\nrate, and dialect according to user instructions. GLM-4-Voice uses an ultra-low\nbitrate (175bps), single-codebook speech tokenizer with 12.5Hz frame rate\nderived from an automatic speech recognition (ASR) model by incorporating a\nvector-quantized bottleneck into the encoder. To efficiently transfer knowledge\nfrom text to speech modalities, we synthesize speech-text interleaved data from\nexisting text pre-training corpora using a text-to-token model. We continue\npre-training from the pre-trained text language model GLM-4-9B with a\ncombination of unsupervised speech data, interleaved speech-text data, and\nsupervised speech-text data, scaling up to 1 trillion tokens, achieving\nstate-of-the-art performance in both speech language modeling and spoken\nquestion answering. We then fine-tune the pre-trained model with high-quality\nconversational speech data, achieving superior performance compared to existing\nbaselines in both conversational ability and speech quality. The open models\ncan be accessed through https://github.com/THUDM/GLM-4-Voice and\nhttps://huggingface.co/THUDM/glm-4-voice-9b.", "paper_summary_zh": "<paragraph>我們推出 GLM-4-Voice，一款智慧且擬人的端對端語音聊天機器人。它支援中文和英文，進行即時語音對話，並根據使用者的指示調整語音的細微差別，例如情緒、語調、語速和方言。GLM-4-Voice 使用超低位元率 (175bps)、單碼本語音分詞器，具有 12.5Hz 幀率，源自於自動語音辨識 (ASR) 模型，方法是將向量量化瓶頸納入編碼器中。為了有效率地將知識從文字傳輸到語音模式，我們使用文字到代碼模型，從現有的文字預訓練語料庫中合成語音文字交錯資料。我們繼續使用預訓練文字語言模型 GLM-4-9B 進行預訓練，並結合非監督式語音資料、交錯語音文字資料，以及監督式語音文字資料，擴充到 1 兆個代碼，在語音語言建模和語音問答中達成最先進的表現。然後，我們使用高品質對話語音資料微調預訓練模型，在對話能力和語音品質上都達成比現有基準更好的表現。開放模型可透過 https://github.com/THUDM/GLM-4-Voice 和 https://huggingface.co/THUDM/glm-4-voice-9b 存取。</paragraph>", "author": "Aohan Zeng et.al.", "authors": "Aohan Zeng, Zhengxiao Du, Mingdao Liu, Kedong Wang, Shengmin Jiang, Lei Zhao, Yuxiao Dong, Jie Tang", "id": "2412.02612v1", "paper_url": "http://arxiv.org/abs/2412.02612v1", "repo": "https://github.com/thudm/glm-4-voice"}}