{"2412.07493": {"publish_time": "2024-12-10", "title": "Ontology-driven Prompt Tuning for LLM-based Task and Motion Planning", "paper_summary": "Performing complex manipulation tasks in dynamic environments requires\nefficient Task and Motion Planning (TAMP) approaches, which combine high-level\nsymbolic plan with low-level motion planning. Advances in Large Language Models\n(LLMs), such as GPT-4, are transforming task planning by offering natural\nlanguage as an intuitive and flexible way to describe tasks, generate symbolic\nplans, and reason. However, the effectiveness of LLM-based TAMP approaches is\nlimited due to static and template-based prompting, which struggles in adapting\nto dynamic environments and complex task contexts. To address these\nlimitations, this work proposes a novel ontology-driven prompt-tuning framework\nthat employs knowledge-based reasoning to refine and expand user prompts with\ntask contextual reasoning and knowledge-based environment state descriptions.\nIntegrating domain-specific knowledge into the prompt ensures semantically\naccurate and context-aware task plans. The proposed framework demonstrates its\neffectiveness by resolving semantic errors in symbolic plan generation, such as\nmaintaining logical temporal goal ordering in scenarios involving hierarchical\nobject placement. The proposed framework is validated through both simulation\nand real-world scenarios, demonstrating significant improvements over the\nbaseline approach in terms of adaptability to dynamic environments, and the\ngeneration of semantically correct task plans.", "paper_summary_zh": "在動態環境中執行複雜操作任務需要有效率的任務和動作規劃 (TAMP) 方法，它結合了高階符號計畫和低階動作規劃。大型語言模型 (LLM) 的進展，例如 GPT-4，透過提供自然語言作為一種直觀且彈性的方式來描述任務、產生符號計畫和推理，進而轉變了任務規劃。然而，基於 LLM 的 TAMP 方法的有效性受到靜態和基於範本的提示的限制，這在適應動態環境和複雜任務情境方面有困難。為了解決這些限制，這項工作提出了一個新穎的本體驅動提示調整架構，它採用基於知識的推理來使用任務情境推理和基於知識的環境狀態描述來精煉和擴充使用者的提示。將特定領域的知識整合到提示中，可確保語義準確且具備情境感知的任務計畫。所提出的架構透過解決符號計畫產生中的語義錯誤來證明其有效性，例如在涉及階層式物件放置的情境中維持邏輯時間目標順序。所提出的架構透過模擬和真實世界情境進行驗證，證明在適應動態環境以及產生語義正確的任務計畫方面，都比基線方法有顯著的進步。", "author": "Muhayy Ud Din et.al.", "authors": "Muhayy Ud Din, Jan Rosell, Waseem Akram, Isiah Zaplana, Maximo A Roa, Lakmal Seneviratne, Irfan Hussain", "id": "2412.07493v1", "paper_url": "http://arxiv.org/abs/2412.07493v1", "repo": "null"}}