{"2503.15204": {"publish_time": "2025-03-19", "title": "When Pigs Get Sick: Multi-Agent AI for Swine Disease Detection", "paper_summary": "Swine disease surveillance is critical to the sustainability of global\nagriculture, yet its effectiveness is frequently undermined by limited\nveterinary resources, delayed identification of cases, and variability in\ndiagnostic accuracy. To overcome these barriers, we introduce a novel\nAI-powered, multi-agent diagnostic system that leverages Retrieval-Augmented\nGeneration (RAG) to deliver timely, evidence-based disease detection and\nclinical guidance. By automatically classifying user inputs into either\nKnowledge Retrieval Queries or Symptom-Based Diagnostic Queries, the system\nensures targeted information retrieval and facilitates precise diagnostic\nreasoning. An adaptive questioning protocol systematically collects relevant\nclinical signs, while a confidence-weighted decision fusion mechanism\nintegrates multiple diagnostic hypotheses to generate robust disease\npredictions and treatment recommendations. Comprehensive evaluations\nencompassing query classification, disease diagnosis, and knowledge retrieval\ndemonstrate that the system achieves high accuracy, rapid response times, and\nconsistent reliability. By providing a scalable, AI-driven diagnostic\nframework, this approach enhances veterinary decision-making, advances\nsustainable livestock management practices, and contributes substantively to\nthe realization of global food security.", "paper_summary_zh": "<paragraph>豬隻疾病監測對於全球農業的可持續性至關重要，但其有效性經常受到有限的獸醫資源、病例識別延遲以及診斷準確性差異的影響。為了克服這些障礙，我們引入了一種新型的AI賦能、多代理診斷系統，它利用檢索增強生成 (RAG) 來提供及時、基於證據的疾病檢測和臨床指導。通過自動將用戶輸入分類為知識檢索查詢或基於症狀的診斷查詢，該系統可確保目標資訊檢索並促進精確的診斷推理。自適應提問協議系統地收集相關臨床症狀，而置信加權決策融合機制則整合多個診斷假設，以生成可靠的疾病預測和治療建議。包含查詢分類、疾病診斷和知識檢索的綜合評估表明，該系統實現了高準確性、快速響應時間和一致的可靠性。通過提供可擴展的、AI驅動的診斷框架，這種方法可增強獸醫決策、推進可持續的牲畜管理實踐，並為實現全球糧食安全做出實質性貢獻。</paragraph>\n", "author": "Tittaya Mairittha et.al.", "authors": "Tittaya Mairittha, Tanakon Sawanglok, Panuwit Raden, Sorrawit Treesuk", "id": "2503.15204v1", "paper_url": "http://arxiv.org/abs/2503.15204v1", "repo": "null"}}