{"2501.13692": {"publish_time": "2025-01-23", "title": "Training-Free Consistency Pipeline for Fashion Repose", "paper_summary": "Recent advancements in diffusion models have significantly broadened the\npossibilities for editing images of real-world objects. However, performing\nnon-rigid transformations, such as changing the pose of objects or image-based\nconditioning, remains challenging. Maintaining object identity during these\nedits is difficult, and current methods often fall short of the precision\nneeded for industrial applications, where consistency is critical.\nAdditionally, fine-tuning diffusion models requires custom training data, which\nis not always accessible in real-world scenarios. This work introduces\nFashionRepose, a training-free pipeline for non-rigid pose editing specifically\ndesigned for the fashion industry. The approach integrates off-the-shelf models\nto adjust poses of long-sleeve garments, maintaining identity and branding\nattributes. FashionRepose uses a zero-shot approach to perform these edits in\nnear real-time, eliminating the need for specialized training. consistent image\nediting. The solution holds potential for applications in the fashion industry\nand other fields demanding identity preservation in image editing.", "paper_summary_zh": "最近在擴散模型方面的進展顯著拓寬了編輯真實世界物體圖像的可能性。然而，執行非剛性轉換（例如更改物體的姿勢或基於圖像的條件）仍然具有挑戰性。在這些編輯過程中維護物體身分很困難，而且目前的技術通常無法達到產業應用所需的精確度，而一致性在產業應用中至關重要。此外，微調擴散模型需要自訂訓練資料，這在真實世界的場景中並不總是可取得的。這項工作介紹了 FashionRepose，一種專門為時尚產業設計的非剛性姿勢編輯免訓練管道。這種方法整合了現成的模型來調整長袖服裝的姿勢，同時維持身分和品牌屬性。FashionRepose 使用零次學習方法來執行這些編輯，幾乎可以即時完成，無需進行專業訓練。一致的圖像編輯。此解決方案在時尚產業和其他需要在圖像編輯中保留身分的領域具有應用潛力。", "author": "Potito Aghilar et.al.", "authors": "Potito Aghilar, Vito Walter Anelli, Michelantonio Trizio, Tommaso Di Noia", "id": "2501.13692v1", "paper_url": "http://arxiv.org/abs/2501.13692v1", "repo": "null"}}