{"2501.09878": {"publish_time": "2025-01-16", "title": "ASTRA: A Scene-aware TRAnsformer-based model for trajectory prediction", "paper_summary": "We present ASTRA (A} Scene-aware TRAnsformer-based model for trajectory\nprediction), a light-weight pedestrian trajectory forecasting model that\nintegrates the scene context, spatial dynamics, social inter-agent interactions\nand temporal progressions for precise forecasting. We utilised a U-Net-based\nfeature extractor, via its latent vector representation, to capture scene\nrepresentations and a graph-aware transformer encoder for capturing social\ninteractions. These components are integrated to learn an agent-scene aware\nembedding, enabling the model to learn spatial dynamics and forecast the future\ntrajectory of pedestrians. The model is designed to produce both deterministic\nand stochastic outcomes, with the stochastic predictions being generated by\nincorporating a Conditional Variational Auto-Encoder (CVAE). ASTRA also\nproposes a simple yet effective weighted penalty loss function, which helps to\nyield predictions that outperform a wide array of state-of-the-art\ndeterministic and generative models. ASTRA demonstrates an average improvement\nof 27%/10% in deterministic/stochastic settings on the ETH-UCY dataset, and 26%\nimprovement on the PIE dataset, respectively, along with seven times fewer\nparameters than the existing state-of-the-art model (see Figure 1).\nAdditionally, the model's versatility allows it to generalize across different\nperspectives, such as Bird's Eye View (BEV) and Ego-Vehicle View (EVV).", "paper_summary_zh": "<paragraph>我們提出 ASTRA（一種場景感知的軌跡預測模型），這是一個輕量級的行人軌跡預測模型，它整合了場景脈絡、空間動態、社會互動代理和時間進程，以進行精確預測。我們利用了基於 U-Net 的特徵提取器，通過其潛在向量表示，來捕獲場景表示和一個圖感知轉換器編碼器，以捕獲社交互動。這些組件被整合起來，以學習一種代理場景感知嵌入，使模型能夠學習空間動態並預測行人的未來軌跡。該模型被設計為既能產生確定性結果，又能產生隨機性結果，隨機性預測是通過整合條件變分自編碼器 (CVAE) 生成的。ASTRA 還提出了一個簡單但有效的加權懲罰損失函數，這有助於產生比各種最先進的確定性和生成模型表現更好的預測。ASTRA 在 ETH-UCY 數據集上的確定性/隨機設置中展示了平均 27%/10% 的改進，在 PIE 數據集上的改進為 26%，同時參數比現有的最先進模型少七倍（見圖 1）。此外，該模型的多功能性允許它在不同的視角之間進行概括，例如鳥瞰圖 (BEV) 和車輛視角 (EVV)。</paragraph>", "author": "Izzeddin Teeti et.al.", "authors": "Izzeddin Teeti, Aniket Thomas, Munish Monga, Sachin Kumar, Uddeshya Singh, Andrew Bradley, Biplab Banerjee, Fabio Cuzzolin", "id": "2501.09878v1", "paper_url": "http://arxiv.org/abs/2501.09878v1", "repo": "null"}}