{"2412.04859": {"publish_time": "2024-12-06", "title": "Breaking Event Rumor Detection via Stance-Separated Multi-Agent Debate", "paper_summary": "The rapid spread of rumors on social media platforms during breaking events\nseverely hinders the dissemination of the truth. Previous studies reveal that\nthe lack of annotated resources hinders the direct detection of unforeseen\nbreaking events not covered in yesterday's news. Leveraging large language\nmodels (LLMs) for rumor detection holds significant promise. However, it is\nchallenging for LLMs to provide comprehensive responses to complex or\ncontroversial issues due to limited diversity. In this work, we propose the\nStance Separated Multi-Agent Debate (S2MAD) to address this issue.\nSpecifically, we firstly introduce Stance Separation, categorizing comments as\neither supporting or opposing the original claim. Subsequently, claims are\nclassified as subjective or objective, enabling agents to generate reasonable\ninitial viewpoints with different prompt strategies for each type of claim.\nDebaters then follow specific instructions through multiple rounds of debate to\nreach a consensus. If a consensus is not reached, a judge agent evaluates the\nopinions and delivers a final verdict on the claim's veracity. Extensive\nexperiments conducted on two real-world datasets demonstrate that our proposed\nmodel outperforms state-of-the-art methods in terms of performance and\neffectively improves the performance of LLMs in breaking event rumor detection.", "paper_summary_zh": "在突發事件期間，謠言在社群媒體平台上的快速傳播嚴重阻礙了真相的傳播。先前的研究表明，缺乏註解資源阻礙了對昨日新聞未涵蓋的突發事件的直接偵測。利用大型語言模型 (LLM) 進行謠言偵測具有顯著的潛力。然而，由於多樣性有限，LLM 難以對複雜或有爭議的問題提供全面的回應。在這項工作中，我們提出立場分隔的多主體辯論 (S2MAD) 來解決這個問題。具體來說，我們首先引入立場分隔，將評論分類為支持或反對原始說法。隨後，將說法分類為主觀或客觀，使主體能夠針對每種類型的說法產生合理的初始觀點，並採用不同的提示策略。然後，辯論者遵循具體的指示進行多輪辯論，以達成共識。如果未達成共識，法官主體會評估意見並對說法的真實性做出最終裁決。在兩個真實世界資料集上進行的廣泛實驗表明，我們提出的模型在效能方面優於最先進的方法，並有效提升了 LLM 在突發事件謠言偵測中的效能。", "author": "Mingqing Zhang et.al.", "authors": "Mingqing Zhang, Haisong Gong, Qiang Liu, Shu Wu, Liang Wang", "id": "2412.04859v1", "paper_url": "http://arxiv.org/abs/2412.04859v1", "repo": "null"}}