{"2405.18991": {"publish_time": "2024-05-29", "title": "EasyAnimate: A High-Performance Long Video Generation Method based on Transformer Architecture", "paper_summary": "This paper presents EasyAnimate, an advanced method for video generation that\nleverages the power of transformer architecture for high-performance outcomes.\nWe have expanded the DiT framework originally designed for 2D image synthesis\nto accommodate the complexities of 3D video generation by incorporating a\nmotion module block. It is used to capture temporal dynamics, thereby ensuring\nthe production of consistent frames and seamless motion transitions. The motion\nmodule can be adapted to various DiT baseline methods to generate video with\ndifferent styles. It can also generate videos with different frame rates and\nresolutions during both training and inference phases, suitable for both images\nand videos. Moreover, we introduce slice VAE, a novel approach to condense the\ntemporal axis, facilitating the generation of long duration videos. Currently,\nEasyAnimate exhibits the proficiency to generate videos with 144 frames. We\nprovide a holistic ecosystem for video production based on DiT, encompassing\naspects such as data pre-processing, VAE training, DiT models training (both\nthe baseline model and LoRA model), and end-to-end video inference. Code is\navailable at: https://github.com/aigc-apps/EasyAnimate. We are continuously\nworking to enhance the performance of our method.", "paper_summary_zh": "本文提出了 EasyAnimate，這是一種先進的影片生成方法，它利用Transformer架構的力量來獲得高性能的結果。我們擴充了原本設計用於 2D 影像合成的 DiT 架構，以容納 3D 影片生成的複雜性，方法是加入一個動作模組區塊。它用於捕捉時間動態，從而確保產生一致的畫面和流暢的動作轉換。動作模組可以適應各種 DiT 基準方法，以產生不同風格的影片。它還可以在訓練和推理階段產生不同幀率和解析度的影片，適用於影像和影片。此外，我們引入了切片 VAE，這是一種濃縮時間軸的新方法，有助於產生長時影片。目前，EasyAnimate 展示了產生 144 幀影片的能力。我們提供了一個基於 DiT 的整體影片製作生態系統，包含資料前處理、VAE 訓練、DiT 模型訓練（基線模型和 LoRA 模型）和端到端影片推理等面向。程式碼可在 https://github.com/aigc-apps/EasyAnimate 取得。我們持續致力於提升我們的方法的效能。", "author": "Jiaqi Xu et.al.", "authors": "Jiaqi Xu, Xinyi Zou, Kunzhe Huang, Yunkuo Chen, Bo Liu, MengLi Cheng, Xing Shi, Jun Huang", "id": "2405.18991v1", "paper_url": "http://arxiv.org/abs/2405.18991v1", "repo": "https://github.com/aigc-apps/easyanimate"}}