{"2409.07291": {"publish_time": "2024-09-11", "title": "Exploring User-level Gradient Inversion with a Diffusion Prior", "paper_summary": "We explore user-level gradient inversion as a new attack surface in\ndistributed learning. We first investigate existing attacks on their ability to\nmake inferences about private information beyond training data reconstruction.\nMotivated by the low reconstruction quality of existing methods, we propose a\nnovel gradient inversion attack that applies a denoising diffusion model as a\nstrong image prior in order to enhance recovery in the large batch setting.\nUnlike traditional attacks, which aim to reconstruct individual samples and\nsuffer at large batch and image sizes, our approach instead aims to recover a\nrepresentative image that captures the sensitive shared semantic information\ncorresponding to the underlying user. Our experiments with face images\ndemonstrate the ability of our methods to recover realistic facial images along\nwith private user attributes.", "paper_summary_zh": "我們探索使用者層級梯度反轉作為分散式學習中新的攻擊面。我們首先調查現有攻擊，了解它們推論訓練資料重建以外的私人資訊的能力。在現有方法重建品質低落的動機下，我們提出一個新穎的梯度反轉攻擊，它採用去噪擴散模型作為強大的影像先驗，以增強在大批次設定中的復原能力。與傳統攻擊不同的是，傳統攻擊旨在重建個別樣本，並在大量的批次和影像大小中受苦，我們的做法反而旨在復原一個代表性的影像，捕捉與底層使用者相應的敏感共享語義資訊。我們對人臉影像進行的實驗證明了我們的方法能夠復原逼真的臉部影像，以及私人使用者屬性。", "author": "Zhuohang Li et.al.", "authors": "Zhuohang Li, Andrew Lowy, Jing Liu, Toshiaki Koike-Akino, Bradley Malin, Kieran Parsons, Ye Wang", "id": "2409.07291v1", "paper_url": "http://arxiv.org/abs/2409.07291v1", "repo": "null"}}