{"2409.03140": {"publish_time": "2024-09-05", "title": "GraphEx: A Graph-based Extraction Method for Advertiser Keyphrase Recommendation", "paper_summary": "Online sellers and advertisers are recommended keyphrases for their listed\nproducts, which they bid on to enhance their sales. One popular paradigm that\ngenerates such recommendations is Extreme Multi-Label Classification (XMC),\nwhich involves tagging/mapping keyphrases to items. We outline the limitations\nof using traditional item-query based tagging or mapping techniques for\nkeyphrase recommendations on E-Commerce platforms. We introduce GraphEx, an\ninnovative graph-based approach that recommends keyphrases to sellers using\nextraction of token permutations from item titles. Additionally, we demonstrate\nthat relying on traditional metrics such as precision/recall can be misleading\nin practical applications, thereby necessitating a combination of metrics to\nevaluate performance in real-world scenarios. These metrics are designed to\nassess the relevance of keyphrases to items and the potential for buyer\noutreach. GraphEx outperforms production models at eBay, achieving the\nobjectives mentioned above. It supports near real-time inferencing in\nresource-constrained production environments and scales effectively for\nbillions of items.", "paper_summary_zh": "線上賣家和廣告商會收到建議關鍵字，用於其所列產品，他們會對這些關鍵字進行競標以提高銷售額。產生此類建議的一種流行範例是極端多標籤分類 (XMC)，其中涉及將關鍵字標記/對應至商品。我們概述了在電子商務平台上使用傳統的基於商品查詢的標記或對應技術來進行關鍵字建議的限制。我們引入了 GraphEx，這是一種創新的基於圖形的方法，它使用從商品標題中提取的標記排列來向賣家推薦關鍵字。此外，我們證明了在實際應用中依賴於傳統指標（例如準確度/召回率）可能會產生誤導，因此需要結合指標來評估實際場景中的效能。這些指標旨在評估關鍵字與商品的相關性以及買家外展的潛力。GraphEx 優於 eBay 上的生產模型，達到了上述目標。它支援在資源受限的生產環境中進行近乎即時的推理，並針對數十億個商品有效擴展。", "author": "Ashirbad Mishra et.al.", "authors": "Ashirbad Mishra, Soumik Dey, Marshall Wu, Jinyu Zhao, He Yu, Kaichen Ni, Binbin Li, Kamesh Madduri", "id": "2409.03140v1", "paper_url": "http://arxiv.org/abs/2409.03140v1", "repo": "null"}}