{"2405.19729": {"publish_time": "2024-05-30", "title": "Dynamic feature selection in medical predictive monitoring by reinforcement learning", "paper_summary": "In this paper, we investigate dynamic feature selection within multivariate\ntime-series scenario, a common occurrence in clinical prediction monitoring\nwhere each feature corresponds to a bio-test result. Many existing feature\nselection methods fall short in effectively leveraging time-series information,\nprimarily because they are designed for static data. Our approach addresses\nthis limitation by enabling the selection of time-varying feature subsets for\neach patient. Specifically, we employ reinforcement learning to optimize a\npolicy under maximum cost restrictions. The prediction model is subsequently\nupdated using synthetic data generated by trained policy. Our method can\nseamlessly integrate with non-differentiable prediction models. We conducted\nexperiments on a sizable clinical dataset encompassing regression and\nclassification tasks. The results demonstrate that our approach outperforms\nstrong feature selection baselines, particularly when subjected to stringent\ncost limitations. Code will be released once paper is accepted.", "paper_summary_zh": "在本文中，我们研究多變量時間序列場景中的動態特徵選擇，這在臨床上預測監控中很常見，其中每個特徵對應於一個生物檢測結果。許多現有的特徵選擇方法在有效利用時間序列資訊方面做得並不好，主要是因為它們是為靜態資料而設計的。我們的做法通過為每個患者啟用時間變異特徵子集的選擇來解決這個限制。具體來說，我們採用強化學習來在最大成本限制下最佳化一個策略。預測模型隨後使用由訓練策略產生的合成資料更新。我們的做法可以與不可微分預測模型無縫整合。我們在一個包含回歸和分類任務的大型臨床資料集上進行了實驗。結果表明，我們的做法優於強大的特徵選擇基線，特別是在受到嚴格成本限制時。一旦論文被接受，程式碼將會發布。", "author": "Yutong Chen et.al.", "authors": "Yutong Chen, Jiandong Gao, Ji Wu", "id": "2405.19729v1", "paper_url": "http://arxiv.org/abs/2405.19729v1", "repo": "null"}}