{"2502.02368": {"publish_time": "2025-02-04", "title": "Evaluating the Effectiveness of LLMs in Fixing Maintainability Issues in Real-World Projects", "paper_summary": "Large Language Models (LLMs) have gained attention for addressing coding\nproblems, but their effectiveness in fixing code maintainability remains\nunclear. This study evaluates LLMs capability to resolve 127 maintainability\nissues from 10 GitHub repositories. We use zero-shot prompting for Copilot Chat\nand Llama 3.1, and few-shot prompting with Llama only. The LLM-generated\nsolutions are assessed for compilation errors, test failures, and new\nmaintainability problems. Llama with few-shot prompting successfully fixed\n44.9% of the methods, while Copilot Chat and Llama zero-shot fixed 32.29% and\n30%, respectively. However, most solutions introduced errors or new\nmaintainability issues. We also conducted a human study with 45 participants to\nevaluate the readability of 51 LLM-generated solutions. The human study showed\nthat 68.63% of participants observed improved readability. Overall, while LLMs\nshow potential for fixing maintainability issues, their introduction of errors\nhighlights their current limitations.", "paper_summary_zh": "大型語言模型 (LLM) 在解決編碼問題方面備受關注，但它們在修復程式碼可維護性方面的效能仍不明確。本研究評估了 LLM 解決來自 10 個 GitHub 儲存庫的 127 個可維護性問題的能力。我們對 Copilot Chat 和 Llama 3.1 使用零次提示，僅對 Llama 使用少次提示。評估 LLM 生成的解決方案的編譯錯誤、測試失敗和新的可維護性問題。使用少次提示的 Llama 成功修復了 44.9% 的方法，而 Copilot Chat 和 Llama 零次提示分別修復了 32.29% 和 30%。然而，大多數解決方案引入了錯誤或新的可維護性問題。我們還進行了一項包含 45 名參與者的研究，以評估 51 個 LLM 生成的解決方案的可讀性。研究表明，68.63% 的參與者觀察到可讀性有所改善。總體而言，雖然 LLM 在修復可維護性問題方面顯示出潛力，但它們引入的錯誤突顯了它們目前的局限性。", "author": "Henrique Nunes et.al.", "authors": "Henrique Nunes, Eduardo Figueiredo, Larissa Rocha, Sarah Nadi, Fischer Ferreira, Geanderson Esteves", "id": "2502.02368v1", "paper_url": "http://arxiv.org/abs/2502.02368v1", "repo": "null"}}