{"2412.17415": {"publish_time": "2024-12-23", "title": "VidCtx: Context-aware Video Question Answering with Image Models", "paper_summary": "To address computational and memory limitations of Large Multimodal Models in\nthe Video Question-Answering task, several recent methods extract textual\nrepresentations per frame (e.g., by captioning) and feed them to a Large\nLanguage Model (LLM) that processes them to produce the final response.\nHowever, in this way, the LLM does not have access to visual information and\noften has to process repetitive textual descriptions of nearby frames. To\naddress those shortcomings, in this paper, we introduce VidCtx, a novel\ntraining-free VideoQA framework which integrates both modalities, i.e. both\nvisual information from input frames and textual descriptions of others frames\nthat give the appropriate context. More specifically, in the proposed framework\na pre-trained Large Multimodal Model (LMM) is prompted to extract at regular\nintervals, question-aware textual descriptions (captions) of video frames.\nThose will be used as context when the same LMM will be prompted to answer the\nquestion at hand given as input a) a certain frame, b) the question and c) the\ncontext/caption of an appropriate frame. To avoid redundant information, we\nchose as context the descriptions of distant frames. Finally, a simple yet\neffective max pooling mechanism is used to aggregate the frame-level decisions.\nThis methodology enables the model to focus on the relevant segments of the\nvideo and scale to a high number of frames. Experiments show that VidCtx\nachieves competitive performance among approaches that rely on open models on\nthree public Video QA benchmarks, NExT-QA, IntentQA and STAR.", "paper_summary_zh": "<paragraph>為了解決大型多模態模型在影片問答任務中的運算和記憶限制，最近有幾種方法每幀提取文字表徵（例如，透過標題），並將其提供給大型語言模型（LLM），由其處理以產生最後的回應。\n然而，這樣一來，LLM 無法存取視覺資訊，而且常常必須處理附近幀的重複文字描述。為了解決這些缺點，我們在這篇論文中介紹 VidCtx，一種新穎的免訓練 VideoQA 架構，它整合了兩種模式，也就是輸入幀的視覺資訊和提供適當脈絡的其他幀的文字描述。更具體地說，在建議的架構中，會提示預先訓練好的大型多模態模型（LMM）定期提取影片幀的與問題相關的文字描述（標題）。\n當提示相同的 LMM 回答手邊的問題時，這些描述將用作脈絡，輸入為 a）某個幀、b）問題，以及 c）適當幀的脈絡/標題。為了避免冗餘資訊，我們選擇遠距離幀的描述作為脈絡。最後，使用一個簡單但有效的最大池化機制來彙總幀層級的決策。這種方法使模型能夠專注於影片中的相關片段，並擴展到大量的幀。實驗顯示，VidCtx 在依賴開放模型的方法中，於三個公開的影片問答基準，NExT-QA、IntentQA 和 STAR，取得了有競爭力的表現。</paragraph>", "author": "Andreas Goulas et.al.", "authors": "Andreas Goulas, Vasileios Mezaris, Ioannis Patras", "id": "2412.17415v1", "paper_url": "http://arxiv.org/abs/2412.17415v1", "repo": "null"}}