{"2408.14053": {"publish_time": "2024-08-26", "title": "Enhancing Depression Diagnosis with Chain-of-Thought Prompting", "paper_summary": "When using AI to detect signs of depressive disorder, AI models habitually\ndraw preemptive conclusions. We theorize that using chain-of-thought (CoT)\nprompting to evaluate Patient Health Questionnaire-8 (PHQ-8) scores will\nimprove the accuracy of the scores determined by AI models. In our findings,\nwhen the models reasoned with CoT, the estimated PHQ-8 scores were consistently\ncloser on average to the accepted true scores reported by each participant\ncompared to when not using CoT. Our goal is to expand upon AI models'\nunderstanding of the intricacies of human conversation, allowing them to more\neffectively assess a patient's feelings and tone, therefore being able to more\naccurately discern mental disorder symptoms; ultimately, we hope to augment AI\nmodels' abilities, so that they can be widely accessible and used in the\nmedical field.", "paper_summary_zh": "當使用 AI 來偵測憂鬱症的徵兆時，AI 模型習慣性地得出先發制人的結論。我們假設使用思考鏈 (CoT) 提示來評估患者健康問卷 8 (PHQ-8) 分數，將會提升 AI 模型所決定的分數準確度。在我們的發現中，當模型使用 CoT 推理時，估計的 PHQ-8 分數平均來說持續更接近每個參與者所報告的公認真實分數，相較於不使用 CoT 時。我們的目標是擴展 AI 模型對於人類對話的複雜性的理解，讓它們能夠更有效地評估患者的情緒和語氣，因此能夠更準確地辨別心理疾病的症狀；最終，我們希望增強 AI 模型的能力，讓它們能夠廣泛地被使用於醫療領域。", "author": "Elysia Shi et.al.", "authors": "Elysia Shi, Adithri Manda, London Chowdhury, Runeema Arun, Kevin Zhu, Michael Lam", "id": "2408.14053v2", "paper_url": "http://arxiv.org/abs/2408.14053v2", "repo": "null"}}