{"2501.18512": {"publish_time": "2025-01-30", "title": "Streaming DiLoCo with overlapping communication: Towards a Distributed Free Lunch", "paper_summary": "Training of large language models (LLMs) is typically distributed across a\nlarge number of accelerators to reduce training time. Since internal states and\nparameter gradients need to be exchanged at each and every single gradient\nstep, all devices need to be co-located using low-latency high-bandwidth\ncommunication links to support the required high volume of exchanged bits.\nRecently, distributed algorithms like DiLoCo have relaxed such co-location\nconstraint: accelerators can be grouped into ``workers'', where\nsynchronizations between workers only occur infrequently. This in turn means\nthat workers can afford being connected by lower bandwidth communication links\nwithout affecting learning quality. However, in these methods, communication\nacross workers still requires the same peak bandwidth as before, as the\nsynchronizations require all parameters to be exchanged across all workers. In\nthis paper, we improve DiLoCo in three ways. First, we synchronize only subsets\nof parameters in sequence, rather than all at once, which greatly reduces peak\nbandwidth. Second, we allow workers to continue training while synchronizing,\nwhich decreases wall clock time. Third, we quantize the data exchanged by\nworkers, which further reduces bandwidth across workers. By properly combining\nthese modifications, we show experimentally that we can distribute training of\nbillion-scale parameters and reach similar quality as before, but reducing\nrequired bandwidth by two orders of magnitude.", "paper_summary_zh": "大型語言模型 (LLM) 的訓練通常會分散在大量的加速器上，以縮短訓練時間。由於內部狀態和參數梯度需要在每個單一梯度步驟中交換，因此所有裝置都需要使用低延遲高頻寬通訊連結並置，以支援大量交換位元的要求。最近，DiLoCo 等分散式演算法放寬了此並置限制：加速器可以分組成「工作者」，其中工作者之間的同步僅會不頻繁地發生。這反過來表示工作者可以負擔透過較低頻寬通訊連結連線，而不會影響學習品質。然而，在這些方法中，工作者之間的通訊仍然需要與以往相同的峰值頻寬，因為同步需要在所有工作者之間交換所有參數。在本文中，我們以三種方式改進 DiLoCo。首先，我們僅依序同步參數的子集，而不是一次同步所有參數，這大幅減少了峰值頻寬。其次，我們允許工作者在同步時繼續訓練，這減少了實際時鐘時間。第三，我們量化工作者交換的資料，這進一步減少了工作者之間的頻寬。透過適當地結合這些修改，我們透過實驗證明，我們可以分散訓練十億規模的參數，並達到與以往相似的品質，但將所需的頻寬減少了兩個數量級。", "author": "Arthur Douillard et.al.", "authors": "Arthur Douillard, Yanislav Donchev, Keith Rush, Satyen Kale, Zachary Charles, Zachary Garrett, Gabriel Teston, Dave Lacey, Ross McIlroy, Jiajun Shen, Alexandre Ramé, Arthur Szlam, Marc'Aurelio Ranzato, Paul Barham", "id": "2501.18512v1", "paper_url": "http://arxiv.org/abs/2501.18512v1", "repo": "null"}}