{"2405.05418": {"publish_time": "2024-05-08", "title": "Mitigating Exaggerated Safety in Large Language Models", "paper_summary": "As the popularity of Large Language Models (LLMs) grow, combining model\nsafety with utility becomes increasingly important. The challenge is making\nsure that LLMs can recognize and decline dangerous prompts without sacrificing\ntheir ability to be helpful. The problem of \"exaggerated safety\" demonstrates\nhow difficult this can be. To reduce excessive safety behaviours -- which was\ndiscovered to be 26.1% of safe prompts being misclassified as dangerous and\nrefused -- we use a combination of XSTest dataset prompts as well as\ninteractive, contextual, and few-shot prompting to examine the decision bounds\nof LLMs such as Llama2, Gemma Command R+, and Phi-3. We find that few-shot\nprompting works best for Llama2, interactive prompting works best Gemma, and\ncontextual prompting works best for Command R+ and Phi-3. Using a combination\nof these prompting strategies, we are able to mitigate exaggerated safety\nbehaviors by an overall 92.9% across all LLMs. Our work presents a multiple\nprompting strategies to jailbreak LLMs' decision-making processes, allowing\nthem to navigate the tight line between refusing unsafe prompts and remaining\nhelpful.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的普及，模型安全與實用性結合變得越來越重要。挑戰在於確保 LLM 能識別並拒絕危險的提示，同時不犧牲它們的幫助能力。「誇大的安全性」問題說明了這有多麼困難。為了減少過度的安全行為（發現有 26.1% 的安全提示被錯誤分類為危險並被拒絕），我們結合使用 XSTest 資料集提示以及互動式、情境式和少次提示來檢視 LLM（例如 Llama2、Gemma Command R+ 和 Phi-3）的決策界限。我們發現，少次提示最適合 Llama2，互動式提示最適合 Gemma，而情境式提示最適合 Command R+ 和 Phi-3。透過結合這些提示策略，我們能夠在所有 LLM 中將誇大的安全性行為降低 92.9%。我們的研究提出了多種提示策略，以破解 LLM 的決策流程，讓它們能夠在拒絕不安全提示和保持有幫助之間取得平衡。", "author": "Ruchi Bhalani et.al.", "authors": "Ruchi Bhalani, Ruchira Ray", "id": "2405.05418v1", "paper_url": "http://arxiv.org/abs/2405.05418v1", "repo": "null"}}