{"2406.08092": {"publish_time": "2024-06-12", "title": "Languages Transferred Within the Encoder: On Representation Transfer in Zero-Shot Multilingual Translation", "paper_summary": "Understanding representation transfer in multilingual neural machine\ntranslation can reveal the representational issue causing the zero-shot\ntranslation deficiency. In this work, we introduce the identity pair, a\nsentence translated into itself, to address the lack of the base measure in\nmultilingual investigations, as the identity pair represents the optimal state\nof representation among any language transfers. In our analysis, we demonstrate\nthat the encoder transfers the source language to the representational subspace\nof the target language instead of the language-agnostic state. Thus, the\nzero-shot translation deficiency arises because representations are entangled\nwith other languages and are not transferred effectively to the target\nlanguage. Based on our findings, we propose two methods: 1) low-rank\nlanguage-specific embedding at the encoder, and 2) language-specific\ncontrastive learning of the representation at the decoder. The experimental\nresults on Europarl-15, TED-19, and OPUS-100 datasets show that our methods\nsubstantially enhance the performance of zero-shot translations by improving\nlanguage transfer capacity, thereby providing practical evidence to support our\nconclusions.", "paper_summary_zh": "了解多語言神經機器翻譯中的表示轉移，可以揭示導致零次學習翻譯缺陷的表示問題。在這項工作中，我們引入了同一對，一個翻譯成自身的句子，以解決多語言研究中缺乏基準測量，因為同一對表示任何語言轉換之間表示的最佳狀態。在我們的分析中，我們證明編碼器將源語言轉移到目標語言的表示子空間，而不是與語言無關的狀態。因此，零次學習翻譯缺陷是因為表示與其他語言糾纏在一起，並且沒有有效地轉移到目標語言。根據我們的發現，我們提出了兩種方法：1) 編碼器中的低秩語言特定嵌入，以及 2) 解碼器中表示的語言特定對比學習。在 Europarl-15、TED-19 和 OPUS-100 資料集上的實驗結果表明，我們的語言轉移能力方法顯著提高了零次學習翻譯的性能，從而提供了實際證據來支持我們的結論。", "author": "Zhi Qu et.al.", "authors": "Zhi Qu, Chenchen Ding, Taro Watanabe", "id": "2406.08092v1", "paper_url": "http://arxiv.org/abs/2406.08092v1", "repo": "null"}}