{"2405.20628": {"publish_time": "2024-05-31", "title": "ToxVidLLM: A Multimodal LLM-based Framework for Toxicity Detection in Code-Mixed Videos", "paper_summary": "In an era of rapidly evolving internet technology, the surge in multimodal\ncontent, including videos, has expanded the horizons of online communication.\nHowever, the detection of toxic content in this diverse landscape, particularly\nin low-resource code-mixed languages, remains a critical challenge. While\nsubstantial research has addressed toxic content detection in textual data, the\nrealm of video content, especially in non-English languages, has been\nrelatively underexplored. This paper addresses this research gap by introducing\na benchmark dataset, the first of its kind, consisting of 931 videos with 4021\ncode-mixed Hindi-English utterances collected from YouTube. Each utterance\nwithin this dataset has been meticulously annotated for toxicity, severity, and\nsentiment labels. We have developed an advanced Multimodal Multitask framework\nbuilt for Toxicity detection in Video Content by leveraging Large Language\nModels (LLMs), crafted for the primary objective along with the additional\ntasks of conducting sentiment and severity analysis. ToxVidLLM incorporates\nthree key modules the Encoder module, Cross-Modal Synchronization module, and\nMultitask module crafting a generic multimodal LLM customized for intricate\nvideo classification tasks. Our experiments reveal that incorporating multiple\nmodalities from the videos substantially enhances the performance of toxic\ncontent detection by achieving an Accuracy and Weighted F1 score of 94.29% and\n94.35%, respectively.", "paper_summary_zh": "在互联网技术快速发展的时代，包括视频在内的多模态内容激增，拓宽了在线交流的视野。然而，在这一多元化的领域中检测有毒内容，尤其是在资源匮乏的代码混合语言中，仍然是一项严峻的挑战。虽然大量研究已经解决了文本数据中的有毒内容检测，但视频内容领域，尤其是非英语语言，相对而言尚未得到充分探索。本文通过引入基准数据集来解决这一研究空白，该数据集是同类数据集中的第一个，包含 931 个视频，其中有 4021 个代码混合的印地语-英语话语，这些话语是从 YouTube 收集的。该数据集中的每个话语都经过精心注释，以表示毒性、严重性和情绪标签。我们开发了一个先进的多模态多任务框架，用于通过利用大型语言模型 (LLM) 来检测视频内容中的毒性，该框架专为主要目标以及执行情绪和严重性分析的附加任务而设计。ToxVidLLM 采用了三个关键模块：编码器模块、跨模态同步模块和多任务模块，打造了一个针对复杂视频分类任务定制的通用多模态 LLM。我们的实验表明，通过视频合并多种模态可以大幅提高有毒内容检测的性能，准确率和加权 F1 分别达到 94.29% 和 94.35%。", "author": "Krishanu Maity et.al.", "authors": "Krishanu Maity, A. S. Poornash, Sriparna Saha, Pushpak Bhattacharyya", "id": "2405.20628v1", "paper_url": "http://arxiv.org/abs/2405.20628v1", "repo": "null"}}