{"2412.16715": {"publish_time": "2024-12-21", "title": "From Histopathology Images to Cell Clouds: Learning Slide Representations with Hierarchical Cell Transformer", "paper_summary": "It is clinically crucial and potentially very beneficial to be able to\nanalyze and model directly the spatial distributions of cells in histopathology\nwhole slide images (WSI). However, most existing WSI datasets lack cell-level\nannotations, owing to the extremely high cost over giga-pixel images. Thus, it\nremains an open question whether deep learning models can directly and\neffectively analyze WSIs from the semantic aspect of cell distributions. In\nthis work, we construct a large-scale WSI dataset with more than 5 billion\ncell-level annotations, termed WSI-Cell5B, and a novel hierarchical Cell Cloud\nTransformer (CCFormer) to tackle these challenges. WSI-Cell5B is based on 6,998\nWSIs of 11 cancers from The Cancer Genome Atlas Program, and all WSIs are\nannotated per cell by coordinates and types. To the best of our knowledge,\nWSI-Cell5B is the first WSI-level large-scale dataset integrating cell-level\nannotations. On the other hand, CCFormer formulates the collection of cells in\neach WSI as a cell cloud and models cell spatial distribution. Specifically,\nNeighboring Information Embedding (NIE) is proposed to characterize the\ndistribution of cells within the neighborhood of each cell, and a novel\nHierarchical Spatial Perception (HSP) module is proposed to learn the spatial\nrelationship among cells in a bottom-up manner. The clinical analysis indicates\nthat WSI-Cell5B can be used to design clinical evaluation metrics based on\ncounting cells that effectively assess the survival risk of patients. Extensive\nexperiments on survival prediction and cancer staging show that learning from\ncell spatial distribution alone can already achieve state-of-the-art (SOTA)\nperformance, i.e., CCFormer strongly outperforms other competing methods.", "paper_summary_zh": "在组织病理学全切片图像（WSI）中直接分析和建模细胞的空间分布在临床上至关重要，并且可能非常有益。然而，由于千兆像素图像的成本极高，大多数现有的 WSI 数据集缺乏细胞级别的注释。因此，深度学习模型能否从细胞分布的语义方面直接有效地分析 WSI 仍然是一个悬而未决的问题。在这项工作中，我们构建了一个包含超过 50 亿个细胞级注释的大规模 WSI 数据集，称为 WSI-Cell5B，以及一个新颖的分层细胞云 Transformer（CCFormer）来应对这些挑战。WSI-Cell5B 基于癌症基因组图谱计划的 11 种癌症的 6,998 个 WSI，并且所有 WSI 都按细胞坐标和类型进行注释。据我们所知，WSI-Cell5B 是第一个整合细胞级注释的 WSI 级大规模数据集。另一方面，CCFormer 将每个 WSI 中的细胞集合表述为细胞云，并对细胞空间分布进行建模。具体来说，提出了邻域信息嵌入（NIE）来表征每个细胞邻域内细胞的分布，并提出了一个新颖的分层空间感知（HSP）模块来以自下而上的方式学习细胞之间的空间关系。临床分析表明，WSI-Cell5B 可用于设计基于计数细胞的临床评估指标，该指标可有效评估患者的生存风险。在生存预测和癌症分期上的大量实验表明，仅从细胞空间分布中学习就已经可以达到最先进（SOTA）的性能，即 CCFormer 明显优于其他竞争方法。", "author": "Zijiang Yang et.al.", "authors": "Zijiang Yang, Zhongwei Qiu, Tiancheng Lin, Hanqing Chao, Wanxing Chang, Yelin Yang, Yunshuo Zhang, Wenpei Jiao, Yixuan Shen, Wenbin Liu, Dongmei Fu, Dakai Jin, Ke Yan, Le Lu, Hui Jiang, Yun Bian", "id": "2412.16715v1", "paper_url": "http://arxiv.org/abs/2412.16715v1", "repo": "null"}}