{"2412.09818": {"publish_time": "2024-12-13", "title": "MERaLiON-AudioLLM: Technical Report", "paper_summary": "We introduce MERaLiON-AudioLLM (Multimodal Empathetic Reasoning and Learning\nin One Network), the first speech-text model tailored for Singapore's\nmultilingual and multicultural landscape. Developed under the National Large\nLanguage Models Funding Initiative, Singapore, MERaLiON-AudioLLM integrates\nadvanced speech and text processing to address the diverse linguistic nuances\nof local accents and dialects, enhancing accessibility and usability in\ncomplex, multilingual environments. Our results demonstrate improvements in\nboth speech recognition and task-specific understanding, positioning\nMERaLiON-AudioLLM as a pioneering solution for region specific AI applications.\nWe envision this release to set a precedent for future models designed to\naddress localised linguistic and cultural contexts in a global framework.", "paper_summary_zh": "我們推出 MERaLiON-AudioLLM（多模態同理推理和學習於一體網路），這是第一個專為新加坡的多語言和多元文化環境量身打造的語音文本模型。在新加坡國家大型語言模型資助計畫下開發的 MERaLiON-AudioLLM 整合了進階的語音和文字處理，以應對當地口音和方言的多樣化語言差異，提升在複雜的多語言環境中的可及性和可用性。我們的結果證明了語音辨識和特定任務理解都有所進步，讓 MERaLiON-AudioLLM 成為區域特定 AI 應用的一項先驅解決方案。我們預見此版本將為未來模型樹立先例，這些模型旨在在全球架構中應對在地化的語言和文化背景。", "author": "Yingxu He et.al.", "authors": "Yingxu He, Zhuohan Liu, Shuo Sun, Bin Wang, Wenyu Zhang, Xunlong Zou, Nancy F. Chen, Ai Ti Aw", "id": "2412.09818v1", "paper_url": "http://arxiv.org/abs/2412.09818v1", "repo": "null"}}