{"2411.02649": {"publish_time": "2024-11-04", "title": "M-CELS: Counterfactual Explanation for Multivariate Time Series Data Guided by Learned Saliency Maps", "paper_summary": "Over the past decade, multivariate time series classification has received\ngreat attention. Machine learning (ML) models for multivariate time series\nclassification have made significant strides and achieved impressive success in\na wide range of applications and tasks. The challenge of many state-of-the-art\nML models is a lack of transparency and interpretability. In this work, we\nintroduce M-CELS, a counterfactual explanation model designed to enhance\ninterpretability in multidimensional time series classification tasks. Our\nexperimental validation involves comparing M-CELS with leading state-of-the-art\nbaselines, utilizing seven real-world time-series datasets from the UEA\nrepository. The results demonstrate the superior performance of M-CELS in terms\nof validity, proximity, and sparsity, reinforcing its effectiveness in\nproviding transparent insights into the decisions of machine learning models\napplied to multivariate time series data.", "paper_summary_zh": "在過去的十年中，多元時間序列分類受到了廣泛關注。用於多元時間序列分類的機器學習 (ML) 模型已取得重大進展，並在廣泛的應用和任務中取得了令人印象深刻的成功。許多最先進的 ML 模型的挑戰在於缺乏透明度和可解釋性。在這項工作中，我們引入了 M-CELS，這是一個反事實解釋模型，旨在增強多維時間序列分類任務的可解釋性。我們的實驗驗證涉及將 M-CELS 與領先的最先進基準進行比較，利用 UEA 儲存庫中的七個真實世界時間序列資料集。結果證明了 M-CELS 在有效性、接近度和稀疏性方面的優異性能，加強了其在提供對應用於多元時間序列資料的機器學習模型決策的透明見解方面的有效性。", "author": "Peiyu Li et.al.", "authors": "Peiyu Li, Omar Bahri, Soukaina Filali Boubrahimi, Shah Muhammad Hamdi", "id": "2411.02649v1", "paper_url": "http://arxiv.org/abs/2411.02649v1", "repo": "null"}}