{"2410.02558": {"publish_time": "2024-10-03", "title": "Improving Unsupervised Constituency Parsing via Maximizing Semantic Information", "paper_summary": "Unsupervised constituency parsers organize phrases within a sentence into a\ntree-shaped syntactic constituent structure that reflects the organization of\nsentence semantics. However, the traditional objective of maximizing sentence\nlog-likelihood (LL) does not explicitly account for the close relationship\nbetween the constituent structure and the semantics, resulting in a weak\ncorrelation between LL values and parsing accuracy. In this paper, we introduce\na novel objective for training unsupervised parsers: maximizing the information\nbetween constituent structures and sentence semantics (SemInfo). We introduce a\nbag-of-substrings model to represent the semantics and apply the\nprobability-weighted information metric to estimate the SemInfo. Additionally,\nwe develop a Tree Conditional Random Field (TreeCRF)-based model to apply the\nSemInfo maximization objective to Probabilistic Context-Free Grammar (PCFG)\ninduction, the state-of-the-art method for unsupervised constituency parsing.\nExperiments demonstrate that SemInfo correlates more strongly with parsing\naccuracy than LL. Our algorithm significantly enhances parsing accuracy by an\naverage of 7.85 points across five PCFG variants and in four languages,\nachieving new state-of-the-art results in three of the four languages.", "paper_summary_zh": "無監督成分句法剖析器將句子中的片語組織成一個樹形句法成分結構，反映出句子語義的組織。然而，最大化句子對數似然 (LL) 的傳統目標並未明確說明成分結構和語義之間的密切關係，導致 LL 值和剖析準確度之間的相關性較弱。在本文中，我們介紹了一個訓練無監督剖析器的目標：最大化成分結構和句子語義 (SemInfo) 之間的資訊。我們引入一個子字串袋模型來表示語義，並應用機率加權資訊指標來估計 SemInfo。此外，我們開發了一個基於樹條件隨機場 (TreeCRF) 的模型，將 SemInfo 最大化目標應用於機率無上下文文法 (PCFG) 歸納，這是無監督成分剖析的最新方法。實驗證明，SemInfo 與剖析準確度比 LL 的相關性更強。我們的演算法顯著提高了剖析準確度，在五個 PCFG 變體和四種語言中平均提高了 7.85 分，在四種語言中的三種語言中取得了新的最新結果。", "author": "Junjie Chen et.al.", "authors": "Junjie Chen, Xiangheng He, Yusuke Miyao, Danushka Bollegala", "id": "2410.02558v1", "paper_url": "http://arxiv.org/abs/2410.02558v1", "repo": "null"}}