{"2411.05383": {"publish_time": "2024-11-08", "title": "Towards Low-Resource Harmful Meme Detection with LMM Agents", "paper_summary": "The proliferation of Internet memes in the age of social media necessitates\neffective identification of harmful ones. Due to the dynamic nature of memes,\nexisting data-driven models may struggle in low-resource scenarios where only a\nfew labeled examples are available. In this paper, we propose an agency-driven\nframework for low-resource harmful meme detection, employing both outward and\ninward analysis with few-shot annotated samples. Inspired by the powerful\ncapacity of Large Multimodal Models (LMMs) on multimodal reasoning, we first\nretrieve relative memes with annotations to leverage label information as\nauxiliary signals for the LMM agent. Then, we elicit knowledge-revising\nbehavior within the LMM agent to derive well-generalized insights into meme\nharmfulness. By combining these strategies, our approach enables dialectical\nreasoning over intricate and implicit harm-indicative patterns. Extensive\nexperiments conducted on three meme datasets demonstrate that our proposed\napproach achieves superior performance than state-of-the-art methods on the\nlow-resource harmful meme detection task.", "paper_summary_zh": "隨著社群媒體時代網路迷因的激增，迫切需要有效辨識有害迷因。由於迷因的動態特性，現有的資料驅動模型可能難以應付僅有少數標籤範例可用的低資源場景。在本文中，我們提出一個以代理為基礎的低資源有害迷因偵測架構，採用外向和內向分析，並搭配少數註解範例。受惠於大型多模態模型 (LMM) 在多模態推理上的強大能力，我們首先擷取帶有註解的相關迷因，以利用標籤資訊作為 LMM 代理的輔助訊號。接著，我們在 LMM 代理內引發知識修正行為，以推導出對迷因危害性的良好概化見解。透過結合這些策略，我們的做法能夠對複雜且隱含的危害指示模式進行辯證推理。在三個迷因資料集上進行的廣泛實驗證明，我們提出的方法在低資源有害迷因偵測任務上，表現優於現有技術。", "author": "Jianzhao Huang et.al.", "authors": "Jianzhao Huang, Hongzhan Lin, Ziyan Liu, Ziyang Luo, Guang Chen, Jing Ma", "id": "2411.05383v1", "paper_url": "http://arxiv.org/abs/2411.05383v1", "repo": "https://github.com/jianzhao-huang/lorehm"}}