{"2501.17665": {"publish_time": "2025-01-29", "title": "Planning with Vision-Language Models and a Use Case in Robot-Assisted Teaching", "paper_summary": "Automating the generation of Planning Domain Definition Language (PDDL) with\nLarge Language Model (LLM) opens new research topic in AI planning,\nparticularly for complex real-world tasks. This paper introduces Image2PDDL, a\nnovel framework that leverages Vision-Language Models (VLMs) to automatically\nconvert images of initial states and descriptions of goal states into PDDL\nproblems. By providing a PDDL domain alongside visual inputs, Imasge2PDDL\naddresses key challenges in bridging perceptual understanding with symbolic\nplanning, reducing the expertise required to create structured problem\ninstances, and improving scalability across tasks of varying complexity. We\nevaluate the framework on various domains, including standard planning domains\nlike blocksworld and sliding tile puzzles, using datasets with multiple\ndifficulty levels. Performance is assessed on syntax correctness, ensuring\ngrammar and executability, and content correctness, verifying accurate state\nrepresentation in generated PDDL problems. The proposed approach demonstrates\npromising results across diverse task complexities, suggesting its potential\nfor broader applications in AI planning. We will discuss a potential use case\nin robot-assisted teaching of students with Autism Spectrum Disorder.", "paper_summary_zh": "利用大型語言模型 (LLM) 自動化規劃領域定義語言 (PDDL) 的生成，為 AI 規劃開啟了新的研究主題，特別是對於複雜的真實世界任務。本文介紹 Image2PDDL，這是一個新穎的框架，它利用視覺語言模型 (VLM) 將初始狀態的影像和目標狀態的描述自動轉換為 PDDL 問題。透過提供 PDDL 領域和視覺輸入，Imasge2PDDL 應對了將感知理解與符號規劃結合起來的主要挑戰，減少了建立結構化問題實例所需的專業知識，並提高了跨越不同複雜性任務的可擴充性。我們在各種領域對該框架進行評估，包括標準規劃領域，例如積木世界和滑動拼圖，使用具有多個難度等級的資料集。效能評估包括語法正確性，確保語法和可執行性，以及內容正確性，驗證生成的 PDDL 問題中的準確狀態表示。所提出的方法在不同的任務複雜性中展示了有希望的結果，表明其在 AI 規劃中具有更廣泛的應用潛力。我們將討論自閉症譜系障礙學生的機器人輔助教學中的潛在用例。", "author": "Xuzhe Dang et.al.", "authors": "Xuzhe Dang, Lada Kudláčková, Stefan Edelkamp", "id": "2501.17665v1", "paper_url": "http://arxiv.org/abs/2501.17665v1", "repo": "null"}}