{"2405.10529": {"publish_time": "2024-05-17", "title": "Safeguarding Vision-Language Models Against Patched Visual Prompt Injectors", "paper_summary": "Large language models have become increasingly prominent, also signaling a\nshift towards multimodality as the next frontier in artificial intelligence,\nwhere their embeddings are harnessed as prompts to generate textual content.\nVision-language models (VLMs) stand at the forefront of this advancement,\noffering innovative ways to combine visual and textual data for enhanced\nunderstanding and interaction. However, this integration also enlarges the\nattack surface. Patch-based adversarial attack is considered the most realistic\nthreat model in physical vision applications, as demonstrated in many existing\nliterature. In this paper, we propose to address patched visual prompt\ninjection, where adversaries exploit adversarial patches to generate target\ncontent in VLMs. Our investigation reveals that patched adversarial prompts\nexhibit sensitivity to pixel-wise randomization, a trait that remains robust\neven against adaptive attacks designed to counteract such defenses. Leveraging\nthis insight, we introduce SmoothVLM, a defense mechanism rooted in smoothing\ntechniques, specifically tailored to protect VLMs from the threat of patched\nvisual prompt injectors. Our framework significantly lowers the attack success\nrate to a range between 0% and 5.0% on two leading VLMs, while achieving around\n67.3% to 95.0% context recovery of the benign images, demonstrating a balance\nbetween security and usability.", "paper_summary_zh": "大型語言模型變得越來越重要，也標誌著人工智慧的下一前沿將轉向多模態，其中其嵌入被利用為提示來產生文字內容。視覺語言模型 (VLM) 站在這項進展的最前線，提供創新的方式來結合視覺和文字資料，以增強理解和互動。然而，這種整合也擴大了攻擊面。基於貼片的對抗性攻擊被認為是物理視覺應用中最逼真的威脅模型，如許多現有文獻中所展示的那樣。在本文中，我們提議解決貼片視覺提示注入的問題，其中對手利用對抗性貼片在 VLM 中產生目標內容。我們的調查顯示，貼片的對抗性提示對逐像素隨機化表現出敏感性，即使針對旨在對抗此類防禦的適應性攻擊，這種特徵仍然很強大。利用這一見解，我們引入了 SmoothVLM，這是一種根植於平滑技術的防禦機制，專門用於保護 VLM 免受貼片視覺提示注入器的威脅。我們的框架將攻擊成功率顯著降低到兩個領先的 VLM 上的 0% 到 5.0% 之間，同時實現了良性圖像的 67.3% 到 95.0% 的內容恢復，展示了安全性與可用性之間的平衡。", "author": "Jiachen Sun et.al.", "authors": "Jiachen Sun, Changsheng Wang, Jiongxiao Wang, Yiwei Zhang, Chaowei Xiao", "id": "2405.10529v1", "paper_url": "http://arxiv.org/abs/2405.10529v1", "repo": "null"}}