{"2503.10094": {"publish_time": "2025-03-13", "title": "Semantic Synergy: Unlocking Policy Insights and Learning Pathways Through Advanced Skill Mapping", "paper_summary": "This research introduces a comprehensive system based on state-of-the-art\nnatural language processing, semantic embedding, and efficient search\ntechniques for retrieving similarities and thus generating actionable insights\nfrom raw textual information. The system automatically extracts and aggregates\nnormalized competencies from multiple documents (such as policy files and\ncurricula vitae) and creates strong relationships between recognized\ncompetencies, occupation profiles, and related learning courses. To validate\nits performance, we conducted a multi-tier evaluation that included both\nexplicit and implicit skill references in synthetic and real-world documents.\nThe results showed near-human-level accuracy, with F1 scores exceeding 0.95 for\nexplicit skill detection and above 0.93 for implicit mentions. The system\nthereby establishes a sound foundation for supporting in-depth collaboration\nacross the AE4RIA network. The methodology involves a multi-stage pipeline\nbased on extensive preprocessing and data cleaning, semantic embedding and\nsegmentation via SentenceTransformer, and skill extraction using a FAISS-based\nsearch method. The extracted skills are associated with occupation frameworks\n(as formulated in the ESCO ontology) and with learning paths offered through\nthe Sustainable Development Goals Academy. Moreover, interactive visualization\nsoftware, implemented with Dash and Plotly, presents graphs and tables for\nreal-time exploration and informed decision-making by those involved in\npolicymaking, training and learning supply, career transitions, and\nrecruitment. Overall, this system, backed by rigorous validation, offers\npromising prospects for improved policymaking, human resource development, and\nlifelong learning by providing structured and actionable insights from raw,\ncomplex textual information.", "paper_summary_zh": "這項研究引入了一個基於最先進自然語言處理、語義嵌入和高效搜尋技術的綜合系統，用於檢索相似性，並從原始文本資訊中產生可操作的見解。該系統自動從多個文件（例如政策檔案和履歷）中提取和彙總標準化的能力，並在識別出的能力、職業概況和相關學習課程之間建立強連結。為了驗證其效能，我們進行了多層次評估，包括對合成和真實世界文件中明確和隱含技能的引用。結果顯示其準確性接近人類水準，明確技能檢測的 F1 分數超過 0.95，隱含提及的 F1 分數超過 0.93。該系統因此為支援 AE4RIA 網路中的深度合作奠定了堅實的基礎。該方法涉及一個基於廣泛預處理和資料清理、通過 SentenceTransformer 進行語義嵌入和分段，以及使用基於 FAISS 的搜尋方法進行技能提取的多階段流程。提取的技能與職業框架（如 ESCO 本體論中所述）和永續發展目標學院提供的學習途徑相關聯。此外，使用 Dash 和 Plotly 實現的互動式視覺化軟體，提供圖表和表格，供參與政策制定、培訓和學習供應、職業轉換和招聘的人員進行即時探索和做出明智的決策。總體而言，這個經過嚴格驗證的系統，通過從原始、複雜的文本資訊中提供結構化和可操作的見解，為改進政策制定、人力資源開發和終身學習提供了有希望的前景。\n", "author": "Phoebe Koundouri et.al.", "authors": "Phoebe Koundouri, Conrad Landis, Georgios Feretzakis", "id": "2503.10094v1", "paper_url": "http://arxiv.org/abs/2503.10094v1", "repo": "null"}}