{"2501.05222": {"publish_time": "2025-01-09", "title": "ParaRev: Building a dataset for Scientific Paragraph Revision annotated with revision instruction", "paper_summary": "Revision is a crucial step in scientific writing, where authors refine their\nwork to improve clarity, structure, and academic quality. Existing approaches\nto automated writing assistance often focus on sentence-level revisions, which\nfail to capture the broader context needed for effective modification. In this\npaper, we explore the impact of shifting from sentence-level to paragraph-level\nscope for the task of scientific text revision. The paragraph level definition\nof the task allows for more meaningful changes, and is guided by detailed\nrevision instructions rather than general ones. To support this task, we\nintroduce ParaRev, the first dataset of revised scientific paragraphs with an\nevaluation subset manually annotated with revision instructions. Our\nexperiments demonstrate that using detailed instructions significantly improves\nthe quality of automated revisions compared to general approaches, no matter\nthe model or the metric considered.", "paper_summary_zh": "修改是科学寫作中至關重要的一步，作者在其中完善其作品，以提高清晰度、結構和學術品質。現有的自動寫作輔助方法通常側重於句子層級的修改，這無法掌握有效修改所需的更廣泛脈絡。在本文中，我們探討了從句子層級轉移到段落層級範圍對科學文本修改任務的影響。任務的段落層級定義允許進行更有意義的修改，並以詳細的修改說明為指導，而不是一般的說明。為了支持此任務，我們引入了 ParaRev，這是第一個經過人工標記修改說明的評估子集的已修改科學段落資料集。我們的實驗表明，與一般方法相比，使用詳細說明顯著提高了自動修改的品質，無論考慮哪種模型或指標。", "author": "Léane Jourdan et.al.", "authors": "Léane Jourdan, Nicolas Hernandez, Richard Dufour, Florian Boudin, Akiko Aizawa", "id": "2501.05222v1", "paper_url": "http://arxiv.org/abs/2501.05222v1", "repo": "null"}}