{"2410.23099": {"publish_time": "2024-10-30", "title": "Comparative Analysis of Demonstration Selection Algorithms for LLM In-Context Learning", "paper_summary": "In-context learning can help Large Language Models (LLMs) to adapt new tasks\nwithout additional training. However, this performance heavily depends on the\nquality of the demonstrations, driving research into effective demonstration\nselection algorithms to optimize this process. These algorithms assist users in\nselecting the best $k$ input-label pairs (demonstration examples) based on a\ngiven test input, enabling LLMs to in-context learn the relationship between\nthe provided examples and the test inputs. Despite all the proposed\ndemonstration selection algorithms, their efficiency and effectiveness remain\nunclear. This lack of clarity make it difficult to apply these algorithms in\nreal-world scenarios and poses challenges for future research aimed at\ndeveloping improved methods. This paper revisits six proposed algorithms,\nevaluating them on five datasets from both efficiency and effectiveness\nperspectives. Our experiments reveal significant variations in algorithm\nperformance across different tasks, with some methods struggling to outperform\nrandom selection in certain scenarios. We also find that increasing the number\nof demonstrations does not always lead to better performance, and that there\nare often trade-offs between accuracy and computational efficiency. Our code is\navailable at https://github.com/Tizzzzy/Demonstration_Selection_Overview.", "paper_summary_zh": "情境學習可以幫助大型語言模型 (LLM) 適應新任務，而無需額外訓練。然而，此效能極度仰賴示範品質，驅使研究人員投入有效示範選擇演算法的研究，以最佳化此程序。這些演算法協助使用者根據特定測試輸入，從最佳的 $k$ 個輸入標籤配對（示範範例）中進行選擇，讓 LLM 能夠在情境中學習提供的範例與測試輸入之間的關係。儘管提出了所有可能的示範選擇演算法，但其效率和效能仍不明朗。這種不確定性使得在真實世界情境中應用這些演算法變得困難，並對旨在開發改良方法的未來研究構成挑戰。本文回顧了六種提出的演算法，從效率和效能兩個角度，在五個資料集上對它們進行評估。我們的實驗揭示了演算法效能因任務而異的顯著差異，有些方法在某些情境下難以勝過隨機選擇。我們也發現，增加示範數量並非總是會帶來更好的效能，而且準確性和運算效率之間通常存在權衡取捨。我們的程式碼可於 https://github.com/Tizzzzy/Demonstration_Selection_Overview 取得。", "author": "Dong Shu et.al.", "authors": "Dong Shu, Mengnan Du", "id": "2410.23099v1", "paper_url": "http://arxiv.org/abs/2410.23099v1", "repo": "https://github.com/tizzzzy/demonstration_selection_overview"}}