{"2501.07054": {"publish_time": "2025-01-13", "title": "PoAct: Policy and Action Dual-Control Agent for Generalized Applications", "paper_summary": "Based on their superior comprehension and reasoning capabilities, Large\nLanguage Model (LLM) driven agent frameworks have achieved significant success\nin numerous complex reasoning tasks. ReAct-like agents can solve various\nintricate problems step-by-step through progressive planning and tool calls,\niteratively optimizing new steps based on environmental feedback. However, as\nthe planning capabilities of LLMs improve, the actions invoked by tool calls in\nReAct-like frameworks often misalign with complex planning and challenging data\norganization. Code Action addresses these issues while also introducing the\nchallenges of a more complex action space and more difficult action\norganization. To leverage Code Action and tackle the challenges of its\ncomplexity, this paper proposes Policy and Action Dual-Control Agent (PoAct)\nfor generalized applications. The aim is to achieve higher-quality code actions\nand more accurate reasoning paths by dynamically switching reasoning policies\nand modifying the action space. Experimental results on the Agent Benchmark for\nboth legal and generic scenarios demonstrate the superior reasoning\ncapabilities and reduced token consumption of our approach in complex tasks. On\nthe LegalAgentBench, our method shows a 20 percent improvement over the\nbaseline while requiring fewer tokens. We conducted experiments and analyses on\nthe GPT-4o and GLM-4 series models, demonstrating the significant potential and\nscalability of our approach to solve complex problems.", "paper_summary_zh": "基於其卓越的理解和推理能力，大型語言模型 (LLM) 驅動的代理架構在許多複雜的推理任務中取得顯著的成功。類似 ReAct 的代理可以透過漸進式規劃和工具呼叫逐步解決各種複雜的問題，並根據環境回饋反覆最佳化新的步驟。然而，隨著 LLM 的規劃能力提升，類似 ReAct 架構中工具呼叫所引發的動作通常與複雜的規劃和具有挑戰性的資料組織不一致。Code Action 處理這些問題，同時也引入了更複雜的動作空間和更困難的動作組織的挑戰。為了善用 Code Action 並應對其複雜性的挑戰，本文提出政策和動作雙重控制代理 (PoAct)，用於廣泛的應用。目的是透過動態切換推理政策和修改動作空間來達成更高品質的程式碼動作和更準確的推理路徑。在法律和一般情境中，針對代理基準的實驗結果證明了我們的方法在複雜任務中卓越的推理能力和降低的代碼消耗。在 LegalAgentBench 上，我們的模型比基準線進步 20%，同時需要較少的代碼。我們對 GPT-4o 和 GLM-4 系列模型進行了實驗和分析，證明了我們的方法在解決複雜問題上具有的顯著潛力和可擴充性。", "author": "Guozhi Yuan et.al.", "authors": "Guozhi Yuan, Youfeng Liu, Jingli Yang, Wei Jia, Kai Lin, Yansong Gao, Shan He, Zilin Ding, Haitao Li", "id": "2501.07054v1", "paper_url": "http://arxiv.org/abs/2501.07054v1", "repo": "null"}}