{"2501.11873": {"publish_time": "2025-01-21", "title": "Demons in the Detail: On Implementing Load Balancing Loss for Training Specialized Mixture-of-Expert Models", "paper_summary": "This paper revisits the implementation of\n$\\textbf{L}$oad-$\\textbf{b}$alancing $\\textbf{L}$oss (LBL) when training\nMixture-of-Experts (MoEs) models. Specifically, LBL for MoEs is defined as $N_E\n\\sum_{i=1}^{N_E} f_i p_i$, where $N_E$ is the total number of experts, $f_i$\nrepresents the frequency of expert $i$ being selected, and $p_i$ denotes the\naverage gating score of the expert $i$. Existing MoE training frameworks\nusually employ the parallel training strategy so that $f_i$ and the LBL are\ncalculated within a $\\textbf{micro-batch}$ and then averaged across parallel\ngroups. In essence, a micro-batch for training billion-scale LLMs normally\ncontains very few sequences. So, the micro-batch LBL is almost at the sequence\nlevel, and the router is pushed to distribute the token evenly within each\nsequence. Under this strict constraint, even tokens from a domain-specific\nsequence ($\\textit{e.g.}$, code) are uniformly routed to all experts, thereby\ninhibiting expert specialization. In this work, we propose calculating LBL\nusing a $\\textbf{global-batch}$ to loose this constraint. Because a\nglobal-batch contains much more diverse sequences than a micro-batch, which\nwill encourage load balance at the corpus level. Specifically, we introduce an\nextra communication step to synchronize $f_i$ across micro-batches and then use\nit to calculate the LBL. Through experiments on training MoEs-based LLMs (up to\n$\\textbf{42.8B}$ total parameters and $\\textbf{400B}$ tokens), we surprisingly\nfind that the global-batch LBL strategy yields excellent performance gains in\nboth pre-training perplexity and downstream tasks. Our analysis reveals that\nthe global-batch LBL also greatly improves the domain specialization of MoE\nexperts.", "paper_summary_zh": "<paragraph>本文重新探討了在訓練 Mixture-of-Experts (MoEs) 模型時，$\\textbf{L}$oad-$\\textbf{b}$alancing $\\textbf{L}$oss (LBL) 的實作。具體來說，MoEs 的 LBL 被定義為 $N_E \\sum_{i=1}^{N_E} f_i p_i$，其中 $N_E$ 是專家的總數，$f_i$ 表示選擇專家 $i$ 的頻率，而 $p_i$ 表示專家 $i$ 的平均閘控分數。現有的 MoE 訓練架構通常採用並行訓練策略，以便在 $\\textbf{微批次}$ 中計算 $f_i$ 和 LBL，然後在並行群組中取平均值。實質上，訓練十億規模 LLM 的微批次通常只包含很少的序列。因此，微批次 LBL 幾乎處於序列層級，而路由器被迫在每個序列中均勻分配令牌。在這個嚴格的約束下，即使來自特定領域序列（$\\textit{e.g.}$，程式碼）的令牌也會均勻路由到所有專家，從而抑制專家專業化。在這項工作中，我們提出使用 $\\textbf{全域批次}$ 計算 LBL 以解除這個約束。由於全域批次包含比微批次更多樣化的序列，這將促進語料層級的負載平衡。具體來說，我們引入一個額外的通訊步驟，以在微批次之間同步 $f_i$，然後使用它來計算 LBL。透過對基於 MoE 的 LLM（總參數量高達 $\\textbf{42.8B}$，令牌達 $\\textbf{400B}$）的訓練進行實驗，我們驚訝地發現，全域批次 LBL 策略在預訓練困惑度和下游任務中都產生了極佳的效能提升。我們的分析表明，全域批次 LBL 也大幅提升了 MoE 專家的領域專業化。</paragraph>", "author": "Zihan Qiu et.al.", "authors": "Zihan Qiu, Zeyu Huang, Bo Zheng, Kaiyue Wen, Zekun Wang, Rui Men, Ivan Titov, Dayiheng Liu, Jingren Zhou, Junyang Lin", "id": "2501.11873v1", "paper_url": "http://arxiv.org/abs/2501.11873v1", "repo": "null"}}