{"2411.07533": {"publish_time": "2024-11-12", "title": "Large Language Models as Neurolinguistic Subjects: Identifying Internal Representations for Form and Meaning", "paper_summary": "This study investigates the linguistic understanding of Large Language Models\n(LLMs) regarding signifier (form) and signified (meaning) by distinguishing two\nLLM evaluation paradigms: psycholinguistic and neurolinguistic. Traditional\npsycholinguistic evaluations often reflect statistical biases that may\nmisrepresent LLMs' true linguistic capabilities. We introduce a neurolinguistic\napproach, utilizing a novel method that combines minimal pair and diagnostic\nprobing to analyze activation patterns across model layers. This method allows\nfor a detailed examination of how LLMs represent form and meaning, and whether\nthese representations are consistent across languages. Our contributions are\nthree-fold: (1) We compare neurolinguistic and psycholinguistic methods,\nrevealing distinct patterns in LLM assessment; (2) We demonstrate that LLMs\nexhibit higher competence in form compared to meaning, with the latter largely\ncorrelated to the former; (3) We present new conceptual minimal pair datasets\nfor Chinese (COMPS-ZH) and German (COMPS-DE), complementing existing English\ndatasets.", "paper_summary_zh": "本研究透過區分心理語言學和神經語言學這兩種大型語言模型 (LLM) 評估範例，來探討大型語言模型在符號 (形式) 和所指 (意義) 上的語言理解。傳統的心理語言學評估通常反映出統計偏差，這可能會誤導 LLM 的真實語言能力。我們引入一種神經語言學方法，利用一種新穎的方法，結合最小對和診斷探測來分析模型層之間的激活模式。此方法可以詳細檢視 LLM 如何表示形式和意義，以及這些表示是否在不同語言中保持一致。我們的貢獻有三個方面：(1) 我們比較神經語言學和心理語言學方法，揭示 LLM 評估中的不同模式；(2) 我們證明 LLM 在形式上表現出比意義更高的能力，後者在很大程度上與前者相關；(3) 我們為中文 (COMPS-ZH) 和德文 (COMPS-DE) 提出新的概念最小對資料集，以補充現有的英文資料集。", "author": "Linyang He et.al.", "authors": "Linyang He, Ercong Nie, Helmut Schmid, Hinrich Schütze, Nima Mesgarani, Jonathan Brennan", "id": "2411.07533v1", "paper_url": "http://arxiv.org/abs/2411.07533v1", "repo": "null"}}