{"2411.03486": {"publish_time": "2024-11-05", "title": "LLM Generated Distribution-Based Prediction of US Electoral Results, Part I", "paper_summary": "This paper introduces distribution-based prediction, a novel approach to\nusing Large Language Models (LLMs) as predictive tools by interpreting output\ntoken probabilities as distributions representing the models' learned\nrepresentation of the world. This distribution-based nature offers an\nalternative perspective for analyzing algorithmic fidelity, complementing the\napproach used in silicon sampling. We demonstrate the use of distribution-based\nprediction in the context of recent United States presidential election,\nshowing that this method can be used to determine task specific bias, prompt\nnoise, and algorithmic fidelity. This approach has significant implications for\nassessing the reliability and increasing transparency of LLM-based predictions\nacross various domains.", "paper_summary_zh": "本文介紹基於分佈的預測，這是一種新穎的方法，可透過將輸出代幣機率解釋為代表模型學習世界表徵的分佈，將大型語言模型 (LLM) 用作預測工具。這種基於分佈的性質提供了一個分析演算法保真度的替代觀點，補充了在矽晶片抽樣中使用的方法。我們展示了在最近美國總統選舉的背景下使用基於分佈的預測，表明此方法可用於確定特定任務的偏差、提示雜訊和演算法保真度。此方法對評估 LLM 基於預測的可靠性以及提高其在各個領域的透明度具有重要意義。", "author": "Caleb Bradshaw et.al.", "authors": "Caleb Bradshaw, Caelen Miller, Sean Warnick", "id": "2411.03486v1", "paper_url": "http://arxiv.org/abs/2411.03486v1", "repo": "null"}}