{"2412.13175": {"publish_time": "2024-12-17", "title": "DnDScore: Decontextualization and Decomposition for Factuality Verification in Long-Form Text Generation", "paper_summary": "The decompose-then-verify strategy for verification of Large Language Model\n(LLM) generations decomposes claims that are then independently verified.\nDecontextualization augments text (claims) to ensure it can be verified outside\nof the original context, enabling reliable verification. While decomposition\nand decontextualization have been explored independently, their interactions in\na complete system have not been investigated. Their conflicting purposes can\ncreate tensions: decomposition isolates atomic facts while decontextualization\ninserts relevant information. Furthermore, a decontextualized subclaim presents\na challenge to the verification step: what part of the augmented text should be\nverified as it now contains multiple atomic facts? We conduct an evaluation of\ndifferent decomposition, decontextualization, and verification strategies and\nfind that the choice of strategy matters in the resulting factuality scores.\nAdditionally, we introduce DnDScore, a decontextualization aware verification\nmethod which validates subclaims in the context of contextual information.", "paper_summary_zh": "大型語言模型 (LLM) 生成驗證的分解後驗證策略分解聲明，然後獨立驗證這些聲明。\n去脈絡化擴充文字（聲明）以確保可以在原始脈絡之外驗證，從而實現可靠的驗證。\n儘管分解和去脈絡化已經獨立探索，但它們在一個完整系統中的交互作用尚未得到研究。\n它們相互衝突的目的可能會造成緊張：分解孤立原子事實，而去脈絡化插入相關資訊。\n此外，去脈絡化的子聲明對驗證步驟提出了挑戰：應驗證擴充文字的哪一部分，因為它現在包含多個原子事實？\n我們對不同的分解、去脈絡化和驗證策略進行評估，並發現策略的選擇會影響產生的真實性分數。\n此外，我們引入了 DnDScore，這是一種去脈絡化感知驗證方法，它在脈絡資訊的背景下驗證子聲明。", "author": "Miriam Wanner et.al.", "authors": "Miriam Wanner, Benjamin Van Durme, Mark Dredze", "id": "2412.13175v1", "paper_url": "http://arxiv.org/abs/2412.13175v1", "repo": "null"}}