{"2408.07910": {"publish_time": "2024-08-15", "title": "DM2RM: Dual-Mode Multimodal Ranking for Target Objects and Receptacles Based on Open-Vocabulary Instructions", "paper_summary": "In this study, we aim to develop a domestic service robot (DSR) that, guided\nby open-vocabulary instructions, can carry everyday objects to the specified\npieces of furniture. Few existing methods handle mobile manipulation tasks with\nopen-vocabulary instructions in the image retrieval setting, and most do not\nidentify both the target objects and the receptacles. We propose the Dual-Mode\nMultimodal Ranking model (DM2RM), which enables images of both the target\nobjects and receptacles to be retrieved using a single model based on\nmultimodal foundation models. We introduce a switching mechanism that leverages\na mode token and phrase identification via a large language model to switch the\nembedding space based on the prediction target. To evaluate the DM2RM, we\nconstruct a novel dataset including real-world images collected from hundreds\nof building-scale environments and crowd-sourced instructions with referring\nexpressions. The evaluation results show that the proposed DM2RM outperforms\nprevious approaches in terms of standard metrics in image retrieval settings.\nFurthermore, we demonstrate the application of the DM2RM on a standardized\nreal-world DSR platform including fetch-and-carry actions, where it achieves a\ntask success rate of 82% despite the zero-shot transfer setting. Demonstration\nvideos, code, and more materials are available at\nhttps://kkrr10.github.io/dm2rm/.", "paper_summary_zh": "在這項研究中，我們旨在開發一種家用服務機器人 (DSR)，它在開放式詞彙指令的引導下，可以將日常物品搬運到指定的家具上。現有方法很少在影像擷取設定中處理帶有開放式詞彙指令的行動操作任務，而且大多數方法無法識別目標物件和容器。我們提出雙模式多模態排序模型 (DM2RM)，它能使用基於多模態基礎模型的單一模型來擷取目標物件和容器的影像。我們導入一個切換機制，它利用模式代碼和透過大型語言模型進行的詞組識別，根據預測目標切換嵌入空間。為了評估 DM2RM，我們建構了一個新穎的資料集，其中包括從數百個建築規模環境中收集的真實世界影像，以及帶有參照表達式的群眾外包指令。評估結果顯示，所提出的 DM2RM 在影像擷取設定中的標準指標方面優於先前的做法。此外，我們展示了 DM2RM 在標準化真實世界 DSR 平臺上的應用，包括取放動作，儘管是零次學習轉移設定，它仍達到了 82% 的任務成功率。展示影片、程式碼和更多資料可以在 https://kkrr10.github.io/dm2rm/ 找到。", "author": "Ryosuke Korekata et.al.", "authors": "Ryosuke Korekata, Kanta Kaneda, Shunya Nagashima, Yuto Imai, Komei Sugiura", "id": "2408.07910v1", "paper_url": "http://arxiv.org/abs/2408.07910v1", "repo": "null"}}