{"2502.14740": {"publish_time": "2025-02-20", "title": "YOLOv12: A Breakdown of the Key Architectural Features", "paper_summary": "This paper presents an architectural analysis of YOLOv12, a significant\nadvancement in single-stage, real-time object detection building upon the\nstrengths of its predecessors while introducing key improvements. The model\nincorporates an optimised backbone (R-ELAN), 7x7 separable convolutions, and\nFlashAttention-driven area-based attention, improving feature extraction,\nenhanced efficiency, and robust detections. With multiple model variants,\nsimilar to its predecessors, YOLOv12 offers scalable solutions for both\nlatency-sensitive and high-accuracy applications. Experimental results manifest\nconsistent gains in mean average precision (mAP) and inference speed, making\nYOLOv12 a compelling choice for applications in autonomous systems, security,\nand real-time analytics. By achieving an optimal balance between computational\nefficiency and performance, YOLOv12 sets a new benchmark for real-time computer\nvision, facilitating deployment across diverse hardware platforms, from edge\ndevices to high-performance clusters.", "paper_summary_zh": "本文提出 YOLOv12 的架構分析，這是在單階段即時物件偵測領域的重大進展，它建立在前任的優勢之上，同時引入了關鍵改進。該模型結合了最佳化的主幹 (R-ELAN)、7x7 可分離卷積和 FlashAttention 驅動的基於區域的注意力，改進了特徵提取、增強了效率和穩健的偵測。與其前身類似，YOLOv12 具有多種模型變體，為低延遲敏感型和高準確度應用程式提供了可擴充的解決方案。實驗結果顯示在平均準確度 (mAP) 和推論速度方面都有顯著的提升，這使得 YOLOv12 成為自動化系統、安全性和即時分析應用程式的理想選擇。透過在運算效率和效能之間取得最佳平衡，YOLOv12 為即時電腦視覺樹立了新的基準，促進了在各種硬體平台（從邊緣裝置到高性能叢集）上的部署。", "author": "Mujadded Al Rabbani Alif et.al.", "authors": "Mujadded Al Rabbani Alif, Muhammad Hussain", "id": "2502.14740v1", "paper_url": "http://arxiv.org/abs/2502.14740v1", "repo": "null"}}