{"2407.12753": {"publish_time": "2024-07-17", "title": "LookupViT: Compressing visual information to a limited number of tokens", "paper_summary": "Vision Transformers (ViT) have emerged as the de-facto choice for numerous\nindustry grade vision solutions. But their inference cost can be prohibitive\nfor many settings, as they compute self-attention in each layer which suffers\nfrom quadratic computational complexity in the number of tokens. On the other\nhand, spatial information in images and spatio-temporal information in videos\nis usually sparse and redundant. In this work, we introduce LookupViT, that\naims to exploit this information sparsity to reduce ViT inference cost.\nLookupViT provides a novel general purpose vision transformer block that\noperates by compressing information from higher resolution tokens to a fixed\nnumber of tokens. These few compressed tokens undergo meticulous processing,\nwhile the higher-resolution tokens are passed through computationally cheaper\nlayers. Information sharing between these two token sets is enabled through a\nbidirectional cross-attention mechanism. The approach offers multiple\nadvantages - (a) easy to implement on standard ML accelerators (GPUs/TPUs) via\nstandard high-level operators, (b) applicable to standard ViT and its variants,\nthus generalizes to various tasks, (c) can handle different tokenization and\nattention approaches. LookupViT also offers flexibility for the compressed\ntokens, enabling performance-computation trade-offs in a single trained model.\nWe show LookupViT's effectiveness on multiple domains - (a) for\nimage-classification (ImageNet-1K and ImageNet-21K), (b) video classification\n(Kinetics400 and Something-Something V2), (c) image captioning (COCO-Captions)\nwith a frozen encoder. LookupViT provides $2\\times$ reduction in FLOPs while\nupholding or improving accuracy across these domains. In addition, LookupViT\nalso demonstrates out-of-the-box robustness and generalization on image\nclassification (ImageNet-C,R,A,O), improving by up to $4\\%$ over ViT.", "paper_summary_zh": "視覺轉換器 (ViT) 已成為眾多產業級視覺解決方案的事實標準選擇。但其推理成本對於許多設定而言可能是過高的，因為它們會在每一層中計算自注意力，而自注意力會因為代幣數量而產生二次運算複雜度。另一方面，影像中的空間資訊和影片中的時空資訊通常是稀疏且冗餘的。在這項工作中，我們引入了 LookupViT，其目標是利用此資訊稀疏性來降低 ViT 推理成本。LookupViT 提供了一個新穎的通用視覺轉換器區塊，其運作方式是將來自較高解析度代幣的資訊壓縮成固定數量的代幣。這些少數壓縮的代幣會經過仔細處理，而較高解析度的代幣則會通過計算成本較低的層。這些兩個代幣集合之間的資訊共享是透過雙向交叉注意力機制啟用的。此方法提供了多項優點：(a) 透過標準高階運算子在標準 ML 加速器 (GPU/TPU) 上易於實作，(b) 適用於標準 ViT 及其變體，因此能概括到各種任務，(c) 可以處理不同的代幣化和注意力方法。LookupViT 也為壓縮的代幣提供了靈活性，讓效能與運算在單一訓練模型中進行權衡。我們在多個領域展示了 LookupViT 的效能：(a) 影像分類 (ImageNet-1K 和 ImageNet-21K)，(b) 影片分類 (Kinetics400 和 Something-Something V2)，(c) 影像標題 (COCO-Captions) 使用凍結編碼器。LookupViT 提供了 FLOP 減少 2 倍，同時維持或提升這些領域的準確度。此外，LookupViT 也在影像分類 (ImageNet-C,R,A,O) 上展示了開箱即用的穩健性和概括性，比 ViT 提升了 4%。", "author": "Rajat Koner et.al.", "authors": "Rajat Koner, Gagan Jain, Prateek Jain, Volker Tresp, Sujoy Paul", "id": "2407.12753v1", "paper_url": "http://arxiv.org/abs/2407.12753v1", "repo": "null"}}