{"2408.14649": {"publish_time": "2024-08-26", "title": "Emergent Language in Open-Ended Environments", "paper_summary": "Emergent language research has made significant progress in recent years, but\nstill largely fails to explore how communication emerges in more complex and\nsituated multi-agent systems. Existing setups often employ a reference game,\nwhich limits the range of language emergence phenomena that can be studied, as\nthe game consists of a single, purely language-based interaction between the\nagents. In this paper, we address these limitations and explore the emergence\nand utility of token-based communication in open-ended multi-agent\nenvironments, where situated agents interact with the environment through\nmovement and communication over multiple time-steps. Specifically, we introduce\ntwo novel cooperative environments: Multi-Agent Pong and Collectors. These\nenvironments are interesting because optimal performance requires the emergence\nof a communication protocol, but moderate success can be achieved without one.\nBy employing various methods from explainable AI research, such as saliency\nmaps, perturbation, and diagnostic classifiers, we are able to track and\ninterpret the agents' language channel use over time. We find that the emerging\ncommunication is sparse, with the agents only generating meaningful messages\nand acting upon incoming messages in states where they cannot succeed without\ncoordination.", "paper_summary_zh": "近年來，新興的語言研究取得了重大進展，但\n在探索更複雜且情境化的多代理系統中，溝通是如何出現的方面，仍然有很大的不足。現有的設置通常採用參考遊戲，這限制了可以研究的語言出現現象的範圍，因為該遊戲包含代理之間單一的、純粹基於語言的互動。在本文中，我們解決了這些限制，並探討了在開放式多代理環境中基於代幣的溝通的出現和效用，在這種環境中，情境代理通過運動和跨多個時間步長的溝通與環境互動。具體來說，我們引入了兩個新穎的合作環境：多代理 Pong 和收集器。這些環境很有趣，因為最佳性能需要溝通協議的出現，但可以在沒有協議的情況下取得中等成功。通過採用可解釋 AI 研究中的各種方法，例如顯著性映射、擾動和診斷分類器，我們能夠追蹤和解釋代理隨著時間推移的語言管道使用情況。我們發現新興的溝通是稀疏的，代理只在沒有協調就無法成功的情況下生成有意義的訊息並對接收到的訊息採取行動。", "author": "Cornelius Wolff et.al.", "authors": "Cornelius Wolff, Julius Mayer, Elia Bruni, Xenia Ohmer", "id": "2408.14649v1", "paper_url": "http://arxiv.org/abs/2408.14649v1", "repo": "null"}}