{"2406.14088": {"publish_time": "2024-06-20", "title": "ReaLHF: Optimized RLHF Training for Large Language Models through Parameter Reallocation", "paper_summary": "Reinforcement Learning from Human Feedback (RLHF) stands as a pivotal\ntechnique in empowering large language model (LLM) applications. Since RLHF\ninvolves diverse computational workloads and intricate dependencies among\nmultiple LLMs, directly adopting parallelization techniques from supervised\ntraining can result in sub-optimal performance. To overcome this limitation, we\npropose a novel approach named parameter ReaLlocation, which dynamically\nredistributes LLM parameters in the cluster and adapts parallelization\nstrategies during training. Building upon this idea, we introduce ReaLHF, a\npioneering system capable of automatically discovering and running efficient\nexecution plans for RLHF training given the desired algorithmic and hardware\nconfigurations. ReaLHF formulates the execution plan for RLHF as an augmented\ndataflow graph. Based on this formulation, ReaLHF employs a tailored search\nalgorithm with a lightweight cost estimator to discover an efficient execution\nplan. Subsequently, the runtime engine deploys the selected plan by effectively\nparallelizing computations and redistributing parameters. We evaluate ReaLHF on\nthe LLaMA-2 models with up to $4\\times70$ billion parameters and 128 GPUs. The\nexperiment results showcase ReaLHF's substantial speedups of $2.0-10.6\\times$\ncompared to baselines. Furthermore, the execution plans generated by ReaLHF\nexhibit an average of $26\\%$ performance improvement over heuristic approaches\nbased on Megatron-LM. The source code of ReaLHF is publicly available at\nhttps://github.com/openpsi-project/ReaLHF .", "paper_summary_zh": "強化學習來自人類回饋 (RLHF) 是一種關鍵技術，用於賦能大型語言模型 (LLM) 應用程式。由於 RLHF 涉及多種運算工作負載和多個 LLM 之間的複雜依賴關係，直接採用監督式訓練的平行化技術可能會導致次佳效能。為了克服這個限制，我們提出了一種名為參數重新配置的新方法，它會動態重新分配叢集中的 LLM 參數，並在訓練期間調整平行化策略。在此概念的基礎上，我們引入了 ReaLHF，這是一個開創性的系統，能夠自動發現並執行 RLHF 訓練的高效執行計畫，並考量所需的演算法和硬體組態。ReaLHF 將 RLHF 的執行計畫制定為一個擴增資料流圖。基於此制定，ReaLHF 採用量身打造的搜尋演算法，搭配輕量級成本估計器，以發現高效的執行計畫。隨後，執行時間引擎透過有效平行化運算和重新分配參數，來部署所選的計畫。我們在 LLaMA-2 模型上評估 ReaLHF，該模型最多有 $4\\times70$0 億個參數和 128 個 GPU。實驗結果顯示，與基準相比，ReaLHF 的速度提升了 $2.0-10.6\\times$。此外，ReaLHF 生成的執行計畫比基於 Megatron-LM 的啟發式方法，平均效能提升了 $26\\%$。ReaLHF 的原始程式碼公開於 https://github.com/openpsi-project/ReaLHF。", "author": "Zhiyu Mei et.al.", "authors": "Zhiyu Mei, Wei Fu, Kaiwei Li, Guangju Wang, Huanchen Zhang, Yi Wu", "id": "2406.14088v1", "paper_url": "http://arxiv.org/abs/2406.14088v1", "repo": "https://github.com/openpsi-project/realhf"}}