{"2406.04046": {"publish_time": "2024-06-06", "title": "ActionReasoningBench: Reasoning about Actions with and without Ramification Constraints", "paper_summary": "Reasoning about actions and change (RAC) has historically driven the\ndevelopment of many early AI challenges, such as the frame problem, and many AI\ndisciplines, including non-monotonic and commonsense reasoning. The role of RAC\nremains important even now, particularly for tasks involving dynamic\nenvironments, interactive scenarios, and commonsense reasoning. Despite the\nprogress of Large Language Models (LLMs) in various AI domains, their\nperformance on RAC is underexplored. To address this gap, we introduce a new\nbenchmark, ActionReasoningBench, encompassing 13 domains and rigorously\nevaluating LLMs across eight different areas of RAC. These include - Object\nTracking, Fluent Tracking, State Tracking, Action Executability, Effects of\nActions, Numerical RAC, Hallucination Detection, and Composite Questions.\nFurthermore, we also investigate the indirect effect of actions due to\nramification constraints for every domain. Finally, we evaluate our benchmark\nusing open-sourced and commercial state-of-the-art LLMs, including GPT-4o,\nGemini-1.0-Pro, Llama2-7b-chat, Llama2-13b-chat, Llama3-8b-instruct,\nGemma-2b-instruct, and Gemma-7b-instruct. Our findings indicate that these\nmodels face significant challenges across all categories included in our\nbenchmark.", "paper_summary_zh": "推理动作和变化 (RAC) 在历史上推动了许多早期人工智能挑战的发展，例如框架问题，以及许多人工智能学科，包括非单调推理和常识推理。RAC 的作用即使现在仍然很重要，特别是对于涉及动态环境、交互场景和常识推理的任务。尽管大型语言模型 (LLM) 在各个人工智能领域取得了进展，但它们在 RAC 上的性能却鲜为人知。为了解决这一差距，我们引入了一个新的基准 ActionReasoningBench，它涵盖 13 个领域，并严格评估了 LLM 在 RAC 的八个不同领域。其中包括 - 对象跟踪、流利跟踪、状态跟踪、动作可执行性、动作效果、数值 RAC、幻觉检测和复合问题。此外，我们还研究了由于每个域的分支约束而导致的动作的间接影响。最后，我们使用开源和商业最先进的 LLM（包括 GPT-4o、Gemini-1.0-Pro、Llama2-7b-chat、Llama2-13b-chat、Llama3-8b-instruct、Gemma-2b-instruct 和 Gemma-7b-instruct）评估了我们的基准。我们的研究结果表明，这些模型在我们基准中包含的所有类别中都面临着重大挑战。", "author": "Divij Handa et.al.", "authors": "Divij Handa, Pavel Dolin, Shrinidhi Kumbhar, Chitta Baral, Tran Cao Son", "id": "2406.04046v1", "paper_url": "http://arxiv.org/abs/2406.04046v1", "repo": "null"}}