{"2404.19303": {"publish_time": "2024-04-30", "title": "Data Set Terminology of Artificial Intelligence in Medicine: A Historical Review and Recommendation", "paper_summary": "Medicine and artificial intelligence (AI) engineering represent two distinct\nfields each with decades of published history. With such history comes a set of\nterminology that has a specific way in which it is applied. However, when two\ndistinct fields with overlapping terminology start to collaborate,\nmiscommunication and misunderstandings can occur. This narrative review aims to\ngive historical context for these terms, accentuate the importance of clarity\nwhen these terms are used in medical AI contexts, and offer solutions to\nmitigate misunderstandings by readers from either field. Through an examination\nof historical documents, including articles, writing guidelines, and textbooks,\nthis review traces the divergent evolution of terms for data sets and their\nimpact. Initially, the discordant interpretations of the word 'validation' in\nmedical and AI contexts are explored. Then the data sets used for AI evaluation\nare classified, namely random splitting, cross-validation, temporal,\ngeographic, internal, and external sets. The accurate and standardized\ndescription of these data sets is crucial for demonstrating the robustness and\ngeneralizability of AI applications in medicine. This review clarifies existing\nliterature to provide a comprehensive understanding of these classifications\nand their implications in AI evaluation. This review then identifies often\nmisunderstood terms and proposes pragmatic solutions to mitigate terminological\nconfusion. Among these solutions are the use of standardized terminology such\nas 'training set,' 'validation (or tuning) set,' and 'test set,' and explicit\ndefinition of data set splitting terminologies in each medical AI research\npublication. This review aspires to enhance the precision of communication in\nmedical AI, thereby fostering more effective and transparent research\nmethodologies in this interdisciplinary field.", "paper_summary_zh": "<paragraph>醫學與人工智慧 (AI) 工程是兩個截然不同的領域，各有數十年的發表歷史。隨著歷史的演進，產生了一組術語，並有其特定的應用方式。然而，當兩個具有重疊術語的不同領域開始合作時，可能會發生溝通不良和誤解。本敘述性回顧旨在為這些術語提供歷史背景，強調在醫學 AI 背景中使用這些術語時清楚表達的重要性，並提供解決方案以減輕來自任一領域的讀者的誤解。透過檢視歷史文件，包括文章、撰寫指南和教科書，本回顧追溯了資料集及其影響術語的不同演變。最初，探討了「驗證」一詞在醫學和 AI 背景中不一致的詮釋。然後對用於 AI 評估的資料集進行分類，即隨機拆分、交叉驗證、時間、地理、內部和外部集合。這些資料集的準確且標準化的描述對於證明 AI 應用在醫學中的穩健性和概括性至關重要。本回顧釐清現有文獻，以全面了解這些分類及其在 AI 評估中的含義。本回顧接著找出常被誤解的術語，並提出務實的解決方案以減輕術語混淆。這些解決方案包括使用標準化術語，例如「訓練集」、「驗證（或調整）集」和「測試集」，以及在每篇醫學 AI 研究出版品中明確定義資料集拆分術語。本回顧旨在提高醫學 AI 中溝通的精確度，從而促進這個跨領域領域更有效且透明的研究方法。</paragraph>", "author": "Shannon L. Walston et.al.", "authors": "Shannon L. Walston, Hiroshi Seki, Hirotaka Takita, Yasuhito Mitsuyama, Shingo Sato, Akifumi Hagiwara, Rintaro Ito, Shouhei Hanaoka, Yukio Miki, Daiju Ueda", "id": "2404.19303v1", "paper_url": "http://arxiv.org/abs/2404.19303v1", "repo": "null"}}