{"2404.19303": {"publish_time": "2024-04-30", "title": "Data Set Terminology of Artificial Intelligence in Medicine: A Historical Review and Recommendation", "paper_summary": "Medicine and artificial intelligence (AI) engineering represent two distinct\nfields each with decades of published history. With such history comes a set of\nterminology that has a specific way in which it is applied. However, when two\ndistinct fields with overlapping terminology start to collaborate,\nmiscommunication and misunderstandings can occur. This narrative review aims to\ngive historical context for these terms, accentuate the importance of clarity\nwhen these terms are used in medical AI contexts, and offer solutions to\nmitigate misunderstandings by readers from either field. Through an examination\nof historical documents, including articles, writing guidelines, and textbooks,\nthis review traces the divergent evolution of terms for data sets and their\nimpact. Initially, the discordant interpretations of the word 'validation' in\nmedical and AI contexts are explored. Then the data sets used for AI evaluation\nare classified, namely random splitting, cross-validation, temporal,\ngeographic, internal, and external sets. The accurate and standardized\ndescription of these data sets is crucial for demonstrating the robustness and\ngeneralizability of AI applications in medicine. This review clarifies existing\nliterature to provide a comprehensive understanding of these classifications\nand their implications in AI evaluation. This review then identifies often\nmisunderstood terms and proposes pragmatic solutions to mitigate terminological\nconfusion. Among these solutions are the use of standardized terminology such\nas 'training set,' 'validation (or tuning) set,' and 'test set,' and explicit\ndefinition of data set splitting terminologies in each medical AI research\npublication. This review aspires to enhance the precision of communication in\nmedical AI, thereby fostering more effective and transparent research\nmethodologies in this interdisciplinary field.", "paper_summary_zh": "", "author": "Shannon L. Walston et.al.", "authors": "Shannon L. Walston,Hiroshi Seki,Hirotaka Takita,Yasuhito Mitsuyama,Shingo Sato,Akifumi Hagiwara,Rintaro Ito,Shouhei Hanaoka,Yukio Miki,Daiju Ueda", "id": "2404.19303v1", "paper_url": "http://arxiv.org/abs/2404.19303v1", "repo": "null"}}