{"2407.08842": {"publish_time": "2024-07-11", "title": "Evaluating Nuanced Bias in Large Language Model Free Response Answers", "paper_summary": "Pre-trained large language models (LLMs) can now be easily adapted for\nspecific business purposes using custom prompts or fine tuning. These\ncustomizations are often iteratively re-engineered to improve some aspect of\nperformance, but after each change businesses want to ensure that there has\nbeen no negative impact on the system's behavior around such critical issues as\nbias. Prior methods of benchmarking bias use techniques such as word masking\nand multiple choice questions to assess bias at scale, but these do not capture\nall of the nuanced types of bias that can occur in free response answers, the\ntypes of answers typically generated by LLM systems. In this paper, we identify\nseveral kinds of nuanced bias in free text that cannot be similarly identified\nby multiple choice tests. We describe these as: confidence bias, implied bias,\ninclusion bias and erasure bias. We present a semi-automated pipeline for\ndetecting these types of bias by first eliminating answers that can be\nautomatically classified as unbiased and then co-evaluating name reversed pairs\nusing crowd workers. We believe that the nuanced classifications our method\ngenerates can be used to give better feedback to LLMs, especially as LLM\nreasoning capabilities become more advanced.", "paper_summary_zh": "預先訓練的大語言模型 (LLM) 現在可以使用自訂提示或微調輕鬆地適應特定業務目的。這些自訂化通常會反覆重新設計以改善效能的某些面向，但在每次變更後，企業都希望確保系統行為在偏差等關鍵問題上沒有產生負面影響。先前評量偏差的方法使用文字遮罩和多選題等技術來大規模評估偏差，但這些方法無法捕捉到自由回應答案中可能出現的所有細微偏差類型，這些答案類型通常由 LLM 系統產生。在本文中，我們找出自由文字中的幾種細微偏差類型，多選題測驗無法以類似方式找出這些偏差。我們將這些偏差描述為：信心偏差、暗示偏差、包容偏差和消除偏差。我們提出一個半自動化流程來偵測這些類型的偏差，首先消除可以自動分類為無偏差的答案，然後使用群眾工作者共同評估名稱反轉的配對。我們相信，我們的方法產生的細微分類可用於提供更好的回饋給 LLM，特別是在 LLM 推理能力變得更進階的情況下。", "author": "Jennifer Healey et.al.", "authors": "Jennifer Healey, Laurie Byrum, Md Nadeem Akhtar, Moumita Sinha", "id": "2407.08842v1", "paper_url": "http://arxiv.org/abs/2407.08842v1", "repo": "null"}}