{"2501.09154": {"publish_time": "2025-01-15", "title": "Towards Multilingual LLM Evaluation for Baltic and Nordic languages: A study on Lithuanian History", "paper_summary": "In this work, we evaluated Lithuanian and general history knowledge of\nmultilingual Large Language Models (LLMs) on a multiple-choice\nquestion-answering task. The models were tested on a dataset of Lithuanian\nnational and general history questions translated into Baltic, Nordic, and\nother languages (English, Ukrainian, Arabic) to assess the knowledge sharing\nfrom culturally and historically connected groups. We evaluated GPT-4o,\nLLaMa3.1 8b and 70b, QWEN2.5 7b and 72b, Mistral Nemo 12b, LLaMa3 8b, Mistral\n7b, LLaMa3.2 3b, and Nordic fine-tuned models (GPT-SW3 and LLaMa3 8b).\n  Our results show that GPT-4o consistently outperformed all other models\nacross language groups, with slightly better results for Baltic and Nordic\nlanguages. Larger open-source models like QWEN2.5 72b and LLaMa3.1 70b\nperformed well but showed weaker alignment with Baltic languages. Smaller\nmodels (Mistral Nemo 12b, LLaMa3.2 3b, QWEN 7B, LLaMa3.1 8B, and LLaMa3 8b)\ndemonstrated gaps with LT-related alignment with Baltic languages while\nperforming better on Nordic and other languages. The Nordic fine-tuned models\ndid not surpass multilingual models, indicating that shared cultural or\nhistorical context alone does not guarantee better performance.", "paper_summary_zh": "在這項工作中，我們評估了多語言大型語言模型 (LLM) 在多選題問答任務中的立陶宛語和一般歷史知識。這些模型在立陶宛國家和一般歷史問題的數據集上進行測試，這些問題被翻譯成波羅的海、北歐和其他語言（英語、烏克蘭語、阿拉伯語），以評估來自文化和歷史相關群體的知識共享。我們評估了 GPT-4o、LLaMa3.1 8b 和 70b、QWEN2.5 7b 和 72b、Mistral Nemo 12b、LLaMa3 8b、Mistral 7b、LLaMa3.2 3b，以及北歐微調模型 (GPT-SW3 和 LLaMa3 8b)。\n我們的結果顯示，GPT-4o 在所有語言群體中始終優於其他所有模型，波羅的海和北歐語言的結果略好。像 QWEN2.5 72b 和 LLaMa3.1 70b 這樣較大的開源模型表現良好，但與波羅的海語言的一致性較弱。較小的模型（Mistral Nemo 12b、LLaMa3.2 3b、QWEN 7B、LLaMa3.1 8B 和 LLaMa3 8b）在與波羅的海語言的 LT 相關一致性方面表現出差距，而在北歐和其他語言上表現得更好。北歐微調模型沒有超越多語言模型，這表明僅共享文化或歷史背景並不能保證更好的表現。", "author": "Yevhen Kostiuk et.al.", "authors": "Yevhen Kostiuk, Oxana Vitman, Łukasz Gagała, Artur Kiulian", "id": "2501.09154v1", "paper_url": "http://arxiv.org/abs/2501.09154v1", "repo": "null"}}