{"2408.03093": {"publish_time": "2024-08-06", "title": "Learning Provably Robust Policies in Uncertain Parametric Environments", "paper_summary": "We present a data-driven approach for learning MDP policies that are robust\nacross stochastic environments whose transition probabilities are defined by\nparameters with an unknown distribution. We produce probably approximately\ncorrect (PAC) guarantees for the performance of these learned policies in a\nnew, unseen environment over the unknown distribution. Our approach is based on\nfinite samples of the MDP environments, for each of which we build an\napproximation of the model as an interval MDP, by exploring a set of generated\ntrajectories. We use the built approximations to synthesise a single policy\nthat performs well (meets given requirements) across the sampled environments,\nand furthermore bound its risk (of not meeting the given requirements) when\ndeployed in an unseen environment. Our procedure offers a trade-off between the\nguaranteed performance of the learned policy and the risk of not meeting the\nguarantee in an unseen environment. Our approach exploits knowledge of the\nenvironment's state space and graph structure, and we show how additional\nknowledge of its parametric structure can be leveraged to optimize learning and\nto obtain tighter guarantees from less samples. We evaluate our approach on a\ndiverse range of established benchmarks, demonstrating that we can generate\nhighly performing and robust policies, along with guarantees that tightly\nquantify their performance and the associated risk.", "paper_summary_zh": "<paragraph>我們提出一個資料驅動的方法，用於學習在隨機環境中穩健的 MDP 政策，其轉換機率由具有未知分佈的參數定義。我們為這些學習政策在未知分佈的新環境中產生的效能，提供近似正確 (PAC) 的保證。我們的做法是基於 MDP 環境的有限樣本，對於每個樣本，我們透過探索一組已產生的軌跡，建立一個區間 MDP 模型近似值。我們使用建立的近似值來綜合一個在採樣環境中表現良好的單一政策（符合給定的需求），並且進一步限制其風險（不符合給定需求）時，在未見環境中部署。我們的程序在學習政策的保證效能與在未見環境中不符合保證的風險之間，提供一個折衷方案。我們的做法利用環境狀態空間和圖形結構的知識，並且我們展示如何利用其參數結構的額外知識，來最佳化學習並從更少的樣本中獲得更嚴格的保證。我們在各種已建立的基準上評估我們的做法，證明我們可以產生高執行效能和穩健的政策，以及嚴格量化其效能和相關風險的保證。</paragraph>", "author": "Yannik Schnitzer et.al.", "authors": "Yannik Schnitzer, Alessandro Abate, David Parker", "id": "2408.03093v1", "paper_url": "http://arxiv.org/abs/2408.03093v1", "repo": "null"}}