{"2410.14150": {"publish_time": "2024-10-18", "title": "Utilizing Large Language Models for Event Deconstruction to Enhance Multimodal Aspect-Based Sentiment Analysis", "paper_summary": "With the rapid development of the internet, the richness of User-Generated\nContentcontinues to increase, making Multimodal Aspect-Based Sentiment Analysis\n(MABSA) a research hotspot. Existing studies have achieved certain results in\nMABSA, but they have not effectively addressed the analytical challenges in\nscenarios where multiple entities and sentiments coexist. This paper\ninnovatively introduces Large Language Models (LLMs) for event decomposition\nand proposes a reinforcement learning framework for Multimodal Aspect-based\nSentiment Analysis (MABSA-RL) framework. This framework decomposes the original\ntext into a set of events using LLMs, reducing the complexity of analysis,\nintroducing reinforcement learning to optimize model parameters. Experimental\nresults show that MABSA-RL outperforms existing advanced methods on two\nbenchmark datasets. This paper provides a new research perspective and method\nfor multimodal aspect-level sentiment analysis.", "paper_summary_zh": "隨著網路的快速發展，使用者產製內容的豐富度持續增加，使得多模態面向基礎情緒分析（MABSA）成為研究熱點。現有研究在 MABSA 上已取得一定成果，但對於多個實體與情緒共存的場景，分析挑戰尚未有效解決。本文創新地引入大型語言模型（LLM）進行事件分解，並提出一個用於多模態面向基礎情緒分析（MABSA-RL）框架的強化學習架構。此架構利用 LLM 將原始文字分解為一組事件，降低分析的複雜度，並引入強化學習來優化模型參數。實驗結果顯示，MABSA-RL 在兩個基準資料集上優於現有的進階方法。本文為多模態面向基礎情緒分析提供新的研究視角與方法。", "author": "Xiaoyong Huang et.al.", "authors": "Xiaoyong Huang, Heli Sun, Qunshu Gao, Wenjie Huang, Ruichen Cao", "id": "2410.14150v1", "paper_url": "http://arxiv.org/abs/2410.14150v1", "repo": "null"}}