{"2406.08464": {"publish_time": "2024-06-12", "title": "Magpie: Alignment Data Synthesis from Scratch by Prompting Aligned LLMs with Nothing", "paper_summary": "High-quality instruction data is critical for aligning large language models\n(LLMs). Although some models, such as Llama-3-Instruct, have open weights,\ntheir alignment data remain private, which hinders the democratization of AI.\nHigh human labor costs and a limited, predefined scope for prompting prevent\nexisting open-source data creation methods from scaling effectively,\npotentially limiting the diversity and quality of public alignment datasets. Is\nit possible to synthesize high-quality instruction data at scale by extracting\nit directly from an aligned LLM? We present a self-synthesis method for\ngenerating large-scale alignment data named Magpie. Our key observation is that\naligned LLMs like Llama-3-Instruct can generate a user query when we input only\nthe left-side templates up to the position reserved for user messages, thanks\nto their auto-regressive nature. We use this method to prompt Llama-3-Instruct\nand generate 4 million instructions along with their corresponding responses.\nWe perform a comprehensive analysis of the extracted data and select 300K\nhigh-quality instances. To compare Magpie data with other public instruction\ndatasets, we fine-tune Llama-3-8B-Base with each dataset and evaluate the\nperformance of the fine-tuned models. Our results indicate that in some tasks,\nmodels fine-tuned with Magpie perform comparably to the official\nLlama-3-8B-Instruct, despite the latter being enhanced with 10 million data\npoints through supervised fine-tuning (SFT) and subsequent feedback learning.\nWe also show that using Magpie solely for SFT can surpass the performance of\nprevious public datasets utilized for both SFT and preference optimization,\nsuch as direct preference optimization with UltraFeedback. This advantage is\nevident on alignment benchmarks such as AlpacaEval, ArenaHard, and WildBench.", "paper_summary_zh": "高质量的指令数据对于对齐大型语言模型 (LLM) 至关重要。尽管某些模型（如 Llama-3-Instruct）具有开放权重，但其对齐数据仍然是私有的，这阻碍了人工智能的民主化。高昂的人工成本和有限的预定义提示范围阻碍了现有的开源数据创建方法有效扩展，从而可能限制公共对齐数据集的多样性和质量。是否可以通过直接从对齐的 LLM 中提取来大规模合成高质量的指令数据？我们提出了一种名为 Magpie 的自合成方法，用于生成大规模的对齐数据。我们的关键观察是，像 Llama-3-Instruct 这样的对齐 LLM 可以在我们仅输入左侧模板（直到为用户消息保留的位置）时生成用户查询，这要归功于它们的自动回归特性。我们使用这种方法提示 Llama-3-Instruct 并生成 400 万条指令及其相应的响应。我们对提取的数据进行了全面分析，并选择了 30 万个高质量的实例。为了将 Magpie 数据与其他公共指令数据集进行比较，我们使用每个数据集对 Llama-3-8B-Base 进行了微调，并评估了微调后的模型的性能。我们的结果表明，在某些任务中，使用 Magpie 微调的模型的性能与官方的 Llama-3-8B-Instruct 相当，尽管后者通过监督微调 (SFT) 和后续反馈学习得到了 1000 万个数据点的增强。我们还表明，仅将 Magpie 用于 SFT 可以超越以前用于 SFT 和偏好优化的公共数据集的性能，例如使用 UltraFeedback 的直接偏好优化。这种优势在对齐基准（如 AlpacaEval、ArenaHard 和 WildBench）中很明显。", "author": "Zhangchen Xu et.al.", "authors": "Zhangchen Xu, Fengqing Jiang, Luyao Niu, Yuntian Deng, Radha Poovendran, Yejin Choi, Bill Yuchen Lin", "id": "2406.08464v1", "paper_url": "http://arxiv.org/abs/2406.08464v1", "repo": "null"}}