{"2406.08482": {"publish_time": "2024-06-12", "title": "Words Worth a Thousand Pictures: Measuring and Understanding Perceptual Variability in Text-to-Image Generation", "paper_summary": "Diffusion models are the state of the art in text-to-image generation, but\ntheir perceptual variability remains understudied. In this paper, we examine\nhow prompts affect image variability in black-box diffusion-based models. We\npropose W1KP, a human-calibrated measure of variability in a set of images,\nbootstrapped from existing image-pair perceptual distances. Current datasets do\nnot cover recent diffusion models, thus we curate three test sets for\nevaluation. Our best perceptual distance outperforms nine baselines by up to 18\npoints in accuracy, and our calibration matches graded human judgements 78% of\nthe time. Using W1KP, we study prompt reusability and show that Imagen prompts\ncan be reused for 10-50 random seeds before new images become too similar to\nalready generated images, while Stable Diffusion XL and DALL-E 3 can be reused\n50-200 times. Lastly, we analyze 56 linguistic features of real prompts,\nfinding that the prompt's length, CLIP embedding norm, concreteness, and word\nsenses influence variability most. As far as we are aware, we are the first to\nanalyze diffusion variability from a visuolinguistic perspective. Our project\npage is at http://w1kp.com", "paper_summary_zh": "擴散模型是文字轉圖像生成中的最新技術，但其感知變異性仍未得到充分研究。在本文中，我們探討提示如何影響基於黑盒擴散模型中的影像變異性。我們提出 W1KP，這是一種基於現有影像對感知距離自舉的人類校準變異性測量。目前的資料集未涵蓋最近的擴散模型，因此我們策劃了三個測試集進行評估。我們最佳的感知距離在準確度上比九個基準高出 18 個百分點，而我們的校準在 78% 的時間內與分級的人類判斷相符。使用 W1KP，我們研究提示的可重複使用性，並顯示 Imagen 提示可以在 10-50 個隨機種子中重複使用，然後新影像才會變得與已生成的影像過於相似，而 Stable Diffusion XL 和 DALL-E 3 可以重複使用 50-200 次。最後，我們分析了 56 個真實提示的語言特徵，發現提示的長度、CLIP 嵌入範數、具體性和詞義最能影響變異性。據我們所知，我們是第一個從視覺語言學的角度分析擴散變異性的人。我們的專案頁面位於 http://w1kp.com", "author": "Raphael Tang et.al.", "authors": "Raphael Tang, Xinyu Zhang, Lixinyu Xu, Yao Lu, Wenyan Li, Pontus Stenetorp, Jimmy Lin, Ferhan Ture", "id": "2406.08482v1", "paper_url": "http://arxiv.org/abs/2406.08482v1", "repo": "null"}}