{"2502.13723": {"publish_time": "2025-02-19", "title": "Direct Value Optimization: Improving Chain-of-Thought Reasoning in LLMs with Refined Values", "paper_summary": "We introduce Direct Value Optimization (DVO), an innovative reinforcement\nlearning framework for enhancing large language models in complex reasoning\ntasks. Unlike traditional methods relying on preference labels, DVO utilizes\nvalue signals at individual reasoning steps, optimizing models via a mean\nsquared error loss. The key benefit of DVO lies in its fine-grained\nsupervision, circumventing the need for labor-intensive human annotations.\nTarget values within the DVO are estimated using either Monte Carlo Tree Search\nor an outcome value model. Our empirical analysis on both mathematical and\ncommonsense reasoning tasks shows that DVO consistently outperforms existing\noffline preference optimization techniques, even with fewer training steps.\nThese findings underscore the importance of value signals in advancing\nreasoning capabilities and highlight DVO as a superior methodology under\nscenarios lacking explicit human preference information.", "paper_summary_zh": "我們引進直接價值最佳化 (DVO)，一種創新的強化學習架構，用於增強大型語言模型在複雜推理任務中的能力。與依賴偏好標籤的傳統方法不同，DVO 利用個別推理步驟中的價值信號，透過均方誤差損失來最佳化模型。DVO 的主要優點在於其細緻的監督，避免了需要大量人力註解。DVO 中的目標值是使用蒙地卡羅樹狀搜尋或結果值模型來估計的。我們在數學和常識推理任務上的實證分析顯示，DVO 始終優於現有的離線偏好最佳化技術，即使訓練步驟較少。這些發現強調了價值信號在推進推理能力方面的重要性，並強調 DVO 在缺乏明確人類偏好資訊的情況下是一種優越的方法。", "author": "Hongbo Zhang et.al.", "authors": "Hongbo Zhang, Han Cui, Guangsheng Bao, Linyi Yang, Jun Wang, Yue Zhang", "id": "2502.13723v1", "paper_url": "http://arxiv.org/abs/2502.13723v1", "repo": "null"}}