{"2410.03296": {"publish_time": "2024-10-04", "title": "Comparing zero-shot self-explanations with human rationales in multilingual text classification", "paper_summary": "Instruction-tuned LLMs are able to provide an explanation about their output\nto users by generating self-explanations that do not require gradient\ncomputations or the application of possibly complex XAI methods. In this paper,\nwe analyse whether this ability results in a good explanation by evaluating\nself-explanations in the form of input rationales with respect to their\nplausibility to humans as well as their faithfulness to models. For this, we\napply two text classification tasks: sentiment classification and forced labour\ndetection. Next to English, we further include Danish and Italian translations\nof the sentiment classification task and compare self-explanations to human\nannotations for all samples. To allow for direct comparisons, we also compute\npost-hoc feature attribution, i.e., layer-wise relevance propagation (LRP) and\napply this pipeline to 4 LLMs (Llama2, Llama3, Mistral and Mixtral). Our\nresults show that self-explanations align more closely with human annotations\ncompared to LRP, while maintaining a comparable level of faithfulness.", "paper_summary_zh": "經過指令微調的 LLM 可以透過產生自我解釋來對其輸出提供說明給使用者，而這些自我解釋不需要梯度運算或應用可能很複雜的 XAI 方法。在本文中，我們分析這種能力是否能產生良好的解釋，方法是評估輸入依據形式的自我解釋，並考量其對人類的合理性以及對模型的忠實度。為此，我們應用兩個文字分類任務：情緒分類和強迫勞動偵測。除了英文之外，我們還納入了情緒分類任務的丹麥文和義大利文翻譯，並將自我解釋與所有範例的人類註解進行比較。為了進行直接比較，我們也計算事後特徵歸因，也就是逐層相關性傳播 (LRP)，並將此管道應用於 4 個 LLM（Llama2、Llama3、Mistral 和 Mixtral）。我們的結果顯示，與 LRP 相比，自我解釋與人類註解更為一致，同時維持相當程度的忠實度。", "author": "Stephanie Brandl et.al.", "authors": "Stephanie Brandl, Oliver Eberle", "id": "2410.03296v1", "paper_url": "http://arxiv.org/abs/2410.03296v1", "repo": "null"}}