{"2502.17407": {"publish_time": "2025-02-24", "title": "Linguistic Generalizability of Test-Time Scaling in Mathematical Reasoning", "paper_summary": "Scaling pre-training compute has proven effective for achieving\nmulitlinguality, but does the same hold for test-time scaling? In this work, we\nintroduce MCLM, a multilingual math benchmark featuring competition-level\nproblems in 55 languages. We test three test-time scaling methods-Outcome\nReward Modeling (ORM), Process Reward Modeling (ORM), and Budget Forcing\n(BF)-on both Qwen2.5-1.5B Math and MR1-1.5B, a multilingual LLM we trained for\nextended reasoning. Our experiments show that using Qwen2.5-1.5B Math with ORM\nachieves a score of 35.8 on MCLM, while BF on MR1-1.5B attains 35.2. Although\n\"thinking LLMs\" have recently garnered significant attention, we find that\ntheir performance is comparable to traditional scaling methods like best-of-N\nonce constrained to similar levels of inference FLOPs. Moreover, while BF\nyields a 20-point improvement on English AIME, it provides only a 1.94-point\naverage gain across other languages-a pattern consistent across the other\ntest-time scaling methods we studied-higlighting that test-time scaling may not\ngeneralize as effectively to multilingual tasks. To foster further research, we\nrelease MCLM, MR1-1.5B, and evaluation results.", "paper_summary_zh": "擴展預訓練運算已被證明有效於實現多語言性，但測試時擴展是否也適用？在這項工作中，我們引入了 MCLM，一個多語言數學基準，包含 55 種語言的競賽級問題。我們在 Qwen2.5-1.5B 數學和 MR1-1.5B 上測試了三種測試時擴展方法：結果回饋模型 (ORM)、程序回饋模型 (ORM) 和預算強制 (BF)，MR1-1.5B 是一個我們為擴展推理而訓練的多語言 LLM。我們的實驗顯示，使用 Qwen2.5-1.5B 數學搭配 ORM 在 MCLM 上取得 35.8 分，而 MR1-1.5B 上的 BF 則獲得 35.2 分。儘管「思考 LLM」最近備受關注，我們發現它們的效能與傳統擴展方法（例如最佳 N）相當，只要限制在相似的推論 FLOP 水準即可。此外，雖然 BF 在英文 AIME 上提升了 20 分，但在其他語言上只平均提升了 1.94 分，這與我們研究的其他測試時擴展方法一致，突顯出測試時擴展可能無法有效推廣到多語言任務。為了促進進一步的研究，我們發布了 MCLM、MR1-1.5B 和評估結果。", "author": "Guijin Son et.al.", "authors": "Guijin Son, Jiwoo Hong, Hyunwoo Ko, James Thorne", "id": "2502.17407v1", "paper_url": "http://arxiv.org/abs/2502.17407v1", "repo": "null"}}