{"2408.03281": {"publish_time": "2024-08-06", "title": "StructEval: Deepen and Broaden Large Language Model Assessment via Structured Evaluation", "paper_summary": "Evaluation is the baton for the development of large language models. Current\nevaluations typically employ a single-item assessment paradigm for each atomic\ntest objective, which struggles to discern whether a model genuinely possesses\nthe required capabilities or merely memorizes/guesses the answers to specific\nquestions. To this end, we propose a novel evaluation framework referred to as\nStructEval. Starting from an atomic test objective, StructEval deepens and\nbroadens the evaluation by conducting a structured assessment across multiple\ncognitive levels and critical concepts, and therefore offers a comprehensive,\nrobust and consistent evaluation for LLMs. Experiments on three widely-used\nbenchmarks demonstrate that StructEval serves as a reliable tool for resisting\nthe risk of data contamination and reducing the interference of potential\nbiases, thereby providing more reliable and consistent conclusions regarding\nmodel capabilities. Our framework also sheds light on the design of future\nprincipled and trustworthy LLM evaluation protocols.", "paper_summary_zh": "評估是大型語言模型發展的推進器。目前的評估通常對每個原子測試目標採用單一項目評估範例，這難以辨別模型是否真正具備所需的技能，或者只是記住/猜測特定問題的答案。為此，我們提出一個新的評估框架，稱為 StructEval。從原子測試目標開始，StructEval 透過在多個認知層面和關鍵概念中進行結構化評估，來深入且廣泛地進行評估，因此為 LLM 提供全面、穩健且一致的評估。在三個廣泛使用的基準測試上的實驗證明，StructEval 可作為抵抗資料污染風險和減少潛在偏差干擾的可靠工具，從而對模型能力提供更可靠且一致的結論。我們的框架也為未來基於原則且值得信賴的 LLM 評估協定的設計提供了啟示。", "author": "Boxi Cao et.al.", "authors": "Boxi Cao, Mengjie Ren, Hongyu Lin, Xianpei Han, Feng Zhang, Junfeng Zhan, Le Sun", "id": "2408.03281v1", "paper_url": "http://arxiv.org/abs/2408.03281v1", "repo": "null"}}