{"2406.03843": {"publish_time": "2024-06-06", "title": "POEM: Interactive Prompt Optimization for Enhancing Multimodal Reasoning of Large Language Models", "paper_summary": "Large language models (LLMs) have exhibited impressive abilities for\nmultimodal content comprehension and reasoning with proper prompting in zero-\nor few-shot settings. Despite the proliferation of interactive systems\ndeveloped to support prompt engineering for LLMs across various tasks, most\nhave primarily focused on textual or visual inputs, thus neglecting the complex\ninterplay between modalities within multimodal inputs. This oversight hinders\nthe development of effective prompts that guide model multimodal reasoning\nprocesses by fully exploiting the rich context provided by multiple modalities.\nIn this paper, we present POEM, a visual analytics system to facilitate\nefficient prompt engineering for enhancing the multimodal reasoning performance\nof LLMs. The system enables users to explore the interaction patterns across\nmodalities at varying levels of detail for a comprehensive understanding of the\nmultimodal knowledge elicited by various prompts. Through diverse\nrecommendations of demonstration examples and instructional principles, POEM\nsupports users in iteratively crafting and refining prompts to better align and\nenhance model knowledge with human insights. The effectiveness and efficiency\nof our system are validated through two case studies and interviews with\nexperts.", "paper_summary_zh": "大型語言模型 (LLM) 在多模態內容理解和推理方面表現出令人印象深刻的能力，並在零次或少次嘗試的設定中適當地提示。儘管開發了許多互動式系統來支援 LLM 的提示工程，但大多數主要集中在文字或視覺輸入，因此忽略了多模態輸入中模態之間的複雜交互作用。這種疏忽阻礙了有效提示的發展，這些提示通過充分利用多種模態提供的豐富背景來指導模型多模態推理過程。在本文中，我們提出了 POEM，這是一個視覺分析系統，用於促進有效的提示工程，以增強 LLM 的多模態推理效能。該系統使用戶能夠探索不同層級細節中跨模態的交互模式，以全面了解各種提示引發的多模態知識。透過示範範例和教學原則的多樣化建議，POEM 支援使用者反覆建構和調整提示，以更好地與人類見解對齊並增強模型知識。我們系統的有效性和效率已通過兩個案例研究和專家訪談得到驗證。", "author": "Jianben He et.al.", "authors": "Jianben He, Xingbo Wang, Shiyi Liu, Guande Wu, Claudio Silva, Huamin Qu", "id": "2406.03843v1", "paper_url": "http://arxiv.org/abs/2406.03843v1", "repo": "null"}}