{"2406.14952": {"publish_time": "2024-06-21", "title": "ESC-Eval: Evaluating Emotion Support Conversations in Large Language Models", "paper_summary": "Emotion Support Conversation (ESC) is a crucial application, which aims to\nreduce human stress, offer emotional guidance, and ultimately enhance human\nmental and physical well-being. With the advancement of Large Language Models\n(LLMs), many researchers have employed LLMs as the ESC models. However, the\nevaluation of these LLM-based ESCs remains uncertain. Inspired by the awesome\ndevelopment of role-playing agents, we propose an ESC Evaluation framework\n(ESC-Eval), which uses a role-playing agent to interact with ESC models,\nfollowed by a manual evaluation of the interactive dialogues. In detail, we\nfirst re-organize 2,801 role-playing cards from seven existing datasets to\ndefine the roles of the role-playing agent. Second, we train a specific\nrole-playing model called ESC-Role which behaves more like a confused person\nthan GPT-4. Third, through ESC-Role and organized role cards, we systematically\nconduct experiments using 14 LLMs as the ESC models, including general\nAI-assistant LLMs (ChatGPT) and ESC-oriented LLMs (ExTES-Llama). We conduct\ncomprehensive human annotations on interactive multi-turn dialogues of\ndifferent ESC models. The results show that ESC-oriented LLMs exhibit superior\nESC abilities compared to general AI-assistant LLMs, but there is still a gap\nbehind human performance. Moreover, to automate the scoring process for future\nESC models, we developed ESC-RANK, which trained on the annotated data,\nachieving a scoring performance surpassing 35 points of GPT-4. Our data and\ncode are available at https://github.com/haidequanbu/ESC-Eval.", "paper_summary_zh": "情緒支持對話 (ESC) 是一項重要的應用程式，旨在減輕人類壓力、提供情緒指導，並最終增進人類的心理和生理健康。隨著大型語言模型 (LLM) 的進步，許多研究人員已採用 LLM 作為 ESC 模型。然而，這些基於 LLM 的 ESC 評估仍不確定。受到角色扮演代理的驚人發展啟發，我們提出一個 ESC 評估架構 (ESC-Eval)，它使用角色扮演代理與 ESC 模型互動，然後手動評估互動對話。詳細來說，我們首先從七個現有資料集重新組織 2,801 張角色扮演卡，以定義角色扮演代理的角色。其次，我們訓練一個稱為 ESC-Role 的特定角色扮演模型，其行為比 GPT-4 更像一個困惑的人。第三，透過 ESC-Role 和組織化的角色卡，我們系統性地進行實驗，使用 14 個 LLM 作為 ESC 模型，包括一般 AI 助理 LLM（ChatGPT）和以 ESC 為導向的 LLM（ExTES-Llama）。我們對不同 ESC 模型的互動多輪對話進行全面的手動註解。結果顯示，以 ESC 為導向的 LLM 展現出優於一般 AI 助理 LLM 的 ESC 能力，但仍落後於人類表現。此外，為了自動化未來 ESC 模型的評分流程，我們開發了 ESC-RANK，它訓練於註解資料，其評分表現超越 GPT-4 的 35 分。我們的資料和程式碼可在 https://github.com/haidequanbu/ESC-Eval 取得。", "author": "Haiquan Zhao et.al.", "authors": "Haiquan Zhao, Lingyu Li, Shisong Chen, Shuqi Kong, Jiaan Wang, Kexing Huang, Tianle Gu, Yixu Wang, Dandan Liang, Zhixu Li, Tan Teng, Yanghua Xiao, Yingchun Wang", "id": "2406.14952v1", "paper_url": "http://arxiv.org/abs/2406.14952v1", "repo": "https://github.com/haidequanbu/esc-eval"}}