{"2410.18785": {"publish_time": "2024-10-24", "title": "Should We Really Edit Language Models? On the Evaluation of Edited Language Models", "paper_summary": "Model editing has become an increasingly popular alternative for efficiently\nupdating knowledge within language models. Current methods mainly focus on\nreliability, generalization, and locality, with many methods excelling across\nthese criteria. Some recent works disclose the pitfalls of these editing\nmethods such as knowledge distortion or conflict. However, the general\nabilities of post-edited language models remain unexplored. In this paper, we\nperform a comprehensive evaluation on various editing methods and different\nlanguage models, and have following findings. (1) Existing editing methods lead\nto inevitable performance deterioration on general benchmarks, indicating that\nexisting editing methods maintain the general abilities of the model within\nonly a few dozen edits. When the number of edits is slightly large, the\nintrinsic knowledge structure of the model is disrupted or even completely\ndamaged. (2) Instruction-tuned models are more robust to editing, showing less\nperformance drop on general knowledge after editing. (3) Language model with\nlarge scale is more resistant to editing compared to small model. (4) The\nsafety of the edited model, is significantly weakened, even for those\nsafety-aligned models. Our findings indicate that current editing methods are\nonly suitable for small-scale knowledge updates within language models, which\nmotivates further research on more practical and reliable editing methods. The\ndetails of code and reproduction can be found in\nhttps://github.com/lqinfdim/EditingEvaluation.", "paper_summary_zh": "模型編輯已成為有效更新語言模型中知識的越來越受歡迎的替代方案。目前的方法主要集中於可靠性、概括性和局部性，許多方法在這些標準上表現優異。一些最近的研究揭露了這些編輯方法的缺陷，例如知識扭曲或衝突。然而，後編輯語言模型的一般能力仍未得到探索。在本文中，我們對各種編輯方法和不同的語言模型進行了全面的評估，並有以下發現。（1）現有的編輯方法導致一般基準上的效能不可避免地惡化，這表明現有的編輯方法僅在幾十次編輯內維持模型的一般能力。當編輯次數稍大時，模型的內在知識結構會被破壞甚至完全損壞。（2）指令調整模型對編輯更具魯棒性，在編輯後在一般知識上顯示效能下降較少。（3）與小模型相比，具有大規模的語言模型更能抵抗編輯。（4）已編輯模型的安全性顯著減弱，即使對於那些安全對齊的模型也是如此。我們的研究結果表明，目前的編輯方法僅適用於語言模型中的小規模知識更新，這激勵了對更實用和可靠的編輯方法的進一步研究。程式碼和重現的詳細資訊可以在 https://github.com/lqinfdim/EditingEvaluation 中找到。", "author": "Qi Li et.al.", "authors": "Qi Li, Xiang Liu, Zhenheng Tang, Peijie Dong, Zeyu Li, Xinglin Pan, Xiaowen Chu", "id": "2410.18785v1", "paper_url": "http://arxiv.org/abs/2410.18785v1", "repo": "https://github.com/lqinfdim/editingevaluation"}}