{"2407.04093": {"publish_time": "2024-07-04", "title": "Stephanie: Step-by-Step Dialogues for Mimicking Human Interactions in Social Conversations", "paper_summary": "In the rapidly evolving field of natural language processing, dialogue\nsystems primarily employ a single-step dialogue paradigm. Although this\nparadigm is efficient, it lacks the depth and fluidity of human interactions\nand does not appear natural. We introduce a novel \\textbf{Step}-by-Step\nDialogue Paradigm (Stephanie), designed to mimic the ongoing dynamic nature of\nhuman conversations. By employing a dual learning strategy and a further-split\npost-editing method, we generated and utilized a high-quality step-by-step\ndialogue dataset to fine-tune existing large language models, enabling them to\nperform step-by-step dialogues. We thoroughly present Stephanie. Tailored\nautomatic and human evaluations are conducted to assess its effectiveness\ncompared to the traditional single-step dialogue paradigm. We will release\ncode, Stephanie datasets, and Stephanie LLMs to facilitate the future of\nchatbot eras.", "paper_summary_zh": "在快速發展的自然語言處理領域中，對話系統主要採用單步對話範例。儘管此範例有效率，但它缺乏人類互動的深度和流暢度，且顯得不夠自然。我們引進一種新穎的**逐步**對話範例（Stephanie），旨在模仿人類對話持續進行的動態本質。透過採用雙重學習策略和進一步分割的後編輯方法，我們產生並利用高品質的逐步對話資料集來微調現有的大型語言模型，讓它們能夠執行逐步對話。我們徹底呈現 Stephanie。進行量身打造的自動和人工評估，以評估其相較於傳統單步對話範例的有效性。我們將釋出程式碼、Stephanie 資料集和 Stephanie LLM，以促進聊天機器人時代的未來發展。", "author": "Hao Yang et.al.", "authors": "Hao Yang, Hongyuan Lu, Xinhua Zeng, Yang Liu, Xiang Zhang, Haoran Yang, Yumeng Zhang, Yiran Wei, Wai Lam", "id": "2407.04093v1", "paper_url": "http://arxiv.org/abs/2407.04093v1", "repo": "null"}}