{"2406.03820": {"publish_time": "2024-06-06", "title": "A Survey on Intelligent Internet of Things: Applications, Security, Privacy, and Future Directions", "paper_summary": "The rapid advances in the Internet of Things (IoT) have promoted a revolution\nin communication technology and offered various customer services. Artificial\nintelligence (AI) techniques have been exploited to facilitate IoT operations\nand maximize their potential in modern application scenarios. In particular,\nthe convergence of IoT and AI has led to a new networking paradigm called\nIntelligent IoT (IIoT), which has the potential to significantly transform\nbusinesses and industrial domains. This paper presents a comprehensive survey\nof IIoT by investigating its significant applications in mobile networks, as\nwell as its associated security and privacy issues. Specifically, we explore\nand discuss the roles of IIoT in a wide range of key application domains, from\nsmart healthcare and smart cities to smart transportation and smart industries.\nThrough such extensive discussions, we investigate important security issues in\nIIoT networks, where network attacks, confidentiality, integrity, and intrusion\nare analyzed, along with a discussion of potential countermeasures. Privacy\nissues in IIoT networks were also surveyed and discussed, including data,\nlocation, and model privacy leakage. Finally, we outline several key challenges\nand highlight potential research directions in this important area.", "paper_summary_zh": "物联网 (IoT) 的快速进步促进了通信技术的革命，并提供了各种客户服务。人工智能 (AI) 技术已被用来促进物联网操作，并在现代应用场景中最大化其潜力。特别是，物联网和人工智能的融合催生了一种称为智能物联网 (IIoT) 的新网络范例，它有可能极大地改变商业和工业领域。本文通过调查 IIoT 在移动网络中的重要应用及其相关的安全和隐私问题，对 IIoT 进行了全面的调查。具体来说，我们探讨并讨论了 IIoT 在广泛的关键应用领域中的作用，从智能医疗保健和智慧城市到智能交通和智能产业。通过如此广泛的讨论，我们调查了 IIoT 网络中的重要安全问题，其中分析了网络攻击、机密性、完整性和入侵，并讨论了潜在的对策。还对 IIoT 网络中的隐私问题进行了调查和讨论，包括数据、位置和模型隐私泄露。最后，我们概述了几个关键挑战，并重点介绍了这一重要领域的潜在研究方向。", "author": "Ons Aouedi et.al.", "authors": "Ons Aouedi, Thai-Hoc Vu, Alessio Sacco, Dinh C. Nguyen, Kandaraj Piamrat, Guido Marchetto, Quoc-Viet Pham", "id": "2406.03820v1", "paper_url": "http://arxiv.org/abs/2406.03820v1", "repo": "null"}}