{"2407.17197": {"publish_time": "2024-07-24", "title": "ALPI: Auto-Labeller with Proxy Injection for 3D Object Detection using 2D Labels Only", "paper_summary": "3D object detection plays a crucial role in various applications such as\nautonomous vehicles, robotics and augmented reality. However, training 3D\ndetectors requires a costly precise annotation, which is a hindrance to scaling\nannotation to large datasets. To address this challenge, we propose a weakly\nsupervised 3D annotator that relies solely on 2D bounding box annotations from\nimages, along with size priors. One major problem is that supervising a 3D\ndetection model using only 2D boxes is not reliable due to ambiguities between\ndifferent 3D poses and their identical 2D projection. We introduce a simple yet\neffective and generic solution: we build 3D proxy objects with annotations by\nconstruction and add them to the training dataset. Our method requires only\nsize priors to adapt to new classes. To better align 2D supervision with 3D\ndetection, our method ensures depth invariance with a novel expression of the\n2D losses. Finally, to detect more challenging instances, our annotator follows\nan offline pseudo-labelling scheme which gradually improves its 3D\npseudo-labels. Extensive experiments on the KITTI dataset demonstrate that our\nmethod not only performs on-par or above previous works on the Car category,\nbut also achieves performance close to fully supervised methods on more\nchallenging classes. We further demonstrate the effectiveness and robustness of\nour method by being the first to experiment on the more challenging nuScenes\ndataset. We additionally propose a setting where weak labels are obtained from\na 2D detector pre-trained on MS-COCO instead of human annotations.", "paper_summary_zh": "<paragraph>3D 物件偵測在各種應用中扮演著至關重要的角色，例如自動駕駛車、機器人和擴增實境。然而，訓練 3D 偵測器需要昂貴的精確標註，這會阻礙標註擴展到大型資料集。為了應對這個挑戰，我們提出一個弱監督的 3D 標註器，它僅依賴於來自影像的 2D 框標註，以及尺寸先驗。一個主要問題是，僅使用 2D 框來監督 3D 偵測模型並不可靠，因為不同 3D 姿勢及其相同的 2D 投影之間存在歧義。我們引入了一個簡單但有效且通用的解決方案：我們通過構造建立帶有標註的 3D 代理物件，並將它們新增到訓練資料集中。我們的模型只需要尺寸先驗就能適應新的類別。為了更好地將 2D 監督與 3D 偵測對齊，我們的模型使用 2D 損失的新表達方式確保深度不變性。最後，為了偵測更具挑戰性的實例，我們的標註器遵循離線偽標籤方案，逐漸改善其 3D 偽標籤。在 KITTI 資料集上的廣泛實驗表明，我們的模型不僅在汽車類別中表現出與先前的研究相同或更好的表現，而且還在更具挑戰性的類別中實現了接近完全監督模型的表現。我們進一步證明了我們模型的有效性和穩健性，成為第一個在更具挑戰性的 nuScenes 資料集上進行實驗的模型。此外，我們提出了一個設定，其中弱標籤是從在 MS-COCO 上預先訓練的 2D 偵測器獲得的，而不是來自人工標註。</paragraph>", "author": "Saad Lahlali et.al.", "authors": "Saad Lahlali, Nicolas Granger, Hervé Le Borgne, Quoc-Cuong Pham", "id": "2407.17197v1", "paper_url": "http://arxiv.org/abs/2407.17197v1", "repo": "null"}}