{"2412.06287": {"publish_time": "2024-12-09", "title": "PediaBench: A Comprehensive Chinese Pediatric Dataset for Benchmarking Large Language Models", "paper_summary": "The emergence of Large Language Models (LLMs) in the medical domain has\nstressed a compelling need for standard datasets to evaluate their\nquestion-answering (QA) performance. Although there have been several benchmark\ndatasets for medical QA, they either cover common knowledge across different\ndepartments or are specific to another department rather than pediatrics.\nMoreover, some of them are limited to objective questions and do not measure\nthe generation capacity of LLMs. Therefore, they cannot comprehensively assess\nthe QA ability of LLMs in pediatrics. To fill this gap, we construct\nPediaBench, the first Chinese pediatric dataset for LLM evaluation.\nSpecifically, it contains 4,565 objective questions and 1,632 subjective\nquestions spanning 12 pediatric disease groups. It adopts an integrated scoring\ncriterion based on different difficulty levels to thoroughly assess the\nproficiency of an LLM in instruction following, knowledge understanding,\nclinical case analysis, etc. Finally, we validate the effectiveness of\nPediaBench with extensive experiments on 20 open-source and commercial LLMs.\nThrough an in-depth analysis of experimental results, we offer insights into\nthe ability of LLMs to answer pediatric questions in the Chinese context,\nhighlighting their limitations for further improvements. Our code and data are\npublished at https://github.com/ACMISLab/PediaBench.", "paper_summary_zh": "大型語言模型 (LLM) 在醫療領域的出現\n強調了對標準資料集的迫切需求，以評估其\n問答 (QA) 效能。儘管有幾個醫療 QA 的基準\n資料集，但它們涵蓋不同科別的常識，或特定於兒科以外的科別。\n此外，其中一些僅限於客觀問題，且無法衡量 LLM 的生成能力。因此，它們無法全面評估\nLLM 在兒科中的 QA 能力。為了填補這個空白，我們建構\nPediaBench，這是第一個用於 LLM 評估的中文兒科資料集。\n具體來說，它包含 4,565 個客觀問題和 1,632 個主觀\n問題，涵蓋 12 個兒科疾病組。它採用基於不同難度等級的綜合評分\n標準，以徹底評估 LLM 在遵循說明、知識理解、\n臨床案例分析等方面的能力。最後，我們驗證了\nPediaBench 的有效性，對 20 個開源和商業 LLM 進行了廣泛的實驗。\n透過深入分析實驗結果，我們深入了解了 LLM 在中文背景下回答兒科問題的能力，\n強調了它們的限制以進一步改進。我們的程式碼和資料已發布在 https://github.com/ACMISLab/PediaBench。", "author": "Qian Zhang et.al.", "authors": "Qian Zhang, Panfeng Chen, Jiali Li, Linkun Feng, Shuyu Liu, Mei Chen, Hui Li, Yanhao Wang", "id": "2412.06287v1", "paper_url": "http://arxiv.org/abs/2412.06287v1", "repo": "https://github.com/acmislab/pediabench"}}