{"2412.18415": {"publish_time": "2024-12-24", "title": "Multilingual Mathematical Reasoning: Advancing Open-Source LLMs in Hindi and English", "paper_summary": "Large Language Models (LLMs) excel in linguistic tasks but struggle with\nmathematical reasoning, particularly in non English languages like Hindi. This\nresearch aims to enhance the mathematical reasoning skills of smaller, resource\nefficient open-source LLMs in both Hindi and English. We evaluate models like\nOpenHathi 7B, LLaMA-2 7B, WizardMath 7B, Mistral 7B, LLeMMa 7B, MAmmoTH 7B,\nGemini Pro, and GPT-4 using zero-shot, few-shot chain-of-thought (CoT) methods,\nand supervised fine-tuning. Our approach incorporates curriculum learning,\nprogressively training models on increasingly difficult problems, a novel\nDecomposition Strategy to simplify complex arithmetic operations, and a\nStructured Solution Design that divides solutions into phases. Our experiments\nresult in notable performance enhancements. WizardMath 7B exceeds Gemini's\naccuracy on English datasets by +6% and matches Gemini's performance on Hindi\ndatasets. Adopting a bilingual approach that combines English and Hindi samples\nachieves results comparable to individual language models, demonstrating the\ncapability to learn mathematical reasoning in both languages. This research\nhighlights the potential for improving mathematical reasoning in open-source\nLLMs.", "paper_summary_zh": "大型語言模型 (LLM) 在語言任務中表現出色，但在數學推理方面卻有困難，特別是在印地語等非英語語言中。這項研究旨在增強印地語和英語中較小、資源效率高的開源 LLM 的數學推理技能。我們使用零次、少次思考鏈 (CoT) 方法和監督微調來評估 OpenHathi 7B、LLaMA-2 7B、WizardMath 7B、Mistral 7B、LLeMMa 7B、MAmmoTH 7B、Gemini Pro 和 GPT-4 等模型。我們的做法結合了課程學習，逐漸訓練模型來解決越來越困難的問題，一種簡化複雜算術運算的新分解策略，以及將解法分為階段的結構化解法設計。我們的實驗產生了顯著的效能提升。WizardMath 7B 在英語資料集上的準確率比 Gemini 高出 +6%，並在印地語資料集上與 Gemini 的效能相匹配。採用結合英語和印地語範例的雙語方法，取得了與個別語言模型相當的結果，證明了學習兩種語言中數學推理的能力。這項研究突出了改善開源 LLM 中數學推理的潛力。", "author": "Avinash Anand et.al.", "authors": "Avinash Anand, Kritarth Prasad, Chhavi Kirtani, Ashwin R Nair, Manvendra Kumar Nema, Raj Jaiswal, Rajiv Ratn Shah", "id": "2412.18415v1", "paper_url": "http://arxiv.org/abs/2412.18415v1", "repo": "https://github.com/midas-research/Multilingual-Mathematical-Reasoning"}}