{"2411.17749": {"publish_time": "2024-11-25", "title": "Will an AI with Private Information Allow Itself to Be Switched Off?", "paper_summary": "A wide variety of goals could cause an AI to disable its off switch because\n\"you can't fetch the coffee if you're dead\" (Russell 2019). Prior theoretical\nwork on this shutdown problem assumes that humans know everything that AIs do.\nIn practice, however, humans have only limited information. Moreover, in many\nof the settings where the shutdown problem is most concerning, AIs might have\nvast amounts of private information. To capture these differences in knowledge,\nwe introduce the Partially Observable Off-Switch Game (POSG), a game-theoretic\nmodel of the shutdown problem with asymmetric information. Unlike when the\nhuman has full observability, we find that in optimal play, even AI agents\nassisting perfectly rational humans sometimes avoid shutdown. As expected,\nincreasing the amount of communication or information available always\nincreases (or leaves unchanged) the agents' expected common payoff. But\ncounterintuitively, introducing bounded communication can make the AI defer to\nthe human less in optimal play even though communication mitigates information\nasymmetry. In particular, communication sometimes enables new optimal behavior\nrequiring strategic AI deference to achieve outcomes that were previously\ninaccessible. Thus, designing safe artificial agents in the presence of\nasymmetric information requires careful consideration of the tradeoffs between\nmaximizing payoffs (potentially myopically) and maintaining AIs' incentives to\ndefer to humans.", "paper_summary_zh": "由於「如果你死了，你就無法去拿咖啡」（羅素，2019 年），各種目標都可能導致 AI 關閉其關閉開關。先前關於此關閉問題的理論研究假設人類知道 AI 所做的一切。然而，在實務上，人類只有有限的資訊。此外，在關閉問題最令人擔憂的許多情況下，AI 可能擁有大量的私人資訊。為了掌握這些知識差異，我們引入了部分可觀察關閉開關遊戲 (POSG)，這是關閉問題的博弈論模型，其中資訊不對稱。與人類擁有完全可觀察性不同，我們發現，在最佳博弈中，即使協助完全理性的 AI 代理有時也會避免關閉。正如預期的那樣，增加可用的溝通或資訊量總是會增加（或保持不變）代理的預期共同報酬。但反直覺的是，即使溝通可以減輕資訊不對稱，引入有界溝通也會讓 AI 在最佳博弈中較少服從人類。特別是，溝通有時會促成新的最佳行為，需要策略性 AI 服從才能達成以前無法達成的結果。因此，在存在資訊不對稱的情況下設計安全的 AI 代理，需要仔細考量在最大化報酬（可能近視）和維持 AI 服從人類的誘因之間的取捨。", "author": "Andrew Garber et.al.", "authors": "Andrew Garber, Rohan Subramani, Linus Luu, Mark Bedaywi, Stuart Russell, Scott Emmons", "id": "2411.17749v1", "paper_url": "http://arxiv.org/abs/2411.17749v1", "repo": "null"}}