{"2409.18418": {"publish_time": "2024-09-27", "title": "A3: Active Adversarial Alignment for Source-Free Domain Adaptation", "paper_summary": "Unsupervised domain adaptation (UDA) aims to transfer knowledge from a\nlabeled source domain to an unlabeled target domain. Recent works have focused\non source-free UDA, where only target data is available. This is challenging as\nmodels rely on noisy pseudo-labels and struggle with distribution shifts. We\npropose Active Adversarial Alignment (A3), a novel framework combining\nself-supervised learning, adversarial training, and active learning for robust\nsource-free UDA. A3 actively samples informative and diverse data using an\nacquisition function for training. It adapts models via adversarial losses and\nconsistency regularization, aligning distributions without source data access.\nA3 advances source-free UDA through its synergistic integration of active and\nadversarial learning for effective domain alignment and noise reduction.", "paper_summary_zh": "無監督域適應 (UDA) 旨在將知識從標籤來源域傳輸到未標籤目標域。最近的研究集中在無來源 UDA，其中只有目標數據可用。這具有挑戰性，因為模型依賴於有雜訊的偽標籤，並與分佈轉移作鬥爭。我們提出主動對抗對齊 (A3)，這是一個結合自監督學習、對抗訓練和主動學習的新框架，用於強大的無來源 UDA。A3 使用採集函數主動採樣有資訊性和多樣化的數據以進行訓練。它通過對抗損失和一致性正則化調整模型，在沒有來源數據訪問的情況下對齊分佈。A3 通過主動和對抗學習的協同整合，推動無來源 UDA，實現有效的域對齊和降噪。", "author": "Chrisantus Eze et.al.", "authors": "Chrisantus Eze, Christopher Crick", "id": "2409.18418v1", "paper_url": "http://arxiv.org/abs/2409.18418v1", "repo": "null"}}