{"2411.07130": {"publish_time": "2024-11-11", "title": "Retrieval or Global Context Understanding? On Many-Shot In-Context Learning for Long-Context Evaluation", "paper_summary": "Language models (LMs) have demonstrated an improved capacity to handle\nlong-context information, yet existing long-context benchmarks primarily\nmeasure LMs' retrieval abilities with extended inputs, e.g., pinpointing a\nshort phrase from long-form text. Therefore, they may fall short when\nevaluating models' global context understanding capacity, such as synthesizing\nand reasoning over content across input to generate the response. In this\npaper, we study long-context language model (LCLM) evaluation through many-shot\nin-context learning (ICL). Concretely, we identify the skills each ICL task\nrequires, and examine models' long-context capabilities on them. We first ask:\nWhat types of ICL tasks benefit from additional demonstrations, and are these\ntasks effective at evaluating LCLMs? We find that classification and\nsummarization tasks show notable performance improvements with additional\ndemonstrations, while translation and reasoning tasks do not exhibit clear\ntrends. This suggests the classification tasks predominantly test models'\nretrieval skills. Next, we ask: To what extent does each task require retrieval\nskills versus global context understanding from LCLMs? We develop metrics to\ncategorize ICL tasks into two groups: (i) retrieval tasks that require strong\nretrieval ability to pinpoint relevant examples, and (ii) global context\nunderstanding tasks that necessitate a deeper comprehension of the full input.\nWe find that not all datasets can effectively evaluate these long-context\ncapabilities. To address this gap, we introduce a new many-shot ICL benchmark,\nMANYICLBENCH, designed to characterize LCLMs' retrieval and global context\nunderstanding capabilities separately. Benchmarking 11 open-weight LCLMs with\nMANYICLBENCH, we find that while state-of-the-art models perform well in\nretrieval tasks up to 64k tokens, many show significant drops in global context\ntasks at just 16k tokens.", "paper_summary_zh": "<paragraph>語言模型 (LM) 已展現出處理長語境資訊的進步能力，但現有的長語境基準主要測量 LM 的擷取能力，輸入內容較長，例如從長篇文字中精確找出短語。因此，在評估模型的整體語境理解能力時，例如綜合和推理輸入中的內容以產生回應，這些基準可能會不足。在本文中，我們透過多輪次語境中學習 (ICL) 研究長語境語言模型 (LCLM) 評估。具體來說，我們找出每個 ICL 任務所需的技能，並檢視模型在這些技能上的長語境能力。我們首先詢問：哪些類型的 ICL 任務可以從額外的示範中受益，這些任務在評估 LCLM 時是否有效？我們發現分類和摘要任務在額外的示範中表現出顯著的進步，而翻譯和推理任務並未展現出明確的趨勢。這表示分類任務主要測試模型的擷取技能。接下來，我們詢問：每個任務在多大程度上需要 LCLM 的擷取技能和整體語境理解？我們開發指標將 ICL 任務分類為兩組：(i) 需要強大擷取能力來精確找出相關範例的擷取任務，以及 (ii) 需要更深入理解完整輸入的整體語境理解任務。我們發現並非所有資料集都能有效評估這些長語境能力。為了解決這個差距，我們引進一個新的多輪次 ICL 基準，MANYICLBENCH，旨在分別描述 LCLM 的擷取和整體語境理解能力。使用 MANYICLBENCH 對 11 個開放權重的 LCLM 進行基準測試，我們發現雖然最先進的模型在長達 64k 個詞彙的擷取任務中表現良好，但許多模型在僅 16k 個詞彙的整體語境任務中顯著下降。</paragraph>", "author": "Kaijian Zou et.al.", "authors": "Kaijian Zou, Muhammad Khalifa, Lu Wang", "id": "2411.07130v1", "paper_url": "http://arxiv.org/abs/2411.07130v1", "repo": "null"}}