{"2502.10250": {"publish_time": "2025-02-14", "title": "VisCon-100K: Leveraging Contextual Web Data for Fine-tuning Vision Language Models", "paper_summary": "Vision-language models (VLMs) excel in various visual benchmarks but are\noften constrained by the lack of high-quality visual fine-tuning data. To\naddress this challenge, we introduce VisCon-100K, a novel dataset derived from\ninterleaved image-text web documents. Our approach transforms 45K web documents\nfrom the OBELICS dataset into 100K image conversation samples. We utilize\nGPT-4V to generate image-contextual captions and OpenChat 3.5 model to convert\nthese captions into diverse free-form and multiple-choice question-answer\npairs. Integrating this dataset for fine-tuning considerably enhances VLM\nperformance across multiple benchmarks. Unlike methods that focus solely on\nfine-grained visual content, our approach leverages accompanying web context,\nyielding superior results. We also discover that a `leaky modality mix,' where\nconversation samples contain questions answerable from both the image and its\ncontextual caption, outperforms non-leaky combinations of captions and Q\\&A\npairs. VisCon-100k dataset shows strong performance with two popular VLM\napproaches: text-only large language model (LLM) aligned with a vision encoder\nusing image captions data (ShareGPT4V-7b) and multimodally pretrained LLM\n(IDEFICS2-8b) using interleaved image-text data. In addition to releasing the\nVisCon-100K dataset, we provide a contextual captioner trained on this dataset,\nfacilitating scalable fine-tuning data generation for future research and\nopen-source applications. Using the same pipeline, but substituting our trained\ncontextual captioner for GPT-4V, we also release the larger VisCon-1M dataset.", "paper_summary_zh": "視覺語言模型 (VLM) 在各種視覺基準測試中表現出色，但往往受到缺乏高品質視覺微調資料的限制。為了應對這個挑戰，我們引進 VisCon-100K，這是一個從交錯圖像文字網路文件中衍生的新資料集。我們的做法將 OBELICS 資料集中的 45K 網路文件轉換成 100K 的圖像對話範例。我們利用 GPT-4V 產生圖像情境標題，並使用 OpenChat 3.5 模型將這些標題轉換成多樣化的自由形式和多選題問答配對。整合這個資料集進行微調，大幅提升了 VLM 在多個基準測試中的表現。與僅專注於細微視覺內容的方法不同，我們的做法利用了隨附的網路情境，產生了更優異的結果。我們還發現「外洩的模式組合」，其中對話範例包含可從圖像及其情境標題回答的問題，其表現優於標題和問答配對的非外洩組合。VisCon-100k 資料集在兩種流行的 VLM 方法中表現出色：與使用圖像標題資料 (ShareGPT4V-7b) 的視覺編碼器對齊的純文字大型語言模型 (LLM)，以及使用交錯圖像文字資料的多模態預訓練 LLM (IDEFICS2-8b)。除了釋出 VisCon-100K 資料集，我們還提供了一個在這個資料集上訓練的情境標題產生器，促進了可擴充微調資料的產生，以利未來的研究和開源應用。使用相同的管道，但將我們訓練的情境標題產生器替換為 GPT-4V，我們也釋出了較大的 VisCon-1M 資料集。", "author": "Gokul Karthik Kumar et.al.", "authors": "Gokul Karthik Kumar, Iheb Chaabane, Kebin Wu", "id": "2502.10250v1", "paper_url": "http://arxiv.org/abs/2502.10250v1", "repo": "null"}}