{"2502.04366": {"publish_time": "2025-02-05", "title": "Contrastive Token-level Explanations for Graph-based Rumour Detection", "paper_summary": "The widespread use of social media has accelerated the dissemination of\ninformation, but it has also facilitated the spread of harmful rumours, which\ncan disrupt economies, influence political outcomes, and exacerbate public\nhealth crises, such as the COVID-19 pandemic. While Graph Neural Network\n(GNN)-based approaches have shown significant promise in automated rumour\ndetection, they often lack transparency, making their predictions difficult to\ninterpret. Existing graph explainability techniques fall short in addressing\nthe unique challenges posed by the dependencies among feature dimensions in\nhigh-dimensional text embeddings used in GNN-based models. In this paper, we\nintroduce Contrastive Token Layerwise Relevance Propagation (CT-LRP), a novel\nframework designed to enhance the explainability of GNN-based rumour detection.\nCT-LRP extends current graph explainability methods by providing token-level\nexplanations that offer greater granularity and interpretability. We evaluate\nthe effectiveness of CT-LRP across multiple GNN models trained on three\npublicly available rumour detection datasets, demonstrating that it\nconsistently produces high-fidelity, meaningful explanations, paving the way\nfor more robust and trustworthy rumour detection systems.", "paper_summary_zh": "社群媒體的廣泛使用加速了資訊的傳播，但也促进了有害謠言的散播，這可能會擾亂經濟、影響政治結果，並加劇公共衛生危機，例如 COVID-19 大流行。雖然基於圖神經網路 (GNN) 的方法在自動化謠言偵測方面展現了顯著的前景，但它們通常缺乏透明度，這使得它們的預測難以解釋。現有的圖形可解釋性技術無法解決 GNN 模型中使用的維度嵌入式文本之間的依賴性所帶來的獨特挑戰。在本文中，我們介紹了對比標記分層關聯性傳播 (CT-LRP)，這是一個新穎的框架，旨在增強基於 GNN 的謠言偵測的可解釋性。CT-LRP 透過提供標記級別的解釋來擴充當前的圖形可解釋性方法，這些解釋提供了更細緻的粒度和可解釋性。我們在三個公開的謠言偵測資料集上訓練的幾個 GNN 模型中評估了 CT-LRP 的有效性，證明它始終產生高保真、有意義的解釋，為更強健且值得信賴的謠言偵測系統鋪路。", "author": "Daniel Wai Kit Chin et.al.", "authors": "Daniel Wai Kit Chin, Roy Ka-Wei Lee", "id": "2502.04366v1", "paper_url": "http://arxiv.org/abs/2502.04366v1", "repo": "null"}}