{"2412.06144": {"publish_time": "2024-12-09", "title": "Hate Speech According to the Law: An Analysis for Effective Detection", "paper_summary": "The issue of hate speech extends beyond the confines of the online realm. It\nis a problem with real-life repercussions, prompting most nations to formulate\nlegal frameworks that classify hate speech as a punishable offence. These legal\nframeworks differ from one country to another, contributing to the big chaos\nthat online platforms have to face when addressing reported instances of hate\nspeech. With the definitions of hate speech falling short in introducing a\nrobust framework, we turn our gaze onto hate speech laws. We consult the\nopinion of legal experts on a hate speech dataset and we experiment by\nemploying various approaches such as pretrained models both on hate speech and\nlegal data, as well as exploiting two large language models (Qwen2-7B-Instruct\nand Meta-Llama-3-70B). Due to the time-consuming nature of data acquisition for\nprosecutable hate speech, we use pseudo-labeling to improve our pretrained\nmodels. This study highlights the importance of amplifying research on\nprosecutable hate speech and provides insights into effective strategies for\ncombating hate speech within the parameters of legal frameworks. Our findings\nshow that legal knowledge in the form of annotations can be useful when\nclassifying prosecutable hate speech, yet more focus should be paid on the\ndifferences between the laws.", "paper_summary_zh": "仇恨言論的問題已超出網路領域的範疇。它是一個具有現實後果的問題，促使大多數國家制定將仇恨言論歸類為可處罰罪行的法律架構。這些法律架構因國家而異，導致線上平台在處理仇恨言論的通報個案時面臨巨大的混亂。由於仇恨言論的定義未能提出一個強而有力的架構，我們將目光轉向仇恨言論法。我們諮詢法律專家對仇恨言論資料集的意見，並透過採用各種方法進行實驗，例如在仇恨言論和法律資料上預先訓練的模型，以及利用兩個大型語言模型（Qwen2-7B-Instruct 和 Meta-Llama-3-70B）。由於可起訴仇恨言論的資料取得本質上耗時，我們使用偽標籤來改善我們的預訓練模型。這項研究強調了擴大對可起訴仇恨言論的研究的重要性，並提供了在法律架構參數內打擊仇恨言論的有效策略見解。我們的研究結果顯示，註解形式的法律知識在對可起訴仇恨言論進行分類時可能很有用，但應更多關注法律之間的差異。", "author": "Katerina Korre et.al.", "authors": "Katerina Korre, John Pavlopoulos, Paolo Gajo, Alberto Barrón-Cedeño", "id": "2412.06144v1", "paper_url": "http://arxiv.org/abs/2412.06144v1", "repo": "null"}}