{"2406.17975": {"publish_time": "2024-06-25", "title": "Inherent Challenges of Post-Hoc Membership Inference for Large Language Models", "paper_summary": "Large Language Models (LLMs) are often trained on vast amounts of undisclosed\ndata, motivating the development of post-hoc Membership Inference Attacks\n(MIAs) to gain insight into their training data composition. However, in this\npaper, we identify inherent challenges in post-hoc MIA evaluation due to\npotential distribution shifts between collected member and non-member datasets.\nUsing a simple bag-of-words classifier, we demonstrate that datasets used in\nrecent post-hoc MIAs suffer from significant distribution shifts, in some cases\nachieving near-perfect distinction between members and non-members. This\nimplies that previously reported high MIA performance may be largely\nattributable to these shifts rather than model memorization. We confirm that\nrandomized, controlled setups eliminate such shifts and thus enable the\ndevelopment and fair evaluation of new MIAs. However, we note that such\nrandomized setups are rarely available for the latest LLMs, making post-hoc\ndata collection still required to infer membership for real-world LLMs. As a\npotential solution, we propose a Regression Discontinuity Design (RDD) approach\nfor post-hoc data collection, which substantially mitigates distribution\nshifts. Evaluating various MIA methods on this RDD setup yields performance\nbarely above random guessing, in stark contrast to previously reported results.\nOverall, our findings highlight the challenges in accurately measuring LLM\nmemorization and the need for careful experimental design in (post-hoc)\nmembership inference tasks.", "paper_summary_zh": "大型語言模型 (LLM) 通常在大量未公開的數據上進行訓練，這促使開發事後成員推論攻擊 (MIA) 以深入了解其訓練數據組成。然而，在本文中，我們發現由於收集的成員和非成員數據集之間潛在的分布轉移，事後 MIA 評估存在固有的挑戰。使用一個簡單的詞袋分類器，我們證明了最近的事後 MIA 中使用的數據集存在顯著的分布轉移，在某些情況下，在成員和非成員之間實現了近乎完美的區別。這意味著先前報告的高 MIA 性能可能在很大程度上歸因於這些轉移，而不是模型記憶。我們確認隨機控制的設置消除了這種轉移，從而能夠開發和公平評估新的 MIA。然而，我們注意到這種隨機設置對於最新的 LLM 來說很少見，這使得事後數據收集仍然需要推斷現實世界 LLM 的成員資格。作為一個潛在的解決方案，我們提出了一個回歸不連續性設計 (RDD) 方法，用於事後數據收集，這大大減輕了分佈轉移。在這個 RDD 設置上評估各種 MIA 方法產生的性能僅略高於隨機猜測，這與先前報告的結果形成鮮明對比。總的來說，我們的發現突出了準確測量 LLM 記憶的挑戰，以及在（事後）成員推論任務中仔細進行實驗設計的必要性。", "author": "Matthieu Meeus et.al.", "authors": "Matthieu Meeus, Shubham Jain, Marek Rei, Yves-Alexandre de Montjoye", "id": "2406.17975v1", "paper_url": "http://arxiv.org/abs/2406.17975v1", "repo": "null"}}