{"2408.13091": {"publish_time": "2024-08-23", "title": "Analysis of child development facts and myths using text mining techniques and classification models", "paper_summary": "The rapid dissemination of misinformation on the internet complicates the\ndecision-making process for individuals seeking reliable information,\nparticularly parents researching child development topics. This misinformation\ncan lead to adverse consequences, such as inappropriate treatment of children\nbased on myths. While previous research has utilized text-mining techniques to\npredict child abuse cases, there has been a gap in the analysis of child\ndevelopment myths and facts. This study addresses this gap by applying text\nmining techniques and classification models to distinguish between myths and\nfacts about child development, leveraging newly gathered data from publicly\navailable websites. The research methodology involved several stages. First,\ntext mining techniques were employed to pre-process the data, ensuring enhanced\naccuracy. Subsequently, the structured data was analysed using six robust\nMachine Learning (ML) classifiers and one Deep Learning (DL) model, with two\nfeature extraction techniques applied to assess their performance across three\ndifferent training-testing splits. To ensure the reliability of the results,\ncross-validation was performed using both k-fold and leave-one-out methods.\nAmong the classification models tested, Logistic Regression (LR) demonstrated\nthe highest accuracy, achieving a 90% accuracy with the Bag-of-Words (BoW)\nfeature extraction technique. LR stands out for its exceptional speed and\nefficiency, maintaining low testing time per statement (0.97 microseconds).\nThese findings suggest that LR, when combined with BoW, is effective in\naccurately classifying child development information, thus providing a valuable\ntool for combating misinformation and assisting parents in making informed\ndecisions.", "paper_summary_zh": "<paragraph>網路上錯誤訊息快速傳播，讓尋求可靠資訊的個人難以做決策，特別是正在研究兒童發展主題的父母。這些錯誤訊息可能導致不良後果，例如根據迷思對兒童進行不當的對待。雖然先前的研究已利用文字探勘技術來預測虐待兒童的案例，但在分析兒童發展迷思與事實方面仍有差距。本研究透過應用文字探勘技術與分類模型來區分兒童發展的迷思與事實，並利用從公開網站收集的新資料來解決此差距。研究方法包含幾個階段。首先，採用文字探勘技術來預處理資料，確保精確度。接著，使用六種強大的機器學習 (ML) 分類器和一個深度學習 (DL) 模型來分析結構化的資料，並應用兩種特徵萃取技術來評估它們在三個不同的訓練測試分割中的表現。為了確保結果的可靠性，使用 k 折和留一法執行交叉驗證。在測試的分類模型中，邏輯迴歸 (LR) 展現最高的精確度，使用詞袋 (BoW) 特徵萃取技術時達到 90% 的精確度。LR 以其出色的速度和效率而突出，每個陳述的測試時間很短 (0.97 微秒)。這些發現顯示，LR 與 BoW 結合時，能有效且精確地分類兒童發展資訊，因此提供一個有價值的工具來打擊錯誤訊息，並協助父母做出明智的決定。</paragraph>", "author": "Mehedi Tajrian et.al.", "authors": "Mehedi Tajrian, Azizur Rahman, Muhammad Ashad Kabir, Md Rafiqul Islam", "id": "2408.13091v1", "paper_url": "http://arxiv.org/abs/2408.13091v1", "repo": "null"}}