{"2411.01947": {"publish_time": "2024-11-04", "title": "HACD: Harnessing Attribute Semantics and Mesoscopic Structure for Community Detection", "paper_summary": "Community detection plays a pivotal role in uncovering closely connected\nsubgraphs, aiding various real-world applications such as recommendation\nsystems and anomaly detection. With the surge of rich information available for\nentities in real-world networks, the community detection problem in attributed\nnetworks has attracted widespread attention. While previous research has\neffectively leveraged network topology and attribute information for attributed\ncommunity detection, these methods overlook two critical issues: (i) the\nsemantic similarity between node attributes within the community, and (ii) the\ninherent mesoscopic structure, which differs from the pairwise connections of\nthe micro-structure. To address these limitations, we propose HACD, a novel\nattributed community detection model based on heterogeneous graph attention\nnetworks. HACD treats node attributes as another type of node, constructs\nattributed networks into heterogeneous graph structures and employs\nattribute-level attention mechanisms to capture semantic similarity.\nFurthermore, HACD introduces a community membership function to explore\nmesoscopic community structures, enhancing the robustness of detected\ncommunities. Extensive experiments demonstrate the effectiveness and efficiency\nof HACD, outperforming state-of-the-art methods in attributed community\ndetection tasks. Our code is publicly available at\nhttps://github.com/Anniran1/HACD1-wsdm.", "paper_summary_zh": "社群偵測在揭露緊密連結的子圖中扮演著舉足輕重的角色，協助各種實際應用，例如推薦系統和異常偵測。隨著實際世界網路中實體可用的豐富資訊激增，屬性網路中的社群偵測問題引起了廣泛關注。雖然先前的研究已有效利用網路拓撲和屬性資訊來進行屬性社群偵測，但這些方法忽略了兩個關鍵問題：(i) 社群內節點屬性之間的語意相似性，以及 (ii) 與微結構的成對連接不同的固有中觀結構。為了解決這些限制，我們提出了 HACD，一種基於異質圖注意力網路的新型屬性社群偵測模型。HACD 將節點屬性視為另一種節點類型，將屬性網路建構為異質圖結構，並採用屬性層級注意力機制來擷取語意相似性。此外，HACD 引入了社群成員資格函數來探索中觀社群結構，增強了已偵測社群的穩健性。廣泛的實驗證明了 HACD 的有效性和效率，在屬性社群偵測任務中優於最先進的方法。我們的程式碼可在 https://github.com/Anniran1/HACD1-wsdm 公開取得。", "author": "Anran Zhang et.al.", "authors": "Anran Zhang, Xingfen Wang, Yuhan Zhao", "id": "2411.01947v1", "paper_url": "http://arxiv.org/abs/2411.01947v1", "repo": "https://github.com/anniran1/hacd1-wsdm"}}