{"2405.15436": {"publish_time": "2024-05-24", "title": "Hybrid Context Retrieval Augmented Generation Pipeline: LLM-Augmented Knowledge Graphs and Vector Database for Accreditation Reporting Assistance", "paper_summary": "In higher education, accreditation is a quality assurance process, where an\ninstitution demonstrates a commitment to delivering high quality programs and\nservices to their students. For business schools nationally and internationally\nthe Association to Advance Collegiate Schools of Business (AACSB) accreditation\nis the gold standard. For a business school to receive and subsequently\nmaintain accreditation, the school must undertake a rigorous, time consuming\nreporting and peer review process, to demonstrate alignment with the AACSB\nStandards. For this project we create a hybrid context retrieval augmented\ngeneration pipeline that can assist in the documentation alignment and\nreporting process necessary for accreditation. We implement both a vector\ndatabase and knowledge graph, as knowledge stores containing both institutional\ndata and AACSB Standard data. The output of the pipeline can be used by\ninstitution stakeholders to build their accreditation report, dually grounded\nby the context from the knowledge stores. To develop our knowledge graphs we\nutilized both a manual construction process as well as an LLM Augmented\nKnowledge Graph approach. We evaluated the pipeline using the RAGAs framework\nand observed optimal performance on answer relevancy and answer correctness\nmetrics.", "paper_summary_zh": "在高等教育中，認證是一種品質保證程序，機構在此程序中展現對提供高品質計畫和服務給學生的承諾。對於國內和國際商學院而言，國際商管學院促進協會 (AACSB) 認證是黃金標準。商學院若要取得並維持認證，學校必須進行嚴格且耗時的報告和同儕審查程序，以證明符合 AACSB 標準。在這個專案中，我們建立了一個混合式脈絡擷取增強式產生管線，可以協助認證所需的說明文件對齊和報告程序。我們實作了向量資料庫和知識圖譜，作為包含機構資料和 AACSB 標準資料的知識儲存。管線的輸出可供機構利害關係人用於建構其認證報告，並由知識儲存中的脈絡雙重依據。為了開發我們的知識圖譜，我們利用了手動建構程序和 LLM 增強知識圖譜方法。我們使用 RAGAs 架構評估管線，並觀察到在答案相關性和答案正確性指標上獲得最佳效能。", "author": "Candace Edwards et.al.", "authors": "Candace Edwards", "id": "2405.15436v1", "paper_url": "http://arxiv.org/abs/2405.15436v1", "repo": "https://github.com/cs-edwards/advrag"}}