{"2407.15780": {"publish_time": "2024-07-22", "title": "Explaining Decisions in ML Models: a Parameterized Complexity Analysis", "paper_summary": "This paper presents a comprehensive theoretical investigation into the\nparameterized complexity of explanation problems in various machine learning\n(ML) models. Contrary to the prevalent black-box perception, our study focuses\non models with transparent internal mechanisms. We address two principal types\nof explanation problems: abductive and contrastive, both in their local and\nglobal variants. Our analysis encompasses diverse ML models, including Decision\nTrees, Decision Sets, Decision Lists, Ordered Binary Decision Diagrams, Random\nForests, and Boolean Circuits, and ensembles thereof, each offering unique\nexplanatory challenges. This research fills a significant gap in explainable AI\n(XAI) by providing a foundational understanding of the complexities of\ngenerating explanations for these models. This work provides insights vital for\nfurther research in the domain of XAI, contributing to the broader discourse on\nthe necessity of transparency and accountability in AI systems.", "paper_summary_zh": "本文對各種機器學習 (ML) 模型中解釋問題的參數化複雜性進行了全面的理論研究。與普遍的黑盒感知相反，我們的研究重點在於具有透明內部機制的模型。我們探討了兩種主要的解釋問題類型：演繹和對比，包括它們的局部和全局變體。我們的分析涵蓋了各種 ML 模型，包括決策樹、決策集、決策列表、有序二元決策圖、隨機森林和布林電路及其集合，每個都提供了獨特的解釋挑戰。本研究填補了可解釋 AI (XAI) 的一個重大空白，提供了對這些模型生成解釋的複雜性的基礎理解。這項工作為 XAI 領域的進一步研究提供了至關重要的見解，為關於 AI 系統中透明度和問責制必要性的廣泛討論做出了貢獻。", "author": "Sebastian Ordyniak et.al.", "authors": "Sebastian Ordyniak, Giacomo Paesani, Mateusz Rychlicki, Stefan Szeider", "id": "2407.15780v1", "paper_url": "http://arxiv.org/abs/2407.15780v1", "repo": "null"}}