{"2501.08523": {"publish_time": "2025-01-15", "title": "Doc-Guided Sent2Sent++: A Sent2Sent++ Agent with Doc-Guided memory for Document-level Machine Translation", "paper_summary": "The field of artificial intelligence has witnessed significant advancements\nin natural language processing, largely attributed to the capabilities of Large\nLanguage Models (LLMs). These models form the backbone of Agents designed to\naddress long-context dependencies, particularly in Document-level Machine\nTranslation (DocMT). DocMT presents unique challenges, with quality,\nconsistency, and fluency being the key metrics for evaluation. Existing\napproaches, such as Doc2Doc and Doc2Sent, either omit sentences or compromise\nfluency. This paper introduces Doc-Guided Sent2Sent++, an Agent that employs an\nincremental sentence-level forced decoding strategy \\textbf{to ensure every\nsentence is translated while enhancing the fluency of adjacent sentences.} Our\nAgent leverages a Doc-Guided Memory, focusing solely on the summary and its\ntranslation, which we find to be an efficient approach to maintaining\nconsistency. Through extensive testing across multiple languages and domains,\nwe demonstrate that Sent2Sent++ outperforms other methods in terms of quality,\nconsistency, and fluency. The results indicate that, our approach has achieved\nsignificant improvements in metrics such as s-COMET, d-COMET, LTCR-$1_f$, and\ndocument-level perplexity (d-ppl). The contributions of this paper include a\ndetailed analysis of current DocMT research, the introduction of the\nSent2Sent++ decoding method, the Doc-Guided Memory mechanism, and validation of\nits effectiveness across languages and domains.", "paper_summary_zh": "人工智能领域见证了自然语言处理的重大进展，这在很大程度上归功于大型语言模型 (LLM) 的能力。这些模型构成了代理的基础，旨在解决长上下文依赖性，尤其是在文档级机器翻译 (DocMT) 中。DocMT 呈现出独特的挑战，其中质量、一致性和流畅性是评估的关键指标。现有的方法，例如 Doc2Doc 和 Doc2Sent，要么省略句子，要么影响流畅性。本文介绍了 Doc-Guided Sent2Sent++，这是一个采用增量句子级强制解码策略的代理，以确保翻译每个句子，同时增强相邻句子的流畅性。我们的代理利用 Doc-Guided Memory，仅关注摘要及其翻译，我们发现这是一种保持一致性的有效方法。通过跨多个语言和领域的广泛测试，我们证明 Sent2Sent++ 在质量、一致性和流畅性方面优于其他方法。结果表明，我们的方法在 s-COMET、d-COMET、LTCR-$1_f$ 和文档级困惑度 (d-ppl) 等指标方面取得了显着改进。本文的贡献包括对当前 DocMT 研究的详细分析、Sent2Sent++ 解码方法的介绍、Doc-Guided Memory 机制，以及跨语言和领域的有效性验证。", "author": "Jiaxin Guo et.al.", "authors": "Jiaxin Guo, Yuanchang Luo, Daimeng Wei, Ling Zhang, Zongyao Li, Hengchao Shang, Zhiqiang Rao, Shaojun Li, Jinlong Yang, Zhanglin Wu, Hao Yang", "id": "2501.08523v1", "paper_url": "http://arxiv.org/abs/2501.08523v1", "repo": "null"}}