{"2406.17636": {"publish_time": "2024-06-25", "title": "Aligning Diffusion Models with Noise-Conditioned Perception", "paper_summary": "Recent advancements in human preference optimization, initially developed for\nLanguage Models (LMs), have shown promise for text-to-image Diffusion Models,\nenhancing prompt alignment, visual appeal, and user preference. Unlike LMs,\nDiffusion Models typically optimize in pixel or VAE space, which does not align\nwell with human perception, leading to slower and less efficient training\nduring the preference alignment stage. We propose using a perceptual objective\nin the U-Net embedding space of the diffusion model to address these issues.\nOur approach involves fine-tuning Stable Diffusion 1.5 and XL using Direct\nPreference Optimization (DPO), Contrastive Preference Optimization (CPO), and\nsupervised fine-tuning (SFT) within this embedding space. This method\nsignificantly outperforms standard latent-space implementations across various\nmetrics, including quality and computational cost. For SDXL, our approach\nprovides 60.8\\% general preference, 62.2\\% visual appeal, and 52.1\\% prompt\nfollowing against original open-sourced SDXL-DPO on the PartiPrompts dataset,\nwhile significantly reducing compute. Our approach not only improves the\nefficiency and quality of human preference alignment for diffusion models but\nis also easily integrable with other optimization techniques. The training code\nand LoRA weights will be available here:\nhttps://huggingface.co/alexgambashidze/SDXL\\_NCP-DPO\\_v0.1", "paper_summary_zh": "最近在人類偏好最佳化方面的進展，最初是為語言模型 (LM) 開發的，已顯示出對文字到影像的擴散模型很有前景，增強提示對齊、視覺吸引力和用戶偏好。與 LM 不同，擴散模型通常在像素或 VAE 空間中進行最佳化，這與人類感知不符，導致在偏好對齊階段訓練更慢且效率更低。我們建議在擴散模型的 U-Net 嵌入空間中使用感知目標來解決這些問題。我們的做法包括使用直接偏好最佳化 (DPO)、對比偏好最佳化 (CPO) 和在這個嵌入空間內的監督式微調 (SFT) 來微調 Stable Diffusion 1.5 和 XL。這種方法在各種指標上明顯優於標準的潛在空間實作，包括品質和運算成本。對於 SDXL，我們的方法在 PartiPrompts 資料集上提供 60.8% 的一般偏好、62.2% 的視覺吸引力和 52.1% 的提示遵循，同時顯著減少運算。我們的做法不僅提高了擴散模型的人類偏好對齊的效率和品質，而且很容易與其他最佳化技術整合。訓練程式碼和 LoRA 權重將在此處提供：\nhttps://huggingface.co/alexgambashidze/SDXL\\_NCP-DPO\\_v0.1", "author": "Alexander Gambashidze et.al.", "authors": "Alexander Gambashidze, Anton Kulikov, Yuriy Sosnin, Ilya Makarov", "id": "2406.17636v1", "paper_url": "http://arxiv.org/abs/2406.17636v1", "repo": "null"}}