{"2407.19985": {"publish_time": "2024-07-29", "title": "Mixture of Nested Experts: Adaptive Processing of Visual Tokens", "paper_summary": "The visual medium (images and videos) naturally contains a large amount of\ninformation redundancy, thereby providing a great opportunity for leveraging\nefficiency in processing. While Vision Transformer (ViT) based models scale\neffectively to large data regimes, they fail to capitalize on this inherent\nredundancy, leading to higher computational costs. Mixture of Experts (MoE)\nnetworks demonstrate scalability while maintaining same inference-time costs,\nbut they come with a larger parameter footprint. We present Mixture of Nested\nExperts (MoNE), which utilizes a nested structure for experts, wherein\nindividual experts fall on an increasing compute-accuracy curve. Given a\ncompute budget, MoNE learns to dynamically choose tokens in a priority order,\nand thus redundant tokens are processed through cheaper nested experts. Using\nthis framework, we achieve equivalent performance as the baseline models, while\nreducing inference time compute by over two-fold. We validate our approach on\nstandard image and video datasets - ImageNet-21K, Kinetics400, and\nSomething-Something-v2. We further highlight MoNE$'$s adaptability by\nshowcasing its ability to maintain strong performance across different\ninference-time compute budgets on videos, using only a single trained model.", "paper_summary_zh": "視覺媒體（影像和影片）自然包含大量的資訊冗餘，因此提供了提升處理效率的絕佳機會。雖然基於視覺轉換器 (ViT) 的模型有效地擴展到大型資料模式，但它們未能利用這種固有的冗餘，導致更高的運算成本。專家混合 (MoE) 網路展示了可擴展性，同時維持相同的推論時間成本，但它們伴隨著更大的參數佔用空間。我們提出了嵌套專家混合 (MoNE)，它利用嵌套結構作為專家，其中個別專家落在逐漸增加的運算準確度曲線上。在給定的運算預算下，MoNE 學會以優先順序動態選擇代幣，因此透過較便宜的嵌套專家處理冗餘代幣。使用這個架構，我們達到了與基準模型相當的效能，同時將推論時間運算減少了一倍以上。我們在標準影像和影片資料集（ImageNet-21K、Kinetics400 和 Something-Something-v2）上驗證了我們的做法。我們進一步強調了 MoNE 的適應性，展示了它在影片上跨不同推論時間運算預算維持強大效能的能力，僅使用單一訓練模型。", "author": "Gagan Jain et.al.", "authors": "Gagan Jain, Nidhi Hegde, Aditya Kusupati, Arsha Nagrani, Shyamal Buch, Prateek Jain, Anurag Arnab, Sujoy Paul", "id": "2407.19985v1", "paper_url": "http://arxiv.org/abs/2407.19985v1", "repo": "null"}}