{"2409.19676": {"publish_time": "2024-09-29", "title": "See Detail Say Clear: Towards Brain CT Report Generation via Pathological Clue-driven Representation Learning", "paper_summary": "Brain CT report generation is significant to aid physicians in diagnosing\ncranial diseases. Recent studies concentrate on handling the consistency\nbetween visual and textual pathological features to improve the coherence of\nreport. However, there exist some challenges: 1) Redundant visual representing:\nMassive irrelevant areas in 3D scans distract models from representing salient\nvisual contexts. 2) Shifted semantic representing: Limited medical corpus\ncauses difficulties for models to transfer the learned textual representations\nto generative layers. This study introduces a Pathological Clue-driven\nRepresentation Learning (PCRL) model to build cross-modal representations based\non pathological clues and naturally adapt them for accurate report generation.\nSpecifically, we construct pathological clues from perspectives of segmented\nregions, pathological entities, and report themes, to fully grasp visual\npathological patterns and learn cross-modal feature representations. To adapt\nthe representations for the text generation task, we bridge the gap between\nrepresentation learning and report generation by using a unified large language\nmodel (LLM) with task-tailored instructions. These crafted instructions enable\nthe LLM to be flexibly fine-tuned across tasks and smoothly transfer the\nsemantic representation for report generation. Experiments demonstrate that our\nmethod outperforms previous methods and achieves SoTA performance. Our code is\navailable at \"https://github.com/Chauncey-Jheng/PCRL-MRG\".", "paper_summary_zh": "腦部電腦斷層掃描報告生成有助於醫生診斷顱骨疾病。最近的研究專注於處理視覺和文字病理特徵之間的一致性，以提高報告的一致性。然而，存在一些挑戰：1) 多餘的視覺表示：3D 掃描中的大量無關區域會分散模型對顯著視覺背景的表示。2) 轉移的語義表示：有限的醫學語料庫導致模型難以將學習到的文字表示轉移到生成層。本研究引入了病理線索驅動表示學習 (PCRL) 模型，基於病理線索構建跨模態表示，並自然地調整它們以進行準確的報告生成。具體來說，我們從分割區域、病理實體和報告主題的角度構建病理線索，以充分掌握視覺病理模式並學習跨模態特徵表示。為了調整表示以適應文本生成任務，我們通過使用具有任務定制指令的統一大型語言模型 (LLM) 來彌合表示學習和報告生成之間的差距。這些精心製作的指令使 LLM 能夠靈活地跨任務進行微調，並順利地將語義表示轉移到報告生成中。實驗表明，我們的模型優於先前的模型，並達到了最先進的性能。我們的程式碼可在「https://github.com/Chauncey-Jheng/PCRL-MRG」取得。", "author": "Chengxin Zheng et.al.", "authors": "Chengxin Zheng, Junzhong Ji, Yanzhao Shi, Xiaodan Zhang, Liangqiong Qu", "id": "2409.19676v2", "paper_url": "http://arxiv.org/abs/2409.19676v2", "repo": "https://github.com/chauncey-jheng/pcrl-mrg"}}