{"2408.13966": {"publish_time": "2024-08-26", "title": "Reducing the Cost: Cross-Prompt Pre-Finetuning for Short Answer Scoring", "paper_summary": "Automated Short Answer Scoring (SAS) is the task of automatically scoring a\ngiven input to a prompt based on rubrics and reference answers. Although SAS is\nuseful in real-world applications, both rubrics and reference answers differ\nbetween prompts, thus requiring a need to acquire new data and train a model\nfor each new prompt. Such requirements are costly, especially for schools and\nonline courses where resources are limited and only a few prompts are used. In\nthis work, we attempt to reduce this cost through a two-phase approach: train a\nmodel on existing rubrics and answers with gold score signals and finetune it\non a new prompt. Specifically, given that scoring rubrics and reference answers\ndiffer for each prompt, we utilize key phrases, or representative expressions\nthat the answer should contain to increase scores, and train a SAS model to\nlearn the relationship between key phrases and answers using already annotated\nprompts (i.e., cross-prompts). Our experimental results show that finetuning on\nexisting cross-prompt data with key phrases significantly improves scoring\naccuracy, especially when the training data is limited. Finally, our extensive\nanalysis shows that it is crucial to design the model so that it can learn the\ntask's general property.", "paper_summary_zh": "自動化簡答評分（SAS）是根據評分標準和參考答案自動評分給定提示輸入的任務。儘管 SAS 在實際應用中很有用，但評分標準和參考答案在提示之間有所不同，因此需要獲取新數據並為每個新提示訓練模型。這些要求成本很高，特別是對於資源有限且僅使用少數提示的學校和線上課程。在這項工作中，我們嘗試通過兩階段方法來降低此成本：使用黃金分數信號訓練模型，並在新的提示中對其進行微調。具體來說，鑑於評分標準和參考答案因提示而異，我們利用關鍵詞組或代表性表達式（答案應包含這些內容以提高分數），並訓練 SAS 模型使用已註解提示（即跨提示）學習關鍵詞組和答案之間的關係。我們的實驗結果表明，使用關鍵詞組對現有跨提示數據進行微調可以顯著提高評分準確度，特別是在訓練數據有限的情況下。最後，我們廣泛的分析表明，設計模型以使其能夠學習任務的一般屬性至關重要。", "author": "Hiroaki Funayama et.al.", "authors": "Hiroaki Funayama, Yuya Asazuma, Yuichiroh Matsubayashi, Tomoya Mizumoto, Kentaro Inui", "id": "2408.13966v1", "paper_url": "http://arxiv.org/abs/2408.13966v1", "repo": "null"}}