{"2405.15414": {"publish_time": "2024-05-24", "title": "Luban: Building Open-Ended Creative Agents via Autonomous Embodied Verification", "paper_summary": "Building open agents has always been the ultimate goal in AI research, and\ncreative agents are the more enticing. Existing LLM agents excel at\nlong-horizon tasks with well-defined goals (e.g., `mine diamonds' in\nMinecraft). However, they encounter difficulties on creative tasks with open\ngoals and abstract criteria due to the inability to bridge the gap between\nthem, thus lacking feedback for self-improvement in solving the task. In this\nwork, we introduce autonomous embodied verification techniques for agents to\nfill the gap, laying the groundwork for creative tasks. Specifically, we\npropose the Luban agent target creative building tasks in Minecraft, which\nequips with two-level autonomous embodied verification inspired by human design\npractices: (1) visual verification of 3D structural speculates, which comes\nfrom agent synthesized CAD modeling programs; (2) pragmatic verification of the\ncreation by generating and verifying environment-relevant functionality\nprograms based on the abstract criteria. Extensive multi-dimensional human\nstudies and Elo ratings show that the Luban completes diverse creative building\ntasks in our proposed benchmark and outperforms other baselines ($33\\%$ to\n$100\\%$) in both visualization and pragmatism. Additional demos on the\nreal-world robotic arm show the creation potential of the Luban in the physical\nworld.", "paper_summary_zh": "建立開放代理一直是人工智慧研究的終極目標，而富有創意的代理更是誘人。現有的 LLM 代理擅長於目標明確的長時程任務（例如 Minecraft 中的「開採鑽石」）。然而，由於無法彌合目標開放且標準抽象的創意任務之間的差距，他們在這些任務上會遇到困難，因此缺乏自我改善以解決任務的回饋。在這項工作中，我們引入了代理的自主具身驗證技術來填補差距，為創意任務奠定基礎。具體來說，我們提出了 Luban 代理目標 Minecraft 中的創意建築任務，它配備了受人類設計實務啟發的兩級自主具身驗證：(1) 3D 結構假設的視覺驗證，來自代理合成 CAD 建模程式；(2) 根據抽象標準產生並驗證與環境相關的功能程式的創作實用驗證。廣泛的多維度人類研究和 Elo 評分顯示，Luban 在我們提出的基準中完成了各種創意建築任務，並且在視覺化和實用性方面都優於其他基準（33% 到 100%）。在真實機器手臂上的其他示範顯示了 Luban 在物理世界中的創作潛力。", "author": "Yuxuan Guo et.al.", "authors": "Yuxuan Guo, Shaohui Peng, Jiaming Guo, Di Huang, Xishan Zhang, Rui Zhang, Yifan Hao, Ling Li, Zikang Tian, Mingju Gao, Yutai Li, Yiming Gan, Shuai Liang, Zihao Zhang, Zidong Du, Qi Guo, Xing Hu, Yunji Chen", "id": "2405.15414v1", "paper_url": "http://arxiv.org/abs/2405.15414v1", "repo": "null"}}