{"2409.16001": {"publish_time": "2024-09-24", "title": "Artificial Human Intelligence: The role of Humans in the Development of Next Generation AI", "paper_summary": "Human intelligence, the most evident and accessible form of source of\nreasoning, hosted by biological hardware, has evolved and been refined over\nthousands of years, positioning itself today to create new artificial forms and\npreparing to self--design their evolutionary path forward. Beginning with the\nadvent of foundation models, the rate at which human and artificial\nintelligence interact with each other has surpassed any anticipated\nquantitative figures. The close engagement led to both bits of intelligence to\nbe impacted in various ways, which naturally resulted in complex confluences\nthat warrant close scrutiny. In the sequel, we shall explore the interplay\nbetween human and machine intelligence, focusing on the crucial role humans\nplay in developing ethical, responsible, and robust intelligent systems. We\nslightly delve into interesting aspects of implementation inspired by the\nmechanisms underlying neuroscience and human cognition. Additionally, we\npropose future perspectives, capitalizing on the advantages of symbiotic\ndesigns to suggest a human-centered direction for next-generation AI\ndevelopment. We finalize this evolving document with a few thoughts and open\nquestions yet to be addressed by the broader community.", "paper_summary_zh": "人類智慧是推理最明顯且可得的來源形式，由生物硬體所承載，歷經數千年的演化與精進，如今已能創造出新的形式，並準備自行設計其未來的演化路徑。從基礎模型的出現開始，人類與人工智慧互動的速度已超越任何預期的數量數字。緊密的互動讓這兩種智慧以各種方式產生影響，自然而然地產生了複雜的匯流，值得仔細探究。在後續部分，我們將探討人類與機器智慧之間的交互作用，重點關注人類在開發倫理、負責任且強健的智慧系統中所扮演的關鍵角色。我們將稍微深入探討受神經科學和人類認知機制啟發的實作有趣面向。此外，我們提出未來的觀點，利用共生設計的優勢，為下一代 AI 發展提出以人為中心的方針。我們以一些想法和開放性問題為這份不斷演化的文件作結，這些問題仍有待更廣泛的社群來探討。", "author": "Suayb S. Arslan et.al.", "authors": "Suayb S. Arslan", "id": "2409.16001v1", "paper_url": "http://arxiv.org/abs/2409.16001v1", "repo": "null"}}