{"2502.21271": {"publish_time": "2025-02-28", "title": "Adaptive Keyframe Sampling for Long Video Understanding", "paper_summary": "Multimodal large language models (MLLMs) have enabled open-world visual\nunderstanding by injecting visual input as extra tokens into large language\nmodels (LLMs) as contexts. However, when the visual input changes from a single\nimage to a long video, the above paradigm encounters difficulty because the\nvast amount of video tokens has significantly exceeded the maximal capacity of\nMLLMs. Therefore, existing video-based MLLMs are mostly established upon\nsampling a small portion of tokens from input data, which can cause key\ninformation to be lost and thus produce incorrect answers. This paper presents\na simple yet effective algorithm named Adaptive Keyframe Sampling (AKS). It\ninserts a plug-and-play module known as keyframe selection, which aims to\nmaximize the useful information with a fixed number of video tokens. We\nformulate keyframe selection as an optimization involving (1) the relevance\nbetween the keyframes and the prompt, and (2) the coverage of the keyframes\nover the video, and present an adaptive algorithm to approximate the best\nsolution. Experiments on two long video understanding benchmarks validate that\nAdaptive Keyframe Sampling improves video QA accuracy (beyond strong baselines)\nupon selecting informative keyframes. Our study reveals the importance of\ninformation pre-filtering in video-based MLLMs. Code is available at\nhttps://github.com/ncTimTang/AKS.", "paper_summary_zh": "<paragraph>多模態大型語言模型 (MLLM) 能夠透過將視覺輸入作為額外的標記注入大型語言模型 (LLM) 作為上下文，從而實現開放世界的視覺理解。然而，當視覺輸入從單個圖像變為長影片時，上述模式就會遇到困難，因為大量的影片標記已大大超過 MLLM 的最大容量。因此，現有的基於影片的 MLLM 大多建立在從輸入數據中採樣一小部分標記的基礎上，這可能會導致關鍵信息的丟失，從而產生錯誤的答案。本文提出了一種簡單而有效的算法，稱為自適應關鍵幀採樣 (AKS)。它插入了一個稱為關鍵幀選擇的即插即用模組，旨在以固定數量的影片標記最大化有用信息。我們將關鍵幀選擇公式化為一個涉及 (1) 關鍵幀與提示之間的相關性，以及 (2) 關鍵幀對影片的覆蓋範圍的優化問題，並提出了一種自適應算法來逼近最佳解決方案。在兩個長影片理解基準上的實驗驗證，自適應關鍵幀採樣在選擇信息豐富的關鍵幀後，提高了影片問答的準確性（超越了強大的基準）。我們的研究揭示了信息預過濾在基於影片的 MLLM 中的重要性。程式碼可在 https://github.com/ncTimTang/AKS 獲得。</paragraph>\n", "author": "Xi Tang et.al.", "authors": "Xi Tang, Jihao Qiu, Lingxi Xie, Yunjie Tian, Jianbin Jiao, Qixiang Ye", "id": "2502.21271v1", "paper_url": "http://arxiv.org/abs/2502.21271v1", "repo": "null"}}