{"2406.09406": {"publish_time": "2024-06-13", "title": "4M-21: An Any-to-Any Vision Model for Tens of Tasks and Modalities", "paper_summary": "Current multimodal and multitask foundation models like 4M or UnifiedIO show\npromising results, but in practice their out-of-the-box abilities to accept\ndiverse inputs and perform diverse tasks are limited by the (usually rather\nsmall) number of modalities and tasks they are trained on. In this paper, we\nexpand upon the capabilities of them by training a single model on tens of\nhighly diverse modalities and by performing co-training on large-scale\nmultimodal datasets and text corpora. This includes training on several\nsemantic and geometric modalities, feature maps from recent state of the art\nmodels like DINOv2 and ImageBind, pseudo labels of specialist models like SAM\nand 4DHumans, and a range of new modalities that allow for novel ways to\ninteract with the model and steer the generation, for example image metadata or\ncolor palettes. A crucial step in this process is performing discrete\ntokenization on various modalities, whether they are image-like, neural network\nfeature maps, vectors, structured data like instance segmentation or human\nposes, or data that can be represented as text. Through this, we expand on the\nout-of-the-box capabilities of multimodal models and specifically show the\npossibility of training one model to solve at least 3x more tasks/modalities\nthan existing ones and doing so without a loss in performance. This enables\nmore fine-grained and controllable multimodal generation capabilities and\nallows us to study the distillation of models trained on diverse data and\nobjectives into a unified model. We successfully scale the training to a three\nbillion parameter model using tens of modalities and different datasets. The\nresulting models and training code are open sourced at 4m.epfl.ch.", "paper_summary_zh": "目前的 4M 或 UnifiedIO 等多模态和多任务基础模型显示出有希望的结果，但实际上，它们开箱即用的接受各种输入和执行各种任务的能力受到它们接受训练的模态和任务（通常相当少）数量的限制。在本文中，我们通过在数十种高度多样化的模态上训练单个模型，并在大规模多模态数据集和文本语料库上执行联合训练，扩展了它们的能力。这包括在几个语义和几何模态上进行训练，从 DINOv2 和 ImageBind 等最新模型的特征图，SAM 和 4DHumans 等专家模型的伪标签，以及一系列允许以新颖方式与模型交互和引导生成的新模态，例如图像元数据或调色板。此过程中的一个关键步骤是对各种模态执行离散标记化，无论它们是图像、神经网络特征图、向量、结构化数据（如实例分割或人体姿势），还是可以表示为文本的数据。通过此，我们扩展了多模态模型的开箱即用能力，并特别展示了训练一个模型来解决至少比现有模型多 3 倍的任务/模态的可能性，并且在不损失性能的情况下这样做。这实现了更细粒度和可控的多模态生成能力，并允许我们研究在不同数据和目标上训练的模型到统一模型的蒸馏。我们成功地将训练扩展到一个使用数十种模态和不同数据集的 30 亿参数模型。生成模型和训练代码在 4m.epfl.ch 开源。", "author": "Roman Bachmann et.al.", "authors": "Roman Bachmann, Oğuzhan Fatih Kar, David Mizrahi, Ali Garjani, Mingfei Gao, David Griffiths, Jiaming Hu, Afshin Dehghan, Amir Zamir", "id": "2406.09406v2", "paper_url": "http://arxiv.org/abs/2406.09406v2", "repo": "null"}}