{"2501.14679": {"publish_time": "2025-01-24", "title": "Surface Vision Mamba: Leveraging Bidirectional State Space Model for Efficient Spherical Manifold Representation", "paper_summary": "Attention-based methods have demonstrated exceptional performance in\nmodelling long-range dependencies on spherical cortical surfaces, surpassing\ntraditional Geometric Deep Learning (GDL) models. However, their extensive\ninference time and high memory demands pose challenges for application to large\ndatasets with limited computing resources. Inspired by the state space model in\ncomputer vision, we introduce the attention-free Vision Mamba (Vim) to\nspherical surfaces, presenting a domain-agnostic architecture for analyzing\ndata on spherical manifolds. Our method achieves surface patching by\nrepresenting spherical data as a sequence of triangular patches derived from a\nsubdivided icosphere. The proposed Surface Vision Mamba (SiM) is evaluated on\nmultiple neurodevelopmental phenotype regression tasks using cortical surface\nmetrics from neonatal brains. Experimental results demonstrate that SiM\noutperforms both attention- and GDL-based methods, delivering 4.8 times faster\ninference and achieving 91.7% lower memory consumption compared to the Surface\nVision Transformer (SiT) under the Ico-4 grid partitioning. Sensitivity\nanalysis further underscores the potential of SiM to identify subtle cognitive\ndevelopmental patterns. The code is available at\nhttps://github.com/Rongzhao-He/surface-vision-mamba.", "paper_summary_zh": "<paragraph>基於注意力的方法已證明在球形皮質表面上建模長程依賴性方面表現出色，超越了傳統的幾何深度學習 (GDL) 模型。然而，它們廣泛的推論時間和高記憶體需求對應用於具有有限運算資源的大型資料集構成挑戰。受電腦視覺中的狀態空間模型啟發，我們將無注意力的 Vision Mamba (Vim) 引入球形表面，提出了一個與領域無關的架構，用於分析球形流形上的資料。我們的透過將球形資料表示為從細分等角球體衍生的三角形補丁序列，來實現表面貼片。所提出的 Surface Vision Mamba (SiM) 使用來自新生兒大腦的皮質表面指標，在多個神經發育表型回歸任務上進行評估。實驗結果表明，與基於注意力和 GDL 的方法相比，SiM 表現出色，在 Ico-4 網格分割下提供快 4.8 倍的推論速度，並實現低 91.7% 的記憶體消耗，低於 Surface Vision Transformer (SiT)。敏感性分析進一步強調了 SiM 識別微妙認知發育模式的潛力。程式碼可在 https://github.com/Rongzhao-He/surface-vision-mamba 取得。</paragraph>", "author": "Rongzhao He et.al.", "authors": "Rongzhao He, Weihao Zheng", "id": "2501.14679v1", "paper_url": "http://arxiv.org/abs/2501.14679v1", "repo": "null"}}