{"2501.02699": {"publish_time": "2025-01-06", "title": "EAGLE: Enhanced Visual Grounding Minimizes Hallucinations in Instructional Multimodal Models", "paper_summary": "Large language models and vision transformers have demonstrated impressive\nzero-shot capabilities, enabling significant transferability in downstream\ntasks. The fusion of these models has resulted in multi-modal architectures\nwith enhanced instructional capabilities. Despite incorporating vast image and\nlanguage pre-training, these multi-modal architectures often generate responses\nthat deviate from the ground truth in the image data. These failure cases are\nknown as hallucinations. Current methods for mitigating hallucinations\ngenerally focus on regularizing the language component, improving the fusion\nmodule, or ensembling multiple visual encoders to improve visual\nrepresentation. In this paper, we address the hallucination issue by directly\nenhancing the capabilities of the visual component. Our approach, named EAGLE,\nis fully agnostic to the LLM or fusion module and works as a post-pretraining\napproach that improves the grounding and language alignment of the visual\nencoder. We show that a straightforward reformulation of the original\ncontrastive pre-training task results in an improved visual encoder that can be\nincorporated into the instructional multi-modal architecture without additional\ninstructional training. As a result, EAGLE achieves a significant reduction in\nhallucinations across multiple challenging benchmarks and tasks.", "paper_summary_zh": "大型语言模型和视觉转换器已展示出令人印象深刻的零样本能力，可在下游任务中实现显著的可迁移性。这些模型的融合产生了具有增强指令能力的多模态架构。尽管融合了大量的图像和语言预训练，但这些多模态架构通常会生成偏离图像数据中基本事实的响应。这些失败案例被称为幻觉。当前减轻幻觉的方法通常集中在正则化语言组件、改进融合模块或集成多个视觉编码器以改进视觉表示。在本文中，我们通过直接增强视觉组件的能力来解决幻觉问题。我们的方法名为 EAGLE，它完全独立于 LLM 或融合模块，并作为一种后预训练方法，可改进视觉编码器的接地和语言对齐。我们表明，对原始对比预训练任务的直接重新表述产生了改进的视觉编码器，该编码器可以合并到指令性多模态架构中，而无需额外的指令性训练。因此，EAGLE 在多个具有挑战性的基准和任务中显著减少了幻觉。", "author": "Andrés Villa et.al.", "authors": "Andrés Villa, Juan León Alcázar, Motasem Alfarra, Vladimir Araujo, Alvaro Soto, Bernard Ghanem", "id": "2501.02699v1", "paper_url": "http://arxiv.org/abs/2501.02699v1", "repo": "null"}}