{"2407.18698": {"publish_time": "2024-07-26", "title": "Adaptive Contrastive Search: Uncertainty-Guided Decoding for Open-Ended Text Generation", "paper_summary": "Decoding from the output distributions of large language models to produce\nhigh-quality text is a complex challenge in language modeling. Various\napproaches, such as beam search, sampling with temperature, $k-$sampling,\nnucleus $p-$sampling, typical decoding, contrastive decoding, and contrastive\nsearch, have been proposed to address this problem, aiming to improve\ncoherence, diversity, as well as resemblance to human-generated text. In this\nstudy, we introduce adaptive contrastive search, a novel decoding strategy\nextending contrastive search by incorporating an adaptive degeneration penalty,\nguided by the estimated uncertainty of the model at each generation step. This\nstrategy is designed to enhance both the creativity and diversity of the\nlanguage modeling process while at the same time producing coherent and\nhigh-quality generated text output. Our findings indicate performance\nenhancement in both aspects, across different model architectures and datasets,\nunderscoring the effectiveness of our method in text generation tasks. Our code\nbase, datasets, and models are publicly available.", "paper_summary_zh": "從大型語言模型的輸出分佈解碼以產生高品質的文字，在語言模型中是一個複雜的挑戰。各種方法，例如波束搜尋、溫度抽樣、$k$ 抽樣、核 $p$ 抽樣、典型解碼、對比解碼和對比搜尋，已被提出以解決這個問題，目標是改善連貫性、多樣性，以及與人類產生的文字的相似性。在這項研究中，我們引入了自適應對比搜尋，一種新的解碼策略，透過結合自適應退化懲罰來擴充對比搜尋，並在每個產生步驟中由模型的估計不確定性來引導。此策略旨在同時提升語言模型處理的創造力和多樣性，同時產生連貫且高品質的產生文字輸出。我們的發現指出在不同的模型架構和資料集中的效能提升，強調了我們的方法在文字產生任務中的有效性。我們的程式碼庫、資料集和模型已公開提供。", "author": "Esteban Garces Arias et.al.", "authors": "Esteban Garces Arias, Julian Rodemann, Meimingwei Li, Christian Heumann, Matthias Aßenmacher", "id": "2407.18698v1", "paper_url": "http://arxiv.org/abs/2407.18698v1", "repo": "null"}}