{"2412.11864": {"publish_time": "2024-12-16", "title": "Investigating Mixture of Experts in Dense Retrieval", "paper_summary": "While Dense Retrieval Models (DRMs) have advanced Information Retrieval (IR),\none limitation of these neural models is their narrow generalizability and\nrobustness. To cope with this issue, one can leverage the Mixture-of-Experts\n(MoE) architecture. While previous IR studies have incorporated MoE\narchitectures within the Transformer layers of DRMs, our work investigates an\narchitecture that integrates a single MoE block (SB-MoE) after the output of\nthe final Transformer layer. Our empirical evaluation investigates how SB-MoE\ncompares, in terms of retrieval effectiveness, to standard fine-tuning. In\ndetail, we fine-tune three DRMs (TinyBERT, BERT, and Contriever) across four\nbenchmark collections with and without adding the MoE block. Moreover, since\nMoE showcases performance variations with respect to its parameters (i.e., the\nnumber of experts), we conduct additional experiments to investigate this\naspect further. The findings show the effectiveness of SB-MoE especially for\nDRMs with a low number of parameters (i.e., TinyBERT), as it consistently\noutperforms the fine-tuned underlying model on all four benchmarks. For DRMs\nwith a higher number of parameters (i.e., BERT and Contriever), SB-MoE requires\nlarger numbers of training samples to yield better retrieval performance.", "paper_summary_zh": "在稠密检索模型 (DRM) 提升了信息检索 (IR) 的同时，这些神经模型的一个局限性在于它们较窄的泛化性和稳健性。为了应对这个问题，人们可以利用混合专家 (MoE) 架构。虽然之前的 IR 研究已经将 MoE 架构纳入了 DRM 的 Transformer 层，但我们的工作研究了一种在最终 Transformer 层的输出之后集成单个 MoE 块 (SB-MoE) 的架构。我们的经验评估研究了 SB-MoE 在检索有效性方面如何与标准微调进行比较。具体来说，我们在四个基准集合中对三个 DRM（TinyBERT、BERT 和 Contriever）进行了微调，分别有和没有添加 MoE 块。此外，由于 MoE 在其参数（即专家数量）方面表现出性能差异，我们进行了额外的实验以进一步研究这个方面。结果表明 SB-MoE 特别适用于具有较少参数的 DRM（即 TinyBERT），因为它在所有四个基准上都持续优于微调后的底层模型。对于具有更多参数的 DRM（即 BERT 和 Contriever），SB-MoE 需要更多的训练样本才能产生更好的检索性能。", "author": "Effrosyni Sokli et.al.", "authors": "Effrosyni Sokli, Pranav Kasela, Georgios Peikos, Gabriella Pasi", "id": "2412.11864v1", "paper_url": "http://arxiv.org/abs/2412.11864v1", "repo": "null"}}