{"2409.19984": {"publish_time": "2024-09-30", "title": "CONTESTS: a Framework for Consistency Testing of Span Probabilities in Language Models", "paper_summary": "Although language model scores are often treated as probabilities, their\nreliability as probability estimators has mainly been studied through\ncalibration, overlooking other aspects. In particular, it is unclear whether\nlanguage models produce the same value for different ways of assigning joint\nprobabilities to word spans. Our work introduces a novel framework, ConTestS\n(Consistency Testing over Spans), involving statistical tests to assess score\nconsistency across interchangeable completion and conditioning orders. We\nconduct experiments on post-release real and synthetic data to eliminate\ntraining effects. Our findings reveal that both Masked Language Models (MLMs)\nand autoregressive models exhibit inconsistent predictions, with autoregressive\nmodels showing larger discrepancies. Larger MLMs tend to produce more\nconsistent predictions, while autoregressive models show the opposite trend.\nMoreover, for both model types, prediction entropies offer insights into the\ntrue word span likelihood and therefore can aid in selecting optimal decoding\nstrategies. The inconsistencies revealed by our analysis, as well their\nconnection to prediction entropies and differences between model types, can\nserve as useful guides for future research on addressing these limitations.", "paper_summary_zh": "儘管語言模型分數通常被視為機率，但其作為機率估計器的可靠性主要透過校準來研究，忽視了其他面向。特別是不清楚語言模型是否對指定詞彙範圍的聯合機率的不同方式產生相同的值。我們的研究引入了一個新穎的架構，ConTestS（跨範圍的一致性測試），涉及統計測試以評估可互換完成和條件順序之間的分數一致性。我們對發布後的真實和合成資料進行實驗，以消除訓練效果。我們的研究結果顯示，遮蔽語言模型 (MLM) 和自迴歸模型都會產生不一致的預測，而自迴歸模型顯示出更大的差異。較大的 MLM 傾向於產生更一致的預測，而自迴歸模型則顯示相反的趨勢。此外，對於這兩種模型類型，預測熵提供了對真實詞彙範圍機率的見解，因此有助於選擇最佳解碼策略。我們的分析揭示的不一致性，以及它們與預測熵和模型類型之間的差異，可以作為未來研究解決這些限制的有用指南。", "author": "Eitan Wagner et.al.", "authors": "Eitan Wagner, Yuli Slavutsky, Omri Abend", "id": "2409.19984v1", "paper_url": "http://arxiv.org/abs/2409.19984v1", "repo": "null"}}