{"2406.18460": {"publish_time": "2024-06-26", "title": "Role-Play Zero-Shot Prompting with Large Language Models for Open-Domain Human-Machine Conversation", "paper_summary": "Recently, various methods have been proposed to create open-domain\nconversational agents with Large Language Models (LLMs). These models are able\nto answer user queries, but in a one-way Q&A format rather than a true\nconversation. Fine-tuning on particular datasets is the usual way to modify\ntheir style to increase conversational ability, but this is expensive and\nusually only available in a few languages. In this study, we explore role-play\nzero-shot prompting as an efficient and cost-effective solution for open-domain\nconversation, using capable multilingual LLMs (Beeching et al., 2023) trained\nto obey instructions. We design a prompting system that, when combined with an\ninstruction-following model - here Vicuna (Chiang et al., 2023) - produces\nconversational agents that match and even surpass fine-tuned models in human\nevaluation in French in two different tasks.", "paper_summary_zh": "最近，已經提出各種方法來使用大型語言模型 (LLM) 建立開放領域對話代理。這些模型能夠回答使用者的查詢，但採用單向問答格式，而非真正的對話。針對特定資料集進行微調是修改其風格以增加對話能力的常規方法，但這很昂貴，而且通常僅在少數語言中可用。在這項研究中，我們探討角色扮演零次提示，作為開放領域對話的高效且具有成本效益的解決方案，使用訓練有素的多語言 LLM（Beeching et al., 2023）來遵循指令。我們設計了一個提示系統，當與遵循指令的模型（此處為 Vicuna（Chiang et al., 2023））結合使用時，會產生對話代理，在法語中的兩項不同任務中，這些代理在人類評估中與微調模型相匹配，甚至超越微調模型。", "author": "Ahmed Njifenjou et.al.", "authors": "Ahmed Njifenjou, Virgile Sucal, Bassam Jabaian, Fabrice Lefèvre", "id": "2406.18460v1", "paper_url": "http://arxiv.org/abs/2406.18460v1", "repo": "null"}}