{"2410.03176": {"publish_time": "2024-10-04", "title": "Investigating and Mitigating Object Hallucinations in Pretrained Vision-Language (CLIP) Models", "paper_summary": "Large Vision-Language Models (LVLMs) have achieved impressive performance,\nyet research has pointed out a serious issue with object hallucinations within\nthese models. However, there is no clear conclusion as to which part of the\nmodel these hallucinations originate from. In this paper, we present an\nin-depth investigation into the object hallucination problem specifically\nwithin the CLIP model, which serves as the backbone for many state-of-the-art\nvision-language systems. We unveil that even in isolation, the CLIP model is\nprone to object hallucinations, suggesting that the hallucination problem is\nnot solely due to the interaction between vision and language modalities. To\naddress this, we propose a counterfactual data augmentation method by creating\nnegative samples with a variety of hallucination issues. We demonstrate that\nour method can effectively mitigate object hallucinations for CLIP model, and\nwe show the the enhanced model can be employed as a visual encoder, effectively\nalleviating the object hallucination issue in LVLMs.", "paper_summary_zh": "大型視覺語言模型 (LVLMs) 已取得令人印象深刻的表現，但研究指出這些模型中存在嚴重的物件幻覺問題。然而，目前尚不清楚這些幻覺源自模型的哪個部分。在本文中，我們對 CLIP 模型中的物件幻覺問題進行深入探討，該模型是許多最先進的視覺語言系統的骨幹。我們揭示，即使在孤立的情況下，CLIP 模型也容易產生物件幻覺，這表明幻覺問題並非僅僅是由於視覺和語言模組之間的互動所致。為了解決這個問題，我們提出了一種反事實資料擴充方法，通過建立具有各種幻覺問題的負面樣本。我們證明了我們的方法可以有效減輕 CLIP 模型的物件幻覺，並且我們展示了增強後的模型可以用作視覺編碼器，有效緩解 LVLMs 中的物件幻覺問題。", "author": "Yufang Liu et.al.", "authors": "Yufang Liu, Tao Ji, Changzhi Sun, Yuanbin Wu, Aimin Zhou", "id": "2410.03176v1", "paper_url": "http://arxiv.org/abs/2410.03176v1", "repo": "https://github.com/yufang-liu/clip_hallucination"}}