{"2409.17634": {"publish_time": "2024-09-26", "title": "P4Q: Learning to Prompt for Quantization in Visual-language Models", "paper_summary": "Large-scale pre-trained Vision-Language Models (VLMs) have gained prominence\nin various visual and multimodal tasks, yet the deployment of VLMs on\ndownstream application platforms remains challenging due to their prohibitive\nrequirements of training samples and computing resources. Fine-tuning and\nquantization of VLMs can substantially reduce the sample and computation costs,\nwhich are in urgent need. There are two prevailing paradigms in quantization,\nQuantization-Aware Training (QAT) can effectively quantize large-scale VLMs but\nincur a huge training cost, while low-bit Post-Training Quantization (PTQ)\nsuffers from a notable performance drop. We propose a method that balances\nfine-tuning and quantization named ``Prompt for Quantization'' (P4Q), in which\nwe design a lightweight architecture to leverage contrastive loss supervision\nto enhance the recognition performance of a PTQ model. Our method can\neffectively reduce the gap between image features and text features caused by\nlow-bit quantization, based on learnable prompts to reorganize textual\nrepresentations and a low-bit adapter to realign the distributions of image and\ntext features. We also introduce a distillation loss based on cosine similarity\npredictions to distill the quantized model using a full-precision teacher.\nExtensive experimental results demonstrate that our P4Q method outperforms\nprior arts, even achieving comparable results to its full-precision\ncounterparts. For instance, our 8-bit P4Q can theoretically compress the\nCLIP-ViT/B-32 by 4 $\\times$ while achieving 66.94\\% Top-1 accuracy,\noutperforming the learnable prompt fine-tuned full-precision model by 2.24\\%\nwith negligible additional parameters on the ImageNet dataset.", "paper_summary_zh": "<paragraph>大規模預訓練的視覺語言模型 (VLM) 在各種視覺和多模態任務中獲得顯著地位，但由於訓練樣本和運算資源的限制要求，將 VLM 部署在下游應用程式平台上仍然具有挑戰性。VLM 的微調和量化可以大幅減少樣本和運算成本，這是一個迫切需求。量化有兩種盛行的典範，量化感知訓練 (QAT) 可以有效量化大規模 VLM，但會產生巨大的訓練成本，而低位元後訓練量化 (PTQ) 則會導致顯著的效能下降。我們提出了一種平衡微調和量化的方法，稱為「量化提示」(P4Q)，我們在其中設計了一個輕量級架構，利用對比損失監督來增強 PTQ 模型的辨識效能。我們的模型可以有效減少低位元量化造成的影像特徵和文字特徵之間的差距，基於可學習提示來重新組織文字表徵，並使用低位元適配器重新調整影像和文字特徵的分布。我們還引入了一個基於餘弦相似性預測的蒸餾損失，以使用全精度教師來蒸餾量化模型。廣泛的實驗結果證明，我們的 P4Q 方法優於先前的技術，甚至可以達到與其全精度對應項相當的結果。例如，我們的 8 位元 P4Q 理論上可以將 CLIP-ViT/B-32 壓縮 4 倍，同時達到 66.94% 的 Top-1 準確率，在 ImageNet 資料集上以極少的額外參數優於可學習提示微調的全精度模型 2.24%。</paragraph>", "author": "Huixin Sun et.al.", "authors": "Huixin Sun, Runqi Wang, Yanjing Li, Xianbin Cao, Xiaolong Jiang, Yao Hu, Baochang Zhang", "id": "2409.17634v1", "paper_url": "http://arxiv.org/abs/2409.17634v1", "repo": "null"}}