{"2410.03134": {"publish_time": "2024-10-04", "title": "Remaining Useful Life Prediction: A Study on Multidimensional Industrial Signal Processing and Efficient Transfer Learning Based on Large Language Models", "paper_summary": "Remaining useful life (RUL) prediction is crucial for maintaining modern\nindustrial systems, where equipment reliability and operational safety are\nparamount. Traditional methods, based on small-scale deep learning or\nphysical/statistical models, often struggle with complex, multidimensional\nsensor data and varying operating conditions, limiting their generalization\ncapabilities. To address these challenges, this paper introduces an innovative\nregression framework utilizing large language models (LLMs) for RUL prediction.\nBy leveraging the modeling power of LLMs pre-trained on corpus data, the\nproposed model can effectively capture complex temporal dependencies and\nimprove prediction accuracy. Extensive experiments on the Turbofan engine's RUL\nprediction task show that the proposed model surpasses state-of-the-art (SOTA)\nmethods on the challenging FD002 and FD004 subsets and achieves near-SOTA\nresults on the other subsets. Notably, different from previous research, our\nframework uses the same sliding window length and all sensor signals for all\nsubsets, demonstrating strong consistency and generalization. Moreover,\ntransfer learning experiments reveal that with minimal target domain data for\nfine-tuning, the model outperforms SOTA methods trained on full target domain\ndata. This research highlights the significant potential of LLMs in industrial\nsignal processing and RUL prediction, offering a forward-looking solution for\nhealth management in future intelligent industrial systems.", "paper_summary_zh": "剩餘使用壽命 (RUL) 預測對於維護現代工業系統至關重要，在這些系統中，設備可靠性和操作安全至上。傳統方法基於小規模深度學習或物理/統計模型，通常難以處理複雜、多維度的感測器資料和不同的操作條件，限制了它們的泛化能力。為了應對這些挑戰，本文介紹了一個創新的回歸架構，利用大型語言模型 (LLM) 來進行 RUL 預測。通過利用在語料資料上預先訓練的 LLM 的建模能力，所提出的模型可以有效地捕捉複雜的時間依賴性並提高預測準確度。在渦輪風扇引擎的 RUL 預測任務上進行的廣泛實驗表明，所提出的模型在具有挑戰性的 FD002 和 FD004 子集中超越了最先進 (SOTA) 的方法，並在其他子集中達到了接近 SOTA 的結果。值得注意的是，與先前的研究不同，我們的框架對所有子集都使用相同的滑動窗口長度和所有感測器訊號，展示了強大的相容性和泛化能力。此外，轉移學習實驗表明，透過對微調進行最少的目標網域資料，該模型的表現優於在完整目標網域資料上訓練的 SOTA 方法。這項研究突顯了 LLM 在工業訊號處理和 RUL 預測中的巨大潛力，為未來智慧工業系統中的健康管理提供了前瞻性的解決方案。", "author": "Yan Chen et.al.", "authors": "Yan Chen, Cheng Liu", "id": "2410.03134v1", "paper_url": "http://arxiv.org/abs/2410.03134v1", "repo": "null"}}