{"2407.16062": {"publish_time": "2024-07-22", "title": "Artificial Intelligence-based Decision Support Systems for Precision and Digital Health", "paper_summary": "Precision health, increasingly supported by digital technologies, is a domain\nof research that broadens the paradigm of precision medicine, advancing\neveryday healthcare. This vision goes hand in hand with the groundbreaking\nadvent of artificial intelligence (AI), which is reshaping the way we diagnose,\ntreat, and monitor both clinical subjects and the general population. AI tools\npowered by machine learning have shown considerable improvements in a variety\nof healthcare domains. In particular, reinforcement learning (RL) holds great\npromise for sequential and dynamic problems such as dynamic treatment regimes\nand just-in-time adaptive interventions in digital health. In this work, we\ndiscuss the opportunity offered by AI, more specifically RL, to current trends\nin healthcare, providing a methodological survey of RL methods in the context\nof precision and digital health. Focusing on the area of adaptive\ninterventions, we expand the methodological survey with illustrative case\nstudies that used RL in real practice.\n  This invited article has undergone anonymous review and is intended as a book\nchapter for the volume \"Frontiers of Statistics and Data Science\" edited by\nSubhashis Ghoshal and Anindya Roy for the International Indian Statistical\nAssociation Series on Statistics and Data Science, published by Springer. It\ncovers the material from a short course titled \"Artificial Intelligence in\nPrecision and Digital Health\" taught by the author Bibhas Chakraborty at the\nIISA 2022 Conference, December 26-30 2022, at the Indian Institute of Science,\nBengaluru.", "paper_summary_zh": "<paragraph>精準健康在數位科技的支撐下日益普及，是擴展精準醫療典範的研究領域，促進日常保健。這個願景與人工智慧 (AI) 的突破性進展息息相關，它正在重塑我們診斷、治療和監控臨床受試者和一般民眾的方式。由機器學習支援的 AI 工具已在各種醫療保健領域展現顯著的進步。特別是，強化學習 (RL) 對序貫和動態問題（例如動態治療方案和即時適應性干預）極具發展前景。在這項工作中，我們探討 AI（更具體地說，RL）為當前醫療保健趨勢帶來的契機，並提供 RL 方法在精準和數位健康領域的方法論調查。我們專注於適應性干預領域，並透過在實際應用中使用 RL 的說明性案例研究擴展方法論調查。這篇受邀文章已經過匿名審查，並作為 Subhashis Ghoshal 和 Anindya Roy 編輯的「統計學與資料科學前沿」一書的章節，由 Springer 出版的國際印度統計協會統計學與資料科學系列叢書發行。它涵蓋了由作者 Bibhas Chakraborty 在印度統計協會 2022 年會議（2022 年 12 月 26 日至 30 日，於印度科學院 Bengaluru 舉行）教授的「精準與數位健康中的人工智慧」短期課程的教材。</paragraph>", "author": "Nina Deliu et.al.", "authors": "Nina Deliu, Bibhas Chakraborty", "id": "2407.16062v1", "paper_url": "http://arxiv.org/abs/2407.16062v1", "repo": "null"}}