{"2405.18822": {"publish_time": "2024-05-29", "title": "Toxicity Detection for Free", "paper_summary": "Current LLMs are generally aligned to follow safety requirements and tend to\nrefuse toxic prompts. However, LLMs can fail to refuse toxic prompts or be\novercautious and refuse benign examples. In addition, state-of-the-art toxicity\ndetectors have low TPRs at low FPR, incurring high costs in real-world\napplications where toxic examples are rare. In this paper, we explore\nModeration Using LLM Introspection (MULI), which detects toxic prompts using\nthe information extracted directly from LLMs themselves. We found significant\ngaps between benign and toxic prompts in the distribution of alternative\nrefusal responses and in the distribution of the first response token's logits.\nThese gaps can be used to detect toxicities: We show that a toy model based on\nthe logits of specific starting tokens gets reliable performance, while\nrequiring no training or additional computational cost. We build a more robust\ndetector using a sparse logistic regression model on the first response token\nlogits, which greatly exceeds SOTA detectors under multiple metrics.", "paper_summary_zh": "目前的 LLM 通常會調整以遵循安全要求，並傾向於拒絕有毒提示。然而，LLM 可能無法拒絕有毒提示，或過於謹慎而拒絕良性範例。此外，最先進的毒性偵測器在低 FPR 下具有低 TPR，在有毒範例罕見的實際應用中會產生高成本。在本文中，我們探索了使用 LLM 內省（MULI）進行審核，它使用從 LLM 自身直接提取的資訊來偵測有毒提示。我們發現良性和有毒提示在備用拒絕回應的分配和第一個回應權杖的 logit 分配中存在顯著差距。這些差距可用於偵測毒性：我們展示了一個基於特定起始權杖的 logit 的玩具模型獲得了可靠的效能，同時不需要訓練或額外的運算成本。我們使用一個稀疏邏輯迴歸模型在第一個回應權杖 logit 上建立了一個更強大的偵測器，它在多項指標下大大超過了 SOTA 偵測器。", "author": "Zhanhao Hu et.al.", "authors": "Zhanhao Hu, Julien Piet, Geng Zhao, Jiantao Jiao, David Wagner", "id": "2405.18822v1", "paper_url": "http://arxiv.org/abs/2405.18822v1", "repo": "null"}}