{"2406.13217": {"publish_time": "2024-06-19", "title": "Bridging Law and Data: Augmenting Reasoning via a Semi-Structured Dataset with IRAC methodology", "paper_summary": "The effectiveness of Large Language Models (LLMs) in legal reasoning is often\nlimited due to the unique legal terminologies and the necessity for highly\nspecialized knowledge. These limitations highlight the need for high-quality\ndata tailored for complex legal reasoning tasks. This paper introduces\nLEGALSEMI, a benchmark specifically curated for legal scenario analysis.\nLEGALSEMI comprises 54 legal scenarios, each rigorously annotated by legal\nexperts, based on the comprehensive IRAC (Issue, Rule, Application, Conclusion)\nframework. In addition, LEGALSEMI is accompanied by a structured knowledge\ngraph (SKG). A series of experiments were conducted to assess the usefulness of\nLEGALSEMI for IRAC analysis. The experimental results demonstrate the\neffectiveness of incorporating the SKG for issue identification, rule\nretrieval, application and conclusion generation using four different LLMs.\nLEGALSEMI will be publicly available upon acceptance of this paper.", "paper_summary_zh": "大型語言模型 (LLM) 在法律推理中的有效性通常受到獨特的法律術語和高度專業知識的必要性的限制。這些限制突顯了針對複雜法律推理任務量身打造的高品質資料的需求。本文介紹 LEGALSEMI，這是一個專門為法律情境分析策劃的基準。LEGALSEMI 包含 54 個法律情境，每個情境都經過法律專家根據全面的 IRAC（問題、規則、應用、結論）架構嚴格註解。此外，LEGALSEMI 還附帶一個結構化的知識圖譜 (SKG)。進行了一系列實驗來評估 LEGALSEMI 對 IRAC 分析的有用性。實驗結果證明了將 SKG 納入問題識別、規則檢索、應用和結論生成中的有效性，使用了四種不同的 LLM。LEGALSEMI 將在本文獲接受後公開。", "author": "Xiaoxi Kang et.al.", "authors": "Xiaoxi Kang, Lizhen Qu, Lay-Ki Soon, Zhuang Li, Adnan Trakic", "id": "2406.13217v1", "paper_url": "http://arxiv.org/abs/2406.13217v1", "repo": "null"}}