{"2412.03310": {"publish_time": "2024-12-04", "title": "Grounded Language Design for Lightweight Diagramming for Formal Methods", "paper_summary": "Model finding, as embodied by SAT solvers and similar tools, is used widely,\nboth in embedding settings and as a tool in its own right. For instance, tools\nlike Alloy target SAT to enable users to incrementally define, explore, verify,\nand diagnose sophisticated specifications for a large number of complex\nsystems.\n  These tools critically include a visualizer that lets users graphically\nexplore these generated models. As we show, however, default visualizers, which\nknow nothing about the domain, are unhelpful and even actively violate\npresentational and cognitive principles. At the other extreme, full-blown\nvisualizations require significant effort as well as knowledge a specifier\nmight not possess; they can also exhibit bad failure modes (including silent\nfailure). Instead, we need a language to capture essential domain information\nfor lightweight diagramming. We ground our language design in both the\ncognitive science literature on diagrams and on a large number of example\ncustom visualizations. This identifies the key elements of lightweight\ndiagrams. We distill these into a small set of orthogonal primitives. We extend\nan Alloy-like tool to support these primitives. We evaluate the effectiveness\nof the produced diagrams, finding them good for reasoning. We then compare this\nagainst many other drawing languages and tools to show that this work defines a\nnew niche that is lightweight, effective, and driven by sound principles.", "paper_summary_zh": "模型尋找，例如 SAT 解決器和類似工具，被廣泛使用，\n既用於嵌入式設定，也作為一種獨立的工具。例如，\nAlloy 等工具以 SAT 為目標，使用戶能夠逐步定義、探索、驗證，\n並診斷大量複雜系統的高級規格。\n這些工具至關重要的是包括一個可視化器，讓用戶以圖形方式\n探索這些生成的模型。然而，我們展示了默認的可視化器，\n對領域一無所知，沒有幫助，甚至主動違反\n展示和認知原則。在另一個極端，全面的\n可視化需要大量的精力以及說明者可能不具備的知識；它們也可以表現出不良的故障模式（包括靜默\n故障）。相反，我們需要一種語言來捕捉基本領域信息\n用於輕量級圖表。我們將我們的語言設計建立在\n關於圖表的認知科學文獻和大量示例\n自定義可視化。這確定了輕量級\n圖表的關鍵元素。我們將這些提煉成一組小的正交基元。我們擴展\n一個類似 Alloy 的工具來支持這些基元。我們評估產生的圖表的有效性，發現它們對推理有益。然後我們比較這\n與許多其他繪圖語言和工具，以表明這項工作定義了一個\n新的利基，它輕量、有效且由合理的原則驅動。", "author": "Siddhartha Prasad et.al.", "authors": "Siddhartha Prasad, Ben Greenman, Tim Nelson, Shriram Krishnamurthi", "id": "2412.03310v1", "paper_url": "http://arxiv.org/abs/2412.03310v1", "repo": "null"}}