{"2408.02018": {"publish_time": "2024-08-04", "title": "Individualized multi-horizon MRI trajectory prediction for Alzheimer's Disease", "paper_summary": "Neurodegeneration as measured through magnetic resonance imaging (MRI) is\nrecognized as a potential biomarker for diagnosing Alzheimer's disease (AD),\nbut is generally considered less specific than amyloid or tau based biomarkers.\nDue to a large amount of variability in brain anatomy between different\nindividuals, we hypothesize that leveraging MRI time series can help improve\nspecificity, by treating each patient as their own baseline. Here we turn to\nconditional variational autoencoders to generate individualized MRI predictions\ngiven the subject's age, disease status and one previous scan. Using serial\nimaging data from the Alzheimer's Disease Neuroimaging Initiative, we train a\nnovel architecture to build a latent space distribution which can be sampled\nfrom to generate future predictions of changing anatomy. This enables us to\nextrapolate beyond the dataset and predict MRIs up to 10 years. We evaluated\nthe model on a held-out set from ADNI and an independent dataset (from Open\nAccess Series of Imaging Studies). By comparing to several alternatives, we\nshow that our model produces more individualized images with higher resolution.\nFurther, if an individual already has a follow-up MRI, we demonstrate a usage\nof our model to compute a likelihood ratio classifier for disease status. In\npractice, the model may be able to assist in early diagnosis of AD and provide\na counterfactual baseline trajectory for treatment effect estimation.\nFurthermore, it generates a synthetic dataset that can potentially be used for\ndownstream tasks such as anomaly detection and classification.", "paper_summary_zh": "透過磁振造影 (MRI) 測量的神經退化症被視為診斷阿茲海默症 (AD) 的潛在生物標記，但通常被認為比類澱粉或 tau 蛋白生物標記的特異性低。由於不同個體之間的腦部解剖結構有很大的變異性，我們假設利用 MRI 時間序列可以透過將每位患者視為其自己的基準線來幫助提高特異性。在此，我們求助於條件變異自動編碼器來生成個體化的 MRI 預測，給定受試者的年齡、疾病狀態和一次先前的掃描。使用阿茲海默症神經影像計劃的序列影像資料，我們訓練一個新穎的架構來建立一個潛在空間分佈，可以從中取樣以生成未來對解剖結構改變的預測。這使我們能夠外推資料集並預測長達 10 年的 MRI。我們在 ADNI 的保留組和一個獨立的資料集（來自影像研究的開放存取系列）上評估了該模型。透過與幾個替代方案進行比較，我們表明我們的模型產生了具有更高解析度、更個性化的影像。此外，如果個人已經有後續 MRI，我們展示了使用我們的模型來計算疾病狀態的似然比分類器。在實務中，該模型可能有助於 AD 的早期診斷，並提供一個反事實的基準軌跡以進行治療效果估計。此外，它會生成一個合成資料集，該資料集潛在地可用於下游任務，例如異常偵測和分類。", "author": "Rosemary He et.al.", "authors": "Rosemary He, Gabriella Ang, Daniel Tward", "id": "2408.02018v1", "paper_url": "http://arxiv.org/abs/2408.02018v1", "repo": "null"}}