{"2410.05047": {"publish_time": "2024-10-07", "title": "A test suite of prompt injection attacks for LLM-based machine translation", "paper_summary": "LLM-based NLP systems typically work by embedding their input data into\nprompt templates which contain instructions and/or in-context examples,\ncreating queries which are submitted to a LLM, and then parsing the LLM\nresponse in order to generate the system outputs. Prompt Injection Attacks\n(PIAs) are a type of subversion of these systems where a malicious user crafts\nspecial inputs which interfere with the prompt templates, causing the LLM to\nrespond in ways unintended by the system designer.\n  Recently, Sun and Miceli-Barone proposed a class of PIAs against LLM-based\nmachine translation. Specifically, the task is to translate questions from the\nTruthfulQA test suite, where an adversarial prompt is prepended to the\nquestions, instructing the system to ignore the translation instruction and\nanswer the questions instead.\n  In this test suite, we extend this approach to all the language pairs of the\nWMT 2024 General Machine Translation task. Moreover, we include additional\nattack formats in addition to the one originally studied.", "paper_summary_zh": "LLM 為基礎的 NLP 系統通常透過將輸入資料嵌入包含指示和/或情境範例的提示範本中，建立提交至 LLM 的查詢，然後剖析 LLM 回應以產生系統輸出。提示注入攻擊 (PIA) 是一種破壞這些系統的類型，其中惡意使用者會製作會干擾提示範本的特殊輸入，導致 LLM 以系統設計者未預期的方式回應。\n最近，Sun 和 Miceli-Barone 提出了一類針對 LLM 為基礎的機器翻譯的 PIA。具體來說，任務是翻譯 TruthfulQA 測試套件中的問題，其中會在問題前加上對抗性提示，指示系統忽略翻譯指示，而改為回答問題。\n在此測試套件中，我們將此方法延伸至 WMT 2024 一般機器翻譯任務的所有語言對。此外，除了最初研究的攻擊格式外，我們還包括其他攻擊格式。", "author": "Antonio Valerio Miceli-Barone et.al.", "authors": "Antonio Valerio Miceli-Barone, Zhifan Sun", "id": "2410.05047v1", "paper_url": "http://arxiv.org/abs/2410.05047v1", "repo": "null"}}