{"2410.24151": {"publish_time": "2024-10-31", "title": "Scaling Concept With Text-Guided Diffusion Models", "paper_summary": "Text-guided diffusion models have revolutionized generative tasks by\nproducing high-fidelity content from text descriptions. They have also enabled\nan editing paradigm where concepts can be replaced through text conditioning\n(e.g., a dog to a tiger). In this work, we explore a novel approach: instead of\nreplacing a concept, can we enhance or suppress the concept itself? Through an\nempirical study, we identify a trend where concepts can be decomposed in\ntext-guided diffusion models. Leveraging this insight, we introduce\nScalingConcept, a simple yet effective method to scale decomposed concepts up\nor down in real input without introducing new elements. To systematically\nevaluate our approach, we present the WeakConcept-10 dataset, where concepts\nare imperfect and need to be enhanced. More importantly, ScalingConcept enables\na variety of novel zero-shot applications across image and audio domains,\nincluding tasks such as canonical pose generation and generative sound\nhighlighting or removal.", "paper_summary_zh": "文本引导扩散模型通过文本描述生成高保真内容，从而彻底改变了生成任务。它们还启用了编辑范例，其中可以通过文本条件（例如，将狗替换为老虎）替换概念。在这项工作中，我们探索了一种新方法：不是替换一个概念，而是增强或抑制概念本身吗？通过实证研究，我们发现了一个趋势，即概念可以在文本引导扩散模型中分解。利用这一见解，我们引入了 ScalingConcept，这是一种简单而有效的方法，可以在不引入新元素的情况下在真实输入中放大或缩小分解的概念。为了系统地评估我们的方法，我们提出了 WeakConcept-10 数据集，其中概念不完善且需要增强。更重要的是，ScalingConcept 可以在图像和音频领域启用各种新颖的零样本应用程序，包括规范姿势生成和生成声音突出或消除等任务。", "author": "Chao Huang et.al.", "authors": "Chao Huang, Susan Liang, Yunlong Tang, Yapeng Tian, Anurag Kumar, Chenliang Xu", "id": "2410.24151v1", "paper_url": "http://arxiv.org/abs/2410.24151v1", "repo": "null"}}