{"2407.19772": {"publish_time": "2024-07-29", "title": "Generating Unseen Code Tests In Infinitum", "paper_summary": "Large Language Models (LLMs) are used for many tasks, including those related\nto coding. An important aspect of being able to utilize LLMs is the ability to\nassess their fitness for specific usages. The common practice is to evaluate\nLLMs against a set of benchmarks. While benchmarks provide a sound foundation\nfor evaluation and comparison of alternatives, they suffer from the well-known\nweakness of leaking into the training data \\cite{Xu2024Benchmarking}. We\npresent a method for creating benchmark variations that generalize across\ncoding tasks and programming languages, and may also be applied to in-house\ncode bases. Our approach enables ongoing generation of test-data thus\nmitigating the leaking into the training data issue. We implement one\nbenchmark, called \\textit{auto-regression}, for the task of text-to-code\ngeneration in Python. Auto-regression is specifically created to aid in\ndebugging and in tracking model generation changes as part of the LLM\nregression testing process.", "paper_summary_zh": "大型語言模型 (LLM) 用於許多任務，包括與編碼相關的任務。能夠利用 LLM 的一個重要方面是評估其適用於特定用途的程度。常見的做法是根據一組基準評估 LLM。儘管基準為評估和比較替代方案提供了穩固的基礎，但它們存在已知的弱點，即洩漏到訓練數據中 \\cite{Xu2024Benchmarking}。我們提出了一種創建基準變體的方法，該變體可以推廣到編碼任務和程式語言，並且也可以應用於內部程式碼庫。我們的做法可以持續生成測試數據，從而減輕洩漏到訓練數據中的問題。我們實作了一個基準，稱為「自動迴歸」，用於 Python 中的文字到程式碼生成任務。自動迴歸是專門創建的，用於協助除錯和追蹤模型生成變更，作為 LLM 回歸測試流程的一部分。", "author": "Marcel Zalmanovici et.al.", "authors": "Marcel Zalmanovici, Orna Raz, Eitan Farchi, Iftach Freund", "id": "2407.19772v1", "paper_url": "http://arxiv.org/abs/2407.19772v1", "repo": "null"}}