{"2502.06890": {"publish_time": "2025-02-09", "title": "LLMs for Drug-Drug Interaction Prediction: A Comprehensive Comparison", "paper_summary": "The increasing volume of drug combinations in modern therapeutic regimens\nneeds reliable methods for predicting drug-drug interactions (DDIs). While\nLarge Language Models (LLMs) have revolutionized various domains, their\npotential in pharmaceutical research, particularly in DDI prediction, remains\nlargely unexplored. This study thoroughly investigates LLMs' capabilities in\npredicting DDIs by uniquely processing molecular structures (SMILES), target\norganisms, and gene interaction data as raw text input from the latest DrugBank\ndataset. We evaluated 18 different LLMs, including proprietary models (GPT-4,\nClaude, Gemini) and open-source variants (from 1.5B to 72B parameters), first\nassessing their zero-shot capabilities in DDI prediction. We then fine-tuned\nselected models (GPT-4, Phi-3.5 2.7B, Qwen-2.5 3B, Gemma-2 9B, and Deepseek R1\ndistilled Qwen 1.5B) to optimize their performance. Our comprehensive\nevaluation framework included validation across 13 external DDI datasets,\ncomparing against traditional approaches such as l2-regularized logistic\nregression. Fine-tuned LLMs demonstrated superior performance, with Phi-3.5\n2.7B achieving a sensitivity of 0.978 in DDI prediction, with an accuracy of\n0.919 on balanced datasets (50% positive, 50% negative cases). This result\nrepresents an improvement over both zero-shot predictions and state-of-the-art\nmachine-learning methods used for DDI prediction. Our analysis reveals that\nLLMs can effectively capture complex molecular interaction patterns and cases\nwhere drug pairs target common genes, making them valuable tools for practical\napplications in pharmaceutical research and clinical settings.", "paper_summary_zh": "<paragraph>現代治療方案中藥物組合的數量越來越多，需要可靠的方法來預測藥物間交互作用 (DDI)。儘管大型語言模型 (LLM) 已在各個領域掀起革命，它們在藥物研究中的潛力，特別是在 DDI 預測中的潛力，仍未得到充分探索。本研究通過獨特地處理分子結構 (SMILES)、目標生物和基因交互資料作為來自最新 DrugBank 資料集的原始文字輸入，徹底調查了 LLM 在預測 DDI 中的能力。我們評估了 18 種不同的 LLM，包括專有模型（GPT-4、Claude、Gemini）和開源變體（從 1.5B 到 72B 參數），首先評估它們在 DDI 預測中的零次學習能力。然後，我們微調選定的模型（GPT-4、Phi-3.5 2.7B、Qwen-2.5 3B、Gemma-2 9B 和 Deepseek R1 蒸餾 Qwen 1.5B）以最佳化其效能。我們的全面評估框架包括跨 13 個外部 DDI 資料集進行驗證，並與傳統方法（例如 l2 正則化邏輯迴歸）進行比較。微調後的 LLM 表現出優異的效能，其中 Phi-3.5 2.7B 在 DDI 預測中達到 0.978 的靈敏度，在平衡資料集（50% 正例，50% 反例）上的準確度為 0.919。此結果優於零次學習預測和用於 DDI 預測的最新機器學習方法。我們的分析表明，LLM 可以有效捕捉複雜的分子交互模式和藥物對靶向共同基因的情況，使其成為藥物研究和臨床環境中實用應用的寶貴工具。</paragraph>", "author": "Gabriele De Vito et.al.", "authors": "Gabriele De Vito, Filomena Ferrucci, Athanasios Angelakis", "id": "2502.06890v1", "paper_url": "http://arxiv.org/abs/2502.06890v1", "repo": "null"}}