{"2409.06673": {"publish_time": "2024-09-10", "title": "Liability and Insurance for Catastrophic Losses: the Nuclear Power Precedent and Lessons for AI", "paper_summary": "As AI systems become more autonomous and capable, experts warn of them\npotentially causing catastrophic losses. Drawing on the successful precedent\nset by the nuclear power industry, this paper argues that developers of\nfrontier AI models should be assigned limited, strict, and exclusive third\nparty liability for harms resulting from Critical AI Occurrences (CAIOs) -\nevents that cause or easily could have caused catastrophic losses. Mandatory\ninsurance for CAIO liability is recommended to overcome developers'\njudgment-proofness, mitigate winner's curse dynamics, and leverage insurers'\nquasi-regulatory abilities. Based on theoretical arguments and observations\nfrom the analogous nuclear power context, insurers are expected to engage in a\nmix of causal risk-modeling, monitoring, lobbying for stricter regulation, and\nproviding loss prevention guidance in the context of insuring against\nheavy-tail risks from AI. While not a substitute for regulation, clear\nliability assignment and mandatory insurance can help efficiently allocate\nresources to risk-modeling and safe design, facilitating future regulatory\nefforts.", "paper_summary_zh": "隨著 AI 系統變得更加自主且強大，專家警告它們可能會造成災難性的損失。本文借鑑核能產業設定的成功先例，主張前沿 AI 模型的開發者應承擔有限、嚴格且專屬的第三方責任，以彌補關鍵 AI 事件 (CAIO) 所造成的損害，而 CAIO 是造成或可能造成災難性損失的事件。建議強制為 CAIO 責任投保，以克服開發者的抗辯不能性，減輕贏家的詛咒動態，並利用保險人的準監管能力。根據理論論點和類比核能脈絡的觀察，保險人預計將從事因果風險建模、監控、遊說更嚴格的法規，以及在承保 AI 重尾風險的背景下提供損失預防指導。儘管無法取代法規，但明確的責任分配和強制保險有助於有效分配資源以進行風險建模和安全設計，促進未來的法規制定工作。", "author": "Cristian Trout et.al.", "authors": "Cristian Trout", "id": "2409.06673v1", "paper_url": "http://arxiv.org/abs/2409.06673v1", "repo": "null"}}