{"2412.07584": {"publish_time": "2024-12-10", "title": "Multimodal Contextualized Support for Enhancing Video Retrieval System", "paper_summary": "Current video retrieval systems, especially those used in competitions,\nprimarily focus on querying individual keyframes or images rather than encoding\nan entire clip or video segment. However, queries often describe an action or\nevent over a series of frames, not a specific image. This results in\ninsufficient information when analyzing a single frame, leading to less\naccurate query results. Moreover, extracting embeddings solely from images\n(keyframes) does not provide enough information for models to encode\nhigher-level, more abstract insights inferred from the video. These models tend\nto only describe the objects present in the frame, lacking a deeper\nunderstanding. In this work, we propose a system that integrates the latest\nmethodologies, introducing a novel pipeline that extracts multimodal data, and\nincorporate information from multiple frames within a video, enabling the model\nto abstract higher-level information that captures latent meanings, focusing on\nwhat can be inferred from the video clip, rather than just focusing on object\ndetection in one single image.", "paper_summary_zh": "目前的影片擷取系統，特別是競賽中使用的系統，\n主要專注於查詢個別關鍵影格或影像，而非編碼整個影片片段或影片區段。然而，查詢通常會描述一系列影格中的動作或事件，而非特定影像。這會導致分析單一影格時資訊不足，進而產生較不準確的查詢結果。此外，僅從影像（關鍵影格）中擷取嵌入式資訊並無法提供足夠的資訊，讓模型編碼從影片推論出的更高層次、更抽象的見解。這些模型往往僅描述影格中存在的物體，缺乏更深入的理解。在這項工作中，我們提出一個整合最新方法的系統，引入一個新穎的管線，用以擷取多模態資料，並整合影片中多個影格的資訊，讓模型能夠抽象出捕捉潛在意義的更高層次資訊，專注於從影片片段中可以推論出的內容，而非僅專注於單一影像中的物體偵測。", "author": "Quoc-Bao Nguyen-Le et.al.", "authors": "Quoc-Bao Nguyen-Le, Thanh-Huy Le-Nguyen", "id": "2412.07584v1", "paper_url": "http://arxiv.org/abs/2412.07584v1", "repo": "null"}}