{"2503.21735": {"publish_time": "2025-03-27", "title": "GateLens: A Reasoning-Enhanced LLM Agent for Automotive Software Release Analytics", "paper_summary": "Ensuring the reliability and effectiveness of software release decisions is\ncritical, particularly in safety-critical domains like automotive systems.\nPrecise analysis of release validation data, often presented in tabular form,\nplays a pivotal role in this process. However, traditional methods that rely on\nmanual analysis of extensive test datasets and validation metrics are prone to\ndelays and high costs. Large Language Models (LLMs) offer a promising\nalternative but face challenges in analytical reasoning, contextual\nunderstanding, handling out-of-scope queries, and processing structured test\ndata consistently; limitations that hinder their direct application in\nsafety-critical scenarios. This paper introduces GateLens, an LLM-based tool\nfor analyzing tabular data in the automotive domain. GateLens translates\nnatural language queries into Relational Algebra (RA) expressions and then\ngenerates optimized Python code. It outperforms the baseline system on\nbenchmarking datasets, achieving higher F1 scores and handling complex and\nambiguous queries with greater robustness. Ablation studies confirm the\ncritical role of the RA module, with performance dropping sharply when omitted.\nIndustrial evaluations reveal that GateLens reduces analysis time by over 80%\nwhile maintaining high accuracy and reliability. As demonstrated by presented\nresults, GateLens achieved high performance without relying on few-shot\nexamples, showcasing strong generalization across various query types from\ndiverse company roles. Insights from deploying GateLens with a partner\nautomotive company offer practical guidance for integrating AI into critical\nworkflows such as release validation. Results show that by automating test\nresult analysis, GateLens enables faster, more informed, and dependable release\ndecisions, and can thus advance software scalability and reliability in\nautomotive systems.", "paper_summary_zh": "確保軟體發佈決策的可靠性和有效性至關重要，尤其是在汽車系統等安全攸關的領域。對發佈驗證數據（通常以表格形式呈現）的精確分析在這一過程中發揮著關鍵作用。然而，依賴人工分析大量測試數據集和驗證指標的傳統方法容易造成延誤和高成本。大型語言模型 (LLM) 提供了一種很有前景的替代方案，但在分析推理、上下文理解、處理範圍外查詢以及一致地處理結構化測試數據方面仍面臨挑戰；這些限制阻礙了它們在安全攸關場景中的直接應用。本文介紹了 GateLens，這是一款基於 LLM 的工具，用於分析汽車領域的表格數據。GateLens 將自然語言查詢轉換為關係代數 (RA) 表達式，然後生成優化的 Python 代碼。它在基準數據集上的表現優於基準系統，實現了更高的 F1 分數，並能更穩健地處理複雜和模糊的查詢。消融研究證實了 RA 模組的關鍵作用，如果省略該模組，性能會急劇下降。產業評估顯示，GateLens 可將分析時間縮短 80% 以上，同時保持高準確性和可靠性。正如所呈現的結果所示，GateLens 無需依賴少量樣本示例即可實現高性能，展現了對來自不同公司角色的各種查詢類型的強大泛化能力。與合作汽車公司部署 GateLens 的經驗，為將 AI 整合到關鍵工作流程（例如發佈驗證）提供了實用的指導。結果表明，通過自動化測試結果分析，GateLens 可實現更快、更明智、更可靠的發佈決策，從而提高汽車系統的軟體可擴展性和可靠性。\n", "author": "Arsham Gholamzadeh Khoee et.al.", "authors": "Arsham Gholamzadeh Khoee, Shuai Wang, Yinan Yu, Robert Feldt, Dhasarathy Parthasarathy", "id": "2503.21735v1", "paper_url": "http://arxiv.org/abs/2503.21735v1", "repo": "null"}}