{"2410.07896": {"publish_time": "2024-10-10", "title": "Executing Arithmetic: Fine-Tuning Large Language Models as Turing Machines", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities across\na wide range of natural language processing and reasoning tasks. However, their\nperformance in the foundational domain of arithmetic remains unsatisfactory.\nWhen dealing with arithmetic tasks, LLMs often memorize specific examples\nrather than learning the underlying computational logic, limiting their ability\nto generalize to new problems. In this paper, we propose a Composable\nArithmetic Execution Framework (CAEF) that enables LLMs to learn to execute\nstep-by-step computations by emulating Turing Machines, thereby gaining a\ngenuine understanding of computational logic. Moreover, the proposed framework\nis highly scalable, allowing composing learned operators to significantly\nreduce the difficulty of learning complex operators. In our evaluation, CAEF\nachieves nearly 100% accuracy across seven common mathematical operations on\nthe LLaMA 3.1-8B model, effectively supporting computations involving operands\nwith up to 100 digits, a level where GPT-4o falls short noticeably in some\nsettings.", "paper_summary_zh": "大型語言模型 (LLM) 在廣泛的自然語言處理和推理任務中展現出非凡的能力。然而，它們在算術基礎領域的表現仍不盡人意。在處理算術任務時，LLM 常常記住特定範例，而不是學習底層的運算邏輯，這限制了它們對新問題的概化能力。在本文中，我們提出了一個可組合運算執行框架 (CAEF)，它能讓 LLM 學習通過模擬圖靈機來執行循序漸進的運算，從而真正理解運算邏輯。此外，所提出的框架具有高度可擴充性，允許組合已學習的運算子，以顯著降低學習複雜運算子的難度。在我們的評估中，CAEF 在 LLaMA 3.1-8B 模型上對七項常見的數學運算達到了近 100% 的準確度，有效地支援涉及多達 100 位數運算元的運算，這是 GPT-4o 在某些設定中明顯不足的層級。", "author": "Junyu Lai et.al.", "authors": "Junyu Lai, Jiahe Xu, Yao Yang, Yunpeng Huang, Chun Cao, Jingwei Xu", "id": "2410.07896v1", "paper_url": "http://arxiv.org/abs/2410.07896v1", "repo": "null"}}