{"2406.19073": {"publish_time": "2024-06-27", "title": "AMBROSIA: A Benchmark for Parsing Ambiguous Questions into Database Queries", "paper_summary": "Practical semantic parsers are expected to understand user utterances and map\nthem to executable programs, even when these are ambiguous. We introduce a new\nbenchmark, AMBROSIA, which we hope will inform and inspire the development of\ntext-to-SQL parsers capable of recognizing and interpreting ambiguous requests.\nOur dataset contains questions showcasing three different types of ambiguity\n(scope ambiguity, attachment ambiguity, and vagueness), their interpretations,\nand corresponding SQL queries. In each case, the ambiguity persists even when\nthe database context is provided. This is achieved through a novel approach\nthat involves controlled generation of databases from scratch. We benchmark\nvarious LLMs on AMBROSIA, revealing that even the most advanced models struggle\nto identify and interpret ambiguity in questions.", "paper_summary_zh": "實用的語義解析器預期能理解使用者的話語，並將其轉換成可執行的程式，即使這些話語有歧義。我們介紹了一個新的基準 AMBROSIA，我們希望它能提供資訊並激勵能辨識和詮釋歧義請求的文字轉 SQL 解析器的開發。我們的資料集包含展示三種不同類型歧義（範圍歧義、依附歧義和模糊性）的問題、其詮釋和對應的 SQL 查詢。在每種情況下，即使提供了資料庫背景，歧義仍然存在。這是透過一種創新的方法實現的，該方法包含從頭開始受控生成資料庫。我們在 AMBROSIA 上對各種 LLM 進行基準測試，結果顯示即使是最先進的模型也很難辨識和詮釋問題中的歧義。", "author": "Irina Saparina et.al.", "authors": "Irina Saparina, Mirella Lapata", "id": "2406.19073v1", "paper_url": "http://arxiv.org/abs/2406.19073v1", "repo": "null"}}