{"2409.05938": {"publish_time": "2024-09-09", "title": "DeepFM-Crispr: Prediction of CRISPR On-Target Effects via Deep Learning", "paper_summary": "Since the advent of CRISPR-Cas9, a groundbreaking gene-editing technology\nthat enables precise genomic modifications via a short RNA guide sequence,\nthere has been a marked increase in the accessibility and application of this\ntechnology across various fields. The success of CRISPR-Cas9 has spurred\nfurther investment and led to the discovery of additional CRISPR systems,\nincluding CRISPR-Cas13. Distinct from Cas9, which targets DNA, Cas13 targets\nRNA, offering unique advantages for gene modulation. We focus on Cas13d, a\nvariant known for its collateral activity where it non-specifically cleaves\nadjacent RNA molecules upon activation, a feature critical to its function. We\nintroduce DeepFM-Crispr, a novel deep learning model developed to predict the\non-target efficiency and evaluate the off-target effects of Cas13d. This model\nharnesses a large language model to generate comprehensive representations rich\nin evolutionary and structural data, thereby enhancing predictions of RNA\nsecondary structures and overall sgRNA efficacy. A transformer-based\narchitecture processes these inputs to produce a predictive efficacy score.\nComparative experiments show that DeepFM-Crispr not only surpasses traditional\nmodels but also outperforms recent state-of-the-art deep learning methods in\nterms of prediction accuracy and reliability.", "paper_summary_zh": "自 CRISPR-Cas9 問世以來，這項突破性的基因編輯技術\n可透過短 RNA 引導序列執行精準的基因體修改，\n此技術在各個領域的可近性和應用性都有顯著的提升。CRISPR-Cas9 的成功\n激勵了更多投資，並導致發現更多 CRISPR 系統，\n包含 CRISPR-Cas13。與鎖定 DNA 的 Cas9 不同，Cas13 鎖定\nRNA，提供基因調控的獨特優勢。我們專注於 Cas13d，一種\n已知具有附帶活性變異，在活化後會非特定地切割\n相鄰的 RNA 分子，此特性對其功能至關重要。我們介紹 DeepFM-Crispr，一種\n新穎的深度學習模型，用於預測目標效率並評估 Cas13d 的脫靶效應。此模型\n利用大型語言模型來產生包含豐富演化和結構資料的全面表徵，從而增強對 RNA\n二級結構和整體 sgRNA 效能的預測。一個基於Transformer的\n架構處理這些輸入以產生預測效能分數。比較實驗顯示 DeepFM-Crispr 不僅超越傳統\n模型，在預測準確性和可靠性方面也優於近期最先進的深度學習方法。", "author": "Condy Bao et.al.", "authors": "Condy Bao, Fuxiao Liu", "id": "2409.05938v1", "paper_url": "http://arxiv.org/abs/2409.05938v1", "repo": "null"}}