{"2406.02030": {"publish_time": "2024-06-04", "title": "Multimodal Reasoning with Multimodal Knowledge Graph", "paper_summary": "Multimodal reasoning with large language models (LLMs) often suffers from\nhallucinations and the presence of deficient or outdated knowledge within LLMs.\nSome approaches have sought to mitigate these issues by employing textual\nknowledge graphs, but their singular modality of knowledge limits comprehensive\ncross-modal understanding. In this paper, we propose the Multimodal Reasoning\nwith Multimodal Knowledge Graph (MR-MKG) method, which leverages multimodal\nknowledge graphs (MMKGs) to learn rich and semantic knowledge across\nmodalities, significantly enhancing the multimodal reasoning capabilities of\nLLMs. In particular, a relation graph attention network is utilized for\nencoding MMKGs and a cross-modal alignment module is designed for optimizing\nimage-text alignment. A MMKG-grounded dataset is constructed to equip LLMs with\ninitial expertise in multimodal reasoning through pretraining. Remarkably,\nMR-MKG achieves superior performance while training on only a small fraction of\nparameters, approximately 2.25% of the LLM's parameter size. Experimental\nresults on multimodal question answering and multimodal analogy reasoning tasks\ndemonstrate that our MR-MKG method outperforms previous state-of-the-art\nmodels.", "paper_summary_zh": "多模态推理与大型语言模型 (LLM) 经常出现幻觉，并且 LLM 中存在知识不足或过时的问题。一些方法试图通过使用文本知识图谱来减轻这些问题，但它们单一的知识模式限制了全面的跨模态理解。在本文中，我们提出了多模态知识图谱多模态推理 (MR-MKG) 方法，该方法利用多模态知识图谱 (MMKG) 来学习跨模态的丰富语义知识，显著增强了 LLM 的多模态推理能力。特别是，关系图谱注意力网络用于编码 MMKG，并设计了一个跨模态对齐模块来优化图像文本对齐。构建了一个基于 MMKG 的数据集，通过预训练为 LLM 提供多模态推理的初始专业知识。值得注意的是，MR-MKG 在仅训练 LLM 参数规模约 2.25% 的一小部分参数时就实现了卓越的性能。在多模态问题解答和多模态类比推理任务上的实验结果表明，我们的 MR-MKG 方法优于以前最先进的模型。", "author": "Junlin Lee et.al.", "authors": "Junlin Lee, Yequan Wang, Jing Li, Min Zhang", "id": "2406.02030v1", "paper_url": "http://arxiv.org/abs/2406.02030v1", "repo": "null"}}