{"2411.10888": {"publish_time": "2024-11-16", "title": "MpoxVLM: A Vision-Language Model for Diagnosing Skin Lesions from Mpox Virus Infection", "paper_summary": "In the aftermath of the COVID-19 pandemic and amid accelerating climate\nchange, emerging infectious diseases, particularly those arising from zoonotic\nspillover, remain a global threat. Mpox (caused by the monkeypox virus) is a\nnotable example of a zoonotic infection that often goes undiagnosed, especially\nas its rash progresses through stages, complicating detection across diverse\npopulations with different presentations. In August 2024, the WHO\nDirector-General declared the mpox outbreak a public health emergency of\ninternational concern for a second time. Despite the deployment of deep\nlearning techniques for detecting diseases from skin lesion images, a robust\nand publicly accessible foundation model for mpox diagnosis is still lacking\ndue to the unavailability of open-source mpox skin lesion images, multimodal\nclinical data, and specialized training pipelines. To address this gap, we\npropose MpoxVLM, a vision-language model (VLM) designed to detect mpox by\nanalyzing both skin lesion images and patient clinical information. MpoxVLM\nintegrates the CLIP visual encoder, an enhanced Vision Transformer (ViT)\nclassifier for skin lesions, and LLaMA-2-7B models, pre-trained and fine-tuned\non visual instruction-following question-answer pairs from our newly released\nmpox skin lesion dataset. Our work achieves 90.38% accuracy for mpox detection,\noffering a promising pathway to improve early diagnostic accuracy in combating\nmpox.", "paper_summary_zh": "在 COVID-19 大流行之後，在加速的氣候變遷和新興傳染病中，特別是那些源自人畜共通傳染病的疾病，仍然是一個全球性的威脅。猴痘（由猴痘病毒引起）是一個顯著的人畜共通傳染病感染範例，通常未被診斷出來，特別是隨著其皮疹進展到各個階段，使得在具有不同表現形式的多元族群中進行偵測變得複雜。2024 年 8 月，世界衛生組織總幹事第二次宣布猴痘疫情為國際關注的公共衛生緊急事件。儘管已部署深度學習技術用於從皮膚病灶影像中偵測疾病，但由於缺乏開放原始碼的猴痘皮膚病灶影像、多模式臨床資料和專業的訓練管道，因此仍然缺乏一個穩健且公開可用的猴痘診斷基礎模型。為了解決這個差距，我們提出 MpoxVLM，這是一個視覺語言模型 (VLM)，旨在透過分析皮膚病灶影像和患者臨床資訊來偵測猴痘。MpoxVLM 整合了 CLIP 視覺編碼器、一個針對皮膚病灶增強的視覺轉換器 (ViT) 分類器，以及 LLaMA-2-7B 模型，這些模型經過預先訓練和微調，並根據我們新發布的猴痘皮膚病灶資料集中的視覺指令遵循問題解答配對。我們的研究在猴痘偵測方面達到了 90.38% 的準確度，為提高早期診斷準確度以對抗猴痘提供了有希望的途徑。", "author": "Xu Cao et.al.", "authors": "Xu Cao, Wenqian Ye, Kenny Moise, Megan Coffee", "id": "2411.10888v1", "paper_url": "http://arxiv.org/abs/2411.10888v1", "repo": "null"}}