{"2406.06061": {"publish_time": "2024-06-10", "title": "Greedy SLIM: A SLIM-Based Approach For Preference Elicitation", "paper_summary": "Preference elicitation is an active learning approach to tackle the\ncold-start problem of recommender systems. Roughly speaking, new users are\nasked to rate some carefully selected items in order to compute appropriate\nrecommendations for them. To the best of our knowledge, we are the first to\npropose a method for preference elicitation that is based on SLIM , a\nstate-of-the-art technique for top-N recommendation. Our approach mainly\nconsists of a new training technique for SLIM, which we call Greedy SLIM. This\ntechnique iteratively selects items for the training in order to minimize the\nSLIM loss greedily. We conduct offline experiments as well as a user study to\nassess the performance of this new method. The results are remarkable,\nespecially with respect to the user study. We conclude that Greedy SLIM seems\nto be more suitable for preference elicitation than widely used methods based\non latent factor models.", "paper_summary_zh": "偏好引導是一種主動學習方法，用於解決推薦系統的冷啟動問題。粗略來說，會要求新使用者評分一些經過精心挑選的項目，以便為他們計算出合適的推薦。據我們所知，我們是第一個提出基於 SLIM（一種最先進的頂尖推薦技術）的偏好引導方法。我們的做法主要包含一種 SLIM 的新訓練技術，我們稱之為貪婪 SLIM。此技術會反覆選擇訓練項目，以貪婪的方式最小化 SLIM 損失。我們進行了離線實驗和使用者研究，以評估此新方法的效能。結果非常顯著，特別是在使用者研究方面。我們得出結論，與基於潛在因子模型的廣泛使用方法相比，貪婪 SLIM 似乎更適合偏好引導。", "author": "Claudius Proissl et.al.", "authors": "Claudius Proissl, Amel Vatic, Helmut Waldschmidt", "id": "2406.06061v1", "paper_url": "http://arxiv.org/abs/2406.06061v1", "repo": "null"}}