{"2502.00568": {"publish_time": "2025-02-01", "title": "Generating crossmodal gene expression from cancer histopathology improves multimodal AI predictions", "paper_summary": "Emerging research has highlighted that artificial intelligence based\nmultimodal fusion of digital pathology and transcriptomic features can improve\ncancer diagnosis (grading/subtyping) and prognosis (survival risk) prediction.\nHowever, such direct fusion for joint decision is impractical in real clinical\nsettings, where histopathology is still the gold standard for diagnosis and\ntranscriptomic tests are rarely requested, at least in the public healthcare\nsystem. With our novel diffusion based crossmodal generative AI model PathGen,\nwe show that genomic expressions synthesized from digital histopathology\njointly predicts cancer grading and patient survival risk with high accuracy\n(state-of-the-art performance), certainty (through conformal coverage\nguarantee) and interpretability (through distributed attention maps). PathGen\ncode is available for open use by the research community through GitHub at\nhttps://github.com/Samiran-Dey/PathGen.", "paper_summary_zh": "新興研究強調，基於人工智慧的多模態融合數位病理學和轉錄組特徵，可以改善癌症診斷（分級/分型）和預後（存活風險）預測。\n然而，這種直接融合對於聯合決策在實際臨床環境中並不切實際，在實際臨床環境中，組織病理學仍然是診斷的黃金標準，而轉錄組檢測很少被要求，至少在公共醫療保健系統中是如此。透過我們新穎的基於擴散的跨模態生成式 AI 模型 PathGen，我們展示了從數位組織病理學合成的基因體表達共同預測癌症分級和患者存活風險，具有很高的準確度（最先進的效能）、確定性（透過共形覆蓋保證）和可解釋性（透過分佈式注意力圖）。PathGen 程式碼可透過 GitHub 上的 https://github.com/Samiran-Dey/PathGen 供研究社群公開使用。", "author": "Samiran Dey et.al.", "authors": "Samiran Dey, Christopher R. S. Banerji, Partha Basuchowdhuri, Sanjoy K. Saha, Deepak Parashar, Tapabrata Chakraborti", "id": "2502.00568v3", "paper_url": "http://arxiv.org/abs/2502.00568v3", "repo": "https://github.com/Samiran-Dey/PathoGen"}}