{"2501.12104": {"publish_time": "2025-01-21", "title": "Teacher Encoder-Student Decoder Denoising Guided Segmentation Network for Anomaly Detection", "paper_summary": "Visual anomaly detection is a highly challenging task, often categorized as a\none-class classification and segmentation problem. Recent studies have\ndemonstrated that the student-teacher (S-T) framework effectively addresses\nthis challenge. However, most S-T frameworks rely solely on pre-trained teacher\nnetworks to guide student networks in learning multi-scale similar features,\noverlooking the potential of the student networks to enhance learning through\nmulti-scale feature fusion. In this study, we propose a novel model named\nPFADSeg, which integrates a pre-trained teacher network, a denoising student\nnetwork with multi-scale feature fusion, and a guided anomaly segmentation\nnetwork into a unified framework. By adopting a unique teacher-encoder and\nstudent-decoder denoising mode, the model improves the student network's\nability to learn from teacher network features. Furthermore, an adaptive\nfeature fusion mechanism is introduced to train a self-supervised segmentation\nnetwork that synthesizes anomaly masks autonomously, significantly increasing\ndetection performance. Evaluated on the MVTec AD dataset, PFADSeg achieves\nstate-of-the-art results with an image-level AUC of 98.9%, a pixel-level mean\nprecision of 76.4%, and an instance-level mean precision of 78.7%.", "paper_summary_zh": "視覺異常偵測是一項極具挑戰性的任務，通常被歸類為一類分類和分割問題。最近的研究表明，學生-教師 (S-T) 框架有效地應對了這一挑戰。然而，大多數 S-T 框架僅依賴預先訓練的教師網路來指導學生網路學習多尺度相似特徵，忽視了學生網路通過多尺度特徵融合增強學習的可能性。在本研究中，我們提出了一個名為 PFADSeg 的新模型，它將預訓練的教師網路、具有多尺度特徵融合的去噪學生網路和引導異常分割網路整合到一個統一的框架中。通過採用獨特的教師編碼器和學生解碼器去噪模式，該模型提高了學生網路從教師網路特徵中學習的能力。此外，還引入了一個自適應特徵融合機制來訓練一個自監督分割網路，該網路可以自動合成異常遮罩，從而顯著提高檢測性能。在 MVTec AD 資料集上進行評估，PFADSeg 達到了最先進的結果，圖像級別 AUC 為 98.9%，像素級別平均精度為 76.4%，實例級別平均精度為 78.7%。", "author": "ShiXuan Song et.al.", "authors": "ShiXuan Song, Hao Chen, Shu Hu, Xin Wang, Jinrong Hu, Xi Wu", "id": "2501.12104v1", "paper_url": "http://arxiv.org/abs/2501.12104v1", "repo": "null"}}