{"2411.14883": {"publish_time": "2024-11-22", "title": "Boundless Across Domains: A New Paradigm of Adaptive Feature and Cross-Attention for Domain Generalization in Medical Image Segmentation", "paper_summary": "Domain-invariant representation learning is a powerful method for domain\ngeneralization. Previous approaches face challenges such as high computational\ndemands, training instability, and limited effectiveness with high-dimensional\ndata, potentially leading to the loss of valuable features. To address these\nissues, we hypothesize that an ideal generalized representation should exhibit\nsimilar pattern responses within the same channel across cross-domain images.\nBased on this hypothesis, we use deep features from the source domain as\nqueries, and deep features from the generated domain as keys and values.\nThrough a cross-channel attention mechanism, the original deep features are\nreconstructed into robust regularization representations, forming an explicit\nconstraint that guides the model to learn domain-invariant representations.\nAdditionally, style augmentation is another common method. However, existing\nmethods typically generate new styles through convex combinations of source\ndomains, which limits the diversity of training samples by confining the\ngenerated styles to the original distribution. To overcome this limitation, we\npropose an Adaptive Feature Blending (AFB) method that generates\nout-of-distribution samples while exploring the in-distribution space,\nsignificantly expanding the domain range. Extensive experimental results\ndemonstrate that our proposed methods achieve superior performance on two\nstandard domain generalization benchmarks for medical image segmentation.", "paper_summary_zh": "領域不變表示學習是領域泛化的一種強大方法。先前的做法面臨諸如高計算需求、訓練不穩定以及對高維數據的有效性有限等挑戰，可能會導致有價值特徵的遺失。為了解決這些問題，我們假設一個理想的泛化表示應在跨領域影像中展現出相同通道內相似的模式反應。基於此假設，我們使用來自來源領域的深度特徵作為查詢，並使用來自生成領域的深度特徵作為鍵和值。透過跨通道注意力機制，原始深度特徵被重建為穩健的正則化表示，形成一個引導模型學習領域不變表示的明確約束。此外，樣式擴充是另一種常見方法。然而，現有方法通常透過來源領域的凸組合來生成新的樣式，這會將生成的樣式限制在原始分佈中，進而限制訓練樣本的多樣性。為了克服此限制，我們提出了一種自適應特徵混合 (AFB) 方法，該方法在探索分佈內空間的同時生成分佈外樣本，大幅擴展了領域範圍。廣泛的實驗結果證明，我們提出的方法在兩個標準醫學影像分割領域泛化基準上取得了卓越的效能。", "author": "Yuheng Xu et.al.", "authors": "Yuheng Xu, Taiping Zhang", "id": "2411.14883v1", "paper_url": "http://arxiv.org/abs/2411.14883v1", "repo": "null"}}