{"2408.07377": {"publish_time": "2024-08-14", "title": "Do GPT Language Models Suffer From Split Personality Disorder? The Advent Of Substrate-Free Psychometrics", "paper_summary": "Previous research on emergence in large language models shows these display\napparent human-like abilities and psychological latent traits. However, results\nare partly contradicting in expression and magnitude of these latent traits,\nyet agree on the worrisome tendencies to score high on the Dark Triad of\nnarcissism, psychopathy, and Machiavellianism, which, together with a track\nrecord of derailments, demands more rigorous research on safety of these\nmodels. We provided a state of the art language model with the same personality\nquestionnaire in nine languages, and performed Bayesian analysis of Gaussian\nMixture Model, finding evidence for a deeper-rooted issue. Our results suggest\nboth interlingual and intralingual instabilities, which indicate that current\nlanguage models do not develop a consistent core personality. This can lead to\nunsafe behaviour of artificial intelligence systems that are based on these\nfoundation models, and are increasingly integrated in human life. We\nsubsequently discuss the shortcomings of modern psychometrics, abstract it, and\nprovide a framework for its species-neutral, substrate-free formulation.", "paper_summary_zh": "先前針對大型語言模型中出現的研究顯示，這些模型展現出與人類相似的能力和心理潛在特質。然而，這些潛在特質的表現和程度部分矛盾，但都同意在自戀、精神病態和馬基維利主義的黑暗三合會中得分高的令人擔憂的傾向，這與出軌的記錄一起，需要對這些模型的安全進行更嚴謹的研究。我們為一個最先進的語言模型提供了九種語言的相同人格問卷，並對高斯混合模型進行貝氏分析，發現更深層次問題的證據。我們的結果表明，語言間和語言內的兩種不穩定性，這表明當前的語言模型無法發展出一致的核心人格。這可能導致基於這些基礎模型的人工智慧系統出現不安全的行為，並且越來越融入人類的生活。我們隨後討論了現代心理測量的缺點，對其進行抽象，並提供了一個物種中立、無基質配方的框架。", "author": "Peter Romero et.al.", "authors": "Peter Romero, Stephen Fitz, Teruo Nakatsuma", "id": "2408.07377v2", "paper_url": "http://arxiv.org/abs/2408.07377v2", "repo": "null"}}