{"2406.12725": {"publish_time": "2024-06-18", "title": "Can Large Language Models Code Like a Linguist?: A Case Study in Low Resource Sound Law Induction", "paper_summary": "Historical linguists have long written a kind of incompletely formalized\n''program'' that converts reconstructed words in an ancestor language into\nwords in one of its attested descendants that consist of a series of ordered\nstring rewrite functions (called sound laws). They do this by observing pairs\nof words in the reconstructed language (protoforms) and the descendent language\n(reflexes) and constructing a program that transforms protoforms into reflexes.\nHowever, writing these programs is error-prone and time-consuming. Prior work\nhas successfully scaffolded this process computationally, but fewer researchers\nhave tackled Sound Law Induction (SLI), which we approach in this paper by\ncasting it as Programming by Examples. We propose a language-agnostic solution\nthat utilizes the programming ability of Large Language Models (LLMs) by\ngenerating Python sound law programs from sound change examples. We evaluate\nthe effectiveness of our approach for various LLMs, propose effective methods\nto generate additional language-agnostic synthetic data to fine-tune LLMs for\nSLI, and compare our method with existing automated SLI methods showing that\nwhile LLMs lag behind them they can complement some of their weaknesses.", "paper_summary_zh": "歷史語言學家長期以來撰寫一種不完全形式化的「程式」，將祖語中重建的詞彙轉換成其已證後代之一種語言中的詞彙，該語言由一系列已排序的字串改寫函數（稱為音律）組成。他們透過觀察重建語言（原形）和後代語言（反映）中的詞彙對，並建構一個將原形轉換為反映的程式來執行此操作。不過，撰寫這些程式容易出錯且耗時。先前的工作已成功以運算方式架構此流程，但較少研究人員著手處理音律歸納 (SLI)，而我們在本文中將其視為範例程式設計來探討。我們提出一個與語言無關的解決方案，透過從音變範例產生 Python 音律程式，來利用大型語言模型 (LLM) 的程式設計能力。我們評估各種 LLM 的方法有效性，提出有效的方法來產生額外的與語言無關的合成資料，以微調 LLM 以進行 SLI，並將我們的模型與現有的自動化 SLI 方法進行比較，顯示 LLM 雖然落後於這些方法，但它們可以彌補某些弱點。", "author": "Atharva Naik et.al.", "authors": "Atharva Naik, Kexun Zhang, Nathaniel Robinson, Aravind Mysore, Clayton Marr, Hong Sng Rebecca Byrnes, Anna Cai, Kalvin Chang, David Mortensen", "id": "2406.12725v1", "paper_url": "http://arxiv.org/abs/2406.12725v1", "repo": "null"}}