{"2407.16222": {"publish_time": "2024-07-23", "title": "PreAlign: Boosting Cross-Lingual Transfer by Early Establishment of Multilingual Alignment", "paper_summary": "Large language models demonstrate reasonable multilingual abilities, despite\npredominantly English-centric pretraining. However, the spontaneous\nmultilingual alignment in these models is shown to be weak, leading to\nunsatisfactory cross-lingual transfer and knowledge sharing. Previous works\nattempt to address this issue by explicitly injecting multilingual alignment\ninformation during or after pretraining. Thus for the early stage in\npretraining, the alignment is weak for sharing information or knowledge across\nlanguages. In this paper, we propose PreAlign, a framework that establishes\nmultilingual alignment prior to language model pretraining. PreAlign injects\nmultilingual alignment by initializing the model to generate similar\nrepresentations of aligned words and preserves this alignment using a\ncode-switching strategy during pretraining. Extensive experiments in a\nsynthetic English to English-Clone setting demonstrate that PreAlign\nsignificantly outperforms standard multilingual joint training in language\nmodeling, zero-shot cross-lingual transfer, and cross-lingual knowledge\napplication. Further experiments in real-world scenarios further validate\nPreAlign's effectiveness across various model sizes.", "paper_summary_zh": "大型語言模型展現出合理的跨語言能力，儘管預訓練以英語為主。然而，這些模型中的自發跨語言對齊被證明很弱，導致不令人滿意的跨語言轉移和知識共享。先前的研究嘗試透過在預訓練期間或之後明確注入多語言對齊資訊來解決這個問題。因此，在預訓練的早期階段，對齊很弱，無法跨語言共享資訊或知識。在本文中，我們提出 PreAlign，一個在語言模型預訓練之前建立多語言對齊的框架。PreAlign 透過將模型初始化為產生對齊字詞的類似表示，並在預訓練期間使用代碼轉換策略保留此對齊，來注入多語言對齊。在英語到英語複製的合成設定中進行的廣泛實驗證明，PreAlign 在語言建模、零次方跨語言轉移和跨語言知識應用中明顯優於標準多語言聯合訓練。在真實世界場景中的進一步實驗進一步驗證了 PreAlign 在各種模型規模中的有效性。", "author": "Jiahuan Li et.al.", "authors": "Jiahuan Li, Shujian Huang, Xinyu Dai, Jiajun Chen", "id": "2407.16222v1", "paper_url": "http://arxiv.org/abs/2407.16222v1", "repo": "null"}}