{"2412.13008": {"publish_time": "2024-12-17", "title": "RCLMuFN: Relational Context Learning and Multiplex Fusion Network for Multimodal Sarcasm Detection", "paper_summary": "Sarcasm typically conveys emotions of contempt or criticism by expressing a\nmeaning that is contrary to the speaker's true intent. Accurate detection of\nsarcasm aids in identifying and filtering undesirable information on the\nInternet, thereby reducing malicious defamation and rumor-mongering.\nNonetheless, the task of automatic sarcasm detection remains highly challenging\nfor machines, as it critically depends on intricate factors such as relational\ncontext. Most existing multimodal sarcasm detection methods focus on\nintroducing graph structures to establish entity relationships between text and\nimages while neglecting to learn the relational context between text and\nimages, which is crucial evidence for understanding the meaning of sarcasm. In\naddition, the meaning of sarcasm changes with the evolution of different\ncontexts, but existing methods may not be accurate in modeling such dynamic\nchanges, limiting the generalization ability of the models. To address the\nabove issues, we propose a relational context learning and multiplex fusion\nnetwork (RCLMuFN) for multimodal sarcasm detection. Firstly, we employ four\nfeature extractors to comprehensively extract features from raw text and\nimages, aiming to excavate potential features that may have been previously\noverlooked. Secondly, we utilize the relational context learning module to\nlearn the contextual information of text and images and capture the dynamic\nproperties through shallow and deep interactions. Finally, we employ a\nmultiplex feature fusion module to enhance the generalization of the model by\npenetratingly integrating multimodal features derived from various interaction\ncontexts. Extensive experiments on two multimodal sarcasm detection datasets\nshow that our proposed method achieves state-of-the-art performance.", "paper_summary_zh": "<paragraph>諷刺通常透過表達與說話者真實意圖相反的意義來傳達輕蔑或批評的情緒。準確地偵測諷刺有助於辨識和過濾網路上不適當的資訊，進而減少惡意的誹謗和散播謠言。儘管如此，自動諷刺偵測的任務對於機器來說仍然極具挑戰性，因為它嚴重依賴於關係脈絡等複雜因素。現有的多模態諷刺偵測方法大多著重於引入圖形結構，以建立文字和影像之間的實體關係，卻忽略了學習文字和影像之間的關係脈絡，而這對於理解諷刺的意義至關重要。此外，諷刺的意義會隨著不同脈絡的演變而改變，但現有的方法可能無法準確地建模這種動態變化，進而限制了模型的泛化能力。為了解決上述問題，我們提出了一個關係脈絡學習和多重融合網路 (RCLMuFN)，用於多模態諷刺偵測。首先，我們採用四個特徵萃取器，從原始文字和影像中全面萃取出特徵，目的是挖掘先前可能被忽略的潛在特徵。其次，我們利用關係脈絡學習模組，學習文字和影像的脈絡資訊，並透過淺層和深層互動擷取動態屬性。最後，我們採用多重特徵融合模組，透過深入整合來自各種互動脈絡的多模態特徵，來增強模型的泛化能力。在兩個多模態諷刺偵測資料集上的廣泛實驗顯示，我們提出的方法達到了最先進的效能。</paragraph>", "author": "Tongguan Wang et.al.", "authors": "Tongguan Wang, Junkai Li, Guixin Su, Yongcheng Zhang, Dongyu Su, Yuxue Hu, Ying Sha", "id": "2412.13008v1", "paper_url": "http://arxiv.org/abs/2412.13008v1", "repo": "null"}}