{"2501.06932": {"publish_time": "2025-01-12", "title": "Harnessing Large Language Models for Disaster Management: A Survey", "paper_summary": "Large language models (LLMs) have revolutionized scientific research with\ntheir exceptional capabilities and transformed various fields. Among their\npractical applications, LLMs have been playing a crucial role in mitigating\nthreats to human life, infrastructure, and the environment. Despite growing\nresearch in disaster LLMs, there remains a lack of systematic review and\nin-depth analysis of LLMs for natural disaster management. To address the gap,\nthis paper presents a comprehensive survey of existing LLMs in natural disaster\nmanagement, along with a taxonomy that categorizes existing works based on\ndisaster phases and application scenarios. By collecting public datasets and\nidentifying key challenges and opportunities, this study aims to guide the\nprofessional community in developing advanced LLMs for disaster management to\nenhance the resilience against natural disasters.", "paper_summary_zh": "大型語言模型 (LLM) 以其卓越的能力徹底改變了科學研究，並轉變了各個領域。在其實際應用中，LLM 在減輕對人類生命、基礎設施和環境的威脅方面發揮了至關重要的作用。儘管對災害 LLM 的研究不斷增加，但仍缺乏對自然災害管理 LLM 的系統性回顧和深入分析。為了彌補這一差距，本文對自然災害管理中現有的 LLM 進行了全面的調查，並提出了基於災害階段和應用場景對現有工作進行分類的分類法。通過收集公共數據集並確定關鍵挑戰和機會，本研究旨在指導專業社群開發用於災害管理的高級 LLM，以增強抵禦自然災害的能力。", "author": "Zhenyu Lei et.al.", "authors": "Zhenyu Lei, Yushun Dong, Weiyu Li, Rong Ding, Qi Wang, Jundong Li", "id": "2501.06932v1", "paper_url": "http://arxiv.org/abs/2501.06932v1", "repo": "null"}}