{"2408.01090": {"publish_time": "2024-08-02", "title": "General-purpose Dataflow Model with Neuromorphic Primitives", "paper_summary": "Neuromorphic computing exhibits great potential to provide high-performance\nbenefits in various applications beyond neural networks. However, a\ngeneral-purpose program execution model that aligns with the features of\nneuromorphic computing is required to bridge the gap between program\nversatility and neuromorphic hardware efficiency. The dataflow model offers a\npotential solution, but it faces high graph complexity and incompatibility with\nneuromorphic hardware when dealing with control flow programs, which decreases\nthe programmability and performance. Here, we present a dataflow model tailored\nfor neuromorphic hardware, called neuromorphic dataflow, which provides a\ncompact, concise, and neuromorphic-compatible program representation for\ncontrol logic. The neuromorphic dataflow introduces \"when\" and \"where\"\nprimitives, which restructure the view of control. The neuromorphic dataflow\nembeds these primitives in the dataflow schema with the plasticity inherited\nfrom the spiking algorithms. Our method enables the deployment of\ngeneral-purpose programs on neuromorphic hardware with both programmability and\nplasticity, while fully utilizing the hardware's potential.", "paper_summary_zh": "神經形態運算在神經網路以外的各種應用中展現出極大的潛力，可提供高性能優勢。然而，需要一個與神經形態運算特徵相符的通用程式執行模型來彌合程式多功能性和神經形態硬體效率之間的差距。資料流程模型提供了一個可能的解決方案，但它在處理控制流程程式時面臨圖形複雜度高和與神經形態硬體不相容的問題，這降低了可程式性和效能。在此，我們提出了一個針對神經形態硬體量身打造的資料流程模型，稱為神經形態資料流程，它為控制邏輯提供了一個緊湊、簡潔且與神經形態相容的程式表示。神經形態資料流程引入了「何時」和「何處」的原語，它們重構了控制的觀點。神經形態資料流程將這些原語嵌入資料流程架構中，並具有從尖峰演算法繼承而來的可塑性。我們的技術可以在神經形態硬體上部署通用程式，同時具備可程式性和可塑性，同時充分利用硬體的潛力。", "author": "Weihao Zhang et.al.", "authors": "Weihao Zhang, Yu Du, Hongyi Li, Songchen Ma, Rong Zhao", "id": "2408.01090v1", "paper_url": "http://arxiv.org/abs/2408.01090v1", "repo": "null"}}