{"2408.12809": {"publish_time": "2024-08-23", "title": "DutyTTE: Deciphering Uncertainty in Origin-Destination Travel Time Estimation", "paper_summary": "Uncertainty quantification in travel time estimation (TTE) aims to estimate\nthe confidence interval for travel time, given the origin (O), destination (D),\nand departure time (T). Accurately quantifying this uncertainty requires\ngenerating the most likely path and assessing travel time uncertainty along the\npath. This involves two main challenges: 1) Predicting a path that aligns with\nthe ground truth, and 2) modeling the impact of travel time in each segment on\noverall uncertainty under varying conditions. We propose DutyTTE to address\nthese challenges. For the first challenge, we introduce a deep reinforcement\nlearning method to improve alignment between the predicted path and the ground\ntruth, providing more accurate travel time information from road segments to\nimprove TTE. For the second challenge, we propose a mixture of experts guided\nuncertainty quantification mechanism to better capture travel time uncertainty\nfor each segment under varying contexts. Additionally, we calibrate our results\nusing Hoeffding's upper-confidence bound to provide statistical guarantees for\nthe estimated confidence intervals. Extensive experiments on two real-world\ndatasets demonstrate the superiority of our proposed method.", "paper_summary_zh": "在旅遊時間估計 (TTE) 中的不確定量化旨在估計旅遊時間的信心區間，給定起點 (O)、目的地 (D) 和出發時間 (T)。準確量化此不確定性需要產生最可能的路線並評估沿路線的旅遊時間不確定性。這涉及兩個主要挑戰：1) 預測與地面實況相符的路線，以及 2) 在不同條件下對每個區段的旅遊時間影響進行建模，以了解整體不確定性。我們提出 DutyTTE 來應對這些挑戰。對於第一個挑戰，我們引入深度強化學習方法來改善預測路線與地面實況之間的對齊，從道路區段提供更準確的旅遊時間資訊，以改善 TTE。對於第二個挑戰，我們提出一個由專家引導的不確定性量化機制，以在不同的情境下更好地捕捉每個區段的旅遊時間不確定性。此外，我們使用 Hoeffding 的上置信界校正我們的結果，以提供估計信心區間的統計保證。在兩個真實世界資料集上的廣泛實驗證明了我們提出的方法的優越性。", "author": "Xiaowei Mao et.al.", "authors": "Xiaowei Mao, Yan Lin, Shengnan Guo, Yubin Chen, Xingyu Xian, Haomin Wen, Qisen Xu, Youfang Lin, Huaiyu Wan", "id": "2408.12809v1", "paper_url": "http://arxiv.org/abs/2408.12809v1", "repo": "null"}}