{"2411.08504": {"publish_time": "2024-11-13", "title": "Towards Objective and Unbiased Decision Assessments with LLM-Enhanced Hierarchical Attention Networks", "paper_summary": "How objective and unbiased are we while making decisions? This work\ninvestigates cognitive bias identification in high-stake decision making\nprocess by human experts, questioning its effectiveness in real-world settings,\nsuch as candidates assessments for university admission. We begin with a\nstatistical analysis assessing correlations among different decision points\namong in the current process, which discovers discrepancies that imply\ncognitive bias and inconsistency in decisions. This motivates our exploration\nof bias-aware AI-augmented workflow that surpass human judgment. We propose\nBGM-HAN, a hierarchical attention network enhanced by byte-pair encoding,\nmulti-head attention and gated residual connection. Using it as backbone model,\nwe further propose a Shortlist-Analyse-Recommend (SAR) agentic workflow, which\nsimulate real-world decision-making. In our experiments, both the proposed\nmodel and the agentic workflow significantly improves on both human judgment\nand alternative models, validated with real-world data.", "paper_summary_zh": "在做決策時，我們有多客觀公正？這項研究探討了人類專家在高風險決策過程中認知偏差的辨識，質疑其在現實世界中的有效性，例如大學入學的候選人評估。我們從統計分析開始，評估當前流程中不同決策點之間的相關性，發現了暗示認知偏差和決策不一致的差異。這激勵我們探索超越人類判斷的具備偏差感知的人工智慧增強工作流程。我們提出了 BGM-HAN，一個由位元組對編碼、多頭注意力和閘控殘差連接增強的分層注意力網路。使用它作為骨幹模型，我們進一步提出了模擬現實世界決策的候選名單分析推薦 (SAR) 代理工作流程。在我們的實驗中，提出的模型和代理工作流程都顯著優於人類判斷和替代模型，並使用現實世界資料驗證。", "author": "Junhua Liu et.al.", "authors": "Junhua Liu, Kwan Hui Lim, Roy Ka-Wei Lee", "id": "2411.08504v1", "paper_url": "http://arxiv.org/abs/2411.08504v1", "repo": "null"}}