{"2405.17324": {"publish_time": "2024-05-27", "title": "Leveraging Offline Data in Linear Latent Bandits", "paper_summary": "Sequential decision-making domains such as recommender systems, healthcare\nand education often have unobserved heterogeneity in the population that can be\nmodeled using latent bandits $-$ a framework where an unobserved latent state\ndetermines the model for a trajectory. While the latent bandit framework is\ncompelling, the extent of its generality is unclear. We first address this by\nestablishing a de Finetti theorem for decision processes, and show that\n$\\textit{every}$ exchangeable and coherent stateless decision process is a\nlatent bandit. The latent bandit framework lends itself particularly well to\nonline learning with offline datasets, a problem of growing interest in\nsequential decision-making. One can leverage offline latent bandit data to\nlearn a complex model for each latent state, so that an agent can simply learn\nthe latent state online to act optimally. We focus on a linear model for a\nlatent bandit with $d_A$-dimensional actions, where the latent states lie in an\nunknown $d_K$-dimensional subspace for $d_K \\ll d_A$. We present SOLD, a novel\nprincipled method to learn this subspace from short offline trajectories with\nguarantees. We then provide two methods to leverage this subspace online:\nLOCAL-UCB and ProBALL-UCB. We demonstrate that LOCAL-UCB enjoys $\\tilde\nO(\\min(d_A\\sqrt{T}, d_K\\sqrt{T}(1+\\sqrt{d_AT/d_KN})))$ regret guarantees, where\nthe effective dimension is lower when the size $N$ of the offline dataset is\nlarger. ProBALL-UCB enjoys a slightly weaker guarantee, but is more practical\nand computationally efficient. Finally, we establish the efficacy of our\nmethods using experiments on both synthetic data and real-life movie\nrecommendation data from MovieLens.", "paper_summary_zh": "<paragraph>序貫決策制定領域，例如推薦系統、醫療保健和教育，通常在人口中具有未觀察到的異質性，可以使用潛在強盜進行建模，潛在強盜是一個框架，其中未觀察到的潛在狀態決定軌跡的模型。雖然潛在強盜框架引人注目，但其普遍性的程度尚不清楚。我們首先通過建立決策過程的德芬內蒂定理來解決這個問題，並證明每個可交換且連貫的無狀態決策過程都是一個潛在強盜。潛在強盜框架特別適用於離線數據集的線上學習，這是序貫決策制定中越來越受關注的問題。人們可以利用離線潛在強盜數據為每個潛在狀態學習一個複雜的模型，以便代理可以簡單地線上學習潛在狀態以採取最佳行動。我們專注於一個潛在強盜的線性模型，其具有 $d_A$ 維動作，其中潛在狀態位於未知的 $d_K$ 維子空間中，其中 $d_K \\ll d_A$。我們提出了 SOLD，這是一種新穎的原理方法，可用於從具有保證的短離線軌跡中學習這個子空間。然後，我們提供了兩種方法來線上利用這個子空間：LOCAL-UCB 和 ProBALL-UCB。我們證明 LOCAL-UCB 享有 $\\tilde O(\\min(d_A\\sqrt{T}, d_K\\sqrt{T}(1+\\sqrt{d_AT/d_KN})))$ 後悔保證，其中當離線數據集的大小 $N$ 較大時，有效維度較低。ProBALL-UCB 享有稍弱的保證，但更實用且計算效率更高。最後，我們使用來自 MovieLens 的合成數據和真實電影推薦數據的實驗，建立了我們方法的功效。</paragraph>", "author": "Chinmaya Kausik et.al.", "authors": "Chinmaya Kausik, Kevin Tan, Ambuj Tewari", "id": "2405.17324v1", "paper_url": "http://arxiv.org/abs/2405.17324v1", "repo": "null"}}