{"2412.00315": {"publish_time": "2024-11-30", "title": "One Model for One Graph: A New Perspective for Pretraining with Cross-domain Graphs", "paper_summary": "Graph Neural Networks (GNNs) have emerged as a powerful tool to capture\nintricate network patterns, achieving success across different domains.\nHowever, existing GNNs require careful domain-specific architecture designs and\ntraining from scratch on each dataset, leading to an expertise-intensive\nprocess with difficulty in generalizing across graphs from different domains.\nTherefore, it can be hard for practitioners to infer which GNN model can\ngeneralize well to graphs from their domains. To address this challenge, we\npropose a novel cross-domain pretraining framework, \"one model for one graph,\"\nwhich overcomes the limitations of previous approaches that failed to use a\nsingle GNN to capture diverse graph patterns across domains with significant\ngaps. Specifically, we pretrain a bank of expert models, with each one\ncorresponding to a specific dataset. When inferring to a new graph, gating\nfunctions choose a subset of experts to effectively integrate prior model\nknowledge while avoiding negative transfer. Extensive experiments consistently\ndemonstrate the superiority of our proposed method on both link prediction and\nnode classification tasks.", "paper_summary_zh": "圖形神經網路 (GNN) 已成為捕捉複雜網路模式的強大工具，在不同領域皆取得成功。\n然而，現有的 GNN 需要仔細的特定於領域的架構設計，並針對每個資料集從頭開始訓練，導致專業知識密集的過程，難以概括來自不同領域的圖形。\n因此，從業者很難推斷哪個 GNN 模型可以很好地概括到其領域的圖形。為了應對這一挑戰，我們提出了一個新穎的跨領域預訓練框架，「一個模型對應一個圖形」，它克服了先前方法的限制，這些限制無法使用單個 GNN 來捕捉跨越具有顯著差距的領域的不同圖形模式。具體來說，我們預訓練了一組專家模型，每一個都對應一個特定資料集。在推論到一個新圖形時，閘控函數會選擇一個專家子集，以有效整合先前的模型知識，同時避免負面傳遞。廣泛的實驗持續證明了我們提出的方法在連結預測和節點分類任務上的優越性。", "author": "Jingzhe Liu et.al.", "authors": "Jingzhe Liu, Haitao Mao, Zhikai Chen, Wenqi Fan, Mingxuan Ju, Tong Zhao, Neil Shah, Jiliang Tang", "id": "2412.00315v1", "paper_url": "http://arxiv.org/abs/2412.00315v1", "repo": "null"}}