{"2504.10340": {"publish_time": "2025-04-14", "title": "Forecasting from Clinical Textual Time Series: Adaptations of the Encoder and Decoder Language Model Families", "paper_summary": "Clinical case reports encode rich, temporal patient trajectories that are\noften underexploited by traditional machine learning methods relying on\nstructured data. In this work, we introduce the forecasting problem from\ntextual time series, where timestamped clinical findings--extracted via an\nLLM-assisted annotation pipeline--serve as the primary input for prediction. We\nsystematically evaluate a diverse suite of models, including fine-tuned\ndecoder-based large language models and encoder-based transformers, on tasks of\nevent occurrence prediction, temporal ordering, and survival analysis. Our\nexperiments reveal that encoder-based models consistently achieve higher F1\nscores and superior temporal concordance for short- and long-horizon event\nforecasting, while fine-tuned masking approaches enhance ranking performance.\nIn contrast, instruction-tuned decoder models demonstrate a relative advantage\nin survival analysis, especially in early prognosis settings. Our sensitivity\nanalyses further demonstrate the importance of time ordering, which requires\nclinical time series construction, as compared to text ordering, the format of\nthe text inputs that LLMs are classically trained on. This highlights the\nadditional benefit that can be ascertained from time-ordered corpora, with\nimplications for temporal tasks in the era of widespread LLM use.", "paper_summary_zh": "臨床案例報告編碼了豐富的、時間序列的病人軌跡，而這些軌跡往往沒有被依賴結構化數據的傳統機器學習方法充分利用。在這項工作中，我們引入了基於文本時間序列的預測問題，其中帶有時間戳的臨床發現——通過 LLM 輔助的註釋管道提取——作為預測的主要輸入。我們系統地評估了一套不同的模型，包括微調的基於解碼器的大型語言模型和基於編碼器的變換器，用於事件發生預測、時間排序和生存分析等任務。我們的實驗表明，基於編碼器的模型在短期和長期事件預測中始終能達到更高的 F1 分數和更好的時間一致性，而微調的掩碼方法則能提高排名性能。相比之下，經過指令微調的解碼器模型在生存分析中表現出相對優勢，尤其是在早期預後設定中。我們的敏感性分析進一步證明了時間排序的重要性，時間排序需要構建臨床時間序列，而文本排序是 LLM 經過經典訓練的文本輸入格式。這突出了從時間排序的語料庫中可以獲得的額外好處，這對 LLM 廣泛使用的時代中的時間相關任務具有重要意義。\n", "author": "Shahriar Noroozizadeh et.al.", "authors": "Shahriar Noroozizadeh, Sayantan Kumar, Jeremy C. Weiss", "id": "2504.10340v1", "paper_url": "http://arxiv.org/abs/2504.10340v1", "repo": "null"}}