{"2501.05727": {"publish_time": "2025-01-10", "title": "Enabling Scalable Oversight via Self-Evolving Critic", "paper_summary": "Despite their remarkable performance, the development of Large Language\nModels (LLMs) faces a critical challenge in scalable oversight: providing\neffective feedback for tasks where human evaluation is difficult or where LLMs\noutperform humans. While there is growing interest in using LLMs for critique,\ncurrent approaches still rely on human annotations or more powerful models,\nleaving the issue of enhancing critique capabilities without external\nsupervision unresolved. We introduce SCRIT (Self-evolving CRITic), a framework\nthat enables genuine self-evolution of critique abilities. Technically, SCRIT\nself-improves by training on synthetic data, generated by a contrastive-based\nself-critic that uses reference solutions for step-by-step critique, and a\nself-validation mechanism that ensures critique quality through correction\noutcomes. Implemented with Qwen2.5-72B-Instruct, one of the most powerful LLMs,\nSCRIT achieves up to a 10.3\\% improvement on critique-correction and error\nidentification benchmarks. Our analysis reveals that SCRIT's performance scales\npositively with data and model size, outperforms alternative approaches, and\nbenefits critically from its self-validation component.", "paper_summary_zh": "儘管大型語言模型 (LLM) 表現非凡，但其開發在可擴充監督方面面臨嚴峻挑戰：提供有效回饋以執行人類評估困難或 LLM 優於人類的任務。儘管使用 LLM 進行批判越來越受到關注，但目前的做法仍依賴於人工標註或更強大的模型，因此未能解決在沒有外部監督的情況下提升批判能力的問題。我們推出 SCRIT (自我演化的 CRITic)，這是一個框架，可實現批判能力的真正自我演化。在技術上，SCRIT 透過訓練合成數據來自我提升，這些數據是由對比式自我批判者生成的，該批判者使用參考解答進行逐步批判，以及透過修正結果確保批判品質的自我驗證機制。SCRIT 使用最強大的 LLM 之一 Qwen2.5-72B-Instruct 實作，在批判修正和錯誤辨識基準上取得高達 10.3% 的進步。我們的分析顯示，SCRIT 的效能與資料和模型大小成正比，優於其他方法，並從其自我驗證元件中獲得重大效益。", "author": "Zhengyang Tang et.al.", "authors": "Zhengyang Tang, Ziniu Li, Zhenyang Xiao, Tian Ding, Ruoyu Sun, Benyou Wang, Dayiheng Liu, Fei Huang, Tianyu Liu, Bowen Yu, Junyang Lin", "id": "2501.05727v1", "paper_url": "http://arxiv.org/abs/2501.05727v1", "repo": "null"}}