{"2411.15923": {"publish_time": "2024-11-24", "title": "Deep Learning for automated multi-scale functional field boundaries extraction using multi-date Sentinel-2 and PlanetScope imagery: Case Study of Netherlands and Pakistan", "paper_summary": "This study explores the effectiveness of multi-temporal satellite imagery for\nbetter functional field boundary delineation using deep learning semantic\nsegmentation architecture on two distinct geographical and multi-scale farming\nsystems of Netherlands and Pakistan. Multidate images of April, August and\nOctober 2022 were acquired for PlanetScope and Sentinel-2 in sub regions of\nNetherlands and November 2022, February and March 2023 for selected area of\nDunyapur in Pakistan. For Netherlands, Basic registration crop parcels (BRP)\nvector layer was used as labeled training data. while self-crafted field\nboundary vector data were utilized for Pakistan. Four deep learning models with\nUNET architecture were evaluated using different combinations of multi-date\nimages and NDVI stacks in the Netherlands subregions. A comparative analysis of\nIoU scores assessed the effectiveness of the proposed multi-date NDVI stack\napproach. These findings were then applied for transfer learning, using\npre-trained models from the Netherlands on the selected area in Pakistan.\nAdditionally, separate models were trained using self-crafted field boundary\ndata for Pakistan, and combined models were developed using data from both the\nNetherlands and Pakistan. Results indicate that multi-date NDVI stacks provide\nadditional temporal context, reflecting crop growth over different times of the\nseason. The study underscores the critical role of multi-scale ground\ninformation from diverse geographical areas in developing robust and\nuniversally applicable models for field boundary delineation. The results also\nhighlight the importance of fine spatial resolution for extraction of field\nboundaries in regions with small scale framing. The findings can be extended to\nmulti-scale implementations for improved automatic field boundary delineation\nin heterogeneous agricultural environments.", "paper_summary_zh": "本研究探討了多時相衛星影像的有效性，以使用深度學習語義分割結構在荷蘭和巴基斯坦兩個不同的地理和多尺度農業系統中，進行更好的功能性田間邊界描繪。2022 年 4 月、8 月和 10 月的多日期影像已針對 PlanetScope 和 Sentinel-2 獲取，位於荷蘭的次區域，以及 2022 年 11 月、2023 年 2 月和 3 月，位於巴基斯坦 Dunyapur 的特定區域。對於荷蘭，基本註冊作物地塊 (BRP) 向量圖層用作標籤訓練資料。而自製的田間邊界向量資料則用於巴基斯坦。使用 UNET 結構的四種深度學習模型在荷蘭次區域中使用多日期影像和 NDVI 堆疊的不同組合進行評估。IoU 分數的比較分析評估了所提出的多日期 NDVI 堆疊方法的有效性。然後將這些發現應用於遷移學習，使用來自荷蘭的預訓練模型，於巴基斯坦的特定區域。此外，使用自製的田間邊界資料為巴基斯坦訓練了單獨的模型，並使用來自荷蘭和巴基斯坦的資料開發了組合模型。結果表明，多日期 NDVI 堆疊提供了額外的時間脈絡，反映了不同季節作物的生長情況。本研究強調了來自不同地理區域的多尺度地面資訊在開發用於田間邊界描繪的強健且普遍適用的模型中的關鍵作用。結果也突出了精細空間解析度對於在小規模取景區域中萃取田間邊界的重要性。這些發現可以擴展到多尺度實作，以改善異質農業環境中的自動田間邊界描繪。", "author": "Saba Zahid et.al.", "authors": "Saba Zahid, Sajid Ghuffar, Obaid-ur-Rehman, Syed Roshaan Ali Shah", "id": "2411.15923v1", "paper_url": "http://arxiv.org/abs/2411.15923v1", "repo": "null"}}