{"2412.02099": {"publish_time": "2024-12-03", "title": "AccDiffusion v2: Towards More Accurate Higher-Resolution Diffusion Extrapolation", "paper_summary": "Diffusion models suffer severe object repetition and local distortion when\nthe inference resolution differs from its pre-trained resolution. We propose\nAccDiffusion v2, an accurate method for patch-wise higher-resolution diffusion\nextrapolation without training. Our in-depth analysis in this paper shows that\nusing an identical text prompt for different patches leads to repetitive\ngeneration, while the absence of a prompt undermines image details. In\nresponse, our AccDiffusion v2 novelly decouples the vanilla image-content-aware\nprompt into a set of patch-content-aware prompts, each of which serves as a\nmore precise description of a patch. Further analysis reveals that local\ndistortion arises from inaccurate descriptions in prompts about the local\nstructure of higher-resolution images. To address this issue, AccDiffusion v2,\nfor the first time, introduces an auxiliary local structural information\nthrough ControlNet during higher-resolution diffusion extrapolation aiming to\nmitigate the local distortions. Finally, our analysis indicates that global\nsemantic information is conducive to suppressing both repetitive generation and\nlocal distortion. Hence, our AccDiffusion v2 further proposes dilated sampling\nwith window interaction for better global semantic information during\nhigher-resolution diffusion extrapolation. We conduct extensive experiments,\nincluding both quantitative and qualitative comparisons, to demonstrate the\nefficacy of our AccDiffusion v2. The quantitative comparison shows that\nAccDiffusion v2 achieves state-of-the-art performance in image generation\nextrapolation without training. The qualitative comparison intuitively\nillustrates that AccDiffusion v2 effectively suppresses the issues of\nrepetitive generation and local distortion in image generation extrapolation.\nOur code is available at \\url{https://github.com/lzhxmu/AccDiffusion_v2}.", "paper_summary_zh": "擴散模型在推論解析度與預訓練解析度不同時，會出現嚴重的物件重複和局部扭曲。我們提出 AccDiffusion v2，這是一種準確的方法，可進行區塊式高解析度擴散外推，無需訓練。我們在本文中的深入分析顯示，對不同的區塊使用相同的文字提示會導致重複產生，而沒有提示會損害影像細節。為了解決此問題，我們的 AccDiffusion v2 新穎地將香草影像內容感知提示解耦為一組區塊內容感知提示，每個提示都是一個區塊的更精確描述。進一步的分析表明，局部扭曲是由於提示中對高解析度影像局部結構的不準確描述造成的。為了解決這個問題，AccDiffusion v2 首次在高解析度擴散外推過程中透過 ControlNet 引入了輔助局部結構資訊，旨在減輕局部扭曲。最後，我們的分析表明，全局語義資訊有助於抑制重複產生和局部扭曲。因此，我們的 AccDiffusion v2 進一步提出了擴充採樣和視窗互動，以在高解析度擴散外推過程中獲得更好的全局語義資訊。我們進行了廣泛的實驗，包括量化和質化比較，以證明我們的 AccDiffusion v2 的效能。量化比較顯示，AccDiffusion v2 在影像產生外推中達到了最先進的效能，無需訓練。質化比較直觀地說明了 AccDiffusion v2 有效地抑制了影像產生外推中重複產生和局部扭曲的問題。我們的程式碼可在 \\url{https://github.com/lzhxmu/AccDiffusion_v2} 取得。", "author": "Zhihang Lin et.al.", "authors": "Zhihang Lin, Mingbao Lin, Wengyi Zhan, Rongrong Ji", "id": "2412.02099v1", "paper_url": "http://arxiv.org/abs/2412.02099v1", "repo": "https://github.com/lzhxmu/accdiffusion_v2"}}