{"2409.16735": {"publish_time": "2024-09-25", "title": "GB-RVFL: Fusion of Randomized Neural Network and Granular Ball Computing", "paper_summary": "The random vector functional link (RVFL) network is a prominent\nclassification model with strong generalization ability. However, RVFL treats\nall samples uniformly, ignoring whether they are pure or noisy, and its\nscalability is limited due to the need for inverting the entire training\nmatrix. To address these issues, we propose granular ball RVFL (GB-RVFL) model,\nwhich uses granular balls (GBs) as inputs instead of training samples. This\napproach enhances scalability by requiring only the inverse of the GB center\nmatrix and improves robustness against noise and outliers through the coarse\ngranularity of GBs. Furthermore, RVFL overlooks the dataset's geometric\nstructure. To address this, we propose graph embedding GB-RVFL (GE-GB-RVFL)\nmodel, which fuses granular computing and graph embedding (GE) to preserve the\ntopological structure of GBs. The proposed GB-RVFL and GE-GB-RVFL models are\nevaluated on KEEL, UCI, NDC and biomedical datasets, demonstrating superior\nperformance compared to baseline models.", "paper_summary_zh": "隨機向量函數連結 (RVFL) 網路是一種傑出的分類模型，具有強大的泛化能力。然而，RVFL 一視同仁地對待所有樣本，忽略它們是純淨的還是有雜訊的，而且由於需要對整個訓練矩陣進行反轉，因此其可擴充性受到限制。為了解決這些問題，我們提出了顆粒球 RVFL (GB-RVFL) 模型，它使用顆粒球 (GB) 作為輸入，而不是訓練樣本。這種方法僅需要反轉 GB 中心矩陣，就能增強可擴充性，並且透過 GB 的粗粒度來改善對雜訊和異常值的魯棒性。此外，RVFL 忽略了資料集的幾何結構。為了解決這個問題，我們提出了圖嵌入 GB-RVFL (GE-GB-RVFL) 模型，它融合了顆粒運算和圖嵌入 (GE)，以保留 GB 的拓撲結構。所提出的 GB-RVFL 和 GE-GB-RVFL 模型在 KEEL、UCI、NDC 和生物醫學資料集上進行評估，與基線模型相比，表現出優異的效能。", "author": "M. Sajid et.al.", "authors": "M. Sajid, A. Quadir, M. Tanveer", "id": "2409.16735v1", "paper_url": "http://arxiv.org/abs/2409.16735v1", "repo": "null"}}