{"2407.03038": {"publish_time": "2024-07-03", "title": "On the Client Preference of LLM Fine-tuning in Federated Learning", "paper_summary": "Reinforcement learning with human feedback (RLHF) fine-tunes a pretrained\nlarge language model (LLM) using preference datasets, enabling the LLM to\ngenerate outputs that align with human preferences. Given the sensitive nature\nof these preference datasets held by various clients, there is a need to\nimplement RLHF within a federated learning (FL) framework, where clients are\nreluctant to share their data due to privacy concerns. To address this, we\nintroduce a feasible framework in which clients collaboratively train a binary\nselector with their preference datasets using our proposed FedBis. With a\nwell-trained selector, we can further enhance the LLM that generates\nhuman-preferred completions. Meanwhile, we propose a novel algorithm,\nFedBiscuit, that trains multiple selectors by organizing clients into balanced\nand disjoint clusters based on their preferences. Compared to the FedBis,\nFedBiscuit demonstrates superior performance in simulating human preferences\nfor pairwise completions. Our extensive experiments on federated human\npreference datasets -- marking the first benchmark to address heterogeneous\ndata partitioning among clients -- demonstrate that FedBiscuit outperforms\nFedBis and even surpasses traditional centralized training.", "paper_summary_zh": "強化學習與人類回饋 (RLHF) 使用偏好資料集微調預訓練的大型語言模型 (LLM)，使 LLM 能產生與人類偏好一致的輸出。由於各種客戶持有這些偏好資料集的敏感性質，因此需要在聯邦學習 (FL) 框架中實施 RLHF，其中客戶因隱私問題而不想分享他們的資料。為了解決這個問題，我們引進一個可行的框架，其中客戶使用我們提出的 FedBis，以他們的偏好資料集合作訓練一個二元選擇器。有了訓練良好的選擇器，我們可以進一步增強產生人類偏好的完成的 LLM。同時，我們提出了一種新的演算法 FedBiscuit，它透過將客戶根據他們的偏好組織成平衡且不相交的叢集來訓練多個選擇器。與 FedBis 相比，FedBiscuit 在模擬人類偏好以進行成對完成方面表現出優異的效能。我們對聯邦人類偏好資料集進行廣泛的實驗，標示出第一個解決客戶之間異質資料分割的基準，證明 FedBiscuit 優於 FedBis，甚至超越傳統的集中式訓練。", "author": "Feijie Wu et.al.", "authors": "Feijie Wu, Xiaoze Liu, Haoyu Wang, Xingchen Wang, Jing Gao", "id": "2407.03038v1", "paper_url": "http://arxiv.org/abs/2407.03038v1", "repo": "null"}}