{"2411.10010": {"publish_time": "2024-11-15", "title": "DeepMedcast: A Deep Learning Method for Generating Intermediate Weather Forecasts among Multiple NWP Models", "paper_summary": "Numerical weather prediction (NWP) centers around the world operate a variety\nof NWP models, and recent advances in AI-driven NWP models have increased the\navailability of diverse NWP outputs. While this expansion holds the potential\nto improve forecast accuracy, it also raises a critical challenge of\nidentifying the most reliable predictions for specific forecast scenarios.\nTraditional approaches, such as ensemble or weighted averaging, combine\nmultiple NWP outputs but often generate unrealistic atmospheric fields,\ncomplicating the production of reliable and consistent forecasts in operational\nsettings. In this study, we introduce DeepMedcast, a deep learning method that\ngenerates intermediate forecast, or \"medcast\", between two or more NWP outputs.\nUnlike ensemble averaging, DeepMedcast can provide consistent and explainable\nmedcast without distorting meteorological fields. This paper details the\nmethodology and case studies of DeepMedcast, discussing its advantages and\npotential contributions to operational forecasting.", "paper_summary_zh": "全球數值天氣預測 (NWP) 中心營運各種 NWP 模型，而 AI 驅動 NWP 模型的最新進展已提升各種 NWP 產出的可取得性。雖然此擴充具備提升預測精準度的潛力，但也引發一項重大挑戰，即找出特定預測情境中最可靠的預測。傳統方法（例如集合或加權平均）會結合多個 NWP 產出，但通常會產生不切實際的大氣場，使得在營運設定中產生可靠且一致的預測變得複雜。在此研究中，我們介紹 DeepMedcast，這是一種深度學習方法，可以在兩個或多個 NWP 產出之間產生中間預測或「medcast」。與集合平均不同的是，DeepMedcast 可以提供一致且可解釋的 medcast，而不會扭曲氣象場。本文詳述 DeepMedcast 的方法論和案例研究，討論其優點和對營運預測的潛在貢獻。", "author": "Atsushi Kudo et.al.", "authors": "Atsushi Kudo", "id": "2411.10010v1", "paper_url": "http://arxiv.org/abs/2411.10010v1", "repo": "null"}}