{"2502.20719": {"publish_time": "2025-02-28", "title": "Generating Clinically Realistic EHR Data via a Hierarchy- and Semantics-Guided Transformer", "paper_summary": "Generating realistic synthetic electronic health records (EHRs) holds\ntremendous promise for accelerating healthcare research, facilitating AI model\ndevelopment and enhancing patient privacy. However, existing generative methods\ntypically treat EHRs as flat sequences of discrete medical codes. This approach\noverlooks two critical aspects: the inherent hierarchical organization of\nclinical coding systems and the rich semantic context provided by code\ndescriptions. Consequently, synthetic patient sequences often lack high\nclinical fidelity and have limited utility in downstream clinical tasks. In\nthis paper, we propose the Hierarchy- and Semantics-Guided Transformer (HiSGT),\na novel framework that leverages both hierarchical and semantic information for\nthe generative process. HiSGT constructs a hierarchical graph to encode\nparent-child and sibling relationships among clinical codes and employs a graph\nneural network to derive hierarchy-aware embeddings. These are then fused with\nsemantic embeddings extracted from a pre-trained clinical language model (e.g.,\nClinicalBERT), enabling the Transformer-based generator to more accurately\nmodel the nuanced clinical patterns inherent in real EHRs. Extensive\nexperiments on the MIMIC-III and MIMIC-IV datasets demonstrate that HiSGT\nsignificantly improves the statistical alignment of synthetic data with real\npatient records, as well as supports robust downstream applications such as\nchronic disease classification. By addressing the limitations of conventional\nraw code-based generative models, HiSGT represents a significant step toward\nclinically high-fidelity synthetic data generation and a general paradigm\nsuitable for interpretable medical code representation, offering valuable\napplications in data augmentation and privacy-preserving healthcare analytics.", "paper_summary_zh": "產生逼真的合成電子健康記錄 (EHR) 對於加速醫療保健研究、促進 AI 模型開發和增強患者隱私方面具有巨大的潛力。然而，現有的生成方法通常將 EHR 視為離散醫療代碼的扁平序列。這種方法忽略了兩個關鍵方面：臨床編碼系統固有的層次結構組織以及代碼描述提供的豐富語義上下文。因此，合成的患者序列通常缺乏高度的臨床保真度，並且在下游臨床任務中的效用有限。在本文中，我們提出了層次和語義引導的 Transformer (HiSGT)，這是一個利用層次和語義信息進行生成過程的新穎框架。HiSGT 構建了一個層次圖來編碼臨床代碼之間的父子和兄弟姐妹關係，並採用圖神經網絡來導出具有層次感知的嵌入。然後將這些嵌入與從預訓練的臨床語言模型（例如 ClinicalBERT）中提取的語義嵌入融合，使基於 Transformer 的生成器能夠更準確地模擬真實 EHR 中固有的細微臨床模式。在 MIMIC-III 和 MIMIC-IV 數據集上進行的大量實驗表明，HiSGT 顯著改善了合成數據與真實患者記錄的統計一致性，並支持強大的下游應用，例如慢性病分類。通過解決傳統基於原始代碼的生成模型的局限性，HiSGT 代表了向臨床高保真合成數據生成邁出的重要一步，並且是一種適用於可解釋醫療代碼表示的通用範例，在數據增強和保護隱私的醫療保健分析中提供了有價值的應用。\n", "author": "Guanglin Zhou et.al.", "authors": "Guanglin Zhou, Sebastiano Barbieri", "id": "2502.20719v1", "paper_url": "http://arxiv.org/abs/2502.20719v1", "repo": "null"}}