{"2502.13743": {"publish_time": "2025-02-19", "title": "Inference of Abstraction for Grounded Predicate Logic", "paper_summary": "An important open question in AI is what simple and natural principle enables\na machine to reason logically for meaningful abstraction with grounded symbols.\nThis paper explores a conceptually new approach to combining probabilistic\nreasoning and predicative symbolic reasoning over data. We return to the era of\nreasoning with a full joint distribution before the advent of Bayesian\nnetworks. We then discuss that a full joint distribution over models of\nexponential size in propositional logic and of infinite size in predicate logic\nshould be simply derived from a full joint distribution over data of linear\nsize. We show that the same process is not only enough to generalise the\nlogical consequence relation of predicate logic but also to provide a new\nperspective to rethink well-known limitations such as the undecidability of\npredicate logic, the symbol grounding problem and the principle of explosion.\nThe reproducibility of this theoretical work is fully demonstrated by the\nincluded proofs.", "paper_summary_zh": "在人工智慧中，一個重要的開放性問題是，什麼簡單且自然的原則能讓機器以接地的符號進行有意義的抽象邏輯推理。\n本文探討了一種概念上新的方法，用於結合機率推理和資料上的述詞符號推理。我們回到貝氏網路出現之前的，使用完整聯合分配進行推理的時代。接著我們討論，命題邏輯中指數大小的模型和述詞邏輯中無限大小的模型的完整聯合分配，應該可以簡單地從線性大小的資料完整聯合分配中導出。我們展示相同的程序不僅足以概括述詞邏輯的邏輯後果關係，也能提供一個新的觀點來重新思考眾所周知的限制，例如述詞邏輯的不可判定性、符號接地問題和爆炸原理。\n包含的證明充分展示了這項理論工作的可複製性。", "author": "Hiroyuki Kido et.al.", "authors": "Hiroyuki Kido", "id": "2502.13743v1", "paper_url": "http://arxiv.org/abs/2502.13743v1", "repo": "null"}}