{"2407.12352": {"publish_time": "2024-07-17", "title": "SENTAUR: Security EnhaNced Trojan Assessment Using LLMs Against Undesirable Revisions", "paper_summary": "A globally distributed IC supply chain brings risks due to untrusted third\nparties. The risks span inadvertent use of hardware Trojan (HT), inserted\nIntellectual Property (3P-IP) or Electronic Design Automation (EDA) flows. HT\ncan introduce stealthy HT behavior, prevent an IC work as intended, or leak\nsensitive data via side channels. To counter HTs, rapidly examining HT\nscenarios is a key requirement. While Trust-Hub benchmarks are a good starting\npoint to assess defenses, they encompass a small subset of manually created HTs\nwithin the expanse of HT designs. Further, the HTs may disappear during\nsynthesis. We propose a large language model (LLM) framework SENTAUR to\ngenerate a suite of legitimate HTs for a Register Transfer Level (RTL) design\nby learning its specifications, descriptions, and natural language descriptions\nof HT effects. Existing tools and benchmarks are limited; they need a learning\nperiod to construct an ML model to mimic the threat model and are difficult to\nreproduce. SENTAUR can swiftly produce HT instances by leveraging LLMs without\nany learning period and sanitizing the HTs facilitating their rapid assessment.\nEvaluation of SENTAUR involved generating effective, synthesizable, and\npractical HTs from TrustHub and elsewhere, investigating impacts of\npayloads/triggers at the RTL. While our evaluation focused on HT insertion,\nSENTAUR can generalize to automatically transform an RTL code to have defined\nfunctional modifications.", "paper_summary_zh": "<paragraph>全球分布的 IC 供應鏈因不信任的第三方而帶來風險。風險包括無意中使用硬體木馬 (HT)、插入的智慧財產權 (3P-IP) 或電子設計自動化 (EDA) 流程。HT 可以引入隱密的 HT 行為，阻止 IC 按預期工作，或透過側信道洩漏敏感資料。為了對抗 HT，快速檢查 HT 場景是一項關鍵要求。雖然 Trust-Hub 基準是評估防禦措施的良好起點，但它們包含了在 HT 設計範圍內一小部分手動建立的 HT。此外，HT 可能在綜合過程中消失。我們提出一個大型語言模型 (LLM) 框架 SENTAUR，透過學習其規格、描述和 HT 效果的自然語言描述，為暫存器傳輸層級 (RTL) 設計產生一組合法的 HT。現有的工具和基準有限；它們需要一段學習期來建構一個 ML 模型以模擬威脅模型，而且難以複製。SENTAUR 可以透過利用 LLM 迅速產生 HT 範例，而無需任何學習期，並透過清除 HT 來促進其快速評估。SENTAUR 的評估包括從 TrustHub 和其他地方產生有效、可合成且實用的 HT，調查有效載荷/觸發器在 RTL 上的影響。雖然我們的評估重點在 HT 插入上，但 SENTAUR 可以概括為自動轉換 RTL 程式碼以定義功能修改。</paragraph>", "author": "Jitendra Bhandari et.al.", "authors": "Jitendra Bhandari, Rajat Sadhukhan, Prashanth Krishnamurthy, Farshad Khorrami, Ramesh Karri", "id": "2407.12352v1", "paper_url": "http://arxiv.org/abs/2407.12352v1", "repo": "null"}}