{"2409.19940": {"publish_time": "2024-09-30", "title": "Positive-Sum Fairness: Leveraging Demographic Attributes to Achieve Fair AI Outcomes Without Sacrificing Group Gains", "paper_summary": "Fairness in medical AI is increasingly recognized as a crucial aspect of\nhealthcare delivery. While most of the prior work done on fairness emphasizes\nthe importance of equal performance, we argue that decreases in fairness can be\neither harmful or non-harmful, depending on the type of change and how\nsensitive attributes are used. To this end, we introduce the notion of\npositive-sum fairness, which states that an increase in performance that\nresults in a larger group disparity is acceptable as long as it does not come\nat the cost of individual subgroup performance. This allows sensitive\nattributes correlated with the disease to be used to increase performance\nwithout compromising on fairness.\n  We illustrate this idea by comparing four CNN models that make different use\nof the race attribute in the training phase. The results show that removing all\ndemographic encodings from the images helps close the gap in performance\nbetween the different subgroups, whereas leveraging the race attribute as a\nmodel's input increases the overall performance while widening the disparities\nbetween subgroups. These larger gaps are then put in perspective of the\ncollective benefit through our notion of positive-sum fairness to distinguish\nharmful from non harmful disparities.", "paper_summary_zh": "醫療 AI 中的公平性日益被視為醫療保健提供中至關重要的一環。雖然大多數先前關於公平性的研究都強調同等表現的重要性，我們認為公平性的下降可能是有害的或無害的，具體取決於變化的類型和敏感屬性的使用方式。為此，我們引入了正和公平性的概念，它指出，只要不以犧牲個別子群體表現為代價，那麼導致群體差異更大的表現提升是可以接受的。這允許將與疾病相關的敏感屬性用於提高表現，而不會損害公平性。\n我們通過比較四個在訓練階段對種族屬性使用不同的 CNN 模型來說明這個想法。結果顯示，從圖像中移除所有人口編碼有助於縮小不同子群體之間的表現差距，而將種族屬性用作模型的輸入會提高整體表現，同時擴大子群體之間的差異。然後，通過我們正和公平性的概念將這些更大的差距置於整體效益的角度，以區分有害和無害的差異。", "author": "Samia Belhadj et.al.", "authors": "Samia Belhadj, Sanguk Park, Ambika Seth, Hesham Dar, Thijs Kooi", "id": "2409.19940v1", "paper_url": "http://arxiv.org/abs/2409.19940v1", "repo": "null"}}