{"2409.11904": {"publish_time": "2024-09-18", "title": "Finding the Subjective Truth: Collecting 2 Million Votes for Comprehensive Gen-AI Model Evaluation", "paper_summary": "Efficiently evaluating the performance of text-to-image models is difficult\nas it inherently requires subjective judgment and human preference, making it\nhard to compare different models and quantify the state of the art. Leveraging\nRapidata's technology, we present an efficient annotation framework that\nsources human feedback from a diverse, global pool of annotators. Our study\ncollected over 2 million annotations across 4,512 images, evaluating four\nprominent models (DALL-E 3, Flux.1, MidJourney, and Stable Diffusion) on style\npreference, coherence, and text-to-image alignment. We demonstrate that our\napproach makes it feasible to comprehensively rank image generation models\nbased on a vast pool of annotators and show that the diverse annotator\ndemographics reflect the world population, significantly decreasing the risk of\nbiases.", "paper_summary_zh": "有效評估文字轉圖片模型的效能很困難，因為它本質上需要主觀判斷和人類偏好，這使得比較不同的模型和量化當前技術狀態變得困難。利用 Rapidata 的技術，我們提出了一個有效註解框架，從多元的全球註解者群中獲取人類回饋。我們的研究收集了超過 200 萬個對 4,512 張圖片的註解，評估了四個著名的模型（DALL-E 3、Flux.1、MidJourney 和 Stable Diffusion）在風格偏好、連貫性和文字轉圖片對齊方面的表現。我們證明了我們的做法可以根據大量的註解者全面排名圖片生成模型，並表明多元的註解者人口統計反映了世界人口，顯著降低了偏差風險。", "author": "Dimitrios Christodoulou et.al.", "authors": "Dimitrios Christodoulou, Mads Kuhlmann-Jørgensen", "id": "2409.11904v1", "paper_url": "http://arxiv.org/abs/2409.11904v1", "repo": "null"}}