{"2412.09605": {"publish_time": "2024-12-12", "title": "AgentTrek: Agent Trajectory Synthesis via Guiding Replay with Web Tutorials", "paper_summary": "Graphical User Interface (GUI) agents hold great potential for automating\ncomplex tasks across diverse digital environments, from web applications to\ndesktop software. However, the development of such agents is hindered by the\nlack of high-quality, multi-step trajectory data required for effective\ntraining. Existing approaches rely on expensive and labor-intensive human\nannotation, making them unsustainable at scale. To address this challenge, we\npropose AgentTrek, a scalable data synthesis pipeline that generates\nhigh-quality GUI agent trajectories by leveraging web tutorials. Our method\nautomatically gathers tutorial-like texts from the internet, transforms them\ninto task goals with step-by-step instructions, and employs a visual-language\nmodel agent to simulate their execution in a real digital environment. A\nVLM-based evaluator ensures the correctness of the generated trajectories. We\ndemonstrate that training GUI agents with these synthesized trajectories\nsignificantly improves their grounding and planning performance over the\ncurrent models. Moreover, our approach is more cost-efficient compared to\ntraditional human annotation methods. This work underscores the potential of\nguided replay with web tutorials as a viable strategy for large-scale GUI agent\ntraining, paving the way for more capable and autonomous digital agents.", "paper_summary_zh": "圖形使用者介面 (GUI) 代理程式在自動化各種數位環境中的複雜任務方面具有極大的潛力，從網路應用程式到桌上型電腦軟體皆是如此。然而，此類代理程式的開發受到缺乏高品質、多步驟軌跡資料的阻礙，而這對於有效的訓練是必要的。現有方法依賴昂貴且勞力密集的人工註解，這使得它們在規模上無法持續。為了應對這項挑戰，我們提出 AgentTrek，這是一個可擴充的資料合成管線，它透過利用網路教學課程產生高品質的 GUI 代理程式軌跡。我們的程式自動從網路上收集類似教學課程的文字，將它們轉換為具有逐步說明的任務目標，並使用視覺語言模型代理程式在真實的數位環境中模擬它們的執行。基於 VLM 的評估器確保產生軌跡的正確性。我們證明使用這些合成軌跡訓練 GUI 代理程式可以顯著改善它們的基礎和規劃效能，優於目前的模型。此外，與傳統的人工註解方法相比，我們的方法更具成本效益。這項工作強調了以網路教學課程為指導的重播作為大規模 GUI 代理程式訓練的可行策略的潛力，為更強大且自主的數位代理程式鋪路。", "author": "Yiheng Xu et.al.", "authors": "Yiheng Xu, Dunjie Lu, Zhennan Shen, Junli Wang, Zekun Wang, Yuchen Mao, Caiming Xiong, Tao Yu", "id": "2412.09605v1", "paper_url": "http://arxiv.org/abs/2412.09605v1", "repo": "null"}}