{"2502.06134": {"publish_time": "2025-02-10", "title": "Integrating Sequence and Image Modeling in Irregular Medical Time Series Through Self-Supervised Learning", "paper_summary": "Medical time series are often irregular and face significant missingness,\nposing challenges for data analysis and clinical decision-making. Existing\nmethods typically adopt a single modeling perspective, either treating series\ndata as sequences or transforming them into image representations for further\nclassification. In this paper, we propose a joint learning framework that\nincorporates both sequence and image representations. We also design three\nself-supervised learning strategies to facilitate the fusion of sequence and\nimage representations, capturing a more generalizable joint representation. The\nresults indicate that our approach outperforms seven other state-of-the-art\nmodels in three representative real-world clinical datasets. We further\nvalidate our approach by simulating two major types of real-world missingness\nthrough leave-sensors-out and leave-samples-out techniques. The results\ndemonstrate that our approach is more robust and significantly surpasses other\nbaselines in terms of classification performance.", "paper_summary_zh": "醫療時間序列通常不規則且會面臨顯著的缺失，對資料分析和臨床決策制定構成挑戰。現有方法通常採用單一建模觀點，將序列資料視為序列或將其轉換為影像表示以進行進一步分類。在本文中，我們提出了一個聯合學習架構，結合序列和影像表示。我們還設計了三種自我監督學習策略，以促進序列和影像表示的融合，捕捉更具概括性的聯合表示。結果表明，我們的做法在三個具有代表性的真實世界臨床資料集中優於其他七個最先進的模型。我們進一步通過留出感測器和留出樣本的技術模擬兩種主要的真實世界缺失類型來驗證我們的做法。結果表明，我們的做法更強大，並且在分類效能方面顯著優於其他基準。", "author": "Liuqing Chen et.al.", "authors": "Liuqing Chen, Shuhong Xiao, Shixian Ding, Shanhai Hu, Lingyun Sun", "id": "2502.06134v1", "paper_url": "http://arxiv.org/abs/2502.06134v1", "repo": "null"}}