{"2408.02213": {"publish_time": "2024-08-05", "title": "Is Large Language Model Good at Database Knob Tuning? A Comprehensive Experimental Evaluation", "paper_summary": "Knob tuning plays a crucial role in optimizing databases by adjusting knobs\nto enhance database performance. However, traditional tuning methods often\nfollow a Try-Collect-Adjust approach, proving inefficient and\ndatabase-specific. Moreover, these methods are often opaque, making it\nchallenging for DBAs to grasp the underlying decision-making process.\n  The emergence of large language models (LLMs) like GPT-4 and Claude-3 has\nexcelled in complex natural language tasks, yet their potential in database\nknob tuning remains largely unexplored. This study harnesses LLMs as\nexperienced DBAs for knob-tuning tasks with carefully designed prompts. We\nidentify three key subtasks in the tuning system: knob pruning, model\ninitialization, and knob recommendation, proposing LLM-driven solutions to\nreplace conventional methods for each subtask.\n  We conduct extensive experiments to compare LLM-driven approaches against\ntraditional methods across the subtasks to evaluate LLMs' efficacy in the knob\ntuning domain. Furthermore, we explore the adaptability of LLM-based solutions\nin diverse evaluation settings, encompassing new benchmarks, database engines,\nand hardware environments. Our findings reveal that LLMs not only match or\nsurpass traditional methods but also exhibit notable interpretability by\ngenerating responses in a coherent ``chain-of-thought'' manner. We further\nobserve that LLMs exhibit remarkable generalizability through simple\nadjustments in prompts, eliminating the necessity for additional training or\nextensive code modifications.\n  Drawing insights from our experimental findings, we identify several\nopportunities for future research aimed at advancing the utilization of LLMs in\nthe realm of database management.", "paper_summary_zh": "<paragraph>旋鈕調整透過調整旋鈕來最佳化資料庫，在提升資料庫效能方面扮演至關重要的角色。然而，傳統的調整方法通常遵循嘗試-收集-調整的方法，證明效率低下且資料庫專屬。此外，這些方法通常是不透明的，這使得資料庫管理員難以掌握其背後的決策過程。\n大型語言模型 (LLM) 如 GPT-4 和 Claude-3 的出現，在複雜的自然語言任務中表現出色，但它們在資料庫旋鈕調整中的潛力仍未被廣泛探索。本研究利用 LLM 作為經驗豐富的資料庫管理員，使用精心設計的提示進行旋鈕調整任務。我們在調整系統中識別出三個關鍵子任務：旋鈕修剪、模型初始化和旋鈕推薦，並提出以 LLM 為驅動的解決方案來取代每個子任務的傳統方法。\n我們進行廣泛的實驗，將 LLM 驅動的方法與各個子任務中的傳統方法進行比較，以評估 LLM 在旋鈕調整領域的效能。此外，我們探討了基於 LLM 的解決方案在不同評估設定中的適應性，包括新的基準、資料庫引擎和硬體環境。我們的研究結果表明，LLM 不僅能與傳統方法相匹配或超越傳統方法，而且還通過以連貫的「思維鏈」方式產生回應，展現出顯著的可解釋性。我們進一步觀察到，LLM 通過提示中的簡單調整展現出顯著的泛化能力，消除了額外訓練或廣泛代碼修改的必要性。\n從我們的實驗結果中汲取見解，我們找出幾個未來研究的機會，旨在推進 LLM 在資料庫管理領域的應用。</paragraph>", "author": "Yiyan Li et.al.", "authors": "Yiyan Li, Haoyang Li, Zhao Pu, Jing Zhang, Xinyi Zhang, Tao Ji, Luming Sun, Cuiping Li, Hong Chen", "id": "2408.02213v1", "paper_url": "http://arxiv.org/abs/2408.02213v1", "repo": "null"}}