{"2410.14626": {"publish_time": "2024-10-18", "title": "You Shall Know a Tool by the Traces it Leaves: The Predictability of Sentiment Analysis Tools", "paper_summary": "If sentiment analysis tools were valid classifiers, one would expect them to\nprovide comparable results for sentiment classification on different kinds of\ncorpora and for different languages. In line with results of previous studies\nwe show that sentiment analysis tools disagree on the same dataset. Going\nbeyond previous studies we show that the sentiment tool used for sentiment\nannotation can even be predicted from its outcome, revealing an algorithmic\nbias of sentiment analysis. Based on Twitter, Wikipedia and different news\ncorpora from the English, German and French languages, our classifiers separate\nsentiment tools with an averaged F1-score of 0.89 (for the English corpora). We\ntherefore warn against taking sentiment annotations as face value and argue for\nthe need of more and systematic NLP evaluation studies.", "paper_summary_zh": "如果情緒分析工具是有效的分類器，人們會期待它們對不同類型的語料庫和不同語言的情緒分類提供可比較的結果。根據先前的研究結果，我們表明情緒分析工具不同意相同的數據集。超越先前的研究，我們表明用於情緒標註的情緒工具甚至可以從其結果中預測，揭示了情緒分析的演算法偏誤。基於 Twitter、維基百科和來自英語、德語和法語的不同新聞語料庫，我們的分類器以平均 F1 分數 0.89（對於英語語料庫）區分情緒工具。因此，我們警告不要將情緒標註視為表面價值，並主張需要更多且系統性的 NLP 評估研究。", "author": "Daniel Baumartz et.al.", "authors": "Daniel Baumartz, Mevlüt Bagci, Alexander Henlein, Maxim Konca, Andy Lücking, Alexander Mehler", "id": "2410.14626v1", "paper_url": "http://arxiv.org/abs/2410.14626v1", "repo": "null"}}