{"2412.02415": {"publish_time": "2024-12-03", "title": "Knowledge-Enhanced Conversational Recommendation via Transformer-based Sequential Modelling", "paper_summary": "In conversational recommender systems (CRSs), conversations usually involve a\nset of items and item-related entities or attributes, e.g., director is a\nrelated entity of a movie. These items and item-related entities are often\nmentioned along the development of a dialog, leading to potential sequential\ndependencies among them. However, most of existing CRSs neglect these potential\nsequential dependencies. In this article, we first propose a Transformer-based\nsequential conversational recommendation method, named TSCR, to model the\nsequential dependencies in the conversations to improve CRS. In TSCR, we\nrepresent conversations by items and the item-related entities, and construct\nuser sequences to discover user preferences by considering both the mentioned\nitems and item-related entities. Based on the constructed sequences, we deploy\na Cloze task to predict the recommended items along a sequence. Meanwhile, in\ncertain domains, knowledge graphs formed by the items and their related\nentities are readily available, which provide various different kinds of\nassociations among them. Given that TSCR does not benefit from such knowledge\ngraphs, we then propose a knowledge graph enhanced version of TSCR, called\nTSCRKG. In specific, we leverage the knowledge graph to offline initialize our\nmodel TSCRKG, and augment the user sequence of conversations (i.e., sequence of\nthe mentioned items and item-related entities in the conversation) with\nmulti-hop paths in the knowledge graph. Experimental results demonstrate that\nour TSCR model significantly outperforms state-of-the-art baselines, and the\nenhanced version TSCRKG further improves recommendation performance on top of\nTSCR.", "paper_summary_zh": "<paragraph>在會話式推薦系統 (CRS) 中，對話通常包含一組項目和與項目相關的實體或屬性，例如導演是電影的相關實體。這些項目和與項目相關的實體通常會在對話的發展過程中被提及，導致它們之間存在潛在的順序依賴性。然而，大多數現有的 CRS 都忽略了這些潛在的順序依賴性。在本文中，我們首先提出了一個基於 Transformer 的順序會話推薦方法，稱為 TSCR，以對話中的順序依賴性進行建模，以改進 CRS。在 TSCR 中，我們通過項目和與項目相關的實體來表示對話，並構建使用者序列，以通過考慮提到的項目和與項目相關的實體來發現使用者的偏好。根據構建的序列，我們部署一個完形填空任務來預測序列中的推薦項目。同時，在某些領域，由項目及其相關實體形成的知識圖很容易獲得，它們提供了各種不同的關聯。鑑於 TSCR 沒有從這樣的知識圖中受益，因此我們提出了 TSCR 的知識圖增強版本，稱為 TSCRKG。具體來說，我們利用知識圖離線初始化我們的模型 TSCRKG，並使用知識圖中的多跳路徑擴充對話的使用者序列（即對話中提到的項目和與項目相關的實體的序列）。實驗結果表明，我們的 TSCR 模型顯著優於最先進的基準，並且增強版本 TSCRKG 進一步改進了 TSCR 上的推薦性能。</paragraph>", "author": "Jie Zou et.al.", "authors": "Jie Zou, Aixin Sun, Cheng Long, Evangelos Kanoulas", "id": "2412.02415v1", "paper_url": "http://arxiv.org/abs/2412.02415v1", "repo": "null"}}