{"2412.15605": {"publish_time": "2024-12-20", "title": "Don't Do RAG: When Cache-Augmented Generation is All You Need for Knowledge Tasks", "paper_summary": "Retrieval-augmented generation (RAG) has gained traction as a powerful\napproach for enhancing language models by integrating external knowledge\nsources. However, RAG introduces challenges such as retrieval latency,\npotential errors in document selection, and increased system complexity. With\nthe advent of large language models (LLMs) featuring significantly extended\ncontext windows, this paper proposes an alternative paradigm, cache-augmented\ngeneration (CAG) that bypasses real-time retrieval. Our method involves\npreloading all relevant resources, especially when the documents or knowledge\nfor retrieval are of a limited and manageable size, into the LLM's extended\ncontext and caching its runtime parameters. During inference, the model\nutilizes these preloaded parameters to answer queries without additional\nretrieval steps. Comparative analyses reveal that CAG eliminates retrieval\nlatency and minimizes retrieval errors while maintaining context relevance.\nPerformance evaluations across multiple benchmarks highlight scenarios where\nlong-context LLMs either outperform or complement traditional RAG pipelines.\nThese findings suggest that, for certain applications, particularly those with\na constrained knowledge base, CAG provide a streamlined and efficient\nalternative to RAG, achieving comparable or superior results with reduced\ncomplexity.", "paper_summary_zh": "擷取增強生成 (RAG) 作為一種強大的方法，透過整合外部知識來源來增強語言模型，已獲得廣泛採用。然而，RAG 引入了諸如擷取延遲、文件選取潛在錯誤和系統複雜性增加等挑戰。隨著具備顯著延伸內容視窗的大型語言模型 (LLM) 的出現，本文提出了一種替代範例，快取增強生成 (CAG)，它繞過了即時擷取。我們的做法涉及預先載入所有相關資源，尤其是當文件或擷取知識的規模有限且可控時，載入到 LLM 的延伸內容和快取其執行時期參數中。在推論期間，模型利用這些預先載入的參數來回答查詢，而無需額外的擷取步驟。比較分析顯示，CAG 消除了擷取延遲並將擷取錯誤降到最低，同時維持內容相關性。跨多個基準的效能評估突出了長內容 LLM 優於或補充傳統 RAG 管線的場景。這些發現表明，對於某些應用，特別是那些具有受限知識庫的應用，CAG 提供了一個簡化且有效的 RAG 替代方案，在降低複雜性的情況下實現了相當或更佳的結果。", "author": "Brian J Chan et.al.", "authors": "Brian J Chan, Chao-Ting Chen, Jui-Hung Cheng, Hen-Hsen Huang", "id": "2412.15605v1", "paper_url": "http://arxiv.org/abs/2412.15605v1", "repo": "null"}}