{"2405.03990": {"publish_time": "2024-05-07", "title": "TrimCaching: Parameter-sharing AI Model Caching in Wireless Edge Networks", "paper_summary": "Next-generation mobile networks are expected to facilitate fast AI model\ndownloading to end users. By caching models on edge servers, mobile networks\ncan deliver models to end users with low latency, resulting in a paradigm\ncalled edge model caching. In this paper, we develop a novel model placement\nscheme, called parameter-sharing model caching (TrimCaching). TrimCaching\nexploits the key observation that a wide range of AI models, such as\nconvolutional neural networks or large language models, can share a significant\nproportion of parameter blocks containing reusable knowledge, thereby improving\nstorage efficiency. To this end, we formulate a parameter-sharing model\nplacement problem to maximize the cache hit ratio in multi-edge wireless\nnetworks by balancing the fundamental tradeoff between storage efficiency and\nservice latency. We show that the formulated problem is a submodular\nmaximization problem with submodular constraints, for which no polynomial-time\napproximation algorithm exists. To overcome this challenge, we study an\nimportant special case, where a small fixed number of parameter blocks are\nshared across models, which often holds in practice. In such a case, a\npolynomial-time algorithm with $\\left(1-\\epsilon\\right)/2$-approximation\nguarantee is developed. Subsequently, we address the original problem for the\ngeneral case by developing a greedy algorithm. Simulation results demonstrate\nthat the proposed TrimCaching framework significantly improves the cache hit\nratio compared with state-of-the-art content caching without exploiting shared\nparameters in AI models.", "paper_summary_zh": "預計下一代行動網路將會促進快速的 AI 模型下載給終端使用者。行動網路透過將模型快取在邊緣伺服器上，可以低延遲地將模型傳遞給終端使用者，進而產生一種稱為邊緣模型快取的典範。在本文中，我們開發了一個新穎的模型配置方案，稱為參數共享模型快取 (TrimCaching)。TrimCaching 利用了一個關鍵觀察，即廣泛的 AI 模型，例如卷積神經網路或大型語言模型，可以共享包含可重複使用知識的顯著比例的參數區塊，從而提高儲存效率。為此，我們制定了一個參數共享模型配置問題，以平衡儲存效率和服務延遲之間的基本權衡，進而最大化多邊緣無線網路中的快取命中率。我們證明了所制定的問題是一個具有次模約束的次模最大化問題，不存在多項式時間近似演算法。為了克服這個挑戰，我們研究了一個重要的特例，其中模型之間共享少量固定的參數區塊，這在實務上經常成立。在這種情況下，開發了一個具有 $\\left(1-\\epsilon\\right)/2$ 近似保證的多項式時間演算法。隨後，我們透過開發貪婪演算法來解決一般情況下的原始問題。模擬結果證明，與不利用 AI 模型中共享參數的最新內容快取相比，所提出的 TrimCaching 架構顯著提高了快取命中率。", "author": "Guanqiao Qu et.al.", "authors": "Guanqiao Qu, Zheng Lin, Fangming Liu, Xianhao Chen, Kaibin Huang", "id": "2405.03990v1", "paper_url": "http://arxiv.org/abs/2405.03990v1", "repo": "null"}}