{"2502.12109": {"publish_time": "2025-02-17", "title": "Personality Structured Interview for Large Language Model Simulation in Personality Research", "paper_summary": "Although psychometrics researchers have recently explored the use of large\nlanguage models (LLMs) as proxies for human participants, LLMs often fail to\ngenerate heterogeneous data with human-like diversity, which diminishes their\nvalue in advancing social science research. To address these challenges, we\nexplored the potential of the theory-informed Personality Structured Interview\n(PSI) as a tool for simulating human responses in personality research. In this\napproach, the simulation is grounded in nuanced real-human interview\ntranscripts that target the personality construct of interest. We have provided\na growing set of 357 structured interview transcripts from a representative\nsample, each containing an individual's response to 32 open-ended questions\ncarefully designed to gather theory-based personality evidence. Additionally,\ngrounded in psychometric research, we have summarized an evaluation framework\nto systematically validate LLM-generated psychometric data. Results from three\nexperiments demonstrate that well-designed structured interviews could improve\nhuman-like heterogeneity in LLM-simulated personality data and predict\npersonality-related behavioral outcomes (i.e., organizational citizenship\nbehaviors and counterproductive work behavior). We further discuss the role of\ntheory-informed structured interviews in LLM-based simulation and outline a\ngeneral framework for designing structured interviews to simulate human-like\ndata for psychometric research.", "paper_summary_zh": "儘管心理測量研究人員最近已探討將大型語言模型 (LLM) 用作人類參與者的代理，但 LLM 經常無法產生具有類似人類多樣性的異質資料，這降低了它們在推進社會科學研究中的價值。為了應對這些挑戰，我們探討了理論知情的個性結構化訪談 (PSI) 作為模擬人格研究中人類反應的工具的潛力。在此方法中，模擬基於針對目標人格建構的細緻真實人類訪談記錄。我們提供了一組不斷增加的 357 個結構化訪談記錄，來自一個具代表性的樣本，每個記錄都包含個人對 32 個開放式問題的回答，這些問題經過仔細設計，用於收集基於理論的人格證據。此外，基於心理測量研究，我們總結了一個評估架構，以系統性驗證 LLM 生成的精神測量資料。三個實驗的結果表明，設計良好的結構化訪談可以改善 LLM 模擬的人格資料中類似人類的異質性，並預測與人格相關的行為結果（例如，組織公民行為和適得其反的工作行為）。我們進一步討論了理論知情的結構化訪談在基於 LLM 的模擬中的作用，並概述了一個通用框架，用於設計結構化訪談以模擬類似人類的資料，以進行心理測量研究。", "author": "Pengda Wang et.al.", "authors": "Pengda Wang, Huiqi Zou, Hanjie Chen, Tianjun Sun, Ziang Xiao, Frederick L. Oswald", "id": "2502.12109v1", "paper_url": "http://arxiv.org/abs/2502.12109v1", "repo": "null"}}