{"2412.15904": {"publish_time": "2024-12-20", "title": "What Are Step-Level Reward Models Rewarding? Counterintuitive Findings from MCTS-Boosted Mathematical Reasoning", "paper_summary": "Step-level reward models (SRMs) can significantly enhance mathematical\nreasoning performance through process supervision or step-level preference\nalignment based on reinforcement learning. The performance of SRMs is pivotal,\nas they serve as critical guidelines, ensuring that each step in the reasoning\nprocess is aligned with desired outcomes. Recently, AlphaZero-like methods,\nwhere Monte Carlo Tree Search (MCTS) is employed for automatic step-level\npreference annotation, have proven particularly effective. However, the precise\nmechanisms behind the success of SRMs remain largely unexplored. To address\nthis gap, this study delves into the counterintuitive aspects of SRMs,\nparticularly focusing on MCTS-based approaches. Our findings reveal that the\nremoval of natural language descriptions of thought processes has minimal\nimpact on the efficacy of SRMs. Furthermore, we demonstrate that SRMs are adept\nat assessing the complex logical coherence present in mathematical language\nwhile having difficulty in natural language. These insights provide a nuanced\nunderstanding of the core elements that drive effective step-level reward\nmodeling in mathematical reasoning. By shedding light on these mechanisms, this\nstudy offers valuable guidance for developing more efficient and streamlined\nSRMs, which can be achieved by focusing on the crucial parts of mathematical\nreasoning.", "paper_summary_zh": "分步獎勵模型 (SRM) 可透過過程監督或基於強化學習的分步偏好調整，顯著提升數學推理效能。SRM 的效能至關重要，因為它們作為關鍵指南，確保推理過程中每一步都與預期結果一致。近來，採用蒙地卡羅樹狀搜尋 (MCTS) 進行自動分步偏好註解的 AlphaZero 類似方法已證明特別有效。然而，SRM 成功背後確切的機制在很大程度上仍未探討。為了解決這個差距，本研究深入探討 SRM 的反直覺面向，特別關注基於 MCTS 的方法。我們的研究結果顯示，移除自然語言對思考過程的描述，對 SRM 的效能影響甚微。此外，我們證明 SRM 能夠評估數學語言中存在的複雜邏輯一致性，但處理自然語言時則有困難。這些見解提供了對驅動數學推理中有效分步獎勵建模的核心元素的細緻理解。透過闡明這些機制，本研究為開發更有效率且簡化的 SRM 提供有價值的指導，而這可透過專注於數學推理的關鍵部分來達成。", "author": "Yiran Ma et.al.", "authors": "Yiran Ma, Zui Chen, Tianqiao Liu, Mi Tian, Zhuo Liu, Zitao Liu, Weiqi Luo", "id": "2412.15904v1", "paper_url": "http://arxiv.org/abs/2412.15904v1", "repo": "null"}}