{"2501.13536": {"publish_time": "2025-01-23", "title": "ReasVQA: Advancing VideoQA with Imperfect Reasoning Process", "paper_summary": "Video Question Answering (VideoQA) is a challenging task that requires\nunderstanding complex visual and temporal relationships within videos to answer\nquestions accurately. In this work, we introduce \\textbf{ReasVQA}\n(Reasoning-enhanced Video Question Answering), a novel approach that leverages\nreasoning processes generated by Multimodal Large Language Models (MLLMs) to\nimprove the performance of VideoQA models. Our approach consists of three\nphases: reasoning generation, reasoning refinement, and learning from\nreasoning. First, we generate detailed reasoning processes using additional\nMLLMs, and second refine them via a filtering step to ensure data quality.\nFinally, we use the reasoning data, which might be in an imperfect form, to\nguide the VideoQA model via multi-task learning, on how to interpret and answer\nquestions based on a given video. We evaluate ReasVQA on three popular\nbenchmarks, and our results establish new state-of-the-art performance with\nsignificant improvements of +2.9 on NExT-QA, +7.3 on STAR, and +5.9 on\nIntentQA. Our findings demonstrate the supervising benefits of integrating\nreasoning processes into VideoQA. Further studies validate each component of\nour method, also with different backbones and MLLMs, and again highlight the\nadvantages of this simple but effective method. We offer a new perspective on\nenhancing VideoQA performance by utilizing advanced reasoning techniques,\nsetting a new benchmark in this research field.", "paper_summary_zh": "影片問答 (VideoQA) 是一項具有挑戰性的任務，需要了解影片中複雜的視覺和時間關係才能準確回答問題。在此研究中，我們介紹了 \\textbf{ReasVQA}（推理增強影片問答），這是一種新穎的方法，利用多模態大型語言模型 (MLLM) 生成的推理程序來提升 VideoQA 模型的效能。我們的做法包含三個階段：推理生成、推理精煉和從推理中學習。首先，我們使用額外的 MLLM 生成詳細的推理程序，然後透過過濾步驟精煉它們以確保資料品質。最後，我們使用推理資料（可能是不完美的形式）透過多任務學習來引導 VideoQA 模型，了解如何根據給定的影片詮釋和回答問題。我們在三個熱門基準上評估 ReasVQA，我們的結果建立了新的最先進效能，在 NExT-QA 上顯著提升 +2.9、在 STAR 上提升 +7.3，以及在 IntentQA 上提升 +5.9。我們的發現證明了將推理程序整合到 VideoQA 中的監督效益。進一步的研究驗證了我們方法的每個組成部分，也驗證了不同的主幹和 MLLM，並再次強調了這種簡單但有效方法的優點。我們提供了利用先進推理技術來提升 VideoQA 效能的新觀點，為這個研究領域設定了新的基準。", "author": "Jianxin Liang et.al.", "authors": "Jianxin Liang, Xiaojun Meng, Huishuai Zhang, Yueqian Wang, Jiansheng Wei, Dongyan Zhao", "id": "2501.13536v1", "paper_url": "http://arxiv.org/abs/2501.13536v1", "repo": "null"}}