{"2411.19726": {"publish_time": "2024-11-29", "title": "Towards Santali Linguistic Inclusion: Building the First Santali-to-English Translation Model using mT5 Transformer and Data Augmentation", "paper_summary": "Around seven million individuals in India, Bangladesh, Bhutan, and Nepal\nspeak Santali, positioning it as nearly the third most commonly used\nAustroasiatic language. Despite its prominence among the Austroasiatic language\nfamily's Munda subfamily, Santali lacks global recognition. Currently, no\ntranslation models exist for the Santali language. Our paper aims to include\nSantali to the NPL spectrum. We aim to examine the feasibility of building\nSantali translation models based on available Santali corpora. The paper\nsuccessfully addressed the low-resource problem and, with promising results,\nexamined the possibility of creating a functional Santali machine translation\nmodel in a low-resource setup. Our study shows that Santali-English parallel\ncorpus performs better when in transformers like mt5 as opposed to untrained\ntransformers, proving that transfer learning can be a viable technique that\nworks with Santali language. Besides the mT5 transformer, Santali-English\nperforms better than Santali-Bangla parallel corpus as the mT5 has been trained\nin way more English data than Bangla data. Lastly, our study shows that with\ndata augmentation, our model performs better.", "paper_summary_zh": "在印度、孟加拉、不丹和尼泊爾，約有七百萬人說桑塔利語，這使它成為使用人數第三多的南亞語系語言。儘管桑塔利語在南亞語系中的蒙達語族中很突出，但它缺乏全球認可度。目前，桑塔利語沒有翻譯模型。我們的論文旨在將桑塔利語納入 NPL 範疇。我們旨在探討在現有的桑塔利語語料庫基礎上構建桑塔利語翻譯模型的可行性。本文成功解決了低資源問題，並以有希望的結果探討了在低資源設置中創建功能性桑塔利語機器翻譯模型的可能性。我們的研究表明，與未訓練的Transformer相比，當桑塔利語-英語並行語料庫在像 mt5 這樣的Transformer中使用時表現得更好，證明遷移學習可以是一種可行的技術，適用於桑塔利語。除了 mT5 Transformer之外，桑塔利語-英語的表現優於桑塔利語-孟加拉語並行語料庫，因為 mT5 在比孟加拉語數據多得多的英語數據中進行了訓練。最後，我們的研究表明，通過數據擴充，我們的模型表現得更好。", "author": "Syed Mohammed Mostaque Billah et.al.", "authors": "Syed Mohammed Mostaque Billah, Ateya Ahmed Subarna, Sudipta Nandi Sarna, Ahmad Shawkat Wasit, Anika Fariha, Asif Sushmit, Arig Yousuf Sadeque", "id": "2411.19726v1", "paper_url": "http://arxiv.org/abs/2411.19726v1", "repo": "null"}}