{"2411.13209": {"publish_time": "2024-11-20", "title": "Comparative Analysis of Audio Feature Extraction for Real-Time Talking Portrait Synthesis", "paper_summary": "This paper examines the integration of real-time talking-head generation for\ninterviewer training, focusing on overcoming challenges in Audio Feature\nExtraction (AFE), which often introduces latency and limits responsiveness in\nreal-time applications. To address these issues, we propose and implement a\nfully integrated system that replaces conventional AFE models with Open AI's\nWhisper, leveraging its encoder to optimize processing and improve overall\nsystem efficiency. Our evaluation of two open-source real-time models across\nthree different datasets shows that Whisper not only accelerates processing but\nalso improves specific aspects of rendering quality, resulting in more\nrealistic and responsive talking-head interactions. These advancements make the\nsystem a more effective tool for immersive, interactive training applications,\nexpanding the potential of AI-driven avatars in interviewer training.", "paper_summary_zh": "本文探討了整合即時對話頭部生成技術於面試人員訓練中的應用，重點在於克服音訊特徵萃取 (AFE) 中的挑戰，而這些挑戰通常會導致延遲並限制即時應用程式的回應能力。為了解決這些問題，我們提出並實作了一個完全整合的系統，以 Open AI 的 Whisper 取代傳統的 AFE 模型，並利用其編碼器來最佳化處理程序並提升整體系統效率。我們對三個不同資料集中的兩個開源即時模型進行評估，結果顯示 Whisper 不僅加速處理速度，也改善了渲染品質的特定面向，進而產生更逼真且回應更快速的對話頭部互動。這些進展讓此系統成為更有效的工具，可運用於沈浸式互動訓練應用程式中，並擴展了 AI 驅動頭像在面試人員訓練中的潛力。", "author": "Pegah Salehi et.al.", "authors": "Pegah Salehi, Sajad Amouei Sheshkal, Vajira Thambawita, Sushant Gautam, Saeed S. Sabet, Dag Johansen, Michael A. Riegler, Pål Halvorsen", "id": "2411.13209v1", "paper_url": "http://arxiv.org/abs/2411.13209v1", "repo": "https://github.com/pegahs1993/whisper-afe-talkingheadsgen"}}