{"2405.15154": {"publish_time": "2024-05-24", "title": "Online Prompt Pricing based on Combinatorial Multi-Armed Bandit and Hierarchical Stackelberg Game", "paper_summary": "Generation models have shown promising performance in various tasks, making\ntrading around machine learning models possible. In this paper, we aim at a\nnovel prompt trading scenario, prompt bundle trading (PBT) system, and propose\nan online pricing mechanism. Based on the combinatorial multi-armed bandit\n(CMAB) and three-stage hierarchical Stackelburg (HS) game, our pricing\nmechanism considers the profits of the consumer, platform, and seller,\nsimultaneously achieving the profit satisfaction of these three participants.\nWe break down the pricing issue into two steps, namely unknown category\nselection and incentive strategy optimization. The former step is to select a\nset of categories with the highest qualities, and the latter is to derive the\noptimal strategy for each participant based on the chosen categories. Unlike\nthe existing fixed pricing mode, the PBT pricing mechanism we propose is more\nflexible and diverse, which is more in accord with the transaction needs of\nreal-world scenarios. We test our method on a simulated text-to-image dataset.\nThe experimental results demonstrate the effectiveness of our algorithm, which\nprovides a feasible price-setting standard for the prompt marketplaces.", "paper_summary_zh": "生成模型在各種任務中展現出有前景的效能，讓機器學習模型之間的交易成為可能。在本文中，我們針對一種新穎的提示交易場景、提示組合交易 (PBT) 系統，並提出一個線上定價機制。我們的定價機制基於組合多重拉霸機 (CMAB) 和三階段階層式 Stackelburg (HS) 博弈，同時考量消費者、平台和賣方的利潤，同時達成這三方參與者的利潤滿意度。我們將定價問題分解為兩個步驟，即未知類別選擇和誘因策略最佳化。前一步驟是選擇一組品質最高的類別，後一步驟是根據所選類別為每個參與者推導最佳策略。與現有的固定定價模式不同，我們提出的 PBT 定價機制更靈活、更多樣化，更符合現實世界場景的交易需求。我們在模擬的文字轉圖像資料集上測試我們的模型。實驗結果證明了我們演算法的有效性，為提示市場提供了一個可行的價格設定標準。", "author": "Meiling Li et.al.", "authors": "Meiling Li, Hongrun Ren, Haixu Xiong, Zhenxing Qian, Xinpeng Zhang", "id": "2405.15154v1", "paper_url": "http://arxiv.org/abs/2405.15154v1", "repo": "null"}}