{"2501.08631": {"publish_time": "2025-01-15", "title": "SWSC: Shared Weight for Similar Channel in LLM", "paper_summary": "Large language models (LLMs) have spurred development in multiple industries.\nHowever, the growing number of their parameters brings substantial storage and\ncomputing burdens, making it essential to explore model compression techniques\nfor parameter reduction and easier deployment. We propose SWSC, an LLM\ncompression method based on the concept of Shared Weight for Similar Channel.\nIt uses the K-Means clustering algorithm to cluster model weights\nchannel-by-channel, generating clusters with highly similar vectors within\neach. A representative vector from each cluster is selected to approximately\nreplace all vectors in the cluster, significantly reducing the number of model\nweight parameters. However, approximate restoration will inevitably cause\ndamage to the performance of the model. To tackle this issue, we perform\nsingular value decomposition on the weight error values before and after\ncompression and retain the larger singular values and their corresponding\nsingular vectors to compensate for the accuracy. The experimental results show\nthat our method can effectively ensure the performance of the compressed LLM\neven under low-precision conditions.", "paper_summary_zh": "大型語言模型 (LLM) 已促使多個產業發展。\n然而，其參數數量不斷增加，帶來龐大的儲存和運算負擔，因此探索模型壓縮技術以減少參數並簡化部署至關重要。我們提出 SWSC，一種基於相似通道共享權重的 LLM 壓縮方法。\n它使用 K-Means 聚類演算法對模型權重逐通道聚類，在每個通道內產生具有高度相似向量的聚類。從每個聚類中選取一個代表向量來近似替換聚類中的所有向量，大幅減少模型權重參數的數量。然而，近似還原不可避免地會損害模型的效能。為了解決這個問題，我們在壓縮前後對權重誤差值執行奇異值分解，並保留較大的奇異值及其對應的奇異向量以補償準確度。實驗結果表明，即使在低精度條件下，我們的方法也能有效確保壓縮 LLM 的效能。", "author": "Binrui Zeng et.al.", "authors": "Binrui Zeng, Yongtao Tang, Xiaodong Liu, Xiaopeng Li", "id": "2501.08631v1", "paper_url": "http://arxiv.org/abs/2501.08631v1", "repo": "null"}}