{"2406.12566": {"publish_time": "2024-06-18", "title": "RichRAG: Crafting Rich Responses for Multi-faceted Queries in Retrieval-Augmented Generation", "paper_summary": "Retrieval-augmented generation (RAG) effectively addresses issues of static\nknowledge and hallucination in large language models. Existing studies mostly\nfocus on question scenarios with clear user intents and concise answers.\nHowever, it is prevalent that users issue broad, open-ended queries with\ndiverse sub-intents, for which they desire rich and long-form answers covering\nmultiple relevant aspects. To tackle this important yet underexplored problem,\nwe propose a novel RAG framework, namely RichRAG. It includes a sub-aspect\nexplorer to identify potential sub-aspects of input questions, a multi-faceted\nretriever to build a candidate pool of diverse external documents related to\nthese sub-aspects, and a generative list-wise ranker, which is a key module to\nprovide the top-k most valuable documents for the final generator. These ranked\ndocuments sufficiently cover various query aspects and are aware of the\ngenerator's preferences, hence incentivizing it to produce rich and\ncomprehensive responses for users. The training of our ranker involves a\nsupervised fine-tuning stage to ensure the basic coverage of documents, and a\nreinforcement learning stage to align downstream LLM's preferences to the\nranking of documents. Experimental results on two publicly available datasets\nprove that our framework effectively and efficiently provides comprehensive and\nsatisfying responses to users.", "paper_summary_zh": "檢索增強生成 (RAG) 有效地解決大型語言模型中靜態知識和幻覺的問題。現有研究主要集中在具有明確使用者意圖和簡潔答案的問題場景。然而，使用者經常提出廣泛、開放式的查詢，其中包含不同的子意圖，他們希望獲得豐富且長篇的答案，涵蓋多個相關方面。為了解決這個重要但尚未充分探討的問題，我們提出了一個新的 RAG 框架，即 RichRAG。它包括一個子方面探索器，用於識別輸入問題的潛在子方面，一個多方面的檢索器，用於建立與這些子方面相關的不同外部文件的候選池，以及一個生成式列表級別排名器，這是一個關鍵模組，用於為最終生成器提供最有價值的 top-k 文件。這些排名文件充分涵蓋了各種查詢方面，並且了解生成器的偏好，因此激勵它為使用者產生豐富且全面的回應。我們排名器的訓練包括一個監督微調階段，以確保文件的基本涵蓋範圍，以及一個強化學習階段，以將下游 LLM 的偏好與文件的排名保持一致。在兩個公開可用的資料集上的實驗結果證明，我們的框架有效且高效地為使用者提供了全面且令人滿意的回應。", "author": "Shuting Wang et.al.", "authors": "Shuting Wang, Xin Xu, Mang Wang, Weipeng Chen, Yutao Zhu, Zhicheng Dou", "id": "2406.12566v1", "paper_url": "http://arxiv.org/abs/2406.12566v1", "repo": "null"}}