{"2408.04522": {"publish_time": "2024-08-08", "title": "Compromesso! Italian Many-Shot Jailbreaks Undermine the Safety of Large Language Models", "paper_summary": "As diverse linguistic communities and users adopt large language models\n(LLMs), assessing their safety across languages becomes critical. Despite\nongoing efforts to make LLMs safe, they can still be made to behave unsafely\nwith jailbreaking, a technique in which models are prompted to act outside\ntheir operational guidelines. Research on LLM safety and jailbreaking, however,\nhas so far mostly focused on English, limiting our understanding of LLM safety\nin other languages. We contribute towards closing this gap by investigating the\neffectiveness of many-shot jailbreaking, where models are prompted with unsafe\ndemonstrations to induce unsafe behaviour, in Italian. To enable our analysis,\nwe create a new dataset of unsafe Italian question-answer pairs. With this\ndataset, we identify clear safety vulnerabilities in four families of\nopen-weight LLMs. We find that the models exhibit unsafe behaviors even when\nprompted with few unsafe demonstrations, and -- more alarmingly -- that this\ntendency rapidly escalates with more demonstrations.", "paper_summary_zh": "隨著多元的語言社群和使用者採用大型語言模型 (LLM)，評估其跨語言安全性變得至關重要。儘管持續努力讓 LLM 安全，但仍可透過越獄技術讓它們表現得並不安全，這是一種提示模型在運作準則之外採取行動的技術。然而，針對 LLM 安全性和越獄的研究迄今主要集中在英文，這限制了我們對其他語言中 LLM 安全性的了解。我們透過調查多發越獄的有效性來縮小這個差距，其中提示模型透過不安全的示範來誘發不安全的行為，以義大利文進行。為了進行分析，我們建立了一個新的不安全義大利文問答配對資料集。透過這個資料集，我們在四個開放權重 LLM 家族中找出明確的安全漏洞。我們發現，即使提示的示範不多，這些模型也會表現出不安全的行為，而且更令人擔憂的是，這種趨勢會隨著示範的增加而迅速升高。", "author": "Fabio Pernisi et.al.", "authors": "Fabio Pernisi, Dirk Hovy, Paul Röttger", "id": "2408.04522v1", "paper_url": "http://arxiv.org/abs/2408.04522v1", "repo": "null"}}