{"2502.13114": {"publish_time": "2025-02-18", "title": "The influence of motion features in temporal perception", "paper_summary": "This paper examines the role of manner-of-motion verbs in shaping subjective\ntemporal perception and emotional resonance. Through four complementary\nstudies, we explore how these verbs influence the conceptualization of time,\nexamining their use in literal and metaphorical (temporal) contexts. Our\nfindings reveal that faster verbs (e.g., fly, zoom) evoke dynamic and engaging\ntemporal experiences, often linked to positive emotions and greater agency. In\ncontrast, slower verbs (e.g., crawl, drag) convey passivity, monotony, and\nnegative emotions, reflecting tedious or constrained experiences of time. These\neffects are amplified in metaphorical contexts, where manner verbs encode\nemotional and experiential nuances that transcend their literal meanings. We\nalso find that participants prefer manner verbs over path verbs (e.g., go,\npass) in emotionally charged temporal contexts, as manner verbs capture the\nexperiential and emotional qualities of time more effectively. These findings\nhighlight the interplay between language, motion, and emotion in shaping\ntemporal perception, offering insights into how linguistic framing influences\nsubjective experiences of time.", "paper_summary_zh": "本文探討動作方式動詞在形塑主觀時間感知和情緒共鳴中所扮演的角色。透過四項互補的研究，我們探討這些動詞如何影響時間的概念化，並檢視它們在字面和隱喻（時間）語境中的用法。我們的研究結果顯示，較快的動詞（例如飛、飆）會引起動態且引人入勝的時間體驗，通常與正面情緒和較大的自主性有關。相反地，較慢的動詞（例如爬、拖）傳達了被動、單調和負面情緒，反映出乏味或受限的時間體驗。這些效應在隱喻語境中會被放大，其中動作動詞編碼了超越其字面意義的情緒和體驗細微差別。我們還發現，在充滿情緒的時間語境中，參與者偏好動作動詞而非路徑動詞（例如走、經過），因為動作動詞更有效地捕捉了時間的體驗和情緒品質。這些研究結果突顯了語言、動作和情緒之間在形塑時間感知中的交互作用，並提供了語言框架如何影響主觀時間體驗的見解。", "author": "Rosa Illan Castillo et.al.", "authors": "Rosa Illan Castillo, Javier Valenzuela", "id": "2502.13114v1", "paper_url": "http://arxiv.org/abs/2502.13114v1", "repo": "null"}}