{"2407.20806": {"publish_time": "2024-07-30", "title": "ARCLE: The Abstraction and Reasoning Corpus Learning Environment for Reinforcement Learning", "paper_summary": "This paper introduces ARCLE, an environment designed to facilitate\nreinforcement learning research on the Abstraction and Reasoning Corpus (ARC).\nAddressing this inductive reasoning benchmark with reinforcement learning\npresents these challenges: a vast action space, a hard-to-reach goal, and a\nvariety of tasks. We demonstrate that an agent with proximal policy\noptimization can learn individual tasks through ARCLE. The adoption of\nnon-factorial policies and auxiliary losses led to performance enhancements,\neffectively mitigating issues associated with action spaces and goal\nattainment. Based on these insights, we propose several research directions and\nmotivations for using ARCLE, including MAML, GFlowNets, and World Models.", "paper_summary_zh": "本文介紹了 ARCLE，一種環境，旨在促進抽象與推理語料庫 (ARC) 上的強化學習研究。使用強化學習來解決這個歸納推理基準會產生以下挑戰：廣大的動作空間、難以達成的目標，以及各種任務。我們證明了一個具有近端策略最佳化的代理可以透過 ARCLE 學習個別任務。採用非階乘策略和輔助損失導致效能提升，有效減輕與動作空間和目標達成相關的問題。根據這些見解，我們提出了幾個研究方向和使用 ARCLE 的動機，包括 MAML、GFlowNets 和世界模型。", "author": "Hosung Lee et.al.", "authors": "Hosung Lee, Sejin Kim, Seungpil Lee, Sanha Hwang, Jihwan Lee, Byung-Jun Lee, Sundong Kim", "id": "2407.20806v1", "paper_url": "http://arxiv.org/abs/2407.20806v1", "repo": "https://github.com/confeitohs/arcle"}}