{"2411.03865": {"publish_time": "2024-11-06", "title": "AdaSociety: An Adaptive Environment with Social Structures for Multi-Agent Decision-Making", "paper_summary": "Traditional interactive environments limit agents' intelligence growth with\nfixed tasks. Recently, single-agent environments address this by generating new\ntasks based on agent actions, enhancing task diversity. We consider the\ndecision-making problem in multi-agent settings, where tasks are further\ninfluenced by social connections, affecting rewards and information access.\nHowever, existing multi-agent environments lack a combination of adaptive\nphysical surroundings and social connections, hindering the learning of\nintelligent behaviors. To address this, we introduce AdaSociety, a customizable\nmulti-agent environment featuring expanding state and action spaces, alongside\nexplicit and alterable social structures. As agents progress, the environment\nadaptively generates new tasks with social structures for agents to undertake.\nIn AdaSociety, we develop three mini-games showcasing distinct social\nstructures and tasks. Initial results demonstrate that specific social\nstructures can promote both individual and collective benefits, though current\nreinforcement learning and LLM-based algorithms show limited effectiveness in\nleveraging social structures to enhance performance. Overall, AdaSociety serves\nas a valuable research platform for exploring intelligence in diverse physical\nand social settings. The code is available at\nhttps://github.com/bigai-ai/AdaSociety.", "paper_summary_zh": "傳統的互動式環境限制了代理的智慧成長，因為任務是固定的。最近，單一代理環境透過根據代理動作產生新任務來解決此問題，進而提升任務多樣性。我們考慮多代理設定中的決策問題，其中任務進一步受到社交連結的影響，進而影響獎勵和資訊存取。然而，現有的多代理環境缺乏適應性物理環境和社交連結的組合，這阻礙了智慧行為的學習。為了解決此問題，我們引入了 AdaSociety，這是一個可自訂的多代理環境，具有擴充的狀態和動作空間，以及明確且可變更的社交結構。隨著代理的進展，環境會適應性地產生具有社交結構的新任務，供代理執行。在 AdaSociety 中，我們開發了三個迷你遊戲，展示了不同的社交結構和任務。初步結果顯示，特定的社交結構可以促進個人和集體利益，儘管目前的強化學習和基於 LLM 的演算法在利用社交結構來提升效能方面顯示出有限的效力。總的來說，AdaSociety 可作為一個有價值的研究平台，用於探索在不同的物理和社交設定中的智慧。程式碼可在 https://github.com/bigai-ai/AdaSociety 取得。", "author": "Yizhe Huang et.al.", "authors": "Yizhe Huang, Xingbo Wang, Hao Liu, Fanqi Kong, Aoyang Qin, Min Tang, Xiaoxi Wang, Song-Chun Zhu, Mingjie Bi, Siyuan Qi, Xue Feng", "id": "2411.03865v1", "paper_url": "http://arxiv.org/abs/2411.03865v1", "repo": "https://github.com/bigai-ai/adasociety"}}