{"2412.08445": {"publish_time": "2024-12-11", "title": "TapeAgents: a Holistic Framework for Agent Development and Optimization", "paper_summary": "We present TapeAgents, an agent framework built around a granular, structured\nlog tape of the agent session that also plays the role of the session's\nresumable state. In TapeAgents we leverage tapes to facilitate all stages of\nthe LLM Agent development lifecycle. The agent reasons by processing the tape\nand the LLM output to produce new thought and action steps and append them to\nthe tape. The environment then reacts to the agent's actions by likewise\nappending observation steps to the tape. By virtue of this tape-centred design,\nTapeAgents can provide AI practitioners with holistic end-to-end support. At\nthe development stage, tapes facilitate session persistence, agent auditing,\nand step-by-step debugging. Post-deployment, one can reuse tapes for\nevaluation, fine-tuning, and prompt-tuning; crucially, one can adapt tapes from\nother agents or use revised historical tapes. In this report, we explain the\nTapeAgents design in detail. We demonstrate possible applications of TapeAgents\nwith several concrete examples of building monolithic agents and multi-agent\nteams, of optimizing agent prompts and finetuning the agent's LLM. We present\ntooling prototypes and report a case study where we use TapeAgents to finetune\na Llama-3.1-8B form-filling assistant to perform as well as GPT-4o while being\norders of magnitude cheaper. Lastly, our comparative analysis shows that\nTapeAgents's advantages over prior frameworks stem from our novel design of the\nLLM agent as a resumable, modular state machine with a structured\nconfiguration, that generates granular, structured logs and that can transform\nthese logs into training text -- a unique combination of features absent in\nprevious work.", "paper_summary_zh": "<paragraph>我們提出 TapeAgents，一種圍繞著代理人會話的細緻結構化日誌磁帶建立的代理人架構，該架構也扮演著會話可恢復狀態的角色。在 TapeAgents 中，我們利用磁帶促進 LLM 代理人開發生命週期的所有階段。代理人通過處理磁帶和 LLM 輸出，產生新的想法和行動步驟，並將它們附加到磁帶上，從而進行推理。然後，環境通過同樣將觀察步驟附加到磁帶上來對代理人的動作做出反應。由於這種以磁帶為中心的設計，TapeAgents 可以為 AI 從業者提供整體的端到端支持。在開發階段，磁帶促進會話持久性、代理人稽核和逐步除錯。部署後，可以重複使用磁帶進行評估、微調和提示調整；至關重要的是，可以調整其他代理人的磁帶或使用修改後的歷史磁帶。在此報告中，我們詳細說明了 TapeAgents 的設計。我們通過幾個具體的構建單體代理人和多代理人團隊、優化代理人提示和微調代理人的 LLM 的示例，展示了 TapeAgents 的可能的應用。我們展示了工具原型，並報告了一個案例研究，在該案例研究中，我們使用 TapeAgents 微調了 Llama-3.1-8B 表單填寫助手，使其在執行時與 GPT-4o 一樣好，同時成本低幾個數量級。最後，我們的比較分析表明，TapeAgents 相對於先前框架的優勢源於我們將 LLM 代理人設計成一個可恢復的、模組化的狀態機的新穎設計，它具有結構化的配置，可以產生細緻的、結構化的日誌，並且可以將這些日誌轉換為訓練文本——這是一個以前的工作中沒有的獨特功能組合。</paragraph>", "author": "Dzmitry Bahdanau et.al.", "authors": "Dzmitry Bahdanau, Nicolas Gontier, Gabriel Huang, Ehsan Kamalloo, Rafael Pardinas, Alex Piché, Torsten Scholak, Oleh Shliazhko, Jordan Prince Tremblay, Karam Ghanem, Soham Parikh, Mitul Tiwari, Quaizar Vohra", "id": "2412.08445v1", "paper_url": "http://arxiv.org/abs/2412.08445v1", "repo": "null"}}