{"2410.07951": {"publish_time": "2024-10-10", "title": "Disease Entity Recognition and Normalization is Improved with Large Language Model Derived Synthetic Normalized Mentions", "paper_summary": "Background: Machine learning methods for clinical named entity recognition\nand entity normalization systems can utilize both labeled corpora and Knowledge\nGraphs (KGs) for learning. However, infrequently occurring concepts may have\nfew mentions in training corpora and lack detailed descriptions or synonyms,\neven in large KGs. For Disease Entity Recognition (DER) and Disease Entity\nNormalization (DEN), this can result in fewer high quality training examples\nrelative to the number of known diseases. Large Language Model (LLM) generation\nof synthetic training examples could improve performance in these information\nextraction tasks.\n  Methods: We fine-tuned a LLaMa-2 13B Chat LLM to generate a synthetic corpus\ncontaining normalized mentions of concepts from the Unified Medical Language\nSystem (UMLS) Disease Semantic Group. We measured overall and Out of\nDistribution (OOD) performance for DER and DEN, with and without synthetic data\naugmentation. We evaluated performance on 3 different disease corpora using 4\ndifferent data augmentation strategies, assessed using BioBERT for DER and\nSapBERT and KrissBERT for DEN.\n  Results: Our synthetic data yielded a substantial improvement for DEN, in all\n3 training corpora the top 1 accuracy of both SapBERT and KrissBERT improved by\n3-9 points in overall performance and by 20-55 points in OOD data. A small\nimprovement (1-2 points) was also seen for DER in overall performance, but only\none dataset showed OOD improvement.\n  Conclusion: LLM generation of normalized disease mentions can improve DEN\nrelative to normalization approaches that do not utilize LLMs to augment data\nwith synthetic mentions. Ablation studies indicate that performance gains for\nDEN were only partially attributable to improvements in OOD performance. The\nsame approach has only a limited ability to improve DER. We make our software\nand dataset publicly available.", "paper_summary_zh": "<paragraph>背景：臨床命名實體識別的機器學習方法和實體正規化系統可以利用標記語料庫和知識圖譜 (KG) 來學習。然而，在訓練語料庫中很少出現的概念可能只有少數提及，即使在大型知識圖譜中也缺乏詳細的描述或同義詞。對於疾病實體識別 (DER) 和疾病實體正規化 (DEN)，相對於已知疾病的數量，這可能會導致較少的高品質訓練範例。大型語言模型 (LLM) 生成的合成訓練範例可以提升這些資訊擷取任務的效能。\n方法：我們微調了一個 LLaMa-2 13B 聊天 LLM，以產生一個合成語料庫，其中包含來自統一醫學語言系統 (UMLS) 疾病語義群的標準化概念提及。我們衡量了 DER 和 DEN 的整體和分布外 (OOD) 效能，有和沒有合成資料擴充。我們使用 4 種不同的資料擴充策略評估了 3 個不同疾病語料庫的效能，使用 BioBERT 評估 DER，使用 SapBERT 和 KrissBERT 評估 DEN。\n結果：我們的合成資料對 DEN 產生了顯著的改善，在所有 3 個訓練語料庫中，SapBERT 和 KrissBERT 的前 1 名準確率在整體效能上提高了 3-9 個百分點，在 OOD 資料中提高了 20-55 個百分點。在 DER 的整體效能上也看到了微小的改善（1-2 個百分點），但只有一組資料顯示出 OOD 改善。\n結論：與不利用 LLM 擴充資料以合成提及的正規化方法相比，LLM 生成的標準化疾病提及可以改善 DEN。消融研究表明，DEN 的效能提升僅部分歸因於 OOD 效能的改善。相同的方法對於改善 DER 的能力有限。我們公開我們的軟體和資料集。</paragraph>", "author": "Kuleen Sasse et.al.", "authors": "Kuleen Sasse, Shinjitha Vadlakonda, Richard E. Kennedy, John D. Osborne", "id": "2410.07951v1", "paper_url": "http://arxiv.org/abs/2410.07951v1", "repo": "null"}}