{"2502.11008": {"publish_time": "2025-02-16", "title": "CounterBench: A Benchmark for Counterfactuals Reasoning in Large Language Models", "paper_summary": "Counterfactual reasoning is widely recognized as one of the most challenging\nand intricate aspects of causality in artificial intelligence. In this paper,\nwe evaluate the performance of large language models (LLMs) in counterfactual\nreasoning. In contrast to previous studies that primarily focus on commonsense\ncausal reasoning, where LLMs often rely on prior knowledge for inference, we\nspecifically assess their ability to perform counterfactual inference using a\nset of formal rules. To support this evaluation, we introduce a new benchmark\ndataset, CounterBench, comprising 1K counterfactual reasoning questions. The\ndataset is designed with varying levels of difficulty, diverse causal graph\nstructures, distinct types of counterfactual questions, and multiple\nnonsensical name variants. Our experiments demonstrate that counterfactual\nreasoning poses a significant challenge for LLMs, with most models performing\nat levels comparable to random guessing. To enhance LLM's counterfactual\nreasoning ability, we propose a novel reasoning paradigm, CoIn, which guides\nLLMs through iterative reasoning and backtracking to systematically explore\ncounterfactual solutions. Experimental results show that our method\nsignificantly improves LLM performance on counterfactual reasoning tasks and\nconsistently enhances performance across different LLMs.Our dataset is\navailable at https://huggingface.co/datasets/CounterBench/CounterBench.", "paper_summary_zh": "反事實推理被廣泛認為是人工智慧中因果關係最具挑戰性和複雜的面向之一。在本文中，我們評估大型語言模型 (LLM) 在反事實推理中的表現。與主要關注常識因果推理，其中 LLM 經常依賴先驗知識來進行推理的先前研究不同，我們特別評估它們使用一組形式規則執行反事實推理的能力。為了支持此評估，我們引入了一個新的基準資料集 CounterBench，其中包含 1K 個反事實推理問題。資料集的設計具有不同的難度等級、多樣化的因果圖結構、不同類型的反事實問題和多種無意義的名稱變體。我們的實驗表明，反事實推理對 LLM 構成重大挑戰，大多數模型的表現與隨機猜測相當。為了增強 LLM 的反事實推理能力，我們提出了一種新穎的推理範例 CoIn，它引導 LLM 透過反覆推理和回溯系統性地探索反事實解。實驗結果表明，我們的方法顯著提升 LLM 在反事實推理任務上的表現，並持續增強不同 LLM 的表現。我們的資料集可在 https://huggingface.co/datasets/CounterBench/CounterBench 取得。", "author": "Yuefei Chen et.al.", "authors": "Yuefei Chen, Vivek K. Singh, Jing Ma, Ruxiang Tang", "id": "2502.11008v1", "paper_url": "http://arxiv.org/abs/2502.11008v1", "repo": "null"}}