{"2406.04202": {"publish_time": "2024-06-06", "title": "Legal Documents Drafting with Fine-Tuned Pre-Trained Large Language Model", "paper_summary": "With the development of large-scale Language Models (LLM), fine-tuning\npre-trained LLM has become a mainstream paradigm for solving downstream tasks\nof natural language processing. However, training a language model in the legal\nfield requires a large number of legal documents so that the language model can\nlearn legal terminology and the particularity of the format of legal documents.\nThe typical NLP approaches usually rely on many manually annotated data sets\nfor training. However, in the legal field application, it is difficult to\nobtain a large number of manually annotated data sets, which restricts the\ntypical method applied to the task of drafting legal documents. The\nexperimental results of this paper show that not only can we leverage a large\nnumber of annotation-free legal documents without Chinese word segmentation to\nfine-tune a large-scale language model, but more importantly, it can fine-tune\na pre-trained LLM on the local computer to achieve the generating legal\ndocument drafts task, and at the same time achieve the protection of\ninformation privacy and to improve information security issues.", "paper_summary_zh": "隨著大規模語言模型 (LLM) 的發展，微調預先訓練的 LLM 已成為解決自然語言處理下游任務的主流範例。然而，在法律領域訓練語言模型需要大量的法律文件，以便語言模型可以學習法律術語和法律文件格式的特殊性。典型的 NLP 方法通常依賴於許多手動註釋的資料集進行訓練。然而，在法律領域應用中，很難獲得大量的、手動註釋的資料集，這限制了典型方法應用於法律文件起草任務。本文的實驗結果表明，我們不僅可以利用大量沒有中文分詞的無註釋法律文件來微調大規模語言模型，更重要的是，可以在本地電腦上微調預先訓練的 LLM 以達成產生法律文件草稿任務，同時達成資訊隱私保護和提升資訊安全問題。", "author": "Chun-Hsien Lin et.al.", "authors": "Chun-Hsien Lin, Pu-Jen Cheng", "id": "2406.04202v1", "paper_url": "http://arxiv.org/abs/2406.04202v1", "repo": "https://huggingface.co/jslin09/bloom-560m-finetuned-fraud"}}