{"2409.16203": {"publish_time": "2024-09-24", "title": "Facial Expression-Enhanced TTS: Combining Face Representation and Emotion Intensity for Adaptive Speech", "paper_summary": "We propose FEIM-TTS, an innovative zero-shot text-to-speech (TTS) model that\nsynthesizes emotionally expressive speech, aligned with facial images and\nmodulated by emotion intensity. Leveraging deep learning, FEIM-TTS transcends\ntraditional TTS systems by interpreting facial cues and adjusting to emotional\nnuances without dependence on labeled datasets. To address sparse\naudio-visual-emotional data, the model is trained using LRS3, CREMA-D, and MELD\ndatasets, demonstrating its adaptability. FEIM-TTS's unique capability to\nproduce high-quality, speaker-agnostic speech makes it suitable for creating\nadaptable voices for virtual characters. Moreover, FEIM-TTS significantly\nenhances accessibility for individuals with visual impairments or those who\nhave trouble seeing. By integrating emotional nuances into TTS, our model\nenables dynamic and engaging auditory experiences for webcomics, allowing\nvisually impaired users to enjoy these narratives more fully. Comprehensive\nevaluation evidences its proficiency in modulating emotion and intensity,\nadvancing emotional speech synthesis and accessibility. Samples are available\nat: https://feim-tts.github.io/.", "paper_summary_zh": "我們提出 FEIM-TTS，這是一個創新的零次學習文字轉語音 (TTS) 模型，它可以合成富有情感表達力的語音，與面部影像對齊，並根據情緒強度進行調整。FEIM-TTS 透過深度學習超越傳統的 TTS 系統，它可以解讀面部線索並調整情緒細微差別，而無需依賴標記資料集。為了處理稀疏的視聽情緒資料，此模型使用 LRS3、CREMA-D 和 MELD 資料集進行訓練，展現其適應性。FEIM-TTS 具有獨特的能力，可以產生高品質、與說話者無關的語音，這使其適用於為虛擬角色創造可適應的聲音。此外，FEIM-TTS 大幅提升了視障人士或有視力問題者的無障礙性。透過將情緒細微差別整合到 TTS 中，我們的模型能為網路漫畫帶來動態且引人入勝的聽覺體驗，讓視障使用者能更充分享受這些敘事。全面的評估證明了其在調整情緒和強度方面的能力，進而推動了情緒語音合成和無障礙性。範例可在以下網址取得：https://feim-tts.github.io/。", "author": "Yunji Chu et.al.", "authors": "Yunji Chu, Yunseob Shim, Unsang Park", "id": "2409.16203v1", "paper_url": "http://arxiv.org/abs/2409.16203v1", "repo": "null"}}