{"2410.06615": {"publish_time": "2024-10-09", "title": "$β$-calibration of Language Model Confidence Scores for Generative QA", "paper_summary": "To use generative question-and-answering (QA) systems for decision-making and\nin any critical application, these systems need to provide well-calibrated\nconfidence scores that reflect the correctness of their answers. Existing\ncalibration methods aim to ensure that the confidence score is on average\nindicative of the likelihood that the answer is correct. We argue, however,\nthat this standard (average-case) notion of calibration is difficult to\ninterpret for decision-making in generative QA. To address this, we generalize\nthe standard notion of average calibration and introduce $\\beta$-calibration,\nwhich ensures calibration holds across different question-and-answer groups. We\nthen propose discretized posthoc calibration schemes for achieving\n$\\beta$-calibration.", "paper_summary_zh": "若要將生成式問答 (QA) 系統用於決策制定和任何關鍵應用程式，這些系統需要提供經過良好校準的信心評分，以反映其答案的正確性。現有的校準方法旨在確保信心評分平均表示答案正確的可能性。然而，我們認為，對於生成式 QA 中的決策制定而言，這種標準（平均情況）校準概念難以解釋。為了解決這個問題，我們將標準的平均校準概念加以概括，並引入 $\\beta$-校準，以確保校準適用於不同的問答群組。然後，我們提出離散化的後設校準方案，以實現 $\\beta$-校準。", "author": "Putra Manggala et.al.", "authors": "Putra Manggala, Atalanti Mastakouri, Elke Kirschbaum, Shiva Prasad Kasiviswanathan, Aaditya Ramdas", "id": "2410.06615v1", "paper_url": "http://arxiv.org/abs/2410.06615v1", "repo": "null"}}