{"2407.18461": {"publish_time": "2024-07-26", "title": "Enhancing Dysarthric Speech Recognition for Unseen Speakers via Prototype-Based Adaptation", "paper_summary": "Dysarthric speech recognition (DSR) presents a formidable challenge due to\ninherent inter-speaker variability, leading to severe performance degradation\nwhen applying DSR models to new dysarthric speakers. Traditional speaker\nadaptation methodologies typically involve fine-tuning models for each speaker,\nbut this strategy is cost-prohibitive and inconvenient for disabled users,\nrequiring substantial data collection. To address this issue, we introduce a\nprototype-based approach that markedly improves DSR performance for unseen\ndysarthric speakers without additional fine-tuning. Our method employs a\nfeature extractor trained with HuBERT to produce per-word prototypes that\nencapsulate the characteristics of previously unseen speakers. These prototypes\nserve as the basis for classification. Additionally, we incorporate supervised\ncontrastive learning to refine feature extraction. By enhancing representation\nquality, we further improve DSR performance, enabling effective personalized\nDSR. We release our code at https://github.com/NKU-HLT/PB-DSR.", "paper_summary_zh": "構音障礙語音識別 (DSR) 因與生俱來的說話者間差異而面臨嚴峻挑戰，導致將 DSR 模型應用於新的構音障礙說話者時，效能嚴重下降。傳統的說話者適應方法通常涉及微調每個說話者的模型，但對於殘疾使用者來說，這種策略既昂貴又不方便，需要大量的資料收集。為了解決這個問題，我們引入一種基於原型的做法，它顯著改善了 DSR 對未見過構音障礙說話者的表現，而無需額外的微調。我們的做法採用經由 HuBERT 訓練的特徵萃取器，以產生每個單詞的原型，這些原型包含先前未見過說話者的特徵。這些原型作為分類的基礎。此外，我們納入監督對比學習以改善特徵萃取。透過提升表徵品質，我們進一步改善 DSR 的表現，實現有效的個人化 DSR。我們在 https://github.com/NKU-HLT/PB-DSR/ 發布我們的程式碼。", "author": "Shiyao Wang et.al.", "authors": "Shiyao Wang, Shiwan Zhao, Jiaming Zhou, Aobo Kong, Yong Qin", "id": "2407.18461v1", "paper_url": "http://arxiv.org/abs/2407.18461v1", "repo": "https://github.com/nku-hlt/pb-dsr"}}