{"2407.04271": {"publish_time": "2024-07-05", "title": "Variational Partial Group Convolutions for Input-Aware Partial Equivariance of Rotations and Color-Shifts", "paper_summary": "Group Equivariant CNNs (G-CNNs) have shown promising efficacy in various\ntasks, owing to their ability to capture hierarchical features in an\nequivariant manner. However, their equivariance is fixed to the symmetry of the\nwhole group, limiting adaptability to diverse partial symmetries in real-world\ndatasets, such as limited rotation symmetry of handwritten digit images and\nlimited color-shift symmetry of flower images. Recent efforts address this\nlimitation, one example being Partial G-CNN which restricts the output group\nspace of convolution layers to break full equivariance. However, such an\napproach still fails to adjust equivariance levels across data. In this paper,\nwe propose a novel approach, Variational Partial G-CNN (VP G-CNN), to capture\nvarying levels of partial equivariance specific to each data instance. VP G-CNN\nredesigns the distribution of the output group elements to be conditioned on\ninput data, leveraging variational inference to avoid overfitting. This enables\nthe model to adjust its equivariance levels according to the needs of\nindividual data points. Additionally, we address training instability inherent\nin discrete group equivariance models by redesigning the reparametrizable\ndistribution. We demonstrate the effectiveness of VP G-CNN on both toy and\nreal-world datasets, including MNIST67-180, CIFAR10, ColorMNIST, and\nFlowers102. Our results show robust performance, even in uncertainty metrics.", "paper_summary_zh": "群等變式 CNN (G-CNN) 在各種任務中展現出有希望的功效，因為它們能夠以等變式的方式擷取階層特徵。然而，它們的等變式固定在整個群的對稱性上，限制了適應真實世界資料集中多樣化的部分對稱性，例如手寫數字影像的有限旋轉對稱性，以及花朵影像的有限色彩變換對稱性。最近的研究解決了這個限制，一個範例是 Partial G-CNN，它限制了卷積層的輸出群空間以打破完全等變式。然而，這種方法仍然無法調整資料中的等變式層級。在本文中，我們提出了一種新方法，變分 Partial G-CNN (VP G-CNN)，以擷取特定於每個資料實例的不同程度的部分等變式。VP G-CNN 重新設計了輸出群元素的分配，以輸入資料為條件，並利用變分推論來避免過度擬合。這使模型能夠根據個別資料點的需求調整其等變式層級。此外，我們透過重新設計可重新參數化的分配，來解決離散群等變式模型中固有的訓練不穩定性。我們在玩具和真實世界資料集上展示了 VP G-CNN 的有效性，包括 MNIST67-180、CIFAR10、ColorMNIST 和 Flowers102。我們的結果顯示出穩健的效能，即使在不確定性指標中也是如此。", "author": "Hyunsu Kim et.al.", "authors": "Hyunsu Kim, Yegon Kim, Hongseok Yang, Juho Lee", "id": "2407.04271v1", "paper_url": "http://arxiv.org/abs/2407.04271v1", "repo": "null"}}