{"2504.12422": {"publish_time": "2025-04-16", "title": "Mitigating LLM Hallucinations with Knowledge Graphs: A Case Study", "paper_summary": "High-stakes domains like cyber operations need responsible and trustworthy AI\nmethods. While large language models (LLMs) are becoming increasingly popular\nin these domains, they still suffer from hallucinations. This research paper\nprovides learning outcomes from a case study with LinkQ, an open-source natural\nlanguage interface that was developed to combat hallucinations by forcing an\nLLM to query a knowledge graph (KG) for ground-truth data during\nquestion-answering (QA). We conduct a quantitative evaluation of LinkQ using a\nwell-known KGQA dataset, showing that the system outperforms GPT-4 but still\nstruggles with certain question categories - suggesting that alternative query\nconstruction strategies will need to be investigated in future LLM querying\nsystems. We discuss a qualitative study of LinkQ with two domain experts using\na real-world cybersecurity KG, outlining these experts' feedback, suggestions,\nperceived limitations, and future opportunities for systems like LinkQ.", "paper_summary_zh": "<paragraph>高風險領域，例如網路作戰，需要負責任且值得信賴的 AI 方法。雖然大型語言模型 (LLM) 在這些領域越來越流行，但它們仍然會產生幻覺（錯誤資訊）。本研究論文提供了一個關於 LinkQ 的案例研究之學習成果，LinkQ 是一個開源自然語言介面，旨在透過強制 LLM 在問答 (QA) 過程中查詢知識圖譜 (KG) 以獲取真實數據來對抗幻覺。我們使用一個知名的 KGQA 資料集對 LinkQ 進行了定量評估，結果顯示該系統的性能優於 GPT-4，但在某些問題類別上仍然存在困難，這表明在未來的 LLM 查詢系統中需要研究替代查詢建構策略。我們與兩位領域專家使用真實世界的網路安全 KG 對 LinkQ 進行了定性研究，概述了這些專家的回饋、建議、感知到的限制以及 LinkQ 等系統的未來發展機會。</paragraph>\n", "author": "Harry Li et.al.", "authors": "Harry Li, Gabriel Appleby, Kenneth Alperin, Steven R Gomez, Ashley Suh", "id": "2504.12422v1", "paper_url": "http://arxiv.org/abs/2504.12422v1", "repo": "null"}}