{"2411.04425": {"publish_time": "2024-11-07", "title": "DELIFT: Data Efficient Language model Instruction Fine Tuning", "paper_summary": "Fine-tuning large language models (LLMs) is essential for enhancing their\nperformance on specific tasks but is often resource-intensive due to redundant\nor uninformative data. To address this inefficiency, we introduce DELIFT (Data\nEfficient Language model Instruction Fine-Tuning), a novel algorithm that\nsystematically optimizes data selection across the three key stages of\nfine-tuning: (1) instruction tuning, (2) task-specific fine-tuning (e.g.,\nreasoning, question-answering), and (3) continual fine-tuning (e.g.,\nincorporating new data versions). Unlike existing methods that focus on\nsingle-stage optimization or rely on computationally intensive gradient\ncalculations, DELIFT operates efficiently across all stages. Central to our\napproach is a pairwise utility metric that quantifies how beneficial a data\nsample is for improving the model's responses to other samples, effectively\nmeasuring the informational value relative to the model's current capabilities.\nBy leveraging different submodular functions applied to this metric, DELIFT\nselects diverse and optimal subsets that are useful across all stages of\nfine-tuning. Experiments across various tasks and model scales demonstrate that\nDELIFT can reduce the fine-tuning data size by up to 70% without compromising\nperformance, offering significant computational savings and outperforming\nexisting methods in both efficiency and efficacy.", "paper_summary_zh": "微調大型語言模型 (LLM) 對於提升其在特定任務上的表現至關重要，但由於冗餘或無資訊資料，通常會耗費大量資源。為了解決此低效率問題，我們引入了 DELIFT（資料有效語言模型指令微調），一種新演算法，可系統性地最佳化微調三個關鍵階段的資料選取：(1) 指令微調、(2) 任務特定微調（例如推理、問答），以及 (3) 持續微調（例如納入新資料版本）。與現有方法不同，現有方法專注於單階段最佳化或依賴於計算密集的梯度計算，DELIFT 在所有階段都能有效運作。我們方法的核心是一個成對效用指標，用於量化資料範例對於改善模型對其他範例的回應有多大的好處，有效地衡量相對於模型當前功能的資訊價值。透過對此指標應用不同的次模函數，DELIFT 選取在微調的所有階段都有用的多樣化且最佳子集。在各種任務和模型規模的實驗中顯示，DELIFT 可以將微調資料大小減少多達 70%，同時不影響效能，提供顯著的計算節省，並在效率和效力方面優於現有方法。", "author": "Ishika Agarwal et.al.", "authors": "Ishika Agarwal, Krishna Killamsetty, Lucian Popa, Marina Danilevksy", "id": "2411.04425v1", "paper_url": "http://arxiv.org/abs/2411.04425v1", "repo": "https://github.com/agarwalishika/delift"}}