{"2408.09594": {"publish_time": "2024-08-18", "title": "Moonshine: Distilling Game Content Generators into Steerable Generative Models", "paper_summary": "Procedural Content Generation via Machine Learning (PCGML) has enhanced game\ncontent creation, yet challenges in controllability and limited training data\npersist. This study addresses these issues by distilling a constructive PCG\nalgorithm into a controllable PCGML model. We first generate a large amount of\ncontent with a constructive algorithm and label it using a Large Language Model\n(LLM). We use these synthetic labels to condition two PCGML models for\ncontent-specific generation, a diffusion model and the five-dollar model. This\nneural network distillation process ensures that the generation aligns with the\noriginal algorithm while introducing controllability through plain text. We\ndefine this text-conditioned PCGML as a Text-to-game-Map (T2M) task, offering\nan alternative to prevalent text-to-image multi-modal tasks. We compare our\ndistilled models with the baseline constructive algorithm. Our analysis of the\nvariety, accuracy, and quality of our generation demonstrates the efficacy of\ndistilling constructive methods into controllable text-conditioned PCGML\nmodels.", "paper_summary_zh": "透過機器學習的程序內容生成（PCGML）提升了遊戲內容的創作，但控制能力和有限的訓練資料仍然是挑戰。本研究透過將建構式 PCG 演算法提煉成可控的 PCGML 模型來解決這些問題。我們首先使用建構式演算法產生大量的內容，並使用大型語言模型（LLM）為其加上標籤。我們使用這些合成標籤來對應兩個 PCGML 模型進行內容特定生成，一個是擴散模型，另一個是五美元模型。這個神經網路提煉流程確保生成內容與原始演算法一致，同時透過純文字引入可控性。我們將這種文字條件式 PCGML 定義為文字轉遊戲地圖（T2M）任務，提供一個替代於流行文字轉圖片多模態任務的選擇。我們將提煉出的模型與基準建構式演算法進行比較。我們對生成內容的多樣性、準確性和品質的分析證明了將建構式方法提煉成可控文字條件式 PCGML 模型的有效性。", "author": "Yuhe Nie et.al.", "authors": "Yuhe Nie, Michael Middleton, Tim Merino, Nidhushan Kanagaraja, Ashutosh Kumar, Zhan Zhuang, Julian Togelius", "id": "2408.09594v1", "paper_url": "http://arxiv.org/abs/2408.09594v1", "repo": "null"}}