{"2411.05028": {"publish_time": "2024-11-05", "title": "Leveraging Transfer Learning and Multiple Instance Learning for HER2 Automatic Scoring of H\\&E Whole Slide Images", "paper_summary": "Expression of human epidermal growth factor receptor 2 (HER2) is an important\nbiomarker in breast cancer patients who can benefit from cost-effective\nautomatic Hematoxylin and Eosin (H\\&E) HER2 scoring. However, developing such\nscoring models requires large pixel-level annotated datasets. Transfer learning\nallows prior knowledge from different datasets to be reused while\nmultiple-instance learning (MIL) allows the lack of detailed annotations to be\nmitigated. The aim of this work is to examine the potential of transfer\nlearning on the performance of deep learning models pre-trained on (i)\nImmunohistochemistry (IHC) images, (ii) H\\&E images and (iii) non-medical\nimages. A MIL framework with an attention mechanism is developed using\npre-trained models as patch-embedding models. It was found that embedding\nmodels pre-trained on H\\&E images consistently outperformed the others,\nresulting in an average AUC-ROC value of $0.622$ across the 4 HER2 scores\n($0.59-0.80$ per HER2 score). Furthermore, it was found that using\nmultiple-instance learning with an attention layer not only allows for good\nclassification results to be achieved, but it can also help with producing\nvisual indication of HER2-positive areas in the H\\&E slide image by utilising\nthe patch-wise attention weights.", "paper_summary_zh": "人類表皮生長因子受體 2 (HER2) 的表現是乳癌患者中的一項重要生物標記，這些患者可以受益於具有成本效益的自動蘇木精和伊紅 (H&E) HER2 評分。然而，開發此類評分模型需要大量的像素級註解資料集。遷移學習允許重複使用來自不同資料集的先驗知識，而多實例學習 (MIL) 允許減輕詳細註解的缺乏。這項工作的目的是檢查遷移學習在預先訓練於 (i) 免疫組織化學 (IHC) 影像、(ii) H&E 影像和 (iii) 非醫學影像上的深度學習模型的效能上的潛力。使用預先訓練的模型作為區塊嵌入模型，開發了一個具有注意力機制的 MIL 框架。研究發現，預先訓練於 H&E 影像上的嵌入模型始終優於其他模型，在 4 個 HER2 分數中產生平均 AUC-ROC 值為 $0.622$（每個 HER2 分數為 $0.59-0.80$）。此外，研究發現，使用具有注意力層的多實例學習不僅可以獲得良好的分類結果，還可以幫助通過利用區塊注意力權重產生 H&E 玻片影像中 HER2 陽性區域的可視化指示。", "author": "Rawan S. Abdulsadig et.al.", "authors": "Rawan S. Abdulsadig, Bryan M. Williams, Nikolay Burlutskiy", "id": "2411.05028v1", "paper_url": "http://arxiv.org/abs/2411.05028v1", "repo": "null"}}