{"2411.07457": {"publish_time": "2024-11-12", "title": "DecoPrompt : Decoding Prompts Reduces Hallucinations when Large Language Models Meet False Premises", "paper_summary": "While large language models (LLMs) have demonstrated increasing power, they\nhave also called upon studies on their hallucinated outputs that deviate from\nfactually correct statements. In this paper, we focus on one important scenario\nof false premises, where LLMs are distracted by misaligned claims although the\nmodel possesses the required factual knowledge to answer original questions\naccurately. Inspired by the observation that entropy of the false-premise\nprompt is closely related to its likelihood to elicit hallucination generation,\nwe propose a new prompting algorithm, named DecoPrompt, to mitigate\nhallucination. DecoPrompt leverages LLMs to \"decode\" the false-premise prompts\nwithout really eliciting hallucination output from LLMs. We perform experiments\non two datasets, demonstrating that DecoPrompt can reduce hallucinations\neffectively on outputs from different LLMs. Moreover, DecoPrompt exhibits\ncross-model transferability, which facilitates its applications to scenarios\nsuch as LLMs of large sizes or unavailable model logits.", "paper_summary_zh": "儘管大型語言模型（LLM）已展現出越來越強大的能力，但它們也需要針對其虛構輸出進行研究，這些輸出偏離了事實正確的陳述。在本文中，我們專注於一個錯誤前提的重要場景，在該場景中，LLM 會被錯誤的說法分散注意力，儘管該模型具備準確回答原始問題所需的實際知識。受虛假前提提示的熵與其引發幻覺產生的可能性密切相關的觀察結果啟發，我們提出了一種名為 DecoPrompt 的新提示演算法，以減輕幻覺。DecoPrompt 利用 LLM 來「解碼」錯誤前提提示，而不會真正引發 LLM 的幻覺輸出。我們在兩個資料集上執行實驗，證明 DecoPrompt 可以有效減少不同 LLM 輸出中的幻覺。此外，DecoPrompt 展現出跨模型的可轉移性，這有助於其應用於大型 LLM 或不可用模型邏輯值等場景。", "author": "Nan Xu et.al.", "authors": "Nan Xu, Xuezhe Ma", "id": "2411.07457v1", "paper_url": "http://arxiv.org/abs/2411.07457v1", "repo": "https://github.com/xunannancy/decoprompt"}}