{"2410.16148": {"publish_time": "2024-10-21", "title": "PODTILE: Facilitating Podcast Episode Browsing with Auto-generated Chapters", "paper_summary": "Listeners of long-form talk-audio content, such as podcast episodes, often\nfind it challenging to understand the overall structure and locate relevant\nsections. A practical solution is to divide episodes into\nchapters--semantically coherent segments labeled with titles and timestamps.\nSince most episodes on our platform at Spotify currently lack creator-provided\nchapters, automating the creation of chapters is essential. Scaling the\nchapterization of podcast episodes presents unique challenges. First, episodes\ntend to be less structured than written texts, featuring spontaneous\ndiscussions with nuanced transitions. Second, the transcripts are usually\nlengthy, averaging about 16,000 tokens, which necessitates efficient processing\nthat can preserve context. To address these challenges, we introduce PODTILE, a\nfine-tuned encoder-decoder transformer to segment conversational data. The\nmodel simultaneously generates chapter transitions and titles for the input\ntranscript. To preserve context, each input text is augmented with global\ncontext, including the episode's title, description, and previous chapter\ntitles. In our intrinsic evaluation, PODTILE achieved an 11% improvement in\nROUGE score over the strongest baseline. Additionally, we provide insights into\nthe practical benefits of auto-generated chapters for listeners navigating\nepisode content. Our findings indicate that auto-generated chapters serve as a\nuseful tool for engaging with less popular podcasts. Finally, we present\nempirical evidence that using chapter titles can enhance effectiveness of\nsparse retrieval in search tasks.", "paper_summary_zh": "<paragraph>聆聽長篇談話式音訊內容（例如播客節目）的聽眾，通常很難理解整體結構並找到相關部分。一個實用的解決方案是將節目分為章節，即標記有標題和時間戳的語義連貫區段。由於 Spotify 上我們平台上的大多數節目目前缺乏創作者提供的章節，因此自動建立章節至關重要。對播客節目進行章節化的擴展提出了獨特的挑戰。首先，節目往往不如書面文本結構化，而是以自發的討論和微妙的過渡為特色。其次，謄本通常很長，平均約 16,000 個詞彙，這需要能夠保留上下文的有效處理。為了應對這些挑戰，我們引入了 PODTILE，一個經過微調的編碼器-解碼器轉換器，用於對話數據進行分段。該模型同時為輸入謄本生成章節轉換和標題。為了保留上下文，每個輸入文本都附有全局上下文，包括節目的標題、描述和前一章節的標題。在我們的內部評估中，PODTILE 的 ROUGE 得分比最強的基準線提高了 11%。此外，我們提供了對自動生成章節對聽眾瀏覽節目內容的實際好處的見解。我們的研究結果表明，自動生成的章節可用作與不太流行的播客互動的有用工具。最後，我們提出了經實證證明的證據，表明使用章節標題可以提高搜索任務中稀疏檢索的有效性。</paragraph>", "author": "Azin Ghazimatin et.al.", "authors": "Azin Ghazimatin, Ekaterina Garmash, Gustavo Penha, Kristen Sheets, Martin Achenbach, Oguz Semerci, Remi Galvez, Marcus Tannenberg, Sahitya Mantravadi, Divya Narayanan, Ofeliya Kalaydzhyan, Douglas Cole, Ben Carterette, Ann Clifton, Paul N. Bennett, Claudia Hauff, Mounia Lalmas", "id": "2410.16148v1", "paper_url": "http://arxiv.org/abs/2410.16148v1", "repo": "null"}}