{"2501.06146": {"publish_time": "2025-01-10", "title": "xLSTM-SENet: xLSTM for Single-Channel Speech Enhancement", "paper_summary": "While attention-based architectures, such as Conformers, excel in speech\nenhancement, they face challenges such as scalability with respect to input\nsequence length. In contrast, the recently proposed Extended Long Short-Term\nMemory (xLSTM) architecture offers linear scalability. However, xLSTM-based\nmodels remain unexplored for speech enhancement. This paper introduces\nxLSTM-SENet, the first xLSTM-based single-channel speech enhancement system. A\ncomparative analysis reveals that xLSTM-and notably, even LSTM-can match or\noutperform state-of-the-art Mamba- and Conformer-based systems across various\nmodel sizes in speech enhancement on the VoiceBank+Demand dataset. Through\nablation studies, we identify key architectural design choices such as\nexponential gating and bidirectionality contributing to its effectiveness. Our\nbest xLSTM-based model, xLSTM-SENet2, outperforms state-of-the-art Mamba- and\nConformer-based systems on the Voicebank+DEMAND dataset.", "paper_summary_zh": "基於注意力的架構，例如 Conformers，在語音增強方面表現出色，但它們在輸入序列長度方面面臨可擴充性等挑戰。相比之下，最近提出的擴展長短期記憶 (xLSTM) 架構提供了線性可擴充性。然而，基於 xLSTM 的模型在語音增強方面仍未得到探索。本文介紹了 xLSTM-SENet，這是第一個基於 xLSTM 的單通道語音增強系統。比較分析表明，xLSTM 甚至 LSTM 可以與最先進的基於 Mamba 和 Conformer 的系統相匹配或優於它們，這適用於 VoiceBank+Demand 資料集上的語音增強中的各種模型大小。通過消融研究，我們確定了關鍵的架構設計選擇，例如指數閘控和雙向性，這些選擇有助於提高其有效性。我們最好的基於 xLSTM 的模型 xLSTM-SENet2 在 Voicebank+DEMAND 資料集上優於最先進的基於 Mamba 和 Conformer 的系統。", "author": "Nikolai Lund Kühne et.al.", "authors": "Nikolai Lund Kühne, Jan Østergaard, Jesper Jensen, Zheng-Hua Tan", "id": "2501.06146v1", "paper_url": "http://arxiv.org/abs/2501.06146v1", "repo": "null"}}