{"2412.20715": {"publish_time": "2024-12-30", "title": "ChartAdapter: Large Vision-Language Model for Chart Summarization", "paper_summary": "Chart summarization, which focuses on extracting key information from charts\nand interpreting it in natural language, is crucial for generating and\ndelivering insights through effective and accessible data analysis. Traditional\nmethods for chart understanding and summarization often rely on multi-stage\npipelines, which may produce suboptimal semantic alignment between visual and\ntextual information. In comparison, recently developed LLM-based methods are\nmore dependent on the capability of foundation images or languages, while\nignoring the characteristics of chart data and its relevant challenges. To\naddress these limitations, we propose ChartAdapter, a novel lightweight\ntransformer module designed to bridge the gap between charts and textual\nsummaries. ChartAdapter employs learnable query vectors to extract implicit\nsemantics from chart data and incorporates a cross-modal alignment projector to\nenhance vision-to-language generative learning. By integrating ChartAdapter\nwith an LLM, we enable end-to-end training and efficient chart summarization.\nTo further enhance the training, we introduce a three-stage hierarchical\ntraining procedure and develop a large-scale dataset specifically curated for\nchart summarization, comprising 190,618 samples. Experimental results on the\nstandard Chart-to-Text testing set demonstrate that our approach significantly\noutperforms existing methods, including state-of-the-art models, in generating\nhigh-quality chart summaries. Ablation studies further validate the\neffectiveness of key components in ChartAdapter. This work highlights the\npotential of tailored LLM-based approaches to advance chart understanding and\nsets a strong foundation for future research in this area.", "paper_summary_zh": "圖表摘要著重於從圖表中萃取關鍵資訊，並以自然語言加以詮釋，對於透過有效且易於取得的資料分析來產生並傳遞見解至關重要。傳統的圖表理解與摘要方法通常仰賴多階段管線，這可能會在視覺與文字資訊之間產生次佳的語意對齊。相較之下，最近開發的 LLM 為基礎的方法更依賴於基礎影像或語言的能力，同時忽略圖表資料的特性及其相關挑戰。為了解決這些限制，我們提出 ChartAdapter，這是一個新穎的輕量級轉換器模組，旨在橋接圖表和文字摘要之間的差距。ChartAdapter 採用可學習的查詢向量從圖表資料中萃取隱含語意，並結合跨模態對齊投影機來增強視覺到語言的生成式學習。透過將 ChartAdapter 與 LLM 整合，我們能夠進行端到端的訓練和高效的圖表摘要。為了進一步增強訓練，我們引入了三階段階層式訓練程序，並開發了一個專門為圖表摘要整理的大規模資料集，包含 190,618 個樣本。在標準 Chart-to-Text 測試集上的實驗結果證明，我們的做法在產生高品質圖表摘要方面顯著優於現有方法，包括最先進的模型。消融研究進一步驗證了 ChartAdapter 中關鍵組件的有效性。這項工作突顯了客製化 LLM 為基礎的方法在促進圖表理解方面的潛力，並為此領域的未來研究奠定了堅實的基礎。", "author": "Peixin Xu et.al.", "authors": "Peixin Xu, Yujuan Ding, Wenqi Fan", "id": "2412.20715v1", "paper_url": "http://arxiv.org/abs/2412.20715v1", "repo": "null"}}