{"2412.20864": {"publish_time": "2024-12-30", "title": "Enhancing Annotated Bibliography Generation with LLM Ensembles", "paper_summary": "This work proposes a novel approach to enhancing annotated bibliography\ngeneration through Large Language Model (LLM) ensembles. In particular,\nmultiple LLMs in different roles -- controllable text generation, evaluation,\nand summarization -- are introduced and validated using a systematic\nmethodology to enhance model performance in scholarly tasks. Output diversity\namong the ensemble that generates text is obtained using different LLM\nparameters, followed by an LLM acting as a judge to assess relevance, accuracy,\nand coherence. Responses selected by several combining strategies are then\nmerged and refined through summarization and redundancy removal techniques. The\npreliminary experimental validation demonstrates that the combined outputs from\nthe LLM ensemble improve coherence and relevance compared to individual\nresponses, leading to a 38% improvement in annotation quality and a 51%\nreduction in content redundancy, thus highlighting the potential for automating\ncomplex scholarly tasks while maintaining high-quality standards.", "paper_summary_zh": "這項工作提出了一種新方法，透過大型語言模型 (LLM) 整合來增強註解書目生成。特別是，在不同角色中引入了多個 LLM -- 可控文字生成、評估和摘要 -- 並使用系統化方法驗證，以增強模型在學術任務中的效能。文字生成整合中的輸出多樣性是使用不同的 LLM 參數取得的，接著由 LLM 作為評審者來評估相關性、準確性和一致性。然後透過摘要和移除冗餘技術合併和精煉由多種組合策略選出的回應。初步實驗驗證顯示，與個別回應相比，LLM 整合的組合輸出改善了一致性和相關性，導致註解品質改善了 38%，內容冗餘減少了 51%，因此突出了在維持高品質標準的同時自動化複雜學術任務的潛力。", "author": "Sergio Bermejo et.al.", "authors": "Sergio Bermejo", "id": "2412.20864v1", "paper_url": "http://arxiv.org/abs/2412.20864v1", "repo": "null"}}