{"2406.15341": {"publish_time": "2024-06-21", "title": "GenoTEX: A Benchmark for Evaluating LLM-Based Exploration of Gene Expression Data in Alignment with Bioinformaticians", "paper_summary": "Recent advancements in machine learning have significantly improved the\nidentification of disease-associated genes from gene expression datasets.\nHowever, these processes often require extensive expertise and manual effort,\nlimiting their scalability. Large Language Model (LLM)-based agents have shown\npromise in automating these tasks due to their increasing problem-solving\nabilities. To support the evaluation and development of such methods, we\nintroduce GenoTEX, a benchmark dataset for the automatic exploration of gene\nexpression data, involving the tasks of dataset selection, preprocessing, and\nstatistical analysis. GenoTEX provides annotated code and results for solving a\nwide range of gene identification problems, in a full analysis pipeline that\nfollows the standard of computational genomics. These annotations are curated\nby human bioinformaticians who carefully analyze the datasets to ensure\naccuracy and reliability. To provide baselines for these tasks, we present\nGenoAgents, a team of LLM-based agents designed with context-aware planning,\niterative correction, and domain expert consultation to collaboratively explore\ngene datasets. Our experiments with GenoAgents demonstrate the potential of\nLLM-based approaches in genomics data analysis, while error analysis highlights\nthe challenges and areas for future improvement. We propose GenoTEX as a\npromising resource for benchmarking and enhancing AI-driven methods for\ngenomics data analysis. We make our benchmark publicly available at\n\\url{https://github.com/Liu-Hy/GenoTex}.", "paper_summary_zh": "機器學習最近的進展已大幅提升從基因表現資料集中辨識與疾病相關基因的能力。\n然而，這些程序通常需要廣泛的專業知識和手動操作，限制了它們的可擴充性。大型語言模型 (LLM) 基礎代理已展現出自動化這些任務的潛力，因為它們的問題解決能力日益提升。為了支援此類方法的評估和開發，我們引入了 GenoTEX，這是一個基準資料集，用於自動探索基因表現資料，涉及資料集選取、前處理和統計分析的任務。GenoTEX 提供了註解程式碼和結果，用於解決廣泛的基因辨識問題，並採用遵循計算基因組學標準的完整分析流程。這些註解是由人類生物資訊學家策展的，他們仔細分析資料集以確保準確性和可靠性。為了提供這些任務的基準，我們提出了 GenoAgents，這是一個 LLM 基礎代理團隊，設計時具備情境感知規劃、反覆修正和領域專家諮詢功能，以協作探索基因資料集。我們對 GenoAgents 的實驗展示了 LLM 基礎方法在基因組資料分析中的潛力，而錯誤分析則突顯了挑戰和未來改進的領域。我們提出 GenoTEX 作為一個有前途的資源，用於對基因組資料分析的人工智慧驅動方法進行基準測試和強化。我們在 \\url{https://github.com/Liu-Hy/GenoTex} 公開提供我們的基準。", "author": "Haoyang Liu et.al.", "authors": "Haoyang Liu, Haohan Wang", "id": "2406.15341v1", "paper_url": "http://arxiv.org/abs/2406.15341v1", "repo": "https://github.com/liu-hy/genotex"}}