{"2502.02145": {"publish_time": "2025-02-04", "title": "Risk-Aware Driving Scenario Analysis with Large Language Models", "paper_summary": "Large Language Models (LLMs) can capture nuanced contextual relationships,\nreasoning, and complex problem-solving. By leveraging their ability to process\nand interpret large-scale information, LLMs have shown potential to address\ndomain-specific challenges, including those in autonomous driving systems. This\npaper proposes a novel framework that leverages LLMs for risk-aware analysis of\ngenerated driving scenarios. We hypothesize that LLMs can effectively evaluate\nwhether driving scenarios generated by autonomous driving testing simulators\nare safety-critical. To validate this hypothesis, we conducted an empirical\nevaluation to assess the effectiveness of LLMs in performing this task. This\nframework will also provide feedback to generate the new safety-critical\nscenario by using adversarial method to modify existing non-critical scenarios\nand test their effectiveness in validating motion planning algorithms. Code and\nscenarios are available at:\nhttps://github.com/yuangao-tum/Riskaware-Scenario-analyse", "paper_summary_zh": "大型語言模型 (LLM) 能夠捕捉細微的脈絡關係、推理和複雜的問題解決。藉由運用其處理和詮釋大規模資訊的能力，LLM 已展現出解決特定領域挑戰的潛力，包括自動駕駛系統中的挑戰。本文提出一個新穎的架構，利用 LLM 對自動駕駛測試模擬器產生的駕駛場景進行風險感知分析。我們假設 LLM 能有效評估自動駕駛測試模擬器產生的駕駛場景是否攸關安全。為了驗證這個假設，我們進行了一項實證評估，以評估 LLM 在執行此任務時的有效性。此架構還將提供回饋，以透過對抗法修改現有的非關鍵場景來產生新的安全關鍵場景，並測試其在驗證運動規劃演算法中的有效性。程式碼和場景可在以下網址取得：\nhttps://github.com/yuangao-tum/Riskaware-Scenario-analyse", "author": "Yuan Gao et.al.", "authors": "Yuan Gao, Mattia Piccinini, Johannes Betz", "id": "2502.02145v1", "paper_url": "http://arxiv.org/abs/2502.02145v1", "repo": "null"}}