{"2409.19877": {"publish_time": "2024-09-30", "title": "Contrastive Token Learning with Similarity Decay for Repetition Suppression in Machine Translation", "paper_summary": "For crosslingual conversation and trade, Neural Machine Translation (NMT) is\npivotal yet faces persistent challenges with monotony and repetition in\ngenerated content. Traditional solutions that rely on penalizing text\nredundancy or token reoccurrence have shown limited efficacy, particularly for\nlengthy article and e-commerce descriptions with inherent redundancy, even with\nthe advent of Large Language Models (LLMs). This paper investigates the\nunderlying causes of textual repetition through the lens of information\nentropy, attributing the phenomenon to the elevated uncertainty within the\ninput text. To address this, a novel algorithm named Contrastive Token Learning\nwith Similarity Decay (CTSD) is introduced, which modulates the suppression of\ntokens dynamically, informed by varying attention weights and inter-token\ndistances. Furthermore, an e-commerce dataset comprised of title texts of\nonline real items is compiled and released susceptible to hallucination\ntranslations to benchmark the algorithm. Extensive evaluations demonstrate that\nCTSD significantly outperforms existing approaches in precision and\ngeneralizability. Additional online A/B testing underscores its practical\nvalue, showing marked improvements in user engagement and conversion. Notably,\nthis method has been implemented with full traffic on eight multilingual sites\nof alibaba.com, the largest B2B e-commerce platform in the world.", "paper_summary_zh": "對於跨語言對話和貿易而言，神經機器翻譯 (NMT) 至關重要，但仍面臨著生成內容中單調和重複的持續挑戰。傳統的解決方案依賴於懲罰文字冗餘或標記重現，已顯示出有限的功效，特別是對於具有內在冗餘的冗長文章和電子商務描述，即使出現了大型語言模型 (LLM)。本文通過資訊熵的視角探討了文字重複的根本原因，將這種現象歸因於輸入文字中較高的不確定性。為了解決這個問題，提出了一種名為對比標記學習與相似性衰減 (CTSD) 的新演算法，它根據不同的注意力權重和標記間距離，動態地調節標記的抑制。此外，編制並發布了一個由線上真實商品標題文字組成的電子商務資料集，容易產生幻覺翻譯，以作為演算法的基準。廣泛的評估表明，CTSD 在精準度和概括性方面明顯優於現有方法。額外的線上 A/B 測試強調了它的實用價值，顯示出使用者參與度和轉換率的顯著提升。值得注意的是，此方法已在全球最大的 B2B 電子商務平台 alibaba.com 的八個多語言網站上全面實施。", "author": "Huangyu Dai et.al.", "authors": "Huangyu Dai, Ben Chen, Kaidi Chen, Ying Han, Zihan Liang, Wen Jiang", "id": "2409.19877v1", "paper_url": "http://arxiv.org/abs/2409.19877v1", "repo": "null"}}