{"2411.02847": {"publish_time": "2024-11-05", "title": "Dissecting the Failure of Invariant Learning on Graphs", "paper_summary": "Enhancing node-level Out-Of-Distribution (OOD) generalization on graphs\nremains a crucial area of research. In this paper, we develop a Structural\nCausal Model (SCM) to theoretically dissect the performance of two prominent\ninvariant learning methods -- Invariant Risk Minimization (IRM) and\nVariance-Risk Extrapolation (VREx) -- in node-level OOD settings. Our analysis\nreveals a critical limitation: due to the lack of class-conditional invariance\nconstraints, these methods may struggle to accurately identify the structure of\nthe predictive invariant ego-graph and consequently rely on spurious features.\nTo address this, we propose Cross-environment Intra-class Alignment (CIA),\nwhich explicitly eliminates spurious features by aligning cross-environment\nrepresentations conditioned on the same class, bypassing the need for explicit\nknowledge of the causal pattern structure. To adapt CIA to node-level OOD\nscenarios where environment labels are hard to obtain, we further propose\nCIA-LRA (Localized Reweighting Alignment) that leverages the distribution of\nneighboring labels to selectively align node representations, effectively\ndistinguishing and preserving invariant features while removing spurious ones,\nall without relying on environment labels. We theoretically prove CIA-LRA's\neffectiveness by deriving an OOD generalization error bound based on\nPAC-Bayesian analysis. Experiments on graph OOD benchmarks validate the\nsuperiority of CIA and CIA-LRA, marking a significant advancement in node-level\nOOD generalization. The codes are available at\nhttps://github.com/NOVAglow646/NeurIPS24-Invariant-Learning-on-Graphs.", "paper_summary_zh": "加強圖形上節點層級的 Out-Of-Distribution (OOD) 概化仍然是研究的重要領域。在本文中，我們開發了一個結構因果模型 (SCM) 來理論上剖析兩種突出的不變學習方法的效能，在節點層級的 OOD 設定中，這兩種方法分別為不變風險最小化 (IRM) 和變異風險外推 (VREx)。我們的分析揭露了一個關鍵的限制：由於缺乏類條件不變約束，這些方法可能難以準確地識別預測不變自我圖形的結構，因此依賴於虛假的特徵。為了解決這個問題，我們提出了跨環境類內對齊 (CIA)，它透過對齊基於相同類別的跨環境表示，明確地消除了虛假特徵，繞過了對因果模式結構的明確知識需求。為了將 CIA 適應到難以取得環境標籤的節點層級 OOD 場景，我們進一步提出了 CIA-LRA (局部重新加權對齊)，它利用鄰近標籤的分布來選擇性地對齊節點表示，有效地區分並保留不變特徵，同時移除虛假特徵，所有這些都不依賴於環境標籤。我們透過根據 PAC 貝氏分析推導出的 OOD 概化誤差界限，理論上證明了 CIA-LRA 的有效性。圖形 OOD 基準上的實驗驗證了 CIA 和 CIA-LRA 的優越性，標誌著節點層級 OOD 概化的重大進展。程式碼可於 https://github.com/NOVAglow646/NeurIPS24-Invariant-Learning-on-Graphs 取得。", "author": "Qixun Wang et.al.", "authors": "Qixun Wang, Yifei Wang, Yisen Wang, Xianghua Ying", "id": "2411.02847v1", "paper_url": "http://arxiv.org/abs/2411.02847v1", "repo": "https://github.com/novaglow646/neurips24-invariant-learning-on-graphs"}}