{"2406.18910": {"publish_time": "2024-06-27", "title": "Factor-Conditioned Speaking-Style Captioning", "paper_summary": "This paper presents a novel speaking-style captioning method that generates\ndiverse descriptions while accurately predicting speaking-style information.\nConventional learning criteria directly use original captions that contain not\nonly speaking-style factor terms but also syntax words, which disturbs learning\nspeaking-style information. To solve this problem, we introduce\nfactor-conditioned captioning (FCC), which first outputs a phrase representing\nspeaking-style factors (e.g., gender, pitch, etc.), and then generates a\ncaption to ensure the model explicitly learns speaking-style factors. We also\npropose greedy-then-sampling (GtS) decoding, which first predicts\nspeaking-style factors deterministically to guarantee semantic accuracy, and\nthen generates a caption based on factor-conditioned sampling to ensure\ndiversity. Experiments show that FCC outperforms the original caption-based\ntraining, and with GtS, it generates more diverse captions while keeping style\nprediction performance.", "paper_summary_zh": "本文提出了一種新穎的說話風格字幕方法，它能產生多樣化的描述，同時準確預測說話風格信息。\n傳統的學習標準直接使用原始字幕，其中不僅包含說話風格因子術語，還包含語法詞，這會干擾學習說話風格信息。為了解決這個問題，我們引入了因子條件字幕 (FCC)，它首先輸出一個代表說話風格因子的短語（例如，性別、音高等），然後生成一個字幕以確保模型顯式地學習說話風格因子。我們還提出了貪婪然後採樣的（GtS）解碼，它首先確定性地預測說話風格因子以保證語義準確性，然後基於因子條件採樣生成一個字幕以保證多樣性。實驗表明，FCC 優於基於原始字幕的訓練，並且使用 GtS，它會生成更多樣化的字幕，同時保持風格預測性能。", "author": "Atsushi Ando et.al.", "authors": "Atsushi Ando, Takafumi Moriya, Shota Horiguchi, Ryo Masumura", "id": "2406.18910v1", "paper_url": "http://arxiv.org/abs/2406.18910v1", "repo": "null"}}