{"2408.15496": {"publish_time": "2024-08-28", "title": "ReMamba: Equip Mamba with Effective Long-Sequence Modeling", "paper_summary": "While the Mamba architecture demonstrates superior inference efficiency and\ncompetitive performance on short-context natural language processing (NLP)\ntasks, empirical evidence suggests its capacity to comprehend long contexts is\nlimited compared to transformer-based models. In this study, we investigate the\nlong-context efficiency issues of the Mamba models and propose ReMamba, which\nenhances Mamba's ability to comprehend long contexts. ReMamba incorporates\nselective compression and adaptation techniques within a two-stage re-forward\nprocess, incurring minimal additional inference costs overhead. Experimental\nresults on the LongBench and L-Eval benchmarks demonstrate ReMamba's efficacy,\nimproving over the baselines by 3.2 and 1.6 points, respectively, and attaining\nperformance almost on par with same-size transformer models.", "paper_summary_zh": "儘管 Mamba 架構在短語境自然語言處理 (NLP) 任務上展現出優異的推論效率和競爭力，但實證證據顯示，與基於轉換器的模型相比，其理解長語境的容量有限。在這項研究中，我們探討 Mamba 模型在長語境效率上的問題，並提出 ReMamba，它增強了 Mamba 理解長語境的能力。ReMamba 在兩階段的重新前向處理中納入了選擇性壓縮和適應技術，產生最小的額外推論成本負擔。LongBench 和 L-Eval 基準上的實驗結果證明了 ReMamba 的效能，分別比基準線改進了 3.2 和 1.6 個百分點，並達到與相同大小的轉換器模型幾乎相同的效能。", "author": "Danlong Yuan et.al.", "authors": "Danlong Yuan, Jiahao Liu, Bei Li, Huishuai Zhang, Jingang Wang, Xunliang Cai, Dongyan Zhao", "id": "2408.15496v2", "paper_url": "http://arxiv.org/abs/2408.15496v2", "repo": "null"}}