{"2410.22660": {"publish_time": "2024-10-30", "title": "Linguistics Theory Meets LLM: Code-Switched Text Generation via Equivalence Constrained Large Language Models", "paper_summary": "Code-switching, the phenomenon of alternating between two or more languages\nin a single conversation, presents unique challenges for Natural Language\nProcessing (NLP). Most existing research focuses on either syntactic\nconstraints or neural generation, with few efforts to integrate linguistic\ntheory with large language models (LLMs) for generating natural code-switched\ntext. In this paper, we introduce EZSwitch, a novel framework that combines\nEquivalence Constraint Theory (ECT) with LLMs to produce linguistically valid\nand fluent code-switched text. We evaluate our method using both human\njudgments and automatic metrics, demonstrating a significant improvement in the\nquality of generated code-switching sentences compared to baseline LLMs. To\naddress the lack of suitable evaluation metrics, we conduct a comprehensive\ncorrelation study of various automatic metrics against human scores, revealing\nthat current metrics often fail to capture the nuanced fluency of code-switched\ntext. Additionally, we create CSPref, a human preference dataset based on human\nratings and analyze model performance across ``hard`` and ``easy`` examples.\nOur findings indicate that incorporating linguistic constraints into LLMs leads\nto more robust and human-aligned generation, paving the way for scalable\ncode-switching text generation across diverse language pairs.", "paper_summary_zh": "代碼轉換，在單一對話中交替使用兩種或多種語言的現象，對自然語言處理 (NLP) 構成獨特的挑戰。現有的大部分研究都專注於語法限制或神經生成，很少有研究將語言學理論與大型語言模型 (LLM) 整合起來，以生成自然的代碼轉換文本。在本文中，我們介紹 EZSwitch，一個將等價約束理論 (ECT) 與 LLM 結合起來的新框架，以產生在語言學上有效且流暢的代碼轉換文本。我們使用人類判斷和自動化指標來評估我們的模型，證明與基準 LLM 相比，生成的代碼轉換句子的品質有顯著的提升。為了解決缺乏合適評估指標的問題，我們對各種自動化指標與人類評分進行全面的相關性研究，發現當前的指標通常無法捕捉代碼轉換文本的細微流暢度。此外，我們建立了 CSPref，一個基於人類評分的偏好資料集，並分析模型在「困難」和「容易」範例的表現。我們的發現表明，將語言限制納入 LLM 會導致更強健且與人類一致的生成，為跨越不同語言對的可擴充代碼轉換文本生成鋪路。", "author": "Garry Kuwanto et.al.", "authors": "Garry Kuwanto, Chaitanya Agarwal, Genta Indra Winata, Derry Tanti Wijaya", "id": "2410.22660v1", "paper_url": "http://arxiv.org/abs/2410.22660v1", "repo": "null"}}