{"2505.02781": {"publish_time": "2025-05-05", "title": "Local Markov Equivalence and Local Causal Discovery for Identifying Controlled Direct Effects", "paper_summary": "Understanding and identifying controlled direct effects (CDEs) is crucial\nacross numerous scientific domains, including public health. While existing\nmethods can identify these effects from causal directed acyclic graphs (DAGs),\nthe true underlying structure is often unknown in practice. Essential graphs,\nwhich represent a Markov equivalence class of DAGs characterized by the same\nset of d-separations, provide a more practical and realistic alternative.\nHowever, learning the full essential graph is computationally intensive and\ntypically depends on strong, untestable assumptions. In this work, we\ncharacterize a local class of graphs, defined relative to a target variable,\nthat share a specific subset of d-separations, and introduce a graphical\nrepresentation of this class, called the local essential graph (LEG). We then\npresent LocPC, a novel algorithm designed to recover the LEG from an observed\ndistribution using only local conditional independence tests. Building on\nLocPC, we propose LocPC-CDE, an algorithm that discovers the portion of the LEG\nthat is sufficient to identify a CDE, bypassing the need of retrieving the full\nessential graph. Compared to global methods, our algorithms require less\nconditional independence tests and operate under weaker assumptions while\nmaintaining theoretical guarantees.", "paper_summary_zh": "<paragraph>了解和識別受控直接效應 (CDE) 在包括公共衛生在內的眾多科學領域至關重要。雖然現有方法可以從因果有向無環圖 (DAG) 中識別這些效應，但在實務中真正的底層結構通常是未知的。基本圖表示以同一組 d 分隔為特徵的 DAG 馬爾可夫等價類，它提供了一種更實用、更貼近現實的替代方案。然而，學習完整的基本圖需要大量的計算資源，而且通常取決於難以驗證的強假設。在這項工作中，我們描述了一類相對於目標變數定義的局部圖，它們共享 d 分隔的特定子集，並介紹了此類圖的圖形表示，稱為局部基本圖 (LEG)。然後，我們提出 LocPC，這是一種新穎的演算法，旨在僅使用局部條件獨立性檢定從觀察到的分佈中恢復 LEG。在 LocPC 的基礎上，我們提出了 LocPC-CDE 演算法，該演算法可以發現足以識別 CDE 的 LEG 部分，而無需檢索完整的基本圖。與全局方法相比，我們的演算法需要更少的條件獨立性檢定，並且在較弱的假設下運行，同時保持理論上的保證。</paragraph>\n", "author": "Timothée Loranchet et.al.", "authors": "Timothée Loranchet, Charles K. Assaad", "id": "2505.02781v1", "paper_url": "http://arxiv.org/abs/2505.02781v1", "repo": "null"}}