{"2405.15556": {"publish_time": "2024-05-24", "title": "Certifiably Robust RAG against Retrieval Corruption", "paper_summary": "Retrieval-augmented generation (RAG) has been shown vulnerable to retrieval\ncorruption attacks: an attacker can inject malicious passages into retrieval\nresults to induce inaccurate responses. In this paper, we propose RobustRAG as\nthe first defense framework against retrieval corruption attacks. The key\ninsight of RobustRAG is an isolate-then-aggregate strategy: we get LLM\nresponses from each passage in isolation and then securely aggregate these\nisolated responses. To instantiate RobustRAG, we design keyword-based and\ndecoding-based algorithms for securely aggregating unstructured text responses.\nNotably, RobustRAG can achieve certifiable robustness: we can formally prove\nand certify that, for certain queries, RobustRAG can always return accurate\nresponses, even when the attacker has full knowledge of our defense and can\narbitrarily inject a small number of malicious passages. We evaluate RobustRAG\non open-domain QA and long-form text generation datasets and demonstrate its\neffectiveness and generalizability across various tasks and datasets.", "paper_summary_zh": "檢索增強生成 (RAG) 已被證明容易受到檢索破壞攻擊：攻擊者可以將惡意段落注入檢索結果中，以誘發不準確的回應。在本文中，我們提出 RobustRAG 作為對抗檢索破壞攻擊的第一個防禦架構。RobustRAG 的關鍵見解是孤立後聚合策略：我們從每個段落中孤立地獲得 LLM 回應，然後安全地聚合這些孤立的回應。為了實例化 RobustRAG，我們設計了基於關鍵字和基於解碼的演算法，用於安全地聚合非結構化文本回應。值得注意的是，RobustRAG 可以實現可驗證的穩健性：我們可以正式證明並證明，對於某些查詢，即使攻擊者完全了解我們的防禦措施，並且可以任意注入少量惡意段落，RobustRAG 也可以始終回傳準確的回應。我們在開放領域問答和長篇文字生成資料集上評估 RobustRAG，並展示其在各種任務和資料集中的有效性和泛化能力。", "author": "Chong Xiang et.al.", "authors": "Chong Xiang, Tong Wu, Zexuan Zhong, David Wagner, Danqi Chen, Prateek Mittal", "id": "2405.15556v1", "paper_url": "http://arxiv.org/abs/2405.15556v1", "repo": "null"}}