{"2409.16950": {"publish_time": "2024-09-25", "title": "Dynamic Obstacle Avoidance through Uncertainty-Based Adaptive Planning with Diffusion", "paper_summary": "By framing reinforcement learning as a sequence modeling problem, recent work\nhas enabled the use of generative models, such as diffusion models, for\nplanning. While these models are effective in predicting long-horizon state\ntrajectories in deterministic environments, they face challenges in dynamic\nsettings with moving obstacles. Effective collision avoidance demands\ncontinuous monitoring and adaptive decision-making. While replanning at every\ntimestep could ensure safety, it introduces substantial computational overhead\ndue to the repetitive prediction of overlapping state sequences -- a process\nthat is particularly costly with diffusion models, known for their intensive\niterative sampling procedure. We propose an adaptive generative planning\napproach that dynamically adjusts replanning frequency based on the uncertainty\nof action predictions. Our method minimizes the need for frequent,\ncomputationally expensive, and redundant replanning while maintaining robust\ncollision avoidance performance. In experiments, we obtain a 13.5% increase in\nthe mean trajectory length and a 12.7% increase in mean reward over\nlong-horizon planning, indicating a reduction in collision rates and an\nimproved ability to navigate the environment safely.", "paper_summary_zh": "藉由將強化學習建構為序列建模問題，近期研究已能使用生成模型，例如擴散模型，進行規劃。儘管這些模型有效預測確定性環境中的長時程狀態軌跡，但在具有移動障礙物的動態設定中，它們面臨挑戰。有效的碰撞避免需要持續監控和適應性決策制定。儘管在每個時間步長重新規劃可以確保安全性，但由於重複預測重疊的狀態序列，因此會產生大量的運算負擔，而這種程序對於以其密集迭代採樣程序而聞名的擴散模型來說特別昂貴。我們提出了一種適應性生成規劃方法，該方法根據動作預測的不確定性動態調整重新規劃頻率。我們的模型將頻繁、運算成本高且重複的重新規劃需求降至最低，同時維持穩健的碰撞避免效能。在實驗中，我們在長期規劃中獲得平均軌跡長度增加 13.5% 和平均回報增加 12.7%，表示碰撞率降低，以及在環境中安全導航的能力提升。", "author": "Vineet Punyamoorty et.al.", "authors": "Vineet Punyamoorty, Pascal Jutras-Dubé, Ruqi Zhang, Vaneet Aggarwal, Damon Conover, Aniket Bera", "id": "2409.16950v1", "paper_url": "http://arxiv.org/abs/2409.16950v1", "repo": "null"}}