{"2407.20657": {"publish_time": "2024-07-30", "title": "Prompt-Driven Contrastive Learning for Transferable Adversarial Attacks", "paper_summary": "Recent vision-language foundation models, such as CLIP, have demonstrated\nsuperior capabilities in learning representations that can be transferable\nacross diverse range of downstream tasks and domains. With the emergence of\nsuch powerful models, it has become crucial to effectively leverage their\ncapabilities in tackling challenging vision tasks. On the other hand, only a\nfew works have focused on devising adversarial examples that transfer well to\nboth unknown domains and model architectures. In this paper, we propose a novel\ntransfer attack method called PDCL-Attack, which leverages the CLIP model to\nenhance the transferability of adversarial perturbations generated by a\ngenerative model-based attack framework. Specifically, we formulate an\neffective prompt-driven feature guidance by harnessing the semantic\nrepresentation power of text, particularly from the ground-truth class labels\nof input images. To the best of our knowledge, we are the first to introduce\nprompt learning to enhance the transferable generative attacks. Extensive\nexperiments conducted across various cross-domain and cross-model settings\nempirically validate our approach, demonstrating its superiority over\nstate-of-the-art methods.", "paper_summary_zh": "最近的视觉语言基础模型（例如 CLIP）已展示出学习表征的卓越能力，这些表征可以在各种下游任务和领域中转移。随着这些强大模型的出现，有效利用它们的能力来解决具有挑战性的视觉任务变得至关重要。另一方面，只有少数工作专注于设计对抗性示例，这些示例可以很好地转移到未知域和模型架构中。在本文中，我们提出了一种新颖的转移攻击方法，称为 PDCL-Attack，它利用 CLIP 模型来增强由生成模型攻击框架生成的对抗性扰动的可转移性。具体来说，我们通过利用文本的语义表示能力（特别是来自输入图像的真实类标签）来制定有效的提示驱动的特征指导。据我们所知，我们是第一个引入提示学习来增强可转移生成攻击的人。在各种跨域和跨模型设置中进行的广泛实验从经验上验证了我们的方法，证明了它优于最先进的方法。", "author": "Hunmin Yang et.al.", "authors": "Hunmin Yang, Jongoh Jeong, Kuk-Jin Yoon", "id": "2407.20657v1", "paper_url": "http://arxiv.org/abs/2407.20657v1", "repo": "null"}}