{"2410.11287": {"publish_time": "2024-10-15", "title": "Process Reward Model with Q-Value Rankings", "paper_summary": "Process Reward Modeling (PRM) is critical for complex reasoning and\ndecision-making tasks where the accuracy of intermediate steps significantly\ninfluences the overall outcome. Existing PRM approaches, primarily framed as\nclassification problems, employ cross-entropy loss to independently evaluate\neach step's correctness. This method can lead to suboptimal reward distribution\nand does not adequately address the interdependencies among steps. To address\nthese limitations, we introduce the Process Q-value Model (PQM), a novel\nframework that redefines PRM in the context of a Markov Decision Process. PQM\noptimizes Q-value rankings based on a novel comparative loss function,\nenhancing the model's ability to capture the intricate dynamics among\nsequential decisions. This approach provides a more granular and theoretically\ngrounded methodology for process rewards. Our extensive empirical evaluations\nacross various sampling policies, language model backbones, and multi-step\nreasoning benchmarks show that PQM outperforms classification-based PRMs. The\neffectiveness of the comparative loss function is highlighted in our\ncomprehensive ablation studies, confirming PQM's practical efficacy and\ntheoretical advantage.", "paper_summary_zh": "處理獎勵建模 (PRM) 對於複雜的推理和決策制定任務至關重要，其中間步驟的準確性會顯著影響整體結果。現有的 PRM 方法主要被視為分類問題，採用交叉熵損失來獨立評估每個步驟的正確性。此方法可能導致次優的獎勵分配，且無法充分解決步驟之間的相互依賴性。為了解決這些限制，我們引入了處理 Q 值模型 (PQM)，這是一個新的框架，在馬可夫決策過程中重新定義了 PRM。PQM 根據新的比較損失函數優化 Q 值排名，增強了模型捕捉序列決策之間複雜動態的能力。這種方法為處理獎勵提供了一個更精細且理論上更紮實的方法。我們在各種抽樣策略、語言模型主幹和多步驟推理基準上的廣泛實證評估表明，PQM 優於基於分類的 PRM。在我們的全面消融研究中突出了比較損失函數的有效性，證實了 PQM 的實用功效和理論優勢。", "author": "Wendi Li et.al.", "authors": "Wendi Li, Yixuan Li", "id": "2410.11287v1", "paper_url": "http://arxiv.org/abs/2410.11287v1", "repo": "null"}}