{"2412.20867": {"publish_time": "2024-12-30", "title": "Holistic Construction Automation with Modular Robots: From High-Level Task Specification to Execution", "paper_summary": "In situ robotic automation in construction is challenging due to constantly\nchanging environments, a shortage of robotic experts, and a lack of\nstandardized frameworks bridging robotics and construction practices. This work\nproposes a holistic framework for construction task specification, optimization\nof robot morphology, and mission execution using a mobile modular\nreconfigurable robot. Users can specify and monitor the desired robot behavior\nthrough a graphical interface. Our framework identifies an optimized robot\nmorphology and enables automatic real-world execution by integrating Building\nInformation Modelling (BIM). By leveraging modular robot components, we ensure\nseamless and fast adaption to the specific demands of the construction task.\nExperimental validation demonstrates that our approach robustly enables the\nautonomous execution of robotic drilling.", "paper_summary_zh": "由於環境不斷變化、機器人專家短缺，以及橋接機器人和施工實務的標準化框架不足，現場機器人自動化在施工中面臨挑戰。這項工作提出了一個整體框架，用於施工任務規格、機器人形態最佳化，以及使用行動模組化可重新組態機器人執行任務。使用者可以透過圖形介面指定和監控所需的機器人行為。我們的框架識別最佳化的機器人形態，並透過整合建築資訊模型 (BIM) 來實現自動的真實世界執行。藉由利用模組化機器人元件，我們確保能無縫且快速地適應施工任務的特定需求。實驗驗證證明，我們的做法能穩健地實現機器人鑽孔的自主執行。", "author": "Jonathan Külz et.al.", "authors": "Jonathan Külz, Michael Terzer, Marco Magri, Andrea Giusti, Matthias Althoff", "id": "2412.20867v1", "paper_url": "http://arxiv.org/abs/2412.20867v1", "repo": "null"}}