{"2501.13620": {"publish_time": "2025-01-23", "title": "Cognitive Paradigms for Evaluating VLMs on Visual Reasoning Task", "paper_summary": "Evaluating the reasoning capabilities of Vision-Language Models (VLMs) in\ncomplex visual tasks provides valuable insights into their potential and\nlimitations. In this work, we assess the performance of VLMs on the challenging\nBongard Openworld Problems benchmark, which involves reasoning over natural\nimages. We propose and evaluate three human-inspired paradigms: holistic\nanalysis (global context processing), deductive rule learning (explicit rule\nderivation and application), and componential analysis (structured\ndecomposition of images into components). Our results demonstrate that\nstate-of-the-art models, including GPT-4o and Gemini, not only surpass human\nbenchmarks but also excel in structured reasoning tasks, with componential\nanalysis proving especially effective. However, ablation studies reveal key\nchallenges, such as handling synthetic images, making fine-grained\ndistinctions, and interpreting nuanced contextual information. These insights\nunderscore the need for further advancements in model robustness and\ngeneralization, while highlighting the transformative potential of structured\nreasoning approaches in enhancing VLM capabilities.", "paper_summary_zh": "評估視覺語言模型 (VLM) 在複雜視覺任務中的推理能力，能提供有價值的見解，了解其潛力和限制。在這項工作中，我們評估 VLM 在具有挑戰性的 Bongard Openworld Problems 基準上的效能，其中涉及對自然影像的推理。我們提出並評估三個受人類啟發的範例：整體分析（全局脈絡處理）、演繹規則學習（明確規則推導和應用），以及組成分析（將影像結構化分解為組成部分）。我們的結果表明，包括 GPT-4o 和 Gemini 在內的最新模型不僅超越了人類基準，而且在結構化推理任務中表現出色，其中組成分析特別有效。然而，消融研究揭示了關鍵挑戰，例如處理合成影像、做出細微區分以及詮釋細微的脈絡資訊。這些見解強調了進一步提升模型穩健性和泛化的必要性，同時強調了結構化推理方法在增強 VLM 能力方面的轉化潛力。", "author": "Mohit Vaishnav et.al.", "authors": "Mohit Vaishnav, Tanel Tammet", "id": "2501.13620v1", "paper_url": "http://arxiv.org/abs/2501.13620v1", "repo": "null"}}