{"2502.02901": {"publish_time": "2025-02-05", "title": "Policy Abstraction and Nash Refinement in Tree-Exploiting PSRO", "paper_summary": "Policy Space Response Oracles (PSRO) interleaves empirical game-theoretic\nanalysis with deep reinforcement learning (DRL) to solve games too complex for\ntraditional analytic methods. Tree-exploiting PSRO (TE-PSRO) is a variant of\nthis approach that iteratively builds a coarsened empirical game model in\nextensive form using data obtained from querying a simulator that represents a\ndetailed description of the game. We make two main methodological advances to\nTE-PSRO that enhance its applicability to complex games of imperfect\ninformation. First, we introduce a scalable representation for the empirical\ngame tree where edges correspond to implicit policies learned through DRL.\nThese policies cover conditions in the underlying game abstracted in the game\nmodel, supporting sustainable growth of the tree over epochs. Second, we\nleverage extensive form in the empirical model by employing refined Nash\nequilibria to direct strategy exploration. To enable this, we give a modular\nand scalable algorithm based on generalized backward induction for computing a\nsubgame perfect equilibrium (SPE) in an imperfect-information game. We\nexperimentally evaluate our approach on a suite of games including an\nalternating-offer bargaining game with outside offers; our results demonstrate\nthat TE-PSRO converges toward equilibrium faster when new strategies are\ngenerated based on SPE rather than Nash equilibrium, and with reasonable\ntime/memory requirements for the growing empirical model.", "paper_summary_zh": "策略空間回應神諭 (PSRO) 將經驗博弈論分析與深度強化學習 (DRL) 交織在一起，以解決對於傳統分析方法過於複雜的遊戲。樹木探索 PSRO (TE-PSRO) 是此方法的一種變體，它會反覆建構一個粗糙的經驗博弈模型，其廣泛形式使用從查詢模擬器取得的資料，而該模擬器代表遊戲的詳細描述。我們對 TE-PSRO 進行兩項主要方法學進展，以增強其適用於不完美資訊的複雜遊戲。首先，我們為經驗博弈樹引入一個可擴充的表示法，其中邊緣對應於透過 DRL 學習到的隱含策略。這些策略涵蓋遊戲模型中抽象出的底層遊戲條件，支援樹木在各個時期持續成長。其次，我們透過採用精緻的納許均衡來引導策略探索，以在經驗模型中利用廣泛形式。為此，我們提供一個基於廣義後向歸納的模組化且可擴充的演算法，用於在不完美資訊遊戲中計算子博弈完美均衡 (SPE)。我們在包括具有外部報價的輪替報價議價遊戲在內的一系列遊戲中，以實驗方式評估我們的做法；我們的結果證明，當根據 SPE 而不是納許均衡產生新策略時，TE-PSRO 會更快地收斂到均衡，而且對於成長中的經驗模型而言，具有合理的時間/記憶體需求。", "author": "Christine Konicki et.al.", "authors": "Christine Konicki, Mithun Chakraborty, Michael P. Wellman", "id": "2502.02901v1", "paper_url": "http://arxiv.org/abs/2502.02901v1", "repo": "null"}}