{"2411.02611": {"publish_time": "2024-11-04", "title": "Advanced XR-Based 6-DOF Catheter Tracking System for Immersive Cardiac Intervention Training", "paper_summary": "Extended Reality (XR) technologies are gaining traction as effective tools\nfor medical training and procedural guidance, particularly in complex cardiac\ninterventions. This paper presents a novel system for real-time 3D tracking and\nvisualization of intracardiac echocardiography (ICE) catheters, with precise\nmeasurement of the roll angle. A custom 3D-printed setup, featuring orthogonal\ncameras, captures biplane video of the catheter, while a specialized computer\nvision algorithm reconstructs its 3D trajectory, localizing the tip with\nsub-millimeter accuracy and tracking the roll angle in real-time. The system's\ndata is integrated into an interactive Unity-based environment, rendered\nthrough the Meta Quest 3 XR headset, combining a dynamically tracked catheter\nwith a patient-specific 3D heart model. This immersive environment allows the\ntesting of the importance of 3D depth perception, in comparison to 2D\nprojections, as a form of visualization in XR. Our experimental study,\nconducted using the ICE catheter with six participants, suggests that 3D\nvisualization is not necessarily beneficial over 2D views offered by the XR\nsystem; although all cardiologists saw its utility for pre-operative training,\nplanning, and intra-operative guidance. The proposed system qualitatively shows\ngreat promise in transforming catheter-based interventions, particularly ICE\nprocedures, by improving visualization, interactivity, and skill development.", "paper_summary_zh": "擴增實境 (XR) 技術正作為醫療訓練和程序指導的有效工具而獲得重視，特別是在複雜的心臟介入治療中。本文提出了一個新的系統，用於實時 3D 追蹤和可視化心內超聲心動圖 (ICE) 導管，並精確測量滾動角度。一個客製化的 3D 列印設定，配備正交相機，捕捉導管的雙平面影片，而一個專門的電腦視覺演算法重建其 3D 軌跡，以小於毫米的精確度定位尖端並即時追蹤滾動角度。系統的資料整合到一個互動式的 Unity 為基礎的環境中，透過 Meta Quest 3 XR 頭戴式裝置呈現，結合動態追蹤的導管和特定病患的 3D 心臟模型。這個沈浸式的環境允許測試 3D 深度感知的重要性，與 2D 投影相比，作為 XR 中的一種視覺化形式。我們的實驗研究，使用 ICE 導管進行，有六位參與者，顯示 3D 視覺化不一定比 XR 系統提供的 2D 視圖有益；儘管所有心臟科醫師都看到它在術前訓練、規劃和術中指導中的用途。所提出的系統在質化上顯示出在轉換導管介入治療，特別是 ICE 程序方面，透過改善視覺化、互動性和技能發展，具有很大的前景。", "author": "Mohsen Annabestani et.al.", "authors": "Mohsen Annabestani, Sandhya Sriram, S. Chiu Wong, Alexandros Sigaras, Bobak Mosadegh", "id": "2411.02611v1", "paper_url": "http://arxiv.org/abs/2411.02611v1", "repo": "null"}}