{"2501.05453": {"publish_time": "2025-01-09", "title": "An Empirical Study of Autoregressive Pre-training from Videos", "paper_summary": "We empirically study autoregressive pre-training from videos. To perform our\nstudy, we construct a series of autoregressive video models, called Toto. We\ntreat videos as sequences of visual tokens and train transformer models to\nautoregressively predict future tokens. Our models are pre-trained on a diverse\ndataset of videos and images comprising over 1 trillion visual tokens. We\nexplore different architectural, training, and inference design choices. We\nevaluate the learned visual representations on a range of downstream tasks\nincluding image recognition, video classification, object tracking, and\nrobotics. Our results demonstrate that, despite minimal inductive biases,\nautoregressive pre-training leads to competitive performance across all\nbenchmarks. Finally, we find that scaling our video models results in similar\nscaling curves to those seen in language models, albeit with a different rate.\nMore details at https://brjathu.github.io/toto/", "paper_summary_zh": "我們實證研究影片的回歸前訓練。為了執行我們的研究，我們建構了一系列回歸影片模型，稱為 Toto。我們將影片視為視覺符號序列，並訓練Transformer模型以回歸預測未來符號。我們的模型在超過 1 兆個視覺符號的多元影片和影像資料集上進行預訓練。我們探索不同的架構、訓練和推論設計選項。我們在各種下游任務上評估學習到的視覺表徵，包括影像辨識、影片分類、物件追蹤和機器人技術。我們的結果證明，儘管歸納偏誤最少，回歸前訓練仍能讓所有基準測試的效能具有競爭力。最後，我們發現擴充我們的影片模型會產生與語言模型中看到的類似擴充曲線，儘管速率不同。更多詳情請參閱 https://brjathu.github.io/toto/", "author": "Jathushan Rajasegaran et.al.", "authors": "Jathushan Rajasegaran, Ilija Radosavovic, Rahul Ravishankar, Yossi Gandelsman, Christoph Feichtenhofer, Jitendra Malik", "id": "2501.05453v1", "paper_url": "http://arxiv.org/abs/2501.05453v1", "repo": "null"}}