{"2407.06004": {"publish_time": "2024-07-08", "title": "Perceptions to Beliefs: Exploring Precursory Inferences for Theory of Mind in Large Language Models", "paper_summary": "While humans naturally develop theory of mind (ToM), the capability to\nunderstand other people's mental states and beliefs, state-of-the-art large\nlanguage models (LLMs) underperform on simple ToM benchmarks. We posit that we\ncan extend our understanding of LLMs' ToM abilities by evaluating key human ToM\nprecursors -- perception inference and perception-to-belief inference -- in\nLLMs. We introduce two datasets, Percept-ToMi and Percept-FANToM, to evaluate\nthese precursory inferences for ToM in LLMs by annotating characters'\nperceptions on ToMi and FANToM, respectively. Our evaluation of eight\nstate-of-the-art LLMs reveals that the models generally perform well in\nperception inference while exhibiting limited capability in\nperception-to-belief inference (e.g., lack of inhibitory control). Based on\nthese results, we present PercepToM, a novel ToM method leveraging LLMs' strong\nperception inference capability while supplementing their limited\nperception-to-belief inference. Experimental results demonstrate that PercepToM\nsignificantly enhances LLM's performance, especially in false belief scenarios.", "paper_summary_zh": "人類自然而然地發展心智理論 (ToM)，也就是理解他人心智狀態和信念的能力，但最先進的大型語言模型 (LLM) 在簡單的 ToM 基準測試中表現不佳。我們假設，我們可以透過評估人類 ToM 的關鍵前導因素（感知推論和感知到信念的推論）來擴展我們對 LLM 的 ToM 能力的理解。我們引入了兩個資料集，分別是 Percept-ToMi 和 Percept-FANToM，以透過在 ToMi 和 FANToM 上標註角色的感知來評估 LLM 中這些前導推論。我們對八個最先進的 LLM 進行評估，結果顯示這些模型在感知推論方面表現良好，但在感知到信念的推論方面能力有限（例如缺乏抑制控制）。根據這些結果，我們提出了 PercepToM，這是一種新穎的 ToM 方法，它利用 LLM 強大的感知推論能力，同時補充其有限的感知到信念的推論。實驗結果表明，PercepToM 大幅提升了 LLM 的效能，特別是在錯誤信念的場景中。", "author": "Chani Jung et.al.", "authors": "Chani Jung, Dongkwan Kim, Jiho Jin, Jiseon Kim, Yeon Seonwoo, Yejin Choi, Alice Oh, Hyunwoo Kim", "id": "2407.06004v1", "paper_url": "http://arxiv.org/abs/2407.06004v1", "repo": "null"}}