{"2412.16373": {"publish_time": "2024-12-20", "title": "FairREAD: Re-fusing Demographic Attributes after Disentanglement for Fair Medical Image Classification", "paper_summary": "Recent advancements in deep learning have shown transformative potential in\nmedical imaging, yet concerns about fairness persist due to performance\ndisparities across demographic subgroups. Existing methods aim to address these\nbiases by mitigating sensitive attributes in image data; however, these\nattributes often carry clinically relevant information, and their removal can\ncompromise model performance-a highly undesirable outcome. To address this\nchallenge, we propose Fair Re-fusion After Disentanglement (FairREAD), a novel,\nsimple, and efficient framework that mitigates unfairness by re-integrating\nsensitive demographic attributes into fair image representations. FairREAD\nemploys orthogonality constraints and adversarial training to disentangle\ndemographic information while using a controlled re-fusion mechanism to\npreserve clinically relevant details. Additionally, subgroup-specific threshold\nadjustments ensure equitable performance across demographic groups.\nComprehensive evaluations on a large-scale clinical X-ray dataset demonstrate\nthat FairREAD significantly reduces unfairness metrics while maintaining\ndiagnostic accuracy, establishing a new benchmark for fairness and performance\nin medical image classification.", "paper_summary_zh": "深度學習的最新進展已在醫學影像中展現出變革的潛力，但由於不同人口子群體間的效能差異，公平性的疑慮仍然存在。現有方法旨在通過減輕影像資料中的敏感屬性來解決這些偏差；然而，這些屬性通常包含臨床相關資訊，而移除它們可能會損害模型效能，這是一個非常不理想的結果。為了應對這個挑戰，我們提出公平解糾後重新融合 (FairREAD)，這是一個新穎、簡單且高效的架構，它透過將敏感的人口統計屬性重新整合到公平的影像表示中，來減輕不公平性。FairREAD 使用正交約束和對抗訓練來解開人口統計資訊，同時使用受控重新融合機制來保留臨床相關的細節。此外，特定子群的閾值調整可確保不同人口群體之間的效能公平。在大型臨床 X 光資料集上的全面評估證明，FairREAD 在維持診斷準確性的同時，顯著降低了不公平性指標，為醫學影像分類中的公平性和效能建立了新的基準。", "author": "Yicheng Gao et.al.", "authors": "Yicheng Gao, Jinkui Hao, Bo Zhou", "id": "2412.16373v1", "paper_url": "http://arxiv.org/abs/2412.16373v1", "repo": "null"}}