{"2502.09120": {"publish_time": "2025-02-13", "title": "The influence of visual and linguistic cues on ignorance inference in Vision-Language Models (VLMs)", "paper_summary": "This study explored how Vision-Language Models (VLMs) process ignorance\nimplicatures with visual and linguistic cues. Particularly, we focused on the\neffects of contexts (precise and approximate contexts) and modifier types (bare\nnumerals, superlative, and comparative modifiers), which were considered\npragmatic and semantic factors respectively. Methodologically, we conducted a\ntruth-value judgment task in visually grounded settings using GPT-4o and Gemini\n1.5 Pro. The results indicate that while both models exhibited sensitivity to\nlinguistic cues (modifier), they failed to process ignorance implicatures with\nvisual cues (context) as humans do. Specifically, the influence of context was\nweaker and inconsistent across models, indicating challenges in pragmatic\nreasoning for VLMs. On the other hand, superlative modifiers were more strongly\nassociated with ignorance implicatures as compared to comparative modifiers,\nsupporting the semantic view. These findings highlight the need for further\nadvancements in VLMs to process language-vision information in a\ncontext-dependent way to achieve human-like pragmatic inference.", "paper_summary_zh": "本研究探討了視覺語言模型 (VLM) 如何處理視覺和語言線索中的無知含義。特別是，我們專注於語境（精確和近似語境）和修飾語類型（裸數字、最高級和比較級修飾語）的影響，這些分別被視為語用和語義因素。在方法論上，我們使用 GPT-4o 和 Gemini 1.5 Pro 在視覺基礎設置中進行了真值判斷任務。結果表明，儘管這兩個模型都對語言線索（修飾語）表現出敏感性，但它們未能像人類那樣處理帶有視覺線索（語境）的無知含義。具體來說，語境的影響在各個模型中較弱且不一致，表明 VLM 在語用推理方面存在挑戰。另一方面，與比較級修飾語相比，最高級修飾語與無知含義的關聯性更強，這支持了語義觀點。這些發現強調了 VLM 進一步發展的必要性，以以語境依賴的方式處理語言視覺信息，以實現類人語用推理。", "author": "Ye-eun Cho et.al.", "authors": "Ye-eun Cho, Yunho Maeng", "id": "2502.09120v1", "paper_url": "http://arxiv.org/abs/2502.09120v1", "repo": "null"}}