{"2410.08942": {"publish_time": "2024-10-11", "title": "Maximizing the Potential of Synthetic Data: Insights from Random Matrix Theory", "paper_summary": "Synthetic data has gained attention for training large language models, but\npoor-quality data can harm performance (see, e.g., Shumailov et al. (2023);\nSeddik et al. (2024)). A potential solution is data pruning, which retains only\nhigh-quality data based on a score function (human or machine feedback).\nPrevious work Feng et al. (2024) analyzed models trained on synthetic data as\nsample size increases. We extend this by using random matrix theory to derive\nthe performance of a binary classifier trained on a mix of real and pruned\nsynthetic data in a high dimensional setting. Our findings identify conditions\nwhere synthetic data could improve performance, focusing on the quality of the\ngenerative model and verification strategy. We also show a smooth phase\ntransition in synthetic label noise, contrasting with prior sharp behavior in\ninfinite sample limits. Experiments with toy models and large language models\nvalidate our theoretical results.", "paper_summary_zh": "合成資料已在訓練大型語言模型中受到關注，但品質不佳的資料可能會損害效能（例如，請參閱 Shumailov 等人 (2023)；Seddik 等人 (2024)）。資料修剪是一種潛在的解決方案，它僅根據評分函數（人工或機器回饋）保留高品質資料。先前的工作 Feng 等人 (2024) 分析了在合成資料上訓練的模型，因為樣本大小會增加。我們透過使用隨機矩陣理論來延伸這一點，以推導在高維度設定中，針對真實資料和修剪合成資料組合訓練的二元分類器的效能。我們的發現找出合成資料可以改善效能的條件，專注於生成模型和驗證策略的品質。我們也展示合成標籤雜訊中的平滑相位轉換，與無限樣本限制中的先前尖銳行為形成對比。使用玩具模型和大型語言模型的實驗驗證了我們的理論結果。", "author": "Aymane El Firdoussi et.al.", "authors": "Aymane El Firdoussi, Mohamed El Amine Seddik, Soufiane Hayou, Reda Alami, Ahmed Alzubaidi, Hakim Hacid", "id": "2410.08942v1", "paper_url": "http://arxiv.org/abs/2410.08942v1", "repo": "null"}}