{"2501.09291": {"publish_time": "2025-01-16", "title": "LAVCap: LLM-based Audio-Visual Captioning using Optimal Transport", "paper_summary": "Automated audio captioning is a task that generates textual descriptions for\naudio content, and recent studies have explored using visual information to\nenhance captioning quality. However, current methods often fail to effectively\nfuse audio and visual data, missing important semantic cues from each modality.\nTo address this, we introduce LAVCap, a large language model (LLM)-based\naudio-visual captioning framework that effectively integrates visual\ninformation with audio to improve audio captioning performance. LAVCap employs\nan optimal transport-based alignment loss to bridge the modality gap between\naudio and visual features, enabling more effective semantic extraction.\nAdditionally, we propose an optimal transport attention module that enhances\naudio-visual fusion using an optimal transport assignment map. Combined with\nthe optimal training strategy, experimental results demonstrate that each\ncomponent of our framework is effective. LAVCap outperforms existing\nstate-of-the-art methods on the AudioCaps dataset, without relying on large\ndatasets or post-processing. Code is available at\nhttps://github.com/NAVER-INTEL-Co-Lab/gaudi-lavcap.", "paper_summary_zh": "自動化音訊字幕製作是一種為音訊內容產生文字描述的任務，而最近的研究已探討使用視覺資訊來提升字幕品質。然而，目前的技術通常無法有效融合音訊和視覺資料，錯失了各個方式的重要語意提示。為了解決這個問題，我們引入了 LAVCap，一個大型語言模型 (LLM) 為基礎的音訊視覺字幕製作架構，它有效地將視覺資訊與音訊整合，以提升音訊字幕製作的表現。LAVCap 採用基於最優傳輸的對齊損失來橋接音訊和視覺特徵之間的方式差距，進而實現更有效的語意萃取。此外，我們提出了一個最優傳輸注意力模組，它使用最優傳輸分配圖來提升音訊視覺融合。結合最優訓練策略，實驗結果證明了我們架構的各個組成部分都十分有效。LAVCap 在 AudioCaps 資料集上優於現有的最先進技術，而且並未依賴大型資料集或後處理。程式碼可於 https://github.com/NAVER-INTEL-Co-Lab/gaudi-lavcap 取得。", "author": "Kyeongha Rho et.al.", "authors": "Kyeongha Rho, Hyeongkeun Lee, Valentio Iverson, Joon Son Chung", "id": "2501.09291v1", "paper_url": "http://arxiv.org/abs/2501.09291v1", "repo": "https://github.com/naver-intel-co-lab/gaudi-lavcap"}}