{"2407.13999": {"publish_time": "2024-07-19", "title": "NeLLCom-X: A Comprehensive Neural-Agent Framework to Simulate Language Learning and Group Communication", "paper_summary": "Recent advances in computational linguistics include simulating the emergence\nof human-like languages with interacting neural network agents, starting from\nsets of random symbols. The recently introduced NeLLCom framework (Lian et al.,\n2023) allows agents to first learn an artificial language and then use it to\ncommunicate, with the aim of studying the emergence of specific linguistics\nproperties. We extend this framework (NeLLCom-X) by introducing more realistic\nrole-alternating agents and group communication in order to investigate the\ninterplay between language learnability, communication pressures, and group\nsize effects. We validate NeLLCom-X by replicating key findings from prior\nresearch simulating the emergence of a word-order/case-marking trade-off. Next,\nwe investigate how interaction affects linguistic convergence and emergence of\nthe trade-off. The novel framework facilitates future simulations of diverse\nlinguistic aspects, emphasizing the importance of interaction and group\ndynamics in language evolution.", "paper_summary_zh": "最近在計算語言學上的進展包括模擬人類語言的出現，其中互動的神經網路代理從一組隨機符號開始。最近推出的 NeLLCom 框架（Lian 等人，2023 年）允許代理先學習一種人造語言，然後使用它來溝通，目的是研究特定語言學特性的出現。我們通過引入更逼真的角色交替代理和群組溝通來擴充這個框架（NeLLCom-X），以研究語言可學習性、溝通壓力和群組規模效應之間的交互作用。我們透過複製先前研究的關鍵發現，模擬詞序/格標記權衡的出現來驗證 NeLLCom-X。接下來，我們研究互動如何影響語言融合和權衡的出現。這個新穎的框架有助於未來模擬各種語言面向，強調互動和群組動態在語言演化中的重要性。", "author": "Yuchen Lian et.al.", "authors": "Yuchen Lian, Tessa Verhoef, Arianna Bisazza", "id": "2407.13999v1", "paper_url": "http://arxiv.org/abs/2407.13999v1", "repo": "null"}}