{"2405.05688": {"publish_time": "2024-05-09", "title": "Evaluating Dialect Robustness of Language Models via Conversation Understanding", "paper_summary": "With an evergrowing number of LLMs reporting superlative performance for\nEnglish, their ability to perform equitably for different dialects of English\n(i.e., dialect robustness) needs to be ascertained. Specifically, we use\nEnglish language (US English or Indian English) conversations between humans\nwho play the word-guessing game of `taboo'. We formulate two evaluative tasks:\ntarget word prediction (TWP) (i.e.predict the masked target word in a\nconversation) and target word selection (TWS) (i.e., select the most likely\nmasked target word in a conversation, from among a set of candidate words).\nExtending MD3, an existing dialectic dataset of taboo-playing conversations, we\nintroduce M-MD3, a target-word-masked version of MD3 with the USEng and IndEng\nsubsets. We add two subsets: AITrans (where dialectic information is removed\nfrom IndEng) and AIGen (where LLMs are prompted to generate conversations). Our\nevaluation uses pre-trained and fine-tuned versions of two closed-source\n(GPT-4/3.5) and two open-source LLMs (Mistral and Gemma). LLMs perform\nsignificantly better for US English than Indian English for both TWP and TWS,\nfor all settings. While GPT-based models perform the best, the comparatively\nsmaller models work more equitably for short conversations (<8 turns). Our\nresults on AIGen and AITrans (the best and worst-performing subset)\nrespectively show that LLMs may learn a dialect of their own based on the\ncomposition of the training data, and that dialect robustness is indeed a\nchallenging task. Our evaluation methodology exhibits a novel way to examine\nattributes of language models using pre-existing dialogue datasets.", "paper_summary_zh": "隨著越來越多的 LLM 報告英語的卓越效能，需要確定它們對不同英語方言（即方言穩健性）執行公平的效能。具體來說，我們使用英語（美國英語或印度英語）對話，對話者是玩「禁忌」文字猜謎遊戲的人類。我們制定了兩個評估任務：目標詞彙預測（TWP）（即預測對話中被遮蓋的目標詞彙）和目標詞彙選擇（TWS）（即從一組候選詞彙中選擇對話中最可能的被遮蓋目標詞彙）。擴展 MD3，一個現有的禁忌對話方言數據集，我們引入了 M-MD3，一個目標詞彙遮蓋版本的 MD3，包含 USEng 和 IndEng 子集。我們增加了兩個子集：AITrans（從 IndEng 中移除了方言資訊）和 AIGen（提示 LLM 產生對話）。我們的評估使用預先訓練和微調的兩個閉源（GPT-4/3.5）和兩個開源 LLM（Mistral 和 Gemma）。對於 TWP 和 TWS，在所有設定中，LLM 對美國英語的表現明顯優於印度英語。雖然基於 GPT 的模型表現最佳，但較小的模型在較短的對話（<8 回合）中表現得更公平。我們對 AIGen 和 AITrans（表現最佳和最差的子集）的結果分別顯示，LLM 可能根據訓練資料的組成學習自己的方言，並且方言穩健性確實是一項具有挑戰性的任務。我們的評估方法展示了一種使用現有對話數據集檢查語言模型屬性的新方法。", "author": "Dipankar Srirag et.al.", "authors": "Dipankar Srirag, Aditya Joshi", "id": "2405.05688v1", "paper_url": "http://arxiv.org/abs/2405.05688v1", "repo": "null"}}