{"2408.15518": {"publish_time": "2024-08-28", "title": "Dolphin: Long Context as a New Modality for Energy-Efficient On-Device Language Models", "paper_summary": "This paper presents Dolphin, a novel decoder-decoder architecture for\nenergy-efficient processing of long contexts in language models. Our approach\naddresses the significant energy consumption and latency challenges inherent in\non-device models. Dolphin employs a compact 0.5B parameter decoder to distill\nextensive contextual information into a memory embedding, substantially\nreducing the input length for the primary 7B parameter decoder model. Inspired\nby vision-language models, we repurpose the image embedding projector to encode\nlong textual contexts, effectively treating extended context as a distinct\nmodality. This innovative method enables processing of substantially longer\ncontexts without the typical computational overhead associated with extended\ninput sequences. Empirical evaluations demonstrate a 10-fold improvement in\nenergy efficiency and a 5-fold reduction in latency compared to conventional\nfull-length context processing methods without losing quality of the response.\nOur work contributes to the development of more sustainable and scalable\nlanguage models for on-device applications, addressing the critical need for\nenergy-efficient and responsive AI technologies in resource-constrained\nenvironments while maintaining the accuracy to understand long contexts. This\nresearch has implications for the broader field of natural language processing,\nparticularly in the domain of efficient model design for resource-limited\nsettings. By enabling more sophisticated AI capabilities on edge devices,\nDolphin paves the way for advanced language processing in a wide range of\napplications where computational resources are at a premium. The Dolphin model\nis publicly available at https://huggingface.co/NexaAIDev/Dolphin.", "paper_summary_zh": "這篇論文提出 Dolphin，一種新穎的解碼器-解碼器架構，用於語言模型中長文本的節能處理。我們的做法解決了設備模型中固有的顯著能耗和延遲挑戰。Dolphin 採用緊湊的 0.5B 參數解碼器，將廣泛的上下文資訊提煉到記憶體嵌入中，大幅減少主要 7B 參數解碼器模型的輸入長度。受到視覺語言模型的啟發，我們重新利用影像嵌入投影器來編碼長文本上下文，有效地將擴充的上下文視為一種不同的模態。這種創新的方法可以在不產生擴充輸入序列通常會有的運算負擔下，處理大幅更長的上下文。經驗評估證明，與傳統的全長度上下文處理方法相比，能效提升了 10 倍，延遲減少了 5 倍，同時不損失回應品質。我們的研究有助於開發更永續且可擴充的設備應用語言模型，滿足資源受限環境中對節能且有反應的 AI 技術的關鍵需求，同時維持理解長文本的準確度。這項研究對自然語言處理的廣泛領域有影響，特別是在資源有限的設定中高效模型設計的領域。透過在邊緣裝置上啟用更精密的 AI 功能，Dolphin 為廣泛的應用中進階的語言處理鋪路，在這些應用中運算資源非常珍貴。Dolphin 模型已在 https://huggingface.co/NexaAIDev/Dolphin 公開。", "author": "Wei Chen et.al.", "authors": "Wei Chen, Zhiyuan Li, Shuo Xin, Yihao Wang", "id": "2408.15518v1", "paper_url": "http://arxiv.org/abs/2408.15518v1", "repo": "null"}}