{"2409.20054": {"publish_time": "2024-09-30", "title": "Evaluating and explaining training strategies for zero-shot cross-lingual news sentiment analysis", "paper_summary": "We investigate zero-shot cross-lingual news sentiment detection, aiming to\ndevelop robust sentiment classifiers that can be deployed across multiple\nlanguages without target-language training data. We introduce novel evaluation\ndatasets in several less-resourced languages, and experiment with a range of\napproaches including the use of machine translation; in-context learning with\nlarge language models; and various intermediate training regimes including a\nnovel task objective, POA, that leverages paragraph-level information. Our\nresults demonstrate significant improvements over the state of the art, with\nin-context learning generally giving the best performance, but with the novel\nPOA approach giving a competitive alternative with much lower computational\noverhead. We also show that language similarity is not in itself sufficient for\npredicting the success of cross-lingual transfer, but that similarity in\nsemantic content and structure can be equally important.", "paper_summary_zh": "我們研究零次學習跨語言新聞情緒偵測，目標是開發強健的情緒分類器，可以在沒有目標語言訓練資料的情況下部署到多種語言中。我們在幾種資源較少的語言中引入了新穎的評估資料集，並嘗試了一系列的方法，包括使用機器翻譯；使用大型語言模型進行情境學習；以及各種中間訓練制度，包括利用段落層級資訊的新穎任務目標 POA。我們的結果證明了與現有技術相比有顯著的改進，其中情境學習通常能提供最佳效能，但新穎的 POA 方法提供了具有較低運算成本的競爭替代方案。我們還表明，語言相似性本身不足以預測跨語言轉移的成功，但語義內容和結構的相似性可能同樣重要。", "author": "Luka Andrenšek et.al.", "authors": "Luka Andrenšek, Boshko Koloski, Andraž Pelicon, Nada Lavrač, Senja Pollak, Matthew Purver", "id": "2409.20054v1", "paper_url": "http://arxiv.org/abs/2409.20054v1", "repo": "null"}}