{"2410.20309": {"publish_time": "2024-10-27", "title": "Enhancing Community Vision Screening -- AI Driven Retinal Photography for Early Disease Detection and Patient Trust", "paper_summary": "Community vision screening plays a crucial role in identifying individuals\nwith vision loss and preventing avoidable blindness, particularly in rural\ncommunities where access to eye care services is limited. Currently, there is a\npressing need for a simple and efficient process to screen and refer\nindividuals with significant eye disease-related vision loss to tertiary eye\ncare centers for further care. An ideal solution should seamlessly and readily\nintegrate with existing workflows, providing comprehensive initial screening\nresults to service providers, thereby enabling precise patient referrals for\ntimely treatment. This paper introduces the Enhancing Community Vision\nScreening (ECVS) solution, which addresses the aforementioned concerns with a\nnovel and feasible solution based on simple, non-invasive retinal photography\nfor the detection of pathology-based visual impairment. Our study employs four\ndistinct deep learning models: RETinal photo Quality Assessment (RETQA),\nPathology Visual Impairment detection (PVI), Eye Disease Diagnosis (EDD) and\nVisualization of Lesion Regions of the eye (VLR). We conducted experiments on\nover 10 datasets, totaling more than 80,000 fundus photos collected from\nvarious sources. The models integrated into ECVS achieved impressive AUC scores\nof 0.98 for RETQA, 0.95 for PVI, and 0.90 for EDD, along with a DICE\ncoefficient of 0.48 for VLR. These results underscore the promising\ncapabilities of ECVS as a straightforward and scalable method for\ncommunity-based vision screening.", "paper_summary_zh": "社區視力篩檢在辨識視力受損的個人以及預防可避免的失明方面扮演著至關重要的角色，特別是在取得眼科保健服務受限的鄉村社區中。目前，迫切需要一個簡單且有效率的流程來篩選和轉介具有顯著眼疾相關視力受損的個人至三級眼科保健中心以接受進一步的照護。理想的解決方案應與現有的工作流程無縫且輕易地整合，提供全面的初步篩檢結果給服務提供者，進而能精確地轉介患者以獲得及時的治療。本文介紹了增強社區視力篩檢 (ECVS) 解決方案，該方案透過一種新穎且可行的解決方案來解決上述問題，這個解決方案是基於簡單、非侵入性的視網膜攝影來偵測病理性的視力受損。我們的研究採用四種不同的深度學習模型：視網膜照片品質評估 (RETQA)、病理性視力受損偵測 (PVI)、眼疾診斷 (EDD) 和眼睛病灶區域視覺化 (VLR)。我們在超過 10 個資料集上進行實驗，總計超過 80,000 張從各種來源收集而來的眼底照片。整合到 ECVS 的模型達到了令人印象深刻的 AUC 分數，RETQA 為 0.98、PVI 為 0.95、EDD 為 0.90，以及 VLR 的 DICE 係數為 0.48。這些結果強調了 ECVS 作為一種用於社區視力篩檢的直接且可擴充方法的潛力。", "author": "Xiaofeng Lei et.al.", "authors": "Xiaofeng Lei, Yih-Chung Tham, Jocelyn Hui Lin Goh, Yangqin Feng, Yang Bai, Zhi Da Soh, Rick Siow Mong Goh, Xinxing Xu, Yong Liu, Ching-Yu Cheng", "id": "2410.20309v1", "paper_url": "http://arxiv.org/abs/2410.20309v1", "repo": "null"}}