{"2405.04434": {"publish_time": "2024-05-07", "title": "DeepSeek-V2: A Strong, Economical, and Efficient Mixture-of-Experts Language Model", "paper_summary": "We present DeepSeek-V2, a strong Mixture-of-Experts (MoE) language model\ncharacterized by economical training and efficient inference. It comprises 236B\ntotal parameters, of which 21B are activated for each token, and supports a\ncontext length of 128K tokens. DeepSeek-V2 adopts innovative architectures\nincluding Multi-head Latent Attention (MLA) and DeepSeekMoE. MLA guarantees\nefficient inference through significantly compressing the Key-Value (KV) cache\ninto a latent vector, while DeepSeekMoE enables training strong models at an\neconomical cost through sparse computation. Compared with DeepSeek 67B,\nDeepSeek-V2 achieves significantly stronger performance, and meanwhile saves\n42.5% of training costs, reduces the KV cache by 93.3%, and boosts the maximum\ngeneration throughput to 5.76 times. We pretrain DeepSeek-V2 on a high-quality\nand multi-source corpus consisting of 8.1T tokens, and further perform\nSupervised Fine-Tuning (SFT) and Reinforcement Learning (RL) to fully unlock\nits potential. Evaluation results show that, even with only 21B activated\nparameters, DeepSeek-V2 and its chat versions still achieve top-tier\nperformance among open-source models. The model checkpoints are available at\n\"https://github.com/deepseek-ai/DeepSeek-V2\".", "paper_summary_zh": "我們提出 DeepSeek-V2，一種強大的混合專家 (MoE) 語言模型，其特點是經濟訓練和高效推論。它包含 236B 個總參數，其中 21B 個被激活用於每個符號，並支援 128K 個符號的上下文長度。DeepSeek-V2 採用創新的架構，包括多頭潛在注意力 (MLA) 和 DeepSeekMoE。MLA 透過將鍵值 (KV) 快取大幅壓縮到潛在向量中，來保證高效推論，而 DeepSeekMoE 透過稀疏計算，以經濟成本訓練強大的模型。與 DeepSeek 67B 相比，DeepSeek-V2 達到了顯著更強的效能，同時節省了 42.5% 的訓練成本，將 KV 快取減少了 93.3%，並將最大生成量提升至 5.76 倍。我們在一個由 8.1T 個符號組成的高品質和多來源語料庫上預訓練 DeepSeek-V2，並進一步執行監督微調 (SFT) 和強化學習 (RL) 以充分發揮其潛力。評估結果顯示，即使只有 21B 個已啟用的參數，DeepSeek-V2 及其聊天版本仍可在開源模型中達到頂級效能。模型檢查點可在「https://github.com/deepseek-ai/DeepSeek-V2」取得。", "author": "DeepSeek-AI et.al.", "authors": "DeepSeek-AI", "id": "2405.04434v1", "paper_url": "http://arxiv.org/abs/2405.04434v1", "repo": "https://github.com/deepseek-ai/deepseek-v2"}}