{"2410.10392": {"publish_time": "2024-10-14", "title": "Optimizing Instruction Synthesis: Effective Exploration of Evolutionary Space with Tree Search", "paper_summary": "Instruction tuning is a crucial technique for aligning language models with\nhumans' actual goals in the real world. Extensive research has highlighted the\nquality of instruction data is essential for the success of this alignment.\nHowever, creating high-quality data manually is labor-intensive and\ntime-consuming, which leads researchers to explore using LLMs to synthesize\ndata. Recent studies have focused on using a stronger LLM to iteratively\nenhance existing instruction data, showing promising results. Nevertheless,\nprevious work often lacks control over the evolution direction, resulting in\nhigh uncertainty in the data synthesis process and low-quality instructions. In\nthis paper, we introduce a general and scalable framework, IDEA-MCTS\n(Instruction Data Enhancement using Monte Carlo Tree Search), a scalable\nframework for efficiently synthesizing instructions. With tree search and\nevaluation models, it can efficiently guide each instruction to evolve into a\nhigh-quality form, aiding in instruction fine-tuning. Experimental results show\nthat IDEA-MCTS significantly enhances the seed instruction data, raising the\naverage evaluation scores of quality, diversity, and complexity from 2.19 to\n3.81. Furthermore, in open-domain benchmarks, experimental results show that\nIDEA-MCTS improves the accuracy of real-world instruction-following skills in\nLLMs by an average of 5\\% in low-resource settings.", "paper_summary_zh": "指令調整是讓語言模型與人類在現實世界中的實際目標保持一致的關鍵技術。廣泛的研究強調了指令數據的品質對於此調整的成功至關重要。然而，手動建立高品質的數據需要大量人力且耗時，這促使研究人員探索使用大型語言模型 (LLM) 來合成數據。最近的研究專注於使用一個更強大的 LLM 來反覆增強現有的指令數據，並顯示出有希望的結果。儘管如此，先前的研究通常缺乏對演化方向的控制，導致數據合成過程的不確定性高且指令品質低。在本文中，我們介紹了一個通用且可擴充的架構 IDEA-MCTS（使用蒙地卡羅樹搜尋的指令數據增強），一個用於有效合成指令的可擴充架構。透過樹狀搜尋和評估模型，它可以有效引導每個指令演化為高品質的形式，有助於指令微調。實驗結果顯示 IDEA-MCTS 大幅增強了種子指令數據，將品質、多樣性和複雜性的平均評分從 2.19 提升至 3.81。此外，在開放領域基準測試中，實驗結果顯示 IDEA-MCTS 在低資源設定中將 LLM 中實際指令遵循技能的準確度平均提高了 5%。", "author": "Chenglin Li et.al.", "authors": "Chenglin Li, Qianglong Chen, Zhi Li, Feng Tao, Yicheng Li, Hao Chen, Fei Yu, Yin Zhang", "id": "2410.10392v1", "paper_url": "http://arxiv.org/abs/2410.10392v1", "repo": "null"}}