{"2405.08238": {"publish_time": "2024-05-13", "title": "Silver-Tongued and Sundry: Exploring Intersectional Pronouns with ChatGPT", "paper_summary": "ChatGPT is a conversational agent built on a large language model. Trained on\na significant portion of human output, ChatGPT can mimic people to a degree. As\nsuch, we need to consider what social identities ChatGPT simulates (or can be\ndesigned to simulate). In this study, we explored the case of identity\nsimulation through Japanese first-person pronouns, which are tightly connected\nto social identities in intersectional ways, i.e., intersectional pronouns. We\nconducted a controlled online experiment where people from two regions in Japan\n(Kanto and Kinki) witnessed interactions with ChatGPT using ten sets of\nfirst-person pronouns. We discovered that pronouns alone can evoke perceptions\nof social identities in ChatGPT at the intersections of gender, age, region,\nand formality, with caveats. This work highlights the importance of pronoun use\nfor social identity simulation, provides a language-based methodology for\nculturally-sensitive persona development, and advances the potential of\nintersectional identities in intelligent agents.", "paper_summary_zh": "ChatGPT 是一個建構於大型語言模型上的對話代理。ChatGPT 接受大量人類產出的訓練，可以在一定程度上模擬人類。因此，我們需要考慮 ChatGPT 模擬（或可設計為模擬）哪些社會身分。在這個研究中，我們探討了透過日文第一人稱代名詞進行身分模擬的案例，這些代名詞與社會身分緊密相連，也就是交織的代名詞。我們進行了一項受控的線上實驗，來自日本兩個地區（關東和近畿）的人見證了 ChatGPT 使用十組第一人稱代名詞的互動。我們發現，僅憑代名詞就能喚起人們對 ChatGPT 在性別、年齡、地區和禮貌等交集中的社會身分的認知，但有一些但書。這項工作強調了代名詞在社會身分模擬中的重要性，提供了一種基於語言的方法，用於文化敏感的角色發展，並提升了智慧代理中交織身分的潛力。", "author": "Takao Fujii et.al.", "authors": "Takao Fujii, Katie Seaborn, Madeleine Steeds", "id": "2405.08238v1", "paper_url": "http://arxiv.org/abs/2405.08238v1", "repo": "null"}}