{"2407.07566": {"publish_time": "2024-07-10", "title": "HebDB: a Weakly Supervised Dataset for Hebrew Speech Processing", "paper_summary": "We present HebDB, a weakly supervised dataset for spoken language processing\nin the Hebrew language. HebDB offers roughly 2500 hours of natural and\nspontaneous speech recordings in the Hebrew language, consisting of a large\nvariety of speakers and topics. We provide raw recordings together with a\npre-processed, weakly supervised, and filtered version. The goal of HebDB is to\nfurther enhance research and development of spoken language processing tools\nfor the Hebrew language. Hence, we additionally provide two baseline systems\nfor Automatic Speech Recognition (ASR): (i) a self-supervised model; and (ii) a\nfully supervised model. We present the performance of these two methods\noptimized on HebDB and compare them to current multi-lingual ASR alternatives.\nResults suggest the proposed method reaches better results than the evaluated\nbaselines considering similar model sizes. Dataset, code, and models are\npublicly available under https://pages.cs.huji.ac.il/adiyoss-lab/HebDB/.", "paper_summary_zh": "我們提出 HebDB，一個希伯來語口語處理的弱監督資料集。HebDB 提供大約 2500 小時的希伯來語自然且自發的語音錄音，包含各種講者和主題。我們提供原始錄音以及經過預處理、弱監督和過濾的版本。HebDB 的目標是進一步增強希伯來語口語處理工具的研究和開發。因此，我們另外提供了兩個自動語音辨識 (ASR) 的基準系統：(i) 自我監督模型；(ii) 完全監督模型。我們展示了這兩種方法在 HebDB 上最佳化的效能，並將它們與目前的多分語言 ASR 替代方案進行比較。結果表明，所提出的方法在考慮類似模型大小的情況下，比評估的基準線獲得更好的結果。資料集、程式碼和模型可在 https://pages.cs.huji.ac.il/adiyoss-lab/HebDB/ 下公開取得。", "author": "Arnon Turetzky et.al.", "authors": "Arnon Turetzky, Or Tal, Yael Segal-Feldman, Yehoshua Dissen, Ella Zeldes, Amit Roth, Eyal Cohen, Yosi Shrem, Bronya R. Chernyak, Olga Seleznova, Joseph Keshet, Yossi Adi", "id": "2407.07566v1", "paper_url": "http://arxiv.org/abs/2407.07566v1", "repo": "null"}}