{"2406.19071": {"publish_time": "2024-06-27", "title": "EmPO: Theory-Driven Dataset Construction for Empathetic Response Generation through Preference Optimization", "paper_summary": "Empathetic response generation is a desirable aspect of conversational\nagents, crucial for facilitating engaging and emotionally intelligent\nmulti-turn conversations between humans and machines. Leveraging large language\nmodels for this task has shown promising results, yet challenges persist in\nensuring both the empathetic quality of the responses and retention of the\ngeneralization performance of the models. In this paper, we propose a novel\napproach where we construct theory-driven preference datasets and use them to\nalign LLMs with preference optimization algorithms to address these challenges.\nTo measure empathetic response generation, we employ the EmpatheticDialogues\ndataset, assessing empathy with the diff-EPITOME and BERTscore metrics, and\nevaluate the generalization performance on the MMLU benchmark. We make all\ndatasets, source code, and models publicly available.", "paper_summary_zh": "同理回應生成是對話代理人理想的特點，對於促進人類與機器之間引人入勝且富有情感智慧的多輪對話至關重要。利用大型語言模型來執行此任務已展現出有前景的成果，然而，在確保回應的同理品質和保留模型的概化效能方面仍存在挑戰。在本文中，我們提出了一種新穎的方法，我們建構了理論驅動的偏好資料集，並使用它們將 LLM 與偏好最佳化演算法對齊，以應對這些挑戰。為了衡量同理回應生成，我們採用了 EmpatheticDialogues 資料集，使用 diff-EPITOME 和 BERTscore 指標評估同理心，並在 MMLU 基準上評估概化效能。我們公開提供所有資料集、原始碼和模型。", "author": "Ondrej Sotolar et.al.", "authors": "Ondrej Sotolar", "id": "2406.19071v1", "paper_url": "http://arxiv.org/abs/2406.19071v1", "repo": "https://github.com/ondrejsotolar/empo"}}