{"2412.07078": {"publish_time": "2024-12-10", "title": "Defensive Dual Masking for Robust Adversarial Defense", "paper_summary": "The field of textual adversarial defenses has gained considerable attention\nin recent years due to the increasing vulnerability of natural language\nprocessing (NLP) models to adversarial attacks, which exploit subtle\nperturbations in input text to deceive models. This paper introduces the\nDefensive Dual Masking (DDM) algorithm, a novel approach designed to enhance\nmodel robustness against such attacks. DDM utilizes a unique adversarial\ntraining strategy where [MASK] tokens are strategically inserted into training\nsamples to prepare the model to handle adversarial perturbations more\neffectively. During inference, potentially adversarial tokens are dynamically\nreplaced with [MASK] tokens to neutralize potential threats while preserving\nthe core semantics of the input. The theoretical foundation of our approach is\nexplored, demonstrating how the selective masking mechanism strengthens the\nmodel's ability to identify and mitigate adversarial manipulations. Our\nempirical evaluation across a diverse set of benchmark datasets and attack\nmechanisms consistently shows that DDM outperforms state-of-the-art defense\ntechniques, improving model accuracy and robustness. Moreover, when applied to\nLarge Language Models (LLMs), DDM also enhances their resilience to adversarial\nattacks, providing a scalable defense mechanism for large-scale NLP\napplications.", "paper_summary_zh": "近年來，由於自然語言處理 (NLP) 模型越來越容易受到對抗性攻擊，而對抗性防禦領域已獲得相當大的關注，對抗性攻擊利用輸入文字中的細微擾動來欺騙模型。本文介紹了防禦性雙重遮罩 (DDM) 演算法，這是一種新穎的方法，旨在增強模型對此類攻擊的穩健性。DDM 利用一種獨特的對抗性訓練策略，將 [MASK] 標記策略性地插入訓練樣本中，以準備模型更有效地處理對抗性擾動。在推理期間，潛在的對抗性標記會動態替換為 [MASK] 標記，以在保留輸入核心語義的同時，消除潛在威脅。探討了我們方法的理論基礎，展示了選擇性遮罩機制如何增強模型識別和減輕對抗性操縱的能力。我們在各種基準資料集和攻擊機制中進行的實證評估持續顯示，DDM 優於最先進的防禦技術，改善了模型的準確性和穩健性。此外，當應用於大型語言模型 (LLM) 時，DDM 也增強了它們對抗性攻擊的韌性，為大規模 NLP 應用提供了一種可擴充的防禦機制。", "author": "Wangli Yang et.al.", "authors": "Wangli Yang, Jie Yang, Yi Guo, Johan Barthelemy", "id": "2412.07078v1", "paper_url": "http://arxiv.org/abs/2412.07078v1", "repo": "null"}}