{"2410.20941": {"publish_time": "2024-10-28", "title": "Instruction-Tuned LLMs Succeed in Document-Level MT Without Fine-Tuning -- But BLEU Turns a Blind Eye", "paper_summary": "Large language models (LLMs) have excelled in various NLP tasks, including\nmachine translation (MT), yet most studies focus on sentence-level translation.\nThis work investigates the inherent capability of instruction-tuned LLMs for\ndocument-level translation (docMT). Unlike prior approaches that require\nspecialized techniques, we evaluate LLMs by directly prompting them to\ntranslate entire documents in a single pass. Our results show that this method\nimproves translation quality compared to translating sentences separately, even\nwithout document-level fine-tuning. However, this advantage is not reflected in\nBLEU scores, which often favor sentence-based translations. We propose using\nthe LLM-as-a-judge paradigm for evaluation, where GPT-4 is used to assess\ndocument coherence, accuracy, and fluency in a more nuanced way than\nn-gram-based metrics. Overall, our work demonstrates that instruction-tuned\nLLMs can effectively leverage document context for translation. However, we\ncaution against using BLEU scores for evaluating docMT, as they often provide\nmisleading outcomes, failing to capture the quality of document-level\ntranslation. Code and data are available at\nhttps://github.com/EIT-NLP/BLEUless_DocMT", "paper_summary_zh": "大型語言模型 (LLM) 已在各種自然語言處理 (NLP) 任務中表現優異，包括機器翻譯 (MT)，但大多數研究都專注於句子層級翻譯。這項研究探討了針對指令調整的 LLM 在文件層級翻譯 (docMT) 中的固有能力。與需要特殊技術的先前方法不同，我們透過直接提示 LLM 一次翻譯整個文件來評估 LLM。我們的結果顯示，與分別翻譯句子相比，此方法可提升翻譯品質，即使沒有進行文件層級微調。然而，此優勢並未反映在 BLEU 分數中，而 BLEU 分數通常偏好基於句子的翻譯。我們建議使用 LLM 作為評判的評估範例，其中 GPT-4 用於以比 n-gram 基準更細緻的方式評估文件的一致性、準確性和流暢性。整體而言，我們的研究證明了針對指令調整的 LLM 可以有效利用文件內容進行翻譯。然而，我們警告不要使用 BLEU 分數來評估 docMT，因為它們通常會提供誤導性的結果，無法掌握文件層級翻譯的品質。程式碼和資料可於 https://github.com/EIT-NLP/BLEUless_DocMT 取得", "author": "Yirong Sun et.al.", "authors": "Yirong Sun, Dawei Zhu, Yanjun Chen, Erjia Xiao, Xinghao Chen, Xiaoyu Shen", "id": "2410.20941v2", "paper_url": "http://arxiv.org/abs/2410.20941v2", "repo": "null"}}