{"2410.19221": {"publish_time": "2024-10-25", "title": "Can Stories Help LLMs Reason? Curating Information Space Through Narrative", "paper_summary": "Narratives are widely recognized as a powerful tool for structuring\ninformation and facilitating comprehension of complex ideas in various domains\nsuch as science communication. This paper investigates whether incorporating\nnarrative elements can assist Large Language Models (LLMs) in solving complex\nproblems more effectively. We propose a novel approach, Story of Thought (SoT),\nintegrating narrative structures into prompting techniques for problem-solving.\nThis approach involves constructing narratives around problem statements and\ncreating a framework to identify and organize relevant information. Our\nexperiments show that using various LLMs with SoT consistently surpasses using\nthem with other techniques on physics, chemistry, math, and biology questions\nin both the GPQA and JEEBench datasets. The narrative-based information\ncuration process in SoT enhances problem comprehension by contextualizing\ncritical in-domain information and highlighting causal relationships within the\nproblem space.", "paper_summary_zh": "敘事被廣泛認為是建構資訊和促進理解各領域複雜概念的有力工具，例如科學傳播。本文探討結合敘事元素是否能協助大型語言模型 (LLM) 更有效地解決複雜問題。我們提出了一種新穎的方法，即思考的故事 (SoT)，將敘事結構融入問題解決的提示技巧中。此方法涉及建構圍繞問題陳述的敘事，並建立一個架構來識別和組織相關資訊。我們的實驗顯示，在物理、化學、數學和生物學問題上，使用各種 LLM 搭配 SoT 持續優於使用其他技巧，無論是在 GPQA 或 JEEBench 資料集上。SoT 中基於敘事的資訊策展過程透過將關鍵領域內資訊脈絡化，並強調問題空間內的因果關係，增強了問題理解。", "author": "Vahid Sadiri Javadi et.al.", "authors": "Vahid Sadiri Javadi, Johanne R. Trippas, Yash Kumar Lal, Lucie Flek", "id": "2410.19221v1", "paper_url": "http://arxiv.org/abs/2410.19221v1", "repo": "null"}}