{"2411.02066": {"publish_time": "2024-11-04", "title": "Collaborative Cognitive Diagnosis with Disentangled Representation Learning for Learner Modeling", "paper_summary": "Learners sharing similar implicit cognitive states often display comparable\nobservable problem-solving performances. Leveraging collaborative connections\namong such similar learners proves valuable in comprehending human learning.\nMotivated by the success of collaborative modeling in various domains, such as\nrecommender systems, we aim to investigate how collaborative signals among\nlearners contribute to the diagnosis of human cognitive states (i.e., knowledge\nproficiency) in the context of intelligent education. The primary challenges\nlie in identifying implicit collaborative connections and disentangling the\nentangled cognitive factors of learners for improved explainability and\ncontrollability in learner Cognitive Diagnosis (CD). However, there has been no\nwork on CD capable of simultaneously modeling collaborative and disentangled\ncognitive states. To address this gap, we present Coral, a Collaborative\ncognitive diagnosis model with disentangled representation learning.\nSpecifically, Coral first introduces a disentangled state encoder to achieve\nthe initial disentanglement of learners' states. Subsequently, a meticulously\ndesigned collaborative representation learning procedure captures collaborative\nsignals. It dynamically constructs a collaborative graph of learners by\niteratively searching for optimal neighbors in a context-aware manner. Using\nthe constructed graph, collaborative information is extracted through node\nrepresentation learning. Finally, a decoding process aligns the initial\ncognitive states and collaborative states, achieving co-disentanglement with\npractice performance reconstructions. Extensive experiments demonstrate the\nsuperior performance of Coral, showcasing significant improvements over\nstate-of-the-art methods across several real-world datasets. Our code is\navailable at https://github.com/bigdata-ustc/Coral.", "paper_summary_zh": "<paragraph>具有相似隐含认知状态的学习者通常表现出可比的\n可观察问题解决能力。利用此类相似学习者之间的协作联系\n在理解人类学习方面被证明是有价值的。受协作建模在各个领域的成功启发，例如\n推荐系统，我们旨在研究学习者之间的协作信号如何有助于诊断人类认知状态（即知识\n熟练程度）在智能教育的背景下。主要挑战在于识别隐含的协作联系并解开\n学习者的纠缠认知因素，以提高学习者认知诊断 (CD) 中的可解释性和可控性。然而，尚未\n有 CD 能够同时对协作和解开的认知状态进行建模。为了解决这一差距，我们提出了 Coral，一种协作\n认知诊断模型，具有解开的表示学习。具体来说，Coral 首先引入了一个解开的状态编码器来实现\n学习者状态的初始解开。随后，精心设计的协作表示学习过程捕获协作\n信号。它通过以上下文感知的方式迭代搜索最优邻居来动态构建学习者的协作图。使用\n构建的图，通过节点表示学习提取协作信息。最后，解码过程对齐初始\n认知状态和协作状态，通过实践性能重建实现共解开。大量的实验证明了 Coral 的\n卓越性能，展示了在几个真实世界数据集上对最先进方法的显着改进。我们的代码可在 https://github.com/bigdata-ustc/Coral 获得。</paragraph>", "author": "Weibo Gao et.al.", "authors": "Weibo Gao, Qi Liu, Linan Yue, Fangzhou Yao, Hao Wang, Yin Gu, Zheng Zhang", "id": "2411.02066v1", "paper_url": "http://arxiv.org/abs/2411.02066v1", "repo": "https://github.com/bigdata-ustc/coral"}}