{"2406.02880": {"publish_time": "2024-06-05", "title": "Controllable Talking Face Generation by Implicit Facial Keypoints Editing", "paper_summary": "Audio-driven talking face generation has garnered significant interest within\nthe domain of digital human research. Existing methods are encumbered by\nintricate model architectures that are intricately dependent on each other,\ncomplicating the process of re-editing image or video inputs. In this work, we\npresent ControlTalk, a talking face generation method to control face\nexpression deformation based on driven audio, which can construct the head pose\nand facial expression including lip motion for both single image or sequential\nvideo inputs in a unified manner. By utilizing a pre-trained video synthesis\nrenderer and proposing the lightweight adaptation, ControlTalk achieves precise\nand naturalistic lip synchronization while enabling quantitative control over\nmouth opening shape. Our experiments show that our method is superior to\nstate-of-the-art performance on widely used benchmarks, including HDTF and\nMEAD. The parameterized adaptation demonstrates remarkable generalization\ncapabilities, effectively handling expression deformation across same-ID and\ncross-ID scenarios, and extending its utility to out-of-domain portraits,\nregardless of languages.", "paper_summary_zh": "受音訊驅動的說話人臉生成在數位人像研究領域中備受關注。現有方法受到複雜的模型架構所累，這些架構錯綜複雜地相互依賴，使得重新編輯影像或影片輸入的過程變得複雜。在這項工作中，我們提出 ControlTalk，一種基於受驅動音訊控制臉部表情變形的說話人臉生成方法，它能夠以統一的方式建構頭部姿勢和臉部表情，包括單一影像或序列影片輸入的唇部動作。透過使用預先訓練好的影片合成渲染器並提出輕量化適應，ControlTalk 能夠在精確且自然地進行唇部同步的同時，還能對嘴巴張開的形狀進行量化控制。我們的實驗顯示，我們的模型在廣泛使用的基準上優於最先進的效能，包括 HDTF 和 MEAD。參數化適應展示出非凡的泛化能力，能夠有效地處理同 ID 和跨 ID 場景中的表情變形，並將其效用擴展到領域外的肖像，而與語言無關。", "author": "Dong Zhao et.al.", "authors": "Dong Zhao, Jiaying Shi, Wenjun Li, Shudong Wang, Shenghui Xu, Zhaoming Pan", "id": "2406.02880v1", "paper_url": "http://arxiv.org/abs/2406.02880v1", "repo": "null"}}