{"2411.17438": {"publish_time": "2024-11-26", "title": "Object-centric proto-symbolic behavioural reasoning from pixels", "paper_summary": "Autonomous intelligent agents must bridge computational challenges at\ndisparate levels of abstraction, from the low-level spaces of sensory input and\nmotor commands to the high-level domain of abstract reasoning and planning. A\nkey question in designing such agents is how best to instantiate the\nrepresentational space that will interface between these two levels -- ideally\nwithout requiring supervision in the form of expensive data annotations. These\nobjectives can be efficiently achieved by representing the world in terms of\nobjects (grounded in perception and action). In this work, we present a novel,\nbrain-inspired, deep-learning architecture that learns from pixels to\ninterpret, control, and reason about its environment, using object-centric\nrepresentations. We show the utility of our approach through tasks in synthetic\nenvironments that require a combination of (high-level) logical reasoning and\n(low-level) continuous control. Results show that the agent can learn emergent\nconditional behavioural reasoning, such as $(A \\to B) \\land (\\neg A \\to C)$, as\nwell as logical composition $(A \\to B) \\land (A \\to C) \\vdash A \\to (B \\land\nC)$ and XOR operations, and successfully controls its environment to satisfy\nobjectives deduced from these logical rules. The agent can adapt online to\nunexpected changes in its environment and is robust to mild violations of its\nworld model, thanks to dynamic internal desired goal generation. While the\npresent results are limited to synthetic settings (2D and 3D activated versions\nof dSprites), which fall short of real-world levels of complexity, the proposed\narchitecture shows how to manipulate grounded object representations, as a key\ninductive bias for unsupervised learning, to enable behavioral reasoning.", "paper_summary_zh": "自主智能代理必須彌合不同抽象層級的計算挑戰，從感官輸入和運動命令的低階層級空間到抽象推理和規劃的高階層級領域。在設計此類代理時，一個關鍵問題是如何最佳實例化介於這兩個層級之間的表徵空間，理想情況下不需要以昂貴的資料註釋形式進行監督。這些目標可透過以物件（以感知和動作為基礎）來表徵世界來有效達成。在這項工作中，我們提出一個新穎、受大腦啟發的深度學習架構，它從像素學習來詮釋、控制和推理其環境，使用以物件為中心的表徵。我們透過合成環境中的任務展示我們方法的效用，這些任務需要（高階）邏輯推理和（低階）連續控制的組合。結果顯示代理可以學習新興的條件行為推理，例如 $(A \\to B) \\land (\\neg A \\to C)$，以及邏輯組合 $(A \\to B) \\land (A \\to C) \\vdash A \\to (B \\land C)$ 和 XOR 運算，並成功控制其環境以滿足從這些邏輯規則推導出的目標。代理可以線上適應其環境中的意外變化，並且由於動態的內部目標產生，因此對其世界模型的輕微違規具有魯棒性。雖然目前的結果僅限於合成設定（dSprites 的 2D 和 3D 啟動版本），其複雜性低於真實世界，但所提出的架構展示了如何操作接地的物件表徵，作為無監督學習的主要歸納偏差，以實現行為推理。", "author": "Ruben van Bergen et.al.", "authors": "Ruben van Bergen, Justus Hübotter, Pablo Lanillos", "id": "2411.17438v1", "paper_url": "http://arxiv.org/abs/2411.17438v1", "repo": "https://github.com/neuro-ai-robotics/OBR"}}