{"2411.13453": {"publish_time": "2024-11-20", "title": "LIMBA: An Open-Source Framework for the Preservation and Valorization of Low-Resource Languages using Generative Models", "paper_summary": "Minority languages are vital to preserving cultural heritage, yet they face\ngrowing risks of extinction due to limited digital resources and the dominance\nof artificial intelligence models trained on high-resource languages. This\nwhite paper proposes a framework to generate linguistic tools for low-resource\nlanguages, focusing on data creation to support the development of language\nmodels that can aid in preservation efforts. Sardinian, an endangered language,\nserves as the case study to demonstrate the framework's effectiveness. By\naddressing the data scarcity that hinders intelligent applications for such\nlanguages, we contribute to promoting linguistic diversity and support ongoing\nefforts in language standardization and revitalization through modern\ntechnologies.", "paper_summary_zh": "少數語言對於保存文化遺產至關重要，但由於數位資源有限以及以高資源語言訓練的人工智慧模型的普及，這些語言面臨越來越高的滅絕風險。本白皮書提出了一個框架，用於產生低資源語言的語言工具，重點在於建立資料，以支援語言模型的開發，進而協助保存工作。薩丁尼亞語是一種瀕臨滅絕的語言，作為案例研究來證明此框架的有效性。透過解決阻礙此類語言的智慧型應用程式的資料短缺問題，我們可以協助推廣語言多樣性，並透過現代科技支援語言標準化和復興的持續努力。", "author": "Salvatore Mario Carta et.al.", "authors": "Salvatore Mario Carta, Stefano Chessa, Giulia Contu, Andrea Corriga, Andrea Deidda, Gianni Fenu, Luca Frigau, Alessandro Giuliani, Luca Grassi, Marco Manolo Manca, Mirko Marras, Francesco Mola, Bastianino Mossa, Piergiorgio Mura, Marco Ortu, Leonardo Piano, Simone Pisano, Alessia Pisu, Alessandro Sebastian Podda, Livio Pompianu, Simone Seu, Sandro Gabriele Tiddia", "id": "2411.13453v1", "paper_url": "http://arxiv.org/abs/2411.13453v1", "repo": "null"}}