{"2406.15259": {"publish_time": "2024-06-21", "title": "V-RECS, a Low-Cost LLM4VIS Recommender with Explanations, Captioning and Suggestions", "paper_summary": "NL2VIS (natural language to visualization) is a promising and recent research\narea that involves interpreting natural language queries and translating them\ninto visualizations that accurately represent the underlying data. As we\nnavigate the era of big data, NL2VIS holds considerable application potential\nsince it greatly facilitates data exploration by non-expert users. Following\nthe increasingly widespread usage of generative AI in NL2VIS applications, in\nthis paper we present V-RECS, the first LLM-based Visual Recommender augmented\nwith explanations(E), captioning(C), and suggestions(S) for further data\nexploration. V-RECS' visualization narratives facilitate both response\nverification and data exploration by non-expert users. Furthermore, our\nproposed solution mitigates computational, controllability, and cost issues\nassociated with using powerful LLMs by leveraging a methodology to effectively\nfine-tune small models. To generate insightful visualization narratives, we use\nChain-of-Thoughts (CoT), a prompt engineering technique to help LLM identify\nand generate the logical steps to produce a correct answer. Since CoT is\nreported to perform poorly with small LLMs, we adopted a strategy in which a\nlarge LLM (GPT-4), acting as a Teacher, generates CoT-based instructions to\nfine-tune a small model, Llama-2-7B, which plays the role of a Student.\nExtensive experiments-based on a framework for the quantitative evaluation of\nAI-based visualizations and on manual assessment by a group of\nparticipants-show that V-RECS achieves performance scores comparable to GPT-4,\nat a much lower cost. The efficacy of the V-RECS teacher-student paradigm is\nalso demonstrated by the fact that the un-tuned Llama fails to perform the task\nin the vast majority of test cases. We release V-RECS for the visualization\ncommunity to assist visualization designers throughout the entire visualization\ngeneration process.", "paper_summary_zh": "<paragraph>NL2VIS（自然語言轉視覺化）是一個有前途且新興的研究領域，涉及解讀自然語言查詢，並將其轉換成精確呈現底層資料的視覺化。隨著我們進入大數據時代，NL2VIS 擁有相當大的應用潛力，因為它極大地促進了非專家使用者探索資料。隨著生成式 AI 在 NL2VIS 應用中越來越廣泛地使用，我們在這篇論文中提出了 V-RECS，這是第一個基於 LLM 的視覺推薦系統，並擴充了解釋 (E)、標題 (C) 和建議 (S) 以進一步探索資料。V-RECS 的視覺化敘述有助於非專家使用者驗證回應和探索資料。此外，我們提出的解決方案透過採用一種方法來有效微調小型模型，從而減輕與使用強大 LLM 相關的運算、可控性和成本問題。為了產生有見地的視覺化敘述，我們使用思想鏈 (CoT)，這是一種提示工程技術，可幫助 LLM 識別和產生產生正確答案的邏輯步驟。由於據報導，CoT 在小型 LLM 中表現不佳，因此我們採用了一種策略，其中大型 LLM (GPT-4) 扮演老師的角色，生成基於 CoT 的指令來微調小型模型 Llama-2-7B，後者扮演學生的角色。廣泛的實驗基於一個用於評估基於 AI 的視覺化的量化框架，以及一組參與者的手動評估，表明 V-RECS 達到了與 GPT-4 相當的效能分數，但成本卻低得多。V-RECS 師生範式的有效性也由以下事實證明：未調整的 Llama 在絕大多數測試案例中無法執行任務。我們釋出 V-RECS 給視覺化社群，以協助視覺化設計師完成整個視覺化生成過程。</paragraph>", "author": "Luca Podo et.al.", "authors": "Luca Podo, Marco Angelini, Paola Velardi", "id": "2406.15259v1", "paper_url": "http://arxiv.org/abs/2406.15259v1", "repo": "null"}}