{"2412.16624": {"publish_time": "2024-12-21", "title": "Automated Bleeding Detection and Classification in Wireless Capsule Endoscopy with YOLOv8-X", "paper_summary": "Gastrointestinal (GI) bleeding, a critical indicator of digestive system\ndisorders, re quires efficient and accurate detection methods. This paper\npresents our solution to the Auto-WCEBleedGen Version V1 Challenge, where we\nachieved the consolation position. We developed a unified YOLOv8-X model for\nboth detection and classification of bleeding regions in Wireless Capsule\nEndoscopy (WCE) images. Our approach achieved 96.10% classification accuracy\nand 76.8% mean Average Precision (mAP) at 0.5 IoU on the val idation dataset.\nThrough careful dataset curation and annotation, we assembled and trained on\n6,345 diverse images to ensure robust model performance. Our implementa tion\ncode and trained models are publicly available at\nhttps://github.com/pavan98765/Auto-WCEBleedGen.", "paper_summary_zh": "胃腸道 (GI) 出血是消化系統疾病的重要指標，需要有效且準確的檢測方法。本文提出我們對 Auto-WCEBleedGen 版本 V1 挑戰的解決方案，我們在其中取得了安慰獎。我們開發了一個統一的 YOLOv8-X 模型，用於無線膠囊內視鏡 (WCE) 影像中出血區域的檢測和分類。我們的做法在驗證資料集上以 0.5 IoU 達到了 96.10% 的分類準確度和 76.8% 的平均平均精度 (mAP)。透過仔細的資料集策劃和註解，我們收集並訓練了 6,345 張不同的影像，以確保模型的強健效能。我們的實作程式碼和訓練模型已公開於 https://github.com/pavan98765/Auto-WCEBleedGen。", "author": "Pavan C Shekar et.al.", "authors": "Pavan C Shekar, Vivek Kanhangad, Shishir Maheshwari, T Sunil Kumar", "id": "2412.16624v1", "paper_url": "http://arxiv.org/abs/2412.16624v1", "repo": "https://github.com/pavan98765/auto-wcebleedgen"}}