{"2407.06807": {"publish_time": "2024-07-09", "title": "A Hybrid Training-time and Run-time Defense Against Adversarial Attacks in Modulation Classification", "paper_summary": "Motivated by the superior performance of deep learning in many applications\nincluding computer vision and natural language processing, several recent\nstudies have focused on applying deep neural network for devising future\ngenerations of wireless networks. However, several recent works have pointed\nout that imperceptible and carefully designed adversarial examples (attacks)\ncan significantly deteriorate the classification accuracy. In this paper, we\ninvestigate a defense mechanism based on both training-time and run-time\ndefense techniques for protecting machine learning-based radio signal\n(modulation) classification against adversarial attacks. The training-time\ndefense consists of adversarial training and label smoothing, while the\nrun-time defense employs a support vector machine-based neural rejection (NR).\nConsidering a white-box scenario and real datasets, we demonstrate that our\nproposed techniques outperform existing state-of-the-art technologies.", "paper_summary_zh": "受到深度學習在許多應用中展現的優異效能所激勵，包括電腦視覺和自然語言處理，最近有幾項研究專注於將深度神經網路應用於設計下一代無線網路。然而，最近有幾項研究指出，難以察覺且經過精心設計的對抗範例（攻擊）會大幅降低分類準確度。在本文中，我們探討一種防禦機制，它基於訓練時間和執行時間防禦技術，用於保護基於機器學習的無線電訊號（調變）分類，以抵禦對抗攻擊。訓練時間防禦包含對抗訓練和標籤平滑，而執行時間防禦則採用基於支持向量機的神經拒絕 (NR)。考量白盒情境和真實資料集，我們證明我們提出的技術優於現有的最先進技術。", "author": "Lu Zhang et.al.", "authors": "Lu Zhang, Sangarapillai Lambotharan, Gan Zheng, Guisheng Liao, Ambra Demontis, Fabio Roli", "id": "2407.06807v1", "paper_url": "http://arxiv.org/abs/2407.06807v1", "repo": "null"}}