{"2502.13935": {"publish_time": "2025-02-19", "title": "Continually Learning Structured Visual Representations via Network Refinement with Rerelation", "paper_summary": "Current machine learning paradigm relies on continuous representations like\nneural networks, which iteratively adjust parameters to approximate outcomes\nrather than directly learning the structure of problem. This spreads\ninformation across the network, causing issues like information loss and\nincomprehensibility Building on prior work in environment dynamics modeling, we\npropose a method that learns visual space in a structured, continual manner.\nOur approach refines networks to capture the core structure of objects while\nrepresenting significant subvariants in structure efficiently. We demonstrate\nthis with 2D shape detection, showing incremental learning on MNIST without\noverwriting knowledge and creating compact, comprehensible representations.\nThese results offer a promising step toward a transparent, continually learning\nalternative to traditional neural networks for visual processing.", "paper_summary_zh": "當前機器學習範例依賴於連續表示，例如神經網路，它會反覆調整參數以近似結果，而不是直接學習問題的結構。這會將資訊散布到整個網路中，導致資訊遺失和難以理解等問題。我們建立在環境動態建模的先前工作上，提出了一種以結構化、連續的方式學習視覺空間的方法。我們的做法會改善網路，以擷取物件的核心結構，同時有效地表示結構中的重大次變異。我們透過 2D 形狀偵測來展示這一點，顯示在 MNIST 上的增量學習，而不會覆寫知識，並建立精簡、易於理解的表示。這些結果為視覺處理的傳統神經網路提供了一個有希望的步驟，朝向透明、持續學習的替代方案。", "author": "Zeki Doruk Erden et.al.", "authors": "Zeki Doruk Erden, Boi Faltings", "id": "2502.13935v1", "paper_url": "http://arxiv.org/abs/2502.13935v1", "repo": "null"}}