{"2406.16377": {"publish_time": "2024-06-24", "title": "On the Transformations across Reward Model, Parameter Update, and In-Context Prompt", "paper_summary": "Despite the general capabilities of pre-trained large language models (LLMs),\nthey still need further adaptation to better serve practical applications. In\nthis paper, we demonstrate the interchangeability of three popular and distinct\nadaptation tools: parameter updating, reward modeling, and in-context\nprompting. This interchangeability establishes a triangular framework with six\ntransformation directions, each of which facilitates a variety of applications.\nOur work offers a holistic view that unifies numerous existing studies and\nsuggests potential research directions. We envision our work as a useful\nroadmap for future research on LLMs.", "paper_summary_zh": "儘管預先訓練的大語言模型 (LLM) 具有普遍功能，\n它們仍需要進一步調整才能更好地服務於實際應用。在\n本文中，我們展示了三個流行且不同的調整工具的可互換性：參數更新、獎勵建模和情境內\n提示。這種可互換性建立了一個三角形框架，其中包含六個轉換方向，每個方向都促進了各種應用。\n我們的研究提供了一個整體觀點，統一了許多現有研究，\n並提出了潛在的研究方向。我們將我們的研究視為未來 LLM 研究的有用路線圖。", "author": "Deng Cai et.al.", "authors": "Deng Cai, Huayang Li, Tingchen Fu, Siheng Li, Weiwen Xu, Shuaiyi Li, Bowen Cao, Zhisong Zhang, Xinting Huang, Leyang Cui, Yan Wang, Lemao Liu, Taro Watanabe, Shuming Shi", "id": "2406.16377v1", "paper_url": "http://arxiv.org/abs/2406.16377v1", "repo": "null"}}