{"2408.11747": {"publish_time": "2024-08-21", "title": "Open-Ended 3D Point Cloud Instance Segmentation", "paper_summary": "Open-Vocab 3D Instance Segmentation methods (OV-3DIS) have recently\ndemonstrated their ability to generalize to unseen objects. However, these\nmethods still depend on predefined class names during testing, restricting the\nautonomy of agents. To mitigate this constraint, we propose a novel problem\ntermed Open-Ended 3D Instance Segmentation (OE-3DIS), which eliminates the\nnecessity for predefined class names during testing. Moreover, we contribute a\ncomprehensive set of strong baselines, derived from OV-3DIS approaches and\nleveraging 2D Multimodal Large Language Models. To assess the performance of\nour OE-3DIS system, we introduce a novel Open-Ended score, evaluating both the\nsemantic and geometric quality of predicted masks and their associated class\nnames, alongside the standard AP score. Our approach demonstrates significant\nperformance improvements over the baselines on the ScanNet200 and ScanNet++\ndatasets. Remarkably, our method surpasses the performance of Open3DIS, the\ncurrent state-of-the-art method in OV-3DIS, even in the absence of ground-truth\nobject class names.", "paper_summary_zh": "開放詞彙 3D 實例分割方法 (OV-3DIS) 最近展示了它們概括到未見物件的能力。然而，這些方法在測試期間仍依賴於預定義的類別名稱，限制了代理的自主性。為了減輕這個限制，我們提出了一個新問題，稱為開放式 3D 實例分割 (OE-3DIS)，它消除了測試期間預定義類別名稱的必要性。此外，我們貢獻了一組從 OV-3DIS 方法中衍生並利用 2D 多模態大型語言模型的強大基線。為了評估我們的 OE-3DIS 系統的效能，我們引入了新的開放式評分，除了標準 AP 評分外，還評估了預測遮罩及其相關類別名稱的語義和幾何品質。我們的做法在 ScanNet200 和 ScanNet++ 資料集上展示了比基線顯著的效能提升。值得注意的是，我們的模型超越了 Open3DIS 的效能，Open3DIS 是 OV-3DIS 中目前最先進的方法，即使在沒有 ground-truth 物件類別名稱的情況下也是如此。", "author": "Phuc D. A. Nguyen et.al.", "authors": "Phuc D. A. Nguyen, Minh Luu, Anh Tran, Cuong Pham, Khoi Nguyen", "id": "2408.11747v1", "paper_url": "http://arxiv.org/abs/2408.11747v1", "repo": "null"}}