{"2409.02098": {"publish_time": "2024-09-03", "title": "CRAFT Your Dataset: Task-Specific Synthetic Dataset Generation Through Corpus Retrieval and Augmentation", "paper_summary": "Building high-quality datasets for specialized tasks is a time-consuming and\nresource-intensive process that often requires specialized domain knowledge. We\npropose Corpus Retrieval and Augmentation for Fine-Tuning (CRAFT), a method for\ngenerating synthetic datasets, given a small number of user-written few-shots\nthat demonstrate the task to be performed. Given the few-shot examples, we use\nlarge-scale public web-crawled corpora and similarity-based document retrieval\nto find other relevant human-written documents. Lastly, instruction-tuned large\nlanguage models (LLMs) augment the retrieved documents into custom-formatted\ntask samples, which then can be used for fine-tuning. We demonstrate that CRAFT\ncan efficiently generate large-scale task-specific training datasets for four\ndiverse tasks: biology question-answering (QA), medicine QA and commonsense QA\nas well as summarization. Our experiments show that CRAFT-based models\noutperform or achieve comparable performance to general LLMs for QA tasks,\nwhile CRAFT-based summarization models outperform models trained on\nhuman-curated data by 46 preference points.", "paper_summary_zh": "建立高质量数据集以用于专门任务是一个耗时且资源密集的过程，通常需要专门的领域知识。我们提出语料检索和增强微调（CRAFT），这是一种生成合成数据集的方法，给定少量用户编写的少镜头演示要执行的任务。鉴于少镜头示例，我们使用大规模公共网络爬取语料库和基于相似性的文档检索来查找其他相关的人工编写的文档。最后，经过指令调整的大语言模型 (LLM) 将检索到的文档增强为定制格式的任务样本，然后可用于微调。我们证明 CRAFT 可以有效地生成针对四个不同任务的大规模特定任务训练数据集：生物学问答 (QA)、医学 QA 和常识 QA 以及摘要。我们的实验表明，对于 QA 任务，基于 CRAFT 的模型优于或达到与通用 LLM 相当的性能，而基于 CRAFT 的摘要模型则优于在人工整理数据上训练的模型，偏好得分提高了 46 分。", "author": "Ingo Ziegler et.al.", "authors": "Ingo Ziegler, Abdullatif Köksal, Desmond Elliott, Hinrich Schütze", "id": "2409.02098v1", "paper_url": "http://arxiv.org/abs/2409.02098v1", "repo": "null"}}