{"2501.17104": {"publish_time": "2025-01-28", "title": "COS(M+O)S: Curiosity and RL-Enhanced MCTS for Exploring Story Space via Language Models", "paper_summary": "We present COS(M+O)S, a System 2-inspired framework for open-ended plot\ndevelopment that systematically explores the vast space of possible story\nexpansions, enabling a 3B-parameter language model to approach the plot quality\nof a 70B model on select short-story tasks. The method accomplishes this by\ncombining Monte Carlo Tree Search (MCTS), guided by a step-level value model\nthat rewards moderate surprisal (curiosity) while penalizing incoherence, and\nOdds Ratio Preference Optimization (ORPO) to fine-tune the policy on high-value\nplot expansions. This iterative reinforcement learning loop systematically\nexplores multiple candidate plot branches, backpropagates quality signals, and\nadapts the policy for faster convergence, notably shifting the policy from\npuzzle-based Chain-of-Thought to more character-driven storytelling. In\nsmall-scale tests with short-story prompts, 67%-77% of participants favored\nCOS(M+O)S's highest-rated expansions over lower-rated ones, suggesting that our\nlearned value function aligns. GPT-4o ratings further show that COS(M+O)S\nsurpasses naive single-pass decoding from Llama 3.2 3B by 0.59 SD, coming\nwithin 0.06 SD of Llama 3.1 70B (no significant difference, p=0.93). Pairwise\ncomparisons with o1 place COS(M+O)S 1.5 SD above the 3B baseline and find no\nstatistically significant gap from 70B. Nevertheless, absolute story quality\nremains modest, constrained by the small model's capacity and limited training\ndata.", "paper_summary_zh": "<paragraph>我們提出 COS(M+O)S，一個受 System 2 啟發的架構，用於開放式情節發展，系統性地探索可能的故事情節擴展的廣闊空間，使 3B 參數語言模型能夠在選擇的短篇故事任務中接近 70B 模型的情節品質。此方法透過結合蒙地卡羅樹搜尋 (MCTS)，由階層價值模型引導，獎勵適度的驚喜 (好奇心)，同時懲罰不連貫性，以及機率比偏好最佳化 (ORPO) 來微調高價值情節擴展的政策。此反覆強化學習迴圈系統性地探索多個候選情節分支，反向傳播品質訊號，並調整政策以加快收斂，特別是將政策從基於謎題的思考鏈轉移到更多以角色為導向的故事敘述。在短篇故事提示的小規模測試中，67%-77% 的參與者偏好 COS(M+O)S 評分最高的擴展，而非評分較低的擴展，這表明我們學習到的價值函數是一致的。GPT-4o 評分進一步顯示，COS(M+O)S 超越了 Llama 3.2 3B 的單次解碼，SD 值為 0.59，接近 Llama 3.1 70B 的 SD 值 0.06（無顯著差異，p=0.93）。與 o1 的成對比較將 COS(M+O)S 放在 3B 基準線上方 1.5 SD，並且發現與 70B 之間沒有統計上顯著的差距。儘管如此，絕對的故事品質仍然適中，受到小模型容量和有限訓練資料的限制。</paragraph>", "author": "Tobias Materzok et.al.", "authors": "Tobias Materzok", "id": "2501.17104v1", "paper_url": "http://arxiv.org/abs/2501.17104v1", "repo": "null"}}