{"2409.03806": {"publish_time": "2024-09-05", "title": "Mpox Screen Lite: AI-Driven On-Device Offline Mpox Screening for Low-Resource African Mpox Emergency Response", "paper_summary": "Background: The 2024 Mpox outbreak, particularly severe in Africa with clade\n1b emergence, has highlighted critical gaps in diagnostic capabilities in\nresource-limited settings. This study aimed to develop and validate an\nartificial intelligence (AI)-driven, on-device screening tool for Mpox,\ndesigned to function offline in low-resource environments.\n  Methods: We developed a YOLOv8n-based deep learning model trained on 2,700\nimages (900 each of Mpox, other skin conditions, and normal skin), including\nsynthetic data. The model was validated on 360 images and tested on 540 images.\nA larger external validation was conducted using 1,500 independent images.\nPerformance metrics included accuracy, precision, recall, F1-score,\nsensitivity, and specificity.\n  Findings: The model demonstrated high accuracy (96%) in the final test set.\nFor Mpox detection, it achieved 93% precision, 97% recall, and an F1-score of\n95%. Sensitivity and specificity for Mpox detection were 97% and 96%,\nrespectively. Performance remained consistent in the larger external\nvalidation, confirming the model's robustness and generalizability.\n  Interpretation: This AI-driven screening tool offers a rapid, accurate, and\nscalable solution for Mpox detection in resource-constrained settings. Its\noffline functionality and high performance across diverse datasets suggest\nsignificant potential for improving Mpox surveillance and management,\nparticularly in areas lacking traditional diagnostic infrastructure.", "paper_summary_zh": "<paragraph>背景：2024 年 Mpox 爆發，在非洲特別嚴重，並出現 1b 分支，突顯了資源有限地區診斷能力的嚴重不足。本研究旨在開發和驗證一種人工智慧 (AI) 驅動的 Mpox 裝置篩選工具，旨在在資源不足的環境中離線運作。\n方法：我們開發了一個基於 YOLOv8n 的深度學習模型，並使用 2,700 張影像（Mpox、其他皮膚狀況和正常皮膚各 900 張）進行訓練，包括合成資料。該模型經過 360 張影像驗證，並在 540 張影像上進行測試。使用 1,500 張獨立影像進行了更大規模的外部驗證。效能指標包括準確度、精確度、召回率、F1 分數、敏感度和特異性。\n結果：該模型在最終測試集中表現出很高的準確度（96%）。對於 Mpox 檢測，其達到了 93% 的精確度、97% 的召回率和 95% 的 F1 分數。Mpox 檢測的敏感度和特異性分別為 97% 和 96%。在更大規模的外部驗證中，效能保持一致，這證實了該模型的穩健性和普遍性。\n詮釋：這種 AI 驅動的篩選工具為資源受限地區的 Mpox 檢測提供了一個快速、準確且可擴充的解決方案。其離線功能和在不同資料集中的高效能表明在改善 Mpox 監控和管理方面具有顯著潛力，特別是在缺乏傳統診斷基礎設施的地區。</paragraph>", "author": "Yudara Kularathne et.al.", "authors": "Yudara Kularathne, Prathapa Janitha, Sithira Ambepitiya", "id": "2409.03806v1", "paper_url": "http://arxiv.org/abs/2409.03806v1", "repo": "null"}}