{"2406.08864": {"publish_time": "2024-06-13", "title": "Research on Early Warning Model of Cardiovascular Disease Based on Computer Deep Learning", "paper_summary": "This project intends to study a cardiovascular disease risk early warning\nmodel based on one-dimensional convolutional neural networks. First, the\nmissing values of 13 physiological and symptom indicators such as patient age,\nblood glucose, cholesterol, and chest pain were filled and Z-score was\nstandardized. The convolutional neural network is converted into a 2D matrix,\nthe convolution function of 1,3, and 5 is used for the first-order convolution\noperation, and the Max Pooling algorithm is adopted for dimension reduction.\nSet the learning rate and output rate. It is optimized by the Adam algorithm.\nThe result of classification is output by a soft classifier. This study was\nconducted based on Statlog in the UCI database and heart disease database\nrespectively. The empirical data indicate that the forecasting precision of\nthis technique has been enhanced by 11.2%, relative to conventional approaches,\nwhile there is a significant improvement in the logarithmic curve fitting. The\nefficacy and applicability of the novel approach are corroborated through the\nexamination employing a one-dimensional convolutional neural network.", "paper_summary_zh": "本研究拟对基于一维卷积神经网络的心血管疾病风险预警模型进行研究。首先，对患者年龄、血糖、胆固醇、胸痛等13项生理及症状指标的缺失值进行填充并进行Z-score标准化。将卷积神经网络转化为二维矩阵，采用1、3、5的卷积核进行一维卷积操作，采用最大池化算法进行降维。设置学习率和输出率。采用Adam算法进行优化。通过softmax分类器输出分类结果。本研究分别基于UCI数据库中的Statlog和心脏病数据库进行。实证结果表明，该方法较传统方法预测精度提升11.2%，对数拟合曲线拟合效果明显提升。通过一维卷积神经网络的实验验证了该方法的有效性和适用性。", "author": "Yuxiang Hu et.al.", "authors": "Yuxiang Hu, Jinxin Hu, Ting Xu, Bo Zhang, Jiajie Yuan, Haozhang Deng", "id": "2406.08864v1", "paper_url": "http://arxiv.org/abs/2406.08864v1", "repo": "null"}}