{"2411.05194": {"publish_time": "2024-11-07", "title": "Interactive Dialogue Agents via Reinforcement Learning on Hindsight Regenerations", "paper_summary": "Recent progress on large language models (LLMs) has enabled dialogue agents\nto generate highly naturalistic and plausible text. However, current LLM\nlanguage generation focuses on responding accurately to questions and requests\nwith a single effective response. In reality, many real dialogues are\ninteractive, meaning an agent's utterances will influence their conversational\npartner, elicit information, or change their opinion. Accounting for how an\nagent can effectively steer a conversation is a crucial ability in many\ndialogue tasks, from healthcare to preference elicitation. Existing methods for\nfine-tuning dialogue agents to accomplish such tasks would rely on curating\nsome amount of expert data. However, doing so often requires understanding the\nunderlying cognitive processes of the conversational partner, which is a skill\nneither humans nor LLMs trained on human data can reliably do. Our key insight\nis that while LLMs may not be adept at identifying effective strategies for\nsteering conversations a priori, or in the middle of an ongoing conversation,\nthey can do so post-hoc, or in hindsight, after seeing how their conversational\npartner responds. We use this fact to rewrite and augment existing suboptimal\ndata, and train via offline reinforcement learning (RL) an agent that\noutperforms both prompting and learning from unaltered human demonstrations. We\napply our approach to two domains that require understanding human mental\nstate, intelligent interaction, and persuasion: mental health support, and\nsoliciting charitable donations. Our results in a user study with real humans\nshow that our approach greatly outperforms existing state-of-the-art dialogue\nagents.", "paper_summary_zh": "大型語言模型 (LLM) 的最新進展使對話代理能夠生成高度自然且合理的文字。然而，目前的 LLM 語言生成著重於以單一有效的回應準確回應問題和要求。在現實中，許多真實對話都是互動的，這表示代理人的發言會影響他們的對話夥伴、引出資訊或改變他們的意見。考量代理人如何有效引導對話的能力在許多對話任務中至關重要，從醫療保健到偏好引導皆是如此。現有的微調對話代理方法以完成此類任務會依賴於策劃一定量的專家資料。然而，這麼做通常需要了解對話夥伴的基礎認知歷程，而這項技能既不是人類也不是訓練過人類資料的 LLM 可靠具備的。我們的關鍵見解在於，儘管 LLM 可能不擅長於事先或在對話進行中識別出引導對話的有效策略，但他們可以在事後或回顧時，在看到他們的對話夥伴如何回應後這麼做。我們利用這個事實來改寫並擴充現有的次佳資料，並透過離線強化學習 (RL) 訓練一名代理人，其表現優於提示和從未經修改的人類示範中學習。我們將我們的做法應用於需要了解人類心理狀態、智慧互動和說服的兩個領域：心理健康支持和募集慈善捐款。我們在與真實人類進行的使用者研究中的結果顯示，我們的做法大幅優於現有的最先進對話代理。", "author": "Joey Hong et.al.", "authors": "Joey Hong, Jessica Lin, Anca Dragan, Sergey Levine", "id": "2411.05194v1", "paper_url": "http://arxiv.org/abs/2411.05194v1", "repo": "null"}}