{"2405.11476": {"publish_time": "2024-05-19", "title": "NubbleDrop: A Simple Way to Improve Matching Strategy for Prompted One-Shot Segmentation", "paper_summary": "Driven by large data trained segmentation models, such as SAM , research in\none-shot segmentation has experienced significant advancements. Recent\ncontributions like PerSAM and MATCHER , presented at ICLR 2024, utilize a\nsimilar approach by leveraging SAM with one or a few reference images to\ngenerate high quality segmentation masks for target images. Specifically, they\nutilize raw encoded features to compute cosine similarity between patches\nwithin reference and target images along the channel dimension, effectively\ngenerating prompt points or boxes for the target images a technique referred to\nas the matching strategy. However, relying solely on raw features might\nintroduce biases and lack robustness for such a complex task. To address this\nconcern, we delve into the issues of feature interaction and uneven\ndistribution inherent in raw feature based matching. In this paper, we propose\na simple and training-free method to enhance the validity and robustness of the\nmatching strategy at no additional computational cost (NubbleDrop). The core\nconcept involves randomly dropping feature channels (setting them to zero)\nduring the matching process, thereby preventing models from being influenced by\nchannels containing deceptive information. This technique mimics discarding\npathological nubbles, and it can be seamlessly applied to other similarity\ncomputing scenarios. We conduct a comprehensive set of experiments, considering\na wide range of factors, to demonstrate the effectiveness and validity of our\nproposed method. Our results showcase the significant improvements achieved\nthrough this simmple and straightforward approach.", "paper_summary_zh": "<paragraph>在 SAM 等大型数据训练分割模型的推动下，一次性分割的研究取得了重大进展。最近在 ICLR 2024 上提出的 PerSAM 和 MATCHER 等贡献，利用了类似的方法，利用 SAM 和一张或几张参考图像为目标图像生成高质量的分割掩模。具体来说，它们利用原始编码特征来计算参考图像和目标图像中补丁之间的通道维度余弦相似性，有效地为目标图像生成提示点或框，这是一种被称为匹配策略的技术。然而，仅依赖原始特征可能会引入偏差，并且对于如此复杂的任务来说缺乏鲁棒性。为了解决这个问题，我们深入研究了原始特征匹配中固有的特征交互和不均匀分布问题。在本文中，我们提出了一种简单且无需训练的方法来增强匹配策略的有效性和鲁棒性，而无需额外的计算成本（NubbleDrop）。核心概念涉及在匹配过程中随机丢弃特征通道（将它们设置为零），从而防止模型受到包含欺骗性信息的通道的影响。这种技术模仿了丢弃病理性小块，并且可以无缝应用于其他相似性计算场景。我们进行了一组全面的实验，考虑了广泛的因素，以证明我们提出的方法的有效性和有效性。我们的结果展示了通过这种简单直接的方法取得的重大改进。</paragraph>", "author": "Zhiyu Xu et.al.", "authors": "Zhiyu Xu, Qingliang Chen", "id": "2405.11476v1", "paper_url": "http://arxiv.org/abs/2405.11476v1", "repo": "null"}}