{"2409.12887": {"publish_time": "2024-09-19", "title": "Knowledge-Based Domain-Oriented Data Augmentation for Enhancing Unsupervised Sentence Embedding", "paper_summary": "Recently, unsupervised sentence embedding models have received significant\nattention in downstream natural language processing tasks. Using large language\nmodels (LLMs) for data augmentation has led to considerable improvements in\nprevious studies. Nevertheless, these strategies emphasize data augmentation\nwith extensive generic corpora, neglecting the consideration of few-shot domain\ndata. The synthesized data lacks fine-grained information and may introduce\nnegative sample noise. This study introduces a novel pipeline-based data\naugmentation method that leverages LLM to synthesize the domain-specific\ndataset. It produces both positive and negative samples through entity- and\nquantity-aware augmentation, utilizing an entity knowledge graph to synthesize\nsamples with fine-grained semantic distinctions, increasing training sample\ndiversity and relevance. We then present a Gaussian-decayed gradient-assisted\nContrastive Sentence Embedding (GCSE) model to reduce synthetic data noise and\nimprove model discrimination to reduce negative sample noise. Experimental\nresults demonstrate that our approach achieves state-of-the-art semantic\ntextual similarity performance with fewer synthetic data samples and lesser LLM\nparameters, demonstrating its efficiency and robustness in varied backbones.", "paper_summary_zh": "近来，无监督句子嵌入模型在自然语言处理的下游任务中受到广泛关注。在先前研究中，使用大型语言模型（LLM）进行数据扩充已带来显著的改进。然而，这些策略强调使用广泛的通用语料库进行数据扩充，忽略了对少量领域数据的考量。合成的资料缺乏细粒度信息，并可能引入负面样本噪声。本研究提出了一种新颖的基于管道的数据扩充方法，该方法利用 LLM 来合成特定于领域的资料集。它通过实体和数量感知扩充产生正面和负面样本，利用实体知识图谱来合成具有细粒度语义区别的样本，增加训练样本的多样性和相关性。然后，我们提出了一个高斯衰减梯度辅助对比句子嵌入（GCSE）模型，以减少合成数据噪声，并提高模型判别能力，以减少负面样本噪声。实验结果表明，我们的方法以更少的合成数据样本和更少的 LLM 参数实现了最先进的语义文本相似性性能，证明了其在各种骨干网中的效率和鲁棒性。", "author": "Peichao Lai et.al.", "authors": "Peichao Lai, Zhengfeng Zhang, Bin Cui", "id": "2409.12887v1", "paper_url": "http://arxiv.org/abs/2409.12887v1", "repo": "null"}}