{"2408.08670": {"publish_time": "2024-08-16", "title": "Adaptive Layer Selection for Efficient Vision Transformer Fine-Tuning", "paper_summary": "Recently, foundation models based on Vision Transformers (ViTs) have become\nwidely available. However, their fine-tuning process is highly\nresource-intensive, and it hinders their adoption in several edge or low-energy\napplications. To this end, in this paper we introduce an efficient fine-tuning\nmethod for ViTs called $\\textbf{ALaST}$ ($\\textit{Adaptive Layer Selection\nFine-Tuning for Vision Transformers}$) to speed up the fine-tuning process\nwhile reducing computational cost, memory load, and training time. Our approach\nis based on the observation that not all layers are equally critical during\nfine-tuning, and their importance varies depending on the current mini-batch.\nTherefore, at each fine-tuning step, we adaptively estimate the importance of\nall layers and we assign what we call ``compute budgets'' accordingly. Layers\nthat were allocated lower budgets are either trained with a reduced number of\ninput tokens or kept frozen. Freezing a layer reduces the computational cost\nand memory usage by preventing updates to its weights, while discarding tokens\nremoves redundant data, speeding up processing and reducing memory\nrequirements. We show that this adaptive compute allocation enables a\nnearly-optimal schedule for distributing computational resources across layers,\nresulting in substantial reductions in training time (up to 1.5x), FLOPs (up to\n2x), and memory load (up to 2x) compared to traditional full fine-tuning\napproaches. Additionally, it can be successfully combined with other\nparameter-efficient fine-tuning methods, such as LoRA.", "paper_summary_zh": "<paragraph>最近，基于视觉转换器 (ViT) 的基础模型已广泛可用。然而，它们的微调过程非常耗费资源，并且阻碍了它们在多个边缘或低能耗应用中的采用。为此，在本文中，我们介绍了一种称为 $\\textbf{ALaST}$（$\\textit{视觉转换器的自适应层选择微调}$）的 ViT 高效微调方法，以在降低计算成本、内存负载和训练时间的过程中加速微调过程。我们的方法基于这样的观察：并非所有层在微调过程中都同样关键，并且它们的重要性会根据当前的小批量而有所不同。因此，在每个微调步骤中，我们自适应地估计所有层的权重，并相应地分配我们所谓的 ``计算预算''。分配较低预算的层要么使用减少数量的输入标记进行训练，要么保持冻结。冻结层通过防止其权重的更新来降低计算成本和内存使用量，而丢弃标记则会删除冗余数据，从而加快处理速度并降低内存需求。我们表明，这种自适应计算分配能够为跨层分配计算资源制定近乎最优的调度，与传统的完全微调方法相比，可大幅减少训练时间（最多 1.5 倍）、FLOP（最多 2 倍）和内存负载（最多 2 倍）。此外，它可以成功地与其他参数高效的微调方法（例如 LoRA）结合使用。</paragraph>", "author": "Alessio Devoto et.al.", "authors": "Alessio Devoto, Federico Alvetreti, Jary Pomponi, Paolo Di Lorenzo, Pasquale Minervini, Simone Scardapane", "id": "2408.08670v1", "paper_url": "http://arxiv.org/abs/2408.08670v1", "repo": "null"}}