{"2412.18376": {"publish_time": "2024-12-24", "title": "Bidirectional Topic Matching: Quantifying Thematic Overlap Between Corpora Through Topic Modelling", "paper_summary": "This study introduces Bidirectional Topic Matching (BTM), a novel method for\ncross-corpus topic modeling that quantifies thematic overlap and divergence\nbetween corpora. BTM is a flexible framework that can incorporate various topic\nmodeling approaches, including BERTopic, Top2Vec, and Latent Dirichlet\nAllocation (LDA). BTM employs a dual-model approach, training separate topic\nmodels for each corpus and applying them reciprocally to enable comprehensive\ncross-corpus comparisons. This methodology facilitates the identification of\nshared themes and unique topics, providing nuanced insights into thematic\nrelationships. Validation against cosine similarity-based methods demonstrates\nthe robustness of BTM, with strong agreement metrics and distinct advantages in\nhandling outlier topics. A case study on climate news articles showcases BTM's\nutility, revealing significant thematic overlaps and distinctions between\ncorpora focused on climate change and climate action. BTM's flexibility and\nprecision make it a valuable tool for diverse applications, from political\ndiscourse analysis to interdisciplinary studies. By integrating shared and\nunique topic analyses, BTM offers a comprehensive framework for exploring\nthematic relationships, with potential extensions to multilingual and dynamic\ndatasets. This work highlights BTM's methodological contributions and its\ncapacity to advance discourse analysis across various domains.", "paper_summary_zh": "本研究引入了雙向主題匹配 (BTM)，這是一種跨語料庫主題建模的新方法，用於量化語料庫之間的主題重疊和差異。BTM 是一個靈活的框架，可以整合各種主題建模方法，包括 BERTopic、Top2Vec 和潛在狄利克雷分配 (LDA)。BTM 採用雙模型方法，針對每個語料庫訓練單獨的主題模型，並將它們互惠地應用於全面跨語料庫比較。這種方法有助於識別共用主題和獨特主題，從而提供對主題關係的細微見解。針對基於餘弦相似性的方法進行驗證，證明了 BTM 的穩健性，具有很強的一致性指標，並且在處理異常值主題方面具有顯著優勢。關於氣候新聞文章的案例研究展示了 BTM 的效用，揭示了專注於氣候變化和氣候行動的語料庫之間顯著的主題重疊和區別。BTM 的靈活性與精確性使其成為各種應用程序的寶貴工具，從政治話語分析到跨學科研究。通過整合共用和獨特的主題分析，BTM 為探索主題關係提供了一個全面的框架，並可能擴展到多語言和動態數據集。這項工作突出了 BTM 的方法論貢獻及其在各個領域推進話語分析的能力。", "author": "Raven Adam et.al.", "authors": "Raven Adam, Marie Lisa Kogler", "id": "2412.18376v1", "paper_url": "http://arxiv.org/abs/2412.18376v1", "repo": "null"}}