{"2411.04525": {"publish_time": "2024-11-07", "title": "GenJoin: Conditional Generative Plan-to-Plan Query Optimizer that Learns from Subplan Hints", "paper_summary": "Query optimization has become a research area where classical algorithms are\nbeing challenged by machine learning algorithms. At the same time, recent\ntrends in learned query optimizers have shown that it is prudent to take\nadvantage of decades of database research and augment classical query\noptimizers by shrinking the plan search space through different types of hints\n(e.g. by specifying the join type, scan type or the order of joins) rather than\ncompletely replacing the classical query optimizer with machine learning\nmodels. It is especially relevant for cases when classical optimizers cannot\nfully enumerate all logical and physical plans and, as an alternative, need to\nrely on less robust approaches like genetic algorithms. However, even\nsymbiotically learned query optimizers are hampered by the need for vast\namounts of training data, slow plan generation during inference and unstable\nresults across various workload conditions. In this paper, we present GenJoin -\na novel learned query optimizer that considers the query optimization problem\nas a generative task and is capable of learning from a random set of subplan\nhints to produce query plans that outperform the classical optimizer. GenJoin\nis the first learned query optimizer that significantly and consistently\noutperforms PostgreSQL as well as state-of-the-art methods on two well-known\nreal-world benchmarks across a variety of workloads using rigorous machine\nlearning evaluations.", "paper_summary_zh": "查詢最佳化已成為一個研究領域，其中古典演算法受到機器學習演算法的挑戰。同時，已學習查詢最佳化器的近期趨勢顯示，審慎利用數十年的資料庫研究和透過不同類型的提示（例如，透過指定連接類型、掃描類型或連接順序）來縮小計畫搜尋空間，而非完全以機器學習模型取代古典查詢最佳化器，是明智之舉。這對古典最佳化器無法完全列舉所有邏輯和實體計畫，且需要依賴遺傳演算法等較不穩健的方法作為替代方案的情況尤其相關。然而，即使是共生學習的查詢最佳化器也受到大量訓練資料需求、推論期間的計畫產生緩慢以及在各種工作負載條件下結果不穩定的阻礙。在本文中，我們提出 GenJoin，這是一個新穎的已學習查詢最佳化器，它將查詢最佳化問題視為生成任務，並能夠從一組隨機子計畫提示中學習，以產生優於古典最佳化器的查詢計畫。GenJoin 是第一個已學習查詢最佳化器，它顯著且持續優於 PostgreSQL，以及在使用嚴謹機器學習評估的各種工作負載中，於兩個著名的真實世界基準測試上的最新方法。", "author": "Pavel Sulimov et.al.", "authors": "Pavel Sulimov, Claude Lehmann, Kurt Stockinger", "id": "2411.04525v1", "paper_url": "http://arxiv.org/abs/2411.04525v1", "repo": "null"}}