{"2412.09919": {"publish_time": "2024-12-13", "title": "B-VLLM: A Vision Large Language Model with Balanced Spatio-Temporal Tokens", "paper_summary": "Recently, Vision Large Language Models (VLLMs) integrated with vision\nencoders have shown promising performance in vision understanding. The key of\nVLLMs is to encode visual content into sequences of visual tokens, enabling\nVLLMs to simultaneously process both visual and textual content. However,\nunderstanding videos, especially long videos, remain a challenge to VLLMs as\nthe number of visual tokens grows rapidly when encoding videos, resulting in\nthe risk of exceeding the context window of VLLMs and introducing heavy\ncomputation burden. To restrict the number of visual tokens, existing VLLMs\neither: (1) uniformly downsample videos into a fixed number of frames or (2)\nreducing the number of visual tokens encoded from each frame. We argue the\nformer solution neglects the rich temporal cue in videos and the later\noverlooks the spatial details in each frame. In this work, we present\nBalanced-VLLM (B-VLLM): a novel VLLM framework that aims to effectively\nleverage task relevant spatio-temporal cues while restricting the number of\nvisual tokens under the VLLM context window length. At the core of our method,\nwe devise a text-conditioned adaptive frame selection module to identify frames\nrelevant to the visual understanding task. The selected frames are then\nde-duplicated using a temporal frame token merging technique. The visual tokens\nof the selected frames are processed through a spatial token sampling module\nand an optional spatial token merging strategy to achieve precise control over\nthe token count. Experimental results show that B-VLLM is effective in\nbalancing the number of frames and visual tokens in video understanding,\nyielding superior performance on various video understanding benchmarks. Our\ncode is available at https://github.com/zhuqiangLu/B-VLLM.", "paper_summary_zh": "<paragraph>最近，结合视觉编码器的视觉大型语言模型 (VLLM) 在视觉理解中展现了令人满意的性能。VLLM 的关键在于将视觉内容编码成视觉标记序列，让 VLLM 能够同时处理视觉和文本内容。然而，理解视频，尤其是长视频，对于 VLLM 来说仍然是一个挑战，因为在对视频进行编码时，视觉标记的数量会迅速增长，从而导致超出 VLLM 的上下文窗口并带来沉重的计算负担的风险。为了限制视觉标记的数量，现有的 VLLM 要么：(1) 将视频均匀降采样成固定数量的帧，要么：(2) 减少从每帧编码的视觉标记数量。我们认为前一种解决方案忽略了视频中丰富的时序线索，而后一种解决方案忽略了每帧中的空间细节。在这项工作中，我们提出了平衡 VLLM (B-VLLM)：一种新颖的 VLLM 框架，旨在有效利用与任务相关的时空线索，同时限制 VLLM 上下文窗口长度下的视觉标记数量。在我们的方法的核心，我们设计了一个文本条件自适应帧选择模块来识别与视觉理解任务相关的帧。然后使用时序帧标记合并技术对选定的帧进行去重处理。选定帧的视觉标记通过空间标记采样模块和可选的空间标记合并策略进行处理，以实现对标记计数的精确控制。实验结果表明，B-VLLM 在平衡视频理解中的帧数和视觉标记数量方面是有效的，在各种视频理解基准上产生了更优异的性能。我们的代码可在 https://github.com/zhuqiangLu/B-VLLM 获得。</paragraph>", "author": "Zhuqiang Lu et.al.", "authors": "Zhuqiang Lu, Zhenfei Yin, Mengwei He, Zhihui Wang, Zicheng Liu, Zhiyong Wang, Kun Hu", "id": "2412.09919v1", "paper_url": "http://arxiv.org/abs/2412.09919v1", "repo": "null"}}