{"2409.10502": {"publish_time": "2024-09-16", "title": "Causal Language Modeling Can Elicit Search and Reasoning Capabilities on Logic Puzzles", "paper_summary": "Causal language modeling using the Transformer architecture has yielded\nremarkable capabilities in Large Language Models (LLMs) over the last few\nyears. However, the extent to which fundamental search and reasoning\ncapabilities emerged within LLMs remains a topic of ongoing debate. In this\nwork, we study if causal language modeling can learn a complex task such as\nsolving Sudoku puzzles. To solve a Sudoku, the model is first required to\nsearch over all empty cells of the puzzle to decide on a cell to fill and then\napply an appropriate strategy to fill the decided cell. Sometimes, the\napplication of a strategy only results in thinning down the possible values in\na cell rather than concluding the exact value of the cell. In such cases,\nmultiple strategies are applied one after the other to fill a single cell. We\nobserve that Transformer models trained on this synthetic task can indeed learn\nto solve Sudokus (our model solves $94.21\\%$ of the puzzles fully correctly)\nwhen trained on a logical sequence of steps taken by a solver. We find that\ntraining Transformers with the logical sequence of steps is necessary and\nwithout such training, they fail to learn Sudoku. We also extend our analysis\nto Zebra puzzles (known as Einstein puzzles) and show that the model solves\n$92.04 \\%$ of the puzzles fully correctly. In addition, we study the internal\nrepresentations of the trained Transformer and find that through linear\nprobing, we can decode information about the set of possible values in any\ngiven cell from them, pointing to the presence of a strong reasoning engine\nimplicit in the Transformer weights.", "paper_summary_zh": "<paragraph>在过去几年中，使用 Transformer 架构的因果语言建模在大型语言模型 (LLM) 中产生了非凡的能力。然而，LLM 中基本搜索和推理能力的程度如何仍然是一个持续争论的话题。在这项工作中，我们研究因果语言建模是否可以学习一项复杂的任务，例如解决数独谜题。要解决数独谜题，首先要求模型搜索谜题的所有空单元格，以决定要填写的单元格，然后应用适当的策略来填充分配的单元格。有时，策略的应用只会减少单元格中的可能值，而不是得出单元格的确切值。在这种情况下，多个策略一个接一个地应用于填充单个单元格。我们观察到，在此合成任务上训练的 Transformer 模型确实可以学会解决数独谜题（我们的模型完全正确地解决了 94.21% 的谜题），当根据解决者采取的逻辑步骤序列进行训练时。我们发现，使用逻辑步骤序列训练 Transformer 是必要的，如果没有这样的训练，它们将无法学习数独。我们还将我们的分析扩展到斑马谜题（称为爱因斯坦谜题），并表明该模型完全正确地解决了 92.04% 的谜题。此外，我们研究了经过训练的 Transformer 的内部表示，并发现通过线性探测，我们可以从中解码有关任何给定单元格中可能值集合的信息，这表明 Transformer 权重中存在一个强大的推理引擎。</paragraph>", "author": "Kulin Shah et.al.", "authors": "Kulin Shah, Nishanth Dikkala, Xin Wang, Rina Panigrahy", "id": "2409.10502v1", "paper_url": "http://arxiv.org/abs/2409.10502v1", "repo": "null"}}