{"2409.16024": {"publish_time": "2024-09-24", "title": "Bridging Environments and Language with Rendering Functions and Vision-Language Models", "paper_summary": "Vision-language models (VLMs) have tremendous potential for grounding\nlanguage, and thus enabling language-conditioned agents (LCAs) to perform\ndiverse tasks specified with text. This has motivated the study of LCAs based\non reinforcement learning (RL) with rewards given by rendering images of an\nenvironment and evaluating those images with VLMs. If single-task RL is\nemployed, such approaches are limited by the cost and time required to train a\npolicy for each new task. Multi-task RL (MTRL) is a natural alternative, but\nrequires a carefully designed corpus of training tasks and does not always\ngeneralize reliably to new tasks. Therefore, this paper introduces a novel\ndecomposition of the problem of building an LCA: first find an environment\nconfiguration that has a high VLM score for text describing a task; then use a\n(pretrained) goal-conditioned policy to reach that configuration. We also\nexplore several enhancements to the speed and quality of VLM-based LCAs,\nnotably, the use of distilled models, and the evaluation of configurations from\nmultiple viewpoints to resolve the ambiguities inherent in a single 2D view. We\ndemonstrate our approach on the Humanoid environment, showing that it results\nin LCAs that outperform MTRL baselines in zero-shot generalization, without\nrequiring any textual task descriptions or other forms of environment-specific\nannotation during training.\n  Videos and an interactive demo can be found at\nhttps://europe.naverlabs.com/text2control", "paper_summary_zh": "視覺語言模型 (VLM) 具有將語言基礎化的巨大潛力，從而使語言條件代理 (LCA) 能夠執行用文字指定的各種任務。這促使了基於強化學習 (RL) 的 LCA 的研究，其獎勵是通過渲染環境的影像並使用 VLM 評估這些影像而給予的。如果採用單一任務 RL，此類方法會受到訓練每個新任務的策略所需的成本和時間的限制。多任務 RL (MTRL) 是一種自然的替代方案，但需要仔細設計的訓練任務語料庫，並且並不總是能可靠地推廣到新任務。因此，本文介紹了一個新穎的 LCA 建構問題分解：首先找到一個環境配置，其具有描述任務文字的高 VLM 分數；然後使用（預訓練的）目標條件策略來達成該配置。我們還探索了基於 VLM 的 LCA 的速度和品質的幾項強化，特別是蒸餾模型的使用，以及從多個視點評估配置以解決單一 2D 視圖中固有的模糊性。我們在類人環境中展示了我們的做法，表明它產生的 LCA 在零次學習泛化中優於 MTRL 基準，而無需在訓練期間要求任何文字任務描述或其他形式的環境特定註解。可以在 https://europe.naverlabs.com/text2control 找到影片和互動式示範。", "author": "Theo Cachet et.al.", "authors": "Theo Cachet, Christopher R. Dance, Olivier Sigaud", "id": "2409.16024v1", "paper_url": "http://arxiv.org/abs/2409.16024v1", "repo": "null"}}