{"2409.07078": {"publish_time": "2024-09-11", "title": "Multimodal Emotion Recognition with Vision-language Prompting and Modality Dropout", "paper_summary": "In this paper, we present our solution for the Second Multimodal Emotion\nRecognition Challenge Track 1(MER2024-SEMI). To enhance the accuracy and\ngeneralization performance of emotion recognition, we propose several methods\nfor Multimodal Emotion Recognition. Firstly, we introduce EmoVCLIP, a model\nfine-tuned based on CLIP using vision-language prompt learning, designed for\nvideo-based emotion recognition tasks. By leveraging prompt learning on CLIP,\nEmoVCLIP improves the performance of pre-trained CLIP on emotional videos.\nAdditionally, to address the issue of modality dependence in multimodal fusion,\nwe employ modality dropout for robust information fusion. Furthermore, to aid\nBaichuan in better extracting emotional information, we suggest using GPT-4 as\nthe prompt for Baichuan. Lastly, we utilize a self-training strategy to\nleverage unlabeled videos. In this process, we use unlabeled videos with\nhigh-confidence pseudo-labels generated by our model and incorporate them into\nthe training set. Experimental results demonstrate that our model ranks 1st in\nthe MER2024-SEMI track, achieving an accuracy of 90.15% on the test set.", "paper_summary_zh": "在本文中，我們提出我們對第二屆多模態情緒識別挑戰賽軌道 1 (MER2024-SEMI) 的解決方案。為了增強情緒識別的準確性和泛化效能，我們針對多模態情緒識別提出幾種方法。首先，我們介紹 EmoVCLIP，一種基於 CLIP 微調的模型，使用視覺語言提示學習，專為基於影片的情緒識別任務而設計。透過在 CLIP 上利用提示學習，EmoVCLIP 改善了預訓練 CLIP 在情緒影片上的效能。此外，為了解決多模態融合中的模態依賴性問題，我們採用模態中斷，以實現穩健的資訊融合。此外，為了協助百川更好地擷取情緒資訊，我們建議使用 GPT-4 作為百川的提示。最後，我們利用自訓練策略來利用未標記的影片。在此過程中，我們使用未標記的影片，其中包含由我們的模型產生的高可信度偽標籤，並將它們納入訓練組。實驗結果表明，我們的模型在 MER2024-SEMI 軌道中排名第一，在測試組上達到 90.15% 的準確度。", "author": "Anbin QI et.al.", "authors": "Anbin QI, Zhongliang Liu, Xinyong Zhou, Jinba Xiao, Fengrun Zhang, Qi Gan, Ming Tao, Gaozheng Zhang, Lu Zhang", "id": "2409.07078v1", "paper_url": "http://arxiv.org/abs/2409.07078v1", "repo": "null"}}