{"2405.10376": {"publish_time": "2024-05-16", "title": "Dealing Doubt: Unveiling Threat Models in Gradient Inversion Attacks under Federated Learning, A Survey and Taxonomy", "paper_summary": "Federated Learning (FL) has emerged as a leading paradigm for decentralized,\nprivacy preserving machine learning training. However, recent research on\ngradient inversion attacks (GIAs) have shown that gradient updates in FL can\nleak information on private training samples. While existing surveys on GIAs\nhave focused on the honest-but-curious server threat model, there is a dearth\nof research categorizing attacks under the realistic and far more\nprivacy-infringing cases of malicious servers and clients. In this paper, we\npresent a survey and novel taxonomy of GIAs that emphasize FL threat models,\nparticularly that of malicious servers and clients. We first formally define\nGIAs and contrast conventional attacks with the malicious attacker. We then\nsummarize existing honest-but-curious attack strategies, corresponding\ndefenses, and evaluation metrics. Critically, we dive into attacks with\nmalicious servers and clients to highlight how they break existing FL defenses,\nfocusing specifically on reconstruction methods, target model architectures,\ntarget data, and evaluation metrics. Lastly, we discuss open problems and\nfuture research directions.", "paper_summary_zh": "聯邦學習 (FL) 已成為分散式、隱私保護機器學習訓練的領先範例。然而，最近對梯度反轉攻擊 (GIA) 的研究表明，FL 中的梯度更新可能會洩露私人訓練樣本的資訊。雖然現有的 GIA 調查著重於誠實但好奇的伺服器威脅模型，但對於惡意伺服器和客戶端這種更具現實性和更侵犯隱私的情況下的攻擊分類，卻缺乏研究。在本文中，我們提出了一項強調 FL 威脅模型（特別是惡意伺服器和客戶端）的 GIA 調查和新分類法。我們首先正式定義 GIA，並將傳統攻擊與惡意攻擊者進行對比。然後，我們總結現有的誠實但好奇的攻擊策略、相應的防禦措施和評估指標。至關重要的是，我們深入探討惡意伺服器和客戶端的攻擊，以強調它們如何突破現有的 FL 防禦措施，特別關注重建方法、目標模型架構、目標資料和評估指標。最後，我們討論了開放問題和未來的研究方向。", "author": "Yichuan Shi et.al.", "authors": "Yichuan Shi, Olivera Kotevska, Viktor Reshniak, Abhishek Singh, Ramesh Raskar", "id": "2405.10376v1", "paper_url": "http://arxiv.org/abs/2405.10376v1", "repo": "null"}}