{"2405.14385": {"publish_time": "2024-05-23", "title": "Emotion Identification for French in Written Texts: Considering their Modes of Expression as a Step Towards Text Complexity Analysis", "paper_summary": "The objective of this paper is to predict (A) whether a sentence in a written\ntext expresses an emotion, (B) the mode(s) in which it is expressed, (C)\nwhether it is basic or complex, and (D) its emotional category.\n  One of our major contributions, through a dataset and a model, is to\nintegrate the fact that an emotion can be expressed in different modes: from a\ndirect mode, essentially lexicalized, to a more indirect mode, where emotions\nwill only be suggested, a mode that NLP approaches generally don't take into\naccount.\n  Another originality is that the scope is on written texts, as opposed usual\nwork focusing on conversational (often multi-modal) data. In this context,\nmodes of expression are seen as a factor towards the automatic analysis of\ncomplexity in texts.\n  Experiments on French texts show acceptable results compared to the human\nannotators' agreement, and outperforming results compared to using a large\nlanguage model with in-context learning (i.e. no fine-tuning).", "paper_summary_zh": "本文的目的是预测 (A) 书面文本中的句子是否表达情感，(B) 表达情感的方式，(C) 情感是基本还是复杂，以及 (D) 情感类别。\n我们的主要贡献之一，通过数据集和模型，是整合这样一个事实：情感可以通过不同的方式表达：从本质上词语化的直接方式，到更间接的方式，其中情感只会得到暗示，这是一种 NLP 方法通常不会考虑的方式。\n另一个新颖之处在于，研究范围是书面文本，而不是通常专注于会话（通常是多模态）数据的研究。在此背景下，表达方式被视为自动分析文本复杂性的一个因素。\n与人工注释者的一致性相比，法语文本的实验显示出可接受的结果，并且与使用具有上下文学习的大语言模型（即无微调）相比，结果表现优异。", "author": "Aline Étienne et.al.", "authors": "Aline Étienne, Delphine Battistelli, Gwénolé Lecorvé", "id": "2405.14385v1", "paper_url": "http://arxiv.org/abs/2405.14385v1", "repo": "null"}}