{"2404.10975": {"publish_time": "2024-04-17", "title": "Procedural Dilemma Generation for Evaluating Moral Reasoning in Humans and Language Models", "paper_summary": "As AI systems like language models are increasingly integrated into\ndecision-making processes affecting people's lives, it's critical to ensure\nthat these systems have sound moral reasoning. To test whether they do, we need\nto develop systematic evaluations. We provide a framework that uses a language\nmodel to translate causal graphs that capture key aspects of moral dilemmas\ninto prompt templates. With this framework, we procedurally generated a large\nand diverse set of moral dilemmas -- the OffTheRails benchmark -- consisting of\n50 scenarios and 400 unique test items. We collected moral permissibility and\nintention judgments from human participants for a subset of our items and\ncompared these judgments to those from two language models (GPT-4 and Claude-2)\nacross eight conditions. We find that moral dilemmas in which the harm is a\nnecessary means (as compared to a side effect) resulted in lower permissibility\nand higher intention ratings for both participants and language models. The\nsame pattern was observed for evitable versus inevitable harmful outcomes.\nHowever, there was no clear effect of whether the harm resulted from an agent's\naction versus from having omitted to act. We discuss limitations of our prompt\ngeneration pipeline and opportunities for improving scenarios to increase the\nstrength of experimental effects.", "paper_summary_zh": "隨著像語言模型的人工智慧系統日益整合到影響人們生活的決策制定過程中，確保這些系統具有健全的道德推理至關重要。為了測試它們是否具備這樣的能力，我們需要制定系統性的評估。我們提供了一個框架，該框架使用語言模型來轉換因果圖，這些因果圖捕捉了道德困境的關鍵方面，並轉換成提示範本。有了這個框架，我們程序化地生成了一組龐大且多樣化的道德困境——OffTheRails 基準——包含 50 個場景和 400 個獨特的測試項目。我們為我們項目的子集收集了人類參與者的道德容許性和意圖判斷，並將這些判斷與來自兩個語言模型（GPT-4 和 Claude-2）在八個條件下的判斷進行了比較。我們發現，在傷害是必要手段（與副作用相比）的道德困境中，參與者和語言模型的容許度較低，意圖評分較高。對於可避免與不可避免的有害結果，也觀察到了相同的模式。然而，傷害是源於代理人的行為還是源於疏忽行為，並沒有明顯的影響。我們討論了提示生成管線的限制，以及改進場景以增強實驗效果強度的機會。", "author": "Jan-Philipp Fränken et.al.", "authors": "Jan-Philipp Fränken, Kanishk Gandhi, Tori Qiu, Ayesha Khawaja, Noah D. Goodman, Tobias Gerstenberg", "id": "2404.10975v1", "paper_url": "http://arxiv.org/abs/2404.10975v1", "repo": "https://github.com/cicl-stanford/moral-evals"}}