{"2406.17377": {"publish_time": "2024-06-25", "title": "A Three-Pronged Approach to Cross-Lingual Adaptation with Multilingual LLMs", "paper_summary": "Low-resource languages, by its very definition, tend to be under represented\nin the pre-training corpora of Large Language Models. In this work, we\ninvestigate three low-resource cross-lingual approaches that enable an LLM\nadapt to tasks in previously unseen languages. Llama-2 is an LLM where Indic\nlanguages, among many other language families, contribute to less than\n$0.005\\%$ of the total $2$ trillion token pre-training corpora. In this work,\nwe experiment with the English-dominated Llama-2 for cross-lingual transfer to\nthree Indic languages, Bengali, Hindi, and Tamil as target languages. We study\nthree approaches for cross-lingual transfer, under ICL and fine-tuning. One, we\nfind that adding additional supervisory signals via a dominant language in the\nLLM, leads to improvements, both under in-context learning and fine-tuning.\nTwo, adapting the target languages to word reordering may be beneficial under\nICL, but its impact diminishes with fine tuning. Finally, continued\npre-training in one low-resource language can improve model performance for\nother related low-resource languages.", "paper_summary_zh": "低資源語言，顧名思義，在大型語言模型的預訓練語料庫中往往代表性不足。在這項工作中，我們探討了三種低資源跨語言方法，這些方法使 LLM 能夠適應以前未見語言中的任務。Llama-2 是一種 LLM，其中印度語言（以及許多其他語言系列）在總計 2 兆個 token 的預訓練語料庫中所佔比例不到 0.005%。在這項工作中，我們嘗試使用以英語為主的 Llama-2 進行跨語言轉移，目標語言為三種印度語言：孟加拉語、印地語和泰米爾語。我們研究了跨語言轉移的三種方法，包括 ICL 和微調。一、我們發現通過 LLM 中的主導語言添加額外的監督信號，無論是在情境學習還是微調下，都能帶來改進。二、在 ICL 下，將目標語言適應詞序調整可能是有益的，但其影響會隨著微調而減弱。最後，在一個低資源語言中持續預訓練可以提高模型對其他相關低資源語言的性能。", "author": "Vaibhav Singh et.al.", "authors": "Vaibhav Singh, Amrith Krishna, Karthika NJ, Ganesh Ramakrishnan", "id": "2406.17377v1", "paper_url": "http://arxiv.org/abs/2406.17377v1", "repo": "null"}}