{"2501.08502": {"publish_time": "2025-01-15", "title": "Adapting Whisper for Regional Dialects: Enhancing Public Services for Vulnerable Populations in the United Kingdom", "paper_summary": "We collect novel data in the public service domain to evaluate the capability\nof the state-of-the-art automatic speech recognition (ASR) models in capturing\nregional differences in accents in the United Kingdom (UK), specifically\nfocusing on two accents from Scotland with distinct dialects. This study\naddresses real-world problems where biased ASR models can lead to\nmiscommunication in public services, disadvantaging individuals with regional\naccents particularly those in vulnerable populations. We first examine the\nout-of-the-box performance of the Whisper large-v3 model on a baseline dataset\nand our data. We then explore the impact of fine-tuning Whisper on the\nperformance in the two UK regions and investigate the effectiveness of existing\nmodel evaluation techniques for our real-world application through manual\ninspection of model errors. We observe that the Whisper model has a higher word\nerror rate (WER) on our test datasets compared to the baseline data and\nfine-tuning on a given data improves performance on the test dataset with the\nsame domain and accent. The fine-tuned models also appear to show improved\nperformance when applied to the test data outside of the region it was trained\non suggesting that fine-tuned models may be transferable within parts of the\nUK. Our manual analysis of model outputs reveals the benefits and drawbacks of\nusing WER as an evaluation metric and fine-tuning to adapt to regional\ndialects.", "paper_summary_zh": "我們在公共服務領域收集新穎數據，以評估最先進的自動語音辨識 (ASR) 模型在捕捉英國區域口音差異的能力，特別專注於蘇格蘭兩個具有不同方言的口音。這項研究探討了現實世界中的問題，其中有偏差的 ASR 模型可能導致公共服務中的溝通不良，特別是對弱勢群體中具有區域口音的個人造成不利影響。我們首先檢查 Whisper large-v3 模型在基線數據集和我們數據上的開箱即用效能。然後，我們探討微調 Whisper 對英國兩個地區效能的影響，並透過手動檢查模型錯誤來探討現有模型評估技術對我們現實世界應用程式的有效性。我們觀察到，與基線數據相比，Whisper 模型在我們的測試數據集上具有較高的字元錯誤率 (WER)，並且在特定數據上進行微調會改善具有相同領域和口音的測試數據集上的效能。微調後的模型在應用於訓練區域以外的測試數據時，似乎也顯示出改善的效能，這表明微調後的模型可能可以在英國部分地區轉移。我們對模型輸出的手動分析揭示了使用 WER 作為評估指標和微調以適應區域方言的優缺點。", "author": "Melissa Torgbi et.al.", "authors": "Melissa Torgbi, Andrew Clayman, Jordan J. Speight, Harish Tayyar Madabushi", "id": "2501.08502v1", "paper_url": "http://arxiv.org/abs/2501.08502v1", "repo": "null"}}