{"2502.09885": {"publish_time": "2025-02-14", "title": "Comprehensive Review of Neural Differential Equations for Time Series Analysis", "paper_summary": "Time series modeling and analysis has become critical in various domains.\nConventional methods such as RNNs and Transformers, while effective for\ndiscrete-time and regularly sampled data, face significant challenges in\ncapturing the continuous dynamics and irregular sampling patterns inherent in\nreal-world scenarios. Neural Differential Equations (NDEs) represent a paradigm\nshift by combining the flexibility of neural networks with the mathematical\nrigor of differential equations. This paper presents a comprehensive review of\nNDE-based methods for time series analysis, including neural ordinary\ndifferential equations, neural controlled differential equations, and neural\nstochastic differential equations. We provide a detailed discussion of their\nmathematical formulations, numerical methods, and applications, highlighting\ntheir ability to model continuous-time dynamics. Furthermore, we address key\nchallenges and future research directions. This survey serves as a foundation\nfor researchers and practitioners seeking to leverage NDEs for advanced time\nseries analysis.", "paper_summary_zh": "時間序列建模和分析已在各個領域中變得至關重要。\nRNN 和 Transformer 等傳統方法雖然對離散時間和定期採樣資料有效，但在捕捉現實世界場景中固有的連續動態和不規則採樣模式方面面臨重大挑戰。神經微分方程式 (NDE) 代表了一種典範轉變，它結合了神經網路的靈活性與微分方程式的數學嚴謹性。本文全面回顧了基於 NDE 的時間序列分析方法，包括神經常微分方程式、神經控制微分方程式和神經隨機微分方程式。我們詳細討論了它們的數學公式、數值方法和應用，強調它們對連續時間動態建模的能力。此外，我們還解決了關鍵挑戰和未來的研究方向。這項調查為尋求利用 NDE 進行高級時間序列分析的研究人員和從業者奠定了基礎。", "author": "YongKyung Oh et.al.", "authors": "YongKyung Oh, Seungsu Kam, Jonghun Lee, Dong-Young Lim, Sungil Kim, Alex Bui", "id": "2502.09885v1", "paper_url": "http://arxiv.org/abs/2502.09885v1", "repo": "null"}}