{"2409.09844": {"publish_time": "2024-09-15", "title": "A Benchmark Dataset with Larger Context for Non-Factoid Question Answering over Islamic Text", "paper_summary": "Accessing and comprehending religious texts, particularly the Quran (the\nsacred scripture of Islam) and Ahadith (the corpus of the sayings or traditions\nof the Prophet Muhammad), in today's digital era necessitates efficient and\naccurate Question-Answering (QA) systems. Yet, the scarcity of QA systems\ntailored specifically to the detailed nature of inquiries about the Quranic\nTafsir (explanation, interpretation, context of Quran for clarity) and Ahadith\nposes significant challenges. To address this gap, we introduce a comprehensive\ndataset meticulously crafted for QA purposes within the domain of Quranic\nTafsir and Ahadith. This dataset comprises a robust collection of over 73,000\nquestion-answer pairs, standing as the largest reported dataset in this\nspecialized domain. Importantly, both questions and answers within the dataset\nare meticulously enriched with contextual information, serving as invaluable\nresources for training and evaluating tailored QA systems. However, while this\npaper highlights the dataset's contributions and establishes a benchmark for\nevaluating QA performance in the Quran and Ahadith domains, our subsequent\nhuman evaluation uncovered critical insights regarding the limitations of\nexisting automatic evaluation techniques. The discrepancy between automatic\nevaluation metrics, such as ROUGE scores, and human assessments became\napparent. The human evaluation indicated significant disparities: the model's\nverdict consistency with expert scholars ranged between 11% to 20%, while its\ncontextual understanding spanned a broader spectrum of 50% to 90%. These\nfindings underscore the necessity for evaluation techniques that capture the\nnuances and complexities inherent in understanding religious texts, surpassing\nthe limitations of traditional automatic metrics.", "paper_summary_zh": "<paragraph>在當今的數位時代，存取和理解宗教文本，特別是古蘭經（伊斯蘭教的聖典）和聖訓（先知穆罕默德的言論或傳統），需要有效且準確的問答（QA）系統。然而，專門針對古蘭經註釋（解釋、詮釋、古蘭經的背景以求清晰）和聖訓的詳細詢問性質而量身打造的 QA 系統相當稀少，這構成了重大的挑戰。為了解決這個差距，我們在古蘭經註釋和聖訓的領域中，針對 QA 目的精心製作了一個全面的資料集。這個資料集包含超過 73,000 個問題回答對，是這個專業領域中已報告的最大資料集。重要的是，資料集中的問題和答案都經過仔細地豐富了背景資訊，作為訓練和評估量身打造的 QA 系統的寶貴資源。然而，儘管本文突出了資料集的貢獻，並為評估古蘭經和聖訓領域中的 QA 效能建立了一個基準，我們後續的人類評估揭露了有關現有自動評估技術的限制的重要見解。自動評估指標（例如 ROUGE 分數）和人類評估之間的差異變得明顯。人類評估顯示出顯著的差異：模型的判決與專家學者的吻合度在 11% 到 20% 之間，而其背景理解則涵蓋了 50% 到 90% 的更廣泛範圍。這些發現強調了評估技術的必要性，這些技術可以捕捉理解宗教文本中固有的細微差別和複雜性，超越傳統自動指標的限制。</paragraph>", "author": "Faiza Qamar et.al.", "authors": "Faiza Qamar, Seemab Latif, Rabia Latif", "id": "2409.09844v1", "paper_url": "http://arxiv.org/abs/2409.09844v1", "repo": "null"}}