{"2411.09003": {"publish_time": "2024-11-13", "title": "Refusal in LLMs is an Affine Function", "paper_summary": "We propose affine concept editing (ACE) as an approach for steering language\nmodels' behavior by intervening directly in activations. We begin with an\naffine decomposition of model activation vectors and show that prior methods\nfor steering model behavior correspond to subsets of terms of this\ndecomposition. We then provide a derivation of ACE and test it on refusal using\nLlama 3 8B and Hermes Eagle RWKV v5. ACE ultimately combines affine subspace\nprojection and activation addition to reliably control the model's refusal\nresponses across prompt types. We evaluate the results using LLM-based scoring\non a collection of harmful and harmless prompts. Our experiments demonstrate\nthat ACE consistently achieves more precise control over model behavior and\ngeneralizes to models where directional ablation via affine subspace projection\nalone produces incoherent outputs. Code for reproducing our results is\navailable at https://github.com/EleutherAI/steering-llama3 .", "paper_summary_zh": "我們提出仿射概念編輯 (ACE)，作為一種透過直接介入激勵來引導語言模型行為的方法。我們從模型激勵向量的仿射分解開始，並顯示出引導模型行為的先前方法對應於此分解的子集。然後，我們提供 ACE 的推導，並使用 Llama 3 8B 和 Hermes Eagle RWKV v5 對拒絕進行測試。ACE 最終結合仿射子空間投影和激勵加法，以可靠地控制模型在提示類型中的拒絕回應。我們使用基於 LLM 的評分對有害和無害提示的集合進行評估。我們的實驗表明，ACE 持續對模型行為實現更精確的控制，並推廣到僅透過仿射子空間投影進行方向性消融會產生不連貫輸出的模型。可用於重現我們結果的程式碼位於 https://github.com/EleutherAI/steering-llama3。", "author": "Thomas Marshall et.al.", "authors": "Thomas Marshall, Adam Scherlis, Nora Belrose", "id": "2411.09003v1", "paper_url": "http://arxiv.org/abs/2411.09003v1", "repo": "https://github.com/eleutherai/steering-llama3"}}