{"2410.07779": {"publish_time": "2024-10-10", "title": "Modeling User Preferences with Automatic Metrics: Creating a High-Quality Preference Dataset for Machine Translation", "paper_summary": "Alignment with human preferences is an important step in developing accurate\nand safe large language models. This is no exception in machine translation\n(MT), where better handling of language nuances and context-specific variations\nleads to improved quality. However, preference data based on human feedback can\nbe very expensive to obtain and curate at a large scale. Automatic metrics, on\nthe other hand, can induce preferences, but they might not match human\nexpectations perfectly. In this paper, we propose an approach that leverages\nthe best of both worlds. We first collect sentence-level quality assessments\nfrom professional linguists on translations generated by multiple high-quality\nMT systems and evaluate the ability of current automatic metrics to recover\nthese preferences. We then use this analysis to curate a new dataset, MT-Pref\n(metric induced translation preference) dataset, which comprises 18k instances\ncovering 18 language directions, using texts sourced from multiple domains\npost-2022. We show that aligning TOWER models on MT-Pref significantly improves\ntranslation quality on WMT23 and FLORES benchmarks.", "paper_summary_zh": "與人類偏好一致是開發準確且安全的巨量語言模型的重要步驟。機器翻譯 (MT) 也不例外，其中對語言差異細微差別和特定於脈絡的變化的更好處理會提升品質。然而，基於人類回饋的偏好資料在取得和整理上可能非常昂貴。另一方面，自動化指標可以誘發偏好，但它們可能無法完美符合人類的期望。在本文中，我們提出了一種結合兩全其美的做法。我們首先從專業語言學家收集由多個高品質 MT 系統產生的翻譯的句子層級品質評估，並評估當前自動化指標恢復這些偏好的能力。然後，我們使用此分析整理一個新的資料集 MT-Pref（指標誘發的翻譯偏好）資料集，其中包含 18k 個實例，涵蓋 18 種語言方向，使用來自 2022 年之後多個網域的文字。我們展示了在 MT-Pref 上調整 TOWER 模型會在 WMT23 和 FLORES 基準上顯著提升翻譯品質。", "author": "Sweta Agrawal et.al.", "authors": "Sweta Agrawal, José G. C. de Souza, Ricardo Rei, António Farinhas, Gonçalo Faria, Patrick Fernandes, Nuno M Guerreiro, Andre Martins", "id": "2410.07779v1", "paper_url": "http://arxiv.org/abs/2410.07779v1", "repo": "null"}}