{"2412.11643": {"publish_time": "2024-12-16", "title": "A comprehensive GeoAI review: Progress, Challenges and Outlooks", "paper_summary": "In recent years, Geospatial Artificial Intelligence (GeoAI) has gained\ntraction in the most relevant research works and industrial applications, while\nalso becoming involved in various fields of use. This paper offers a\ncomprehensive review of GeoAI as a synergistic concept applying Artificial\nIntelligence (AI) methods and models to geospatial data. A preliminary study is\ncarried out, identifying the methodology of the work, the research motivations,\nthe issues and the directions to be tracked, followed by exploring how GeoAI\ncan be used in various interesting fields of application, such as precision\nagriculture, environmental monitoring, disaster management and urban planning.\nNext, a statistical and semantic analysis is carried out, followed by a clear\nand precise presentation of the challenges facing GeoAI. Then, a concrete\nexploration of the future prospects is provided, based on several informations\ngathered during the census. To sum up, this paper provides a complete overview\nof the correlation between AI and the geospatial domain, while mentioning the\nresearches conducted in this context, and emphasizing the close relationship\nlinking GeoAI with other advanced concepts such as geographic information\nsystems (GIS) and large-scale geospatial data, known as big geodata. This will\nenable researchers and scientific community to assess the state of progress in\nthis promising field, and will help other interested parties to gain a better\nunderstanding of the issues involved.", "paper_summary_zh": "近年來，地理空間人工智慧 (GeoAI) 在最相關的研究工作和產業應用中獲得關注，同時也參與到各個不同的使用領域中。本文提供了一個全面的 GeoAI 綜述，作為一個將人工智慧 (AI) 方法和模型應用於地理空間資料的綜效概念。進行了一項初步研究，識別了工作的研究方法、研究動機、問題和待追蹤的方向，接著探討了 GeoAI 如何用於各種有趣的應用領域，例如精準農業、環境監測、災害管理和都市規劃。接下來，進行了統計和語義分析，接著清楚且精確地說明了 GeoAI 面臨的挑戰。然後，根據普查期間收集的若干資訊，具體探討了未來前景。總而言之，本文提供了 AI 與地理空間領域之間關聯性的完整概觀，同時提及在此脈絡下進行的研究，並強調 GeoAI 與其他進階概念（例如地理資訊系統 (GIS) 和稱為巨量地理資料的大規模地理空間資料）之間的緊密關係。這將使研究人員和科學界能夠評估這個有前途的領域的進展狀況，並將幫助其他有興趣的各方更深入了解所涉及的問題。", "author": "Anasse Boutayeb et.al.", "authors": "Anasse Boutayeb, Iyad Lahsen-cherif, Ahmed El Khadimi", "id": "2412.11643v1", "paper_url": "http://arxiv.org/abs/2412.11643v1", "repo": "null"}}