{"2410.17606": {"publish_time": "2024-10-23", "title": "Towards Effective Data-Free Knowledge Distillation via Diverse Diffusion Augmentation", "paper_summary": "Data-free knowledge distillation (DFKD) has emerged as a pivotal technique in\nthe domain of model compression, substantially reducing the dependency on the\noriginal training data. Nonetheless, conventional DFKD methods that employ\nsynthesized training data are prone to the limitations of inadequate diversity\nand discrepancies in distribution between the synthesized and original\ndatasets. To address these challenges, this paper introduces an innovative\napproach to DFKD through diverse diffusion augmentation (DDA). Specifically, we\nrevise the paradigm of common data synthesis in DFKD to a composite process\nthrough leveraging diffusion models subsequent to data synthesis for\nself-supervised augmentation, which generates a spectrum of data samples with\nsimilar distributions while retaining controlled variations. Furthermore, to\nmitigate excessive deviation in the embedding space, we introduce an image\nfiltering technique grounded in cosine similarity to maintain fidelity during\nthe knowledge distillation process. Comprehensive experiments conducted on\nCIFAR-10, CIFAR-100, and Tiny-ImageNet datasets showcase the superior\nperformance of our method across various teacher-student network\nconfigurations, outperforming the contemporary state-of-the-art DFKD methods.\nCode will be available at:https://github.com/SLGSP/DDA.", "paper_summary_zh": "無資料知識萃取（DFKD）已成為模型壓縮領域的關鍵技術，大幅降低對原始訓練資料的依賴性。儘管如此，採用合成訓練資料的傳統 DFKD 方法容易受到合成資料與原始資料集之間分佈差異性和多樣性不足的限制。為了應對這些挑戰，本文透過多樣擴增（DDA）提出 DFKD 的創新方法。具體而言，我們將 DFKD 中常見的資料合成範例修改為複合流程，透過在資料合成後利用擴散模型進行自我監督擴增，產生分佈相似的資料樣本光譜，同時保留受控變異。此外，為了減輕嵌入空間中的過度偏差，我們引入基於餘弦相似度的影像過濾技術，以在知識萃取過程中維持保真度。在 CIFAR-10、CIFAR-100 和 Tiny-ImageNet 資料集上進行的全面實驗展示了我們的方法在各種師生網路配置中的卓越效能，優於當代最先進的 DFKD 方法。程式碼將於以下網址提供：https://github.com/SLGSP/DDA。", "author": "Muquan Li et.al.", "authors": "Muquan Li, Dongyang Zhang, Tao He, Xiurui Xie, Yuan-Fang Li, Ke Qin", "id": "2410.17606v1", "paper_url": "http://arxiv.org/abs/2410.17606v1", "repo": "https://github.com/slgsp/dda"}}