{"2501.06164": {"publish_time": "2025-01-10", "title": "Model Alignment Search", "paper_summary": "When can we say that two neural systems are the same? The answer to this\nquestion is goal-dependent, and it is often addressed through correlative\nmethods such as Representational Similarity Analysis (RSA) and Centered Kernel\nAlignment (CKA). What do we miss when we forgo causal explorations, and how can\nwe target specific types of similarity? In this work, we introduce Model\nAlignment Search (MAS), a method for causally exploring distributed\nrepresentational similarity. The method learns invertible linear\ntransformations that align a subspace between two distributed networks'\nrepresentations where causal information can be freely interchanged. We first\nshow that the method can be used to transfer specific causal variables, such as\nthe number of items in a counting task, between networks with different\ntraining seeds. We then explore open questions in number cognition by comparing\ndifferent types of numeric representations in models trained on structurally\ndifferent numeric tasks. We then explore differences between MAS vs preexisting\ncausal similarity methods, showing MAS to be more resistant to unwanted\nexchanges. Lastly, we introduce a counterfactual latent auxiliary loss function\nthat helps shape causally relevant alignments even in cases where we do not\nhave causal access to one of the two models for training.", "paper_summary_zh": "<paragraph>在什麼情況下，我們可以說兩個神經系統相同？這個問題的答案取決於目標，並且通常透過相關方法來解決，例如表徵相似性分析 (RSA) 和中心核對齊 (CKA)。當我們放棄因果探索時，我們錯過了什麼？我們如何針對特定類型的相似性？在這項工作中，我們引入了模型對齊搜尋 (MAS)，一種用於因果探索分佈式表徵相似性的方法。該方法學習可逆線性轉換，以對齊兩個分佈式網路的表徵之間的子空間，其中因果資訊可以自由交換。我們首先表明，該方法可用於在具有不同訓練種子的網路之間傳輸特定因果變數，例如計數任務中的項目數量。然後，我們透過比較在結構上不同的數值任務中訓練的模型中不同類型的數值表徵，來探討數字認知中的開放問題。然後，我們探討 MAS 與現有的因果相似性方法之間的差異，顯示 MAS 對不需要的交換具有更高的抵抗力。最後，我們引入了一個反事實潛在輔助損失函數，即使在我們無法透過因果關係存取兩個模型之一進行訓練的情況下，也能幫助塑造因果相關對齊。</paragraph>", "author": "Satchel Grant et.al.", "authors": "Satchel Grant", "id": "2501.06164v1", "paper_url": "http://arxiv.org/abs/2501.06164v1", "repo": "null"}}