{"2412.18279": {"publish_time": "2024-12-24", "title": "Improving Multi-Step Reasoning Abilities of Large Language Models with Direct Advantage Policy Optimization", "paper_summary": "The role of reinforcement learning (RL) in enhancing the reasoning of large\nlanguage models (LLMs) is becoming increasingly significant. Despite the\nsuccess of RL in many scenarios, there are still many challenges in improving\nthe reasoning of LLMs. One challenge is the sparse reward, which makes\noptimization difficult for RL and necessitates a large amount of data samples.\nAnother challenge stems from the inherent instability of RL, particularly when\nusing Actor-Critic (AC) methods to derive optimal policies, which often leads\nto unstable training processes. To address these issues, we introduce Direct\nAdvantage Policy Optimization (DAPO), an novel step-level offline RL algorithm.\nUnlike standard alignment that rely solely outcome rewards to optimize policies\n(such as DPO), DAPO employs a critic function to predict the reasoning accuracy\nat each step, thereby generating dense signals to refine the generation\nstrategy. Additionally, the Actor and Critic components in DAPO are trained\nindependently, avoiding the co-training instability observed in standard AC\nalgorithms like PPO. We train DAPO on mathematical and code query datasets and\nthen evaluate its performance on multiple benchmarks. Our results show that\nDAPO can effectively enhance the mathematical and code capabilities on both SFT\nmodels and RL models, demonstrating the effectiveness of DAPO.", "paper_summary_zh": "強化學習 (RL) 在提升大型語言模型 (LLM) 推論中的角色正變得越來越重要。儘管 RL 在許多場景中都獲得成功，但在改善 LLM 推論方面仍有許多挑戰。其中一項挑戰是稀疏獎勵，這使得 RL 的最佳化變得困難，並且需要大量的資料樣本。另一項挑戰源於 RL 的內在不穩定性，特別是在使用 Actor-Critic (AC) 方法來推導最佳策略時，這通常會導致不穩定的訓練過程。為了解決這些問題，我們引入了直接優勢策略最佳化 (DAPO)，一種新穎的步驟級離線 RL 演算法。與僅依賴結果獎勵來最佳化策略的標準對齊不同（例如 DPO），DAPO 使用一個評論函數來預測每個步驟的推論準確度，從而產生密集的訊號來優化生成策略。此外，DAPO 中的 Actor 和 Critic 組件是獨立訓練的，避免了在標準 AC 演算法中觀察到的共同訓練不穩定性，例如 PPO。我們在數學和程式碼查詢資料集上訓練 DAPO，然後評估其在多個基準測試上的效能。我們的結果表明，DAPO 可以有效提升 SFT 模型和 RL 模型上的數學和程式碼能力，證明了 DAPO 的有效性。", "author": "Jiacai Liu et.al.", "authors": "Jiacai Liu, Chaojie Wang, Chris Yuhao Liu, Liang Zeng, Rui Yan, Yiwen Sun, Yang Liu, Yahui Zhou", "id": "2412.18279v1", "paper_url": "http://arxiv.org/abs/2412.18279v1", "repo": "null"}}