{"2412.16075": {"publish_time": "2024-12-20", "title": "Formal Mathematical Reasoning: A New Frontier in AI", "paper_summary": "AI for Mathematics (AI4Math) is not only intriguing intellectually but also\ncrucial for AI-driven discovery in science, engineering, and beyond. Extensive\nefforts on AI4Math have mirrored techniques in NLP, in particular, training\nlarge language models on carefully curated math datasets in text form. As a\ncomplementary yet less explored avenue, formal mathematical reasoning is\ngrounded in formal systems such as proof assistants, which can verify the\ncorrectness of reasoning and provide automatic feedback. In this position\npaper, we advocate for formal mathematical reasoning and argue that it is\nindispensable for advancing AI4Math to the next level. In recent years, we have\nseen steady progress in using AI to perform formal reasoning, including core\ntasks such as theorem proving and autoformalization, as well as emerging\napplications such as verifiable generation of code and hardware designs.\nHowever, significant challenges remain to be solved for AI to truly master\nmathematics and achieve broader impact. We summarize existing progress, discuss\nopen challenges, and envision critical milestones to measure future success. At\nthis inflection point for formal mathematical reasoning, we call on the\nresearch community to come together to drive transformative advancements in\nthis field.", "paper_summary_zh": "數學人工智慧 (AI4Math) 不僅在智力上引人入勝，對於科學、工程等領域中的人工智慧驅動發現也至關重要。對於 AI4Math 的廣泛研究反映了自然語言處理中的技術，特別是訓練大型語言模型，使用經過仔細策展的數學資料集，以文字形式呈現。作為一種相輔相成但較少探索的途徑，形式化數學推理基於形式化系統，例如證明輔助工具，它可以驗證推理的正確性並提供自動回饋。在此立場文件中，我們提倡形式化數學推理，並論證其對於將 AI4Math 提升到下一個層級至關重要。近年來，我們看到使用人工智慧執行形式化推理的進展穩定，包括定理證明和自動形式化等核心任務，以及可驗證的程式碼和硬體設計產生等新興應用。然而，要使人工智慧真正掌握數學並發揮更廣泛的影響，仍有重要的挑戰有待解決。我們總結現有的進展，討論開放性的挑戰，並設想衡量未來成功的關鍵里程碑。在形式化數學推理的這個轉捩點，我們呼籲研究社群共同努力，推動這個領域的變革性進展。", "author": "Kaiyu Yang et.al.", "authors": "Kaiyu Yang, Gabriel Poesia, Jingxuan He, Wenda Li, Kristin Lauter, Swarat Chaudhuri, Dawn Song", "id": "2412.16075v1", "paper_url": "http://arxiv.org/abs/2412.16075v1", "repo": "null"}}