{"2407.14640": {"publish_time": "2024-07-19", "title": "CVE-LLM : Automatic vulnerability evaluation in medical device industry using large language models", "paper_summary": "The healthcare industry is currently experiencing an unprecedented wave of\ncybersecurity attacks, impacting millions of individuals. With the discovery of\nthousands of vulnerabilities each month, there is a pressing need to drive the\nautomation of vulnerability assessment processes for medical devices,\nfacilitating rapid mitigation efforts. Generative AI systems have\nrevolutionized various industries, offering unparalleled opportunities for\nautomation and increased efficiency. This paper presents a solution leveraging\nLarge Language Models (LLMs) to learn from historical evaluations of\nvulnerabilities for the automatic assessment of vulnerabilities in the medical\ndevices industry. This approach is applied within the portfolio of a single\nmanufacturer, taking into account device characteristics, including existing\nsecurity posture and controls. The primary contributions of this paper are\nthreefold. Firstly, it provides a detailed examination of the best practices\nfor training a vulnerability Language Model (LM) in an industrial context.\nSecondly, it presents a comprehensive comparison and insightful analysis of the\neffectiveness of Language Models in vulnerability assessment. Finally, it\nproposes a new human-in-the-loop framework to expedite vulnerability evaluation\nprocesses.", "paper_summary_zh": "醫療保健產業目前正經歷一前所未有的網路安全攻擊浪潮，影響了數百萬人。隨著每月發現數千個漏洞，迫切需要推動醫療器材漏洞評估程序的自動化，以利於快速採取緩解措施。生成式 AI 系統已經徹底改變了各產業，為自動化和提高效率提供了無與倫比的機會。本文提出了一種解決方案，利用大型語言模型 (LLM) 從漏洞的歷史評估中學習，以自動評估醫療器材產業中的漏洞。此方法應用於單一製造商的產品組合中，考量了裝置特性，包括現有的安全態勢和控制措施。本文的主要貢獻有三方面。首先，它提供了在產業背景下訓練漏洞語言模型 (LM) 的最佳實務詳細說明。其次，它提出了語言模型在漏洞評估中的有效性之全面比較和深入分析。最後，它提出了一個新的「人機協作」架構，以加速漏洞評估程序。", "author": "Rikhiya Ghosh et.al.", "authors": "Rikhiya Ghosh, Oladimeji Farri, Hans-Martin von Stockhausen, Martin Schmitt, George Marica Vasile", "id": "2407.14640v1", "paper_url": "http://arxiv.org/abs/2407.14640v1", "repo": "null"}}