{"2502.01976": {"publish_time": "2025-02-04", "title": "CITER: Collaborative Inference for Efficient Large Language Model Decoding with Token-Level Routing", "paper_summary": "Large language models have achieved remarkable success in various tasks but\nsuffer from high computational costs during inference, limiting their\ndeployment in resource-constrained applications. To address this issue, we\npropose a novel CITER (\\textbf{C}ollaborative \\textbf{I}nference with\n\\textbf{T}oken-l\\textbf{E}vel \\textbf{R}outing) framework that enables\nefficient collaboration between small and large language models (SLMs & LLMs)\nthrough a token-level routing strategy. Specifically, CITER routes non-critical\ntokens to an SLM for efficiency and routes critical tokens to an LLM for\ngeneralization quality. We formulate router training as a policy optimization,\nwhere the router receives rewards based on both the quality of predictions and\nthe inference costs of generation. This allows the router to learn to predict\ntoken-level routing scores and make routing decisions based on both the current\ntoken and the future impact of its decisions. To further accelerate the reward\nevaluation process, we introduce a shortcut which significantly reduces the\ncosts of the reward estimation and improving the practicality of our approach.\nExtensive experiments on five benchmark datasets demonstrate that CITER reduces\nthe inference costs while preserving high-quality generation, offering a\npromising solution for real-time and resource-constrained applications.", "paper_summary_zh": "大型語言模型在各種任務中取得了顯著的成功，但推論過程中運算成本高昂，限制了它們在資源受限應用程序中的部署。為了解決這個問題，我們提出了一個新的 CITER（**C**ollaborative **I**nference with **T**oken-l**E**vel **R**outing）框架，它通過代幣級路由策略實現了小型和大型語言模型（SLM 和 LLM）之間的有效協作。具體來說，CITER 將非關鍵代幣路由到 SLM 以提高效率，並將關鍵代幣路由到 LLM 以提高泛化品質。我們將路由器訓練制定為一個策略優化，其中路由器根據預測的質量和生成的推論成本獲得獎勵。這讓路由器可以學習預測代幣級路由分數，並根據當前代幣及其決策的未來影響做出路由決策。為了進一步加速獎勵評估過程，我們引入了一個捷徑，它顯著降低了獎勵估計的成本，並提高了我們方法的實用性。在五個基準數據集上的大量實驗表明，CITER 減少了推論成本，同時保持了高品質的生成，為實時和資源受限應用程序提供了一個有前景的解決方案。", "author": "Wenhao Zheng et.al.", "authors": "Wenhao Zheng, Yixiao Chen, Weitong Zhang, Souvik Kundu, Yun Li, Zhengzhong Liu, Eric P. Xing, Hongyi Wang, Huaxiu Yao", "id": "2502.01976v1", "paper_url": "http://arxiv.org/abs/2502.01976v1", "repo": "null"}}