{"2405.16845": {"publish_time": "2024-05-27", "title": "On Mesa-Optimization in Autoregressively Trained Transformers: Emergence and Capability", "paper_summary": "Autoregressively trained transformers have brought a profound revolution to\nthe world, especially with their in-context learning (ICL) ability to address\ndownstream tasks. Recently, several studies suggest that transformers learn a\nmesa-optimizer during autoregressive (AR) pretraining to implement ICL. Namely,\nthe forward pass of the trained transformer is equivalent to optimizing an\ninner objective function in-context. However, whether the practical non-convex\ntraining dynamics will converge to the ideal mesa-optimizer is still unclear.\nTowards filling this gap, we investigate the non-convex dynamics of a one-layer\nlinear causal self-attention model autoregressively trained by gradient flow,\nwhere the sequences are generated by an AR process $x_{t+1} = W x_t$. First,\nunder a certain condition of data distribution, we prove that an\nautoregressively trained transformer learns $W$ by implementing one step of\ngradient descent to minimize an ordinary least squares (OLS) problem\nin-context. It then applies the learned $\\widehat{W}$ for next-token\nprediction, thereby verifying the mesa-optimization hypothesis. Next, under the\nsame data conditions, we explore the capability limitations of the obtained\nmesa-optimizer. We show that a stronger assumption related to the moments of\ndata is the sufficient and necessary condition that the learned mesa-optimizer\nrecovers the distribution. Besides, we conduct exploratory analyses beyond the\nfirst data condition and prove that generally, the trained transformer will not\nperform vanilla gradient descent for the OLS problem. Finally, our simulation\nresults verify the theoretical results.", "paper_summary_zh": "自回归训练的 Transformer 为世界带来了深刻的变革，尤其是其上下文学习 (ICL) 能力，可解决下游任务。最近，多项研究表明 Transformer 在自回归 (AR) 预训练期间学习了一个 mesa 优化器来实现 ICL。即，训练后的 Transformer 的前向传递等同于优化上下文中内部的目标函数。然而，实际的非凸训练动态是否会收敛到理想的 mesa 优化器仍不清楚。为了填补这一空白，我们研究了由梯度流自回归训练的单层线性因果自注意力模型的非凸动态，其中序列由 AR 过程生成 $x_{t+1} = W x_t$。首先，在数据分布的特定条件下，我们证明了自回归训练的 Transformer 通过实施一步梯度下降来学习 $W$，以最小化上下文中的普通最小二乘 (OLS) 问题。然后，它将学习到的 $\\widehat{W}$ 应用于下一个标记预测，从而验证了 mesa 优化假设。接下来，在相同的数据条件下，我们探索了获得的 mesa 优化器的能力限制。我们表明，与数据矩相关的更强假设是学习到的 mesa 优化器恢复分布的充分且必要条件。此外，我们进行了超出第一个数据条件的探索性分析，并证明通常，训练后的 Transformer 不会对 OLS 问题执行香草梯度下降。最后，我们的模拟结果验证了理论结果。", "author": "Chenyu Zheng et.al.", "authors": "Chenyu Zheng, Wei Huang, Rongzhen Wang, Guoqiang Wu, Jun Zhu, Chongxuan Li", "id": "2405.16845v1", "paper_url": "http://arxiv.org/abs/2405.16845v1", "repo": "null"}}