{"2406.14825": {"publish_time": "2024-06-21", "title": "TemPrompt: Multi-Task Prompt Learning for Temporal Relation Extraction in RAG-based Crowdsourcing Systems", "paper_summary": "Temporal relation extraction (TRE) aims to grasp the evolution of events or\nactions, and thus shape the workflow of associated tasks, so it holds promise\nin helping understand task requests initiated by requesters in crowdsourcing\nsystems. However, existing methods still struggle with limited and unevenly\ndistributed annotated data. Therefore, inspired by the abundant global\nknowledge stored within pre-trained language models (PLMs), we propose a\nmulti-task prompt learning framework for TRE (TemPrompt), incorporating prompt\ntuning and contrastive learning to tackle these issues. To elicit more\neffective prompts for PLMs, we introduce a task-oriented prompt construction\napproach that thoroughly takes the myriad factors of TRE into consideration for\nautomatic prompt generation. In addition, we present temporal event reasoning\nas a supplement to bolster the model's focus on events and temporal cues. The\nexperimental results demonstrate that TemPrompt outperforms all compared\nbaselines across the majority of metrics under both standard and few-shot\nsettings. A case study is provided to validate its effectiveness in\ncrowdsourcing scenarios.", "paper_summary_zh": "時序關係萃取 (TRE) 的目標是掌握事件或動作的演變，並由此塑造關聯任務的工作流程，因此它有望幫助理解群眾外包系統中請求者發起的任務請求。然而，現有方法仍然難以應對有限且分佈不均的標註資料。因此，在預訓練語言模型 (PLM) 中儲存的豐富全球知識的啟發下，我們提出了一個用於 TRE 的多任務提示學習框架 (TemPrompt)，結合提示調整和對比學習來解決這些問題。為了引出更有效的 PLM 提示，我們引入一種任務導向的提示建構方法，該方法全面考慮了 TRE 的無數因素以進行自動提示生成。此外，我們提出時序事件推理作為補充，以加強模型對事件和時序線索的關注。實驗結果表明，在標準和少樣本設定下的大多數指標中，TemPrompt 的表現都優於所有比較基準。提供了一個案例研究來驗證其在群眾外包場景中的有效性。", "author": "Jing Yang et.al.", "authors": "Jing Yang, Yu Zhao, Yang Linyao, Xiao Wang, Fei-Yue Wang", "id": "2406.14825v1", "paper_url": "http://arxiv.org/abs/2406.14825v1", "repo": "null"}}