{"2501.01835": {"publish_time": "2025-01-03", "title": "ASKCOS: an open source software suite for synthesis planning", "paper_summary": "The advancement of machine learning and the availability of large-scale\nreaction datasets have accelerated the development of data-driven models for\ncomputer-aided synthesis planning (CASP) in the past decade. Here, we detail\nthe newest version of ASKCOS, an open source software suite for synthesis\nplanning that makes available several research advances in a freely available,\npractical tool. Four one-step retrosynthesis models form the basis of both\ninteractive planning and automatic planning modes. Retrosynthetic planning is\ncomplemented by other modules for feasibility assessment and pathway\nevaluation, including reaction condition recommendation, reaction outcome\nprediction, and auxiliary capabilities such as solubility prediction and\nquantum mechanical descriptor prediction. ASKCOS has assisted hundreds of\nmedicinal, synthetic, and process chemists in their day-to-day tasks,\ncomplementing expert decision making. It is our belief that CASP tools like\nASKCOS are an important part of modern chemistry research, and that they offer\never-increasing utility and accessibility.", "paper_summary_zh": "機器學習的進展和大型反應資料集的可用性加速了過去十年中用於電腦輔助合成規劃 (CASP) 的資料驅動模型的開發。在此，我們詳細介紹了 ASKCOS 的最新版本，ASKCOS 是一個用於合成規劃的開源軟體套件，它在一個免費提供的實用工具中提供了多項研究進展。四個單步逆合成模型構成了互動式規劃和自動規劃模式的基礎。逆合成規劃由其他模組補充，這些模組用於可行性評估和路徑評估，包括反應條件建議、反應結果預測，以及溶解度預測和量子力學描述符預測等輔助功能。ASKCOS 已協助數百位藥物、合成和製程化學家完成其日常任務，並補充專家決策制定。我們相信像 ASKCOS 這樣的 CASP 工具是現代化學研究的重要組成部分，並且它們提供了日益增長且易於使用的工具。", "author": "Zhengkai Tu et.al.", "authors": "Zhengkai Tu, Sourabh J. Choure, Mun Hong Fong, Jihye Roh, Itai Levin, Kevin Yu, Joonyoung F. Joung, Nathan Morgan, Shih-Cheng Li, Xiaoqi Sun, Huiqian Lin, Mark Murnin, Jordan P. Liles, Thomas J. Struble, Michael E. Fortunato, Mengjie Liu, William H. Green, Klavs F. Jensen, Connor W. Coley", "id": "2501.01835v1", "paper_url": "http://arxiv.org/abs/2501.01835v1", "repo": "null"}}