{"2411.03622": {"publish_time": "2024-11-06", "title": "Fully Hyperbolic Rotation for Knowledge Graph Embedding", "paper_summary": "Hyperbolic rotation is commonly used to effectively model knowledge graphs\nand their inherent hierarchies. However, existing hyperbolic rotation models\nrely on logarithmic and exponential mappings for feature transformation. These\nmodels only project data features into hyperbolic space for rotation, limiting\ntheir ability to fully exploit the hyperbolic space. To address this problem,\nwe propose a novel fully hyperbolic model designed for knowledge graph\nembedding. Instead of feature mappings, we define the model directly in\nhyperbolic space with the Lorentz model. Our model considers each relation in\nknowledge graphs as a Lorentz rotation from the head entity to the tail entity.\nWe adopt the Lorentzian version distance as the scoring function for measuring\nthe plausibility of triplets. Extensive results on standard knowledge graph\ncompletion benchmarks demonstrated that our model achieves competitive results\nwith fewer parameters. In addition, our model get the state-of-the-art\nperformance on datasets of CoDEx-s and CoDEx-m, which are more diverse and\nchallenging than before. Our code is available at\nhttps://github.com/llqy123/FHRE.", "paper_summary_zh": "雙曲旋轉通常用於有效建模知識圖譜及其內在層級結構。然而，現有的雙曲旋轉模型依賴於對數和指數映射來進行特徵轉換。這些模型僅將數據特徵投影到雙曲空間中進行旋轉，限制了它們充分利用雙曲空間的能力。為了解決這個問題，我們提出了一個新的完全雙曲模型，專門用於知識圖譜嵌入。我們沒有使用特徵映射，而是直接在雙曲空間中使用洛倫茲模型定義模型。我們的模型將知識圖譜中的每個關係視為從頭實體到尾實體的洛倫茲旋轉。我們採用洛倫茲距離版本作為評分函數，用於測量三元組的可信度。在標準知識圖譜完成基準上的大量結果表明，我們的模型以更少的參數實現了有競爭力的結果。此外，我們的模型在 CoDEx-s 和 CoDEx-m 的數據集上取得了最先進的性能，這些數據集比以前更加多樣化且具有挑戰性。我們的代碼可在 https://github.com/llqy123/FHRE 獲得。", "author": "Qiuyu Liang et.al.", "authors": "Qiuyu Liang, Weihua Wang, Feilong Bao, Guanglai Gao", "id": "2411.03622v1", "paper_url": "http://arxiv.org/abs/2411.03622v1", "repo": "null"}}