{"2502.09920": {"publish_time": "2025-02-14", "title": "Machine Learning for Phase Estimation in Satellite-to-Earth Quantum Communication", "paper_summary": "A global continuous-variable quantum key distribution (CV-QKD) network can be\nestablished using a series of satellite-to-Earth channels. Increased\nperformance in such a network is provided by performing coherent measurement of\nthe optical quantum signals using a real local oscillator, calibrated locally\nby encoding known information on transmitted reference pulses and using signal\nphase error estimation algorithms. The speed and accuracy of the signal phase\nerror estimation algorithm are vital to practical CV-QKD implementation. Our\nwork provides a framework to analyze long short-term memory neural network (NN)\narchitecture parameterization, with respect to the quantum Cram\\'er-Rao\nuncertainty bound of the signal phase error estimation, with a focus on\nreducing the model complexity. More specifically, we demonstrate that signal\nphase error estimation can be achieved using a low-complexity NN architecture,\nwithout significantly sacrificing accuracy. Our results significantly improve\nthe real-time performance of practical CV-QKD systems deployed over\nsatellite-to-Earth channels, thereby contributing to the ongoing development of\nthe Quantum Internet.", "paper_summary_zh": "透過一系列衛星對地通道，可以建立全球連續變數量子密鑰分配 (CV-QKD) 網路。透過使用真實局部振盪器對光量子訊號進行相干測量，並透過編碼已知資訊於傳輸參考脈衝上，並使用訊號相位誤差估計演算法，在本地校正，可提升此類網路的效能。訊號相位誤差估計演算法的速度和準確度對於實際的 CV-QKD 實作至關重要。我們的研究提供了一個架構，用於分析長短期記憶神經網路 (NN) 架構參數化，相對於訊號相位誤差估計的量子 Cram\\'er-Rao 不確定性界限，重點在於降低模型複雜度。更具體地說，我們證明了訊號相位誤差估計可以使用低複雜度 NN 架構來達成，而不會顯著犧牲準確度。我們的結果顯著改善了實際 CV-QKD 系統在衛星對地通道上部署的即時效能，從而有助於量子網際網路的持續發展。", "author": "Nathan K Long et.al.", "authors": "Nathan K Long, Robert Malaney, Kenneth J Grant", "id": "2502.09920v1", "paper_url": "http://arxiv.org/abs/2502.09920v1", "repo": "null"}}