{"2410.05248": {"publish_time": "2024-10-07", "title": "SFTMix: Elevating Language Model Instruction Tuning with Mixup Recipe", "paper_summary": "To induce desired behaviors in large language models (LLMs) for\ninteraction-driven tasks, the instruction-tuning stage typically trains LLMs on\ninstruction-response pairs using the next-token prediction (NTP) loss. Previous\nwork aiming to improve instruction-tuning performance often emphasizes the need\nfor higher-quality supervised fine-tuning (SFT) datasets, which typically\ninvolves expensive data filtering with proprietary LLMs or labor-intensive data\ngeneration by human annotators. However, these approaches do not fully leverage\nthe datasets' intrinsic properties, resulting in high computational and labor\ncosts, thereby limiting scalability and performance gains. In this paper, we\npropose SFTMix, a novel recipe that elevates instruction-tuning performance\nbeyond the conventional NTP paradigm, without the need for well-curated\ndatasets. Observing that LLMs exhibit uneven confidence across the semantic\nrepresentation space, we argue that examples with different confidence levels\nshould play distinct roles during the instruction-tuning process. Based on this\ninsight, SFTMix leverages training dynamics to identify examples with varying\nconfidence levels, then applies a Mixup-based regularization to mitigate\noverfitting on confident examples while propagating supervision signals to\nimprove learning on relatively unconfident ones. This approach enables SFTMix\nto significantly outperform NTP across a wide range of instruction-following\nand healthcare domain-specific SFT tasks, demonstrating its adaptability to\ndiverse LLM families and scalability to datasets of any size. Comprehensive\nablation studies further verify the robustness of SFTMix's design choices,\nunderscoring its versatility in consistently enhancing performance across\ndifferent LLMs and datasets in broader natural language processing\napplications.", "paper_summary_zh": "<paragraph>為了誘導大型語言模型 (LLM) 在互動驅動任務中產生想要的行為，指令調整階段通常使用下一個符號預測 (NTP) 損失在指令回應配對上訓練 LLM。先前旨在改善指令調整效能的研究，通常強調需要品質更高的監督微調 (SFT) 資料集，這通常涉及使用專有 LLM 進行昂貴的資料篩選或由人工註解人員進行大量資料產生。然而，這些方法並未充分利用資料集的內在屬性，導致高昂的運算和人力成本，因此限制了可擴充性和效能提升。在本文中，我們提出 SFTMix，這是一個創新的方法，可以提升指令調整效能，超越傳統的 NTP 典範，而且不需要精心整理的資料集。觀察到 LLM 在語意表示空間中展現出不均勻的信心，我們認為在指令調整過程中，具有不同信心層級的範例應扮演不同的角色。基於這個見解，SFTMix 利用訓練動態來識別具有不同信心層級的範例，然後應用基於 Mixup 的正規化來減輕對有信心的範例進行過度擬合，同時傳播監督訊號以改善對相對沒有信心的範例的學習。此方法讓 SFTMix 能在廣泛的指令遵循和醫療保健領域特定 SFT 任務中顯著優於 NTP，證明其對不同 LLM 家族的適應性和對任何規模資料集的可擴充性。全面的消融研究進一步驗證了 SFTMix 設計選擇的穩健性，強調其在更廣泛的自然語言處理應用中持續提升不同 LLM 和資料集效能的多功能性。</paragraph>", "author": "Yuxin Xiao et.al.", "authors": "Yuxin Xiao, Shujian Zhang, Wenxuan Zhou, Marzyeh Ghassemi, Sanqiang Zhao", "id": "2410.05248v1", "paper_url": "http://arxiv.org/abs/2410.05248v1", "repo": "null"}}