{"2501.13344": {"publish_time": "2025-01-23", "title": "Full-Stack Optimized Large Language Models for Lifelong Sequential Behavior Comprehension in Recommendation", "paper_summary": "In this paper, we address the lifelong sequential behavior incomprehension\nproblem in large language models (LLMs) for recommendation, where LLMs struggle\nto extract useful information from long user behavior sequences, even within\ntheir context limits. To tackle this, we propose ReLLaX (Retrieval-enhanced\nLarge Language models Plus), a framework offering optimization across data,\nprompt, and parameter levels. At the data level, we introduce Semantic User\nBehavior Retrieval (SUBR) to reduce sequence heterogeneity, making it easier\nfor LLMs to extract key information. For prompt-level enhancement, we employ\nSoft Prompt Augmentation (SPA) to inject collaborative knowledge, aligning item\nrepresentations with recommendation tasks and improving LLMs's exploration of\nitem relationships. Finally, at the parameter level, we propose Component\nFully-interactive LoRA (CFLoRA), which enhances LoRA's expressiveness by\nenabling interactions between its components, allowing better capture of\nsequential information. Moreover, we present new perspectives to compare\ncurrent LoRA-based LLM4Rec methods, i.e. from both a composite and a decomposed\nview. We theoretically demonstrate that the ways they employ LoRA for\nrecommendation are degraded versions of our CFLoRA, with different constraints\non atom component interactions. Extensive experiments on three public datasets\ndemonstrate ReLLaX's superiority over existing baselines and its ability to\nmitigate lifelong sequential behavior incomprehension effectively.", "paper_summary_zh": "<paragraph>在本文中，我們探討了推薦中大型語言模型 (LLM) 中的終生順序行為難以理解的問題，其中 LLM 難以從長用戶行為序列中提取有用的資訊，即使在它們的內容限制內也是如此。為了解決這個問題，我們提出了 ReLLaX（檢索增強型大型語言模型 Plus），一個提供跨資料、提示和參數層級最佳化的架構。在資料層級，我們引入了語義使用者行為檢索 (SUBR) 以減少序列異質性，讓 LLM 更容易提取關鍵資訊。對於提示層級的增強，我們採用了軟提示擴充 (SPA) 來注入協作知識，將項目表示與推薦任務對齊，並改善 LLM 對項目關係的探索。最後，在參數層級，我們提出了組件完全互動 LoRA (CFLoRA)，它透過啟用其組件之間的互動來增強 LoRA 的表達力，從而可以更好地擷取順序資訊。此外，我們提出了新的觀點來比較目前的基於 LoRA 的 LLM4Rec 方法，即從複合和分解的觀點來看。我們在理論上證明了它們使用 LoRA 進行推薦的方式是我們 CFLoRA 的簡化版本，對原子組件互動有不同的限制。在三個公開資料集上進行的大量實驗證明了 ReLLaX 優於現有的基準，並且能夠有效地緩解終生的順序行為難以理解的問題。</paragraph>", "author": "Rong Shan et.al.", "authors": "Rong Shan, Jiachen Zhu, Jianghao Lin, Chenxu Zhu, Bo Chen, Ruiming Tang, Yong Yu, Weinan Zhang", "id": "2501.13344v1", "paper_url": "http://arxiv.org/abs/2501.13344v1", "repo": "null"}}