{"2501.09333": {"publish_time": "2025-01-16", "title": "Prompt-CAM: A Simpler Interpretable Transformer for Fine-Grained Analysis", "paper_summary": "We present a simple usage of pre-trained Vision Transformers (ViTs) for\nfine-grained analysis, aiming to identify and localize the traits that\ndistinguish visually similar categories, such as different bird species or dog\nbreeds. Pre-trained ViTs such as DINO have shown remarkable capabilities to\nextract localized, informative features. However, using saliency maps like\nGrad-CAM can hardly point out the traits: they often locate the whole object by\na blurred, coarse heatmap, not traits. We propose a novel approach Prompt Class\nAttention Map (Prompt-CAM) to the rescue. Prompt-CAM learns class-specific\nprompts to a pre-trained ViT and uses the corresponding outputs for\nclassification. To classify an image correctly, the true-class prompt must\nattend to the unique image patches not seen in other classes' images, i.e.,\ntraits. As such, the true class's multi-head attention maps reveal traits and\ntheir locations. Implementation-wise, Prompt-CAM is almost a free lunch by\nsimply modifying the prediction head of Visual Prompt Tuning (VPT). This makes\nPrompt-CAM fairly easy to train and apply, sharply contrasting other\ninterpretable methods that design specific models and training processes. It is\neven simpler than the recently published INterpretable TRansformer (INTR),\nwhose encoder-decoder architecture prevents it from leveraging pre-trained\nViTs. Extensive empirical studies on a dozen datasets from various domains\n(e.g., birds, fishes, insects, fungi, flowers, food, and cars) validate\nPrompt-CAM superior interpretation capability.", "paper_summary_zh": "<paragraph>我們提出預訓練視覺Transformer (ViT) 的簡易用法，用於精細分析，旨在識別並定位區分視覺上類似類別的特徵，例如不同的鳥類物種或狗品種。預訓練的 ViT，例如 DINO，已展現出提取局部化資訊特徵的卓越能力。然而，使用像 Grad-CAM 的顯著性圖很難指出特徵：它們經常透過模糊、粗糙的熱圖定位整個物件，而不是特徵。我們提出了一種新穎的方法提示類別注意力圖 (Prompt-CAM) 來解決這個問題。Prompt-CAM 學習類別特定的提示，並將其提供給預訓練的 ViT，並使用對應的輸出進行分類。為了正確分類影像，真類提示必須注意其他類別影像中未見的獨特影像區塊，即特徵。因此，真類的多頭注意力圖揭示了特徵及其位置。在實作方面，Prompt-CAM 幾乎是免費的午餐，只需修改視覺提示調整 (VPT) 的預測頭部。這使得 Prompt-CAM 相當容易訓練和應用，與設計特定模型和訓練流程的其他可解釋方法形成鮮明對比。它甚至比最近發布的可解釋Transformer (INTR) 更簡單，其編碼器-解碼器架構使其無法利用預訓練的 ViT。對來自各種領域（例如鳥類、魚類、昆蟲、真菌、花卉、食物和汽車）的十幾個資料集進行的廣泛實證研究驗證了 Prompt-CAM 優越的解釋能力。</paragraph>", "author": "Arpita Chowdhury et.al.", "authors": "Arpita Chowdhury, Dipanjyoti Paul, Zheda Mai, Jianyang Gu, Ziheng Zhang, Kazi Sajeed Mehrab, Elizabeth G. Campolongo, Daniel Rubenstein, Charles V. Stewart, Anuj Karpatne, Tanya Berger-Wolf, Yu Su, Wei-Lun Chao", "id": "2501.09333v1", "paper_url": "http://arxiv.org/abs/2501.09333v1", "repo": "null"}}