{"2412.02290": {"publish_time": "2024-12-03", "title": "Characterizing Information Shared by Participants to Coding Challenges: The Case of Advent of Code", "paper_summary": "Advent of Code (AoC from now on) is a popular coding challenge requiring to\nsolve programming puzzles for a variety of skill sets and levels. AoC follows\nthe advent calendar, therefore it is an annual challenge that lasts for 25\ndays. AoC participants usually post their solutions on social networks and\ndiscuss them online. These challenges are interesting to study since they could\nhighlight the adoption of new tools, the evolution of the developer community,\nor the technological requirements of well-known companies. For these reasons,\nwe first create a dataset of the 2019-2021 AoC editions containing the\ndiscussion threads made on the subreddit {\\tt /r/adventofcode}. Then, we\npropose a model based on stream graphs to best study this context, where we\nrepresent its most important actors through time: participants, comments, and\nprogramming languages. Thanks to our model, we investigate user participation,\nadoption of new programming languages during a challenge and between two of\nthem, and resiliency of programming languages based on a Stack Overflow survey.\nWe find that the top-used programming languages are almost the same in the\nthree years, pointing out their importance. Moreover, participants tend to keep\nthe same programming language for the whole challenge, while the ones attending\ntwo AoCs usually change it in the next one. Finally, we observe interesting\nresults about the programming languages that are ``Popular'' or ``Loved''\naccording to the Stack Overflow survey. Firstly, these are the ones adopted for\nthe longest time in an AoC edition, thanks to which users have a high chance of\nreaching the end of the challenge. Secondly, they are the most chosen when a\nparticipant decides to change programming language during the same challenge.", "paper_summary_zh": "降臨節密碼（以下簡稱 AoC）是一項流行的編碼挑戰，需要解決各種技能組和等級的程式設計謎題。AoC 遵循降臨曆，因此是一項為期 25 天的年度挑戰。AoC 參與者通常在社群網路上發布他們的解決方案，並在網路上討論它們。這些挑戰很有趣，因為它們可以突顯新工具的採用、開發人員社群的演進，或知名公司的技術需求。基於這些原因，我們首先建立一個包含在 subreddit {\\tt /r/adventofcode} 上進行討論串的 2019-2021 年 AoC 版本資料集。然後，我們提出一個基於串流圖的模型來最佳研究此背景，其中我們隨著時間呈現其最重要的參與者：參與者、留言和程式語言。透過我們的模型，我們調查使用者參與度、在挑戰期間和兩者之間採用新程式語言的情況，以及根據 Stack Overflow 調查對程式語言的復原力。我們發現三年來最常用的程式語言幾乎相同，指出了它們的重要性。此外，參與者傾向於在整個挑戰中使用相同的程式語言，而參加兩個 AoC 的參與者通常會在下一場比賽中更換程式語言。最後，我們觀察到關於根據 Stack Overflow 調查被歸類為「熱門」或「喜愛」的程式語言的一些有趣結果。首先，這些程式語言是 AoC 版本中採用最久的程式語言，因此使用者有很高的機會完成挑戰。其次，當參與者決定在同一個挑戰中更改程式語言時，它們是最常被選用的程式語言。", "author": "Francesco Cauteruccio et.al.", "authors": "Francesco Cauteruccio, Enrico Corradini, Luca Virgili", "id": "2412.02290v1", "paper_url": "http://arxiv.org/abs/2412.02290v1", "repo": "null"}}