{"2409.11538": {"publish_time": "2024-09-17", "title": "Chain-of-Thought Prompting for Speech Translation", "paper_summary": "Large language models (LLMs) have demonstrated remarkable advancements in\nlanguage understanding and generation. Building on the success of text-based\nLLMs, recent research has adapted these models to use speech embeddings for\nprompting, resulting in Speech-LLM models that exhibit strong performance in\nautomatic speech recognition (ASR) and automatic speech translation (AST). In\nthis work, we propose a novel approach to leverage ASR transcripts as prompts\nfor AST in a Speech-LLM built on an encoder-decoder text LLM. The Speech-LLM\nmodel consists of a speech encoder and an encoder-decoder structure\nMegatron-T5. By first decoding speech to generate ASR transcripts and\nsubsequently using these transcripts along with encoded speech for prompting,\nwe guide the speech translation in a two-step process like chain-of-thought\n(CoT) prompting. Low-rank adaptation (LoRA) is used for the T5 LLM for model\nadaptation and shows superior performance to full model fine-tuning.\nExperimental results show that the proposed CoT prompting significantly\nimproves AST performance, achieving an average increase of 2.4 BLEU points\nacross 6 En->X or X->En AST tasks compared to speech prompting alone.\nAdditionally, compared to a related CoT prediction method that predicts a\nconcatenated sequence of ASR and AST transcripts, our method performs better by\nan average of 2 BLEU points.", "paper_summary_zh": "大型語言模型 (LLM) 在語言理解和生成方面已經展現出顯著的進步。建立在基於文字的 LLM 的成功基礎上，最近的研究已經改編這些模型以使用語音嵌入進行提示，產生在自動語音辨識 (ASR) 和自動語音翻譯 (AST) 中表現出強勁效能的 Speech-LLM 模型。在這項工作中，我們提出了一種新穎的方法，以利用 ASR 轉錄作為提示，用於建立在編碼器-解碼器文字 LLM 上的 Speech-LLM 中的 AST。Speech-LLM 模型包含一個語音編碼器和一個編碼器-解碼器結構 Megatron-T5。透過先解碼語音以產生 ASR 轉錄，然後將這些轉錄與編碼語音一起用於提示，我們指導語音翻譯進入一個類似於思考鏈 (CoT) 提示的兩步驟程序。低秩適應 (LoRA) 用於 T5 LLM 的模型適應，並且顯示出優於完整模型微調的效能。實驗結果顯示，所提出的 CoT 提示顯著改善了 AST 效能，在 6 個 En->X 或 X->En AST 任務中，與單獨的語音提示相比，平均增加了 2.4 個 BLEU 點。此外，與預測 ASR 和 AST 轉錄的串聯序列的相關 CoT 預測方法相比，我們的模型平均效能高出 2 個 BLEU 點。", "author": "Ke Hu et.al.", "authors": "Ke Hu, Zhehuai Chen, Chao-Han Huck Yang, Piotr Żelasko, Oleksii Hrinchuk, Vitaly Lavrukhin, Jagadeesh Balam, Boris Ginsburg", "id": "2409.11538v1", "paper_url": "http://arxiv.org/abs/2409.11538v1", "repo": "null"}}