{"2411.17249": {"publish_time": "2024-11-26", "title": "Buffer Anytime: Zero-Shot Video Depth and Normal from Image Priors", "paper_summary": "We present Buffer Anytime, a framework for estimation of depth and normal\nmaps (which we call geometric buffers) from video that eliminates the need for\npaired video--depth and video--normal training data. Instead of relying on\nlarge-scale annotated video datasets, we demonstrate high-quality video buffer\nestimation by leveraging single-image priors with temporal consistency\nconstraints. Our zero-shot training strategy combines state-of-the-art image\nestimation models based on optical flow smoothness through a hybrid loss\nfunction, implemented via a lightweight temporal attention architecture.\nApplied to leading image models like Depth Anything V2 and Marigold-E2E-FT, our\napproach significantly improves temporal consistency while maintaining\naccuracy. Experiments show that our method not only outperforms image-based\napproaches but also achieves results comparable to state-of-the-art video\nmodels trained on large-scale paired video datasets, despite using no such\npaired video data.", "paper_summary_zh": "我們提出 Buffer Anytime，一個用於從影片中估計深度和法線貼圖（我們稱之為幾何緩衝區）的架構，它消除了對配對影片深度和影片法線訓練資料的需求。我們透過利用單一影像先驗與時間一致性約束，展示高品質影片緩衝區估計，而不是依賴於大規模標記影片資料集。我們的零次學習策略結合了基於光流平滑性的最新影像估計模型，透過一個混合損失函數，並透過一個輕量級時間注意力架構進行實作。我們的做法應用於 Depth Anything V2 和 Marigold-E2E-FT 等領先的影像模型，它顯著改善了時間一致性，同時維持準確度。實驗顯示，我們的模型不僅優於基於影像的做法，而且還達到了與最新影片模型相當的結果，這些影片模型是在大規模配對影片資料集上訓練的，儘管沒有使用此類配對影片資料。", "author": "Zhengfei Kuang et.al.", "authors": "Zhengfei Kuang, Tianyuan Zhang, Kai Zhang, Hao Tan, Sai Bi, Yiwei Hu, Zexiang Xu, Milos Hasan, Gordon Wetzstein, Fujun Luan", "id": "2411.17249v1", "paper_url": "http://arxiv.org/abs/2411.17249v1", "repo": "null"}}