{"2410.19542": {"publish_time": "2024-10-25", "title": "Brain-like Functional Organization within Large Language Models", "paper_summary": "The human brain has long inspired the pursuit of artificial intelligence\n(AI). Recently, neuroimaging studies provide compelling evidence of alignment\nbetween the computational representation of artificial neural networks (ANNs)\nand the neural responses of the human brain to stimuli, suggesting that ANNs\nmay employ brain-like information processing strategies. While such alignment\nhas been observed across sensory modalities--visual, auditory, and\nlinguistic--much of the focus has been on the behaviors of artificial neurons\n(ANs) at the population level, leaving the functional organization of\nindividual ANs that facilitates such brain-like processes largely unexplored.\nIn this study, we bridge this gap by directly coupling sub-groups of artificial\nneurons with functional brain networks (FBNs), the foundational organizational\nstructure of the human brain. Specifically, we extract representative patterns\nfrom temporal responses of ANs in large language models (LLMs), and use them as\nfixed regressors to construct voxel-wise encoding models to predict brain\nactivity recorded by functional magnetic resonance imaging (fMRI). This\nframework links the AN sub-groups to FBNs, enabling the delineation of\nbrain-like functional organization within LLMs. Our findings reveal that LLMs\n(BERT and Llama 1-3) exhibit brain-like functional architecture, with\nsub-groups of artificial neurons mirroring the organizational patterns of\nwell-established FBNs. Notably, the brain-like functional organization of LLMs\nevolves with the increased sophistication and capability, achieving an improved\nbalance between the diversity of computational behaviors and the consistency of\nfunctional specializations. This research represents the first exploration of\nbrain-like functional organization within LLMs, offering novel insights to\ninform the development of artificial general intelligence (AGI) with human\nbrain principles.", "paper_summary_zh": "人類大腦長期以來一直激勵著人們追求人工智慧 (AI)。最近，神經影像研究提供了令人信服的證據，證明人工神經網路 (ANN) 的計算表示與人類大腦對刺激的神經反應之間存在一致性，這表明 ANN 可能採用類腦資訊處理策略。雖然這種一致性已在視覺、聽覺和語言等感官模式中被觀察到，但大部分的焦點都放在群體層級的人工神經元 (AN) 行為上，而鮮少探討促成此類類腦過程的個別 AN 功能組織。在這項研究中，我們透過直接將人工神經元的子群與功能性腦網路 (FBN)（人類大腦的基本組織結構）相結合，來彌合這個差距。具體來說，我們從大型語言模型 (LLM) 中的人工神經元時間反應中提取代表性模式，並將它們用作固定回歸變數來建構體素編碼模型，以預測功能性磁共振造影 (fMRI) 記錄的大腦活動。這個架構將 AN 子群連結到 FBN，能夠描繪出 LLM 內部的類腦功能組織。我們的研究結果顯示，LLM（BERT 和 Llama 1-3）展現出類腦功能架構，人工神經元的子群反映出已建立良好的 FBN 的組織模式。值得注意的是，LLM 的類腦功能組織會隨著複雜性和能力的提升而演化，在計算行為的多樣性和功能專門化的穩定性之間取得更好的平衡。這項研究代表了首次探索 LLM 內部的類腦功能組織，提供了新的見解，有助於根據人類大腦原理來開發人工通用智慧 (AGI)。", "author": "H. Sun et.al.", "authors": "H. Sun, L. Zhao, Z. Wu, X. Gao, Y. Hu, M. Zuo, W. Zhang, J. Han, T. Liu, X. Hu", "id": "2410.19542v1", "paper_url": "http://arxiv.org/abs/2410.19542v1", "repo": "null"}}