{"2410.23530": {"publish_time": "2024-10-31", "title": "There and Back Again: On the relation between noises, images, and their inversions in diffusion models", "paper_summary": "Denoising Diffusion Probabilistic Models (DDPMs) achieve state-of-the-art\nperformance in synthesizing new images from random noise, but they lack\nmeaningful latent space that encodes data into features. Recent DDPM-based\nediting techniques try to mitigate this issue by inverting images back to their\napproximated staring noise. In this work, we study the relation between the\ninitial Gaussian noise, the samples generated from it, and their corresponding\nlatent encodings obtained through the inversion procedure. First, we interpret\ntheir spatial distance relations to show the inaccuracy of the DDIM inversion\ntechnique by localizing latent representations manifold between the initial\nnoise and generated samples. Then, we demonstrate the peculiar relation between\ninitial Gaussian noise and its corresponding generations during diffusion\ntraining, showing that the high-level features of generated images stabilize\nrapidly, keeping the spatial distance relationship between noises and\ngenerations consistent throughout the training.", "paper_summary_zh": "去噪擴散概率模型 (DDPM) 在從隨機雜訊中合成新影像方面取得最先進的效能，但它們缺乏將資料編碼成特徵的有意義潛在空間。最近基於 DDPM 的編輯技術嘗試透過將影像反轉回其近似起始雜訊來減輕這個問題。在這項工作中，我們研究了初始高斯雜訊、從中產生的樣本，以及透過反轉程序取得的對應潛在編碼之間的關係。首先，我們詮釋它們的空間距離關係，以顯示 DDIM 反轉技術的不準確性，方法是在初始雜訊和產生的樣本之間定位潛在表示流形。然後，我們展示了在擴散訓練期間初始高斯雜訊及其對應生成之間的特殊關係，顯示生成影像的高階特徵會快速穩定，使雜訊和生成之間的空間距離關係在整個訓練過程中保持一致。", "author": "Łukasz Staniszewski et.al.", "authors": "Łukasz Staniszewski, Łukasz Kuciński, Kamil Deja", "id": "2410.23530v1", "paper_url": "http://arxiv.org/abs/2410.23530v1", "repo": "null"}}