{"2405.19765": {"publish_time": "2024-05-30", "title": "Towards Unified Multi-granularity Text Detection with Interactive Attention", "paper_summary": "Existing OCR engines or document image analysis systems typically rely on\ntraining separate models for text detection in varying scenarios and\ngranularities, leading to significant computational complexity and resource\ndemands. In this paper, we introduce \"Detect Any Text\" (DAT), an advanced\nparadigm that seamlessly unifies scene text detection, layout analysis, and\ndocument page detection into a cohesive, end-to-end model. This design enables\nDAT to efficiently manage text instances at different granularities, including\n*word*, *line*, *paragraph* and *page*. A pivotal innovation in DAT is the\nacross-granularity interactive attention module, which significantly enhances\nthe representation learning of text instances at varying granularities by\ncorrelating structural information across different text queries. As a result,\nit enables the model to achieve mutually beneficial detection performances\nacross multiple text granularities. Additionally, a prompt-based segmentation\nmodule refines detection outcomes for texts of arbitrary curvature and complex\nlayouts, thereby improving DAT's accuracy and expanding its real-world\napplicability. Experimental results demonstrate that DAT achieves\nstate-of-the-art performances across a variety of text-related benchmarks,\nincluding multi-oriented/arbitrarily-shaped scene text detection, document\nlayout analysis and page detection tasks.", "paper_summary_zh": "現有的 OCR 引擎或文件圖像分析系統通常依賴於訓練不同的模型，用於在不同的場景和粒度中進行文字偵測，導致顯著的計算複雜性和資源需求。在本文中，我們介紹「偵測任何文字」(DAT)，一種先進的典範，它無縫地將場景文字偵測、版面分析和文件頁面偵測統一到一個有凝聚力的端到端模型中。這個設計使 DAT 能夠有效地管理不同粒度的文字實例，包括 *字詞*、*行*、*段落* 和 *頁面*。DAT 中的一個關鍵創新是跨粒度互動注意力模組，它通過將不同文字查詢的結構資訊相互關聯，顯著增強了不同粒度文字實例的表徵學習。因此，它使模型能夠在多個文字粒度上實現互惠的偵測效能。此外，基於提示的分割模組改進了任意曲率和複雜版面的文字的偵測結果，從而提高了 DAT 的準確性並擴展了其在現實世界中的適用性。實驗結果表明，DAT 在各種與文字相關的基準測試中都取得了最先進的效能，包括多方向/任意形狀的場景文字偵測、文件版面分析和頁面偵測任務。", "author": "Xingyu Wan et.al.", "authors": "Xingyu Wan, Chengquan Zhang, Pengyuan Lyu, Sen Fan, Zihan Ni, Kun Yao, Errui Ding, Jingdong Wang", "id": "2405.19765v1", "paper_url": "http://arxiv.org/abs/2405.19765v1", "repo": "null"}}