{"2505.00703": {"publish_time": "2025-05-01", "title": "T2I-R1: Reinforcing Image Generation with Collaborative Semantic-level and Token-level CoT", "paper_summary": "Recent advancements in large language models have demonstrated how\nchain-of-thought (CoT) and reinforcement learning (RL) can improve performance.\nHowever, applying such reasoning strategies to the visual generation domain\nremains largely unexplored. In this paper, we present T2I-R1, a novel\nreasoning-enhanced text-to-image generation model, powered by RL with a\nbi-level CoT reasoning process. Specifically, we identify two levels of CoT\nthat can be utilized to enhance different stages of generation: (1) the\nsemantic-level CoT for high-level planning of the prompt and (2) the\ntoken-level CoT for low-level pixel processing during patch-by-patch\ngeneration. To better coordinate these two levels of CoT, we introduce\nBiCoT-GRPO with an ensemble of generation rewards, which seamlessly optimizes\nboth generation CoTs within the same training step. By applying our reasoning\nstrategies to the baseline model, Janus-Pro, we achieve superior performance\nwith 13% improvement on T2I-CompBench and 19% improvement on the WISE\nbenchmark, even surpassing the state-of-the-art model FLUX.1. Code is available\nat: https://github.com/CaraJ7/T2I-R1", "paper_summary_zh": "大型語言模型的最新進展展現了思維鏈 (CoT) 和強化學習 (RL) 如何提升效能。然而，將此類推理策略應用於視覺生成領域的研究仍然相當有限。在本文中，我們提出 T2I-R1，一個由 RL 驅動、具有雙層 CoT 推理過程的新型推理增強型文字到圖像生成模型。具體來說，我們確定了兩種可以增強不同生成階段的 CoT：(1) 語義級 CoT，用於提示的高階規劃；(2) 符號級 CoT，用於逐塊生成期間的低階像素處理。為了更好地協調這兩個級別的 CoT，我們引入了具有集成生成獎勵的 BiCoT-GRPO，它可以在同一個訓練步驟中無縫地優化兩種生成 CoT。通過將我們的推理策略應用於基準模型 Janus-Pro，我們實現了卓越的性能，在 T2I-CompBench 上提升了 13%，在 WISE 基準測試上提升了 19%，甚至超越了最先進的模型 FLUX.1。程式碼可在以下網址獲得：https://github.com/CaraJ7/T2I-R1\n", "author": "Dongzhi Jiang et.al.", "authors": "Dongzhi Jiang, Ziyu Guo, Renrui Zhang, Zhuofan Zong, Hao Li, Le Zhuo, Shilin Yan, Pheng-Ann Heng, Hongsheng Li", "id": "2505.00703v1", "paper_url": "http://arxiv.org/abs/2505.00703v1", "repo": "null"}}