{"2501.12619": {"publish_time": "2025-01-22", "title": "Distillation Quantification for Large Language Models", "paper_summary": "Model distillation is a technique for transferring knowledge from large\nlanguage models (LLMs) to smaller ones, aiming to create resource-efficient yet\nhigh-performing models. However, excessive distillation can lead to\nhomogenization, reducing diversity among models and impairing their ability to\nrobustly handle complex or novel tasks. These limitations underscore the need\nto systematically quantify the distillation process and its impact. In this\nwork, we propose a framework to evaluate and quantify model distillation. Our\nmethod addresses two key aspects: (1) Identifying identity cognition\ncontradictions to assess discrepancies in how models perceive and represent\nidentity-related information, and (2) Analyzing multi-granularity response\nsimilarities across models to measure the extent of homogenization.\nExperimental results demonstrate two key insights: (1) Well-known closed-source\nand open-source LLMs usually exhibit high distillation degrees, except for\nClaude, Doubao, and Gemini. (2) Base LLMs show higher distillation degrees\ncompared to aligned LLMs. By offering a systematic approach to improve the\ntransparency of LLM data distillation, we call for LLMs with more independent\ndevelopment and more transparent technical reports to improve LLMs' robustness\nand safety. The code and data are available under\nhttps://github.com/Aegis1863/LLMs-Distillation-Quantification.", "paper_summary_zh": "模型蒸餾是一種將知識從大型語言模型 (LLM) 轉移到較小模型的技術，目的是建立資源效率高但效能良好的模型。然而，過度的蒸餾可能導致同質化，減少模型之間的多樣性，並損害它們穩健處理複雜或新穎任務的能力。這些限制強調了系統化量化蒸餾過程及其影響的必要性。在這項工作中，我們提出了一個評估和量化模型蒸餾的框架。我們的模型探討了兩個關鍵面向：(1) 識別身分認知矛盾，以評估模型在感知和呈現身分相關資訊的方式上的差異，以及 (2) 分析模型之間的多粒度回應相似性，以衡量同質化的程度。實驗結果證明了兩個關鍵見解：(1) 除了 Claude、Doubao 和 Gemini 之外，眾所周知的閉源和開源 LLM 通常表現出高度的蒸餾程度。(2) 與對齊的 LLM 相比，基礎 LLM 顯示出更高的蒸餾程度。透過提供一種系統化的方法來提高 LLM 資料蒸餾的透明度，我們呼籲開發出更獨立且技術報告更透明的 LLM，以提高 LLM 的穩健性和安全性。程式碼和資料可在 https://github.com/Aegis1863/LLMs-Distillation-Quantification 下取得。", "author": "Sunbowen Lee et.al.", "authors": "Sunbowen Lee, Junting Zhou, Chang Ao, Kaige Li, Xinrun Du, Sirui He, Jiaheng Liu, Min Yang, Zhoufutu Wen, Shiwen Ni", "id": "2501.12619v1", "paper_url": "http://arxiv.org/abs/2501.12619v1", "repo": "https://github.com/aegis1863/llms-distillation-quantification"}}