{"2410.08210": {"publish_time": "2024-10-10", "title": "PointOBB-v2: Towards Simpler, Faster, and Stronger Single Point Supervised Oriented Object Detection", "paper_summary": "Single point supervised oriented object detection has gained attention and\nmade initial progress within the community. Diverse from those approaches\nrelying on one-shot samples or powerful pretrained models (e.g. SAM), PointOBB\nhas shown promise due to its prior-free feature. In this paper, we propose\nPointOBB-v2, a simpler, faster, and stronger method to generate pseudo rotated\nboxes from points without relying on any other prior. Specifically, we first\ngenerate a Class Probability Map (CPM) by training the network with non-uniform\npositive and negative sampling. We show that the CPM is able to learn the\napproximate object regions and their contours. Then, Principal Component\nAnalysis (PCA) is applied to accurately estimate the orientation and the\nboundary of objects. By further incorporating a separation mechanism, we\nresolve the confusion caused by the overlapping on the CPM, enabling its\noperation in high-density scenarios. Extensive comparisons demonstrate that our\nmethod achieves a training speed 15.58x faster and an accuracy improvement of\n11.60%/25.15%/21.19% on the DOTA-v1.0/v1.5/v2.0 datasets compared to the\nprevious state-of-the-art, PointOBB. This significantly advances the cutting\nedge of single point supervised oriented detection in the modular track.", "paper_summary_zh": "單點監督導向的目標偵測已獲得關注，並在社群中取得初步進展。不同於依賴單次樣本或強大預訓練模型（例如 SAM）的那些方法，PointOBB 由於其無先驗特徵而顯示出前景。在本文中，我們提出 PointOBB-v2，這是一種更簡單、更快速且更強大的方法，用於在不依賴任何其他先驗的情況下從點生成偽旋轉框。具體來說，我們首先透過使用非均勻正負取樣來訓練網路，來生成類別機率圖 (CPM)。我們表明 CPM 能夠學習近似的物件區域及其輪廓。然後，應用主成分分析 (PCA) 來準確估計物體的方向和邊界。透過進一步納入分離機制，我們解決了 CPM 上重疊所造成的混淆，使其能夠在高密度場景中操作。廣泛的比較表明，與先前的技術 PointOBB 相比，我們的模型在 DOTA-v1.0/v1.5/v2.0 資料集上實現了快 15.58 倍的訓練速度，以及 11.60%/25.15%/21.19% 的準確度提升。這顯著提升了模組化軌道中單點監督導向偵測的尖端技術。", "author": "Botao Ren et.al.", "authors": "Botao Ren, Xue Yang, Yi Yu, Junwei Luo, Zhidong Deng", "id": "2410.08210v1", "paper_url": "http://arxiv.org/abs/2410.08210v1", "repo": "null"}}