{"2405.19973": {"publish_time": "2024-05-30", "title": "A Triumvirate of AI Driven Theoretical Discovery", "paper_summary": "Recent years have seen the dramatic rise of the usage of AI algorithms in\npure mathematics and fundamental sciences such as theoretical physics. This is\nperhaps counter-intuitive since mathematical sciences require the rigorous\ndefinitions, derivations, and proofs, in contrast to the experimental sciences\nwhich rely on the modelling of data with error-bars. In this Perspective, we\ncategorize the approaches to mathematical discovery as \"top-down\", \"bottom-up\"\nand \"meta-mathematics\", as inspired by historical examples. We review some of\nthe progress over the last few years, comparing and contrasting both the\nadvances and the short-comings in each approach. We argue that while the\ntheorist is in no way in danger of being replaced by AI in the near future, the\nhybrid of human expertise and AI algorithms will become an integral part of\ntheoretical discovery.", "paper_summary_zh": "近年來，人工智慧演算法在純數學和理論物理等基礎科學中的應用大幅增加。這或許有違直覺，因為數學科學需要嚴謹的定義、推導和證明，這與依賴於誤差範圍數據建模的實驗科學形成對比。在這個觀點中，我們將數學發現的方法歸類為「自上而下」、「自下而上」和「元數學」，靈感來自歷史範例。我們回顧過去幾年的部分進展，比較並對比每種方法的進步和缺點。我們認為，儘管理論家在不久的將來絕不會被人工智慧取代，但人類專家和人工智慧演算法的結合將成為理論發現中不可或缺的一部分。", "author": "Yang-Hui He et.al.", "authors": "Yang-Hui He", "id": "2405.19973v1", "paper_url": "http://arxiv.org/abs/2405.19973v1", "repo": "null"}}