{"2407.13163": {"publish_time": "2024-07-18", "title": "ROLeR: Effective Reward Shaping in Offline Reinforcement Learning for Recommender Systems", "paper_summary": "Offline reinforcement learning (RL) is an effective tool for real-world\nrecommender systems with its capacity to model the dynamic interest of users\nand its interactive nature. Most existing offline RL recommender systems focus\non model-based RL through learning a world model from offline data and building\nthe recommendation policy by interacting with this model. Although these\nmethods have made progress in the recommendation performance, the effectiveness\nof model-based offline RL methods is often constrained by the accuracy of the\nestimation of the reward model and the model uncertainties, primarily due to\nthe extreme discrepancy between offline logged data and real-world data in user\ninteractions with online platforms. To fill this gap, a more accurate reward\nmodel and uncertainty estimation are needed for the model-based RL methods. In\nthis paper, a novel model-based Reward Shaping in Offline Reinforcement\nLearning for Recommender Systems, ROLeR, is proposed for reward and uncertainty\nestimation in recommendation systems. Specifically, a non-parametric reward\nshaping method is designed to refine the reward model. In addition, a flexible\nand more representative uncertainty penalty is designed to fit the needs of\nrecommendation systems. Extensive experiments conducted on four benchmark\ndatasets showcase that ROLeR achieves state-of-the-art performance compared\nwith existing baselines. The source code can be downloaded at\nhttps://github.com/ArronDZhang/ROLeR.", "paper_summary_zh": "離線強化學習 (RL) 是一種有效的工具，可用於現實世界的推薦系統，因為它能夠模擬使用者的動態興趣，且具有互動特性。現有的離線 RL 推薦系統大多著重於透過學習離線資料的世界模型，並透過與此模型互動來建構推薦政策的基於模型的 RL。儘管這些方法在推薦效能上有進展，但基於模型的離線 RL 方法的有效性通常會受到獎勵模型估計的準確度和模型不確定性的限制，這主要是由於離線記錄資料與使用者與線上平台互動時的實際資料之間存在極大的差異。為了填補此差距，基於模型的 RL 方法需要更準確的獎勵模型和不確定性估計。在本文中，提出了一種名為 ROLeR 的推薦系統離線強化學習中的新穎基於模型的獎勵成形，用於推薦系統中的獎勵和不確定性估計。具體來說，設計了一種非參數獎勵成形方法來改善獎勵模型。此外，設計了一個靈活且更具代表性的不確定性懲罰，以符合推薦系統的需求。在四個基準資料集上進行的廣泛實驗顯示，與現有的基準相比，ROLeR 達到了最先進的效能。原始碼可於 https://github.com/ArronDZhang/ROLeR 下載。", "author": "Yi Zhang et.al.", "authors": "Yi Zhang, Ruihong Qiu, Jiajun Liu, Sen Wang", "id": "2407.13163v1", "paper_url": "http://arxiv.org/abs/2407.13163v1", "repo": "null"}}