{"2411.07425": {"publish_time": "2024-11-11", "title": "Predicting BWR Criticality with Data-Driven Machine Learning Model", "paper_summary": "One of the challenges in operating nuclear power plants is to decide the\namount of fuel needed in a cycle. Large-scale nuclear power plants are designed\nto operate at base load, meaning that they are expected to always operate at\nfull power. Economically, a nuclear power plant should burn enough fuel to\nmaintain criticality until the end of a cycle (EOC). If the reactor goes\nsubcritical before the end of a cycle, it may result in early coastdown as the\nfuel in the core is already depleted. On contrary, if the reactor still has\nsignificant excess reactivity by the end of a cycle, the remaining fuels will\nremain unused. In both cases, the plant may lose a significant amount of money.\nThis work proposes an innovative method based on a data-driven deep learning\nmodel to estimate the excess criticality of a boiling water reactor.", "paper_summary_zh": "核能電廠運作中的一項挑戰，是要決定一個週期內所需的燃料量。大型核能電廠的設計是基於基本負載運作，表示預期它們總是會以全功率運作。在經濟層面上，核能電廠應該燃燒足夠的燃料，以維持臨界狀態直到週期結束 (EOC)。如果反應器在週期結束前進入次臨界狀態，由於爐心內的燃料已經耗盡，可能會導致提早停機。相反地，如果反應器在週期結束時仍有顯著的過剩反應性，剩餘的燃料將會保持未用。這兩種情況都會讓電廠損失大量金錢。本研究提出一個創新的方法，基於資料驅動的深度學習模型，來估計沸水反應器的過剩臨界性。", "author": "Muhammad Rizki Oktavian et.al.", "authors": "Muhammad Rizki Oktavian, Anirudh Tunga, Jonathan Nistor, James Tusar, J. Thomas Gruenwald, Yunlin Xu", "id": "2411.07425v1", "paper_url": "http://arxiv.org/abs/2411.07425v1", "repo": "null"}}