{"2412.15598": {"publish_time": "2024-12-20", "title": "SODor: Long-Term EEG Partitioning for Seizure Onset Detection", "paper_summary": "Deep learning models have recently shown great success in classifying\nepileptic patients using EEG recordings. Unfortunately, classification-based\nmethods lack a sound mechanism to detect the onset of seizure events. In this\nwork, we propose a two-stage framework, \\method, that explicitly models seizure\nonset through a novel task formulation of subsequence clustering. Given an EEG\nsequence, the framework first learns a set of second-level embeddings with\nlabel supervision. It then employs model-based clustering to explicitly capture\nlong-term temporal dependencies in EEG sequences and identify meaningful\nsubsequences. Epochs within a subsequence share a common cluster assignment\n(normal or seizure), with cluster or state transitions representing successful\nonset detections. Extensive experiments on three datasets demonstrate that our\nmethod can correct misclassifications, achieving 5%-11% classification\nimprovements over other baselines and accurately detecting seizure onsets.", "paper_summary_zh": "深度學習模型最近在使用腦電圖記錄對癲癇患者進行分類方面取得了巨大的成功。不幸的是，基於分類的方法缺乏檢測癲癇發作發作的健全機制。在這項工作中，我們提出了一個兩階段框架，\\method，它通過子序列聚類的新任務表述明確地模擬癲癇發作。給定一個腦電圖序列，該框架首先學習一組具有標籤監督的二級嵌入。然後，它採用基於模型的聚類來明確捕獲腦電圖序列中的長期時間依賴性，並識別有意義的子序列。子序列中的各個時期共享一個公共群集分配（正常或癲癇發作），群集或狀態轉換表示成功的發作檢測。在三個數據集上的大量實驗表明，我們的模型可以糾正錯誤分類，與其他基準相比，分類改進了 5%-11%，並準確檢測癲癇發作。", "author": "Zheng Chen et.al.", "authors": "Zheng Chen, Yasuko Matsubara, Yasushi Sakurai, Jimeng Sun", "id": "2412.15598v1", "paper_url": "http://arxiv.org/abs/2412.15598v1", "repo": "null"}}