{"2502.13595": {"publish_time": "2025-02-19", "title": "MMTEB: Massive Multilingual Text Embedding Benchmark", "paper_summary": "Text embeddings are typically evaluated on a limited set of tasks, which are\nconstrained by language, domain, and task diversity. To address these\nlimitations and provide a more comprehensive evaluation, we introduce the\nMassive Multilingual Text Embedding Benchmark (MMTEB) - a large-scale,\ncommunity-driven expansion of MTEB, covering over 500 quality-controlled\nevaluation tasks across 250+ languages. MMTEB includes a diverse set of\nchallenging, novel tasks such as instruction following, long-document\nretrieval, and code retrieval, representing the largest multilingual collection\nof evaluation tasks for embedding models to date. Using this collection, we\ndevelop several highly multilingual benchmarks, which we use to evaluate a\nrepresentative set of models. We find that while large language models (LLMs)\nwith billions of parameters can achieve state-of-the-art performance on certain\nlanguage subsets and task categories, the best-performing publicly available\nmodel is multilingual-e5-large-instruct with only 560 million parameters. To\nfacilitate accessibility and reduce computational cost, we introduce a novel\ndownsampling method based on inter-task correlation, ensuring a diverse\nselection while preserving relative model rankings. Furthermore, we optimize\ntasks such as retrieval by sampling hard negatives, creating smaller but\neffective splits. These optimizations allow us to introduce benchmarks that\ndrastically reduce computational demands. For instance, our newly introduced\nzero-shot English benchmark maintains a ranking order similar to the full-scale\nversion but at a fraction of the computational cost.", "paper_summary_zh": "文本嵌入通常在受语言、领域和任务多样性限制的一组有限的任务上进行评估。为了解决这些限制并提供更全面的评估，我们引入了大规模多语言文本嵌入基准（MMTEB）——MTEB 的一项大规模、社区驱动的扩展，涵盖了 250 多种语言中的 500 多项质量受控评估任务。MMTEB 包含了一组具有挑战性的新任务，例如指令遵循、长文档检索和代码检索，代表了迄今为止最大的多语言嵌入模型评估任务集合。使用此集合，我们开发了几个高度多语言的基准，我们使用这些基准来评估一组有代表性的模型。我们发现，虽然具有数十亿个参数的大语言模型 (LLM) 可以对某些语言子集和任务类别实现最先进的性能，但性能最佳的公开可用模型是只有 5.6 亿个参数的多语言 e5 大型指令模型。为了便于访问并降低计算成本，我们引入了一种基于任务间相关性的新降采样方法，确保多样化的选择同时保留相对模型排名。此外，我们通过对困难的负样本进行采样来优化检索等任务，创建更小但有效的拆分。这些优化使我们能够引入大幅降低计算需求的基准。例如，我们新引入的零样本英语基准保持了与全规模版本相似的排名顺序，但计算成本只是其一小部分。", "author": "Kenneth Enevoldsen et.al.", "authors": "Kenneth Enevoldsen, Isaac Chung, Imene Kerboua, Márton Kardos, Ashwin Mathur, David Stap, Jay Gala, Wissam Siblini, Dominik Krzemiński, Genta Indra Winata, Saba Sturua, Saiteja Utpala, Mathieu Ciancone, Marion Schaeffer, Gabriel Sequeira, Diganta Misra, Shreeya Dhakal, Jonathan Rystrøm, Roman Solomatin, Ömer Çağatan, Akash Kundu, Martin Bernstorff, Shitao Xiao, Akshita Sukhlecha, Bhavish Pahwa, Rafał Poświata, Kranthi Kiran GV, Shawon Ashraf, Daniel Auras, Björn Plüster, Jan Philipp Harries, Loïc Magne, Isabelle Mohr, Mariya Hendriksen, Dawei Zhu, Hippolyte Gisserot-Boukhlef, Tom Aarsen, Jan Kostkan, Konrad Wojtasik, Taemin Lee, Marek Šuppa, Crystina Zhang, Roberta Rocca, Mohammed Hamdy, Andrianos Michail, John Yang, Manuel Faysse, Aleksei Vatolin, Nandan Thakur, Manan Dey, Dipam Vasani, Pranjal Chitale, Simone Tedeschi, Nguyen Tai, Artem Snegirev, Michael Günther, Mengzhou Xia, Weijia Shi, Xing Han Lù, Jordan Clive, Gayatri Krishnakumar, Anna Maksimova, Silvan Wehrli, Maria Tikhonova, Henil Panchal, Aleksandr Abramov, Malte Ostendorff, Zheng Liu, Simon Clematide, Lester James Miranda, Alena Fenogenova, Guangyu Song, Ruqiya Bin Safi, Wen-Ding Li, Alessia Borghini, Federico Cassano, Hongjin Su, Jimmy Lin, Howard Yen, Lasse Hansen, Sara Hooker, Chenghao Xiao, Vaibhav Adlakha, Orion Weller, Siva Reddy, Niklas Muennighoff", "id": "2502.13595v1", "paper_url": "http://arxiv.org/abs/2502.13595v1", "repo": "null"}}