{"2306.07306": {"publish_time": "2023-06-12", "title": "Active Globally Explainable Learning for Medical Images via Class Association Embedding and Cyclic Adversarial Generation", "paper_summary": "Explainability poses a major challenge to artificial intelligence (AI)\ntechniques. Current studies on explainable AI (XAI) lack the efficiency of\nextracting global knowledge about the learning task, thus suffer deficiencies\nsuch as imprecise saliency, context-aware absence and vague meaning. In this\npaper, we propose the class association embedding (CAE) approach to address\nthese issues. We employ an encoder-decoder architecture to embed sample\nfeatures and separate them into class-related and individual-related style\nvectors simultaneously. Recombining the individual-style code of a given sample\nwith the class-style code of another leads to a synthetic sample with preserved\nindividual characters but changed class assignment, following a cyclic\nadversarial learning strategy. Class association embedding distills the global\nclass-related features of all instances into a unified domain with well\nseparation between classes. The transition rules between different classes can\nbe then extracted and further employed to individual instances. We then propose\nan active XAI framework which manipulates the class-style vector of a certain\nsample along guided paths towards the counter-classes, resulting in a series of\ncounter-example synthetic samples with identical individual characters.\nComparing these counterfactual samples with the original ones provides a\nglobal, intuitive illustration to the nature of the classification tasks. We\nadopt the framework on medical image classification tasks, which show that more\nprecise saliency maps with powerful context-aware representation can be\nachieved compared with existing methods. Moreover, the disease pathology can be\ndirectly visualized via traversing the paths in the class-style space.", "paper_summary_zh": "", "author": "Ruitao Xie et.al.", "authors": "Ruitao Xie,Jingbang Chen,Limai Jiang,Rui Xiao,Yi Pan,Yunpeng Cai", "id": "2306.07306v1", "paper_url": "http://arxiv.org/abs/2306.07306v1", "repo": "null"}}