{"2408.12214": {"publish_time": "2024-08-22", "title": "UNCO: Towards Unifying Neural Combinatorial Optimization through Large Language Model", "paper_summary": "Recently, applying neural networks to address combinatorial optimization\nproblems (COPs) has attracted considerable research attention. The prevailing\nmethods always train deep models independently on specific problems, lacking a\nunified framework for concurrently tackling various COPs. To this end, we\npropose a unified neural combinatorial optimization (UNCO) framework to solve\ndifferent types of COPs by a single model. Specifically, we use natural\nlanguage to formulate text-attributed instances for different COPs and encode\nthem in the same embedding space by the large language model (LLM). The\nobtained embeddings are further advanced by an encoder-decoder model without\nany problem-specific modules, thereby facilitating a unified process of\nsolution construction. We further adopt the conflict gradients erasing\nreinforcement learning (CGERL) algorithm to train the UNCO model, delivering\nbetter performance across different COPs than vanilla multi-objective learning.\nExperiments show that the UNCO model can solve multiple COPs after a\nsingle-session training, and achieves satisfactory performance that is\ncomparable to several traditional or learning-based baselines. Instead of\npursuing the best performance for each COP, we explore the synergy between\ntasks and few-shot generalization based on LLM to inspire future work.", "paper_summary_zh": "<paragraph>最近，将神经网络应用于解决组合优化问题（COP）引起了相当大的研究关注。现行的做法是针对特定问题独立训练深度模型，缺乏用于同时解决各种 COP 的统一框架。为此，我们提出了一个统一的神经组合优化（UNCO）框架，通过单个模型解决不同类型的 COP。具体来说，我们使用自然语言为不同的 COP 制定文本属性实例，并通过大型语言模型（LLM）将它们编码在相同的嵌入空间中。获得的嵌入通过一个编码器-解码器模型进一步提升，没有任何特定于问题的模块，从而促进了解决方案构建的统一过程。我们进一步采用冲突梯度擦除强化学习（CGERL）算法来训练 UNCO 模型，在不同的 COP 中提供比香草多目标学习更好的性能。实验表明，UNCO 模型可以在单次训练后解决多个 COP，并且取得了令人满意的性能，与几个传统的或基于学习的基线相当。我们没有追求每个 COP 的最佳性能，而是探索任务之间的协同作用和基于 LLM 的小样本泛化，以激发未来的工作。</paragraph>", "author": "Xia Jiang et.al.", "authors": "Xia Jiang, Yaoxin Wu, Yuan Wang, Yingqian Zhang", "id": "2408.12214v1", "paper_url": "http://arxiv.org/abs/2408.12214v1", "repo": "null"}}