{"2405.16413": {"publish_time": "2024-05-26", "title": "Augmented Risk Prediction for the Onset of Alzheimer's Disease from Electronic Health Records with Large Language Models", "paper_summary": "Alzheimer's disease (AD) is the fifth-leading cause of death among Americans\naged 65 and older. Screening and early detection of AD and related dementias\n(ADRD) are critical for timely intervention and for identifying clinical trial\nparticipants. The widespread adoption of electronic health records (EHRs)\noffers an important resource for developing ADRD screening tools such as\nmachine learning based predictive models. Recent advancements in large language\nmodels (LLMs) demonstrate their unprecedented capability of encoding knowledge\nand performing reasoning, which offers them strong potential for enhancing risk\nprediction. This paper proposes a novel pipeline that augments risk prediction\nby leveraging the few-shot inference power of LLMs to make predictions on cases\nwhere traditional supervised learning methods (SLs) may not excel.\nSpecifically, we develop a collaborative pipeline that combines SLs and LLMs\nvia a confidence-driven decision-making mechanism, leveraging the strengths of\nSLs in clear-cut cases and LLMs in more complex scenarios. We evaluate this\npipeline using a real-world EHR data warehouse from Oregon Health \\& Science\nUniversity (OHSU) Hospital, encompassing EHRs from over 2.5 million patients\nand more than 20 million patient encounters. Our results show that our proposed\napproach effectively combines the power of SLs and LLMs, offering significant\nimprovements in predictive performance. This advancement holds promise for\nrevolutionizing ADRD screening and early detection practices, with potential\nimplications for better strategies of patient management and thus improving\nhealthcare.", "paper_summary_zh": "阿茲海默症 (AD) 是 65 歲以上美國人的第五大死因。AD 和相關失智症 (ADRD) 的篩檢和早期偵測對於及時介入和找出臨床試驗參與者至關重要。電子病歷 (EHRs) 的廣泛採用提供了開發 ADRD 篩檢工具的重要資源，例如基於機器學習的預測模型。大型語言模型 (LLM) 的最新進展展示出其編碼知識和執行推理的空前能力，這為增強風險預測提供了強大的潛力。本文提出了一個創新的管道，它通過利用 LLM 的少量推理能力來增強風險預測，對傳統監督式學習方法 (SL) 可能無法勝任的案例進行預測。具體來說，我們開發了一個協作管道，通過信心驅動的決策機制將 SL 和 LLM 結合起來，利用 SL 在明確案例中的優勢和 LLM 在更複雜場景中的優勢。我們使用來自俄勒岡州健康與科學大學 (OHSU) 醫院的真實世界 EHR 資料倉庫評估了這個管道，其中包含來自 250 多萬名患者和 2000 多萬次患者就診的 EHR。我們的結果表明，我們提出的方法有效地結合了 SL 和 LLM 的優勢，在預測性能方面提供了顯著的改進。這項進展有望革新 ADRD 篩檢和早期偵測實務，對患者管理的更好策略以及改善醫療保健具有潛在影響。", "author": "Jiankun Wang et.al.", "authors": "Jiankun Wang, Sumyeong Ahn, Taykhoom Dalal, Xiaodan Zhang, Weishen Pan, Qiannan Zhang, Bin Chen, Hiroko H. Dodge, Fei Wang, Jiayu Zhou", "id": "2405.16413v1", "paper_url": "http://arxiv.org/abs/2405.16413v1", "repo": "null"}}