{"2410.05044": {"publish_time": "2024-10-07", "title": "PhotoReg: Photometrically Registering 3D Gaussian Splatting Models", "paper_summary": "Building accurate representations of the environment is critical for\nintelligent robots to make decisions during deployment. Advances in\nphotorealistic environment models have enabled robots to develop\nhyper-realistic reconstructions, which can be used to generate images that are\nintuitive for human inspection. In particular, the recently introduced\n\\ac{3DGS}, which describes the scene with up to millions of primitive\nellipsoids, can be rendered in real time. \\ac{3DGS} has rapidly gained\nprominence. However, a critical unsolved problem persists: how can we fuse\nmultiple \\ac{3DGS} into a single coherent model? Solving this problem will\nenable robot teams to jointly build \\ac{3DGS} models of their surroundings. A\nkey insight of this work is to leverage the {duality} between photorealistic\nreconstructions, which render realistic 2D images from 3D structure, and\n\\emph{3D foundation models}, which predict 3D structure from image pairs. To\nthis end, we develop PhotoReg, a framework to register multiple photorealistic\n\\ac{3DGS} models with 3D foundation models. As \\ac{3DGS} models are generally\nbuilt from monocular camera images, they have \\emph{arbitrary scale}. To\nresolve this, PhotoReg actively enforces scale consistency among the different\n\\ac{3DGS} models by considering depth estimates within these models. Then, the\nalignment is iteratively refined with fine-grained photometric losses to\nproduce high-quality fused \\ac{3DGS} models. We rigorously evaluate PhotoReg on\nboth standard benchmark datasets and our custom-collected datasets, including\nwith two quadruped robots. The code is released at\n\\url{ziweny11.github.io/photoreg}.", "paper_summary_zh": "<paragraph>建立環境的精確表示對於智慧型機器人在部署期間做出決策至關重要。寫實環境模型的進步使機器人能夠開發超寫實重建，可據此產生直覺上讓人類檢視的影像。特別是最近推出的 3DGS，其以多達數百萬個原始橢球體描述場景，可即時呈現。3DGS 已迅速獲得重視。然而，仍存在一個關鍵的未解決問題：我們如何將多個 3DGS 融合成一個單一的相容模型？解決此問題將使機器人團隊能夠共同建立其周圍環境的 3DGS 模型。此項工作的關鍵見解是利用寫實重建（從 3D 結構呈現寫實的 2D 影像）與 3D 基礎模型（從影像對預測 3D 結構）之間的對偶性。為此，我們開發了 PhotoReg，一個用於將多個寫實 3DGS 模型與 3D 基礎模型註冊的架構。由於 3DGS 模型通常建構自單眼相機影像，因此它們具有任意比例。為了解決這個問題，PhotoReg 透過考量這些模型內的深度估計，積極強制執行不同 3DGS 模型之間的比例一致性。然後，透過細緻的光度損失反覆調整比對，以產生高品質的融合 3DGS 模型。我們在標準基準資料集和我們自訂收集的資料集（包括兩個四足機器人）上嚴格評估 PhotoReg。程式碼已在 ziweny11.github.io/photoreg 發布。</paragraph>", "author": "Ziwen Yuan et.al.", "authors": "Ziwen Yuan, Tianyi Zhang, Matthew Johnson-Roberson, Weiming Zhi", "id": "2410.05044v1", "paper_url": "http://arxiv.org/abs/2410.05044v1", "repo": "null"}}