{"2411.08469": {"publish_time": "2024-11-13", "title": "Building Trustworthy AI: Transparent AI Systems via Large Language Models, Ontologies, and Logical Reasoning (TranspNet)", "paper_summary": "Growing concerns over the lack of transparency in AI, particularly in\nhigh-stakes fields like healthcare and finance, drive the need for explainable\nand trustworthy systems. While Large Language Models (LLMs) perform\nexceptionally well in generating accurate outputs, their \"black box\" nature\nposes significant challenges to transparency and trust. To address this, the\npaper proposes the TranspNet pipeline, which integrates symbolic AI with LLMs.\nBy leveraging domain expert knowledge, retrieval-augmented generation (RAG),\nand formal reasoning frameworks like Answer Set Programming (ASP), TranspNet\nenhances LLM outputs with structured reasoning and verification. This approach\nensures that AI systems deliver not only accurate but also explainable and\ntrustworthy results, meeting regulatory demands for transparency and\naccountability. TranspNet provides a comprehensive solution for developing AI\nsystems that are reliable and interpretable, making it suitable for real-world\napplications where trust is critical.", "paper_summary_zh": "由於對 AI 缺乏透明度的擔憂日益加劇，尤其是在醫療保健和金融等高風險領域，因此需要可解釋且可信賴的系統。雖然大型語言模型 (LLM) 在產生準確輸出方面表現得非常好，但其「黑盒子」性質對透明度和信任構成了重大挑戰。為了解決此問題，本文提出了 TranspNet 管道，它將符號 AI 與 LLM 整合在一起。TranspNet 透過利用領域專家知識、檢索增強產生 (RAG) 和形式推理框架（例如 Answer Set Programming (ASP)），使用結構化推理和驗證來增強 LLM 輸出。此方法可確保 AI 系統不僅能提供準確的結果，還能提供可解釋且可信賴的結果，以滿足法規對透明度和問責制的需求。TranspNet 為開發可靠且可解釋的 AI 系統提供了一個全面的解決方案，使其適用於信任至關重要的實際應用。", "author": "Fadi Al Machot et.al.", "authors": "Fadi Al Machot, Martin Thomas Horsch, Habib Ullah", "id": "2411.08469v1", "paper_url": "http://arxiv.org/abs/2411.08469v1", "repo": "null"}}