{"2405.07411": {"publish_time": "2024-05-13", "title": "MoVL:Exploring Fusion Strategies for the Domain-Adaptive Application of Pretrained Models in Medical Imaging Tasks", "paper_summary": "Medical images are often more difficult to acquire than natural images due to\nthe specialism of the equipment and technology, which leads to less medical\nimage datasets. So it is hard to train a strong pretrained medical vision\nmodel. How to make the best of natural pretrained vision model and adapt in\nmedical domain still pends. For image classification, a popular method is\nlinear probe (LP). However, LP only considers the output after feature\nextraction. Yet, there exists a gap between input medical images and natural\npretrained vision model. We introduce visual prompting (VP) to fill in the gap,\nand analyze the strategies of coupling between LP and VP. We design a joint\nlearning loss function containing categorisation loss and discrepancy loss,\nwhich describe the variance of prompted and plain images, naming this joint\ntraining strategy MoVL (Mixture of Visual Prompting and Linear Probe). We\nexperiment on 4 medical image classification datasets, with two mainstream\narchitectures, ResNet and CLIP. Results shows that without changing the\nparameters and architecture of backbone model and with less parameters, there\nis potential for MoVL to achieve full finetune (FF) accuracy (on four medical\ndatasets, average 90.91% for MoVL and 91.13% for FF). On out of distribution\nmedical dataset, our method(90.33%) can outperform FF (85.15%) with absolute\n5.18 % lead.", "paper_summary_zh": "医学影像通常比自然影像更难获取，这是因为设备和技术的专业性，导致医学影像数据集较少。因此，很难训练一个强大的医学视觉模型。如何充分利用自然预训练视觉模型并在医学领域进行调整仍然悬而未决。对于图像分类，一种流行的方法是线性探针 (LP)。然而，LP 仅考虑特征提取后的输出。然而，输入医学图像和自然预训练视觉模型之间存在差距。我们引入视觉提示 (VP) 来填补这一空白，并分析 LP 和 VP 之间的耦合策略。我们设计了一个包含分类损失和差异损失的联合学习损失函数，描述了提示图像和普通图像的差异，并将这种联合训练策略命名为 MoVL（视觉提示和线性探针的混合）。我们在 4 个医学图像分类数据集上进行实验，使用两种主流架构 ResNet 和 CLIP。结果表明，在不改变骨干模型的参数和架构且参数更少的情况下，MoVL 有可能达到完全微调 (FF) 准确度（在四个医学数据集上，MoVL 平均为 90.91%，FF 为 91.13%）。在分布外的医学数据集上，我们的方法 (90.33%) 可以以绝对 5.18% 的领先优势优于 FF (85.15%)。", "author": "Haijiang Tian et.al.", "authors": "Haijiang Tian, Jingkun Yue, Xiaohong Liu, Guoxing Yang, Zeyu Jiang, Guangyu Wang", "id": "2405.07411v1", "paper_url": "http://arxiv.org/abs/2405.07411v1", "repo": "null"}}