{"2409.17864": {"publish_time": "2024-09-26", "title": "A Multimodal Single-Branch Embedding Network for Recommendation in Cold-Start and Missing Modality Scenarios", "paper_summary": "Most recommender systems adopt collaborative filtering (CF) and provide\nrecommendations based on past collective interactions. Therefore, the\nperformance of CF algorithms degrades when few or no interactions are\navailable, a scenario referred to as cold-start. To address this issue,\nprevious work relies on models leveraging both collaborative data and side\ninformation on the users or items. Similar to multimodal learning, these models\naim at combining collaborative and content representations in a shared\nembedding space. In this work we propose a novel technique for multimodal\nrecommendation, relying on a multimodal Single-Branch embedding network for\nRecommendation (SiBraR). Leveraging weight-sharing, SiBraR encodes interaction\ndata as well as multimodal side information using the same single-branch\nembedding network on different modalities. This makes SiBraR effective in\nscenarios of missing modality, including cold start. Our extensive experiments\non large-scale recommendation datasets from three different recommendation\ndomains (music, movie, and e-commerce) and providing multimodal content\ninformation (audio, text, image, labels, and interactions) show that SiBraR\nsignificantly outperforms CF as well as state-of-the-art content-based RSs in\ncold-start scenarios, and is competitive in warm scenarios. We show that\nSiBraR's recommendations are accurate in missing modality scenarios, and that\nthe model is able to map different modalities to the same region of the shared\nembedding space, hence reducing the modality gap.", "paper_summary_zh": "大多數推薦系統採用協同過濾（CF），並根據過去的集體互動提供建議。因此，當互動很少或根本沒有互動時，CF 演算法的效能會下降，這種情況稱為冷啟動。為了解決這個問題，先前的研究依賴於利用協同資料和使用者或項目側邊資訊的模型。與多模態學習類似，這些模型旨在將協同和內容表示結合在共享嵌入空間中。在這項研究中，我們提出了一種多模態推薦的新技術，依賴於用於推薦的多模態單分支嵌入網路（SiBraR）。SiBraR 利用權重共享，使用相同的單分支嵌入網路對不同模態的互動資料和多模態側邊資訊進行編碼。這使得 SiBraR 在遺失模態的情況下（包括冷啟動）有效。我們針對來自三個不同推薦領域（音樂、電影和電子商務）的大規模推薦資料集進行的廣泛實驗，並提供多模態內容資訊（音訊、文字、影像、標籤和互動），顯示 SiBraR 在冷啟動情況下顯著優於 CF 以及最先進的基於內容的 RS，並且在熱啟動情況下具有競爭力。我們展示了 SiBraR 的推薦在遺失模態情況下是準確的，並且該模型能夠將不同的模態對應到共享嵌入空間的相同區域，從而縮小模態差距。", "author": "Christian Ganhör et.al.", "authors": "Christian Ganhör, Marta Moscati, Anna Hausberger, Shah Nawaz, Markus Schedl", "id": "2409.17864v1", "paper_url": "http://arxiv.org/abs/2409.17864v1", "repo": "null"}}