{"2407.19984": {"publish_time": "2024-07-29", "title": "Confidence Estimation for Automatic Detection of Depression and Alzheimer's Disease Based on Clinical Interviews", "paper_summary": "Speech-based automatic detection of Alzheimer's disease (AD) and depression\nhas attracted increased attention. Confidence estimation is crucial for a\ntrust-worthy automatic diagnostic system which informs the clinician about the\nconfidence of model predictions and helps reduce the risk of misdiagnosis. This\npaper investigates confidence estimation for automatic detection of AD and\ndepression based on clinical interviews. A novel Bayesian approach is proposed\nwhich uses a dynamic Dirichlet prior distribution to model the second-order\nprobability of the predictive distribution. Experimental results on the\npublicly available ADReSS and DAIC-WOZ datasets demonstrate that the proposed\nmethod outperforms a range of baselines for both classification accuracy and\nconfidence estimation.", "paper_summary_zh": "基於語言的阿茲海默症 (AD) 和憂鬱症自動偵測引起了更多關注。對於一個值得信賴的自動診斷系統而言，信心估計至關重要，它會告知臨床醫生模型預測的信心並有助於降低誤診風險。本文探討了基於臨床訪談對 AD 和憂鬱症進行自動偵測的信心估計。提出了一種新的貝氏方法，它使用動態 Dirichlet 先驗分佈來對預測分佈的二階機率進行建模。在公開的 ADReSS 和 DAIC-WOZ 資料集上的實驗結果表明，所提出的方法在分類準確度和信心估計方面優於一系列基準。", "author": "Wen Wu et.al.", "authors": "Wen Wu, Chao Zhang, Philip C. Woodland", "id": "2407.19984v1", "paper_url": "http://arxiv.org/abs/2407.19984v1", "repo": "null"}}