{"2406.12593": {"publish_time": "2024-06-18", "title": "PromptDSI: Prompt-based Rehearsal-free Instance-wise Incremental Learning for Document Retrieval", "paper_summary": "Differentiable Search Index (DSI) utilizes Pre-trained Language Models (PLMs)\nfor efficient document retrieval without relying on external indexes. However,\nDSIs need full re-training to handle updates in dynamic corpora, causing\nsignificant computational inefficiencies. We introduce PromptDSI, a\nrehearsal-free, prompt-based approach for instance-wise incremental learning in\ndocument retrieval. PromptDSI attaches prompts to the frozen PLM's encoder of\nDSI, leveraging its powerful representation to efficiently index new corpora\nwhile maintaining a balance between stability and plasticity. We eliminate the\ninitial forward pass of prompt-based continual learning methods that doubles\ntraining and inference time. Moreover, we propose a topic-aware prompt pool\nthat employs neural topic embeddings as fixed keys. This strategy ensures\ndiverse and effective prompt usage, addressing the challenge of parameter\nunderutilization caused by the collapse of the query-key matching mechanism.\nOur empirical evaluations demonstrate that PromptDSI matches IncDSI in managing\nforgetting while significantly enhancing recall by over 4% on new corpora.", "paper_summary_zh": "可微分搜尋索引 (DSI) 利用預先訓練的語言模型 (PLM)\n進行有效的文件檢索，而無需依賴外部索引。然而，\nDSI 需要進行完整的重新訓練才能處理動態語料庫中的更新，這會造成\n顯著的運算效率低下。我們介紹了 PromptDSI，一種\n無需彩排、基於提示的即時式增量學習方法，用於\n文件檢索。PromptDSI 將提示附加到 DSI 的凍結 PLM 編碼器，利用其強大的表示來有效地索引新的語料庫\n同時在穩定性和可塑性之間取得平衡。我們消除了基於提示的持續學習方法的初始前向傳遞，這會使\n訓練和推理時間加倍。此外，我們提出了主題感知提示池\n採用神經主題嵌入作為固定鍵。此策略可確保\n提示使用多樣化且有效，解決了查詢鍵匹配機制崩潰導致的參數利用不足的挑戰。\n我們的經驗評估表明，PromptDSI 在管理\n遺忘時與 IncDSI 相匹配，同時在新的語料庫中將召回率顯著提高了 4% 以上。", "author": "Tuan-Luc Huynh et.al.", "authors": "Tuan-Luc Huynh, Thuy-Trang Vu, Weiqing Wang, Yinwei Wei, Trung Le, Dragan Gasevic, Yuan-Fang Li, Thanh-Toan Do", "id": "2406.12593v1", "paper_url": "http://arxiv.org/abs/2406.12593v1", "repo": "null"}}