{"2404.13139": {"publish_time": "2024-04-19", "title": "Explainable AI for Fair Sepsis Mortality Predictive Model", "paper_summary": "Artificial intelligence supports healthcare professionals with predictive\nmodeling, greatly transforming clinical decision-making. This study addresses\nthe crucial need for fairness and explainability in AI applications within\nhealthcare to ensure equitable outcomes across diverse patient demographics. By\nfocusing on the predictive modeling of sepsis-related mortality, we propose a\nmethod that learns a performance-optimized predictive model and then employs\nthe transfer learning process to produce a model with better fairness. Our\nmethod also introduces a novel permutation-based feature importance algorithm\naiming at elucidating the contribution of each feature in enhancing fairness on\npredictions. Unlike existing explainability methods concentrating on explaining\nfeature contribution to predictive performance, our proposed method uniquely\nbridges the gap in understanding how each feature contributes to fairness. This\nadvancement is pivotal, given sepsis's significant mortality rate and its role\nin one-third of hospital deaths. Our method not only aids in identifying and\nmitigating biases within the predictive model but also fosters trust among\nhealthcare stakeholders by improving the transparency and fairness of model\npredictions, thereby contributing to more equitable and trustworthy healthcare\ndelivery.", "paper_summary_zh": "人工智慧透過預測模型協助醫療專業人員，大幅轉變了臨床決策制定。本研究探討了在醫療保健中使用人工智慧應用程式時公平性和可解釋性的關鍵需求，以確保在不同的患者人口統計資料中獲得公平的結果。透過專注於敗血症相關死亡率的預測模型，我們提出了一種方法，該方法會學習一個效能最佳化的預測模型，然後採用轉移學習過程來產生一個具有更好公平性的模型。我們的模型還引入了一種新穎的基於排列的特徵重要性演算法，旨在闡明每個特徵在增強預測公平性方面的貢獻。與現有的可解釋性方法專注於解釋特徵對預測效能的貢獻不同，我們提出的方法獨特地彌補了理解每個特徵如何有助於公平性的差距。這項進展至關重要，因為敗血症的死亡率很高，且在三分之一的醫院死亡中扮演著角色。我們的模型不僅有助於識別和減輕預測模型中的偏差，還能透過提高模型預測的透明度和公平性來培養醫療保健利益相關者之間的信任，進而有助於提供更公平且值得信賴的醫療保健服務。", "author": "Chia-Hsuan Chang et.al.", "authors": "Chia-Hsuan Chang, Xiaoyang Wang, Christopher C. Yang", "id": "2404.13139v1", "paper_url": "http://arxiv.org/abs/2404.13139v1", "repo": "null"}}