{"2502.13870": {"publish_time": "2025-02-19", "title": "SPEX: Scaling Feature Interaction Explanations for LLMs", "paper_summary": "Large language models (LLMs) have revolutionized machine learning due to\ntheir ability to capture complex interactions between input features. Popular\npost-hoc explanation methods like SHAP provide marginal feature attributions,\nwhile their extensions to interaction importances only scale to small input\nlengths ($\\approx 20$). We propose Spectral Explainer (SPEX), a model-agnostic\ninteraction attribution algorithm that efficiently scales to large input\nlengths ($\\approx 1000)$. SPEX exploits underlying natural sparsity among\ninteractions -- common in real-world data -- and applies a sparse Fourier\ntransform using a channel decoding algorithm to efficiently identify important\ninteractions. We perform experiments across three difficult long-context\ndatasets that require LLMs to utilize interactions between inputs to complete\nthe task. For large inputs, SPEX outperforms marginal attribution methods by up\nto 20% in terms of faithfully reconstructing LLM outputs. Further, SPEX\nsuccessfully identifies key features and interactions that strongly influence\nmodel output. For one of our datasets, HotpotQA, SPEX provides interactions\nthat align with human annotations. Finally, we use our model-agnostic approach\nto generate explanations to demonstrate abstract reasoning in closed-source\nLLMs (GPT-4o mini) and compositional reasoning in vision-language models.", "paper_summary_zh": "大型語言模型 (LLM) 由於能夠捕捉輸入特徵之間的複雜交互作用，因此徹底改變了機器學習。熱門的後設解釋方法（如 SHAP）提供邊際特徵歸因，而其交互重要性擴充套件僅能擴充套件至較小的輸入長度（≈ 20）。我們提出一種模型不可知互動歸因演算法，稱為 Spectral Explainer (SPEX)，它能有效擴充套件至較大的輸入長度（≈ 1000）。SPEX 利用交互作用之間的自然稀疏性（在現實世界資料中很常見），並使用通道解碼演算法應用稀疏傅立葉轉換，以有效找出重要的交互作用。我們在三個困難的長脈絡資料集上執行實驗，這些資料集需要 LLM 利用輸入之間的交互作用才能完成任務。對於大型輸入，SPEX 在忠實重建 LLM 輸出的方面，比邊際歸因方法高出 20%。此外，SPEX 成功找出強烈影響模型輸出的關鍵特徵和交互作用。對於我們的其中一個資料集 HotpotQA，SPEX 提供與人類註解一致的交互作用。最後，我們使用我們的模型不可知方法來產生解釋，以展示閉源 LLM（GPT-4o mini）中的抽象推理和視覺語言模型中的組合推理。", "author": "Justin Singh Kang et.al.", "authors": "Justin Singh Kang, Landon Butler, Abhineet Agarwal, Yigit Efe Erginbas, Ramtin Pedarsani, Kannan Ramchandran, Bin Yu", "id": "2502.13870v1", "paper_url": "http://arxiv.org/abs/2502.13870v1", "repo": "https://github.com/basics-lab/spectral-explain"}}