{"2410.09643": {"publish_time": "2024-10-12", "title": "Multimodal Physical Activity Forecasting in Free-Living Clinical Settings: Hunting Opportunities for Just-in-Time Interventions", "paper_summary": "Objective: This research aims to develop a lifestyle intervention system,\ncalled MoveSense, that forecasts a patient's activity behavior to allow for\nearly and personalized interventions in real-world clinical environments.\nMethods: We conducted two clinical studies involving 58 prediabetic veterans\nand 60 patients with obstructive sleep apnea to gather multimodal behavioral\ndata using wearable devices. We develop multimodal long short-term memory\n(LSTM) network models, which are capable of forecasting the number of step\ncounts of a patient up to 24 hours in advance by examining data from activity\nand engagement modalities. Furthermore, we design goal-based forecasting models\nto predict whether a person's next-day steps will be over a certain threshold.\nResults: Multimodal LSTM with early fusion achieves 33% and 37% lower mean\nabsolute errors than linear regression and ARIMA respectively on the\nprediabetes dataset. LSTM also outperforms linear regression and ARIMA with a\nmargin of 13% and 32% on the sleep dataset. Multimodal forecasting models also\nperform with 72% and 79% accuracy on the prediabetes dataset and sleep dataset\nrespectively on goal-based forecasting. Conclusion: Our experiments conclude\nthat multimodal LSTM models with early fusion are better than multimodal LSTM\nwith late fusion and unimodal LSTM models and also than ARIMA and linear\nregression models. Significance: We address an important and challenging task\nof time-series forecasting in uncontrolled environments. Effective forecasting\nof a person's physical activity can aid in designing adaptive behavioral\ninterventions to keep the user engaged and adherent to a prescribed routine.", "paper_summary_zh": "目標：本研究旨在開發一種生活型態介入系統，稱為 MoveSense，可預測病患的活動行為，以便在現實世界的臨床環境中進行早期且個人化的介入。\n方法：我們進行了兩項臨床研究，涉及 58 位糖尿病前期退伍軍人和 60 位阻塞性睡眠呼吸中止症患者，以使用穿戴式裝置收集多模式行為數據。我們開發了多模式長短期記憶 (LSTM) 網路模型，它能夠透過檢查活動和參與模式的數據，預測病患在 24 小時內踏出的步數。此外，我們設計了基於目標的預測模型，以預測某人的隔日步數是否會超過某個閾值。\n結果：多模式 LSTM 與早期融合在糖尿病前期數據集上實現的平均絕對誤差比線性回歸和 ARIMA 分別低 33% 和 37%。LSTM 在睡眠數據集上也以 13% 和 32% 的幅度優於線性回歸和 ARIMA。多模式預測模型在糖尿病前期數據集和睡眠數據集上也分別以 72% 和 79% 的準確度執行基於目標的預測。結論：我們的實驗得出結論，具有早期融合的多模式 LSTM 模型比具有後期融合的多模式 LSTM 模型和單模式 LSTM 模型更好，也比 ARIMA 和線性回歸模型更好。意義：我們解決了在不受控環境中進行時間序列預測的一項重要且具有挑戰性的任務。有效預測個人的身體活動有助於設計適應性行為介入措施，以保持使用者參與並遵守規定的例行公事。", "author": "Abdullah Mamun et.al.", "authors": "Abdullah Mamun, Krista S. Leonard, Megan E. Petrov, Matthew P. Buman, Hassan Ghasemzadeh", "id": "2410.09643v1", "paper_url": "http://arxiv.org/abs/2410.09643v1", "repo": "https://github.com/ab9mamun/movesense"}}