{"2408.04817": {"publish_time": "2024-08-09", "title": "Performance Metric for Multiple Anomaly Score Distributions with Discrete Severity Levels", "paper_summary": "The rise of smart factories has heightened the demand for automated\nmaintenance, and normal-data-based anomaly detection has proved particularly\neffective in environments where anomaly data are scarce. This method, which\ndoes not require anomaly data during training, has prompted researchers to\nfocus not only on detecting anomalies but also on classifying severity levels\nby using anomaly scores. However, the existing performance metrics, such as the\narea under the receiver operating characteristic curve (AUROC), do not\neffectively reflect the performance of models in classifying severity levels\nbased on anomaly scores. To address this limitation, we propose the weighted\nsum of the area under the receiver operating characteristic curve (WS-AUROC),\nwhich combines AUROC with a penalty for severity level differences. We\nconducted various experiments using different penalty assignment methods:\nuniform penalty regardless of severity level differences, penalty based on\nseverity level index differences, and penalty based on actual physical\nquantities that cause anomalies. The latter method was the most sensitive.\nAdditionally, we propose an anomaly detector that achieves clear separation of\ndistributions and outperforms the ablation models on the WS-AUROC and AUROC\nmetrics.", "paper_summary_zh": "智慧工廠的興起提高了對自動化維護的需求，而基於正常資料的異常偵測已證明在異常資料稀少的環境中特別有效。此方法在訓練期間不需要異常資料，已促使研究人員不僅專注於偵測異常，還專注於透過異常分數對嚴重性等級進行分類。然而，現有的效能指標，例如受試者操作特徵曲線下面積 (AUROC)，無法有效反映模型在基於異常分數對嚴重性等級進行分類時的效能。為了解決此限制，我們提出加權受試者操作特徵曲線下面積 (WS-AUROC)，它結合 AUROC 與嚴重性等級差異的懲罰。我們使用不同的懲罰分配方法進行了各種實驗：不論嚴重性等級差異的均勻懲罰、基於嚴重性等級指標差異的懲罰，以及基於導致異常的實際物理量的懲罰。後一種方法最靈敏。此外，我們提出一個異常偵測器，它能清楚區分分佈，且在 WS-AUROC 和 AUROC 指標上優於消融模型。", "author": "Wonjun Yi et.al.", "authors": "Wonjun Yi, Yong-Hwa Park, Wonho Jung", "id": "2408.04817v1", "paper_url": "http://arxiv.org/abs/2408.04817v1", "repo": "https://github.com/jim8220/ws-auroc"}}