{"2409.15902": {"publish_time": "2024-09-24", "title": "Konstruktor: A Strong Baseline for Simple Knowledge Graph Question Answering", "paper_summary": "While being one of the most popular question types, simple questions such as\n\"Who is the author of Cinderella?\", are still not completely solved.\nSurprisingly, even the most powerful modern Large Language Models are prone to\nerrors when dealing with such questions, especially when dealing with rare\nentities. At the same time, as an answer may be one hop away from the question\nentity, one can try to develop a method that uses structured knowledge graphs\n(KGs) to answer such questions. In this paper, we introduce Konstruktor - an\nefficient and robust approach that breaks down the problem into three steps:\n(i) entity extraction and entity linking, (ii) relation prediction, and (iii)\nquerying the knowledge graph. Our approach integrates language models and\nknowledge graphs, exploiting the power of the former and the interpretability\nof the latter. We experiment with two named entity recognition and entity\nlinking methods and several relation detection techniques. We show that for\nrelation detection, the most challenging step of the workflow, a combination of\nrelation classification/generation and ranking outperforms other methods. We\nreport Konstruktor's strong results on four datasets.", "paper_summary_zh": "儘管是最常見的問題類型之一，但諸如「灰姑娘的作者是誰？」這類簡單的問題仍未完全獲得解答。令人驚訝的是，即使是最強大的現代大型語言模型在處理此類問題時也容易出錯，特別是在處理罕見實體時。與此同時，由於答案可能距離問題實體僅一步之遙，因此可以嘗試開發一種使用結構化知識圖譜 (KG) 來回答此類問題的方法。在本文中，我們介紹 Konstruktor - 一種高效且強大的方法，它將問題分解為三個步驟：(i) 實體萃取和實體連結、(ii) 關係預測以及 (iii) 查詢知識圖譜。我們的做法整合了語言模型和知識圖譜，發揮了前者的能力和後者的可解釋性。我們實驗了兩種命名實體識別和實體連結方法以及多種關係偵測技術。我們表明，對於關係偵測，也就是工作流程中最具挑戰性的步驟，關係分類/生成和排名相結合的組合優於其他方法。我們報告了 Konstruktor 在四個資料集上的強勁成果。", "author": "Maria Lysyuk et.al.", "authors": "Maria Lysyuk, Mikhail Salnikov, Pavel Braslavski, Alexander Panchenko", "id": "2409.15902v1", "paper_url": "http://arxiv.org/abs/2409.15902v1", "repo": "https://github.com/s-nlp/konstruktor"}}