{"2501.03783": {"publish_time": "2025-01-07", "title": "How to Select Pre-Trained Code Models for Reuse? A Learning Perspective", "paper_summary": "Pre-training a language model and then fine-tuning it has shown to be an\nefficient and effective technique for a wide range of code intelligence tasks,\nsuch as code generation, code summarization, and vulnerability detection.\nHowever, pretraining language models on a large-scale code corpus is\ncomputationally expensive. Fortunately, many off-the-shelf Pre-trained Code\nModels (PCMs), such as CodeBERT, CodeT5, CodeGen, and Code Llama, have been\nreleased publicly. These models acquire general code understanding and\ngeneration capability during pretraining, which enhances their performance on\ndownstream code intelligence tasks. With an increasing number of these public\npre-trained models, selecting the most suitable one to reuse for a specific\ntask is essential. In this paper, we systematically investigate the reusability\nof PCMs. We first explore three intuitive model selection methods that select\nby size, training data, or brute-force fine-tuning. Experimental results show\nthat these straightforward techniques either perform poorly or suffer high\ncosts. Motivated by these findings, we explore learning-based model selection\nstrategies that utilize pre-trained models without altering their parameters.\nSpecifically, we train proxy models to gauge the performance of pre-trained\nmodels, and measure the distribution deviation between a model's latent\nfeatures and the task's labels, using their closeness as an indicator of model\ntransferability. We conduct experiments on 100 widely-used opensource PCMs for\ncode intelligence tasks, with sizes ranging from 42.5 million to 3 billion\nparameters. The results demonstrate that learning-based selection methods\nreduce selection time to 100 seconds, compared to 2,700 hours with brute-force\nfine-tuning, with less than 6% performance degradation across related tasks.", "paper_summary_zh": "<paragraph>預先訓練語言模型，然後微調它，已被證明是一種高效且有效的技術，可應用于各種程式碼智能任務，例如程式碼生成、程式碼摘要和漏洞偵測。\n然而，在大型程式碼語料庫上預訓練語言模型在計算上非常昂貴。幸運的是，許多現成的預訓練程式碼模型 (PCM)，例如 CodeBERT、CodeT5、CodeGen 和 Code Llama，已經公開發布。這些模型在預訓練期間獲得了通用的程式碼理解和生成能力，這增強了它們在下游程式碼智能任務上的效能。隨著這些公開預訓練模型數量的不斷增加，選擇最適合特定任務重複使用的模型至關重要。在本文中，我們系統地研究了 PCM 的可重複使用性。我們首先探討了三種直觀的模型選擇方法，它們通過大小、訓練資料或蠻力微調進行選擇。實驗結果表明，這些直接技術要么執行得很差，要么成本很高。受這些發現的啟發，我們探索了基於學習的模型選擇策略，它們利用預訓練模型而不改變它們的參數。具體來說，我們訓練代理模型來評估預訓練模型的效能，並使用它們的接近程度作為模型可傳輸性的指標，來衡量模型潛在特徵和任務標籤之間的分布偏差。我們對 100 個廣泛使用的開源 PCM 進行了程式碼智能任務的實驗，其規模從 4250 萬到 30 億個參數不等。結果表明，與蠻力微調的 2700 小時相比，基於學習的選擇方法將選擇時間減少到 100 秒，而相關任務的效能下降不到 6%。</paragraph>", "author": "Zhangqian Bi et.al.", "authors": "Zhangqian Bi, Yao Wan, Zhaoyang Chu, Yufei Hu, Junyi Zhang, Hongyu Zhang, Guandong Xu, Hai Jin", "id": "2501.03783v1", "paper_url": "http://arxiv.org/abs/2501.03783v1", "repo": "null"}}