{"2411.12038": {"publish_time": "2024-11-18", "title": "Scaling Deep Learning Research with Kubernetes on the NRP Nautilus HyperCluster", "paper_summary": "Throughout the scientific computing space, deep learning algorithms have\nshown excellent performance in a wide range of applications. As these deep\nneural networks (DNNs) continue to mature, the necessary compute required to\ntrain them has continued to grow. Today, modern DNNs require millions of FLOPs\nand days to weeks of training to generate a well-trained model. The training\ntimes required for DNNs are oftentimes a bottleneck in DNN research for a\nvariety of deep learning applications, and as such, accelerating and scaling\nDNN training enables more robust and accelerated research. To that end, in this\nwork, we explore utilizing the NRP Nautilus HyperCluster to automate and scale\ndeep learning model training for three separate applications of DNNs, including\noverhead object detection, burned area segmentation, and deforestation\ndetection. In total, 234 deep neural models are trained on Nautilus, for a\ntotal time of 4,040 hours", "paper_summary_zh": "在整個科學運算領域中，深度學習演算法已在廣泛的應用中展現出色的效能。隨著這些深度神經網路 (DNN) 持續成熟，訓練它們所需的必要運算也持續增加。如今，現代 DNN 需要數百萬次浮點運算 (FLOP) 和數天到數週的訓練時間，才能產生訓練完善的模型。DNN 所需的訓練時間通常是各種深度學習應用中 DNN 研究的瓶頸，因此，加速和擴充 DNN 訓練可以促進更強健且更快速的研發。為此，我們在這項工作中探索利用 NRP Nautilus HyperCluster 自動化並擴充深度學習模型訓練，以適用於 DNN 的三個獨立應用，包括架空物件偵測、燒毀區域分割和森林砍伐偵測。總計在 Nautilus 上訓練了 234 個深度神經模型，總時數為 4,040 小時", "author": "J. Alex Hurt et.al.", "authors": "J. Alex Hurt, Anes Ouadou, Mariam Alshehri, Grant J. Scott", "id": "2411.12038v1", "paper_url": "http://arxiv.org/abs/2411.12038v1", "repo": "null"}}