{"2412.18082": {"publish_time": "2024-12-24", "title": "Prompt Tuning for Item Cold-start Recommendation", "paper_summary": "The item cold-start problem is crucial for online recommender systems, as the\nsuccess of the cold-start phase determines whether items can transition into\npopular ones. Prompt learning, a powerful technique used in natural language\nprocessing (NLP) to address zero- or few-shot problems, has been adapted for\nrecommender systems to tackle similar challenges. However, existing methods\ntypically rely on content-based properties or text descriptions for prompting,\nwhich we argue may be suboptimal for cold-start recommendations due to 1)\nsemantic gaps with recommender tasks, 2) model bias caused by warm-up items\ncontribute most of the positive feedback to the model, which is the core of the\ncold-start problem that hinders the recommender quality on cold-start items. We\npropose to leverage high-value positive feedback, termed pinnacle feedback as\nprompt information, to simultaneously resolve the above two problems. We\nexperimentally prove that compared to the content description proposed in\nexisting works, the positive feedback is more suitable to serve as prompt\ninformation by bridging the semantic gaps. Besides, we propose item-wise\npersonalized prompt networks to encode pinnaclce feedback to relieve the model\nbias by the positive feedback dominance problem. Extensive experiments on four\nreal-world datasets demonstrate the superiority of our model over\nstate-of-the-art methods. Moreover, PROMO has been successfully deployed on a\npopular short-video sharing platform, a billion-user scale commercial\nshort-video application, achieving remarkable performance gains across various\ncommercial metrics within cold-start scenarios", "paper_summary_zh": "物品冷啟動問題對於線上推薦系統至關重要，因為冷啟動階段的成功與否決定了物品是否能轉變為熱門物品。提示學習是一種用於自然語言處理 (NLP) 的強大技術，用於解決零次或少次嘗試問題，已經改編用於推薦系統來應對類似的挑戰。然而，現有方法通常依賴於基於內容的屬性或文字描述來提示，我們認為這對於冷啟動推薦來說可能不是最佳的，原因有 1) 與推薦任務的語義差距，2) 由於暖身物品造成模型偏差，對模型造成大部分正向回饋，這是冷啟動問題的核心，會阻礙推薦系統對冷啟動物品的推薦品質。我們提議利用高價值正向回饋，稱為頂尖回饋，作為提示資訊，同時解決上述兩個問題。我們透過實驗證明，與現有作品中提出的內容描述相比，正向回饋更適合作為提示資訊，因為它能彌合語義差距。此外，我們提出逐一物品個人化提示網路，對頂尖回饋進行編碼，以透過正向回饋主導問題來緩解模型偏差。在四個真實世界資料集上的大量實驗證明了我們的模型優於最先進的方法。此外，PROMO 已成功部署在一個熱門的短影音分享平台上，一個擁有十億使用者的商業短影音應用程式，在各種冷啟動情境下的商業指標中都獲得了顯著的效能提升", "author": "Yuezihan Jiang et.al.", "authors": "Yuezihan Jiang, Gaode Chen, Wenhan Zhang, Jingchi Wang, Yinjie Jiang, Qi Zhang, Jingjian Lin, Peng Jiang, Kaigui Bian", "id": "2412.18082v1", "paper_url": "http://arxiv.org/abs/2412.18082v1", "repo": "https://github.com/promorec/promo"}}