{"2501.02840": {"publish_time": "2025-01-06", "title": "Enhanced Rooftop Solar Panel Detection by Efficiently Aggregating Local Features", "paper_summary": "In this paper, we present an enhanced Convolutional Neural Network\n(CNN)-based rooftop solar photovoltaic (PV) panel detection approach using\nsatellite images. We propose to use pre-trained CNN-based model to extract the\nlocal convolutional features of rooftops. These local features are then\ncombined using the Vectors of Locally Aggregated Descriptors (VLAD) technique\nto obtain rooftop-level global features, which are then used to train\ntraditional Machine Learning (ML) models to identify rooftop images that do and\ndo not contain PV panels. On the dataset used in this study, the proposed\napproach achieved rooftop-PV classification scores exceeding the predefined\nthreshold of 0.9 across all three cities for each of the feature extractor\nnetworks evaluated. Moreover, we propose a 3-phase approach to enable efficient\nutilization of the previously trained models on a new city or region with\nlimited labelled data. We illustrate the effectiveness of this 3-phase approach\nfor multi-city rooftop-PV detection task.", "paper_summary_zh": "在本文中，我們提出一個增強的基於卷積神經網路 (CNN) 的屋頂太陽能光電 (PV) 面板檢測方法，使用衛星影像。我們建議使用預先訓練的基於 CNN 的模型來提取屋頂的局部卷積特徵。然後使用局部聚合描述符 (VLAD) 技術結合這些局部特徵，以獲得屋頂層級的全局特徵，然後用於訓練傳統機器學習 (ML) 模型，以識別包含或不包含 PV 面板的屋頂影像。在這個研究中使用的資料集上，所提出的方法達到了屋頂 PV 分類分數，超過了所有三個城市中每個特徵提取器網路評估的預定義 0.9 閾值。此外，我們提出了一個 3 階段的方法，以在標記資料有限的新城市或地區上有效利用先前訓練的模型。我們說明了此 3 階段方法對多城市屋頂 PV 檢測任務的有效性。", "author": "Kuldeep Kurte et.al.", "authors": "Kuldeep Kurte, Kedar Kulkarni", "id": "2501.02840v1", "paper_url": "http://arxiv.org/abs/2501.02840v1", "repo": "null"}}