{"2410.22770": {"publish_time": "2024-10-30", "title": "InjecGuard: Benchmarking and Mitigating Over-defense in Prompt Injection Guardrail Models", "paper_summary": "Prompt injection attacks pose a critical threat to large language models\n(LLMs), enabling goal hijacking and data leakage. Prompt guard models, though\neffective in defense, suffer from over-defense -- falsely flagging benign\ninputs as malicious due to trigger word bias. To address this issue, we\nintroduce NotInject, an evaluation dataset that systematically measures\nover-defense across various prompt guard models. NotInject contains 339 benign\nsamples enriched with trigger words common in prompt injection attacks,\nenabling fine-grained evaluation. Our results show that state-of-the-art models\nsuffer from over-defense issues, with accuracy dropping close to random\nguessing levels (60%). To mitigate this, we propose InjecGuard, a novel prompt\nguard model that incorporates a new training strategy, Mitigating Over-defense\nfor Free (MOF), which significantly reduces the bias on trigger words.\nInjecGuard demonstrates state-of-the-art performance on diverse benchmarks\nincluding NotInject, surpassing the existing best model by 30.8%, offering a\nrobust and open-source solution for detecting prompt injection attacks. The\ncode and datasets are released at https://github.com/SaFoLab-WISC/InjecGuard.", "paper_summary_zh": "提示注入攻击对大型语言模型 (LLM) 构成严重威胁，可能导致目标劫持和数据泄露。提示防护模型虽然在防御方面很有效，但会过度防御——由于触发词偏差，错误地将良性输入标记为恶意。为了解决这个问题，我们引入了 NotInject，这是一个评估数据集，可以系统地衡量各种提示防护模型的过度防御。NotInject 包含 339 个良性样本，其中包含提示注入攻击中常见的触发词，从而能够进行细粒度的评估。我们的结果表明，最先进的模型存在过度防御问题，准确率下降到接近随机猜测的水平 (60%)。为了缓解这个问题，我们提出了 InjecGuard，这是一种新的提示防护模型，它包含了一种新的训练策略，即免费缓解过度防御 (MOF)，该策略可以显著减少对触发词的偏差。InjecGuard 在包括 NotInject 在内的各种基准测试中展示了最先进的性能，比现有的最佳模型高出 30.8%，为检测提示注入攻击提供了一个健壮且开源的解决方案。代码和数据集已在 https://github.com/SaFoLab-WISC/InjecGuard 发布。", "author": "Hao Li et.al.", "authors": "Hao Li, Xiaogeng Liu, Chaowei Xiao", "id": "2410.22770v1", "paper_url": "http://arxiv.org/abs/2410.22770v1", "repo": "https://github.com/safolab-wisc/injecguard"}}