{"2406.09175": {"publish_time": "2024-06-13", "title": "ReMI: A Dataset for Reasoning with Multiple Images", "paper_summary": "With the continuous advancement of large language models (LLMs), it is\nessential to create new benchmarks to effectively evaluate their expanding\ncapabilities and identify areas for improvement. This work focuses on\nmulti-image reasoning, an emerging capability in state-of-the-art LLMs. We\nintroduce ReMI, a dataset designed to assess LLMs' ability to Reason with\nMultiple Images. This dataset encompasses a diverse range of tasks, spanning\nvarious reasoning domains such as math, physics, logic, code, table/chart\nunderstanding, and spatial and temporal reasoning. It also covers a broad\nspectrum of characteristics found in multi-image reasoning scenarios. We have\nbenchmarked several cutting-edge LLMs using ReMI and found a substantial gap\nbetween their performance and human-level proficiency. This highlights the\nchallenges in multi-image reasoning and the need for further research. Our\nanalysis also reveals the strengths and weaknesses of different models,\nshedding light on the types of reasoning that are currently attainable and\nareas where future models require improvement. To foster further research in\nthis area, we are releasing ReMI publicly:\nhttps://huggingface.co/datasets/mehrankazemi/ReMI.", "paper_summary_zh": "隨著大型語言模型 (LLM) 的持續進步，建立新的基準以有效評估其擴展能力並找出改進領域至關重要。這項工作重點在於多圖像推理，這是最先進的 LLM 中出現的能力。我們推出 ReMI，一個旨在評估 LLM 使用多個圖像推理能力的資料集。此資料集包含各種任務，涵蓋各種推理領域，例如數學、物理、邏輯、程式碼、表格/圖表理解，以及空間和時間推理。它還涵蓋了多圖像推理場景中發現的廣泛特徵。我們已使用 ReMI 對幾個尖端的 LLM 進行基準測試，發現其性能與人類水準之間存在顯著差距。這凸顯了多圖像推理中的挑戰和進一步研究的必要性。我們的分析也揭示了不同模型的優缺點，闡明了當前可實現的推理類型和未來模型需要改進的領域。為了促進此領域的進一步研究，我們公開發佈 ReMI：\nhttps://huggingface.co/datasets/mehrankazemi/ReMI。", "author": "Mehran Kazemi et.al.", "authors": "Mehran Kazemi, Nishanth Dikkala, Ankit Anand, Petar Devic, Ishita Dasgupta, Fangyu Liu, Bahare Fatemi, Pranjal Awasthi, Dee Guo, Sreenivas Gollapudi, Ahmed Qureshi", "id": "2406.09175v1", "paper_url": "http://arxiv.org/abs/2406.09175v1", "repo": "null"}}