{"2405.08528": {"publish_time": "2024-05-14", "title": "From Internet of Things Data to Business Processes: Challenges and a Framework", "paper_summary": "The IoT and Business Process Management (BPM) communities co-exist in many\nshared application domains, such as manufacturing and healthcare. The IoT\ncommunity has a strong focus on hardware, connectivity and data; the BPM\ncommunity focuses mainly on finding, controlling, and enhancing the structured\ninteractions among the IoT devices in processes. While the field of Process\nMining deals with the extraction of process models and process analytics from\nprocess event logs, the data produced by IoT sensors often is at a lower\ngranularity than these process-level events. The fundamental questions about\nextracting and abstracting process-related data from streams of IoT sensor\nvalues are: (1) Which sensor values can be clustered together as part of\nprocess events?, (2) Which sensor values signify the start and end of such\nevents?, (3) Which sensor values are related but not essential? This work\nproposes a framework to semi-automatically perform a set of structured steps to\nconvert low-level IoT sensor data into higher-level process events that are\nsuitable for process mining. The framework is meant to provide a generic\nsequence of abstract steps to guide the event extraction, abstraction, and\ncorrelation, with variation points for plugging in specific analysis techniques\nand algorithms for each step. To assess the completeness of the framework, we\npresent a set of challenges, how they can be tackled through the framework, and\nan example on how to instantiate the framework in a real-world demonstration\nfrom the field of smart manufacturing. Based on this framework, future research\ncan be conducted in a structured manner through refining and improving\nindividual steps.", "paper_summary_zh": "物聯網和業務流程管理 (BPM) 社群在許多共享應用領域中並存，例如製造和醫療保健。物聯網社群著重於硬體、連線性和資料；BPM 社群主要著重於尋找、控制和提升流程中物聯網裝置之間的結構化互動。雖然流程探勘領域處理從流程事件記錄中擷取流程模型和流程分析，但物聯網感測器產生的資料通常比這些流程層級事件的詳細程度低。從物聯網感測器數值串流中擷取和抽象與流程相關資料的基本問題為：(1) 哪些感測器數值可以群集在一起作為流程事件的一部分？(2) 哪些感測器數值表示此類事件的開始和結束？(3) 哪些感測器數值相關但非必要？這項工作提出一個架構，以半自動化方式執行一組結構化步驟，將低層級物聯網感測器資料轉換為適合流程探勘的高層級流程事件。這個架構旨在提供一組抽象步驟，以指導事件擷取、抽象和關聯，並提供變異點，以便針對每個步驟插入特定的分析技術和演算法。為了評估這個架構的完整性，我們提出了一組挑戰，說明如何透過這個架構來應對這些挑戰，並舉例說明如何從智慧製造領域的實際示範中實例化這個架構。基於這個架構，未來的研究可以透過精進和改善個別步驟，以結構化的方式進行。", "author": "Juergen Mangler et.al.", "authors": "Juergen Mangler, Ronny Seiger, Janik-Vasily Benzin, Joscha Grüger, Yusuf Kirikkayis, Florian Gallik, Lukas Malburg, Matthias Ehrendorfer, Yannis Bertrand, Marco Franceschetti, Barbara Weber, Stefanie Rinderle-Ma, Ralph Bergmann, Estefanía Serral Asensio, Manfred Reichert", "id": "2405.08528v1", "paper_url": "http://arxiv.org/abs/2405.08528v1", "repo": "null"}}