{"2407.17620": {"publish_time": "2024-07-24", "title": "CoMoTo: Unpaired Cross-Modal Lesion Distillation Improves Breast Lesion Detection in Tomosynthesis", "paper_summary": "Digital Breast Tomosynthesis (DBT) is an advanced breast imaging modality\nthat offers superior lesion detection accuracy compared to conventional\nmammography, albeit at the trade-off of longer reading time. Accelerating\nlesion detection from DBT using deep learning is hindered by limited data\navailability and huge annotation costs. A possible solution to this issue could\nbe to leverage the information provided by a more widely available modality,\nsuch as mammography, to enhance DBT lesion detection. In this paper, we present\na novel framework, CoMoTo, for improving lesion detection in DBT. Our framework\nleverages unpaired mammography data to enhance the training of a DBT model,\nimproving practicality by eliminating the need for mammography during\ninference. Specifically, we propose two novel components, Lesion-specific\nKnowledge Distillation (LsKD) and Intra-modal Point Alignment (ImPA). LsKD\nselectively distills lesion features from a mammography teacher model to a DBT\nstudent model, disregarding background features. ImPA further enriches LsKD by\nensuring the alignment of lesion features within the teacher before distilling\nknowledge to the student. Our comprehensive evaluation shows that CoMoTo is\nsuperior to traditional pretraining and image-level KD, improving performance\nby 7% Mean Sensitivity under low-data setting. Our code is available at\nhttps://github.com/Muhammad-Al-Barbary/CoMoTo .", "paper_summary_zh": "數位乳房斷層合成 (DBT) 是一種進階乳房影像模式，\n與傳統乳房攝影相比，它提供了優越的病灶偵測準確度，\n儘管需要較長的判讀時間。加速\n使用深度學習從 DBT 中偵測病灶受到資料\n可用性有限和龐大標註成本的阻礙。解決此問題的一種可能方法是\n利用更廣泛可用的模式（例如乳房攝影）所提供的資訊，\n來增強 DBT 病灶偵測。在本文中，我們提出\n一個新穎的架構 CoMoTo，用於改善 DBT 中的病灶偵測。我們的架構\n利用未配對的乳房攝影資料來增強 DBT 模型的訓練，\n透過消除推論期間對乳房攝影的需求來改善實用性。具體來說，我們提出兩個新穎的組成部分，病灶特定知識萃取 (LsKD) 和模內點對齊 (ImPA)。LsKD\n有選擇性地從乳房攝影教師模型萃取出病灶特徵到 DBT\n學生模型，忽略背景特徵。ImPA 進一步透過\n確保教師內的病灶特徵在萃取出\n知識到學生之前對齊，來豐富 LsKD。我們的全面評估顯示，CoMoTo 優於傳統的預訓練和影像層級 KD，在低資料設定下將效能提升 7% 的平均靈敏度。我們的程式碼可在 https://github.com/Muhammad-Al-Barbary/CoMoTo 取得。", "author": "Muhammad Alberb et.al.", "authors": "Muhammad Alberb, Marawan Elbatel, Aya Elgebaly, Ricardo Montoya-del-Angel, Xiaomeng Li, Robert Martí", "id": "2407.17620v1", "paper_url": "http://arxiv.org/abs/2407.17620v1", "repo": "https://github.com/muhammad-al-barbary/comoto"}}