{"2412.08392": {"publish_time": "2024-12-11", "title": "The Roles of English in Evaluating Multilingual Language Models", "paper_summary": "Multilingual natural language processing is getting increased attention, with\nnumerous models, benchmarks, and methods being released for many languages.\nEnglish is often used in multilingual evaluation to prompt language models\n(LMs), mainly to overcome the lack of instruction tuning data in other\nlanguages. In this position paper, we lay out two roles of English in\nmultilingual LM evaluations: as an interface and as a natural language. We\nargue that these roles have different goals: task performance versus language\nunderstanding. This discrepancy is highlighted with examples from datasets and\nevaluation setups. Numerous works explicitly use English as an interface to\nboost task performance. We recommend to move away from this imprecise method\nand instead focus on furthering language understanding.", "paper_summary_zh": "多語言自然語言處理正受到越來越多的關注，許多語言都發布了大量的模型、基準和方法。英語通常用於多語言評估，以提示語言模型 (LM)，主要是為了克服其他語言中缺乏指令調整數據的問題。在本文中，我們闡述了英語在多語言 LM 評估中的兩個角色：作為介面和作為自然語言。我們認為這些角色有不同的目標：任務執行與語言理解。這種差異通過數據集和評估設置的範例得到強調。許多作品明確使用英語作為介面來提升任務執行。我們建議遠離這種不精確的方法，而應專注於進一步提升語言理解。", "author": "Wessel Poelman et.al.", "authors": "Wessel Poelman, Miryam de Lhoneux", "id": "2412.08392v1", "paper_url": "http://arxiv.org/abs/2412.08392v1", "repo": "null"}}