{"2405.16860": {"publish_time": "2024-05-27", "title": "Think Before You Act: A Two-Stage Framework for Mitigating Gender Bias Towards Vision-Language Tasks", "paper_summary": "Gender bias in vision-language models (VLMs) can reinforce harmful\nstereotypes and discrimination. In this paper, we focus on mitigating gender\nbias towards vision-language tasks. We identify object hallucination as the\nessence of gender bias in VLMs. Existing VLMs tend to focus on salient or\nfamiliar attributes in images but ignore contextualized nuances. Moreover, most\nVLMs rely on the co-occurrence between specific objects and gender attributes\nto infer the ignored features, ultimately resulting in gender bias. We propose\nGAMA, a task-agnostic generation framework to mitigate gender bias. GAMA\nconsists of two stages: narrative generation and answer inference. During\nnarrative generation, GAMA yields all-sided but gender-obfuscated narratives,\nwhich prevents premature concentration on localized image features, especially\ngender attributes. During answer inference, GAMA integrates the image,\ngenerated narrative, and a task-specific question prompt to infer answers for\ndifferent vision-language tasks. This approach allows the model to rethink\ngender attributes and answers. We conduct extensive experiments on GAMA,\ndemonstrating its debiasing and generalization ability.", "paper_summary_zh": "視覺語言模型 (VLM) 中的性別偏見會強化有害的刻板印象和歧視。在本文中，我們專注於減輕視覺語言任務中的性別偏見。我們將物件幻覺視為 VLM 中性別偏見的本質。現有的 VLM 傾向於關注圖像中的顯著或熟悉的屬性，但忽略了上下文化的細微差別。此外，大多數 VLM 依賴特定物件與性別屬性之間的共現來推斷被忽略的特徵，最終導致性別偏見。我們提出 GAMA，一個與任務無關的生成架構，以減輕性別偏見。GAMA 包含兩個階段：敘事生成和答案推論。在敘事生成期間，GAMA 產生全面但性別模糊的敘事，這可以防止過早集中於局部影像特徵，特別是性別屬性。在答案推論期間，GAMA 整合影像、生成的敘事和特定於任務的問題提示，以推論不同視覺語言任務的答案。這種方法允許模型重新思考性別屬性和答案。我們對 GAMA 進行了廣泛的實驗，證明了它的去偏見和泛化能力。", "author": "Yunqi Zhang et.al.", "authors": "Yunqi Zhang, Songda Li, Chunyuan Deng, Luyi Wang, Hui Zhao", "id": "2405.16860v1", "paper_url": "http://arxiv.org/abs/2405.16860v1", "repo": "https://github.com/zyq0000/gama"}}