{"2503.02881": {"publish_time": "2025-03-04", "title": "Reactive Diffusion Policy: Slow-Fast Visual-Tactile Policy Learning for Contact-Rich Manipulation", "paper_summary": "Humans can accomplish complex contact-rich tasks using vision and touch, with\nhighly reactive capabilities such as quick adjustments to environmental changes\nand adaptive control of contact forces; however, this remains challenging for\nrobots. Existing visual imitation learning (IL) approaches rely on action\nchunking to model complex behaviors, which lacks the ability to respond\ninstantly to real-time tactile feedback during the chunk execution.\nFurthermore, most teleoperation systems struggle to provide fine-grained\ntactile / force feedback, which limits the range of tasks that can be\nperformed. To address these challenges, we introduce TactAR, a low-cost\nteleoperation system that provides real-time tactile feedback through Augmented\nReality (AR), along with Reactive Diffusion Policy (RDP), a novel slow-fast\nvisual-tactile imitation learning algorithm for learning contact-rich\nmanipulation skills. RDP employs a two-level hierarchy: (1) a slow latent\ndiffusion policy for predicting high-level action chunks in latent space at low\nfrequency, (2) a fast asymmetric tokenizer for closed-loop tactile feedback\ncontrol at high frequency. This design enables both complex trajectory modeling\nand quick reactive behavior within a unified framework. Through extensive\nevaluation across three challenging contact-rich tasks, RDP significantly\nimproves performance compared to state-of-the-art visual IL baselines through\nrapid response to tactile / force feedback. Furthermore, experiments show that\nRDP is applicable across different tactile / force sensors. Code and videos are\navailable on https://reactive-diffusion-policy.github.io/.", "paper_summary_zh": "<paragraph>人類可以利用視覺和觸覺來完成複雜的、需要大量接觸的任務，並具備高度反應能力，例如快速適應環境變化和自適應地控制接觸力；然而，這對機器人來說仍然是一項挑戰。現有的視覺模仿學習 (IL) 方法依賴於動作分塊來模擬複雜行為，但缺乏在分塊執行期間即時響應實時觸覺反饋的能力。此外，大多數遠程操作系統難以提供細膩的觸覺/力反饋，這限制了可執行任務的範圍。為了應對這些挑戰，我們推出了 TactAR，這是一個低成本的遠程操作系統，它通過擴增實境 (AR) 提供實時觸覺反饋，以及反應式擴散策略 (RDP)，這是一種新穎的慢-快視覺-觸覺模仿學習算法，用於學習需要大量接觸的操作技能。RDP 採用兩級層次結構：(1) 一種慢速潛在擴散策略，用於以低頻率預測潛在空間中的高階動作分塊，(2) 一種快速不對稱分詞器，用於高頻率的閉環觸覺反饋控制。這種設計能夠在一個統一的框架內實現複雜的軌跡建模和快速的反應行為。通過對三個具有挑戰性的、需要大量接觸的任務進行廣泛評估，RDP 通過對觸覺/力反饋的快速響應，顯著提高了性能，超越了最先進的視覺 IL 基線。此外，實驗表明，RDP 適用於不同的觸覺/力傳感器。程式碼和影片可在 https://reactive-diffusion-policy.github.io/ 上找到。</paragraph>\n", "author": "Han Xue et.al.", "authors": "Han Xue, Jieji Ren, Wendi Chen, Gu Zhang, Yuan Fang, Guoying Gu, Huazhe Xu, Cewu Lu", "id": "2503.02881v1", "paper_url": "http://arxiv.org/abs/2503.02881v1", "repo": "null"}}