{"2405.07474": {"publish_time": "2024-05-13", "title": "Integrating Intent Understanding and Optimal Behavior Planning for Behavior Tree Generation from Human Instructions", "paper_summary": "Robots executing tasks following human instructions in domestic or industrial\nenvironments essentially require both adaptability and reliability. Behavior\nTree (BT) emerges as an appropriate control architecture for these scenarios\ndue to its modularity and reactivity. Existing BT generation methods, however,\neither do not involve interpreting natural language or cannot theoretically\nguarantee the BTs' success. This paper proposes a two-stage framework for BT\ngeneration, which first employs large language models (LLMs) to interpret goals\nfrom high-level instructions, then constructs an efficient goal-specific BT\nthrough the Optimal Behavior Tree Expansion Algorithm (OBTEA). We represent\ngoals as well-formed formulas in first-order logic, effectively bridging intent\nunderstanding and optimal behavior planning. Experiments in the service robot\nvalidate the proficiency of LLMs in producing grammatically correct and\naccurately interpreted goals, demonstrate OBTEA's superiority over the baseline\nBT Expansion algorithm in various metrics, and finally confirm the practical\ndeployability of our framework. The project website is\nhttps://dids-ei.github.io/Project/LLM-OBTEA/.", "paper_summary_zh": "機器人在家庭或工業環境中執行任務並遵循人類指示，基本上需要適應性和可靠性。行為樹 (BT) 由於其模組化和反應性，成為這些情境的適當控制架構。然而，現有的 BT 生成方法，要不不涉及自然語言的詮釋，要不無法在理論上保證 BT 的成功。本文提出一個 BT 生成的兩階段架構，首先使用大型語言模型 (LLM) 從高級指令中詮釋目標，然後透過最佳行為樹擴展演算法 (OBTEA) 建構一個目標特定的有效 BT。我們將目標表示為一階邏輯中的良構公式，有效地連結意圖理解和最佳行為規劃。服務機器人的實驗驗證了 LLM 在產生語法正確且詮釋精準的目標方面的熟練度，展示了 OBTEA 在各種指標上優於基線 BT 擴展演算法，最後確認了我們架構的實際可部署性。專案網站為 https://dids-ei.github.io/Project/LLM-OBTEA/。", "author": "Xinglin Chen et.al.", "authors": "Xinglin Chen, Yishuai Cai, Yunxin Mao, Minglong Li, Wenjing Yang, Weixia Xu, Ji Wang", "id": "2405.07474v1", "paper_url": "http://arxiv.org/abs/2405.07474v1", "repo": "null"}}