{"2409.15907": {"publish_time": "2024-09-24", "title": "Enhancing Text-to-SQL Capabilities of Large Language Models via Domain Database Knowledge Injection", "paper_summary": "Text-to-SQL is a subtask in semantic parsing that has seen rapid progress\nwith the evolution of Large Language Models (LLMs). However, LLMs face\nchallenges due to hallucination issues and a lack of domain-specific database\nknowledge(such as table schema and cell values). As a result, they can make\nerrors in generating table names, columns, and matching values to the correct\ncolumns in SQL statements. This paper introduces a method of knowledge\ninjection to enhance LLMs' ability to understand schema contents by\nincorporating prior knowledge. This approach improves their performance in\nText-to-SQL tasks. Experimental results show that pre-training LLMs on\ndomain-specific database knowledge and fine-tuning them on downstream\nText-to-SQL tasks significantly improves the Execution Match (EX) and Exact\nMatch (EM) metrics across various models. This effectively reduces errors in\ngenerating column names and matching values to the columns. Furthermore, the\nknowledge-injected models can be applied to many downstream Text-to-SQL tasks,\ndemonstrating the generalizability of the approach presented in this paper.", "paper_summary_zh": "文本到 SQL 是语义解析中的一个子任务，随着大型语言模型 (LLM) 的发展，它取得了快速进展。然而，LLM 面临着幻觉问题和缺乏特定于领域的数据库知识（例如表模式和单元格值）的挑战。因此，它们在生成表名称、列和将值匹配到 SQL 语句中的正确列时可能会出错。本文介绍了一种知识注入方法，通过纳入先验知识来增强 LLM 理解模式内容的能力。这种方法提高了它们在文本到 SQL 任务中的性能。实验结果表明，针对特定于领域的数据库知识对 LLM 进行预训练，并在下游文本到 SQL 任务中对它们进行微调，显著提高了各种模型的执行匹配 (EX) 和精确匹配 (EM) 指标。这有效地减少了在生成列名称和将值匹配到列时出现的错误。此外，注入知识的模型可以应用于许多下游文本到 SQL 任务，展示了本文提出的方法的泛化性。", "author": "Xingyu Ma et.al.", "authors": "Xingyu Ma, Xin Tian, Lingxiang Wu, Xuepeng Wang, Xueming Tang, Jinqiao Wang", "id": "2409.15907v1", "paper_url": "http://arxiv.org/abs/2409.15907v1", "repo": "null"}}