{"2412.03624": {"publish_time": "2024-12-04", "title": "How to Correctly do Semantic Backpropagation on Language-based Agentic Systems", "paper_summary": "Language-based agentic systems have shown great promise in recent years,\ntransitioning from solving small-scale research problems to being deployed in\nchallenging real-world tasks. However, optimizing these systems often requires\nsubstantial manual labor. Recent studies have demonstrated that these systems\ncan be represented as computational graphs, enabling automatic optimization.\nDespite these advancements, most current efforts in Graph-based Agentic System\nOptimization (GASO) fail to properly assign feedback to the system's components\ngiven feedback on the system's output. To address this challenge, we formalize\nthe concept of semantic backpropagation with semantic gradients -- a\ngeneralization that aligns several key optimization techniques, including\nreverse-mode automatic differentiation and the more recent TextGrad by\nexploiting the relationship among nodes with a common successor. This serves as\na method for computing directional information about how changes to each\ncomponent of an agentic system might improve the system's output. To use these\ngradients, we propose a method called semantic gradient descent which enables\nus to solve GASO effectively. Our results on both BIG-Bench Hard and GSM8K show\nthat our approach outperforms existing state-of-the-art methods for solving\nGASO problems. A detailed ablation study on the LIAR dataset demonstrates the\nparsimonious nature of our method. A full copy of our implementation is\npublicly available at https://github.com/HishamAlyahya/semantic_backprop", "paper_summary_zh": "<paragraph>近年來，基於語言的代理系統展現了極大的前景，\n從解決小規模的研究問題，轉變為部署在\n具有挑戰性的真實世界任務中。然而，最佳化這些系統通常需要\n大量的人工勞力。最近的研究表明，這些系統\n可以表示為計算圖，實現自動最佳化。\n儘管有這些進展，但目前大多數基於圖形的代理系統\n最佳化 (GASO) 的努力，都無法適當地將回饋分配給系統的組成部分\n給予系統輸出的回饋。為了應對這一挑戰，我們正式化了\n語義反向傳播的概念，並帶有語義梯度——一種\n概括，它結合了幾種關鍵的最佳化技術，包括\n反向模式自動微分和最近的 TextGrad，利用具有共同後繼者的節點之間的關係。這可以用作\n一種計算方向資訊的方法，說明如何改變代理系統的每個\n組成部分可能會改善系統的輸出。為了使用這些\n梯度，我們提出了一種稱為語義梯度下降的方法，使我們能夠\n有效地解決 GASO。我們在 BIG-Bench Hard 和 GSM8K 上的結果表明\n我們的做法優於解決\nGASO 問題的現有最先進方法。在 LIAR 資料集上進行的詳細消融研究證明了\n我們方法的簡約性。我們的實作的完整副本公開於 https://github.com/HishamAlyahya/semantic_backprop</paragraph>", "author": "Wenyi Wang et.al.", "authors": "Wenyi Wang, Hisham A. Alyahya, Dylan R. Ashley, Oleg Serikov, Dmitrii Khizbullin, Francesco Faccio, Jürgen Schmidhuber", "id": "2412.03624v1", "paper_url": "http://arxiv.org/abs/2412.03624v1", "repo": "null"}}