{"2409.03944": {"publish_time": "2024-09-05", "title": "HUMOS: Human Motion Model Conditioned on Body Shape", "paper_summary": "Generating realistic human motion is essential for many computer vision and\ngraphics applications. The wide variety of human body shapes and sizes greatly\nimpacts how people move. However, most existing motion models ignore these\ndifferences, relying on a standardized, average body. This leads to uniform\nmotion across different body types, where movements don't match their physical\ncharacteristics, limiting diversity. To solve this, we introduce a new approach\nto develop a generative motion model based on body shape. We show that it's\npossible to train this model using unpaired data by applying cycle consistency,\nintuitive physics, and stability constraints, which capture the relationship\nbetween identity and movement. The resulting model generates diverse,\nphysically plausible, and dynamically stable human motions that are both\nquantitatively and qualitatively more realistic than current state-of-the-art\nmethods. More details are available on our project page\nhttps://CarstenEpic.github.io/humos/.", "paper_summary_zh": "生成逼真的擬真動作對於許多電腦視覺和圖形應用程式而言至關重要。人體形狀和尺寸的多樣性極大地影響了人們的移動方式。然而，大多數現有的動作模型忽略了這些差異，依賴於標準化的平均身體。這導致了不同體型之間的動作統一，其中動作與其物理特徵不符，限制了多樣性。為了解決這個問題，我們引入了一種基於身體形狀開發生成式動作模型的新方法。我們表明，通過應用循環一致性、直觀物理和穩定性約束，可以訓練這個模型使用未配對的資料，這些約束捕捉了身份和動作之間的關係。生成的模型產生了多樣化、物理上合理的、動態穩定的擬真動作，在質量和數量上都比當前最先進的方法更逼真。更多詳細資訊可在我們的專案頁面 https://CarstenEpic.github.io/humos/ 中找到。", "author": "Shashank Tripathi et.al.", "authors": "Shashank Tripathi, Omid Taheri, Christoph Lassner, Michael J. Black, Daniel Holden, Carsten Stoll", "id": "2409.03944v1", "paper_url": "http://arxiv.org/abs/2409.03944v1", "repo": "null"}}