{"2410.12842": {"publish_time": "2024-10-09", "title": "A Two-Model Approach for Humour Style Recognition", "paper_summary": "Humour, a fundamental aspect of human communication, manifests itself in\nvarious styles that significantly impact social interactions and mental health.\nRecognising different humour styles poses challenges due to the lack of\nestablished datasets and machine learning (ML) models. To address this gap, we\npresent a new text dataset for humour style recognition, comprising 1463\ninstances across four styles (self-enhancing, self-deprecating, affiliative,\nand aggressive) and non-humorous text, with lengths ranging from 4 to 229\nwords. Our research employs various computational methods, including classic\nmachine learning classifiers, text embedding models, and DistilBERT, to\nestablish baseline performance. Additionally, we propose a two-model approach\nto enhance humour style recognition, particularly in distinguishing between\naffiliative and aggressive styles. Our method demonstrates an 11.61%\nimprovement in f1-score for affiliative humour classification, with consistent\nimprovements in the 14 models tested. Our findings contribute to the\ncomputational analysis of humour in text, offering new tools for studying\nhumour in literature, social media, and other textual sources.", "paper_summary_zh": "幽默，是人類溝通中一個基本的面向，它以各種不同的風格展現，對社會互動和心理健康有顯著的影響。由於缺乏既定的資料集和機器學習 (ML) 模型，辨識不同的幽默風格會帶來挑戰。為了解決這個問題，我們提出了新的文本資料集，用於幽默風格辨識，包含 1463 個實例，橫跨四種風格（自我增強、自我貶抑、親和和攻擊），以及非幽默文本，長度從 4 到 229 個字不等。我們的研究採用了各種計算方法，包括經典機器學習分類器、文本嵌入模型和 DistilBERT，以建立基準效能。此外，我們提出了一個雙模型方法，以增強幽默風格辨識，特別是在區分親和和攻擊風格方面。我們的這個方法在親和幽默分類的 f1 分數上展現了 11.61% 的進步，在測試的 14 個模型中都有穩定的進步。我們的研究結果有助於對文本中的幽默進行計算分析，為研究文學、社群媒體和其他文本來源中的幽默提供了新的工具。", "author": "Mary Ogbuka Kenneth et.al.", "authors": "Mary Ogbuka Kenneth, Foaad Khosmood, Abbas Edalat", "id": "2410.12842v1", "paper_url": "http://arxiv.org/abs/2410.12842v1", "repo": "null"}}