{"2407.11962": {"publish_time": "2024-07-16", "title": "Motion-Oriented Compositional Neural Radiance Fields for Monocular Dynamic Human Modeling", "paper_summary": "This paper introduces Motion-oriented Compositional Neural Radiance Fields\n(MoCo-NeRF), a framework designed to perform free-viewpoint rendering of\nmonocular human videos via novel non-rigid motion modeling approach. In the\ncontext of dynamic clothed humans, complex cloth dynamics generate non-rigid\nmotions that are intrinsically distinct from skeletal articulations and\ncritically important for the rendering quality. The conventional approach\nmodels non-rigid motions as spatial (3D) deviations in addition to skeletal\ntransformations. However, it is either time-consuming or challenging to achieve\noptimal quality due to its high learning complexity without a direct\nsupervision. To target this problem, we propose a novel approach of modeling\nnon-rigid motions as radiance residual fields to benefit from more direct color\nsupervision in the rendering and utilize the rigid radiance fields as a prior\nto reduce the complexity of the learning process. Our approach utilizes a\nsingle multiresolution hash encoding (MHE) to concurrently learn the canonical\nT-pose representation from rigid skeletal motions and the radiance residual\nfield for non-rigid motions. Additionally, to further improve both training\nefficiency and usability, we extend MoCo-NeRF to support simultaneous training\nof multiple subjects within a single framework, thanks to our effective design\nfor modeling non-rigid motions. This scalability is achieved through the\nintegration of a global MHE and learnable identity codes in addition to\nmultiple local MHEs. We present extensive results on ZJU-MoCap and MonoCap,\nclearly demonstrating state-of-the-art performance in both single- and\nmulti-subject settings. The code and model will be made publicly available at\nthe project page: https://stevejaehyeok.github.io/publications/moco-nerf.", "paper_summary_zh": "<paragraph>本文介紹了運動導向組合神經輻照場 (MoCo-NeRF)，一個旨在透過新穎的非剛性運動建模方法，執行單眼人類影片的自由視點渲染的框架。在動態穿著人類的背景下，複雜的布料動力會產生非剛性運動，與骨架關節本質上不同，對渲染品質至關重要。傳統方法將非剛性運動建模為空間 (3D) 偏差，以及骨架轉換。然而，由於其學習複雜度高，且沒有直接監督，因此要達到最佳品質既耗時又具挑戰性。為了解決這個問題，我們提出了一種創新的方法，將非剛性運動建模為輻照殘差場，以受益於渲染中更直接的色彩監督，並利用剛性輻照場作為先驗，以降低學習過程的複雜性。我們的做法利用單一的多解析度雜湊編碼 (MHE)，以同時從剛性骨架運動中學習標準的 T 姿勢表示，以及非剛性運動的輻照殘差場。此外，為了進一步提高訓練效率和可用性，我們將 MoCo-NeRF 擴展為支援在單一框架內同時訓練多個主體，這要歸功於我們用於建模非剛性運動的有效設計。這種可擴充性是透過整合一個整體 MHE 和可學習的身分碼，以及多個局部 MHE 來實現的。我們在 ZJU-MoCap 和 MonoCap 上展示了廣泛的結果，清楚地證明了在單主體和多主體設定中，我們都達到了最先進的效能。程式碼和模型將在專案頁面公開：https://stevejaehyeok.github.io/publications/moco-nerf。</paragraph>", "author": "Jaehyeok Kim et.al.", "authors": "Jaehyeok Kim, Dongyoon Wee, Dan Xu", "id": "2407.11962v2", "paper_url": "http://arxiv.org/abs/2407.11962v2", "repo": "null"}}