{"2405.15590": {"publish_time": "2024-05-24", "title": "Profiling checkpointing schedules in adjoint ST-AD", "paper_summary": "Checkpointing is a cornerstone of data-flow reversal in adjoint algorithmic\ndifferentiation. Checkpointing is a storage/recomputation trade-off that can be\napplied at different levels, one of which being the call tree. We are looking\nfor good placements of checkpoints onto the call tree of a given application,\nto reduce run time and memory footprint of its adjoint. There is no known\noptimal solution to this problem other than a combinatorial search on all\nplacements. We propose a heuristics based on run-time profiling of the adjoint\ncode. We describe implementation of this profiling tool in an existing\nsource-transformation AD tool. We demonstrate the interest of this approach on\ntest cases taken from the MITgcm ocean and atmospheric global circulation\nmodel. We discuss the limitations of our approach and propose directions to\nlift them.", "paper_summary_zh": "檢查點是伴隨演算法微分中資料流反轉的基石。檢查點是一種儲存/重新計算的折衷方案，可以在不同層級套用，其中一項是呼叫樹。我們正在尋找將檢查點放置在給定應用程式的呼叫樹上的良好位置，以減少其伴隨的執行時間和記憶體使用量。除了對所有配置進行組合搜尋之外，沒有已知最佳解決方案可以解決此問題。我們提出一個基於伴隨程式碼執行時間設定檔的啟發法。我們在現有的原始碼轉換 AD 工具中描述這個設定檔工具的實作。我們在從 MITgcm 海洋和全球大氣環流模型取得的測試案例中展示此方法的興趣。我們討論此方法的限制，並提出解除限制的方向。", "author": "Laurent Hascoët et.al.", "authors": "Laurent Hascoët, Jean-Luc Bouchot, Shreyas Sunil Gaikwad, Sri Hari Krishna Narayanan, Jan Hückelheim", "id": "2405.15590v1", "paper_url": "http://arxiv.org/abs/2405.15590v1", "repo": "null"}}