{"2411.16657": {"publish_time": "2024-11-25", "title": "DreamRunner: Fine-Grained Storytelling Video Generation with Retrieval-Augmented Motion Adaptation", "paper_summary": "Storytelling video generation (SVG) has recently emerged as a task to create\nlong, multi-motion, multi-scene videos that consistently represent the story\ndescribed in the input text script. SVG holds great potential for diverse\ncontent creation in media and entertainment; however, it also presents\nsignificant challenges: (1) objects must exhibit a range of fine-grained,\ncomplex motions, (2) multiple objects need to appear consistently across\nscenes, and (3) subjects may require multiple motions with seamless transitions\nwithin a single scene. To address these challenges, we propose DreamRunner, a\nnovel story-to-video generation method: First, we structure the input script\nusing a large language model (LLM) to facilitate both coarse-grained scene\nplanning as well as fine-grained object-level layout and motion planning. Next,\nDreamRunner presents retrieval-augmented test-time adaptation to capture target\nmotion priors for objects in each scene, supporting diverse motion\ncustomization based on retrieved videos, thus facilitating the generation of\nnew videos with complex, scripted motions. Lastly, we propose a novel\nspatial-temporal region-based 3D attention and prior injection module SR3AI for\nfine-grained object-motion binding and frame-by-frame semantic control. We\ncompare DreamRunner with various SVG baselines, demonstrating state-of-the-art\nperformance in character consistency, text alignment, and smooth transitions.\nAdditionally, DreamRunner exhibits strong fine-grained condition-following\nability in compositional text-to-video generation, significantly outperforming\nbaselines on T2V-ComBench. Finally, we validate DreamRunner's robust ability to\ngenerate multi-object interactions with qualitative examples.", "paper_summary_zh": "故事敘述影片生成 (SVG) 最近成為了產生長篇、多動作、多場景影片的任務，這些影片能持續呈現輸入文字腳本中所描述的故事。SVG 在媒體和娛樂中擁有廣泛的內容創造潛力；然而，它也帶來了重大的挑戰：(1) 物件必須展現一系列細緻、複雜的動作，(2) 多個物件需要在場景中持續出現，(3) 主題可能需要在單一場景中進行多個動作，並進行無縫轉換。為了應對這些挑戰，我們提出了 DreamRunner，一種新穎的故事到影片生成方法：首先，我們使用大型語言模型 (LLM) 來建構輸入腳本，以促進粗略的場景規劃以及細緻的物件級別佈局和動作規劃。接下來，DreamRunner 提出檢索增強的測試時間適應，以擷取每個場景中物件的目標動作先驗，支援基於檢索影片的多樣化動作自訂，從而促進產生具有複雜、腳本動作的新影片。最後，我們提出了一個新穎的基於時空區域的 3D 注意力和先驗注入模組 SR3AI，用於細緻的物件動作繫結和逐幀語義控制。我們將 DreamRunner 與各種 SVG 基準進行比較，證明了其在角色一致性、文字對齊和流暢過渡方面的最先進效能。此外，DreamRunner 在組合式文字到影片生成中展現出強大的細緻條件遵循能力，在 T2V-ComBench 上明顯優於基準。最後，我們驗證了 DreamRunner 產生多物件互動的強大能力，並提供了定性範例。", "author": "Zun Wang et.al.", "authors": "Zun Wang, Jialu Li, Han Lin, Jaehong Yoon, Mohit Bansal", "id": "2411.16657v1", "paper_url": "http://arxiv.org/abs/2411.16657v1", "repo": "null"}}