{"2407.20557": {"publish_time": "2024-07-30", "title": "CELLM: An Efficient Communication in Large Language Models Training for Federated Learning", "paper_summary": "Federated Learning (FL) is a recent model training paradigm in which client\ndevices collaboratively train a model without ever aggregating their data.\nCrucially, this scheme offers users potential privacy and security benefits by\nonly ever communicating updates to the model weights to a central server as\nopposed to traditional machine learning (ML) training which directly\ncommunicates and aggregates data. However, FL training suffers from statistical\nheterogeneity as clients may have differing local data distributions. Large\nlanguage models (LLMs) offer a potential solution to this issue of\nheterogeneity given that they have consistently been shown to be able to learn\non vast amounts of noisy data. While LLMs are a promising development for\nresolving the consistent issue of non-I.I.D. Clients in federated settings\nexacerbate two other bottlenecks in FL: limited local computing and expensive\ncommunication. This thesis aims to develop efficient training methods for LLMs\nin FL. To this end, we employ two critical techniques in enabling efficient\ntraining. First, we use low-rank adaptation (LoRA) to reduce the computational\nload of local model training. Second, we communicate sparse updates throughout\ntraining to significantly cut down on communication costs. Taken together, our\nmethod reduces communication costs by up to 10x over vanilla LoRA and up to 5x\nover more complex sparse LoRA baselines while achieving greater utility. We\nemphasize the importance of carefully applying sparsity and picking effective\nrank and sparsity configurations for federated LLM training.", "paper_summary_zh": "聯邦學習 (FL) 是一種新興的模型訓練範例，其中用戶端裝置協作訓練模型，卻從不彙總其資料。至關重要的是，此方案僅透過將模型權重更新傳送至中央伺服器的方式，提供使用者潛在的隱私和安全性優勢，這與直接傳送和彙總資料的傳統機器學習 (ML) 訓練相反。然而，FL 訓練會受到統計異質性的影響，因為用戶端可能擁有不同的本地資料分佈。大型語言模型 (LLM) 為此異質性問題提供了潛在的解決方案，因為它們始終被證明能夠在大量的雜訊資料中學習。儘管 LLM 是解決非 I.I.D. 用戶端一致性問題的有望發展，但聯邦設定中會加劇 FL 的另外兩個瓶頸：有限的本地運算和昂貴的通訊。本論文旨在為 FL 中的 LLM 開發高效的訓練方法。為此，我們採用兩種關鍵技術來實現高效訓練。首先，我們使用低秩適應 (LoRA) 來降低本地模型訓練的運算負載。其次，我們在整個訓練過程中傳送稀疏更新，以大幅降低通訊成本。綜合來說，我們的方法將通訊成本降低了最多 10 倍（相較於原生的 LoRA），並比更複雜的稀疏 LoRA 基準降低了最多 5 倍，同時獲得更高的效用。我們強調仔細應用稀疏性以及挑選有效的秩和稀疏性配置對於聯邦 LLM 訓練的重要性。", "author": "Raja Vavekanand et.al.", "authors": "Raja Vavekanand, Kira Sam", "id": "2407.20557v1", "paper_url": "http://arxiv.org/abs/2407.20557v1", "repo": "null"}}