{"2406.15474": {"publish_time": "2024-06-16", "title": "WundtGPT: Shaping Large Language Models To Be An Empathetic, Proactive Psychologist", "paper_summary": "Large language models (LLMs) are raging over the medical domain, and their\nmomentum has carried over into the mental health domain, leading to the\nemergence of few mental health LLMs. Although such mental health LLMs could\nprovide reasonable suggestions for psychological counseling, how to develop an\nauthentic and effective doctor-patient relationship (DPR) through LLMs is still\nan important problem. To fill this gap, we dissect DPR into two key attributes,\ni.e., the psychologist's empathy and proactive guidance. We thus present\nWundtGPT, an empathetic and proactive mental health large language model that\nis acquired by fine-tuning it with instruction and real conversation between\npsychologists and patients. It is designed to assist psychologists in diagnosis\nand help patients who are reluctant to communicate face-to-face understand\ntheir psychological conditions. Its uniqueness lies in that it could not only\npose purposeful questions to guide patients in detailing their symptoms but\nalso offer warm emotional reassurance. In particular, WundtGPT incorporates\nCollection of Questions, Chain of Psychodiagnosis, and Empathy Constraints into\na comprehensive prompt for eliciting LLMs' questions and diagnoses.\nAdditionally, WundtGPT proposes a reward model to promote alignment with\nempathetic mental health professionals, which encompasses two key factors:\ncognitive empathy and emotional empathy. We offer a comprehensive evaluation of\nour proposed model. Based on these outcomes, we further conduct the manual\nevaluation based on proactivity, effectiveness, professionalism and coherence.\nWe notice that WundtGPT can offer professional and effective consultation. The\nmodel is available at huggingface.", "paper_summary_zh": "大型語言模型 (LLM) 在醫療領域掀起熱潮，其發展動能也延燒到心理健康領域，催生出少數的心理健康 LLM。儘管此類心理健康 LLM 能為心理諮商提供合理的建議，但如何透過 LLM 建立真實且有效的醫病關係 (DPR) 仍是一項重要課題。為了解決此問題，我們將 DPR 分解成兩個關鍵屬性，即心理師的同理心和主動引導。因此，我們提出 WundtGPT，這是一個同理且主動的心理健康大型語言模型，透過微調心理師與患者之間的指導和真實對話而獲得。它旨在協助心理師進行診斷，並幫助不願意面對面溝通的患者了解自己的心理狀況。它的獨特之處在於，它不僅可以提出有目的性的問題來引導患者詳細說明他們的症狀，還能提供溫暖的情緒支持。具體來說，WundtGPT 將問題收集、心理診斷鏈和同理心約束整合到一個綜合提示中，用於引發 LLM 的問題和診斷。此外，WundtGPT 提出了一個獎勵模型，以促進與同理心心理健康專業人員的一致性，其中包含兩個關鍵因素：認知同理心和情緒同理心。我們對所提出的模型進行了全面的評估。根據這些結果，我們進一步根據主動性、有效性、專業性和一致性進行手動評估。我們注意到 WundtGPT 可以提供專業且有效的諮詢。此模型可在 huggingface 取得。", "author": "Chenyu Ren et.al.", "authors": "Chenyu Ren, Yazhou Zhang, Daihai He, Jing Qin", "id": "2406.15474v1", "paper_url": "http://arxiv.org/abs/2406.15474v1", "repo": "null"}}