{"2410.03181": {"publish_time": "2024-10-04", "title": "Kiss up, Kick down: Exploring Behavioral Changes in Multi-modal Large Language Models with Assigned Visual Personas", "paper_summary": "This study is the first to explore whether multi-modal large language models\n(LLMs) can align their behaviors with visual personas, addressing a significant\ngap in the literature that predominantly focuses on text-based personas. We\ndeveloped a novel dataset of 5K fictional avatar images for assignment as\nvisual personas to LLMs, and analyzed their negotiation behaviors based on the\nvisual traits depicted in these images, with a particular focus on\naggressiveness. The results indicate that LLMs assess the aggressiveness of\nimages in a manner similar to humans and output more aggressive negotiation\nbehaviors when prompted with an aggressive visual persona. Interestingly, the\nLLM exhibited more aggressive negotiation behaviors when the opponent's image\nappeared less aggressive than their own, and less aggressive behaviors when the\nopponents image appeared more aggressive.", "paper_summary_zh": "本研究首次探討多模態大型語言模型 (LLM) 是否能將其行為與視覺角色對齊，填補了文獻中主要關注基於文字的角色的重大空白。我們開發了一個包含 5,000 個虛構頭像圖片的新穎資料集，以將視覺角色分配給 LLM，並根據這些圖片中描繪的視覺特徵分析他們的協商行為，特別關注侵略性。結果表明，LLM 以類似於人類的方式評估圖片的侵略性，並且在以侵略性視覺角色提示時輸出更具侵略性的協商行為。有趣的是，當對手的圖片看起來比自己的圖片不那麼具有侵略性時，LLM 表現出更具侵略性的協商行為；而當對手的圖片看起來更具侵略性時，則表現出不那麼具有侵略性的行為。", "author": "Seungjong Sun et.al.", "authors": "Seungjong Sun, Eungu Lee, Seo Yeon Baek, Seunghyun Hwang, Wonbyung Lee, Dongyan Nan, Bernard J. Jansen, Jang Hyun Kim", "id": "2410.03181v1", "paper_url": "http://arxiv.org/abs/2410.03181v1", "repo": "null"}}