{"2409.15892": {"publish_time": "2024-09-24", "title": "Symmetries and Expressive Requirements for Learning General Policies", "paper_summary": "State symmetries play an important role in planning and generalized planning.\nIn the first case, state symmetries can be used to reduce the size of the\nsearch; in the second, to reduce the size of the training set. In the case of\ngeneral planning, however, it is also critical to distinguish non-symmetric\nstates, i.e., states that represent non-isomorphic relational structures.\nHowever, while the language of first-order logic distinguishes non-symmetric\nstates, the languages and architectures used to represent and learn general\npolicies do not. In particular, recent approaches for learning general policies\nuse state features derived from description logics or learned via graph neural\nnetworks (GNNs) that are known to be limited by the expressive power of C_2,\nfirst-order logic with two variables and counting. In this work, we address the\nproblem of detecting symmetries in planning and generalized planning and use\nthe results to assess the expressive requirements for learning general policies\nover various planning domains. For this, we map planning states to plain\ngraphs, run off-the-shelf algorithms to determine whether two states are\nisomorphic with respect to the goal, and run coloring algorithms to determine\nif C_2 features computed logically or via GNNs distinguish non-isomorphic\nstates. Symmetry detection results in more effective learning, while the\nfailure to detect non-symmetries prevents general policies from being learned\nat all in certain domains.", "paper_summary_zh": "狀態對稱性在規劃和廣義規劃中扮演著重要的角色。\n在第一種情況中，狀態對稱性可用於縮小搜尋的規模；在第二種情況中，可用於縮小訓練集的規模。然而，在廣義規劃的情況中，區分非對稱狀態（即表示非同構關係結構的狀態）也很重要。然而，雖然一階邏輯的語言區分了非對稱狀態，但用於表示和學習一般策略的語言和架構卻沒有。特別是，最近用於學習一般策略的方法使用從描述邏輯中衍生的狀態特徵，或通過圖神經網路 (GNN) 學習，已知這些特徵受到具有兩個變數和計數的一階邏輯 C_2 的表達能力限制。在這項工作中，我們解決了在規劃和廣義規劃中檢測對稱性的問題，並使用結果評估在各種規劃領域中學習一般策略的表達需求。為此，我們將規劃狀態映射到平面圖形，執行現成的演算法來確定兩個狀態是否相對於目標同構，並執行著色演算法來確定透過邏輯或 GNN 計算的 C_2 特徵是否區分非同構狀態。對稱性檢測會帶來更有效的學習，而無法檢測非對稱性則會完全阻止在某些領域中學習一般策略。", "author": "Dominik Drexler et.al.", "authors": "Dominik Drexler, Simon Ståhlberg, Blai Bonet, Hector Geffner", "id": "2409.15892v1", "paper_url": "http://arxiv.org/abs/2409.15892v1", "repo": "null"}}