{"2408.11043": {"publish_time": "2024-08-20", "title": "Reconciling Methodological Paradigms: Employing Large Language Models as Novice Qualitative Research Assistants in Talent Management Research", "paper_summary": "Qualitative data collection and analysis approaches, such as those employing\ninterviews and focus groups, provide rich insights into customer attitudes,\nsentiment, and behavior. However, manually analyzing qualitative data requires\nextensive time and effort to identify relevant topics and thematic insights.\nThis study proposes a novel approach to address this challenge by leveraging\nRetrieval Augmented Generation (RAG) based Large Language Models (LLMs) for\nanalyzing interview transcripts. The novelty of this work lies in strategizing\nthe research inquiry as one that is augmented by an LLM that serves as a novice\nresearch assistant. This research explores the mental model of LLMs to serve as\nnovice qualitative research assistants for researchers in the talent management\nspace. A RAG-based LLM approach is extended to enable topic modeling of\nsemi-structured interview data, showcasing the versatility of these models\nbeyond their traditional use in information retrieval and search. Our findings\ndemonstrate that the LLM-augmented RAG approach can successfully extract topics\nof interest, with significant coverage compared to manually generated topics\nfrom the same dataset. This establishes the viability of employing LLMs as\nnovice qualitative research assistants. Additionally, the study recommends that\nresearchers leveraging such models lean heavily on quality criteria used in\ntraditional qualitative research to ensure rigor and trustworthiness of their\napproach. Finally, the paper presents key recommendations for industry\npractitioners seeking to reconcile the use of LLMs with established qualitative\nresearch paradigms, providing a roadmap for the effective integration of these\npowerful, albeit novice, AI tools in the analysis of qualitative datasets\nwithin talent", "paper_summary_zh": "<paragraph>定性資料蒐集與分析方法，例如採用訪談和焦點團體，能深入洞察客戶態度、情緒和行為。然而，人工分析定性資料需要大量的時間和精力才能找出相關主題和主題見解。本研究提出了一種新方法，透過利用檢索擴充生成（RAG）技術的大語言模型（LLM）來分析訪談紀錄，以解決這個挑戰。這項工作的創新之處在於將研究探討策略化為由 LLM 擴充，而 LLM 則扮演新手研究助理的角色。本研究探討 LLM 的心智模型，以作為人才管理領域研究人員的新手定性研究助理。將基於 RAG 的 LLM 方法延伸，以進行半結構式訪談資料的主題建模，展示這些模型除了在資訊檢索和搜尋中的傳統用途之外的多功能性。我們的研究結果顯示，LLM 擴充的 RAG 方法可以成功萃取出感興趣的主題，與從相同資料集手動產生的主題相比，涵蓋範圍顯著。這確立了將 LLM 用作新手定性研究助理的可行性。此外，本研究建議，利用此類模型的研究人員應大量依賴傳統定性研究中使用的品質標準，以確保其方法的嚴謹性和可信度。最後，本文針對尋求調和 LLM 使用與既定定性研究範例的產業從業人員提出關鍵建議，提供在人才領域中有效整合這些強大的新手 AI 工具來分析定性資料集的路線圖。</paragraph>", "author": "Sreyoshi Bhaduri et.al.", "authors": "Sreyoshi Bhaduri, Satya Kapoor, Alex Gil, Anshul Mittal, Rutu Mulkar", "id": "2408.11043v1", "paper_url": "http://arxiv.org/abs/2408.11043v1", "repo": "null"}}