{"2405.10260": {"publish_time": "2024-05-16", "title": "Keep It Private: Unsupervised Privatization of Online Text", "paper_summary": "Authorship obfuscation techniques hold the promise of helping people protect\ntheir privacy in online communications by automatically rewriting text to hide\nthe identity of the original author. However, obfuscation has been evaluated in\nnarrow settings in the NLP literature and has primarily been addressed with\nsuperficial edit operations that can lead to unnatural outputs. In this work,\nwe introduce an automatic text privatization framework that fine-tunes a large\nlanguage model via reinforcement learning to produce rewrites that balance\nsoundness, sense, and privacy. We evaluate it extensively on a large-scale test\nset of English Reddit posts by 68k authors composed of short-medium length\ntexts. We study how the performance changes among evaluative conditions\nincluding authorial profile length and authorship detection strategy. Our\nmethod maintains high text quality according to both automated metrics and\nhuman evaluation, and successfully evades several automated authorship attacks.", "paper_summary_zh": "作者模糊化技术有望帮助人们通过自动改写文本来隐藏原始作者的身份，从而保护他们在网络通信中的隐私。然而，在 NLP 文献中，混淆已在狭窄的环境中得到评估，并且主要通过表面编辑操作来解决，这可能导致不自然的结果。在这项工作中，我们引入了一个自动文本私有化框架，该框架通过强化学习对大型语言模型进行微调，以生成平衡健全性、意义和隐私性的改写。我们对由 68k 位作者撰写的英语 Reddit 帖子的大规模测试集进行了广泛的评估，该测试集由中短篇文本组成。我们研究了在评估条件（包括作者个人资料长度和作者身份检测策略）之间性能如何变化。我们的方法根据自动指标和人工评估保持了较高的文本质量，并成功规避了几次自动作者攻击。", "author": "Calvin Bao et.al.", "authors": "Calvin Bao, Marine Carpuat", "id": "2405.10260v1", "paper_url": "http://arxiv.org/abs/2405.10260v1", "repo": "https://github.com/csbao/kip-privatization"}}