{"2409.12005": {"publish_time": "2024-09-18", "title": "Representing Positional Information in Generative World Models for Object Manipulation", "paper_summary": "Object manipulation capabilities are essential skills that set apart embodied\nagents engaging with the world, especially in the realm of robotics. The\nability to predict outcomes of interactions with objects is paramount in this\nsetting. While model-based control methods have started to be employed for\ntackling manipulation tasks, they have faced challenges in accurately\nmanipulating objects. As we analyze the causes of this limitation, we identify\nthe cause of underperformance in the way current world models represent crucial\npositional information, especially about the target's goal specification for\nobject positioning tasks. We introduce a general approach that empowers world\nmodel-based agents to effectively solve object-positioning tasks. We propose\ntwo declinations of this approach for generative world models:\nposition-conditioned (PCP) and latent-conditioned (LCP) policy learning. In\nparticular, LCP employs object-centric latent representations that explicitly\ncapture object positional information for goal specification. This naturally\nleads to the emergence of multimodal capabilities, enabling the specification\nof goals through spatial coordinates or a visual goal. Our methods are\nrigorously evaluated across several manipulation environments, showing\nfavorable performance compared to current model-based control approaches.", "paper_summary_zh": "物體操作能力是讓具身代理與世界互動時不可或缺的重要技能，特別是在機器人領域。在這種情況下，預測與物體互動的結果至關重要。雖然基於模型的控制方法已開始用於處理操作任務，但在精確操作物體方面仍面臨挑戰。在分析此限制的原因時，我們找出當前世界模型表示關鍵位置資訊的方式中，導致效能不佳的原因，特別是關於物件定位任務的目標規格。我們提出了一種通用方法，讓基於世界模型的代理能有效解決物件定位任務。我們針對生成式世界模型提出了兩種此方法的變體：位置條件 (PCP) 和潛在條件 (LCP) 策略學習。特別是，LCP 使用以物件為中心的潛在表示，明確擷取物件位置資訊以進行目標規格。這自然會導致多模態能力的出現，讓目標能透過空間座標或視覺目標來指定。我們的這些方法在多個操作環境中都經過嚴格評估，與當前的基於模型的控制方法相比，顯示出良好的效能。", "author": "Stefano Ferraro et.al.", "authors": "Stefano Ferraro, Pietro Mazzaglia, Tim Verbelen, Bart Dhoedt, Sai Rajeswar", "id": "2409.12005v2", "paper_url": "http://arxiv.org/abs/2409.12005v2", "repo": "null"}}