{"2502.12154": {"publish_time": "2025-02-17", "title": "Diffusion Models without Classifier-free Guidance", "paper_summary": "This paper presents Model-guidance (MG), a novel objective for training\ndiffusion model that addresses and removes of the commonly used Classifier-free\nguidance (CFG). Our innovative approach transcends the standard modeling of\nsolely data distribution to incorporating the posterior probability of\nconditions. The proposed technique originates from the idea of CFG and is easy\nyet effective, making it a plug-and-play module for existing models. Our method\nsignificantly accelerates the training process, doubles the inference speed,\nand achieve exceptional quality that parallel and even surpass concurrent\ndiffusion models with CFG. Extensive experiments demonstrate the effectiveness,\nefficiency, scalability on different models and datasets. Finally, we establish\nstate-of-the-art performance on ImageNet 256 benchmarks with an FID of 1.34.\nOur code is available at https://github.com/tzco/Diffusion-wo-CFG.", "paper_summary_zh": "本文提出模型指導 (MG)，一種用於訓練擴散模型的新目標，它解決並消除了常用的無分類器指導 (CFG)。我們的創新方法超越了僅數據分佈的標準建模，並納入了條件的後驗機率。提議的技術源自 CFG 的概念，既簡單又有效，使其成為現有模型的即插即用模組。我們的技術顯著加速了訓練過程，將推論速度提高了一倍，並取得了與 CFG 並行甚至超越並行擴散模型的出色品質。廣泛的實驗證明了該技術在不同模型和資料集上的有效性、效率和可擴充性。最後，我們在 ImageNet 256 基準上建立了最先進的效能，FID 為 1.34。我們的程式碼可在 https://github.com/tzco/Diffusion-wo-CFG 取得。", "author": "Zhicong Tang et.al.", "authors": "Zhicong Tang, Jianmin Bao, Dong Chen, Baining Guo", "id": "2502.12154v1", "paper_url": "http://arxiv.org/abs/2502.12154v1", "repo": "null"}}