{"2407.08898": {"publish_time": "2024-07-12", "title": "IDAT: A Multi-Modal Dataset and Toolkit for Building and Evaluating Interactive Task-Solving Agents", "paper_summary": "Seamless interaction between AI agents and humans using natural language\nremains a key goal in AI research. This paper addresses the challenges of\ndeveloping interactive agents capable of understanding and executing grounded\nnatural language instructions through the IGLU competition at NeurIPS. Despite\nadvancements, challenges such as a scarcity of appropriate datasets and the\nneed for effective evaluation platforms persist. We introduce a scalable data\ncollection tool for gathering interactive grounded language instructions within\na Minecraft-like environment, resulting in a Multi-Modal dataset with around\n9,000 utterances and over 1,000 clarification questions. Additionally, we\npresent a Human-in-the-Loop interactive evaluation platform for qualitative\nanalysis and comparison of agent performance through multi-turn communication\nwith human annotators. We offer to the community these assets referred to as\nIDAT (IGLU Dataset And Toolkit) which aim to advance the development of\nintelligent, interactive AI agents and provide essential resources for further\nresearch.", "paper_summary_zh": "透過自然語言，讓人工智慧代理與人類無縫互動，一直是人工智慧研究的關鍵目標。本文透過 NeurIPS 的 IGLU 競賽，探討開發互動式代理的挑戰，此代理能夠理解並執行接地的自然語言指令。儘管有進展，但仍有挑戰存在，例如缺乏適當的資料集，以及需要有效的評估平台。我們引進一個可擴充資料收集工具，在類似 Minecraft 的環境中收集互動式接地語言指令，產生一個多模態資料集，包含約 9,000 個語句和超過 1,000 個澄清問題。此外，我們提供一個人類參與迴圈的互動式評估平台，用於透過與人類註解者的多輪溝通，進行代理效能的定性分析和比較。我們提供這些稱為 IDAT（IGLU 資料集和工具包）的資產給社群，旨在推進智慧互動式人工智慧代理的開發，並提供進一步研究的重要資源。", "author": "Shrestha Mohanty et.al.", "authors": "Shrestha Mohanty, Negar Arabzadeh, Andrea Tupini, Yuxuan Sun, Alexey Skrynnik, Artem Zholus, Marc-Alexandre Côté, Julia Kiseleva", "id": "2407.08898v1", "paper_url": "http://arxiv.org/abs/2407.08898v1", "repo": "null"}}