{"2405.19166": {"publish_time": "2024-05-29", "title": "Transformers as Neural Operators for Solutions of Differential Equations with Finite Regularity", "paper_summary": "Neural operator learning models have emerged as very effective surrogates in\ndata-driven methods for partial differential equations (PDEs) across different\napplications from computational science and engineering. Such operator learning\nmodels not only predict particular instances of a physical or biological system\nin real-time but also forecast classes of solutions corresponding to a\ndistribution of initial and boundary conditions or forcing terms. % DeepONet is\nthe first neural operator model and has been tested extensively for a broad\nclass of solutions, including Riemann problems. Transformers have not been used\nin that capacity, and specifically, they have not been tested for solutions of\nPDEs with low regularity. %\n  In this work, we first establish the theoretical groundwork that transformers\npossess the universal approximation property as operator learning models.\n  We then apply transformers to forecast solutions of diverse dynamical systems\nwith solutions of finite regularity for a plurality of initial conditions and\nforcing terms. In particular, we consider three examples: the Izhikevich neuron\nmodel, the tempered fractional-order Leaky Integrate-and-Fire (LIF) model, and\nthe one-dimensional Euler equation Riemann problem. For the latter problem, we\nalso compare with variants of DeepONet, and we find that transformers\noutperform DeepONet in accuracy but they are computationally more expensive.", "paper_summary_zh": "神經算子學習模型已成為跨越計算科學和工程不同應用中偏微分方程式 (PDE) 的數據驅動方法中非常有效的替代品。此類算子學習模型不僅可以實時預測物理或生物系統的特定實例，還能預測對應於初始和邊界條件或強迫項分佈的解類別。DeepONet 是第一個神經算子模型，並且已針對廣泛的解類別（包括黎曼問題）進行了廣泛測試。Transformer尚未用於該容量，特別是它們尚未針對低正則性的偏微分方程式解進行測試。在這項工作中，我們首先建立了Transformer作為算子學習模型具備通用逼近特性的理論基礎。然後，我們應用Transformer來預測具有有限正則性解的多個初始條件和強迫項的各種動態系統的解。特別是，我們考慮三個範例：Izhikevich 神經元模型、緩和分數階 Leaky Integrate-and-Fire (LIF) 模型和一維歐拉方程黎曼問題。對於後一個問題，我們還與 DeepONet 的變體進行了比較，我們發現Transformer在準確性方面優於 DeepONet，但它們在計算上更昂貴。", "author": "Benjamin Shih et.al.", "authors": "Benjamin Shih, Ahmad Peyvan, Zhongqiang Zhang, George Em Karniadakis", "id": "2405.19166v1", "paper_url": "http://arxiv.org/abs/2405.19166v1", "repo": "null"}}