{"2410.21779": {"publish_time": "2024-10-29", "title": "Leveraging LLMs for Hypothetical Deduction in Logical Inference: A Neuro-Symbolic Approach", "paper_summary": "Large Language Models (LLMs) have exhibited remarkable potential across a\nwide array of reasoning tasks, including logical reasoning. Although massive\nefforts have been made to empower the logical reasoning ability of LLMs via\nexternal logical symbolic solvers, crucial challenges of the poor\ngeneralization ability to questions with different features and inevitable\nquestion information loss of symbolic solver-driven approaches remain\nunresolved. To mitigate these issues, we introduce LINA, a LLM-driven\nneuro-symbolic approach for faithful logical reasoning. By enabling an LLM to\nautonomously perform the transition from propositional logic extraction to\nsophisticated logical reasoning, LINA not only bolsters the resilience of the\nreasoning process but also eliminates the dependency on external solvers.\nAdditionally, through its adoption of a hypothetical-deductive reasoning\nparadigm, LINA effectively circumvents the expansive search space challenge\nthat plagues traditional forward reasoning methods. Empirical evaluations\ndemonstrate that LINA substantially outperforms both established propositional\nlogic frameworks and conventional prompting techniques across a spectrum of\nfive logical reasoning tasks. Specifically, LINA achieves an improvement of\n24.34% over LINC on the FOLIO dataset, while also surpassing prompting\nstrategies like CoT and CoT-SC by up to 24.02%. Our code is available at\nhttps://github.com/wufeiwuwoshihua/nshy.", "paper_summary_zh": "大型語言模型 (LLM) 在廣泛的推理任務中展現出非凡的潛力，包括邏輯推理。儘管已投入大量心力透過外部邏輯符號求解器提升 LLM 的邏輯推理能力，符號求解器驅動方法的關鍵挑戰在於對具備不同特徵問題的概化能力不佳，以及不可避免的題目資訊遺失，這些問題仍未獲得解決。為了緩解這些問題，我們引入了 LINA，一種由 LLM 驅動的神經符號方法，用於忠實的邏輯推理。透過讓 LLM 自主執行從命題邏輯萃取到精密的邏輯推理的轉換，LINA 不僅增強了推理過程的復原力，也消除了對外部求解器的依賴性。此外，透過採用假設演繹推理範例，LINA 有效地迴避了困擾傳統前向推理方法的廣泛搜尋空間挑戰。實證評估顯示，LINA 在五項邏輯推理任務中都大幅優於既有的命題邏輯架構和慣用的提示技術。具體來說，LINA 在 FOLIO 資料集上比 LINC 提升了 24.34%，同時也比 CoT 和 CoT-SC 等提示策略高出 24.02%。我們的程式碼可於 https://github.com/wufeiwuwoshihua/nshy 取得。", "author": "Qingchuan Li et.al.", "authors": "Qingchuan Li, Jiatong Li, Tongxuan Liu, Yuting Zeng, Mingyue Cheng, Weizhe Huang, Qi Liu", "id": "2410.21779v1", "paper_url": "http://arxiv.org/abs/2410.21779v1", "repo": "https://github.com/wufeiwuwoshihua/nshy"}}