{"2502.14497": {"publish_time": "2025-02-20", "title": "Stories that (are) Move(d by) Markets: A Causal Exploration of Market Shocks and Semantic Shifts across Different Partisan Groups", "paper_summary": "Macroeconomic fluctuations and the narratives that shape them form a mutually\nreinforcing cycle: public discourse can spur behavioural changes leading to\neconomic shifts, which then result in changes in the stories that propagate. We\nshow that shifts in semantic embedding space can be causally linked to\nfinancial market shocks -- deviations from the expected market behaviour.\nFurthermore, we show how partisanship can influence the predictive power of\ntext for market fluctuations and shape reactions to those same shocks. We also\nprovide some evidence that text-based signals are particularly salient during\nunexpected events such as COVID-19, highlighting the value of language data as\nan exogenous variable in economic forecasting. Our findings underscore the\nbidirectional relationship between news outlets and market shocks, offering a\nnovel empirical approach to studying their effect on each other.", "paper_summary_zh": "宏觀經濟波動與形塑它們的敘事形成一個相互強化的循環：公共論述可能激發導致經濟變化的行為改變，進而導致宣傳故事的改變。我們表明，語義嵌入空間的轉變可能與金融市場震盪（與預期的市場行為的偏差）有因果關係。此外，我們展示了黨派立場如何影響文字對市場波動的預測能力，以及如何形塑對這些震盪的反應。我們還提供了一些證據，證明在 COVID-19 等意外事件期間，基於文字的信號特別顯著，突顯了語言資料在經濟預測中作為外生變數的價值。我們的研究結果強調了新聞媒體與市場震盪之間的雙向關係，提供了一種研究它們對彼此影響的新穎實證方法。", "author": "Felix Drinkall et.al.", "authors": "Felix Drinkall, Stefan Zohren, Michael McMahon, Janet B. Pierrehumbert", "id": "2502.14497v1", "paper_url": "http://arxiv.org/abs/2502.14497v1", "repo": "null"}}