{"2408.12060": {"publish_time": "2024-08-22", "title": "Evidence-backed Fact Checking using RAG and Few-Shot In-Context Learning with LLMs", "paper_summary": "Given the widespread dissemination of misinformation on social media,\nimplementing fact-checking mechanisms for online claims is essential. Manually\nverifying every claim is highly challenging, underscoring the need for an\nautomated fact-checking system. This paper presents our system designed to\naddress this issue. We utilize the Averitec dataset to assess the veracity of\nclaims. In addition to veracity prediction, our system provides supporting\nevidence, which is extracted from the dataset. We develop a Retrieve and\nGenerate (RAG) pipeline to extract relevant evidence sentences from a knowledge\nbase, which are then inputted along with the claim into a large language model\n(LLM) for classification. We also evaluate the few-shot In-Context Learning\n(ICL) capabilities of multiple LLMs. Our system achieves an 'Averitec' score of\n0.33, which is a 22% absolute improvement over the baseline. All code will be\nmade available on All code will be made available on\nhttps://github.com/ronit-singhal/evidence-backed-fact-checking-using-rag-and-few-shot-in-context-learning-with-llms.", "paper_summary_zh": "鉴于社交媒体上错误信息的广泛传播，为在线声明实施事实核查机制至关重要。手动验证每个声明极具挑战性，这凸显了对自动事实核查系统的需求。本文介绍了我们为解决此问题而设计的系统。我们利用 Averitec 数据集来评估声明的真实性。除了真实性预测之外，我们的系统还提供了从数据集中提取的支持证据。我们开发了一个检索和生成 (RAG) 管道，以从知识库中提取相关的证据句子，然后将其与声明一起输入大型语言模型 (LLM) 进行分类。我们还评估了多个 LLM 的少量 In-Context Learning (ICL) 功能。我们的系统实现了 0.33 的“Averitec”分数，比基线提高了 22% 的绝对值。所有代码将在 https://github.com/ronit-singhal/evidence-backed-fact-checking-using-rag-and-few-shot-in-context-learning-with-llms 上提供。", "author": "Ronit Singhal et.al.", "authors": "Ronit Singhal, Pransh Patwa, Parth Patwa, Aman Chadha, Amitava Das", "id": "2408.12060v1", "paper_url": "http://arxiv.org/abs/2408.12060v1", "repo": "null"}}