{"2411.12685": {"publish_time": "2024-11-19", "title": "Enhanced Sign Language Translation between American Sign Language (ASL) and Indian Sign Language (ISL) Using LLMs", "paper_summary": "We have come up with a research that hopes to provide a bridge between the\nusers of American Sign Language and the users of spoken language and Indian\nSign Language (ISL). The research enabled us to create a novel framework that\nwe have developed for Learner Systems. Leveraging art of Large models to create\nkey features including: - Real-time translation between these two sign\nlanguages in an efficient manner. Making LLM's capability available for\nseamless translations to ISL. Here is the full study showing its implementation\nin this paper. The core of the system is a sophisticated pipeline that begins\nwith reclassification and recognition of ASL gestures based on a strong Random\nForest Classifier. By recognizing the ASL, it is translated into text which can\nbe more easily processed. Highly evolved natural language NLP (Natural Language\nProcessing) techniques come in handy as they play a role in our LLM integration\nwhere you then use LLMs to be able to convert the ASL text to ISL which\nprovides you with the intent of sentence or phrase. The final step is to\nsynthesize the translated text back into ISL gestures, creating an end-to-end\ntranslation experience using RIFE-Net. This framework is tasked with key\nchallenges such as automatically dealing with gesture variability and\novercoming the linguistic differences between ASL and ISL. By automating the\ntranslation process, we hope to vastly improve accessibility for sign language\nusers. No longer will the communication gap between ASL and ISL create\nbarriers; this totally cool innovation aims to bring our communities closer\ntogether. And we believe, with full confidence in our framework, that we're\nable to apply the same principles across a wide variety of sign language\ndialects.", "paper_summary_zh": "我們提出了一項研究，希望為美國手語使用者和口語使用者以及印度手語 (ISL) 使用者之間建立一座橋樑。該研究使我們能夠為學習者系統開發一個創新的框架。利用大型模型的藝術來建立關鍵功能，包括：- 在這兩種手語之間以有效的方式進行實時翻譯。讓 LLM 的能力可以無縫翻譯成 ISL。以下是顯示其在本文中實作的完整研究。該系統的核心是一個複雜的管道，它從基於強隨機森林分類器的 ASL 手勢重新分類和識別開始。通過識別 ASL，它被翻譯成可以更輕鬆處理的文字。高度發展的自然語言 NLP（自然語言處理）技術派上用場，因為它們在我們的 LLM 整合中發揮作用，在那裡您使用 LLM 將 ASL 文字轉換為 ISL，從而為您提供句子或短語的意圖。最後一步是將翻譯後的文字合成回 ISL 手勢，使用 RIFE-Net 創建端到端的翻譯體驗。此框架負責處理關鍵挑戰，例如自動處理手勢變異性並克服 ASL 和 ISL 之間的語言差異。通過自動化翻譯過程，我們希望大幅改善手語使用者的可及性。ASL 和 ISL 之間的溝通鴻溝不再會造成障礙；這項非常酷的創新旨在讓我們的社群更緊密地結合在一起。我們相信，對我們的框架充滿信心，我們能夠將相同的原則應用於各種手語方言。", "author": "Malay Kumar et.al.", "authors": "Malay Kumar, S. Sarvajit Visagan, Tanish Sarang Mahajan, Anisha Natarajan", "id": "2411.12685v1", "paper_url": "http://arxiv.org/abs/2411.12685v1", "repo": "null"}}