{"2409.18101": {"publish_time": "2024-09-26", "title": "AI-Powered Augmented Reality for Satellite Assembly, Integration and Test", "paper_summary": "The integration of Artificial Intelligence (AI) and Augmented Reality (AR) is\nset to transform satellite Assembly, Integration, and Testing (AIT) processes\nby enhancing precision, minimizing human error, and improving operational\nefficiency in cleanroom environments. This paper presents a technical\ndescription of the European Space Agency's (ESA) project \"AI for AR in\nSatellite AIT,\" which combines real-time computer vision and AR systems to\nassist technicians during satellite assembly. Leveraging Microsoft HoloLens 2\nas the AR interface, the system delivers context-aware instructions and\nreal-time feedback, tackling the complexities of object recognition and 6D pose\nestimation in AIT workflows. All AI models demonstrated over 70% accuracy, with\nthe detection model exceeding 95% accuracy, indicating a high level of\nperformance and reliability. A key contribution of this work lies in the\neffective use of synthetic data for training AI models in AR applications,\naddressing the significant challenges of obtaining real-world datasets in\nhighly dynamic satellite environments, as well as the creation of the Segmented\nAnything Model for Automatic Labelling (SAMAL), which facilitates the automatic\nannotation of real data, achieving speeds up to 20 times faster than manual\nhuman annotation. The findings demonstrate the efficacy of AI-driven AR systems\nin automating critical satellite assembly tasks, setting a foundation for\nfuture innovations in the space industry.", "paper_summary_zh": "人工智慧（AI）與擴增實境（AR）的整合將徹底轉型衛星組裝、整合與測試（AIT）程序，藉由提升精準度、將人為錯誤降至最低，並提升潔淨室環境中的作業效率。本文提供歐洲太空總署（ESA）「衛星 AIT 中的 AR 人工智慧」專案的技術說明，該專案結合即時電腦視覺與 AR 系統，在衛星組裝過程中協助技術人員。系統運用 Microsoft HoloLens 2 作為 AR 介面，提供情境感知的指示與即時回饋，解決 AIT 工作流程中複雜的物件辨識與 6D 姿態估測問題。所有 AI 模型均展現出超過 70% 的準確度，其中偵測模型的準確度超過 95%，表示效能與可靠性極高。這項工作的關鍵貢獻在於有效利用合成資料訓練 AR 應用程式的 AI 模型，解決在高度動態的衛星環境中取得真實世界資料集的重大挑戰，以及建立用於自動標籤的分割任何模型（SAMAL），協助自動註解真實資料，速度比人工手動註解快達 20 倍。研究結果證明了 AI 驅動的 AR 系統在自動化關鍵衛星組裝任務方面的效能，為太空產業的未來創新奠定基礎。", "author": "Alvaro Patricio et.al.", "authors": "Alvaro Patricio, Joao Valente, Atabak Dehban, Ines Cadilha, Daniel Reis, Rodrigo Ventura", "id": "2409.18101v1", "paper_url": "http://arxiv.org/abs/2409.18101v1", "repo": "null"}}