{"2409.17588": {"publish_time": "2024-09-26", "title": "DualCoTs: Dual Chain-of-Thoughts Prompting for Sentiment Lexicon Expansion of Idioms", "paper_summary": "Idioms represent a ubiquitous vehicle for conveying sentiments in the realm\nof everyday discourse, rendering the nuanced analysis of idiom sentiment\ncrucial for a comprehensive understanding of emotional expression within\nreal-world texts. Nevertheless, the existing corpora dedicated to idiom\nsentiment analysis considerably limit research in text sentiment analysis. In\nthis paper, we propose an innovative approach to automatically expand the\nsentiment lexicon for idioms, leveraging the capabilities of large language\nmodels through the application of Chain-of-Thought prompting. To demonstrate\nthe effectiveness of this approach, we integrate multiple existing resources\nand construct an emotional idiom lexicon expansion dataset (called EmoIdiomE),\nwhich encompasses a comprehensive repository of Chinese and English idioms.\nThen we designed the Dual Chain-of-Thoughts (DualCoTs) method, which combines\ninsights from linguistics and psycholinguistics, to demonstrate the\neffectiveness of using large models to automatically expand the sentiment\nlexicon for idioms. Experiments show that DualCoTs is effective in idioms\nsentiment lexicon expansion in both Chinese and English. For reproducibility,\nwe will release the data and code upon acceptance.", "paper_summary_zh": "慣用語是傳達日常話語中情感的普遍載體，對慣用語情感的細緻分析對於全面理解現實世界文本中的情感表達至關重要。儘管如此，現有的慣用語情感分析語料庫極大地限制了文本情感分析的研究。在本文中，我們提出了一種創新的方法來自動擴展慣用語的情感詞彙，通過應用思想鏈提示利用大型語言模型的能力。為了證明這種方法的有效性，我們整合了多種現有資源，構建了一個情感慣用語詞彙擴展數據集（稱為 EmoIdiomE），其中包含了一個全面的中文和英文慣用語庫。然後，我們設計了雙重思想鏈（DualCoTs）方法，它結合了語言學和心理語言學的見解，以證明使用大型模型自動擴展慣用語情感詞彙的有效性。實驗表明，DualCoTs 在中英文慣用語情感詞彙擴展中都是有效的。為了可重複性，我們將在被接受後發布數據和代碼。", "author": "Fuqiang Niu et.al.", "authors": "Fuqiang Niu, Minghuan Tan, Bowen Zhang, Min Yang, Ruifeng Xu", "id": "2409.17588v1", "paper_url": "http://arxiv.org/abs/2409.17588v1", "repo": "null"}}