{"2412.18247": {"publish_time": "2024-12-24", "title": "Fréchet regression for multi-label feature selection with implicit regularization", "paper_summary": "Fr\\'echet regression extends linear regression to model complex responses\n  in metric spaces, making it particularly relevant for multi-label regression,\n  where each instance can have multiple associated labels. However, variable\n  selection within this framework remains underexplored. In this paper, we pro\npose a novel variable selection method that employs implicit regularization\n  instead of traditional explicit regularization approaches, which can\nintroduce\n  bias. Our method effectively captures nonlinear interactions between predic\ntors and responses while promoting model sparsity. We provide theoretical\n  results demonstrating selection consistency and illustrate the performance of\n  our approach through numerical examples", "paper_summary_zh": "Fréchet 回歸將線性回歸延伸到模型複雜回應\n在度量空間中，使其特別適用於多標籤回歸，\n其中每個實例可以有多個關聯標籤。但是，變量\n在這個框架內的選擇仍然未被充分探討。在本文中，我們提出\n一種新穎的變量選擇方法，它採用隱式正則化\n而不是傳統的顯式正則化方法，這可能會\n引入\n偏差。我們的模型有效地捕捉了預測器和響應之間的非線性交互，同時促進了模型的稀疏性。我們提供理論\n結果證明了選擇的一致性，並通過數值示例說明了我們的方法的性能", "author": "Dou El Kefel Mansouri et.al.", "authors": "Dou El Kefel Mansouri, Seif-Eddine Benkabou, Khalid Benabdeslem", "id": "2412.18247v1", "paper_url": "http://arxiv.org/abs/2412.18247v1", "repo": "null"}}