{"2501.13756": {"publish_time": "2025-01-23", "title": "Solving the long-tailed distribution problem by exploiting the synergies and balance of different techniques", "paper_summary": "In real-world data, long-tailed data distribution is common, making it\nchallenging for models trained on empirical risk minimisation to learn and\nclassify tail classes effectively. While many studies have sought to improve\nlong tail recognition by altering the data distribution in the feature space\nand adjusting model decision boundaries, research on the synergy and corrective\napproach among various methods is limited. Our study delves into three\nlong-tail recognition techniques: Supervised Contrastive Learning (SCL),\nRare-Class Sample Generator (RSG), and Label-Distribution-Aware Margin Loss\n(LDAM). SCL enhances intra-class clusters based on feature similarity and\npromotes clear inter-class separability but tends to favour dominant classes\nonly. When RSG is integrated into the model, we observed that the intra-class\nfeatures further cluster towards the class centre, which demonstrates a\nsynergistic effect together with SCL's principle of enhancing intra-class\nclustering. RSG generates new tail features and compensates for the tail\nfeature space squeezed by SCL. Similarly, LDAM is known to introduce a larger\nmargin specifically for tail classes; we demonstrate that LDAM further bolsters\nthe model's performance on tail classes when combined with the more explicit\ndecision boundaries achieved by SCL and RSG. Furthermore, SCL can compensate\nfor the dominant class accuracy sacrificed by RSG and LDAM. Our research\nemphasises the synergy and balance among the three techniques, with each\namplifying the strengths of the others and mitigating their shortcomings. Our\nexperiment on long-tailed distribution datasets, using an end-to-end\narchitecture, yields competitive results by enhancing tail class accuracy\nwithout compromising dominant class performance, achieving a balanced\nimprovement across all classes.", "paper_summary_zh": "在真實世界的資料中，長尾資料分佈很常見，這使得在經驗風險最小化訓練的模型難以有效地學習和分類尾部類別。儘管許多研究試圖通過改變特徵空間中的資料分佈和調整模型決策邊界來改善長尾識別，但對各種方法之間的協同效應和糾正方法的研究卻很有限。我們的研究深入探討了三種長尾識別技術：監督對比學習 (SCL)、稀有類別樣本生成器 (RSG) 和標籤分佈感知邊界損失 (LDAM)。SCL 基於特徵相似性增強類內簇，並促進清晰的類間可分離性，但傾向於只偏好主導類別。當 RSG 集成到模型中時，我們觀察到類內特徵進一步向類中心聚集，這與 SCL 增強類內聚類的原理一起展示了協同效應。RSG 生成了新的尾部特徵，並彌補了被 SCL 壓縮的尾部特徵空間。類似地，已知 LDAM 專門為尾部類別引入了更大的邊界；我們證明，LDAM 在與 SCL 和 RSG 實現的更明確的決策邊界相結合時，進一步提升了模型在尾部類別上的效能。此外，SCL 可以彌補 RSG 和 LDAM 犧牲的主導類別準確性。我們的研究強調了這三種技術之間的協同效應和平衡，每種技術都放大了其他技術的優勢並減輕了它們的缺點。我們使用端到端架構對長尾分佈資料集進行的實驗，通過提高尾部類別準確性而不損害主導類別效能，在所有類別中實現了平衡的改進，從而產生了有競爭力的結果。", "author": "Ziheng Wang et.al.", "authors": "Ziheng Wang, Toni Lassila, Sharib Ali", "id": "2501.13756v1", "paper_url": "http://arxiv.org/abs/2501.13756v1", "repo": "null"}}