{"2503.13427": {"publish_time": "2025-03-17", "title": "xLSTM 7B: A Recurrent LLM for Fast and Efficient Inference", "paper_summary": "Recent breakthroughs in solving reasoning, math and coding problems with\nLarge Language Models (LLMs) have been enabled by investing substantial\ncomputation budgets at inference time. Therefore, inference speed is one of the\nmost critical properties of LLM architectures, and there is a growing need for\nLLMs that are efficient and fast at inference. Recently, LLMs built on the\nxLSTM architecture have emerged as a powerful alternative to Transformers,\noffering linear compute scaling with sequence length and constant memory usage,\nboth highly desirable properties for efficient inference. However, such\nxLSTM-based LLMs have yet to be scaled to larger models and assessed and\ncompared with respect to inference speed and efficiency. In this work, we\nintroduce xLSTM 7B, a 7-billion-parameter LLM that combines xLSTM's\narchitectural benefits with targeted optimizations for fast and efficient\ninference. Our experiments demonstrate that xLSTM 7B achieves performance on\ndownstream tasks comparable to other similar-sized LLMs, while providing\nsignificantly faster inference speeds and greater efficiency compared to Llama-\nand Mamba-based LLMs. These results establish xLSTM 7B as the fastest and most\nefficient 7B LLM, offering a solution for tasks that require large amounts of\ntest-time computation. Our work highlights xLSTM's potential as a foundational\narchitecture for methods building on heavy use of LLM inference. Our model\nweights, model code and training code are open-source.", "paper_summary_zh": "<paragraph>近年來，藉由投入大量的推論運算資源，大型語言模型 (LLM) 在解決推理、數學和編碼問題方面取得了突破性進展。因此，推論速度是 LLM 架構最關鍵的特性之一，而且對於高效快速推論的 LLM 的需求也日益增長。最近，基於 xLSTM 架構構建的 LLM 已成為 Transformer 的強大替代方案，它具有線性計算規模化（與序列長度相關）和恆定內存使用量的特性，這些都是高效推論非常需要的特性。然而，此類基於 xLSTM 的 LLM 尚未擴展到更大的模型，也尚未就推論速度和效率進行評估和比較。在這項工作中，我們推出了 xLSTM 7B，這是一個 70 億參數的 LLM，它結合了 xLSTM 的架構優勢和針對快速高效推論的目標優化。我們的實驗表明，xLSTM 7B 在下游任務上的性能與其他類似規模的 LLM 相當，同時與基於 Llama 和 Mamba 的 LLM 相比，提供了顯著更快的推論速度和更高的效率。這些結果確立了 xLSTM 7B 作為最快、最高效的 7B LLM 的地位，為需要大量測試時間計算的任務提供了解決方案。我們的工作突出了 xLSTM 作為大量使用 LLM 推論之方法的基礎架構的潛力。我們的模型權重、模型程式碼和訓練程式碼都是開源的。\n</paragraph>\n", "author": "Maximilian Beck et.al.", "authors": "Maximilian Beck, Korbinian Pöppel, Phillip Lippe, Richard Kurle, Patrick M. Blies, Günter Klambauer, Sebastian Böck, Sepp Hochreiter", "id": "2503.13427v1", "paper_url": "http://arxiv.org/abs/2503.13427v1", "repo": "null"}}