{"2410.07551": {"publish_time": "2024-10-10", "title": "KRAG Framework for Enhancing LLMs in the Legal Domain", "paper_summary": "This paper introduces Knowledge Representation Augmented Generation (KRAG), a\nnovel framework designed to enhance the capabilities of Large Language Models\n(LLMs) within domain-specific applications. KRAG points to the strategic\ninclusion of critical knowledge entities and relationships that are typically\nabsent in standard data sets and which LLMs do not inherently learn. In the\ncontext of legal applications, we present Soft PROLEG, an implementation model\nunder KRAG, which uses inference graphs to aid LLMs in delivering structured\nlegal reasoning, argumentation, and explanations tailored to user inquiries.\nThe integration of KRAG, either as a standalone framework or in tandem with\nretrieval augmented generation (RAG), markedly improves the ability of language\nmodels to navigate and solve the intricate challenges posed by legal texts and\nterminologies. This paper details KRAG's methodology, its implementation\nthrough Soft PROLEG, and potential broader applications, underscoring its\nsignificant role in advancing natural language understanding and processing in\nspecialized knowledge domains.", "paper_summary_zh": "本文介紹知識表徵增強生成 (KRAG)，一個新穎的架構，旨在增強大型語言模型 (LLM) 在特定領域應用中的能力。KRAG 指出策略性地納入關鍵知識實體和關係，這些實體和關係通常不存在於標準資料集中，而 LLM 也無法固有地學習。在法律應用方面，我們提出 Soft PROLEG，這是一個在 KRAG 下的實作模型，它使用推理圖來協助 LLM 提供結構化的法律推理、論證和解釋，以滿足使用者的詢問。整合 KRAG，無論是作為獨立架構或與檢索增強生成 (RAG) 結合使用，都能顯著提升語言模型導航和解決法律文本和術語所帶來的複雜挑戰的能力。本文詳述 KRAG 的方法論、透過 Soft PROLEG 的實作，以及潛在的更廣泛應用，強調其在推進專業知識領域的自然語言理解和處理中扮演的重要角色。", "author": "Nguyen Ha Thanh et.al.", "authors": "Nguyen Ha Thanh, Ken Satoh", "id": "2410.07551v1", "paper_url": "http://arxiv.org/abs/2410.07551v1", "repo": "null"}}