{"2502.02341": {"publish_time": "2025-02-04", "title": "Test Time Training for 4D Medical Image Interpolation", "paper_summary": "4D medical image interpolation is essential for improving temporal resolution\nand diagnostic precision in clinical applications. Previous works ignore the\nproblem of distribution shifts, resulting in poor generalization under\ndifferent distribution. A natural solution would be to adapt the model to a new\ntest distribution, but this cannot be done if the test input comes without a\nground truth label. In this paper, we propose a novel test time training\nframework which uses self-supervision to adapt the model to a new distribution\nwithout requiring any labels. Indeed, before performing frame interpolation on\neach test video, the model is trained on the same instance using a\nself-supervised task, such as rotation prediction or image reconstruction. We\nconduct experiments on two publicly available 4D medical image interpolation\ndatasets, Cardiac and 4D-Lung. The experimental results show that the proposed\nmethod achieves significant performance across various evaluation metrics on\nboth datasets. It achieves higher peak signal-to-noise ratio values, 33.73dB on\nCardiac and 34.02dB on 4D-Lung. Our method not only advances 4D medical image\ninterpolation but also provides a template for domain adaptation in other\nfields such as image segmentation and image registration.", "paper_summary_zh": "4D 醫學影像插值對於提升時間解析度及臨床應用中的診斷精準度至關重要。過往的研究忽略了分佈轉移問題，導致在不同分佈下泛化能力不佳。一個自然的解決方案是將模型適應到新的測試分佈，但如果測試輸入沒有真實標籤，就無法做到這一點。在本文中，我們提出了一個新的測試時間訓練架構，它使用自我監督來適應模型到一個新的分佈，而不需要任何標籤。事實上，在對每個測試影片執行幀插值之前，使用自我監督任務（例如旋轉預測或影像重建）在同一個實例上訓練模型。我們在兩個公開的 4D 醫學影像插值資料集（Cardiac 和 4D-Lung）上進行實驗。實驗結果表明，所提出的方法在兩個資料集上的各種評估指標中都取得了顯著的效能。它達到了更高的峰值信噪比值，在 Cardiac 上為 33.73dB，在 4D-Lung 上為 34.02dB。我們的技術不僅推動了 4D 醫學影像插值，還為其他領域（例如影像分割和影像配準）中的領域適應提供了一個範本。", "author": "Qikang Zhang et.al.", "authors": "Qikang Zhang, Yingjie Lei, Zihao Zheng, Ziyang Chen, Zhonghao Xie", "id": "2502.02341v1", "paper_url": "http://arxiv.org/abs/2502.02341v1", "repo": "null"}}