{"2410.03499": {"publish_time": "2024-10-04", "title": "FedStein: Enhancing Multi-Domain Federated Learning Through James-Stein Estimator", "paper_summary": "Federated Learning (FL) facilitates data privacy by enabling collaborative\nin-situ training across decentralized clients. Despite its inherent advantages,\nFL faces significant challenges of performance and convergence when dealing\nwith data that is not independently and identically distributed (non-i.i.d.).\nWhile previous research has primarily addressed the issue of skewed label\ndistribution across clients, this study focuses on the less explored challenge\nof multi-domain FL, where client data originates from distinct domains with\nvarying feature distributions. We introduce a novel method designed to address\nthese challenges FedStein: Enhancing Multi-Domain Federated Learning Through\nthe James-Stein Estimator. FedStein uniquely shares only the James-Stein (JS)\nestimates of batch normalization (BN) statistics across clients, while\nmaintaining local BN parameters. The non-BN layer parameters are exchanged via\nstandard FL techniques. Extensive experiments conducted across three datasets\nand multiple models demonstrate that FedStein surpasses existing methods such\nas FedAvg and FedBN, with accuracy improvements exceeding 14% in certain\ndomains leading to enhanced domain generalization. The code is available at\nhttps://github.com/sunnyinAI/FedStein", "paper_summary_zh": "联邦学习 (FL) 透过在分散式客户端中启用协作原位训练，促进数据隐私。尽管有其固有优势，FL 在处理非独立同分布 (non-i.i.d.) 数据时，面临着性能和收敛方面的重大挑战。虽然先前的研究主要解决了客户端间标签分布偏差的问题，但本研究专注于探索较少的挑战，即多领域 FL，其中客户端数据源自具有不同特征分布的不同领域。我们引入了一种新方法，旨在解决这些挑战 FedStein：通过 James-Stein 估计器增强多领域联邦学习。FedStein 独特地仅在客户端间共享批次规范化 (BN) 统计的 James-Stein (JS) 估计，同时维护本地 BN 参数。非 BN 层参数通过标准 FL 技术交换。在三个数据集和多个模型上进行的广泛实验表明，FedStein 超越了现有的方法，例如 FedAvg 和 FedBN，在某些领域的准确性提高超过 14%，从而增强了领域泛化。代码可在 https://github.com/sunnyinAI/FedStein 获得", "author": "Sunny Gupta et.al.", "authors": "Sunny Gupta, Nikita Jangid, Amit Sethi", "id": "2410.03499v1", "paper_url": "http://arxiv.org/abs/2410.03499v1", "repo": "https://github.com/sunnyinAI/FedStein"}}