{"2411.16824": {"publish_time": "2024-11-25", "title": "Beyond Sight: Towards Cognitive Alignment in LVLM via Enriched Visual Knowledge", "paper_summary": "Does seeing always mean knowing? Large Vision-Language Models (LVLMs)\nintegrate separately pre-trained vision and language components, often using\nCLIP-ViT as vision backbone. However, these models frequently encounter a core\nissue of \"cognitive misalignment\" between the vision encoder (VE) and the large\nlanguage model (LLM). Specifically, the VE's representation of visual\ninformation may not fully align with LLM's cognitive framework, leading to a\nmismatch where visual features exceed the language model's interpretive range.\nTo address this, we investigate how variations in VE representations influence\nLVLM comprehension, especially when the LLM faces VE-Unknown data-images whose\nambiguous visual representations challenge the VE's interpretive precision.\nAccordingly, we construct a multi-granularity landmark dataset and\nsystematically examine the impact of VE-Known and VE-Unknown data on\ninterpretive abilities. Our results show that VE-Unknown data limits LVLM's\ncapacity for accurate understanding, while VE-Known data, rich in distinctive\nfeatures, helps reduce cognitive misalignment. Building on these insights, we\npropose Entity-Enhanced Cognitive Alignment (EECA), a method that employs\nmulti-granularity supervision to generate visually enriched, well-aligned\ntokens that not only integrate within the LLM's embedding space but also align\nwith the LLM's cognitive framework. This alignment markedly enhances LVLM\nperformance in landmark recognition. Our findings underscore the challenges\nposed by VE-Unknown data and highlight the essential role of cognitive\nalignment in advancing multimodal systems.", "paper_summary_zh": "<paragraph>看到就一定知道嗎？大型視覺語言模型 (LVLMs)\n整合了單獨預先訓練好的視覺和語言組件，通常使用\nCLIP-ViT 作為視覺主幹。然而，這些模型經常遇到一個核心\n問題，即視覺編碼器 (VE) 和大型語言模型 (LLM) 之間的「認知失調」。具體來說，VE 對視覺\n資訊的表示可能無法完全與 LLM 的認知架構對齊，導致視覺特徵超出語言模型的詮釋範圍，從而產生失配。\n為了解決這個問題，我們探討 VE 表示的變化如何影響\nLVLM 的理解，特別是在 LLM 面對 VE-Unknown 數據時，其模稜兩可的視覺表示挑戰了 VE 的詮釋精確度。\n因此，我們構建了一個多粒度的標誌性數據集，並\n系統地檢驗 VE-Known 和 VE-Unknown 數據對詮釋能力的影響。我們的結果表明，VE-Unknown 數據限制了 LVLM 準確理解的能力，而 VE-Known 數據富含獨特特徵，有助於減少認知失調。基於這些見解，我們\n提出了實體增強認知對齊 (EECA)，這是一種使用多粒度監督來生成視覺豐富、對齊良好的\n標記的方法，這些標記不僅整合在 LLM 的嵌入空間中，而且還與 LLM 的認知架構對齊。這種對齊顯著增強了 LVLM\n在標誌性識別中的性能。我們的發現強調了 VE-Unknown 數據帶來的挑戰，並突出了認知\n對齊在推進多模態系統中發揮的重要作用。</paragraph>", "author": "Yaqi Zhao et.al.", "authors": "Yaqi Zhao, Yuanyang Yin, Lin Li, Mingan Lin, Victor Shea-Jay Huang, Siwei Chen, Weipeng Chen, Baoqun Yin, Zenan Zhou, Wentao Zhang", "id": "2411.16824v1", "paper_url": "http://arxiv.org/abs/2411.16824v1", "repo": "null"}}