{"2410.03420": {"publish_time": "2024-10-04", "title": "Towards Real-time Intrahepatic Vessel Identification in Intraoperative Ultrasound-Guided Liver Surgery", "paper_summary": "While laparoscopic liver resection is less prone to complications and\nmaintains patient outcomes compared to traditional open surgery, its complexity\nhinders widespread adoption due to challenges in representing the liver's\ninternal structure. Laparoscopic intraoperative ultrasound offers efficient,\ncost-effective and radiation-free guidance. Our objective is to aid physicians\nin identifying internal liver structures using laparoscopic intraoperative\nultrasound. We propose a patient-specific approach using preoperative 3D\nultrasound liver volume to train a deep learning model for real-time\nidentification of portal tree and branch structures. Our personalized AI model,\nvalidated on ex vivo swine livers, achieved superior precision (0.95) and\nrecall (0.93) compared to surgeons, laying groundwork for precise vessel\nidentification in ultrasound-based liver resection. Its adaptability and\npotential clinical impact promise to advance surgical interventions and improve\npatient care.", "paper_summary_zh": "腹腔鏡肝切除術與傳統的開放手術相比，較不容易產生併發症，且能維持患者的治療成效，但由於其複雜性，在呈現肝臟內部結構時會遭遇挑戰，因此阻礙了它的廣泛採用。腹腔鏡術中超音波提供了有效率、經濟且無輻射的引導。我們的目標是協助醫師使用腹腔鏡術中超音波來辨識肝臟內部結構。我們提出一個使用術前 3D 超音波肝臟體積來訓練深度學習模型的患者專屬方法，以利於即時辨識門靜脈樹和分支結構。我們的個人化 AI 模型已在離體豬肝臟上驗證，與外科醫師相比，達到了更高的精確度 (0.95) 和召回率 (0.93)，這為基於超音波的肝切除術中精確的血管辨識奠定了基礎。它的適應性和潛在的臨床影響有望推進外科手術，並改善患者照護。", "author": "Karl-Philippe Beaudet et.al.", "authors": "Karl-Philippe Beaudet, Alexandros Karargyris, Sidaty El Hadramy, Stéphane Cotin, Jean-Paul Mazellier, Nicolas Padoy, Juan Verde", "id": "2410.03420v1", "paper_url": "http://arxiv.org/abs/2410.03420v1", "repo": "null"}}