{"2501.04138": {"publish_time": "2025-01-07", "title": "\"Yeah Right!\" -- Do LLMs Exhibit Multimodal Feature Transfer?", "paper_summary": "Human communication is a multifaceted and multimodal skill. Communication\nrequires an understanding of both the surface-level textual content and the\nconnotative intent of a piece of communication. In humans, learning to go\nbeyond the surface level starts by learning communicative intent in speech.\nOnce humans acquire these skills in spoken communication, they transfer those\nskills to written communication. In this paper, we assess the ability of\nspeech+text models and text models trained with special emphasis on\nhuman-to-human conversations to make this multimodal transfer of skill. We\nspecifically test these models on their ability to detect covert deceptive\ncommunication. We find that with no special prompting speech+text LLMs have an\nadvantage over unimodal LLMs in performing this task. Likewise, we find that\nhuman-to-human conversation-trained LLMs are also advantaged in this skill.", "paper_summary_zh": "人類的溝通是一種多面向且多模態的技能。溝通\n需要理解溝通內容的表面文字內容和內涵意圖。在人類中，學習超越表層的起點是學習言語中的溝通意圖。\n一旦人類在口語溝通中習得這些技能，他們就會將這些\n技能轉移到書面溝通中。在本文中，我們評估了\n語音+文字模型和文字模型在特別強調人對人對話的情況下訓練的能力，以進行這種多模態技能轉移。我們\n特別測試了這些模型檢測隱蔽欺騙性溝通的能力。我們發現，在沒有特別提示的情況下，語音+文字 LLM 在執行此任務時優於單模態 LLM。同樣，我們發現，接受人對人對話訓練的 LLM 在這項技能上也具有優勢。", "author": "Benjamin Reichman et.al.", "authors": "Benjamin Reichman, Kartik Talamadupula", "id": "2501.04138v1", "paper_url": "http://arxiv.org/abs/2501.04138v1", "repo": "null"}}