{"2409.08872": {"publish_time": "2024-09-13", "title": "Exploring the Impact of Data Quantity on ASR in Extremely Low-resource Languages", "paper_summary": "This study investigates the efficacy of data augmentation techniques for\nlow-resource automatic speech recognition (ASR), focusing on two endangered\nAustronesian languages, Amis and Seediq. Recognizing the potential of\nself-supervised learning (SSL) in low-resource settings, we explore the impact\nof data volume on the continued pre-training of SSL models. We propose a novel\ndata-selection scheme leveraging a multilingual corpus to augment the limited\ntarget language data. This scheme utilizes a language classifier to extract\nutterance embeddings and employs one-class classifiers to identify utterances\nphonetically and phonologically proximate to the target languages. Utterances\nare ranked and selected based on their decision scores, ensuring the inclusion\nof highly relevant data in the SSL-ASR pipeline. Our experimental results\ndemonstrate the effectiveness of this approach, yielding substantial\nimprovements in ASR performance for both Amis and Seediq. These findings\nunderscore the feasibility and promise of data augmentation through\ncross-lingual transfer learning for low-resource language ASR.", "paper_summary_zh": "本研究探討資料擴充技術在低資源自動語音辨識 (ASR) 的效能，重點放在兩種瀕危南島語言，阿美語和賽德克語。了解自監督學習 (SSL) 在低資源環境中的潛力，我們探討資料量對 SSL 模型持續預訓練的影響。我們提出一個新穎的資料選取方案，利用多語言語料庫來擴充有限的目標語言資料。此方案利用語言分類器來萃取語句嵌入，並使用單類分類器來識別語音在語音和音位上接近目標語言的語句。語句根據其決策分數進行排序和選取，確保在 SSL-ASR 管線中包含高度相關的資料。我們的實驗結果證明了此方法的有效性，對阿美語和賽德克語的 ASR 效能產生顯著的改善。這些發現強調了透過跨語言遷移學習進行資料擴充對低資源語言 ASR 的可行性和前景。", "author": "Yao-Fei Cheng et.al.", "authors": "Yao-Fei Cheng, Li-Wei Chen, Hung-Shin Lee, Hsin-Min Wang", "id": "2409.08872v1", "paper_url": "http://arxiv.org/abs/2409.08872v1", "repo": "null"}}