{"2406.17810": {"publish_time": "2024-06-24", "title": "PIC2O-Sim: A Physics-Inspired Causality-Aware Dynamic Convolutional Neural Operator for Ultra-Fast Photonic Device FDTD Simulation", "paper_summary": "The finite-difference time-domain (FDTD) method, which is important in\nphotonic hardware design flow, is widely adopted to solve time-domain Maxwell\nequations. However, FDTD is known for its prohibitive runtime cost, taking\nminutes to hours to simulate a single device. Recently, AI has been applied to\nrealize orders-of-magnitude speedup in partial differential equation (PDE)\nsolving. However, AI-based FDTD solvers for photonic devices have not been\nclearly formulated. Directly applying off-the-shelf models to predict the\noptical field dynamics shows unsatisfying fidelity and efficiency since the\nmodel primitives are agnostic to the unique physical properties of Maxwell\nequations and lack algorithmic customization. In this work, we thoroughly\ninvestigate the synergy between neural operator designs and the physical\nproperty of Maxwell equations and introduce a physics-inspired AI-based FDTD\nprediction framework PIC2O-Sim which features a causality-aware dynamic\nconvolutional neural operator as its backbone model that honors the space-time\ncausality constraints via careful receptive field configuration and explicitly\ncaptures the permittivity-dependent light propagation behavior via an efficient\ndynamic convolution operator. Meanwhile, we explore the trade-offs among\nprediction scalability, fidelity, and efficiency via a multi-stage partitioned\ntime-bundling technique in autoregressive prediction. Multiple key techniques\nhave been introduced to mitigate iterative error accumulation while maintaining\nefficiency advantages during autoregressive field prediction. Extensive\nevaluations on three challenging photonic device simulation tasks have shown\nthe superiority of our PIC2O-Sim method, showing 51.2% lower roll-out\nprediction error, 23.5 times fewer parameters than state-of-the-art neural\noperators, providing 300-600x higher simulation speed than an open-source FDTD\nnumerical solver.", "paper_summary_zh": "時域有限差分法 (FDTD) は、光ハードウェア設計フローにおいて重要な手法で、時領域マクスウェル方程式を解くために広く採用されています。ただし、FDTD はその膨大なランタイムコストで知られており、1 つのデバイスをシミュレートするのに数分から数時間かかります。最近、AI が偏微分方程式 (PDE) の解法における桁違いの高速化を実現するために適用されています。しかし、光デバイス向けの AI ベースの FDTD ソルバーは明確に定式化されていません。市販のモデルをそのまま適用して光場のダイナミクスを予測すると、モデルの基本要素がマクスウェル方程式の固有の物理特性に無関係でアルゴリズムのカスタマイズが欠如しているため、忠実度と効率が不十分になります。この研究では、ニューラル演算子の設計とマクスウェル方程式の物理特性との相乗効果を徹底的に調査し、物理学に基づく AI ベースの FDTD 予測フレームワーク PIC2O-Sim を導入します。PIC2O-Sim は、慎重な受容野構成によって時空間因果律制約を尊重し、効率的な動的畳み込み演算子によって誘電率依存の光伝搬挙動を明示的に捉える、因果律を認識する動的畳み込みニューラル演算子をバックボーンモデルとして備えています。その一方で、自己回帰予測におけるマルチステージパーティション時間バンドリング手法によって、予測のスケーラビリティ、忠実度、効率の間のトレードオフを調査します。自己回帰場の予測中に効率の利点を維持しながら反復的な誤りの蓄積を軽減するために、複数の主要な手法が導入されました。3 つの困難な光デバイスシミュレーションタスクに関する広範な評価により、PIC2O-Sim 手法の優位性が示され、51.2% 低いロールアウト予測誤差、最先端のニューラル演算子よりも 23.5 倍少ないパラメーター、オープンソース FDTD 数値ソルバーよりも 300 ～ 600 倍高速なシミュレーション速度が提供されています。", "author": "Pingchuan Ma et.al.", "authors": "Pingchuan Ma, Haoyu Yang, Zhengqi Gao, Duane S. Boning, Jiaqi Gu", "id": "2406.17810v1", "paper_url": "http://arxiv.org/abs/2406.17810v1", "repo": "null"}}