{"2409.11744": {"publish_time": "2024-09-18", "title": "Exploring Gaze Pattern in Autistic Children: Clustering, Visualization, and Prediction", "paper_summary": "Autism Spectrum Disorder (ASD) significantly affects the social and\ncommunication abilities of children, and eye-tracking is commonly used as a\ndiagnostic tool by identifying associated atypical gaze patterns. Traditional\nmethods demand manual identification of Areas of Interest in gaze patterns,\nlowering the performance of gaze behavior analysis in ASD subjects. To tackle\nthis limitation, we propose a novel method to automatically analyze gaze\nbehaviors in ASD children with superior accuracy. To be specific, we first\napply and optimize seven clustering algorithms to automatically group gaze\npoints to compare ASD subjects with typically developing peers. Subsequently,\nwe extract 63 significant features to fully describe the patterns. These\nfeatures can describe correlations between ASD diagnosis and gaze patterns.\nLastly, using these features as prior knowledge, we train multiple predictive\nmachine learning models to predict and diagnose ASD based on their gaze\nbehaviors. To evaluate our method, we apply our method to three ASD datasets.\nThe experimental and visualization results demonstrate the improvements of\nclustering algorithms in the analysis of unique gaze patterns in ASD children.\nAdditionally, these predictive machine learning models achieved\nstate-of-the-art prediction performance ($81\\%$ AUC) in the field of\nautomatically constructed gaze point features for ASD diagnosis. Our code is\navailable at \\url{https://github.com/username/projectname}.", "paper_summary_zh": "自閉症譜系障礙 (ASD) 會顯著影響兒童的社交和溝通能力，而眼球追蹤通常用於透過識別相關的非典型注視模式作為診斷工具。傳統方法需要手動識別注視模式中的關注區域，降低 ASD 受試者的注視行為分析效能。為了克服這個限制，我們提出了一種新穎的方法，可以自動分析 ASD 兒童的注視行為，並具有更高的準確度。具體來說，我們首先應用和最佳化七種聚類演算法，以自動將注視點分組，以將 ASD 受試者與正常發展的同儕進行比較。隨後，我們提取 63 個顯著特徵來充分描述模式。這些特徵可以描述 ASD 診斷和注視模式之間的關聯性。最後，使用這些特徵作為先驗知識，我們訓練多個預測機器學習模型，以根據他們的注視行為預測和診斷 ASD。為了評估我們的模型，我們將我們的模型應用於三個 ASD 資料集。實驗和視覺化結果證明了聚類演算法在分析 ASD 兒童獨特注視模式方面的改進。此外，這些預測機器學習模型在 ASD 診斷的自動建構注視點特徵領域中達到了最先進的預測效能 (81% AUC)。我們的程式碼可在 \\url{https://github.com/username/projectname} 取得。", "author": "Weiyan Shi et.al.", "authors": "Weiyan Shi, Haihong Zhang, Jin Yang, Ruiqing Ding, YongWei Zhu, Kenny Tsu Wei Choo", "id": "2409.11744v1", "paper_url": "http://arxiv.org/abs/2409.11744v1", "repo": "null"}}