{"2407.09475": {"publish_time": "2024-07-12", "title": "Adaptive Prediction Ensemble: Improving Out-of-Distribution Generalization of Motion Forecasting", "paper_summary": "Deep learning-based trajectory prediction models for autonomous driving often\nstruggle with generalization to out-of-distribution (OOD) scenarios, sometimes\nperforming worse than simple rule-based models. To address this limitation, we\npropose a novel framework, Adaptive Prediction Ensemble (APE), which integrates\ndeep learning and rule-based prediction experts. A learned routing function,\ntrained concurrently with the deep learning model, dynamically selects the most\nreliable prediction based on the input scenario. Our experiments on large-scale\ndatasets, including Waymo Open Motion Dataset (WOMD) and Argoverse, demonstrate\nimprovement in zero-shot generalization across datasets. We show that our\nmethod outperforms individual prediction models and other variants,\nparticularly in long-horizon prediction and scenarios with a high proportion of\nOOD data. This work highlights the potential of hybrid approaches for robust\nand generalizable motion prediction in autonomous driving.", "paper_summary_zh": "基於深度學習的自動駕駛軌跡預測模型通常難以概化到分佈外 (OOD) 場景，有時表現比基於簡單規則的模型還差。為了解決這個限制，我們提出了一個新的架構，自適應預測組合 (APE)，它整合了深度學習和基於規則的預測專家。一個與深度學習模型同時訓練的學習路由函數，根據輸入場景動態選擇最可靠的預測。我們在大型資料集上的實驗，包括 Waymo Open Motion Dataset (WOMD) 和 Argoverse，展示了跨資料集的零次學習概化改進。我們表明，我們的模型優於個別預測模型和其他變體，特別是在長時域預測和 OOD 資料比例高的場景中。這項工作突顯了混合方法在自動駕駛中用於穩健且可概化的運動預測的潛力。", "author": "Jinning Li et.al.", "authors": "Jinning Li, Jiachen Li, Sangjae Bae, David Isele", "id": "2407.09475v1", "paper_url": "http://arxiv.org/abs/2407.09475v1", "repo": "null"}}