{"2406.14868": {"publish_time": "2024-06-21", "title": "Direct Multi-Turn Preference Optimization for Language Agents", "paper_summary": "Adapting Large Language Models (LLMs) for agent tasks is critical in\ndeveloping language agents. Direct Preference Optimization (DPO) is a promising\ntechnique for this adaptation with the alleviation of compounding errors,\noffering a means to directly optimize Reinforcement Learning (RL) objectives.\nHowever, applying DPO to multi-turn tasks presents challenges due to the\ninability to cancel the partition function. Overcoming this obstacle involves\nmaking the partition function independent of the current state and addressing\nlength disparities between preferred and dis-preferred trajectories. In this\nlight, we replace the policy constraint with the state-action occupancy measure\nconstraint in the RL objective and add length normalization to the\nBradley-Terry model, yielding a novel loss function named DMPO for multi-turn\nagent tasks with theoretical explanations. Extensive experiments on three\nmulti-turn agent task datasets confirm the effectiveness and superiority of the\nDMPO loss.", "paper_summary_zh": "調整大型語言模型 (LLM) 以適應代理人任務，對於開發語言代理人至關重要。直接偏好最佳化 (DPO) 是一種有前途的技術，可透過緩解複合錯誤來進行此調整，提供直接最佳化強化學習 (RL) 目標的方法。然而，由於無法取消分割函數，將 DPO 應用於多輪任務會產生挑戰。克服此障礙涉及讓分割函數獨立於當前狀態，並解決首選和非首選軌跡之間的長度差異。有鑑於此，我們在 RL 目標中用狀態動作佔用測量約束取代政策約束，並將長度正規化加入 Bradley-Terry 模型，產生一個名為 DMPO 的新損失函數，用於多輪代理人任務，並附有理論說明。在三個多輪代理人任務資料集上的廣泛實驗證實了 DMPO 損失的有效性和優越性。", "author": "Wentao Shi et.al.", "authors": "Wentao Shi, Mengqi Yuan, Junkang Wu, Qifan Wang, Fuli Feng", "id": "2406.14868v1", "paper_url": "http://arxiv.org/abs/2406.14868v1", "repo": "null"}}