{"2409.09013": {"publish_time": "2024-09-13", "title": "AI-LieDar: Examine the Trade-off Between Utility and Truthfulness in LLM Agents", "paper_summary": "To be safely and successfully deployed, LLMs must simultaneously satisfy\ntruthfulness and utility goals. Yet, often these two goals compete (e.g., an AI\nagent assisting a used car salesman selling a car with flaws), partly due to\nambiguous or misleading user instructions. We propose AI-LieDar, a framework to\nstudy how LLM-based agents navigate scenarios with utility-truthfulness\nconflicts in a multi-turn interactive setting. We design a set of realistic\nscenarios where language agents are instructed to achieve goals that are in\nconflict with being truthful during a multi-turn conversation with simulated\nhuman agents. To evaluate the truthfulness at large scale, we develop a\ntruthfulness detector inspired by psychological literature to assess the\nagents' responses. Our experiment demonstrates that all models are truthful\nless than 50% of the time, although truthfulness and goal achievement (utility)\nrates vary across models. We further test the steerability of LLMs towards\ntruthfulness, finding that models follow malicious instructions to deceive, and\neven truth-steered models can still lie. These findings reveal the complex\nnature of truthfulness in LLMs and underscore the importance of further\nresearch to ensure the safe and reliable deployment of LLMs and AI agents.", "paper_summary_zh": "為了安全且成功地部署 LLM，必須同時滿足真實性和實用性目標。然而，這兩個目標通常會相互競爭（例如，AI 代理協助二手車銷售員銷售有缺陷的汽車），部分原因是使用者說明模稜兩可或具有誤導性。我們提出 AI-LieDar，一個架構用於研究基於 LLM 的代理如何應對多輪互動設定中實用性真實性衝突的場景。我們設計了一組逼真的場景，其中語言代理被指示在與模擬人類代理的多輪對話中實現與真實性相衝突的目標。為了大規模評估真實性，我們開發了一個受心理學文獻啟發的真實性偵測器，用於評估代理的反應。我們的實驗表明，所有模型的真實性低於 50%，儘管真實性和目標達成（實用性）率因模型而異。我們進一步測試了 LLM 對真實性的可控性，發現模型遵循惡意指令進行欺騙，即使是真實性導向的模型仍然可能說謊。這些發現揭示了 LLM 中真實性的複雜本質，並強調了進一步研究以確保 LLM 和 AI 代理安全可靠部署的重要性。", "author": "Zhe Su et.al.", "authors": "Zhe Su, Xuhui Zhou, Sanketh Rangreji, Anubha Kabra, Julia Mendelsohn, Faeze Brahman, Maarten Sap", "id": "2409.09013v1", "paper_url": "http://arxiv.org/abs/2409.09013v1", "repo": "null"}}