{"2411.16561": {"publish_time": "2024-11-25", "title": "EnStack: An Ensemble Stacking Framework of Large Language Models for Enhanced Vulnerability Detection in Source Code", "paper_summary": "Automated detection of software vulnerabilities is critical for enhancing\nsecurity, yet existing methods often struggle with the complexity and diversity\nof modern codebases. In this paper, we introduce EnStack, a novel ensemble\nstacking framework that enhances vulnerability detection using natural language\nprocessing (NLP) techniques. Our approach synergizes multiple pre-trained large\nlanguage models (LLMs) specialized in code understanding CodeBERT for semantic\nanalysis, GraphCodeBERT for structural representation, and UniXcoder for\ncross-modal capabilities. By fine-tuning these models on the Draper VDISC\ndataset and integrating their outputs through meta-classifiers such as Logistic\nRegression, Support Vector Machines (SVM), Random Forest, and XGBoost, EnStack\neffectively captures intricate code patterns and vulnerabilities that\nindividual models may overlook. The meta-classifiers consolidate the strengths\nof each LLM, resulting in a comprehensive model that excels in detecting subtle\nand complex vulnerabilities across diverse programming contexts. Experimental\nresults demonstrate that EnStack significantly outperforms existing methods,\nachieving notable improvements in accuracy, precision, recall, and F1-score.\nThis work highlights the potential of ensemble LLM approaches in code analysis\ntasks and offers valuable insights into applying NLP techniques for advancing\nautomated vulnerability detection.", "paper_summary_zh": "自動化偵測軟體漏洞對於提升安全性至關重要，但現有方法經常難以應對現代程式碼庫的複雜性和多樣性。在本文中，我們介紹 EnStack，一個新穎的整體堆疊框架，它使用自然語言處理 (NLP) 技術來增強漏洞偵測。我們的做法將多個預先訓練的大型語言模型 (LLM) 協同起來，這些模型專門用於理解程式碼：CodeBERT 用於語意分析、GraphCodeBERT 用於結構表示，而 UniXcoder 則用於跨模態能力。透過微調這些模型在 Draper VDISC 資料集上，並透過後設分類器（例如邏輯迴歸、支援向量機 (SVM)、隨機森林和 XGBoost）整合其輸出，EnStack 有效地擷取了個別模型可能忽略的複雜程式碼模式和漏洞。後設分類器整合了每個 LLM 的優點，產生了一個綜合模型，擅長偵測跨不同程式設計背景的細微而複雜的漏洞。實驗結果證明，EnStack 明顯優於現有方法，在準確度、精確度、召回率和 F1 分數方面都有顯著的提升。這項工作突顯了整體 LLM 方法在程式碼分析任務中的潛力，並提供了寶貴的見解，說明如何應用 NLP 技術來推進自動化漏洞偵測。", "author": "Shahriyar Zaman Ridoy et.al.", "authors": "Shahriyar Zaman Ridoy, Md. Shazzad Hossain Shaon, Alfredo Cuzzocrea, Mst Shapna Akter", "id": "2411.16561v1", "paper_url": "http://arxiv.org/abs/2411.16561v1", "repo": "null"}}