{"2405.20947": {"publish_time": "2024-05-31", "title": "OR-Bench: An Over-Refusal Benchmark for Large Language Models", "paper_summary": "Large Language Models (LLMs) require careful safety alignment to prevent\nmalicious outputs. While significant research focuses on mitigating harmful\ncontent generation, the enhanced safety often come with the side effect of\nover-refusal, where the LLMs may reject innocuous prompts and become less\nhelpful. Although the issue of over-refusal has been empirically observed, a\nsystematic measurement is challenging due to the difficulty of crafting prompts\nthat appear harmful but are benign. This study proposes a novel method for\nautomatically generating large-scale sets of ``seemingly toxic prompts''\n(benign prompts likely rejected by LLMs). Leveraging this technique, we\nintroduce OR-Bench, the first large-scale over-refusal benchmark. OR-Bench\ncomprises 80,000 seemingly toxic prompts across 10 common rejection categories,\na subset of around 1,000 hard prompts that are challenging even for\nstate-of-the-art LLMs, and an additional 600 toxic prompts to prevent\nindiscriminate responses. We then conduct a comprehensive study to measure the\nover-refusal of 25 popular LLMs across 8 model families. Our datasets are\navailable at https://huggingface.co/datasets/bench-llm/OR-Bench and the\ncorresponding demo can be found at\nhttps://huggingface.co/spaces/bench-llm/or-bench. We hope this benchmark can\nhelp the community develop better safety aligned models.", "paper_summary_zh": "大型語言模型 (LLM) 需要謹慎的安全調整，以防止惡意輸出。雖然重要的研究專注於減輕有害內容的產生，但增強的安全通常會產生過度拒絕的副作用，LLM 可能拒絕無害的提示並變得不那麼有幫助。儘管已經經驗性地觀察到過度拒絕的問題，但由於難以撰寫看似有害但良性的提示，因此系統性的測量具有挑戰性。本研究提出了一種自動產生大量「看似有毒的提示」集合（可能被 LLM 拒絕的良性提示）的新方法。利用此技術，我們引入了 OR-Bench，這是第一個大規模的過度拒絕基準。OR-Bench 包含 10 個常見拒絕類別中的 80,000 個看似有毒的提示，一個由約 1,000 個即使對於最先進的 LLM 來說也很有挑戰性的困難提示子集，以及額外的 600 個有毒提示，以防止不加區別的回應。然後，我們進行了一項全面研究，以測量 8 個模型系列中的 25 個流行 LLM 的過度拒絕。我們的數據集可在 https://huggingface.co/datasets/bench-llm/OR-Bench 獲得，可以在 https://huggingface.co/spaces/bench-llm/or-bench 找到對應的示範。我們希望此基準可以幫助社群開發更好的安全調整模型。", "author": "Justin Cui et.al.", "authors": "Justin Cui, Wei-Lin Chiang, Ion Stoica, Cho-Jui Hsieh", "id": "2405.20947v1", "paper_url": "http://arxiv.org/abs/2405.20947v1", "repo": "null"}}