{"2409.17125": {"publish_time": "2024-09-25", "title": "On-orbit Servicing for Spacecraft Collision Avoidance With Autonomous Decision Making", "paper_summary": "This study develops an AI-based implementation of autonomous On-Orbit\nServicing (OOS) mission to assist with spacecraft collision avoidance maneuvers\n(CAMs). We propose an autonomous `servicer' trained with Reinforcement Learning\n(RL) to autonomously detect potential collisions between a target satellite and\nspace debris, rendezvous and dock with endangered satellites, and execute\noptimal CAM. The RL model integrates collision risk estimates, satellite\nspecifications, and debris data to generate an optimal maneuver matrix for OOS\nrendezvous and collision prevention. We employ the Cross-Entropy algorithm to\nfind optimal decision policies efficiently. Initial results demonstrate the\nfeasibility of autonomous robotic OOS for collision avoidance services,\nfocusing on one servicer spacecraft to one endangered satellite scenario.\nHowever, merging spacecraft rendezvous and optimal CAM presents significant\ncomplexities. We discuss design challenges and critical parameters for the\nsuccessful implementation of the framework presented through a case study.", "paper_summary_zh": "本研究開發了一種基於 AI 的自主軌道服務 (OOS) 任務實作，用於協助太空船的防撞操作 (CAM)。我們提出一個使用強化學習 (RL) 訓練的自主「服務器」，用於自主偵測目標衛星與太空碎片之間的潛在碰撞，與瀕危衛星會合並對接，並執行最佳化 CAM。RL 模型整合了碰撞風險估計、衛星規格和碎片資料，以產生一個最佳化操作矩陣，用於 OOS 會合和防撞。我們採用交叉熵演算法來有效找出最佳決策策略。初步結果證明了自主機器人 OOS 防撞服務的可行性，專注於一艘服務器太空船對一艘瀕危衛星的場景。然而，整合太空船會合和最佳化 CAM 會產生顯著的複雜性。我們透過一個案例研究討論了成功實作所提出的架構的設計挑戰和關鍵參數。", "author": "Susmitha Patnala et.al.", "authors": "Susmitha Patnala, Adam Abdin", "id": "2409.17125v1", "paper_url": "http://arxiv.org/abs/2409.17125v1", "repo": "null"}}