{"2407.11260": {"publish_time": "2024-07-15", "title": "Quality Scalable Quantization Methodology for Deep Learning on Edge", "paper_summary": "Deep Learning Architectures employ heavy computations and bulk of the\ncomputational energy is taken up by the convolution operations in the\nConvolutional Neural Networks. The objective of our proposed work is to reduce\nthe energy consumption and size of CNN for using machine learning techniques in\nedge computing on ubiquitous computing devices. We propose Systematic Quality\nScalable Design Methodology consisting of Quality Scalable Quantization on a\nhigher abstraction level and Quality Scalable Multipliers at lower abstraction\nlevel. The first component consists of parameter compression where we\napproximate representation of values in filters of deep learning models by\nencoding in 3 bits. A shift and scale based on-chip decoding hardware is\nproposed which can decode these 3-bit representations to recover approximate\nfilter values. The size of the DNN model is reduced this way and can be sent\nover a communication channel to be decoded on the edge computing devices. This\nway power is reduced by limiting data bits by approximation. In the second\ncomponent we propose a quality scalable multiplier which reduces the number of\npartial products by converting numbers in canonic sign digit representations\nand further approximating the number by reducing least significant bits. These\nquantized CNNs provide almost same ac-curacy as network with original weights\nwith little or no fine-tuning. The hardware for the adaptive multipliers\nutilize gate clocking for reducing energy consumption during multiplications.\nThe proposed methodology greatly reduces the memory and power requirements of\nDNN models making it a feasible approach to deploy Deep Learning on edge\ncomputing. The experiments done on LeNet and ConvNets show an increase upto 6%\nof zeros and memory savings upto 82.4919% while keeping the accuracy near the\nstate of the art.", "paper_summary_zh": "深度學習架構採用大量的運算，而大部分的運算能量都被卷積神經網路中的卷積運算所吸收。我們提出的工作目標是降低 CNN 的能耗和大小，以便在普適運算裝置上的邊緣運算中使用機器學習技術。我們提出系統化品質可擴充設計方法，其中包含較高抽象層級的品質可擴充量化和較低抽象層級的品質可擴充乘法器。第一個組件包含參數壓縮，其中我們透過 3 位元編碼來近似表示深度學習模型中濾波器的值。我們提出了一個基於位移和縮放的晶片解碼硬體，它可以解碼這些 3 位元表示以還原近似的濾波器值。DNN 模型的大小會以這種方式縮小，並且可以透過通訊管道傳送，以便在邊緣運算裝置上解碼。這種方式可透過近似來限制資料位元，進而降低功耗。在第二個組件中，我們提出了一個品質可擴充乘法器，它透過將數字轉換為正規符號位元表示，並進一步透過減少最低有效位元來近似數字，進而減少部分乘積的數量。這些量化的 CNN 提供幾乎與原始權重的網路相同的準確度，幾乎不需要微調。自適應乘法器的硬體利用閘極時脈來降低乘法運算中的能耗。所提出的方法大幅降低了 DNN 模型的記憶體和功耗需求，使其成為在邊緣運算中部署深度學習的可行方法。在 LeNet 和 ConvNets 上進行的實驗顯示，零的增加幅度高達 6%，記憶體節省幅度高達 82.4919%，同時將準確度維持在接近最先進的水平。", "author": "Salman Abdul Khaliq et.al.", "authors": "Salman Abdul Khaliq, Rehan Hafiz", "id": "2407.11260v1", "paper_url": "http://arxiv.org/abs/2407.11260v1", "repo": "null"}}