{"2412.12744": {"publish_time": "2024-12-17", "title": "Your Next State-of-the-Art Could Come from Another Domain: A Cross-Domain Analysis of Hierarchical Text Classification", "paper_summary": "Text classification with hierarchical labels is a prevalent and challenging\ntask in natural language processing. Examples include assigning ICD codes to\npatient records, tagging patents into IPC classes, assigning EUROVOC\ndescriptors to European legal texts, and more. Despite its widespread\napplications, a comprehensive understanding of state-of-the-art methods across\ndifferent domains has been lacking. In this paper, we provide the first\ncomprehensive cross-domain overview with empirical analysis of state-of-the-art\nmethods. We propose a unified framework that positions each method within a\ncommon structure to facilitate research. Our empirical analysis yields key\ninsights and guidelines, confirming the necessity of learning across different\nresearch areas to design effective methods. Notably, under our unified\nevaluation pipeline, we achieved new state-of-the-art results by applying\ntechniques beyond their original domains.", "paper_summary_zh": "階層標籤的文本分類是自然語言處理中普遍且具挑戰性的任務。範例包括將 ICD 代碼指定給病歷、將專利標記為 IPC 類別、將 EUROVOC 描述符指定給歐洲法律文本等等。儘管其應用廣泛，但對於跨不同領域的最新方法的全面理解卻付之闕如。在本文中，我們提供了第一個全面的跨領域概觀，並對最新方法進行了實證分析。我們提出了一個統一的架構，將每種方法置於一個共同的結構中，以利於研究。我們的實證分析產生了關鍵見解和指導方針，證實了在不同研究領域學習的必要性，以設計有效的方法。值得注意的是，在我們的統一評估管道下，我們通過應用超越其原始領域的技術，達到了新的最新結果。", "author": "Nan Li et.al.", "authors": "Nan Li, Bo Kang, Tijl De Bie", "id": "2412.12744v1", "paper_url": "http://arxiv.org/abs/2412.12744v1", "repo": "null"}}