{"2405.14422": {"publish_time": "2024-05-23", "title": "Unraveling overoptimism and publication bias in ML-driven science", "paper_summary": "Machine Learning (ML) is increasingly used across many disciplines with\nimpressive reported results across many domain areas. However, recent studies\nsuggest that the published performance of ML models are often overoptimistic\nand not reflective of true accuracy were these models to be deployed. Validity\nconcerns are underscored by findings of a concerning inverse relationship\nbetween sample size and reported accuracy in published ML models across several\ndomains. This is in contrast with the theory of learning curves in ML, where we\nexpect accuracy to improve or stay the same with increasing sample size. This\npaper investigates the factors contributing to overoptimistic accuracy reports\nin ML-based science, focusing on data leakage and publication bias. Our study\nintroduces a novel stochastic model for observed accuracy, integrating\nparametric learning curves and the above biases. We then construct an estimator\nbased on this model that corrects for these biases in observed data.\nTheoretical and empirical results demonstrate that this framework can estimate\nthe underlying learning curve that gives rise to the observed overoptimistic\nresults, thereby providing more realistic performance assessments of ML\nperformance from a collection of published results. We apply the model to\nvarious meta-analyses in the digital health literature, including\nneuroimaging-based and speech-based classifications of several neurological\nconditions. Our results indicate prevalent overoptimism across these fields and\nwe estimate the inherent limits of ML-based prediction in each domain.", "paper_summary_zh": "機器學習 (ML) 愈來愈廣泛地用於許多領域，在許多領域都報告了令人印象深刻的結果。然而，最近的研究表明，ML 模型已發表的效能往往過於樂觀，且無法反映這些模型部署後的真實準確度。有效性疑慮受到令人擔憂的發現的強調，即在幾個領域中，已發表的 ML 模型中的樣本大小與報告的準確度之間存在反比關係。這與 ML 中的學習曲線理論相反，在 ML 中，我們預期準確度會隨著樣本大小的增加而提升或保持不變。本文探討了導致 ML 基礎科學中過度樂觀的準確度報告的因素，重點在於資料外洩和發表偏誤。我們的研究引入了一個新穎的觀測準確度隨機模型，整合了參數學習曲線和上述偏誤。然後，我們根據此模型建構了一個估計器，以修正觀測資料中的這些偏誤。理論和經驗結果證明，此架構可以估計導致觀測過度樂觀結果的底層學習曲線，從而提供更實際的 ML 效能評估，這些評估來自一系列已發表的結果。我們將此模型應用於數位健康文獻中的各種後設分析，包括基於神經影像和基於語音的幾種神經狀況分類。我們的結果指出這些領域普遍存在過度樂觀，並且我們估計了每個領域中基於 ML 的預測的內在限制。", "author": "Pouria Saidi et.al.", "authors": "Pouria Saidi, Gautam Dasarathy, Visar Berisha", "id": "2405.14422v1", "paper_url": "http://arxiv.org/abs/2405.14422v1", "repo": "null"}}