{"2405.04814": {"publish_time": "2024-05-08", "title": "A Novel Technique for Query Plan Representation Based on Graph Neural Networks", "paper_summary": "Learning representations for query plans play a pivotal role in machine\nlearning-based query optimizers of database management systems. To this end,\nparticular model architectures are proposed in the literature to convert the\ntree-structured query plans into representations with formats learnable by\ndownstream machine learning models. However, existing research rarely compares\nand analyzes the query plan representation capabilities of these tree models\nand their direct impact on the performance of the overall optimizer. To address\nthis problem, we perform a comparative study to explore the effect of using\ndifferent state-of-the-art tree models on the optimizer's cost estimation and\nplan selection performance in relatively complex workloads. Additionally, we\nexplore the possibility of using graph neural networks (GNN) in the query plan\nrepresentation task. We propose a novel tree model combining directed GNN with\nGated Recurrent Units (GRU) and demonstrate experimentally that the new tree\nmodel provides significant improvements to cost estimation tasks and relatively\nexcellent plan selection performance compared to the state-of-the-art tree\nmodels.", "paper_summary_zh": "學習查詢計畫的表徵在資料庫管理系統的機器學習查詢最佳化器中扮演關鍵角色。為此，文獻中提出了特定的模型架構，將樹狀結構的查詢計畫轉換成下游機器學習模型可學習的格式表徵。然而，現有的研究很少比較和分析這些樹狀模型的查詢計畫表徵能力，以及它們對整體最佳化器效能的直接影響。為了解決這個問題，我們執行了一項比較研究，探討使用不同的最新樹狀模型對最佳化器的成本估計和計畫選擇效能的影響，特別是在相對複雜的工作負載中。此外，我們探討了在查詢計畫表徵任務中使用圖神經網路 (GNN) 的可能性。我們提出了一種結合有向 GNN 和門控遞迴單元 (GRU) 的新樹狀模型，並透過實驗證明，與現有的樹狀模型相比，新的樹狀模型在成本估計任務中提供了顯著的改進，並且在計畫選擇效能方面相對優異。", "author": "Baoming Chang et.al.", "authors": "Baoming Chang, Amin Kamali, Verena Kantere", "id": "2405.04814v1", "paper_url": "http://arxiv.org/abs/2405.04814v1", "repo": "null"}}