{"2501.19245": {"publish_time": "2025-01-31", "title": "SHARPIE: A Modular Framework for Reinforcement Learning and Human-AI Interaction Experiments", "paper_summary": "Reinforcement learning (RL) offers a general approach for modeling and\ntraining AI agents, including human-AI interaction scenarios. In this paper, we\npropose SHARPIE (Shared Human-AI Reinforcement Learning Platform for\nInteractive Experiments) to address the need for a generic framework to support\nexperiments with RL agents and humans. Its modular design consists of a\nversatile wrapper for RL environments and algorithm libraries, a\nparticipant-facing web interface, logging utilities, deployment on popular\ncloud and participant recruitment platforms. It empowers researchers to study a\nwide variety of research questions related to the interaction between humans\nand RL agents, including those related to interactive reward specification and\nlearning, learning from human feedback, action delegation, preference\nelicitation, user-modeling, and human-AI teaming. The platform is based on a\ngeneric interface for human-RL interactions that aims to standardize the field\nof study on RL in human contexts.", "paper_summary_zh": "強化學習 (RL) 提供一種通用方法，用於建模和訓練 AI 代理，包括人機互動場景。在本文中，我們提出 SHARPIE（共享人機強化學習平台，用於互動式實驗），以滿足支援 RL 代理和人類實驗的通用框架需求。其模組化設計包含一個通用包裝器，用於 RL 環境和演算法函式庫、一個與參與者互動的網路介面、記錄公用程式、部署在熱門雲端和參與者招募平台上。它讓研究人員能夠研究各種與人類和 RL 代理互動相關的研究問題，包括與互動式獎勵規格和學習、從人類回饋中學習、動作委派、偏好引導、使用者建模和人機團隊合作相關的問題。該平台基於人機 RL 互動的通用介面，旨在標準化人類環境中 RL 的研究領域。", "author": "Hüseyin Aydın et.al.", "authors": "Hüseyin Aydın, Kevin Godin-Dubois, Libio Goncalvez Braz, Floris den Hengst, Kim Baraka, Mustafa Mert Çelikok, Andreas Sauter, Shihan Wang, Frans A. Oliehoek", "id": "2501.19245v2", "paper_url": "http://arxiv.org/abs/2501.19245v2", "repo": "null"}}