{"2411.11266": {"publish_time": "2024-11-18", "title": "VersaTune: Fine-Tuning Multi-Ability LLMs Efficiently", "paper_summary": "Large Language Models (LLMs) exhibit remarkable capabilities in handling\nmultiple tasks across domains due to their emergent properties. These\ncapabilities are further augmented during the Supervised Fine-Tuning (SFT)\nphase. Despite their potential, existing work mainly focuses on domain-specific\nenhancements during fine-tuning, the challenge of which lies in catastrophic\nforgetting of knowledge across other domains. In this study, we introduce\nVersaTune, a novel data composition framework designed for enhancing LLMs'\noverall multi-ability performances during fine-tuning. We categorize knowledge\ninto distinct domains including law, medicine, finance, science, code. We begin\nwith detecting the distribution of domain-specific knowledge within the base\nmodel, followed by the composition of training data that aligns with the\nmodel's existing knowledge distribution. During the fine-tuning process,\nweights of different domains are dynamically adjusted based on their learnable\npotential and forgetting degree. Experimental results demonstrate that\nVersaTune achieves significant improvements in multi-domain performance, with a\n35.21% enhancement in comprehensive multi-domain tasks. Additionally, in\nscenarios where specific domain optimization is required, VersaTune reduces the\ndegradation of performance in other domains by 38.77%, without compromising the\ntarget domain's training efficacy.", "paper_summary_zh": "大型語言模型（LLM）由於其新興屬性，在處理跨領域的多項任務時表現出顯著的能力。這些能力在監督微調（SFT）階段進一步增強。儘管具有潛力，現有工作主要集中於微調期間特定領域的增強，其挑戰在於跨其他領域的知識災難性遺忘。在本研究中，我們引入了 VersaTune，這是一個新穎的數據組合框架，旨在增強 LLM 在微調期間的整體多能力表現。我們將知識分類為不同的領域，包括法律、醫學、金融、科學、程式碼。我們從檢測基礎模型中特定領域知識的分布開始，然後組合與模型現有知識分布一致的訓練資料。在微調過程中，不同領域的權重會根據其可學習的潛力與遺忘程度進行動態調整。實驗結果表明，VersaTune 在多領域效能方面取得了顯著的進步，在綜合多領域任務中提升了 35.21%。此外，在需要特定領域最佳化的場景中，VersaTune 將其他領域的效能下降降低了 38.77%，而不會影響目標領域的訓練效能。", "author": "Keer Lu et.al.", "authors": "Keer Lu, Keshi Zhao, Zheng Liang, Da Pan, Shusen Zhang, Xin Wu, Weipeng Chen, Zenan Zhou, Guosheng Dong, Bin Cui, Wentao Zhang", "id": "2411.11266v1", "paper_url": "http://arxiv.org/abs/2411.11266v1", "repo": "null"}}