{"2407.03236": {"publish_time": "2024-07-03", "title": "CATT: Character-based Arabic Tashkeel Transformer", "paper_summary": "Tashkeel, or Arabic Text Diacritization (ATD), greatly enhances the\ncomprehension of Arabic text by removing ambiguity and minimizing the risk of\nmisinterpretations caused by its absence. It plays a crucial role in improving\nArabic text processing, particularly in applications such as text-to-speech and\nmachine translation. This paper introduces a new approach to training ATD\nmodels. First, we finetuned two transformers, encoder-only and encoder-decoder,\nthat were initialized from a pretrained character-based BERT. Then, we applied\nthe Noisy-Student approach to boost the performance of the best model. We\nevaluated our models alongside 11 commercial and open-source models using two\nmanually labeled benchmark datasets: WikiNews and our CATT dataset. Our\nfindings show that our top model surpasses all evaluated models by relative\nDiacritic Error Rates (DERs) of 30.83\\% and 35.21\\% on WikiNews and CATT,\nrespectively, achieving state-of-the-art in ATD. In addition, we show that our\nmodel outperforms GPT-4-turbo on CATT dataset by a relative DER of 9.36\\%. We\nopen-source our CATT models and benchmark dataset for the research\ncommunity\\footnote{https://github.com/abjadai/catt}.", "paper_summary_zh": "<paragraph>塔什基爾，或阿拉伯語文本標音（ATD），透過消除歧義並將其遺漏造成的誤解風險降至最低，大幅提升了阿拉伯語文本的理解。它在改善阿拉伯語文本處理方面發揮了至關重要的作用，特別是在文字轉語音和機器翻譯等應用中。本文介紹了一種訓練 ATD 模型的新方法。首先，我們微調了兩個Transformer，僅編碼器和編碼器-解碼器，它們是由預先訓練好的基於字元的 BERT 初始化的。然後，我們應用 Noisy-Student 方法來提升最佳模型的性能。我們使用兩個手動標記基準數據集：WikiNews 和我們的 CATT 數據集，對我們的模型與 11 個商業和開源模型進行了評估。我們的研究結果表明，我們的頂級模型在 WikiNews 和 CATT 上分別以 30.83% 和 35.21% 的相對變音符號錯誤率 (DER) 超越了所有評估模型，在 ATD 中實現了最先進的技術。此外，我們展示了我們的模型在 CATT 數據集上以 9.36% 的相對 DER 超越了 GPT-4-turbo。我們為研究社群開源了我們的 CATT 模型和基準數據集\\footnote{https://github.com/abjadai/catt}。</paragraph>", "author": "Faris Alasmary et.al.", "authors": "Faris Alasmary, Orjuwan Zaafarani, Ahmad Ghannam", "id": "2407.03236v2", "paper_url": "http://arxiv.org/abs/2407.03236v2", "repo": "https://github.com/abjadai/catt"}}