{"2408.02948": {"publish_time": "2024-08-06", "title": "Are Female Carpenters like Blue Bananas? A Corpus Investigation of Occupation Gender Typicality", "paper_summary": "People tend to use language to mention surprising properties of events: for\nexample, when a banana is blue, we are more likely to mention color than when\nit is yellow. This fact is taken to suggest that yellowness is somehow a\ntypical feature of bananas, and blueness is exceptional. Similar to how a\nyellow color is typical of bananas, there may also be genders that are typical\nof occupations. In this work, we explore this question using information\ntheoretic techniques coupled with corpus statistic analysis. In two distinct\nlarge corpora, we do not find strong evidence that occupations and gender\ndisplay the same patterns of mentioning as do bananas and color. Instead, we\nfind that gender mentioning is correlated with femaleness of occupation in\nparticular, suggesting perhaps that woman-dominated occupations are seen as\nsomehow ``more gendered'' than male-dominated ones, and thereby they encourage\nmore gender mentioning overall.", "paper_summary_zh": "人們傾向於用語言提及事件的驚人屬性：例如，當香蕉是藍色的時候，我們更有可能提到顏色，而不是當它變黃的時候。這個事實表明，黃色在某種程度上是香蕉的典型特徵，而藍色則是非典型的。類似於黃色是香蕉的典型顏色，某些性別也可能是職業的典型特徵。在這項工作中，我們使用資訊理論技術結合語料庫統計分析來探討這個問題。在兩個不同的大型語料庫中，我們沒有發現強有力的證據表明職業和性別與香蕉和顏色顯示相同的提及模式。相反，我們發現性別提及與職業的女性化特別相關，這可能表明女性主導的職業在某種程度上被視為「更具性別」，從而整體上鼓勵更多地提及性別。", "author": "Da Ju et.al.", "authors": "Da Ju, Karen Ulrich, Adina Williams", "id": "2408.02948v1", "paper_url": "http://arxiv.org/abs/2408.02948v1", "repo": "null"}}