{"2410.15794": {"publish_time": "2024-10-21", "title": "Habaek: High-performance water segmentation through dataset expansion and inductive bias optimization", "paper_summary": "Water segmentation is critical to disaster response and water resource\nmanagement. Authorities may employ high-resolution photography to monitor\nrivers, lakes, and reservoirs, allowing for more proactive management in\nagriculture, industry, and conservation. Deep learning has improved flood\nmonitoring by allowing models like CNNs, U-Nets, and transformers to handle\nlarge volumes of satellite and aerial data. However, these models usually have\nsignificant processing requirements, limiting their usage in real-time\napplications. This research proposes upgrading the SegFormer model for water\nsegmentation by data augmentation with datasets such as ADE20K and RIWA to\nboost generalization. We examine how inductive bias affects attention-based\nmodels and discover that SegFormer performs better on bigger datasets. To\nfurther demonstrate the function of data augmentation, Low-Rank Adaptation\n(LoRA) is used to lower processing complexity while preserving accuracy. We\nshow that the suggested Habaek model outperforms current models in\nsegmentation, with an Intersection over Union (IoU) ranging from 0.91986 to\n0.94397. In terms of F1-score, recall, accuracy, and precision, Habaek performs\nbetter than rival models, indicating its potential for real-world applications.\nThis study highlights the need to enhance structures and include datasets for\neffective water segmentation.", "paper_summary_zh": "水體分割對於災害應變和水資源管理至關重要。當局可以採用高解析度攝影來監控河流、湖泊和水庫，以便在農業、工業和保育方面進行更積極的管理。深度學習透過讓 CNN、U-Net 和 Transformer 等模型處理大量衛星和空中資料，改進了洪水監測。然而，這些模型通常有大量的處理需求，限制了它們在即時應用中的使用。本研究提出透過資料擴充，例如 ADE20K 和 RIWA 等資料集，升級 SegFormer 模型以進行水體分割，以提升泛化能力。我們探討歸納偏差如何影響基於注意力的模型，並發現 SegFormer 在較大的資料集上表現得更好。為了進一步展示資料擴充的功能，低秩適應 (LoRA) 用於降低處理複雜度，同時保持準確度。我們展示建議的 Habaek 模型在分割方面優於目前的模型，其交集並集 (IoU) 介於 0.91986 到 0.94397。在 F1 分數、召回率、準確度和精確度方面，Habaek 的表現優於競爭模型，顯示其在實際應用中的潛力。本研究強調了增強結構和納入資料集以進行有效水體分割的必要性。", "author": "Hanseon Joo et.al.", "authors": "Hanseon Joo, Eunji Lee, Minjong Cheon", "id": "2410.15794v1", "paper_url": "http://arxiv.org/abs/2410.15794v1", "repo": "https://github.com/HanseonJoo/Habaek"}}