{"2407.00994": {"publish_time": "2024-07-01", "title": "LLM Uncertainty Quantification through Directional Entailment Graph and Claim Level Response Augmentation", "paper_summary": "The Large language models (LLMs) have showcased superior capabilities in\nsophisticated tasks across various domains, stemming from basic question-answer\n(QA), they are nowadays used as decision assistants or explainers for\nunfamiliar content. However, they are not always correct due to the data\nsparsity in specific domain corpus, or the model's hallucination problems.\nGiven this, how much should we trust the responses from LLMs? This paper\npresents a novel way to evaluate the uncertainty that captures the directional\ninstability, by constructing a directional graph from entailment probabilities,\nand we innovatively conduct Random Walk Laplacian given the asymmetric property\nof a constructed directed graph, then the uncertainty is aggregated by the\nderived eigenvalues from the Laplacian process. We also provide a way to\nincorporate the existing work's semantics uncertainty with our proposed layer.\nBesides, this paper identifies the vagueness issues in the raw response set and\nproposes an augmentation approach to mitigate such a problem, we conducted\nextensive empirical experiments and demonstrated the superiority of our\nproposed solutions.", "paper_summary_zh": "大型語言模型 (LLM) 在各個領域的複雜任務中展現出卓越的能力，從基本的問答 (QA) 開始，它們現在被用作決策助理或不熟悉內容的說明者。然而，它們並不總是正確的，因為特定領域語料庫中的數據稀疏，或模型的幻覺問題。有鑑於此，我們應該多相信 LLM 的回應？本文提出了一種新的方法來評估捕捉方向不穩定性的不確定性，通過從蘊涵概率構造一個有向圖，並且我們創新地進行隨機遊走拉普拉斯算子，給定一個構造的有向圖的不對稱屬性，然後不確定性由拉普拉斯過程中的導出特徵值聚合。我們還提供了一種將現有工作的語義不確定性與我們提出的層結合起來的方法。此外，本文識別了原始回應集中模糊的問題，並提出了一種擴充方法來減輕這種問題，我們進行了廣泛的實證實驗，並展示了我們提出的解決方案的優越性。", "author": "Longchao Da et.al.", "authors": "Longchao Da, Tiejin Chen, Lu Cheng, Hua Wei", "id": "2407.00994v2", "paper_url": "http://arxiv.org/abs/2407.00994v2", "repo": "null"}}