{"2412.02400": {"publish_time": "2024-12-03", "title": "Four Guiding Principles for Modeling Causal Domain Knowledge: A Case Study on Brainstorming Approaches for Urban Blight Analysis", "paper_summary": "Urban blight is a problem of high interest for planning and policy making.\nResearchers frequently propose theories about the relationships between urban\nblight indicators, focusing on relationships reflecting causality. In this\npaper, we improve on the integration of domain knowledge in the analysis of\nurban blight by introducing four rules for effective modeling of causal domain\nknowledge. The findings of this study reveal significant deviation from causal\nmodeling guidelines by investigating cognitive maps developed for urban blight\nanalysis. These findings provide valuable insights that will inform future work\non urban blight, ultimately enhancing our understanding of urban blight complex\ninteractions.", "paper_summary_zh": "都市衰敗是一個高度引起規劃和政策制定興趣的問題。\n研究人員經常提出有關都市衰敗指標間關係的理論，專注於反映因果關係的關係。在本文中，我們透過引入四條有效建模因果領域知識的規則，改善都市衰敗分析中領域知識的整合。本研究的發現揭示了透過研究為都市衰敗分析而開發的認知地圖，顯著偏離因果建模指南。這些發現提供了有價值的見解，將為未來關於都市衰敗的研究提供資訊，最終增進我們對都市衰敗複雜互動的理解。", "author": "Houssam Razouk et.al.", "authors": "Houssam Razouk, Michael Leitner, Roman Kern", "id": "2412.02400v1", "paper_url": "http://arxiv.org/abs/2412.02400v1", "repo": "null"}}