{"2410.16107": {"publish_time": "2024-10-21", "title": "Do LLMs write like humans? Variation in grammatical and rhetorical styles", "paper_summary": "Large language models (LLMs) are capable of writing grammatical text that\nfollows instructions, answers questions, and solves problems. As they have\nadvanced, it has become difficult to distinguish their output from\nhuman-written text. While past research has found some differences in surface\nfeatures such as word choice and punctuation, and developed classifiers to\ndetect LLM output, none has studied the rhetorical styles of LLMs.\n  Using several variants of Llama 3 and GPT-4o, we construct two parallel\ncorpora of human- and LLM-written texts from common prompts. Using Douglas\nBiber's set of lexical, grammatical, and rhetorical features, we identify\nsystematic differences between LLMs and humans and between different LLMs.\nThese differences persist when moving from smaller models to larger ones, and\nare larger for instruction-tuned models than base models. This demonstrates\nthat despite their advanced abilities, LLMs struggle to match human styles, and\nhence more advanced linguistic features can detect patterns in their behavior\nnot previously recognized.", "paper_summary_zh": "大型語言模型 (LLM) 能撰寫符合文法規範的文字，遵循指示、回答問題和解決問題。隨著它們的進步，要區分它們的輸出和人類撰寫的文字已變得困難。雖然過去的研究發現了一些表層特徵的差異，例如詞彙選擇和標點符號，並開發了分類器來偵測 LLM 輸出，但沒有研究探討 LLM 的修辭風格。\n我們使用 Llama 3 和 GPT-4o 的幾個變體，從常見提示中建構了兩組人類和 LLM 撰寫的平行語料庫。使用 Douglas Biber 的一組詞彙、語法和修辭特徵，我們辨識出 LLM 和人類之間以及不同 LLM 之間的系統性差異。這些差異在從較小的模型轉移到較大的模型時仍然存在，並且對於經過指令調整的模型來說比基礎模型更大。這表明儘管 LLM 具有先進的能力，但它們仍難以匹配人類的風格，因此更先進的語言特徵可以偵測到它們行為中以前無法辨識的模式。", "author": "Alex Reinhart et.al.", "authors": "Alex Reinhart, David West Brown, Ben Markey, Michael Laudenbach, Kachatad Pantusen, Ronald Yurko, Gordon Weinberg", "id": "2410.16107v1", "paper_url": "http://arxiv.org/abs/2410.16107v1", "repo": "null"}}