{"2411.17973": {"publish_time": "2024-11-27", "title": "Improved implicit diffusion model with knowledge distillation to estimate the spatial distribution density of carbon stock in remote sensing imagery", "paper_summary": "The forest serves as the most significant terrestrial carbon stock mechanism,\neffectively reducing atmospheric CO$_2$ concentrations and mitigating climate\nchange. Remote sensing provides high data accuracy and enables large-scale\nobservations. Optical images facilitate long-term monitoring, which is crucial\nfor future carbon stock estimation studies. This study focuses on Huize County,\nQujing City, Yunnan Province, China, utilizing GF-1 WFV satellite imagery. The\nKD-VGG and KD-UNet modules were introduced for initial feature extraction, and\nthe improved implicit diffusion model (IIDM) was proposed. The results showed:\n(1) The VGG module improved initial feature extraction, improving accuracy, and\nreducing inference time with optimized model parameters. (2) The\nCross-attention + MLPs module enabled effective feature fusion, establishing\ncritical relationships between global and local features, achieving\nhigh-accuracy estimation. (3) The IIDM model, a novel contribution,\ndemonstrated the highest estimation accuracy with an RMSE of 12.17\\%,\nsignificantly improving by 41.69\\% to 42.33\\% compared to the regression model.\nIn carbon stock estimation, the generative model excelled in extracting deeper\nfeatures, significantly outperforming other models, demonstrating the\nfeasibility of AI-generated content in quantitative remote sensing. The\n16-meter resolution estimates provide a robust basis for tailoring forest\ncarbon sink regulations, enhancing regional carbon stock management.", "paper_summary_zh": "森林作為最重要的陸地碳儲存機制，\n有效降低大氣中 CO$_2$ 濃度，緩解氣候\n變遷。遙測提供高數據精確度，並能進行大尺度\n觀測。光學影像利於長期監測，這對於未來碳儲量\n估算研究至關重要。本研究聚焦於中國雲南省曲靖\n市會澤縣，利用 GF-1 WFV 衛星影像。引入\nKD-VGG 及 KD-UNet 模組進行初始特徵萃取，並\n提出改良隱式擴散模型（IIDM）。結果顯示：\n（1）VGG 模組改善初始特徵萃取，提升準確度，並\n透過最佳化模型參數減少推論時間。（2）Cross-\nattention + MLPs 模組能有效進行特徵融合，建立\n全局與局部特徵間的關鍵關係，達成高準確度估算。\n（3）IIDM 模型為本研究之創新貢獻，展現最高估算\n準確度，RMSE 為 12.17%，相較於回歸模型，顯著\n提升 41.69% 至 42.33%。在碳儲量估算上，生成模\n型在萃取更深層特徵上表現優異，顯著優於其他模\n型，驗證 AI 生成內容在定量遙測上的可行性。16\n公尺解析度的估算結果為量身打造森林碳匯法規、\n提升區域碳儲量管理提供強健的基礎。", "author": "Zhenyu Yu et.al.", "authors": "Zhenyu Yu", "id": "2411.17973v1", "paper_url": "http://arxiv.org/abs/2411.17973v1", "repo": "null"}}