{"2407.08940": {"publish_time": "2024-07-12", "title": "Large Language Models as Biomedical Hypothesis Generators: A Comprehensive Evaluation", "paper_summary": "The rapid growth of biomedical knowledge has outpaced our ability to\nefficiently extract insights and generate novel hypotheses. Large language\nmodels (LLMs) have emerged as a promising tool to revolutionize knowledge\ninteraction and potentially accelerate biomedical discovery. In this paper, we\npresent a comprehensive evaluation of LLMs as biomedical hypothesis generators.\nWe construct a dataset of background-hypothesis pairs from biomedical\nliterature, carefully partitioned into training, seen, and unseen test sets\nbased on publication date to mitigate data contamination. Using this dataset,\nwe assess the hypothesis generation capabilities of top-tier instructed models\nin zero-shot, few-shot, and fine-tuning settings. To enhance the exploration of\nuncertainty, a crucial aspect of scientific discovery, we incorporate tool use\nand multi-agent interactions in our evaluation framework. Furthermore, we\npropose four novel metrics grounded in extensive literature review to evaluate\nthe quality of generated hypotheses, considering both LLM-based and human\nassessments. Our experiments yield two key findings: 1) LLMs can generate novel\nand validated hypotheses, even when tested on literature unseen during\ntraining, and 2) Increasing uncertainty through multi-agent interactions and\ntool use can facilitate diverse candidate generation and improve zero-shot\nhypothesis generation performance. However, we also observe that the\nintegration of additional knowledge through few-shot learning and tool use may\nnot always lead to performance gains, highlighting the need for careful\nconsideration of the type and scope of external knowledge incorporated. These\nfindings underscore the potential of LLMs as powerful aids in biomedical\nhypothesis generation and provide valuable insights to guide further research\nin this area.", "paper_summary_zh": "<paragraph>生物醫學知識的快速增長已超越我們有效提取見解和產生新假設的能力。大型語言模型 (LLM) 已成為一項極具前景的工具，可徹底改變知識互動並潛在加速生物醫學發現。在本文中，我們對 LLM 作為生物醫學假設產生器的全面評估。我們從生物醫學文獻中構建了一個背景假設對集，根據出版日期仔細劃分為訓練、已見和未見測試集，以減輕數據污染。使用此數據集，我們評估了頂級指導模型在零次學習、少次學習和微調設置中的假設產生能力。為了加強對不確定性的探索，這是科學發現的一個關鍵方面，我們在評估框架中納入了工具使用和多主體互動。此外，我們根據廣泛的文獻回顧提出了四個新穎的指標來評估生成假設的品質，同時考慮 LLM 為基礎和人為評估。我們的實驗產生了兩個關鍵發現：1) LLM 可以產生新穎且經過驗證的假設，即使在訓練期間未見的文獻上進行測試也是如此，以及 2) 透過多主體互動和工具使用增加不確定性，可以促進多樣化的候選產生並改善零次學習假設產生效能。然而，我們也觀察到，透過少次學習和工具使用整合額外的知識可能並不總是會導致效能提升，這突顯了仔細考量所納入外部知識的類型和範圍的必要性。這些發現強調了 LLM 作為生物醫學假設產生中強大輔助工具的潛力，並提供了有價值的見解以引導此領域進一步的研究。</paragraph>", "author": "Biqing Qi et.al.", "authors": "Biqing Qi, Kaiyan Zhang, Kai Tian, Haoxiang Li, Zhang-Ren Chen, Sihang Zeng, Ermo Hua, Hu Jinfang, Bowen Zhou", "id": "2407.08940v1", "paper_url": "http://arxiv.org/abs/2407.08940v1", "repo": "null"}}