{"2501.01256": {"publish_time": "2025-01-02", "title": "Digital Guardians: Can GPT-4, Perspective API, and Moderation API reliably detect hate speech in reader comments of German online newspapers?", "paper_summary": "In recent years, toxic content and hate speech have become widespread\nphenomena on the internet. Moderators of online newspapers and forums are now\nrequired, partly due to legal regulations, to carefully review and, if\nnecessary, delete reader comments. This is a labor-intensive process. Some\nproviders of large language models already offer solutions for automated hate\nspeech detection or the identification of toxic content. These include GPT-4o\nfrom OpenAI, Jigsaw's (Google) Perspective API, and OpenAI's Moderation API.\nBased on the selected German test dataset HOCON34k, which was specifically\ncreated for developing tools to detect hate speech in reader comments of online\nnewspapers, these solutions are compared with each other and against the\nHOCON34k baseline. The test dataset contains 1,592 annotated text samples. For\nGPT-4o, three different promptings are used, employing a Zero-Shot, One-Shot,\nand Few-Shot approach. The results of the experiments demonstrate that GPT-4o\noutperforms both the Perspective API and the Moderation API, and exceeds the\nHOCON34k baseline by approximately 5 percentage points, as measured by a\ncombined metric of MCC and F2-score.", "paper_summary_zh": "近年來，網路上的有毒內容和仇恨言論已成為普遍現象。線上報紙和論壇的管理員現在必須仔細審查讀者留言，並在必要時刪除，這部分是基於法規要求。這是一個勞力密集的程序。一些大型語言模型的提供者已提供自動仇恨言論偵測或有毒內容識別的解決方案。這些解決方案包括 OpenAI 的 GPT-4o、Jigsaw（Google）的 Perspective API，以及 OpenAI 的 Moderation API。基於專門為開發用於偵測線上報紙讀者留言中仇恨言論的工具而建立的德語測試資料集 HOCON34k，這些解決方案彼此之間以及與 HOCON34k 基準進行比較。測試資料集包含 1,592 個註解文字範例。對於 GPT-4o，使用了三種不同的提示，採用零次學習、一次學習和少次學習方法。實驗結果顯示，GPT-4o 的表現優於 Perspective API 和 Moderation API，並且比 HOCON34k 基準高出約 5 個百分點，這是根據 MCC 和 F2 分數的綜合指標測量的。", "author": "Manuel Weber et.al.", "authors": "Manuel Weber, Moritz Huber, Maximilian Auch, Alexander Döschl, Max-Emanuel Keller, Peter Mandl", "id": "2501.01256v1", "paper_url": "http://arxiv.org/abs/2501.01256v1", "repo": "null"}}