{"2409.10357": {"publish_time": "2024-09-16", "title": "2D or not 2D: How Does the Dimensionality of Gesture Representation Affect 3D Co-Speech Gesture Generation?", "paper_summary": "Co-speech gestures are fundamental for communication. The advent of recent\ndeep learning techniques has facilitated the creation of lifelike, synchronous\nco-speech gestures for Embodied Conversational Agents. \"In-the-wild\" datasets,\naggregating video content from platforms like YouTube via human pose detection\ntechnologies, provide a feasible solution by offering 2D skeletal sequences\naligned with speech. Concurrent developments in lifting models enable the\nconversion of these 2D sequences into 3D gesture databases. However, it is\nimportant to note that the 3D poses estimated from the 2D extracted poses are,\nin essence, approximations of the ground-truth, which remains in the 2D domain.\nThis distinction raises questions about the impact of gesture representation\ndimensionality on the quality of generated motions - a topic that, to our\nknowledge, remains largely unexplored. Our study examines the effect of using\neither 2D or 3D joint coordinates as training data on the performance of\nspeech-to-gesture deep generative models. We employ a lifting model for\nconverting generated 2D pose sequences into 3D and assess how gestures created\ndirectly in 3D stack up against those initially generated in 2D and then\nconverted to 3D. We perform an objective evaluation using widely used metrics\nin the gesture generation field as well as a user study to qualitatively\nevaluate the different approaches.", "paper_summary_zh": "共時手勢對於溝通至關重要。最近深度學習技術的出現促進了擬真、同步共時手勢的建立，用於具身對話代理。「野外」數據集通過人體姿勢檢測技術彙集來自 YouTube 等平台的影片內容，提供了一個可行的解決方案，即提供與語音對齊的 2D 骨骼序列。提升模型的同步發展使得這些 2D 序列能夠轉換為 3D 手勢數據庫。然而，重要的是要注意，從 2D 提取的手勢估計的 3D 姿勢本質上是對真實情況的近似，而真實情況仍然在 2D 領域。這種區別引發了有關手勢表示維度對生成動作品質影響的問題，據我們所知，這是一個在很大程度上尚未探索的主題。我們的研究探討了使用 2D 或 3D 關節坐標作為訓練資料對語音到手勢深度生成模型效能的影響。我們採用一個提升模型，將生成的 2D 姿勢序列轉換為 3D，並評估直接在 3D 中建立的手勢與最初在 2D 中生成然後轉換為 3D 的手勢相比如何。我們使用手勢生成領域中廣泛使用的指標進行客觀評估，並進行使用者研究以定性評估不同的方法。", "author": "Téo Guichoux et.al.", "authors": "Téo Guichoux, Laure Soulier, Nicolas Obin, Catherine Pelachaud", "id": "2409.10357v1", "paper_url": "http://arxiv.org/abs/2409.10357v1", "repo": "null"}}