{"2502.04556": {"publish_time": "2025-02-06", "title": "TruthFlow: Truthful LLM Generation via Representation Flow Correction", "paper_summary": "Large language models (LLMs) are known to struggle with consistently\ngenerating truthful responses. While various representation intervention\ntechniques have been proposed, these methods typically apply a universal\nrepresentation correction vector to all input queries, limiting their\neffectiveness against diverse queries in practice. In this study, we introduce\nTruthFlow, a novel method that leverages the Flow Matching technique for\nquery-specific truthful representation correction. Specifically, TruthFlow\nfirst uses a flow model to learn query-specific correction vectors that\ntransition representations from hallucinated to truthful states. Then, during\ninference, the trained flow model generates these correction vectors to enhance\nthe truthfulness of LLM outputs. Experimental results demonstrate that\nTruthFlow significantly improves performance on open-ended generation tasks\nacross various advanced LLMs evaluated on TruthfulQA. Moreover, the trained\nTruthFlow model exhibits strong transferability, performing effectively on\nother unseen hallucination benchmarks.", "paper_summary_zh": "大型語言模型 (LLM) 已知在持續產生真實回應方面有困難。儘管已提出各種表徵介入技術，但這些方法通常將通用表徵修正向量應用於所有輸入查詢，在實務上限制了它們對不同查詢的有效性。在這項研究中，我們引入了 TruthFlow，這是一種新穎的方法，它利用流匹配技術進行特定查詢的真實表徵修正。具體來說，TruthFlow 首先使用流模型來學習特定查詢的修正向量，將表徵從幻覺狀態轉換為真實狀態。然後，在推理期間，訓練好的流模型會產生這些修正向量，以增強 LLM 輸出的真實性。實驗結果表明，TruthFlow 在 TruthfulQA 上評估的各種先進 LLM 上顯著改善了開放式生成任務的效能。此外，訓練好的 TruthFlow 模型表現出強大的可移植性，在其他未見的幻覺基準上有效執行。", "author": "Hanyu Wang et.al.", "authors": "Hanyu Wang, Bochuan Cao, Yuanpu Cao, Jinghui Chen", "id": "2502.04556v1", "paper_url": "http://arxiv.org/abs/2502.04556v1", "repo": "null"}}