{"2408.12549": {"publish_time": "2024-08-22", "title": "Modeling Time-Variant Responses of Optical Compressors with Selective State Space Models", "paper_summary": "This paper presents a method for modeling optical dynamic range compressors\nusing deep neural networks with Selective State Space models. The proposed\napproach surpasses previous methods based on recurrent layers by employing a\nSelective State Space block to encode the input audio. It features a refined\ntechnique integrating Feature-wise Linear Modulation and Gated Linear Units to\nadjust the network dynamically, conditioning the compression's attack and\nrelease phases according to external parameters. The proposed architecture is\nwell-suited for low-latency and real-time applications, crucial in live audio\nprocessing. The method has been validated on the analog optical compressors\nTubeTech CL 1B and Teletronix LA-2A, which possess distinct characteristics.\nEvaluation is performed using quantitative metrics and subjective listening\ntests, comparing the proposed method with other state-of-the-art models.\nResults show that our black-box modeling methods outperform all others,\nachieving accurate emulation of the compression process for both seen and\nunseen settings during training. We further show a correlation between this\naccuracy and the sampling density of the control parameters in the dataset and\nidentify settings with fast attack and slow release as the most challenging to\nemulate.", "paper_summary_zh": "本文提出一种使用具有选择性状态空间模型的深度神经网络对光学动态范围压缩器进行建模的方法。所提出的方法通过采用选择性状态空间块对输入音频进行编码，超越了以前基于循环层的模型。它采用了一种精细的技术，集成了逐特征线性调制和门控线性单元，以动态调整网络，根据外部参数调节压缩的攻击和释放阶段。所提出的架构非常适合低延迟和实时应用，这在现场音频处理中至关重要。该方法已在模拟光学压缩器 TubeTech CL 1B 和 Teletronix LA-2A 上得到验证，它们具有不同的特性。使用定量指标和主观听力测试进行评估，将所提出的方法与其他最先进的模型进行比较。结果表明，我们的黑盒建模方法优于其他所有方法，在训练期间对压缩过程的可见和不可见设置实现了准确的仿真。我们进一步展示了这种准确性与数据集中控制参数的采样密度之间的相关性，并确定具有快速攻击和慢释放的设置是最难模拟的。", "author": "Riccardo Simionato et.al.", "authors": "Riccardo Simionato", "id": "2408.12549v1", "paper_url": "http://arxiv.org/abs/2408.12549v1", "repo": "null"}}