{"2412.02372": {"publish_time": "2024-12-03", "title": "HERO: Hint-Based Efficient and Reliable Query Optimizer", "paper_summary": "We propose a novel model for learned query optimization which provides query\nhints leading to better execution plans. The model addresses the three key\nchallenges in learned hint-based query optimization: reliable hint\nrecommendation (ensuring non-degradation of query latency), efficient hint\nexploration, and fast inference. We provide an in-depth analysis of existing\nNN-based approaches to hint-based optimization and experimentally confirm the\nnamed challenges for them. Our alternative solution consists of a new inference\nschema based on an ensemble of context-aware models and a graph storage for\nreliable hint suggestion and fast inference, and a budget-controlled training\nprocedure with a local search algorithm that solves the issue of exponential\nsearch space exploration. In experiments on standard benchmarks, our model\ndemonstrates optimization capability close to the best achievable with\ncoarse-grained hints. Controlling the degree of parallelism (query dop) in\naddition to operator-related hints enables our model to achieve 3x latency\nimprovement on JOB benchmark which sets a new standard for optimization. Our\nmodel is interpretable and easy to debug, which is particularly important for\ndeployment in production.", "paper_summary_zh": "我們提出一個新穎的學習查詢最佳化模型，提供查詢提示，以產生更好的執行計畫。該模型解決了基於學習提示的查詢最佳化中的三大關鍵挑戰：可靠提示建議（確保查詢延遲不降低）、有效提示探索和快速推論。我們深入分析了現有的基於 NN 的提示式最佳化方法，並透過實驗驗證了它們所面對的挑戰。我們的替代方案包括一個基於情境感知模型和圖形儲存的新推論架構，用於可靠提示建議和快速推論，以及一個預算控制訓練程序，其中包含一個局部搜尋演算法，用於解決指數搜尋空間探索的問題。在標準基準測試中，我們的模型展示了接近可使用粗略提示達成的最佳最佳化能力。除了與運算子相關的提示外，控制平行度（查詢 dop）使我們的模型能夠在 JOB 基準測試中實現 3 倍的延遲改善，為最佳化設定了新的標準。我們的模型具有可解釋性和易於除錯，這對於在生產中部署特別重要。", "author": "Sergey Zinchenko et.al.", "authors": "Sergey Zinchenko, Sergey Iazov", "id": "2412.02372v1", "paper_url": "http://arxiv.org/abs/2412.02372v1", "repo": "https://github.com/zinchse/hero"}}