{"2502.02772": {"publish_time": "2025-02-04", "title": "Cross-Modality Embedding of Force and Language for Natural Human-Robot Communication", "paper_summary": "A method for cross-modality embedding of force profile and words is presented\nfor synergistic coordination of verbal and haptic communication. When two\npeople carry a large, heavy object together, they coordinate through verbal\ncommunication about the intended movements and physical forces applied to the\nobject. This natural integration of verbal and physical cues enables effective\ncoordination. Similarly, human-robot interaction could achieve this level of\ncoordination by integrating verbal and haptic communication modalities. This\npaper presents a framework for embedding words and force profiles in a unified\nmanner, so that the two communication modalities can be integrated and\ncoordinated in a way that is effective and synergistic. Here, it will be shown\nthat, although language and physical force profiles are deemed completely\ndifferent, the two can be embedded in a unified latent space and proximity\nbetween the two can be quantified. In this latent space, a force profile and\nwords can a) supplement each other, b) integrate the individual effects, and c)\nsubstitute in an exchangeable manner. First, the need for cross-modality\nembedding is addressed, and the basic architecture and key building block\ntechnologies are presented. Methods for data collection and implementation\nchallenges will be addressed, followed by experimental results and discussions.", "paper_summary_zh": "<paragraph>提出一种力剖面和单词的跨模态嵌入方法，用于言语和触觉沟通的协同协调。当两个人一起搬运一个又大又重的物体时，他们会通过言语沟通来协调预期的动作和施加在物体上的物理力。言语和物理提示的这种自然整合实现了有效的协调。类似地，人机交互可以通过整合言语和触觉沟通方式来实现这种级别的协调。本文提出了一个以统一方式嵌入单词和力剖面的框架，以便以有效且协同的方式整合和协调两种沟通方式。这里将展示，尽管语言和物理力剖面被认为是完全不同的，但两者可以嵌入到一个统一的潜在空间中，并且可以量化两者之间的接近度。在这个潜在空间中，力剖面和单词可以 a) 相互补充，b) 整合个体效应，以及 c) 以可交换的方式替换。首先，解决了跨模态嵌入的需求，并介绍了基本架构和关键构建模块技术。将解决数据收集和实施挑战的方法，然后是实验结果和讨论。</paragraph>", "author": "Ravi Tejwani et.al.", "authors": "Ravi Tejwani, Karl Velazquez, John Payne, Paolo Bonato, Harry Asada", "id": "2502.02772v1", "paper_url": "http://arxiv.org/abs/2502.02772v1", "repo": "null"}}