{"2405.13902": {"publish_time": "2024-05-22", "title": "LOGIN: A Large Language Model Consulted Graph Neural Network Training Framework", "paper_summary": "Recent prevailing works on graph machine learning typically follow a similar\nmethodology that involves designing advanced variants of graph neural networks\n(GNNs) to maintain the superior performance of GNNs on different graphs. In\nthis paper, we aim to streamline the GNN design process and leverage the\nadvantages of Large Language Models (LLMs) to improve the performance of GNNs\non downstream tasks. We formulate a new paradigm, coined \"LLMs-as-Consultants,\"\nwhich integrates LLMs with GNNs in an interactive manner. A framework named\nLOGIN (LLM Consulted GNN training) is instantiated, empowering the interactive\nutilization of LLMs within the GNN training process. First, we attentively\ncraft concise prompts for spotted nodes, carrying comprehensive semantic and\ntopological information, and serving as input to LLMs. Second, we refine GNNs\nby devising a complementary coping mechanism that utilizes the responses from\nLLMs, depending on their correctness. We empirically evaluate the effectiveness\nof LOGIN on node classification tasks across both homophilic and heterophilic\ngraphs. The results illustrate that even basic GNN architectures, when employed\nwithin the proposed LLMs-as-Consultants paradigm, can achieve comparable\nperformance to advanced GNNs with intricate designs. Our codes are available at\nhttps://github.com/QiaoYRan/LOGIN.", "paper_summary_zh": "近期主流的圖形機器學習研究通常遵循類似的方法，即設計圖形神經網路 (GNN) 的進階變體，以在不同圖形上維持 GNN 的優異效能。在本文中，我們旨在簡化 GNN 設計流程，並利用大型語言模型 (LLM) 的優勢來提升 GNN 在下游任務的效能。我們制定了一個新的範例，稱為「LLM 作為顧問」，它以互動的方式將 LLM 與 GNN 整合在一起。我們實例化了一個名為 LOGIN（LLM 諮詢 GNN 訓練）的架構，讓 LLM 能在 GNN 訓練過程中互動式地被使用。首先，我們專注於為發現的節點精心製作簡潔的提示，包含全面的語義和拓撲資訊，並作為 LLM 的輸入。其次，我們透過設計一種補充性的應對機制來改善 GNN，該機制會根據 LLM 回應的正確性來使用這些回應。我們根據同質性和異質性圖形上的節點分類任務，實證評估了 LOGIN 的有效性。結果表明，即使在提議的 LLM 作為顧問範例中使用基本的 GNN 架構，也能達到與設計複雜的進階 GNN 相當的效能。我們的程式碼可在 https://github.com/QiaoYRan/LOGIN 取得。", "author": "Yiran Qiao et.al.", "authors": "Yiran Qiao, Xiang Ao, Yang Liu, Jiarong Xu, Xiaoqian Sun, Qing He", "id": "2405.13902v2", "paper_url": "http://arxiv.org/abs/2405.13902v2", "repo": "https://github.com/qiaoyran/login"}}