{"2410.18912": {"publish_time": "2024-10-24", "title": "Dynamic 3D Gaussian Tracking for Graph-Based Neural Dynamics Modeling", "paper_summary": "Videos of robots interacting with objects encode rich information about the\nobjects' dynamics. However, existing video prediction approaches typically do\nnot explicitly account for the 3D information from videos, such as robot\nactions and objects' 3D states, limiting their use in real-world robotic\napplications. In this work, we introduce a framework to learn object dynamics\ndirectly from multi-view RGB videos by explicitly considering the robot's\naction trajectories and their effects on scene dynamics. We utilize the 3D\nGaussian representation of 3D Gaussian Splatting (3DGS) to train a\nparticle-based dynamics model using Graph Neural Networks. This model operates\non sparse control particles downsampled from the densely tracked 3D Gaussian\nreconstructions. By learning the neural dynamics model on offline robot\ninteraction data, our method can predict object motions under varying initial\nconfigurations and unseen robot actions. The 3D transformations of Gaussians\ncan be interpolated from the motions of control particles, enabling the\nrendering of predicted future object states and achieving action-conditioned\nvideo prediction. The dynamics model can also be applied to model-based\nplanning frameworks for object manipulation tasks. We conduct experiments on\nvarious kinds of deformable materials, including ropes, clothes, and stuffed\nanimals, demonstrating our framework's ability to model complex shapes and\ndynamics. Our project page is available at https://gs-dynamics.github.io.", "paper_summary_zh": "機器人與物體互動的影片編碼了豐富的資訊，關於物體的動態。然而，現有的影片預測方法通常不會明確說明影片中的 3D 資訊，例如機器人的動作和物體的 3D 狀態，限制了它們在真實世界機器人應用中的使用。在這項工作中，我們引入了一個框架，透過明確考慮機器人的動作軌跡及其對場景動態的影響，直接從多視角 RGB 影片中學習物體動態。我們利用 3D 高斯表示法 3D 高斯潑濺 (3DGS) 來使用圖形神經網路訓練基於粒子的動態模型。此模型運作在從密集追蹤的 3D 高斯重建中向下取樣的稀疏控制粒子。透過在離線機器人互動資料上學習神經動態模型，我們的模型可以在不同的初始組態和未見的機器人動作下預測物體運動。高斯的 3D 轉換可以從控制粒子的運動中插值，使預測的未來物體狀態能夠渲染，並實現以動作為條件的影片預測。動態模型也可以應用於基於模型的規劃框架，用於物體操作任務。我們對各種可變形材料進行實驗，包括繩索、衣服和填充動物，展示了我們的框架對複雜形狀和動態建模的能力。我們的專案頁面可在 https://gs-dynamics.github.io 獲得。", "author": "Mingtong Zhang et.al.", "authors": "Mingtong Zhang, Kaifeng Zhang, Yunzhu Li", "id": "2410.18912v1", "paper_url": "http://arxiv.org/abs/2410.18912v1", "repo": "null"}}