{"2501.18062": {"publish_time": "2025-01-30", "title": "FinanceQA: A Benchmark for Evaluating Financial Analysis Capabilities of Large Language Models", "paper_summary": "FinanceQA is a testing suite that evaluates LLMs' performance on complex\nnumerical financial analysis tasks that mirror real-world investment work.\nDespite recent advances, current LLMs fail to meet the strict accuracy\nrequirements of financial institutions, with models failing approximately 60%\nof realistic tasks that mimic on-the-job analyses at hedge funds, private\nequity firms, investment banks, and other financial institutions. The primary\nchallenges include hand-spreading metrics, adhering to standard accounting and\ncorporate valuation conventions, and performing analysis under incomplete\ninformation - particularly in multi-step tasks requiring assumption generation.\nThis performance gap highlights the disconnect between existing LLM\ncapabilities and the demands of professional financial analysis that are\ninadequately tested by current testing architectures. Results show that\nhigher-quality training data is needed to support such tasks, which we\nexperiment with using OpenAI's fine-tuning API. FinanceQA is publicly released\nat [this https URL](https://huggingface.co/datasets/AfterQuery/FinanceQA).", "paper_summary_zh": "FinanceQA 是一個測試套件，用於評估 LLM 在複雜數值財務分析任務上的表現，這些任務反映了真實世界的投資工作。儘管最近取得進展，但目前的 LLM 無法滿足金融機構嚴格的準確性要求，模型在模擬對沖基金、私募股權公司、投資銀行和其他金融機構的實際分析中約有 60% 的任務失敗。主要的挑戰包括手動傳播指標、遵守標準會計和公司估值慣例，以及在不完整的信息下執行分析，特別是在需要產生假設的多步驟任務中。這種效能差距突顯了現有 LLM 能力與專業財務分析需求之間的脫節，而目前的測試架構並未充分測試這些需求。結果顯示需要更高品質的訓練資料來支援此類任務，我們使用 OpenAI 的微調 API 進行實驗。FinanceQA 已於 [此 https URL](https://huggingface.co/datasets/AfterQuery/FinanceQA) 公開發布。", "author": "Spencer Mateega et.al.", "authors": "Spencer Mateega, Carlos Georgescu, Danny Tang", "id": "2501.18062v1", "paper_url": "http://arxiv.org/abs/2501.18062v1", "repo": "null"}}