{"2406.18916": {"publish_time": "2024-06-27", "title": "TrustUQA: A Trustful Framework for Unified Structured Data Question Answering", "paper_summary": "Natural language question answering (QA) over structured data sources such as\ntables and knowledge graphs (KGs) have been widely investigated, for example\nwith Large Language Models (LLMs). The main solutions include question to\nformal query parsing and retrieval-based answer generation. However, current\nmethods of the former often suffer from weak generalization, failing to dealing\nwith multiple sources simultaneously, while the later is limited in\ntrustfulness. In this paper, we propose UnifiedTQA, a trustful QA framework\nthat can simultaneously support multiple types of structured data in a unified\nway. To this end, it adopts an LLM-friendly and unified knowledge\nrepresentation method called Condition Graph (CG), and uses an LLM and\ndemonstration-based two-level method for CG querying. For enhancement, it is\nalso equipped with dynamic demonstration retrieval. We have evaluated\nUnifiedTQA with 5 benchmarks covering 3 types of structured data. It\noutperforms 2 existing unified structured data QA methods and in comparison\nwith the baselines that are specific to a data type, it achieves\nstate-of-the-art on 2 of them. Further more, we demonstrates potential of our\nmethod for more general QA tasks, QA over mixed structured data and QA across\nstructured data.", "paper_summary_zh": "自然語言問答 (QA) 透過結構化資料來源（例如表格和知識圖譜 (KGs)）已廣泛研究，例如使用大型語言模型 (LLM)。主要解決方案包括問題轉換成形式化查詢解析和基於檢索的答案產生。然而，前者的現行方法通常會產生弱泛化，無法同時處理多個來源，而後者則受到可信度的限制。在本文中，我們提出 UnifiedTQA，一個可信賴的 QA 框架，能夠以統一的方式同時支援多種類型的結構化資料。為此，它採用了一種 LLM 友善且統一的知識表示方法，稱為條件圖 (CG)，並使用 LLM 和基於示範的二階方法進行 CG 查詢。為了加強，它還配備了動態示範檢索。我們已經使用涵蓋 3 種類型結構化資料的 5 個基準評估 UnifiedTQA。它優於 2 種現有的統一結構化資料 QA 方法，並且與特定於資料類型的基線相比，它在其中 2 個基準上達到了最先進的水平。此外，我們展示了我們的方法在更通用的 QA 任務、混合結構化資料的 QA 和跨結構化資料的 QA 中的潛力。", "author": "Wen Zhang et.al.", "authors": "Wen Zhang, Long Jin, Yushan Zhu, Jiaoyan Chen, Zhiwei Huang, Junjie Wang, Yin Hua, Lei Liang, Huajun Chen", "id": "2406.18916v1", "paper_url": "http://arxiv.org/abs/2406.18916v1", "repo": "null"}}