{"2502.13656": {"publish_time": "2025-02-19", "title": "Refining Sentence Embedding Model through Ranking Sentences Generation with Large Language Models", "paper_summary": "Sentence embedding is essential for many NLP tasks, with contrastive learning\nmethods achieving strong performance using annotated datasets like NLI. Yet,\nthe reliance on manual labels limits scalability. Recent studies leverage large\nlanguage models (LLMs) to generate sentence pairs, reducing annotation\ndependency. However, they overlook ranking information crucial for fine-grained\nsemantic distinctions. To tackle this challenge, we propose a method for\ncontrolling the generation direction of LLMs in the latent space. Unlike\nunconstrained generation, the controlled approach ensures meaningful semantic\ndivergence. Then, we refine exist sentence embedding model by integrating\nranking information and semantic information. Experiments on multiple\nbenchmarks demonstrate that our method achieves new SOTA performance with a\nmodest cost in ranking sentence synthesis.", "paper_summary_zh": "句子嵌入對於許多 NLP 任務來說至關重要，對比學習方法使用 NLI 等註解資料集來達成強大的效能。然而，依賴人工標籤會限制可擴充性。最近的研究利用大型語言模型 (LLM) 來產生句子對，減少標註的依賴性。然而，他們忽略了對於細緻語義區別至關重要的排名資訊。為了應對這個挑戰，我們提出一個在潛在空間中控制 LLM 產生方向的方法。與不受約束的產生不同，受控方法確保有意義的語義分歧。然後，我們透過整合排名資訊和語義資訊來改善現有的句子嵌入模型。在多個基準測試上的實驗顯示，我們的模型以適度的句子合成排名成本，達到了新的 SOTA 效能。", "author": "Liyang He et.al.", "authors": "Liyang He, Chenglong Liu, Rui Li, Zhenya Huang, Shulan Ruan, Jun Zhou, Enhong Chen", "id": "2502.13656v1", "paper_url": "http://arxiv.org/abs/2502.13656v1", "repo": "null"}}