{"2405.18009": {"publish_time": "2024-05-28", "title": "Exploring Context Window of Large Language Models via Decomposed Positional Vectors", "paper_summary": "Transformer-based large language models (LLMs) typically have a limited\ncontext window, resulting in significant performance degradation when\nprocessing text beyond the length of the context window. Extensive studies have\nbeen proposed to extend the context window and achieve length extrapolation of\nLLMs, but there is still a lack of in-depth interpretation of these approaches.\nIn this study, we explore the positional information within and beyond the\ncontext window for deciphering the underlying mechanism of LLMs. By using a\nmean-based decomposition method, we disentangle positional vectors from hidden\nstates of LLMs and analyze their formation and effect on attention.\nFurthermore, when texts exceed the context window, we analyze the change of\npositional vectors in two settings, i.e., direct extrapolation and context\nwindow extension. Based on our findings, we design two training-free context\nwindow extension methods, positional vector replacement and attention window\nextension. Experimental results show that our methods can effectively extend\nthe context window length.", "paper_summary_zh": "<paragraph>基於 Transformer 的大型語言模型 (LLM) 通常具有有限的上下文視窗，導致在處理超過上下文視窗長度的文字時，效能會顯著下降。已經提出許多研究來延伸上下文視窗並達成 LLM 的長度外推，但對於這些方法仍缺乏深入的詮釋。在這個研究中，我們探討了上下文視窗內外的位置資訊，以解碼 LLM 的底層機制。透過使用基於平均值的分解方法，我們將位置向量從 LLM 的隱藏狀態中解開，並分析它們的形成和對注意力的影響。此外，當文字超過上下文視窗時，我們分析了位置向量在兩種設定下的變化，即直接外推和上下文視窗延伸。根據我們的發現，我們設計了兩種無需訓練的上下文視窗延伸方法，位置向量替換和注意力視窗延伸。實驗結果顯示，我們的這些方法可以有效地延伸上下文視窗長度。</paragraph>", "author": "Zican Dong et.al.", "authors": "Zican Dong, Junyi Li, Xin Men, Wayne Xin Zhao, Bingbing Wang, Zhen Tian, Weipeng Chen, Ji-Rong Wen", "id": "2405.18009v1", "paper_url": "http://arxiv.org/abs/2405.18009v1", "repo": "null"}}