{"2406.04710": {"publish_time": "2024-06-07", "title": "Morescient GAI for Software Engineering", "paper_summary": "The ability of Generative AI (GAI) technology to automatically check,\nsynthesize and modify software engineering artifacts promises to revolutionize\nall aspects of software engineering. Using GAI for software engineering tasks\nis consequently one of the most rapidly expanding fields of software\nengineering research, with dozens of LLM-based code models having been\npublished since 2021. However, the overwhelming majority of existing code\nmodels share a major weakness - they are exclusively trained on the syntactic\nfacet of software, significantly lowering their trustworthiness in tasks\ndependent on software semantics. To address this problem, a new class of\n\"Morescient\" GAI is needed that is \"aware\" of (i.e., trained on) both the\nsemantic and static facets of software. This, in turn, will require a new\ngeneration of software observation platforms capable of generating ultra-large\nquantities of execution observations in a structured and readily analyzable\nway. In this paper, we present a vision for how such \"Morescient\" GAI models\ncan be engineered, evolved and disseminated according to the principles of open\nscience.", "paper_summary_zh": "生成式人工智能 (GAI) 技術自動檢查、綜合和修改軟體工程成品的能力，有望徹底改變軟體工程的各個方面。因此，將 GAI 用於軟體工程任務是軟體工程研究中發展最快速的領域之一，自 2021 年以來，已經發布了數十個基於 LLM 的程式碼模型。然而，絕大多數現有的程式碼模型有一個主要缺點 - 它們僅訓練於軟體的語法方面，這大大降低了它們在依賴軟體語義的任務中的可信度。為了解決這個問題，需要一種新的「莫爾」GAI，它「知道」(即訓練於) 軟體的語義和靜態方面。這反過來又需要新一代的軟體觀察平台，能夠以結構化且易於分析的方式產生大量的執行觀察。在本文中，我們提出了一個願景，說明如何根據開放科學的原則來設計、演化和傳播這樣的「莫爾」GAI 模型。", "author": "Marcus Kessel et.al.", "authors": "Marcus Kessel, Colin Atkinson", "id": "2406.04710v1", "paper_url": "http://arxiv.org/abs/2406.04710v1", "repo": "null"}}