{"2410.14578": {"publish_time": "2024-10-18", "title": "Large Language Models Are Overparameterized Text Encoders", "paper_summary": "Large language models (LLMs) demonstrate strong performance as text embedding\nmodels when finetuned with supervised contrastive training. However, their\nlarge size balloons inference time and memory requirements. In this paper, we\nshow that by pruning the last $p\\%$ layers of an LLM before supervised training\nfor only 1000 steps, we can achieve a proportional reduction in memory and\ninference time. We evaluate four different state-of-the-art LLMs on text\nembedding tasks and find that our method can prune up to 30\\% of layers with\nnegligible impact on performance and up to 80\\% with only a modest drop. With\nonly three lines of code, our method is easily implemented in any pipeline for\ntransforming LLMs to text encoders. We also propose $\\text{L}^3 \\text{Prune}$,\na novel layer-pruning strategy based on the model's initial loss that provides\ntwo optimal pruning configurations: a large variant with negligible performance\nloss and a small variant for resource-constrained settings. On average, the\nlarge variant prunes 21\\% of the parameters with a $-0.3$ performance drop, and\nthe small variant only suffers from a $-5.1$ decrease while pruning 74\\% of the\nmodel. We consider these results strong evidence that LLMs are\noverparameterized for text embedding tasks, and can be easily pruned.", "paper_summary_zh": "大型語言模型 (LLM) 在經過監督對比訓練微調後，展現出強大的文本嵌入模型效能。然而，它們的龐大規模會膨脹推論時間和記憶體需求。在本文中，我們展示出透過在監督訓練前修剪 LLM 的最後 $p\\%$ 層，僅進行 1000 個步驟，我們可以按比例減少記憶體和推論時間。我們在文本嵌入任務中評估了四種不同的最先進 LLM，並發現我們的模型可以修剪多達 30% 的層，對效能影響微乎其微，而修剪多達 80% 時效能僅略微下降。我們的模型僅需三行程式碼，便能輕鬆實作在任何將 LLM 轉換為文字編碼器的管道中。我們也提出 $\\text{L}^3 \\text{Prune}$，這是一種基於模型初始損失的新穎層修剪策略，可提供兩種最佳修剪配置：效能損失微乎其微的大型變體，以及適用於資源受限設定的小型變體。平均而言，大型變體修剪了 21% 的參數，效能下降 -0.3，而小型變體僅下降 -5.1，同時修剪了模型的 74%。我們認為這些結果有力地證明了 LLM 對於文本嵌入任務來說過度參數化，並且可以輕鬆地進行修剪。", "author": "Thennal D K et.al.", "authors": "Thennal D K, Tim Fischer, Chris Biemann", "id": "2410.14578v1", "paper_url": "http://arxiv.org/abs/2410.14578v1", "repo": "null"}}