{"2502.16868": {"publish_time": "2025-02-24", "title": "Graphy'our Data: Towards End-to-End Modeling, Exploring and Generating Report from Raw Data", "paper_summary": "Large Language Models (LLMs) have recently demonstrated remarkable\nperformance in tasks such as Retrieval-Augmented Generation (RAG) and\nautonomous AI agent workflows. Yet, when faced with large sets of unstructured\ndocuments requiring progressive exploration, analysis, and synthesis, such as\nconducting literature survey, existing approaches often fall short. We address\nthis challenge -- termed Progressive Document Investigation -- by introducing\nGraphy, an end-to-end platform that automates data modeling, exploration and\nhigh-quality report generation in a user-friendly manner. Graphy comprises an\noffline Scrapper that transforms raw documents into a structured graph of Fact\nand Dimension nodes, and an online Surveyor that enables iterative exploration\nand LLM-driven report generation. We showcase a pre-scrapped graph of over\n50,000 papers -- complete with their references -- demonstrating how Graphy\nfacilitates the literature-survey scenario. The demonstration video can be\nfound at https://youtu.be/uM4nzkAdGlM.", "paper_summary_zh": "大型語言模型 (LLM) 最近在檢索增強生成 (RAG) 和自主 AI 代理工作流程等任務中展現了卓越的效能。然而，在面對需要逐步探索、分析和綜合的大型非結構化文件集合時，例如進行文獻調查，現有的方法常常力不從心。我們透過引進 Graphy 來解決這個挑戰——稱為漸進式文件調查，Graphy 是一個端到端的平台，以使用者友善的方式自動化資料建模、探索和高品質報告生成。Graphy 包含一個離線 Scrapper，它將原始文件轉換成一個結構化的事實和維度節點圖形，以及一個線上 Surveyor，它能進行反覆探索和 LLM 驅動的報告生成。我們展示了一個預先刮取的超過 50,000 篇論文的圖形——連同它們的參考文獻——展示 Graphy 如何促進文獻調查場景。示範影片可以在 https://youtu.be/uM4nzkAdGlM 找到。", "author": "Longbin Lai et.al.", "authors": "Longbin Lai, Changwei Luo, Yunkai Lou, Mingchen Ju, Zhengyi Yang", "id": "2502.16868v1", "paper_url": "http://arxiv.org/abs/2502.16868v1", "repo": "null"}}