{"2407.03160": {"publish_time": "2024-07-03", "title": "SOS! Soft Prompt Attack Against Open-Source Large Language Models", "paper_summary": "Open-source large language models (LLMs) have become increasingly popular\namong both the general public and industry, as they can be customized,\nfine-tuned, and freely used. However, some open-source LLMs require approval\nbefore usage, which has led to third parties publishing their own easily\naccessible versions. Similarly, third parties have been publishing fine-tuned\nor quantized variants of these LLMs. These versions are particularly appealing\nto users because of their ease of access and reduced computational resource\ndemands. This trend has increased the risk of training time attacks,\ncompromising the integrity and security of LLMs. In this work, we present a new\ntraining time attack, SOS, which is designed to be low in computational demand\nand does not require clean data or modification of the model weights, thereby\nmaintaining the model's utility intact. The attack addresses security issues in\nvarious scenarios, including the backdoor attack, jailbreak attack, and prompt\nstealing attack. Our experimental findings demonstrate that the proposed attack\nis effective across all evaluated targets. Furthermore, we present the other\nside of our SOS technique, namely the copyright token -- a novel technique that\nenables users to mark their copyrighted content and prevent models from using\nit.", "paper_summary_zh": "開放原始碼大型語言模型 (LLM) 在一般大眾和產業之間變得越來越受歡迎，因為它們可以自訂、微調和免費使用。然而，有些開放原始碼 LLM 在使用前需要獲得批准，這導致第三方發布他們自己的容易存取版本。類似地，第三方已經發布這些 LLM 的微調或量化變體。這些版本特別吸引使用者，因為它們容易存取且降低了運算資源需求。這種趨勢增加了訓練時間攻擊的風險，危害了 LLM 的完整性和安全性。在這項工作中，我們提出了一種新的訓練時間攻擊 SOS，它被設計為運算需求低，且不需要乾淨的資料或修改模型權重，從而保持模型的效用完整。該攻擊解決了各種場景中的安全性問題，包括後門攻擊、越獄攻擊和提示竊取攻擊。我們的實驗結果證明，所提出的攻擊在所有評估目標中都是有效的。此外，我們提出了 SOS 技術的另一面，即版權令牌——一種創新的技術，使用戶可以標記他們的版權內容並防止模型使用它。", "author": "Ziqing Yang et.al.", "authors": "Ziqing Yang, Michael Backes, Yang Zhang, Ahmed Salem", "id": "2407.03160v1", "paper_url": "http://arxiv.org/abs/2407.03160v1", "repo": "null"}}