{"2405.03852": {"publish_time": "2024-05-06", "title": "VSA4VQA: Scaling a Vector Symbolic Architecture to Visual Question Answering on Natural Images", "paper_summary": "While Vector Symbolic Architectures (VSAs) are promising for modelling\nspatial cognition, their application is currently limited to artificially\ngenerated images and simple spatial queries. We propose VSA4VQA - a novel 4D\nimplementation of VSAs that implements a mental representation of natural\nimages for the challenging task of Visual Question Answering (VQA). VSA4VQA is\nthe first model to scale a VSA to complex spatial queries. Our method is based\non the Semantic Pointer Architecture (SPA) to encode objects in a\nhyperdimensional vector space. To encode natural images, we extend the SPA to\ninclude dimensions for object's width and height in addition to their spatial\nlocation. To perform spatial queries we further introduce learned spatial query\nmasks and integrate a pre-trained vision-language model for answering\nattribute-related questions. We evaluate our method on the GQA benchmark\ndataset and show that it can effectively encode natural images, achieving\ncompetitive performance to state-of-the-art deep learning methods for zero-shot\nVQA.", "paper_summary_zh": "雖然向量符號架構 (VSA) 對於建模空間認知很有前景，但其應用目前僅限於人工產生的圖像和簡單的空間查詢。我們提出 VSA4VQA - 一種 VSA 的新型 4D 實作，用於實作自然影像的心智表徵，以執行具挑戰性的視覺問答 (VQA) 任務。VSA4VQA 是第一個將 VSA 擴展到複雜空間查詢的模型。我們的做法建構於語意指標架構 (SPA)，用於在超維向量空間中編碼物件。為了編碼自然影像，我們將 SPA 延伸，除了空間位置外，還包括物件的寬度和高度維度。為了執行空間查詢，我們進一步引入已學習的空間查詢遮罩，並整合預先訓練好的視覺語言模型，以回答與屬性相關的問題。我們在 GQA 基準資料集上評估我們的做法，並顯示它可以有效地編碼自然影像，在零次學習 VQA 中達成與最先進的深度學習方法相近的效能。", "author": "Anna Penzkofer et.al.", "authors": "Anna Penzkofer, Lei Shi, Andreas Bulling", "id": "2405.03852v1", "paper_url": "http://arxiv.org/abs/2405.03852v1", "repo": "null"}}