{"2405.07317": {"publish_time": "2024-05-12", "title": "Machine Unlearning in Contrastive Learning", "paper_summary": "Machine unlearning is a complex process that necessitates the model to\ndiminish the influence of the training data while keeping the loss of accuracy\nto a minimum. Despite the numerous studies on machine unlearning in recent\nyears, the majority of them have primarily focused on supervised learning\nmodels, leaving research on contrastive learning models relatively\nunderexplored. With the conviction that self-supervised learning harbors a\npromising potential, surpassing or rivaling that of supervised learning, we set\nout to investigate methods for machine unlearning centered around contrastive\nlearning models. In this study, we introduce a novel gradient constraint-based\napproach for training the model to effectively achieve machine unlearning. Our\nmethod only necessitates a minimal number of training epochs and the\nidentification of the data slated for unlearning. Remarkably, our approach\ndemonstrates proficient performance not only on contrastive learning models but\nalso on supervised learning models, showcasing its versatility and adaptability\nin various learning paradigms.", "paper_summary_zh": "機器去學習是一個複雜的過程，需要模型在保持準確度損失最小化的同時，減少訓練資料的影響。儘管近年來機器去學習的研究很多，但大多數研究主要集中在監督式學習模型上，而對比學習模型的研究相對較少。我們確信自監督學習具有超越或匹敵監督學習的潛力，因此我們著手研究以對比學習模型為中心的機器去學習方法。在本研究中，我們引入了一種新的基於梯度約束的方法，用於訓練模型以有效實現機器去學習。我們的模型僅需要最少的訓練輪次和對需要去學習的資料進行識別。值得注意的是，我們的模型不僅在對比學習模型上展示了熟練的效能，而且在監督式學習模型上也表現出色，展示了其在各種學習範例中的多功能性和適應性。", "author": "Zixin Wang et.al.", "authors": "Zixin Wang, Kongyang Chen", "id": "2405.07317v1", "paper_url": "http://arxiv.org/abs/2405.07317v1", "repo": "null"}}