{"2412.10244": {"publish_time": "2024-12-13", "title": "Efficient Continual Pre-training of LLMs for Low-resource Languages", "paper_summary": "Open-source Large Language models (OsLLMs) propel the democratization of\nnatural language research by giving the flexibility to augment or update model\nparameters for performance improvement. Nevertheless, like proprietary LLMs,\nOs-LLMs offer poorer performance on low-resource languages (LRLs) than\nhigh-resource languages (HRLs), owing to smaller amounts of training data and\nunderrepresented vocabulary. On the other hand, continual pre-training (CPT)\nwith large amounts of language-specific data is a costly proposition in terms\nof data acquisition and computational resources. Our goal is to drastically\nreduce CPT cost. To that end, we first develop a new algorithm to select a\nsubset of texts from a larger corpus. We show the effectiveness of our\ntechnique using very little CPT data. In search of further improvement, we\ndesign a new algorithm to select tokens to include in the LLM vocabulary. We\nexperiment with the recent Llama-3 model and nine Indian languages with diverse\nscripts and extent of resource availability. For evaluation, we use\nIndicGenBench, a generation task benchmark dataset for Indic languages. We\nexperiment with various CPT corpora and augmented vocabulary size and offer\ninsights across language families.", "paper_summary_zh": "開放原始碼大型語言模型 (OsLLM) 推動自然語言研究的民主化，讓模型參數可以靈活地擴充或更新以提升效能。儘管如此，與專有 LLM 類似，由於訓練資料量較少且詞彙量不足，Os-LLM 在低資源語言 (LRL) 上的表現比高資源語言 (HRL) 差。另一方面，針對特定語言資料進行持續預訓練 (CPT) 在資料取得和運算資源方面是一項昂貴的提議。我們的目標是大幅降低 CPT 成本。為此，我們首先開發一種新演算法，從較大的語料庫中選取一個子集的文字。我們使用極少的 CPT 資料來展示我們技術的有效性。為了進一步改進，我們設計一種新演算法來選取要包含在 LLM 詞彙中的詞彙。我們使用最新的 Llama-3 模型和九種印度語言進行實驗，這些語言具有不同的文字系統和資源可用性程度。在評估方面，我們使用 IndicGenBench，這是一個針對印度語言的產生任務基準資料集。我們使用各種 CPT 語料庫和擴充的詞彙量進行實驗，並提供跨語言系列的見解。", "author": "Arijit Nag et.al.", "authors": "Arijit Nag, Soumen Chakrabarti, Animesh Mukherjee, Niloy Ganguly", "id": "2412.10244v1", "paper_url": "http://arxiv.org/abs/2412.10244v1", "repo": "null"}}