{"2410.08688": {"publish_time": "2024-10-11", "title": "Chain-of-Restoration: Multi-Task Image Restoration Models are Zero-Shot Step-by-Step Universal Image Restorers", "paper_summary": "Despite previous works typically targeting isolated degradation types, recent\nresearch has increasingly focused on addressing composite degradations which\ninvolve a complex interplay of multiple different isolated degradations.\nRecognizing the challenges posed by the exponential number of possible\ndegradation combinations, we propose Universal Image Restoration (UIR), a new\ntask setting that requires models to be trained on a set of degradation bases\nand then remove any degradation that these bases can potentially compose in a\nzero-shot manner. Inspired by the Chain-of-Thought which prompts LLMs to\naddress problems step-by-step, we propose the Chain-of-Restoration (CoR), which\ninstructs models to step-by-step remove unknown composite degradations. By\nintegrating a simple Degradation Discriminator into pre-trained multi-task\nmodels, CoR facilitates the process where models remove one degradation basis\nper step, continuing this process until the image is fully restored from the\nunknown composite degradation. Extensive experiments show that CoR\nsignificantly improves model performance in removing composite degradations,\nachieving results comparable to or surpassing those of State-of-The-Art (SoTA)\nmethods trained on all degradations. The code will be released at\nhttps://github.com/toummHus/Chain-of-Restoration.", "paper_summary_zh": "儘管先前的研究通常鎖定孤立的劣化類型，但最近的研究越來越專注於處理複合劣化，其中涉及多種不同孤立劣化之間的複雜交互作用。\n認知到指數級可能的劣化組合所帶來的挑戰，我們提出通用影像還原 (UIR)，這是一種新的任務設定，要求模型對一組劣化基礎進行訓練，然後以零次學習的方式移除這些基礎可能組成的任何劣化。\n受到思想鏈的啟發，思想鏈提示 LLM 逐步解決問題，我們提出還原鏈 (CoR)，它指示模型逐步移除未知的複合劣化。\n透過將簡單的劣化辨識器整合到預先訓練的多任務模型中，CoR 簡化了模型每一步移除一個劣化基礎的程序，持續這個程序，直到影像從未知的複合劣化中完全還原。\n廣泛的實驗顯示，CoR 大幅提升模型移除複合劣化時的效能，達到與訓練所有劣化時最先進 (SoTA) 方法相當或超越的結果。\n程式碼將在 https://github.com/toummHus/Chain-of-Restoration 發布。", "author": "Jin Cao et.al.", "authors": "Jin Cao, Deyu Meng, Xiangyong Cao", "id": "2410.08688v1", "paper_url": "http://arxiv.org/abs/2410.08688v1", "repo": "https://github.com/toummhus/chain-of-restoration"}}