{"2412.18091": {"publish_time": "2024-12-24", "title": "AutoSculpt: A Pattern-based Model Auto-pruning Framework Using Reinforcement Learning and Graph Learning", "paper_summary": "As deep neural networks (DNNs) are increasingly deployed on edge devices,\noptimizing models for constrained computational resources is critical. Existing\nauto-pruning methods face challenges due to the diversity of DNN models,\nvarious operators (e.g., filters), and the difficulty in balancing pruning\ngranularity with model accuracy. To address these limitations, we introduce\nAutoSculpt, a pattern-based automated pruning framework designed to enhance\nefficiency and accuracy by leveraging graph learning and deep reinforcement\nlearning (DRL). AutoSculpt automatically identifies and prunes regular patterns\nwithin DNN architectures that can be recognized by existing inference engines,\nenabling runtime acceleration. Three key steps in AutoSculpt include: (1)\nConstructing DNNs as graphs to encode their topology and parameter\ndependencies, (2) embedding computationally efficient pruning patterns, and (3)\nutilizing DRL to iteratively refine auto-pruning strategies until the optimal\nbalance between compression and accuracy is achieved. Experimental results\ndemonstrate the effectiveness of AutoSculpt across various architectures,\nincluding ResNet, MobileNet, VGG, and Vision Transformer, achieving pruning\nrates of up to 90% and nearly 18% improvement in FLOPs reduction, outperforming\nall baselines. The codes can be available at\nhttps://anonymous.4open.science/r/AutoSculpt-DDA0", "paper_summary_zh": "随着深度神经网络 (DNN) 越来越多地部署在边缘设备上，针对受限计算资源优化模型至关重要。现有的自动剪枝方法由于 DNN 模型的多样性、各种运算符（例如过滤器）以及平衡剪枝粒度与模型准确性的难度而面临挑战。为了解决这些限制，我们引入了 AutoSculpt，这是一个基于模式的自动剪枝框架，旨在通过利用图学习和深度强化学习 (DRL) 来提高效率和准确性。AutoSculpt 自动识别和剪枝 DNN 架构中的规则模式，这些模式可以被现有的推理引擎识别，从而实现运行时加速。AutoSculpt 中的三个关键步骤包括：(1) 将 DNN 构建为图以编码其拓扑和参数依赖关系，(2) 嵌入计算高效的剪枝模式，以及 (3) 利用 DRL 迭代优化自动剪枝策略，直到实现压缩和准确性之间的最佳平衡。实验结果证明了 AutoSculpt 在各种架构（包括 ResNet、MobileNet、VGG 和 Vision Transformer）中的有效性，实现了高达 90% 的剪枝率和近 18% 的 FLOP 减少改进，优于所有基线。代码可在 https://anonymous.4open.science/r/AutoSculpt-DDA0 获得", "author": "Lixian Jing et.al.", "authors": "Lixian Jing, Jianpeng Qi, Junyu Dong, Yanwei Yu", "id": "2412.18091v1", "paper_url": "http://arxiv.org/abs/2412.18091v1", "repo": "null"}}