{"2406.19371": {"publish_time": "2024-06-27", "title": "Suri: Multi-constraint Instruction Following for Long-form Text Generation", "paper_summary": "Existing research on instruction following largely focuses on tasks with\nsimple instructions and short responses. In this work, we explore\nmulti-constraint instruction following for generating long-form text. We create\nSuri, a dataset with 20K human-written long-form texts paired with\nLLM-generated backtranslated instructions that contain multiple complex\nconstraints. Because of prohibitive challenges associated with collecting human\npreference judgments on long-form texts, preference-tuning algorithms such as\nDPO are infeasible in our setting; thus, we propose Instructional ORPO\n(I-ORPO), an alignment method based on the ORPO algorithm. Instead of receiving\nnegative feedback from dispreferred responses, I-ORPO obtains negative feedback\nfrom synthetically corrupted instructions generated by an LLM. Using Suri, we\nperform supervised and I-ORPO fine-tuning on Mistral-7b-Instruct-v0.2. The\nresulting models, Suri-SFT and Suri-I-ORPO, generate significantly longer texts\n(~5K tokens) than base models without significant quality deterioration. Our\nhuman evaluation shows that while both SFT and I-ORPO models satisfy most\nconstraints, Suri-I-ORPO generations are generally preferred for their coherent\nand informative incorporation of the constraints. We release our code at\nhttps://github.com/chtmp223/suri.", "paper_summary_zh": "現有的指令遵循研究主要集中在具有簡單指令和簡短回應的任務上。在這項工作中，我們探索多重約束指令，以產生長篇文字。我們創建了 Suri，一個包含 20K 人工撰寫長篇文字的資料集，並配對包含多重複雜約束的 LLM 生成的反向翻譯指令。由於與收集長篇文字的人類偏好判斷相關的挑戰性，因此在我們的設定中，偏好調整演算法（例如 DPO）不可行；因此，我們提出了基於 ORPO 演算法的對齊方法，即指令性 ORPO (I-ORPO)。I-ORPO 沒有從不受歡迎的回應中接收負面回饋，而是從由 LLM 生成的合成損壞指令中獲得負面回饋。使用 Suri，我們對 Mistral-7b-Instruct-v0.2 執行監督和 I-ORPO 微調。最終模型 Suri-SFT 和 Suri-I-ORPO 生成的文字比基本模型顯著更長（~5K 個符號），而品質沒有顯著下降。我們的人類評估顯示，雖然 SFT 和 I-ORPO 模型都滿足大多數約束，但 Suri-I-ORPO 生成的文字通常因其相干且具資訊性的約束納入而受到偏好。我們在 https://github.com/chtmp223/suri/ 發布我們的程式碼。", "author": "Chau Minh Pham et.al.", "authors": "Chau Minh Pham, Simeng Sun, Mohit Iyyer", "id": "2406.19371v1", "paper_url": "http://arxiv.org/abs/2406.19371v1", "repo": "https://github.com/chtmp223/suri"}}