{"2501.13710": {"publish_time": "2025-01-23", "title": "YOLO11-JDE: Fast and Accurate Multi-Object Tracking with Self-Supervised Re-ID", "paper_summary": "We introduce YOLO11-JDE, a fast and accurate multi-object tracking (MOT)\nsolution that combines real-time object detection with self-supervised\nRe-Identification (Re-ID). By incorporating a dedicated Re-ID branch into\nYOLO11s, our model performs Joint Detection and Embedding (JDE), generating\nappearance features for each detection. The Re-ID branch is trained in a fully\nself-supervised setting while simultaneously training for detection,\neliminating the need for costly identity-labeled datasets. The triplet loss,\nwith hard positive and semi-hard negative mining strategies, is used for\nlearning discriminative embeddings. Data association is enhanced with a custom\ntracking implementation that successfully integrates motion, appearance, and\nlocation cues. YOLO11-JDE achieves competitive results on MOT17 and MOT20\nbenchmarks, surpassing existing JDE methods in terms of FPS and using up to ten\ntimes fewer parameters. Thus, making our method a highly attractive solution\nfor real-world applications.", "paper_summary_zh": "我們引入了 YOLO11-JDE，這是一種快速且準確的多目標追蹤 (MOT) 解决方案，它結合了即時物件偵測與自我監督的重新辨識 (Re-ID)。透過將專用的 Re-ID 分支整合到 YOLO11s，我們的模型執行聯合偵測和嵌入 (JDE)，為每個偵測產生外觀特徵。Re-ID 分支在完全自我監督的設定中訓練，同時訓練偵測，消除了對昂貴身分標籤資料集的需求。三重損失，採用硬正例和半硬負例挖掘策略，用於學習判別式嵌入。資料關聯透過自訂追蹤實作增強，該實作成功整合了動作、外觀和位置線索。YOLO11-JDE 在 MOT17 和 MOT20 基準上取得了具有競爭力的結果，在 FPS 方面超越了現有的 JDE 方法，並且使用的參數減少了多達十倍。因此，使我們的模型成為現實世界應用中極具吸引力的解決方案。", "author": "Iñaki Erregue et.al.", "authors": "Iñaki Erregue, Kamal Nasrollahi, Sergio Escalera", "id": "2501.13710v1", "paper_url": "http://arxiv.org/abs/2501.13710v1", "repo": "null"}}