{"2407.18749": {"publish_time": "2024-07-26", "title": "Multi-Robot System Architecture design in SysML and BPMN", "paper_summary": "Multi-Robot System (MRS) is a complex system that contains many different\nsoftware and hardware components. This main problem addressed in this article\nis the MRS design complexity. The proposed solution provides a modular modeling\nand simulation technique that is based on formal system engineering method,\ntherefore the MRS design complexity is decomposed and reduced. Modeling the MRS\nhas been achieved via two formal Architecture Description Languages (ADLs),\nwhich are Systems Modeling Language (SysML) and Business Process Model and\nNotation (BPMN), to design the system blueprints. By using those abstract\ndesign ADLs, the implementation of the project becomes technology agnostic.\nThis allows to transfer the design concept from on programming language to\nanother. During the simulation phase, a multi-agent environment is used to\nsimulate the MRS blueprints. The simulation has been implemented in Java Agent\nDevelopment (JADE) middleware. Therefore, its results can be used to analysis\nand verify the proposed MRS model in form of performance evaluation matrix.", "paper_summary_zh": "多機器人系統 (MRS) 是一個複雜的系統，包含許多不同的軟體和硬體元件。本文探討的主要問題是 MRS 設計的複雜性。所提出的解決方案提供一種模組化建模和模擬技術，該技術基於正式的系統工程方法，因此 MRS 設計的複雜性被分解和降低。MRS 的建模已透過兩種正式的架構描述語言 (ADL) 來實現，分別是系統建模語言 (SysML) 和商業流程模型與標記法 (BPMN)，以設計系統藍圖。透過使用這些抽象設計 ADL，專案的實作變得與技術無關。這允許將設計概念從一種程式語言轉移到另一種程式語言。在模擬階段，會使用多代理環境來模擬 MRS 藍圖。模擬已在 Java Agent Development (JADE) 中介軟體中實作。因此，其結果可用於以效能評估矩陣的形式分析和驗證所提出的 MRS 模型。", "author": "Ahmed R. Sadik et.al.", "authors": "Ahmed R. Sadik, Christian Goerick", "id": "2407.18749v1", "paper_url": "http://arxiv.org/abs/2407.18749v1", "repo": "null"}}