{"2412.09993": {"publish_time": "2024-12-13", "title": "A Comparative Study of LLMs, NMT Models, and Their Combination in Persian-English Idiom Translation", "paper_summary": "Large language models (LLMs) have shown superior capabilities in translating\nfigurative language compared to neural machine translation (NMT) systems.\nHowever, the impact of different prompting methods and LLM-NMT combinations on\nidiom translation has yet to be thoroughly investigated. This paper introduces\ntwo parallel datasets of sentences containing idiomatic expressions for\nPersian$\\rightarrow$English and English$\\rightarrow$Persian translations, with\nPersian idioms sampled from our PersianIdioms resource, a collection of 2,200\nidioms and their meanings. Using these datasets, we evaluate various open- and\nclosed-source LLMs, NMT models, and their combinations. Translation quality is\nassessed through idiom translation accuracy and fluency. We also find that\nautomatic evaluation methods like LLM-as-a-judge, BLEU and BERTScore are\neffective for comparing different aspects of model performance. Our experiments\nreveal that Claude-3.5-Sonnet delivers outstanding results in both translation\ndirections. For English$\\rightarrow$Persian, combining weaker LLMs with Google\nTranslate improves results, while Persian$\\rightarrow$English translations\nbenefit from single prompts for simpler models and complex prompts for advanced\nones.", "paper_summary_zh": "大型語言模型 (LLM) 在翻譯比喻語言方面展現出比神經機器翻譯 (NMT) 系統更優越的能力。\n然而，不同的提示方法和 LLM-NMT 組合對慣用語翻譯的影響尚未得到徹底研究。本文介紹了兩個包含慣用語句子的平行數據集，用於波斯語$\\rightarrow$英語和英語$\\rightarrow$波斯語翻譯，其中波斯語慣用語取樣自我們的 PersianIdioms 資源，該資源收集了 2,200 個慣用語及其含義。使用這些數據集，我們評估了各種開源和閉源 LLM、NMT 模型及其組合。翻譯品質通過慣用語翻譯準確度和流暢度進行評估。我們還發現，像 LLM-as-a-judge、BLEU 和 BERTScore 等自動評估方法對於比較模型效能的不同方面是有效的。我們的實驗表明，Claude-3.5-Sonnet 在兩個翻譯方向上都提供了傑出的結果。對於英語$\\rightarrow$波斯語，將較弱的 LLM 與 Google Translate 結合起來可以改善結果，而波斯語$\\rightarrow$英語翻譯則受益於較簡單模型的單一提示和較高級模型的複雜提示。", "author": "Sara Rezaeimanesh et.al.", "authors": "Sara Rezaeimanesh, Faezeh Hosseini, Yadollah Yaghoobzadeh", "id": "2412.09993v1", "paper_url": "http://arxiv.org/abs/2412.09993v1", "repo": "null"}}