{"2411.01738": {"publish_time": "2024-11-04", "title": "xDiT: an Inference Engine for Diffusion Transformers (DiTs) with Massive Parallelism", "paper_summary": "Diffusion models are pivotal for generating high-quality images and videos.\nInspired by the success of OpenAI's Sora, the backbone of diffusion models is\nevolving from U-Net to Transformer, known as Diffusion Transformers (DiTs).\nHowever, generating high-quality content necessitates longer sequence lengths,\nexponentially increasing the computation required for the attention mechanism,\nand escalating DiTs inference latency. Parallel inference is essential for\nreal-time DiTs deployments, but relying on a single parallel method is\nimpractical due to poor scalability at large scales. This paper introduces\nxDiT, a comprehensive parallel inference engine for DiTs. After thoroughly\ninvestigating existing DiTs parallel approaches, xDiT chooses Sequence Parallel\n(SP) and PipeFusion, a novel Patch-level Pipeline Parallel method, as\nintra-image parallel strategies, alongside CFG parallel for inter-image\nparallelism. xDiT can flexibly combine these parallel approaches in a hybrid\nmanner, offering a robust and scalable solution. Experimental results on two\n8xL40 GPUs (PCIe) nodes interconnected by Ethernet and an 8xA100 (NVLink) node\nshowcase xDiT's exceptional scalability across five state-of-the-art DiTs.\nNotably, we are the first to demonstrate DiTs scalability on Ethernet-connected\nGPU clusters. xDiT is available at https://github.com/xdit-project/xDiT.", "paper_summary_zh": "擴散模型對於生成高品質影像和影片至關重要。\n受 OpenAI 的 Sora 成功啟發，擴散模型的骨幹從 U-Net 演進到 Transformer，稱為擴散 Transformer（DiT）。\n然而，生成高品質內容需要更長的序列長度，這會使注意力機制所需的運算呈指數成長，並增加 DiT 推論延遲。並行推論對於 DiT 的即時部署至關重要，但由於在大型規模下可擴充性不佳，因此依賴單一並行方法並不實際。本文介紹 xDiT，這是一個 DiT 的全面並行推論引擎。在徹底調查現有的 DiT 並行方法後，xDiT 選擇序列並行（SP）和 PipeFusion，這是一種新穎的區塊級管道並行方法，作為影像內並行策略，以及 CFG 並行作為影像間並行。xDiT 可以靈活地以混合方式結合這些並行方法，提供強健且可擴充的解決方案。在兩個透過乙太網路互連的 8xL40 GPU（PCIe）節點和一個 8xA100（NVLink）節點上的實驗結果展示了 xDiT 在五個最先進的 DiT 上的出色可擴充性。值得注意的是，我們是第一個展示 DiT 在乙太網路連接的 GPU 集群上可擴充性的人。xDiT 可在 https://github.com/xdit-project/xDiT 取得。", "author": "Jiarui Fang et.al.", "authors": "Jiarui Fang, Jinzhe Pan, Xibo Sun, Aoyu Li, Jiannan Wang", "id": "2411.01738v1", "paper_url": "http://arxiv.org/abs/2411.01738v1", "repo": "https://github.com/xdit-project/xdit"}}