{"2407.16997": {"publish_time": "2024-07-24", "title": "Revisiting Who's Harry Potter: Towards Targeted Unlearning from a Causal Intervention Perspective", "paper_summary": "This paper investigates Who's Harry Potter (WHP), a pioneering yet\ninsufficiently understood method for LLM unlearning. We explore it in two\nsteps. First, we introduce a new task of LLM targeted unlearning, where given\nan unlearning target (e.g., a person) and some unlearning documents, we aim to\nunlearn only the information about the target, rather than everything in the\nunlearning documents. We further argue that a successful unlearning should\nsatisfy criteria such as not outputting gibberish, not fabricating facts about\nthe unlearning target, and not releasing factual information under jailbreak\nattacks. Second, we construct a causal intervention framework for targeted\nunlearning, where the knowledge of the unlearning target is modeled as a\nconfounder between LLM input and output, and the unlearning process as a\ndeconfounding process. This framework justifies and extends WHP, deriving a\nsimple unlearning algorithm that includes WHP as a special case. Experiments on\nexisting and new datasets show that our approach, without explicitly optimizing\nfor the aforementioned criteria, achieves competitive performance in all of\nthem. Our code is available at\nhttps://github.com/UCSB-NLP-Chang/causal_unlearn.git.", "paper_summary_zh": "這篇論文探討了「哈利波特是誰」(WHP)，一種開創性但理解不足的 LLM 遺忘方法。我們分兩步探討它。首先，我們介紹 LLM 目標遺忘的新任務，其中給定一個遺忘目標（例如，一個人）和一些遺忘文件，我們的目標是只遺忘有關目標的資訊，而不是遺忘文件中的一切。我們進一步論證，成功的遺忘應該滿足某些標準，例如不輸出無意義的文字、不捏造有關遺忘目標的事實，以及在越獄攻擊下不釋出事實資訊。其次，我們構建了一個針對性遺忘的因果介入架構，其中遺忘目標的知識被建模為 LLM 輸入和輸出之間的混淆因子，而遺忘過程則作為一個去混淆過程。這個架構證明並延伸了 WHP，推導出一個簡單的遺忘演算法，其中 WHP 是特殊情況。在現有和新的資料集上的實驗表明，我們的做法在不針對上述標準進行明確最佳化的情況下，在所有標準中都取得了有競爭力的表現。我們的程式碼可在 https://github.com/UCSB-NLP-Chang/causal_unlearn.git 取得。", "author": "Yujian Liu et.al.", "authors": "Yujian Liu, Yang Zhang, Tommi Jaakkola, Shiyu Chang", "id": "2407.16997v1", "paper_url": "http://arxiv.org/abs/2407.16997v1", "repo": "https://github.com/ucsb-nlp-chang/causal_unlearn"}}