{"2407.09012": {"publish_time": "2024-07-12", "title": "TCAN: Animating Human Images with Temporally Consistent Pose Guidance using Diffusion Models", "paper_summary": "Pose-driven human-image animation diffusion models have shown remarkable\ncapabilities in realistic human video synthesis. Despite the promising results\nachieved by previous approaches, challenges persist in achieving temporally\nconsistent animation and ensuring robustness with off-the-shelf pose detectors.\nIn this paper, we present TCAN, a pose-driven human image animation method that\nis robust to erroneous poses and consistent over time. In contrast to previous\nmethods, we utilize the pre-trained ControlNet without fine-tuning to leverage\nits extensive pre-acquired knowledge from numerous pose-image-caption pairs. To\nkeep the ControlNet frozen, we adapt LoRA to the UNet layers, enabling the\nnetwork to align the latent space between the pose and appearance features.\nAdditionally, by introducing an additional temporal layer to the ControlNet, we\nenhance robustness against outliers of the pose detector. Through the analysis\nof attention maps over the temporal axis, we also designed a novel temperature\nmap leveraging pose information, allowing for a more static background.\nExtensive experiments demonstrate that the proposed method can achieve\npromising results in video synthesis tasks encompassing various poses, like\nchibi. Project Page: https://eccv2024tcan.github.io/", "paper_summary_zh": "<paragraph>以姿勢為主的圖像動畫擴散模型在逼真的影片合成中展現出非凡的能力。儘管先前的技術已獲得可觀的成果，但仍面臨著在時間上保持動畫一致性，以及確保與現成的姿勢檢測器相容的挑戰。在本文中，我們提出了 TCAN，這是一種對錯誤姿勢具有魯棒性且隨著時間保持一致的姿勢驅動人像動畫方法。與先前的技術不同，我們利用預先訓練的 ControlNet，而無需微調，以利用其從大量姿勢-圖像-標題對中獲得的豐富預先獲取的知識。為了使 ControlNet 保持凍結，我們將 LoRA 調整到 UNet 層，使網路能夠在姿勢和外觀特徵之間對齊潛在空間。此外，透過在 ControlNet 中引入一個額外的時間層，我們增強了對姿勢檢測器異常值的魯棒性。透過對時間軸上的注意力圖進行分析，我們還設計了一種利用姿勢資訊的新型溫度圖，允許更靜態的背景。大量的實驗證明，所提出的方法可以在涵蓋各種姿勢（如 chibi）的影片合成任務中獲得有希望的結果。專案頁面：https://eccv2024tcan.github.io/</paragraph>", "author": "Jeongho Kim et.al.", "authors": "Jeongho Kim, Min-Jung Kim, Junsoo Lee, Jaegul Choo", "id": "2407.09012v1", "paper_url": "http://arxiv.org/abs/2407.09012v1", "repo": "null"}}