{"2406.02462": {"publish_time": "2024-06-04", "title": "Learning Image Priors through Patch-based Diffusion Models for Solving Inverse Problems", "paper_summary": "Diffusion models can learn strong image priors from underlying data\ndistribution and use them to solve inverse problems, but the training process\nis computationally expensive and requires lots of data. Such bottlenecks\nprevent most existing works from being feasible for high-dimensional and\nhigh-resolution data such as 3D images. This paper proposes a method to learn\nan efficient data prior for the entire image by training diffusion models only\non patches of images. Specifically, we propose a patch-based position-aware\ndiffusion inverse solver, called PaDIS, where we obtain the score function of\nthe whole image through scores of patches and their positional encoding and\nutilize this as the prior for solving inverse problems. First of all, we show\nthat this diffusion model achieves an improved memory efficiency and data\nefficiency while still maintaining the capability to generate entire images via\npositional encoding. Additionally, the proposed PaDIS model is highly flexible\nand can be plugged in with different diffusion inverse solvers (DIS). We\ndemonstrate that the proposed PaDIS approach enables solving various inverse\nproblems in both natural and medical image domains, including CT\nreconstruction, deblurring, and superresolution, given only patch-based priors.\nNotably, PaDIS outperforms previous DIS methods trained on entire image priors\nin the case of limited training data, demonstrating the data efficiency of our\nproposed approach by learning patch-based prior.", "paper_summary_zh": "扩散模型可以从底层数据分布中学习强图像先验，并利用它们来解决逆问题，但训练过程在计算上很昂贵，需要大量数据。此类瓶颈阻碍了大多数现有工作对高维和高分辨率数据（例如 3D 图像）的可行性。本文提出了一种方法，仅通过训练图像的块来学习整个图像的有效数据先验，以扩散模型。具体来说，我们提出了一个基于块的位置感知扩散逆求解器，称为 PaDIS，其中我们通过块及其位置编码获得整个图像的分数函数，并将其用作解决逆问题的先验。首先，我们表明该扩散模型实现了改进的内存效率和数据效率，同时仍保持通过位置编码生成整个图像的能力。此外，提出的 PaDIS 模型非常灵活，可以插入不同的扩散逆求解器 (DIS)。我们证明了所提出的 PaDIS 方法能够解决自然和医学图像域中的各种逆问题，包括 CT 重建、去模糊和超分辨率，仅给出基于块的先验。值得注意的是，在训练数据有限的情况下，PaDIS 优于以前在整个图像先验上训练的 DIS 方法，证明了我们提出的方法通过学习基于块的先验的数据效率。", "author": "Jason Hu et.al.", "authors": "Jason Hu, Bowen Song, Xiaojian Xu, Liyue Shen, Jeffrey A. Fessler", "id": "2406.02462v1", "paper_url": "http://arxiv.org/abs/2406.02462v1", "repo": "null"}}