{"2410.06949": {"publish_time": "2024-10-09", "title": "Seeker: Enhancing Exception Handling in Code with LLM-based Multi-Agent Approach", "paper_summary": "In real world software development, improper or missing exception handling\ncan severely impact the robustness and reliability of code. Exception handling\nmechanisms require developers to detect, capture, and manage exceptions\naccording to high standards, but many developers struggle with these tasks,\nleading to fragile code. This problem is particularly evident in open source\nprojects and impacts the overall quality of the software ecosystem. To address\nthis challenge, we explore the use of large language models (LLMs) to improve\nexception handling in code. Through extensive analysis, we identify three key\nissues: Insensitive Detection of Fragile Code, Inaccurate Capture of Exception\nTypes, and Distorted Handling Solutions. These problems are widespread across\nreal world repositories, suggesting that robust exception handling practices\nare often overlooked or mishandled. In response, we propose Seeker, a multi\nagent framework inspired by expert developer strategies for exception handling.\nSeeker uses agents: Scanner, Detector, Predator, Ranker, and Handler to assist\nLLMs in detecting, capturing, and resolving exceptions more effectively. Our\nwork is the first systematic study on leveraging LLMs to enhance exception\nhandling practices, providing valuable insights for future improvements in code\nreliability.", "paper_summary_zh": "在現實世界的軟體開發中，不當或遺失的例外處理\n可能會嚴重影響程式碼的健全性和可靠性。例外處理\n機制要求開發人員根據高標準偵測、擷取和管理例外，但許多開發人員在這些任務上苦苦掙扎，\n導致程式碼脆弱。這個問題在開源專案中特別明顯，並影響軟體生態系統的整體品質。為了應對\n這個挑戰，我們探討使用大型語言模型 (LLM) 來改善程式碼中的例外處理。透過廣泛的分析，我們找出三個關鍵\n問題：脆弱程式碼的不敏感偵測、例外類型的錯誤擷取，以及扭曲的處理解決方案。這些問題在\n現實世界的儲存庫中很普遍，這表示健全的例外處理實務通常被忽略或處理不當。為了解決這個問題，我們提出 Seeker，一個多\n代理架構，靈感來自專家開發人員的例外處理策略。Seeker 使用代理：掃描器、偵測器、掠奪者、排名器和處理器來協助\nLLM 更有效地偵測、擷取和解決例外。我們的研究是第一個系統性研究，利用 LLM 來增強例外\n處理實務，為程式碼可靠性的未來改善提供有價值的見解。", "author": "Xuanming Zhang et.al.", "authors": "Xuanming Zhang, Yuxuan Chen, Yuan Yuan, Minlie Huang", "id": "2410.06949v1", "paper_url": "http://arxiv.org/abs/2410.06949v1", "repo": "https://github.com/XMZhangAI/Seeker"}}