{"2410.16135": {"publish_time": "2024-10-21", "title": "Beyond 2:4: exploring V:N:M sparsity for efficient transformer inference on GPUs", "paper_summary": "To date, 2:4 sparsity has stood as the only sparse pattern that can be\naccelerated using sparse tensor cores on GPUs. In practice, 2:4 sparsity often\npossesses low actual speedups ($\\leq 1.3$) and requires fixed sparse ratios,\nmeaning that other ratios, such as 4:8, 8:16, or those exceeding 50% sparsity,\ndo not incur any speedups on GPUs. Recent studies suggest that V:N:M sparsity\nis promising in addressing these limitations of 2:4 sparsity. However,\nregarding accuracy, the effects of V:N:M sparsity on broader Transformer\nmodels, such as vision Transformers and large language models (LLMs), are\nlargely unexamined. Moreover, Some specific issues related to V:N:M sparsity,\nsuch as how to select appropriate V and M values, remain unresolved. In this\nstudy, we thoroughly investigate the application of V:N:M sparsity in vision\nmodels and LLMs across multiple tasks, from pertaining to downstream tasks. We\npropose three key approaches to enhance the applicability and accuracy of\nV:N:M-sparse Transformers, including heuristic V and M selection,\nV:N:M-specific channel permutation, and three-staged LoRA training techniques.\nExperimental results show that, with our methods, the DeiT-small achieves\nlossless accuracy at 64:2:5 sparsity, while the DeiT-base maintains accuracy\neven at 64:2:8 sparsity. In addition, the fine-tuned LLama2-7B at 64:2:5\nsparsity performs comparably or better than training-free 2:4 sparse\nalternatives on downstream tasks. More importantly, V:N:M-sparse Transformers\noffer a wider range of speedup-accuracy trade-offs compared to 2:4 sparsity.\nOverall, our exploration largely facilitates the V:N:M sparsity to act as a\ntruly effective acceleration solution for Transformers in cost-sensitive\ninference scenarios.", "paper_summary_zh": "迄今为止，2:4 稀疏性一直是唯一可以使用 GPU 上的稀疏张量核加速的稀疏模式。在实践中，2:4 稀疏性通常具有较低的实际加速（≤ 1.3），并且需要固定的稀疏比率，这意味着其他比率，例如 4:8、8:16 或超过 50% 稀疏性的比率，不会在 GPU 上产生任何加速。最近的研究表明，V:N:M 稀疏性有望解决 2:4 稀疏性的这些限制。然而，在准确性方面，V:N:M 稀疏性对更广泛的 Transformer 模型（例如视觉 Transformer 和大型语言模型 (LLM)）的影响在很大程度上尚未得到检验。此外，与 V:N:M 稀疏性相关的一些具体问题，例如如何选择合适的 V 和 M 值，仍然没有得到解决。在这项研究中，我们彻底研究了 V:N:M 稀疏性在视觉模型和 LLM 中的应用，涵盖从属于下游任务的多个任务。我们提出了三种关键方法来增强 V:N:M 稀疏 Transformer 的适用性和准确性，包括启发式 V 和 M 选择、V:N:M 特定通道置换和三阶段 LoRA 训练技术。实验结果表明，使用我们的方法，DeiT-small 在 64:2:5 稀疏性下实现了无损准确性，而 DeiT-base 即使在 64:2:8 稀疏性下也能保持准确性。此外，在 64:2:5 稀疏性下微调的 LLama2-7B 在下游任务上的表现与无训练 2:4 稀疏替代方案相当或更好。更重要的是，与 2:4 稀疏性相比，V:N:M 稀疏 Transformer 提供了更广泛的加速精度权衡。总体而言，我们的探索极大地促进了 V:N:M 稀疏性作为成本敏感型推理场景中 Transformer 的真正有效的加速解决方案。", "author": "Kang Zhao et.al.", "authors": "Kang Zhao, Tao Yuan, Han Bao, Zhenfeng Su, Chang Gao, Zhaofeng Sun, Zichen Liang, Liping Jing, Jianfei Chen", "id": "2410.16135v1", "paper_url": "http://arxiv.org/abs/2410.16135v1", "repo": "null"}}