{"2411.01292": {"publish_time": "2024-11-02", "title": "Causal reasoning in difference graphs", "paper_summary": "In epidemiology, understanding causal mechanisms across different populations\nis essential for designing effective public health interventions. Recently,\ndifference graphs have been introduced as a tool to visually represent causal\nvariations between two distinct populations. While there has been progress in\ninferring these graphs from data through causal discovery methods, there\nremains a gap in systematically leveraging their potential to enhance causal\nreasoning. This paper addresses that gap by establishing conditions for\nidentifying causal changes and effects using difference graphs and\nobservational data. It specifically focuses on identifying total causal changes\nand total effects in a nonparametric framework, as well as direct causal\nchanges and direct effects in a linear context. In doing so, it provides a\nnovel approach to causal reasoning that holds potential for various public\nhealth applications.", "paper_summary_zh": "在流行病學中，了解不同人群之間的因果機制對於設計有效的公共衛生干預措施至關重要。最近，差異圖表已被引入作為一種工具，用於直觀地表示兩個不同人群之間的因果變化。儘管通過因果發現方法從數據中推斷這些圖表方面取得了進展，但在系統性地利用其增強因果推理的潛力方面仍然存在差距。本文通過建立使用差異圖表和觀察數據識別因果變化和因果效應的條件來解決這一差距。它特別側重於在非參數框架中識別總因果變化和總效應，以及在線性背景中識別直接因果變化和直接效應。這樣一來，它提供了一種因果推理的新方法，對各種公共衛生應用具有潛力。", "author": "Charles K. Assaad et.al.", "authors": "Charles K. Assaad", "id": "2411.01292v1", "paper_url": "http://arxiv.org/abs/2411.01292v1", "repo": "null"}}