{"2406.11833": {"publish_time": "2024-06-17", "title": "MMDU: A Multi-Turn Multi-Image Dialog Understanding Benchmark and Instruction-Tuning Dataset for LVLMs", "paper_summary": "Generating natural and meaningful responses to communicate with multi-modal\nhuman inputs is a fundamental capability of Large Vision-Language\nModels(LVLMs). While current open-source LVLMs demonstrate promising\nperformance in simplified scenarios such as single-turn single-image input,\nthey fall short in real-world conversation scenarios such as following\ninstructions in a long context history with multi-turn and multi-images.\nExisting LVLM benchmarks primarily focus on single-choice questions or\nshort-form responses, which do not adequately assess the capabilities of LVLMs\nin real-world human-AI interaction applications. Therefore, we introduce MMDU,\na comprehensive benchmark, and MMDU-45k, a large-scale instruction tuning\ndataset, designed to evaluate and improve LVLMs' abilities in multi-turn and\nmulti-image conversations. We employ the clustering algorithm to ffnd the\nrelevant images and textual descriptions from the open-source Wikipedia and\nconstruct the question-answer pairs by human annotators with the assistance of\nthe GPT-4o model. MMDU has a maximum of 18k image+text tokens, 20 images, and\n27 turns, which is at least 5x longer than previous benchmarks and poses\nchallenges to current LVLMs. Our in-depth analysis of 15 representative LVLMs\nusing MMDU reveals that open-source LVLMs lag behind closed-source counterparts\ndue to limited conversational instruction tuning data. We demonstrate that\nffne-tuning open-source LVLMs on MMDU-45k signiffcantly address this gap,\ngenerating longer and more accurate conversations, and improving scores on MMDU\nand existing benchmarks (MMStar: +1.1%, MathVista: +1.5%, ChartQA:+1.2%). Our\ncontributions pave the way for bridging the gap between current LVLM models and\nreal-world application demands. This project is available at\nhttps://github.com/Liuziyu77/MMDU.", "paper_summary_zh": "生成自然且有意義的回應，與多模態人類輸入進行溝通，是大型視覺語言模型 (LVLMs) 的基本能力。雖然目前的開源 LVLMs 在簡化的場景中展現出有希望的表現，例如單次輪換單一影像輸入，但它們在現實世界的對話場景中卻表現不佳，例如在具有多輪換和多影像的長語境歷史中遵循指示。現有的 LVLM 基準主要關注單選題或短篇回應，這並不能充分評估 LVLMs 在現實世界的人工智慧互動應用中的能力。因此，我們引入了 MMDU，一個全面的基準測試，以及 MMDU-45k，一個大規模的指令調整資料集，旨在評估和提升 LVLMs 在多輪換和多影像對話中的能力。我們採用群集演算法從開源維基百科中找出相關的影像和文字描述，並在 GPT-4o 模型的協助下，由人工註解者建構問答配對。MMDU 最多有 18k 個影像 + 文字符號、20 個影像和 27 個輪換，這至少比先前的基準測試長 5 倍，並對目前的 LVLMs 構成挑戰。我們使用 MMDU 對 15 個具代表性的 LVLMs 進行深入分析，發現開源 LVLMs 由於對話式指令調整資料有限，而落後於閉源對應程式。我們證明了在 MMDU-45k 上微調開源 LVLMs 可以顯著解決此差距，產生更長且更準確的對話，並提升 MMDU 和現有基準測試的分數 (MMStar：+1.1%，MathVista：+1.5%，ChartQA：+1.2%)。我們的貢獻為縮小目前 LVLM 模型與現實世界應用需求之間的差距鋪路。這個專案可在 https://github.com/Liuziyu77/MMDU 取得。", "author": "Ziyu Liu et.al.", "authors": "Ziyu Liu, Tao Chu, Yuhang Zang, Xilin Wei, Xiaoyi Dong, Pan Zhang, Zijian Liang, Yuanjun Xiong, Yu Qiao, Dahua Lin, Jiaqi Wang", "id": "2406.11833v1", "paper_url": "http://arxiv.org/abs/2406.11833v1", "repo": "https://github.com/liuziyu77/mmdu"}}