{"2406.02332": {"publish_time": "2024-06-04", "title": "Extended Mind Transformers", "paper_summary": "Pre-trained language models demonstrate general intelligence and common\nsense, but long inputs quickly become a bottleneck for memorizing information\nat inference time. We resurface a simple method, Memorizing Transformers (Wu et\nal., 2022), that gives the model access to a bank of pre-computed memories. We\nshow that it is possible to fix many of the shortcomings of the original\nmethod, such as the need for fine-tuning, by critically assessing how\npositional encodings should be updated for the keys and values retrieved. This\nintuitive method uses the model's own key/query system to select and attend to\nthe most relevant memories at each generation step, rather than using external\nembeddings. We demonstrate the importance of external information being\nretrieved in a majority of decoder layers, contrary to previous work. We open\nsource a new counterfactual long-range retrieval benchmark, and show that\nExtended Mind Transformers outperform today's state of the art by 6% on\naverage.", "paper_summary_zh": "預先訓練的語言模型展示了通用智慧和常識，但長輸入在推理時很快就會成為記憶資訊的瓶頸。我們重新浮現一個簡單的方法，記憶Transformer（Wu 等人，2022 年），讓模型可以存取預先計算記憶的資料庫。我們展示可以修正原始方法的許多缺點，例如微調的需要，透過批判性評估如何更新位置編碼以利於檢索的鍵和值。這個直觀的方法使用模型自己的鍵/查詢系統，在每個產生步驟中選擇並關注最相關的記憶，而不是使用外部嵌入。我們展示外部資訊在解碼器層的大多數中被檢索的重要性，這與先前的研究相反。我們公開一個新的反事實長程檢索基準，並展示 Extended Mind Transformers 平均比目前的技術水準高出 6%。", "author": "Phoebe Klett et.al.", "authors": "Phoebe Klett, Thomas Ahle", "id": "2406.02332v1", "paper_url": "http://arxiv.org/abs/2406.02332v1", "repo": "null"}}