{"2407.15487": {"publish_time": "2024-07-22", "title": "In-Context Learning Improves Compositional Understanding of Vision-Language Models", "paper_summary": "Vision-Language Models (VLMs) have shown remarkable capabilities in a large\nnumber of downstream tasks. Nonetheless, compositional image understanding\nremains a rather difficult task due to the object bias present in training\ndata. In this work, we investigate the reasons for such a lack of capability by\nperforming an extensive bench-marking of compositional understanding in VLMs.\nWe compare contrastive models with generative ones and analyze their\ndifferences in architecture, pre-training data, and training tasks and losses.\nFurthermore, we leverage In-Context Learning (ICL) as a way to improve the\nability of VLMs to perform more complex reasoning and understanding given an\nimage. Our extensive experiments demonstrate that our proposed approach\noutperforms baseline models across multiple compositional understanding\ndatasets.", "paper_summary_zh": "視覺語言模型 (VLM) 已在大量下游任務中展現出卓越的能力。儘管如此，由於訓練資料中存在的物件偏差，組合式影像理解仍是一項相當困難的任務。在這項工作中，我們透過對 VLM 中組合式理解進行廣泛的基準評量，探討這種能力不足的原因。我們比較對比模型與生成模型，並分析它們在架構、預訓練資料、訓練任務和損失方面的差異。此外，我們利用情境中學習 (ICL) 作為一種方法，以提升 VLM 在給定影像的情況下執行更複雜推理和理解的能力。我們的廣泛實驗證明，我們提出的方法在多個組合式理解資料集上優於基準模型。", "author": "Matteo Nulli et.al.", "authors": "Matteo Nulli, Anesa Ibrahimi, Avik Pal, Hoshe Lee, Ivona Najdenkoska", "id": "2407.15487v1", "paper_url": "http://arxiv.org/abs/2407.15487v1", "repo": "https://github.com/hoezey/vlm-compositionality"}}