{"2410.21069": {"publish_time": "2024-10-28", "title": "EMOCPD: Efficient Attention-based Models for Computational Protein Design Using Amino Acid Microenvironment", "paper_summary": "Computational protein design (CPD) refers to the use of computational methods\nto design proteins. Traditional methods relying on energy functions and\nheuristic algorithms for sequence design are inefficient and do not meet the\ndemands of the big data era in biomolecules, with their accuracy limited by the\nenergy functions and search algorithms. Existing deep learning methods are\nconstrained by the learning capabilities of the networks, failing to extract\neffective information from sparse protein structures, which limits the accuracy\nof protein design. To address these shortcomings, we developed an Efficient\nattention-based Models for Computational Protein Design using amino acid\nmicroenvironment (EMOCPD). It aims to predict the category of each amino acid\nin a protein by analyzing the three-dimensional atomic environment surrounding\nthe amino acids, and optimize the protein based on the predicted\nhigh-probability potential amino acid categories. EMOCPD employs a multi-head\nattention mechanism to focus on important features in the sparse protein\nmicroenvironment and utilizes an inverse residual structure to optimize the\nnetwork architecture. The proposed EMOCPD achieves over 80% accuracy on the\ntraining set and 68.33% and 62.32% accuracy on two independent test sets,\nrespectively, surpassing the best comparative methods by over 10%. In protein\ndesign, the thermal stability and protein expression of the predicted mutants\nfrom EMOCPD show significant improvements compared to the wild type,\neffectively validating EMOCPD's potential in designing superior proteins.\nFurthermore, the predictions of EMOCPD are influenced positively, negatively,\nor have minimal impact based on the content of the 20 amino acids, categorizing\namino acids as positive, negative, or neutral. Research findings indicate that\nEMOCPD is more suitable for designing proteins with lower contents of negative\namino acids.", "paper_summary_zh": "計算蛋白質設計（CPD）是指使用計算方法來設計蛋白質。傳統方法依賴於能量函數和啟發式演算法進行序列設計，效率低下，且不符合生物大數據時代的需求，其準確性受到能量函數和搜尋演算法的限制。現有的深度學習方法受到網路學習能力的限制，無法從稀疏蛋白質結構中提取有效資訊，這限制了蛋白質設計的準確性。為了解決這些缺點，我們開發了一種基於胺基酸微環境的有效注意模型，用於計算蛋白質設計（EMOCPD）。其目標是透過分析胺基酸周圍的三維原子環境來預測蛋白質中每個胺基酸的類別，並根據預測的高機率潛在胺基酸類別來最佳化蛋白質。EMOCPD 採用多頭注意力機制來關注稀疏蛋白質微環境中的重要特徵，並利用逆殘差結構來最佳化網路架構。所提出的 EMOCPD 在訓練組上達到了超過 80% 的準確度，在兩個獨立的測試組上分別達到了 68.33% 和 62.32% 的準確度，比最佳比較方法高出 10% 以上。在蛋白質設計中，與野生型相比，EMOCPD 預測的突變體的熱穩定性和蛋白質表現出顯著的改善，有效驗證了 EMOCPD 在設計優質蛋白質方面的潛力。此外，EMOCPD 的預測會根據 20 種胺基酸的含量受到正面、負面影響，或影響最小，將胺基酸分類為正面、負面或中性。研究結果表明，EMOCPD 更適合設計負胺基酸含量較低的蛋白質。", "author": "Xiaoqi Ling et.al.", "authors": "Xiaoqi Ling, Cheng Cai, Demin Kong, Zhisheng Wei, Jing Wu, Lei Wang, Zhaohong Deng", "id": "2410.21069v2", "paper_url": "http://arxiv.org/abs/2410.21069v2", "repo": "null"}}