{"2501.12352": {"publish_time": "2025-01-21", "title": "Test-time regression: a unifying framework for designing sequence models with associative memory", "paper_summary": "Sequences provide a remarkably general way to represent and process\ninformation. This powerful abstraction has placed sequence modeling at the\ncenter of modern deep learning applications, inspiring numerous architectures\nfrom transformers to recurrent networks. While this fragmented development has\nyielded powerful models, it has left us without a unified framework to\nunderstand their fundamental similarities and explain their effectiveness. We\npresent a unifying framework motivated by an empirical observation: effective\nsequence models must be able to perform associative recall. Our key insight is\nthat memorizing input tokens through an associative memory is equivalent to\nperforming regression at test-time. This regression-memory correspondence\nprovides a framework for deriving sequence models that can perform associative\nrecall, offering a systematic lens to understand seemingly ad-hoc architectural\nchoices. We show numerous recent architectures -- including linear attention\nmodels, their gated variants, state-space models, online learners, and softmax\nattention -- emerge naturally as specific approaches to test-time regression.\nEach architecture corresponds to three design choices: the relative importance\nof each association, the regressor function class, and the optimization\nalgorithm. This connection leads to new understanding: we provide theoretical\njustification for QKNorm in softmax attention, and we motivate higher-order\ngeneralizations of softmax attention. Beyond unification, our work unlocks\ndecades of rich statistical tools that can guide future development of more\npowerful yet principled sequence models.", "paper_summary_zh": "序列提供了一個非常通用的方式來表示和處理資訊。這種強大的抽象化已將序列模型置於現代深度學習應用程式的核心，從Transformer到遞迴網路激發了許多架構。雖然這種分散的發展產生了強大的模型，但它讓我們沒有統一的架構來理解它們的基本相似性並解釋它們的有效性。我們提出了一個由經驗觀察激勵的統一架構：有效的序列模型必須能夠執行關聯式回憶。我們的關鍵見解是，透過聯想記憶體記憶輸入代幣等同於在測試時執行迴歸。這種迴歸記憶對應提供了一個框架，用於推導可以執行關聯式回憶的序列模型，提供了一個系統的透鏡來理解看似臨時的架構選擇。我們展示了許多最近的架構——包括線性注意力模型、它們的門控變體、狀態空間模型、線上學習器和 softmax 注意力——自然而然地出現作為測試時間迴歸的具體方法。每個架構都對應於三個設計選擇：每個關聯的相對重要性、回歸函數類和最佳化演算法。這種聯繫導致了新的理解：我們為 softmax 注意力中的 QKNorm 提供了理論依據，並且我們激勵了 softmax 注意力的高階概括。除了統一之外，我們的研究還解鎖了數十年的豐富統計工具，這些工具可以指導更強大但有原則的序列模型的未來發展。", "author": "Ke Alexander Wang et.al.", "authors": "Ke Alexander Wang, Jiaxin Shi, Emily B. Fox", "id": "2501.12352v1", "paper_url": "http://arxiv.org/abs/2501.12352v1", "repo": "null"}}