{"2407.12327": {"publish_time": "2024-07-17", "title": "Spectra: A Comprehensive Study of Ternary, Quantized, and FP16 Language Models", "paper_summary": "Post-training quantization is the leading method for addressing\nmemory-related bottlenecks in LLM inference, but unfortunately, it suffers from\nsignificant performance degradation below 4-bit precision. An alternative\napproach involves training compressed models directly at a low bitwidth (e.g.,\nbinary or ternary models). However, the performance, training dynamics, and\nscaling trends of such models are not yet well understood. To address this\nissue, we train and openly release the Spectra LLM suite consisting of 54\nlanguage models ranging from 99M to 3.9B parameters, trained on 300B tokens.\nSpectra includes FloatLMs, post-training quantized QuantLMs (3, 4, 6, and 8\nbits), and ternary LLMs (TriLMs) - our improved architecture for ternary\nlanguage modeling, which significantly outperforms previously proposed ternary\nmodels of a given size (in bits), matching half-precision models at scale. For\nexample, TriLM 3.9B is (bit-wise) smaller than the half-precision FloatLM 830M,\nbut matches half-precision FloatLM 3.9B in commonsense reasoning and knowledge\nbenchmarks. However, TriLM 3.9B is also as toxic and stereotyping as FloatLM\n3.9B, a model six times larger in size. Additionally, TriLM 3.9B lags behind\nFloatLM in perplexity on validation splits and web-based corpora but performs\nbetter on less noisy datasets like Lambada and PennTreeBank.\n  To enhance understanding of low-bitwidth models, we are releasing 500+\nintermediate checkpoints of the Spectra suite at\n\\href{https://github.com/NolanoOrg/SpectraSuite}{https://github.com/NolanoOrg/SpectraSuite}.", "paper_summary_zh": "<paragraph>訓練後量化是解決 LLM 推論中與記憶體相關瓶頸的領先方法，但不幸的是，在 4 位元精度以下會大幅降低效能。另一種方法涉及直接在低位元寬度（例如二元或三元模型）訓練壓縮模型。然而，此類模型的效能、訓練動態和擴充趨勢尚未廣為理解。為了解決這個問題，我們訓練並公開發布 Spectra LLM 套件，其中包含 54 個語言模型，範圍從 99M 到 3.9B 個參數，並在 300B 個代幣上訓練。Spectra 包含 FloatLM、訓練後量化的 QuantLM（3、4、6 和 8 位元）和三元 LLM（TriLM）——我們改進的三元語言建模架構，其顯著優於先前提出的特定大小（以位元為單位）的三元模型，在擴充時與半精度模型相匹配。例如，TriLM 3.9B（以位元為單位）小於半精度 FloatLM 830M，但在常識推理和知識基準測試中與半精度 FloatLM 3.9B 相匹配。然而，TriLM 3.9B 也和 FloatLM 3.9B 一樣具有毒性和刻板印象，後者的模型大小是前者的六倍。此外，TriLM 3.9B 在驗證分割和基於網路的語料庫中的困惑度落後於 FloatLM，但在像 Lambada 和 PennTreeBank 這樣的低雜訊資料集上表現得更好。為了加深對低位元寬度模型的理解，我們在\\href{https://github.com/NolanoOrg/SpectraSuite}{https://github.com/NolanoOrg/SpectraSuite}發布 Spectra 套件的 500 多個中間檢查點。</paragraph>", "author": "Ayush Kaushal et.al.", "authors": "Ayush Kaushal, Tejas Pandey, Tejas Vaidhya, Aaryan Bhagat, Irina Rish", "id": "2407.12327v1", "paper_url": "http://arxiv.org/abs/2407.12327v1", "repo": "null"}}