{"2501.06948": {"publish_time": "2025-01-12", "title": "The Einstein Test: Towards a Practical Test of a Machine's Ability to Exhibit Superintelligence", "paper_summary": "Creative and disruptive insights (CDIs), such as the development of the\ntheory of relativity, have punctuated human history, marking pivotal shifts in\nour intellectual trajectory. Recent advancements in artificial intelligence\n(AI) have sparked debates over whether state of the art models possess the\ncapacity to generate CDIs. We argue that the ability to create CDIs should be\nregarded as a significant feature of machine superintelligence (SI).To this\nend, we propose a practical test to evaluate whether an approach to AI\ntargeting SI can yield novel insights of this kind. We propose the Einstein\ntest: given the data available prior to the emergence of a known CDI, can an AI\nindependently reproduce that insight (or one that is formally equivalent)? By\nachieving such a milestone, a machine can be considered to at least match\nhumanity's past top intellectual achievements, and therefore to have the\npotential to surpass them.", "paper_summary_zh": "創造性和破壞性見解（CDI），例如相對論的發展，點綴了人類歷史，標誌著我們智力軌跡的關鍵轉折。最近人工智能（AI）的進展引發了關於最先進模型是否具有產生 CDI 的能力的爭論。我們認為，創造 CDI 的能力應該被視為機器超級智能（SI）的一個重要特徵。為此，我們提出了一個實用的測試來評估一種針對 SI 的 AI 方法是否能產生這種新穎的見解。我們提出了愛因斯坦測試：在已知 CDI 出現之前可用的數據中，AI 能否獨立地再現該見解（或與之形式等效的見解）？通過實現這樣的里程碑，機器可以被認為至少與人類過去的頂尖智力成就相匹配，因此具有超越它們的潛力。", "author": "David Benrimoh et.al.", "authors": "David Benrimoh, Nace Mikus, Ariel Rosenfeld", "id": "2501.06948v1", "paper_url": "http://arxiv.org/abs/2501.06948v1", "repo": "null"}}