{"2502.12992": {"publish_time": "2025-02-18", "title": "B-cos LM: Efficiently Transforming Pre-trained Language Models for Improved Explainability", "paper_summary": "Post-hoc explanation methods for black-box models often struggle with\nfaithfulness and human interpretability due to the lack of explainability in\ncurrent neural models. Meanwhile, B-cos networks have been introduced to\nimprove model explainability through architectural and computational\nadaptations, but their application has so far been limited to computer vision\nmodels and their associated training pipelines. In this work, we introduce\nB-cos LMs, i.e., B-cos networks empowered for NLP tasks. Our approach directly\ntransforms pre-trained language models into B-cos LMs by combining B-cos\nconversion and task fine-tuning, improving efficiency compared to previous\nB-cos methods. Our automatic and human evaluation results demonstrate that\nB-cos LMs produce more faithful and human interpretable explanations than post\nhoc methods, while maintaining task performance comparable to conventional\nfine-tuning. Our in-depth analysis explores how B-cos LMs differ from\nconventionally fine-tuned models in their learning processes and explanation\npatterns. Finally, we provide practical guidelines for effectively building\nB-cos LMs based on our findings. Our code is available at\nhttps://anonymous.4open.science/r/bcos_lm.", "paper_summary_zh": "黑盒模型的事后解释方法通常会因为当前神经模型缺乏可解释性而难以做到忠实和人类可解释。与此同时，B-cos 网络已被引入，以通过架构和计算改编来提高模型的可解释性，但到目前为止，它们的应用仅限于计算机视觉模型及其相关的训练管道。在这项工作中，我们引入了 B-cos LM，即针对 NLP 任务增强的 B-cos 网络。我们的方法通过结合 B-cos 转换和任务微调，将预训练的语言模型直接转换为 B-cos LM，与以前 B-cos 方法相比，提高了效率。我们的自动和人工评估结果表明，与事后方法相比，B-cos LM 产生了更忠实和人类可解释的解释，同时保持与传统微调相当的任务性能。我们的深入分析探讨了 B-cos LM 在其学习过程和解释模式中与传统微调模型有何不同。最后，我们根据我们的发现提供了有效构建 B-cos LM 的实用指南。我们的代码可在 https://anonymous.4open.science/r/bcos_lm 获得。", "author": "Yifan Wang et.al.", "authors": "Yifan Wang, Sukrut Rao, Ji-Ung Lee, Mayank Jobanputra, Vera Demberg", "id": "2502.12992v1", "paper_url": "http://arxiv.org/abs/2502.12992v1", "repo": "null"}}