{"2407.03216": {"publish_time": "2024-07-03", "title": "Learning Disentangled Representation in Object-Centric Models for Visual Dynamics Prediction via Transformers", "paper_summary": "Recent work has shown that object-centric representations can greatly help\nimprove the accuracy of learning dynamics while also bringing interpretability.\nIn this work, we take this idea one step further, ask the following question:\n\"can learning disentangled representation further improve the accuracy of\nvisual dynamics prediction in object-centric models?\" While there has been some\nattempt to learn such disentangled representations for the case of static\nimages \\citep{nsb}, to the best of our knowledge, ours is the first work which\ntries to do this in a general setting for video, without making any specific\nassumptions about the kind of attributes that an object might have. The key\nbuilding block of our architecture is the notion of a {\\em block}, where\nseveral blocks together constitute an object. Each block is represented as a\nlinear combination of a given number of learnable concept vectors, which is\niteratively refined during the learning process. The blocks in our model are\ndiscovered in an unsupervised manner, by attending over object masks, in a\nstyle similar to discovery of slots \\citep{slot_attention}, for learning a\ndense object-centric representation. We employ self-attention via transformers\nover the discovered blocks to predict the next state resulting in discovery of\nvisual dynamics. We perform a series of experiments on several benchmark 2-D,\nand 3-D datasets demonstrating that our architecture (1) can discover\nsemantically meaningful blocks (2) help improve accuracy of dynamics prediction\ncompared to SOTA object-centric models (3) perform significantly better in OOD\nsetting where the specific attribute combinations are not seen earlier during\ntraining. Our experiments highlight the importance discovery of disentangled\nrepresentation for visual dynamics prediction.", "paper_summary_zh": "<paragraph>最近的研究表明，以对象为中心的表示可以极大地帮助提高学习动态的准确性，同时带来可解释性。在这项工作中，我们将这个想法更进一步，提出以下问题：“学习解开的表示是否可以进一步提高以对象为中心的模型中视觉动态预测的准确性？”虽然有人尝试学习静态图像的这种解开表示\\citep{nsb}，但据我们所知，我们的工作是第一个尝试在视频的一般设置中进行此操作，而无需对对象可能具有的属性类型做出任何特定假设。我们架构的关键组成部分是“块”的概念，其中几个块共同构成一个对象。每个块表示为给定数量的可学习概念向量的线性组合，并在学习过程中进行迭代细化。我们模型中的块是以无监督的方式发现的，通过关注对象掩码，类似于发现插槽的样式\\citep{slot_attention}，用于学习密集的对象中心表示。我们通过变压器对发现的块进行自注意力，以预测下一个状态，从而发现视觉动态。我们对几个基准 2-D 和 3-D 数据集执行了一系列实验，证明我们的架构（1）可以发现语义上有意义的块（2）与 SOTA 以对象为中心的模型相比，有助于提高动态预测的准确性（3）在 OOD 设置中表现得明显更好，其中特定的属性组合在训练期间没有被看到过。我们的实验突出了解开表示在视觉动态预测中的重要性。</paragraph>", "author": "Sanket Gandhi et.al.", "authors": "Sanket Gandhi, Atul, Samanyu Mahajan, Vishal Sharma, Rushil Gupta, Arnab Kumar Mondal, Parag Singla", "id": "2407.03216v1", "paper_url": "http://arxiv.org/abs/2407.03216v1", "repo": "null"}}