{"2409.06131": {"publish_time": "2024-09-10", "title": "Accelerating Large Language Model Pretraining via LFR Pedagogy: Learn, Focus, and Review", "paper_summary": "Large Language Model (LLM) pretraining traditionally relies on autoregressive\nlanguage modeling on randomly sampled data blocks from web-scale datasets. We\ntake inspiration from human learning techniques like spaced repetition to\nhypothesize that random data sampling for LLMs leads to high training cost and\nlow quality models which tend to forget data. In order to effectively commit\nweb-scale information to long-term memory, we propose the LFR (Learn, Focus,\nand Review) pedagogy, a new dynamic training paradigm which focuses and\nrepeatedly reviews complex data blocks at systematic intervals based on the\nmodel's learning pace and progress. LFR records the model perplexities for\ndifferent data blocks and frequently revisits blocks with higher perplexity\nwhich are more likely to be forgotten. We pretrain the GPT-2 models (124M -\n1.5B) from scratch on the OpenWebText dataset using LFR. We test on downstream\ntasks from the language modeling, question answering, translation, and problem\nsolving domains to achieve consistently lower perplexity and higher accuracy\nthan the baseline OpenAI models, while obtaining a 20x pretraining speed-up.", "paper_summary_zh": "大型語言模型 (LLM) 預訓練傳統上依賴於隨機取樣資料區塊的自動迴歸語言模型化，這些資料區塊來自網路規模的資料集。我們從人類學習技巧（例如間隔重複）中獲得靈感，假設 LLM 的隨機資料取樣會導致高訓練成本和低品質模型，而這些模型往往會遺忘資料。為了有效地將網路規模的資訊提交至長期記憶體，我們提出 LFR（學習、專注和複習）教學法，這是一種新的動態訓練範例，會根據模型的學習步調和進度，在系統性的間隔中專注於複雜的資料區塊並反覆複習。LFR 會記錄模型對於不同資料區塊的困惑度，並頻繁地重新檢視困惑度較高的區塊，因為這些區塊較容易被遺忘。我們從頭開始使用 LFR 在 OpenWebText 資料集上預訓練 GPT-2 模型（124M - 1.5B）。我們在語言模型化、問題解答、翻譯和問題解決領域的下游任務上進行測試，與基準 OpenAI 模型相比，我們始終獲得較低的困惑度和較高的準確度，同時獲得 20 倍的預訓練加速。", "author": "Neha Prakriya et.al.", "authors": "Neha Prakriya, Jui-Nan Yen, Cho-Jui Hsieh, Jason Cong", "id": "2409.06131v1", "paper_url": "http://arxiv.org/abs/2409.06131v1", "repo": "null"}}