{"2405.20959": {"publish_time": "2024-05-31", "title": "Navigating Tabular Data Synthesis Research: Understanding User Needs and Tool Capabilities", "paper_summary": "In an era of rapidly advancing data-driven applications, there is a growing\ndemand for data in both research and practice. Synthetic data have emerged as\nan alternative when no real data is available (e.g., due to privacy\nregulations). Synthesizing tabular data presents unique and complex challenges,\nespecially handling (i) missing values, (ii) dataset imbalance, (iii) diverse\ncolumn types, and (iv) complex data distributions, as well as preserving (i)\ncolumn correlations, (ii) temporal dependencies, and (iii) integrity\nconstraints (e.g., functional dependencies) present in the original dataset.\nWhile substantial progress has been made recently in the context of\ngenerational models, there is no one-size-fits-all solution for tabular data\ntoday, and choosing the right tool for a given task is therefore no trivial\ntask. In this paper, we survey the state of the art in Tabular Data Synthesis\n(TDS), examine the needs of users by defining a set of functional and\nnon-functional requirements, and compile the challenges associated with meeting\nthose needs. In addition, we evaluate the reported performance of 36 popular\nresearch TDS tools about these requirements and develop a decision guide to\nhelp users find suitable TDS tools for their applications. The resulting\ndecision guide also identifies significant research gaps.", "paper_summary_zh": "<paragraph>在快速推進的數據驅動應用程式時代，研究和實務對資料的需求與日俱增。當沒有真實資料可用時（例如，由於隱私法規），合成資料已成為一種替代方案。合成表格資料會出現獨特且複雜的挑戰，特別是處理（一）遺失值、（二）資料集不平衡、（三）多樣化的欄位類型和（四）複雜的資料分佈，以及保留（一）欄位關聯性、（二）時間依賴性，以及（三）原始資料集中存在的完整性約束（例如，函數依賴性）。雖然最近在生成模型的背景下取得了實質性進展，但目前對於表格資料並沒有一體適用的解決方案，因此為特定任務選擇正確的工具並非易事。在本文中，我們調查了表格資料合成 (TDS) 的最新技術，透過定義一組功能性和非功能性需求來探討使用者的需求，並彙編滿足這些需求所面臨的挑戰。此外，我們評估了 36 種流行的研究 TDS 工具關於這些需求的報告效能，並制定了一個決策指南，以幫助使用者為其應用程式找到合適的 TDS 工具。產生的決策指南也找出了重要的研究差距。</paragraph>", "author": "Maria F. Davila R. et.al.", "authors": "Maria F. Davila R., Sven Groen, Fabian Panse, Wolfram Wingerath", "id": "2405.20959v1", "paper_url": "http://arxiv.org/abs/2405.20959v1", "repo": "null"}}