{"2409.07787": {"publish_time": "2024-09-12", "title": "Stable Language Model Pre-training by Reducing Embedding Variability", "paper_summary": "Stable pre-training is essential for achieving better-performing language\nmodels. However, tracking pre-training stability by calculating gradient\nvariance at every step is impractical due to the significant computational\ncosts. We explore Token Embedding Variability (TEV) as a simple and efficient\nproxy for assessing pre-training stability in language models with pre-layer\nnormalization, given that shallower layers are more prone to gradient explosion\n(section 2.2). Moreover, we propose Multi-head Low-Rank Attention (MLRA) as an\narchitecture to alleviate such instability by limiting the exponential growth\nof output embedding variance, thereby preventing the gradient explosion\n(section 3.2). Empirical results on GPT-2 with MLRA demonstrate increased\nstability and lower perplexity, particularly in deeper models.", "paper_summary_zh": "穩定的預訓練對於達成效能更好的語言模型至關重要。然而，由於顯著的運算成本，透過計算每個步驟的梯度變異數來追蹤預訓練穩定性並不實際。我們探討 Token Embedding Variability (TEV) 作為一個簡單且有效的方法，用於評估具有預層標準化的語言模型中的預訓練穩定性，因為較淺的層更容易發生梯度爆炸（第 2.2 節）。此外，我們提出多頭低秩注意力 (MLRA) 作為一種架構，透過限制輸出嵌入變異數的指數成長來減輕這種不穩定性，從而防止梯度爆炸（第 3.2 節）。在 GPT-2 上使用 MLRA 的經驗結果證明了增加的穩定性和較低的困惑度，特別是在較深的模型中。", "author": "Woojin Chung et.al.", "authors": "Woojin Chung, Jiwoo Hong, Na Min An, James Thorne, Se-Young Yun", "id": "2409.07787v1", "paper_url": "http://arxiv.org/abs/2409.07787v1", "repo": "null"}}