{"2411.17301": {"publish_time": "2024-11-26", "title": "ER2Score: LLM-based Explainable and Customizable Metric for Assessing Radiology Reports with Reward-Control Loss", "paper_summary": "Automated radiology report generation (R2Gen) has advanced significantly,\nintroducing challenges in accurate evaluation due to its complexity.\nTraditional metrics often fall short by relying on rigid word-matching or\nfocusing only on pathological entities, leading to inconsistencies with human\nassessments. To bridge this gap, we introduce ER2Score, an automatic evaluation\nmetric designed specifically for R2Gen. Our metric utilizes a reward model,\nguided by our margin-based reward enforcement loss, along with a tailored\ntraining data design that enables customization of evaluation criteria to suit\nuser-defined needs. It not only scores reports according to user-specified\ncriteria but also provides detailed sub-scores, enhancing interpretability and\nallowing users to adjust the criteria between different aspects of reports.\nLeveraging GPT-4, we designed an easy-to-use data generation pipeline, enabling\nus to produce extensive training data based on two distinct scoring systems,\neach containing reports of varying quality along with corresponding scores.\nThese GPT-generated reports are then paired as accepted and rejected samples\nthrough our pairing rule to train an LLM towards our fine-grained reward model,\nwhich assigns higher rewards to the report with high quality. Our\nreward-control loss enables this model to simultaneously output multiple\nindividual rewards corresponding to the number of evaluation criteria, with\ntheir summation as our final ER2Score. Our experiments demonstrate ER2Score's\nheightened correlation with human judgments and superior performance in model\nselection compared to traditional metrics. Notably, our model provides both an\noverall score and individual scores for each evaluation item, enhancing\ninterpretability. We also demonstrate its flexible training across various\nevaluation systems.", "paper_summary_zh": "自動放射報告生成 (R2Gen) 已大幅進展，由於其複雜性，在準確評估方面引入了挑戰。傳統指標經常因依賴於嚴格的字詞匹配或僅關注病理實體而有所不足，導致與人類評估不一致。為了彌補這個差距，我們引入了 ER2Score，這是一種專門為 R2Gen 設計的自動評估指標。我們的指標利用獎勵模型，在我們的基於邊際的獎勵執行損失的指導下，以及量身打造的訓練數據設計，可以自訂評估標準以滿足使用者定義的需求。它不僅根據使用者指定的標準對報告進行評分，還提供詳細的子分數，增強了解度，並允許使用者調整報告中不同面向的標準。利用 GPT-4，我們設計了一個易於使用的數據生成管道，使我們能夠根據兩個不同的評分系統產生廣泛的訓練數據，每個系統都包含不同品質的報告以及對應的分數。這些 GPT 生成的報告隨後透過我們的配對規則配對為已接受和已拒絕的樣本，以訓練 LLM 朝向我們細緻的獎勵模型，該模型會將較高的獎勵分配給品質較高的報告。我們的獎勵控制損失使這個模型能夠同時輸出多個個別獎勵，對應於評估標準的數量，其總和為我們的最終 ER2Score。我們的實驗證明 ER2Score 與人類判斷的高度相關性，以及在模型選擇中優於傳統指標的卓越效能。值得注意的是，我們的模型提供了總體分數和每個評估項目的個別分數，增強了可解釋性。我們也展示了它在各種評估系統中的靈活訓練。", "author": "Yunyi Liu et.al.", "authors": "Yunyi Liu, Yingshu Li, Zhanyu Wang, Xinyu Liang, Lingqiao Liu, Lei Wang, Luping Zhou", "id": "2411.17301v1", "paper_url": "http://arxiv.org/abs/2411.17301v1", "repo": "null"}}