{"2411.06638": {"publish_time": "2024-11-11", "title": "Model Editing for LLMs4Code: How Far are We?", "paper_summary": "Large Language Models for Code (LLMs4Code) have been found to exhibit\noutstanding performance in the software engineering domain, especially the\nremarkable performance in coding tasks. However, even the most advanced\nLLMs4Code can inevitably contain incorrect or outdated code knowledge. Due to\nthe high cost of training LLMs4Code, it is impractical to re-train the models\nfor fixing these problematic code knowledge. Model editing is a new technical\nfield for effectively and efficiently correcting erroneous knowledge in LLMs,\nwhere various model editing techniques and benchmarks have been proposed\nrecently. Despite that, a comprehensive study that thoroughly compares and\nanalyzes the performance of the state-of-the-art model editing techniques for\nadapting the knowledge within LLMs4Code across various code-related tasks is\nnotably absent. To bridge this gap, we perform the first systematic study on\napplying state-of-the-art model editing approaches to repair the inaccuracy of\nLLMs4Code. To that end, we introduce a benchmark named CLMEEval, which consists\nof two datasets, i.e., CoNaLa-Edit (CNLE) with 21K+ code generation samples and\nCodeSearchNet-Edit (CSNE) with 16K+ code summarization samples. With the help\nof CLMEEval, we evaluate six advanced model editing techniques on three\nLLMs4Code: CodeLlama (7B), CodeQwen1.5 (7B), and Stable-Code (3B). Our findings\ninclude that the external memorization-based GRACE approach achieves the best\nknowledge editing effectiveness and specificity (the editing does not influence\nuntargeted knowledge), while generalization (whether the editing can generalize\nto other semantically-identical inputs) is a universal challenge for existing\ntechniques. Furthermore, building on in-depth case analysis, we introduce an\nenhanced version of GRACE called A-GRACE, which incorporates contrastive\nlearning to better capture the semantics of the inputs.", "paper_summary_zh": "<paragraph>大型語言模型代碼 (LLMs4Code) 已被發現可在軟體工程領域展現傑出的效能，特別是在編碼任務中表現出色。然而，即使是最先進的 LLMs4Code 也難免包含不正確或過時的程式碼知識。由於訓練 LLMs4Code 的成本很高，因此不切實際地重新訓練模型來修正這些有問題的程式碼知識。模型編輯是一個新的技術領域，用於有效且高效地修正大型語言模型中的錯誤知識，最近已提出各種模型編輯技術和基準。儘管如此，一個全面研究，徹底比較和分析最先進的模型編輯技術在各種與程式碼相關任務中調整 LLMs4Code 內部知識的效能，顯著地不存在。為了彌合這個差距，我們對應用最先進的模型編輯方法來修復 LLMs4Code 的不準確性進行了第一個系統性研究。為此，我們引入了一個名為 CLMEEval 的基準，它包含兩個資料集，即包含 21K+ 程式碼生成範例的 CoNaLa-Edit (CNLE) 和包含 16K+ 程式碼摘要範例的 CodeSearchNet-Edit (CSNE)。在 CLMEEval 的幫助下，我們評估了六種先進的模型編輯技術在三個 LLMs4Code 上的表現：CodeLlama (7B)、CodeQwen1.5 (7B) 和 Stable-Code (3B)。我們的發現包括基於外部記憶的 GRACE 方法實現了最佳的知識編輯效能和特異性（編輯不會影響未鎖定的知識），而泛化（編輯是否可以泛化到其他語義相同的輸入）是現有技術的普遍挑戰。此外，在深入案例分析的基礎上，我們引入了 GRACE 的增強版本，稱為 A-GRACE，它結合了對比學習以更好地捕捉輸入的語義。</paragraph>", "author": "Xiaopeng Li et.al.", "authors": "Xiaopeng Li, Shangwen Wang, Shasha Li, Jun Ma, Jie Yu, Xiaodong Liu, Jing Wang, Bin Ji, Weimin Zhang", "id": "2411.06638v1", "paper_url": "http://arxiv.org/abs/2411.06638v1", "repo": "https://github.com/xpq-tech/code-llmedit"}}