{"2410.05050": {"publish_time": "2024-10-07", "title": "FreSh: Frequency Shifting for Accelerated Neural Representation Learning", "paper_summary": "Implicit Neural Representations (INRs) have recently gained attention as a\npowerful approach for continuously representing signals such as images, videos,\nand 3D shapes using multilayer perceptrons (MLPs). However, MLPs are known to\nexhibit a low-frequency bias, limiting their ability to capture high-frequency\ndetails accurately. This limitation is typically addressed by incorporating\nhigh-frequency input embeddings or specialized activation layers. In this work,\nwe demonstrate that these embeddings and activations are often configured with\nhyperparameters that perform well on average but are suboptimal for specific\ninput signals under consideration, necessitating a costly grid search to\nidentify optimal settings. Our key observation is that the initial frequency\nspectrum of an untrained model's output correlates strongly with the model's\neventual performance on a given target signal. Leveraging this insight, we\npropose frequency shifting (or FreSh), a method that selects embedding\nhyperparameters to align the frequency spectrum of the model's initial output\nwith that of the target signal. We show that this simple initialization\ntechnique improves performance across various neural representation methods and\ntasks, achieving results comparable to extensive hyperparameter sweeps but with\nonly marginal computational overhead compared to training a single model with\ndefault hyperparameters.", "paper_summary_zh": "隱式神經表示 (INR) 近來作為一種強大的方法而備受關注，可用於使用多層感知器 (MLP) 連續表示影像、影片和 3D 形狀等訊號。然而，已知 MLP 會表現出低頻偏差，限制了其準確擷取高頻細節的能力。此限制通常透過納入高頻輸入嵌入或專門的激活層來解決。在這項研究中，我們證明這些嵌入和激活通常會使用平均表現良好的超參數進行設定，但對於考慮中的特定輸入訊號而言並非最佳，需要耗費成本的網格搜尋來找出最佳設定。我們的關鍵觀察是，未訓練模型輸出的初始頻率譜與模型在特定目標訊號上的最終效能密切相關。利用此見解，我們提出頻率位移 (或 FreSh)，一種方法用於選擇嵌入超參數，以將模型初始輸出的頻率譜與目標訊號的頻率譜對齊。我們顯示此簡單的初始化技術可改善各種神經表示方法和任務的效能，達成與廣泛超參數掃描相當的結果，但與使用預設超參數訓練單一模型相比，僅有邊際的運算負擔。", "author": "Adam Kania et.al.", "authors": "Adam Kania, Marko Mihajlovic, Sergey Prokudin, Jacek Tabor, Przemysław Spurek", "id": "2410.05050v1", "paper_url": "http://arxiv.org/abs/2410.05050v1", "repo": "null"}}