{"2407.16607": {"publish_time": "2024-07-23", "title": "Data Mixture Inference: What do BPE Tokenizers Reveal about their Training Data?", "paper_summary": "The pretraining data of today's strongest language models is opaque. In\nparticular, little is known about the proportions of various domains or\nlanguages represented. In this work, we tackle a task which we call data\nmixture inference, which aims to uncover the distributional make-up of training\ndata. We introduce a novel attack based on a previously overlooked source of\ninformation -- byte-pair encoding (BPE) tokenizers, used by the vast majority\nof modern language models. Our key insight is that the ordered list of merge\nrules learned by a BPE tokenizer naturally reveals information about the token\nfrequencies in its training data: the first merge is the most common byte pair,\nthe second is the most common pair after merging the first token, and so on.\nGiven a tokenizer's merge list along with data samples for each category of\ninterest, we formulate a linear program that solves for the proportion of each\ncategory in the tokenizer's training set. Importantly, to the extent to which\ntokenizer training data is representative of the pretraining data, we\nindirectly learn about the pretraining data. In controlled experiments, we show\nthat our attack recovers mixture ratios with high precision for tokenizers\ntrained on known mixtures of natural languages, programming languages, and data\nsources. We then apply our approach to off-the-shelf tokenizers released with\nrecent LMs. We confirm much publicly disclosed information about these models,\nand also make several new inferences: GPT-4o's tokenizer is much more\nmultilingual than its predecessors, training on 39% non-English data; Llama3\nextends GPT-3.5's tokenizer primarily for multilingual (48%) use; GPT-3.5's and\nClaude's tokenizers are trained on predominantly code (~60%). We hope our work\nsheds light on current design practices for pretraining data, and inspires\ncontinued research into data mixture inference for LMs.", "paper_summary_zh": "<paragraph>當前最強大的語言模型的預訓練數據是模糊不清的。特別是，對於各種領域或語言所占比例的了解甚少。在這項工作中，我們處理了一項稱為數據混合推論的任務，旨在揭示訓練數據的分布式組成。我們引入了一種新穎的攻擊方法，該方法基於一個以前被忽視的信息來源——字節對編碼 (BPE) 分詞器，它被絕大多數現代語言模型使用。我們的關鍵見解是，BPE 分詞器學習到的合併規則的有序列表自然地揭示了其訓練數據中詞頻的信息：第一次合併是最常見的字節對，第二次合併是最常見的對，依此類推。給定分詞器的合併列表以及每個感興趣類別的數據樣本，我們制定了一個線性規劃，用於求解分詞器訓練集中每個類別的比例。重要的是，在分詞器訓練數據代表預訓練數據的範圍內，我們間接了解了預訓練數據。在受控實驗中，我們表明我們的攻擊以高精度恢復了在已知自然語言、編程語言和數據源混合物上訓練的分詞器的混合比例。然後，我們將我們的做法應用於最近發布的開箱即用分詞器與 LMs。我們確認了關於這些模型的許多公開披露的信息，還做出了幾個新的推論：GPT-4o 的分詞器比其前輩更加多語言，在 39% 的非英語數據上進行訓練；Llama3 主要為多語言（48%）使用擴展了 GPT-3.5 的分詞器；GPT-3.5 和 Claude 的分詞器主要在代碼（~60%）上進行訓練。我們希望我們的工作能為預訓練數據的當前設計實務提供啟示，並激勵繼續研究 LMs 的數據混合推論。</paragraph>", "author": "Jonathan Hayase et.al.", "authors": "Jonathan Hayase, Alisa Liu, Yejin Choi, Sewoong Oh, Noah A. Smith", "id": "2407.16607v1", "paper_url": "http://arxiv.org/abs/2407.16607v1", "repo": "null"}}