{"2407.16607": {"publish_time": "2024-07-23", "title": "Data Mixture Inference: What do BPE Tokenizers Reveal about their Training Data?", "paper_summary": "The pretraining data of today's strongest language models is opaque; in\nparticular, little is known about the proportions of various domains or\nlanguages represented. In this work, we tackle a task which we call data\nmixture inference, which aims to uncover the distributional make-up of training\ndata. We introduce a novel attack based on a previously overlooked source of\ninformation -- byte-pair encoding (BPE) tokenizers, used by the vast majority\nof modern language models. Our key insight is that the ordered list of merge\nrules learned by a BPE tokenizer naturally reveals information about the token\nfrequencies in its training data: the first merge is the most common byte pair,\nthe second is the most common pair after merging the first token, and so on.\nGiven a tokenizer's merge list along with data samples for each category of\ninterest, we formulate a linear program that solves for the proportion of each\ncategory in the tokenizer's training set. Importantly, to the extent to which\ntokenizer training data is representative of the pretraining data, we\nindirectly learn about pretraining data. In controlled experiments, we show\nthat our attack recovers mixture ratios with high precision for tokenizers\ntrained on known mixtures of natural languages, programming languages, and data\nsources. We then apply our approach to off-the-shelf tokenizers released with\nrecent LMs. We confirm much publicly disclosed information about these models,\nand also make several new inferences: GPT-4o's tokenizer is much more\nmultilingual than its predecessors, training on 39% non-English data; Llama3\nextends GPT-3.5's tokenizer primarily for multilingual (48%) use; GPT-3.5's and\nClaude's tokenizers are trained on predominantly code (~60%). We hope our work\nsheds light on current design practices for pretraining data, and inspires\ncontinued research into data mixture inference for LMs.", "paper_summary_zh": "當今最強大的語言模型的預訓練資料是不透明的；特別是，對於各種領域或語言的比例知之甚少。在這項工作中，我們處理一項我們稱之為資料混合推論的任務，其目的是揭示訓練資料的分布式組成。我們引入了一種基於先前被忽視的資訊來源的新攻擊——位元組對編碼 (BPE) 代幣器，它被絕大多數現代語言模型所使用。我們的關鍵見解是，BPE 代幣器所學習的合併規則的有序清單自然地揭示了其訓練資料中代幣頻率的資訊：第一次合併是最常見的位元組對，第二次合併是最常見的對，依此類推。給定一個代幣器的合併清單以及每個感興趣類別的資料範例，我們制定了一個線性程式，用於解決代幣器訓練集中每個類別的比例。重要的是，在代幣器訓練資料代表預訓練資料的程度下，我們間接了解了預訓練資料。在受控實驗中，我們展示了我們的攻擊以高精度恢復了在已知自然語言、程式語言和資料來源混合物上訓練的代幣器的混合比率。然後，我們將我們的做法應用於與近期 LM 一起發布的現成代幣器。我們確認了關於這些模型的大量公開資訊，並做出了幾個新的推論：GPT-4o 的代幣器比其前身更具多語言性，在 39% 的非英語資料上進行訓練；Llama3 主要為多語言 (48%) 使用而擴充了 GPT-3.5 的代幣器；GPT-3.5 和 Claude 的代幣器主要在程式碼 (~60%) 上進行訓練。我們希望我們的努力能為預訓練資料的當前設計實務提供啟發，並激勵持續研究 LM 的資料混合推論。", "author": "Jonathan Hayase et.al.", "authors": "Jonathan Hayase, Alisa Liu, Yejin Choi, Sewoong Oh, Noah A. Smith", "id": "2407.16607v2", "paper_url": "http://arxiv.org/abs/2407.16607v2", "repo": "null"}}