{"2408.12142": {"publish_time": "2024-08-22", "title": "MDD-5k: A New Diagnostic Conversation Dataset for Mental Disorders Synthesized via Neuro-Symbolic LLM Agents", "paper_summary": "The clinical diagnosis of most mental disorders primarily relies on the\nconversations between psychiatrist and patient. The creation of such diagnostic\nconversation datasets is promising to boost the AI mental healthcare community.\nHowever, directly collecting the conversations in real diagnosis scenarios is\nnear impossible due to stringent privacy and ethical considerations. To address\nthis issue, we seek to synthesize diagnostic conversation by exploiting\nanonymous patient cases that are easier to access. Specifically, we design a\nneuro-symbolic multi-agent framework for synthesizing the diagnostic\nconversation of mental disorders with large language models. It takes patient\ncase as input and is capable of generating multiple diverse conversations with\none single patient case. The framework basically involves the interaction\nbetween a doctor agent and a patient agent, and achieves text generation under\nsymbolic control via a dynamic diagnosis tree from a tool agent. By applying\nthe proposed framework, we develop the largest Chinese mental disorders\ndiagnosis dataset MDD-5k, which is built upon 1000 cleaned real patient cases\nby cooperating with a pioneering psychiatric hospital, and contains 5000\nhigh-quality long conversations with diagnosis results as labels. To the best\nof our knowledge, it's also the first labelled Chinese mental disorders\ndiagnosis dataset. Human evaluation demonstrates the proposed MDD-5k dataset\nsuccessfully simulates human-like diagnostic process of mental disorders. The\ndataset and code will become publicly accessible in\nhttps://github.com/lemonsis/MDD-5k.", "paper_summary_zh": "大多數精神疾病的臨床診斷主要依賴於精神科醫師與病患之間的對話。建立此類診斷對話資料集有望提升 AI 心理保健社群。然而，由於嚴格的隱私和倫理考量，直接在真實診斷情境中收集對話幾乎是不可能的。為了解決這個問題，我們試圖利用較容易取得的匿名病患案例來合成診斷對話。具體來說，我們設計了一個神經符號多主體架構，用於合成具有大型語言模型的精神疾病診斷對話。它以病患案例作為輸入，並且能夠針對單一病患案例產生多個不同的對話。此架構基本上涉及醫師主體和病患主體之間的互動，並透過來自工具主體的動態診斷樹來實現符號控制下的文字產生。透過應用建議的架構，我們開發了最大的中文精神疾病診斷資料集 MDD-5k，它是建立在 1000 個透過與一家先驅精神病院合作而整理過的真實病患案例上，並包含 5000 個帶有診斷結果標籤的高品質長對話。據我們所知，它也是第一個標記的中文精神疾病診斷資料集。人類評估證明，建議的 MDD-5k 資料集成功模擬了類人的精神疾病診斷流程。資料集和程式碼將在 https://github.com/lemonsis/MDD-5k 公開。", "author": "Congchi Yin et.al.", "authors": "Congchi Yin, Feng Li, Shu Zhang, Zike Wang, Jun Shao, Piji Li, Jianhua Chen, Xun Jiang", "id": "2408.12142v1", "paper_url": "http://arxiv.org/abs/2408.12142v1", "repo": "https://github.com/lemonsis/mdd-5k"}}