{"2502.10896": {"publish_time": "2025-02-15", "title": "Developing Conversational Speech Systems for Robots to Detect Speech Biomarkers of Cognition in People Living with Dementia", "paper_summary": "This study presents the development and testing of a conversational speech\nsystem designed for robots to detect speech biomarkers indicative of cognitive\nimpairments in people living with dementia (PLwD). The system integrates a\nbackend Python WebSocket server and a central core module with a large language\nmodel (LLM) fine-tuned for dementia to process user input and generate robotic\nconversation responses in real-time in less than 1.5 seconds. The frontend user\ninterface, a Progressive Web App (PWA), displays information and biomarker\nscore graphs on a smartphone in real-time to human users (PLwD, caregivers,\nclinicians). Six speech biomarkers based on the existing literature - Altered\nGrammar, Pragmatic Impairments, Anomia, Disrupted Turn-Taking, Slurred\nPronunciation, and Prosody Changes - were developed for the robot conversation\nsystem using two datasets, one that included conversations of PLwD with a human\nclinician (DementiaBank dataset) and one that included conversations of PLwD\nwith a robot (Indiana dataset). We also created a composite speech biomarker\nthat combined all six individual biomarkers into a single score. The speech\nsystem's performance was first evaluated on the DementiaBank dataset showing\nmoderate correlation with MMSE scores, with the composite biomarker score\noutperforming individual biomarkers. Analysis of the Indiana dataset revealed\nhigher and more variable biomarker scores, suggesting potential differences due\nto study populations (e.g. severity of dementia) and the conversational\nscenario (human-robot conversations are different from human-human). The\nfindings underscore the need for further research on the impact of\nconversational scenarios on speech biomarkers and the potential clinical\napplications of robotic speech systems.", "paper_summary_zh": "本研究展示了對話式語音系統的開發和測試，該系統專為機器人設計，用於偵測失智症患者（PLwD）認知障礙的語言生物標記。該系統整合了後端 Python WebSocket 伺服器和一個中央核心模組，其中包含針對失智症微調的大語言模型（LLM），以處理使用者輸入並在不到 1.5 秒的時間內產生機器人對話回應。前端使用者介面（漸進式網路應用程式，PWA）會在智慧型手機上即時向人類使用者（PLwD、照護者、臨床醫生）顯示資訊和生物標記評分圖表。根據現有文獻，針對機器人對話系統開發了六個語言生物標記：語法改變、實用障礙、失語症、輪流中斷、發音不清和韻律變化，使用了兩個資料集，一個包含 PLwD 與人類臨床醫生對話（DementiaBank 資料集），另一個包含 PLwD 與機器人對話（Indiana 資料集）。我們還建立了一個複合語言生物標記，將所有六個個別生物標記組合成一個單一評分。語言系統的效能首先在 DementiaBank 資料集上進行評估，顯示與 MMSE 評分有中等相關性，複合生物標記評分優於個別生物標記。對 Indiana 資料集的分析顯示出較高且變異性較大的生物標記評分，這表明由於研究族群（例如失智症的嚴重程度）和對話情境（人機對話與人際對話不同）而產生潛在差異。研究結果強調需要進一步研究對話情境對語言生物標記的影響，以及機器人語言系統的潛在臨床應用。", "author": "Rohith Perumandla et.al.", "authors": "Rohith Perumandla, Young-Ho Bae, Diego Izaguirre, Esther Hwang, Andrew Murphy, Long-Jing Hsu, Selma Sabanovic, Casey C. Bennett", "id": "2502.10896v1", "paper_url": "http://arxiv.org/abs/2502.10896v1", "repo": "null"}}