{"2408.03172": {"publish_time": "2024-08-06", "title": "Leveraging Parameter Efficient Training Methods for Low Resource Text Classification: A Case Study in Marathi", "paper_summary": "With the surge in digital content in low-resource languages, there is an\nescalating demand for advanced Natural Language Processing (NLP) techniques\ntailored to these languages. BERT (Bidirectional Encoder Representations from\nTransformers), serving as the foundational framework for numerous NLP\narchitectures and language models, is increasingly employed for the development\nof low-resource NLP models. Parameter Efficient Fine-Tuning (PEFT) is a method\nfor fine-tuning Large Language Models (LLMs) and reducing the training\nparameters to some extent to decrease the computational costs needed for\ntraining the model and achieve results comparable to a fully fine-tuned model.\nIn this work, we present a study of PEFT methods for the Indic low-resource\nlanguage Marathi. We conduct a comprehensive analysis of PEFT methods applied\nto various monolingual and multilingual Marathi BERT models. These approaches\nare evaluated on prominent text classification datasets like MahaSent,\nMahaHate, and MahaNews. The incorporation of PEFT techniques is demonstrated to\nsignificantly expedite the training speed of the models, addressing a critical\naspect of model development and deployment. In this study, we explore Low-Rank\nAdaptation of Large Language Models (LoRA) and adapter methods for low-resource\ntext classification. We show that these methods are competitive with full\nfine-tuning and can be used without loss in accuracy. This study contributes\nvaluable insights into the effectiveness of Marathi BERT models, offering a\nfoundation for the continued advancement of NLP capabilities in Marathi and\nsimilar Indic languages.", "paper_summary_zh": "<paragraph>隨著低資源語言的數位內容激增，對於針對這些語言量身打造的先進自然語言處理 (NLP) 技術的需求也與日俱增。BERT（來自 Transformer 的雙向編碼器表示法）作為許多 NLP 架構和語言模型的基本架構，正日益用於開發低資源 NLP 模型。參數高效微調 (PEFT) 是一種微調大型語言模型 (LLM) 並在一定程度上減少訓練參數的方法，以降低訓練模型所需的運算成本，並獲得與完全微調模型相當的結果。在這項工作中，我們提出對印度低資源語言馬拉提語的 PEFT 方法進行研究。我們對應用於各種單語和多語馬拉提語 BERT 模型的 PEFT 方法進行了全面分析。這些方法在著名的文本分類資料集（例如 MahaSent、MahaHate 和 MahaNews）上進行評估。PEFT 技術的整合被證明可以顯著加快模型的訓練速度，解決了模型開發和部署的一個關鍵方面。在這項研究中，我們探討了大型語言模型 (LoRA) 的低秩適應和低資源文本分類的適配器方法。我們表明，這些方法與完全微調具有競爭力，並且可以在不損失準確性的情況下使用。這項研究對馬拉提語 BERT 模型的有效性提供了有價值的見解，為馬拉提語和類似印度語言的 NLP 能力持續進步奠定了基礎。</paragraph>", "author": "Pranita Deshmukh et.al.", "authors": "Pranita Deshmukh, Nikita Kulkarni, Sanhita Kulkarni, Kareena Manghani, Raviraj Joshi", "id": "2408.03172v1", "paper_url": "http://arxiv.org/abs/2408.03172v1", "repo": "null"}}