{"2502.16732": {"publish_time": "2025-02-23", "title": "DeepSeek reshaping healthcare in China's tertiary hospitals", "paper_summary": "The rapid integration of artificial intelligence (AI) into healthcare is\ntransforming clinical decision-making and hospital operations. DeepSeek has\nemerged as a leading AI system, widely deployed across China's tertiary\nhospitals since January 2025. Initially implemented in Shanghai's major medical\ninstitutions, it has since expanded nationwide, enhancing diagnostic accuracy,\nstreamlining workflows, and improving patient management. AI-powered pathology,\nimaging analysis, and clinical decision support systems have demonstrated\nsignificant potential in optimizing medical processes and reducing the\ncognitive burden on healthcare professionals. However, the widespread adoption\nof AI in healthcare raises critical regulatory and ethical challenges,\nparticularly regarding accountability in AI-assisted diagnosis and the risk of\nautomation bias. The absence of a well-defined liability framework underscores\nthe need for policies that ensure AI functions as an assistive tool rather than\nan autonomous decision-maker. With continued technological advancements, AI is\nexpected to integrate multimodal data sources, such as genomics and radiomics,\npaving the way for precision medicine and personalized treatment strategies.\nThe future of AI in healthcare depends on the development of transparent\nregulatory structures, industry collaboration, and adaptive governance\nframeworks that balance innovation with responsibility, ensuring equitable and\neffective AI-driven medical services.", "paper_summary_zh": "人工智能 (AI) 快速整合到醫療保健中，正在轉變臨床決策制定和醫院運作。DeepSeek 已成為領先的人工智慧系統，自 2025 年 1 月以來廣泛部署於中國三級醫院。最初在上海的主要醫療機構實施，此後已擴展到全國，提高了診斷準確性，簡化了工作流程，並改進了患者管理。由人工智能驅動的病理學、影像分析和臨床決策支援系統已證明在優化醫療流程和減輕醫療保健專業人員的認知負擔方面具有顯著的潛力。然而，人工智能在醫療保健中的廣泛採用提出了重大的監管和倫理挑戰，特別是在人工智能輔助診斷中的問責制和自動化偏差風險方面。缺乏明確的責任架構強調了制定政策的必要性，以確保人工智能作為輔助工具而不是自主決策者運作。隨著技術的持續進步，預計人工智能將整合多模態數據源，例如基因組學和放射組學，為精準醫療和個性化治療策略鋪平道路。人工智能在醫療保健中的未來取決於透明監管結構、產業合作和適應性治理架構的發展，這些架構平衡了創新與責任，確保公平且有效的人工智能驅動醫療服務。", "author": "Jishizhan Chen et.al.", "authors": "Jishizhan Chen, Qingzeng Zhang", "id": "2502.16732v1", "paper_url": "http://arxiv.org/abs/2502.16732v1", "repo": "null"}}