{"2411.13244": {"publish_time": "2024-11-20", "title": "Leveraging Prior Experience: An Expandable Auxiliary Knowledge Base for Text-to-SQL", "paper_summary": "Large Language Models (LLMs) exhibit impressive problem-solving skills across\nmany tasks, but they still underperform compared to humans in various\ndownstream applications, such as text-to-SQL. On the BIRD benchmark\nleaderboard, human performance achieves an accuracy of 92.96\\%, whereas the\ntop-performing method reaches only 72.39\\%. Notably, these state-of-the-art\n(SoTA) methods predominantly rely on in-context learning to simulate human-like\nreasoning. However, they overlook a critical human skill: continual learning.\nInspired by the educational practice of maintaining mistake notebooks during\nour formative years, we propose LPE-SQL (Leveraging Prior Experience: An\nExpandable Auxiliary Knowledge Base for Text-to-SQL), a novel framework\ndesigned to augment LLMs by enabling continual learning without requiring\nparameter fine-tuning. LPE-SQL consists of four modules that \\textbf{i)}\nretrieve relevant entries, \\textbf{ii)} efficient sql generation, \\textbf{iii)}\ngenerate the final result through a cross-consistency mechanism and\n\\textbf{iv)} log successful and failed tasks along with their reasoning\nprocesses or reflection-generated tips. Importantly, the core module of LPE-SQL\nis the fourth one, while the other modules employ foundational methods,\nallowing LPE-SQL to be easily integrated with SoTA technologies to further\nenhance performance. Our experimental results demonstrate that this continual\nlearning approach yields substantial performance gains, with the smaller\nLlama-3.1-70B model with surpassing the performance of the larger\nLlama-3.1-405B model using SoTA methods.", "paper_summary_zh": "大型語言模型 (LLM) 在許多任務中展現出令人印象深刻的解決問題技能，但與人類相比，它們在各種下游應用（例如文字轉 SQL）中的表現仍然較差。在 BIRD 基準排行榜上，人類的表現達到 92.96% 的準確度，而表現最佳的方法僅達到 72.39%。值得注意的是，這些最先進 (SoTA) 方法主要依賴於情境學習來模擬類人推理。然而，他們忽視了一項關鍵的人類技能：持續學習。受我們在成長過程中保持錯誤筆記本的教育實務啟發，我們提出了 LPE-SQL（利用先驗經驗：文字轉 SQL 可擴充輔助知識庫），這是一個新穎的架構，旨在通過啟用持續學習來擴充 LLM，而無需進行參數微調。LPE-SQL 包含四個模組，它們\\textbf{i)} 檢索相關條目，\\textbf{ii)} 有效的 SQL 生成，\\textbf{iii)} 通過交叉一致性機制生成最終結果，以及\\textbf{iv)} 記錄成功的和失敗的任務以及它們的推理過程或反思產生的提示。重要的是，LPE-SQL 的核心模組是第四個模組，而其他模組採用基礎方法，允許 LPE-SQL 輕鬆與 SoTA 技術整合以進一步提高效能。我們的實驗結果表明，這種持續學習方法產生了顯著的效能提升，使用 SoTA 方法的較小 Llama-3.1-70B 模型超越了較大 Llama-3.1-405B 模型的效能。", "author": "Zhibo Chu et.al.", "authors": "Zhibo Chu, Zichong Wang, Qitao Qin", "id": "2411.13244v1", "paper_url": "http://arxiv.org/abs/2411.13244v1", "repo": "null"}}