{"2407.08642": {"publish_time": "2024-07-11", "title": "Towards Building Specialized Generalist AI with System 1 and System 2 Fusion", "paper_summary": "In this perspective paper, we introduce the concept of Specialized Generalist\nArtificial Intelligence (SGAI or simply SGI) as a crucial milestone toward\nArtificial General Intelligence (AGI). Compared to directly scaling general\nabilities, SGI is defined as AI that specializes in at least one task,\nsurpassing human experts, while also retaining general abilities. This fusion\npath enables SGI to rapidly achieve high-value areas. We categorize SGI into\nthree stages based on the level of mastery over professional skills and\ngenerality performance. Additionally, we discuss the necessity of SGI in\naddressing issues associated with large language models, such as their\ninsufficient generality, specialized capabilities, uncertainty in innovation,\nand practical applications. Furthermore, we propose a conceptual framework for\ndeveloping SGI that integrates the strengths of Systems 1 and 2 cognitive\nprocessing. This framework comprises three layers and four key components,\nwhich focus on enhancing individual abilities and facilitating collaborative\nevolution. We conclude by summarizing the potential challenges and suggesting\nfuture directions. We hope that the proposed SGI will provide insights into\nfurther research and applications towards achieving AGI.", "paper_summary_zh": "<paragraph>在本文中，我們引入了專業通才人工智慧 (SGAI 或簡稱 SGI) 的概念，視為邁向人工通用智慧 (AGI) 的關鍵里程碑。與直接擴展一般能力相比，SGI 被定義為至少在一個任務中表現優於人類專家的 AI，同時也保留一般能力。這種融合路徑使 SGI 能夠快速實現高價值領域。我們根據對專業技能和一般性表現的掌握程度，將 SGI 分為三個階段。此外，我們討論了在解決與大型語言模型相關的問題（例如它們的普遍性不足、專業能力、創新中的不確定性和實際應用）中 SGI 的必要性。此外，我們提出了整合系統 1 和 2 認知處理優勢的 SGI 開發概念框架。此框架包含三層和四個關鍵組成部分，重點在於增強個人能力和促進協作演進。最後，我們總結了潛在挑戰並提出了未來的方向。我們希望提出的 SGI 能為進一步的研究和應用提供見解，以實現 AGI。</paragraph>", "author": "Kaiyan Zhang et.al.", "authors": "Kaiyan Zhang, Biqing Qi, Bowen Zhou", "id": "2407.08642v1", "paper_url": "http://arxiv.org/abs/2407.08642v1", "repo": "null"}}