{"2411.10411": {"publish_time": "2024-11-15", "title": "Repurposing Stable Diffusion Attention for Training-Free Unsupervised Interactive Segmentation", "paper_summary": "Recent progress in interactive point prompt based Image Segmentation allows\nto significantly reduce the manual effort to obtain high quality semantic\nlabels. State-of-the-art unsupervised methods use self-supervised pre-trained\nmodels to obtain pseudo-labels which are used in training a prompt-based\nsegmentation model. In this paper, we propose a novel unsupervised and\ntraining-free approach based solely on the self-attention of Stable Diffusion.\nWe interpret the self-attention tensor as a Markov transition operator, which\nenables us to iteratively construct a Markov chain. Pixel-wise counting of the\nrequired number of iterations along the Markov-chain to reach a relative\nprobability threshold yields a Markov-iteration-map, which we simply call a\nMarkov-map. Compared to the raw attention maps, we show that our proposed\nMarkov-map has less noise, sharper semantic boundaries and more uniform values\nwithin semantically similar regions. We integrate the Markov-map in a simple\nyet effective truncated nearest neighbor framework to obtain interactive point\nprompt based segmentation. Despite being training-free, we experimentally show\nthat our approach yields excellent results in terms of Number of Clicks (NoC),\neven outperforming state-of-the-art training based unsupervised methods in most\nof the datasets.", "paper_summary_zh": "最近在基于交互式点提示的影像分割方面取得的进展，可大幅降低取得高品质语义标签的手动工作。最先进的无监督方法使用自我监督预训练模型来取得伪标签，这些标签用于训练基于提示的分割模型。在这篇论文中，我们提出一种仅基于 Stable Diffusion 自注意力的新颖无监督且无需训练的方法。我们将自注意力张量解释为马可夫转换算子，这使我们能够迭代构建马可夫链。沿着马可夫链计算达到相对概率阈值所需的迭代次数，可产生马可夫迭代图，我们简单地称之为马可夫图。与原始注意力图相比，我们展示了我们提出的马可夫图具有更少的噪声、更清晰的语义边界以及语义相似区域内的更均匀的值。我们将马可夫图整合到一个简单而有效的截断最近邻框架中，以获取交互式点提示分割。尽管无需训练，但我们通过实验表明，我们的方法在点击次数 (NoC) 方面产生了极佳的结果，甚至在大多数数据集上优于最先进的基于训练的无监督方法。", "author": "Markus Karmann et.al.", "authors": "Markus Karmann, Onay Urfalioglu", "id": "2411.10411v1", "paper_url": "http://arxiv.org/abs/2411.10411v1", "repo": "null"}}