{"2409.14446": {"publish_time": "2024-09-22", "title": "Detection of pulmonary pathologies using convolutional neural networks, Data Augmentation, ResNet50 and Vision Transformers", "paper_summary": "Pulmonary diseases are a public health problem that requires accurate and\nfast diagnostic techniques. In this paper, a method based on convolutional\nneural networks (CNN), Data Augmentation, ResNet50 and Vision Transformers\n(ViT) is proposed to detect lung pathologies from medical images. A dataset of\nX-ray images and CT scans of patients with different lung diseases, such as\ncancer, pneumonia, tuberculosis and fibrosis, is used. The results obtained by\nthe proposed method are compared with those of other existing methods, using\nperformance metrics such as accuracy, sensitivity, specificity and area under\nthe ROC curve. The results show that the proposed method outperforms the other\nmethods in all metrics, achieving an accuracy of 98% and an area under the ROC\ncurve of 99%. It is concluded that the proposed method is an effective and\npromising tool for the diagnosis of pulmonary pathologies by medical imaging.", "paper_summary_zh": "肺部疾病是一種公共衛生問題，需要準確且快速的診斷技術。在本文中，提出了一種基於卷積神經網路 (CNN)、資料擴充、ResNet50 和視覺Transformer (ViT) 的方法，以從醫學影像中偵測肺部病理。我們使用了一組 X 光影像和不同肺部疾病患者的電腦斷層掃描，例如癌症、肺炎、肺結核和纖維化。將所提出的方法獲得的結果與其他現有方法的結果進行比較，使用準確度、敏感度、特異度和 ROC 曲線下的面積等效能指標。結果顯示，所提出的方法在所有指標上都優於其他方法，準確度達到 98%，ROC 曲線下的面積為 99%。結論是，所提出的方法是一種有效且有前途的工具，可透過醫學影像診斷肺部病理。", "author": "Pablo Ramirez Amador et.al.", "authors": "Pablo Ramirez Amador, Dinarle Milagro Ortega, Arnold Cesarano", "id": "2409.14446v1", "paper_url": "http://arxiv.org/abs/2409.14446v1", "repo": "null"}}