{"2501.01933": {"publish_time": "2025-01-03", "title": "Abstractive Text Summarization for Contemporary Sanskrit Prose: Issues and Challenges", "paper_summary": "This thesis presents Abstractive Text Summarization models for contemporary\nSanskrit prose. The first chapter, titled Introduction, presents the motivation\nbehind this work, the research questions, and the conceptual framework.\nSanskrit is a low-resource inflectional language. The key research question\nthat this thesis investigates is what the challenges in developing an\nabstractive TS for Sanskrit. To answer the key research questions,\nsub-questions based on four different themes have been posed in this work. The\nsecond chapter, Literature Review, surveys the previous works done. The third\nchapter, data preparation, answers the remaining three questions from the third\ntheme. It reports the data collection and preprocessing challenges for both\nlanguage model and summarization model trainings. The fourth chapter reports\nthe training and inference of models and the results obtained therein. This\nresearch has initiated a pipeline for Sanskrit abstractive text summarization\nand has reported the challenges faced at every stage of the development. The\nresearch questions based on every theme have been answered to answer the key\nresearch question.", "paper_summary_zh": "本論文提出當代梵文散文之抽象文字摘要模型。第一章為緒論，說明本研究的動機、研究問題和概念架構。梵文是一種低資源的屈折語。本論文探討的主要研究問題是開發梵文抽象文字摘要的挑戰。為了回答主要的研究問題，本研究提出了基於四個不同主題的子問題。第二章文獻回顧，探討之前完成的研究。第三章資料準備，回答了第三個主題中剩下的三個問題。它報告了語言模型和摘要模型訓練的資料收集和預處理挑戰。第四章報告模型的訓練和推論，以及獲得的結果。本研究啟動了梵文抽象文字摘要的管道，並報告了開發過程中每個階段面臨的挑戰。基於每個主題的研究問題都已回答，以回答主要的研究問題。", "author": "Shagun Sinha et.al.", "authors": "Shagun Sinha", "id": "2501.01933v1", "paper_url": "http://arxiv.org/abs/2501.01933v1", "repo": "null"}}