{"2407.15359": {"publish_time": "2024-07-22", "title": "UF-HOBI at \"Discharge Me!\": A Hybrid Solution for Discharge Summary Generation Through Prompt-based Tuning of GatorTronGPT Models", "paper_summary": "Automatic generation of discharge summaries presents significant challenges\ndue to the length of clinical documentation, the dispersed nature of patient\ninformation, and the diverse terminology used in healthcare. This paper\npresents a hybrid solution for generating discharge summary sections as part of\nour participation in the \"Discharge Me!\" Challenge at the BioNLP 2024 Shared\nTask. We developed a two-stage generation method using both extractive and\nabstractive techniques, in which we first apply name entity recognition (NER)\nto extract key clinical concepts, which are then used as input for a\nprompt-tuning-based GatorTronGPT model to generate coherent text for two\nimportant sections including \"Brief Hospital Course\" and \"Discharge\nInstructions\". Our system was ranked 5th in this challenge, achieving an\noverall score of 0.284. The results demonstrate the effectiveness of our hybrid\nsolution in improving the quality of automated discharge section generation.", "paper_summary_zh": "由於臨床文件長度、患者資訊分散以及醫療保健中使用的術語多樣，自動產生出院摘要會面臨重大挑戰。本文提出了一種混合解決方案，用於產生出院摘要部分，作為我們參與 BioNLP 2024 共享任務中的「Discharge Me!」挑戰的一部分。我們開發了一種使用萃取和摘要技術的兩階段產生方法，其中我們首先應用命名實體辨識 (NER) 來萃取關鍵臨床概念，然後將其用作提示調整式 GatorTronGPT 模型的輸入，以產生兩個重要部分的連貫文字，包括「簡要住院病程」和「出院指示」。我們的系統在此挑戰中排名第 5，達到 0.284 的總分。結果證明了我們的混合解決方案在改善自動出院部分產生的品質方面有效。", "author": "Mengxian Lyu et.al.", "authors": "Mengxian Lyu, Cheng Peng, Daniel Paredes, Ziyi Chen, Aokun Chen, Jiang Bian, Yonghui Wu", "id": "2407.15359v1", "paper_url": "http://arxiv.org/abs/2407.15359v1", "repo": "null"}}