{"2410.10850": {"publish_time": "2024-10-06", "title": "On the Reliability of Large Language Models to Misinformed and Demographically-Informed Prompts", "paper_summary": "We investigate and observe the behaviour and performance of Large Language\nModel (LLM)-backed chatbots in addressing misinformed prompts and questions\nwith demographic information within the domains of Climate Change and Mental\nHealth. Through a combination of quantitative and qualitative methods, we\nassess the chatbots' ability to discern the veracity of statements, their\nadherence to facts, and the presence of bias or misinformation in their\nresponses. Our quantitative analysis using True/False questions reveals that\nthese chatbots can be relied on to give the right answers to these close-ended\nquestions. However, the qualitative insights, gathered from domain experts,\nshows that there are still concerns regarding privacy, ethical implications,\nand the necessity for chatbots to direct users to professional services. We\nconclude that while these chatbots hold significant promise, their deployment\nin sensitive areas necessitates careful consideration, ethical oversight, and\nrigorous refinement to ensure they serve as a beneficial augmentation to human\nexpertise rather than an autonomous solution.", "paper_summary_zh": "我們調查並觀察大型語言模型 (LLM) 支持的聊天機器人在氣候變遷和心理健康領域中處理錯誤訊息提示和問題的行為和表現。透過結合量化和質性方法，我們評估聊天機器人辨別陳述真實性的能力、他們對事實的堅持，以及他們回應中偏見或錯誤訊息的存在。我們使用真/假問題的量化分析顯示，可以依賴這些聊天機器人對這些封閉式問題給出正確答案。然而，從領域專家收集的質性見解顯示，對於隱私、倫理影響以及聊天機器人將使用者導向專業服務的必要性仍有疑慮。我們得出結論，儘管這些聊天機器人極具前景，但在敏感領域部署它們需要仔細考量、道德監督和嚴格改進，以確保它們作為人類專業知識的有益擴充，而不是自主解決方案。", "author": "Toluwani Aremu et.al.", "authors": "Toluwani Aremu, Oluwakemi Akinwehinmi, Chukwuemeka Nwagu, Syed Ishtiaque Ahmed, Rita Orji, Pedro Arnau Del Amo, Abdulmotaleb El Saddik", "id": "2410.10850v2", "paper_url": "http://arxiv.org/abs/2410.10850v2", "repo": "null"}}