{"2504.17768": {"publish_time": "2025-04-24", "title": "The Sparse Frontier: Sparse Attention Trade-offs in Transformer LLMs", "paper_summary": "Sparse attention offers a promising strategy to extend long-context\ncapabilities in Transformer LLMs, yet its viability, its efficiency-accuracy\ntrade-offs, and systematic scaling studies remain unexplored. To address this\ngap, we perform a careful comparison of training-free sparse attention methods\nat varying model scales, sequence lengths, and sparsity levels on a diverse\ncollection of long-sequence tasks-including novel ones that rely on natural\nlanguage while remaining controllable and easy to evaluate. Based on our\nexperiments, we report a series of key findings: 1) an isoFLOPS analysis\nreveals that for very long sequences, larger and highly sparse models are\npreferable to smaller and dense ones. 2) The level of sparsity attainable while\nstatistically guaranteeing accuracy preservation is higher during decoding than\nprefilling, and correlates with model size in the former. 3) There is no clear\nstrategy that performs best across tasks and phases, with different units of\nsparsification or budget adaptivity needed for different scenarios. Even\nmoderate sparsity levels often result in significant performance degradation on\nat least one task, highlighting that sparse attention is not a universal\nsolution. 4) We introduce and validate novel scaling laws specifically tailored\nfor sparse attention, providing evidence that our findings are likely to hold\ntrue beyond our range of experiments. Through these insights, we demonstrate\nthat sparse attention is a key tool to enhance the capabilities of Transformer\nLLMs for processing longer sequences, but requires careful evaluation of\ntrade-offs for performance-sensitive applications.", "paper_summary_zh": "<paragraph>稀疏注意力機制為擴展 Transformer 大型語言模型的長文本處理能力提供了一個很有前景的策略，但其可行性、效率與準確性之間的權衡，以及系統性的規模擴展研究仍有待探索。為了彌補這一差距，我們對各種無需訓練的稀疏注意力方法進行了仔細的比較，涵蓋了不同的模型規模、序列長度和稀疏度，並基於一系列不同的長序列任務——包括一些新穎的、基於自然語言且易於控制和評估的任務。根據我們的實驗，我們報告了一系列重要發現：1) 等效運算分析顯示，對於非常長的序列，更大且高度稀疏的模型比更小且密集的模型更佳。2) 在統計上保證準確性的前提下，解碼階段可達到的稀疏度高於預填充階段，並且在前者中與模型大小相關。3) 沒有哪種策略在所有任務和階段都表現最佳，不同的場景需要不同的稀疏化單元或預算調整策略。即使是中等程度的稀疏性，也常常會導致至少一項任務的性能顯著下降，這凸顯了稀疏注意力並非通用解決方案。4) 我們引入並驗證了專為稀疏注意力量身定制的新規模定律，證明我們的研究結果很可能適用於超出我們實驗範圍的情況。通過這些見解，我們證明了稀疏注意力是增強 Transformer 大型語言模型處理更長序列能力的關鍵工具，但在對性能敏感的應用中，需要仔細評估其權衡取捨。</paragraph>\n", "author": "Piotr Nawrot et.al.", "authors": "Piotr Nawrot, Robert Li, Renjie Huang, Sebastian Ruder, Kelly Marchisio, Edoardo M. Ponti", "id": "2504.17768v1", "paper_url": "http://arxiv.org/abs/2504.17768v1", "repo": "null"}}