{"2502.02390": {"publish_time": "2025-02-04", "title": "CoAT: Chain-of-Associated-Thoughts Framework for Enhancing Large Language Models Reasoning", "paper_summary": "Research on LLM technologies is rapidly emerging, with most of them employing\na 'fast thinking' approach to inference. Most LLMs generate the final result\nbased solely on a single query and LLM's reasoning capabilities. However, with\nthe advent of OpenAI-o1, 'slow thinking' techniques have garnered increasing\nattention because its process is closer to the human thought process. Inspired\nby the human ability to constantly associate and replenish knowledge during\nthinking, we developed the novel Chain-of-Associated-Thoughts (CoAT) framework,\nwhich introduces an innovative synergy between the Monte Carlo Tree Search\n(MCTS) algorithm and a dynamic mechanism for integrating new key information,\ntermed 'associative memory'. By combining the structured exploration\ncapabilities of MCTS with the adaptive learning capacity of associative memory,\nCoAT significantly expands the LLM search space, enabling our framework to\nexplore diverse reasoning pathways and dynamically update its knowledge base in\nreal-time. This allows the framework to not only revisit and refine earlier\ninferences but also adaptively incorporate evolving information, ensuring that\nthe final output is both accurate and comprehensive. To validate the\neffectiveness of our framework, we conducted extensive experiments across a\nrange of generative and reasoning tasks. These experiments demonstrated that\nour framework outperforms conventional inference processes on accuracy,\ncoherence, and diversity. The framework's ability to iteratively expand its\nsearch space while retaining contextually relevant information results.", "paper_summary_zh": "大型語言模型技術的研究正迅速興起，其中大多數採用「快速思考」方法進行推理。大多數大型語言模型僅根據單一查詢和大型語言模型的推理能力來生成最終結果。然而，隨著 OpenAI-o1 的出現，「慢思考」技術引起了越來越多的關注，因為其過程更接近人類的思考過程。受人類在思考過程中不斷聯想和補充知識的能力的啟發，我們開發了新穎的聯想思維鏈 (CoAT) 框架，該框架引入了蒙特卡羅樹搜索 (MCTS) 演算法與整合新關鍵資訊的動態機制（稱為「聯想記憶」）之間的創新協同作用。通過將 MCTS 的結構化探索能力與聯想記憶的自適應學習能力相結合，CoAT 大大擴展了大型語言模型的搜尋空間，使我們的框架能夠探索多樣化的推理路徑並動態更新其知識庫。這不僅允許框架重新檢視和優化早期的推理，還能自適應地納入不斷變化的資訊，確保最終輸出既準確又全面。為了驗證我們框架的有效性，我們在各種生成和推理任務中進行了廣泛的實驗。這些實驗表明，我們的框架在準確性、連貫性和多樣性方面優於傳統的推理過程。該框架在保留與上下文相關的資訊的同時反覆擴展其搜尋空間的能力。", "author": "Jianfeng Pan et.al.", "authors": "Jianfeng Pan, Senyou Deng, Shaomang Huang", "id": "2502.02390v1", "paper_url": "http://arxiv.org/abs/2502.02390v1", "repo": "null"}}