{"2411.03687": {"publish_time": "2024-11-06", "title": "Beyond Model Adaptation at Test Time: A Survey", "paper_summary": "Machine learning algorithms have achieved remarkable success across various\ndisciplines, use cases and applications, under the prevailing assumption that\ntraining and test samples are drawn from the same distribution. Consequently,\nthese algorithms struggle and become brittle even when samples in the test\ndistribution start to deviate from the ones observed during training. Domain\nadaptation and domain generalization have been studied extensively as\napproaches to address distribution shifts across test and train domains, but\neach has its limitations. Test-time adaptation, a recently emerging learning\nparadigm, combines the benefits of domain adaptation and domain generalization\nby training models only on source data and adapting them to target data during\ntest-time inference. In this survey, we provide a comprehensive and systematic\nreview on test-time adaptation, covering more than 400 recent papers. We\nstructure our review by categorizing existing methods into five distinct\ncategories based on what component of the method is adjusted for test-time\nadaptation: the model, the inference, the normalization, the sample, or the\nprompt, providing detailed analysis of each. We further discuss the various\npreparation and adaptation settings for methods within these categories,\noffering deeper insights into the effective deployment for the evaluation of\ndistribution shifts and their real-world application in understanding images,\nvideo and 3D, as well as modalities beyond vision. We close the survey with an\noutlook on emerging research opportunities for test-time adaptation.", "paper_summary_zh": "機器學習演算法在各種領域、使用案例和應用中都取得了顯著的成功，其前提假設是訓練和測試樣本來自相同的分布。因此，即使測試分布中的樣本開始偏離訓練期間觀察到的樣本，這些演算法也會陷入困境並變得脆弱。領域適應和領域泛化已被廣泛研究為解決測試和訓練領域之間分佈轉移的方法，但每種方法都有其局限性。測試時適應是一種最近新興的學習範例，它結合了領域適應和領域泛化的優點，僅使用來源資料訓練模型，並在測試時推理期間將其適應到目標資料。在本次調查中，我們提供了對測試時適應的全面且系統性的回顧，涵蓋了 400 多篇近期論文。我們根據方法的哪個組成部分經過調整以進行測試時適應，將現有方法分類為五個不同的類別來架構我們的回顧：模型、推理、正規化、樣本或提示，並對每個類別提供詳細分析。我們進一步討論了這些類別中方法的各種準備和適應設定，提供更深入的見解，以有效部署來評估分佈轉移及其在理解影像、影片和 3D 中的實際應用，以及超越視覺的模態。我們以對測試時適應的新興研究機會的展望作為本次調查的結尾。", "author": "Zehao Xiao et.al.", "authors": "Zehao Xiao, Cees G. M. Snoek", "id": "2411.03687v1", "paper_url": "http://arxiv.org/abs/2411.03687v1", "repo": "https://github.com/zzzx1224/beyond-model-adaptation-at-test-time-papers"}}