{"2406.07440": {"publish_time": "2024-06-11", "title": "Textual Similarity as a Key Metric in Machine Translation Quality Estimation", "paper_summary": "Machine Translation (MT) Quality Estimation (QE) assesses translation\nreliability without reference texts. This study introduces \"textual similarity\"\nas a new metric for QE, using sentence transformers and cosine similarity to\nmeasure semantic closeness. Analyzing data from the MLQE-PE dataset, we found\nthat textual similarity exhibits stronger correlations with human scores than\ntraditional metrics (hter, model evaluation etc.). Employing GAMMs as a\nstatistical tool, we demonstrated that textual similarity consistently\noutperforms other metrics across multiple language pairs in predicting human\nscores. We also found that \"hter\" actually failed to predict human scores in\nQE. Our findings highlight the effectiveness of textual similarity as a robust\nQE metric, recommending its integration with other metrics into QE frameworks\nand MT system training for improved accuracy and usability.", "paper_summary_zh": "機器翻譯 (MT) 品質評估 (QE) 在沒有參考文本的情況下評估翻譯可靠性。本研究引入「文字相似度」作為 QE 的新指標，使用句子轉換器和餘弦相似度來測量語義接近度。分析來自 MLQE-PE 資料集的資料，我們發現文字相似度與人類評分之間的相關性比傳統指標（hter、模型評估等）更強。使用 GAMM 作為統計工具，我們證明文字相似度在預測人類評分方面始終優於多種語言對中的其他指標。我們還發現「hter」實際上無法在 QE 中預測人類評分。我們的研究結果突顯了文字相似度作為一種強大的 QE 指標的有效性，建議將其與其他指標整合到 QE 框架和 MT 系統訓練中，以提高準確性和可用性。", "author": "Kun Sun et.al.", "authors": "Kun Sun, Rong Wang", "id": "2406.07440v1", "paper_url": "http://arxiv.org/abs/2406.07440v1", "repo": "null"}}