{"2406.16833": {"publish_time": "2024-06-24", "title": "USDC: A Dataset of $\\underline{U}$ser $\\underline{S}$tance and $\\underline{D}$ogmatism in Long $\\underline{C}$onversations", "paper_summary": "Identifying user's opinions and stances in long conversation threads on\nvarious topics can be extremely critical for enhanced personalization, market\nresearch, political campaigns, customer service, conflict resolution, targeted\nadvertising, and content moderation. Hence, training language models to\nautomate this task is critical. However, to train such models, gathering manual\nannotations has multiple challenges: 1) It is time-consuming and costly; 2)\nConversation threads could be very long, increasing chances of noisy\nannotations; and 3) Interpreting instances where a user changes their opinion\nwithin a conversation is difficult because often such transitions are subtle\nand not expressed explicitly. Inspired by the recent success of large language\nmodels (LLMs) for complex natural language processing (NLP) tasks, we leverage\nMistral Large and GPT-4 to automate the human annotation process on the\nfollowing two tasks while also providing reasoning: i) User Stance\nclassification, which involves labeling a user's stance of a post in a\nconversation on a five-point scale; ii) User Dogmatism classification, which\ndeals with labeling a user's overall opinion in the conversation on a\nfour-point scale. The majority voting on zero-shot, one-shot, and few-shot\nannotations from these two LLMs on 764 multi-user Reddit conversations helps us\ncurate the USDC dataset. USDC is then used to finetune and instruction-tune\nmultiple deployable small language models for the 5-class stance and 4-class\ndogmatism classification tasks. We make the code and dataset publicly available\n[https://anonymous.4open.science/r/USDC-0F7F].", "paper_summary_zh": "<paragraph>在各種主題的長對話串中找出使用者的意見和立場，對於加強個人化、市場研究、政治活動、客戶服務、衝突解決、目標廣告和內容審核來說至關重要。因此，訓練語言模型以自動化此任務至關重要。然而，要訓練此類模型，收集手動註解有多項挑戰：1) 耗時且成本高昂；2) 對話串可能很長，增加註解有雜訊的機率；3) 解釋使用者在對話中改變意見的實例很困難，因為通常此類轉變很微妙，且未明確表達。受到大型語言模型 (LLM) 近期在複雜自然語言處理 (NLP) 任務中成功的啟發，我們利用 Mistral Large 和 GPT-4 在以下兩個任務中自動化人工註解流程，同時也提供推理：i) 使用者立場分類，其中涉及在對話中對使用者的立場標記為五點量表；ii) 使用者教條分類，其中涉及在對話中對使用者的整體意見標記為四點量表。這兩個 LLM 在 764 個多使用者 Reddit 對話中對零次學習、一次學習和少次學習註解進行的過半數投票，有助於我們整理 USDC 資料集。然後使用 USDC 對多個可部署的小語言模型進行微調和指令調整，以進行 5 類立場和 4 類教條分類任務。我們公開程式碼和資料集 [https://anonymous.4open.science/r/USDC-0F7F]。</paragraph>", "author": "Mounika Marreddy et.al.", "authors": "Mounika Marreddy, Subba Reddy Oota, Venkata Charan Chinni, Manish Gupta, Lucie Flek", "id": "2406.16833v1", "paper_url": "http://arxiv.org/abs/2406.16833v1", "repo": "null"}}