{"2409.07918": {"publish_time": "2024-09-12", "title": "Tidal MerzA: Combining affective modelling and autonomous code generation through Reinforcement Learning", "paper_summary": "This paper presents Tidal-MerzA, a novel system designed for collaborative\nperformances between humans and a machine agent in the context of live coding,\nspecifically focusing on the generation of musical patterns. Tidal-MerzA fuses\ntwo foundational models: ALCAA (Affective Live Coding Autonomous Agent) and\nTidal Fuzz, a computational framework. By integrating affective modelling with\ncomputational generation, this system leverages reinforcement learning\ntechniques to dynamically adapt music composition parameters within the\nTidalCycles framework, ensuring both affective qualities to the patterns and\nsyntactical correctness. The development of Tidal-MerzA introduces two distinct\nagents: one focusing on the generation of mini-notation strings for musical\nexpression, and another on the alignment of music with targeted affective\nstates through reinforcement learning. This approach enhances the adaptability\nand creative potential of live coding practices and allows exploration of\nhuman-machine creative interactions. Tidal-MerzA advances the field of\ncomputational music generation, presenting a novel methodology for\nincorporating artificial intelligence into artistic practices.", "paper_summary_zh": "本文介紹 Tidal-MerzA，這是一個新穎的系統，專為現場編碼中人類與機器代理之間的協作表演而設計，特別著重於音樂模式的產生。Tidal-MerzA 融合了兩個基礎模型：ALCAA（情感現場編碼自主代理）和 Tidal Fuzz，一個計算框架。透過整合情感建模與計算產生，此系統利用強化學習技術在 TidalCycles 框架內動態調整音樂組成參數，確保模式的情感品質和語法正確性。Tidal-MerzA 的開發引入了兩個不同的代理：一個專注於產生音樂表達的迷你符號字串，另一個透過強化學習將音樂與目標情感狀態對齊。這種方法增強了現場編碼實務的適應性和創造潛力，並允許探索人機創造互動。Tidal-MerzA 推動了計算音樂生成的領域，提出了一種將人工智慧納入藝術實務的新方法。", "author": "Elizabeth Wilson et.al.", "authors": "Elizabeth Wilson, György Fazekas, Geraint Wiggins", "id": "2409.07918v1", "paper_url": "http://arxiv.org/abs/2409.07918v1", "repo": "null"}}