{"2407.14055": {"publish_time": "2024-07-19", "title": "Quantum Hamiltonian Embedding of Images for Data Reuploading Classifiers", "paper_summary": "When applying quantum computing to machine learning tasks, one of the first\nconsiderations is the design of the quantum machine learning model itself.\nConventionally, the design of quantum machine learning algorithms relies on the\n``quantisation\" of classical learning algorithms, such as using quantum linear\nalgebra to implement important subroutines of classical algorithms, if not the\nentire algorithm, seeking to achieve quantum advantage through possible\nrun-time accelerations brought by quantum computing. However, recent research\nhas started questioning whether quantum advantage via speedup is the right goal\nfor quantum machine learning [1]. Research also has been undertaken to exploit\nproperties that are unique to quantum systems, such as quantum contextuality,\nto better design quantum machine learning models [2]. In this paper, we take an\nalternative approach by incorporating the heuristics and empirical evidences\nfrom the design of classical deep learning algorithms to the design of quantum\nneural networks. We first construct a model based on the data reuploading\ncircuit [3] with the quantum Hamiltonian data embedding unitary [4]. Through\nnumerical experiments on images datasets, including the famous MNIST and\nFashionMNIST datasets, we demonstrate that our model outperforms the quantum\nconvolutional neural network (QCNN)[5] by a large margin (up to over 40% on\nMNIST test set). Based on the model design process and numerical results, we\nthen laid out six principles for designing quantum machine learning models,\nespecially quantum neural networks.", "paper_summary_zh": "<paragraph>在將量子運算應用於機器學習任務時，首先要考慮的是量子機器學習模型本身的設計。傳統上，量子機器學習演算法的設計依賴於經典學習演算法的「量子化」，例如使用量子線性代數來實作經典演算法的重要子常式，如果不是整個演算法，則尋求透過量子運算帶來的可能執行時間加速來獲得量子優勢。然而，最近的研究開始質疑透過加速的量子優勢是否是量子機器學習的正確目標 [1]。研究也已進行，以利用量子系統獨有的特性，例如量子脈絡性，來更好地設計量子機器學習模型 [2]。在本文中，我們透過將經典深度學習演算法設計中的啟發法和實證證據納入量子神經網路的設計中，採取了一種替代方法。我們首先根據資料重新上傳電路 [3] 構築一個模型，並使用量子哈密頓資料嵌入酉 [4]。透過在影像資料集（包括著名的 MNIST 和 FashionMNIST 資料集）上進行數值實驗，我們證明我們的模型在很大程度上優於量子卷積神經網路 (QCNN)[5]（在 MNIST 測試集上最多超過 40%）。根據模型設計過程和數值結果，我們接著提出了設計量子機器學習模型，特別是量子神經網路的六項原則。</paragraph>", "author": "Peiyong Wang et.al.", "authors": "Peiyong Wang, Casey R. Myers, Lloyd C. L. Hollenberg, Udaya Parampalli", "id": "2407.14055v1", "paper_url": "http://arxiv.org/abs/2407.14055v1", "repo": "null"}}