{"2405.14654": {"publish_time": "2024-05-23", "title": "Efficient Medical Question Answering with Knowledge-Augmented Question Generation", "paper_summary": "In the expanding field of language model applications, medical knowledge\nrepresentation remains a significant challenge due to the specialized nature of\nthe domain. Large language models, such as GPT-4, obtain reasonable scores on\nmedical question answering tasks, but smaller models are far behind. In this\nwork, we introduce a method to improve the proficiency of a small language\nmodel in the medical domain by employing a two-fold approach. We first\nfine-tune the model on a corpus of medical textbooks. Then, we use GPT-4 to\ngenerate questions similar to the downstream task, prompted with textbook\nknowledge, and use them to fine-tune the model. Additionally, we introduce\nECN-QA, a novel medical question answering dataset containing ``progressive\nquestions'' composed of related sequential questions. We show the benefits of\nour training strategy on this dataset. The study's findings highlight the\npotential of small language models in the medical domain when appropriately\nfine-tuned. The code and weights are available at\nhttps://github.com/raidium-med/MQG.", "paper_summary_zh": "在語言模型應用不斷擴展的領域中，由於該領域的專業性質，醫學知識表示仍然是一個重大的挑戰。大型語言模型，例如 GPT-4，在醫學問題解答任務中獲得了合理的評分，但較小的模型卻遠遠落後。在這項工作中，我們介紹了一種方法，通過採用雙重方法來提高小型語言模型在醫學領域的熟練度。我們首先在醫學教科書語料庫中對模型進行微調。然後，我們使用 GPT-4 生成與下游任務相似的問題，並提示教科書知識，並使用它們對模型進行微調。此外，我們還引入了 ECN-QA，這是一個新穎的醫學問題解答數據集，其中包含由相關順序問題組成的「漸進式問題」。我們展示了我們的訓練策略在這個數據集上的好處。這項研究的發現突出了小型語言模型在適當微調後在醫學領域的潛力。代碼和權重可在 https://github.com/raidium-med/MQG 獲得。", "author": "Julien Khlaut et.al.", "authors": "Julien Khlaut, Corentin Dancette, Elodie Ferreres, Alaedine Bennani, Paul Hérent, Pierre Manceron", "id": "2405.14654v1", "paper_url": "http://arxiv.org/abs/2405.14654v1", "repo": "null"}}