{"2407.05740": {"publish_time": "2024-07-08", "title": "Do Multilingual Large Language Models Mitigate Stereotype Bias?", "paper_summary": "While preliminary findings indicate that multilingual LLMs exhibit reduced\nbias compared to monolingual ones, a comprehensive understanding of the effect\nof multilingual training on bias mitigation, is lacking. This study addresses\nthis gap by systematically training six LLMs of identical size (2.6B\nparameters) and architecture: five monolingual models (English, German, French,\nItalian, and Spanish) and one multilingual model trained on an equal\ndistribution of data across these languages, all using publicly available data.\nTo ensure robust evaluation, standard bias benchmarks were automatically\ntranslated into the five target languages and verified for both translation\nquality and bias preservation by human annotators. Our results consistently\ndemonstrate that multilingual training effectively mitigates bias. Moreover, we\nobserve that multilingual models achieve not only lower bias but also superior\nprediction accuracy when compared to monolingual models with the same amount of\ntraining data, model architecture, and size.", "paper_summary_zh": "初步研究結果顯示，與單語模型相比，多語言大型語言模型表現出的偏見較少，但對於多語言訓練對偏見緩解的影響，仍缺乏全面的了解。本研究透過系統性地訓練六個大小相同（2.6B 參數）且架構相同的 LLM 來解決這個問題：五個單語模型（英語、德語、法語、義大利語和西班牙語）和一個多語言模型，訓練於這些語言中資料的平均分配，所有模型都使用公開的資料。為了確保穩健的評估，標準偏見基準自動翻譯成五種目標語言，並由人工標註員驗證翻譯品質和偏見保留。我們的結果持續證明多語言訓練有效緩解偏見。此外，我們觀察到，與訓練資料量、模型架構和大小相同的多語言模型相比，多語言模型不僅偏見較低，而且預測準確度也較高。", "author": "Shangrui Nie et.al.", "authors": "Shangrui Nie, Michael Fromm, Charles Welch, Rebekka Görge, Akbar Karimi, Joan Plepi, Nazia Afsan Mowmita, Nicolas Flores-Herr, Mehdi Ali, Lucie Flek", "id": "2407.05740v1", "paper_url": "http://arxiv.org/abs/2407.05740v1", "repo": "null"}}