{"2408.11876": {"publish_time": "2024-08-20", "title": "From Glucose Patterns to Health Outcomes: A Generalizable Foundation Model for Continuous Glucose Monitor Data Analysis", "paper_summary": "Recent advances in self-supervised learning enabled novel medical AI models,\nknown as foundation models (FMs) that offer great potential for characterizing\nhealth from diverse biomedical data. Continuous glucose monitoring (CGM)\nprovides rich, temporal data on glycemic patterns, but its full potential for\npredicting broader health outcomes remains underutilized. Here, we present\nGluFormer, a generative foundation model on biomedical temporal data based on a\ntransformer architecture, and trained on over 10 million CGM measurements from\n10,812 non-diabetic individuals. We tokenized the CGM training data and trained\nGluFormer using next token prediction in a generative, autoregressive manner.\nWe demonstrate that GluFormer generalizes effectively to 15 different external\ndatasets, including 4936 individuals across 5 different geographical regions, 6\ndifferent CGM devices, and several metabolic disorders, including\nnormoglycemic, prediabetic, and diabetic populations, as well as those with\ngestational diabetes and obesity. GluFormer produces embeddings which\noutperform traditional CGM analysis tools, and achieves high Pearson\ncorrelations in predicting clinical parameters such as HbA1c, liver-related\nparameters, blood lipids, and sleep-related indices. Notably, GluFormer can\nalso predict onset of future health outcomes even 4 years in advance. We also\nshow that CGM embeddings from pre-intervention periods in Randomized Clinical\nTrials (RCTs) outperform other methods in predicting primary and secondary\noutcomes. When integrating dietary data into GluFormer, we show that the\nenhanced model can accurately generate CGM data based only on dietary intake\ndata, simulate outcomes of dietary interventions, and predict individual\nresponses to specific foods. Overall, we show that GluFormer accurately\npredicts health outcomes which generalize across different populations\nmetabolic conditions.", "paper_summary_zh": "<paragraph>自我監督式學習的最新進展促成了新型醫療AI模型，\n稱為基礎模型（FM），它提供了從多樣化的生物醫學數據中表徵\n健康的巨大潛力。連續血糖監測（CGM）\n提供豐富的時間數據，了解血糖模式，但其在\n預測更廣泛的健康結果方面的全部潛力仍未得到充分利用。在此，我們提出\nGluFormer，一個基於Transformer架構的生物醫學時間數據的生成基礎模型，並在超過 1000 萬個 CGM 測量值上進行訓練，來自\n10,812 名非糖尿病患者。我們對 CGM 訓練數據進行了標記化，並使用生成式、自迴歸方式訓練了 GluFormer，以進行下一個標記預測。\n我們證明 GluFormer 有效地概括為 15 個不同的外部\n數據集，包括來自 5 個不同地理區域的 4936 人、6\n不同的 CGM 設備，以及幾種代謝疾病，包括\n常血糖、糖尿病前期和糖尿病人群，以及\n患有妊娠糖尿病和肥胖症的人。GluFormer 產生的嵌入\n優於傳統的 CGM 分析工具，並且在預測 HbA1c、肝臟相關\n參數、血脂和睡眠相關指標等臨床參數時實現了很高的 Pearson\n相關性。值得注意的是，GluFormer 甚至可以\n預測未來健康結果的發作，即使提前 4 年。我們還\n表明，在隨機臨床試驗 (RCT) 中干預前期的 CGM 嵌入\n在預測主要和次要方面優於其他方法\n結果。當將飲食數據整合到 GluFormer 中時，我們表明增強的模型可以僅根據飲食攝入準確生成 CGM 數據\n數據，模擬飲食干預的結果，並預測個體\n對特定食物的反應。總的來說，我們表明 GluFormer 準確\n預測健康結果，這些結果概括了不同的人群\n代謝狀況。</paragraph>", "author": "Guy Lutsker et.al.", "authors": "Guy Lutsker, Gal Sapir, Anastasia Godneva, Smadar Shilo, Jerry R Greenfield, Dorit Samocha-Bonet, Shie Mannor, Eli Meirom, Gal Chechik, Hagai Rossman, Eran Segal", "id": "2408.11876v1", "paper_url": "http://arxiv.org/abs/2408.11876v1", "repo": "null"}}