{"2407.05463": {"publish_time": "2024-07-07", "title": "Training Task Experts through Retrieval Based Distillation", "paper_summary": "One of the most reliable ways to create deployable models for specialized\ntasks is to obtain an adequate amount of high-quality task-specific data.\nHowever, for specialized tasks, often such datasets do not exist. Existing\nmethods address this by creating such data from large language models (LLMs)\nand then distilling such knowledge into smaller models. However, these methods\nare limited by the quality of the LLMs output, and tend to generate repetitive\nor incorrect data. In this work, we present Retrieval Based Distillation\n(ReBase), a method that first retrieves data from rich online sources and then\ntransforms them into domain-specific data. This method greatly enhances data\ndiversity. Moreover, ReBase generates Chain-of-Thought reasoning and distills\nthe reasoning capacity of LLMs. We test our method on 4 benchmarks and results\nshow that our method significantly improves performance by up to 7.8% on SQuAD,\n1.37% on MNLI, and 1.94% on BigBench-Hard.", "paper_summary_zh": "建立可部署模型以執行專業任務最可靠的方法之一，就是取得足夠數量的特定任務高品質資料。不過，對於專業任務而言，通常並不存在此類資料集。現有方法會透過大型語言模型 (LLM) 建立此類資料，然後將此類知識提煉至較小的模型中，來解決這個問題。然而，這些方法受到 LLM 輸出品質的限制，而且傾向產生重複或不正確的資料。在這項工作中，我們提出了基於檢索的提煉 (ReBase)，這是一個方法，它會先從豐富的線上來源中檢索資料，然後將它們轉換成特定領域的資料。此方法大幅提升了資料的多樣性。此外，ReBase 會產生思考鏈推理，並提煉 LLM 的推理能力。我們在 4 個基準上測試了我們的這項方法，結果顯示，我們的這項方法大幅提升了效能，在 SQuAD 上提升了 7.8%、在 MNLI 上提升了 1.37%、在 BigBench-Hard 上提升了 1.94%。", "author": "Jiaxin Ge et.al.", "authors": "Jiaxin Ge, Xueying Jia, Vijay Viswanathan, Hongyin Luo, Graham Neubig", "id": "2407.05463v1", "paper_url": "http://arxiv.org/abs/2407.05463v1", "repo": "null"}}