{"2404.11809": {"publish_time": "2024-04-18", "title": "Sharing Parameter by Conjugation for Knowledge Graph Embeddings in Complex Space", "paper_summary": "A Knowledge Graph (KG) is the directed graphical representation of entities\nand relations in the real world. KG can be applied in diverse Natural Language\nProcessing (NLP) tasks where knowledge is required. The need to scale up and\ncomplete KG automatically yields Knowledge Graph Embedding (KGE), a shallow\nmachine learning model that is suffering from memory and training time\nconsumption issues. To mitigate the computational load, we propose a\nparameter-sharing method, i.e., using conjugate parameters for complex numbers\nemployed in KGE models. Our method improves memory efficiency by 2x in relation\nembedding while achieving comparable performance to the state-of-the-art\nnon-conjugate models, with faster, or at least comparable, training time. We\ndemonstrated the generalizability of our method on two best-performing KGE\nmodels $5^{\\bigstar}\\mathrm{E}$ and $\\mathrm{ComplEx}$ on five benchmark\ndatasets.", "paper_summary_zh": "知識圖譜 (KG) 是實體和關係在現實世界中的有向圖形表示。KG 可應用於需要知識的多樣化自然語言處理 (NLP) 任務。自動擴充和完成 KG 的需求產生了知識圖譜嵌入 (KGE)，這是一種淺層機器學習模型，它會受到記憶體和訓練時間消耗問題的影響。為減輕計算負載，我們提出了一種參數共用方法，即使用共軛參數來運用於 KGE 模型中的複數。我們的模型在關係嵌入中將記憶體效率提升了 2 倍，同時實現了與最先進的非共軛模型相當的效能，且訓練時間更短，或至少相當。我們在兩個效能最佳的 KGE 模型 $5^{\\bigstar}\\mathrm{E}$ 和 $\\mathrm{ComplEx}$ 上展示了我們的方法在五個基準資料集上的泛化能力。", "author": "Xincan Feng et.al.", "authors": "Xincan Feng, Zhi Qu, Yuchang Cheng, Taro Watanabe, Nobuhiro Yugami", "id": "2404.11809v1", "paper_url": "http://arxiv.org/abs/2404.11809v1", "repo": "https://github.com/xincanfeng/dimension"}}