{"2408.00690": {"publish_time": "2024-08-01", "title": "Improving Text Embeddings for Smaller Language Models Using Contrastive Fine-tuning", "paper_summary": "While Large Language Models show remarkable performance in natural language\nunderstanding, their resource-intensive nature makes them less accessible. In\ncontrast, smaller language models such as MiniCPM offer more sustainable\nscalability, but often underperform without specialized optimization. In this\npaper, we explore the enhancement of smaller language models through the\nimprovement of their text embeddings. We select three language models, MiniCPM,\nPhi-2, and Gemma, to conduct contrastive fine-tuning on the NLI dataset. Our\nresults demonstrate that this fine-tuning method enhances the quality of text\nembeddings for all three models across various benchmarks, with MiniCPM showing\nthe most significant improvements of an average 56.33\\% performance gain. The\ncontrastive fine-tuning code is publicly available at\nhttps://github.com/trapoom555/Language-Model-STS-CFT.", "paper_summary_zh": "雖然大型語言模型在自然語言理解方面展現出卓越的效能，但其資源密集的本質使其較難以取得。相較之下，像 MiniCPM 等較小的語言模型提供了更永續的可擴充性，但通常在沒有特殊最佳化的情況下表現不佳。在本文中，我們探討了透過改善其文字嵌入來增強較小語言模型的方法。我們選取了三個語言模型，MiniCPM、Phi-2 和 Gemma，在 NLI 資料集上進行對比微調。我們的結果證明，這種微調方法提升了所有三個模型在各種基準上的文字嵌入品質，其中 MiniCPM 顯示出最顯著的改進，平均效能提升了 56.33%。對比微調程式碼已公開在 https://github.com/trapoom555/Language-Model-STS-CFT。", "author": "Trapoom Ukarapol et.al.", "authors": "Trapoom Ukarapol, Zhicheng Lee, Amy Xin", "id": "2408.00690v1", "paper_url": "http://arxiv.org/abs/2408.00690v1", "repo": "null"}}