{"2406.04606": {"publish_time": "2024-06-07", "title": "Helpful or Harmful Data? Fine-tuning-free Shapley Attribution for Explaining Language Model Predictions", "paper_summary": "The increasing complexity of foundational models underscores the necessity\nfor explainability, particularly for fine-tuning, the most widely used training\nmethod for adapting models to downstream tasks. Instance attribution, one type\nof explanation, attributes the model prediction to each training example by an\ninstance score. However, the robustness of instance scores, specifically\ntowards dataset resampling, has been overlooked. To bridge this gap, we propose\na notion of robustness on the sign of the instance score. We theoretically and\nempirically demonstrate that the popular leave-one-out-based methods lack\nrobustness, while the Shapley value behaves significantly better, but at a\nhigher computational cost. Accordingly, we introduce an efficient\nfine-tuning-free approximation of the Shapley value (FreeShap) for instance\nattribution based on the neural tangent kernel. We empirically demonstrate that\nFreeShap outperforms other methods for instance attribution and other\ndata-centric applications such as data removal, data selection, and wrong label\ndetection, and further generalize our scale to large language models (LLMs).\nOur code is available at https://github.com/JTWang2000/FreeShap.", "paper_summary_zh": "基础模型日益复杂，凸显了可解释性的必要性，特别是对于微调，这是用于将模型调整为下游任务的最广泛使用的训练方法。实例归因是一种解释，它通过实例分数将模型预测归因于每个训练示例。然而，实例分数的鲁棒性，特别是对于数据集重新采样，已被忽视。为了弥合这一差距，我们提出了一个关于实例分数符号的鲁棒性概念。我们从理论和经验上证明，流行的留一法缺乏鲁棒性，而 Shapley 值表现得明显更好，但计算成本更高。因此，我们引入了一种基于神经切线核的 Shapley 值（FreeShap）的高效微调自由近似值，用于实例归因。我们通过实验证明，FreeShap 在实例归因和其他以数据为中心的任务（例如数据删除、数据选择和错误标签检测）方面优于其他方法，并进一步将我们的规模推广到大型语言模型 (LLM)。我们的代码可在 https://github.com/JTWang2000/FreeShap 获得。", "author": "Jingtan Wang et.al.", "authors": "Jingtan Wang, Xiaoqiang Lin, Rui Qiao, Chuan-Sheng Foo, Bryan Kian Hsiang Low", "id": "2406.04606v1", "paper_url": "http://arxiv.org/abs/2406.04606v1", "repo": "https://github.com/jtwang2000/freeshap"}}