{"2406.17675": {"publish_time": "2024-06-25", "title": "Quantifying AI Psychology: A Psychometrics Benchmark for Large Language Models", "paper_summary": "Large Language Models (LLMs) have demonstrated exceptional task-solving\ncapabilities, increasingly adopting roles akin to human-like assistants. The\nbroader integration of LLMs into society has sparked interest in whether they\nmanifest psychological attributes, and whether these attributes are\nstable-inquiries that could deepen the understanding of their behaviors.\nInspired by psychometrics, this paper presents a framework for investigating\npsychology in LLMs, including psychological dimension identification,\nassessment dataset curation, and assessment with results validation. Following\nthis framework, we introduce a comprehensive psychometrics benchmark for LLMs\nthat covers six psychological dimensions: personality, values, emotion, theory\nof mind, motivation, and intelligence. This benchmark includes thirteen\ndatasets featuring diverse scenarios and item types. Our findings indicate that\nLLMs manifest a broad spectrum of psychological attributes. We also uncover\ndiscrepancies between LLMs' self-reported traits and their behaviors in\nreal-world scenarios. This paper demonstrates a thorough psychometric\nassessment of LLMs, providing insights into reliable evaluation and potential\napplications in AI and social sciences.", "paper_summary_zh": "大型語言模型 (LLM) 已展現出卓越的任務解決能力，並逐漸扮演類似人類助理的角色。 LLM 更廣泛地整合到社會中，已引起人們對其是否表現出心理屬性，以及這些屬性是否穩定，這些探討可能有助於深入了解其行為。受到心理測量的啟發，本文提出了一個用於調查 LLM 心理學的架構，包括心理維度識別、評估資料集策展，以及透過驗證結果進行評估。遵循此架構，我們為 LLM 引入了一個全面的心理測量基準，涵蓋六個心理維度：人格、價值觀、情緒、心智理論、動機和智力。此基準包含 13 個資料集，涵蓋各種情境和項目類型。我們的研究結果表明，LLM 表現出廣泛的心理屬性。我們還發現 LLM 自我報告的特質與其在真實世界情境中的行為之間存在差異。本文展示了對 LLM 進行徹底的心理測量評估，提供了對 AI 和社會科學中可靠評估和潛在應用見解。", "author": "Yuan Li et.al.", "authors": "Yuan Li, Yue Huang, Hongyi Wang, Xiangliang Zhang, James Zou, Lichao Sun", "id": "2406.17675v1", "paper_url": "http://arxiv.org/abs/2406.17675v1", "repo": "null"}}