{"2405.04086": {"publish_time": "2024-05-07", "title": "Optimizing Language Model's Reasoning Abilities with Weak Supervision", "paper_summary": "While Large Language Models (LLMs) have demonstrated proficiency in handling\ncomplex queries, much of the past work has depended on extensively annotated\ndatasets by human experts. However, this reliance on fully-supervised\nannotations poses scalability challenges, particularly as models and data\nrequirements grow. To mitigate this, we explore the potential of enhancing\nLLMs' reasoning abilities with minimal human supervision. In this work, we\nintroduce self-reinforcement, which begins with Supervised Fine-Tuning (SFT) of\nthe model using a small collection of annotated questions. Then it iteratively\nimproves LLMs by learning from the differences in responses from the SFT and\nunfinetuned models on unlabeled questions. Our approach provides an efficient\napproach without relying heavily on extensive human-annotated explanations.\nHowever, current reasoning benchmarks typically only include golden-reference\nanswers or rationales. Therefore, we present \\textsc{PuzzleBen}, a weakly\nsupervised benchmark that comprises 25,147 complex questions, answers, and\nhuman-generated rationales across various domains, such as brainteasers,\npuzzles, riddles, parajumbles, and critical reasoning tasks. A unique aspect of\nour dataset is the inclusion of 10,000 unannotated questions, enabling us to\nexplore utilizing fewer supersized data to boost LLMs' inference capabilities.\nOur experiments underscore the significance of \\textsc{PuzzleBen}, as well as\nthe effectiveness of our methodology as a promising direction in future\nendeavors. Our dataset and code will be published soon on \\texttt{Anonymity\nLink}.", "paper_summary_zh": "<paragraph>儘管大型語言模型 (LLM) 已展現出處理複雜查詢的能力，但過去許多工作都依賴人類專家廣泛註解的資料集。然而，這種依賴於完全監督的註解會造成可擴充性的挑戰，特別是在模型和資料需求增加的情況下。為了減輕這個問題，我們探索了透過最少的人類監督來增強 LLM 推理能力的可能性。在這項工作中，我們引入了自我強化，它從使用一小部分註解問題對模型進行監督微調 (SFT) 開始。然後，它透過從 SFT 和未微調模型在未標記問題上的回應差異中學習，反覆改進 LLM。我們的做法提供了一個有效的方法，而無需過度依賴廣泛的人工註解說明。然而，目前的推理基準通常只包含黃金參考答案或依據。因此，我們提出了 \\textsc{PuzzleBen}，一個弱監督基準，它包含了 25,147 個複雜的問題、答案和人類產生的依據，涵蓋各種領域，例如腦筋急轉彎、謎語、謎題、跳字謎和批判性推理任務。我們資料集的一個獨特方面是包含了 10,000 個未註解的問題，使我們能夠探索利用更少的超大型資料來提升 LLM 的推理能力。我們的實驗強調了 \\textsc{PuzzleBen} 的重要性，以及我們的方法作為未來努力中一個有前途的方向的有效性。我們的資料集和程式碼將很快在 \\texttt{Anonymity Link} 上發布。</paragraph>", "author": "Yongqi Tong et.al.", "authors": "Yongqi Tong, Sizhe Wang, Dawei Li, Yifan Wang, Simeng Han, Zi Lin, Chengsong Huang, Jiaxin Huang, Jingbo Shang", "id": "2405.04086v1", "paper_url": "http://arxiv.org/abs/2405.04086v1", "repo": "null"}}