{"2502.11114": {"publish_time": "2025-02-16", "title": "Beyond Pairwise: Global Zero-shot Temporal Graph Generation", "paper_summary": "Temporal relation extraction (TRE) is a fundamental task in natural language\nprocessing (NLP) that involves identifying the temporal relationships between\nevents in a document. Despite the advances in large language models (LLMs),\ntheir application to TRE remains limited. Most existing approaches rely on\npairwise classification, in which event pairs are considered individually,\nleading to computational inefficiency and a lack of global consistency in the\nresulting temporal graph. In this work, we propose a novel zero-shot method for\nTRE that generates a document's complete temporal graph at once, then applies\ntransitive constraints optimization to refine predictions and enforce temporal\nconsistency across relations. Additionally, we introduce OmniTemp, a new\ndataset with complete annotations for all pairs of targeted events within a\ndocument. Through experiments and analyses, we demonstrate that our method\nsignificantly outperforms existing zero-shot approaches while achieving\ncompetitive performance with supervised models.", "paper_summary_zh": "時間關係抽取 (TRE) 是自然語言處理 (NLP) 中的一項基本任務，涉及識別文件中事件之間的時間關係。儘管大型語言模型 (LLM) 取得進展，但它們在 TRE 中的應用仍然有限。現有的大多數方法依賴於成對分類，其中事件對被單獨考慮，導致計算效率低下且在生成的時序圖中缺乏全局一致性。在這項工作中，我們提出了一種新穎的 TRE 零次學習方法，它可以一次生成文件的完整時序圖，然後應用遞移約束最佳化來優化預測並強制關係之間的時間一致性。此外，我們引入了 OmniTemp，這是一個新的數據集，其中包含文件內所有目標事件對的完整註解。通過實驗和分析，我們證明了我們的方法明顯優於現有的零次學習方法，同時實現了與監督模型相當的性能。", "author": "Alon Eirew et.al.", "authors": "Alon Eirew, Kfir Bar, Ido Dagan", "id": "2502.11114v1", "paper_url": "http://arxiv.org/abs/2502.11114v1", "repo": "null"}}