{"2412.01703": {"publish_time": "2024-12-02", "title": "Deep Guess acceleration for explainable image reconstruction in sparse-view CT", "paper_summary": "Sparse-view Computed Tomography (CT) is an emerging protocol designed to\nreduce X-ray dose radiation in medical imaging. Traditional Filtered Back\nProjection algorithm reconstructions suffer from severe artifacts due to sparse\ndata. In contrast, Model-Based Iterative Reconstruction (MBIR) algorithms,\nthough better at mitigating noise through regularization, are too\ncomputationally costly for clinical use. This paper introduces a novel\ntechnique, denoted as the Deep Guess acceleration scheme, using a trained\nneural network both to quicken the regularized MBIR and to enhance the\nreconstruction accuracy. We integrate state-of-the-art deep learning tools to\ninitialize a clever starting guess for a proximal algorithm solving a\nnon-convex model and thus computing an interpretable solution image in a few\niterations. Experimental results on real CT images demonstrate the Deep Guess\neffectiveness in (very) sparse tomographic protocols, where it overcomes its\nmere variational counterpart and many data-driven approaches at the state of\nthe art. We also consider a ground truth-free implementation and test the\nrobustness of the proposed framework to noise.", "paper_summary_zh": "稀疏視圖電腦斷層掃描 (CT) 是一種新興的協定，旨在減少醫療影像中的 X 射線劑量輻射。傳統的濾波反向投影演算法重建因稀疏資料而導致嚴重的偽影。相比之下，基於模型的迭代重建 (MBIR) 演算法，雖然透過正則化在減輕雜訊方面表現得更好，但對於臨床使用而言，其計算成本過高。本文介紹了一種創新的技術，稱為 Deep Guess 加速方案，它使用訓練過的類神經網路來加速正則化的 MBIR 並增強重建準確度。我們整合了最先進的深度學習工具，為求解非凸模型的近端演算法初始化一個聰明的起始猜測，從而僅在幾次迭代中計算出可解釋的解影像。在真實 CT 影像上的實驗結果證明了 Deep Guess 在（非常）稀疏斷層攝影協定中的有效性，在該協定中，它克服了其單純的變分對應物和許多最先進的資料驅動方法。我們還考慮了無真實依據的實作，並測試了所提出的架構對雜訊的穩健性。", "author": "Elena Loli Piccolomini et.al.", "authors": "Elena Loli Piccolomini, Davide Evangelista, Elena Morotti", "id": "2412.01703v1", "paper_url": "http://arxiv.org/abs/2412.01703v1", "repo": "null"}}