{"2409.16997": {"publish_time": "2024-09-25", "title": "INT-FlashAttention: Enabling Flash Attention for INT8 Quantization", "paper_summary": "As the foundation of large language models (LLMs), self-attention module\nfaces the challenge of quadratic time and memory complexity with respect to\nsequence length. FlashAttention accelerates attention computation and reduces\nits memory usage by leveraging the GPU memory hierarchy. A promising research\ndirection is to integrate FlashAttention with quantization methods. This paper\nintroduces INT-FlashAttention, the first INT8 quantization architecture\ncompatible with the forward workflow of FlashAttention, which significantly\nimproves the inference speed of FlashAttention on Ampere GPUs. We implement our\nINT-FlashAttention prototype with fully INT8 activations and general\nmatrix-multiplication (GEMM) kernels, making it the first attention operator\nwith fully INT8 input. As a general token-level post-training quantization\nframework, INT-FlashAttention is also compatible with other data formats like\nINT4, etc. Experimental results show INT-FlashAttention achieves 72% faster\ninference speed and 82% smaller quantization error compared to standard\nFlashAttention with FP16 and FP8 data format.", "paper_summary_zh": "作為大型語言模型 (LLM) 的基礎，自注意力模組在序列長度方面面臨二次時間和記憶體複雜度的挑戰。FlashAttention 透過利用 GPU 記憶體階層來加速注意力計算並減少其記憶體使用量。一個有前途的研究方向是將 FlashAttention 與量化方法整合在一起。本文介紹 INT-FlashAttention，這是第一個與 FlashAttention 的前向工作流程相容的 INT8 量化架構，它顯著提升了 FlashAttention 在 Ampere GPU 上的推論速度。我們實作了具有完整 INT8 啟用和一般矩陣乘法 (GEMM) 核心之 INT-FlashAttention 原型，使其成為第一個具有完整 INT8 輸入的注意力運算子。作為一個通用的標記層級後訓練量化架構，INT-FlashAttention 也與其他資料格式相容，例如 INT4 等。實驗結果顯示，與具有 FP16 和 FP8 資料格式的標準 FlashAttention 相比，INT-FlashAttention 的推論速度快了 72%，量化誤差小了 82%。", "author": "Shimao Chen et.al.", "authors": "Shimao Chen, Zirui Liu, Zhiying Wu, Ce Zheng, Peizhuang Cong, Zihan Jiang, Yuhan Wu, Lei Su, Tong Yang", "id": "2409.16997v2", "paper_url": "http://arxiv.org/abs/2409.16997v2", "repo": "https://github.com/int-flashattention2024/int-flashattention"}}