{"2502.13044": {"publish_time": "2025-02-18", "title": "Do we still need Human Annotators? Prompting Large Language Models for Aspect Sentiment Quad Prediction", "paper_summary": "Aspect sentiment quadruple prediction (ASQP) facilitates a detailed\nunderstanding of opinions expressed in a text by identifying the opinion term,\naspect term, aspect category and sentiment polarity for each opinion. However,\nannotating a full set of training examples to fine-tune models for ASQP is a\nresource-intensive process. In this study, we explore the capabilities of large\nlanguage models (LLMs) for zero- and few-shot learning on the ASQP task across\nfive diverse datasets. We report F1 scores slightly below those obtained with\nstate-of-the-art fine-tuned models but exceeding previously reported zero- and\nfew-shot performance. In the 40-shot setting on the Rest16 restaurant domain\ndataset, LLMs achieved an F1 score of 52.46, compared to 60.39 by the\nbest-performing fine-tuned method MVP. Additionally, we report the performance\nof LLMs in target aspect sentiment detection (TASD), where the F1 scores were\nalso close to fine-tuned models, achieving 66.03 on Rest16 in the 40-shot\nsetting, compared to 72.76 with MVP. While human annotators remain essential\nfor achieving optimal performance, LLMs can reduce the need for extensive\nmanual annotation in ASQP tasks.", "paper_summary_zh": "面向觀點的四元預測 (ASQP) 透過辨識各個觀點的觀點詞彙、面向詞彙、面向類別和觀點極性，協助詳細了解文字中表達的意見。然而，標註一組完整的訓練範例以微調 ASQP 模型是一個耗費資源的過程。在這項研究中，我們探討大型語言模型 (LLM) 在 ASQP 任務中進行零次和少量學習的能力，橫跨五個不同的資料集。我們報告的 F1 分數略低於使用最先進的微調模型獲得的分數，但超過先前報告的零次和少量學習表現。在 Rest16 餐廳領域資料集的 40 次學習設定中，LLM 達到了 52.46 的 F1 分數，而效能最佳的微調方法 MVP 則為 60.39。此外，我們報告了 LLM 在目標面向觀點偵測 (TASD) 中的表現，其中 F1 分數也接近微調模型，在 40 次學習設定中於 Rest16 達到 66.03，而 MVP 則為 72.76。儘管人類標註員對於達成最佳效能仍然至關重要，但 LLM 可以減少 ASQP 任務中廣泛手動標註的需求。", "author": "Nils Constantin Hellwig et.al.", "authors": "Nils Constantin Hellwig, Jakob Fehle, Udo Kruschwitz, Christian Wolff", "id": "2502.13044v1", "paper_url": "http://arxiv.org/abs/2502.13044v1", "repo": "null"}}