{"2407.07392": {"publish_time": "2024-07-10", "title": "Malicious Path Manipulations via Exploitation of Representation Vulnerabilities of Vision-Language Navigation Systems", "paper_summary": "Building on the unprecedented capabilities of large language models for\ncommand understanding and zero-shot recognition of multi-modal vision-language\ntransformers, visual language navigation (VLN) has emerged as an effective way\nto address multiple fundamental challenges toward a natural language interface\nto robot navigation. However, such vision-language models are inherently\nvulnerable due to the lack of semantic meaning of the underlying embedding\nspace. Using a recently developed gradient based optimization procedure, we\ndemonstrate that images can be modified imperceptibly to match the\nrepresentation of totally different images and unrelated texts for a\nvision-language model. Building on this, we develop algorithms that can\nadversarially modify a minimal number of images so that the robot will follow a\nroute of choice for commands that require a number of landmarks. We demonstrate\nthat experimentally using a recently proposed VLN system; for a given\nnavigation command, a robot can be made to follow drastically different routes.\nWe also develop an efficient algorithm to detect such malicious modifications\nreliably based on the fact that the adversarially modified images have much\nhigher sensitivity to added Gaussian noise than the original images.", "paper_summary_zh": "建立在大语言模型对命令理解和多模态视觉语言转换器的零样本识别能力的基础上，视觉语言导航 (VLN) 已成为解决面向机器人导航的自然语言界面的多个基本挑战的有效方法。然而，由于底层嵌入空间缺乏语义意义，此类视觉语言模型本质上是脆弱的。使用最近开发的基于梯度的优化程序，我们证明可以对图像进行不可察觉的修改，以匹配视觉语言模型中完全不同图像和无关文本的表示。在此基础上，我们开发了对抗性修改最小数量图像的算法，以便机器人按照需要多个地标的命令选择一条路线。我们使用最近提出的 VLN 系统进行了实验性演示；对于给定的导航命令，可以使机器人按照截然不同的路线前进。我们还开发了一种有效的算法来可靠地检测此类恶意修改，事实是，对抗性修改的图像对添加的高斯噪声的敏感性远高于原始图像。", "author": "Chashi Mahiul Islam et.al.", "authors": "Chashi Mahiul Islam, Shaeke Salman, Montasir Shams, Xiuwen Liu, Piyush Kumar", "id": "2407.07392v1", "paper_url": "http://arxiv.org/abs/2407.07392v1", "repo": "null"}}