{"2406.03151": {"publish_time": "2024-06-05", "title": "Which Side Are You On? A Multi-task Dataset for End-to-End Argument Summarisation and Evaluation", "paper_summary": "With the recent advances of large language models (LLMs), it is no longer\ninfeasible to build an automated debate system that helps people to synthesise\npersuasive arguments. Previous work attempted this task by integrating multiple\ncomponents. In our work, we introduce an argument mining dataset that captures\nthe end-to-end process of preparing an argumentative essay for a debate, which\ncovers the tasks of claim and evidence identification (Task 1 ED), evidence\nconvincingness ranking (Task 2 ECR), argumentative essay summarisation and\nhuman preference ranking (Task 3 ASR) and metric learning for automated\nevaluation of resulting essays, based on human feedback along argument quality\ndimensions (Task 4 SQE). Our dataset contains 14k examples of claims that are\nfully annotated with the various properties supporting the aforementioned\ntasks. We evaluate multiple generative baselines for each of these tasks,\nincluding representative LLMs. We find, that while they show promising results\non individual tasks in our benchmark, their end-to-end performance on all four\ntasks in succession deteriorates significantly, both in automated measures as\nwell as in human-centred evaluation. This challenge presented by our proposed\ndataset motivates future research on end-to-end argument mining and\nsummarisation. The repository of this project is available at\nhttps://github.com/HarrywillDr/ArgSum-Datatset", "paper_summary_zh": "<paragraph>隨著大型語言模型 (LLM) 的最新進展，建立一個自動化辯論系統來幫助人們綜合有說服力的論點已不再不可行。先前的研究嘗試透過整合多個組成部分來達成這項任務。在我們的研究中，我們引入了一個論點挖掘資料集，它擷取了為辯論準備論證文章的端對端流程，其中涵蓋了論點和證據識別（任務 1 ED）、證據說服力排名（任務 2 ECR）、論證文章摘要和人類偏好排名（任務 3 ASR）以及基於人類回饋的論證品質維度對結果文章進行自動化評估的度量學習（任務 4 SQE）。我們的資料集包含 14k 個論點範例，並針對支援上述任務的各種屬性進行了完整的註解。我們針對這些任務中的每一個任務評估了多個生成基準，包括具代表性的 LLM。我們發現，儘管它們在基準中的個別任務上表現出有希望的結果，但它們在連續四個任務上的端對端效能卻顯著下降，無論是在自動化測量還是以人為中心的評估中都是如此。我們提出的資料集所呈現的這個挑戰，激勵了未來對端對端論點挖掘和摘要的研究。此專案的存放庫可以在 https://github.com/HarrywillDr/ArgSum-Datatset 取得</paragraph>", "author": "Hao Li et.al.", "authors": "Hao Li, Yuping Wu, Viktor Schlegel, Riza Batista-Navarro, Tharindu Madusanka, Iqra Zahid, Jiayan Zeng, Xiaochi Wang, Xinran He, Yizhi Li, Goran Nenadic", "id": "2406.03151v1", "paper_url": "http://arxiv.org/abs/2406.03151v1", "repo": "null"}}