{"2410.10626": {"publish_time": "2024-10-14", "title": "Efficiently Democratizing Medical LLMs for 50 Languages via a Mixture of Language Family Experts", "paper_summary": "Adapting medical Large Language Models to local languages can reduce barriers\nto accessing healthcare services, but data scarcity remains a significant\nchallenge, particularly for low-resource languages. To address this, we first\nconstruct a high-quality medical dataset and conduct analysis to ensure its\nquality. In order to leverage the generalization capability of multilingual\nLLMs to efficiently scale to more resource-constrained languages, we explore\nthe internal information flow of LLMs from a multilingual perspective using\nMixture of Experts (MoE) modularity. Technically, we propose a novel MoE\nrouting method that employs language-specific experts and cross-lingual\nrouting. Inspired by circuit theory, our routing analysis revealed a Spread Out\nin the End information flow mechanism: while earlier layers concentrate\ncross-lingual information flow, the later layers exhibit language-specific\ndivergence. This insight directly led to the development of the Post-MoE\narchitecture, which applies sparse routing only in the later layers while\nmaintaining dense others. Experimental results demonstrate that this approach\nenhances the generalization of multilingual models to other languages while\npreserving interpretability. Finally, to efficiently scale the model to 50\nlanguages, we introduce the concept of language family experts, drawing on\nlinguistic priors, which enables scaling the number of languages without adding\nadditional parameters.", "paper_summary_zh": "<paragraph>針對當地語言調整大型醫療語言模型能減少取得醫療保健服務的障礙，但資料稀少的問題仍然是一項重大挑戰，特別是對於低資源語言來說。為了解決這個問題，我們首先建構一個高品質的醫療資料集，並進行分析以確保其品質。為了善用多語言 LLM 的概化能力，以有效擴展到更多資源受限的語言，我們從多語言的角度探索 LLM 的內部資訊流，並使用專家混合 (MoE) 模組化。在技術上，我們提出了一種創新的 MoE 路由方法，採用特定語言的專家和跨語言路由。受到電路理論的啟發，我們的路由分析揭示了一個在最後分散的資訊流機制：早期層集中跨語言資訊流，而後續層則展現出特定語言的分歧。這個見解直接導致後 MoE 架構的發展，它僅在後續層套用稀疏路由，同時維持其他層的稠密。實驗結果證明，這種方法增強了多語言模型對其他語言的概化能力，同時保留了解釋能力。最後，為了有效地將模型擴展到 50 種語言，我們引入了語言家族專家的概念，利用語言先驗，這使得我們可以在不增加額外參數的情況下擴展語言數量。</paragraph>", "author": "Guorui Zheng et.al.", "authors": "Guorui Zheng, Xidong Wang, Juhao Liang, Nuo Chen, Yuping Zheng, Benyou Wang", "id": "2410.10626v1", "paper_url": "http://arxiv.org/abs/2410.10626v1", "repo": "https://github.com/freedomintelligence/apollomoe"}}