{"2410.21647": {"publish_time": "2024-10-29", "title": "Can Language Models Replace Programmers? REPOCOD Says 'Not Yet'", "paper_summary": "Large language models (LLMs) have shown remarkable ability in code generation\nwith more than 90 pass@1 in solving Python coding problems in HumanEval and\nMBPP. Such high accuracy leads to the question: can LLMs replace human\nprogrammers? Existing manual crafted, simple, or single-line code generation\nbenchmarks cannot answer this question due to their gap with real-world\nsoftware development. To answer this question, we propose REPOCOD, a code\ngeneration benchmark with 980 problems collected from 11 popular real-world\nprojects, with more than 58% of them requiring file-level or repository-level\ncontext information. In addition, REPOCOD has the longest average canonical\nsolution length (331.6 tokens) and the highest average cyclomatic complexity\n(9.00) compared to existing benchmarks. In our evaluations on ten LLMs, none of\nthe models can achieve more than 30 pass@1 on REPOCOD, disclosing the necessity\nof building stronger LLMs that can help developers in real-world software\ndevelopment.", "paper_summary_zh": "大型语言模型 (LLM) 在代码生成方面表现出非凡的能力，在 HumanEval 和 MBPP 中解决 Python 编码问题时，其 pass@1 超过 90。如此高的准确性引发了一个问题：LLM 能否取代人类程序员？现有的手工制作、简单或单行代码生成基准无法回答这个问题，因为它们与实际软件开发存在差距。为了回答这个问题，我们提出了 REPOCOD，这是一个代码生成基准，其中包含从 11 个流行的实际项目收集的 980 个问题，其中超过 58% 的问题需要文件级或存储库级的上下文信息。此外，与现有基准相比，REPOCOD 具有最长的平均规范解决方案长度 (331.6 个标记) 和最高的平均圈复杂度 (9.00)。在对十个 LLM 的评估中，没有一个模型在 REPOCOD 上的 pass@1 能够达到 30 以上，这揭示了构建更强大的 LLM 的必要性，这些 LLM 可以帮助开发人员进行实际软件开发。", "author": "Shanchao Liang et.al.", "authors": "Shanchao Liang, Yiran Hu, Nan Jiang, Lin Tan", "id": "2410.21647v1", "paper_url": "http://arxiv.org/abs/2410.21647v1", "repo": "null"}}