{"2406.07970": {"publish_time": "2024-06-12", "title": "Guiding In-Context Learning of LLMs through Quality Estimation for Machine Translation", "paper_summary": "The quality of output from large language models (LLMs), particularly in\nmachine translation (MT), is closely tied to the quality of in-context examples\n(ICEs) provided along with the query, i.e., the text to translate. The\neffectiveness of these ICEs is influenced by various factors, such as the\ndomain of the source text, the order in which the ICEs are presented, the\nnumber of these examples, and the prompt templates used. Naturally, selecting\nthe most impactful ICEs depends on understanding how these affect the resulting\ntranslation quality, which ultimately relies on translation references or human\njudgment. This paper presents a novel methodology for in-context learning (ICL)\nthat relies on a search algorithm guided by domain-specific quality estimation\n(QE). Leveraging the XGLM model, our methodology estimates the resulting\ntranslation quality without the need for translation references, selecting\neffective ICEs for MT to maximize translation quality. Our results demonstrate\nsignificant improvements over existing ICL methods and higher translation\nperformance compared to fine-tuning a pre-trained language model (PLM),\nspecifically mBART-50.", "paper_summary_zh": "大型語言模型 (LLM) 的輸出品質，特別是在機器翻譯 (MT) 中，與查詢中提供的語境範例 (ICE) 品質密切相關，亦即要翻譯的文字。這些 ICE 的有效性受到各種因素影響，例如來源文本的領域、ICE 呈現的順序、這些範例的數量以及使用的提示範本。自然地，選擇影響最大的 ICE 取決於了解這些 ICE 如何影響最終的翻譯品質，這最終取決於翻譯參考或人類判斷。本文提出了一種新的語境學習 (ICL) 方法，該方法依賴於由特定領域品質估計 (QE) 指導的搜尋演算法。運用 XGLM 模型，我們的技術在不需要翻譯參考的情況下估計最終的翻譯品質，為機器翻譯選擇有效的 ICE 以最大化翻譯品質。我們的結果證明了與現有的 ICL 方法相比有顯著的進步，並且與微調預先訓練的語言模型 (PLM)，特別是 mBART-50 相比，翻譯效能更高。", "author": "Javad Pourmostafa Roshan Sharami et.al.", "authors": "Javad Pourmostafa Roshan Sharami, Dimitar Shterionov, Pieter Spronck", "id": "2406.07970v1", "paper_url": "http://arxiv.org/abs/2406.07970v1", "repo": "null"}}