{"2503.08681": {"publish_time": "2025-03-11", "title": "Self-Taught Self-Correction for Small Language Models", "paper_summary": "Although large language models (LLMs) have achieved remarkable performance\nacross various tasks, they remain prone to errors. A key challenge is enabling\nthem to self-correct. While prior research has relied on external tools or\nlarge proprietary models, this work explores self-correction in small language\nmodels (SLMs) through iterative fine-tuning using solely self-generated data.\nWe introduce the Self-Taught Self-Correction (STaSC) algorithm, which\nincorporates multiple algorithmic design choices. Experimental results on a\nquestion-answering task demonstrate that STaSC effectively learns\nself-correction, leading to significant performance improvements. Our analysis\nfurther provides insights into the mechanisms of self-correction and the impact\nof different design choices on learning dynamics and overall performance. To\nsupport future research, we release our user-friendly codebase and lightweight\nmodels.", "paper_summary_zh": "<paragraph>雖然大型語言模型 (LLM) 在各種任務中都取得了顯著的成果，但它們仍然容易出錯。一個關鍵的挑戰是如何讓它們自我糾正。雖然先前的研究依賴於外部工具或大型專有模型，但這項工作探索了小型語言模型 (SLM) 中的自我糾正，方法是僅使用自生成數據進行迭代微調。我們引入了自學式自我糾正 (STaSC) 演算法，它包含了多種演算法設計選擇。在問答任務上的實驗結果表明，STaSC 能有效地學習自我糾正，從而顯著提高效能。我們的分析進一步提供了對自我糾正機制以及不同設計選擇對學習動態和整體效能影響的洞察。為了支持未來的研究，我們發布了我們易於使用的程式碼庫和輕量級模型。</paragraph>\n", "author": "Viktor Moskvoretskii et.al.", "authors": "Viktor Moskvoretskii, Chris Biemann, Irina Nikishina", "id": "2503.08681v1", "paper_url": "http://arxiv.org/abs/2503.08681v1", "repo": "null"}}