{"2405.17129": {"publish_time": "2024-05-27", "title": "TEII: Think, Explain, Interact and Iterate with Large Language Models to Solve Cross-lingual Emotion Detection", "paper_summary": "Cross-lingual emotion detection allows us to analyze global trends, public\nopinion, and social phenomena at scale. We participated in the Explainability\nof Cross-lingual Emotion Detection (EXALT) shared task, achieving an F1-score\nof 0.6046 on the evaluation set for the emotion detection sub-task. Our system\noutperformed the baseline by more than 0.16 F1-score absolute, and ranked\nsecond amongst competing systems. We conducted experiments using fine-tuning,\nzero-shot learning, and few-shot learning for Large Language Model (LLM)-based\nmodels as well as embedding-based BiLSTM and KNN for non-LLM-based techniques.\nAdditionally, we introduced two novel methods: the Multi-Iteration Agentic\nWorkflow and the Multi-Binary-Classifier Agentic Workflow. We found that\nLLM-based approaches provided good performance on multilingual emotion\ndetection. Furthermore, ensembles combining all our experimented models yielded\nhigher F1-scores than any single approach alone.", "paper_summary_zh": "跨語言情緒偵測讓我們得以大規模分析全球趨勢、輿論和社會現象。我們參與了跨語言情緒偵測解釋能力 (EXALT) 共享任務，在情緒偵測子任務的評估集中取得了 0.6046 的 F1 分數。我們的系統在絕對 F1 分數上優於基準線 0.16 分以上，在競爭系統中排名第二。我們使用微調、零次學習和少量學習對大型語言模型 (LLM) 進行了實驗，並對非 LLM 技術使用了基於嵌入的 BiLSTM 和 KNN。此外，我們引入了兩種新方法：多重迭代代理工作流程和多二進制分類器代理工作流程。我們發現，LLM 方法在多語言情緒偵測上提供了良好的效能。此外，結合我們所有實驗模型的集成體比任何單一方法單獨產生的 F1 分數更高。", "author": "Long Cheng et.al.", "authors": "Long Cheng, Qihao Shao, Christine Zhao, Sheng Bi, Gina-Anne Levow", "id": "2405.17129v1", "paper_url": "http://arxiv.org/abs/2405.17129v1", "repo": "null"}}