{"2405.06266": {"publish_time": "2024-05-10", "title": "A Multi-Channel Spatial-Temporal Transformer Model for Traffic Flow Forecasting", "paper_summary": "Traffic flow forecasting is a crucial task in transportation management and\nplanning. The main challenges for traffic flow forecasting are that (1) as the\nlength of prediction time increases, the accuracy of prediction will decrease;\n(2) the predicted results greatly rely on the extraction of temporal and\nspatial dependencies from the road networks. To overcome the challenges\nmentioned above, we propose a multi-channel spatial-temporal transformer model\nfor traffic flow forecasting, which improves the accuracy of the prediction by\nfusing results from different channels of traffic data. Our approach leverages\ngraph convolutional network to extract spatial features from each channel while\nusing a transformer-based architecture to capture temporal dependencies across\nchannels. We introduce an adaptive adjacency matrix to overcome limitations in\nfeature extraction from fixed topological structures. Experimental results on\nsix real-world datasets demonstrate that introducing a multi-channel mechanism\ninto the temporal model enhances performance and our proposed model outperforms\nstate-of-the-art models in terms of accuracy.", "paper_summary_zh": "交通流量預測是運輸管理和規劃中的重要任務。交通流量預測的主要挑戰在於：(1) 隨著預測時間的增加，預測的準確度會下降；(2) 預測結果極度依賴從道路網路中擷取時間和空間依賴性。為了克服上述挑戰，我們提出一個多通道時空轉換器模型用於交通流量預測，這透過融合來自不同交通資料通道的結果來提高預測準確度。我們的做法利用圖形卷積網路從每個通道擷取空間特徵，同時使用基於轉換器的架構來擷取跨通道的時間依賴性。我們引入一個自適應鄰接矩陣，以克服從固定拓撲結構中擷取特徵的限制。在六個真實世界資料集上的實驗結果證明，將多通道機制引入時間模型會增強效能，而我們提出的模型在準確度方面優於最先進的模型。", "author": "Jianli Xiao et.al.", "authors": "Jianli Xiao, Baichao Long", "id": "2405.06266v1", "paper_url": "http://arxiv.org/abs/2405.06266v1", "repo": "null"}}