{"2405.07992": {"publish_time": "2024-05-13", "title": "MambaOut: Do We Really Need Mamba for Vision?", "paper_summary": "Mamba, an architecture with RNN-like token mixer of state space model (SSM),\nwas recently introduced to address the quadratic complexity of the attention\nmechanism and subsequently applied to vision tasks. Nevertheless, the\nperformance of Mamba for vision is often underwhelming when compared with\nconvolutional and attention-based models. In this paper, we delve into the\nessence of Mamba, and conceptually conclude that Mamba is ideally suited for\ntasks with long-sequence and autoregressive characteristics. For vision tasks,\nas image classification does not align with either characteristic, we\nhypothesize that Mamba is not necessary for this task; Detection and\nsegmentation tasks are also not autoregressive, yet they adhere to the\nlong-sequence characteristic, so we believe it is still worthwhile to explore\nMamba's potential for these tasks. To empirically verify our hypotheses, we\nconstruct a series of models named MambaOut through stacking Mamba blocks while\nremoving their core token mixer, SSM. Experimental results strongly support our\nhypotheses. Specifically, our MambaOut model surpasses all visual Mamba models\non ImageNet image classification, indicating that Mamba is indeed unnecessary\nfor this task. As for detection and segmentation, MambaOut cannot match the\nperformance of state-of-the-art visual Mamba models, demonstrating the\npotential of Mamba for long-sequence visual tasks. The code is available at\nhttps://github.com/yuweihao/MambaOut", "paper_summary_zh": "Mamba 是一種架構，具有狀態空間模型 (SSM) 的類似 RNN 的代幣混合器，最近被引入以解決注意力機制的二次複雜性，並隨後應用於視覺任務。儘管如此，與基於卷積和注意力的模型相比，Mamba 在視覺方面的表現往往令人失望。在本文中，我們深入探討 Mamba 的本質，並在概念上得出結論，Mamba 非常適合具有長序列和自迴歸特性的任務。對於視覺任務，由於圖像分類不符合任何特徵，我們假設 Mamba 對此任務並非必要；檢測和分割任務也不是自迴歸的，但它們符合長序列特徵，因此我們認為探索 Mamba 在這些任務中的潛力仍然是有價值的。為了經驗驗證我們的假設，我們構建了一系列名為 MambaOut 的模型，通過堆疊 Mamba 塊同時移除其核心代幣混合器 SSM。實驗結果有力地支持了我們的假設。具體來說，我們的 MambaOut 模型在 ImageNet 圖像分類方面超越了所有視覺 Mamba 模型，表明 Mamba 對於此任務確實是不必要的。至於檢測和分割，MambaOut 無法與最先進的視覺 Mamba 模型的性能相匹配，這證明了 Mamba 在長序列視覺任務中的潛力。代碼可在 https://github.com/yuweihao/MambaOut 獲得", "author": "Weihao Yu et.al.", "authors": "Weihao Yu, Xinchao Wang", "id": "2405.07992v2", "paper_url": "http://arxiv.org/abs/2405.07992v2", "repo": "https://github.com/yuweihao/mambaout"}}