{"2412.03098": {"publish_time": "2024-12-04", "title": "A surprisal oracle for when every layer counts", "paper_summary": "Active Curriculum Language Modeling (ACLM; Hong et al., 2023) is a learner\ndirected approach to training a language model. We proposed the original\nversion of this process in our submission to the BabyLM 2023 task, and now we\npropose an updated ACLM process for the BabyLM 2024 task. ACLM involves an\niteratively- and dynamically-constructed curriculum informed over the training\nprocess by a model of uncertainty; other training items that are similarly\nuncertain to a least certain candidate item are prioritized. Our new process\nimproves the similarity model so that it is more dynamic, and we run ACLM over\nthe most successful model from the BabyLM 2023 task: ELC-BERT (Charpentier and\nSamuel, 2023). We find that while our models underperform on fine-grained\ngrammatical inferences, they outperform the BabyLM 2024 official base-lines on\ncommon-sense and world-knowledge tasks. We make our code available at https:\n//github.com/asayeed/ActiveBaby.", "paper_summary_zh": "主動式課程語言模型 (ACLM；Hong 等人，2023) 是一種由學習者引導，用於訓練語言模型的方法。我們在提交給 BabyLM 2023 任務時提出了這個流程的原始版本，現在我們為 BabyLM 2024 任務提出一個更新的 ACLM 流程。ACLM 涉及一個反覆且動態建構的課程，並在訓練過程中由一個不確定性模型提供資訊；其他訓練項目與至少一個最不確定的候選項目相似的不確定項目會被優先處理。我們的流程改進了相似性模型，使其更具動態性，我們在 BabyLM 2023 任務中最成功的模型：ELC-BERT (Charpentier 和 Samuel，2023) 上執行 ACLM。我們發現，儘管我們的模型在細微的語法推論上表現不佳，但它們在常識和世界知識任務上優於 BabyLM 2024 官方基準線。我們在 https://github.com/asayeed/ActiveBaby 上提供我們的程式碼。", "author": "Xudong Hong et.al.", "authors": "Xudong Hong, Sharid Loáiciga, Asad Sayeed", "id": "2412.03098v1", "paper_url": "http://arxiv.org/abs/2412.03098v1", "repo": "https://github.com/asayeed/activebaby"}}