{"2407.04694": {"publish_time": "2024-07-05", "title": "Me, Myself, and AI: The Situational Awareness Dataset (SAD) for LLMs", "paper_summary": "AI assistants such as ChatGPT are trained to respond to users by saying, \"I\nam a large language model\". This raises questions. Do such models know that\nthey are LLMs and reliably act on this knowledge? Are they aware of their\ncurrent circumstances, such as being deployed to the public? We refer to a\nmodel's knowledge of itself and its circumstances as situational awareness. To\nquantify situational awareness in LLMs, we introduce a range of behavioral\ntests, based on question answering and instruction following. These tests form\nthe $\\textbf{Situational Awareness Dataset (SAD)}$, a benchmark comprising 7\ntask categories and over 13,000 questions. The benchmark tests numerous\nabilities, including the capacity of LLMs to (i) recognize their own generated\ntext, (ii) predict their own behavior, (iii) determine whether a prompt is from\ninternal evaluation or real-world deployment, and (iv) follow instructions that\ndepend on self-knowledge.\n  We evaluate 16 LLMs on SAD, including both base (pretrained) and chat models.\nWhile all models perform better than chance, even the highest-scoring model\n(Claude 3 Opus) is far from a human baseline on certain tasks. We also observe\nthat performance on SAD is only partially predicted by metrics of general\nknowledge (e.g. MMLU). Chat models, which are finetuned to serve as AI\nassistants, outperform their corresponding base models on SAD but not on\ngeneral knowledge tasks. The purpose of SAD is to facilitate scientific\nunderstanding of situational awareness in LLMs by breaking it down into\nquantitative abilities. Situational awareness is important because it enhances\na model's capacity for autonomous planning and action. While this has potential\nbenefits for automation, it also introduces novel risks related to AI safety\nand control. Code and latest results available at\nhttps://situational-awareness-dataset.org .", "paper_summary_zh": "<paragraph>ChatGPT 等 AI 助理经过训练，会以「我是大型语言模型」来回应使用者。这引发了一些问题。这些模型是否知道自己是大语言模型，并可靠地根据这项知识采取行动？他们是否意识到自己的当前情况，例如被部署到公众面前？我们将模型对自身及其情况的了解称为情境感知。为了量化大语言模型中的情境感知，我们引入了一系列的行为测试，这些测试基于问答和指令遵循。这些测试构成了「情境感知数据集 (SAD)」，这是一个包含 7 个任务类别和超过 13,000 个问题的基准。该基准测试了许多能力，包括大语言模型 (i) 识别自己生成文本的能力、(ii) 预测自己的行为、(iii) 确定提示是来自内部评估还是实际部署，以及 (iv) 遵循依赖于自我知识的指令。\n我们对 16 个大语言模型进行了 SAD 评估，包括基础（预训练）模型和聊天模型。虽然所有模型的表现都优于机会，但即使是得分最高（Claude 3 Opus）的模型在某些任务上也远低于人类基准。我们还观察到，SAD 上的性能仅部分由一般知识指标（例如 MMLU）预测。经过微调以充当 AI 助理的聊天模型在 SAD 上的表现优于其对应基础模型，但在一般知识任务上则不然。SAD 的目的是通过将其分解为定量能力，促进对大语言模型中情境感知的科学理解。情境感知很重要，因为它增强了模型自主规划和行动的能力。虽然这可能对自动化有好处，但它也引入了与 AI 安全和控制相关的新风险。代码和最新结果可在 https://situational-awareness-dataset.org 获得。</paragraph>", "author": "Rudolf Laine et.al.", "authors": "Rudolf Laine, Bilal Chughtai, Jan Betley, Kaivalya Hariharan, Jeremy Scheurer, Mikita Balesni, Marius Hobbhahn, Alexander Meinke, Owain Evans", "id": "2407.04694v1", "paper_url": "http://arxiv.org/abs/2407.04694v1", "repo": "null"}}