{"2411.15114": {"publish_time": "2024-11-22", "title": "RE-Bench: Evaluating frontier AI R&D capabilities of language model agents against human experts", "paper_summary": "Frontier AI safety policies highlight automation of AI research and\ndevelopment (R&D) by AI agents as an important capability to anticipate.\nHowever, there exist few evaluations for AI R&D capabilities, and none that are\nhighly realistic and have a direct comparison to human performance. We\nintroduce RE-Bench (Research Engineering Benchmark, v1), which consists of 7\nchallenging, open-ended ML research engineering environments and data from 71\n8-hour attempts by 61 distinct human experts. We confirm that our experts make\nprogress in the environments given 8 hours, with 82% of expert attempts\nachieving a non-zero score and 24% matching or exceeding our strong reference\nsolutions. We compare humans to several public frontier models through\nbest-of-k with varying time budgets and agent designs, and find that the best\nAI agents achieve a score 4x higher than human experts when both are given a\ntotal time budget of 2 hours per environment. However, humans currently display\nbetter returns to increasing time budgets, narrowly exceeding the top AI agent\nscores given an 8-hour budget, and achieving 2x the score of the top AI agent\nwhen both are given 32 total hours (across different attempts). Qualitatively,\nwe find that modern AI agents possess significant expertise in many ML topics\n-- e.g. an agent wrote a faster custom Triton kernel than any of our human\nexperts' -- and can generate and test solutions over ten times faster than\nhumans, at much lower cost. We open-source the evaluation environments, human\nexpert data, analysis code and agent trajectories to facilitate future\nresearch.", "paper_summary_zh": "前沿 AI 安全政策重点关注 AI 代理对 AI 研究和开发 (R&D) 的自动化，将其视为一项重要的预期能力。然而，很少有针对 AI 研发能力的评估，而且没有一项评估具有高度的现实性，并与人类表现进行直接比较。我们引入了 RE-Bench（研究工程基准，v1），它包含 7 个具有挑战性的、开放式的 ML 研究工程环境和 61 位不同人类专家进行的 71 次 8 小时尝试的数据。我们确认，我们的专家在给定的 8 小时内在环境中取得了进展，82% 的专家尝试获得了非零分数，24% 达到或超过了我们强大的参考解决方案。我们通过具有不同时间预算和代理设计的最佳 k 值将人类与几个公共前沿模型进行比较，发现最好的 AI 代理在每种环境中获得的时间预算总计为 2 小时时，其分数比人类专家高 4 倍。然而，人类目前在增加时间预算方面表现出更好的回报，在给定 8 小时预算的情况下略微超过顶级 AI 代理分数，并且在总共给定 32 小时（在不同的尝试中）的情况下，其分数达到顶级 AI 代理的两倍。从质量上讲，我们发现现代 AI 代理在许多 ML 主题中拥有重要的专业知识——例如，一位代理编写了一个比我们任何一位人类专家都更快的自定义 Triton 内核——并且能够生成和测试解决方案的速度比人类快十倍以上，成本也低得多。我们开源评估环境、人类专家数据、分析代码和代理轨迹，以促进未来的研究。", "author": "Hjalmar Wijk et.al.", "authors": "Hjalmar Wijk, Tao Lin, Joel Becker, Sami Jawhar, Neev Parikh, Thomas Broadley, Lawrence Chan, Michael Chen, Josh Clymer, Jai Dhyani, Elena Ericheva, Katharyn Garcia, Brian Goodrich, Nikola Jurkovic, Megan Kinniment, Aron Lajko, Seraphina Nix, Lucas Sato, William Saunders, Maksym Taran, Ben West, Elizabeth Barnes", "id": "2411.15114v1", "paper_url": "http://arxiv.org/abs/2411.15114v1", "repo": "null"}}