{"2407.19795": {"publish_time": "2024-07-29", "title": "VolDoGer: LLM-assisted Datasets for Domain Generalization in Vision-Language Tasks", "paper_summary": "Domain generalizability is a crucial aspect of a deep learning model since it\ndetermines the capability of the model to perform well on data from unseen\ndomains. However, research on the domain generalizability of deep learning\nmodels for vision-language tasks remains limited, primarily because of the lack\nof required datasets. To address these challenges, we propose VolDoGer:\nVision-Language Dataset for Domain Generalization, a dedicated dataset designed\nfor domain generalization that addresses three vision-language tasks: image\ncaptioning, visual question answering, and visual entailment. We constructed\nVolDoGer by extending LLM-based data annotation techniques to vision-language\ntasks, thereby alleviating the burden of recruiting human annotators. We\nevaluated the domain generalizability of various models, ranging from\nfine-tuned models to a recent multimodal large language model, through\nVolDoGer.", "paper_summary_zh": "領域泛化性是深度學習模型的關鍵面向，因為它決定模型在未見領域資料上表現良好的能力。然而，深度學習模型在視覺語言任務上的領域泛化性研究仍然有限，主要是因為缺乏必要的資料集。為了應對這些挑戰，我們提出 VolDoGer：視覺語言領域泛化資料集，一個專門設計用於領域泛化的資料集，它涵蓋三個視覺語言任務：影像標題、視覺問答和視覺蘊涵。我們透過將基於 LLM 的資料標註技術擴充套用到視覺語言任務來建構 VolDoGer，從而減輕招募人工標註者的負擔。我們透過 VolDoGer 評估各種模型的領域泛化性，從微調模型到最近的多模態大型語言模型。", "author": "Juhwan Choi et.al.", "authors": "Juhwan Choi, Junehyoung Kwon, JungMin Yun, Seunguk Yu, YoungBin Kim", "id": "2407.19795v1", "paper_url": "http://arxiv.org/abs/2407.19795v1", "repo": "null"}}