{"2407.07291": {"publish_time": "2024-07-10", "title": "Causal Discovery in Semi-Stationary Time Series", "paper_summary": "Discovering causal relations from observational time series without making\nthe stationary assumption is a significant challenge. In practice, this\nchallenge is common in many areas, such as retail sales, transportation\nsystems, and medical science. Here, we consider this problem for a class of\nnon-stationary time series. The structural causal model (SCM) of this type of\ntime series, called the semi-stationary time series, exhibits that a finite\nnumber of different causal mechanisms occur sequentially and periodically\nacross time. This model holds considerable practical utility because it can\nrepresent periodicity, including common occurrences such as seasonality and\ndiurnal variation. We propose a constraint-based, non-parametric algorithm for\ndiscovering causal relations in this setting. The resulting algorithm,\nPCMCI$_{\\Omega}$, can capture the alternating and recurring changes in the\ncausal mechanisms and then identify the underlying causal graph with\nconditional independence (CI) tests. We show that this algorithm is sound in\nidentifying causal relations on discrete time series. We validate the algorithm\nwith extensive experiments on continuous and discrete simulated data. We also\napply our algorithm to a real-world climate dataset.", "paper_summary_zh": "在不作平穩假設的情況下從觀測時間序列中發現因果關係是一項重大挑戰。在實務中，這個挑戰在許多領域中很常見，例如零售銷售、運輸系統和醫學科學。在此，我們考慮非平穩時間序列類別的這個問題。這種類型的時間序列的結構因果模型 (SCM)，稱為半平穩時間序列，展示了有限數量的不同因果機制會隨著時間順序且週期性地發生。這個模型具有相當大的實用性，因為它可以表示週期性，包括季節性和晝夜變化等常見現象。我們提出了一個基於約束的非參數演算法，用於發現這個設定中的因果關係。產生的演算法 PCMCI$_{\\Omega}$ 可以捕捉因果機制中的交替和重複變化，然後藉由條件獨立 (CI) 檢定來識別基礎因果圖。我們證明這個演算法在識別離散時間序列上的因果關係時是合理的。我們使用連續和離散模擬資料進行廣泛的實驗，以驗證演算法。我們也將我們的演算法應用於真實世界的氣候資料集。", "author": "Shanyun Gao et.al.", "authors": "Shanyun Gao, Raghavendra Addanki, Tong Yu, Ryan A. Rossi, Murat Kocaoglu", "id": "2407.07291v1", "paper_url": "http://arxiv.org/abs/2407.07291v1", "repo": "https://github.com/causalml-lab/pcmci-omega"}}