{"2405.09598": {"publish_time": "2024-05-15", "title": "Properties that allow or prohibit transferability of adversarial attacks among quantized networks", "paper_summary": "Deep Neural Networks (DNNs) are known to be vulnerable to adversarial\nexamples. Further, these adversarial examples are found to be transferable from\nthe source network in which they are crafted to a black-box target network. As\nthe trend of using deep learning on embedded devices grows, it becomes relevant\nto study the transferability properties of adversarial examples among\ncompressed networks. In this paper, we consider quantization as a network\ncompression technique and evaluate the performance of transfer-based attacks\nwhen the source and target networks are quantized at different bitwidths. We\nexplore how algorithm specific properties affect transferability by considering\nvarious adversarial example generation algorithms. Furthermore, we examine\ntransferability in a more realistic scenario where the source and target\nnetworks may differ in bitwidth and other model-related properties like\ncapacity and architecture. We find that although quantization reduces\ntransferability, certain attack types demonstrate an ability to enhance it.\nAdditionally, the average transferability of adversarial examples among\nquantized versions of a network can be used to estimate the transferability to\nquantized target networks with varying capacity and architecture.", "paper_summary_zh": "深度神经網路 (DNN) 已知容易受到對抗性範例的攻擊。此外，這些對抗性範例被發現可以從它們被製作出來的原始網路傳輸到一個黑箱目標網路。隨著在嵌入式裝置上使用深度學習的趨勢增長，研究對抗性範例在壓縮網路之間的可傳輸性變得相關。在本文中，我們將量化視為一種網路壓縮技術，並評估當原始網路和目標網路以不同的位寬進行量化時，基於傳輸的攻擊的效能。我們探討演算法特定屬性如何影響可傳輸性，方法是考慮各種對抗性範例生成演算法。此外，我們在一個更實際的場景中檢查可傳輸性，在這個場景中，原始網路和目標網路在位寬和其他與模型相關的屬性（如容量和架構）上可能有所不同。我們發現，儘管量化會降低可傳輸性，但某些攻擊類型表現出增強它的能力。此外，對抗性範例在網路量化版本之間的平均可傳輸性可被用於估計對具有不同容量和架構的量化目標網路的可傳輸性。", "author": "Abhishek Shrestha et.al.", "authors": "Abhishek Shrestha, Jürgen Großmann", "id": "2405.09598v1", "paper_url": "http://arxiv.org/abs/2405.09598v1", "repo": "https://github.com/Abhishek2271/TransferabilityAnalysis"}}