{"2502.13731": {"publish_time": "2025-02-19", "title": "Robust Counterfactual Inference in Markov Decision Processes", "paper_summary": "This paper addresses a key limitation in existing counterfactual inference\nmethods for Markov Decision Processes (MDPs). Current approaches assume a\nspecific causal model to make counterfactuals identifiable. However, there are\nusually many causal models that align with the observational and interventional\ndistributions of an MDP, each yielding different counterfactual distributions,\nso fixing a particular causal model limits the validity (and usefulness) of\ncounterfactual inference. We propose a novel non-parametric approach that\ncomputes tight bounds on counterfactual transition probabilities across all\ncompatible causal models. Unlike previous methods that require solving\nprohibitively large optimisation problems (with variables that grow\nexponentially in the size of the MDP), our approach provides closed-form\nexpressions for these bounds, making computation highly efficient and scalable\nfor non-trivial MDPs. Once such an interval counterfactual MDP is constructed,\nour method identifies robust counterfactual policies that optimise the\nworst-case reward w.r.t. the uncertain interval MDP probabilities. We evaluate\nour method on various case studies, demonstrating improved robustness over\nexisting methods.", "paper_summary_zh": "本文探討了馬可夫決策過程 (MDP) 中現有反事實推論方法的一個關鍵限制。目前的方法假設一個特定的因果模型，以使反事實可識別。然而，通常有許多因果模型與 MDP 的觀察和介入分佈一致，每個模型產生不同的反事實分佈，因此固定一個特定的因果模型會限制反事實推論的有效性（和實用性）。我們提出了一種新穎的非參數方法，它計算所有相容因果模型中反事實轉移機率的緊密界限。與需要解決難以禁止的最佳化問題（其中變數隨著 MDP 的大小呈指數成長）的先前方法不同，我們的做法提供了這些界限的閉合形式表達式，使計算對於非平凡的 MDP 具有高度效率和可擴充性。一旦構造了這樣的區間反事實 MDP，我們的做法便會識別出穩健的反事實策略，以最佳化相對於不確定的區間 MDP 機率的最差獎勵。我們在各種案例研究中評估我們的做法，展示出比現有方法更好的穩健性。", "author": "Jessica Lally et.al.", "authors": "Jessica Lally, Milad Kazemi, Nicola Paoletti", "id": "2502.13731v1", "paper_url": "http://arxiv.org/abs/2502.13731v1", "repo": "null"}}