{"2408.11039": {"publish_time": "2024-08-20", "title": "Transfusion: Predict the Next Token and Diffuse Images with One Multi-Modal Model", "paper_summary": "We introduce Transfusion, a recipe for training a multi-modal model over\ndiscrete and continuous data. Transfusion combines the language modeling loss\nfunction (next token prediction) with diffusion to train a single transformer\nover mixed-modality sequences. We pretrain multiple Transfusion models up to 7B\nparameters from scratch on a mixture of text and image data, establishing\nscaling laws with respect to a variety of uni- and cross-modal benchmarks. Our\nexperiments show that Transfusion scales significantly better than quantizing\nimages and training a language model over discrete image tokens. By introducing\nmodality-specific encoding and decoding layers, we can further improve the\nperformance of Transfusion models, and even compress each image to just 16\npatches. We further demonstrate that scaling our Transfusion recipe to 7B\nparameters and 2T multi-modal tokens produces a model that can generate images\nand text on a par with similar scale diffusion models and language models,\nreaping the benefits of both worlds.", "paper_summary_zh": "我們介紹 Transfusion，這是一個在離散和連續數據上訓練多模態模型的配方。Transfusion 結合語言模型損失函數（下一個符號預測）與擴散，以在混合模式序列上訓練單一Transformer。我們從頭開始在文本和影像數據的混合物上預訓練多個 Transfusion 模型，參數高達 7B，建立與各種單模態和跨模態基準相關的擴充定律。我們的實驗顯示，Transfusion 的擴充性顯著優於量化影像和在離散影像符號上訓練語言模型。透過引入特定於模式的編碼和解碼層，我們可以進一步提升 Transfusion 模型的效能，甚至將每個影像壓縮成僅 16 個區塊。我們進一步證明，將我們的 Transfusion 配方擴充到 7B 參數和 2T 多模態符號，會產生一個模型，該模型可以生成影像和文本，與類似的擴充規模擴散模型和語言模型不相上下，同時獲取兩個世界的優點。", "author": "Chunting Zhou et.al.", "authors": "Chunting Zhou, Lili Yu, Arun Babu, Kushal Tirumala, Michihiro Yasunaga, Leonid Shamis, Jacob Kahn, Xuezhe Ma, Luke Zettlemoyer, Omer Levy", "id": "2408.11039v1", "paper_url": "http://arxiv.org/abs/2408.11039v1", "repo": "null"}}