{"2412.15838": {"publish_time": "2024-12-20", "title": "Align Anything: Training All-Modality Models to Follow Instructions with Language Feedback", "paper_summary": "Reinforcement learning from human feedback (RLHF) has proven effective in\nenhancing the instruction-following capabilities of large language models;\nhowever, it remains underexplored in the cross-modality domain. As the number\nof modalities increases, aligning all-modality models with human intentions --\nsuch as instruction following -- becomes a pressing challenge. In this work, we\nmake the first attempt to fine-tune all-modality models (i.e. input and output\nwith any modality, also named any-to-any models) using human preference data\nacross all modalities (including text, image, audio, and video), ensuring its\nbehavior aligns with human intentions. This endeavor presents several\nchallenges. First, there is no large-scale all-modality human preference data\nin existing open-source resources, as most datasets are limited to specific\nmodalities, predominantly text and image. Secondly, the effectiveness of binary\npreferences in RLHF for post-training alignment in complex all-modality\nscenarios remains an unexplored area. Finally, there is a lack of a systematic\nframework to evaluate the capabilities of all-modality models, particularly\nregarding modality selection and synergy. To address these challenges, we\npropose the align-anything framework, which includes meticulously annotated\n200k all-modality human preference data. Then, we introduce an alignment method\nthat learns from unified language feedback, effectively capturing complex\nmodality-specific human preferences and enhancing the model's\ninstruction-following capabilities. Furthermore, to assess performance\nimprovements in all-modality models after post-training alignment, we construct\na challenging all-modality capability evaluation framework -- eval-anything.\nAll data, models, and code frameworks have been open-sourced for the community.\nFor more details, please refer to\nhttps://github.com/PKU-Alignment/align-anything.", "paper_summary_zh": "<paragraph>透過人類回饋的增強學習 (RLHF) 已被證實能有效提升大型語言模型遵循指令的能力；然而，在跨模態領域中仍未被充分探索。隨著模態數量的增加，使所有模態模型與人類意圖保持一致（例如遵循指令）成了一項迫切的挑戰。在這項工作中，我們首次嘗試使用所有模態（包括文字、影像、音訊和影片）的人類偏好資料微調所有模態模型（即輸入和輸出具有任何模態，也稱為任意對任意模型），確保其行為與人類意圖保持一致。這項努力提出了幾個挑戰。首先，現有的開放原始碼資源中沒有大規模的所有模態人類偏好資料，因為大多數資料集都限於特定模態，主要是文字和影像。其次，在複雜的所有模態情境中，RLHF 中二元偏好對後訓練對齊的有效性仍是一個未經探索的領域。最後，缺乏系統性的架構來評估所有模態模型的能力，特別是關於模態選擇和協同效應。為了應對這些挑戰，我們提出了 align-anything 架構，其中包含仔細註解的 20 萬個所有模態人類偏好資料。然後，我們引入了一種對齊方法，從統一的語言回饋中學習，有效捕捉複雜的特定於模態的人類偏好，並增強模型的指令遵循能力。此外，為了評估後訓練對齊後所有模態模型的效能改善，我們建構了一個具有挑戰性的所有模態能力評估架構——eval-anything。所有資料、模型和程式碼架構都已開放原始碼供社群使用。如需更多詳細資訊，請參閱 https://github.com/PKU-Alignment/align-anything。</paragraph>", "author": "Jiaming Ji et.al.", "authors": "Jiaming Ji, Jiayi Zhou, Hantao Lou, Boyuan Chen, Donghai Hong, Xuyao Wang, Wenqi Chen, Kaile Wang, Rui Pan, Jiahao Li, Mohan Wang, Josef Dai, Tianyi Qiu, Hua Xu, Dong Li, Weipeng Chen, Jun Song, Bo Zheng, Yaodong Yang", "id": "2412.15838v1", "paper_url": "http://arxiv.org/abs/2412.15838v1", "repo": "https://github.com/pku-alignment/align-anything"}}