{"2411.09170": {"publish_time": "2024-11-14", "title": "Towards Scalable Handwriting Communication via EEG Decoding and Latent Embedding Integration", "paper_summary": "In recent years, brain-computer interfaces have made advances in decoding\nvarious motor-related tasks, including gesture recognition and movement\nclassification, utilizing electroencephalogram (EEG) data. These developments\nare fundamental in exploring how neural signals can be interpreted to recognize\nspecific physical actions. This study centers on a written alphabet\nclassification task, where we aim to decode EEG signals associated with\nhandwriting. To achieve this, we incorporate hand kinematics to guide the\nextraction of the consistent embeddings from high-dimensional neural recordings\nusing auxiliary variables (CEBRA). These CEBRA embeddings, along with the EEG,\nare processed by a parallel convolutional neural network model that extracts\nfeatures from both data sources simultaneously. The model classifies nine\ndifferent handwritten characters, including symbols such as exclamation marks\nand commas, within the alphabet. We evaluate the model using a quantitative\nfive-fold cross-validation approach and explore the structure of the embedding\nspace through visualizations. Our approach achieves a classification accuracy\nof 91 % for the nine-class task, demonstrating the feasibility of fine-grained\nhandwriting decoding from EEG.", "paper_summary_zh": "近年來，腦機介面在解碼各種與運動相關的任務方面取得進展，包括手勢辨識和動作分類，利用腦電圖 (EEG) 資料。這些發展在探索如何解釋神經訊號以辨識特定肢體動作方面具有根本性的意義。本研究重點在於書寫字母分類任務，我們旨在解碼與手寫相關的 EEG 訊號。為達成此目的，我們結合手部運動學來引導從高維神經記錄中萃取一致的嵌入，使用輔助變數 (CEBRA)。這些 CEBRA 嵌入與 EEG，由並行卷積神經網路模型處理，同時從兩個資料來源萃取特徵。此模型對九個不同的手寫字元進行分類，包括感嘆號和逗號等符號，在字母表中。我們使用定量的五重交叉驗證方法評估模型，並透過視覺化探索嵌入空間的結構。我們的做法對九類任務達到了 91% 的分類準確度，證明了從 EEG 中進行細緻手寫解碼的可行性。", "author": "Jun-Young Kim et.al.", "authors": "Jun-Young Kim, Deok-Seon Kim, Seo-Hyun Lee", "id": "2411.09170v1", "paper_url": "http://arxiv.org/abs/2411.09170v1", "repo": "null"}}