{"2410.19144": {"publish_time": "2024-10-24", "title": "Visual Text Matters: Improving Text-KVQA with Visual Text Entity Knowledge-aware Large Multimodal Assistant", "paper_summary": "We revisit knowledge-aware text-based visual question answering, also known\nas Text-KVQA, in the light of modern advancements in large multimodal models\n(LMMs), and make the following contributions: (i) We propose VisTEL - a\nprincipled approach to perform visual text entity linking. The proposed VisTEL\nmodule harnesses a state-of-the-art visual text recognition engine and the\npower of a large multimodal model to jointly reason using textual and visual\ncontext obtained using surrounding cues in the image to link the visual text\nentity to the correct knowledge base entity. (ii) We present KaLMA - a\nknowledge-aware large multimodal assistant that augments an LMM with knowledge\nassociated with visual text entity in the image to arrive at an accurate\nanswer. Further, we provide a comprehensive experimental analysis and\ncomparison of our approach with traditional visual question answering,\npre-large multimodal models, and large multimodal models, as well as prior\ntop-performing approaches. Averaging over three splits of Text-KVQA, our\nproposed approach surpasses the previous best approach by a substantial 23.3%\non an absolute scale and establishes a new state of the art. We make our\nimplementation publicly available.", "paper_summary_zh": "<paragraph>我們在大型多模態模型 (LMM) 的現代進步的基礎上，重新探討了知識感知的基於文字的視覺問題解答，也稱為 Text-KVQA，並做出以下貢獻：(i) 我們提出 VisTEL - 一種執行視覺文字實體連結的原則性方法。提出的 VisTEL 模組利用最先進的視覺文字辨識引擎和大型多模態模型的力量，使用圖像中周圍線索取得的文字和視覺脈絡，共同推論，將視覺文字實體連結到正確的知識庫實體。(ii) 我們提出 KaLMA - 一種知識感知的大型多模態助理，它擴充了一個 LMM，結合了圖像中視覺文字實體相關的知識，以得出準確的答案。此外，我們提供了一個全面的實驗分析，並將我們的方法與傳統的視覺問題解答、大型多模態模型之前和大型多模態模型以及之前的頂尖方法進行比較。在 Text-KVQA 的三個分割平均值中，我們提出的方法在絕對規模上超越了之前的最佳方法，達到了 23.3%，並建立了新的技術水準。我們公開了我們的實作。</paragraph>", "author": "Abhirama Subramanyam Penamakuri et.al.", "authors": "Abhirama Subramanyam Penamakuri, Anand Mishra", "id": "2410.19144v1", "paper_url": "http://arxiv.org/abs/2410.19144v1", "repo": "https://github.com/vl2g/KaLMA"}}