{"2405.04793": {"publish_time": "2024-05-08", "title": "Zero-shot LLM-guided Counterfactual Generation for Text", "paper_summary": "Counterfactual examples are frequently used for model development and\nevaluation in many natural language processing (NLP) tasks. Although methods\nfor automated counterfactual generation have been explored, such methods depend\non models such as pre-trained language models that are then fine-tuned on\nauxiliary, often task-specific datasets. Collecting and annotating such\ndatasets for counterfactual generation is labor intensive and therefore,\ninfeasible in practice. Therefore, in this work, we focus on a novel problem\nsetting: \\textit{zero-shot counterfactual generation}. To this end, we propose\na structured way to utilize large language models (LLMs) as general purpose\ncounterfactual example generators. We hypothesize that the\ninstruction-following and textual understanding capabilities of recent LLMs can\nbe effectively leveraged for generating high quality counterfactuals in a\nzero-shot manner, without requiring any training or fine-tuning. Through\ncomprehensive experiments on various downstream tasks in natural language\nprocessing (NLP), we demonstrate the efficacy of LLMs as zero-shot\ncounterfactual generators in evaluating and explaining black-box NLP models.", "paper_summary_zh": "反事實範例經常應用於自然語言處理 (NLP) 任務中的模型開發和評估。儘管已探索用於自動化反事實產生之方法，但此類方法仰賴於模型，例如預先訓練的語言模型，然後在輔助性資料集（通常為特定於任務的資料集）上進行微調。收集和標註此類資料集以進行反事實產生需要大量人力，因此在實務上不可行。因此，在這項工作中，我們專注於一個新穎的問題設定：\\textit{零次學習反事實產生}。為此，我們提出一個結構化的方式，利用大型語言模型 (LLM) 作為通用反事實範例產生器。我們假設，最近的 LLM 的指令遵循和文本理解能力可以有效地用於產生高品質的反事實，以零次學習的方式進行，無需任何訓練或微調。透過在自然語言處理 (NLP) 中各種下游任務進行全面的實驗，我們證明了 LLM 作為零次學習反事實產生器在評估和解釋黑盒 NLP 模型中的效能。", "author": "Amrita Bhattacharjee et.al.", "authors": "Amrita Bhattacharjee, Raha Moraffah, Joshua Garland, Huan Liu", "id": "2405.04793v1", "paper_url": "http://arxiv.org/abs/2405.04793v1", "repo": "null"}}