{"2501.01073": {"publish_time": "2025-01-02", "title": "Graph Generative Pre-trained Transformer", "paper_summary": "Graph generation is a critical task in numerous domains, including molecular\ndesign and social network analysis, due to its ability to model complex\nrelationships and structured data. While most modern graph generative models\nutilize adjacency matrix representations, this work revisits an alternative\napproach that represents graphs as sequences of node set and edge set. We\nadvocate for this approach due to its efficient encoding of graphs and propose\na novel representation. Based on this representation, we introduce the Graph\nGenerative Pre-trained Transformer (G2PT), an auto-regressive model that learns\ngraph structures via next-token prediction. To further exploit G2PT's\ncapabilities as a general-purpose foundation model, we explore fine-tuning\nstrategies for two downstream applications: goal-oriented generation and graph\nproperty prediction. We conduct extensive experiments across multiple datasets.\nResults indicate that G2PT achieves superior generative performance on both\ngeneric graph and molecule datasets. Furthermore, G2PT exhibits strong\nadaptability and versatility in downstream tasks from molecular design to\nproperty prediction.", "paper_summary_zh": "圖形生成在許多領域中是一項重要的任務，包括分子設計和社交網路分析，因為它能夠建模複雜的關係和結構化資料。雖然大多數現代圖形生成模型使用鄰接矩陣表示法，但本研究重新探討了另一種方法，將圖形表示為節點集和邊緣集的序列。我們提倡這種方法，因為它能有效編碼圖形，並提出一個新穎的表示法。基於此表示法，我們引入了圖形生成預訓練Transformer (G2PT)，這是一個自迴歸模型，透過下一個標記預測來學習圖形結構。為了進一步利用 G2PT 作為通用基礎模型的能力，我們探討了針對兩個下游應用程式進行微調的策略：目標導向生成和圖形屬性預測。我們在多個資料集上進行了廣泛的實驗。結果表明，G2PT 在通用圖形和分子資料集上都達到了優異的生成效能。此外，G2PT 在從分子設計到屬性預測的下游任務中展現出強大的適應性和多功能性。", "author": "Xiaohui Chen et.al.", "authors": "Xiaohui Chen, Yinkai Wang, Jiaxing He, Yuanqi Du, Soha Hassoun, Xiaolin Xu, Li-Ping Liu", "id": "2501.01073v1", "paper_url": "http://arxiv.org/abs/2501.01073v1", "repo": "null"}}