{"2501.14491": {"publish_time": "2025-01-24", "title": "Analyzing the Effect of Linguistic Similarity on Cross-Lingual Transfer: Tasks and Experimental Setups Matter", "paper_summary": "Cross-lingual transfer is a popular approach to increase the amount of\ntraining data for NLP tasks in a low-resource context. However, the best\nstrategy to decide which cross-lingual data to include is unclear. Prior\nresearch often focuses on a small set of languages from a few language families\nand/or a single task. It is still an open question how these findings extend to\na wider variety of languages and tasks. In this work, we analyze cross-lingual\ntransfer for 266 languages from a wide variety of language families. Moreover,\nwe include three popular NLP tasks: POS tagging, dependency parsing, and topic\nclassification. Our findings indicate that the effect of linguistic similarity\non transfer performance depends on a range of factors: the NLP task, the (mono-\nor multilingual) input representations, and the definition of linguistic\nsimilarity.", "paper_summary_zh": "跨語言轉移是一種流行的作法，用於增加低資源環境下 NLP 任務的訓練資料量。然而，要決定納入哪些跨語言資料的最佳策略仍不明確。先前的研究通常專注於少數語言家族中的一小組語言和/或單一任務。這些發現如何擴展到更多元化的語言和任務，這仍是一個開放性的問題。在這項工作中，我們分析了來自各種語言家族的 266 種語言的跨語言轉移。此外，我們納入了三項流行的 NLP 任務：詞性標記、依存句法分析和主題分類。我們的研究結果表明，語言相似性對轉移效能的影響取決於一系列因素：NLP 任務、（單語或多語）輸入表示，以及語言相似性的定義。", "author": "Verena Blaschke et.al.", "authors": "Verena Blaschke, Masha Fedzechkina, Maartje ter Hoeve", "id": "2501.14491v1", "paper_url": "http://arxiv.org/abs/2501.14491v1", "repo": "null"}}