{"2408.03574": {"publish_time": "2024-08-07", "title": "Teach CLIP to Develop a Number Sense for Ordinal Regression", "paper_summary": "Ordinal regression is a fundamental problem within the field of computer\nvision, with customised well-trained models on specific tasks. While\npre-trained vision-language models (VLMs) have exhibited impressive performance\non various vision tasks, their potential for ordinal regression has received\nless exploration. In this study, we first investigate CLIP's potential for\nordinal regression, from which we expect the model could generalise to\ndifferent ordinal regression tasks and scenarios. Unfortunately, vanilla CLIP\nfails on this task, since current VLMs have a well-documented limitation of\nencapsulating compositional concepts such as number sense. We propose a simple\nyet effective method called NumCLIP to improve the quantitative understanding\nof VLMs. We disassemble the exact image to number-specific text matching\nproblem into coarse classification and fine prediction stages. We discretize\nand phrase each numerical bin with common language concept to better leverage\nthe available pre-trained alignment in CLIP. To consider the inherent\ncontinuous property of ordinal regression, we propose a novel fine-grained\ncross-modal ranking-based regularisation loss specifically designed to keep\nboth semantic and ordinal alignment in CLIP's feature space. Experimental\nresults on three general ordinal regression tasks demonstrate the effectiveness\nof NumCLIP, with 10% and 3.83% accuracy improvement on historical image dating\nand image aesthetics assessment task, respectively. Code is publicly available\nat https://github.com/xmed-lab/NumCLIP.", "paper_summary_zh": "序數迴歸是電腦視覺領域中的基本問題，其中包含特定任務上的客製化訓練模型。雖然預先訓練的視覺語言模型 (VLM) 已在各種視覺任務中展現出令人印象深刻的效能，但對於序數迴歸的潛力則較少探索。在本研究中，我們首先探討 CLIP 對序數迴歸的潛力，我們預期模型可以概括到不同的序數迴歸任務和場景。不幸的是，香草 CLIP 在此任務上失敗，因為目前的 VLM 已有文件記載的限制，無法封裝諸如數字感等組合概念。我們提出一個簡單但有效的方法，稱為 NumCLIP，以改善 VLM 的量化理解。我們將精確影像分解為數字特定文字比對問題，再細分為粗略分類和精細預測階段。我們將每個數字箱離散化並以常見語言概念表達，以更好地利用 CLIP 中可用的預先訓練對齊。為了考量序數迴歸的內在連續特性，我們提出一個新穎的細粒度跨模態排序基礎正則化損失，特別設計用於在 CLIP 的特徵空間中保持語意和序數對齊。在三個一般序數迴歸任務上的實驗結果證明了 NumCLIP 的有效性，在歷史影像約會和影像美學評估任務上分別提高了 10% 和 3.83% 的準確度。程式碼已公開於 https://github.com/xmed-lab/NumCLIP。", "author": "Yao Du et.al.", "authors": "Yao Du, Qiang Zhai, Weihang Dai, Xiaomeng Li", "id": "2408.03574v1", "paper_url": "http://arxiv.org/abs/2408.03574v1", "repo": "null"}}