{"2501.13921": {"publish_time": "2025-01-23", "title": "The Breeze 2 Herd of Models: Traditional Chinese LLMs Based on Llama with Vision-Aware and Function-Calling Capabilities", "paper_summary": "Breeze 2 is a suite of advanced multi-modal language models, available in 3B\nand 8B parameter configurations, specifically designed to enhance Traditional\nChinese language representation. Building upon the Llama 3, Breeze 2 continues\npretraining on an extensive corpus to enhance the linguistic and cultural\nheritage of Traditional Chinese. It incorporates vision-aware capabilities\nthrough a visual encoder and a bridge module, and supports function-calling via\nprompt templates and post-training on function-calling data. The effectiveness\nof Breeze 2 is benchmarked across various tasks, including Taiwan general\nknowledge, instruction-following, long context, function calling, and vision\nunderstanding. Furthermore, we showcase the capabilities of the its 3B model in\na mobile application. We are publicly releasing all Breeze 2 models under the\nLlama 3 Community License.", "paper_summary_zh": "Breeze 2 是一套進階的多模態語言模型，提供 3B 和 8B 參數配置，專門設計用於增強繁體中文語言表示。Breeze 2 建立在 Llama 3 的基礎上，持續在廣泛的語料庫上進行預訓練，以增強繁體中文的語言和文化遺產。它透過視覺編碼器和橋接模組整合了視覺感知能力，並透過提示範本和功能呼叫資料的後續訓練支援功能呼叫。Breeze 2 的有效性已針對各種任務進行基準測試，包括台灣一般知識、遵循指示、長篇語境、功能呼叫和視覺理解。此外，我們在行動應用程式中展示其 3B 模型的功能。我們在 Llama 3 社群授權下公開發布所有 Breeze 2 模型。", "author": "Chan-Jan Hsu et.al.", "authors": "Chan-Jan Hsu, Chia-Sheng Liu, Meng-Hsi Chen, Muxi Chen, Po-Chun Hsu, Yi-Chang Chen, Da-Shan Shiu", "id": "2501.13921v1", "paper_url": "http://arxiv.org/abs/2501.13921v1", "repo": "null"}}