{"2411.10272": {"publish_time": "2024-11-15", "title": "Scaling Law for Post-training after Model Pruning", "paper_summary": "Large language models (LLMs) based on the Transformer architecture are widely\nemployed across various domains and tasks. However, their increasing size\nimposes significant hardware demands, limiting practical deployment. To\nmitigate this, model pruning techniques have been developed to create more\nefficient models while maintaining high performance. Despite this,\npost-training after pruning is crucial for performance recovery and can be\nresource-intensive. This paper investigates the post-training requirements of\npruned LLMs and introduces a scaling law to determine the optimal amount of\npost-training data. Post-training experiments with the Llama-3 and Qwen-2.5\nseries models, pruned using depth pruning, width pruning, and 2:4\nsemi-structured pruning, show that higher pruning ratios necessitate more\npost-training data for performance recovery, whereas larger LLMs require less.\nThe proposed scaling law predicts a model's loss based on its parameter counts\nbefore and after pruning, as well as the post-training token counts.\nFurthermore, we find that the scaling law established from smaller LLMs can be\nreliably extrapolated to larger LLMs. This work provides valuable insights into\nthe post-training of pruned LLMs and offers a practical scaling law for\noptimizing post-training data usage.", "paper_summary_zh": "<paragraph>基於 Transformer 架構的大型語言模型 (LLM) 廣泛用於各種領域和任務中。然而，它們日益增加的大小會帶來顯著的硬體需求，限制了實際部署。為了減輕這個問題，已經開發出模型剪枝技術，以在維持高性能的同時建立更有效率的模型。儘管如此，剪枝後的後續訓練對於性能恢復至關重要，而且可能會消耗大量資源。本文探討了剪枝後的 LLM 的後續訓練需求，並引入了一個縮放定律來確定最佳的後續訓練資料量。使用深度剪枝、寬度剪枝和 2:4 半結構化剪枝進行剪枝的 Llama-3 和 Qwen-2.5 系列模型的後續訓練實驗表明，較高的剪枝率需要更多後續訓練資料才能恢復性能，而較大的 LLM 則需要較少。所提出的縮放定律根據模型在剪枝前後的參數數量以及後續訓練的 token 數量預測模型的損失。此外，我們發現從較小的 LLM 建立的縮放定律可以可靠地外推到較大的 LLM。這項工作提供了對剪枝後 LLM 的後續訓練的寶貴見解，並為最佳化後續訓練資料使用提供了實用的縮放定律。</paragraph>", "author": "Xiaodong Chen et.al.", "authors": "Xiaodong Chen, Yuxuan Hu, Jing Zhang, Xiaokang Zhang, Cuiping Li, Hong Chen", "id": "2411.10272v1", "paper_url": "http://arxiv.org/abs/2411.10272v1", "repo": "null"}}