{"2412.14500": {"publish_time": "2024-12-19", "title": "The Digital Ecosystem of Beliefs: does evolution favour AI over humans?", "paper_summary": "As AI systems are integrated into social networks, there are AI safety\nconcerns that AI-generated content may dominate the web, e.g. in popularity or\nimpact on beliefs.To understand such questions, this paper proposes the Digital\nEcosystem of Beliefs (Digico), the first evolutionary framework for controlled\nexperimentation with multi-population interactions in simulated social\nnetworks. The framework models a population of agents which change their\nmessaging strategies due to evolutionary updates following a Universal\nDarwinism approach, interact via messages, influence each other's beliefs\nthrough dynamics based on a contagion model, and maintain their beliefs through\ncognitive Lamarckian inheritance. Initial experiments with an abstract\nimplementation of Digico show that: a) when AIs have faster messaging,\nevolution, and more influence in the recommendation algorithm, they get 80% to\n95% of the views, depending on the size of the influence benefit; b) AIs\ndesigned for propaganda can typically convince 50% of humans to adopt extreme\nbeliefs, and up to 85% when agents believe only a limited number of channels;\nc) a penalty for content that violates agents' beliefs reduces propaganda\neffectiveness by up to 8%. We further discuss implications for control (e.g.\nlegislation) and Digico as a means of studying evolutionary principles.", "paper_summary_zh": "隨著 AI 系統整合到社群網路中，有 AI 安全方面的疑慮，即 AI 生成的內容可能主導網路，例如在人氣或對信念的影響上。為了了解此類問題，本文提出了信念的數位生態系統 (Digico)，這是第一個用於在模擬社群網路中進行多族群互動的受控實驗的演化架構。此架構模擬了一群會因演化更新而改變其訊息策略的代理，透過訊息互動，透過基於傳染模型的動態影響彼此的信念，並透過認知拉馬克遺傳維持其信念。對 Digico 的抽象實作進行的初步實驗顯示：a) 當 AI 具有更快的訊息傳遞、演化和在推薦演算法中具有更多影響力時，他們會獲得 80% 到 95% 的觀看次數，具體取決於影響效益的大小；b) 專門用於宣傳的 AI 通常可以說服 50% 的人類接受極端的信念，當代理只相信有限數量的頻道時，此比例最高可達 85%；c) 對違反代理信念的內容進行懲罰可將宣傳效果降低多達 8%。我們進一步討論了對控制（例如立法）的影響，以及 Digico 作為研究演化原理的一種手段。", "author": "David M. Bossens et.al.", "authors": "David M. Bossens, Shanshan Feng, Yew-Soon Ong", "id": "2412.14500v1", "paper_url": "http://arxiv.org/abs/2412.14500v1", "repo": "null"}}