{"2405.20978": {"publish_time": "2024-05-31", "title": "Enhancing Noise Robustness of Retrieval-Augmented Language Models with Adaptive Adversarial Training", "paper_summary": "Large Language Models (LLMs) exhibit substantial capabilities yet encounter\nchallenges, including hallucination, outdated knowledge, and untraceable\nreasoning processes. Retrieval-augmented generation (RAG) has emerged as a\npromising solution, integrating knowledge from external databases to mitigate\nthese challenges. However, inappropriate retrieved passages can potentially\nhinder the LLMs' capacity to generate comprehensive and high-quality responses.\nPrior RAG studies on the robustness of retrieval noises often confine\nthemselves to a limited set of noise types, deviating from real-world retrieval\nenvironments and limiting practical applicability. In this study, we initially\ninvestigate retrieval noises and categorize them into three distinct types,\nreflecting real-world environments. We analyze the impact of these various\nretrieval noises on the robustness of LLMs. Subsequently, we propose a novel\nRAG approach known as Retrieval-augmented Adaptive Adversarial Training (RAAT).\nRAAT leverages adaptive adversarial training to dynamically adjust the model's\ntraining process in response to retrieval noises. Concurrently, it employs\nmulti-task learning to ensure the model's capacity to internally recognize\nnoisy contexts. Extensive experiments demonstrate that the LLaMA-2 7B model\ntrained using RAAT exhibits significant improvements in F1 and EM scores under\ndiverse noise conditions. For reproducibility, we release our code and data at:\nhttps://github.com/calubkk/RAAT.", "paper_summary_zh": "大型語言模型 (LLM) 具備強大的功能，卻也面臨挑戰，包括幻覺、知識過時，以及難以追蹤的推理過程。檢索增強生成 (RAG) 已成為一種有前景的解決方案，它整合來自外部資料庫的知識以減輕這些挑戰。然而，不適當的檢索段落可能會阻礙 LLM 生成全面且高品質回應的能力。先前針對檢索雜訊穩健性的 RAG 研究通常侷限於有限的雜訊類型，偏離真實世界的檢索環境，並限制了實際應用性。在本研究中，我們最初探討檢索雜訊，並將其分類為三種類型，反映真實世界的環境。我們分析了這些不同檢索雜訊對 LLM 穩健性的影響。隨後，我們提出了一種稱為檢索增強適應對抗訓練 (RAAT) 的新 RAG 方法。RAAT 利用適應對抗訓練動態調整模型的訓練過程，以應對檢索雜訊。同時，它採用多任務學習，以確保模型能夠內部辨識雜訊環境。廣泛的實驗證明，使用 RAAT 訓練的 LLaMA-2 7B 模型在不同的雜訊條件下，F1 和 EM 分數都有顯著的提升。為了重現性，我們在以下位置釋出我們的程式碼和資料：https://github.com/calubkk/RAAT。", "author": "Feiteng Fang et.al.", "authors": "Feiteng Fang, Yuelin Bai, Shiwen Ni, Min Yang, Xiaojun Chen, Ruifeng Xu", "id": "2405.20978v1", "paper_url": "http://arxiv.org/abs/2405.20978v1", "repo": "null"}}