{"2411.08968": {"publish_time": "2024-11-13", "title": "Sparse Upcycling: Inference Inefficient Finetuning", "paper_summary": "Small, highly trained, open-source large language models are widely used due\nto their inference efficiency, but further improving their quality remains a\nchallenge. Sparse upcycling is a promising approach that transforms a\npretrained dense model into a Mixture-of-Experts (MoE) architecture, increasing\nthe model's parameter count and quality. In this work, we compare the\neffectiveness of sparse upcycling against continued pretraining (CPT) across\ndifferent model sizes, compute budgets, and pretraining durations. Our\nexperiments show that sparse upcycling can achieve better quality, with\nimprovements of over 20% relative to CPT in certain scenarios. However, this\ncomes with a significant inference cost, leading to 40% slowdowns in\nhigh-demand inference settings for larger models. Our findings highlight the\ntrade-off between model quality and inference efficiency, offering insights for\npractitioners seeking to balance model quality and deployment constraints.", "paper_summary_zh": "小型的、经过高度训练的、开源的大语言模型因其推理效率而被广泛使用，但进一步提高其质量仍然是一个挑战。稀疏升级是一种很有前途的方法，它将预先训练的稠密模型转换为专家混合 (MoE) 架构，从而增加了模型的参数数量和质量。在这项工作中，我们比较了稀疏升级与持续预训练 (CPT) 在不同模型大小、计算预算和预训练持续时间方面的有效性。我们的实验表明，稀疏升级可以实现更好的质量，在某些情况下相对于 CPT 提高了 20% 以上。然而，这会带来显着的推理成本，导致在大型模型的高需求推理设置中速度降低 40%。我们的研究结果突出了模型质量和推理效率之间的权衡，为寻求平衡模型质量和部署约束的从业者提供了见解。", "author": "Sasha Doubov et.al.", "authors": "Sasha Doubov, Nikhil Sardana, Vitaliy Chiley", "id": "2411.08968v1", "paper_url": "http://arxiv.org/abs/2411.08968v1", "repo": "null"}}