{"2406.09292": {"publish_time": "2024-06-13", "title": "Neural Assets: 3D-Aware Multi-Object Scene Synthesis with Image Diffusion Models", "paper_summary": "We address the problem of multi-object 3D pose control in image diffusion\nmodels. Instead of conditioning on a sequence of text tokens, we propose to use\na set of per-object representations, Neural Assets, to control the 3D pose of\nindividual objects in a scene. Neural Assets are obtained by pooling visual\nrepresentations of objects from a reference image, such as a frame in a video,\nand are trained to reconstruct the respective objects in a different image,\ne.g., a later frame in the video. Importantly, we encode object visuals from\nthe reference image while conditioning on object poses from the target frame.\nThis enables learning disentangled appearance and pose features. Combining\nvisual and 3D pose representations in a sequence-of-tokens format allows us to\nkeep the text-to-image architecture of existing models, with Neural Assets in\nplace of text tokens. By fine-tuning a pre-trained text-to-image diffusion\nmodel with this information, our approach enables fine-grained 3D pose and\nplacement control of individual objects in a scene. We further demonstrate that\nNeural Assets can be transferred and recomposed across different scenes. Our\nmodel achieves state-of-the-art multi-object editing results on both synthetic\n3D scene datasets, as well as two real-world video datasets (Objectron, Waymo\nOpen).", "paper_summary_zh": "<paragraph>我們探討了影像擴散模型中的多物件 3D 姿勢控制問題。我們不針對文字符號序列進行條件設定，而是提議使用一組物件表示，也就是神經資產，來控制場景中個別物件的 3D 姿勢。神經資產是透過匯集參考影像（例如影片中的某個畫面）中物件的視覺表示而取得，並受訓練以重建不同影像（例如影片中較後的畫面）中的個別物件。重要的是，我們在對目標畫面中的物件姿勢進行條件設定的同時，對參考影像中的物件視覺效果進行編碼。這能學習解開糾纏的外觀和姿勢特徵。將視覺和 3D 姿勢表示以符號序列格式結合，讓我們得以保留現有模型的文字轉影像架構，並以神經資產取代文字符號。透過微調預先訓練好的文字轉影像擴散模型，我們的做法能對場景中個別物件進行細緻的 3D 姿勢和位置控制。我們進一步證明，神經資產可以在不同的場景中進行傳輸和重新組合。我們的模型在合成 3D 場景資料集，以及兩個真實世界影片資料集（Objectron、Waymo Open）上，都達到了最先進的多物件編輯結果。</paragraph>", "author": "Ziyi Wu et.al.", "authors": "Ziyi Wu, Yulia Rubanova, Rishabh Kabra, Drew A. Hudson, Igor Gilitschenski, Yusuf Aytar, Sjoerd van Steenkiste, Kelsey R. Allen, Thomas Kipf", "id": "2406.09292v1", "paper_url": "http://arxiv.org/abs/2406.09292v1", "repo": "null"}}