{"2407.15814": {"publish_time": "2024-07-22", "title": "Perceptions of Linguistic Uncertainty by Language Models and Humans", "paper_summary": "Uncertainty expressions such as ``probably'' or ``highly unlikely'' are\npervasive in human language. While prior work has established that there is\npopulation-level agreement in terms of how humans interpret these expressions,\nthere has been little inquiry into the abilities of language models to\ninterpret such expressions. In this paper, we investigate how language models\nmap linguistic expressions of uncertainty to numerical responses. Our approach\nassesses whether language models can employ theory of mind in this setting:\nunderstanding the uncertainty of another agent about a particular statement,\nindependently of the model's own certainty about that statement. We evaluate\nboth humans and 10 popular language models on a task created to assess these\nabilities. Unexpectedly, we find that 8 out of 10 models are able to map\nuncertainty expressions to probabilistic responses in a human-like manner.\nHowever, we observe systematically different behavior depending on whether a\nstatement is actually true or false. This sensitivity indicates that language\nmodels are substantially more susceptible to bias based on their prior\nknowledge (as compared to humans). These findings raise important questions and\nhave broad implications for human-AI alignment and AI-AI communication.", "paper_summary_zh": "不確定性表達式，例如「可能」或「極不可能」，在人類語言中普遍存在。雖然先前的工作已經確定，在人類如何詮釋這些表達式方面存在著人口層級的共識，但對於語言模型詮釋此類表達式的能力，卻鮮少有探討。在本文中，我們探討語言模型如何將不確定性的語言表達式對應到數值回應。我們的做法評估語言模型在這種情況下是否能運用心智理論：了解另一個主體對特定陳述的不確定性，且與模型對該陳述本身的確定性無關。我們針對人類和 10 個流行的語言模型，評估一項旨在評量這些能力的任務。出乎意料地，我們發現 10 個模型中有 8 個能夠以類似人類的方式，將不確定性表達式對應到機率回應。然而，我們觀察到，視陳述實際為真或假，而有系統性的不同行為。這種敏感性表明，語言模型極容易受到基於其先驗知識的偏差影響（相較於人類）。這些發現提出了重要的問題，並對人類與 AI 的協調，以及 AI 與 AI 之間的溝通，產生廣泛的影響。", "author": "Catarina G Belem et.al.", "authors": "Catarina G Belem, Markelle Kelly, Mark Steyvers, Sameer Singh, Padhraic Smyth", "id": "2407.15814v1", "paper_url": "http://arxiv.org/abs/2407.15814v1", "repo": "https://github.com/ucidatalab/llm-uncertainty-perceptions"}}