{"2408.13082": {"publish_time": "2024-08-23", "title": "Multivariate Time-Series Anomaly Detection based on Enhancing Graph Attention Networks with Topological Analysis", "paper_summary": "Unsupervised anomaly detection in time series is essential in industrial\napplications, as it significantly reduces the need for manual intervention.\nMultivariate time series pose a complex challenge due to their feature and\ntemporal dimensions. Traditional methods use Graph Neural Networks (GNNs) or\nTransformers to analyze spatial while RNNs to model temporal dependencies.\nThese methods focus narrowly on one dimension or engage in coarse-grained\nfeature extraction, which can be inadequate for large datasets characterized by\nintricate relationships and dynamic changes. This paper introduces a novel\ntemporal model built on an enhanced Graph Attention Network (GAT) for\nmultivariate time series anomaly detection called TopoGDN. Our model analyzes\nboth time and feature dimensions from a fine-grained perspective. First, we\nintroduce a multi-scale temporal convolution module to extract detailed\ntemporal features. Additionally, we present an augmented GAT to manage complex\ninter-feature dependencies, which incorporates graph topology into node\nfeatures across multiple scales, a versatile, plug-and-play enhancement that\nsignificantly boosts the performance of GAT. Our experimental results confirm\nthat our approach surpasses the baseline models on four datasets, demonstrating\nits potential for widespread application in fields requiring robust anomaly\ndetection. The code is available at https://github.com/ljj-cyber/TopoGDN.", "paper_summary_zh": "在工業應用中，時間序列中的無監督異常偵測非常重要，因為它大幅降低手動介入的需求。多變量時間序列由於其特徵和時間維度而構成複雜的挑戰。傳統方法使用圖神經網路 (GNN) 或 Transformer 來分析空間，同時使用遞迴神經網路 (RNN) 來建模時間依賴性。這些方法狹隘地關注於一個維度，或從事粗粒度特徵提取，這對於以複雜關係和動態變化為特徵的大型資料集來說可能不夠。本文介紹了一個新的時間模型，該模型建立在增強圖注意力網路 (GAT) 之上，用於稱為 TopoGDN 的多變量時間序列異常偵測。我們的模型從細粒度角度分析時間和特徵維度。首先，我們引入一個多尺度時間卷積模組來提取詳細的時間特徵。此外，我們提出了一個擴充的 GAT 來管理複雜的特性間依賴性，它將圖拓撲納入跨多個尺度的節點特徵中，這是一個通用的即插即用增強功能，可以顯著提升 GAT 的效能。我們的實驗結果證實，我們的做法在四個資料集上超越了基準模型，證明了其在需要穩健異常偵測的領域中廣泛應用的潛力。程式碼可在 https://github.com/ljj-cyber/TopoGDN 取得。", "author": "Zhe Liu et.al.", "authors": "Zhe Liu, Xiang Huang, Jingyun Zhang, Zhifeng Hao, Li Sun, Hao Peng", "id": "2408.13082v1", "paper_url": "http://arxiv.org/abs/2408.13082v1", "repo": "https://github.com/ljj-cyber/topogdn"}}