{"2409.06691": {"publish_time": "2024-09-10", "title": "Geometric-Averaged Preference Optimization for Soft Preference Labels", "paper_summary": "Many algorithms for aligning LLMs with human preferences assume that human\npreferences are binary and deterministic. However, it is reasonable to think\nthat they can vary with different individuals, and thus should be\ndistributional to reflect the fine-grained relationship between the responses.\nIn this work, we introduce the distributional soft preference labels and\nimprove Direct Preference Optimization (DPO) with a weighted geometric average\nof the LLM output likelihood in the loss function. In doing so, the scale of\nlearning loss is adjusted based on the soft labels, and the loss with equally\npreferred responses would be close to zero. This simple modification can be\neasily applied to any DPO family and helps the models escape from the\nover-optimization and objective mismatch prior works suffer from. In our\nexperiments, we simulate the soft preference labels with AI feedback from LLMs\nand demonstrate that geometric averaging consistently improves performance on\nstandard benchmarks for alignment research. In particular, we observe more\npreferable responses than binary labels and significant improvements with data\nwhere modestly-confident labels are in the majority.", "paper_summary_zh": "許多用於將 LLM 與人類偏好對齊的演算法假設人類偏好是二元的且確定的。然而，可以合理地認為它們會因人而異，因此應以分佈式方式反映回應之間的細微關係。在這項工作中，我們引入了分佈式軟偏好標籤，並使用損失函數中 LLM 輸出似然加權幾何平均值改進了直接偏好最佳化 (DPO)。在這樣做的過程中，學習損失的規模會根據軟標籤進行調整，並且具有相同偏好回應的損失將接近於零。這個簡單的修改可以輕鬆應用於任何 DPO 家族，並幫助模型擺脫過度最佳化和目標不匹配的問題。在我們的實驗中，我們使用來自 LLM 的 AI 回饋模擬軟偏好標籤，並證明幾何平均始終改善對齊研究的標準基準的效能。特別是，我們觀察到比二元標籤更理想的回應，並且在中度自信標籤佔多數的資料中獲得顯著的改進。", "author": "Hiroki Furuta et.al.", "authors": "Hiroki Furuta, Kuang-Huei Lee, Shixiang Shane Gu, Yutaka Matsuo, Aleksandra Faust, Heiga Zen, Izzeddin Gur", "id": "2409.06691v1", "paper_url": "http://arxiv.org/abs/2409.06691v1", "repo": "null"}}