{"2409.02095": {"publish_time": "2024-09-03", "title": "DepthCrafter: Generating Consistent Long Depth Sequences for Open-world Videos", "paper_summary": "Despite significant advancements in monocular depth estimation for static\nimages, estimating video depth in the open world remains challenging, since\nopen-world videos are extremely diverse in content, motion, camera movement,\nand length. We present DepthCrafter, an innovative method for generating\ntemporally consistent long depth sequences with intricate details for\nopen-world videos, without requiring any supplementary information such as\ncamera poses or optical flow. DepthCrafter achieves generalization ability to\nopen-world videos by training a video-to-depth model from a pre-trained\nimage-to-video diffusion model, through our meticulously designed three-stage\ntraining strategy with the compiled paired video-depth datasets. Our training\napproach enables the model to generate depth sequences with variable lengths at\none time, up to 110 frames, and harvest both precise depth details and rich\ncontent diversity from realistic and synthetic datasets. We also propose an\ninference strategy that processes extremely long videos through segment-wise\nestimation and seamless stitching. Comprehensive evaluations on multiple\ndatasets reveal that DepthCrafter achieves state-of-the-art performance in\nopen-world video depth estimation under zero-shot settings. Furthermore,\nDepthCrafter facilitates various downstream applications, including depth-based\nvisual effects and conditional video generation.", "paper_summary_zh": "儘管靜態影像的單眼深度估計技術已大幅進步，但開放世界中的影片深度估計仍是一項挑戰，因為開放世界的影片在內容、動作、相機移動和長度上極為多樣化。我們提出 DepthCrafter，這是一種創新方法，用於為開放世界的影片產生具有複雜細節且在時間上一致的長深度序列，而不需要任何補充資訊，例如相機姿勢或光流。DepthCrafter 透過我們精心設計的三階段訓練策略，從預先訓練好的影像到影片擴散模型訓練影片到深度模型，進而達成對開放世界影片的泛化能力，並編譯配對的影片深度資料集。我們的訓練方法使模型能夠一次產生長度可變的深度序列，最多可達 110 幀，並從逼真和合成資料集中擷取精確的深度細節和豐富的內容多樣性。我們還提出了一種推理策略，透過分段估計和無縫拼接來處理極長的影片。在多個資料集上的全面評估顯示，DepthCrafter 在零次學習設定下，在開放世界的影片深度估計中達到了最先進的效能。此外，DepthCrafter 促進了各種下游應用，包括基於深度的視覺效果和條件式影片產生。", "author": "Wenbo Hu et.al.", "authors": "Wenbo Hu, Xiangjun Gao, Xiaoyu Li, Sijie Zhao, Xiaodong Cun, Yong Zhang, Long Quan, Ying Shan", "id": "2409.02095v1", "paper_url": "http://arxiv.org/abs/2409.02095v1", "repo": "null"}}