{"2408.00435": {"publish_time": "2024-08-01", "title": "A Qualitative Study on Using ChatGPT for Software Security: Perception vs. Practicality", "paper_summary": "Artificial Intelligence (AI) advancements have enabled the development of\nLarge Language Models (LLMs) that can perform a variety of tasks with\nremarkable semantic understanding and accuracy. ChatGPT is one such LLM that\nhas gained significant attention due to its impressive capabilities for\nassisting in various knowledge-intensive tasks. Due to the knowledge-intensive\nnature of engineering secure software, ChatGPT's assistance is expected to be\nexplored for security-related tasks during the development/evolution of\nsoftware. To gain an understanding of the potential of ChatGPT as an emerging\ntechnology for supporting software security, we adopted a two-fold approach.\nInitially, we performed an empirical study to analyse the perceptions of those\nwho had explored the use of ChatGPT for security tasks and shared their views\non Twitter. It was determined that security practitioners view ChatGPT as\nbeneficial for various software security tasks, including vulnerability\ndetection, information retrieval, and penetration testing. Secondly, we\ndesigned an experiment aimed at investigating the practicality of this\ntechnology when deployed as an oracle in real-world settings. In particular, we\nfocused on vulnerability detection and qualitatively examined ChatGPT outputs\nfor given prompts within this prominent software security task. Based on our\nanalysis, responses from ChatGPT in this task are largely filled with generic\nsecurity information and may not be appropriate for industry use. To prevent\ndata leakage, we performed this analysis on a vulnerability dataset compiled\nafter the OpenAI data cut-off date from real-world projects covering 40\ndistinct vulnerability types and 12 programming languages. We assert that the\nfindings from this study would contribute to future research aimed at\ndeveloping and evaluating LLMs dedicated to software security.", "paper_summary_zh": "<paragraph>人工智慧 (AI) 的進步促成了大型語言模型 (LLM) 的發展，此模型可以執行各種任務，具備卓越的語意理解和準確度。ChatGPT 就是其中一個大型語言模型，由於其在協助各種知識密集型任務方面具有令人印象深刻的能力，因此備受關注。由於工程安全軟體的知識密集性，預計在軟體開發/演進過程中，將探索 ChatGPT 的協助，以執行與安全相關的任務。為了了解 ChatGPT 作為支援軟體安全的新興技術的潛力，我們採取了雙管齊下的方法。最初，我們進行了一項實證研究，以分析那些已經探索將 ChatGPT 用於安全任務的人的看法，並在 Twitter 上分享他們的觀點。確定安全從業人員將 ChatGPT 視為對各種軟體安全任務有益，包括漏洞偵測、資訊擷取和滲透測試。其次，我們設計了一個實驗，旨在調查在現實世界中將此技術部署為神諭時的實用性。特別是，我們專注於漏洞偵測，並在這個突出的軟體安全任務中，對 ChatGPT 對於給定提示的輸出進行定性檢查。根據我們的分析，ChatGPT 在此任務中的回應在很大程度上充斥著一般的安全資訊，可能不適合產業使用。為了防止資料外洩，我們在 OpenAI 資料截止日期後編譯的漏洞資料集上執行此分析，該資料集涵蓋了來自現實世界專案的 40 種不同的漏洞類型和 12 種程式語言。我們斷言，這項研究的發現將有助於未來的研究，目的是開發和評估專門用於軟體安全的 LLM。</paragraph>", "author": "M. Mehdi Kholoosi et.al.", "authors": "M. Mehdi Kholoosi, M. Ali Babar, Roland Croft", "id": "2408.00435v1", "paper_url": "http://arxiv.org/abs/2408.00435v1", "repo": "null"}}