{"2406.17404": {"publish_time": "2024-06-25", "title": "Make Some Noise: Unlocking Language Model Parallel Inference Capability through Noisy Training", "paper_summary": "Existing speculative decoding methods typically require additional model\nstructure and training processes to assist the model for draft token\ngeneration. This makes the migration of acceleration methods to the new model\nmore costly and more demanding on device memory. To address this problem, we\npropose the Make Some Noise (MSN) training framework as a replacement for the\nsupervised fine-tuning stage of the large language model. The training method\nsimply introduces some noise at the input for the model to learn the denoising\ntask. It significantly enhances the parallel decoding capability of the model\nwithout affecting the original task capability. In addition, we propose a\ntree-based retrieval-augmented Jacobi (TR-Jacobi) decoding strategy to further\nimprove the inference speed of MSN models. Experiments in both the general and\ncode domains have shown that MSN can improve inference speed by 2.3-2.7x times\nwithout compromising model performance. The MSN model also achieves comparable\nacceleration ratios to the SOTA model with additional model structure on\nSpec-Bench.", "paper_summary_zh": "現有的推測性解碼方法通常需要額外的模型結構和訓練流程，以協助模型進行草稿令牌生成。這使得加速方法遷移到新模型的成本更高，並且對裝置記憶體的要求也更高。為了解決這個問題，我們提出將 Make Some Noise (MSN) 訓練架構作為大型語言模型監督微調階段的替代方案。訓練方法僅在輸入端引入一些雜訊，讓模型學習去雜訊任務。它顯著增強了模型的並行解碼能力，而不會影響原始任務能力。此外，我們提出一個基於樹的檢索增強 Jacobi (TR-Jacobi) 解碼策略，以進一步提高 MSN 模型的推理速度。一般和程式碼領域的實驗表明，MSN 可以將推理速度提高 2.3-2.7 倍，而不會損害模型效能。MSN 模型在 Spec-Bench 上也達到了與 SOTA 模型相當的加速比，並具備額外的模型結構。", "author": "Yixuan Wang et.al.", "authors": "Yixuan Wang, Xianzhen Luo, Fuxuan Wei, Yijun Liu, Qingfu Zhu, Xuanyu Zhang, Qing Yang, Dongliang Xu, Wanxiang Che", "id": "2406.17404v1", "paper_url": "http://arxiv.org/abs/2406.17404v1", "repo": "null"}}