{"2407.13943": {"publish_time": "2024-07-18", "title": "Werewolf Arena: A Case Study in LLM Evaluation via Social Deduction", "paper_summary": "This paper introduces Werewolf Arena, a novel framework for evaluating large\nlanguage models (LLMs) through the lens of the classic social deduction game,\nWerewolf. In Werewolf Arena, LLMs compete against each other, navigating the\ngame's complex dynamics of deception, deduction, and persuasion. The framework\nintroduces a dynamic turn-taking system based on bidding, mirroring real-world\ndiscussions where individuals strategically choose when to speak. We\ndemonstrate the framework's utility through an arena-style tournament featuring\nGemini and GPT models. Our results reveal distinct strengths and weaknesses in\nthe models' strategic reasoning and communication. These findings highlight\nWerewolf Arena's potential as a challenging and scalable LLM benchmark.", "paper_summary_zh": "本論文介紹了狼人競技場，一個透過經典社交推理遊戲狼人的角度來評估大型語言模型 (LLM) 的新穎架構。在狼人競技場中，LLM 彼此競爭，探索遊戲中複雜的欺騙、推理和說服動態。該架構引入了基於競標的動態回合制系統，反映了現實世界的討論，其中個人策略性地選擇發言時機。我們透過一場以 Gemini 和 GPT 模型為主的競技場式錦標賽展示了該架構的效用。我們的結果揭示了模型在策略推理和溝通方面的不同優缺點。這些發現突出了狼人競技場作為一個具有挑戰性和可擴展性的 LLM 基準的潛力。", "author": "Suma Bailis et.al.", "authors": "Suma Bailis, Jane Friedhoff, Feiyang Chen", "id": "2407.13943v1", "paper_url": "http://arxiv.org/abs/2407.13943v1", "repo": "null"}}