{"2410.15038": {"publish_time": "2024-10-19", "title": "A General-Purpose Multimodal Foundation Model for Dermatology", "paper_summary": "Diagnosing and treating skin diseases require advanced visual skills across\nmultiple domains and the ability to synthesize information from various imaging\nmodalities. Current deep learning models, while effective at specific tasks\nsuch as diagnosing skin cancer from dermoscopic images, fall short in\naddressing the complex, multimodal demands of clinical practice. Here, we\nintroduce PanDerm, a multimodal dermatology foundation model pretrained through\nself-supervised learning on a dataset of over 2 million real-world images of\nskin diseases, sourced from 11 clinical institutions across 4 imaging\nmodalities. We evaluated PanDerm on 28 diverse datasets covering a range of\nclinical tasks, including skin cancer screening, phenotype assessment and risk\nstratification, diagnosis of neoplastic and inflammatory skin diseases, skin\nlesion segmentation, change monitoring, and metastasis prediction and\nprognosis. PanDerm achieved state-of-the-art performance across all evaluated\ntasks, often outperforming existing models even when using only 5-10% of\nlabeled data. PanDerm's clinical utility was demonstrated through reader\nstudies in real-world clinical settings across multiple imaging modalities. It\noutperformed clinicians by 10.2% in early-stage melanoma detection accuracy and\nenhanced clinicians' multiclass skin cancer diagnostic accuracy by 11% in a\ncollaborative human-AI setting. Additionally, PanDerm demonstrated robust\nperformance across diverse demographic factors, including different body\nlocations, age groups, genders, and skin tones. The strong results in benchmark\nevaluations and real-world clinical scenarios suggest that PanDerm could\nenhance the management of skin diseases and serve as a model for developing\nmultimodal foundation models in other medical specialties, potentially\naccelerating the integration of AI support in healthcare.", "paper_summary_zh": "診斷和治療皮膚疾病需要跨多個領域的進階視覺技能，以及綜合來自各種影像模式資訊的能力。目前的深度學習模型雖然在特定任務上有效，例如從皮膚鏡影像診斷皮膚癌，但無法滿足臨床實務複雜的多模式需求。在此，我們推出 PanDerm，這是一個多模式皮膚科基礎模型，透過自監督學習預先訓練，使用來自 4 種影像模式、11 個臨床機構的 200 多萬張真實皮膚疾病影像資料集。我們在 28 個涵蓋一系列臨床任務的多元資料集上評估 PanDerm，包括皮膚癌篩檢、表型評估和風險分層、腫瘤性和發炎性皮膚疾病診斷、皮膚病灶分割、變化監控以及轉移預測和預後。PanDerm 在所有評估任務中都達到最先進的效能，即使僅使用 5-10% 的標籤資料，也經常優於現有模型。PanDerm 的臨床效用已透過多種影像模式的真實臨床環境中的讀者研究得到證明。它在早期黑色素瘤檢測準確度方面優於臨床醫生 10.2%，並在協作的人工智慧環境中將臨床醫生的多類皮膚癌診斷準確度提高了 11%。此外，PanDerm 在不同的身體部位、年齡組、性別和膚色等多樣化的人口統計因素中表現出穩健的效能。基準評估和真實臨床場景中的強勁結果表明，PanDerm 可以加強皮膚疾病的管理，並作為在其他醫學專科開發多模式基礎模型的範例，進而加速將人工智慧支援整合到醫療保健中。", "author": "Siyuan Yan et.al.", "authors": "Siyuan Yan, Zhen Yu, Clare Primiero, Cristina Vico-Alonso, Zhonghua Wang, Litao Yang, Philipp Tschandl, Ming Hu, Gin Tan, Vincent Tang, Aik Beng Ng, David Powell, Paul Bonnington, Simon See, Monika Janda, Victoria Mar, Harald Kittler, H. Peter Soyer, Zongyuan Ge", "id": "2410.15038v1", "paper_url": "http://arxiv.org/abs/2410.15038v1", "repo": "null"}}