{"2408.06911": {"publish_time": "2024-08-13", "title": "Heterogeneous Space Fusion and Dual-Dimension Attention: A New Paradigm for Speech Enhancement", "paper_summary": "Self-supervised learning has demonstrated impressive performance in speech\ntasks, yet there remains ample opportunity for advancement in the realm of\nspeech enhancement research. In addressing speech tasks, confining the\nattention mechanism solely to the temporal dimension poses limitations in\neffectively focusing on critical speech features. Considering the\naforementioned issues, our study introduces a novel speech enhancement\nframework, HFSDA, which skillfully integrates heterogeneous spatial features\nand incorporates a dual-dimension attention mechanism to significantly enhance\nspeech clarity and quality in noisy environments. By leveraging self-supervised\nlearning embeddings in tandem with Short-Time Fourier Transform (STFT)\nspectrogram features, our model excels at capturing both high-level semantic\ninformation and detailed spectral data, enabling a more thorough analysis and\nrefinement of speech signals. Furthermore, we employ the innovative\nOmni-dimensional Dynamic Convolution (ODConv) technology within the spectrogram\ninput branch, enabling enhanced extraction and integration of crucial\ninformation across multiple dimensions. Additionally, we refine the Conformer\nmodel by enhancing its feature extraction capabilities not only in the temporal\ndimension but also across the spectral domain. Extensive experiments on the\nVCTK-DEMAND dataset show that HFSDA is comparable to existing state-of-the-art\nmodels, confirming the validity of our approach.", "paper_summary_zh": "自监督学习已在语音任务中表现出令人印象深刻的性能，然而在语音增强研究领域仍有很大的进步空间。在处理语音任务时，仅将注意力机制限制在时间维度上会限制有效关注关键语音特征。考虑到上述问题，我们的研究引入了一个新颖的语音增强框架 HFSDA，它巧妙地集成了异构空间特征，并结合了双维注意力机制，以显着提高噪声环境中的语音清晰度和质量。通过利用自监督学习嵌入与短时傅里叶变换 (STFT) 频谱图特征相结合，我们的模型擅长同时捕获高级语义信息和详细的光谱数据，从而能够更彻底地分析和优化语音信号。此外，我们在频谱图输入分支中采用了创新的全维动态卷积 (ODConv) 技术，从而能够增强跨多个维度提取和集成关键信息。此外，我们通过增强其特征提取能力来改进 Conformer 模型，不仅在时间维度上，而且在频谱域上。在 VCTK-DEMAND 数据集上的大量实验表明，HFSDA 与现有的最先进模型相当，证实了我们方法的有效性。", "author": "Tao Zheng et.al.", "authors": "Tao Zheng, Liejun Wang, Yinfeng Yu", "id": "2408.06911v1", "paper_url": "http://arxiv.org/abs/2408.06911v1", "repo": "null"}}