{"2407.11439": {"publish_time": "2024-07-16", "title": "Repurformer: Transformers for Repurposing-Aware Molecule Generation", "paper_summary": "Generating as diverse molecules as possible with desired properties is\ncrucial for drug discovery research, which invokes many approaches based on\ndeep generative models today. Despite recent advancements in these models,\nparticularly in variational autoencoders (VAEs), generative adversarial\nnetworks (GANs), Transformers, and diffusion models, a significant challenge\nknown as \\textit{the sample bias problem} remains. This problem occurs when\ngenerated molecules targeting the same protein tend to be structurally similar,\nreducing the diversity of generation. To address this, we propose leveraging\nmulti-hop relationships among proteins and compounds. Our model, Repurformer,\nintegrates bi-directional pretraining with Fast Fourier Transform (FFT) and\nlow-pass filtering (LPF) to capture complex interactions and generate diverse\nmolecules. A series of experiments on BindingDB dataset confirm that\nRepurformer successfully creates substitutes for anchor compounds that resemble\npositive compounds, increasing diversity between the anchor and generated\ncompounds.", "paper_summary_zh": "要生成具有所需属性的尽可能多樣化的分子對於藥物發現研究至關重要，這項研究採用了許多基於深度生成模型的方法。儘管這些模型最近有了進展，特別是在變分自編碼器 (VAE)、生成對抗網路 (GAN)、Transformer和擴散模型方面，但仍存在一個重大的挑戰，稱為「樣本偏差問題」。當針對同一蛋白質產生的分子在結構上傾向於相似時，就會發生這個問題，進而降低生成的樣本多樣性。為了解決這個問題，我們建議利用蛋白質和化合物之間的多跳關係。我們的模型 Repurformer 將雙向預訓練與快速傅立葉轉換 (FFT) 和低通濾波 (LPF) 整合在一起，以捕捉複雜的交互作用並生成多樣化的分子。一系列針對 BindingDB 資料集的實驗證實，Repurformer 成功地為錨定化合物創造了替代物，這些替代物類似於正向化合物，增加了錨定化合物和生成化合物之間的多樣性。", "author": "Changhun Lee et.al.", "authors": "Changhun Lee, Gyumin Lee", "id": "2407.11439v1", "paper_url": "http://arxiv.org/abs/2407.11439v1", "repo": "null"}}