{"2411.14193": {"publish_time": "2024-11-21", "title": "ComfyGI: Automatic Improvement of Image Generation Workflows", "paper_summary": "Automatic image generation is no longer just of interest to researchers, but\nalso to practitioners. However, current models are sensitive to the settings\nused and automatic optimization methods often require human involvement. To\nbridge this gap, we introduce ComfyGI, a novel approach to automatically\nimprove workflows for image generation without the need for human intervention\ndriven by techniques from genetic improvement. This enables image generation\nwith significantly higher quality in terms of the alignment with the given\ndescription and the perceived aesthetics. On the performance side, we find that\noverall, the images generated with an optimized workflow are about 50% better\ncompared to the initial workflow in terms of the median ImageReward score.\nThese already good results are even surpassed in our human evaluation, as the\nparticipants preferred the images improved by ComfyGI in around 90% of the\ncases.", "paper_summary_zh": "自動影像生成不再僅是研究人員有興趣的領域，\n實務工作者也開始關注。然而，目前的模型對所使用的設定很敏感，而自動最佳化方法通常需要人工介入。為了彌補這個差距，我們引入了 ComfyGI，一種新穎的方法，可自動改善影像生成工作流程，無需人工介入，並由遺傳改良技術驅動。這使得影像生成在與給定描述的一致性和感知美學方面具有顯著更高的品質。在效能方面，我們發現整體而言，使用最佳化工作流程生成的影像在 ImageReward 中位數評分方面比初始工作流程高出約 50%。這些已經不錯的結果在我們的人類評估中甚至被超越，因為參與者在約 90% 的情況下更喜歡 ComfyGI 改進的影像。", "author": "Dominik Sobania et.al.", "authors": "Dominik Sobania, Martin Briesch, Franz Rothlauf", "id": "2411.14193v1", "paper_url": "http://arxiv.org/abs/2411.14193v1", "repo": "null"}}