{"2412.17807": {"publish_time": "2024-12-23", "title": "Cross-View Referring Multi-Object Tracking", "paper_summary": "Referring Multi-Object Tracking (RMOT) is an important topic in the current\ntracking field. Its task form is to guide the tracker to track objects that\nmatch the language description. Current research mainly focuses on referring\nmulti-object tracking under single-view, which refers to a view sequence or\nmultiple unrelated view sequences. However, in the single-view, some\nappearances of objects are easily invisible, resulting in incorrect matching of\nobjects with the language description. In this work, we propose a new task,\ncalled Cross-view Referring Multi-Object Tracking (CRMOT). It introduces the\ncross-view to obtain the appearances of objects from multiple views, avoiding\nthe problem of the invisible appearances of objects in RMOT task. CRMOT is a\nmore challenging task of accurately tracking the objects that match the\nlanguage description and maintaining the identity consistency of objects in\neach cross-view. To advance CRMOT task, we construct a cross-view referring\nmulti-object tracking benchmark based on CAMPUS and DIVOTrack datasets, named\nCRTrack. Specifically, it provides 13 different scenes and 221 language\ndescriptions. Furthermore, we propose an end-to-end cross-view referring\nmulti-object tracking method, named CRTracker. Extensive experiments on the\nCRTrack benchmark verify the effectiveness of our method. The dataset and code\nare available at https://github.com/chen-si-jia/CRMOT.", "paper_summary_zh": "多目標追蹤 (RMOT) 是目前追蹤領域中一個重要的課題。其任務形式是引導追蹤器追蹤符合語言描述的目標。目前的研究主要集中於單視角下的多目標追蹤，指的是一個視角序列或多個無關的視角序列。然而，在單視角中，目標的一些外觀很容易看不見，導致目標與語言描述不正確地匹配。在這項工作中，我們提出了新任務，稱為跨視角多目標追蹤 (CRMOT)。它引入了跨視角，以從多個視角獲得目標的外觀，避免了 RMOT 任務中目標外觀不可見的問題。CRMOT 是一項更具挑戰性的任務，準確追蹤符合語言描述的目標，並維持每個跨視角中目標的身份一致性。為了推進 CRMOT 任務，我們基於 CAMPUS 和 DIVOTrack 資料集構建了一個跨視角多目標追蹤基準，稱為 CRTrack。具體來說，它提供了 13 個不同的場景和 221 個語言描述。此外，我們提出了一種端到端的跨視角多目標追蹤方法，稱為 CRTracker。在 CRTrack 基準上進行的廣泛實驗驗證了我們方法的有效性。資料集和程式碼可在 https://github.com/chen-si-jia/CRMOT 中取得。", "author": "Sijia Chen et.al.", "authors": "Sijia Chen, En Yu, Wenbing Tao", "id": "2412.17807v1", "paper_url": "http://arxiv.org/abs/2412.17807v1", "repo": "https://github.com/chen-si-jia/crmot"}}