{"2406.06201": {"publish_time": "2024-06-10", "title": "2DP-2MRC: 2-Dimensional Pointer-based Machine Reading Comprehension Method for Multimodal Moment Retrieval", "paper_summary": "Moment retrieval aims to locate the most relevant moment in an untrimmed\nvideo based on a given natural language query. Existing solutions can be\nroughly categorized into moment-based and clip-based methods. The former often\ninvolves heavy computations, while the latter, due to overlooking\ncoarse-grained information, typically underperforms compared to moment-based\nmodels. Hence, this paper proposes a novel 2-Dimensional Pointer-based Machine\nReading Comprehension for Moment Retrieval Choice (2DP-2MRC) model to address\nthe issue of imprecise localization in clip-based methods while maintaining\nlower computational complexity than moment-based methods. Specifically, we\nintroduce an AV-Encoder to capture coarse-grained information at moment and\nvideo levels. Additionally, a 2D pointer encoder module is introduced to\nfurther enhance boundary detection for target moment. Extensive experiments on\nthe HiREST dataset demonstrate that 2DP-2MRC significantly outperforms existing\nbaseline models.", "paper_summary_zh": "時刻檢索旨在根據給定的自然語言查詢，在未修剪的影片中找到最相關的時刻。現有的解決方案大致可分類為基於時刻和基於片段的方法。前者通常涉及繁重的運算，而後者由於忽略了粗粒度資訊，通常表現不如基於時刻的模型。因此，本文提出了一個新的基於二維指標的機器閱讀理解時刻檢索選擇 (2DP-2MRC) 模型，以解決基於片段的方法中定位不精確的問題，同時維持比基於時刻的方法更低的運算複雜度。具體來說，我們引入了 AV 編碼器來擷取時刻和影片層級的粗粒度資訊。此外，還引入了 2D 指標編碼器模組，以進一步增強目標時刻的邊界檢測。在 HiREST 資料集上的廣泛實驗證明，2DP-2MRC 明顯優於現有的基線模型。", "author": "Jiajun He et.al.", "authors": "Jiajun He, Tomoki Toda", "id": "2406.06201v1", "paper_url": "http://arxiv.org/abs/2406.06201v1", "repo": "null"}}