{"2410.08821": {"publish_time": "2024-10-11", "title": "Retriever-and-Memory: Towards Adaptive Note-Enhanced Retrieval-Augmented Generation", "paper_summary": "Retrieval-Augmented Generation (RAG) mitigates issues of the factual errors\nand hallucinated outputs generated by Large Language Models (LLMs) in\nopen-domain question-answering tasks (OpenQA) via introducing external\nknowledge. For complex QA, however, existing RAG methods use LLMs to actively\npredict retrieval timing and directly use the retrieved information for\ngeneration, regardless of whether the retrieval timing accurately reflects the\nactual information needs, or sufficiently considers prior retrieved knowledge,\nwhich may result in insufficient information gathering and interaction,\nyielding low-quality answers. To address these, we propose a generic RAG\napproach called Adaptive Note-Enhanced RAG (Adaptive-Note) for complex QA\ntasks, which includes the iterative information collector, adaptive memory\nreviewer, and task-oriented generator, while following a new\nRetriever-and-Memory paradigm. Specifically, Adaptive-Note introduces an\noverarching view of knowledge growth, iteratively gathering new information in\nthe form of notes and updating them into the existing optimal knowledge\nstructure, enhancing high-quality knowledge interactions. In addition, we\nemploy an adaptive, note-based stop-exploration strategy to decide \"what to\nretrieve and when to stop\" to encourage sufficient knowledge exploration. We\nconduct extensive experiments on five complex QA datasets, and the results\ndemonstrate the superiority and effectiveness of our method and its components.\nThe code and data are at https://github.com/thunlp/Adaptive-Note.", "paper_summary_zh": "<paragraph>檢索增強生成 (RAG) 透過引入外部知識，減輕大型語言模型 (LLM) 在開放式問答任務 (OpenQA) 中產生的事實錯誤和虛構輸出的問題。然而，對於複雜的問答，現有的 RAG 方法使用 LLM 主動預測檢索時機，並直接使用檢索到的資訊進行生成，而不論檢索時機是否準確反映實際資訊需求，或是否充分考慮先前的檢索知識，這可能會導致資訊收集和互動不足，產生品質低落的答案。為了解決這些問題，我們提出一個稱為自適應筆記增強 RAG (Adaptive-Note) 的通用 RAG 方法，用於複雜的問答任務，其中包括反覆的資訊收集器、自適應記憶體檢閱器和任務導向生成器，同時遵循新的檢索器和記憶體範例。具體來說，自適應筆記介紹了知識成長的整體觀點，反覆以筆記的形式收集新資訊，並將其更新到現有的最佳知識結構中，增強高品質的知識互動。此外，我們採用自適應的、基於筆記的停止探索策略來決定「要檢索什麼和何時停止」，以鼓勵充分的知識探索。我們對五個複雜的問答資料集進行廣泛的實驗，結果證明了我們的方法及其組成的優越性和有效性。程式碼和資料位於 https://github.com/thunlp/Adaptive-Note。</paragraph>", "author": "Ruobing Wang et.al.", "authors": "Ruobing Wang, Daren Zha, Shi Yu, Qingfei Zhao, Yuxuan Chen, Yixuan Wang, Shuo Wang, Yukun Yan, Zhenghao Liu, Xu Han, Zhiyuan Liu, Maosong Sun", "id": "2410.08821v1", "paper_url": "http://arxiv.org/abs/2410.08821v1", "repo": "https://github.com/thunlp/adaptive-note"}}