{"2406.14189": {"publish_time": "2024-06-20", "title": "In Tree Structure Should Sentence Be Generated", "paper_summary": "Generative models reliant on sequential autoregression have been at the\nforefront of language generation for an extensive period, particularly\nfollowing the introduction of widely acclaimed transformers. Despite its\nexcellent performance, there are always some issues that we face today. For\nexample, problems such as hallucinations and getting trapped in a logic loop\nmay occur. To enhance the performance of existing systems, this paper\nintroduces a new method for generating sequences in natural language, which\ninvolves generating the targeted sentence in a tree-traversing order. The paper\nincludes an illustration of the theoretical basis and validity of the approach,\nas well as a comparison of its fundamentals with the diffusion model in graphic\ngeneration. Finally, a module called SenTree is introduced for generating an\napproximating binary tree. It is already available at\nhttps://github.com/arklyg/sentree. Additionally, a joint training framework\nbased on this approach is proposed, incorporating the intrinsics of generative\nadversarial networks.", "paper_summary_zh": "依賴順序自迴歸的生成模型一直處於語言生成的最前線，特別是在廣受好評的Transformer引入之後。儘管有出色的表現，但我們今天仍然面臨一些問題。例如，可能會出現幻覺和陷入邏輯迴圈等問題。為了增強現有系統的性能，本文介紹了一種生成自然語言序列的新方法，其中涉及以樹狀遍歷順序生成目標句子。本文說明了該方法的理論基礎和有效性，並將其基礎與圖形生成中的擴散模型進行了比較。最後，引入了一個名為 SenTree 的模組，用於生成近似二元樹。它已經可以在 https://github.com/arklyg/sentree 上獲得。此外，還提出了一個基於此方法的聯合訓練框架，其中包含生成對抗網路的內在特性。", "author": "Yaguang Li et.al.", "authors": "Yaguang Li, Xin Chen", "id": "2406.14189v1", "paper_url": "http://arxiv.org/abs/2406.14189v1", "repo": "https://github.com/arklyg/sentree"}}