{"2411.06315": {"publish_time": "2024-11-09", "title": "NeuReg: Domain-invariant 3D Image Registration on Human and Mouse Brains", "paper_summary": "Medical brain imaging relies heavily on image registration to accurately\ncurate structural boundaries of brain features for various healthcare\napplications. Deep learning models have shown remarkable performance in image\nregistration in recent years. Still, they often struggle to handle the\ndiversity of 3D brain volumes, challenged by their structural and contrastive\nvariations and their imaging domains. In this work, we present NeuReg, a\nNeuro-inspired 3D image registration architecture with the feature of domain\ninvariance. NeuReg generates domain-agnostic representations of imaging\nfeatures and incorporates a shifting window-based Swin Transformer block as the\nencoder. This enables our model to capture the variations across brain imaging\nmodalities and species. We demonstrate a new benchmark in multi-domain publicly\navailable datasets comprising human and mouse 3D brain volumes. Extensive\nexperiments reveal that our model (NeuReg) outperforms the existing baseline\ndeep learning-based image registration models and provides a high-performance\nboost on cross-domain datasets, where models are trained on 'source-only'\ndomain and tested on completely 'unseen' target domains. Our work establishes a\nnew state-of-the-art for domain-agnostic 3D brain image registration,\nunderpinned by Neuro-inspired Transformer-based architecture.", "paper_summary_zh": "醫學腦部影像高度依賴影像配準，以準確策畫大腦特徵的結構性邊界，用於各種醫療保健應用。深度學習模型近年來在影像配準中展現出卓越的效能。儘管如此，這些模型在處理多元的 3D 大腦體積時常常會遇到困難，受到其結構和對比變化以及影像領域的挑戰。在這項工作中，我們提出 NeuReg，一種具備領域不變性特徵的神經啟發式 3D 影像配準架構。NeuReg 產生影像特徵的領域不可知表示，並將基於滑動視窗的 Swin Transformer 區塊作為編碼器。這使我們的模型能夠擷取跨大腦影像模式和物種的變化。我們展示了一個新的基準，包含人類和老鼠 3D 大腦體積的多領域公開可用資料集。廣泛的實驗顯示，我們的模型 (NeuReg) 優於現有的基準深度學習影像配準模型，並在跨領域資料集上提供高性能提升，其中模型在「僅來源」領域上訓練，並在完全「未見」的目標領域上進行測試。我們的研究建立了領域不可知 3D 大腦影像配準的新技術，由神經啟發式 Transformer 為基礎的架構所支撐。", "author": "Taha Razzaq et.al.", "authors": "Taha Razzaq, Asim Iqbal", "id": "2411.06315v1", "paper_url": "http://arxiv.org/abs/2411.06315v1", "repo": "null"}}