{"2407.17167": {"publish_time": "2024-07-24", "title": "Zero-Shot vs. Few-Shot Multi-Speaker TTS Using Pre-trained Czech SpeechT5 Model", "paper_summary": "In this paper, we experimented with the SpeechT5 model pre-trained on\nlarge-scale datasets. We pre-trained the foundation model from scratch and\nfine-tuned it on a large-scale robust multi-speaker text-to-speech (TTS) task.\nWe tested the model capabilities in a zero- and few-shot scenario. Based on two\nlistening tests, we evaluated the synthetic audio quality and the similarity of\nhow synthetic voices resemble real voices. Our results showed that the SpeechT5\nmodel can generate a synthetic voice for any speaker using only one minute of\nthe target speaker's data. We successfully demonstrated the high quality and\nsimilarity of our synthetic voices on publicly known Czech politicians and\ncelebrities.", "paper_summary_zh": "在本文中，我们对在大型数据集上预先训练的 SpeechT5 模型进行了实验。我们从头开始预先训练基础模型，并在大型、稳健的多说话者文本转语音 (TTS) 任务上对它进行了微调。我们在零样本和少量样本场景中测试了模型的能力。基于两次聆听测试，我们评估了合成音频质量以及合成声音与真实声音的相似性。我们的结果表明，SpeechT5 模型仅使用目标说话者一分钟的数据就能为任何说话者生成合成声音。我们成功地展示了我们在捷克知名政治家和名人身上合成声音的高质量和相似性。", "author": "Jan Lehečka et.al.", "authors": "Jan Lehečka, Zdeněk Hanzlíček, Jindřich Matoušek, Daniel Tihelka", "id": "2407.17167v1", "paper_url": "http://arxiv.org/abs/2407.17167v1", "repo": "null"}}