{"2406.19888": {"publish_time": "2024-06-28", "title": "Fine-tuning of Geospatial Foundation Models for Aboveground Biomass Estimation", "paper_summary": "Global vegetation structure mapping is critical for understanding the global\ncarbon cycle and maximizing the efficacy of nature-based carbon sequestration\ninitiatives. Moreover, vegetation structure mapping can help reduce the impacts\nof climate change by, for example, guiding actions to improve water security,\nincrease biodiversity and reduce flood risk. Global satellite measurements\nprovide an important set of observations for monitoring and managing\ndeforestation and degradation of existing forests, natural forest regeneration,\nreforestation, biodiversity restoration, and the implementation of sustainable\nagricultural practices. In this paper, we explore the effectiveness of\nfine-tuning of a geospatial foundation model to estimate above-ground biomass\n(AGB) using space-borne data collected across different eco-regions in Brazil.\nThe fine-tuned model architecture consisted of a Swin-B transformer as the\nencoder (i.e., backbone) and a single convolutional layer for the decoder head.\nAll results were compared to a U-Net which was trained as the baseline model\nExperimental results of this sparse-label prediction task demonstrate that the\nfine-tuned geospatial foundation model with a frozen encoder has comparable\nperformance to a U-Net trained from scratch. This is despite the fine-tuned\nmodel having 13 times less parameters requiring optimization, which saves both\ntime and compute resources. Further, we explore the transfer-learning\ncapabilities of the geospatial foundation models by fine-tuning on satellite\nimagery with sparse labels from different eco-regions in Brazil.", "paper_summary_zh": "全球植被結構繪製對於了解全球碳循環和最大化基於自然碳封存計畫的效能至關重要。此外，植被結構繪製有助於降低氣候變遷的影響，例如，指導改善水資源安全、增加生物多樣性以及降低洪水風險的行動。全球衛星測量提供了一組重要的觀測資料，用於監控和管理現有森林的森林砍伐和退化、天然森林再生、再造林、生物多樣性恢復以及永續農業實務的實施。在本文中，我們探討微調地理空間基礎模型以估計巴西不同生態區域中收集的太空資料中的地上生物量 (AGB) 的有效性。微調後的模型架構包含一個 Swin-B 轉換器作為編碼器（即，主幹）和一個單一卷積層作為解碼器頭。所有結果都與作為基準模型訓練的 U-Net 進行比較。這個稀疏標籤預測任務的實驗結果證明，凍結編碼器的微調地理空間基礎模型與從頭開始訓練的 U-Net 具有相當的效能。儘管微調模型的參數需要最佳化的數量少了 13 倍，這節省了時間和運算資源。此外，我們透過微調來自巴西不同生態區域的稀疏標籤的衛星影像，探討地理空間基礎模型的遷移學習能力。", "author": "Michal Muszynski et.al.", "authors": "Michal Muszynski, Levente Klein, Ademir Ferreira da Silva, Anjani Prasad Atluri, Carlos Gomes, Daniela Szwarcman, Gurkanwar Singh, Kewen Gu, Maciel Zortea, Naomi Simumba, Paolo Fraccaro, Shraddha Singh, Steve Meliksetian, Campbell Watson, Daiki Kimura, Harini Srinivasan", "id": "2406.19888v1", "paper_url": "http://arxiv.org/abs/2406.19888v1", "repo": "null"}}