{"2411.04109": {"publish_time": "2024-11-06", "title": "Self-Consistency Preference Optimization", "paper_summary": "Self-alignment, whereby models learn to improve themselves without human\nannotation, is a rapidly growing research area. However, existing techniques\noften fail to improve complex reasoning tasks due to the difficulty of\nassigning correct rewards. An orthogonal approach that is known to improve\ncorrectness is self-consistency, a method applied at inference time based on\nmultiple sampling in order to find the most consistent answer. In this work, we\nextend the self-consistency concept to help train models. We thus introduce\nself-consistency preference optimization (ScPO), which iteratively trains\nconsistent answers to be preferred over inconsistent ones on unsupervised new\nproblems. We show ScPO leads to large improvements over conventional reward\nmodel training on reasoning tasks such as GSM8K and MATH, closing the gap with\nsupervised training with gold answers or preferences, and that combining ScPO\nwith standard supervised learning improves results even further. On ZebraLogic,\nScPO finetunes Llama-3 8B to be superior to Llama-3 70B, Gemma-2 27B, and\nClaude-3 Haiku.", "paper_summary_zh": "自我對齊，即模型在沒有人工標註的情況下學會自我改進，是一個快速發展的研究領域。然而，現有的技術由於難以分配正確的獎勵，常常無法改進複雜的推理任務。一種已知可以提高正確性的正交方法是自一致性，這是一種在推理時間應用於多重抽樣的，用於找到最一致答案的方法。在這項工作中，我們將自一致性概念延伸到幫助訓練模型。因此，我們引入了自一致性偏好優化（ScPO），它反覆訓練一致的答案，使其在無監督的新問題上比不一致的答案更受青睞。我們展示了 ScPO 在推理任務（例如 GSM8K 和 MATH）上比傳統獎勵模型訓練有了很大改進，縮小了與使用黃金答案或偏好的監督訓練的差距，並且將 ScPO 與標準監督學習相結合進一步改進了結果。在 ZebraLogic 上，ScPO 對 Llama-3 8B 進行微調，使其優於 Llama-3 70B、Gemma-2 27B 和 Claude-3 Haiku。", "author": "Archiki Prasad et.al.", "authors": "Archiki Prasad, Weizhe Yuan, Richard Yuanzhe Pang, Jing Xu, Maryam Fazel-Zarandi, Mohit Bansal, Sainbayar Sukhbaatar, Jason Weston, Jane Yu", "id": "2411.04109v1", "paper_url": "http://arxiv.org/abs/2411.04109v1", "repo": "null"}}