{"2502.06648": {"publish_time": "2025-02-10", "title": "The 2021 Tokyo Olympics Multilingual News Article Dataset", "paper_summary": "In this paper, we introduce a dataset of multilingual news articles covering\nthe 2021 Tokyo Olympics. A total of 10,940 news articles were gathered from\n1,918 different publishers, covering 1,350 sub-events of the 2021 Olympics, and\npublished between July 1, 2021, and August 14, 2021. These articles are written\nin nine languages from different language families and in different scripts. To\ncreate the dataset, the raw news articles were first retrieved via a service\nthat collects and analyzes news articles. Then, the articles were grouped using\nan online clustering algorithm, with each group containing articles reporting\non the same sub-event. Finally, the groups were manually annotated and\nevaluated. The development of this dataset aims to provide a resource for\nevaluating the performance of multilingual news clustering algorithms, for\nwhich limited datasets are available. It can also be used to analyze the\ndynamics and events of the 2021 Tokyo Olympics from different perspectives. The\ndataset is available in CSV format and can be accessed from the CLARIN.SI\nrepository.", "paper_summary_zh": "<paragraph>在本文中，我們介紹了一個多語言新聞文章的資料集，涵蓋 2021 年東京奧運。總共從 1,918 個不同的出版商收集了 10,940 篇新聞文章，涵蓋 2021 年奧運的 1,350 個小項，並於 2021 年 7 月 1 日至 2021 年 8 月 14 日期間發布。這些文章以九種不同語言家族和不同文字撰寫。為了建立這個資料集，首先透過收集和分析新聞文章的服務來擷取原始新聞文章。接著，使用線上群集演算法將文章分組，每個群組包含報導同一個小項的文章。最後，手動註解和評估這些群組。開發這個資料集的目的是提供一個資源，用於評估多語言新聞群集演算法的效能，而這些演算法可用的資料集有限。它也可以用於從不同的觀點分析 2021 年東京奧運的動態和事件。這個資料集採用 CSV 格式，可以從 CLARIN.SI 儲存庫存取。</paragraph>", "author": "Erik Novak et.al.", "authors": "Erik Novak, Erik Calcina, Dunja Mladenić, Marko Grobelnik", "id": "2502.06648v1", "paper_url": "http://arxiv.org/abs/2502.06648v1", "repo": "null"}}