{"2501.16373": {"publish_time": "2025-01-23", "title": "Unveiling Discrete Clues: Superior Healthcare Predictions for Rare Diseases", "paper_summary": "Accurate healthcare prediction is essential for improving patient outcomes.\nExisting work primarily leverages advanced frameworks like attention or graph\nnetworks to capture the intricate collaborative (CO) signals in electronic\nhealth records. However, prediction for rare diseases remains challenging due\nto limited co-occurrence and inadequately tailored approaches. To address this\nissue, this paper proposes UDC, a novel method that unveils discrete clues to\nbridge consistent textual knowledge and CO signals within a unified semantic\nspace, thereby enriching the representation semantics of rare diseases.\nSpecifically, we focus on addressing two key sub-problems: (1) acquiring\ndistinguishable discrete encodings for precise disease representation and (2)\nachieving semantic alignment between textual knowledge and the CO signals at\nthe code level. For the first sub-problem, we refine the standard vector\nquantized process to include condition awareness. Additionally, we develop an\nadvanced contrastive approach in the decoding stage, leveraging synthetic and\nmixed-domain targets as hard negatives to enrich the perceptibility of the\nreconstructed representation for downstream tasks. For the second sub-problem,\nwe introduce a novel codebook update strategy using co-teacher distillation.\nThis approach facilitates bidirectional supervision between textual knowledge\nand CO signals, thereby aligning semantically equivalent information in a\nshared discrete latent space. Extensive experiments on three datasets\ndemonstrate our superiority.", "paper_summary_zh": "準確的醫療保健預測對於改善患者的治療結果至關重要。\n現有的工作主要利用注意力或圖形網路等先進的框架來捕捉電子健康記錄中複雜的協作 (CO) 信號。然而，由於共現有限和方法調整不足，罕見疾病的預測仍然具有挑戰性。為了解決這個問題，本文提出了 UDC，這是一種新的方法，它揭示了離散線索，以在統一的語義空間中橋接一致的文本知識和 CO 信號，從而豐富罕見疾病的表示語義。\n具體來說，我們專注於解決兩個關鍵的子問題：(1) 獲取可區分的離散編碼以進行精確的疾病表示，以及 (2) 在代碼層級上實現文本知識和 CO 信號之間的語義對齊。對於第一個子問題，我們改進了標準向量量化流程以包含條件感知。此外，我們在解碼階段開發了一種先進的對比方法，利用合成和混合域目標作為硬負例來豐富重建表示對下游任務的可感知性。對於第二個子問題，我們使用共同教師蒸餾引入了一種新的代碼簿更新策略。這種方法促進了文本知識和 CO 信號之間的雙向監督，從而在共享的離散潛在空間中對齊語義等價資訊。在三個資料集上的大量實驗證明了我們的優越性。", "author": "Chuang Zhao et.al.", "authors": "Chuang Zhao, Hui Tang, Jiheng Zhang, Xiaomeng Li", "id": "2501.16373v1", "paper_url": "http://arxiv.org/abs/2501.16373v1", "repo": "null"}}