{"2412.10826": {"publish_time": "2024-12-14", "title": "Generative AI: A Pix2pix-GAN-Based Machine Learning Approach for Robust and Efficient Lung Segmentation", "paper_summary": "Chest radiography is climacteric in identifying different pulmonary diseases,\nyet radiologist workload and inefficiency can lead to misdiagnoses. Automatic,\naccurate, and efficient segmentation of lung from X-ray images of chest is\nparamount for early disease detection. This study develops a deep learning\nframework using a Pix2pix Generative Adversarial Network (GAN) to segment\npulmonary abnormalities from CXR images. This framework's image preprocessing\nand augmentation techniques were properly incorporated with a U-Net-inspired\ngenerator-discriminator architecture. Initially, it loaded the CXR images and\nmanual masks from the Montgomery and Shenzhen datasets, after which\npreprocessing and resizing were performed. A U-Net generator is applied to the\nprocessed CXR images that yield segmented masks; then, a Discriminator Network\ndifferentiates between the generated and real masks. Montgomery dataset served\nas the model's training set in the study, and the Shenzhen dataset was used to\ntest its robustness, which was used here for the first time. An adversarial\nloss and an L1 distance were used to optimize the model in training. All\nmetrics, which assess precision, recall, F1 score, and Dice coefficient, prove\nthe effectiveness of this framework in pulmonary abnormality segmentation. It,\ntherefore, sets the basis for future studies to be performed shortly using\ndiverse datasets that could further confirm its clinical applicability in\nmedical imaging.", "paper_summary_zh": "胸部 X 光攝影在辨識不同的肺部疾病中具有決定性，然而放射科醫師的工作負擔和效率不彰可能會導致誤診。自動、準確且有效率地從胸部 X 光影像中分割出肺部，對於早期疾病偵測至關重要。本研究開發一個深度學習架構，使用 Pix2pix 生成對抗網路 (GAN) 從 CXR 影像中分割出肺部異常。此架構的影像前處理和擴充技術與一個受 U-Net 啟發的生成器-判別器架構適當地整合。最初，它載入 CXR 影像和 Montgomery 及深圳資料集的手動遮罩，之後執行前處理和調整大小。將 U-Net 生成器應用於已處理的 CXR 影像，產生分割遮罩；然後，判別器網路區分生成的遮罩和真實遮罩。Montgomery 資料集作為本研究模型的訓練集，而深圳資料集用於測試其穩健性，這是首次使用於此。對抗損失和 L1 距離用於在訓練中最佳化模型。所有評估精準度、召回率、F1 分數和 Dice 係數的指標都證明此架構在肺部異常分割中的有效性。因此，它為不久後使用更多元資料集進行的未來研究奠定基礎，這些研究進一步確認其在醫學影像中的臨床適用性。", "author": "Sharmin Akter et.al.", "authors": "Sharmin Akter", "id": "2412.10826v1", "paper_url": "http://arxiv.org/abs/2412.10826v1", "repo": "null"}}