{"2407.07042": {"publish_time": "2024-07-09", "title": "ProtoSAM: One-Shot Medical Image Segmentation With Foundational Models", "paper_summary": "This work introduces a new framework, ProtoSAM, for one-shot medical image\nsegmentation. It combines the use of prototypical networks, known for few-shot\nsegmentation, with SAM - a natural image foundation model. The method proposed\ncreates an initial coarse segmentation mask using the ALPnet prototypical\nnetwork, augmented with a DINOv2 encoder. Following the extraction of an\ninitial mask, prompts are extracted, such as points and bounding boxes, which\nare then input into the Segment Anything Model (SAM). State-of-the-art results\nare shown on several medical image datasets and demonstrate automated\nsegmentation capabilities using a single image example (one shot) with no need\nfor fine-tuning of the foundation model. Our code is available at:\nhttps://github.com/levayz/ProtoSAM", "paper_summary_zh": "本研究提出一個新的架構，ProtoSAM，用於一次性的醫療影像分割。它結合了原型網路的使用，以進行少次分割，以及 SAM - 一個自然影像基礎模型。所提出的方法使用 ALPnet 原型網路建立一個初始的粗略分割遮罩，並使用 DINOv2 編碼器進行擴充。在提取初始遮罩後，會提取提示，例如點和邊界框，然後輸入到 Segment Anything Model (SAM)。在多個醫療影像資料集上顯示了最先進的結果，並展示了使用單一影像範例（一次）進行自動化分割的能力，而無需對基礎模型進行微調。我們的程式碼可在以下位置取得：\nhttps://github.com/levayz/ProtoSAM", "author": "Lev Ayzenberg et.al.", "authors": "Lev Ayzenberg, Raja Giryes, Hayit Greenspan", "id": "2407.07042v2", "paper_url": "http://arxiv.org/abs/2407.07042v2", "repo": "https://github.com/levayz/protosam"}}