{"2409.11600": {"publish_time": "2024-09-17", "title": "No Saved Kaleidosope: an 100% Jitted Neural Network Coding Language with Pythonic Syntax", "paper_summary": "We developed a jitted compiler for training Artificial Neural Networks using\nC++, LLVM and Cuda. It features object-oriented characteristics, strong typing,\nparallel workers for data pre-processing, pythonic syntax for expressions,\nPyTorch like model declaration and Automatic Differentiation. We implement the\nmechanisms of cache and pooling in order to manage VRAM, cuBLAS for high\nperformance matrix multiplication and cuDNN for convolutional layers. Our\nexperiments with Residual Convolutional Neural Networks on ImageNet, we reach\nsimilar speed but degraded performance. Also, the GRU network experiments show\nsimilar accuracy, but our compiler have degraded speed in that task. However,\nour compiler demonstrates promising results at the CIFAR-10 benchmark, in which\nwe reach the same performance and about the same speed as PyTorch. We make the\ncode publicly available at: https://github.com/NoSavedDATA/NoSavedKaleidoscope", "paper_summary_zh": "我們開發了一個使用 C++、LLVM 和 Cuda 訓練人工神經網路的 jit 編譯器。它具有物件導向特性、強型別、平行工作執行緒以進行資料前處理、pythonic 語法來表示運算式、PyTorch 類型的模型宣告和自動微分。我們實作快取和池化的機制來管理 VRAM，使用 cuBLAS 進行高性能矩陣乘法，並使用 cuDNN 進行卷積層。我們在 ImageNet 上使用殘差卷積神經網路進行的實驗，達到了類似的速度，但效能下降。此外，GRU 網路實驗顯示出類似的準確度，但我們的編譯器在該任務中的速度下降。然而，我們的編譯器在 CIFAR-10 效能測試中表現出令人滿意的結果，其中我們達到了與 PyTorch 相同的效能和速度。我們在 https://github.com/NoSavedDATA/NoSavedKaleidoscope 公開程式碼。", "author": "Augusto Seben da Rosa et.al.", "authors": "Augusto Seben da Rosa, Marlon Daniel Angeli, Jorge Aikes Junior, Alef Iury Ferreira, Lucas Rafael Gris, Anderson da Silva Soares, Arnaldo Candido Junior, Frederico Santos de Oliveira, Gabriel Trevisan Damke, Rafael Teixeira Sousa", "id": "2409.11600v1", "paper_url": "http://arxiv.org/abs/2409.11600v1", "repo": "https://github.com/nosaveddata/nosavedkaleidoscope"}}