{"2409.03043": {"publish_time": "2024-09-04", "title": "Can Your Generative Model Detect Out-of-Distribution Covariate Shift?", "paper_summary": "Detecting Out-of-Distribution~(OOD) sensory data and covariate distribution\nshift aims to identify new test examples with different high-level image\nstatistics to the captured, normal and In-Distribution (ID) set. Existing OOD\ndetection literature largely focuses on semantic shift with little-to-no\nconsensus over covariate shift. Generative models capture the ID data in an\nunsupervised manner, enabling them to effectively identify samples that deviate\nsignificantly from this learned distribution, irrespective of the downstream\ntask. In this work, we elucidate the ability of generative models to detect and\nquantify domain-specific covariate shift through extensive analyses that\ninvolves a variety of models. To this end, we conjecture that it is sufficient\nto detect most occurring sensory faults (anomalies and deviations in global\nsignals statistics) by solely modeling high-frequency signal-dependent and\nindependent details. We propose a novel method, CovariateFlow, for OOD\ndetection, specifically tailored to covariate heteroscedastic high-frequency\nimage-components using conditional Normalizing Flows (cNFs). Our results on\nCIFAR10 vs. CIFAR10-C and ImageNet200 vs. ImageNet200-C demonstrate the\neffectiveness of the method by accurately detecting OOD covariate shift. This\nwork contributes to enhancing the fidelity of imaging systems and aiding\nmachine learning models in OOD detection in the presence of covariate shift.", "paper_summary_zh": "偵測非分佈~(OOD) 感測資料和協變數分佈轉移旨在識別具有不同高階影像統計資料的新測試範例，以擷取正常和分佈內 (ID) 集合。現有的 OOD 偵測文獻主要關注語意轉移，對協變數轉移幾乎沒有共識。生成模型以非監督式的方式擷取 ID 資料，使其能夠有效識別與此學習分佈顯著不同的樣本，與下游任務無關。在這項工作中，我們闡明了生成模型透過涉及各種模型的廣泛分析來偵測和量化特定領域的協變數轉移的能力。為此，我們推測僅建模高頻訊號依賴性和獨立性細節就足以偵測大多數發生的感測故障（全球訊號統計資料中的異常和偏差）。我們提出了一種新的方法，CovariateFlow，用於 OOD 偵測，特別針對使用條件正規化流 (cNF) 的協變數異質高頻影像組成。我們在 CIFAR10 與 CIFAR10-C 和 ImageNet200 與 ImageNet200-C 的結果證明了該方法的有效性，準確偵測 OOD 協變數轉移。這項工作有助於提升影像系統的保真度，並在協變數轉移的情況下協助機器學習模型進行 OOD 偵測。", "author": "Christiaan Viviers et.al.", "authors": "Christiaan Viviers, Amaan Valiuddin, Francisco Caetano, Lemar Abdi, Lena Filatova, Peter de With, Fons van der Sommen", "id": "2409.03043v1", "paper_url": "http://arxiv.org/abs/2409.03043v1", "repo": "https://github.com/cviviers/covariateflow"}}