{"2410.17799": {"publish_time": "2024-10-23", "title": "OmniFlatten: An End-to-end GPT Model for Seamless Voice Conversation", "paper_summary": "Full-duplex spoken dialogue systems significantly advance over traditional\nturn-based dialogue systems, as they allow simultaneous bidirectional\ncommunication, closely mirroring human-human interactions. However, achieving\nlow latency and natural interactions in full-duplex dialogue systems remains a\nsignificant challenge, especially considering human conversation dynamics such\nas interruptions, backchannels, and overlapping speech. In this paper, we\nintroduce a novel End-to-End GPT-based model OmniFlatten for full-duplex\nconversation, capable of effectively modeling the complex behaviors inherent to\nnatural conversations with low latency. To achieve full-duplex communication\ncapabilities, we propose a multi-stage post-training scheme that progressively\nadapts a text-based large language model (LLM) backbone into a speech-text\ndialogue LLM, capable of generating text and speech in real time, without\nmodifying the architecture of the backbone LLM. The training process comprises\nthree stages: modality alignment, half-duplex dialogue learning, and\nfull-duplex dialogue learning. Throughout all training stages, we standardize\nthe data using a flattening operation, which allows us to unify the training\nmethods and the model architecture across different modalities and tasks. Our\napproach offers a straightforward modeling technique and a promising research\ndirection for developing efficient and natural end-to-end full-duplex spoken\ndialogue systems. Audio samples of dialogues generated by OmniFlatten can be\nfound at this web site (https://omniflatten.github.io/).", "paper_summary_zh": "全雙工語音對話系統顯著優於傳統的回合制對話系統，因為它們允許同時雙向溝通，緊密反映人類與人類的互動。然而，在全雙工對話系統中實現低延遲和自然互動仍然是一個重大的挑戰，特別是考慮到人類對話動態，例如中斷、反向通道和重疊語音。在本文中，我們引入了一個新的端到端 GPT 模型 OmniFlatten，用於全雙工對話，能夠有效地模擬自然對話中固有的複雜行為，並具有低延遲。為了實現全雙工通信功能，我們提出了一個多階段後訓練方案，逐步將基於文本的大語言模型 (LLM) 主幹適應為語音轉文本對話 LLM，能夠實時生成文本和語音，而無需修改主幹 LLM 的架構。訓練過程包括三個階段：模態對齊、半雙工對話學習和全雙工對話學習。在所有訓練階段中，我們使用扁平化運算標準化數據，這使我們能夠統一不同模態和任務的訓練方法和模型架構。我們的做法提供了一種直接的建模技術和一個有前景的研究方向，用於開發高效且自然的端到端全雙工語音對話系統。可以在這個網站 (https://omniflatten.github.io/) 找到由 OmniFlatten 生成的對話音頻樣本。", "author": "Qinglin Zhang et.al.", "authors": "Qinglin Zhang, Luyao Cheng, Chong Deng, Qian Chen, Wen Wang, Siqi Zheng, Jiaqing Liu, Hai Yu, Chaohong Tan", "id": "2410.17799v1", "paper_url": "http://arxiv.org/abs/2410.17799v1", "repo": "null"}}