{"2408.10682": {"publish_time": "2024-08-20", "title": "Towards Robust Knowledge Unlearning: An Adversarial Framework for Assessing and Improving Unlearning Robustness in Large Language Models", "paper_summary": "LLM have achieved success in many fields but still troubled by problematic\ncontent in the training corpora. LLM unlearning aims at reducing their\ninfluence and avoid undesirable behaviours. However, existing unlearning\nmethods remain vulnerable to adversarial queries and the unlearned knowledge\nresurfaces after the manually designed attack queries. As part of a red-team\neffort to proactively assess the vulnerabilities of unlearned models, we design\nDynamic Unlearning Attack (DUA), a dynamic and automated framework to attack\nthese models and evaluate their robustness. It optimizes adversarial suffixes\nto reintroduce the unlearned knowledge in various scenarios. We find that\nunlearned knowledge can be recovered in $55.2\\%$ of the questions, even without\nrevealing the unlearned model's parameters. In response to this vulnerability,\nwe propose Latent Adversarial Unlearning (LAU), a universal framework that\neffectively enhances the robustness of the unlearned process. It formulates the\nunlearning process as a min-max optimization problem and resolves it through\ntwo stages: an attack stage, where perturbation vectors are trained and added\nto the latent space of LLMs to recover the unlearned knowledge, and a defense\nstage, where previously trained perturbation vectors are used to enhance\nunlearned model's robustness. With our LAU framework, we obtain two robust\nunlearning methods, AdvGA and AdvNPO. We conduct extensive experiments across\nmultiple unlearning benchmarks and various models, and demonstrate that they\nimprove the unlearning effectiveness by over $53.5\\%$, cause only less than a\n$11.6\\%$ reduction in neighboring knowledge, and have almost no impact on the\nmodel's general capabilities.", "paper_summary_zh": "<paragraph>LLM 已在許多領域取得成功，但仍受訓練語料庫中問題內容的困擾。LLM 的反學習旨在減少其影響並避免不良行為。然而，現有的反學習方法仍然容易受到對抗查詢的影響，並且在手動設計的攻擊查詢後，未學習的知識會再次浮現。作為紅隊努力主動評估未學習模型的漏洞的一部分，我們設計了動態反學習攻擊 (DUA)，一個動態且自動化的框架，用於攻擊這些模型並評估其健壯性。它優化對抗後綴，以便在各種場景中重新引入未學習的知識。我們發現，即使不透露未學習模型的參數，也可以在 55.2% 的問題中恢復未學習的知識。針對此漏洞，我們提出了潛在對抗反學習 (LAU)，這是一個有效增強未學習過程健壯性的通用框架。它將反學習過程表述為一個最小最大值優化問題，並通過兩個階段解決它：攻擊階段，其中擾動向量被訓練並添加到 LLM 的潛在空間中以恢復未學習的知識，以及防禦階段，其中先前訓練的擾動向量用於增強未學習模型的健壯性。使用我們的 LAU 框架，我們獲得了兩種強大的反學習方法，AdvGA 和 AdvNPO。我們在多個反學習基準和各種模型中進行了廣泛的實驗，並證明它們將反學習的有效性提高了 53.5% 以上，僅導致鄰近知識減少了不到 11.6%，並且對模型的整體能力幾乎沒有影響。</paragraph>", "author": "Hongbang Yuan et.al.", "authors": "Hongbang Yuan, Zhuoran Jin, Pengfei Cao, Yubo Chen, Kang Liu, Jun Zhao", "id": "2408.10682v1", "paper_url": "http://arxiv.org/abs/2408.10682v1", "repo": "null"}}