{"2412.10319": {"publish_time": "2024-12-13", "title": "SCBench: A KV Cache-Centric Analysis of Long-Context Methods", "paper_summary": "Long-context LLMs have enabled numerous downstream applications but also\nintroduced significant challenges related to computational and memory\nefficiency. To address these challenges, optimizations for long-context\ninference have been developed, centered around the KV cache. However, existing\nbenchmarks often evaluate in single-request, neglecting the full lifecycle of\nthe KV cache in real-world use. This oversight is particularly critical, as KV\ncache reuse has become widely adopted in LLMs inference frameworks, such as\nvLLM and SGLang, as well as by LLM providers, including OpenAI, Microsoft,\nGoogle, and Anthropic. To address this gap, we introduce\nSCBench(SharedContextBench), a comprehensive benchmark for evaluating\nlong-context methods from a KV cachecentric perspective: 1) KV cache\ngeneration, 2) KV cache compression, 3) KV cache retrieval, 4) KV cache\nloading. Specifically, SCBench uses test examples with shared context, ranging\n12 tasks with two shared context modes, covering four categories of\nlong-context capabilities: string retrieval, semantic retrieval, global\ninformation, and multi-task. With it, we provide an extensive KV cache-centric\nanalysis of eight categories long-context solutions, including Gated Linear\nRNNs, Mamba-Attention hybrids, and efficient methods such as sparse attention,\nKV cache dropping, quantization, retrieval, loading, and prompt compression.\nThe evaluation is conducted on 8 long-context LLMs. Our findings show that\nsub-O(n) memory methods suffer in multi-turn scenarios, while sparse encoding\nwith O(n) memory and sub-O(n^2) pre-filling computation perform robustly.\nDynamic sparsity yields more expressive KV caches than static patterns, and\nlayer-level sparsity in hybrid architectures reduces memory usage with strong\nperformance. Additionally, we identify attention distribution shift issues in\nlong-generation scenarios. https://aka.ms/SCBench.", "paper_summary_zh": "長語境 LLM 已啟用許多下游應用程式，但也引入了與運算和記憶體效率相關的重大挑戰。為了應對這些挑戰，已針對長語境推論開發最佳化，集中在 KV 快取上。然而，現有的基準測試通常在單一要求中進行評估，忽略了 KV 快取在實際使用中的完整生命週期。這種疏忽特別關鍵，因為 KV 快取重複使用已在 LLM 推論架構中廣泛採用，例如 vLLM 和 SGLang，以及 LLM 供應商，包括 OpenAI、Microsoft、Google 和 Anthropic。為了解決這個差距，我們引入了 SCBench（SharedContextBench），這是一個全面的基準測試，用 KV 快取為中心的觀點評估長語境方法：1) KV 快取產生，2) KV 快取壓縮，3) KV 快取擷取，4) KV 快取載入。具體來說，SCBench 使用具有共用語境的測試範例，範圍涵蓋兩種共用語境模式的 12 個任務，涵蓋長語境功能的四種類別：字串擷取、語意擷取、全域資訊和多任務。透過它，我們提供了對八種類別長語境解決方案的廣泛 KV 快取為中心分析，包括閘控線性 RNN、Mamba-Attention 混合體，以及稀疏注意力、KV 快取捨棄、量化、擷取、載入和提示壓縮等有效方法。評估是在 8 個長語境 LLM 上進行的。我們的研究結果顯示，sub-O(n) 記憶體方法在多輪情況下會受到影響，而具有 O(n) 記憶體和 sub-O(n^2) 預先填入運算的稀疏編碼則表現得很好。動態稀疏性產生比靜態模式更具表現力的 KV 快取，而混合架構中的層級稀疏性則以強勁的效能降低記憶體使用量。此外，我們在長生成情況中發現了注意力分佈轉移問題。https://aka.ms/SCBench。", "author": "Yucheng Li et.al.", "authors": "Yucheng Li, Huiqiang Jiang, Qianhui Wu, Xufang Luo, Surin Ahn, Chengruidong Zhang, Amir H. Abdi, Dongsheng Li, Jianfeng Gao, Yuqing Yang, Lili Qiu", "id": "2412.10319v1", "paper_url": "http://arxiv.org/abs/2412.10319v1", "repo": "null"}}