{"2408.15538": {"publish_time": "2024-08-28", "title": "TrafficGamer: Reliable and Flexible Traffic Simulation for Safety-Critical Scenarios with Game-Theoretic Oracles", "paper_summary": "While modern Autonomous Vehicle (AV) systems can develop reliable driving\npolicies under regular traffic conditions, they frequently struggle with\nsafety-critical traffic scenarios. This difficulty primarily arises from the\nrarity of such scenarios in driving datasets and the complexities associated\nwith predictive modeling among multiple vehicles. To support the testing and\nrefinement of AV policies, simulating safety-critical traffic events is an\nessential challenge to be addressed. In this work, we introduce TrafficGamer,\nwhich facilitates game-theoretic traffic simulation by viewing common road\ndriving as a multi-agent game. In evaluating the empirical performance across\nvarious real-world datasets, TrafficGamer ensures both fidelity and\nexploitability of the simulated scenarios, guaranteeing that they not only\nstatically align with real-world traffic distribution but also efficiently\ncapture equilibriums for representing safety-critical scenarios involving\nmultiple agents. Additionally, the results demonstrate that TrafficGamer\nexhibits highly flexible simulation across various contexts. Specifically, we\ndemonstrate that the generated scenarios can dynamically adapt to equilibriums\nof varying tightness by configuring risk-sensitive constraints during\noptimization. To the best of our knowledge, TrafficGamer is the first simulator\ncapable of generating diverse traffic scenarios involving multiple agents. We\nhave provided a demo webpage for the project at\nhttps://qiaoguanren.github.io/trafficgamer-demo/.", "paper_summary_zh": "儘管現代自動駕駛（AV）系統可以在一般交通狀況下發展出可靠的駕駛策略，但它們經常在安全關鍵的交通場景中掙扎。這種困難主要來自於此類場景在駕駛數據集中的稀少性，以及與多輛車輛之間的預測模型相關的複雜性。為了支援 AV 策略的測試和改進，模擬安全關鍵的交通事件是一個必須解決的基本挑戰。在這項工作中，我們引入了 TrafficGamer，它通過將常見的道路駕駛視為多主體遊戲，來促進博弈論交通模擬。在評估各種真實世界數據集中的經驗效能時，TrafficGamer 確保了模擬場景的保真度和可利用性，保證它們不僅在靜態上與真實世界的交通分佈保持一致，而且還能有效地捕捉涉及多個主體的安全關鍵場景的均衡。此外，結果表明，TrafficGamer 在各種背景下表現出高度靈活的模擬。具體來說，我們證明了生成的場景可以通過在最佳化過程中配置風險敏感約束來動態適應不同緊密度的均衡。據我們所知，TrafficGamer 是第一個能夠生成涉及多個主體的多樣化交通場景的模擬器。我們已經為這個專案提供了一個試用網頁，網址是 https://qiaoguanren.github.io/trafficgamer-demo/。", "author": "Guanren Qiao et.al.", "authors": "Guanren Qiao, Guorui Quan, Jiawei Yu, Shujun Jia, Guiliang Liu", "id": "2408.15538v1", "paper_url": "http://arxiv.org/abs/2408.15538v1", "repo": "https://github.com/qiaoguanren/TrafficGamer"}}