{"2406.06051": {"publish_time": "2024-06-10", "title": "On the Utility of Accounting for Human Beliefs about AI Behavior in Human-AI Collaboration", "paper_summary": "To enable effective human-AI collaboration, merely optimizing AI performance\nwhile ignoring humans is not sufficient. Recent research has demonstrated that\ndesigning AI agents to account for human behavior leads to improved performance\nin human-AI collaboration. However, a limitation of most existing approaches is\ntheir assumption that human behavior is static, irrespective of AI behavior. In\nreality, humans may adjust their action plans based on their observations of AI\nbehavior. In this paper, we address this limitation by enabling a collaborative\nAI agent to consider the beliefs of its human partner, i.e., what the human\npartner thinks the AI agent is doing, and design its action plan to facilitate\neasier collaboration with its human partner. Specifically, we developed a model\nof human beliefs that accounts for how humans reason about the behavior of\ntheir AI partners. Based on this belief model, we then developed an AI agent\nthat considers both human behavior and human beliefs in devising its strategy\nfor working with humans. Through extensive real-world human-subject\nexperiments, we demonstrated that our belief model more accurately predicts\nhumans' beliefs about AI behavior. Moreover, we showed that our design of AI\nagents that accounts for human beliefs enhances performance in human-AI\ncollaboration.", "paper_summary_zh": "<paragraph>要實現有效的人工智慧協作，僅優化人工智慧效能，而忽略人類是不夠的。最近的研究表明，設計人工智慧代理來考量人類行為，會提升人機協作的效能。然而，大多數現有方法的限制在於，它們假設人類行為是靜態的，與人工智慧行為無關。實際上，人類可能會根據他們對人工智慧行為的觀察來調整他們的行動計畫。在本文中，我們透過讓協作式人工智慧代理考慮其人類夥伴的信念（即人類夥伴認為人工智慧代理在做什麼）來解決這個限制，並設計其行動計畫以促進與其人類夥伴更輕鬆的協作。具體來說，我們開發了一個人類信念模型，說明人類如何推理其人工智慧夥伴的行為。基於這個信念模型，我們接著開發了一個人工智慧代理，在為與人類合作制定策略時，會考慮人類行為和人類信念。透過廣泛的真實世界人類受試者實驗，我們證明了我們的信念模型更準確地預測了人類對人工智慧行為的信念。此外，我們展示了我們考慮人類信念的人工智慧代理設計，增強了人機協作的效能。</paragraph>", "author": "Guanghui Yu et.al.", "authors": "Guanghui Yu, Robert Kasumba, Chien-Ju Ho, William Yeoh", "id": "2406.06051v1", "paper_url": "http://arxiv.org/abs/2406.06051v1", "repo": "null"}}