{"2412.10452": {"publish_time": "2024-12-12", "title": "Structurally Consistent MRI Colorization using Cross-modal Fusion Learning", "paper_summary": "Medical image colorization can greatly enhance the interpretability of the\nunderlying imaging modality and provide insights into human anatomy. The\nobjective of medical image colorization is to transfer a diverse spectrum of\ncolors distributed across human anatomy from Cryosection data to source MRI\ndata while retaining the structures of the MRI. To achieve this, we propose a\nnovel architecture for structurally consistent color transfer to the source MRI\ndata. Our architecture fuses segmentation semantics of Cryosection images for\nstable contextual colorization of various organs in MRI images. For\ncolorization, we neither require precise registration between MRI and\nCryosection images, nor segmentation of MRI images. Additionally, our\narchitecture incorporates a feature compression-and-activation mechanism to\ncapture organ-level global information and suppress noise, enabling the\ndistinction of organ-specific data in MRI scans for more accurate and realistic\norgan-specific colorization. Our experiments demonstrate that our architecture\nsurpasses the existing methods and yields better quantitative and qualitative\nresults.", "paper_summary_zh": "醫學影像著色能大幅提升基礎影像模式的可解讀性，並提供人類解剖學的見解。醫學影像著色的目標是將分布在人類解剖學中、來自冷凍切片資料的各種色彩光譜轉移到原始 MRI 資料，同時保留 MRI 的結構。為達成此目標，我們提出一個結構一致色彩轉移到原始 MRI 資料的新穎架構。我們的架構融合冷凍切片影像的分割語義，以穩定著色 MRI 影像中各種器官的色彩。在著色時，我們既不需要 MRI 與冷凍切片影像之間精確的配準，也不需要 MRI 影像的分割。此外，我們的架構納入一個特徵壓縮和啟動機制，以擷取器官層級的整體資訊並抑制雜訊，讓 MRI 掃描中器官特定資料的區別更精確且逼真，進而進行器官特定著色。我們的實驗證明，我們的架構優於現有方法，並產生更好的量化和質化結果。", "author": "Mayuri Mathur et.al.", "authors": "Mayuri Mathur, Anav Chaudhary, Saurabh Kumar Gupta, Ojaswa Sharma", "id": "2412.10452v1", "paper_url": "http://arxiv.org/abs/2412.10452v1", "repo": "null"}}