{"2406.07860": {"publish_time": "2024-06-12", "title": "BookSQL: A Large Scale Text-to-SQL Dataset for Accounting Domain", "paper_summary": "Several large-scale datasets (e.g., WikiSQL, Spider) for developing natural\nlanguage interfaces to databases have recently been proposed. These datasets\ncover a wide breadth of domains but fall short on some essential domains, such\nas finance and accounting. Given that accounting databases are used worldwide,\nparticularly by non-technical people, there is an imminent need to develop\nmodels that could help extract information from accounting databases via\nnatural language queries. In this resource paper, we aim to fill this gap by\nproposing a new large-scale Text-to-SQL dataset for the accounting and\nfinancial domain: BookSQL. The dataset consists of 100k natural language\nqueries-SQL pairs, and accounting databases of 1 million records. We experiment\nwith and analyze existing state-of-the-art models (including GPT-4) for the\nText-to-SQL task on BookSQL. We find significant performance gaps, thus\npointing towards developing more focused models for this domain.", "paper_summary_zh": "最近提出了幾個用於開發自然語言資料庫介面的大型資料集（例如 WikiSQL、Spider）。這些資料集涵蓋了廣泛的領域，但在某些基本領域（例如財務和會計）上有所不足。鑑於會計資料庫在全球範圍內使用，特別是非技術人員，因此迫切需要開發模型，以通過自然語言查詢從會計資料庫中提取資訊。在本文中，我們旨在通過提出一個新的會計和財務領域的大型 Text-to-SQL 資料集：BookSQL 來填補這一空白。該資料集包含 100k 自然語言查詢-SQL 對，以及 100 萬條記錄的會計資料庫。我們對 Text-to-SQL 任務的 BookSQL 進行了現有最先進模型（包括 GPT-4）的實驗和分析。我們發現了顯著的效能差距，因此指出需要為此領域開發更專注的模型。", "author": "Rahul Kumar et.al.", "authors": "Rahul Kumar, Amar Raja Dibbu, Shrutendra Harsola, Vignesh Subrahmaniam, Ashutosh Modi", "id": "2406.07860v1", "paper_url": "http://arxiv.org/abs/2406.07860v1", "repo": "https://github.com/exploration-lab/booksql"}}