{"2502.09224": {"publish_time": "2025-02-13", "title": "Order-Sorted Intensional Logic: Expressing Subtyping Polymorphism with Typing Assertions and Quantification over Concepts", "paper_summary": "Subtyping, also known as subtype polymorphism, is a concept extensively\nstudied in programming language theory, delineating the substitutability\nrelation among datatypes. This property ensures that programs designed for\nsupertype objects remain compatible with their subtypes.\n  In this paper, we explore the capability of order-sorted logic for utilizing\nthese ideas in the context of Knowledge Representation. We recognize two\nfundamental limitations: First, the inability of this logic to address the\nconcept rather than the value of non-logical symbols, and second, the lack of\nlanguage constructs for constraining the type of terms. Consequently, we\npropose guarded order-sorted intensional logic, where guards are language\nconstructs for annotating typing information and intensional logic provides\nsupport for quantification over concepts.", "paper_summary_zh": "子類型化，也稱為子類型多態性，是一個在程式語言理論中廣泛研究的概念，用於描述資料類型之間的可替換關係。此特性可確保為超類型物件設計的程式與其子類型相容。\n在本文中，我們探討了使用排序邏輯在知識表徵中運用這些想法的能力。我們發現了兩個基本限制：首先，此邏輯無法處理非邏輯符號的概念而非值，其次，缺乏約束項類型的語言結構。因此，我們提出了受保護的排序邏輯，其中保護是註解類型資訊的語言結構，而內涵邏輯則支援對概念量化。", "author": "Đorđe Marković et.al.", "authors": "Đorđe Marković, Marc Denecker", "id": "2502.09224v1", "paper_url": "http://arxiv.org/abs/2502.09224v1", "repo": "null"}}