{"2412.11937": {"publish_time": "2024-12-16", "title": "Precise Length Control in Large Language Models", "paper_summary": "Large Language Models (LLMs) are increasingly used in production systems,\npowering applications such as chatbots, summarization, and question answering.\nDespite their success, controlling the length of their response remains a\nsignificant challenge, particularly for tasks requiring structured outputs or\nspecific levels of detail. In this work, we propose a method to adapt\npre-trained decoder-only LLMs for precise control of response length. Our\napproach incorporates a secondary length-difference positional encoding (LDPE)\ninto the input embeddings, which counts down to a user-set response termination\nlength. Fine-tuning with LDPE allows the model to learn to terminate responses\ncoherently at the desired length, achieving mean token errors of less than 3\ntokens. We also introduce Max New Tokens++, an extension that enables flexible\nupper-bound length control, rather than an exact target. Experimental results\non tasks such as question answering and document summarization demonstrate that\nour method enables precise length control without compromising response\nquality.", "paper_summary_zh": "大型語言模型 (LLM)  zunehmend in Produktionssystemen eingesetzt werden, die Anwendungen wie Chatbots, Zusammenfassungen und Fragen und Antworten unterstützen. Trotz ihres Erfolgs bleibt die Steuerung der Länge ihrer Antwort eine große Herausforderung, insbesondere für Aufgaben, die strukturierte Ausgaben oder bestimmte Detailstufen erfordern. In dieser Arbeit schlagen wir eine Methode vor, vortrainierte Decoder-only-LLMs für eine präzise Steuerung der Antwortlänge anzupassen. Unser Ansatz integriert eine sekundäre Positionskodierung der Längenunterschiede (LDPE) in die Eingabeembeddings, die bis zu einer vom Benutzer festgelegten Länge der Beendigung der Antwort herunterzählt. Die Feinabstimmung mit LDPE ermöglicht es dem Modell, zu lernen, Antworten zusammenhängend in der gewünschten Länge zu beenden und mittlere Tokenfehler von weniger als 3 Token zu erzielen. Wir stellen außerdem Max New Tokens++ vor, eine Erweiterung, die eine flexible Steuerung der Obergrenze der Länge ermöglicht, anstatt ein genaues Ziel. Experimentelle Ergebnisse zu Aufgaben wie Fragen und Antworten und Dokumentzusammenfassung zeigen, dass unsere Methode eine präzise Längenkontrolle ermöglicht, ohne die Qualität der Antwort zu beeinträchtigen.", "author": "Bradley Butcher et.al.", "authors": "Bradley Butcher, Michael O'Keefe, James Titchener", "id": "2412.11937v1", "paper_url": "http://arxiv.org/abs/2412.11937v1", "repo": "null"}}