{"2404.07815": {"publish_time": "2024-04-11", "title": "Post-Hoc Reversal: Are We Selecting Models Prematurely?", "paper_summary": "Trained models are often composed with post-hoc transforms such as\ntemperature scaling (TS), ensembling and stochastic weight averaging (SWA) to\nimprove performance, robustness, uncertainty estimation, etc. However, such\ntransforms are typically applied only after the base models have already been\nfinalized by standard means. In this paper, we challenge this practice with an\nextensive empirical study. In particular, we demonstrate a phenomenon that we\ncall post-hoc reversal, where performance trends are reversed after applying\nthese post-hoc transforms. This phenomenon is especially prominent in\nhigh-noise settings. For example, while base models overfit badly early in\ntraining, both conventional ensembling and SWA favor base models trained for\nmore epochs. Post-hoc reversal can also suppress the appearance of double\ndescent and mitigate mismatches between test loss and test error seen in base\nmodels. Based on our findings, we propose post-hoc selection, a simple\ntechnique whereby post-hoc metrics inform model development decisions such as\nearly stopping, checkpointing, and broader hyperparameter choices. Our\nexperimental analyses span real-world vision, language, tabular and graph\ndatasets from domains like satellite imaging, language modeling, census\nprediction and social network analysis. On an LLM instruction tuning dataset,\npost-hoc selection results in > 1.5x MMLU improvement compared to naive\nselection. Code is available at\nhttps://github.com/rishabh-ranjan/post-hoc-reversal.", "paper_summary_zh": "训练后的模型通常由事后转换（例如温度缩放 (TS)、集成和随机权重平均 (SWA)）组成，以提高性能、鲁棒性、不确定性估计等。然而，此类转换通常仅在基础模型已通过标准方式最终确定后才应用。在本文中，我们通过一项广泛的实证研究对这种做法提出了质疑。特别是，我们展示了一种我们称之为事后逆转的现象，其中在应用这些事后转换后，性能趋势会发生逆转。这种现象在高噪声设置中尤为突出。例如，虽然基础模型在训练早期严重过拟合，但传统的集成和 SWA 都偏爱训练更多个 epoch 的基础模型。事后逆转还可以抑制双重下降的出现，并减轻基础模型中看到的测试损失和测试误差之间的不匹配。根据我们的发现，我们提出了事后选择，这是一种简单的技术，其中事后指标为模型开发决策提供信息，例如提前停止、检查点和更广泛的超参数选择。我们的实验分析涵盖了来自卫星成像、语言建模、人口普查预测和社交网络分析等领域的真实世界视觉、语言、表格和图形数据集。在 LLM 指令调整数据集上，与朴素选择相比，事后选择导致 MMLU 提升 > 1.5 倍。代码可在 https://github.com/rishabh-ranjan/post-hoc-reversal 获得。", "author": "Rishabh Ranjan et.al.", "authors": "Rishabh Ranjan, Saurabh Garg, Mrigank Raman, Carlos Guestrin, Zachary Chase Lipton", "id": "2404.07815v1", "paper_url": "http://arxiv.org/abs/2404.07815v1", "repo": "https://github.com/rishabh-ranjan/post-hoc-reversal"}}