{"2406.12641": {"publish_time": "2024-06-18", "title": "DetectBench: Can Large Language Model Detect and Piece Together Implicit Evidence?", "paper_summary": "Detecting evidence within the context is a key step in the process of\nreasoning task. Evaluating and enhancing the capabilities of LLMs in evidence\ndetection will strengthen context-based reasoning performance. This paper\nproposes a benchmark called DetectBench for verifying the ability to detect and\npiece together implicit evidence within a long context. DetectBench contains\n3,928 multiple-choice questions, with an average of 994 tokens per question.\nEach question contains an average of 4.55 pieces of implicit evidence, and\nsolving the problem typically requires 7.62 logical jumps to find the correct\nanswer. To enhance the performance of LLMs in evidence detection, this paper\nproposes Detective Reasoning Prompt and Finetune. Experiments demonstrate that\nthe existing LLMs' abilities to detect evidence in long contexts are far\ninferior to humans. However, the Detective Reasoning Prompt effectively\nenhances the capability of powerful LLMs in evidence detection, while the\nFinetuning method shows significant effects in enhancing the performance of\nweaker LLMs. Moreover, when the abilities of LLMs in evidence detection are\nimproved, their final reasoning performance is also enhanced accordingly.", "paper_summary_zh": "在推理任务中，在语境中检测证据是关键的一步。评估和增强 LLM 在证据检测中的能力将强化基于语境的推理性能。本文提出了一个名为 DetectBench 的基准，用于验证在长语境中检测和拼凑隐式证据的能力。DetectBench 包含 3,928 个多项选择题，每个问题平均有 994 个标记。每个问题平均包含 4.55 个隐式证据，解决问题通常需要 7.62 个逻辑跳跃才能找到正确答案。为了增强 LLM 在证据检测中的性能，本文提出了侦探推理提示和微调。实验表明，现有 LLM 在长语境中检测证据的能力远逊于人类。然而，侦探推理提示有效地增强了强大的 LLM 在证据检测中的能力，而微调方法在增强较弱 LLM 的性能方面显示出显着效果。此外，当 LLM 在证据检测中的能力得到提高时，其最终推理性能也会相应提高。", "author": "Zhouhong Gu et.al.", "authors": "Zhouhong Gu, Lin Zhang, Xiaoxuan Zhu, Jiangjie Chen, Wenhao Huang, Yikai Zhang, Shusen Wang, Zheyu Ye, Yan Gao, Hongwei Feng, Yanghua Xiao", "id": "2406.12641v1", "paper_url": "http://arxiv.org/abs/2406.12641v1", "repo": "null"}}