{"2411.17058": {"publish_time": "2024-11-26", "title": "ThreatModeling-LLM: Automating Threat Modeling using Large Language Models for Banking System", "paper_summary": "Threat modeling is a crucial component of cybersecurity, particularly for\nindustries such as banking, where the security of financial data is paramount.\nTraditional threat modeling approaches require expert intervention and manual\neffort, often leading to inefficiencies and human error. The advent of Large\nLanguage Models (LLMs) offers a promising avenue for automating these\nprocesses, enhancing both efficiency and efficacy. However, this transition is\nnot straightforward due to three main challenges: (1) the lack of publicly\navailable, domain-specific datasets, (2) the need for tailored models to handle\ncomplex banking system architectures, and (3) the requirement for real-time,\nadaptive mitigation strategies that align with compliance standards like NIST\n800-53.\n  In this paper, we introduce ThreatModeling-LLM, a novel and adaptable\nframework that automates threat modeling for banking systems using LLMs.\nThreatModeling-LLM operates in three stages: 1) dataset creation, 2) prompt\nengineering and 3) model fine-tuning. We first generate a benchmark dataset\nusing Microsoft Threat Modeling Tool (TMT). Then, we apply Chain of Thought\n(CoT) and Optimization by PROmpting (OPRO) on the pre-trained LLMs to optimize\nthe initial prompt. Lastly, we fine-tune the LLM using Low-Rank Adaptation\n(LoRA) based on the benchmark dataset and the optimized prompt to improve the\nthreat identification and mitigation generation capabilities of pre-trained\nLLMs.", "paper_summary_zh": "威脅建模是網路安全中至關重要的部分，特別是對金融數據安全至上的銀行業等產業。傳統的威脅建模方法需要專家介入和手動操作，這通常會導致低效率和人為錯誤。大型語言模型 (LLM) 的出現為自動化這些流程提供了有前景的途徑，既能提高效率又能提高效能。然而，由於以下三個主要挑戰，這種轉型並不容易：(1) 缺乏公開可用的特定領域資料集，(2) 需要量身打造的模型來處理複雜的銀行系統架構，以及 (3) 需要與 NIST 800-53 等合規標準相符的即時適應性緩解策略。在這篇論文中，我們介紹了 ThreatModeling-LLM，這是一個新穎且適應性強的架構，它使用 LLM 自動化銀行系統的威脅建模。ThreatModeling-LLM 分三個階段運作：1) 資料集建立，2) 提示工程，以及 3) 模型微調。我們首先使用 Microsoft 威脅建模工具 (TMT) 產生一個基準資料集。然後，我們在預先訓練好的 LLM 上應用思考鏈 (CoT) 和提示最佳化 (OPRO) 來最佳化初始提示。最後，我們根據基準資料集和最佳化提示，使用低秩適應 (LoRA) 微調 LLM，以改善預先訓練好的 LLM 的威脅識別和緩解產生能力。", "author": "Shuiqiao Yang et.al.", "authors": "Shuiqiao Yang, Tingmin Wu, Shigang Liu, David Nguyen, Seung Jang, Alsharif Abuadbba", "id": "2411.17058v1", "paper_url": "http://arxiv.org/abs/2411.17058v1", "repo": "null"}}