{"2406.08173": {"publish_time": "2024-06-12", "title": "Semi-Supervised Spoken Language Glossification", "paper_summary": "Spoken language glossification (SLG) aims to translate the spoken language\ntext into the sign language gloss, i.e., a written record of sign language. In\nthis work, we present a framework named $S$emi-$S$upervised $S$poken $L$anguage\n$G$lossification ($S^3$LG) for SLG. To tackle the bottleneck of limited\nparallel data in SLG, our $S^3$LG incorporates large-scale monolingual spoken\nlanguage text into SLG training. The proposed framework follows the\nself-training structure that iteratively annotates and learns from pseudo\nlabels. Considering the lexical similarity and syntactic difference between\nsign language and spoken language, our $S^3$LG adopts both the rule-based\nheuristic and model-based approach for auto-annotation. During training, we\nrandomly mix these complementary synthetic datasets and mark their differences\nwith a special token. As the synthetic data may be less quality, the $S^3$LG\nfurther leverages consistency regularization to reduce the negative impact of\nnoise in the synthetic data. Extensive experiments are conducted on public\nbenchmarks to demonstrate the effectiveness of the $S^3$LG. Our code is\navailable at \\url{https://github.com/yaohj11/S3LG}.", "paper_summary_zh": "口語化標記 (SLG) 旨在將口語文本翻譯成手語標記，即手語的書面記錄。在這項工作中，我們提出了一個名為 $S$emi-$S$upervised $S$poken $L$anguage $G$lossification ($S^3$LG) 的 SLG 框架。為了解決 SLG 中並行數據有限的瓶頸，我們的 $S^3$LG 將大規模單語口語文本納入 SLG 訓練中。所提出的框架遵循自訓練結構，反覆標記並從偽標籤中學習。考慮到手語和口語之間的詞彙相似性和句法差異，我們的 $S^3$LG 採用基於規則的啟發式方法和基於模型的方法進行自動標記。在訓練期間，我們隨機混合這些互補的合成數據集，並用特殊令牌標記它們的差異。由於合成數據的品質可能較差，因此 $S^3$LG 進一步利用一致性正則化來減少合成數據中雜訊的負面影響。在公共基準上進行了廣泛的實驗，以證明 $S^3$LG 的有效性。我們的程式碼可在 \\url{https://github.com/yaohj11/S3LG} 取得。", "author": "Huijie Yao et.al.", "authors": "Huijie Yao, Wengang Zhou, Hao Zhou, Houqiang Li", "id": "2406.08173v1", "paper_url": "http://arxiv.org/abs/2406.08173v1", "repo": "https://github.com/yaohj11/s3lg"}}