{"2408.01852": {"publish_time": "2024-08-03", "title": "Sólo Escúchame: Spanish Emotional Accompaniment Chatbot", "paper_summary": "According to the World Health Organization (WHO), suicide was the fourth\nleading cause of death in the world for individuals aged 15 to 29 in 2019.\nGiven the rapid increase in mental health issues, providing psychological\nsupport is both crucial and urgent. In this paper: (1) we propose S\\'olo\nEsc\\'uchame, the first open-source Spanish emotional assistance chatbot, based\non LLaMA-2-7b-Chat. (2) We introduced the HEAR (Hispanic Emotional\nAccompaniment Responses) dataset, compiled from multiple English sources\ntranslated into Spanish, as well as generic data generated using\nChatGPT-3.5-Turbo. Finally, (3) we propose an evaluation metric based on two\nsemi-automatic assessment methods. Our system outperforms a range of\nstate-of-the-art models in providing psychological assistance in Spanish. Our\nmodels and datasets are publicly available to facilitate reproducibility.", "paper_summary_zh": "根據世界衛生組織（WHO）的統計，2019 年自殺是全球 15 至 29 歲人士的第四大死因。\n鑑於心理健康問題快速增加，提供心理支持既重要又迫切。在本文中：(1) 我們提出 S\\'olo Esc\\'uchame，這是第一個基於 LLaMA-2-7b-Chat 的開源式西班牙語情緒協助聊天機器人。(2) 我們引入了 HEAR（西班牙裔情緒陪伴回應）資料集，該資料集由多個翻譯成西班牙語的英文來源編譯而成，以及使用 ChatGPT-3.5-Turbo 生成的通用資料。最後，(3) 我們提出一個基於兩種半自動評估方法的評估指標。我們的系統在提供西班牙語心理協助方面優於一系列最先進的模型。我們的模型和資料集公開提供，以利於重現性。", "author": "Bruno Gil Ramírez et.al.", "authors": "Bruno Gil Ramírez, Jessica López Espejel, María del Carmen Santiago Díaz, Gustavo Trinidad Rubín Linares", "id": "2408.01852v1", "paper_url": "http://arxiv.org/abs/2408.01852v1", "repo": "null"}}