{"2407.20189": {"publish_time": "2024-07-29", "title": "Aligning Query Representation with Rewritten Query and Relevance Judgments in Conversational Search", "paper_summary": "Conversational search supports multi-turn user-system interactions to solve\ncomplex information needs. Different from the traditional single-turn ad-hoc\nsearch, conversational search encounters a more challenging problem of\ncontext-dependent query understanding with the lengthy and long-tail\nconversational history context. While conversational query rewriting methods\nleverage explicit rewritten queries to train a rewriting model to transform the\ncontext-dependent query into a stand-stone search query, this is usually done\nwithout considering the quality of search results. Conversational dense\nretrieval methods use fine-tuning to improve a pre-trained ad-hoc query\nencoder, but they are limited by the conversational search data available for\ntraining. In this paper, we leverage both rewritten queries and relevance\njudgments in the conversational search data to train a better query\nrepresentation model. The key idea is to align the query representation with\nthose of rewritten queries and relevant documents. The proposed model -- Query\nRepresentation Alignment Conversational Dense Retriever, QRACDR, is tested on\neight datasets, including various settings in conversational search and ad-hoc\nsearch. The results demonstrate the strong performance of QRACDR compared with\nstate-of-the-art methods, and confirm the effectiveness of representation\nalignment.", "paper_summary_zh": "對話式搜尋支援多輪使用者系統互動，以解決複雜的資訊需求。與傳統的單輪即席搜尋不同，對話式搜尋會遇到一個更具挑戰性的問題，即在冗長且長尾的對話式歷程記錄中，依據脈絡來理解查詢。儘管對話式查詢改寫方法利用明確改寫的查詢，來訓練一個改寫模型，將依據脈絡的查詢轉換為一個獨立的搜尋查詢，但這通常並未考慮搜尋結果的品質。對話式稠密檢索方法使用微調來改善預先訓練的即席查詢編碼器，但它們受到可用於訓練的對話式搜尋資料限制。在本文中，我們利用對話式搜尋資料中的改寫查詢和相關性判斷，來訓練一個更好的查詢表示模型。其關鍵構想是將查詢表示與改寫查詢和相關文件對齊。建議的模型——查詢表示對齊對話式稠密檢索器 QRACDR，在八個資料集上進行測試，包括對話式搜尋和即席搜尋的各種設定。結果顯示 QRACDR 的效能優於現有技術，並確認表示對齊的有效性。", "author": "Fengran Mo et.al.", "authors": "Fengran Mo, Chen Qu, Kelong Mao, Yihong Wu, Zhan Su, Kaiyu Huang, Jian-Yun Nie", "id": "2407.20189v1", "paper_url": "http://arxiv.org/abs/2407.20189v1", "repo": "null"}}