{"2407.06762": {"publish_time": "2024-07-09", "title": "Explicit Modelling of Theory of Mind for Belief Prediction in Nonverbal Social Interactions", "paper_summary": "We propose MToMnet - a Theory of Mind (ToM) neural network for predicting\nbeliefs and their dynamics during human social interactions from multimodal\ninput. ToM is key for effective nonverbal human communication and\ncollaboration, yet, existing methods for belief modelling have not included\nexplicit ToM modelling or have typically been limited to one or two modalities.\nMToMnet encodes contextual cues (scene videos and object locations) and\nintegrates them with person-specific cues (human gaze and body language) in a\nseparate MindNet for each person. Inspired by prior research on social\ncognition and computational ToM, we propose three different MToMnet variants:\ntwo involving fusion of latent representations and one involving re-ranking of\nclassification scores. We evaluate our approach on two challenging real-world\ndatasets, one focusing on belief prediction, while the other examining belief\ndynamics prediction. Our results demonstrate that MToMnet surpasses existing\nmethods by a large margin while at the same time requiring a significantly\nsmaller number of parameters. Taken together, our method opens up a highly\npromising direction for future work on artificial intelligent systems that can\nrobustly predict human beliefs from their non-verbal behaviour and, as such,\nmore effectively collaborate with humans.", "paper_summary_zh": "我們提出 MToMnet - 一種心智理論 (ToM) 神經網路，用於根據多模式輸入預測人類社會互動期間的信念及其動態。ToM 是有效的人類非語言溝通和協作的關鍵，然而，現有的信念建模方法尚未包含明確的 ToM 建模，或者通常僅限於一或兩種模式。MToMnet 對背景線索（場景影片和物件位置）進行編碼，並將其與特定於個人的線索（人類注視和肢體語言）整合到每個人物的獨立 MindNet 中。受到先前關於社會認知和計算 ToM 的研究啟發，我們提出了三種不同的 MToMnet 變體：兩種涉及潛在表徵的融合，一種涉及分類分數的重新排名。我們在兩個具有挑戰性的真實世界資料集上評估我們的做法，一個專注於信念預測，而另一個則檢驗信念動態預測。我們的結果表明，MToMnet 在很大程度上超越了現有方法，同時需要顯著更少數量的參數。綜上所述，我們的做法為未來的人工智慧系統的工作開啟了一個極具前景的方向，這些系統可以根據人類的非語言行為穩健地預測人類信念，因此可以更有效地與人類合作。", "author": "Matteo Bortoletto et.al.", "authors": "Matteo Bortoletto, Constantin Ruhdorfer, Lei Shi, Andreas Bulling", "id": "2407.06762v1", "paper_url": "http://arxiv.org/abs/2407.06762v1", "repo": "null"}}