{"2409.05033": {"publish_time": "2024-09-08", "title": "A Survey on Diffusion Models for Recommender Systems", "paper_summary": "While traditional recommendation techniques have made significant strides in\nthe past decades, they still suffer from limited generalization performance\ncaused by factors like inadequate collaborative signals, weak latent\nrepresentations, and noisy data. In response, diffusion models (DMs) have\nemerged as promising solutions for recommender systems due to their robust\ngenerative capabilities, solid theoretical foundations, and improved training\nstability. To this end, in this paper, we present the first comprehensive\nsurvey on diffusion models for recommendation, and draw a bird's-eye view from\nthe perspective of the whole pipeline in real-world recommender systems. We\nsystematically categorize existing research works into three primary domains:\n(1) diffusion for data engineering & encoding, focusing on data augmentation\nand representation enhancement; (2) diffusion as recommender models, employing\ndiffusion models to directly estimate user preferences and rank items; and (3)\ndiffusion for content presentation, utilizing diffusion models to generate\npersonalized content such as fashion and advertisement creatives. Our taxonomy\nhighlights the unique strengths of diffusion models in capturing complex data\ndistributions and generating high-quality, diverse samples that closely align\nwith user preferences. We also summarize the core characteristics of the\nadapting diffusion models for recommendation, and further identify key areas\nfor future exploration, which helps establish a roadmap for researchers and\npractitioners seeking to advance recommender systems through the innovative\napplication of diffusion models. To further facilitate the research community\nof recommender systems based on diffusion models, we actively maintain a GitHub\nrepository for papers and other related resources in this rising direction\nhttps://github.com/CHIANGEL/Awesome-Diffusion-for-RecSys.", "paper_summary_zh": "<paragraph>儘管傳統的推薦技術在過去的幾十年中取得了顯著進展，但它們仍然因為諸如協作訊號不足、潛在表徵薄弱和資料雜訊等因素而導致概化效能受限。有鑑於此，擴散模型 (DM) 由於其強大的生成能力、穩固的理論基礎和改善的訓練穩定性，已成為推薦系統中極具前景的解決方案。為此，在本文中，我們提出了針對推薦系統的擴散模型的第一份全面調查，並從真實世界推薦系統中整個管線的角度描繪出全景。我們系統性地將現有的研究工作分類為三個主要領域：(1) 擴散用於資料工程和編碼，專注於資料擴充和表徵增強；(2) 擴散作為推薦模型，採用擴散模型直接估計使用者偏好和排名項目；以及 (3) 擴散用於內容呈現，利用擴散模型生成個人化內容，例如時尚和廣告創意。我們的分類法突顯了擴散模型在捕捉複雜資料分佈和生成與使用者偏好緊密對齊的高品質、多樣性樣本方面的獨特優勢。我們也總結了適應推薦系統的擴散模型的核心特徵，並進一步找出未來探索的關鍵領域，這有助於為尋求透過擴散模型的創新應用來推進推薦系統的研究人員和從業人員建立一個路線圖。為了進一步促進基於擴散模型的推薦系統研究社群，我們積極維護一個 GitHub 存放庫，用於收集此一新興領域的論文和其他相關資源 https://github.com/CHIANGEL/Awesome-Diffusion-for-RecSys。</paragraph>", "author": "Jianghao Lin et.al.", "authors": "Jianghao Lin, Jiaqi Liu, Jiachen Zhu, Yunjia Xi, Chengkai Liu, Yangtian Zhang, Yong Yu, Weinan Zhang", "id": "2409.05033v1", "paper_url": "http://arxiv.org/abs/2409.05033v1", "repo": "null"}}