{"2308.02534": {"publish_time": "2023-08-01", "title": "Exploring the Role of Explainability in AI-Assisted Embryo Selection", "paper_summary": "In Vitro Fertilization is among the most widespread treatments for\ninfertility. One of its main challenges is the evaluation and selection of\nembryo for implantation, a process with large inter- and intra-clinician\nvariability. Deep learning based methods are gaining attention, but their\nopaque nature compromises their acceptance in the clinical context, where\ntransparency in the decision making is key. In this paper we analyze the\ncurrent work in the explainability of AI-assisted embryo analysis models,\nidentifying the limitations. We also discuss how these models could be\nintegrated in the clinical context as decision support systems, considering the\nneeds of clinicians and patients. Finally, we propose guidelines for the sake\nof increasing interpretability and trustworthiness, pushing this technology\nforward towards established clinical practice.", "paper_summary_zh": "體外受精是治療不孕症最廣泛的方法之一。其主要挑戰之一是評估和選擇胚胎進行植入，此過程具有很大的臨床間和臨床內變異性。基於深度學習的方法正受到關注，但其不透明的性質會影響其在臨床環境中的接受度，而透明度在決策制定中至關重要。在本文中，我們分析了 AI 輔助胚胎分析模型的可解釋性方面的現有工作，並找出其局限性。我們還討論了如何將這些模型作為決策支持系統整合到臨床環境中，同時考慮臨床醫生和患者的需求。最後，我們提出了提高可解釋性和可信度的準則，推進這項技術朝著既定的臨床實務邁進。", "author": "Lucia Urcelay et.al.", "authors": "Lucia Urcelay, Daniel Hinjos, Pablo A. Martin-Torres, Marta Gonzalez, Marta Mendez, Salva Cívico, Sergio Álvarez-Napagao, Dario Garcia-Gasulla", "id": "2308.02534v1", "paper_url": "http://arxiv.org/abs/2308.02534v1", "repo": "null"}}