{"2501.03040": {"publish_time": "2025-01-06", "title": "ChronoSense: Exploring Temporal Understanding in Large Language Models with Time Intervals of Events", "paper_summary": "Large Language Models (LLMs) have achieved remarkable success in various NLP\ntasks, yet they still face significant challenges in reasoning and arithmetic.\nTemporal reasoning, a critical component of natural language understanding, has\nraised increasing research attention. However, comprehensive testing of Allen's\ninterval relations (e.g., before, after, during) -- a fundamental framework for\ntemporal relationships -- remains underexplored. To fill this gap, we present\nChronoSense, a new benchmark for evaluating LLMs' temporal understanding. It\nincludes 16 tasks, focusing on identifying the Allen relation between two\ntemporal events and temporal arithmetic, using both abstract events and\nreal-world data from Wikidata. We assess the performance of seven recent LLMs\nusing this benchmark and the results indicate that models handle Allen\nrelations, even symmetrical ones, quite differently. Moreover, the findings\nsuggest that the models may rely on memorization to answer time-related\nquestions. Overall, the models' low performance highlights the need for\nimproved temporal understanding in LLMs and ChronoSense offers a robust\nframework for future research in this area. Our dataset and the source code are\navailable at https://github.com/duyguislakoglu/chronosense.", "paper_summary_zh": "大型語言模型 (LLM) 在各種自然語言處理 (NLP) 任務中取得了顯著的成功，但它們在推理和算術方面仍然面臨著重大的挑戰。\n時間推理是自然語言理解的關鍵組成部分，引起了越來越多的研究關注。然而，艾倫的區間關係（例如，之前、之後、期間）的全面測試——時間關係的基本框架——仍然未得到充分探索。為了填補這一空白，我們提出了 ChronoSense，這是一個用於評估 LLM 時間理解的新基準。它包括 16 項任務，重點是識別兩個時間事件之間的艾倫關係和時間算術，同時使用抽象事件和來自 Wikidata 的真實世界數據。我們使用此基準評估了七個最近的 LLM 的性能，結果表明模型處理艾倫關係（甚至是對稱關係）的方式截然不同。此外，研究結果表明，這些模型可能依賴於記憶來回答與時間相關的問題。總的來說，模型的低性能突顯了需要改進 LLM 中的時間理解，而 ChronoSense 為這一領域的未來研究提供了一個穩健的框架。我們的數據集和源代碼可以在 https://github.com/duyguislakoglu/chronosense 獲得。", "author": "Duygu Sezen Islakoglu et.al.", "authors": "Duygu Sezen Islakoglu, Jan-Christoph Kalo", "id": "2501.03040v1", "paper_url": "http://arxiv.org/abs/2501.03040v1", "repo": "null"}}