{"2406.07080": {"publish_time": "2024-06-11", "title": "DARA: Decomposition-Alignment-Reasoning Autonomous Language Agent for Question Answering over Knowledge Graphs", "paper_summary": "Answering Questions over Knowledge Graphs (KGQA) is key to well-functioning\nautonomous language agents in various real-life applications. To improve the\nneural-symbolic reasoning capabilities of language agents powered by Large\nLanguage Models (LLMs) in KGQA, we propose the DecompositionAlignment-Reasoning\nAgent (DARA) framework. DARA effectively parses questions into formal queries\nthrough a dual mechanism: high-level iterative task decomposition and low-level\ntask grounding. Importantly, DARA can be efficiently trained with a small\nnumber of high-quality reasoning trajectories. Our experimental results\ndemonstrate that DARA fine-tuned on LLMs (e.g. Llama-2-7B, Mistral) outperforms\nboth in-context learning-based agents with GPT-4 and alternative fine-tuned\nagents, across different benchmarks in zero-shot evaluation, making such models\nmore accessible for real-life applications. We also show that DARA attains\nperformance comparable to state-of-the-art enumerating-and-ranking-based\nmethods for KGQA.", "paper_summary_zh": "回答知識圖表（KGQA）上的問題是各種現實生活應用中運作良好的自主語言代理的關鍵。為了改善大型語言模型（LLM）在 KGQA 中驅動的語言代理的神經符號推理能力，我們提出了分解對齊推理代理（DARA）框架。DARA 通過雙重機制有效地將問題解析為正式查詢：高級別迭代任務分解和低級別任務基礎。重要的是，DARA 可以使用少量的高品質推理軌跡進行有效訓練。我們的實驗結果表明，在 LLM（例如 Llama-2-7B、Mistral）上微調的 DARA 在零次評估的不同基準上優於基於上下文中學習的代理（使用 GPT-4）和替代微調代理，這使得此類模型更易於應用於現實生活中。我們還表明，DARA 獲得了與 KGQA 的最先進列舉和排名方法相當的性能。", "author": "Haishuo Fang et.al.", "authors": "Haishuo Fang, Xiaodan Zhu, Iryna Gurevych", "id": "2406.07080v1", "paper_url": "http://arxiv.org/abs/2406.07080v1", "repo": "null"}}