{"2405.05496": {"publish_time": "2024-05-09", "title": "Boosting Large Language Models with Continual Learning for Aspect-based Sentiment Analysis", "paper_summary": "Aspect-based sentiment analysis (ABSA) is an important subtask of sentiment\nanalysis, which aims to extract the aspects and predict their sentiments. Most\nexisting studies focus on improving the performance of the target domain by\nfine-tuning domain-specific models (trained on source domains) based on the\ntarget domain dataset. Few works propose continual learning tasks for ABSA,\nwhich aim to learn the target domain's ability while maintaining the history\ndomains' abilities. In this paper, we propose a Large Language Model-based\nContinual Learning (\\texttt{LLM-CL}) model for ABSA. First, we design a domain\nknowledge decoupling module to learn a domain-invariant adapter and separate\ndomain-variant adapters dependently with an orthogonal constraint. Then, we\nintroduce a domain knowledge warmup strategy to align the representation\nbetween domain-invariant and domain-variant knowledge. In the test phase, we\nindex the corresponding domain-variant knowledge via domain positioning to not\nrequire each sample's domain ID. Extensive experiments over 19 datasets\nindicate that our \\texttt{LLM-CL} model obtains new state-of-the-art\nperformance.", "paper_summary_zh": "基於面向方面的觀點分析 (ABSA) 是觀點分析中一個重要的子任務，旨在萃取面向並預測其觀點。大多數現有研究專注於透過根據目標領域資料集微調特定領域模型（在來源領域中訓練）來提升目標領域的效能。很少有研究提出 ABSA 的持續學習任務，其目標是在維持歷史領域能力的同時學習目標領域的能力。在本文中，我們提出一個基於大型語言模型的持續學習 (LLM-CL) 模型，用於 ABSA。首先，我們設計一個領域知識解耦模組，以學習一個不變領域的適配器，並透過正交約束分別分離出變異領域的適配器。然後，我們引入一個領域知識熱身策略，以調整不變領域和變異領域知識之間的表徵。在測試階段，我們透過領域定位索引對應的變異領域知識，以不需要每個樣本的領域 ID。在 19 個資料集上的大量實驗表明，我們的 LLM-CL 模型獲得了新的最先進效能。", "author": "Xuanwen Ding et.al.", "authors": "Xuanwen Ding, Jie Zhou, Liang Dou, Qin Chen, Yuanbin Wu, Chengcai Chen, Liang He", "id": "2405.05496v1", "paper_url": "http://arxiv.org/abs/2405.05496v1", "repo": "null"}}