{"2504.13151": {"publish_time": "2025-04-17", "title": "MIB: A Mechanistic Interpretability Benchmark", "paper_summary": "How can we know whether new mechanistic interpretability methods achieve real\nimprovements? In pursuit of meaningful and lasting evaluation standards, we\npropose MIB, a benchmark with two tracks spanning four tasks and five models.\nMIB favors methods that precisely and concisely recover relevant causal\npathways or specific causal variables in neural language models. The circuit\nlocalization track compares methods that locate the model components - and\nconnections between them - most important for performing a task (e.g.,\nattribution patching or information flow routes). The causal variable\nlocalization track compares methods that featurize a hidden vector, e.g.,\nsparse autoencoders (SAEs) or distributed alignment search (DAS), and locate\nmodel features for a causal variable relevant to the task. Using MIB, we find\nthat attribution and mask optimization methods perform best on circuit\nlocalization. For causal variable localization, we find that the supervised DAS\nmethod performs best, while SAE features are not better than neurons, i.e.,\nstandard dimensions of hidden vectors. These findings illustrate that MIB\nenables meaningful comparisons of methods, and increases our confidence that\nthere has been real progress in the field.", "paper_summary_zh": "我們如何得知新的機制可解釋性方法是否取得了真正的進步？為了追求有意義且持久的評估標準，我們提出了 MIB，這是一個包含四個任務和五個模型的雙軌基準測試。MIB 傾向於那些能夠精確且簡潔地恢復神經語言模型中相關因果路徑或特定因果變量的那些方法。電路定位軌跡比較了那些定位模型組件（以及它們之間的連接）對於執行任務（例如，歸因修補或信息流路線）最重要的那些方法。因果變量定位軌跡比較了那些將隱藏向量特徵化的那些方法，例如，稀疏自編碼器 (SAE) 或分佈式對齊搜索 (DAS)，並定位與任務相關的因果變量的模型特徵。使用 MIB，我們發現歸因和掩碼優化方法在電路定位上表現最佳。對於因果變量定位，我們發現監督式 DAS 方法表現最佳，而 SAE 特徵並不比神經元（即隱藏向量的標準維度）更好。這些發現表明，MIB 能夠對各種方法進行有意義的比較，並增強我們對該領域已取得真正進展的信心。\n", "author": "Aaron Mueller et.al.", "authors": "Aaron Mueller, Atticus Geiger, Sarah Wiegreffe, Dana Arad, Iván Arcuschin, Adam Belfki, Yik Siu Chan, Jaden Fiotto-Kaufman, Tal Haklay, Michael Hanna, Jing Huang, Rohan Gupta, Yaniv Nikankin, Hadas Orgad, Nikhil Prakash, Anja Reusch, Aruna Sankaranarayanan, Shun Shao, Alessandro Stolfo, Martin Tutek, Amir Zur, David Bau, Yonatan Belinkov", "id": "2504.13151v1", "paper_url": "http://arxiv.org/abs/2504.13151v1", "repo": "null"}}