{"2412.11745": {"publish_time": "2024-12-16", "title": "Beyond Dataset Creation: Critical View of Annotation Variation and Bias Probing of a Dataset for Online Radical Content Detection", "paper_summary": "The proliferation of radical content on online platforms poses significant\nrisks, including inciting violence and spreading extremist ideologies. Despite\nongoing research, existing datasets and models often fail to address the\ncomplexities of multilingual and diverse data. To bridge this gap, we introduce\na publicly available multilingual dataset annotated with radicalization levels,\ncalls for action, and named entities in English, French, and Arabic. This\ndataset is pseudonymized to protect individual privacy while preserving\ncontextual information. Beyond presenting our\n\\href{https://gitlab.inria.fr/ariabi/counter-dataset-public}{freely available\ndataset}, we analyze the annotation process, highlighting biases and\ndisagreements among annotators and their implications for model performance.\nAdditionally, we use synthetic data to investigate the influence of\nsocio-demographic traits on annotation patterns and model predictions. Our work\noffers a comprehensive examination of the challenges and opportunities in\nbuilding robust datasets for radical content detection, emphasizing the\nimportance of fairness and transparency in model development.", "paper_summary_zh": "網路上激進內容的激增帶來重大風險，包括煽動暴力和散布極端主義意識形態。儘管持續進行研究，現有的資料集和模型常常無法解決多語言和多元資料的複雜性。為了彌補這個差距，我們引進一個公開可用的多語言資料集，其中標示了激進化程度、行動呼籲以及英文、法文和阿拉伯文的命名實體。這個資料集經過假名化處理，以保護個人隱私，同時保留脈絡資訊。除了展示我們\n\\href{https://gitlab.inria.fr/ariabi/counter-dataset-public}{免費提供的資料集} 之外，我們還分析標註流程，強調標註者之間的偏見和分歧，以及它們對模型效能的影響。此外，我們使用合成資料來調查社會人口特徵對標註模式和模型預測的影響。我們的研究全面探討建立用於激進內容偵測的穩健資料集時所面臨的挑戰和機會，強調在模型開發中公平性和透明度的重要性。", "author": "Arij Riabi et.al.", "authors": "Arij Riabi, Virginie Mouilleron, Menel Mahamdi, Wissam Antoun, Djamé Seddah", "id": "2412.11745v1", "paper_url": "http://arxiv.org/abs/2412.11745v1", "repo": "null"}}