{"2410.08968": {"publish_time": "2024-10-11", "title": "Controllable Safety Alignment: Inference-Time Adaptation to Diverse Safety Requirements", "paper_summary": "The current paradigm for safety alignment of large language models (LLMs)\nfollows a one-size-fits-all approach: the model refuses to interact with any\ncontent deemed unsafe by the model provider. This approach lacks flexibility in\nthe face of varying social norms across cultures and regions. In addition,\nusers may have diverse safety needs, making a model with static safety\nstandards too restrictive to be useful, as well as too costly to be re-aligned.\n  We propose Controllable Safety Alignment (CoSA), a framework designed to\nadapt models to diverse safety requirements without re-training. Instead of\naligning a fixed model, we align models to follow safety configs -- free-form\nnatural language descriptions of the desired safety behaviors -- that are\nprovided as part of the system prompt. To adjust model safety behavior,\nauthorized users only need to modify such safety configs at inference time. To\nenable that, we propose CoSAlign, a data-centric method for aligning LLMs to\neasily adapt to diverse safety configs. Furthermore, we devise a novel\ncontrollability evaluation protocol that considers both helpfulness and\nconfigured safety, summarizing them into CoSA-Score, and construct CoSApien, a\nhuman-authored benchmark that consists of real-world LLM use cases with diverse\nsafety requirements and corresponding evaluation prompts.\n  We show that CoSAlign leads to substantial gains of controllability over\nstrong baselines including in-context alignment. Our framework encourages\nbetter representation and adaptation to pluralistic human values in LLMs, and\nthereby increasing their practicality.", "paper_summary_zh": "大型語言模型 (LLM) 的安全對齊當前範例遵循一體適用的方法：模型拒絕與模型供應商視為不安全的任何內容互動。這種方法在面對不同文化和地區的社會規範變化時缺乏靈活性。此外，使用者可能有不同的安全需求，這使得具有靜態安全標準的模型過於嚴格而無法使用，而且重新對齊的成本也過高。\n我們提出可控安全對齊 (CoSA)，一個旨在讓模型適應不同的安全需求而無需重新訓練的架構。我們不是對齊固定模型，而是對齊模型以遵循安全設定檔，也就是系統提示一部分的所需安全行為的自由形式自然語言描述。為了調整模型安全行為，授權使用者只需要在推論時間修改此類安全設定檔。為了實現這個目的，我們提出 CoSAlign，一種以資料為中心的 LLM 對齊方法，可輕鬆適應不同的安全設定檔。此外，我們設計了一個新穎的可控性評估協定，同時考慮了有益性和已配置的安全，將它們總結到 CoSA-Score 中，並建構了 CoSApien，一個由人類編寫的基準，包含了具有不同安全需求的真實世界 LLM 使用案例和對應的評估提示。\n我們展示了 CoSAlign 導致了對比強大的基準（包括上下文對齊）的可控性大幅提升。我們的架構鼓勵在 LLM 中更好地表示和適應多元化的人類價值觀，從而提高其實用性。", "author": "Jingyu Zhang et.al.", "authors": "Jingyu Zhang, Ahmed Elgohary, Ahmed Magooda, Daniel Khashabi, Benjamin Van Durme", "id": "2410.08968v1", "paper_url": "http://arxiv.org/abs/2410.08968v1", "repo": "null"}}