{"2406.11721": {"publish_time": "2024-06-17", "title": "Zero-Shot Generalization during Instruction Tuning: Insights from Similarity and Granularity", "paper_summary": "Understanding alignment techniques begins with comprehending zero-shot\ngeneralization brought by instruction tuning, but little of the mechanism has\nbeen understood. Existing work has largely been confined to the task level,\nwithout considering that tasks are artificially defined and, to LLMs, merely\nconsist of tokens and representations. This line of research has been limited\nto examining transfer between tasks from a task-pair perspective, with few\nstudies focusing on understanding zero-shot generalization from the perspective\nof the data itself. To bridge this gap, we first demonstrate through multiple\nmetrics that zero-shot generalization during instruction tuning happens very\nearly. Next, we investigate the facilitation of zero-shot generalization from\nboth data similarity and granularity perspectives, confirming that encountering\nhighly similar and fine-grained training data earlier during instruction\ntuning, without the constraints of defined \"tasks\", enables better\ngeneralization. Finally, we propose a more grounded training data arrangement\nmethod, Test-centric Multi-turn Arrangement, and show its effectiveness in\npromoting continual learning and further loss reduction. For the first time, we\nshow that zero-shot generalization during instruction tuning is a form of\nsimilarity-based generalization between training and test data at the instance\nlevel. We hope our analysis will advance the understanding of zero-shot\ngeneralization during instruction tuning and contribute to the development of\nmore aligned LLMs. Our code is released at\nhttps://github.com/HBX-hbx/dynamics_of_zero-shot_generalization.", "paper_summary_zh": "理解對齊技術始於理解指令調整帶來的零次學習泛化，但對機制了解甚少。現有工作在很大程度上局限於任務層面，而沒有考慮到任務是人工定義的，而且對於 LLM 來說，僅僅由標記和表示組成。這條研究路線僅限於從任務對的角度審視任務之間的轉移，很少有研究專注於從數據本身的角度理解零次學習泛化。為了彌補這一差距，我們首先通過多項指標證明，在指令調整期間，零次學習泛化發生得很早。接下來，我們從數據相似性和粒度角度研究零次學習泛化的促進作用，確認在指令調整期間更早地遇到高度相似且細粒度的訓練數據，不受定義的「任務」約束，可以實現更好的泛化。最後，我們提出了一種更紮實的訓練數據排列方法，即以測試為中心的多次排列，並展示了其在促進持續學習和進一步損失減少方面的有效性。我們首次表明，在指令調整期間，零次學習泛化是在實例層面上訓練數據和測試數據之間基於相似性的泛化形式。我們希望我們的分析將促進對指令調整期間零次學習泛化的理解，並有助於開發更多對齊的 LLM。我們的代碼發布在 https://github.com/HBX-hbx/dynamics_of_zero-shot_generalization。", "author": "Bingxiang He et.al.", "authors": "Bingxiang He, Ning Ding, Cheng Qian, Jia Deng, Ganqu Cui, Lifan Yuan, Huan-ang Gao, Huimin Chen, Zhiyuan Liu, Maosong Sun", "id": "2406.11721v1", "paper_url": "http://arxiv.org/abs/2406.11721v1", "repo": "https://github.com/hbx-hbx/dynamics_of_zero-shot_generalization"}}