{"2411.03866": {"publish_time": "2024-11-06", "title": "Performance evaluation of SLAM-ASR: The Good, the Bad, the Ugly, and the Way Forward", "paper_summary": "Recent research has demonstrated that training a linear connector between\nspeech foundation encoders and large language models (LLMs) enables this\narchitecture to achieve strong ASR capabilities. Despite the impressive\nresults, it remains unclear whether these simple approaches are robust enough\nacross different scenarios and speech conditions, such as domain shifts and\ndifferent speech perturbations. In this paper, we address these questions by\nconducting various ablation experiments using a recent and widely adopted\napproach called SLAM-ASR. We present novel empirical findings that offer\ninsights on how to effectively utilize the SLAM-ASR architecture across a wide\nrange of settings. Our main findings indicate that the SLAM-ASR exhibits poor\nperformance in cross-domain evaluation settings. Additionally, speech\nperturbations within in-domain data, such as changes in speed or the presence\nof additive noise, can significantly impact performance. Our findings offer\ncritical insights for fine-tuning and configuring robust LLM-based ASR models,\ntailored to different data characteristics and computational resources.", "paper_summary_zh": "最近的研究表明，在语音基础编码器和大语言模型 (LLM) 之间训练线性连接器，使这种架构能够实现强大的 ASR 功能。尽管取得了令人印象深刻的结果，但尚不清楚这些简单的方法是否足够稳健，可以在不同的场景和语音条件下使用，例如域转换和不同的语音扰动。在本文中，我们通过使用一种最近被广泛采用的称为 SLAM-ASR 的方法来进行各种消融实验，来解决这些问题。我们提出了新颖的经验发现，提供了有关如何在各种设置中有效利用 SLAM-ASR 架构的见解。我们的主要发现表明，SLAM-ASR 在跨域评估设置中表现不佳。此外，域内数据中的语音扰动，例如速度变化或加性噪声的存在，会严重影响性能。我们的发现为微调和配置基于 LLM 的鲁棒 ASR 模型提供了关键见解，这些模型针对不同的数据特征和计算资源进行了定制。", "author": "Shashi Kumar et.al.", "authors": "Shashi Kumar, Iuliia Thorbecke, Sergio Burdisso, Esaú Villatoro-Tello, Manjunath K E, Kadri Hacioğlu, Pradeep Rangappa, Petr Motlicek, Aravind Ganapathiraju, Andreas Stolcke", "id": "2411.03866v1", "paper_url": "http://arxiv.org/abs/2411.03866v1", "repo": "null"}}