{"2501.09102": {"publish_time": "2025-01-15", "title": "Tracking the Takes and Trajectories of English-Language News Narratives across Trustworthy and Worrisome Websites", "paper_summary": "Understanding how misleading and outright false information enters news\necosystems remains a difficult challenge that requires tracking how narratives\nspread across thousands of fringe and mainstream news websites. To do this, we\nintroduce a system that utilizes encoder-based large language models and\nzero-shot stance detection to scalably identify and track news narratives and\ntheir attitudes across over 4,000 factually unreliable, mixed-reliability, and\nfactually reliable English-language news websites. Running our system over an\n18 month period, we track the spread of 146K news stories. Using network-based\ninterference via the NETINF algorithm, we show that the paths of news\nnarratives and the stances of websites toward particular entities can be used\nto uncover slanted propaganda networks (e.g., anti-vaccine and anti-Ukraine)\nand to identify the most influential websites in spreading these attitudes in\nthe broader news ecosystem. We hope that increased visibility into our\ndistributed news ecosystem can help with the reporting and fact-checking of\npropaganda and disinformation.", "paper_summary_zh": "了解如何誤導和完全錯誤的訊息進入新聞生態系統仍然是一個困難的挑戰，需要追蹤敘述如何散佈在數千個邊緣和主流新聞網站上。為此，我們引入一個系統，利用基於編碼器的大型語言模型和零次態勢偵測來可擴充地識別和追蹤新聞敘述及其在超過 4,000 個事實上不可靠、可靠性混合和事實上可靠的英文新聞網站上的態度。在 18 個月期間執行我們的系統，我們追蹤了 146K 則新聞報導的散佈。使用透過 NETINF 演算法的基於網路的干擾，我們顯示新聞敘述的路徑和網站對特定實體的立場可用於揭露有偏見的宣傳網路（例如反疫苗和反烏克蘭），並識別在更廣泛的新聞生態系統中散佈這些態度的最有影響力的網站。我們希望對我們分散的新聞生態系統有更高的可見度有助於宣傳和錯誤訊息的報導和事實查核。", "author": "Hans W. A. Hanley et.al.", "authors": "Hans W. A. Hanley, Emily Okabe, Zakir Durumeric", "id": "2501.09102v1", "paper_url": "http://arxiv.org/abs/2501.09102v1", "repo": "https://github.com/hanshanley/tracking-takes"}}