{"2405.09875": {"publish_time": "2024-05-16", "title": "A Farewell to Harms: Risk Management for Medical Devices via the Riskman Ontology & Shapes", "paper_summary": "We introduce the Riskman ontology & shapes for representing and analysing\ninformation about risk management for medical devices. Risk management is\nconcerned with taking necessary precautions so a medical device does not cause\nharms for users or the environment. To date, risk management documentation is\nsubmitted to notified bodies (for certification) in the form of semi-structured\nnatural language text. We propose to use classes from the Riskman ontology to\nlogically model risk management documentation and to use the included SHACL\nconstraints to check for syntactic completeness and conformity to relevant\nstandards. In particular, the ontology is modelled after ISO 14971 and the\nrecently published VDE Spec 90025. Our proposed methodology has the potential\nto save many person-hours for both manufacturers (when creating risk management\ndocumentation) as well as notified bodies (when assessing submitted\napplications for certification), and thus offers considerable benefits for\nhealthcare and, by extension, society as a whole.", "paper_summary_zh": "我們引入了 Riskman ontology 和形狀，用於表示和分析醫療器材風險管理的資訊。風險管理關注採取必要的預防措施，讓醫療器材不會對使用者或環境造成危害。迄今為止，風險管理文件是以半結構化的自然語言文字形式提交給公告單位（用於認證）。我們提議使用 Riskman ontology 中的類別，以邏輯方式建構風險管理文件，並使用所包含的 SHACL 約束，檢查語法完整性和是否符合相關標準。特別是，ontology 是根據 ISO 14971 和最近發布的 VDE Spec 90025 建構的。我們提出的方法論有可能為製造商（在建立風險管理文件時）和公告單位（在評估提交的認證申請時）節省大量的人力，因此對醫療保健，以及進一步擴展到整個社會，都提供了相當大的好處。", "author": "Piotr Gorczyca et.al.", "authors": "Piotr Gorczyca, Dörthe Arndt, Martin Diller, Pascal Kettmann, Stephan Mennicke, Hannes Strass", "id": "2405.09875v2", "paper_url": "http://arxiv.org/abs/2405.09875v2", "repo": "null"}}