{"2407.07895": {"publish_time": "2024-07-10", "title": "LLaVA-NeXT-Interleave: Tackling Multi-image, Video, and 3D in Large Multimodal Models", "paper_summary": "Visual instruction tuning has made considerable strides in enhancing the\ncapabilities of Large Multimodal Models (LMMs). However, existing open LMMs\nlargely focus on single-image tasks, their applications to multi-image\nscenarios remains less explored. Additionally, prior LMM research separately\ntackles different scenarios, leaving it impossible to generalize cross\nscenarios with new emerging capabilities. To this end, we introduce\nLLaVA-NeXT-Interleave, which simultaneously tackles Multi-image, Multi-frame\n(video), Multi-view (3D), and Multi-patch (single-image) scenarios in LMMs. To\nenable these capabilities, we regard the interleaved data format as a general\ntemplate and compile the M4-Instruct dataset with 1,177.6k samples, spanning 4\nprimary domains with 14 tasks and 41 datasets. We also curate the\nLLaVA-Interleave Bench to comprehensively evaluate the multi-image performance\nof LMMs. Through extensive experiments, LLaVA-NeXT-Interleave achieves leading\nresults in multi-image, video, and 3D benchmarks, while maintaining the\nperformance of single-image tasks. Besides, our model also exhibits several\nemerging capabilities, e.g., transferring tasks across different settings and\nmodalities. Code is available at https://github.com/LLaVA-VL/LLaVA-NeXT", "paper_summary_zh": "視覺指令調整已在提升大型多模態模型 (LMM) 能力方面取得顯著進展。然而，現有的開放式 LMM 主要專注於單一影像任務，其在多影像場景中的應用仍較少探索。此外，先前的 LMM 研究分別處理不同的場景，導致無法透過新興能力對跨場景進行概括。為此，我們引入了 LLaVA-NeXT-Interleave，它同時處理 LMM 中的多影像、多幀（影片）、多視角（3D）和多區塊（單一影像）場景。為了啟用這些能力，我們將交錯資料格式視為一般範本，並編譯包含 1,177.6k 個樣本的 M4-Instruct 資料集，涵蓋 4 個主要領域，包含 14 個任務和 41 個資料集。我們也策劃了 LLaVA-Interleave Bench，以全面評估 LMM 的多影像效能。透過廣泛的實驗，LLaVA-NeXT-Interleave 在多影像、影片和 3D 基準測試中取得領先的結果，同時維持單一影像任務的效能。此外，我們的模型也展現了多項新興能力，例如在不同設定和模態之間轉移任務。程式碼可在 https://github.com/LLaVA-VL/LLaVA-NeXT 取得", "author": "Feng Li et.al.", "authors": "Feng Li, Renrui Zhang, Hao Zhang, Yuanhan Zhang, Bo Li, Wei Li, Zejun Ma, Chunyuan Li", "id": "2407.07895v1", "paper_url": "http://arxiv.org/abs/2407.07895v1", "repo": "https://github.com/LLaVA-VL/LLaVA-NeXT"}}