{"2410.09105": {"publish_time": "2024-10-10", "title": "Artificial intelligence techniques in inherited retinal diseases: A review", "paper_summary": "Inherited retinal diseases (IRDs) are a diverse group of genetic disorders\nthat lead to progressive vision loss and are a major cause of blindness in\nworking-age adults. The complexity and heterogeneity of IRDs pose significant\nchallenges in diagnosis, prognosis, and management. Recent advancements in\nartificial intelligence (AI) offer promising solutions to these challenges.\nHowever, the rapid development of AI techniques and their varied applications\nhave led to fragmented knowledge in this field. This review consolidates\nexisting studies, identifies gaps, and provides an overview of AI's potential\nin diagnosing and managing IRDs. It aims to structure pathways for advancing\nclinical applications by exploring AI techniques like machine learning and deep\nlearning, particularly in disease detection, progression prediction, and\npersonalized treatment planning. Special focus is placed on the effectiveness\nof convolutional neural networks in these areas. Additionally, the integration\nof explainable AI is discussed, emphasizing its importance in clinical settings\nto improve transparency and trust in AI-based systems. The review addresses the\nneed to bridge existing gaps in focused studies on AI's role in IRDs, offering\na structured analysis of current AI techniques and outlining future research\ndirections. It concludes with an overview of the challenges and opportunities\nin deploying AI for IRDs, highlighting the need for interdisciplinary\ncollaboration and the continuous development of robust, interpretable AI models\nto advance clinical applications.", "paper_summary_zh": "遺傳性視網膜疾病 (IRD) 是一組多樣化的遺傳疾病，\n會導致視力逐漸喪失，是工作年齡成人失明的主要原因。IRD 的複雜性和異質性對診斷、預後和管理提出了重大挑戰。最近人工智能 (AI) 的進步為這些挑戰提供了有希望的解決方案。\n然而，AI 技術的快速發展及其多種應用導致了該領域的知識分散。本綜述整合了現有研究，找出差距，並概述了 AI 在診斷和管理 IRD 中的潛力。它旨在通過探索機器學習和深度學習等 AI 技術，特別是在疾病檢測、進程預測和個性化治療計劃中，為推進臨床應用構建途徑。特別關注這些領域中卷積神經網路的有效性。此外，討論了可解釋 AI 的整合，強調了其在臨床環境中提高透明度和對基於 AI 的系統的信任的重要性。該綜述解決了彌合 AI 在 IRD 中作用的重點研究中現有差距的必要性，提供了對當前 AI 技術的結構化分析，並概述了未來的研究方向。最後概述了在 IRD 中部署 AI 的挑戰和機遇，強調了跨學科合作和持續開發強大、可解釋的 AI 模型以推進臨床應用的必要性。", "author": "Han Trinh et.al.", "authors": "Han Trinh, Jordan Vice, Jason Charng, Zahra Tajbakhsh, Khyber Alam, Fred K. Chen, Ajmal Mian", "id": "2410.09105v1", "paper_url": "http://arxiv.org/abs/2410.09105v1", "repo": "null"}}