{"2501.07783": {"publish_time": "2025-01-14", "title": "Parameter-Inverted Image Pyramid Networks for Visual Perception and Multimodal Understanding", "paper_summary": "Image pyramids are widely adopted in top-performing methods to obtain\nmulti-scale features for precise visual perception and understanding. However,\ncurrent image pyramids use the same large-scale model to process multiple\nresolutions of images, leading to significant computational cost. To address\nthis challenge, we propose a novel network architecture, called\nParameter-Inverted Image Pyramid Networks (PIIP). Specifically, PIIP uses\npretrained models (ViTs or CNNs) as branches to process multi-scale images,\nwhere images of higher resolutions are processed by smaller network branches to\nbalance computational cost and performance. To integrate information from\ndifferent spatial scales, we further propose a novel cross-branch feature\ninteraction mechanism. To validate PIIP, we apply it to various perception\nmodels and a representative multimodal large language model called LLaVA, and\nconduct extensive experiments on various tasks such as object detection,\nsegmentation, image classification and multimodal understanding. PIIP achieves\nsuperior performance compared to single-branch and existing multi-resolution\napproaches with lower computational cost. When applied to InternViT-6B, a\nlarge-scale vision foundation model, PIIP can improve its performance by 1%-2%\non detection and segmentation with only 40%-60% of the original computation,\nfinally achieving 60.0 box AP on MS COCO and 59.7 mIoU on ADE20K. For\nmultimodal understanding, our PIIP-LLaVA achieves 73.0% accuracy on TextVQA and\n74.5% on MMBench with only 2.8M training data. Our code is released at\nhttps://github.com/OpenGVLab/PIIP.", "paper_summary_zh": "图像金字塔被广泛应用于高性能方法中，以获取多尺度特征，用于精确的视觉感知和理解。然而，当前的图像金字塔使用相同的大规模模型来处理图像的多个分辨率，导致了巨大的计算成本。为了应对这一挑战，我们提出了一种新颖的网络架构，称为参数反转图像金字塔网络 (PIIP)。具体来说，PIIP 使用预训练模型（ViT 或 CNN）作为分支来处理多尺度图像，其中较高分辨率的图像由较小的网络分支处理，以平衡计算成本和性能。为了整合来自不同空间尺度的信息，我们进一步提出了一种新颖的跨分支特征交互机制。为了验证 PIIP，我们将其应用于各种感知模型和一个名为 LLaVA 的代表性多模态大语言模型，并在对象检测、分割、图像分类和多模态理解等各种任务上进行了广泛的实验。与单分支和现有的多分辨率方法相比，PIIP 以较低的计算成本实现了卓越的性能。当应用于大规模视觉基础模型 InternViT-6B 时，PIIP 可以将其在检测和分割上的性能提高 1%-2%，而原始计算量仅为 40%-60%，最终在 MS COCO 上实现了 60.0 框 AP，在 ADE20K 上实现了 59.7 mIoU。对于多模态理解，我们的 PIIP-LLaVA 在 TextVQA 上实现了 73.0% 的准确率，在 MMBench 上实现了 74.5%，而训练数据仅为 2.8M。我们的代码已在 https://github.com/OpenGVLab/PIIP 中发布。", "author": "Zhaokai Wang et.al.", "authors": "Zhaokai Wang, Xizhou Zhu, Xue Yang, Gen Luo, Hao Li, Changyao Tian, Wenhan Dou, Junqi Ge, Lewei Lu, Yu Qiao, Jifeng Dai", "id": "2501.07783v1", "paper_url": "http://arxiv.org/abs/2501.07783v1", "repo": "https://github.com/opengvlab/piip"}}