{"2408.11815": {"publish_time": "2024-08-21", "title": "Great Memory, Shallow Reasoning: Limits of $k$NN-LMs", "paper_summary": "$K$-nearest neighbor language models ($k$NN-LMs), which integrate retrieval\nwith next-word prediction, have demonstrated strong performance in language\nmodeling as well as downstream NLP benchmarks. These results have led\nresearchers to argue that models trained on poor quality or outdated data could\nperform well by employing a $k$NN extension that has access to a higher-quality\ndatastore. In this work, we ask whether this improved ability to recall\ninformation really translates into downstream abilities. We extensively\nevaluate $k$NN-LMs on a diverse set of tasks, ranging from sentiment\nclassification and commonsense reasoning to multi-hop reasoning. Results show\nthat $k$NN-LMs excel at memory-intensive tasks, where utilizing the patterns in\nthe input is sufficient for determining the output, but struggle with reasoning\ntasks that require integrating multiple pieces of information to derive new\nknowledge. We further demonstrate through oracle experiments and qualitative\nanalysis that even with perfect retrieval, $k$NN-LMs still fail to determine\nthe correct answers, placing an upper bound on their reasoning performance.\nCode and datastores are released at https://github.com/GSYfate/knnlm-limits/.", "paper_summary_zh": "$K$-近邻语言模型 ($k$NN-LMs) 将检索与下一个词预测整合在一起，在语言建模以及下游 NLP 基准测试中表现出了强大的性能。这些结果促使研究人员争论说，通过使用可以访问更高质量数据存储的 $k$NN 扩展，在低质量或过时数据上训练的模型可以表现良好。在这项工作中，我们询问这种改进的信息召回能力是否真的转化为下游能力。我们在各种任务上广泛评估了 $k$NN-LMs，从情感分类和常识推理到多跳推理。结果表明，$k$NN-LMs 在内存密集型任务中表现出色，其中利用输入中的模式足以确定输出，但在推理任务中遇到了困难，这些任务需要整合多条信息来推导出新知识。我们通过神谕实验和定性分析进一步证明，即使在完美的检索下，$k$NN-LMs 仍然无法确定正确的答案，从而为其推理性能设定了上限。代码和数据存储已在 https://github.com/GSYfate/knnlm-limits/ 发布。", "author": "Shangyi Geng et.al.", "authors": "Shangyi Geng, Wenting Zhao, Alexander M Rush", "id": "2408.11815v1", "paper_url": "http://arxiv.org/abs/2408.11815v1", "repo": "https://github.com/gsyfate/knnlm-limits"}}