{"2412.11965": {"publish_time": "2024-12-16", "title": "Inferring Functionality of Attention Heads from their Parameters", "paper_summary": "Attention heads are one of the building blocks of large language models\n(LLMs). Prior work on investigating their operation mostly focused on analyzing\ntheir behavior during inference for specific circuits or tasks. In this work,\nwe seek a comprehensive mapping of the operations they implement in a model. We\npropose MAPS (Mapping Attention head ParameterS), an efficient framework that\ninfers the functionality of attention heads from their parameters, without any\nmodel training or inference. We showcase the utility of MAPS for answering two\ntypes of questions: (a) given a predefined operation, mapping how strongly\nheads across the model implement it, and (b) given an attention head, inferring\nits salient functionality. Evaluating MAPS on 20 operations across 6 popular\nLLMs shows its estimations correlate with the head's outputs during inference\nand are causally linked to the model's predictions. Moreover, its mappings\nreveal attention heads of certain operations that were overlooked in previous\nstudies, and valuable insights on function universality and architecture biases\nin LLMs. Next, we present an automatic pipeline and analysis that leverage MAPS\nto characterize the salient operations of a given head. Our pipeline produces\nplausible operation descriptions for most heads, as assessed by human judgment,\nwhile revealing diverse operations.", "paper_summary_zh": "注意力頭部是大語言模型 (LLM) 的基本組成部分之一。先前針對其運作的研究主要集中在分析其在特定電路或任務的推理期間的行為。在這項工作中，我們尋求全面地對模型中實作的運算進行對應。我們提出 MAPS (對應注意力頭部參數)，一種有效率的架構，可以從其參數推論注意力頭部的功能，而無需任何模型訓練或推理。我們展示了 MAPS 在回答兩種問題時的效用：(a) 給定一個預定義的運算，對應模型中頭部實作它的強度，以及 (b) 給定一個注意力頭部，推論其顯著功能。在 6 個熱門 LLM 中對 20 個運算評估 MAPS，顯示其估計值與推理期間頭部的輸出相關，並且與模型的預測有因果關係。此外，其對應揭示了先前研究中被忽略的特定運算的注意力頭部，以及關於 LLM 中功能通用性和架構偏差的寶貴見解。接下來，我們提出一個自動化管道和分析，利用 MAPS 來描述給定頭部的顯著運算。我們的管道會產生大多數頭部合理的運算描述，經由人類判斷評估，同時揭示不同的運算。", "author": "Amit Elhelo et.al.", "authors": "Amit Elhelo, Mor Geva", "id": "2412.11965v1", "paper_url": "http://arxiv.org/abs/2412.11965v1", "repo": "https://github.com/amitelhelo/maps"}}