{"2405.20541": {"publish_time": "2024-05-30", "title": "Perplexed by Perplexity: Perplexity-Based Data Pruning With Small Reference Models", "paper_summary": "In this work, we investigate whether small language models can determine\nhigh-quality subsets of large-scale text datasets that improve the performance\nof larger language models. While existing work has shown that pruning based on\nthe perplexity of a larger model can yield high-quality data, we investigate\nwhether smaller models can be used for perplexity-based pruning and how pruning\nis affected by the domain composition of the data being pruned. We demonstrate\nthat for multiple dataset compositions, perplexity-based pruning of pretraining\ndata can \\emph{significantly} improve downstream task performance: pruning\nbased on perplexities computed with a 125 million parameter model improves the\naverage performance on downstream tasks of a 3 billion parameter model by up to\n2.04 and achieves up to a $1.45\\times$ reduction in pretraining steps to reach\ncommensurate baseline performance. Furthermore, we demonstrate that such\nperplexity-based data pruning also yields downstream performance gains in the\nover-trained and data-constrained regimes.", "paper_summary_zh": "在這項工作中，我們探討小型語言模型是否可以確定大型文字資料集中的高品質子集，以提升大型語言模型的效能。雖然現有研究顯示，根據較大型模型的困惑度進行剪枝可以產生高品質資料，但我們探討較小型模型是否可用於基於困惑度的剪枝，以及剪枝如何受到被剪枝資料的網域組成影響。我們證明，對於多個資料集組成，預訓練資料的基於困惑度的剪枝可以顯著提升下游任務效能：根據 1.25 億個參數模型計算的困惑度進行剪枝，將 30 億個參數模型在下游任務的平均效能提升多達 2.04，並在預訓練步驟中最多減少 $1.45\\times$ 倍，以達到相當的基準效能。此外，我們證明這種基於困惑度的資料剪枝，在過度訓練和資料受限的模式中，也能產生下游效能提升。", "author": "Zachary Ankner et.al.", "authors": "Zachary Ankner, Cody Blakeney, Kartik Sreenivasan, Max Marion, Matthew L. Leavitt, Mansheej Paul", "id": "2405.20541v1", "paper_url": "http://arxiv.org/abs/2405.20541v1", "repo": "null"}}