{"2405.20132": {"publish_time": "2024-05-30", "title": "LLaMEA: A Large Language Model Evolutionary Algorithm for Automatically Generating Metaheuristics", "paper_summary": "Large Language Models (LLMs) such as GPT-4 have demonstrated their ability to\nunderstand natural language and generate complex code snippets. This paper\nintroduces a novel Large Language Model Evolutionary Algorithm (LLaMEA)\nframework, leveraging GPT models for the automated generation and refinement of\nalgorithms. Given a set of criteria and a task definition (the search space),\nLLaMEA iteratively generates, mutates and selects algorithms based on\nperformance metrics and feedback from runtime evaluations. This framework\noffers a unique approach to generating optimized algorithms without requiring\nextensive prior expertise. We show how this framework can be used to generate\nnovel black-box metaheuristic optimization algorithms automatically. LLaMEA\ngenerates multiple algorithms that outperform state-of-the-art optimization\nalgorithms (Covariance Matrix Adaptation Evolution Strategy and Differential\nEvolution) on the five dimensional black box optimization benchmark (BBOB). The\nresults demonstrate the feasibility of the framework and identify future\ndirections for automated generation and optimization of algorithms via LLMs.", "paper_summary_zh": "大型語言模型 (LLM)，例如 GPT-4，已展示其理解自然語言和生成複雜程式碼片段的能力。本文介紹了一種新穎的大型語言模型演算法 (LLaMEA) 架構，利用 GPT 模型自動生成和改進演算法。給定一組標準和任務定義（搜尋空間），LLaMEA 會根據執行時間評估的效能指標和回饋，反覆生成、變異和選擇演算法。此架構提供了一種獨特的方法來生成最佳化演算法，而無需廣泛的先驗專業知識。我們展示了如何使用此架構自動生成新穎的黑盒元啟發式最佳化演算法。LLaMEA 生成了多種演算法，其效能優於五維黑盒最佳化基準 (BBOB) 上的最新最佳化演算法（協方差矩陣適應演化策略和差分演化）。結果證明了此架構的可行性，並指出了透過 LLM 自動生成和最佳化演算法的未來方向。", "author": "Niki van Stein et.al.", "authors": "Niki van Stein, Thomas Bäck", "id": "2405.20132v1", "paper_url": "http://arxiv.org/abs/2405.20132v1", "repo": "null"}}