{"2409.20502": {"publish_time": "2024-09-30", "title": "COLLAGE: Collaborative Human-Agent Interaction Generation using Hierarchical Latent Diffusion and Language Models", "paper_summary": "We propose a novel framework COLLAGE for generating collaborative\nagent-object-agent interactions by leveraging large language models (LLMs) and\nhierarchical motion-specific vector-quantized variational autoencoders\n(VQ-VAEs). Our model addresses the lack of rich datasets in this domain by\nincorporating the knowledge and reasoning abilities of LLMs to guide a\ngenerative diffusion model. The hierarchical VQ-VAE architecture captures\ndifferent motion-specific characteristics at multiple levels of abstraction,\navoiding redundant concepts and enabling efficient multi-resolution\nrepresentation. We introduce a diffusion model that operates in the latent\nspace and incorporates LLM-generated motion planning cues to guide the\ndenoising process, resulting in prompt-specific motion generation with greater\ncontrol and diversity. Experimental results on the CORE-4D, and InterHuman\ndatasets demonstrate the effectiveness of our approach in generating realistic\nand diverse collaborative human-object-human interactions, outperforming\nstate-of-the-art methods. Our work opens up new possibilities for modeling\ncomplex interactions in various domains, such as robotics, graphics and\ncomputer vision.", "paper_summary_zh": "我們提出一個名為 COLLAGE 的新框架，透過利用大型語言模型 (LLM) 和分層動作特定向量量化變異自動編碼器 (VQ-VAE) 來產生協作主體-物件-主體互動。我們的模型透過整合 LLM 的知識和推理能力來引導生成擴散模型，來解決此領域中缺乏豐富資料集的問題。分層 VQ-VAE 架構在多個抽象層級中擷取不同的動作特定特徵，避免冗餘概念並啟用有效率的多解析度表示。我們引入一個在潛在空間中運作的擴散模型，並整合 LLM 生成的動作規劃提示來引導去噪程序，產生具有更高控制和多樣性的提示特定動作。在 CORE-4D 和 InterHuman 資料集上的實驗結果證明了我們的方法在產生真實且多樣化的協作人體-物件-人體互動方面的有效性，優於最先進的方法。我們的研究為在各種領域（例如機器人技術、圖形和電腦視覺）中建模複雜互動開啟了新的可能性。", "author": "Divyanshu Daiya et.al.", "authors": "Divyanshu Daiya, Damon Conover, Aniket Bera", "id": "2409.20502v1", "paper_url": "http://arxiv.org/abs/2409.20502v1", "repo": "null"}}