{"2501.08582": {"publish_time": "2025-01-15", "title": "LoRS: Efficient Low-Rank Adaptation for Sparse Large Language Model", "paper_summary": "Existing low-rank adaptation (LoRA) methods face challenges on sparse large\nlanguage models (LLMs) due to the inability to maintain sparsity. Recent works\nintroduced methods that maintain sparsity by augmenting LoRA techniques with\nadditional masking mechanisms. Despite these successes, such approaches suffer\nfrom an increased memory and computation overhead, which affects efficiency of\nLoRA methods. In response to this limitation, we introduce LoRS, an innovative\nmethod designed to achieve both memory and computation efficiency when\nfine-tuning sparse LLMs. To mitigate the substantial memory and computation\ndemands associated with preserving sparsity, our approach incorporates\nstrategies of weight recompute and computational graph rearrangement. In\naddition, we also improve the effectiveness of LoRS through better adapter\ninitialization. These innovations lead to a notable reduction in memory and\ncomputation consumption during the fine-tuning phase, all while achieving\nperformance levels that outperform existing LoRA approaches.", "paper_summary_zh": "現有的低秩適應 (LoRA) 方法由於無法維持稀疏性，在稀疏大型語言模型 (LLM) 上面臨挑戰。最近的作品引入了透過使用額外的遮罩機制來擴充 LoRA 技術的方法來維持稀疏性。儘管有這些成功，但這些方法會增加記憶體和運算的開銷，這會影響 LoRA 方法的效率。為了回應這個限制，我們引入了 LoRS，這是一種創新的方法，旨在在微調稀疏 LLM 時同時實現記憶體和運算效率。為了減輕與維持稀疏性相關的龐大記憶體和運算需求，我們的做法結合了權重重新計算和計算圖形重新排列的策略。此外，我們還透過更好的適配器初始化來提高 LoRS 的有效性。這些創新在微調階段顯著減少了記憶體和運算消耗，同時實現了優於現有 LoRA 方法的效能等級。", "author": "Yuxuan Hu et.al.", "authors": "Yuxuan Hu, Jing Zhang, Xiaodong Chen, Zhe Zhao, Cuiping Li, Hong Chen", "id": "2501.08582v1", "paper_url": "http://arxiv.org/abs/2501.08582v1", "repo": "null"}}