{"2407.06779": {"publish_time": "2024-07-09", "title": "Using Pretrained Large Language Model with Prompt Engineering to Answer Biomedical Questions", "paper_summary": "Our team participated in the BioASQ 2024 Task12b and Synergy tasks to build a\nsystem that can answer biomedical questions by retrieving relevant articles and\nsnippets from the PubMed database and generating exact and ideal answers. We\npropose a two-level information retrieval and question-answering system based\non pre-trained large language models (LLM), focused on LLM prompt engineering\nand response post-processing. We construct prompts with in-context few-shot\nexamples and utilize post-processing techniques like resampling and malformed\nresponse detection. We compare the performance of various pre-trained LLM\nmodels on this challenge, including Mixtral, OpenAI GPT and Llama2. Our\nbest-performing system achieved 0.14 MAP score on document retrieval, 0.05 MAP\nscore on snippet retrieval, 0.96 F1 score for yes/no questions, 0.38 MRR score\nfor factoid questions and 0.50 F1 score for list questions in Task 12b.", "paper_summary_zh": "我們的團隊參與了 BioASQ 2024 Task12b 和 Synergy 任務，建立一個系統，透過擷取 PubMed 資料庫中的相關文章和摘要，並產生精確且理想的答案，來回答生物醫學問題。我們提出一個基於預先訓練的大語言模型 (LLM) 的雙層資訊檢索和問答系統，專注於 LLM 提示工程和回應後處理。我們使用脈絡中的少次範例來建構提示，並利用重新取樣和畸形回應偵測等後處理技術。我們比較各種預先訓練的 LLM 模型在這個挑戰中的效能，包括 Mixtral、OpenAI GPT 和 Llama2。我們效能最佳的系統在文件檢索中達到 0.14 MAP 分數，在摘要檢索中達到 0.05 MAP 分數，在是非題中達到 0.96 F1 分數，在事實題中達到 0.38 MRR 分數，在 Task 12b 的列表題中達到 0.50 F1 分數。", "author": "Wenxin Zhou et.al.", "authors": "Wenxin Zhou, Thuy Hang Ngo", "id": "2407.06779v1", "paper_url": "http://arxiv.org/abs/2407.06779v1", "repo": "null"}}