{"2410.08068": {"publish_time": "2024-10-10", "title": "Teaching-Inspired Integrated Prompting Framework: A Novel Approach for Enhancing Reasoning in Large Language Models", "paper_summary": "Large Language Models (LLMs) exhibit impressive performance across various\ndomains but still struggle with arithmetic reasoning tasks. Recent work shows\nthe effectiveness of prompt design methods in enhancing reasoning capabilities.\nHowever, these approaches overlook crucial requirements for prior knowledge of\nspecific concepts, theorems, and tricks to tackle most arithmetic reasoning\nproblems successfully. To address this issue, we propose a novel and effective\nTeaching-Inspired Integrated Framework, which emulates the instructional\nprocess of a teacher guiding students. This method equips LLMs with essential\nconcepts, relevant theorems, and similar problems with analogous solution\napproaches, facilitating the enhancement of reasoning abilities. Additionally,\nwe introduce two new Chinese datasets, MathMC and MathToF, both with detailed\nexplanations and answers. Experiments are conducted on nine benchmarks which\ndemonstrates that our approach improves the reasoning accuracy of LLMs. With\nGPT-4 and our framework, we achieve new state-of-the-art performance on four\nmath benchmarks (AddSub, SVAMP, Math23K and AQuA) with accuracies of 98.2%\n(+3.3%), 93.9% (+0.2%), 94.3% (+7.2%) and 81.1% (+1.2%). Our data and code are\navailable at https://github.com/SallyTan13/Teaching-Inspired-Prompting.", "paper_summary_zh": "大型語言模型 (LLM) 在各種領域展現出令人印象深刻的表現，但在算術推理任務中仍有困難。最近的研究顯示，提示設計方法在增強推理能力方面很有效。然而，這些方法忽略了對特定概念、定理和技巧的先備知識，這些知識對於成功解決大多數算術推理問題至關重要。為了解決這個問題，我們提出了一個新穎且有效的教學靈感整合框架，模擬老師指導學生的教學過程。此方法為 LLM 提供了必要的概念、相關定理和類似問題，以及類似的解決方法，有助於增強推理能力。此外，我們還介紹了兩個新的中文資料集 MathMC 和 MathToF，它們都提供了詳細的解釋和答案。在九個基準上進行了實驗，結果表明我們的做法提高了 LLM 的推理準確度。透過 GPT-4 和我們的框架，我們在四個數學基準 (AddSub、SVAMP、Math23K 和 AQuA) 上達到了新的最先進性能，準確度分別為 98.2% (+3.3%)、93.9% (+0.2%)、94.3% (+7.2%) 和 81.1% (+1.2%)。我們的資料和程式碼可在 https://github.com/SallyTan13/Teaching-Inspired-Prompting 取得。", "author": "Wenting Tan et.al.", "authors": "Wenting Tan, Dongxiao Chen, Jieting Xue, Zihao Wang, Taijie Chen", "id": "2410.08068v1", "paper_url": "http://arxiv.org/abs/2410.08068v1", "repo": "https://github.com/sallytan13/teaching-inspired-prompting"}}