{"2406.13844": {"publish_time": "2024-06-19", "title": "MAMA-MIA: A Large-Scale Multi-Center Breast Cancer DCE-MRI Benchmark Dataset with Expert Segmentations", "paper_summary": "Current research in breast cancer Magnetic Resonance Imaging (MRI),\nespecially with Artificial Intelligence (AI), faces challenges due to the lack\nof expert segmentations. To address this, we introduce the MAMA-MIA dataset,\ncomprising 1506 multi-center dynamic contrast-enhanced MRI cases with expert\nsegmentations of primary tumors and non-mass enhancement areas. These cases\nwere sourced from four publicly available collections in The Cancer Imaging\nArchive (TCIA). Initially, we trained a deep learning model to automatically\nsegment the cases, generating preliminary segmentations that significantly\nreduced expert segmentation time. Sixteen experts, averaging 9 years of\nexperience in breast cancer, then corrected these segmentations, resulting in\nthe final expert segmentations. Additionally, two radiologists conducted a\nvisual inspection of the automatic segmentations to support future quality\ncontrol studies. Alongside the expert segmentations, we provide 49 harmonized\ndemographic and clinical variables and the pretrained weights of the well-known\nnnUNet architecture trained using the DCE-MRI full-images and expert\nsegmentations. This dataset aims to accelerate the development and benchmarking\nof deep learning models and foster innovation in breast cancer diagnostics and\ntreatment planning.", "paper_summary_zh": "乳腺癌磁共振成像 (MRI) 的現今研究，特別是與人工智慧 (AI) 相關的研究，由於缺乏專家分段而面臨挑戰。為了解決此問題，我們引入了 MAMA-MIA 資料集，其中包含 1506 例多中心動態對比增強 MRI 案例，以及原發腫瘤和非腫塊增強區域的專家分段。這些案例來自癌症影像檔案館 (TCIA) 中的四個公開可取得的集合。最初，我們訓練了一個深度學習模型來自動分段案例，產生初步分段，大幅減少了專家分段時間。16 位專家，平均擁有 9 年乳腺癌經驗，然後修正這些分段，產生最終的專家分段。此外，兩位放射科醫師對自動分段進行視覺檢查，以支援未來的品質控管研究。除了專家分段外，我們還提供了 49 個調和的人口統計和臨床變數，以及使用 DCE-MRI 全影像和專家分段訓練的著名 nnUNet 架構的預訓練權重。此資料集旨在加速深度學習模型的開發和基準測試，並促進乳腺癌診斷和治療計畫的創新。", "author": "Lidia Garrucho et.al.", "authors": "Lidia Garrucho, Claire-Anne Reidel, Kaisar Kushibar, Smriti Joshi, Richard Osuala, Apostolia Tsirikoglou, Maciej Bobowicz, Javier del Riego, Alessandro Catanese, Katarzyna Gwoździewicz, Maria-Laura Cosaka, Pasant M. Abo-Elhoda, Sara W. Tantawy, Shorouq S. Sakrana, Norhan O. Shawky-Abdelfatah, Amr Muhammad Abdo-Salem, Androniki Kozana, Eugen Divjak, Gordana Ivanac, Katerina Nikiforaki, Michail E. Klontzas, Rosa García-Dosdá, Meltem Gulsun-Akpinar, Oğuz Lafcı, Ritse Mann, Carlos Martín-Isla, Fred Prior, Kostas Marias, Martijn P. A. Starmans, Fredrik Strand, Oliver Díaz, Laura Igual, Karim Lekadir", "id": "2406.13844v1", "paper_url": "http://arxiv.org/abs/2406.13844v1", "repo": "https://github.com/lidiagarrucho/mama-mia"}}