{"2501.14474": {"publish_time": "2025-01-24", "title": "The Pseudo-Dimension of Contracts", "paper_summary": "Algorithmic contract design studies scenarios where a principal incentivizes\nan agent to exert effort on her behalf. In this work, we focus on settings\nwhere the agent's type is drawn from an unknown distribution, and formalize an\noffline learning framework for learning near-optimal contracts from sample\nagent types. A central tool in our analysis is the notion of pseudo-dimension\nfrom statistical learning theory. Beyond its role in establishing upper bounds\non the sample complexity, pseudo-dimension measures the intrinsic complexity of\na class of contracts, offering a new perspective on the tradeoffs between\nsimplicity and optimality in contract design. Our main results provide\nessentially optimal tradeoffs between pseudo-dimension and representation error\n(defined as the loss in principal's utility) with respect to linear and bounded\ncontracts. Using these tradeoffs, we derive sample- and time-efficient learning\nalgorithms, and demonstrate their near-optimality by providing almost matching\nlower bounds on the sample complexity. Conversely, for unbounded contracts, we\nprove an impossibility result showing that no learning algorithm exists.\n  Finally, we extend our techniques in three important ways. First, we provide\nrefined pseudo-dimension and sample complexity guarantees for the combinatorial\nactions model, revealing a novel connection between the number of critical\nvalues and sample complexity. Second, we extend our results to menus of\ncontracts, showing that their pseudo-dimension scales linearly with the menu\nsize. Third, we adapt our algorithms to the online learning setting, where we\nshow that, a polynomial number of type samples suffice to learn near-optimal\nbounded contracts. Combined with prior work, this establishes a formal\nseparation between expert advice and bandit feedback for this setting.", "paper_summary_zh": "<paragraph>演算法合約設計研究場景，其中委託人激勵代理人為其付出努力。在這項工作中，我們專注於代理人的類型從未知分佈中抽出的設定，並形式化一個離線學習架構，以從樣本代理人類型中學習近乎最佳的合約。我們分析中的核心工具是統計學習理論中的偽維度概念。除了在建立樣本複雜度上限中的作用外，偽維度還測量了一類合約的內在複雜度，為合約設計中簡潔性和最佳性之間的權衡提供了新的觀點。我們的成果在偽維度和表示誤差（定義為委託人效用的損失）之間提供了本質上最佳的權衡，相對於線性和有界合約。利用這些權衡，我們推導出樣本和時間效率的學習演算法，並透過提供幾乎匹配樣本複雜度下限來證明它們的近乎最佳性。相反地，對於無界合約，我們證明了一個不可能的結果，表明不存在學習演算法。最後，我們以三種重要方式擴展了我們的技術。首先，我們為組合動作模型提供了精確的偽維度和樣本複雜度保證，揭示了臨界值數量和樣本複雜度之間的新穎關聯。其次，我們將我們的結果擴展到合約選單，表明它們的偽維度與選單大小成線性比例。第三，我們將我們的演算法調整到線上學習設定，在其中我們表明，多項式的類型樣本數量足以學習近乎最佳的有界合約。結合先前的研究，這為此設定的專家建議和多臂老虎機回饋建立了一個正式的分離。</paragraph>", "author": "Paul Duetting et.al.", "authors": "Paul Duetting, Michal Feldman, Tomasz Ponitka, Ermis Soumalias", "id": "2501.14474v1", "paper_url": "http://arxiv.org/abs/2501.14474v1", "repo": "null"}}