{"2408.14811": {"publish_time": "2024-08-27", "title": "Brain-inspired Artificial Intelligence: A Comprehensive Review", "paper_summary": "Current artificial intelligence (AI) models often focus on enhancing\nperformance through meticulous parameter tuning and optimization techniques.\nHowever, the fundamental design principles behind these models receive\ncomparatively less attention, which can limit our understanding of their\npotential and constraints. This comprehensive review explores the diverse\ndesign inspirations that have shaped modern AI models, i.e., brain-inspired\nartificial intelligence (BIAI). We present a classification framework that\ncategorizes BIAI approaches into physical structure-inspired and human\nbehavior-inspired models. We also examine the real-world applications where\ndifferent BIAI models excel, highlighting their practical benefits and\ndeployment challenges. By delving into these areas, we provide new insights and\npropose future research directions to drive innovation and address current gaps\nin the field. This review offers researchers and practitioners a comprehensive\noverview of the BIAI landscape, helping them harness its potential and expedite\nadvancements in AI development.", "paper_summary_zh": "現今的人工智慧（AI）模型通常專注於透過細緻的參數調整和最佳化技術來提升效能。然而，這些模型背後的基礎設計原則卻較少受到重視，這可能會限制我們對其潛力和限制的理解。這份全面的評論探討了塑造現代 AI 模型的多元設計靈感，亦即大腦啟發的人工智慧（BIAI）。我們提出了一個分類架構，將 BIAI 方法分類為受物理結構啟發的模型和受人類行為啟發的模型。我們也檢視了不同 BIAI 模型在現實世界應用中的優點，強調其實際效益和部署挑戰。透過深入探討這些領域，我們提供了新的見解，並提出未來的研究方向，以推動創新並解決該領域目前的差距。這份評論為研究人員和從業人員提供了 BIAI 領域的全面概觀，協助他們發揮其潛力並加速 AI 開發的進展。", "author": "Jing Ren et.al.", "authors": "Jing Ren, Feng Xia", "id": "2408.14811v1", "paper_url": "http://arxiv.org/abs/2408.14811v1", "repo": "null"}}