{"2406.02450": {"publish_time": "2024-06-04", "title": "A Generalized Apprenticeship Learning Framework for Modeling Heterogeneous Student Pedagogical Strategies", "paper_summary": "A key challenge in e-learning environments like Intelligent Tutoring Systems\n(ITSs) is to induce effective pedagogical policies efficiently. While Deep\nReinforcement Learning (DRL) often suffers from sample inefficiency and reward\nfunction design difficulty, Apprenticeship Learning(AL) algorithms can overcome\nthem. However, most AL algorithms can not handle heterogeneity as they assume\nall demonstrations are generated with a homogeneous policy driven by a single\nreward function. Still, some AL algorithms which consider heterogeneity, often\ncan not generalize to large continuous state space and only work with discrete\nstates. In this paper, we propose an expectation-maximization(EM)-EDM, a\ngeneral AL framework to induce effective pedagogical policies from given\noptimal or near-optimal demonstrations, which are assumed to be driven by\nheterogeneous reward functions. We compare the effectiveness of the policies\ninduced by our proposed EM-EDM against four AL-based baselines and two policies\ninduced by DRL on two different but related tasks that involve pedagogical\naction prediction. Our overall results showed that, for both tasks, EM-EDM\noutperforms the four AL baselines across all performance metrics and the two\nDRL baselines. This suggests that EM-EDM can effectively model complex student\npedagogical decision-making processes through the ability to manage a large,\ncontinuous state space and adapt to handle diverse and heterogeneous reward\nfunctions with very few given demonstrations.", "paper_summary_zh": "在電子學習環境（例如智慧型教學系統 (ITS)) 中，一個關鍵挑戰是有效率地誘導出有效的教學政策。雖然深度強化學習 (DRL) 經常會遇到樣本效率低落和獎勵函數設計困難的問題，但學徒學習 (AL) 演算法可以克服這些問題。不過，大多數 AL 演算法無法處理異質性，因為它們假設所有示範都是由單一獎勵函數驅動的同質政策所產生。儘管如此，某些考慮異質性的 AL 演算法，通常無法廣泛應用於大型連續狀態空間，而且只能用於離散狀態。在本文中，我們提出一個期望最大化 (EM)-EDM，一個通用的 AL 架構，用於從給定的最佳或近乎最佳示範中誘導出有效的教學政策，這些示範假設是由異質獎勵函數驅動。我們比較了由我們提出的 EM-EDM 所誘導出的政策的有效性，與四個基於 AL 的基準和兩個由 DRL 誘導出的政策，這些政策涉及教學動作預測的兩個不同但相關的任務。我們的整體結果顯示，對於這兩個任務，EM-EDM 在所有效能指標上都優於四個 AL 基準和兩個 DRL 基準。這表示 EM-EDM 可以透過管理一個大型連續狀態空間，並適應處理具有非常少給定示範的多元且異質的獎勵函數，來有效地模擬複雜的學生教學決策制定過程。", "author": "Md Mirajul Islam et.al.", "authors": "Md Mirajul Islam, Xi Yang, John Hostetter, Adittya Soukarjya Saha, Min Chi", "id": "2406.02450v1", "paper_url": "http://arxiv.org/abs/2406.02450v1", "repo": "null"}}