{"2410.16156": {"publish_time": "2024-10-21", "title": "Limpeh ga li gong: Challenges in Singlish Annotations", "paper_summary": "Singlish, or Colloquial Singapore English, is a language formed from oral and\nsocial communication within multicultural Singapore. In this work, we work on a\nfundamental Natural Language Processing (NLP) task: Parts-Of-Speech (POS)\ntagging of Singlish sentences. For our analysis, we build a parallel Singlish\ndataset containing direct English translations and POS tags, with translation\nand POS annotation done by native Singlish speakers. Our experiments show that\nautomatic transition- and transformer- based taggers perform with only $\\sim\n80\\%$ accuracy when evaluated against human-annotated POS labels, suggesting\nthat there is indeed room for improvement on computation analysis of the\nlanguage. We provide an exposition of challenges in Singlish annotation: its\ninconsistencies in form and semantics, the highly context-dependent particles\nof the language, its structural unique expressions, and the variation of the\nlanguage on different mediums. Our task definition, resultant labels and\nresults reflects the challenges in analysing colloquial languages formulated\nfrom a variety of dialects, and paves the way for future studies beyond POS\ntagging.", "paper_summary_zh": "新加坡式英語，又稱新加坡口語英語，是一種在新加坡多元文化社會中由口頭和社交溝通形成的語言。在這項工作中，我們從事一項基本的自然語言處理 (NLP) 任務：新加坡式英語句子的詞性標記 (POS)。對於我們的分析，我們建立了一個平行的新加坡式英語數據集，其中包含直接的英文翻譯和詞性標記，翻譯和詞性標記是由新加坡式英語母語人士完成的。我們的實驗表明，在根據人工標記的詞性標籤進行評估時，基於自動轉換和變換器的標記器僅能執行約 80% 的準確度，這表明語言的計算分析確實有改進的空間。我們闡述了新加坡式英語標記中的挑戰：其形式和語義的不一致性、高度依賴於語境的語言粒子、其結構獨特的表達方式以及語言在不同媒介上的變化。我們的任務定義、結果標籤和結果反映了分析由各種方言構成的口語語言的挑戰，並為超越詞性標記的未來研究鋪平了道路。", "author": "Lynnette Hui Xian Ng et.al.", "authors": "Lynnette Hui Xian Ng, Luo Qi Chan", "id": "2410.16156v1", "paper_url": "http://arxiv.org/abs/2410.16156v1", "repo": "null"}}