{"2404.07239": {"publish_time": "2024-04-09", "title": "Advancements in Radiomics and Artificial Intelligence for Thyroid Cancer Diagnosis", "paper_summary": "Thyroid cancer is an increasing global health concern that requires advanced\ndiagnostic methods. The application of AI and radiomics to thyroid cancer\ndiagnosis is examined in this review. A review of multiple databases was\nconducted in compliance with PRISMA guidelines until October 2023. A\ncombination of keywords led to the discovery of an English academic publication\non thyroid cancer and related subjects. 267 papers were returned from the\noriginal search after 109 duplicates were removed. Relevant studies were\nselected according to predetermined criteria after 124 articles were eliminated\nbased on an examination of their abstract and title. After the comprehensive\nanalysis, an additional six studies were excluded. Among the 28 included\nstudies, radiomics analysis, which incorporates ultrasound (US) images,\ndemonstrated its effectiveness in diagnosing thyroid cancer. Various results\nwere noted, some of the studies presenting new strategies that outperformed the\nstatus quo. The literature has emphasized various challenges faced by AI\nmodels, including interpretability issues, dataset constraints, and operator\ndependence. The synthesized findings of the 28 included studies mentioned the\nneed for standardization efforts and prospective multicenter studies to address\nthese concerns. Furthermore, approaches to overcome these obstacles were\nidentified, such as advances in explainable AI technology and personalized\nmedicine techniques. The review focuses on how AI and radiomics could transform\nthe diagnosis and treatment of thyroid cancer. Despite challenges, future\nresearch on multidisciplinary cooperation, clinical applicability validation,\nand algorithm improvement holds the potential to improve patient outcomes and\ndiagnostic precision in the treatment of thyroid cancer.", "paper_summary_zh": "", "author": "Milad Yousefi et.al.", "authors": "Milad Yousefi,Shadi Farabi Maleki,Ali Jafarizadeh,Mahya Ahmadpour Youshanlui,Aida Jafari,Siamak Pedrammehr,Roohallah Alizadehsani,Ryszard Tadeusiewicz,Pawel Plawiak", "id": "2404.07239v1", "paper_url": "http://arxiv.org/abs/2404.07239v1", "repo": "null"}}