{"2406.02888": {"publish_time": "2024-06-05", "title": "HYDRA: Model Factorization Framework for Black-Box LLM Personalization", "paper_summary": "Personalization has emerged as a critical research area in modern intelligent\nsystems, focusing on mining users' behavioral history and adapting to their\npreferences for delivering tailored experiences. Despite the remarkable\nfew-shot capabilities exhibited by black-box large language models (LLMs), the\ninherent opacity of their model parameters presents significant challenges in\naligning the generated output with individual expectations. Existing solutions\nhave primarily focused on prompt design to incorporate user-specific profiles\nand behaviors; however, such approaches often struggle to generalize\neffectively due to their inability to capture shared knowledge among all users.\nTo address these challenges, we propose HYDRA, a model factorization framework\nthat captures both user-specific behavior patterns from historical data and\nshared general knowledge among all users to deliver personalized generation. In\norder to capture user-specific behavior patterns, we first train a reranker to\nprioritize the most useful information from top-retrieved relevant historical\nrecords. By combining the prioritized history with the corresponding query, we\ntrain an adapter to align the output with individual user-specific preferences,\neliminating the reliance on access to inherent model parameters of black-box\nLLMs. Both the reranker and the adapter can be decomposed into a base model\nwith multiple user-specific heads, resembling a hydra. The base model maintains\nshared knowledge across users, while the multiple personal heads capture\nuser-specific preferences. Experimental results demonstrate that HYDRA\noutperforms existing state-of-the-art prompt-based methods by an average\nrelative improvement of 9.01% across five diverse personalization tasks in the\nLaMP benchmark. Our implementation is available at\nhttps://github.com/night-chen/HYDRA.", "paper_summary_zh": "<paragraph>個人化已成為現代智慧系統中一項重要的研究領域，專注於挖掘使用者的行為歷史，並根據其偏好提供客製化體驗。儘管黑盒子大型語言模型 (LLM) 展現出非凡的少量次數能力，但其模型參數固有的不透明性在將產生的輸出與個別期望相符時，帶來重大挑戰。現有的解決方案主要專注於提示設計，以納入使用者特定的個人資料和行為；然而，此類方法由於無法擷取所有使用者之間的共用知識，因此通常難以有效概化。為了應對這些挑戰，我們提出 HYDRA，這是一個模型分解架構，可從歷史資料中擷取使用者特定的行為模式，並在所有使用者之間共用一般知識，以提供個人化生成。為了擷取使用者特定的行為模式，我們首先訓練一個重新排名器，以優先處理從頂端擷取到的相關歷史記錄中最有用的資訊。透過將優先排序的歷史記錄與對應的查詢相結合，我們訓練一個適配器，以將輸出與個別使用者的特定偏好相符，無需依賴存取黑盒子 LLM 的固有模型參數。重新排名器和適配器都可以分解成一個具有多個使用者特定主體的基礎模型，類似於九頭蛇。基礎模型維護使用者之間的共用知識，而多個個人主體則擷取使用者特定的偏好。實驗結果顯示，在 LaMP 基準中的五項不同的個人化任務中，HYDRA 的表現優於現有的最先進提示式方法，平均相對改善幅度為 9.01%。我們的實作可在 https://github.com/night-chen/HYDRA 取得。</paragraph>", "author": "Yuchen Zhuang et.al.", "authors": "Yuchen Zhuang, Haotian Sun, Yue Yu, Qifan Wang, Chao Zhang, Bo Dai", "id": "2406.02888v1", "paper_url": "http://arxiv.org/abs/2406.02888v1", "repo": "null"}}