{"2410.07763": {"publish_time": "2024-10-10", "title": "HARIVO: Harnessing Text-to-Image Models for Video Generation", "paper_summary": "We present a method to create diffusion-based video models from pretrained\nText-to-Image (T2I) models. Recently, AnimateDiff proposed freezing the T2I\nmodel while only training temporal layers. We advance this method by proposing\na unique architecture, incorporating a mapping network and frame-wise tokens,\ntailored for video generation while maintaining the diversity and creativity of\nthe original T2I model. Key innovations include novel loss functions for\ntemporal smoothness and a mitigating gradient sampling technique, ensuring\nrealistic and temporally consistent video generation despite limited public\nvideo data. We have successfully integrated video-specific inductive biases\ninto the architecture and loss functions. Our method, built on the frozen\nStableDiffusion model, simplifies training processes and allows for seamless\nintegration with off-the-shelf models like ControlNet and DreamBooth. project\npage: https://kwonminki.github.io/HARIVO", "paper_summary_zh": "我們提出一個方法，可以從預訓練的文字轉圖像 (T2I) 模型中建立基於擴散的影片模型。最近，AnimateDiff 提議凍結 T2I 模型，同時僅訓練時間層。我們透過提出一個獨特的架構來推進此方法，結合一個對應網路和逐幀代幣，專門用於影片生成，同時維持原始 T2I 模型的多樣性和創造力。關鍵創新包括時間平滑度的新損失函數和緩解梯度取樣技術，確保逼真且時間一致的影片生成，儘管受限於公開影片資料。我們已成功將影片特定的歸納偏差整合到架構和損失函數中。我們的模型建立在凍結的 StableDiffusion 模型上，簡化了訓練流程，並允許與 ControlNet 和 DreamBooth 等現成模型無縫整合。專案頁面：https://kwonminki.github.io/HARIVO", "author": "Mingi Kwon et.al.", "authors": "Mingi Kwon, Seoung Wug Oh, Yang Zhou, Difan Liu, Joon-Young Lee, Haoran Cai, Baqiao Liu, Feng Liu, Youngjung Uh", "id": "2410.07763v1", "paper_url": "http://arxiv.org/abs/2410.07763v1", "repo": "null"}}