{"2501.01691": {"publish_time": "2025-01-03", "title": "VidFormer: A novel end-to-end framework fused by 3DCNN and Transformer for Video-based Remote Physiological Measurement", "paper_summary": "Remote physiological signal measurement based on facial videos, also known as\nremote photoplethysmography (rPPG), involves predicting changes in facial\nvascular blood flow from facial videos. While most deep learning-based methods\nhave achieved good results, they often struggle to balance performance across\nsmall and large-scale datasets due to the inherent limitations of convolutional\nneural networks (CNNs) and Transformer. In this paper, we introduce VidFormer,\na novel end-to-end framework that integrates 3-Dimension Convolutional Neural\nNetwork (3DCNN) and Transformer models for rPPG tasks. Initially, we conduct an\nanalysis of the traditional skin reflection model and subsequently introduce an\nenhanced model for the reconstruction of rPPG signals. Based on this improved\nmodel, VidFormer utilizes 3DCNN and Transformer to extract local and global\nfeatures from input data, respectively. To enhance the spatiotemporal feature\nextraction capabilities of VidFormer, we incorporate temporal-spatial attention\nmechanisms tailored for both 3DCNN and Transformer. Additionally, we design a\nmodule to facilitate information exchange and fusion between the 3DCNN and\nTransformer. Our evaluation on five publicly available datasets demonstrates\nthat VidFormer outperforms current state-of-the-art (SOTA) methods. Finally, we\ndiscuss the essential roles of each VidFormer module and examine the effects of\nethnicity, makeup, and exercise on its performance.", "paper_summary_zh": "基於面部影片的遠端生理訊號測量，也稱為遠端光電容積描記法 (rPPG)，涉及從面部影片預測面部血管血流的變化。雖然大多數基於深度學習的方法都獲得了良好的結果，但由於卷積神經網路 (CNN) 和 Transformer 的固有限制，它們通常難以平衡小規模和大型資料集的效能。在本文中，我們介紹 VidFormer，這是一個整合 3D 卷積神經網路 (3DCNN) 和 Transformer 模型以進行 rPPG 任務的新型端對端架構。最初，我們對傳統的皮膚反射模型進行分析，隨後引入一個增強模型來重建 rPPG 訊號。基於這個改進的模型，VidFormer 分別利用 3DCNN 和 Transformer 從輸入資料中提取局部和全域特徵。為了增強 VidFormer 的時空特徵提取能力，我們結合了專門針對 3DCNN 和 Transformer 設計的時空注意力機制。此外，我們設計了一個模組來促進 3DCNN 和 Transformer 之間的資訊交換和融合。我們對五個公開可用的資料集的評估表明，VidFormer 優於目前的最新技術 (SOTA) 方法。最後，我們討論了 VidFormer 各個模組的基本作用，並探討了種族、化妝和運動對其效能的影響。", "author": "Jiachen Li et.al.", "authors": "Jiachen Li, Shisheng Guo, Longzhen Tang, Cuolong Cui, Lingjiang Kong, Xiaobo Yang", "id": "2501.01691v1", "paper_url": "http://arxiv.org/abs/2501.01691v1", "repo": "null"}}