{"2501.18280": {"publish_time": "2025-01-30", "title": "Jailbreaking LLMs' Safeguard with Universal Magic Words for Text Embedding Models", "paper_summary": "The security issue of large language models (LLMs) has gained significant\nattention recently, with various defense mechanisms developed to prevent\nharmful outputs, among which safeguards based on text embedding models serve as\na fundamental defense. Through testing, we discover that the distribution of\ntext embedding model outputs is significantly biased with a large mean.\nInspired by this observation, we propose novel efficient methods to search for\nuniversal magic words that can attack text embedding models. The universal\nmagic words as suffixes can move the embedding of any text towards the bias\ndirection, therefore manipulate the similarity of any text pair and mislead\nsafeguards. By appending magic words to user prompts and requiring LLMs to end\nanswers with magic words, attackers can jailbreak the safeguard. To eradicate\nthis security risk, we also propose defense mechanisms against such attacks,\nwhich can correct the biased distribution of text embeddings in a train-free\nmanner.", "paper_summary_zh": "大型語言模型 (LLM) 的安全性問題最近受到廣泛關注，並開發了各種防禦機制來防止有害輸出，其中基於文字內嵌模型的防護措施作為基本防禦。透過測試，我們發現文字內嵌模型輸出的分佈顯著偏向於大平均值。受此觀察啟發，我們提出創新的有效方法來搜尋可攻擊文字內嵌模型的通用魔術字詞。通用魔術字詞作為後綴，可以將任何文字的內嵌移向偏向方向，因此可以操縱任何文字對的相似度並誤導防護措施。攻擊者可以將魔術字詞附加到使用者提示，並要求 LLM 以魔術字詞結束答案，即可破解防護措施。為了消除此安全性風險，我們也提出針對此類攻擊的防禦機制，它可以在不需訓練的情況下修正文字內嵌的偏向分佈。", "author": "Haoyu Liang et.al.", "authors": "Haoyu Liang, Youran Sun, Yunfeng Cai, Jun Zhu, Bo Zhang", "id": "2501.18280v1", "paper_url": "http://arxiv.org/abs/2501.18280v1", "repo": "null"}}