{"2411.11072": {"publish_time": "2024-11-17", "title": "Multilingual Large Language Models: A Systematic Survey", "paper_summary": "This paper provides a comprehensive survey of the latest research on\nmultilingual large language models (MLLMs). MLLMs not only are able to\nunderstand and generate language across linguistic boundaries, but also\nrepresent an important advancement in artificial intelligence. We first discuss\nthe architecture and pre-training objectives of MLLMs, highlighting the key\ncomponents and methodologies that contribute to their multilingual\ncapabilities. We then discuss the construction of multilingual pre-training and\nalignment datasets, underscoring the importance of data quality and diversity\nin enhancing MLLM performance. An important focus of this survey is on the\nevaluation of MLLMs. We present a detailed taxonomy and roadmap covering the\nassessment of MLLMs' cross-lingual knowledge, reasoning, alignment with human\nvalues, safety, interpretability and specialized applications. Specifically, we\nextensively discuss multilingual evaluation benchmarks and datasets, and\nexplore the use of LLMs themselves as multilingual evaluators. To enhance MLLMs\nfrom black to white boxes, we also address the interpretability of multilingual\ncapabilities, cross-lingual transfer and language bias within these models.\nFinally, we provide a comprehensive review of real-world applications of MLLMs\nacross diverse domains, including biology, medicine, computer science,\nmathematics and law. We showcase how these models have driven innovation and\nimprovements in these specialized fields while also highlighting the challenges\nand opportunities in deploying MLLMs within diverse language communities and\napplication scenarios.We listed the paper related in this survey and publicly\navailable at https://github.com/tjunlp-lab/Awesome-Multilingual-LLMs-Papers .", "paper_summary_zh": "<paragraph>這篇論文提供了多語言大型語言模型（MLLM）最新研究的全面調查。MLLM 不僅能夠跨越語言界限理解和生成語言，而且還代表了人工智能的重要進展。我們首先討論 MLLM 的架構和預訓練目標，重點介紹有助於其多語言能力的關鍵組成部分和方法。然後，我們討論多語言預訓練和對齊資料集的建構，強調資料品質和多樣性在提升 MLLM 效能方面的重要性。本調查的一個重點是 MLLM 的評估。我們提出了涵蓋 MLLM 跨語言知識、推理、與人類價值觀的一致性、安全性、可解釋性和專業應用評估的詳細分類法和路線圖。具體來說，我們廣泛討論多語言評估基準和資料集，並探討將 LLM 本身用作多語言評估器的用途。為了將 MLLM 從黑盒子提升到白盒子，我們還探討了這些模型中多語言能力、跨語言轉移和語言偏見的可解釋性。最後，我們對 MLLM 在生物學、醫學、電腦科學、數學和法律等不同領域的實際應用進行了全面的回顧。我們展示了這些模型如何推動這些專業領域的創新和改進，同時也強調了在不同的語言社群和應用場景中部署 MLLM 的挑戰和機遇。我們列出了本調查中相關的論文，並在 https://github.com/tjunlp-lab/Awesome-Multilingual-LLMs-Papers 公開提供。</paragraph>", "author": "Shaolin Zhu et.al.", "authors": "Shaolin Zhu, Supryadi, Shaoyang Xu, Haoran Sun, Leiyu Pan, Menglong Cui, Jiangcun Du, Renren Jin, António Branco, Deyi Xiong", "id": "2411.11072v1", "paper_url": "http://arxiv.org/abs/2411.11072v1", "repo": "null"}}