{"2207.11290": {"publish_time": "2022-07-22", "title": "TRUST-LAPSE: An Explainable and Actionable Mistrust Scoring Framework for Model Monitoring", "paper_summary": "Continuous monitoring of trained ML models to determine when their\npredictions should and should not be trusted is essential for their safe\ndeployment. Such a framework ought to be high-performing, explainable, post-hoc\nand actionable. We propose TRUST-LAPSE, a \"mistrust\" scoring framework for\ncontinuous model monitoring. We assess the trustworthiness of each input\nsample's model prediction using a sequence of latent-space embeddings.\nSpecifically, (a) our latent-space mistrust score estimates mistrust using\ndistance metrics (Mahalanobis distance) and similarity metrics (cosine\nsimilarity) in the latent-space and (b) our sequential mistrust score\ndetermines deviations in correlations over the sequence of past input\nrepresentations in a non-parametric, sliding-window based algorithm for\nactionable continuous monitoring. We evaluate TRUST-LAPSE via two downstream\ntasks: (1) distributionally shifted input detection, and (2) data drift\ndetection. We evaluate across diverse domains - audio and vision using public\ndatasets and further benchmark our approach on challenging, real-world\nelectroencephalograms (EEG) datasets for seizure detection. Our latent-space\nmistrust scores achieve state-of-the-art results with AUROCs of 84.1 (vision),\n73.9 (audio), and 77.1 (clinical EEGs), outperforming baselines by over 10\npoints. We expose critical failures in popular baselines that remain\ninsensitive to input semantic content, rendering them unfit for real-world\nmodel monitoring. We show that our sequential mistrust scores achieve high\ndrift detection rates; over 90% of the streams show < 20% error for all\ndomains. Through extensive qualitative and quantitative evaluations, we show\nthat our mistrust scores are more robust and provide explainability for easy\nadoption into practice.", "paper_summary_zh": "<paragraph>持續監控已訓練的機器學習模型，以確定何時應信任和不應信任其預測，對於其安全部署至關重要。這樣的框架應具備高性能、可解釋性、事後性和可操作性。我們提出 TRUST-LAPSE，一個用於持續模型監控的「不信任」評分框架。我們使用一連串潛在空間嵌入來評估每個輸入樣本的模型預測的可信度。具體來說，(a) 我們的潛在空間不信任分數使用潛在空間中的距離度量（馬氏距離）和相似度量（餘弦相似度）來估計不信任，(b) 我們的順序不信任分數確定在非參數、基於滑動視窗演算法的過去輸入表示順序上相關性的偏差，用於可操作的持續監控。我們透過兩個下游任務評估 TRUST-LAPSE：(1) 分布式轉移輸入偵測，以及 (2) 資料漂移偵測。我們使用公開資料集評估各種領域（音訊和視覺），並進一步在具有挑戰性的真實世界腦電圖 (EEG) 資料集上評估我們的做法，以進行癲癇偵測。我們的潛在空間不信任分數獲得了最先進的結果，AUROC 分別為 84.1（視覺）、73.9（音訊）和 77.1（臨床 EEG），比基準高出 10 分以上。我們揭露了流行基準中關鍵的失敗，這些基準對輸入語義內容不敏感，使它們不適合於真實世界的模型監控。我們表明，我們的順序不信任分數達到了很高的漂移偵測率；在所有領域中，超過 90% 的串流顯示錯誤率 < 20%。透過廣泛的定性和定量評估，我們表明我們的信任分數更強大，並且提供了可解釋性，以便於實務採用。</paragraph>", "author": "Nandita Bhaskhar et.al.", "authors": "Nandita Bhaskhar, Daniel L. Rubin, Christopher Lee-Messer", "id": "2207.11290v2", "paper_url": "http://arxiv.org/abs/2207.11290v2", "repo": "https://github.com/nanbhas/trustlapse"}}