{"2411.13715": {"publish_time": "2024-11-20", "title": "SimPhony: A Device-Circuit-Architecture Cross-Layer Modeling and Simulation Framework for Heterogeneous Electronic-Photonic AI System", "paper_summary": "Electronic-photonic integrated circuits (EPICs) offer transformative\npotential for next-generation high-performance AI but require interdisciplinary\nadvances across devices, circuits, architecture, and design automation. The\ncomplexity of hybrid systems makes it challenging even for domain experts to\nunderstand distinct behaviors and interactions across design stack. The lack of\na flexible, accurate, fast, and easy-to-use EPIC AI system simulation framework\nsignificantly limits the exploration of hardware innovations and system\nevaluations on common benchmarks. To address this gap, we propose SimPhony, a\ncross-layer modeling and simulation framework for heterogeneous\nelectronic-photonic AI systems. SimPhony offers a platform that enables (1)\ngeneric, extensible hardware topology representation that supports\nheterogeneous multi-core architectures with diverse photonic tensor core\ndesigns; (2) optics-specific dataflow modeling with unique multi-dimensional\nparallelism and reuse beyond spatial/temporal dimensions; (3) data-aware energy\nmodeling with realistic device responses, layout-aware area estimation, link\nbudget analysis, and bandwidth-adaptive memory modeling; and (4) seamless\nintegration with model training framework for hardware/software co-simulation.\nBy providing a unified, versatile, and high-fidelity simulation platform,\nSimPhony enables researchers to innovate and evaluate EPIC AI hardware across\nmultiple domains, facilitating the next leap in emerging AI hardware. We\nopen-source our codes at https://github.com/ScopeX-ASU/SimPhony", "paper_summary_zh": "電子光子整合電路 (EPIC) 為次世代高效能人工智慧帶來轉型潛力，但需要在裝置、電路、架構和設計自動化方面跨領域進展。混合系統的複雜性讓即使是領域專家也很難理解設計堆疊中的不同行為和互動。缺乏一個靈活、精確、快速且易於使用的 EPIC 人工智慧系統模擬架構，大幅限制了對硬體創新和系統評估的探索。為了解決這個差距，我們提出 SimPhony，一個異質電子光子人工智慧系統的跨層建模和模擬架構。SimPhony 提供了一個平台，可以實現 (1) 支援異質多核心架構和多樣光子張量核心設計的通用、可擴充硬體拓撲表示；(2) 具有獨特多維度平行性和空間/時間維度之外的再利用的光學特定資料流建模；(3) 透過實際裝置反應、考量佈局的面積估計、鏈路預算分析和頻寬適應式記憶體建模來進行資料感知的能源建模；以及 (4) 與模型訓練架構無縫整合，以進行硬體/軟體協同模擬。透過提供一個統一、多功能且高保真度的模擬平台，SimPhony 能讓研究人員跨多個領域創新和評估 EPIC 人工智慧硬體，促進新興人工智慧硬體的下一步飛躍。我們的程式碼已在 https://github.com/ScopeX-ASU/SimPhony 開源。", "author": "Ziang Yin et.al.", "authors": "Ziang Yin, Meng Zhang, Amir Begovic, Rena Huang, Jeff Zhang, Jiaqi Gu", "id": "2411.13715v1", "paper_url": "http://arxiv.org/abs/2411.13715v1", "repo": "null"}}