{"2407.05682": {"publish_time": "2024-07-08", "title": "Retrieved In-Context Principles from Previous Mistakes", "paper_summary": "In-context learning (ICL) has been instrumental in adapting Large Language\nModels (LLMs) to downstream tasks using correct input-output examples. Recent\nadvances have attempted to improve model performance through principles derived\nfrom mistakes, yet these approaches suffer from lack of customization and\ninadequate error coverage. To address these limitations, we propose Retrieved\nIn-Context Principles (RICP), a novel teacher-student framework. In RICP, the\nteacher model analyzes mistakes from the student model to generate reasons and\ninsights for preventing similar mistakes. These mistakes are clustered based on\ntheir underlying reasons for developing task-level principles, enhancing the\nerror coverage of principles. During inference, the most relevant mistakes for\neach question are retrieved to create question-level principles, improving the\ncustomization of the provided guidance. RICP is orthogonal to existing\nprompting methods and does not require intervention from the teacher model\nduring inference. Experimental results across seven reasoning benchmarks reveal\nthat RICP effectively enhances performance when applied to various prompting\nstrategies.", "paper_summary_zh": "語境學習 (ICL) 一直是透過使用正確的輸入輸出範例，將大型語言模型 (LLM) 適應到下游任務的關鍵。最近的進展嘗試透過從錯誤中衍生的原則來改善模型效能，但這些方法缺乏自訂化，且錯誤涵蓋範圍不足。為了解決這些限制，我們提出檢索式語境原則 (RICP)，一種創新的師生架構。在 RICP 中，教師模型會分析學生的錯誤，以產生預防類似錯誤的原因和見解。這些錯誤會根據其根本原因進行分群，以發展任務層級的原則，進而擴展原則的錯誤涵蓋範圍。在推理期間，會檢索每個問題最相關的錯誤，以建立問題層級的原則，改善所提供指導的自訂化。RICP 與現有的提示方法正交，且在推理期間不需要教師模型的介入。跨越七個推理基準的實驗結果顯示，RICP 在應用於各種提示策略時，能有效提升效能。", "author": "Hao Sun et.al.", "authors": "Hao Sun, Yong Jiang, Bo Wang, Yingyan Hou, Yan Zhang, Pengjun Xie, Fei Huang", "id": "2407.05682v1", "paper_url": "http://arxiv.org/abs/2407.05682v1", "repo": "null"}}