{"2406.19215": {"publish_time": "2024-06-27", "title": "SeaKR: Self-aware Knowledge Retrieval for Adaptive Retrieval Augmented Generation", "paper_summary": "This paper introduces Self-aware Knowledge Retrieval (SeaKR), a novel\nadaptive RAG model that extracts self-aware uncertainty of LLMs from their\ninternal states. SeaKR activates retrieval when the LLMs present high\nself-aware uncertainty for generation. To effectively integrate retrieved\nknowledge snippets, SeaKR re-ranks them based on LLM's self-aware uncertainty\nto preserve the snippet that reduces their uncertainty to the utmost. To\nfacilitate solving complex tasks that require multiple retrievals, SeaKR\nutilizes their self-aware uncertainty to choose among different reasoning\nstrategies. Our experiments on both complex and simple Question Answering\ndatasets show that SeaKR outperforms existing adaptive RAG methods. We release\nour code at https://github.com/THU-KEG/SeaKR.", "paper_summary_zh": "本文介紹了自我感知知識檢索 (SeaKR)，這是一種新穎的自適應 RAG 模型，它從大型語言模型 (LLM) 的內部狀態中提取自我感知的不確定性。當 LLM 呈現出高自我感知的不確定性時，SeaKR 會啟動檢索以進行生成。為了有效整合檢索到的知識片段，SeaKR 會根據 LLM 的自我感知不確定性對它們進行重新排序，以保留最大程度降低其不確定性的片段。為了促進解決需要多重檢索的複雜任務，SeaKR 會利用其自我感知的不確定性在不同的推理策略中進行選擇。我們在複雜和簡單的問答資料集上的實驗表明，SeaKR 優於現有的自適應 RAG 方法。我們在 https://github.com/THU-KEG/SeaKR/ 上發布了我們的程式碼。", "author": "Zijun Yao et.al.", "authors": "Zijun Yao, Weijian Qi, Liangming Pan, Shulin Cao, Linmei Hu, Weichuan Liu, Lei Hou, Juanzi Li", "id": "2406.19215v1", "paper_url": "http://arxiv.org/abs/2406.19215v1", "repo": "https://github.com/thu-keg/seakr"}}