{"2406.12199": {"publish_time": "2024-06-18", "title": "Time Series Modeling for Heart Rate Prediction: From ARIMA to Transformers", "paper_summary": "Cardiovascular disease (CVD) is a leading cause of death globally,\nnecessitating precise forecasting models for monitoring vital signs like heart\nrate, blood pressure, and ECG. Traditional models, such as ARIMA and Prophet,\nare limited by their need for manual parameter tuning and challenges in\nhandling noisy, sparse, and highly variable medical data. This study\ninvestigates advanced deep learning models, including LSTM, and\ntransformer-based architectures, for predicting heart rate time series from the\nMIT-BIH Database. Results demonstrate that deep learning models, particularly\nPatchTST, significantly outperform traditional models across multiple metrics,\ncapturing complex patterns and dependencies more effectively. This research\nunderscores the potential of deep learning to enhance patient monitoring and\nCVD management, suggesting substantial clinical benefits. Future work should\nextend these findings to larger, more diverse datasets and real-world clinical\napplications to further validate and optimize model performance.", "paper_summary_zh": "心血管疾病 (CVD) 是全球主要的死亡原因，\n需要精確的預測模型來監測生命徵象，例如心率、血壓和心電圖。傳統模型，例如 ARIMA 和 Prophet，\n受到手動參數調整需求和處理有雜訊、稀疏且變化極大的醫療數據的挑戰所限制。這項研究\n探討進階深度學習模型，包括 LSTM，以及基於轉換器的架構，用於從\nMIT-BIH 資料庫預測心率時間序列。結果證明深度學習模型，特別是\nPatchTST，在多項指標上明顯優於傳統模型，更有效地擷取複雜模式和依賴關係。這項研究\n強調深度學習在增強患者監測和\nCVD 管理的潛力，並提出實質性的臨床益處。未來的研究應\n將這些發現擴展到更大、更多樣化的資料集和真實世界的臨床\n應用，以進一步驗證和最佳化模型效能。", "author": "Haowei Ni et.al.", "authors": "Haowei Ni, Shuchen Meng, Xieming Geng, Panfeng Li, Zhuoying Li, Xupeng Chen, Xiaotong Wang, Shiyao Zhang", "id": "2406.12199v2", "paper_url": "http://arxiv.org/abs/2406.12199v2", "repo": "null"}}