{"2406.17618": {"publish_time": "2024-06-25", "title": "Towards Building an End-to-End Multilingual Automatic Lyrics Transcription Model", "paper_summary": "Multilingual automatic lyrics transcription (ALT) is a challenging task due\nto the limited availability of labelled data and the challenges introduced by\nsinging, compared to multilingual automatic speech recognition. Although some\nmultilingual singing datasets have been released recently, English continues to\ndominate these collections. Multilingual ALT remains underexplored due to the\nscale of data and annotation quality. In this paper, we aim to create a\nmultilingual ALT system with available datasets. Inspired by architectures that\nhave been proven effective for English ALT, we adapt these techniques to the\nmultilingual scenario by expanding the target vocabulary set. We then evaluate\nthe performance of the multilingual model in comparison to its monolingual\ncounterparts. Additionally, we explore various conditioning methods to\nincorporate language information into the model. We apply analysis by language\nand combine it with the language classification performance. Our findings\nreveal that the multilingual model performs consistently better than the\nmonolingual models trained on the language subsets. Furthermore, we demonstrate\nthat incorporating language information significantly enhances performance.", "paper_summary_zh": "多語言自動歌詞轉錄 (ALT) 是一項具有挑戰性的任務，原因在於標籤資料的可用性有限，以及與多語言自動語音辨識相比，唱歌所帶來的挑戰。儘管最近已發布一些多語言歌唱資料集，但英語在這些資料集中仍佔主導地位。由於資料規模和標註品質，多語言 ALT 仍未被充分探索。在本文中，我們旨在使用現有資料集建立一個多語言 ALT 系統。受到已被證明對英語 ALT 有效的架構啟發，我們透過擴充目標詞彙集，將這些技術調整到多語言場景。然後，我們評估多語言模型的效能，並與其單語言對應模型進行比較。此外，我們探索各種條件化方法，以將語言資訊納入模型中。我們按語言進行分析，並將其與語言分類效能結合。我們的發現顯示，多語言模型的效能始終優於以語言子集訓練的單語言模型。此外，我們證明納入語言資訊可顯著提升效能。", "author": "Jiawen Huang et.al.", "authors": "Jiawen Huang, Emmanouil Benetos", "id": "2406.17618v1", "paper_url": "http://arxiv.org/abs/2406.17618v1", "repo": "null"}}