{"2412.04424": {"publish_time": "2024-12-05", "title": "Florence-VL: Enhancing Vision-Language Models with Generative Vision Encoder and Depth-Breadth Fusion", "paper_summary": "We present Florence-VL, a new family of multimodal large language models\n(MLLMs) with enriched visual representations produced by Florence-2, a\ngenerative vision foundation model. Unlike the widely used CLIP-style vision\ntransformer trained by contrastive learning, Florence-2 can capture different\nlevels and aspects of visual features, which are more versatile to be adapted\nto diverse downstream tasks. We propose a novel feature-fusion architecture and\nan innovative training recipe that effectively integrates Florence-2's visual\nfeatures into pretrained LLMs, such as Phi 3.5 and LLama 3. In particular, we\npropose \"depth-breath fusion (DBFusion)\" to fuse the visual features extracted\nfrom different depths and under multiple prompts. Our model training is\ncomposed of end-to-end pretraining of the whole model followed by finetuning of\nthe projection layer and the LLM, on a carefully designed recipe of diverse\nopen-source datasets that include high-quality image captions and\ninstruction-tuning pairs. Our quantitative analysis and visualization of\nFlorence-VL's visual features show its advantages over popular vision encoders\non vision-language alignment, where the enriched depth and breath play\nimportant roles. Florence-VL achieves significant improvements over existing\nstate-of-the-art MLLMs across various multi-modal and vision-centric benchmarks\ncovering general VQA, perception, hallucination, OCR, Chart,\nknowledge-intensive understanding, etc. To facilitate future research, our\nmodels and the complete training recipe are open-sourced.\nhttps://github.com/JiuhaiChen/Florence-VL", "paper_summary_zh": "<paragraph>我們提出了 Florence-VL，一個新的多模態大型語言模型 (MLLM) 家族，其豐富的視覺表徵是由 Florence-2，一個生成式視覺基礎模型所產生。與廣泛使用的 CLIP 風格視覺Transformer不同，由對比學習訓練而得，Florence-2 能擷取視覺特徵的不同層級和面向，更能適應多樣的下游任務。我們提出一個新穎的特徵融合架構和一個創新的訓練配方，有效地將 Florence-2 的視覺特徵整合到預訓練的 LLM，例如 Phi 3.5 和 LLama 3。特別是，我們提出「深度廣度融合 (DBFusion)」來融合從不同深度和多個提示中萃取的視覺特徵。我們的模型訓練由整個模型的端到端預訓練組成，接著是投影層和 LLM 的微調，使用精心設計的各種開源資料集配方，其中包括高品質的圖片標題和指令調整對。我們對 Florence-VL 視覺特徵的定量分析和視覺化顯示出它優於流行的視覺編碼器在視覺語言對齊上的優勢，其中豐富的深度和廣度扮演了重要的角色。Florence-VL 在現有的最先進 MLLM 上，在涵蓋一般 VQA、感知、幻覺、OCR、圖表、知識密集理解等的各種多模態和以視覺為中心的基準上，都取得了顯著的進步。為了促進未來的研究，我們的模型和完整的訓練配方都是開源的。\nhttps://github.com/JiuhaiChen/Florence-VL</paragraph>", "author": "Jiuhai Chen et.al.", "authors": "Jiuhai Chen, Jianwei Yang, Haiping Wu, Dianqi Li, Jianfeng Gao, Tianyi Zhou, Bin Xiao", "id": "2412.04424v1", "paper_url": "http://arxiv.org/abs/2412.04424v1", "repo": "null"}}