{"2409.06072": {"publish_time": "2024-09-09", "title": "DetoxBench: Benchmarking Large Language Models for Multitask Fraud & Abuse Detection", "paper_summary": "Large language models (LLMs) have demonstrated remarkable capabilities in\nnatural language processing tasks. However, their practical application in\nhigh-stake domains, such as fraud and abuse detection, remains an area that\nrequires further exploration. The existing applications often narrowly focus on\nspecific tasks like toxicity or hate speech detection. In this paper, we\npresent a comprehensive benchmark suite designed to assess the performance of\nLLMs in identifying and mitigating fraudulent and abusive language across\nvarious real-world scenarios. Our benchmark encompasses a diverse set of tasks,\nincluding detecting spam emails, hate speech, misogynistic language, and more.\nWe evaluated several state-of-the-art LLMs, including models from Anthropic,\nMistral AI, and the AI21 family, to provide a comprehensive assessment of their\ncapabilities in this critical domain. The results indicate that while LLMs\nexhibit proficient baseline performance in individual fraud and abuse detection\ntasks, their performance varies considerably across tasks, particularly\nstruggling with tasks that demand nuanced pragmatic reasoning, such as\nidentifying diverse forms of misogynistic language. These findings have\nimportant implications for the responsible development and deployment of LLMs\nin high-risk applications. Our benchmark suite can serve as a tool for\nresearchers and practitioners to systematically evaluate LLMs for multi-task\nfraud detection and drive the creation of more robust, trustworthy, and\nethically-aligned systems for fraud and abuse detection.", "paper_summary_zh": "大型語言模型 (LLM) 已在自然語言處理任務中展現出非凡的能力。然而，它們在高風險領域中的實際應用，例如詐騙和濫用偵測，仍然是一個需要進一步探索的領域。現有的應用程式通常狹隘地專注於特定任務，例如毒性或仇恨言論偵測。在本文中，我們提出一個全面的基準測試套件，旨在評估 LLM 在各種真實世界場景中識別和減輕欺詐和濫用語言的效能。我們的基準涵蓋了一組不同的任務，包括偵測垃圾郵件、仇恨言論、厭惡女性的語言等等。我們評估了幾種最先進的 LLM，包括來自 Anthropic、Mistral AI 和 AI21 家族的模型，以全面評估它們在這個關鍵領域的能力。結果表明，儘管 LLM 在個別的詐騙和濫用偵測任務中表現出熟練的基準效能，但它們的效能因任務而異，特別是在需要細緻務實推理的任務中表現不佳，例如識別各種形式的厭惡女性的語言。這些發現對 LLM 在高風險應用中的負責任開發和部署具有重要的意義。我們的基準測試套件可以作為研究人員和實務工作者的工具，用於系統性地評估 LLM 的多任務詐騙偵測，並推動建立更強大、更值得信賴且在道德上更一致的詐騙和濫用偵測系統。", "author": "Joymallya Chakraborty et.al.", "authors": "Joymallya Chakraborty, Wei Xia, Anirban Majumder, Dan Ma, Walid Chaabene, Naveed Janvekar", "id": "2409.06072v1", "paper_url": "http://arxiv.org/abs/2409.06072v1", "repo": "null"}}