{"2502.14932": {"publish_time": "2025-02-20", "title": "Learning to Retrieve and Reason on Knowledge Graph through Active Self-Reflection", "paper_summary": "Extensive research has investigated the integration of large language models\n(LLMs) with knowledge graphs to enhance the reasoning process. However,\nunderstanding how models perform reasoning utilizing structured graph knowledge\nremains underexplored. Most existing approaches rely on LLMs or retrievers to\nmake binary judgments regarding the utilization of knowledge, which is too\ncoarse. Meanwhile, there is still a lack of feedback mechanisms for reflection\nand correction throughout the entire reasoning path. This paper proposes an\nActive self-Reflection framework for knowledge Graph reasoning ARG, introducing\nfor the first time an end-to-end training approach to achieve iterative\nreasoning grounded on structured graphs. Within the framework, the model\nleverages special tokens to \\textit{actively} determine whether knowledge\nretrieval is necessary, performs \\textit{reflective} critique based on the\nretrieved knowledge, and iteratively reasons over the knowledge graph. The\nreasoning paths generated by the model exhibit high interpretability, enabling\ndeeper exploration of the model's understanding of structured knowledge.\nUltimately, the proposed model achieves outstanding results compared to\nexisting baselines in knowledge graph reasoning tasks.", "paper_summary_zh": "大量研究調查了大語言模型 (LLM) 與知識圖譜的整合，以增強推理過程。然而，瞭解模型如何利用結構化圖譜知識進行推理仍未得到充分探討。現有的方法大多依賴於 LLM 或檢索器來對知識的利用做出二元判斷，這太過粗略。同時，整個推理路徑中仍缺乏用於反思和修正的回饋機制。本文提出了一個主動自省知識圖推理框架 ARG，首次引入端到端訓練方法，以實現基於結構化圖譜的迭代推理。在這個框架中，模型利用特殊標記來主動確定是否需要知識檢索，根據檢索到的知識進行反思性批判，並對知識圖譜進行迭代推理。模型生成的推理路徑具有很高的可解釋性，可以更深入地探索模型對結構化知識的理解。最終，與知識圖推理任務中現有的基準相比，所提出的模型取得了傑出的成果。", "author": "Han Zhang et.al.", "authors": "Han Zhang, Langshi Zhou, Hanfang Yang", "id": "2502.14932v1", "paper_url": "http://arxiv.org/abs/2502.14932v1", "repo": "null"}}