{"2501.14630": {"publish_time": "2025-01-24", "title": "Extracting Problem Structure with LLMs for Optimized SAT Local Search", "paper_summary": "Local search preprocessing makes Conflict-Driven Clause Learning (CDCL)\nsolvers faster by providing high-quality starting points and modern SAT solvers\nhave incorporated this technique into their preprocessing steps. However, these\ntools rely on basic strategies that miss the structural patterns in problems.\nWe present a method that applies Large Language Models (LLMs) to analyze\nPython-based encoding code. This reveals hidden structural patterns in how\nproblems convert into SAT. Our method automatically generates specialized local\nsearch algorithms that find these patterns and use them to create strong\ninitial assignments. This works for any problem instance from the same encoding\ntype. Our tests show encouraging results, achieving faster solving times\ncompared to baseline preprocessing systems.", "paper_summary_zh": "區域搜尋預處理使衝突驅動子句學習 (CDCL) 解算器能提供高品質的起點，而現代 SAT 解算器已將此技術納入其預處理步驟中，讓解算器能運作得更快。然而，這些工具依賴於基本策略，而錯失了問題中的結構模式。我們提出了一個方法，將大型語言模型 (LLM) 應用於分析基於 Python 的編碼碼。這揭露了問題轉換為 SAT 時隱藏的結構模式。我們的自動產生特殊區域搜尋演算法，找出這些模式並使用它們來建立強而有力的初始指派。這適用於相同編碼類型的任何問題實例。我們的測試顯示令人振奮的結果，與基準預處理系統相比，能達成更快的解算時間。", "author": "André Schilder et.al.", "authors": "André Schilder, Stefan Szeider", "id": "2501.14630v1", "paper_url": "http://arxiv.org/abs/2501.14630v1", "repo": "null"}}