{"2406.01040": {"publish_time": "2024-06-03", "title": "Synthetic Data Generation for 3D Myocardium Deformation Analysis", "paper_summary": "Accurate analysis of 3D myocardium deformation using high-resolution\ncomputerized tomography (CT) datasets with ground truth (GT) annotations is\ncrucial for advancing cardiovascular imaging research. However, the scarcity of\nsuch datasets poses a significant challenge for developing robust myocardium\ndeformation analysis models. To address this, we propose a novel approach to\nsynthetic data generation for enriching cardiovascular imaging datasets.\n  We introduce a synthetic data generation method, enriched with crucial GT 3D\noptical flow annotations. We outline the data preparation from a cardiac\nfour-dimensional (4D) CT scan, selection of parameters, and the subsequent\ncreation of synthetic data from the same or other sources of 3D cardiac CT data\nfor training.\n  Our work contributes to overcoming the limitations imposed by the scarcity of\nhigh-resolution CT datasets with precise annotations, thereby facilitating the\ndevelopment of accurate and reliable myocardium deformation analysis algorithms\nfor clinical applications and diagnostics.\n  Our code is available at:\nhttp://www.github.com/shaharzuler/cardio_volume_skewer", "paper_summary_zh": "使用帶有真實 (GT) 標註的高解析度電腦斷層掃描 (CT) 資料集準確分析 3D 心肌變形對於推進心血管影像研究至關重要。然而，此類資料集的稀少對開發強健的心肌變形分析模型構成重大挑戰。為了解決這個問題，我們提出了一種創新的合成資料生成方法，用於豐富心血管影像資料集。\n  我們介紹了一種合成資料生成方法，其中包含了重要的 GT 3D 光流標註。我們概述了從心臟四維 (4D) CT 掃描中準備資料、選擇參數，以及隨後從相同或其他來源的 3D 心臟 CT 資料中建立合成資料以進行訓練的過程。\n  我們的研究有助於克服高解析度 CT 資料集標註不精確的限制，從而促進開發適用於臨床應用和診斷的準確且可靠的心肌變形分析演算法。\n  我們的程式碼可在以下網址取得：\nhttp://www.github.com/shaharzuler/cardio_volume_skewer", "author": "Shahar Zuler et.al.", "authors": "Shahar Zuler, Dan Raviv", "id": "2406.01040v1", "paper_url": "http://arxiv.org/abs/2406.01040v1", "repo": "https://github.com/shaharzuler/cardio_volume_skewer"}}