{"2501.11463": {"publish_time": "2025-01-20", "title": "Curiosity-Driven Reinforcement Learning from Human Feedback", "paper_summary": "Reinforcement learning from human feedback (RLHF) has proven effective in\naligning large language models (LLMs) with human preferences, but often at the\ncost of reduced output diversity. This trade-off between diversity and\nalignment quality remains a significant challenge. Drawing inspiration from\ncuriosity-driven exploration in reinforcement learning, we introduce\ncuriosity-driven RLHF (CD-RLHF), a framework that incorporates intrinsic\nrewards for novel states, alongside traditional sparse extrinsic rewards, to\noptimize both output diversity and alignment quality. We demonstrate the\neffectiveness of CD-RLHF through extensive experiments on a range of tasks,\nincluding text summarization and instruction following. Our approach achieves\nsignificant gains in diversity on multiple diversity-oriented metrics while\nmaintaining alignment with human preferences comparable to standard RLHF. We\nmake our code publicly available at https://github.com/ernie-research/CD-RLHF.", "paper_summary_zh": "透過人類回饋的強化學習 (RLHF) 已被證實能有效地將大型語言模型 (LLM) 與人類偏好對齊，但通常會犧牲輸出多樣性。這種多樣性和對齊品質之間的取捨仍然是一項重大的挑戰。從強化學習中的好奇心驅動探索中汲取靈感，我們引入了好奇心驅動的 RLHF (CD-RLHF)，一個框架，它結合了對新狀態的內在獎勵，以及傳統的稀疏外在獎勵，以同時最佳化輸出多樣性和對齊品質。我們透過一系列任務的廣泛實驗，包括文字摘要和指令遵循，來展示 CD-RLHF 的有效性。我們的做法在多個以多樣性為導向的指標上達到了顯著的多樣性提升，同時維持與人類偏好的對齊，這與標準 RLHF 相當。我們在 https://github.com/ernie-research/CD-RLHF 公開我們的程式碼。", "author": "Haoran Sun et.al.", "authors": "Haoran Sun, Yekun Chai, Shuohuan Wang, Yu Sun, Hua Wu, Haifeng Wang", "id": "2501.11463v1", "paper_url": "http://arxiv.org/abs/2501.11463v1", "repo": "null"}}