{"2503.15126": {"publish_time": "2025-03-19", "title": "Text-Derived Relational Graph-Enhanced Network for Skeleton-Based Action Segmentation", "paper_summary": "Skeleton-based Temporal Action Segmentation (STAS) aims to segment and\nrecognize various actions from long, untrimmed sequences of human skeletal\nmovements. Current STAS methods typically employ spatio-temporal modeling to\nestablish dependencies among joints as well as frames, and utilize one-hot\nencoding with cross-entropy loss for frame-wise classification supervision.\nHowever, these methods overlook the intrinsic correlations among joints and\nactions within skeletal features, leading to a limited understanding of human\nmovements. To address this, we propose a Text-Derived Relational Graph-Enhanced\nNetwork (TRG-Net) that leverages prior graphs generated by Large Language\nModels (LLM) to enhance both modeling and supervision. For modeling, the\nDynamic Spatio-Temporal Fusion Modeling (DSFM) method incorporates Text-Derived\nJoint Graphs (TJG) with channel- and frame-level dynamic adaptation to\neffectively model spatial relations, while integrating spatio-temporal core\nfeatures during temporal modeling. For supervision, the Absolute-Relative\nInter-Class Supervision (ARIS) method employs contrastive learning between\naction features and text embeddings to regularize the absolute class\ndistributions, and utilizes Text-Derived Action Graphs (TAG) to capture the\nrelative inter-class relationships among action features. Additionally, we\npropose a Spatial-Aware Enhancement Processing (SAEP) method, which\nincorporates random joint occlusion and axial rotation to enhance spatial\ngeneralization. Performance evaluations on four public datasets demonstrate\nthat TRG-Net achieves state-of-the-art results.", "paper_summary_zh": "<paragraph>基於骨架的時序動作分割 (STAS) 旨在從人類骨骼運動的長未修剪序列中分割和識別各種動作。目前的 STAS 方法通常採用時空建模來建立關節和幀之間的依賴關係，並利用 one-hot 編碼和交叉熵損失進行逐幀分類監督。然而，這些方法忽略了骨骼特徵內關節和動作之間的內在關聯性，導致對人類運動的理解有限。為了應對此問題，我們提出了一種文本衍生的關係圖增強網絡 (TRG-Net)，它利用大型語言模型 (LLM) 生成的先驗圖來增強建模和監督。對於建模，動態時空融合建模 (DSFM) 方法結合了文本衍生關節圖 (TJG) 與通道和幀級動態適應，以有效地建模空間關係，同時在時間建模期間整合時空核心特徵。對於監督，絕對-相對類間監督 (ARIS) 方法採用動作特徵和文本嵌入之間的對比學習來規範絕對類別分佈，並利用文本衍生動作圖 (TAG) 來捕捉動作特徵之間的相對類間關係。此外，我們提出了一種空間感知增強處理 (SAEP) 方法，它結合了隨機關節遮擋和軸向旋轉來增強空間泛化能力。在四個公共數據集上的性能評估表明，TRG-Net 取得了最先進的成果。</paragraph>\n", "author": "Haoyu Ji et.al.", "authors": "Haoyu Ji, Bowen Chen, Weihong Ren, Wenze Huang, Zhihao Yang, Zhiyong Wang, Honghai Liu", "id": "2503.15126v1", "paper_url": "http://arxiv.org/abs/2503.15126v1", "repo": "null"}}