{"2405.17376": {"publish_time": "2024-05-27", "title": "Federating Dynamic Models using Early-Exit Architectures for Automatic Speech Recognition on Heterogeneous Clients", "paper_summary": "Automatic speech recognition models require large amounts of speech\nrecordings for training. However, the collection of such data often is\ncumbersome and leads to privacy concerns. Federated learning has been widely\nused as an effective decentralized technique that collaboratively learns a\nshared prediction model while keeping the data local on different clients.\nUnfortunately, client devices often feature limited computation and\ncommunication resources leading to practical difficulties for large models. In\naddition, the heterogeneity that characterizes edge devices makes it\nsub-optimal to generate a single model that fits all of them. Differently from\nthe recent literature, where multiple models with different architectures are\nused, in this work, we propose using dynamical architectures which, employing\nearly-exit solutions, can adapt their processing (i.e. traversed layers)\ndepending on the input and on the operation conditions. This solution falls in\nthe realm of partial training methods and brings two benefits: a single model\nis used on a variety of devices; federating the models after local training is\nstraightforward. Experiments on public datasets show that our proposed approach\nis effective and can be combined with basic federated learning strategies.", "paper_summary_zh": "自動語音辨識模型需要大量的語音錄音進行訓練。然而，此類資料的收集通常很繁瑣，並導致隱私問題。聯邦學習已被廣泛用作一種有效的去中心化技術，可以在保持資料在不同客戶端本機的同時，協作學習一個共享預測模型。不幸的是，客戶端裝置通常具有有限的運算和通訊資源，導致實際上難以使用大型模型。此外，邊緣裝置的異質性使得產生一個適合所有裝置的單一模型並非最佳。與最近使用具有不同架構的多個模型的文獻不同，在這項工作中，我們建議使用動態架構，它採用早期退出解決方案，可以根據輸入和操作條件調整其處理（即遍歷的層）。此解決方案屬於部分訓練方法的範疇，並帶來兩個好處：一個模型可用於各種裝置；在本地訓練後聯合模型非常簡單。對公開資料集的實驗表明，我們提出的方法是有效的，並且可以與基本的聯邦學習策略相結合。", "author": "Mohamed Nabih Ali et.al.", "authors": "Mohamed Nabih Ali, Alessio Brutti, Daniele Falavigna", "id": "2405.17376v1", "paper_url": "http://arxiv.org/abs/2405.17376v1", "repo": "null"}}