{"2408.04975": {"publish_time": "2024-08-09", "title": "reCSE: Portable Reshaping Features for Sentence Embedding in Self-supervised Contrastive Learning", "paper_summary": "We propose reCSE, a self supervised contrastive learning sentence\nrepresentation framework based on feature reshaping. This framework is\ndifferent from the current advanced models that use discrete data augmentation\nmethods, but instead reshapes the input features of the original sentence,\naggregates the global information of each token in the sentence, and alleviates\nthe common problems of representation polarity and GPU memory consumption\nlinear increase in current advanced models. In addition, our reCSE has achieved\ncompetitive performance in semantic similarity tasks. And the experiment proves\nthat our proposed feature reshaping method has strong universality, which can\nbe transplanted to other self supervised contrastive learning frameworks and\nenhance their representation ability, even achieving state-of-the-art\nperformance. Our code is available at https://github.com/heavenhellchen/reCSE.", "paper_summary_zh": "我們提出 reCSE，一個基於特徵重塑的自監督對比學習句子表示框架。此框架不同於使用離散數據擴充方法的當前先進模型，而是重塑原始句子的輸入特徵，彙總句子中每個符號的全局資訊，並緩解了表示極性和 GPU 記憶體消耗在當前先進模型中線性增加的常見問題。此外，我們的 reCSE 在語義相似性任務中取得了有競爭力的表現。實驗證明，我們提出的特徵重塑方法具有很強的通用性，可以移植到其他自監督對比學習框架，並增強其表示能力，甚至達到最先進的效能。我們的程式碼可在 https://github.com/heavenhellchen/reCSE 取得。", "author": "Fufangchen Zhao et.al.", "authors": "Fufangchen Zhao, Gao Jian, Danfeng Yan", "id": "2408.04975v2", "paper_url": "http://arxiv.org/abs/2408.04975v2", "repo": "null"}}