{"2405.20892": {"publish_time": "2024-05-31", "title": "MALT: Multi-scale Action Learning Transformer for Online Action Detection", "paper_summary": "Online action detection (OAD) aims to identify ongoing actions from streaming\nvideo in real-time, without access to future frames. Since these actions\nmanifest at varying scales of granularity, ranging from coarse to fine,\nprojecting an entire set of action frames to a single latent encoding may\nresult in a lack of local information, necessitating the acquisition of action\nfeatures across multiple scales. In this paper, we propose a multi-scale action\nlearning transformer (MALT), which includes a novel recurrent decoder (used for\nfeature fusion) that includes fewer parameters and can be trained more\nefficiently. A hierarchical encoder with multiple encoding branches is further\nproposed to capture multi-scale action features. The output from the preceding\nbranch is then incrementally input to the subsequent branch as part of a\ncross-attention calculation. In this way, output features transition from\ncoarse to fine as the branches deepen. We also introduce an explicit frame\nscoring mechanism employing sparse attention, which filters irrelevant frames\nmore efficiently, without requiring an additional network. The proposed method\nachieved state-of-the-art performance on two benchmark datasets (THUMOS'14 and\nTVSeries), outperforming all existing models used for comparison, with an mAP\nof 0.2% for THUMOS'14 and an mcAP of 0.1% for TVseries.", "paper_summary_zh": "線上動作偵測 (OAD) 旨在從串流影片中辨識正在進行的動作，且為即時偵測，且無法存取後續的影格。由於這些動作會以不同尺度的粒度顯現，從粗略到精細，將一整組動作影格投影到單一潛在編碼中可能會導致缺乏局部資訊，因此需要跨多個尺度取得動作特徵。在本文中，我們提出一個多尺度動作學習轉換器 (MALT)，其中包含一個新穎的遞迴解碼器 (用於特徵融合)，該解碼器包含較少的參數，且可以更有效率地進行訓練。進一步提出一個具有多個編碼分支的階層式編碼器，以擷取多尺度動作特徵。然後將前一個分支的輸出作為跨注意力計算的一部分，遞增輸入到後續分支。這樣一來，隨著分支的加深，輸出特徵會從粗略轉變為精細。我們還引入了一個明確的影格評分機制，採用稀疏注意力，可以更有效率地過濾不相關的影格，而不需要額外的網路。所提出的方法在兩個基準資料集 (THUMOS'14 和 TVSeries) 上達到最先進的效能，優於所有現有的比較模型，其中 THUMOS'14 的 mAP 為 0.2%，TVseries 的 mcAP 為 0.1%。", "author": "Zhipeng Yang et.al.", "authors": "Zhipeng Yang, Ruoyu Wang, Yang Tan, Liping Xie", "id": "2405.20892v1", "paper_url": "http://arxiv.org/abs/2405.20892v1", "repo": "null"}}