{"2406.03897": {"publish_time": "2024-06-06", "title": "HeSum: a Novel Dataset for Abstractive Text Summarization in Hebrew", "paper_summary": "While large language models (LLMs) excel in various natural language tasks in\nEnglish, their performance in lower-resourced languages like Hebrew, especially\nfor generative tasks such as abstractive summarization, remains unclear. The\nhigh morphological richness in Hebrew adds further challenges due to the\nambiguity in sentence comprehension and the complexities in meaning\nconstruction. In this paper, we address this resource and evaluation gap by\nintroducing HeSum, a novel benchmark specifically designed for abstractive text\nsummarization in Modern Hebrew. HeSum consists of 10,000 article-summary pairs\nsourced from Hebrew news websites written by professionals. Linguistic analysis\nconfirms HeSum's high abstractness and unique morphological challenges. We show\nthat HeSum presents distinct difficulties for contemporary state-of-the-art\nLLMs, establishing it as a valuable testbed for generative language technology\nin Hebrew, and MRLs generative challenges in general.", "paper_summary_zh": "儘管大型語言模型 (LLM) 在英語的各種自然語言任務中表現出色，但它們在希伯來語等資源較少的語言中的表現，特別是在抽象摘要等生成任務中，仍不明朗。希伯來語中豐富的形態豐富性增加了進一步的挑戰，因為句子理解中的含糊性以及意義建構的複雜性。在本文中，我們通過引入 HeSum 來解決這個資源和評估差距，HeSum 是一個專門為現代希伯來語的抽象文本摘要而設計的新基準。HeSum 包含 10,000 對文章摘要，這些摘要來自由專業人士撰寫的希伯來語新聞網站。語言分析證實了 HeSum 的高度抽象性和獨特的形態挑戰。我們表明，HeSum 對當代最先進的 LLM 構成了不同的困難，使其成為希伯來語生成語言技術的寶貴測試平台，以及一般 MRL 生成挑戰。", "author": "Tzuf Paz-Argaman et.al.", "authors": "Tzuf Paz-Argaman, Itai Mondshine, Asaf Achi Mordechai, Reut Tsarfaty", "id": "2406.03897v1", "paper_url": "http://arxiv.org/abs/2406.03897v1", "repo": "https://github.com/OnlpLab/HeSum"}}