{"2406.14852": {"publish_time": "2024-06-21", "title": "Is A Picture Worth A Thousand Words? Delving Into Spatial Reasoning for Vision Language Models", "paper_summary": "Large language models (LLMs) and vision-language models (VLMs) have\ndemonstrated remarkable performance across a wide range of tasks and domains.\nDespite this promise, spatial understanding and reasoning -- a fundamental\ncomponent of human cognition -- remains under-explored. We develop novel\nbenchmarks that cover diverse aspects of spatial reasoning such as relationship\nunderstanding, navigation, and counting. We conduct a comprehensive evaluation\nof competitive language and vision-language models. Our findings reveal several\ncounter-intuitive insights that have been overlooked in the literature: (1)\nSpatial reasoning poses significant challenges where competitive models can\nfall behind random guessing; (2) Despite additional visual input, VLMs often\nunder-perform compared to their LLM counterparts; (3) When both textual and\nvisual information is available, multi-modal language models become less\nreliant on visual information if sufficient textual clues are provided.\nAdditionally, we demonstrate that leveraging redundancy between vision and text\ncan significantly enhance model performance. We hope our study will inform the\ndevelopment of multimodal models to improve spatial intelligence and further\nclose the gap with human intelligence.", "paper_summary_zh": "大型語言模型 (LLM) 和視覺語言模型 (VLM) 已展現出在廣泛任務和領域的卓越效能。儘管有此承諾，但空間理解和推理——人類認知的基本組成部分——仍未得到充分探討。我們開發出新穎的基準，涵蓋空間推理的不同面向，例如關係理解、導航和計數。我們對競爭語言和視覺語言模型進行了全面的評估。我們的研究結果揭示了文獻中被忽略的幾個反直覺見解：(1) 空間推理帶來重大挑戰，競爭模型可能落後於隨機猜測；(2) 儘管有額外的視覺輸入，但 VLM 的表現通常不如其 LLM 對應模型；(3) 當文本和視覺資訊都可用時，如果提供了足夠的文字線索，多模式語言模型將不太依賴視覺資訊。此外，我們證明了利用視覺和文字之間的冗餘可以顯著提升模型效能。我們希望我們的研究將有助於多模式模型的開發，以提升空間智慧，並進一步縮小與人類智慧的差距。", "author": "Jiayu Wang et.al.", "authors": "Jiayu Wang, Yifei Ming, Zhenmei Shi, Vibhav Vineet, Xin Wang, Neel Joshi", "id": "2406.14852v1", "paper_url": "http://arxiv.org/abs/2406.14852v1", "repo": "null"}}