{"2501.17581": {"publish_time": "2025-01-29", "title": "CSEval: Towards Automated, Multi-Dimensional, and Reference-Free Counterspeech Evaluation using Auto-Calibrated LLMs", "paper_summary": "Counterspeech has been popular as an effective approach to counter online\nhate speech, leading to increasing research interest in automated counterspeech\ngeneration using language models. However, this field lacks standardised\nevaluation protocols and robust automated evaluation metrics that align with\nhuman judgement. Current automatic evaluation methods, primarily based on\nsimilarity metrics, do not effectively capture the complex and independent\nattributes of counterspeech quality, such as contextual relevance,\naggressiveness, or argumentative coherence. This has led to an increased\ndependency on labor-intensive human evaluations to assess automated\ncounter-speech generation methods. To address these challenges, we introduce\nCSEval, a novel dataset and framework for evaluating counterspeech quality\nacross four dimensions: contextual-relevance, aggressiveness,\nargument-coherence, and suitableness. Furthermore, we propose Auto-Calibrated\nCOT for Counterspeech Evaluation (ACE), a prompt-based method with\nauto-calibrated chain-of-thoughts (CoT) for scoring counterspeech using large\nlanguage models. Our experiments show that ACE outperforms traditional metrics\nlike ROUGE, METEOR, and BertScore in correlating with human judgement,\nindicating a significant advancement in automated counterspeech evaluation.", "paper_summary_zh": "反論言論一直被視為對抗網路仇恨言論的有效方法，導致人們對使用語言模型進行自動反論言論產生的研究興趣日益增加。然而，這個領域缺乏標準化的評估協定和與人類判斷一致的穩健自動評估指標。目前的自動評估方法主要基於相似性指標，無法有效捕捉反論言論品質的複雜且獨立屬性，例如上下文相關性、攻擊性或論證一致性。這導致對勞力密集型人類評估的依賴性增加，以評估自動反論言論產生方法。為了應對這些挑戰，我們引入了 CSEval，這是一個新的資料集和框架，用於評估反論言論品質的四個面向：上下文相關性、攻擊性、論證一致性和適宜性。此外，我們提出了用於反論言論評估的自動校準 COT（ACE），這是一種基於提示的方法，具有自動校準的思考鏈（CoT），用於使用大型語言模型對反論言論進行評分。我們的實驗表明，ACE 在與人類判斷相關方面優於傳統指標，例如 ROUGE、METEOR 和 BertScore，這表示自動反論言論評估有了顯著進展。", "author": "Amey Hengle et.al.", "authors": "Amey Hengle, Aswini Kumar, Anil Bandhakavi, Tanmoy Chakraborty", "id": "2501.17581v1", "paper_url": "http://arxiv.org/abs/2501.17581v1", "repo": "null"}}