{"2407.07329": {"publish_time": "2024-07-10", "title": "Probability of Differentiation Reveals Brittleness of Homogeneity Bias in Large Language Models", "paper_summary": "Homogeneity bias in Large Language Models (LLMs) refers to their tendency to\nhomogenize the representations of some groups compared to others. Previous\nstudies documenting this bias have predominantly used encoder models, which may\nhave inadvertently introduced biases. To address this limitation, we prompted\nGPT-4 to generate single word/expression completions associated with 18\nsituation cues - specific, measurable elements of environments that influence\nhow individuals perceive situations and compared the variability of these\ncompletions using probability of differentiation. This approach directly\nassessed homogeneity bias from the model's outputs, bypassing encoder models.\nAcross five studies, we find that homogeneity bias is highly volatile across\nsituation cues and writing prompts, suggesting that the bias observed in past\nwork may reflect those within encoder models rather than LLMs. Furthermore,\nthese results suggest that homogeneity bias in LLMs is brittle, as even minor\nand arbitrary changes in prompts can significantly alter the expression of\nbiases. Future work should further explore how variations in syntactic features\nand topic choices in longer text generations influence homogeneity bias in\nLLMs.", "paper_summary_zh": "大型語言模型 (LLM) 中的同質性偏差是指它們傾向於將某些群體的表徵同質化，而與其他群體相比。先前記錄這種偏差的研究主要使用編碼器模型，這可能會無意中引入偏差。為了解決這個限制，我們提示 GPT-4 生成與 18 個情境線索相關的單字/表達式完成——環境中具體可衡量的元素，會影響個人如何感知情境，並使用差異機率比較這些完成的變異性。此方法直接評估模型輸出的同質性偏差，繞過編碼器模型。在五項研究中，我們發現同質性偏差在情境線索和寫作提示中高度不穩定，這表明過去工作中觀察到的偏差可能反映編碼器模型中的偏差，而不是 LLM。此外，這些結果表明 LLM 中的同質性偏差很脆弱，因為提示中的微小且隨意的更改會顯著改變偏差的表達。未來的研究應進一步探討語法特徵的變化以及較長文本生成中的主題選擇如何影響 LLM 中的同質性偏差。", "author": "Messi H. J. Lee et.al.", "authors": "Messi H. J. Lee, Calvin K. Lai", "id": "2407.07329v1", "paper_url": "http://arxiv.org/abs/2407.07329v1", "repo": "null"}}