{"2410.22108": {"publish_time": "2024-10-29", "title": "Protecting Privacy in Multimodal Large Language Models with MLLMU-Bench", "paper_summary": "Generative models such as Large Language Models (LLM) and Multimodal Large\nLanguage models (MLLMs) trained on massive web corpora can memorize and\ndisclose individuals' confidential and private data, raising legal and ethical\nconcerns. While many previous works have addressed this issue in LLM via\nmachine unlearning, it remains largely unexplored for MLLMs. To tackle this\nchallenge, we introduce Multimodal Large Language Model Unlearning Benchmark\n(MLLMU-Bench), a novel benchmark aimed at advancing the understanding of\nmultimodal machine unlearning. MLLMU-Bench consists of 500 fictitious profiles\nand 153 profiles for public celebrities, each profile feature over 14\ncustomized question-answer pairs, evaluated from both multimodal (image+text)\nand unimodal (text) perspectives. The benchmark is divided into four sets to\nassess unlearning algorithms in terms of efficacy, generalizability, and model\nutility. Finally, we provide baseline results using existing generative model\nunlearning algorithms. Surprisingly, our experiments show that unimodal\nunlearning algorithms excel in generation and cloze tasks, while multimodal\nunlearning approaches perform better in classification tasks with multimodal\ninputs.", "paper_summary_zh": "大型語言模型 (LLM) 和多模態大型語言模型 (MLLM) 等生成模型在海量網路語料庫上訓練，可能會記住並揭露個人機密和私人資料，引發法律和倫理問題。雖然許多先前的工作已透過機器忘記解決 LLM 中的這個問題，但對於 MLLM 來說仍未廣泛探討。為了應對這個挑戰，我們引進多模態大型語言模型忘記基準 (MLLMU-Bench)，這是一個新基準，旨在促進對多模態機器忘記的理解。MLLMU-Bench 包含 500 個虛構個人資料和 153 個公開名人個人資料，每個個人資料功能超過 14 個自訂問答配對，從多模態 (影像 + 文字) 和單模態 (文字) 角度進行評估。該基準分為四組，以評估忘記演算法在效能、概括性、和模型實用性方面的表現。最後，我們使用現有的生成模型忘記演算法提供基準結果。令人驚訝的是，我們的實驗顯示單模態忘記演算法在生成和完形填空任務中表現出色，而多模態忘記方法在具有多模態輸入的分類任務中表現較好。", "author": "Zheyuan Liu et.al.", "authors": "Zheyuan Liu, Guangyao Dou, Mengzhao Jia, Zhaoxuan Tan, Qingkai Zeng, Yongle Yuan, Meng Jiang", "id": "2410.22108v1", "paper_url": "http://arxiv.org/abs/2410.22108v1", "repo": "https://github.com/franciscoliu/MLLMU-Bench"}}