{"2501.12573": {"publish_time": "2025-01-22", "title": "Leveraging LLMs to Create a Haptic Devices' Recommendation System", "paper_summary": "Haptic technology has seen significant growth, yet a lack of awareness of\nexisting haptic device design knowledge hinders development. This paper\naddresses these limitations by leveraging advancements in Large Language Models\n(LLMs) to develop a haptic agent, focusing specifically on Grounded Force\nFeedback (GFF) devices recommendation. Our approach involves automating the\ncreation of a structured haptic device database using information from research\npapers and product specifications. This database enables the recommendation of\nrelevant GFF devices based on user queries. To ensure precise and contextually\nrelevant recommendations, the system employs a dynamic retrieval method that\ncombines both conditional and semantic searches. Benchmarking against the\nestablished UEQ and existing haptic device searching tools, the proposed haptic\nrecommendation agent ranks in the top 10\\% across all UEQ categories with mean\ndifferences favoring the agent in nearly all subscales, and maintains no\nsignificant performance bias across different user groups, showcasing superior\nusability and user satisfaction.", "paper_summary_zh": "觸覺技術已顯著成長，但缺乏對現有觸覺裝置設計知識的認識阻礙了發展。這篇論文透過利用大型語言模型 (LLM) 的進展來開發觸覺代理，特別著重於基礎力回饋 (GFF) 裝置建議，來解決這些限制。我們的做法包括使用研究論文和產品規格中的資訊，自動建立結構化的觸覺裝置資料庫。此資料庫能根據使用者查詢建議相關的 GFF 裝置。為了確保精確且符合脈絡的建議，系統採用動態擷取方法，結合條件式和語意搜尋。根據既定的 UEQ 和現有的觸覺裝置搜尋工具進行基準測試，建議的觸覺推薦代理在所有 UEQ 類別中排名在前 10%，平均差異有利於代理在幾乎所有子量表中，並且在不同的使用者群組中沒有顯著的效能偏差，展示出優異的可用性和使用者滿意度。", "author": "Yang Liu et.al.", "authors": "Yang Liu, Haiwei Dong, Abdulmotaleb El Saddik", "id": "2501.12573v1", "paper_url": "http://arxiv.org/abs/2501.12573v1", "repo": "null"}}