{"2407.04295": {"publish_time": "2024-07-05", "title": "Jailbreak Attacks and Defenses Against Large Language Models: A Survey", "paper_summary": "Large Language Models (LLMs) have performed exceptionally in various\ntext-generative tasks, including question answering, translation, code\ncompletion, etc. However, the over-assistance of LLMs has raised the challenge\nof \"jailbreaking\", which induces the model to generate malicious responses\nagainst the usage policy and society by designing adversarial prompts. With the\nemergence of jailbreak attack methods exploiting different vulnerabilities in\nLLMs, the corresponding safety alignment measures are also evolving. In this\npaper, we propose a comprehensive and detailed taxonomy of jailbreak attack and\ndefense methods. For instance, the attack methods are divided into black-box\nand white-box attacks based on the transparency of the target model. Meanwhile,\nwe classify defense methods into prompt-level and model-level defenses.\nAdditionally, we further subdivide these attack and defense methods into\ndistinct sub-classes and present a coherent diagram illustrating their\nrelationships. We also conduct an investigation into the current evaluation\nmethods and compare them from different perspectives. Our findings aim to\ninspire future research and practical implementations in safeguarding LLMs\nagainst adversarial attacks. Above all, although jailbreak remains a\nsignificant concern within the community, we believe that our work enhances the\nunderstanding of this domain and provides a foundation for developing more\nsecure LLMs.", "paper_summary_zh": "大型語言模型 (LLM) 在各種文字生成任務中表現得非常好，包括問答、翻譯、程式碼補全等。然而，LLM 的過度協助引起了「越獄」的挑戰，這會誘使模型透過設計對抗性提示來針對使用政策和社會產生惡意的回應。隨著利用 LLM 中不同漏洞的越獄攻擊方法的出現，相應的安全比對措施也在不斷發展。在本文中，我們提出了越獄攻擊和防禦方法的全面且詳細分類。例如，攻擊方法根據目標模型的透明度分為黑盒攻擊和白盒攻擊。同時，我們將防禦方法分類為提示級別防禦和模型級別防禦。此外，我們進一步將這些攻擊和防禦方法細分為不同的子類別，並展示了一個說明其關係的連貫圖表。我們還對當前的評估方法進行了調查，並從不同的角度對它們進行了比較。我們的研究結果旨在激勵未來的研究和實務實作，以保護 LLM 免受對抗性攻擊。最重要的是，儘管越獄仍然是社群中的重大問題，但我們相信我們的研究增強了對這個領域的理解，並為開發更安全的 LLM 提供了基礎。", "author": "Sibo Yi et.al.", "authors": "Sibo Yi, Yule Liu, Zhen Sun, Tianshuo Cong, Xinlei He, Jiaxing Song, Ke Xu, Qi Li", "id": "2407.04295v1", "paper_url": "http://arxiv.org/abs/2407.04295v1", "repo": "null"}}