{"2412.19155": {"publish_time": "2024-12-26", "title": "Referencing Where to Focus: Improving VisualGrounding with Referential Query", "paper_summary": "Visual Grounding aims to localize the referring object in an image given a\nnatural language expression. Recent advancements in DETR-based visual grounding\nmethods have attracted considerable attention, as they directly predict the\ncoordinates of the target object without relying on additional efforts, such as\npre-generated proposal candidates or pre-defined anchor boxes. However,\nexisting research primarily focuses on designing stronger multi-modal decoder,\nwhich typically generates learnable queries by random initialization or by\nusing linguistic embeddings. This vanilla query generation approach inevitably\nincreases the learning difficulty for the model, as it does not involve any\ntarget-related information at the beginning of decoding. Furthermore, they only\nuse the deepest image feature during the query learning process, overlooking\nthe importance of features from other levels. To address these issues, we\npropose a novel approach, called RefFormer. It consists of the query adaption\nmodule that can be seamlessly integrated into CLIP and generate the referential\nquery to provide the prior context for decoder, along with a task-specific\ndecoder. By incorporating the referential query into the decoder, we can\neffectively mitigate the learning difficulty of the decoder, and accurately\nconcentrate on the target object. Additionally, our proposed query adaption\nmodule can also act as an adapter, preserving the rich knowledge within CLIP\nwithout the need to tune the parameters of the backbone network. Extensive\nexperiments demonstrate the effectiveness and efficiency of our proposed\nmethod, outperforming state-of-the-art approaches on five visual grounding\nbenchmarks.", "paper_summary_zh": "視覺基礎旨在根據自然語言表達式在圖像中定位參考對象。基於 DETR 的視覺基礎方法的最新進展引起了廣泛關注，因為它們直接預測目標對象的坐標，而無需依賴額外的努力，例如預先生成的提議候選或預先定義的錨框。然而，現有研究主要集中於設計更強大的多模式解碼器，它通常通過隨機初始化或使用語言嵌入來生成可學習查詢。這種香草查詢生成方法不可避免地增加了模型的學習難度，因為它在解碼開始時不涉及任何與目標相關的信息。此外，它們在查詢學習過程中只使用最深的圖像特徵，忽視了其他級別特徵的重要性。為了解決這些問題，我們提出了一種新穎的方法，稱為 RefFormer。它由查詢適應模塊組成，該模塊可以無縫集成到 CLIP 中並生成參考查詢，為解碼器提供先驗上下文，以及特定於任務的解碼器。通過將參考查詢納入解碼器，我們可以有效地降低解碼器的學習難度，並準確地集中在目標對象上。此外，我們提出的查詢適應模塊還可以作為適配器，在無需調整主幹網絡參數的情況下保留 CLIP 中的豐富知識。大量的實驗證明了我們提出的方法的有效性和效率，在五個視覺基礎基準上優於最先進的方法。", "author": "Yabing Wang et.al.", "authors": "Yabing Wang, Zhuotao Tian, Qingpei Guo, Zheng Qin, Sanping Zhou, Ming Yang, Le Wang", "id": "2412.19155v1", "paper_url": "http://arxiv.org/abs/2412.19155v1", "repo": "null"}}