{"2409.13688": {"publish_time": "2024-09-20", "title": "Morphological Detection and Classification of Microplastics and Nanoplastics Emerged from Consumer Products by Deep Learning", "paper_summary": "Plastic pollution presents an escalating global issue, impacting health and\nenvironmental systems, with micro- and nanoplastics found across mediums from\npotable water to air. Traditional methods for studying these contaminants are\nlabor-intensive and time-consuming, necessitating a shift towards more\nefficient technologies. In response, this paper introduces micro- and\nnanoplastics (MiNa), a novel and open-source dataset engineered for the\nautomatic detection and classification of micro and nanoplastics using object\ndetection algorithms. The dataset, comprising scanning electron microscopy\nimages simulated under realistic aquatic conditions, categorizes plastics by\npolymer type across a broad size spectrum. We demonstrate the application of\nstate-of-the-art detection algorithms on MiNa, assessing their effectiveness\nand identifying the unique challenges and potential of each method. The dataset\nnot only fills a critical gap in available resources for microplastic research\nbut also provides a robust foundation for future advancements in the field.", "paper_summary_zh": "塑膠污染是一個日益嚴重的全球議題，影響健康和環境系統，從飲用水到空氣中都發現了微塑膠和奈米塑膠。傳統研究這些污染物的技術費時費力，因此有必要轉向更有效率的技術。為了解決這個問題，本文介紹微塑膠和奈米塑膠 (MiNa)，這是一個新穎的開源資料集，專門用於使用物件偵測演算法自動偵測和分類微塑膠和奈米塑膠。該資料集包含在逼真的水生環境下模擬的掃描電子顯微鏡影像，並根據聚合物類型對塑膠進行分類，涵蓋廣泛的尺寸範圍。我們展示了在 MiNa 上應用最先進的偵測演算法，評估其有效性，並找出每種方法的獨特挑戰和潛力。該資料集不僅填補了微塑膠研究可用資源的關鍵缺口，也為該領域未來的進展奠定了穩固的基礎。", "author": "Hadi Rezvani et.al.", "authors": "Hadi Rezvani, Navid Zarrabi, Ishaan Mehta, Christopher Kolios, Hussein Ali Jaafar, Cheng-Hao Kao, Sajad Saeedi, Nariman Yousefi", "id": "2409.13688v1", "paper_url": "http://arxiv.org/abs/2409.13688v1", "repo": "null"}}