{"2410.06678": {"publish_time": "2024-10-09", "title": "M${}^{3}$Bench: Benchmarking Whole-body Motion Generation for Mobile Manipulation in 3D Scenes", "paper_summary": "We propose M^3Bench, a new benchmark for whole-body motion generation for\nmobile manipulation tasks. Given a 3D scene context, M^3Bench requires an\nembodied agent to understand its configuration, environmental constraints and\ntask objectives, then generate coordinated whole-body motion trajectories for\nobject rearrangement tasks. M^3Bench features 30k object rearrangement tasks\nacross 119 diverse scenes, providing expert demonstrations generated by our\nnewly developed M^3BenchMaker. This automatic data generation tool produces\ncoordinated whole-body motion trajectories from high-level task instructions,\nrequiring only basic scene and robot information. Our benchmark incorporates\nvarious task splits to assess generalization across different dimensions and\nleverages realistic physics simulation for trajectory evaluation. Through\nextensive experimental analyses, we reveal that state-of-the-art models still\nstruggle with coordinated base-arm motion while adhering to environment-context\nand task-specific constraints, highlighting the need to develop new models that\naddress this gap. Through M^3Bench, we aim to facilitate future robotics\nresearch towards more adaptive and capable mobile manipulation in diverse,\nreal-world environments.", "paper_summary_zh": "我們提出 M^3Bench，一種用於移動操作任務的全方位運動生成的新基準。給定 3D 場景環境，M^3Bench 需要一個具象化代理來了解其組態、環境約束和任務目標，然後為物件重新排列任務生成協調的全方位運動軌跡。M^3Bench 具有 30k 個物件重新排列任務，橫跨 119 個不同的場景，提供由我們新開發的 M^3BenchMaker 生成的專家示範。這個自動資料生成工具從高階任務指令中產生協調的全方位運動軌跡，僅需要基本的場景和機器人資訊。我們的基準納入了各種任務分割，以評估不同面向的概化能力，並利用逼真的物理模擬進行軌跡評估。透過廣泛的實驗分析，我們發現最先進的模型在遵守環境背景和特定任務約束的同時，仍然難以應付協調的基本運動，強調開發新模型以解決此差距的必要性。透過 M^3Bench，我們旨在促進未來的機器人研究，朝向在多樣化的現實世界環境中更具適應性和能力的移動操作。", "author": "Zeyu Zhang et.al.", "authors": "Zeyu Zhang, Sixu Yan, Muzhi Han, Zaijin Wang, Xinggang Wang, Song-Chun Zhu, Hangxin Liu", "id": "2410.06678v1", "paper_url": "http://arxiv.org/abs/2410.06678v1", "repo": "null"}}