{"2408.04873": {"publish_time": "2024-08-09", "title": "Unsupervised Episode Detection for Large-Scale News Events", "paper_summary": "Episodic structures are inherently interpretable and adaptable to evolving\nlarge-scale key events. However, state-of-the-art automatic event detection\nmethods overlook event episodes and, therefore, struggle with these crucial\ncharacteristics. This paper introduces a novel task, episode detection, aimed\nat identifying episodes from a news corpus containing key event articles. An\nepisode describes a cohesive cluster of core entities (e.g., \"protesters\",\n\"police\") performing actions at a specific time and location. Furthermore, an\nepisode is a significant part of a larger group of episodes under a particular\nkey event. Automatically detecting episodes is challenging because, unlike key\nevents and atomic actions, we cannot rely on explicit mentions of times and\nlocations to distinguish between episodes or use semantic similarity to merge\ninconsistent episode co-references. To address these challenges, we introduce\nEpiMine, an unsupervised episode detection framework that (1) automatically\nidentifies the most salient, key-event-relevant terms and segments, (2)\ndetermines candidate episodes in an article based on natural episodic\npartitions estimated through shifts in discriminative term combinations, and\n(3) refines and forms final episode clusters using large language model-based\nreasoning on the candidate episodes. We construct three diverse, real-world\nevent datasets annotated at the episode level. EpiMine outperforms all\nbaselines on these datasets by an average 59.2% increase across all metrics.", "paper_summary_zh": "情節結構本質上可解讀且可適應不斷演化的、大規模關鍵事件。然而，最先進的自動事件偵測方法忽略了事件情節，因此難以處理這些關鍵特徵。本文介紹了一項新任務，情節偵測，旨在從包含關鍵事件文章的新聞語料庫中識別情節。一個情節描述了一群核心實體（例如「抗議者」、「警察」）在特定時間和地點執行的動作的內聚群集。此外，一個情節是一個特定關鍵事件下更大群組情節中的重要部分。自動偵測情節具有挑戰性，因為與關鍵事件和原子動作不同，我們無法依賴時間和地點的明確提及來區分情節，或使用語義相似性來合併不一致的情節共指。為了應對這些挑戰，我們引入了 EpiMine，一個無監督的情節偵測架構，它（1）自動識別最顯著、與關鍵事件相關的術語和區段，（2）根據透過區分性術語組合的轉移估計的自然情節分割，在文章中確定候選情節，以及（3）使用基於大型語言模型的推理，對候選情節進行優化並形成最終的情節群集。我們建構了三個多樣化、真實世界的事件資料集，並在情節層級進行標註。EpiMine 在這些資料集上優於所有基準，所有指標的平均提升幅度為 59.2%。", "author": "Priyanka Kargupta et.al.", "authors": "Priyanka Kargupta, Yunyi Zhang, Yizhu Jiao, Siru Ouyang, Jiawei Han", "id": "2408.04873v1", "paper_url": "http://arxiv.org/abs/2408.04873v1", "repo": "null"}}