{"2505.00662": {"publish_time": "2025-05-01", "title": "DeepCritic: Deliberate Critique with Large Language Models", "paper_summary": "As Large Language Models (LLMs) are rapidly evolving, providing accurate\nfeedback and scalable oversight on their outputs becomes an urgent and critical\nproblem. Leveraging LLMs as critique models to achieve automated supervision is\na promising solution. In this work, we focus on studying and enhancing the math\ncritique ability of LLMs. Current LLM critics provide critiques that are too\nshallow and superficial on each step, leading to low judgment accuracy and\nstruggling to offer sufficient feedback for the LLM generator to correct\nmistakes. To tackle this issue, we propose a novel and effective two-stage\nframework to develop LLM critics that are capable of deliberately critiquing on\neach reasoning step of math solutions. In the first stage, we utilize\nQwen2.5-72B-Instruct to generate 4.5K long-form critiques as seed data for\nsupervised fine-tuning. Each seed critique consists of deliberate step-wise\ncritiques that includes multi-perspective verifications as well as in-depth\ncritiques of initial critiques for each reasoning step. Then, we perform\nreinforcement learning on the fine-tuned model with either existing\nhuman-labeled data from PRM800K or our automatically annotated data obtained\nvia Monte Carlo sampling-based correctness estimation, to further incentivize\nits critique ability. Our developed critique model built on Qwen2.5-7B-Instruct\nnot only significantly outperforms existing LLM critics (including the\nsame-sized DeepSeek-R1-distill models and GPT-4o) on various error\nidentification benchmarks, but also more effectively helps the LLM generator\nrefine erroneous steps through more detailed feedback.", "paper_summary_zh": "<paragraph>隨著大型語言模型 (LLM) 的快速發展，針對其輸出結果提供準確的反饋和可擴展的監督，已成為一個迫切且關鍵的問題。利用 LLM 作為評論模型來實現自動化監督是一個很有前景的解決方案。在這項工作中，我們專注於研究和增強 LLM 的數學評論能力。目前的 LLM 評論模型提供的評論在每個步驟上都過於淺顯和表面，導致判斷準確性低，並且難以提供足夠的反饋讓 LLM 生成器糾正錯誤。為了應對這個問題，我們提出了一個新穎且有效的兩階段框架來開發 LLM 評論模型，使其能夠仔細評論數學解題過程中的每個推理步驟。在第一階段，我們利用 Qwen2.5-72B-Instruct 生成 4.5K 長篇評論作為監督式微調的種子數據。每個種子評論都包含深思熟慮的逐步評論，其中包括多角度驗證以及對每個推理步驟的初始評論的深入評論。然後，我們使用來自 PRM800K 的現有人工標記數據或我們通過基於蒙特卡洛抽樣的正確性估計獲得的自動標記數據，對微調後的模型進行強化學習，以進一步激勵其評論能力。我們基於 Qwen2.5-7B-Instruct 開發的評論模型，不僅在各種錯誤識別基準測試中顯著優於現有的 LLM 評論模型（包括相同大小的 DeepSeek-R1-distill 模型和 GPT-4o），而且還能通過更詳細的反饋更有效地幫助 LLM 生成器改進錯誤步驟。</paragraph>\n", "author": "Wenkai Yang et.al.", "authors": "Wenkai Yang, Jingwen Chen, Yankai Lin, Ji-Rong Wen", "id": "2505.00662v1", "paper_url": "http://arxiv.org/abs/2505.00662v1", "repo": "null"}}