{"2408.06520": {"publish_time": "2024-08-12", "title": "Hierarchical in-Context Reinforcement Learning with Hindsight Modular Reflections for Planning", "paper_summary": "Large Language Models (LLMs) have demonstrated remarkable abilities in\nvarious language tasks, making them promising candidates for decision-making in\nrobotics. Inspired by Hierarchical Reinforcement Learning (HRL), we propose\nHierarchical in-Context Reinforcement Learning (HCRL), a novel framework that\ndecomposes complex tasks into sub-tasks using an LLM-based high-level policy,\nin which a complex task is decomposed into sub-tasks by a high-level policy\non-the-fly. The sub-tasks, defined by goals, are assigned to the low-level\npolicy to complete. Once the LLM agent determines that the goal is finished, a\nnew goal will be proposed. To improve the agent's performance in multi-episode\nexecution, we propose Hindsight Modular Reflection (HMR), where, instead of\nreflecting on the full trajectory, we replace the task objective with\nintermediate goals and let the agent reflect on shorter trajectories to improve\nreflection efficiency. We evaluate the decision-making ability of the proposed\nHCRL in three benchmark environments--ALFWorld, Webshop, and HotpotQA. Results\nshow that HCRL can achieve 9%, 42%, and 10% performance improvement in 5\nepisodes of execution over strong in-context learning baselines.", "paper_summary_zh": "大型語言模型 (LLM) 在各種語言任務中展現出非凡的能力，使其成為機器人決策的潛在候選者。受分層強化學習 (HRL) 的啟發，我們提出分層情境強化學習 (HCRL)，這是一種新穎的框架，它使用基於 LLM 的高階政策將複雜任務分解為子任務，其中複雜任務由高階政策即時分解為子任務。由目標定義的子任務被分配給低階政策以完成。一旦 LLM 代理確定目標已完成，將提出一個新目標。為了提高代理在多情境執行中的表現，我們提出回顧性模組化反思 (HMR)，其中，我們用中間目標取代任務目標，並讓代理回顧較短的軌跡以提高反思效率，而不是回顧完整的軌跡。我們在三個基準環境中評估了所提出的 HCRL 的決策能力——ALFWorld、Webshop 和 HotpotQA。結果顯示，HCRL 在 5 個執行情境中，相較於強大的情境學習基準，可以將效能提升 9%、42% 和 10%。", "author": "Chuanneng Sun et.al.", "authors": "Chuanneng Sun, Songjun Huang, Dario Pompili", "id": "2408.06520v1", "paper_url": "http://arxiv.org/abs/2408.06520v1", "repo": "null"}}