{"2411.19443": {"publish_time": "2024-11-29", "title": "Auto-RAG: Autonomous Retrieval-Augmented Generation for Large Language Models", "paper_summary": "Iterative retrieval refers to the process in which the model continuously\nqueries the retriever during generation to enhance the relevance of the\nretrieved knowledge, thereby improving the performance of Retrieval-Augmented\nGeneration (RAG). Existing work typically employs few-shot prompting or\nmanually constructed rules to implement iterative retrieval. This introduces\nadditional inference overhead and overlooks the remarkable reasoning\ncapabilities of Large Language Models (LLMs). In this paper, we introduce\nAuto-RAG, an autonomous iterative retrieval model centered on the LLM's\npowerful decision-making capabilities. Auto-RAG engages in multi-turn dialogues\nwith the retriever, systematically planning retrievals and refining queries to\nacquire valuable knowledge. This process continues until sufficient external\ninformation is gathered, at which point the results are presented to the user.\nTo this end, we develop a method for autonomously synthesizing reasoning-based\ndecision-making instructions in iterative retrieval and fine-tuned the latest\nopen-source LLMs. The experimental results indicate that Auto-RAG is capable of\nautonomous iterative interaction with the retriever, effectively leveraging the\nremarkable reasoning and decision-making abilities of LLMs, which lead to\noutstanding performance across six benchmarks. Further analysis reveals that\nAuto-RAG can autonomously adjust the number of iterations based on the\ndifficulty of the questions and the utility of the retrieved knowledge, without\nrequiring any human intervention. Moreover, Auto-RAG expresses the iterative\nretrieval process in natural language, enhancing interpretability while\nproviding users with a more intuitive experience\\footnote{Code is available at\n\\url{https://github.com/ictnlp/Auto-RAG}.", "paper_summary_zh": "反覆擷取是指模型在生成過程中持續向擷取器發出查詢，以提升擷取知識的相關性，進而提升擷取增強生成 (RAG) 的效能。現有研究通常採用少次提示或人工建構的規則來實作反覆擷取。這引入了額外的推論負擔，且忽略了大型語言模型 (LLM) 卓越的推理能力。在本文中，我們引入了 Auto-RAG，一種以 LLM 強大的決策能力為中心的自主反覆擷取模型。Auto-RAG 與擷取器進行多回合對話，系統性地規劃擷取並精煉查詢以獲取有價值的知識。此程序會持續進行，直到收集到足夠的外部資訊為止，此時會將結果呈現給使用者。為此，我們開發了一種方法，可自主綜合基於推理的決策制定指示到反覆擷取中，並微調最新的開源 LLM。實驗結果顯示，Auto-RAG 能夠自主與擷取器進行反覆互動，有效利用 LLM 卓越的推理和決策能力，進而提升六個基準測試的傑出效能。進一步的分析顯示，Auto-RAG 能夠根據問題的難度和擷取知識的效用，自主調整反覆次數，而不需要任何人工介入。此外，Auto-RAG 以自然語言表達反覆擷取程序，在提供使用者更直覺的體驗的同時，也提升了可解釋性\\footnote{程式碼可於\\url{https://github.com/ictnlp/Auto-RAG}取得。}。", "author": "Tian Yu et.al.", "authors": "Tian Yu, Shaolei Zhang, Yang Feng", "id": "2411.19443v1", "paper_url": "http://arxiv.org/abs/2411.19443v1", "repo": "https://github.com/ictnlp/auto-rag"}}