{"2411.13724": {"publish_time": "2024-11-20", "title": "Exploring Large Language Models for Climate Forecasting", "paper_summary": "With the increasing impacts of climate change, there is a growing demand for\naccessible tools that can provide reliable future climate information to\nsupport planning, finance, and other decision-making applications. Large\nlanguage models (LLMs), such as GPT-4, present a promising approach to bridging\nthe gap between complex climate data and the general public, offering a way for\nnon-specialist users to obtain essential climate insights through natural\nlanguage interaction. However, an essential challenge remains under-explored:\nevaluating the ability of LLMs to provide accurate and reliable future climate\npredictions, which is crucial for applications that rely on anticipating\nclimate trends. In this study, we investigate the capability of GPT-4 in\npredicting rainfall at short-term (15-day) and long-term (12-month) scales. We\ndesigned a series of experiments to assess GPT's performance under different\nconditions, including scenarios with and without expert data inputs. Our\nresults indicate that GPT, when operating independently, tends to generate\nconservative forecasts, often reverting to historical averages in the absence\nof clear trend signals. This study highlights both the potential and challenges\nof applying LLMs for future climate predictions, providing insights into their\nintegration with climate-related applications and suggesting directions for\nenhancing their predictive capabilities in the field.", "paper_summary_zh": "隨著氣候變遷的影響日益加劇，對於可提供可靠未來氣候資訊的平易近人工具需求日益殷切，以支援規劃、財務和其他決策制定應用程式。大型語言模型 (LLM)，例如 GPT-4，提供了一種有前景的方法，可以彌合複雜氣候資料與一般大眾之間的鴻溝，提供一種方式讓非專家使用者透過自然語言互動取得必要的氣候見解。然而，有一個重要的挑戰仍然未被充分探討：評估 LLM 提供準確且可靠未來氣候預測的能力，這對於依賴預測氣候趨勢的應用程式至關重要。在本研究中，我們調查了 GPT-4 在短期 (15 天) 和長期 (12 個月) 尺度預測降雨的能力。我們設計了一系列實驗，以評估 GPT 在不同條件下的效能，包括有和沒有專家資料輸入的場景。我們的結果表明，GPT 在獨立運作時，傾向於產生保守的預測，在沒有明確趨勢信號的情況下，通常會恢復到歷史平均值。本研究強調了將 LLM 應用於未來氣候預測的潛力與挑戰，提供了將其整合到與氣候相關的應用程式中的見解，並提出了在該領域增強其預測能力的方向。", "author": "Yang Wang et.al.", "authors": "Yang Wang, Hassan A. Karimi", "id": "2411.13724v1", "paper_url": "http://arxiv.org/abs/2411.13724v1", "repo": "null"}}