{"2407.12426": {"publish_time": "2024-07-17", "title": "Sharif-STR at SemEval-2024 Task 1: Transformer as a Regression Model for Fine-Grained Scoring of Textual Semantic Relations", "paper_summary": "Semantic Textual Relatedness holds significant relevance in Natural Language\nProcessing, finding applications across various domains. Traditionally,\napproaches to STR have relied on knowledge-based and statistical methods.\nHowever, with the emergence of Large Language Models, there has been a paradigm\nshift, ushering in new methodologies. In this paper, we delve into the\ninvestigation of sentence-level STR within Track A (Supervised) by leveraging\nfine-tuning techniques on the RoBERTa transformer. Our study focuses on\nassessing the efficacy of this approach across different languages. Notably,\nour findings indicate promising advancements in STR performance, particularly\nin Latin languages. Specifically, our results demonstrate notable improvements\nin English, achieving a correlation of 0.82 and securing a commendable 19th\nrank. Similarly, in Spanish, we achieved a correlation of 0.67, securing the\n15th position. However, our approach encounters challenges in languages like\nArabic, where we observed a correlation of only 0.38, resulting in a 20th rank.", "paper_summary_zh": "語義文本相關性在自然語言處理中具有重要意義，可在各種領域中找到應用。傳統上，STR 的方法依賴於基於知識和統計的方法。然而，隨著大型語言模型的出現，已經發生了範式轉變，引入了新的方法。在本文中，我們深入探討了通過在 RoBERTa 轉換器上利用微調技術在軌道 A（監督）中句子級 STR 的研究。我們的研究重點是評估這種方法在不同語言中的有效性。值得注意的是，我們的研究結果表明 STR 性能有望取得進步，特別是在拉丁語中。具體來說，我們的結果證明了英語的顯著改進，相關性達到 0.82，並獲得了令人稱道的第 19 名。同樣，在西班牙語中，我們實現了 0.67 的相關性，獲得了第 15 名。然而，我們的做法在阿拉伯語等語言中遇到了挑戰，我們觀察到的相關性僅為 0.38，導致排名第 20 位。", "author": "Seyedeh Fatemeh Ebrahimi et.al.", "authors": "Seyedeh Fatemeh Ebrahimi, Karim Akhavan Azari, Amirmasoud Iravani, Hadi Alizadeh, Zeinab Sadat Taghavi, Hossein Sameti", "id": "2407.12426v1", "paper_url": "http://arxiv.org/abs/2407.12426v1", "repo": "https://github.com/sharif-slpl/sharif-str"}}