{"2502.14507": {"publish_time": "2025-02-20", "title": "Can LLMs Simulate L2-English Dialogue? An Information-Theoretic Analysis of L1-Dependent Biases", "paper_summary": "This study evaluates Large Language Models' (LLMs) ability to simulate\nnon-native-like English use observed in human second language (L2) learners\ninterfered with by their native first language (L1). In dialogue-based\ninterviews, we prompt LLMs to mimic L2 English learners with specific L1s\n(e.g., Japanese, Thai, Urdu) across seven languages, comparing their outputs to\nreal L2 learner data. Our analysis examines L1-driven linguistic biases, such\nas reference word usage and avoidance behaviors, using information-theoretic\nand distributional density measures. Results show that modern LLMs (e.g.,\nQwen2.5, LLAMA3.3, DeepseekV3, GPT-4o) replicate L1-dependent patterns observed\nin human L2 data, with distinct influences from various languages (e.g.,\nJapanese, Korean, and Mandarin significantly affect tense agreement, and Urdu\ninfluences noun-verb collocations). Our results reveal the potential of LLMs\nfor L2 dialogue generation and evaluation for future educational applications.", "paper_summary_zh": "本研究評估大型語言模型 (LLM) 模擬非母語英語使用者的能力，這些使用者會受到母語 (L1) 干擾，而母語是第二語言 (L2) 學習者。在基於對話的訪談中，我們提示 LLM 模仿具有特定 L1（例如日語、泰語、烏爾都語）的 L2 英語學習者，並比較七種語言的輸出與真實的 L2 學習者資料。我們的分析使用資訊理論和分佈密度測量來檢視 L1 驅動的語言偏差，例如參考詞使用和避免行為。結果顯示，現代 LLM（例如 Qwen2.5、LLAMA3.3、DeepseekV3、GPT-4o）複製了在人類 L2 資料中觀察到的 L1 相依模式，並受到各種語言的明顯影響（例如，日語、韓語和普通話顯著影響時態一致性，而烏爾都語影響名詞動詞搭配）。我們的結果揭示了 LLM 在 L2 對話產生和評估方面的潛力，可供未來教育應用使用。", "author": "Rena Gao et.al.", "authors": "Rena Gao, Xuetong Wu, Tatsuki Kuribayashi, Mingrui Ye, Siya Qi, Carsten Roever, Yuanxing Liu, Zheng Yuan, Jey Han Lau", "id": "2502.14507v1", "paper_url": "http://arxiv.org/abs/2502.14507v1", "repo": "null"}}