{"2501.00961": {"publish_time": "2025-01-01", "title": "The Silent Majority: Demystifying Memorization Effect in the Presence of Spurious Correlations", "paper_summary": "Machine learning models often rely on simple spurious features -- patterns in\ntraining data that correlate with targets but are not causally related to them,\nlike image backgrounds in foreground classification. This reliance typically\nleads to imbalanced test performance across minority and majority groups. In\nthis work, we take a closer look at the fundamental cause of such imbalanced\nperformance through the lens of memorization, which refers to the ability to\npredict accurately on \\textit{atypical} examples (minority groups) in the\ntraining set but failing in achieving the same accuracy in the testing set.\nThis paper systematically shows the ubiquitous existence of spurious features\nin a small set of neurons within the network, providing the first-ever evidence\nthat memorization may contribute to imbalanced group performance. Through three\nexperimental sources of converging empirical evidence, we find the property of\na small subset of neurons or channels in memorizing minority group information.\nInspired by these findings, we articulate the hypothesis: the imbalanced group\nperformance is a byproduct of ``noisy'' spurious memorization confined to a\nsmall set of neurons. To further substantiate this hypothesis, we show that\neliminating these unnecessary spurious memorization patterns via a novel\nframework during training can significantly affect the model performance on\nminority groups. Our experimental results across various architectures and\nbenchmarks offer new insights on how neural networks encode core and spurious\nknowledge, laying the groundwork for future research in demystifying robustness\nto spurious correlation.", "paper_summary_zh": "機器學習模型通常依賴於簡單的虛假特徵 -- 訓練資料中的模式與目標相關，但與目標沒有因果關係，例如前景分類中的影像背景。這種依賴通常會導致少數和多數群體在測試效能上的不平衡。在這項工作中，我們透過記憶化的角度更仔細地檢視這種不平衡效能的基本原因，記憶化是指能夠準確預測訓練組中\\textit{非典型}範例（少數群體），但在測試組中無法達到相同準確度的能力。這篇論文系統性地顯示出虛假特徵普遍存在於網路中的一小組神經元中，提供記憶化可能導致群組效能不平衡的首例證據。透過三個收斂實證證據的實驗來源，我們發現一小部分神經元或通道具有記憶少數群體資訊的特性。受到這些發現的啟發，我們提出假設：群組效能不平衡是侷限於一小組神經元的「雜訊」虛假記憶化的副產品。為了進一步證實這個假設，我們顯示在訓練期間透過一個新穎的架構消除這些不必要的虛假記憶化模式，可以顯著影響模型在少數群體上的效能。我們在各種架構和基準上的實驗結果，提供了神經網路如何編碼核心和虛假知識的新見解，為未來在破解對虛假相關性的穩健性方面奠定基礎。", "author": "Chenyu You et.al.", "authors": "Chenyu You, Haocheng Dai, Yifei Min, Jasjeet S. Sekhon, Sarang Joshi, James S. Duncan", "id": "2501.00961v1", "paper_url": "http://arxiv.org/abs/2501.00961v1", "repo": "null"}}