{"2407.13623": {"publish_time": "2024-07-18", "title": "Scaling Laws with Vocabulary: Larger Models Deserve Larger Vocabularies", "paper_summary": "Research on scaling large language models (LLMs) has primarily focused on\nmodel parameters and training data size, overlooking the role of vocabulary\nsize. % Intuitively, larger vocabularies enable more efficient tokenization by\nrepresenting sentences with fewer tokens, but they also increase the risk of\nunder-fitting representations for rare tokens. We investigate how vocabulary\nsize impacts LLM scaling laws by training models ranging from 33M to 3B\nparameters on up to 500B characters with various vocabulary configurations. We\npropose three complementary approaches for predicting the compute-optimal\nvocabulary size: IsoFLOPs analysis, derivative estimation, and parametric fit\nof the loss function. Our approaches converge on the same result that the\noptimal vocabulary size depends on the available compute budget and that larger\nmodels deserve larger vocabularies. However, most LLMs use too small vocabulary\nsizes. For example, we predict that the optimal vocabulary size of Llama2-70B\nshould have been at least 216K, 7 times larger than its vocabulary of 32K. We\nvalidate our predictions empirically by training models with 3B parameters\nacross different FLOPs budgets. Adopting our predicted optimal vocabulary size\nconsistently improves downstream performance over commonly used vocabulary\nsizes. By increasing the vocabulary size from the conventional 32K to 43K, we\nimprove performance on ARC-Challenge from 29.1 to 32.0 with the same 2.3e21\nFLOPs. Our work emphasizes the necessity of jointly considering model\nparameters and vocabulary size for efficient scaling.", "paper_summary_zh": "大型語言模型 (LLM) 的擴充研究主要集中在\n模型參數和訓練資料大小，忽略了詞彙量的角色\n大小。% 直覺上，較大的詞彙量能透過\n使用較少符號表示句子來更有效率地進行符號化，但它們也增加了\n低擬合罕見符號表示的風險。我們研究詞彙量\n大小如何影響 LLM 擴充定律，訓練模型範圍從 33M 到 3B\n參數，在最多 500B 個字元上，搭配各種詞彙量組態。我們\n提出三種互補的方法來預測計算最佳的\n詞彙量大小：IsoFLOPs 分析、導數估計和參數擬合\n損失函數。我們的做法收斂於相同的結果，即\n最佳詞彙量大小取決於可用的計算預算，並且較大的\n模型需要較大的詞彙量。然而，大多數 LLM 使用太小的詞彙量\n大小。例如，我們預測 Llama2-70B 的最佳詞彙量大小\n應該至少為 216K，比其 32K 的詞彙量大 7 倍。我們\n透過使用 3B 參數在不同的 FLOPs 預算中訓練模型來驗證我們的預測\n。採用我們預測的最佳詞彙量大小可以持續改善下游效能\n超過常用的詞彙量大小。透過將詞彙量大小從傳統的 32K 增加到 43K，我們\n使用相同的 2.3e21 FLOPs 將 ARC-Challenge 上的效能從 29.1 提升到 32.0。我們的研究強調了在有效擴充中共同考量模型\n參數和詞彙量大小的必要性。", "author": "Chaofan Tao et.al.", "authors": "Chaofan Tao, Qian Liu, Longxu Dou, Niklas Muennighoff, Zhongwei Wan, Ping Luo, Min Lin, Ngai Wong", "id": "2407.13623v1", "paper_url": "http://arxiv.org/abs/2407.13623v1", "repo": "null"}}