{"2405.03359": {"publish_time": "2024-05-06", "title": "MedDoc-Bot: A Chat Tool for Comparative Analysis of Large Language Models in the Context of the Pediatric Hypertension Guideline", "paper_summary": "This research focuses on evaluating the non-commercial open-source large\nlanguage models (LLMs) Meditron, MedAlpaca, Mistral, and Llama-2 for their\nefficacy in interpreting medical guidelines saved in PDF format. As a specific\ntest scenario, we applied these models to the guidelines for hypertension in\nchildren and adolescents provided by the European Society of Cardiology (ESC).\nLeveraging Streamlit, a Python library, we developed a user-friendly medical\ndocument chatbot tool (MedDoc-Bot). This tool enables authorized users to\nupload PDF files and pose questions, generating interpretive responses from\nfour locally stored LLMs. A pediatric expert provides a benchmark for\nevaluation by formulating questions and responses extracted from the ESC\nguidelines. The expert rates the model-generated responses based on their\nfidelity and relevance. Additionally, we evaluated the METEOR and chrF metric\nscores to assess the similarity of model responses to reference answers. Our\nstudy found that Llama-2 and Mistral performed well in metrics evaluation.\nHowever, Llama-2 was slower when dealing with text and tabular data. In our\nhuman evaluation, we observed that responses created by Mistral, Meditron, and\nLlama-2 exhibited reasonable fidelity and relevance. This study provides\nvaluable insights into the strengths and limitations of LLMs for future\ndevelopments in medical document interpretation. Open-Source Code:\nhttps://github.com/yaseen28/MedDoc-Bot", "paper_summary_zh": "本研究重點在於評估非商業開源大型語言模型 (LLM) Meditron、MedAlpaca、Mistral 和 Llama-2，以了解其解釋以 PDF 格式儲存的醫療指南的功效。作為特定測試情境，我們將這些模型應用於歐洲心臟學會 (ESC) 提供的兒童和青少年高血壓指南。利用 Python 函式庫 Streamlit，我們開發了一個使用者友善的醫療文件聊天機器人工具 (MedDoc-Bot)。此工具讓授權使用者能上傳 PDF 檔案並提出問題，並從四個本地儲存的 LLM 產生解釋性回應。一位小兒科專家提供一個基準，透過制定問題和從 ESC 指南中萃取的回應來進行評估。專家根據模型產生的回應的保真度和相關性對其進行評分。此外，我們評估了 METEOR 和 chrF 度量分數，以評估模型回應與參考答案的相似性。我們的研究發現 Llama-2 和 Mistral 在度量評估中表現良好。然而，Llama-2 在處理文字和表格資料時較慢。在我們的人員評估中，我們觀察到由 Mistral、Meditron 和 Llama-2 產生的回應展現出合理的保真度和相關性。這項研究提供了有價值的見解，說明 LLM 在未來醫療文件解釋發展中的優勢和限制。開源程式碼：https://github.com/yaseen28/MedDoc-Bot", "author": "Mohamed Yaseen Jabarulla et.al.", "authors": "Mohamed Yaseen Jabarulla, Steffen Oeltze-Jafra, Philipp Beerbaum, Theodor Uden", "id": "2405.03359v1", "paper_url": "http://arxiv.org/abs/2405.03359v1", "repo": "https://github.com/yaseen28/meddoc-bot"}}