{"2412.11986": {"publish_time": "2024-12-16", "title": "Speak & Improve Corpus 2025: an L2 English Speech Corpus for Language Assessment and Feedback", "paper_summary": "We introduce the Speak \\& Improve Corpus 2025, a dataset of L2 learner\nEnglish data with holistic scores and language error annotation, collected from\nopen (spontaneous) speaking tests on the Speak \\& Improve learning platform\nhttps://speakandimprove.com . The aim of the corpus release is to address a\nmajor challenge to developing L2 spoken language processing systems, the lack\nof publicly available data with high-quality annotations. It is being made\navailable for non-commercial use on the ELiT website. In designing this corpus\nwe have sought to make it cover a wide-range of speaker attributes, from their\nL1 to their speaking ability, as well as providing manual annotations. This\nenables a range of language-learning tasks to be examined, such as assessing\nspeaking proficiency or providing feedback on grammatical errors in a learner's\nspeech. Additionally, the data supports research into the underlying technology\nrequired for these tasks including automatic speech recognition (ASR) of low\nresource L2 learner English, disfluency detection or spoken grammatical error\ncorrection (GEC). The corpus consists of around 340 hours of L2 English\nlearners audio with holistic scores, and a subset of audio annotated with\ntranscriptions and error labels.", "paper_summary_zh": "<paragraph>我們介紹 Speak & Improve 語料庫 2025，這是 L2 學習者英語資料的資料集，其中包含整體分數和語言錯誤註解，來自 Speak & Improve 學習平台上開放（自發）的口說測驗 https://speakandimprove.com。語料庫發布的目的是為了應對開發 L2 口說語言處理系統的一項重大挑戰，即缺乏帶有高品質註解的公開可用資料。它已在 ELiT 網站上提供非商業用途。在設計此語料庫時，我們力求涵蓋廣泛的說話者屬性，從他們的 L1 到他們的口說能力，並提供手動註解。這能讓一系列語言學習任務得以檢驗，例如評估口說能力或提供對學習者口說中語法錯誤的回饋。此外，資料支援對這些任務所需的基礎技術的研究，包括低資源 L2 學習者英語的自動語音辨識 (ASR)、不流暢偵測或口說語法錯誤更正 (GEC)。語料庫包含約 340 小時的 L2 英語學習者音訊，帶有整體分數，以及一小部分音訊已註解轉錄和錯誤標籤。</paragraph>", "author": "Kate Knill et.al.", "authors": "Kate Knill, Diane Nicholls, Mark J. F. Gales, Mengjie Qian, Pawel Stroinski", "id": "2412.11986v1", "paper_url": "http://arxiv.org/abs/2412.11986v1", "repo": "null"}}