{"2406.04609": {"publish_time": "2024-06-07", "title": "Diverse Intra- and Inter-Domain Activity Style Fusion for Cross-Person Generalization in Activity Recognition", "paper_summary": "Existing domain generalization (DG) methods for cross-person generalization\ntasks often face challenges in capturing intra- and inter-domain style\ndiversity, resulting in domain gaps with the target domain. In this study, we\nexplore a novel perspective to tackle this problem, a process conceptualized as\ndomain padding. This proposal aims to enrich the domain diversity by\nsynthesizing intra- and inter-domain style data while maintaining robustness to\nclass labels. We instantiate this concept using a conditional diffusion model\nand introduce a style-fused sampling strategy to enhance data generation\ndiversity. In contrast to traditional condition-guided sampling, our\nstyle-fused sampling strategy allows for the flexible use of one or more random\nstyles to guide data synthesis. This feature presents a notable advancement: it\nallows for the maximum utilization of possible permutations and combinations\namong existing styles to generate a broad spectrum of new style instances.\nEmpirical evaluations on a board of datasets demonstrate that our generated\ndata achieves remarkable diversity within the domain space. Both intra- and\ninter-domain generated data have proven to be significant and valuable,\ncontributing to varying degrees of performance enhancements. Notably, our\napproach outperforms state-of-the-art DG methods in all human activity\nrecognition tasks.", "paper_summary_zh": "現有的跨人泛化任務的網域泛化 (DG) 方法通常在捕捉網域內和網域間的樣式多樣性時面臨挑戰，導致與目標網域出現網域差距。在本研究中，我們探索一種解決此問題的新觀點，一個概念化為網域填充的過程。此提案旨在透過合成網域內和網域間樣式資料，同時維持對類別標籤的穩健性，來豐富網域多樣性。我們使用條件擴散模型實例化此概念，並引入一種樣式融合抽樣策略來增強資料產生多樣性。與傳統條件引導抽樣相反，我們的樣式融合抽樣策略允許靈活使用一個或多個隨機樣式來引導資料合成。此功能呈現顯著進步：它允許最大程度地利用現有樣式中可能的排列組合來產生廣泛的新樣式實例。在資料集委員會上的經驗評估表明，我們產生的資料在網域空間內實現了顯著的多樣性。網域內和網域間產生的資料已被證明具有重要性和價值，在不同程度的效能提升中有所貢獻。值得注意的是，我們的做法在所有人類活動辨識任務中都優於最先進的 DG 方法。", "author": "Junru Zhang et.al.", "authors": "Junru Zhang, Lang Feng, Zhidan Liu, Yuhan Wu, Yang He, Yabo Dong, Duanqing Xu", "id": "2406.04609v1", "paper_url": "http://arxiv.org/abs/2406.04609v1", "repo": "null"}}