{"2409.04992": {"publish_time": "2024-09-08", "title": "InstInfer: In-Storage Attention Offloading for Cost-Effective Long-Context LLM Inference", "paper_summary": "The widespread of Large Language Models (LLMs) marks a significant milestone\nin generative AI. Nevertheless, the increasing context length and batch size in\noffline LLM inference escalate the memory requirement of the key-value (KV)\ncache, which imposes a huge burden on the GPU VRAM, especially for\nresource-constraint scenarios (e.g., edge computing and personal devices).\nSeveral cost-effective solutions leverage host memory or SSDs to reduce storage\ncosts for offline inference scenarios and improve the throughput. Nevertheless,\nthey suffer from significant performance penalties imposed by intensive KV\ncache accesses due to limited PCIe bandwidth. To address these issues, we\npropose InstInfer, a novel LLM inference system that offloads the most\nperformance-critical computation (i.e., attention in decoding phase) and data\n(i.e., KV cache) parts to Computational Storage Drives (CSDs), which minimize\nthe enormous KV transfer overheads. InstInfer designs a dedicated flash-aware\nin-storage attention engine with KV cache management mechanisms to exploit the\nhigh internal bandwidths of CSDs instead of being limited by the PCIe\nbandwidth. The optimized P2P transmission between GPU and CSDs further reduces\ndata migration overheads. Experimental results demonstrate that for a 13B model\nusing an NVIDIA A6000 GPU, InstInfer improves throughput for long-sequence\ninference by up to 11.1$\\times$, compared to existing SSD-based solutions such\nas FlexGen.", "paper_summary_zh": "大型語言模型 (LLM) 的廣泛使用標誌著生成式 AI 的一個重要里程碑。然而，離線 LLM 推論中不斷增加的內容長度和批次大小會提升快取值 (KV) 的記憶體需求，這對 GPU VRAM 造成極大的負擔，特別是在資源受限的情況下（例如，邊緣運算和個人裝置）。幾個具有成本效益的解決方案利用主機記憶體或 SSD 來降低離線推論場景的儲存成本並改善吞吐量。然而，由於有限的 PCIe 頻寬，它們會受到密集 KV 快取存取所造成的顯著效能損失。為了解決這些問題，我們提出 InstInfer，一個新穎的 LLM 推論系統，它將效能最關鍵的運算（即解碼階段的注意力）和資料（即 KV 快取）部分卸載到運算儲存磁碟機 (CSD)，這將龐大的 KV 傳輸開銷降到最低。InstInfer 設計了一個專用的快閃記憶體感知的儲存內注意力引擎，具備 KV 快取管理機制，以利用 CSD 的高內部頻寬，而不是受到 PCIe 頻寬的限制。GPU 和 CSD 之間最佳化的 P2P 傳輸進一步降低了資料遷移開銷。實驗結果表明，對於使用 NVIDIA A6000 GPU 的 13B 模型，與現有的基於 SSD 的解決方案（例如 FlexGen）相比，InstInfer 將長序列推論的吞吐量提升了 11.1 倍。", "author": "Xiurui Pan et.al.", "authors": "Xiurui Pan, Endian Li, Qiao Li, Shengwen Liang, Yizhou Shan, Ke Zhou, Yingwei Luo, Xiaolin Wang, Jie Zhang", "id": "2409.04992v1", "paper_url": "http://arxiv.org/abs/2409.04992v1", "repo": "null"}}