{"2412.17629": {"publish_time": "2024-12-23", "title": "Graph Neural Networks Are Evolutionary Algorithms", "paper_summary": "In this paper, we reveal the intrinsic duality between graph neural networks\n(GNNs) and evolutionary algorithms (EAs), bridging two traditionally distinct\nfields. Building on this insight, we propose Graph Neural Evolution (GNE), a\nnovel evolutionary algorithm that models individuals as nodes in a graph and\nleverages designed frequency-domain filters to balance global exploration and\nlocal exploitation. Through the use of these filters, GNE aggregates\nhigh-frequency (diversity-enhancing) and low-frequency (stability-promoting)\ninformation, transforming EAs into interpretable and tunable mechanisms in the\nfrequency domain. Extensive experiments on benchmark functions demonstrate that\nGNE consistently outperforms state-of-the-art algorithms such as GA, DE,\nCMA-ES, SDAES, and RL-SHADE, excelling in complex landscapes, optimal solution\nshifts, and noisy environments. Its robustness, adaptability, and superior\nconvergence highlight its practical and theoretical value. Beyond optimization,\nGNE establishes a conceptual and mathematical foundation linking EAs and GNNs,\noffering new perspectives for both fields. Its framework encourages the\ndevelopment of task-adaptive filters and hybrid approaches for EAs, while its\ninsights can inspire advances in GNNs, such as improved global information\npropagation and mitigation of oversmoothing. GNE's versatility extends to\nsolving challenges in machine learning, including hyperparameter tuning and\nneural architecture search, as well as real-world applications in engineering\nand operations research. By uniting the dynamics of EAs with the structural\ninsights of GNNs, this work provides a foundation for interdisciplinary\ninnovation, paving the way for scalable and interpretable solutions to complex\noptimization problems.", "paper_summary_zh": "<paragraph>在本文中，我們揭示了圖神經網路 (GNN) 和演化演算法 (EA) 之間的內在二元性，連結了兩個傳統上截然不同的領域。基於此見解，我們提出圖神經演化 (GNE)，一種新穎的演化演算法，它將個體建模為圖中的節點，並利用設計的頻域濾波器來平衡整體探索和局部開發。透過使用這些濾波器，GNE 匯聚高頻 (增強多樣性) 和低頻 (促進穩定性) 資訊，將 EA 轉變為頻域中可解釋且可調整的機制。在基準函數上的廣泛實驗證明，GNE 持續優於 GA、DE、CMA-ES、SDAES 和 RL-SHADE 等最先進的演算法，在複雜環境、最佳解位移和雜訊環境中表現出色。其穩健性、適應性和優異的收斂性突顯了其實用和理論價值。除了最佳化之外，GNE 還建立了一個連結 EA 和 GNN 的概念和數學基礎，為這兩個領域提供了新的觀點。其架構鼓勵開發任務自適應濾波器和 EA 的混合方法，而其見解可以激勵 GNN 的進步，例如改善整體資訊傳播和減輕過度平滑。GNE 的多功能性延伸到解決機器學習中的挑戰，包括超參數調整和神經架構搜尋，以及工程和作業研究中的實際應用。透過將 EA 的動態與 GNN 的結構見解結合起來，這項工作為跨領域創新奠定了基礎，為複雜最佳化問題的具可擴充性和可解釋性解決方案鋪平了道路。</paragraph>", "author": "Kaichen Ouyang et.al.", "authors": "Kaichen Ouyang, Shengwei Fu", "id": "2412.17629v1", "paper_url": "http://arxiv.org/abs/2412.17629v1", "repo": "null"}}