{"2407.15255": {"publish_time": "2024-07-21", "title": "Explaining Decisions of Agents in Mixed-Motive Games", "paper_summary": "In recent years, agents have become capable of communicating seamlessly via\nnatural language and navigating in environments that involve cooperation and\ncompetition, a fact that can introduce social dilemmas. Due to the interleaving\nof cooperation and competition, understanding agents' decision-making in such\nenvironments is challenging, and humans can benefit from obtaining\nexplanations. However, such environments and scenarios have rarely been\nexplored in the context of explainable AI. While some explanation methods for\ncooperative environments can be applied in mixed-motive setups, they do not\naddress inter-agent competition, cheap-talk, or implicit communication by\nactions. In this work, we design explanation methods to address these issues.\nThen, we proceed to demonstrate their effectiveness and usefulness for humans,\nusing a non-trivial mixed-motive game as a test case. Lastly, we establish\ngenerality and demonstrate the applicability of the methods to other games,\nincluding one where we mimic human game actions using large language models.", "paper_summary_zh": "近年来，代理人已能够通过自然语言无缝沟通，并在涉及合作和竞争的环境中导航，这一事实可能会带来社会困境。由于合作和竞争的交织，理解代理人在这种环境中的决策具有挑战性，而人类可以从获得解释中受益。然而，在可解释人工智能的背景下，这种环境和场景很少被探索。虽然一些针对合作环境的解释方法可以在混合动机设置中应用，但它们不解决代理间竞争、廉价谈话或通过行动进行的隐式沟通。在这项工作中，我们设计了解释方法来解决这些问题。然后，我们继续使用一个非平凡的混合动机游戏作为测试案例，展示它们对人类的有效性和有用性。最后，我们建立了普遍性，并展示了这些方法对其他游戏的适用性，包括我们使用大型语言模型模仿人类游戏动作的游戏。", "author": "Maayan Orner et.al.", "authors": "Maayan Orner, Oleg Maksimov, Akiva Kleinerman, Charles Ortiz, Sarit Kraus", "id": "2407.15255v1", "paper_url": "http://arxiv.org/abs/2407.15255v1", "repo": "null"}}