{"2409.09858": {"publish_time": "2024-09-15", "title": "A Survey of Out-of-distribution Generalization for Graph Machine Learning from a Causal View", "paper_summary": "Graph machine learning (GML) has been successfully applied across a wide\nrange of tasks. Nonetheless, GML faces significant challenges in generalizing\nover out-of-distribution (OOD) data, which raises concerns about its wider\napplicability. Recent advancements have underscored the crucial role of\ncausality-driven approaches in overcoming these generalization challenges.\nDistinct from traditional GML methods that primarily rely on statistical\ndependencies, causality-focused strategies delve into the underlying causal\nmechanisms of data generation and model prediction, thus significantly\nimproving the generalization of GML across different environments. This paper\noffers a thorough review of recent progress in causality-involved GML\ngeneralization. We elucidate the fundamental concepts of employing causality to\nenhance graph model generalization and categorize the various approaches,\nproviding detailed descriptions of their methodologies and the connections\namong them. Furthermore, we explore the incorporation of causality in other\nrelated important areas of trustworthy GML, such as explanation, fairness, and\nrobustness. Concluding with a discussion on potential future research\ndirections, this review seeks to articulate the continuing development and\nfuture potential of causality in enhancing the trustworthiness of graph machine\nlearning.", "paper_summary_zh": "圖形機器學習 (GML) 已成功應用於廣泛的任務中。儘管如此，GML 在推廣到分布外 (OOD) 資料時面臨重大挑戰，這引發了對其更廣泛適用性的擔憂。最近的進展強調了因果驅動方法在克服這些概化挑戰中的關鍵作用。不同於主要依賴統計依賴性的傳統 GML 方法，專注於因果關係的策略深入探討資料生成和模型預測的底層因果機制，從而顯著改善了 GML 在不同環境中的概化。本文全面回顧了因果關係參與的 GML 概化的最新進展。我們闡明了使用因果關係來增強圖形模型概化的基本概念，並對各種方法進行分類，詳細描述它們的方法論和它們之間的聯繫。此外，我們探討了因果關係在其他相關的重要可信賴 GML 領域中的應用，例如解釋、公平性和穩健性。本綜述以對潛在未來研究方向的討論作為結尾，旨在闡明因果關係在增強圖形機器學習的可信度方面的持續發展和未來潛力。", "author": "Jing Ma et.al.", "authors": "Jing Ma", "id": "2409.09858v1", "paper_url": "http://arxiv.org/abs/2409.09858v1", "repo": "null"}}