{"2501.12011": {"publish_time": "2025-01-21", "title": "Reference-free Evaluation Metrics for Text Generation: A Survey", "paper_summary": "A number of automatic evaluation metrics have been proposed for natural\nlanguage generation systems. The most common approach to automatic evaluation\nis the use of a reference-based metric that compares the model's output with\ngold-standard references written by humans. However, it is expensive to create\nsuch references, and for some tasks, such as response generation in dialogue,\ncreating references is not a simple matter. Therefore, various reference-free\nmetrics have been developed in recent years. In this survey, which intends to\ncover the full breadth of all NLG tasks, we investigate the most commonly used\napproaches, their application, and their other uses beyond evaluating models.\nThe survey concludes by highlighting some promising directions for future\nresearch.", "paper_summary_zh": "針對自然語言生成系統，已經提出許多自動評量指標。最常見的自動評量方法，是使用參考基礎指標，將模型的輸出與人類撰寫的黃金標準參考進行比較。然而，建立這些參考的成本很高，而且對於某些任務（例如對話中的回應產生），建立參考並非易事。因此，近年來已經開發出各種無參考指標。在本調查中，我們旨在涵蓋所有 NLG 任務的完整廣度，探討最常用的方法、其應用以及除了評估模型之外的其他用途。本調查最後重點說明未來研究的一些有希望的方向。", "author": "Takumi Ito et.al.", "authors": "Takumi Ito, Kees van Deemter, Jun Suzuki", "id": "2501.12011v1", "paper_url": "http://arxiv.org/abs/2501.12011v1", "repo": "null"}}