{"2407.03183": {"publish_time": "2024-07-03", "title": "A Formal Model for Artificial Intelligence Applications in Automation Systems", "paper_summary": "The integration of Artificial Intelligence (AI) into automation systems has\nthe potential to enhance efficiency and to address currently unsolved existing\ntechnical challenges. However, the industry-wide adoption of AI is hindered by\nthe lack of standardized documentation for the complex compositions of\nautomation systems, AI software, production hardware, and their\ninterdependencies. This paper proposes a formal model using standards and\nontologies to provide clear and structured documentation of AI applications in\nautomation systems. The proposed information model for artificial intelligence\nin automation systems (AIAS) utilizes ontology design patterns to map and link\nvarious aspects of automation systems and AI software. Validated through a\npractical example, the model demonstrates its effectiveness in improving\ndocumentation practices and aiding the sustainable implementation of AI in\nindustrial settings.", "paper_summary_zh": "人工智慧 (AI) 整合到自動化系統中，有潛力提升效率，並解決目前現有的未解決技術挑戰。然而，由於缺乏標準化文件說明，說明自動化系統、AI 軟體、生產硬體及其相互依賴性的複雜組成，導致 AI 無法廣泛運用於產業。本文提出一個使用標準和本体的正式模型，提供 AI 在自動化系統中應用的清晰且有條理的文件說明。所提出的自動化系統中人工智慧資訊模型 (AIAS)，利用本体設計模式來對應並連結自動化系統和 AI 軟體的各種面向。透過實際範例驗證，該模型證明其在改善文件說明實務，以及協助 AI 在產業環境中永續實作方面的效用。", "author": "Marvin Schieseck et.al.", "authors": "Marvin Schieseck, Philip Topalis, Lasse Reinpold, Felix Gehlhoff, Alexander Fay", "id": "2407.03183v1", "paper_url": "http://arxiv.org/abs/2407.03183v1", "repo": "null"}}