{"2407.04597": {"publish_time": "2024-07-05", "title": "Feature Attenuation of Defective Representation Can Resolve Incomplete Masking on Anomaly Detection", "paper_summary": "In unsupervised anomaly detection (UAD) research, while state-of-the-art\nmodels have reached a saturation point with extensive studies on public\nbenchmark datasets, they adopt large-scale tailor-made neural networks (NN) for\ndetection performance or pursued unified models for various tasks. Towards edge\ncomputing, it is necessary to develop a computationally efficient and scalable\nsolution that avoids large-scale complex NNs. Motivated by this, we aim to\noptimize the UAD performance with minimal changes to NN settings. Thus, we\nrevisit the reconstruction-by-inpainting approach and rethink to improve it by\nanalyzing strengths and weaknesses. The strength of the SOTA methods is a\nsingle deterministic masking approach that addresses the challenges of random\nmultiple masking that is inference latency and output inconsistency.\nNevertheless, the issue of failure to provide a mask to completely cover\nanomalous regions is a remaining weakness. To mitigate this issue, we propose\nFeature Attenuation of Defective Representation (FADeR) that only employs two\nMLP layers which attenuates feature information of anomaly reconstruction\nduring decoding. By leveraging FADeR, features of unseen anomaly patterns are\nreconstructed into seen normal patterns, reducing false alarms. Experimental\nresults demonstrate that FADeR achieves enhanced performance compared to\nsimilar-scale NNs. Furthermore, our approach exhibits scalability in\nperformance enhancement when integrated with other single deterministic masking\nmethods in a plug-and-play manner.", "paper_summary_zh": "在無監督異常偵測 (UAD) 研究中，儘管最先進的模型已針對公眾基準資料集進行廣泛研究而達到飽和點，但它們採用了大規模客製化神經網路 (NN) 來偵測效能，或針對各種任務追求統一模型。為了達到邊緣運算，有必要開發一種計算有效率且可擴充的解決方案，以避免大規模複雜的 NN。基於這個動機，我們旨在以最小的 NN 設定變更來最佳化 UAD 效能。因此，我們重新探討了透過修復重建的方法，並透過分析優缺點來重新思考以改善它。SOTA 方法的優點是一種單一的確定性遮罩方法，它解決了隨機多重遮罩的挑戰，即推論延遲和輸出不一致。儘管如此，無法提供遮罩來完全覆蓋異常區域的問題仍然是一個缺點。為了減輕這個問題，我們提出了缺陷表徵特徵衰減 (FADeR)，它僅使用兩個 MLP 層，在解碼過程中衰減異常重建的特徵資訊。透過利用 FADeR，未見異常模式的特徵被重建成已見的正常模式，減少誤報。實驗結果表明，與類似規模的 NN 相比，FADeR 達到了增強的效能。此外，我們的做法在與其他單一確定性遮罩方法以即插即用方式整合時，展現了效能增強的可擴充性。", "author": "YeongHyeon Park et.al.", "authors": "YeongHyeon Park, Sungho Kang, Myung Jin Kim, Hyeong Seok Kim, Juneho Yi", "id": "2407.04597v1", "paper_url": "http://arxiv.org/abs/2407.04597v1", "repo": "null"}}