{"2501.05646": {"publish_time": "2025-01-10", "title": "Efficient Representations for High-Cardinality Categorical Variables in Machine Learning", "paper_summary": "High\\-cardinality categorical variables pose significant challenges in\nmachine learning, particularly in terms of computational efficiency and model\ninterpretability. Traditional one\\-hot encoding often results in\nhigh\\-dimensional sparse feature spaces, increasing the risk of overfitting and\nreducing scalability. This paper introduces novel encoding techniques,\nincluding means encoding, low\\-rank encoding, and multinomial logistic\nregression encoding, to address these challenges. These methods leverage\nsufficient representations to generate compact and informative embeddings of\ncategorical data. We conduct rigorous theoretical analyses and empirical\nvalidations on diverse datasets, demonstrating significant improvements in\nmodel performance and computational efficiency compared to baseline methods.\nThe proposed techniques are particularly effective in domains requiring\nscalable solutions for large datasets, paving the way for more robust and\nefficient applications in machine learning.", "paper_summary_zh": "高基數分類變數在機器學習中造成重大挑戰，尤其是在計算效率和模型可解釋性方面。傳統的一熱編碼通常會產生高維稀疏特徵空間，增加過度擬合的風險並降低可擴充性。本文介紹了新穎的編碼技術，包括均值編碼、低秩編碼和多項邏輯迴歸編碼，以應對這些挑戰。這些方法利用充足的表示來產生分類資料的緊湊且有資訊的嵌入。我們對不同的資料集進行嚴謹的理論分析和實證驗證，證明與基線方法相比，模型效能和計算效率有顯著的改善。所提出的技術在需要針對大型資料集提供可擴充解決方案的領域特別有效，為機器學習中更強大且更有效的應用鋪路。", "author": "Zixuan Liang et.al.", "authors": "Zixuan Liang", "id": "2501.05646v1", "paper_url": "http://arxiv.org/abs/2501.05646v1", "repo": "null"}}