{"2407.03179": {"publish_time": "2024-07-03", "title": "Motion meets Attention: Video Motion Prompts", "paper_summary": "Videos contain rich spatio-temporal information. Traditional methods for\nextracting motion, used in tasks such as action recognition, often rely on\nvisual contents rather than precise motion features. This phenomenon is\nreferred to as 'blind motion extraction' behavior, which proves inefficient in\ncapturing motions of interest due to a lack of motion-guided cues. Recently,\nattention mechanisms have enhanced many computer vision tasks by effectively\nhighlighting salient visual areas. Inspired by this, we propose using a\nmodified Sigmoid function with learnable slope and shift parameters as an\nattention mechanism to activate and modulate motion signals derived from frame\ndifferencing maps. This approach generates a sequence of attention maps that\nenhance the processing of motion-related video content. To ensure temporally\ncontinuity and smoothness of the attention maps, we apply pair-wise temporal\nattention variation regularization to remove unwanted motions (e.g., noise)\nwhile preserving important ones. We then perform Hadamard product between each\npair of attention maps and the original video frames to highlight the evolving\nmotions of interest over time. These highlighted motions, termed video motion\nprompts, are subsequently used as inputs to the model instead of the original\nvideo frames. We formalize this process as a motion prompt layer and\nincorporate the regularization term into the loss function to learn better\nmotion prompts. This layer serves as an adapter between the model and the video\ndata, bridging the gap between traditional 'blind motion extraction' and the\nextraction of relevant motions of interest.", "paper_summary_zh": "影片包含豐富的時空資訊。傳統用於動作辨識等任務的動作擷取方法，通常仰賴視覺內容，而非精確的動作特徵。這種現象稱為「盲目動作擷取」行為，因缺乏動作引導線索，而無法有效擷取感興趣的動作。近期，注意力機制透過有效凸顯顯著的視覺區域，增強許多電腦視覺任務。受此啟發，我們提出一種使用具有可學習斜率和位移參數的修正 Sigmoid 函數，作為注意力機制，以啟動和調製從影格差異映射中衍生的動作訊號。此方法會產生一系列注意力映射，增強對動作相關影片內容的處理。為了確保注意力映射的時間連續性和平滑性，我們套用成對的時間注意力變化正規化，以移除不必要的動作（例如雜訊），同時保留重要的動作。接著，我們對每一對注意力映射和原始影片影格執行 Hadamard 乘積，以凸顯隨著時間推移而演化的感興趣動作。這些凸顯的動作稱為影片動作提示，隨後用作模型的輸入，而非原始影片影格。我們將此程序形式化為動作提示層，並將正規化項納入損失函數，以學習更好的動作提示。此層作為模型和影片資料之間的適配器，彌合傳統「盲目動作擷取」與擷取相關感興趣動作之間的差距。", "author": "Qixiang Chen et.al.", "authors": "Qixiang Chen, Lei Wang, Piotr Koniusz, Tom Gedeon", "id": "2407.03179v1", "paper_url": "http://arxiv.org/abs/2407.03179v1", "repo": "null"}}