{"2412.02141": {"publish_time": "2024-12-03", "title": "WSI-LLaVA: A Multimodal Large Language Model for Whole Slide Image", "paper_summary": "Recent advancements in computational pathology have produced patch-level\nMulti-modal Large Language Models (MLLMs), but these models are limited by\ntheir inability to analyze whole slide images (WSIs) comprehensively and their\ntendency to bypass crucial morphological features that pathologists rely on for\ndiagnosis. To address these challenges, we first introduce WSI-Bench, a\nlarge-scale morphology-aware benchmark containing 180k VQA pairs from 9,850\nWSIs across 30 cancer types, designed to evaluate MLLMs' understanding of\nmorphological characteristics crucial for accurate diagnosis. Building upon\nthis benchmark, we present WSI-LLaVA, a novel framework for gigapixel WSI\nunderstanding that employs a three-stage training approach: WSI-text alignment,\nfeature space alignment, and task-specific instruction tuning. To better assess\nmodel performance in pathological contexts, we develop two specialized WSI\nmetrics: WSI-Precision and WSI-Relevance. Experimental results demonstrate that\nWSI-LLaVA outperforms existing models across all capability dimensions, with a\nsignificant improvement in morphological analysis, establishing a clear\ncorrelation between morphological understanding and diagnostic accuracy.", "paper_summary_zh": "近期在計算病理學的進展中，產生了區塊層級的多模態大型語言模型 (MLLM)，但這些模型的限制在於無法全面分析全切片影像 (WSI)，且傾向於忽略病理學家在診斷時依賴的重要形態特徵。為了應對這些挑戰，我們首先推出 WSI-Bench，一個大型且重視形態的基準，包含來自 30 種癌症類型、9,850 個 WSI 的 18 萬個 VQA 配對，旨在評估 MLLM 對形態特徵的理解，這些特徵對於準確診斷至關重要。在此基準之上，我們提出 WSI-LLaVA，一個用於理解吉像素 WSI 的新框架，採用三階段訓練方法：WSI-文本比對、特徵空間比對和特定任務指令調整。為了在病理學背景下更好地評估模型效能，我們開發了兩個專門的 WSI 指標：WSI-精準度和 WSI-相關性。實驗結果表明，WSI-LLaVA 在所有效能面向都優於現有模型，在形態分析方面有顯著的進步，確立了形態理解與診斷準確性之間的明確關聯性。", "author": "Yuci Liang et.al.", "authors": "Yuci Liang, Xinheng Lyu, Meidan Ding, Wenting Chen, Jipeng Zhang, Yuexiang Ren, Xiangjian He, Song Wu, Sen Yang, Xiyue Wang, Xiaohan Xing, Linlin Shen", "id": "2412.02141v1", "paper_url": "http://arxiv.org/abs/2412.02141v1", "repo": "null"}}