{"2411.18324": {"publish_time": "2024-11-27", "title": "RITA: Automatic Framework for Designing of Resilient IoT Applications", "paper_summary": "Designing resilient Internet of Things (IoT) systems requires i)\nidentification of IoT Critical Objects (ICOs) such as services, devices, and\nresources, ii) threat analysis, and iii) mitigation strategy selection.\nHowever, the traditional process for designing resilient IoT systems is still\nmanual, leading to inefficiencies and increased risks. In addition, while tools\nsuch as ChatGPT could support this manual and highly error-prone process, their\nuse raises concerns over data privacy, inconsistent outputs, and internet\ndependence. Therefore, we propose RITA, an automated, open-source framework\nthat uses a fine-tuned RoBERTa-based Named Entity Recognition (NER) model to\nidentify ICOs from IoT requirement documents, correlate threats, and recommend\ncountermeasures. RITA operates entirely offline and can be deployed on-site,\nsafeguarding sensitive information and delivering consistent outputs that\nenhance standardization. In our empirical evaluation, RITA outperformed ChatGPT\nin four of seven ICO categories, particularly in actuator, sensor, network\nresource, and service identification, using both human-annotated and\nChatGPT-generated test data. These findings indicate that RITA can improve\nresilient IoT design by effectively supporting key security operations,\noffering a practical solution for developing robust IoT architectures.", "paper_summary_zh": "設計有復原力的物聯網 (IoT) 系統需要 i)\n識別 IoT 關鍵物件 (ICO)，例如服務、裝置和\n資源，ii) 威脅分析，以及 iii) 緩解策略選擇。\n然而，設計有復原力 IoT 系統的傳統流程仍然\n手動，導致效率低下和風險增加。此外，雖然像 ChatGPT\n這樣的工具可以支援這個手動且極易出錯的流程，但其\n使用會引發對資料隱私、輸出不一致和網路\n依賴性的疑慮。因此，我們提出 RITA，一個自動化的開源架構，\n它使用微調後的 RoBERTa 為基礎的名稱實體辨識 (NER) 模型來\n從 IoT 需求文件識別 ICO，關聯威脅，並建議\n對策。RITA 完全離線運作，且可以部署在現場，\n保護敏感資訊並提供一致的輸出，進而增強標準化。在我們的實證評估中，RITA 在七個 ICO 類別中的四個類別中優於 ChatGPT，特別是在致動器、感測器、網路\n資源和服務識別方面，並使用人工標註和\nChatGPT 生成的測試資料。這些發現表明 RITA 可以透過有效地支援關鍵安全運作來改善有復原力的 IoT 設計，\n提供一個實用的解決方案來開發強健的 IoT 架構。", "author": "Luis Eduardo Pessoa et.al.", "authors": "Luis Eduardo Pessoa, Cristovao Freitas Iglesias Jr, Claudio Miceli", "id": "2411.18324v1", "paper_url": "http://arxiv.org/abs/2411.18324v1", "repo": "https://github.com/lepessoa/rita"}}