{"2410.10414": {"publish_time": "2024-10-14", "title": "On Calibration of LLM-based Guard Models for Reliable Content Moderation", "paper_summary": "Large language models (LLMs) pose significant risks due to the potential for\ngenerating harmful content or users attempting to evade guardrails. Existing\nstudies have developed LLM-based guard models designed to moderate the input\nand output of threat LLMs, ensuring adherence to safety policies by blocking\ncontent that violates these protocols upon deployment. However, limited\nattention has been given to the reliability and calibration of such guard\nmodels. In this work, we empirically conduct comprehensive investigations of\nconfidence calibration for 9 existing LLM-based guard models on 12 benchmarks\nin both user input and model output classification. Our findings reveal that\ncurrent LLM-based guard models tend to 1) produce overconfident predictions, 2)\nexhibit significant miscalibration when subjected to jailbreak attacks, and 3)\ndemonstrate limited robustness to the outputs generated by different types of\nresponse models. Additionally, we assess the effectiveness of post-hoc\ncalibration methods to mitigate miscalibration. We demonstrate the efficacy of\ntemperature scaling and, for the first time, highlight the benefits of\ncontextual calibration for confidence calibration of guard models, particularly\nin the absence of validation sets. Our analysis and experiments underscore the\nlimitations of current LLM-based guard models and provide valuable insights for\nthe future development of well-calibrated guard models toward more reliable\ncontent moderation. We also advocate for incorporating reliability evaluation\nof confidence calibration when releasing future LLM-based guard models.", "paper_summary_zh": "大型語言模型 (LLM) 由於潛在生成有害內容或使用者企圖規避防護措施的風險，因此構成重大風險。現有研究已開發出基於 LLM 的防護模型，旨在調節威脅 LLM 的輸入和輸出，確保在部署時封鎖違反這些協定的內容，從而遵守安全政策。然而，對於此類防護模型的可靠性和校準，卻鮮少受到關注。在這項工作中，我們針對 9 個現有的基於 LLM 的防護模型，在 12 個基準上對使用者輸入和模型輸出分類進行全面的信心校準調查。我們的研究結果顯示，目前的基於 LLM 的防護模型往往會 1) 產生過度自信的預測，2) 在遭受越獄攻擊時表現出顯著的校準不當，以及 3) 對不同類型的回應模型所產生的輸出表現出有限的穩健性。此外，我們評估事後校準方法在減輕校準不當方面的有效性。我們展示了溫度調整的功效，並首次強調了情境校準對於防護模型的信心校準（特別是在沒有驗證集的情況下）所帶來的益處。我們的分析和實驗強調了目前基於 LLM 的防護模型的限制，並為未來開發校準良好的防護模型以實現更可靠的內容審核提供了寶貴的見解。我們也主張在釋出未來的基於 LLM 的防護模型時，納入信心校準的可靠性評估。", "author": "Hongfu Liu et.al.", "authors": "Hongfu Liu, Hengguan Huang, Hao Wang, Xiangming Gu, Ye Wang", "id": "2410.10414v1", "paper_url": "http://arxiv.org/abs/2410.10414v1", "repo": "null"}}