{"2409.09808": {"publish_time": "2024-09-15", "title": "Famba-V: Fast Vision Mamba with Cross-Layer Token Fusion", "paper_summary": "Mamba and Vision Mamba (Vim) models have shown their potential as an\nalternative to methods based on Transformer architecture. This work introduces\nFast Mamba for Vision (Famba-V), a cross-layer token fusion technique to\nenhance the training efficiency of Vim models. The key idea of Famba-V is to\nidentify and fuse similar tokens across different Vim layers based on a suit of\ncross-layer strategies instead of simply applying token fusion uniformly across\nall the layers that existing works propose. We evaluate the performance of\nFamba-V on CIFAR-100. Our results show that Famba-V is able to enhance the\ntraining efficiency of Vim models by reducing both training time and peak\nmemory usage during training. Moreover, the proposed cross-layer strategies\nallow Famba-V to deliver superior accuracy-efficiency trade-offs. These results\nall together demonstrate Famba-V as a promising efficiency enhancement\ntechnique for Vim models.", "paper_summary_zh": "Mamba 和 Vision Mamba (Vim) 模型已顯示其作為基於 Transformer 架構方法的替代方案的潛力。這項工作引入了 Fast Mamba for Vision (Famba-V)，一種跨層次標記融合技術，以增強 Vim 模型的訓練效率。Famba-V 的關鍵思想是根據跨層次策略組，識別並融合不同 Vim 層次之間的相似標記，而不是像現有工作所建議的那樣，僅將標記融合均勻地應用於所有層次。我們在 CIFAR-100 上評估 Famba-V 的效能。我們的結果顯示，Famba-V 能夠透過減少訓練時間和訓練期間的記憶體使用高峰，來增強 Vim 模型的訓練效率。此外，建議的跨層次策略允許 Famba-V 提供優越的準確度效率權衡。這些結果共同證明 Famba-V 是一種有前途的 Vim 模型效率增強技術。", "author": "Hui Shen et.al.", "authors": "Hui Shen, Zhongwei Wan, Xin Wang, Mi Zhang", "id": "2409.09808v1", "paper_url": "http://arxiv.org/abs/2409.09808v1", "repo": "https://github.com/aiot-mlsys-lab/famba-v"}}