{"2412.06742": {"publish_time": "2024-12-09", "title": "ContRail: A Framework for Realistic Railway Image Synthesis using ControlNet", "paper_summary": "Deep Learning became an ubiquitous paradigm due to its extraordinary\neffectiveness and applicability in numerous domains. However, the approach\nsuffers from the high demand of data required to achieve the potential of this\ntype of model. An ever-increasing sub-field of Artificial Intelligence, Image\nSynthesis, aims to address this limitation through the design of intelligent\nmodels capable of creating original and realistic images, endeavour which could\ndrastically reduce the need for real data. The Stable Diffusion generation\nparadigm recently propelled state-of-the-art approaches to exceed all previous\nbenchmarks. In this work, we propose the ContRail framework based on the novel\nStable Diffusion model ControlNet, which we empower through a multi-modal\nconditioning method. We experiment with the task of synthetic railway image\ngeneration, where we improve the performance in rail-specific tasks, such as\nrail semantic segmentation by enriching the dataset with realistic synthetic\nimages.", "paper_summary_zh": "深度學習由於其非凡的效能和在眾多領域的適用性，成為了無所不在的範例。然而，這種方法需要大量資料才能達到這種類型的模型的潛力，這一點讓它備受困擾。人工智慧的一個不斷增長的子領域——影像合成，旨在透過設計能夠創造出原創且逼真的影像的智慧模型來解決這個限制，這項努力可以大幅減少對真實資料的需求。Stable Diffusion 生成範例最近推動了最先進的方法，超越了所有先前的基準。在這項工作中，我們提出了基於新穎的 Stable Diffusion 模型 ControlNet 的 ContRail 框架，我們透過多模式條件化方法賦予它能力。我們實驗了合成鐵路影像生成的任務，在鐵路特定任務中改進了效能，例如透過使用逼真的合成影像豐富資料集，來進行鐵路語意分割。", "author": "Andrei-Robert Alexandrescu et.al.", "authors": "Andrei-Robert Alexandrescu, Razvan-Gabriel Petec, Alexandru Manole, Laura-Silvia Diosan", "id": "2412.06742v1", "paper_url": "http://arxiv.org/abs/2412.06742v1", "repo": "null"}}