{"2408.08506": {"publish_time": "2024-08-16", "title": "Ex3: Automatic Novel Writing by Extracting, Excelsior and Expanding", "paper_summary": "Generating long-term texts such as novels using artificial intelligence has\nalways been a challenge. A common approach is to use large language models\n(LLMs) to construct a hierarchical framework that first plans and then writes.\nDespite the fact that the generated novels reach a sufficient length, they\nexhibit poor logical coherence and appeal in their plots and deficiencies in\ncharacter and event depiction, ultimately compromising the overall narrative\nquality. In this paper, we propose a method named Extracting Excelsior and\nExpanding. Ex3 initially extracts structure information from raw novel data. By\ncombining this structure information with the novel data, an\ninstruction-following dataset is meticulously crafted. This dataset is then\nutilized to fine-tune the LLM, aiming for excelsior generation performance. In\nthe final stage, a tree-like expansion method is deployed to facilitate the\ngeneration of arbitrarily long novels. Evaluation against previous methods\nshowcases Ex3's ability to produce higher-quality long-form novels.", "paper_summary_zh": "使用人工智慧生成長篇文字（例如小說）一直是一項挑戰。常見的方法是使用大型語言模型 (LLM) 建立階層架構，先進行規劃，再進行寫作。儘管生成的長篇小說長度足夠，但情節缺乏邏輯一致性和吸引力，且在角色和事件描寫上有所不足，最終影響整體敘事的品質。在本文中，我們提出了一種名為「提取精華並擴充」的方法。Ex3 最初從原始小說資料中提取結構資訊。透過將此結構資訊與小說資料結合，精心製作一個遵循說明的資料集。然後使用此資料集微調 LLM，目標是獲得卓越的生成效能。在最後一個階段，部署樹狀擴充方法，以利於生成任意長度的長篇小說。與先前方法的評估結果顯示，Ex3 能夠產生品質更高的長篇小說。", "author": "Huang Lei et.al.", "authors": "Huang Lei, Jiaming Guo, Guanhua He, Xishan Zhang, Rui Zhang, Shaohui Peng, Shaoli Liu, Tianshi Chen", "id": "2408.08506v1", "paper_url": "http://arxiv.org/abs/2408.08506v1", "repo": "null"}}