{"2407.07612": {"publish_time": "2024-07-10", "title": "Teaching Transformers Causal Reasoning through Axiomatic Training", "paper_summary": "For text-based AI systems to interact in the real world, causal reasoning is\nan essential skill. Since interventional data is costly to generate, we study\nto what extent an agent can learn causal reasoning from passive data.\nSpecifically, we consider an axiomatic training setup where an agent learns\nfrom multiple demonstrations of a causal axiom (or rule), rather than\nincorporating the axiom as an inductive bias or inferring it from data values.\nA key question is whether the agent would learn to generalize from the axiom\ndemonstrations to new scenarios. For example, if a transformer model is trained\non demonstrations of the causal transitivity axiom over small graphs, would it\ngeneralize to applying the transitivity axiom over large graphs? Our results,\nbased on a novel axiomatic training scheme, indicate that such generalization\nis possible. We consider the task of inferring whether a variable causes\nanother variable, given a causal graph structure. We find that a 67 million\nparameter transformer model, when trained on linear causal chains (along with\nsome noisy variations) can generalize well to new kinds of graphs, including\nlonger causal chains, causal chains with reversed order, and graphs with\nbranching; even when it is not explicitly trained for such settings. Our model\nperforms at par (or even better) than many larger language models such as\nGPT-4, Gemini Pro, and Phi-3. Overall, our axiomatic training framework\nprovides a new paradigm of learning causal reasoning from passive data that can\nbe used to learn arbitrary axioms, as long as sufficient demonstrations can be\ngenerated.", "paper_summary_zh": "<paragraph>對於基於文字的人工智慧系統與真實世界互動來說，因果推理是一項必要的技能。由於介入資料的產生成本很高，我們研究一位代理人從被動資料中學習因果推理的程度。具體來說，我們考慮一個公理訓練設置，其中一位代理人從因果公理（或規則）的多個示範中學習，而不是將公理作為歸納偏誤或從資料值中推斷出來。一個關鍵問題是代理人是否會學會從公理示範推廣到新的場景。例如，如果一個Transformer模型在小圖表上因果傳遞性公理的示範中接受訓練，它是否會推廣到在大圖表上應用傳遞性公理？我們的結果基於一個新穎的公理訓練方案，表明這樣的概括是可能的。我們考慮推論一個變數是否導致另一個變數的任務，給定一個因果圖結構。我們發現一個 6700 萬個參數的Transformer模型，在線性因果鏈（以及一些雜訊變化）上訓練時，可以很好地概括到新類型的圖形，包括更長的因果鏈、順序相反的因果鏈和具有分支的圖形；即使它沒有針對此類設置進行明確訓練。我們的模型表現與許多較大的語言模型（例如 GPT-4、Gemini Pro 和 Phi-3）相當（甚至更好）。總體而言，我們的公理訓練框架提供了一個從被動資料中學習因果推理的新範例，只要可以產生足夠的示範，就可以用於學習任意公理。</paragraph>", "author": "Aniket Vashishtha et.al.", "authors": "Aniket Vashishtha, Abhinav Kumar, Abbavaram Gowtham Reddy, Vineeth N Balasubramanian, Amit Sharma", "id": "2407.07612v1", "paper_url": "http://arxiv.org/abs/2407.07612v1", "repo": "null"}}