{"2409.19998": {"publish_time": "2024-09-30", "title": "Do Influence Functions Work on Large Language Models?", "paper_summary": "Influence functions aim to quantify the impact of individual training data\npoints on a model's predictions. While extensive research has been conducted on\ninfluence functions in traditional machine learning models, their application\nto large language models (LLMs) has been limited. In this work, we conduct a\nsystematic study to address a key question: do influence functions work on\nLLMs? Specifically, we evaluate influence functions across multiple tasks and\nfind that they consistently perform poorly in most settings. Our further\ninvestigation reveals that their poor performance can be attributed to: (1)\ninevitable approximation errors when estimating the iHVP component due to the\nscale of LLMs, (2) uncertain convergence during fine-tuning, and, more\nfundamentally, (3) the definition itself, as changes in model parameters do not\nnecessarily correlate with changes in LLM behavior. Our study thus suggests the\nneed for alternative approaches for identifying influential samples. To support\nfuture work, our code is made available at\nhttps://github.com/plumprc/Failures-of-Influence-Functions-in-LLMs.", "paper_summary_zh": "影響函數旨在量化個別訓練資料點對模型預測的影響。雖然針對傳統機器學習模型已進行廣泛的研究，但其在大型語言模型 (LLM) 中的應用受到限制。在這項工作中，我們進行一項系統性研究以解決一個關鍵問題：影響函數是否適用於 LLM？具體而言，我們跨多個任務評估影響函數，並發現它們在大多數設定中表現持續不佳。我們的進一步調查顯示，其表現不佳可歸因於：(1) 由於 LLM 的規模，在估計 iHVP 組成部分時出現不可避免的近似誤差，(2) 微調期間的不確定收斂，以及更根本地，(3) 定義本身，因為模型參數的變化並不一定與 LLM 行為的變化相關。因此，我們的研究表明需要採用替代方法來識別有影響力的樣本。為了支持未來的研究，我們的程式碼已於 https://github.com/plumprc/Failures-of-Influence-Functions-in-LLMs 公開。", "author": "Zhe Li et.al.", "authors": "Zhe Li, Wei Zhao, Yige Li, Jun Sun", "id": "2409.19998v1", "paper_url": "http://arxiv.org/abs/2409.19998v1", "repo": "null"}}