{"2408.02373": {"publish_time": "2024-08-05", "title": "Operationalizing Contextual Integrity in Privacy-Conscious Assistants", "paper_summary": "Advanced AI assistants combine frontier LLMs and tool access to autonomously\nperform complex tasks on behalf of users. While the helpfulness of such\nassistants can increase dramatically with access to user information including\nemails and documents, this raises privacy concerns about assistants sharing\ninappropriate information with third parties without user supervision. To steer\ninformation-sharing assistants to behave in accordance with privacy\nexpectations, we propose to operationalize $\\textit{contextual integrity}$\n(CI), a framework that equates privacy with the appropriate flow of information\nin a given context. In particular, we design and evaluate a number of\nstrategies to steer assistants' information-sharing actions to be CI compliant.\nOur evaluation is based on a novel form filling benchmark composed of synthetic\ndata and human annotations, and it reveals that prompting frontier LLMs to\nperform CI-based reasoning yields strong results.", "paper_summary_zh": "進階人工智慧助理結合前沿 LLM 與工具存取，以自動化執行複雜任務，代表使用者執行。雖然此類助理的便利性會隨著存取使用者資訊（包括電子郵件和文件）而大幅提升，但這也引發了隱私疑慮，擔心助理會在未經使用者監督的情況下，與第三方分享不適當的資訊。為了引導資訊共享助理，使其行為符合隱私期望，我們提議將「脈絡完整性」（CI）操作化，此架構將隱私與特定脈絡中適當的資訊流畫上等號。特別是，我們設計並評估多種策略，以引導助理的資訊共享行為，符合 CI 規範。我們的評估是基於由合成資料和人為註解組成的新穎表單填寫基準，結果顯示提示前沿 LLM 執行基於 CI 的推理，可產生強而有力的成果。", "author": "Sahra Ghalebikesabi et.al.", "authors": "Sahra Ghalebikesabi, Eugene Bagdasaryan, Ren Yi, Itay Yona, Ilia Shumailov, Aneesh Pappu, Chongyang Shi, Laura Weidinger, Robert Stanforth, Leonard Berrada, Pushmeet Kohli, Po-Sen Huang, Borja Balle", "id": "2408.02373v1", "paper_url": "http://arxiv.org/abs/2408.02373v1", "repo": "null"}}