{"2411.07873": {"publish_time": "2024-11-12", "title": "Diverse capability and scaling of diffusion and auto-regressive models when learning abstract rules", "paper_summary": "Humans excel at discovering regular structures from limited samples and\napplying inferred rules to novel settings. We investigate whether modern\ngenerative models can similarly learn underlying rules from finite samples and\nperform reasoning through conditional sampling. Inspired by Raven's Progressive\nMatrices task, we designed GenRAVEN dataset, where each sample consists of\nthree rows, and one of 40 relational rules governing the object position,\nnumber, or attributes applies to all rows. We trained generative models to\nlearn the data distribution, where samples are encoded as integer arrays to\nfocus on rule learning. We compared two generative model families: diffusion\n(EDM, DiT, SiT) and autoregressive models (GPT2, Mamba). We evaluated their\nability to generate structurally consistent samples and perform panel\ncompletion via unconditional and conditional sampling. We found diffusion\nmodels excel at unconditional generation, producing more novel and consistent\nsamples from scratch and memorizing less, but performing less well in panel\ncompletion, even with advanced conditional sampling methods. Conversely,\nautoregressive models excel at completing missing panels in a rule-consistent\nmanner but generate less consistent samples unconditionally. We observe diverse\ndata scaling behaviors: for both model families, rule learning emerges at a\ncertain dataset size - around 1000s examples per rule. With more training data,\ndiffusion models improve both their unconditional and conditional generation\ncapabilities. However, for autoregressive models, while panel completion\nimproves with more training data, unconditional generation consistency\ndeclines. Our findings highlight complementary capabilities and limitations of\ndiffusion and autoregressive models in rule learning and reasoning tasks,\nsuggesting avenues for further research into their mechanisms and potential for\nhuman-like reasoning.", "paper_summary_zh": "人類擅長從有限的樣本中發現規則結構，並將推論出的規則應用於新的設定。我們探討現代生成模型是否能以類似的方式從有限樣本中學習基礎規則，並透過條件取樣進行推理。在 Raven's Progressive Matrices 任務的啟發下，我們設計了 GenRAVEN 資料集，每個樣本包含三行，且 40 個關係規則中的其中一個適用於所有行的物件位置、數量或屬性。我們訓練生成模型學習資料分佈，其中樣本編碼為整數陣列，以專注於規則學習。我們比較了兩個生成模型家族：擴散（EDM、DiT、SiT）和自迴歸模型（GPT2、Mamba）。我們評估了它們產生結構一致樣本和透過無條件和條件取樣完成面板的能力。我們發現擴散模型在無條件產生方面表現出色，從頭開始產生更多新穎且一致的樣本，且記憶力較差，但在面板完成方面表現較差，即使使用進階條件取樣方法也是如此。相反地，自迴歸模型擅長以規則一致的方式完成遺失的面板，但無條件產生的一致性較差。我們觀察到不同的資料擴充行為：對於這兩個模型家族，規則學習出現在某個資料集大小時 - 每個規則約 1000 個範例。隨著更多訓練資料，擴散模型改善了它們的無條件和條件產生能力。然而，對於自迴歸模型，雖然面板完成隨著更多訓練資料而改善，但無條件產生的一致性卻下降。我們的發現突出了擴散和自迴歸模型在規則學習和推理任務中的互補能力和限制，並提出了進一步研究它們的機制和人類推理潛力的途徑。", "author": "Binxu Wang et.al.", "authors": "Binxu Wang, Jiaqi Shang, Haim Sompolinsky", "id": "2411.07873v1", "paper_url": "http://arxiv.org/abs/2411.07873v1", "repo": "null"}}