{"2411.19876": {"publish_time": "2024-11-29", "title": "LUMIA: Linear probing for Unimodal and MultiModal Membership Inference Attacks leveraging internal LLM states", "paper_summary": "Large Language Models (LLMs) are increasingly used in a variety of\napplications, but concerns around membership inference have grown in parallel.\nPrevious efforts focus on black-to-grey-box models, thus neglecting the\npotential benefit from internal LLM information. To address this, we propose\nthe use of Linear Probes (LPs) as a method to detect Membership Inference\nAttacks (MIAs) by examining internal activations of LLMs. Our approach, dubbed\nLUMIA, applies LPs layer-by-layer to get fine-grained data on the model inner\nworkings. We test this method across several model architectures, sizes and\ndatasets, including unimodal and multimodal tasks. In unimodal MIA, LUMIA\nachieves an average gain of 15.71 % in Area Under the Curve (AUC) over previous\ntechniques. Remarkably, LUMIA reaches AUC>60% in 65.33% of cases -- an\nincrement of 46.80% against the state of the art. Furthermore, our approach\nreveals key insights, such as the model layers where MIAs are most detectable.\nIn multimodal models, LPs indicate that visual inputs can significantly\ncontribute to detect MIAs -- AUC>60% is reached in 85.90% of experiments.", "paper_summary_zh": "大型語言模型 (LLM)  zunehmend in einer Vielzahl von Anwendungen eingesetzt, aber Bedenken hinsichtlich der Mitgliedschaftsinferenz sind parallel dazu gewachsen. Frühere Bemühungen konzentrieren sich auf Black-to-Grey-Box-Modelle und vernachlässigen so den potenziellen Nutzen interner LLM-Informationen. Um dies anzugehen, schlagen wir vor, lineare Sonden (LPs) als Methode zur Erkennung von Mitgliedschaftsinferenzangriffen (MIAs) zu verwenden, indem wir interne Aktivierungen von LLMs untersuchen. Unser Ansatz, der als LUMIA bezeichnet wird, wendet LPs Schicht für Schicht an, um detaillierte Daten über die inneren Abläufe des Modells zu erhalten. Wir testen diese Methode für verschiedene Modellarchitekturen, Größen und Datensätze, einschließlich unimodaler und multimodaler Aufgaben. In unimodalen MIA erzielt LUMIA eine durchschnittliche Steigerung von 15,71 % in der Fläche unter der Kurve (AUC) gegenüber früheren Techniken. Bemerkenswerterweise erreicht LUMIA in 65,33 % der Fälle AUC > 60 % – eine Steigerung von 46,80 % gegenüber dem Stand der Technik. Darüber hinaus liefert unser Ansatz wichtige Erkenntnisse, wie z. B. die Modellebenen, in denen MIAs am besten nachweisbar sind. In multimodalen Modellen zeigen LPs, dass visuelle Eingaben erheblich zur Erkennung von MIAs beitragen können – AUC > 60 % wird in 85,90 % der Experimente erreicht.", "author": "Luis Ibanez-Lissen et.al.", "authors": "Luis Ibanez-Lissen, Lorena Gonzalez-Manzano, Jose Maria de Fuentes, Nicolas Anciaux, Joaquin Garcia-Alfaro", "id": "2411.19876v2", "paper_url": "http://arxiv.org/abs/2411.19876v2", "repo": "null"}}