{"2405.11841": {"publish_time": "2024-05-20", "title": "Evaluating and Modeling Social Intelligence: A Comparative Study of Human and AI Capabilities", "paper_summary": "Facing the current debate on whether Large Language Models (LLMs) attain\nnear-human intelligence levels (Mitchell & Krakauer, 2023; Bubeck et al., 2023;\nKosinski, 2023; Shiffrin & Mitchell, 2023; Ullman, 2023), the current study\nintroduces a benchmark for evaluating social intelligence, one of the most\ndistinctive aspects of human cognition. We developed a comprehensive\ntheoretical framework for social dynamics and introduced two evaluation tasks:\nInverse Reasoning (IR) and Inverse Inverse Planning (IIP). Our approach also\nencompassed a computational model based on recursive Bayesian inference, adept\nat elucidating diverse human behavioral patterns. Extensive experiments and\ndetailed analyses revealed that humans surpassed the latest GPT models in\noverall performance, zero-shot learning, one-shot generalization, and\nadaptability to multi-modalities. Notably, GPT models demonstrated social\nintelligence only at the most basic order (order = 0), in stark contrast to\nhuman social intelligence (order >= 2). Further examination indicated a\npropensity of LLMs to rely on pattern recognition for shortcuts, casting doubt\non their possession of authentic human-level social intelligence. Our codes,\ndataset, appendix and human data are released at\nhttps://github.com/bigai-ai/Evaluate-n-Model-Social-Intelligence.", "paper_summary_zh": "<paragraph>面對大型語言模型 (LLM) 是否達到接近人類智慧水準的當前爭論（Mitchell & Krakauer，2023；Bubeck et al.，2023；Kosinski，2023；Shiffrin & Mitchell，2023；Ullman，2023），本研究提出了評估社交智慧的基準，這是人類認知最顯著的特徵之一。我們為社會動態開發了一個全面的理論框架，並引入了兩個評估任務：逆向推理 (IR) 和逆向逆向規劃 (IIP)。我們的做法還包括一個基於遞迴貝氏推論的計算模型，擅長闡明各種人類行為模式。廣泛的實驗和詳細的分析表明，人類在整體表現、零次學習、一次性概括和對多模態的適應性方面都超越了最新的 GPT 模型。值得注意的是，GPT 模型僅在最基本的順序（順序 = 0）表現出社交智慧，這與人類社交智慧（順序 >= 2）形成鮮明對比。進一步的檢查表明，LLM 傾向於依賴模式識別來尋找捷徑，讓人懷疑它們是否具備真正的、人類水準的社交智慧。我們的程式碼、資料集、附錄和人類資料已於 https://github.com/bigai-ai/Evaluate-n-Model-Social-Intelligence 發布。</paragraph>", "author": "Junqi Wang et.al.", "authors": "Junqi Wang, Chunhui Zhang, Jiapeng Li, Yuxi Ma, Lixing Niu, Jiaheng Han, Yujia Peng, Yixin Zhu, Lifeng Fan", "id": "2405.11841v1", "paper_url": "http://arxiv.org/abs/2405.11841v1", "repo": "https://github.com/bigai-ai/evaluate-n-model-social-intelligence"}}