{"2411.04397": {"publish_time": "2024-11-07", "title": "A Bayesian Mixture Model of Temporal Point Processes with Determinantal Point Process Prior", "paper_summary": "Asynchronous event sequence clustering aims to group similar event sequences\nin an unsupervised manner. Mixture models of temporal point processes have been\nproposed to solve this problem, but they often suffer from overfitting, leading\nto excessive cluster generation with a lack of diversity. To overcome these\nlimitations, we propose a Bayesian mixture model of Temporal Point Processes\nwith Determinantal Point Process prior (TP$^2$DP$^2$) and accordingly an\nefficient posterior inference algorithm based on conditional Gibbs sampling.\nOur work provides a flexible learning framework for event sequence clustering,\nenabling automatic identification of the potential number of clusters and\naccurate grouping of sequences with similar features. It is applicable to a\nwide range of parametric temporal point processes, including neural\nnetwork-based models. Experimental results on both synthetic and real-world\ndata suggest that our framework could produce moderately fewer yet more diverse\nmixture components, and achieve outstanding results across multiple evaluation\nmetrics.", "paper_summary_zh": "非同步事件序列分群旨在以非監督的方式對類似的事件序列進行分組。已經提出時間點過程的混合模型來解決這個問題，但它們經常會過度擬合，導致過度產生分群，且缺乏多樣性。為了克服這些限制，我們提出了一個具有行列式點過程先驗 (TP$^2$DP$^2$) 的時間點過程貝氏混合模型，並相應地提出了一個基於條件 Gibbs 抽樣的有效後驗推論演算法。我們的研究提供了一個用於事件序列分群的彈性學習框架，能夠自動識別分群的潛在數量，並準確地將具有類似特徵的序列分組。它適用於廣泛的參數化時間點過程，包括基於神經網路的模型。在合成資料和真實世界資料上的實驗結果表明，我們的框架可以產生數量適中但更多樣化的混合組成，並在多個評估指標中取得傑出的結果。", "author": "Yiwei Dong et.al.", "authors": "Yiwei Dong, Shaoxin Ye, Yuwen Cao, Qiyu Han, Hongteng Xu, Hanfang Yang", "id": "2411.04397v1", "paper_url": "http://arxiv.org/abs/2411.04397v1", "repo": "null"}}