{"2411.12643": {"publish_time": "2024-11-19", "title": "DLBacktrace: A Model Agnostic Explainability for any Deep Learning Models", "paper_summary": "The rapid advancement of artificial intelligence has led to increasingly\nsophisticated deep learning models, which frequently operate as opaque 'black\nboxes' with limited transparency in their decision-making processes. This lack\nof interpretability presents considerable challenges, especially in high-stakes\napplications where understanding the rationale behind a model's outputs is as\nessential as the outputs themselves. This study addresses the pressing need for\ninterpretability in AI systems, emphasizing its role in fostering trust,\nensuring accountability, and promoting responsible deployment in\nmission-critical fields. To address the interpretability challenge in deep\nlearning, we introduce DLBacktrace, an innovative technique developed by the\nAryaXAI team to illuminate model decisions across a wide array of domains,\nincluding simple Multi Layer Perceptron (MLPs), Convolutional Neural Networks\n(CNNs), Large Language Models (LLMs), Computer Vision Models, and more.\n  We provide a comprehensive overview of the DLBacktrace algorithm and present\nbenchmarking results, comparing its performance against established\ninterpretability methods, such as SHAP, LIME, GradCAM, Integrated Gradients,\nSmoothGrad, and Attention Rollout, using diverse task-based metrics. The\nproposed DLBacktrace technique is compatible with various model architectures\nbuilt in PyTorch and TensorFlow, supporting models like Llama 3.2, other NLP\narchitectures such as BERT and LSTMs, computer vision models like ResNet and\nU-Net, as well as custom deep neural network (DNN) models for tabular data.\nThis flexibility underscores DLBacktrace's adaptability and effectiveness in\nenhancing model transparency across a broad spectrum of applications. The\nlibrary is open-sourced and available at https://github.com/AryaXAI/DLBacktrace .", "paper_summary_zh": "隨著人工智慧的快速進展，產生了越來越複雜的深度學習模型，這些模型通常作為不透明的「黑盒子」運作，在決策過程中透明度有限。這種可解釋性的缺乏帶來了相當大的挑戰，特別是在高風險應用中，了解模型輸出的背後原因與輸出本身一樣重要。本研究解決了 AI 系統中對於可解釋性的迫切需求，強調其在建立信任、確保問責制以及在任務關鍵領域促進負責任部署中的作用。為了應對深度學習中的可解釋性挑戰，我們引入了 DLBacktrace，這是一種由 AryaXAI 團隊開發的創新技術，用於闡明各種領域的模型決策，包括簡單的多層感知器 (MLP)、卷積神經網路 (CNN)、大型語言模型 (LLM)、電腦視覺模型等等。我們提供了 DLBacktrace 演算法的全面概述，並提出了基準測試結果，使用不同的基於任務的指標，將其效能與已建立的可解釋性方法（例如 SHAP、LIME、GradCAM、整合梯度、SmoothGrad 和注意力展開）進行比較。建議的 DLBacktrace 技術與在 PyTorch 和 TensorFlow 中建立的各種模型架構相容，支援 Llama 3.2 等模型、其他 NLP 架構（例如 BERT 和 LSTM）、電腦視覺模型（例如 ResNet 和 U-Net），以及用於表格資料的客製化深度神經網路 (DNN) 模型。這種靈活性突顯了 DLBacktrace 在廣泛應用中增強模型透明度的適應性和有效性。此程式庫是開源的，可在 https://github.com/AryaXAI/DLBacktrace 取得。", "author": "Vinay Kumar Sankarapu et.al.", "authors": "Vinay Kumar Sankarapu, Chintan Chitroda, Yashwardhan Rathore, Neeraj Kumar Singh, Pratinav Seth", "id": "2411.12643v1", "paper_url": "http://arxiv.org/abs/2411.12643v1", "repo": "https://github.com/aryaxai/dlbacktrace"}}