{"2411.07510": {"publish_time": "2024-11-12", "title": "An Attack Traffic Identification Method Based on Temporal Spectrum", "paper_summary": "To address the issues of insufficient robustness, unstable features, and data\nnoise interference in existing network attack detection and identification\nmodels, this paper proposes an attack traffic detection and identification\nmethod based on temporal spectrum. First, traffic data is segmented by a\nsliding window to construct a feature sequence and a corresponding label\nsequence for network traffic. Next, the proposed spectral label generation\nmethods, SSPE and COAP, are applied to transform the label sequence into\nspectral labels and the feature sequence into temporal features. Spectral\nlabels and temporal features are used to capture and represent behavioral\npatterns of attacks. Finally, the constructed temporal features and spectral\nlabels are used to train models, which subsequently detects and identifies\nnetwork attack behaviors. Experimental results demonstrate that compared to\ntraditional methods, models trained with the SSPE or COAP method improve\nidentification accuracy by 10%, and exhibit strong robustness, particularly in\nnoisy environments.", "paper_summary_zh": "為了解決現有網路攻擊偵測與識別模型中，魯棒性不足、特徵不穩定、資料雜訊干擾等問題，本文提出基於時域頻譜的攻擊流量偵測與識別方法。首先，透過滑動視窗將流量資料進行分段，建構網路流量的特徵序列與對應標籤序列。接著，應用所提出的頻譜標籤產生方法 SSPE 與 COAP，將標籤序列轉換為頻譜標籤，並將特徵序列轉換為時域特徵。頻譜標籤與時域特徵用於擷取與表示攻擊的行為模式。最後，將建構的時域特徵與頻譜標籤用於模型訓練，後續偵測與識別網路攻擊行為。實驗結果顯示，與傳統方法相比，使用 SSPE 或 COAP 方法訓練的模型，識別準確度提升 10%，且展現強大的魯棒性，特別是在雜訊環境中。", "author": "Wenwei Xie et.al.", "authors": "Wenwei Xie, Jie Yin, Zihao Chen", "id": "2411.07510v1", "paper_url": "http://arxiv.org/abs/2411.07510v1", "repo": "https://github.com/jim-xie-cn/Research-SSPE-COPA"}}