{"2412.18090": {"publish_time": "2024-12-24", "title": "Multi-Point Positional Insertion Tuning for Small Object Detection", "paper_summary": "Small object detection aims to localize and classify small objects within\nimages. With recent advances in large-scale vision-language pretraining,\nfinetuning pretrained object detection models has emerged as a promising\napproach. However, finetuning large models is computationally and memory\nexpensive. To address this issue, this paper introduces multi-point positional\ninsertion (MPI) tuning, a parameter-efficient finetuning (PEFT) method for\nsmall object detection. Specifically, MPI incorporates multiple positional\nembeddings into a frozen pretrained model, enabling the efficient detection of\nsmall objects by providing precise positional information to latent features.\nThrough experiments, we demonstrated the effectiveness of the proposed method\non the SODA-D dataset. MPI performed comparably to conventional PEFT methods,\nincluding CoOp and VPT, while significantly reducing the number of parameters\nthat need to be tuned.", "paper_summary_zh": "小型物件偵測旨在定位和分類影像中的小型物件。隨著大規模視覺語言預訓練的最新進展，微調預訓練物件偵測模型已成為一種有前途的方法。然而，微調大型模型在運算和記憶體方面成本很高。為了解決這個問題，本文介紹多點位置插入 (MPI) 調整，這是一種針對小型物件偵測的參數有效微調 (PEFT) 方法。具體來說，MPI 將多個位置嵌入整合到凍結的預訓練模型中，透過提供精準的位置資訊給潛在特徵，進而有效偵測小型物件。透過實驗，我們在 SODA-D 資料集上證明了所提出方法的有效性。MPI 的表現與傳統的 PEFT 方法相當，包括 CoOp 和 VPT，同時大幅減少需要調整的參數量。", "author": "Kanoko Goto et.al.", "authors": "Kanoko Goto, Takumi Karasawa, Takumi Hirose, Rei Kawakami, Nakamasa Inoue", "id": "2412.18090v1", "paper_url": "http://arxiv.org/abs/2412.18090v1", "repo": "null"}}