{"2501.08977": {"publish_time": "2025-01-15", "title": "Development and Validation of the Provider Documentation Summarization Quality Instrument for Large Language Models", "paper_summary": "As Large Language Models (LLMs) are integrated into electronic health record\n(EHR) workflows, validated instruments are essential to evaluate their\nperformance before implementation. Existing instruments for provider\ndocumentation quality are often unsuitable for the complexities of\nLLM-generated text and lack validation on real-world data. The Provider\nDocumentation Summarization Quality Instrument (PDSQI-9) was developed to\nevaluate LLM-generated clinical summaries. Multi-document summaries were\ngenerated from real-world EHR data across multiple specialties using several\nLLMs (GPT-4o, Mixtral 8x7b, and Llama 3-8b). Validation included Pearson\ncorrelation for substantive validity, factor analysis and Cronbach's alpha for\nstructural validity, inter-rater reliability (ICC and Krippendorff's alpha) for\ngeneralizability, a semi-Delphi process for content validity, and comparisons\nof high-versus low-quality summaries for discriminant validity. Seven physician\nraters evaluated 779 summaries and answered 8,329 questions, achieving over 80%\npower for inter-rater reliability. The PDSQI-9 demonstrated strong internal\nconsistency (Cronbach's alpha = 0.879; 95% CI: 0.867-0.891) and high\ninter-rater reliability (ICC = 0.867; 95% CI: 0.867-0.868), supporting\nstructural validity and generalizability. Factor analysis identified a 4-factor\nmodel explaining 58% of the variance, representing organization, clarity,\naccuracy, and utility. Substantive validity was supported by correlations\nbetween note length and scores for Succinct (rho = -0.200, p = 0.029) and\nOrganized ($\\rho = -0.190$, $p = 0.037$). Discriminant validity distinguished\nhigh- from low-quality summaries ($p < 0.001$). The PDSQI-9 demonstrates robust\nconstruct validity, supporting its use in clinical practice to evaluate\nLLM-generated summaries and facilitate safer integration of LLMs into\nhealthcare workflows.", "paper_summary_zh": "<paragraph>隨著大型語言模型 (LLM) 整合到電子病歷\n(EHR) 工作流程中，在實施之前，經過驗證的儀器對於評估其\n效能至關重要。現有的提供者文件品質儀器通常不適合\nLLM 生成的文字的複雜性，且缺乏對真實世界資料的驗證。提供者\n文件摘要品質儀器 (PDSQI-9) 是為了評估 LLM 生成的臨床摘要而\n開發的。使用多個 LLM（GPT-4o、Mixtral 8x7b 和 Llama 3-8b），\n從跨多個專科的真實世界 EHR 資料中產生了多文件摘要。驗證包括\n皮爾森相關性（實質效度）、因子分析和克朗巴赫 α（結構效度）、\n評分者間信度（ICC 和 Krippendorff α）（概化性）、內容效度的半德爾\n菲程序，以及比較高品質和低品質摘要（判別效度）。七位醫師\n評分者評估了 779 份摘要並回答了 8,329 個問題，評分者間信度達\n到了 80% 以上。PDSQI-9 表現出強大的內部一致性（克朗巴赫 α =\n0.879；95% CI：0.867-0.891）和高評分者間信度（ICC = 0.867；95%\nCI：0.867-0.868），支持結構效度和概化性。因子分析識別出一個\n4 因子模型，解釋了 58% 的變異，代表組織、清晰度、準確性和實用\n性。實質效度受到備忘錄長度與簡潔（rho = -0.200，p = 0.029）和\n條理（$\\rho = -0.190$，$p = 0.037$）的分數之間相關性的支持。判別\n效度區分了高品質和低品質摘要（$p < 0.001$）。PDSQI-9 展示了強健\n的建構效度，支持在臨床實務中使用它來評估 LLM 生成的摘要，並\n促進 LLM 更安全的整合到醫療保健工作流程中。</paragraph>", "author": "Emma Croxford et.al.", "authors": "Emma Croxford, Yanjun Gao, Nicholas Pellegrino, Karen K. Wong, Graham Wills, Elliot First, Miranda Schnier, Kyle Burton, Cris G. Ebby, Jillian Gorskic, Matthew Kalscheur, Samy Khalil, Marie Pisani, Tyler Rubeor, Peter Stetson, Frank Liao, Cherodeep Goswami, Brian Patterson, Majid Afshar", "id": "2501.08977v2", "paper_url": "http://arxiv.org/abs/2501.08977v2", "repo": "null"}}