{"2412.12651": {"publish_time": "2024-12-17", "title": "Shared Attention-based Autoencoder with Hierarchical Fusion-based Graph Convolution Network for sEEG SOZ Identification", "paper_summary": "Diagnosing seizure onset zone (SOZ) is a challenge in neurosurgery, where\nstereoelectroencephalography (sEEG) serves as a critical technique. In sEEG SOZ\nidentification, the existing studies focus solely on the intra-patient\nrepresentation of epileptic information, overlooking the general features of\nepilepsy across patients and feature interdependencies between feature elements\nin each contact site. In order to address the aforementioned challenges, we\npropose the shared attention-based autoencoder (sATAE). sATAE is trained by\nsEEG data across all patients, with attention blocks introduced to enhance the\nrepresentation of interdependencies between feature elements. Considering the\nspatial diversity of sEEG across patients, we introduce graph-based method for\nidentification SOZ of each patient. However, the current graph-based methods\nfor sEEG SOZ identification rely exclusively on static graphs to model\nepileptic networks. Inspired by the finding of neuroscience that epileptic\nnetwork is intricately characterized by the interplay of sophisticated\nequilibrium between fluctuating and stable states, we design the hierarchical\nfusion-based graph convolution network (HFGCN) to identify the SOZ. HFGCN\nintegrates the dynamic and static characteristics of epileptic networks through\nhierarchical weighting across different hierarchies, facilitating a more\ncomprehensive learning of epileptic features and enriching node information for\nsEEG SOZ identification. Combining sATAE and HFGCN, we perform comprehensive\nexperiments with sATAE-HFGCN on the self-build sEEG dataset, which includes\nsEEG data from 17 patients with temporal lobe epilepsy. The results show that\nour method, sATAE-HFGCN, achieves superior performance for identifying the SOZ\nof each patient, effectively addressing the aforementioned challenges,\nproviding an efficient solution for sEEG-based SOZ identification.", "paper_summary_zh": "診斷癲癇發作區域 (SOZ) 是神經外科中的一項挑戰，其中立體腦電圖 (sEEG) 是一種關鍵技術。在 sEEG SOZ 識別中，現有研究僅關注癲癇信息的患者內部表現，而忽略了癲癇患者的共同特徵和每個接觸位點特徵元素之間的相互依賴性。為了應對上述挑戰，我們提出了基於共享注意力的自動編碼器 (sATAE)。sATAE 通過所有患者的 sEEG 數據進行訓練，並引入注意力塊來增強特徵元素之間的相互依賴性的表現。考慮到患者之間 sEEG 的空間多樣性，我們引入了基於圖形的方法來識別每個患者的 SOZ。然而，當前基於圖形的方法對於 sEEG SOZ 識別僅依賴於靜態圖形來建模癲癇網絡。受神經科學發現的啟發，即癲癇網絡的複雜特徵在於波動狀態和穩定狀態之間複雜的平衡相互作用，我們設計了基於分層融合的圖形卷積網絡 (HFGCN) 來識別 SOZ。HFGCN 通過跨不同層級的分層加權整合癲癇網絡的動態和靜態特徵，促進對癲癇特徵的更全面學習，並豐富 sEEG SOZ 識別的節點信息。通過結合 sATAE 和 HFGCN，我們對自建 sEEG 數據集進行了全面的 sATAE-HFGCN 實驗，其中包括來自 17 名顳葉癲癇患者的 sEEG 數據。結果表明，我們的 sATAE-HFGCN 方法在識別每個患者的 SOZ 方面取得了卓越的性能，有效應對了上述挑戰，為基於 sEEG 的 SOZ 識別提供了有效的解決方案。", "author": "Huachao Yan et.al.", "authors": "Huachao Yan, Kailing Guo, Shiwei Song, Yihai Dai, Xiaoqiang Wei, Xiaofen Xing, Xiangmin Xu", "id": "2412.12651v1", "paper_url": "http://arxiv.org/abs/2412.12651v1", "repo": "null"}}