{"2410.13597": {"publish_time": "2024-10-17", "title": "Text-Guided Multi-Property Molecular Optimization with a Diffusion Language Model", "paper_summary": "Molecular optimization (MO) is a crucial stage in drug discovery in which\ntask-oriented generated molecules are optimized to meet practical industrial\nrequirements. Existing mainstream MO approaches primarily utilize external\nproperty predictors to guide iterative property optimization. However, learning\nall molecular samples in the vast chemical space is unrealistic for predictors.\nAs a result, errors and noise are inevitably introduced during property\nprediction due to the nature of approximation. This leads to discrepancy\naccumulation, generalization reduction and suboptimal molecular candidates. In\nthis paper, we propose a text-guided multi-property molecular optimization\nmethod utilizing transformer-based diffusion language model (TransDLM).\nTransDLM leverages standardized chemical nomenclature as semantic\nrepresentations of molecules and implicitly embeds property requirements into\ntextual descriptions, thereby preventing error propagation during diffusion\nprocess. Guided by physically and chemically detailed textual descriptions,\nTransDLM samples and optimizes encoded source molecules, retaining core\nscaffolds of source molecules and ensuring structural similarities. Moreover,\nTransDLM enables simultaneous sampling of multiple molecules, making it ideal\nfor scalable, efficient large-scale optimization through distributed\ncomputation on web platforms. Furthermore, our approach surpasses\nstate-of-the-art methods in optimizing molecular structural similarity and\nenhancing chemical properties on the benchmark dataset. The code is available\nat: https://anonymous.4open.science/r/TransDLM-A901.", "paper_summary_zh": "分子最佳化 (MO) 是藥物發現中至關重要的階段，其中以任務為導向產生的分子經過最佳化以符合實際的產業需求。現有的主流 MO 方法主要利用外部屬性預測器來引導反覆的屬性最佳化。然而，對於預測器來說，學習廣大化學空間中的所有分子範例是不切實際的。因此，由於近似本質，在屬性預測過程中難免會引入錯誤和雜訊。這會導致差異累積、概化減少和次佳分子候選。在本文中，我們提出一個由文字引導的多屬性分子最佳化方法，利用基於 Transformer 的擴散語言模型 (TransDLM)。TransDLM 利用標準化的化學命名法作為分子的語義表示，並將屬性需求隱式嵌入文字描述中，從而防止在擴散過程中發生錯誤傳播。在物理和化學詳細文字描述的引導下，TransDLM 對編碼的來源分子進行取樣和最佳化，保留來源分子的核心骨架並確保結構相似性。此外，TransDLM 能同時對多個分子進行取樣，使其非常適合透過網路平台上的分散式運算進行可擴充、高效的大規模最佳化。此外，我們的做法在最佳化分子結構相似性和提升基準資料集上的化學屬性方面超越了最先進的方法。程式碼可在以下網址取得：https://anonymous.4open.science/r/TransDLM-A901。", "author": "Yida Xiong et.al.", "authors": "Yida Xiong, Kun Li, Weiwei Liu, Jia Wu, Bo Du, Shirui Pan, Wenbin Hu", "id": "2410.13597v1", "paper_url": "http://arxiv.org/abs/2410.13597v1", "repo": "null"}}