{"2412.15589": {"publish_time": "2024-12-20", "title": "Pre-training Graph Neural Networks on Molecules by Using Subgraph-Conditioned Graph Information Bottleneck", "paper_summary": "This study aims to build a pre-trained Graph Neural Network (GNN) model on\nmolecules without human annotations or prior knowledge. Although various\nattempts have been proposed to overcome limitations in acquiring labeled\nmolecules, the previous pre-training methods still rely on semantic subgraphs,\ni.e., functional groups. Only focusing on the functional groups could overlook\nthe graph-level distinctions. The key challenge to build a pre-trained GNN on\nmolecules is how to (1) generate well-distinguished graph-level representations\nand (2) automatically discover the functional groups without prior knowledge.\nTo solve it, we propose a novel Subgraph-conditioned Graph Information\nBottleneck, named S-CGIB, for pre-training GNNs to recognize core subgraphs\n(graph cores) and significant subgraphs. The main idea is that the graph cores\ncontain compressed and sufficient information that could generate\nwell-distinguished graph-level representations and reconstruct the input graph\nconditioned on significant subgraphs across molecules under the S-CGIB\nprinciple. To discover significant subgraphs without prior knowledge about\nfunctional groups, we propose generating a set of functional group candidates,\ni.e., ego networks, and using an attention-based interaction between the graph\ncore and the candidates. Despite being identified from self-supervised\nlearning, our learned subgraphs match the real-world functional groups.\nExtensive experiments on molecule datasets across various domains demonstrate\nthe superiority of S-CGIB.", "paper_summary_zh": "本研究旨在建立一個預訓練圖形神經網路 (GNN) 模型，在分子上無需人工註解或先驗知識。雖然已提出各種嘗試來克服獲取標記分子的限制，但先前的預訓練方法仍然依賴於語義子圖，即官能基。僅關注官能基可能會忽略圖形層面的區別。在分子上建立預訓練 GNN 的關鍵挑戰是如何 (1) 生成區分良好的圖形層面表示，以及 (2) 在沒有先驗知識的情況下自動發現官能基。為了解決此問題，我們提出一個名為 S-CGIB 的新子圖條件圖形資訊瓶頸，用於預訓練 GNN 以識別核心子圖（圖形核心）和重要子圖。主要想法是圖形核心包含壓縮且足夠的資訊，可以在 S-CGIB 原則下生成區分良好的圖形層面表示，並根據分子上的重要子圖重建輸入圖形。為了在沒有關於官能基的先驗知識的情況下發現重要子圖，我們建議生成一組官能基候選，即自我網路，並使用基於注意力的圖形核心和候選之間的交互作用。儘管從自我監督學習中識別出來，但我們學習到的子圖與現實世界的官能基相匹配。跨越各種領域的分子資料集上的廣泛實驗證明了 S-CGIB 的優越性。", "author": "Van Thuy Hoang et.al.", "authors": "Van Thuy Hoang, O-Joun Lee", "id": "2412.15589v1", "paper_url": "http://arxiv.org/abs/2412.15589v1", "repo": "null"}}