{"2501.05555": {"publish_time": "2025-01-09", "title": "Improving Zero-Shot Object-Level Change Detection by Incorporating Visual Correspondence", "paper_summary": "Detecting object-level changes between two images across possibly different\nviews is a core task in many applications that involve visual inspection or\ncamera surveillance. Existing change-detection approaches suffer from three\nmajor limitations: (1) lack of evaluation on image pairs that contain no\nchanges, leading to unreported false positive rates; (2) lack of\ncorrespondences (\\ie, localizing the regions before and after a change); and\n(3) poor zero-shot generalization across different domains. To address these\nissues, we introduce a novel method that leverages change correspondences (a)\nduring training to improve change detection accuracy, and (b) at test time, to\nminimize false positives. That is, we harness the supervision labels of where\nan object is added or removed to supervise change detectors, improving their\naccuracy over previous work by a large margin. Our work is also the first to\npredict correspondences between pairs of detected changes using estimated\nhomography and the Hungarian algorithm. Our model demonstrates superior\nperformance over existing methods, achieving state-of-the-art results in change\ndetection and change correspondence accuracy across both in-distribution and\nzero-shot benchmarks.", "paper_summary_zh": "偵測兩個影像之間的物件層級變動，在視覺檢查或攝影機監控等許多應用中都是核心任務。現有的變動偵測方法有三個主要的限制：(1) 缺乏對不含變動的影像對進行評估，導致未報告的假陽性率；(2) 缺乏對應關係（即，在變動前後定位區域）；以及 (3) 在不同領域的零次學習泛化能力差。為了解決這些問題，我們引入一種新方法，利用變動對應關係：(a) 在訓練期間提升變動偵測準確度，以及 (b) 在測試時，將假陽性降到最低。也就是說，我們利用物件新增或移除位置的監督標籤來監督變動偵測器，大幅提升其準確度，優於先前的研究。我們的研究也是第一個使用估計單應性和匈牙利演算法來預測偵測變動對之間的對應關係。我們的模型展現出優於現有方法的效能，在變動偵測和變動對應準確度方面，在分配內和零次學習基準測試中均達到最先進的結果。", "author": "Hung Huy Nguyen et.al.", "authors": "Hung Huy Nguyen, Pooyan Rahmanzadehgervi, Long Mail, Anh Totti Nguyen", "id": "2501.05555v1", "paper_url": "http://arxiv.org/abs/2501.05555v1", "repo": "https://github.com/anguyen8/image-diff"}}