{"2412.08054": {"publish_time": "2024-12-11", "title": "Federated In-Context LLM Agent Learning", "paper_summary": "Large Language Models (LLMs) have revolutionized intelligent services by\nenabling logical reasoning, tool use, and interaction with external systems as\nagents. The advancement of LLMs is frequently hindered by the scarcity of\nhigh-quality data, much of which is inherently sensitive. Federated learning\n(FL) offers a potential solution by facilitating the collaborative training of\ndistributed LLMs while safeguarding private data. However, FL frameworks face\nsignificant bandwidth and computational demands, along with challenges from\nheterogeneous data distributions. The emerging in-context learning capability\nof LLMs offers a promising approach by aggregating natural language rather than\nbulky model parameters. Yet, this method risks privacy leakage, as it\nnecessitates the collection and presentation of data samples from various\nclients during aggregation. In this paper, we propose a novel\nprivacy-preserving Federated In-Context LLM Agent Learning (FICAL) algorithm,\nwhich to our best knowledge for the first work unleashes the power of\nin-context learning to train diverse LLM agents through FL. In our design,\nknowledge compendiums generated by a novel LLM-enhanced Knowledge Compendiums\nGeneration (KCG) module are transmitted between clients and the server instead\nof model parameters in previous FL methods. Apart from that, an incredible\nRetrieval Augmented Generation (RAG) based Tool Learning and Utilizing (TLU)\nmodule is designed and we incorporate the aggregated global knowledge\ncompendium as a teacher to teach LLM agents the usage of tools. We conducted\nextensive experiments and the results show that FICAL has competitive\nperformance compared to other SOTA baselines with a significant communication\ncost decrease of $\\mathbf{3.33\\times10^5}$ times.", "paper_summary_zh": "<paragraph>大型語言模型 (LLM) 透過讓代理人進行邏輯推理、使用工具以及與外部系統互動，進而革新了智慧服務。LLM 的進展經常受到高品質資料短缺的阻礙，其中許多資料本質上是敏感的。聯合學習 (FL) 提供了一個潛在的解決方案，它促進了分散式 LLM 的協作訓練，同時保護了私人資料。然而，FL 框架面臨著顯著的頻寬和運算需求，以及異質資料分佈帶來的挑戰。LLM 新興的語境學習能力提供了一個有前途的方法，它聚合自然語言，而不是龐大的模型參數。然而，此方法有隱私外洩的風險，因為它需要在聚合過程中收集和呈現來自不同客戶端的資料樣本。在本文中，我們提出了一種新穎的隱私保護聯合語境 LLM 代理學習 (FICAL) 演算法，根據我們所知，這是第一個發揮語境學習的力量，透過 FL 訓練多樣化的 LLM 代理。在我們的設計中，由新穎的 LLM 增強的知識彙編生成 (KCG) 模組產生的知識彙編在客戶端和伺服器之間傳輸，而不是先前 FL 方法中的模型參數。除此之外，我們設計了一個基於令人難以置信的檢索增強生成 (RAG) 的工具學習和利用 (TLU) 模組，並將聚合的全球知識彙編作為老師，教導 LLM 代理如何使用工具。我們進行了廣泛的實驗，結果顯示 FICAL 與其他 SOTA 基準相比具有競爭力的效能，同時將通訊成本大幅降低 $\\mathbf{3.33\\times10^5}$ 倍。</paragraph>", "author": "Panlong Wu et.al.", "authors": "Panlong Wu, Kangshuo Li, Junbao Nan, Fangxin Wang", "id": "2412.08054v1", "paper_url": "http://arxiv.org/abs/2412.08054v1", "repo": "null"}}