{"2412.13912": {"publish_time": "2024-12-18", "title": "Energy-Efficient SLAM via Joint Design of Sensing, Communication, and Exploration Speed", "paper_summary": "To support future spatial machine intelligence applications, lifelong\nsimultaneous localization and mapping (SLAM) has drawn significant attentions.\nSLAM is usually realized based on various types of mobile robots performing\nsimultaneous and continuous sensing and communication. This paper focuses on\nanalyzing the energy efficiency of robot operation for lifelong SLAM by jointly\nconsidering sensing, communication and mechanical factors. The system model is\nbuilt based on a robot equipped with a 2D light detection and ranging (LiDAR)\nand an odometry. The cloud point raw data as well as the odometry data are\nwirelessly transmitted to data center where real-time map reconstruction is\nrealized based on an unsupervised deep learning based method. The sensing\nduration, transmit power, transmit duration and exploration speed are jointly\noptimized to minimize the energy consumption. Simulations and experiments\ndemonstrate the performance of our proposed method.", "paper_summary_zh": "為了支援未來的空間機器智慧應用，終身同步定位與地圖繪製 (SLAM) 已經引起廣泛的關注。SLAM 通常是根據各種類型的行動機器人執行同步且持續的感測和通訊而實現。本文重點在於分析機器人運作的能源效率，以進行終身 SLAM，並同時考慮感測、通訊和機械因素。系統模型是根據配備 2D 光偵測與測距 (LiDAR) 和里程計的機器人所建立。雲端點原始資料以及里程計資料會無線傳輸到資料中心，並根據非監督式深度學習方法進行即時地圖重建。感測持續時間、傳輸功率、傳輸持續時間和探索速度會共同最佳化，以將能源消耗降至最低。模擬和實驗證明了我們提出的方法的效能。", "author": "Zidong Han et.al.", "authors": "Zidong Han, Ruibo Jin, Xiaoyang Li, Bingpeng Zhou, Qinyu Zhang, Yi Gong", "id": "2412.13912v1", "paper_url": "http://arxiv.org/abs/2412.13912v1", "repo": "null"}}