{"2501.07808": {"publish_time": "2025-01-14", "title": "A Low-cost and Ultra-lightweight Binary Neural Network for Traffic Signal Recognition", "paper_summary": "The deployment of neural networks in vehicle platforms and wearable\nArtificial Intelligence-of-Things (AIOT) scenarios has become a research area\nthat has attracted much attention. With the continuous evolution of deep\nlearning technology, many image classification models are committed to\nimproving recognition accuracy, but this is often accompanied by problems such\nas large model resource usage, complex structure, and high power consumption,\nwhich makes it challenging to deploy on resource-constrained platforms. Herein,\nwe propose an ultra-lightweight binary neural network (BNN) model designed for\nhardware deployment, and conduct image classification research based on the\nGerman Traffic Sign Recognition Benchmark (GTSRB) dataset. In addition, we also\nverify it on the Chinese Traffic Sign (CTS) and Belgian Traffic Sign (BTS)\ndatasets. The proposed model shows excellent recognition performance with an\naccuracy of up to 97.64%, making it one of the best performing BNN models in\nthe GTSRB dataset. Compared with the full-precision model, the accuracy loss is\ncontrolled within 1%, and the parameter storage overhead of the model is only\n10% of that of the full-precision model. More importantly, our network model\nonly relies on logical operations and low-bit width fixed-point addition and\nsubtraction operations during the inference phase, which greatly simplifies the\ndesign complexity of the processing element (PE). Our research shows the great\npotential of BNN in the hardware deployment of computer vision models,\nespecially in the field of computer vision tasks related to autonomous driving.", "paper_summary_zh": "<paragraph>神經網路在車輛平台和可穿戴人工智慧物聯網（AIOT）場景中的部署已成為備受關注的研究領域。隨著深度學習技術的持續演進，許多影像分類模型致力於提升辨識準確度，但這也常伴隨著模型資源使用量大、結構複雜、耗能高等問題，使得在資源受限的平台上部署時面臨挑戰。本文提出一個專為硬體部署而設計的超輕量級二元神經網路（BNN）模型，並基於德國交通標誌辨識基準（GTSRB）資料集進行影像分類研究。此外，我們也驗證於中國交通標誌（CTS）和比利時交通標誌（BTS）資料集。所提出的模型展現優異的辨識效能，在 GTSRB 資料集上最高可達 97.64% 的準確度，使其成為效能最佳的 BNN 模型之一。與全精度模型相比，準確度損失控制在 1% 以內，且模型的參數儲存開銷僅為全精度模型的 10%。更重要的是，我們的網路模型在推理階段僅依賴邏輯運算和低位元寬度定點加法和減法運算，大幅簡化處理元件（PE）的設計複雜度。我們的研究顯示 BNN 在電腦視覺模型的硬體部署上具有極大的潛力，特別是在與自動駕駛相關的電腦視覺任務領域。</paragraph>", "author": "Mingke Xiao et.al.", "authors": "Mingke Xiao, Yue Su, Liang Yu, Guanglong Qu, Yutong Jia, Yukuan Chang, Xu Zhang", "id": "2501.07808v1", "paper_url": "http://arxiv.org/abs/2501.07808v1", "repo": "null"}}