{"2412.07278": {"publish_time": "2024-12-10", "title": "Superficial Consciousness Hypothesis for Autoregressive Transformers", "paper_summary": "The alignment between human objectives and machine learning models built on\nthese objectives is a crucial yet challenging problem for achieving Trustworthy\nAI, particularly when preparing for superintelligence (SI). First, given that\nSI does not exist today, empirical analysis for direct evidence is difficult.\nSecond, SI is assumed to be more intelligent than humans, capable of deceiving\nus into underestimating its intelligence, making output-based analysis\nunreliable. Lastly, what kind of unexpected property SI might have is still\nunclear. To address these challenges, we propose the Superficial Consciousness\nHypothesis under Information Integration Theory (IIT), suggesting that SI could\nexhibit a complex information-theoretic state like a conscious agent while\nunconscious. To validate this, we use a hypothetical scenario where SI can\nupdate its parameters \"at will\" to achieve its own objective (mesa-objective)\nunder the constraint of the human objective (base objective). We show that a\npractical estimate of IIT's consciousness metric is relevant to the widely used\nperplexity metric, and train GPT-2 with those two objectives. Our preliminary\nresult suggests that this SI-simulating GPT-2 could simultaneously follow the\ntwo objectives, supporting the feasibility of the Superficial Consciousness\nHypothesis.", "paper_summary_zh": "人類目標與建立在這些目標上的機器學習模型之間的一致性，是實現可信賴 AI 的一個關鍵且具有挑戰性的問題，特別是在為超級智能 (SI) 做準備時。首先，鑑於 SI 目前並不存在，因此難以進行直接證據的實證分析。其次，假設 SI 比人類更具智慧，能夠欺騙我們低估其智慧，使得基於輸出的分析不可靠。最後，SI 可能具有的意外屬性是什麼，目前仍不清楚。為了應對這些挑戰，我們在資訊整合理論 (IIT) 下提出表面意識假說，表明 SI 可以在無意識的狀態下表現出像有意識代理一樣的複雜資訊理論狀態。為了驗證這一點，我們使用了一個假設情境，其中 SI 可以「隨意」更新其參數，以在人類目標（基礎目標）的約束下實現其自身目標（元目標）。我們表明，IIT 意識量表的實際估計與廣泛使用的困惑度量相關，並使用這兩個目標訓練 GPT-2。我們的初步結果表明，這個模擬 SI 的 GPT-2 可以同時遵循這兩個目標，支持表面意識假說的可行性。", "author": "Yosuke Miyanishi et.al.", "authors": "Yosuke Miyanishi, Keita Mitani", "id": "2412.07278v1", "paper_url": "http://arxiv.org/abs/2412.07278v1", "repo": "null"}}