{"2501.07221": {"publish_time": "2025-01-13", "title": "Exploring the Use of Contrastive Language-Image Pre-Training for Human Posture Classification: Insights from Yoga Pose Analysis", "paper_summary": "Accurate human posture classification in images and videos is crucial for\nautomated applications across various fields, including work safety, physical\nrehabilitation, sports training, or daily assisted living. Recently, multimodal\nlearning methods, such as Contrastive Language-Image Pretraining (CLIP), have\nadvanced significantly in jointly understanding images and text. This study\naims to assess the effectiveness of CLIP in classifying human postures,\nfocusing on its application in yoga. Despite the initial limitations of the\nzero-shot approach, applying transfer learning on 15,301 images (real and\nsynthetic) with 82 classes has shown promising results. The article describes\nthe full procedure for fine-tuning, including the choice for image description\nsyntax, models and hyperparameters adjustment. The fine-tuned CLIP model,\ntested on 3826 images, achieves an accuracy of over 85%, surpassing the current\nstate-of-the-art of previous works on the same dataset by approximately 6%, its\ntraining time being 3.5 times lower than what is needed to fine-tune a\nYOLOv8-based model. For more application-oriented scenarios, with smaller\ndatasets of six postures each, containing 1301 and 401 training images, the\nfine-tuned models attain an accuracy of 98.8% and 99.1%, respectively.\nFurthermore, our experiments indicate that training with as few as 20 images\nper pose can yield around 90% accuracy in a six-class dataset. This study\ndemonstrates that this multimodal technique can be effectively used for yoga\npose classification, and possibly for human posture classification, in general.\nAdditionally, CLIP inference time (around 7 ms) supports that the model can be\nintegrated into automated systems for posture evaluation, e.g., for developing\na real-time personal yoga assistant for performance assessment.", "paper_summary_zh": "在图像和视频中准确地对人体姿势进行分类对于各个领域的自动化应用程序至关重要，包括工作安全、身体康复、体育训练或日常辅助生活。最近，多模态学习方法（如对比语言图像预训练 (CLIP)）在联合理解图像和文本方面取得了显著进展。本研究旨在评估 CLIP 在人体姿势分类中的有效性，重点关注其在瑜伽中的应用。尽管零样本学习方法最初存在局限性，但对 15,301 张图像（真实和合成）应用迁移学习，并使用 82 个类别，已显示出有希望的结果。本文描述了微调的完整过程，包括图像描述语法、模型和超参数调整的选择。经过微调的 CLIP 模型在 3826 张图像上进行测试，准确率超过 85%，比以前在同一数据集上进行的研究的当前最先进水平高出约 6%，其训练时间比微调基于 YOLOv8 的模型所需时间低 3.5 倍。对于更面向应用程序的场景，每个姿势的数据集较小，各包含 1301 张和 401 张训练图像，微调后的模型分别达到 98.8% 和 99.1% 的准确率。此外，我们的实验表明，每个姿势仅使用 20 张图像进行训练，在六类数据集中的准确率可达到约 90%。本研究表明，这种多模态技术可有效用于瑜伽姿势分类，甚至可用于一般的人体姿势分类。此外，CLIP 推断时间（约 7 毫秒）支持将该模型集成到姿势评估的自动化系统中，例如，用于开发用于性能评估的实时个人瑜伽助手。", "author": "Andrzej D. Dobrzycki et.al.", "authors": "Andrzej D. Dobrzycki, Ana M. Bernardos, Luca Bergesio, Andrzej Pomirski, Daniel Sáez-Trigueros", "id": "2501.07221v1", "paper_url": "http://arxiv.org/abs/2501.07221v1", "repo": "null"}}