{"2412.03107": {"publish_time": "2024-12-04", "title": "CredID: Credible Multi-Bit Watermark for Large Language Models Identification", "paper_summary": "Large Language Models (LLMs) are widely used in complex natural language\nprocessing tasks but raise privacy and security concerns due to the lack of\nidentity recognition. This paper proposes a multi-party credible watermarking\nframework (CredID) involving a trusted third party (TTP) and multiple LLM\nvendors to address these issues. In the watermark embedding stage, vendors\nrequest a seed from the TTP to generate watermarked text without sending the\nuser's prompt. In the extraction stage, the TTP coordinates each vendor to\nextract and verify the watermark from the text. This provides a credible\nwatermarking scheme while preserving vendor privacy. Furthermore, current\nwatermarking algorithms struggle with text quality, information capacity, and\nrobustness, making it challenging to meet the diverse identification needs of\nLLMs. Thus, we propose a novel multi-bit watermarking algorithm and an\nopen-source toolkit to facilitate research. Experiments show our CredID\nenhances watermark credibility and efficiency without compromising text\nquality. Additionally, we successfully utilized this framework to achieve\nhighly accurate identification among multiple LLM vendors.", "paper_summary_zh": "大型語言模型 (LLM) 廣泛用於複雜的自然語言處理任務，但由於缺乏身分識別，因此引發了隱私和安全問題。本文提出了一個多方可信浮水印架構 (CredID)，其中涉及一個受信任的第三方 (TTP) 和多個 LLM 供應商，以解決這些問題。在浮水印嵌入階段，供應商會向 TTP 要求一個種子，以產生浮水印文字，而不用傳送使用者的提示。在萃取階段，TTP 會協調每個供應商，以從文字中萃取和驗證浮水印。這提供了一個可信的浮水印架構，同時保護供應商的隱私。此外，目前的浮水印演算法在文字品質、資訊容量和穩健性方面都面臨挑戰，這使得難以滿足 LLM 多樣化的識別需求。因此，我們提出了一種新穎的多位元浮水印演算法和一個開源工具包，以利於研究。實驗顯示，我們的 CredID 增強了浮水印的可信度和效率，同時不損害文字品質。此外，我們成功地利用這個架構，在多個 LLM 供應商之間達到了高度準確的識別。", "author": "Haoyu Jiang et.al.", "authors": "Haoyu Jiang, Xuhong Wang, Ping Yi, Shanzhe Lei, Yilun Lin", "id": "2412.03107v1", "paper_url": "http://arxiv.org/abs/2412.03107v1", "repo": "null"}}